{"text": "Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Kack wie SSService Dann machen wir es so, dann wird es jedes Mal neu angelegt, aber wir können es einfach so machen. War random gleich Nuda, es ist dann halt bei jeder Anfrage eine neue Instanz, die ist ja nicht wirklich schlimm. So random, keine Ahnung, number, number, random, next, so von 0 bis 360, in C sharp ist es nämlich exclusive, das heißt, das ist jetzt eine random Nummer von 0 inklusive 0 bis exklu- mal gucken ob das stimmt, ich glaube aber schon. Exclusive 360, also es ist, es ist 0, 0 taucht auf bis 300, bis inklusive 359. So, ok. Und das hauen wir jetzt hier rein. Und dann sollte unser Keck WSS Service schon soweit fertig sein, dass der, dass der Keck weht. I, hallo, I, äh nicht I, N, ok, schauen wir mal, ha, Leute, es ist Keck WSS Service, es funktioniert, ok, nochmal kurzer recap, was wir jetzt gemacht haben. Ist es nicht geil, das hat die Welt gebraucht, das hat die Welt gebraucht. Die Transparenz wird im Browser nicht richtig angezeigt. Hey, ich bin ein Risiko Investor, natürlich, ähm, war mir schon klar, du bist ja schon eine Weile am Start, ich hab's schon öfters gesehen, aber, äh, ich dachte schon immer, schon immer bei deinen Messages, das ist bestimmt ein Risiko Investor und würde gerne absurde Summen in ihr Startup investieren, wir glauben ihr Service hat das Potenzial, das nächste Google FB überzuwerden, bitte kontaktieren sie, ey, Fang, Fang ist out, wenn erstmal Keck WSS Service kommt, da sagen die Leute nicht mehr, sie wollen einen Fang Job, die sagen, sie wollen ein Keck W, ein Keck W, nein, das sind ja die Amis, die sagen, ich bin ein Keck W, ein Keck W Job, Tongenbrecher, kannst du ein Autorefresh machen, ja, aber wozu, so, willst du noch ne API machen, na ist doch, du machst die Seite auf, nur kommst ein Bild zurück, ok, wunderbar, unsere extrem advanced Keck WSS Service Anwendung ist fertig, übrigens, nochmal eine Runde Sellout, wenn ihr auch nen virtuellen Linux Server in der Cloud haben wollt, dann schaut jetzt mal bei meinem Partner Hetzner Cloud vorbei, geht schon los bei 3€ im Monat und wenn ihr jetzt nen Server mietet, bzw. euch einen neuen Account habt, und den ganzen, wo hab ich, fuck, ich find's nicht, lull, ah hier, sehr gut, sehr gut Chat, und das ganze registriert mit meinem Account, alter, ich kann nicht reden, Leute, Sellout gescheitert, Sellout gescheitert, vorbei, vorbei, jetzt kann ich nicht mal Sellouten, Kündigung ist raus, äh, jetzt vorbei, IP-Adresse merkt man beim nächsten Reload das Bild senden, nein, ja, zumindest, wenn ihr euch registriert mit meinem Code, kriegt ihr ein 20€ Startgutschein, Startguthaben, allerdings nur für neue Kunden, gegen Fake Accounts weiß ich nicht, ob sie was haben, der Sellout ist richtig sad gewesen, ja, zwar der schlechteste Sellout aller Zeiten, ist der Frazier on, guck mal so, ist der Frazier on, nein, ah, der war wieder ewig nicht on, okay, CACW erste Service, okay, machen wir weiter, also unser Webservice ist jetzt fertig, das Ziel ist jetzt, also wir folgen das machen, Web-Anwendung erstellen, Server einrichten, reproduzierbar mit Ansible, und dann schieben wir das ganze auf den Server, nur mal kurzer Recap, vielleicht hat noch nicht jeder so eine ASP.NET Web-Anwendung gesehen, deswegen zeige ich das nochmal ganz kurz, was es macht, es ist aber wirklich, ihr habt ja gesehen, es ist äußerst wenig, also die einzigen zwei Dateien, die ich angepasst habe, waren einmal die Startup-Datei, da habe ich alles rausgeschmissen, wo hier irgendwas von HTTPS oder irgendwelche API-Generierung drin steht, alles weg, das ist der Rest, ist aber komplett Default, und ich habe den Standard-Controller umbenannt in CACW-Controller und habe ihm gesagt, dass er direkt auf dem Route der Seite aktiv sein soll, und sobald man die Seite aufmacht, wird diese Methode hier aufgerufen mit GET, also wenn du ein GET-Request drauf machst, wird diese Methode aufgerufen, und er macht nichts anderes, wie aus diesem Ordner ein random Bild zu lesen und zurückzugeben. Mehr macht das nicht. Das war's, also mehr Anpassungen gibt es da dran nicht. So, und das reicht schon für CACW SSS-Service, und jetzt werden wir CACW SSS-Service mal in der Cloud laufen lassen, dass ihr auch alle eine Runde CACW'en können SSS-Service. Und da ist für jeden Winkel ein Bild drin, genau. Wir machen das nicht dynamisch, wir machen das nicht dynamisch oder sowas, wir haben im Vorfeld 360 Grad CACW erstellt. Und dafür wird immer random eins rausgenommen. Ist natürlich auch gut entlastet den Server, da müssen wir nix on the fly rotaten. Könnten wir vielleicht irgendwann demnächst, das ist eine coole Sache, dass wir ein bisschen Programmier-Content für den zweiten Teil oder dritten Teil noch haben. Server-Side-Bild-Rotieren. Dynamisch. Ja, da könnte man auch eine API machen, Rotate, und dann irgendwie sowas wie Decrease angeben oder sowas. Big Brain Time, können wir das nächste Mal anbauen, haben wir was zu programmieren. Gut, also, was haben wir hier? Wir haben unser Master Shit Repo am Start, geht Status, und jetzt machen wir ein Ansible Repo, weil, Ansible, weil wir wollen ja, und das kann ich euch, es ist erstmal egal mit welchem Tool, aber ich kann euch das prinzipiell nur empfehlen, wenn ihr Server aufbaut für Services, die jetzt nicht einfach nur mal angelegt werden und dann wieder wegschmeißen, weil man mal was ausprobieren wollt, also wenn ihr irgendwas seriöseres hosten wollt, irgendwas, was vielleicht auch mal ein bisschen länger als zwei Tage abbleibt, dann kann ich euch nur empfehlen, in irgendeiner Art und Weise, zumal mal mindestens mal aufzuschreiben, wie ihr den Server eingerichtet habt, was da für Packages drauf sind und sonst was, oder aber noch besser, das ganze in irgendeinem Skript oder mit irgendeinem Automatisierungstool zu machen, dass ihr den gleichen Server immer wieder reproduzierbar aufbauen könnt, oder eventuell auch noch fünf weitere dieser Server reproduzierbar aufbauen könnt. Das ist ja gerade eine der Punkte, warum dieses ganze Containerzeug so beliebt geworden ist. Ja, du kannst Container relativ easy immer gleich wieder aufbauen und dementsprechend auch mit irgendeinem Orchestrator einfach skalieren lassen. Brauchst du heute für 50 User was, brauchst du nur zwei, hast du morgen 5000 User, brauchst du 20. Ist für euch ein Dockerfile Ansible gleich Dokumentation? Wenn es ordentlicher Source Code ist, ja. Wenn man es lesen kann. Ich meine, niemand braucht doch da Files, wo dann drinne steht. Keine Ahnung, so, sagen wir mal hier in if, if n größer fünf, ja. Es braucht doch niemand Kommentare, wo dann drinne steht, checks if n is greater than five. Das ist bescheuert, das sieht man ja. Und dementsprechend, wenn das alles selbsterklärend ist, bräuchte auch kein extra Doku Zeug für. Für zusätzliche Erklärung ist es natürlich sinnvoll, ne. Was du in Ansible ja nicht reinschreiben kannst ist, warum nimmst du diese Packages? Ich meine, kannst du schon reinschreiben, aber ich befürchte mal, das wird da aber keiner drin aktualisieren, außerdem musst du da ein neues Commit machen, um die Comments zu aktualisieren. Sprich, wenn du bei Ansible zum Beispiel sagst, wir installieren diese fünf Packages, und du willst irgendwie für die Nachwelt vorhalten, für die Nachwelt festhalten, warum man diese Packages genommen hat, dann würde ich das auf n extra Wiki oder so schreiben. Genau, also, es gibt da verschiedene Tools für Server-Automatisierung. Das bekannteste dürfte wohl Puppet sein, das ist aber n bisschen Keynes-Champig, find ich. Sieht so aus. Ja, du sagst dir auch, ich will n User anlegen mit dieser ID und dieser Shell und diesem Home Directory und sowas. Dann gibt es doch Chef und es gibt Ansible, und Ansible finde ich eigentlich am nicesten. Ihr wisst, ich hab noch nicht sonderlich viel Ahnung, bzw. noch nicht lange Ahnung von Ansible, das haben wir vor einem Jahr oder so mal zusammen uns im Stream angeguckt. Ich muss sagen, mittlerweile finde ich das wirklich sehr nice. Ohne GitHub-Copilot, ja, ich sehe den Sinn davon nicht. Genau, deswegen machen wir jetzt ein Repo, wo alles reinkommt, um wir diesen Service aufbauen können. Erpuppet ist, glaub ich, schon bekannter, weil es das deutlich länger gibt. VirusBLN, Dankeschön für den Sub. Aber Ansible ist auf jeden Fall beliebter in letzter Zeit. Lass mal gucken, es gibt doch dieses Google vs. Ranking-Geschichte. Oh, wo war das nochmal? War es Google Trends? Jawoll. Taylor Swift und Kim Kardashian, genau, das ist Fußball vs. American Football. Das müsste man sich mal für die Welt angucken. Außer im Freedom-Land ist da wahrscheinlich nicht so viel. Aber es ist ja auch American Football. Ok, Puppet. Puppet findest du halt immer noch viel mehr, da müssen wir noch was dazusuchen. Egal, wir suchen einfach mal Puppet und dann suchen wir hier Vergleich mit Puppet. Puppet ist halt, guck mal, sogar so ist es beliebter. Letzten 5 Jahre. 2004 bis heute. Guck, hier ist das aufgekommen und dann hat es das überholt. Aber insgesamt würde ich tatsächlich sagen, dass Puppet noch ein bisschen bekannter ist, eben weil es einfach mal 10 Jahre älter ist. Ne, das stimmt nicht, so alt ist es nicht. Egal, keck wie erst das Service ist am Start. Gut, also weiter im Text. Nachdem wir alles in dieses Geepum machen wollen, legen wir einen extra Ordner für unsere Ansible-File an. Ansible ist ein Tool, um Server automatisiert aufzubauen und das heißt, wir brauchen als erst mal einen Server, den wir automatisiert konfigurieren können. Das heißt, ich lege jetzt mal einen Server an. Mal gucken, ob ich das so mit dem Kommandozeilen-Tool hinkriege. Server, Create, Image. Das ist übrigens das gleiche, wenn ich bei Hetzner im Webinterface klicke. Also wenn ich hier Add Server mache und durch klicke, ist es genau das gleiche, wenn ich hier über die Kommandozeile mache. Nur, dass ich es einfacher finde, wenn man öfters ein paar Server anlegen muss, über die Kommandozeile zu machen. Okay, CX11, Name, keckweight 2, keck, W, S, Service, SSH Key. Okay, wir nehmen Triple Core, wir nehmen Triple Core Kiste, die heißen CPX21. CPX21, hoffe, stimmt das? Und wenn ich Glück habe, kriege ich jetzt auch nicht das Hutpasswort angezeigt. Gibt es nicht auch eine Ansible-Rolle für die Hetzner-API? Doch, gibt es. Oh, ich darf keine Underscores verwenden. Was ist das? Keine Underscores. Wie kommt man da hin? So? Okay, das funktioniert. Warum nicht keckchamp, weil es keck, W, S, Service ist. So, also, IP von meinem Server. Was ich jetzt machen werde ist, ich werde mich nicht auf dem Server einloggen. Wir legen jetzt erstmal ein Ansible-Playbook an, heißt das Ganze. So, wir legen ein Ansible-Playbook an. Ich habe immer keine Ahnung, wie nenne ich das denn mal? Setup. Gut. So, und jetzt muss ich nachgucken, weil ich bin in Ansible noch nicht so fit, dass ich das aus dem Kopf gut hinbekomme. Was ist denn das? Always. Trusten. Wir trusten allem. Immer, immer trusten. Okay, es ist YAML. YAML fängt ja mit so tollen Minus an. So. Wobei, ich nenne es nicht Setup, ich nenne es einfach Server.YAML. Eisch. So, jetzt hört es aber bei mir auf. Ansible. Ich brauche wieder Ansible. Mist. Ich muss nachgucken, wie das heißt. Also, Leute, ich log mich mal kurz. Ich muss euch ausmachen, dass ihr mich keinen Bock mehr auf irgendwelche DDoS stellt. He doesn't know he lacks critical information. Okay. Wieder an. Also, ich muss mal gucken, wie das funktioniert. Also, normalerweise ist das Problem, wenn man sich bei Ubuntu einloggt, dass immer beim Login die IP angezeigt wird. Das will ich ausschalten. Ich weiß, dass es dazu... Also, es gibt zwei Möglichkeiten, wo das herkommen kann. Einmal Message of the Day oder SSH-Config. Nee, ich mache keinen VPN. Leben am Limit, Leute. Ich glaube aber, bei Ubuntu kommt es aus der SSH-Config. SSHD-Config. Das habe ich nämlich schon mal nachgeguckt. Was? IP-Leak unten. Da ist kein IP-Leak. Ja, der Server. Der Server-IP juckt mich nicht. Server-IP ist mir egal. Es gibt eine Option, dass SSH nicht macht. Hier. Print last log no. Okay, so heißt das. Das heißt, das muss ich jetzt Ansible konfigurieren, dass er das macht. Also, Ansible SSHD-Config. Wie macht man das? Das habe ich keine Ahnung von. Muss ich nachgucken. How to cleanly edit SSHD-Config? Nee, Print Message of the Day ist aus, warum auch immer, weil Ubuntu keinen Bock darauf hat. Kein Schimmer. Aber das ist das hier. Print last log. Dann zeigt es dir an. Zuletzt eingeloggt von und noch ein paar andere Infos. Das ist Ubuntu 20.04. Übrigens, wenn ihr irgendwelche Fragen habt, einfach entwupplos in Chat. Ich gehe auch gleich nochmal zwischendurch den Chat durch. So, also wie machen wir das jetzt am richtigsten? Was? Test Replays. Okay. Also. Ich bin unfähig, was Ansible-Dinger aus dem Kopf zu machen. So. Name. So, das Ding heißt Setup. Setup Job. Hosts. Alle, die wir angeben. Asks. Okay. Task is Disable. Show IP on Login. Kannst du auch einfach Touch, Hasch, Login? Wirklich? Cool. Wusste ich nicht. Asch. How to turn off Login Banner in Linux. Ist das auch für die Geschichte, die SSH ausgibt? Ich deaktiviere das im SSH Server und fertig. Okay. Disable Show IP on Login. Also, was wollen wir disablen? Print last log. Das ist Mist, wir wollen keine Schleife hier machen. Fart. Fart ist etc, ssh, sshd, config. Zack. So, regex. Print last log. Aber ohne die Raute. Und jetzt soll man print last log no soll dann da rein. Also, soweit wie ich das jetzt verstehe, macht er folgendes. Wo ist der Unterschied zwischen Ansible und Docker? Das sind zwei komplett unterschiedliche Programme. Ansible ist quasi eine Scripting Umgebung, wo du Server bzw. alles was du willst automatisieren kannst über SSH und Docker ist Frontend für Container, Linux Container. Zwei komplett unterschiedliche Paar Schuhe. Du kannst mit Ansible aber zum Beispiel auch Container anlegen und Docker verwalten. Das geht. Ansible benutzt du zum Beispiel für so Sachen wie geh auf den Server, nimmte die Ausgabe von der IP beim Login aus oder geh auf den Server, legt den User an mit dem Name xy, Homeverzeichnis sowieso und der User ID sowieso. Danach legt ein Unit File hin und stellt in der Firewall ein, dass nur Port 22 erlaubt ist. So was in der Richtung. Hetzer hat eine CLI, ja. Hetzer hat eine CLI. Wow, was ich da gerade gemacht habe. Ich mach das trotzdem mal weg, auch wenn es egal ist, dass ich das geleakt habe, aber man weiß ja nie. So. Wait, könnte ich nicht mein Laptop mit Ansible bootstirpen? Doch, könntest du machen. Du musst aber erstmal ein Betriebssystem drauf kriegen und Ansible drauf installieren. Ne, musst du nicht, SSH muss laufen. Du brauchst Python drauf, nicht Ansible. Kannst du machen, ja. So und von der Idee, wir haben jetzt über die Hetzer CLI einen Server angelegt und mit Ansible lassen wir den jetzt konfigurieren. Also erstmal SSH Login ausschalten. Das ist schon mal das erste, was wir machen. Dann brauchen wir noch ein paar Packages auf unserem Server. Was jetzt vielleicht nicht ganz klar ist an der Stelle, was ist der Vorteil, das so zu machen, anstatt einfach sich auf dem Server einzulocken und sagen, ab install. Naja, der Vorteil ist, wenn ich mehrfach solche Services aufbaue, dann muss ich das jedes Mal machen und immer in der gleichen Reihenfolge und ich darf nichts vergessen. So ist einmal quasi so eine Art Dokumentation da, wie der Server aufgebaut ist und ich kann das jedes Mal wieder machen. Äh, gute Frage, ob das so funktioniert, werden wir echt gleich sehen. W-werden wir echt gleich sehen. Wieso macht man das nicht? Im Bash Script kann man auch machen, hat man früher gemacht, als es diese Tools noch nicht gab. Ist für kleine Sachen auch vollkommen legitim, aber Ansible hat keine Ahnung, 200 Module für alle möglichen Sachen drinne. Von Unitfiles verwalten, bis R-Syncs machen, bis Mountpoints verwalten und sonst was. Das ist halt im Bash Script alles von Hand nachzubauen, wie sehr Pains Champ. Okay, also blablabla. So, und jetzt brauchen wir noch was. Ich will standardmäßig Packages installieren. Install Packages. Abt. Das weiß ich aus dem Kopf, wie es geht. Abt, Packages installieren. Name. So, Array. Was wollen wir installieren? Telnet. Hardtop. Enload. Keymarks. D-Stats. Was brauchen wir sonst noch so? Äh, haben wir schon. NetTools. Ne, wie schreibt man das? NetTools, glaub ich. So ist wie if-config. Boomer wie ich verwenden if-config, nicht ip-add. So, und jetzt sagen wir noch status latest, glaube ich. Status latest. Da muss ich jetzt einmal mal nachgucken. Ansible apt install. Zeig mal her, wie sieht das richtig aus? Examples. Äh, state. Update cache brauchen wir auch noch. Genau. Update cache brauchen wir auch noch, dass der vorhin ein update macht. Update cache, yes. Äh, state wars, ne. Nicht status, state. State latest. Genau. So, und wenn ich das jetzt ausführe, sollte von der Idee, äh, von der Idee her Folgendes passieren. Der lockt sich auf dem Server ein, installiert mir die Packages und danach disabler, dass das meine IP anzeigt beim login. Hypo bei Packages. Ach, das ist eh nur Text. Auch noch ein update-upgrade mit rein. Das ist eine gute Idee, das machen wir. Update hab ich ja schon. Update cache. Äh, upgrade. Upgrade, wie macht man das? Upgrade. Upgrade. If yes or save. Vielleicht gibt's auch ein Exempel für. Upgrade, das muss man wahrscheinlich, ich versuch das mal, ob man das alles in einem machen kann. Ich, ich glaube ja nicht. Upgrade dist, full. Ähm. Äh, mal gucken, ob man das alles so auf einmal machen kann. So, dann führen wir das ganze mal aus. Also wir haben hier, wir haben hier die Datei liegen. Äh, nicht download. CD, repos, keqw as a service, ansible. So, äh, ansible, playbook. Playbook, minus i. Oh, wie konnte man die Server, Server-IP überschreiben? Normalerweise braucht man ein, ein, ein, ein Inventory mit den Hosts drinne, aber das ist jetzt zum testen erstmal, egal. Topminus i. Was ist das upgrade yes? Nee. Die sagen selbst, dass es upgrade dist ist. Ach so, yes. Ok. Update yes und klar. Und auch yes. Warum kann man da yes machen oder? Ok, und was ist yes? Ist yes, full oder dist? Ok, das ist ein bisschen. Ah, nee. Save and it's alias yes. Ok. Yes ist yep. Yep, cock. So, ähm, jetzt müsste es funktionieren. Ähm, Moment, wie ging, wie ging es auf dem Server auszuführen? Erstmal gucken, was hatte ich denn hier für eine IP nochmal? SSH den da. Minus i. Wie ging das nochmal? Ansible Direct IP. How to run ansible without specifying. Hier. Minus i, der Name und dann das Playbook. Ja, man muss ein Komma machen. Das war total hängen geblieben. Server. So, also von der Idee her sollte er sich jetzt auf dem Server einloggen, die Packages installieren. Beziehungsweise, nee, er sollte erstmal ein upgrade machen, ein upgrade machen, dann die Packages installieren. Ich bin mir nicht sicher, ob man das alles auf einmal machen kann. Danach sollte er aus der SSHD-Config das Ganze rausschmeißen und danach brauchen wir noch SSH reload. Danach brauchen wir noch restart SSH, sonst funktioniert er nicht. Name. Restart SSHD. Ähm, wie ging das nochmal? Service. Service. Name. SSH. Ansible Service. Da muss ich gucken. State. Restarted. Ok. State Restarted. Ok. Test, ob es funktioniert. Bam. Grip. Warum? Ah, mein User ist falsch. Remote User. Natürlich Route, was sonst? Nur Route tut gut. So, zeigen wir mal. Ah, fuck. Discover Inter, was? Ok, das geht nicht in einem, glaube ich. Ich glaube, das funktioniert nicht in einem. Package upgrade. Das geht nicht in einem. Dann müssen wir, äh, da müssen wir das, da müssen wir das splitten. KQS-Service. Ja, guck, so sieht der aus. Ist das nicht geiler Service? Den deployen wir jetzt auf die Kiste. So, ähm, darf man, darf man sowas hier dann zusammen machen? Update. Upgrade. Domain gibt's noch keine. Domain müssen wir auch noch machen. Ah, ah, guck mal, jetzt, jetzt funktioniert's. Äh, Domain müssen wir auch noch machen, das, äh, machen wir hier mit, wenn wir Zertifikate machen. Domain. Es gibt sich, ja, es gibt sicherlich eine Ansible-Extension. Macht er das mit den Admin-Rechten automatisch? Äh, du musst sagen, welchen Remote-User du verwenden willst. Nachdem wir Route sind, kann ich alles machen. Macht er jetzt was? Äh. Äh, der, der scheint zu updaten, ok. Also. Ah, ich kack noob. Das hätt ich noch rausschmeißen müssen. Nochmal. Siehste, das Gute ist, wir machen das jetzt einmal richtig und können jeden Server wieder so aufbauen. Woher, äh, woher zieht er sich die Login-Daten? Äh, das ist mein SSH-Key, den hab ich standardmäßig beim Aufbau mit drauf. Ich wähl, guck, wenn ich hier H-Cloud, H-Cloud, sag ich hier SSH-Key Test-at-Test. Das ist halt der Titel von meinem SSH-Key. Ok, hat funktioniert. Hat funktioniert, das heißt, jetzt hab ich hier unter anderem JIT drauf, genau, N-Load drauf. Ja, perfekt. Ah, es hat funktioniert. So, und ist jetzt SSH-ETC-SSHD-Konfig, hat er das jetzt? ATC-SSH-SSHD-Konfig, hat er das jetzt richtig gemacht? Äh. Print. Ja, guck, Print-Last-Log, no, hat funktioniert. Ohne hat er auch den SSH-Demon neu gestartet. So, guck mal mal, ob der auch wirklich alles geupdatet hat. Tatsächlich, Update. Ja, hat alles funktioniert. Server ist jetzt in top Zustand, nachdem wir das Skript ausgeführt haben. Ja, super. So, und jetzt ist natürlich die Frage, ob meine IP nicht wieder kommt, wenn ich mich einen ausloge. Das testen wir jetzt mal. Nope. IP ist weg. Kommt nicht. Hat funktioniert, sehr nice. Alles klar. Ähm, dann können wir ja weitermachen. Also, jetzt haben wir erstmal so die Basics eingerichtet auf dem Server. Und jetzt mal vielleicht so als Beispiel, warum das cool ist und warum das sinnvoll ist. So, hier haben wir den ersten Server oben. Ich lege jetzt nochmal einen Server an, der heißt jetzt CAC-WSS-Service 2. Server anlegen kostet nichts. Hetzer Cloud rechnet übrigens stündlich ab. Das heißt, ähm, ich bezahle für den ganzen Kram hier so gut wie nix. Eigentlich könnten sie die Server, die ich im Stream zeige, wenigstens bezahlen eigentlich, oder? So. Äh, nicht default streamen. Guck, CAC-WSS-Service, CAC-WSS-Service 2, und Kosten tut das Ganze 1 Cent aktuell. Ich glaube, 1 Cent ist das Minimalste, was geht. Engine X oder Apache, was ist besser? Bei Meilen weit ist mir Engine X lieber, viel lieber. Okay, guck, wir haben jetzt noch einen zweiten Server aufgebaut. Und jetzt muss ich nur noch folgendes machen. Äh, muss ich nur noch sagen, Ansible Playbook Server aufbauen, die IP austauscht. Normalerweise hat man Inventory, dass man das per Name machen kann, ja. Zack, jetzt führ ich das aus und er geht auf den zweiten Server drauf und richtet ihn exakt so ein wie den ersten Server. Dafür ist das praktisch. Ich könnte jetzt noch 20 Server hinstellen, die exakt so konfiguriert werden, wie ich das will. Also das ist, gerade bei sowas ist das enorm praktisch. Ja, warum er Engine X, Engine X ausspricht, verstehe ich auch nicht. Die Schreibweise verwirrt mich immer. Ich kann den auch nie richtig schreiben. Echt, richtig 3-Head. Kannst du das nicht als Docker-Container machen? Doch, das machen wir in Stream Nummer 3. Wir machen 3 Streams dazu. Heute machen wir die Web-Anwendung, richten den Server mal oldschool mit Ansible, aber es ist oldschool. Ansible ist ja nicht oldschool, weil oldschool Server ohne Container ein, deployen die App im nächsten Stream, gucken wir, dass wir das Bild serverseitig rotieren und so eine kleine API noch einbauen. Dann machen wir GitHub Actions, Deployment und Continuous Integration, weil wir sind Agile 5-Head-Hackermans. Dann verwenden wir mal den Head-Store-Load-Balancer mit Zertifikaten und extra Domain. Und im dritten Stream machen wir dann Containerstellen draus. Auf YouTube gibt es die Streams nicht, ne. Aber wir haben einen Archiv, da ist das alles. So, guckt, 2. Server angelegt und ist direkt konfiguriert, so wie man haben wollen. Also wunderbar. Wann ist der 2. Stream? 2. Schnitt. Vielleicht nächstes Wochenende oder nächste Woche. Es dauert auf jeden Fall nicht lang. So. Und daran sieht man jetzt den Vorteil schon, ich könnte jetzt 20 solcher Server anlegen und total easy konfigurieren lassen. Natürlich ist unsere Konfig noch nicht fertig, da muss noch ein bisschen was dabei. So, ich lösche mal CACWSS-Service wieder. Delete. Gut. Also, lass mal überlegen, was brauchen wir denn noch? Wichtig, wir nehmen eine Heads nach Firewall davor. Da müssen wir uns ja nicht selbst drum kümmern. Also, das ist übrigens ein neues Feature bei denen, das gibt es noch nicht so lang. Seit 2 Monaten oder so. Bisher musste man sich komplett selbst drum kümmern. Also, man musste dann beispielsweise die UFW unter Ubuntu einschalten. Jetzt hat Hexner, ich glaube sogar, kostenlos. Ich bin mir gar nicht sicher, was der Kram kostet. Guck mal, der ganze Kram ist noch da. Ich weiß gar nicht, was das kostet. Kann man jetzt Firewalls anlegen? Das heißt, wir können da auch wirklich nur Sachen freigeben, die man braucht. So, wir brauchen Port 22, wir brauchen Ping. Ping ist okay, können wir behalten. Wir brauchen Port 80 und wir brauchen später noch Port 443. Und das Ganze soll auf den Server gehen. CACW as a service. Apply to one server, Firewall, CACW, Firewall. Create. Und jetzt sind wir safe. SSH. Ich hoffe, es funktioniert noch. Kunst, sehr gut. Was natürlich sehr praktisch ist, da muss man sich selbst nicht mehr drum kümmern. Es ist nur Ping allowed, Port 22 für H80, für HTTP und 443 für HTTPS. Ja, das kommt auf die Anwendung an. Oh, sind wir dann hier gelandet. Das kommt auf die Anwendung an. Da gibt es nicht so viele Tricks. Du musst den Server halt rebooten, vor allem wenn es ein Kernel-Update ist. Ich weiß, es gibt schon die mehr oder weniger trickreiche Geschichten, dass du manche Updates machen kannst, Rolling, auch Kernel-technisch, aber in der Regel kann man sagen, Kernel-Update gleich Reboot. Also, du musst gucken, wie das deine Anwendung verkraftet. Was hast du denn dahinter stehen? Also, wenn du da mehr oder weniger Stateless-Webgeschichten dahinter stehen hast, dann ist es ganz einfach. Dann machst du einen Loadbalancer davor. Die FW bei Hetzler ist aber eine Stateless-Firewall, soweit ich weiß. Oder wurde das geändert? Gibt es wirklich noch Stateless-Firewalls? Kann ich mir gar nicht vorstellen. Es kann keine Stateless-Firewall sein, dann würde Ping überhaupt nicht funktionieren, weil das Antwortpaket nicht weiß, wozu es gehört. Das muss Stateful sein. Würde mich sehr wundern. Müsst ihr mal gucken, ich kann es dir so nicht sagen. So, aber wo sind wir hier? Genau, Mr. Mr. Ja, haben wir. Ja, also wenn das Web... also, machen wir mal ganz schnell Überblick. Wie patcht man am besten einen Linux-Cluster? Wobei Cluster, Cluster ist in dem Fall das falsche Wort. Geklustert ist es ja nur, wenn du verschiedene Notes hast, die irgendwie miteinander reden. Hier geht es ja darum, du willst Ausfall, möglichst Ausfallzeiten optimiert deine Systeme neu starten. Und das einfachste ist, du stellst einen Loadbalancer davor oder einen Loadbalancer-Cluster davor. Also im Angenommen, du hast 10 Web-Server, du hast alles relativ stateless, ohne Sticky Sessions oder sonst was, einen Loadbalancer davor und dann kannst du die Server neu starten, wie du lustig bist, ist egal. Da hast du nur minimale Sachen, die ins Leere gehen. Das funktioniert. Bei Sticky Sessions und irgendwelchen Stateful-Sachen wird es ein bisschen komplizierter. Dann musst du quasi erstmal auf Server-Ebene, auf Logikebene gucken, dass dieser Server keine neuen Verbindungen mehr annimmt und dass die Clients sich zu den neuen Servern verbinden und erst wenn alles auf den neuen Servern ist, kannst du es dann ausschalten. Kommt aber ganz hart auf die Anwendung an. Ja gut, das beste ist 5 Minuten warten. 5 Minuten ist glaube ich Standard-Timeout. Wie man dann einen Loadbalancer patcht? Gar nicht. Es sei denn, du hast einen Loadbalancer-Cluster. Dann musst du es genau machen, wie ich gesagt habe. Du schwenkst den Loadbalancer, wartest bis alle Sessions drüben sind. Es gibt ja mittlerweile Loadbalancer, die können sogar TCP-Sessions quasi sharen. Du wartest bis alle Sessions drüber sind oder du hast halt irgendwie BigBrain-Loadbalancer, die geschaerte TCP-Sessions haben. PFSense kann das zum Beispiel. Dann startest du den inaktiven, schwenkst und startest. Kannst auch Netscaler nehmen, was auch immer. Es gibt noch viel mehr. Wie gesagt, der Aproxy kannst du nehmen. Da gibt es total viele Sachen, das kann man so pauschal nicht sagen. Aproxy ist aber tatsächlich ganz nice. Aproxy hat auch ein eingebautes Webinterface, wo du gucken kannst, wie viele Verbindungen noch drauf sind. Und wenn du super modern bist, der Container-Way, da gibt es noch ganz andere Sachen. Aber machen wir mal weiter. Wir haben unsere Fireball angelegt, passt. Das kann nicht komplett stateless sein, Leute. Das muss stateful sein. Ich kann euch auch sagen, warum. Warte mal. Ich kann einen Ping machen. Und einen Ping, also entweder bin ich jetzt richtig eui und ich erzähle euch Scheiße oder die Dinger sind stateful. Damit ein Ping funktioniert, muss es doch eigentlich eine stateful Fireball sein, weil die Antwort von dem Server muss die Fireball wissen, wo die Anfrage her kam. Und was geht einem in eine stateful Fireball? Wenn du ausgehend verkehrlich blockst, das stimmt, da hast du recht. Da hast du recht. Ne, stimmt, muss nicht, muss nicht. Du erlaubst ja eh, du erlaubst ja eh outgoing zu überall hin. Dann ist egal. Ne, dann kann es, dann muss es das nicht sein. Normalerweise muss die Fireball wissen, woher der Ping kommt, wenn du nicht von überall her erlaubst. Also stell dir mal vor, du erlaubst, dass dein Server nirgends wohin zugreifen kann. Und also dein Server darf ausgehend nirgends wohin Pakete verschicken. Und du möchtest dem jetzt sagen, wenn ein Ping reingeht, dass es erlaubt, die Antwort auch erlauben und das geht nur stateful. In dem Fall ist aber egal, wenn du nichts geblockt hast als Upsend, ja dann müsste es auch so gehen. Müsste ich mir noch mal ein bisschen Gedanken drüber machen. Also ich wüsste nicht, wie das stateless funktionieren sollte. Das ist ja gerade der Witz von stateful, dass sowas funktioniert. Also irgendwo muss ja markiert werden, hey, was ist die Antwort auf das eingehende Paket? Doch, doch, doch. Aber der Fall ist ja in dem Fall so, du hast in der Fireball geblockt, dass dein Server nach außen überhaupt kommunizieren darf. Theoretischer Fall. Aber du willst, dass er pingbar ist. Das heißt, dann stellst du ein, und das geht halt nur stateful, dann stellst du ein, eingehend ICMP erlaubt, ausgehend nur related Verbindungen, die quasi zu einer vorher schon eingehenden gehören. Das ist ja der Sinn von stateful Fireballs. Und ich wüsste nicht, wie das funktionieren sollte stateless. Keine Ahnung. Ich muss euch ehrlich sagen, ich hab mir da jetzt nicht genug Gedanken drüber gemacht, ob das jetzt gehen sollte oder nicht. Aber ist auf jeden Fall spannende Sache. Okay, weiter im Text, wir sind voll hinten dran. Weiter geht's. Also wir haben jetzt unseren Server automatisch aufgebaut. Als nächstes müssen wir irgendwie gucken, wie wir unsere Web-Anwendung drauf kommen. Das related ist aber ausschlaggebend. Genau, genau. Zumindest bei IP-Tables heißt das so. Fragt mich nicht, wie das bei anderen Sachen heißt. Okay, also wir haben den Server eingerichtet mit Ansible. Jetzt müssen wir mal gucken, was brauchen wir sonst noch? UFW können wir uns schenken, Pakete haben wir installiert, IP haben wir ausgeschaltet, SSH haben wir neu gestartet. Ja, jetzt müssen wir irgendwie gucken, wie wir das noch vm, ja. Jetzt müssen wir gucken, wie wir unsere Anwendung drauf deployen. Das heißt, ich würde mal sagen, wir legen noch einen neuen User an. Wir legen den User für die Anwendung an. Also, wie legt man Ansible User an? Ansible User. Create. Übrigens, wenn ihr euch auch mal in der Cloud mit einer Linux VM austoben wollt, dann könnt ihr jetzt bei meinem Partner Hetzner Cloud vorbeigucken und euch 20 Euro Startgut haben mit meinem Gutschein sichern. Ausrufezeichen Hetzner im Chat. Der Sellout war jetzt okay, oder? Vorher habe ich ein bisschen verkackt, aber der war jetzt okay, finde ich. Ne, aber ernsthaft, ich verwende das selbst schon. Ich glaube jetzt die letzten drei Jahre oder so. Ist für mich, gerade weil es ein deutscher Hosting-Anbieter ist, ist naheliegend, ja. Du hast zig andere, klar, aber preisleistungsmäßig und dass du zwei Rechenzentren in Deutschland hast, macht für mich Hetzner echt sympathisch und brauchbar. Auch die Speicherpreise sind nicht ultra hoch, weil man ein bisschen mehr braucht. Und wie gesagt, 20 Euro Startgut haben mit meinem Code für Neukunden, da könnt ihr schon ein paar Monate hier so einen kleinen Server betreiben und euch da ein bisschen austoben. Hetzner ist echt nice, also da kann man sich nicht beschweren. Ich hätte diese ganze Sponsoring-Geschichte gar nicht angenommen, wenn ich den Kram nicht selbst verwenden würde. Ja, das wäre jetzt so wie wenn ich Raid Shadow Legends mache, mache ich auch nicht. Also ich kann es euch nur empfehlen mal anzugucken. Okay, jetzt aber weiter im Text. Wie kriegen wir unseren Service auf den, wie kriegen wir CAC W as a Service auf den Server CAC W as a Service? Gut, wir machen das jetzt mal ganz einfach. Ich kopiere es von Hand dahin und danach gucken wir wie wir das Ganze mit Unit File und Ansible noch deployed kriegen. Ne, ein User wollten wir noch anlegen, ein User wollten wir vorher noch anlegen. Alter, Vmware, du nervst mich hier gerade. Hab ich das, ach, ich hab das sticky eingestellt, ich wollte gerade sagen, warum ist das immer wieder da. Ansible Create User, Manage User Accounts. Ich brauche einen neuen User. Und zwar nennen wir den App. Bester Name, da weiß man sofort was Sache ist. User, das da, perfekt. Die einfachste User Variante. Ohne Passwort, ohne Login, ohne alles. Okay. Ja. Create App User. Name, Pushkar15, Commodore Style hier. Ne, die heißt einfach nur App, da weiß man sofort was Sache ist. App, Passwort, expired, nie. Gibt kein Passwort. Okay, dann führen wir das mal aus. Wenn man das jetzt übrigens ordentlich macht, müsste man hier noch einstellen so nach dem Motto, okay, das machen wir nur wenn wir es noch nicht gemacht haben, das machen wir auch nur wenn es nicht da ist. Das kann man abhängig voneinander machen, aber, okay, das Ansible. Das sollte jetzt eh alles ein bisschen schneller gehen. Oh, das ist der falsche Server, null. Das ist der richtige. Das ist der richtige Server, stimmt ja, stimmt ja gar nicht. He doesn't know, he lacks critical information, ja. Okay, Restart SSR, Create User. Gut, wir haben den User angelegt, das heißt Home App haben wir jetzt, sehr schön. Kann ich auch Sudo App machen? Was ist denn das? Oldschool Shell. Okay, wir haben dann extra User für die App. Okay, dann kopiere ich jetzt mal die App drauf auf den Server, dann könnt ihr auch mal ausprobieren. Da könnt ihr auch alle eine Runde Keg WS Service aufrufen gleich. Poste euch dann die IP in den Chat, wenn es soweit ist. So, ich ersünke das jetzt einfach mal drauf und ich SCP das drauf, ist jetzt erstmal egal. Danach machen wir das mit Ansible, schön. Also Keg WS Service, also.NET, Publish, ach du Scheiße, das war echt aus dem Kopf, Publish, haben wir das nicht irgendwo in der History? Publish, Publish, .NET, Publish, Release, Linux, Self, ja doch, Self-Contains, das bin ich nicht verkehrt. History ist die beste Dokumentation aller Zeiten. Äh, Aviator, doch, wir hatten hier schon ein paar mal DDoS Action, da konnte Hetzner aber nur am Rande was dafür, da haben uns die Leute irgendwelche polnischen Botnetze gemietet und fanden das lustig, dass ich dann für 10 Minuten im Stream nichts machen konnte, aber wenn ihnen das Geld wert ist, meinetwegen, sollen sie machen. Das ist kein Witz, hatten wir wirklich. Sachen gibt's, ja. Okay, SCP, die richtige. SCP, komm, Bam, als Root, wir starten das jetzt als Root, easy, einfach um zu gucken, ob es funktioniert. Na, mit den 300 Viewern kommt Hetzner klar, das ist kein Problem, aber mit den 50 Milliarden Botnet-Anfragen aus Polen kam es nicht klar. By the way, das ist übrigens so, wie man es nicht macht, per SCP eine Anwendung rüber kopieren, aber zum Testen ist es vollkommen in Ordnung. Später würde ich es, wenn überhaupt per R-Sync machen und der richtige Weg, den machen wir dann im zweiten Stream über GitHub Actions deployen lassen und gleich noch ein paar Tests und gucken, ob das alles funktioniert. So, auf, gib alles. Oh nee, die ganzen Bilder. Drei Stunden später. Aber zum Glück sind die Bilder nur, haben wir die resized und die sind nicht so groß. Okay. Gleich haben wir's. SCP dann später in der Pipeline. Ich werde wahrscheinlich mal was über R-Sync. Okay. Beides, beides. Beides, das haben auch schon Leute in Tetzner Server selbst gedetost. Okay, also das haben wir jetzt rüber kopiert. CACW. Wo ist es? Nee, Publish. Publish, jetzt könnt ihr es gleich mal aufrufen. Hier, IP, Home Server. CACW as a Service. Bam, läuft. Ah nee, Moment, Local Host. Ich mach doch da jetzt kein Reverse Proxy vor. Urls, gleich. HTTP, Doppelpunkt, Doppelslash, Sternchenport 5000. So Leute, gebt alles. Moment, ich muss mal kurz gucken, ob ich meine IP leake, wenn ich auf den Server draufgehe. Ah, Port 5000, von Port 5000 ist in der Firewall ja gar nicht freigegeben. Okay, machen wir Port 80, machen wir Port 80. Scheiß drauf. Dann kriegen sie auch die ganzen China-Chinesen gleich mit, dass wir online sind. Okay. Die IPs wird nicht gelegt. Okay, wunderbar. Also, ich mach mal wieder an. Ja, wir starten das jetzt. Ihr könnt jetzt hier das da ausführen. Ja, da könnt ihr jetzt hin und ihr kriegt alle eine Runde CACW as a Service. Gebt alles hier. Wer wollte nicht schon immer CACW in as a Service? Gucken, ob ihr irgendwie ein bisschen nennenswert Last verursachen könnt. Boah, boah. Geht, aber so wirklich viel bei Enload. Mal schauen. Ist ja nix. Outgoing. Ah, Busybuzz ist da. Busybuzz ist da. Sag mal, ist das jetzt von einem Date-Job-Arbeitszeit? Nee, schön wär's. Schön wär's, wenn ich das doppelt bezahlt kriegen will. Das wär doch mal geil. Leute, wäre es nicht cool, ich könnte mich bei der Arbeit streamen. Da würde ich Geld von der Arbeit verdienen, Stream-Money von den Subs, plus das wär doch mal Massive-Brained, Alter. Wenn das gehen würde. Elevenhead. Aber das geht nicht. Und Massive League, das stimmt. Ok, Leute, funktioniert's bei euch, wenn ihr da hingeht. Kriegt ihr alle schön CACW as a Service. Ja, nice. Bester Microservice überhaupt, oder? Ich würd sagen Startup, Startup-verdächtig. Absolut Startup-verdächtig. Fallt an der Börse, genau. Ok, zack. Ok, wir haben jetzt getestet, dass es prinzipiell funktioniert. Jetzt machen wir das ordentlich. Gehen wir hier mal raus. Gehen wir mal in Ansible rein. Wir wollen das Ganze der Reihe nach machen. Ok, Leute, das hab ich noch nie gemacht. Ich hab noch nie mit Ansible was ordentlich deploit. Moin, Eyelady, Pina. Ich hab noch nie mit Ansible ordentlich was deploit. Ich würd sagen, wir brauchen einen neuen Job für Build. Name. Build. Wir machen sowas. Wir machen einen Build-Shop. Wir machen einen Build-Shop und wir machen danach da noch einen Deploy-Job. Wir machen Setup. Warte mal, wir machen Setup. Das sollte man in unterschiedlichen Dateien machen wahrscheinlich. Bei Ansible kann man das glaube ich auch irgendwie taggen. Nicht mehr erreichbar. Ja, ich hab ausgeschaltet. Was, die Bilder sind nicht transparent? Doch, doch, die müssten transparent sein. Der Browser zeigt das nur nicht richtig an. Aber die müssten transparent sein. Ok, Build und dann brauchen wir noch einen weiteren Job. Name. Deploy. In Discord ist transparent. Ja, perfekt. Zumindest der nächste Tag. Ich weiß es noch nicht genau. Aber ich streame zwischendurch auf jeden Fall noch ein paar Mal und dann können wir das ausprobieren. Kann ich euch das zeigen? Wann ich das mache, muss ich mir ausdenken. Also, so, Build. Wie machen wir das Build? Lass mal überlegen. Wie mach ich denn das Build von Hand? Ich mach.NET Publish. Self-Contained. Also, so, jetzt machen wir... Also, wie sieht mein Build-Shop aus? Wie kann man Ansible Local Command machen? Das da, zeig mal her. Ansible Local Action. Hab ich nicht verstanden. Wie geht das jetzt? Local Action. Ah, Local Action Build. Da kann man auch bestimmt auch Shell nehmen. Ok, also, Build. Wir kommentieren diesen ganzen Schmodder mal aus, weil das haben wir jetzt ja schon gemacht. Später brauchen wir das, wenn wir einen neuen Server installieren. Aber ok, Build. Da muss ich jetzt bestimmt auch wieder diesen ganzen Mist hier dabei kopieren. Da merke ich immer wieder, dass ich mit Ansible zu wenig mache. Aber er soll es ja lokal ausführen. Ok, Local Action. Ok, Build App. So, das ist nicht Command. Shell. Schau mal nach Raw Command. Aber so müsste es auch funktionieren, oder? Shell. Und jetzt sage ich einfach, CD, eins drauf, in den Ordner, keqws-service, weil das heißt ja hier so. Guckt. Hier, eins, eins hoch. Keqws-service. Und da mache ich jetzt mal ein.NET-Build drinne. Also, Publish. Gucke ob das funktioniert. Da bin ja mal gespannt. So. Und von der Idee her müsste das mal ein Build-Command sein. Das machen wir dann wie gesagt im nächsten Stream über GitHub Actions. Aber ich habe das noch nie über Ansible gemacht. Mal gucken wie das funktioniert. Ich führ das mal aus. Build. Remote User bei Lokalen Actions, macht das Sinn? Nee. Ehrlich gesagt nicht, hast du recht. Ich weiß nicht, aber vielleicht braucht man das ja. Ich glaube nämlich man braucht das. Nö, braucht man nicht. Ok. Dann können wir das alles weglassen. What? Wie jetzt? Aha. Kann ich ja auch Hosts weglassen vielleicht? Nee. Ok. Ok, jetzt haben wir ein Bild angestoßen. Lokal. Können wir auch mal ausbreiten ob das funktioniert. Neues Tab auf. Wo sind wir hier? Wir sind in repos.keqws-service.rm-bin. Wir löschen mal den Output-Folder und lassen noch mal das Bild laufen und gucken ob das jetzt funktioniert. Bild. Bin. Jawoll. Funktioniert. Ok. Lokales Bild funktioniert. Jetzt ist unsere Anwendung gebaut. Mehr brauchen wir da wahrscheinlich an der Stelle gar nicht. Jetzt können wir es deployen. Deploy. Host. All. Wie gesagt ich weiß dass das nicht die schöne Ansible Art ist das so alles in einer Datei zu machen. So. Tasks. So wie kriegen wir den Kram jetzt rüber auf den Server? Nicht per SCP auf jeden Fall. Das wäre zu 3-Head das mit SCP rüber zu kopieren. Am besten wäre so eine Art R-Sync oder sowas. Id-Clone kann ich nicht machen weil ich es nicht. Achso doch ich habe es ja im Repo. Aber ich habe es ja nicht im Repo mit. Ne ne das bringt nichts. Ich bilde das ja lokal. Ich habe ja die Binaries nicht drin. Ich müsste ja dann quasi.NET auf dem Server noch installieren und dort den Bild machen. Was kontraproduktiv ist weil in Zukunft mache ich das nächste Mal ja über GitHub Actions wo das gebaut wird. Also ich brauche lokal kein.NET auf dem Server weil ich quasi eine Self-Contained Application bauen lasse die auch ohne.NET läuft. Also. Tasks. Deploy. Gut wie macht man einen R-Sync mit Ansible? Ansible R-Sync. Bam. Possix Synchronize. Das klingt schon mal 24-Head. Hat auch 25.000 Optionen. Was? Source. Dest. Recursive. No. Ok. Copy Paste das jetzt mal. Also Tasks. Copy. App. Besser Name. Es soll von. Von. Diesem Verzeichnis. Soll er kopieren. Wo liegt denn das. Moment. Wo liegt denn das. Bin. Mach ich mal nochmal ein Publish. Zeig den mir doch an wo das wo die Anwendung drin liegt. Hier. Das da. Das will ich kopieren. Publish. CacW as a Service. So. Offlich ist es jetzt der richtige Pfad. Eins hoch. CacW as a Service bin Release.NET 5 Publish. Das will ich kopieren. So und zwar Destination auf dem Server. Soll das jetzt. Wir haben extra. Guck mal wir haben extra einen eigenen User dafür angelegt. Home App. Normalerweise würde ich das kopieren. Irgendwie unter WWW. WWW. War WWW oder sowas. Ok. Es gibt auch einen Rapper. Das habe ich doch hier schon. Bam. Hab ich schon entdeckt. MedV. So Destination. Das ganze nach Home App. CacW as a Service. Recursive. Yes. Das ist ja ein Ordner. Vermute ich mal. Recursive. Was macht Archive. Symbol brauchen wir nicht. Delete. Delete Remote. Wenn es was nicht gibt. Ja das ist tatsächlich nicht verkehrt. Delete. Yes. Er ist immer nur Remote. Also da muss man keine Angst haben das Lokal was wegfliegt. Ich würde fast sagen dass die Chance besteht dass das so funktioniert. Schauen wir mal. Mal gucken ob der jetzt deploit. Task Build. Task Deploy Copy App. Ok. App. Da sind wir schon mal. CacW as a Service. Ok der kopiert noch. Der kopiert noch. Steht das so im Backlog. Klar ich habe extra ein Kanban Board angelegt davor. Guck mal hat funktioniert. Er hat die App deploit. Und sogar. Guck mal. Oh das ist nice. Guck mal der hat die gleich dem richtigen User gegeben. Das schiebe ich jetzt einmal mal da drauf. Dass sie das hier einprogrammiert haben. Weil ich bin Root. Und er sync das rüber als Root. Das heißt die haben auf jeden Fall dort irgendwas eingebaut. Das wenn ich den Heimatverzeichnis rein sync das ist das standardmäßig als der User macht. Vermute ich jetzt einfach mal. Das ist ziemlich. Ansible braucht nur Python auf dem Remote System. Das ist das ist das ist ziemlich ziemlich feifert. So. Das war es jetzt. Das ist wirklich einfach. Guck mal wenn ich jetzt deployen will. Lass ich einfach eine neue Version bauen. Und lass es auf den Server schieben. Und das kopieren geht auch schnell. Weil es R-Sync ist. R-Sync macht ja nur den diff. Mal kurz gucken ob das. Mal kurz gucken ob das. Mit dem Delete auch funktioniert. Er sollte jetzt eigentlich 1 2 3 4 die Datei löschen. Weil ich sage ja hier sync die Quelle mit dem Ziel und lösche beim Ziel alle Dateien die nicht in der Quelle vorhanden sind. Mal schauen. Ja funktioniert. Pog easy. Wie Anwendung durchgehend laufen lassen. Ja jetzt kommt jetzt kommt der Feifert Teil. Aktuell müssten wir die Anwendung ja noch von Hand immer starten. Also ich müsste jetzt immer sowas machen. Wir machen jetzt ein Systemd Service draus. Da muss ich aber nachgucken. Asp net core Systemd. Guck mal hatten wir sogar schon mal offen. Ich brauche ich brauche ein Beispiel unit unit file. Sowas hier. Ja genau. Ok. Und das kopieren wir da natürlich auch per Ansible drauf. Also ihr seht schon der Vorteil davon ist wenn ich jetzt neue Services oder neue App Server brauche dazu. Stellt euch mal vor. Keg WSService wird das nächste Multimillionen Startup. Und ich hab von 5 Usern heute zu 5000 Usern morgen. 50.000 User in einer Woche und 500.000 User in einem Monat. Da muss ich ja skalieren. Horizontal vertikal diagonal da muss skaliert werden. Vorher gehe ich mit KLS noch auf den Mount Everest da sich Bescheid weiß wie man ordentlich skaliert. So und dafür ist es natürlich wunderbar. Da kann ich easy jetzt ohne Containerstellen oder sonst wie. Da kommen wir im dritten Stream zu. Einfach ganz viele Server hochziehen und einen Loadbalancer davor stellen. Das ist eigentlich eine richtig coole Sache. Ok wir müssen unit file machen. Jetzt wird es kompliziert. Moment was habe ich denn da gemacht. Jetzt jetzt jetzt wird es Sixhead. Name. Wie machen wir das jetzt mit unit file. Name. Create. Keg WSService. Unit file. Boah das weiß ich nicht. Ansible. Inline content file. Line file block file. Is it possible to include file content in the playbook. Genau. Copy. Ja genau. Genau sowas will ich machen. Also. Das heißt ich sag jetzt. Copy. Richtig. Content. Wir machen erstmal die destination. Dest. Wo müssen unit files hin. Etc. System D glaube. Where put custom unit files. Ich sag euch leute wie im letzten. Googeln ist der wichtigste Skill überhaupt. Ihr müsst wissen wie ihr danach sucht. I have a custom. Unit file. User lib system D. Was. Nein. Es muss etc sein. Hier. Place to put system unit files. Etc. System D. System. Alles klar. Also. Etc. System D. System. Bäm. Da sind sie alle. Wobei da wird das eigentlich nur verlinkt. Scheiß drauf damals machen wir das hin. Was wird das nächste Video sein. Wahrscheinlich Battlefield. Etc System D. System. Und jetzt muss ich das Ding. Irgendwie. Irgendwie benennen. Irgendwie Punkt Service oder so. Ok. Punkt Service. Also. Das heißt das Ding heißt jetzt. Pack W. Es. Service. Punkt Service. Und jetzt Content. So. Multiline Content. Ich hab vergessen was es war. Tilde. Nee. Pipe. Content. Pipe. Und jetzt einfach so. Ob das funktioniert da hab ich da so meine Zweifel. Das funktioniert doch im Leben nicht. Das kommt doch im Leben so nicht auf dem Server an. Garantiert nicht. Ok. Schauen wir mal. Also. Description. Description ist natürlich was sonst. Pack W. Es. Service. Working Directory. Es. Home. App. Pack W. Es. Service. X6 Start. Es. Home. Die Namen wissen. Es. Home. Pack W. Es. Service. Pack W. Es. Service. Minus. Minus. Wurls. HTTP. Doppelpunkt 80. Der soll ja am Interface lauschen dass alle drauf zugreifen können. Restart Always ist ok. Restart Sack ist auch ok. Kill Signal Int. Ach was weiß ich. Syslog wie das im Log auftauchen soll. Pack W. Es. Service natürlich. User ist App. Environment. Production. Das lass ich einfach mal so stehen. Ok. Mal gucken ob das funktioniert. Mal gucken. Ich führs mal aus. Wir brauchen noch ein Reload. Wir brauchen noch ein Reload von Unit Files. Egal. Ich führ jetzt erstmal aus und gucke ob es funktioniert. Oh. Nein. Sündagsfehler. But why. Muss ich jetzt eins weiter einrücken. Ah. Yes. Outplayed. Ok. Das hat jetzt. Meint ihr das? Ok. Etc. Systemd. System. Und jetzt haben wir ein Kek. W. Es. Service. Service. Kek. W. Es. Service. Punkt. Service. Service File haben wir jetzt. Alles klar. Exquisite. So das ist natürlich die Frage ob das funktioniert. System. CTL. Status. Kek. W. Es. Service. Oh. Oh. Oh. Der erkennt es. Pass mal auf. Pass mal auf. Start. Wat. Root. Ach so. Ja natürlich. Das muss man als Root machen. Ist ja logisch. Ja klar. Ähm. Oh mein sag bloß das funktioniert. Das kann nicht funktionieren Start. Nee. Code. Oh. Wait a minute. Ich bin verwirrt. Start. Ok ich hab's. Killed. Was habe ich falsch gemacht? Warum mag er nicht? Disabled. Ok. Läuft er vielleicht noch? Ok. Journal. CTL minus Xe. Kek. W. Es. Service. Failed. With Result. Signal. Alles klar. Jetzt weiß ich ja sofort Bescheid. Äh. Warum? Warum? Warum? Warum failed das? Zeig mal her. Ordner stimmt doch. Kek. W. Es. Service. Home. App. Kek. W. Es. Service. Das ist eine Nähdungsform. Das ist ein Server bei Hetzner. In der Cloud. So und jetzt mach ich folgendes. Kek. W. Es. Service. Pools. Ah. Ich mach irgendwas falsch. Mission Denied. Ach das geht auf Port 80 ja nicht. Ich bin ja kein Root. Äh. Gibt's die Möglichkeit sich zu binden und dann die Privilege zu droppen irgendwie? Ne wahrscheinlich nicht. Ok da muss ich mir jetzt was anderes ausdenken. Wir machen jetzt Port 5000 und gucken ob's dann funktioniert. Status. Start. Ah. Start. Oh. Ich muss reloaden sagt er. Äh. Jaja. Start. Start. Start. Ah. Jetzt läuft's. Jetzt läuft's. Netstat. 5000. Ja. Jetzt funktioniert's. Da muss ich in die Firewall. Da muss ich in die Firewall und mal Port 5000 freigeben. Firewall TCP Port 5000. Und jetzt können wir auch ausprobieren ob's funktioniert. Kek. W. Es. Service. Bäm. 5000. Zack. Das ist sogar ist mir ehrlich gesagt so lieber. Ich will's später auf Localhost laufen lassen. Mit einem Reverse Proxy für Zertifikate davor und sowas. Ok funktioniert. Nice. Äh. Ambient Capabilities Cap Net Bin Service. Oh hier kommt der. Der Big Brain. Äh. Das ist äh. Das ist zum D. Ah. Ja nice. Nice. Das wird's wahrscheinlich sein. Weil dann macht er das als Root mit dem Binden und danach droppt er Privileges. Mal schauen ob das so funktioniert jetzt. Reload. Ach so. Ah. Dann muss ich das nochmal deployen. Reload. Gucken ob das jetzt funktioniert. Wenn man jetzt anfängt die Pläume zu nehmen einfach Docker anschauen. Komm drauf an was du machen willst. Da gibt's. Es gibt erstmal nix prinzipiell wo man sagen muss. Ähm. Ist ist immer überlegen. Aber Docker zu kennen ist ganz. Gut. Heutzutage. Ja. Erstens hilft dir beim entwickeln und zweitens wenn du später im Server Bereich bisschen Containergekrams. Äh. Gedöns machen willst. Dann sind so die Docker Basics nicht schlecht. Es muss einem halt klar sein unter der Haube ist das alles das gleiche. Ja. Egal ob. Also ich rede jetzt vom reinen Containeranteil. Egal ob Spotman, Kubernetes, Docker. Was auch immer ist. Die verwenden alle die gleichen Sachen für Container im Kernel. Das User Interface ist anders und natürlich das gesamte Ökosystem und das das das Skalieren und und die Orchestration Geschichten. Das ist natürlich komplett anders. Aber die eigentliche Sache die die Kernel Funktionen. Das ist alles das gleiche. Egal was man verwendet. Das heißt man muss immer sehen sei es Docker, Potman, Kubernetes oder ein selbst selbst gebasteltes Programm verwenden alle den gleichen Kram unter der Haube. Ok jetzt machen wir mal System Status Restart. Status. Ob das jetzt funktioniert mit dem Port. Nee. 5000. Stopp. Reload. Ach ich hab ja da immer noch 5000 drinstehen ich Kacknup. Meine Güte. Nix. Nix kann man machen lassen. Reload. Und jetzt Start. Restart mein Fing. Status. Plus. Bam. Nice. Jetzt gehts auf Port 80. Siehste wieder was gelernt. Der System D Boss war am Start. Können wir wieder wieder Port 5000 aus der Firewall rausschmeißen. Nice. Siehste wieder was gelernt. Man kann reinschreiben Ambient Capabilities Capnet Bind Service. Alles klar. Excellent. System D ist ja schon noch so ein bisschen holprig. Kann man den Port als Variabel in der Ansible-Config angeben? Könntest du machen ja. Könntest du machen. Letztendlich will ich das später eh nicht so haben sondern es soll Localhost lauschen mit einem Reverseproxy davor. Aber für jetzt ist das erstmal ok. Ok jetzt fehlen uns noch ein paar Kleinigkeiten dass das gut funktioniert. Als erstes würde ich sagen wir müssen noch in unserem. Ja das können wir so lassen. In unserem Deployed Shop sollten wir noch einbauen Service stoppen und starten. Service. Ja. Also Kack W ist das Service stoppen und starten. Heißt von der Idee her wird deployen eine neue Version und danach sagen wir stopp. Kack W ist das Service. Kack W ist das Service stopp. Stoppt muss es sein. Stoppt. Dann sagen wir noch Enabled. Yes das ist beim Start automatisch hoch fährt. Enabled Yes und Reload wie auch immer das geht. Ansible Service. Weil es könnte ja sein dass wir ein neues Unit-File deployet haben. Reload. Reload. Wie Demon. Demon Reload. Ne. Demon Reload. Ne ne nicht Reload ich will die Unit-Files selber Reload. Reload. Reload. Ah hier. Ah ok jetzt kann ich es nicht mit dem Service Rapper machen ich muss jetzt direkt sagen System D. Ok verstehe. Also stopp Kack W ist das Service. Name Kack W ist das Service. State. Stoppt. Stoppt. Und jetzt muss ich sagen Reload. Demon Reload. Reload. Yes dass der auch die neuen Unit-Files einliest. So und danach das ganze starten. Start. Start Kack W ist das Service. Einmal Enable and Start. Weil wir machen hier Enabled gleich Yes. Falls das geht dass das automatisch neu startet beim Reboot. Gut. So. State. Started. Gut von der Idee her da sollt ihr jetzt eine neue Version deployen. Stoppen und starten. Das ergibt Sinn. Mal gucken ob das auch funktioniert. Deploy. Bam. Ich mache erstmal einen Stop. Jetzt hier einen Status. Ah das ist aus. Enable Kack W ist das Service. Und jetzt Leute das funktioniert. Das ist ja geil. Guck mal da also viel einfacher kann es jetzt ja nicht mehr gehen. Jetzt kann ich mal den ganzen Krempel hier wieder einkommentieren. Den wir zwar nur einmalig brauchen aber sei es drum. Jetzt habe ich mit einem Kommando den kompletten Server auf den aktuellen Stand gebracht. Ne ich könnte nicht reloaden weil ich will ja explizit hier oder ich weiß nicht ob das geht. Checkt ihr das mit demen Reload auch wenn ich hier restartet oder so mache. Müssen wir mal ausprobieren. Bam. Ah sehr nice sehr nice. Ok. Build jetzt baut er lokal die App. Er stoppt den Service. Ok. Restart. Restart. Restart. Oh mal Restart. Das heißt wenn ich jetzt Status mache dann ist der Kram auch ab seit 7 Sekunden. Das funktioniert. Nice. So also 60. 5. Kack W erstes Service ist wieder da Leute. Euer Lieblings Start Up ist wieder verfügbar. Ja wunderbar. Da haben wir doch richtig richtig was gemacht jetzt schon cooles. So und das richtig nice daran ist jetzt ich könnte einfach einen zweiten Server machen und sagen bau mir den Server so auf und dann funktioniert einfach. Richtig nice oder? Ja ich ich gehe einfach von aus das Unit File wird sich reloaden. Das ist äußerst nice. Ok. Lass mal kurz überlegen. Müssen wir noch irgendwas machen? Server erstellen haben wir gemacht. Ansible Kram haben wir auch. Ja gut wir müssen mal testen ob es überhaupt noch funktioniert. Wir müssen wir müssen mal testen ob es überhaupt noch funktioniert. Ich mache jetzt mal eine Änderung. Ja ja ich truste alles hier Bam. Alles wird getrusted. So wir machen jetzt mal eine Änderung und deployen die. Das schauen wir mal ob das wie gut das funktioniert. Wie kann ich denn jetzt eine Änderung machen die möglichst offensichtlich ist. Ok. Ich returne nicht File. Ich returne. Ok. Also anstatt einem Bild bekommt ich jetzt einen Text wo keqw drinne steht. Soweit von der Idee her. So und ich muss nichts anderes machen außer den Source Code ändern. Lokal ausprobieren habe ich schon gemacht. Gehe einfach mal von aus das es geht. Und jetzt führe ich meine Ansible Geschichte aus und er sollte komplett bilden deployen hinschieben restarten. Gucken wir mal. Noch ist es das alte. Install Packages ja ja bla bla bla. Das könnte man ja auch rausnehmen. Oh. Create Service File. Ok Bild. Jetzt baut er die neue App. Copy App. Copy App geht schnell weil er Sync. Commit. Ja Commit mache ich gleich. So und jetzt. Easy Leute. Also einfaches Update Bild und deploy kannst du nur wirklich nicht machen. Zack und jetzt das ganze wieder rückgängig. Rückgängig. Mist falsche Version. Neue deployen. Gut diesen Mist könnte man echt noch raus machen dass man einfach nur sagt One Time wenn der Server neu ist oder sowas. Kann man. Kennt sich jemand mit Ansible aus könnte ich sagen nur. Nur einmalig oder sowas gibt sowas. One One Time oder. Weil diesen Mist kann er sich ersparen im Endeffekt der anderen Seite viel. Lange dauert das ja auch nicht. So und jetzt hat er neu gestartet schon. Jetzt haben wir wieder Bilder. Ist das nicht nice. Also also also einfacher geht das mit Bild deploy wirklich jetzt nicht. Außer vielleicht man hat schon einen fertigen irgendwie Container Cluster wo man einfach direkt geht Push machen kann. Das ist cool. Ok jetzt machen wir nochmal ein Commit. Dass ihr euch das alle angucken könnt. Im Shit Hub. Äh ne ich will kein Hetznergedöns hier einbauen weil ich will ja nicht bei jedem ausführenden neuen Server anlegen. Widerspricht dem Grundgedanken von Ansible was? Warum hast du die Systemdion nicht als Einzeldatei kopierend wird? Äh dass ich alles in einer Datei stehen hab. Mach das updaten doch mit Cron. Naja ne will ich nicht. Weil ich will ja wenn ich den Server neu aufbaue jetzt instant erst mal updaten. Ach so meinst du äh Michi dankeschön für den Zapp. Du meinst dass man äh was Disabled widerspricht dem mit dem Gedanken. Weiß nicht sagst du. So also erstmal ein Shit Commit. So und da brauchen wir jetzt erstmal noch ein Git Ignore File. Git Ignore. Git Ignore. So und da soll rein meine ganzen Binaries weil die will ich garantiert nicht nicht auf auf Shit Hub packen. So. Object Bin. Noch irgendwas. Ne. Passt. Oh hab ich das jetzt richtig gemacht. Shit Shit Ignore. So Git Ignore ist am Start. So passt mehr brauchen wir nicht. Git Status Git Add minus A. So und jetzt sind wir mal nett. Wir äh wir schmeißen dieses komische Commit hier weg. Git Commit minus A minus Amendt und sagen nicht LULW sondern äh Ansible ist POC U. Ich hab auch die ganzen Bilder eingecheckt LUL. Ja gut warum nicht die braucht man ja dafür. Also Server Name. Hab ich irgendwelche haben ich irgendwelche geheimen Secrets Committed. Lass mich mal kurz checken. Aber ich glaube nicht ich wüsste nicht wo es da was gibt. So die ganzen Bilder Index das könnt ich noch löschen. Upsettings Startup Launch Settings. Ne passt passt passt passt. Ok Git Status. Alles klar. Äh Git. Push. Push. Force Bam. So Shit Hub wird geupdatet. Git Hub Wubblurts. Ne. Keck W as a Service. Also jeder der schon immer mal sein eigenes Keck W as a Service laufen lassen wollte kann das jetzt machen. Weil der einzige Source der Nennenswert irgendwie was drinne steht ist ja die Datei alles andere ist ja Default. Es ist ja wirklich die einfachste Web Anwendung aller Zeiten die es hier irgendwie gibt. Ja das ist das ist nice. So und wisst ihr wisst ihr was wirklich richtig richtig cool da dran ist. Ich zeig ich zeig das jetzt noch mal in Action. Weil ich glaube man hat es immer noch nicht so genau verstanden was der Vorteil davon jetzt ist gegenüber Hand das von der Hand zu machen. Stellt euch mal vor ich mache noch einen zweiten Server. Ich leg jetzt noch einen zweiten Server an hier. Keck W as a Service NG. Leg einen zweiten Server an. Weil Keck W as a Service ist einfach so krass beliebt dass ich mit einem Server komme ich nicht hinterher. Der ist zu ausgelassen. Ich brauche ich brauche noch einen zweiten Server. So zweiten Server angelegt. Ansible ausführen. Ansible ausführen auf den zweiten Server. Warten bis durch läuft und danach einfach auf den zweiten Server Keck W as a Service aufrufen der was es noch nicht gibt weil es noch nicht fertig ist. Run once. Oh das ist cool. Manche Sachen will ich wirklich nur einmal machen. Ach ne ne ne das geht wenn es verschiedene Hosts sind das ist was anderes. Ist bei der Serveranlage Python direkt drauf? Ja. Firewall soll ich nicht vergessen. Brauche ich nicht. Weil standardmäßig ist ja keine Firewall davor. Muss ich nichts anpassen. So neuer Server der geht jetzt da drauf macht Package Updates und danach bildet er und deployt er die App. Mal gucken jetzt sehen wir auch ob es auf dem neuen Server reibungslos funktioniert. Auf was für einem Server deploysst du das mach mal Ausrufezeichen Hetzner im Chat. Ich deploy das bei Hetzner in die Cloud. Wo es relativ günstig schon virtuelle Linux Kisten gibt. Ganze geht los bei 3 Euro. Ihr könnt euch übrigens jetzt auch 20 Euro Startguthaben sichern wenn ihr den Link hier im Chat verwendet. Mit meinem Code kann man bis Ende des Jahres glaube ich einlösen. Und da könnt ihr euch selbst ein bisschen austoben. So ok Copy App macht er jetzt. Ja die kleinen Server werden mit IPv4 bald ein ticken teurer weil es immer knapper wird. So Copy App das dauert jetzt ein bisschen länger weil er irgendwie 100 MB erstmal hoch kopieren muss. So Restarting KEC WSS Service. Ok jetzt kommt der Moment der Wahrheit. Bäm Leute 2. Server up and running. Wir mussten nix machen. Wir mussten nix machen. Guck schon haben wir 2 KEC WSS Services am Start. Ist das nicht nice? Das kann nur noch getoppt werden von irgendeinem kontainerisierten Deployment mit Loadbalancer davor. Guck mal jetzt haben wir doppelt KEC WSS Service. Das ist dann quasi KEC QWSS Service. Ne Engine X und Loadbalancer davor machen wir das nächste Mal. Das machen wir heute nicht mehr. Ich finde das richtig nice. Ich finde das richtig nice ey. Guck hier neuen Server erstellen. Zack hier die IP reinhauen bald ist ein neuer Service da. Also viel schneller besser kann das gar nicht mehr funktionieren. Kokieren neue Server erstellt. Bäm IP rein kopieren. Playbook ausführen. Ok ich war zu schnell der Server ist noch nicht oben. Also viel einfacher und besser geht das jetzt nicht mehr. Genau das machen wir also in Stream Nummer 3 machen wir ein bisschen Containerstells. Ich bin mir nicht sicher ob wir da wirklich irgendwelchen Kubernetes Kram machen. Da bin ich jetzt nämlich auch nicht der absolute Pro drinnen. Ich meine ich kann Sachen da deployen stoppen starten und was auch immer. Aber so der Wahnsinnskenner bin ich da jetzt auch nicht. So eine Wissenschaft für sich. So install Packages. Hey swarm ist deprecated. Auch wenn der Hersteller sagt es ist nicht deprecated. So gleich ist es durch. Ich meine guck mal wir haben jetzt innerhalb von 2 Minuten 2 Server hingestellt. Mit lauffähiger Anwendung drauf. Also so kann man das schon ordentlich skalieren auch ohne Containerkram. So guckt Bäm Port 80 zack schon haben wir 3 Server. Keqv SSService. Und das tolle an Keqv SSService deswegen solltet ihr euch jetzt schon mal ein paar Aktienpakete sichern ist dass es komplett stateless voneinander horizontal vertikal und diagonal skaliert. Habt ihr gesehen wir haben den Keqv getroffen der der richtig richtig rotiert war. Ist es nicht nice. Doch das gefällt mir richtig gut. So bei der Gelegenheit jetzt noch mal kurz Server löschen. Das ist übrigens auch das coole ich kann die Server jetzt löschen dann kosten sie mich nichts mehr und wenn ich sie wieder brauche innerhalb von 2 Minuten neu aufbauen. Moment Leute eins ich probiere ich probiere jetzt mal was aus ich will das noch mal ganz ich will das noch mal schnell verskripten das dauert nur 2 3 Minuten glaubt das natürlich ich lösche den ganzen Krempel jetzt mal wieder. Keqv SSService ich mach jetzt ich mach jetzt. Äh äh die Kuppanete slide ne stimmt ja nicht. Das hatte mit Containern nichts zu tun aber ich könnte doch guckt mal ich leg den neuen Server an dann krieg ich am Ende da raus IPv4. So Moment Moment Moment Moment Moment jetzt jetzt 5 hat Maut richtiger 5 hat Maut das das muss ich jetzt ausbrennen. Wir nehmen einfach die letzte Zeile wie ging letzte Zeile tail minus n 1 das muss ich jetzt mal ausprobieren. Echo minus e 1 2 tail minus n 1 jawoll tail minus n 1 hat an an doppel an an punkt fällt 2 ok das muss ich jetzt mal ausprobieren ob das funktioniert jetzt jetzt kommt massive massive 5 hat mal gucken ob das funktioniert ok ok wobei ich machs glaube ich besser am Leerzeichen ach so ah ja ja ja ich lösche es ist ja gut ich lösche es ja schon wieder ich lösche es. So das muss ich jetzt das muss ich jetzt ausprobieren dann scaleen wir das jetzt auf 10 Stück hoch einfach einfach weil es geht ok wunderbar so jetzt muss ich noch den Namen ändern wieder löschen zack ok also 4 in 0 bis 10 ich glaube so viel darf ich gar nicht anlegen ich bin mir gar nicht sicher wie viel ich in einem Projekt anlegen darf machen wir mal machen wir mal 4 machen wir mal 4 ne ich bekomme keine mails weil ich keys verwende so keck w ss service hier done so jetzt lege ich server an und jetzt will ich danach das bei ansible über ansible ausführen also sagen wir jetzt du habe ich vergessen ansible hier ansible playbook ansible playbook warte mal warte mal ansible playbook hier hier kommt die ip rein also das das da hier rein so 6 hat time leute ob das jetzt funktioniert so wenn das jetzt stimmt was ich da gemacht habe dann sleep ja dann sleep sollten wir machen weil der server sonst nicht hochgefahren ist das stimmt wo mache ich den sleep rein ah 4 in das mit dem sleep funktioniert jetzt nicht richtig ok moment moment kommando zurück wir machen das anders wir schreiben das in eine variable rein ip gleich so machen wir das ip gleich sleep 1 oder sleep 5 ip ausgeben und jetzt kommt der ansible stels ob das jetzt funktioniert leute was ich da zusammen gewürstet habe das habe ich das habe ich früher täglich gemacht so so bash geschichten hier dollar ip so ja ergibt das sinn was ich da programmiert habe also 0 bis 3 so ip hetzer cloud anlegen service benennen mit dem aktuellen schleifendurchlauf du hast das i vergesst ah vor i in tail cut echo ip sleep 5 und anders playbook laufen also ok von der idee her sollten wir jetzt gleich vier kqs service am start haben ah du schauen wir mal das könnte man übrigens parallel machen lassen der desktop ist i3 ja also halt ohne ohne desktop oh ne ich glaube ich glaube mein sleep reicht noch nicht mein sleep ist zu kurz mein sleep ist zu kurz mist abbruch abbruch kommando zurück die kisten sind noch nicht aufgebaut sleep ist zu kurz wir machen das parallel pass mal auf wir können das noch wir können das aus 6 hat können wir können wir 7 hats skript machen alter ist gut ich will löschen wir machen das jetzt parallel ok sleep sleep 10 das reicht jetzt aber 15 wie kriege ich das jetzt im hintergrund wie oh fuck das weiß ich kann ich einfach an der stelle und und dran machen bringt das was ne das ist ansible an der stelle äh wie kriege ich denn das jetzt irgendwie mit mit mit mit klammern das muss ich jetzt mal testen vor i in testweise 0 bis 3 3 3 ne das ne einfach und geht nicht echo 1 dann ok ich will sleep ich will sagen sleep 2 echo 1 so 1 2 bam so und jetzt mal gucken ob ich das ganze irgendwie hinkriege dass das dass das im hintergrund ah klammern muss man es klammern muss man es dann funktioniert genau klammern muss man es wobei das ich glaube das kommt sich in die quere weil ich ip doppelt belege und sowas keine ahnung wir probieren es einfach mal aus und jetzt und keine ahnung ey guck mal guck mal parallele server zeug da schon mal ja das das funktioniert schon mal es geht da nein nein fast fast ist handpferde fast funktioniert ssh connect to host unreachable ist ist das lieb ist das lieb immer noch zu langsam ich weiß nicht wie man über die kommando zeile deleted deswegen muss ich immer so machen bau ein wait for connection ein das ist eine gute idee in netcat oder so jemanden gute jemand eine gute idee 15 15 ich hab's ich hab's noch auf warum erstell oh terraform das ist eine gute idee das machen wir in stream nummer 3 das passt nämlich richtig zu container stellts deployment nächsten stream bauen wir eine kleine api noch ein machen github actions continuous integration pipeline geschissen bisschen load balancer zertifikat und im dritten stream dazu machen wir container stellts und terraform das ist eine gute idee max ansible wait for connection ah woh wohin ansible wait for connection wie funs das hier examples wait for connection ich teste das jetzt erst mal mit dem sleep drinnen sleep 20 ob das funktioniert man wenn die streams immer sein sonntags wahrscheinlich schon ok 3 4 5 6 7 8 9 10 11 12 13 14 15 das könnte fertig sein sind 17 18 19 20 ok zählen kann ich nicht aber fast ok mal gucken ob es jetzt funktioniert das sieht gut aus das sieht gut aus das hängt schon viel länger massive scalierung hier angesagt wo ich mir nicht ganz sicher bin das backt doch rum oder ich meine ich mache hier ip aber wobei das hier könnte shell locals sein die variable und nicht global und deswegen ist es kein problem wenn ich das parallel mache bash ist aber da zu 6000 hat für als dass man da noch durchblickt netket aber die idee hier einfach das einzubauen beim ansible ist wahrscheinlich das beste funktioniert leute es funktioniert es funktioniert er deploit mir 4 server parallel so und danach sollte keck weheste service funktioniert ok ha cloud list server list oder auch nicht doch mal gucken wenn er fertig ist wenn er fertig sollte hier auf auf allen auf allen keck weheste service laufen moment hellsinki warum habe ich die warum warum sind die in finland die server ok bäm oh was oh nein oh das geht nicht gibt es doch irgendwelche race race conditions aber der ist noch gar nicht fertig der ist noch gar nicht fertig wait a minute der war noch gar nicht da war noch gar nicht durch jetzt ist keck weheste service da also leute ernsthaft einfacher mal übrigens ihr seht dass es transparent ist wegen dem hintergrund ich weiß nicht warum das da so ein shit macht bei chrome wir haben jetzt quadruple usd service keck quadruple usd service ich bin ich bin echt begeistert wie cool das ist mit mit diesem mit hier in dem fall mit dem ansible playbook haben wir noch irgendwelche shit commits die wir noch nicht gemacht haben also wer sich das alles ein bisschen näher angucken will was ich heute fabriziert habe ihr findet das bei mir alles auf github jetzt hat sein eigener load balancer die probieren beim nächsten stream aus wer sich das nochmal angucken will kann sich das hier alles anschauen wir machen noch mal was in die read me streamprojekt blurz switch und bisschen werbung machen dürftest du das shell script noch mal sehen welches welches shell script meinst du das ansible ding ich hab hier meine aliasse nicht git commit minus a minus m 0 w größer keck w read me beste aussage kräftigen commits aller zeiten ist alles im repo drin jetzt machen wir auch ein bisschen werbung streamprojekt es ist und wisst ihr was das coole ist es ist doch echt überschaubar es ist jetzt nicht als wäre das wahnsinnig viel source code ich meine die web anwendung ist lächerlich es ist jetzt nicht als wäre das wahnsinnig viel source code ich meine die web anwendung ist lächerlich wenig source code im prinzip ist das alles was da irgendwie die logik macht jetzt das ansible ding ist jetzt sagt man jetzt bei ernsthaft es ist gut lesbar und es ist auch nicht viel es sind 78 zeilen da kannst du dich ja echt nicht beschweren so der richtet den server ein mit unit file allem schon fertig macht ein bild für lokal von der anwendung und deployt das ganze also ich kann euch schon sagen auch wenn wir das die nächsten nächsten streams etwas modernisieren werden so ein bisschen eher so das in der richtung wie das heute gerade angesagt ist einfacher wird es dadurch garantiert nicht allein schon wenn wir das wenn wir das das das bild über über github action machen und so was man muss man sich jetzt ernsthaft fragen ich mein für ein stream machen wir das einfach weil es weil man dann was lernen kann aber wenn ich diesen kram jetzt so betreiben würde dann würde ich mich allen ernstes fragen macht das sinn bei so was kleinem macht das sinn reicht es nicht aus wenn ich das auf einem server habe dass ich einfach ein ansible script ausführe nachdem ich einen commit gemacht habe auch ich irgendwelche container stels geschichten und sonst was man muss es ja nicht man muss ja mit agilität nicht übertreiben wenn es das dreimal komplizierter macht auch wenn man dann vielleicht nicht cloud native big brain blockchain ai ist also ich bin mir geistert sehr gut sehr gut excellent tja leute noch mal eine runde sellout diesen streams werden möglich gemacht durch meinen partner hetzner cloud wenn ihr euch das ganze auch mal angucken wollt oder vielleicht auch hier mal mit dem beispielprojekt aus dem stream rum experimentieren wollt dann könnt ihr euch jetzt 20 euro startguthaben sichern ausrufe zeichnen hetzner in chat und wenn ihr euch mit meinem code anmeldet kriegt ihr 20 euro startguthaben und ihr seht für 20 euro kann man schon ganz ordentlich was machen ihr könnt euch entweder in eine fette kiste holen oder also fett in anführungsstrichen 3 cpus 4 gigabyte ram das zwei drei monate laufen lassen oder was kleineres das gute ist dass das ganze stündlich abgerechnet wird das heißt selbst wenn ihr das habe ich selbst schon verwendet nur als neukunde nur als neukunde ja ich weiß nicht ob sie was gegen fake accounts haben deswegen sage ich da jetzt nichts zu was ich auch schon mal benutzt habe ist diese geschichte hier aber glaube ich sogar im stream gemacht diese geschichte hier also wenn man mal was braucht mit nein jetzt nein jetzt noch ich will lass mich prising gucken wenn ihr mal anwendungszwecke habt dass ihr was richtig fettes braucht dann könnt ihr euch auch das hier mieten ich habe beispielsweise mal open street maps preprocessed das braucht extrem für routing information das braucht extrem viel ram ob die gpu instanzen haben habe ich noch nicht gesehen ich glaube nicht und habe ich mir so eine kiste hier gemietet das hat vier stunden prozess und der vorteil war ich habe dann am ende 23 euro bezahlt im monat kostet es zwar 321 aber ich habe das ja nur vier stunden gebraucht und ich habe diese leistung einfach nicht lokal ansatzweise gehabt um es damit machen zu können so so sieht es aus dankeschön für die ganzen subs leute wenn ihr in zukunft auch immer live mit dabei sein wollt könnt ihr auch bei mir auf youtube und twitch und twitter und wo auch immer vorbeigucken wir hatten hier alles subscribt jenna am start vier monate huge project ja aber richtig der michi ist auch am start muniradur hat auch subscribt für drei monate ribbonsch vor einer stunde und der virus der schnabulator auch danke für die subs leute ja wenn es euch gefällt freue ich mich immer über jeden sub zumal ich jetzt ja auch noch weniger bekomme weil twitch der meinung ist die sub in die subpreise umgestellt zu haben heißt ich brauche jetzt mehr subs für weniger geld was aber nicht schlimm ist also ich habe nicht angefangen zu streamen wegen wegen big stonks money das wisst ihr ja und ich muss sagen ich bin mal wieder begeistert über den chat es gibt keinen anderen channel der so non-toxic ist mal chain law außen vor genommen außen vor der so non-toxic ist und so big brain wieder chat bei mir loll wein nicht noch js warum nicht cobalt noch besser fort ran ja es sind sehr boom aber die auf der also noch boomerische boomer als als bei mir auf der arbeit soll ich gehe jetzt noch mal schnell durch den chat durch aber schauen ob ich irgendwelche sachen überlesen habe wie gesagt denkt dran entwupplose schreiben sonst übersehe ich die ganzen comments so haben wir nix wie gesagt weiß ich nicht glaube nicht da sieht man doch eindeutig toxic hier willst du die domain keck wie services dafür haben ja das wäre richtig gut keck wie punktservices die nämlich die müssen wir auch nicht transferieren ich kann dir für dns einfach die ip geben transferieren ist immer dass das das sind die die law die law end provider zu zu 3 hat für ob und oder liebste serverlinienungs ja das stimmt genau das ist es es ist natürlich cool wenn du dir dann irgendwie was erzählen kannst von hyper hyper skaliertem kupa netes jetzt könnte man daraus jetzt machen hyper skaliertes kupa net cloud native hyperskalierendes cloud native kupa netes continuous deployment oder sowas ja natürlich das ist cool aber manchmal muss es einfach nicht sein und in dem fall würde ich echt sagen das ist so simpel das projekten gerade mit ein paar servan warum da irgendwie eine große als sache noch drumherum bauen schon spät nee spät ist es erst ab 22 uhr nicht okta ju stimmt es ist vier fahrt vierfach wes okta ju keck okta ju was wäre sieben fach koch sepp sepp da ju was ist neun was ist neun auf lateinisch weiß ich nicht was ist neun nona das habe ich noch nie gehört hier schauen wir mal kap kap ja nicht viel hier also wenn ihr was wissen wollt schreibt die frage ruhig in chat bin jetzt noch halbe stunde da wenn man den namen weglässt ja ich will ja nicht mehr haben ich will da sehen wozu sie gehören ach so habe ich die server jetzt eigentlich alle gelöscht oder ist keck ws service immer noch da ok ks service läuft ja noch vielleicht sollte ich die kisten mal wieder löschen sonst sonst wirds teuer heute nacht ich habe glaube ich nix übersehen wenn ich hier so durch scroller hatten wir ja ne holprig habe ich doch irgendwas anderes mit gemeint naja na gut ich muss dir ehrlich sagen so ich als boomer linux admin die standard bash skripte für das alte im it hatten auch schon seine vorteile zum beispiel hätte ich da irgendwie den health check rein hacken können was bei system der nicht gescheit funktioniert also in health check zum beispiel der irgendwie in den wege macht alle fünf sekunden also halt wie gesagt wirklich wirklich nur irgendwie rein rein basteln der hatte eigentlich nix zu suchen ja hier wieder was gelernt richtig richtig 6 hat wusste nicht dass man das machen kann er wusste es auch aber im unit file ist natürlich schöner funktioniert über hetsner auch so was wie proxmox zu hosten ja natürlich ach so du meinst in der cloud da wäre ich mir nicht so sicher das wäre ja das wäre das wäre ja quasi nested virtualisierung da würde ich mir wahrscheinlich bei der server aktion lieber einkaufen also ich weiß nicht genau wie die linux virtualisieren ich vermute mal dass es kvm und nested virtualisierung ist eines der anwendungszwecke wo ich mir wo ich wirklich genau drauf gucken würde ob es ordentlich funktioniert also du bist auf windows in vmw in linux der auf einem hetsner server ist ja korrekt ich bin auf windows hab da meine vm und dort war ich eingeloggt auf dem linux server genau so siehts aus habe ich die habe ich eigentlich die sub alerts aus kann das sein tatsächlich soll ich die auslassen oder anlassen sagt man man hört es aber anstört ich da lassen wir es an micky van b dankeschön für den zapp ok ich glaube ich habe nichts übersehen so schauen wir nochmal runter fast ja proxmox auf den richtigen hardware server ja wundert mich nicht sag mal blue media ich weiß nicht irgendjemand aus dem chat arbeitet bei hetsner und hat mein stream an die marketing abteilung weiter geleitet warst du das jetzt sagt jeder ich ja jetzt sagt jeder ich nee machst du eigentlich noch irgendwann ausbildungs story video ja klar als nächstes mache ich die geschichte über den azubi der illegale sachen bei uns im rechenzentrum geostet hat da muss ich aber echt aufpassen dass ich alles anonymisieren dass ich nicht mal den vornamen den richtigen nenne ja wir hatten mal ein azubi der hat bei uns auf den server unten ich habe mich die ganze zeit immer gefragt was was was macht er mit was macht er mit vmw wir hatten ein azubi wir hatten ein zubi vmw cluster und er hat die ganze zeit rum genervt ob er den nicht mal neu machen kann den azubi vmw cluster er hat gesagt ja ich setze ihn auf neue hardware ich mach das neu das ist doch viel besser da können wir üben und alles und bis bis also nicht bei mir ich hatte damit nichts zu tun also der war auch der azubi war auch bei mir aber mit der eigentlichen sache nicht nichts zu tun bis dann hat irgendwann einer gesagt naja gut dann mach halt den azubi esx cluster neu und bis dann irgendwann mal jemand dahinter gekommen ist was der macht es ging überhaupt nicht es ging überhaupt nicht darum dass er den azubi esx cluster neu aufbaut sondern er wollte den also nicht nicht nicht aus reiner nächsten liebe der wollte den azubi esx cluster neu aufbauen weil er darauf illegales stream also was ist illegales streaming der hat ein streaming server also er hat einen streaming dienst gehostet mit film drauf der hat sogar ein werbevideo auf youtube gemacht für den streaming dienst der hat natürlich keiner der rechte oder sonst was in der richtung der hat sogar ein werbevideo richtig richtig schlechtes aber sogar ein werbevideo auf youtube gemacht und das alles liegt bei uns im rechten zentrum wie lang hat das gedauert das weiß ich tatsächlich nicht weil ich hab wie gesagt ich war nicht daran beteiligt an an an an der aufdeckung ich vermute mal so zwei drei wochen also es lief schon ein bisschen das ist auch der erste und ich glaube auch bis jetzt einzige azubi der nicht übernommen wurde und auch nicht die alibi 30 nicht die alibi halbes jahr hintendran her endpunkt wurde auch übernommen ein halbes jahr aber das ist der erste azubi der komplett gekickt wurde danach den hätten sie eigentlich schon während der ausbildung kicken können wahrscheinlich wollte das keiner an die große klocke hängen ist der preis gem schon profitabel mit den reflings der preis gem hat nur in amazon refling und er kommt so selten dran das glaube ich erst einer bisher je was über amazon gekauft hat lohnt sich überhaupt gar nicht preis gem bezahle ich jeden monat irgendwie 50 euro für nix bald auf status kw service das finde ich ist eine gute idee was läuft eigentlich auf kw was läuft eigentlich auf kw punkt service gerade nix aber die domain die die machen wir dafür das ist das ist richtig gut weil den uns des droben mancharo mit e3 wm so der aua wird auch gesponsert ja habe ich gesehen materius ich bin gleich auf 20 minuten noch wir sind mit dem projekt für heute auch schon durch der typ der typ hat echt gedacht er ist massive big brain dabei ist es eigentlich eines der lausten aktionen die du machen kannst hat er wenigstens die vms ich weiß es nicht keine ahnung ich habe den klasse nie in action gesehen aber nachdem ist der azubi vm klasse aber hat er eh keiner drauf geguckt ja man wollte es wahrscheinlich an die große glock ja ich würde mit der endpunkt gerne ein video aufnehmen aber der hat gerade wohl bisschen bisschen was ich probleme jobmäßig ich weiß nicht genau lange nichts mehr gehört aber er hat gesagt er will auf jeden fall was aufnehmen ich mache da keine ads drauf ich sehe nicht was du bestellt hast ich sehe nur was bestellt wurde nicht wer da was bestellt hat heute was da über meine ref links teilweise bestellt wird ich gucke da aber mittlerweile ich habe da früher immer mal reingeguckt weil es interessant fand mittlerweile gucke da rein wie alt bist du eigentlich oder ist das geheim ich meine es weiß ja eh schon jeder ich bin 36 stimmt nicht stimmt nicht ich bin 37 ich bin 37 geworden vor nicht allzu langer zeit 37 das war nun ein vorwand gehe ich mal von aus dass er neue hardware bekommt der wollte neue hardware haben für den neuen azubi esx cluster und wie ist das am ende aufgeflogen das ist eine gute frage wie gesagt ich war dann ich war da nicht so involviert ich muss ich frage man nächste woche bei mir das mitgekriegt hat ich kenne ich kenne das youtube werbevideo von ihm aber ansonsten habe ich da nicht viel mitgekriegt den triggert immer rechtsklick kopien muss dich nicht triggern das ist muss man so machen das werbevideo noch online weiß ich nicht ich weiß gar nicht wie die die hat er ich das ist echt eine gute frage wieder das gemacht hat irgendwie hat er sich ist nicht immer gucken er meint er war nicht blöd er hat es halt übertrieben das ist ein reverse proxy naja so ein bisschen das gegenteil von einem normalen proxy normaler proxy greift so mit kleins drauf zu der dann stellvertretend für dich ins internet geht die seite abruften dir zurückschickt reverse proxy ist umgedreht das steht zwischen server und dem internet du greifst aus dem internet drauf zu wirst weitergeleitet an server und die antwort kommt zurück zu dir das machst du zum beispiel wenn du irgendeine web anwendung hast der du nicht so ganz draus unter irgendwas robustes davor haben willst was das internet faced oder wenn du vielleicht basic aus davor machen willst weil es deine anwendung nicht kann oder wenn du zertifikatsmanagement handeln lassen willst von irgendwas was es ordentlich macht und ich irgendwie selbst einbauen willst und so was also ich würde ich würde auch keck ws service nie ins internet hängen direkt das war heute zum testen da kommt immer da kommt immer ein reverse proxy davor es geht nicht um entweder oder du kannst einen docker container laufen lassen und mit einem reverse proxy den ansprechen du kannst auch ein reverse dem docker container laufen lassen aber ein reverse proxy ersetzt kein docker container ein docker container kein reverse proxy weil beides zwei komplett unterschiedliche arten an dingern sind also hat noch nicht mal hat noch nichts mal miteinander was zu tun ja die server gibt es nicht mehr ja wenn du eine webseite hast also wenn du selbst in web server laufen hast also eine web anwendung laufen hast dann ist es sinnvoll davon reverse proxy zu machen und darüber zertifikats handling und solche solche sachen abzufackeln ja aber das kannst du dir auch downloaden also das ist jetzt nicht so das problem ja der typ der typ der sieht wahrscheinlich der typ also mr snot die hätte uns jetzt erstmal erzählt dass reverse proxy benutzer grüne wähler sind oder irgendwie sowas in der richtung ist die server handling auch in stream beziehungsweise video ich habe vor ein paar wochen so ein bisschen linux einsteiger server mäßig gemacht aber das war ein bisschen unstrukturiert da mache ich vielleicht noch mal was zu im prinzip das beste was du machen kannst um was zu herten keine ports aufmachen was nicht läuft kann ich angegriffen werden fertig ansonsten sind wenn du wenn du bei hetzena sagt man mal hetzena ubuntu und den server ist jetzt sind die schon ziemlich sicher vorkonfiguriert da musst du nicht viel machen für komfort würde ich das über ss h keys machen einfach dass man kein password eintippen muss passwort was nicht eingetippt werden muss kann auch nirgendswo abgegriffen werden oder die auch keine über die schultern gucken ja also habe ich jetzt meine ganzen services gelöscht ja ja es ist exzellent kacke ss service hat richtig richtig startup mäßig eingeschlagen das ist hundertprozentig jemand aus dem chat was ist das denn junge junge ist das bei mir unter video das bestimmt ist das nordisch zweite korn unter welchem video ist das wo ist das drunter hast du nicht demnächst geburtstag ich hatte geburtstag jetzt bin ich m6 90 fps unter welchen video ist das jörg it junge junge noch nie so viel falsch aussagen in einem video gesehen wie heute schön ohne plan mit gameplay im hintergrund was in die welt präsent aber nicht mit fakten hinterlegen dank jetzt weiß ich das ist doch miss das nordisch zweite korn das ist doch das kann mir doch keiner erzählen ok ich suche jetzt unter welchem video das bei mir angeblich ist wahrscheinlich hat das photoshop gefakt oder sowas ne das ist überhaupt nicht bei mir unter dem video das hat er das hat er das hat er wahrscheinlich foto photoshop hast du nicht photoshop also ich habe ich habe in meinen ernsthaft ich glaube immer noch du tschie beides mich das gucken wir zwar das ist so ein video von einer telekom ich habe keine in meinen mails gesucht aber nix gibt es nicht das kommandar das ist jebaited ich sag doch der chain als richtig krasser jebader jetzt hätte mich gewundert das hätte ich nämlich schon gesehen ja muss muss so sein oh das ist big brain na gut leute ich geh jetzt auf betke betke time ich hoffe euch hat das stream gefallen wir sehen uns die tage machts gut bis denn", "segments": [{"id": 1, "start": 60.0, "end": 84.4, "text": "Kack wie SSService"}, {"id": 2, "start": 84.4, "end": 112.72, "text": "Kack wie SSService"}, {"id": 3, "start": 112.72, "end": 138.64, "text": "Kack wie SSService"}, {"id": 4, "start": 138.64, "end": 166.64, "text": "Kack wie SSService"}, {"id": 5, "start": 166.64, "end": 196.56, "text": "Kack wie SSService"}, {"id": 6, "start": 196.56, "end": 213.84, "text": "Kack wie SSService"}, {"id": 7, "start": 213.84, "end": 220.24, "text": "Kack wie SSService"}, {"id": 8, "start": 220.24, "end": 235.44, "text": "Kack wie SSService"}, {"id": 9, "start": 235.44, "end": 249.36, "text": "Kack wie SSService"}, {"id": 10, "start": 249.36, "end": 262.48, "text": "Kack wie SSService"}, {"id": 11, "start": 262.48, "end": 284.64, "text": "Kack wie SSService"}, {"id": 12, "start": 284.64, "end": 304.72, "text": "Kack wie SSService"}, {"id": 13, "start": 304.72, "end": 321.6, "text": "Kack wie SSService"}, {"id": 14, "start": 321.6, "end": 342.48, "text": "Kack wie SSService"}, {"id": 15, "start": 342.48, "end": 361.36, "text": "Kack wie SSService"}, {"id": 16, "start": 361.36, "end": 380.24, "text": "Kack wie SSService"}, {"id": 17, "start": 380.24, "end": 395.12, "text": "Kack wie SSService"}, {"id": 18, "start": 395.12, "end": 412.4, "text": "Kack wie SSService"}, {"id": 19, "start": 412.4, "end": 427.28, "text": "Kack wie SSService"}, {"id": 20, "start": 427.28, "end": 444.16, "text": "Kack wie SSService"}, {"id": 21, "start": 444.16, "end": 459.04, "text": "Kack wie SSService"}, {"id": 22, "start": 459.04, "end": 485.92, "text": "Kack wie SSService"}, {"id": 23, "start": 485.92, "end": 502.8, "text": "Kack wie SSService"}, {"id": 24, "start": 502.8, "end": 517.68, "text": "Kack wie SSService"}, {"id": 25, "start": 517.68, "end": 532.56, "text": "Kack wie SSService"}, {"id": 26, "start": 532.56, "end": 549.44, "text": "Kack wie SSService"}, {"id": 27, "start": 549.44, "end": 564.32, "text": "Kack wie SSService"}, {"id": 28, "start": 564.32, "end": 581.2, "text": "Kack wie SSService"}, {"id": 29, "start": 581.2, "end": 596.08, "text": "Kack wie SSService"}, {"id": 30, "start": 596.08, "end": 612.96, "text": "Kack wie SSService"}, {"id": 31, "start": 612.96, "end": 627.84, "text": "Kack wie SSService"}, {"id": 32, "start": 627.84, "end": 644.72, "text": "Kack wie SSService"}, {"id": 33, "start": 644.72, "end": 659.6, "text": "Kack wie SSService"}, {"id": 34, "start": 659.6, "end": 676.48, "text": "Kack wie SSService"}, {"id": 35, "start": 676.48, "end": 691.36, "text": "Kack wie SSService"}, {"id": 36, "start": 691.36, "end": 708.24, "text": "Kack wie SSService"}, {"id": 37, "start": 708.24, "end": 723.12, "text": "Kack wie SSService"}, {"id": 38, "start": 723.12, "end": 740.0, "text": "Kack wie SSService"}, {"id": 39, "start": 740.0, "end": 754.88, "text": "Kack wie SSService"}, {"id": 40, "start": 754.88, "end": 771.76, "text": "Kack wie SSService"}, {"id": 41, "start": 771.76, "end": 786.64, "text": "Kack wie SSService"}, {"id": 42, "start": 786.64, "end": 803.52, "text": "Kack wie SSService"}, {"id": 43, "start": 803.52, "end": 818.4, "text": "Kack wie SSService"}, {"id": 44, "start": 818.4, "end": 835.28, "text": "Kack wie SSService"}, {"id": 45, "start": 835.28, "end": 850.16, "text": "Kack wie SSService"}, {"id": 46, "start": 850.16, "end": 867.04, "text": "Kack wie SSService"}, {"id": 47, "start": 867.04, "end": 881.92, "text": "Kack wie SSService"}, {"id": 48, "start": 881.92, "end": 898.8, "text": "Kack wie SSService"}, {"id": 49, "start": 898.8, "end": 913.68, "text": "Kack wie SSService"}, {"id": 50, "start": 913.68, "end": 930.56, "text": "Kack wie SSService"}, {"id": 51, "start": 930.56, "end": 945.44, "text": "Kack wie SSService"}, {"id": 52, "start": 945.44, "end": 962.32, "text": "Kack wie SSService"}, {"id": 53, "start": 962.32, "end": 977.2, "text": "Kack wie SSService"}, {"id": 54, "start": 977.2, "end": 994.08, "text": "Kack wie SSService"}, {"id": 55, "start": 994.08, "end": 1010.96, "text": "Kack wie SSService"}, {"id": 56, "start": 1010.96, "end": 1025.84, "text": "Kack wie SSService"}, {"id": 57, "start": 1025.84, "end": 1042.72, "text": "Kack wie SSService"}, {"id": 58, "start": 1042.72, "end": 1057.6, "text": "Kack wie SSService"}, {"id": 59, "start": 1057.6, "end": 1074.48, "text": "Kack wie SSService"}, {"id": 60, "start": 1074.48, "end": 1089.36, "text": "Kack wie SSService"}, {"id": 61, "start": 1089.36, "end": 1106.24, "text": "Kack wie SSService"}, {"id": 62, "start": 1106.24, "end": 1121.12, "text": "Kack wie SSService"}, {"id": 63, "start": 1121.12, "end": 1138.0, "text": "Kack wie SSService"}, {"id": 64, "start": 1138.0, "end": 1152.88, "text": "Kack wie SSService"}, {"id": 65, "start": 1152.88, "end": 1169.76, "text": "Kack wie SSService"}, {"id": 66, "start": 1169.76, "end": 1184.64, "text": "Kack wie SSService"}, {"id": 67, "start": 1184.64, "end": 1201.52, "text": "Kack wie SSService"}, {"id": 68, "start": 1201.52, "end": 1216.4, "text": "Kack wie SSService"}, {"id": 69, "start": 1216.4, "end": 1233.28, "text": "Kack wie SSService"}, {"id": 70, "start": 1233.28, "end": 1248.16, "text": "Kack wie SSService"}, {"id": 71, "start": 1248.16, "end": 1265.04, "text": "Kack wie SSService"}, {"id": 72, "start": 1265.04, "end": 1279.92, "text": "Kack wie SSService"}, {"id": 73, "start": 1279.92, "end": 1296.8, "text": "Kack wie SSService"}, {"id": 74, "start": 1296.8, "end": 1311.68, "text": "Kack wie SSService"}, {"id": 75, "start": 1311.68, "end": 1328.56, "text": "Kack wie SSService"}, {"id": 76, "start": 1328.56, "end": 1343.44, "text": "Kack wie SSService"}, {"id": 77, "start": 1343.44, "end": 1360.32, "text": "Kack wie SSService"}, {"id": 78, "start": 1360.32, "end": 1375.2, "text": "Kack wie SSService"}, {"id": 79, "start": 1375.2, "end": 1392.08, "text": "Kack wie SSService"}, {"id": 80, "start": 1392.08, "end": 1406.96, "text": "Kack wie SSService"}, {"id": 81, "start": 1406.96, "end": 1423.84, "text": "Kack wie SSService"}, {"id": 82, "start": 1423.84, "end": 1438.72, "text": "Kack wie SSService"}, {"id": 83, "start": 1438.72, "end": 1455.6, "text": "Kack wie SSService"}, {"id": 84, "start": 1455.6, "end": 1470.48, "text": "Kack wie SSService"}, {"id": 85, "start": 1470.48, "end": 1487.36, "text": "Kack wie SSService"}, {"id": 86, "start": 1487.36, "end": 1502.24, "text": "Kack wie SSService"}, {"id": 87, "start": 1502.24, "end": 1519.12, "text": "Kack wie SSService"}, {"id": 88, "start": 1519.12, "end": 1534.0, "text": "Kack wie SSService"}, {"id": 89, "start": 1534.0, "end": 1550.88, "text": "Kack wie SSService"}, {"id": 90, "start": 1550.88, "end": 1565.76, "text": "Kack wie SSService"}, {"id": 91, "start": 1565.76, "end": 1582.64, "text": "Kack wie SSService"}, {"id": 92, "start": 1582.64, "end": 1597.52, "text": "Kack wie SSService"}, {"id": 93, "start": 1597.52, "end": 1614.4, "text": "Kack wie SSService"}, {"id": 94, "start": 1614.4, "end": 1629.28, "text": "Kack wie SSService"}, {"id": 95, "start": 1629.28, "end": 1646.16, "text": "Kack wie SSService"}, {"id": 96, "start": 1646.16, "end": 1661.04, "text": "Kack wie SSService"}, {"id": 97, "start": 1661.04, "end": 1677.92, "text": "Kack wie SSService"}, {"id": 98, "start": 1677.92, "end": 1692.8, "text": "Kack wie SSService"}, {"id": 99, "start": 1692.8, "end": 1709.68, "text": "Kack wie SSService"}, {"id": 100, "start": 1709.68, "end": 1721.68, "text": "Kack wie SSService"}, {"id": 101, "start": 1721.68, "end": 1736.56, "text": "Kack wie SSService"}, {"id": 102, "start": 1736.56, "end": 1750.56, "text": "Kack wie SSService"}, {"id": 103, "start": 1750.56, "end": 1765.44, "text": "Kack wie SSService"}, {"id": 104, "start": 1765.44, "end": 1777.44, "text": "Kack wie SSService"}, {"id": 105, "start": 1777.44, "end": 1794.32, "text": "Kack wie SSService"}, {"id": 106, "start": 1794.32, "end": 1806.32, "text": "Kack wie SSService"}, {"id": 107, "start": 1806.32, "end": 1809.2, "text": "Kack wie SSService"}, {"id": 108, "start": 1809.2, "end": 1825.2, "text": "Kack wie SSService"}, {"id": 109, "start": 1825.2, "end": 1831.2, "text": "Kack wie SSService"}, {"id": 110, "start": 1831.2, "end": 1846.08, "text": "Kack wie SSService"}, {"id": 111, "start": 1846.08, "end": 1862.96, "text": "Kack wie SSService"}, {"id": 112, "start": 1862.96, "end": 1877.84, "text": "Kack wie SSService"}, {"id": 113, "start": 1877.84, "end": 1894.72, "text": "Kack wie SSService"}, {"id": 114, "start": 1894.72, "end": 1909.6, "text": "Kack wie SSService"}, {"id": 115, "start": 1909.6, "end": 1926.48, "text": "Kack wie SSService"}, {"id": 116, "start": 1926.48, "end": 1941.36, "text": "Kack wie SSService"}, {"id": 117, "start": 1941.36, "end": 1958.24, "text": "Kack wie SSService"}, {"id": 118, "start": 1958.24, "end": 1973.12, "text": "Kack wie SSService"}, {"id": 119, "start": 1973.12, "end": 1990.0, "text": "Kack wie SSService"}, {"id": 120, "start": 1990.0, "end": 2004.88, "text": "Kack wie SSService"}, {"id": 121, "start": 2004.88, "end": 2021.76, "text": "Kack wie SSService"}, {"id": 122, "start": 2021.76, "end": 2036.64, "text": "Kack wie SSService"}, {"id": 123, "start": 2036.64, "end": 2053.52, "text": "Kack wie SSService"}, {"id": 124, "start": 2053.52, "end": 2068.4, "text": "Kack wie SSService"}, {"id": 125, "start": 2068.4, "end": 2085.28, "text": "Kack wie SSService"}, {"id": 126, "start": 2085.28, "end": 2100.16, "text": "Kack wie SSService"}, {"id": 127, "start": 2100.16, "end": 2117.04, "text": "Kack wie SSService"}, {"id": 128, "start": 2117.04, "end": 2131.92, "text": "Kack wie SSService"}, {"id": 129, "start": 2131.92, "end": 2148.8, "text": "Kack wie SSService"}, {"id": 130, "start": 2148.8, "end": 2163.68, "text": "Kack wie SSService"}, {"id": 131, "start": 2163.68, "end": 2180.56, "text": "Kack wie SSService"}, {"id": 132, "start": 2180.56, "end": 2195.44, "text": "Kack wie SSService"}, {"id": 133, "start": 2195.44, "end": 2212.32, "text": "Kack wie SSService"}, {"id": 134, "start": 2212.32, "end": 2227.2, "text": "Kack wie SSService"}, {"id": 135, "start": 2227.2, "end": 2244.08, "text": "Kack wie SSService"}, {"id": 136, "start": 2244.08, "end": 2258.96, "text": "Kack wie SSService"}, {"id": 137, "start": 2258.96, "end": 2275.84, "text": "Kack wie SSService"}, {"id": 138, "start": 2275.84, "end": 2290.72, "text": "Kack wie SSService"}, {"id": 139, "start": 2290.72, "end": 2307.6, "text": "Kack wie SSService"}, {"id": 140, "start": 2307.6, "end": 2322.48, "text": "Kack wie SSService"}, {"id": 141, "start": 2322.48, "end": 2339.36, "text": "Kack wie SSService"}, {"id": 142, "start": 2339.36, "end": 2354.24, "text": "Kack wie SSService"}, {"id": 143, "start": 2354.24, "end": 2371.12, "text": "Kack wie SSService"}, {"id": 144, "start": 2371.12, "end": 2386.0, "text": "Kack wie SSService"}, {"id": 145, "start": 2386.0, "end": 2414.88, "text": "Kack wie SSService"}, {"id": 146, "start": 2414.88, "end": 2429.76, "text": "Kack wie SSService"}, {"id": 147, "start": 2429.76, "end": 2446.64, "text": "Kack wie SSService"}, {"id": 148, "start": 2446.64, "end": 2461.52, "text": "Kack wie SSService"}, {"id": 149, "start": 2461.52, "end": 2478.4, "text": "Kack wie SSService"}, {"id": 150, "start": 2478.4, "end": 2493.28, "text": "Kack wie SSService"}, {"id": 151, "start": 2493.28, "end": 2510.16, "text": "Kack wie SSService"}, {"id": 152, "start": 2510.16, "end": 2525.04, "text": "Kack wie SSService"}, {"id": 153, "start": 2525.04, "end": 2539.04, "text": "Kack wie SSService"}, {"id": 154, "start": 2539.04, "end": 2553.92, "text": "Kack wie SSService"}, {"id": 155, "start": 2553.92, "end": 2565.92, "text": "Kack wie SSService"}, {"id": 156, "start": 2565.92, "end": 2580.8, "text": "Kack wie SSService"}, {"id": 157, "start": 2580.8, "end": 2592.8, "text": "Kack wie SSService"}, {"id": 158, "start": 2592.8, "end": 2609.68, "text": "Kack wie SSService"}, {"id": 159, "start": 2609.68, "end": 2621.68, "text": "Kack wie SSService"}, {"id": 160, "start": 2621.68, "end": 2630.56, "text": "Kack wie SSService"}, {"id": 161, "start": 2630.56, "end": 2638.56, "text": "Kack wie SSService"}, {"id": 162, "start": 2638.56, "end": 2650.56, "text": "Kack wie SSService"}, {"id": 163, "start": 2650.56, "end": 2665.44, "text": "Kack wie SSService"}, {"id": 164, "start": 2665.44, "end": 2679.44, "text": "Kack wie SSService"}, {"id": 165, "start": 2679.44, "end": 2688.32, "text": "Kack wie SSService"}, {"id": 166, "start": 2688.32, "end": 2694.32, "text": "Kack wie SSService"}, {"id": 167, "start": 2694.32, "end": 2708.32, "text": "Kack wie SSService"}, {"id": 168, "start": 2708.32, "end": 2723.2, "text": "Kack wie SSService"}, {"id": 169, "start": 2723.2, "end": 2737.2, "text": "Kack wie SSService"}, {"id": 170, "start": 2737.2, "end": 2764.08, "text": "Kack wie SSService"}, {"id": 171, "start": 2764.08, "end": 2778.96, "text": "Kack wie SSService"}, {"id": 172, "start": 2778.96, "end": 2792.96, "text": "Kack wie SSService"}, {"id": 173, "start": 2792.96, "end": 2805.84, "text": "Kack wie SSService"}, {"id": 174, "start": 2805.84, "end": 2811.84, "text": "Kack wie SSService"}, {"id": 175, "start": 2811.84, "end": 2817.84, "text": "Kack wie SSService"}, {"id": 176, "start": 2817.84, "end": 2840.72, "text": "Kack wie SSService"}, {"id": 177, "start": 2840.72, "end": 2847.48, "text": "Dann machen wir es so, dann wird es jedes Mal neu angelegt, aber wir können es einfach"}, {"id": 178, "start": 2847.48, "end": 2848.48, "text": "so machen."}, {"id": 179, "start": 2848.48, "end": 2854.28, "text": "War random gleich Nuda, es ist dann halt bei jeder Anfrage eine neue Instanz, die ist"}, {"id": 180, "start": 2854.28, "end": 2855.28, "text": "ja nicht wirklich schlimm."}, {"id": 181, "start": 2855.28, "end": 2866.32, "text": "So random, keine Ahnung, number, number, random, next, so von 0 bis 360, in C sharp ist es"}, {"id": 182, "start": 2866.32, "end": 2873.76, "text": "nämlich exclusive, das heißt, das ist jetzt eine random Nummer von 0 inklusive 0 bis exklu-"}, {"id": 183, "start": 2873.76, "end": 2875.2, "text": "mal gucken ob das stimmt, ich glaube aber schon."}, {"id": 184, "start": 2875.2, "end": 2889.88, "text": "Exclusive 360, also es ist, es ist 0, 0 taucht auf bis 300, bis inklusive 359."}, {"id": 185, "start": 2889.88, "end": 2892.6, "text": "So, ok."}, {"id": 186, "start": 2892.6, "end": 2895.6, "text": "Und das hauen wir jetzt hier rein."}, {"id": 187, "start": 2895.6, "end": 2901.32, "text": "Und dann sollte unser Keck WSS Service schon soweit fertig sein, dass der, dass der Keck"}, {"id": 188, "start": 2901.32, "end": 2902.32, "text": "weht."}, {"id": 189, "start": 2902.32, "end": 2925.28, "text": "I, hallo, I, äh nicht I, N, ok, schauen wir mal, ha, Leute, es ist Keck WSS Service,"}, {"id": 190, "start": 2925.28, "end": 2948.24, "text": "es funktioniert, ok, nochmal kurzer recap, was wir jetzt gemacht haben."}, {"id": 191, "start": 2948.24, "end": 2963.08, "text": "Ist es nicht geil, das hat die Welt gebraucht, das hat die Welt gebraucht."}, {"id": 192, "start": 2963.08, "end": 2970.84, "text": "Die Transparenz wird im Browser nicht richtig angezeigt."}, {"id": 193, "start": 2970.84, "end": 2978.8, "text": "Hey, ich bin ein Risiko Investor, natürlich, ähm, war mir schon klar, du bist ja schon"}, {"id": 194, "start": 2978.8, "end": 2982.76, "text": "eine Weile am Start, ich hab's schon öfters gesehen, aber, äh, ich dachte schon immer,"}, {"id": 195, "start": 2982.76, "end": 2987.52, "text": "schon immer bei deinen Messages, das ist bestimmt ein Risiko Investor und würde gerne absurde"}, {"id": 196, "start": 2987.52, "end": 2991.4, "text": "Summen in ihr Startup investieren, wir glauben ihr Service hat das Potenzial, das nächste"}, {"id": 197, "start": 2991.4, "end": 2997.84, "text": "Google FB überzuwerden, bitte kontaktieren sie, ey, Fang, Fang ist out, wenn erstmal"}, {"id": 198, "start": 2997.84, "end": 3003.6, "text": "Keck WSS Service kommt, da sagen die Leute nicht mehr, sie wollen einen Fang Job, die"}, {"id": 199, "start": 3003.6, "end": 3007.72, "text": "sagen, sie wollen ein Keck W, ein Keck W, nein, das sind ja die Amis, die sagen, ich"}, {"id": 200, "start": 3007.72, "end": 3014.28, "text": "bin ein Keck W, ein Keck W Job, Tongenbrecher, kannst du ein Autorefresh machen, ja, aber"}, {"id": 201, "start": 3014.28, "end": 3024.24, "text": "wozu, so, willst du noch ne API machen, na ist doch, du machst die Seite auf, nur kommst"}, {"id": 202, "start": 3024.24, "end": 3035.52, "text": "ein Bild zurück, ok, wunderbar, unsere extrem advanced Keck WSS Service Anwendung ist fertig,"}, {"id": 203, "start": 3035.52, "end": 3042.2, "text": "übrigens, nochmal eine Runde Sellout, wenn ihr auch nen virtuellen Linux Server in der"}, {"id": 204, "start": 3042.2, "end": 3047.84, "text": "Cloud haben wollt, dann schaut jetzt mal bei meinem Partner Hetzner Cloud vorbei, geht"}, {"id": 205, "start": 3047.84, "end": 3053.12, "text": "schon los bei 3€ im Monat und wenn ihr jetzt nen Server mietet, bzw. euch einen neuen Account"}, {"id": 206, "start": 3053.12, "end": 3060.28, "text": "habt, und den ganzen, wo hab ich, fuck, ich find's nicht, lull, ah hier, sehr gut, sehr"}, {"id": 207, "start": 3060.28, "end": 3066.56, "text": "gut Chat, und das ganze registriert mit meinem Account, alter, ich kann nicht reden, Leute,"}, {"id": 208, "start": 3066.56, "end": 3074.08, "text": "Sellout gescheitert, Sellout gescheitert, vorbei, vorbei, jetzt kann ich nicht mal Sellouten,"}, {"id": 209, "start": 3074.08, "end": 3086.96, "text": "Kündigung ist raus, äh, jetzt vorbei, IP-Adresse merkt man beim nächsten Reload das Bild senden,"}, {"id": 210, "start": 3086.96, "end": 3094.52, "text": "nein, ja, zumindest, wenn ihr euch registriert mit meinem Code, kriegt ihr ein 20€ Startgutschein,"}, {"id": 211, "start": 3094.52, "end": 3101.64, "text": "Startguthaben, allerdings nur für neue Kunden, gegen Fake Accounts weiß ich nicht, ob sie"}, {"id": 212, "start": 3101.64, "end": 3107.84, "text": "was haben, der Sellout ist richtig sad gewesen, ja, zwar der schlechteste Sellout aller Zeiten,"}, {"id": 213, "start": 3107.84, "end": 3127.32, "text": "ist der Frazier on, guck mal so, ist der Frazier on, nein, ah, der war wieder ewig nicht on,"}, {"id": 214, "start": 3127.32, "end": 3138.4, "text": "okay, CACW erste Service, okay, machen wir weiter, also unser Webservice ist jetzt fertig,"}, {"id": 215, "start": 3138.4, "end": 3147.16, "text": "das Ziel ist jetzt, also wir folgen das machen, Web-Anwendung erstellen, Server einrichten,"}, {"id": 216, "start": 3147.16, "end": 3153.6, "text": "reproduzierbar mit Ansible, und dann schieben wir das ganze auf den Server, nur mal kurzer"}, {"id": 217, "start": 3153.6, "end": 3159.72, "text": "Recap, vielleicht hat noch nicht jeder so eine ASP.NET Web-Anwendung gesehen, deswegen"}, {"id": 218, "start": 3159.72, "end": 3163.68, "text": "zeige ich das nochmal ganz kurz, was es macht, es ist aber wirklich, ihr habt ja gesehen,"}, {"id": 219, "start": 3163.68, "end": 3169.0, "text": "es ist äußerst wenig, also die einzigen zwei Dateien, die ich angepasst habe, waren einmal"}, {"id": 220, "start": 3169.0, "end": 3174.36, "text": "die Startup-Datei, da habe ich alles rausgeschmissen, wo hier irgendwas von HTTPS oder irgendwelche"}, {"id": 221, "start": 3174.36, "end": 3180.0, "text": "API-Generierung drin steht, alles weg, das ist der Rest, ist aber komplett Default, und"}, {"id": 222, "start": 3180.0, "end": 3183.92, "text": "ich habe den Standard-Controller umbenannt in CACW-Controller und habe ihm gesagt, dass"}, {"id": 223, "start": 3183.92, "end": 3190.56, "text": "er direkt auf dem Route der Seite aktiv sein soll, und sobald man die Seite aufmacht, wird"}, {"id": 224, "start": 3190.56, "end": 3195.44, "text": "diese Methode hier aufgerufen mit GET, also wenn du ein GET-Request drauf machst, wird"}, {"id": 225, "start": 3195.44, "end": 3200.88, "text": "diese Methode aufgerufen, und er macht nichts anderes, wie aus diesem Ordner ein random"}, {"id": 226, "start": 3200.88, "end": 3214.6, "text": "Bild zu lesen und zurückzugeben. Mehr macht das nicht. Das war's, also mehr Anpassungen"}, {"id": 227, "start": 3214.6, "end": 3218.88, "text": "gibt es da dran nicht. So, und das reicht schon für CACW SSS-Service, und jetzt werden"}, {"id": 228, "start": 3218.88, "end": 3228.36, "text": "wir CACW SSS-Service mal in der Cloud laufen lassen, dass ihr auch alle eine Runde CACW'en"}, {"id": 229, "start": 3228.36, "end": 3236.16, "text": "können SSS-Service. Und da ist für jeden Winkel ein Bild drin, genau. Wir machen das"}, {"id": 230, "start": 3236.16, "end": 3241.8, "text": "nicht dynamisch, wir machen das nicht dynamisch oder sowas, wir haben im Vorfeld 360 Grad"}, {"id": 231, "start": 3241.8, "end": 3257.0, "text": "CACW erstellt. Und dafür wird immer random eins rausgenommen. Ist natürlich auch gut"}, {"id": 232, "start": 3257.0, "end": 3261.36, "text": "entlastet den Server, da müssen wir nix on the fly rotaten. Könnten wir vielleicht irgendwann"}, {"id": 233, "start": 3261.36, "end": 3265.28, "text": "demnächst, das ist eine coole Sache, dass wir ein bisschen Programmier-Content für den"}, {"id": 234, "start": 3265.28, "end": 3274.28, "text": "zweiten Teil oder dritten Teil noch haben. Server-Side-Bild-Rotieren. Dynamisch. Ja,"}, {"id": 235, "start": 3274.28, "end": 3283.16, "text": "da könnte man auch eine API machen, Rotate, und dann irgendwie sowas wie Decrease angeben"}, {"id": 236, "start": 3283.16, "end": 3289.68, "text": "oder sowas. Big Brain Time, können wir das nächste Mal anbauen, haben wir was zu programmieren."}, {"id": 237, "start": 3289.68, "end": 3299.2, "text": "Gut, also, was haben wir hier? Wir haben unser Master Shit Repo am Start, geht Status, und"}, {"id": 238, "start": 3299.2, "end": 3306.6, "text": "jetzt machen wir ein Ansible Repo, weil, Ansible, weil wir wollen ja, und das kann ich euch,"}, {"id": 239, "start": 3306.6, "end": 3310.48, "text": "es ist erstmal egal mit welchem Tool, aber ich kann euch das prinzipiell nur empfehlen,"}, {"id": 240, "start": 3310.48, "end": 3316.96, "text": "wenn ihr Server aufbaut für Services, die jetzt nicht einfach nur mal angelegt werden"}, {"id": 241, "start": 3316.96, "end": 3323.36, "text": "und dann wieder wegschmeißen, weil man mal was ausprobieren wollt, also wenn ihr irgendwas"}, {"id": 242, "start": 3323.36, "end": 3331.76, "text": "seriöseres hosten wollt, irgendwas, was vielleicht auch mal ein bisschen länger als zwei Tage"}, {"id": 243, "start": 3331.76, "end": 3337.72, "text": "abbleibt, dann kann ich euch nur empfehlen, in irgendeiner Art und Weise, zumal mal mindestens"}, {"id": 244, "start": 3337.72, "end": 3341.84, "text": "mal aufzuschreiben, wie ihr den Server eingerichtet habt, was da für Packages drauf sind und sonst"}, {"id": 245, "start": 3341.84, "end": 3348.04, "text": "was, oder aber noch besser, das ganze in irgendeinem Skript oder mit irgendeinem Automatisierungstool"}, {"id": 246, "start": 3348.04, "end": 3354.2, "text": "zu machen, dass ihr den gleichen Server immer wieder reproduzierbar aufbauen könnt, oder"}, {"id": 247, "start": 3354.2, "end": 3358.88, "text": "eventuell auch noch fünf weitere dieser Server reproduzierbar aufbauen könnt. Das ist ja"}, {"id": 248, "start": 3358.88, "end": 3364.44, "text": "gerade eine der Punkte, warum dieses ganze Containerzeug so beliebt geworden ist. Ja,"}, {"id": 249, "start": 3364.44, "end": 3371.24, "text": "du kannst Container relativ easy immer gleich wieder aufbauen und dementsprechend auch"}, {"id": 250, "start": 3371.24, "end": 3376.24, "text": "mit irgendeinem Orchestrator einfach skalieren lassen. Brauchst du heute für 50 User was,"}, {"id": 251, "start": 3376.24, "end": 3384.32, "text": "brauchst du nur zwei, hast du morgen 5000 User, brauchst du 20. Ist für euch ein Dockerfile"}, {"id": 252, "start": 3384.32, "end": 3390.16, "text": "Ansible gleich Dokumentation? Wenn es ordentlicher Source Code ist, ja. Wenn man es lesen kann."}, {"id": 253, "start": 3390.16, "end": 3395.96, "text": "Ich meine, niemand braucht doch da Files, wo dann drinne steht. Keine Ahnung, so, sagen"}, {"id": 254, "start": 3395.96, "end": 3403.56, "text": "wir mal hier in if, if n größer fünf, ja. Es braucht doch niemand Kommentare, wo dann"}, {"id": 255, "start": 3403.56, "end": 3412.52, "text": "drinne steht, checks if n is greater than five. Das ist bescheuert, das sieht man ja. Und"}, {"id": 256, "start": 3412.52, "end": 3417.68, "text": "dementsprechend, wenn das alles selbsterklärend ist, bräuchte auch kein extra Doku Zeug"}, {"id": 257, "start": 3417.68, "end": 3423.72, "text": "für. Für zusätzliche Erklärung ist es natürlich sinnvoll, ne. Was du in Ansible ja nicht reinschreiben"}, {"id": 258, "start": 3423.72, "end": 3428.44, "text": "kannst ist, warum nimmst du diese Packages? Ich meine, kannst du schon reinschreiben,"}, {"id": 259, "start": 3428.44, "end": 3431.68, "text": "aber ich befürchte mal, das wird da aber keiner drin aktualisieren, außerdem musst"}, {"id": 260, "start": 3431.68, "end": 3436.28, "text": "du da ein neues Commit machen, um die Comments zu aktualisieren. Sprich, wenn du bei Ansible"}, {"id": 261, "start": 3436.28, "end": 3441.4, "text": "zum Beispiel sagst, wir installieren diese fünf Packages, und du willst irgendwie für"}, {"id": 262, "start": 3441.4, "end": 3446.68, "text": "die Nachwelt vorhalten, für die Nachwelt festhalten, warum man diese Packages genommen"}, {"id": 263, "start": 3446.68, "end": 3452.8, "text": "hat, dann würde ich das auf n extra Wiki oder so schreiben. Genau, also, es gibt da"}, {"id": 264, "start": 3452.8, "end": 3459.28, "text": "verschiedene Tools für Server-Automatisierung. Das bekannteste dürfte wohl Puppet sein,"}, {"id": 265, "start": 3459.28, "end": 3470.12, "text": "das ist aber n bisschen Keynes-Champig, find ich. Sieht so aus. Ja, du sagst dir auch,"}, {"id": 266, "start": 3470.12, "end": 3475.68, "text": "ich will n User anlegen mit dieser ID und dieser Shell und diesem Home Directory und"}, {"id": 267, "start": 3475.68, "end": 3479.52, "text": "sowas. Dann gibt es doch Chef und es gibt Ansible, und Ansible finde ich eigentlich"}, {"id": 268, "start": 3479.52, "end": 3483.92, "text": "am nicesten. Ihr wisst, ich hab noch nicht sonderlich viel Ahnung, bzw. noch nicht lange"}, {"id": 269, "start": 3483.92, "end": 3488.32, "text": "Ahnung von Ansible, das haben wir vor einem Jahr oder so mal zusammen uns im Stream angeguckt."}, {"id": 270, "start": 3488.32, "end": 3496.08, "text": "Ich muss sagen, mittlerweile finde ich das wirklich sehr nice. Ohne GitHub-Copilot, ja,"}, {"id": 271, "start": 3496.08, "end": 3505.24, "text": "ich sehe den Sinn davon nicht. Genau, deswegen machen wir jetzt ein Repo, wo alles reinkommt,"}, {"id": 272, "start": 3505.24, "end": 3511.2, "text": "um wir diesen Service aufbauen können. Erpuppet ist, glaub ich, schon bekannter, weil es das"}, {"id": 273, "start": 3511.2, "end": 3519.16, "text": "deutlich länger gibt. VirusBLN, Dankeschön für den Sub. Aber Ansible ist auf jeden Fall"}, {"id": 274, "start": 3519.16, "end": 3527.08, "text": "beliebter in letzter Zeit. Lass mal gucken, es gibt doch dieses Google vs. Ranking-Geschichte."}, {"id": 275, "start": 3527.08, "end": 3547.72, "text": "Oh, wo war das nochmal? War es Google Trends? Jawoll. Taylor Swift und Kim Kardashian, genau,"}, {"id": 276, "start": 3547.72, "end": 3552.48, "text": "das ist Fußball vs. American Football. Das müsste man sich mal für die Welt angucken."}, {"id": 277, "start": 3552.48, "end": 3559.12, "text": "Außer im Freedom-Land ist da wahrscheinlich nicht so viel. Aber es ist ja auch American"}, {"id": 278, "start": 3559.12, "end": 3563.36, "text": "Football. Ok, Puppet. Puppet findest du halt immer noch viel mehr, da müssen wir noch"}, {"id": 279, "start": 3563.36, "end": 3568.52, "text": "was dazusuchen. Egal, wir suchen einfach mal Puppet und dann suchen wir hier Vergleich"}, {"id": 280, "start": 3568.52, "end": 3586.12, "text": "mit Puppet. Puppet ist halt, guck mal, sogar so ist es beliebter. Letzten 5 Jahre. 2004"}, {"id": 281, "start": 3586.12, "end": 3594.56, "text": "bis heute. Guck, hier ist das aufgekommen und dann hat es das überholt. Aber insgesamt"}, {"id": 282, "start": 3594.56, "end": 3598.72, "text": "würde ich tatsächlich sagen, dass Puppet noch ein bisschen bekannter ist, eben weil"}, {"id": 283, "start": 3598.72, "end": 3606.4, "text": "es einfach mal 10 Jahre älter ist. Ne, das stimmt nicht, so alt ist es nicht. Egal,"}, {"id": 284, "start": 3606.4, "end": 3615.44, "text": "keck wie erst das Service ist am Start. Gut, also weiter im Text. Nachdem wir alles in"}, {"id": 285, "start": 3615.44, "end": 3618.92, "text": "dieses Geepum machen wollen, legen wir einen extra Ordner für unsere Ansible-File an."}, {"id": 286, "start": 3618.92, "end": 3624.24, "text": "Ansible ist ein Tool, um Server automatisiert aufzubauen und das heißt, wir brauchen als"}, {"id": 287, "start": 3624.24, "end": 3629.76, "text": "erst mal einen Server, den wir automatisiert konfigurieren können. Das heißt, ich lege"}, {"id": 288, "start": 3629.76, "end": 3635.84, "text": "jetzt mal einen Server an. Mal gucken, ob ich das so mit dem Kommandozeilen-Tool hinkriege."}, {"id": 289, "start": 3635.84, "end": 3640.48, "text": "Server, Create, Image. Das ist übrigens das gleiche, wenn ich bei Hetzner im Webinterface"}, {"id": 290, "start": 3640.48, "end": 3645.68, "text": "klicke. Also wenn ich hier Add Server mache und durch klicke, ist es genau das gleiche,"}, {"id": 291, "start": 3645.68, "end": 3650.56, "text": "wenn ich hier über die Kommandozeile mache. Nur, dass ich es einfacher finde, wenn man"}, {"id": 292, "start": 3650.56, "end": 3656.64, "text": "öfters ein paar Server anlegen muss, über die Kommandozeile zu machen. Okay, CX11, Name,"}, {"id": 293, "start": 3656.64, "end": 3667.64, "text": "keckweight 2, keck, W, S, Service, SSH Key. Okay, wir nehmen Triple Core, wir nehmen Triple"}, {"id": 294, "start": 3667.64, "end": 3679.68, "text": "Core Kiste, die heißen CPX21. CPX21, hoffe, stimmt das? Und wenn ich Glück habe, kriege"}, {"id": 295, "start": 3679.68, "end": 3683.28, "text": "ich jetzt auch nicht das Hutpasswort angezeigt. Gibt es nicht auch eine Ansible-Rolle für"}, {"id": 296, "start": 3683.28, "end": 3692.68, "text": "die Hetzner-API? Doch, gibt es. Oh, ich darf keine Underscores verwenden. Was ist das?"}, {"id": 297, "start": 3692.68, "end": 3701.6, "text": "Keine Underscores. Wie kommt man da hin? So? Okay, das funktioniert. Warum nicht keckchamp,"}, {"id": 298, "start": 3701.6, "end": 3710.16, "text": "weil es keck, W, S, Service ist. So, also, IP von meinem Server. Was ich jetzt machen"}, {"id": 299, "start": 3710.16, "end": 3718.08, "text": "werde ist, ich werde mich nicht auf dem Server einloggen. Wir legen jetzt erstmal ein Ansible-Playbook"}, {"id": 300, "start": 3718.08, "end": 3723.88, "text": "an, heißt das Ganze. So, wir legen ein Ansible-Playbook an. Ich habe immer keine Ahnung, wie nenne"}, {"id": 301, "start": 3723.88, "end": 3738.6, "text": "ich das denn mal? Setup. Gut. So, und jetzt muss ich nachgucken, weil ich bin in Ansible"}, {"id": 302, "start": 3738.6, "end": 3745.64, "text": "noch nicht so fit, dass ich das aus dem Kopf gut hinbekomme. Was ist denn das? Always."}, {"id": 303, "start": 3745.64, "end": 3753.72, "text": "Trusten. Wir trusten allem. Immer, immer trusten. Okay, es ist YAML. YAML fängt ja mit so tollen"}, {"id": 304, "start": 3753.72, "end": 3774.2, "text": "Minus an. So. Wobei, ich nenne es nicht Setup, ich nenne es einfach Server.YAML. Eisch."}, {"id": 305, "start": 3774.2, "end": 3789.96, "text": "So, jetzt hört es aber bei mir auf. Ansible. Ich brauche wieder Ansible. Mist. Ich muss"}, {"id": 306, "start": 3789.96, "end": 3794.6, "text": "nachgucken, wie das heißt. Also, Leute, ich log mich mal kurz. Ich muss euch ausmachen,"}, {"id": 307, "start": 3794.6, "end": 3804.36, "text": "dass ihr mich keinen Bock mehr auf irgendwelche DDoS stellt. He doesn't know he lacks critical"}, {"id": 308, "start": 3804.36, "end": 3825.96, "text": "information. Okay. Wieder an. Also, ich muss mal gucken, wie das funktioniert. Also, normalerweise"}, {"id": 309, "start": 3825.96, "end": 3830.0, "text": "ist das Problem, wenn man sich bei Ubuntu einloggt, dass immer beim Login die IP angezeigt"}, {"id": 310, "start": 3830.0, "end": 3834.92, "text": "wird. Das will ich ausschalten. Ich weiß, dass es dazu... Also, es gibt zwei Möglichkeiten,"}, {"id": 311, "start": 3834.92, "end": 3839.4, "text": "wo das herkommen kann. Einmal Message of the Day oder SSH-Config. Nee, ich mache keinen"}, {"id": 312, "start": 3839.4, "end": 3851.68, "text": "VPN. Leben am Limit, Leute. Ich glaube aber, bei Ubuntu kommt es aus der SSH-Config. SSHD-Config."}, {"id": 313, "start": 3851.68, "end": 3863.12, "text": "Das habe ich nämlich schon mal nachgeguckt. Was? IP-Leak unten. Da ist kein IP-Leak."}, {"id": 314, "start": 3863.12, "end": 3875.92, "text": "Ja, der Server. Der Server-IP juckt mich nicht. Server-IP ist mir egal. Es gibt eine Option,"}, {"id": 315, "start": 3875.92, "end": 3884.44, "text": "dass SSH nicht macht. Hier. Print last log no. Okay, so heißt das. Das heißt, das muss"}, {"id": 316, "start": 3884.44, "end": 3893.28, "text": "ich jetzt Ansible konfigurieren, dass er das macht. Also, Ansible SSHD-Config. Wie macht"}, {"id": 317, "start": 3893.28, "end": 3899.92, "text": "man das? Das habe ich keine Ahnung von. Muss ich nachgucken. How to cleanly edit SSHD-Config?"}, {"id": 318, "start": 3899.92, "end": 3905.92, "text": "Nee, Print Message of the Day ist aus, warum auch immer, weil Ubuntu keinen Bock darauf"}, {"id": 319, "start": 3905.92, "end": 3911.16, "text": "hat. Kein Schimmer. Aber das ist das hier. Print last log. Dann zeigt es dir an. Zuletzt"}, {"id": 320, "start": 3911.16, "end": 3917.76, "text": "eingeloggt von und noch ein paar andere Infos. Das ist Ubuntu 20.04. Übrigens, wenn ihr"}, {"id": 321, "start": 3917.76, "end": 3921.56, "text": "irgendwelche Fragen habt, einfach entwupplos in Chat. Ich gehe auch gleich nochmal zwischendurch"}, {"id": 322, "start": 3921.56, "end": 3935.0, "text": "den Chat durch. So, also wie machen wir das jetzt am richtigsten? Was? Test Replays. Okay."}, {"id": 323, "start": 3935.0, "end": 3946.96, "text": "Also. Ich bin unfähig, was Ansible-Dinger aus dem Kopf zu machen. So. Name. So, das"}, {"id": 324, "start": 3946.96, "end": 3961.12, "text": "Ding heißt Setup. Setup Job. Hosts. Alle, die wir angeben. Asks. Okay. Task is Disable."}, {"id": 325, "start": 3961.12, "end": 3974.12, "text": "Show IP on Login. Kannst du auch einfach Touch, Hasch, Login? Wirklich? Cool. Wusste ich"}, {"id": 326, "start": 3974.12, "end": 3988.96, "text": "nicht. Asch. How to turn off Login Banner in Linux. Ist das auch für die Geschichte,"}, {"id": 327, "start": 3988.96, "end": 3999.0, "text": "die SSH ausgibt? Ich deaktiviere das im SSH Server und fertig. Okay. Disable Show IP"}, {"id": 328, "start": 3999.0, "end": 4006.32, "text": "on Login. Also, was wollen wir disablen? Print last log. Das ist Mist, wir wollen keine"}, {"id": 329, "start": 4006.32, "end": 4018.8, "text": "Schleife hier machen. Fart. Fart ist etc, ssh, sshd, config. Zack. So, regex. Print"}, {"id": 330, "start": 4018.8, "end": 4030.24, "text": "last log. Aber ohne die Raute. Und jetzt soll man print last log no soll dann da rein."}, {"id": 331, "start": 4030.24, "end": 4033.96, "text": "Also, soweit wie ich das jetzt verstehe, macht er folgendes. Wo ist der Unterschied"}, {"id": 332, "start": 4033.96, "end": 4038.92, "text": "zwischen Ansible und Docker? Das sind zwei komplett unterschiedliche Programme. Ansible"}, {"id": 333, "start": 4038.92, "end": 4046.8, "text": "ist quasi eine Scripting Umgebung, wo du Server bzw. alles was du willst automatisieren kannst"}, {"id": 334, "start": 4046.8, "end": 4054.48, "text": "über SSH und Docker ist Frontend für Container, Linux Container. Zwei komplett unterschiedliche"}, {"id": 335, "start": 4054.48, "end": 4059.16, "text": "Paar Schuhe. Du kannst mit Ansible aber zum Beispiel auch Container anlegen und Docker"}, {"id": 336, "start": 4059.16, "end": 4065.88, "text": "verwalten. Das geht. Ansible benutzt du zum Beispiel für so Sachen wie geh auf den Server,"}, {"id": 337, "start": 4065.88, "end": 4078.84, "text": "nimmte die Ausgabe von der IP beim Login aus oder geh auf den Server, legt den User an"}, {"id": 338, "start": 4078.84, "end": 4084.52, "text": "mit dem Name xy, Homeverzeichnis sowieso und der User ID sowieso. Danach legt ein Unit"}, {"id": 339, "start": 4084.52, "end": 4094.16, "text": "File hin und stellt in der Firewall ein, dass nur Port 22 erlaubt ist. So was in der"}, {"id": 340, "start": 4094.16, "end": 4100.92, "text": "Richtung. Hetzer hat eine CLI, ja. Hetzer hat eine CLI. Wow, was ich da gerade gemacht"}, {"id": 341, "start": 4100.92, "end": 4106.44, "text": "habe. Ich mach das trotzdem mal weg, auch wenn es egal ist, dass ich das geleakt habe,"}, {"id": 342, "start": 4106.44, "end": 4114.76, "text": "aber man weiß ja nie. So. Wait, könnte ich nicht mein Laptop mit Ansible bootstirpen?"}, {"id": 343, "start": 4114.76, "end": 4118.48, "text": "Doch, könntest du machen. Du musst aber erstmal ein Betriebssystem drauf kriegen und Ansible"}, {"id": 344, "start": 4118.48, "end": 4122.6, "text": "drauf installieren. Ne, musst du nicht, SSH muss laufen. Du brauchst Python drauf, nicht"}, {"id": 345, "start": 4122.6, "end": 4131.92, "text": "Ansible. Kannst du machen, ja. So und von der Idee, wir haben jetzt über die Hetzer"}, {"id": 346, "start": 4131.92, "end": 4135.04, "text": "CLI einen Server angelegt und mit Ansible lassen wir den jetzt konfigurieren. Also"}, {"id": 347, "start": 4135.04, "end": 4139.44, "text": "erstmal SSH Login ausschalten. Das ist schon mal das erste, was wir machen. Dann brauchen"}, {"id": 348, "start": 4139.44, "end": 4144.36, "text": "wir noch ein paar Packages auf unserem Server. Was jetzt vielleicht nicht ganz klar ist an"}, {"id": 349, "start": 4144.36, "end": 4150.6, "text": "der Stelle, was ist der Vorteil, das so zu machen, anstatt einfach sich auf dem Server"}, {"id": 350, "start": 4150.6, "end": 4155.8, "text": "einzulocken und sagen, ab install. Naja, der Vorteil ist, wenn ich mehrfach solche Services"}, {"id": 351, "start": 4155.8, "end": 4163.16, "text": "aufbaue, dann muss ich das jedes Mal machen und immer in der gleichen Reihenfolge und"}, {"id": 352, "start": 4163.16, "end": 4167.88, "text": "ich darf nichts vergessen. So ist einmal quasi so eine Art Dokumentation da, wie der Server"}, {"id": 353, "start": 4167.88, "end": 4176.6, "text": "aufgebaut ist und ich kann das jedes Mal wieder machen. Äh, gute Frage, ob das so funktioniert,"}, {"id": 354, "start": 4176.6, "end": 4182.88, "text": "werden wir echt gleich sehen. W-werden wir echt gleich sehen. Wieso macht man das nicht?"}, {"id": 355, "start": 4182.88, "end": 4187.52, "text": "Im Bash Script kann man auch machen, hat man früher gemacht, als es diese Tools noch nicht"}, {"id": 356, "start": 4187.52, "end": 4192.6, "text": "gab. Ist für kleine Sachen auch vollkommen legitim, aber Ansible hat keine Ahnung, 200"}, {"id": 357, "start": 4192.6, "end": 4199.08, "text": "Module für alle möglichen Sachen drinne. Von Unitfiles verwalten, bis R-Syncs machen,"}, {"id": 358, "start": 4199.08, "end": 4204.0, "text": "bis Mountpoints verwalten und sonst was. Das ist halt im Bash Script alles von Hand nachzubauen,"}, {"id": 359, "start": 4204.0, "end": 4216.08, "text": "wie sehr Pains Champ. Okay, also blablabla. So, und jetzt brauchen wir noch was. Ich will"}, {"id": 360, "start": 4216.08, "end": 4223.84, "text": "standardmäßig Packages installieren. Install Packages. Abt. Das weiß ich aus dem Kopf,"}, {"id": 361, "start": 4223.84, "end": 4232.56, "text": "wie es geht. Abt, Packages installieren. Name. So, Array. Was wollen wir installieren? Telnet."}, {"id": 362, "start": 4232.56, "end": 4248.88, "text": "Hardtop. Enload. Keymarks. D-Stats. Was brauchen wir sonst noch so? Äh, haben wir schon. NetTools."}, {"id": 363, "start": 4248.88, "end": 4256.16, "text": "Ne, wie schreibt man das? NetTools, glaub ich. So ist wie if-config. Boomer wie ich verwenden"}, {"id": 364, "start": 4256.16, "end": 4265.32, "text": "if-config, nicht ip-add. So, und jetzt sagen wir noch status latest, glaube ich. Status"}, {"id": 365, "start": 4265.32, "end": 4273.08, "text": "latest. Da muss ich jetzt einmal mal nachgucken. Ansible apt install. Zeig mal her, wie sieht"}, {"id": 366, "start": 4273.08, "end": 4287.48, "text": "das richtig aus? Examples. Äh, state. Update cache brauchen wir auch noch. Genau. Update"}, {"id": 367, "start": 4287.48, "end": 4297.36, "text": "cache brauchen wir auch noch, dass der vorhin ein update macht. Update cache, yes. Äh,"}, {"id": 368, "start": 4297.36, "end": 4307.44, "text": "state wars, ne. Nicht status, state. State latest. Genau. So, und wenn ich das jetzt ausführe,"}, {"id": 369, "start": 4307.44, "end": 4311.68, "text": "sollte von der Idee, äh, von der Idee her Folgendes passieren. Der lockt sich auf dem"}, {"id": 370, "start": 4311.68, "end": 4317.8, "text": "Server ein, installiert mir die Packages und danach disabler, dass das meine IP anzeigt"}, {"id": 371, "start": 4317.8, "end": 4327.76, "text": "beim login. Hypo bei Packages. Ach, das ist eh nur Text. Auch noch ein update-upgrade mit"}, {"id": 372, "start": 4327.76, "end": 4333.24, "text": "rein. Das ist eine gute Idee, das machen wir. Update hab ich ja schon. Update cache. Äh,"}, {"id": 373, "start": 4333.24, "end": 4343.04, "text": "upgrade. Upgrade, wie macht man das? Upgrade. Upgrade. If yes or save. Vielleicht gibt's"}, {"id": 374, "start": 4343.04, "end": 4349.2, "text": "auch ein Exempel für. Upgrade, das muss man wahrscheinlich, ich versuch das mal, ob man"}, {"id": 375, "start": 4349.2, "end": 4364.44, "text": "das alles in einem machen kann. Ich, ich glaube ja nicht. Upgrade dist, full. Ähm. Äh,"}, {"id": 376, "start": 4364.44, "end": 4377.48, "text": "mal gucken, ob man das alles so auf einmal machen kann. So, dann führen wir das ganze mal aus."}, {"id": 377, "start": 4377.48, "end": 4384.64, "text": "Also wir haben hier, wir haben hier die Datei liegen. Äh, nicht download. CD, repos,"}, {"id": 378, "start": 4384.64, "end": 4395.52, "text": "keqw as a service, ansible. So, äh, ansible, playbook. Playbook, minus i. Oh, wie konnte"}, {"id": 379, "start": 4395.52, "end": 4402.36, "text": "man die Server, Server-IP überschreiben? Normalerweise braucht man ein, ein, ein, ein Inventory mit"}, {"id": 380, "start": 4402.36, "end": 4409.88, "text": "den Hosts drinne, aber das ist jetzt zum testen erstmal, egal. Topminus i. Was ist das upgrade"}, {"id": 381, "start": 4409.88, "end": 4419.0, "text": "yes? Nee. Die sagen selbst, dass es upgrade dist ist. Ach so, yes. Ok. Update yes und"}, {"id": 382, "start": 4419.0, "end": 4426.52, "text": "klar. Und auch yes. Warum kann man da yes machen oder? Ok, und was ist yes? Ist yes,"}, {"id": 383, "start": 4426.52, "end": 4442.48, "text": "full oder dist? Ok, das ist ein bisschen. Ah, nee. Save and it's alias yes. Ok. Yes"}, {"id": 384, "start": 4442.48, "end": 4452.56, "text": "ist yep. Yep, cock. So, ähm, jetzt müsste es funktionieren. Ähm, Moment, wie ging,"}, {"id": 385, "start": 4452.56, "end": 4455.48, "text": "wie ging es auf dem Server auszuführen? Erstmal gucken, was hatte ich denn hier für eine"}, {"id": 386, "start": 4455.48, "end": 4466.04, "text": "IP nochmal? SSH den da. Minus i. Wie ging das nochmal? Ansible Direct IP. How to run ansible"}, {"id": 387, "start": 4466.04, "end": 4473.04, "text": "without specifying. Hier. Minus i, der Name und dann das Playbook. Ja, man muss ein Komma"}, {"id": 388, "start": 4473.04, "end": 4477.6, "text": "machen. Das war total hängen geblieben. Server. So, also von der Idee her sollte er sich jetzt"}, {"id": 389, "start": 4477.6, "end": 4482.44, "text": "auf dem Server einloggen, die Packages installieren. Beziehungsweise, nee, er sollte erstmal ein"}, {"id": 390, "start": 4482.44, "end": 4485.6, "text": "upgrade machen, ein upgrade machen, dann die Packages installieren. Ich bin mir nicht sicher,"}, {"id": 391, "start": 4485.6, "end": 4493.28, "text": "ob man das alles auf einmal machen kann. Danach sollte er aus der SSHD-Config das Ganze rausschmeißen"}, {"id": 392, "start": 4493.28, "end": 4499.52, "text": "und danach brauchen wir noch SSH reload. Danach brauchen wir noch restart SSH, sonst funktioniert"}, {"id": 393, "start": 4499.52, "end": 4513.28, "text": "er nicht. Name. Restart SSHD. Ähm, wie ging das nochmal? Service. Service. Name. SSH."}, {"id": 394, "start": 4513.28, "end": 4538.12, "text": "Ansible Service. Da muss ich gucken. State. Restarted. Ok. State Restarted. Ok. Test,"}, {"id": 395, "start": 4538.12, "end": 4551.84, "text": "ob es funktioniert. Bam. Grip. Warum? Ah, mein User ist falsch. Remote User. Natürlich"}, {"id": 396, "start": 4551.84, "end": 4565.0, "text": "Route, was sonst? Nur Route tut gut. So, zeigen wir mal. Ah, fuck. Discover Inter, was? Ok,"}, {"id": 397, "start": 4565.0, "end": 4571.52, "text": "das geht nicht in einem, glaube ich. Ich glaube, das funktioniert nicht in einem. Package upgrade."}, {"id": 398, "start": 4571.52, "end": 4580.8, "text": "Das geht nicht in einem. Dann müssen wir, äh, da müssen wir das, da müssen wir das"}, {"id": 399, "start": 4580.8, "end": 4593.88, "text": "splitten. KQS-Service. Ja, guck, so sieht der aus. Ist das nicht geiler Service? Den"}, {"id": 400, "start": 4593.88, "end": 4600.96, "text": "deployen wir jetzt auf die Kiste. So, ähm, darf man, darf man sowas hier dann zusammen"}, {"id": 401, "start": 4600.96, "end": 4611.92, "text": "machen? Update. Upgrade. Domain gibt's noch keine. Domain müssen wir auch noch machen."}, {"id": 402, "start": 4611.92, "end": 4620.44, "text": "Ah, ah, guck mal, jetzt, jetzt funktioniert's. Äh, Domain müssen wir auch noch machen,"}, {"id": 403, "start": 4620.44, "end": 4629.04, "text": "das, äh, machen wir hier mit, wenn wir Zertifikate machen. Domain. Es gibt sich, ja, es gibt"}, {"id": 404, "start": 4629.04, "end": 4637.16, "text": "sicherlich eine Ansible-Extension. Macht er das mit den Admin-Rechten automatisch? Äh,"}, {"id": 405, "start": 4637.16, "end": 4641.52, "text": "du musst sagen, welchen Remote-User du verwenden willst. Nachdem wir Route sind, kann ich alles"}, {"id": 406, "start": 4641.52, "end": 4665.96, "text": "machen. Macht er jetzt was? Äh. Äh, der, der scheint zu updaten, ok. Also. Ah, ich kack"}, {"id": 407, "start": 4665.96, "end": 4673.12, "text": "noob. Das hätt ich noch rausschmeißen müssen. Nochmal. Siehste, das Gute ist, wir machen"}, {"id": 408, "start": 4673.12, "end": 4677.4, "text": "das jetzt einmal richtig und können jeden Server wieder so aufbauen. Woher, äh, woher"}, {"id": 409, "start": 4677.4, "end": 4680.8, "text": "zieht er sich die Login-Daten? Äh, das ist mein SSH-Key, den hab ich standardmäßig"}, {"id": 410, "start": 4680.8, "end": 4690.88, "text": "beim Aufbau mit drauf. Ich wähl, guck, wenn ich hier H-Cloud, H-Cloud, sag ich hier SSH-Key"}, {"id": 411, "start": 4690.88, "end": 4700.84, "text": "Test-at-Test. Das ist halt der Titel von meinem SSH-Key. Ok, hat funktioniert. Hat funktioniert,"}, {"id": 412, "start": 4700.84, "end": 4708.04, "text": "das heißt, jetzt hab ich hier unter anderem JIT drauf, genau, N-Load drauf. Ja, perfekt."}, {"id": 413, "start": 4708.04, "end": 4723.56, "text": "Ah, es hat funktioniert. So, und ist jetzt SSH-ETC-SSHD-Konfig, hat er das jetzt? ATC-SSH-SSHD-Konfig,"}, {"id": 414, "start": 4723.56, "end": 4737.48, "text": "hat er das jetzt richtig gemacht? Äh. Print. Ja, guck, Print-Last-Log, no, hat funktioniert."}, {"id": 415, "start": 4737.48, "end": 4745.44, "text": "Ohne hat er auch den SSH-Demon neu gestartet. So, guck mal mal, ob der auch wirklich alles"}, {"id": 416, "start": 4745.44, "end": 4755.68, "text": "geupdatet hat. Tatsächlich, Update. Ja, hat alles funktioniert. Server ist jetzt in top"}, {"id": 417, "start": 4755.68, "end": 4760.52, "text": "Zustand, nachdem wir das Skript ausgeführt haben. Ja, super. So, und jetzt ist natürlich"}, {"id": 418, "start": 4760.52, "end": 4763.72, "text": "die Frage, ob meine IP nicht wieder kommt, wenn ich mich einen ausloge. Das testen wir"}, {"id": 419, "start": 4763.72, "end": 4781.4, "text": "jetzt mal. Nope. IP ist weg. Kommt nicht. Hat funktioniert, sehr nice. Alles klar. Ähm,"}, {"id": 420, "start": 4781.4, "end": 4785.96, "text": "dann können wir ja weitermachen. Also, jetzt haben wir erstmal so die Basics eingerichtet"}, {"id": 421, "start": 4785.96, "end": 4790.88, "text": "auf dem Server. Und jetzt mal vielleicht so als Beispiel, warum das cool ist und warum"}, {"id": 422, "start": 4790.88, "end": 4796.52, "text": "das sinnvoll ist. So, hier haben wir den ersten Server oben. Ich lege jetzt nochmal einen Server"}, {"id": 423, "start": 4796.52, "end": 4804.92, "text": "an, der heißt jetzt CAC-WSS-Service 2. Server anlegen kostet nichts. Hetzer Cloud rechnet"}, {"id": 424, "start": 4804.92, "end": 4811.92, "text": "übrigens stündlich ab. Das heißt, ähm, ich bezahle für den ganzen Kram hier so gut"}, {"id": 425, "start": 4811.92, "end": 4817.68, "text": "wie nix. Eigentlich könnten sie die Server, die ich im Stream zeige, wenigstens bezahlen"}, {"id": 426, "start": 4817.68, "end": 4830.68, "text": "eigentlich, oder? So. Äh, nicht default streamen. Guck, CAC-WSS-Service, CAC-WSS-Service 2,"}, {"id": 427, "start": 4830.68, "end": 4836.0, "text": "und Kosten tut das Ganze 1 Cent aktuell. Ich glaube, 1 Cent ist das Minimalste, was geht."}, {"id": 428, "start": 4836.0, "end": 4846.08, "text": "Engine X oder Apache, was ist besser? Bei Meilen weit ist mir Engine X lieber, viel"}, {"id": 429, "start": 4846.08, "end": 4856.16, "text": "lieber. Okay, guck, wir haben jetzt noch einen zweiten Server aufgebaut. Und jetzt muss ich"}, {"id": 430, "start": 4856.16, "end": 4863.52, "text": "nur noch folgendes machen. Äh, muss ich nur noch sagen, Ansible Playbook Server aufbauen,"}, {"id": 431, "start": 4863.52, "end": 4868.88, "text": "die IP austauscht. Normalerweise hat man Inventory, dass man das per Name machen kann, ja. Zack,"}, {"id": 432, "start": 4868.88, "end": 4872.52, "text": "jetzt führ ich das aus und er geht auf den zweiten Server drauf und richtet ihn exakt"}, {"id": 433, "start": 4872.52, "end": 4876.44, "text": "so ein wie den ersten Server. Dafür ist das praktisch. Ich könnte jetzt noch 20 Server"}, {"id": 434, "start": 4876.44, "end": 4882.96, "text": "hinstellen, die exakt so konfiguriert werden, wie ich das will. Also das ist, gerade bei"}, {"id": 435, "start": 4882.96, "end": 4892.72, "text": "sowas ist das enorm praktisch. Ja, warum er Engine X, Engine X ausspricht, verstehe ich"}, {"id": 436, "start": 4892.72, "end": 4895.64, "text": "auch nicht. Die Schreibweise verwirrt mich immer. Ich kann den auch nie richtig schreiben."}, {"id": 437, "start": 4895.64, "end": 4905.16, "text": "Echt, richtig 3-Head. Kannst du das nicht als Docker-Container machen? Doch, das machen"}, {"id": 438, "start": 4905.16, "end": 4911.48, "text": "wir in Stream Nummer 3. Wir machen 3 Streams dazu. Heute machen wir die Web-Anwendung,"}, {"id": 439, "start": 4911.48, "end": 4915.36, "text": "richten den Server mal oldschool mit Ansible, aber es ist oldschool. Ansible ist ja nicht"}, {"id": 440, "start": 4915.36, "end": 4920.76, "text": "oldschool, weil oldschool Server ohne Container ein, deployen die App im nächsten Stream,"}, {"id": 441, "start": 4920.76, "end": 4924.44, "text": "gucken wir, dass wir das Bild serverseitig rotieren und so eine kleine API noch einbauen."}, {"id": 442, "start": 4924.44, "end": 4928.6, "text": "Dann machen wir GitHub Actions, Deployment und Continuous Integration, weil wir sind"}, {"id": 443, "start": 4928.6, "end": 4934.44, "text": "Agile 5-Head-Hackermans. Dann verwenden wir mal den Head-Store-Load-Balancer mit Zertifikaten"}, {"id": 444, "start": 4934.44, "end": 4943.88, "text": "und extra Domain. Und im dritten Stream machen wir dann Containerstellen draus. Auf YouTube"}, {"id": 445, "start": 4943.88, "end": 4949.0, "text": "gibt es die Streams nicht, ne. Aber wir haben einen Archiv, da ist das alles. So, guckt,"}, {"id": 446, "start": 4949.0, "end": 4955.04, "text": "2. Server angelegt und ist direkt konfiguriert, so wie man haben wollen. Also wunderbar. Wann"}, {"id": 447, "start": 4955.04, "end": 4959.8, "text": "ist der 2. Stream? 2. Schnitt. Vielleicht nächstes Wochenende oder nächste Woche. Es"}, {"id": 448, "start": 4959.8, "end": 4964.56, "text": "dauert auf jeden Fall nicht lang. So. Und daran sieht man jetzt den Vorteil schon, ich"}, {"id": 449, "start": 4964.56, "end": 4970.6, "text": "könnte jetzt 20 solcher Server anlegen und total easy konfigurieren lassen. Natürlich"}, {"id": 450, "start": 4970.6, "end": 4976.44, "text": "ist unsere Konfig noch nicht fertig, da muss noch ein bisschen was dabei. So, ich lösche"}, {"id": 451, "start": 4976.44, "end": 4991.32, "text": "mal CACWSS-Service wieder. Delete. Gut. Also, lass mal überlegen, was brauchen wir denn"}, {"id": 452, "start": 4991.32, "end": 4999.92, "text": "noch? Wichtig, wir nehmen eine Heads nach Firewall davor. Da müssen wir uns ja nicht"}, {"id": 453, "start": 4999.92, "end": 5003.88, "text": "selbst drum kümmern. Also, das ist übrigens ein neues Feature bei denen, das gibt es"}, {"id": 454, "start": 5003.88, "end": 5011.96, "text": "noch nicht so lang. Seit 2 Monaten oder so. Bisher musste man sich komplett selbst drum"}, {"id": 455, "start": 5011.96, "end": 5017.4, "text": "kümmern. Also, man musste dann beispielsweise die UFW unter Ubuntu einschalten. Jetzt hat"}, {"id": 456, "start": 5017.4, "end": 5022.84, "text": "Hexner, ich glaube sogar, kostenlos. Ich bin mir gar nicht sicher, was der Kram kostet."}, {"id": 457, "start": 5022.84, "end": 5031.72, "text": "Guck mal, der ganze Kram ist noch da. Ich weiß gar nicht, was das kostet. Kann man"}, {"id": 458, "start": 5031.72, "end": 5035.64, "text": "jetzt Firewalls anlegen? Das heißt, wir können da auch wirklich nur Sachen freigeben, die"}, {"id": 459, "start": 5035.64, "end": 5043.16, "text": "man braucht. So, wir brauchen Port 22, wir brauchen Ping. Ping ist okay, können wir behalten."}, {"id": 460, "start": 5043.16, "end": 5051.6, "text": "Wir brauchen Port 80 und wir brauchen später noch Port 443. Und das Ganze soll auf den"}, {"id": 461, "start": 5051.6, "end": 5069.32, "text": "Server gehen. CACW as a service. Apply to one server, Firewall, CACW, Firewall. Create."}, {"id": 462, "start": 5069.32, "end": 5080.88, "text": "Und jetzt sind wir safe. SSH. Ich hoffe, es funktioniert noch. Kunst, sehr gut. Was natürlich"}, {"id": 463, "start": 5080.88, "end": 5090.12, "text": "sehr praktisch ist, da muss man sich selbst nicht mehr drum kümmern. Es ist nur Ping"}, {"id": 464, "start": 5090.12, "end": 5101.8, "text": "allowed, Port 22 für H80, für HTTP und 443 für HTTPS. Ja, das kommt auf die Anwendung"}, {"id": 465, "start": 5101.8, "end": 5114.88, "text": "an. Oh, sind wir dann hier gelandet. Das kommt auf die Anwendung an. Da gibt es nicht so"}, {"id": 466, "start": 5114.88, "end": 5118.04, "text": "viele Tricks. Du musst den Server halt rebooten, vor allem wenn es ein Kernel-Update ist."}, {"id": 467, "start": 5118.04, "end": 5122.88, "text": "Ich weiß, es gibt schon die mehr oder weniger trickreiche Geschichten, dass du manche Updates"}, {"id": 468, "start": 5122.88, "end": 5128.0, "text": "machen kannst, Rolling, auch Kernel-technisch, aber in der Regel kann man sagen, Kernel-Update"}, {"id": 469, "start": 5128.0, "end": 5133.88, "text": "gleich Reboot. Also, du musst gucken, wie das deine Anwendung verkraftet. Was hast du"}, {"id": 470, "start": 5133.88, "end": 5140.04, "text": "denn dahinter stehen? Also, wenn du da mehr oder weniger Stateless-Webgeschichten dahinter"}, {"id": 471, "start": 5140.04, "end": 5147.2, "text": "stehen hast, dann ist es ganz einfach. Dann machst du einen Loadbalancer davor. Die FW"}, {"id": 472, "start": 5147.2, "end": 5151.36, "text": "bei Hetzler ist aber eine Stateless-Firewall, soweit ich weiß. Oder wurde das geändert?"}, {"id": 473, "start": 5151.36, "end": 5168.88, "text": "Gibt es wirklich noch Stateless-Firewalls? Kann ich mir gar nicht vorstellen. Es kann"}, {"id": 474, "start": 5168.88, "end": 5175.04, "text": "keine Stateless-Firewall sein, dann würde Ping überhaupt nicht funktionieren, weil"}, {"id": 475, "start": 5175.04, "end": 5190.44, "text": "das Antwortpaket nicht weiß, wozu es gehört. Das muss Stateful sein. Würde mich sehr wundern."}, {"id": 476, "start": 5190.44, "end": 5206.0, "text": "Müsst ihr mal gucken, ich kann es dir so nicht sagen. So, aber wo sind wir hier? Genau,"}, {"id": 477, "start": 5206.0, "end": 5214.96, "text": "Mr. Mr. Ja, haben wir. Ja, also wenn das Web... also, machen wir mal ganz schnell Überblick."}, {"id": 478, "start": 5214.96, "end": 5220.56, "text": "Wie patcht man am besten einen Linux-Cluster? Wobei Cluster, Cluster ist in dem Fall das"}, {"id": 479, "start": 5220.56, "end": 5225.16, "text": "falsche Wort. Geklustert ist es ja nur, wenn du verschiedene Notes hast, die irgendwie"}, {"id": 480, "start": 5225.16, "end": 5232.08, "text": "miteinander reden. Hier geht es ja darum, du willst Ausfall, möglichst Ausfallzeiten"}, {"id": 481, "start": 5232.08, "end": 5240.44, "text": "optimiert deine Systeme neu starten. Und das einfachste ist, du stellst einen Loadbalancer"}, {"id": 482, "start": 5240.44, "end": 5246.72, "text": "davor oder einen Loadbalancer-Cluster davor. Also im Angenommen, du hast 10 Web-Server,"}, {"id": 483, "start": 5246.72, "end": 5253.0, "text": "du hast alles relativ stateless, ohne Sticky Sessions oder sonst was, einen Loadbalancer"}, {"id": 484, "start": 5253.0, "end": 5259.16, "text": "davor und dann kannst du die Server neu starten, wie du lustig bist, ist egal. Da hast du"}, {"id": 485, "start": 5259.16, "end": 5267.4, "text": "nur minimale Sachen, die ins Leere gehen. Das funktioniert. Bei Sticky Sessions und"}, {"id": 486, "start": 5267.4, "end": 5270.84, "text": "irgendwelchen Stateful-Sachen wird es ein bisschen komplizierter. Dann musst du quasi"}, {"id": 487, "start": 5270.84, "end": 5277.96, "text": "erstmal auf Server-Ebene, auf Logikebene gucken, dass dieser Server keine neuen Verbindungen"}, {"id": 488, "start": 5277.96, "end": 5283.8, "text": "mehr annimmt und dass die Clients sich zu den neuen Servern verbinden und erst wenn"}, {"id": 489, "start": 5283.8, "end": 5290.44, "text": "alles auf den neuen Servern ist, kannst du es dann ausschalten. Kommt aber ganz hart"}, {"id": 490, "start": 5290.44, "end": 5304.12, "text": "auf die Anwendung an. Ja gut, das beste ist 5 Minuten warten. 5 Minuten ist glaube ich"}, {"id": 491, "start": 5304.12, "end": 5310.08, "text": "Standard-Timeout. Wie man dann einen Loadbalancer patcht? Gar nicht. Es sei denn, du hast einen"}, {"id": 492, "start": 5310.08, "end": 5315.52, "text": "Loadbalancer-Cluster. Dann musst du es genau machen, wie ich gesagt habe. Du schwenkst"}, {"id": 493, "start": 5315.52, "end": 5321.2, "text": "den Loadbalancer, wartest bis alle Sessions drüben sind. Es gibt ja mittlerweile Loadbalancer,"}, {"id": 494, "start": 5321.2, "end": 5327.92, "text": "die können sogar TCP-Sessions quasi sharen. Du wartest bis alle Sessions drüber sind"}, {"id": 495, "start": 5327.92, "end": 5333.24, "text": "oder du hast halt irgendwie BigBrain-Loadbalancer, die geschaerte TCP-Sessions haben. PFSense"}, {"id": 496, "start": 5333.24, "end": 5342.0, "text": "kann das zum Beispiel. Dann startest du den inaktiven, schwenkst und startest. Kannst"}, {"id": 497, "start": 5342.0, "end": 5346.92, "text": "auch Netscaler nehmen, was auch immer. Es gibt noch viel mehr. Wie gesagt, der Aproxy"}, {"id": 498, "start": 5346.92, "end": 5353.76, "text": "kannst du nehmen. Da gibt es total viele Sachen, das kann man so pauschal nicht sagen. Aproxy"}, {"id": 499, "start": 5353.76, "end": 5358.24, "text": "ist aber tatsächlich ganz nice. Aproxy hat auch ein eingebautes Webinterface, wo du gucken"}, {"id": 500, "start": 5358.24, "end": 5369.72, "text": "kannst, wie viele Verbindungen noch drauf sind. Und wenn du super modern bist, der Container-Way,"}, {"id": 501, "start": 5369.72, "end": 5375.64, "text": "da gibt es noch ganz andere Sachen. Aber machen wir mal weiter. Wir haben unsere Fireball angelegt,"}, {"id": 502, "start": 5375.64, "end": 5383.4, "text": "passt. Das kann nicht komplett stateless sein, Leute. Das muss stateful sein. Ich kann euch"}, {"id": 503, "start": 5383.4, "end": 5390.68, "text": "auch sagen, warum. Warte mal. Ich kann einen Ping machen. Und einen Ping, also entweder"}, {"id": 504, "start": 5390.68, "end": 5395.84, "text": "bin ich jetzt richtig eui und ich erzähle euch Scheiße oder die Dinger sind stateful."}, {"id": 505, "start": 5395.84, "end": 5402.44, "text": "Damit ein Ping funktioniert, muss es doch eigentlich eine stateful Fireball sein, weil"}, {"id": 506, "start": 5402.44, "end": 5415.72, "text": "die Antwort von dem Server muss die Fireball wissen, wo die Anfrage her kam. Und was geht"}, {"id": 507, "start": 5415.72, "end": 5426.56, "text": "einem in eine stateful Fireball? Wenn du ausgehend verkehrlich blockst, das stimmt, da hast du"}, {"id": 508, "start": 5426.56, "end": 5441.96, "text": "recht. Da hast du recht. Ne, stimmt, muss nicht, muss nicht. Du erlaubst ja eh, du erlaubst"}, {"id": 509, "start": 5441.96, "end": 5450.04, "text": "ja eh outgoing zu überall hin. Dann ist egal. Ne, dann kann es, dann muss es das nicht sein."}, {"id": 510, "start": 5450.04, "end": 5454.24, "text": "Normalerweise muss die Fireball wissen, woher der Ping kommt, wenn du nicht von überall"}, {"id": 511, "start": 5454.24, "end": 5461.96, "text": "her erlaubst. Also stell dir mal vor, du erlaubst, dass dein Server nirgends wohin zugreifen"}, {"id": 512, "start": 5461.96, "end": 5474.16, "text": "kann. Und also dein Server darf ausgehend nirgends wohin Pakete verschicken. Und du möchtest"}, {"id": 513, "start": 5474.16, "end": 5479.88, "text": "dem jetzt sagen, wenn ein Ping reingeht, dass es erlaubt, die Antwort auch erlauben und das"}, {"id": 514, "start": 5479.88, "end": 5485.88, "text": "geht nur stateful. In dem Fall ist aber egal, wenn du nichts geblockt hast als Upsend, ja"}, {"id": 515, "start": 5485.88, "end": 5492.48, "text": "dann müsste es auch so gehen. Müsste ich mir noch mal ein bisschen Gedanken drüber"}, {"id": 516, "start": 5492.48, "end": 5499.72, "text": "machen. Also ich wüsste nicht, wie das stateless funktionieren sollte. Das ist ja gerade der"}, {"id": 517, "start": 5499.72, "end": 5510.6, "text": "Witz von stateful, dass sowas funktioniert. Also irgendwo muss ja markiert werden, hey,"}, {"id": 518, "start": 5510.6, "end": 5527.12, "text": "was ist die Antwort auf das eingehende Paket? Doch, doch, doch. Aber der Fall ist ja in dem"}, {"id": 519, "start": 5527.12, "end": 5532.64, "text": "Fall so, du hast in der Fireball geblockt, dass dein Server nach außen überhaupt kommunizieren"}, {"id": 520, "start": 5532.64, "end": 5539.64, "text": "darf. Theoretischer Fall. Aber du willst, dass er pingbar ist. Das heißt, dann stellst"}, {"id": 521, "start": 5539.64, "end": 5547.48, "text": "du ein, und das geht halt nur stateful, dann stellst du ein, eingehend ICMP erlaubt, ausgehend"}, {"id": 522, "start": 5547.48, "end": 5554.84, "text": "nur related Verbindungen, die quasi zu einer vorher schon eingehenden gehören. Das ist"}, {"id": 523, "start": 5554.84, "end": 5561.92, "text": "ja der Sinn von stateful Fireballs. Und ich wüsste nicht, wie das funktionieren sollte"}, {"id": 524, "start": 5561.92, "end": 5574.52, "text": "stateless. Keine Ahnung. Ich muss euch ehrlich sagen, ich hab mir da jetzt nicht genug Gedanken"}, {"id": 525, "start": 5574.52, "end": 5580.68, "text": "drüber gemacht, ob das jetzt gehen sollte oder nicht. Aber ist auf jeden Fall spannende"}, {"id": 526, "start": 5580.68, "end": 5586.04, "text": "Sache. Okay, weiter im Text, wir sind voll hinten dran. Weiter geht's. Also wir haben"}, {"id": 527, "start": 5586.04, "end": 5588.92, "text": "jetzt unseren Server automatisch aufgebaut. Als nächstes müssen wir irgendwie gucken,"}, {"id": 528, "start": 5588.92, "end": 5593.64, "text": "wie wir unsere Web-Anwendung drauf kommen. Das related ist aber ausschlaggebend. Genau,"}, {"id": 529, "start": 5593.64, "end": 5597.04, "text": "genau. Zumindest bei IP-Tables heißt das so. Fragt mich nicht, wie das bei anderen Sachen"}, {"id": 530, "start": 5597.04, "end": 5604.08, "text": "heißt. Okay, also wir haben den Server eingerichtet mit Ansible. Jetzt müssen wir mal gucken,"}, {"id": 531, "start": 5604.08, "end": 5607.92, "text": "was brauchen wir sonst noch? UFW können wir uns schenken, Pakete haben wir installiert,"}, {"id": 532, "start": 5607.92, "end": 5612.84, "text": "IP haben wir ausgeschaltet, SSH haben wir neu gestartet. Ja, jetzt müssen wir irgendwie"}, {"id": 533, "start": 5612.84, "end": 5617.0, "text": "gucken, wie wir das noch vm, ja. Jetzt müssen wir gucken, wie wir unsere Anwendung drauf"}, {"id": 534, "start": 5617.0, "end": 5621.0, "text": "deployen. Das heißt, ich würde mal sagen, wir legen noch einen neuen User an. Wir legen"}, {"id": 535, "start": 5621.0, "end": 5630.64, "text": "den User für die Anwendung an. Also, wie legt man Ansible User an? Ansible User. Create."}, {"id": 536, "start": 5630.64, "end": 5638.28, "text": "Übrigens, wenn ihr euch auch mal in der Cloud mit einer Linux VM austoben wollt, dann könnt"}, {"id": 537, "start": 5638.28, "end": 5643.04, "text": "ihr jetzt bei meinem Partner Hetzner Cloud vorbeigucken und euch 20 Euro Startgut haben"}, {"id": 538, "start": 5643.04, "end": 5649.08, "text": "mit meinem Gutschein sichern. Ausrufezeichen Hetzner im Chat. Der Sellout war jetzt okay,"}, {"id": 539, "start": 5649.08, "end": 5654.96, "text": "oder? Vorher habe ich ein bisschen verkackt, aber der war jetzt okay, finde ich. Ne, aber"}, {"id": 540, "start": 5654.96, "end": 5658.8, "text": "ernsthaft, ich verwende das selbst schon. Ich glaube jetzt die letzten drei Jahre oder"}, {"id": 541, "start": 5658.8, "end": 5666.0, "text": "so. Ist für mich, gerade weil es ein deutscher Hosting-Anbieter ist, ist naheliegend, ja."}, {"id": 542, "start": 5666.0, "end": 5671.32, "text": "Du hast zig andere, klar, aber preisleistungsmäßig und dass du zwei Rechenzentren in Deutschland"}, {"id": 543, "start": 5671.32, "end": 5677.96, "text": "hast, macht für mich Hetzner echt sympathisch und brauchbar. Auch die Speicherpreise sind"}, {"id": 544, "start": 5677.96, "end": 5683.04, "text": "nicht ultra hoch, weil man ein bisschen mehr braucht. Und wie gesagt, 20 Euro Startgut haben"}, {"id": 545, "start": 5683.04, "end": 5688.24, "text": "mit meinem Code für Neukunden, da könnt ihr schon ein paar Monate hier so einen kleinen"}, {"id": 546, "start": 5688.24, "end": 5694.52, "text": "Server betreiben und euch da ein bisschen austoben. Hetzner ist echt nice, also da kann"}, {"id": 547, "start": 5694.52, "end": 5699.12, "text": "man sich nicht beschweren. Ich hätte diese ganze Sponsoring-Geschichte gar nicht angenommen,"}, {"id": 548, "start": 5699.12, "end": 5703.88, "text": "wenn ich den Kram nicht selbst verwenden würde. Ja, das wäre jetzt so wie wenn ich Raid Shadow"}, {"id": 549, "start": 5703.88, "end": 5710.4, "text": "Legends mache, mache ich auch nicht. Also ich kann es euch nur empfehlen mal anzugucken."}, {"id": 550, "start": 5710.4, "end": 5716.64, "text": "Okay, jetzt aber weiter im Text. Wie kriegen wir unseren Service auf den, wie kriegen wir"}, {"id": 551, "start": 5716.64, "end": 5723.28, "text": "CAC W as a Service auf den Server CAC W as a Service? Gut, wir machen das jetzt mal ganz"}, {"id": 552, "start": 5723.28, "end": 5727.32, "text": "einfach. Ich kopiere es von Hand dahin und danach gucken wir wie wir das Ganze mit Unit"}, {"id": 553, "start": 5727.32, "end": 5735.04, "text": "File und Ansible noch deployed kriegen. Ne, ein User wollten wir noch anlegen, ein User"}, {"id": 554, "start": 5735.04, "end": 5746.04, "text": "wollten wir vorher noch anlegen. Alter, Vmware, du nervst mich hier gerade. Hab ich das, ach,"}, {"id": 555, "start": 5746.04, "end": 5749.92, "text": "ich hab das sticky eingestellt, ich wollte gerade sagen, warum ist das immer wieder da."}, {"id": 556, "start": 5749.92, "end": 5757.08, "text": "Ansible Create User, Manage User Accounts. Ich brauche einen neuen User. Und zwar nennen"}, {"id": 557, "start": 5757.08, "end": 5764.96, "text": "wir den App. Bester Name, da weiß man sofort was Sache ist. User, das da, perfekt. Die"}, {"id": 558, "start": 5764.96, "end": 5777.56, "text": "einfachste User Variante. Ohne Passwort, ohne Login, ohne alles. Okay. Ja. Create App User."}, {"id": 559, "start": 5777.56, "end": 5788.4, "text": "Name, Pushkar15, Commodore Style hier. Ne, die heißt einfach nur App, da weiß man sofort"}, {"id": 560, "start": 5788.4, "end": 5796.52, "text": "was Sache ist. App, Passwort, expired, nie. Gibt kein Passwort. Okay, dann führen wir"}, {"id": 561, "start": 5796.52, "end": 5802.96, "text": "das mal aus. Wenn man das jetzt übrigens ordentlich macht, müsste man hier noch einstellen so"}, {"id": 562, "start": 5802.96, "end": 5806.32, "text": "nach dem Motto, okay, das machen wir nur wenn wir es noch nicht gemacht haben, das machen"}, {"id": 563, "start": 5806.32, "end": 5811.72, "text": "wir auch nur wenn es nicht da ist. Das kann man abhängig voneinander machen, aber, okay,"}, {"id": 564, "start": 5811.72, "end": 5824.76, "text": "das Ansible. Das sollte jetzt eh alles ein bisschen schneller gehen. Oh, das ist der"}, {"id": 565, "start": 5824.76, "end": 5837.28, "text": "falsche Server, null. Das ist der richtige. Das ist der richtige Server, stimmt ja, stimmt"}, {"id": 566, "start": 5837.28, "end": 5844.68, "text": "ja gar nicht. He doesn't know, he lacks critical information, ja. Okay, Restart SSR, Create"}, {"id": 567, "start": 5844.68, "end": 5849.32, "text": "User. Gut, wir haben den User angelegt, das heißt Home App haben wir jetzt, sehr schön."}, {"id": 568, "start": 5849.32, "end": 5863.4, "text": "Kann ich auch Sudo App machen? Was ist denn das? Oldschool Shell. Okay, wir haben dann"}, {"id": 569, "start": 5863.4, "end": 5870.2, "text": "extra User für die App. Okay, dann kopiere ich jetzt mal die App drauf auf den Server,"}, {"id": 570, "start": 5870.2, "end": 5875.52, "text": "dann könnt ihr auch mal ausprobieren. Da könnt ihr auch alle eine Runde Keg WS Service aufrufen"}, {"id": 571, "start": 5875.52, "end": 5884.28, "text": "gleich. Poste euch dann die IP in den Chat, wenn es soweit ist. So, ich ersünke das jetzt"}, {"id": 572, "start": 5884.28, "end": 5889.68, "text": "einfach mal drauf und ich SCP das drauf, ist jetzt erstmal egal. Danach machen wir"}, {"id": 573, "start": 5889.68, "end": 5905.68, "text": "das mit Ansible, schön. Also Keg WS Service, also.NET, Publish, ach du Scheiße, das war"}, {"id": 574, "start": 5905.68, "end": 5912.64, "text": "echt aus dem Kopf, Publish, haben wir das nicht irgendwo in der History? Publish, Publish,"}, {"id": 575, "start": 5912.64, "end": 5921.6, "text": ".NET, Publish, Release, Linux, Self, ja doch, Self-Contains, das bin ich nicht verkehrt."}, {"id": 576, "start": 5921.6, "end": 5928.28, "text": "History ist die beste Dokumentation aller Zeiten. Äh, Aviator, doch, wir hatten hier schon"}, {"id": 577, "start": 5928.28, "end": 5933.04, "text": "ein paar mal DDoS Action, da konnte Hetzner aber nur am Rande was dafür, da haben uns"}, {"id": 578, "start": 5933.04, "end": 5939.64, "text": "die Leute irgendwelche polnischen Botnetze gemietet und fanden das lustig, dass ich dann"}, {"id": 579, "start": 5939.64, "end": 5943.8, "text": "für 10 Minuten im Stream nichts machen konnte, aber wenn ihnen das Geld wert ist, meinetwegen,"}, {"id": 580, "start": 5943.8, "end": 5958.44, "text": "sollen sie machen. Das ist kein Witz, hatten wir wirklich. Sachen gibt's, ja. Okay, SCP,"}, {"id": 581, "start": 5958.44, "end": 5980.76, "text": "die richtige. SCP, komm, Bam, als Root, wir starten das jetzt als Root, easy, einfach"}, {"id": 582, "start": 5980.76, "end": 5991.68, "text": "um zu gucken, ob es funktioniert. Na, mit den 300 Viewern kommt Hetzner klar, das ist"}, {"id": 583, "start": 5991.68, "end": 5997.12, "text": "kein Problem, aber mit den 50 Milliarden Botnet-Anfragen aus Polen kam es nicht klar."}, {"id": 584, "start": 5997.12, "end": 6005.36, "text": "By the way, das ist übrigens so, wie man es nicht macht, per SCP eine Anwendung rüber"}, {"id": 585, "start": 6005.36, "end": 6010.28, "text": "kopieren, aber zum Testen ist es vollkommen in Ordnung. Später würde ich es, wenn überhaupt"}, {"id": 586, "start": 6010.28, "end": 6018.24, "text": "per R-Sync machen und der richtige Weg, den machen wir dann im zweiten Stream über GitHub"}, {"id": 587, "start": 6018.24, "end": 6021.88, "text": "Actions deployen lassen und gleich noch ein paar Tests und gucken, ob das alles funktioniert."}, {"id": 588, "start": 6021.88, "end": 6047.56, "text": "So, auf, gib alles. Oh nee, die ganzen Bilder. Drei Stunden später. Aber zum Glück sind"}, {"id": 589, "start": 6047.56, "end": 6060.92, "text": "die Bilder nur, haben wir die resized und die sind nicht so groß. Okay. Gleich haben"}, {"id": 590, "start": 6060.92, "end": 6072.64, "text": "wir's. SCP dann später in der Pipeline. Ich werde wahrscheinlich mal was über R-Sync."}, {"id": 591, "start": 6072.64, "end": 6080.2, "text": "Okay. Beides, beides. Beides, das haben auch schon Leute in Tetzner Server selbst gedetost."}, {"id": 592, "start": 6080.2, "end": 6088.2, "text": "Okay, also das haben wir jetzt rüber kopiert. CACW. Wo ist es? Nee, Publish. Publish, jetzt"}, {"id": 593, "start": 6088.2, "end": 6098.84, "text": "könnt ihr es gleich mal aufrufen. Hier, IP, Home Server. CACW as a Service. Bam, läuft."}, {"id": 594, "start": 6098.84, "end": 6105.12, "text": "Ah nee, Moment, Local Host. Ich mach doch da jetzt kein Reverse Proxy vor. Urls, gleich."}, {"id": 595, "start": 6105.12, "end": 6114.64, "text": "HTTP, Doppelpunkt, Doppelslash, Sternchenport 5000. So Leute, gebt alles. Moment, ich muss"}, {"id": 596, "start": 6114.64, "end": 6130.8, "text": "mal kurz gucken, ob ich meine IP leake, wenn ich auf den Server draufgehe. Ah, Port 5000,"}, {"id": 597, "start": 6130.8, "end": 6135.68, "text": "von Port 5000 ist in der Firewall ja gar nicht freigegeben. Okay, machen wir Port 80, machen"}, {"id": 598, "start": 6135.68, "end": 6140.32, "text": "wir Port 80. Scheiß drauf. Dann kriegen sie auch die ganzen China-Chinesen gleich mit,"}, {"id": 599, "start": 6140.32, "end": 6154.36, "text": "dass wir online sind. Okay. Die IPs wird nicht gelegt. Okay, wunderbar. Also, ich mach mal"}, {"id": 600, "start": 6154.36, "end": 6166.44, "text": "wieder an. Ja, wir starten das jetzt. Ihr könnt jetzt hier das da ausführen. Ja, da"}, {"id": 601, "start": 6166.44, "end": 6172.6, "text": "könnt ihr jetzt hin und ihr kriegt alle eine Runde CACW as a Service. Gebt alles hier."}, {"id": 602, "start": 6172.6, "end": 6183.0, "text": "Wer wollte nicht schon immer CACW in as a Service? Gucken, ob ihr irgendwie ein bisschen nennenswert"}, {"id": 603, "start": 6183.0, "end": 6200.44, "text": "Last verursachen könnt. Boah, boah. Geht, aber so wirklich viel bei Enload. Mal schauen."}, {"id": 604, "start": 6200.44, "end": 6211.0, "text": "Ist ja nix. Outgoing. Ah, Busybuzz ist da. Busybuzz ist da. Sag mal, ist das jetzt von"}, {"id": 605, "start": 6211.0, "end": 6215.84, "text": "einem Date-Job-Arbeitszeit? Nee, schön wär's. Schön wär's, wenn ich das doppelt bezahlt"}, {"id": 606, "start": 6215.84, "end": 6220.72, "text": "kriegen will. Das wär doch mal geil. Leute, wäre es nicht cool, ich könnte mich bei der"}, {"id": 607, "start": 6220.72, "end": 6226.52, "text": "Arbeit streamen. Da würde ich Geld von der Arbeit verdienen, Stream-Money von den Subs,"}, {"id": 608, "start": 6226.52, "end": 6236.6, "text": "plus das wär doch mal Massive-Brained, Alter. Wenn das gehen würde. Elevenhead. Aber das"}, {"id": 609, "start": 6236.6, "end": 6247.6, "text": "geht nicht. Und Massive League, das stimmt. Ok, Leute, funktioniert's bei euch, wenn ihr"}, {"id": 610, "start": 6247.6, "end": 6260.6, "text": "da hingeht. Kriegt ihr alle schön CACW as a Service. Ja, nice. Bester Microservice überhaupt,"}, {"id": 611, "start": 6260.6, "end": 6278.12, "text": "oder? Ich würd sagen Startup, Startup-verdächtig. Absolut Startup-verdächtig. Fallt an der Börse,"}, {"id": 612, "start": 6278.12, "end": 6282.64, "text": "genau. Ok, zack. Ok, wir haben jetzt getestet, dass es prinzipiell funktioniert. Jetzt machen"}, {"id": 613, "start": 6282.64, "end": 6289.0, "text": "wir das ordentlich. Gehen wir hier mal raus. Gehen wir mal in Ansible rein. Wir wollen"}, {"id": 614, "start": 6289.0, "end": 6293.48, "text": "das Ganze der Reihe nach machen. Ok, Leute, das hab ich noch nie gemacht. Ich hab noch"}, {"id": 615, "start": 6293.48, "end": 6299.56, "text": "nie mit Ansible was ordentlich deploit. Moin, Eyelady, Pina. Ich hab noch nie mit Ansible"}, {"id": 616, "start": 6299.56, "end": 6306.2, "text": "ordentlich was deploit. Ich würd sagen, wir brauchen einen neuen Job für Build. Name."}, {"id": 617, "start": 6306.2, "end": 6314.24, "text": "Build. Wir machen sowas. Wir machen einen Build-Shop. Wir machen einen Build-Shop und"}, {"id": 618, "start": 6314.24, "end": 6321.6, "text": "wir machen danach da noch einen Deploy-Job. Wir machen Setup. Warte mal, wir machen Setup."}, {"id": 619, "start": 6321.6, "end": 6324.72, "text": "Das sollte man in unterschiedlichen Dateien machen wahrscheinlich. Bei Ansible kann man"}, {"id": 620, "start": 6324.72, "end": 6328.4, "text": "das glaube ich auch irgendwie taggen. Nicht mehr erreichbar. Ja, ich hab ausgeschaltet."}, {"id": 621, "start": 6328.4, "end": 6337.0, "text": "Was, die Bilder sind nicht transparent? Doch, doch, die müssten transparent sein. Der Browser"}, {"id": 622, "start": 6337.0, "end": 6345.52, "text": "zeigt das nur nicht richtig an. Aber die müssten transparent sein. Ok, Build und dann brauchen"}, {"id": 623, "start": 6345.52, "end": 6358.52, "text": "wir noch einen weiteren Job. Name. Deploy. In Discord ist transparent. Ja, perfekt."}, {"id": 624, "start": 6358.52, "end": 6361.76, "text": "Zumindest der nächste Tag. Ich weiß es noch nicht genau. Aber ich streame zwischendurch"}, {"id": 625, "start": 6361.76, "end": 6365.76, "text": "auf jeden Fall noch ein paar Mal und dann können wir das ausprobieren. Kann ich euch"}, {"id": 626, "start": 6365.76, "end": 6371.92, "text": "das zeigen? Wann ich das mache, muss ich mir ausdenken. Also, so, Build. Wie machen wir"}, {"id": 627, "start": 6371.92, "end": 6378.92, "text": "das Build? Lass mal überlegen. Wie mach ich denn das Build von Hand? Ich mach.NET Publish."}, {"id": 628, "start": 6378.92, "end": 6388.44, "text": "Self-Contained. Also, so, jetzt machen wir... Also, wie sieht mein Build-Shop aus? Wie kann"}, {"id": 629, "start": 6388.44, "end": 6412.8, "text": "man Ansible Local Command machen? Das da, zeig mal her. Ansible Local Action. Hab ich"}, {"id": 630, "start": 6412.8, "end": 6419.92, "text": "nicht verstanden. Wie geht das jetzt? Local Action. Ah, Local Action Build. Da kann man"}, {"id": 631, "start": 6419.92, "end": 6427.0, "text": "auch bestimmt auch Shell nehmen. Ok, also, Build. Wir kommentieren diesen ganzen Schmodder"}, {"id": 632, "start": 6427.0, "end": 6431.32, "text": "mal aus, weil das haben wir jetzt ja schon gemacht. Später brauchen wir das, wenn wir"}, {"id": 633, "start": 6431.32, "end": 6438.76, "text": "einen neuen Server installieren. Aber ok, Build. Da muss ich jetzt bestimmt auch wieder"}, {"id": 634, "start": 6438.76, "end": 6443.64, "text": "diesen ganzen Mist hier dabei kopieren. Da merke ich immer wieder, dass ich mit Ansible"}, {"id": 635, "start": 6443.64, "end": 6459.2, "text": "zu wenig mache. Aber er soll es ja lokal ausführen. Ok, Local Action. Ok, Build App. So, das ist"}, {"id": 636, "start": 6459.2, "end": 6464.76, "text": "nicht Command. Shell. Schau mal nach Raw Command. Aber so müsste es auch funktionieren, oder?"}, {"id": 637, "start": 6464.76, "end": 6473.68, "text": "Shell. Und jetzt sage ich einfach, CD, eins drauf, in den Ordner, keqws-service, weil"}, {"id": 638, "start": 6473.68, "end": 6483.84, "text": "das heißt ja hier so. Guckt. Hier, eins, eins hoch. Keqws-service. Und da mache ich"}, {"id": 639, "start": 6483.84, "end": 6490.12, "text": "jetzt mal ein.NET-Build drinne. Also, Publish. Gucke ob das funktioniert. Da bin ja mal gespannt."}, {"id": 640, "start": 6490.12, "end": 6495.08, "text": "So. Und von der Idee her müsste das mal ein Build-Command sein. Das machen wir dann wie"}, {"id": 641, "start": 6495.08, "end": 6499.84, "text": "gesagt im nächsten Stream über GitHub Actions. Aber ich habe das noch nie über Ansible gemacht."}, {"id": 642, "start": 6499.84, "end": 6509.48, "text": "Mal gucken wie das funktioniert. Ich führ das mal aus. Build. Remote User bei Lokalen"}, {"id": 643, "start": 6509.48, "end": 6517.16, "text": "Actions, macht das Sinn? Nee. Ehrlich gesagt nicht, hast du recht. Ich weiß nicht, aber"}, {"id": 644, "start": 6517.16, "end": 6522.48, "text": "vielleicht braucht man das ja. Ich glaube nämlich man braucht das. Nö, braucht man"}, {"id": 645, "start": 6522.48, "end": 6536.92, "text": "nicht. Ok. Dann können wir das alles weglassen. What? Wie jetzt? Aha. Kann ich ja auch Hosts"}, {"id": 646, "start": 6536.92, "end": 6547.64, "text": "weglassen vielleicht? Nee. Ok. Ok, jetzt haben wir ein Bild angestoßen. Lokal. Können"}, {"id": 647, "start": 6547.64, "end": 6553.4, "text": "wir auch mal ausbreiten ob das funktioniert. Neues Tab auf. Wo sind wir hier? Wir sind"}, {"id": 648, "start": 6553.4, "end": 6562.52, "text": "in repos.keqws-service.rm-bin. Wir löschen mal den Output-Folder und lassen noch mal"}, {"id": 649, "start": 6562.52, "end": 6571.24, "text": "das Bild laufen und gucken ob das jetzt funktioniert. Bild. Bin. Jawoll. Funktioniert. Ok. Lokales"}, {"id": 650, "start": 6571.24, "end": 6576.76, "text": "Bild funktioniert. Jetzt ist unsere Anwendung gebaut. Mehr brauchen wir da wahrscheinlich"}, {"id": 651, "start": 6576.76, "end": 6584.6, "text": "an der Stelle gar nicht. Jetzt können wir es deployen. Deploy. Host. All. Wie gesagt"}, {"id": 652, "start": 6584.6, "end": 6588.92, "text": "ich weiß dass das nicht die schöne Ansible Art ist das so alles in einer Datei zu machen."}, {"id": 653, "start": 6588.92, "end": 6595.2, "text": "So. Tasks. So wie kriegen wir den Kram jetzt rüber auf den Server? Nicht per SCP auf jeden"}, {"id": 654, "start": 6595.2, "end": 6604.68, "text": "Fall. Das wäre zu 3-Head das mit SCP rüber zu kopieren. Am besten wäre so eine Art R-Sync"}, {"id": 655, "start": 6604.68, "end": 6611.88, "text": "oder sowas. Id-Clone kann ich nicht machen weil ich es nicht. Achso doch ich habe es"}, {"id": 656, "start": 6611.88, "end": 6617.98, "text": "ja im Repo. Aber ich habe es ja nicht im Repo mit. Ne ne das bringt nichts. Ich bilde das"}, {"id": 657, "start": 6617.98, "end": 6623.44, "text": "ja lokal. Ich habe ja die Binaries nicht drin. Ich müsste ja dann quasi.NET auf dem Server"}, {"id": 658, "start": 6623.44, "end": 6629.28, "text": "noch installieren und dort den Bild machen. Was kontraproduktiv ist weil in Zukunft mache"}, {"id": 659, "start": 6629.28, "end": 6633.84, "text": "ich das nächste Mal ja über GitHub Actions wo das gebaut wird. Also ich brauche lokal"}, {"id": 660, "start": 6633.84, "end": 6638.64, "text": "kein.NET auf dem Server weil ich quasi eine Self-Contained Application bauen lasse die"}, {"id": 661, "start": 6638.64, "end": 6645.56, "text": "auch ohne.NET läuft. Also. Tasks. Deploy. Gut wie macht man einen R-Sync mit Ansible?"}, {"id": 662, "start": 6645.56, "end": 6658.88, "text": "Ansible R-Sync. Bam. Possix Synchronize. Das klingt schon mal 24-Head. Hat auch 25.000"}, {"id": 663, "start": 6658.88, "end": 6676.52, "text": "Optionen. Was? Source. Dest. Recursive. No. Ok. Copy Paste das jetzt mal. Also Tasks."}, {"id": 664, "start": 6676.52, "end": 6689.32, "text": "Copy. App. Besser Name. Es soll von. Von. Diesem Verzeichnis. Soll er kopieren. Wo"}, {"id": 665, "start": 6689.32, "end": 6704.52, "text": "liegt denn das. Moment. Wo liegt denn das. Bin. Mach ich mal nochmal ein Publish. Zeig"}, {"id": 666, "start": 6704.52, "end": 6708.8, "text": "den mir doch an wo das wo die Anwendung drin liegt. Hier. Das da. Das will ich kopieren."}, {"id": 667, "start": 6708.8, "end": 6721.32, "text": "Publish. CacW as a Service. So. Offlich ist es jetzt der richtige Pfad. Eins hoch. CacW"}, {"id": 668, "start": 6721.32, "end": 6727.8, "text": "as a Service bin Release.NET 5 Publish. Das will ich kopieren. So und zwar Destination"}, {"id": 669, "start": 6727.8, "end": 6733.2, "text": "auf dem Server. Soll das jetzt. Wir haben extra. Guck mal wir haben extra einen eigenen User"}, {"id": 670, "start": 6733.2, "end": 6739.96, "text": "dafür angelegt. Home App. Normalerweise würde ich das kopieren. Irgendwie unter WWW. WWW."}, {"id": 671, "start": 6739.96, "end": 6749.2, "text": "War WWW oder sowas. Ok. Es gibt auch einen Rapper. Das habe ich doch hier schon. Bam."}, {"id": 672, "start": 6749.2, "end": 6761.52, "text": "Hab ich schon entdeckt. MedV. So Destination. Das ganze nach Home App. CacW as a Service."}, {"id": 673, "start": 6761.52, "end": 6769.76, "text": "Recursive. Yes. Das ist ja ein Ordner. Vermute ich mal. Recursive. Was macht Archive. Symbol"}, {"id": 674, "start": 6769.76, "end": 6777.48, "text": "brauchen wir nicht. Delete. Delete Remote. Wenn es was nicht gibt. Ja das ist tatsächlich"}, {"id": 675, "start": 6777.48, "end": 6785.0, "text": "nicht verkehrt. Delete. Yes. Er ist immer nur Remote. Also da muss man keine Angst"}, {"id": 676, "start": 6785.0, "end": 6792.12, "text": "haben das Lokal was wegfliegt. Ich würde fast sagen dass die Chance besteht dass das"}, {"id": 677, "start": 6792.12, "end": 6810.64, "text": "so funktioniert. Schauen wir mal. Mal gucken ob der jetzt deploit. Task Build. Task Deploy"}, {"id": 678, "start": 6810.64, "end": 6823.52, "text": "Copy App. Ok. App. Da sind wir schon mal. CacW as a Service. Ok der kopiert noch. Der"}, {"id": 679, "start": 6823.52, "end": 6831.48, "text": "kopiert noch. Steht das so im Backlog. Klar ich habe extra ein Kanban Board angelegt davor."}, {"id": 680, "start": 6831.48, "end": 6837.2, "text": "Guck mal hat funktioniert. Er hat die App deploit. Und sogar. Guck mal. Oh das ist nice. Guck"}, {"id": 681, "start": 6837.2, "end": 6841.12, "text": "mal der hat die gleich dem richtigen User gegeben. Das schiebe ich jetzt einmal mal"}, {"id": 682, "start": 6841.12, "end": 6847.56, "text": "da drauf. Dass sie das hier einprogrammiert haben. Weil ich bin Root. Und er sync das"}, {"id": 683, "start": 6847.56, "end": 6853.4, "text": "rüber als Root. Das heißt die haben auf jeden Fall dort irgendwas eingebaut. Das wenn"}, {"id": 684, "start": 6853.4, "end": 6857.72, "text": "ich den Heimatverzeichnis rein sync das ist das standardmäßig als der User macht. Vermute"}, {"id": 685, "start": 6857.72, "end": 6863.84, "text": "ich jetzt einfach mal. Das ist ziemlich. Ansible braucht nur Python auf dem Remote System."}, {"id": 686, "start": 6863.84, "end": 6872.32, "text": "Das ist das ist das ist ziemlich ziemlich feifert. So. Das war es jetzt. Das ist wirklich"}, {"id": 687, "start": 6872.32, "end": 6875.96, "text": "einfach. Guck mal wenn ich jetzt deployen will. Lass ich einfach eine neue Version"}, {"id": 688, "start": 6875.96, "end": 6880.0, "text": "bauen. Und lass es auf den Server schieben. Und das kopieren geht auch schnell. Weil es"}, {"id": 689, "start": 6880.0, "end": 6887.28, "text": "R-Sync ist. R-Sync macht ja nur den diff. Mal kurz gucken ob das. Mal kurz gucken ob"}, {"id": 690, "start": 6887.28, "end": 6893.28, "text": "das. Mit dem Delete auch funktioniert. Er sollte jetzt eigentlich 1 2 3 4 die Datei"}, {"id": 691, "start": 6893.28, "end": 6899.76, "text": "löschen. Weil ich sage ja hier sync die Quelle mit dem Ziel und lösche beim Ziel alle Dateien"}, {"id": 692, "start": 6899.76, "end": 6913.6, "text": "die nicht in der Quelle vorhanden sind. Mal schauen. Ja funktioniert. Pog easy. Wie Anwendung"}, {"id": 693, "start": 6913.6, "end": 6918.6, "text": "durchgehend laufen lassen. Ja jetzt kommt jetzt kommt der Feifert Teil. Aktuell müssten"}, {"id": 694, "start": 6918.6, "end": 6923.64, "text": "wir die Anwendung ja noch von Hand immer starten. Also ich müsste jetzt immer sowas machen."}, {"id": 695, "start": 6923.64, "end": 6934.36, "text": "Wir machen jetzt ein Systemd Service draus. Da muss ich aber nachgucken. Asp net core"}, {"id": 696, "start": 6934.36, "end": 6939.68, "text": "Systemd. Guck mal hatten wir sogar schon mal offen. Ich brauche ich brauche ein Beispiel"}, {"id": 697, "start": 6939.68, "end": 6947.12, "text": "unit unit file. Sowas hier. Ja genau. Ok. Und das kopieren wir da natürlich auch per"}, {"id": 698, "start": 6947.12, "end": 6951.44, "text": "Ansible drauf. Also ihr seht schon der Vorteil davon ist wenn ich jetzt neue Services oder"}, {"id": 699, "start": 6951.44, "end": 6958.0, "text": "neue App Server brauche dazu. Stellt euch mal vor. Keg WSService wird das nächste Multimillionen"}, {"id": 700, "start": 6958.0, "end": 6967.32, "text": "Startup. Und ich hab von 5 Usern heute zu 5000 Usern morgen. 50.000 User in einer Woche"}, {"id": 701, "start": 6967.32, "end": 6974.84, "text": "und 500.000 User in einem Monat. Da muss ich ja skalieren. Horizontal vertikal diagonal"}, {"id": 702, "start": 6974.84, "end": 6979.96, "text": "da muss skaliert werden. Vorher gehe ich mit KLS noch auf den Mount Everest da sich Bescheid"}, {"id": 703, "start": 6979.96, "end": 6985.68, "text": "weiß wie man ordentlich skaliert. So und dafür ist es natürlich wunderbar. Da kann ich easy"}, {"id": 704, "start": 6985.68, "end": 6991.76, "text": "jetzt ohne Containerstellen oder sonst wie. Da kommen wir im dritten Stream zu. Einfach"}, {"id": 705, "start": 6991.76, "end": 6998.8, "text": "ganz viele Server hochziehen und einen Loadbalancer davor stellen. Das ist eigentlich eine richtig"}, {"id": 706, "start": 6998.8, "end": 7009.68, "text": "coole Sache. Ok wir müssen unit file machen. Jetzt wird es kompliziert. Moment was habe"}, {"id": 707, "start": 7009.68, "end": 7022.2, "text": "ich denn da gemacht. Jetzt jetzt jetzt wird es Sixhead. Name. Wie machen wir das jetzt"}, {"id": 708, "start": 7022.2, "end": 7038.64, "text": "mit unit file. Name. Create. Keg WSService. Unit file. Boah das weiß ich nicht. Ansible."}, {"id": 709, "start": 7038.64, "end": 7049.52, "text": "Inline content file. Line file block file. Is it possible to include file content in"}, {"id": 710, "start": 7049.52, "end": 7060.46, "text": "the playbook. Genau. Copy. Ja genau. Genau sowas will ich machen. Also. Das heißt ich"}, {"id": 711, "start": 7060.46, "end": 7073.0, "text": "sag jetzt. Copy. Richtig. Content. Wir machen erstmal die destination. Dest. Wo müssen"}, {"id": 712, "start": 7073.0, "end": 7084.8, "text": "unit files hin. Etc. System D glaube. Where put custom unit files. Ich sag euch leute wie"}, {"id": 713, "start": 7084.8, "end": 7089.0, "text": "im letzten. Googeln ist der wichtigste Skill überhaupt. Ihr müsst wissen wie ihr danach"}, {"id": 714, "start": 7089.0, "end": 7102.16, "text": "sucht. I have a custom. Unit file. User lib system D. Was. Nein. Es muss etc sein. Hier."}, {"id": 715, "start": 7102.16, "end": 7112.44, "text": "Place to put system unit files. Etc. System D. System. Alles klar. Also. Etc. System D."}, {"id": 716, "start": 7112.44, "end": 7121.64, "text": "System. Bäm. Da sind sie alle. Wobei da wird das eigentlich nur verlinkt. Scheiß drauf"}, {"id": 717, "start": 7121.64, "end": 7126.72, "text": "damals machen wir das hin. Was wird das nächste Video sein. Wahrscheinlich Battlefield. Etc"}, {"id": 718, "start": 7126.72, "end": 7134.44, "text": "System D. System. Und jetzt muss ich das Ding. Irgendwie. Irgendwie benennen. Irgendwie"}, {"id": 719, "start": 7134.44, "end": 7141.48, "text": "Punkt Service oder so. Ok. Punkt Service. Also. Das heißt das Ding heißt jetzt. Pack"}, {"id": 720, "start": 7141.48, "end": 7153.44, "text": "W. Es. Service. Punkt Service. Und jetzt Content. So. Multiline Content. Ich hab vergessen"}, {"id": 721, "start": 7153.44, "end": 7162.6, "text": "was es war. Tilde. Nee. Pipe. Content. Pipe. Und jetzt einfach so. Ob das funktioniert"}, {"id": 722, "start": 7162.6, "end": 7166.8, "text": "da hab ich da so meine Zweifel. Das funktioniert doch im Leben nicht. Das kommt doch im Leben"}, {"id": 723, "start": 7166.8, "end": 7178.08, "text": "so nicht auf dem Server an. Garantiert nicht. Ok. Schauen wir mal. Also. Description. Description"}, {"id": 724, "start": 7178.08, "end": 7187.12, "text": "ist natürlich was sonst. Pack W. Es. Service. Working Directory. Es. Home. App. Pack W."}, {"id": 725, "start": 7187.12, "end": 7196.88, "text": "Es. Service. X6 Start. Es. Home. Die Namen wissen. Es. Home. Pack W. Es. Service. Pack"}, {"id": 726, "start": 7196.88, "end": 7206.64, "text": "W. Es. Service. Minus. Minus. Wurls. HTTP. Doppelpunkt 80. Der soll ja am Interface"}, {"id": 727, "start": 7206.64, "end": 7211.84, "text": "lauschen dass alle drauf zugreifen können. Restart Always ist ok. Restart Sack ist auch"}, {"id": 728, "start": 7211.84, "end": 7218.16, "text": "ok. Kill Signal Int. Ach was weiß ich. Syslog wie das im Log auftauchen soll. Pack W."}, {"id": 729, "start": 7218.16, "end": 7227.36, "text": "Es. Service natürlich. User ist App. Environment. Production. Das lass ich einfach mal so stehen."}, {"id": 730, "start": 7227.36, "end": 7243.6, "text": "Ok. Mal gucken ob das funktioniert. Mal gucken. Ich führs mal aus. Wir brauchen noch ein Reload."}, {"id": 731, "start": 7243.6, "end": 7251.04, "text": "Wir brauchen noch ein Reload von Unit Files. Egal. Ich führ jetzt erstmal aus und gucke"}, {"id": 732, "start": 7251.04, "end": 7258.48, "text": "ob es funktioniert. Oh. Nein. Sündagsfehler. But why. Muss ich jetzt eins weiter einrücken."}, {"id": 733, "start": 7258.48, "end": 7275.12, "text": "Ah. Yes. Outplayed. Ok. Das hat jetzt. Meint ihr das? Ok. Etc. Systemd. System. Und jetzt"}, {"id": 734, "start": 7275.12, "end": 7284.4, "text": "haben wir ein Kek. W. Es. Service. Service. Kek. W. Es. Service. Punkt. Service. Service"}, {"id": 735, "start": 7284.4, "end": 7293.84, "text": "File haben wir jetzt. Alles klar. Exquisite. So das ist natürlich die Frage ob das funktioniert."}, {"id": 736, "start": 7293.84, "end": 7304.72, "text": "System. CTL. Status. Kek. W. Es. Service. Oh. Oh. Oh. Der erkennt es. Pass mal auf. Pass"}, {"id": 737, "start": 7304.72, "end": 7314.48, "text": "mal auf. Start. Wat. Root. Ach so. Ja natürlich. Das muss man als Root machen. Ist ja logisch."}, {"id": 738, "start": 7314.48, "end": 7326.64, "text": "Ja klar. Ähm. Oh mein sag bloß das funktioniert. Das kann nicht funktionieren Start. Nee. Code."}, {"id": 739, "start": 7326.64, "end": 7354.52, "text": "Oh. Wait a minute. Ich bin verwirrt. Start. Ok ich hab's. Killed. Was habe ich falsch"}, {"id": 740, "start": 7354.52, "end": 7368.12, "text": "gemacht? Warum mag er nicht? Disabled. Ok. Läuft er vielleicht noch? Ok. Journal. CTL"}, {"id": 741, "start": 7368.12, "end": 7376.24, "text": "minus Xe. Kek. W. Es. Service. Failed. With Result. Signal. Alles klar. Jetzt weiß ich"}, {"id": 742, "start": 7376.24, "end": 7390.36, "text": "ja sofort Bescheid. Äh. Warum? Warum? Warum? Warum failed das? Zeig mal her. Ordner stimmt"}, {"id": 743, "start": 7390.36, "end": 7396.16, "text": "doch. Kek. W. Es. Service. Home. App. Kek. W. Es. Service. Das ist eine Nähdungsform."}, {"id": 744, "start": 7396.16, "end": 7400.72, "text": "Das ist ein Server bei Hetzner. In der Cloud. So und jetzt mach ich folgendes. Kek. W."}, {"id": 745, "start": 7400.72, "end": 7415.6, "text": "Es. Service. Pools. Ah. Ich mach irgendwas falsch. Mission Denied. Ach das geht auf"}, {"id": 746, "start": 7415.6, "end": 7426.64, "text": "Port 80 ja nicht. Ich bin ja kein Root. Äh. Gibt's die Möglichkeit sich zu binden und"}, {"id": 747, "start": 7426.64, "end": 7434.24, "text": "dann die Privilege zu droppen irgendwie? Ne wahrscheinlich nicht. Ok da muss ich mir"}, {"id": 748, "start": 7434.24, "end": 7437.48, "text": "jetzt was anderes ausdenken. Wir machen jetzt Port 5000 und gucken ob's dann funktioniert."}, {"id": 749, "start": 7437.48, "end": 7465.28, "text": "Status. Start. Ah. Start. Oh. Ich muss reloaden sagt er. Äh. Jaja. Start. Start. Start."}, {"id": 750, "start": 7465.28, "end": 7485.16, "text": "Ah. Jetzt läuft's. Jetzt läuft's. Netstat. 5000. Ja. Jetzt funktioniert's. Da muss ich"}, {"id": 751, "start": 7485.16, "end": 7491.32, "text": "in die Firewall. Da muss ich in die Firewall und mal Port 5000 freigeben. Firewall TCP"}, {"id": 752, "start": 7491.32, "end": 7500.64, "text": "Port 5000. Und jetzt können wir auch ausprobieren ob's funktioniert. Kek. W. Es. Service. Bäm."}, {"id": 753, "start": 7500.64, "end": 7506.0, "text": "5000. Zack. Das ist sogar ist mir ehrlich gesagt so lieber. Ich will's später auf Localhost"}, {"id": 754, "start": 7506.0, "end": 7510.4, "text": "laufen lassen. Mit einem Reverse Proxy für Zertifikate davor und sowas. Ok funktioniert."}, {"id": 755, "start": 7510.4, "end": 7521.84, "text": "Nice. Äh. Ambient Capabilities Cap Net Bin Service. Oh hier kommt der. Der Big Brain."}, {"id": 756, "start": 7521.84, "end": 7539.72, "text": "Äh. Das ist äh. Das ist zum D. Ah. Ja nice. Nice. Das wird's wahrscheinlich sein. Weil"}, {"id": 757, "start": 7539.72, "end": 7546.52, "text": "dann macht er das als Root mit dem Binden und danach droppt er Privileges. Mal schauen"}, {"id": 758, "start": 7546.52, "end": 7553.6, "text": "ob das so funktioniert jetzt. Reload. Ach so. Ah. Dann muss ich das nochmal deployen."}, {"id": 759, "start": 7553.6, "end": 7561.0, "text": "Reload. Gucken ob das jetzt funktioniert. Wenn man jetzt anfängt die Pläume zu nehmen"}, {"id": 760, "start": 7561.0, "end": 7564.72, "text": "einfach Docker anschauen. Komm drauf an was du machen willst. Da gibt's. Es gibt erstmal"}, {"id": 761, "start": 7564.72, "end": 7570.44, "text": "nix prinzipiell wo man sagen muss. Ähm. Ist ist immer überlegen. Aber Docker zu kennen"}, {"id": 762, "start": 7570.44, "end": 7577.84, "text": "ist ganz. Gut. Heutzutage. Ja. Erstens hilft dir beim entwickeln und zweitens wenn du später"}, {"id": 763, "start": 7577.84, "end": 7582.32, "text": "im Server Bereich bisschen Containergekrams. Äh. Gedöns machen willst. Dann sind so die"}, {"id": 764, "start": 7582.32, "end": 7586.28, "text": "Docker Basics nicht schlecht. Es muss einem halt klar sein unter der Haube ist das alles"}, {"id": 765, "start": 7586.28, "end": 7592.96, "text": "das gleiche. Ja. Egal ob. Also ich rede jetzt vom reinen Containeranteil. Egal ob Spotman,"}, {"id": 766, "start": 7592.96, "end": 7598.2, "text": "Kubernetes, Docker. Was auch immer ist. Die verwenden alle die gleichen Sachen für Container"}, {"id": 767, "start": 7598.2, "end": 7603.52, "text": "im Kernel. Das User Interface ist anders und natürlich das gesamte Ökosystem und das"}, {"id": 768, "start": 7603.52, "end": 7608.56, "text": "das das Skalieren und und die Orchestration Geschichten. Das ist natürlich komplett anders."}, {"id": 769, "start": 7608.56, "end": 7613.0, "text": "Aber die eigentliche Sache die die Kernel Funktionen. Das ist alles das gleiche. Egal"}, {"id": 770, "start": 7613.0, "end": 7618.04, "text": "was man verwendet. Das heißt man muss immer sehen sei es Docker, Potman, Kubernetes oder"}, {"id": 771, "start": 7618.04, "end": 7624.96, "text": "ein selbst selbst gebasteltes Programm verwenden alle den gleichen Kram unter der Haube. Ok"}, {"id": 772, "start": 7624.96, "end": 7633.24, "text": "jetzt machen wir mal System Status Restart. Status. Ob das jetzt funktioniert mit dem"}, {"id": 773, "start": 7633.24, "end": 7654.2, "text": "Port. Nee. 5000. Stopp. Reload. Ach ich hab ja da immer noch 5000 drinstehen ich Kacknup."}, {"id": 774, "start": 7654.2, "end": 7669.92, "text": "Meine Güte. Nix. Nix kann man machen lassen. Reload. Und jetzt Start. Restart mein Fing."}, {"id": 775, "start": 7669.92, "end": 7680.2, "text": "Status. Plus. Bam. Nice. Jetzt gehts auf Port 80. Siehste wieder was gelernt. Der System"}, {"id": 776, "start": 7680.2, "end": 7685.28, "text": "D Boss war am Start. Können wir wieder wieder Port 5000 aus der Firewall rausschmeißen."}, {"id": 777, "start": 7685.28, "end": 7695.72, "text": "Nice. Siehste wieder was gelernt. Man kann reinschreiben Ambient Capabilities Capnet Bind"}, {"id": 778, "start": 7695.72, "end": 7701.48, "text": "Service. Alles klar. Excellent. System D ist ja schon noch so ein bisschen holprig."}, {"id": 779, "start": 7701.48, "end": 7714.24, "text": "Kann man den Port als Variabel in der Ansible-Config angeben? Könntest du machen ja. Könntest"}, {"id": 780, "start": 7714.24, "end": 7721.6, "text": "du machen. Letztendlich will ich das später eh nicht so haben sondern es soll Localhost"}, {"id": 781, "start": 7721.6, "end": 7726.2, "text": "lauschen mit einem Reverseproxy davor. Aber für jetzt ist das erstmal ok. Ok jetzt fehlen"}, {"id": 782, "start": 7726.2, "end": 7731.92, "text": "uns noch ein paar Kleinigkeiten dass das gut funktioniert. Als erstes würde ich sagen"}, {"id": 783, "start": 7731.92, "end": 7742.36, "text": "wir müssen noch in unserem. Ja das können wir so lassen. In unserem Deployed Shop sollten"}, {"id": 784, "start": 7742.36, "end": 7752.84, "text": "wir noch einbauen Service stoppen und starten. Service. Ja. Also Kack W ist das Service stoppen"}, {"id": 785, "start": 7752.84, "end": 7762.84, "text": "und starten. Heißt von der Idee her wird deployen eine neue Version und danach sagen wir stopp."}, {"id": 786, "start": 7762.84, "end": 7778.32, "text": "Kack W ist das Service. Kack W ist das Service stopp. Stoppt muss es sein. Stoppt. Dann sagen"}, {"id": 787, "start": 7778.32, "end": 7786.64, "text": "wir noch Enabled. Yes das ist beim Start automatisch hoch fährt. Enabled Yes und Reload wie auch"}, {"id": 788, "start": 7786.64, "end": 7791.92, "text": "immer das geht. Ansible Service. Weil es könnte ja sein dass wir ein neues Unit-File"}, {"id": 789, "start": 7791.92, "end": 7816.72, "text": "deployet haben. Reload. Reload. Wie Demon. Demon Reload. Ne. Demon Reload. Ne ne nicht"}, {"id": 790, "start": 7816.72, "end": 7825.76, "text": "Reload ich will die Unit-Files selber Reload. Reload. Reload. Ah hier. Ah ok jetzt kann ich"}, {"id": 791, "start": 7825.76, "end": 7833.4, "text": "es nicht mit dem Service Rapper machen ich muss jetzt direkt sagen System D. Ok verstehe."}, {"id": 792, "start": 7833.4, "end": 7847.56, "text": "Also stopp Kack W ist das Service. Name Kack W ist das Service. State. Stoppt. Stoppt."}, {"id": 793, "start": 7847.56, "end": 7854.16, "text": "Und jetzt muss ich sagen Reload. Demon Reload. Reload. Yes dass der auch die neuen Unit-Files"}, {"id": 794, "start": 7854.16, "end": 7866.52, "text": "einliest. So und danach das ganze starten. Start. Start Kack W ist das Service. Einmal"}, {"id": 795, "start": 7866.52, "end": 7873.32, "text": "Enable and Start. Weil wir machen hier Enabled gleich Yes. Falls das geht dass das automatisch"}, {"id": 796, "start": 7873.32, "end": 7882.6, "text": "neu startet beim Reboot. Gut. So. State. Started. Gut von der Idee her da sollt ihr"}, {"id": 797, "start": 7882.6, "end": 7891.76, "text": "jetzt eine neue Version deployen. Stoppen und starten. Das ergibt Sinn. Mal gucken ob"}, {"id": 798, "start": 7891.76, "end": 7901.56, "text": "das auch funktioniert. Deploy. Bam. Ich mache erstmal einen Stop. Jetzt hier einen Status."}, {"id": 799, "start": 7901.56, "end": 7909.2, "text": "Ah das ist aus. Enable Kack W ist das Service. Und jetzt Leute das funktioniert. Das ist"}, {"id": 800, "start": 7909.2, "end": 7913.56, "text": "ja geil. Guck mal da also viel einfacher kann es jetzt ja nicht mehr gehen. Jetzt kann"}, {"id": 801, "start": 7913.56, "end": 7919.76, "text": "ich mal den ganzen Krempel hier wieder einkommentieren. Den wir zwar nur einmalig brauchen aber sei"}, {"id": 802, "start": 7919.76, "end": 7927.52, "text": "es drum. Jetzt habe ich mit einem Kommando den kompletten Server auf den aktuellen Stand"}, {"id": 803, "start": 7927.52, "end": 7934.16, "text": "gebracht. Ne ich könnte nicht reloaden weil ich will ja explizit hier oder ich weiß nicht"}, {"id": 804, "start": 7934.16, "end": 7940.32, "text": "ob das geht. Checkt ihr das mit demen Reload auch wenn ich hier restartet oder so mache."}, {"id": 805, "start": 7940.32, "end": 7967.48, "text": "Müssen wir mal ausprobieren. Bam. Ah sehr nice sehr nice. Ok. Build jetzt baut er lokal"}, {"id": 806, "start": 7967.48, "end": 7977.12, "text": "die App. Er stoppt den Service. Ok. Restart. Restart. Restart. Oh mal Restart. Das heißt"}, {"id": 807, "start": 7977.12, "end": 7982.56, "text": "wenn ich jetzt Status mache dann ist der Kram auch ab seit 7 Sekunden. Das funktioniert."}, {"id": 808, "start": 7982.56, "end": 7994.12, "text": "Nice. So also 60. 5. Kack W erstes Service ist wieder da Leute. Euer Lieblings Start"}, {"id": 809, "start": 7994.12, "end": 8006.24, "text": "Up ist wieder verfügbar. Ja wunderbar. Da haben wir doch richtig richtig was gemacht"}, {"id": 810, "start": 8006.24, "end": 8011.0, "text": "jetzt schon cooles. So und das richtig nice daran ist jetzt ich könnte einfach einen"}, {"id": 811, "start": 8011.0, "end": 8015.6, "text": "zweiten Server machen und sagen bau mir den Server so auf und dann funktioniert einfach."}, {"id": 812, "start": 8015.6, "end": 8024.32, "text": "Richtig nice oder? Ja ich ich gehe einfach von aus das Unit File wird sich reloaden."}, {"id": 813, "start": 8024.32, "end": 8036.84, "text": "Das ist äußerst nice. Ok. Lass mal kurz überlegen. Müssen wir noch irgendwas machen? Server"}, {"id": 814, "start": 8036.84, "end": 8041.36, "text": "erstellen haben wir gemacht. Ansible Kram haben wir auch. Ja gut wir müssen mal testen"}, {"id": 815, "start": 8041.36, "end": 8045.6, "text": "ob es überhaupt noch funktioniert. Wir müssen wir müssen mal testen ob es überhaupt noch"}, {"id": 816, "start": 8045.6, "end": 8051.28, "text": "funktioniert. Ich mache jetzt mal eine Änderung. Ja ja ich truste alles hier Bam. Alles wird"}, {"id": 817, "start": 8051.28, "end": 8057.08, "text": "getrusted. So wir machen jetzt mal eine Änderung und deployen die. Das schauen wir mal ob das"}, {"id": 818, "start": 8057.08, "end": 8061.6, "text": "wie gut das funktioniert. Wie kann ich denn jetzt eine Änderung machen die möglichst"}, {"id": 819, "start": 8061.6, "end": 8068.84, "text": "offensichtlich ist. Ok. Ich returne nicht File. Ich returne. Ok. Also anstatt einem Bild bekommt"}, {"id": 820, "start": 8068.84, "end": 8075.6, "text": "ich jetzt einen Text wo keqw drinne steht. Soweit von der Idee her. So und ich muss nichts"}, {"id": 821, "start": 8075.6, "end": 8081.52, "text": "anderes machen außer den Source Code ändern. Lokal ausprobieren habe ich schon gemacht."}, {"id": 822, "start": 8081.52, "end": 8085.4, "text": "Gehe einfach mal von aus das es geht. Und jetzt führe ich meine Ansible Geschichte aus"}, {"id": 823, "start": 8085.4, "end": 8092.2, "text": "und er sollte komplett bilden deployen hinschieben restarten. Gucken wir mal. Noch ist es das"}, {"id": 824, "start": 8092.2, "end": 8101.56, "text": "alte. Install Packages ja ja bla bla bla. Das könnte man ja auch rausnehmen. Oh. Create"}, {"id": 825, "start": 8101.56, "end": 8107.16, "text": "Service File. Ok Bild. Jetzt baut er die neue App. Copy App. Copy App geht schnell"}, {"id": 826, "start": 8107.16, "end": 8115.2, "text": "weil er Sync. Commit. Ja Commit mache ich gleich. So und jetzt. Easy Leute. Also einfaches"}, {"id": 827, "start": 8115.2, "end": 8122.12, "text": "Update Bild und deploy kannst du nur wirklich nicht machen. Zack und jetzt das ganze wieder"}, {"id": 828, "start": 8122.12, "end": 8131.56, "text": "rückgängig. Rückgängig. Mist falsche Version. Neue deployen. Gut diesen Mist könnte man"}, {"id": 829, "start": 8131.56, "end": 8135.8, "text": "echt noch raus machen dass man einfach nur sagt One Time wenn der Server neu ist oder"}, {"id": 830, "start": 8135.8, "end": 8146.92, "text": "sowas. Kann man. Kennt sich jemand mit Ansible aus könnte ich sagen nur. Nur einmalig oder"}, {"id": 831, "start": 8146.92, "end": 8154.0, "text": "sowas gibt sowas. One One Time oder. Weil diesen Mist kann er sich ersparen im Endeffekt"}, {"id": 832, "start": 8154.0, "end": 8161.16, "text": "der anderen Seite viel. Lange dauert das ja auch nicht. So und jetzt hat er neu gestartet"}, {"id": 833, "start": 8161.16, "end": 8166.04, "text": "schon. Jetzt haben wir wieder Bilder. Ist das nicht nice. Also also also einfacher geht"}, {"id": 834, "start": 8166.04, "end": 8171.68, "text": "das mit Bild deploy wirklich jetzt nicht. Außer vielleicht man hat schon einen fertigen"}, {"id": 835, "start": 8171.68, "end": 8179.2, "text": "irgendwie Container Cluster wo man einfach direkt geht Push machen kann. Das ist cool."}, {"id": 836, "start": 8179.2, "end": 8183.28, "text": "Ok jetzt machen wir nochmal ein Commit. Dass ihr euch das alle angucken könnt. Im Shit"}, {"id": 837, "start": 8183.28, "end": 8191.04, "text": "Hub. Äh ne ich will kein Hetznergedöns hier einbauen weil ich will ja nicht bei jedem"}, {"id": 838, "start": 8191.04, "end": 8206.72, "text": "ausführenden neuen Server anlegen. Widerspricht dem Grundgedanken von Ansible was? Warum hast"}, {"id": 839, "start": 8206.72, "end": 8211.92, "text": "du die Systemdion nicht als Einzeldatei kopierend wird? Äh dass ich alles in einer Datei stehen"}, {"id": 840, "start": 8211.92, "end": 8221.4, "text": "hab. Mach das updaten doch mit Cron. Naja ne will ich nicht. Weil ich will ja wenn ich"}, {"id": 841, "start": 8221.4, "end": 8232.32, "text": "den Server neu aufbaue jetzt instant erst mal updaten. Ach so meinst du äh Michi dankeschön"}, {"id": 842, "start": 8232.32, "end": 8239.64, "text": "für den Zapp. Du meinst dass man äh was Disabled widerspricht dem mit dem Gedanken. Weiß nicht"}, {"id": 843, "start": 8239.64, "end": 8247.48, "text": "sagst du. So also erstmal ein Shit Commit. So und da brauchen wir jetzt erstmal noch"}, {"id": 844, "start": 8247.48, "end": 8257.0, "text": "ein Git Ignore File. Git Ignore. Git Ignore. So und da soll rein meine ganzen Binaries"}, {"id": 845, "start": 8257.0, "end": 8270.96, "text": "weil die will ich garantiert nicht nicht auf auf Shit Hub packen. So. Object Bin. Noch"}, {"id": 846, "start": 8270.96, "end": 8284.72, "text": "irgendwas. Ne. Passt. Oh hab ich das jetzt richtig gemacht. Shit Shit Ignore. So Git"}, {"id": 847, "start": 8284.72, "end": 8298.88, "text": "Ignore ist am Start. So passt mehr brauchen wir nicht. Git Status Git Add minus A. So"}, {"id": 848, "start": 8298.88, "end": 8307.56, "text": "und jetzt sind wir mal nett. Wir äh wir schmeißen dieses komische Commit hier weg. Git Commit"}, {"id": 849, "start": 8307.56, "end": 8319.44, "text": "minus A minus Amendt und sagen nicht LULW sondern äh Ansible ist POC U. Ich hab auch"}, {"id": 850, "start": 8319.44, "end": 8324.64, "text": "die ganzen Bilder eingecheckt LUL. Ja gut warum nicht die braucht man ja dafür. Also Server"}, {"id": 851, "start": 8324.64, "end": 8328.88, "text": "Name. Hab ich irgendwelche haben ich irgendwelche geheimen Secrets Committed. Lass mich mal"}, {"id": 852, "start": 8328.88, "end": 8333.92, "text": "kurz checken. Aber ich glaube nicht ich wüsste nicht wo es da was gibt. So die ganzen Bilder"}, {"id": 853, "start": 8333.92, "end": 8338.76, "text": "Index das könnt ich noch löschen. Upsettings Startup Launch Settings. Ne passt passt passt"}, {"id": 854, "start": 8338.76, "end": 8353.28, "text": "passt. Ok Git Status. Alles klar. Äh Git. Push. Push. Force Bam. So Shit Hub wird geupdatet."}, {"id": 855, "start": 8353.28, "end": 8370.52, "text": "Git Hub Wubblurts. Ne. Keck W as a Service. Also jeder der schon immer mal sein eigenes"}, {"id": 856, "start": 8370.52, "end": 8380.28, "text": "Keck W as a Service laufen lassen wollte kann das jetzt machen. Weil der einzige Source"}, {"id": 857, "start": 8380.28, "end": 8384.72, "text": "der Nennenswert irgendwie was drinne steht ist ja die Datei alles andere ist ja Default."}, {"id": 858, "start": 8384.72, "end": 8399.64, "text": "Es ist ja wirklich die einfachste Web Anwendung aller Zeiten die es hier irgendwie gibt. Ja"}, {"id": 859, "start": 8399.64, "end": 8404.92, "text": "das ist das ist nice. So und wisst ihr wisst ihr was wirklich richtig richtig cool da dran"}, {"id": 860, "start": 8404.92, "end": 8410.72, "text": "ist. Ich zeig ich zeig das jetzt noch mal in Action. Weil ich glaube man hat es immer"}, {"id": 861, "start": 8410.72, "end": 8414.64, "text": "noch nicht so genau verstanden was der Vorteil davon jetzt ist gegenüber Hand das von der"}, {"id": 862, "start": 8414.64, "end": 8419.2, "text": "Hand zu machen. Stellt euch mal vor ich mache noch einen zweiten Server. Ich leg jetzt noch"}, {"id": 863, "start": 8419.2, "end": 8429.28, "text": "einen zweiten Server an hier. Keck W as a Service NG. Leg einen zweiten Server an. Weil"}, {"id": 864, "start": 8429.28, "end": 8434.88, "text": "Keck W as a Service ist einfach so krass beliebt dass ich mit einem Server komme ich nicht"}, {"id": 865, "start": 8434.88, "end": 8439.84, "text": "hinterher. Der ist zu ausgelassen. Ich brauche ich brauche noch einen zweiten Server. So"}, {"id": 866, "start": 8439.84, "end": 8450.88, "text": "zweiten Server angelegt. Ansible ausführen. Ansible ausführen auf den zweiten Server."}, {"id": 867, "start": 8450.88, "end": 8457.04, "text": "Warten bis durch läuft und danach einfach auf den zweiten Server Keck W as a Service aufrufen"}, {"id": 868, "start": 8457.04, "end": 8464.8, "text": "der was es noch nicht gibt weil es noch nicht fertig ist. Run once. Oh das ist cool. Manche"}, {"id": 869, "start": 8464.8, "end": 8476.08, "text": "Sachen will ich wirklich nur einmal machen. Ach ne ne ne das geht wenn es verschiedene"}, {"id": 870, "start": 8476.08, "end": 8491.28, "text": "Hosts sind das ist was anderes. Ist bei der Serveranlage Python direkt drauf? Ja. Firewall"}, {"id": 871, "start": 8491.28, "end": 8495.04, "text": "soll ich nicht vergessen. Brauche ich nicht. Weil standardmäßig ist ja keine Firewall"}, {"id": 872, "start": 8495.04, "end": 8506.12, "text": "davor. Muss ich nichts anpassen. So neuer Server der geht jetzt da drauf macht Package Updates"}, {"id": 873, "start": 8506.12, "end": 8511.6, "text": "und danach bildet er und deployt er die App. Mal gucken jetzt sehen wir auch ob es auf"}, {"id": 874, "start": 8511.6, "end": 8517.36, "text": "dem neuen Server reibungslos funktioniert. Auf was für einem Server deploysst du das"}, {"id": 875, "start": 8517.36, "end": 8524.64, "text": "mach mal Ausrufezeichen Hetzner im Chat. Ich deploy das bei Hetzner in die Cloud. Wo es"}, {"id": 876, "start": 8524.64, "end": 8531.96, "text": "relativ günstig schon virtuelle Linux Kisten gibt. Ganze geht los bei 3 Euro. Ihr könnt"}, {"id": 877, "start": 8531.96, "end": 8536.44, "text": "euch übrigens jetzt auch 20 Euro Startguthaben sichern wenn ihr den Link hier im Chat verwendet."}, {"id": 878, "start": 8536.44, "end": 8542.32, "text": "Mit meinem Code kann man bis Ende des Jahres glaube ich einlösen. Und da könnt ihr euch"}, {"id": 879, "start": 8542.32, "end": 8553.68, "text": "selbst ein bisschen austoben. So ok Copy App macht er jetzt. Ja die kleinen Server werden"}, {"id": 880, "start": 8553.68, "end": 8560.32, "text": "mit IPv4 bald ein ticken teurer weil es immer knapper wird. So Copy App das dauert jetzt"}, {"id": 881, "start": 8560.32, "end": 8564.76, "text": "ein bisschen länger weil er irgendwie 100 MB erstmal hoch kopieren muss. So Restarting"}, {"id": 882, "start": 8564.76, "end": 8572.44, "text": "KEC WSS Service. Ok jetzt kommt der Moment der Wahrheit. Bäm Leute 2. Server up and"}, {"id": 883, "start": 8572.44, "end": 8577.6, "text": "running. Wir mussten nix machen. Wir mussten nix machen. Guck schon haben wir 2 KEC WSS"}, {"id": 884, "start": 8577.6, "end": 8584.84, "text": "Services am Start. Ist das nicht nice? Das kann nur noch getoppt werden von irgendeinem"}, {"id": 885, "start": 8584.84, "end": 8591.08, "text": "kontainerisierten Deployment mit Loadbalancer davor. Guck mal jetzt haben wir doppelt KEC"}, {"id": 886, "start": 8591.08, "end": 8600.56, "text": "WSS Service. Das ist dann quasi KEC QWSS Service. Ne Engine X und Loadbalancer davor"}, {"id": 887, "start": 8600.56, "end": 8605.12, "text": "machen wir das nächste Mal. Das machen wir heute nicht mehr. Ich finde das richtig nice."}, {"id": 888, "start": 8605.12, "end": 8613.04, "text": "Ich finde das richtig nice ey. Guck hier neuen Server erstellen. Zack hier die IP reinhauen"}, {"id": 889, "start": 8613.04, "end": 8618.48, "text": "bald ist ein neuer Service da. Also viel schneller besser kann das gar nicht mehr funktionieren."}, {"id": 890, "start": 8618.48, "end": 8624.68, "text": "Kokieren neue Server erstellt. Bäm IP rein kopieren. Playbook ausführen. Ok ich war"}, {"id": 891, "start": 8624.68, "end": 8634.16, "text": "zu schnell der Server ist noch nicht oben. Also viel einfacher und besser geht das jetzt"}, {"id": 892, "start": 8634.16, "end": 8652.44, "text": "nicht mehr. Genau das machen wir also in Stream Nummer 3 machen wir ein bisschen Containerstells."}, {"id": 893, "start": 8652.44, "end": 8655.92, "text": "Ich bin mir nicht sicher ob wir da wirklich irgendwelchen Kubernetes Kram machen. Da bin"}, {"id": 894, "start": 8655.92, "end": 8659.48, "text": "ich jetzt nämlich auch nicht der absolute Pro drinnen. Ich meine ich kann Sachen da"}, {"id": 895, "start": 8659.48, "end": 8665.92, "text": "deployen stoppen starten und was auch immer. Aber so der Wahnsinnskenner bin ich da jetzt"}, {"id": 896, "start": 8665.92, "end": 8678.52, "text": "auch nicht. So eine Wissenschaft für sich. So install Packages. Hey swarm ist deprecated."}, {"id": 897, "start": 8678.52, "end": 8701.08, "text": "Auch wenn der Hersteller sagt es ist nicht deprecated. So gleich ist es durch. Ich meine"}, {"id": 898, "start": 8701.08, "end": 8707.8, "text": "guck mal wir haben jetzt innerhalb von 2 Minuten 2 Server hingestellt. Mit lauffähiger Anwendung"}, {"id": 899, "start": 8707.8, "end": 8715.44, "text": "drauf. Also so kann man das schon ordentlich skalieren auch ohne Containerkram. So guckt"}, {"id": 900, "start": 8715.44, "end": 8724.68, "text": "Bäm Port 80 zack schon haben wir 3 Server. Keqv SSService. Und das tolle an Keqv SSService"}, {"id": 901, "start": 8724.68, "end": 8729.16, "text": "deswegen solltet ihr euch jetzt schon mal ein paar Aktienpakete sichern ist dass es"}, {"id": 902, "start": 8729.16, "end": 8740.36, "text": "komplett stateless voneinander horizontal vertikal und diagonal skaliert. Habt ihr gesehen"}, {"id": 903, "start": 8740.36, "end": 8756.84, "text": "wir haben den Keqv getroffen der der richtig richtig rotiert war. Ist es nicht nice. Doch"}, {"id": 904, "start": 8756.84, "end": 8762.96, "text": "das gefällt mir richtig gut. So bei der Gelegenheit jetzt noch mal kurz Server löschen. Das ist"}, {"id": 905, "start": 8762.96, "end": 8766.88, "text": "übrigens auch das coole ich kann die Server jetzt löschen dann kosten sie mich nichts"}, {"id": 906, "start": 8766.88, "end": 8773.32, "text": "mehr und wenn ich sie wieder brauche innerhalb von 2 Minuten neu aufbauen. Moment Leute eins"}, {"id": 907, "start": 8773.32, "end": 8776.92, "text": "ich probiere ich probiere jetzt mal was aus ich will das noch mal ganz ich will das noch"}, {"id": 908, "start": 8776.92, "end": 8780.76, "text": "mal schnell verskripten das dauert nur 2 3 Minuten glaubt das natürlich ich lösche"}, {"id": 909, "start": 8780.76, "end": 8791.48, "text": "den ganzen Krempel jetzt mal wieder. Keqv SSService ich mach jetzt ich mach jetzt. Äh äh die"}, {"id": 910, "start": 8791.48, "end": 8796.76, "text": "Kuppanete slide ne stimmt ja nicht. Das hatte mit Containern nichts zu tun aber ich könnte"}, {"id": 911, "start": 8796.76, "end": 8806.8, "text": "doch guckt mal ich leg den neuen Server an dann krieg ich am Ende da raus IPv4. So Moment"}, {"id": 912, "start": 8806.8, "end": 8811.36, "text": "Moment Moment Moment Moment jetzt jetzt 5 hat Maut richtiger 5 hat Maut das das muss"}, {"id": 913, "start": 8811.36, "end": 8818.92, "text": "ich jetzt ausbrennen. Wir nehmen einfach die letzte Zeile wie ging letzte Zeile tail minus"}, {"id": 914, "start": 8818.92, "end": 8832.44, "text": "n 1 das muss ich jetzt mal ausprobieren. Echo minus e 1 2 tail minus n 1 jawoll tail"}, {"id": 915, "start": 8832.44, "end": 8842.68, "text": "minus n 1 hat an an doppel an an punkt fällt 2 ok das muss ich jetzt mal ausprobieren ob"}, {"id": 916, "start": 8842.68, "end": 8852.12, "text": "das funktioniert jetzt jetzt kommt massive massive 5 hat mal gucken ob das funktioniert"}, {"id": 917, "start": 8852.12, "end": 8859.84, "text": "ok ok wobei ich machs glaube ich besser am Leerzeichen ach so ah ja ja ja ich lösche"}, {"id": 918, "start": 8859.84, "end": 8867.56, "text": "es ist ja gut ich lösche es ja schon wieder ich lösche es. So das muss ich jetzt das"}, {"id": 919, "start": 8867.56, "end": 8871.72, "text": "muss ich jetzt ausprobieren dann scaleen wir das jetzt auf 10 Stück hoch einfach einfach"}, {"id": 920, "start": 8871.72, "end": 8880.24, "text": "weil es geht ok wunderbar so jetzt muss ich noch den Namen ändern wieder löschen zack"}, {"id": 921, "start": 8880.24, "end": 8893.68, "text": "ok also 4 in 0 bis 10 ich glaube so viel darf ich gar nicht anlegen ich bin mir gar nicht"}, {"id": 922, "start": 8893.68, "end": 8897.84, "text": "sicher wie viel ich in einem Projekt anlegen darf machen wir mal machen wir mal 4 machen"}, {"id": 923, "start": 8897.84, "end": 8911.76, "text": "wir mal 4 ne ich bekomme keine mails weil ich keys verwende so keck w ss service hier"}, {"id": 924, "start": 8911.76, "end": 8917.4, "text": "done so jetzt lege ich server an und jetzt will ich danach das bei ansible über ansible"}, {"id": 925, "start": 8917.4, "end": 8929.12, "text": "ausführen also sagen wir jetzt du habe ich vergessen ansible hier ansible playbook ansible"}, {"id": 926, "start": 8929.12, "end": 8939.24, "text": "playbook warte mal warte mal ansible playbook hier hier kommt die ip rein also das das da"}, {"id": 927, "start": 8939.24, "end": 8952.44, "text": "hier rein so 6 hat time leute ob das jetzt funktioniert so wenn das jetzt stimmt was"}, {"id": 928, "start": 8952.44, "end": 8957.8, "text": "ich da gemacht habe dann sleep ja dann sleep sollten wir machen weil der server sonst nicht"}, {"id": 929, "start": 8957.8, "end": 8971.88, "text": "hochgefahren ist das stimmt wo mache ich den sleep rein ah 4 in das mit dem sleep funktioniert"}, {"id": 930, "start": 8971.88, "end": 8976.44, "text": "jetzt nicht richtig ok moment moment kommando zurück wir machen das anders wir schreiben"}, {"id": 931, "start": 8976.44, "end": 8994.88, "text": "das in eine variable rein ip gleich so machen wir das ip gleich sleep 1 oder sleep 5 ip ausgeben"}, {"id": 932, "start": 8994.88, "end": 9000.52, "text": "und jetzt kommt der ansible stels ob das jetzt funktioniert leute was ich da zusammen gewürstet"}, {"id": 933, "start": 9000.52, "end": 9008.24, "text": "habe das habe ich das habe ich früher täglich gemacht so so bash geschichten hier dollar"}, {"id": 934, "start": 9008.24, "end": 9020.44, "text": "ip so ja ergibt das sinn was ich da programmiert habe also 0 bis 3 so ip hetzer cloud anlegen"}, {"id": 935, "start": 9020.44, "end": 9032.64, "text": "service benennen mit dem aktuellen schleifendurchlauf du hast das i vergesst ah vor i in tail cut"}, {"id": 936, "start": 9032.64, "end": 9037.88, "text": "echo ip sleep 5 und anders playbook laufen also ok von der idee her sollten wir jetzt"}, {"id": 937, "start": 9037.88, "end": 9057.2, "text": "gleich vier kqs service am start haben"}, {"id": 938, "start": 9057.2, "end": 9073.12, "text": "ah du schauen wir mal das könnte man übrigens parallel machen lassen"}, {"id": 939, "start": 9073.12, "end": 9084.08, "text": "der desktop ist i3 ja also halt ohne ohne desktop oh ne ich glaube ich glaube mein sleep reicht"}, {"id": 940, "start": 9084.08, "end": 9091.96, "text": "noch nicht mein sleep ist zu kurz mein sleep ist zu kurz mist abbruch abbruch kommando"}, {"id": 941, "start": 9091.96, "end": 9096.52, "text": "zurück die kisten sind noch nicht aufgebaut sleep ist zu kurz wir machen das parallel"}, {"id": 942, "start": 9096.52, "end": 9101.08, "text": "pass mal auf wir können das noch wir können das aus 6 hat können wir können wir 7 hats"}, {"id": 943, "start": 9101.08, "end": 9115.44, "text": "skript machen alter ist gut ich will löschen wir machen das jetzt parallel ok sleep sleep"}, {"id": 944, "start": 9115.44, "end": 9124.04, "text": "10 das reicht jetzt aber 15 wie kriege ich das jetzt im hintergrund wie oh fuck das weiß"}, {"id": 945, "start": 9124.04, "end": 9128.2, "text": "ich kann ich einfach an der stelle und und dran machen bringt das was ne das ist ansible"}, {"id": 946, "start": 9128.2, "end": 9142.44, "text": "an der stelle äh wie kriege ich denn das jetzt irgendwie mit mit mit mit klammern das"}, {"id": 947, "start": 9142.44, "end": 9152.52, "text": "muss ich jetzt mal testen vor i in testweise 0 bis 3 3 3 ne das ne einfach und geht nicht"}, {"id": 948, "start": 9152.52, "end": 9168.52, "text": "echo 1 dann ok ich will sleep ich will sagen sleep 2 echo 1 so 1 2 bam so und jetzt mal"}, {"id": 949, "start": 9168.52, "end": 9176.88, "text": "gucken ob ich das ganze irgendwie hinkriege dass das dass das im hintergrund ah klammern"}, {"id": 950, "start": 9176.88, "end": 9191.16, "text": "muss man es klammern muss man es dann funktioniert genau klammern muss man es wobei das ich glaube"}, {"id": 951, "start": 9191.16, "end": 9195.4, "text": "das kommt sich in die quere weil ich ip doppelt belege und sowas keine ahnung wir probieren"}, {"id": 952, "start": 9195.4, "end": 9207.4, "text": "es einfach mal aus und jetzt und keine ahnung ey guck mal guck mal parallele server zeug"}, {"id": 953, "start": 9207.4, "end": 9221.56, "text": "da schon mal ja das das funktioniert schon mal es geht da nein nein fast fast ist handpferde"}, {"id": 954, "start": 9221.56, "end": 9230.24, "text": "fast funktioniert ssh connect to host unreachable ist ist das lieb ist das lieb immer noch zu"}, {"id": 955, "start": 9230.24, "end": 9231.24, "text": "langsam"}, {"id": 956, "start": 9231.24, "end": 9240.64, "text": "ich weiß nicht wie man über die kommando zeile deleted deswegen muss ich immer so machen"}, {"id": 957, "start": 9240.64, "end": 9253.76, "text": "bau ein wait for connection ein das ist eine gute idee in netcat oder so jemanden gute"}, {"id": 958, "start": 9253.76, "end": 9264.52, "text": "jemand eine gute idee 15 15 ich hab's ich hab's noch auf warum erstell oh terraform das"}, {"id": 959, "start": 9264.52, "end": 9269.8, "text": "ist eine gute idee das machen wir in stream nummer 3 das passt nämlich richtig zu container"}, {"id": 960, "start": 9269.8, "end": 9274.88, "text": "stellts deployment nächsten stream bauen wir eine kleine api noch ein machen github actions"}, {"id": 961, "start": 9274.88, "end": 9279.44, "text": "continuous integration pipeline geschissen bisschen load balancer zertifikat und im dritten"}, {"id": 962, "start": 9279.44, "end": 9288.92, "text": "stream dazu machen wir container stellts und terraform das ist eine gute idee max ansible"}, {"id": 963, "start": 9288.92, "end": 9305.64, "text": "wait for connection ah woh wohin ansible wait for connection"}, {"id": 964, "start": 9305.64, "end": 9315.04, "text": "wie funs das hier examples wait for connection ich teste das jetzt erst mal mit dem sleep"}, {"id": 965, "start": 9315.04, "end": 9323.96, "text": "drinnen sleep 20 ob das funktioniert man wenn die streams immer sein sonntags wahrscheinlich"}, {"id": 966, "start": 9323.96, "end": 9343.24, "text": "schon ok 3 4 5 6 7 8 9 10 11 12 13 14 15 das könnte fertig sein sind 17 18 19 20"}, {"id": 967, "start": 9343.24, "end": 9357.68, "text": "ok zählen kann ich nicht aber fast ok mal gucken ob es jetzt funktioniert das sieht"}, {"id": 968, "start": 9357.68, "end": 9360.6, "text": "gut aus das sieht gut aus das hängt schon viel länger"}, {"id": 969, "start": 9360.6, "end": 9373.36, "text": "massive scalierung hier angesagt wo ich mir nicht ganz sicher bin das backt doch rum oder"}, {"id": 970, "start": 9373.36, "end": 9378.28, "text": "ich meine ich mache hier ip aber wobei das hier könnte shell locals sein die variable"}, {"id": 971, "start": 9378.28, "end": 9383.84, "text": "und nicht global und deswegen ist es kein problem wenn ich das parallel mache bash ist"}, {"id": 972, "start": 9383.84, "end": 9394.68, "text": "aber da zu 6000 hat für als dass man da noch durchblickt netket aber die idee hier einfach"}, {"id": 973, "start": 9394.68, "end": 9407.64, "text": "das einzubauen beim ansible ist wahrscheinlich das beste funktioniert leute es funktioniert"}, {"id": 974, "start": 9407.64, "end": 9416.56, "text": "es funktioniert er deploit mir 4 server parallel so und danach sollte keck weheste service funktioniert"}, {"id": 975, "start": 9416.56, "end": 9439.28, "text": "ok ha cloud list server list oder auch nicht doch mal gucken wenn er fertig ist wenn er"}, {"id": 976, "start": 9439.28, "end": 9448.72, "text": "fertig sollte hier auf auf allen auf allen keck weheste service laufen moment hellsinki"}, {"id": 977, "start": 9448.72, "end": 9462.24, "text": "warum habe ich die warum warum sind die in finland die server ok bäm oh was oh nein"}, {"id": 978, "start": 9462.24, "end": 9470.8, "text": "oh das geht nicht gibt es doch irgendwelche race race conditions"}, {"id": 979, "start": 9470.8, "end": 9477.64, "text": "aber der ist noch gar nicht fertig der ist noch gar nicht fertig"}, {"id": 980, "start": 9477.64, "end": 9481.4, "text": "wait a minute der war noch gar nicht da war noch gar nicht durch"}, {"id": 981, "start": 9481.4, "end": 9497.72, "text": "jetzt ist keck weheste service da also leute ernsthaft einfacher mal übrigens ihr seht"}, {"id": 982, "start": 9497.72, "end": 9501.6, "text": "dass es transparent ist wegen dem hintergrund ich weiß nicht warum das da so ein shit macht"}, {"id": 983, "start": 9501.6, "end": 9517.4, "text": "bei chrome wir haben jetzt quadruple usd service keck quadruple usd service ich bin ich bin"}, {"id": 984, "start": 9517.4, "end": 9522.28, "text": "echt begeistert wie cool das ist mit mit diesem mit hier in dem fall mit dem ansible playbook"}, {"id": 985, "start": 9522.28, "end": 9528.52, "text": "haben wir noch irgendwelche shit commits die wir noch nicht gemacht haben also wer sich"}, {"id": 986, "start": 9528.52, "end": 9532.24, "text": "das alles ein bisschen näher angucken will was ich heute fabriziert habe ihr findet"}, {"id": 987, "start": 9532.24, "end": 9537.64, "text": "das bei mir alles auf github jetzt hat sein eigener load balancer die probieren beim nächsten"}, {"id": 988, "start": 9537.64, "end": 9546.92, "text": "stream aus wer sich das nochmal angucken will kann sich das hier alles anschauen wir machen"}, {"id": 989, "start": 9546.92, "end": 9560.24, "text": "noch mal was in die read me streamprojekt"}, {"id": 990, "start": 9560.24, "end": 9578.56, "text": "blurz switch und bisschen werbung machen dürftest du das shell script noch mal sehen welches"}, {"id": 991, "start": 9578.56, "end": 9586.72, "text": "welches shell script meinst du das ansible ding ich hab hier meine aliasse nicht git"}, {"id": 992, "start": 9586.72, "end": 9595.72, "text": "commit minus a minus m 0 w größer keck w read me beste aussage kräftigen commits aller"}, {"id": 993, "start": 9595.72, "end": 9620.92, "text": "zeiten ist alles im repo drin jetzt machen wir auch ein bisschen werbung streamprojekt"}, {"id": 994, "start": 9620.92, "end": 9628.0, "text": "es ist und wisst ihr was das coole ist es ist doch echt überschaubar es ist jetzt nicht"}, {"id": 995, "start": 9628.0, "end": 9632.8, "text": "als wäre das wahnsinnig viel source code ich meine die web anwendung ist lächerlich es"}, {"id": 996, "start": 9632.8, "end": 9637.32, "text": "ist jetzt nicht als wäre das wahnsinnig viel source code ich meine die web anwendung ist"}, {"id": 997, "start": 9637.32, "end": 9645.28, "text": "lächerlich wenig source code im prinzip ist das alles was da irgendwie die logik macht"}, {"id": 998, "start": 9645.28, "end": 9655.48, "text": "jetzt das ansible ding ist jetzt sagt man jetzt bei ernsthaft es ist gut lesbar und"}, {"id": 999, "start": 9655.48, "end": 9660.56, "text": "es ist auch nicht viel es sind 78 zeilen da kannst du dich ja echt nicht beschweren"}, {"id": 1000, "start": 9660.56, "end": 9668.76, "text": "so der richtet den server ein mit unit file allem schon fertig macht ein bild für lokal"}, {"id": 1001, "start": 9668.76, "end": 9672.72, "text": "von der anwendung und deployt das ganze also ich kann euch schon sagen auch wenn wir das"}, {"id": 1002, "start": 9672.72, "end": 9679.24, "text": "die nächsten nächsten streams etwas modernisieren werden so ein bisschen eher so das in der"}, {"id": 1003, "start": 9679.24, "end": 9683.92, "text": "richtung wie das heute gerade angesagt ist einfacher wird es dadurch garantiert nicht"}, {"id": 1004, "start": 9683.92, "end": 9689.32, "text": "allein schon wenn wir das wenn wir das das das bild über über github action machen"}, {"id": 1005, "start": 9689.32, "end": 9694.04, "text": "und so was man muss man sich jetzt ernsthaft fragen ich mein für ein stream machen wir"}, {"id": 1006, "start": 9694.04, "end": 9699.4, "text": "das einfach weil es weil man dann was lernen kann aber wenn ich diesen kram jetzt so betreiben"}, {"id": 1007, "start": 9699.4, "end": 9705.52, "text": "würde dann würde ich mich allen ernstes fragen macht das sinn bei so was kleinem macht das"}, {"id": 1008, "start": 9705.52, "end": 9710.24, "text": "sinn reicht es nicht aus wenn ich das auf einem server habe dass ich einfach ein ansible"}, {"id": 1009, "start": 9710.24, "end": 9715.76, "text": "script ausführe nachdem ich einen commit gemacht habe auch ich irgendwelche container stels"}, {"id": 1010, "start": 9715.76, "end": 9721.12, "text": "geschichten und sonst was man muss es ja nicht man muss ja mit agilität nicht übertreiben"}, {"id": 1011, "start": 9721.12, "end": 9734.64, "text": "wenn es das dreimal komplizierter macht auch wenn man dann vielleicht nicht cloud native"}, {"id": 1012, "start": 9734.64, "end": 9745.52, "text": "big brain blockchain ai ist also ich bin mir geistert sehr gut sehr gut excellent tja"}, {"id": 1013, "start": 9745.52, "end": 9749.72, "text": "leute noch mal eine runde sellout diesen streams werden möglich gemacht durch meinen partner"}, {"id": 1014, "start": 9749.72, "end": 9754.6, "text": "hetzner cloud wenn ihr euch das ganze auch mal angucken wollt oder vielleicht auch hier"}, {"id": 1015, "start": 9754.6, "end": 9760.56, "text": "mal mit dem beispielprojekt aus dem stream rum experimentieren wollt dann könnt ihr"}, {"id": 1016, "start": 9760.56, "end": 9767.76, "text": "euch jetzt 20 euro startguthaben sichern ausrufe zeichnen hetzner in chat und wenn ihr euch"}, {"id": 1017, "start": 9767.76, "end": 9773.08, "text": "mit meinem code anmeldet kriegt ihr 20 euro startguthaben und ihr seht für 20 euro kann"}, {"id": 1018, "start": 9773.08, "end": 9777.24, "text": "man schon ganz ordentlich was machen ihr könnt euch entweder in eine fette kiste holen oder"}, {"id": 1019, "start": 9777.24, "end": 9782.92, "text": "also fett in anführungsstrichen 3 cpus 4 gigabyte ram das zwei drei monate laufen lassen oder"}, {"id": 1020, "start": 9782.92, "end": 9788.32, "text": "was kleineres das gute ist dass das ganze stündlich abgerechnet wird das heißt selbst wenn ihr"}, {"id": 1021, "start": 9788.32, "end": 9792.88, "text": "das habe ich selbst schon verwendet nur als neukunde nur als neukunde ja ich weiß nicht"}, {"id": 1022, "start": 9792.88, "end": 9798.64, "text": "ob sie was gegen fake accounts haben deswegen sage ich da jetzt nichts zu was ich auch schon"}, {"id": 1023, "start": 9798.64, "end": 9808.52, "text": "mal benutzt habe ist diese geschichte hier aber glaube ich sogar im stream gemacht diese"}, {"id": 1024, "start": 9808.52, "end": 9815.56, "text": "geschichte hier also wenn man mal was braucht mit nein jetzt nein jetzt noch ich will lass"}, {"id": 1025, "start": 9815.56, "end": 9824.68, "text": "mich prising gucken wenn ihr mal anwendungszwecke habt dass ihr was richtig fettes braucht dann"}, {"id": 1026, "start": 9824.68, "end": 9829.92, "text": "könnt ihr euch auch das hier mieten ich habe beispielsweise mal open street maps preprocessed"}, {"id": 1027, "start": 9829.92, "end": 9838.12, "text": "das braucht extrem für routing information das braucht extrem viel ram ob die gpu instanzen"}, {"id": 1028, "start": 9838.12, "end": 9842.96, "text": "haben habe ich noch nicht gesehen ich glaube nicht und habe ich mir so eine kiste hier gemietet das"}, {"id": 1029, "start": 9842.96, "end": 9850.44, "text": "hat vier stunden prozess und der vorteil war ich habe dann am ende 23 euro bezahlt im monat kostet"}, {"id": 1030, "start": 9850.44, "end": 9856.4, "text": "es zwar 321 aber ich habe das ja nur vier stunden gebraucht und ich habe diese leistung"}, {"id": 1031, "start": 9856.4, "end": 9866.4, "text": "einfach nicht lokal ansatzweise gehabt um es damit machen zu können so so sieht es aus"}, {"id": 1032, "start": 9866.4, "end": 9872.12, "text": "dankeschön für die ganzen subs leute wenn ihr in zukunft auch immer live mit dabei sein wollt"}, {"id": 1033, "start": 9872.12, "end": 9879.36, "text": "könnt ihr auch bei mir auf youtube und twitch und twitter und wo auch immer vorbeigucken wir hatten"}, {"id": 1034, "start": 9879.36, "end": 9884.8, "text": "hier alles subscribt jenna am start vier monate huge project ja aber richtig der michi ist auch"}, {"id": 1035, "start": 9884.8, "end": 9893.16, "text": "am start muniradur hat auch subscribt für drei monate ribbonsch vor einer stunde und der virus"}, {"id": 1036, "start": 9893.16, "end": 9903.12, "text": "der schnabulator auch danke für die subs leute ja wenn es euch gefällt freue ich mich immer"}, {"id": 1037, "start": 9903.12, "end": 9907.68, "text": "über jeden sub zumal ich jetzt ja auch noch weniger bekomme weil twitch der meinung ist die"}, {"id": 1038, "start": 9907.68, "end": 9913.92, "text": "sub in die subpreise umgestellt zu haben heißt ich brauche jetzt mehr subs für weniger geld"}, {"id": 1039, "start": 9913.92, "end": 9926.6, "text": "was aber nicht schlimm ist also ich habe nicht angefangen zu streamen wegen wegen big stonks"}, {"id": 1040, "start": 9926.6, "end": 9933.84, "text": "money das wisst ihr ja und ich muss sagen ich bin mal wieder begeistert über den chat es gibt"}, {"id": 1041, "start": 9933.84, "end": 9940.6, "text": "keinen anderen channel der so non-toxic ist mal chain law außen vor genommen außen vor der so"}, {"id": 1042, "start": 9940.6, "end": 9943.52, "text": "non-toxic ist und so big brain wieder chat bei mir"}, {"id": 1043, "start": 9943.52, "end": 9963.92, "text": "loll wein nicht noch js warum nicht cobalt noch besser fort ran"}, {"id": 1044, "start": 9973.52, "end": 9993.36, "text": "ja es sind sehr boom aber die auf der also noch boomerische boomer als als bei mir auf"}, {"id": 1045, "start": 9993.36, "end": 10000.88, "text": "der arbeit soll ich gehe jetzt noch mal schnell durch den chat durch aber schauen ob ich"}, {"id": 1046, "start": 10000.88, "end": 10005.68, "text": "irgendwelche sachen überlesen habe wie gesagt denkt dran entwupplose schreiben sonst übersehe"}, {"id": 1047, "start": 10005.68, "end": 10020.12, "text": "ich die ganzen comments so haben wir nix wie gesagt weiß ich nicht glaube nicht"}, {"id": 1048, "start": 10020.12, "end": 10030.52, "text": "da sieht man doch eindeutig toxic hier willst du die domain keck wie services dafür haben ja das"}, {"id": 1049, "start": 10030.52, "end": 10037.56, "text": "wäre richtig gut keck wie punktservices die nämlich die müssen wir auch nicht transferieren"}, {"id": 1050, "start": 10037.56, "end": 10043.72, "text": "ich kann dir für dns einfach die ip geben transferieren ist immer dass das das sind"}, {"id": 1051, "start": 10043.72, "end": 10052.2, "text": "die die law die law end provider zu zu 3 hat für ob und oder liebste serverlinienungs ja"}, {"id": 1052, "start": 10052.2, "end": 10062.0, "text": "das stimmt genau das ist es es ist natürlich cool wenn du dir dann irgendwie was erzählen"}, {"id": 1053, "start": 10062.0, "end": 10070.68, "text": "kannst von hyper hyper skaliertem kupa netes jetzt könnte man daraus jetzt machen hyper"}, {"id": 1054, "start": 10070.68, "end": 10085.64, "text": "skaliertes kupa net cloud native hyperskalierendes cloud native kupa netes continuous deployment"}, {"id": 1055, "start": 10085.64, "end": 10090.2, "text": "oder sowas ja natürlich das ist cool aber manchmal muss es einfach nicht sein und in"}, {"id": 1056, "start": 10090.2, "end": 10094.92, "text": "dem fall würde ich echt sagen das ist so simpel das projekten gerade mit ein paar servan warum"}, {"id": 1057, "start": 10094.92, "end": 10102.52, "text": "da irgendwie eine große als sache noch drumherum bauen schon spät nee spät ist es erst ab 22"}, {"id": 1058, "start": 10102.52, "end": 10116.04, "text": "uhr nicht okta ju stimmt es ist vier fahrt vierfach wes okta ju keck okta ju was wäre"}, {"id": 1059, "start": 10116.04, "end": 10124.68, "text": "sieben fach koch sepp sepp da ju was ist neun was ist neun auf lateinisch weiß ich nicht was"}, {"id": 1060, "start": 10124.68, "end": 10131.88, "text": "ist neun nona das habe ich noch nie gehört"}, {"id": 1061, "start": 10145.88, "end": 10152.4, "text": "hier schauen wir mal kap kap ja nicht viel hier also wenn ihr was wissen wollt schreibt"}, {"id": 1062, "start": 10152.4, "end": 10162.56, "text": "die frage ruhig in chat bin jetzt noch halbe stunde da wenn man den namen weglässt ja"}, {"id": 1063, "start": 10162.56, "end": 10165.68, "text": "ich will ja nicht mehr haben ich will da sehen wozu sie gehören ach so habe ich die server"}, {"id": 1064, "start": 10165.68, "end": 10170.24, "text": "jetzt eigentlich alle gelöscht oder ist keck ws service immer noch da ok ks service läuft"}, {"id": 1065, "start": 10170.24, "end": 10176.28, "text": "ja noch vielleicht sollte ich die kisten mal wieder löschen sonst sonst wirds teuer"}, {"id": 1066, "start": 10176.28, "end": 10195.64, "text": "heute nacht"}, {"id": 1067, "start": 10195.64, "end": 10218.92, "text": "ich habe glaube ich nix übersehen wenn ich hier so durch scroller hatten wir ja"}, {"id": 1068, "start": 10218.92, "end": 10232.56, "text": "ne holprig habe ich doch irgendwas anderes mit gemeint naja na gut ich muss dir ehrlich"}, {"id": 1069, "start": 10232.56, "end": 10241.8, "text": "sagen so ich als boomer linux admin die standard bash skripte für das alte im it hatten auch"}, {"id": 1070, "start": 10241.8, "end": 10245.88, "text": "schon seine vorteile zum beispiel hätte ich da irgendwie den health check rein hacken"}, {"id": 1071, "start": 10245.88, "end": 10250.92, "text": "können was bei system der nicht gescheit funktioniert also in health check zum beispiel"}, {"id": 1072, "start": 10250.92, "end": 10255.64, "text": "der irgendwie in den wege macht alle fünf sekunden also halt wie gesagt wirklich wirklich"}, {"id": 1073, "start": 10255.64, "end": 10264.16, "text": "nur irgendwie rein rein basteln der hatte eigentlich nix zu suchen ja hier wieder was"}, {"id": 1074, "start": 10264.16, "end": 10278.68, "text": "gelernt richtig richtig 6 hat wusste nicht dass man das machen kann"}, {"id": 1075, "start": 10278.68, "end": 10285.8, "text": "er wusste es auch aber im unit file ist natürlich schöner funktioniert über hetsner auch so"}, {"id": 1076, "start": 10285.8, "end": 10294.04, "text": "was wie proxmox zu hosten ja natürlich ach so du meinst in der cloud da wäre ich mir"}, {"id": 1077, "start": 10294.04, "end": 10300.24, "text": "nicht so sicher das wäre ja das wäre das wäre ja quasi nested virtualisierung da würde"}, {"id": 1078, "start": 10300.24, "end": 10305.16, "text": "ich mir wahrscheinlich bei der server aktion lieber einkaufen also ich weiß nicht genau"}, {"id": 1079, "start": 10305.16, "end": 10310.12, "text": "wie die linux virtualisieren ich vermute mal dass es kvm und nested virtualisierung ist"}, {"id": 1080, "start": 10310.12, "end": 10314.48, "text": "eines der anwendungszwecke wo ich mir wo ich wirklich genau drauf gucken würde ob es ordentlich"}, {"id": 1081, "start": 10314.48, "end": 10324.44, "text": "funktioniert also du bist auf windows in vmw in linux der auf einem hetsner server ist"}, {"id": 1082, "start": 10324.44, "end": 10331.88, "text": "ja korrekt ich bin auf windows hab da meine vm und dort war ich eingeloggt auf dem linux"}, {"id": 1083, "start": 10331.88, "end": 10347.56, "text": "server genau so siehts aus"}, {"id": 1084, "start": 10347.56, "end": 10350.32, "text": "habe ich die habe ich eigentlich die sub alerts aus kann das sein"}, {"id": 1085, "start": 10350.32, "end": 10376.24, "text": "tatsächlich soll ich die auslassen oder anlassen sagt man man hört es aber anstört"}, {"id": 1086, "start": 10376.24, "end": 10382.72, "text": "ich da lassen wir es an micky van b dankeschön für den zapp"}, {"id": 1087, "start": 10382.72, "end": 10396.96, "text": "ok ich glaube ich habe nichts übersehen so schauen wir nochmal runter fast"}, {"id": 1088, "start": 10396.96, "end": 10402.8, "text": "ja proxmox auf den richtigen hardware server ja wundert mich nicht"}, {"id": 1089, "start": 10402.8, "end": 10415.8, "text": "sag mal blue media ich weiß nicht irgendjemand aus dem chat arbeitet bei hetsner und hat"}, {"id": 1090, "start": 10415.8, "end": 10419.92, "text": "mein stream an die marketing abteilung weiter geleitet warst du das"}, {"id": 1091, "start": 10419.92, "end": 10442.68, "text": "jetzt sagt jeder ich ja jetzt sagt jeder ich nee"}, {"id": 1092, "start": 10442.68, "end": 10447.36, "text": "machst du eigentlich noch irgendwann ausbildungs story video ja klar als nächstes mache ich"}, {"id": 1093, "start": 10447.36, "end": 10451.96, "text": "die geschichte über den azubi der illegale sachen bei uns im rechenzentrum geostet hat"}, {"id": 1094, "start": 10451.96, "end": 10456.0, "text": "da muss ich aber echt aufpassen dass ich alles anonymisieren dass ich nicht mal den vornamen"}, {"id": 1095, "start": 10456.0, "end": 10457.08, "text": "den richtigen nenne"}, {"id": 1096, "start": 10457.08, "end": 10466.36, "text": "ja wir hatten mal ein azubi der hat bei uns auf den server unten ich habe mich die ganze"}, {"id": 1097, "start": 10466.36, "end": 10471.56, "text": "zeit immer gefragt was was was macht er mit was macht er mit vmw wir hatten ein azubi"}, {"id": 1098, "start": 10471.56, "end": 10476.36, "text": "wir hatten ein zubi vmw cluster und er hat die ganze zeit rum genervt ob er den nicht"}, {"id": 1099, "start": 10476.36, "end": 10478.84, "text": "mal neu machen kann den azubi vmw cluster"}, {"id": 1100, "start": 10478.84, "end": 10483.84, "text": "er hat gesagt ja ich setze ihn auf neue hardware ich mach das neu das ist doch viel besser"}, {"id": 1101, "start": 10483.84, "end": 10490.24, "text": "da können wir üben und alles und bis bis also nicht bei mir ich hatte damit nichts zu tun"}, {"id": 1102, "start": 10490.24, "end": 10496.08, "text": "also der war auch der azubi war auch bei mir aber mit der eigentlichen sache nicht nichts"}, {"id": 1103, "start": 10496.08, "end": 10500.6, "text": "zu tun bis dann hat irgendwann einer gesagt naja gut dann mach halt den azubi esx cluster"}, {"id": 1104, "start": 10500.6, "end": 10507.96, "text": "neu und bis dann irgendwann mal jemand dahinter gekommen ist was der macht es ging überhaupt"}, {"id": 1105, "start": 10507.96, "end": 10512.84, "text": "nicht es ging überhaupt nicht darum dass er den azubi esx cluster neu aufbaut sondern"}, {"id": 1106, "start": 10512.84, "end": 10517.84, "text": "er wollte den also nicht nicht nicht aus reiner nächsten liebe der wollte den azubi esx cluster"}, {"id": 1107, "start": 10517.84, "end": 10521.48, "text": "neu aufbauen weil er darauf illegales stream also was ist illegales streaming der hat"}, {"id": 1108, "start": 10521.48, "end": 10526.88, "text": "ein streaming server also er hat einen streaming dienst gehostet mit film drauf der hat sogar"}, {"id": 1109, "start": 10526.88, "end": 10532.68, "text": "ein werbevideo auf youtube gemacht für den streaming dienst der hat natürlich keiner"}, {"id": 1110, "start": 10532.68, "end": 10537.24, "text": "der rechte oder sonst was in der richtung der hat sogar ein werbevideo richtig richtig"}, {"id": 1111, "start": 10537.24, "end": 10542.0, "text": "schlechtes aber sogar ein werbevideo auf youtube gemacht und das alles liegt bei uns im rechten"}, {"id": 1112, "start": 10542.0, "end": 10547.96, "text": "zentrum wie lang hat das gedauert das weiß ich tatsächlich nicht weil ich hab wie gesagt"}, {"id": 1113, "start": 10547.96, "end": 10557.72, "text": "ich war nicht daran beteiligt an an an an der aufdeckung ich vermute mal so zwei drei"}, {"id": 1114, "start": 10557.72, "end": 10562.6, "text": "wochen also es lief schon ein bisschen das ist auch der erste und ich glaube auch bis"}, {"id": 1115, "start": 10562.6, "end": 10569.6, "text": "jetzt einzige azubi der nicht übernommen wurde und auch nicht die alibi 30 nicht die"}, {"id": 1116, "start": 10569.6, "end": 10574.72, "text": "alibi halbes jahr hintendran her endpunkt wurde auch übernommen ein halbes jahr aber"}, {"id": 1117, "start": 10574.72, "end": 10581.2, "text": "das ist der erste azubi der komplett gekickt wurde danach den hätten sie eigentlich schon"}, {"id": 1118, "start": 10581.2, "end": 10584.56, "text": "während der ausbildung kicken können wahrscheinlich wollte das keiner an die große klocke hängen"}, {"id": 1119, "start": 10584.56, "end": 10591.4, "text": "ist der preis gem schon profitabel mit den reflings der preis gem hat nur in amazon refling"}, {"id": 1120, "start": 10591.4, "end": 10596.12, "text": "und er kommt so selten dran das glaube ich erst einer bisher je was über amazon gekauft"}, {"id": 1121, "start": 10596.12, "end": 10606.08, "text": "hat lohnt sich überhaupt gar nicht preis gem bezahle ich jeden monat irgendwie 50 euro"}, {"id": 1122, "start": 10606.08, "end": 10616.72, "text": "für nix bald auf status kw service das finde ich ist eine gute idee was läuft eigentlich"}, {"id": 1123, "start": 10616.72, "end": 10624.2, "text": "auf kw was läuft eigentlich auf kw punkt service gerade nix aber die domain die die"}, {"id": 1124, "start": 10624.2, "end": 10631.56, "text": "machen wir dafür das ist das ist richtig gut weil den uns des droben mancharo mit"}, {"id": 1125, "start": 10631.56, "end": 10647.0, "text": "e3 wm so"}, {"id": 1126, "start": 10647.0, "end": 10660.32, "text": "der aua wird auch gesponsert ja habe ich gesehen materius ich bin gleich auf 20 minuten noch"}, {"id": 1127, "start": 10660.32, "end": 10667.0, "text": "wir sind mit dem projekt für heute auch schon durch der typ der typ hat echt gedacht er"}, {"id": 1128, "start": 10667.0, "end": 10671.8, "text": "ist massive big brain dabei ist es eigentlich eines der lausten aktionen die du machen kannst"}, {"id": 1129, "start": 10671.8, "end": 10689.92, "text": "hat er wenigstens die vms ich weiß es nicht keine ahnung ich habe den klasse nie in action"}, {"id": 1130, "start": 10689.92, "end": 10703.16, "text": "gesehen aber nachdem ist der azubi vm klasse aber hat er eh keiner drauf geguckt"}, {"id": 1131, "start": 10703.16, "end": 10709.64, "text": "ja man wollte es wahrscheinlich an die große glock ja ich würde mit der endpunkt gerne"}, {"id": 1132, "start": 10709.64, "end": 10715.44, "text": "ein video aufnehmen aber der hat gerade wohl bisschen bisschen was ich probleme jobmäßig"}, {"id": 1133, "start": 10715.44, "end": 10719.64, "text": "ich weiß nicht genau lange nichts mehr gehört aber er hat gesagt er will auf jeden fall"}, {"id": 1134, "start": 10719.64, "end": 10733.28, "text": "was aufnehmen ich mache da keine ads drauf"}, {"id": 1135, "start": 10733.28, "end": 10737.8, "text": "ich sehe nicht was du bestellt hast ich sehe nur was bestellt wurde nicht wer da was bestellt"}, {"id": 1136, "start": 10737.8, "end": 10745.12, "text": "hat heute was da über meine ref links teilweise bestellt wird ich gucke da aber mittlerweile"}, {"id": 1137, "start": 10745.12, "end": 10747.8, "text": "ich habe da früher immer mal reingeguckt weil es interessant fand mittlerweile gucke"}, {"id": 1138, "start": 10747.8, "end": 10761.52, "text": "da rein wie alt bist du eigentlich oder ist das geheim"}, {"id": 1139, "start": 10761.52, "end": 10766.52, "text": "ich meine es weiß ja eh schon jeder ich bin 36 stimmt nicht stimmt nicht ich bin 37 ich"}, {"id": 1140, "start": 10766.52, "end": 10775.2, "text": "bin 37 geworden vor nicht allzu langer zeit 37"}, {"id": 1141, "start": 10775.2, "end": 10780.24, "text": "das war nun ein vorwand gehe ich mal von aus dass er neue hardware bekommt der wollte neue"}, {"id": 1142, "start": 10780.24, "end": 10787.32, "text": "hardware haben für den neuen azubi esx cluster und wie ist das am ende aufgeflogen das ist"}, {"id": 1143, "start": 10787.32, "end": 10792.8, "text": "eine gute frage wie gesagt ich war dann ich war da nicht so involviert ich muss ich frage"}, {"id": 1144, "start": 10792.8, "end": 10799.52, "text": "man nächste woche bei mir das mitgekriegt hat ich kenne ich kenne das youtube werbevideo"}, {"id": 1145, "start": 10799.52, "end": 10808.36, "text": "von ihm aber ansonsten habe ich da nicht viel mitgekriegt"}, {"id": 1146, "start": 10808.36, "end": 10816.16, "text": "den triggert immer rechtsklick kopien muss dich nicht triggern das ist muss man so machen"}, {"id": 1147, "start": 10816.16, "end": 10840.0, "text": "das werbevideo noch online weiß ich nicht"}, {"id": 1148, "start": 10840.0, "end": 10847.48, "text": "ich weiß gar nicht wie die die hat er ich das ist echt eine gute frage wieder das gemacht"}, {"id": 1149, "start": 10847.48, "end": 10855.84, "text": "hat irgendwie hat er sich ist nicht immer gucken"}, {"id": 1150, "start": 10855.84, "end": 10875.32, "text": "er meint er war nicht blöd er hat es halt übertrieben"}, {"id": 1151, "start": 10875.32, "end": 10880.16, "text": "das ist ein reverse proxy naja so ein bisschen das gegenteil von einem normalen proxy normaler"}, {"id": 1152, "start": 10880.16, "end": 10884.84, "text": "proxy greift so mit kleins drauf zu der dann stellvertretend für dich ins internet geht"}, {"id": 1153, "start": 10884.84, "end": 10889.68, "text": "die seite abruften dir zurückschickt reverse proxy ist umgedreht das steht zwischen server"}, {"id": 1154, "start": 10889.68, "end": 10894.64, "text": "und dem internet du greifst aus dem internet drauf zu wirst weitergeleitet an server und"}, {"id": 1155, "start": 10894.64, "end": 10902.88, "text": "die antwort kommt zurück zu dir das machst du zum beispiel wenn du irgendeine web anwendung"}, {"id": 1156, "start": 10902.88, "end": 10908.44, "text": "hast der du nicht so ganz draus unter irgendwas robustes davor haben willst was das internet"}, {"id": 1157, "start": 10908.44, "end": 10913.08, "text": "faced oder wenn du vielleicht basic aus davor machen willst weil es deine anwendung nicht"}, {"id": 1158, "start": 10913.08, "end": 10917.58, "text": "kann oder wenn du zertifikatsmanagement handeln lassen willst von irgendwas was es ordentlich"}, {"id": 1159, "start": 10917.58, "end": 10922.16, "text": "macht und ich irgendwie selbst einbauen willst und so was also ich würde ich würde auch"}, {"id": 1160, "start": 10922.16, "end": 10926.96, "text": "keck ws service nie ins internet hängen direkt das war heute zum testen da kommt immer da"}, {"id": 1161, "start": 10926.96, "end": 10934.12, "text": "kommt immer ein reverse proxy davor es geht nicht um entweder oder du kannst einen docker"}, {"id": 1162, "start": 10934.12, "end": 10939.44, "text": "container laufen lassen und mit einem reverse proxy den ansprechen du kannst auch ein reverse"}, {"id": 1163, "start": 10939.44, "end": 10943.44, "text": "dem docker container laufen lassen aber ein reverse proxy ersetzt kein docker container"}, {"id": 1164, "start": 10943.44, "end": 10949.16, "text": "ein docker container kein reverse proxy weil beides zwei komplett unterschiedliche arten"}, {"id": 1165, "start": 10949.16, "end": 10968.8, "text": "an dingern sind also hat noch nicht mal hat noch nichts mal miteinander was zu tun ja die"}, {"id": 1166, "start": 10968.8, "end": 10975.72, "text": "server gibt es nicht mehr ja wenn du eine webseite hast also wenn du selbst in web server"}, {"id": 1167, "start": 10975.72, "end": 10981.4, "text": "laufen hast also eine web anwendung laufen hast dann ist es sinnvoll davon reverse proxy"}, {"id": 1168, "start": 10981.4, "end": 10995.68, "text": "zu machen und darüber zertifikats handling und solche solche sachen abzufackeln ja aber"}, {"id": 1169, "start": 10995.68, "end": 11007.22, "text": "das kannst du dir auch downloaden also das ist jetzt nicht so das problem ja der typ"}, {"id": 1170, "start": 11007.22, "end": 11012.28, "text": "der typ der sieht wahrscheinlich der typ also mr snot die hätte uns jetzt erstmal erzählt"}, {"id": 1171, "start": 11012.28, "end": 11023.04, "text": "dass reverse proxy benutzer grüne wähler sind oder irgendwie sowas in der richtung"}, {"id": 1172, "start": 11023.04, "end": 11026.92, "text": "ist die server handling auch in stream beziehungsweise video ich habe vor ein paar wochen so ein"}, {"id": 1173, "start": 11026.92, "end": 11031.76, "text": "bisschen linux einsteiger server mäßig gemacht aber das war ein bisschen unstrukturiert"}, {"id": 1174, "start": 11031.76, "end": 11035.78, "text": "da mache ich vielleicht noch mal was zu im prinzip das beste was du machen kannst um"}, {"id": 1175, "start": 11035.78, "end": 11043.72, "text": "was zu herten keine ports aufmachen was nicht läuft kann ich angegriffen werden fertig"}, {"id": 1176, "start": 11043.72, "end": 11048.32, "text": "ansonsten sind wenn du wenn du bei hetzena sagt man mal hetzena ubuntu und den server"}, {"id": 1177, "start": 11048.32, "end": 11058.6, "text": "ist jetzt sind die schon ziemlich sicher vorkonfiguriert da musst du nicht viel machen für komfort"}, {"id": 1178, "start": 11058.6, "end": 11065.32, "text": "würde ich das über ss h keys machen einfach dass man kein password eintippen muss passwort"}, {"id": 1179, "start": 11065.32, "end": 11069.92, "text": "was nicht eingetippt werden muss kann auch nirgendswo abgegriffen werden oder die auch"}, {"id": 1180, "start": 11069.92, "end": 11080.28, "text": "keine über die schultern gucken ja also habe ich jetzt meine ganzen services gelöscht"}, {"id": 1181, "start": 11080.28, "end": 11093.88, "text": "ja ja es ist exzellent kacke ss service hat richtig richtig startup mäßig eingeschlagen"}, {"id": 1182, "start": 11093.88, "end": 11107.8, "text": "das ist hundertprozentig jemand aus dem chat"}, {"id": 1183, "start": 11107.8, "end": 11111.6, "text": "was ist das denn"}, {"id": 1184, "start": 11111.6, "end": 11116.64, "text": "junge junge ist das bei mir unter video"}, {"id": 1185, "start": 11116.64, "end": 11127.36, "text": "das bestimmt ist das nordisch zweite korn unter welchem video ist das"}, {"id": 1186, "start": 11127.36, "end": 11135.44, "text": "wo ist das drunter hast du nicht demnächst geburtstag ich hatte geburtstag jetzt bin"}, {"id": 1187, "start": 11135.44, "end": 11141.12, "text": "ich m6 90 fps"}, {"id": 1188, "start": 11141.12, "end": 11146.48, "text": "unter welchen video ist das jörg it junge junge noch nie so viel falsch"}, {"id": 1189, "start": 11146.48, "end": 11150.32, "text": "aussagen in einem video gesehen wie heute schön ohne plan mit gameplay im hintergrund"}, {"id": 1190, "start": 11150.32, "end": 11154.84, "text": "was in die welt präsent aber nicht mit fakten hinterlegen dank jetzt weiß ich das ist doch"}, {"id": 1191, "start": 11154.84, "end": 11162.24, "text": "miss das nordisch zweite korn das ist doch das kann mir doch keiner erzählen"}, {"id": 1192, "start": 11162.24, "end": 11169.84, "text": "ok ich suche jetzt unter welchem video das bei mir angeblich ist"}, {"id": 1193, "start": 11169.84, "end": 11177.88, "text": "wahrscheinlich hat das photoshop gefakt oder sowas"}, {"id": 1194, "start": 11177.88, "end": 11189.16, "text": "ne das ist überhaupt nicht bei mir unter dem video"}, {"id": 1195, "start": 11189.16, "end": 11214.84, "text": "das hat er das hat er das hat er wahrscheinlich foto photoshop hast du nicht photoshop also"}, {"id": 1196, "start": 11214.84, "end": 11224.76, "text": "ich habe ich habe in meinen ernsthaft"}, {"id": 1197, "start": 11224.76, "end": 11229.32, "text": "ich glaube immer noch du tschie beides mich das gucken wir zwar das ist so ein video von"}, {"id": 1198, "start": 11229.32, "end": 11250.4, "text": "einer telekom ich habe keine in meinen mails gesucht aber nix gibt es nicht das kommandar"}, {"id": 1199, "start": 11250.4, "end": 11261.52, "text": "das ist jebaited ich sag doch der chain als richtig krasser jebader"}, {"id": 1200, "start": 11261.52, "end": 11282.4, "text": "jetzt hätte mich gewundert das hätte ich nämlich schon gesehen"}, {"id": 1201, "start": 11282.4, "end": 11298.84, "text": "ja muss muss so sein"}, {"id": 1202, "start": 11298.84, "end": 11313.48, "text": "oh das ist big brain na gut"}, {"id": 1203, "start": 11313.48, "end": 11328.28, "text": "leute ich geh jetzt auf betke betke time ich hoffe euch hat das stream gefallen"}, {"id": 1204, "start": 11328.28, "end": 11336.44, "text": "wir sehen uns die tage machts gut bis denn"}]}