{"text": "1.2.3.4.5.6.7.8.9.10.11.12.13.14.Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss, tschüss, tschüss.Leute, jetzt geht's wieder los. Ich hatte jetzt 500 Tage Homeoffice, keine Ahnung,geraten, aber so in dem Dreh kommt das hin und morgen gehe ich zum ersten Mal wieder auf dieArbeit nach Frankfurt mit der Bahn, da habe ich jetzt schon keinen Bock drauf, aber das ist nichtschlimm, weil ich habe gleichermaßen den letzten Tag der Woche, wo ich auf die Arbeit muss, also ichgehe morgen nach Frankfurt auf die Arbeit und die restliche Woche kann ich dann daheim Homeofficemachen wieder. Ausnahme, nein, ich habe jetzt, was jetzt dank Corona möglich ist bei uns,ich habe mein Arbeitszeitmodell umgestellt auf zwei oder drei Tage, mal gucken, ich hoffe,es läuft, ja, also was ich hoffe, ich werde wahrscheinlich eben immer drei machen,zwei bis drei Tage Homeoffice und einen Tag bin ich halt mal da. Vielleicht auch mal eine Woche,zwei und dann gar nicht oder wie auch immer, aber ich habe jetzt meine Arbeitszeit umgestelltauf hauptsächlich Homeoffice-Stells. Morgens geht es, es geht eigentlich so gut wie nie,Bahn ist immer, Bahn ist immer richtig, richtig hart der Paints-Champ. Das ist eine Sache,die haben wir Corona zu verdanken, man muss ja mal sagen, es ist jetzt auch nicht alles totalkacke durch Corona gewesen. Gerade, dass viele Unternehmen jetzt mal gecheckt haben oder vorhermusste noch, mussten die Mitarbeiter das selbst erstmal checken, was das ihnen bringt und vieleLeute haben gar keinen Bock mehr zu diesen täglichen Workgrind zu machen mit acht Stundenarbeiten und dann irgendwie noch mal eins bis zwei Stunden fahren und im Prinzip nichts vom Tag haben.Viele Leute haben jetzt erstmal dank Corona gemerkt, wie angenehm das eigentlich ist,wenn man Zeit hat für Dinge, die man gerne machen will beziehungsweise auch Zeit hat sich um mehrSachen zu kümmern. Aber morgen gehe ich erstmal, morgen gehe ich erstmal richtig,richtig Pepofet was futtern in Frankfurt, wenn ich schon mal da bin. Mein Lieblingskollegeist auch da morgen, da gehen wir morgen erstmal gleich eine Runde mexikanisch Pepofet machen.Ja, es hat ja auch noch mehr Vorteile. Ich meine, wenn ich überlege, ich bin viel konzentrierter,mir tut der Rücken nicht weh, ich bin ausgeschlafener. Ich mache wahrscheinlich in der Zeit,wo ich Homeoffice mache jetzt, den habe ich mehr gemacht als davor, mir ist erst mal aufgefallen,wie müde ich eigentlich gewesen bin. Das habe ich jetzt erst dank eineinhalb Jahren Homeofficegemerkt, wie müde ich eigentlich war die ganze Zeit auf der Arbeit. Ich bin immer erst irgendwie15 Uhr richtig aufgewacht, als ich dann wieder aufstehen konnte und heimfahren. Ich habe dasnie realisiert, wie müde ich eigentlich gewesen bin. Dazu kommt, dass ich kaum Krankheitstage habeim Vergleich zu sonst. Also man muss ja auch mal ganz klar sagen, Homeoffice ist was, das lohnt sichfür alle Seiten, wenn sie wollen, wenn sie wollen. Und ich bin mir sicher, oh da muss ich gleich waszu sagen. Und ich bin mir sicher, dass auch in vielen Bereichen, wo man das heutzutage sobauchgefühlsmäßig ausschließt, dass das geht. Bei Handwerkern geht das bestimmt auch. Wenn duHandwerker bist, du musst dich auch mal fortbilden, Rechnungen schreiben, irgendwelche Verwaltungsmachen,irgendwas. Da muss man mal gucken, was es für Möglichkeiten gibt. Vielleicht kann man das nichtjeden Tag machen, das ist klar. Vielleicht, vielleicht auch nur einmal die Woche oder zwei,dreimal im Monat. Mal gucken. Also wichtig ist, es müssen beide Seiten wollen, dann klappt das auch.Echt? Ja gut, was machst du? Wahrscheinlich nicht, wie ich den ganzen Tag vorm Computer sitze. Ja,wie gesagt, ich habe das, naja, nee, nee, das stimmt nicht. Also eigentlich müssen wir erst aberst neun wieder auf die Arbeit, aber ich habe jetzt schon meine Arbeitszeit umstellen lassen,habe ich gesagt, komm, bevor das dann alle wollen, mache ich das jetzt erst mal. By the way,ich sage gleich zu den restlichen Sachen im Chat, vielleicht sollten wir erst mal den Downloadstarten. Wir machen erst mal den Windows Download an, weil ich habe es gerade so durch runtergeladen.Was haben wir hier? Moment, ich mache jetzt ernsthaft meine Linux-VM an, um mir eine neueWindows-Version runterzuladen. Okay, das ist Weird Jam. Okay, wir machen das jetzt von Windowsaus. Windows 2022 Server Download. Das ist relativ easy, man kann den ganzen Kram jetzt direkt vonMicrosoft laden. Ohne Insider. Evaluation Center, genau, was auch immer. Wir evaluieren jetzt.Ich meine, eben hatte ich es doch hier, oder? Wie kommt man da jetzt offiziell hin? Ich findediese Seiten so krass unübersichtlich, das ist echt der Wahnsinn. Wie würde ich das denn jetztfinden, wenn ich es wirklich finden will? Hier, Preview. Okay, 180 Tage, Download ISO,BAM, First Name, Cute, Chat, Company Name, Aja ja, Company Size, viele, Job Title, das stimmtalles nicht. Head of Shit, Cloud-Native, Agile Expert, das gibt es hier alles net. Email-Adresse,okay. Nein, ich darf nicht auf die Leertaste kommen. So, excellent..com, Work Number, Germany. Yes,Select One, Englisch, Download. Gut, und während das jetzt downloadet, was, Alter, das flutscht,aber. Guck mal, hier am Microsoft haben wir so ordentlichen Server am Start. Kannste dichnicht beschweren. 25 MB die Sekunde. So, jetzt kann ich zu den restlichen, also, was hältst duvon Excel oder meinst du das Dateiformat XSLT? Meinst du wahrscheinlich Excel? Naja, also,ich muss sagen, von allen Office-Anwendungen ist Excel noch die, die ich für am, die muss ichanders sagen, die noch die größte Daseinsberechtigung hat. Ich meine, was ist Bestandteil von Excel?Word. Braucht kein Mensch. Was ist sonst noch? PowerPoint. Braucht kein Mensch. Axis. Brauchtkein Mensch. Visio. Braucht man mittlerweile auch nicht mehr. Was ist sonst noch da? Moment mal,ich muss mal gucken. Was ist denn da so dabei? Hier, da. Word für den Arsch. PowerPoint fürden Arsch. OneNote. Die Offline-Version wird immer bestimmt für den Arsch. Publisher schon immer fürden Arsch. Microsoft Access auch für den Arsch. Skype. Business für den Arsch. Das Einzige,was davon übrig bleibt, was eine Daseinsberechtigung hat, ist Outlook und Excel. Das ist da. Outlook,aber auch nur, wenn man im Microsoft-Ökosystem mit, mit, mit Access und, und Active Sync undGeschiss unterwegs ist. Aber Excel. Excel ist die einzige Office-Anwendung, die tatsächlichin gewissen, eine gewisse Daseinsberechtigung hat. Excel ist die IDE der Sekretärin oder derBWL-Stonksleute. So. Und deswegen, die hat Daseinsberechtigung. Ich hab sogar auch letztens,ich würd's mir nicht glauben, aber ich hab doch auch letztens was mit, mit, mit, mit, mit, mitAccess. Nein, mit Excel. Mit Access zum Glück nicht. Access würde ich ihm frei, nichts machen. Mit,mit Excel gemacht, allerdings nur um zwei Wege. Ich hab CSV-Dateien generiert mit einem.NET-Benchmarkund hab'n Kollege gefragt, ob er daraus Excel, äh, die in Excel importieren kann und ein paarschicke Stonks-Graphics machen kann. Hat er gemacht. Kam auch gleich gut an. So. XSLT. Okay,das sagt mir nix. Ist das, ist das der, das Schema, das XML-Schema-Ding? Ist das das XML-Schema? Nee.Was? Leute, ich hab' keine Ahnung, was das ist, aber wenn es was mit XML zusammen hat, äh,zusammen zu tun hat, ist es kacke. Ganz einfach zu beantworten. Also alles, was mit XML hantiert,ist, äh, Paint-Champ und ist es nicht schwer zu benutzen. Ja, du fährst von der anderen Seite.Du fährst von der anderen Seite. Ich fahr' von Hanau aus. Farbwerke, du fährst, du fährst vonoben raus. Ich, ich fahr', ich, ich fahr' von unten raus mit der Bahn. Mal gucken, wie es so weitergeht,wie, wie Corona, wie Corona so weitermacht, ja. Ja, das, das kommt auch dazu. Leute, es war nochnie so einfach, äh, Leute zu erreichen auf der Arbeit, wie als, wie, wie wenn, seit die alleHomeoffice haben. Wisst ihr, was es teilweise für ein Akt war? Du hast einen halben Tag gebraucht,bis du irgendeinen Typ mal erwischt hast an seinem scheiß Platz. Das hat mich so aufgeregt immer.Du hast, wolltest irgendwie was, nur zwei Minuten wissen. Der Typ ist nicht da, der Typ ist nicht da,da ist in irgendeinem Meeting, da ist er Mittagessen, dann steht er sonst wo, du hast keine Ahnung. Heute,easy, du schreibst im Teams, der Typ guckt rein, sagt, ja, okay, ich kann grad nicht,grad Besprechung und meldet sich nachher. Das ist viel einfacher. Also ganz ehrlich, die,wer sagt, die Kommunikation ist besser vor Ort, der hat keine Ahnung. Also zumindest nicht,zumindest nicht, nicht bei mir. Ja, vielleicht sitzt er auch gerade auf dem Klo und ist kacken,ja, kann auch sein. Ihr benutzt noch Skype? Skype haben wir auch mal, das ist richtig Paintschamp.Skype gibt's auch, ganz kurz muss ich jetzt ne Story zum Besten geben, wo wir wieder beihochbezahlten Consultants sind. Wir haben ein Team, was sich um Kommunikationstools kümmert und dahatten wir einen Skype, Skype for Business Experten drin. Und wir wollten damals, ich weiß nicht mehrgenau, für was es war, wir wollten automatisiert aus einem Programm, ah, ich weiß, ich weiß,ich weiß, für was es war. Manchmal, wir haben noch so einen fetten IBM Mainframe und da laufenmanchmal irgendwelche Jobs, die abbrechen. Und da hatten mich damals die Leute, ja, die machenauch Cobol, genau. Da hatten mich damals die Leute gefragt von den Mainframe Leuten, sag mal, hastdu eine Idee, wie wir uns per Skype benachrichtigen lassen können, wenn irgendwie ein Mainframe-Jobabgebrochen ist? Keine Ahnung, das Ding hat garantiert irgendeine, irgendeine API zum Ansprechen. Dahaben wir unseren Skype-Communication-Expert gefragt oder wie auch immer der Typ genau Jobtitel hatteund er hat gesagt, nein, das ist nicht möglich. Also, was habe ich gemacht? Microsoft-Seiteaufgemacht, geguckt, festgestellt, natürlich hat das Ding eine API und festgestellt, es ist eineXML-basierte API, wo wir gerade dabei sind. Du musstest irgendwelche XML-Geschichten ausfüllen,um da Messages zu schicken, aber easy, war total easy. Ich habe eine halbe Stunde gebraucht, habeich was zusammen gewurstet und konnte der Testnachricht verschicken, ganz einfach. Da hat erkonsultant wieder richtig glänzen können, so, bei deinem Text. Was macht der Download? Ist der fertig?Jo. Windows-Server so kurz vor Bett? Ja, wahrscheinlich, das muss ich, ich brauche klare, klare Deadlinefür Windows-Server, weil sonst kriege ich Anfälle, wenn ich damit länger rum machen muss. Ich gehejetzt noch schnell den Chat durch, dann mache ich die VM und Windows-Server-Stells. Äh, nice.Hatte heute meinen Einstellungstest für die Ausbildung als Physi, war pur Stress. Was wolltensie so? Wie lang? Erstmal Frage, schrei bitte at wo plus davor, sonst vergesse ich es nachher,wenn ich beim Chat unten angekommen bin, so raus bezogen hat. Äh, wie lang war der Test? Also wielang haben sie dich insgesamt von rein bis raus gehen? Das wird mich echt interessieren. Es gibtnämlich heute immer noch Unternehmen, die fangen an mit irgendwelchen Assessment-Central-Geschichten,du bist irgendwie sechs Stunden unterwegs und sowas. Äh, da, da glaube ich, die haben den Schussda mal gehört. Ich weiß noch, wo ich mich, ich weiß jetzt, Max Side-Track, äh, Max 95 Side-TrackFPS, ähm, wo ich die Ausbildungsstelle gesucht habe. Also, als ich dann meine Kaufmännischeausbilde, wißt du, ich hatte mal ein früheres Stronx-Leben, mit dem ich jetzt nichts mehr zutun haben will, aber, ey, als ich da die Ausbildung gesucht habe, da war ich auch bei uns vor Ort inirgendeinem Industrie-Laden, keine Ahnung mehr, welcher das war in Hanau, und da hatte ich michbeworben als irgendwelche Elektronik-Geschichten damals. Wollte ich einfach mal gucken, ob die michnehmen, und das war das beschissenste Vorstellungs- und, und Einstellungs-Ding aller Zeiten. Sowas habeich danach auch nicht mehr gesehen. Du bist da rein, also, ich krieg nicht mehr alle Details zusammen,bist da reingekommen, dann wurdest du erstmal rumgeführt, so weit, so gut, so. Dann haben siedich in zwei Gruppen eingeteilt, die erste Gruppe hat den Test gemacht, der ging irgendwie zweiStunden, das ist kein Witz, zwei Stunden, und die, die zweite Gruppe wurde komplett rumgeführt,nochmal im Detail, und dann wurde geswitcht. So, erstens, der Test war der beschissenste Testaller Zeiten. Das war so ein, so ein Psycho-G-Bait-Test. Weiß ich, ob ihr schonmal die, die, die Ehre hatte,sowas zu machen. Das war ein Test in, in Richtung von, ähm, 21, 21 Aufgaben, und die 21. Aufgabe ist,ähm, gebe das, gebe das platt ab. Also, erste Aufgabe ist, oder erste Überschrift ist, bittelesen, bitte lesen sie sich alles durch, und die 21. Aufgabe ist, äh, nachdem sie sich das durchgelesenhaben, können sie den Zettel wieder abgeben. Aber, was hat man in der Schule gelernt? Natürlich,natürlich, ähm, man hat in der Schule gelernt, selbstverständlich fängt man von oben nachunten an, die Zeit ist ja knapp. Oh. Und, äh, da waren dann so total bescheuerte Sachen drin,da ist man jetzt irgendwann gedämmert, dass es G-Bait ist. Ich hab das, ich hab das dann so einbisschen durchgeskippt, die Fragen, und da bin ich, da hab ich dann gelesen, stehen sie auf,und drehen sie sich im Kreis, und so ein Scheiß stand da drinnen. Das ist ein ganz bekannter Test,und, denn, da wollten sie uns richtig, richtig, richtig g-baiten. Das ist richtig cringe, ja, unddanach haben sie uns noch mal irgendwie ne Stunde rumgeführt, ich war da irgendwie fünf Stunden,oder so. Wo ich halt echt sagen muss, wollen die mich ver- also, ich hätt heut im Leben nicht mehrgemacht. Fünf Stunden, obwohl du nicht, warum zeigen die mir jeden Furz da, wenn ich noch nichtmal weiß, ob ich die Stelle da krieg? Das, das war richtig für'n Arsch, also, kann ich mich nochdran erinnern, das war eines der negativsten Erlebnisse, was ich so Job-Suche-mäßig je hatte.Naja, okay, also. Ja, ist so, man ist einfach auch viel wacher. So, gerade eben hat jemand seinenprivaten Domain-Controller verloren. RIP. F für den Domain-Controller. Gut, ich kann danix zu sagen, ich hab damit noch nie was gemacht. Ja? Ja, ich auch nicht. Das Einzige, was ich hatte,ist, wo ich mal krank war, wo ich, ich vermute, dass es entweder an einem Rahmschnitzel lag oder aneinem Döner-Teller, weil ich hatte, ich hab euch ja mal erzählt, ich hatte wirklich die letzteneineinhalb Jahre über das erste Mal in meinem Leben eine meldepflichtige Krankheit, und es warnicht Corona, es war irgendwelche Darm-Viren, und das erholt man sich meistens zu beessen. Undich hab jetzt letzten Monat ja viel bestellt, und entweder war das halt das Rahmschnitzel oderder Döner-Teller. Ich glaube aber, dass es das Rahmschnitzel war, das kommt zeitlich eher hin.Ja, da hat sich mein Pockers-Klo wieder richtig ausgezahlt. Meinung zu E-Bahn?Mittlerweile, muss ich sagen, hat sich meine Meinung geändert. E-Bahn eintippen ist immernoch Müll, aber die Zukunft ist jetzt auch in Deutschland angekommen. Oftmals kann man QR-Codesscannen auf Rechnung, und wenn nicht, haben die meisten Apps von den Banken die Möglichkeit,dass man zumindest die E-Bahn OCR erkennt vom, oder die Überweisung OCR erkennt vom Überweisungsleger.Es gibt leider immer noch welche, die sind total oldschool, die schicken dir eine Rechnung,so nach dem Motto, vielen Dank für Ihren Auftrag, blablabla, bitte überweisen SieZahlungsziehen innerhalb von 14 Tagen, und hier bitte auf dieses Konto. Das ist natürlich Müll.Leute, ich hab die Idee, ich brauch einen QR-Code. Ich brauch einen QR-Code für meine Rechnung.Exzellent. Ich schreib so selten Rechnung, aber das brauch ich. OCR-Code, Horace. Richtig nice.Okay. Meinung zu Jaml? Eglige Sündtagsfehler, oftmals weil du nicht genau guckst auf Einrückungund Sonderzeichen und sonst was. Wer es nicht weiß, Jaml ist ein super Set von Jason, auch wenn eskomplett anders aussieht. Gültiges Jason ist automatisch gültiges Jaml, umgedreht natürlichnicht. Aber trotzdem, Jason ist mir lieber. Der einzige Vorteil, den ich sehe von Jaml vs. Jason,ist, dass du in Jaml Kommentare machen kannst. Wird noch ausgehandelt. Ja, genau, ist bei unsauch so. Wir haben das zwar schon immer ein bisschen dynamisch gehandhabt bei uns,weil wir sind ja Poggers agile IT, aber dass es bei uns eine unternehmensweite Regelungzur Homeoffice gibt, das geht nur wegen Corona. Der Desktop ist richtig pock. Ich habe es schongezeigt, ich finde in Sekunden was. Wer sich die Mühe macht, den Desktop aufzuräumen,findet die Sachen auch nicht schneller. Also, verschwendete Zeit. So, gleich haben wir es mitdem Chat. Google Sheets mit Add-In. Ja, kann man verwenden. Ja, Wordfiles anzeigen ist ja okay,aber es ist richtig painstamp, wenn man Wordfiles zum editieren bekommt. Ich meine,der PDF ist ja noch in Ordnung, wenn man einfach Dokumente austauschen muss, aber diesesWord-Datein rumgeschicke ist eigentlich sowas von 1990. Wir machen wie gesagt seit eineinhalbJahren Daily-Scrum und Geschichten alles im Teams. Was für ein Ding. Was ist Edifact?Sagt mir nix.Ein, eine Stunde lang Online-Test, aber war schon ganz schwer. Hab auch Versicherungskaufbahngelernt, arbeite auch noch da und bin eigentlich so Tests gewonnen, aber der war gut anstrengend.Als für die Ausbildung oder für den richtigen Job dann. Du weißt, ich werde mal wieder ausatmen,ja? Richtig cringe. Dankeschön Phoenix für den Sub. Mir geht es ganz gut,außer dass ich morgen wieder arbeiten gehen muss nach Frankfurt. Ja, das denke ich mir heute auch,das ist voll für den Arsch. War das bei einer Firma, das war nicht beim Arbeitsamt. Arbeitsamthabe ich ja eigene Geschichten schon erzählt, das ist ja auch absolut useless Laden. Ja,das ist total unsinnig. Das ist total unsinnig. Ich weiß nicht, was man daraus ableiten kann.Der Mann möchte mithilfe der Sanduhren 13 Minuten stoppen. Beide durchlaufen lassen,oder wie? Ne, beide durchlaufen geht ja nicht. Das eine ist ja zwei Minuten,das eine sind ja dann bloß zwölf Minuten. Ganz einfach. Ohne Sanduhren, man zählt einfach.Easy. Ich wollte gerade sagen, einfach bis 60 zählen. Easy. Fertig. Oder Google fragen.Google weiß da meistens auch die Antwort drauf. Und was ist die offiziell anerkannte Antwort?Wie geht das? Man kann ja nicht wirklich zuverlässig erkennen, wann halbe halbe ist.Also halb durchlaufen lassen ist keine gute Antwort. Also halb durchlaufen lassen,also ne, aber halb durchlaufen ist dumm. Halb durchlaufen, das ist ja auch überhaupt nichtexakt. Es geht ja darum, dass man es richtig hat. Halb durchlaufen, ist das jetzt halb durch odernicht? Kann man die vielleicht auf die Seite legen und dann läuft sie immer exakt bis zurHälfte durch? Ja, würde mich mal interessieren, was da die gute, gute Antwort ist. Das sind sosinnlos Brain-Teaser-Fragen. Naja. Unser CEO will uns alle wieder ins Büro holen. Das istkein Kündigungsgrund für die Mitarbeiter. Hä? Wie? Moment. Es ist ein Kündigungsgrund. Dasverstehe ich jetzt nicht. Sagt er, es ist ein Kündigungsgrund, wenn man nicht kommt oder dieLeute kündigen nicht, wenn man sie dazu herordert. Naja, das hat man jetzt gerade bei Apple gesehen,wie gut das funktioniert. Mit, die Leute müssen wieder. Hearthstone ist random. Ich habe mal eineWeile recht viel Hearthstone gespielt, aber das bin ich, bin ich raus. Download Progress ist fertig.Was? Fünf Minuten zweimal und sieben Minuten halb durchlaufen lassen. Äh, das wären dann,wären dann dreizehneinhalb oder wie oder? NKZNE, Dankeschön. Für den Sub. Klar sollte die,also was? Ich meine, man könnte das voneinander abziehen, oder? Man könnte es doch voneinanderabziehen, oder? Also, also man lässt die Siebener durch, man lässt die Siebener durchlaufen und wenndie Fünfer durchgelaufen ist, weiß man, die Siebener sind noch zwei Minuten übrig. Oder? Daskönnte man auch machen. Aber hat man da was von? Hat man da was von? Dann weiß ich,da sind noch zwei Minuten. Moment, Moment, Moment. Big, big brain, big, big, big brain time. Also.Was schreibt er jetzt? Zehn Minuten nach Beginn ist die fünf Minuten nur zum zweitmal durchlaufen.Die Siebener ist dann bereits drei Minuten. Ja, ja, ja, ja. Nee. Was? Ah. Ja, so was in derRichtung. Ja. Ja, ganz im Ernst. Das sagt doch null drüber aus, ob das beispielsweise guterProgrammierer ist oder sonst was, wenn er da ist, wenn ihm da so spontan nicht das Richtige zueinfällt. Ja, irgendwie so was. Ja. Ach, die Leute kündigen nicht, wenn sie ins Büro sollen. Jetzthat man ja bei Apple gesehen. Da sind ja haben jetzt ja auch schon einige gesagt. Nee, kommennicht mehr. Battle Royale Games kann ich jetzt nichts zu sagen. Das wird zwar zu lang. So, ich muss meine Windows-VM starten, Leute. Bäm. Also ausmachen. Kann ichirgendwas hier von recyceln? Was haben wir denn hier? Windows, Windows Zeug. Das brauche ichdoch nicht mehr hier, oder? Brauche ich das noch? Das brauche ich doch gar nicht mehr. Ist das,ist das hier mein richtiges Windows 11? Ich muss meine VMs mal ordentlich benennen. Ist das,ist das mein, mein, mein neustes Windows 11? Da kann ich das andere nämlich recyceln als, als Windows Server.Auf. Ja, Qtweep93, das ist die Richtige. Okay, äh, wo war, wo ist Rename? Rename? Windows 11. Und das ist, das wird jetzt renamen.Windows Server. Okay, sehr schön. Kann man das wieder ausschalten?Nee, OneDrive nervt jetzt nicht. Gut, dann hängen wir nämlich jetzt hier mal die ISO dran. Ich glaube,hier war nichts mehr drauf. Alter, was ist das für ein Gelegge? Das macht mich jedes Mal fertig.Dieses, dieses Fenster. Wie, wie das laggt, wenn du das Track und Drops. Eine Güte.Okay, äh, vier CPUs habe ich da drinnen. Warum, vier? Was ist mit mir los? Warum habe ich da vier reingemacht?Egal. Dann läuft der Flutsch der Windows Server wenigstens. Äh, warum kann ich das nicht ein, weil es noch an ist?Was habe ich denn da ausprobiert? Brauch mal alles nicht. Kann man, kann man wegschmeißen. Power off.So, äh, Windows ISO. Komm her. Wo hast du dich versteckt? Da. Ich will, ich will die mal MD5 Summen, die Windows ISO, was ich da habe.Habe ich irgendwie sowas drauf? MD5 Summen? Oh! MonkaS? Tatsächlich, hätte ich gerade gedacht.CD Downloads, äh, MD5 Summen, wie, wie ist dieses Ding jetzt? 20, 20.03, das da.Ja, ist, mir wurscht, ob das unsicher ist. Zum Testen, ob, äh, der Download richtig ist, beziehungsweise was das Internet dazu ausspuckt.Hallo? Willst du copy-pasten? Ich will das, Windows, ich will das copy-pasten.Wie geht denn das? Edit, copy. Ah, Mist. List Files bei Microsoft.Okay, ich hab, ich hab wahrscheinlich das Richtige. Windows Server, Preview, ja, okay, okay. Alles, alles klar.Nee, ich will gucken nicht, ob ich das Richtige runtergeladen habe. Ich will es, ob ich das Letzte runtergeladen habe.Also, ob das, vielleicht hätte ich jetzt ja was gefunden, so nach dem Motto, das ist, das ist Preview 1 und es gibt schon Preview 5 oder irgendwie sowas.Also, weiter. Next. Einlegen, starten. Bam. Escape-Hammern. Zu spät, nee, rechtzeitig sein. Wir wollen booten von CD.Hallo? CD ist nicht connected. Von CD. Sehr gut. So, dann installieren wir den Kram mal, äh, den Kram mal.Das ist eher CAC-WTF, genau. Keyboard-Input. Was? Ui, Ui-Gur-Legacy. Alles klar. Das ist Proma.Time-Currency-German. Ach, ich verge, ich vergesse, aber es lohnt sich überhaupt nicht, hier einzustellen, weil das für Windows eh nicht verwendet wird am Ende.Äh, Englisch. Install now. Sag mal, ist das immer noch der Vista-Installer? Sehe ich das richtig?Gerade für den Windows-Server, warum spendieren die dem nicht mal einen ordentlichen Text-Installer?Dieses rumgeklicken, da muss der eine Maus anschließen am Server und sowas, das ist doch scheiße.Desktop. Ok. Was gibt es für Unterschiede? Windows-Server 2022. Standard-Evaluation und Desktop-Evaluation.Ich glaube, ich brauche Desktop-Evaluation, ich erinnere mich dunkel, weil Standard, da kriegst du nur so ein Power-Shell-Fenster, oder?Jaja, das finde ich ja auch löcherlich. Du kriegst dann, ich kann mich auch dran erinnern, als das neu war.Da kriegst du dann ein Shell und ich dachte damals, Windows läuft jetzt im Text-Modus, also die haben jetzt eine ordentliche Konsole und ein ordentliches Text-Interface,aber nein, es ist im Prinzip einfach nur ein CMD-Fenster ohne dass der Desktop startet. Komplett Windows-Style halt.So, I accept, jawoll, custom. So, erstmal diesen ganzen Schmodder löschen. Und bin ich in der richtigen VM?Ich bin in der richtigen VM. Muss man auf Nummer sicher gehen. Was ich bis heute nicht verstehe, warum gibt es nicht einfach so einen Button,so nach dem Auto drüber installieren, mach. 60G sollte reichen. Huge high speed Windows-Installation. Wir machen das mal ein bisschen größer.Also Leute, ich hab keine Ahnung von Windows, das wisst ihr ja, ne?Null Plan. Ich weiß auch nicht, was wir dann damit machen. Ich muss dann erstmal gucken, was denn jetzt die Neuigkeiten von Windows 2022 stehen.Stimmt, wo ist der Sebaro?Das ist gute Installationsmusik, oder?Wie, du hast keinen Plan von Windows als Informatikor, was ist da los? Ja, ich weiß. MrSnotty hatte einfach recht, ich hab keinen Plan.Exposed wieder. Könnte man die Server-Version eigentlich auch als Daily-Driver verwenden? Ich bin mir nicht sicher, wie es da mit 3D-Beschleunigung und sowas aussieht.Hack-Arrived brauchen wir doch nicht. Wir haben Wub-Arrived.Okay, ich weiß was. Challenge für mich heute. Ich versuche eine statische HTML-Seite mit Windows-Bordmitteln auszuliefern. Da muss ich wahrscheinlich ein IES für installieren oder sowas. Das wird ganz pains-champing, Alter.Das wird schlimm. Wie sprechen das eigentlich die coolen Leute aus? IIS oder mit SSL-Zertifikat? Stimmt, wie macht man mit IES? Let's Encrypt.Ohne Kacke, ey, was sich da Microsoft immer ausdenkt.Okay, also auf geht's. Real Name, Administrator, natürlich. Woher weiß der das bloß? Admin mit Vorname und Strator. Klingt fast ein bisschen italienisch. Strator oder griechisch oder so. 1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6. Bam, finish. Was?Das ist das meistverwendete Passwort auf der Welt. Das ist best practice. Wie kann das meistverwendete Passwort auf der Welt abgelehnt werden? Okay, 1, 2, 3, 4, 5, 6, underscore. 1, 2, 3, 4, 5, 6, underscore. Finish.Okay, 1, 2, 3, 4, 5, 6, underscore. 1, 2, 3, 4, 5, 6, underscore. Ah, yes, jetzt ist alles klar. Merkt euch, 1, 2, 3, 4, 5, 6, underscore. Ich weiß das in 2 Minuten schon wieder nicht.Oh Mist, habe ich jetzt das Passwort geleakt? Chat, chat. Nicht, nicht, nicht ein Hackhorn, ja? Hallo? Ah, man muss doch Ctrl, Alt, Delete machen, ups. 1, 2, 3, 4, 5, 6, underscore.Kann man da... Yes. Hab ich Bridged eingestellt? Na gut, geht auch. Okay, ich muss jetzt erstmal, bevor wir irgendwas machen, muss ich Forever Tools installieren.Damit ich, damit ich was sehe. So hältst du das, so hältst du das ja nicht aus. Erstmal, ich hoffe, man kann Forever Tools ordentlich installieren.Wenn nicht, muss ich da per RDP drauf. Das machen wir, das machen wir als erstes erstmal RDP an.Wobei der Windows, sag mal, installiert man auf einem Windows Server Forever Tools, sagen wir mal, wenn man das auf einem ESX betreibt, wahrscheinlich, wahrscheinlich schon, oder?Weil sonst kannst du ja, hast ja Probleme, dass die Uhrzeit nicht stimmt und sonst was. Ich mein, Linux-mäßig haben wir Forever Tools überall drauf. Ja, dann geht das jetzt auch.Der EF-EWM-Driver, alles klar, vor allem ja. Zack. Fullscreen, da sind wir. Fertigstellen. Nein, wir starten jetzt nicht nur. Also, was will er uns mitteilen?Try Managing Servers with Windows Admin Center. Edge. Welche Edge ist das? Ist das schon, ist das schon der Chrome Edge?Ich glaube, das ist schon der Chrome Edge, ne? Ist updated erstmal. Das ist Windows Server 2022, ja? Wir können ja mal gucken, ob das hier funktioniert winfair. Ja. Windows Server 2022.So. Okay. Windows Admin Center. Was? Download? Moment, Moment, Moment. Sehe ich das richtig? Ich kriege einen Popup angezeigt, dass ich mir aus dem Internet einen Server Admin Frontend runterladen soll, um den Server zu administrieren?Wollen die mich komplett verarschen? Ist das ernsthaft? Ist halt optional. Ja, dann sollen sie es mitliefern. Meine Güte, ich gehe doch nicht ins Internet und lad mir da random irgendwie einen Scheiß runter auf meine Kiste.Ach du, meine Güte. Das ist ein Web-UI. Okay. Aber trotzdem. Warum liefert man das nicht als Windows Feature mit? Okay. Best Practice. Genau. Don't Show. So. Das kenne ich. Das habe ich schon mal gesehen.Irgendwann in Windows Server 2003 oder so. Da sah das aber noch ein bisschen anders aus. So. Jetzt versuche ich. Wie kriege ich einen LDP-Server an? LDP? Nein. Remote?Hier, hm? Remote? Man muss das über die Settings-App machen. Das ist so pains-champig, Alter. In der Konsole S-Config eingeben. Okay. S-Config.Oh, jetzt kommt. Jetzt kommt Windows Hexerei. Haben die das Windows Terminal mit installiert? Nee. Nee. Wer braucht schon ein ordentliches Terminal unter einem Server? Naja, das geht aber nicht.Kann man PowerShell aufmachen, wenigstens. Die Uhr? Nein, die Uhr ist wahrscheinlich einfach falsche Zeitzone eingestellt. Das können wir gleich mal fixen.Wo stellt man die Zeitzone ein? Hier. Da. Wir sind plus zwei. Also da plus eins. Aber normalerweise. Also aktuell sind wir plus zwei. Weil Sommerzeit. Sync now. Sehr gut.Sysdmcpl. Ach, du Scheiße. Man muss schon hart im Nehmen sein, so ein Kram kennen, wenn man Windows-Kram administrieren will. Okay. Geht nicht. Ah. Ich mach das jetzt, wenn du was hast.S-Config. Es gibt jetzt einen Kommando-Zeilen-Tool, um Windows-Server zu konfigurieren. Okay. Fivehead. Sieben. Remote Desktop. Enable. Allow only clients running remote desktop network level authentication.Annie. Ist mir doch wurscht. Successful. Re... Ich muss... Ich soll restarten, deswegen... Wirklich? Das kann ich mir nicht vorstellen, dass ich deswegen... So. Ich muss aber eh jetzt mal hier einstellen, dass ich...Bridged Networking haben will. Dass ich da drauf zugreifen kann. Ach, war das noch wegen Forever Tools? Ja, das kann sein. Restart is required. Okay. Ja. Restart. Restart. Yes.Das ist eine ganz, das ist ja eine ganz wilde Mischung mittlerweile aus aus nervigen Teilen von Windows 10 und das ist eine ganz, ganz wilde Mischung hier, das UI.Ganz, ganz wilde Mischung, ey.Ja, ja. Ich kann mit Nat drauf zugreifen, weil ich auf der gleichen Kiste bin, aber da muss ich jetzt die IP vom Vmware-Interface raussuchen.Ne, muss ich nicht. Könnte ich einfach da in der Konsole gucken. Egal. So, wie macht man das jetzt? Ctrl-Alt-Entfernen hier drin. Send, Ctrl-Alt-Entfernen. Jawoll.123456A Underscore. Aus welchem Grund will das jemand freiwillig nutzen? Das einzige, was mir einfällt ist, wenn man halt Windows-Services verwenden will, ja. Irgendwelche Active Directory Geschichten oder halt irgendwelche Windows-Only Geschichten. Ansonsten, warum man sonst verwenden will, keine Ahnung.Ok. Also, Moment. Welche IP hat das Ding jetzt? PowerShell. Kann das Ding starten, wenn ich wegen seiner größeren Schriftart habe? Edit. Default. Ja. Bam.Ah, reicht mir immer noch, aber es... Ah! Das Windows-Terminal! Please, Microsoft, warum habt ihr nicht das neue halbwegs Gescheite mit vorinstalliert? Ok, ja, so ist das. Ok.Versuch mal, ob Ctrl... Jaja, das geht. Das habe ich vorhin schon gemacht. Also. Gibt es WinGet? Gute Frage. Nö.So, und jetzt, und jetzt müssen wir mal hier gucken. Wie war das IP-Config, ne? Ok. 133. MSTSC hier. Ups. 133. Administrator. 123456A Underscore. Bam.Signifikat, natürlich. Hoi! Massive. Funktioniert. Notification Center.Also, ich will keine Daten an Microsoft schicken. Lass mich in Ruhe. Feedback-Frequency. Never. Lass mich in Ruhe, Microsoft. Wenigstens auf meinem Server, lass mich in Ruhe.Ok, aber wir machen es über VM, aber es funktioniert wahrscheinlich. Lockt es sich aus, wenn man sich per RDP einlockt? Eigentlich, ja.Gleiches Profil. Aha. Aha. Ok, das erste haben wir schon geschafft. RDP angeschaltet. So. Ok, machen wir weiter. Was macht man dann sonst noch so? Äh, zeigt mal hier. Was gibt es denn hier Schönes?Äh, also mein Server ist wohl kaputt laut Microsoft. Warum? Weil... Ist es jetzt gut oder schlecht? Was sagt mir das jetzt? Was oben auf Refresh?Äh, es ist immer noch kaputt. Ein Service ist es ja. Wie das gefrescht sich heute mal selbst. Das ist ja Absurd Bleeding Edge Software hier.Ah, das Edge Update. Kann man das jetzt starten? Jawoll, Edge Update. Natürlich, das ist ganz ganz wichtig. Das muss selbstverständlich aktiviert sein.Cannot be started. Ok. Genial. Ähm. Wunderbar, was kann man damit jetzt Schönes machen? Also Add Roles. Was ist denn jetzt neu? Ich muss jetzt erstmal gucken, was ist denn eigentlich neu?Windows 2230. What's New? Wir müssen ja was Neues machen. Jetzt haben wir uns nämlich... Ist das auch das letzte was wir uns angeguckt haben? What's New?What's New? Ok, dann wir gucken, was Microsoft sagt. Das ist mir zu Microsoft-isch. Gibt es eine gute WinFuture? Die Seite klingt schon nach Windows.Du solltest unbedingt Updates installieren. Stimmt. Updates. Updates. Check Updates. Wie würde man eigentlich Updates checken von der Kommandozeile? Geht das überhaupt?Kann man Updates machen? Irgendwie über PowerShell oder so? Oh. Da geht was. Erstmal updaten lassen. Ok, in der Zeit können wir gucken, what's new.Also. Konsequente Weiterentwicklung, aber auch Vereinfachung. Das enthält Sicherheitsfeatures, Hybridfunktion, Verbindung mit Azure, blablabla. Microsoft Container. Microsoft Container ist ja im Prinzip nur VM, was in einer VM nicht sonderlichsinnig ist.Windows Server hat neue Sicherheits. Wie das war's? Can't wait. Muss doch ordentlich ein Artikel. Reddit. Reddit. Reddit hat bestimmt Ahnung. What's New? Reddit. Reddit. Zeitschirr. Blogpost.Ich will doch einfach nur für Leute, die keine Ahnung haben, eine Erklärung, was denn jetzt tolles Neues dabei ist. Kann doch nicht sein.What's New? Äh. Tja. Ähm. Altaro. Mal gucken. Hoffentlich ist keine GBay-Zeite. Die haben einfach den Gramm kopiert von Microsoft. Das Admin-Center. Ok. Ist das Admin-Center?Ist das so ne. So ne Art. Und das nennen so ne Web. So ne Art Web GUI, wo man mehrere Windows, so ne Windows Dashboard-Management-UI, also sprich man hat 20 Windows Server und kann dann darüber die wichtigsten Funktionen zugreifen.Das wäre tatsächlich sogar ganz sinnvoll. Ist quasi wie bei Azure. Ja gut, nur bisschen übersichtlicher. Azure ist ja wirklich undurchsichtig als Fuck. Ok. TPM. Juckt mich gar nicht. Virtualization Based Security. Ja. Meinetwegen.Control Flow and System Guard. Das juckt mich jetzt auch nicht. Memory Protection. Ok. Das heißt im Prinzip gibt's da für mich jetzt nicht wirklich spannendes Zeug, oder?Ah guck mal, das ist normal, dass da ein Service nicht läuft. Das anscheinend, anscheinend muss das so sein.Was ich bei diesen Microsoft Anwendungen halt immer, was mir da direkt ins Auge springt, wie fummelig. Fummelig ist das richtige Wort. Wie fummelig alles ist. Das liegt aber bestimmt auch daran, weil ich es nicht gewohnt bin. Aber es macht immer alles einen sehr zusammengestökelten und fummeligen Eindruck.So. Aha. Networking Improvements. Ist das nicht das neue TCP? Ist das nicht, wo sie versuchen TCP mit abzulösen, was sie wahrscheinlich nie schaffen werden?Features. Oh, das machen wir jetzt. Ok, dann versuche ich jetzt mal das hinzubekommen, was ich machen will. Statische HTML-Seite. Hello World HTML-Seite ausliefern. Hyper-V. Conclusion. Alles klar. Ok, also.Was sonst? Was sonst? Natürlich Restart.Wie, da war noch nicht fertig? Warum stand da noch ein Restart da? Auch als Windows-Admin sucht man sich immer einen. Ja, wundert mich nicht. Ich meine, man muss sagen, das ist unter Linux auch alles andere als selbst erklären. Aber ich finde es trotzdem, dass es eine gradere Linie hat.Gerade wenn man sowas wie, was macht der da jetzt eigentlich? Der Update Orchestrator Service. Gerade wenn man, sagen wir mal, hauptsächlich Ubuntu verwendet oder Red Hat verwendet und sich so in eine Richtung gewöhnt hat, da findet man sich normalerweise ziemlich gut zurecht.Klar, wenn ich gucken will, wie konfiguriere ich Programm XY, muss ich mir die Seite von denen angucken. Aber ich komme damit zumindest deutlich einfacher klar. Gerade auch, dass man das ordentlich über SSH verwalten kann.Gut, Samba-Config ist aber auch Paints-Champ. Wobei ich also ganz ehrlich, wenn ich einfach nur einen Windows-Share bereitstellen müsste, dann würde ich das trotzdem mit Linux machen und mich durch die Samba-Config kämpfen.Mittlerweile ist die Samba-Config aber besser geworden. Du brauchst ja, also mittlerweile brauchst du nur noch 5 Zeilen oder so in der Samba-Config und es geht. Warum? Was ich nicht so genau verstehe ist, das, was macht der denn jetzt eigentlich?Der Shutdown in Update Orchestrator Service.Ah, wie wäre es mit so einem Fortschrittsbalken oder so?Ja, also dann würde ich trotzdem einen Linux-Samba-Server hinstellen, wenn ich einfach nur Windows-Share machen muss. Mit AD gekoppelt sieht das Ganze vielleicht schon wieder ein bisschen anders aus. Aber trotzdem, ich glaube, AD wäre das einzige, wo ich freiwillig irgendeinen Windows hinstellen würde.Okay, ich gehe mal kurz in den Chat gucken, bis du den Update installiert hast.Nee, nee, nee, es gibt Sachen, die mache ich jetzt gar nicht. Ja, das stimmt. Wobei man sagen muss, wenn man sich ein bisschen dran gewöhnt hat, du musst unter Linux gar nicht mehr so viele Code-Snippets zusammen kopieren.Also, vorausgehend hast du die Sachen halt schon ein paar Mal gemacht. Also, so die Basics-Sachen, die weiß man eigentlich nach einer Zeit. Es ist aber, wie gesagt, es ist unter Linux auch nicht alles Gold.Also, dass zum Beispiel die ganzen Commando-Zeilen, Tools unter Linux alle unterschiedliche Vorstellungen haben, wie man die Parameter benennt. Ich sage nur Minus Minus Help, Minus H, Minus V, Minus Groß V, Minus Minus Version, Minus Version, was auch immer.Die sind sich da auch nicht einig. Aber zumindest hat es irgendwie eine gewisse klare Linie. Aber gut, ich habe keine Ahnung von Windows. Vielleicht hat es das in Windows auch, aber ich bezweifle es.Kurz auf Topic. Was ist die einfachste Möglichkeit, um eine ASP.NET Core Web App auf einem Linux Server zu... Du musst da nichts anderes tun, als unter Windows. Du baust das Ding, SCPsst es auf dem Linux Server und startest es.Die einzige Sache, die du dich fragen musst, das musst du aber unter Windows auch machen. Hast du.NET auf dem Server installiert? Ja oder nein? Wenn du.NET auf dem Server installiert hast, ist es ganz einfach.Hinkopieren,.NET Run, fertig. Wenn du es nicht auf dem Server installiert hast und nicht installieren willst, Self-Content Deployment, hinkopieren, ausführen. Du musst nichts machen. Das ist genau das gleiche, wie unter Windows. Sogar noch einfacher, weil du so Sachen wie SCP machen kannst und nicht bei SSH drauf einloggen.So, Unlock. Er hat erneut gestartet. Mal gucken, ob er jetzt durch ist mit den Updates.Schnell gucken. Ich glaube, ich habe sonst alles vorgelesen. Versuch jetzt bei Hetzener mal ein Kubernetes-Demo-Projekt. Jetzt? Nee. Jetzt nicht.Docker unter Windows waren doch immer VMs. Docker unter Windows waren in der Vergangenheit immer Hyper-V VMs. Okay, vielleicht ist es jetzt anders.Warum ist da überhaupt ein Webbrowser drauf? Warum ist da überhaupt ein kompletter Desktop drauf? Und auch wenn man sagt nur Terminal, warum ist dann trotzdem noch ein komplettes Windows? Jetzt ist halt Windows andere Philosophie. Die haben halt viele Wizards zum Durchklicken.Die mögen das. Oh, jetzt sind wieder fünf Services kaputt. Warum reflechte er gerade nicht selbst? Okay, Edge geht standardmäßig auf. Excellent. So, Updates. Wie sieht es jetzt mit Updates aus? So, jetzt wird es gleich anstrengend.Jetzt muss ich gleich ein IES installieren mit statischem HTML. Okay, ich lege mir schon mal ein HTML an, was ich rüber kopiere.HTML. HTML. Okay. Jetzt wird es abgedreht. Okay, jetzt ist es fertig. Ich kopiere mir das mal kurz hier irgendwo hin. Warum habt ihr so ein Pictures-Folder?Okay, Index Punkt Punkt HTML. Oh nein, das ist doch nicht mal auf den IEM Server eingeschaltet, dass du standardmäßig Dateiendungen editieren kannst.Das ist so fail. Ah, wo geht denn das noch mal? View? Filename Extensions. Ja, wer will sowas auch machen, ne? Okay, Index HTML, Pongas. Geht die? Jawoll. So, und die jetzt über den Web-Server ausliefern.Jetzt, jetzt, jetzt können wir mal, jetzt kann ich auch meine richtigen Hardcore-Winner-Skills zeigen. Äh, welche Internetseite oder YouTube-Tutorials würdest du empfehlen, für HTML-CSS zu lernen?Gute Frage. Kann ich die jetzt gerade nicht beantworten? Ehe, W3-Skills zackt. Oh, Moment, wie installiere ich da jetzt was? Add Roles and Features.Moment, ich muss gerade mal im Chat noch was beantworten. Zum ASP.NET Core Web App Deployment. Wie bekomme ich meine App mit HTTPS zum Laufen? Geht leider nur mit HTTPS. Hast du denn ein gültiges Zertifikat?Das einfachste ist, einen Reverse-Proxy davor zu machen. Was wir, by the way, übrigens, wenn du dir angucken willst, wie man ASP.NET Core Web Application deploys auf einem Linux-Server, warum bin ich da nicht früh drauf gekommen? Guck dir einfach, guck dir einfach den Stream von gestern an. Ja, magst halt die Klappe. Guck dir einfach den Stream von gestern an.Server-Automatisierung plus Deployment C-Sharp-Web-Anwendung. Du kannst ein bisschen skippen. Viel Gelaber und du kannst dir das Git-Repo dazu angucken. Wo? Alter, wo? Lords. Und du kannst dir das passende Git-Repo dazu angucken, was sich nennt?CACW as a Service. Da ist die Web-Anwendung drin und die Ansible-Rolle zum Konfigurieren vom Server. Da siehst du alles, was du brauchst, um das wirklich schön zu machen mit der Web-Anwendung. Inklusive Unit-File und allem. Brauchst du aber nicht. Im Prinzip, du kannst einfach drauf kopieren und starten.So, und wie du das mit HTTPS machst, das machen wir im nächsten Stream dazu. Das wird ein dreiteiliger Stream. Aber das einfachste ist, ein Reverse-Proxy zu nehmen, der für dich Let's Encrypt und HTTPS handelt.Du lässt auf Localhost deine ASP.NET Core Web-Anwendung laufen. Einfach auf Localhost auf dem Server. Dann machst du ein Reverse-Proxy davor. Cutty ist am einfachsten, weil der hat alles eingebaut für simple Sachen. Du kannst aber auch jedes andere nehmen. Aber Cutty ist easy, weil das macht für dich auch Zertifikats-Handling und sowas.Dann machst du ein Reverse-Proxy davor. Das sind drei Zeilen Konfig-Eintrag. Und dann macht das für dich Zertifikat und Reverse-Proxy auf deine Web-Anwendung. Nein. Können wir nicht. Können wir nicht.Es gibt Sachen, die will ich schon alleine nicht machen. Aber zusammen, zusammen wäre glaube ich, also Windows Server und C++, also viel schlimmer geht es ja kaum noch. Ok, also Web Server installieren. Was will der von mir? Kann man eigentlich Dark Mode anmachen?Themes and Related. Kann man Windows Server unterwegs in Dark Theme machen?Geht das? High Contrast?Ok, das sieht kacke aus.Wait a minute. Warum ist das nicht unter Themes? Warum ist das unter Colors? Das fällt mir ja jetzt erst auf. Überall anders ist das Dark Light Theme und unter Windows in Themes was anderes und Colors. What the fuck?Ok, nein das geht nicht. Die Windows Anwendungen sind nicht agil genug. Die können kein Dark Theme.Da sieht man was für krass zusammengestückelter Kram. Das ist der Wahnsinn. Ok, also was will das denn von mir?Natürlich hat das was. Selbstverständlich. Möchte mir Windows in irgendeiner Art und Weise unterstellen. Ich hätte kein gutes Passwort.Das ist das beste Passwort. Best Practice Passwort. Ok, wir können jetzt folgendes machen.Nein, ich will keine Rollback. Ich glaube an der Stelle mache ich mal einen Snapshot.Was soll mir dieser Snapshot Name sagen? Huge? Was? Chrome? Das soll Chrome heißen.Huge Chrome Install. Aber selber auswartet er. Den Snapshot muss ich löschen. Das frisst total viel Disk.Huge Chrome Install muss ich löschen. Der zweite Punkt ist nur für VDI Zeugs.Das hätte ich nicht gedacht, dass es so lange dauert. Ja, Virtual Box ist Paying Champ. Ganz ehrlich, wenn man gerade auf dem Desktop viele VMs handelt, lohnt sich Forever Workstation wirklich.Und es kostet dem Key Shop ja auch nicht so viel. Wie viel kostet Server 22? Ich habe ehrlich gesagt keine Ahnung. Wir können mal gucken. Windows Server 2019. Standard. Das kostet so eine Lizenz.150 kriegt man bestimmt deutlich billiger bei irgendwelchen Key Shops. Ihr könnt euch eure Forever Keys holen wo ihr wollt solange sie nicht bei mir aus dem Chat holen.Direkt Timeout wenn ich irgendjemand Keys postet. Aber wie gesagt, Forever Workstation auf dem Desktop ist schon das beste was du malen kannst.Wieso benutzt man Windows Server? Ja das frage ich mich auch. Residenz Leaper. Wir werden gleich feststellen wie man eine statische HTML Seite hostet.Ich sehe jetzt schon kommen, dass es richtig Pains Champ wird.Ja das ist natürlich auch ein guter Punkt. Wenn man dafür Geld bekommt für Windows Server, dann warum sollte man nicht Windows Server nehmen?Ich meine ich würde selbst für Geld kein Windows Server administrieren. Das stimmt nicht. Es kommt natürlich auf die Menge des Geldes an.Aber wenn mich einer als unerfahrenen Nullplan Windows Admin einstellen will für das doppelte von dem was wir jetzt verdienen, dann würde ich das machen.Aber wahrscheinlich nicht lang, denn Windows ist so Pains Champig.Ja ich wollte gerade sagen, die sollen wir einfach. Jetzt mach hin vor MWR. Komm hopp hopp.Ach guck mal das Fenster geht schnell, das andere nicht.2018 doch viel zu modern. Also wenn schon richtig alt. Was ist denn das erste Windows Server was es gab? NT? NT 3.1 oder sowas?Oder NT 3.5? Was sind das erste Server Windows was es gegeben hat?Also bei uns ist 2003 das älteste. Das stimmt, das stimmt. Was älteres habe ich bei uns auf der Arbeit auch noch nicht gesehen.Windows 2000 Server. Ja ab dann, ich glaube ab da heißen die Windows Server. Aber im Prinzip war es ja schon seit NT so.NT 3.1 Advanced Server, das kann sein ja. Advanced Server bitteschön. Advanced.Ne das weiß ich von damals nicht. Ich hatte damals mit Windows Server überhaupt nichts am Hut.Also wir haben keine 2003 Server mehr. Also sagen unsere Windows Leute, vielleicht sagen sie es auch nur offiziell, dass Security Leute nicht amok laufen.Ich glaube das älteste was wir haben mittlerweile ist 2000. Es könnte dann auch 2008 ergibt. Aber ich glaube das meiste ist 2012.Was gibt es denn? Wie war die Windows Server Reihenfolge? 2008, 2012, 2016 und jetzt 2022. Oder gab es noch was zwischen 2016 und?Ach 2019 gab es noch. Okay. Meine Güte VMWare. Komm lass mich mal nicht so bitten. Ich meine du bist auf einer SSD. Auf einer NVMe SSD. Hast 8 CPU Kerne. Mach mal.Ne 6 CPU Kerne. Stimmt gar nicht. Viel Slack man. Genau.Ist das eigentlich bei Windows 2012? Weil du sagst es ist wie Windows 8. Haben die da auch ein Kachelmenü auf dem Server? Ernsthaft? Wirklich? Also ist das so?Wenn du 2012 Server installierst hast du da ein Kachelmenü wenn du Windows. Ja wirklich?Das ist ja Fail. Okay endlich. Okay. Web Server. Server from Pool. Jawoll. Den hier. Hui. Hui. Was kann man da alles inszenen?DNS, DHCP, Fax. Ganz wichtig. Gerade für deutsche Behörden. Die haben wahrscheinlich noch die größte Anzahl an Fax Server am Start.EES. Include Management. Jawoll. Okay was haben wir sonst noch? Remote Desktop Services. Network. File and Storage. Okay next.Wie muss ich dort net framework installieren? Ist da EES? WCF Alter. Das gibt es das überhaupt noch?Dazu kann ich nur sagen. WCF das ist doch irgendein XML basiertes Kommunikations-API Zeugs von sonst wann.Ich weiß gar nicht mehr genau was es ist. Irgendwas XML basiertes auf jeden Fall. Kann ich euch ernst sein?Okay was brauche ich hier für normales Hosten von statischen Webseiten?Gar nichts. Einfach Next. Bam.Hier. Genau das will ich. Okay es wird noch advanceder. Common HTTP Features. Das brauche ich.Request File. Gibt es eigentlich irgendeinen sinnvollen Grund EES zu verwenden? Jetzt ernst. Kein Microsoft Page. Gibt es einen sinnvollen Grund?Wenn ich eine ASP.NET Web Anwendung habe dann hat die einen eigenen Web Server dabei.Und für alles andere kann ich doch unter Windows auch irgendeinen ordentlichen Web Server installieren oder? Ah für FTP. Gibt es Engine X für Windows?Also Apache gibt es definitiv für Windows. Gibt es einen Engine X für Windows?Okay sieht äußerst gepflegt aus die Seite.Also wenn ich, wisst ihr was ich machen würde? Wenn ich unter Windows den Web Server laufen lassen müsste, dann würde ich WSL installieren und dort mir den Web Server drauf machen.Okay. Next. Install. Auf gehts. Gib mir EES. Gap her.Was macht der da eigentlich so lang?Was macht der da eigentlich so lang?Aber sagen wir so Anzeigen was er macht habe ich jetzt schon gelernt scheint prinzipiell overrated zu sein. Successful. Okay.Aber wohl doch noch nicht ganz successful.Oder muss ich auf Close drücken?Muss ich auf Close drücken?Services. So und jetzt ist die große Frage wie verwalte ich EES hier da drüber?Oh das sieht ja mal. Oh sieht das advanced aus. Windows XP Zeiten. Perfekt. Endlich mal was was mir optisch gefällt.Geht das da rüber oder kann man auch hier ach ne hier ist auch EES drinne guck mal.Aber warum gibt es da zwei Sachen jetzt?Boah das ist so fummelig alles. So krass fummelig.Kann man hier drüber was machen oder sind das nur Logs?Das hier sind nur Logs ne da kann man nichts machen. Manage.Kann man die Tools hier drüber aufmachen? Hier.Okay das ist wirklich das richtige Tool was ich hier hab.Das ist ja hier sind ja die verschiedenen Zeiten von Windows noch deutlicher sichtbar als auf dem Desktop.Auf dem Desktop hast du ja schon aus 20, 30 Jahren Windows alles drinne.Aber das Ding hier schießt jetzt ja nochmal den Vogel ab. Ich mein das ist wirklich straight aus Windows XP hier oben.Das siehst du an dem grünen Flech das ist straight aus Windows XP.Was ich nicht schlecht finde.Application Pool Sites. Default Website. Wo muss ich die hinkopieren?Unter Linux wäre es war www.html oder zumindest unter Ubuntu und Demian.Nichts sagen Chat. Explore. Guck mal hier Explore.Inetpupp. www.route. Okay das heißt wenn ich jetzt Local Host mache.Local Host.Es läuft Leute. Okay kann ich dies auch extern auflösen? Also hier 1221682.133.Massive.Wo komme ich denn da jetzt raus?Ich meine schöne Startseite ist es nicht. Aber immer noch nicht so shab wie die Caddy Default Seite.Kennt ihr mal die Caddy Default Page? Die ist wirklich schräg.Im wahrsten Sinne des Wortes. So sieht die Caddy Default Seite aus. Die ist absichtlich schräg.Okay wir haben jetzt hier IES am Start. So das heißt wenn ich da.Moment Moment. Wo ist denn überhaupt die Seite die ausgeliefert wird?Ist die das?Erstmal Paint als Image. Das ist die. Aber warum heißt die IES Start und nicht Index?Woher weiß der dass er das bei einem Index aufmachen soll? Ist das hier irgendwie in der Default Seite konfiguriert?Ah weil es nur eine Seite gibt. Das heißt wenn nur eine Seite drin liegt dann nimmt er immer die.Solange kein Index drin ist. Okay das probieren wir jetzt mal aus. Index HTML. Copy.Tatsächlich. Big Brain Windows.Da sind wir.Okay das war muss ich zugeben einfacher als ich gedacht habe.Zwar immer noch ein bisschen Paint Champing aber jetzt kann man wahrscheinlich löschen den Kram hier. Hallo? Löschen?Hallo? Löschen?Entf. Entf gibt es nicht. Delete. Okay. Entf ist Disabled in der unteren Windows Server.Okay wunderbar. Das ging jetzt echt einfacher als ich gedacht habe muss ich sagen.Kann IES Let's Encrypt Zertifikate? Das muss ich jetzt nachgucken. IES Let's Encrypt bestimmt nicht oder?Also ich mein selbstständig auswählen. Selbstständig ausstellen.Dass man die irgendwo hin kopieren kann und nicht out of the box. Okay das war klar.Installieren eines Zertifikats IES. Ja.Das mache ich jetzt nicht. Das mache ich jetzt nicht.Okay ich soll mal einen Virtual Host anlegen. Probieren wir mal aus. Hier. Add Website wahrscheinlich. Switch to Content View. Was passiert da?Switch to Feature View? Hä?Was ist da jetzt der Unterschied?Also hä? Das stimmt doch überhaupt nicht Microsoft. Das stimmt doch überhaupt nicht.Ah ah F5. F5 muss man drücken. Okay. Okay neue Seite. Add Website.Sidename. Genau. Hackw.local. Da muss ich halt Hausdatei überschreiben.Es gibt Third-Party Zeug für den Web Server welcher Let's Encrypt kann. Ja du kannst Third-Port oder sowas nehmen.Pass-Throughout. Naja das ist doch halbwegs überschaubar. Es sieht zwar aus wie von 1995 aber es funktioniert.Gibst den Domain Namen ein. Dann sagst du wo die Dateien liegen.Connect As. Was auch immer. Und dann an welchem Interface er binden soll.Ja das klingt doch irgendwie nachvollziehbar alles. Nur das Interface ist wirklich straight aus Windows XP.Aber wenigstens verwenden sie nicht mehr diese komische eingebaute Windows Hilfe.So naja ihr habt es auch gesehen die Seite ist von 2012 hier guckt. So 2012.Nicht mehr diese komische eingebaute Windows Hilfe. Wobei. Wait a minute.Ne ne machen sie tatsächlich nicht. Alles klar okay. Das war wirklich einfacher als ich gedacht hab.Was diese Übersicht jetzt bringen soll verstehe ich nicht. Ich glaube das ist so eine Art Logs. Log Ausgabe oder so.Kann ich jetzt nicht wirklich was rein interpretieren.Okay was haben wir denn als nächstes. Kann man WSL installieren. Das interessiert mich jetzt noch.Kann ich sagen WSL minus minus install. Wie das geht. Einfach so.Einfach so. Okay das ist neu. Das ging garantiert noch nicht unter Windows 2019.Und jetzt WDS aufsetzen. Was ist WDS. Windows Desktop Service. Geraten.Das ersten Sachen die ich mir den Buchstaben lieber einfallen. So.Chubantu ist drauf. Wie starte ich denn das jetzt Ubuntu.Reboot. Na natürlich. Ups. Wie rebootet man eigentlich von der von der Konsole bei Windows.Moment mal. Ich weiß es. Shutdown. Ne. Doch Shutdown. Ach Tab Completion.Ich kacke. Natürlich gibt es keine Tab Completion. Was. Wir sind ja unter Windows.Warte mal. Powershell. Powershell Tab Completion. Shutdown. Oder was. Stop. Computer.Gibt es auch Restart Computer. Guck mal da. Big Brain Windows Time.Massive Sixhead. Powershell Beste. Naja Beste würde ich nicht sagen.Powershell finde ich. Meine persönliche Meinung ist Powershell ist eine superScripting und Automatisierung Sprache Umgebung aber keine wirklich angenehme interaktive Shell.Ja es riecht ganz gut. Man kann ja Powershell mittlerweile auch unter Linux installieren.Ich kenne niemand der das macht. Aber es geht. Gut ich meine man kann Microsoft SQLmittlerweile auch unter Linux installieren. Ich kenne auch niemand der das macht.Kennt ihr jemand der das macht. Baldios das verstehe ich. Ja. Warum ist es. Warum ist esStop Computer Restart Computer nicht Computer Stop Computer Restart. Das ist richtigbescheuert weil so könnte man mit Computer und Tab Tab sich lang hangeln wenn man dieanderen Befehle nicht weiß. Ja es ist richtig hängen geblieben dass das Restart Computerund Stop Computer ist anstatt Computer Restart.Ups. Powershell ist immer Verb Noun dann ist Powershell immer Low Brain. Was hat denn der.Was kann man da sonst so auswählen. Oh ne das war zu schnell. Ich war. Ich war ich habezu schnell geklickt. Da kann man nicht erwarten dass es geht. Passwort ist zu schwer.Ne ne Domäne aufsetzen mache ich jetzt gar garantiert nicht. Das ist auch was ganz ehrlichdas würde ich im Leben nicht machen. Also da müssten sie mir wirklich sehr sehr sehrviel Geld bezahlen dass ich Windows AD administrieren würde freiwillig. Also würden sie nichtweil ich keine Ahnung davon habe.Vsus sus. Vsus ist Windows Update Service oder. Lokales lokales Update Zeug. Das sagt mirzumindest vom Name her was. Broken by Default. Du weißt Broken by Design. Ja das scheintmir hier einiges zu sein. Installing. This take a few minutes. Ja dann take immer a fewminutes. Das triggert mich auch warum warum warum refrecht sich das hier im Hintergrundnicht. Ah jetzt ist wirklich broken. Jetzt ist wirklich irgendwas kaputt. Also EnterName. Max. Oops. Big Plane Passwort. Passwort. Try again yes. Zu schweres Passwort. Ok WSLgedürnt läuft wenigstens ordentlich. Ich habe mir sagen lassen das Windows mittlerweileein SSH Server mitbringt. Kann das sein oder bringe ich das durcheinander oder was einSSH Client in Windows mitbringt. Add roles features. Installation Type. Yes. Ja wir installierenjetzt den SSH Server. Features. SSH. Wo ist der denn. Secure Shell oder so. Open SSH.Mit O gibt es hier gar nichts. Was Einstellungen Apps. Was das ist in den Windows. Moment jetztmeine Settings sind kaputt. Meine Settings sind irgendwie broken. SSH. Nee. Was. Ok Leutejetzt müsst ihr mir genau erklären. Add remove features. Da drüber. Features. Das da. Dasda meint ihr. Optional Features. Optional Features. SSH. Nee Client. Client. Add Features. SSH.Jetzt nicht ernsthaft oder. Warum ist das hier nicht in einem Server Feature Selector.Warum ist das da. Hä. Wer hat sich. Welcher Big Brain Mensch bei Microsoft hat sich dasdenn ausgedacht. Also konsistent ist das ja nun wirklich gar nicht. Kannst du mal RemoteDesktop Dienste installieren und dann mal checken ob der Webclient mittlerweile unterLinux läuft. Ja kann ich machen. Wenn du mir sagst wo das. Wo das. Wo das geht. Ach dasist ein Windows 10 Feature. Ok das ist wirklich riesen Flickenteppich das Teil. Remote DesktopDienste installieren und dann mal checken ob der Webclient mittlerweile auf Linux läuft.Ok wie mache ich das jetzt. Sag ich dann hier Remote Desktop Services Installation. Dasweiß ich ob ich das machen will. Das ist bestimmt zu zu Big Brain für mich. Das kanner sich einfach so machen. Oh Leute Leute der Chat ist wieder. Der Chat ist wieder massivedabei. Der Chat. Windows. Pass auf hier. Windows. Capability. Online. Name. Ich weiß nichtwas ich da mache aber ich sag einfach der Chat. Name. Open. SSH. Punkt. Server. TildeTilde Tilde Tilde 0010. Ne warum. Das muss auch so funktionieren. XOXOXO. Es scheintzu installieren. Dieser Fortschrittsball ist richtig advanced. Online True. Restart neededcontrols. Und das läuft das jetzt. Haben wir sowas wie ein Netzstat. Sehe ich da. Seheich da. Sehe ich da. SSH. Ach du Scheiße. Wie ist denn das richtige. AN. Läuft dannSSH. Das ist bestimmt ein Service den man starten muss. Warum schaust du dir sowas an.Das. Ich weiß. Gute Frage. Nächste Frage hier. Starten. Open SSH Server. Haben wirden richtig echten Windows SSH Server laufen. 22 tatsächlich. Ok. Gleich mal testen obdas funktioniert. Poggers VM starten. Testen wir mal. Massive Windows SSH und da guckenwir da drüber dann WSL gestartet kriegen. Zaubern wir mal. Ich meine damit hat man zumindestdie Chance seinen Windows Server ordentlich remote zu administrieren. Das ist doch eigentlichist doch eigentlich eine gute gute Sache. SSH 1 2 1 2 1 2 1 3 3. Bäm. Yes. Nicht Max.Da muss man bestimmt mal. Ad. Ministrator. Ad. Alle AD Sachen gehen da drüber. Na wahrscheinlichsobald du GUI klicken musst geht nicht. Hey guck mal da. Kann ich jetzt WSL starten.Guck mal hier. SSH Windows Server und jetzt WSL gestartet. Wobei das halt total hängengeblieben ist. Ich könnte mich einfach. Ich könnte einfach ein SSH Server auf Linux installierenoder. Doch ich glaube AD gibt ziemlich vieles was nur über GUI oder PowerShell. PowerShellwahrscheinlich. Wahnsinn. Das heißt ich kann jetzt remote sagen. Restart Computer. Achnee Moment. Geht Reboot in WSL. Nee. Als als Hut. Nee das geht nicht. Shutdown. Exit.Was. Kann ich da drüber jetzt PowerShell starten. Das ist jetzt das ist jetzt Shell ShellShell Saption Alda. Das würde jetzt funktionieren Restart tatsächlich. Aber da kann man sichdann mal ausloggen. Aber aber sag mal so den den den eingebauten SSH Server in Windowsbraucht doch eigentlich niemand. Ich kann doch einfach hier unter unter WSL. Könnte docheinfach sagen unter WSL. Update. Und ein SSH installieren. Wenn du das installierst kannstdu SSH FS mounten. Ich kann auch so SSH FS mounten oder. Von Linux aus. Da braucht manja nichts zusätzlich installiert. Normalerweise. Egal. Ich muss jetzt Windows Sachen machen.Nicht zu viele Linux Sachen. Linux Sachen machen wir sonst immer. So mal gucken ob ichbig brain genug bin das hier zu reverten was wir eben gemacht haben. Add Windows Capability.Da würde ich jetzt einfach mal sagen wir machen remove Windows Capability. Wie dasgeht einfach. Aber jetzt muss ich jetzt muss ich neu starten. Warum muss ich warum mussich neu starten. Restart Computer. Ich meine ich habe den SSH installiert und deinstalliert.Das ist schon mal ein Restart Grund. Wenn der Service noch läuft dann soll er das schreibenoder er soll den Service stoppen meinetwegen. Braucht bestimmt Kernel Module. Auch guckmal er macht Updates. Oder irgendwas im Hintergrund. Getting Windows ready. Also jetzt erstmalUpdates runter geladen. Obwohl er vorher gesagt hat es gibt keine Updates mehr. Restarting.Kann man in WSL eigentlich auch ein Kernel Panic erzeugen. Bestimmt irgendwie aber vomrein her sollte das ja nicht gehen weil es eine VM ist. Ja das lief wirklich besserals erwartet. Das heißt aber ja nichts. Besser als erwartet. Wenn es die Kategorie bei denOlympischen Spielen gegeben hätte da wäre ich auch angetreten. Dann hätte ich in derKategorie besser als erwartet gewonnen. So guck mal mein Server ist zum ersten mal allesgrün. Ich habe gelesen wir haben historisch schlecht abgeschnitten im Medaillenspiegel.Nicht dass mich das großartig interessieren würde. Was gerade von den Olympischen Spielenhatten. Wir schneiden auch nicht in anderen Sachen gerade historisch schlecht ab. Ok InternetAusbau ist nicht historisch schlecht. Der ist schon immer schlecht. Da gibt es gar keineSpiele wo das mal besser war. Der war schon immer schlecht. Also ich habe so gut wie keinenOlympia geguckt. Ich habe letztens mal den Livestream angemacht und da war irgendwiekeine Ahnung 40 Kilometer gehen oder sowas. Und das sieht ja schon lustig aus wie diegehen. Also das wird ganz schön geeiert. Ich weiß nicht wie ich das sonst beschreibensoll. Also ich habe zwei Sachen mitbekommen bei Olympia. Ich habe mitbekommen das mitden Kameltreibern. Da ist man nicht drumherum gekommen gerade wenn man auf Twitter ist.Und dass irgendwie einer oder eine hat irgendwie das Pferd geschlagen oder sowas. Das habeich aber auch nur am Rande mitbekommen. Ich finde es erstaunlich was für ein Flickenteppichich bin aus 10 und WS 2022. Ja war zu erwarten. Ich gucke jetzt mal ob ich den SSH hier unterUbuntu installieren kann und dass das einfach funktioniert. Ab install Open SSH Server.Okay also was TLDR in einem Wettkampf bekommt man ein random Pferd. Ich dachte man reitetdas Pferd mit dem man trainiert hat. Man bekommt ein random Pferd. Hä nee. Warum sollte manein random Pferd bekommen? Random? Wirklich? Ah in modernem 5 Kampf nicht. Aber weil normalerweisetrainieren die doch mit ihren... Ah okay. Das Vieh hat nicht so gemacht wie der Reiterhaut dem Vieh auf den Arsch. Gut je nachdem wie dem Vieh auf den Arsch gehauen wird. Ichmeine es gibt andere Leute die stehen drauf auf den Arsch gehauen zu bekommen. Das Viehwahrscheinlich nicht aber wenn das im Rahmen der normalen Umgang. Das kann ich jetzt alsnicht Pferdebesitzer nicht Pferddrehern nicht beurteilen. Ich kenne die Szene nicht. Weißich nicht was da gewesen ist. Das war die Debatte okay. Ich kenne dich noch von CommanderKriegerFruhr. Dein Logo ist immer noch dasselbe. Ja. Kannst du auf Schluss vom Stream rm-f noPreserveRoute in WSL machen? Ja kann ich machen. Da wird aber halt einfach WSL kaputt gehenwahrscheinlich unter Windows. Hoffe ich mal nichts. So also System CTL Start SSHD Bam.Ach ne das geht ja nicht. Wie starte ich denn unter WSL sowas? Service. Start SSHD. OderSSHD Start. Ich meine ich kann es so ausführen. Okay ich habe keine Ahnung wie ich das unterWSL mache wenn ich ehrlich bin. That's that. Up install net tools. In a day ne oder? Nichtwirklich. Wie starten wir denn hier Dinger? Die Dienstunter WSL habe ich schon nie gemacht.Fällt mir jetzt gerade aus. Ist das Open SSH? Ne. SSHD ist richtig. Service SSH. Das SSHStart. Ah. Das System CTL auch funktioniert? Ne. Ah Service geht okay. So das heißt wennich da jetzt mich nochmal versuche darauf zu connecten dann geht das nicht. Warum nicht?Weil WSL keinen Netzwerk Zugriff hat von außen. Kann das sein? Oder ist da Firewall an? AhWindows Windows Firewall stellt. Aha. Was macht UFW? Status Inactive. Firewall Windows.Haben die ein gescheites Firewall GUI jetzt? Ja. Oh jetzt muss er Windows Firewall Freischaltungmachen. Excellent. Inbound Rules. Das sieht auch aus wie bei Windows XP. Das ist so einzusammengestöckeltes Teil alter. Meine Güte. Gerade Firewall Setting auf dem Server hätteich irgendwas ordentliches erwartet. Was ist denn das? Okay. New Rule. What? 22. ErlowAll Connection. Ja ja. SSH. Finish. Geht das jetzt? Ah nice. Oh ich kanns mir immer nichtmerken. SSH. Keygen. Minus R. Ich editiere sonst immer die Datei direkt. Ich glaube SSHKeygen minus R ist das. Yes. Oh Permission Denied. Aber es ist ja auch nicht Administratorsondern Max. Keine Passwort Authentifizierung. Kegwayt. Gibs nicht. File. ETC. SSH. SSHD.Config. Passwort. Passwort Authentification. No. Doch. Wollen wir. Soll das denn hier?Yes. Finde mich nicht ob man das braucht. Service. Restart. Okay darf ich jetzt? Ups.Muss ich hier oben drüber switchen. Darf ich jetzt? Hey. 1 2 3 4 5 6. Bam und wir sindnicht drauf. Doch. Zack. Okay. Direkt WSL SSH. Jetzt stellt sich mir die Frage. Was istder Windows-Seggerer Weg ein SSH Server auf Windows zu bekommen? Diesen komischen OpenSSH über Features was ja eigentlich ein Windows 10 Feature ist und man weiß wie alt das istoder man sagt WSL oder aber man sagt gar nichts macht gefälligt RDP und klicke allesdurch. Was ist das Windows-Seggerer Vorgehen? Horscher. Guck mal ich hab ich hab kein Autowarum hab ich da jetzt kein Auto Complete vorher ging das mit Auto Complete. Ich habda gar kein Auto Complete. Doch. Aber Power Off kann ich machen. Bam. Das geht natürlichnicht. MMC. Vorher ging das jetzt geht es nicht. Also ist es SSH über Windows schon mal besserEinfach VNC. Nee VNC da kann ich auch RDP zu euch installieren. Nee das geht da nicht.Hier hat man jetzt wirklich bloß Zugriff auf die Ubuntu Geschichten und nicht mehr aufWindows Sachen. Selbst das hier geht jetzt nicht. Aber jetzt oh jetzt muss ich mal wasmachen. Geht X-Forwarding da drüber. Abinstall Firefox. Moment das muss ich jetzt ausprobieren.Geht X-Forwarding da drüber. Das müsste WSL. Ich hoffe das ist WSL 2. Wie sieht man dasWSL minus minus Version. WSL. WSL minus L minus V. Eins. Paints Champ die liefern auchstandardmäßig eins aus. Warum? Da muss ich mir dieses komische Upgrade geduld machenübers Internet. Da musst du dir irgendwelche Kern Updates runterladen und so das funktioniert.Das ist ja noch WSL 1. Warum liefern die da noch WSL 1 aus? Verstehe nicht. Und es istlangsam was zu installieren. Guck mal wie langsam das ist. File System Access ist schneller?Ja aber das kann ja nicht der Grund sein. WSL 1 ist ja dead. Microsoft setzt ja vollauf WSL 2. Gibt es überhaupt noch Updates für WSL 1? Lustigerweise WSL 1 ist quasi sowasrewind unter Windows für Linux. Also sowas rewind unter Linux für Windows ist, ist WSL1 sowas quasi unter Windows für Linux. Also eine Zwischenschicht die Kernlaufrufe umtranslated. Nur dass es deutlich einfacher sein müsste sowas für Windows zu programmierenweil man weiß wie Linux funktioniert als umgedreht. Und WSL 2 ist einfach nur eineHyper-V4M. So jetzt bin ich mal gespannt. Kann ich X-Forwarding machen über WSL? Firefox.Geht. Bam. Firefox am Start. Oder zumindest mein lokaler Firefox. Warum geht mein lokalerFirefox? Ich bin verwirrt. Der Firefox kommt damit irgendwie nicht klar. Erstmal alleszu machen. Leute ich hab's gebraked. Ich hab's irgendwie kaputt gemacht. Oh ist esgrip? Hab ich kaputt gemacht? Hat sich das neu gestartet? Ist der, ist der gecrasht?Ist der gerade gecrasht? Wir haben es nicht gesehen. Oder hat er sich ausgelockt? Waita minute. Der ist gecrasht? Der ist ge-, der ist gecrasht? Okay Moment Leute. Das mussich jetzt nochmal ausprobieren. Das, das muss nochmal ausprobiert werden jetzt. Sack, Sack.Der ist gecrasht. Das kann der mit noch, ist aber gut. Okay, okay. Service. Open SSHStart. 1256. Firefox. Jetzt crasht er nicht mehr. Und jetzt hab ich, jetzt hab ich den,ups, ich hab das falsche, ich hab das falsche Fenster. So, jetzt hab ich den Firefox, denFirefox laufen. Oh das ist jetzt aber richtig big brain. Oh. Just updated. What, what ishappening? Was? Das ist nicht mein Lokaler Firefox. Hä? Das ist doch mein Lokaler Firefox.Was zum? Okay, ich glaube das ganze kommt damit nicht klar. Das versucht das, das versuchtdas irgendwie weiter zu leiten und statt dann, es läuft gar nicht remote, sondern es istmein Lokaler Firefox. Nee, nee, nee, es ist nicht mein Lokaler Firefox. Das war der remoteFirefox. Das ist mein Lokaler Firefox. Da hab ich auch hier Home Assistant Verlinkungenund so drauf. Okay, das ist der remote Firefox. So. Okay. Alles klar. Okay, das ist der remoteFirefox. Ich glaube das Ding ist einfach broken über x forwarding. Glaubt das funktionierteinfach nicht. So, Chrome unter Ubuntu geht ja nicht, weil Ubuntu der Meinung ist, Chromeist jetzt ein Snap. Was gibt's denn? Kennt ihr mal noch einen alternativen Browser unterUbuntu, der mitgeliefert wird? Aber gut, wenn Firefox nicht geht, dann geht der Rest auchnicht. Das Ding ist broken. Das Ding ist, das Ding ist broken über x forwarding. Das funktioniertnicht. Midori Browser. Stimmt, das könnten wir echt mal gucken. Tatsächlich gibt es.Okay, erst mal das halbe Internet nachinstallieren. Nee, nee, Windows ist nicht abgeschissen.Warum ist denn eben Windows gecrashed? Kann sich das jemand sinnvoll erklären? Ich habja nichts gemacht. Das ist übrigens was, was in WSL 2 auf jeden Fall nicht funktionierensollte, weil Windows WSL 2 in der VM ist. Gibt es da einen Lok? Das ist eine gute Frage.Können wir jetzt mal ausprobieren. Event Lock heißt das. Event Viewer. Das ist auch so einFummelprogramm. Meine Güte. Sieht jetzt aus wie Windows Vista. Windows ist so krassfummelig. Okay, was könnte es denn sein? System. System. Und jetzt nach der Uhrzeit,also hier irgendwie. Error. Bug Check. Computer has rebooted from a bug check. Hä? Bug Checkwas. Ah, alles klar. Jetzt müssen wir mal Bescheid. Das war ein Blue Screen. Computerhas rebooted from a. Also man kann jetzt mal ernsthaft, man kann ein Windows 2020 Servercrashen in dem man WSL installiert und Firefox per X Forwarding aufbauen. Ich gebe zu, esist kein Anwendungsgebiet, was irgendwie realistisch den Admin verwenden wird. Es sollte, es sollteden Windows Server nicht crashen. Das hat noch mit Preview nichts zu tun. Das ist irgendeinWSL 1 Fehler. Da ist wahrscheinlich überall so. Nice. So, das andere. Aber das ist auchlangsam hier über WSL Zeug zu installieren. Lad dir Blue Screen Viewer. Okay, okay. Leute,jetzt kommen die, jetzt kommen die super advanced Windows Geschichten. Blue Screen Viewer. Natürlichgut, dass Edge drauf ist. Blue Screen Viewer. Von Heise. Okay, die sind übrigens halbwegsvertrauenswürdig zum. Nein. Jaja, ich werde nie wieder ein Heise Plus Abo abschließen,nachdem die mich einmal so debatet haben. Zip. Oh, jetzt haben wir es doppelt. So. Nein.Ah, noch mal. Gehst sofort. Okay, Blue Screen Viewer. Exzellentes Icon. Hier, hier, hiersieht man es jetzt. Beziehungsweise, was sehe ich da eigentlich? Was bin ich da sehend?Was? NTOS Colonel. Wahrscheinlich wirklich eine WSL Geschichte. Wahrscheinlich irgendeineWSL Geschichte. Ach, deswegen ist WSL 2 schneller, okay. Tja. Wahrscheinlich irgendeine WSL Sache.Das hier ist ja mehr als nichts, sagt. Das ist garantiert irgendeine WSL, weil das istja, das ist ja, WSL ist ja irgendein Colonel-Module quasi unter, unter Windows. Ach, hier obenist immer noch gecrashed. So, okay, jetzt probieren wir den anderen Browser noch malaus. Was war mit Heise und debatet? Ich wollte mir bei Heise einen Artikel durchlesen, irgendwelcheaktuellen Gehaltsdinger, weil die haben da immer so eine, so eine Übersicht. Dann habeich mich angemeldet, weil die, also ne, da haben die gesagt, es geht plus mit Heise Plus,dann hab ich mich mit Heise Plus angemeldet, hab ich mir gesagt, gut, Monat kannst du jamal gönnen, und das ist für CT Abonnenten auch für, glaub, ein halbes Jahr oder sokostenlos, oder einen Monat kostenlos, hab ich mich angemeldet, und dann haben die ohneScheiße ne Woche gebraucht, ne Woche, bis die mich freigeschaltet haben, bis dahin wollteich den Artikel gar nicht mehr lesen, und ich hatte in meinem Benutzerprofil nicht dieMöglichkeit, Heise Plus zu kündigen. Und da bin ich von ausgegangen, Heise Plus läufteinfach aus, weil es stand auch nirgendwo, dass sich das verlängert, und auf einmalnach einem Monat heißt es hier, ich hab jetzt keine Ahnung, irgendwie den Jahr Heise PlusAbo am Start, und da kam ich mir echt geblendet vor, und ich hab die dann angeschrieben, aberda muss man sagen, fairer halber, nach einer Woche oder zwei Wochen Reaktionszeit, habendie das ganze aus dem Account geschmissen und wieder storniert. Das muss man ihnenzugute halten. Oh, oh, guck mal, Browser geht, Google, jawoll, Firefox geht nicht, Midorigeht, auf was basiert denn das, ist das Chrome, oder ist das Webkit, bestimmt nur OldschoolWebkit oder so, sieht auch sehr Gnome-mäßig aus, References, About, auf was basiert denndas Webkit, bis 2018, das ist ja Massive aktuell, warum sollte man sowas denn benutzen,gucken wir mal, lassen wir uns das ganze, also dieser Browser läuft jetzt auf meinem WindowsServer, Chromium, das ist doch gut, du musst den Qt Browser nehmen, ja, haben die den,oh ne, oh, wir haben's gecrashed, wir haben's gecrashed, bam, rip, also gut crashen kann'sauf jeden Fall, ein nicer Crash, nicht genug RAM, ne, ein aktuelles Betriebssystem solltenicht von zu wenig RAM crashen, erstens haben wir 8G RAM, gut ist jetzt nicht viel, abertrotzdem, der soll noch swappen auf die Festplatte, wir haben's geschafft, wir haben's gecrashed,das ist garantiert ein WSL Fehler, das ist garantiert ein WSL Fehler, das ist ein KernelFehler, nice, ok, ich würd sagen mein Targesoll ist erfüllt, wir haben's geschafft Windowszu crashen, easy, Any% das müsste ich eigentlich hochladen, Windows Server 2022 Blue Screen,Speedrun Any%, Windows, ok, das mach ich jetzt noch, das mach ich jetzt noch, als root, so,also sudo, em-ef slash, was ist das dann, no preserve root und was sonst noch, verstanden,hat man sonst noch was, nix Feuer, bam, Moment, fuck, der geht in die Mounts rein, lul, derzerstört Windows komplett, das ist Fail, ich dachte der geht nicht, der geht wenigstensüber die Mounts drüber, aber ok, geh jetzt vorbei, aber Permission Denial for System32 Leute, er kann nicht alles löschen, er hat ja keine Adminrechte, er hat keine Adminrechte,also er kann höchstens meine Sachen löschen, aber ich bin ja Admin, hä, wie in dem Moment,weiß ich, ich bin Admin, aber hab keine Adminrechte unter WSL, also mal gucken was jetzt passiert,ich hab wirklich keine Vorstellung davon, die Eiken sind alle weg, ja gut, mein Heimatverzeichnisist ja auch RIP, aber ansonsten, oh, oh, oh, Leute, Leute, jetzt ist vorbei, jetzt istvorbei, ja Bash spielt ins Geh noch, ok, testen wir mal, ob SFC das fixen kann, was, SFC,ich starte jetzt neu und wir gucken, ob es das fixen kann, Restart, das ist bestimmtRIP, Restart, ich wahrscheinlich Restart jetzt schon gar nicht mehr, ah, doch, doch, doch,das bootet noch, das bootet noch, ah, ok, wir haben es geschafft, Pluscreen Loop, jetztist vorbei, jetzt ist vorbei, ok, ok, ok, ok, okay, ok, ok, ok, ok, ok, ok, ok, okay,wir haben es geschafft gibt es noch so ein recovery mode im boot manager also kann ichnoch irgendwie kann ich irgendwas drücken für boot manager oder so gibt es gibt es da waswas ist das jetzt windows boot manager ne f8 f8 war es früher ich glaube das gibt es nicht mehrkuck kuck diagnosing your pc out automatic repair blet's let's let you choose ne ne ne ne fix that keep ok restore wir sagen erstmal startuprepair na super die können da nichts machen advanced options system restore das ding istkomplett rippe das ding ist komplett rippe kannst du kannst du nichts machen versuch malused device used used device kann ich usb stick oder so mann ok leute vergesst ding ist das dingist rippe warum hat wsl rechte das zu machen na gut weil das wahrscheinlich mein wsl ist wasals admin läuft ich habe ja mal snapshot aber ziel war ja kaputt zu machen bäm wir haben esgeschafft geschafft bettgetime bettgetime ich habe winos zerstört alles gut ist der fresh an den wir hosten können zeigt mal jakomm ich holste mann in zairos was macht er denn was was macht er dennrim world habe ich mir vor zwei jahren in steam gekauft aber nie ausprobiertsemper video ist und wirklichhallo in diesem video nur ganz kurz mal gezeigt wie man semper video auf twitchhosten kann ok das war jetzt host oder raiden raiden wir raiden wir raiden rate semper video bäm erst mal semper video raiden also in diesem in diesem stream habe icheuch nur ganz kurz gezeigt wie man windows 2022 server zerstört also leute ich drücke jetzt denhouse button wir sehen uns bis zum nächsten stream die tage und mal gucken wie gut ichmorgen mit der bahn ins homeoffice durchdurchkommen bis denn zu", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "1."}, {"id": 2, "start": 2.0, "end": 4.0, "text": "2."}, {"id": 3, "start": 4.0, "end": 6.0, "text": "3."}, {"id": 4, "start": 6.0, "end": 8.0, "text": "4."}, {"id": 5, "start": 8.0, "end": 10.0, "text": "5."}, {"id": 6, "start": 10.0, "end": 12.0, "text": "6."}, {"id": 7, "start": 12.0, "end": 14.0, "text": "7."}, {"id": 8, "start": 14.0, "end": 16.0, "text": "8."}, {"id": 9, "start": 16.0, "end": 18.0, "text": "9."}, {"id": 10, "start": 18.0, "end": 20.0, "text": "10."}, {"id": 11, "start": 20.0, "end": 22.0, "text": "11."}, {"id": 12, "start": 22.0, "end": 24.0, "text": "12."}, {"id": 13, "start": 24.0, "end": 26.0, "text": "13."}, {"id": 14, "start": 26.0, "end": 28.0, "text": "14."}, {"id": 15, "start": 88.0, "end": 95.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss, tschüss, tschüss."}, {"id": 16, "start": 118.0, "end": 132.36, "text": "Leute, jetzt geht's wieder los. Ich hatte jetzt 500 Tage Homeoffice, keine Ahnung,"}, {"id": 17, "start": 132.36, "end": 138.52, "text": "geraten, aber so in dem Dreh kommt das hin und morgen gehe ich zum ersten Mal wieder auf die"}, {"id": 18, "start": 138.52, "end": 144.44, "text": "Arbeit nach Frankfurt mit der Bahn, da habe ich jetzt schon keinen Bock drauf, aber das ist nicht"}, {"id": 19, "start": 144.44, "end": 153.92, "text": "schlimm, weil ich habe gleichermaßen den letzten Tag der Woche, wo ich auf die Arbeit muss, also ich"}, {"id": 20, "start": 153.92, "end": 159.44, "text": "gehe morgen nach Frankfurt auf die Arbeit und die restliche Woche kann ich dann daheim Homeoffice"}, {"id": 21, "start": 159.44, "end": 172.96, "text": "machen wieder. Ausnahme, nein, ich habe jetzt, was jetzt dank Corona möglich ist bei uns,"}, {"id": 22, "start": 172.96, "end": 180.48, "text": "ich habe mein Arbeitszeitmodell umgestellt auf zwei oder drei Tage, mal gucken, ich hoffe,"}, {"id": 23, "start": 180.48, "end": 184.4, "text": "es läuft, ja, also was ich hoffe, ich werde wahrscheinlich eben immer drei machen,"}, {"id": 24, "start": 184.4, "end": 192.0, "text": "zwei bis drei Tage Homeoffice und einen Tag bin ich halt mal da. Vielleicht auch mal eine Woche,"}, {"id": 25, "start": 192.0, "end": 196.04, "text": "zwei und dann gar nicht oder wie auch immer, aber ich habe jetzt meine Arbeitszeit umgestellt"}, {"id": 26, "start": 196.04, "end": 204.0, "text": "auf hauptsächlich Homeoffice-Stells. Morgens geht es, es geht eigentlich so gut wie nie,"}, {"id": 27, "start": 204.0, "end": 216.0, "text": "Bahn ist immer, Bahn ist immer richtig, richtig hart der Paints-Champ. Das ist eine Sache,"}, {"id": 28, "start": 216.0, "end": 220.44, "text": "die haben wir Corona zu verdanken, man muss ja mal sagen, es ist jetzt auch nicht alles total"}, {"id": 29, "start": 220.44, "end": 227.64, "text": "kacke durch Corona gewesen. Gerade, dass viele Unternehmen jetzt mal gecheckt haben oder vorher"}, {"id": 30, "start": 227.64, "end": 235.52, "text": "musste noch, mussten die Mitarbeiter das selbst erstmal checken, was das ihnen bringt und viele"}, {"id": 31, "start": 235.52, "end": 243.36, "text": "Leute haben gar keinen Bock mehr zu diesen täglichen Workgrind zu machen mit acht Stunden"}, {"id": 32, "start": 243.36, "end": 247.6, "text": "arbeiten und dann irgendwie noch mal eins bis zwei Stunden fahren und im Prinzip nichts vom Tag haben."}, {"id": 33, "start": 247.6, "end": 252.0, "text": "Viele Leute haben jetzt erstmal dank Corona gemerkt, wie angenehm das eigentlich ist,"}, {"id": 34, "start": 252.0, "end": 255.88, "text": "wenn man Zeit hat für Dinge, die man gerne machen will beziehungsweise auch Zeit hat sich um mehr"}, {"id": 35, "start": 255.88, "end": 271.48, "text": "Sachen zu kümmern. Aber morgen gehe ich erstmal, morgen gehe ich erstmal richtig,"}, {"id": 36, "start": 271.48, "end": 278.92, "text": "richtig Pepofet was futtern in Frankfurt, wenn ich schon mal da bin. Mein Lieblingskollege"}, {"id": 37, "start": 278.92, "end": 284.92, "text": "ist auch da morgen, da gehen wir morgen erstmal gleich eine Runde mexikanisch Pepofet machen."}, {"id": 38, "start": 284.92, "end": 297.32, "text": "Ja, es hat ja auch noch mehr Vorteile. Ich meine, wenn ich überlege, ich bin viel konzentrierter,"}, {"id": 39, "start": 297.32, "end": 301.88, "text": "mir tut der Rücken nicht weh, ich bin ausgeschlafener. Ich mache wahrscheinlich in der Zeit,"}, {"id": 40, "start": 301.88, "end": 306.92, "text": "wo ich Homeoffice mache jetzt, den habe ich mehr gemacht als davor, mir ist erst mal aufgefallen,"}, {"id": 41, "start": 306.92, "end": 315.92, "text": "wie müde ich eigentlich gewesen bin. Das habe ich jetzt erst dank eineinhalb Jahren Homeoffice"}, {"id": 42, "start": 315.92, "end": 321.44, "text": "gemerkt, wie müde ich eigentlich war die ganze Zeit auf der Arbeit. Ich bin immer erst irgendwie"}, {"id": 43, "start": 321.44, "end": 329.2, "text": "15 Uhr richtig aufgewacht, als ich dann wieder aufstehen konnte und heimfahren. Ich habe das"}, {"id": 44, "start": 329.2, "end": 336.56, "text": "nie realisiert, wie müde ich eigentlich gewesen bin. Dazu kommt, dass ich kaum Krankheitstage habe"}, {"id": 45, "start": 336.56, "end": 342.24, "text": "im Vergleich zu sonst. Also man muss ja auch mal ganz klar sagen, Homeoffice ist was, das lohnt sich"}, {"id": 46, "start": 342.24, "end": 350.16, "text": "für alle Seiten, wenn sie wollen, wenn sie wollen. Und ich bin mir sicher, oh da muss ich gleich was"}, {"id": 47, "start": 350.16, "end": 357.0, "text": "zu sagen. Und ich bin mir sicher, dass auch in vielen Bereichen, wo man das heutzutage so"}, {"id": 48, "start": 357.0, "end": 365.08, "text": "bauchgefühlsmäßig ausschließt, dass das geht. Bei Handwerkern geht das bestimmt auch. Wenn du"}, {"id": 49, "start": 365.08, "end": 370.6, "text": "Handwerker bist, du musst dich auch mal fortbilden, Rechnungen schreiben, irgendwelche Verwaltungsmachen,"}, {"id": 50, "start": 370.6, "end": 374.84, "text": "irgendwas. Da muss man mal gucken, was es für Möglichkeiten gibt. Vielleicht kann man das nicht"}, {"id": 51, "start": 374.84, "end": 380.24, "text": "jeden Tag machen, das ist klar. Vielleicht, vielleicht auch nur einmal die Woche oder zwei,"}, {"id": 52, "start": 380.24, "end": 386.12, "text": "dreimal im Monat. Mal gucken. Also wichtig ist, es müssen beide Seiten wollen, dann klappt das auch."}, {"id": 53, "start": 386.12, "end": 405.84, "text": "Echt? Ja gut, was machst du? Wahrscheinlich nicht, wie ich den ganzen Tag vorm Computer sitze. Ja,"}, {"id": 54, "start": 405.84, "end": 410.12, "text": "wie gesagt, ich habe das, naja, nee, nee, das stimmt nicht. Also eigentlich müssen wir erst ab"}, {"id": 55, "start": 410.12, "end": 414.76, "text": "erst neun wieder auf die Arbeit, aber ich habe jetzt schon meine Arbeitszeit umstellen lassen,"}, {"id": 56, "start": 414.76, "end": 422.96, "text": "habe ich gesagt, komm, bevor das dann alle wollen, mache ich das jetzt erst mal. By the way,"}, {"id": 57, "start": 422.96, "end": 426.8, "text": "ich sage gleich zu den restlichen Sachen im Chat, vielleicht sollten wir erst mal den Download"}, {"id": 58, "start": 426.8, "end": 436.2, "text": "starten. Wir machen erst mal den Windows Download an, weil ich habe es gerade so durch runtergeladen."}, {"id": 59, "start": 436.2, "end": 449.16, "text": "Was haben wir hier? Moment, ich mache jetzt ernsthaft meine Linux-VM an, um mir eine neue"}, {"id": 60, "start": 449.16, "end": 454.92, "text": "Windows-Version runterzuladen. Okay, das ist Weird Jam. Okay, wir machen das jetzt von Windows"}, {"id": 61, "start": 454.92, "end": 463.6, "text": "aus. Windows 2022 Server Download. Das ist relativ easy, man kann den ganzen Kram jetzt direkt von"}, {"id": 62, "start": 463.6, "end": 478.32, "text": "Microsoft laden. Ohne Insider. Evaluation Center, genau, was auch immer. Wir evaluieren jetzt."}, {"id": 63, "start": 478.32, "end": 487.64, "text": "Ich meine, eben hatte ich es doch hier, oder? Wie kommt man da jetzt offiziell hin? Ich finde"}, {"id": 64, "start": 487.64, "end": 492.0, "text": "diese Seiten so krass unübersichtlich, das ist echt der Wahnsinn. Wie würde ich das denn jetzt"}, {"id": 65, "start": 492.0, "end": 503.76, "text": "finden, wenn ich es wirklich finden will? Hier, Preview. Okay, 180 Tage, Download ISO,"}, {"id": 66, "start": 503.76, "end": 517.88, "text": "BAM, First Name, Cute, Chat, Company Name, Aja ja, Company Size, viele, Job Title, das stimmt"}, {"id": 67, "start": 517.88, "end": 533.72, "text": "alles nicht. Head of Shit, Cloud-Native, Agile Expert, das gibt es hier alles net. Email-Adresse,"}, {"id": 68, "start": 533.72, "end": 547.96, "text": "okay. Nein, ich darf nicht auf die Leertaste kommen. So, excellent..com, Work Number, Germany. Yes,"}, {"id": 69, "start": 547.96, "end": 556.36, "text": "Select One, Englisch, Download. Gut, und während das jetzt downloadet, was, Alter, das flutscht,"}, {"id": 70, "start": 556.36, "end": 569.92, "text": "aber. Guck mal, hier am Microsoft haben wir so ordentlichen Server am Start. Kannste dich"}, {"id": 71, "start": 569.92, "end": 579.84, "text": "nicht beschweren. 25 MB die Sekunde. So, jetzt kann ich zu den restlichen, also, was hältst du"}, {"id": 72, "start": 579.84, "end": 588.72, "text": "von Excel oder meinst du das Dateiformat XSLT? Meinst du wahrscheinlich Excel? Naja, also,"}, {"id": 73, "start": 588.72, "end": 597.24, "text": "ich muss sagen, von allen Office-Anwendungen ist Excel noch die, die ich für am, die muss ich"}, {"id": 74, "start": 597.24, "end": 605.0, "text": "anders sagen, die noch die größte Daseinsberechtigung hat. Ich meine, was ist Bestandteil von Excel?"}, {"id": 75, "start": 605.0, "end": 616.12, "text": "Word. Braucht kein Mensch. Was ist sonst noch? PowerPoint. Braucht kein Mensch. Axis. Braucht"}, {"id": 76, "start": 616.12, "end": 625.08, "text": "kein Mensch. Visio. Braucht man mittlerweile auch nicht mehr. Was ist sonst noch da? Moment mal,"}, {"id": 77, "start": 625.08, "end": 634.0, "text": "ich muss mal gucken. Was ist denn da so dabei? Hier, da. Word für den Arsch. PowerPoint für"}, {"id": 78, "start": 634.0, "end": 639.2, "text": "den Arsch. OneNote. Die Offline-Version wird immer bestimmt für den Arsch. Publisher schon immer für"}, {"id": 79, "start": 639.2, "end": 646.04, "text": "den Arsch. Microsoft Access auch für den Arsch. Skype. Business für den Arsch. Das Einzige,"}, {"id": 80, "start": 646.04, "end": 655.64, "text": "was davon übrig bleibt, was eine Daseinsberechtigung hat, ist Outlook und Excel. Das ist da. Outlook,"}, {"id": 81, "start": 655.64, "end": 661.96, "text": "aber auch nur, wenn man im Microsoft-Ökosystem mit, mit, mit Access und, und Active Sync und"}, {"id": 82, "start": 661.96, "end": 667.68, "text": "Geschiss unterwegs ist. Aber Excel. Excel ist die einzige Office-Anwendung, die tatsächlich"}, {"id": 83, "start": 667.68, "end": 679.04, "text": "in gewissen, eine gewisse Daseinsberechtigung hat. Excel ist die IDE der Sekretärin oder der"}, {"id": 84, "start": 679.04, "end": 693.2, "text": "BWL-Stonksleute. So. Und deswegen, die hat Daseinsberechtigung. Ich hab sogar auch letztens,"}, {"id": 85, "start": 693.2, "end": 697.76, "text": "ich würd's mir nicht glauben, aber ich hab doch auch letztens was mit, mit, mit, mit, mit, mit"}, {"id": 86, "start": 697.76, "end": 706.4, "text": "Access. Nein, mit Excel. Mit Access zum Glück nicht. Access würde ich ihm frei, nichts machen. Mit,"}, {"id": 87, "start": 706.4, "end": 712.4, "text": "mit Excel gemacht, allerdings nur um zwei Wege. Ich hab CSV-Dateien generiert mit einem.NET-Benchmark"}, {"id": 88, "start": 712.4, "end": 716.96, "text": "und hab'n Kollege gefragt, ob er daraus Excel, äh, die in Excel importieren kann und ein paar"}, {"id": 89, "start": 716.96, "end": 731.2, "text": "schicke Stonks-Graphics machen kann. Hat er gemacht. Kam auch gleich gut an. So. XSLT. Okay,"}, {"id": 90, "start": 731.2, "end": 741.36, "text": "das sagt mir nix. Ist das, ist das der, das Schema, das XML-Schema-Ding? Ist das das XML-Schema? Nee."}, {"id": 91, "start": 741.36, "end": 750.2, "text": "Was? Leute, ich hab' keine Ahnung, was das ist, aber wenn es was mit XML zusammen hat, äh,"}, {"id": 92, "start": 750.2, "end": 756.64, "text": "zusammen zu tun hat, ist es kacke. Ganz einfach zu beantworten. Also alles, was mit XML hantiert,"}, {"id": 93, "start": 756.64, "end": 764.72, "text": "ist, äh, Paint-Champ und ist es nicht schwer zu benutzen. Ja, du fährst von der anderen Seite."}, {"id": 94, "start": 764.72, "end": 770.8, "text": "Du fährst von der anderen Seite. Ich fahr' von Hanau aus. Farbwerke, du fährst, du fährst von"}, {"id": 95, "start": 770.8, "end": 781.28, "text": "oben raus. Ich, ich fahr', ich, ich fahr' von unten raus mit der Bahn. Mal gucken, wie es so weitergeht,"}, {"id": 96, "start": 781.28, "end": 794.04, "text": "wie, wie Corona, wie Corona so weitermacht, ja. Ja, das, das kommt auch dazu. Leute, es war noch"}, {"id": 97, "start": 794.04, "end": 798.44, "text": "nie so einfach, äh, Leute zu erreichen auf der Arbeit, wie als, wie, wie wenn, seit die alle"}, {"id": 98, "start": 798.44, "end": 802.32, "text": "Homeoffice haben. Wisst ihr, was es teilweise für ein Akt war? Du hast einen halben Tag gebraucht,"}, {"id": 99, "start": 802.32, "end": 806.96, "text": "bis du irgendeinen Typ mal erwischt hast an seinem scheiß Platz. Das hat mich so aufgeregt immer."}, {"id": 100, "start": 806.96, "end": 810.88, "text": "Du hast, wolltest irgendwie was, nur zwei Minuten wissen. Der Typ ist nicht da, der Typ ist nicht da,"}, {"id": 101, "start": 810.88, "end": 815.08, "text": "da ist in irgendeinem Meeting, da ist er Mittagessen, dann steht er sonst wo, du hast keine Ahnung. Heute,"}, {"id": 102, "start": 815.08, "end": 819.44, "text": "easy, du schreibst im Teams, der Typ guckt rein, sagt, ja, okay, ich kann grad nicht,"}, {"id": 103, "start": 819.44, "end": 824.32, "text": "grad Besprechung und meldet sich nachher. Das ist viel einfacher. Also ganz ehrlich, die,"}, {"id": 104, "start": 824.32, "end": 830.28, "text": "wer sagt, die Kommunikation ist besser vor Ort, der hat keine Ahnung. Also zumindest nicht,"}, {"id": 105, "start": 830.28, "end": 838.44, "text": "zumindest nicht, nicht bei mir. Ja, vielleicht sitzt er auch gerade auf dem Klo und ist kacken,"}, {"id": 106, "start": 838.44, "end": 844.16, "text": "ja, kann auch sein. Ihr benutzt noch Skype? Skype haben wir auch mal, das ist richtig Paintschamp."}, {"id": 107, "start": 844.16, "end": 849.52, "text": "Skype gibt's auch, ganz kurz muss ich jetzt ne Story zum Besten geben, wo wir wieder bei"}, {"id": 108, "start": 849.52, "end": 855.48, "text": "hochbezahlten Consultants sind. Wir haben ein Team, was sich um Kommunikationstools kümmert und da"}, {"id": 109, "start": 855.48, "end": 860.28, "text": "hatten wir einen Skype, Skype for Business Experten drin. Und wir wollten damals, ich weiß nicht mehr"}, {"id": 110, "start": 860.28, "end": 867.36, "text": "genau, für was es war, wir wollten automatisiert aus einem Programm, ah, ich weiß, ich weiß,"}, {"id": 111, "start": 867.36, "end": 874.96, "text": "ich weiß, für was es war. Manchmal, wir haben noch so einen fetten IBM Mainframe und da laufen"}, {"id": 112, "start": 874.96, "end": 881.44, "text": "manchmal irgendwelche Jobs, die abbrechen. Und da hatten mich damals die Leute, ja, die machen"}, {"id": 113, "start": 881.44, "end": 889.0, "text": "auch Cobol, genau. Da hatten mich damals die Leute gefragt von den Mainframe Leuten, sag mal, hast"}, {"id": 114, "start": 889.0, "end": 893.76, "text": "du eine Idee, wie wir uns per Skype benachrichtigen lassen können, wenn irgendwie ein Mainframe-Job"}, {"id": 115, "start": 893.76, "end": 898.32, "text": "abgebrochen ist? Keine Ahnung, das Ding hat garantiert irgendeine, irgendeine API zum Ansprechen. Da"}, {"id": 116, "start": 898.32, "end": 903.6, "text": "haben wir unseren Skype-Communication-Expert gefragt oder wie auch immer der Typ genau Jobtitel hatte"}, {"id": 117, "start": 903.6, "end": 907.76, "text": "und er hat gesagt, nein, das ist nicht möglich. Also, was habe ich gemacht? Microsoft-Seite"}, {"id": 118, "start": 907.76, "end": 912.8, "text": "aufgemacht, geguckt, festgestellt, natürlich hat das Ding eine API und festgestellt, es ist eine"}, {"id": 119, "start": 912.8, "end": 920.52, "text": "XML-basierte API, wo wir gerade dabei sind. Du musstest irgendwelche XML-Geschichten ausfüllen,"}, {"id": 120, "start": 920.52, "end": 926.0, "text": "um da Messages zu schicken, aber easy, war total easy. Ich habe eine halbe Stunde gebraucht, habe"}, {"id": 121, "start": 926.0, "end": 932.28, "text": "ich was zusammen gewurstet und konnte der Testnachricht verschicken, ganz einfach. Da hat er"}, {"id": 122, "start": 932.28, "end": 937.08, "text": "konsultant wieder richtig glänzen können, so, bei deinem Text. Was macht der Download? Ist der fertig?"}, {"id": 123, "start": 937.08, "end": 945.8, "text": "Jo. Windows-Server so kurz vor Bett? Ja, wahrscheinlich, das muss ich, ich brauche klare, klare Deadline"}, {"id": 124, "start": 945.8, "end": 952.68, "text": "für Windows-Server, weil sonst kriege ich Anfälle, wenn ich damit länger rum machen muss. Ich gehe"}, {"id": 125, "start": 952.68, "end": 959.48, "text": "jetzt noch schnell den Chat durch, dann mache ich die VM und Windows-Server-Stells. Äh, nice."}, {"id": 126, "start": 959.48, "end": 965.36, "text": "Hatte heute meinen Einstellungstest für die Ausbildung als Physi, war pur Stress. Was wollten"}, {"id": 127, "start": 965.36, "end": 970.44, "text": "sie so? Wie lang? Erstmal Frage, schrei bitte at wo plus davor, sonst vergesse ich es nachher,"}, {"id": 128, "start": 970.44, "end": 975.88, "text": "wenn ich beim Chat unten angekommen bin, so raus bezogen hat. Äh, wie lang war der Test? Also wie"}, {"id": 129, "start": 975.88, "end": 979.76, "text": "lang haben sie dich insgesamt von rein bis raus gehen? Das wird mich echt interessieren. Es gibt"}, {"id": 130, "start": 979.76, "end": 983.6, "text": "nämlich heute immer noch Unternehmen, die fangen an mit irgendwelchen Assessment-Central-Geschichten,"}, {"id": 131, "start": 983.6, "end": 988.44, "text": "du bist irgendwie sechs Stunden unterwegs und sowas. Äh, da, da glaube ich, die haben den Schuss"}, {"id": 132, "start": 988.44, "end": 996.52, "text": "da mal gehört. Ich weiß noch, wo ich mich, ich weiß jetzt, Max Side-Track, äh, Max 95 Side-Track"}, {"id": 133, "start": 996.52, "end": 1003.12, "text": "FPS, ähm, wo ich die Ausbildungsstelle gesucht habe. Also, als ich dann meine Kaufmännische"}, {"id": 134, "start": 1003.12, "end": 1006.88, "text": "ausbilde, wißt du, ich hatte mal ein früheres Stronx-Leben, mit dem ich jetzt nichts mehr zu"}, {"id": 135, "start": 1006.88, "end": 1012.36, "text": "tun haben will, aber, ey, als ich da die Ausbildung gesucht habe, da war ich auch bei uns vor Ort in"}, {"id": 136, "start": 1012.36, "end": 1017.96, "text": "irgendeinem Industrie-Laden, keine Ahnung mehr, welcher das war in Hanau, und da hatte ich mich"}, {"id": 137, "start": 1017.96, "end": 1024.44, "text": "beworben als irgendwelche Elektronik-Geschichten damals. Wollte ich einfach mal gucken, ob die mich"}, {"id": 138, "start": 1024.44, "end": 1032.76, "text": "nehmen, und das war das beschissenste Vorstellungs- und, und Einstellungs-Ding aller Zeiten. Sowas habe"}, {"id": 139, "start": 1032.76, "end": 1037.28, "text": "ich danach auch nicht mehr gesehen. Du bist da rein, also, ich krieg nicht mehr alle Details zusammen,"}, {"id": 140, "start": 1037.28, "end": 1042.72, "text": "bist da reingekommen, dann wurdest du erstmal rumgeführt, so weit, so gut, so. Dann haben sie"}, {"id": 141, "start": 1042.72, "end": 1047.28, "text": "dich in zwei Gruppen eingeteilt, die erste Gruppe hat den Test gemacht, der ging irgendwie zwei"}, {"id": 142, "start": 1047.28, "end": 1052.36, "text": "Stunden, das ist kein Witz, zwei Stunden, und die, die zweite Gruppe wurde komplett rumgeführt,"}, {"id": 143, "start": 1052.36, "end": 1059.04, "text": "nochmal im Detail, und dann wurde geswitcht. So, erstens, der Test war der beschissenste Test"}, {"id": 144, "start": 1059.04, "end": 1067.24, "text": "aller Zeiten. Das war so ein, so ein Psycho-G-Bait-Test. Weiß ich, ob ihr schonmal die, die, die Ehre hatte,"}, {"id": 145, "start": 1067.24, "end": 1076.76, "text": "sowas zu machen. Das war ein Test in, in Richtung von, ähm, 21, 21 Aufgaben, und die 21. Aufgabe ist,"}, {"id": 146, "start": 1076.76, "end": 1083.52, "text": "ähm, gebe das, gebe das platt ab. Also, erste Aufgabe ist, oder erste Überschrift ist, bitte"}, {"id": 147, "start": 1083.52, "end": 1089.6, "text": "lesen, bitte lesen sie sich alles durch, und die 21. Aufgabe ist, äh, nachdem sie sich das durchgelesen"}, {"id": 148, "start": 1089.6, "end": 1095.04, "text": "haben, können sie den Zettel wieder abgeben. Aber, was hat man in der Schule gelernt? Natürlich,"}, {"id": 149, "start": 1095.04, "end": 1100.88, "text": "natürlich, ähm, man hat in der Schule gelernt, selbstverständlich fängt man von oben nach"}, {"id": 150, "start": 1100.88, "end": 1112.08, "text": "unten an, die Zeit ist ja knapp. Oh. Und, äh, da waren dann so total bescheuerte Sachen drin,"}, {"id": 151, "start": 1112.08, "end": 1115.84, "text": "da ist man jetzt irgendwann gedämmert, dass es G-Bait ist. Ich hab das, ich hab das dann so ein"}, {"id": 152, "start": 1115.84, "end": 1119.2, "text": "bisschen durchgeskippt, die Fragen, und da bin ich, da hab ich dann gelesen, stehen sie auf,"}, {"id": 153, "start": 1119.2, "end": 1123.16, "text": "und drehen sie sich im Kreis, und so ein Scheiß stand da drinnen. Das ist ein ganz bekannter Test,"}, {"id": 154, "start": 1123.16, "end": 1131.0, "text": "und, denn, da wollten sie uns richtig, richtig, richtig g-baiten. Das ist richtig cringe, ja, und"}, {"id": 155, "start": 1131.0, "end": 1134.72, "text": "danach haben sie uns noch mal irgendwie ne Stunde rumgeführt, ich war da irgendwie fünf Stunden,"}, {"id": 156, "start": 1134.72, "end": 1140.68, "text": "oder so. Wo ich halt echt sagen muss, wollen die mich ver- also, ich hätt heut im Leben nicht mehr"}, {"id": 157, "start": 1140.68, "end": 1146.6, "text": "gemacht. Fünf Stunden, obwohl du nicht, warum zeigen die mir jeden Furz da, wenn ich noch nicht"}, {"id": 158, "start": 1146.6, "end": 1150.72, "text": "mal weiß, ob ich die Stelle da krieg? Das, das war richtig für'n Arsch, also, kann ich mich noch"}, {"id": 159, "start": 1150.72, "end": 1155.16, "text": "dran erinnern, das war eines der negativsten Erlebnisse, was ich so Job-Suche-mäßig je hatte."}, {"id": 160, "start": 1155.16, "end": 1171.44, "text": "Naja, okay, also. Ja, ist so, man ist einfach auch viel wacher. So, gerade eben hat jemand seinen"}, {"id": 161, "start": 1171.44, "end": 1180.04, "text": "privaten Domain-Controller verloren. RIP. F für den Domain-Controller. Gut, ich kann da"}, {"id": 162, "start": 1180.04, "end": 1187.16, "text": "nix zu sagen, ich hab damit noch nie was gemacht. Ja? Ja, ich auch nicht. Das Einzige, was ich hatte,"}, {"id": 163, "start": 1187.16, "end": 1193.04, "text": "ist, wo ich mal krank war, wo ich, ich vermute, dass es entweder an einem Rahmschnitzel lag oder an"}, {"id": 164, "start": 1193.04, "end": 1198.2, "text": "einem Döner-Teller, weil ich hatte, ich hab euch ja mal erzählt, ich hatte wirklich die letzten"}, {"id": 165, "start": 1198.2, "end": 1203.52, "text": "eineinhalb Jahre über das erste Mal in meinem Leben eine meldepflichtige Krankheit, und es war"}, {"id": 166, "start": 1203.52, "end": 1211.56, "text": "nicht Corona, es war irgendwelche Darm-Viren, und das erholt man sich meistens zu beessen. Und"}, {"id": 167, "start": 1211.56, "end": 1217.32, "text": "ich hab jetzt letzten Monat ja viel bestellt, und entweder war das halt das Rahmschnitzel oder"}, {"id": 168, "start": 1217.32, "end": 1220.64, "text": "der Döner-Teller. Ich glaube aber, dass es das Rahmschnitzel war, das kommt zeitlich eher hin."}, {"id": 169, "start": 1220.64, "end": 1230.16, "text": "Ja, da hat sich mein Pockers-Klo wieder richtig ausgezahlt. Meinung zu E-Bahn?"}, {"id": 170, "start": 1230.16, "end": 1238.32, "text": "Mittlerweile, muss ich sagen, hat sich meine Meinung geändert. E-Bahn eintippen ist immer"}, {"id": 171, "start": 1238.32, "end": 1243.56, "text": "noch Müll, aber die Zukunft ist jetzt auch in Deutschland angekommen. Oftmals kann man QR-Codes"}, {"id": 172, "start": 1243.56, "end": 1248.52, "text": "scannen auf Rechnung, und wenn nicht, haben die meisten Apps von den Banken die Möglichkeit,"}, {"id": 173, "start": 1248.52, "end": 1257.92, "text": "dass man zumindest die E-Bahn OCR erkennt vom, oder die Überweisung OCR erkennt vom Überweisungsleger."}, {"id": 174, "start": 1257.92, "end": 1262.0, "text": "Es gibt leider immer noch welche, die sind total oldschool, die schicken dir eine Rechnung,"}, {"id": 175, "start": 1262.0, "end": 1265.92, "text": "so nach dem Motto, vielen Dank für Ihren Auftrag, blablabla, bitte überweisen Sie"}, {"id": 176, "start": 1265.92, "end": 1270.04, "text": "Zahlungsziehen innerhalb von 14 Tagen, und hier bitte auf dieses Konto. Das ist natürlich Müll."}, {"id": 177, "start": 1270.04, "end": 1275.68, "text": "Leute, ich hab die Idee, ich brauch einen QR-Code. Ich brauch einen QR-Code für meine Rechnung."}, {"id": 178, "start": 1275.68, "end": 1287.76, "text": "Exzellent. Ich schreib so selten Rechnung, aber das brauch ich. OCR-Code, Horace. Richtig nice."}, {"id": 179, "start": 1287.76, "end": 1303.84, "text": "Okay. Meinung zu Jaml? Eglige Sündtagsfehler, oftmals weil du nicht genau guckst auf Einrückung"}, {"id": 180, "start": 1303.84, "end": 1311.6, "text": "und Sonderzeichen und sonst was. Wer es nicht weiß, Jaml ist ein super Set von Jason, auch wenn es"}, {"id": 181, "start": 1311.6, "end": 1316.44, "text": "komplett anders aussieht. Gültiges Jason ist automatisch gültiges Jaml, umgedreht natürlich"}, {"id": 182, "start": 1316.44, "end": 1321.68, "text": "nicht. Aber trotzdem, Jason ist mir lieber. Der einzige Vorteil, den ich sehe von Jaml vs. Jason,"}, {"id": 183, "start": 1321.68, "end": 1331.32, "text": "ist, dass du in Jaml Kommentare machen kannst. Wird noch ausgehandelt. Ja, genau, ist bei uns"}, {"id": 184, "start": 1331.32, "end": 1334.6, "text": "auch so. Wir haben das zwar schon immer ein bisschen dynamisch gehandhabt bei uns,"}, {"id": 185, "start": 1334.6, "end": 1341.36, "text": "weil wir sind ja Poggers agile IT, aber dass es bei uns eine unternehmensweite Regelung"}, {"id": 186, "start": 1341.36, "end": 1347.52, "text": "zur Homeoffice gibt, das geht nur wegen Corona. Der Desktop ist richtig pock. Ich habe es schon"}, {"id": 187, "start": 1347.52, "end": 1351.92, "text": "gezeigt, ich finde in Sekunden was. Wer sich die Mühe macht, den Desktop aufzuräumen,"}, {"id": 188, "start": 1351.92, "end": 1358.84, "text": "findet die Sachen auch nicht schneller. Also, verschwendete Zeit. So, gleich haben wir es mit"}, {"id": 189, "start": 1358.84, "end": 1376.2, "text": "dem Chat. Google Sheets mit Add-In. Ja, kann man verwenden. Ja, Wordfiles anzeigen ist ja okay,"}, {"id": 190, "start": 1376.2, "end": 1379.96, "text": "aber es ist richtig painstamp, wenn man Wordfiles zum editieren bekommt. Ich meine,"}, {"id": 191, "start": 1379.96, "end": 1384.56, "text": "der PDF ist ja noch in Ordnung, wenn man einfach Dokumente austauschen muss, aber dieses"}, {"id": 192, "start": 1384.56, "end": 1401.12, "text": "Word-Datein rumgeschicke ist eigentlich sowas von 1990. Wir machen wie gesagt seit eineinhalb"}, {"id": 193, "start": 1401.12, "end": 1412.4, "text": "Jahren Daily-Scrum und Geschichten alles im Teams. Was für ein Ding. Was ist Edifact?"}, {"id": 194, "start": 1412.4, "end": 1416.84, "text": "Sagt mir nix."}, {"id": 195, "start": 1430.04, "end": 1436.2, "text": "Ein, eine Stunde lang Online-Test, aber war schon ganz schwer. Hab auch Versicherungskaufbahn"}, {"id": 196, "start": 1436.2, "end": 1439.72, "text": "gelernt, arbeite auch noch da und bin eigentlich so Tests gewonnen, aber der war gut anstrengend."}, {"id": 197, "start": 1439.72, "end": 1455.56, "text": "Als für die Ausbildung oder für den richtigen Job dann. Du weißt, ich werde mal wieder ausatmen,"}, {"id": 198, "start": 1455.56, "end": 1461.2, "text": "ja? Richtig cringe. Dankeschön Phoenix für den Sub. Mir geht es ganz gut,"}, {"id": 199, "start": 1461.2, "end": 1466.28, "text": "außer dass ich morgen wieder arbeiten gehen muss nach Frankfurt. Ja, das denke ich mir heute auch,"}, {"id": 200, "start": 1466.28, "end": 1474.4, "text": "das ist voll für den Arsch. War das bei einer Firma, das war nicht beim Arbeitsamt. Arbeitsamt"}, {"id": 201, "start": 1474.4, "end": 1483.8, "text": "habe ich ja eigene Geschichten schon erzählt, das ist ja auch absolut useless Laden. Ja,"}, {"id": 202, "start": 1483.8, "end": 1500.68, "text": "das ist total unsinnig. Das ist total unsinnig. Ich weiß nicht, was man daraus ableiten kann."}, {"id": 203, "start": 1513.8, "end": 1522.92, "text": "Der Mann möchte mithilfe der Sanduhren 13 Minuten stoppen. Beide durchlaufen lassen,"}, {"id": 204, "start": 1522.92, "end": 1526.64, "text": "oder wie? Ne, beide durchlaufen geht ja nicht. Das eine ist ja zwei Minuten,"}, {"id": 205, "start": 1526.64, "end": 1536.72, "text": "das eine sind ja dann bloß zwölf Minuten. Ganz einfach. Ohne Sanduhren, man zählt einfach."}, {"id": 206, "start": 1536.72, "end": 1548.84, "text": "Easy. Ich wollte gerade sagen, einfach bis 60 zählen. Easy. Fertig. Oder Google fragen."}, {"id": 207, "start": 1548.84, "end": 1556.92, "text": "Google weiß da meistens auch die Antwort drauf. Und was ist die offiziell anerkannte Antwort?"}, {"id": 208, "start": 1556.92, "end": 1565.6, "text": "Wie geht das? Man kann ja nicht wirklich zuverlässig erkennen, wann halbe halbe ist."}, {"id": 209, "start": 1565.6, "end": 1579.72, "text": "Also halb durchlaufen lassen ist keine gute Antwort. Also halb durchlaufen lassen,"}, {"id": 210, "start": 1579.72, "end": 1584.76, "text": "also ne, aber halb durchlaufen ist dumm. Halb durchlaufen, das ist ja auch überhaupt nicht"}, {"id": 211, "start": 1584.76, "end": 1588.88, "text": "exakt. Es geht ja darum, dass man es richtig hat. Halb durchlaufen, ist das jetzt halb durch oder"}, {"id": 212, "start": 1588.88, "end": 1594.56, "text": "nicht? Kann man die vielleicht auf die Seite legen und dann läuft sie immer exakt bis zur"}, {"id": 213, "start": 1594.56, "end": 1617.96, "text": "Hälfte durch? Ja, würde mich mal interessieren, was da die gute, gute Antwort ist. Das sind so"}, {"id": 214, "start": 1617.96, "end": 1630.56, "text": "sinnlos Brain-Teaser-Fragen. Naja. Unser CEO will uns alle wieder ins Büro holen. Das ist"}, {"id": 215, "start": 1630.56, "end": 1635.44, "text": "kein Kündigungsgrund für die Mitarbeiter. Hä? Wie? Moment. Es ist ein Kündigungsgrund. Das"}, {"id": 216, "start": 1635.44, "end": 1639.4, "text": "verstehe ich jetzt nicht. Sagt er, es ist ein Kündigungsgrund, wenn man nicht kommt oder die"}, {"id": 217, "start": 1639.4, "end": 1644.6, "text": "Leute kündigen nicht, wenn man sie dazu herordert. Naja, das hat man jetzt gerade bei Apple gesehen,"}, {"id": 218, "start": 1644.6, "end": 1659.08, "text": "wie gut das funktioniert. Mit, die Leute müssen wieder. Hearthstone ist random. Ich habe mal eine"}, {"id": 219, "start": 1659.08, "end": 1664.56, "text": "Weile recht viel Hearthstone gespielt, aber das bin ich, bin ich raus. Download Progress ist fertig."}, {"id": 220, "start": 1664.56, "end": 1679.0, "text": "Was? Fünf Minuten zweimal und sieben Minuten halb durchlaufen lassen. Äh, das wären dann,"}, {"id": 221, "start": 1679.0, "end": 1693.44, "text": "wären dann dreizehneinhalb oder wie oder? NKZNE, Dankeschön. Für den Sub. Klar sollte die,"}, {"id": 222, "start": 1693.44, "end": 1709.28, "text": "also was? Ich meine, man könnte das voneinander abziehen, oder? Man könnte es doch voneinander"}, {"id": 223, "start": 1709.28, "end": 1715.68, "text": "abziehen, oder? Also, also man lässt die Siebener durch, man lässt die Siebener durchlaufen und wenn"}, {"id": 224, "start": 1715.68, "end": 1722.04, "text": "die Fünfer durchgelaufen ist, weiß man, die Siebener sind noch zwei Minuten übrig. Oder? Das"}, {"id": 225, "start": 1722.04, "end": 1730.4, "text": "könnte man auch machen. Aber hat man da was von? Hat man da was von? Dann weiß ich,"}, {"id": 226, "start": 1730.4, "end": 1734.12, "text": "da sind noch zwei Minuten. Moment, Moment, Moment. Big, big brain, big, big, big brain time. Also."}, {"id": 227, "start": 1734.12, "end": 1739.2, "text": "Was schreibt er jetzt? Zehn Minuten nach Beginn ist die fünf Minuten nur zum zweitmal durchlaufen."}, {"id": 228, "start": 1739.2, "end": 1753.72, "text": "Die Siebener ist dann bereits drei Minuten. Ja, ja, ja, ja. Nee. Was? Ah. Ja, so was in der"}, {"id": 229, "start": 1753.72, "end": 1759.28, "text": "Richtung. Ja. Ja, ganz im Ernst. Das sagt doch null drüber aus, ob das beispielsweise guter"}, {"id": 230, "start": 1759.28, "end": 1763.4, "text": "Programmierer ist oder sonst was, wenn er da ist, wenn ihm da so spontan nicht das Richtige zu"}, {"id": 231, "start": 1763.4, "end": 1779.6, "text": "einfällt. Ja, irgendwie so was. Ja. Ach, die Leute kündigen nicht, wenn sie ins Büro sollen. Jetzt"}, {"id": 232, "start": 1779.6, "end": 1783.84, "text": "hat man ja bei Apple gesehen. Da sind ja haben jetzt ja auch schon einige gesagt. Nee, kommen"}, {"id": 233, "start": 1783.84, "end": 1797.68, "text": "nicht mehr. Battle Royale Games kann ich jetzt nichts zu sagen. Das wird zwar zu lang. So, ich muss meine Windows-VM starten, Leute. Bäm. Also ausmachen. Kann ich"}, {"id": 234, "start": 1797.68, "end": 1804.0, "text": "irgendwas hier von recyceln? Was haben wir denn hier? Windows, Windows Zeug. Das brauche ich"}, {"id": 235, "start": 1804.0, "end": 1812.28, "text": "doch nicht mehr hier, oder? Brauche ich das noch? Das brauche ich doch gar nicht mehr. Ist das,"}, {"id": 236, "start": 1812.28, "end": 1816.84, "text": "ist das hier mein richtiges Windows 11? Ich muss meine VMs mal ordentlich benennen. Ist das,"}, {"id": 237, "start": 1816.84, "end": 1823.08, "text": "ist das mein, mein, mein neustes Windows 11? Da kann ich das andere nämlich recyceln als, als Windows Server."}, {"id": 238, "start": 1823.08, "end": 1849.64, "text": "Auf. Ja, Qtweep93, das ist die Richtige. Okay, äh, wo war, wo ist Rename? Rename? Windows 11. Und das ist, das wird jetzt renamen."}, {"id": 239, "start": 1849.64, "end": 1858.04, "text": "Windows Server. Okay, sehr schön. Kann man das wieder ausschalten?"}, {"id": 240, "start": 1858.04, "end": 1864.36, "text": "Nee, OneDrive nervt jetzt nicht. Gut, dann hängen wir nämlich jetzt hier mal die ISO dran. Ich glaube,"}, {"id": 241, "start": 1864.36, "end": 1868.36, "text": "hier war nichts mehr drauf. Alter, was ist das für ein Gelegge? Das macht mich jedes Mal fertig."}, {"id": 242, "start": 1868.36, "end": 1891.88, "text": "Dieses, dieses Fenster. Wie, wie das laggt, wenn du das Track und Drops. Eine Güte."}, {"id": 243, "start": 1891.88, "end": 1898.28, "text": "Okay, äh, vier CPUs habe ich da drinnen. Warum, vier? Was ist mit mir los? Warum habe ich da vier reingemacht?"}, {"id": 244, "start": 1898.28, "end": 1906.12, "text": "Egal. Dann läuft der Flutsch der Windows Server wenigstens. Äh, warum kann ich das nicht ein, weil es noch an ist?"}, {"id": 245, "start": 1906.12, "end": 1913.16, "text": "Was habe ich denn da ausprobiert? Brauch mal alles nicht. Kann man, kann man wegschmeißen. Power off."}, {"id": 246, "start": 1913.16, "end": 1925.8, "text": "So, äh, Windows ISO. Komm her. Wo hast du dich versteckt? Da. Ich will, ich will die mal MD5 Summen, die Windows ISO, was ich da habe."}, {"id": 247, "start": 1925.8, "end": 1934.28, "text": "Habe ich irgendwie sowas drauf? MD5 Summen? Oh! MonkaS? Tatsächlich, hätte ich gerade gedacht."}, {"id": 248, "start": 1934.28, "end": 1945.48, "text": "CD Downloads, äh, MD5 Summen, wie, wie ist dieses Ding jetzt? 20, 20.03, das da."}, {"id": 249, "start": 1945.48, "end": 1954.84, "text": "Ja, ist, mir wurscht, ob das unsicher ist. Zum Testen, ob, äh, der Download richtig ist, beziehungsweise was das Internet dazu ausspuckt."}, {"id": 250, "start": 1954.84, "end": 1967.16, "text": "Hallo? Willst du copy-pasten? Ich will das, Windows, ich will das copy-pasten."}, {"id": 251, "start": 1967.16, "end": 1979.64, "text": "Wie geht denn das? Edit, copy. Ah, Mist. List Files bei Microsoft."}, {"id": 252, "start": 1979.64, "end": 1987.0, "text": "Okay, ich hab, ich hab wahrscheinlich das Richtige. Windows Server, Preview, ja, okay, okay. Alles, alles klar."}, {"id": 253, "start": 1987.0, "end": 1998.36, "text": "Nee, ich will gucken nicht, ob ich das Richtige runtergeladen habe. Ich will es, ob ich das Letzte runtergeladen habe."}, {"id": 254, "start": 1998.36, "end": 2004.92, "text": "Also, ob das, vielleicht hätte ich jetzt ja was gefunden, so nach dem Motto, das ist, das ist Preview 1 und es gibt schon Preview 5 oder irgendwie sowas."}, {"id": 255, "start": 2004.92, "end": 2015.4, "text": "Also, weiter. Next. Einlegen, starten. Bam. Escape-Hammern. Zu spät, nee, rechtzeitig sein. Wir wollen booten von CD."}, {"id": 256, "start": 2015.4, "end": 2035.8, "text": "Hallo? CD ist nicht connected. Von CD. Sehr gut. So, dann installieren wir den Kram mal, äh, den Kram mal."}, {"id": 257, "start": 2035.8, "end": 2051.88, "text": "Das ist eher CAC-WTF, genau. Keyboard-Input. Was? Ui, Ui-Gur-Legacy. Alles klar. Das ist Proma."}, {"id": 258, "start": 2051.88, "end": 2060.92, "text": "Time-Currency-German. Ach, ich verge, ich vergesse, aber es lohnt sich überhaupt nicht, hier einzustellen, weil das für Windows eh nicht verwendet wird am Ende."}, {"id": 259, "start": 2060.92, "end": 2068.12, "text": "Äh, Englisch. Install now. Sag mal, ist das immer noch der Vista-Installer? Sehe ich das richtig?"}, {"id": 260, "start": 2068.12, "end": 2073.8, "text": "Gerade für den Windows-Server, warum spendieren die dem nicht mal einen ordentlichen Text-Installer?"}, {"id": 261, "start": 2073.8, "end": 2087.0, "text": "Dieses rumgeklicken, da muss der eine Maus anschließen am Server und sowas, das ist doch scheiße."}, {"id": 262, "start": 2087.0, "end": 2104.76, "text": "Desktop. Ok. Was gibt es für Unterschiede? Windows-Server 2022. Standard-Evaluation und Desktop-Evaluation."}, {"id": 263, "start": 2104.76, "end": 2121.4, "text": "Ich glaube, ich brauche Desktop-Evaluation, ich erinnere mich dunkel, weil Standard, da kriegst du nur so ein Power-Shell-Fenster, oder?"}, {"id": 264, "start": 2121.4, "end": 2127.56, "text": "Jaja, das finde ich ja auch löcherlich. Du kriegst dann, ich kann mich auch dran erinnern, als das neu war."}, {"id": 265, "start": 2127.56, "end": 2136.04, "text": "Da kriegst du dann ein Shell und ich dachte damals, Windows läuft jetzt im Text-Modus, also die haben jetzt eine ordentliche Konsole und ein ordentliches Text-Interface,"}, {"id": 266, "start": 2136.04, "end": 2145.16, "text": "aber nein, es ist im Prinzip einfach nur ein CMD-Fenster ohne dass der Desktop startet. Komplett Windows-Style halt."}, {"id": 267, "start": 2145.16, "end": 2153.64, "text": "So, I accept, jawoll, custom. So, erstmal diesen ganzen Schmodder löschen. Und bin ich in der richtigen VM?"}, {"id": 268, "start": 2153.64, "end": 2163.0, "text": "Ich bin in der richtigen VM. Muss man auf Nummer sicher gehen. Was ich bis heute nicht verstehe, warum gibt es nicht einfach so einen Button,"}, {"id": 269, "start": 2163.0, "end": 2176.52, "text": "so nach dem Auto drüber installieren, mach. 60G sollte reichen. Huge high speed Windows-Installation. Wir machen das mal ein bisschen größer."}, {"id": 270, "start": 2176.52, "end": 2189.64, "text": "Also Leute, ich hab keine Ahnung von Windows, das wisst ihr ja, ne?"}, {"id": 271, "start": 2189.64, "end": 2211.08, "text": "Null Plan. Ich weiß auch nicht, was wir dann damit machen. Ich muss dann erstmal gucken, was denn jetzt die Neuigkeiten von Windows 2022 stehen."}, {"id": 272, "start": 2211.08, "end": 2225.16, "text": "Stimmt, wo ist der Sebaro?"}, {"id": 273, "start": 2225.16, "end": 2230.92, "text": "Das ist gute Installationsmusik, oder?"}, {"id": 274, "start": 2230.92, "end": 2245.08, "text": "Wie, du hast keinen Plan von Windows als Informatikor, was ist da los? Ja, ich weiß. MrSnotty hatte einfach recht, ich hab keinen Plan."}, {"id": 275, "start": 2245.08, "end": 2260.84, "text": "Exposed wieder. Könnte man die Server-Version eigentlich auch als Daily-Driver verwenden? Ich bin mir nicht sicher, wie es da mit 3D-Beschleunigung und sowas aussieht."}, {"id": 276, "start": 2260.84, "end": 2275.88, "text": "Hack-Arrived brauchen wir doch nicht. Wir haben Wub-Arrived."}, {"id": 277, "start": 2275.88, "end": 2297.64, "text": "Okay, ich weiß was. Challenge für mich heute. Ich versuche eine statische HTML-Seite mit Windows-Bordmitteln auszuliefern. Da muss ich wahrscheinlich ein IES für installieren oder sowas. Das wird ganz pains-champing, Alter."}, {"id": 278, "start": 2297.64, "end": 2323.96, "text": "Das wird schlimm. Wie sprechen das eigentlich die coolen Leute aus? IIS oder mit SSL-Zertifikat? Stimmt, wie macht man mit IES? Let's Encrypt."}, {"id": 279, "start": 2323.96, "end": 2328.76, "text": "Ohne Kacke, ey, was sich da Microsoft immer ausdenkt."}, {"id": 280, "start": 2328.76, "end": 2351.96, "text": "Okay, also auf geht's. Real Name, Administrator, natürlich. Woher weiß der das bloß? Admin mit Vorname und Strator. Klingt fast ein bisschen italienisch. Strator oder griechisch oder so. 1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6. Bam, finish. Was?"}, {"id": 281, "start": 2351.96, "end": 2375.16, "text": "Das ist das meistverwendete Passwort auf der Welt. Das ist best practice. Wie kann das meistverwendete Passwort auf der Welt abgelehnt werden? Okay, 1, 2, 3, 4, 5, 6, underscore. 1, 2, 3, 4, 5, 6, underscore. Finish."}, {"id": 282, "start": 2375.16, "end": 2398.84, "text": "Okay, 1, 2, 3, 4, 5, 6, underscore. 1, 2, 3, 4, 5, 6, underscore. Ah, yes, jetzt ist alles klar. Merkt euch, 1, 2, 3, 4, 5, 6, underscore. Ich weiß das in 2 Minuten schon wieder nicht."}, {"id": 283, "start": 2398.84, "end": 2423.08, "text": "Oh Mist, habe ich jetzt das Passwort geleakt? Chat, chat. Nicht, nicht, nicht ein Hackhorn, ja? Hallo? Ah, man muss doch Ctrl, Alt, Delete machen, ups. 1, 2, 3, 4, 5, 6, underscore."}, {"id": 284, "start": 2423.08, "end": 2448.04, "text": "Kann man da... Yes. Hab ich Bridged eingestellt? Na gut, geht auch. Okay, ich muss jetzt erstmal, bevor wir irgendwas machen, muss ich Forever Tools installieren."}, {"id": 285, "start": 2448.04, "end": 2460.6, "text": "Damit ich, damit ich was sehe. So hältst du das, so hältst du das ja nicht aus. Erstmal, ich hoffe, man kann Forever Tools ordentlich installieren."}, {"id": 286, "start": 2460.6, "end": 2470.6, "text": "Wenn nicht, muss ich da per RDP drauf. Das machen wir, das machen wir als erstes erstmal RDP an."}, {"id": 287, "start": 2470.6, "end": 2480.12, "text": "Wobei der Windows, sag mal, installiert man auf einem Windows Server Forever Tools, sagen wir mal, wenn man das auf einem ESX betreibt, wahrscheinlich, wahrscheinlich schon, oder?"}, {"id": 288, "start": 2480.12, "end": 2493.56, "text": "Weil sonst kannst du ja, hast ja Probleme, dass die Uhrzeit nicht stimmt und sonst was. Ich mein, Linux-mäßig haben wir Forever Tools überall drauf. Ja, dann geht das jetzt auch."}, {"id": 289, "start": 2493.56, "end": 2508.2, "text": "Der EF-EWM-Driver, alles klar, vor allem ja. Zack. Fullscreen, da sind wir. Fertigstellen. Nein, wir starten jetzt nicht nur. Also, was will er uns mitteilen?"}, {"id": 290, "start": 2508.2, "end": 2528.04, "text": "Try Managing Servers with Windows Admin Center. Edge. Welche Edge ist das? Ist das schon, ist das schon der Chrome Edge?"}, {"id": 291, "start": 2528.04, "end": 2556.36, "text": "Ich glaube, das ist schon der Chrome Edge, ne? Ist updated erstmal. Das ist Windows Server 2022, ja? Wir können ja mal gucken, ob das hier funktioniert winfair. Ja. Windows Server 2022."}, {"id": 292, "start": 2556.36, "end": 2577.0, "text": "So. Okay. Windows Admin Center. Was? Download? Moment, Moment, Moment. Sehe ich das richtig? Ich kriege einen Popup angezeigt, dass ich mir aus dem Internet einen Server Admin Frontend runterladen soll, um den Server zu administrieren?"}, {"id": 293, "start": 2577.0, "end": 2592.44, "text": "Wollen die mich komplett verarschen? Ist das ernsthaft? Ist halt optional. Ja, dann sollen sie es mitliefern. Meine Güte, ich gehe doch nicht ins Internet und lad mir da random irgendwie einen Scheiß runter auf meine Kiste."}, {"id": 294, "start": 2592.44, "end": 2612.68, "text": "Ach du, meine Güte. Das ist ein Web-UI. Okay. Aber trotzdem. Warum liefert man das nicht als Windows Feature mit? Okay. Best Practice. Genau. Don't Show. So. Das kenne ich. Das habe ich schon mal gesehen."}, {"id": 295, "start": 2612.68, "end": 2627.72, "text": "Irgendwann in Windows Server 2003 oder so. Da sah das aber noch ein bisschen anders aus. So. Jetzt versuche ich. Wie kriege ich einen LDP-Server an? LDP? Nein. Remote?"}, {"id": 296, "start": 2627.72, "end": 2647.8, "text": "Hier, hm? Remote? Man muss das über die Settings-App machen. Das ist so pains-champig, Alter. In der Konsole S-Config eingeben. Okay. S-Config."}, {"id": 297, "start": 2647.8, "end": 2662.84, "text": "Oh, jetzt kommt. Jetzt kommt Windows Hexerei. Haben die das Windows Terminal mit installiert? Nee. Nee. Wer braucht schon ein ordentliches Terminal unter einem Server? Naja, das geht aber nicht."}, {"id": 298, "start": 2662.84, "end": 2682.04, "text": "Kann man PowerShell aufmachen, wenigstens. Die Uhr? Nein, die Uhr ist wahrscheinlich einfach falsche Zeitzone eingestellt. Das können wir gleich mal fixen."}, {"id": 299, "start": 2682.04, "end": 2699.32, "text": "Wo stellt man die Zeitzone ein? Hier. Da. Wir sind plus zwei. Also da plus eins. Aber normalerweise. Also aktuell sind wir plus zwei. Weil Sommerzeit. Sync now. Sehr gut."}, {"id": 300, "start": 2699.32, "end": 2719.24, "text": "Sysdmcpl. Ach, du Scheiße. Man muss schon hart im Nehmen sein, so ein Kram kennen, wenn man Windows-Kram administrieren will. Okay. Geht nicht. Ah. Ich mach das jetzt, wenn du was hast."}, {"id": 301, "start": 2719.24, "end": 2738.76, "text": "S-Config. Es gibt jetzt einen Kommando-Zeilen-Tool, um Windows-Server zu konfigurieren. Okay. Fivehead. Sieben. Remote Desktop. Enable. Allow only clients running remote desktop network level authentication."}, {"id": 302, "start": 2738.76, "end": 2763.64, "text": "Annie. Ist mir doch wurscht. Successful. Re... Ich muss... Ich soll restarten, deswegen... Wirklich? Das kann ich mir nicht vorstellen, dass ich deswegen... So. Ich muss aber eh jetzt mal hier einstellen, dass ich..."}, {"id": 303, "start": 2763.64, "end": 2784.2, "text": "Bridged Networking haben will. Dass ich da drauf zugreifen kann. Ach, war das noch wegen Forever Tools? Ja, das kann sein. Restart is required. Okay. Ja. Restart. Restart. Yes."}, {"id": 304, "start": 2784.2, "end": 2807.24, "text": "Das ist eine ganz, das ist ja eine ganz wilde Mischung mittlerweile aus aus nervigen Teilen von Windows 10 und das ist eine ganz, ganz wilde Mischung hier, das UI."}, {"id": 305, "start": 2807.24, "end": 2816.92, "text": "Ganz, ganz wilde Mischung, ey."}, {"id": 306, "start": 2816.92, "end": 2825.72, "text": "Ja, ja. Ich kann mit Nat drauf zugreifen, weil ich auf der gleichen Kiste bin, aber da muss ich jetzt die IP vom Vmware-Interface raussuchen."}, {"id": 307, "start": 2825.72, "end": 2838.84, "text": "Ne, muss ich nicht. Könnte ich einfach da in der Konsole gucken. Egal. So, wie macht man das jetzt? Ctrl-Alt-Entfernen hier drin. Send, Ctrl-Alt-Entfernen. Jawoll."}, {"id": 308, "start": 2838.84, "end": 2857.0, "text": "123456A Underscore. Aus welchem Grund will das jemand freiwillig nutzen? Das einzige, was mir einfällt ist, wenn man halt Windows-Services verwenden will, ja. Irgendwelche Active Directory Geschichten oder halt irgendwelche Windows-Only Geschichten. Ansonsten, warum man sonst verwenden will, keine Ahnung."}, {"id": 309, "start": 2857.0, "end": 2871.72, "text": "Ok. Also, Moment. Welche IP hat das Ding jetzt? PowerShell. Kann das Ding starten, wenn ich wegen seiner größeren Schriftart habe? Edit. Default. Ja. Bam."}, {"id": 310, "start": 2871.72, "end": 2891.16, "text": "Ah, reicht mir immer noch, aber es... Ah! Das Windows-Terminal! Please, Microsoft, warum habt ihr nicht das neue halbwegs Gescheite mit vorinstalliert? Ok, ja, so ist das. Ok."}, {"id": 311, "start": 2891.16, "end": 2911.8, "text": "Versuch mal, ob Ctrl... Jaja, das geht. Das habe ich vorhin schon gemacht. Also. Gibt es WinGet? Gute Frage. Nö."}, {"id": 312, "start": 2911.8, "end": 2936.36, "text": "So, und jetzt, und jetzt müssen wir mal hier gucken. Wie war das IP-Config, ne? Ok. 133. MSTSC hier. Ups. 133. Administrator. 123456A Underscore. Bam."}, {"id": 313, "start": 2936.36, "end": 2955.56, "text": "Signifikat, natürlich. Hoi! Massive. Funktioniert. Notification Center."}, {"id": 314, "start": 2955.56, "end": 2971.32, "text": "Also, ich will keine Daten an Microsoft schicken. Lass mich in Ruhe. Feedback-Frequency. Never. Lass mich in Ruhe, Microsoft. Wenigstens auf meinem Server, lass mich in Ruhe."}, {"id": 315, "start": 2971.32, "end": 2989.48, "text": "Ok, aber wir machen es über VM, aber es funktioniert wahrscheinlich. Lockt es sich aus, wenn man sich per RDP einlockt? Eigentlich, ja."}, {"id": 316, "start": 2989.48, "end": 3002.52, "text": "Gleiches Profil. Aha. Aha. Ok, das erste haben wir schon geschafft. RDP angeschaltet. So. Ok, machen wir weiter. Was macht man dann sonst noch so? Äh, zeigt mal hier. Was gibt es denn hier Schönes?"}, {"id": 317, "start": 3002.52, "end": 3028.6, "text": "Äh, also mein Server ist wohl kaputt laut Microsoft. Warum? Weil... Ist es jetzt gut oder schlecht? Was sagt mir das jetzt? Was oben auf Refresh?"}, {"id": 318, "start": 3028.6, "end": 3036.2, "text": "Äh, es ist immer noch kaputt. Ein Service ist es ja. Wie das gefrescht sich heute mal selbst. Das ist ja Absurd Bleeding Edge Software hier."}, {"id": 319, "start": 3036.2, "end": 3051.16, "text": "Ah, das Edge Update. Kann man das jetzt starten? Jawoll, Edge Update. Natürlich, das ist ganz ganz wichtig. Das muss selbstverständlich aktiviert sein."}, {"id": 320, "start": 3051.16, "end": 3068.52, "text": "Cannot be started. Ok. Genial. Ähm. Wunderbar, was kann man damit jetzt Schönes machen? Also Add Roles. Was ist denn jetzt neu? Ich muss jetzt erstmal gucken, was ist denn eigentlich neu?"}, {"id": 321, "start": 3068.52, "end": 3087.08, "text": "Windows 2230. What's New? Wir müssen ja was Neues machen. Jetzt haben wir uns nämlich... Ist das auch das letzte was wir uns angeguckt haben? What's New?"}, {"id": 322, "start": 3087.08, "end": 3103.08, "text": "What's New? Ok, dann wir gucken, was Microsoft sagt. Das ist mir zu Microsoft-isch. Gibt es eine gute WinFuture? Die Seite klingt schon nach Windows."}, {"id": 323, "start": 3103.08, "end": 3118.04, "text": "Du solltest unbedingt Updates installieren. Stimmt. Updates. Updates. Check Updates. Wie würde man eigentlich Updates checken von der Kommandozeile? Geht das überhaupt?"}, {"id": 324, "start": 3118.04, "end": 3135.64, "text": "Kann man Updates machen? Irgendwie über PowerShell oder so? Oh. Da geht was. Erstmal updaten lassen. Ok, in der Zeit können wir gucken, what's new."}, {"id": 325, "start": 3135.64, "end": 3153.64, "text": "Also. Konsequente Weiterentwicklung, aber auch Vereinfachung. Das enthält Sicherheitsfeatures, Hybridfunktion, Verbindung mit Azure, blablabla. Microsoft Container. Microsoft Container ist ja im Prinzip nur VM, was in einer VM nicht sonderlichsinnig ist."}, {"id": 326, "start": 3153.64, "end": 3177.64, "text": "Windows Server hat neue Sicherheits. Wie das war's? Can't wait. Muss doch ordentlich ein Artikel. Reddit. Reddit. Reddit hat bestimmt Ahnung. What's New? Reddit. Reddit. Zeitschirr. Blogpost."}, {"id": 327, "start": 3177.64, "end": 3189.64, "text": "Ich will doch einfach nur für Leute, die keine Ahnung haben, eine Erklärung, was denn jetzt tolles Neues dabei ist. Kann doch nicht sein."}, {"id": 328, "start": 3189.64, "end": 3214.64, "text": "What's New? Äh. Tja. Ähm. Altaro. Mal gucken. Hoffentlich ist keine GBay-Zeite. Die haben einfach den Gramm kopiert von Microsoft. Das Admin-Center. Ok. Ist das Admin-Center?"}, {"id": 329, "start": 3214.64, "end": 3241.64, "text": "Ist das so ne. So ne Art. Und das nennen so ne Web. So ne Art Web GUI, wo man mehrere Windows, so ne Windows Dashboard-Management-UI, also sprich man hat 20 Windows Server und kann dann darüber die wichtigsten Funktionen zugreifen."}, {"id": 330, "start": 3241.64, "end": 3257.64, "text": "Das wäre tatsächlich sogar ganz sinnvoll. Ist quasi wie bei Azure. Ja gut, nur bisschen übersichtlicher. Azure ist ja wirklich undurchsichtig als Fuck. Ok. TPM. Juckt mich gar nicht. Virtualization Based Security. Ja. Meinetwegen."}, {"id": 331, "start": 3257.64, "end": 3275.64, "text": "Control Flow and System Guard. Das juckt mich jetzt auch nicht. Memory Protection. Ok. Das heißt im Prinzip gibt's da für mich jetzt nicht wirklich spannendes Zeug, oder?"}, {"id": 332, "start": 3275.64, "end": 3295.64, "text": "Ah guck mal, das ist normal, dass da ein Service nicht läuft. Das anscheinend, anscheinend muss das so sein."}, {"id": 333, "start": 3295.64, "end": 3317.64, "text": "Was ich bei diesen Microsoft Anwendungen halt immer, was mir da direkt ins Auge springt, wie fummelig. Fummelig ist das richtige Wort. Wie fummelig alles ist. Das liegt aber bestimmt auch daran, weil ich es nicht gewohnt bin. Aber es macht immer alles einen sehr zusammengestökelten und fummeligen Eindruck."}, {"id": 334, "start": 3317.64, "end": 3338.64, "text": "So. Aha. Networking Improvements. Ist das nicht das neue TCP? Ist das nicht, wo sie versuchen TCP mit abzulösen, was sie wahrscheinlich nie schaffen werden?"}, {"id": 335, "start": 3338.64, "end": 3356.64, "text": "Features. Oh, das machen wir jetzt. Ok, dann versuche ich jetzt mal das hinzubekommen, was ich machen will. Statische HTML-Seite. Hello World HTML-Seite ausliefern. Hyper-V. Conclusion. Alles klar. Ok, also."}, {"id": 336, "start": 3356.64, "end": 3374.64, "text": "Was sonst? Was sonst? Natürlich Restart."}, {"id": 337, "start": 3374.64, "end": 3390.64, "text": "Wie, da war noch nicht fertig? Warum stand da noch ein Restart da? Auch als Windows-Admin sucht man sich immer einen. Ja, wundert mich nicht. Ich meine, man muss sagen, das ist unter Linux auch alles andere als selbst erklären. Aber ich finde es trotzdem, dass es eine gradere Linie hat."}, {"id": 338, "start": 3390.64, "end": 3411.64, "text": "Gerade wenn man sowas wie, was macht der da jetzt eigentlich? Der Update Orchestrator Service. Gerade wenn man, sagen wir mal, hauptsächlich Ubuntu verwendet oder Red Hat verwendet und sich so in eine Richtung gewöhnt hat, da findet man sich normalerweise ziemlich gut zurecht."}, {"id": 339, "start": 3411.64, "end": 3424.64, "text": "Klar, wenn ich gucken will, wie konfiguriere ich Programm XY, muss ich mir die Seite von denen angucken. Aber ich komme damit zumindest deutlich einfacher klar. Gerade auch, dass man das ordentlich über SSH verwalten kann."}, {"id": 340, "start": 3424.64, "end": 3445.64, "text": "Gut, Samba-Config ist aber auch Paints-Champ. Wobei ich also ganz ehrlich, wenn ich einfach nur einen Windows-Share bereitstellen müsste, dann würde ich das trotzdem mit Linux machen und mich durch die Samba-Config kämpfen."}, {"id": 341, "start": 3445.64, "end": 3459.64, "text": "Mittlerweile ist die Samba-Config aber besser geworden. Du brauchst ja, also mittlerweile brauchst du nur noch 5 Zeilen oder so in der Samba-Config und es geht. Warum? Was ich nicht so genau verstehe ist, das, was macht der denn jetzt eigentlich?"}, {"id": 342, "start": 3459.64, "end": 3476.64, "text": "Der Shutdown in Update Orchestrator Service."}, {"id": 343, "start": 3476.64, "end": 3491.64, "text": "Ah, wie wäre es mit so einem Fortschrittsbalken oder so?"}, {"id": 344, "start": 3491.64, "end": 3509.64, "text": "Ja, also dann würde ich trotzdem einen Linux-Samba-Server hinstellen, wenn ich einfach nur Windows-Share machen muss. Mit AD gekoppelt sieht das Ganze vielleicht schon wieder ein bisschen anders aus. Aber trotzdem, ich glaube, AD wäre das einzige, wo ich freiwillig irgendeinen Windows hinstellen würde."}, {"id": 345, "start": 3509.64, "end": 3515.64, "text": "Okay, ich gehe mal kurz in den Chat gucken, bis du den Update installiert hast."}, {"id": 346, "start": 3515.64, "end": 3536.64, "text": "Nee, nee, nee, es gibt Sachen, die mache ich jetzt gar nicht. Ja, das stimmt. Wobei man sagen muss, wenn man sich ein bisschen dran gewöhnt hat, du musst unter Linux gar nicht mehr so viele Code-Snippets zusammen kopieren."}, {"id": 347, "start": 3536.64, "end": 3549.64, "text": "Also, vorausgehend hast du die Sachen halt schon ein paar Mal gemacht. Also, so die Basics-Sachen, die weiß man eigentlich nach einer Zeit. Es ist aber, wie gesagt, es ist unter Linux auch nicht alles Gold."}, {"id": 348, "start": 3549.64, "end": 3566.64, "text": "Also, dass zum Beispiel die ganzen Commando-Zeilen, Tools unter Linux alle unterschiedliche Vorstellungen haben, wie man die Parameter benennt. Ich sage nur Minus Minus Help, Minus H, Minus V, Minus Groß V, Minus Minus Version, Minus Version, was auch immer."}, {"id": 349, "start": 3566.64, "end": 3580.64, "text": "Die sind sich da auch nicht einig. Aber zumindest hat es irgendwie eine gewisse klare Linie. Aber gut, ich habe keine Ahnung von Windows. Vielleicht hat es das in Windows auch, aber ich bezweifle es."}, {"id": 350, "start": 3580.64, "end": 3596.64, "text": "Kurz auf Topic. Was ist die einfachste Möglichkeit, um eine ASP.NET Core Web App auf einem Linux Server zu... Du musst da nichts anderes tun, als unter Windows. Du baust das Ding, SCPsst es auf dem Linux Server und startest es."}, {"id": 351, "start": 3596.64, "end": 3605.64, "text": "Die einzige Sache, die du dich fragen musst, das musst du aber unter Windows auch machen. Hast du.NET auf dem Server installiert? Ja oder nein? Wenn du.NET auf dem Server installiert hast, ist es ganz einfach."}, {"id": 352, "start": 3605.64, "end": 3622.64, "text": "Hinkopieren,.NET Run, fertig. Wenn du es nicht auf dem Server installiert hast und nicht installieren willst, Self-Content Deployment, hinkopieren, ausführen. Du musst nichts machen. Das ist genau das gleiche, wie unter Windows. Sogar noch einfacher, weil du so Sachen wie SCP machen kannst und nicht bei SSH drauf einloggen."}, {"id": 353, "start": 3622.64, "end": 3636.64, "text": "So, Unlock. Er hat erneut gestartet. Mal gucken, ob er jetzt durch ist mit den Updates."}, {"id": 354, "start": 3636.64, "end": 3656.64, "text": "Schnell gucken. Ich glaube, ich habe sonst alles vorgelesen. Versuch jetzt bei Hetzener mal ein Kubernetes-Demo-Projekt. Jetzt? Nee. Jetzt nicht."}, {"id": 355, "start": 3656.64, "end": 3672.64, "text": "Docker unter Windows waren doch immer VMs. Docker unter Windows waren in der Vergangenheit immer Hyper-V VMs. Okay, vielleicht ist es jetzt anders."}, {"id": 356, "start": 3672.64, "end": 3687.64, "text": "Warum ist da überhaupt ein Webbrowser drauf? Warum ist da überhaupt ein kompletter Desktop drauf? Und auch wenn man sagt nur Terminal, warum ist dann trotzdem noch ein komplettes Windows? Jetzt ist halt Windows andere Philosophie. Die haben halt viele Wizards zum Durchklicken."}, {"id": 357, "start": 3687.64, "end": 3709.64, "text": "Die mögen das. Oh, jetzt sind wieder fünf Services kaputt. Warum reflechte er gerade nicht selbst? Okay, Edge geht standardmäßig auf. Excellent. So, Updates. Wie sieht es jetzt mit Updates aus? So, jetzt wird es gleich anstrengend."}, {"id": 358, "start": 3709.64, "end": 3718.64, "text": "Jetzt muss ich gleich ein IES installieren mit statischem HTML. Okay, ich lege mir schon mal ein HTML an, was ich rüber kopiere."}, {"id": 359, "start": 3718.64, "end": 3742.64, "text": "HTML. HTML. Okay. Jetzt wird es abgedreht. Okay, jetzt ist es fertig. Ich kopiere mir das mal kurz hier irgendwo hin. Warum habt ihr so ein Pictures-Folder?"}, {"id": 360, "start": 3742.64, "end": 3754.64, "text": "Okay, Index Punkt Punkt HTML. Oh nein, das ist doch nicht mal auf den IEM Server eingeschaltet, dass du standardmäßig Dateiendungen editieren kannst."}, {"id": 361, "start": 3754.64, "end": 3774.64, "text": "Das ist so fail. Ah, wo geht denn das noch mal? View? Filename Extensions. Ja, wer will sowas auch machen, ne? Okay, Index HTML, Pongas. Geht die? Jawoll. So, und die jetzt über den Web-Server ausliefern."}, {"id": 362, "start": 3774.64, "end": 3792.64, "text": "Jetzt, jetzt, jetzt können wir mal, jetzt kann ich auch meine richtigen Hardcore-Winner-Skills zeigen. Äh, welche Internetseite oder YouTube-Tutorials würdest du empfehlen, für HTML-CSS zu lernen?"}, {"id": 363, "start": 3792.64, "end": 3816.64, "text": "Gute Frage. Kann ich die jetzt gerade nicht beantworten? Ehe, W3-Skills zackt. Oh, Moment, wie installiere ich da jetzt was? Add Roles and Features."}, {"id": 364, "start": 3816.64, "end": 3834.64, "text": "Moment, ich muss gerade mal im Chat noch was beantworten. Zum ASP.NET Core Web App Deployment. Wie bekomme ich meine App mit HTTPS zum Laufen? Geht leider nur mit HTTPS. Hast du denn ein gültiges Zertifikat?"}, {"id": 365, "start": 3834.64, "end": 3856.64, "text": "Das einfachste ist, einen Reverse-Proxy davor zu machen. Was wir, by the way, übrigens, wenn du dir angucken willst, wie man ASP.NET Core Web Application deploys auf einem Linux-Server, warum bin ich da nicht früh drauf gekommen? Guck dir einfach, guck dir einfach den Stream von gestern an. Ja, magst halt die Klappe. Guck dir einfach den Stream von gestern an."}, {"id": 366, "start": 3856.64, "end": 3879.64, "text": "Server-Automatisierung plus Deployment C-Sharp-Web-Anwendung. Du kannst ein bisschen skippen. Viel Gelaber und du kannst dir das Git-Repo dazu angucken. Wo? Alter, wo? Lords. Und du kannst dir das passende Git-Repo dazu angucken, was sich nennt?"}, {"id": 367, "start": 3879.64, "end": 3900.64, "text": "CACW as a Service. Da ist die Web-Anwendung drin und die Ansible-Rolle zum Konfigurieren vom Server. Da siehst du alles, was du brauchst, um das wirklich schön zu machen mit der Web-Anwendung. Inklusive Unit-File und allem. Brauchst du aber nicht. Im Prinzip, du kannst einfach drauf kopieren und starten."}, {"id": 368, "start": 3900.64, "end": 3913.64, "text": "So, und wie du das mit HTTPS machst, das machen wir im nächsten Stream dazu. Das wird ein dreiteiliger Stream. Aber das einfachste ist, ein Reverse-Proxy zu nehmen, der für dich Let's Encrypt und HTTPS handelt."}, {"id": 369, "start": 3913.64, "end": 3933.64, "text": "Du lässt auf Localhost deine ASP.NET Core Web-Anwendung laufen. Einfach auf Localhost auf dem Server. Dann machst du ein Reverse-Proxy davor. Cutty ist am einfachsten, weil der hat alles eingebaut für simple Sachen. Du kannst aber auch jedes andere nehmen. Aber Cutty ist easy, weil das macht für dich auch Zertifikats-Handling und sowas."}, {"id": 370, "start": 3933.64, "end": 3948.64, "text": "Dann machst du ein Reverse-Proxy davor. Das sind drei Zeilen Konfig-Eintrag. Und dann macht das für dich Zertifikat und Reverse-Proxy auf deine Web-Anwendung. Nein. Können wir nicht. Können wir nicht."}, {"id": 371, "start": 3948.64, "end": 3968.64, "text": "Es gibt Sachen, die will ich schon alleine nicht machen. Aber zusammen, zusammen wäre glaube ich, also Windows Server und C++, also viel schlimmer geht es ja kaum noch. Ok, also Web Server installieren. Was will der von mir? Kann man eigentlich Dark Mode anmachen?"}, {"id": 372, "start": 3968.64, "end": 3989.64, "text": "Themes and Related. Kann man Windows Server unterwegs in Dark Theme machen?"}, {"id": 373, "start": 3989.64, "end": 4005.64, "text": "Geht das? High Contrast?"}, {"id": 374, "start": 4005.64, "end": 4020.64, "text": "Ok, das sieht kacke aus."}, {"id": 375, "start": 4020.64, "end": 4046.64, "text": "Wait a minute. Warum ist das nicht unter Themes? Warum ist das unter Colors? Das fällt mir ja jetzt erst auf. Überall anders ist das Dark Light Theme und unter Windows in Themes was anderes und Colors. What the fuck?"}, {"id": 376, "start": 4046.64, "end": 4054.64, "text": "Ok, nein das geht nicht. Die Windows Anwendungen sind nicht agil genug. Die können kein Dark Theme."}, {"id": 377, "start": 4054.64, "end": 4061.64, "text": "Da sieht man was für krass zusammengestückelter Kram. Das ist der Wahnsinn. Ok, also was will das denn von mir?"}, {"id": 378, "start": 4061.64, "end": 4077.64, "text": "Natürlich hat das was. Selbstverständlich. Möchte mir Windows in irgendeiner Art und Weise unterstellen. Ich hätte kein gutes Passwort."}, {"id": 379, "start": 4077.64, "end": 4103.64, "text": "Das ist das beste Passwort. Best Practice Passwort. Ok, wir können jetzt folgendes machen."}, {"id": 380, "start": 4103.64, "end": 4118.64, "text": "Nein, ich will keine Rollback. Ich glaube an der Stelle mache ich mal einen Snapshot."}, {"id": 381, "start": 4118.64, "end": 4135.64, "text": "Was soll mir dieser Snapshot Name sagen? Huge? Was? Chrome? Das soll Chrome heißen."}, {"id": 382, "start": 4135.64, "end": 4149.64, "text": "Huge Chrome Install. Aber selber auswartet er. Den Snapshot muss ich löschen. Das frisst total viel Disk."}, {"id": 383, "start": 4149.64, "end": 4169.64, "text": "Huge Chrome Install muss ich löschen. Der zweite Punkt ist nur für VDI Zeugs."}, {"id": 384, "start": 4169.64, "end": 4183.64, "text": "Das hätte ich nicht gedacht, dass es so lange dauert. Ja, Virtual Box ist Paying Champ. Ganz ehrlich, wenn man gerade auf dem Desktop viele VMs handelt, lohnt sich Forever Workstation wirklich."}, {"id": 385, "start": 4183.64, "end": 4199.64, "text": "Und es kostet dem Key Shop ja auch nicht so viel. Wie viel kostet Server 22? Ich habe ehrlich gesagt keine Ahnung. Wir können mal gucken. Windows Server 2019. Standard. Das kostet so eine Lizenz."}, {"id": 386, "start": 4199.64, "end": 4217.64, "text": "150 kriegt man bestimmt deutlich billiger bei irgendwelchen Key Shops. Ihr könnt euch eure Forever Keys holen wo ihr wollt solange sie nicht bei mir aus dem Chat holen."}, {"id": 387, "start": 4217.64, "end": 4230.64, "text": "Direkt Timeout wenn ich irgendjemand Keys postet. Aber wie gesagt, Forever Workstation auf dem Desktop ist schon das beste was du malen kannst."}, {"id": 388, "start": 4230.64, "end": 4241.64, "text": "Wieso benutzt man Windows Server? Ja das frage ich mich auch. Residenz Leaper. Wir werden gleich feststellen wie man eine statische HTML Seite hostet."}, {"id": 389, "start": 4241.64, "end": 4255.64, "text": "Ich sehe jetzt schon kommen, dass es richtig Pains Champ wird."}, {"id": 390, "start": 4255.64, "end": 4262.64, "text": "Ja das ist natürlich auch ein guter Punkt. Wenn man dafür Geld bekommt für Windows Server, dann warum sollte man nicht Windows Server nehmen?"}, {"id": 391, "start": 4262.64, "end": 4270.64, "text": "Ich meine ich würde selbst für Geld kein Windows Server administrieren. Das stimmt nicht. Es kommt natürlich auf die Menge des Geldes an."}, {"id": 392, "start": 4270.64, "end": 4281.64, "text": "Aber wenn mich einer als unerfahrenen Nullplan Windows Admin einstellen will für das doppelte von dem was wir jetzt verdienen, dann würde ich das machen."}, {"id": 393, "start": 4281.64, "end": 4295.64, "text": "Aber wahrscheinlich nicht lang, denn Windows ist so Pains Champig."}, {"id": 394, "start": 4295.64, "end": 4302.64, "text": "Ja ich wollte gerade sagen, die sollen wir einfach. Jetzt mach hin vor MWR. Komm hopp hopp."}, {"id": 395, "start": 4302.64, "end": 4313.64, "text": "Ach guck mal das Fenster geht schnell, das andere nicht."}, {"id": 396, "start": 4313.64, "end": 4330.64, "text": "2018 doch viel zu modern. Also wenn schon richtig alt. Was ist denn das erste Windows Server was es gab? NT? NT 3.1 oder sowas?"}, {"id": 397, "start": 4330.64, "end": 4338.64, "text": "Oder NT 3.5? Was sind das erste Server Windows was es gegeben hat?"}, {"id": 398, "start": 4338.64, "end": 4348.64, "text": "Also bei uns ist 2003 das älteste. Das stimmt, das stimmt. Was älteres habe ich bei uns auf der Arbeit auch noch nicht gesehen."}, {"id": 399, "start": 4348.64, "end": 4358.64, "text": "Windows 2000 Server. Ja ab dann, ich glaube ab da heißen die Windows Server. Aber im Prinzip war es ja schon seit NT so."}, {"id": 400, "start": 4358.64, "end": 4369.64, "text": "NT 3.1 Advanced Server, das kann sein ja. Advanced Server bitteschön. Advanced."}, {"id": 401, "start": 4369.64, "end": 4378.64, "text": "Ne das weiß ich von damals nicht. Ich hatte damals mit Windows Server überhaupt nichts am Hut."}, {"id": 402, "start": 4378.64, "end": 4389.64, "text": "Also wir haben keine 2003 Server mehr. Also sagen unsere Windows Leute, vielleicht sagen sie es auch nur offiziell, dass Security Leute nicht amok laufen."}, {"id": 403, "start": 4389.64, "end": 4399.64, "text": "Ich glaube das älteste was wir haben mittlerweile ist 2000. Es könnte dann auch 2008 ergibt. Aber ich glaube das meiste ist 2012."}, {"id": 404, "start": 4399.64, "end": 4413.64, "text": "Was gibt es denn? Wie war die Windows Server Reihenfolge? 2008, 2012, 2016 und jetzt 2022. Oder gab es noch was zwischen 2016 und?"}, {"id": 405, "start": 4413.64, "end": 4429.64, "text": "Ach 2019 gab es noch. Okay. Meine Güte VMWare. Komm lass mich mal nicht so bitten. Ich meine du bist auf einer SSD. Auf einer NVMe SSD. Hast 8 CPU Kerne. Mach mal."}, {"id": 406, "start": 4429.64, "end": 4454.64, "text": "Ne 6 CPU Kerne. Stimmt gar nicht. Viel Slack man. Genau."}, {"id": 407, "start": 4454.64, "end": 4464.64, "text": "Ist das eigentlich bei Windows 2012? Weil du sagst es ist wie Windows 8. Haben die da auch ein Kachelmenü auf dem Server? Ernsthaft? Wirklich? Also ist das so?"}, {"id": 408, "start": 4464.64, "end": 4479.64, "text": "Wenn du 2012 Server installierst hast du da ein Kachelmenü wenn du Windows. Ja wirklich?"}, {"id": 409, "start": 4479.64, "end": 4492.64, "text": "Das ist ja Fail. Okay endlich. Okay. Web Server. Server from Pool. Jawoll. Den hier. Hui. Hui. Was kann man da alles inszenen?"}, {"id": 410, "start": 4492.64, "end": 4503.64, "text": "DNS, DHCP, Fax. Ganz wichtig. Gerade für deutsche Behörden. Die haben wahrscheinlich noch die größte Anzahl an Fax Server am Start."}, {"id": 411, "start": 4503.64, "end": 4523.64, "text": "EES. Include Management. Jawoll. Okay was haben wir sonst noch? Remote Desktop Services. Network. File and Storage. Okay next."}, {"id": 412, "start": 4523.64, "end": 4539.64, "text": "Wie muss ich dort net framework installieren? Ist da EES? WCF Alter. Das gibt es das überhaupt noch?"}, {"id": 413, "start": 4539.64, "end": 4553.64, "text": "Dazu kann ich nur sagen. WCF das ist doch irgendein XML basiertes Kommunikations-API Zeugs von sonst wann."}, {"id": 414, "start": 4553.64, "end": 4564.64, "text": "Ich weiß gar nicht mehr genau was es ist. Irgendwas XML basiertes auf jeden Fall. Kann ich euch ernst sein?"}, {"id": 415, "start": 4564.64, "end": 4573.64, "text": "Okay was brauche ich hier für normales Hosten von statischen Webseiten?"}, {"id": 416, "start": 4573.64, "end": 4580.64, "text": "Gar nichts. Einfach Next. Bam."}, {"id": 417, "start": 4580.64, "end": 4598.64, "text": "Hier. Genau das will ich. Okay es wird noch advanceder. Common HTTP Features. Das brauche ich."}, {"id": 418, "start": 4598.64, "end": 4610.64, "text": "Request File. Gibt es eigentlich irgendeinen sinnvollen Grund EES zu verwenden? Jetzt ernst. Kein Microsoft Page. Gibt es einen sinnvollen Grund?"}, {"id": 419, "start": 4610.64, "end": 4617.64, "text": "Wenn ich eine ASP.NET Web Anwendung habe dann hat die einen eigenen Web Server dabei."}, {"id": 420, "start": 4617.64, "end": 4629.64, "text": "Und für alles andere kann ich doch unter Windows auch irgendeinen ordentlichen Web Server installieren oder? Ah für FTP. Gibt es Engine X für Windows?"}, {"id": 421, "start": 4629.64, "end": 4639.64, "text": "Also Apache gibt es definitiv für Windows. Gibt es einen Engine X für Windows?"}, {"id": 422, "start": 4639.64, "end": 4649.64, "text": "Okay sieht äußerst gepflegt aus die Seite."}, {"id": 423, "start": 4649.64, "end": 4660.64, "text": "Also wenn ich, wisst ihr was ich machen würde? Wenn ich unter Windows den Web Server laufen lassen müsste, dann würde ich WSL installieren und dort mir den Web Server drauf machen."}, {"id": 424, "start": 4660.64, "end": 4670.64, "text": "Okay. Next. Install. Auf gehts. Gib mir EES. Gap her."}, {"id": 425, "start": 4690.64, "end": 4703.64, "text": "Was macht der da eigentlich so lang?"}, {"id": 426, "start": 4703.64, "end": 4711.64, "text": "Was macht der da eigentlich so lang?"}, {"id": 427, "start": 4711.64, "end": 4722.64, "text": "Aber sagen wir so Anzeigen was er macht habe ich jetzt schon gelernt scheint prinzipiell overrated zu sein. Successful. Okay."}, {"id": 428, "start": 4722.64, "end": 4727.64, "text": "Aber wohl doch noch nicht ganz successful."}, {"id": 429, "start": 4727.64, "end": 4731.64, "text": "Oder muss ich auf Close drücken?"}, {"id": 430, "start": 4731.64, "end": 4739.64, "text": "Muss ich auf Close drücken?"}, {"id": 431, "start": 4739.64, "end": 4747.64, "text": "Services. So und jetzt ist die große Frage wie verwalte ich EES hier da drüber?"}, {"id": 432, "start": 4747.64, "end": 4757.64, "text": "Oh das sieht ja mal. Oh sieht das advanced aus. Windows XP Zeiten. Perfekt. Endlich mal was was mir optisch gefällt."}, {"id": 433, "start": 4757.64, "end": 4763.64, "text": "Geht das da rüber oder kann man auch hier ach ne hier ist auch EES drinne guck mal."}, {"id": 434, "start": 4763.64, "end": 4768.64, "text": "Aber warum gibt es da zwei Sachen jetzt?"}, {"id": 435, "start": 4768.64, "end": 4774.64, "text": "Boah das ist so fummelig alles. So krass fummelig."}, {"id": 436, "start": 4774.64, "end": 4783.64, "text": "Kann man hier drüber was machen oder sind das nur Logs?"}, {"id": 437, "start": 4783.64, "end": 4791.64, "text": "Das hier sind nur Logs ne da kann man nichts machen. Manage."}, {"id": 438, "start": 4791.64, "end": 4795.64, "text": "Kann man die Tools hier drüber aufmachen? Hier."}, {"id": 439, "start": 4795.64, "end": 4801.64, "text": "Okay das ist wirklich das richtige Tool was ich hier hab."}, {"id": 440, "start": 4801.64, "end": 4808.64, "text": "Das ist ja hier sind ja die verschiedenen Zeiten von Windows noch deutlicher sichtbar als auf dem Desktop."}, {"id": 441, "start": 4808.64, "end": 4815.64, "text": "Auf dem Desktop hast du ja schon aus 20, 30 Jahren Windows alles drinne."}, {"id": 442, "start": 4815.64, "end": 4821.64, "text": "Aber das Ding hier schießt jetzt ja nochmal den Vogel ab. Ich mein das ist wirklich straight aus Windows XP hier oben."}, {"id": 443, "start": 4821.64, "end": 4825.64, "text": "Das siehst du an dem grünen Flech das ist straight aus Windows XP."}, {"id": 444, "start": 4825.64, "end": 4829.64, "text": "Was ich nicht schlecht finde."}, {"id": 445, "start": 4829.64, "end": 4834.64, "text": "Application Pool Sites. Default Website. Wo muss ich die hinkopieren?"}, {"id": 446, "start": 4834.64, "end": 4839.64, "text": "Unter Linux wäre es war www.html oder zumindest unter Ubuntu und Demian."}, {"id": 447, "start": 4839.64, "end": 4845.64, "text": "Nichts sagen Chat. Explore. Guck mal hier Explore."}, {"id": 448, "start": 4845.64, "end": 4851.64, "text": "Inetpupp. www.route. Okay das heißt wenn ich jetzt Local Host mache."}, {"id": 449, "start": 4851.64, "end": 4859.64, "text": "Local Host."}, {"id": 450, "start": 4859.64, "end": 4867.64, "text": "Es läuft Leute. Okay kann ich dies auch extern auflösen? Also hier 1221682.133."}, {"id": 451, "start": 4867.64, "end": 4874.64, "text": "Massive."}, {"id": 452, "start": 4874.64, "end": 4876.64, "text": "Wo komme ich denn da jetzt raus?"}, {"id": 453, "start": 4876.64, "end": 4884.64, "text": "Ich meine schöne Startseite ist es nicht. Aber immer noch nicht so shab wie die Caddy Default Seite."}, {"id": 454, "start": 4884.64, "end": 4891.64, "text": "Kennt ihr mal die Caddy Default Page? Die ist wirklich schräg."}, {"id": 455, "start": 4891.64, "end": 4901.64, "text": "Im wahrsten Sinne des Wortes. So sieht die Caddy Default Seite aus. Die ist absichtlich schräg."}, {"id": 456, "start": 4901.64, "end": 4907.64, "text": "Okay wir haben jetzt hier IES am Start. So das heißt wenn ich da."}, {"id": 457, "start": 4907.64, "end": 4916.64, "text": "Moment Moment. Wo ist denn überhaupt die Seite die ausgeliefert wird?"}, {"id": 458, "start": 4916.64, "end": 4920.64, "text": "Ist die das?"}, {"id": 459, "start": 4920.64, "end": 4930.64, "text": "Erstmal Paint als Image. Das ist die. Aber warum heißt die IES Start und nicht Index?"}, {"id": 460, "start": 4930.64, "end": 4939.64, "text": "Woher weiß der dass er das bei einem Index aufmachen soll? Ist das hier irgendwie in der Default Seite konfiguriert?"}, {"id": 461, "start": 4939.64, "end": 4947.64, "text": "Ah weil es nur eine Seite gibt. Das heißt wenn nur eine Seite drin liegt dann nimmt er immer die."}, {"id": 462, "start": 4947.64, "end": 4956.64, "text": "Solange kein Index drin ist. Okay das probieren wir jetzt mal aus. Index HTML. Copy."}, {"id": 463, "start": 4956.64, "end": 4965.64, "text": "Tatsächlich. Big Brain Windows."}, {"id": 464, "start": 4965.64, "end": 4970.64, "text": "Da sind wir."}, {"id": 465, "start": 4970.64, "end": 4979.64, "text": "Okay das war muss ich zugeben einfacher als ich gedacht habe."}, {"id": 466, "start": 4979.64, "end": 4986.64, "text": "Zwar immer noch ein bisschen Paint Champing aber jetzt kann man wahrscheinlich löschen den Kram hier. Hallo? Löschen?"}, {"id": 467, "start": 4986.64, "end": 4990.64, "text": "Hallo? Löschen?"}, {"id": 468, "start": 4990.64, "end": 5001.64, "text": "Entf. Entf gibt es nicht. Delete. Okay. Entf ist Disabled in der unteren Windows Server."}, {"id": 469, "start": 5001.64, "end": 5009.64, "text": "Okay wunderbar. Das ging jetzt echt einfacher als ich gedacht habe muss ich sagen."}, {"id": 470, "start": 5009.64, "end": 5021.64, "text": "Kann IES Let's Encrypt Zertifikate? Das muss ich jetzt nachgucken. IES Let's Encrypt bestimmt nicht oder?"}, {"id": 471, "start": 5021.64, "end": 5031.64, "text": "Also ich mein selbstständig auswählen. Selbstständig ausstellen."}, {"id": 472, "start": 5031.64, "end": 5037.64, "text": "Dass man die irgendwo hin kopieren kann und nicht out of the box. Okay das war klar."}, {"id": 473, "start": 5037.64, "end": 5052.64, "text": "Installieren eines Zertifikats IES. Ja."}, {"id": 474, "start": 5052.64, "end": 5059.64, "text": "Das mache ich jetzt nicht. Das mache ich jetzt nicht."}, {"id": 475, "start": 5059.64, "end": 5069.64, "text": "Okay ich soll mal einen Virtual Host anlegen. Probieren wir mal aus. Hier. Add Website wahrscheinlich. Switch to Content View. Was passiert da?"}, {"id": 476, "start": 5069.64, "end": 5077.64, "text": "Switch to Feature View? Hä?"}, {"id": 477, "start": 5077.64, "end": 5082.64, "text": "Was ist da jetzt der Unterschied?"}, {"id": 478, "start": 5082.64, "end": 5092.64, "text": "Also hä? Das stimmt doch überhaupt nicht Microsoft. Das stimmt doch überhaupt nicht."}, {"id": 479, "start": 5092.64, "end": 5098.64, "text": "Ah ah F5. F5 muss man drücken. Okay. Okay neue Seite. Add Website."}, {"id": 480, "start": 5098.64, "end": 5108.64, "text": "Sidename. Genau. Hackw.local. Da muss ich halt Hausdatei überschreiben."}, {"id": 481, "start": 5108.64, "end": 5116.64, "text": "Es gibt Third-Party Zeug für den Web Server welcher Let's Encrypt kann. Ja du kannst Third-Port oder sowas nehmen."}, {"id": 482, "start": 5116.64, "end": 5122.64, "text": "Pass-Throughout. Naja das ist doch halbwegs überschaubar. Es sieht zwar aus wie von 1995 aber es funktioniert."}, {"id": 483, "start": 5122.64, "end": 5132.64, "text": "Gibst den Domain Namen ein. Dann sagst du wo die Dateien liegen."}, {"id": 484, "start": 5132.64, "end": 5142.64, "text": "Connect As. Was auch immer. Und dann an welchem Interface er binden soll."}, {"id": 485, "start": 5142.64, "end": 5153.64, "text": "Ja das klingt doch irgendwie nachvollziehbar alles. Nur das Interface ist wirklich straight aus Windows XP."}, {"id": 486, "start": 5153.64, "end": 5157.64, "text": "Aber wenigstens verwenden sie nicht mehr diese komische eingebaute Windows Hilfe."}, {"id": 487, "start": 5157.64, "end": 5163.64, "text": "So naja ihr habt es auch gesehen die Seite ist von 2012 hier guckt. So 2012."}, {"id": 488, "start": 5163.64, "end": 5172.64, "text": "Nicht mehr diese komische eingebaute Windows Hilfe. Wobei. Wait a minute."}, {"id": 489, "start": 5172.64, "end": 5180.64, "text": "Ne ne machen sie tatsächlich nicht. Alles klar okay. Das war wirklich einfacher als ich gedacht hab."}, {"id": 490, "start": 5180.64, "end": 5188.64, "text": "Was diese Übersicht jetzt bringen soll verstehe ich nicht. Ich glaube das ist so eine Art Logs. Log Ausgabe oder so."}, {"id": 491, "start": 5188.64, "end": 5195.64, "text": "Kann ich jetzt nicht wirklich was rein interpretieren."}, {"id": 492, "start": 5195.64, "end": 5200.64, "text": "Okay was haben wir denn als nächstes. Kann man WSL installieren. Das interessiert mich jetzt noch."}, {"id": 493, "start": 5200.64, "end": 5214.64, "text": "Kann ich sagen WSL minus minus install. Wie das geht. Einfach so."}, {"id": 494, "start": 5214.64, "end": 5223.64, "text": "Einfach so. Okay das ist neu. Das ging garantiert noch nicht unter Windows 2019."}, {"id": 495, "start": 5223.64, "end": 5230.64, "text": "Und jetzt WDS aufsetzen. Was ist WDS. Windows Desktop Service. Geraten."}, {"id": 496, "start": 5230.64, "end": 5233.64, "text": "Das ersten Sachen die ich mir den Buchstaben lieber einfallen. So."}, {"id": 497, "start": 5233.64, "end": 5254.64, "text": "Chubantu ist drauf. Wie starte ich denn das jetzt Ubuntu."}, {"id": 498, "start": 5254.64, "end": 5261.64, "text": "Reboot. Na natürlich. Ups. Wie rebootet man eigentlich von der von der Konsole bei Windows."}, {"id": 499, "start": 5261.64, "end": 5271.64, "text": "Moment mal. Ich weiß es. Shutdown. Ne. Doch Shutdown. Ach Tab Completion."}, {"id": 500, "start": 5271.64, "end": 5276.64, "text": "Ich kacke. Natürlich gibt es keine Tab Completion. Was. Wir sind ja unter Windows."}, {"id": 501, "start": 5276.64, "end": 5286.64, "text": "Warte mal. Powershell. Powershell Tab Completion. Shutdown. Oder was. Stop. Computer."}, {"id": 502, "start": 5286.64, "end": 5296.64, "text": "Gibt es auch Restart Computer. Guck mal da. Big Brain Windows Time."}, {"id": 503, "start": 5296.64, "end": 5307.64, "text": "Massive Sixhead. Powershell Beste. Naja Beste würde ich nicht sagen."}, {"id": 504, "start": 5307.64, "end": 5311.64, "text": "Powershell finde ich. Meine persönliche Meinung ist Powershell ist eine super"}, {"id": 505, "start": 5311.64, "end": 5333.64, "text": "Scripting und Automatisierung Sprache Umgebung aber keine wirklich angenehme interaktive Shell."}, {"id": 506, "start": 5333.64, "end": 5340.64, "text": "Ja es riecht ganz gut. Man kann ja Powershell mittlerweile auch unter Linux installieren."}, {"id": 507, "start": 5340.64, "end": 5345.64, "text": "Ich kenne niemand der das macht. Aber es geht. Gut ich meine man kann Microsoft SQL"}, {"id": 508, "start": 5345.64, "end": 5350.64, "text": "mittlerweile auch unter Linux installieren. Ich kenne auch niemand der das macht."}, {"id": 509, "start": 5350.64, "end": 5362.64, "text": "Kennt ihr jemand der das macht. Baldios das verstehe ich. Ja. Warum ist es. Warum ist es"}, {"id": 510, "start": 5362.64, "end": 5366.64, "text": "Stop Computer Restart Computer nicht Computer Stop Computer Restart. Das ist richtig"}, {"id": 511, "start": 5366.64, "end": 5370.64, "text": "bescheuert weil so könnte man mit Computer und Tab Tab sich lang hangeln wenn man die"}, {"id": 512, "start": 5370.64, "end": 5375.64, "text": "anderen Befehle nicht weiß. Ja es ist richtig hängen geblieben dass das Restart Computer"}, {"id": 513, "start": 5375.64, "end": 5384.64, "text": "und Stop Computer ist anstatt Computer Restart."}, {"id": 514, "start": 5384.64, "end": 5397.64, "text": "Ups. Powershell ist immer Verb Noun dann ist Powershell immer Low Brain. Was hat denn der."}, {"id": 515, "start": 5397.64, "end": 5404.64, "text": "Was kann man da sonst so auswählen. Oh ne das war zu schnell. Ich war. Ich war ich habe"}, {"id": 516, "start": 5404.64, "end": 5410.64, "text": "zu schnell geklickt. Da kann man nicht erwarten dass es geht. Passwort ist zu schwer."}, {"id": 517, "start": 5410.64, "end": 5415.64, "text": "Ne ne Domäne aufsetzen mache ich jetzt gar garantiert nicht. Das ist auch was ganz ehrlich"}, {"id": 518, "start": 5415.64, "end": 5422.64, "text": "das würde ich im Leben nicht machen. Also da müssten sie mir wirklich sehr sehr sehr"}, {"id": 519, "start": 5422.64, "end": 5428.64, "text": "viel Geld bezahlen dass ich Windows AD administrieren würde freiwillig. Also würden sie nicht"}, {"id": 520, "start": 5428.64, "end": 5432.64, "text": "weil ich keine Ahnung davon habe."}, {"id": 521, "start": 5432.64, "end": 5443.64, "text": "Vsus sus. Vsus ist Windows Update Service oder. Lokales lokales Update Zeug. Das sagt mir"}, {"id": 522, "start": 5443.64, "end": 5454.64, "text": "zumindest vom Name her was. Broken by Default. Du weißt Broken by Design. Ja das scheint"}, {"id": 523, "start": 5454.64, "end": 5460.64, "text": "mir hier einiges zu sein. Installing. This take a few minutes. Ja dann take immer a few"}, {"id": 524, "start": 5460.64, "end": 5464.64, "text": "minutes. Das triggert mich auch warum warum warum refrecht sich das hier im Hintergrund"}, {"id": 525, "start": 5464.64, "end": 5476.64, "text": "nicht. Ah jetzt ist wirklich broken. Jetzt ist wirklich irgendwas kaputt. Also Enter"}, {"id": 526, "start": 5476.64, "end": 5498.64, "text": "Name. Max. Oops. Big Plane Passwort. Passwort. Try again yes. Zu schweres Passwort. Ok WSL"}, {"id": 527, "start": 5498.64, "end": 5505.64, "text": "gedürnt läuft wenigstens ordentlich. Ich habe mir sagen lassen das Windows mittlerweile"}, {"id": 528, "start": 5505.64, "end": 5510.64, "text": "ein SSH Server mitbringt. Kann das sein oder bringe ich das durcheinander oder was ein"}, {"id": 529, "start": 5510.64, "end": 5520.64, "text": "SSH Client in Windows mitbringt. Add roles features. Installation Type. Yes. Ja wir installieren"}, {"id": 530, "start": 5520.64, "end": 5537.64, "text": "jetzt den SSH Server. Features. SSH. Wo ist der denn. Secure Shell oder so. Open SSH."}, {"id": 531, "start": 5537.64, "end": 5558.64, "text": "Mit O gibt es hier gar nichts. Was Einstellungen Apps. Was das ist in den Windows. Moment jetzt"}, {"id": 532, "start": 5558.64, "end": 5571.64, "text": "meine Settings sind kaputt. Meine Settings sind irgendwie broken. SSH. Nee. Was. Ok Leute"}, {"id": 533, "start": 5571.64, "end": 5581.64, "text": "jetzt müsst ihr mir genau erklären. Add remove features. Da drüber. Features. Das da. Das"}, {"id": 534, "start": 5581.64, "end": 5602.64, "text": "da meint ihr. Optional Features. Optional Features. SSH. Nee Client. Client. Add Features. SSH."}, {"id": 535, "start": 5602.64, "end": 5609.64, "text": "Jetzt nicht ernsthaft oder. Warum ist das hier nicht in einem Server Feature Selector."}, {"id": 536, "start": 5609.64, "end": 5618.64, "text": "Warum ist das da. Hä. Wer hat sich. Welcher Big Brain Mensch bei Microsoft hat sich das"}, {"id": 537, "start": 5618.64, "end": 5629.64, "text": "denn ausgedacht. Also konsistent ist das ja nun wirklich gar nicht. Kannst du mal Remote"}, {"id": 538, "start": 5629.64, "end": 5633.64, "text": "Desktop Dienste installieren und dann mal checken ob der Webclient mittlerweile unter"}, {"id": 539, "start": 5633.64, "end": 5641.64, "text": "Linux läuft. Ja kann ich machen. Wenn du mir sagst wo das. Wo das. Wo das geht. Ach das"}, {"id": 540, "start": 5641.64, "end": 5653.64, "text": "ist ein Windows 10 Feature. Ok das ist wirklich riesen Flickenteppich das Teil. Remote Desktop"}, {"id": 541, "start": 5653.64, "end": 5657.64, "text": "Dienste installieren und dann mal checken ob der Webclient mittlerweile auf Linux läuft."}, {"id": 542, "start": 5657.64, "end": 5663.64, "text": "Ok wie mache ich das jetzt. Sag ich dann hier Remote Desktop Services Installation. Das"}, {"id": 543, "start": 5663.64, "end": 5675.64, "text": "weiß ich ob ich das machen will. Das ist bestimmt zu zu Big Brain für mich. Das kann"}, {"id": 544, "start": 5675.64, "end": 5683.64, "text": "er sich einfach so machen. Oh Leute Leute der Chat ist wieder. Der Chat ist wieder massive"}, {"id": 545, "start": 5683.64, "end": 5703.64, "text": "dabei. Der Chat. Windows. Pass auf hier. Windows. Capability. Online. Name. Ich weiß nicht"}, {"id": 546, "start": 5703.64, "end": 5721.64, "text": "was ich da mache aber ich sag einfach der Chat. Name. Open. SSH. Punkt. Server. Tilde"}, {"id": 547, "start": 5721.64, "end": 5734.64, "text": "Tilde Tilde Tilde 0010. Ne warum. Das muss auch so funktionieren. XOXOXO. Es scheint"}, {"id": 548, "start": 5734.64, "end": 5746.64, "text": "zu installieren. Dieser Fortschrittsball ist richtig advanced. Online True. Restart needed"}, {"id": 549, "start": 5746.64, "end": 5758.64, "text": "controls. Und das läuft das jetzt. Haben wir sowas wie ein Netzstat. Sehe ich da. Sehe"}, {"id": 550, "start": 5758.64, "end": 5773.64, "text": "ich da. Sehe ich da. SSH. Ach du Scheiße. Wie ist denn das richtige. AN. Läuft dann"}, {"id": 551, "start": 5773.64, "end": 5778.64, "text": "SSH. Das ist bestimmt ein Service den man starten muss. Warum schaust du dir sowas an."}, {"id": 552, "start": 5778.64, "end": 5787.64, "text": "Das. Ich weiß. Gute Frage. Nächste Frage hier. Starten. Open SSH Server. Haben wir"}, {"id": 553, "start": 5787.64, "end": 5794.64, "text": "den richtig echten Windows SSH Server laufen. 22 tatsächlich. Ok. Gleich mal testen ob"}, {"id": 554, "start": 5794.64, "end": 5804.64, "text": "das funktioniert. Poggers VM starten. Testen wir mal. Massive Windows SSH und da gucken"}, {"id": 555, "start": 5804.64, "end": 5813.64, "text": "wir da drüber dann WSL gestartet kriegen. Zaubern wir mal. Ich meine damit hat man zumindest"}, {"id": 556, "start": 5813.64, "end": 5818.64, "text": "die Chance seinen Windows Server ordentlich remote zu administrieren. Das ist doch eigentlich"}, {"id": 557, "start": 5818.64, "end": 5828.64, "text": "ist doch eigentlich eine gute gute Sache. SSH 1 2 1 2 1 2 1 3 3. Bäm. Yes. Nicht Max."}, {"id": 558, "start": 5828.64, "end": 5838.64, "text": "Da muss man bestimmt mal. Ad. Ministrator. Ad. Alle AD Sachen gehen da drüber. Na wahrscheinlich"}, {"id": 559, "start": 5838.64, "end": 5846.64, "text": "sobald du GUI klicken musst geht nicht. Hey guck mal da. Kann ich jetzt WSL starten."}, {"id": 560, "start": 5846.64, "end": 5851.64, "text": "Guck mal hier. SSH Windows Server und jetzt WSL gestartet. Wobei das halt total hängen"}, {"id": 561, "start": 5851.64, "end": 5856.64, "text": "geblieben ist. Ich könnte mich einfach. Ich könnte einfach ein SSH Server auf Linux installieren"}, {"id": 562, "start": 5856.64, "end": 5862.64, "text": "oder. Doch ich glaube AD gibt ziemlich vieles was nur über GUI oder PowerShell. PowerShell"}, {"id": 563, "start": 5862.64, "end": 5874.64, "text": "wahrscheinlich. Wahnsinn. Das heißt ich kann jetzt remote sagen. Restart Computer. Ach"}, {"id": 564, "start": 5874.64, "end": 5890.64, "text": "nee Moment. Geht Reboot in WSL. Nee. Als als Hut. Nee das geht nicht. Shutdown. Exit."}, {"id": 565, "start": 5890.64, "end": 5899.64, "text": "Was. Kann ich da drüber jetzt PowerShell starten. Das ist jetzt das ist jetzt Shell Shell"}, {"id": 566, "start": 5899.64, "end": 5907.64, "text": "Shell Saption Alda. Das würde jetzt funktionieren Restart tatsächlich. Aber da kann man sich"}, {"id": 567, "start": 5907.64, "end": 5915.64, "text": "dann mal ausloggen. Aber aber sag mal so den den den eingebauten SSH Server in Windows"}, {"id": 568, "start": 5915.64, "end": 5923.64, "text": "braucht doch eigentlich niemand. Ich kann doch einfach hier unter unter WSL. Könnte doch"}, {"id": 569, "start": 5923.64, "end": 5936.64, "text": "einfach sagen unter WSL. Update. Und ein SSH installieren. Wenn du das installierst kannst"}, {"id": 570, "start": 5936.64, "end": 5943.64, "text": "du SSH FS mounten. Ich kann auch so SSH FS mounten oder. Von Linux aus. Da braucht man"}, {"id": 571, "start": 5943.64, "end": 5952.64, "text": "ja nichts zusätzlich installiert. Normalerweise. Egal. Ich muss jetzt Windows Sachen machen."}, {"id": 572, "start": 5952.64, "end": 5957.64, "text": "Nicht zu viele Linux Sachen. Linux Sachen machen wir sonst immer. So mal gucken ob ich"}, {"id": 573, "start": 5957.64, "end": 5963.64, "text": "big brain genug bin das hier zu reverten was wir eben gemacht haben. Add Windows Capability."}, {"id": 574, "start": 5963.64, "end": 5969.64, "text": "Da würde ich jetzt einfach mal sagen wir machen remove Windows Capability. Wie das"}, {"id": 575, "start": 5969.64, "end": 5989.64, "text": "geht einfach. Aber jetzt muss ich jetzt muss ich neu starten. Warum muss ich warum muss"}, {"id": 576, "start": 5989.64, "end": 5995.64, "text": "ich neu starten. Restart Computer. Ich meine ich habe den SSH installiert und deinstalliert."}, {"id": 577, "start": 5995.64, "end": 6005.64, "text": "Das ist schon mal ein Restart Grund. Wenn der Service noch läuft dann soll er das schreiben"}, {"id": 578, "start": 6005.64, "end": 6014.64, "text": "oder er soll den Service stoppen meinetwegen. Braucht bestimmt Kernel Module. Auch guck"}, {"id": 579, "start": 6014.64, "end": 6023.64, "text": "mal er macht Updates. Oder irgendwas im Hintergrund. Getting Windows ready. Also jetzt erstmal"}, {"id": 580, "start": 6023.64, "end": 6035.64, "text": "Updates runter geladen. Obwohl er vorher gesagt hat es gibt keine Updates mehr. Restarting."}, {"id": 581, "start": 6035.64, "end": 6049.64, "text": "Kann man in WSL eigentlich auch ein Kernel Panic erzeugen. Bestimmt irgendwie aber vom"}, {"id": 582, "start": 6049.64, "end": 6058.64, "text": "rein her sollte das ja nicht gehen weil es eine VM ist. Ja das lief wirklich besser"}, {"id": 583, "start": 6058.64, "end": 6067.64, "text": "als erwartet. Das heißt aber ja nichts. Besser als erwartet. Wenn es die Kategorie bei den"}, {"id": 584, "start": 6067.64, "end": 6072.64, "text": "Olympischen Spielen gegeben hätte da wäre ich auch angetreten. Dann hätte ich in der"}, {"id": 585, "start": 6072.64, "end": 6084.64, "text": "Kategorie besser als erwartet gewonnen. So guck mal mein Server ist zum ersten mal alles"}, {"id": 586, "start": 6084.64, "end": 6093.64, "text": "grün. Ich habe gelesen wir haben historisch schlecht abgeschnitten im Medaillenspiegel."}, {"id": 587, "start": 6093.64, "end": 6103.64, "text": "Nicht dass mich das großartig interessieren würde. Was gerade von den Olympischen Spielen"}, {"id": 588, "start": 6103.64, "end": 6110.64, "text": "hatten. Wir schneiden auch nicht in anderen Sachen gerade historisch schlecht ab. Ok Internet"}, {"id": 589, "start": 6110.64, "end": 6117.64, "text": "Ausbau ist nicht historisch schlecht. Der ist schon immer schlecht. Da gibt es gar keine"}, {"id": 590, "start": 6117.64, "end": 6127.64, "text": "Spiele wo das mal besser war. Der war schon immer schlecht. Also ich habe so gut wie keinen"}, {"id": 591, "start": 6127.64, "end": 6132.64, "text": "Olympia geguckt. Ich habe letztens mal den Livestream angemacht und da war irgendwie"}, {"id": 592, "start": 6132.64, "end": 6139.64, "text": "keine Ahnung 40 Kilometer gehen oder sowas. Und das sieht ja schon lustig aus wie die"}, {"id": 593, "start": 6139.64, "end": 6147.64, "text": "gehen. Also das wird ganz schön geeiert. Ich weiß nicht wie ich das sonst beschreiben"}, {"id": 594, "start": 6147.64, "end": 6153.64, "text": "soll. Also ich habe zwei Sachen mitbekommen bei Olympia. Ich habe mitbekommen das mit"}, {"id": 595, "start": 6153.64, "end": 6158.64, "text": "den Kameltreibern. Da ist man nicht drumherum gekommen gerade wenn man auf Twitter ist."}, {"id": 596, "start": 6158.64, "end": 6170.64, "text": "Und dass irgendwie einer oder eine hat irgendwie das Pferd geschlagen oder sowas. Das habe"}, {"id": 597, "start": 6170.64, "end": 6179.64, "text": "ich aber auch nur am Rande mitbekommen. Ich finde es erstaunlich was für ein Flickenteppich"}, {"id": 598, "start": 6179.64, "end": 6185.64, "text": "ich bin aus 10 und WS 2022. Ja war zu erwarten. Ich gucke jetzt mal ob ich den SSH hier unter"}, {"id": 599, "start": 6185.64, "end": 6200.64, "text": "Ubuntu installieren kann und dass das einfach funktioniert. Ab install Open SSH Server."}, {"id": 600, "start": 6200.64, "end": 6217.64, "text": "Okay also was TLDR in einem Wettkampf bekommt man ein random Pferd. Ich dachte man reitet"}, {"id": 601, "start": 6217.64, "end": 6224.64, "text": "das Pferd mit dem man trainiert hat. Man bekommt ein random Pferd. Hä nee. Warum sollte man"}, {"id": 602, "start": 6224.64, "end": 6233.64, "text": "ein random Pferd bekommen? Random? Wirklich? Ah in modernem 5 Kampf nicht. Aber weil normalerweise"}, {"id": 603, "start": 6233.64, "end": 6244.64, "text": "trainieren die doch mit ihren... Ah okay. Das Vieh hat nicht so gemacht wie der Reiter"}, {"id": 604, "start": 6244.64, "end": 6250.64, "text": "haut dem Vieh auf den Arsch. Gut je nachdem wie dem Vieh auf den Arsch gehauen wird. Ich"}, {"id": 605, "start": 6250.64, "end": 6255.64, "text": "meine es gibt andere Leute die stehen drauf auf den Arsch gehauen zu bekommen. Das Vieh"}, {"id": 606, "start": 6255.64, "end": 6263.64, "text": "wahrscheinlich nicht aber wenn das im Rahmen der normalen Umgang. Das kann ich jetzt als"}, {"id": 607, "start": 6263.64, "end": 6266.64, "text": "nicht Pferdebesitzer nicht Pferddrehern nicht beurteilen. Ich kenne die Szene nicht. Weiß"}, {"id": 608, "start": 6266.64, "end": 6276.64, "text": "ich nicht was da gewesen ist. Das war die Debatte okay. Ich kenne dich noch von CommanderKrieger"}, {"id": 609, "start": 6276.64, "end": 6288.64, "text": "Fruhr. Dein Logo ist immer noch dasselbe. Ja. Kannst du auf Schluss vom Stream rm-f no"}, {"id": 610, "start": 6288.64, "end": 6295.64, "text": "PreserveRoute in WSL machen? Ja kann ich machen. Da wird aber halt einfach WSL kaputt gehen"}, {"id": 611, "start": 6295.64, "end": 6306.64, "text": "wahrscheinlich unter Windows. Hoffe ich mal nichts. So also System CTL Start SSHD Bam."}, {"id": 612, "start": 6306.64, "end": 6320.64, "text": "Ach ne das geht ja nicht. Wie starte ich denn unter WSL sowas? Service. Start SSHD. Oder"}, {"id": 613, "start": 6320.64, "end": 6329.64, "text": "SSHD Start. Ich meine ich kann es so ausführen. Okay ich habe keine Ahnung wie ich das unter"}, {"id": 614, "start": 6329.64, "end": 6351.64, "text": "WSL mache wenn ich ehrlich bin. That's that. Up install net tools. In a day ne oder? Nicht"}, {"id": 615, "start": 6351.64, "end": 6354.64, "text": "wirklich. Wie starten wir denn hier Dinger? Die Dienstunter WSL habe ich schon nie gemacht."}, {"id": 616, "start": 6354.64, "end": 6362.64, "text": "Fällt mir jetzt gerade aus. Ist das Open SSH? Ne. SSHD ist richtig. Service SSH. Das SSH"}, {"id": 617, "start": 6362.64, "end": 6374.64, "text": "Start. Ah. Das System CTL auch funktioniert? Ne. Ah Service geht okay. So das heißt wenn"}, {"id": 618, "start": 6374.64, "end": 6384.64, "text": "ich da jetzt mich nochmal versuche darauf zu connecten dann geht das nicht. Warum nicht?"}, {"id": 619, "start": 6384.64, "end": 6391.64, "text": "Weil WSL keinen Netzwerk Zugriff hat von außen. Kann das sein? Oder ist da Firewall an? Ah"}, {"id": 620, "start": 6391.64, "end": 6400.64, "text": "Windows Windows Firewall stellt. Aha. Was macht UFW? Status Inactive. Firewall Windows."}, {"id": 621, "start": 6400.64, "end": 6410.64, "text": "Haben die ein gescheites Firewall GUI jetzt? Ja. Oh jetzt muss er Windows Firewall Freischaltung"}, {"id": 622, "start": 6410.64, "end": 6418.64, "text": "machen. Excellent. Inbound Rules. Das sieht auch aus wie bei Windows XP. Das ist so ein"}, {"id": 623, "start": 6418.64, "end": 6427.64, "text": "zusammengestöckeltes Teil alter. Meine Güte. Gerade Firewall Setting auf dem Server hätte"}, {"id": 624, "start": 6427.64, "end": 6443.64, "text": "ich irgendwas ordentliches erwartet. Was ist denn das? Okay. New Rule. What? 22. Erlow"}, {"id": 625, "start": 6443.64, "end": 6457.64, "text": "All Connection. Ja ja. SSH. Finish. Geht das jetzt? Ah nice. Oh ich kanns mir immer nicht"}, {"id": 626, "start": 6457.64, "end": 6463.64, "text": "merken. SSH. Keygen. Minus R. Ich editiere sonst immer die Datei direkt. Ich glaube SSH"}, {"id": 627, "start": 6463.64, "end": 6472.64, "text": "Keygen minus R ist das. Yes. Oh Permission Denied. Aber es ist ja auch nicht Administrator"}, {"id": 628, "start": 6472.64, "end": 6488.64, "text": "sondern Max. Keine Passwort Authentifizierung. Kegwayt. Gibs nicht. File. ETC. SSH. SSHD."}, {"id": 629, "start": 6488.64, "end": 6503.64, "text": "Config. Passwort. Passwort Authentification. No. Doch. Wollen wir. Soll das denn hier?"}, {"id": 630, "start": 6503.64, "end": 6515.64, "text": "Yes. Finde mich nicht ob man das braucht. Service. Restart. Okay darf ich jetzt? Ups."}, {"id": 631, "start": 6515.64, "end": 6522.64, "text": "Muss ich hier oben drüber switchen. Darf ich jetzt? Hey. 1 2 3 4 5 6. Bam und wir sind"}, {"id": 632, "start": 6522.64, "end": 6531.64, "text": "nicht drauf. Doch. Zack. Okay. Direkt WSL SSH. Jetzt stellt sich mir die Frage. Was ist"}, {"id": 633, "start": 6531.64, "end": 6540.64, "text": "der Windows-Seggerer Weg ein SSH Server auf Windows zu bekommen? Diesen komischen Open"}, {"id": 634, "start": 6540.64, "end": 6547.64, "text": "SSH über Features was ja eigentlich ein Windows 10 Feature ist und man weiß wie alt das ist"}, {"id": 635, "start": 6547.64, "end": 6554.64, "text": "oder man sagt WSL oder aber man sagt gar nichts macht gefälligt RDP und klicke alles"}, {"id": 636, "start": 6554.64, "end": 6570.64, "text": "durch. Was ist das Windows-Seggerer Vorgehen? Horscher. Guck mal ich hab ich hab kein Auto"}, {"id": 637, "start": 6570.64, "end": 6575.64, "text": "warum hab ich da jetzt kein Auto Complete vorher ging das mit Auto Complete. Ich hab"}, {"id": 638, "start": 6575.64, "end": 6585.64, "text": "da gar kein Auto Complete. Doch. Aber Power Off kann ich machen. Bam. Das geht natürlich"}, {"id": 639, "start": 6585.64, "end": 6594.64, "text": "nicht. MMC. Vorher ging das jetzt geht es nicht. Also ist es SSH über Windows schon mal besser"}, {"id": 640, "start": 6594.64, "end": 6606.64, "text": "Einfach VNC. Nee VNC da kann ich auch RDP zu euch installieren. Nee das geht da nicht."}, {"id": 641, "start": 6606.64, "end": 6611.64, "text": "Hier hat man jetzt wirklich bloß Zugriff auf die Ubuntu Geschichten und nicht mehr auf"}, {"id": 642, "start": 6611.64, "end": 6619.64, "text": "Windows Sachen. Selbst das hier geht jetzt nicht. Aber jetzt oh jetzt muss ich mal was"}, {"id": 643, "start": 6619.64, "end": 6627.64, "text": "machen. Geht X-Forwarding da drüber. Abinstall Firefox. Moment das muss ich jetzt ausprobieren."}, {"id": 644, "start": 6627.64, "end": 6637.64, "text": "Geht X-Forwarding da drüber. Das müsste WSL. Ich hoffe das ist WSL 2. Wie sieht man das"}, {"id": 645, "start": 6637.64, "end": 6658.64, "text": "WSL minus minus Version. WSL. WSL minus L minus V. Eins. Paints Champ die liefern auch"}, {"id": 646, "start": 6658.64, "end": 6665.64, "text": "standardmäßig eins aus. Warum? Da muss ich mir dieses komische Upgrade geduld machen"}, {"id": 647, "start": 6665.64, "end": 6670.64, "text": "übers Internet. Da musst du dir irgendwelche Kern Updates runterladen und so das funktioniert."}, {"id": 648, "start": 6670.64, "end": 6687.64, "text": "Das ist ja noch WSL 1. Warum liefern die da noch WSL 1 aus? Verstehe nicht. Und es ist"}, {"id": 649, "start": 6687.64, "end": 6697.64, "text": "langsam was zu installieren. Guck mal wie langsam das ist. File System Access ist schneller?"}, {"id": 650, "start": 6697.64, "end": 6702.64, "text": "Ja aber das kann ja nicht der Grund sein. WSL 1 ist ja dead. Microsoft setzt ja voll"}, {"id": 651, "start": 6702.64, "end": 6720.64, "text": "auf WSL 2. Gibt es überhaupt noch Updates für WSL 1? Lustigerweise WSL 1 ist quasi sowas"}, {"id": 652, "start": 6720.64, "end": 6728.64, "text": "rewind unter Windows für Linux. Also sowas rewind unter Linux für Windows ist, ist WSL"}, {"id": 653, "start": 6728.64, "end": 6735.64, "text": "1 sowas quasi unter Windows für Linux. Also eine Zwischenschicht die Kernlaufrufe um"}, {"id": 654, "start": 6735.64, "end": 6741.64, "text": "translated. Nur dass es deutlich einfacher sein müsste sowas für Windows zu programmieren"}, {"id": 655, "start": 6741.64, "end": 6746.64, "text": "weil man weiß wie Linux funktioniert als umgedreht. Und WSL 2 ist einfach nur eine"}, {"id": 656, "start": 6746.64, "end": 6758.64, "text": "Hyper-V4M. So jetzt bin ich mal gespannt. Kann ich X-Forwarding machen über WSL? Firefox."}, {"id": 657, "start": 6758.64, "end": 6770.64, "text": "Geht. Bam. Firefox am Start. Oder zumindest mein lokaler Firefox. Warum geht mein lokaler"}, {"id": 658, "start": 6770.64, "end": 6786.64, "text": "Firefox? Ich bin verwirrt. Der Firefox kommt damit irgendwie nicht klar. Erstmal alles"}, {"id": 659, "start": 6786.64, "end": 6802.64, "text": "zu machen. Leute ich hab's gebraked. Ich hab's irgendwie kaputt gemacht. Oh ist es"}, {"id": 660, "start": 6802.64, "end": 6816.64, "text": "grip? Hab ich kaputt gemacht? Hat sich das neu gestartet? Ist der, ist der gecrasht?"}, {"id": 661, "start": 6816.64, "end": 6826.64, "text": "Ist der gerade gecrasht? Wir haben es nicht gesehen. Oder hat er sich ausgelockt? Wait"}, {"id": 662, "start": 6826.64, "end": 6838.64, "text": "a minute. Der ist gecrasht? Der ist ge-, der ist gecrasht? Okay Moment Leute. Das muss"}, {"id": 663, "start": 6838.64, "end": 6844.64, "text": "ich jetzt nochmal ausprobieren. Das, das muss nochmal ausprobiert werden jetzt. Sack, Sack."}, {"id": 664, "start": 6844.64, "end": 6859.64, "text": "Der ist gecrasht. Das kann der mit noch, ist aber gut. Okay, okay. Service. Open SSH"}, {"id": 665, "start": 6859.64, "end": 6881.64, "text": "Start. 1256. Firefox. Jetzt crasht er nicht mehr. Und jetzt hab ich, jetzt hab ich den,"}, {"id": 666, "start": 6881.64, "end": 6890.64, "text": "ups, ich hab das falsche, ich hab das falsche Fenster. So, jetzt hab ich den Firefox, den"}, {"id": 667, "start": 6890.64, "end": 6901.64, "text": "Firefox laufen. Oh das ist jetzt aber richtig big brain. Oh. Just updated. What, what is"}, {"id": 668, "start": 6901.64, "end": 6926.64, "text": "happening? Was? Das ist nicht mein Lokaler Firefox. Hä? Das ist doch mein Lokaler Firefox."}, {"id": 669, "start": 6926.64, "end": 6935.14, "text": "Was zum? Okay, ich glaube das ganze kommt damit nicht klar. Das versucht das, das versucht"}, {"id": 670, "start": 6935.14, "end": 6940.64, "text": "das irgendwie weiter zu leiten und statt dann, es läuft gar nicht remote, sondern es ist"}, {"id": 671, "start": 6940.64, "end": 6954.64, "text": "mein Lokaler Firefox. Nee, nee, nee, es ist nicht mein Lokaler Firefox. Das war der remote"}, {"id": 672, "start": 6954.64, "end": 6958.64, "text": "Firefox. Das ist mein Lokaler Firefox. Da hab ich auch hier Home Assistant Verlinkungen"}, {"id": 673, "start": 6958.64, "end": 6971.64, "text": "und so drauf. Okay, das ist der remote Firefox. So. Okay. Alles klar. Okay, das ist der remote"}, {"id": 674, "start": 6971.64, "end": 6984.0, "text": "Firefox. Ich glaube das Ding ist einfach broken über x forwarding. Glaubt das funktioniert"}, {"id": 675, "start": 6984.0, "end": 6990.24, "text": "einfach nicht. So, Chrome unter Ubuntu geht ja nicht, weil Ubuntu der Meinung ist, Chrome"}, {"id": 676, "start": 6990.24, "end": 7000.84, "text": "ist jetzt ein Snap. Was gibt's denn? Kennt ihr mal noch einen alternativen Browser unter"}, {"id": 677, "start": 7000.84, "end": 7008.44, "text": "Ubuntu, der mitgeliefert wird? Aber gut, wenn Firefox nicht geht, dann geht der Rest auch"}, {"id": 678, "start": 7008.44, "end": 7019.88, "text": "nicht. Das Ding ist broken. Das Ding ist, das Ding ist broken über x forwarding. Das funktioniert"}, {"id": 679, "start": 7019.88, "end": 7040.04, "text": "nicht. Midori Browser. Stimmt, das könnten wir echt mal gucken. Tatsächlich gibt es."}, {"id": 680, "start": 7040.04, "end": 7047.36, "text": "Okay, erst mal das halbe Internet nachinstallieren. Nee, nee, Windows ist nicht abgeschissen."}, {"id": 681, "start": 7047.36, "end": 7052.68, "text": "Warum ist denn eben Windows gecrashed? Kann sich das jemand sinnvoll erklären? Ich hab"}, {"id": 682, "start": 7052.68, "end": 7057.2, "text": "ja nichts gemacht. Das ist übrigens was, was in WSL 2 auf jeden Fall nicht funktionieren"}, {"id": 683, "start": 7057.2, "end": 7064.56, "text": "sollte, weil Windows WSL 2 in der VM ist. Gibt es da einen Lok? Das ist eine gute Frage."}, {"id": 684, "start": 7064.56, "end": 7072.4, "text": "Können wir jetzt mal ausprobieren. Event Lock heißt das. Event Viewer. Das ist auch so ein"}, {"id": 685, "start": 7072.4, "end": 7078.68, "text": "Fummelprogramm. Meine Güte. Sieht jetzt aus wie Windows Vista. Windows ist so krass"}, {"id": 686, "start": 7078.68, "end": 7088.92, "text": "fummelig. Okay, was könnte es denn sein? System. System. Und jetzt nach der Uhrzeit,"}, {"id": 687, "start": 7088.92, "end": 7103.16, "text": "also hier irgendwie. Error. Bug Check. Computer has rebooted from a bug check. Hä? Bug Check"}, {"id": 688, "start": 7103.16, "end": 7114.92, "text": "was. Ah, alles klar. Jetzt müssen wir mal Bescheid. Das war ein Blue Screen. Computer"}, {"id": 689, "start": 7114.92, "end": 7121.84, "text": "has rebooted from a. Also man kann jetzt mal ernsthaft, man kann ein Windows 2020 Server"}, {"id": 690, "start": 7121.84, "end": 7127.92, "text": "crashen in dem man WSL installiert und Firefox per X Forwarding aufbauen. Ich gebe zu, es"}, {"id": 691, "start": 7127.92, "end": 7137.56, "text": "ist kein Anwendungsgebiet, was irgendwie realistisch den Admin verwenden wird. Es sollte, es sollte"}, {"id": 692, "start": 7137.56, "end": 7141.68, "text": "den Windows Server nicht crashen. Das hat noch mit Preview nichts zu tun. Das ist irgendein"}, {"id": 693, "start": 7141.68, "end": 7157.04, "text": "WSL 1 Fehler. Da ist wahrscheinlich überall so. Nice. So, das andere. Aber das ist auch"}, {"id": 694, "start": 7157.04, "end": 7169.68, "text": "langsam hier über WSL Zeug zu installieren. Lad dir Blue Screen Viewer. Okay, okay. Leute,"}, {"id": 695, "start": 7169.68, "end": 7174.16, "text": "jetzt kommen die, jetzt kommen die super advanced Windows Geschichten. Blue Screen Viewer. Natürlich"}, {"id": 696, "start": 7174.16, "end": 7183.28, "text": "gut, dass Edge drauf ist. Blue Screen Viewer. Von Heise. Okay, die sind übrigens halbwegs"}, {"id": 697, "start": 7183.28, "end": 7188.92, "text": "vertrauenswürdig zum. Nein. Jaja, ich werde nie wieder ein Heise Plus Abo abschließen,"}, {"id": 698, "start": 7188.92, "end": 7201.12, "text": "nachdem die mich einmal so debatet haben. Zip. Oh, jetzt haben wir es doppelt. So. Nein."}, {"id": 699, "start": 7201.12, "end": 7213.68, "text": "Ah, noch mal. Gehst sofort. Okay, Blue Screen Viewer. Exzellentes Icon. Hier, hier, hier"}, {"id": 700, "start": 7213.68, "end": 7219.28, "text": "sieht man es jetzt. Beziehungsweise, was sehe ich da eigentlich? Was bin ich da sehend?"}, {"id": 701, "start": 7219.28, "end": 7226.64, "text": "Was? NTOS Colonel. Wahrscheinlich wirklich eine WSL Geschichte. Wahrscheinlich irgendeine"}, {"id": 702, "start": 7226.64, "end": 7245.28, "text": "WSL Geschichte. Ach, deswegen ist WSL 2 schneller, okay. Tja. Wahrscheinlich irgendeine WSL Sache."}, {"id": 703, "start": 7245.28, "end": 7251.64, "text": "Das hier ist ja mehr als nichts, sagt. Das ist garantiert irgendeine WSL, weil das ist"}, {"id": 704, "start": 7251.64, "end": 7261.2, "text": "ja, das ist ja, WSL ist ja irgendein Colonel-Module quasi unter, unter Windows. Ach, hier oben"}, {"id": 705, "start": 7261.2, "end": 7266.04, "text": "ist immer noch gecrashed. So, okay, jetzt probieren wir den anderen Browser noch mal"}, {"id": 706, "start": 7266.04, "end": 7271.92, "text": "aus. Was war mit Heise und debatet? Ich wollte mir bei Heise einen Artikel durchlesen, irgendwelche"}, {"id": 707, "start": 7271.92, "end": 7276.08, "text": "aktuellen Gehaltsdinger, weil die haben da immer so eine, so eine Übersicht. Dann habe"}, {"id": 708, "start": 7276.08, "end": 7279.88, "text": "ich mich angemeldet, weil die, also ne, da haben die gesagt, es geht plus mit Heise Plus,"}, {"id": 709, "start": 7279.88, "end": 7282.96, "text": "dann hab ich mich mit Heise Plus angemeldet, hab ich mir gesagt, gut, Monat kannst du ja"}, {"id": 710, "start": 7282.96, "end": 7288.76, "text": "mal gönnen, und das ist für CT Abonnenten auch für, glaub, ein halbes Jahr oder so"}, {"id": 711, "start": 7288.76, "end": 7293.88, "text": "kostenlos, oder einen Monat kostenlos, hab ich mich angemeldet, und dann haben die ohne"}, {"id": 712, "start": 7293.88, "end": 7298.88, "text": "Scheiße ne Woche gebraucht, ne Woche, bis die mich freigeschaltet haben, bis dahin wollte"}, {"id": 713, "start": 7298.88, "end": 7304.04, "text": "ich den Artikel gar nicht mehr lesen, und ich hatte in meinem Benutzerprofil nicht die"}, {"id": 714, "start": 7304.04, "end": 7308.12, "text": "Möglichkeit, Heise Plus zu kündigen. Und da bin ich von ausgegangen, Heise Plus läuft"}, {"id": 715, "start": 7308.12, "end": 7312.6, "text": "einfach aus, weil es stand auch nirgendwo, dass sich das verlängert, und auf einmal"}, {"id": 716, "start": 7312.6, "end": 7316.84, "text": "nach einem Monat heißt es hier, ich hab jetzt keine Ahnung, irgendwie den Jahr Heise Plus"}, {"id": 717, "start": 7316.84, "end": 7324.56, "text": "Abo am Start, und da kam ich mir echt geblendet vor, und ich hab die dann angeschrieben, aber"}, {"id": 718, "start": 7324.56, "end": 7329.08, "text": "da muss man sagen, fairer halber, nach einer Woche oder zwei Wochen Reaktionszeit, haben"}, {"id": 719, "start": 7329.08, "end": 7335.36, "text": "die das ganze aus dem Account geschmissen und wieder storniert. Das muss man ihnen"}, {"id": 720, "start": 7335.36, "end": 7343.76, "text": "zugute halten. Oh, oh, guck mal, Browser geht, Google, jawoll, Firefox geht nicht, Midori"}, {"id": 721, "start": 7343.76, "end": 7351.2, "text": "geht, auf was basiert denn das, ist das Chrome, oder ist das Webkit, bestimmt nur Oldschool"}, {"id": 722, "start": 7351.2, "end": 7362.24, "text": "Webkit oder so, sieht auch sehr Gnome-mäßig aus, References, About, auf was basiert denn"}, {"id": 723, "start": 7362.24, "end": 7369.68, "text": "das Webkit, bis 2018, das ist ja Massive aktuell, warum sollte man sowas denn benutzen,"}, {"id": 724, "start": 7369.68, "end": 7379.08, "text": "gucken wir mal, lassen wir uns das ganze, also dieser Browser läuft jetzt auf meinem Windows"}, {"id": 725, "start": 7379.08, "end": 7385.12, "text": "Server, Chromium, das ist doch gut, du musst den Qt Browser nehmen, ja, haben die den,"}, {"id": 726, "start": 7385.12, "end": 7396.44, "text": "oh ne, oh, wir haben's gecrashed, wir haben's gecrashed, bam, rip, also gut crashen kann's"}, {"id": 727, "start": 7396.44, "end": 7416.24, "text": "auf jeden Fall, ein nicer Crash, nicht genug RAM, ne, ein aktuelles Betriebssystem sollte"}, {"id": 728, "start": 7416.24, "end": 7420.64, "text": "nicht von zu wenig RAM crashen, erstens haben wir 8G RAM, gut ist jetzt nicht viel, aber"}, {"id": 729, "start": 7420.64, "end": 7429.48, "text": "trotzdem, der soll noch swappen auf die Festplatte, wir haben's geschafft, wir haben's gecrashed,"}, {"id": 730, "start": 7429.48, "end": 7441.84, "text": "das ist garantiert ein WSL Fehler, das ist garantiert ein WSL Fehler, das ist ein Kernel"}, {"id": 731, "start": 7441.84, "end": 7451.12, "text": "Fehler, nice, ok, ich würd sagen mein Targesoll ist erfüllt, wir haben's geschafft Windows"}, {"id": 732, "start": 7451.12, "end": 7463.68, "text": "zu crashen, easy, Any% das müsste ich eigentlich hochladen, Windows Server 2022 Blue Screen,"}, {"id": 733, "start": 7463.68, "end": 7485.56, "text": "Speedrun Any%, Windows, ok, das mach ich jetzt noch, das mach ich jetzt noch, als root, so,"}, {"id": 734, "start": 7485.56, "end": 7499.32, "text": "also sudo, em-ef slash, was ist das dann, no preserve root und was sonst noch, verstanden,"}, {"id": 735, "start": 7499.32, "end": 7519.88, "text": "hat man sonst noch was, nix Feuer, bam, Moment, fuck, der geht in die Mounts rein, lul, der"}, {"id": 736, "start": 7519.88, "end": 7526.52, "text": "zerstört Windows komplett, das ist Fail, ich dachte der geht nicht, der geht wenigstens"}, {"id": 737, "start": 7526.52, "end": 7534.24, "text": "über die Mounts drüber, aber ok, geh jetzt vorbei, aber Permission Denial for System"}, {"id": 738, "start": 7534.24, "end": 7542.92, "text": "32 Leute, er kann nicht alles löschen, er hat ja keine Adminrechte, er hat keine Adminrechte,"}, {"id": 739, "start": 7542.92, "end": 7549.6, "text": "also er kann höchstens meine Sachen löschen, aber ich bin ja Admin, hä, wie in dem Moment,"}, {"id": 740, "start": 7549.6, "end": 7556.48, "text": "weiß ich, ich bin Admin, aber hab keine Adminrechte unter WSL, also mal gucken was jetzt passiert,"}, {"id": 741, "start": 7556.48, "end": 7567.12, "text": "ich hab wirklich keine Vorstellung davon, die Eiken sind alle weg, ja gut, mein Heimatverzeichnis"}, {"id": 742, "start": 7567.12, "end": 7589.12, "text": "ist ja auch RIP, aber ansonsten, oh, oh, oh, Leute, Leute, jetzt ist vorbei, jetzt ist"}, {"id": 743, "start": 7589.12, "end": 7617.16, "text": "vorbei, ja Bash spielt ins Geh noch, ok, testen wir mal, ob SFC das fixen kann, was, SFC,"}, {"id": 744, "start": 7617.16, "end": 7628.6, "text": "ich starte jetzt neu und wir gucken, ob es das fixen kann, Restart, das ist bestimmt"}, {"id": 745, "start": 7628.6, "end": 7647.56, "text": "RIP, Restart, ich wahrscheinlich Restart jetzt schon gar nicht mehr, ah, doch, doch, doch,"}, {"id": 746, "start": 7647.56, "end": 7657.68, "text": "das bootet noch, das bootet noch, ah, ok, wir haben es geschafft, Pluscreen Loop, jetzt"}, {"id": 747, "start": 7657.68, "end": 7686.8, "text": "ist vorbei, jetzt ist vorbei, ok, ok, ok, ok, okay, ok, ok, ok, ok, ok, ok, ok, okay,"}, {"id": 748, "start": 7686.8, "end": 7695.32, "text": "wir haben es geschafft gibt es noch so ein recovery mode im boot manager also kann ich"}, {"id": 749, "start": 7695.32, "end": 7702.56, "text": "noch irgendwie kann ich irgendwas drücken für boot manager oder so gibt es gibt es da was"}, {"id": 750, "start": 7702.56, "end": 7713.48, "text": "was ist das jetzt windows boot manager ne f8 f8 war es früher ich glaube das gibt es nicht mehr"}, {"id": 751, "start": 7713.48, "end": 7738.08, "text": "kuck kuck diagnosing your pc out automatic repair b"}, {"id": 752, "start": 7738.08, "end": 7754.92, "text": "let's let's let you choose ne ne ne ne fix that keep ok restore wir sagen erstmal startup"}, {"id": 753, "start": 7754.92, "end": 7773.0, "text": "repair na super die können da nichts machen advanced options system restore das ding ist"}, {"id": 754, "start": 7773.0, "end": 7784.84, "text": "komplett rippe das ding ist komplett rippe kannst du kannst du nichts machen versuch mal"}, {"id": 755, "start": 7784.84, "end": 7804.64, "text": "used device used used device kann ich usb stick oder so mann ok leute vergesst ding ist das ding"}, {"id": 756, "start": 7804.64, "end": 7816.6, "text": "ist rippe warum hat wsl rechte das zu machen na gut weil das wahrscheinlich mein wsl ist was"}, {"id": 757, "start": 7816.6, "end": 7821.88, "text": "als admin läuft ich habe ja mal snapshot aber ziel war ja kaputt zu machen bäm wir haben es"}, {"id": 758, "start": 7821.88, "end": 7830.88, "text": "geschafft geschafft bettgetime bettgetime ich habe winos zerstört alles gut ist der fresh an den wir hosten können zeigt mal ja"}, {"id": 759, "start": 7830.88, "end": 7856.12, "text": "komm ich holste mann in zairos was macht er denn was was macht er denn"}, {"id": 760, "start": 7856.12, "end": 7867.04, "text": "rim world habe ich mir vor zwei jahren in steam gekauft aber nie ausprobiert"}, {"id": 761, "start": 7867.04, "end": 7872.72, "text": "semper video ist und wirklich"}, {"id": 762, "start": 7872.72, "end": 7886.44, "text": "hallo in diesem video nur ganz kurz mal gezeigt wie man semper video auf twitch"}, {"id": 763, "start": 7886.44, "end": 7910.28, "text": "hosten kann ok das war jetzt host oder raiden raiden wir raiden wir raiden rate semper video bäm erst mal semper video raiden also in diesem in diesem stream habe ich"}, {"id": 764, "start": 7910.28, "end": 7927.64, "text": "euch nur ganz kurz gezeigt wie man windows 2022 server zerstört also leute ich drücke jetzt den"}, {"id": 765, "start": 7927.64, "end": 7934.84, "text": "house button wir sehen uns bis zum nächsten stream die tage und mal gucken wie gut ich"}, {"id": 766, "start": 7934.84, "end": 7952.6, "text": "morgen mit der bahn ins homeoffice durchdurchkommen bis denn zu"}]}