{"text": "Ich bin müde. Aber noch nicht bettge, aber noch nicht bettge müde. Ich bin aber nicht so wirklich voll dabei heute, aber ich wollte noch eine Runde Stream Stels machen und mit euch eine Runde schwätzen. Ja, morgen ist ganz schlecht, morgen sackt, morgen muss ich nach Frankfurt auf die Arbeit fahren. Glücklicherweise danach wieder Homeoffice, so Paynes Champ, Alter. Ist morgen schon wieder Streik? Also wenn morgen Bahnstreik ist, dann fahre ich nicht. Bahnstreik. Oh nee, oder? Lull. Donnerstag. Der Chat erzählt wieder Mist. Das stimmt überhaupt nicht, dass die ab morgen streiken. Donnerstag. Klingt merkwürdig, ich bin heute entspannt. Ich hänge auch so auf halb acht vorm Rechner. Erst trifft es dann den Güterverkehr von Donnerstag, dann ein bisschen... Okay, also. Mittwoch 17 Uhr. Okay, das heißt, morgen ist noch gar nix. Gehen mir so auf den Sack, allesamt die Bahn vor allem, aber die GDL auch, die gehen mir alle so auf den Sack. Die sollen einfach ihre Arbeit machen und mich pünktlich von A nach B bringen, der Rest ist mir scheißegal. Meine Güte, ey. Was eine Riesenzeremonie wieder, Alter. Ja, ich kann die auch verstehen, aber ich habe trotzdem keinen Bock darauf, dass sie streiken. Nur weil man was verstehen kann, muss man das ja noch nicht gut finden. Also die Auswirkungen. Ich muss gerade mal was gucken, irgendwie gab es hier Questions. Danke für den Sub eben, gab es irgendwas, der Death Operator ist wieder am Start. Les ich mir gleich durch, also, der Umut, du bist aber auch immer am Start, oder? Also, ein Lokal habe ich den Controller, warum sollte ich denn vermeiden, manchmal frage ich mich echt, ob du die Fragen ernst meinst oder einfach nur eine Runde jebaiten willst. Warum um alles in der Welt sollte ich für meine lokalen Access Points einen Unify Controller im Internet haben? Also, das ergibt überhaupt keinen Sinn, nein, ich habe das Lokal, ich habe das Lokal unten im Wohnzimmer auf dem Raspberry Pi, da ist auch noch die Software drauf, die Kamera, Überwachungs, Überwachungskamera stills macht. Ja, aber solange die erst am Donnerstag anfangen, ist gut, da kann ich wieder Home Office machen. Wäre bei dir überhaupt jemand da, bei mir wäre da niemand, ich weiß nicht mehr, worauf sich das bezogen hat. Meinst du auf die Arbeit, doch, bei mir sind tatsächlich ein paar Leute auf der Arbeit in Frankfurt. Es gibt da tatsächlich so ein paar wahnsinnige Leute, die da gerne hinfahren und was ich auch lustig finde, unsere Geschäftsführer, die Stonks Manager bei uns auf der Arbeit, die hauen wieder die geilsten Sprüche auf der Welt raus, um die Leute zu motivieren auf die Arbeit zu gehen. Letztens hat wieder einer rumgeschrieben, so nach dem Motto, wir freuen uns alle auf die kommende Zeit und jetzt können wir getreu unserem Motto für Menschen, von Menschen, zu Menschen oder irgendwie so was agieren und das hat er so geschrieben, als wäre das jetzt wahnsinnig geile Motivationsrede und ich habe einfach nur da gesetzt und so gefacepalmt und hat mir gedacht, Alter, was willst du mir eigentlich sagen? Diese Sprüche immer, ja und was auch lustig ist, wir haben bei uns ja mit dem Betriebsrat, gibt es jetzt so eine, also neu ist das nicht, aber jetzt bei Corona wurde das Ganze forciert, gibt es so, haben wir jetzt so die Möglichkeit offiziell, ich konnte ja schon jahrelang Homeoffice machen, aber man kann jetzt offiziell quasi sagen, ich möchte meine Arbeitszeit verändern mit Vertragsänderungen und allem und was lustig ist, sobald das jetzt offiziell war, waren sie total überrascht vom Antrag, wo ich mir auch wieder denke, so ist es nicht eigentlich jobs von Managern, so ungefähr zu verstehen, was passiert und die sind von allem immer so wahnsinnig überrascht, wie kann das sein? Können die ihren Job nicht richtig machen? Also ich muss doch so ein bisschen, ich werde doch als Manager bzw. als bezahlt Entscheidungen zu treffen und diese Entscheidungen sollten doch eigentlich auch so getroffen werden, dass sie in die Zukunft, ein bisschen der Möglichkeit ein bisschen in die Zukunft gucken und gut dafür sind, aber unsere Manager sind immer übelst schnell von Sachen überrascht, so nach dem Motto, was, so viele Leute wollten Homeoffice machen, damit haben wir ja gar nicht gerechnet, blablabla, warum ich mir denke jetzt, naja, der Scamtrain ist am Start, der Mast, der Krümli, 6 Monate, massive Subscriptions hier, nee, ich gebe mir heute bloß gar keine Mühe, irgendwie besonders enthusiastisch zu klingen, normalerweise versuche ich ja immer irgendwie besonders so, so engaged zu sein, ja, weil ich sehe das ja auch an in den Viewerzahlen, wenn ich einfach nur auf halb 8 da hänge oder wenn ich engaged bin und irgendwas zeige, natürlich, kommt das besser an, aber ich sitze heute einfach nur Vape Nation Style vorm Rechner und ich hänge eigentlich halb unterm Rechner, ok, also der Dev Operator ist am Start und er sagt, habe jetzt ein kleines Programm mit Pysen, übrigens die Aussprache finde ich auch geil, jeder spricht das ein bisschen anders aus, ich habe schon gehört von Python, jetzt ist kein Witz, Python habe ich schon gehört, Python, Python, Python, alles, alles dabei, aber Python ist das beste, die schreibt man doch ganz anders, die Schlange, Python, Python gibt es auch noch, habe ich ganz vergesse, Python, Python, Python ist auch gut, aber Python habe ich ganz vergessen, das gibt es dann auch die Leute, das habe ich dann in Python geschrieben, Pyson, na Pyson habe ich nicht gehört, C Hashtag, nee C Lappenzauen ist die beste Sprache, so also, also ein kleines Programm mit Pysen unter Twitch, API zusammengezimmert, geht um die Nachricht von gestern, habe jetzt nur noch ein paar Problemchen, wie gut kannst du, naja, ich habe da jetzt kein Daily Practice, aber ich kann das lesen, ich kann das verstehen, wenn ich was schreiben muss, muss ich halt immer nachgucken, weil ich das nicht so oft verwende, kannst du auch C Teppichzeichen, was ist denn ein Teppichzeichen, jetzt hast du gestern schon erzählt, dein 20 Euro Gutschein ist weg, schreib doch den Support an, habe ich doch gestern schon gesagt, ich kann da nichts machen, wenn bei denen im System irgendwas aktiviert, verfällt, was auch immer, du kriegst bestimmt einen neuen Gutschein, hast du, und was haben sie geschrieben, was haben sie geschrieben, nö, ja warum nö, ach stimmt, nee im Moment, dein Gutschein war doch abgelaufen, ja gut, da bist du selber dran schuld, wenn dein Gutschein abgelaufen ist, da kann ich ja nichts für und Hetzler auch nicht, das steht wahrscheinlich sogar da, wenn du es einlöst, dass das nicht unendlich handgültig ist, warum läuft der ab jetzt, das steht bestimmt da, übrigens Leute, Ausrufezeichen Hetzler im Chat, wenn ihr euch ein 20 Euro Cloud Gutschein sichern wollt für eure eigenen Linux VMs in der Cloud, und wenn ihr wissen wollt, was ihr machen könnt, könnt ihr den Stream von gestern angucken, Wolle604, Dankeschön für den Sub, drin von einem Streik ist es ja auch, dass die Öffentlichkeit Druck macht, ja, es ist ja nicht so, als müsste man mir erklären, warum, die Streiken, das ist mir schon klar, ich find das trotzdem kacke, ja ich hab auch kein, ich bin sogar dafür, dass sie das dürfen, aber rein für mich aus meiner Sicht ist es kacke, und mir ist es vollkommen egal, ob es an der Bahn liegt oder an der GDL liegt oder an was auch immer liegt, ich will einfach nur pünktlich von A nach B gebracht werden, das ist alles, die Rahmenbedingungen sind mir, ob es jetzt mal übertrieben zu sagen, scheiß egal, Hauptsache es funktioniert. By the way, verwendet jemand Logitech Schmäuse, ja natürlich, was ne Frage, habt ihr noch die Logitech Game Software oder habt ihr schon Logitech Hub, was besser, Logitech G Hub oder Logitech Game Software, G Hub, vielleicht soll ich das auch mal upgraden, bevor ich den Support anschreibe, dass ich doppelte Tastenklicks hab, wozu braucht man die, naja zum Beispiel um Profile einzustellen, Software wird alles bloated, ja ja alles bloated, ich weiß, also ihr habt alle G Hub, ihr habt gar nicht mehr die alte, alte Maus, ok, äh die alte Maus Gaming Software, doppelte Tastenklicks ist doch bestimmt kaputter Switch, bin mir nicht sicher, das merkwürdige ist, ich bilde mir ein, ich habe es sowohl links als auch rechts, was auf Software irgendwie hindeutet, ich installier es neu, wenn nicht muss der Support dran glauben, krümelst du am PC, ich ess relativ selten am PC, früher hab ich immer am PC gefuttert, mittlerweile ess ich eigentlich gar nicht mehr am PC, außer, manchmal sonntags, wenn ich gestreamt hab, den Stream gerade ausgemacht hab und dann noch irgendwas gucken will, weil ich sonntags noch gar nichts geguckt habe, nachgeguckt habe, weil ich direkt on gehe und Stream anmache, ja, übrigens ich muss jetzt nicht mehr, äh wie nennt man das so, ja, so viele Bedenken haben, dass ich so langsam bin mit dem Chat, weil ich hab letztes mal bei Semper Video reingeguckt, der ist noch langsamer mit dem Chat, bin ich nicht alleine, der ist teilweise eine halbe Stunde hinten dran, hallo in diesem Stream nur ganz kurz, so, aber er liest alle, ich lese auch mehr oder weniger alles, manches erwähne ich nicht, weil ich keinen Bock hab drauf zu antworten, aber ich lese eigentlich so gut wie alles, warum, das müssen wir uns gleich mal angucken, Custom Firmware, Leute, wenn ich sowas bräuchte, ich bin erfreut, dass ich sowas nicht brauch, das erste was ich machen würde ist, Custom Firmware Flashen, wisst ihr ja, ja und da muss man aufpassen, man sollte das besser nicht in C++ programmieren, ansonsten macht das Ding noch irgendeinen Scheiß, was wurde da drauf, ja, guck ich mir, guck ich mir an, ja wie gesagt mein Unify Controller läuft auch auf dem Raspberry Pi und ich muss euch mal sagen, ich habe mir im Keller jetzt noch einen UAP Lite, wie auch immer der genau heißt, eingebaut, so einen hier, kein WiFi 6, ich brauche im Keller kein WiFi 6, dafür ist das Ding schön günstig, gut schön günstig sind 60 Euro oder so, 70 Euro sogar und ich muss echt sagen, seitdem ich mir das Ding hier noch im Keller eingebaut habe, das WLAN ist wirklich, das hätte ich nie gedacht, was so ein Access Point ausmachen kann, ja Unify habe ich in meinem Home Assistant drinne, als Device Tracker, hast du noch deinen alten PC mit Xeon CPU von 2013, ja, ja, hab ich noch, allerdings nicht mehr hier stehen, sondern ich glaube auf dem Dachboden, aber ich schmeiße die ja nicht weg, warum fragst du? So, das hätte ich echt nicht gedacht, dass das so viel bringt, ne, also ich habe hier im Erdgeschoss einen Access Point, einen UAP Pro habe ich im Erdgeschoss, hier oben habe ich ein bisschen Nano HD und ich hatte immer Probleme, egal wie ich es positioniert habe, der Empfang im Keller war prinzipiell scheiße, dann kam dazu, dass es im Flur auch nicht toll war, ich habe teilweise schon Probleme, wenn ich aufs Klo gegangen bin, oben und ich habe jetzt einfach noch im Keller einen zusätzlichen Access Point hingehängt, jetzt habe ich 3 Stück Keller, Erdgeschoss, 1. Stock, Dach ist nix, brauche ich auch nicht und wisst ihr was? Ich kann zwar nicht ganz nachvollziehen, warum sich manche Devices dahin verbinden, beispielsweise die Lampe, so eine WiFi RGB Lampe drüben im Wohnzimmer, verbindet sich im Keller zum Access Point, also eine Lampe im ersten Stock verbindet sich zum Access Point im Keller, warum auch immer, alles andere kann ich ja nachvollziehen, aber die Lampe meint, sie muss ins Keller, muss muss ins Keller, alles gleiche SSIDs, ja ja, ich habe den AP AC Throne erreicht im ganzen Haus, ja, also du kriegst aber garantiert Probleme, wenn du eingestellt hast, dass 5 WiFi 6, also 5 GHz Geräte gezwungen werden 5 GHz zu verwenden, dann hast du bestimmt Empfangsprobleme, das würde ich nämlich immer ausschalten, ja ja, du musst die Automat, genau das meine ich Asuro, die automatische Optimierung muss unbedingt aus, das ist totaler Müll, automatische Optimierung macht ja so Sachen wie 5G Geräte, ich sage schon 5G, stimmt ja nicht, WiFi 6 5 GHz Geräte müssten 5 GHz verwenden, das ist totaler Fail, wenn ich aufs Klo gehe und nur 2,4 habe und das ganze bisschen langsamer ist, soll mir auch recht sein, weil das ist einfach so, 2,4 GHz wedern geht einfach bedeutend besser durch Wände und hat dementsprechend eine bessere Reichweite als 5 GHz, dafür ist 5 GHz schneller und je nach Auslastung in der Region, hast du damit eh dann mehr Performance, hast du für deine APs irgendein Steering damit sich absprechen, wer für welches Gerät ist oder hast du einfach, ich habe auf allen Geräten die gleiche SSIDs, aber das UniFi Zeug macht unter der Haube schon Access Point Roaming, also das ist relativ gut, also ich kann beispielsweise irgendwie Musikstreams laufen haben oder Internetradio oder sonst was auf dem Handy und durchs Haus laufen das bricht nicht ab, man kann das in den Settings auch ausstellen, ja Leistung auf Mittel habe ich auch gemacht im Erdgeschoss, ich stelle jetzt aber auch nichts mehr dran rum, weil es funktioniert alles ziemlich gut, ja also davon halte ich auch nichts, also für Netzwerkgeräte an sich, außer Access Point, ich habe einen UniFi Edge Switch mit 10G, die sind alles auch ganz gut, aber für alle anderen Sachen würde ich das auch nicht nehmen. Da habe ich entweder meine MikroTik Kisten, die ja von der Bedienung her auch nicht alles andere als Referenz sind, also gerade Bruter OS auf MikroTik ist ja wirklich schon absoluter Wildwuchs, ich meine hier WebFick ist einfach, ich muss mir mal lachen, wenn ich das komische Wort lese, ich meine es ist WebConfig, aber es ist WebFick, es gehört zu WebFig, aber ich muss mir mal lachen, wenn ich das lese, das ist halt auch schon ziemlich, ich will nicht quick, ich will WebFick, das ist halt auch schon ziemlich BigBrain, das ganze MikroTik Ding, du hast hier 30 Milliarden Einstellungen, die du machen kannst, IPsec ist halt auch mit allen möglichen Sachen und sonst wie, ihr habt es gesehen doppelten Tastendruck hier wieder und damit bin ich aber privat ganz zufrieden, ich habe ja relativ viel MikroTik, also ich habe eine Mischung bei mir daheim aus Unify Geräten als Access Point und als, ich nenne es mal jetzt Core Switch, also halt mein 10 Gigabit Switch, wo dann alles andere dran angeschlossen wird, nicht wirklich ein Core Switch, aber ihr wisst was ich meine, mit feuchtem Atem in die Maus hauchen, wenn du eine Logitech hast, damit lässt sich Doppelklick lösen, ja Doppelklick geht ja, aber manchmal macht er doppelt, soll ich mal da rein hauchen, ok, so ob das jetzt was gebracht hat, habe ich so meine Zweifel, das glaube ich nicht, so also zumindest, mein Netzwerk besteht so aus einer Mischung aus Ubiquity, also die Access Points und meinem Edge, 10 Gigabyte Edge Switch und der Rest ist eigentlich MikroTik, also der Router ist MikroTik, Switch im Wohnzimmer ist MikroTik, Switch im Erdgeschoss ist MikroTik, Switch im Keller ist MikroTik, ja gut, dann habe ich noch eine Fritzbox für VoIP, bleibt da nichts anderes übrig, VoIP willst du nicht selber machen, da glaube ich, gibt es Leute die so massu schiesslich sind und daheim VoIP bzw. irgendwelche IP Telefonie selbst machen und nicht was fertiges nehmen, also ich muss euch ehrlich sagen, VoIP ist eines der painst champigsten IT Themen, die ich kenne, ist die VoIP Fritzbox als Client im Netzwerk, ne die ist gar nicht im WLAN, die ist bei Kabel angeschlossen, also bei mir sieht das so aus, machen wir mal wieder Huge Massive Pain Skills, also bei mir sieht das so aus, als nächster ist die Unity Media, dieses Drecks Teil, Connectbox, so, dann ist direkt daran angeschlossen, eine Fritzbox von AVM, wo manche Leute behaupten es wäre die rote Pest aus Berlin, aber das ist eine Fritzbox, so die ist direkt daran angeschlossen, an die Unity Media Connectbox, dann haben wir hier einen Mikrotik Router, ich mal mal wie das angeschlossen ist, und da ist dann mein 10G Switch dran, machen wir mal ein bisschen größer, 10G Switch, so, und dann haben wir, dann haben wir, dann haben wir, dann haben wir, Access Points, AP, und das ganze quasi dann dreimal, stimmt nicht ganz, stimmt nicht ganz, da ist noch ein Switch dazwischen, weil da unten noch der Raspberry Pi dran ist, so, so sieht das bei mir ungefähr aus, netzwerktechnisch, jetzt ohne Geräte und ohne sinnlose Zwischendinger, ja, so sieht das aus, so, und hier ist das ganze interne Zeug dran, ja, gut, was gibt es da groß zu zeigen, ich meine in Wirklichkeit ist es so, dass hier im Erdgeschoss, ah das ist doof, hier im Erdgeschoss, ne das kann man so nicht malen, hier ist eigentlich noch ein Switch dabei, und hier im Erdgeschoss hängt dann zum Beispiel noch ein Raspberry Pi dran, für Unify Controller und meine Überwachungskameras, der ist da dran, der ist ganz praktisch, weil der hängt quasi am gleichen Switch, das Dinge so konfiguriert, WLAN technisch, dass der halt im gleichen physischen Layer 2 Ding hängt wie die Axis Points, das heißt der kann die da drüber steuern, ja, genau, und Axis Points haben WLAN 1 default und WLAN 1337 für IoT, also die machen 2 WLANs, die machen quasi einmal, einmal quasi, nennen wir es mal irgendwie, keine Ahnung, ja, client WLAN, und dann machen die nochmal hier, man machs mal, machs mal orange, so und dann machen die noch ein IoT WLAN, ich speichere mir das mal, das können wir bestimmt gebrauchen, ja so ist das, so ist das bei mir daheim aufgebaut, na und hier ist dann zum Beispiel auch der Internet Server mit Time Automatisierung drauf, und hier ist auch mein Rechner drauf, das hier ist auch das Nass, das ist ja die gleiche Kiste, die Gigabits mäßig dran, ja, ja und VoIP geht halt hier drüber, das hängt halt direkt außen dran, da ist halt, braucht ja auch hier gar nicht dahinter zu sein, was haben die Portallöcher jetzt dazu, was, hä, so und, ja hier hängen da noch solche Sachen dran, wie, ah hier gibt es, ups, hier gibt es da noch so Sachen wie deckt, deckt, Telefone und sowas, Jane doch nicht rumspammen, so, so sieht das bei mir daheim aus, exellent, gut, also wo sind wir denn stehen geblieben, wow danke für den Sub, skalieren mit dem Unify Controller, klar aber bei mir skaliert alles, diagonal 4D, ich mein sogar Lull ist dreidimensional, skaliert schon, krass eigentlich, dass Leute noch Festnetz Telefone nutzen, na ja, warum nicht, ich mein, ich hab ne App bei mir auf dem Handy von meinem VoIP Anbieter, dass das Handy auch klingelt, das ist lustig, da kann man unterwegs dran gehen, aber daheim, ich hab ja nicht unbedingt immer das Handy am Start, na also ich hab, ich hab zwei Fritz Phones dran, also wirklich so ein oldschool analog, nein ist ja nicht analog, ist halt deckt Zeug, ich hab zwei Fritz Phones dran und ne VoIP App auf dem Handy, ja hier drüber geht unter anderem auch die Tür klingelt dann, dann hast du deine ganze Anrufliste wieder auf mehreren Geräten verteilt, ja, gut alles was über die Rufnummer reinkommt, ist kein Problem, aber ja klar hab ich, aber das stört mich nicht, großartig, naja, mal ne Frage an die Haltnasen, ich bin letztes Jahr in die IT umgestiegen, von wo, was hast du vorher gemacht, schreib mal Ed Wupplos dabei falls du noch da bist und antwortest, dass ich sehe, weil ich bin mit dem Chat ziemlich hinten dran, ich bin letztes Jahr in der IT umgestiegen und hab mir einen kompletten Java Script Stack angeeignet, jetzt bin ich bei einer Firma runtergekommen die voll auf Java, ein Bylight, nein so schlimm ist das gar nicht und Angular Sets, kann das sein, dass diese Full Stack JavaScript Application noch nicht so im Umlauf sind, hab das Gefühl alles den Sets, naja, ich persönlich bin ja der Ansicht, Full Stack JavaScript gibt es nur, aus dem Grund, weil Frontend Leute unbedingt auch Backend machen wollten, ansonsten, wenn man mal ehrlich ist, hat Node.js keinen sittlichen Mehrwert, weißte, da regen sich jetzt ganz viele Node.js Entwickler drüber auf und sagen Max das geht doch nicht, ich mein klar, nein es stimmt so nicht, wie ich das gesagt hab, doch es hat schon einen gewissen Mehrwert, du hast zum Beispiel den Vorteil, dass du, wenn man das, das ist in der Theorie so, ich weiß nicht wie oft das wirklich in der Praxis vorkommt, du kannst schon deine Models zum Beispiel sharen zwischen Frontend und Backend, das ist dann eventuell ganz, ganz nice, Node.js hat den Vorteil, dass es relativ easy zu benutzen ist und der größte Vorteil von Node.js kommt nicht unbedingt dadurch, dass es Node.js ist, sondern dadurch, dass NPM einfach für nahezu alles irgendwelche Packages hat, also das große Ökosystem auf NPM ist tatsächlich ein echter Pluspunkt, aber ansonsten muss man ehrlich sagen, is even, is odd, ja es gibt totalen Schwachsinn, aber halt wenn du NPM installierst siehst du halt und installierst es halt im Internet, aber ansonsten muss ich sagen, die Kombination aus Java und Angular gut, ich muss dir ehrlich sagen, Angular war wirklich nicht meine favorisierte Sache, ich hab damit nie großartig was gemacht, ich hab da mal zu Angular 1 Zeiten was zugesehen, das fand ich ganz cool, aber mittlerweile ist Angular, ich hab da auch keinen Bock drauf mich damit mal zu beschäftigen, für mich als Außenstehender sieht Angular einfach nach einem riesen Haufen bloated, das ist quasi so das Java der JavaScript Frameworks mit Dependency Injection und Factories und Adapter Pattern und ach keine Ahnung was es da nicht alles gibt, das ist halt ein riesen Ding, ja, also ich persönlich mag ja Kombination, könnt ihr euch jetzt fast schon denken, ASP.NET Core und Vue.js, aber so richtige Fullstack JavaScript Applikation, ich weiß gar nicht wieviel es davon wirklich live gibt, zum üben und basteln ist Node immer gut, aber was fällt euch aus dem Kopf ein, wer hat, wer von den großen Services ist komplett Node.js, also YouTube ist glaube ich irgendeine Mischung aus Python und, nee nicht PAP, was ist YouTube C++ und Python oder so, nee Discord Electron zählt nicht, mein Server Backend, dann hast du Twitter, die waren mal Ruby, Ruby on Rails, aber ich glaube mittlerweile ist Twitter irgendwas JVM Java basiert das auch, ja, also so wirklich Fullstack Javaske, mir fällt jetzt da nicht so viel ein ehrlich gesagt, das stimmt ganz viele hippe Startups, aber das ist tatsächlich, das ist also die Kombination aus Java im Backend und gut ob es jetzt Angular oder was anderes ist, Frontend ist so ziemlich weit verbreitende Business Geschichte, wobei ich von der Java, von der Java Welt keine Ahnung habe, aber ich sag mal so, ich kann es lesen, ich könnte auch was drin programmieren, aber muss nicht unbedingt sein, ja was unsere Azubis aktuell machen wird mich wirklich mal interessieren, lange nichts davon gehört, der eine hat mir letztens eine Azure Function eingerichtet, hat er zwei Tage rumgeklickt, aber ansonsten habe ich lange nichts mehr von unseren Azubis gehört, ja gut, da haben wir auf der Arbeit auch einen, bei dem weiß ich, der ist irgendwie auch schon keine Ahnung, 150 Jahre verheiratet, da sagt er immer, dass ihn seine Frau nervt und deswegen geht er auf die Arbeit, da war auch fast die gesamte Corona Zeit auf der Arbeit in Frankfurt, aber ich habe ja auch keine Schmerzen damit, wenn die Leute hingehen, dass sie daheim was stört, aber man sollte nicht den Leuten, die daheim bleiben wollen, dann auch noch Steine in den Weg legen, Deko 50 Billar, danke schön für den Sub, äh nicht Sub, für die Bits, das sind quasi, das ist ungefähr, das sind 5 Euro quasi, was ein Sub auch kosten würde, der Scam Train steigt nicht, nein, der Scam Train ist immer vor dem Chef im Betrieb, der Scam Train schläft nicht, der Scam Train ist immer vor dem Chef im Betrieb und scammt die Subs schweißfrei, der Scam Train wird nie müde, genau, ey 50 Euro, ne, warte mal, ne, den kenne ich nicht, der fährt in die andere Richtung, ne, ja, das ist eh lustig, ne, überall schieben sie immer noch Corona Panik, aber wenn die Bahn streikt und da sich die Leute stapeln, das interessiert keinen, ja, das glaube ich auch, das glaube ich auch, ich könnte mir vorstellen, dass die Stonks Manager, dass die gar nicht überrascht sind, dass die das einfach nur vorschieben mit wir sind überrascht, dass die Leute denken so, oh vielleicht sollten wir das mal nicht so machen, aber ich glaube, ich war einer der ersten, die offiziell diese Arbeitszeitänderung eingereicht haben bei uns, sobald ich gehört habe, ich meine, wir haben das ja vorher schon oft gemacht mit Home Office, aber sobald ich gehört habe, dass wir jetzt offiziell mit Arbeitszeitänderung und so das machen können, ich war glaube ich, keine Ahnung, 2 Stunden nachdem das veröffentlicht wurde, dass es das gibt, hatte ich das Ding ausgefüllt und meinem Chef geschickt. Die Musik ist tatsächlich sogar relativ laut, aber die ist halt sehr gechillort, gechillsort. Doch, danke für den Sub, 4 Monate, Max420, hey, ich bin der erste, also wenn jemand darüber abstimmen würde oder so, ob Cannabis legalisiert werden soll, ich bin der erste, der sagen würde, ja, ich selber, rauch nix, was gibt es da sonst noch, rauch nix, schnief nix, trink nix, spritz nix, ich mach nichts davon, aber ich bin trotzdem für die Legalisierung. Hüton, der Wein vom Italiener geht, ne, ihr kennt mich, ich trinke auch kaum was, also was das angeht, habe ich einen äußerst gesunden Lebensstil, aber ich bin zu fett. Ich kann aber nicht alles haben. Der Cute Mod, ja, das frage ich mich auch, von dem habe ich schon lange nichts mehr gehört, wo ist der Cute Mod, was hältst du von Fullstack Javascript App, Javascript, Beispiel, oh Gott, die Abkürzung Javascript, ich muss kurz überlegen, was ist Maven, View, Angular, ach du Scheiße, Javascript Stack Abkürzung, Note, Note, was ist denn, okay, was ist M und was ist E in dem Fall, MongoDB könnte sein, für Datenbank, Ah, Express, ja, du hast Recht, ja, wegen Express, MongoDB, Express, View und Note, oh, das gleiche hier mit Angular, okay, ja, also es kommt ein bisschen drauf an, ich könnte mir vorstellen, dass irgendwelche hippe Startups das schon so machen, aber gerade bei uns so im Bankenumfeld, da wo ich arbeite, ist Java das Ding, also Java Backend, sonst da führt kein Weg dran vorbei, der andere Seite mal ganz ehrlich, ich sehe immer noch nicht den großen Vorteil von, ich habe ja gerade so ein paar Sachen aufgezählt, aber ich sehe immer noch nicht den großen Vorteil von alles Javascript, außer eben, dass wenn man halt Javascript gut kann und Frontend-Stells macht und vielleicht ein bisschen Logik scheren will zwischen Frontend und Backend, dann kann ich mir das, kann ich mir das vorteilhaft vorstellen, aber ansonsten, was spricht gegen, sagen wir, C-Sharp, Java, PHP, was auch immer, Backend und man lässt Javascript im Frontend, da wo es seine Stärken hat, spricht da überhaupt nichts dagegen, weil, wenn du jetzt, ob du jetzt irgendeine API hast in Node oder in Java, macht doch eigentlich keinen Unterschied, kannst auch Django machen oder so, Python, Python, Python, kannst du auch machen, Ruby on Rails kannst du auch machen, Spring Boot, Kotlin, alles mögliche, Cobol, Rest API, ich glaube es gibt keinen Webserver in Cobol, gibt es einen Cobol Webserver, warum, heute programmieren wir eine Webseite mit Cobol, ja Moment, der verwendet auch einen fertigen Webserver, der verwendet auch einen fertigen Webserver, jaja, die verwenden auch einen fertigen Webserver, gibt es einen Cobol Webserver, was, Cobol on Wheelchair, Microweb Framework for Cobol, Moment, Moment, warum gibt es sowas, ja gut, der Typ hat auch kein Bock, das zu supporten, Cobol on Cocks, ja, die machen das, der Webserver, es hat keiner Bock einen Webserver in Cobol zu programmieren, guck, die lassen die Webserver Geschichte auch über Apache machen, keiner mag Cobol Webserver programmieren, ich weiß gar nicht, kann man überhaupt Sockets gescheit ansprechen, über Cobol bestimmt, Crap, Alter, ok, komm weiter, wollt ihr übrigens, das ist übrigens der Titel, ist ein bisschen Chebat, gebe ich zu, ich habe ja gesagt, so viele Sachen einkaufen muss ich gar nicht, ich bin eigentlich nur angekommen, dass ich ein bisschen mit euch schwätzen kann, aber ein paar Sachen muss ich doch gleich noch einkaufen, aber ich gucke erstmal Chat durch, wir haben ja Zeit, kennst du eine Möglichkeit, den Python Console Output in Tick, mit diesem TCL, nicht Web GUI Zeug, hab ich nie großartig was gemacht, keine Ahnung, aber das eingebaute Python GUI ist schon Paynes Champ, ich probiere Gehub mal aus später, will es jetzt hier nicht im Stream installieren, sonst kackt es mir ab und mein Haus geht nicht mehr oder so was, kann man in Gehub Makros machen, ich brauche Makros, das ist wichtig, ich brauche Makros, also ordentliche Makros, am besten mit Lua, das war das beste an der Logitech Software, dass man nur an Makros machen konnte, gucken wir uns gleich an, ich habe heute wieder bei Absolut Basic Dinge gefailt, ich wollte mir ein neues Deo kaufen und ich habe das falsche gekauft, aber die Benamungen sind ja auch richtig bescheuert, guckt euch das mal an, wie viele Sachen die mit Pure im Namen haben, das sind 50 Seiten mit Pure, Pure Fresh, Pure Ocean, Pure sonst was, Pure Nature, Pure Natural, Pure sonst was, ja ich habe es falsche gekauft, richtig bei den Basic Dingen des täglichen Lebens gefailt wieder, alles bloated, ok wir gucken uns jetzt das Video an mit der Insulinpumpe, nee ich muss den Chat vorher fertig machen, lieber in Java und dann out of Memory, geht eigentlich, eigentlich sollte ja sowas wie ein Garbage Collector in Java dafür sorgen, dass du weniger Memory Leaks produzierst, aber auf der anderen Seite ist es überhaupt kein Problem in Java und C Sharp Memory Leaks zu fabrizieren, selbst ohne Unsafe Code, also nichts einfacher als das als das Memory Leak in C Sharp zu fabrizieren, schon cringe, kein WiFi 6 im Keller, ja ich weiß, weiß, richtig richtig cringe, also ich glaube WiFi 6 beziehungsweise so 5-600 Mbit braucht man unbedingt im Keller, das ist ganz wichtig, der ist gut, ja da habe ich auch im Erdgeschoss, ja pvz kann man immer mal wieder neu installieren und dann durchspielen, das ist ja selbst mit allem was es so zu machen gibt, relativ schnell durchgespielt, kannst ein paar Tage immer mal wieder spielen, dann ist es durch, ja schon ein bisschen cringe, ich weiß, ja alles gleiche SSID, ja das muss man unbedingt machen im Unify Controller, ich zeige euch mal wie das aussieht, da gibt es so, gibt es so ein Bild, ja zeig mal, ja super, super geile Auflösung, ah yes, erkennt ihr alles, ich finde das ist schon ziemlich gut, sag mal warum ist denn die Quali so kacke, es gibt hier genau, es gibt hier irgendwo ein Dings, ne nicht Advanced Features, es gibt hier irgendwo sowas Auto Optimize Network und das müsst ihr unbedingt ausschalten, ja, wo auch immer das jetzt ist, da hier, das da ist es, das muss man ausschalten oder wenn man keine Probleme hat, kann man das natürlich auch angeschaltet lassen, das ist jetzt keine Pflicht, aber das Ding hat einen Nachteil wenn das angeschaltet ist und zwar wenn das Unify Zeug gemerkt hat, dass euer Gerät, sag mal mal euer Smartphone oder so, 5 Gigahertz SP ich es, dann zwingt es das Gerät sich mit 5 Gigahertz zu verbinden und 5 Gigahertz geht halt oftmals nicht so weit wie 2,4 Gigahertz WLAN, dementsprechend kann es durchaus sein, dass der Access Point nicht weit weg ist und ihr auf dem Klo trotzdem keinen richtigen Empfang habt, eigentlich schon richtig cringe, was ist denn OpenNet Admin, das kenne ich nicht, aber was hat das denn mit DNS, DHCP Integration zu tun, du kannst damit doch nicht deine Unify Geräte einstellen oder, ONA, das ist ein IP Adress Management oder, Online Demo, sieht aus wie 1995, ja es sieht wirklich aus wie 1995, oh Leute ist das, ist das Dings, wie heißt dieses JavaScript Framework, was auch TV Headend und sonst was, nicht Express, so ein ganz altes, so ein ganz ganz altes Java, das sieht aus wie, ich hab vergessen wie das heißt, XJS, XJS, genau, so sieht das aus, wo ich mich immer gefragt hab, warum um alles in der Welt benutzt man sowas, ja XJS, XJS ist wirklich richtig a pain in the ass, alter, guck mal den Kram, den will schon gar keiner mehr verwenden, ZIP Calling ist cringe, ja alles, alles ist cringe, alles was man selbst nicht gut findet ist prinzipiell erstmal cringe, das war ja nur, Moment mal, in diesem Clip, das war ja nur dazu da, um zu demonstrieren, dass, ich weiß gar nicht mehr, was wollte ich denn da nochmal da, irgendwas wo ich gesagt hab, man muss sich selbst schlagen, niemals VoIP selber, ja seh ich auch so, oh nice, will sie überhaupt Festnetz telefonen, tja, richtig Boomer, was soll ich sagen, bin alt genug, cac.box gibt's das wirklich, mach ich jetzt aber nicht auf, cacw.services gibt's, beste Domain die ihr euch merken müsst, aktuell hab ich den Server runtergefahren, aber hier, cacw.services, jemand zufällig die Idee für einen Router, der nicht die Welt kostet, aber ein bisschen mehr Routing Kapazität hat, als das Unify, Dings, Blah Gateway, der x-beliebige Mikrotik Router für 50 Euro, aber Video Streams darüber laufen lassen, Müss muss auch funktionieren, kann nicht sein, dass bei einem einzelnen User mit 1-2 Streams das Ding irgendwie Probleme macht, das muss anderes, das muss andere Probleme haben, das muss an was anderem liegen. Die Connectbox ist von Unity Media oder Vodafone jetzt, aber zu Unity Media Zeiten war die Connectbox so ein Hybridgerät aus Modem, mit ein bisschen WLAN und mit ein bisschen Switch und mit ein bisschen Telefon, also quasi die Fritzbox von Unity Media sozusagen, hab ich aber alles ausgeschaltet. Ja, muss ich mal gucken, gerade was Heimautomatisierung angeht, hab ich das schon lange vor da mal eine Tour zu machen, aber ich muss gucken, dass ich nicht wupp wupp leake zu viel, da hätt ich viel zu tun, bis ich da alle Clients eingemalt hab, also das merke ich, wenn ich durch meinen DHCP scrolle und es haben nicht mal alle dynamische IPs, da bin ich gut beschäftigt. Die Connectbox hat glaube ich sogar 4 Netzwerkanschlüsse, vielleicht sogar 5. Wo geht das Internet rein, na hier, hier kommt, hier kommt das Kabel aus dem Keller, wie gesagt ich hab Raspberry Pi, Raspberry Pi mit Unify Controller, DN Punt, Dankeschön für den Sub Overlay hier, huge ihr beiden, neun Monate sogar schon, Massive Subscription hier, welches wieder am 10G Switch, boah muss ich jetzt nachgucken, ja ich hab mich da drüber schon ausgelassen, ich find's scheiße, wohlgemerkt nicht, dass die das Recht haben zu streiken sondern die Auswirkungen find ich scheiße und mir ist es egal, ob es an der Bahn oder an der GDL liegt, ich will einfach nur fahren und pünktlich ankommen. Unify Controller in Kubernetes, ich bin mir nicht sicher, ob das überhaupt gescheit funktioniert, aber dann können wir hyperscalen diagonal, wenn der in Kubernetes ist, achtdimensional, dann schon, ja das hab ich auch schon gesehen, es gibt, ich hab gesehen, es gibt für, also für den ESP32, es gibt MicroPython, es gibt eine Lua Geschichte, es gibt die übliche standardmäßige C, C++ Geschichte und ich glaube es gibt auch mittlerweile die Möglichkeit Javascript auszuführen, warum auch immer man das machen will, aber das geht, du hast mit Bode im Back, was ist Bode, gibt es nicht, Bode gibt es nicht, ja in dem Fall wirklich lieber C++, ach no, ich hab mit Bode, alter, he lacks critical information, also nix, aber dass es standardmäßig Javascript frontend am Start ist, ist schon ein bisschen übertrieben, Angular übertreibt es halt komplett, tatsächlich, ich glaube dafür ist es wirklich gut, aber die meisten, die damit anfangen, also wenn das businessmäßig benutzt wird, die machen damit bestimmt auch kleine Sachen, einfach so nach dem Motto, es gibt ja, es gibt ja, das verstehe ich auch nicht so genau, ja, das habe ich jetzt schon öfters gehört, dass manche Unternehmen, gerade jetzt nicht so supergroße, sondern durchaus auch kleinere, dass sie total festgefahren sind auf so eine gewisse Technik, die sagen dann, wir machen nur.NET oder keine Ahnung, oder wir machen nur Angular, warum, ich verstehe das immer nicht, warum legt man sich schon im Voraus auf irgendwas fest und sagt, dass man prinzipiell alles damit macht, ich meine, ok, wenn man die Leute und die Programmierer hat, die sich damit am besten auskennen, ich mache auch die meisten Sachen in C-Sharp, weil es mir meine Lieblingssprache ist, aber wenn sich was anderes anbietet, weil es eben die Vorteile überwiegt von einer anderen Technologie, ja, dann sehe ich da kein Problem drin, dass mit was anderem, zumal ich habe schon Sachen in Go gemacht, sogar in C, in JavaScript, in Ruby, in Python, alles mögliche schon, warum auch nicht? Ja, kann man sich darüber streiten, ich glaube, das ist alles durchaus in Ordnung, was es an Frontend gibt, und ich muss sagen, ich finde es ja ganz gut mittlerweile, was JavaScript angeht, dass sich View, React und Angular durchgesetzt haben, es entsteht zwar immer noch täglich 50 neue JavaScript-Frameworks, aber die großen drei sind über die letzten Jahre doch relativ beständig, was gibt es denn so Neues an JavaScript-Frameworks, was richtig, auch mal Svelte gibt es vielleicht noch, aber was auch mal so richtig User anzieht, du hast View, Angular, React, Deno ist kein Frontend-Framework, Deno ist Node-Abklatsch, Svelte ist vielleicht noch so ein bisschen so ein Ding, aber ansonsten, die großen drei und gut ist, das finde ich gut, das hat mal ein bisschen Stabilität in dieses JavaScript-Ökosystem gebracht, wo ja sonst jeden Tag jeder was anderes gebaut hat und keine Woche mal was Gleiches verwendet wurde, ja gibt es ja nicht mehr jetzt in dem Umfang, was heute gekauft wird, gleich, gleich, Single-Side, ne, was ist SSR, immer die ganzen Abkürzungen, Single Responsibility oder was soll das sein, Ach Server-Side Rendering, ja ok, das verstehe ich, das verstehe ich, ja das lasse ich mir gefallen, ja Server-Side Rendering, das verstehe ich, ja Bing-Picture-of-the-Day ist wichtig heute, was ist denn Bing-Picture-of-the-Day, Bing-Picture-of-the-Day, Image of the Day, ein Kegel, sieht ein bisschen aus wie der Todesberg aus Zelda, ein Vulkan, we finish to go backend plus Ruby on Rails frontend, was, das ergibt keinen Sinn, das sind beides backend Geschichten, wie soll das funktionieren, hast gesehen Microsoft Asher hatte Sicherheitslücken beim DB Service, jeder konnte RW drauf zugreifen, ja habe ich gelesen, ich habe sie aber nicht genauer angeguckt, aber tja, Datenbank-Stellz, Kosmos-DB-Stellz, war es glaube ich, kann schon mal passieren, ja, auf welche Fettnäpfchen sollte man beim ersten Arbeitstag, da habe ich ein Video zu, guck mal, vielleicht hast du das auch schon gesehen, ich weiß nicht, hier schau mal da, Tipps für den ersten Arbeitstag, wenn nicht, kannst du es mal angucken, ich habe deine Nachricht überlesen, oh ich glaube nicht, ich war einfach nur langsam, ich glaube mittlerweile habe ich was zu gesagt oder, der Sebaro lebt, bewegt mich ziemlich, dass der Sebaro noch lebt, äh nein, ich weiß was es ist und so grob wofür es da ist, aber damit habe ich noch gar nichts gemacht, ich bin wieder begeistert was es alles gibt, ja, ist echt so, gerade, wie gesagt, gerade hier im Big Stonks Banken-Umfeld, es ist saumäßig viel Java, kenn es ja von uns, warum wird heute alles über HTTP gemacht, von Sauerei oder, was ist aus den guten alten Sachen geworden, warum überhaupt TCP, das ist alles so wahnsinnig bloated, ich bin wieder für IPX und NetBOI und sowas, die guten alten Klassiker sollten wir mal wieder rausholen, HTTP bloated Shit da, FDP genau, die Leute wissen heute überhaupt nicht mehr was FDP ist, ich denke das hat was mit Melinda zu tun oder so, nee, FDP oder WebDAF oder so, schau mal das von Notschritt, ja, das ist ein Notizprogramm für Mac, ja, ich glaube wir haben hier einige Leute, die sweetpiesen auskennen, Jithub, kannst du als Gist, als Gist hochladen auf Jithub und posten, da haben wir bestimmt ein paar Leute, die sich damit auskennen, für Nicht-Programmierer, was ist dein Memory Leak, wenn du Speicher belegst und den nicht mehr freigibst und das nächste Mal wieder Speicher belegst und den nicht mehr freigibst, wenn du vergisst Speicher freizugeben, möglichst an Stellen wo du das auch noch öfters machst, dann benutzt dein Programm immer mehr RAM und gib dir nie frei und irgendwann hast du ein kleines Furzprogramm, was 3GB verbraucht und irgendwann crasht und die besten Memory Leaks macht man immer noch mit C++, ah, das ist eine gute Frage, was ist so ein gutes Programmiersprachen Portfolio nach dem Studio, also als erstes finde ich wichtig, dass man eine Sprache wirklich gut kann, das macht vieles einfacher, gerade auch das Lernen weiterer Sprachen, aber man braucht so eine 0815 Standard Sprache, immer wenn man was machen will, dass man einfach sich weniger mit der Sprache beschäftigen muss, wird heute noch geschoppt, ja ja ein paar Sachen kaufen wir noch ein, wie gesagt, ich sag ihr, der Titel ist heute ein bisschen gebait gewesen, ich hab einige Sachen, aber hält sich in Grenzen, ich hab den Stream heute angemacht, dass wir ein bisschen schwätzen können, kennst dich von YouTube, ja nice, dass du den Weg her gefunden hast, du hast dir leider heute einen relativ langweiligen Stream ausgesucht, also es ist wichtig, dass man eine Sprache wirklich gut kann, weil wenn irgendjemand mal zu dir kommt und fragst, kannst du xy machen, dann musst du dich nicht groß um die Sprache kümmern, sondern so sagst, ja mach ich, machst deine Standard IDE auf, redet vor was auch immer und bastelst in deiner Standard Sprache los, erstmal gar nicht so wichtig, was das ist, wichtig ist, dass du eine Sprache wirklich flüssig kannst, auch die Standard Library dazu, dass du einfach Probleme relativ schnell lösen kannst, so und das bringt dir natürlich auch was, wenn du weitere Sprachen lernen willst, aber kommen wir mal zu dem Punkt, also wenn es ins Cloud Umfeld geht, dann ist auf jeden Fall Go angesagt, Go, Python, so diese Kombination ist, gerade Github Projekte gehen ja da durch die Decke, allerdings würde ich dir trotzdem noch eine ordentliche Backend Sprache mit der nötigen Performance empfehlen plus Javascript, Go, Python, Javascript und dann suchst du dir aus C Sharp, Java, irgendwas, das ist eine gute Mischung, Javascript Frontend brauchst du, am Frontend kommst du eigentlich nicht vorbei, also Javascript ist Pflicht mittlerweile, wie gesagt das muss nicht deine beste Sprache sein, aber du sollst ein bisschen durchblicken, mit Go, Python und dann irgendwie x-beliebische andere Backendsprache noch, irgendwas, was du auch mal Performance mäßig verwenden kannst, wie gesagt es ist egal, ob C Sharp ist, Java, kannst auch Go im Backend verwenden, ja, aber also Python, Go, Javascript ist wunderbar, ich würde halt noch irgendwas klassisches Objektorientiertes noch ein bisschen dazu empfehlen, Java ist sicherlich die Business Variante. Was macht Go so gut fürs Backend, Go hat ein paar große Vorteile was Cloud angeht, dadurch dass du Self Contained Executables hast, die auch nicht so wahnsinnig groß sind, so ein Go Programm fällt raus als ausführbare Datei mit allem was dabei ist, keine Frameworks mehr installieren und nix, das ist so eines der Sachen die und rückwärts kompatibel lauffähig bis Linux Kernel 2.6.32 oder so, also das ist gerade für, ähm, wir skalieren Container rauf und runter und schieben neue Versionen hin, das macht halt Go richtig gut, so und was die Sprache an sich auszeichnet, du kannst dir übrigens mal ein Video dazu angucken, ich hab ja ein Video zur Einsteigerprogrammiersprache gemacht, aber sie hat ja so das Aushängeschild von Go, ist ja die ganze, ich weiß ich sollte es nicht Multithreading nennen, weil das ist es ja nicht, es sind ja Go Routines, das muss ja nicht zwangsläufig Asynchron oder ein eigener Thread sein, aber ich sag das jetzt mal trotzdem, du kannst in Go relativ gut asynchrone Sachen machen, ohne dass es blockt und auch Interthread Kommunikation und so ist, in Go relativ gut, dazu kommt, dass Go noch eine halbwegs umfangreiche Standard Library hat und was halt auch mittlerweile in Go richtig gut ist, dass du einen ziemlich großen Library Pool auf GitHub hast, für alles mögliche. Ich persönlich mag Go nicht so sehr, ich hab schon Sachen in Go gemacht, aber ich werd mit der Syntax einfach nicht so hundertprozentig warm. Es gibt dann so ein paar Sachen bei Go, also das verstehe ich nicht, einmal, dass sie dich compilertechnisch so gängeln, so nach dem Motto Unused Imports, Compiler Fehler, warum sind Unused Imports Compiler Fehler, es sollte zumindest einen Flag geben, dass man das ausschalten kann oder Unused Variables Compiler Fehler, du willst erstmal was auskommentieren und testen, ob es daran lag, nein kannst du nicht, weil du noch 50 andere Sachen auch auskommentieren musst. Das find ich nervig bei Go, es wäre ja vollkommen in Ordnung, wenn man sagt, hey ich mach ein Release Build, dann will ich das nicht haben, aber das ist nervig, ne ja, Visual Studio Coach schmeißt vielleicht die Imports automatisch raus, aber nicht Unused Variables, es ist auf jeden Fall nervig. So und dann, was ich in Go auch nicht so schön finde, ist, dass die an manchen Stellen sehr minimalistisch sind, so nach dem Motto, warum soll ich einen Array mit Filter und Select haben, wenn ich doch Vorschleifen machen kann, ist also die Go Philosophie, Go hat mal ganz gerne 3 Nested For Loops, weil es nichts anderes gibt, Generics gibt es auch irgendwann in 50 Jahren mal, ja also ich werd mit Go nicht abschließend warm, was das angeht, es ist aber sicherlich eine Sprache, die aktuell sehr viel Anklang findet. Ja, allerdings, das mag schon sein, dass die dann drin bleiben, deswegen könnte man ja sagen, hey wenn ich ein Release Build mache, dann ist das Pflicht, aber wenn ich am entwickeln bin, das ist einfach für einen schnellen Ausprobier Workflow hinderlich, wenn du immer die Hälfte deines Programms und an unterschiedlichen Stellen auskommentieren willst, wenn du nur eine Sache rausschmeißen willst, also mich nervt das, es gab ja sogar schon mal ein Go Compiler Fork deswegen, ansonsten Go ist aber angesagt, also wie gesagt, Go, Python, Javascript ist eine super Kombination, ich würde halt noch so ein bisschen was alles klassisches Objekt orientieren empfehlen, einfach so für eine Sprache, die erprobt ist und dafür gedacht ist, möglichst schnell und ohne Schnick Schnack Probleme zu lösen, sowas wie C Sharp oder Java. So, ich hatte auch mal versucht bei mir ein IPAM daheim zu installieren, aber ich war dazu faul für, mein IPAM ist mein DHCP Server, das muss reichen, IPAM ist IP Address Management, falls sich das einer fragt. Irko und Dankeschön, 24 Monate Hypersubscription, bietet sich C++ als Main Sprache an, C++ bietet sich nie für irgendetwas an, C Sharp Backend und WPF, genau, genau, genau, so, ja, jetzt jetzt kommen wir der Sache langsam näher, was hältst du von Mutation Testing, ich weiß gar nicht, was das sein soll, ich finde es cool, wie breit hier die Skills seiner Community gefächert sind, ja das stimmt, wir haben hier richtig viele Massive Brain Leute, exzellent, im Chat habt ihr das gesehen, ihr wurdet gelobt, er meint euch, sogar der Chandler ist gemeint, ja, ich finde auch das Frontend generell richtig cringe ist, es könnte einfach alles ein Kommando Zeilen Tool sein, doch, doch, Go ist relativ populär, also ich würde sagen Javascript und Python Go dürften so die populärsten Sprachen auf GitHub, auf Shithub sein, nee, das ist gut, ASP.NET Core finde ich ist mit das beste Web Framework, was es gibt, wenn du mich fragst, ist das besser als Go, exzellent, programmierst du öfters objektorientierend ja so ein bisschen halt, so an denen jetzt nicht so religiös, dass ich sage hier, das muss alles hier mit Factories, Abstracts und Override und was auch immer sein, wenn es hin macht halt, und das finde ich übrigens auch die richtig coole Sache, was Microsoft mit C Sharp macht, die haben sich, die sind zwar quasi mal als Microsoft Javas Clone gestartet, aber die haben Java schon lange hinter sich gelassen, die hatten ja Generics quasi 100 Jahre vor Java, ordentliche, böse Zungen behaupten, Java hat bis heute keine richtigen, die sind sich aber auch nicht so fein, das ganze objektorientiert ein bisschen eben liegen zu lassen und C Sharp ist die letzten Versionen deutlich funktioneller geworden, von Pattern Matching bis Record Types, Immutable Geschichten und so, also das finde ich wirklich gut bei Microsoft. Der, also früher, also C Sharp wurde ja von Anders Halsberg erfunden, das ist der Typ, der auch TypeScript erfunden hat, also auf Auftrag von Microsoft hin, der Typ ist nicht einfach nur Big Brain und sagt, ich erfinde jetzt mal zwei der beliebtesten Programmiersprachen, das hat er schon auf Auftrag gemacht, vorher hat er glaube ich irgendwas mit Pascal, Delphi, Delphi hat er glaube ich vorher gemacht, ja, also der war richtig Big Brain und vorausschauend, was er mit C Sharp gemacht hat und der aktuelle Lead Designer von C Sharp, der heißt glaube ich, jetzt hat es halt irgendein schwedischer Name, Matt Torxen oder so, der ist auch ziemlich Big Brain, was neue Features angeht, Torxon, ne, Torgason, Torgason oder so heißt er glaube ich, ja, du wurdest geforst auf C++, oh Pains Jam, Moment, ich muss mal gucken, wie der Typ heißt, ich hab den Namen jetzt so falsch ausgesprochen, C Sharp Lead Designer, nein nicht anders der Nachfolger von Anders Halsberg, hier den meine ich, Matt Torgason, ok, ja, ok, fast richtig, das macht nichts, was sagt ihr zu Blazor Server Side, ganz ehrlich, ich bin ja großer Fan was Microsoft mit der.NET Entwicklung macht, aber Blazor, im Ernst, also ich verstehe weder den Sinn von Blazor Server Side noch den Sinn von Server, von Blazor Client Side, das leuchtet mir einfach nicht ein, kannst du nur zwei negative C++, oh das wird schwierig, ne, ne, wenn ich damit anfange ist es vorbei, was sind Record Types, oh kann ich das jetzt kurz erklären, das sind Klassen in C Sharp, die standardmäßig immutable sind, also du kannst sie nicht mehr ändern nachdem du sie angelegt hast, was für Multithreading und Performance technisch teilweise ganz gut ist, weil wenn du dir sicher sein kannst, dass eine Klasse sich nie wieder ändern kann nachdem du sie angelegt hast, du kannst Multithreaded dich komplett auslassen, weil ihr könnt euch eine ganz einfache Regel merken, Multithreading ist in 90% der Fällen kein Problem, oder in 99% der Fällen kein Problem, solange ihr nicht parallel schreibt, parallel lesen, kein Problem, parallel lesen und einer schreibt meistens auch kein Problem, aber sobald an zwei verschiedenen Stellen parallel geschrieben wird, procken, in der Regel ist Multithreading kein Problem, wenn ihr einfach nur mehrere Threads lesen, mehrere Threads lesen und ein Thread schreibt, in der Regel, du kannst je nachdem was du machst, du kannst doofe Race Conditions haben, so nach dem Motto, ich schreibe jetzt was rein und das ist halt nicht Atomic und dann lese ich was zur Hälfte aus oder das alte noch oder, ja aber in der Regel ist das in Ordnung, ja 70€ ist teuer, ich hab ja auch eins, aber das war auf jeden Fall billiger, 70€ hat ich dafür nicht ausgegeben, Leute, ich hab den Chat gepackt, easy, so jetzt können wir noch was einkaufen, Poggers, nice, ich hab's geschafft, ok, ich brauch was sehr unspektakuläres, Leute, ich brauch eine USB, eine USB Verlängerung, 2 Meter, sowas hier, bam, 2x2 Meter, Basket, zack, hab ich eigentlich mittlerweile schon alles immer noch, ja, hab ich noch nicht gekauft, ja, das kann ich mal rausschmeißen, zur Cosmos DB Lücke hab ich noch nichts gesagt, weil ich es nur mitbekommen habe, mich nicht näher damit jetzt beschäftigt habe, ich hab's mitbekommen, ich weiß, dass man darauf zugreifen konnte auf die Datenbank von anderen Leuten, Read-Write anscheinend, aber mehr auch nicht, ok, das brauch ich, hab ich euch eigentlich erzählt, meine Hausnummer, meine RGB Hausnummer ist fast da, guck mal hier, ich hatte, Moment, ich muss mal kurz das raussuchen, ich hatte mir 2 Hausnummern bestellt, aber ehrlich gesagt, ich weiß nicht, ob ich die ans Haus dran mache, ich hab die bestellt, dass wir im Stream was zu basteln haben, guck mal hier, RGB Hausnummern und das ganze sieht dann so aus, wenn's fertig ist, ist das nicht Poggers, ist das nicht die nicest Hausnummer überhaupt, also ich finde, das hat schon echt was, oder, wer hat so eine coole Hausnummer, brauch ich unbedingt, ich frag mich nur, ob man im Dunkeln überhaupt die Nummer erkennt, hast du eigentlich an diesem Anspiel-Event für Battlefield 2042 teilgenommen, es gibt noch kein Anspiel-Event, es wird, vielleicht gab's schon eins, aber es wird noch eins geben und da bin ich auch dabei, ja, das war übrigens lustig, die haben mich angeschrieben und haben mich nach meinen Hardware-Specs, das hab ich glaube ich letztes Mal schon erzählt, nach meinen Hardware-Specs gefragt, haben gesagt, ja, 8700k, 1080ti, 32G RAM, 2TB SSD, Platzfrei, überhaupt gar kein Problem her damit und da meinten sie, da krieg ich auf einmal eine Mail als Antwort so nach dem Motto, Max, wir schicken dir einen Leih-PC zum Anspielen zu, da hab ich gesagt, hä, was, warum, Mindestanforderung ist eine RTX 2060, da musste ich dann erstmal sagen, Moment, Moment, meine 1080ti ist 50% schneller als eine 2060, ihr braucht mir kein Recht dazu zu schicken, das hat nichts mit NDA zu tun, Battlefield 2042, ja, wie gesagt, meine Hausnummern sind auf dem Weg, wisst ihr was ich auch lustig finde, ich hab hier mal so ein Video gemacht, China, China, China, wie hieß das, irgendwas mit China, technisch heißt es Chinakram, hab ich mir so ein Video gemacht und dieses Video hat 380 Tage nach Veröffentlichung auf einmal innerhalb von einem Monat 10.000 Views bekommen, ich hab keine Ahnung warum, YouTube-Algorithmus hat sich gedacht, bam, jetzt, jetzt das ist das, was die Leute sehen wollen, nein, nein, nein, nein, das wird schon funktionieren, ich hab fast von löten getweetet, ja, ja, ja, hab ich, übrigens, hat davon eine Ahnung von euch, ihr schaut mal, ich hab mir heute überlegt, ob ich mir nicht Photovoltaik aufs Dach machen soll, ich bin da schon lange am überlegen, aber ich hab heute mal in so einem, im hessischen Sonnenatlas, oder wie das heißt, geguckt, wie mein Dach liegt und mein Dach liegt tatsächlich relativ gut, und ich hab das jetzt mal ausgerechnet, dass, wenn ich mir da ne Anlage draufbauen würde, mit nem Akku, dass ich 50% meines Jahresbedarfs decken könnte, und je nach dem durchaus auch mehr möglich, wenn ich ne größeren Akku nehme, ich würd mich aber halt gerne mal vor Ort beraten lassen, hat da irgendjemand eine Ahnung, wo es da gute Stellen gibt, also ich hab gesehen, bei der Verbraucherzentrale gibt es was für 30 Euro, da kommt dann irgendeine Energie-Experte, keine Ahnung, wie expertisch der ist, aber wahrscheinlich unabhängiger auf jeden Fall als von irgendeinem Anbieter, hat da jemand Erfahrung mit, hat sich jemand mal was Solarsachen angeht beraten lassen, naja natürlich darf ich das selber benutzen, selbstverständlich darf, das ist, das stimmt nicht, also du kannst dir aufs Dach, also da gibt es ja verschiedene Modelle, du kannst entweder alles für dich selbst benutzen und gar nichts einspeisen, aber das ist natürlich nicht so sinnvoll, wenn du gar nichts einspeist, weil wenn du mehr produzierst, als du verbrauchen kannst, da kriegst du wenigstens noch ein bisschen Geld für, aber du kannst das natürlich selbst benutzen, und so richtig lohnen tut sich das auch an, erst wenn du viel selbst benutzt, weil die Einspeiseförderergelder, die es gibt, werden immer weniger, und ich geh davon aus, dass nach der nächsten Bundestagswahl, auch wenn die Grünen am Start sein werden vielleicht, das nicht Bestand haben wird, zumindest nicht in der Höhe, ja wie gesagt, laut diesem Rechner kann ich mindestens 50% decken, mindestens 2 Kilowattstunden Batterie, Akku, Kilowattstunden ist ja die Menge, ich kenne bloß Ampere Stunden für Akkus und auch nicht überall hin, das heißt, wenn ich das ein bisschen größer baue und vielleicht noch einen größeren Akku nehme, dann könnte ich vielleicht sogar 60% oder so decken, das wäre auf jeden Fall schonmal cool, weil Stromkosten wären auch nicht billiger, ok, hat auch keiner von euch die Ahnung, na dann muss ich mal gucken, so wo wir gerade bei AliExpress sind, ich will mir noch eine Lampe bauen und das heißt, ich brauche unbedingt mal wieder einen 16x16 LED Matrix, das ist das erste schon, was du als Dings kriegst, 16x16 LED Matrix, ah die sind günstiger geworden, wir sind jetzt wieder runter auf 11 Euro, die wollten da mal 26 Euro teilweise für, ok Quaid, ja 11 Euro ist in Ordnung, 11 Euro kann ich dafür bezahlen, alles brauche ich, Versand, Standard Shipping, die China Chinesen, Alter, das ist auch Taktik oder, dass man das auf keinen Fall macht, ein Akku lohnt sich sehr selten, meinste, ich meine allein schon dadurch, dass du im Sommer oder generell auch zu anderen Zeiten was verbrauchst oder meinst du jetzt rein von dem, was man zusätzlich dadurch abdecken könnte und was der Akku kostet, ich will auf jeden Fall einen Akku, da habe ich eine USB fürs gesamte Haus, wenn der Strom mal ausfällt, funktioniert das überhaupt so wie ich mir das gerade vorstelle, Akku kannst du nach 3 Jahren wegkloppen, das weiß ich nicht, das müssen wir erstmal gucken, ob das wirklich so ist, das kann ich mir auch nicht vorstellen, wann kommt der Tesla gar nicht, ich werde mir erstmal kein neues Auto kaufen, ich fahre so selten Auto, das lohnt sich nicht und wenn, hole ich mir was in der Größe, wie ich jetzt habe, aber als Elektroauto und ihr wisst, ich habe das agilste Auto überhaupt und auch wahrscheinlich eines der ältesten fahrenden Autos hier von allen im Chat, also mein Auto ist von 2001, ja, in grün, in grün, gg, gut, also, das wird aber knapp, was passiert denn, was passiert denn, wenn ich 4500 bestelle, was kostet es, ach so, der Versand kostet 62000 Euro, das ist aber günstig, bis wann, bis wann gibt es Aliexpress Standard, ok, Aliexpress Standard geht ganz schön lang, oh, bis 130 oder so, das ist ja ein Schnapper hier, also 2 Stück, ach komm, das kostet 11 Euro, mir bestelle ich da jetzt 5 Stück von, das ist richtig nice, ich habe mir so eine RGB Lampe gebaut und da habe ich richtig Spaß dran an dem Ding, ich wollte mir jetzt noch eine fürs Schlafzimmer bauen, ihr schaut, huge RGB, die sieht man übrigens gar nicht so krass, die LEDs, das liegt ein bisschen an der iPhone Kamera, 50 Euro für LED, ja, für 5 Stück, 3D gedruckt, ja, ja, bam, so, in den Einkaufswagen, Einkaufswagen ansehen, Bestellung ist raus, wunderbar, next, muss es mal kurz abhaken, kurz mal den Kram rausschmeißen, den ich schon habe, ja, wo ich ja immer noch ein bisschen auf der Suche bin, ist für meine Rollos ein Gurtwickler nennt sich das, aber einen, den ich gescheit fernsteuern kann, ich habe mal den Versuch gemacht, mit einem, das habe ich auch hier im Video gezeigt, Moment, aber die sind mir erstens zu teuer und zweitens hat der Hersteller Firmware gepatcht, dass man die nicht mehr mit Custom Software ansteuern kann, so, und mein Haus hier hat ja eine Mischung aus, sagen wir mal neuen Rollos, mit, die einfach nur aus Plastik sind, zum hoch und runter machen, die kann ich auch schon fernsteuern, funktioniert jetzt schon, aber ich habe noch ein paar Räume, das ist ein paar, ich glaube 5 Räume oder so noch, die haben noch so einen alten, richtig schweren Holzroller an, du hast die im Haus, würdest du nicht nochmal machen, warum, also ich mache es auch nicht, weil die haben mich jetzt schon nicht so ganz überzeugt, die Dinger, ähm, was gefällt dir da nicht, also zumindest man konnte den fernsteuern mit Custom Software, aber das funktioniert nicht mehr, das haben die irgendwie gepatcht, so und ich bin jetzt auf der Suche nach irgendwie so einem Gurtwickler, nennt sich das ja, am besten einen, den man direkt über WLAN, über offene Schnittstellen ansteuern kann, aber ich fürchte, sowas wird es nicht geben, innerhalb von einem Jahr musste ich sieben Stück neu konfigurieren, neu konfigurieren oder austauschen, weil sie kaputt waren, so wir suchen jetzt einfach Gurtwickler, API, sowas, sowas, die haben alle irgendwelche komischen Drecks Custom-Protokolle, das nervt mich, warum macht keiner nen Motor für nen Rollladen mit ner Web-API, nimm doch einfach nen elektrisch entbauenen Shelley ein, du meinst, dass der, das ist eigentlich ne gute Idee, du meinst, dass der Shelley für mich quasi auf, auf die Tasthoch-Hundertaste drückt oder was, oder wie meinst du das, das find ich jetzt ne gute Idee, nur neu konfigurieren war aber trotzdem mega aufwander, sagt, echt welche hast du, mach mal, mach mal einen coolen Vorschlag, was hast du denn für einen, okay, das ist natürlich Fail, das sind dann richtig olle, fette, große Holz-Rolläden, aber ich mag die Holz-Rolläden, weil wenn die zu sind, die sind richtig zu und die kannst du auch von außen nicht hochheben, gerade im Erdgeschoss find ich das richtig gut mit den Holz-Rolläden, ja musst du jetzt nicht, musst du nicht machen, wenn du es weißt, kannst du ja am nächsten schrieben oder so posten, genau, by the way, kennt jemand gute Pan-Tilt-Kameras für Indoor, am besten welche, die keine Apps brauchen dafür, die ich steuern kann, am besten über einen Webinterface, beziehungsweise die sich noch besser integrieren lassen, am besten in irgendwie Home Assistant oder per MQTT oder was auch immer und den RTSP Stream haben, das in Kombination ist tatsächlich gar nicht so einfach zu finden, die Kameras, die ich jetzt habe, die können das ja auch nur, weil ich die mit Custom-Firmware geflasht habe, also ich hab hier aktuell so welche, unter anderem die V2 Wisecam und die hab ich Custom-Firmware geflasht. So, und da hab ich MQTT-Integration für Pan-Tilt, da hab ich, also nicht mit der, mit der anderen von denen, da hab ich Möglichkeit, Nacht-Infrarot-LEDs zu kontrollieren, RTSP Streams, funktioniert wunderbar, aber ich hätte halt gerne sowas vielleicht, ohne dass ich Custom-Firmware flashen muss und ohne die kacken WLAN-Verbindungen dieser Kameras. Vielleicht kennt ihr einer von euch was. Ja, die Dinger sind mega teuer und die kannst du glaub ich auch nicht gescheit steuern, außer über den, ihren Kram. Doch, es gab, es gab von Shelly eine extra Version für Rollladendinger, aber ich glaub von Shelly für den Rollladen, die sind für Rollladen Motoren gedacht. Ja, Moment, Drextream, habt ihr nen Motor oben, den ihr über den Shelly ansteuert oder habt ihr wirklich so nen, so nen eingebauten Motor-Wickler? Ja, am liebsten wären wir was mit MQTT-Insegrationen, außerdem kosten die Dinger viel. Ich hätte gerne so irgendwie so, keine Ahnung, 40 Euro Indoor-Kamera, fertig. Ich glaub das ist alles nicht so, aber Shelly 2.5. Onfif, genau so hieß das, ich erinnere mich noch dran, stimmt ja. Darüber hab ich das Root-Passwort von meiner Kamera rausbekommen, was ich dem Hersteller gemeldet hab und der Hersteller hat gesagt, ich soll mal gefälligst mein Proof of Concept von Github löschen. Ja, so kanns gehen. Ok, Shelly 2.5 sind gedacht für, das ist auch nur ein Relay zum Schalten, oder? Double Relay Switch and Shutter-Roller. Ach Moment, Moment, Moment. Das ist ein doppeltes Relay dafür, dass man hoch und runter drücken kann, weil es ja zwei Tasten hat, eine Taste für hoch und eine Taste für runter, deswegen brauchst du zwei Relays. Weil ansonsten kannst du das ja für jedes X beliebige andere auch verwenden. Das ist tatsächlich eine gute Idee, das da einzubauen, finde ich, ist keine schlechte Sache. Aber welche Gurtwickler habt ihr denn, im Backstream? Also wie heißen die Dinger denn? Oh, MQTT-Proker, jetzt gehts aber rund hier. MQTT erste Schritte. Die haben tatsächlich MQTT-Integration, das hätt ich jetzt net gedacht. Das ist aber Massive Big Brain. Wahnsinn. Aber der Shit ist glaub ich übelst und teuer, oder? Mac-Adressen-Leak. Okay, wie teuer sind denn die Dinger von den? Zeig mal her. Cloud, nein, nein, nein, nix Cloud. POE Kameras, nee POE brauch ich gar net. Innenkameras, Außenkameras, zack, bumm. Da ist bestimmt auch noch China-Chinesen Zeug drin. Das sind Sachen aus den 80ern, die waren schon bestand, achso. Gut, sollte aber mit jeder anderen Schicht auch funktionieren. Das Zeug ist aber ordentlich. Meine Güte, was sind denn das für Preise? Eine Kamera für innen für 200€, eine Indoor-Kamera. Sowas krieg ich von den China-Chinesen für 30€. Okay, mit ein paar Problemen, aber Alter, 109€, das ist ja... Das ist 180€ sind, nee, nee. Also das ist schon echt heftig viel. Boah, the fuck. Alter, nee, das geb ich dafür net aus, nee. Wieso nicht D-Link für 30€? Ja, wenn du D-Link, also wenn du eine D-Link-Kamera kennst, die den Stream per RTSP liefert, die Pan tilt kann und am besten steuerbar ist über irgendeine Web-Schnittstelle ohne offizielle App, dann her damit, bin ich der Erste, der sich so ein Ding kauft. Wir gucken jetzt mal Amazon. Indoor Pan tilt. Eufy, China-Chinesen-Kram. Integration, okay, zeig mal her. Jaro, der Jaro-Mart, das hört sich irgendwie fast schon ein bisschen Russisch oder so an. Jaro-Mart. Jaro-Mart. Also irgendwie klingt das... Was kostet denn ein Jaro-Mart? Jaro-Mart-Eko-Ab, das ist wahrscheinlich... Jaro-Mart-Eko, Alter. Geiler Name, das Ding. Jaro-Mart. Eufy ist nicht chinesisch, ist von Anker. Anker ist doch China-Kram. Anker ist China-Chinesen-Krampel, guck hier. Anker Innovation ist ein China-Chinesen-Hersteller aus Shenzhen. Also im Prinzip das China-Technik-Ding. Ist es nicht da, wo sie jetzt Nordkoreaner für haben einfliegen lassen, um dort Arbeiten zu machen, die lebensgefährlich sind, weil die Chinesen das nicht mehr selbst machen wollen? Ich hab letztens irgendwie sowas gelesen, dass die Chinesen sich ein paar Nordkoreaner geholt haben, die so verzweifelt waren, weil die Chinesen... Also, dass die jetzt die Arbeiten machen, die die Chinesen selbst nicht mehr machen wollen, weil sogar die Chinesen die Arbeiten zu gefährlich sind. Da haben sich die Chinesen gedacht, weißt du was? Nee, war einfach ein paar Nordkoreaner. Die haben es nötig, die brauchen es. Ah, die haben da halt keine Schmerzen mit, ne? Juckt das nicht. Ja, aber siehst du das in China-Kram? Na, ich find den immer noch geil. Gekommnet, der Gekommnet-Mart, Alter. Jaromart. Ok, der ist vielleicht nicht das schönste, der obendrauf ist. Ich hätt schon gern sowas hier, sowas hier in der Richtung. Was, weil wir haben ja da, wir haben ja da die Löcher für in der Wand. Ist eigentlich, ist eigentlich eine ziemlich gute Idee, da speicher ich mir mal. Jaromart. So, guck hier, zum Beispiel so ein TP-Link-Ding. Wäre ich sofort dabei, aber wenn das eine dieser Dinger nicht kann, kann das schon mal Pan-Tilt. Kann man das schon mal drehen? Wahrscheinlich nicht, oder? Pan-Tilt, ok, steht ganz groß oben da. So, das heißt das nächste ist, man kann das nur über die offizielle App steuern. Wir haben bestimmt keinen RTSP-Stream, da fängt es schon an. Wie konnte man noch mal Kommentare durchsuchen? Das hier, wie kann man ein RTSP-Leistung auf einer Turbo-Kamera machen? Ist das eine Turbo-Kamera? Oh, ok. Gut, so, erster Punkt schon mal erfüllt. Nächster Punkt, wie kann ich die Steuerung machen? Die Steuerung geht wahrscheinlich nur über die Apps. Ich will es ja nicht über die App machen. Ok, RTSP-Stream geht schon mal, das ist gut. Aber wie kann man die Kamera machen? Ah, guck mal, man kann die als On-Fif-Kamera hinzufügen. Spricht man doch garantiert nicht On-Fif aus, oder? Wie sprecht man das aus? On-Fif. So was wie On-Fif? Ok, das probiere ich vielleicht wirklich mal aus. Turbo-Kamera-Hand-Tilt-On-Fif. Tatsächlich, das sollte funktionieren. Oh, das haben die erst vor einem Monat gepostet. Das ist Bleeding-Edge-Technologie hier. Turbo-Kamera-Control. Interessant. Ja, finde ich cool, dass es das gibt. Vielleicht. Ja, Track-Detect-Movement brauche ich nicht. Dann würde ich sagen, dann wird es mal Zeit, dass ich mir eine Turbo-Kamera kaufe, um die auszuprobieren. Easy. Turbo-Firmware. Haben wir doch schon was gefunden, siehste? Also 37 Euro sind mir lieber als 250. Im Stream, wieso soll ich Woop League machen, oder? Das ist eh bei mir, kommt das ins IoT-WLAN, ohne dass es irgendwo hin darf. Die wurde storniert ohne Grund. Moment, ich probiere die jetzt über die App zu kaufen. App, Smartphone, auf Amazon, Turbo, C-200, C-210. Was ist der Unterschied dazwischen? Best Seller, 32 Euro. Warum findet, Alter, warum findet das immer was anderes? Was ist denn der Unterschied zwischen Turbo, C-210 und C-200? Was ist denn da der Unterschied? Warum steht die Kamera da auf dem Kopf? Die ist älter. Ja gut, die hat wahrscheinlich schlechtere Auflösung. Okay, ich will nur, die hat kein Two-Way-Audio. Okay. Die haben anscheinend Probleme damit. Na gut. Automatische Software-Updates gibt es bei mir nicht. Das Ding ist im IoT-WLAN, da ist nichts mit Two-Way-Audio oder sonst was. Und das ist, guck dir mal da, da kostet es jetzt die 210,39 Euro und hier kostet es 37 Euro. Was zum Teufel, wo ist der? Das erschließt sich mir überhaupt nicht. Oh, sind das UK Imports? Gut, UK Imports werden bei mir auch öfters cancelled. Das kenne ich. UK Imports, das Problem hatte ich auch schon, dass es nicht richtig funktioniert. Man kann aber hier unten meistens auf neu und gebraucht gehen, aber anscheinend gibt es da nicht. Warte mal, sie gibt es hier mit diesen Button neu und gebraucht. Brexit, ja, ich weiß gar nicht, warum die noch drinnen sind. Ich versuche jetzt mal von der App zu bestellen, so. I know. Ich habe gebyt. Leute, es ist schwieriger als man denkt. Jetzt wollen sie nicht, dass ich was bestelle. So, jetzt gucke ich mal, your orders, your orders, da ist er noch drin. Na ja. Schauen wir mal, ob das funktioniert. Ah, geil. Oh, Big Brain Chat, Alter, guckt euch mal wieder an. Der Chat ist wirklich, die ganzen Subs haben sich gelohnt. Guckt euch das mal an. Jetzt haben wir direkt einen Vergleich. Guck mal, der Bildsensor von der Alten ist größer. Ihh, 15 FPS, MonkaS. Na gut, man kann bestimmt Low-Quality Stream machen und das ist dann weniger. Die haben auch integrierte Lautsprecher. Ah, guck mal, die hat doch integriertes Mikrofon. Ansonsten machen die mehr oder weniger eigentlich das Gleiche. Das menschliche Auge sieht nur 8 FPS, das stimmt nicht, sind 12. Also ein großer Unterschied ist das nicht. Equipa. Hat mal einer von euch was bei Equipa bestellt? Ah, hier ist, hier ist Marketplace angesagt. Marketplace, China, Chinesen. Sag mal, gibt es nicht noch, ich checke es gerade nicht auf der Amazon-Seite. Es gibt doch normalerweise hier einen Knopf. Neu und Gebrauch. Ach hier, Osser, Osser, Osser, Sellers on Amazon sind da. Da haben sie es versteckt jetzt, es ist neu. Ok, das ist anscheinend alles nicht pünktlich lieferbar hier. Na gut, das würde ich an denen in ihrer Stelle auch so machen, weil wenn die Bahn Güterverkehr mäßig streikt, wer weiß wann das ankommt. Oh Leute, ich sehe es gerade, guck mal die Uhr. Guck mal auf die Uhr. Ich habe jetzt gar nicht alles, alles hier fertig bekommen. Ich habe zu lange geschwätzt. CacWade. Anscheinend braucht man die TP-Link-App und einen Account um das Ding in Betrieb zu nehmen. Das ist auch noch so ein Ding. Egal, IoT-Netzwerk regelt. Ja, aus irgendwelchen Gründen haben die ja mein Outro Song gelöscht. Also Leute, wir sehen uns. Bis denn. Bis zum nächsten Stream. Macht's gut, bis denn. Betge-Time. Huge Betge, huge sleep, massive dream. Bis denn, macht's gut.", "segments": [{"id": 1, "start": 60.0, "end": 89.32, "text": "Ich bin müde."}, {"id": 2, "start": 89.32, "end": 94.6, "text": "Aber noch nicht bettge, aber noch nicht bettge müde."}, {"id": 3, "start": 94.6, "end": 101.08, "text": "Ich bin aber nicht so wirklich voll dabei heute, aber ich wollte noch eine Runde Stream"}, {"id": 4, "start": 101.08, "end": 103.24, "text": "Stels machen und mit euch eine Runde schwätzen."}, {"id": 5, "start": 103.24, "end": 118.28, "text": "Ja, morgen ist ganz schlecht, morgen sackt, morgen muss ich nach Frankfurt auf die Arbeit"}, {"id": 6, "start": 118.28, "end": 119.28, "text": "fahren."}, {"id": 7, "start": 119.28, "end": 130.36, "text": "Glücklicherweise danach wieder Homeoffice, so Paynes Champ, Alter."}, {"id": 8, "start": 130.36, "end": 135.8, "text": "Ist morgen schon wieder Streik?"}, {"id": 9, "start": 135.8, "end": 142.28, "text": "Also wenn morgen Bahnstreik ist, dann fahre ich nicht."}, {"id": 10, "start": 142.28, "end": 143.28, "text": "Bahnstreik."}, {"id": 11, "start": 143.28, "end": 149.0, "text": "Oh nee, oder?"}, {"id": 12, "start": 149.0, "end": 151.56, "text": "Lull."}, {"id": 13, "start": 151.56, "end": 155.24, "text": "Donnerstag."}, {"id": 14, "start": 155.24, "end": 163.24, "text": "Der Chat erzählt wieder Mist."}, {"id": 15, "start": 163.24, "end": 166.64, "text": "Das stimmt überhaupt nicht, dass die ab morgen streiken."}, {"id": 16, "start": 166.64, "end": 167.64, "text": "Donnerstag."}, {"id": 17, "start": 167.64, "end": 176.64, "text": "Klingt merkwürdig, ich bin heute entspannt."}, {"id": 18, "start": 176.64, "end": 181.16, "text": "Ich hänge auch so auf halb acht vorm Rechner."}, {"id": 19, "start": 181.16, "end": 188.68, "text": "Erst trifft es dann den Güterverkehr von Donnerstag, dann ein bisschen..."}, {"id": 20, "start": 188.68, "end": 192.68, "text": "Okay, also."}, {"id": 21, "start": 192.68, "end": 194.48, "text": "Mittwoch 17 Uhr."}, {"id": 22, "start": 194.48, "end": 198.2, "text": "Okay, das heißt, morgen ist noch gar nix."}, {"id": 23, "start": 198.2, "end": 206.24, "text": "Gehen mir so auf den Sack, allesamt die Bahn vor allem, aber die GDL auch, die gehen mir"}, {"id": 24, "start": 206.24, "end": 209.24, "text": "alle so auf den Sack."}, {"id": 25, "start": 209.24, "end": 215.2, "text": "Die sollen einfach ihre Arbeit machen und mich pünktlich von A nach B bringen, der"}, {"id": 26, "start": 215.2, "end": 216.2, "text": "Rest ist mir scheißegal."}, {"id": 27, "start": 216.2, "end": 220.76, "text": "Meine Güte, ey."}, {"id": 28, "start": 220.76, "end": 223.84, "text": "Was eine Riesenzeremonie wieder, Alter."}, {"id": 29, "start": 223.84, "end": 227.64, "text": "Ja, ich kann die auch verstehen, aber ich habe trotzdem keinen Bock darauf, dass sie streiken."}, {"id": 30, "start": 227.64, "end": 232.28, "text": "Nur weil man was verstehen kann, muss man das ja noch nicht gut finden."}, {"id": 31, "start": 232.28, "end": 236.48, "text": "Also die Auswirkungen."}, {"id": 32, "start": 236.48, "end": 240.08, "text": "Ich muss gerade mal was gucken, irgendwie gab es hier Questions."}, {"id": 33, "start": 240.08, "end": 244.64, "text": "Danke für den Sub eben, gab es irgendwas, der Death Operator ist wieder am Start."}, {"id": 34, "start": 244.64, "end": 250.64, "text": "Les ich mir gleich durch, also, der Umut, du bist aber auch immer am Start, oder?"}, {"id": 35, "start": 250.64, "end": 263.76, "text": "Also, ein Lokal habe ich den Controller, warum sollte ich denn vermeiden, manchmal frage"}, {"id": 36, "start": 263.76, "end": 268.72, "text": "ich mich echt, ob du die Fragen ernst meinst oder einfach nur eine Runde jebaiten willst."}, {"id": 37, "start": 268.72, "end": 276.76, "text": "Warum um alles in der Welt sollte ich für meine lokalen Access Points einen Unify Controller"}, {"id": 38, "start": 276.76, "end": 277.76, "text": "im Internet haben?"}, {"id": 39, "start": 277.76, "end": 293.6, "text": "Also, das ergibt überhaupt keinen Sinn, nein, ich habe das Lokal, ich habe das Lokal"}, {"id": 40, "start": 293.6, "end": 301.72, "text": "unten im Wohnzimmer auf dem Raspberry Pi, da ist auch noch die Software drauf, die"}, {"id": 41, "start": 301.72, "end": 310.04, "text": "Kamera, Überwachungs, Überwachungskamera stills macht."}, {"id": 42, "start": 310.04, "end": 321.16, "text": "Ja, aber solange die erst am Donnerstag anfangen, ist gut, da kann ich wieder Home Office machen."}, {"id": 43, "start": 321.16, "end": 328.2, "text": "Wäre bei dir überhaupt jemand da, bei mir wäre da niemand, ich weiß nicht mehr, worauf"}, {"id": 44, "start": 328.2, "end": 329.44, "text": "sich das bezogen hat."}, {"id": 45, "start": 329.44, "end": 335.84, "text": "Meinst du auf die Arbeit, doch, bei mir sind tatsächlich ein paar Leute auf der Arbeit"}, {"id": 46, "start": 335.84, "end": 338.84, "text": "in Frankfurt."}, {"id": 47, "start": 338.84, "end": 345.12, "text": "Es gibt da tatsächlich so ein paar wahnsinnige Leute, die da gerne hinfahren und was ich"}, {"id": 48, "start": 345.12, "end": 354.64, "text": "auch lustig finde, unsere Geschäftsführer, die Stonks Manager bei uns auf der Arbeit,"}, {"id": 49, "start": 354.64, "end": 359.2, "text": "die hauen wieder die geilsten Sprüche auf der Welt raus, um die Leute zu motivieren"}, {"id": 50, "start": 359.2, "end": 360.84, "text": "auf die Arbeit zu gehen."}, {"id": 51, "start": 360.84, "end": 368.44, "text": "Letztens hat wieder einer rumgeschrieben, so nach dem Motto, wir freuen uns alle auf"}, {"id": 52, "start": 368.44, "end": 377.72, "text": "die kommende Zeit und jetzt können wir getreu unserem Motto für Menschen, von Menschen,"}, {"id": 53, "start": 377.72, "end": 383.6, "text": "zu Menschen oder irgendwie so was agieren und das hat er so geschrieben, als wäre das"}, {"id": 54, "start": 383.6, "end": 388.88, "text": "jetzt wahnsinnig geile Motivationsrede und ich habe einfach nur da gesetzt und so gefacepalmt"}, {"id": 55, "start": 388.88, "end": 392.68, "text": "und hat mir gedacht, Alter, was willst du mir eigentlich sagen?"}, {"id": 56, "start": 392.68, "end": 405.88, "text": "Diese Sprüche immer, ja und was auch lustig ist, wir haben bei uns ja mit dem Betriebsrat,"}, {"id": 57, "start": 405.88, "end": 413.56, "text": "gibt es jetzt so eine, also neu ist das nicht, aber jetzt bei Corona wurde das Ganze forciert,"}, {"id": 58, "start": 413.56, "end": 418.6, "text": "gibt es so, haben wir jetzt so die Möglichkeit offiziell, ich konnte ja schon jahrelang Homeoffice"}, {"id": 59, "start": 418.6, "end": 425.6, "text": "machen, aber man kann jetzt offiziell quasi sagen, ich möchte meine Arbeitszeit verändern"}, {"id": 60, "start": 425.6, "end": 435.32, "text": "mit Vertragsänderungen und allem und was lustig ist, sobald das jetzt offiziell war, waren"}, {"id": 61, "start": 435.32, "end": 441.32, "text": "sie total überrascht vom Antrag, wo ich mir auch wieder denke, so ist es nicht eigentlich"}, {"id": 62, "start": 441.32, "end": 449.2, "text": "jobs von Managern, so ungefähr zu verstehen, was passiert und die sind von allem immer"}, {"id": 63, "start": 449.2, "end": 451.08, "text": "so wahnsinnig überrascht, wie kann das sein?"}, {"id": 64, "start": 451.08, "end": 455.4, "text": "Können die ihren Job nicht richtig machen?"}, {"id": 65, "start": 455.4, "end": 460.96, "text": "Also ich muss doch so ein bisschen, ich werde doch als Manager bzw. als bezahlt Entscheidungen"}, {"id": 66, "start": 460.96, "end": 464.6, "text": "zu treffen und diese Entscheidungen sollten doch eigentlich auch so getroffen werden,"}, {"id": 67, "start": 464.6, "end": 468.96, "text": "dass sie in die Zukunft, ein bisschen der Möglichkeit ein bisschen in die Zukunft gucken und gut"}, {"id": 68, "start": 468.96, "end": 475.28, "text": "dafür sind, aber unsere Manager sind immer übelst schnell von Sachen überrascht, so"}, {"id": 69, "start": 475.28, "end": 479.64, "text": "nach dem Motto, was, so viele Leute wollten Homeoffice machen, damit haben wir ja gar"}, {"id": 70, "start": 479.64, "end": 489.36, "text": "nicht gerechnet, blablabla, warum ich mir denke jetzt, naja, der Scamtrain ist am Start,"}, {"id": 71, "start": 489.36, "end": 504.96, "text": "der Mast, der Krümli, 6 Monate, massive Subscriptions hier, nee, ich gebe mir heute"}, {"id": 72, "start": 504.96, "end": 512.28, "text": "bloß gar keine Mühe, irgendwie besonders enthusiastisch zu klingen, normalerweise versuche"}, {"id": 73, "start": 512.28, "end": 517.08, "text": "ich ja immer irgendwie besonders so, so engaged zu sein, ja, weil ich sehe das ja auch an"}, {"id": 74, "start": 517.08, "end": 521.44, "text": "in den Viewerzahlen, wenn ich einfach nur auf halb 8 da hänge oder wenn ich engaged"}, {"id": 75, "start": 521.44, "end": 526.44, "text": "bin und irgendwas zeige, natürlich, kommt das besser an, aber ich sitze heute einfach"}, {"id": 76, "start": 526.44, "end": 533.2, "text": "nur Vape Nation Style vorm Rechner und ich hänge eigentlich halb unterm Rechner, ok,"}, {"id": 77, "start": 533.2, "end": 539.24, "text": "also der Dev Operator ist am Start und er sagt, habe jetzt ein kleines Programm mit"}, {"id": 78, "start": 539.24, "end": 542.4, "text": "Pysen, übrigens die Aussprache finde ich auch geil, jeder spricht das ein bisschen"}, {"id": 79, "start": 542.4, "end": 546.16, "text": "anders aus, ich habe schon gehört von Python, jetzt ist kein Witz, Python habe ich schon"}, {"id": 80, "start": 546.16, "end": 557.56, "text": "gehört, Python, Python, Python, alles, alles dabei, aber Python ist das beste, die schreibt"}, {"id": 81, "start": 557.56, "end": 572.84, "text": "man doch ganz anders, die Schlange, Python, Python gibt es auch noch, habe ich ganz vergesse,"}, {"id": 82, "start": 572.84, "end": 578.88, "text": "Python, Python, Python ist auch gut, aber Python habe ich ganz vergessen, das gibt"}, {"id": 83, "start": 578.88, "end": 586.64, "text": "es dann auch die Leute, das habe ich dann in Python geschrieben, Pyson, na Pyson habe"}, {"id": 84, "start": 586.64, "end": 593.48, "text": "ich nicht gehört, C Hashtag, nee C Lappenzauen ist die beste Sprache, so also, also ein kleines"}, {"id": 85, "start": 593.48, "end": 598.76, "text": "Programm mit Pysen unter Twitch, API zusammengezimmert, geht um die Nachricht von gestern, habe jetzt"}, {"id": 86, "start": 598.76, "end": 607.72, "text": "nur noch ein paar Problemchen, wie gut kannst du, naja, ich habe da jetzt kein Daily Practice,"}, {"id": 87, "start": 607.72, "end": 613.64, "text": "aber ich kann das lesen, ich kann das verstehen, wenn ich was schreiben muss, muss ich halt"}, {"id": 88, "start": 613.64, "end": 622.32, "text": "immer nachgucken, weil ich das nicht so oft verwende, kannst du auch C Teppichzeichen,"}, {"id": 89, "start": 622.32, "end": 631.08, "text": "was ist denn ein Teppichzeichen, jetzt hast du gestern schon erzählt, dein 20 Euro Gutschein"}, {"id": 90, "start": 631.08, "end": 636.36, "text": "ist weg, schreib doch den Support an, habe ich doch gestern schon gesagt, ich kann da"}, {"id": 91, "start": 636.36, "end": 644.8, "text": "nichts machen, wenn bei denen im System irgendwas aktiviert, verfällt, was auch immer, du kriegst"}, {"id": 92, "start": 644.8, "end": 654.36, "text": "bestimmt einen neuen Gutschein, hast du, und was haben sie geschrieben, was haben sie geschrieben,"}, {"id": 93, "start": 654.36, "end": 661.64, "text": "nö, ja warum nö, ach stimmt, nee im Moment, dein Gutschein war doch abgelaufen, ja gut,"}, {"id": 94, "start": 661.64, "end": 670.08, "text": "da bist du selber dran schuld, wenn dein Gutschein abgelaufen ist, da kann ich ja nichts für"}, {"id": 95, "start": 670.08, "end": 675.16, "text": "und Hetzler auch nicht, das steht wahrscheinlich sogar da, wenn du es einlöst, dass das nicht"}, {"id": 96, "start": 675.16, "end": 681.12, "text": "unendlich handgültig ist, warum läuft der ab jetzt, das steht bestimmt da, übrigens"}, {"id": 97, "start": 681.12, "end": 687.88, "text": "Leute, Ausrufezeichen Hetzler im Chat, wenn ihr euch ein 20 Euro Cloud Gutschein sichern"}, {"id": 98, "start": 687.88, "end": 694.48, "text": "wollt für eure eigenen Linux VMs in der Cloud, und wenn ihr wissen wollt, was ihr machen"}, {"id": 99, "start": 694.48, "end": 700.64, "text": "könnt, könnt ihr den Stream von gestern angucken, Wolle604, Dankeschön für den Sub, drin von"}, {"id": 100, "start": 700.64, "end": 709.32, "text": "einem Streik ist es ja auch, dass die Öffentlichkeit Druck macht, ja, es ist ja nicht so, als müsste"}, {"id": 101, "start": 709.32, "end": 715.0, "text": "man mir erklären, warum, die Streiken, das ist mir schon klar, ich find das trotzdem"}, {"id": 102, "start": 715.0, "end": 720.08, "text": "kacke, ja ich hab auch kein, ich bin sogar dafür, dass sie das dürfen, aber rein für"}, {"id": 103, "start": 720.08, "end": 725.08, "text": "mich aus meiner Sicht ist es kacke, und mir ist es vollkommen egal, ob es an der Bahn"}, {"id": 104, "start": 725.08, "end": 730.24, "text": "liegt oder an der GDL liegt oder an was auch immer liegt, ich will einfach nur pünktlich"}, {"id": 105, "start": 730.24, "end": 734.2, "text": "von A nach B gebracht werden, das ist alles, die Rahmenbedingungen sind mir, ob es jetzt"}, {"id": 106, "start": 734.2, "end": 737.4, "text": "mal übertrieben zu sagen, scheiß egal, Hauptsache es funktioniert."}, {"id": 107, "start": 737.4, "end": 748.64, "text": "By the way, verwendet jemand Logitech Schmäuse, ja natürlich, was ne Frage, habt ihr noch"}, {"id": 108, "start": 748.64, "end": 756.48, "text": "die Logitech Game Software oder habt ihr schon Logitech Hub, was besser, Logitech G Hub"}, {"id": 109, "start": 756.48, "end": 769.76, "text": "oder Logitech Game Software, G Hub, vielleicht soll ich das auch mal upgraden, bevor ich"}, {"id": 110, "start": 769.76, "end": 775.96, "text": "den Support anschreibe, dass ich doppelte Tastenklicks hab, wozu braucht man die, naja"}, {"id": 111, "start": 775.96, "end": 785.52, "text": "zum Beispiel um Profile einzustellen, Software wird alles bloated, ja ja alles bloated, ich"}, {"id": 112, "start": 785.52, "end": 795.0, "text": "weiß, also ihr habt alle G Hub, ihr habt gar nicht mehr die alte, alte Maus, ok, äh"}, {"id": 113, "start": 795.0, "end": 801.28, "text": "die alte Maus Gaming Software, doppelte Tastenklicks ist doch bestimmt kaputter Switch, bin mir"}, {"id": 114, "start": 801.28, "end": 807.36, "text": "nicht sicher, das merkwürdige ist, ich bilde mir ein, ich habe es sowohl links als auch"}, {"id": 115, "start": 807.36, "end": 816.2, "text": "rechts, was auf Software irgendwie hindeutet, ich installier es neu, wenn nicht muss der"}, {"id": 116, "start": 816.2, "end": 823.16, "text": "Support dran glauben, krümelst du am PC, ich ess relativ selten am PC, früher hab"}, {"id": 117, "start": 823.16, "end": 830.08, "text": "ich immer am PC gefuttert, mittlerweile ess ich eigentlich gar nicht mehr am PC, außer,"}, {"id": 118, "start": 830.08, "end": 836.76, "text": "manchmal sonntags, wenn ich gestreamt hab, den Stream gerade ausgemacht hab und dann"}, {"id": 119, "start": 836.76, "end": 840.76, "text": "noch irgendwas gucken will, weil ich sonntags noch gar nichts geguckt habe, nachgeguckt"}, {"id": 120, "start": 840.76, "end": 852.76, "text": "habe, weil ich direkt on gehe und Stream anmache, ja, übrigens ich muss jetzt nicht mehr, äh"}, {"id": 121, "start": 852.76, "end": 864.28, "text": "wie nennt man das so, ja, so viele Bedenken haben, dass ich so langsam bin mit dem Chat,"}, {"id": 122, "start": 864.28, "end": 868.8, "text": "weil ich hab letztes mal bei Semper Video reingeguckt, der ist noch langsamer mit dem"}, {"id": 123, "start": 868.8, "end": 883.24, "text": "Chat, bin ich nicht alleine, der ist teilweise eine halbe Stunde hinten dran, hallo in diesem"}, {"id": 124, "start": 883.24, "end": 891.52, "text": "Stream nur ganz kurz, so, aber er liest alle, ich lese auch mehr oder weniger alles, manches"}, {"id": 125, "start": 891.52, "end": 895.84, "text": "erwähne ich nicht, weil ich keinen Bock hab drauf zu antworten, aber ich lese eigentlich"}, {"id": 126, "start": 895.84, "end": 920.28, "text": "so gut wie alles, warum, das müssen wir uns gleich mal angucken, Custom Firmware, Leute,"}, {"id": 127, "start": 920.28, "end": 923.88, "text": "wenn ich sowas bräuchte, ich bin erfreut, dass ich sowas nicht brauch, das erste was"}, {"id": 128, "start": 923.88, "end": 931.76, "text": "ich machen würde ist, Custom Firmware Flashen, wisst ihr ja, ja und da muss man aufpassen,"}, {"id": 129, "start": 931.76, "end": 935.84, "text": "man sollte das besser nicht in C++ programmieren, ansonsten macht das Ding noch irgendeinen"}, {"id": 130, "start": 935.84, "end": 951.6, "text": "Scheiß, was wurde da drauf, ja, guck ich mir, guck ich mir an, ja wie gesagt mein Unify"}, {"id": 131, "start": 951.6, "end": 955.48, "text": "Controller läuft auch auf dem Raspberry Pi und ich muss euch mal sagen, ich habe mir"}, {"id": 132, "start": 955.48, "end": 963.44, "text": "im Keller jetzt noch einen UAP Lite, wie auch immer der genau heißt, eingebaut, so einen"}, {"id": 133, "start": 963.44, "end": 969.24, "text": "hier, kein WiFi 6, ich brauche im Keller kein WiFi 6, dafür ist das Ding schön günstig,"}, {"id": 134, "start": 969.24, "end": 976.56, "text": "gut schön günstig sind 60 Euro oder so, 70 Euro sogar und ich muss echt sagen, seitdem"}, {"id": 135, "start": 976.56, "end": 983.68, "text": "ich mir das Ding hier noch im Keller eingebaut habe, das WLAN ist wirklich, das hätte ich"}, {"id": 136, "start": 983.68, "end": 992.6, "text": "nie gedacht, was so ein Access Point ausmachen kann, ja Unify habe ich in meinem Home Assistant"}, {"id": 137, "start": 992.6, "end": 1002.92, "text": "drinne, als Device Tracker, hast du noch deinen alten PC mit Xeon CPU von 2013, ja, ja, hab"}, {"id": 138, "start": 1002.92, "end": 1007.44, "text": "ich noch, allerdings nicht mehr hier stehen, sondern ich glaube auf dem Dachboden, aber"}, {"id": 139, "start": 1007.44, "end": 1011.32, "text": "ich schmeiße die ja nicht weg, warum fragst du?"}, {"id": 140, "start": 1011.32, "end": 1025.84, "text": "So, das hätte ich echt nicht gedacht, dass das so viel bringt, ne, also ich habe hier"}, {"id": 141, "start": 1025.84, "end": 1031.16, "text": "im Erdgeschoss einen Access Point, einen UAP Pro habe ich im Erdgeschoss, hier oben habe"}, {"id": 142, "start": 1031.16, "end": 1039.92, "text": "ich ein bisschen Nano HD und ich hatte immer Probleme, egal wie ich es positioniert habe,"}, {"id": 143, "start": 1039.92, "end": 1046.12, "text": "der Empfang im Keller war prinzipiell scheiße, dann kam dazu, dass es im Flur auch nicht"}, {"id": 144, "start": 1046.12, "end": 1055.32, "text": "toll war, ich habe teilweise schon Probleme, wenn ich aufs Klo gegangen bin, oben und ich"}, {"id": 145, "start": 1055.32, "end": 1059.6, "text": "habe jetzt einfach noch im Keller einen zusätzlichen Access Point hingehängt, jetzt habe ich 3"}, {"id": 146, "start": 1059.6, "end": 1067.72, "text": "Stück Keller, Erdgeschoss, 1. Stock, Dach ist nix, brauche ich auch nicht und wisst ihr"}, {"id": 147, "start": 1067.72, "end": 1068.72, "text": "was?"}, {"id": 148, "start": 1068.72, "end": 1074.64, "text": "Ich kann zwar nicht ganz nachvollziehen, warum sich manche Devices dahin verbinden,"}, {"id": 149, "start": 1074.64, "end": 1082.12, "text": "beispielsweise die Lampe, so eine WiFi RGB Lampe drüben im Wohnzimmer, verbindet sich"}, {"id": 150, "start": 1082.12, "end": 1087.96, "text": "im Keller zum Access Point, also eine Lampe im ersten Stock verbindet sich zum Access"}, {"id": 151, "start": 1087.96, "end": 1096.52, "text": "Point im Keller, warum auch immer, alles andere kann ich ja nachvollziehen, aber die Lampe"}, {"id": 152, "start": 1096.52, "end": 1106.24, "text": "meint, sie muss ins Keller, muss muss ins Keller, alles gleiche SSIDs, ja ja, ich habe"}, {"id": 153, "start": 1106.24, "end": 1112.96, "text": "den AP AC Throne erreicht im ganzen Haus, ja, also du kriegst aber garantiert Probleme,"}, {"id": 154, "start": 1112.96, "end": 1122.12, "text": "wenn du eingestellt hast, dass 5 WiFi 6, also 5 GHz Geräte gezwungen werden 5 GHz zu verwenden,"}, {"id": 155, "start": 1122.12, "end": 1131.92, "text": "dann hast du bestimmt Empfangsprobleme, das würde ich nämlich immer ausschalten, ja ja,"}, {"id": 156, "start": 1131.92, "end": 1136.6, "text": "du musst die Automat, genau das meine ich Asuro, die automatische Optimierung muss unbedingt"}, {"id": 157, "start": 1136.6, "end": 1144.04, "text": "aus, das ist totaler Müll, automatische Optimierung macht ja so Sachen wie 5G Geräte, ich sage"}, {"id": 158, "start": 1144.04, "end": 1149.52, "text": "schon 5G, stimmt ja nicht, WiFi 6 5 GHz Geräte müssten 5 GHz verwenden, das ist totaler"}, {"id": 159, "start": 1149.52, "end": 1153.76, "text": "Fail, wenn ich aufs Klo gehe und nur 2,4 habe und das ganze bisschen langsamer ist, soll"}, {"id": 160, "start": 1153.76, "end": 1160.96, "text": "mir auch recht sein, weil das ist einfach so, 2,4 GHz wedern geht einfach bedeutend besser"}, {"id": 161, "start": 1160.96, "end": 1166.56, "text": "durch Wände und hat dementsprechend eine bessere Reichweite als 5 GHz, dafür ist 5 GHz schneller"}, {"id": 162, "start": 1166.56, "end": 1180.28, "text": "und je nach Auslastung in der Region, hast du damit eh dann mehr Performance, hast du"}, {"id": 163, "start": 1180.28, "end": 1185.0, "text": "für deine APs irgendein Steering damit sich absprechen, wer für welches Gerät ist oder"}, {"id": 164, "start": 1185.0, "end": 1191.96, "text": "hast du einfach, ich habe auf allen Geräten die gleiche SSIDs, aber das UniFi Zeug macht"}, {"id": 165, "start": 1191.96, "end": 1205.8, "text": "unter der Haube schon Access Point Roaming, also das ist relativ gut, also ich kann beispielsweise"}, {"id": 166, "start": 1205.8, "end": 1211.04, "text": "irgendwie Musikstreams laufen haben oder Internetradio oder sonst was auf dem Handy und durchs Haus"}, {"id": 167, "start": 1211.04, "end": 1228.16, "text": "laufen das bricht nicht ab, man kann das in den Settings auch ausstellen, ja Leistung"}, {"id": 168, "start": 1228.16, "end": 1233.88, "text": "auf Mittel habe ich auch gemacht im Erdgeschoss, ich stelle jetzt aber auch nichts mehr dran"}, {"id": 169, "start": 1233.88, "end": 1244.36, "text": "rum, weil es funktioniert alles ziemlich gut, ja also davon halte ich auch nichts, also für"}, {"id": 170, "start": 1244.36, "end": 1250.48, "text": "Netzwerkgeräte an sich, außer Access Point, ich habe einen UniFi Edge Switch mit 10G,"}, {"id": 171, "start": 1250.48, "end": 1256.88, "text": "die sind alles auch ganz gut, aber für alle anderen Sachen würde ich das auch nicht nehmen."}, {"id": 172, "start": 1256.88, "end": 1263.92, "text": "Da habe ich entweder meine MikroTik Kisten, die ja von der Bedienung her auch nicht alles"}, {"id": 173, "start": 1263.92, "end": 1274.6, "text": "andere als Referenz sind, also gerade Bruter OS auf MikroTik ist ja wirklich schon absoluter"}, {"id": 174, "start": 1274.6, "end": 1282.04, "text": "Wildwuchs, ich meine hier WebFick ist einfach, ich muss mir mal lachen, wenn ich das komische"}, {"id": 175, "start": 1282.04, "end": 1296.0, "text": "Wort lese, ich meine es ist WebConfig, aber es ist WebFick, es gehört zu WebFig, aber"}, {"id": 176, "start": 1296.0, "end": 1302.4, "text": "ich muss mir mal lachen, wenn ich das lese, das ist halt auch schon ziemlich, ich will"}, {"id": 177, "start": 1302.4, "end": 1308.44, "text": "nicht quick, ich will WebFick, das ist halt auch schon ziemlich BigBrain, das ganze MikroTik"}, {"id": 178, "start": 1308.44, "end": 1316.36, "text": "Ding, du hast hier 30 Milliarden Einstellungen, die du machen kannst, IPsec ist halt auch"}, {"id": 179, "start": 1316.36, "end": 1322.52, "text": "mit allen möglichen Sachen und sonst wie, ihr habt es gesehen doppelten Tastendruck"}, {"id": 180, "start": 1322.52, "end": 1329.8, "text": "hier wieder und damit bin ich aber privat ganz zufrieden, ich habe ja relativ viel MikroTik,"}, {"id": 181, "start": 1329.8, "end": 1338.52, "text": "also ich habe eine Mischung bei mir daheim aus Unify Geräten als Access Point und als,"}, {"id": 182, "start": 1338.52, "end": 1345.64, "text": "ich nenne es mal jetzt Core Switch, also halt mein 10 Gigabit Switch, wo dann alles andere"}, {"id": 183, "start": 1345.64, "end": 1352.2, "text": "dran angeschlossen wird, nicht wirklich ein Core Switch, aber ihr wisst was ich meine,"}, {"id": 184, "start": 1352.2, "end": 1357.04, "text": "mit feuchtem Atem in die Maus hauchen, wenn du eine Logitech hast, damit lässt sich Doppelklick"}, {"id": 185, "start": 1357.04, "end": 1361.44, "text": "lösen, ja Doppelklick geht ja, aber manchmal macht er doppelt, soll ich mal da rein hauchen,"}, {"id": 186, "start": 1361.44, "end": 1375.4, "text": "ok, so ob das jetzt was gebracht hat, habe ich so meine Zweifel, das glaube ich nicht,"}, {"id": 187, "start": 1375.4, "end": 1384.48, "text": "so also zumindest, mein Netzwerk besteht so aus einer Mischung aus Ubiquity, also die"}, {"id": 188, "start": 1384.48, "end": 1393.24, "text": "Access Points und meinem Edge, 10 Gigabyte Edge Switch und der Rest ist eigentlich MikroTik,"}, {"id": 189, "start": 1393.24, "end": 1400.16, "text": "also der Router ist MikroTik, Switch im Wohnzimmer ist MikroTik, Switch im Erdgeschoss ist MikroTik,"}, {"id": 190, "start": 1400.16, "end": 1410.52, "text": "Switch im Keller ist MikroTik, ja gut, dann habe ich noch eine Fritzbox für VoIP, bleibt"}, {"id": 191, "start": 1410.52, "end": 1419.64, "text": "da nichts anderes übrig, VoIP willst du nicht selber machen, da glaube ich, gibt es Leute"}, {"id": 192, "start": 1419.64, "end": 1426.88, "text": "die so massu schiesslich sind und daheim VoIP bzw. irgendwelche IP Telefonie selbst machen"}, {"id": 193, "start": 1426.88, "end": 1433.08, "text": "und nicht was fertiges nehmen, also ich muss euch ehrlich sagen, VoIP ist eines der painst"}, {"id": 194, "start": 1433.08, "end": 1441.72, "text": "champigsten IT Themen, die ich kenne, ist die VoIP Fritzbox als Client im Netzwerk,"}, {"id": 195, "start": 1441.72, "end": 1447.24, "text": "ne die ist gar nicht im WLAN, die ist bei Kabel angeschlossen, also bei mir sieht das"}, {"id": 196, "start": 1447.24, "end": 1457.68, "text": "so aus, machen wir mal wieder Huge Massive Pain Skills, also bei mir sieht das so aus,"}, {"id": 197, "start": 1457.68, "end": 1474.12, "text": "als nächster ist die Unity Media, dieses Drecks Teil, Connectbox, so, dann ist direkt"}, {"id": 198, "start": 1474.12, "end": 1487.92, "text": "daran angeschlossen, eine Fritzbox von AVM, wo manche Leute behaupten es wäre die rote"}, {"id": 199, "start": 1487.92, "end": 1500.04, "text": "Pest aus Berlin, aber das ist eine Fritzbox, so die ist direkt daran angeschlossen, an"}, {"id": 200, "start": 1500.04, "end": 1515.6, "text": "die Unity Media Connectbox, dann haben wir hier einen Mikrotik Router, ich mal mal wie"}, {"id": 201, "start": 1515.6, "end": 1533.64, "text": "das angeschlossen ist, und da ist dann mein 10G Switch dran, machen wir mal ein bisschen"}, {"id": 202, "start": 1533.64, "end": 1558.88, "text": "größer, 10G Switch, so, und dann haben wir, dann haben wir, dann haben wir, dann haben"}, {"id": 203, "start": 1558.88, "end": 1584.52, "text": "wir, Access Points, AP, und das ganze quasi dann dreimal, stimmt nicht ganz, stimmt nicht"}, {"id": 204, "start": 1584.52, "end": 1591.48, "text": "ganz, da ist noch ein Switch dazwischen, weil da unten noch der Raspberry Pi dran ist, so,"}, {"id": 205, "start": 1591.48, "end": 1598.76, "text": "so sieht das bei mir ungefähr aus, netzwerktechnisch, jetzt ohne Geräte und ohne sinnlose Zwischendinger,"}, {"id": 206, "start": 1598.76, "end": 1618.48, "text": "ja, so sieht das aus, so, und hier ist das ganze interne Zeug dran, ja, gut, was gibt"}, {"id": 207, "start": 1618.48, "end": 1627.16, "text": "es da groß zu zeigen, ich meine in Wirklichkeit ist es so, dass hier im Erdgeschoss, ah das"}, {"id": 208, "start": 1627.16, "end": 1632.8, "text": "ist doof, hier im Erdgeschoss, ne das kann man so nicht malen, hier ist eigentlich noch"}, {"id": 209, "start": 1632.8, "end": 1638.52, "text": "ein Switch dabei, und hier im Erdgeschoss hängt dann zum Beispiel noch ein Raspberry"}, {"id": 210, "start": 1638.52, "end": 1662.2, "text": "Pi dran, für Unify Controller und meine Überwachungskameras, der ist da dran, der ist ganz praktisch, weil"}, {"id": 211, "start": 1662.2, "end": 1667.28, "text": "der hängt quasi am gleichen Switch, das Dinge so konfiguriert, WLAN technisch, dass der"}, {"id": 212, "start": 1667.28, "end": 1678.08, "text": "halt im gleichen physischen Layer 2 Ding hängt wie die Axis Points, das heißt der kann die"}, {"id": 213, "start": 1678.08, "end": 1695.44, "text": "da drüber steuern, ja, genau, und Axis Points haben WLAN 1 default und WLAN 1337 für IoT,"}, {"id": 214, "start": 1695.44, "end": 1704.4, "text": "also die machen 2 WLANs, die machen quasi einmal, einmal quasi, nennen wir es mal irgendwie,"}, {"id": 215, "start": 1704.4, "end": 1713.08, "text": "keine Ahnung, ja, client WLAN, und dann machen die nochmal hier, man machs mal, machs mal"}, {"id": 216, "start": 1713.08, "end": 1725.88, "text": "orange, so und dann machen die noch ein IoT WLAN, ich speichere mir das mal, das können"}, {"id": 217, "start": 1725.88, "end": 1731.72, "text": "wir bestimmt gebrauchen, ja so ist das, so ist das bei mir daheim aufgebaut, na und hier"}, {"id": 218, "start": 1731.72, "end": 1737.32, "text": "ist dann zum Beispiel auch der Internet Server mit Time Automatisierung drauf, und hier ist"}, {"id": 219, "start": 1737.32, "end": 1741.76, "text": "auch mein Rechner drauf, das hier ist auch das Nass, das ist ja die gleiche Kiste, die"}, {"id": 220, "start": 1741.76, "end": 1750.08, "text": "Gigabits mäßig dran, ja, ja und VoIP geht halt hier drüber, das hängt halt direkt außen"}, {"id": 221, "start": 1750.08, "end": 1763.04, "text": "dran, da ist halt, braucht ja auch hier gar nicht dahinter zu sein, was haben die Portallöcher"}, {"id": 222, "start": 1763.04, "end": 1775.24, "text": "jetzt dazu, was, hä, so und, ja hier hängen da noch solche Sachen dran, wie, ah hier gibt"}, {"id": 223, "start": 1775.24, "end": 1786.84, "text": "es, ups, hier gibt es da noch so Sachen wie deckt, deckt, Telefone und sowas, Jane doch"}, {"id": 224, "start": 1786.84, "end": 1804.8, "text": "nicht rumspammen, so, so sieht das bei mir daheim aus, exellent, gut, also wo sind wir"}, {"id": 225, "start": 1804.8, "end": 1812.28, "text": "denn stehen geblieben, wow danke für den Sub, skalieren mit dem Unify Controller, klar"}, {"id": 226, "start": 1812.28, "end": 1820.4, "text": "aber bei mir skaliert alles, diagonal 4D, ich mein sogar Lull ist dreidimensional, skaliert"}, {"id": 227, "start": 1820.4, "end": 1837.0, "text": "schon, krass eigentlich, dass Leute noch Festnetz Telefone nutzen, na ja, warum nicht, ich mein,"}, {"id": 228, "start": 1837.0, "end": 1845.8, "text": "ich hab ne App bei mir auf dem Handy von meinem VoIP Anbieter, dass das Handy auch klingelt,"}, {"id": 229, "start": 1845.8, "end": 1851.72, "text": "das ist lustig, da kann man unterwegs dran gehen, aber daheim, ich hab ja nicht unbedingt"}, {"id": 230, "start": 1851.72, "end": 1865.48, "text": "immer das Handy am Start, na also ich hab, ich hab zwei Fritz Phones dran, also wirklich"}, {"id": 231, "start": 1865.48, "end": 1870.32, "text": "so ein oldschool analog, nein ist ja nicht analog, ist halt deckt Zeug, ich hab zwei"}, {"id": 232, "start": 1870.32, "end": 1880.32, "text": "Fritz Phones dran und ne VoIP App auf dem Handy, ja hier drüber geht unter anderem auch die"}, {"id": 233, "start": 1880.32, "end": 1888.56, "text": "Tür klingelt dann, dann hast du deine ganze Anrufliste wieder auf mehreren Geräten verteilt,"}, {"id": 234, "start": 1888.56, "end": 1900.28, "text": "ja, gut alles was über die Rufnummer reinkommt, ist kein Problem, aber ja klar hab ich, aber"}, {"id": 235, "start": 1900.28, "end": 1909.76, "text": "das stört mich nicht, großartig, naja, mal ne Frage an die Haltnasen, ich bin letztes"}, {"id": 236, "start": 1909.76, "end": 1919.84, "text": "Jahr in die IT umgestiegen, von wo, was hast du vorher gemacht, schreib mal Ed Wupplos"}, {"id": 237, "start": 1919.84, "end": 1924.4, "text": "dabei falls du noch da bist und antwortest, dass ich sehe, weil ich bin mit dem Chat ziemlich"}, {"id": 238, "start": 1924.4, "end": 1928.88, "text": "hinten dran, ich bin letztes Jahr in der IT umgestiegen und hab mir einen kompletten"}, {"id": 239, "start": 1928.88, "end": 1935.44, "text": "Java Script Stack angeeignet, jetzt bin ich bei einer Firma runtergekommen die voll auf"}, {"id": 240, "start": 1935.44, "end": 1949.64, "text": "Java, ein Bylight, nein so schlimm ist das gar nicht und Angular Sets, kann das sein,"}, {"id": 241, "start": 1949.64, "end": 1956.8, "text": "dass diese Full Stack JavaScript Application noch nicht so im Umlauf sind, hab das Gefühl"}, {"id": 242, "start": 1956.8, "end": 1965.52, "text": "alles den Sets, naja, ich persönlich bin ja der Ansicht, Full Stack JavaScript gibt es"}, {"id": 243, "start": 1965.52, "end": 1972.96, "text": "nur, aus dem Grund, weil Frontend Leute unbedingt auch Backend machen wollten, ansonsten, wenn"}, {"id": 244, "start": 1972.96, "end": 1979.12, "text": "man mal ehrlich ist, hat Node.js keinen sittlichen Mehrwert, weißte, da regen sich jetzt ganz"}, {"id": 245, "start": 1979.12, "end": 1986.72, "text": "viele Node.js Entwickler drüber auf und sagen Max das geht doch nicht, ich mein klar, nein"}, {"id": 246, "start": 1986.72, "end": 1990.4, "text": "es stimmt so nicht, wie ich das gesagt hab, doch es hat schon einen gewissen Mehrwert,"}, {"id": 247, "start": 1990.4, "end": 1997.76, "text": "du hast zum Beispiel den Vorteil, dass du, wenn man das, das ist in der Theorie so, ich"}, {"id": 248, "start": 1997.76, "end": 2003.76, "text": "weiß nicht wie oft das wirklich in der Praxis vorkommt, du kannst schon deine Models zum"}, {"id": 249, "start": 2003.76, "end": 2016.64, "text": "Beispiel sharen zwischen Frontend und Backend, das ist dann eventuell ganz, ganz nice, Node.js"}, {"id": 250, "start": 2016.64, "end": 2025.56, "text": "hat den Vorteil, dass es relativ easy zu benutzen ist und der größte Vorteil von Node.js kommt"}, {"id": 251, "start": 2025.56, "end": 2031.68, "text": "nicht unbedingt dadurch, dass es Node.js ist, sondern dadurch, dass NPM einfach für"}, {"id": 252, "start": 2031.68, "end": 2039.76, "text": "nahezu alles irgendwelche Packages hat, also das große Ökosystem auf NPM ist tatsächlich"}, {"id": 253, "start": 2039.76, "end": 2046.56, "text": "ein echter Pluspunkt, aber ansonsten muss man ehrlich sagen, is even, is odd, ja es"}, {"id": 254, "start": 2046.56, "end": 2050.64, "text": "gibt totalen Schwachsinn, aber halt wenn du NPM installierst siehst du halt und installierst"}, {"id": 255, "start": 2050.64, "end": 2056.0, "text": "es halt im Internet, aber ansonsten muss ich sagen, die Kombination aus Java und Angular"}, {"id": 256, "start": 2056.0, "end": 2062.0, "text": "gut, ich muss dir ehrlich sagen, Angular war wirklich nicht meine favorisierte Sache,"}, {"id": 257, "start": 2062.0, "end": 2067.56, "text": "ich hab damit nie großartig was gemacht, ich hab da mal zu Angular 1 Zeiten was zugesehen,"}, {"id": 258, "start": 2067.56, "end": 2071.72, "text": "das fand ich ganz cool, aber mittlerweile ist Angular, ich hab da auch keinen Bock drauf"}, {"id": 259, "start": 2071.72, "end": 2076.8, "text": "mich damit mal zu beschäftigen, für mich als Außenstehender sieht Angular einfach"}, {"id": 260, "start": 2076.8, "end": 2084.8, "text": "nach einem riesen Haufen bloated, das ist quasi so das Java der JavaScript Frameworks"}, {"id": 261, "start": 2084.8, "end": 2093.76, "text": "mit Dependency Injection und Factories und Adapter Pattern und ach keine Ahnung was"}, {"id": 262, "start": 2093.76, "end": 2108.28, "text": "es da nicht alles gibt, das ist halt ein riesen Ding, ja, also ich persönlich mag ja Kombination,"}, {"id": 263, "start": 2108.28, "end": 2116.96, "text": "könnt ihr euch jetzt fast schon denken, ASP.NET Core und Vue.js, aber so richtige Fullstack"}, {"id": 264, "start": 2116.96, "end": 2123.88, "text": "JavaScript Applikation, ich weiß gar nicht wieviel es davon wirklich live gibt, zum üben"}, {"id": 265, "start": 2123.88, "end": 2132.96, "text": "und basteln ist Node immer gut, aber was fällt euch aus dem Kopf ein, wer hat, wer von den"}, {"id": 266, "start": 2132.96, "end": 2140.16, "text": "großen Services ist komplett Node.js, also YouTube ist glaube ich irgendeine Mischung"}, {"id": 267, "start": 2140.16, "end": 2151.0, "text": "aus Python und, nee nicht PAP, was ist YouTube C++ und Python oder so, nee Discord Electron"}, {"id": 268, "start": 2151.0, "end": 2158.2, "text": "zählt nicht, mein Server Backend, dann hast du Twitter, die waren mal Ruby, Ruby on Rails,"}, {"id": 269, "start": 2158.2, "end": 2173.44, "text": "aber ich glaube mittlerweile ist Twitter irgendwas JVM Java basiert das auch, ja, also so wirklich"}, {"id": 270, "start": 2173.44, "end": 2180.08, "text": "Fullstack Javaske, mir fällt jetzt da nicht so viel ein ehrlich gesagt, das stimmt ganz"}, {"id": 271, "start": 2180.08, "end": 2190.08, "text": "viele hippe Startups, aber das ist tatsächlich, das ist also die Kombination aus Java im Backend"}, {"id": 272, "start": 2190.08, "end": 2194.36, "text": "und gut ob es jetzt Angular oder was anderes ist, Frontend ist so ziemlich weit verbreitende"}, {"id": 273, "start": 2194.36, "end": 2202.08, "text": "Business Geschichte, wobei ich von der Java, von der Java Welt keine Ahnung habe, aber"}, {"id": 274, "start": 2202.08, "end": 2205.68, "text": "ich sag mal so, ich kann es lesen, ich könnte auch was drin programmieren, aber muss nicht"}, {"id": 275, "start": 2205.68, "end": 2216.16, "text": "unbedingt sein, ja was unsere Azubis aktuell machen wird mich wirklich mal interessieren,"}, {"id": 276, "start": 2216.16, "end": 2223.6, "text": "lange nichts davon gehört, der eine hat mir letztens eine Azure Function eingerichtet,"}, {"id": 277, "start": 2223.6, "end": 2230.76, "text": "hat er zwei Tage rumgeklickt, aber ansonsten habe ich lange nichts mehr von unseren Azubis"}, {"id": 278, "start": 2230.76, "end": 2242.76, "text": "gehört, ja gut, da haben wir auf der Arbeit auch einen, bei dem weiß ich, der ist irgendwie"}, {"id": 279, "start": 2242.76, "end": 2247.64, "text": "auch schon keine Ahnung, 150 Jahre verheiratet, da sagt er immer, dass ihn seine Frau nervt"}, {"id": 280, "start": 2247.64, "end": 2251.96, "text": "und deswegen geht er auf die Arbeit, da war auch fast die gesamte Corona Zeit auf der Arbeit"}, {"id": 281, "start": 2251.96, "end": 2259.88, "text": "in Frankfurt, aber ich habe ja auch keine Schmerzen damit, wenn die Leute hingehen,"}, {"id": 282, "start": 2259.88, "end": 2263.68, "text": "dass sie daheim was stört, aber man sollte nicht den Leuten, die daheim bleiben wollen,"}, {"id": 283, "start": 2263.68, "end": 2273.52, "text": "dann auch noch Steine in den Weg legen, Deko 50 Billar, danke schön für den Sub, äh"}, {"id": 284, "start": 2273.52, "end": 2279.6, "text": "nicht Sub, für die Bits, das sind quasi, das ist ungefähr, das sind 5 Euro quasi,"}, {"id": 285, "start": 2279.6, "end": 2292.32, "text": "was ein Sub auch kosten würde, der Scam Train steigt nicht, nein, der Scam Train ist immer"}, {"id": 286, "start": 2292.32, "end": 2301.88, "text": "vor dem Chef im Betrieb, der Scam Train schläft nicht, der Scam Train ist immer vor dem Chef"}, {"id": 287, "start": 2301.88, "end": 2326.4, "text": "im Betrieb und scammt die Subs schweißfrei, der Scam Train wird nie müde, genau, ey 50"}, {"id": 288, "start": 2326.4, "end": 2335.56, "text": "Euro, ne, warte mal, ne, den kenne ich nicht, der fährt in die andere Richtung, ne, ja,"}, {"id": 289, "start": 2335.56, "end": 2343.24, "text": "das ist eh lustig, ne, überall schieben sie immer noch Corona Panik, aber wenn die Bahn"}, {"id": 290, "start": 2343.24, "end": 2359.44, "text": "streikt und da sich die Leute stapeln, das interessiert keinen, ja, das glaube ich auch,"}, {"id": 291, "start": 2359.44, "end": 2365.28, "text": "das glaube ich auch, ich könnte mir vorstellen, dass die Stonks Manager, dass die gar nicht"}, {"id": 292, "start": 2365.28, "end": 2370.92, "text": "überrascht sind, dass die das einfach nur vorschieben mit wir sind überrascht, dass"}, {"id": 293, "start": 2370.92, "end": 2374.0, "text": "die Leute denken so, oh vielleicht sollten wir das mal nicht so machen, aber ich glaube,"}, {"id": 294, "start": 2374.0, "end": 2379.44, "text": "ich war einer der ersten, die offiziell diese Arbeitszeitänderung eingereicht haben bei"}, {"id": 295, "start": 2379.44, "end": 2383.12, "text": "uns, sobald ich gehört habe, ich meine, wir haben das ja vorher schon oft gemacht mit Home"}, {"id": 296, "start": 2383.12, "end": 2387.32, "text": "Office, aber sobald ich gehört habe, dass wir jetzt offiziell mit Arbeitszeitänderung"}, {"id": 297, "start": 2387.32, "end": 2392.96, "text": "und so das machen können, ich war glaube ich, keine Ahnung, 2 Stunden nachdem das veröffentlicht"}, {"id": 298, "start": 2392.96, "end": 2395.56, "text": "wurde, dass es das gibt, hatte ich das Ding ausgefüllt und meinem Chef geschickt."}, {"id": 299, "start": 2395.56, "end": 2407.2, "text": "Die Musik ist tatsächlich sogar relativ laut, aber die ist halt sehr gechillort, gechillsort."}, {"id": 300, "start": 2407.2, "end": 2431.24, "text": "Doch, danke für den Sub, 4 Monate, Max420, hey, ich bin der erste, also wenn jemand darüber"}, {"id": 301, "start": 2431.24, "end": 2436.04, "text": "abstimmen würde oder so, ob Cannabis legalisiert werden soll, ich bin der erste, der sagen"}, {"id": 302, "start": 2436.04, "end": 2444.0, "text": "würde, ja, ich selber, rauch nix, was gibt es da sonst noch, rauch nix, schnief nix,"}, {"id": 303, "start": 2444.0, "end": 2452.76, "text": "trink nix, spritz nix, ich mach nichts davon, aber ich bin trotzdem für die Legalisierung."}, {"id": 304, "start": 2452.76, "end": 2481.12, "text": "Hüton, der Wein vom Italiener geht, ne, ihr kennt mich, ich trinke auch kaum was, also"}, {"id": 305, "start": 2481.12, "end": 2490.0, "text": "was das angeht, habe ich einen äußerst gesunden Lebensstil, aber ich bin zu fett."}, {"id": 306, "start": 2490.0, "end": 2495.32, "text": "Ich kann aber nicht alles haben."}, {"id": 307, "start": 2495.32, "end": 2510.72, "text": "Der Cute Mod, ja, das frage ich mich auch, von dem habe ich schon lange nichts mehr gehört,"}, {"id": 308, "start": 2510.72, "end": 2527.76, "text": "wo ist der Cute Mod, was hältst du von Fullstack Javascript App, Javascript, Beispiel, oh Gott,"}, {"id": 309, "start": 2527.76, "end": 2539.16, "text": "die Abkürzung Javascript, ich muss kurz überlegen, was ist Maven, View, Angular, ach du Scheiße,"}, {"id": 310, "start": 2539.16, "end": 2551.52, "text": "Javascript Stack Abkürzung, Note, Note, was ist denn, okay, was ist M und was ist E in"}, {"id": 311, "start": 2551.52, "end": 2564.88, "text": "dem Fall, MongoDB könnte sein, für Datenbank, Ah, Express, ja, du hast Recht, ja, wegen"}, {"id": 312, "start": 2564.88, "end": 2575.6, "text": "Express, MongoDB, Express, View und Note, oh, das gleiche hier mit Angular, okay, ja,"}, {"id": 313, "start": 2575.6, "end": 2580.12, "text": "also es kommt ein bisschen drauf an, ich könnte mir vorstellen, dass irgendwelche hippe Startups"}, {"id": 314, "start": 2580.12, "end": 2591.32, "text": "das schon so machen, aber gerade bei uns so im Bankenumfeld, da wo ich arbeite, ist Java"}, {"id": 315, "start": 2591.32, "end": 2597.24, "text": "das Ding, also Java Backend, sonst da führt kein Weg dran vorbei, der andere Seite mal"}, {"id": 316, "start": 2597.24, "end": 2603.4, "text": "ganz ehrlich, ich sehe immer noch nicht den großen Vorteil von, ich habe ja gerade so"}, {"id": 317, "start": 2603.4, "end": 2608.72, "text": "ein paar Sachen aufgezählt, aber ich sehe immer noch nicht den großen Vorteil von alles"}, {"id": 318, "start": 2608.72, "end": 2613.64, "text": "Javascript, außer eben, dass wenn man halt Javascript gut kann und Frontend-Stells macht"}, {"id": 319, "start": 2613.64, "end": 2618.6, "text": "und vielleicht ein bisschen Logik scheren will zwischen Frontend und Backend, dann kann"}, {"id": 320, "start": 2618.6, "end": 2629.96, "text": "ich mir das, kann ich mir das vorteilhaft vorstellen, aber ansonsten, was spricht gegen, sagen wir,"}, {"id": 321, "start": 2629.96, "end": 2637.36, "text": "C-Sharp, Java, PHP, was auch immer, Backend und man lässt Javascript im Frontend, da"}, {"id": 322, "start": 2637.36, "end": 2641.92, "text": "wo es seine Stärken hat, spricht da überhaupt nichts dagegen, weil, wenn du jetzt, ob du"}, {"id": 323, "start": 2641.92, "end": 2648.8, "text": "jetzt irgendeine API hast in Node oder in Java, macht doch eigentlich keinen Unterschied,"}, {"id": 324, "start": 2648.8, "end": 2659.6, "text": "kannst auch Django machen oder so, Python, Python, Python, kannst du auch machen, Ruby"}, {"id": 325, "start": 2659.6, "end": 2667.52, "text": "on Rails kannst du auch machen, Spring Boot, Kotlin, alles mögliche, Cobol, Rest API,"}, {"id": 326, "start": 2667.52, "end": 2688.64, "text": "ich glaube es gibt keinen Webserver in Cobol, gibt es einen Cobol Webserver, warum, heute"}, {"id": 327, "start": 2688.64, "end": 2695.24, "text": "programmieren wir eine Webseite mit Cobol, ja Moment, der verwendet auch einen fertigen"}, {"id": 328, "start": 2695.24, "end": 2714.72, "text": "Webserver, der verwendet auch einen fertigen Webserver, jaja, die verwenden auch einen"}, {"id": 329, "start": 2714.72, "end": 2728.12, "text": "fertigen Webserver, gibt es einen Cobol Webserver, was, Cobol on Wheelchair, Microweb Framework"}, {"id": 330, "start": 2728.12, "end": 2734.92, "text": "for Cobol, Moment, Moment, warum gibt es sowas, ja gut, der Typ hat auch kein Bock,"}, {"id": 331, "start": 2734.92, "end": 2756.24, "text": "das zu supporten, Cobol on Cocks, ja, die machen das, der Webserver, es hat keiner Bock"}, {"id": 332, "start": 2756.24, "end": 2761.32, "text": "einen Webserver in Cobol zu programmieren, guck, die lassen die Webserver Geschichte"}, {"id": 333, "start": 2761.32, "end": 2769.56, "text": "auch über Apache machen, keiner mag Cobol Webserver programmieren, ich weiß gar nicht,"}, {"id": 334, "start": 2769.56, "end": 2785.84, "text": "kann man überhaupt Sockets gescheit ansprechen, über Cobol bestimmt, Crap, Alter, ok, komm"}, {"id": 335, "start": 2785.84, "end": 2791.8, "text": "weiter, wollt ihr übrigens, das ist übrigens der Titel, ist ein bisschen Chebat, gebe ich"}, {"id": 336, "start": 2791.8, "end": 2794.92, "text": "zu, ich habe ja gesagt, so viele Sachen einkaufen muss ich gar nicht, ich bin eigentlich nur"}, {"id": 337, "start": 2794.92, "end": 2797.4, "text": "angekommen, dass ich ein bisschen mit euch schwätzen kann, aber ein paar Sachen muss"}, {"id": 338, "start": 2797.4, "end": 2810.24, "text": "ich doch gleich noch einkaufen, aber ich gucke erstmal Chat durch, wir haben ja Zeit, kennst"}, {"id": 339, "start": 2810.24, "end": 2822.12, "text": "du eine Möglichkeit, den Python Console Output in Tick, mit diesem TCL, nicht Web GUI Zeug,"}, {"id": 340, "start": 2822.12, "end": 2843.8, "text": "hab ich nie großartig was gemacht, keine Ahnung, aber das eingebaute Python GUI ist"}, {"id": 341, "start": 2843.8, "end": 2856.56, "text": "schon Paynes Champ, ich probiere Gehub mal aus später, will es jetzt hier nicht im Stream"}, {"id": 342, "start": 2856.56, "end": 2868.84, "text": "installieren, sonst kackt es mir ab und mein Haus geht nicht mehr oder so was, kann man"}, {"id": 343, "start": 2868.84, "end": 2877.56, "text": "in Gehub Makros machen, ich brauche Makros, das ist wichtig, ich brauche Makros, also"}, {"id": 344, "start": 2877.56, "end": 2881.88, "text": "ordentliche Makros, am besten mit Lua, das war das beste an der Logitech Software, dass"}, {"id": 345, "start": 2881.88, "end": 2903.2, "text": "man nur an Makros machen konnte, gucken wir uns gleich an, ich habe heute wieder bei Absolut"}, {"id": 346, "start": 2903.2, "end": 2915.96, "text": "Basic Dinge gefailt, ich wollte mir ein neues Deo kaufen und ich habe das falsche gekauft,"}, {"id": 347, "start": 2915.96, "end": 2926.0, "text": "aber die Benamungen sind ja auch richtig bescheuert, guckt euch das mal an, wie viele Sachen die"}, {"id": 348, "start": 2926.0, "end": 2937.04, "text": "mit Pure im Namen haben, das sind 50 Seiten mit Pure, Pure Fresh, Pure Ocean, Pure sonst"}, {"id": 349, "start": 2937.04, "end": 2947.88, "text": "was, Pure Nature, Pure Natural, Pure sonst was, ja ich habe es falsche gekauft, richtig"}, {"id": 350, "start": 2947.88, "end": 2962.12, "text": "bei den Basic Dingen des täglichen Lebens gefailt wieder, alles bloated, ok wir gucken"}, {"id": 351, "start": 2962.12, "end": 2968.8, "text": "uns jetzt das Video an mit der Insulinpumpe, nee ich muss den Chat vorher fertig machen,"}, {"id": 352, "start": 2968.8, "end": 2973.88, "text": "lieber in Java und dann out of Memory, geht eigentlich, eigentlich sollte ja sowas wie"}, {"id": 353, "start": 2973.88, "end": 2981.6, "text": "ein Garbage Collector in Java dafür sorgen, dass du weniger Memory Leaks produzierst, aber"}, {"id": 354, "start": 2981.6, "end": 2986.28, "text": "auf der anderen Seite ist es überhaupt kein Problem in Java und C Sharp Memory Leaks zu"}, {"id": 355, "start": 2986.28, "end": 2994.44, "text": "fabrizieren, selbst ohne Unsafe Code, also nichts einfacher als das als das Memory Leak"}, {"id": 356, "start": 2994.44, "end": 3006.96, "text": "in C Sharp zu fabrizieren, schon cringe, kein WiFi 6 im Keller, ja ich weiß, weiß, richtig"}, {"id": 357, "start": 3006.96, "end": 3016.12, "text": "richtig cringe, also ich glaube WiFi 6 beziehungsweise so 5-600 Mbit braucht man unbedingt im Keller,"}, {"id": 358, "start": 3016.12, "end": 3032.24, "text": "das ist ganz wichtig, der ist gut, ja da habe ich auch im Erdgeschoss, ja pvz kann man immer"}, {"id": 359, "start": 3032.24, "end": 3039.12, "text": "mal wieder neu installieren und dann durchspielen, das ist ja selbst mit allem was es so zu machen"}, {"id": 360, "start": 3039.12, "end": 3046.32, "text": "gibt, relativ schnell durchgespielt, kannst ein paar Tage immer mal wieder spielen, dann"}, {"id": 361, "start": 3046.32, "end": 3055.6, "text": "ist es durch, ja schon ein bisschen cringe, ich weiß, ja alles gleiche SSID, ja das muss"}, {"id": 362, "start": 3055.6, "end": 3063.48, "text": "man unbedingt machen im Unify Controller, ich zeige euch mal wie das aussieht, da gibt"}, {"id": 363, "start": 3063.48, "end": 3075.36, "text": "es so, gibt es so ein Bild, ja zeig mal, ja super, super geile Auflösung, ah yes, erkennt"}, {"id": 364, "start": 3075.36, "end": 3088.36, "text": "ihr alles, ich finde das ist schon ziemlich gut, sag mal warum ist denn die Quali so kacke,"}, {"id": 365, "start": 3088.36, "end": 3094.32, "text": "es gibt hier genau, es gibt hier irgendwo ein Dings, ne nicht Advanced Features, es gibt"}, {"id": 366, "start": 3094.32, "end": 3115.12, "text": "hier irgendwo sowas Auto Optimize Network und das müsst ihr unbedingt ausschalten, ja,"}, {"id": 367, "start": 3115.12, "end": 3123.72, "text": "wo auch immer das jetzt ist, da hier, das da ist es, das muss man ausschalten oder wenn"}, {"id": 368, "start": 3123.72, "end": 3127.32, "text": "man keine Probleme hat, kann man das natürlich auch angeschaltet lassen, das ist jetzt keine"}, {"id": 369, "start": 3127.32, "end": 3135.8, "text": "Pflicht, aber das Ding hat einen Nachteil wenn das angeschaltet ist und zwar wenn das"}, {"id": 370, "start": 3135.8, "end": 3144.32, "text": "Unify Zeug gemerkt hat, dass euer Gerät, sag mal mal euer Smartphone oder so, 5 Gigahertz"}, {"id": 371, "start": 3144.32, "end": 3150.72, "text": "SP ich es, dann zwingt es das Gerät sich mit 5 Gigahertz zu verbinden und 5 Gigahertz"}, {"id": 372, "start": 3150.72, "end": 3160.16, "text": "geht halt oftmals nicht so weit wie 2,4 Gigahertz WLAN, dementsprechend kann es durchaus sein,"}, {"id": 373, "start": 3160.16, "end": 3164.6, "text": "dass der Access Point nicht weit weg ist und ihr auf dem Klo trotzdem keinen richtigen"}, {"id": 374, "start": 3164.6, "end": 3192.28, "text": "Empfang habt, eigentlich schon richtig cringe, was ist denn OpenNet Admin, das kenne ich"}, {"id": 375, "start": 3192.28, "end": 3205.92, "text": "nicht, aber was hat das denn mit DNS, DHCP Integration zu tun, du kannst damit doch nicht"}, {"id": 376, "start": 3205.92, "end": 3218.48, "text": "deine Unify Geräte einstellen oder, ONA, das ist ein IP Adress Management oder, Online"}, {"id": 377, "start": 3218.48, "end": 3231.84, "text": "Demo, sieht aus wie 1995, ja es sieht wirklich aus wie 1995, oh Leute ist das, ist das Dings,"}, {"id": 378, "start": 3231.84, "end": 3241.36, "text": "wie heißt dieses JavaScript Framework, was auch TV Headend und sonst was, nicht Express,"}, {"id": 379, "start": 3241.36, "end": 3245.84, "text": "so ein ganz altes, so ein ganz ganz altes Java, das sieht aus wie, ich hab vergessen"}, {"id": 380, "start": 3245.84, "end": 3253.6, "text": "wie das heißt, XJS, XJS, genau, so sieht das aus, wo ich mich immer gefragt hab, warum"}, {"id": 381, "start": 3253.6, "end": 3264.44, "text": "um alles in der Welt benutzt man sowas, ja XJS, XJS ist wirklich richtig a pain in the"}, {"id": 382, "start": 3264.44, "end": 3286.84, "text": "ass, alter, guck mal den Kram, den will schon gar keiner mehr verwenden, ZIP Calling ist"}, {"id": 383, "start": 3286.84, "end": 3291.96, "text": "cringe, ja alles, alles ist cringe, alles was man selbst nicht gut findet ist prinzipiell"}, {"id": 384, "start": 3291.96, "end": 3299.72, "text": "erstmal cringe, das war ja nur, Moment mal, in diesem Clip, das war ja nur dazu da, um"}, {"id": 385, "start": 3299.72, "end": 3305.2, "text": "zu demonstrieren, dass, ich weiß gar nicht mehr, was wollte ich denn da nochmal da, irgendwas"}, {"id": 386, "start": 3305.2, "end": 3318.36, "text": "wo ich gesagt hab, man muss sich selbst schlagen, niemals VoIP selber, ja seh ich auch so, oh"}, {"id": 387, "start": 3318.36, "end": 3326.68, "text": "nice, will sie überhaupt Festnetz telefonen, tja, richtig Boomer, was soll ich sagen, bin"}, {"id": 388, "start": 3326.68, "end": 3338.76, "text": "alt genug, cac.box gibt's das wirklich, mach ich jetzt aber nicht auf, cacw.services gibt's,"}, {"id": 389, "start": 3338.76, "end": 3344.8, "text": "beste Domain die ihr euch merken müsst, aktuell hab ich den Server runtergefahren, aber hier,"}, {"id": 390, "start": 3344.8, "end": 3352.2, "text": "cacw.services, jemand zufällig die Idee für einen Router, der nicht die Welt kostet, aber"}, {"id": 391, "start": 3352.2, "end": 3363.76, "text": "ein bisschen mehr Routing Kapazität hat, als das Unify, Dings, Blah Gateway, der x-beliebige"}, {"id": 392, "start": 3363.76, "end": 3372.52, "text": "Mikrotik Router für 50 Euro, aber Video Streams darüber laufen lassen, Müss muss auch funktionieren,"}, {"id": 393, "start": 3372.52, "end": 3378.72, "text": "kann nicht sein, dass bei einem einzelnen User mit 1-2 Streams das Ding irgendwie Probleme"}, {"id": 394, "start": 3378.72, "end": 3383.36, "text": "macht, das muss anderes, das muss andere Probleme haben, das muss an was anderem liegen."}, {"id": 395, "start": 3383.36, "end": 3397.52, "text": "Die Connectbox ist von Unity Media oder Vodafone jetzt, aber zu Unity Media Zeiten war die Connectbox"}, {"id": 396, "start": 3397.52, "end": 3404.8, "text": "so ein Hybridgerät aus Modem, mit ein bisschen WLAN und mit ein bisschen Switch und mit ein"}, {"id": 397, "start": 3404.8, "end": 3415.36, "text": "bisschen Telefon, also quasi die Fritzbox von Unity Media sozusagen, hab ich aber alles"}, {"id": 398, "start": 3415.36, "end": 3416.36, "text": "ausgeschaltet."}, {"id": 399, "start": 3416.36, "end": 3427.24, "text": "Ja, muss ich mal gucken, gerade was Heimautomatisierung angeht, hab ich das schon lange vor da mal"}, {"id": 400, "start": 3427.24, "end": 3444.88, "text": "eine Tour zu machen, aber ich muss gucken, dass ich nicht wupp wupp leake zu viel, da"}, {"id": 401, "start": 3444.88, "end": 3452.76, "text": "hätt ich viel zu tun, bis ich da alle Clients eingemalt hab, also das merke ich, wenn ich"}, {"id": 402, "start": 3452.76, "end": 3458.2, "text": "durch meinen DHCP scrolle und es haben nicht mal alle dynamische IPs, da bin ich gut beschäftigt."}, {"id": 403, "start": 3458.2, "end": 3474.52, "text": "Die Connectbox hat glaube ich sogar 4 Netzwerkanschlüsse, vielleicht sogar 5."}, {"id": 404, "start": 3474.52, "end": 3493.8, "text": "Wo geht das Internet rein, na hier, hier kommt, hier kommt das Kabel aus dem Keller, wie gesagt"}, {"id": 405, "start": 3493.8, "end": 3505.0, "text": "ich hab Raspberry Pi, Raspberry Pi mit Unify Controller, DN Punt, Dankeschön für den"}, {"id": 406, "start": 3505.0, "end": 3520.6, "text": "Sub Overlay hier, huge ihr beiden, neun Monate sogar schon, Massive Subscription hier, welches"}, {"id": 407, "start": 3520.6, "end": 3533.92, "text": "wieder am 10G Switch, boah muss ich jetzt nachgucken, ja ich hab mich da drüber schon"}, {"id": 408, "start": 3533.92, "end": 3539.48, "text": "ausgelassen, ich find's scheiße, wohlgemerkt nicht, dass die das Recht haben zu streiken"}, {"id": 409, "start": 3539.48, "end": 3545.8, "text": "sondern die Auswirkungen find ich scheiße und mir ist es egal, ob es an der Bahn oder"}, {"id": 410, "start": 3545.8, "end": 3555.52, "text": "an der GDL liegt, ich will einfach nur fahren und pünktlich ankommen."}, {"id": 411, "start": 3555.52, "end": 3560.76, "text": "Unify Controller in Kubernetes, ich bin mir nicht sicher, ob das überhaupt gescheit funktioniert,"}, {"id": 412, "start": 3560.76, "end": 3577.4, "text": "aber dann können wir hyperscalen diagonal, wenn der in Kubernetes ist, achtdimensional,"}, {"id": 413, "start": 3577.4, "end": 3597.72, "text": "dann schon, ja das hab ich auch schon gesehen, es gibt, ich hab gesehen, es gibt für, also"}, {"id": 414, "start": 3597.72, "end": 3605.48, "text": "für den ESP32, es gibt MicroPython, es gibt eine Lua Geschichte, es gibt die übliche"}, {"id": 415, "start": 3605.48, "end": 3610.2, "text": "standardmäßige C, C++ Geschichte und ich glaube es gibt auch mittlerweile die Möglichkeit"}, {"id": 416, "start": 3610.2, "end": 3621.28, "text": "Javascript auszuführen, warum auch immer man das machen will, aber das geht, du hast"}, {"id": 417, "start": 3621.28, "end": 3645.8, "text": "mit Bode im Back, was ist Bode, gibt es nicht, Bode gibt es nicht, ja in dem Fall wirklich"}, {"id": 418, "start": 3645.8, "end": 3674.28, "text": "lieber C++, ach no, ich hab mit Bode, alter, he lacks critical information, also nix, aber"}, {"id": 419, "start": 3674.28, "end": 3681.28, "text": "dass es standardmäßig Javascript frontend am Start ist, ist schon ein bisschen übertrieben,"}, {"id": 420, "start": 3681.28, "end": 3692.52, "text": "Angular übertreibt es halt komplett, tatsächlich, ich glaube dafür ist es wirklich gut, aber"}, {"id": 421, "start": 3692.52, "end": 3697.24, "text": "die meisten, die damit anfangen, also wenn das businessmäßig benutzt wird, die machen"}, {"id": 422, "start": 3697.24, "end": 3701.64, "text": "damit bestimmt auch kleine Sachen, einfach so nach dem Motto, es gibt ja, es gibt ja,"}, {"id": 423, "start": 3701.64, "end": 3704.56, "text": "das verstehe ich auch nicht so genau, ja, das habe ich jetzt schon öfters gehört, dass"}, {"id": 424, "start": 3704.56, "end": 3710.4, "text": "manche Unternehmen, gerade jetzt nicht so supergroße, sondern durchaus auch kleinere, dass sie"}, {"id": 425, "start": 3710.4, "end": 3715.84, "text": "total festgefahren sind auf so eine gewisse Technik, die sagen dann, wir machen nur.NET"}, {"id": 426, "start": 3715.84, "end": 3723.24, "text": "oder keine Ahnung, oder wir machen nur Angular, warum, ich verstehe das immer nicht, warum"}, {"id": 427, "start": 3723.24, "end": 3727.44, "text": "legt man sich schon im Voraus auf irgendwas fest und sagt, dass man prinzipiell alles"}, {"id": 428, "start": 3727.44, "end": 3731.92, "text": "damit macht, ich meine, ok, wenn man die Leute und die Programmierer hat, die sich damit"}, {"id": 429, "start": 3731.92, "end": 3735.84, "text": "am besten auskennen, ich mache auch die meisten Sachen in C-Sharp, weil es mir meine Lieblingssprache"}, {"id": 430, "start": 3735.84, "end": 3745.48, "text": "ist, aber wenn sich was anderes anbietet, weil es eben die Vorteile überwiegt von einer"}, {"id": 431, "start": 3745.48, "end": 3750.36, "text": "anderen Technologie, ja, dann sehe ich da kein Problem drin, dass mit was anderem, zumal"}, {"id": 432, "start": 3750.36, "end": 3758.96, "text": "ich habe schon Sachen in Go gemacht, sogar in C, in JavaScript, in Ruby, in Python, alles"}, {"id": 433, "start": 3758.96, "end": 3760.96, "text": "mögliche schon, warum auch nicht?"}, {"id": 434, "start": 3760.96, "end": 3779.96, "text": "Ja, kann man sich darüber streiten, ich glaube, das ist alles durchaus in Ordnung, was es"}, {"id": 435, "start": 3779.96, "end": 3783.96, "text": "an Frontend gibt, und ich muss sagen, ich finde es ja ganz gut mittlerweile, was JavaScript"}, {"id": 436, "start": 3783.96, "end": 3792.16, "text": "angeht, dass sich View, React und Angular durchgesetzt haben, es entsteht zwar immer"}, {"id": 437, "start": 3792.16, "end": 3798.68, "text": "noch täglich 50 neue JavaScript-Frameworks, aber die großen drei sind über die letzten"}, {"id": 438, "start": 3798.68, "end": 3805.08, "text": "Jahre doch relativ beständig, was gibt es denn so Neues an JavaScript-Frameworks, was"}, {"id": 439, "start": 3805.08, "end": 3811.52, "text": "richtig, auch mal Svelte gibt es vielleicht noch, aber was auch mal so richtig User anzieht,"}, {"id": 440, "start": 3811.52, "end": 3819.4, "text": "du hast View, Angular, React, Deno ist kein Frontend-Framework, Deno ist Node-Abklatsch,"}, {"id": 441, "start": 3819.4, "end": 3825.56, "text": "Svelte ist vielleicht noch so ein bisschen so ein Ding, aber ansonsten, die großen drei"}, {"id": 442, "start": 3825.56, "end": 3831.72, "text": "und gut ist, das finde ich gut, das hat mal ein bisschen Stabilität in dieses JavaScript-Ökosystem"}, {"id": 443, "start": 3831.72, "end": 3836.24, "text": "gebracht, wo ja sonst jeden Tag jeder was anderes gebaut hat und keine Woche mal was"}, {"id": 444, "start": 3836.24, "end": 3851.04, "text": "Gleiches verwendet wurde, ja gibt es ja nicht mehr jetzt in dem Umfang, was heute gekauft"}, {"id": 445, "start": 3851.04, "end": 3868.4, "text": "wird, gleich, gleich, Single-Side, ne, was ist SSR, immer die ganzen Abkürzungen, Single"}, {"id": 446, "start": 3868.4, "end": 3882.36, "text": "Responsibility oder was soll das sein, Ach Server-Side Rendering, ja ok, das verstehe"}, {"id": 447, "start": 3882.36, "end": 3901.0, "text": "ich, das verstehe ich, ja das lasse ich mir gefallen, ja Server-Side Rendering, das verstehe"}, {"id": 448, "start": 3901.0, "end": 3920.92, "text": "ich, ja Bing-Picture-of-the-Day ist wichtig heute, was ist denn Bing-Picture-of-the-Day,"}, {"id": 449, "start": 3920.92, "end": 3938.64, "text": "Bing-Picture-of-the-Day, Image of the Day, ein Kegel, sieht ein bisschen aus wie der Todesberg"}, {"id": 450, "start": 3938.64, "end": 3961.92, "text": "aus Zelda, ein Vulkan, we finish to go backend plus Ruby on Rails frontend, was, das ergibt"}, {"id": 451, "start": 3961.92, "end": 3980.8, "text": "keinen Sinn, das sind beides backend Geschichten, wie soll das funktionieren, hast gesehen Microsoft"}, {"id": 452, "start": 3980.8, "end": 3986.44, "text": "Asher hatte Sicherheitslücken beim DB Service, jeder konnte RW drauf zugreifen, ja habe"}, {"id": 453, "start": 3986.44, "end": 3995.16, "text": "ich gelesen, ich habe sie aber nicht genauer angeguckt, aber tja, Datenbank-Stellz, Kosmos-DB-Stellz,"}, {"id": 454, "start": 3995.16, "end": 4011.48, "text": "war es glaube ich, kann schon mal passieren, ja, auf welche Fettnäpfchen sollte man beim"}, {"id": 455, "start": 4011.48, "end": 4017.32, "text": "ersten Arbeitstag, da habe ich ein Video zu, guck mal, vielleicht hast du das auch schon"}, {"id": 456, "start": 4017.32, "end": 4030.6, "text": "gesehen, ich weiß nicht, hier schau mal da, Tipps für den ersten Arbeitstag, wenn nicht,"}, {"id": 457, "start": 4030.6, "end": 4037.2, "text": "kannst du es mal angucken, ich habe deine Nachricht überlesen, oh ich glaube nicht,"}, {"id": 458, "start": 4037.2, "end": 4046.64, "text": "ich war einfach nur langsam, ich glaube mittlerweile habe ich was zu gesagt oder, der Sebaro lebt,"}, {"id": 459, "start": 4046.64, "end": 4055.04, "text": "bewegt mich ziemlich, dass der Sebaro noch lebt, äh nein, ich weiß was es ist und so"}, {"id": 460, "start": 4055.04, "end": 4082.48, "text": "grob wofür es da ist, aber damit habe ich noch gar nichts gemacht, ich bin wieder begeistert"}, {"id": 461, "start": 4082.48, "end": 4101.64, "text": "was es alles gibt, ja, ist echt so, gerade, wie gesagt, gerade hier im Big Stonks Banken-Umfeld,"}, {"id": 462, "start": 4101.64, "end": 4111.72, "text": "es ist saumäßig viel Java, kenn es ja von uns, warum wird heute alles über HTTP gemacht,"}, {"id": 463, "start": 4111.72, "end": 4118.92, "text": "von Sauerei oder, was ist aus den guten alten Sachen geworden, warum überhaupt TCP, das"}, {"id": 464, "start": 4118.92, "end": 4127.48, "text": "ist alles so wahnsinnig bloated, ich bin wieder für IPX und NetBOI und sowas, die guten alten"}, {"id": 465, "start": 4127.48, "end": 4144.84, "text": "Klassiker sollten wir mal wieder rausholen, HTTP bloated Shit da, FDP genau, die Leute"}, {"id": 466, "start": 4144.84, "end": 4151.32, "text": "wissen heute überhaupt nicht mehr was FDP ist, ich denke das hat was mit Melinda zu tun"}, {"id": 467, "start": 4151.32, "end": 4162.72, "text": "oder so, nee, FDP oder WebDAF oder so, schau mal das von Notschritt, ja, das ist ein Notizprogramm"}, {"id": 468, "start": 4162.72, "end": 4182.16, "text": "für Mac, ja, ich glaube wir haben hier einige Leute, die sweetpiesen auskennen, Jithub,"}, {"id": 469, "start": 4182.16, "end": 4187.36, "text": "kannst du als Gist, als Gist hochladen auf Jithub und posten, da haben wir bestimmt"}, {"id": 470, "start": 4187.36, "end": 4200.32, "text": "ein paar Leute, die sich damit auskennen, für Nicht-Programmierer, was ist dein Memory"}, {"id": 471, "start": 4200.32, "end": 4205.16, "text": "Leak, wenn du Speicher belegst und den nicht mehr freigibst und das nächste Mal wieder"}, {"id": 472, "start": 4205.16, "end": 4212.12, "text": "Speicher belegst und den nicht mehr freigibst, wenn du vergisst Speicher freizugeben, möglichst"}, {"id": 473, "start": 4212.12, "end": 4221.12, "text": "an Stellen wo du das auch noch öfters machst, dann benutzt dein Programm immer mehr RAM"}, {"id": 474, "start": 4221.12, "end": 4229.24, "text": "und gib dir nie frei und irgendwann hast du ein kleines Furzprogramm, was 3GB verbraucht"}, {"id": 475, "start": 4229.24, "end": 4250.72, "text": "und irgendwann crasht und die besten Memory Leaks macht man immer noch mit C++, ah, das"}, {"id": 476, "start": 4250.72, "end": 4255.0, "text": "ist eine gute Frage, was ist so ein gutes Programmiersprachen Portfolio nach dem Studio,"}, {"id": 477, "start": 4255.0, "end": 4263.8, "text": "also als erstes finde ich wichtig, dass man eine Sprache wirklich gut kann, das macht"}, {"id": 478, "start": 4263.8, "end": 4268.88, "text": "vieles einfacher, gerade auch das Lernen weiterer Sprachen, aber man braucht so eine"}, {"id": 479, "start": 4268.88, "end": 4274.72, "text": "0815 Standard Sprache, immer wenn man was machen will, dass man einfach sich weniger"}, {"id": 480, "start": 4274.72, "end": 4278.72, "text": "mit der Sprache beschäftigen muss, wird heute noch geschoppt, ja ja ein paar Sachen kaufen"}, {"id": 481, "start": 4278.72, "end": 4282.48, "text": "wir noch ein, wie gesagt, ich sag ihr, der Titel ist heute ein bisschen gebait gewesen,"}, {"id": 482, "start": 4282.48, "end": 4285.96, "text": "ich hab einige Sachen, aber hält sich in Grenzen, ich hab den Stream heute angemacht,"}, {"id": 483, "start": 4285.96, "end": 4290.44, "text": "dass wir ein bisschen schwätzen können, kennst dich von YouTube, ja nice, dass du den Weg"}, {"id": 484, "start": 4290.44, "end": 4294.6, "text": "her gefunden hast, du hast dir leider heute einen relativ langweiligen Stream ausgesucht,"}, {"id": 485, "start": 4294.6, "end": 4302.36, "text": "also es ist wichtig, dass man eine Sprache wirklich gut kann, weil wenn irgendjemand"}, {"id": 486, "start": 4302.36, "end": 4306.72, "text": "mal zu dir kommt und fragst, kannst du xy machen, dann musst du dich nicht groß um"}, {"id": 487, "start": 4306.72, "end": 4311.04, "text": "die Sprache kümmern, sondern so sagst, ja mach ich, machst deine Standard IDE auf,"}, {"id": 488, "start": 4311.04, "end": 4316.96, "text": "redet vor was auch immer und bastelst in deiner Standard Sprache los, erstmal gar nicht so"}, {"id": 489, "start": 4316.96, "end": 4322.0, "text": "wichtig, was das ist, wichtig ist, dass du eine Sprache wirklich flüssig kannst, auch"}, {"id": 490, "start": 4322.0, "end": 4328.84, "text": "die Standard Library dazu, dass du einfach Probleme relativ schnell lösen kannst, so"}, {"id": 491, "start": 4328.84, "end": 4333.2, "text": "und das bringt dir natürlich auch was, wenn du weitere Sprachen lernen willst, aber kommen"}, {"id": 492, "start": 4333.2, "end": 4339.0, "text": "wir mal zu dem Punkt, also wenn es ins Cloud Umfeld geht, dann ist auf jeden Fall Go angesagt,"}, {"id": 493, "start": 4339.0, "end": 4346.6, "text": "Go, Python, so diese Kombination ist, gerade Github Projekte gehen ja da durch die Decke,"}, {"id": 494, "start": 4346.6, "end": 4355.28, "text": "allerdings würde ich dir trotzdem noch eine ordentliche Backend Sprache mit der nötigen"}, {"id": 495, "start": 4355.28, "end": 4361.6, "text": "Performance empfehlen plus Javascript, Go, Python, Javascript und dann suchst du dir"}, {"id": 496, "start": 4361.6, "end": 4378.78, "text": "aus C Sharp, Java, irgendwas, das ist eine gute Mischung, Javascript Frontend brauchst"}, {"id": 497, "start": 4378.78, "end": 4384.68, "text": "du, am Frontend kommst du eigentlich nicht vorbei, also Javascript ist Pflicht mittlerweile,"}, {"id": 498, "start": 4384.68, "end": 4389.4, "text": "wie gesagt das muss nicht deine beste Sprache sein, aber du sollst ein bisschen durchblicken,"}, {"id": 499, "start": 4389.4, "end": 4394.92, "text": "mit Go, Python und dann irgendwie x-beliebische andere Backendsprache noch, irgendwas, was"}, {"id": 500, "start": 4394.92, "end": 4398.92, "text": "du auch mal Performance mäßig verwenden kannst, wie gesagt es ist egal, ob C Sharp"}, {"id": 501, "start": 4398.92, "end": 4408.08, "text": "ist, Java, kannst auch Go im Backend verwenden, ja, aber also Python, Go, Javascript ist"}, {"id": 502, "start": 4408.08, "end": 4412.4, "text": "wunderbar, ich würde halt noch irgendwas klassisches Objektorientiertes noch ein bisschen dazu"}, {"id": 503, "start": 4412.4, "end": 4421.2, "text": "empfehlen, Java ist sicherlich die Business Variante."}, {"id": 504, "start": 4421.2, "end": 4426.48, "text": "Was macht Go so gut fürs Backend, Go hat ein paar große Vorteile was Cloud angeht, dadurch"}, {"id": 505, "start": 4426.48, "end": 4431.4, "text": "dass du Self Contained Executables hast, die auch nicht so wahnsinnig groß sind, so ein"}, {"id": 506, "start": 4431.4, "end": 4436.86, "text": "Go Programm fällt raus als ausführbare Datei mit allem was dabei ist, keine Frameworks"}, {"id": 507, "start": 4436.86, "end": 4441.26, "text": "mehr installieren und nix, das ist so eines der Sachen die und rückwärts kompatibel"}, {"id": 508, "start": 4441.26, "end": 4451.4, "text": "lauffähig bis Linux Kernel 2.6.32 oder so, also das ist gerade für, ähm, wir skalieren"}, {"id": 509, "start": 4451.4, "end": 4456.28, "text": "Container rauf und runter und schieben neue Versionen hin, das macht halt Go richtig gut,"}, {"id": 510, "start": 4456.28, "end": 4460.66, "text": "so und was die Sprache an sich auszeichnet, du kannst dir übrigens mal ein Video dazu"}, {"id": 511, "start": 4460.66, "end": 4464.76, "text": "angucken, ich hab ja ein Video zur Einsteigerprogrammiersprache gemacht, aber sie hat ja"}, {"id": 512, "start": 4464.76, "end": 4469.68, "text": "so das Aushängeschild von Go, ist ja die ganze, ich weiß ich sollte es nicht Multithreading"}, {"id": 513, "start": 4469.68, "end": 4476.52, "text": "nennen, weil das ist es ja nicht, es sind ja Go Routines, das muss ja nicht zwangsläufig"}, {"id": 514, "start": 4476.52, "end": 4483.04, "text": "Asynchron oder ein eigener Thread sein, aber ich sag das jetzt mal trotzdem, du kannst"}, {"id": 515, "start": 4483.04, "end": 4496.16, "text": "in Go relativ gut asynchrone Sachen machen, ohne dass es blockt und auch Interthread Kommunikation"}, {"id": 516, "start": 4496.16, "end": 4502.16, "text": "und so ist, in Go relativ gut, dazu kommt, dass Go noch eine halbwegs umfangreiche Standard"}, {"id": 517, "start": 4502.16, "end": 4506.72, "text": "Library hat und was halt auch mittlerweile in Go richtig gut ist, dass du einen ziemlich"}, {"id": 518, "start": 4506.72, "end": 4510.84, "text": "großen Library Pool auf GitHub hast, für alles mögliche."}, {"id": 519, "start": 4510.84, "end": 4520.36, "text": "Ich persönlich mag Go nicht so sehr, ich hab schon Sachen in Go gemacht, aber ich werd"}, {"id": 520, "start": 4520.36, "end": 4526.84, "text": "mit der Syntax einfach nicht so hundertprozentig warm."}, {"id": 521, "start": 4526.84, "end": 4533.92, "text": "Es gibt dann so ein paar Sachen bei Go, also das verstehe ich nicht, einmal, dass sie dich"}, {"id": 522, "start": 4533.92, "end": 4540.96, "text": "compilertechnisch so gängeln, so nach dem Motto Unused Imports, Compiler Fehler, warum"}, {"id": 523, "start": 4540.96, "end": 4546.2, "text": "sind Unused Imports Compiler Fehler, es sollte zumindest einen Flag geben, dass man das ausschalten"}, {"id": 524, "start": 4546.2, "end": 4552.64, "text": "kann oder Unused Variables Compiler Fehler, du willst erstmal was auskommentieren und"}, {"id": 525, "start": 4552.64, "end": 4556.6, "text": "testen, ob es daran lag, nein kannst du nicht, weil du noch 50 andere Sachen auch auskommentieren"}, {"id": 526, "start": 4556.6, "end": 4557.6, "text": "musst."}, {"id": 527, "start": 4557.6, "end": 4562.96, "text": "Das find ich nervig bei Go, es wäre ja vollkommen in Ordnung, wenn man sagt, hey ich mach ein"}, {"id": 528, "start": 4562.96, "end": 4571.16, "text": "Release Build, dann will ich das nicht haben, aber das ist nervig, ne ja, Visual Studio"}, {"id": 529, "start": 4571.16, "end": 4578.24, "text": "Coach schmeißt vielleicht die Imports automatisch raus, aber nicht Unused Variables, es ist"}, {"id": 530, "start": 4578.24, "end": 4579.24, "text": "auf jeden Fall nervig."}, {"id": 531, "start": 4579.24, "end": 4587.0, "text": "So und dann, was ich in Go auch nicht so schön finde, ist, dass die an manchen Stellen sehr"}, {"id": 532, "start": 4587.0, "end": 4594.16, "text": "minimalistisch sind, so nach dem Motto, warum soll ich einen Array mit Filter und Select"}, {"id": 533, "start": 4594.16, "end": 4599.24, "text": "haben, wenn ich doch Vorschleifen machen kann, ist also die Go Philosophie, Go hat mal ganz"}, {"id": 534, "start": 4599.24, "end": 4605.72, "text": "gerne 3 Nested For Loops, weil es nichts anderes gibt, Generics gibt es auch irgendwann in"}, {"id": 535, "start": 4605.72, "end": 4612.6, "text": "50 Jahren mal, ja also ich werd mit Go nicht abschließend warm, was das angeht, es ist"}, {"id": 536, "start": 4612.6, "end": 4616.16, "text": "aber sicherlich eine Sprache, die aktuell sehr viel Anklang findet."}, {"id": 537, "start": 4616.16, "end": 4630.8, "text": "Ja, allerdings, das mag schon sein, dass die dann drin bleiben, deswegen könnte man ja"}, {"id": 538, "start": 4630.8, "end": 4635.08, "text": "sagen, hey wenn ich ein Release Build mache, dann ist das Pflicht, aber wenn ich am entwickeln"}, {"id": 539, "start": 4635.08, "end": 4641.92, "text": "bin, das ist einfach für einen schnellen Ausprobier Workflow hinderlich, wenn du immer die Hälfte"}, {"id": 540, "start": 4641.92, "end": 4645.08, "text": "deines Programms und an unterschiedlichen Stellen auskommentieren willst, wenn du nur"}, {"id": 541, "start": 4645.08, "end": 4648.84, "text": "eine Sache rausschmeißen willst, also mich nervt das, es gab ja sogar schon mal ein Go"}, {"id": 542, "start": 4648.84, "end": 4659.84, "text": "Compiler Fork deswegen, ansonsten Go ist aber angesagt, also wie gesagt, Go, Python, Javascript"}, {"id": 543, "start": 4659.84, "end": 4664.0, "text": "ist eine super Kombination, ich würde halt noch so ein bisschen was alles klassisches"}, {"id": 544, "start": 4664.0, "end": 4670.2, "text": "Objekt orientieren empfehlen, einfach so für eine Sprache, die erprobt ist und dafür gedacht"}, {"id": 545, "start": 4670.2, "end": 4677.92, "text": "ist, möglichst schnell und ohne Schnick Schnack Probleme zu lösen, sowas wie C Sharp oder"}, {"id": 546, "start": 4677.92, "end": 4678.92, "text": "Java."}, {"id": 547, "start": 4678.92, "end": 4696.32, "text": "So, ich hatte auch mal versucht bei mir ein IPAM daheim zu installieren, aber ich war"}, {"id": 548, "start": 4696.32, "end": 4708.8, "text": "dazu faul für, mein IPAM ist mein DHCP Server, das muss reichen, IPAM ist IP Address Management,"}, {"id": 549, "start": 4708.8, "end": 4726.16, "text": "falls sich das einer fragt."}, {"id": 550, "start": 4726.16, "end": 4734.64, "text": "Irko und Dankeschön, 24 Monate Hypersubscription, bietet sich C++ als Main Sprache an, C++ bietet"}, {"id": 551, "start": 4734.64, "end": 4750.68, "text": "sich nie für irgendetwas an, C Sharp Backend und WPF, genau, genau, genau, so, ja, jetzt"}, {"id": 552, "start": 4750.68, "end": 4760.4, "text": "jetzt kommen wir der Sache langsam näher, was hältst du von Mutation Testing, ich weiß"}, {"id": 553, "start": 4760.4, "end": 4780.76, "text": "gar nicht, was das sein soll, ich finde es cool, wie breit hier die Skills seiner Community"}, {"id": 554, "start": 4780.76, "end": 4787.96, "text": "gefächert sind, ja das stimmt, wir haben hier richtig viele Massive Brain Leute, exzellent,"}, {"id": 555, "start": 4787.96, "end": 4808.56, "text": "im Chat habt ihr das gesehen, ihr wurdet gelobt, er meint euch, sogar der Chandler ist gemeint,"}, {"id": 556, "start": 4808.56, "end": 4821.32, "text": "ja, ich finde auch das Frontend generell richtig cringe ist, es könnte einfach alles ein Kommando"}, {"id": 557, "start": 4821.32, "end": 4833.56, "text": "Zeilen Tool sein, doch, doch, Go ist relativ populär, also ich würde sagen Javascript"}, {"id": 558, "start": 4833.56, "end": 4841.92, "text": "und Python Go dürften so die populärsten Sprachen auf GitHub, auf Shithub sein, nee,"}, {"id": 559, "start": 4841.92, "end": 4850.4, "text": "das ist gut, ASP.NET Core finde ich ist mit das beste Web Framework, was es gibt, wenn"}, {"id": 560, "start": 4850.4, "end": 4864.92, "text": "du mich fragst, ist das besser als Go, exzellent, programmierst du öfters objektorientierend"}, {"id": 561, "start": 4864.92, "end": 4870.44, "text": "ja so ein bisschen halt, so an denen jetzt nicht so religiös, dass ich sage hier, das"}, {"id": 562, "start": 4870.44, "end": 4877.8, "text": "muss alles hier mit Factories, Abstracts und Override und was auch immer sein, wenn es"}, {"id": 563, "start": 4877.8, "end": 4882.32, "text": "hin macht halt, und das finde ich übrigens auch die richtig coole Sache, was Microsoft"}, {"id": 564, "start": 4882.32, "end": 4891.04, "text": "mit C Sharp macht, die haben sich, die sind zwar quasi mal als Microsoft Javas Clone gestartet,"}, {"id": 565, "start": 4891.04, "end": 4896.36, "text": "aber die haben Java schon lange hinter sich gelassen, die hatten ja Generics quasi 100"}, {"id": 566, "start": 4896.36, "end": 4903.68, "text": "Jahre vor Java, ordentliche, böse Zungen behaupten, Java hat bis heute keine richtigen,"}, {"id": 567, "start": 4903.68, "end": 4908.08, "text": "die sind sich aber auch nicht so fein, das ganze objektorientiert ein bisschen eben liegen"}, {"id": 568, "start": 4908.08, "end": 4912.52, "text": "zu lassen und C Sharp ist die letzten Versionen deutlich funktioneller geworden, von Pattern"}, {"id": 569, "start": 4912.52, "end": 4918.28, "text": "Matching bis Record Types, Immutable Geschichten und so, also das finde ich wirklich gut bei"}, {"id": 570, "start": 4918.28, "end": 4919.28, "text": "Microsoft."}, {"id": 571, "start": 4919.28, "end": 4925.4, "text": "Der, also früher, also C Sharp wurde ja von Anders Halsberg erfunden, das ist der Typ,"}, {"id": 572, "start": 4925.4, "end": 4930.6, "text": "der auch TypeScript erfunden hat, also auf Auftrag von Microsoft hin, der Typ ist nicht"}, {"id": 573, "start": 4930.6, "end": 4934.08, "text": "einfach nur Big Brain und sagt, ich erfinde jetzt mal zwei der beliebtesten Programmiersprachen,"}, {"id": 574, "start": 4934.08, "end": 4940.12, "text": "das hat er schon auf Auftrag gemacht, vorher hat er glaube ich irgendwas mit Pascal, Delphi,"}, {"id": 575, "start": 4940.12, "end": 4947.32, "text": "Delphi hat er glaube ich vorher gemacht, ja, also der war richtig Big Brain und vorausschauend,"}, {"id": 576, "start": 4947.32, "end": 4952.36, "text": "was er mit C Sharp gemacht hat und der aktuelle Lead Designer von C Sharp, der heißt glaube"}, {"id": 577, "start": 4952.36, "end": 4959.56, "text": "ich, jetzt hat es halt irgendein schwedischer Name, Matt Torxen oder so, der ist auch ziemlich"}, {"id": 578, "start": 4959.56, "end": 4973.68, "text": "Big Brain, was neue Features angeht, Torxon, ne, Torgason, Torgason oder so heißt er glaube"}, {"id": 579, "start": 4973.68, "end": 4987.72, "text": "ich, ja, du wurdest geforst auf C++, oh Pains Jam, Moment, ich muss mal gucken, wie der Typ"}, {"id": 580, "start": 4987.72, "end": 4995.24, "text": "heißt, ich hab den Namen jetzt so falsch ausgesprochen, C Sharp Lead Designer, nein nicht anders der"}, {"id": 581, "start": 4995.24, "end": 5015.8, "text": "Nachfolger von Anders Halsberg, hier den meine ich, Matt Torgason, ok, ja, ok, fast richtig,"}, {"id": 582, "start": 5015.8, "end": 5024.48, "text": "das macht nichts, was sagt ihr zu Blazor Server Side, ganz ehrlich, ich bin ja großer"}, {"id": 583, "start": 5024.48, "end": 5035.88, "text": "Fan was Microsoft mit der.NET Entwicklung macht, aber Blazor, im Ernst, also ich verstehe"}, {"id": 584, "start": 5035.88, "end": 5041.88, "text": "weder den Sinn von Blazor Server Side noch den Sinn von Server, von Blazor Client Side,"}, {"id": 585, "start": 5041.88, "end": 5051.08, "text": "das leuchtet mir einfach nicht ein, kannst du nur zwei negative C++, oh das wird schwierig,"}, {"id": 586, "start": 5051.08, "end": 5062.6, "text": "ne, ne, wenn ich damit anfange ist es vorbei, was sind Record Types, oh kann ich das jetzt"}, {"id": 587, "start": 5062.6, "end": 5071.48, "text": "kurz erklären, das sind Klassen in C Sharp, die standardmäßig immutable sind, also du"}, {"id": 588, "start": 5071.48, "end": 5075.4, "text": "kannst sie nicht mehr ändern nachdem du sie angelegt hast, was für Multithreading und"}, {"id": 589, "start": 5075.4, "end": 5079.32, "text": "Performance technisch teilweise ganz gut ist, weil wenn du dir sicher sein kannst, dass"}, {"id": 590, "start": 5079.32, "end": 5091.52, "text": "eine Klasse sich nie wieder ändern kann nachdem du sie angelegt hast, du kannst Multithreaded"}, {"id": 591, "start": 5091.52, "end": 5097.74, "text": "dich komplett auslassen, weil ihr könnt euch eine ganz einfache Regel merken, Multithreading"}, {"id": 592, "start": 5097.74, "end": 5104.08, "text": "ist in 90% der Fällen kein Problem, oder in 99% der Fällen kein Problem, solange ihr"}, {"id": 593, "start": 5104.08, "end": 5113.72, "text": "nicht parallel schreibt, parallel lesen, kein Problem, parallel lesen und einer schreibt"}, {"id": 594, "start": 5113.72, "end": 5120.28, "text": "meistens auch kein Problem, aber sobald an zwei verschiedenen Stellen parallel geschrieben"}, {"id": 595, "start": 5120.28, "end": 5128.04, "text": "wird, procken, in der Regel ist Multithreading kein Problem, wenn ihr einfach nur mehrere"}, {"id": 596, "start": 5128.04, "end": 5134.08, "text": "Threads lesen, mehrere Threads lesen und ein Thread schreibt, in der Regel, du kannst je"}, {"id": 597, "start": 5134.08, "end": 5142.4, "text": "nachdem was du machst, du kannst doofe Race Conditions haben, so nach dem Motto, ich schreibe"}, {"id": 598, "start": 5142.4, "end": 5147.72, "text": "jetzt was rein und das ist halt nicht Atomic und dann lese ich was zur Hälfte aus oder"}, {"id": 599, "start": 5147.72, "end": 5161.64, "text": "das alte noch oder, ja aber in der Regel ist das in Ordnung, ja 70€ ist teuer, ich"}, {"id": 600, "start": 5161.64, "end": 5165.64, "text": "hab ja auch eins, aber das war auf jeden Fall billiger, 70€ hat ich dafür nicht ausgegeben,"}, {"id": 601, "start": 5165.64, "end": 5177.0, "text": "Leute, ich hab den Chat gepackt, easy, so jetzt können wir noch was einkaufen, Poggers, nice,"}, {"id": 602, "start": 5177.0, "end": 5192.16, "text": "ich hab's geschafft, ok, ich brauch was sehr unspektakuläres, Leute, ich brauch eine USB,"}, {"id": 603, "start": 5192.16, "end": 5203.84, "text": "eine USB Verlängerung, 2 Meter, sowas hier, bam, 2x2 Meter, Basket, zack, hab ich eigentlich"}, {"id": 604, "start": 5203.84, "end": 5208.68, "text": "mittlerweile schon alles immer noch, ja, hab ich noch nicht gekauft, ja, das kann ich mal"}, {"id": 605, "start": 5208.68, "end": 5213.8, "text": "rausschmeißen, zur Cosmos DB Lücke hab ich noch nichts gesagt, weil ich es nur mitbekommen"}, {"id": 606, "start": 5213.8, "end": 5222.04, "text": "habe, mich nicht näher damit jetzt beschäftigt habe, ich hab's mitbekommen, ich weiß, dass"}, {"id": 607, "start": 5222.04, "end": 5230.76, "text": "man darauf zugreifen konnte auf die Datenbank von anderen Leuten, Read-Write anscheinend,"}, {"id": 608, "start": 5230.76, "end": 5242.56, "text": "aber mehr auch nicht, ok, das brauch ich, hab ich euch eigentlich erzählt, meine Hausnummer,"}, {"id": 609, "start": 5242.56, "end": 5253.52, "text": "meine RGB Hausnummer ist fast da, guck mal hier, ich hatte, Moment, ich muss mal kurz"}, {"id": 610, "start": 5253.52, "end": 5262.52, "text": "das raussuchen, ich hatte mir 2 Hausnummern bestellt, aber ehrlich gesagt, ich weiß nicht,"}, {"id": 611, "start": 5262.52, "end": 5267.4, "text": "ob ich die ans Haus dran mache, ich hab die bestellt, dass wir im Stream was zu basteln"}, {"id": 612, "start": 5267.4, "end": 5276.16, "text": "haben, guck mal hier, RGB Hausnummern und das ganze sieht dann so aus, wenn's fertig"}, {"id": 613, "start": 5276.16, "end": 5294.8, "text": "ist, ist das nicht Poggers, ist das nicht die nicest Hausnummer überhaupt, also ich finde,"}, {"id": 614, "start": 5294.8, "end": 5312.68, "text": "das hat schon echt was, oder, wer hat so eine coole Hausnummer, brauch ich unbedingt,"}, {"id": 615, "start": 5312.68, "end": 5324.0, "text": "ich frag mich nur, ob man im Dunkeln überhaupt die Nummer erkennt, hast du eigentlich an"}, {"id": 616, "start": 5324.0, "end": 5330.96, "text": "diesem Anspiel-Event für Battlefield 2042 teilgenommen, es gibt noch kein Anspiel-Event,"}, {"id": 617, "start": 5330.96, "end": 5335.04, "text": "es wird, vielleicht gab's schon eins, aber es wird noch eins geben und da bin ich auch"}, {"id": 618, "start": 5335.04, "end": 5342.72, "text": "dabei, ja, das war übrigens lustig, die haben mich angeschrieben und haben mich nach meinen"}, {"id": 619, "start": 5342.72, "end": 5346.24, "text": "Hardware-Specs, das hab ich glaube ich letztes Mal schon erzählt, nach meinen Hardware-Specs"}, {"id": 620, "start": 5346.24, "end": 5352.96, "text": "gefragt, haben gesagt, ja, 8700k, 1080ti, 32G RAM, 2TB SSD, Platzfrei, überhaupt gar"}, {"id": 621, "start": 5352.96, "end": 5356.8, "text": "kein Problem her damit und da meinten sie, da krieg ich auf einmal eine Mail als Antwort"}, {"id": 622, "start": 5356.8, "end": 5363.68, "text": "so nach dem Motto, Max, wir schicken dir einen Leih-PC zum Anspielen zu, da hab ich gesagt,"}, {"id": 623, "start": 5363.68, "end": 5375.36, "text": "hä, was, warum, Mindestanforderung ist eine RTX 2060, da musste ich dann erstmal sagen,"}, {"id": 624, "start": 5375.36, "end": 5381.4, "text": "Moment, Moment, meine 1080ti ist 50% schneller als eine 2060, ihr braucht mir kein Recht"}, {"id": 625, "start": 5381.4, "end": 5397.08, "text": "dazu zu schicken, das hat nichts mit NDA zu tun, Battlefield 2042, ja, wie gesagt, meine"}, {"id": 626, "start": 5397.08, "end": 5405.32, "text": "Hausnummern sind auf dem Weg, wisst ihr was ich auch lustig finde, ich hab hier mal so"}, {"id": 627, "start": 5405.32, "end": 5415.32, "text": "ein Video gemacht, China, China, China, wie hieß das, irgendwas mit China, technisch"}, {"id": 628, "start": 5415.32, "end": 5423.76, "text": "heißt es Chinakram, hab ich mir so ein Video gemacht und dieses Video hat 380 Tage nach"}, {"id": 629, "start": 5423.76, "end": 5431.6, "text": "Veröffentlichung auf einmal innerhalb von einem Monat 10.000 Views bekommen, ich hab"}, {"id": 630, "start": 5431.6, "end": 5443.2, "text": "keine Ahnung warum, YouTube-Algorithmus hat sich gedacht, bam, jetzt, jetzt das ist das,"}, {"id": 631, "start": 5443.2, "end": 5469.48, "text": "was die Leute sehen wollen, nein, nein, nein, nein, das wird schon funktionieren, ich hab"}, {"id": 632, "start": 5469.48, "end": 5473.92, "text": "fast von löten getweetet, ja, ja, ja, hab ich, übrigens, hat davon eine Ahnung von"}, {"id": 633, "start": 5473.92, "end": 5483.32, "text": "euch, ihr schaut mal, ich hab mir heute überlegt, ob ich mir nicht Photovoltaik aufs Dach machen"}, {"id": 634, "start": 5483.32, "end": 5489.56, "text": "soll, ich bin da schon lange am überlegen, aber ich hab heute mal in so einem, im hessischen"}, {"id": 635, "start": 5489.56, "end": 5494.4, "text": "Sonnenatlas, oder wie das heißt, geguckt, wie mein Dach liegt und mein Dach liegt tatsächlich"}, {"id": 636, "start": 5494.4, "end": 5503.04, "text": "relativ gut, und ich hab das jetzt mal ausgerechnet, dass, wenn ich mir da ne Anlage draufbauen"}, {"id": 637, "start": 5503.04, "end": 5516.04, "text": "würde, mit nem Akku, dass ich 50% meines Jahresbedarfs decken könnte, und je nach"}, {"id": 638, "start": 5516.04, "end": 5528.56, "text": "dem durchaus auch mehr möglich, wenn ich ne größeren Akku nehme, ich würd mich aber"}, {"id": 639, "start": 5528.56, "end": 5532.2, "text": "halt gerne mal vor Ort beraten lassen, hat da irgendjemand eine Ahnung, wo es da gute"}, {"id": 640, "start": 5532.2, "end": 5537.76, "text": "Stellen gibt, also ich hab gesehen, bei der Verbraucherzentrale gibt es was für 30 Euro,"}, {"id": 641, "start": 5537.76, "end": 5542.88, "text": "da kommt dann irgendeine Energie-Experte, keine Ahnung, wie expertisch der ist, aber"}, {"id": 642, "start": 5542.88, "end": 5548.2, "text": "wahrscheinlich unabhängiger auf jeden Fall als von irgendeinem Anbieter, hat da jemand"}, {"id": 643, "start": 5548.2, "end": 5559.88, "text": "Erfahrung mit, hat sich jemand mal was Solarsachen angeht beraten lassen, naja natürlich darf"}, {"id": 644, "start": 5559.88, "end": 5565.68, "text": "ich das selber benutzen, selbstverständlich darf, das ist, das stimmt nicht, also du kannst"}, {"id": 645, "start": 5565.68, "end": 5570.4, "text": "dir aufs Dach, also da gibt es ja verschiedene Modelle, du kannst entweder alles für dich"}, {"id": 646, "start": 5570.4, "end": 5575.88, "text": "selbst benutzen und gar nichts einspeisen, aber das ist natürlich nicht so sinnvoll,"}, {"id": 647, "start": 5575.88, "end": 5581.72, "text": "wenn du gar nichts einspeist, weil wenn du mehr produzierst, als du verbrauchen kannst,"}, {"id": 648, "start": 5581.72, "end": 5589.92, "text": "da kriegst du wenigstens noch ein bisschen Geld für, aber du kannst das natürlich selbst"}, {"id": 649, "start": 5589.92, "end": 5595.0, "text": "benutzen, und so richtig lohnen tut sich das auch an, erst wenn du viel selbst benutzt,"}, {"id": 650, "start": 5595.0, "end": 5599.8, "text": "weil die Einspeiseförderergelder, die es gibt, werden immer weniger, und ich geh davon aus,"}, {"id": 651, "start": 5599.8, "end": 5603.84, "text": "dass nach der nächsten Bundestagswahl, auch wenn die Grünen am Start sein werden vielleicht,"}, {"id": 652, "start": 5603.84, "end": 5626.72, "text": "das nicht Bestand haben wird, zumindest nicht in der Höhe, ja wie gesagt, laut diesem Rechner"}, {"id": 653, "start": 5626.72, "end": 5638.4, "text": "kann ich mindestens 50% decken, mindestens 2 Kilowattstunden Batterie, Akku, Kilowattstunden"}, {"id": 654, "start": 5638.4, "end": 5653.48, "text": "ist ja die Menge, ich kenne bloß Ampere Stunden für Akkus und auch nicht überall hin, das"}, {"id": 655, "start": 5653.48, "end": 5657.28, "text": "heißt, wenn ich das ein bisschen größer baue und vielleicht noch einen größeren Akku nehme,"}, {"id": 656, "start": 5657.28, "end": 5661.56, "text": "dann könnte ich vielleicht sogar 60% oder so decken, das wäre auf jeden Fall schonmal"}, {"id": 657, "start": 5661.56, "end": 5681.28, "text": "cool, weil Stromkosten wären auch nicht billiger, ok, hat auch keiner von euch die Ahnung, na"}, {"id": 658, "start": 5681.28, "end": 5686.52, "text": "dann muss ich mal gucken, so wo wir gerade bei AliExpress sind, ich will mir noch eine"}, {"id": 659, "start": 5686.52, "end": 5692.72, "text": "Lampe bauen und das heißt, ich brauche unbedingt mal wieder einen 16x16 LED Matrix, das ist"}, {"id": 660, "start": 5692.72, "end": 5699.24, "text": "das erste schon, was du als Dings kriegst, 16x16 LED Matrix, ah die sind günstiger geworden,"}, {"id": 661, "start": 5699.24, "end": 5703.92, "text": "wir sind jetzt wieder runter auf 11 Euro, die wollten da mal 26 Euro teilweise für,"}, {"id": 662, "start": 5703.92, "end": 5718.08, "text": "ok Quaid, ja 11 Euro ist in Ordnung, 11 Euro kann ich dafür bezahlen, alles brauche ich,"}, {"id": 663, "start": 5718.08, "end": 5727.36, "text": "Versand, Standard Shipping, die China Chinesen, Alter, das ist auch Taktik oder, dass man"}, {"id": 664, "start": 5727.36, "end": 5739.08, "text": "das auf keinen Fall macht, ein Akku lohnt sich sehr selten, meinste, ich meine allein"}, {"id": 665, "start": 5739.08, "end": 5747.12, "text": "schon dadurch, dass du im Sommer oder generell auch zu anderen Zeiten was verbrauchst oder"}, {"id": 666, "start": 5747.12, "end": 5750.68, "text": "meinst du jetzt rein von dem, was man zusätzlich dadurch abdecken könnte und was der Akku"}, {"id": 667, "start": 5750.68, "end": 5761.84, "text": "kostet, ich will auf jeden Fall einen Akku, da habe ich eine USB fürs gesamte Haus, wenn"}, {"id": 668, "start": 5761.84, "end": 5780.12, "text": "der Strom mal ausfällt, funktioniert das überhaupt so wie ich mir das gerade vorstelle, Akku"}, {"id": 669, "start": 5780.12, "end": 5783.36, "text": "kannst du nach 3 Jahren wegkloppen, das weiß ich nicht, das müssen wir erstmal gucken,"}, {"id": 670, "start": 5783.36, "end": 5791.84, "text": "ob das wirklich so ist, das kann ich mir auch nicht vorstellen, wann kommt der Tesla gar"}, {"id": 671, "start": 5791.84, "end": 5797.12, "text": "nicht, ich werde mir erstmal kein neues Auto kaufen, ich fahre so selten Auto, das lohnt"}, {"id": 672, "start": 5797.12, "end": 5803.12, "text": "sich nicht und wenn, hole ich mir was in der Größe, wie ich jetzt habe, aber als Elektroauto"}, {"id": 673, "start": 5803.12, "end": 5808.72, "text": "und ihr wisst, ich habe das agilste Auto überhaupt und auch wahrscheinlich eines der"}, {"id": 674, "start": 5808.72, "end": 5831.4, "text": "ältesten fahrenden Autos hier von allen im Chat, also mein Auto ist von 2001, ja, in"}, {"id": 675, "start": 5831.4, "end": 5859.08, "text": "grün, in grün, gg, gut, also, das wird aber knapp, was passiert denn, was passiert denn,"}, {"id": 676, "start": 5859.08, "end": 5876.68, "text": "wenn ich 4500 bestelle, was kostet es, ach so, der Versand kostet 62000 Euro, das ist"}, {"id": 677, "start": 5876.68, "end": 5896.52, "text": "aber günstig, bis wann, bis wann gibt es Aliexpress Standard, ok, Aliexpress Standard"}, {"id": 678, "start": 5896.52, "end": 5907.36, "text": "geht ganz schön lang, oh, bis 130 oder so, das ist ja ein Schnapper hier, also 2 Stück,"}, {"id": 679, "start": 5907.36, "end": 5914.12, "text": "ach komm, das kostet 11 Euro, mir bestelle ich da jetzt 5 Stück von, das ist richtig"}, {"id": 680, "start": 5914.12, "end": 5924.2, "text": "nice, ich habe mir so eine RGB Lampe gebaut und da habe ich richtig Spaß dran an dem Ding,"}, {"id": 681, "start": 5924.2, "end": 5949.96, "text": "ich wollte mir jetzt noch eine fürs Schlafzimmer bauen, ihr schaut, huge RGB, die sieht man"}, {"id": 682, "start": 5949.96, "end": 5957.92, "text": "übrigens gar nicht so krass, die LEDs, das liegt ein bisschen an der iPhone Kamera, 50"}, {"id": 683, "start": 5957.92, "end": 5971.16, "text": "Euro für LED, ja, für 5 Stück, 3D gedruckt, ja, ja, bam, so, in den Einkaufswagen, Einkaufswagen"}, {"id": 684, "start": 5971.16, "end": 5997.08, "text": "ansehen, Bestellung ist raus, wunderbar, next, muss es mal kurz abhaken, kurz mal den Kram"}, {"id": 685, "start": 5997.08, "end": 6006.88, "text": "rausschmeißen, den ich schon habe, ja, wo ich ja immer noch ein bisschen auf der Suche"}, {"id": 686, "start": 6006.88, "end": 6013.68, "text": "bin, ist für meine Rollos ein Gurtwickler nennt sich das, aber einen, den ich gescheit"}, {"id": 687, "start": 6013.68, "end": 6020.72, "text": "fernsteuern kann, ich habe mal den Versuch gemacht, mit einem, das habe ich auch hier"}, {"id": 688, "start": 6020.72, "end": 6030.76, "text": "im Video gezeigt, Moment, aber die sind mir erstens zu teuer und zweitens hat der Hersteller"}, {"id": 689, "start": 6030.76, "end": 6038.8, "text": "Firmware gepatcht, dass man die nicht mehr mit Custom Software ansteuern kann, so, und"}, {"id": 690, "start": 6038.8, "end": 6049.48, "text": "mein Haus hier hat ja eine Mischung aus, sagen wir mal neuen Rollos, mit, die einfach nur"}, {"id": 691, "start": 6049.48, "end": 6053.4, "text": "aus Plastik sind, zum hoch und runter machen, die kann ich auch schon fernsteuern, funktioniert"}, {"id": 692, "start": 6053.4, "end": 6058.4, "text": "jetzt schon, aber ich habe noch ein paar Räume, das ist ein paar, ich glaube 5 Räume oder"}, {"id": 693, "start": 6058.4, "end": 6066.28, "text": "so noch, die haben noch so einen alten, richtig schweren Holzroller an, du hast die im Haus,"}, {"id": 694, "start": 6066.28, "end": 6070.44, "text": "würdest du nicht nochmal machen, warum, also ich mache es auch nicht, weil die haben mich"}, {"id": 695, "start": 6070.44, "end": 6082.56, "text": "jetzt schon nicht so ganz überzeugt, die Dinger, ähm, was gefällt dir da nicht, also zumindest"}, {"id": 696, "start": 6082.56, "end": 6088.84, "text": "man konnte den fernsteuern mit Custom Software, aber das funktioniert nicht mehr, das haben"}, {"id": 697, "start": 6088.84, "end": 6095.08, "text": "die irgendwie gepatcht, so und ich bin jetzt auf der Suche nach irgendwie so einem Gurtwickler,"}, {"id": 698, "start": 6095.08, "end": 6099.52, "text": "nennt sich das ja, am besten einen, den man direkt über WLAN, über offene Schnittstellen"}, {"id": 699, "start": 6099.52, "end": 6106.2, "text": "ansteuern kann, aber ich fürchte, sowas wird es nicht geben, innerhalb von einem Jahr musste"}, {"id": 700, "start": 6106.2, "end": 6112.64, "text": "ich sieben Stück neu konfigurieren, neu konfigurieren oder austauschen, weil sie kaputt waren, so"}, {"id": 701, "start": 6112.64, "end": 6129.68, "text": "wir suchen jetzt einfach Gurtwickler, API, sowas, sowas, die haben alle irgendwelche komischen"}, {"id": 702, "start": 6129.68, "end": 6137.88, "text": "Drecks Custom-Protokolle, das nervt mich, warum macht keiner nen Motor für nen Rollladen mit"}, {"id": 703, "start": 6137.88, "end": 6148.68, "text": "ner Web-API, nimm doch einfach nen elektrisch entbauenen Shelley ein, du meinst, dass der,"}, {"id": 704, "start": 6148.68, "end": 6154.04, "text": "das ist eigentlich ne gute Idee, du meinst, dass der Shelley für mich quasi auf, auf"}, {"id": 705, "start": 6154.04, "end": 6168.16, "text": "die Tasthoch-Hundertaste drückt oder was, oder wie meinst du das, das find ich jetzt"}, {"id": 706, "start": 6168.16, "end": 6176.0, "text": "ne gute Idee, nur neu konfigurieren war aber trotzdem mega aufwander, sagt, echt welche"}, {"id": 707, "start": 6176.0, "end": 6189.88, "text": "hast du, mach mal, mach mal einen coolen Vorschlag, was hast du denn für einen, okay, das ist"}, {"id": 708, "start": 6189.88, "end": 6201.32, "text": "natürlich Fail, das sind dann richtig olle, fette, große Holz-Rolläden, aber ich mag"}, {"id": 709, "start": 6201.32, "end": 6206.76, "text": "die Holz-Rolläden, weil wenn die zu sind, die sind richtig zu und die kannst du auch"}, {"id": 710, "start": 6206.76, "end": 6214.08, "text": "von außen nicht hochheben, gerade im Erdgeschoss find ich das richtig gut mit den Holz-Rolläden,"}, {"id": 711, "start": 6214.08, "end": 6217.84, "text": "ja musst du jetzt nicht, musst du nicht machen, wenn du es weißt, kannst du ja am nächsten"}, {"id": 712, "start": 6217.84, "end": 6239.88, "text": "schrieben oder so posten, genau, by the way, kennt jemand gute Pan-Tilt-Kameras für Indoor,"}, {"id": 713, "start": 6239.88, "end": 6247.0, "text": "am besten welche, die keine Apps brauchen dafür, die ich steuern kann, am besten über"}, {"id": 714, "start": 6247.0, "end": 6251.96, "text": "einen Webinterface, beziehungsweise die sich noch besser integrieren lassen, am besten"}, {"id": 715, "start": 6251.96, "end": 6257.88, "text": "in irgendwie Home Assistant oder per MQTT oder was auch immer und den RTSP Stream haben,"}, {"id": 716, "start": 6257.88, "end": 6262.04, "text": "das in Kombination ist tatsächlich gar nicht so einfach zu finden, die Kameras, die ich"}, {"id": 717, "start": 6262.04, "end": 6266.12, "text": "jetzt habe, die können das ja auch nur, weil ich die mit Custom-Firmware geflasht habe,"}, {"id": 718, "start": 6266.12, "end": 6275.92, "text": "also ich hab hier aktuell so welche, unter anderem die V2 Wisecam und die hab ich Custom-Firmware"}, {"id": 719, "start": 6275.92, "end": 6286.6, "text": "geflasht. So, und da hab ich MQTT-Integration für Pan-Tilt, da hab ich, also nicht mit der,"}, {"id": 720, "start": 6286.6, "end": 6294.84, "text": "mit der anderen von denen, da hab ich Möglichkeit, Nacht-Infrarot-LEDs zu kontrollieren, RTSP"}, {"id": 721, "start": 6294.84, "end": 6299.72, "text": "Streams, funktioniert wunderbar, aber ich hätte halt gerne sowas vielleicht, ohne"}, {"id": 722, "start": 6299.72, "end": 6306.84, "text": "dass ich Custom-Firmware flashen muss und ohne die kacken WLAN-Verbindungen dieser Kameras."}, {"id": 723, "start": 6306.84, "end": 6315.72, "text": "Vielleicht kennt ihr einer von euch was. Ja, die Dinger sind mega teuer und die kannst"}, {"id": 724, "start": 6315.72, "end": 6326.72, "text": "du glaub ich auch nicht gescheit steuern, außer über den, ihren Kram. Doch, es gab,"}, {"id": 725, "start": 6326.72, "end": 6332.0, "text": "es gab von Shelly eine extra Version für Rollladendinger, aber ich glaub von Shelly"}, {"id": 726, "start": 6332.0, "end": 6343.64, "text": "für den Rollladen, die sind für Rollladen Motoren gedacht. Ja, Moment, Drextream, habt"}, {"id": 727, "start": 6343.64, "end": 6349.64, "text": "ihr nen Motor oben, den ihr über den Shelly ansteuert oder habt ihr wirklich so nen, so"}, {"id": 728, "start": 6349.64, "end": 6360.68, "text": "nen eingebauten Motor-Wickler? Ja, am liebsten wären wir was mit MQTT-Insegrationen, außerdem"}, {"id": 729, "start": 6360.68, "end": 6364.92, "text": "kosten die Dinger viel. Ich hätte gerne so irgendwie so, keine Ahnung, 40 Euro Indoor-Kamera,"}, {"id": 730, "start": 6364.92, "end": 6385.36, "text": "fertig. Ich glaub das ist alles nicht so, aber Shelly 2.5. Onfif, genau so hieß das,"}, {"id": 731, "start": 6385.36, "end": 6393.56, "text": "ich erinnere mich noch dran, stimmt ja. Darüber hab ich das Root-Passwort von meiner Kamera"}, {"id": 732, "start": 6393.56, "end": 6397.4, "text": "rausbekommen, was ich dem Hersteller gemeldet hab und der Hersteller hat gesagt, ich soll"}, {"id": 733, "start": 6397.4, "end": 6419.76, "text": "mal gefälligst mein Proof of Concept von Github löschen. Ja, so kanns gehen. Ok,"}, {"id": 734, "start": 6419.76, "end": 6439.24, "text": "Shelly 2.5 sind gedacht für, das ist auch nur ein Relay zum Schalten, oder? Double Relay"}, {"id": 735, "start": 6439.24, "end": 6452.68, "text": "Switch and Shutter-Roller. Ach Moment, Moment, Moment. Das ist ein doppeltes Relay dafür,"}, {"id": 736, "start": 6452.68, "end": 6461.4, "text": "dass man hoch und runter drücken kann, weil es ja zwei Tasten hat, eine Taste für hoch"}, {"id": 737, "start": 6461.4, "end": 6467.52, "text": "und eine Taste für runter, deswegen brauchst du zwei Relays. Weil ansonsten kannst du das"}, {"id": 738, "start": 6467.52, "end": 6484.04, "text": "ja für jedes X beliebige andere auch verwenden. Das ist tatsächlich eine gute Idee, das da"}, {"id": 739, "start": 6484.04, "end": 6494.12, "text": "einzubauen, finde ich, ist keine schlechte Sache. Aber welche Gurtwickler habt ihr denn,"}, {"id": 740, "start": 6494.12, "end": 6500.2, "text": "im Backstream? Also wie heißen die Dinger denn? Oh, MQTT-Proker, jetzt gehts aber rund"}, {"id": 741, "start": 6500.2, "end": 6511.96, "text": "hier. MQTT erste Schritte. Die haben tatsächlich MQTT-Integration, das hätt ich jetzt net"}, {"id": 742, "start": 6511.96, "end": 6527.76, "text": "gedacht. Das ist aber Massive Big Brain. Wahnsinn. Aber der Shit ist glaub ich übelst"}, {"id": 743, "start": 6527.76, "end": 6547.32, "text": "und teuer, oder? Mac-Adressen-Leak. Okay, wie teuer sind denn die Dinger von den? Zeig"}, {"id": 744, "start": 6547.32, "end": 6558.76, "text": "mal her. Cloud, nein, nein, nein, nix Cloud. POE Kameras, nee POE brauch ich gar net. Innenkameras,"}, {"id": 745, "start": 6558.76, "end": 6571.92, "text": "Außenkameras, zack, bumm. Da ist bestimmt auch noch China-Chinesen Zeug drin. Das sind"}, {"id": 746, "start": 6571.92, "end": 6575.6, "text": "Sachen aus den 80ern, die waren schon bestand, achso. Gut, sollte aber mit jeder anderen"}, {"id": 747, "start": 6575.6, "end": 6582.96, "text": "Schicht auch funktionieren. Das Zeug ist aber ordentlich. Meine Güte, was sind denn das"}, {"id": 748, "start": 6582.96, "end": 6593.68, "text": "für Preise? Eine Kamera für innen für 200€, eine Indoor-Kamera. Sowas krieg ich von den"}, {"id": 749, "start": 6593.68, "end": 6611.56, "text": "China-Chinesen für 30€. Okay, mit ein paar Problemen, aber Alter, 109€, das ist ja..."}, {"id": 750, "start": 6611.56, "end": 6634.12, "text": "Das ist 180€ sind, nee, nee. Also das ist schon echt heftig viel. Boah, the fuck. Alter,"}, {"id": 751, "start": 6634.12, "end": 6643.44, "text": "nee, das geb ich dafür net aus, nee. Wieso nicht D-Link für 30€? Ja, wenn du D-Link,"}, {"id": 752, "start": 6643.44, "end": 6654.96, "text": "also wenn du eine D-Link-Kamera kennst, die den Stream per RTSP liefert, die Pan tilt"}, {"id": 753, "start": 6654.96, "end": 6660.2, "text": "kann und am besten steuerbar ist über irgendeine Web-Schnittstelle ohne offizielle App, dann"}, {"id": 754, "start": 6660.2, "end": 6667.6, "text": "her damit, bin ich der Erste, der sich so ein Ding kauft. Wir gucken jetzt mal Amazon."}, {"id": 755, "start": 6667.6, "end": 6686.04, "text": "Indoor Pan tilt. Eufy, China-Chinesen-Kram. Integration, okay, zeig mal her. Jaro, der"}, {"id": 756, "start": 6686.04, "end": 6692.2, "text": "Jaro-Mart, das hört sich irgendwie fast schon ein bisschen Russisch oder so an. Jaro-Mart."}, {"id": 757, "start": 6692.2, "end": 6702.52, "text": "Jaro-Mart. Also irgendwie klingt das... Was kostet denn ein Jaro-Mart? Jaro-Mart-Eko-Ab,"}, {"id": 758, "start": 6702.52, "end": 6728.8, "text": "das ist wahrscheinlich... Jaro-Mart-Eko, Alter. Geiler Name, das Ding. Jaro-Mart. Eufy ist"}, {"id": 759, "start": 6728.8, "end": 6739.16, "text": "nicht chinesisch, ist von Anker. Anker ist doch China-Kram. Anker ist China-Chinesen-Krampel,"}, {"id": 760, "start": 6739.16, "end": 6753.08, "text": "guck hier. Anker Innovation ist ein China-Chinesen-Hersteller aus Shenzhen. Also im Prinzip das China-Technik-Ding."}, {"id": 761, "start": 6753.08, "end": 6768.2, "text": "Ist es nicht da, wo sie jetzt Nordkoreaner für haben einfliegen lassen, um dort Arbeiten"}, {"id": 762, "start": 6768.2, "end": 6771.2, "text": "zu machen, die lebensgefährlich sind, weil die Chinesen das nicht mehr selbst machen"}, {"id": 763, "start": 6771.2, "end": 6775.16, "text": "wollen? Ich hab letztens irgendwie sowas gelesen, dass die Chinesen sich ein paar Nordkoreaner"}, {"id": 764, "start": 6775.16, "end": 6780.2, "text": "geholt haben, die so verzweifelt waren, weil die Chinesen... Also, dass die jetzt die"}, {"id": 765, "start": 6780.2, "end": 6783.16, "text": "Arbeiten machen, die die Chinesen selbst nicht mehr machen wollen, weil sogar die Chinesen"}, {"id": 766, "start": 6783.16, "end": 6787.16, "text": "die Arbeiten zu gefährlich sind. Da haben sich die Chinesen gedacht, weißt du was?"}, {"id": 767, "start": 6787.16, "end": 6791.84, "text": "Nee, war einfach ein paar Nordkoreaner. Die haben es nötig, die brauchen es. Ah, die"}, {"id": 768, "start": 6791.84, "end": 6814.0, "text": "haben da halt keine Schmerzen mit, ne? Juckt das nicht. Ja, aber siehst du das in China-Kram?"}, {"id": 769, "start": 6814.0, "end": 6823.2, "text": "Na, ich find den immer noch geil. Gekommnet, der Gekommnet-Mart, Alter. Jaromart. Ok, der"}, {"id": 770, "start": 6823.2, "end": 6826.92, "text": "ist vielleicht nicht das schönste, der obendrauf ist. Ich hätt schon gern sowas hier, sowas"}, {"id": 771, "start": 6826.92, "end": 6831.6, "text": "hier in der Richtung. Was, weil wir haben ja da, wir haben ja da die Löcher für in"}, {"id": 772, "start": 6831.6, "end": 6837.92, "text": "der Wand. Ist eigentlich, ist eigentlich eine ziemlich gute Idee, da speicher ich mir mal."}, {"id": 773, "start": 6837.92, "end": 6859.84, "text": "Jaromart. So, guck hier, zum Beispiel so ein TP-Link-Ding. Wäre ich sofort dabei, aber"}, {"id": 774, "start": 6859.84, "end": 6867.88, "text": "wenn das eine dieser Dinger nicht kann, kann das schon mal Pan-Tilt. Kann man das schon"}, {"id": 775, "start": 6867.88, "end": 6875.12, "text": "mal drehen? Wahrscheinlich nicht, oder? Pan-Tilt, ok, steht ganz groß oben da. So, das heißt"}, {"id": 776, "start": 6875.12, "end": 6882.44, "text": "das nächste ist, man kann das nur über die offizielle App steuern. Wir haben bestimmt"}, {"id": 777, "start": 6882.44, "end": 6891.56, "text": "keinen RTSP-Stream, da fängt es schon an. Wie konnte man noch mal Kommentare durchsuchen?"}, {"id": 778, "start": 6891.56, "end": 6910.56, "text": "Das hier, wie kann man ein RTSP-Leistung auf einer Turbo-Kamera machen? Ist das eine Turbo-Kamera?"}, {"id": 779, "start": 6910.56, "end": 6920.04, "text": "Oh, ok. Gut, so, erster Punkt schon mal erfüllt. Nächster Punkt, wie kann ich die Steuerung"}, {"id": 780, "start": 6920.04, "end": 6929.8, "text": "machen? Die Steuerung geht wahrscheinlich nur über die Apps. Ich will es ja nicht über"}, {"id": 781, "start": 6929.8, "end": 6940.32, "text": "die App machen. Ok, RTSP-Stream geht schon mal, das ist gut. Aber wie kann man die Kamera"}, {"id": 782, "start": 6940.32, "end": 6948.52, "text": "machen? Ah, guck mal, man kann die als On-Fif-Kamera hinzufügen. Spricht man doch garantiert nicht"}, {"id": 783, "start": 6948.52, "end": 6960.2, "text": "On-Fif aus, oder? Wie sprecht man das aus? On-Fif. So was wie On-Fif?"}, {"id": 784, "start": 6960.2, "end": 6981.52, "text": "Ok, das probiere ich vielleicht wirklich mal aus. Turbo-Kamera-Hand-Tilt-On-Fif."}, {"id": 785, "start": 6981.52, "end": 7008.0, "text": "Tatsächlich, das sollte funktionieren. Oh, das haben die erst vor einem Monat gepostet."}, {"id": 786, "start": 7008.0, "end": 7031.48, "text": "Das ist Bleeding-Edge-Technologie hier. Turbo-Kamera-Control. Interessant. Ja, finde ich cool, dass es das"}, {"id": 787, "start": 7031.48, "end": 7049.04, "text": "gibt. Vielleicht. Ja, Track-Detect-Movement brauche ich nicht. Dann würde ich sagen,"}, {"id": 788, "start": 7049.04, "end": 7058.12, "text": "dann wird es mal Zeit, dass ich mir eine Turbo-Kamera kaufe, um die auszuprobieren. Easy. Turbo-Firmware."}, {"id": 789, "start": 7058.12, "end": 7068.08, "text": "Haben wir doch schon was gefunden, siehste? Also 37 Euro sind mir lieber als 250. Im Stream,"}, {"id": 790, "start": 7068.08, "end": 7079.2, "text": "wieso soll ich Woop League machen, oder? Das ist eh bei mir, kommt das ins IoT-WLAN, ohne"}, {"id": 791, "start": 7079.2, "end": 7089.24, "text": "dass es irgendwo hin darf. Die wurde storniert ohne Grund. Moment, ich probiere die jetzt"}, {"id": 792, "start": 7089.24, "end": 7118.0, "text": "über die App zu kaufen. App, Smartphone, auf Amazon, Turbo, C-200, C-210. Was ist der"}, {"id": 793, "start": 7118.0, "end": 7128.16, "text": "Unterschied dazwischen? Best Seller, 32 Euro. Warum findet, Alter, warum findet das immer"}, {"id": 794, "start": 7128.16, "end": 7152.88, "text": "was anderes? Was ist denn der Unterschied zwischen Turbo, C-210 und C-200? Was ist denn"}, {"id": 795, "start": 7152.88, "end": 7178.08, "text": "da der Unterschied? Warum steht die Kamera da auf dem Kopf? Die ist älter. Ja gut,"}, {"id": 796, "start": 7178.08, "end": 7188.24, "text": "die hat wahrscheinlich schlechtere Auflösung. Okay, ich will nur, die hat kein Two-Way-Audio."}, {"id": 797, "start": 7208.08, "end": 7227.68, "text": "Okay. Die haben anscheinend Probleme damit. Na gut. Automatische Software-Updates gibt"}, {"id": 798, "start": 7227.68, "end": 7236.12, "text": "es bei mir nicht. Das Ding ist im IoT-WLAN, da ist nichts mit Two-Way-Audio oder sonst"}, {"id": 799, "start": 7236.12, "end": 7245.16, "text": "was. Und das ist, guck dir mal da, da kostet es jetzt die 210,39 Euro und hier kostet"}, {"id": 800, "start": 7245.16, "end": 7253.32, "text": "es 37 Euro. Was zum Teufel, wo ist der? Das erschließt sich mir überhaupt nicht. Oh,"}, {"id": 801, "start": 7253.32, "end": 7261.76, "text": "sind das UK Imports? Gut, UK Imports werden bei mir auch öfters cancelled. Das kenne"}, {"id": 802, "start": 7261.76, "end": 7271.8, "text": "ich. UK Imports, das Problem hatte ich auch schon, dass es nicht richtig funktioniert."}, {"id": 803, "start": 7271.8, "end": 7278.88, "text": "Man kann aber hier unten meistens auf neu und gebraucht gehen, aber anscheinend gibt"}, {"id": 804, "start": 7278.88, "end": 7293.48, "text": "es da nicht. Warte mal, sie gibt es hier mit diesen Button neu und gebraucht. Brexit,"}, {"id": 805, "start": 7293.48, "end": 7299.96, "text": "ja, ich weiß gar nicht, warum die noch drinnen sind. Ich versuche jetzt mal von der App zu"}, {"id": 806, "start": 7299.96, "end": 7317.32, "text": "bestellen, so. I know. Ich habe gebyt. Leute, es ist schwieriger als man denkt. Jetzt wollen"}, {"id": 807, "start": 7317.32, "end": 7327.08, "text": "sie nicht, dass ich was bestelle. So, jetzt gucke ich mal, your orders, your orders, da"}, {"id": 808, "start": 7327.08, "end": 7346.76, "text": "ist er noch drin. Na ja. Schauen wir mal, ob das funktioniert. Ah, geil. Oh, Big Brain"}, {"id": 809, "start": 7346.76, "end": 7353.0, "text": "Chat, Alter, guckt euch mal wieder an. Der Chat ist wirklich, die ganzen Subs haben sich"}, {"id": 810, "start": 7353.0, "end": 7362.16, "text": "gelohnt. Guckt euch das mal an. Jetzt haben wir direkt einen Vergleich. Guck mal, der"}, {"id": 811, "start": 7362.16, "end": 7376.12, "text": "Bildsensor von der Alten ist größer. Ihh, 15 FPS, MonkaS. Na gut, man kann bestimmt"}, {"id": 812, "start": 7376.12, "end": 7388.76, "text": "Low-Quality Stream machen und das ist dann weniger. Die haben auch integrierte Lautsprecher."}, {"id": 813, "start": 7388.76, "end": 7398.8, "text": "Ah, guck mal, die hat doch integriertes Mikrofon. Ansonsten machen die mehr oder weniger eigentlich"}, {"id": 814, "start": 7398.8, "end": 7424.04, "text": "das Gleiche. Das menschliche Auge sieht nur 8 FPS, das stimmt nicht, sind 12. Also ein"}, {"id": 815, "start": 7424.04, "end": 7432.36, "text": "großer Unterschied ist das nicht. Equipa. Hat mal einer von euch was bei Equipa bestellt?"}, {"id": 816, "start": 7432.36, "end": 7446.04, "text": "Ah, hier ist, hier ist Marketplace angesagt. Marketplace, China, Chinesen. Sag mal, gibt"}, {"id": 817, "start": 7446.04, "end": 7450.28, "text": "es nicht noch, ich checke es gerade nicht auf der Amazon-Seite. Es gibt doch normalerweise"}, {"id": 818, "start": 7450.28, "end": 7458.68, "text": "hier einen Knopf. Neu und Gebrauch. Ach hier, Osser, Osser, Osser, Sellers on Amazon sind"}, {"id": 819, "start": 7458.68, "end": 7470.2, "text": "da. Da haben sie es versteckt jetzt, es ist neu. Ok, das ist anscheinend alles nicht pünktlich"}, {"id": 820, "start": 7470.2, "end": 7475.4, "text": "lieferbar hier. Na gut, das würde ich an denen in ihrer Stelle auch so machen, weil wenn"}, {"id": 821, "start": 7475.4, "end": 7484.76, "text": "die Bahn Güterverkehr mäßig streikt, wer weiß wann das ankommt. Oh Leute, ich sehe"}, {"id": 822, "start": 7484.76, "end": 7491.64, "text": "es gerade, guck mal die Uhr. Guck mal auf die Uhr. Ich habe jetzt gar nicht alles, alles"}, {"id": 823, "start": 7491.64, "end": 7510.16, "text": "hier fertig bekommen. Ich habe zu lange geschwätzt. CacWade. Anscheinend braucht man die TP-Link-App"}, {"id": 824, "start": 7510.16, "end": 7514.6, "text": "und einen Account um das Ding in Betrieb zu nehmen. Das ist auch noch so ein Ding. Egal,"}, {"id": 825, "start": 7514.6, "end": 7530.0, "text": "IoT-Netzwerk regelt."}, {"id": 826, "start": 7530.0, "end": 7556.04, "text": "Ja, aus irgendwelchen Gründen haben die ja mein Outro Song gelöscht. Also Leute, wir"}, {"id": 827, "start": 7556.04, "end": 7572.44, "text": "sehen uns. Bis denn. Bis zum nächsten Stream. Macht's gut, bis denn. Betge-Time. Huge Betge,"}, {"id": 828, "start": 7572.44, "end": 7600.96, "text": "huge sleep, massive dream. Bis denn, macht's gut."}]}