{"text": "Fuck, ja ich bin noch ein bisschen früher als sonst. Aber ich glaub mir, man kann's überleben. So, jetzt müssen wir erstmal gucken, bis Twitch gecheckt hat, dass der Stream online ist. Dauert ja manchmal undefinierte Zeit. Weiß nicht so genau. In dem Fall muss ich mal gucken, ob ich wieder irgendwelche komischen Scam-Mails gekriegt hab. Ne, sieht nicht so aus. Außer irgendwelche komischen VPN-Anbieter, die wir da geschrieben haben, null. Alter, die können's nicht sein lassen, ne. VPN-Anbieter, die schießen echt wie so eine Pilze aus dem Boden, das gehört gar nicht mehr auf. Vergeht keine Woche, gibt's neuen VPN-Anbieter. Null. Ey, sag mal, ist mein Chat irgendwie kaputt? Die Leute schreiben doch schon... Hä? Hab ich die letztens gehostet oder was hab ich hier für einen Chat auf? Weiß ich gar nicht mehr. Falscher Chat, alter. Null. Hier hab ich glaube ich das letzte Mal weitergeleitet. Oder so, keine Ahnung. Weiß nicht. Glaub schon, ja, genau, genau. Deswegen war der Chat noch auf. Leute, danke für die Subs, wir nehmen hier alles am Start. Hab ich gesehen, der CLI-Jumper ist da fünf Monate, halb zehn Monate am Start. Es kommt ja manchmal so um die Ecke mit 17 Monaten, das ist ja mässig, Viper-Subscription hier. Ich wiege gerade da ja alles am Start, denn manche Twitch-User haben immer noch die besten zwei Monate am Start. Alles. Was? Schon wählen? Manche fragen ab wann kann man denn wählen gehen, aber anscheinend kann man das schon. Ganz einfach abgesehen, ich muss gar nicht mehr wählen gehen, weil ich war schon wählen, ich hab per Briefwahl gewählt sort. Weiß nicht, hat jemand von euch auch Briefwahl beantragt? Ich hab gerade dieses Jahr gar keinen Bock gehabt dahin zu gehen und ich könnte mir vorstellen ich werde das auch nach wie vor weitermachen, weil Briefwahl ist einfach nice, du musst halt nix machen, du sagst willst du Briefwahl haben, dann kriegst du deine Unterlagen zugeschickt. Ich bin da auch nur drauf gekommen, weil irgendwas bei uns, irgendwas regionales, oder kommunal ist, was das glaube ich gewesen ist, da hab ich auch per Briefwahl gewählt, da hab ich mir gedacht, hey, warum machst du das jetzt nicht wieder, da war eine 69 Zuschauer, gachi BuzzTime. Erstmal ein Briefwahl gemacht, ja alles. Ja, ich glaube auch, dass ganz viele, flow the game, 5 Monate, dankeschön für den Sub. Ich glaube es haben dieses Mal wirklich viele Leute Briefwahl gemacht, richtig viele, aber ich glaube es ist ja bei uns nicht so wie bei den Amis, bei den Amis ist es ja irgendwie so, dass du Briefwahl noch, frag mich nicht, eine Woche oder so länger auszählst als bei der Wahl, also nicht am Tag selbst und ich glaube bei uns ist es ja so, weil ich mir da nicht ganz sicher bin, bei uns ist es ja so, die Briefe müssen bis spätestens 18 Uhr beim jeweiligen, ja was ist denn das dann, bei uns ist es im Rathaus, aber auch immer abgegeben werden. Und ich glaube die zählen das ja alles heute aus, oder gibt es bei uns auch noch irgendwie so Nachzüglerkram. Bei den Amis war es ja letztes Mal total wir, das sah ja erst so aus, als hat Trump gewonnen und dann kam Briefwahl, Stellz, und dann hat er beiden voll aufgeholt. Alter, die Musik, ja mach das, mach das, natürlich auf laut, dass alle was von mitkriegen. Ne, aber ich habe schon, ich habe ja bei Briefwahl schon gewählt vor 5 Tagen oder so, ich habe das glaube Dienstag oder so abgeschickt und deswegen ist das bei mir auf jeden Fall alles pünktlich da. Ja, das war die Amitaktik so nach dem Motto, oh nein ich bin ja am verlieren, ne, ne, Brieffall zählt nicht mehr, hat aber da auch nicht funktioniert. Wobei ich weiß ich bei den Amis auch nicht so ganz verstanden habe, als Trump schon nicht mehr Präsident war, wollten sie ihn ja irgendwie des Amtes entheben, das hat sich bei mir auch nicht ganz entschlossen, wie kannst du denn jemanden des Amtes entheben, aber das ist vielleicht einfach Kokona-Things, die ich nicht verstehe, ja, wie kann man jemanden des Amtes entheben, der überhaupt dieses Amt nicht mehr hat, das habe ich nicht so genau kapiert, aber dann haben ja auch am Ende nicht funktioniert, vielleicht wollten sie nicht, dass man ihn jemals wieder wählen kann oder so, ach was weiß ich, Kokona-Style, was auch immer da abgeht. Die Amis, ahja, das dachte ich mir, das dachte ich mir, aber das hat ja nicht funktioniert. Jaja, aber der Kram lief doch noch weiter, als da schon gar nicht mehr Präsident war. Ach, was weiß ich, eigentlich ist mir wurscht, was die Amis so treiben. Was mich viel mehr interessiert, wie es mit, Moment, ich zeige euch das gerade mal, wie es mit Zoll bei AliExpress, nein nicht Alisweidel, wie es bei AliExpress, wie kommt er bei Ali auf Alisweidel, Alter, Ali, ich wippe bei Ali auch immer an Alisweidel denke, aber gut, logisch, aber ich wollte eigentlich, ja, das, also ich habe ja zum ersten Mal bei AliExpress bestellt, seit die Zollanpassungen sind, also dass du theoretisch mehrmals teuer Zoll und Geschäfts bezahlen musst und wisst ihr was Leute, dreimal dürft ihr raten, gab es Probleme mit AliExpress Versand und Zoll, nein, oder ja, oder bisschen, was meint ihr, also ich habe bestellt zwei Stück hiervon und ich glaube 25cm, also irgendwie, ich habe die bestellt, aber 20cm, irgendwie sowas, also ich habe glaube ich irgendwie für knapp 70€ oder so bestellt, nein, es gab überhaupt keine Probleme, Hausnummer liegt, oh ja, fuck, ich habe hier rumgeklickt, nein, Hausnummer liegt, es gab überhaupt keine Probleme, das ist LED Hausnummer, ja, aber ich werde das nicht so machen, ich habe euch das Video ja schon öfters gezeigt, mein Ziel, mein Ziel ist ja, dass ich sowas hier machen kann, ich mache dann Custom LEDs, Drip rein, 144 LEDs auf den Meter, also sowas hier hole ich mir dann, LED, WS, ne, ne, ne, SK, die da sind das glaube ich die mit weiß, das ist RGBW, falls ihr jemals was mit RGB macht und einen ordentlichen Weißton wollt, ich kann euch nur empfehlen, gebt das extra Geld aus und nehmt RGBW Strips, RGB ist klar, aber W, die haben noch zusätzlich weiße LED, das heißt ihr könnt nicht weiß mischen mit RGB, sondern ihr habt wirklich weiß und ihr könnt sogar je nachdem den Farbton euch aussuchen von dem weiß, das ist viel besser, also ich hab schon erlebt, dass RGB Strips, wenn du die auf weiß stellst, dass die so pläulich sind oder je nachdem was da überwiegt, also RGBW Beste, ja und dann würde ich mir hier so einen RGBW Strip holen, wo dann wirklich 144 sind, ja IP30 reicht, die sind ja im Gehäuse, gibt es gerade nicht, gibt es gerade nicht zu kaufen, 144 LEDs, Meter, RGBW, größer Keg W, LULW, wenn schon, weil LULW ist eh das beste Lach-Emote, also LULW, alter, ich hab immer noch ein bisschen Hals-Ace, Wahnsinn, letzte Woche hatte ich übeles Hals-W, aber ihr habt ja schon im Stream gehört, als es angefangen hat, eh immer noch Corona, genau, Dauer-Corona, ich hab, ich hab 24 Corona, Endless-Corona, also Covid-4K, das ist schon, das ist schon quasi nach HD, ich hab schon, ich hab schon das ganz neue, Ultra-Hi-Res, ja so war es da, so war es da, brauche ich, genau, also Black ist jetzt irgendwie nicht, ne, der Strip ist nicht Black, der Strip ist eindeutig White, ja und hier kann man einstellen, wie die Farbe von dem Weiß sein soll, also RGBW, gut ist ja auch, ist ja auch, so soll dann, so soll dann meine Hausnummer aussehen, wenn das funktioniert, so und ich hab das bei AliExpress bestellt, kam an, mit DHL geliefert, ohne jegliche Probleme, keinerlei Zoll-Geschichten, nix, also, die China-Chinesen haben es wieder geschafft, scheiß drauf, dass es irgendwelche neuen Zoll-Regelungen oder sonst was gibt, juckt die einfach nicht, 5G plus 5G ist 10G Corona, daran hab ich noch gar nicht gedacht, da müsste man mal bill Gates fragen, ob man das überhaupt so rechnen kann, der weiß das bestimmt, wenn Bill Gates jetzt nicht Atomkraftwerke bauen, hab ich irgendwo so die Überschrift gelesen, aber hab keine Details zu angeguckt, irgendwas hab ich gelesen, ja also wie gesagt überhaupt kein Ding bestellt, China-Chinesen-Shopping, alles am Start und ohne Probleme, wieder schon so lange, ich hab das jetzt nicht so verfolgt, übrigens wisst ihr mit wem ich gestern ein Video aufgenommen hab, wie hieß denn das Video, irgendwie so hieß das Video glaube ich, das da, wisst ihr mit wem ich gestern ein Video aufgenommen hab, korrekt, korrekt, wir haben 35 Minuten geschwätzt, ich werd das ein bisschen schneiden, ein bisschen kürzer schneiden, doch, er hat es bei mir gemeldet im Discord und wir haben ein bisschen so gelabert was so gewesen ist und was er jetzt, nachdem er da quasi nicht bei uns übernommen wurde, was er gemacht hat und sowas, ich muss jetzt aber erst noch mal schneiden, ich werd das Video, kommt dann wahrscheinlich so Montag, Dienstag oder Mittwoch mal gucken, ich muss unbedingt was hochladen, ich hab schon 10 Tage nichts mal hochgeladen, immer noch Dauer, Corona hier, ja, nice, da brauch ich aber einen guten Titel für, irgendwie sowas wie ex Azubi packt aus oder irgendwie sowas, weiß ja nicht genau wie, ach jetzt wo ich grad dabei bin, hat die GameStar eigentlich mittlerweile eine Bewertung für das Diablo Remake, was ist neu, Tests, haben die sowas, Diablo, 82, ach okay, hab immer gespannt, Test lesen, alter, geht dann halt nicht, ich kauf mir jetzt kein GameStar Plus, Azubi redet Klartext in Caps, ach das ist beides gute Ideen, finde ich nice, ja wenn die dafür was haben wollen, hab ich jetzt keinen Bock das zu kaufen, ja, weil, was hältst du mittlerweile von New World, da ist doch, ist da nicht jetzt Release morgen oder heute oder so sogar, nee übermorgen, Dienstag, Dienstag ist Release, ganz ehrlich, ich bin mal gespannt ob sie die Kurve kriegen, also ich hab, ich persönlich glaube ja nach wie vor, also ich muss, da muss ich jetzt grad so ein bisschen aussuchen, also ich hab ja mal vor einer ganzen Weile im Stream gesagt, du weißt wo es den Clickbait Helfer gibt, ja naja lass dich ruhig aus, ich hab mal vor einer ganzen Weile im Stream gesagt, das ist das einzige MMO den ich irgendwas zutraue so an neuen Releases, aber das war lange lange her, noch bevor sie quasi versucht haben auf jeder Hochzeit zu tanzen mit diesem Spiel, von Open World PvP bis PvP Schlachten bis Solo Questing, Group Questing, Group PvM Content, Group Raids, Group Dungeons, Housing, Player Build, Economy, also die wollen ja alles mittlerweile machen bei New World, so und da hab ich halt jetzt meine Zweifel, dass es funktioniert, weil Spiele die alles machen wollen, machen im Prinzip nix richtig, meistens, mag Ausnahmen geben, aber meistens, so und außerdem muss ich dazu sagen, dass ich finde, das ist jetzt so eine subjektive Sache, ich hab ja auch die Beta nicht so ultra lange gegrindet, aber, dass die Charaktere und die Welt überhaupt nicht zusammen passen, die Welt an sich finde ich ganz ok, auch wenn ich dieses Pirates Wild Wests Kolonial Setting jetzt nicht so geil finde, aber die Charaktere passen teilweise überhaupt nicht rein, ich frag mich eh, was ist das für ne Mischung, das hab ich bis heute nicht verstanden, entweder machst du so nen Fantasy Mittelalter MMO, aber da kannst du keine Musketen und so rein packen, das ist so ne ganz komische Mischung, ich finde einfach, dass Heilshauber, also Damage Zauber, Heilshauber, Schwerter, Musketen, Gewehre, das passt nicht zusammen, ich, das mag ja Gameplay technisch eventuell irgendwie nochmal zusammenführen, aber ich find das passt nicht zusammen, die machen natürlich mit New World auch ein paar ganz gute Sachen, dass es zum ersten Mal seit langem wieder ein MMO ist, was wirklich auf Group Content bzw. auf Player Interaction in irgendeiner Art und Weise basiert, ja, du musst ja total viel, du musst traden mit den Leuten zum Beispiel, du musst Quests dann zusammen machen, einer muss zum Board rennen und so was, das ist mehr Player orientiert als anonymer Dungeon Finder oder wir questen die ganze Zeit solo oder sowas, das find ich an sich gut, aber ich glaube das passt nicht und auch wenn ich dir am Anfang was zugetraut hab, ich glaube das Game wird, spätestens wenn die ganzen Streamer, ne ich kaufs mir nicht, spätestens wenn die ganzen Streamer abspringen, was relativ denke ich mal, also die größeren, relativ schnell passieren wird, werden auch die ganzen anderen Leute leaven, man muss ihn aber zugute halten, also was ich da wirklich cool finde, die hören ja schon ein bisschen auf die Leute. Nettles, du hast doch nur 5 Minuten gespielt, ja 5 Minuten gespielt, dann hast du nie wieder eingeloggt, oder? Du hast auch gar nichts mitgekriegt, oder gut vielleicht hast du ja danach noch gespielt, ich hab, war nicht dabei, kann ja sein, was wollte ich jetzt sagen, ja also die Streamer werden abspringen, da werden auch die ganzen Leute abspringen, aber die hören ja schon ein bisschen so auf die Community, zum Beispiel, dass es ja wohl Language Server geben wird, das ist ne Sache, die fehlt mir bei vielen MMOs oder dass es zumindest Server geben wird, die nen Language Tag dran haben, also du kannst natürlich schon als Franzose auf dem deutschsprachigen Server spielen umgedreht, aber es stehen Language Tags dran, das find ich cool, das fehlt mir bei ganz vielen MMOs, weil ich hab einige MMOs gespielt, auch gerade mit Famiya zusammen, internationale Server sind nicht verkehrt, das hat den Vorteil, du musst nicht so früh Server merken, du hast keine Sprachprobleme, du kannst alles immer auf Englisch machen, das ist schon nicht verkehrt, aber ganz ehrlich, ich fühle mich auf nem internationalen Server nicht so richtig heimisch wie auf nem deutschsprachigen Server, es ist einfach, also als Native Speaker, weiß ich nicht, wie soll ich das erklären, so dieses ganze, während du questest, während du Monster killst, so ein bisschen nebenbei chatten, das geht einfach einfacher und besser flüssiger von der Hand, wenn das auf Deutsch ist, zumal man auch nicht vergessen darf, dass, oh das können wir tatsächlich mal ne Umfrage machen, das ist ne gute Umfrage, ich mach mal, ich mach mal eine, warte mal, wir machen jetzt wirklich mal ne Umfrage, wird New World ein Erfolg? Ah nein, wir können keine Prediction machen, weil Predictions, ist schwierig für so Digger jetzt, so, mal umfragen, bin immer gespannt was ihr sagt, also ich hab jetzt nicht mehr Halsweh, aber ich hab immer noch, wir hätten auch noch ne dritte Antwort, was juckt's mich, wobei es in dem Fall eigentlich blöd ist, weil dann müsste ich auch sagen, was juckt's mich, ich werd's erstmal nicht spielen, also ich geh davon aus, ich warte mal bis es zur Hälfte durch ist, ja, das glaub ich nämlich auch nicht, also, ja, das ist jetzt halt dem Nächsten und mal gucken, das ist ja schlimm, voll am verrecken hier, das ist mega ungesund an, ich weiß, aber ich hab nix, nützt kein Corona, ich hab ja extra Corona-Tests gemacht auch vor ein paar Tagen, sowas wird in die Nase stecken, GSTW, ich war schon wählen, ich hab Brief gewählt, ja, ich bin auch geimpft, ich bin doppelt geimpft, das ist schon ein paar Wochen her und ich hab einen Corona-Test gemacht, also ich habe, auch wenn sie vielleicht so anhört, definitiv kein Corona, ich hab mich nicht impfen lassen, um sympathisch zu sein, ich hab mich impfen lassen, dass ich nicht sterbe, aber ja, ich versteh gar nicht dieses ewig rumdiskutieren bei dem Geimpfen, so nach dem Motto, ich lass mich für die Allgemeinheit impfen, bla bla bla, die können mich alle mal, die Allgemeinheit kann mich, ich hab mich einfach nur impfen lassen, dass ich nicht sterbe, ist das zu wenig Anreiz oder was? Einfach, einfach, don't die, easy, easy win, oh nice, Trimmy Z10 Pro, hat schon mal richtig, hat schon mal richtig Porras Namen das Ding, kostet was, Bots 10, ja, Customfirmer, GitHub, gleich mal gucken, Jithub, wirklich schlimmer, so, also, New World, der Chat ist da bei mir ungefähr, wir runden mal ein bisschen auf, ein Drittel sagt, ein Viertel sagt, ja, wird wahrscheinlich, drei Viertel sagen, ne, wahrscheinlich nicht, ich glaube es ist tatsächlich, die Wahrheit liegt irgendwo in der Mitte, ich glaube nicht, dass Amazon relativ schnell New World einstellt, man darf nicht vergessen, Amazon hat nichts auf die Reihe, also Amazon hat nichts geschissen bekommen bisher, wie hieß das, wie hieß dieser Overwatch Crucible, dieser Overwatch, äh, war nicht mal Overwatch abklatscht, dieser Overwatch MOBA-Verschnitt, in seiner Versuchtheit zum Overwatch Crucible, das hat sie noch nicht mal, noch nicht mal irgendwie zu einem Release geschafft, vorbei, so, und ihre andere Deserter Ringe MMO haben sie eingestellt, das ist das einzige, was sie haben, und ich glaube, die werden weiterhin Geld reinpumpen und auch, äh, durchaus, Spieler erreichen damit, glaube ich, glaube ich, aber New World, auch wenn sie sich das vielleicht erhoffen, wird definitiv nicht das nächste Millionen-Subscription-MMO werden, glaube ich nicht, ich glaube, das wird schon seine Spieler-Base halten, also ab einem gewissen Zeitpunkt, am Anfang wird es natürlich erstmal krass fallen, so wie das immer ist, zu Release, spiel immer die Meister und fällt das erstmal, außer, außer du bist World of Warcraft und machst quasi, erfindest quasi so eine eigene Welt, ähm, neu für dich, eigene, eigene Spielekategorie, weil ich nicht sagen will, dass World of Warcraft MMOs erfunden hat, das weiß ich, glaube ich, am besten, ich war schon pre-World of Warcraft MMOs am Start, aber für viele haben MMOs halt quasi mit WoW gestartet und bei WoW war es halt so, die haben angefangen, schon mit gutem Hype, hatten viele Spieler, dann ist es vielleicht ein bisschen runtergegangen, aber dann ist es einfach, es ist konstant, drei, vier Jahre ist das, BÄM, bis 11 Millionen draufgegangen, das werden wir, glaube ich, so schnell bei einem MMO auch nicht mehr sehen, oder 15 Millionen, sogar, ich weiß gar nicht, was Spitzen-Subscriptions in World of Warcraft waren, keine Ahnung. Ja, zumindest, ich glaube, das Game wird weiter existieren, es wird fallen und dann wird es auf einer relativ guten, ähm, ja, weiß ich nicht, ob das eine gute Basis für die ist, aber ich denke mal, auf einer ganz, ganz brauchbaren Spieler-Basis hängen bleiben. Die ganzen Kacknoobs auf Twitter, die werden instant-leaven, weil das, was ich von New World bisher mitgekriegt habe, ist, dass es kein Babysitter MMO ist und die ganzen Kacknoobs auf Twitter, die wollen Babysitter MMOs spielen, die spielen sowas wie ESO, wo du Solo-Questen kannst und alles im Easy-Mode erledigen und sobald du quasi mal groupen musst für irgendwie einen Dungeon, sind sie am rumheulen, so nach dem Motto, oh mein Gott, ich arbeite doch am Tag zwölf Stunden, ich kann doch nicht abends noch zwei Stunden gruppen suchen, das ist so casual, feindlich, lull, your game sucks, ja, das, ich glaube, die werden in New World nicht glücklich, das habe ich soweit, das habe ich soweit schon in der Beta mitgekriegt, dass es eben ein Spiel ist, was ersten Spieler-Interaktion fördert und nicht so sehr Babysitter MMO ist. Ja, da gehe ich mal voraus, joa, ähm, ansonsten, ja, es ist halt, also, ich meine, ich meine, ich, man kann sich, ich muss jetzt noch was sagen, man kann sich da jetzt drüber streiten, ob das im Jahr 2021 noch für ein Game gut ist, wenn du zwei Stunden Gruppen bauen musst, aber, ich denke mal, mit einem Spiel, was wirklich Player-Interaktion und nicht anonymes Dungeon-Finden oben anstellt, da werden sich relativ schnell auch die Leute zusammen finden, die gut zusammen spielen können, die was taugen, also du wirst sofort erkennen, wer sind die Kacknoobs, mit denen willst du nicht spielen, wer sind die guten Leute, mit denen willst du spielen und dann hast du relativ schnell Groups zusammen und es wird wie immer so sein, die 0815 Casual Noobs brauchen halt für alles zwei Monate und die guten Leute finden sich in irgendwelchen Groups, Guilden, Discords, wie auch immer zusammen und spielen das Spiel in zwei Wochen durch, es wird so sein wie immer und die einzige Chance als Kacknoob in so eine Pro-Gilde, Pro-Progress-Leute zu kommen ist, wenn du sagst, ich bin ein Gamer-E-Grill und verschicke, keine Ahnung, Fotos oder so und dann sagen alle, oh ja, du kannst bei uns mit trainen, kein Problem, ja wir haben heute, wir haben eh einen freien Slot, willst du dich bei uns in der Gruppe mitmachen, das funktioniert, aber als normaler Casual-Spieler hast du dann da keine Chance und so ist es in MMOs halt, was meint ihr, wie viele Leute es gab, die sich in allen MMOs in Startgebiet gestellt haben, haben sich den weiblichen Charakter gemacht und haben dann im Chat rumgeschrieben, hihi, hallo, hallo Leute, hihi, ich bin ein Mädchen, ich hab grad das MMO angefangen, wie fange ich denn jetzt am besten an, hihi, kann mir irgendjemand das Spiel zeigen und instant 50 Leute drum herum, ah ich geb dir Startgear, ich geb dir Startgear, ah hier komm mal, kriegst du mal 5 Gold, gehst du zum Händler, kaufst du das, was ich kann nicht übrigens ziehen auf Level 50, gar kein Problem, ja, so ist das, hihi, genau hier, hihi, so ist das gewesen und so ist das immer noch in MMOs, ja, ist halt einfach so, so und ich glaube, dass New World dementsprechend diese Leute schon erreichen wird, aber was wovon ich nicht ausgehe, ist, dass die ganzen Noob, geh mal doch mal hier Noob, ich bin jetzt grad so ein bisschen im uplaster Modus, aber das müssen wir jetzt mal, New World, EU, ne, ach wie heißt denn dieser deutsche New World Account auf Twitter, Twitter, New World, Europe, Germany, hier, ist doch, da ist er, hier, Play New World, ah nein, das ist auf, was zum Teufel, warum ist das hier auf Deutsch und auf Englisch, hier New World de, da ist es doch, hey in MMOs, das ist was, was natürlich in keiner Reportage dran kommt, ja, aber in MMOs, wenn man, wenn man damit klar kommt, dass man permanent 200 notgeile Kerle hinter sich herrennt, hat, kann man das in MMOs glaube ich so krass ausnutzen wie in keinem anderen Spielegenre, du musst ja noch nicht mal eine Frau sein, du musst ja einfach nur so tun, als bist du eine Frau und dich ins Startgebiet stellen und sagen, hihi ich weiß nicht wie das Spiel geht, kann mir das jemand zeigen, du hast instant 200 Leute am Start, das war schon immer so in MMOs, das wird schon immer so sein, so und ja, wenn man hier mal so durchscrollt auf Twitter, so die, so die ganzen Casual Noobs, keine Ahnung ob das alles Casual Noobs sind, ich weiß nicht, ich will jetzt die Leute nicht so sehr flamen vielleicht, sie sind wahrscheinlich weniger Noobs als ich in dem Game, weil ich hab da überhaupt keine Ahnung von, zumindest was ich bei MMOs halt immer lustig finde, gerade wenn sie, oder was ich bei Spielen immer lustig finde, so, so, gerade wenn sie Streamer, Streamer Events machen und das werden sie, das haben sie ja bei New World gemacht und das werden sie wahrscheinlich bei New World auch wieder machen, Streamer, weiß nicht ob das, ob da wieder was, was kommt in der Richtung, also sollten die, sollten die wieder Streamer Events machen, dann kann ich jedem nur empfehlen, geht, wenn ihr wollt auf einen Streaming, auf einen Server von, von Streamern, aber geht bloß nicht in die gleiche Fraktion von Streamern, du hast einfach so viele Casual Noob Fanboys, das ist der Wahnsinn, also je nachdem, man muss gucken was es für ein Streamer ist, wenn es irgendwelche MMO Streamer sind oder so, was weiß ich, wenn ihr, wenn ihr um Asmongold als 200 Spieler Traube rumstehen wollt und auf jeden Schritt hinterher rennen wollt, ja meinetwegen macht's, aber wenn ihr sinnvolle Brokers machen wollt in einem Game, dann geht nichts in die Spielerfraktion, äh in die Streamerfraktion, die Streamerfraktion ist voller Casual Kacknoobs, die Streamerfraktion ist voller nerviger Fanboys und Leuten, die spielen können, das ist einfach so, was auf Streamer Sonne, was für ein Ding, Streamer Sonne, achso, Streamers on new, achso, nicht Streamer Sonne, lul, ja verstehe, ja und es ist so, und man hat's ja auch gesehen, was, dreimal dürft ihr raten, was meint ihr, also in New World gibt's ja drei Fraktionen, die PvP und eroberungsmäßig nebeneinander spielen, was meint ihr, welche Fraktion hat auf dem Streamer Server in der Beta am schlechtesten abgeschnitten, es gab zur Auswahl deutsche Streamer und deutsche Fanboys, äh Pro Gamer Franzosen und die dritten hab ich vergessen, was meint ihr wer gewonnen hat oder was meint ihr, wer mit Abstand auf dem letzten Platz war, genau, mit Abstand auf dem letzten Platz in der Beta, mit Abstand, mit so Leuten kannst du nicht spielen, ich sag nicht die Streamer, mit den Fanboys kannst du nicht spielen, mit den meisten Streamern, die verdienen ja ihr Geld mit Spielen, die sind in der Regel sowas, wenn sie öfters MMO spielen, gar nicht mal so schlecht, die Franzosen haben gewonnen und wisst ihr warum die Franzosen gewonnen haben, soweit ich das verfolgt hab bei New World, die Franzosen haben gewonnen, ähm, weil sie Theorie gecraftet haben, ein Skill, der sämtlichen Noob Fanboys komplett fremd ist, die gehen in das Game, gucken ihre Lieblingsstreamer und machen dann alles so nach wie das Streamer, der Streamer hat bloß in der Regel auch überhaupt keine Ahnung, was er macht, wenn du in einem MMO am Anfang gut starten willst, musst du zwei Dinger machen, du musst am besten die Beta gespielt haben vorher und das zweite ist, wenn du die Beta nicht gespielt hast, selbst wenn du die Beta gespielt hast, du musst Patch Notes verfolgen und du musst Theorie craften as fuck, du musst zwei Wochen vor Release, du musst dir jegliche Patch Notes durchlesen, die neu kommen, du musst dir genau angucken, was haben Leute rausgefunden, was ist da wie irgendwie am schnellsten, was sind die OP Skill Kombis, was sind die OP Level Spot und dann musst du einfach 24, das auch, wenn das Spiel rauskommt, du musst 24-7 grinden und den OP Shit machen, dann bist du vorne, was meint ihr, wie das die auch die ganzen erfolgreichen Streamer machen, na gut, die werden ein bisschen gecarried, aber die ganzen erfolgreichen MMO Spieler oder sei es Leak Starter in Path of Exile, die machen das so, die haben Ahnung von dem Game, dass bei MMOs das, was bei Shootern, hauptsächlich mal Mechanics von Aiming ist und natürlich auch so ein bisschen Map Knowledge und sonst was, das gibt es ja in MMO in der Art und Weise nicht, in MMOs Game Knowledge ist das mit Abstand wichtigste, wer keine Ahnung hat von dem Game, kann viel grinden und es bringt ihm nichts, du musst in MMOs, du musst Ahnung haben vom Game, du musst wissen, wo die OP Spots sind, du musst wissen, wie du irgendwie irgendwelche Quests klitscht oder so, übertrieben gesagt und dann musst du 24-7 OP Shit grinden, am besten, dass du durch den Content bist, bevor sie es patchen, weil meistens patchen sie das, wenn irgendwas kaputt ist und genauso haben es übrigens die Franzosen auch gemacht in der New World Alpha, Beta, wie auch immer das war, die haben das, wie ist das in New World, dieses Quest Board total Abused, die haben einfach ihre Top Level Leute an das Quest Board gestellt und hatten irgendwie halb Frankreich, die in New World für sie rumgerannt sind und Quests erledigt haben und die Leute sind ans Quest Board und haben es abgegeben, also die Typen standen eigentlich nur den ganzen Tag am Quest Board in der Stadt und haben Quests abgegeben, die andere Leute für sie in der Welt erledigt haben, eigentlich Big Brain, das haben sie dann gepatcht und was war, die deutschen Streamer Fanboy Fraktion, die hat es erst gecheckt, dass man dieses Quest Board ausnutzen kann, als es schon wieder gepatcht war, Pech gehabt, so gewinnst du in MMOs nicht, ja aber ich werde es trotzdem nicht spielen, ich werde es wahrscheinlich ein bisschen am Rande beobachten und ich gehe ziemlich sicher aus, dass ich richtig liege, die deutschen Streamer Fraktion wird übrigens abkacken, nicht, obwohl gesagt, nicht wegen den Streamern, an denen liegt es gar nicht, das liegt an den unfähigen Leuten, die quasi dann dazu kommen, ja gut, genug abgelästert über deutsche Streamer Fanboys und New World und Zeug, hat jemand von euch Ahnung von der Heizung, weiß jemand, wie man Heizkennlinien richtig einstellt, meine Heizung wird nämlich zu heiß mit dieser Außentemperatur, ich glaube da ist irgendwas blöd eingestellt und ich habe erfahren, wo ist jetzt die Heizkennlinie muss man einstellen, dunkles Design Google haben wir doch schon längst, die Heizungsboys genau, also ich weiß, wie es geht, ich bin aber nicht ganz sicher, was ich da standardmäßig einstellen soll, na gut, dann gucken wir mal was, wir gucken, ja, wie gesagt, wie geht es so, wie man das an der Heizung einstellt, angeschlossen ist, funktioniert, tut es auch, ich gehe davon aus, die Heizung wird einfach zu warm, weil Pumpe und so funktioniert alles, Heizungen werden auch warm, Fack dein Schornsteinfeger, Lul, Schornsteinfeger hat davon auch keine Ahnung, der Schornsteinfeger, der kommt einmal, fragt mich nicht, alle zwei Jahre, guckt auf irgendwelche Dinger im Keller und dann geht er wieder, weiß nicht, was der macht, Schornsteinfeger kann sein, das glaube ich auch Lizenz zum Geld drucken, ja, richtige Monkastier Musik hier, oh ne, den darf ich hier nicht einblenden, das sieht ja aus, als würde Monkastier fast Schicko überfahren, Moment, Moment, das müssen wir umpositionieren, so, ok, also was können wir uns denn heute mal angucken, YouTube Refresh, vielleicht haben wir ja Glück und es kommt noch irgendwas Gescheites, wo ich sagen muss, jawoll, das müssen wir gucken, Redis in 100 Sekunden, nope, no pass, Fake News, das Sonic Colors Desaster, wusste ich gar nicht, dass das so schlecht ist, kam Sonic Colors nicht sogar ganz gut an oder ist das jetzt neu, oder bringe ich das durcheinander, was, Sonic Colors nicht das Fan, das Fan Sonic, was dann, was sie dann gekauft haben und gesagt haben, wir bringen das selbst raus, oder bringe ich, ach keine Ahnung, erstmal jetzt zur Wahlurne, ja ich hab schon, ich hab schon Briefwahl, der Markt regelt das, ne ist ja wieder nur Müll dabei, bloß ich muss mal kurz Katzenvideo gucken, die sieht ein bisschen aus wie meine erste Katz, nicht ganz so weiß, ein bisschen größer aber, och ja, ein feiner, oder feine, das erkennt man ja nicht unbedingt, jetzt will er nicht mehr, auf Kommando, auf Kommando will man nicht, ne ne, ok, so, gucken wir uns mal irgendwas an, was haben wir hier, wir lassen uns vor Level Cap jebaiten, wir lassen uns vor Level Cap jebaiten, auf gehts, der tägliche Level Cap jebait, ja das ist ja nichts neues, ist, ist das, ist das, Intel ist back on top, da hab ich so meine Zweifel, wer ist da gesponsert von Intel, oder, oder, Intel hat was rausgebracht, was 5000 Euro kostet und ist jetzt on top, ah immer noch, ok, sowas, sowas dauert ja auch ne ganze Weile, das muss ja, gerade wenn das was von der Regierung ist, ich glaube gerade so Prozesse dauert ewig, ja Disclosure, was, was hätte Blizzard denn da bitteschön Disclosen sollen, hätten die sagen sollen, achja, übrigens bei uns werden systematisch Mitarbeiter belästigt, was ist, als würde Blizzard sowas Disclosen sein, Alter, ja haben sie recht, das ist, das ist, das ist, das ist ederwitz, ne, das erste was Blizzard gemacht hat ist, ehm, irgendeinen, irgendeinen komischen Anwaltkanzlei zu, zu engagieren, die erstmal dafür sorgt, dass da möglichst wenig an, an die, ans Licht kommt, ist halt, naja gut, aber gut, was wird man denn anders erwarten, also, es ist, es ist leider, leider überall so, das, es wird, egal wie offensichtlich es ist, es wird erstmal abgestritten, guckt euch das mal an, es ist egal, ob jetzt irgendwelche, eh, von Maskenaffäre bis, bis, was, was hatten wir denn sonst noch für Dinger in letzter Zeit, ja, Abgas, Skandal, was auch immer, ist eigentlich wurscht, es wird immer gesagt, es wird immer gesagt, nein, nein, da ist überhaupt nichts dran, das kann, kann nicht sein, nein, niemals, niemals, sowas, sowas gibt es bei uns nicht, nein, nein, nein, nein, nein, das ist nicht so, so, da kommt raus, oh fuck, das ist doch so, ehm, dann wird gesagt, ehm, doch, da werden wir jetzt aber ganz entschieden dagegen vorgehen, das kann ja nicht angehen, dass das ist, aber ich wusste davon nichts, aber ich, ich wusste davon nichts, kommt dann immer, ich, nein, nein, nein, nein, ich wusste davon nichts und als nächstes kommt dann die Geschichte mit so, ah ja, ok, wir haben das jetzt aufgearbeitet und wir haben rausbekommen, ehm, die da waren dafür verantwortlich, dann werden dann irgendwelche Leute gefeuert, aber ich, aber ich als Obermanager, ich wusste davon natürlich gar nichts, wobei ich diese Aussage, ich verstehe übrigens nicht, warum die Leute da nicht mehr öfters, ehm, drauf angesprochen werden und zwar finde ich das äußerst befremdlich, wenn du als Obermanagements, ehm, Typ sagen kannst, wusste ich nichts von, denn es gibt, es gibt eigentlich nur zwei Sachen, entweder du wusstest es und lügst die Leute jetzt gezielt an, was, was die wahrscheinlicher ist, was die wahrscheinlichere Sache ist oder die Frage ist, was machst du für einen scheiß Job als Obermanager, wenn du von nichts was weißt, also, das ist eigentlich, es ist eigentlich beides eine ziemlich beschissen Antwort, naja, weiter, das ist halt nicht so, das ist, diese Statements sind immer so für den Arsch, so nach dem Motto, okay, wir haben euch jetzt, also das ist ungefähr so, wie wenn ich, was weiß ich, da fällt mir jetzt kein gutes Beispiel ein, wenn ich bei Rot über die Straße fahre, so, und danach kommt die Polizei und sagt, hey, wir haben sie fotografiert, sie sind bei Rot über die Straße gefahren und dann sag ich, Leute, das kann nicht sein, bei Rot über die Straße fahren, das hat keinen Platz in meinem Leben, das ist genau so eine Antwort, das ergibt überhaupt keinen Sinn, also, tut doch, es ergibt Sinn, es klingt beschwichtigend irgendwie bei manchen Leuten, aber es ist einfach bescheuert. Ja, das haben sie gemacht, aber warum, warum haben sie das gemacht, weil es zu negativ war mittlerweile, als hätte das da Bobby nicht gewusst, oder zumindest nicht, als hätte er da nicht was gegen machen können, das ist ihm vollkommen egal und auch diese ganzen Aktionen, diese ganzen Aktionen, die jetzt durchgeführt werden, ja, von Blizzard Chef geht, bis zu McCree wird umbenannt und sowas, über die Aktionen kann man geteilter Meinung sein, aber das sind keine Aktionen, die irgendwelche Leuten letztendlich was bringen, das sind rein so, wir tun was, also davon wird keiner, der Opfer dieser Sachen geworden ist, irgendwie sich besser fühlen, das ist nur, um der Öffentlichkeit zu zeigen, guckt mal, hier, wir nehmen das ernst, wir tun da jetzt was dagegen, das ist so reine Beschwichtigungssache, nix anderes. Ja, du bist müde, wir machen ja Aufwachen-Stream, fast ist ja, ist jemand, jetzt wollte ich das hier gerade im Hintergrund sehen, ist jemand, schafft es jemand, noch negativer gehyped zu sein über Vanguard als ich, dieses Spiel juckt mich absolut Null, Nullst sozusagen, am Nulligsten juckt mich das, das ist mir vollkommen egal. Ich bin mal gespannt. Ich bin mal gespannt, ich bin mal gespannt, wie sie das mit Halo mit Crossplay machen wollen. Wahrscheinlich habt ihr das, wisst ihr das nicht mehr, sie haben damals zu Halo 3 Zeiten versucht, intern wohl, PC versus, und Halo 3, also wer mal Halo auf der Konsole gespielt hat, das hat Ultra-Aim-Assist, also ich glaube es gibt kaum ein Game, was so krasses Sticky-Aim-Assist hat wie Halo, das ist wirklich der Wahnsinn, also, na gut, man muss sagen, man kann das nicht so wirklich mit dem Call of Duty-Aim-Assist vergleichen, der Call of Duty-Aim-Assist auf der Konsole, da gibt's ja Videos wo sich quasi das Fadenkreuz, wenn du auf den Gegner bist, von alleine bewegt, das ist bei Halo nur sehr begrenzt so, aber bei Halo ist Stick dein Fadenkreuz so richtig hart an dem, ist schwierig zu beschreiben, an dem Gegnermodel und die Schüsse in Halo, gerade in Halo 3, die mussten auch nicht so ultragenau sein, also die Hitboxen waren schon sehr forgiving. Und zumindest, die haben das ja da intern damals getestet, PC versus, die wollten ja damals zu Halo 3-Zeiten schon Crossplay machen, die haben das getestet, die haben gesagt, das können wir nicht machen, die Konsolenspieler werden hoffnungslos zerstört. So, und, mal gespannt, mal gespannt, wie sie das hier hinbekommen. Games wie Halo, man kann das nicht so direkt vergreifen, man kann das, man kann das nicht so direkt vergreifen, ja ja, den Tweet kenne ich, achso, den kenne ich nicht, ich hab mich verguckt, warte mal, schauen wir mal, schauen wir mal, guck ich mir gleich an, fuck, Leute, ich bin absolut nicht mehr multitaskingfähig, ich hab vergessen, was ich sagen wollte, nachdem ich mir das hier angeguckt hab. Ja, genau, das ist halt Halo, das ist halt so der typische Halo, okay, das ist krass, das ist krass, aber das war, genau so hat sich das in Halo immer angefühlt, also Halo ist halt super sticky zu den Gegnermodels. Ja, ist so, war im Prinzip schon immer so, und selbst da hat es nicht funktioniert mit versus PC-Spielen, ich mein, krasseren Aim Assist kannst du eigentlich gar nicht mehr machen. So, und der Vergleich Warzone, Halo passt ja in dem Fall auch nicht, Warzone ist ja ein deutlich langsameres, zumindest vom Aufbau her, Game, nicht dass Warzone nicht auch schnelle Momente hätte, aber Warzone ist ein deutliches, wie soll man sagen, taktischeres Movement Game, Map Control Game, als es jetzt Halo ist, Halo ist viel näher dran an dem, was du beispielsweise bei Quake 3 hattest, vielleicht nicht den ganzen übertrieben, also viel mehr Arena-mäßig, und da hat der Movement Vorteil, und allein schon, was du alles von deiner Umgebung mitbekommst, PC, Tastatur, Maus versus Controller, ich kann mir einfach nicht vorstellen, dass das gut funktioniert, egal, lassen wir es uns mal auf uns zukommen. Unfortunately, the playtests aren't going to be live 24-7 throughout their duration. Matchmaking will be limited to a specific window per day, that said, the times are pretty generous and cover the most popular gaming times. The standout improvement that I think many players are hoping to see this round of testing is better performance. The first playtest had some bizarre FPS and latest issues that severely impacted the overall experience for many players. Players discovered workarounds for some of the problems towards the end of the test, which could be a positive sign for this round of testing. Intel's bringing some heat with their latest CPU. Im wahrsten Sinne des Wortes, wahrscheinlich wird der Gramm wieder 105 Grad heiß. Coming 1.2900K is beating AMD's top-end 5950X in pre-release benchmarks. In was? The data has been leaked thanks to the ashes of Singularity. Muss man gucken, in was? In was? The benchmark and shows a 4,000 point lead with the new Intel chip. It's tough to say how meaningful these numbers are though, AMD have dominated the CPU market for the past year or so when it comes to the price to performance ratio. Ich glaube, dass es ja immer noch so sein wird. Also eins was Ryzen halt richtig gut gemacht hat, wo wir eigentlich alle AMD, ich mein dankbar ist ein dummes Wort, weil letztendlich kaufen wir den Scheiß immer noch für richtig fett Geld, aber ich sag's jetzt trotzdem mal. Also eine Sache, wo man AMD tatsächlich dankbar sein muss, ist, dass sie mit dafür gesorgt haben, dass Intel nicht mehr den Scheiß machen kann, sie die letzten Jahre übergemacht haben. Wenn AMD nicht am Start gewesen wäre, dann hätten wir heute sechs Kern-CPUs im Desktop, aber nur, wenn du High-End kaufst. Vielleicht, wenn du Ultra-High-End kaufst, acht Kerne. Intel hat ja keine Anstalten gemacht, da was dran zu ändern. Dann kam AMD um die Ecke und hat gesagt, bam, zwölf Kerne für die Hälfte, na ja übertrieben gesagt, nicht für die Hälfte des Preises, aber AMD hat gesagt, bam, zwölf Kerne zu ordentlichem Preis. Und daraufhin hat Intel ja erst angefangen, jetzt diese Sachen quasi auch in die Richtung zu gehen, dass es mehr Kerne gibt. Wir haben so lang, wir haben so lang auf Maximum vier Kerne in der Mittelklasse rumgekrebst, auf dem Desktop, das ist nicht normal gewesen. Ich hab dann 8700K, da hatte sechs Kerne, es war damals von hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui swatch Wo ich mal vergesse nicht südrig südrig sind die vm geschichten sirex wie hießen die noch mal Sirex Die sag mal so bis zur pentium zeiten auch noch ganz ganz cool war Es gab ja auch mal mehr grafikkarten hersteller also mehr grafikkarten chip hersteller als nvidia und amd Weil heute gibt es heute gibt es heute gibt es noch intel aber intel ist ja quasi eher integriert oder halt viele leute haben da on board oder eine cpu grafikkarte aber Externe grafikkarten hast du heute im prinzip zu 99 prozent hast du amd oder nvidia Und damals hast du manchmal auch s3 hießen die glaube matrox Und so die waren alle ganz gut damals mit dabei und die hatten auch recht recht Coole innovationen diese ganze cp diese ganze textur kompression hat ja damals Ja das haben wir damals mit erfunden S3 graphics Da konntest du zum ersten mal quasi an texturen dann ran laufen und hast sie dann wirklich hoch aufgelöst gesehen so also die waren richtig Die waren richtig gut dabei aber die haben alle wudu gab es noch ja Die haben es aber alle nicht überlebt gegen amd und nvidia und amd muss man ehrlich sagen hat es auch nicht so wirklich überlebt gegen nvidia Was grafikkarten top performance angeht also die haben schon lange zeit mann die sind jetzt mittlerweile wieder halbwegs konkurrenzfähig aber die haben ganz ganz lange zeit Nicht mehr die top grafikkarten gestellt und nvidia macht es übrigens mein amt muss ich jetzt mal nvidia macht es meiner meinung nach auch echt clever nvidia hat nicht nur super performance leider mittlerweile grafikkartenpreise komplett durch die deckel Was auch nicht ganz unschuldig dran sind aber nvidia macht es clever die machen die verlassen sich nicht nur drauf dass ihre grafikkarten top performance liefern die haben auch zusätzliche funktionen mittlerweile noch von shadowplay bis zu rtx voice und sonst rtx geschichten sonst was ja amd zieht da in manchen bereichen nach und gerade was shadowplay angeht Da hat amd mittlerweile auch was aber das ist hat nie so den so den anklang gefunden wie die sachen von von nvidia Und das ist halt auch was was den kram mit verkauft natürlich das erste was die leute haben wollen bei einer grafikkarte ist erst mal volle pulle Ja muss preisleistungsmäßig am besten fette performance das muss sein 1080 ti war damals ein super ding Da habe ich ja immer noch bis heute habe ich euch eigentlich erzählt das ea mir fürs battlefield testen den pc schicken wollte Weil ich 1080 ti habe und mindestens anforderungen war 20 60 Das habe ich glaube ich schon erzählt Naja Aber ich habe ich schon ja Aber so immer aber ich glaube jetzt haben sie es mittlerweile eingesehen ja das erzählst du seit vier streams ja ist auch lustig Naja so zumindest Was wollte ich jetzt gerade sagen das ist halt auch was was grafikkarten zählt Nix wegen rtx die wussten das einfach nicht besser ist ja auch nicht schlimm Das ist halt das auch was grafikkarten mit verkauft klar preisleistung in performance auf jeden fall kitkarte dankeschön fünf monat subscription Hüsch Aber halt auch die zusatzfunktionen und ich muss euch ehrlich sagen wenn ich die auswahl hätte zwischen der amd Highend grafikkarte an wieder highend grafikkarte ich würde mir tatsächlich es sei denn es macht so einen riesen Preislichen unterschied ich würde mir auch die wieder grafikkarte kaufen torrad hin 18 und kruf elektrik hütsch abscriptions dangeleute so jetzt gucken wir jetzt mal das video fertig ich bin ja wieder am schwätzen und wir haben erst vier minuten geguckt Hardcore overclocking intels next generation alder lake Sie haben immer so die glückliche leute von außen und even if intel reclaimed the top spot it might not be for long Hätte das nicht auch sind sie nicht auch immer so mit euren freunden im freien vom notebook also falls man freunde hat So so genau so im freien und ich freue mich dann und lacht dann und gucke ins notebook und je immer alder lake cpus launch on october 27 and even if intel reclaimed the top spot it might not be for long amd have already announced a new stacked chipset design based on current gen ryzen which is launching in the next few months this new design offers a big performance bump and will probably be put to even greater use in amd's next generation of chips yesterday's update of apex legends fix herr matchmaking issues that basically broke the entire game for meine beziehung zu apex ist irgendwie komisch ich habe es nie gespielt aber ich finde es ist das beste battle royale sie wie fail aber Ich weiß ich ich also wenn ich mir was angucke ich finde es ist auch am schönsten zuzugucken einfach weil sich permanent was tut da bewegt sich was da wird rumgejammt da wird herumgeflogen nicht da wird rumgesprungen und gemacht weiß ich für mich ist apex zum gucken dass das das beste real game warzone finde ich muss ich ehrlich sagen zum kuck kann man teilweise gucken finde ich aber zum gucken nicht so geil irgendwie ich verstehe dass ich da mehr spannung aufbauten warum das die leute gucken fortnight kann ich mir gar nicht angucken aber apex ist für mich das beste real auch wenn ich es nicht spiele klingt fail aber ja das Ja fortnight kann ich mir gar nicht angucken fortnight ganz ehrlich immer wenn ich fortnight in streams reingucke sehe ich leute die irgendwie eine halb blaue durchsichtige wand vor sich haben und holzplatten bauen und zwar und zwar nicht einfach und zwar nicht einfach holzplatten bauen sondern sondern kann man jetzt nicht nachmachen also die maus von den von den fortnight bauern die bewegt sich dann so die ganze zeit so die sind immer hin und her und wild am rumschwenken und also ich blicke da nicht durch ich weiß gar nicht ist wie fett ist dann fortnight noch auf auf twitch ich gehe mal davon aus es wird immer noch ganz vorne mit dabei sein raus games wo kann man denn hier nach spiele filtern normalerweise ist es immer auf der startseile ja ich sehe es ja man konnte doch nach spiele filtern ich sehe es denn das meine ich nicht man konnte doch immer nach spiel nach spielen filtern hier wow hier geht es ab hä nein du hast doch eine startseite du hast doch normalerweise eine startseite wo du endless scrollen kannst und nach nach nach zuschauer zahlen sortieren wo ist die denn hin ist die weg slash direkt das da meine ich genau das genau das genau das meine ich so viewers high to low also ja bloß resurrected das ist klar ich finde übrigens echt gutes remake im sinne des originals ich habe es jetzt ja auch mit dem friseur eine ganze weile gespielt aber ein paar sachen hätte man ohne probleme machen können für die apple 2 resurrected ja das ding hat bugs das hat teilweise richtig krasse bugs du joinst in games rein die nicht rein joinen willst und so was also ganz ganz ganz ganz ganz fail viele sachen sind halt schwachsinnig die brauchen wir nicht zum beispiel dass du keine games gescheit suchen kannst es ist kacke general slain 16 monat angeschön für den hyper subscription dass das inventar nicht größer geworden ist dass du keine loot filter installieren kannst was übrigens mit third party mods alles funktioniert ja übrigens das mit innen bevor die leute jetzt schreien sagen max inventarkröße geht doch gar nicht wer zu up doch geht beispielsweise in third party mods und servern zum beispiel pass of diablo haben sie das gut gelöst du hast ein doppelt so großes inventar gehabt aber du konntest trotzdem nur die maximale anscheinend an charms ins inventar machen also plus skills plus resis und so was wie du auch im original machen konntest im original haben die leute hier komplettes inf voll mit charms und nur noch den würfel für items das ist kacke also sie hätten ohne problemen das inventar vergrößern können kisten haben sie auch vergrößert ordentliche spiele suche hätte nicht geschadet auch ordentlichen input hätte nicht geschadet dass man die skills besser mappen kann support für loot filter und so was das hätte das spiel um ein vielfaches besser gemacht ja so wo ist fortnite hier immer noch ganz vorne dachte ich mir und eine sache mit der ich niemals gerechnet hätte ist dass minecraft im jahr 2021 immer noch so viele leute anzieht sowohl auf youtube als auch auf twitch das hätte ich schon vor zehn jahren oder war das rausgekommen ist nicht gedacht aber ist so ich gucke mir jetzt erst mal fertig the games most recent event update introduced bugs and server degradation that led to players getting booted from matches yesterdays update wasn't a complete fix but it seems to have solved the major issues das ist weil weil minecraft das liegt nicht an der grafik das liegt daran weil minecraft ist quasi ein wie soll man das sagen kann man sagen ein lifestyle für eine ganze generation das kann man schwer das kann man echt schwer vergleichen mit games bei uns zu unserer zeit es gab zu unserer also zu meiner zeit es gab natürlich schon krass angesagte games ja also minecraft ist doch man könnte sagen das world of warcraft der heutigen zeit was so den lifestyle und so das das game was die meisten ihrer generation geprägt hat das ist quasi vielleicht so vielleicht bei meiner generation und bisschen früher bisschen danach vielleicht sagen wir world of warcraft und heute ist es minecraft sagen wir so die die die letzten zehn jahre so was juckt mich apex das geht schon lange bloß auf steam nicht na gut warum gehts auf steam nicht ich gehe mal davon aus weil die spiele einfach voll verschlüsselt runterkommen und dann erst geguckt wird ok release datum hat er lizenz blablabla und dann wirds entschlüsselt und da haben sie wollten sie wahrscheinlich noch nicht junk base das ganze irgendwie machen bisher da haben sie wollten sie wahrscheinlich noch nicht junk base das ganze irgendwie machen bisher naja ich werde eh nicht upgraden bis nicht die erste update rollup raus ist aber dann dann wahrscheinlich schon ich wollte gerade sagen optisch sieht das richtig gut aus es gibt schlimmere vorbilder oder hat jemand von euch den des loop trailer gesehen und dachte auch das ist ein multiplayer spiel ursprünglich ist es ja eigentlich gar nicht es ist eigentlich hauptsächlich ein singleplayer game ich dachte auch an das aber ich dachte multiplayer ja chat bei uns auf der arbeit werden wir wahrscheinlich so wie ich unsere leute kenne auch die nächsten 15 jahre nicht updaten auf windows 11 ja das das ist wichtig das ist wichtig noch mehr wollten kratzer in fortnite endlich endlich endlich endlich noch mehr bildung sagt ich als jemand der nie fortnite gespielt hat das ist der kund warum ich nicht gerne gucken so jetzt haben sie noch mal chance youtube uns irgendwas ordentliches vorzuschlagen auch hier was los katz es ist auch ein game wo sie es richtig verkackt haben ich weiß nicht ob irgendjemand von euch überhaupt von der existenz dieses games hinbekommen hat das ist glaube ich ein russisches entwickler studio und die haben zu zeiten diese dieses world war 3 game angekündigt als jeder gesagt hat wir möchten wieder ein modernes battlefield haben also so vor fünf jahren oder so oder vor vier jahren vier fünf jahren ewig her und dann war einfach funk stille und nie wieder was von gehört und jetzt wo 2042 kommt jetzt kommen sie ja aus der versenkung schlechteren schlechteren zeitpunkt hätte man wohl kaum erwischen können was hast du schon mitbekommen das bald ja welches anti cheat welches gibt ja gibt ja einige aber es gibt einige habe ich schon so einige verarschungen vom lockpicking lawyer den kann man auch gut nachmachen so also was gucken wir uns jetzt an gaming new fastest gaming monitor ihr wisst ich bin immer dafür zu haben für für neues high end gaming equipment und und mehr wiederholfrequenz auf bildschirm es hat sich die letzten jahre ja einiges getan der sprung von 60 auf 120 beziehungsweise 144 das kam so ungefähr zur gleichen zeit war hat die die gaming welt verändert kann man glaube ich sagen also 144 120 herz war einfach ein riesen sprung ich habe jetzt einen 200 was habe ich denn überhaupt 240 herz muss mal kurz gucken weiß gar nicht wo sieht man das jetzt überhaupt windows technisch hier advanced display settings hier 240 herz habe ich jetzt ja und da muss ich sagen man merkt das ich finde man merkt den unterschied immer noch aber bei weitem also mit riesem abstand nicht mehr so unterschiedlich wie jetzt beispielsweise von 60 auf 144 also der unterschied von 60 auf 144 sind absolut welten welten wenn irgendjemand den unterschied nicht sieht es gibt ja so leute es gibt ja so leute es gibt ja so leute die sagen sogar sie sehen den unterschied zwischen 30 und 60 nicht vielleicht kennt ihr das so wenn du dann zeigst du denen irgendwie eine animation mit 30 fps und eine animation mit 60 fps und die leute sagen das sieht für mich genauso aus ich sehe da keinen unterschied das ist doch das gleiche gibt es gibt es ja so und es gibt bestimmt auch leute die sagen sie sehen den unterschied sie fühlen den unterschied in games auch gerade mal schnell kamerawählen 62 und 144 60 und 144 nicht mag es auch geben aber ich glaube es gibt ganz viele die sind wirklich nicht in der lage den unterschied zu fühlen zwischen 100 also ich bin da mal zwischen 60 und 144 müsste eigentlich auch jeder fühlen weil meine ansicht sind gerade in games bei schnellen kamerabewegungen sind welten dazwischen aber zwischen 144 und 240 ich merke es aber du musst halt auch erst mal ein game haben mit ordentlich fps ich merke es aber es ist wirklich im vergleich zu 60 244 minimal so und jetzt denke ich mir halt ok und dann noch von 240 zu 390 du wirst es bestimmt in den ein oder anderen situationen merken aber ich glaube nicht dass es absoluter game changer ist wie von 60 auf 144 zumal du brauchst auch erstmal ein game was mit ordentlich ordentlich fps läuft natürlich hast du theoretisch auch den vorteil von wenn das game mit weniger fps läuft aber so richtig ausspielen kannst du es natürlich nur umso mehr fps du hast aber gucken wir mal woher willst du die 400 fps bekommen wieso also wenn ich battlefield 3 zum beispiel spiele auf low details dann geht das so gut compared to the competition das stimmt das exactly was happening right here wahrscheinlich wahrscheinlich sagt das panel ist blickwinkel abhängig als fack und er hat kack farben oder so da kann ich mir schon vorstellen dass sie ein schnelleres panel billiger bauen können aber wahrscheinlich auch die auflösung geringer das bestimmt nur 1080p die anderen gibt es ja teilweise schon bis 1440 und ich weiß gar nicht ob es sogar 4k welche gibt schon also 4k 4k 240 geht nicht ich glaube das geht über displayport nicht drüber das ist tatsächlich relativ gut 200 Ja, das zeige ich euch. Input lag. Ah ja, James, 14 Monate lang schon von dem Zap. Ja. Das stimmt. Das ist aber kein Cheating in dem Sinn. Das ist tatsächlich so ein bisschen näher dran, an dem wie auch ein CRT das Bild aufgebaut hat. CRTs war es ja auch so, dass das Bild sich nach jedem Frame, was ja da bei Backlight Strobing nicht so ist, aber bei jedem Frame quasi neu aufgebaut hat. Deswegen kam ja, deswegen kommt einem ja das bei einem CRT auch so auch so wie soll man sagen, so so lagfrei vor. Ja, so heißt das bei mir. Diak. Ich habe es nicht so in so ein BenQ. Glaub schon. Ja. Ja, was übrigens auch heißt, was übrigens auch heißt, dass man dadurch nicht vernachlässigen darf, was bei einem CRT übrigens ja, nicht so war, oder man könnte das sagen, standardmäßig so war, aber nicht so war, weil es andere Technik ist. Das Bild wird dadurch dunkler. Ist ja logisch. Es ist ja das Licht kürzere Zeit an. Also wisst ihr, wenn die Background Beleuchtung durchgängig leuchtet oder eben 240 Mal in der Sekunde an und aus geschaltet wird, das ist einfach dunkler. Das Bild, das merkt ihr auch sobald ihr das einschaltet. Das ist wirklich nicht schlecht. Ich habe das ja auch, also im Desktop Betrieb nicht, aber du kannst es zu drei Settings durchschalten. Ich muss sagen, ich finde den Monitor auch richtig gut. Ich habe hier einen BenQ mit 240 Hertz und auch Backlight-Diag Zeug. Das ist wirklich nice. Das ist auch schon uralter Test. Ihr müsstet euch mal den Unterschied angucken zwischen 60 Hertz und dem Kram hier. Das ist übrigens gar nicht so verkehrt ausgesprochen. Man spricht die wirklich mehr oder weniger so aus. Vielleicht nicht A-SUS, sondern eher A-SUS. Die Betonung liegt auf dem U, nicht auf dem A. Wir sagen ja gerne A-SUS. Die Wirklichkeit ist eigentlich A-SUS. Und A-SUS ist komplett falsch. Das ist tatsächlich sehr klar. Ich habe meine Zweifel, ob es viele Leute gibt, die das merken. Wie gesagt, zwischen 1620 Hertz auf jeden Fall, zwischen 144 und 142 Hertz auch noch, aber... Da sind wirPolitika. monstrous increase of a hundred and fifty hertz but honestly it is kind of hard to notice that difference without the strobing mode enabled especially in a game like valorant where you can actually drive that amount of frames the only way to explain it is that it Feels like you're playing in real time with absolutely zero delay. There's no smoothing. There's no choppiness. There's no visual artifacting Everything just feels instant. It's noticeably clearer than the muss ehrlich sagen Ich habe also spätestens seit diesem Jahr eigentlich bei nichts mehr irgendwelche artefakte gesehen Even if it isn't displaying a completely new frame every time Apex The Acer 390hz will also have the benefit of a lower input lag But this is mostly relevant for those games that you can actually run at 390 FPS plus again with the strobing tech here at 390hz the input lag is a few milliseconds faster than the Asus and the Zowie and most of that comes down to the large refresh rate difference Let's also not forget. This is an IPS panel Which means that colors in contrast are going to be a strong point on their own Just like the Asus, the Acer has a dedicated sRGB mode, which is really damn cool The white point is rock solid at around 6500K Wobei ich dazu sagen kann am besten ist, weil man wirklich den Monitor nach Also auch wenn die, sagen wir so, die günstigen, gerade die Gaming-Monitor jetzt nicht allzu gut sind So bei Farbraumabdeckung am besten ist man hat ein Kalibrierungsgerät. Das ist wirklich nice Also wenn man will, dass es halbwegs gut aussieht auch Also wenn man irgendwelche Bilder mal abgleichen will und gucken will passt das ist Rot-Rot und Blau-Blau und Gelb-Gelb und Lila-Lila und was auch immer Dann ist ein Kalibrierungsgerät gar nicht so gar nicht so blöd. Die Dinger hängt man von Monitor, schließt sie per USB an und dann lässt man ein Testprogramm laufen und die haben eine Kamera drin und gucken halt wie Akkurat ist das ganze und am Ende kriegst du ein Color-Profil raus und kannst es laden und dann ist dann Monitor perfekt kalibriert Was heißt perfekt? So perfekt, wie es halt mit dem jeweiligen Monitor sein kann Warum sind das eigentlich so krumme Zahlen 144, 240? Na gut, 240 ist jetzt nicht krumm. Also wenn krumm und gerade ist keine davon Aber ich vermute mal das liegt an den an den Panels und was die Hersteller da draufschreibe. Warum? Warum? Also das erste was es gab ist 120 und 144 Hertz von dem bisschen schnelleren. Die gab es ungefähr ziemlich zeitgleich Warum es jetzt 144 war, keine Ahnung. Sien Also, ich hab's verstanden. Ich hab's verstanden, der Find dem Monitor furchtbar geil und es bringt ahngeblich was. Ich werde mir auf jeden fall keine 390 Hertz monitor oder Tja es ist ja immer noch ein 360 Hz Panel kaufen. Ich bin mit dem BenQ 240 Hz eigentlich ganz zufrieden. Ich werde mir frühestens einen neuen Monitor kaufen, wenn ich mir auch einen neuen Rechner kaufe. Und das ist ja aufgrund der Verfügbarkeit von Grafikkarten, CPUs und generell Hardware und dem jeweiligen Preis... Aktuell, tja, eher noch nicht in Sicht. Ihr wisst, ich wollte mir schon vor zwei Jahren einen neuen Rechner kaufen. Ich wollte mir ursprünglich in 390 kaufen, dann 5090, X, AMD, Stellz und... oder was, 5900, 5900, ne? Ach, AMD Benamung. Hab ich nicht gemacht, gab ja nie was. Ich hab immer noch meine 1080 Ti. Die ist jetzt von wann? 2017 oder so? Das funktioniert alles wunderbar. Es gab noch nichts, was ich nicht spielen konnte. Muss ich mal überlegen. Vier Jahre alt, der Rechner. Mein Rechner ist jetzt genau... Mein Rechner ist jetzt genau vier Jahre alt. Guck mal. Ja, naja. Ja, genau vier Jahre alt. Da hab ich den gekauft. Es ist immer noch genau das Gleiche drin. Das Einzige, was ich noch mal dazugesteckt hab, war noch mal 16G RAM zusätzlich. Es ist genau das Gleiche drin. Immer noch. Hallo. Was ein Hall. Hätte ich den Sound nicht besser machen können. Warum hat das so viele Views? Ja. Okay, jetzt haben wir uns angeguckt. Was gucken wir uns das... Was? Lego Build. Was ist das? This Lego Build will blow your mind. Okay, wir lassen unser Mind blown jetzt. Auf geht's. Mind blown. Okay, ich lasse mal die Mario Kart Musik an. Passt, glaube ich, ganz gut dazu. Aha. Du musst erst mal so viele Lego Teile in Lilak, also diese Lego Teile alle in der kleinen Farbe kriegen. Ist das ein Chebat? Keine Ahnung. Mal gucken, was rauskommt. Pause-Champ. Was ist das für ein Video? Die Mario Kart Musik passt da erstaunlich gut dazu. Hä? Also, wenn er irgendwie eine Platte bauen will, dann warum hat er Löcher drin? Weil es gibt keine Platte. Guck mal, das sind hier... Das ist nicht umsonst, dass es so... So immer einzelne Blöcke sind. Ah, okay, wir gucken ihm doch nicht bei allem zu. Ah, habt ihr es gesehen? Das hat, das hat gemoved. Guck mal, das hat gemoved. Das moved hier. Aha, aha. Sus. Aha. Keine Ahnung, was da abgeht, aber er wird es schon wissen. Jetzt. Andere Seite. Wubbel-Wubbel. Das ist cool. Das hätte ich nicht gedacht. Das hätte ich nicht gedacht, dass es so flexibel da am Ende was rauskommt. Nice. Es ist zwar komplett sinnlos, man kann damit absolut nichts anfangen und es stellt auch nichts dar oder sonst... Das hätte ich nicht gedacht. Das hätte ich wirklich nicht gedacht, dass das dabei rauskommt. Pock. Schon die Nintendo Direct gesehen? Nee. Lass mich raten, es wurde nichts gezeigt, was irgendwie interessant ist. Doch, doch, doch, doch, doch, doch, doch, doch, doch, doch, doch, doch. Irgendein neuer Smash-Kämpfer wahrscheinlich. Es ist immerhin Nintendo. Naja. Okay, war nice, hätte ich echt nicht gedacht, dass das dabei rauskommt, aber ja, so extrem mindblown bin ich jetzt auch nicht. N64 games für switch Nintendo fällt allerdings noch ist ok wir müssen uns mal kurz anhören wie man arsos ausspricht also zeig her ich brüche mein arsos aus nein oder wirklich Jesus das glaube ich dir nicht dass das glaube ich dir nicht dass man das so ausspricht weil Das ist das ist das ist doch toll ich kann wisst ihr warum ich das nicht glaube weil mir zwei leute persönlich von arsos von arsos erzählt haben dass es arsos heißt und nicht aces das heißt arsos das heißt arsos sind wir zwei leute persönlich von arsos erzählt sei immer nur arsos die haben mich getrollt Nenene das ging genau um dieses thema und sie haben auch gesagt was sie bescheuert finden von der ursprache und sie haben gesagt dieses englische aces ist fail die erdies auch von ich weiß auch nicht warum die haben ich nicht gebetet wie auch immer jetzt weiß jemand nicht wie man arsos ausspricht naja von dem haben wir schon mal was gesehen ihr zeigt mal nicht dass wir jetzt gebetet werden was ist das für einer was i converted my microwave into a was was die jetzt das muss doch tschübet sein warum hat er warum warum und vor allem wie ok wir gucken das jetzt an ja 조금 punter die lautstärke ändert sich ein video es verified fender ein bisschen lauter machen 一下 plete Yorker 沒錯 Blast-Chamber. Dann zeig mal her. Ah, Sponsor. Aber das ist nicht super spannend, und es ist oft schneller als ich möchte. Und außerdem, du kannst das auch mit einem normalen Ofen machen. Aber das ist nicht ein normales Ofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. Das ist ein Wissenschaftsofen. 100% setting the bulbs are only on half the time and this is an epilepsy warung Microwaves half the time and what a scam Anybody who watches my videos knows that half power just isn't gonna cut it for me. I think it's time for some upgrades All right, so I've taken this thing apart to expose the circuitry inside now I gotta say it poking around in a microwave is not for the inexperienced when electronics hobbyists get killed by the projects It's almost always because they're messing around with microwave parts like these Anyway, here's the reason why the ovens only on half the time. So this magnetron here, which is actually the source of my grades In the end, it's always a bad idea in such devices because you've just cut them off from the power then immediately with the finger to fill the back Feeding the output of this high voltage transformer into this halfway voltage doubler circuit now the very nature of the circuit means that the Magnetron is only going to be powered on half of the AC cycle now the transformers in these things were ran so ridiculously close to saturation You could just throw in another capacitor and diode to make the full wave doubler and call today But you can't Max, du wolltest doch auch mal dein Mikro reparieren Wieso, was ist mit meinem Mikro? Ist da was kaputt? Hä? Hört so an wie immer, was hab ich was mit meinem Mikro? Test, test, test, test Test, test, test, test Test, test, test, test Ist alles vollkommen in Ordnung Parkway for the transformer But before I do that let's start with a quick control run because this is a science video after all sort of I'm going to start by ripping this plastic covering off of the door the metal grid will still stop microwave from this Ich bin da froh dass es so feinfühlig vorgeht I actually learned this thermal camera trick from the youtuber Cyparagon. Well. He's not really a youtuber I've just known him from various nerdy online groups over the years, but he does have some cool vids on YouTube regardless So a cup of water heats by about 28 degrees Celsius in a minute which also suggests about 40 percent efficiency Now obviously this isn't quite fast enough for my liking. Was hat es mit Laser jetzt? I want to head in unlocked full power mode here I've added another transformer as well as some more diodes and capacitors to make the full wave doubler circuit But wait, want a microwave using double the power trip the breaker? Well, it's nothing a little bit of copper wire and duct tape can't fix I'm just kidding Wollt grad sagen, ernsthaft? I was too lazy to use the original controls on the microwave so now I'm using this huge variac to power it Mocker Haus abfackeln Ja Wer braucht, wer möchte nicht öfters large objects radiate mit seiner Mikrowelle. Ich mein wer kennt, wer kennt das Problem nicht? Täglich Das ist ein Ton der wird mich nicht ruhig schlafen lassen Ja, hätt ich, gut, hätt ich auch damit gerechnet, dass es schneller geht Fahrenheit, ja, Kona Units Ich hab kein Schimmer was 107 Grad fahrenheit sind Alter Wenn man sonst keine Probleme hat Alter, dieser Sound macht mich fertig Nee Also spätestens wenn irgendwo schwarzer Rauch rauskommt dann weißt du stimmt was nicht Die Banane wird geschweißt genau Der Kerl ist irgendwie schon bisschen durch oder Hallo Lasers Die Ich meine es hat im Prinzip keinen Sinn was er macht Es ist einfach nur cool dass es geht also ich meine praktische Anleitungzweck hat es natürlich nicht Also wer braucht wer braucht Werbeleid Passte Und ich dachte schon ich dachte schon die Dinge die ich hier manchmal zusammen zusammenbau sind abseits vom Mainstream aber das hier ist noch mal eine Nummer Nummer mehr Jawoll Warum Was treibt er da Was was treibt er denn da Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Es ist blaues Licht und was tut es leuchtet blau Ist das jetzt schlecht wenn man da seine Hand dazwischen steckt Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl Was geht mit dem Kerl", "segments": [{"id": 1, "start": 0.0, "end": 29.48, "text": "Fuck, ja ich bin noch ein bisschen früher als sonst."}, {"id": 2, "start": 29.48, "end": 31.4, "text": "Aber ich glaub mir, man kann's überleben."}, {"id": 3, "start": 31.4, "end": 47.36, "text": "So, jetzt müssen wir erstmal gucken, bis Twitch gecheckt hat, dass der Stream online ist."}, {"id": 4, "start": 47.36, "end": 50.32, "text": "Dauert ja manchmal undefinierte Zeit."}, {"id": 5, "start": 50.32, "end": 55.56, "text": "Weiß nicht so genau."}, {"id": 6, "start": 55.56, "end": 59.44, "text": "In dem Fall muss ich mal gucken, ob ich wieder irgendwelche komischen Scam-Mails gekriegt"}, {"id": 7, "start": 59.44, "end": 60.44, "text": "hab."}, {"id": 8, "start": 60.44, "end": 70.16, "text": "Ne, sieht nicht so aus."}, {"id": 9, "start": 70.16, "end": 88.56, "text": "Außer irgendwelche komischen VPN-Anbieter, die wir da geschrieben haben, null."}, {"id": 10, "start": 88.56, "end": 102.2, "text": "Alter, die können's nicht sein lassen, ne."}, {"id": 11, "start": 102.2, "end": 108.04, "text": "VPN-Anbieter, die schießen echt wie so eine Pilze aus dem Boden, das gehört gar nicht"}, {"id": 12, "start": 108.04, "end": 109.04, "text": "mehr auf."}, {"id": 13, "start": 109.04, "end": 111.32, "text": "Vergeht keine Woche, gibt's neuen VPN-Anbieter."}, {"id": 14, "start": 111.32, "end": 112.32, "text": "Null."}, {"id": 15, "start": 112.32, "end": 116.36, "text": "Ey, sag mal, ist mein Chat irgendwie kaputt?"}, {"id": 16, "start": 116.36, "end": 119.4, "text": "Die Leute schreiben doch schon..."}, {"id": 17, "start": 119.4, "end": 120.4, "text": "Hä?"}, {"id": 18, "start": 120.4, "end": 124.48, "text": "Hab ich die letztens gehostet oder was hab ich hier für einen Chat auf?"}, {"id": 19, "start": 124.48, "end": 126.6, "text": "Weiß ich gar nicht mehr."}, {"id": 20, "start": 126.6, "end": 128.32, "text": "Falscher Chat, alter."}, {"id": 21, "start": 128.32, "end": 129.32, "text": "Null."}, {"id": 22, "start": 129.32, "end": 133.6, "text": "Hier hab ich glaube ich das letzte Mal weitergeleitet."}, {"id": 23, "start": 133.6, "end": 138.04, "text": "Oder so, keine Ahnung."}, {"id": 24, "start": 138.04, "end": 139.84, "text": "Weiß nicht."}, {"id": 25, "start": 139.84, "end": 144.48, "text": "Glaub schon, ja, genau, genau."}, {"id": 26, "start": 144.48, "end": 146.72, "text": "Deswegen war der Chat noch auf."}, {"id": 27, "start": 146.72, "end": 151.0, "text": "Leute, danke für die Subs, wir nehmen hier alles am Start."}, {"id": 28, "start": 151.0, "end": 157.36, "text": "Hab ich gesehen, der CLI-Jumper ist da fünf Monate, halb zehn Monate am Start."}, {"id": 29, "start": 157.36, "end": 161.88, "text": "Es kommt ja manchmal so um die Ecke mit 17 Monaten, das ist ja mässig, Viper-Subscription"}, {"id": 30, "start": 161.88, "end": 162.88, "text": "hier."}, {"id": 31, "start": 162.88, "end": 168.12, "text": "Ich wiege gerade da ja alles am Start, denn manche Twitch-User haben immer noch die besten"}, {"id": 32, "start": 168.12, "end": 169.48, "text": "zwei Monate am Start."}, {"id": 33, "start": 169.48, "end": 170.48, "text": "Alles."}, {"id": 34, "start": 170.48, "end": 171.48, "text": "Was?"}, {"id": 35, "start": 171.48, "end": 172.48, "text": "Schon wählen?"}, {"id": 36, "start": 172.48, "end": 175.32, "text": "Manche fragen ab wann kann man denn wählen gehen, aber anscheinend kann man das schon."}, {"id": 37, "start": 175.32, "end": 178.64, "text": "Ganz einfach abgesehen, ich muss gar nicht mehr wählen gehen, weil ich war schon wählen,"}, {"id": 38, "start": 178.64, "end": 181.92, "text": "ich hab per Briefwahl gewählt sort."}, {"id": 39, "start": 181.92, "end": 184.36, "text": "Weiß nicht, hat jemand von euch auch Briefwahl beantragt?"}, {"id": 40, "start": 184.36, "end": 188.88, "text": "Ich hab gerade dieses Jahr gar keinen Bock gehabt dahin zu gehen und ich könnte mir vorstellen"}, {"id": 41, "start": 188.88, "end": 196.28, "text": "ich werde das auch nach wie vor weitermachen, weil Briefwahl ist einfach nice, du musst"}, {"id": 42, "start": 196.28, "end": 201.36, "text": "halt nix machen, du sagst willst du Briefwahl haben, dann kriegst du deine Unterlagen zugeschickt."}, {"id": 43, "start": 201.36, "end": 208.92, "text": "Ich bin da auch nur drauf gekommen, weil irgendwas bei uns, irgendwas regionales, oder kommunal"}, {"id": 44, "start": 208.92, "end": 211.76, "text": "ist, was das glaube ich gewesen ist, da hab ich auch per Briefwahl gewählt, da hab ich"}, {"id": 45, "start": 211.76, "end": 216.44, "text": "mir gedacht, hey, warum machst du das jetzt nicht wieder, da war eine 69 Zuschauer, gachi"}, {"id": 46, "start": 216.44, "end": 217.44, "text": "BuzzTime."}, {"id": 47, "start": 217.44, "end": 223.52, "text": "Erstmal ein Briefwahl gemacht, ja alles."}, {"id": 48, "start": 223.52, "end": 228.8, "text": "Ja, ich glaube auch, dass ganz viele, flow the game, 5 Monate, dankeschön für den Sub."}, {"id": 49, "start": 228.8, "end": 234.76, "text": "Ich glaube es haben dieses Mal wirklich viele Leute Briefwahl gemacht, richtig viele, aber"}, {"id": 50, "start": 234.76, "end": 238.68, "text": "ich glaube es ist ja bei uns nicht so wie bei den Amis, bei den Amis ist es ja irgendwie"}, {"id": 51, "start": 238.68, "end": 242.88, "text": "so, dass du Briefwahl noch, frag mich nicht, eine Woche oder so länger auszählst als bei"}, {"id": 52, "start": 242.88, "end": 247.64, "text": "der Wahl, also nicht am Tag selbst und ich glaube bei uns ist es ja so, weil ich mir"}, {"id": 53, "start": 247.64, "end": 253.0, "text": "da nicht ganz sicher bin, bei uns ist es ja so, die Briefe müssen bis spätestens 18"}, {"id": 54, "start": 253.0, "end": 261.12, "text": "Uhr beim jeweiligen, ja was ist denn das dann, bei uns ist es im Rathaus, aber auch immer"}, {"id": 55, "start": 261.12, "end": 262.12, "text": "abgegeben werden."}, {"id": 56, "start": 262.12, "end": 271.96, "text": "Und ich glaube die zählen das ja alles heute aus, oder gibt es bei uns auch noch irgendwie"}, {"id": 57, "start": 271.96, "end": 272.96, "text": "so Nachzüglerkram."}, {"id": 58, "start": 272.96, "end": 278.04, "text": "Bei den Amis war es ja letztes Mal total wir, das sah ja erst so aus, als hat Trump gewonnen"}, {"id": 59, "start": 278.04, "end": 283.04, "text": "und dann kam Briefwahl, Stellz, und dann hat er beiden voll aufgeholt."}, {"id": 60, "start": 283.04, "end": 294.48, "text": "Alter, die Musik, ja mach das, mach das, natürlich auf laut, dass alle was von mitkriegen."}, {"id": 61, "start": 294.48, "end": 301.12, "text": "Ne, aber ich habe schon, ich habe ja bei Briefwahl schon gewählt vor 5 Tagen oder so, ich habe"}, {"id": 62, "start": 301.12, "end": 308.68, "text": "das glaube Dienstag oder so abgeschickt und deswegen ist das bei mir auf jeden Fall alles"}, {"id": 63, "start": 308.68, "end": 309.68, "text": "pünktlich da."}, {"id": 64, "start": 309.68, "end": 320.84, "text": "Ja, das war die Amitaktik so nach dem Motto, oh nein ich bin ja am verlieren, ne, ne, Brieffall"}, {"id": 65, "start": 320.84, "end": 323.08, "text": "zählt nicht mehr, hat aber da auch nicht funktioniert."}, {"id": 66, "start": 323.08, "end": 329.56, "text": "Wobei ich weiß ich bei den Amis auch nicht so ganz verstanden habe, als Trump schon nicht"}, {"id": 67, "start": 329.56, "end": 333.56, "text": "mehr Präsident war, wollten sie ihn ja irgendwie des Amtes entheben, das hat sich bei mir auch"}, {"id": 68, "start": 333.56, "end": 336.64, "text": "nicht ganz entschlossen, wie kannst du denn jemanden des Amtes entheben, aber das ist"}, {"id": 69, "start": 336.64, "end": 340.68, "text": "vielleicht einfach Kokona-Things, die ich nicht verstehe, ja, wie kann man jemanden"}, {"id": 70, "start": 340.68, "end": 344.32, "text": "des Amtes entheben, der überhaupt dieses Amt nicht mehr hat, das habe ich nicht so"}, {"id": 71, "start": 344.32, "end": 347.92, "text": "genau kapiert, aber dann haben ja auch am Ende nicht funktioniert, vielleicht wollten sie"}, {"id": 72, "start": 347.92, "end": 353.28, "text": "nicht, dass man ihn jemals wieder wählen kann oder so, ach was weiß ich, Kokona-Style,"}, {"id": 73, "start": 353.28, "end": 354.28, "text": "was auch immer da abgeht."}, {"id": 74, "start": 354.28, "end": 367.0, "text": "Die Amis, ahja, das dachte ich mir, das dachte ich mir, aber das hat ja nicht funktioniert."}, {"id": 75, "start": 367.0, "end": 378.4, "text": "Jaja, aber der Kram lief doch noch weiter, als da schon gar nicht mehr Präsident war."}, {"id": 76, "start": 378.4, "end": 385.2, "text": "Ach, was weiß ich, eigentlich ist mir wurscht, was die Amis so treiben."}, {"id": 77, "start": 385.2, "end": 391.72, "text": "Was mich viel mehr interessiert, wie es mit, Moment, ich zeige euch das gerade mal, wie"}, {"id": 78, "start": 391.72, "end": 400.4, "text": "es mit Zoll bei AliExpress, nein nicht Alisweidel, wie es bei AliExpress, wie kommt er bei Ali"}, {"id": 79, "start": 400.4, "end": 410.56, "text": "auf Alisweidel, Alter, Ali, ich wippe bei Ali auch immer an Alisweidel denke, aber gut,"}, {"id": 80, "start": 410.56, "end": 418.64, "text": "logisch, aber ich wollte eigentlich, ja, das, also ich habe ja zum ersten Mal bei AliExpress"}, {"id": 81, "start": 418.64, "end": 423.68, "text": "bestellt, seit die Zollanpassungen sind, also dass du theoretisch mehrmals teuer Zoll"}, {"id": 82, "start": 423.68, "end": 428.48, "text": "und Geschäfts bezahlen musst und wisst ihr was Leute, dreimal dürft ihr raten, gab es"}, {"id": 83, "start": 428.48, "end": 438.6, "text": "Probleme mit AliExpress Versand und Zoll, nein, oder ja, oder bisschen, was meint ihr,"}, {"id": 84, "start": 438.6, "end": 448.32, "text": "also ich habe bestellt zwei Stück hiervon und ich glaube 25cm, also irgendwie, ich habe"}, {"id": 85, "start": 448.32, "end": 457.08, "text": "die bestellt, aber 20cm, irgendwie sowas, also ich habe glaube ich irgendwie für knapp"}, {"id": 86, "start": 457.08, "end": 465.68, "text": "70€ oder so bestellt, nein, es gab überhaupt keine Probleme, Hausnummer liegt, oh ja, fuck,"}, {"id": 87, "start": 465.68, "end": 474.6, "text": "ich habe hier rumgeklickt, nein, Hausnummer liegt, es gab überhaupt keine Probleme, das"}, {"id": 88, "start": 474.6, "end": 479.68, "text": "ist LED Hausnummer, ja, aber ich werde das nicht so machen, ich habe euch das Video ja"}, {"id": 89, "start": 479.68, "end": 488.16, "text": "schon öfters gezeigt, mein Ziel, mein Ziel ist ja, dass ich sowas hier machen kann, ich"}, {"id": 90, "start": 488.16, "end": 497.8, "text": "mache dann Custom LEDs, Drip rein, 144 LEDs auf den Meter, also sowas hier hole ich mir"}, {"id": 91, "start": 497.8, "end": 509.68, "text": "dann, LED, WS, ne, ne, ne, SK, die da sind das glaube ich die mit weiß, das ist RGBW,"}, {"id": 92, "start": 509.68, "end": 516.0, "text": "falls ihr jemals was mit RGB macht und einen ordentlichen Weißton wollt, ich kann euch"}, {"id": 93, "start": 516.0, "end": 528.08, "text": "nur empfehlen, gebt das extra Geld aus und nehmt RGBW Strips, RGB ist klar, aber W, die"}, {"id": 94, "start": 528.08, "end": 534.12, "text": "haben noch zusätzlich weiße LED, das heißt ihr könnt nicht weiß mischen mit RGB, sondern"}, {"id": 95, "start": 534.12, "end": 538.6, "text": "ihr habt wirklich weiß und ihr könnt sogar je nachdem den Farbton euch aussuchen von"}, {"id": 96, "start": 538.6, "end": 543.52, "text": "dem weiß, das ist viel besser, also ich hab schon erlebt, dass RGB Strips, wenn du die"}, {"id": 97, "start": 543.52, "end": 549.28, "text": "auf weiß stellst, dass die so pläulich sind oder je nachdem was da überwiegt, also RGBW"}, {"id": 98, "start": 549.28, "end": 555.6, "text": "Beste, ja und dann würde ich mir hier so einen RGBW Strip holen, wo dann wirklich 144 sind,"}, {"id": 99, "start": 555.6, "end": 560.4, "text": "ja IP30 reicht, die sind ja im Gehäuse, gibt es gerade nicht, gibt es gerade nicht zu kaufen,"}, {"id": 100, "start": 560.4, "end": 573.28, "text": "144 LEDs, Meter, RGBW, größer Keg W, LULW, wenn schon, weil LULW ist eh das beste Lach-Emote,"}, {"id": 101, "start": 573.28, "end": 582.8, "text": "also LULW, alter, ich hab immer noch ein bisschen Hals-Ace, Wahnsinn, letzte Woche"}, {"id": 102, "start": 582.8, "end": 586.16, "text": "hatte ich übeles Hals-W, aber ihr habt ja schon im Stream gehört, als es angefangen"}, {"id": 103, "start": 586.16, "end": 600.36, "text": "hat, eh immer noch Corona, genau, Dauer-Corona, ich hab, ich hab 24 Corona, Endless-Corona,"}, {"id": 104, "start": 600.36, "end": 608.24, "text": "also Covid-4K, das ist schon, das ist schon quasi nach HD, ich hab schon, ich hab schon"}, {"id": 105, "start": 608.24, "end": 619.0, "text": "das ganz neue, Ultra-Hi-Res, ja so war es da, so war es da, brauche ich, genau, also"}, {"id": 106, "start": 619.0, "end": 623.56, "text": "Black ist jetzt irgendwie nicht, ne, der Strip ist nicht Black, der Strip ist eindeutig"}, {"id": 107, "start": 623.56, "end": 634.68, "text": "White, ja und hier kann man einstellen, wie die Farbe von dem Weiß sein soll, also RGBW,"}, {"id": 108, "start": 634.68, "end": 640.48, "text": "gut ist ja auch, ist ja auch, so soll dann, so soll dann meine Hausnummer aussehen, wenn"}, {"id": 109, "start": 640.48, "end": 647.56, "text": "das funktioniert, so und ich hab das bei AliExpress bestellt, kam an, mit DHL geliefert, ohne jegliche"}, {"id": 110, "start": 647.56, "end": 654.64, "text": "Probleme, keinerlei Zoll-Geschichten, nix, also, die China-Chinesen haben es wieder geschafft,"}, {"id": 111, "start": 654.64, "end": 660.48, "text": "scheiß drauf, dass es irgendwelche neuen Zoll-Regelungen oder sonst was gibt, juckt"}, {"id": 112, "start": 660.48, "end": 666.0, "text": "die einfach nicht, 5G plus 5G ist 10G Corona, daran hab ich noch gar nicht gedacht, da"}, {"id": 113, "start": 666.0, "end": 672.16, "text": "müsste man mal bill Gates fragen, ob man das überhaupt so rechnen kann, der weiß das"}, {"id": 114, "start": 672.16, "end": 676.88, "text": "bestimmt, wenn Bill Gates jetzt nicht Atomkraftwerke bauen, hab ich irgendwo so die Überschrift"}, {"id": 115, "start": 676.88, "end": 687.84, "text": "gelesen, aber hab keine Details zu angeguckt, irgendwas hab ich gelesen, ja also wie gesagt"}, {"id": 116, "start": 687.84, "end": 699.0, "text": "überhaupt kein Ding bestellt, China-Chinesen-Shopping, alles am Start und ohne Probleme, wieder schon"}, {"id": 117, "start": 699.0, "end": 709.16, "text": "so lange, ich hab das jetzt nicht so verfolgt, übrigens wisst ihr mit wem ich gestern ein"}, {"id": 118, "start": 709.16, "end": 717.6, "text": "Video aufgenommen hab, wie hieß denn das Video, irgendwie so hieß das Video glaube"}, {"id": 119, "start": 717.6, "end": 728.92, "text": "ich, das da, wisst ihr mit wem ich gestern ein Video aufgenommen hab, korrekt, korrekt,"}, {"id": 120, "start": 728.92, "end": 733.16, "text": "wir haben 35 Minuten geschwätzt, ich werd das ein bisschen schneiden, ein bisschen kürzer"}, {"id": 121, "start": 733.16, "end": 739.64, "text": "schneiden, doch, er hat es bei mir gemeldet im Discord und wir haben ein bisschen so gelabert"}, {"id": 122, "start": 739.64, "end": 744.32, "text": "was so gewesen ist und was er jetzt, nachdem er da quasi nicht bei uns übernommen wurde,"}, {"id": 123, "start": 744.32, "end": 748.08, "text": "was er gemacht hat und sowas, ich muss jetzt aber erst noch mal schneiden, ich werd das"}, {"id": 124, "start": 748.08, "end": 752.36, "text": "Video, kommt dann wahrscheinlich so Montag, Dienstag oder Mittwoch mal gucken, ich muss"}, {"id": 125, "start": 752.36, "end": 757.24, "text": "unbedingt was hochladen, ich hab schon 10 Tage nichts mal hochgeladen, immer noch Dauer,"}, {"id": 126, "start": 757.24, "end": 764.16, "text": "Corona hier, ja, nice, da brauch ich aber einen guten Titel für, irgendwie sowas wie"}, {"id": 127, "start": 764.16, "end": 774.2, "text": "ex Azubi packt aus oder irgendwie sowas, weiß ja nicht genau wie, ach jetzt wo ich"}, {"id": 128, "start": 774.2, "end": 778.52, "text": "grad dabei bin, hat die GameStar eigentlich mittlerweile eine Bewertung für das Diablo"}, {"id": 129, "start": 778.52, "end": 790.72, "text": "Remake, was ist neu, Tests, haben die sowas, Diablo, 82, ach okay, hab immer gespannt,"}, {"id": 130, "start": 790.72, "end": 801.28, "text": "Test lesen, alter, geht dann halt nicht, ich kauf mir jetzt kein GameStar Plus, Azubi redet"}, {"id": 131, "start": 801.28, "end": 814.48, "text": "Klartext in Caps, ach das ist beides gute Ideen, finde ich nice, ja wenn die dafür"}, {"id": 132, "start": 814.48, "end": 820.2, "text": "was haben wollen, hab ich jetzt keinen Bock das zu kaufen, ja, weil, was hältst du mittlerweile"}, {"id": 133, "start": 820.2, "end": 826.08, "text": "von New World, da ist doch, ist da nicht jetzt Release morgen oder heute oder so sogar, nee"}, {"id": 134, "start": 826.08, "end": 836.2, "text": "übermorgen, Dienstag, Dienstag ist Release, ganz ehrlich, ich bin mal gespannt ob sie"}, {"id": 135, "start": 836.2, "end": 841.12, "text": "die Kurve kriegen, also ich hab, ich persönlich glaube ja nach wie vor, also ich muss, da"}, {"id": 136, "start": 841.12, "end": 845.2, "text": "muss ich jetzt grad so ein bisschen aussuchen, also ich hab ja mal vor einer ganzen Weile"}, {"id": 137, "start": 845.2, "end": 850.52, "text": "im Stream gesagt, du weißt wo es den Clickbait Helfer gibt, ja naja lass dich ruhig aus,"}, {"id": 138, "start": 850.52, "end": 854.04, "text": "ich hab mal vor einer ganzen Weile im Stream gesagt, das ist das einzige MMO den ich irgendwas"}, {"id": 139, "start": 854.04, "end": 859.52, "text": "zutraue so an neuen Releases, aber das war lange lange her, noch bevor sie quasi versucht"}, {"id": 140, "start": 859.52, "end": 864.48, "text": "haben auf jeder Hochzeit zu tanzen mit diesem Spiel, von Open World PvP bis PvP Schlachten"}, {"id": 141, "start": 864.48, "end": 872.2, "text": "bis Solo Questing, Group Questing, Group PvM Content, Group Raids, Group Dungeons, Housing,"}, {"id": 142, "start": 872.2, "end": 876.76, "text": "Player Build, Economy, also die wollen ja alles mittlerweile machen bei New World, so"}, {"id": 143, "start": 876.76, "end": 880.86, "text": "und da hab ich halt jetzt meine Zweifel, dass es funktioniert, weil Spiele die alles machen"}, {"id": 144, "start": 880.86, "end": 887.64, "text": "wollen, machen im Prinzip nix richtig, meistens, mag Ausnahmen geben, aber meistens, so und"}, {"id": 145, "start": 887.64, "end": 892.16, "text": "außerdem muss ich dazu sagen, dass ich finde, das ist jetzt so eine subjektive Sache, ich"}, {"id": 146, "start": 892.16, "end": 897.92, "text": "hab ja auch die Beta nicht so ultra lange gegrindet, aber, dass die Charaktere und"}, {"id": 147, "start": 897.92, "end": 901.64, "text": "die Welt überhaupt nicht zusammen passen, die Welt an sich finde ich ganz ok, auch wenn"}, {"id": 148, "start": 901.64, "end": 910.64, "text": "ich dieses Pirates Wild Wests Kolonial Setting jetzt nicht so geil finde, aber die Charaktere"}, {"id": 149, "start": 910.64, "end": 915.84, "text": "passen teilweise überhaupt nicht rein, ich frag mich eh, was ist das für ne Mischung,"}, {"id": 150, "start": 915.84, "end": 924.16, "text": "das hab ich bis heute nicht verstanden, entweder machst du so nen Fantasy Mittelalter MMO,"}, {"id": 151, "start": 924.16, "end": 932.68, "text": "aber da kannst du keine Musketen und so rein packen, das ist so ne ganz komische Mischung,"}, {"id": 152, "start": 932.68, "end": 942.12, "text": "ich finde einfach, dass Heilshauber, also Damage Zauber, Heilshauber, Schwerter, Musketen,"}, {"id": 153, "start": 942.12, "end": 948.22, "text": "Gewehre, das passt nicht zusammen, ich, das mag ja Gameplay technisch eventuell irgendwie"}, {"id": 154, "start": 948.22, "end": 954.96, "text": "nochmal zusammenführen, aber ich find das passt nicht zusammen, die machen natürlich"}, {"id": 155, "start": 954.96, "end": 961.52, "text": "mit New World auch ein paar ganz gute Sachen, dass es zum ersten Mal seit langem wieder"}, {"id": 156, "start": 961.52, "end": 966.12, "text": "ein MMO ist, was wirklich auf Group Content bzw. auf Player Interaction in irgendeiner"}, {"id": 157, "start": 966.12, "end": 971.52, "text": "Art und Weise basiert, ja, du musst ja total viel, du musst traden mit den Leuten zum Beispiel,"}, {"id": 158, "start": 971.52, "end": 975.28, "text": "du musst Quests dann zusammen machen, einer muss zum Board rennen und so was, das ist"}, {"id": 159, "start": 975.28, "end": 981.76, "text": "mehr Player orientiert als anonymer Dungeon Finder oder wir questen die ganze Zeit solo"}, {"id": 160, "start": 981.76, "end": 987.2, "text": "oder sowas, das find ich an sich gut, aber ich glaube das passt nicht und auch wenn ich"}, {"id": 161, "start": 987.2, "end": 992.2, "text": "dir am Anfang was zugetraut hab, ich glaube das Game wird, spätestens wenn die ganzen"}, {"id": 162, "start": 992.2, "end": 998.16, "text": "Streamer, ne ich kaufs mir nicht, spätestens wenn die ganzen Streamer abspringen, was relativ"}, {"id": 163, "start": 998.16, "end": 1002.2, "text": "denke ich mal, also die größeren, relativ schnell passieren wird, werden auch die ganzen"}, {"id": 164, "start": 1002.2, "end": 1007.72, "text": "anderen Leute leaven, man muss ihn aber zugute halten, also was ich da wirklich cool finde,"}, {"id": 165, "start": 1007.72, "end": 1009.8, "text": "die hören ja schon ein bisschen auf die Leute."}, {"id": 166, "start": 1009.8, "end": 1017.56, "text": "Nettles, du hast doch nur 5 Minuten gespielt, ja 5 Minuten gespielt, dann hast du nie wieder"}, {"id": 167, "start": 1017.56, "end": 1018.56, "text": "eingeloggt, oder?"}, {"id": 168, "start": 1018.56, "end": 1024.08, "text": "Du hast auch gar nichts mitgekriegt, oder gut vielleicht hast du ja danach noch gespielt,"}, {"id": 169, "start": 1024.08, "end": 1032.8, "text": "ich hab, war nicht dabei, kann ja sein, was wollte ich jetzt sagen, ja also die Streamer"}, {"id": 170, "start": 1032.8, "end": 1035.12, "text": "werden abspringen, da werden auch die ganzen Leute abspringen, aber die hören ja schon"}, {"id": 171, "start": 1035.12, "end": 1042.72, "text": "ein bisschen so auf die Community, zum Beispiel, dass es ja wohl Language Server geben wird,"}, {"id": 172, "start": 1042.72, "end": 1051.92, "text": "das ist ne Sache, die fehlt mir bei vielen MMOs oder dass es zumindest Server geben wird,"}, {"id": 173, "start": 1051.92, "end": 1056.88, "text": "die nen Language Tag dran haben, also du kannst natürlich schon als Franzose auf dem deutschsprachigen"}, {"id": 174, "start": 1056.88, "end": 1061.28, "text": "Server spielen umgedreht, aber es stehen Language Tags dran, das find ich cool, das fehlt mir"}, {"id": 175, "start": 1061.28, "end": 1067.48, "text": "bei ganz vielen MMOs, weil ich hab einige MMOs gespielt, auch gerade mit Famiya zusammen,"}, {"id": 176, "start": 1067.48, "end": 1071.76, "text": "internationale Server sind nicht verkehrt, das hat den Vorteil, du musst nicht so früh"}, {"id": 177, "start": 1071.76, "end": 1076.16, "text": "Server merken, du hast keine Sprachprobleme, du kannst alles immer auf Englisch machen,"}, {"id": 178, "start": 1076.16, "end": 1081.64, "text": "das ist schon nicht verkehrt, aber ganz ehrlich, ich fühle mich auf nem internationalen Server"}, {"id": 179, "start": 1081.64, "end": 1087.68, "text": "nicht so richtig heimisch wie auf nem deutschsprachigen Server, es ist einfach, also als Native Speaker,"}, {"id": 180, "start": 1087.68, "end": 1093.4, "text": "weiß ich nicht, wie soll ich das erklären, so dieses ganze, während du questest, während"}, {"id": 181, "start": 1093.4, "end": 1099.88, "text": "du Monster killst, so ein bisschen nebenbei chatten, das geht einfach einfacher und besser"}, {"id": 182, "start": 1099.88, "end": 1106.6, "text": "flüssiger von der Hand, wenn das auf Deutsch ist, zumal man auch nicht vergessen darf,"}, {"id": 183, "start": 1106.6, "end": 1112.36, "text": "dass, oh das können wir tatsächlich mal ne Umfrage machen, das ist ne gute Umfrage,"}, {"id": 184, "start": 1112.36, "end": 1117.96, "text": "ich mach mal, ich mach mal eine, warte mal, wir machen jetzt wirklich mal ne Umfrage,"}, {"id": 185, "start": 1117.96, "end": 1119.76, "text": "wird New World ein Erfolg?"}, {"id": 186, "start": 1119.76, "end": 1127.28, "text": "Ah nein, wir können keine Prediction machen, weil Predictions, ist schwierig für so Digger"}, {"id": 187, "start": 1127.28, "end": 1135.48, "text": "jetzt, so, mal umfragen, bin immer gespannt was ihr sagt, also ich hab jetzt nicht mehr"}, {"id": 188, "start": 1135.48, "end": 1145.72, "text": "Halsweh, aber ich hab immer noch, wir hätten auch noch ne dritte Antwort, was juckt's mich,"}, {"id": 189, "start": 1145.72, "end": 1148.52, "text": "wobei es in dem Fall eigentlich blöd ist, weil dann müsste ich auch sagen, was juckt's"}, {"id": 190, "start": 1148.52, "end": 1155.8, "text": "mich, ich werd's erstmal nicht spielen, also ich geh davon aus, ich warte mal bis es zur"}, {"id": 191, "start": 1155.8, "end": 1164.68, "text": "Hälfte durch ist, ja, das glaub ich nämlich auch nicht, also, ja, das ist jetzt halt dem"}, {"id": 192, "start": 1164.68, "end": 1177.92, "text": "Nächsten und mal gucken, das ist ja schlimm, voll am verrecken hier, das ist mega ungesund"}, {"id": 193, "start": 1177.92, "end": 1184.28, "text": "an, ich weiß, aber ich hab nix, nützt kein Corona, ich hab ja extra Corona-Tests gemacht"}, {"id": 194, "start": 1184.28, "end": 1195.32, "text": "auch vor ein paar Tagen, sowas wird in die Nase stecken, GSTW, ich war schon wählen,"}, {"id": 195, "start": 1195.32, "end": 1206.76, "text": "ich hab Brief gewählt, ja, ich bin auch geimpft, ich bin doppelt geimpft, das ist schon ein"}, {"id": 196, "start": 1206.76, "end": 1211.92, "text": "paar Wochen her und ich hab einen Corona-Test gemacht, also ich habe, auch wenn sie vielleicht"}, {"id": 197, "start": 1211.92, "end": 1223.32, "text": "so anhört, definitiv kein Corona, ich hab mich nicht impfen lassen, um sympathisch zu"}, {"id": 198, "start": 1223.32, "end": 1229.24, "text": "sein, ich hab mich impfen lassen, dass ich nicht sterbe, aber ja, ich versteh gar nicht"}, {"id": 199, "start": 1229.24, "end": 1233.84, "text": "dieses ewig rumdiskutieren bei dem Geimpfen, so nach dem Motto, ich lass mich für die Allgemeinheit"}, {"id": 200, "start": 1233.84, "end": 1237.56, "text": "impfen, bla bla bla, die können mich alle mal, die Allgemeinheit kann mich, ich hab"}, {"id": 201, "start": 1237.56, "end": 1241.84, "text": "mich einfach nur impfen lassen, dass ich nicht sterbe, ist das zu wenig Anreiz oder was?"}, {"id": 202, "start": 1241.84, "end": 1256.68, "text": "Einfach, einfach, don't die, easy, easy win, oh nice, Trimmy Z10 Pro, hat schon mal richtig,"}, {"id": 203, "start": 1256.68, "end": 1268.88, "text": "hat schon mal richtig Porras Namen das Ding, kostet was, Bots 10, ja, Customfirmer, GitHub,"}, {"id": 204, "start": 1268.88, "end": 1282.16, "text": "gleich mal gucken, Jithub, wirklich schlimmer, so, also, New World, der Chat ist da bei mir"}, {"id": 205, "start": 1282.16, "end": 1288.36, "text": "ungefähr, wir runden mal ein bisschen auf, ein Drittel sagt, ein Viertel sagt, ja, wird"}, {"id": 206, "start": 1288.36, "end": 1294.36, "text": "wahrscheinlich, drei Viertel sagen, ne, wahrscheinlich nicht, ich glaube es ist tatsächlich, die"}, {"id": 207, "start": 1294.36, "end": 1298.0, "text": "Wahrheit liegt irgendwo in der Mitte, ich glaube nicht, dass Amazon relativ schnell"}, {"id": 208, "start": 1298.0, "end": 1302.88, "text": "New World einstellt, man darf nicht vergessen, Amazon hat nichts auf die Reihe, also Amazon"}, {"id": 209, "start": 1302.88, "end": 1307.48, "text": "hat nichts geschissen bekommen bisher, wie hieß das, wie hieß dieser Overwatch Crucible,"}, {"id": 210, "start": 1307.48, "end": 1313.92, "text": "dieser Overwatch, äh, war nicht mal Overwatch abklatscht, dieser Overwatch MOBA-Verschnitt,"}, {"id": 211, "start": 1313.92, "end": 1316.72, "text": "in seiner Versuchtheit zum Overwatch Crucible, das hat sie noch nicht mal, noch nicht mal"}, {"id": 212, "start": 1316.72, "end": 1321.6, "text": "irgendwie zu einem Release geschafft, vorbei, so, und ihre andere Deserter Ringe MMO haben"}, {"id": 213, "start": 1321.6, "end": 1326.44, "text": "sie eingestellt, das ist das einzige, was sie haben, und ich glaube, die werden weiterhin"}, {"id": 214, "start": 1326.44, "end": 1335.52, "text": "Geld reinpumpen und auch, äh, durchaus, Spieler erreichen damit, glaube ich, glaube ich, aber"}, {"id": 215, "start": 1335.52, "end": 1339.12, "text": "New World, auch wenn sie sich das vielleicht erhoffen, wird definitiv nicht das nächste"}, {"id": 216, "start": 1339.12, "end": 1352.28, "text": "Millionen-Subscription-MMO werden, glaube ich nicht, ich glaube, das wird schon seine"}, {"id": 217, "start": 1352.28, "end": 1356.24, "text": "Spieler-Base halten, also ab einem gewissen Zeitpunkt, am Anfang wird es natürlich erstmal"}, {"id": 218, "start": 1356.24, "end": 1361.0, "text": "krass fallen, so wie das immer ist, zu Release, spiel immer die Meister und fällt das erstmal,"}, {"id": 219, "start": 1361.0, "end": 1366.4, "text": "außer, außer du bist World of Warcraft und machst quasi, erfindest quasi so eine eigene"}, {"id": 220, "start": 1366.4, "end": 1373.48, "text": "Welt, ähm, neu für dich, eigene, eigene Spielekategorie, weil ich nicht sagen will,"}, {"id": 221, "start": 1373.48, "end": 1376.44, "text": "dass World of Warcraft MMOs erfunden hat, das weiß ich, glaube ich, am besten, ich war"}, {"id": 222, "start": 1376.44, "end": 1381.12, "text": "schon pre-World of Warcraft MMOs am Start, aber für viele haben MMOs halt quasi mit"}, {"id": 223, "start": 1381.12, "end": 1385.84, "text": "WoW gestartet und bei WoW war es halt so, die haben angefangen, schon mit gutem Hype, hatten"}, {"id": 224, "start": 1385.84, "end": 1389.48, "text": "viele Spieler, dann ist es vielleicht ein bisschen runtergegangen, aber dann ist es einfach,"}, {"id": 225, "start": 1389.48, "end": 1393.48, "text": "es ist konstant, drei, vier Jahre ist das, BÄM, bis 11 Millionen draufgegangen, das"}, {"id": 226, "start": 1393.48, "end": 1396.48, "text": "werden wir, glaube ich, so schnell bei einem MMO auch nicht mehr sehen, oder 15 Millionen,"}, {"id": 227, "start": 1396.48, "end": 1402.0, "text": "sogar, ich weiß gar nicht, was Spitzen-Subscriptions in World of Warcraft waren, keine Ahnung."}, {"id": 228, "start": 1402.0, "end": 1408.2, "text": "Ja, zumindest, ich glaube, das Game wird weiter existieren, es wird fallen und dann wird es"}, {"id": 229, "start": 1408.2, "end": 1412.82, "text": "auf einer relativ guten, ähm, ja, weiß ich nicht, ob das eine gute Basis für die ist,"}, {"id": 230, "start": 1412.82, "end": 1418.36, "text": "aber ich denke mal, auf einer ganz, ganz brauchbaren Spieler-Basis hängen bleiben."}, {"id": 231, "start": 1418.36, "end": 1425.64, "text": "Die ganzen Kacknoobs auf Twitter, die werden instant-leaven, weil das, was ich von New World"}, {"id": 232, "start": 1425.64, "end": 1429.88, "text": "bisher mitgekriegt habe, ist, dass es kein Babysitter MMO ist und die ganzen Kacknoobs"}, {"id": 233, "start": 1429.88, "end": 1434.84, "text": "auf Twitter, die wollen Babysitter MMOs spielen, die spielen sowas wie ESO, wo du Solo-Questen"}, {"id": 234, "start": 1434.84, "end": 1440.68, "text": "kannst und alles im Easy-Mode erledigen und sobald du quasi mal groupen musst für irgendwie"}, {"id": 235, "start": 1440.68, "end": 1444.24, "text": "einen Dungeon, sind sie am rumheulen, so nach dem Motto, oh mein Gott, ich arbeite doch am"}, {"id": 236, "start": 1444.24, "end": 1448.16, "text": "Tag zwölf Stunden, ich kann doch nicht abends noch zwei Stunden gruppen suchen, das ist"}, {"id": 237, "start": 1448.16, "end": 1453.12, "text": "so casual, feindlich, lull, your game sucks, ja, das, ich glaube, die werden in New World"}, {"id": 238, "start": 1453.12, "end": 1458.88, "text": "nicht glücklich, das habe ich soweit, das habe ich soweit schon in der Beta mitgekriegt,"}, {"id": 239, "start": 1458.88, "end": 1464.36, "text": "dass es eben ein Spiel ist, was ersten Spieler-Interaktion fördert und nicht so sehr Babysitter MMO ist."}, {"id": 240, "start": 1464.36, "end": 1493.12, "text": "Ja, da gehe ich mal voraus, joa, ähm, ansonsten, ja, es ist halt, also, ich meine, ich meine,"}, {"id": 241, "start": 1493.12, "end": 1498.32, "text": "ich, man kann sich, ich muss jetzt noch was sagen, man kann sich da jetzt drüber streiten,"}, {"id": 242, "start": 1498.32, "end": 1504.88, "text": "ob das im Jahr 2021 noch für ein Game gut ist, wenn du zwei Stunden Gruppen bauen musst,"}, {"id": 243, "start": 1504.88, "end": 1510.52, "text": "aber, ich denke mal, mit einem Spiel, was wirklich Player-Interaktion und nicht anonymes"}, {"id": 244, "start": 1510.52, "end": 1516.2, "text": "Dungeon-Finden oben anstellt, da werden sich relativ schnell auch die Leute zusammen finden,"}, {"id": 245, "start": 1516.2, "end": 1519.2, "text": "die gut zusammen spielen können, die was taugen, also du wirst sofort erkennen, wer sind die"}, {"id": 246, "start": 1519.2, "end": 1521.76, "text": "Kacknoobs, mit denen willst du nicht spielen, wer sind die guten Leute, mit denen willst"}, {"id": 247, "start": 1521.76, "end": 1527.0, "text": "du spielen und dann hast du relativ schnell Groups zusammen und es wird wie immer so sein,"}, {"id": 248, "start": 1527.0, "end": 1533.0, "text": "die 0815 Casual Noobs brauchen halt für alles zwei Monate und die guten Leute finden sich"}, {"id": 249, "start": 1533.0, "end": 1538.08, "text": "in irgendwelchen Groups, Guilden, Discords, wie auch immer zusammen und spielen das Spiel"}, {"id": 250, "start": 1538.08, "end": 1544.6, "text": "in zwei Wochen durch, es wird so sein wie immer und die einzige Chance als Kacknoob in so"}, {"id": 251, "start": 1544.6, "end": 1551.88, "text": "eine Pro-Gilde, Pro-Progress-Leute zu kommen ist, wenn du sagst, ich bin ein Gamer-E-Grill"}, {"id": 252, "start": 1551.88, "end": 1557.08, "text": "und verschicke, keine Ahnung, Fotos oder so und dann sagen alle, oh ja, du kannst bei"}, {"id": 253, "start": 1557.08, "end": 1561.84, "text": "uns mit trainen, kein Problem, ja wir haben heute, wir haben eh einen freien Slot, willst"}, {"id": 254, "start": 1561.84, "end": 1565.16, "text": "du dich bei uns in der Gruppe mitmachen, das funktioniert, aber als normaler Casual-Spieler"}, {"id": 255, "start": 1565.16, "end": 1573.12, "text": "hast du dann da keine Chance und so ist es in MMOs halt, was meint ihr, wie viele Leute"}, {"id": 256, "start": 1573.12, "end": 1580.08, "text": "es gab, die sich in allen MMOs in Startgebiet gestellt haben, haben sich den weiblichen"}, {"id": 257, "start": 1580.08, "end": 1586.68, "text": "Charakter gemacht und haben dann im Chat rumgeschrieben, hihi, hallo, hallo Leute, hihi, ich bin ein"}, {"id": 258, "start": 1586.68, "end": 1591.36, "text": "Mädchen, ich hab grad das MMO angefangen, wie fange ich denn jetzt am besten an, hihi,"}, {"id": 259, "start": 1591.36, "end": 1596.52, "text": "kann mir irgendjemand das Spiel zeigen und instant 50 Leute drum herum, ah ich geb dir"}, {"id": 260, "start": 1596.52, "end": 1600.48, "text": "Startgear, ich geb dir Startgear, ah hier komm mal, kriegst du mal 5 Gold, gehst du"}, {"id": 261, "start": 1600.48, "end": 1603.6, "text": "zum Händler, kaufst du das, was ich kann nicht übrigens ziehen auf Level 50, gar kein"}, {"id": 262, "start": 1603.6, "end": 1614.6, "text": "Problem, ja, so ist das, hihi, genau hier, hihi, so ist das gewesen und so ist das immer"}, {"id": 263, "start": 1614.6, "end": 1623.76, "text": "noch in MMOs, ja, ist halt einfach so, so und ich glaube, dass New World dementsprechend"}, {"id": 264, "start": 1623.76, "end": 1628.12, "text": "diese Leute schon erreichen wird, aber was wovon ich nicht ausgehe, ist, dass die ganzen"}, {"id": 265, "start": 1628.12, "end": 1631.8, "text": "Noob, geh mal doch mal hier Noob, ich bin jetzt grad so ein bisschen im uplaster Modus,"}, {"id": 266, "start": 1631.8, "end": 1642.52, "text": "aber das müssen wir jetzt mal, New World, EU, ne, ach wie heißt denn dieser deutsche"}, {"id": 267, "start": 1642.52, "end": 1652.0, "text": "New World Account auf Twitter, Twitter, New World, Europe, Germany, hier, ist doch, da"}, {"id": 268, "start": 1652.0, "end": 1658.72, "text": "ist er, hier, Play New World, ah nein, das ist auf, was zum Teufel, warum ist das hier"}, {"id": 269, "start": 1658.72, "end": 1669.84, "text": "auf Deutsch und auf Englisch, hier New World de, da ist es doch, hey in MMOs, das ist was,"}, {"id": 270, "start": 1669.84, "end": 1675.12, "text": "was natürlich in keiner Reportage dran kommt, ja, aber in MMOs, wenn man, wenn man damit"}, {"id": 271, "start": 1675.12, "end": 1681.0, "text": "klar kommt, dass man permanent 200 notgeile Kerle hinter sich herrennt, hat, kann man das"}, {"id": 272, "start": 1681.0, "end": 1685.2, "text": "in MMOs glaube ich so krass ausnutzen wie in keinem anderen Spielegenre, du musst ja"}, {"id": 273, "start": 1685.2, "end": 1688.04, "text": "noch nicht mal eine Frau sein, du musst ja einfach nur so tun, als bist du eine Frau"}, {"id": 274, "start": 1688.04, "end": 1691.36, "text": "und dich ins Startgebiet stellen und sagen, hihi ich weiß nicht wie das Spiel geht, kann"}, {"id": 275, "start": 1691.36, "end": 1697.6, "text": "mir das jemand zeigen, du hast instant 200 Leute am Start, das war schon immer so in"}, {"id": 276, "start": 1697.6, "end": 1704.96, "text": "MMOs, das wird schon immer so sein, so und ja, wenn man hier mal so durchscrollt auf"}, {"id": 277, "start": 1704.96, "end": 1710.2, "text": "Twitter, so die, so die ganzen Casual Noobs, keine Ahnung ob das alles Casual Noobs sind,"}, {"id": 278, "start": 1710.2, "end": 1713.72, "text": "ich weiß nicht, ich will jetzt die Leute nicht so sehr flamen vielleicht, sie sind wahrscheinlich"}, {"id": 279, "start": 1713.72, "end": 1717.72, "text": "weniger Noobs als ich in dem Game, weil ich hab da überhaupt keine Ahnung von, zumindest"}, {"id": 280, "start": 1717.72, "end": 1721.96, "text": "was ich bei MMOs halt immer lustig finde, gerade wenn sie, oder was ich bei Spielen"}, {"id": 281, "start": 1721.96, "end": 1726.68, "text": "immer lustig finde, so, so, gerade wenn sie Streamer, Streamer Events machen und das werden"}, {"id": 282, "start": 1726.68, "end": 1729.6, "text": "sie, das haben sie ja bei New World gemacht und das werden sie wahrscheinlich bei New"}, {"id": 283, "start": 1729.6, "end": 1737.48, "text": "World auch wieder machen, Streamer, weiß nicht ob das, ob da wieder was, was kommt"}, {"id": 284, "start": 1737.48, "end": 1745.56, "text": "in der Richtung, also sollten die, sollten die wieder Streamer Events machen, dann kann"}, {"id": 285, "start": 1745.56, "end": 1751.0, "text": "ich jedem nur empfehlen, geht, wenn ihr wollt auf einen Streaming, auf einen Server von,"}, {"id": 286, "start": 1751.0, "end": 1758.88, "text": "von Streamern, aber geht bloß nicht in die gleiche Fraktion von Streamern, du hast einfach"}, {"id": 287, "start": 1758.88, "end": 1762.96, "text": "so viele Casual Noob Fanboys, das ist der Wahnsinn, also je nachdem, man muss gucken"}, {"id": 288, "start": 1762.96, "end": 1768.96, "text": "was es für ein Streamer ist, wenn es irgendwelche MMO Streamer sind oder so, was weiß ich, wenn"}, {"id": 289, "start": 1768.96, "end": 1773.88, "text": "ihr, wenn ihr um Asmongold als 200 Spieler Traube rumstehen wollt und auf jeden Schritt"}, {"id": 290, "start": 1773.88, "end": 1777.76, "text": "hinterher rennen wollt, ja meinetwegen macht's, aber wenn ihr sinnvolle Brokers machen wollt"}, {"id": 291, "start": 1777.76, "end": 1784.36, "text": "in einem Game, dann geht nichts in die Spielerfraktion, äh in die Streamerfraktion, die Streamerfraktion"}, {"id": 292, "start": 1784.36, "end": 1791.24, "text": "ist voller Casual Kacknoobs, die Streamerfraktion ist voller nerviger Fanboys und Leuten, die"}, {"id": 293, "start": 1791.24, "end": 1799.8, "text": "spielen können, das ist einfach so, was auf Streamer Sonne, was für ein Ding, Streamer"}, {"id": 294, "start": 1799.8, "end": 1824.88, "text": "Sonne, achso, Streamers on new, achso, nicht Streamer Sonne, lul, ja verstehe, ja und es"}, {"id": 295, "start": 1824.88, "end": 1829.96, "text": "ist so, und man hat's ja auch gesehen, was, dreimal dürft ihr raten, was meint ihr, also"}, {"id": 296, "start": 1829.96, "end": 1834.92, "text": "in New World gibt's ja drei Fraktionen, die PvP und eroberungsmäßig nebeneinander spielen,"}, {"id": 297, "start": 1834.92, "end": 1841.28, "text": "was meint ihr, welche Fraktion hat auf dem Streamer Server in der Beta am schlechtesten"}, {"id": 298, "start": 1841.28, "end": 1848.56, "text": "abgeschnitten, es gab zur Auswahl deutsche Streamer und deutsche Fanboys, äh Pro Gamer"}, {"id": 299, "start": 1848.56, "end": 1853.28, "text": "Franzosen und die dritten hab ich vergessen, was meint ihr wer gewonnen hat oder was meint"}, {"id": 300, "start": 1853.28, "end": 1861.16, "text": "ihr, wer mit Abstand auf dem letzten Platz war, genau, mit Abstand auf dem letzten Platz"}, {"id": 301, "start": 1861.16, "end": 1868.0, "text": "in der Beta, mit Abstand, mit so Leuten kannst du nicht spielen, ich sag nicht die Streamer,"}, {"id": 302, "start": 1868.0, "end": 1870.6, "text": "mit den Fanboys kannst du nicht spielen, mit den meisten Streamern, die verdienen ja ihr"}, {"id": 303, "start": 1870.6, "end": 1873.6, "text": "Geld mit Spielen, die sind in der Regel sowas, wenn sie öfters MMO spielen, gar nicht mal"}, {"id": 304, "start": 1873.6, "end": 1877.08, "text": "so schlecht, die Franzosen haben gewonnen und wisst ihr warum die Franzosen gewonnen"}, {"id": 305, "start": 1877.08, "end": 1882.88, "text": "haben, soweit ich das verfolgt hab bei New World, die Franzosen haben gewonnen, ähm,"}, {"id": 306, "start": 1882.88, "end": 1889.08, "text": "weil sie Theorie gecraftet haben, ein Skill, der sämtlichen Noob Fanboys komplett fremd"}, {"id": 307, "start": 1889.08, "end": 1894.2, "text": "ist, die gehen in das Game, gucken ihre Lieblingsstreamer und machen dann alles so nach wie das Streamer,"}, {"id": 308, "start": 1894.2, "end": 1897.48, "text": "der Streamer hat bloß in der Regel auch überhaupt keine Ahnung, was er macht, wenn du in einem"}, {"id": 309, "start": 1897.48, "end": 1902.0, "text": "MMO am Anfang gut starten willst, musst du zwei Dinger machen, du musst am besten die"}, {"id": 310, "start": 1902.0, "end": 1905.48, "text": "Beta gespielt haben vorher und das zweite ist, wenn du die Beta nicht gespielt hast,"}, {"id": 311, "start": 1905.48, "end": 1909.44, "text": "selbst wenn du die Beta gespielt hast, du musst Patch Notes verfolgen und du musst Theorie"}, {"id": 312, "start": 1909.44, "end": 1914.28, "text": "craften as fuck, du musst zwei Wochen vor Release, du musst dir jegliche Patch Notes"}, {"id": 313, "start": 1914.28, "end": 1918.96, "text": "durchlesen, die neu kommen, du musst dir genau angucken, was haben Leute rausgefunden, was"}, {"id": 314, "start": 1918.96, "end": 1923.64, "text": "ist da wie irgendwie am schnellsten, was sind die OP Skill Kombis, was sind die OP Level"}, {"id": 315, "start": 1923.64, "end": 1932.64, "text": "Spot und dann musst du einfach 24, das auch, wenn das Spiel rauskommt, du musst 24-7 grinden"}, {"id": 316, "start": 1932.64, "end": 1937.88, "text": "und den OP Shit machen, dann bist du vorne, was meint ihr, wie das die auch die ganzen"}, {"id": 317, "start": 1937.88, "end": 1942.16, "text": "erfolgreichen Streamer machen, na gut, die werden ein bisschen gecarried, aber die ganzen"}, {"id": 318, "start": 1942.16, "end": 1947.76, "text": "erfolgreichen MMO Spieler oder sei es Leak Starter in Path of Exile, die machen das so,"}, {"id": 319, "start": 1947.76, "end": 1954.88, "text": "die haben Ahnung von dem Game, dass bei MMOs das, was bei Shootern, hauptsächlich mal"}, {"id": 320, "start": 1954.88, "end": 1961.24, "text": "Mechanics von Aiming ist und natürlich auch so ein bisschen Map Knowledge und sonst was,"}, {"id": 321, "start": 1961.24, "end": 1968.08, "text": "das gibt es ja in MMO in der Art und Weise nicht, in MMOs Game Knowledge ist das mit Abstand"}, {"id": 322, "start": 1968.08, "end": 1973.28, "text": "wichtigste, wer keine Ahnung hat von dem Game, kann viel grinden und es bringt ihm nichts,"}, {"id": 323, "start": 1973.28, "end": 1977.12, "text": "du musst in MMOs, du musst Ahnung haben vom Game, du musst wissen, wo die OP Spots sind,"}, {"id": 324, "start": 1977.12, "end": 1981.64, "text": "du musst wissen, wie du irgendwie irgendwelche Quests klitscht oder so, übertrieben gesagt"}, {"id": 325, "start": 1981.64, "end": 1988.64, "text": "und dann musst du 24-7 OP Shit grinden, am besten, dass du durch den Content bist, bevor"}, {"id": 326, "start": 1988.64, "end": 1992.7, "text": "sie es patchen, weil meistens patchen sie das, wenn irgendwas kaputt ist und genauso"}, {"id": 327, "start": 1992.7, "end": 1996.08, "text": "haben es übrigens die Franzosen auch gemacht in der New World Alpha, Beta, wie auch immer"}, {"id": 328, "start": 1996.08, "end": 2005.04, "text": "das war, die haben das, wie ist das in New World, dieses Quest Board total Abused, die"}, {"id": 329, "start": 2005.04, "end": 2009.56, "text": "haben einfach ihre Top Level Leute an das Quest Board gestellt und hatten irgendwie"}, {"id": 330, "start": 2009.56, "end": 2012.72, "text": "halb Frankreich, die in New World für sie rumgerannt sind und Quests erledigt haben"}, {"id": 331, "start": 2012.72, "end": 2016.28, "text": "und die Leute sind ans Quest Board und haben es abgegeben, also die Typen standen eigentlich"}, {"id": 332, "start": 2016.28, "end": 2021.16, "text": "nur den ganzen Tag am Quest Board in der Stadt und haben Quests abgegeben, die andere Leute"}, {"id": 333, "start": 2021.16, "end": 2026.18, "text": "für sie in der Welt erledigt haben, eigentlich Big Brain, das haben sie dann gepatcht und"}, {"id": 334, "start": 2026.18, "end": 2032.68, "text": "was war, die deutschen Streamer Fanboy Fraktion, die hat es erst gecheckt, dass man dieses"}, {"id": 335, "start": 2032.68, "end": 2038.04, "text": "Quest Board ausnutzen kann, als es schon wieder gepatcht war, Pech gehabt, so gewinnst du"}, {"id": 336, "start": 2038.04, "end": 2043.28, "text": "in MMOs nicht, ja aber ich werde es trotzdem nicht spielen, ich werde es wahrscheinlich"}, {"id": 337, "start": 2043.28, "end": 2049.08, "text": "ein bisschen am Rande beobachten und ich gehe ziemlich sicher aus, dass ich richtig liege,"}, {"id": 338, "start": 2049.08, "end": 2052.52, "text": "die deutschen Streamer Fraktion wird übrigens abkacken, nicht, obwohl gesagt, nicht wegen"}, {"id": 339, "start": 2052.52, "end": 2058.98, "text": "den Streamern, an denen liegt es gar nicht, das liegt an den unfähigen Leuten, die quasi"}, {"id": 340, "start": 2058.98, "end": 2070.76, "text": "dann dazu kommen, ja gut, genug abgelästert über deutsche Streamer Fanboys und New World"}, {"id": 341, "start": 2070.76, "end": 2078.2, "text": "und Zeug, hat jemand von euch Ahnung von der Heizung, weiß jemand, wie man Heizkennlinien"}, {"id": 342, "start": 2078.2, "end": 2084.84, "text": "richtig einstellt, meine Heizung wird nämlich zu heiß mit dieser Außentemperatur, ich"}, {"id": 343, "start": 2084.84, "end": 2091.6, "text": "glaube da ist irgendwas blöd eingestellt und ich habe erfahren, wo ist jetzt die Heizkennlinie"}, {"id": 344, "start": 2091.6, "end": 2098.92, "text": "muss man einstellen, dunkles Design Google haben wir doch schon längst, die Heizungsboys"}, {"id": 345, "start": 2098.92, "end": 2107.92, "text": "genau, also ich weiß, wie es geht, ich bin aber nicht ganz sicher, was ich da standardmäßig"}, {"id": 346, "start": 2107.92, "end": 2136.76, "text": "einstellen soll, na gut, dann gucken wir mal was, wir gucken, ja, wie gesagt, wie geht es"}, {"id": 347, "start": 2136.76, "end": 2140.08, "text": "so, wie man das an der Heizung einstellt, angeschlossen ist, funktioniert, tut es auch,"}, {"id": 348, "start": 2140.08, "end": 2144.12, "text": "ich gehe davon aus, die Heizung wird einfach zu warm, weil Pumpe und so funktioniert alles,"}, {"id": 349, "start": 2144.12, "end": 2150.72, "text": "Heizungen werden auch warm, Fack dein Schornsteinfeger, Lul, Schornsteinfeger hat davon auch keine"}, {"id": 350, "start": 2150.72, "end": 2159.24, "text": "Ahnung, der Schornsteinfeger, der kommt einmal, fragt mich nicht, alle zwei Jahre, guckt auf"}, {"id": 351, "start": 2159.24, "end": 2165.52, "text": "irgendwelche Dinger im Keller und dann geht er wieder, weiß nicht, was der macht, Schornsteinfeger"}, {"id": 352, "start": 2165.52, "end": 2174.2, "text": "kann sein, das glaube ich auch Lizenz zum Geld drucken, ja, richtige Monkastier Musik"}, {"id": 353, "start": 2174.2, "end": 2181.0, "text": "hier, oh ne, den darf ich hier nicht einblenden, das sieht ja aus, als würde Monkastier fast"}, {"id": 354, "start": 2181.0, "end": 2193.2, "text": "Schicko überfahren, Moment, Moment, das müssen wir umpositionieren, so, ok, also was können"}, {"id": 355, "start": 2193.2, "end": 2197.0, "text": "wir uns denn heute mal angucken, YouTube Refresh, vielleicht haben wir ja Glück und es kommt"}, {"id": 356, "start": 2197.0, "end": 2203.6, "text": "noch irgendwas Gescheites, wo ich sagen muss, jawoll, das müssen wir gucken, Redis in 100"}, {"id": 357, "start": 2203.6, "end": 2223.76, "text": "Sekunden, nope, no pass, Fake News, das Sonic Colors Desaster, wusste ich gar nicht, dass"}, {"id": 358, "start": 2223.76, "end": 2229.0, "text": "das so schlecht ist, kam Sonic Colors nicht sogar ganz gut an oder ist das jetzt neu,"}, {"id": 359, "start": 2229.0, "end": 2234.8, "text": "oder bringe ich das durcheinander, was, Sonic Colors nicht das Fan, das Fan Sonic, was"}, {"id": 360, "start": 2234.8, "end": 2240.12, "text": "dann, was sie dann gekauft haben und gesagt haben, wir bringen das selbst raus, oder bringe"}, {"id": 361, "start": 2240.12, "end": 2256.68, "text": "ich, ach keine Ahnung, erstmal jetzt zur Wahlurne, ja ich hab schon, ich hab schon Briefwahl,"}, {"id": 362, "start": 2256.68, "end": 2281.6, "text": "der Markt regelt das, ne ist ja wieder nur Müll dabei, bloß ich muss mal kurz Katzenvideo"}, {"id": 363, "start": 2281.6, "end": 2288.96, "text": "gucken, die sieht ein bisschen aus wie meine erste Katz, nicht ganz so weiß, ein bisschen"}, {"id": 364, "start": 2288.96, "end": 2308.68, "text": "größer aber, och ja, ein feiner, oder feine, das erkennt man ja nicht unbedingt, jetzt"}, {"id": 365, "start": 2308.68, "end": 2315.96, "text": "will er nicht mehr, auf Kommando, auf Kommando will man nicht, ne ne, ok, so, gucken wir uns"}, {"id": 366, "start": 2315.96, "end": 2323.52, "text": "mal irgendwas an, was haben wir hier, wir lassen uns vor Level Cap jebaiten, wir lassen uns"}, {"id": 367, "start": 2323.52, "end": 2338.6, "text": "vor Level Cap jebaiten, auf gehts, der tägliche Level Cap jebait, ja das ist ja nichts neues,"}, {"id": 368, "start": 2338.6, "end": 2344.16, "text": "ist, ist das, ist das, Intel ist back on top, da hab ich so meine Zweifel, wer ist da gesponsert"}, {"id": 369, "start": 2344.16, "end": 2359.64, "text": "von Intel, oder, oder, Intel hat was rausgebracht, was 5000 Euro kostet und ist jetzt on top,"}, {"id": 370, "start": 2359.64, "end": 2366.08, "text": "ah immer noch, ok, sowas, sowas dauert ja auch ne ganze Weile, das muss ja, gerade wenn"}, {"id": 371, "start": 2366.08, "end": 2387.96, "text": "das was von der Regierung ist, ich glaube gerade so Prozesse dauert ewig, ja Disclosure, was,"}, {"id": 372, "start": 2387.96, "end": 2393.64, "text": "was hätte Blizzard denn da bitteschön Disclosen sollen, hätten die sagen sollen, achja, übrigens"}, {"id": 373, "start": 2393.64, "end": 2399.2, "text": "bei uns werden systematisch Mitarbeiter belästigt, was ist, als würde Blizzard sowas Disclosen"}, {"id": 374, "start": 2399.2, "end": 2423.36, "text": "sein, Alter, ja haben sie recht, das ist, das ist, das ist, das ist ederwitz, ne, das erste"}, {"id": 375, "start": 2423.36, "end": 2430.96, "text": "was Blizzard gemacht hat ist, ehm, irgendeinen, irgendeinen komischen Anwaltkanzlei zu, zu"}, {"id": 376, "start": 2430.96, "end": 2436.36, "text": "engagieren, die erstmal dafür sorgt, dass da möglichst wenig an, an die, ans Licht"}, {"id": 377, "start": 2436.36, "end": 2441.96, "text": "kommt, ist halt, naja gut, aber gut, was wird man denn anders erwarten, also, es ist, es"}, {"id": 378, "start": 2441.96, "end": 2446.88, "text": "ist leider, leider überall so, das, es wird, egal wie offensichtlich es ist, es wird erstmal"}, {"id": 379, "start": 2446.88, "end": 2452.76, "text": "abgestritten, guckt euch das mal an, es ist egal, ob jetzt irgendwelche, eh, von Maskenaffäre"}, {"id": 380, "start": 2452.76, "end": 2462.32, "text": "bis, bis, was, was hatten wir denn sonst noch für Dinger in letzter Zeit, ja, Abgas, Skandal,"}, {"id": 381, "start": 2462.32, "end": 2465.72, "text": "was auch immer, ist eigentlich wurscht, es wird immer gesagt, es wird immer gesagt,"}, {"id": 382, "start": 2465.72, "end": 2468.84, "text": "nein, nein, da ist überhaupt nichts dran, das kann, kann nicht sein, nein, niemals,"}, {"id": 383, "start": 2468.84, "end": 2471.92, "text": "niemals, sowas, sowas gibt es bei uns nicht, nein, nein, nein, nein, nein, das ist nicht"}, {"id": 384, "start": 2471.92, "end": 2477.44, "text": "so, so, da kommt raus, oh fuck, das ist doch so, ehm, dann wird gesagt, ehm, doch, da werden"}, {"id": 385, "start": 2477.44, "end": 2481.76, "text": "wir jetzt aber ganz entschieden dagegen vorgehen, das kann ja nicht angehen, dass das ist, aber"}, {"id": 386, "start": 2481.76, "end": 2485.72, "text": "ich wusste davon nichts, aber ich, ich wusste davon nichts, kommt dann immer, ich, nein,"}, {"id": 387, "start": 2485.72, "end": 2491.28, "text": "nein, nein, nein, ich wusste davon nichts und als nächstes kommt dann die Geschichte"}, {"id": 388, "start": 2491.28, "end": 2497.72, "text": "mit so, ah ja, ok, wir haben das jetzt aufgearbeitet und wir haben rausbekommen, ehm, die da waren"}, {"id": 389, "start": 2497.72, "end": 2502.88, "text": "dafür verantwortlich, dann werden dann irgendwelche Leute gefeuert, aber ich, aber ich als Obermanager,"}, {"id": 390, "start": 2502.88, "end": 2507.2, "text": "ich wusste davon natürlich gar nichts, wobei ich diese Aussage, ich verstehe übrigens"}, {"id": 391, "start": 2507.2, "end": 2514.28, "text": "nicht, warum die Leute da nicht mehr öfters, ehm, drauf angesprochen werden und zwar finde"}, {"id": 392, "start": 2514.28, "end": 2518.6, "text": "ich das äußerst befremdlich, wenn du als Obermanagements, ehm, Typ sagen kannst, wusste"}, {"id": 393, "start": 2518.6, "end": 2524.04, "text": "ich nichts von, denn es gibt, es gibt eigentlich nur zwei Sachen, entweder du wusstest es"}, {"id": 394, "start": 2524.04, "end": 2528.08, "text": "und lügst die Leute jetzt gezielt an, was, was die wahrscheinlicher ist, was die wahrscheinlichere"}, {"id": 395, "start": 2528.08, "end": 2533.36, "text": "Sache ist oder die Frage ist, was machst du für einen scheiß Job als Obermanager, wenn"}, {"id": 396, "start": 2533.36, "end": 2541.28, "text": "du von nichts was weißt, also, das ist eigentlich, es ist eigentlich beides eine ziemlich beschissen"}, {"id": 397, "start": 2541.28, "end": 2562.32, "text": "Antwort, naja, weiter, das ist halt nicht so, das ist, diese Statements sind immer so für"}, {"id": 398, "start": 2562.32, "end": 2568.36, "text": "den Arsch, so nach dem Motto, okay, wir haben euch jetzt, also das ist ungefähr so, wie"}, {"id": 399, "start": 2568.36, "end": 2573.72, "text": "wenn ich, was weiß ich, da fällt mir jetzt kein gutes Beispiel ein, wenn ich bei Rot"}, {"id": 400, "start": 2573.72, "end": 2579.24, "text": "über die Straße fahre, so, und danach kommt die Polizei und sagt, hey, wir haben sie"}, {"id": 401, "start": 2579.24, "end": 2585.36, "text": "fotografiert, sie sind bei Rot über die Straße gefahren und dann sag ich, Leute, das kann"}, {"id": 402, "start": 2585.36, "end": 2592.48, "text": "nicht sein, bei Rot über die Straße fahren, das hat keinen Platz in meinem Leben, das"}, {"id": 403, "start": 2592.48, "end": 2598.56, "text": "ist genau so eine Antwort, das ergibt überhaupt keinen Sinn, also, tut doch, es ergibt Sinn,"}, {"id": 404, "start": 2598.56, "end": 2603.12, "text": "es klingt beschwichtigend irgendwie bei manchen Leuten, aber es ist einfach bescheuert."}, {"id": 405, "start": 2603.12, "end": 2631.32, "text": "Ja, das haben sie gemacht, aber warum, warum haben sie das gemacht, weil es zu negativ"}, {"id": 406, "start": 2631.32, "end": 2641.36, "text": "war mittlerweile, als hätte das da Bobby nicht gewusst, oder zumindest nicht, als hätte"}, {"id": 407, "start": 2641.36, "end": 2646.28, "text": "er da nicht was gegen machen können, das ist ihm vollkommen egal und auch diese ganzen"}, {"id": 408, "start": 2646.28, "end": 2651.32, "text": "Aktionen, diese ganzen Aktionen, die jetzt durchgeführt werden, ja, von Blizzard Chef"}, {"id": 409, "start": 2651.32, "end": 2657.32, "text": "geht, bis zu McCree wird umbenannt und sowas, über die Aktionen kann man geteilter Meinung"}, {"id": 410, "start": 2657.32, "end": 2661.28, "text": "sein, aber das sind keine Aktionen, die irgendwelche Leuten letztendlich was bringen, das sind"}, {"id": 411, "start": 2661.28, "end": 2669.36, "text": "rein so, wir tun was, also davon wird keiner, der Opfer dieser Sachen geworden ist, irgendwie"}, {"id": 412, "start": 2669.36, "end": 2674.8, "text": "sich besser fühlen, das ist nur, um der Öffentlichkeit zu zeigen, guckt mal, hier, wir nehmen das"}, {"id": 413, "start": 2674.8, "end": 2680.36, "text": "ernst, wir tun da jetzt was dagegen, das ist so reine Beschwichtigungssache, nix anderes."}, {"id": 414, "start": 2680.36, "end": 2710.12, "text": "Ja, du bist müde, wir machen ja Aufwachen-Stream, fast ist ja, ist jemand, jetzt wollte ich das"}, {"id": 415, "start": 2710.12, "end": 2715.2, "text": "hier gerade im Hintergrund sehen, ist jemand, schafft es jemand, noch negativer gehyped"}, {"id": 416, "start": 2715.2, "end": 2724.2, "text": "zu sein über Vanguard als ich, dieses Spiel juckt mich absolut Null, Nullst sozusagen,"}, {"id": 417, "start": 2724.2, "end": 2729.4, "text": "am Nulligsten juckt mich das, das ist mir vollkommen egal."}, {"id": 418, "start": 2729.4, "end": 2749.16, "text": "Ich bin mal gespannt."}, {"id": 419, "start": 2749.16, "end": 2762.12, "text": "Ich bin mal gespannt, ich bin mal gespannt, wie sie das mit Halo mit Crossplay machen"}, {"id": 420, "start": 2762.12, "end": 2763.12, "text": "wollen."}, {"id": 421, "start": 2763.12, "end": 2768.16, "text": "Wahrscheinlich habt ihr das, wisst ihr das nicht mehr, sie haben damals zu Halo 3 Zeiten"}, {"id": 422, "start": 2768.16, "end": 2774.84, "text": "versucht, intern wohl, PC versus, und Halo 3, also wer mal Halo auf der Konsole gespielt"}, {"id": 423, "start": 2774.84, "end": 2782.84, "text": "hat, das hat Ultra-Aim-Assist, also ich glaube es gibt kaum ein Game, was so krasses Sticky-Aim-Assist"}, {"id": 424, "start": 2782.84, "end": 2791.16, "text": "hat wie Halo, das ist wirklich der Wahnsinn, also, na gut, man muss sagen, man kann das"}, {"id": 425, "start": 2791.16, "end": 2795.24, "text": "nicht so wirklich mit dem Call of Duty-Aim-Assist vergleichen, der Call of Duty-Aim-Assist auf"}, {"id": 426, "start": 2795.24, "end": 2799.2, "text": "der Konsole, da gibt's ja Videos wo sich quasi das Fadenkreuz, wenn du auf den Gegner bist,"}, {"id": 427, "start": 2799.2, "end": 2806.72, "text": "von alleine bewegt, das ist bei Halo nur sehr begrenzt so, aber bei Halo ist Stick dein"}, {"id": 428, "start": 2806.72, "end": 2814.32, "text": "Fadenkreuz so richtig hart an dem, ist schwierig zu beschreiben, an dem Gegnermodel und die"}, {"id": 429, "start": 2814.32, "end": 2819.88, "text": "Schüsse in Halo, gerade in Halo 3, die mussten auch nicht so ultragenau sein, also die Hitboxen"}, {"id": 430, "start": 2819.88, "end": 2821.36, "text": "waren schon sehr forgiving."}, {"id": 431, "start": 2821.36, "end": 2826.8, "text": "Und zumindest, die haben das ja da intern damals getestet, PC versus, die wollten ja"}, {"id": 432, "start": 2826.8, "end": 2830.96, "text": "damals zu Halo 3-Zeiten schon Crossplay machen, die haben das getestet, die haben gesagt,"}, {"id": 433, "start": 2830.96, "end": 2835.84, "text": "das können wir nicht machen, die Konsolenspieler werden hoffnungslos zerstört."}, {"id": 434, "start": 2835.84, "end": 2842.08, "text": "So, und, mal gespannt, mal gespannt, wie sie das hier hinbekommen."}, {"id": 435, "start": 2842.08, "end": 2856.72, "text": "Games wie Halo, man kann das nicht so direkt vergreifen, man kann das, man kann das nicht"}, {"id": 436, "start": 2856.72, "end": 2863.28, "text": "so direkt vergreifen, ja ja, den Tweet kenne ich, achso, den kenne ich nicht, ich hab mich"}, {"id": 437, "start": 2863.28, "end": 2871.24, "text": "verguckt, warte mal, schauen wir mal, schauen wir mal, guck ich mir gleich an, fuck, Leute,"}, {"id": 438, "start": 2871.24, "end": 2874.32, "text": "ich bin absolut nicht mehr multitaskingfähig, ich hab vergessen, was ich sagen wollte, nachdem"}, {"id": 439, "start": 2874.32, "end": 2875.32, "text": "ich mir das hier angeguckt hab."}, {"id": 440, "start": 2875.32, "end": 2891.92, "text": "Ja, genau, das ist halt Halo, das ist halt so der typische Halo, okay, das ist krass,"}, {"id": 441, "start": 2891.92, "end": 2896.52, "text": "das ist krass, aber das war, genau so hat sich das in Halo immer angefühlt, also Halo"}, {"id": 442, "start": 2896.52, "end": 2900.08, "text": "ist halt super sticky zu den Gegnermodels."}, {"id": 443, "start": 2900.08, "end": 2911.44, "text": "Ja, ist so, war im Prinzip schon immer so, und selbst da hat es nicht funktioniert mit"}, {"id": 444, "start": 2911.44, "end": 2915.28, "text": "versus PC-Spielen, ich mein, krasseren Aim Assist kannst du eigentlich gar nicht mehr"}, {"id": 445, "start": 2915.28, "end": 2916.28, "text": "machen."}, {"id": 446, "start": 2916.28, "end": 2922.08, "text": "So, und der Vergleich Warzone, Halo passt ja in dem Fall auch nicht, Warzone ist ja ein"}, {"id": 447, "start": 2922.08, "end": 2931.8, "text": "deutlich langsameres, zumindest vom Aufbau her, Game, nicht dass Warzone nicht auch schnelle"}, {"id": 448, "start": 2931.8, "end": 2937.36, "text": "Momente hätte, aber Warzone ist ein deutliches, wie soll man sagen, taktischeres Movement"}, {"id": 449, "start": 2937.36, "end": 2944.64, "text": "Game, Map Control Game, als es jetzt Halo ist, Halo ist viel näher dran an dem, was"}, {"id": 450, "start": 2944.64, "end": 2948.44, "text": "du beispielsweise bei Quake 3 hattest, vielleicht nicht den ganzen übertrieben, also viel mehr"}, {"id": 451, "start": 2948.44, "end": 2954.84, "text": "Arena-mäßig, und da hat der Movement Vorteil, und allein schon, was du alles von deiner Umgebung"}, {"id": 452, "start": 2954.84, "end": 2961.16, "text": "mitbekommst, PC, Tastatur, Maus versus Controller, ich kann mir einfach nicht vorstellen, dass"}, {"id": 453, "start": 2961.16, "end": 2965.72, "text": "das gut funktioniert, egal, lassen wir es uns mal auf uns zukommen."}, {"id": 454, "start": 2965.72, "end": 2970.76, "text": "Unfortunately, the playtests aren't going to be live 24-7 throughout their duration."}, {"id": 455, "start": 2970.76, "end": 2975.32, "text": "Matchmaking will be limited to a specific window per day, that said, the times are pretty"}, {"id": 456, "start": 2975.32, "end": 2979.92, "text": "generous and cover the most popular gaming times. The standout improvement that I think"}, {"id": 457, "start": 2979.92, "end": 2984.04, "text": "many players are hoping to see this round of testing is better performance. The first"}, {"id": 458, "start": 2984.04, "end": 2989.12, "text": "playtest had some bizarre FPS and latest issues that severely impacted the overall experience"}, {"id": 459, "start": 2989.12, "end": 2993.36, "text": "for many players. Players discovered workarounds for some of the problems towards the end of"}, {"id": 460, "start": 2993.36, "end": 2997.96, "text": "the test, which could be a positive sign for this round of testing."}, {"id": 461, "start": 2997.96, "end": 3000.48, "text": "Intel's bringing some heat with their latest CPU."}, {"id": 462, "start": 3000.48, "end": 3005.52, "text": "Im wahrsten Sinne des Wortes, wahrscheinlich wird der Gramm wieder 105 Grad heiß."}, {"id": 463, "start": 3005.52, "end": 3011.28, "text": "Coming 1.2900K is beating AMD's top-end 5950X in pre-release benchmarks."}, {"id": 464, "start": 3011.28, "end": 3012.28, "text": "In was?"}, {"id": 465, "start": 3012.28, "end": 3014.52, "text": "The data has been leaked thanks to the ashes of Singularity."}, {"id": 466, "start": 3014.52, "end": 3016.16, "text": "Muss man gucken, in was?"}, {"id": 467, "start": 3016.16, "end": 3017.16, "text": "In was?"}, {"id": 468, "start": 3017.16, "end": 3021.8, "text": "The benchmark and shows a 4,000 point lead with the new Intel chip."}, {"id": 469, "start": 3021.8, "end": 3028.64, "text": "It's tough to say how meaningful these numbers are though, AMD have dominated the CPU market"}, {"id": 470, "start": 3028.64, "end": 3032.48, "text": "for the past year or so when it comes to the price to performance ratio."}, {"id": 471, "start": 3032.48, "end": 3037.76, "text": "Ich glaube, dass es ja immer noch so sein wird. Also eins was Ryzen halt richtig gut"}, {"id": 472, "start": 3037.76, "end": 3042.6, "text": "gemacht hat, wo wir eigentlich alle AMD, ich mein dankbar ist ein dummes Wort, weil letztendlich"}, {"id": 473, "start": 3042.6, "end": 3046.2, "text": "kaufen wir den Scheiß immer noch für richtig fett Geld, aber ich sag's jetzt trotzdem"}, {"id": 474, "start": 3046.2, "end": 3050.84, "text": "mal. Also eine Sache, wo man AMD tatsächlich dankbar sein muss, ist, dass sie mit dafür"}, {"id": 475, "start": 3050.84, "end": 3053.88, "text": "gesorgt haben, dass Intel nicht mehr den Scheiß machen kann, sie die letzten Jahre"}, {"id": 476, "start": 3053.88, "end": 3060.12, "text": "übergemacht haben. Wenn AMD nicht am Start gewesen wäre, dann hätten wir heute sechs"}, {"id": 477, "start": 3060.12, "end": 3065.52, "text": "Kern-CPUs im Desktop, aber nur, wenn du High-End kaufst. Vielleicht, wenn du Ultra-High-End"}, {"id": 478, "start": 3065.52, "end": 3073.2, "text": "kaufst, acht Kerne. Intel hat ja keine Anstalten gemacht, da was dran zu ändern. Dann kam"}, {"id": 479, "start": 3073.2, "end": 3077.56, "text": "AMD um die Ecke und hat gesagt, bam, zwölf Kerne für die Hälfte, na ja übertrieben"}, {"id": 480, "start": 3077.56, "end": 3081.96, "text": "gesagt, nicht für die Hälfte des Preises, aber AMD hat gesagt, bam, zwölf Kerne zu"}, {"id": 481, "start": 3081.96, "end": 3089.24, "text": "ordentlichem Preis. Und daraufhin hat Intel ja erst angefangen, jetzt diese Sachen quasi"}, {"id": 482, "start": 3089.24, "end": 3093.44, "text": "auch in die Richtung zu gehen, dass es mehr Kerne gibt. Wir haben so lang, wir haben so"}, {"id": 483, "start": 3093.44, "end": 3099.16, "text": "lang auf Maximum vier Kerne in der Mittelklasse rumgekrebst, auf dem Desktop, das ist nicht"}, {"id": 484, "start": 3099.16, "end": 3103.92, "text": "normal gewesen. Ich hab dann 8700K, da hatte sechs Kerne, es war damals von hui hui hui"}, {"id": 485, "start": 3103.92, "end": 3121.26, "text": "hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui"}, {"id": 486, "start": 3121.26, "end": 3126.84, "text": "hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui"}, {"id": 487, "start": 3126.84, "end": 3131.44, "text": "hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui hui swatch"}, {"id": 488, "start": 3131.44, "end": 3136.76, "text": "Wo ich mal vergesse nicht südrig südrig sind die vm geschichten sirex wie hießen die noch mal"}, {"id": 489, "start": 3138.88, "end": 3140.88, "text": "Sirex"}, {"id": 490, "start": 3140.92, "end": 3145.68, "text": "Die sag mal so bis zur pentium zeiten auch noch ganz ganz cool war"}, {"id": 491, "start": 3147.56, "end": 3154.2, "text": "Es gab ja auch mal mehr grafikkarten hersteller also mehr grafikkarten chip hersteller als nvidia und amd"}, {"id": 492, "start": 3154.2, "end": 3161.04, "text": "Weil heute gibt es heute gibt es heute gibt es noch intel aber intel ist ja quasi eher integriert oder halt viele leute haben da on board oder"}, {"id": 493, "start": 3161.04, "end": 3163.04, "text": "eine cpu grafikkarte aber"}, {"id": 494, "start": 3163.56, "end": 3168.28, "text": "Externe grafikkarten hast du heute im prinzip zu 99 prozent hast du amd oder nvidia"}, {"id": 495, "start": 3169.48, "end": 3173.68, "text": "Und damals hast du manchmal auch s3 hießen die glaube matrox"}, {"id": 496, "start": 3174.76, "end": 3176.84, "text": "Und so die waren alle ganz gut damals mit dabei"}, {"id": 497, "start": 3177.8, "end": 3179.8, "text": "und die hatten auch recht recht"}, {"id": 498, "start": 3179.8, "end": 3186.48, "text": "Coole innovationen diese ganze cp diese ganze textur kompression hat ja damals"}, {"id": 499, "start": 3191.0, "end": 3193.52, "text": "Ja das haben wir damals mit erfunden"}, {"id": 500, "start": 3195.28, "end": 3197.28, "text": "S3 graphics"}, {"id": 501, "start": 3197.76, "end": 3205.92, "text": "Da konntest du zum ersten mal quasi an texturen dann ran laufen und hast sie dann wirklich hoch aufgelöst gesehen so also die waren richtig"}, {"id": 502, "start": 3205.92, "end": 3210.08, "text": "Die waren richtig gut dabei aber die haben alle wudu gab es noch ja"}, {"id": 503, "start": 3211.0, "end": 3219.16, "text": "Die haben es aber alle nicht überlebt gegen amd und nvidia und amd muss man ehrlich sagen hat es auch nicht so wirklich überlebt gegen nvidia"}, {"id": 504, "start": 3219.68, "end": 3227.88, "text": "Was grafikkarten top performance angeht also die haben schon lange zeit mann die sind jetzt mittlerweile wieder halbwegs konkurrenzfähig aber die haben ganz ganz lange zeit"}, {"id": 505, "start": 3228.6, "end": 3234.16, "text": "Nicht mehr die top grafikkarten gestellt und nvidia macht es übrigens mein amt muss ich jetzt mal"}, {"id": 506, "start": 3234.16, "end": 3236.88, "text": "nvidia macht es meiner meinung nach auch echt clever"}, {"id": 507, "start": 3237.68, "end": 3242.24, "text": "nvidia hat nicht nur super performance leider mittlerweile grafikkartenpreise komplett durch die deckel"}, {"id": 508, "start": 3243.32, "end": 3250.92, "text": "Was auch nicht ganz unschuldig dran sind aber nvidia macht es clever die machen die verlassen sich nicht nur drauf dass ihre grafikkarten top performance"}, {"id": 509, "start": 3251.04, "end": 3254.32, "text": "liefern die haben auch zusätzliche funktionen mittlerweile noch von"}, {"id": 510, "start": 3255.36, "end": 3258.32, "text": "shadowplay bis zu rtx voice und sonst"}, {"id": 511, "start": 3258.32, "end": 3264.68, "text": "rtx geschichten sonst was ja amd zieht da in manchen bereichen nach und gerade was shadowplay angeht"}, {"id": 512, "start": 3264.68, "end": 3270.48, "text": "Da hat amd mittlerweile auch was aber das ist hat nie so den so den anklang gefunden wie die sachen von von nvidia"}, {"id": 513, "start": 3270.56, "end": 3276.92, "text": "Und das ist halt auch was was den kram mit verkauft natürlich das erste was die leute haben wollen bei einer grafikkarte ist erst mal volle pulle"}, {"id": 514, "start": 3276.92, "end": 3282.64, "text": "Ja muss preisleistungsmäßig am besten fette performance das muss sein 1080 ti war damals ein super ding"}, {"id": 515, "start": 3282.64, "end": 3289.04, "text": "Da habe ich ja immer noch bis heute habe ich euch eigentlich erzählt das ea mir fürs battlefield testen den pc schicken wollte"}, {"id": 516, "start": 3289.12, "end": 3293.16, "text": "Weil ich 1080 ti habe und mindestens anforderungen war 20 60"}, {"id": 517, "start": 3296.08, "end": 3298.08, "text": "Das habe ich glaube ich schon erzählt"}, {"id": 518, "start": 3301.16, "end": 3302.6, "text": "Naja"}, {"id": 519, "start": 3302.6, "end": 3304.6, "text": "Aber ich habe ich schon ja"}, {"id": 520, "start": 3304.6, "end": 3312.6, "text": "Aber so immer aber ich glaube jetzt haben sie es mittlerweile eingesehen ja das erzählst du seit vier streams ja ist auch lustig"}, {"id": 521, "start": 3314.32, "end": 3316.08, "text": "Naja so"}, {"id": 522, "start": 3316.08, "end": 3317.36, "text": "zumindest"}, {"id": 523, "start": 3317.36, "end": 3320.72, "text": "Was wollte ich jetzt gerade sagen das ist halt auch was was grafikkarten zählt"}, {"id": 524, "start": 3321.64, "end": 3324.4, "text": "Nix wegen rtx die wussten das einfach nicht besser ist ja auch nicht schlimm"}, {"id": 525, "start": 3325.2, "end": 3331.16, "text": "Das ist halt das auch was grafikkarten mit verkauft klar preisleistung in performance auf jeden fall kitkarte dankeschön fünf monat subscription"}, {"id": 526, "start": 3331.16, "end": 3333.16, "text": "Hüsch"}, {"id": 527, "start": 3333.92, "end": 3338.76, "text": "Aber halt auch die zusatzfunktionen und ich muss euch ehrlich sagen wenn ich die auswahl hätte zwischen der amd"}, {"id": 528, "start": 3338.76, "end": 3343.44, "text": "Highend grafikkarte an wieder highend grafikkarte ich würde mir tatsächlich es sei denn es macht so einen riesen"}, {"id": 529, "start": 3343.96, "end": 3346.84, "text": "Preislichen unterschied ich würde mir auch die wieder grafikkarte kaufen"}, {"id": 530, "start": 3347.6, "end": 3349.6, "text": "torrad hin 18 und"}, {"id": 531, "start": 3349.6, "end": 3350.92, "text": "kruf elektrik"}, {"id": 532, "start": 3350.92, "end": 3356.24, "text": "hütsch abscriptions dangeleute so jetzt gucken wir jetzt mal das video fertig ich bin ja wieder am schwätzen und wir haben erst vier minuten geguckt"}, {"id": 533, "start": 3356.24, "end": 3357.52, "text": "Hardcore"}, {"id": 534, "start": 3357.52, "end": 3360.08, "text": "overclocking intels next generation alder lake"}, {"id": 535, "start": 3360.08, "end": 3366.44, "text": "Sie haben immer so die glückliche leute von außen und even if intel reclaimed the top spot it might not be for long"}, {"id": 536, "start": 3366.44, "end": 3371.28, "text": "Hätte das nicht auch sind sie nicht auch immer so mit euren freunden im freien vom notebook"}, {"id": 537, "start": 3371.88, "end": 3373.88, "text": "also falls man freunde hat"}, {"id": 538, "start": 3374.16, "end": 3378.28, "text": "So so genau so im freien und ich freue mich dann und lacht dann und gucke ins notebook und je"}, {"id": 539, "start": 3379.52, "end": 3380.72, "text": "immer"}, {"id": 540, "start": 3380.72, "end": 3387.56, "text": "alder lake cpus launch on october 27 and even if intel reclaimed the top spot it might not be for long"}, {"id": 541, "start": 3387.84, "end": 3394.48, "text": "amd have already announced a new stacked chipset design based on current gen ryzen which is launching in the next few months"}, {"id": 542, "start": 3394.8, "end": 3402.12, "text": "this new design offers a big performance bump and will probably be put to even greater use in amd's next generation of chips"}, {"id": 543, "start": 3402.96, "end": 3405.44, "text": "yesterday's update of apex legends fix"}, {"id": 544, "start": 3405.44, "end": 3412.4, "text": "herr matchmaking issues that basically broke the entire game for meine beziehung zu apex ist irgendwie komisch ich habe es nie gespielt"}, {"id": 545, "start": 3412.4, "end": 3414.4, "text": "aber ich finde es ist das beste"}, {"id": 546, "start": 3414.68, "end": 3416.68, "text": "battle royale"}, {"id": 547, "start": 3416.88, "end": 3418.28, "text": "sie wie fail aber"}, {"id": 548, "start": 3418.28, "end": 3425.36, "text": "Ich weiß ich ich also wenn ich mir was angucke ich finde es ist auch am schönsten zuzugucken einfach weil sich permanent was tut da bewegt"}, {"id": 549, "start": 3425.36, "end": 3429.04, "text": "sich was da wird rumgejammt da wird herumgeflogen nicht da wird"}, {"id": 550, "start": 3429.04, "end": 3436.56, "text": "rumgesprungen und gemacht weiß ich für mich ist apex zum gucken dass das das beste real game warzone"}, {"id": 551, "start": 3437.16, "end": 3443.44, "text": "finde ich muss ich ehrlich sagen zum kuck kann man teilweise gucken finde ich aber zum gucken nicht so"}, {"id": 552, "start": 3443.72, "end": 3449.2, "text": "geil irgendwie ich verstehe dass ich da mehr spannung aufbauten warum das die leute gucken fortnight kann ich mir gar nicht angucken"}, {"id": 553, "start": 3450.28, "end": 3451.6, "text": "aber"}, {"id": 554, "start": 3451.6, "end": 3454.72, "text": "apex ist für mich das beste real auch wenn ich es nicht spiele"}, {"id": 555, "start": 3454.72, "end": 3457.72, "text": "klingt fail aber ja das"}, {"id": 556, "start": 3459.28, "end": 3461.28, "text": "Ja fortnight kann ich mir gar nicht angucken"}, {"id": 557, "start": 3462.56, "end": 3466.36, "text": "fortnight ganz ehrlich immer wenn ich fortnight in streams reingucke"}, {"id": 558, "start": 3466.72, "end": 3474.24, "text": "sehe ich leute die irgendwie eine halb blaue durchsichtige wand vor sich haben und holzplatten bauen"}, {"id": 559, "start": 3475.68, "end": 3480.36, "text": "und zwar und zwar nicht einfach und zwar nicht einfach holzplatten bauen sondern sondern"}, {"id": 560, "start": 3480.36, "end": 3487.52, "text": "kann man jetzt nicht nachmachen also die maus von den von den fortnight bauern die bewegt sich dann so die ganze zeit so die sind immer"}, {"id": 561, "start": 3487.52, "end": 3492.96, "text": "hin und her und wild am rumschwenken und also ich blicke da nicht durch"}, {"id": 562, "start": 3493.6, "end": 3501.0, "text": "ich weiß gar nicht ist wie fett ist dann fortnight noch auf auf twitch ich gehe mal davon aus es wird immer noch ganz vorne mit dabei sein"}, {"id": 563, "start": 3501.0, "end": 3517.0, "text": "raus games"}, {"id": 564, "start": 3517.0, "end": 3519.0, "text": "wo kann man denn hier nach spiele filtern"}, {"id": 565, "start": 3525.0, "end": 3527.0, "text": "normalerweise ist es immer auf der startseile"}, {"id": 566, "start": 3527.0, "end": 3530.0, "text": "ja ich sehe es ja man konnte doch nach spiele filtern"}, {"id": 567, "start": 3531.0, "end": 3535.0, "text": "ich sehe es denn das meine ich nicht man konnte doch immer nach spiel nach spielen filtern hier"}, {"id": 568, "start": 3537.0, "end": 3539.0, "text": "wow hier geht es ab"}, {"id": 569, "start": 3543.0, "end": 3552.0, "text": "hä nein du hast doch eine startseite du hast doch normalerweise eine startseite wo du endless scrollen kannst und nach nach nach"}, {"id": 570, "start": 3552.0, "end": 3557.0, "text": "zuschauer zahlen sortieren wo ist die denn hin ist die weg slash direkt"}, {"id": 571, "start": 3559.0, "end": 3569.0, "text": "das da meine ich genau das genau das genau das meine ich so viewers high to low also ja bloß resurrected das ist klar"}, {"id": 572, "start": 3570.0, "end": 3576.0, "text": "ich finde übrigens echt gutes remake im sinne des originals ich habe es jetzt ja auch mit dem friseur eine ganze weile gespielt"}, {"id": 573, "start": 3576.0, "end": 3587.0, "text": "aber ein paar sachen hätte man ohne probleme machen können für die apple 2 resurrected ja das ding hat bugs das hat teilweise richtig krasse bugs"}, {"id": 574, "start": 3587.0, "end": 3591.0, "text": "du joinst in games rein die nicht rein joinen willst und so was also ganz ganz ganz ganz ganz fail"}, {"id": 575, "start": 3592.0, "end": 3599.0, "text": "viele sachen sind halt schwachsinnig die brauchen wir nicht zum beispiel dass du keine games gescheit suchen kannst es ist kacke"}, {"id": 576, "start": 3599.0, "end": 3609.0, "text": "general slain 16 monat angeschön für den hyper subscription dass das inventar nicht größer geworden ist dass du keine loot filter installieren kannst"}, {"id": 577, "start": 3609.0, "end": 3612.0, "text": "was übrigens mit third party mods alles funktioniert"}, {"id": 578, "start": 3616.0, "end": 3626.0, "text": "ja übrigens das mit innen bevor die leute jetzt schreien sagen max inventarkröße geht doch gar nicht wer zu up doch geht beispielsweise in third party mods"}, {"id": 579, "start": 3626.0, "end": 3634.0, "text": "und servern zum beispiel pass of diablo haben sie das gut gelöst du hast ein doppelt so großes inventar gehabt aber du konntest trotzdem nur die maximale"}, {"id": 580, "start": 3634.0, "end": 3642.0, "text": "anscheinend an charms ins inventar machen also plus skills plus resis und so was wie du auch im original machen konntest im original haben die leute hier"}, {"id": 581, "start": 3642.0, "end": 3649.0, "text": "komplettes inf voll mit charms und nur noch den würfel für items das ist kacke also sie hätten ohne problemen das inventar vergrößern können"}, {"id": 582, "start": 3649.0, "end": 3657.0, "text": "kisten haben sie auch vergrößert ordentliche spiele suche hätte nicht geschadet auch ordentlichen input hätte nicht geschadet dass man die skills besser"}, {"id": 583, "start": 3657.0, "end": 3662.0, "text": "mappen kann support für loot filter und so was das hätte das spiel um ein vielfaches besser gemacht"}, {"id": 584, "start": 3663.0, "end": 3674.0, "text": "ja so wo ist fortnite hier immer noch ganz vorne dachte ich mir und eine sache mit der ich niemals gerechnet hätte ist dass minecraft im jahr 2021 immer noch so viele"}, {"id": 585, "start": 3674.0, "end": 3681.0, "text": "leute anzieht sowohl auf youtube als auch auf twitch das hätte ich schon vor zehn jahren oder war das rausgekommen ist nicht gedacht aber ist so"}, {"id": 586, "start": 3681.0, "end": 3683.0, "text": "ich gucke mir jetzt erst mal fertig"}, {"id": 587, "start": 3683.0, "end": 3690.0, "text": "the games most recent event update introduced bugs and server degradation that led to players getting booted from matches"}, {"id": 588, "start": 3690.0, "end": 3695.0, "text": "yesterdays update wasn't a complete fix but it seems to have solved the major issues"}, {"id": 589, "start": 3695.0, "end": 3704.0, "text": "das ist weil weil minecraft das liegt nicht an der grafik das liegt daran weil minecraft ist quasi ein wie soll man das sagen kann man sagen ein lifestyle für eine"}, {"id": 590, "start": 3704.0, "end": 3707.0, "text": "ganze generation"}, {"id": 591, "start": 3707.0, "end": 3713.0, "text": "das kann man schwer das kann man echt schwer vergleichen mit games bei uns zu unserer zeit"}, {"id": 592, "start": 3713.0, "end": 3722.0, "text": "es gab zu unserer also zu meiner zeit es gab natürlich schon krass angesagte games ja also minecraft ist doch man könnte sagen das world of warcraft"}, {"id": 593, "start": 3722.0, "end": 3732.0, "text": "der heutigen zeit was so den lifestyle und so das das game was die meisten ihrer generation geprägt hat"}, {"id": 594, "start": 3732.0, "end": 3736.0, "text": "das ist quasi vielleicht so vielleicht bei meiner generation und bisschen früher"}, {"id": 595, "start": 3736.0, "end": 3740.0, "text": "bisschen danach vielleicht sagen wir world of warcraft und heute ist es minecraft"}, {"id": 596, "start": 3740.0, "end": 3745.0, "text": "sagen wir so die die die letzten zehn jahre so"}, {"id": 597, "start": 3745.0, "end": 3752.0, "text": "was juckt mich apex"}, {"id": 598, "start": 3752.0, "end": 3760.0, "text": "das geht schon lange bloß auf steam nicht"}, {"id": 599, "start": 3760.0, "end": 3767.0, "text": "na gut warum gehts auf steam nicht ich gehe mal davon aus weil die spiele einfach voll verschlüsselt runterkommen und dann erst geguckt wird ok"}, {"id": 600, "start": 3767.0, "end": 3770.0, "text": "release datum hat er lizenz blablabla und dann wirds entschlüsselt"}, {"id": 601, "start": 3770.0, "end": 3775.0, "text": "und da haben sie wollten sie wahrscheinlich noch nicht junk base das ganze irgendwie machen bisher"}, {"id": 602, "start": 3775.0, "end": 3802.0, "text": "da haben sie wollten sie wahrscheinlich noch nicht junk base das ganze irgendwie machen bisher"}, {"id": 603, "start": 3802.0, "end": 3818.0, "text": "naja"}, {"id": 604, "start": 3818.0, "end": 3828.0, "text": "ich werde eh nicht upgraden bis nicht die erste update rollup raus ist aber dann dann wahrscheinlich schon"}, {"id": 605, "start": 3828.0, "end": 3847.0, "text": "ich wollte gerade sagen optisch sieht das richtig gut aus"}, {"id": 606, "start": 3847.0, "end": 3864.0, "text": "es gibt schlimmere vorbilder oder hat jemand von euch den des loop trailer gesehen und dachte auch das ist ein multiplayer spiel"}, {"id": 607, "start": 3864.0, "end": 3873.0, "text": "ursprünglich ist es ja eigentlich gar nicht es ist eigentlich hauptsächlich ein singleplayer game"}, {"id": 608, "start": 3873.0, "end": 3893.0, "text": "ich dachte auch an das aber ich dachte multiplayer"}, {"id": 609, "start": 3893.0, "end": 3905.0, "text": "ja chat bei uns auf der arbeit werden wir wahrscheinlich so wie ich unsere leute kenne auch die nächsten 15 jahre nicht updaten auf windows 11"}, {"id": 610, "start": 3905.0, "end": 3932.0, "text": "ja das das ist wichtig das ist wichtig noch mehr wollten kratzer in fortnite"}, {"id": 611, "start": 3932.0, "end": 3953.0, "text": "endlich endlich endlich endlich noch mehr bildung sagt ich als jemand der nie fortnite gespielt hat das ist der kund warum ich nicht gerne gucken"}, {"id": 612, "start": 3953.0, "end": 3970.0, "text": "so jetzt haben sie noch mal chance youtube uns irgendwas ordentliches vorzuschlagen"}, {"id": 613, "start": 3970.0, "end": 3985.0, "text": "auch hier was los katz"}, {"id": 614, "start": 3985.0, "end": 4002.0, "text": "es ist auch ein game wo sie es richtig verkackt haben ich weiß nicht ob irgendjemand von euch überhaupt von der existenz dieses games"}, {"id": 615, "start": 4002.0, "end": 4025.0, "text": "hinbekommen hat das ist glaube ich ein russisches entwickler studio und die haben zu zeiten diese dieses world war 3 game angekündigt als jeder gesagt hat wir möchten wieder ein modernes battlefield haben also so vor fünf jahren oder so oder vor vier jahren vier fünf jahren ewig her und dann war einfach funk stille und nie wieder was von gehört und jetzt wo 2042 kommt jetzt kommen sie ja aus der versenkung"}, {"id": 616, "start": 4025.0, "end": 4045.0, "text": "schlechteren schlechteren zeitpunkt hätte man wohl kaum erwischen können was hast du schon mitbekommen das bald ja welches anti cheat welches gibt ja gibt ja einige"}, {"id": 617, "start": 4045.0, "end": 4062.0, "text": "aber es gibt einige habe ich schon so einige verarschungen vom lockpicking lawyer den kann man auch gut nachmachen"}, {"id": 618, "start": 4062.0, "end": 4090.0, "text": "so also was gucken wir uns jetzt an gaming new fastest gaming monitor ihr wisst ich bin immer dafür zu haben für für neues high end gaming equipment und und mehr wiederholfrequenz auf bildschirm es hat sich die letzten jahre ja einiges getan der sprung von 60 auf 120 beziehungsweise 144 das kam so ungefähr zur gleichen zeit"}, {"id": 619, "start": 4090.0, "end": 4111.0, "text": "war hat die die gaming welt verändert kann man glaube ich sagen also 144 120 herz war einfach ein riesen sprung ich habe jetzt einen 200 was habe ich denn überhaupt 240 herz muss mal kurz gucken weiß gar nicht wo sieht man das jetzt überhaupt windows technisch hier"}, {"id": 620, "start": 4111.0, "end": 4140.0, "text": "advanced display settings hier 240 herz habe ich jetzt ja und da muss ich sagen man merkt das ich finde man merkt den unterschied immer noch aber bei weitem also mit riesem abstand nicht mehr so unterschiedlich wie jetzt beispielsweise von 60 auf 144 also der unterschied von 60 auf 144 sind absolut welten welten wenn irgendjemand den unterschied nicht sieht es gibt ja so leute"}, {"id": 621, "start": 4140.0, "end": 4169.0, "text": "es gibt ja so leute es gibt ja so leute die sagen sogar sie sehen den unterschied zwischen 30 und 60 nicht vielleicht kennt ihr das so wenn du dann zeigst du denen irgendwie eine animation mit 30 fps und eine animation mit 60 fps und die leute sagen das sieht für mich genauso aus ich sehe da keinen unterschied das ist doch das gleiche gibt es gibt es ja so und es gibt bestimmt auch leute die sagen sie sehen den unterschied sie fühlen den unterschied in games auch gerade mal schnell kamerawählen 62 und 144"}, {"id": 622, "start": 4169.0, "end": 4198.96, "text": "60 und 144 nicht mag es auch geben aber ich glaube es gibt ganz viele die sind wirklich nicht in der lage den unterschied zu fühlen zwischen 100 also ich bin da mal zwischen 60 und 144 müsste eigentlich auch jeder fühlen weil meine ansicht sind gerade in games bei schnellen kamerabewegungen sind welten dazwischen aber zwischen 144 und 240 ich merke es aber du musst halt auch erst mal ein game haben mit ordentlich fps ich"}, {"id": 623, "start": 4198.96, "end": 4205.88, "text": "merke es aber es ist wirklich im vergleich zu 60 244 minimal so und jetzt denke ich mir"}, {"id": 624, "start": 4205.88, "end": 4220.08, "text": "halt ok und dann noch von 240 zu 390 du wirst es bestimmt in den ein oder anderen situationen merken aber ich glaube nicht dass es absoluter game changer ist wie von 60 auf 144"}, {"id": 625, "start": 4220.08, "end": 4237.08, "text": "zumal du brauchst auch erstmal ein game was mit ordentlich ordentlich fps läuft natürlich hast du theoretisch auch den vorteil von wenn das game mit weniger fps läuft aber so richtig ausspielen kannst du es natürlich nur umso mehr fps du hast"}, {"id": 626, "start": 4237.08, "end": 4252.08, "text": "aber gucken wir mal woher willst du die 400 fps bekommen wieso also wenn ich battlefield 3 zum beispiel spiele auf low details dann geht das"}, {"id": 627, "start": 4252.08, "end": 4267.08, "text": "so gut compared to the competition das stimmt das exactly was happening right here"}, {"id": 628, "start": 4267.08, "end": 4277.08, "text": "wahrscheinlich wahrscheinlich sagt das panel ist blickwinkel abhängig als fack und er hat kack farben oder so da kann ich mir schon vorstellen dass sie ein schnelleres panel billiger bauen können"}, {"id": 629, "start": 4277.08, "end": 4302.08, "text": "aber wahrscheinlich auch die auflösung geringer das bestimmt nur 1080p die anderen gibt es ja teilweise schon bis 1440 und ich weiß gar nicht ob es sogar 4k welche gibt schon"}, {"id": 630, "start": 4302.08, "end": 4317.08, "text": "also 4k 4k 240 geht nicht ich glaube das geht über displayport nicht drüber"}, {"id": 631, "start": 4317.08, "end": 4332.08, "text": "das ist tatsächlich relativ gut"}, {"id": 632, "start": 4332.08, "end": 4347.08, "text": "200"}, {"id": 633, "start": 4347.08, "end": 4349.08, "text": "Ja, das zeige ich euch."}, {"id": 634, "start": 4351.08, "end": 4353.08, "text": "Input lag."}, {"id": 635, "start": 4359.08, "end": 4361.08, "text": "Ah ja, James, 14 Monate lang schon von dem Zap."}, {"id": 636, "start": 4369.08, "end": 4371.08, "text": "Ja."}, {"id": 637, "start": 4371.08, "end": 4373.08, "text": "Das stimmt."}, {"id": 638, "start": 4377.08, "end": 4379.08, "text": "Das ist aber kein Cheating in dem Sinn."}, {"id": 639, "start": 4379.08, "end": 4381.08, "text": "Das ist tatsächlich so ein bisschen näher dran,"}, {"id": 640, "start": 4381.08, "end": 4383.08, "text": "an dem wie auch ein CRT das Bild aufgebaut hat."}, {"id": 641, "start": 4383.08, "end": 4385.08, "text": "CRTs war es ja auch so, dass das Bild"}, {"id": 642, "start": 4385.08, "end": 4387.08, "text": "sich nach jedem Frame, was ja da bei"}, {"id": 643, "start": 4387.08, "end": 4389.08, "text": "Backlight Strobing nicht so ist, aber"}, {"id": 644, "start": 4389.08, "end": 4391.08, "text": "bei jedem Frame"}, {"id": 645, "start": 4391.08, "end": 4393.08, "text": "quasi neu aufgebaut hat."}, {"id": 646, "start": 4393.08, "end": 4395.08, "text": "Deswegen kam ja, deswegen kommt einem ja das"}, {"id": 647, "start": 4395.08, "end": 4397.08, "text": "bei einem CRT auch so"}, {"id": 648, "start": 4397.08, "end": 4399.08, "text": "auch so"}, {"id": 649, "start": 4399.08, "end": 4401.08, "text": "wie soll man sagen, so"}, {"id": 650, "start": 4401.08, "end": 4403.08, "text": "so lagfrei vor."}, {"id": 651, "start": 4411.08, "end": 4413.08, "text": "Ja, so heißt das bei mir."}, {"id": 652, "start": 4413.08, "end": 4415.08, "text": "Diak."}, {"id": 653, "start": 4415.08, "end": 4417.08, "text": "Ich habe es nicht so in so ein BenQ."}, {"id": 654, "start": 4417.08, "end": 4419.08, "text": "Glaub schon."}, {"id": 655, "start": 4419.08, "end": 4433.08, "text": "Ja."}, {"id": 656, "start": 4433.08, "end": 4435.08, "text": "Ja, was übrigens auch heißt, was übrigens auch heißt,"}, {"id": 657, "start": 4435.08, "end": 4437.08, "text": "dass man dadurch nicht vernachlässigen darf,"}, {"id": 658, "start": 4437.08, "end": 4439.08, "text": "was bei einem CRT übrigens"}, {"id": 659, "start": 4439.08, "end": 4441.08, "text": "ja, nicht so war,"}, {"id": 660, "start": 4441.08, "end": 4443.08, "text": "oder man könnte das sagen, standardmäßig so war,"}, {"id": 661, "start": 4443.08, "end": 4445.08, "text": "aber nicht so war, weil es andere Technik ist."}, {"id": 662, "start": 4445.08, "end": 4447.08, "text": "Das Bild wird dadurch"}, {"id": 663, "start": 4447.08, "end": 4449.08, "text": "dunkler. Ist ja logisch."}, {"id": 664, "start": 4449.08, "end": 4451.08, "text": "Es ist ja das Licht"}, {"id": 665, "start": 4451.08, "end": 4453.08, "text": "kürzere Zeit an."}, {"id": 666, "start": 4453.08, "end": 4455.08, "text": "Also wisst ihr,"}, {"id": 667, "start": 4455.08, "end": 4457.08, "text": "wenn die Background Beleuchtung durchgängig leuchtet"}, {"id": 668, "start": 4457.08, "end": 4459.08, "text": "oder eben 240"}, {"id": 669, "start": 4459.08, "end": 4461.08, "text": "Mal in der Sekunde an und aus geschaltet wird,"}, {"id": 670, "start": 4461.08, "end": 4463.08, "text": "das ist einfach dunkler."}, {"id": 671, "start": 4463.08, "end": 4477.08, "text": "Das Bild, das merkt ihr auch sobald ihr das einschaltet."}, {"id": 672, "start": 4493.08, "end": 4519.08, "text": "Das ist wirklich nicht schlecht."}, {"id": 673, "start": 4519.08, "end": 4521.08, "text": "Ich habe das ja auch, also im Desktop"}, {"id": 674, "start": 4521.08, "end": 4526.22, "text": "Betrieb nicht, aber du kannst es zu drei Settings durchschalten. Ich muss sagen, ich finde den"}, {"id": 675, "start": 4526.22, "end": 4532.52, "text": "Monitor auch richtig gut. Ich habe hier einen BenQ mit 240 Hertz und auch Backlight-Diag Zeug."}, {"id": 676, "start": 4532.52, "end": 4562.08, "text": "Das ist wirklich nice. Das ist auch schon uralter Test."}, {"id": 677, "start": 4562.08, "end": 4573.72, "text": "Ihr müsstet euch mal den Unterschied angucken zwischen 60 Hertz und dem Kram hier."}, {"id": 678, "start": 4573.72, "end": 4597.68, "text": "Das ist übrigens gar nicht so verkehrt ausgesprochen. Man spricht die wirklich mehr oder weniger so"}, {"id": 679, "start": 4597.68, "end": 4608.56, "text": "aus. Vielleicht nicht A-SUS, sondern eher A-SUS. Die Betonung liegt auf dem U, nicht auf dem"}, {"id": 680, "start": 4608.56, "end": 4614.36, "text": "A. Wir sagen ja gerne A-SUS. Die Wirklichkeit ist eigentlich A-SUS."}, {"id": 681, "start": 4614.36, "end": 4628.76, "text": "Und A-SUS ist komplett falsch."}, {"id": 682, "start": 4644.36, "end": 4673.72, "text": "Das ist tatsächlich sehr klar."}, {"id": 683, "start": 4674.36, "end": 4692.56, "text": "Ich habe meine Zweifel, ob es viele Leute gibt, die das merken. Wie gesagt, zwischen"}, {"id": 684, "start": 4692.56, "end": 4709.32, "text": "1620 Hertz auf jeden Fall, zwischen 144 und 142 Hertz auch noch, aber..."}, {"id": 685, "start": 4709.32, "end": 4722.92, "text": "Da sind wirPolitika."}, {"id": 686, "start": 4722.92, "end": 4729.7, "text": "monstrous increase of a hundred and fifty hertz but honestly it is kind of hard to notice that difference without the strobing mode enabled"}, {"id": 687, "start": 4729.94, "end": 4735.86, "text": "especially in a game like valorant where you can actually drive that amount of frames the only way to explain it is that it"}, {"id": 688, "start": 4735.86, "end": 4743.4, "text": "Feels like you're playing in real time with absolutely zero delay. There's no smoothing. There's no choppiness. There's no visual artifacting"}, {"id": 689, "start": 4743.52, "end": 4746.84, "text": "Everything just feels instant. It's noticeably clearer than the"}, {"id": 690, "start": 4747.4, "end": 4749.2, "text": "muss ehrlich sagen"}, {"id": 691, "start": 4749.2, "end": 4754.4, "text": "Ich habe also spätestens seit diesem Jahr eigentlich bei nichts mehr irgendwelche artefakte gesehen"}, {"id": 692, "start": 4779.2, "end": 4782.36, "text": "Even if it isn't displaying a completely new frame every time"}, {"id": 693, "start": 4782.36, "end": 4782.86, "text": "Apex"}, {"id": 694, "start": 4782.86, "end": 4786.02, "text": "The Acer 390hz will also have the benefit of a lower input lag"}, {"id": 695, "start": 4786.02, "end": 4792.72, "text": "But this is mostly relevant for those games that you can actually run at 390 FPS plus again with the strobing tech here at"}, {"id": 696, "start": 4793.18, "end": 4800.36, "text": "390hz the input lag is a few milliseconds faster than the Asus and the Zowie and most of that comes down to the large refresh rate difference"}, {"id": 697, "start": 4800.36, "end": 4803.24, "text": "Let's also not forget. This is an IPS panel"}, {"id": 698, "start": 4803.24, "end": 4806.56, "text": "Which means that colors in contrast are going to be a strong point on their own"}, {"id": 699, "start": 4806.56, "end": 4812.12, "text": "Just like the Asus, the Acer has a dedicated sRGB mode, which is really damn cool"}, {"id": 700, "start": 4812.12, "end": 4815.28, "text": "The white point is rock solid at around 6500K"}, {"id": 701, "start": 4815.28, "end": 4818.68, "text": "Wobei ich dazu sagen kann am besten ist, weil man wirklich den Monitor nach"}, {"id": 702, "start": 4818.88, "end": 4824.28, "text": "Also auch wenn die, sagen wir so, die günstigen, gerade die Gaming-Monitor jetzt nicht allzu gut sind"}, {"id": 703, "start": 4824.48, "end": 4829.0, "text": "So bei Farbraumabdeckung am besten ist man hat ein Kalibrierungsgerät. Das ist wirklich nice"}, {"id": 704, "start": 4829.0, "end": 4832.48, "text": "Also wenn man will, dass es halbwegs gut aussieht auch"}, {"id": 705, "start": 4832.48, "end": 4839.32, "text": "Also wenn man irgendwelche Bilder mal abgleichen will und gucken will passt das ist Rot-Rot und Blau-Blau und Gelb-Gelb und"}, {"id": 706, "start": 4839.68, "end": 4841.68, "text": "Lila-Lila und was auch immer"}, {"id": 707, "start": 4841.72, "end": 4848.16, "text": "Dann ist ein Kalibrierungsgerät gar nicht so gar nicht so blöd. Die Dinger hängt man von Monitor, schließt sie per USB an"}, {"id": 708, "start": 4849.0, "end": 4853.56, "text": "und dann lässt man ein Testprogramm laufen und die haben eine Kamera drin und gucken halt wie"}, {"id": 709, "start": 4854.2, "end": 4859.76, "text": "Akkurat ist das ganze und am Ende kriegst du ein Color-Profil raus und kannst es laden und dann ist dann Monitor perfekt"}, {"id": 710, "start": 4860.4, "end": 4861.92, "text": "kalibriert"}, {"id": 711, "start": 4861.92, "end": 4864.72, "text": "Was heißt perfekt? So perfekt, wie es halt mit dem jeweiligen Monitor sein kann"}, {"id": 712, "start": 4880.24, "end": 4887.72, "text": "Warum sind das eigentlich so krumme Zahlen 144, 240? Na gut, 240 ist jetzt nicht krumm. Also wenn krumm und gerade ist keine davon"}, {"id": 713, "start": 4887.72, "end": 4893.48, "text": "Aber ich vermute mal das liegt an den an den Panels und was die Hersteller da draufschreibe. Warum?"}, {"id": 714, "start": 4893.88, "end": 4900.88, "text": "Warum? Also das erste was es gab ist 120 und 144 Hertz von dem bisschen schnelleren. Die gab es ungefähr ziemlich zeitgleich"}, {"id": 715, "start": 4900.88, "end": 4916.88, "text": "Warum es jetzt 144 war, keine Ahnung."}, {"id": 716, "start": 4931.84, "end": 4936.28, "text": "Sien"}, {"id": 717, "start": 4951.2, "end": 4956.24, "text": "Also, ich hab's verstanden. Ich hab's verstanden, der Find dem Monitor furchtbar geil und es bringt ahngeblich was. Ich werde mir auf jeden fall keine"}, {"id": 718, "start": 4956.6, "end": 4958.18, "text": "390 Hertz monitor oder"}, {"id": 719, "start": 4958.18, "end": 4967.18, "text": "Tja es ist ja immer noch ein 360 Hz Panel kaufen. Ich bin mit dem BenQ 240 Hz eigentlich ganz zufrieden."}, {"id": 720, "start": 4967.18, "end": 4971.18, "text": "Ich werde mir frühestens einen neuen Monitor kaufen, wenn ich mir auch einen neuen Rechner kaufe."}, {"id": 721, "start": 4971.18, "end": 4978.18, "text": "Und das ist ja aufgrund der Verfügbarkeit von Grafikkarten, CPUs und generell Hardware und dem jeweiligen Preis..."}, {"id": 722, "start": 4979.18, "end": 4985.18, "text": "Aktuell, tja, eher noch nicht in Sicht. Ihr wisst, ich wollte mir schon vor zwei Jahren einen neuen Rechner kaufen."}, {"id": 723, "start": 4985.18, "end": 4998.18, "text": "Ich wollte mir ursprünglich in 390 kaufen, dann 5090, X, AMD, Stellz und... oder was, 5900, 5900, ne? Ach, AMD Benamung."}, {"id": 724, "start": 5000.18, "end": 5010.18, "text": "Hab ich nicht gemacht, gab ja nie was. Ich hab immer noch meine 1080 Ti. Die ist jetzt von wann? 2017 oder so?"}, {"id": 725, "start": 5010.18, "end": 5016.18, "text": "Das funktioniert alles wunderbar. Es gab noch nichts, was ich nicht spielen konnte."}, {"id": 726, "start": 5016.18, "end": 5021.18, "text": "Muss ich mal überlegen. Vier Jahre alt, der Rechner. Mein Rechner ist jetzt genau..."}, {"id": 727, "start": 5023.18, "end": 5031.18, "text": "Mein Rechner ist jetzt genau vier Jahre alt. Guck mal. Ja, naja. Ja, genau vier Jahre alt."}, {"id": 728, "start": 5031.18, "end": 5039.18, "text": "Da hab ich den gekauft. Es ist immer noch genau das Gleiche drin. Das Einzige, was ich noch mal dazugesteckt hab, war noch mal 16G RAM zusätzlich."}, {"id": 729, "start": 5041.18, "end": 5043.18, "text": "Es ist genau das Gleiche drin. Immer noch."}, {"id": 730, "start": 5043.18, "end": 5064.18, "text": "Hallo. Was ein Hall. Hätte ich den Sound nicht besser machen können. Warum hat das so viele Views?"}, {"id": 731, "start": 5064.18, "end": 5073.18, "text": "Ja. Okay, jetzt haben wir uns angeguckt. Was gucken wir uns das... Was? Lego Build. Was ist das?"}, {"id": 732, "start": 5073.18, "end": 5079.18, "text": "This Lego Build will blow your mind. Okay, wir lassen unser Mind blown jetzt. Auf geht's."}, {"id": 733, "start": 5079.18, "end": 5091.18, "text": "Mind blown. Okay, ich lasse mal die Mario Kart Musik an. Passt, glaube ich, ganz gut dazu."}, {"id": 734, "start": 5096.18, "end": 5105.18, "text": "Aha. Du musst erst mal so viele Lego Teile in Lilak, also diese Lego Teile alle in der kleinen Farbe kriegen."}, {"id": 735, "start": 5105.18, "end": 5117.18, "text": "Ist das ein Chebat? Keine Ahnung. Mal gucken, was rauskommt. Pause-Champ."}, {"id": 736, "start": 5117.18, "end": 5132.18, "text": "Was ist das für ein Video? Die Mario Kart Musik passt da erstaunlich gut dazu."}, {"id": 737, "start": 5132.18, "end": 5147.18, "text": "Hä? Also, wenn er irgendwie eine Platte bauen will, dann warum hat er Löcher drin?"}, {"id": 738, "start": 5147.18, "end": 5156.18, "text": "Weil es gibt keine Platte. Guck mal, das sind hier... Das ist nicht umsonst, dass es so..."}, {"id": 739, "start": 5156.18, "end": 5167.18, "text": "So immer einzelne Blöcke sind. Ah, okay, wir gucken ihm doch nicht bei allem zu."}, {"id": 740, "start": 5167.18, "end": 5189.18, "text": "Ah, habt ihr es gesehen? Das hat, das hat gemoved. Guck mal, das hat gemoved. Das moved hier. Aha, aha."}, {"id": 741, "start": 5189.18, "end": 5204.18, "text": "Sus. Aha. Keine Ahnung, was da abgeht, aber er wird es schon wissen."}, {"id": 742, "start": 5204.18, "end": 5217.18, "text": "Jetzt. Andere Seite."}, {"id": 743, "start": 5217.18, "end": 5230.18, "text": "Wubbel-Wubbel."}, {"id": 744, "start": 5230.18, "end": 5253.18, "text": "Das ist cool. Das hätte ich nicht gedacht. Das hätte ich nicht gedacht, dass es so flexibel"}, {"id": 745, "start": 5253.18, "end": 5259.18, "text": "da am Ende was rauskommt. Nice. Es ist zwar komplett sinnlos, man kann damit absolut nichts"}, {"id": 746, "start": 5259.18, "end": 5264.18, "text": "anfangen und es stellt auch nichts dar oder sonst... Das hätte ich nicht gedacht. Das hätte ich"}, {"id": 747, "start": 5264.18, "end": 5279.18, "text": "wirklich nicht gedacht, dass das dabei rauskommt. Pock. Schon die Nintendo Direct gesehen? Nee."}, {"id": 748, "start": 5279.18, "end": 5284.18, "text": "Lass mich raten, es wurde nichts gezeigt, was irgendwie interessant ist. Doch, doch,"}, {"id": 749, "start": 5284.18, "end": 5291.18, "text": "doch, doch, doch, doch, doch, doch, doch, doch, doch, doch. Irgendein neuer Smash-Kämpfer"}, {"id": 750, "start": 5291.18, "end": 5300.18, "text": "wahrscheinlich. Es ist immerhin Nintendo. Naja. Okay, war nice, hätte ich echt nicht"}, {"id": 751, "start": 5300.18, "end": 5307.18, "text": "gedacht, dass das dabei rauskommt, aber ja, so extrem mindblown bin ich jetzt auch nicht."}, {"id": 752, "start": 5307.18, "end": 5309.18, "text": "N64 games für switch"}, {"id": 753, "start": 5310.42, "end": 5316.34, "text": "Nintendo fällt allerdings noch ist ok wir müssen uns mal kurz anhören wie man arsos ausspricht also zeig her"}, {"id": 754, "start": 5316.94, "end": 5318.94, "text": "ich brüche mein arsos aus"}, {"id": 755, "start": 5319.38, "end": 5321.18, "text": "nein"}, {"id": 756, "start": 5321.18, "end": 5323.18, "text": "oder wirklich"}, {"id": 757, "start": 5325.74, "end": 5329.06, "text": "Jesus das glaube ich dir nicht"}, {"id": 758, "start": 5329.06, "end": 5335.7, "text": "dass das glaube ich dir nicht dass man das so ausspricht weil"}, {"id": 759, "start": 5338.78, "end": 5343.54, "text": "Das ist das ist das ist doch toll ich kann wisst ihr warum ich das nicht glaube"}, {"id": 760, "start": 5344.3, "end": 5346.3, "text": "weil mir zwei leute"}, {"id": 761, "start": 5346.34, "end": 5353.5, "text": "persönlich von arsos von arsos erzählt haben dass es arsos heißt und nicht aces"}, {"id": 762, "start": 5353.5, "end": 5364.38, "text": "das heißt arsos das heißt arsos sind wir zwei leute persönlich von arsos erzählt sei immer nur arsos"}, {"id": 763, "start": 5365.78, "end": 5367.14, "text": "die haben mich getrollt"}, {"id": 764, "start": 5367.14, "end": 5374.5, "text": "Nenene das ging genau um dieses thema und sie haben auch gesagt was sie bescheuert finden von der ursprache und sie haben gesagt dieses englische aces"}, {"id": 765, "start": 5374.5, "end": 5376.5, "text": "ist fail"}, {"id": 766, "start": 5376.54, "end": 5378.78, "text": "die erdies auch von ich weiß auch nicht warum"}, {"id": 767, "start": 5379.9, "end": 5381.9, "text": "die haben ich nicht gebetet"}, {"id": 768, "start": 5381.9, "end": 5385.26, "text": "wie auch immer jetzt weiß jemand nicht wie man arsos ausspricht"}, {"id": 769, "start": 5395.02, "end": 5397.9, "text": "naja von dem haben wir schon mal was gesehen"}, {"id": 770, "start": 5398.62, "end": 5401.34, "text": "ihr zeigt mal nicht dass wir jetzt gebetet werden"}, {"id": 771, "start": 5403.34, "end": 5406.94, "text": "was ist das für einer was i converted my microwave into a"}, {"id": 772, "start": 5408.3, "end": 5410.3, "text": "was"}, {"id": 773, "start": 5410.3, "end": 5412.3, "text": "was"}, {"id": 774, "start": 5415.66, "end": 5417.66, "text": "die jetzt"}, {"id": 775, "start": 5417.82, "end": 5422.78, "text": "das muss doch tschübet sein warum hat er warum warum und vor allem"}, {"id": 776, "start": 5423.7, "end": 5424.86, "text": "wie"}, {"id": 777, "start": 5424.86, "end": 5426.86, "text": "ok wir gucken das jetzt an"}, {"id": 778, "start": 5426.86, "end": 5430.74, "text": "ja 조금"}, {"id": 779, "start": 5433.1, "end": 5436.2, "text": "punter"}, {"id": 780, "start": 5443.2, "end": 5446.82, "text": "die lautstärke ändert sich ein video es verified fender ein bisschen lauter machen"}, {"id": 781, "start": 5446.82, "end": 5453.82, "text": "一下"}, {"id": 782, "start": 5458.0, "end": 5464.86, "text": "plete"}, {"id": 783, "start": 5464.86, "end": 5469.16, "text": "Yorker"}, {"id": 784, "start": 5469.16, "end": 5473.64, "text": "沒錯"}, {"id": 785, "start": 5473.64, "end": 5474.64, "text": "Blast-Chamber."}, {"id": 786, "start": 5474.64, "end": 5475.64, "text": "Dann zeig mal her."}, {"id": 787, "start": 5475.64, "end": 5476.64, "text": "Ah, Sponsor."}, {"id": 788, "start": 5476.64, "end": 5477.64, "text": "Aber das ist nicht super spannend, und es ist oft schneller als ich möchte."}, {"id": 789, "start": 5477.64, "end": 5478.64, "text": "Und außerdem, du kannst das auch mit einem normalen Ofen machen."}, {"id": 790, "start": 5478.64, "end": 5479.64, "text": "Aber das ist nicht ein normales Ofen."}, {"id": 791, "start": 5479.64, "end": 5480.64, "text": "Das ist ein Wissenschaftsofen."}, {"id": 792, "start": 5480.64, "end": 5481.64, "text": "Das ist ein Wissenschaftsofen."}, {"id": 793, "start": 5481.64, "end": 5482.64, "text": "Das ist ein Wissenschaftsofen."}, {"id": 794, "start": 5482.64, "end": 5483.64, "text": "Das ist ein Wissenschaftsofen."}, {"id": 795, "start": 5483.64, "end": 5504.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 796, "start": 5504.08, "end": 5507.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 797, "start": 5507.08, "end": 5514.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 798, "start": 5514.08, "end": 5519.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 799, "start": 5519.08, "end": 5540.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 800, "start": 5540.08, "end": 5550.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 801, "start": 5550.08, "end": 5559.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 802, "start": 5559.08, "end": 5571.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 803, "start": 5571.08, "end": 5596.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 804, "start": 5596.08, "end": 5603.08, "text": "Das ist ein Wissenschaftsofen."}, {"id": 805, "start": 5603.08, "end": 5607.6, "text": "100% setting the bulbs are only on half the time and this is an epilepsy warung"}, {"id": 806, "start": 5607.88, "end": 5610.12, "text": "Microwaves half the time and what a scam"}, {"id": 807, "start": 5610.88, "end": 5616.52, "text": "Anybody who watches my videos knows that half power just isn't gonna cut it for me. I think it's time for some upgrades"}, {"id": 808, "start": 5616.76, "end": 5620.72, "text": "All right, so I've taken this thing apart to expose the circuitry inside now"}, {"id": 809, "start": 5620.72, "end": 5627.0, "text": "I gotta say it poking around in a microwave is not for the inexperienced when electronics hobbyists get killed by the projects"}, {"id": 810, "start": 5627.0, "end": 5630.24, "text": "It's almost always because they're messing around with microwave parts like these"}, {"id": 811, "start": 5630.24, "end": 5637.34, "text": "Anyway, here's the reason why the ovens only on half the time. So this magnetron here, which is actually the source of my grades"}, {"id": 812, "start": 5637.34, "end": 5644.24, "text": "In the end, it's always a bad idea in such devices because you've just cut them off from the power then immediately with the finger"}, {"id": 813, "start": 5644.24, "end": 5646.24, "text": "to fill the back"}, {"id": 814, "start": 5646.24, "end": 5652.8, "text": "Feeding the output of this high voltage transformer into this halfway voltage doubler circuit now the very nature of the circuit means that the"}, {"id": 815, "start": 5652.8, "end": 5660.16, "text": "Magnetron is only going to be powered on half of the AC cycle now the transformers in these things were ran so ridiculously close to saturation"}, {"id": 816, "start": 5660.16, "end": 5664.24, "text": "You could just throw in another capacitor and diode to make the full wave doubler and call today"}, {"id": 817, "start": 5664.36, "end": 5665.36, "text": "But you can't"}, {"id": 818, "start": 5665.36, "end": 5667.36, "text": "Max, du wolltest doch auch mal dein Mikro reparieren"}, {"id": 819, "start": 5667.36, "end": 5669.36, "text": "Wieso, was ist mit meinem Mikro?"}, {"id": 820, "start": 5669.36, "end": 5671.36, "text": "Ist da was kaputt?"}, {"id": 821, "start": 5671.36, "end": 5674.12, "text": "Hä? Hört so an wie immer, was hab ich was mit meinem Mikro?"}, {"id": 822, "start": 5676.76, "end": 5678.76, "text": "Test, test, test, test"}, {"id": 823, "start": 5678.76, "end": 5680.76, "text": "Test, test, test, test"}, {"id": 824, "start": 5680.76, "end": 5682.76, "text": "Test, test, test, test"}, {"id": 825, "start": 5682.76, "end": 5684.76, "text": "Ist alles vollkommen in Ordnung"}, {"id": 826, "start": 5684.76, "end": 5686.76, "text": "Parkway for the transformer"}, {"id": 827, "start": 5700.76, "end": 5706.76, "text": "But before I do that let's start with a quick control run because this is a science video after all sort of"}, {"id": 828, "start": 5706.76, "end": 5712.88, "text": "I'm going to start by ripping this plastic covering off of the door the metal grid will still stop microwave from this"}, {"id": 829, "start": 5712.88, "end": 5714.88, "text": "Ich bin da froh dass es so feinfühlig vorgeht"}, {"id": 830, "start": 5714.88, "end": 5721.64, "text": "I actually learned this thermal camera trick from the youtuber Cyparagon. Well. He's not really a youtuber"}, {"id": 831, "start": 5721.64, "end": 5726.92, "text": "I've just known him from various nerdy online groups over the years, but he does have some cool vids on YouTube regardless"}, {"id": 832, "start": 5727.4, "end": 5733.68, "text": "So a cup of water heats by about 28 degrees Celsius in a minute which also suggests about 40 percent efficiency"}, {"id": 833, "start": 5733.68, "end": 5738.36, "text": "Now obviously this isn't quite fast enough for my liking. Was hat es mit Laser jetzt?"}, {"id": 834, "start": 5738.36, "end": 5740.36, "text": "I want to head in unlocked full power mode here"}, {"id": 835, "start": 5740.36, "end": 5745.56, "text": "I've added another transformer as well as some more diodes and capacitors to make the full wave doubler circuit"}, {"id": 836, "start": 5745.56, "end": 5749.36, "text": "But wait, want a microwave using double the power trip the breaker?"}, {"id": 837, "start": 5749.36, "end": 5752.96, "text": "Well, it's nothing a little bit of copper wire and duct tape can't fix"}, {"id": 838, "start": 5752.96, "end": 5754.96, "text": "I'm just kidding"}, {"id": 839, "start": 5754.96, "end": 5756.96, "text": "Wollt grad sagen, ernsthaft?"}, {"id": 840, "start": 5756.96, "end": 5761.76, "text": "I was too lazy to use the original controls on the microwave so now I'm using this huge variac to power it"}, {"id": 841, "start": 5761.76, "end": 5763.76, "text": "Mocker Haus abfackeln"}, {"id": 842, "start": 5792.76, "end": 5794.76, "text": "Ja"}, {"id": 843, "start": 5794.76, "end": 5803.28, "text": "Wer braucht, wer möchte nicht öfters large objects radiate mit seiner Mikrowelle. Ich mein wer kennt, wer kennt das Problem nicht?"}, {"id": 844, "start": 5805.28, "end": 5807.28, "text": "Täglich"}, {"id": 845, "start": 5807.28, "end": 5817.28, "text": "Das ist ein Ton der wird mich nicht ruhig schlafen lassen"}, {"id": 846, "start": 5838.28, "end": 5848.28, "text": "Ja, hätt ich, gut, hätt ich auch damit gerechnet, dass es schneller geht"}, {"id": 847, "start": 5848.28, "end": 5868.28, "text": "Fahrenheit, ja, Kona Units"}, {"id": 848, "start": 5868.28, "end": 5883.28, "text": "Ich hab kein Schimmer was 107 Grad fahrenheit sind"}, {"id": 849, "start": 5883.28, "end": 5903.28, "text": "Alter"}, {"id": 850, "start": 5903.28, "end": 5911.28, "text": "Wenn man sonst keine Probleme hat"}, {"id": 851, "start": 5911.28, "end": 5917.28, "text": "Alter, dieser Sound macht mich fertig"}, {"id": 852, "start": 5917.28, "end": 5922.28, "text": "Nee"}, {"id": 853, "start": 5922.28, "end": 5928.28, "text": "Also spätestens wenn irgendwo schwarzer Rauch rauskommt dann weißt du stimmt was nicht"}, {"id": 854, "start": 5928.28, "end": 5943.28, "text": "Die Banane wird geschweißt genau"}, {"id": 855, "start": 5943.28, "end": 5964.28, "text": "Der Kerl ist irgendwie schon bisschen durch oder"}, {"id": 856, "start": 5964.28, "end": 5967.28, "text": "Hallo"}, {"id": 857, "start": 5967.28, "end": 5976.28, "text": "Lasers"}, {"id": 858, "start": 5976.28, "end": 6003.28, "text": "Die"}, {"id": 859, "start": 6003.28, "end": 6005.28, "text": "Ich meine es hat im Prinzip keinen Sinn was er macht"}, {"id": 860, "start": 6005.28, "end": 6024.28, "text": "Es ist einfach nur cool dass es geht also ich meine praktische Anleitungzweck hat es natürlich nicht"}, {"id": 861, "start": 6024.28, "end": 6036.28, "text": "Also wer braucht wer braucht"}, {"id": 862, "start": 6036.28, "end": 6055.28, "text": "Werbeleid Passte"}, {"id": 863, "start": 6055.28, "end": 6066.28, "text": "Und ich dachte schon ich dachte schon die Dinge die ich hier manchmal zusammen zusammenbau sind abseits vom Mainstream aber das hier ist noch mal eine Nummer Nummer mehr"}, {"id": 864, "start": 6066.28, "end": 6073.28, "text": "Jawoll"}, {"id": 865, "start": 6073.28, "end": 6086.28, "text": "Warum"}, {"id": 866, "start": 6086.28, "end": 6098.28, "text": "Was treibt er da"}, {"id": 867, "start": 6098.28, "end": 6118.28, "text": "Was was treibt er denn da"}, {"id": 868, "start": 6118.28, "end": 6135.28, "text": "Was geht mit dem Kerl"}, {"id": 869, "start": 6135.28, "end": 6152.28, "text": "Was geht mit dem Kerl"}, {"id": 870, "start": 6152.28, "end": 6169.28, "text": "Was geht mit dem Kerl"}, {"id": 871, "start": 6169.28, "end": 6182.28, "text": "Es ist blaues Licht und was tut es leuchtet blau"}, {"id": 872, "start": 6182.28, "end": 6202.28, "text": "Ist das jetzt schlecht wenn man da seine Hand dazwischen steckt"}, {"id": 873, "start": 6202.28, "end": 6217.28, "text": "Was geht mit dem Kerl"}, {"id": 874, "start": 6217.28, "end": 6232.28, "text": "Was geht mit dem Kerl"}, {"id": 875, "start": 6232.28, "end": 6247.28, "text": "Was geht mit dem Kerl"}, {"id": 876, "start": 6247.28, "end": 6262.28, "text": "Was geht mit dem Kerl"}, {"id": 877, "start": 6262.28, "end": 6277.28, "text": "Was geht mit dem Kerl"}, {"id": 878, "start": 6277.28, "end": 6292.28, "text": "Was geht mit dem Kerl"}, {"id": 879, "start": 6292.28, "end": 6307.28, "text": "Was geht mit dem Kerl"}, {"id": 880, "start": 6307.28, "end": 6322.28, "text": "Was geht mit dem Kerl"}, {"id": 881, "start": 6322.28, "end": 6337.28, "text": "Was geht mit dem Kerl"}, {"id": 882, "start": 6337.28, "end": 6352.28, "text": "Was geht mit dem Kerl"}, {"id": 883, "start": 6352.28, "end": 6367.28, "text": "Was geht mit dem Kerl"}, {"id": 884, "start": 6367.28, "end": 6382.28, "text": "Was geht mit dem Kerl"}, {"id": 885, "start": 6382.28, "end": 6397.28, "text": "Was geht mit dem Kerl"}, {"id": 886, "start": 6397.28, "end": 6412.28, "text": "Was geht mit dem Kerl"}, {"id": 887, "start": 6412.28, "end": 6427.28, "text": "Was geht mit dem Kerl"}, {"id": 888, "start": 6427.28, "end": 6442.28, "text": "Was geht mit dem Kerl"}, {"id": 889, "start": 6442.28, "end": 6457.28, "text": "Was geht mit dem Kerl"}, {"id": 890, "start": 6457.28, "end": 6472.28, "text": "Was geht mit dem Kerl"}, {"id": 891, "start": 6472.28, "end": 6487.28, "text": "Was geht mit dem Kerl"}, {"id": 892, "start": 6487.28, "end": 6502.28, "text": "Was geht mit dem Kerl"}, {"id": 893, "start": 6502.28, "end": 6517.28, "text": "Was geht mit dem Kerl"}, {"id": 894, "start": 6517.28, "end": 6532.28, "text": "Was geht mit dem Kerl"}, {"id": 895, "start": 6532.28, "end": 6547.28, "text": "Was geht mit dem Kerl"}, {"id": 896, "start": 6547.28, "end": 6562.28, "text": "Was geht mit dem Kerl"}, {"id": 897, "start": 6562.28, "end": 6577.28, "text": "Was geht mit dem Kerl"}, {"id": 898, "start": 6577.28, "end": 6592.28, "text": "Was geht mit dem Kerl"}, {"id": 899, "start": 6592.28, "end": 6607.28, "text": "Was geht mit dem Kerl"}, {"id": 900, "start": 6607.28, "end": 6622.28, "text": "Was geht mit dem Kerl"}, {"id": 901, "start": 6622.28, "end": 6637.28, "text": "Was geht mit dem Kerl"}, {"id": 902, "start": 6637.28, "end": 6652.28, "text": "Was geht mit dem Kerl"}, {"id": 903, "start": 6652.28, "end": 6667.28, "text": "Was geht mit dem Kerl"}, {"id": 904, "start": 6667.28, "end": 6682.28, "text": "Was geht mit dem Kerl"}, {"id": 905, "start": 6682.28, "end": 6697.28, "text": "Was geht mit dem Kerl"}, {"id": 906, "start": 6697.28, "end": 6712.28, "text": "Was geht mit dem Kerl"}, {"id": 907, "start": 6712.28, "end": 6727.28, "text": "Was geht mit dem Kerl"}, {"id": 908, "start": 6727.28, "end": 6742.28, "text": "Was geht mit dem Kerl"}, {"id": 909, "start": 6742.28, "end": 6757.28, "text": "Was geht mit dem Kerl"}, {"id": 910, "start": 6757.28, "end": 6772.28, "text": "Was geht mit dem Kerl"}, {"id": 911, "start": 6772.28, "end": 6787.28, "text": "Was geht mit dem Kerl"}, {"id": 912, "start": 6787.28, "end": 6802.28, "text": "Was geht mit dem Kerl"}, {"id": 913, "start": 6802.28, "end": 6817.28, "text": "Was geht mit dem Kerl"}, {"id": 914, "start": 6817.28, "end": 6832.28, "text": "Was geht mit dem Kerl"}, {"id": 915, "start": 6832.28, "end": 6847.28, "text": "Was geht mit dem Kerl"}, {"id": 916, "start": 6847.28, "end": 6862.28, "text": "Was geht mit dem Kerl"}, {"id": 917, "start": 6862.28, "end": 6877.28, "text": "Was geht mit dem Kerl"}, {"id": 918, "start": 6877.28, "end": 6892.28, "text": "Was geht mit dem Kerl"}, {"id": 919, "start": 6892.28, "end": 6907.28, "text": "Was geht mit dem Kerl"}, {"id": 920, "start": 6907.28, "end": 6922.28, "text": "Was geht mit dem Kerl"}, {"id": 921, "start": 6922.28, "end": 6937.28, "text": "Was geht mit dem Kerl"}, {"id": 922, "start": 6937.28, "end": 6952.28, "text": "Was geht mit dem Kerl"}, {"id": 923, "start": 6952.28, "end": 6967.28, "text": "Was geht mit dem Kerl"}, {"id": 924, "start": 6967.28, "end": 6982.28, "text": "Was geht mit dem Kerl"}, {"id": 925, "start": 6982.28, "end": 6997.28, "text": "Was geht mit dem Kerl"}, {"id": 926, "start": 6997.28, "end": 7012.28, "text": "Was geht mit dem Kerl"}, {"id": 927, "start": 7012.28, "end": 7027.28, "text": "Was geht mit dem Kerl"}, {"id": 928, "start": 7027.28, "end": 7042.28, "text": "Was geht mit dem Kerl"}, {"id": 929, "start": 7042.28, "end": 7057.28, "text": "Was geht mit dem Kerl"}, {"id": 930, "start": 7057.28, "end": 7072.28, "text": "Was geht mit dem Kerl"}, {"id": 931, "start": 7072.28, "end": 7087.28, "text": "Was geht mit dem Kerl"}, {"id": 932, "start": 7087.28, "end": 7102.28, "text": "Was geht mit dem Kerl"}, {"id": 933, "start": 7102.28, "end": 7117.28, "text": "Was geht mit dem Kerl"}, {"id": 934, "start": 7117.28, "end": 7132.28, "text": "Was geht mit dem Kerl"}, {"id": 935, "start": 7132.28, "end": 7147.28, "text": "Was geht mit dem Kerl"}, {"id": 936, "start": 7147.28, "end": 7162.28, "text": "Was geht mit dem Kerl"}, {"id": 937, "start": 7162.28, "end": 7177.28, "text": "Was geht mit dem Kerl"}, {"id": 938, "start": 7177.28, "end": 7192.28, "text": "Was geht mit dem Kerl"}, {"id": 939, "start": 7192.28, "end": 7207.28, "text": "Was geht mit dem Kerl"}, {"id": 940, "start": 7207.28, "end": 7222.28, "text": "Was geht mit dem Kerl"}, {"id": 941, "start": 7222.28, "end": 7237.28, "text": "Was geht mit dem Kerl"}, {"id": 942, "start": 7237.28, "end": 7252.28, "text": "Was geht mit dem Kerl"}, {"id": 943, "start": 7252.28, "end": 7267.28, "text": "Was geht mit dem Kerl"}, {"id": 944, "start": 7267.28, "end": 7282.28, "text": "Was geht mit dem Kerl"}, {"id": 945, "start": 7282.28, "end": 7297.28, "text": "Was geht mit dem Kerl"}, {"id": 946, "start": 7297.28, "end": 7312.28, "text": "Was geht mit dem Kerl"}, {"id": 947, "start": 7312.28, "end": 7327.28, "text": "Was geht mit dem Kerl"}, {"id": 948, "start": 7327.28, "end": 7342.28, "text": "Was geht mit dem Kerl"}, {"id": 949, "start": 7342.28, "end": 7357.28, "text": "Was geht mit dem Kerl"}, {"id": 950, "start": 7357.28, "end": 7372.28, "text": "Was geht mit dem Kerl"}, {"id": 951, "start": 7372.28, "end": 7387.28, "text": "Was geht mit dem Kerl"}, {"id": 952, "start": 7387.28, "end": 7402.28, "text": "Was geht mit dem Kerl"}, {"id": 953, "start": 7402.28, "end": 7417.28, "text": "Was geht mit dem Kerl"}, {"id": 954, "start": 7417.28, "end": 7432.28, "text": "Was geht mit dem Kerl"}, {"id": 955, "start": 7432.28, "end": 7447.28, "text": "Was geht mit dem Kerl"}, {"id": 956, "start": 7447.28, "end": 7462.28, "text": "Was geht mit dem Kerl"}, {"id": 957, "start": 7462.28, "end": 7477.28, "text": "Was geht mit dem Kerl"}, {"id": 958, "start": 7477.28, "end": 7492.28, "text": "Was geht mit dem Kerl"}, {"id": 959, "start": 7492.28, "end": 7507.28, "text": "Was geht mit dem Kerl"}, {"id": 960, "start": 7507.28, "end": 7522.28, "text": "Was geht mit dem Kerl"}, {"id": 961, "start": 7522.28, "end": 7537.28, "text": "Was geht mit dem Kerl"}, {"id": 962, "start": 7537.28, "end": 7552.28, "text": "Was geht mit dem Kerl"}, {"id": 963, "start": 7552.28, "end": 7567.28, "text": "Was geht mit dem Kerl"}, {"id": 964, "start": 7567.28, "end": 7582.28, "text": "Was geht mit dem Kerl"}, {"id": 965, "start": 7582.28, "end": 7597.28, "text": "Was geht mit dem Kerl"}, {"id": 966, "start": 7597.28, "end": 7612.28, "text": "Was geht mit dem Kerl"}, {"id": 967, "start": 7612.28, "end": 7627.28, "text": "Was geht mit dem Kerl"}, {"id": 968, "start": 7627.28, "end": 7642.28, "text": "Was geht mit dem Kerl"}, {"id": 969, "start": 7642.28, "end": 7657.28, "text": "Was geht mit dem Kerl"}, {"id": 970, "start": 7657.28, "end": 7672.28, "text": "Was geht mit dem Kerl"}, {"id": 971, "start": 7672.28, "end": 7687.28, "text": "Was geht mit dem Kerl"}, {"id": 972, "start": 7687.28, "end": 7702.28, "text": "Was geht mit dem Kerl"}, {"id": 973, "start": 7702.28, "end": 7717.28, "text": "Was geht mit dem Kerl"}, {"id": 974, "start": 7717.28, "end": 7732.28, "text": "Was geht mit dem Kerl"}, {"id": 975, "start": 7732.28, "end": 7747.28, "text": "Was geht mit dem Kerl"}, {"id": 976, "start": 7747.28, "end": 7762.28, "text": "Was geht mit dem Kerl"}, {"id": 977, "start": 7762.28, "end": 7777.28, "text": "Was geht mit dem Kerl"}, {"id": 978, "start": 7777.28, "end": 7792.28, "text": "Was geht mit dem Kerl"}, {"id": 979, "start": 7792.28, "end": 7807.28, "text": "Was geht mit dem Kerl"}, {"id": 980, "start": 7807.28, "end": 7822.28, "text": "Was geht mit dem Kerl"}, {"id": 981, "start": 7822.28, "end": 7837.28, "text": "Was geht mit dem Kerl"}, {"id": 982, "start": 7837.28, "end": 7852.28, "text": "Was geht mit dem Kerl"}, {"id": 983, "start": 7852.28, "end": 7867.28, "text": "Was geht mit dem Kerl"}, {"id": 984, "start": 7867.28, "end": 7882.28, "text": "Was geht mit dem Kerl"}, {"id": 985, "start": 7882.28, "end": 7897.28, "text": "Was geht mit dem Kerl"}, {"id": 986, "start": 7897.28, "end": 7912.28, "text": "Was geht mit dem Kerl"}, {"id": 987, "start": 7912.28, "end": 7927.28, "text": "Was geht mit dem Kerl"}, {"id": 988, "start": 7927.28, "end": 7942.28, "text": "Was geht mit dem Kerl"}, {"id": 989, "start": 7942.28, "end": 7957.28, "text": "Was geht mit dem Kerl"}, {"id": 990, "start": 7957.28, "end": 7972.28, "text": "Was geht mit dem Kerl"}, {"id": 991, "start": 7972.28, "end": 7987.28, "text": "Was geht mit dem Kerl"}, {"id": 992, "start": 7987.28, "end": 8002.28, "text": "Was geht mit dem Kerl"}, {"id": 993, "start": 8002.28, "end": 8017.28, "text": "Was geht mit dem Kerl"}, {"id": 994, "start": 8017.28, "end": 8032.28, "text": "Was geht mit dem Kerl"}, {"id": 995, "start": 8032.28, "end": 8047.28, "text": "Was geht mit dem Kerl"}, {"id": 996, "start": 8047.28, "end": 8062.28, "text": "Was geht mit dem Kerl"}, {"id": 997, "start": 8062.28, "end": 8077.28, "text": "Was geht mit dem Kerl"}, {"id": 998, "start": 8077.28, "end": 8092.28, "text": "Was geht mit dem Kerl"}, {"id": 999, "start": 8092.28, "end": 8107.28, "text": "Was geht mit dem Kerl"}, {"id": 1000, "start": 8107.28, "end": 8122.28, "text": "Was geht mit dem Kerl"}, {"id": 1001, "start": 8122.28, "end": 8137.28, "text": "Was geht mit dem Kerl"}, {"id": 1002, "start": 8137.28, "end": 8152.28, "text": "Was geht mit dem Kerl"}, {"id": 1003, "start": 8152.28, "end": 8167.28, "text": "Was geht mit dem Kerl"}, {"id": 1004, "start": 8167.28, "end": 8182.28, "text": "Was geht mit dem Kerl"}, {"id": 1005, "start": 8182.28, "end": 8197.28, "text": "Was geht mit dem Kerl"}, {"id": 1006, "start": 8197.28, "end": 8212.28, "text": "Was geht mit dem Kerl"}, {"id": 1007, "start": 8212.28, "end": 8227.28, "text": "Was geht mit dem Kerl"}, {"id": 1008, "start": 8227.28, "end": 8242.28, "text": "Was geht mit dem Kerl"}, {"id": 1009, "start": 8242.28, "end": 8257.28, "text": "Was geht mit dem Kerl"}, {"id": 1010, "start": 8257.28, "end": 8272.28, "text": "Was geht mit dem Kerl"}, {"id": 1011, "start": 8272.28, "end": 8287.28, "text": "Was geht mit dem Kerl"}, {"id": 1012, "start": 8287.28, "end": 8302.28, "text": "Was geht mit dem Kerl"}, {"id": 1013, "start": 8302.28, "end": 8317.28, "text": "Was geht mit dem Kerl"}, {"id": 1014, "start": 8317.28, "end": 8332.28, "text": "Was geht mit dem Kerl"}, {"id": 1015, "start": 8332.28, "end": 8347.28, "text": "Was geht mit dem Kerl"}, {"id": 1016, "start": 8347.28, "end": 8362.28, "text": "Was geht mit dem Kerl"}, {"id": 1017, "start": 8362.28, "end": 8377.28, "text": "Was geht mit dem Kerl"}, {"id": 1018, "start": 8377.28, "end": 8392.28, "text": "Was geht mit dem Kerl"}, {"id": 1019, "start": 8392.28, "end": 8407.28, "text": "Was geht mit dem Kerl"}, {"id": 1020, "start": 8407.28, "end": 8422.28, "text": "Was geht mit dem Kerl"}, {"id": 1021, "start": 8422.28, "end": 8437.28, "text": "Was geht mit dem Kerl"}, {"id": 1022, "start": 8437.28, "end": 8452.28, "text": "Was geht mit dem Kerl"}, {"id": 1023, "start": 8452.28, "end": 8467.28, "text": "Was geht mit dem Kerl"}, {"id": 1024, "start": 8467.28, "end": 8482.28, "text": "Was geht mit dem Kerl"}, {"id": 1025, "start": 8482.28, "end": 8497.28, "text": "Was geht mit dem Kerl"}, {"id": 1026, "start": 8497.28, "end": 8512.28, "text": "Was geht mit dem Kerl"}, {"id": 1027, "start": 8512.28, "end": 8527.28, "text": "Was geht mit dem Kerl"}, {"id": 1028, "start": 8527.28, "end": 8542.28, "text": "Was geht mit dem Kerl"}, {"id": 1029, "start": 8542.28, "end": 8557.28, "text": "Was geht mit dem Kerl"}, {"id": 1030, "start": 8557.28, "end": 8572.28, "text": "Was geht mit dem Kerl"}, {"id": 1031, "start": 8572.28, "end": 8587.28, "text": "Was geht mit dem Kerl"}, {"id": 1032, "start": 8587.28, "end": 8602.28, "text": "Was geht mit dem Kerl"}, {"id": 1033, "start": 8602.28, "end": 8617.28, "text": "Was geht mit dem Kerl"}, {"id": 1034, "start": 8617.28, "end": 8632.28, "text": "Was geht mit dem Kerl"}, {"id": 1035, "start": 8632.28, "end": 8647.28, "text": "Was geht mit dem Kerl"}, {"id": 1036, "start": 8647.28, "end": 8662.28, "text": "Was geht mit dem Kerl"}, {"id": 1037, "start": 8662.28, "end": 8677.28, "text": "Was geht mit dem Kerl"}, {"id": 1038, "start": 8677.28, "end": 8692.28, "text": "Was geht mit dem Kerl"}, {"id": 1039, "start": 8692.28, "end": 8707.28, "text": "Was geht mit dem Kerl"}, {"id": 1040, "start": 8707.28, "end": 8722.28, "text": "Was geht mit dem Kerl"}, {"id": 1041, "start": 8722.28, "end": 8737.28, "text": "Was geht mit dem Kerl"}, {"id": 1042, "start": 8737.28, "end": 8752.28, "text": "Was geht mit dem Kerl"}, {"id": 1043, "start": 8752.28, "end": 8767.28, "text": "Was geht mit dem Kerl"}, {"id": 1044, "start": 8767.28, "end": 8782.28, "text": "Was geht mit dem Kerl"}, {"id": 1045, "start": 8782.28, "end": 8797.28, "text": "Was geht mit dem Kerl"}, {"id": 1046, "start": 8797.28, "end": 8812.28, "text": "Was geht mit dem Kerl"}, {"id": 1047, "start": 8812.28, "end": 8827.28, "text": "Was geht mit dem Kerl"}, {"id": 1048, "start": 8827.28, "end": 8842.28, "text": "Was geht mit dem Kerl"}, {"id": 1049, "start": 8842.28, "end": 8857.28, "text": "Was geht mit dem Kerl"}, {"id": 1050, "start": 8857.28, "end": 8872.28, "text": "Was geht mit dem Kerl"}, {"id": 1051, "start": 8872.28, "end": 8887.28, "text": "Was geht mit dem Kerl"}, {"id": 1052, "start": 8887.28, "end": 8902.28, "text": "Was geht mit dem Kerl"}, {"id": 1053, "start": 8902.28, "end": 8917.28, "text": "Was geht mit dem Kerl"}, {"id": 1054, "start": 8917.28, "end": 8932.28, "text": "Was geht mit dem Kerl"}, {"id": 1055, "start": 8932.28, "end": 8947.28, "text": "Was geht mit dem Kerl"}, {"id": 1056, "start": 8947.28, "end": 8962.28, "text": "Was geht mit dem Kerl"}, {"id": 1057, "start": 8962.28, "end": 8977.28, "text": "Was geht mit dem Kerl"}, {"id": 1058, "start": 8977.28, "end": 8992.28, "text": "Was geht mit dem Kerl"}, {"id": 1059, "start": 8992.28, "end": 9007.28, "text": "Was geht mit dem Kerl"}, {"id": 1060, "start": 9007.28, "end": 9022.28, "text": "Was geht mit dem Kerl"}, {"id": 1061, "start": 9022.28, "end": 9037.28, "text": "Was geht mit dem Kerl"}, {"id": 1062, "start": 9037.28, "end": 9052.28, "text": "Was geht mit dem Kerl"}, {"id": 1063, "start": 9052.28, "end": 9067.28, "text": "Was geht mit dem Kerl"}, {"id": 1064, "start": 9067.28, "end": 9082.28, "text": "Was geht mit dem Kerl"}, {"id": 1065, "start": 9082.28, "end": 9097.28, "text": "Was geht mit dem Kerl"}, {"id": 1066, "start": 9097.28, "end": 9112.28, "text": "Was geht mit dem Kerl"}, {"id": 1067, "start": 9112.28, "end": 9127.28, "text": "Was geht mit dem Kerl"}, {"id": 1068, "start": 9127.28, "end": 9142.28, "text": "Was geht mit dem Kerl"}, {"id": 1069, "start": 9142.28, "end": 9157.28, "text": "Was geht mit dem Kerl"}, {"id": 1070, "start": 9157.28, "end": 9172.28, "text": "Was geht mit dem Kerl"}, {"id": 1071, "start": 9172.28, "end": 9187.28, "text": "Was geht mit dem Kerl"}, {"id": 1072, "start": 9187.28, "end": 9202.28, "text": "Was geht mit dem Kerl"}, {"id": 1073, "start": 9202.28, "end": 9217.28, "text": "Was geht mit dem Kerl"}, {"id": 1074, "start": 9217.28, "end": 9232.28, "text": "Was geht mit dem Kerl"}, {"id": 1075, "start": 9232.28, "end": 9247.28, "text": "Was geht mit dem Kerl"}, {"id": 1076, "start": 9247.28, "end": 9262.28, "text": "Was geht mit dem Kerl"}, {"id": 1077, "start": 9262.28, "end": 9277.28, "text": "Was geht mit dem Kerl"}, {"id": 1078, "start": 9277.28, "end": 9292.28, "text": "Was geht mit dem Kerl"}, {"id": 1079, "start": 9292.28, "end": 9307.28, "text": "Was geht mit dem Kerl"}, {"id": 1080, "start": 9307.28, "end": 9322.28, "text": "Was geht mit dem Kerl"}, {"id": 1081, "start": 9322.28, "end": 9337.28, "text": "Was geht mit dem Kerl"}, {"id": 1082, "start": 9337.28, "end": 9352.28, "text": "Was geht mit dem Kerl"}, {"id": 1083, "start": 9352.28, "end": 9367.28, "text": "Was geht mit dem Kerl"}, {"id": 1084, "start": 9367.28, "end": 9382.28, "text": "Was geht mit dem Kerl"}, {"id": 1085, "start": 9382.28, "end": 9397.28, "text": "Was geht mit dem Kerl"}, {"id": 1086, "start": 9397.28, "end": 9412.28, "text": "Was geht mit dem Kerl"}, {"id": 1087, "start": 9412.28, "end": 9427.28, "text": "Was geht mit dem Kerl"}, {"id": 1088, "start": 9427.28, "end": 9442.28, "text": "Was geht mit dem Kerl"}, {"id": 1089, "start": 9442.28, "end": 9457.28, "text": "Was geht mit dem Kerl"}, {"id": 1090, "start": 9457.28, "end": 9472.28, "text": "Was geht mit dem Kerl"}, {"id": 1091, "start": 9472.28, "end": 9487.28, "text": "Was geht mit dem Kerl"}, {"id": 1092, "start": 9487.28, "end": 9502.28, "text": "Was geht mit dem Kerl"}, {"id": 1093, "start": 9502.28, "end": 9517.28, "text": "Was geht mit dem Kerl"}, {"id": 1094, "start": 9517.28, "end": 9532.28, "text": "Was geht mit dem Kerl"}, {"id": 1095, "start": 9532.28, "end": 9547.28, "text": "Was geht mit dem Kerl"}, {"id": 1096, "start": 9547.28, "end": 9562.28, "text": "Was geht mit dem Kerl"}, {"id": 1097, "start": 9562.28, "end": 9577.28, "text": "Was geht mit dem Kerl"}, {"id": 1098, "start": 9577.28, "end": 9592.28, "text": "Was geht mit dem Kerl"}, {"id": 1099, "start": 9592.28, "end": 9607.28, "text": "Was geht mit dem Kerl"}, {"id": 1100, "start": 9607.28, "end": 9622.28, "text": "Was geht mit dem Kerl"}, {"id": 1101, "start": 9622.28, "end": 9637.28, "text": "Was geht mit dem Kerl"}, {"id": 1102, "start": 9637.28, "end": 9652.28, "text": "Was geht mit dem Kerl"}, {"id": 1103, "start": 9652.28, "end": 9667.28, "text": "Was geht mit dem Kerl"}, {"id": 1104, "start": 9667.28, "end": 9682.28, "text": "Was geht mit dem Kerl"}, {"id": 1105, "start": 9682.28, "end": 9697.28, "text": "Was geht mit dem Kerl"}, {"id": 1106, "start": 9697.28, "end": 9712.28, "text": "Was geht mit dem Kerl"}, {"id": 1107, "start": 9712.28, "end": 9727.28, "text": "Was geht mit dem Kerl"}, {"id": 1108, "start": 9727.28, "end": 9742.28, "text": "Was geht mit dem Kerl"}, {"id": 1109, "start": 9742.28, "end": 9757.28, "text": "Was geht mit dem Kerl"}, {"id": 1110, "start": 9757.28, "end": 9772.28, "text": "Was geht mit dem Kerl"}, {"id": 1111, "start": 9772.28, "end": 9787.28, "text": "Was geht mit dem Kerl"}, {"id": 1112, "start": 9787.28, "end": 9802.28, "text": "Was geht mit dem Kerl"}, {"id": 1113, "start": 9802.28, "end": 9817.28, "text": "Was geht mit dem Kerl"}, {"id": 1114, "start": 9817.28, "end": 9832.28, "text": "Was geht mit dem Kerl"}, {"id": 1115, "start": 9832.28, "end": 9847.28, "text": "Was geht mit dem Kerl"}, {"id": 1116, "start": 9847.28, "end": 9862.28, "text": "Was geht mit dem Kerl"}, {"id": 1117, "start": 9862.28, "end": 9877.28, "text": "Was geht mit dem Kerl"}, {"id": 1118, "start": 9877.28, "end": 9892.28, "text": "Was geht mit dem Kerl"}, {"id": 1119, "start": 9892.28, "end": 9907.28, "text": "Was geht mit dem Kerl"}, {"id": 1120, "start": 9907.28, "end": 9922.28, "text": "Was geht mit dem Kerl"}, {"id": 1121, "start": 9922.28, "end": 9937.28, "text": "Was geht mit dem Kerl"}, {"id": 1122, "start": 9937.28, "end": 9952.28, "text": "Was geht mit dem Kerl"}, {"id": 1123, "start": 9952.28, "end": 9967.28, "text": "Was geht mit dem Kerl"}, {"id": 1124, "start": 9967.28, "end": 9982.28, "text": "Was geht mit dem Kerl"}, {"id": 1125, "start": 9982.28, "end": 9997.28, "text": "Was geht mit dem Kerl"}, {"id": 1126, "start": 9997.28, "end": 10012.28, "text": "Was geht mit dem Kerl"}, {"id": 1127, "start": 10012.28, "end": 10027.28, "text": "Was geht mit dem Kerl"}, {"id": 1128, "start": 10027.28, "end": 10042.28, "text": "Was geht mit dem Kerl"}, {"id": 1129, "start": 10042.28, "end": 10057.28, "text": "Was geht mit dem Kerl"}, {"id": 1130, "start": 10057.28, "end": 10072.28, "text": "Was geht mit dem Kerl"}, {"id": 1131, "start": 10072.28, "end": 10087.28, "text": "Was geht mit dem Kerl"}, {"id": 1132, "start": 10087.28, "end": 10102.28, "text": "Was geht mit dem Kerl"}, {"id": 1133, "start": 10102.28, "end": 10117.28, "text": "Was geht mit dem Kerl"}, {"id": 1134, "start": 10117.28, "end": 10132.28, "text": "Was geht mit dem Kerl"}, {"id": 1135, "start": 10132.28, "end": 10147.28, "text": "Was geht mit dem Kerl"}, {"id": 1136, "start": 10147.28, "end": 10162.28, "text": "Was geht mit dem Kerl"}, {"id": 1137, "start": 10162.28, "end": 10177.28, "text": "Was geht mit dem Kerl"}, {"id": 1138, "start": 10177.28, "end": 10192.28, "text": "Was geht mit dem Kerl"}, {"id": 1139, "start": 10192.28, "end": 10207.28, "text": "Was geht mit dem Kerl"}, {"id": 1140, "start": 10207.28, "end": 10222.28, "text": "Was geht mit dem Kerl"}, {"id": 1141, "start": 10222.28, "end": 10237.28, "text": "Was geht mit dem Kerl"}, {"id": 1142, "start": 10237.28, "end": 10252.28, "text": "Was geht mit dem Kerl"}, {"id": 1143, "start": 10252.28, "end": 10267.28, "text": "Was geht mit dem Kerl"}, {"id": 1144, "start": 10267.28, "end": 10282.28, "text": "Was geht mit dem Kerl"}, {"id": 1145, "start": 10282.28, "end": 10297.28, "text": "Was geht mit dem Kerl"}, {"id": 1146, "start": 10297.28, "end": 10312.28, "text": "Was geht mit dem Kerl"}, {"id": 1147, "start": 10312.28, "end": 10327.28, "text": "Was geht mit dem Kerl"}, {"id": 1148, "start": 10327.28, "end": 10342.28, "text": "Was geht mit dem Kerl"}, {"id": 1149, "start": 10342.28, "end": 10357.28, "text": "Was geht mit dem Kerl"}, {"id": 1150, "start": 10357.28, "end": 10372.28, "text": "Was geht mit dem Kerl"}, {"id": 1151, "start": 10372.28, "end": 10387.28, "text": "Was geht mit dem Kerl"}, {"id": 1152, "start": 10387.28, "end": 10402.28, "text": "Was geht mit dem Kerl"}, {"id": 1153, "start": 10402.28, "end": 10417.28, "text": "Was geht mit dem Kerl"}, {"id": 1154, "start": 10417.28, "end": 10432.28, "text": "Was geht mit dem Kerl"}, {"id": 1155, "start": 10432.28, "end": 10447.28, "text": "Was geht mit dem Kerl"}, {"id": 1156, "start": 10447.28, "end": 10462.28, "text": "Was geht mit dem Kerl"}, {"id": 1157, "start": 10462.28, "end": 10477.28, "text": "Was geht mit dem Kerl"}, {"id": 1158, "start": 10477.28, "end": 10492.28, "text": "Was geht mit dem Kerl"}, {"id": 1159, "start": 10492.28, "end": 10507.28, "text": "Was geht mit dem Kerl"}, {"id": 1160, "start": 10507.28, "end": 10522.28, "text": "Was geht mit dem Kerl"}, {"id": 1161, "start": 10522.28, "end": 10537.28, "text": "Was geht mit dem Kerl"}, {"id": 1162, "start": 10537.28, "end": 10552.28, "text": "Was geht mit dem Kerl"}, {"id": 1163, "start": 10552.28, "end": 10567.28, "text": "Was geht mit dem Kerl"}, {"id": 1164, "start": 10567.28, "end": 10582.28, "text": "Was geht mit dem Kerl"}, {"id": 1165, "start": 10582.28, "end": 10597.28, "text": "Was geht mit dem Kerl"}, {"id": 1166, "start": 10597.28, "end": 10612.28, "text": "Was geht mit dem Kerl"}, {"id": 1167, "start": 10612.28, "end": 10627.28, "text": "Was geht mit dem Kerl"}, {"id": 1168, "start": 10627.28, "end": 10642.28, "text": "Was geht mit dem Kerl"}, {"id": 1169, "start": 10642.28, "end": 10657.28, "text": "Was geht mit dem Kerl"}, {"id": 1170, "start": 10657.28, "end": 10672.28, "text": "Was geht mit dem Kerl"}, {"id": 1171, "start": 10672.28, "end": 10687.28, "text": "Was geht mit dem Kerl"}, {"id": 1172, "start": 10687.28, "end": 10702.28, "text": "Was geht mit dem Kerl"}, {"id": 1173, "start": 10702.28, "end": 10717.28, "text": "Was geht mit dem Kerl"}, {"id": 1174, "start": 10717.28, "end": 10732.28, "text": "Was geht mit dem Kerl"}, {"id": 1175, "start": 10732.28, "end": 10747.28, "text": "Was geht mit dem Kerl"}, {"id": 1176, "start": 10747.28, "end": 10762.28, "text": "Was geht mit dem Kerl"}, {"id": 1177, "start": 10762.28, "end": 10777.28, "text": "Was geht mit dem Kerl"}, {"id": 1178, "start": 10777.28, "end": 10792.28, "text": "Was geht mit dem Kerl"}, {"id": 1179, "start": 10792.28, "end": 10807.28, "text": "Was geht mit dem Kerl"}, {"id": 1180, "start": 10807.28, "end": 10822.28, "text": "Was geht mit dem Kerl"}, {"id": 1181, "start": 10822.28, "end": 10837.28, "text": "Was geht mit dem Kerl"}, {"id": 1182, "start": 10837.28, "end": 10852.28, "text": "Was geht mit dem Kerl"}, {"id": 1183, "start": 10852.28, "end": 10867.28, "text": "Was geht mit dem Kerl"}, {"id": 1184, "start": 10867.28, "end": 10882.28, "text": "Was geht mit dem Kerl"}, {"id": 1185, "start": 10882.28, "end": 10897.28, "text": "Was geht mit dem Kerl"}, {"id": 1186, "start": 10897.28, "end": 10912.28, "text": "Was geht mit dem Kerl"}, {"id": 1187, "start": 10912.28, "end": 10927.28, "text": "Was geht mit dem Kerl"}, {"id": 1188, "start": 10927.28, "end": 10942.28, "text": "Was geht mit dem Kerl"}, {"id": 1189, "start": 10942.28, "end": 10957.28, "text": "Was geht mit dem Kerl"}, {"id": 1190, "start": 10957.28, "end": 10972.28, "text": "Was geht mit dem Kerl"}, {"id": 1191, "start": 10972.28, "end": 10987.28, "text": "Was geht mit dem Kerl"}, {"id": 1192, "start": 10987.28, "end": 11002.28, "text": "Was geht mit dem Kerl"}, {"id": 1193, "start": 11002.28, "end": 11017.28, "text": "Was geht mit dem Kerl"}, {"id": 1194, "start": 11017.28, "end": 11032.28, "text": "Was geht mit dem Kerl"}, {"id": 1195, "start": 11032.28, "end": 11047.28, "text": "Was geht mit dem Kerl"}, {"id": 1196, "start": 11047.28, "end": 11062.28, "text": "Was geht mit dem Kerl"}, {"id": 1197, "start": 11062.28, "end": 11077.28, "text": "Was geht mit dem Kerl"}, {"id": 1198, "start": 11077.28, "end": 11092.28, "text": "Was geht mit dem Kerl"}, {"id": 1199, "start": 11092.28, "end": 11107.28, "text": "Was geht mit dem Kerl"}, {"id": 1200, "start": 11107.28, "end": 11122.28, "text": "Was geht mit dem Kerl"}, {"id": 1201, "start": 11122.28, "end": 11137.28, "text": "Was geht mit dem Kerl"}, {"id": 1202, "start": 11137.28, "end": 11152.28, "text": "Was geht mit dem Kerl"}, {"id": 1203, "start": 11152.28, "end": 11167.28, "text": "Was geht mit dem Kerl"}, {"id": 1204, "start": 11167.28, "end": 11182.28, "text": "Was geht mit dem Kerl"}, {"id": 1205, "start": 11182.28, "end": 11197.28, "text": "Was geht mit dem Kerl"}, {"id": 1206, "start": 11197.28, "end": 11212.28, "text": "Was geht mit dem Kerl"}, {"id": 1207, "start": 11212.28, "end": 11227.28, "text": "Was geht mit dem Kerl"}, {"id": 1208, "start": 11227.28, "end": 11242.28, "text": "Was geht mit dem Kerl"}, {"id": 1209, "start": 11242.28, "end": 11257.28, "text": "Was geht mit dem Kerl"}, {"id": 1210, "start": 11257.28, "end": 11272.28, "text": "Was geht mit dem Kerl"}, {"id": 1211, "start": 11272.28, "end": 11287.28, "text": "Was geht mit dem Kerl"}, {"id": 1212, "start": 11287.28, "end": 11302.28, "text": "Was geht mit dem Kerl"}, {"id": 1213, "start": 11302.28, "end": 11317.28, "text": "Was geht mit dem Kerl"}, {"id": 1214, "start": 11317.28, "end": 11332.28, "text": "Was geht mit dem Kerl"}, {"id": 1215, "start": 11332.28, "end": 11347.28, "text": "Was geht mit dem Kerl"}, {"id": 1216, "start": 11347.28, "end": 11362.28, "text": "Was geht mit dem Kerl"}, {"id": 1217, "start": 11362.28, "end": 11377.28, "text": "Was geht mit dem Kerl"}, {"id": 1218, "start": 11377.28, "end": 11392.28, "text": "Was geht mit dem Kerl"}, {"id": 1219, "start": 11392.28, "end": 11407.28, "text": "Was geht mit dem Kerl"}, {"id": 1220, "start": 11407.28, "end": 11422.28, "text": "Was geht mit dem Kerl"}, {"id": 1221, "start": 11422.28, "end": 11437.28, "text": "Was geht mit dem Kerl"}, {"id": 1222, "start": 11437.28, "end": 11452.28, "text": "Was geht mit dem Kerl"}, {"id": 1223, "start": 11452.28, "end": 11467.28, "text": "Was geht mit dem Kerl"}, {"id": 1224, "start": 11467.28, "end": 11482.28, "text": "Was geht mit dem Kerl"}, {"id": 1225, "start": 11482.28, "end": 11497.28, "text": "Was geht mit dem Kerl"}, {"id": 1226, "start": 11497.28, "end": 11512.28, "text": "Was geht mit dem Kerl"}, {"id": 1227, "start": 11512.28, "end": 11527.28, "text": "Was geht mit dem Kerl"}, {"id": 1228, "start": 11527.28, "end": 11542.28, "text": "Was geht mit dem Kerl"}, {"id": 1229, "start": 11542.28, "end": 11557.28, "text": "Was geht mit dem Kerl"}, {"id": 1230, "start": 11557.28, "end": 11572.28, "text": "Was geht mit dem Kerl"}, {"id": 1231, "start": 11572.28, "end": 11587.28, "text": "Was geht mit dem Kerl"}, {"id": 1232, "start": 11587.28, "end": 11602.28, "text": "Was geht mit dem Kerl"}, {"id": 1233, "start": 11602.28, "end": 11617.28, "text": "Was geht mit dem Kerl"}, {"id": 1234, "start": 11617.28, "end": 11632.28, "text": "Was geht mit dem Kerl"}, {"id": 1235, "start": 11632.28, "end": 11647.28, "text": "Was geht mit dem Kerl"}, {"id": 1236, "start": 11647.28, "end": 11662.28, "text": "Was geht mit dem Kerl"}, {"id": 1237, "start": 11662.28, "end": 11677.28, "text": "Was geht mit dem Kerl"}, {"id": 1238, "start": 11677.28, "end": 11692.28, "text": "Was geht mit dem Kerl"}, {"id": 1239, "start": 11692.28, "end": 11707.28, "text": "Was geht mit dem Kerl"}, {"id": 1240, "start": 11707.28, "end": 11722.28, "text": "Was geht mit dem Kerl"}, {"id": 1241, "start": 11722.28, "end": 11737.28, "text": "Was geht mit dem Kerl"}, {"id": 1242, "start": 11737.28, "end": 11752.28, "text": "Was geht mit dem Kerl"}, {"id": 1243, "start": 11752.28, "end": 11767.28, "text": "Was geht mit dem Kerl"}, {"id": 1244, "start": 11767.28, "end": 11782.28, "text": "Was geht mit dem Kerl"}, {"id": 1245, "start": 11782.28, "end": 11797.28, "text": "Was geht mit dem Kerl"}, {"id": 1246, "start": 11797.28, "end": 11812.28, "text": "Was geht mit dem Kerl"}, {"id": 1247, "start": 11812.28, "end": 11827.28, "text": "Was geht mit dem Kerl"}, {"id": 1248, "start": 11827.28, "end": 11842.28, "text": "Was geht mit dem Kerl"}, {"id": 1249, "start": 11842.28, "end": 11857.28, "text": "Was geht mit dem Kerl"}, {"id": 1250, "start": 11857.28, "end": 11872.28, "text": "Was geht mit dem Kerl"}, {"id": 1251, "start": 11872.28, "end": 11887.28, "text": "Was geht mit dem Kerl"}, {"id": 1252, "start": 11887.28, "end": 11902.28, "text": "Was geht mit dem Kerl"}, {"id": 1253, "start": 11902.28, "end": 11917.28, "text": "Was geht mit dem Kerl"}, {"id": 1254, "start": 11917.28, "end": 11932.28, "text": "Was geht mit dem Kerl"}, {"id": 1255, "start": 11932.28, "end": 11947.28, "text": "Was geht mit dem Kerl"}, {"id": 1256, "start": 11947.28, "end": 11962.28, "text": "Was geht mit dem Kerl"}, {"id": 1257, "start": 11962.28, "end": 11977.28, "text": "Was geht mit dem Kerl"}, {"id": 1258, "start": 11977.28, "end": 11992.28, "text": "Was geht mit dem Kerl"}, {"id": 1259, "start": 11992.28, "end": 12007.28, "text": "Was geht mit dem Kerl"}, {"id": 1260, "start": 12007.28, "end": 12022.28, "text": "Was geht mit dem Kerl"}, {"id": 1261, "start": 12022.28, "end": 12037.28, "text": "Was geht mit dem Kerl"}, {"id": 1262, "start": 12037.28, "end": 12052.28, "text": "Was geht mit dem Kerl"}, {"id": 1263, "start": 12052.28, "end": 12067.28, "text": "Was geht mit dem Kerl"}, {"id": 1264, "start": 12067.28, "end": 12082.28, "text": "Was geht mit dem Kerl"}, {"id": 1265, "start": 12082.28, "end": 12097.28, "text": "Was geht mit dem Kerl"}, {"id": 1266, "start": 12097.28, "end": 12112.28, "text": "Was geht mit dem Kerl"}, {"id": 1267, "start": 12112.28, "end": 12127.28, "text": "Was geht mit dem Kerl"}, {"id": 1268, "start": 12127.28, "end": 12142.28, "text": "Was geht mit dem Kerl"}, {"id": 1269, "start": 12142.28, "end": 12157.28, "text": "Was geht mit dem Kerl"}, {"id": 1270, "start": 12157.28, "end": 12172.28, "text": "Was geht mit dem Kerl"}, {"id": 1271, "start": 12172.28, "end": 12187.28, "text": "Was geht mit dem Kerl"}, {"id": 1272, "start": 12187.28, "end": 12202.28, "text": "Was geht mit dem Kerl"}, {"id": 1273, "start": 12202.28, "end": 12217.28, "text": "Was geht mit dem Kerl"}, {"id": 1274, "start": 12217.28, "end": 12232.28, "text": "Was geht mit dem Kerl"}, {"id": 1275, "start": 12232.28, "end": 12247.28, "text": "Was geht mit dem Kerl"}, {"id": 1276, "start": 12247.28, "end": 12262.28, "text": "Was geht mit dem Kerl"}, {"id": 1277, "start": 12262.28, "end": 12277.28, "text": "Was geht mit dem Kerl"}, {"id": 1278, "start": 12277.28, "end": 12292.28, "text": "Was geht mit dem Kerl"}, {"id": 1279, "start": 12292.28, "end": 12307.28, "text": "Was geht mit dem Kerl"}, {"id": 1280, "start": 12307.28, "end": 12322.28, "text": "Was geht mit dem Kerl"}, {"id": 1281, "start": 12322.28, "end": 12337.28, "text": "Was geht mit dem Kerl"}, {"id": 1282, "start": 12337.28, "end": 12352.28, "text": "Was geht mit dem Kerl"}, {"id": 1283, "start": 12352.28, "end": 12367.28, "text": "Was geht mit dem Kerl"}, {"id": 1284, "start": 12367.28, "end": 12382.28, "text": "Was geht mit dem Kerl"}, {"id": 1285, "start": 12382.28, "end": 12397.28, "text": "Was geht mit dem Kerl"}, {"id": 1286, "start": 12397.28, "end": 12412.28, "text": "Was geht mit dem Kerl"}, {"id": 1287, "start": 12412.28, "end": 12427.28, "text": "Was geht mit dem Kerl"}, {"id": 1288, "start": 12427.28, "end": 12442.28, "text": "Was geht mit dem Kerl"}, {"id": 1289, "start": 12442.28, "end": 12457.28, "text": "Was geht mit dem Kerl"}, {"id": 1290, "start": 12457.28, "end": 12472.28, "text": "Was geht mit dem Kerl"}, {"id": 1291, "start": 12472.28, "end": 12487.28, "text": "Was geht mit dem Kerl"}, {"id": 1292, "start": 12487.28, "end": 12502.28, "text": "Was geht mit dem Kerl"}, {"id": 1293, "start": 12502.28, "end": 12517.28, "text": "Was geht mit dem Kerl"}, {"id": 1294, "start": 12517.28, "end": 12532.28, "text": "Was geht mit dem Kerl"}, {"id": 1295, "start": 12532.28, "end": 12547.28, "text": "Was geht mit dem Kerl"}, {"id": 1296, "start": 12547.28, "end": 12562.28, "text": "Was geht mit dem Kerl"}, {"id": 1297, "start": 12562.28, "end": 12577.28, "text": "Was geht mit dem Kerl"}, {"id": 1298, "start": 12577.28, "end": 12592.28, "text": "Was geht mit dem Kerl"}, {"id": 1299, "start": 12592.28, "end": 12607.28, "text": "Was geht mit dem Kerl"}, {"id": 1300, "start": 12607.28, "end": 12622.28, "text": "Was geht mit dem Kerl"}, {"id": 1301, "start": 12622.28, "end": 12637.28, "text": "Was geht mit dem Kerl"}, {"id": 1302, "start": 12637.28, "end": 12652.28, "text": "Was geht mit dem Kerl"}, {"id": 1303, "start": 12652.28, "end": 12667.28, "text": "Was geht mit dem Kerl"}, {"id": 1304, "start": 12667.28, "end": 12682.28, "text": "Was geht mit dem Kerl"}, {"id": 1305, "start": 12682.28, "end": 12697.28, "text": "Was geht mit dem Kerl"}, {"id": 1306, "start": 12697.28, "end": 12712.28, "text": "Was geht mit dem Kerl"}, {"id": 1307, "start": 12712.28, "end": 12727.28, "text": "Was geht mit dem Kerl"}, {"id": 1308, "start": 12727.28, "end": 12742.28, "text": "Was geht mit dem Kerl"}, {"id": 1309, "start": 12742.28, "end": 12757.28, "text": "Was geht mit dem Kerl"}, {"id": 1310, "start": 12757.28, "end": 12772.28, "text": "Was geht mit dem Kerl"}, {"id": 1311, "start": 12772.28, "end": 12787.28, "text": "Was geht mit dem Kerl"}, {"id": 1312, "start": 12787.28, "end": 12802.28, "text": "Was geht mit dem Kerl"}, {"id": 1313, "start": 12802.28, "end": 12817.28, "text": "Was geht mit dem Kerl"}, {"id": 1314, "start": 12817.28, "end": 12832.28, "text": "Was geht mit dem Kerl"}, {"id": 1315, "start": 12832.28, "end": 12847.28, "text": "Was geht mit dem Kerl"}, {"id": 1316, "start": 12847.28, "end": 12862.28, "text": "Was geht mit dem Kerl"}, {"id": 1317, "start": 12862.28, "end": 12877.28, "text": "Was geht mit dem Kerl"}, {"id": 1318, "start": 12877.28, "end": 12892.28, "text": "Was geht mit dem Kerl"}, {"id": 1319, "start": 12892.28, "end": 12907.28, "text": "Was geht mit dem Kerl"}, {"id": 1320, "start": 12907.28, "end": 12922.28, "text": "Was geht mit dem Kerl"}, {"id": 1321, "start": 12922.28, "end": 12937.28, "text": "Was geht mit dem Kerl"}, {"id": 1322, "start": 12937.28, "end": 12952.28, "text": "Was geht mit dem Kerl"}, {"id": 1323, "start": 12952.28, "end": 12967.28, "text": "Was geht mit dem Kerl"}, {"id": 1324, "start": 12967.28, "end": 12982.28, "text": "Was geht mit dem Kerl"}, {"id": 1325, "start": 12982.28, "end": 12997.28, "text": "Was geht mit dem Kerl"}, {"id": 1326, "start": 12997.28, "end": 13012.28, "text": "Was geht mit dem Kerl"}, {"id": 1327, "start": 13012.28, "end": 13027.28, "text": "Was geht mit dem Kerl"}, {"id": 1328, "start": 13027.28, "end": 13042.28, "text": "Was geht mit dem Kerl"}, {"id": 1329, "start": 13042.28, "end": 13057.28, "text": "Was geht mit dem Kerl"}, {"id": 1330, "start": 13057.28, "end": 13072.28, "text": "Was geht mit dem Kerl"}, {"id": 1331, "start": 13072.28, "end": 13087.28, "text": "Was geht mit dem Kerl"}, {"id": 1332, "start": 13087.28, "end": 13102.28, "text": "Was geht mit dem Kerl"}, {"id": 1333, "start": 13102.28, "end": 13117.28, "text": "Was geht mit dem Kerl"}, {"id": 1334, "start": 13117.28, "end": 13132.28, "text": "Was geht mit dem Kerl"}, {"id": 1335, "start": 13132.28, "end": 13147.28, "text": "Was geht mit dem Kerl"}, {"id": 1336, "start": 13147.28, "end": 13162.28, "text": "Was geht mit dem Kerl"}, {"id": 1337, "start": 13162.28, "end": 13177.28, "text": "Was geht mit dem Kerl"}, {"id": 1338, "start": 13177.28, "end": 13192.28, "text": "Was geht mit dem Kerl"}, {"id": 1339, "start": 13192.28, "end": 13207.28, "text": "Was geht mit dem Kerl"}, {"id": 1340, "start": 13207.28, "end": 13222.28, "text": "Was geht mit dem Kerl"}, {"id": 1341, "start": 13222.28, "end": 13237.28, "text": "Was geht mit dem Kerl"}, {"id": 1342, "start": 13237.28, "end": 13252.28, "text": "Was geht mit dem Kerl"}, {"id": 1343, "start": 13252.28, "end": 13267.28, "text": "Was geht mit dem Kerl"}, {"id": 1344, "start": 13267.28, "end": 13282.28, "text": "Was geht mit dem Kerl"}, {"id": 1345, "start": 13282.28, "end": 13297.28, "text": "Was geht mit dem Kerl"}, {"id": 1346, "start": 13297.28, "end": 13312.28, "text": "Was geht mit dem Kerl"}, {"id": 1347, "start": 13312.28, "end": 13327.28, "text": "Was geht mit dem Kerl"}, {"id": 1348, "start": 13327.28, "end": 13342.28, "text": "Was geht mit dem Kerl"}, {"id": 1349, "start": 13342.28, "end": 13357.28, "text": "Was geht mit dem Kerl"}, {"id": 1350, "start": 13357.28, "end": 13372.28, "text": "Was geht mit dem Kerl"}, {"id": 1351, "start": 13372.28, "end": 13387.28, "text": "Was geht mit dem Kerl"}, {"id": 1352, "start": 13387.28, "end": 13402.28, "text": "Was geht mit dem Kerl"}, {"id": 1353, "start": 13402.28, "end": 13417.28, "text": "Was geht mit dem Kerl"}, {"id": 1354, "start": 13417.28, "end": 13432.28, "text": "Was geht mit dem Kerl"}, {"id": 1355, "start": 13432.28, "end": 13447.28, "text": "Was geht mit dem Kerl"}, {"id": 1356, "start": 13447.28, "end": 13462.28, "text": "Was geht mit dem Kerl"}, {"id": 1357, "start": 13462.28, "end": 13477.28, "text": "Was geht mit dem Kerl"}, {"id": 1358, "start": 13477.28, "end": 13492.28, "text": "Was geht mit dem Kerl"}, {"id": 1359, "start": 13492.28, "end": 13507.28, "text": "Was geht mit dem Kerl"}, {"id": 1360, "start": 13507.28, "end": 13522.28, "text": "Was geht mit dem Kerl"}, {"id": 1361, "start": 13522.28, "end": 13537.28, "text": "Was geht mit dem Kerl"}, {"id": 1362, "start": 13537.28, "end": 13552.28, "text": "Was geht mit dem Kerl"}, {"id": 1363, "start": 13552.28, "end": 13567.28, "text": "Was geht mit dem Kerl"}, {"id": 1364, "start": 13567.28, "end": 13582.28, "text": "Was geht mit dem Kerl"}, {"id": 1365, "start": 13582.28, "end": 13597.28, "text": "Was geht mit dem Kerl"}, {"id": 1366, "start": 13597.28, "end": 13612.28, "text": "Was geht mit dem Kerl"}, {"id": 1367, "start": 13612.28, "end": 13627.28, "text": "Was geht mit dem Kerl"}, {"id": 1368, "start": 13627.28, "end": 13642.28, "text": "Was geht mit dem Kerl"}, {"id": 1369, "start": 13642.28, "end": 13657.28, "text": "Was geht mit dem Kerl"}, {"id": 1370, "start": 13657.28, "end": 13672.28, "text": "Was geht mit dem Kerl"}, {"id": 1371, "start": 13672.28, "end": 13687.28, "text": "Was geht mit dem Kerl"}, {"id": 1372, "start": 13687.28, "end": 13702.28, "text": "Was geht mit dem Kerl"}, {"id": 1373, "start": 13702.28, "end": 13717.28, "text": "Was geht mit dem Kerl"}, {"id": 1374, "start": 13717.28, "end": 13732.28, "text": "Was geht mit dem Kerl"}, {"id": 1375, "start": 13732.28, "end": 13747.28, "text": "Was geht mit dem Kerl"}, {"id": 1376, "start": 13747.28, "end": 13762.28, "text": "Was geht mit dem Kerl"}, {"id": 1377, "start": 13762.28, "end": 13777.28, "text": "Was geht mit dem Kerl"}, {"id": 1378, "start": 13777.28, "end": 13792.28, "text": "Was geht mit dem Kerl"}, {"id": 1379, "start": 13792.28, "end": 13807.28, "text": "Was geht mit dem Kerl"}, {"id": 1380, "start": 13807.28, "end": 13822.28, "text": "Was geht mit dem Kerl"}, {"id": 1381, "start": 13822.28, "end": 13837.28, "text": "Was geht mit dem Kerl"}, {"id": 1382, "start": 13837.28, "end": 13852.28, "text": "Was geht mit dem Kerl"}, {"id": 1383, "start": 13852.28, "end": 13867.28, "text": "Was geht mit dem Kerl"}, {"id": 1384, "start": 13867.28, "end": 13882.28, "text": "Was geht mit dem Kerl"}, {"id": 1385, "start": 13882.28, "end": 13897.28, "text": "Was geht mit dem Kerl"}, {"id": 1386, "start": 13897.28, "end": 13912.28, "text": "Was geht mit dem Kerl"}, {"id": 1387, "start": 13912.28, "end": 13927.28, "text": "Was geht mit dem Kerl"}, {"id": 1388, "start": 13927.28, "end": 13942.28, "text": "Was geht mit dem Kerl"}, {"id": 1389, "start": 13942.28, "end": 13957.28, "text": "Was geht mit dem Kerl"}, {"id": 1390, "start": 13957.28, "end": 13972.28, "text": "Was geht mit dem Kerl"}, {"id": 1391, "start": 13972.28, "end": 13987.28, "text": "Was geht mit dem Kerl"}, {"id": 1392, "start": 13987.28, "end": 14002.28, "text": "Was geht mit dem Kerl"}, {"id": 1393, "start": 14002.28, "end": 14017.28, "text": "Was geht mit dem Kerl"}, {"id": 1394, "start": 14017.28, "end": 14032.28, "text": "Was geht mit dem Kerl"}, {"id": 1395, "start": 14032.28, "end": 14047.28, "text": "Was geht mit dem Kerl"}, {"id": 1396, "start": 14047.28, "end": 14062.28, "text": "Was geht mit dem Kerl"}, {"id": 1397, "start": 14062.28, "end": 14077.28, "text": "Was geht mit dem Kerl"}, {"id": 1398, "start": 14077.28, "end": 14092.28, "text": "Was geht mit dem Kerl"}, {"id": 1399, "start": 14092.28, "end": 14107.28, "text": "Was geht mit dem Kerl"}, {"id": 1400, "start": 14107.28, "end": 14122.28, "text": "Was geht mit dem Kerl"}, {"id": 1401, "start": 14122.28, "end": 14137.28, "text": "Was geht mit dem Kerl"}, {"id": 1402, "start": 14137.28, "end": 14152.28, "text": "Was geht mit dem Kerl"}, {"id": 1403, "start": 14152.28, "end": 14167.28, "text": "Was geht mit dem Kerl"}, {"id": 1404, "start": 14167.28, "end": 14182.28, "text": "Was geht mit dem Kerl"}, {"id": 1405, "start": 14182.28, "end": 14197.28, "text": "Was geht mit dem Kerl"}, {"id": 1406, "start": 14197.28, "end": 14212.28, "text": "Was geht mit dem Kerl"}, {"id": 1407, "start": 14212.28, "end": 14227.28, "text": "Was geht mit dem Kerl"}, {"id": 1408, "start": 14227.28, "end": 14242.28, "text": "Was geht mit dem Kerl"}, {"id": 1409, "start": 14242.28, "end": 14257.28, "text": "Was geht mit dem Kerl"}, {"id": 1410, "start": 14257.28, "end": 14272.28, "text": "Was geht mit dem Kerl"}, {"id": 1411, "start": 14272.28, "end": 14287.28, "text": "Was geht mit dem Kerl"}, {"id": 1412, "start": 14287.28, "end": 14302.28, "text": "Was geht mit dem Kerl"}, {"id": 1413, "start": 14302.28, "end": 14317.28, "text": "Was geht mit dem Kerl"}, {"id": 1414, "start": 14317.28, "end": 14332.28, "text": "Was geht mit dem Kerl"}, {"id": 1415, "start": 14332.28, "end": 14347.28, "text": "Was geht mit dem Kerl"}, {"id": 1416, "start": 14347.28, "end": 14362.28, "text": "Was geht mit dem Kerl"}, {"id": 1417, "start": 14362.28, "end": 14377.28, "text": "Was geht mit dem Kerl"}, {"id": 1418, "start": 14377.28, "end": 14392.28, "text": "Was geht mit dem Kerl"}, {"id": 1419, "start": 14392.28, "end": 14407.28, "text": "Was geht mit dem Kerl"}, {"id": 1420, "start": 14407.28, "end": 14422.28, "text": "Was geht mit dem Kerl"}, {"id": 1421, "start": 14422.28, "end": 14437.28, "text": "Was geht mit dem Kerl"}, {"id": 1422, "start": 14437.28, "end": 14452.28, "text": "Was geht mit dem Kerl"}, {"id": 1423, "start": 14452.28, "end": 14467.28, "text": "Was geht mit dem Kerl"}, {"id": 1424, "start": 14467.28, "end": 14482.28, "text": "Was geht mit dem Kerl"}, {"id": 1425, "start": 14482.28, "end": 14497.28, "text": "Was geht mit dem Kerl"}, {"id": 1426, "start": 14497.28, "end": 14512.28, "text": "Was geht mit dem Kerl"}, {"id": 1427, "start": 14512.28, "end": 14527.28, "text": "Was geht mit dem Kerl"}, {"id": 1428, "start": 14527.28, "end": 14542.28, "text": "Was geht mit dem Kerl"}, {"id": 1429, "start": 14542.28, "end": 14557.28, "text": "Was geht mit dem Kerl"}, {"id": 1430, "start": 14557.28, "end": 14572.28, "text": "Was geht mit dem Kerl"}, {"id": 1431, "start": 14572.28, "end": 14587.28, "text": "Was geht mit dem Kerl"}, {"id": 1432, "start": 14587.28, "end": 14602.28, "text": "Was geht mit dem Kerl"}, {"id": 1433, "start": 14602.28, "end": 14617.28, "text": "Was geht mit dem Kerl"}, {"id": 1434, "start": 14617.28, "end": 14632.28, "text": "Was geht mit dem Kerl"}, {"id": 1435, "start": 14632.28, "end": 14647.28, "text": "Was geht mit dem Kerl"}]}