{"text": "Pock, Pock PockPock Pock PockBaschen alter BaschenPock Pock Pock Pock PockGarefirePock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockPock PockDennis ist zum ersten Mal am StartJonas auch zum ersten Mal am StartHugeDer Icefreak hat subscribtJojo hat subscribtGehts aber ab hierDas Scam Train fährtSo, jetzt habe ich mich ein bisschenausgelassen über die Bahnund alte HandysÜbrigens LeuteSoll ich euch mal erzählen, was ich geradeIch hab gerade richtig, richtig niceFutterstells gemachtIch hab Pizza, HutBarbecueBarbecue Bacon LoversgefuddertFalle dir aus Deinen für den SubExcellentEr ist daEr ist daMax, mach malShoutout an michNein, ich mach keine ShoutoutsWeißt du warum?Weil die Leute mittlerweile krassChebaten, was Usernamen angehtUnd ich mir immer Gedankenmache, dass wenn man den Usernamen falschausspricht, dass man dann irgendwasBannwürdiges sagen kannAber ich kannShoutout an denDas Serif machen, oder? Das ist kein ProblemAber ich spreche dasbestimmt nicht komplett ausWer weiß, was das falsch betont bedeutetJaWerden sieGuck malDas ist so ein Fond von GoogleFondsIch, ich traueder ganzen Sache nichtMacht Twitch das mit Bots?Na ja, das wären schon richtigeLeute, seien wir mal ernsthaftIch gehe davon aus, dass vonwir grad 210 Leute im Chat. Also ich gehe davon aus, dass bei jedem Streamer, sag malso, selbst bei ganz kleinen, dass es einen gewissen Anteil der Zuschauer gibt, die nichtzuschauen, weil sie den Streamer gerne zugucken, sondern weil sie ihn hassen und einfach nurwarten, dass er irgendwie Scheiße baut, um ihn dann zu reporten. 100 Pro, das gibt'sbei mir und es gibt es wahrscheinlich überall anders auch. Richtige Hater, genau. Die guckenden Stream nur, dass irgendwie einer was falsch betont, was falsch ausspricht, dann gleichreport, report, report, report, report. Und wenn er dann gebannt wird, dann geht ihn einerab. So sieht's aus. So, ich zeig euch jetzt mal was. Also, ich switche mal kurz auf dieKamera. Hast du mal Windows Subsystem für Android probiert? Nein, gibt's das mittlerweile?Ich dachte, das gibt's gar nicht. Das haben sie abgeschafft wieder. Also, ich zeig euchjetzt mal was. Bevor wir zur Steckdosenleiste kommen, ich zeig euch noch mal kurz was anderes.Oder auch nicht mein Finger, den habt ihr ja mittlerweile oft genug gesehen. Ups. Ichzeig euch was anderes. Ich glaube, das ist das Richtige. Ja. Die waren nämlich diesmalecht schnell. Ich hab ja ESPs bestellt, D1 Minis. Das hat jetzt nur ein paar Tage gedauert,da waren die am Start 10 Stück. Poggers. Das heißt, da stehen irgendwelchen LED Projektenund Dingern jetzt nichts mehr im Wege. Wir haben wieder alles, was wir brauchen. 10 D1Minis für alle möglichen Sachen. Also, die waren wirklich schnell. So, und jetzt kommenwir zur eigentlichen Sache, warum ich heute den Stream angemacht hab. Ich mach heute abernicht so viel Hektik. Ich bin echt ziemlich kaputt dank der Bahn und sinnlos in den Meergefahren, Leute. Ihr müsst euch das mal geben. Ich habe heute auf der Arbeit nichts gemacht,weil ich musste, ich zeig es euch mal auf Twitter, den ganzen Tag total sinnlos mieten.Guckt euch das mal an. Das ist doch nicht normal. Das war so schlimm. Ich hatte um 9 Uhr parallelzwei Meetings gleichzeitig. Was soll das denn geben, wenn es fertig ist? Konntest du dieMeetings nicht auch digital machen? Doch, natürlich. Die waren ja auch alle digital.Das ist der Witz. Es hat sich überhaupt nicht gelohnt, dass ich nach Frankfurt gefahrenbin. Alles war rein digital. Ich hab niemand, mit dem ich gemietet hab, wirklich vor Ortgesehen. Komm mal, ich hab sogar zwei Meetings parallel gehabt um 9. Danach ging es weiterum 10.30 Uhr. Ich kann euch ja sogar sagen, was das war. Hier ging es um Dokumentation,also das Lieblingsthema eigentlich aller IT-Leute. Hier ging es um irgendwelche Dokumentationssachenund automatischen Import aus irgendwelchen Azure Key Value Stores. Hab ich gesagt, ichprogrammiere irgendwas. Was war denn das? Ach ja, hier ging es darum, dass die Leuteim Klartext irgendwelche Passwörter in ihren Repos gespeichert haben und festgestellt haben,dass es keine so gute Idee ist, wenn wir unsere Passwörter auf Gitter pushen. Da hab ich mirgedacht, ach, wer hätte sich das vorher nur denken können, dass das keine gute Idee ist,als man die da reingeschrieben hat. Hier war unsere wöchentliche Wartungsarbeiten-Runde,wo dann jeder aus jeder Abteilung einer da sitzt, oder von jedem Team sogar, einer dasitzt. Da sind mittlerweile glaube ich 56 Leute eingeladen und ihre Wartungsarbeiten für dieWoche vorstellen müssen. Äußerst Residenz-Sleeper-Termin kann ich euch sagen, da penst wirklich einendabei. Vor allem, weil es immer Leute gibt, die aus Prinzip nachfragen müssen. Das nervtmich. So total random. Leute, so ein Beispiel, was auf unsere Wartungsarbeiten runterkommt.Ein Beispiel. Ich muss das jetzt ein bisschen abändern, dass man nicht so sehr auf die Firmaschließen kann. Es sagt zum Beispiel einer auf der Wartungsarbeiten-Runde, wir müssenirgendwie Coopernetiskluster neu deployen. Irgendwas. Und dann sagt unser Oberwartungsarbeiten-Guru,gibt es dazu noch irgendwelche Einwände, will dazu einer was sagen. Und dann kommt irgendjemandum die Ecke, hat das Auswirkungen auf die Kantine-Speisekarte oder irgendwie sowas,die gibt es bei uns elektronisch. So komplett planlose random Fragen kommen da immer. Eshat auch schon mal einer gefragt, wir haben einen Standort in Frankreich, wir haben einenStandort in Frankreich, wo besonders erfolgreiche Stonks-Leute quasi Urlaub gewinnen können,wenn sie so und so viel Zeugs verkauft haben. Und da hat mal ernsthaft einer gefragt, dahat auch jemand angekündigt, wir machen Wartungsarbeiten an Datenbanken. Und dann hat wirklich jemandgefragt, hat das Auswirkungen auf den Standort in Frankreich. Hat das Auswirkungen auf dieSwitche in Frankreich. Und da habe ich mir auch gedacht, Leute, ihr seid echt komplettdurch. Garantiert, der Switch im Hotel in Frankreich rebootet sich bestimmt, wenn einer bei unsDatenbanken Wartungsarbeiten macht. Ganz sicher. 12.45 Uhr gab es Daily Team Meeting. 13 Uhrbis 13.30 Uhr gab es wieder so eine Art Wartungsarbeiten Runde. Und 13.30 bis 14 Uhr habe ich vergessen,weiß nicht, war ich wahrscheinlich geistig schon nicht mehr anwesend. Wie soll man daproduktiv arbeiten? Das ist ja der Trick, gar nicht. Es gibt zu viel Bullshit-Jobs undBullshit-Gramm, den man machen muss. Die wollen alle ihre Zeit irgendwie legitimieren, dasssie ihre Daseinsberechtigung irgendwie, weiß nicht. Da kann man nicht produktiv arbeiten,das funktioniert nicht. 15.50 Uhr, wisst ihr warum ich 15.50 Uhr bis 23 Uhr drinstehenhabe? Nein, bei uns sind Meetings überhaupt nicht aus. Warum ich da 15.50 Uhr drinstehenhabe, das habe ich blockiert, dass mich da keiner mehr einladen kann, weil wir hattenan einer keine Bereitschaft. Bereitschaft mache ich nimmer freiwillig. Wenn es bezahltwird vielleicht, aber nimmer freiwillig. Früher habe ich sowas freiwillig gemacht. Ja, undich habe das eingetragen, dass ich dort nicht mehr eingeladen werden kann, weil wir hattenso ein paar Kandidaten, die haben an 17 Uhr Meetings eingeladen und sowas. 17 Uhr, wasist mit denen los? 17 Uhr mache ich gerade Pepofet was zu essen daheim und miete bestimmtnicht mehr zu irgendwelchen sinnlosen Themen. Nee, das ist einfach nur Blocker, dass michkeiner einladen kann. So, die stehen richtig auf Miete. Morgen ist nicht so schlimm, aberheute war echt so ein krasser Tag. Willst du dich bei einer Firma bewerben, die einenScrum Master MWD sucht? Warum nicht? Also ich würde mich nicht als Scrum Master bewerben,das nicht, aber warum sollte ich mich nicht bei einer Firma bewerben, die auch einenScrum Master sucht? Blocker, ja, wusste, wusste, es geht bei uns nicht anders. Ichmeine, hallo, wer macht denn bitteschön Meetings um 17 Uhr und dann am besten noch zwei Stundenoder so? Ich weiß auch nicht, was mit den Leuten los ist. Leute, jetzt kommen wir malzur Hauptattraktion des heutigen Streams. Ich würde das gar nicht lange warten lassen,weil es könnte sein, dass es ein relativ kurzer Stream wird, wenn das nämlich nicht funktioniert.Ich habe die letzte ihrer Art gefunden, Leute. Die CoGeek Steckdosenleiste nur rebrandet.Das ist die CoGeek Steckdosenleiste. Guckt, seht ihr da? Das ist die hier. Schaut her.Ich muss gucken, das ist die gleiche. Ich muss gucken, dass ich den Switch nicht wiederrausziehe. Das ist die und das ist angeblich die letzte Steckdosenleiste, die es gibt aufAmazon. Der letzte Typ Steckdosenleiste, den es gibt auf Amazon, der flashbar ist. Mehrgibt es nicht mehr. Ihr könnt durchgucken, ihr werdet nichts finden. Ihr findet vielleichtnur normale Steckdosen mit Glück, aber welche, die so alte Firmware haben oder überhauptgar kein ESP866 mehr, sind mittlerweile die Regel. Dass du noch eine findest mit ESP866und alte Firmware, dass du die OTA flashen kannst, ist selten. Das ist vom Aussterbenbedroht. Das ist die letzte ihrer Art. Ich hoffe, es funktioniert auch. Laut Amazon-Bewertungfunktioniert es noch. Ihr seht, ich habe es noch nicht aufgehabt. Das ist noch originalzu hier. Also kein Fake. Also entweder klappt es jetzt. Können wir ein bisschen guckenoder es klappt nicht und dann haben wir gelitten. Wenn du eine flashbare Steckdosenleiste entwickelst,bin ich der Erste, der Sellout macht dafür im Stream. Ich meine, an sich ist das ja nichtkompliziert, was da an Technik drin ist. Das sind 5 Relays, ein Microcontroller undhalt ein halbwegs schönes Gehäuse. Fertig. Ich glaube, du kannst das nicht wirklich gutvermarkten, weil du hast halt immer noch die ganzen China-Chinesen für 25 Euro. Da kommstdu wahrscheinlich nicht mit. Und den meisten Leuten ist es ja egal, ob man die flashenkann oder nicht. Die machen das über diese hässliche Smartlife-App. Warum willst dueine Steckdosenleiste flashen? Gute Frage. Die kommt jedes Mal. Erstens, hat mehrereGründe. Erstens, dann brauchst du nicht die offizielle App. Wenn du nicht die offizielleApp brauchst, dann brauchst du auch keine China-Chinesen-Cloud. Und das ist schon maleines der Hauptpunkte, dass die Chinesen rausbleiben. Dazu kommt, dass man das mit geflashter Firmwareauch deutlich besser an so ziemlich alles anschließen kann, was man will. Du hast irgendeinHeimautomatisierungssystem, was über MQTT geht, mit Custom-Firmware kein Problem. MitChina-Chinesen-Firmware klappt das nicht. Willst schalten über ein Webinterface oderüber eine Web-AP mit Custom-Firmware kein Problem. Mit China-Hardware geht das nicht.Das bedeutet auch, wenn dein Internet nicht funktioniert, kannst du deine Steckdosenleistenicht schalten mit China-Firmware. Geflasht, kein Problem. Gibt es sinnvolle Firmen, dieOpen-Source-Smart-Home-Produkte anbieten? Die Shelley-Dinger sind nicht schlecht. Ichglaube, die Shelley-Firmware ist nicht Open-Source, bin ich mir nicht sicher. Also die App aufjeden Fall nicht. Aber die Firmware, keine Ahnung. Aber die Shelley-Firmware kannst duohne Probleme flaschen. Die lassen das von Haus aus zu. Es gibt bei Aliexpress-Hersteller,die bieten Tasmota Pre-Flashed mittlerweile schon an. Bevor es losgeht, Leute, ich mussmir noch mal schnell was zu trinken holen. Dann bin ich gleich am Start. Letztes Mal eineStaubsäure geflasht. Ja, nice. Was hast denn du für einen? Ich kenne gar keine neuenmehr, die man gescheit flaschen kann. Warte, ich hole mal schnell was zu trinken. Ich binin zwei Minuten wieder da.Da bin ich wieder. Ich habe mir übrigens auch, falls es mal zu dunkel ist, weil ich hatteletztens das Problem, wo ich was versucht habe zu flaschen, was daran zu lücken, woich nichts gesehen habe. Ich habe mir jetzt hier auch mal so ein Licht noch hingelegt,dass ich das noch mal extra hell machen kann. Dann sieht man besser was. Was braucht manum diese Steckdosenleiste zu flaschen? Ja, das zeige ich dir jetzt gleich. Ich guckegleich. Sekunde. Muss ich erst mal wieder hinsetzen. Dann noch mal trinken abstellen.Wenn es übel ist hochgesprintet, die Treppe, dass ich schnell wieder da bin. Guck mal,das Cellyzeug ist anscheinend wirklich open source. Ein DreamBot Z10 Pro. Ah ja, 440Euro mit Absaugstation ist wirklich günstig. Was heißt überhaupt flaschen? Die Firmwareaustauschen so sinngemäß. Also, auf geht's. Ne, nicht so gut. Ich habe einen S5, den konnteman gut flaschen. Die danach nicht mehr wirklich. Den S6 kann man glaube ich flaschen. Den mussman mal komplett zerlegen, da hätte ich schon mal keinen Bock drauf. Und die danach gingglaube ich gar nicht, bin ich mir aber ehrlich gesagt nicht sicher. Habe ich mich eben schondarüber ausgelassen, muss ich jetzt nicht nochmal alles erzählen. Also, was man dafürbraucht, ganz einfach. Wir haben das ja schon noch vorbereitet alles. Also ich werde dasjetzt nicht alles nochmal neu installieren. Wir haben das ja schon vorbereitet für dieSteckdosen vom letzten Jahr. Also was man braucht ist eigentlich nur oder nicht zwingendnotwendig. Geht bestimmt auch anderweitig, aber praktischerweise ist man hat einen RaspberryPi. So, das hier ist jetzt ein 4er in diesem Fleer Case, was echt poggers ist. Ist aberleider fast zu teuer oder halb so teuer wie der Raspberry Pi. So ein Aluminium Gehäuse,das das dann schön die Wärme ableitet. Aber das ist wirklich gut. Man braucht ein KappaPride Kabel, auch ganz wichtig. Und wir brauchen den Star der Alters Streams immer. Wir brauchenunseren Small Access Point. Ohne den geht nichts. Nein, den brauchen wir nicht. Aberman braucht natürlich einen W-Lan, dass man die Dinger später über das W-Lan teilenkann. Also eigentlich brauchst du bloß einen Raspberry Pi und die passende Software drauf.Wenn es denn geht. Wenn es nicht geht, ist das Stream wahrscheinlich relativ schnellbeendet. Also, fangen wir das mal an. Ich werde den Raspberry Pi erst mal kurz einstöpseln.Dann Strom anmachen und dann gucken wir mal. Also ich habe hier hinten, was ihr gerade nichtseht, hier hinten steht ein Switch. Guck, hier seht ihr noch die Ecke raus. Gucken vomSwitch. Da steht ein Mikro Tick. Mikro Tick Switch CSS 6108G2S Plus IN. Also zwei, mansieht es hier unten, zwei SFP Plus Ports 10G und acht Gigabit Ports hat das Ding. Dasist optimal hier für so meine Bastel, für meine Bastel Ecke. Da kann man alles anschließen,was man so braucht. So, schließen wir den Raspberry Pi erstmal an. Ich glaube ich habeirgendwo Kabels dafür. Übrigens auch so ein Ding. China-Chinesen-Kabel. Ich habe hiervon den Kabeln. Gibt es in unterschiedlichen Farben. Ich habe von diesen USB-Kabeln 50erPack bei Aliexpress gekauft. Das ist ungefähr einen Meter lang. Hat USB-C, Mikro-USB ineinem und hat weniger als ein Euro das USB-Kabel gekostet. Ich glaube 85 Cent umgerechnet dasUSB-Kabel. Also China kaufen, finde ich lohnt sich schon, wenn man die richtigen Sachenholt. Ich meine, jetzt kann man sich natürlich fragen, vollkommen zurecht, wozu braucht man50 USB-Kabel? Aber die Antwort ist ganz einfach. Es ist besser, man hat 50 USB-Kabel als manbraucht 50 USB-Kabel. So, wenn man das jetzt verstehen konnte, wie ich das meine. Ne, weiterverkaufen nicht. Gibt es einen Link zu dem Kabel? Ich glaube, die gibt es in der Formnicht mehr. Das ist schon ein Jahr her, wo ich die gekauft habe. Ne, also ich habe niewieder USB-Kabel-Probleme. Ich mache bald Wish-Champ mache ich auf. Da kann man direktdropshippen. Da kann man sich auf Knopfdruck seinen Dropshipping-Shop erstellen. Der Wish-Champ.So, machen wir mal den Raspberry Pi an. Ich kann es mir immer nicht merken, was ist Strom,hinten oder vorne? Ach ne, gibt es ja mittlerweile nur noch einen. So, der Raspberry Pi ist an,hier guck da, es bootet. Jetzt müssen wir uns mal drauf einloggen und gucken, ob allesläuft. Zack, Firefox aufmachen. Frage? Echt? Wo? Wish-Champ ist schon weg? Was? Wie,Wish-Champ, was soll das? Gebated. Ne, ich würde das auch garantiert nicht Wish-Champnennen. Wenn ich das nämlich Wish-Champ nenne, dann verklagt mich Wish wahrscheinlich. Okay,Mini-USB ist tatsächlich selten. Es gibt nur noch genau ein Gerät, das Mini-USB hat,das ist mein Mikrofon. So, also Pi, et, tja, ist es der? Hey, sicher, dass es der ist? Hm,der wird es wahrscheinlich sein. Kann man sich, kann man irgendwie checken, ob das einRaspberry Pi 4 ist? Gibt es irgendwas für die Pi-Info oder sowas? Check, if Pi ist 4.Gibt es irgendwie sowas? Ah, guck mal hier. Aha! Bam! Stack Overflow, einfach Beste.In dem Fall war es sogar Stack Exchange. Stack Overflow. Ich sag's ja immer wieder. Man mussdie Sache nicht wissen, man muss einfach nur wissen, was man suchen muss. Was, in Hardtopsteht das drin? Ach, du meinst Anzahl der Kerne oder, ne, hä? Wie soll man das in Hardtoperkennen? Wie soll ich in Hardtop jetzt erkennen, ob das ein Pi 4 ist? Das muss man jetzt erklären.Jaja, Uptime, ganz genau. Uptime ist eindeutig, da erkenne ich sofort, ob es ein RaspberryPi 4 ist. Ach, du meinst über die, ja gut, stimmt, das könnte ich auch gucken. Wir haben4 Gigabyte, das muss ein Raspberry Pi 4 sein, das stimmt. Aber mal im Ernst, das ist dochdie deutlich schönere Variante hier, oder? Der sagt's dir ja direkt. So, wo haben wirdenn unser, wo haben wir denn unser, ähm, haben wir hier überhaupt das Repo schon draufausgecheckt? Ja, hier ist Tuya Convert. Genau, also wir brauchen einen Raspberry Pi und dannmuss man sich auf GitHub das hier auschecken. Habt ihr das mit, ne, hab ich da oben schongemacht, hier, guck da. Ne, ne. Du kannst jetzt vielleicht hieran, ne, aber selbst dakannst du dir das nicht wirklich dran ableiten. Das musst du dir auschecken von GitHub unddamit kann man, äh, konnte man ziemlich viele China-Chinesen-Geräte flashen. Over theAir, also sprich hier, einfach übers WLAN. Das Problem ist nur, die meisten China-Gerätegehen nicht mehr. Ja, das sagt. Gut, dann probieren wir das mal aus. Achso, ich mussden Access-Point noch kurz starten. Super, super schmoll Access-Point. Äh, MikroTik,wo ist er denn hier, da. Muss ich mal kurz, kurz einschalten, weil wir brauchen ja einenAccess-Point, wo wir das dann anmelden, wenn Custom Firmware drauf ist. Der wird übrigensper, jetzt mal kurz weg, der wird übrigens per Mikro-USB versorgt. Ich kann es nichtoft genug sagen, der Access-Point ist mega nice für so, für so Bastelgeschichten. Dasist ein Access-Point mit vollwertigem Router-OS drauf, für, also MikroTik-Router-OS für25 Euro. Kann zwar nur 2,4 Gigahertz, aber für so Bastelkram ist das optimal, das Teil.So, der sollte jetzt starten. Ich weiß nicht, ob man die Lichter sieht, dass der da, dassder an ist. Er ist sicherlich genug. Ich glaube, das erkennt man nicht. Äh, auch PoE. Ichglaub auch PoE, ja. Ich glaub auch PoE. Ja. Allerdings, ähm, der Switch kann kein PoE,deswegen kann ich da kein PoE machen. Ja, also der ist richtig, der ist richtig pock.Das ist jetzt kein Access-Point, wo ich mein Haus mit versorgen würde oder so, aber fürso Basteldinger ist das wirklich massive nice. So, irgendwann sollte eigentlich der Access-Pointan Start kommen. Root, Add. Ah, Moment. Es ist 137, nicht 127, kann das sein? Lull. Ja,es ist auch das Richtige. 137 ist es. Na gut. Alles klar. So, Access-Point ist da. IP, DHCP-Server,Leases. So, hier ist, guck mal, hier ist das alte TAS Motorzeuger. Das ist Chibate. Derist garantiert nicht an. Der alte Debon-Mini. Den hab ich gegrillt. Der kann definitiv nichtmehr an sein. Das expired und wird sich auch nie wieder was abholen. So, hier taucht dannunsere custom-geflechte Steckdosenleiste im DHCP-Server auf. Kommen wir gucken, was füreine IP gekriegt hat. Aber jetzt gehen wir mal auf unseren Raspberry Pi. Ne, vorher,wir packen erstmal die Steckdosenleiste aus, würde ich sagen. Hast du die ganzen IOT-Gerätein einem Subnetz oder so drinne? Zum größten Teil. Also, ich hab zwei WLANs. Ich hab einenChina-Chinesen-IOT-WLAN. Auch mit Client-Isolation. Isolierung. Abgeschottet, also sprich, dassdie Clients nicht miteinander reden können. In einem extra WLAN drinne, wo auch keinInternetzugriff erlaubt ist und ich glaube Firewall-Technisch ist das einzige, was erlaubtist NTP auf den Router und MQTT zu einem Proker. Ansonsten ist nichts erlaubt im China-IOT-WLAN.Dann hab ich auch ein normales WLAN für Handy, Tablets und sonst was. Noch einen Bastel-WLANfür Sachen wie hier. Und ein internes Netz und... jo. Das war's im Großen und Ganzen.Das ist natürlich blöd, Helmo. Da fällt mir eigentlich bloß ein, WLAN-Geräte näher zusammenrücken.Man kann ja beispielsweise das eine WLAN-Gerät direkt an die eine Wand und das dann auf deranderen Seite direkt an die andere Wand und von dort dann weiter per Kabel oder so. Aberansonsten. Oftmals ist halt auch was die Leute dann haben, so richtig alter Schrott. Z-C-H-R-I-E-S-R-I.Danke für den Zap. Wenn ihr jetzt noch ein Essen nehmt, dann wisst ihr euch, dass esChris heißen soll. Aber ist ja nicht. Ja, würde ich auch so machen. Also unabhängigdavon ob es China-Chinesen-Zeug ist. Das bietet sich einfach an. Was ich ja geil finden würde,wenn irgendjemand mal WPA Enterprise baut, so dass die Geräte, dass die Clients es nichtunterstützen müssen. Das ist ja WPA Enterprise, ist ja quasi der WLAN-Standard, wo man fürAuthentifizierung einzelne User-Accounts anlegen kann. So kann man jedem Endgerät ein extraUser und Passwort geben. Das wäre unglaublich praktisch für ein IoT-Netzwerk. Weil dannkönnte man jedem Gerät eigenen Usernamen Passwort geben oder eigenes Passwort und könntedas wegschmeißen und das Gerät einfach löschen. Und gut wärs. Aktuell muss man ja theoretischIoT-Geräte, um es mal übertrieben zu sagen, einschmelzen oder schreddern, bevor man siewegwirft, weil dein WLAN-Passwort halt überall steht, in den Geräten. Deswegen mach iches aktuell ganz einfach. Ich schmeiß IoT-Geräte einfach nicht weg. Ich hab einfach einen Sackhier stehen, mit kaputten Controllern und alles und schmeiß das halt einfach nichtweg. Irgendwann werd ich mir die einfach mal in die Tüte nehmen und schreddern lassen.Okay, weiter gehts. Also es war und die Alternative ist, die Alternative ist ein WLAN-Passwortin der Weltgeschichte verteilen. Cisco WLAN-Controller Compare Device Pass Phrases bei WPA2. Wirklich,das ist cool. Und das ist dann aber auch kein WPA Enterprise. Das sieht dann für die Gerätequasi so aus, wie normales Pre-Shared Key. Das ist ja das Wichtige. Das Small AccessPoint, ja. Weil die ESPs können zwar theoretisch WPA Enterprise, aber nicht wirklich gut.Die Cisco WLAN-Router, nee. Ease. Oh, das ist wieder Big Brain Cisco Kram. Big BrainCisco Stels. UniFi kann er bestimmt nicht, oder? Nee, die können das wahrscheinlichnicht. Jaja, WPA Enterprise, das weiß ich. Das ist ja Schwachsinn. WPA Enterprise suckt.Geht anscheinend nicht. Ja doch, das funktioniert. Das Problem ist dann, dass du ein bisschenviele WLANs hast. Also ich kenne keinen WLAN Access Point, der 40 SSIDs aufmachen kann.Und außerdem ist das auch WLAN technisch nicht so sinnvoll, 40, also Funk technischnicht so sinnvoll. Ja, das ist, also theoretisch kannst du Multi SSID machen, aber mehr als3, 4 würde ich da nicht aufmachen. Ich glaube, die UniFi Access Points können auch maximalnur 4 SSIDs. Okay, aber ich packe jetzt erstmal die Steckdosenleiste aus. Also wir guckenmal, ob das wirklich die original Krogi Steckdosenleiste ist, nur unter Hammer Rebranding. So, guckenwir mal. Also da hier aufmachen. Wo habe ich denn meinen? Ah, der Keks muss im Bild bleiben,so geht das ja nicht. So, legen wir den Raspberry Pi mal kurz hin, machen den Kram mal auf.Die andere Seite. So, und jetzt schauen wir mal, ob das passt. Mods haben die Commandsgepimpt. Ja, ein bisschen. So, also schauen wir mal rein. Hier, das haben wir hier. Hammer,das hat Hammer da gemacht. Also es ist schon mal besser verpackt als die Krogi Steckdosenleiste,hatte ich den Eindruck. Als hätten sie da irgendwas gemacht. Aber ich glaube, es isttrotzdem die gleiche Steckdosenleiste. Es ist exakt die gleiche Steckdosenleiste. Dasstimmt mich zuversichtlich. Es ist wirklich exakt die gleiche Steckdosenleiste. EinfachChina Rebrand. Ist Hammer nicht irgendwie so ein Hardware-Ding aus Bayern? Es ist dieKrogi Steckdosenleiste, hier Leute, guckt mal. Es ist die gleiche. Exzellent, exzellent.Nur, hier unten steht Krogi und hier steht gar nichts. Guck mal, Hammer hat noch nichtmal richtig reprinten lassen. Normalerweise würde hier unten der Hersteller stehen, abernope. Hammer. So, mal hier aufmachen. Und dann probieren wir das Ganze mal aus. Das Hammerhat nur reprandedes Zeug. Ist mir egal in dem Fall, solange das flashbar ist. Also wenndas flashbar ist, kaufe ich mir noch 10 Stück. Also ohne Mist, man braucht Steckdosenleistenbraucht man immer. Und ich habe 3 Stück, die geflasht sind, aber die habe ich schon alleim Einsatz. Und man kann einfach nicht genug Steckdosenleisten haben. Und es gibt immerweniger, die sich flashen lassen. Ich kaufe mir, wie gesagt, wenn das wirklich flashbarist, kaufe ich mir gleich noch 10 Stück. Easy. Gut, also Steckdosenleiste am Start.Packen wir mal hier raus. Noch nicht gleich anschließen, Leute, weil es kann sein, dassdie Dinger instant in den pairing-Modus gehen. Das will man nicht. Und im Zweifelsfall mussman sie ausstecken und wieder anstecken. Ja, das geht auch. Man will die erst im pairing-Modushaben, wenn man seinen Raspberry Pi anhat. Mir fällt gerade auf, das ist blöd, wie ichdas mache. Ich muss das hier mal schließen. Firefox und hier aufmachen. Dann in Window-Modusschalten. Controls ausblenden. Sticky machen. Ah, so ist das doch gut. Jetzt kann man nämlichden Raspberry Pi sich angucken. Und wir haben noch nebenbei die Steckdosenleiste. Oh, slacked.Massive-Lack, Alter. Poggers-Lack. Weniger Poggers-Lack. Paints-Champ-Lack. Na, jetztgeht's. Ja, ja, ist okay. Alles klar. Sind die einzelnen Dosen in der Leiste schaltbar?Ja. Deswegen, das ist ja das Geile da dran. Das ist quasi eine IP-Steckdosenleiste für30 oder 35 Euro. Richtiges Picture-in-Picture ist aber doof. Das kann man nicht resize-en.Das hier kann man resize-en. So. Also, gehen wir hier rein. Oh, ich brauche eine Tablet.Ich muss mal ins Bart mal ein iPad holen. Also, wunderbar. Weil man muss immer, wennman das startet, ein Tablet in das WLAN packen. iPad als Klo-Zeitung. Ja. Ich habe das oftim Bart liegen tagsüber. Wenn ich aufs Klo gehe, kann ich dort Browser aufmachen oderYouTube aufmachen oder irgendwas. Bin ja mittlerweile schon so medienabhängig, ich kann nicht malkacken ohne YouTube zu gucken. Weiß ich, hat einer noch das Problem? Ich konnte, alsojetzt mal ohne Mist, ne? Ich konnte früher mich abends ins Bett legen, habe die Augenzugemacht, Bett ge- und habe einfach gepennt. Das geht jetzt nicht mehr. Ich muss jetztins Bett und dann entweder auf dem Tablet oder auf dem Handy noch irgendeinen Stream anmachen.Und ich penne allein, wenn der Stream läuft. Das ist kein Problem. Ich kann aber nichtmal schlafen ohne Handy oder Tablet. Richtig hängen geblieben. Ohne Mist, ich bin früherins Bett. Ich meine, wie gesagt, ich bin 1984 geboren. Ich habe alles mitbekommen. Ich habequasi die Pre-, also ich habe noch so richtig vor Mainstream PC mitbekommen, vor MainstreamInternet. Dann habe ich Mainstream PC, Mainstream Internet, vor Smartphone und nach Smartphone.Also ich habe quasi so mehr oder weniger alle wichtigen Technologieabschnitte so mitgemachtnoch. Und ich konnte mich wirklich früher einfach ins Bett legen, habe gesagt, okay,ich mache jetzt Augen zu. Dann fängt man an, sich irgendwie über komische Dinge nochnachzudenken oder so. Und dann schläft man ein. Und mittlerweile kann ich nicht mehr pennenohne Handy am Start. So, also, was man jetzt machen muss ist, sich dieses Repo hier klonen,was ich schon gemacht habe. Also wie gesagt, hier das da. Nee, nee, tu ja Convert, klonen.Das klont man sich. Das haben wir gemacht. Das ist gar kein Ding. Und dann geht man einfachda rein und sagt Start, Start, Flash. So, dann fragt er mich, ob ich noch irgendwelcheDinger stoppen will. Ja, will ich. Ja, ist okay. Yes. So. Und dann sagt er mir, ich mussjetzt ein Gerät, was nicht die Steckdosenleiste ist, ins WLAN packen. Sonst funktioniertdas Ganze nicht. Ihr guckt. This step is important. Blah, blah, blah. Connect any other deviceto the Wi-Fi. We trust Flash. Das heißt auch wirklich so. We trust Flash. Das mache ichjetzt mal ohne, dass ihr das sehen könnt, weil. Will die WLANs hier nicht leaken? WLANs.We trust Flash. Warum hast du kein ESP als Dummiklein? Das ist eine gute Idee. War garnicht dran gedacht. So, dann sieht das so aus mit dem iPhone. Guckt mit dem iPad. Guckthier. Connected. Connected. We trust. Das müsst ihr eigentlich gar nichts machen. Einfachnur einfach nur eingeloggt lassen. So. Put your IoT device in Autokonfig. Das machenwir jetzt. Müssen wir noch mal gucken, wie wir das in Autokonfig kriegen. Oftmals istes so, es reicht. Wenn man das einfach einschaltet, dann gehen die automatisch in Autokonfig.Und wenn nicht, dann muss man den Knopf einfach ein paar Sekunden halten. Meistens zumindest.So. Macht das was? Es schaltet sich an und aus. Okay, da muss ich es wahrscheinlicheinfach gedrückt halten. Also Ziel sollte sein, man erkennt es nicht richtig, dass dasGrün blinkt. Das ist so, man erkennt das gar nicht richtig. Okay, es blinkt. Es blinkt.Huh? Bosschamp? Bosschamp? Muss ich den Stecker nicht rausziehen?Es macht noch überhaupt nichts. Ich fürchte, die Firmware ist zu neu. Ich fürchte, dieFirmware ist zu neu, weil der blinkt nicht mehr. Ich glaube, die Firmware ist zu neu.Scheiße. Mach einfach mal an und aus. Ja, kann ich gleich machen. Wir können das kaputtgeht es nicht. Kaputt geht es nicht. War bei mir auch so komisch. Okay, ich mach das mal.Mal gucken, was jetzt passiert. Ich lasse den erstmal machen. Er hat geplinkt. Aha,es funktioniert. Doch. Die ist noch flashbar. Okay, Zehner Bestellung ist raus. Zehner Bestellungist direkt raus. Flash, Tasmota. Jetzt muss man auswählen, was man flashen will. Wir wollennatürlich Tasmota flashen. Sind wir Schnur, dass wir flashen wollen? Ja, wollen wir Tasmotaflashen? Erstmal 300 Euro investiert. Stimmt eigentlich. Richtig viel Kohle. No. Gut,und jetzt gehen wir in die WLAN-Settings und verbinden uns mit der Steckdose. Tasmota.Ja. So, jetzt sind wir mit der Steckdose verbunden. Ich zeig's euch gleich. Guck hier. Dann locktman sich, die Steckdose macht dann, ich mach mal groß, die Steckdose macht dann ein AccessPoint auf. Und da verbindet man sich drauf. Ich sollte vielleicht mal den Paus-Champ wegmachen,das Emote ist ein bisschen zu Pain's Champ. Ja, dann lockt man sich ein auf dem AccessPoint von der Steckdosenleiste und gibt dann sein Access Point-Gedöns ein, was man habenwill. Das mach ich jetzt mal kurz. Ohne, ohne dass ich euch zugucken lasse. Omi, ich habmich vertippt, fuck. Das ist übrigens, da muss man aufpassen, wenn man sich vertippt.Je nach Device kann's sein, dass man es nicht mehr zurücksetzen kann. Okay. Passwort gespeichert,es restartet sich und jetzt gucken wir auf unseren Access Point, ob's auftaucht. AccessPoint. Das sieht gut aus, guck mal da. Bäm. Da ist sie. Da ist sie, unsere Steckdosenleiste.Die Steckdose ist jetzt noch nicht richtig eingestellt. Aktuell sieht es so aus, alswäre das nur ein, als wäre das nur ein, ein Schalter. Das ist ja falsch. Das müssenfünf Schalter sein. Das sind fünf Schalter, weil, Moment. Hier ist das iPad weg. Es sindja fünf Schalter, weil 1, 2, 3, 4 und USB. Und USB sind fünf Schalter. Das heißt wirbrauchen jetzt noch das passende Template dafür. So und damit wir das jetzt auch richtigschön, damit wir das jetzt richtig schön machen können, schalte ich jetzt erstmalmeine Home Assistant VM ein. Da können wir das richtig mal einrichten, so wie man dasmachen würde. Home Assistant VM einschalten. Nur mal so exemplarisch jetzt. Also das erste,was wir hier jetzt machen, ist erstmal uns ein richtiges Template raussuchen. Ich schiebedas mal kurz ein bisschen weiter weg. Also wir brauchen ein Template dafür. Da gibtes so eine, da gibt es eine schöne Seite, Pontus Motor. Da kann, wie packt man HA ineine VM? Einfach das offizielle VM-Template nehmen. Es gibt so eine, es gibt so eine schöneSeite. Da haben ja Community Leute Geräte zusammengetragen, die es so gibt. Und indem Fall ist ESP Home aber doof. Du willst ja nichts selbst machen, du willst einfachfix und fertig haben. So, guck mal unter Plugs und Sensors, ob es da einen Hammer gibt. Oh,das sieht schon mal gut aus. Hammer. Hammer. Da war es doch, guck mal. Hammer. PRC4USBpowerstrip,hier ist das Template. Gut. Gehen wir hier hin. Configuration. Config Template. Äh nichtstimmt überhaupt nicht. Config Other. Und dann schmeißen wir das Template hier rein.Sagen Activate und Save. Dann Restartet es neu und wenn es jetzt Restartet ist, dannblinkt es vielleicht. Müssen wir mal gucken. Und jetzt seht ihr. Äh was ist denn das? Solltedas nicht eigentlich. Es sollte eigentlich 4 Knöpfe haben. Es hat irgendwie rumgepackt.Sonst hat man 4 Knöpfe. Guckt. Na super, man erkennt das jetzt hier nicht. Ach guck mal,das ist. Das Gehäuse von dieser Hammerleiste ist mega fail. Du hast hier normalerweiseein Licht daneben. Ich weiß gar nicht ob man das überhaupt erkennt. Da wo mein Mauszeigeist, ist ungefähr ein Licht normalerweise. Das erkennt man überhaupt nicht. Also dasLicht kommt da nicht richtig durch. Ich mach mal kurz die Lampe aus, dann erkennt man esvielleicht besser. Die USB Socket sind auch schaltbar, aber nur alle zusammen, nichteinzeln. Das wäre zu geil, wenn das einzeln schaltbar wäre. Ja jetzt erkennt man es. Guckt.Seht ihr. Das ist relativ schnell. Es ist nur ein minimaler Lack. Also. Da kannst du dichecht nicht beschweren. Das ist mehr oder weniger so realtime. Komm mal kurz hier hin. GucktUSB kann ich auch schalten. Ach so ja, ob ich USB schalten kann, das kann ich sehen.Das seht ihr jetzt ja so gar nicht. Das müsste ich, ja wenn ich wüsste wo ich das Teil hinhabe. Ich hab doch so ein USB. So ein PogChamp USB Tester. Da bin ich mir aber nicht sicherwo ich den hingeschmissen hab. Kann man nämlich testen, was, ob die USB Anschlüsse richtigfunktionieren. Ok den hab ich irgendwo hier reingeschmissen. Ich hab legit keine Ahnungmehr wohin. Ach hier ist er. Guckt mal. So jetzt ist USB aus. Jetzt machen wir das Dinghier mal rein. Müsste man jetzt eigentlich sehen. So. Jetzt machen wir USB mal an. Jetzthaben wir hier. Ups. Jetzt haben wir hier 5,16 Volt am USB Anschluss. Nice. Ja dann siehtman also das Schalten funktioniert wirklich. Kann man sich eigentlich nicht beschweren.Machen wir wieder aus. Zack. USB braucht man schon ein bisschen bis es ausgeht. Das liegtaber an den Geräten weil die nicht so viel verbrauchen. So jetzt mach ich mal das Lichtwieder an. Was? Ich glaube ich hab an meinem Keylight gewackelt. Das geht jetzt nicht mehran. Ringlight. Das ist schlecht. Zack. Hab ich den da jetzt gemacht. Ringlight. Comeon. Lass dich nicht so bitten. Geh einfach wieder an. Schauen wir mal. Geht hoffentlichgleich wieder. So. So bis das Ringlight sich jetzt einkriegt. Achso wir können ein FirmwareUpdate machen gerade. Ja. Wir können noch mal schnell ein Firmware Update machen weiles gibt ja ein neues TASMOTA. Aber ihr seht es funktioniert alles. Und das ist halt echtnice. Sowas gibt es normalerweise nur für deutlich mehr Geld als IP Steckdosen leistenoder eben halt als China Dinger wo man selbst keine Kontrolle mehr drüber hat. Das isthalt wirklich richtig nice. Dass man da noch was Flashbares gefunden hat. Ich gehe maldavon aus das Hammer einfach die uralten Restbestände irgendwo gekauft hat und da waren halt nochalte Flashbare dabei. Wie lang ist das Kabel? 2 Meter würde ich sagen. Ja 2 Meter. Ist dieLeiste schon kaputt? Nee funktioniert alles. Guck kann man alles schalten. Ich warte jetztbis mein Ringlight wieder funktioniert. Das sollte sich jetzt eigentlich mal wieder einkriegenbald. Hoffentlich mal. Oder auch nicht. Anscheinend nicht. Ist Hammer besser als die China Dinger?Das sind China Dinger. Das ist ein reprandedes China Ding. Das ist exakt die gleiche ChinaLeiste die ich mir vor einem halben Jahr schon gekauft habe. Nur das Hammer das jetzt resellt.Warum geht denn mein Keylight nicht an? Warum geht denn das Ringlight jetzt nicht an? Woist denn das Problem? Musst du mich verarschen alter Lan? Warum geht das nicht an? Wallah!Zeig mal her. Ich mach das mal raus. Was hat das Keylight denn für Probleme? Oh. Stopp.Mal gucken ob es jetzt angeht. Ich hab das jetzt noch mal umgestapselt. Wenn ich müssenmal kurz ohne. Ah Leute ich kann doch jetzt. Ah Big Brain Time. Ich hab doch jetzt hiermeine. So. Ist halt ein bisschen dumm. Der Winkel ist halt kacke mit dem Ding. Das isteigentlich wenn man irgendwo hinter der Heizung oder sowas schrauben muss. Ah Bassloss istwieder da. Geht nicht. Warum geht das Ringlight nicht an? Was ist denn das? Ich klicke aufRinglight starten und es geht nicht an. Habe ich das jetzt auch aus Versehen geflashtoder was? Max hast du in deinem Leben das mal gebraucht? Tierzelle und zwischen Pflanzenzellenunterscheiden? Äh klar täglich. Ah Ringlight geht wieder. Okay. Es ist wieder an und esfunktioniert wieder. Oh der Keks muss dahingucken sonst klappt das nicht. Exquisite. So. Jetztmachen wir erstmal Firmware Update. Also. OTA. OTA TASMOTA. Releases. Aktuelle TASMOTA Versionist 10. Ich weiß gar nicht ob das hier irgendwo steht. Aktuelle TASMOTA Bin runterladen. Safe.Configuration. Ah ich kacke nur. Ich habe jetzt die Leiste ja rausgemacht. Lul. So.Warten bis die Leiste wieder da ist. Jetzt ist die Leiste wieder da. Configuration. FirmwareUpgrade. Browse File. Downloads. Und ich weiß dass der erste mir jetzt sagt ich könnteauch direkt die Urlangeben. Das funktioniert nicht weil ich nicht ins Internet komme. Wobeidoch von dem Access Point komme ich ins Internet. So. Firmware Update. Start. Erstmal seine,erstmal den Reflink unter die Leute bringen hier. Hast du schon die Switche gesehen? Ähnein. Wozu braucht man die? Was zeichnet die aus? So. Firmware Update funktioniert. MainMenu. Ah. Main Menu. Version 10. Das ist die aktuelle. Hat alles funktioniert und schaltengeht immer noch. Exzellent. So. Jetzt werden wir das ganze nochmal in unsere Heimautomatisierungeinbinden. Das ist tatsächlich relativ easy. Wir gehen jetzt erstmal in unseren Home Assistant.Ich schiebe das mal hier kurz runter weil die Kamera ist jetzt nicht so spektakulär.Wir gehen jetzt in unseren Home Assistant. Das ist es. Jawoll. Da ist hier noch nichtsdrinne. Da sind nur unsere Versuche vom letzten Mal drinne noch. Unser Test Home Assistant.Gut. Und wir melden das. Dark Mode. Ja. Wir machen Dark Mode. Wir machen Dark Mode. Dasist schon richtig. Wenn ich wüsste hier. Dark. Exzellent. Exzellent. Und Advanced Mode einschaltenhaben wir schon. So. Das ist unser Home Assistant. Da können wir das jetzt ziemlich einfacheinbinden. Wir müssen auf unsere Steckdosenleiste gehen. Configuration. Also die IP raussuchenvom Home Assistant. Das ist die hier. Dann geht man auf die Steckdosenleiste sagt. KonfigureMQTT. Host. Rest stimmt. Rest kann man lassen. Passwort braucht man. User. User. Nehme ichjetzt mal den Admin User. Das ist nicht die feine Art. Man macht normalerweise einen extraUser. Aber ich weiß, dass es funktioniert so. Save. Jetzt meldet sich die Steckdosenleisteper MQTT am Home Assistant an. Und dann können wir mal in die Logs gucken, ob das jetzt funktioniert. Ach nee. Configuration. Supervisor. Addons. MQTT. Was ist denn da? Log. New Connectionfrom 2137. Ach doch. Ja klar. Das ist hier Connection von der Steckdosenleiste. Das wirdaus irgendwelchen Gründen genattet über den Router. Okay, war mir auch nicht klar, dassdas eingeschaltet ist. Aber meinetwegen. Alles klar. Steckdosenleiste verbunden. Unddas einzige, was wir jetzt noch machen müssen auf der Steckdosenleiste, ist in die Konsolegehen und sagen Set Option. Und das bin ich mir aus dem Kopf nicht sicher. 61.0. HomeAssistant. Tasmota. Gucken wir mal. Set Option. Set Option 19.0 muss ich sagen. Das ist einbisschen kryptisch bei Tasmota. Wenn ich das gemacht habe. Jawoll. Wenn ich das gemachthabe, sollte jetzt normalerweise in Home Assistant unter Configuration Integration Tasmota dasGerät auftauchen. Und siehe da, der Hammer Strip ist da. Und wir haben es direkt inHome Assistant drin. Was ich immer noch mag zum Einschalten ist die IP, dass ich sehenkann im Home Assistant, was es hat. So und wir sehen, wir können jetzt das gleiche Dinghier übers Web Interface. Können wir jetzt steuern über Moment. Über Home Assistant.Man sieht es nicht richtig, aber es ist an. Man sieht es nicht richtig. Es funktioniert.Es ist an. Wenn ich das alles ausmache, dann geht auch das USB aus. So und jetzt muss mannatürlich den Kram noch mal richtig benennen. Schauen wir mal was USB ist. Ist das hierUSB? Das ist USB. Dann würde ich das mal richtig benennen, weil Tasmota 5 ist relativnichts sagend. Dann würde ich das Ding jetzt, keine Ahnung, Hammer, USB, dass man das nachherfindet. Hier hat man auch die IP drin. Und den Rest würde ich halt irgendwie sinnvollbenennen, dass man am Ende den Kram wieder findet. So und wenn man das in seinem HomeAssistant angelegt hat. So wenn man den Kram in seinem Home Assistant angelegt hat. Achso, die Entity ID kann man auch ändern. Man kann das Ding auch gleich oben Hammer nennen.Was? MonkaS, no, no. Ich weiß nicht, was er will von mir. Ich bin in die Entity ID einbisschen. So und jetzt haben wir das da drin. Und wenn wir jetzt hier Dashboards haben, keineAhnung, Dashboards fürs Wohnzimmer, Dashboards für den Keller, wie auch immer. Hier habenwir ein bisschen ausprobiert. Jetzt stellen wir mal vor, wir hätten hier die Steckdosenleisteim Keller liegen zum Beispiel, um da irgendwelche Sachen an- und auszuschalten. Da könntenwir jetzt einfach im Dashboard hier uns den Kram hinzufügen. Wobei das natürlich einbisschen hässlich ist, so groß. Ich würde eher sagen, wir nehmen sowas hier, wir nehmenhier sowas wie den, äh, das Grid. Sagen drei Columns und sagen hier Buttons zufügen. Hammer1, Hammer 1, Hammer 1. Stellen wir das jetzt noch um. Guck und jetzt ist wichtig, dassman den Kram richtig benannt hat. Weil jetzt kann ich hier nämlich direkt nach dem Namensuchen und nicht nach diesen kryptischen Dingern. Weil wenn ich jetzt drei Tasmotageräte habe,ist es natürlich sehr undurchsichtig, was es eigentlich ist und so ist es besser. USB,save. Und schon habe ich meine Steckdosenleiste in meinem Dashboard fürs Wohnzimmer oder fürden Keller drin und kann hier einschalten und ausschalten. Und das ist jetzt halt auchin UI was relativ touchfreundlich ist. Guckt, USB ist jetzt aus. Ihr seht, es ist ausgegangenoder geht gleich aus. Fahre ich es an, geht es bitte an. Ja. Das ist natürlich sehr praktischjetzt. Natürlich kann man die Dinger dann auch am Endeffekt so benennen, wie man esbraucht. Also Hammer 1 und so ist jetzt interne Bezeichnung ganz gut, aber realistisch betrachtetwürde das dann sowas heißen wie Fernseh. Das nächste ist dann keine Ahnung Sound. Wasweiß ich, was hat man da sonst noch? Blu-ray? Keine Ahnung, PS5 und Shitbox. Und USB. Hätteman dann sowas. Dann könnte man das quasi übers Dashboard im Wohnzimmer ein und ausschalten.Und das alles nur dank Big Brain Custom Firmware. Nice. Ja, also nachdem das mit dem Flaschengut funktioniert hat. Das war diese Steckdosenleiste hier. Gucken. Sag mal, ist die teurer gewordenoder hat die das letzte Mal auch schon 36 Euro gekostet? Zack, Amazon. Ich muss Amazonauf dem iPad aufmachen und gucken. Amazon. Wie? Ich hab da kein Amazon drauf? Lul. Warumhab ich keine Amazon App auf meinem Tablet? Monka. Super, da bin ich jetzt nicht mal eingeloggt.Da kann ich jetzt nicht gucken. Apps sind bloated. Auf dem Handy kann ich jetzt auchnicht gucken, weil das Handy, das Handy habe ich ja gerade für die Kamera hier oben imEinsatz. Ich hab wirklich die Amazon App nicht drauf gehabt. Wahrscheinlich verwendeich die immer auf dem Handy. Weiß nicht. Hätte nie gedacht, dass Max ein iPad. Warumnicht? Jetzt muss ich mal, jetzt muss ich mal den Flex raushängen. Ich glaube, ich habmittlerweile 15 Tablets. Nicht Tablets. 15 Smartphones, Schrägschräg Tablets, die sichüber die letzten Jahre so angesammelt haben. Drei Viertel sind da von Android. Der Rest,ja, ne, ne, ne. 60, 60% sind Android, 40% ist iOS. Also ich hab genug von beidem. Unddas meiste davon habe ich mir noch nicht mal gekauft. Ich hab eine gesponserte Shield TVnoch. Tablet, Shield Tablet oder wie das Ding hieß. Dann von G2A habe ich mal eins gekriegt.Android, Android Gerät. Dann haben wir zwei iPads. iPhone 11, iPhone SE. HD 10 von Amazon,zwei Stück in HD 8. Ein ganz altes Tegra Note. Ich glaub, das war's. Ach ne und auch so einkomisches Asus. Ja, die Edelmetalle liegen bei mir rum in Form von Tablets. Spielst dunoch GTA RP? Was heißt denn, spielst du noch GTA RP? Ich glaube, du lext critical information.Ich habe aber noch nie GTA RP gespielt. Also, ähm, was frage? Wo denn? Wie heißt der CloudflareService, womit du Subdomains und so einrichtest, wenn ich das richtige Erinnerung habe. Äh,das ist da ganz normale Cloudflare DNS. Musst du es aber nicht über Cloudflare machen. Dukannst es über fast jeden anderen DNS machen. Ich mache das über Cloudflare, weil meinDomain Registratus sackt und keine DNS API hat. Arbeit dir für CI, CD, POG Zeug mitJenkins auf der App. Wir haben mehrere Jenkins, ja. Aber ehrlich gesagt ist es immer wenigergeworden, was auf Jenkins raufläuft. Ich persönlich mag Jenkins. Weiß gar nicht, hat jemand einenHaare, warum Jenkins in den letzten Jahren so den guten Ruf verloren hat? Weiß gar nichtwarum. Ich mag Jenkins eigentlich, weil es eben schön flexibel ist und das super verbiegenkann für alles Mögliche. Ähm, klar, sag mal mal, wenn du auf GitHub bist, dann stehendie Leute halt alle unglaublich auf GitHub Actions. Haben wir hier im Stream auch schongemacht. Jenkins hat noch keinen Yammel. Hä, wie? Die Drehpost kannst du schon ewig auscheckenmit Jenkins und was du dann damit auswertest, ist ja dein Ding. Das stimmt, Jenkins istnicht Cloud-Native, wobei man heutzutage Container technisch auch alles in der Cloud laufen lassenkann, was man will. Ja, ich verstehe es, wenn man es übers Repo konfigurieren will. Ach,das meinst du, dass im Repo so eine Bild-Yammel oder so reinkommt? Ja, das geht glaube ichnicht. Ja, ja, ja, das glaube ich, weiß ich nicht. Ich habe schon mich in der Richtungschon eine Weile nicht mehr mit Jenkins beschäftigt. Ich glaube, das geht noch nicht, ja. Aberich mag Jenkins. Ach so, das meinst du mit Cloudflare. Nee, dann brauchst du die kostenlose,also die kostet erstmal nichts, die Cloudflare DDoS Protection brauchst du dann. Dann musstdu den Cloudflare einstellen, wohin der das proxen soll und dann dein DNS auf Cloudflareumschalten. Also der DNS löst auf Cloudflare auf und Cloudflare schiebt dann Port 443quasi weiter. Ja, das geht, das funktioniert. Ja, also um das zu beantworten, wir habenauf der Arbeit ein paar Jenkins, das ist aber immer weniger geworden. Also was bei uns jetzt,ich weiß gar nicht, worauf unsere ganzen Entwickler stehen. Also ich werde in Zukunft auch aufder Arbeit mehr GitHub Actions verwenden, einfach weil wir immer mehr Sachen in GitHub packenund ansonsten keine Ahnung, was die anderen treiben. Jenkins kann das auch, ja, ich weiß,ich glaube Jenkins ist einfach nicht mehr cool genug. Ich meine Jenkins hat ein richtigmieses Logo. Das sieht aus wie 2005, guckt euch das mal an. Ich meine, wer will das Softwaremit so einem Logo verwenden? Das ist so richtig exquisite Logo. Drones, das habe ich mittlerweileauch schon öfters gehört, ja. Was? Das habe ich nicht kapiert, was? Ich hatte so 2006mal auf einem Windows XP Laptop ein Programm, das wenn man mit einem WLAN Netz verbunden war,einen Key ausgelesen hat und mit dem konnte man sich dann auch mit anmelden, wenn das Passwortgeändert wurde. Was? Also das wäre fatal, wenn du dich noch einloggen könntest, wenndas Passwort geändert wurde. Meinst du vielleicht, dass gar nicht das WLAN Passwort, sonderndass es irgendwie so ein Portal davor war, wo du dich anmelden musstest, wo dann einBrowser aufgegangen ist? Das hat ja mit dem WLAN Passwort aber nichts zu tun. Das gehterst, wenn du im WLAN dann schon drin bist. Ansonsten wäre es ja fatal, wenn du das WLANPasswort änderst und irgendwelche Leute, die Special Hacker mit Windows XP am Start haben,sich einfach so noch verbinden könnten. Ne, ne, ne, das effektive WLAN Passwort, ne, dasWLAN Passwort gibt es nicht. Vielleicht war das noch für WEP, weil es war 2006, vielleichtwar das irgendein WEP Cracker oder so. Den musst du dann aber jedes Mal neu laufen lassen.Kannst du die Customfirma nochmal überfliegen? Ja, was genau? Hier, da. Was willst du sehen?Also ich gehe mal davon aus, dich interessiert nicht der Home Assistant Teil, sondern hierdie Konfig für die Customfirma. Abgesehen davon, dass die nur 10 Ampere kann, hat daseigentlich gar nicht... naja, das reicht doch. Es sei denn, du willst Heizlüfter ein paardran anschließen. Für was reicht denn das net? Für die meisten Geräte, die du da anschließenkannst, das ist doch mehr als genug. Ich mein, guck mal, was habe ich hier dran angeschlossen?Lass mal gucken. An der einen Leiste habe ich hier mein Ringlight angeschlossen und dieanderen Sachen zum Basteln. Hier im Keller habe ich einen Raspberry Pi angeschlossen,das für die Türgegengesprecherlage deckt, Zeugs angeschlossen, den Schalter für diePumpe angeschlossen, also nix, was irgendwie großartig da Leistung braucht. Wenn du dajetzt irgendwie vier Heizlüfter dran anschließen willst, mit jeweils, keine Ahnung, 2000 Watt,ja da würde ich mir das nochmal überlegen. Du willst, du vertraust dem nicht ohne Prüfzeichen.Moment, Moment, Moment, Moment, Moment. Also die haben immerhin schon mal ein CE-Zeichenaufgedruckt und außerdem wird das von einer deutschen Firma vertrieben, die sind dannam Arsch, wenn die sowas hier verkaufen. Ansonsten hast du nix. Das kann sich eh jedernachdrucken, ist egal. Na GS müsste da nicht drauf kriegen. Das Ding prüft keiner, geschweigedann. Also ich würde mir da jetzt nicht so viel Gedanken machen. Wie gesagt, zumal esauch noch von einer deutschen Firma vertrieben wird, also im Zweifelsfall sind die dann imZweifelsfall. Bei der Prüfung explodiert es wahrscheinlich. Wir machen größtens alsdamit einfache SQL, Backup, Jobs und PowerShell Befehl absetzen. Ja, finde ich das auch einegute Sache. Jobrunner Geschichten, ja. Deswegen mag ich Jenkins. Jenkins ist da halt richtig,Jenkins ist nicht nur Software, Code technisch fix, also zentriert. Ich meine, aus der Eckekommt es letztendlich irgendwie, aber du kannst halt mit Jenkins wunderbar alles machen. Deswegenich mag Jenkins. Ganz normales GitHub. Deswegen schieben sie jetzt auch alle so Panik, weilsie festgestellt haben, fuck wir haben Passworte im Klartext, im Repo stehen und das wollenwir nicht so auf GitHub pushen. Dazu kann ich dann immer nur sagen, heck you, weiß ichnicht, ob wir das Emote haben, aber das denke ich mir dann immer, wenn ihnen das nach 10Jahren einfällt. Man denkt schon immer, heck you. Ja, natürlich Private Repo, aber halttrotzdem auf GitHub. Also falls, das ist G-Bait, ja, aber falls es stimmt, ich sage immer dabei,dass ich euch nicht meine. Ich meine zum Beispiel euer Kack-Management, die dafür gesorgt haben,dass das so am Arsch ist, wie es jetzt ist. Ja, mit Sicherheit. Also mehr als ein Handywürde ich da nicht dran anschließen. Sonst Smokers Smoke. Also wie gesagt, ich habe dreidieser Steckdosenleisten aktuell im Einsatz. Das macht überhaupt keine Probleme. Eineliegt im Keller, eine liegt hier hinten auf dem Schreibtisch und eine liegt hier da, hierhinten, hier seht ihr es ja auch gerade hier, den da. Also überhaupt kein Ding. Welche History?Ich bin müde. Ich habe auch jetzt geflasht. Eigentlich habe ich überhaupt kein Contentmehr für den Stream. Wir sind durch. Ich habe euch gezeigt, wie man flasht. Habe ich gezeigt,wie man den Home Assistant einbindet. Mehr kann ich euch heute nicht zeigen. Bedge-Time,nee noch nicht ganz. Noch nicht ganz Bedge. Aber fast Bedge. Könntest du noch 10 bestellen,das mache ich auch. Aber nicht on stream. Ich bin hier nicht eingeloggt bei Amazon.Hey, ich verstehe einiges nicht. Ich verstehe, ich verstehe einiges nicht, was da abgeht.Was ich auch nicht verstehe. Aber da bin ich mir nicht sicher, Chet. Ihr seid doch schlau.Ihr wisst da doch bestimmt Bescheid. Also es gibt jetzt ja oftmals so Prämien, wennman quasi sein altes Auto verschrotten lässt, um sich ein Elektroauto zu kaufen. Ich meineklar, dass wenn man quasi vor der Neuanschaffung steht und die Auswahl hat zwischen einem Elektroautound einem Verbrennerauto und wenn man auch mal davon ausgeht, dass vielleicht der Stromdemnächst nicht mehr nur mit Kohle oder sonst was hergestellt wird, ist ein Elektroautosicherlich für die Zukunft das bessere. Aber es geht ja nicht unbedingt um die Neuanschaffung.Viele Leute haben ja noch ein altes Auto. Und so wie ich mir das denke, ist es docheigentlich das Beste, was man machen kann, dieses alte Auto weiter zu fahren.Oder ich meine, warum sollte ich quasi was, was hergestellt wurde wegschmeißen? Alsoin der Regel ist wegschmeißen und Neuanschaffen doch immer um ein vielfaches, ja wie sollman sagen, ungesünder. Also verstehe ich den Sinn dahinter gar nicht, dass man sagt,okay, wenn man jetzt sich ein neues kauft, dass man sich dann ein Elektroauto kauft,ja das würde ich auch so machen. Also deswegen, das verstehe ich gerade nichtso ganz, dass alle so scharf drauf sind. Ich meine klar, sie sind so scharf drauf, nichtder Umwelt zuliebe, was wir eigentlich machen sollten, sondern um Autoverkäufe anzukurbeln.Ja genau, das denke ich mir auch. Das Beste ist, den Mist zu verwenden. Sag mal so, dasBeste ist erstmal, man braucht gar nichts. Was man nicht hat und nicht benutzt, ist okay.Aber danach ist es, wenn man es hat, einfach so lang wie es geht zu benutzen. Oh ja unddann kann man sich was Neues holen. Kannst du einen Passwortmanager? Dein Sub wurdegeknurriert. Oh, habe ich nicht gesehen hier. Exquisite, 3 Monate, 4 Monate SubscriptionTabcon. Ich habe massive, huge Hyper-Subscription hier. Also ich benutze hier KeyPass 2, gibtaber auch zig andere Passwortmanager. Ich mag halt KeyPass, weil ich schon eine Weileverwende und für meine rein offline Sachen und Sync auf dem zweiten Rechner funktioniertdas wunderbar. Du hast auch was wie Bitwarden noch selbst gehostet, das ist auch okay. Eigentlichist alles, was du selbst in der Hand hast, okay. Was ich auf gar keinen Fall machen würde,ist Cloud Passwortmanager verwenden. Ich kann das nicht verstehen, wie sich Leute darüberbeschweren, dass, also darüber beschweren kann man sich, aber die dann wirklich darüberüberrascht sind, wenn es dann mal wieder irgendwelche Datenleaks gibt und ihre Passwörter wechselnund sowas. Cloud Passwortmanager, wenn ihr nicht wisst, was der Anbieter macht und daswisst ihr nicht, wenn ihr nicht gerade der Anbieter seid. Warum? Warum? Ja, was weißich bei irgendwelchen anderen Dingern, ja, kann man Cloud Services ja verwenden, aberdoch nicht für das Wichtigste aller, was man hat, nämlich die Passwörter. Meinung zuKeyPass XC habe ich, weiß nicht, ob ich das ausprobiert habe. Ich habe KeyPass 2 seitEwigkeiten. Ist nie passiert bei einem, weiß ich nicht. Ich würde aber eher darauf tippen,dass das schon passiert ist. Leak Cloud Passwort Manager. Passwort Leak. Bäm, das erste, wasich gefunden habe. Rock You 2021. Wunderbar. Also mich würde, wie gesagt, mich würde,mich würde nicht wundern, wenn das schon öfters mal vorgekommen ist. Also, wie gesagt,ich halte nichts von Cloud Passwort Managern, die von anderen Anbietern betrieben werden.Ja, das ist richtig, sehe ich auch so. Die Bahn muss es geschissen bekommen. Der ChainLoader ist wieder voller Welleskalieren, Alter. Ja, das sagen die. Hat sich wirklich irgendjemandmal die Software angeguckt, ob das wirklich so ist? Ob die aktuelle Libraries verwendenvon was auch immer sie zum verschlüsseln. Also ich traue keinem Cloud Passwort Manager.Es ist auch total unsinnig. Warum soll ich den Scheiß dann in die Cloud legen? Mal ehrlich,man hat, man hat keine Ahnung. Ich sag mal, man hat 300 Passwörter. Man hat ja mittlerweileviele Passwörter. Aber mal realistisch überlegt, wie viele dieser 300 Passwörter braucht mandann wirklich zum Beispiel auf einem Smartphone. Fünf. Warum sollte ich meinen kompletten PasswortManager da drauf packen? Im Zweifelsfall nehme ich halt diese fünf Passwörter undspeichere sie dort in irgendeiner App drin. Meinetwegen, wenn ich die mobil brauche, aberdoch nicht den kompletten, aber nicht den kompletten Safe, geschweige denn irgendwie,das ist doch keine Begründung, warum man es in die Cloud legen sollte. Also wie gesagt,ich würde nie Passwort Manager in der Cloud verwenden. Ja, ein paar habe ich auch im Kopfund die sind ziemlich lang. Am besten ist auch geil bei uns auf der Arbeit. Ich mussdas jetzt ein bisschen anders erzählen, oder? Da hatten sie letztens auch irgendein Meetingso security-mäßig und haben sich überlegt, wenn der Hacker Zugriff auf den Server bekommt,das machen die bei mir auf der Arbeit gerne. Die sagen dann immer irgendwie so als Begründung,oh ja, der Hacker macht dann irgendwas, was der genau macht und wer da überhaupt hackensollte und was da los ist vollkommen egal. Dann sagt dann immer einer irgendwie sowas,aber wenn der Hacker Zugriff auf unseren Server bekommt, dann kann er sich das und das angucken.Da habe ich auch dazu gesagt, aber sehr gut, davor hat der Hacker schon unser Passworterraten. Ich meine, wir haben so Passwörter wie Live-Umgebung, das findet er nie raus.Live-Umgebung, nein, das kann man nicht knacken, das ist unknackbar. Oh nein, das ist keinwirkliches Passwort von der Arbeit gewesen, das habe ich jetzt geändert im Kopf. Dasist was ähnliches, aber genauso bescheuert. Also, die machen sich da Gedanken um tausendDinger und haben teilweise Passwörter. Da muss nicht der Hacker irgendwie per ZeroDay auf unserem Linux irgendwie was machen. Ne, der probiert fünf Passwörter durch undist eingeloggt. Also, ich weiß eh nicht bei uns, was da mit den Leuten teilweise losist. Genauso wie ich mal vor einer ganzen Weile, habe ich euch ja schon mal erzählt,gemietet habe und der Typ meinte dann zu mir, wir müssen mit dem Rechenzentrumsteam klären,wir brauchen da die fetteste Hardware, die wir haben und war da Felix am Start, Felixso, was haben wir denn da und da Felix meinte so, die fetteste Hardware ist irgendwie zweiTerabyte RAM oder mittlerweile glaube ich noch mehr, zwei Terabyte RAM, 48 Kerne, das istschon ordentlich, das brauchen wir, die fetteste Hardware, wir rechnen mit massiv vielen Zugriffenund da hatte ich ihn gefragt, ja und, da ging es um irgendwelche komischen WordPress-Seiten,die sauer interessieren, ja und was, mit was für Zugriffen rechnen wir da so? Da meinteer so, ich bin mir jetzt, Leute, ich bin mir nicht mehr sicher, wie die Zahl genau war,ja, ich weiß nur noch, wie er das gesagt hat und dann sagt er dann so, 1000 und ich dachteso, 1000 in der Sekunde oder so, das ist schon, das ist zwar kein, das geht schon, aber dasist natürlich schon ordentlich und dann meinte er, am Tag, da habe ich dann auch innerlich,nein, nicht nur innerlich, auch äußerlich gecakt, da habe ich mir gedacht, okay, lassman Raspberry Pi Zero hinstellen, 1000 am Tag oder es kann auch sein, dass er in derStunde gesagt hat oder so, macht keinen Unterschied, also, so lange das nicht in der Sekunde undselbst in der Sekunde ist das kein Problem, also das geht, dann braucht man vielleicht,je nachdem was dahinter hängt, tatsächlich bisschen dickere Hardware, aber in der Stundeoder gar am Tag, also pro Minute schaffst du easy, mit fast jeder Krücke, die es sogibt, wie gesagt, ich hätte gesagt, wenn er pro Sekunde sagt, dann würde ich sagen, okay,oh man, wir haben da schon Spezialisten teilweise am Start, da muss ich immer wieder mit demKopf schütteln, aber wisst ihr was das witzige ist, genauso wie ich über die Leute lästere,lästern die auch über uns, das weiß ich, was mich auch nicht juckt, die haben da wahrscheinlichsogar recht, die haben da wahrscheinlich sogar recht damit, weil es ist einfach so, 90% derLeute sind unfähig, das bedeutet 90% unserer Entwickler sind unfähig, das heißt aber auch90% unserer Admins sind unfähig, ich bin wahrscheinlich auch unfähig, also es isthalt so, dagegen ist Ping ein Dedos, ja. Habt ihr auch ältere Kollegen, die irgendwiebei 2005 stehengeblieben sind, die haben kaum alte, also wir haben einen bei uns, der istwirklich relativ alt, er geht glaube ich sogar nächstes Jahr in Rente oder so, der ist einbisschen schwierig im Umgang, was neue Sachen angeht, vor allem schnell neue Sachen, abergut, kann ich verstehen, und ansonsten haben wir eigentlich kaum so richtig ältere, ichdenke, ich denke die meisten sind ungefähr in meinem Alter, also irgendwas zwischen 30und 40. Schule haben wir teilweise, Windows 2003 Server, mich würde nicht wundern, wennes Schulen gibt, die noch Windows 8, 9 haben, gibt's garantiert. Schluck auf, was ist dennjetzt los, irgendwelche Brennpunktschulen in Berlin oder so, die haben bestimmt nochWindows 98, die mit Gitter stehen am Klassenzimmer, das ist eine gute Antwort, aber trifft übrigensauf Führungskräfte genauso zu, man kann eigentlich bei allem, egal in welcher Brancheoder in welchem Fachgebiet davon ausgehen, dass 80 bis 90% unfähig sind, also unfähigheißt jetzt nicht, dass die gar nichts können, dass aber sobald die Sachen komplizierterwerden, es bei denen aufhört. Das ist egal, ob das Führungskräfte sind, ob das Adminssind oder ob das Programmierer, Softwareentwickler, was auch immer sind, egal ob es Ärzte sindoder sonst was, 80 bis 90% ist einfach, ja unfähig ist das falsche Wort, sobald es überdie Standardsachen rausgeht, ist da halt nichts mehr. Was meint ihr denn, warum manche Ausbildungenso anspruchsvoll und schwierig sind, sei es um Arzt zu werden oder Pilot zu werden oderum solche Dinge zu machen, das ist kein Wunder, dass die so anspruchsvoll sind, weil diewollen sicherstellen, dass die 80%, die nix auf die Reihe kriegen, nicht im Endeffektdann hinterm Steuer sitzen. Hat er? Was wir als Passwortmanager, oh fuck, ich hab keineAhnung, wie das Ding heißt, irgend so einen hässlichen Active Directory basierten Passwortmanager,der ein ungültiges Zertifikat hat beim Einloggen, wenn man das falsch startet, was auch sehrvertrauenserweckend ist bei einem Passwortmanager. Ja, ist so, es ist überall so. Secret Zone,ich hab keine Ahnung, wie das Ding heißt. Also das älteste Linux System, was wir haben,ist den Red Hat Enterprise Linux 4. Weiß nicht, was da für ein Kernel drin ist. Schauen wireben. Ah, yes. Top aktuell. Kernel 269 100. Das ist doch mal pock. Top aktuell. Und werhätte das gedacht, es ist in Oracle datenbankbasiertes Warenwirtschaftssystem, was darauf läuft.Also manche Sachen wirst du halt echt nicht los. Das stimmt nicht. Leute, Leute, ich habeuch angelogen. Das stimmt nicht, was ich gesagt hab. Das stimmt nicht. Ich hab michvertan. Das ist noch viel schlimmer. Es ist, es ist noch viel schlimmer. Das älteste Systemist in Red Hat 5. Es ist in Red Hat 5 das älteste System, was wir haben. Aber es istin Red Hat 5 getarnt als Red Hat 4. Die Red Hat Versionsdatei ist angepasst. Das ist inRed Hat 5. Und in der Versionsdatei steht drin, es ist ein Red Hat 4. Weil die Datenbank,die da drauf ist, ist so alt, dass sie nur startet, wenn es in Red Hat 4 ist. Und dasälteste, was wir hatten, war glaube ich in Red Hat 5. Und deswegen hat man einfach dieDatei angepasst, dass das startet. Ich erinnere mich. Ja, das stimmt. Red Hat 5 ist das, istdas älteste, was wir haben. Aber es ist auch nicht wirklich neuer. 2, 6, 18er Körner.Das, was ihr jetzt hier erfahrt, ist halt so typischer Business-Enterprise-Shit. Da,da machst du nix, ja. Oh, das ist richtig schöne Bed-Git-Musik, oder? Findet ihr nichtauch? Debian 8. Das ist auch schon ein bisschen älter. Findest du richtig schöne Bed-Git-Musik.Allerdings, ich mein, Bed-Git-Time ist noch 50 Minuten hin. Hörst du nix? Excellent Bed-Git.Ja, ich hab euch jetzt ja schon jede Menge erzählt. Ich überleg grad, ich brauch mal,ich muss demnächst mal wieder ein neues Story-Video aufnehmen. Und ich bin mir noch nicht ganzsicher, was ich nehmen soll. Ist schon viel Schwachsinn passiert, aber mir fällt jetztgrad nix so, so richtig Griffiges ein, was ich als nächstes nehmen könnte. Im ZweifelsfallRecycle-Story. Irgendwas, was ich hier im Stream schon erzählt hab, noch nicht auf YouTube.Erster Schultag? Ich kann mich an meinen ersten Schultag nicht mal richtig erinnern. Ich binnicht mal sicher, ob ich ne Schultüte hatte. Wahrscheinlich. Erster Schultag muss für michrelativ unspektakulär gewesen sein. Ich kann mich da gar nicht mehr richtig dran erinnern.Erster Ausbildungstag. Das weiß ich noch. Erster Ausbildungstag beim Provider. Das weißich noch. Da musste man irgendwelche dummen Kennenlernspielchen machen. Das ist richtigPain's Jam gewesen. Das kann ich mir noch dran erinnern. Da musste man durchs ganze Gebäuderennen und quasi erraten, welcher Mitarbeiter damit gemeint ist und so was. Richtig, richtigmassive Pain's Jam, Alter. Das ist so cringe gewesen. Äh, ja. Könntest du machen. Alsozumindest die User-Seite, also Libraries und sonst was. Der Kernel ist natürlich neuerdann. Der ist ja der vom Host. Erster Arbeitstag nach Ausbildung. Oh, da kann ich mich tatsächlichnicht mehr dran erinnern. Aber erster Ausbildungstag kann ich mich noch dran erinnern. Das weißich noch. Der, ja, komische Kennenlernspielchen. Das war richtig, richtig Pain's Jam. Ich binja immer noch, ne. Ich hab euch ja die Story erzählt von der Weihnachtsfeier und dem Ausbildungsgrill.Da ärgere ich mich heute noch. Weil mit der hab ich mich auch wirklich gut verstanden.Und eigentlich haben wir uns beide, fanden wir uns, glaub ich, ganz nett. Aber ich hab'shalt wieder verpeilt. Ja. Vielleicht ist sie hier im Stream. Nein, hier ist sie garantiertsie hier nicht im Stream. Die ist garantiert nicht im Stream. Null. Unser Chef was jetztzu einer Team-Building-Maßnahme außerhalb der Arbeitszeit? So ein Arsch, Alter. Alsozwingen ist eh schon mal außerhalb der Arbeitszeit so ein Ding. Jungfrau check? Ne, das gehtanders. Poki V check musst du machen. Virgin check, Poki V, I'm safe, das musst du machen.Virgin check, Poki V, I'm safe. Chat, ich bin mal gespannt, wer den nicht übersteht.Jetzt will ich sehen, Chat. Auf geht's. Virgin check, Poki V. Jaja, ich weiß. Ach komm, esist mittlerweile alles verboten. Okay. Keine Poki-Subs hier. Jetzt enttäuscht mich derChat aber. Ich hatte tatsächlich mal einen Monat Pokimane gesubbt. Allerdings hat mirden Sub jemand gegiftet. Ich weiß bis heute nicht warum und wer das war. Okay, Chat, ihrhabt bestanden. Haben wir nochmal Glück gehabt. Ganz knapp, close. Dann musst du ja im Streamgewesen haben. Muss man das? Du hast das nicht wirklich gesubbt, oder? Du warst bestimmtschon vorher gesubbt und du hast nie den Check gemacht. Guck, er hat nie den Check gemacht.Der war die ganze Zeit schon gesubbt. Exposed der Chandler hier. Gott soll jeder suppen,jeder will. Ist mir eh noch egal. Ihr könnt auch irgendwelche ASMR-Ear-Licking-Channelsmachen. Pool-Streams, wo auf der Banane rumgerutscht wird, kann jeder machen, was er lustig ist,ist nix. Tja. Ja, das war's für heute. Bis zum nächsten Mal, tschüss.Ja gut, Leute. Ich hab absolut kein Content mehr left für heute. Was ein Scheißsatz,Alter. Ich hab kein Content mehr left. Also Leute, ich hab kein Content mehr left fürheute. Und geflasht haben wir, hat alles funktioniert. Ich werd mir jetzt nochmal, sag mal, 10 Stückvielleicht nicht, aber sag mal mal 5 Stück hier. Da, da. Ich kann grad nicht hinkucken.5 Stück bestell ich mir da nochmal von. Weil Steckdosen-Leisten kann man nie genug haben.Wie wäre es mit Level-Cap-Chebaten, ey? Was am Sonntag wieder? Was soll man sich dachebaten lassen bei Level-Cap? Was gibt's denn da? Was chebatet er dann wieder? Warlhex-Specialistgefixt. Was heißt gefixt? Das Spiel ist doch nimmer raus. Was soll da gefixt werden?Fix ist eine Fehlerbehebung. Dazu muss es den Fehler erstmal geben, damit man ihn behebenkann. Oder Spiel gibt's noch nicht. Ich mein, es dauert nicht mal lang. Es dauert noch 10Tage jetzt. Da, hier, da. Ne. Da. Wer ist eigentlich auf diese unintuitive Geschichtegekommen, dass ne Woche 7 Tage hat anstatt 10, dass ne Minute 60 Sekunden hat, 60 Minutenne Stunde und dann aber 24 Stunden nen Tag und sowas. Könnte man das nicht alles wenigstensauf 2er oder 10er Basis machen? Und bei der Gelegenheit noch den ganzen Shit mit Zeitzonenund so einfach sein lassen? Dann wüsste man wenigstens, wie man das rechnen soll unddas wäre alles gut. Das waren sicher die Amis. Ne, ne. Das ist definitiv Pre-Kakona. DieAmis waren viel zu spät am Start, um Einfluss zu haben auf sowas. Die sind leider zu nerblöden Zeit am Start gekommen, als Fahrenheit und Galon und ounces und feet noch angesagtwaren und dann hat jeder gesagt, wir wollen den Scheiß nicht mehr, aber die Amis habengesagt, na, wir behalten das noch. Ja, right. Können wir Sommer und Winterzeit abschlafen?Nein, nicht mit der EU. Wir haben abgestimmt, die Leute wollten das haben, aber jetzt kriegenwir es nicht mehr hin. Ne, ne, ne, ne. So Sachen gehen nicht schnell. Das dauert tausendeJahre jetzt noch, bis das abgeschaltet wird. Egal Leute, ich geh jetzt off und dann inder Stunde im Bett gehen.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Pock, Pock Pock"}, {"id": 2, "start": 5.72, "end": 7.72, "text": "Pock Pock Pock"}, {"id": 3, "start": 19.56, "end": 21.56, "text": "Baschen alter Baschen"}, {"id": 4, "start": 21.56, "end": 25.56, "text": "Pock Pock Pock Pock Pock"}, {"id": 5, "start": 51.56, "end": 53.56, "text": "Garefire"}, {"id": 6, "start": 81.56, "end": 83.56, "text": "Pock Pock"}, {"id": 7, "start": 111.56, "end": 113.56, "text": "Pock Pock"}, {"id": 8, "start": 141.56, "end": 143.56, "text": "Pock Pock"}, {"id": 9, "start": 171.56, "end": 173.56, "text": "Pock Pock"}, {"id": 10, "start": 201.56, "end": 203.56, "text": "Pock Pock"}, {"id": 11, "start": 231.56, "end": 233.56, "text": "Pock Pock"}, {"id": 12, "start": 261.56, "end": 263.56, "text": "Pock Pock"}, {"id": 13, "start": 291.56, "end": 293.56, "text": "Pock Pock"}, {"id": 14, "start": 321.56, "end": 323.56, "text": "Pock Pock"}, {"id": 15, "start": 351.56, "end": 353.56, "text": "Pock Pock"}, {"id": 16, "start": 381.56, "end": 383.56, "text": "Pock Pock"}, {"id": 17, "start": 411.56, "end": 413.56, "text": "Pock Pock"}, {"id": 18, "start": 441.56, "end": 443.56, "text": "Pock Pock"}, {"id": 19, "start": 471.56, "end": 473.56, "text": "Pock Pock"}, {"id": 20, "start": 501.56, "end": 503.56, "text": "Pock Pock"}, {"id": 21, "start": 531.56, "end": 533.56, "text": "Pock Pock"}, {"id": 22, "start": 561.56, "end": 563.56, "text": "Pock Pock"}, {"id": 23, "start": 591.56, "end": 593.56, "text": "Pock Pock"}, {"id": 24, "start": 621.56, "end": 623.56, "text": "Pock Pock"}, {"id": 25, "start": 651.56, "end": 653.56, "text": "Pock Pock"}, {"id": 26, "start": 681.56, "end": 683.56, "text": "Pock Pock"}, {"id": 27, "start": 711.56, "end": 713.56, "text": "Pock Pock"}, {"id": 28, "start": 741.56, "end": 743.56, "text": "Pock Pock"}, {"id": 29, "start": 771.56, "end": 773.56, "text": "Pock Pock"}, {"id": 30, "start": 801.56, "end": 803.56, "text": "Pock Pock"}, {"id": 31, "start": 831.56, "end": 833.56, "text": "Pock Pock"}, {"id": 32, "start": 861.56, "end": 863.56, "text": "Pock Pock"}, {"id": 33, "start": 891.56, "end": 893.56, "text": "Dennis ist zum ersten Mal am Start"}, {"id": 34, "start": 895.56, "end": 897.56, "text": "Jonas auch zum ersten Mal am Start"}, {"id": 35, "start": 897.56, "end": 899.56, "text": "Huge"}, {"id": 36, "start": 899.56, "end": 901.56, "text": "Der Icefreak hat subscribt"}, {"id": 37, "start": 901.56, "end": 903.56, "text": "Jojo hat subscribt"}, {"id": 38, "start": 905.56, "end": 907.56, "text": "Gehts aber ab hier"}, {"id": 39, "start": 907.56, "end": 909.56, "text": "Das Scam Train fährt"}, {"id": 40, "start": 909.56, "end": 911.56, "text": "So, jetzt habe ich mich ein bisschen"}, {"id": 41, "start": 911.56, "end": 913.56, "text": "ausgelassen über die Bahn"}, {"id": 42, "start": 913.56, "end": 915.56, "text": "und alte Handys"}, {"id": 43, "start": 915.56, "end": 917.56, "text": "Übrigens Leute"}, {"id": 44, "start": 917.56, "end": 919.56, "text": "Soll ich euch mal erzählen, was ich gerade"}, {"id": 45, "start": 919.56, "end": 921.56, "text": "Ich hab gerade richtig, richtig nice"}, {"id": 46, "start": 921.56, "end": 923.56, "text": "Futterstells gemacht"}, {"id": 47, "start": 923.56, "end": 925.56, "text": "Ich hab Pizza, Hut"}, {"id": 48, "start": 925.56, "end": 927.56, "text": "Barbecue"}, {"id": 49, "start": 927.56, "end": 929.56, "text": "Barbecue Bacon Lovers"}, {"id": 50, "start": 929.56, "end": 931.56, "text": "gefuddert"}, {"id": 51, "start": 933.56, "end": 935.56, "text": "Falle dir aus Deinen für den Sub"}, {"id": 52, "start": 939.56, "end": 941.56, "text": "Excellent"}, {"id": 53, "start": 941.56, "end": 943.56, "text": "Er ist da"}, {"id": 54, "start": 943.56, "end": 945.56, "text": "Er ist da"}, {"id": 55, "start": 947.56, "end": 949.56, "text": "Max, mach mal"}, {"id": 56, "start": 949.56, "end": 951.56, "text": "Shoutout an mich"}, {"id": 57, "start": 951.56, "end": 953.56, "text": "Nein, ich mach keine Shoutouts"}, {"id": 58, "start": 953.56, "end": 955.56, "text": "Weißt du warum?"}, {"id": 59, "start": 955.56, "end": 957.56, "text": "Weil die Leute mittlerweile krass"}, {"id": 60, "start": 957.56, "end": 959.56, "text": "Chebaten, was Usernamen angeht"}, {"id": 61, "start": 959.56, "end": 961.56, "text": "Und ich mir immer Gedanken"}, {"id": 62, "start": 961.56, "end": 963.56, "text": "mache, dass wenn man den Usernamen falsch"}, {"id": 63, "start": 963.56, "end": 965.56, "text": "ausspricht, dass man dann irgendwas"}, {"id": 64, "start": 965.56, "end": 967.56, "text": "Bannwürdiges sagen kann"}, {"id": 65, "start": 967.56, "end": 969.56, "text": "Aber ich kann"}, {"id": 66, "start": 969.56, "end": 971.56, "text": "Shoutout an den"}, {"id": 67, "start": 971.56, "end": 973.56, "text": "Das Serif machen, oder? Das ist kein Problem"}, {"id": 68, "start": 973.56, "end": 975.56, "text": "Aber ich spreche das"}, {"id": 69, "start": 975.56, "end": 977.56, "text": "bestimmt nicht komplett aus"}, {"id": 70, "start": 979.56, "end": 981.56, "text": "Wer weiß, was das falsch betont bedeutet"}, {"id": 71, "start": 989.56, "end": 991.56, "text": "Ja"}, {"id": 72, "start": 991.56, "end": 993.56, "text": "Werden sie"}, {"id": 73, "start": 993.56, "end": 995.56, "text": "Guck mal"}, {"id": 74, "start": 999.56, "end": 1001.56, "text": "Das ist so ein Fond von Google"}, {"id": 75, "start": 1001.56, "end": 1003.56, "text": "Fonds"}, {"id": 76, "start": 1003.56, "end": 1005.56, "text": "Ich, ich traue"}, {"id": 77, "start": 1005.56, "end": 1007.56, "text": "der ganzen Sache nicht"}, {"id": 78, "start": 1011.56, "end": 1013.56, "text": "Macht Twitch das mit Bots?"}, {"id": 79, "start": 1015.56, "end": 1017.56, "text": "Na ja, das wären schon richtige"}, {"id": 80, "start": 1017.56, "end": 1019.56, "text": "Leute, seien wir mal ernsthaft"}, {"id": 81, "start": 1019.56, "end": 1021.56, "text": "Ich gehe davon aus, dass von"}, {"id": 82, "start": 1021.56, "end": 1028.24, "text": "wir grad 210 Leute im Chat. Also ich gehe davon aus, dass bei jedem Streamer, sag mal"}, {"id": 83, "start": 1028.24, "end": 1035.08, "text": "so, selbst bei ganz kleinen, dass es einen gewissen Anteil der Zuschauer gibt, die nicht"}, {"id": 84, "start": 1035.08, "end": 1040.48, "text": "zuschauen, weil sie den Streamer gerne zugucken, sondern weil sie ihn hassen und einfach nur"}, {"id": 85, "start": 1040.48, "end": 1048.08, "text": "warten, dass er irgendwie Scheiße baut, um ihn dann zu reporten. 100 Pro, das gibt's"}, {"id": 86, "start": 1048.08, "end": 1056.2, "text": "bei mir und es gibt es wahrscheinlich überall anders auch. Richtige Hater, genau. Die gucken"}, {"id": 87, "start": 1056.2, "end": 1060.84, "text": "den Stream nur, dass irgendwie einer was falsch betont, was falsch ausspricht, dann gleich"}, {"id": 88, "start": 1060.84, "end": 1067.72, "text": "report, report, report, report, report. Und wenn er dann gebannt wird, dann geht ihn einer"}, {"id": 89, "start": 1067.72, "end": 1084.72, "text": "ab. So sieht's aus. So, ich zeig euch jetzt mal was. Also, ich switche mal kurz auf die"}, {"id": 90, "start": 1084.72, "end": 1091.88, "text": "Kamera. Hast du mal Windows Subsystem für Android probiert? Nein, gibt's das mittlerweile?"}, {"id": 91, "start": 1091.88, "end": 1101.8, "text": "Ich dachte, das gibt's gar nicht. Das haben sie abgeschafft wieder. Also, ich zeig euch"}, {"id": 92, "start": 1101.8, "end": 1106.96, "text": "jetzt mal was. Bevor wir zur Steckdosenleiste kommen, ich zeig euch noch mal kurz was anderes."}, {"id": 93, "start": 1106.96, "end": 1113.28, "text": "Oder auch nicht mein Finger, den habt ihr ja mittlerweile oft genug gesehen. Ups. Ich"}, {"id": 94, "start": 1113.28, "end": 1128.52, "text": "zeig euch was anderes. Ich glaube, das ist das Richtige. Ja. Die waren nämlich diesmal"}, {"id": 95, "start": 1128.52, "end": 1140.04, "text": "echt schnell. Ich hab ja ESPs bestellt, D1 Minis. Das hat jetzt nur ein paar Tage gedauert,"}, {"id": 96, "start": 1140.04, "end": 1152.56, "text": "da waren die am Start 10 Stück. Poggers. Das heißt, da stehen irgendwelchen LED Projekten"}, {"id": 97, "start": 1152.56, "end": 1161.32, "text": "und Dingern jetzt nichts mehr im Wege. Wir haben wieder alles, was wir brauchen. 10 D1"}, {"id": 98, "start": 1161.32, "end": 1169.0, "text": "Minis für alle möglichen Sachen. Also, die waren wirklich schnell. So, und jetzt kommen"}, {"id": 99, "start": 1169.0, "end": 1173.6, "text": "wir zur eigentlichen Sache, warum ich heute den Stream angemacht hab. Ich mach heute aber"}, {"id": 100, "start": 1173.6, "end": 1177.88, "text": "nicht so viel Hektik. Ich bin echt ziemlich kaputt dank der Bahn und sinnlos in den Meer"}, {"id": 101, "start": 1177.88, "end": 1182.4, "text": "gefahren, Leute. Ihr müsst euch das mal geben. Ich habe heute auf der Arbeit nichts gemacht,"}, {"id": 102, "start": 1182.4, "end": 1193.8, "text": "weil ich musste, ich zeig es euch mal auf Twitter, den ganzen Tag total sinnlos mieten."}, {"id": 103, "start": 1193.8, "end": 1200.32, "text": "Guckt euch das mal an. Das ist doch nicht normal. Das war so schlimm. Ich hatte um 9 Uhr parallel"}, {"id": 104, "start": 1200.32, "end": 1208.84, "text": "zwei Meetings gleichzeitig. Was soll das denn geben, wenn es fertig ist? Konntest du die"}, {"id": 105, "start": 1208.84, "end": 1212.32, "text": "Meetings nicht auch digital machen? Doch, natürlich. Die waren ja auch alle digital."}, {"id": 106, "start": 1212.32, "end": 1215.8, "text": "Das ist der Witz. Es hat sich überhaupt nicht gelohnt, dass ich nach Frankfurt gefahren"}, {"id": 107, "start": 1215.8, "end": 1220.44, "text": "bin. Alles war rein digital. Ich hab niemand, mit dem ich gemietet hab, wirklich vor Ort"}, {"id": 108, "start": 1220.44, "end": 1232.48, "text": "gesehen. Komm mal, ich hab sogar zwei Meetings parallel gehabt um 9. Danach ging es weiter"}, {"id": 109, "start": 1232.48, "end": 1241.32, "text": "um 10.30 Uhr. Ich kann euch ja sogar sagen, was das war. Hier ging es um Dokumentation,"}, {"id": 110, "start": 1241.32, "end": 1249.46, "text": "also das Lieblingsthema eigentlich aller IT-Leute. Hier ging es um irgendwelche Dokumentationssachen"}, {"id": 111, "start": 1249.46, "end": 1254.16, "text": "und automatischen Import aus irgendwelchen Azure Key Value Stores. Hab ich gesagt, ich"}, {"id": 112, "start": 1254.16, "end": 1269.48, "text": "programmiere irgendwas. Was war denn das? Ach ja, hier ging es darum, dass die Leute"}, {"id": 113, "start": 1269.48, "end": 1274.84, "text": "im Klartext irgendwelche Passwörter in ihren Repos gespeichert haben und festgestellt haben,"}, {"id": 114, "start": 1274.84, "end": 1280.0, "text": "dass es keine so gute Idee ist, wenn wir unsere Passwörter auf Gitter pushen. Da hab ich mir"}, {"id": 115, "start": 1280.0, "end": 1286.48, "text": "gedacht, ach, wer hätte sich das vorher nur denken können, dass das keine gute Idee ist,"}, {"id": 116, "start": 1286.48, "end": 1295.64, "text": "als man die da reingeschrieben hat. Hier war unsere wöchentliche Wartungsarbeiten-Runde,"}, {"id": 117, "start": 1295.64, "end": 1302.2, "text": "wo dann jeder aus jeder Abteilung einer da sitzt, oder von jedem Team sogar, einer da"}, {"id": 118, "start": 1302.2, "end": 1309.6, "text": "sitzt. Da sind mittlerweile glaube ich 56 Leute eingeladen und ihre Wartungsarbeiten für die"}, {"id": 119, "start": 1309.6, "end": 1314.52, "text": "Woche vorstellen müssen. Äußerst Residenz-Sleeper-Termin kann ich euch sagen, da penst wirklich einen"}, {"id": 120, "start": 1314.52, "end": 1319.36, "text": "dabei. Vor allem, weil es immer Leute gibt, die aus Prinzip nachfragen müssen. Das nervt"}, {"id": 121, "start": 1319.36, "end": 1326.76, "text": "mich. So total random. Leute, so ein Beispiel, was auf unsere Wartungsarbeiten runterkommt."}, {"id": 122, "start": 1326.76, "end": 1332.28, "text": "Ein Beispiel. Ich muss das jetzt ein bisschen abändern, dass man nicht so sehr auf die Firma"}, {"id": 123, "start": 1332.28, "end": 1339.8, "text": "schließen kann. Es sagt zum Beispiel einer auf der Wartungsarbeiten-Runde, wir müssen"}, {"id": 124, "start": 1339.8, "end": 1348.2, "text": "irgendwie Coopernetiskluster neu deployen. Irgendwas. Und dann sagt unser Oberwartungsarbeiten-Guru,"}, {"id": 125, "start": 1348.2, "end": 1354.0, "text": "gibt es dazu noch irgendwelche Einwände, will dazu einer was sagen. Und dann kommt irgendjemand"}, {"id": 126, "start": 1354.0, "end": 1360.64, "text": "um die Ecke, hat das Auswirkungen auf die Kantine-Speisekarte oder irgendwie sowas,"}, {"id": 127, "start": 1360.64, "end": 1367.76, "text": "die gibt es bei uns elektronisch. So komplett planlose random Fragen kommen da immer. Es"}, {"id": 128, "start": 1367.76, "end": 1371.68, "text": "hat auch schon mal einer gefragt, wir haben einen Standort in Frankreich, wir haben einen"}, {"id": 129, "start": 1371.68, "end": 1381.6, "text": "Standort in Frankreich, wo besonders erfolgreiche Stonks-Leute quasi Urlaub gewinnen können,"}, {"id": 130, "start": 1381.6, "end": 1388.2, "text": "wenn sie so und so viel Zeugs verkauft haben. Und da hat mal ernsthaft einer gefragt, da"}, {"id": 131, "start": 1388.2, "end": 1393.88, "text": "hat auch jemand angekündigt, wir machen Wartungsarbeiten an Datenbanken. Und dann hat wirklich jemand"}, {"id": 132, "start": 1393.88, "end": 1400.52, "text": "gefragt, hat das Auswirkungen auf den Standort in Frankreich. Hat das Auswirkungen auf die"}, {"id": 133, "start": 1400.52, "end": 1405.68, "text": "Switche in Frankreich. Und da habe ich mir auch gedacht, Leute, ihr seid echt komplett"}, {"id": 134, "start": 1405.68, "end": 1415.32, "text": "durch. Garantiert, der Switch im Hotel in Frankreich rebootet sich bestimmt, wenn einer bei uns"}, {"id": 135, "start": 1415.32, "end": 1428.48, "text": "Datenbanken Wartungsarbeiten macht. Ganz sicher. 12.45 Uhr gab es Daily Team Meeting. 13 Uhr"}, {"id": 136, "start": 1428.48, "end": 1438.88, "text": "bis 13.30 Uhr gab es wieder so eine Art Wartungsarbeiten Runde. Und 13.30 bis 14 Uhr habe ich vergessen,"}, {"id": 137, "start": 1438.88, "end": 1443.48, "text": "weiß nicht, war ich wahrscheinlich geistig schon nicht mehr anwesend. Wie soll man da"}, {"id": 138, "start": 1443.48, "end": 1451.68, "text": "produktiv arbeiten? Das ist ja der Trick, gar nicht. Es gibt zu viel Bullshit-Jobs und"}, {"id": 139, "start": 1451.68, "end": 1458.68, "text": "Bullshit-Gramm, den man machen muss. Die wollen alle ihre Zeit irgendwie legitimieren, dass"}, {"id": 140, "start": 1458.68, "end": 1465.68, "text": "sie ihre Daseinsberechtigung irgendwie, weiß nicht. Da kann man nicht produktiv arbeiten,"}, {"id": 141, "start": 1465.68, "end": 1477.84, "text": "das funktioniert nicht. 15.50 Uhr, wisst ihr warum ich 15.50 Uhr bis 23 Uhr drinstehen"}, {"id": 142, "start": 1477.84, "end": 1483.84, "text": "habe? Nein, bei uns sind Meetings überhaupt nicht aus. Warum ich da 15.50 Uhr drinstehen"}, {"id": 143, "start": 1483.84, "end": 1488.32, "text": "habe, das habe ich blockiert, dass mich da keiner mehr einladen kann, weil wir hatten"}, {"id": 144, "start": 1488.32, "end": 1493.04, "text": "an einer keine Bereitschaft. Bereitschaft mache ich nimmer freiwillig. Wenn es bezahlt"}, {"id": 145, "start": 1493.04, "end": 1500.0, "text": "wird vielleicht, aber nimmer freiwillig. Früher habe ich sowas freiwillig gemacht. Ja, und"}, {"id": 146, "start": 1500.0, "end": 1505.4, "text": "ich habe das eingetragen, dass ich dort nicht mehr eingeladen werden kann, weil wir hatten"}, {"id": 147, "start": 1505.4, "end": 1510.36, "text": "so ein paar Kandidaten, die haben an 17 Uhr Meetings eingeladen und sowas. 17 Uhr, was"}, {"id": 148, "start": 1510.36, "end": 1518.32, "text": "ist mit denen los? 17 Uhr mache ich gerade Pepofet was zu essen daheim und miete bestimmt"}, {"id": 149, "start": 1518.32, "end": 1525.8, "text": "nicht mehr zu irgendwelchen sinnlosen Themen. Nee, das ist einfach nur Blocker, dass mich"}, {"id": 150, "start": 1525.8, "end": 1531.4, "text": "keiner einladen kann. So, die stehen richtig auf Miete. Morgen ist nicht so schlimm, aber"}, {"id": 151, "start": 1531.4, "end": 1535.4, "text": "heute war echt so ein krasser Tag. Willst du dich bei einer Firma bewerben, die einen"}, {"id": 152, "start": 1535.4, "end": 1543.8, "text": "Scrum Master MWD sucht? Warum nicht? Also ich würde mich nicht als Scrum Master bewerben,"}, {"id": 153, "start": 1543.8, "end": 1547.16, "text": "das nicht, aber warum sollte ich mich nicht bei einer Firma bewerben, die auch einen"}, {"id": 154, "start": 1547.16, "end": 1555.04, "text": "Scrum Master sucht? Blocker, ja, wusste, wusste, es geht bei uns nicht anders. Ich"}, {"id": 155, "start": 1555.04, "end": 1559.48, "text": "meine, hallo, wer macht denn bitteschön Meetings um 17 Uhr und dann am besten noch zwei Stunden"}, {"id": 156, "start": 1559.48, "end": 1565.76, "text": "oder so? Ich weiß auch nicht, was mit den Leuten los ist. Leute, jetzt kommen wir mal"}, {"id": 157, "start": 1565.76, "end": 1570.52, "text": "zur Hauptattraktion des heutigen Streams. Ich würde das gar nicht lange warten lassen,"}, {"id": 158, "start": 1570.52, "end": 1573.8, "text": "weil es könnte sein, dass es ein relativ kurzer Stream wird, wenn das nämlich nicht funktioniert."}, {"id": 159, "start": 1573.8, "end": 1583.32, "text": "Ich habe die letzte ihrer Art gefunden, Leute. Die CoGeek Steckdosenleiste nur rebrandet."}, {"id": 160, "start": 1583.32, "end": 1597.72, "text": "Das ist die CoGeek Steckdosenleiste. Guckt, seht ihr da? Das ist die hier. Schaut her."}, {"id": 161, "start": 1597.72, "end": 1604.84, "text": "Ich muss gucken, das ist die gleiche. Ich muss gucken, dass ich den Switch nicht wieder"}, {"id": 162, "start": 1604.84, "end": 1616.8, "text": "rausziehe. Das ist die und das ist angeblich die letzte Steckdosenleiste, die es gibt auf"}, {"id": 163, "start": 1616.8, "end": 1625.12, "text": "Amazon. Der letzte Typ Steckdosenleiste, den es gibt auf Amazon, der flashbar ist. Mehr"}, {"id": 164, "start": 1625.12, "end": 1628.8, "text": "gibt es nicht mehr. Ihr könnt durchgucken, ihr werdet nichts finden. Ihr findet vielleicht"}, {"id": 165, "start": 1628.8, "end": 1634.72, "text": "nur normale Steckdosen mit Glück, aber welche, die so alte Firmware haben oder überhaupt"}, {"id": 166, "start": 1634.72, "end": 1647.36, "text": "gar kein ESP866 mehr, sind mittlerweile die Regel. Dass du noch eine findest mit ESP866"}, {"id": 167, "start": 1647.36, "end": 1651.52, "text": "und alte Firmware, dass du die OTA flashen kannst, ist selten. Das ist vom Aussterben"}, {"id": 168, "start": 1651.52, "end": 1656.2, "text": "bedroht. Das ist die letzte ihrer Art. Ich hoffe, es funktioniert auch. Laut Amazon-Bewertung"}, {"id": 169, "start": 1656.2, "end": 1660.0, "text": "funktioniert es noch. Ihr seht, ich habe es noch nicht aufgehabt. Das ist noch original"}, {"id": 170, "start": 1660.0, "end": 1665.56, "text": "zu hier. Also kein Fake. Also entweder klappt es jetzt. Können wir ein bisschen gucken"}, {"id": 171, "start": 1665.56, "end": 1673.24, "text": "oder es klappt nicht und dann haben wir gelitten. Wenn du eine flashbare Steckdosenleiste entwickelst,"}, {"id": 172, "start": 1673.24, "end": 1681.96, "text": "bin ich der Erste, der Sellout macht dafür im Stream. Ich meine, an sich ist das ja nicht"}, {"id": 173, "start": 1681.96, "end": 1689.24, "text": "kompliziert, was da an Technik drin ist. Das sind 5 Relays, ein Microcontroller und"}, {"id": 174, "start": 1689.24, "end": 1698.28, "text": "halt ein halbwegs schönes Gehäuse. Fertig. Ich glaube, du kannst das nicht wirklich gut"}, {"id": 175, "start": 1698.28, "end": 1704.56, "text": "vermarkten, weil du hast halt immer noch die ganzen China-Chinesen für 25 Euro. Da kommst"}, {"id": 176, "start": 1704.56, "end": 1715.64, "text": "du wahrscheinlich nicht mit. Und den meisten Leuten ist es ja egal, ob man die flashen"}, {"id": 177, "start": 1715.64, "end": 1721.08, "text": "kann oder nicht. Die machen das über diese hässliche Smartlife-App. Warum willst du"}, {"id": 178, "start": 1721.08, "end": 1728.32, "text": "eine Steckdosenleiste flashen? Gute Frage. Die kommt jedes Mal. Erstens, hat mehrere"}, {"id": 179, "start": 1728.32, "end": 1734.16, "text": "Gründe. Erstens, dann brauchst du nicht die offizielle App. Wenn du nicht die offizielle"}, {"id": 180, "start": 1734.16, "end": 1739.12, "text": "App brauchst, dann brauchst du auch keine China-Chinesen-Cloud. Und das ist schon mal"}, {"id": 181, "start": 1739.12, "end": 1745.24, "text": "eines der Hauptpunkte, dass die Chinesen rausbleiben. Dazu kommt, dass man das mit geflashter Firmware"}, {"id": 182, "start": 1745.24, "end": 1749.8, "text": "auch deutlich besser an so ziemlich alles anschließen kann, was man will. Du hast irgendein"}, {"id": 183, "start": 1749.8, "end": 1755.32, "text": "Heimautomatisierungssystem, was über MQTT geht, mit Custom-Firmware kein Problem. Mit"}, {"id": 184, "start": 1755.32, "end": 1762.0, "text": "China-Chinesen-Firmware klappt das nicht. Willst schalten über ein Webinterface oder"}, {"id": 185, "start": 1762.0, "end": 1769.32, "text": "über eine Web-AP mit Custom-Firmware kein Problem. Mit China-Hardware geht das nicht."}, {"id": 186, "start": 1769.32, "end": 1772.84, "text": "Das bedeutet auch, wenn dein Internet nicht funktioniert, kannst du deine Steckdosenleiste"}, {"id": 187, "start": 1772.84, "end": 1784.96, "text": "nicht schalten mit China-Firmware. Geflasht, kein Problem. Gibt es sinnvolle Firmen, die"}, {"id": 188, "start": 1784.96, "end": 1790.8, "text": "Open-Source-Smart-Home-Produkte anbieten? Die Shelley-Dinger sind nicht schlecht. Ich"}, {"id": 189, "start": 1790.8, "end": 1796.32, "text": "glaube, die Shelley-Firmware ist nicht Open-Source, bin ich mir nicht sicher. Also die App auf"}, {"id": 190, "start": 1796.32, "end": 1799.84, "text": "jeden Fall nicht. Aber die Firmware, keine Ahnung. Aber die Shelley-Firmware kannst du"}, {"id": 191, "start": 1799.84, "end": 1807.68, "text": "ohne Probleme flaschen. Die lassen das von Haus aus zu. Es gibt bei Aliexpress-Hersteller,"}, {"id": 192, "start": 1807.68, "end": 1813.12, "text": "die bieten Tasmota Pre-Flashed mittlerweile schon an. Bevor es losgeht, Leute, ich muss"}, {"id": 193, "start": 1813.12, "end": 1824.64, "text": "mir noch mal schnell was zu trinken holen. Dann bin ich gleich am Start. Letztes Mal eine"}, {"id": 194, "start": 1824.64, "end": 1833.6, "text": "Staubsäure geflasht. Ja, nice. Was hast denn du für einen? Ich kenne gar keine neuen"}, {"id": 195, "start": 1833.6, "end": 1836.68, "text": "mehr, die man gescheit flaschen kann. Warte, ich hole mal schnell was zu trinken. Ich bin"}, {"id": 196, "start": 1836.68, "end": 1843.68, "text": "in zwei Minuten wieder da."}, {"id": 197, "start": 1926.68, "end": 1936.2, "text": "Da bin ich wieder. Ich habe mir übrigens auch, falls es mal zu dunkel ist, weil ich hatte"}, {"id": 198, "start": 1936.2, "end": 1941.08, "text": "letztens das Problem, wo ich was versucht habe zu flaschen, was daran zu lücken, wo"}, {"id": 199, "start": 1941.08, "end": 1951.08, "text": "ich nichts gesehen habe. Ich habe mir jetzt hier auch mal so ein Licht noch hingelegt,"}, {"id": 200, "start": 1951.08, "end": 1960.64, "text": "dass ich das noch mal extra hell machen kann. Dann sieht man besser was. Was braucht man"}, {"id": 201, "start": 1960.64, "end": 1969.88, "text": "um diese Steckdosenleiste zu flaschen? Ja, das zeige ich dir jetzt gleich. Ich gucke"}, {"id": 202, "start": 1969.88, "end": 1976.08, "text": "gleich. Sekunde. Muss ich erst mal wieder hinsetzen. Dann noch mal trinken abstellen."}, {"id": 203, "start": 1976.08, "end": 1985.92, "text": "Wenn es übel ist hochgesprintet, die Treppe, dass ich schnell wieder da bin. Guck mal,"}, {"id": 204, "start": 1985.92, "end": 1995.92, "text": "das Cellyzeug ist anscheinend wirklich open source. Ein DreamBot Z10 Pro. Ah ja, 440"}, {"id": 205, "start": 1995.92, "end": 2003.24, "text": "Euro mit Absaugstation ist wirklich günstig. Was heißt überhaupt flaschen? Die Firmware"}, {"id": 206, "start": 2003.24, "end": 2025.28, "text": "austauschen so sinngemäß. Also, auf geht's. Ne, nicht so gut. Ich habe einen S5, den konnte"}, {"id": 207, "start": 2025.28, "end": 2032.48, "text": "man gut flaschen. Die danach nicht mehr wirklich. Den S6 kann man glaube ich flaschen. Den muss"}, {"id": 208, "start": 2032.48, "end": 2036.2, "text": "man mal komplett zerlegen, da hätte ich schon mal keinen Bock drauf. Und die danach ging"}, {"id": 209, "start": 2036.2, "end": 2040.44, "text": "glaube ich gar nicht, bin ich mir aber ehrlich gesagt nicht sicher. Habe ich mich eben schon"}, {"id": 210, "start": 2040.44, "end": 2046.36, "text": "darüber ausgelassen, muss ich jetzt nicht nochmal alles erzählen. Also, was man dafür"}, {"id": 211, "start": 2046.36, "end": 2050.24, "text": "braucht, ganz einfach. Wir haben das ja schon noch vorbereitet alles. Also ich werde das"}, {"id": 212, "start": 2050.24, "end": 2053.44, "text": "jetzt nicht alles nochmal neu installieren. Wir haben das ja schon vorbereitet für die"}, {"id": 213, "start": 2053.44, "end": 2058.6, "text": "Steckdosen vom letzten Jahr. Also was man braucht ist eigentlich nur oder nicht zwingend"}, {"id": 214, "start": 2058.6, "end": 2063.0, "text": "notwendig. Geht bestimmt auch anderweitig, aber praktischerweise ist man hat einen Raspberry"}, {"id": 215, "start": 2063.0, "end": 2072.4, "text": "Pi. So, das hier ist jetzt ein 4er in diesem Fleer Case, was echt poggers ist. Ist aber"}, {"id": 216, "start": 2072.4, "end": 2076.56, "text": "leider fast zu teuer oder halb so teuer wie der Raspberry Pi. So ein Aluminium Gehäuse,"}, {"id": 217, "start": 2076.56, "end": 2085.68, "text": "das das dann schön die Wärme ableitet. Aber das ist wirklich gut. Man braucht ein Kappa"}, {"id": 218, "start": 2085.68, "end": 2092.8, "text": "Pride Kabel, auch ganz wichtig. Und wir brauchen den Star der Alters Streams immer. Wir brauchen"}, {"id": 219, "start": 2092.8, "end": 2098.12, "text": "unseren Small Access Point. Ohne den geht nichts. Nein, den brauchen wir nicht. Aber"}, {"id": 220, "start": 2098.12, "end": 2103.12, "text": "man braucht natürlich einen W-Lan, dass man die Dinger später über das W-Lan teilen"}, {"id": 221, "start": 2103.12, "end": 2106.84, "text": "kann. Also eigentlich brauchst du bloß einen Raspberry Pi und die passende Software drauf."}, {"id": 222, "start": 2106.84, "end": 2111.32, "text": "Wenn es denn geht. Wenn es nicht geht, ist das Stream wahrscheinlich relativ schnell"}, {"id": 223, "start": 2111.32, "end": 2118.92, "text": "beendet. Also, fangen wir das mal an. Ich werde den Raspberry Pi erst mal kurz einstöpseln."}, {"id": 224, "start": 2118.92, "end": 2124.44, "text": "Dann Strom anmachen und dann gucken wir mal. Also ich habe hier hinten, was ihr gerade nicht"}, {"id": 225, "start": 2124.44, "end": 2127.08, "text": "seht, hier hinten steht ein Switch. Guck, hier seht ihr noch die Ecke raus. Gucken vom"}, {"id": 226, "start": 2127.08, "end": 2142.2, "text": "Switch. Da steht ein Mikro Tick. Mikro Tick Switch CSS 6108G2S Plus IN. Also zwei, man"}, {"id": 227, "start": 2142.2, "end": 2148.08, "text": "sieht es hier unten, zwei SFP Plus Ports 10G und acht Gigabit Ports hat das Ding. Das"}, {"id": 228, "start": 2148.08, "end": 2156.12, "text": "ist optimal hier für so meine Bastel, für meine Bastel Ecke. Da kann man alles anschließen,"}, {"id": 229, "start": 2156.12, "end": 2163.0, "text": "was man so braucht. So, schließen wir den Raspberry Pi erstmal an. Ich glaube ich habe"}, {"id": 230, "start": 2163.0, "end": 2169.56, "text": "irgendwo Kabels dafür. Übrigens auch so ein Ding. China-Chinesen-Kabel. Ich habe hier"}, {"id": 231, "start": 2169.56, "end": 2175.36, "text": "von den Kabeln. Gibt es in unterschiedlichen Farben. Ich habe von diesen USB-Kabeln 50er"}, {"id": 232, "start": 2175.36, "end": 2182.32, "text": "Pack bei Aliexpress gekauft. Das ist ungefähr einen Meter lang. Hat USB-C, Mikro-USB in"}, {"id": 233, "start": 2182.32, "end": 2189.32, "text": "einem und hat weniger als ein Euro das USB-Kabel gekostet. Ich glaube 85 Cent umgerechnet das"}, {"id": 234, "start": 2189.32, "end": 2194.88, "text": "USB-Kabel. Also China kaufen, finde ich lohnt sich schon, wenn man die richtigen Sachen"}, {"id": 235, "start": 2194.88, "end": 2201.32, "text": "holt. Ich meine, jetzt kann man sich natürlich fragen, vollkommen zurecht, wozu braucht man"}, {"id": 236, "start": 2201.32, "end": 2208.96, "text": "50 USB-Kabel? Aber die Antwort ist ganz einfach. Es ist besser, man hat 50 USB-Kabel als man"}, {"id": 237, "start": 2208.96, "end": 2216.44, "text": "braucht 50 USB-Kabel. So, wenn man das jetzt verstehen konnte, wie ich das meine. Ne, weiter"}, {"id": 238, "start": 2216.44, "end": 2224.56, "text": "verkaufen nicht. Gibt es einen Link zu dem Kabel? Ich glaube, die gibt es in der Form"}, {"id": 239, "start": 2224.56, "end": 2228.88, "text": "nicht mehr. Das ist schon ein Jahr her, wo ich die gekauft habe. Ne, also ich habe nie"}, {"id": 240, "start": 2228.88, "end": 2238.88, "text": "wieder USB-Kabel-Probleme. Ich mache bald Wish-Champ mache ich auf. Da kann man direkt"}, {"id": 241, "start": 2238.88, "end": 2244.48, "text": "dropshippen. Da kann man sich auf Knopfdruck seinen Dropshipping-Shop erstellen. Der Wish-Champ."}, {"id": 242, "start": 2244.48, "end": 2251.44, "text": "So, machen wir mal den Raspberry Pi an. Ich kann es mir immer nicht merken, was ist Strom,"}, {"id": 243, "start": 2251.44, "end": 2257.92, "text": "hinten oder vorne? Ach ne, gibt es ja mittlerweile nur noch einen. So, der Raspberry Pi ist an,"}, {"id": 244, "start": 2257.92, "end": 2264.08, "text": "hier guck da, es bootet. Jetzt müssen wir uns mal drauf einloggen und gucken, ob alles"}, {"id": 245, "start": 2264.08, "end": 2284.32, "text": "läuft. Zack, Firefox aufmachen. Frage? Echt? Wo? Wish-Champ ist schon weg? Was? Wie,"}, {"id": 246, "start": 2284.32, "end": 2297.08, "text": "Wish-Champ, was soll das? Gebated. Ne, ich würde das auch garantiert nicht Wish-Champ"}, {"id": 247, "start": 2297.08, "end": 2310.28, "text": "nennen. Wenn ich das nämlich Wish-Champ nenne, dann verklagt mich Wish wahrscheinlich. Okay,"}, {"id": 248, "start": 2310.28, "end": 2315.96, "text": "Mini-USB ist tatsächlich selten. Es gibt nur noch genau ein Gerät, das Mini-USB hat,"}, {"id": 249, "start": 2315.96, "end": 2343.68, "text": "das ist mein Mikrofon. So, also Pi, et, tja, ist es der? Hey, sicher, dass es der ist? Hm,"}, {"id": 250, "start": 2343.68, "end": 2354.0, "text": "der wird es wahrscheinlich sein. Kann man sich, kann man irgendwie checken, ob das ein"}, {"id": 251, "start": 2354.0, "end": 2374.88, "text": "Raspberry Pi 4 ist? Gibt es irgendwas für die Pi-Info oder sowas? Check, if Pi ist 4."}, {"id": 252, "start": 2374.88, "end": 2377.64, "text": "Gibt es irgendwie sowas? Ah, guck mal hier. Aha! Bam! Stack Overflow, einfach Beste."}, {"id": 253, "start": 2377.64, "end": 2386.36, "text": "In dem Fall war es sogar Stack Exchange. Stack Overflow. Ich sag's ja immer wieder. Man muss"}, {"id": 254, "start": 2386.36, "end": 2390.96, "text": "die Sache nicht wissen, man muss einfach nur wissen, was man suchen muss. Was, in Hardtop"}, {"id": 255, "start": 2390.96, "end": 2399.6, "text": "steht das drin? Ach, du meinst Anzahl der Kerne oder, ne, hä? Wie soll man das in Hardtop"}, {"id": 256, "start": 2399.6, "end": 2412.16, "text": "erkennen? Wie soll ich in Hardtop jetzt erkennen, ob das ein Pi 4 ist? Das muss man jetzt erklären."}, {"id": 257, "start": 2412.16, "end": 2430.12, "text": "Jaja, Uptime, ganz genau. Uptime ist eindeutig, da erkenne ich sofort, ob es ein Raspberry"}, {"id": 258, "start": 2430.12, "end": 2434.56, "text": "Pi 4 ist. Ach, du meinst über die, ja gut, stimmt, das könnte ich auch gucken. Wir haben"}, {"id": 259, "start": 2434.56, "end": 2438.44, "text": "4 Gigabyte, das muss ein Raspberry Pi 4 sein, das stimmt. Aber mal im Ernst, das ist doch"}, {"id": 260, "start": 2438.44, "end": 2452.56, "text": "die deutlich schönere Variante hier, oder? Der sagt's dir ja direkt. So, wo haben wir"}, {"id": 261, "start": 2452.56, "end": 2458.12, "text": "denn unser, wo haben wir denn unser, ähm, haben wir hier überhaupt das Repo schon drauf"}, {"id": 262, "start": 2458.12, "end": 2466.96, "text": "ausgecheckt? Ja, hier ist Tuya Convert. Genau, also wir brauchen einen Raspberry Pi und dann"}, {"id": 263, "start": 2466.96, "end": 2474.84, "text": "muss man sich auf GitHub das hier auschecken. Habt ihr das mit, ne, hab ich da oben schon"}, {"id": 264, "start": 2474.84, "end": 2480.52, "text": "gemacht, hier, guck da. Ne, ne. Du kannst jetzt vielleicht hieran, ne, aber selbst da"}, {"id": 265, "start": 2480.52, "end": 2487.36, "text": "kannst du dir das nicht wirklich dran ableiten. Das musst du dir auschecken von GitHub und"}, {"id": 266, "start": 2487.36, "end": 2493.88, "text": "damit kann man, äh, konnte man ziemlich viele China-Chinesen-Geräte flashen. Over the"}, {"id": 267, "start": 2493.88, "end": 2509.32, "text": "Air, also sprich hier, einfach übers WLAN. Das Problem ist nur, die meisten China-Geräte"}, {"id": 268, "start": 2509.32, "end": 2524.56, "text": "gehen nicht mehr. Ja, das sagt. Gut, dann probieren wir das mal aus. Achso, ich muss"}, {"id": 269, "start": 2524.56, "end": 2531.44, "text": "den Access-Point noch kurz starten. Super, super schmoll Access-Point. Äh, MikroTik,"}, {"id": 270, "start": 2531.44, "end": 2537.4, "text": "wo ist er denn hier, da. Muss ich mal kurz, kurz einschalten, weil wir brauchen ja einen"}, {"id": 271, "start": 2537.4, "end": 2546.4, "text": "Access-Point, wo wir das dann anmelden, wenn Custom Firmware drauf ist. Der wird übrigens"}, {"id": 272, "start": 2546.4, "end": 2556.32, "text": "per, jetzt mal kurz weg, der wird übrigens per Mikro-USB versorgt. Ich kann es nicht"}, {"id": 273, "start": 2556.32, "end": 2562.4, "text": "oft genug sagen, der Access-Point ist mega nice für so, für so Bastelgeschichten. Das"}, {"id": 274, "start": 2562.4, "end": 2567.84, "text": "ist ein Access-Point mit vollwertigem Router-OS drauf, für, also MikroTik-Router-OS für"}, {"id": 275, "start": 2567.84, "end": 2574.12, "text": "25 Euro. Kann zwar nur 2,4 Gigahertz, aber für so Bastelkram ist das optimal, das Teil."}, {"id": 276, "start": 2574.12, "end": 2579.72, "text": "So, der sollte jetzt starten. Ich weiß nicht, ob man die Lichter sieht, dass der da, dass"}, {"id": 277, "start": 2579.72, "end": 2585.68, "text": "der an ist. Er ist sicherlich genug. Ich glaube, das erkennt man nicht. Äh, auch PoE. Ich"}, {"id": 278, "start": 2585.68, "end": 2594.28, "text": "glaub auch PoE, ja. Ich glaub auch PoE. Ja. Allerdings, ähm, der Switch kann kein PoE,"}, {"id": 279, "start": 2594.28, "end": 2599.32, "text": "deswegen kann ich da kein PoE machen. Ja, also der ist richtig, der ist richtig pock."}, {"id": 280, "start": 2599.32, "end": 2603.36, "text": "Das ist jetzt kein Access-Point, wo ich mein Haus mit versorgen würde oder so, aber für"}, {"id": 281, "start": 2603.36, "end": 2616.24, "text": "so Basteldinger ist das wirklich massive nice. So, irgendwann sollte eigentlich der Access-Point"}, {"id": 282, "start": 2616.24, "end": 2639.68, "text": "an Start kommen. Root, Add. Ah, Moment. Es ist 137, nicht 127, kann das sein? Lull. Ja,"}, {"id": 283, "start": 2639.68, "end": 2659.04, "text": "es ist auch das Richtige. 137 ist es. Na gut. Alles klar. So, Access-Point ist da. IP, DHCP-Server,"}, {"id": 284, "start": 2659.04, "end": 2666.28, "text": "Leases. So, hier ist, guck mal, hier ist das alte TAS Motorzeuger. Das ist Chibate. Der"}, {"id": 285, "start": 2666.28, "end": 2672.92, "text": "ist garantiert nicht an. Der alte Debon-Mini. Den hab ich gegrillt. Der kann definitiv nicht"}, {"id": 286, "start": 2672.92, "end": 2680.12, "text": "mehr an sein. Das expired und wird sich auch nie wieder was abholen. So, hier taucht dann"}, {"id": 287, "start": 2680.12, "end": 2684.6, "text": "unsere custom-geflechte Steckdosenleiste im DHCP-Server auf. Kommen wir gucken, was für"}, {"id": 288, "start": 2684.6, "end": 2690.08, "text": "eine IP gekriegt hat. Aber jetzt gehen wir mal auf unseren Raspberry Pi. Ne, vorher,"}, {"id": 289, "start": 2690.08, "end": 2695.04, "text": "wir packen erstmal die Steckdosenleiste aus, würde ich sagen. Hast du die ganzen IOT-Geräte"}, {"id": 290, "start": 2695.04, "end": 2700.12, "text": "in einem Subnetz oder so drinne? Zum größten Teil. Also, ich hab zwei WLANs. Ich hab einen"}, {"id": 291, "start": 2700.12, "end": 2713.64, "text": "China-Chinesen-IOT-WLAN. Auch mit Client-Isolation. Isolierung. Abgeschottet, also sprich, dass"}, {"id": 292, "start": 2713.64, "end": 2721.68, "text": "die Clients nicht miteinander reden können. In einem extra WLAN drinne, wo auch kein"}, {"id": 293, "start": 2721.68, "end": 2727.36, "text": "Internetzugriff erlaubt ist und ich glaube Firewall-Technisch ist das einzige, was erlaubt"}, {"id": 294, "start": 2727.36, "end": 2739.8, "text": "ist NTP auf den Router und MQTT zu einem Proker. Ansonsten ist nichts erlaubt im China-IOT-WLAN."}, {"id": 295, "start": 2739.8, "end": 2750.48, "text": "Dann hab ich auch ein normales WLAN für Handy, Tablets und sonst was. Noch einen Bastel-WLAN"}, {"id": 296, "start": 2750.48, "end": 2762.2, "text": "für Sachen wie hier. Und ein internes Netz und... jo. Das war's im Großen und Ganzen."}, {"id": 297, "start": 2762.2, "end": 2781.8, "text": "Das ist natürlich blöd, Helmo. Da fällt mir eigentlich bloß ein, WLAN-Geräte näher zusammenrücken."}, {"id": 298, "start": 2781.8, "end": 2788.0, "text": "Man kann ja beispielsweise das eine WLAN-Gerät direkt an die eine Wand und das dann auf der"}, {"id": 299, "start": 2788.0, "end": 2794.84, "text": "anderen Seite direkt an die andere Wand und von dort dann weiter per Kabel oder so. Aber"}, {"id": 300, "start": 2794.84, "end": 2810.44, "text": "ansonsten. Oftmals ist halt auch was die Leute dann haben, so richtig alter Schrott. Z-C-H-R-I-E-S-R-I."}, {"id": 301, "start": 2810.44, "end": 2818.32, "text": "Danke für den Zap. Wenn ihr jetzt noch ein Essen nehmt, dann wisst ihr euch, dass es"}, {"id": 302, "start": 2818.32, "end": 2836.92, "text": "Chris heißen soll. Aber ist ja nicht. Ja, würde ich auch so machen. Also unabhängig"}, {"id": 303, "start": 2836.92, "end": 2843.84, "text": "davon ob es China-Chinesen-Zeug ist. Das bietet sich einfach an. Was ich ja geil finden würde,"}, {"id": 304, "start": 2843.84, "end": 2852.36, "text": "wenn irgendjemand mal WPA Enterprise baut, so dass die Geräte, dass die Clients es nicht"}, {"id": 305, "start": 2852.36, "end": 2858.52, "text": "unterstützen müssen. Das ist ja WPA Enterprise, ist ja quasi der WLAN-Standard, wo man für"}, {"id": 306, "start": 2858.52, "end": 2864.52, "text": "Authentifizierung einzelne User-Accounts anlegen kann. So kann man jedem Endgerät ein extra"}, {"id": 307, "start": 2864.52, "end": 2873.52, "text": "User und Passwort geben. Das wäre unglaublich praktisch für ein IoT-Netzwerk. Weil dann"}, {"id": 308, "start": 2873.52, "end": 2879.36, "text": "könnte man jedem Gerät eigenen Usernamen Passwort geben oder eigenes Passwort und könnte"}, {"id": 309, "start": 2879.36, "end": 2885.08, "text": "das wegschmeißen und das Gerät einfach löschen. Und gut wärs. Aktuell muss man ja theoretisch"}, {"id": 310, "start": 2885.08, "end": 2889.64, "text": "IoT-Geräte, um es mal übertrieben zu sagen, einschmelzen oder schreddern, bevor man sie"}, {"id": 311, "start": 2889.64, "end": 2896.12, "text": "wegwirft, weil dein WLAN-Passwort halt überall steht, in den Geräten. Deswegen mach ich"}, {"id": 312, "start": 2896.12, "end": 2901.08, "text": "es aktuell ganz einfach. Ich schmeiß IoT-Geräte einfach nicht weg. Ich hab einfach einen Sack"}, {"id": 313, "start": 2901.08, "end": 2904.84, "text": "hier stehen, mit kaputten Controllern und alles und schmeiß das halt einfach nicht"}, {"id": 314, "start": 2904.84, "end": 2908.8, "text": "weg. Irgendwann werd ich mir die einfach mal in die Tüte nehmen und schreddern lassen."}, {"id": 315, "start": 2908.8, "end": 2925.0, "text": "Okay, weiter gehts. Also es war und die Alternative ist, die Alternative ist ein WLAN-Passwort"}, {"id": 316, "start": 2925.0, "end": 2933.96, "text": "in der Weltgeschichte verteilen. Cisco WLAN-Controller Compare Device Pass Phrases bei WPA2. Wirklich,"}, {"id": 317, "start": 2933.96, "end": 2940.6, "text": "das ist cool. Und das ist dann aber auch kein WPA Enterprise. Das sieht dann für die Geräte"}, {"id": 318, "start": 2940.6, "end": 2951.68, "text": "quasi so aus, wie normales Pre-Shared Key. Das ist ja das Wichtige. Das Small Access"}, {"id": 319, "start": 2951.68, "end": 2958.04, "text": "Point, ja. Weil die ESPs können zwar theoretisch WPA Enterprise, aber nicht wirklich gut."}, {"id": 320, "start": 2958.04, "end": 2977.24, "text": "Die Cisco WLAN-Router, nee. Ease. Oh, das ist wieder Big Brain Cisco Kram. Big Brain"}, {"id": 321, "start": 2977.24, "end": 2995.88, "text": "Cisco Stels. UniFi kann er bestimmt nicht, oder? Nee, die können das wahrscheinlich"}, {"id": 322, "start": 2995.88, "end": 3008.32, "text": "nicht. Jaja, WPA Enterprise, das weiß ich. Das ist ja Schwachsinn. WPA Enterprise suckt."}, {"id": 323, "start": 3008.32, "end": 3015.84, "text": "Geht anscheinend nicht. Ja doch, das funktioniert. Das Problem ist dann, dass du ein bisschen"}, {"id": 324, "start": 3015.84, "end": 3023.48, "text": "viele WLANs hast. Also ich kenne keinen WLAN Access Point, der 40 SSIDs aufmachen kann."}, {"id": 325, "start": 3023.48, "end": 3028.58, "text": "Und außerdem ist das auch WLAN technisch nicht so sinnvoll, 40, also Funk technisch"}, {"id": 326, "start": 3028.58, "end": 3033.0, "text": "nicht so sinnvoll. Ja, das ist, also theoretisch kannst du Multi SSID machen, aber mehr als"}, {"id": 327, "start": 3033.0, "end": 3039.48, "text": "3, 4 würde ich da nicht aufmachen. Ich glaube, die UniFi Access Points können auch maximal"}, {"id": 328, "start": 3039.48, "end": 3045.88, "text": "nur 4 SSIDs. Okay, aber ich packe jetzt erstmal die Steckdosenleiste aus. Also wir gucken"}, {"id": 329, "start": 3045.88, "end": 3054.56, "text": "mal, ob das wirklich die original Krogi Steckdosenleiste ist, nur unter Hammer Rebranding. So, gucken"}, {"id": 330, "start": 3054.56, "end": 3062.48, "text": "wir mal. Also da hier aufmachen. Wo habe ich denn meinen? Ah, der Keks muss im Bild bleiben,"}, {"id": 331, "start": 3062.48, "end": 3070.12, "text": "so geht das ja nicht. So, legen wir den Raspberry Pi mal kurz hin, machen den Kram mal auf."}, {"id": 332, "start": 3070.12, "end": 3084.56, "text": "Die andere Seite. So, und jetzt schauen wir mal, ob das passt. Mods haben die Commands"}, {"id": 333, "start": 3084.56, "end": 3093.52, "text": "gepimpt. Ja, ein bisschen. So, also schauen wir mal rein. Hier, das haben wir hier. Hammer,"}, {"id": 334, "start": 3093.52, "end": 3102.04, "text": "das hat Hammer da gemacht. Also es ist schon mal besser verpackt als die Krogi Steckdosenleiste,"}, {"id": 335, "start": 3102.04, "end": 3108.96, "text": "hatte ich den Eindruck. Als hätten sie da irgendwas gemacht. Aber ich glaube, es ist"}, {"id": 336, "start": 3108.96, "end": 3117.48, "text": "trotzdem die gleiche Steckdosenleiste. Es ist exakt die gleiche Steckdosenleiste. Das"}, {"id": 337, "start": 3117.48, "end": 3123.08, "text": "stimmt mich zuversichtlich. Es ist wirklich exakt die gleiche Steckdosenleiste. Einfach"}, {"id": 338, "start": 3123.08, "end": 3130.28, "text": "China Rebrand. Ist Hammer nicht irgendwie so ein Hardware-Ding aus Bayern? Es ist die"}, {"id": 339, "start": 3130.28, "end": 3138.48, "text": "Krogi Steckdosenleiste, hier Leute, guckt mal. Es ist die gleiche. Exzellent, exzellent."}, {"id": 340, "start": 3138.48, "end": 3144.88, "text": "Nur, hier unten steht Krogi und hier steht gar nichts. Guck mal, Hammer hat noch nicht"}, {"id": 341, "start": 3144.88, "end": 3148.96, "text": "mal richtig reprinten lassen. Normalerweise würde hier unten der Hersteller stehen, aber"}, {"id": 342, "start": 3148.96, "end": 3165.44, "text": "nope. Hammer. So, mal hier aufmachen. Und dann probieren wir das Ganze mal aus. Das Hammer"}, {"id": 343, "start": 3165.44, "end": 3175.92, "text": "hat nur reprandedes Zeug. Ist mir egal in dem Fall, solange das flashbar ist. Also wenn"}, {"id": 344, "start": 3175.92, "end": 3182.72, "text": "das flashbar ist, kaufe ich mir noch 10 Stück. Also ohne Mist, man braucht Steckdosenleisten"}, {"id": 345, "start": 3182.72, "end": 3187.24, "text": "braucht man immer. Und ich habe 3 Stück, die geflasht sind, aber die habe ich schon alle"}, {"id": 346, "start": 3187.24, "end": 3192.24, "text": "im Einsatz. Und man kann einfach nicht genug Steckdosenleisten haben. Und es gibt immer"}, {"id": 347, "start": 3192.24, "end": 3197.44, "text": "weniger, die sich flashen lassen. Ich kaufe mir, wie gesagt, wenn das wirklich flashbar"}, {"id": 348, "start": 3197.44, "end": 3204.4, "text": "ist, kaufe ich mir gleich noch 10 Stück. Easy. Gut, also Steckdosenleiste am Start."}, {"id": 349, "start": 3204.4, "end": 3211.76, "text": "Packen wir mal hier raus. Noch nicht gleich anschließen, Leute, weil es kann sein, dass"}, {"id": 350, "start": 3211.76, "end": 3216.56, "text": "die Dinger instant in den pairing-Modus gehen. Das will man nicht. Und im Zweifelsfall muss"}, {"id": 351, "start": 3216.56, "end": 3221.24, "text": "man sie ausstecken und wieder anstecken. Ja, das geht auch. Man will die erst im pairing-Modus"}, {"id": 352, "start": 3221.24, "end": 3234.76, "text": "haben, wenn man seinen Raspberry Pi anhat. Mir fällt gerade auf, das ist blöd, wie ich"}, {"id": 353, "start": 3234.76, "end": 3247.88, "text": "das mache. Ich muss das hier mal schließen. Firefox und hier aufmachen. Dann in Window-Modus"}, {"id": 354, "start": 3247.88, "end": 3261.24, "text": "schalten. Controls ausblenden. Sticky machen. Ah, so ist das doch gut. Jetzt kann man nämlich"}, {"id": 355, "start": 3261.24, "end": 3271.72, "text": "den Raspberry Pi sich angucken. Und wir haben noch nebenbei die Steckdosenleiste. Oh, slacked."}, {"id": 356, "start": 3271.72, "end": 3280.84, "text": "Massive-Lack, Alter. Poggers-Lack. Weniger Poggers-Lack. Paints-Champ-Lack. Na, jetzt"}, {"id": 357, "start": 3280.84, "end": 3290.2, "text": "geht's. Ja, ja, ist okay. Alles klar. Sind die einzelnen Dosen in der Leiste schaltbar?"}, {"id": 358, "start": 3290.2, "end": 3295.64, "text": "Ja. Deswegen, das ist ja das Geile da dran. Das ist quasi eine IP-Steckdosenleiste für"}, {"id": 359, "start": 3295.64, "end": 3305.4, "text": "30 oder 35 Euro. Richtiges Picture-in-Picture ist aber doof. Das kann man nicht resize-en."}, {"id": 360, "start": 3305.4, "end": 3314.72, "text": "Das hier kann man resize-en. So. Also, gehen wir hier rein. Oh, ich brauche eine Tablet."}, {"id": 361, "start": 3314.72, "end": 3343.04, "text": "Ich muss mal ins Bart mal ein iPad holen. Also, wunderbar. Weil man muss immer, wenn"}, {"id": 362, "start": 3343.04, "end": 3352.12, "text": "man das startet, ein Tablet in das WLAN packen. iPad als Klo-Zeitung. Ja. Ich habe das oft"}, {"id": 363, "start": 3352.12, "end": 3356.88, "text": "im Bart liegen tagsüber. Wenn ich aufs Klo gehe, kann ich dort Browser aufmachen oder"}, {"id": 364, "start": 3356.88, "end": 3361.88, "text": "YouTube aufmachen oder irgendwas. Bin ja mittlerweile schon so medienabhängig, ich kann nicht mal"}, {"id": 365, "start": 3361.88, "end": 3366.28, "text": "kacken ohne YouTube zu gucken. Weiß ich, hat einer noch das Problem? Ich konnte, also"}, {"id": 366, "start": 3366.28, "end": 3371.88, "text": "jetzt mal ohne Mist, ne? Ich konnte früher mich abends ins Bett legen, habe die Augen"}, {"id": 367, "start": 3371.88, "end": 3380.4, "text": "zugemacht, Bett ge- und habe einfach gepennt. Das geht jetzt nicht mehr. Ich muss jetzt"}, {"id": 368, "start": 3380.4, "end": 3384.8, "text": "ins Bett und dann entweder auf dem Tablet oder auf dem Handy noch irgendeinen Stream anmachen."}, {"id": 369, "start": 3384.8, "end": 3393.6, "text": "Und ich penne allein, wenn der Stream läuft. Das ist kein Problem. Ich kann aber nicht"}, {"id": 370, "start": 3393.6, "end": 3402.6, "text": "mal schlafen ohne Handy oder Tablet. Richtig hängen geblieben. Ohne Mist, ich bin früher"}, {"id": 371, "start": 3402.6, "end": 3408.84, "text": "ins Bett. Ich meine, wie gesagt, ich bin 1984 geboren. Ich habe alles mitbekommen. Ich habe"}, {"id": 372, "start": 3408.84, "end": 3415.92, "text": "quasi die Pre-, also ich habe noch so richtig vor Mainstream PC mitbekommen, vor Mainstream"}, {"id": 373, "start": 3415.92, "end": 3421.52, "text": "Internet. Dann habe ich Mainstream PC, Mainstream Internet, vor Smartphone und nach Smartphone."}, {"id": 374, "start": 3421.52, "end": 3426.92, "text": "Also ich habe quasi so mehr oder weniger alle wichtigen Technologieabschnitte so mitgemacht"}, {"id": 375, "start": 3426.92, "end": 3432.04, "text": "noch. Und ich konnte mich wirklich früher einfach ins Bett legen, habe gesagt, okay,"}, {"id": 376, "start": 3432.04, "end": 3435.8, "text": "ich mache jetzt Augen zu. Dann fängt man an, sich irgendwie über komische Dinge noch"}, {"id": 377, "start": 3435.8, "end": 3444.0, "text": "nachzudenken oder so. Und dann schläft man ein. Und mittlerweile kann ich nicht mehr pennen"}, {"id": 378, "start": 3444.0, "end": 3452.16, "text": "ohne Handy am Start. So, also, was man jetzt machen muss ist, sich dieses Repo hier klonen,"}, {"id": 379, "start": 3452.16, "end": 3457.4, "text": "was ich schon gemacht habe. Also wie gesagt, hier das da. Nee, nee, tu ja Convert, klonen."}, {"id": 380, "start": 3457.4, "end": 3461.44, "text": "Das klont man sich. Das haben wir gemacht. Das ist gar kein Ding. Und dann geht man einfach"}, {"id": 381, "start": 3461.44, "end": 3466.4, "text": "da rein und sagt Start, Start, Flash. So, dann fragt er mich, ob ich noch irgendwelche"}, {"id": 382, "start": 3466.4, "end": 3476.2, "text": "Dinger stoppen will. Ja, will ich. Ja, ist okay. Yes. So. Und dann sagt er mir, ich muss"}, {"id": 383, "start": 3476.2, "end": 3482.44, "text": "jetzt ein Gerät, was nicht die Steckdosenleiste ist, ins WLAN packen. Sonst funktioniert"}, {"id": 384, "start": 3482.44, "end": 3489.48, "text": "das Ganze nicht. Ihr guckt. This step is important. Blah, blah, blah. Connect any other device"}, {"id": 385, "start": 3489.48, "end": 3496.52, "text": "to the Wi-Fi. We trust Flash. Das heißt auch wirklich so. We trust Flash. Das mache ich"}, {"id": 386, "start": 3496.52, "end": 3506.36, "text": "jetzt mal ohne, dass ihr das sehen könnt, weil. Will die WLANs hier nicht leaken? WLANs."}, {"id": 387, "start": 3506.36, "end": 3516.08, "text": "We trust Flash. Warum hast du kein ESP als Dummiklein? Das ist eine gute Idee. War gar"}, {"id": 388, "start": 3516.08, "end": 3521.44, "text": "nicht dran gedacht. So, dann sieht das so aus mit dem iPhone. Guckt mit dem iPad. Guckt"}, {"id": 389, "start": 3521.44, "end": 3530.84, "text": "hier. Connected. Connected. We trust. Das müsst ihr eigentlich gar nichts machen. Einfach"}, {"id": 390, "start": 3530.84, "end": 3538.76, "text": "nur einfach nur eingeloggt lassen. So. Put your IoT device in Autokonfig. Das machen"}, {"id": 391, "start": 3538.76, "end": 3543.2, "text": "wir jetzt. Müssen wir noch mal gucken, wie wir das in Autokonfig kriegen. Oftmals ist"}, {"id": 392, "start": 3543.2, "end": 3548.56, "text": "es so, es reicht. Wenn man das einfach einschaltet, dann gehen die automatisch in Autokonfig."}, {"id": 393, "start": 3548.56, "end": 3554.04, "text": "Und wenn nicht, dann muss man den Knopf einfach ein paar Sekunden halten. Meistens zumindest."}, {"id": 394, "start": 3554.04, "end": 3572.04, "text": "So. Macht das was? Es schaltet sich an und aus. Okay, da muss ich es wahrscheinlich"}, {"id": 395, "start": 3572.04, "end": 3578.0, "text": "einfach gedrückt halten. Also Ziel sollte sein, man erkennt es nicht richtig, dass das"}, {"id": 396, "start": 3578.0, "end": 3605.92, "text": "Grün blinkt. Das ist so, man erkennt das gar nicht richtig. Okay, es blinkt. Es blinkt."}, {"id": 397, "start": 3605.92, "end": 3635.08, "text": "Huh? Bosschamp? Bosschamp? Muss ich den Stecker nicht rausziehen?"}, {"id": 398, "start": 3635.08, "end": 3640.68, "text": "Es macht noch überhaupt nichts. Ich fürchte, die Firmware ist zu neu. Ich fürchte, die"}, {"id": 399, "start": 3640.68, "end": 3645.6, "text": "Firmware ist zu neu, weil der blinkt nicht mehr. Ich glaube, die Firmware ist zu neu."}, {"id": 400, "start": 3645.6, "end": 3656.0, "text": "Scheiße. Mach einfach mal an und aus. Ja, kann ich gleich machen. Wir können das kaputt"}, {"id": 401, "start": 3656.0, "end": 3665.56, "text": "geht es nicht. Kaputt geht es nicht. War bei mir auch so komisch. Okay, ich mach das mal."}, {"id": 402, "start": 3665.56, "end": 3678.48, "text": "Mal gucken, was jetzt passiert. Ich lasse den erstmal machen. Er hat geplinkt. Aha,"}, {"id": 403, "start": 3678.48, "end": 3696.2, "text": "es funktioniert. Doch. Die ist noch flashbar. Okay, Zehner Bestellung ist raus. Zehner Bestellung"}, {"id": 404, "start": 3696.2, "end": 3702.28, "text": "ist direkt raus. Flash, Tasmota. Jetzt muss man auswählen, was man flashen will. Wir wollen"}, {"id": 405, "start": 3702.28, "end": 3712.12, "text": "natürlich Tasmota flashen. Sind wir Schnur, dass wir flashen wollen? Ja, wollen wir Tasmota"}, {"id": 406, "start": 3712.12, "end": 3727.72, "text": "flashen? Erstmal 300 Euro investiert. Stimmt eigentlich. Richtig viel Kohle. No. Gut,"}, {"id": 407, "start": 3727.72, "end": 3739.16, "text": "und jetzt gehen wir in die WLAN-Settings und verbinden uns mit der Steckdose. Tasmota."}, {"id": 408, "start": 3739.16, "end": 3753.6, "text": "Ja. So, jetzt sind wir mit der Steckdose verbunden. Ich zeig's euch gleich. Guck hier. Dann lockt"}, {"id": 409, "start": 3753.6, "end": 3758.68, "text": "man sich, die Steckdose macht dann, ich mach mal groß, die Steckdose macht dann ein Access"}, {"id": 410, "start": 3758.68, "end": 3765.48, "text": "Point auf. Und da verbindet man sich drauf. Ich sollte vielleicht mal den Paus-Champ wegmachen,"}, {"id": 411, "start": 3765.48, "end": 3772.28, "text": "das Emote ist ein bisschen zu Pain's Champ. Ja, dann lockt man sich ein auf dem Access"}, {"id": 412, "start": 3772.28, "end": 3779.88, "text": "Point von der Steckdosenleiste und gibt dann sein Access Point-Gedöns ein, was man haben"}, {"id": 413, "start": 3779.88, "end": 3796.72, "text": "will. Das mach ich jetzt mal kurz. Ohne, ohne dass ich euch zugucken lasse. Omi, ich hab"}, {"id": 414, "start": 3796.72, "end": 3801.72, "text": "mich vertippt, fuck. Das ist übrigens, da muss man aufpassen, wenn man sich vertippt."}, {"id": 415, "start": 3801.72, "end": 3813.72, "text": "Je nach Device kann's sein, dass man es nicht mehr zurücksetzen kann. Okay. Passwort gespeichert,"}, {"id": 416, "start": 3813.72, "end": 3818.2, "text": "es restartet sich und jetzt gucken wir auf unseren Access Point, ob's auftaucht. Access"}, {"id": 417, "start": 3818.2, "end": 3836.88, "text": "Point. Das sieht gut aus, guck mal da. Bäm. Da ist sie. Da ist sie, unsere Steckdosenleiste."}, {"id": 418, "start": 3836.88, "end": 3840.68, "text": "Die Steckdose ist jetzt noch nicht richtig eingestellt. Aktuell sieht es so aus, als"}, {"id": 419, "start": 3840.68, "end": 3850.92, "text": "wäre das nur ein, als wäre das nur ein, ein Schalter. Das ist ja falsch. Das müssen"}, {"id": 420, "start": 3850.92, "end": 3857.72, "text": "fünf Schalter sein. Das sind fünf Schalter, weil, Moment. Hier ist das iPad weg. Es sind"}, {"id": 421, "start": 3857.72, "end": 3866.16, "text": "ja fünf Schalter, weil 1, 2, 3, 4 und USB. Und USB sind fünf Schalter. Das heißt wir"}, {"id": 422, "start": 3866.16, "end": 3871.56, "text": "brauchen jetzt noch das passende Template dafür. So und damit wir das jetzt auch richtig"}, {"id": 423, "start": 3871.56, "end": 3878.12, "text": "schön, damit wir das jetzt richtig schön machen können, schalte ich jetzt erstmal"}, {"id": 424, "start": 3878.12, "end": 3883.44, "text": "meine Home Assistant VM ein. Da können wir das richtig mal einrichten, so wie man das"}, {"id": 425, "start": 3883.44, "end": 3892.84, "text": "machen würde. Home Assistant VM einschalten. Nur mal so exemplarisch jetzt. Also das erste,"}, {"id": 426, "start": 3892.84, "end": 3897.36, "text": "was wir hier jetzt machen, ist erstmal uns ein richtiges Template raussuchen. Ich schiebe"}, {"id": 427, "start": 3897.36, "end": 3903.28, "text": "das mal kurz ein bisschen weiter weg. Also wir brauchen ein Template dafür. Da gibt"}, {"id": 428, "start": 3903.28, "end": 3908.44, "text": "es so eine, da gibt es eine schöne Seite, Pontus Motor. Da kann, wie packt man HA in"}, {"id": 429, "start": 3908.44, "end": 3913.32, "text": "eine VM? Einfach das offizielle VM-Template nehmen. Es gibt so eine, es gibt so eine schöne"}, {"id": 430, "start": 3913.32, "end": 3926.04, "text": "Seite. Da haben ja Community Leute Geräte zusammengetragen, die es so gibt. Und in"}, {"id": 431, "start": 3926.04, "end": 3930.88, "text": "dem Fall ist ESP Home aber doof. Du willst ja nichts selbst machen, du willst einfach"}, {"id": 432, "start": 3930.88, "end": 3937.64, "text": "fix und fertig haben. So, guck mal unter Plugs und Sensors, ob es da einen Hammer gibt. Oh,"}, {"id": 433, "start": 3937.64, "end": 3955.48, "text": "das sieht schon mal gut aus. Hammer. Hammer. Da war es doch, guck mal. Hammer. PRC4USBpowerstrip,"}, {"id": 434, "start": 3955.48, "end": 3967.68, "text": "hier ist das Template. Gut. Gehen wir hier hin. Configuration. Config Template. Äh nicht"}, {"id": 435, "start": 3967.68, "end": 3971.28, "text": "stimmt überhaupt nicht. Config Other. Und dann schmeißen wir das Template hier rein."}, {"id": 436, "start": 3971.28, "end": 3978.08, "text": "Sagen Activate und Save. Dann Restartet es neu und wenn es jetzt Restartet ist, dann"}, {"id": 437, "start": 3978.08, "end": 3989.4, "text": "blinkt es vielleicht. Müssen wir mal gucken. Und jetzt seht ihr. Äh was ist denn das? Sollte"}, {"id": 438, "start": 3989.4, "end": 3993.48, "text": "das nicht eigentlich. Es sollte eigentlich 4 Knöpfe haben. Es hat irgendwie rumgepackt."}, {"id": 439, "start": 3993.48, "end": 4010.04, "text": "Sonst hat man 4 Knöpfe. Guckt. Na super, man erkennt das jetzt hier nicht. Ach guck mal,"}, {"id": 440, "start": 4010.04, "end": 4017.44, "text": "das ist. Das Gehäuse von dieser Hammerleiste ist mega fail. Du hast hier normalerweise"}, {"id": 441, "start": 4017.44, "end": 4021.24, "text": "ein Licht daneben. Ich weiß gar nicht ob man das überhaupt erkennt. Da wo mein Mauszeige"}, {"id": 442, "start": 4021.24, "end": 4026.44, "text": "ist, ist ungefähr ein Licht normalerweise. Das erkennt man überhaupt nicht. Also das"}, {"id": 443, "start": 4026.44, "end": 4032.6, "text": "Licht kommt da nicht richtig durch. Ich mach mal kurz die Lampe aus, dann erkennt man es"}, {"id": 444, "start": 4032.6, "end": 4037.76, "text": "vielleicht besser. Die USB Socket sind auch schaltbar, aber nur alle zusammen, nicht"}, {"id": 445, "start": 4037.76, "end": 4052.32, "text": "einzeln. Das wäre zu geil, wenn das einzeln schaltbar wäre. Ja jetzt erkennt man es. Guckt."}, {"id": 446, "start": 4052.32, "end": 4071.08, "text": "Seht ihr. Das ist relativ schnell. Es ist nur ein minimaler Lack. Also. Da kannst du dich"}, {"id": 447, "start": 4071.08, "end": 4079.36, "text": "echt nicht beschweren. Das ist mehr oder weniger so realtime. Komm mal kurz hier hin. Guckt"}, {"id": 448, "start": 4079.36, "end": 4084.08, "text": "USB kann ich auch schalten. Ach so ja, ob ich USB schalten kann, das kann ich sehen."}, {"id": 449, "start": 4084.08, "end": 4088.44, "text": "Das seht ihr jetzt ja so gar nicht. Das müsste ich, ja wenn ich wüsste wo ich das Teil hin"}, {"id": 450, "start": 4088.44, "end": 4095.8, "text": "habe. Ich hab doch so ein USB. So ein PogChamp USB Tester. Da bin ich mir aber nicht sicher"}, {"id": 451, "start": 4095.8, "end": 4104.36, "text": "wo ich den hingeschmissen hab. Kann man nämlich testen, was, ob die USB Anschlüsse richtig"}, {"id": 452, "start": 4104.36, "end": 4113.36, "text": "funktionieren. Ok den hab ich irgendwo hier reingeschmissen. Ich hab legit keine Ahnung"}, {"id": 453, "start": 4113.36, "end": 4121.68, "text": "mehr wohin. Ach hier ist er. Guckt mal. So jetzt ist USB aus. Jetzt machen wir das Ding"}, {"id": 454, "start": 4121.68, "end": 4137.2, "text": "hier mal rein. Müsste man jetzt eigentlich sehen. So. Jetzt machen wir USB mal an. Jetzt"}, {"id": 455, "start": 4137.2, "end": 4155.04, "text": "haben wir hier. Ups. Jetzt haben wir hier 5,16 Volt am USB Anschluss. Nice. Ja dann sieht"}, {"id": 456, "start": 4155.04, "end": 4161.28, "text": "man also das Schalten funktioniert wirklich. Kann man sich eigentlich nicht beschweren."}, {"id": 457, "start": 4161.28, "end": 4169.84, "text": "Machen wir wieder aus. Zack. USB braucht man schon ein bisschen bis es ausgeht. Das liegt"}, {"id": 458, "start": 4169.84, "end": 4175.08, "text": "aber an den Geräten weil die nicht so viel verbrauchen. So jetzt mach ich mal das Licht"}, {"id": 459, "start": 4175.08, "end": 4191.2, "text": "wieder an. Was? Ich glaube ich hab an meinem Keylight gewackelt. Das geht jetzt nicht mehr"}, {"id": 460, "start": 4191.2, "end": 4199.68, "text": "an. Ringlight. Das ist schlecht. Zack. Hab ich den da jetzt gemacht. Ringlight. Come"}, {"id": 461, "start": 4199.68, "end": 4215.56, "text": "on. Lass dich nicht so bitten. Geh einfach wieder an. Schauen wir mal. Geht hoffentlich"}, {"id": 462, "start": 4215.56, "end": 4229.32, "text": "gleich wieder. So. So bis das Ringlight sich jetzt einkriegt. Achso wir können ein Firmware"}, {"id": 463, "start": 4229.32, "end": 4233.08, "text": "Update machen gerade. Ja. Wir können noch mal schnell ein Firmware Update machen weil"}, {"id": 464, "start": 4233.08, "end": 4238.72, "text": "es gibt ja ein neues TASMOTA. Aber ihr seht es funktioniert alles. Und das ist halt echt"}, {"id": 465, "start": 4238.72, "end": 4244.32, "text": "nice. Sowas gibt es normalerweise nur für deutlich mehr Geld als IP Steckdosen leisten"}, {"id": 466, "start": 4244.32, "end": 4250.88, "text": "oder eben halt als China Dinger wo man selbst keine Kontrolle mehr drüber hat. Das ist"}, {"id": 467, "start": 4250.88, "end": 4256.96, "text": "halt wirklich richtig nice. Dass man da noch was Flashbares gefunden hat. Ich gehe mal"}, {"id": 468, "start": 4256.96, "end": 4263.56, "text": "davon aus das Hammer einfach die uralten Restbestände irgendwo gekauft hat und da waren halt noch"}, {"id": 469, "start": 4263.56, "end": 4275.48, "text": "alte Flashbare dabei. Wie lang ist das Kabel? 2 Meter würde ich sagen. Ja 2 Meter. Ist die"}, {"id": 470, "start": 4275.48, "end": 4281.28, "text": "Leiste schon kaputt? Nee funktioniert alles. Guck kann man alles schalten. Ich warte jetzt"}, {"id": 471, "start": 4281.28, "end": 4284.6, "text": "bis mein Ringlight wieder funktioniert. Das sollte sich jetzt eigentlich mal wieder einkriegen"}, {"id": 472, "start": 4284.6, "end": 4294.6, "text": "bald. Hoffentlich mal. Oder auch nicht. Anscheinend nicht. Ist Hammer besser als die China Dinger?"}, {"id": 473, "start": 4294.6, "end": 4302.72, "text": "Das sind China Dinger. Das ist ein reprandedes China Ding. Das ist exakt die gleiche China"}, {"id": 474, "start": 4302.72, "end": 4308.2, "text": "Leiste die ich mir vor einem halben Jahr schon gekauft habe. Nur das Hammer das jetzt resellt."}, {"id": 475, "start": 4308.2, "end": 4316.44, "text": "Warum geht denn mein Keylight nicht an? Warum geht denn das Ringlight jetzt nicht an? Wo"}, {"id": 476, "start": 4316.44, "end": 4324.56, "text": "ist denn das Problem? Musst du mich verarschen alter Lan? Warum geht das nicht an? Wallah!"}, {"id": 477, "start": 4324.56, "end": 4336.12, "text": "Zeig mal her. Ich mach das mal raus. Was hat das Keylight denn für Probleme? Oh. Stopp."}, {"id": 478, "start": 4336.12, "end": 4345.36, "text": "Mal gucken ob es jetzt angeht. Ich hab das jetzt noch mal umgestapselt. Wenn ich müssen"}, {"id": 479, "start": 4345.36, "end": 4353.0, "text": "mal kurz ohne. Ah Leute ich kann doch jetzt. Ah Big Brain Time. Ich hab doch jetzt hier"}, {"id": 480, "start": 4353.0, "end": 4362.72, "text": "meine. So. Ist halt ein bisschen dumm. Der Winkel ist halt kacke mit dem Ding. Das ist"}, {"id": 481, "start": 4362.72, "end": 4368.84, "text": "eigentlich wenn man irgendwo hinter der Heizung oder sowas schrauben muss. Ah Bassloss ist"}, {"id": 482, "start": 4368.84, "end": 4378.28, "text": "wieder da. Geht nicht. Warum geht das Ringlight nicht an? Was ist denn das? Ich klicke auf"}, {"id": 483, "start": 4378.28, "end": 4385.24, "text": "Ringlight starten und es geht nicht an. Habe ich das jetzt auch aus Versehen geflasht"}, {"id": 484, "start": 4385.24, "end": 4396.0, "text": "oder was? Max hast du in deinem Leben das mal gebraucht? Tierzelle und zwischen Pflanzenzellen"}, {"id": 485, "start": 4396.0, "end": 4409.56, "text": "unterscheiden? Äh klar täglich. Ah Ringlight geht wieder. Okay. Es ist wieder an und es"}, {"id": 486, "start": 4409.56, "end": 4425.04, "text": "funktioniert wieder. Oh der Keks muss dahingucken sonst klappt das nicht. Exquisite. So. Jetzt"}, {"id": 487, "start": 4425.04, "end": 4435.8, "text": "machen wir erstmal Firmware Update. Also. OTA. OTA TASMOTA. Releases. Aktuelle TASMOTA Version"}, {"id": 488, "start": 4435.8, "end": 4446.52, "text": "ist 10. Ich weiß gar nicht ob das hier irgendwo steht. Aktuelle TASMOTA Bin runterladen. Safe."}, {"id": 489, "start": 4446.52, "end": 4456.4, "text": "Configuration. Ah ich kacke nur. Ich habe jetzt die Leiste ja rausgemacht. Lul. So."}, {"id": 490, "start": 4456.4, "end": 4468.04, "text": "Warten bis die Leiste wieder da ist. Jetzt ist die Leiste wieder da. Configuration. Firmware"}, {"id": 491, "start": 4468.04, "end": 4473.8, "text": "Upgrade. Browse File. Downloads. Und ich weiß dass der erste mir jetzt sagt ich könnte"}, {"id": 492, "start": 4473.8, "end": 4479.32, "text": "auch direkt die Urlangeben. Das funktioniert nicht weil ich nicht ins Internet komme. Wobei"}, {"id": 493, "start": 4479.32, "end": 4495.92, "text": "doch von dem Access Point komme ich ins Internet. So. Firmware Update. Start. Erstmal seine,"}, {"id": 494, "start": 4495.92, "end": 4505.28, "text": "erstmal den Reflink unter die Leute bringen hier. Hast du schon die Switche gesehen? Äh"}, {"id": 495, "start": 4505.28, "end": 4515.44, "text": "nein. Wozu braucht man die? Was zeichnet die aus? So. Firmware Update funktioniert. Main"}, {"id": 496, "start": 4515.44, "end": 4525.32, "text": "Menu. Ah. Main Menu. Version 10. Das ist die aktuelle. Hat alles funktioniert und schalten"}, {"id": 497, "start": 4525.32, "end": 4530.88, "text": "geht immer noch. Exzellent. So. Jetzt werden wir das ganze nochmal in unsere Heimautomatisierung"}, {"id": 498, "start": 4530.88, "end": 4539.32, "text": "einbinden. Das ist tatsächlich relativ easy. Wir gehen jetzt erstmal in unseren Home Assistant."}, {"id": 499, "start": 4539.32, "end": 4542.88, "text": "Ich schiebe das mal hier kurz runter weil die Kamera ist jetzt nicht so spektakulär."}, {"id": 500, "start": 4542.88, "end": 4558.08, "text": "Wir gehen jetzt in unseren Home Assistant. Das ist es. Jawoll. Da ist hier noch nichts"}, {"id": 501, "start": 4558.08, "end": 4564.92, "text": "drinne. Da sind nur unsere Versuche vom letzten Mal drinne noch. Unser Test Home Assistant."}, {"id": 502, "start": 4564.92, "end": 4573.64, "text": "Gut. Und wir melden das. Dark Mode. Ja. Wir machen Dark Mode. Wir machen Dark Mode. Das"}, {"id": 503, "start": 4573.64, "end": 4580.24, "text": "ist schon richtig. Wenn ich wüsste hier. Dark. Exzellent. Exzellent. Und Advanced Mode einschalten"}, {"id": 504, "start": 4580.24, "end": 4585.48, "text": "haben wir schon. So. Das ist unser Home Assistant. Da können wir das jetzt ziemlich einfach"}, {"id": 505, "start": 4585.48, "end": 4591.6, "text": "einbinden. Wir müssen auf unsere Steckdosenleiste gehen. Configuration. Also die IP raussuchen"}, {"id": 506, "start": 4591.6, "end": 4599.48, "text": "vom Home Assistant. Das ist die hier. Dann geht man auf die Steckdosenleiste sagt. Konfigure"}, {"id": 507, "start": 4599.48, "end": 4607.52, "text": "MQTT. Host. Rest stimmt. Rest kann man lassen. Passwort braucht man. User. User. Nehme ich"}, {"id": 508, "start": 4607.52, "end": 4610.92, "text": "jetzt mal den Admin User. Das ist nicht die feine Art. Man macht normalerweise einen extra"}, {"id": 509, "start": 4610.92, "end": 4617.88, "text": "User. Aber ich weiß, dass es funktioniert so. Save. Jetzt meldet sich die Steckdosenleiste"}, {"id": 510, "start": 4617.88, "end": 4628.48, "text": "per MQTT am Home Assistant an. Und dann können wir mal in die Logs gucken, ob das jetzt funktioniert"}, {"id": 511, "start": 4628.48, "end": 4646.2, "text": ". Ach nee. Configuration. Supervisor. Addons. MQTT. Was ist denn da? Log. New Connection"}, {"id": 512, "start": 4646.2, "end": 4664.92, "text": "from 2137. Ach doch. Ja klar. Das ist hier Connection von der Steckdosenleiste. Das wird"}, {"id": 513, "start": 4664.92, "end": 4667.96, "text": "aus irgendwelchen Gründen genattet über den Router. Okay, war mir auch nicht klar, dass"}, {"id": 514, "start": 4667.96, "end": 4673.24, "text": "das eingeschaltet ist. Aber meinetwegen. Alles klar. Steckdosenleiste verbunden. Und"}, {"id": 515, "start": 4673.24, "end": 4676.36, "text": "das einzige, was wir jetzt noch machen müssen auf der Steckdosenleiste, ist in die Konsole"}, {"id": 516, "start": 4676.36, "end": 4683.2, "text": "gehen und sagen Set Option. Und das bin ich mir aus dem Kopf nicht sicher. 61.0. Home"}, {"id": 517, "start": 4683.2, "end": 4698.24, "text": "Assistant. Tasmota. Gucken wir mal. Set Option. Set Option 19.0 muss ich sagen. Das ist ein"}, {"id": 518, "start": 4698.24, "end": 4706.36, "text": "bisschen kryptisch bei Tasmota. Wenn ich das gemacht habe. Jawoll. Wenn ich das gemacht"}, {"id": 519, "start": 4706.36, "end": 4715.76, "text": "habe, sollte jetzt normalerweise in Home Assistant unter Configuration Integration Tasmota das"}, {"id": 520, "start": 4715.76, "end": 4725.48, "text": "Gerät auftauchen. Und siehe da, der Hammer Strip ist da. Und wir haben es direkt in"}, {"id": 521, "start": 4725.48, "end": 4734.76, "text": "Home Assistant drin. Was ich immer noch mag zum Einschalten ist die IP, dass ich sehen"}, {"id": 522, "start": 4734.76, "end": 4742.0, "text": "kann im Home Assistant, was es hat. So und wir sehen, wir können jetzt das gleiche Ding"}, {"id": 523, "start": 4742.0, "end": 4756.4, "text": "hier übers Web Interface. Können wir jetzt steuern über Moment. Über Home Assistant."}, {"id": 524, "start": 4756.4, "end": 4775.96, "text": "Man sieht es nicht richtig, aber es ist an. Man sieht es nicht richtig. Es funktioniert."}, {"id": 525, "start": 4775.96, "end": 4793.04, "text": "Es ist an. Wenn ich das alles ausmache, dann geht auch das USB aus. So und jetzt muss man"}, {"id": 526, "start": 4793.04, "end": 4797.6, "text": "natürlich den Kram noch mal richtig benennen. Schauen wir mal was USB ist. Ist das hier"}, {"id": 527, "start": 4797.6, "end": 4803.76, "text": "USB? Das ist USB. Dann würde ich das mal richtig benennen, weil Tasmota 5 ist relativ"}, {"id": 528, "start": 4803.76, "end": 4811.12, "text": "nichts sagend. Dann würde ich das Ding jetzt, keine Ahnung, Hammer, USB, dass man das nachher"}, {"id": 529, "start": 4811.12, "end": 4819.08, "text": "findet. Hier hat man auch die IP drin. Und den Rest würde ich halt irgendwie sinnvoll"}, {"id": 530, "start": 4819.08, "end": 4830.4, "text": "benennen, dass man am Ende den Kram wieder findet. So und wenn man das in seinem Home"}, {"id": 531, "start": 4830.4, "end": 4843.44, "text": "Assistant angelegt hat. So wenn man den Kram in seinem Home Assistant angelegt hat. Ach"}, {"id": 532, "start": 4843.44, "end": 4847.6, "text": "so, die Entity ID kann man auch ändern. Man kann das Ding auch gleich oben Hammer nennen."}, {"id": 533, "start": 4847.6, "end": 4858.0, "text": "Was? MonkaS, no, no. Ich weiß nicht, was er will von mir. Ich bin in die Entity ID ein"}, {"id": 534, "start": 4858.0, "end": 4862.6, "text": "bisschen. So und jetzt haben wir das da drin. Und wenn wir jetzt hier Dashboards haben, keine"}, {"id": 535, "start": 4862.6, "end": 4866.4, "text": "Ahnung, Dashboards fürs Wohnzimmer, Dashboards für den Keller, wie auch immer. Hier haben"}, {"id": 536, "start": 4866.4, "end": 4869.8, "text": "wir ein bisschen ausprobiert. Jetzt stellen wir mal vor, wir hätten hier die Steckdosenleiste"}, {"id": 537, "start": 4869.8, "end": 4873.76, "text": "im Keller liegen zum Beispiel, um da irgendwelche Sachen an- und auszuschalten. Da könnten"}, {"id": 538, "start": 4873.76, "end": 4880.2, "text": "wir jetzt einfach im Dashboard hier uns den Kram hinzufügen. Wobei das natürlich ein"}, {"id": 539, "start": 4880.2, "end": 4888.84, "text": "bisschen hässlich ist, so groß. Ich würde eher sagen, wir nehmen sowas hier, wir nehmen"}, {"id": 540, "start": 4888.84, "end": 4898.88, "text": "hier sowas wie den, äh, das Grid. Sagen drei Columns und sagen hier Buttons zufügen. Hammer"}, {"id": 541, "start": 4898.88, "end": 4911.16, "text": "1, Hammer 1, Hammer 1. Stellen wir das jetzt noch um. Guck und jetzt ist wichtig, dass"}, {"id": 542, "start": 4911.16, "end": 4918.4, "text": "man den Kram richtig benannt hat. Weil jetzt kann ich hier nämlich direkt nach dem Namen"}, {"id": 543, "start": 4918.4, "end": 4924.64, "text": "suchen und nicht nach diesen kryptischen Dingern. Weil wenn ich jetzt drei Tasmotageräte habe,"}, {"id": 544, "start": 4924.64, "end": 4935.36, "text": "ist es natürlich sehr undurchsichtig, was es eigentlich ist und so ist es besser. USB,"}, {"id": 545, "start": 4935.36, "end": 4943.96, "text": "save. Und schon habe ich meine Steckdosenleiste in meinem Dashboard fürs Wohnzimmer oder für"}, {"id": 546, "start": 4943.96, "end": 4947.64, "text": "den Keller drin und kann hier einschalten und ausschalten. Und das ist jetzt halt auch"}, {"id": 547, "start": 4947.64, "end": 4952.84, "text": "in UI was relativ touchfreundlich ist. Guckt, USB ist jetzt aus. Ihr seht, es ist ausgegangen"}, {"id": 548, "start": 4952.84, "end": 4964.08, "text": "oder geht gleich aus. Fahre ich es an, geht es bitte an. Ja. Das ist natürlich sehr praktisch"}, {"id": 549, "start": 4964.08, "end": 4968.28, "text": "jetzt. Natürlich kann man die Dinger dann auch am Endeffekt so benennen, wie man es"}, {"id": 550, "start": 4968.28, "end": 4974.8, "text": "braucht. Also Hammer 1 und so ist jetzt interne Bezeichnung ganz gut, aber realistisch betrachtet"}, {"id": 551, "start": 4974.8, "end": 4983.24, "text": "würde das dann sowas heißen wie Fernseh. Das nächste ist dann keine Ahnung Sound. Was"}, {"id": 552, "start": 4983.24, "end": 4996.96, "text": "weiß ich, was hat man da sonst noch? Blu-ray? Keine Ahnung, PS5 und Shitbox. Und USB. Hätte"}, {"id": 553, "start": 4996.96, "end": 5001.4, "text": "man dann sowas. Dann könnte man das quasi übers Dashboard im Wohnzimmer ein und ausschalten."}, {"id": 554, "start": 5001.4, "end": 5019.12, "text": "Und das alles nur dank Big Brain Custom Firmware. Nice. Ja, also nachdem das mit dem Flaschen"}, {"id": 555, "start": 5019.12, "end": 5037.08, "text": "gut funktioniert hat. Das war diese Steckdosenleiste hier. Gucken. Sag mal, ist die teurer geworden"}, {"id": 556, "start": 5037.08, "end": 5042.32, "text": "oder hat die das letzte Mal auch schon 36 Euro gekostet? Zack, Amazon. Ich muss Amazon"}, {"id": 557, "start": 5042.32, "end": 5053.8, "text": "auf dem iPad aufmachen und gucken. Amazon. Wie? Ich hab da kein Amazon drauf? Lul. Warum"}, {"id": 558, "start": 5053.8, "end": 5065.16, "text": "hab ich keine Amazon App auf meinem Tablet? Monka. Super, da bin ich jetzt nicht mal eingeloggt."}, {"id": 559, "start": 5065.16, "end": 5069.92, "text": "Da kann ich jetzt nicht gucken. Apps sind bloated. Auf dem Handy kann ich jetzt auch"}, {"id": 560, "start": 5069.92, "end": 5075.36, "text": "nicht gucken, weil das Handy, das Handy habe ich ja gerade für die Kamera hier oben im"}, {"id": 561, "start": 5075.36, "end": 5084.16, "text": "Einsatz. Ich hab wirklich die Amazon App nicht drauf gehabt. Wahrscheinlich verwende"}, {"id": 562, "start": 5084.16, "end": 5092.12, "text": "ich die immer auf dem Handy. Weiß nicht. Hätte nie gedacht, dass Max ein iPad. Warum"}, {"id": 563, "start": 5092.12, "end": 5100.12, "text": "nicht? Jetzt muss ich mal, jetzt muss ich mal den Flex raushängen. Ich glaube, ich hab"}, {"id": 564, "start": 5100.12, "end": 5105.76, "text": "mittlerweile 15 Tablets. Nicht Tablets. 15 Smartphones, Schrägschräg Tablets, die sich"}, {"id": 565, "start": 5105.76, "end": 5114.28, "text": "über die letzten Jahre so angesammelt haben. Drei Viertel sind da von Android. Der Rest,"}, {"id": 566, "start": 5114.28, "end": 5134.8, "text": "ja, ne, ne, ne. 60, 60% sind Android, 40% ist iOS. Also ich hab genug von beidem. Und"}, {"id": 567, "start": 5134.8, "end": 5138.96, "text": "das meiste davon habe ich mir noch nicht mal gekauft. Ich hab eine gesponserte Shield TV"}, {"id": 568, "start": 5138.96, "end": 5146.92, "text": "noch. Tablet, Shield Tablet oder wie das Ding hieß. Dann von G2A habe ich mal eins gekriegt."}, {"id": 569, "start": 5146.92, "end": 5158.2, "text": "Android, Android Gerät. Dann haben wir zwei iPads. iPhone 11, iPhone SE. HD 10 von Amazon,"}, {"id": 570, "start": 5158.2, "end": 5165.24, "text": "zwei Stück in HD 8. Ein ganz altes Tegra Note. Ich glaub, das war's. Ach ne und auch so ein"}, {"id": 571, "start": 5165.24, "end": 5174.16, "text": "komisches Asus. Ja, die Edelmetalle liegen bei mir rum in Form von Tablets. Spielst du"}, {"id": 572, "start": 5174.16, "end": 5182.88, "text": "noch GTA RP? Was heißt denn, spielst du noch GTA RP? Ich glaube, du lext critical information."}, {"id": 573, "start": 5182.88, "end": 5200.04, "text": "Ich habe aber noch nie GTA RP gespielt. Also, ähm, was frage? Wo denn? Wie heißt der Cloudflare"}, {"id": 574, "start": 5200.04, "end": 5205.24, "text": "Service, womit du Subdomains und so einrichtest, wenn ich das richtige Erinnerung habe. Äh,"}, {"id": 575, "start": 5205.24, "end": 5209.96, "text": "das ist da ganz normale Cloudflare DNS. Musst du es aber nicht über Cloudflare machen. Du"}, {"id": 576, "start": 5209.96, "end": 5215.16, "text": "kannst es über fast jeden anderen DNS machen. Ich mache das über Cloudflare, weil mein"}, {"id": 577, "start": 5215.16, "end": 5230.56, "text": "Domain Registratus sackt und keine DNS API hat. Arbeit dir für CI, CD, POG Zeug mit"}, {"id": 578, "start": 5230.56, "end": 5237.44, "text": "Jenkins auf der App. Wir haben mehrere Jenkins, ja. Aber ehrlich gesagt ist es immer weniger"}, {"id": 579, "start": 5237.44, "end": 5243.28, "text": "geworden, was auf Jenkins raufläuft. Ich persönlich mag Jenkins. Weiß gar nicht, hat jemand einen"}, {"id": 580, "start": 5243.28, "end": 5248.32, "text": "Haare, warum Jenkins in den letzten Jahren so den guten Ruf verloren hat? Weiß gar nicht"}, {"id": 581, "start": 5248.32, "end": 5254.04, "text": "warum. Ich mag Jenkins eigentlich, weil es eben schön flexibel ist und das super verbiegen"}, {"id": 582, "start": 5254.04, "end": 5262.48, "text": "kann für alles Mögliche. Ähm, klar, sag mal mal, wenn du auf GitHub bist, dann stehen"}, {"id": 583, "start": 5262.48, "end": 5267.48, "text": "die Leute halt alle unglaublich auf GitHub Actions. Haben wir hier im Stream auch schon"}, {"id": 584, "start": 5267.48, "end": 5280.32, "text": "gemacht. Jenkins hat noch keinen Yammel. Hä, wie? Die Drehpost kannst du schon ewig auschecken"}, {"id": 585, "start": 5280.32, "end": 5290.36, "text": "mit Jenkins und was du dann damit auswertest, ist ja dein Ding. Das stimmt, Jenkins ist"}, {"id": 586, "start": 5290.36, "end": 5295.16, "text": "nicht Cloud-Native, wobei man heutzutage Container technisch auch alles in der Cloud laufen lassen"}, {"id": 587, "start": 5295.16, "end": 5300.08, "text": "kann, was man will. Ja, ich verstehe es, wenn man es übers Repo konfigurieren will. Ach,"}, {"id": 588, "start": 5300.08, "end": 5305.32, "text": "das meinst du, dass im Repo so eine Bild-Yammel oder so reinkommt? Ja, das geht glaube ich"}, {"id": 589, "start": 5305.32, "end": 5310.88, "text": "nicht. Ja, ja, ja, das glaube ich, weiß ich nicht. Ich habe schon mich in der Richtung"}, {"id": 590, "start": 5310.88, "end": 5314.68, "text": "schon eine Weile nicht mehr mit Jenkins beschäftigt. Ich glaube, das geht noch nicht, ja. Aber"}, {"id": 591, "start": 5314.68, "end": 5328.12, "text": "ich mag Jenkins. Ach so, das meinst du mit Cloudflare. Nee, dann brauchst du die kostenlose,"}, {"id": 592, "start": 5328.12, "end": 5333.68, "text": "also die kostet erstmal nichts, die Cloudflare DDoS Protection brauchst du dann. Dann musst"}, {"id": 593, "start": 5333.68, "end": 5341.0, "text": "du den Cloudflare einstellen, wohin der das proxen soll und dann dein DNS auf Cloudflare"}, {"id": 594, "start": 5341.0, "end": 5347.92, "text": "umschalten. Also der DNS löst auf Cloudflare auf und Cloudflare schiebt dann Port 443"}, {"id": 595, "start": 5347.92, "end": 5360.96, "text": "quasi weiter. Ja, das geht, das funktioniert. Ja, also um das zu beantworten, wir haben"}, {"id": 596, "start": 5360.96, "end": 5366.0, "text": "auf der Arbeit ein paar Jenkins, das ist aber immer weniger geworden. Also was bei uns jetzt,"}, {"id": 597, "start": 5366.0, "end": 5370.6, "text": "ich weiß gar nicht, worauf unsere ganzen Entwickler stehen. Also ich werde in Zukunft auch auf"}, {"id": 598, "start": 5370.6, "end": 5380.28, "text": "der Arbeit mehr GitHub Actions verwenden, einfach weil wir immer mehr Sachen in GitHub packen"}, {"id": 599, "start": 5380.28, "end": 5389.48, "text": "und ansonsten keine Ahnung, was die anderen treiben. Jenkins kann das auch, ja, ich weiß,"}, {"id": 600, "start": 5389.48, "end": 5399.32, "text": "ich glaube Jenkins ist einfach nicht mehr cool genug. Ich meine Jenkins hat ein richtig"}, {"id": 601, "start": 5399.32, "end": 5405.76, "text": "mieses Logo. Das sieht aus wie 2005, guckt euch das mal an. Ich meine, wer will das Software"}, {"id": 602, "start": 5405.76, "end": 5416.32, "text": "mit so einem Logo verwenden? Das ist so richtig exquisite Logo. Drones, das habe ich mittlerweile"}, {"id": 603, "start": 5416.32, "end": 5440.72, "text": "auch schon öfters gehört, ja. Was? Das habe ich nicht kapiert, was? Ich hatte so 2006"}, {"id": 604, "start": 5440.72, "end": 5446.64, "text": "mal auf einem Windows XP Laptop ein Programm, das wenn man mit einem WLAN Netz verbunden war,"}, {"id": 605, "start": 5446.64, "end": 5451.48, "text": "einen Key ausgelesen hat und mit dem konnte man sich dann auch mit anmelden, wenn das Passwort"}, {"id": 606, "start": 5451.48, "end": 5458.68, "text": "geändert wurde. Was? Also das wäre fatal, wenn du dich noch einloggen könntest, wenn"}, {"id": 607, "start": 5458.68, "end": 5467.36, "text": "das Passwort geändert wurde. Meinst du vielleicht, dass gar nicht das WLAN Passwort, sondern"}, {"id": 608, "start": 5467.36, "end": 5471.36, "text": "dass es irgendwie so ein Portal davor war, wo du dich anmelden musstest, wo dann ein"}, {"id": 609, "start": 5471.36, "end": 5479.08, "text": "Browser aufgegangen ist? Das hat ja mit dem WLAN Passwort aber nichts zu tun. Das geht"}, {"id": 610, "start": 5479.08, "end": 5484.24, "text": "erst, wenn du im WLAN dann schon drin bist. Ansonsten wäre es ja fatal, wenn du das WLAN"}, {"id": 611, "start": 5484.24, "end": 5488.72, "text": "Passwort änderst und irgendwelche Leute, die Special Hacker mit Windows XP am Start haben,"}, {"id": 612, "start": 5488.72, "end": 5497.04, "text": "sich einfach so noch verbinden könnten. Ne, ne, ne, das effektive WLAN Passwort, ne, das"}, {"id": 613, "start": 5497.04, "end": 5503.92, "text": "WLAN Passwort gibt es nicht. Vielleicht war das noch für WEP, weil es war 2006, vielleicht"}, {"id": 614, "start": 5503.92, "end": 5512.12, "text": "war das irgendein WEP Cracker oder so. Den musst du dann aber jedes Mal neu laufen lassen."}, {"id": 615, "start": 5512.12, "end": 5527.0, "text": "Kannst du die Customfirma nochmal überfliegen? Ja, was genau? Hier, da. Was willst du sehen?"}, {"id": 616, "start": 5527.0, "end": 5531.16, "text": "Also ich gehe mal davon aus, dich interessiert nicht der Home Assistant Teil, sondern hier"}, {"id": 617, "start": 5531.16, "end": 5561.08, "text": "die Konfig für die Customfirma. Abgesehen davon, dass die nur 10 Ampere kann, hat das"}, {"id": 618, "start": 5561.08, "end": 5566.56, "text": "eigentlich gar nicht... naja, das reicht doch. Es sei denn, du willst Heizlüfter ein paar"}, {"id": 619, "start": 5566.56, "end": 5573.0, "text": "dran anschließen. Für was reicht denn das net? Für die meisten Geräte, die du da anschließen"}, {"id": 620, "start": 5573.0, "end": 5581.72, "text": "kannst, das ist doch mehr als genug. Ich mein, guck mal, was habe ich hier dran angeschlossen?"}, {"id": 621, "start": 5581.72, "end": 5591.6, "text": "Lass mal gucken. An der einen Leiste habe ich hier mein Ringlight angeschlossen und die"}, {"id": 622, "start": 5591.6, "end": 5602.76, "text": "anderen Sachen zum Basteln. Hier im Keller habe ich einen Raspberry Pi angeschlossen,"}, {"id": 623, "start": 5602.76, "end": 5609.56, "text": "das für die Türgegengesprecherlage deckt, Zeugs angeschlossen, den Schalter für die"}, {"id": 624, "start": 5609.56, "end": 5619.24, "text": "Pumpe angeschlossen, also nix, was irgendwie großartig da Leistung braucht. Wenn du da"}, {"id": 625, "start": 5619.24, "end": 5626.88, "text": "jetzt irgendwie vier Heizlüfter dran anschließen willst, mit jeweils, keine Ahnung, 2000 Watt,"}, {"id": 626, "start": 5626.88, "end": 5636.72, "text": "ja da würde ich mir das nochmal überlegen. Du willst, du vertraust dem nicht ohne Prüfzeichen."}, {"id": 627, "start": 5636.72, "end": 5644.76, "text": "Moment, Moment, Moment, Moment, Moment. Also die haben immerhin schon mal ein CE-Zeichen"}, {"id": 628, "start": 5644.76, "end": 5652.84, "text": "aufgedruckt und außerdem wird das von einer deutschen Firma vertrieben, die sind dann"}, {"id": 629, "start": 5652.84, "end": 5666.44, "text": "am Arsch, wenn die sowas hier verkaufen. Ansonsten hast du nix. Das kann sich eh jeder"}, {"id": 630, "start": 5666.44, "end": 5677.36, "text": "nachdrucken, ist egal. Na GS müsste da nicht drauf kriegen. Das Ding prüft keiner, geschweige"}, {"id": 631, "start": 5677.36, "end": 5685.0, "text": "dann. Also ich würde mir da jetzt nicht so viel Gedanken machen. Wie gesagt, zumal es"}, {"id": 632, "start": 5685.0, "end": 5697.28, "text": "auch noch von einer deutschen Firma vertrieben wird, also im Zweifelsfall sind die dann im"}, {"id": 633, "start": 5697.28, "end": 5717.48, "text": "Zweifelsfall. Bei der Prüfung explodiert es wahrscheinlich. Wir machen größtens als"}, {"id": 634, "start": 5717.48, "end": 5725.08, "text": "damit einfache SQL, Backup, Jobs und PowerShell Befehl absetzen. Ja, finde ich das auch eine"}, {"id": 635, "start": 5725.08, "end": 5732.96, "text": "gute Sache. Jobrunner Geschichten, ja. Deswegen mag ich Jenkins. Jenkins ist da halt richtig,"}, {"id": 636, "start": 5732.96, "end": 5740.0, "text": "Jenkins ist nicht nur Software, Code technisch fix, also zentriert. Ich meine, aus der Ecke"}, {"id": 637, "start": 5740.0, "end": 5745.76, "text": "kommt es letztendlich irgendwie, aber du kannst halt mit Jenkins wunderbar alles machen. Deswegen"}, {"id": 638, "start": 5745.76, "end": 5759.28, "text": "ich mag Jenkins. Ganz normales GitHub. Deswegen schieben sie jetzt auch alle so Panik, weil"}, {"id": 639, "start": 5759.28, "end": 5763.04, "text": "sie festgestellt haben, fuck wir haben Passworte im Klartext, im Repo stehen und das wollen"}, {"id": 640, "start": 5763.04, "end": 5770.36, "text": "wir nicht so auf GitHub pushen. Dazu kann ich dann immer nur sagen, heck you, weiß ich"}, {"id": 641, "start": 5770.36, "end": 5775.92, "text": "nicht, ob wir das Emote haben, aber das denke ich mir dann immer, wenn ihnen das nach 10"}, {"id": 642, "start": 5775.92, "end": 5789.6, "text": "Jahren einfällt. Man denkt schon immer, heck you. Ja, natürlich Private Repo, aber halt"}, {"id": 643, "start": 5789.6, "end": 5811.44, "text": "trotzdem auf GitHub. Also falls, das ist G-Bait, ja, aber falls es stimmt, ich sage immer dabei,"}, {"id": 644, "start": 5811.44, "end": 5818.8, "text": "dass ich euch nicht meine. Ich meine zum Beispiel euer Kack-Management, die dafür gesorgt haben,"}, {"id": 645, "start": 5818.8, "end": 5832.12, "text": "dass das so am Arsch ist, wie es jetzt ist. Ja, mit Sicherheit. Also mehr als ein Handy"}, {"id": 646, "start": 5832.12, "end": 5839.76, "text": "würde ich da nicht dran anschließen. Sonst Smokers Smoke. Also wie gesagt, ich habe drei"}, {"id": 647, "start": 5839.76, "end": 5845.52, "text": "dieser Steckdosenleisten aktuell im Einsatz. Das macht überhaupt keine Probleme. Eine"}, {"id": 648, "start": 5845.52, "end": 5849.52, "text": "liegt im Keller, eine liegt hier hinten auf dem Schreibtisch und eine liegt hier da, hier"}, {"id": 649, "start": 5849.52, "end": 5875.24, "text": "hinten, hier seht ihr es ja auch gerade hier, den da. Also überhaupt kein Ding. Welche History?"}, {"id": 650, "start": 5875.24, "end": 5882.84, "text": "Ich bin müde. Ich habe auch jetzt geflasht. Eigentlich habe ich überhaupt kein Content"}, {"id": 651, "start": 5882.84, "end": 5889.48, "text": "mehr für den Stream. Wir sind durch. Ich habe euch gezeigt, wie man flasht. Habe ich gezeigt,"}, {"id": 652, "start": 5889.48, "end": 5896.4, "text": "wie man den Home Assistant einbindet. Mehr kann ich euch heute nicht zeigen. Bedge-Time,"}, {"id": 653, "start": 5896.4, "end": 5908.96, "text": "nee noch nicht ganz. Noch nicht ganz Bedge. Aber fast Bedge. Könntest du noch 10 bestellen,"}, {"id": 654, "start": 5908.96, "end": 5915.56, "text": "das mache ich auch. Aber nicht on stream. Ich bin hier nicht eingeloggt bei Amazon."}, {"id": 655, "start": 5915.56, "end": 5924.2, "text": "Hey, ich verstehe einiges nicht. Ich verstehe, ich verstehe einiges nicht, was da abgeht."}, {"id": 656, "start": 5924.2, "end": 5931.76, "text": "Was ich auch nicht verstehe. Aber da bin ich mir nicht sicher, Chet. Ihr seid doch schlau."}, {"id": 657, "start": 5931.76, "end": 5938.52, "text": "Ihr wisst da doch bestimmt Bescheid. Also es gibt jetzt ja oftmals so Prämien, wenn"}, {"id": 658, "start": 5938.52, "end": 5944.8, "text": "man quasi sein altes Auto verschrotten lässt, um sich ein Elektroauto zu kaufen. Ich meine"}, {"id": 659, "start": 5944.8, "end": 5952.28, "text": "klar, dass wenn man quasi vor der Neuanschaffung steht und die Auswahl hat zwischen einem Elektroauto"}, {"id": 660, "start": 5952.28, "end": 5957.0, "text": "und einem Verbrennerauto und wenn man auch mal davon ausgeht, dass vielleicht der Strom"}, {"id": 661, "start": 5957.0, "end": 5961.64, "text": "demnächst nicht mehr nur mit Kohle oder sonst was hergestellt wird, ist ein Elektroauto"}, {"id": 662, "start": 5961.64, "end": 5966.12, "text": "sicherlich für die Zukunft das bessere. Aber es geht ja nicht unbedingt um die Neuanschaffung."}, {"id": 663, "start": 5966.12, "end": 5973.24, "text": "Viele Leute haben ja noch ein altes Auto. Und so wie ich mir das denke, ist es doch"}, {"id": 664, "start": 5973.24, "end": 5978.52, "text": "eigentlich das Beste, was man machen kann, dieses alte Auto weiter zu fahren."}, {"id": 665, "start": 5978.52, "end": 5992.6, "text": "Oder ich meine, warum sollte ich quasi was, was hergestellt wurde wegschmeißen? Also"}, {"id": 666, "start": 5992.6, "end": 5999.4, "text": "in der Regel ist wegschmeißen und Neuanschaffen doch immer um ein vielfaches, ja wie soll"}, {"id": 667, "start": 5999.4, "end": 6007.96, "text": "man sagen, ungesünder. Also verstehe ich den Sinn dahinter gar nicht, dass man sagt,"}, {"id": 668, "start": 6007.96, "end": 6013.96, "text": "okay, wenn man jetzt sich ein neues kauft, dass man sich dann ein Elektroauto kauft,"}, {"id": 669, "start": 6013.96, "end": 6024.76, "text": "ja das würde ich auch so machen. Also deswegen, das verstehe ich gerade nicht"}, {"id": 670, "start": 6024.76, "end": 6029.8, "text": "so ganz, dass alle so scharf drauf sind. Ich meine klar, sie sind so scharf drauf, nicht"}, {"id": 671, "start": 6029.8, "end": 6035.6, "text": "der Umwelt zuliebe, was wir eigentlich machen sollten, sondern um Autoverkäufe anzukurbeln."}, {"id": 672, "start": 6035.6, "end": 6046.16, "text": "Ja genau, das denke ich mir auch. Das Beste ist, den Mist zu verwenden. Sag mal so, das"}, {"id": 673, "start": 6046.16, "end": 6050.48, "text": "Beste ist erstmal, man braucht gar nichts. Was man nicht hat und nicht benutzt, ist okay."}, {"id": 674, "start": 6050.48, "end": 6054.4, "text": "Aber danach ist es, wenn man es hat, einfach so lang wie es geht zu benutzen. Oh ja und"}, {"id": 675, "start": 6054.4, "end": 6060.96, "text": "dann kann man sich was Neues holen. Kannst du einen Passwortmanager? Dein Sub wurde"}, {"id": 676, "start": 6060.96, "end": 6065.96, "text": "geknurriert. Oh, habe ich nicht gesehen hier. Exquisite, 3 Monate, 4 Monate Subscription"}, {"id": 677, "start": 6065.96, "end": 6073.6, "text": "Tabcon. Ich habe massive, huge Hyper-Subscription hier. Also ich benutze hier KeyPass 2, gibt"}, {"id": 678, "start": 6073.6, "end": 6079.96, "text": "aber auch zig andere Passwortmanager. Ich mag halt KeyPass, weil ich schon eine Weile"}, {"id": 679, "start": 6079.96, "end": 6085.76, "text": "verwende und für meine rein offline Sachen und Sync auf dem zweiten Rechner funktioniert"}, {"id": 680, "start": 6085.76, "end": 6092.12, "text": "das wunderbar. Du hast auch was wie Bitwarden noch selbst gehostet, das ist auch okay. Eigentlich"}, {"id": 681, "start": 6092.12, "end": 6096.68, "text": "ist alles, was du selbst in der Hand hast, okay. Was ich auf gar keinen Fall machen würde,"}, {"id": 682, "start": 6096.68, "end": 6100.72, "text": "ist Cloud Passwortmanager verwenden. Ich kann das nicht verstehen, wie sich Leute darüber"}, {"id": 683, "start": 6100.72, "end": 6106.08, "text": "beschweren, dass, also darüber beschweren kann man sich, aber die dann wirklich darüber"}, {"id": 684, "start": 6106.08, "end": 6111.24, "text": "überrascht sind, wenn es dann mal wieder irgendwelche Datenleaks gibt und ihre Passwörter wechseln"}, {"id": 685, "start": 6111.24, "end": 6115.12, "text": "und sowas. Cloud Passwortmanager, wenn ihr nicht wisst, was der Anbieter macht und das"}, {"id": 686, "start": 6115.12, "end": 6120.68, "text": "wisst ihr nicht, wenn ihr nicht gerade der Anbieter seid. Warum? Warum? Ja, was weiß"}, {"id": 687, "start": 6120.68, "end": 6128.84, "text": "ich bei irgendwelchen anderen Dingern, ja, kann man Cloud Services ja verwenden, aber"}, {"id": 688, "start": 6128.84, "end": 6134.6, "text": "doch nicht für das Wichtigste aller, was man hat, nämlich die Passwörter. Meinung zu"}, {"id": 689, "start": 6134.6, "end": 6140.84, "text": "KeyPass XC habe ich, weiß nicht, ob ich das ausprobiert habe. Ich habe KeyPass 2 seit"}, {"id": 690, "start": 6140.84, "end": 6151.16, "text": "Ewigkeiten. Ist nie passiert bei einem, weiß ich nicht. Ich würde aber eher darauf tippen,"}, {"id": 691, "start": 6151.16, "end": 6163.56, "text": "dass das schon passiert ist. Leak Cloud Passwort Manager. Passwort Leak. Bäm, das erste, was"}, {"id": 692, "start": 6163.56, "end": 6178.84, "text": "ich gefunden habe. Rock You 2021. Wunderbar. Also mich würde, wie gesagt, mich würde,"}, {"id": 693, "start": 6178.84, "end": 6193.24, "text": "mich würde nicht wundern, wenn das schon öfters mal vorgekommen ist. Also, wie gesagt,"}, {"id": 694, "start": 6193.24, "end": 6199.64, "text": "ich halte nichts von Cloud Passwort Managern, die von anderen Anbietern betrieben werden."}, {"id": 695, "start": 6199.64, "end": 6212.04, "text": "Ja, das ist richtig, sehe ich auch so. Die Bahn muss es geschissen bekommen. Der Chain"}, {"id": 696, "start": 6212.04, "end": 6221.12, "text": "Loader ist wieder voller Welleskalieren, Alter. Ja, das sagen die. Hat sich wirklich irgendjemand"}, {"id": 697, "start": 6221.12, "end": 6226.12, "text": "mal die Software angeguckt, ob das wirklich so ist? Ob die aktuelle Libraries verwenden"}, {"id": 698, "start": 6226.12, "end": 6233.68, "text": "von was auch immer sie zum verschlüsseln. Also ich traue keinem Cloud Passwort Manager."}, {"id": 699, "start": 6233.68, "end": 6239.44, "text": "Es ist auch total unsinnig. Warum soll ich den Scheiß dann in die Cloud legen? Mal ehrlich,"}, {"id": 700, "start": 6239.44, "end": 6243.12, "text": "man hat, man hat keine Ahnung. Ich sag mal, man hat 300 Passwörter. Man hat ja mittlerweile"}, {"id": 701, "start": 6243.12, "end": 6249.32, "text": "viele Passwörter. Aber mal realistisch überlegt, wie viele dieser 300 Passwörter braucht man"}, {"id": 702, "start": 6249.32, "end": 6256.96, "text": "dann wirklich zum Beispiel auf einem Smartphone. Fünf. Warum sollte ich meinen kompletten Passwort"}, {"id": 703, "start": 6256.96, "end": 6263.24, "text": "Manager da drauf packen? Im Zweifelsfall nehme ich halt diese fünf Passwörter und"}, {"id": 704, "start": 6263.24, "end": 6267.88, "text": "speichere sie dort in irgendeiner App drin. Meinetwegen, wenn ich die mobil brauche, aber"}, {"id": 705, "start": 6267.88, "end": 6272.88, "text": "doch nicht den kompletten, aber nicht den kompletten Safe, geschweige denn irgendwie,"}, {"id": 706, "start": 6272.88, "end": 6283.32, "text": "das ist doch keine Begründung, warum man es in die Cloud legen sollte. Also wie gesagt,"}, {"id": 707, "start": 6283.32, "end": 6290.8, "text": "ich würde nie Passwort Manager in der Cloud verwenden. Ja, ein paar habe ich auch im Kopf"}, {"id": 708, "start": 6290.8, "end": 6309.84, "text": "und die sind ziemlich lang. Am besten ist auch geil bei uns auf der Arbeit. Ich muss"}, {"id": 709, "start": 6309.84, "end": 6315.92, "text": "das jetzt ein bisschen anders erzählen, oder? Da hatten sie letztens auch irgendein Meeting"}, {"id": 710, "start": 6315.92, "end": 6325.24, "text": "so security-mäßig und haben sich überlegt, wenn der Hacker Zugriff auf den Server bekommt,"}, {"id": 711, "start": 6325.24, "end": 6329.2, "text": "das machen die bei mir auf der Arbeit gerne. Die sagen dann immer irgendwie so als Begründung,"}, {"id": 712, "start": 6329.2, "end": 6332.84, "text": "oh ja, der Hacker macht dann irgendwas, was der genau macht und wer da überhaupt hacken"}, {"id": 713, "start": 6332.84, "end": 6337.48, "text": "sollte und was da los ist vollkommen egal. Dann sagt dann immer einer irgendwie sowas,"}, {"id": 714, "start": 6337.48, "end": 6343.6, "text": "aber wenn der Hacker Zugriff auf unseren Server bekommt, dann kann er sich das und das angucken."}, {"id": 715, "start": 6343.6, "end": 6350.08, "text": "Da habe ich auch dazu gesagt, aber sehr gut, davor hat der Hacker schon unser Passwort"}, {"id": 716, "start": 6350.08, "end": 6357.24, "text": "erraten. Ich meine, wir haben so Passwörter wie Live-Umgebung, das findet er nie raus."}, {"id": 717, "start": 6357.24, "end": 6364.8, "text": "Live-Umgebung, nein, das kann man nicht knacken, das ist unknackbar. Oh nein, das ist kein"}, {"id": 718, "start": 6364.8, "end": 6369.6, "text": "wirkliches Passwort von der Arbeit gewesen, das habe ich jetzt geändert im Kopf. Das"}, {"id": 719, "start": 6369.6, "end": 6379.76, "text": "ist was ähnliches, aber genauso bescheuert. Also, die machen sich da Gedanken um tausend"}, {"id": 720, "start": 6379.76, "end": 6385.4, "text": "Dinger und haben teilweise Passwörter. Da muss nicht der Hacker irgendwie per Zero"}, {"id": 721, "start": 6385.4, "end": 6390.68, "text": "Day auf unserem Linux irgendwie was machen. Ne, der probiert fünf Passwörter durch und"}, {"id": 722, "start": 6390.68, "end": 6403.12, "text": "ist eingeloggt. Also, ich weiß eh nicht bei uns, was da mit den Leuten teilweise los"}, {"id": 723, "start": 6403.12, "end": 6407.32, "text": "ist. Genauso wie ich mal vor einer ganzen Weile, habe ich euch ja schon mal erzählt,"}, {"id": 724, "start": 6407.32, "end": 6413.16, "text": "gemietet habe und der Typ meinte dann zu mir, wir müssen mit dem Rechenzentrumsteam klären,"}, {"id": 725, "start": 6413.16, "end": 6420.44, "text": "wir brauchen da die fetteste Hardware, die wir haben und war da Felix am Start, Felix"}, {"id": 726, "start": 6420.44, "end": 6424.36, "text": "so, was haben wir denn da und da Felix meinte so, die fetteste Hardware ist irgendwie zwei"}, {"id": 727, "start": 6424.36, "end": 6430.44, "text": "Terabyte RAM oder mittlerweile glaube ich noch mehr, zwei Terabyte RAM, 48 Kerne, das ist"}, {"id": 728, "start": 6430.44, "end": 6436.2, "text": "schon ordentlich, das brauchen wir, die fetteste Hardware, wir rechnen mit massiv vielen Zugriffen"}, {"id": 729, "start": 6436.2, "end": 6441.08, "text": "und da hatte ich ihn gefragt, ja und, da ging es um irgendwelche komischen WordPress-Seiten,"}, {"id": 730, "start": 6441.08, "end": 6449.08, "text": "die sauer interessieren, ja und was, mit was für Zugriffen rechnen wir da so? Da meinte"}, {"id": 731, "start": 6449.08, "end": 6453.64, "text": "er so, ich bin mir jetzt, Leute, ich bin mir nicht mehr sicher, wie die Zahl genau war,"}, {"id": 732, "start": 6453.64, "end": 6458.76, "text": "ja, ich weiß nur noch, wie er das gesagt hat und dann sagt er dann so, 1000 und ich dachte"}, {"id": 733, "start": 6458.76, "end": 6463.68, "text": "so, 1000 in der Sekunde oder so, das ist schon, das ist zwar kein, das geht schon, aber das"}, {"id": 734, "start": 6463.68, "end": 6477.36, "text": "ist natürlich schon ordentlich und dann meinte er, am Tag, da habe ich dann auch innerlich,"}, {"id": 735, "start": 6477.36, "end": 6483.48, "text": "nein, nicht nur innerlich, auch äußerlich gecakt, da habe ich mir gedacht, okay, lass"}, {"id": 736, "start": 6483.48, "end": 6491.76, "text": "man Raspberry Pi Zero hinstellen, 1000 am Tag oder es kann auch sein, dass er in der"}, {"id": 737, "start": 6491.76, "end": 6500.88, "text": "Stunde gesagt hat oder so, macht keinen Unterschied, also, so lange das nicht in der Sekunde und"}, {"id": 738, "start": 6500.88, "end": 6507.28, "text": "selbst in der Sekunde ist das kein Problem, also das geht, dann braucht man vielleicht,"}, {"id": 739, "start": 6507.28, "end": 6511.92, "text": "je nachdem was dahinter hängt, tatsächlich bisschen dickere Hardware, aber in der Stunde"}, {"id": 740, "start": 6511.92, "end": 6529.6, "text": "oder gar am Tag, also pro Minute schaffst du easy, mit fast jeder Krücke, die es so"}, {"id": 741, "start": 6529.6, "end": 6537.52, "text": "gibt, wie gesagt, ich hätte gesagt, wenn er pro Sekunde sagt, dann würde ich sagen, okay,"}, {"id": 742, "start": 6537.52, "end": 6543.28, "text": "oh man, wir haben da schon Spezialisten teilweise am Start, da muss ich immer wieder mit dem"}, {"id": 743, "start": 6543.28, "end": 6549.52, "text": "Kopf schütteln, aber wisst ihr was das witzige ist, genauso wie ich über die Leute lästere,"}, {"id": 744, "start": 6549.52, "end": 6553.52, "text": "lästern die auch über uns, das weiß ich, was mich auch nicht juckt, die haben da wahrscheinlich"}, {"id": 745, "start": 6553.52, "end": 6561.68, "text": "sogar recht, die haben da wahrscheinlich sogar recht damit, weil es ist einfach so, 90% der"}, {"id": 746, "start": 6561.68, "end": 6567.36, "text": "Leute sind unfähig, das bedeutet 90% unserer Entwickler sind unfähig, das heißt aber auch"}, {"id": 747, "start": 6567.36, "end": 6572.88, "text": "90% unserer Admins sind unfähig, ich bin wahrscheinlich auch unfähig, also es ist"}, {"id": 748, "start": 6572.88, "end": 6581.88, "text": "halt so, dagegen ist Ping ein Dedos, ja. Habt ihr auch ältere Kollegen, die irgendwie"}, {"id": 749, "start": 6581.88, "end": 6590.84, "text": "bei 2005 stehengeblieben sind, die haben kaum alte, also wir haben einen bei uns, der ist"}, {"id": 750, "start": 6590.84, "end": 6596.52, "text": "wirklich relativ alt, er geht glaube ich sogar nächstes Jahr in Rente oder so, der ist ein"}, {"id": 751, "start": 6596.52, "end": 6605.12, "text": "bisschen schwierig im Umgang, was neue Sachen angeht, vor allem schnell neue Sachen, aber"}, {"id": 752, "start": 6605.12, "end": 6612.76, "text": "gut, kann ich verstehen, und ansonsten haben wir eigentlich kaum so richtig ältere, ich"}, {"id": 753, "start": 6612.76, "end": 6620.96, "text": "denke, ich denke die meisten sind ungefähr in meinem Alter, also irgendwas zwischen 30"}, {"id": 754, "start": 6620.96, "end": 6637.56, "text": "und 40. Schule haben wir teilweise, Windows 2003 Server, mich würde nicht wundern, wenn"}, {"id": 755, "start": 6637.56, "end": 6645.96, "text": "es Schulen gibt, die noch Windows 8, 9 haben, gibt's garantiert. Schluck auf, was ist denn"}, {"id": 756, "start": 6645.96, "end": 6652.28, "text": "jetzt los, irgendwelche Brennpunktschulen in Berlin oder so, die haben bestimmt noch"}, {"id": 757, "start": 6652.28, "end": 6671.64, "text": "Windows 98, die mit Gitter stehen am Klassenzimmer, das ist eine gute Antwort, aber trifft übrigens"}, {"id": 758, "start": 6671.64, "end": 6677.8, "text": "auf Führungskräfte genauso zu, man kann eigentlich bei allem, egal in welcher Branche"}, {"id": 759, "start": 6677.8, "end": 6683.6, "text": "oder in welchem Fachgebiet davon ausgehen, dass 80 bis 90% unfähig sind, also unfähig"}, {"id": 760, "start": 6683.6, "end": 6687.24, "text": "heißt jetzt nicht, dass die gar nichts können, dass aber sobald die Sachen komplizierter"}, {"id": 761, "start": 6687.24, "end": 6692.04, "text": "werden, es bei denen aufhört. Das ist egal, ob das Führungskräfte sind, ob das Admins"}, {"id": 762, "start": 6692.04, "end": 6697.44, "text": "sind oder ob das Programmierer, Softwareentwickler, was auch immer sind, egal ob es Ärzte sind"}, {"id": 763, "start": 6697.44, "end": 6707.76, "text": "oder sonst was, 80 bis 90% ist einfach, ja unfähig ist das falsche Wort, sobald es über"}, {"id": 764, "start": 6707.76, "end": 6716.08, "text": "die Standardsachen rausgeht, ist da halt nichts mehr. Was meint ihr denn, warum manche Ausbildungen"}, {"id": 765, "start": 6716.08, "end": 6721.48, "text": "so anspruchsvoll und schwierig sind, sei es um Arzt zu werden oder Pilot zu werden oder"}, {"id": 766, "start": 6721.48, "end": 6727.4, "text": "um solche Dinge zu machen, das ist kein Wunder, dass die so anspruchsvoll sind, weil die"}, {"id": 767, "start": 6727.4, "end": 6733.32, "text": "wollen sicherstellen, dass die 80%, die nix auf die Reihe kriegen, nicht im Endeffekt"}, {"id": 768, "start": 6733.32, "end": 6751.6, "text": "dann hinterm Steuer sitzen. Hat er? Was wir als Passwortmanager, oh fuck, ich hab keine"}, {"id": 769, "start": 6751.6, "end": 6764.48, "text": "Ahnung, wie das Ding heißt, irgend so einen hässlichen Active Directory basierten Passwortmanager,"}, {"id": 770, "start": 6764.48, "end": 6769.72, "text": "der ein ungültiges Zertifikat hat beim Einloggen, wenn man das falsch startet, was auch sehr"}, {"id": 771, "start": 6769.72, "end": 6784.96, "text": "vertrauenserweckend ist bei einem Passwortmanager. Ja, ist so, es ist überall so. Secret Zone,"}, {"id": 772, "start": 6784.96, "end": 6793.76, "text": "ich hab keine Ahnung, wie das Ding heißt. Also das älteste Linux System, was wir haben,"}, {"id": 773, "start": 6793.76, "end": 6810.28, "text": "ist den Red Hat Enterprise Linux 4. Weiß nicht, was da für ein Kernel drin ist. Schauen wir"}, {"id": 774, "start": 6810.28, "end": 6832.36, "text": "eben. Ah, yes. Top aktuell. Kernel 269 100. Das ist doch mal pock. Top aktuell. Und wer"}, {"id": 775, "start": 6832.36, "end": 6838.84, "text": "hätte das gedacht, es ist in Oracle datenbankbasiertes Warenwirtschaftssystem, was darauf läuft."}, {"id": 776, "start": 6838.84, "end": 6845.52, "text": "Also manche Sachen wirst du halt echt nicht los. Das stimmt nicht. Leute, Leute, ich hab"}, {"id": 777, "start": 6845.52, "end": 6849.84, "text": "euch angelogen. Das stimmt nicht, was ich gesagt hab. Das stimmt nicht. Ich hab mich"}, {"id": 778, "start": 6849.84, "end": 6856.32, "text": "vertan. Das ist noch viel schlimmer. Es ist, es ist noch viel schlimmer. Das älteste System"}, {"id": 779, "start": 6856.32, "end": 6866.28, "text": "ist in Red Hat 5. Es ist in Red Hat 5 das älteste System, was wir haben. Aber es ist"}, {"id": 780, "start": 6866.28, "end": 6873.88, "text": "in Red Hat 5 getarnt als Red Hat 4. Die Red Hat Versionsdatei ist angepasst. Das ist in"}, {"id": 781, "start": 6873.88, "end": 6879.76, "text": "Red Hat 5. Und in der Versionsdatei steht drin, es ist ein Red Hat 4. Weil die Datenbank,"}, {"id": 782, "start": 6879.76, "end": 6885.44, "text": "die da drauf ist, ist so alt, dass sie nur startet, wenn es in Red Hat 4 ist. Und das"}, {"id": 783, "start": 6885.44, "end": 6891.28, "text": "älteste, was wir hatten, war glaube ich in Red Hat 5. Und deswegen hat man einfach die"}, {"id": 784, "start": 6891.28, "end": 6898.04, "text": "Datei angepasst, dass das startet. Ich erinnere mich. Ja, das stimmt. Red Hat 5 ist das, ist"}, {"id": 785, "start": 6898.04, "end": 6901.88, "text": "das älteste, was wir haben. Aber es ist auch nicht wirklich neuer. 2, 6, 18er Körner."}, {"id": 786, "start": 6901.88, "end": 6919.48, "text": "Das, was ihr jetzt hier erfahrt, ist halt so typischer Business-Enterprise-Shit. Da,"}, {"id": 787, "start": 6919.48, "end": 6928.08, "text": "da machst du nix, ja. Oh, das ist richtig schöne Bed-Git-Musik, oder? Findet ihr nicht"}, {"id": 788, "start": 6928.08, "end": 6943.68, "text": "auch? Debian 8. Das ist auch schon ein bisschen älter. Findest du richtig schöne Bed-Git-Musik."}, {"id": 789, "start": 6943.68, "end": 6957.0, "text": "Allerdings, ich mein, Bed-Git-Time ist noch 50 Minuten hin. Hörst du nix? Excellent Bed-Git."}, {"id": 790, "start": 6957.0, "end": 6961.28, "text": "Ja, ich hab euch jetzt ja schon jede Menge erzählt. Ich überleg grad, ich brauch mal,"}, {"id": 791, "start": 6961.28, "end": 6967.32, "text": "ich muss demnächst mal wieder ein neues Story-Video aufnehmen. Und ich bin mir noch nicht ganz"}, {"id": 792, "start": 6967.32, "end": 6972.8, "text": "sicher, was ich nehmen soll. Ist schon viel Schwachsinn passiert, aber mir fällt jetzt"}, {"id": 793, "start": 6972.8, "end": 6981.72, "text": "grad nix so, so richtig Griffiges ein, was ich als nächstes nehmen könnte. Im Zweifelsfall"}, {"id": 794, "start": 6981.72, "end": 6985.52, "text": "Recycle-Story. Irgendwas, was ich hier im Stream schon erzählt hab, noch nicht auf YouTube."}, {"id": 795, "start": 6985.52, "end": 7001.64, "text": "Erster Schultag? Ich kann mich an meinen ersten Schultag nicht mal richtig erinnern. Ich bin"}, {"id": 796, "start": 7001.64, "end": 7006.24, "text": "nicht mal sicher, ob ich ne Schultüte hatte. Wahrscheinlich. Erster Schultag muss für mich"}, {"id": 797, "start": 7006.24, "end": 7009.48, "text": "relativ unspektakulär gewesen sein. Ich kann mich da gar nicht mehr richtig dran erinnern."}, {"id": 798, "start": 7009.48, "end": 7026.52, "text": "Erster Ausbildungstag. Das weiß ich noch. Erster Ausbildungstag beim Provider. Das weiß"}, {"id": 799, "start": 7026.52, "end": 7031.8, "text": "ich noch. Da musste man irgendwelche dummen Kennenlernspielchen machen. Das ist richtig"}, {"id": 800, "start": 7031.8, "end": 7037.08, "text": "Pain's Jam gewesen. Das kann ich mir noch dran erinnern. Da musste man durchs ganze Gebäude"}, {"id": 801, "start": 7037.08, "end": 7043.92, "text": "rennen und quasi erraten, welcher Mitarbeiter damit gemeint ist und so was. Richtig, richtig"}, {"id": 802, "start": 7043.92, "end": 7060.2, "text": "massive Pain's Jam, Alter. Das ist so cringe gewesen. Äh, ja. Könntest du machen. Also"}, {"id": 803, "start": 7060.2, "end": 7066.36, "text": "zumindest die User-Seite, also Libraries und sonst was. Der Kernel ist natürlich neuer"}, {"id": 804, "start": 7066.36, "end": 7075.24, "text": "dann. Der ist ja der vom Host. Erster Arbeitstag nach Ausbildung. Oh, da kann ich mich tatsächlich"}, {"id": 805, "start": 7075.24, "end": 7087.44, "text": "nicht mehr dran erinnern. Aber erster Ausbildungstag kann ich mich noch dran erinnern. Das weiß"}, {"id": 806, "start": 7087.44, "end": 7094.6, "text": "ich noch. Der, ja, komische Kennenlernspielchen. Das war richtig, richtig Pain's Jam. Ich bin"}, {"id": 807, "start": 7094.6, "end": 7101.4, "text": "ja immer noch, ne. Ich hab euch ja die Story erzählt von der Weihnachtsfeier und dem Ausbildungsgrill."}, {"id": 808, "start": 7101.4, "end": 7107.12, "text": "Da ärgere ich mich heute noch. Weil mit der hab ich mich auch wirklich gut verstanden."}, {"id": 809, "start": 7107.12, "end": 7114.44, "text": "Und eigentlich haben wir uns beide, fanden wir uns, glaub ich, ganz nett. Aber ich hab's"}, {"id": 810, "start": 7114.44, "end": 7128.08, "text": "halt wieder verpeilt. Ja. Vielleicht ist sie hier im Stream. Nein, hier ist sie garantiert"}, {"id": 811, "start": 7128.08, "end": 7142.88, "text": "sie hier nicht im Stream. Die ist garantiert nicht im Stream. Null. Unser Chef was jetzt"}, {"id": 812, "start": 7142.88, "end": 7152.04, "text": "zu einer Team-Building-Maßnahme außerhalb der Arbeitszeit? So ein Arsch, Alter. Also"}, {"id": 813, "start": 7152.04, "end": 7159.44, "text": "zwingen ist eh schon mal außerhalb der Arbeitszeit so ein Ding. Jungfrau check? Ne, das geht"}, {"id": 814, "start": 7159.44, "end": 7172.96, "text": "anders. Poki V check musst du machen. Virgin check, Poki V, I'm safe, das musst du machen."}, {"id": 815, "start": 7172.96, "end": 7180.64, "text": "Virgin check, Poki V, I'm safe. Chat, ich bin mal gespannt, wer den nicht übersteht."}, {"id": 816, "start": 7180.64, "end": 7200.48, "text": "Jetzt will ich sehen, Chat. Auf geht's. Virgin check, Poki V. Jaja, ich weiß. Ach komm, es"}, {"id": 817, "start": 7200.48, "end": 7212.44, "text": "ist mittlerweile alles verboten. Okay. Keine Poki-Subs hier. Jetzt enttäuscht mich der"}, {"id": 818, "start": 7212.44, "end": 7220.56, "text": "Chat aber. Ich hatte tatsächlich mal einen Monat Pokimane gesubbt. Allerdings hat mir"}, {"id": 819, "start": 7220.56, "end": 7235.2, "text": "den Sub jemand gegiftet. Ich weiß bis heute nicht warum und wer das war. Okay, Chat, ihr"}, {"id": 820, "start": 7235.2, "end": 7252.24, "text": "habt bestanden. Haben wir nochmal Glück gehabt. Ganz knapp, close. Dann musst du ja im Stream"}, {"id": 821, "start": 7252.24, "end": 7277.92, "text": "gewesen haben. Muss man das? Du hast das nicht wirklich gesubbt, oder? Du warst bestimmt"}, {"id": 822, "start": 7277.92, "end": 7283.76, "text": "schon vorher gesubbt und du hast nie den Check gemacht. Guck, er hat nie den Check gemacht."}, {"id": 823, "start": 7283.76, "end": 7295.76, "text": "Der war die ganze Zeit schon gesubbt. Exposed der Chandler hier. Gott soll jeder suppen,"}, {"id": 824, "start": 7295.76, "end": 7309.36, "text": "jeder will. Ist mir eh noch egal. Ihr könnt auch irgendwelche ASMR-Ear-Licking-Channels"}, {"id": 825, "start": 7309.36, "end": 7326.24, "text": "machen. Pool-Streams, wo auf der Banane rumgerutscht wird, kann jeder machen, was er lustig ist,"}, {"id": 826, "start": 7326.24, "end": 7351.96, "text": "ist nix. Tja. Ja, das war's für heute. Bis zum nächsten Mal, tschüss."}, {"id": 827, "start": 7356.24, "end": 7363.36, "text": "Ja gut, Leute. Ich hab absolut kein Content mehr left für heute. Was ein Scheißsatz,"}, {"id": 828, "start": 7363.36, "end": 7366.96, "text": "Alter. Ich hab kein Content mehr left. Also Leute, ich hab kein Content mehr left für"}, {"id": 829, "start": 7366.96, "end": 7374.0, "text": "heute. Und geflasht haben wir, hat alles funktioniert. Ich werd mir jetzt nochmal, sag mal, 10 Stück"}, {"id": 830, "start": 7374.0, "end": 7380.48, "text": "vielleicht nicht, aber sag mal mal 5 Stück hier. Da, da. Ich kann grad nicht hinkucken."}, {"id": 831, "start": 7380.48, "end": 7386.8, "text": "5 Stück bestell ich mir da nochmal von. Weil Steckdosen-Leisten kann man nie genug haben."}, {"id": 832, "start": 7386.8, "end": 7394.52, "text": "Wie wäre es mit Level-Cap-Chebaten, ey? Was am Sonntag wieder? Was soll man sich da"}, {"id": 833, "start": 7394.52, "end": 7406.24, "text": "chebaten lassen bei Level-Cap? Was gibt's denn da? Was chebatet er dann wieder? Warlhex-Specialist"}, {"id": 834, "start": 7406.24, "end": 7416.52, "text": "gefixt. Was heißt gefixt? Das Spiel ist doch nimmer raus. Was soll da gefixt werden?"}, {"id": 835, "start": 7416.52, "end": 7431.24, "text": "Fix ist eine Fehlerbehebung. Dazu muss es den Fehler erstmal geben, damit man ihn beheben"}, {"id": 836, "start": 7431.24, "end": 7436.36, "text": "kann. Oder Spiel gibt's noch nicht. Ich mein, es dauert nicht mal lang. Es dauert noch 10"}, {"id": 837, "start": 7436.36, "end": 7450.08, "text": "Tage jetzt. Da, hier, da. Ne. Da. Wer ist eigentlich auf diese unintuitive Geschichte"}, {"id": 838, "start": 7450.08, "end": 7460.4, "text": "gekommen, dass ne Woche 7 Tage hat anstatt 10, dass ne Minute 60 Sekunden hat, 60 Minuten"}, {"id": 839, "start": 7460.4, "end": 7466.96, "text": "ne Stunde und dann aber 24 Stunden nen Tag und sowas. Könnte man das nicht alles wenigstens"}, {"id": 840, "start": 7466.96, "end": 7474.88, "text": "auf 2er oder 10er Basis machen? Und bei der Gelegenheit noch den ganzen Shit mit Zeitzonen"}, {"id": 841, "start": 7474.88, "end": 7483.04, "text": "und so einfach sein lassen? Dann wüsste man wenigstens, wie man das rechnen soll und"}, {"id": 842, "start": 7483.04, "end": 7492.48, "text": "das wäre alles gut. Das waren sicher die Amis. Ne, ne. Das ist definitiv Pre-Kakona. Die"}, {"id": 843, "start": 7492.48, "end": 7496.84, "text": "Amis waren viel zu spät am Start, um Einfluss zu haben auf sowas. Die sind leider zu ner"}, {"id": 844, "start": 7496.84, "end": 7504.48, "text": "blöden Zeit am Start gekommen, als Fahrenheit und Galon und ounces und feet noch angesagt"}, {"id": 845, "start": 7504.48, "end": 7508.44, "text": "waren und dann hat jeder gesagt, wir wollen den Scheiß nicht mehr, aber die Amis haben"}, {"id": 846, "start": 7508.44, "end": 7530.2, "text": "gesagt, na, wir behalten das noch. Ja, right. Können wir Sommer und Winterzeit abschlafen?"}, {"id": 847, "start": 7530.2, "end": 7534.52, "text": "Nein, nicht mit der EU. Wir haben abgestimmt, die Leute wollten das haben, aber jetzt kriegen"}, {"id": 848, "start": 7534.52, "end": 7540.72, "text": "wir es nicht mehr hin. Ne, ne, ne, ne. So Sachen gehen nicht schnell. Das dauert tausende"}, {"id": 849, "start": 7540.72, "end": 7554.6, "text": "Jahre jetzt noch, bis das abgeschaltet wird. Egal Leute, ich geh jetzt off und dann in"}, {"id": 850, "start": 7554.6, "end": 7562.42, "text": "der Stunde im Bett gehen."}]}