{"text": "So, was trinken hier, exzellent, exzellent, moin, ah ja, so heute bin ich nicht so früh wie letzte Woche, letzte Woche war ich ja 8.30 Uhr oder so in dem Dreh schon da, aber da war es ja auch, erst gerade nach der Zeitumstellung. Zeitumstellung ist eh so ein Ding, sollten wir das nicht eigentlich, oder wollten sie das nicht eigentlich abschaffen mit der Zeitumstellung? Ja, es gab doch irgendwie mal so eine Umfrage vor vier Jahren oder so, wo die Leute gesagt haben, ja mach weg, da konnten sie sich nicht einigen auf was, aber ich meine, nur weil man sich nicht auf irgendwas einigen kann, ist ja nicht, dass man es jetzt einfach sein lässt, da muss man halt gucken, dass man sich auf irgendwas einigt. Ah, das ist eh ein aufgeblasenes, keine Ahnung, bürokratisches Teil, also da, keine Ahnung, kannste nix von erwarten. Ah, jetzt, so. Leute, in einer Woche ist Battlefield raus, nicht mal ganz eine Woche, am 12., das ist Freitag, nächste Woche, nächste Woche Freitag, so und ich kann euch sagen, was ich video technisch machen werde. Also, am Montag, oder vielleicht heute noch, muss ich mal gucken, ich geh mal eher vom Montag raus, Montag kommt ein Video allerdings nicht zu Battlefield, sondern Storytime, manche im Stream werden vielleicht sagen Recycle Story, weil ich das schon mal erzählt hab, aber mal gucken, und da muss ich da ein bisschen Hexen das erlaubt machen drin, und nächste Woche, irgendwann, wahrscheinlich einen Tag vor Release, ich hab, weil, leider war das alles, hat das alles nicht so hingehauen, ne? Ich hab ja ein paar Cutter gesucht, die mir aus meinen Battlefield-Livestreams so irgendwie so ein, keine Ahnung, paar Minuten Highlight oder was auch immer, wie viel, Highlight-Videos zu schneiden, aus diesen drei Battlefield-Beta-Livestreams, die ich gemacht hab. Der erste hat gesagt, er macht's, und auf einmal hat er's dann nicht mal gemacht, will ich jetzt nix erzählen, so weiter, weil vielleicht will er nix nicht, haben wir uns einen zweiten gesucht, der hat jetzt gesagt, der braucht eine Woche für, das ist heute fertig, mal gucken, also es war grausam, es ist leider ein bisschen spät, ich wollte es eigentlich schon vor ein paar Wochen hochladen, deswegen hab ich mir gedacht, ich lad das jetzt einfach irgendwie 1-2 Tage vor Release hoch, es kriegt dann zwar nicht so viele Views, aber dann ist das Video nicht umsonst, und vielleicht stimmt's die Leute ein bisschen auf Battlefield ein. Müssen wir mal gucken. Alles klar. Wieso? Schauen wir mal. Was waren wir denn jetzt? Big Stonks. Gab's irgendwelche spannenden News diese Woche, die ich verpasst hab? Facebook benennt sich um, aber das weiß ja schon ein bisschen her. Gab's irgendwas spannendes? Lass mal überlegen, was spannendes stehen, gab's irgendwas spannendes? Das weitere Einsatz von Corona war, warum nicht? Hä? Warum nicht? Juckt mich nicht. Ja, mal gucken. Das hab ich gelesen, das fand ich witzig. Kopierschutz hat Probleme mit den neuen CPUs, weil es wahrscheinlich nicht erkennt, auf welcher Plattform es läuft, ein Crash. Also genau das, was ein Kopierschutz nicht machen sollte. So, Aldi Talk, gab's auch nichts, sondern irgendwie spannendes, ja, Meta, ja. Also es war diese Woche tatsächlich relativ wenig und so. Nix, irgendwie. Vielleicht, ja. Ja, ja, wahrscheinlich. Mal gucken. Niemand kauft mehr Intel, das stimmt doch überhaupt nicht. Gerade im größeren Bereich, also im Enterprise Bereich, siehst du immer noch kaum AMD-Systeme. Jetzt mal eine Frage an euch, wer auch hier so aus der IT kommt. Wie ist der Anteil bei euch im Rechenzentrum Intel zu AMD? Also bei uns ist es ungefähr so 99 zu 1. Und ich sag dieses 1 auch nur dabei, weil ich mir gar nicht sicher bin, ob wir überhaupt haben dieses Thema. Aber könnte schon sein, könnte schon sein, deswegen sag ich 99 zu 1, anscheinend 100%. Ja, Firmen Notebook ist auch Intel, genau. Also gerade im Enterprise Bereich, gut, ja, bei Headstar haben die, ich weiß, aber, gut, ich sag mal, das meine ich jetzt damit nicht. Also, es mag vielleicht im Desktopbereich sein, dass Intel weniger verkauft wird, wobei ich glaube, dass immer noch viele so richtig Hardcore-Gamer, die quasi sagen, ich will jedes letzte FPS, auch egal, koste was es ist, ich wolle immer noch Intel kaufen. Aber das Gute ist, bei den aktuellen CPUs, also das Gute bei den aktuellen CPUs ist ja, dass Intel jetzt auch anfängt, es gab ja jetzt erst letztens einen Intel, was 1200, der da, ne, ist glaube ich der neue, kann das sein. Genau, und da habe ich mal ein bisschen Benchmarks geguckt. Der ist schon, das sieht man hier wahrscheinlich auch irgendwo drin, der ist schon ein bisschen schneller als der Ryzen hier, verbraucht aber halt auch richtig viel Strom, aber, was man daran sieht ist, eine Sache, die wir wirklich AMD zu verdanken haben, dass wir jetzt endlich angekommen sind auf dem Desktop bei 12 und 16 Kerne. Ich weiß gar nicht, was hat denn der, wie viele Kerne hat der, ich glaube, der hat 2 mal 8 oder so, ne. Hier, 2 mal 8, genau. Die haben 16 Kerne, 8 superschnelle und 8 irgendwie Low Power oder sowas. Und, dass wir jetzt bei, also das haben wir exklusiv einzig und allein AMD zu verdanken, dass wir auf dem Desktop jetzt quasi Mainstream-mäßig 8, 12 und 16 Kerne haben. Hätte Intel noch das Sagen gehabt, die nächsten irgendwie 5, 6 Jahre jetzt, also hier, die letzten 5, 6 Jahre und jetzt immer noch, hätten wir im High-End-Segment auf dem Desktop 8 Kerne und ansonsten 4 und 6. Eventuell, eventuell mal 10 oder so, wenn das super krass teuer wäre. Aber wir hätten garantiert nie im Leben Mainstream-mäßig 8, 12 und 16 Kerne, ohne AMD. Da bin ich mir relativ sicher, weil, wenn man sich anguckt, dass Intel über Jahre hinweg eigentlich nie die Core-Zahl geändert hat. Es gab ja im Prinzip immer 4 und dann mal ab dem 8700 ist dann so im High-End-Segment auch 6 Kerne aufgekommen. Wir wären nie im Leben von 6 Kernen auf 16 Kerne raufgegangen, so im normalen, sagen wir mal so im normalen Preis-Segment, also halbwegs normalen Preis-Segment für den Desktop, auch wenn das Zeug hier schweine teuer ist, also sich leistbaren Preis-Segment auf dem Desktop ohne AMD wären wir einfach nicht gewesen. Da bin ich mir sehr sicher. Und das haben wir tatsächlich AMD zu verdanken, unabhängig davon, ob AMD jetzt noch die letzten Jahre großartig hier oben mit dabei sein wird, wobei ich mir durchaus vorstellen könnte, wenn der Ryzen 3 ist das jetzt, also wenn quasi Ryzen 4, wann kommt dann eigentlich Ryzen 4? Was ist denn das dann? Ryzen 6.690 oder so? Nächsten Ryzen CPUs Release, wann kommt denn das? Haben die nicht schon irgendwas gesagt? Ryzen alle CPUs 2022, ja erzähl. Ah gut, mal schauen. Also sobald da das nächste kommt, ist wahrscheinlich AMD wieder vorne, zumal Intel ja es aktuell auch nicht so richtig schafft, also das Ding ist zwar schnell, wenn ich hier diesen Test richtig gelesen habe, das ist das Ding ja schnell, aber wird wohl ziemlich warm und verbraucht wohl ziemlich viel Strom. Ja, mal schauen. Ja, das in dem Fall wohl auf jeden Fall, weiß ich was das Ding kostet, aber Intel hat auch CPUs, die tatsächlich ganz günstig sind, für das was sie bringen. Intel muss es ja ein bisschen über den Preis machen in letzter Zeit. Ja, Preis steht nicht dabei. Was kosten so welche hier? Was kosten so einer? Ja. Ach ja, schnapper. Naja, muss ich auch mal sagen, denn Ryzen 5950 ist jetzt auch nicht so viel, so viel billiger. Ja, kostet sogar mehr. Also, ja, sofern ist es dann gar nicht mal übel, aber das Ding muss wohl ziemlich großen Stromverbrauch haben. Das ist natürlich High-End-Segment, also sprich, wenn man mal in den unten drunter guckt, ist wahrscheinlich ein bisschen wieder das ganze anders verteilt. Warum ist Arm auf dem Desktop eigentlich? Naja, bei Apple, ich wollte gerade sagen, bei Apple schon, ja, ich weiß nicht, ob es besser ist als X86, nur weil Apple das macht. Man darf nicht vergessen, was da alles dranhängt. Die meiste Software gibt es halt nur für X86. Bei Apple ist es halt so, Apple kann das machen und entweder ziehst du als Softwareentwickler nach, zumal die ja auch nicht umsonst so ihre Emulation dabei haben, entweder ziehst du als Softwareentwickler nach oder bist dead. Apple kann halt einfach machen, was sie wollen. Und nachdem eines der größten Vorteile von X86 in Verbindung mit Windows nun mal ist, dass alles läuft, auch Dinger, die 100 Jahre alt sind, wäre das glaube ich eine blöde Idee. Also, ich wollte euch mal ein Video zeigen, das habe ich richtig gut gemacht, hier, weiß nicht, ob das einer schon gesehen hat, aber das ist wahrscheinlich, weil das ist fast 9 Millionen Aufrufe, aber ich finde das ultra nice gemacht. Das ist die Jurassic, diese T-Rex Szene aus Jurassic Park mit einer Katz. Richtig, richtig Pongas gemacht. Moment, ich muss lauter machen. Da weißt du erst mal, wie sich eine Maus fühlt. Mikro. Ich finde es echt, du hast es echt gut gemacht. Aber da kannst du dir erstmal vorstellen, wie sich irgendeine Maus fühlt. Stell dir mal vor, du guckst da raus und vor dir steht so eine Katze und klotzt dich an. Also ich glaube, die fühlen sich, also man kann, also wer den Film gesehen hat, du hattest ja da schon, ist ja nicht so, also man konnte sich ja doch ganz gut hereinversetzen, wie das ist, wenn ich jetzt gerade so irgendeinen fleischfressenden Dinosaurier angucke. Und so ungefähr muss das für die Katze ausgeben. Ausgibt neue Battlefield Fans. Es gibt neue Battlefield Fans. Huge. Ist das neu? Hä? Das ist ein Re-Upload. Aber wir gucken den trotzdem, der ist glaube ich ganz guter. Es gibt halt wirklich so Server. Gut, in Battlefield 3 nicht mehr, da gibt es noch 5 Server oder so, die aktiv sind, wenn man da Leute bunt, ist halt, kannst du das Spiel aninstallen. Ja, das ist der Administrator, er hat diesen Platz, er ist auf unserem Team. Gut, können wir da raus und... Leute, Leute, Leute, ich habe einen Chopper auf mich, jemand helft. Wer ist das? Bist du campen? Nein, nein, ich bin getroffen durch einen Chopper. Du sitzt da in diesem Gebäude. Bist du campen? Nein, nein, ich stehe in einem Gebäude, damit ich nicht von einem Chopper getroffen werde. Oh warte, nein, das ist mein Freund, er ist unser Sniper. Er ist dein Freund? Ja. Was ist der Name des Choppers? Was ist sein Name? Ich weiß nicht, Freeze etwas? Freeze! Band! Danke. Wow. War das großartig? Nein, das war es nicht. Er hat einfach den Typen gebannt. Ja, aber der Typ spielte fair. Er hatte einen Chopper. Das ist auch ein Re-Upload von 2012. Wir haben einen Chopper in dem Spiel getroffen. Wenn er in dem Spiel ist... Ich mag diesen Typen nicht Storytelling. Du hast einen schlechten Storytelling. Ich habe keinen verdammten Storytelling. Ich weiß nicht, wo ihr die Typen hinkriegt. Ich bin sehr dumm davon. Ich werde ihn bannen. Ja, wenn du ein Storyteller bist, musst du dein Spiel ein bisschen öffnen. Ich versuche nicht einen verdammten Storyteller zu erzählen. Nimm noch einen Mittelpunkt. Ich mag seinen Mittelpunkt nicht. Ja. Der Anfang war okay. Climax? Lösung. Was ist Act 3? Okay, hier ist meine Lösung. Band! Meine Lösung ist, man sollte nicht die Typen bannen. Oh verdammt! Oh verdammt, wir haben Feuer. Okay, schaut mal, Leute, ich werde diese Typen flicken. Ihr versucht, euch von vorne zu schlagen, okay? Ihr versucht, euch von vorne zu schlagen, ihr könnt in der Mitte rennen. Egal, jeder ist einfach aufgeregt. Band! Band! Band! Habt ihr gesehen? Das Spiel ist einfach. Das Spiel ist einfach. Das ist gar nicht Spaß. Und das ist gar nicht fair für diese Jungs. Dude, wir werden total gewinnen. Ja, wir werden gewinnen, weil ihr eigentlich schräg seid. Als Administrator, ihr bannt Leute nur, weil sie besser sind als ihr. Das ist nicht Spaß, das ist nicht sportlich. Das ist halt einfach schräg. Ihr könnt das nicht machen. Das ist einfach schräg. Das ist einfach schräg. Das ist einfach schräg. Das ist einfach schräg. Das ist nicht lustig, das ist nicht sportlich, das ist einfach, das ist schuldig, das kannst du nicht tun. Oh, die letzte Zeit, in der ich meinen Kreditkart getestet habe, habe ich die Scheiße, die ich will. Es gibt halt wirklich so Leute und nicht zu wenige. Wisst ihr wo das ganz schlimm war? Bei Venice Unleashed, die drei Wochen wo das Game live war, die hatten halt keinen offiziellen Server und da war sogar so, dass der Server auch noch mitgecheatet hat. Alter, das war echt der Wahnsinn. Also, nee, nee, seriously, das war für'n Arsch. Ach guck mal, hier hatte ich noch einen auf, aber noch, müssen wir noch einen, müssen wir nicht gucken. Alter, was ist denn mit YouTube los? YouTube empfiehlt uns ja nur noch Battlefield, ich meine, ich weiß, kommt gleich raus, aber man muss es jetzt nicht, muss es jetzt nicht übertreiben. Twitch meisen, Dankeschön für den Sub. Ich würde sagen, wir lassen uns jetzt erstmal eine Runde von LevelCaptureBaden und mal gucken, was er erzählt. Ich meine, er wird im Endeffekt sich darüber auslassen, dass, okay, Overwatch und, ich weiß jetzt schon was kommt, Overwatch und Diablo 4 wurden delayed, das ist ja bekannt jetzt mittlerweile. Also, und ich frage mich, was everything you need to know, ich meine, das Ganze kommt am 12. raus, wir können jetzt quasi ab, ich glaube, Xbox kann schon preloaden, ich glaube, Xbox kann ab heute preloaden, wenn ich nicht ganz falsch liege. Und PC kann ab 10. preloaden. Und ansonsten, ja, was muss man wissen? Ja, eigentlich, eigentlich nichts, wenn man ehrlich ist. Was soll man wissen müssen? Man kann ab 12. spielen, außer, also man kann spielen, außer man hat diese ganz ultra low Edition, dann kann man, glaube ich, erst ab 16. oder so spielen. So, gucken wir mal, lassen wir uns G-Baden. Moin LevelCapt. Ach stimmt, ein Vanguard Review, das hatte ich doch hier auch offen. Ja, das müssen wir uns so angucken, da bin ich mal gespannt. Ich hab mich null informiert, absolut null, ich kauf mir das auch nicht. Warum lassen wir uns jede Woche von LevelCapt neu G-Baden, ist doch nice, sich G-Baden zu lassen. Ja, also Vanguard kauf ich mir nicht, es ging voll an mir vorbei, ich sehs auch nicht ein, ich würde das eh nur bis zum Battlefield Release spielen wahrscheinlich. Und außerdem kommt dann SBMM. Und Leute, ich sag euch jetzt mal was, ich hab's ja schon predicted, vor Battlefield 2042 Release und quasi zur Beta nochmal, als da kein Serverbrowser drin war. Ich könnte wetten, es kommt in irgendeiner Art und Weise limitierter oder nicht vorhandenes Serverbrowser und skill-based Matchmaking. Ich sag's euch, ich sag's euch, weil dann ist das Game instant dead für mich, da werd ich nicht spielen. Ich, ich, ich, ich, irgendwie hab ich so im Gefühl, dass was in dieser Richtung passiert. Aber hoffen wir mal das Beste. Ist laut genug. Mental Launch, alles klar. Ich glaube, der Launch wird erstmal, wie bei fast jedem Battlefield, wer findet die meisten Bugs innerhalb der ersten 24 Stunden. Nee, Xbox kann schon preloaden. Ich mein, guckt euch mal, guckt euch mal die anderen Maps an. Wenn man sich diese Maps aufholt, da ist halt auch nix, außer irgendwo ab und zu mal ein bisschen was. Und die neuen geleakten Gameplays schauen, oh, das weiß ich nicht, ob man das schauen kann. Also wenn das, wenn das auf irgendwelchen großen bekannten Channels ist, dann schon. Wenn das jetzt irgendwelche so ein Video-Channels sind, die sich das nur für die Leaks angemacht haben, dann nicht. Da weiß ich nicht, wie, wie tost das ist. Die Maps sehen halt auch alle schon wieder so leer und, und so im Prinzip wie Orbital nur mit einem anderen Setting halt aus. Ich bin da echt kein Freund von gewesen. Orbital war ja im Prinzip einfach so eine 0-15-Battle-Royale-Map ohne die typischen Battlefield-Routen, die du so hattest. Du hattest zwar diesen Tunnel unten drunter, da kannst du aber nicht durchlaufen. Ansonsten, du hattest im Prinzip nur offenes Feld überall und keine sinnvollen Routen über die Map. Du hast einfach offenes Feld. Du kannst sagen, du hast nahezu und endlich viele Routen, aber das bringt ja nix, wenn alles offenes Feld ist. Also, mal gucken, mal gucken. Also ich hab da immer noch so meine Bedenken. Huge M, BAM! Ne Auto-Shotgun? War das richtig? War das ne Auto-Shotgun? Da wird wieder geflamt. Hast du den Reddit-User gesehen, der schon spielen kann? Er hat keine... Ich hab da irgendeine News-Artikel drüber gelesen, wo die Leute Zweifel daran hatten, dass das legit ist. Ist das der, der angeblich preloaded hat und er konnte schon spielen? Schick mal bitte nen Link, das können wir uns angucken. Es ist auch sowas, da hab ich ehrlich gesagt ein bisschen Bedenken. Die Sache ist nämlich die, man hat bei fast jedem Battlefield im Vorfeld irgendwas... Also du wusstest quasi bei jedem Battlefield mehr als bei dem hier. Was wissen wir zu dem Spiel? Wir wissen zwar so die Rahmenbedingungen, was weiß ich, wie viele Maps, wir kennen paar Specialists, wir kennen die Waffen und sowas, aber so wirklich substanzielles wissen wir über das Game gar nichts. Es hat Sound keine Ahnung, Portal nicht so wirklich eine Ahnung, selbst All Out Warfare, wo sie fett Werbung gemacht haben und man die Beta spielen kann, so wirklich Ahnung davon hat man auch nicht. Außer dass man ein paar kurze Videos immer gesehen hat. Dann haben sie angefangen mit ihren Story-Trailer, dann kam das mit Irish und ansonsten glaube ich nix, wo man sich halt fragt, hätte man nicht vor Release eigentlich mindestens mal fünf dieser Story-Trailer droppen müssen? Wenn man eine Story erzählen will, dass man vor Release... Ich mein, das Game ist unter einer Woche von Release weg, wo sind denn die ganzen hunderten... Wo ist denn die große Marketing Trommel, die rührt? Ich merke davon gerade gar nichts. Bei Battlefield 3 hattest du komplette Singleplayer Mission vor Release, die du gucken konntest. Nahezu komplette. Hey, ist das Captain Price? Der Typ sieht aus wie Captain Price. Guckt euch mal den Typ an, der da rennt. Der Dude sieht echt... Guck mal, das sieht aus wie Captain Price. Naja, nee, nicht wirklich. Aber auf den ersten Blick schon. Er hat halt auch so einen komischen Bart. Captain Price auf Wish bestellt. Nimmst du dir frei? Nö. Es ist doch eh Freitag, wann man anfangen kann zu spielen. Dann habe ich Freitag, Freitag, Samstag, Sonntag, Montag und dazu kommt... Jetzt muss ich euch mal was Poggers, Poggers, Poggeriges zeigen. Ich habe ja eh Urlaub ab hier. So, und ich habe festgestellt, ich habe noch vier Tage Resturlaub. Das heißt, ich kann... Hier habe ich eh frei, hier habe ich eh frei. Das heißt, ich nehme hier auf jeden Fall noch den Dienstag frei. Weil alles andere wäre bescheuert. 29. bin ich eh nicht da. Dienstag, da müsste ich für einen Tag noch mal hin. Dann nehme ich mir noch mal frei und dann nehme ich einen Tag Kleidzeit und die Woche davor noch mal. Wenn das passt. Das heißt, dann habe ich quasi Urlaub ab hier. Bis nächstes Jahr. 19. November bis nächstes Jahr. Das heißt, im Endeffekt kann ich ab 19.... 24 Stunden Battlefield spielen. Also da muss ich mir keinen Urlaub extra zu Release nehmen. Also was mich am meisten excited immer noch ist, dass es endlich mal wieder ein modernes Battlefield ist. Das Gesamtkonzept, also das Gesamtding aus, es ist ein modernes Battlefield und es spielt sich auch relativ schnell und zügig und so. Ich finde das gut. Ich habe bei fast allem anderen Bedenken, habe ich ja in meinem letzten Video auch oder vorletzten Video erzählt. Aber nichtsdestotrotz, im Kern scheinen sie was richtig gemacht zu haben, weil ich habe immer noch Bock drauf jetzt zu spielen. Diving in Headfirst, das ist auch so eine Redewendung, das ist genauso wie Redewendung Pushing Boundaries und sowas. Es gibt so ein paar Redewendungen, die gehen mir einfach richtig auf den Sack. Wisst ihr, es gibt eine Sache, so ein Deutschspruch auf Deutsch, der mir voll auf den Sack geht, den die Leute zu allem sagen, was sie gut finden. Und das ist die Kombination richtig und wichtig. Wenn ich das lese, kriege ich Anfälle. Das sagt jeder zu allem, was er denkt, für alles was er denkt, was gut ist. Wenn irgendwie einer sagt hier, keine Ahnung, alle Livestreamer sind kacke und einer denkt, das ist richtig und wichtig. Das ist doch mittlerweile ernsthaft, ist das schon gemimt, ist aber auch verständlich. Was ist dein Arbeitgeber, dass du Streamer bist? Ja, der guckt sogar manchmal meine Videos und letztens habe ich ihn sogar bei mir im Stream hier gesehen. Das wusstet ihr nicht und ich habe auch nichts gesagt, weil ich da nichts, ich wollte das jetzt nicht outen oder so. Letztes Mal sogar kurz im Stream. Das ist richtig und wichtig, das zu erwähnen. Alter, diese Redewendung geht mir wirklich auf den Keks. Ist das nicht vermonte? Nein, das ist nicht alles. Diesen Spruch gibt es ja schon lange. Schlimm. So, jetzt langen wir so weiter, Chibane. At first. Hahaha, das kann man so sagen. Alter Leute, New World, es ist so krass am abkacken. Ich hatte ja mal eine Zeit lang, also ich habe den New World nie gespielt, also das Release nie gespielt, weil ich mir wusste, dass das Cluster Fuck hoch 10 ist. Ich hatte ja richtig Spaß die letzten 1-2 Wochen, ich konnte mir jeden Tag mehrere Videos anschauen zu neuen New World Glitches. Und was es für Glitches gab, Alter. Diese Sache mit wir freezen ist ja nur das eine. Du konntest Items dupen, du konntest HTML injecten, wenn nicht sogar Javascript. Es war ein abfuck hoch 10, also wirklich krasser Scheiß. Also New World ist in einem ganz, ganz grausamen Zustand. Und wir gucken mal, Steam Stats New World. Es ist irgendwie... Es geht schneller als ich mir das gedacht habe. Es geht schneller als... Die hatten eine Million am Anfang von ungefähr einer Million. Sind die jetzt runter? Die haben jetzt noch ein Drittel ungefähr. Oh Mann, oh Mann. Man muss sagen, also vergiss nicht, es ist gerade lost, es ist doch scheißegal, es ist doch scheißegal. Es ist auch Battlefield und Call of Duty Release, es ist scheißegal. Das ist genauso, das ist genauso wie die Leute früher immer bei MMOs wo es den Bach runtergegangen ist, gesagt haben, oh es ist Sommer, die Leute spielen weniger. Das ist doch scheißegal, das ist wurscht. Also bei so einem Spielerverlust von einem Drittel, das kannst du nicht auf irgendwelche äußeren Faktoren schieben. Das könntest du höchstens, hättest du das damals auf World of Warcraft Release vielleicht machen können, ja. Aber dieses Kaliber in MMOs haben wir jetzt ja nun nicht gehabt. Und selbst da hat es länger gedauert, wie die MMOs Spielerverlust. Ich meine, man muss sich mal vorstellen, das ist kein Subscription-based. Da steht 30, man muss etwas weiter aufmachen. Achja, hä? Ne, das ist doch 30.9. doch rausgekommen. Mehr geht doch, mehr geht doch nicht. Mehr geht doch nicht, guck. Das Game ist doch quasi erst irgendwie einen Monat oder so raus. Ja, eineinhalb Monate oder sowas. Ja, sechs M. Oder drei, ist es eigentlich egal. Aber zumindest, ja, zumindest, das ist ja nicht Subscription-based. Wenn es Subscription-based, guckt euch, das war alles so krass. Wenn es Subscription-based gewesen wäre, dann könnte man sagen, okay, ich verstehe den Drop nach einem Monat, die Leute haben ihre Subscription nicht. Aber es ist nicht Subscription-based. Es ist einfach schlecht und hat Probleme. Ich meine, du musst es erst mal schaffen, zwei Drittel deiner Spieler zu verlieren. Das letzte Mal waren wir noch bei 40%, was sie verloren haben. Jetzt haben sie quasi zwei Drittel. Die haben 60, naja, okay, 66% der Spieler verloren. Das ist brutal, also das ist wirklich... Aber gut, das Game ist auch im Arsch, ja. Okay, gucken wir uns das jetzt mal fertig an. 150k Spieler ist auch nicht wenig. Für den Anspruch, wie die gestartet haben, nicht. Und wir gehen ja mal, also ich gehe ja mal nicht davon aus, dass es irgendwie jetzt schlagartig stoppt. Ich meine, sieht das irgendwie so aus, als würde diese Linie aufhören, nach unten zu gehen? Warte mal, Steam, New World. Stimmt, wir müssen uns Steam-Rezession angucken, das wäre lustig. Die interessante Frage ist, wie viele Spieler haben Max Level erreicht? Auch bestimmt, bestimmt einen Teil. Bestimmt, bestimmt. Aber das ist ja nochmal ein Beweis dafür, dass es ein Fail-MMO ist, wenn du Max Level erreicht und dann nichts zu tun hast und alles den Bach runtergeht. Das ist ja nicht Sinn und Zweck der Sache. Level-Prozess in einem MMORPG sollte ja eigentlich nur ein Teil davon sein. Ich hab's gesagt, Leute, ich hab's von Anfang an gesagt. Leute haben gesagt, ach nee, Max, die kriegen das schon hin. Nein, die kriegen das nicht hin, das war für mich direkt bei der Beta klar. Age of Empires 4, ja, das soll richtig gut sein. So, wir gucken uns das jetzt erstmal an, was er dazu sagt. Es gibt immer Leute, die so Games hartnäckig verteidigen. Du weißt ja, du hast dann immer so die gleichen Ausreden. Wenn's dir nicht gefällt, dann spiel's doch nicht. Ja, machen die ja auch ganz viele offensichtlich. Ja, es machen ja ganz viele. Oder die Leute dann so nach dem Motto, das ist doch alles nicht schlimm, ich habe meinen Spaß. Das ist ja schön für dich, wenn du deinen Spaß daran hast, was aber nicht die Probleme weniger problematisch macht, die das Spiel hat. Ist ja schön und gut, wenn jemand Einzeles sagt, dass er seinen Spaß hat. Soll er weiterspielen und gut ist, sein Spaß haben, habe ich überhaupt keine Probleme mit. Das ändert aber nichts daran, dass das Spiel Fehler und Probleme ohne Ende hat. So, vielleicht erzählt er ja ein paar. Ja, ja. Ich glaube, den Anfang haben wir gar nicht gehört. Ja. Also ich habe mir das ein bisschen genauer angeguckt, weil mich interessiert hat, was da los ist. Also du konntest quasi im Chat posten von New World. Du konntest quasi Link Text in den Chat posten. Und das hat funktioniert. Es war nicht nur so, dass du damit quasi den Chat kaputt machen konntest. Du konntest auch irgendwie falsche Items linken, die du gar nicht hast. So, aber wisst ihr, was der Fix von Amazon war? Der Fix von Amazon war String Contains. Das war der Fix von Amazon. Doch, doch, das ist den, Herr Ernst. Das war der Fix von Amazon. Das Problem ist jetzt aber, dass du ohne Probleme das ja mit allen möglichen anderen Text auch machen konntest. Also ich glaube, mittlerweile ist es gefixt. Aber Amazon ist einfach krass unfähig, was das Ganze angeht. Ach ja, und dann gab es übrigens noch einen geilen Bug. Weiß nicht, ob er das noch erzählen wird, aber es war mein persönlicher Lieblingsbug von dem, was ich gesehen habe. Du konntest unendlich XP Farmen, indem du an das Quest Board gegangen bist und irgendwie eine was weiß ich Fische Fünf Fische Quest angenommen hast. Dann bist du zum Marketplace gegangen und hast dir diese Fünf Fische gekauft zum Quest abgeben. Davor hast du sie allerdings wieder in den Marketplace reingesetzt. Also hast du sie aus dem Marketplace gekauft, hast sie in den Marketplace reingesetzt. Normalerweise sollten die dann aus deinem Inventar verschwinden, sind sie wohl auch. Allerdings intern irgendwie nicht. Dann bist du zum Quest Board gegangen und dann hatte ich das Quest Board quasi die Fische abgezogen, die du eigentlich gar nicht mehr hattest. Du hattest die XP gegeben und du konntest zum Marketplace zurück und deine Fische im Auktionshaus cancelen und du hast sie wieder gehabt. Du konntest quasi so unendlich XP Farmen. Es war auch bester Back. So fail, es ist so fail. Du konntest übrigens, also du konntest glaube ich sogar Items dupen, aber Gold auf jeden Fall und das war irgendein Trading Bug. Also es gab zwei Gold Duplication Bugs. Du konntest einmal mit dem Character Transfer dupen, also du konntest quasi irgendwie deinen Character. Du konntest irgendwie, wie gesagt, nachdem ich selbst nicht spiele, ich kenne sowas wie, du konntest irgendwie Character Transfer machen und vorher dein Geld traden. Und dann hast du es nach dem Character Transfer wieder gehabt auf dem neuen Server und konntest zurück transferen, das Gold war verdoppelt. Oder aber du konntest auch über das Trade Window irgendwas buggen. Also das Geld, dass du das Geld wieder bekommen hast. Also es war richtig broken as fuck. Es ist jeden Tag Outpost Rush, es ist immer noch so, dass die Leute gebannt werden, weil sie reported werden. Das funktioniert ja nicht, selbst das funktioniert ja nicht. Das funktioniert ja nicht mit den Bands. Was sagt der Chat, was man kann Bands umgehen, indem man einfach seine E-Mail ändert? Was? Aber echt äußerst amateurhaft, wenn das wirklich funktioniert. Was wollte ich jetzt gerade sagen? Fuck, was hat er gesagt? Achso, das funktioniert ja auch nicht. Die können ja gar nicht richtig nachvollziehen, wer das gemacht hat. Man muss sich mal vorstellen, das ist auch relativ schwierig. Erstens sind die bekannt dafür, falsche Leute zu bannen, weil unfähig. Und die Leute, die Gold gedupt haben, die haben ja Gold verschickt per Ingame Post und Marketplace und sonst was. Selbst wenn du das tracken kannst, was willst du machen? Willst du jede Ingame Transaction rückgängig machen der letzten zwei Wochen? Was latest player kann anbann? Wirklich? Das kann ich mir nicht vorstellen. Players kann anbann? Haha, was? Wait a minute. Was? It appears that Steam Family Sharing allows a player to evade a ban and create a new account. The same key? But it gets worse. Apparently all it takes to get around a ban is just changing the email address as... Hä? Moment, ich muss mein Steam-Account-Email-Adresse ändern, dann bin ich unbanned? Benutzen die das irgendwie als Identifier oder wie? Kein eindeutig... Ach Gott, die sind so krass unfähig. Wie kann man so unfähig sein? Ich verstehs nicht. Ich mein, das sind doch keine Kacknoobs. Wie kriegen die sowas hin? Warum? Okay, gucken wir mal erst mal weiter. Are issuing fans. The final issue is pretty severe. Players discovered sharing the game with yourself via Steam's Family Share System or changing the email of your Steam account will actually let you to continue to play the game if you've been banned. Again, the developers are working on a fix for this, but this is a massive issue as it will allow exploiters and cheaters to get back into the game. Wetten? Die können dich dann auch nicht richtig tracken, wenn du deine E-Mail-Adresse änderst. Also mal angenommen, du hast Gold gedupt as fuck und du änderst deine E-Mail-Adresse und da können sie dich gar nicht richtig tracken, würd mich nicht wundern. Having such a rough week, the devs are releasing a blog post outlining all the progress that they've made on these bugs. What actions they're taking next and they highlighted some engine issues. You can expect some significant updates in the next few weeks that iron out a lot of the problems. The critical consensus is in on Call of Duty Vanguard. Reviewers are saying the game is a decent outing for the franchise, but that it serves as more of a stopgap between Cold War and the next Modern Warfare game than as a standout title. Before the game was officially revealed, leaks suggested Vanguard was a rush job throwing together COD World War II's assets with Modern Warfare's mechanics. And while those rumors never held much weight, it's clear that this year's title only makes minor iterations on the template that Modern Warfare established. Ach nee, Call of Duty macht jedes Jahr minor iterations. Guckt euch mal FIFA an, FIFA macht auch jedes Jahr nur minor iterations. Das ist ja mittlerweile Geschäftsmodell bei vielen Serien geworden. Dass die jedes Jahr oder wenn es sowas ist, was halt mehrere Jahre noch, die machen immer nur minor iterations. Die gehen null Risiko ein, das ist immer der gleiche Scheiß. Deswegen ist das auch so ausgelutschter Scheiß mittlerweile alles. Und es gibt nur noch Serien. Ich meine, an sich finde ich es eigentlich ganz cool, muss ich sagen. Also ich hätte echt keine Probleme, wenn es einen ganz guten World War II Shooter geben würde, echt keinen Schmerz mit. Das Problem, warum ich es mir nicht kaufen werde, ist schlicht und ergreifend die Kombination. Es ist Call of Duty und es hat quasi Public Skill-Base Matchmaking. Gegen Skill-Base Matchmaking im Ranked habe ich ja nichts. Ranked ohne Skill-Base Matchmaking funktioniert ja logischerweise nicht, da wäre es nicht ranked. Das Bettopfer ist am Start. Danke für den Prime-Sub. Dann kann man aber wenigstens einen Schwanzvergleich machen mit seinem Rank. Aber Public Skill-Base Matchmaking ist einfach der größte Scheiß, der jemals erfunden wurde, wo ich keine Lust darauf habe, das zu spielen. Ein sehr diverser Cast an Charakters. Das muss heutzutage so sein. Danke schön für den Sub. CD sagt, Activision ist der Multiplayer von Cod egal, den geht es nur um Warzone-Integration. Na wenn denen den Multiplayer egal wäre, dann hätte... Also wenn die sich nicht versprechen würden von dem Multiplayer, dann würden die Multiplayer schlicht und ergreifend nicht machen. Das heißt, sie müssen damit irgendwas bezwecken. Ja, natürlich, du hast recht, es ist sicherlich auch um Warzone-Verkäufe bzw. Warzone, was ich unlocks, wie auch immer, irgendwas anzuheizen. Aber ganz so einfach kann es nicht sein. Es gibt sicherlich eine große Anzahl von Call of Duty-Fans, die mit Warzone nichts großartig anfangen können und die Multiplayer spielen wollen. Also ganz so einfach ist es nicht. Und dann gibt es auch kein Skill-Best-Making, also dann könnten sie auch Skill-Best-Making sparen und sowas, wenn sie da nichts reinstecken wollen. Das ist ganz gezielt drinnen, dass die Leute, dass so diese... Ach, ich lock mich einmal die Woche für zwei Stunden abends ein, was weiß ich, wenn meine Kinder beim Fußball spielen und meine Frau irgendwie auf dem Elternabend ist, dann lock ich mich mal zwei Stunden ein und spiele eine Runde Vanguard. So Leute sind das, die nur für die Skill-Best-Making gemacht sind. Aber auf! Also ich will nicht wissen, was da bei Blizzard intern los sein muss, was Overwatch angeht. Man darf nicht vergessen, das haben die angekündigt, ich glaube 2018 oder so. Und seitdem ist ja auch der Content für Overwatch 1 quasi nicht vorhanden. Also da kommt ab und zu mal eine Deathmatch-Map oder so. Die letzten Jahre ist in Overwatch nichts passiert, gar nichts. Sowohl lore-technisch kam... na gut, da kamen wir jetzt ab zu meinem Comic oder irgendwas das Unbedeutendes, aber in-game Content mit gar nichts, gar nichts. So. Und ich gehe davon aus, die wollten das schon in nächster Zeit releasen, aber aus irgendwelchen Gründen haben sie sich umorientiert, was es werden soll. Jeff Kaplan ist nicht ohne Grund weg und ich habe keinerlei Hoffnung für Overwatch 2. Null. Hast du mitbekommen, dass McCree unbenannt wird? Ja, McCree ist doch schon unbenannt worden. Da ist jetzt, wie heißt er, ich glaube Cassidy Cole, Cassidy oder? Nee. Cassidy, Cassidy Cole, Cassidy, irgendwas Cassidy, irgendwas. Ich weiß nicht, wie McCree jetzt heißt, aber da muss ich sagen, das haben die total, insofern schon taktisch gut, hatten ein gutes Setup. Wie heißt McCree jetzt? McCree, Cassidy, heißt jetzt Cole, Cassidy, so rum. Das haben die ganz gut set-up, weil in einem der ursprünglichen lore Videos oder was es war, wurde ja schon quasi gesagt, dass McCree quasi nicht sein echter Name ist, was man ja sich auch denken könnte. Aber das haben sie insofern ganz gut integriert. Der Grund, warum er McCree unbenannt wurde, ja, an sich hätte ich ja gar keine Schmerzen mit, ich finde es auch nicht schlecht. Aber es ist so eine typische Blizzard-Geschichte, so nach dem Motto, Welt seht her, wir kümmern uns um die Probleme und Wirklichkeit benennen wir halt bloß einen Character um, ohne dass sich irgendwie nennenswert bei Blizzard was ändert. Blizzard hat überhaupt kein Interesse daran, dass da irgendwas aufgearbeitet, irgendwas geändert wird, solange der Hubel rollt im Endeffekt. Ja, ist weg. Was ich lustig finde, weil der ehemalige Blizzard-Chef ist ja quasi erst vor ein paar Monaten abgedankt, jetzt ist die neue Blizzard-Chefin abgedankt, aber mal gucken was jetzt kommt, wahrscheinlich kommt jetzt irgendein Activision Stonks Anzug an und es wird nicht besser. Blizzard ist das beste Beispiel für, was passiert, wenn aus, wir machen Spiele, die wir selbst gerne spielen würden, zu, also Blizzard kommt von, wir machen Spiele, die wir selbst gerne spielen würden oder die uns selbst Spaß machen, wir machen Spiele so, wie wir sie selbst mögen würden, hin zu, wir haben irgendwelche Stonks-Leute im Anzug ohne Ahnung von Spielen als Chefs. Blizzard ist das beste Beispiel für diese Entwicklung. Anders kann man es auch nicht erklären. Das hat angefangen mit, im Endeffekt schon während dem ersten Overwatch, das hat eigentlich schon angefangen mit StarCraft 2. Es war absehbar, dass es berg runter ging. Ohne WoW wäre Blizzard gefühlt dead, gut das ist ja schon lange so, World of Warcraft ist ja quasi das Ding von Blizzard schlechthin gewesen oder ist es glaube ich immer noch, wobei man sagen muss, Blizzard hat auch andere Dinge, gerade Hearthstone es schafft auch gut, scheffelt auch gut Kohle. Wen? What the fuck, was war das? Moment, es ist Golf, okay das habe ich verstanden, aber was war das für ein Golftyp? Warum ist das irgendein Typ in der Wüstenkammer, der Golf spielt? Was? Golf mit Killstreaks? Was ist das? Ist das der Battlefield 4 Sniper? Weiß nicht. Mal gucken wie der Battlefield 4 Sniper aussieht. Das hat tatsächlich gewisse Ähnlichkeiten zum Battlefield 4 Sniper, aber das ist er nicht. Das ist der Battlefield 4 Sniper Leute, das ist der Battlefield 4 Sniper. Warum ist der Battlefield 4 Sniper in einem Golfspiel? Guck mal, das ist der Battlefield 4 Sniper. Warum ist der Battlefield 4 Sniper in einem Golfspiel? Alles verlaufen. Das ist ja auch so eine Shitshow gewesen, meine Güte, ich glaube das ist eines der schlecht bewerteten Spiele der Zeit gewesen. Hast du der Edge of Empires 4 gespielt? Nein, aber ich habe 500 Stunden oder so in dem Teil davor, in den Teilen davor. Ich muss mir das unbedingt noch kaufen. Juckt mich null. Juckt mich ja mal sowas von mich. Ist mir sowas von egal. Bozza! Am Start. Bozza am Start. Ist mir auch vollkommen egal. Sowas von egal. Wirklich? Zack, Zack, Twitch, Splitgate? Na ja. Hype, hältschen Grenzen. Muss ich jetzt nicht unbedingt direkt auf die Spielerzahlen auswirken, aber meistens sind Streams ein ganz guter Indikator für. Ist halt auch 10 Uhr morgens. Na ja, bei uns. Twitch ist ja weltweit. Irgendwie erinnert mich das trotzdem ein bisschen an Halo. Wer hätte das gedacht, dass es schwierig ist gerade an CPUs zu kommen? Es ist so ziemlich schwierig an alles zu kommen gerade in dieser Richtung. Wir gucken mal. Tatsächlich. Das gucken wir mal kurz, Zack. Splitgate Steam Stats. Lasst mal kurz schauen. Also den Mega-Hype konnten sie nicht halten. Sagen wir mal so, innerhalb von vier Monaten sind sie halt runter von 67.000 Spieler auf 5.000. Wobei das nicht schlecht ist, muss man sagen. Also 5.000 Peak-Spieler im Steam-Vergleich ist gar nicht mal so schlecht. Guck mal hier. Also ich meine, da bist du schon unter Top 100 oder so mit 5.000 Spielern. Das ist gar nicht mal so mies. Es ist alles auf Short-Supply. Leute, ich will mir seit Jahren neuen PC kaufen, kannst du vergessen. Mein PC ist jetzt vier Jahre alt, ziemlich genau. Was ich bei den Apex Waffen immer lustig finde ist, mich erinnern manche Waffen in Apex wie zum Beispiel dieses Ding voll an Borderlands Waffen. Guckt euch mal das an. Das Ding. Das könnte original aus Borderlands kommen, oder? Ohne Scheiß. Das könnte original Borderlands Random Drop Waffe sein. Ich habe auch eine 1080 Ti. Ja, drei Stücke. Zumal man ja auch mal sagen muss, der Unterschied ist gar nicht so riesig groß. Ich meine 60% oder irgendwie sowas. Aber meiner ist ja übertaktet. Also guck mal, es hält sich wirklich in Grenzen. Single-Core-Performance 64% schneller. Wenn ich meinen übertakte, sind das keine Ahnung, vielleicht 15%, wo das Ding noch schneller ist. Also ab 8-Coren wird es natürlich mehr, weil meiner hat bloß 6 Kerne. Also der Witz ist halt, mein 8700K ein bisschen übertaktet ist im Prinzip auch nur 15-20% langsamer als die aktuelle Top-CPU. Ja gut, dann nehmen wir den anderen. Was haben wir denn sonst noch hier zu bieten? Sag mir eine sinnvolle, die Seite ist scheiße. Ja ok, dann sag mir eine andere Seite, wo man das gut vergleichen kann. Hier, Worth It. Übertaktens-Stream haben wir doch damals gemacht. Wir haben das doch live hier im Stream mit Elgato-Capture-Karte noch übertaktet, mein Rechner. Dann habe ich ihn geköpft und dann ging es ab. Da habe ich meine Zweifel. Da habe ich meine Zweifel, ob das wirklich so ist. Also mich würden da schon ordentliche Benchmark-Vergleiche interessieren. Also das mit 20-30% halte ich tatsächlich für realistisch. Hat sich da in den letzten Jahren nicht so wahnsinnig viel getan. Müssen wir mal gucken. Zumindest hat es eh keinen Sinn, weil ich kaufe mir jetzt keinen neuen Rechner. Warum sollte ich mir ausgerechnet jetzt einen neuen Rechner kaufen? Ich brauche ja eine neue Grafikkarte. Und was kostet mich aktuell eine 3090? Zumal ich auch keine 3090 eigentlich mehr kaufen will. Oh, der Preis-Champ ist abgeschissen. Für 6. Danke schön für den Sub. Was kostet so eine 3090? 2000 Euro? Das ist ja Wahnsinn. Alter, nicht normal. Was los Rosario? Selten so einen schlechten Tag gehabt wie Freitag. Oh, Pains-Champ. 1&1 hat Merch-Konflikte ausgelöst. Was? Wie schafft es denn 1&1 Merch-Konflikte auszulösen? Also man kann sich über den Provider sicherlich öfters beschweren, aber was hat dein Provider mit Merch-Konflikten zu tun? Das verstehe ich nicht. Das musst du mir etwas genauer erklären. Das checke ich nicht. Der Pi kam an, aber fehlte ein Kabel, fiel es Batman. Am Samstag noch Uni. Was hat 1&1 mit Merch-Konflikten zu tun? Es lohnt sich nicht wirklich. Du bist Consultant für die 1&1 Backendsoftware? Okay, dann ergibt das natürlich Sinn. Pains-Champ. Dann ist es natürlich doof. Dann verstehe ich auch, wie das Merch-Konflikt auslösen kann. Obwohl die meisten Merch-Konflikte gar nicht so wild sind. Zumindest bei mir oder bei uns. Aber es kommt natürlich immer darauf an, von welchem Umfang man hier spricht. Fertig PCS, okay. Drei Wochen Arbeit von Arsch gewesen. Massive Pains-Champ. Das ist ja am Preis-Champ echt ganz gut. Man sieht die Preisentwicklung von drei Monaten. Leider habe ich dieses mit dem ein Jahr auf drei Monate gestellt. Das ist ein Bug. Und ich habe keinen Bock, das zu fixen. Guck mal, ein Jahr und drei Monate ist das gleiche. Es geht sieben Tage, drei Monate, ein Jahr ist dann das gleiche. Das ist broken. Das ist ein Feature, genau. Aber das hier ist eigentlich der UVP. Wann gibt es denn den Nachfolger? Nvidia, was ist denn das dann? 4090? Insider Rechnen mit enormem Stromverbrauch. Ja, das Zeug verbraucht immer viel. Sommer 2022 und möglicher Release im Oktober. Oh, oh. 550 Watt. Na, abwarten, abwarten. Ich kaufe mir keinen neuen Rechner. Wisst ihr, dass es das erste Mal ist, dass ich in so einer Situation bin, wie es hier gab? Diese Situation, wie jetzt, gab es noch nie. Also bisher war es eigentlich so, dass ich mir immer gedacht habe, hey, ich könnte mir immer wieder einen neuen Rechner kaufen. Da war ich entweder zu faul für, zu faul zum Umstellen, zu faul zum Zusammenstellen. Und irgendwann dachte ich, jetzt wird es aber doch mal Zeit. Dann habe ich geguckt, was es gibt und habe mir dann eingekauft. Und jetzt ist es so, jetzt stelle ich fest, okay, ich kann mir gar keinen kaufen und ich hoffe einfach nur, dass meiner noch eine Weile hält. Obwohl er halt schon vier Jahre alt ist. Es gibt ja keine Möglichkeit aktuell, sich einen ordentlichen Rechner zu kaufen, so richtig. Weil wenn, wenn will ich halt auch was ordentliches und was ordentliches heißt bei mir einfach seit ein paar Jahren so mehr oder weniger das schnellste, was es gibt. Und ich sehe es halt nicht ein, 3000 Euro zu bezahlen für eine Grafikkarte. Ja, das ist halt, das ist halt dumm. Deswegen hoffe ich ja auch, meiner tut es noch eine Weile. Nee, ich will, also eigentlich hatte ich ja letztes Jahr schon vor mir einen Ryzen PC, also ich hatte schon vor zwei Jahren vor mir einen Ryzen PC zu bauen. Dann habe ich gedacht, man holt sich die 5000er Serie und dann ging das eigentlich alles downhill. Ach mal gucken, aktuell tut das ja und man muss ja auch sagen, die Kombination aus 8700K und 1080T ist ja vollkommen ausreichend. Ich stelle Battlefield einfach auf niedrige Details und auf geht's 120 FPS. Denkst du das nächste Battlefield Spiel spielt wieder in der Vergangenheit? Ich warte jetzt erstmal bis es aktuell rauskommt, was das nächste macht, keine Ahnung. Ich persönlich fände es ja gut, wenn das in einem halbwegs guten Zustand Spaß spielbar ist, dass sie Battlefield 2042 einfach mal 3-4 Jahre supporten. Apropos, ach ja hier sind es die Leaks zu Battlefield 2042. Wäre gespannt, ich habe sogar in der Beta 120 FPS teilweise erreicht und die lief beschissen. Hallo, was ist mit Reddit los? Was ist mit Reddit los? Zack, old. Was auch immer die da machen. Hä? Was habe ich falsch gemacht? So. I got Battlefield 2042 early. Wie hat er das? Fake oder? Also wenn das das einzige ist, was er gepostet hat, das ist doch Fake. Ich meine, das kann durchaus aus dem Game sein, aber das könnte durchaus aus dem Spiel sein. Gibt auch Videos, wo gibt es da noch Sachen von ihm? Ich habe keine NDA dafür unterschrieben. Ich schweige denn für für Reddit Leaks. Hat er da noch irgendwas dazu geschrieben oder? I'm in. Das sieht sehr, sehr echt aus. Aber warum kann er schon spielen? Ich meine, die Server dürften noch gar nicht da sein. Warproof Classic Battlefield 3. Der ist tatsächlich schon am Start. Der spielt mit gar keinem anscheinend. Gibt es einen Server Browser? Sieht man das Main Menu irgendwo? Xbox. Well, I've been kicked out. Browse. Ja, na ja, Moment. Das ist für das ist für Portal, dass Portal ein Server Browser hat. Das war ja klar. Ich rede vom normalen Battlefield. Ja, das ist legit. Gehe ich ganz stark davon aus. Das ist legit. Allerdings so wirklich viel sehen tut man jetzt ja nicht. Warum man schon spielen kann, ist natürlich die große Frage. Warum die Server schon da sind, ist eine gute Frage. Na ja, wahrscheinlich, weil sie selbst noch testen wollen. Warum das nicht irgendwie gesichert ist? Ach, keine Ahnung. Du kannst es ja nicht starten, wenn du preloaded hast normalerweise. Na ja, so wirklich viel spannendes ist jetzt ja nicht zu sehen. Was hältst du von unrate Abstand? Nicht, dass es schlecht wäre oder so. Ich habe damit noch nichts gemacht. Ich wüsste doch nicht, wofür. Na ja, ist jetzt recht unspektakulär. Aber wo der eine Typ auf Reddit recht hatte, ist, dass es jetzt 30 Milliarden Leak Videos geben wird. Na ja, egal, es ist in einer Woche, wissen wir es. Er hat ein paar Fragen beantwortet, okay. Schauen wir mal schnell. Und jetzt hier. Es spielt an Xbox. Das stimmt ja nicht. Na gut, es hält sich sehr in Grenzen. Egal. Warum kommen wir weiter? Auch hier werden MikroTik-Switch empfohlen. Zeigt mal her, ob ich da zustimmen kann. Ja, der ist tatsächlich ganz gut, aber ich würde eher noch einen nehmen. Wobei, worum ging es denn überhaupt? Ein paar, was? Kann mir einer Empfehlung geben für Max, für einen, was ist denn ein Max-Port-Switch? Du willst, ach so acht Ports. Acht Ports-Switch-Management plus PoE. Okay, plus PoE ist das Problem, weil ohne PoE hätte ich dir den hier empfohlen. Moment. Ohne PoE hätte ich dir den hier empfohlen, wobei ich mir gar nicht sehe, wer hat der PoE? Ich glaube, der hat keinen PoE. Hätte ich dir den hier empfohlen, weil das ist eigentlich preis-leistungsmäßig so ziemlich der beste Switch, den du gerade kaufen kannst. Acht Ports Gigabit, zwei Ports SFP plus zehn Gigabit, aber ich glaube, der hat keinen PoE. Nein, der hat keinen PoE. Ja, mit PoE muss man, dann wüsste ich jetzt nichts. In der Richtung. Wann kann man den Gram nicht irgendwie filtern? Nach PoE oder nicht PoE? Ich will nicht PoE in, ich will PoE out. PoE in brauche ich nicht, ich brauche PoE out. PoE, PoE. PoE. Aber das, also ich würde halt einen nehmen mit Gigabit 10G, mindestens mal mit 10G, alles andere sack doch. In der heutigen Zeit. Das hier macht einen ganz guten Eindruck, 24 Ports, viermal SFP plus, 397 Euro, krasse, doch eigentlich nice. Aber es sind mehr Ports, wie du willst. Ja ne, da fällt mir nichts gescheites ein, was passt. Stonks, der hat eindeutig zu wenig Geld, da brauchen wir. Was ist denn Passive PoE? Oh, wahrscheinlich irgendwie. Irgendwas, was Mikrotik da treibt, entweder 24 Volt, 48 Volt, ach, kein Schimmer. PoE Standards Null. Aber wofür 10G im Home Bereich, die Frage ist hier, warum kein 10G? Vor allem, wenn man sich jetzt einen neuen Switch kauft. Zumindest mal zwei 10G Ports sind relativ günstig und man hat die Möglichkeit, damit halt was zu machen, wenn man will, kann es ja auch sein lassen. Aber, also heute, warum? Also gerade wenn es ein Switch ist hier für Zentrale am Schreibtisch oder so, ich würde mir eigentlich nichts mehr holen, ohne 10G. Mindestens zwei 10G Ports. Sogar der Switch auf meinem Basteltisch hat zwei mal 10G Ports. Jo, ok, gucken wir mal weiter, was haben wir sonst noch schönes zu gucken? Der Lockpicking Lawyer ist am Start. Ja, den Vanguard Test von der GameStar wollte ich mir noch angucken, ob sich das Spiel in irgendeiner Art und Weise lohnt. Mal gucken, wer den Test spricht. Je nachdem, behalte ich mir vor, das Anzug zu brechen. Mal gucken. Ah, ist das Dimitri? Ist das Dimitri? Ich weiß es nicht. Wer ist das? Nein, das ist nicht Dimitri, das ist Christian Fritz Schneider. Alles klar. Ach, das ist nicht der mit dem Bart, der aussieht wie von Vikings. Ach, das läuft ein bisschen doppelt. So, gucken wir uns jetzt mal an. Ich muss das anders machen mit dem Sound, so hört sich das richtig kacke an. Ich muss gerade mal re-loaden. ... in Berlin auf einer Geheimmission unterwegs ist, ziemlich konstruiert und bei der Zusammensetzung der Gruppe sogar regelrecht anbiedernd wirkte. Und so irre weit hergeholt wäre so ein Vorwurf vielleicht auch gar nicht. Schließlich freuen sich die Entwicklerinnen... Zusammensetzung der Gruppe relativ anbiedernd. Möchte er damit umschreiben, dass das quasi besonders divers sein muss, weil es so einen Shitstorm gibt? Das ist ja auch garantiert so wäre. Wir haben Videos unverhohlen darüber, dass der Zweite Weltkrieg ja zum Glück an so vielen tollen diversen Schauplätzen stattfand. Der Grad der Geschmacklosigkeit hat da also schon längst einen neuen Höchststand erreicht, aber ich will hier nicht die Moraleposte spielen. Ich habe schließlich auch jedes Jahr Spaß an den Ballerbuden von Activision und ich habe auch kein Problem damit am Computer Krieg zu spielen, weil ich den Unterschied zwischen Fiktion und Realität kenne. Ja, aber ist die Lautstärke irgendwie merkwürdig? Am Anfang viel lauter und jetzt leiser? Nee, das geht jetzt. Denn selbst in dem einzigen längeren Abschnitt, der vor Release zu sehen war, nämlich ein Level in Stalingrad, wirkten die Szenen manchmal noch merkwürdig unfertig. Hier fehlt zum Beispiel die halbe Beleuchtung. Das wundert mich nicht, es wird auch nie im Leben wieder gepatcht. Moment, das ist aber Vorschau, das ist Vorschau gewesen. Was ist das jetzt? MonkaS? Dieses Video wird präsentiert. Nein, jetzt fangen die auch schon damit an. ...von... ...die Kampagne... Doch meine Sorge war über weite Strecken unbegründet. Die Kampagne von Call of Duty ist ein solides Blockbuster-Erlebnis mit viel Abwechslung. Ja, das wäre ich jetzt auch vorausgegangen. ...figuren und guter Technik. Sogar die Schatten haben es noch nach Stalingrad geschafft. Es ist ganz schön gutes Wetter in Stalingrad, oder? Chat. Also das hat ja gerade einer geschrieben, aber... ...es ist schon erstaunlich gutes Wetter. ...und verglichen mit dem fast schon experimentellen Cold War vom letzten Jahr, das sich ja über weite Strecken... Cold War! Ich hab ganz ehrlich, ich glaub die Multiplayer hab ich gar nicht gespielt oder ganz kurz nur gespielt. Ich wollte eigentlich die Black Ops Kampagne mir angucken und ich muss sagen, die hat echt viel verschenktes Potential gehabt. Die Ansätze waren echt da, aber die haben viel verschenktes Potential gehabt in der Kampagne. ...er wie ein Agentenzriller spielte... Ich find immer noch, die beste Call of Duty Kampagne ist für mich also die drei. Sagen wir mal die Top 3. Die Top 3 Kampagnen sind für mich immer noch Black Ops 1, CoD 4 und MW2. Ich bin da sonst nix mal rangekommen. Also MW2, der Modern Warfare Reboot der war schon zu... der Call of Duty war immer scriptet, aber da hast du schon zu wenig gespielt. Das war ja quasi nur noch fast auf Schienen. Also nee, das hat mir nicht so gut gefallen. Wer kauft Call of Duty für die Story? Relativ viele Leute, weil sonst würden sie keine Story machen. Aber auf den Außenabschnitten kann sich Vanguard sehen lassen. Die Wüstenlandschaft von Tobruk sieht dank Photogrammetrietechnik umwerfend aus. Die Luftschlacht von Midway ist ein gewaltiges Spektakel. Ja, aber wahrscheinlich typisch Call of Duty mäßig absolut sinnloses, anspruchsloses, entweder Quicktime Event oder was man eigentlich gar nicht verkaufen kann. Ich sag's euch, das ist so ein Ding, wo du eigentlich nur 2 cm links und rechts scheuern kannst und der Rest passiert wahrscheinlich automatisch. Das wird wahrscheinlich wirklich Noob Scheiß hoch 3 sein. Die Luftschlacht von Midway ist ein gewaltiges Spektakel und selbst der Gang durch den Flugzeugträger ist ein Augenschmaus. Besonders eindrucksvoll sind dabei diesmal die Lichtstimmungen und allgemein der Einsatz von Beleuchtung. Vanguard ist sicherlich einer der ästhetisch interessantesten Serienteile. Und auch der Soundtrack, oder besser gesagt, der dynamische Score sticht gerade in der ersten Spielhälfte deutlich hervor. Erste Spielhälfte heißt in der Call of Duty Kampagne 1,5 Stunden oder so. Ungefähr ist das die erste Spielhälfte. Wahrscheinlich also 3 Stunden Kampagne oder sowas. Klingt aber wirklich ganz nett, der Score. Willst du ernsthaft den League Arcane Launch verpassen? Ja. Ich spiel kein Loll. Telefonmast. Bei all dem Hass und der grundsätzlichen Ablehnung, die den Call of Duty Kampagnen oft entgegenschlägt, muss auch mal gesagt werden, dass es diese Art von Hollywood-artiger Bombastunterhaltung abseits von Call of Duty eigentlich gar nicht mehr gibt. Da hat er nicht unrecht, ja. Alle anderen Mitbewerber haben diese Art von Popcornunterhaltung ja längst aufgegeben oder müssen sie aus finanziellen Gründen auf einer deutlich kleineren Flamme köcheln. Von daher freue ich mich jedes Jahr auf eine neue Dosis Call of Duty Kampagne. Aber genau da beginnt das Problem von Call of Duty Vanguard. Denn auch beim Publisher Activision geht man wohl davon aus... Es ist wirklich gutes Wetter in Stalingrad, muss man mal sagen. ...jedes Jahr super verkauft. Also kann man ja einfach mal das machen, was so viele Filmstudios... Das ist halt so dieses Call of Duty Ding, das fand ich schon immer kacke. Sie können ja Schlachten und Inszenierung gut, aber diese Camps, die wirken immer so dermaßen statisch und gewollt und nicht gekonnt. Du siehst, jeder Soldat hat nur zwei Animationen, es passiert gar nichts. Wir sollten die einfach weglassen. Und was auch die Call of Duty Serie hier schon mal ausprobiert hat, nämlich eine neue Marke zu etablieren. Bei Modern Warfare oder... Übrigens, Fun Fact, weil ich gerade seinen Namen sehe hier. Efril Fehnbroff. Wusstet ihr, dass man den Tennisspieler Roger Federer, oder Federer, wie spricht man aus, Roger Federer, dass die Hälfte seines Namens auf der Kampagne, dass die Hälfte seines Namens aus ER besteht? Verlegt euch das mal. Die Hälfte des Namens besteht aus ER. Gut, dass ich das jetzt mal erwähnt habe. Auch die Call of Duty Serie hier schon mal ausprobiert hat, nämlich eine neue Marke zu etablieren. Bei Modern Warfare oder Black Ops hat das innerhalb des Call of Duty Universums funktioniert. Bei Call of Duty Ghosts... Oh Gott, Ghosts! ...mit der Idee auf die Nase gefallen. Denn im Unterschied zu Modern Warfare 1 und Black Ops 1, die zunächst als Standalone-Spiele entwickelt wurden und auch so funktionierten, also ein abgeschlossenes Erlebnisboten, das mit den Fortsetzungen nur ausgebaut wurde, setzte Ghosts gleich auf ein Cliffhanger-Ende... Ja, das war kacke. ...und fühlte sich dadurch schon ziemlich unbefriedigend an. Warte mal, war Ghosts das mit Kevin Spacey? Nee, was war das? Nee, das war Advanced Warfare, ne? Ghosts war das mit Jon Snow. Oder? Oder bitte bringe ich... Nee. Warte mal. Nein, Infinite Warfare war das mit Jon Snow. Und Advanced Warfare war das mit Kevin Spacey? Wer war denn der Typ in Ghosts? Ach, Ghosts war mit dem Hund, genau! Mit dem Hund, der Door-Preachers machen konnte. Stimmt, genau. Und genau das macht Call of Duty Vanguard jetzt auch. Doch während bei Ghosts vor dem Abspann immerhin noch eines der spektakulärsten Finale der ganzen Serie abgefeuert wurde, als der Kampf im Weltraum begann, über eine Panzerschlacht in der Wüste reichte und schließlich in einer Magnetschwebebahn endete, gibt's bei Vanguard am Ende nur eine für Call of Duty-Verhältnisse eher unspektakuläre Standardballerei. Danach heißt es dann, hey, die wirklich tollen Sachen erzählen wir dann im Zombie-Modus oder in einem Multiplayer-Update oder in einer möglichen Fortsetzung, die ihr doch eh alle kaufen werdet, oder? Ja, da hat er nicht unrecht. Ja. Da sieht man aber auch, dass diese Spiele halt nicht gemacht werden von Leuten, also... Wobei, das will ich Ihnen gar nicht absprechen, dass vielleicht die einzelnen Programmierer und Entwickler daran wirklich da noch ihre Liebe reinstecken, ja. Aber dass das Gesamt-Ding einfach Massenware ohne... Wie soll man sagen? Ohne... Ohne Tiefgang... ...ist. Das trifft, glaube ich, ganz gut. Weil die denken sich, hey, warum sollte ich da noch jemals wieder was dran machen, wenn's nicht rund ist? Ich mach einfach nächstes Jahr das nächste. Vanguard auch an. Wir erleben hier zwar durchaus die Origin-Geschichten der einzelnen Teammitglieder in Rückblenden, aber wir bekommen nicht mal die Origin-Story des ganzen Teams an sich. Wie hat sich diese Truppe zusammengefunden? Ja. Keine Ahnung. Dabei ist gerade das Zusammenspiel der Helden durchaus eine Stärke von Vanguard, auch wenn wir es außerhalb von vorgerenderten Zwischensequenzen kaum zu sehen bekommen. Die sehen übrigens echt toll aus, also die CGI-Sequenzen. Bisschen schade, dass sie nicht mit 60 FPS laufen, weil sie dadurch im Vergleich zum Gameplay etwas ruckelig wirken. Warum nicht? Warum kriegt man das bis heute nicht hin, zwischen... Ist das Captain Price im Zweiten Weltkrieg, oder was ist das, wenn's fertig ist? Das sieht fast aus wie Captain Price, Alter. Also auch bombardiert, das sieht cinematischer aus. Aber 30 FPS, ich meine, die könnten den Scheiß da ohne Probleme mit 60 FPS rendern. Gut, ich meine, das Spiel hat jetzt schon wahrscheinlich 30 FPS, oder so. Ja, und? Es ist ja nicht so, als hätten die in irgendeiner... Captain Eagle. Es ist doch jetzt nicht so, als hätten die irgendwie Zeitbegrenzung damit. Quatsch, das könnten sie auch. Das könnten die auch in 60 FPS rendern. Und Leute, die könnten einfach auch post-processing oder hochrechnen. Das hab ich auch gemacht mit Handyvideos, die ich aufgenommen hab, bei mir auf dem Rechner. Und das sieht auch brauchbar aus. Aber am besten ist natürlich direkt mit 60 FPS rendern. Und das können die auch machen. Ruckelig, ja. Die Vision ist hervorragend. Da könnte man einen eigenen kompletten Renderfilm draus machen. Aber zurück zum Thema. Call of Duty Vengard erinnert mit so einem Fortsetzung folgt Ansatz an die ganzen gescheitersten... Exquisite Musik hier. ...Versuche im Kino in den letzten 20 Jahren von Jumper über Ich bin Nummer 4 bis zum Die Mumie-Film mit Tom Cruise, der eigentlich das Dark Universe hätte kickstarten sollen... Der was? Was für ein Dark Universe? Das soll jetzt zwar nicht heißen, dass Vengard dasselbe Schicksal nicht hätte, aber weil es aus derselben Arroganz heraus entwickelt wurde, nämlich aus der Idee heraus, dass man für eine Serie nicht erst mal mit einem richtig guten ersten Teil loslegen muss, sondern einfach gleich auf die Fortsetzung vertrösten kann. Jetzt hab ich aber eingangs gesagt, dass Vengard ein solides Blockbuster-Erlebnis bietet und meine Sorge um das Spiel größtenteils unbegründet war. Wie passt das also mit... Erst mal stealthen, aber dann durch die Zäune fahren. Über das Ende oder, sagen wir besser... Die stealthen gar nicht. Und die Antwort liegt tatsächlich in diesem letzten Drittel. Das sind so Anzeigen, die mir bei Call of Duty immer auf den Sack gehen. F zum Aussteigen drücken. Wenn das quasi normal in das Spiel integriert wäre, dass du öfters mal in Autos reingehst und rausgehst, dann wüsstest du, dass du F zum Aussteigen drücken musst. Aber nachdem das wahrscheinlich nur einmal vorkommt für diese Quicktime-Sequenz, ist das so dumm. F zum Aussteigen, nicht für Respekt. Jetzt pressen wir F zum Aussteigen. Und die Antwort liegt tatsächlich in diesem letzten Drittel, wenn klar wird, dass da nicht mehr mehr kommt und dass Vengard zudem auch noch unter denselben Problemen wie Cold War leidet. Cold War fehlte für seine zahlreichen neuen Ideen und Ansätze, nämlich vorne und hinten, die Zeit. Das Spiel hätte doppelt oder dreimal so lang sein müssen, damit sich die Elemente wirklich hätten behalten können. So toll die Neuerungen auch waren. Und so ist es bei Vengard jetzt auch, dass ja fünf steuerbare Figuren einführen muss und vieren davon auch noch spezielle Fähigkeiten gibt. Teamanführer Arthur kann Befehle erteilen, Pilot Wade kann seine Sinne schärfen und dann Gegner durch Deckungen hindurchsiehen und so weiter. Das würde mich mal interessieren, wie sehr man da seine Sinne schärfen muss, damit man Gegner durch die Wand sieht. Habt ihr eine Idee, was man da, was muss man da so zu sich nehmen, dass das funktioniert? Dafür diese Elemente, in denen gerade mal neun Missionen des Spiels aber kaum Zeit bleibt, wirken sie eher wie Unix. Ja, dann siehst du vielleicht Leute durch die Wand, die sind aber nicht da. Selbst eine neue Gegnerart, die sich unter Beschuss der Nebel von Rauchgranaten versteckt, also auch Gameplay technisch wirklich mal eine schöne Neuerung, kommt so selten zum Einsatz. Wer, wer, wer kennt's nicht? Wer kennt's nicht? Ja, in Berlin die Leute mit dem Smokgranatengürtel. Auftreten wie ein Teaser für ein anderes, größeres Spiel wirkt. Das alles wirkt dann zudem auch noch unbefriedigender als beispielsweise die Kampagne von Call of Duty World War II, die zwar auch solche Wunderheiten verzichtete, sie dadurch aber auch nicht zu Schnickschnack vorkommen ließ. Und apropos World War II, da gab es in der Singleplayer Kampagne ja kein Fadenkreuz, bei Vanguard ist es wieder dabei. Gab es da ein Fadenkreuz? Dafür könnt ihr aber die Funktionsweise des Deckungssystems ach, ich kann mich an die World War II Kampagne erinnern. Die hat mir nicht so richtig gut gefallen. Nur die Sprachausgabe lässt sich leider nicht gesondert von den Untertiteln einstellen. Das ist doof. Ja, das ist blöd. Ey, das ist der Hobbit, oder? Also der, der Herr der Ringe. Hobbit. Das ist doch 100% gleiche Schauspieler. Oder das Facemodel, sagt man da. Oje, Toss, Toss. Toss. Das hat zwar mit dem eigentlichen Gameplay dann nichts zu tun, aber da die Render zwischen Sequenzen einen nicht zu unterschätzenden Teil der rund 5 Spielstunden einnehmen... Wisst ihr was man da jetzt direkt erkannt hat? Dass die Typen sind Facemodeled und Motion Captured und die Sekretärin nicht. Guckt euch das mal an. Die Sekretärin ist einfach normal klassisch animiert. Guckt euch den Unterschied hierzu an. Guckt, die Sekretärin ist einfach ganz normal animiert und gelesen. Und die Typen sind halt... So viele Toss-Symbole. Jetzt ist halt Massenware. Da kann man leider nichts mehr wirklich tiefgreifendes erwarten. Was doof ist, aber ist halt leider so. Oh nein, der Song, der hat jetzt noch gefehlt hinten drauf. So, was gucken wir uns als nächstes an? Motorisierte Schublade. Core-S-Binding. Cringe-Job-Postings. Der Auer ist auch wieder am Start. Können wir uns angucken? Oh, das ist witzig gewesen. Da habe ich die ersten paar Minuten... Da habe ich die ersten paar Minuten... Da habe ich die ersten paar Minuten und morgen auf dem Handy geguckt. Das ist so fail, Alter. Ich glaube, das müssen wir jetzt gucken. Alter, was die für eine Scheiße erzählen. Ich weiß nicht, dass wir Flat-Earser im Chat haben, die sich jetzt angegriffen fühlen. Und wenn nicht Pech gehabt, ja. Aber das ist wirklich lustig, was die Typen erzählen. Das müssen wir uns jetzt angucken. Da sind Dinge drin in diesem Video. Die erzählen dir zum Beispiel... Passt mal auf, ich spoilere eine Sache. Die sagen, dass die Anzahl deiner Finger ein Beleg dafür ist, dass die Erde eine Scheibe sein muss. Sowas kommt da in dem Video. Ich habe einfach abgedreht, was die Typen erzählen. Ich sehe keine die Lautstärke, stimmt nicht. Okay. Okay. Was? Oh. Hä? Moment. Das habe ich beim ersten Mal angeschaut. Es gibt Flat-Earth-Konferenzen? Sowas wie CCC, quasi nur für Flat-Earth? Oder so. Wusste ich gar nicht. Warum nicht? Sowas wie die Games-Konferenzen für Flat-Earth. Genau. Oh nein. Erst mal. Okay. Ich ahne Schlimmes. Proof. Okay, Leute. Soll ich euch mal was richtig mind-blowing zeigen? Ich hoffe, das geht mit dem Foto. Wenn es eine Fish-Eye-Lens ist, funktioniert das nicht. Soll ich euch mal mind-blowing Sachen zeigen? Guckt mal. Wenn ihr einen Screenshot macht von einem Bild, wo man sieht, dass die Erde flach ist, dann macht ihr einen Screenshot. Geht in Paint. Ich hoffe, das funktioniert mit diesem Foto jetzt. Oder wir gehen nicht in Paint. Da geht ihr in irgendein Programm, wo man ordentlich Bilder einfügen kann. Und dann nehmt ihr einfach das Foto. Macht das Foto rein. Und dann schiebt ihr das Foto zusammen. Und dann seht ihr, fuck, das funktioniert nicht, weil das nicht gerade ist. Jetzt zeige ich euch, wenn wir ein anderes Foto haben. Wenn man den Kram zusammenschiebt, ich bin mir nicht ganz sicher. Das kann man mathematisch erklären. Wenn man hier auf diesem Scale die Krümmung nicht sieht, aber es zusammenschiebt, dann sieht man es. Dann muss man abwarten. Jetzt sind wir schon mal voll Flat Earths zu Gott. Alles klar. What does Flat Earth ultimately mean? Flat Earth meint das, was das Wort sagt. Die Erde ist flach. This thing was designed. Top to bottom, bottom to top. If that truly is the case, then it is an abysmal design. Nothing can be proven, and one explanation violates another. You might want to go back to the drawing board on this one if you think it's that good. You can prove that this thing was created, that you were designed, and you can do it just by looking at the human body. What we're going to do is show that the human being is a perfectly proportioned, perfectly ratioed temple. Was sind wir? Hat er sich manche Leute schon mal angeguckt? Perfectly proportioned, perfectly ratioed temple How is the Holy Spirit? Ich bin mir da nicht so ganz sicher, ob das nicht manche Leute schon mal angeguckt hat. Meint er wirklich? Naja, egal. Das heißt, wir haben nur so perfekte Proportionen? Auch Gott, meine Güte! How bloody arrogant can you be? There are animals in the world that can see better than us, hear better than us, smell better than us, run faster than us, are stronger than us, and can fly. Es gibt auch welche, die sind fetter als wir. Ach ja. Das ist ja auch so. Das ist ja auch nicht so. Wenn man sich das anguckt, man kommt im Leben nicht darauf raus, dass es so ist. Ach ja. Also sprich, umso öfter man das sagt, wahrer ist es oder wie? Auffall. Wie gesagt, es wird noch viel abgedrehter. Da erzählt euch gleich, dass ihr die flache Erde anhand eurer Finger beweisen könnt. Jaja. Ja, das ist eine gute Frage. Das ist eine gute Frage, wenn man sagt, dass die Erde flach ist. Ist der Mond? Aber das wäre eine wirklich gute, eine sinnvolle Frage, wenn man behauptet, dass die Erde flach ist, ob der Mond auch flach ist, was sie dazu sagen würden. Das würde mich jetzt wirklich mal interessieren. Und was mich auch interessieren würde, ist, wie man erklären möchte, dass wenn die Sonne, wenn man am Meer steht, das ist ja für mich so der, also das ist für mich so die Sache, wo ich gerne mal von Flat Earthern die Erklärung hören würde, wenn ihr eine Drohne mit Kamera geht ans Meer oder irgendwo, wo flach ist. Ihr könnt es auch auf dem Salzsee machen oder so, aber Meer ist, glaube ich, für uns besser als Salzsee. Geht ans Meer, an Strand, wartet, bis die Sonne untergeht und dann fliegt mit der Drohne einfach mal hoch. Ihr werdet auf einmal die Sonne wieder sehen. Ich frage mich, wie man das sinnvoll erklären will in irgendeiner Art und Weise mit flacher Erde. Weil es kann jeder ausprobieren. Es kann jeder machen. Wahrscheinlich ist es dann auch Fake News oder so. Eines der Lieblingsargumente von Flat Earth Leuten ist ja Perspektive. Alles, was nicht erklärbar ist, ist Perspektive. Perspektive ist eines der Lieblingswörter von Flat Earth Leuten. Perspektive. Ja, das ist eine gute Frage. Was? Oh nein, die Mondlandung. Die Mondlandung muss ja auch Fake sein, wenn die Erde flach ist. Logisch. Obviously. Und wir wissen ja, die internationale Raumstation ist ja eigentlich unter Wasser. Kennt ihr diese Geschichte? Also das wird ja auch behauptet, dass die internationale Raumstation des Video-Footage unter Wasser aufgenommen wird und man kann Blasen sehen drum herum. Also das wird ja wirklich behauptet. Das Problem ist nur, dass jeder Noob mittlerweile mit einer guten Kamera alleine geht das ja schon. Da siehst du die IES rumfliegen, wenn du an die richtige Pose im Himmel guckst. Und im Teleskop ist recht. Du kannst das sehen von unten. Es ist nicht einfach so, dass man das behaupten würde und Fake Aufnahmen. Du kannst das selbst. Oh Gott, das sehen. Was hat er denn jetzt damit zu tun? Ach so, weil Anti-Religion. Okay. Was für wirres Zeugchen er erzählt. Du kannst ja mittlerweile sogar... Das ist richtig Big Brain. Du kannst ja mittlerweile sogar, wenn du... Weiß nicht, ob er das in dem Video erzählt, aber es gibt zig Videos auf YouTube drüber. Du kannst ja mittlerweile, wenn du Licht hast, was zum Beispiel durch Planeten durchscheint, durch die Atmosphäre von anderen Planeten durchscheint, dann kannst du das sehen. Oder das kann man sich beispielsweise auch beim Sonnenlicht angucken. Anhand des Spektrums von diesem Licht kannst du quasi erkennen, welche Elemente in der Atmosphäre sind. Das ist richtig Big Brain, was man mittlerweile alles machen kann. We know all about stars. Their absolute magnitude. Their mass. Their luminosity. Their temperature. Their metallicity. Now granted, there's still a lot that we don't know, but to stand there and say that we know nothing is an absolute insult to our species. How can we say that yes, I do know that God manifested me from his kingdom above? What are the stars? What are the moons? I don't know. You know what we can do? Wir können... Das ist so, aber er kann nicht erklären, was es ist, was an dieser Stelle ist, wo eigentlich der Himmel sein müsste. Das ist so pains-champig, Alter. Ja, dann mach mal. Indeed, we can. And when tracked and mapped, you can clearly see that our solar system is a heliocentric one. Ja, gut. Das ist halt auch noch nicht besser. Man darf nicht vergessen, die Griechen waren richtig clever. Ich weiß nicht, welcher Grieche das war. Die haben ja quasi durch den Sonnenstand an verschiedenen Orten die Größe der Erde errechnet. Das war nicht so richtig korrekt, aber die sind schon ziemlich clever. Ja, das kam schon so ungefähr hin. Also nicht wirklich gut, aber kam schon... Das ist echt... Nein, das war nicht Aristoteles. Es gibt noch mehr Griechen, die clevere Sachen gemacht haben. Also... Die Idee, dass die Erde rund ist, das gibt es schon relativ lange. Und ich meine, nur weil wir bis ins Mittelalter und die Kirche so komisches Zeug erzählt hat, macht es das nicht irgendwie besser. Und nur weil mal irgendwelche Leute Sonnengötter angebetet haben, heißt es ja noch lange nicht, dass man das in der heutigen Zeit auch machen muss, wenn man es besser weiß. Guck mal, das liegt doch so in der Natur der Menschheit. Man versucht irgendwie halbwegs sinnvoll mit dem, was man weiß, zu erklären, was man denn so beobachtet, was man denn so sieht. Gut, natürlich, früher ist dem nichts Besseres eingefallen, wie als das muss der Sonnengott sein. Aber heute wissen wir es halt besser. Der letzten 2000 Jahre, die wir gesammelt haben, und sagen, das ist der Sonnengott wieder. Das ist doch bescheuert. Also er hat im Prinzip keine Ahnung von nichts, sagt er damit. Aha. Was auch immer das heißen soll. Was heißt das überhaupt? Was heißt das überhaupt, dass das alles auf ihn manifestet? Was möchte er uns damit sagen? Also, ich habe das Video schon teilweise geguckt, aber ich weiß nicht, was das heißt. Also, ich weiß nicht, was das heißt, was das heißt, was das heißt, was das heißt, was das heißt, dass wir die sweetheart Das kann man gar nicht mal beschreiben. Nein, das hat ja mit überhaupt nichts zu tun. Okay, das wusste ich nicht. Ich finde es aber gut. Eins muss man sagen. Ich bin immer wieder überrascht davon, mit wie viel Überzeugung und quasi so so Sicherheit, dass die Leute erzählen können und die sind ja auch selbst davon voll überzeugt, obwohl es Schwachsinn ist. Also da sieht man, man kann an Schwachsinn glauben und man kann auch diesen Schwachsinn super überzeugend anderen erzählen. Komplette Schwachsinn. Okay, jetzt wird die beste Quelle aller Zeiten für unser Weltbild aller Zeiten zitiert. Die Bibel. Wir wissen ja alle, was da drin steht. Das muss wortwörtlich so sein. Was? Was? Das ist mir noch gar nicht aufgefallen. Und was? Okay, jetzt geht's los. Jetzt geht's los. Die große Verschwörung. 7 durch 2 hat jetzt Pi, alles klar. Ist das Pi? Sekunde. Soll ich jetzt mal kurz überbrücken. Äh, nein. Das stimmt ja schon ab der dritten Nachkommastelle nicht mehr. Der Pi ist 3,1415. Das stimmt ja schon ab der dritten Nachkommastelle immer. Ja. 1,415. Ja, das Komma lassen wir mal weg. Das Komma verschieben. Aber das stimmt ja hier schon ab dieser Nachkommastelle nicht mehr. 3,1415. Das ist das einzige, was ich mir merken kann, dass das 3,1415 ist. Nein! 3,18. Oh Gott, das ist so fail. Ach, 22. Ah, okay. Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr. Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr. Es ist, es ist bloß nicht. Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr. Aber es ist, es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr. Was will, was genau soll ein Bibel? Was will, was genau soll ein Bibel? Zitat. Eigentlich, wenn es um den Aufbau unserer Welt des Universums und sonst was geht. Was genau wollen die jetzt eigentlich? Was genau wollen die jetzt eigentlich? Was will der mit einem Bibel-Zitat? Also, irgendjemand ist dann zu Moses gegangen und hat ihm gesagt, sieben durch 22 ist Pi, oder? Ja, wir haben viel von Egypt gelernt. Egypt war eine gut genannte Zivilisation. Was ist dein Punkt hier, Marty? Und ich weiß nicht, ob ihr das schon gesehen habt, aber es ist eigentlich eine Art, dass man Zeit mit den Händen mapen kann. Also, wenn du deine Hände ausstecken, um den Horizont, wie du siehst, kannst du eigentlich eine Stunde zählen. Und also ist das eine Stunde Hand, die Hände der Uhr. Woher glaubst du, dass das kommt? Hä? Da bin ich jetzt zu dumm für, das verstehe ich nicht. Hä? Ich checke es nicht. Hä? Was macht man? Man hält die Hand so mit dem Daumen an die Sonne. Aber wie soll ich denn um alles in der Welt mit meinem Finger sowas hier machen? Ich kann doch meinen Finger nicht 90 Grad nach unten machen. Ach, die Sonne legt ca. vier Finger breit pro Stunde zurück. Ah, jetzt verstehe ich das. Also sprich, ich halte das so an die Sonne, da muss ich erstmal in die Sonne gucken, okay? Halte das so unter die Sonne, dann mache ich die zweite Hand runter, dann kann ich quasi ungefähr zählen. Ah ja, okay, okay, okay. Excellent, excellent. Wo bist du hier gelandet? Wir gucken uns gerade irgendein Flat Earth Zeug an. Alles klar, easy, easy, obvious, obvious. Ja, aber inwieweit hat es jetzt irgendwas mit flacher Erde und Finger? Und vielleicht das verstehe ich, der Zusammenhang verstehe ich nicht so genau. Hä? Was? Hä? Was zum Teufel? Was zum Teufel? Warum ist es nicht gleich 69, Alter? Obvious, true. Alles klar. Oh nein, schon wieder Bibel-Zitare. Ich glaube nicht, dass damit eigentlich die Hand gemeint ist. Es ist offensichtlich, es ist unausweichbar. Ich glaube nicht, dass damit wirklich die Hand, also physisch die Hand gemeint ist. Hand? Wer hat das gedacht? Alles klar. In mir? Moment. Excellent, excellent. Ah, okay, ja. Er will uns garantiert irgendwas mit 27, also soweit habe ich noch nicht geguckt. Er will uns garantiert was mit 27,3 jetzt vorrechnen. Warum 27,3 irgendwie, was weiß ich, irgendwas mit Jesus zu tun hat oder so, garantiert. Irgendwas in der Richtung kommt jetzt. Ist es das 28? Ich kann mir gar nicht vorstellen, dass das 28 ist. Wie soll das funktionieren? Ich weiß schon, weil die Nachkommastellen unterschiedlich sind und sich das nicht auf irgendwas glattes addieren. Das kann ich mir nicht vorstellen, dass das 28 ist. Also was, Moment, was soll ich machen? Das eine plus das andere und dann durch 2 oder was? Oder was will der jetzt von mir? Plus 29,53. So, und das jetzt durch 2. Das ist nicht 28, das ist 28,415. Ah gut, ich meine, denn mit Nachkommastellen haben wir es ja an sich eh nicht so. Mit Nachkommastellen haben wir es ja da allgemein nicht so. Das muss ja nicht so genau sein. Ich habe legit keine Ahnung, aber ich wette mit euch, es hat irgendwas damit zu tun, dass die Erde rund ist oder zumindest, dass die Erde sich um die Sonne dreht. Eins vor beiden. Ah ja, da habe ich mir noch nie Gedanken drüber gemacht. Jetzt kommt es. Was? Moment, eben hatten wir da noch 12 oder so auf meiner Hand. Warum habe ich jetzt auf einmal 28 auf meiner Hand? Oh nein, es geht wieder los. Was? Okay, jetzt sind die Daumen dabei. Und? Okay, aber ernsthaft, was genau hat das Zählen von Kliedern quasi an meiner Hand mit der Erde zu tun, ob die flach ist oder nicht? Also wie? Was ist der Zusammenhang dazwischen? Ich meine, ich könnte auch, ich könnte auch einfach was verzichten. Ich habe, ich könnte auch an die Anzahl meiner Knie zählen. Oh, ich habe zwei Knie und an mir raussuchen alles mit zwei. Ernsthaft? Ernsthaft? Okay, man könnte sich jetzt, man könnte sich jetzt alles Mögliche raussuchen. Ich finde bestimmt genug Leute, die haben am 6.9. Geburtstag 69. Du kannst alles irgendwie mit allem zusammenwursten, wenn du nur lang genug das rumrechnest und rumschiebst. Doch, er hat auch eben gesagt, er hat auch eben gesagt, es ist at hand. Oh nein, an den Füßen auch noch. Wir haben an den Füßen die gleiche Anzahl wie an den Händen. Wie kann denn das nur sein? Ja, okay, aber das sind dann 56 zusammen. Was ist jetzt mit 56? All based on Cephas und Isoplas. Was? Was will der Dude von mir? Ach ja, ach ja, wir sind ein Abbild von Gott, weil wir aus irgendwelchen Gründen die gleiche Anzahl an Klinern an Händen und Füßen haben oder was. Alles klar, alles klar. Und weiter? Und weiter? Und weiter? Oh nein, oh nein, das Kind wieder los. Jetzt sind wir bei 180. Jetzt kommen wir bei 180. Okay, jetzt kommt Big Brain Muffs, Alter. Und jetzt? 180. Oh mein Gott, 180. Leute, die Welt erscheint mir gerade in komplett anderem Licht. 180, die Hälfte von einem 360-Dinoscope. Ja, 180. Ein halber Kreis. Es gibt genug Leute, die können ihren Kopf bestimmt nicht 180 Grad drehen mehr. Ach du Scheiße. Oh Mann, da fällt mir echt nichts mehr zu ein. Da fällt mir wirklich nichts mehr zu ein. Was zum? Ey, guck mal, Leute, jetzt mal ernsthaft. Ich kann zu jeder x-beliebigen Zahl viele Dinge raussuchen, die damit irgendwie was zu tun haben. Und dann danach einfach die Sachen, die passen, nehmen und in ein Video packen. Vor allem, es ist absolut unschlüssig, was der Zusammenhang zwischen all diesem Grad ist. Und geschweige denn, was das alles mit flacher Erde zu tun hat. Ach ja. Wenn ich Dünsche ist, muss ich auch siebenmal kacken am Tag. Genau. Wo ist das Problem? Alter, was ein Schwachsinn. Also heute haben wir gelernt, dass 227 fast Pi ist. Was ist das hier? Was ist das hier? Was sehe ich da? Warum ist das eine Musikgruppe? Das kann ich nicht aufmachen, weil Toss. Okay, K-Pop Kram. Alles klar. Das ist der Beweis, genau. Guck mal, das, das, das. Was? Was wollen die von mir? 3,141. 14159. Ach, kein Schimmer. Was will Google von mir? Okay, alles klar. Jetzt wissen wir Bescheid. Also heute haben wir wirklich unseren Horizont erweitert, kann man so sagen. Also ich kann 3,14159, glaube. Mehr kann ich nicht. Reicht aber auch in der Regel. Was empfiehlt uns denn YouTube noch Schönes? Ja, Byte Strikes, Copy Pasten kann ich auch. Mist, wir hatten eigentlich keine guten Bilder von Flat Earth Bilder. Jetzt kann ich euch gar nicht diesen Trick mit dem Bild zusammenschieben zeigen. Na gut, gucken wir mal. So verändert sich Battlefield 2042 bis zum Release. Ja, mal abwarten. Ja, YouTube, erzähl. Was haben wir hier? Personalmangel meets Corona. Damit hätte ihr auch niemand rechnen können, dass zu wenig Personal im Gesundheitssystem schlecht ist. Da hätte man nicht drauf kommen können. Nee, nee, das ist nicht möglich. Das ist komplett 28, 180 und sonst was. Wir gucken uns das Video jetzt nicht an. Ich hoffe nur, die haben Fotos drinne davon. Ich will euch diesen Trick zeigen mit dem Editor hier. Wir brauchen den Flat Earth Foto. Hier. Nee, das ist auch Mist. Ich brauche ein Flat Earth Foto. So ein richtig typisches Flat Earth Foto brauche ich. Und dann das da vielleicht. Nee, hier ist leider nichts drin. Egal, dann lassen wir es. Gut, also was gucken wir uns als nächstes an? Absolute Cringe Worth Jobs. Ja, das ist in Englisch. Das ist dumm. Das ist USA. Da sind die Jobs einfach noch cringiger als bei uns. Mir hat übrigens gestern einer die beste, das müssen wir uns jetzt angucken Leute. Mir hat gestern per Mail einer die beste Job Beschreibung aller Zeiten geschickt. Das muss ich unbedingt ins nächste Video mit reinpacken. Passt mal auf. Beste, beste. Also das toppt wirklich fast alles, was ich bisher mir angeguckt habe in Stellenbeschreibung. Guck mal. Leiterin IT und Innovation. Der Anfang ist langweilig. Blablabla. Das müssen wir uns nicht durchlesen. Aber passt mal auf. Ihre Aufgaben. Jetzt kommt es. Ihre Aufgaben. Ich muss das so der Reihe nach revealen, weil sonst ist es nicht lustig. Die erzählen dir hier erstmal, dass du irgendwelche Management, du bist Leiter IT und machst irgendwelche Management Geschichten. Das erste, was sie dir erzählen ist Remote Support aller IT Systeme, Computernetzwerke und Telefonsysteme. Das ist im Prinzip einfach alles. Das ist im Prinzip einfach alles. Einfach alles, was es gibt. Das nächste ist darüber hinaus sind sie für die Informationswerke, Fragen, Produkte, Dienstleistungen, vereinzelte Benutzerschulungen, Netzwerkerweiterung, Hardware und Software Support. Du machst das auch noch. Kommunikation und Koordination der Vertragspartner und IT Dienstleister machst du auch noch. Verwaltung der bestehenden IT System Infrastruktur, Hardware, Software Lizenzen, Wartungsverträge, Weiterentwicklung der Software Struktur, also programmierst und auch noch weiter. Controlling der IT Kosten machst du auch noch. Verantwortlich für das reibungslose Funktienquotient der Anbieter von Guest Internet, Property Management, PMS, Pointsale, POS, IPTV, Telefonsystem und anderen Softwareanbietern. Fähigkeit zur Ursachenanalyse und Fehlerbehebung Software und Hardware Problem. Verantwortlich für die Überwachung von Netzwerk-Conference-Servern, Workstations, Netzwerkausrüstung, Telefonanlagen, E-Mail-Konten sowie Unterstützung der zugrundlichen Server-Desktop-Infrastruktur. Sollte in der Lage sein, Ursachenanalyse für ein Problem durchzuführen. Pass auf, es wird noch besser, es wird noch besser. Kenntnisse der Netzwerkinfrastruktur, einschließlich Kan5-6-Verkabelung, WLAN, Netzwerkswitches, WLAN, Domain-Controller, Active Directory, Firewall und VPN. Vorbereitung und Durchführung von vorbeugenden Wartungsplänen für die gesamte IT und Hardware und Software. Führung bei der Festlegung des Projektumfangs, der technischen Strategie, der Kosten, des Budgets und den Anforderungen an die personelle Unterstützung. Ausarbeitung von Richtlinien und Verfahren für die IT-Abteilung. Verwaltung des Disaster Recovery Prozesses und sicherstellen regelmäßiger Backup. Es wird noch besser Leute, gleich kommt noch der Hammer. Aktualisierung der Richtlinien und Verfahren in Bezug auf PC, was auch immer das ist. Jetzt kommt der Hammer. Verantwortung für Datensicherheit und Cyber. Du bist auch noch Security-Experte. Datensicherheit und Cyber-Security. Und jetzt noch, falls das noch nicht reicht. Sie müssen sich außerdem über die neuesten Hotel-Technologien und Software-Risiken auf dem Laufen halten. Sie müssen in der Lage sein, andere von der Geschäftsleitung zugewiesene IT oder systembezogene Aufgaben zu erfüllen. Was ist denn das für ein bescheuerter Satz? Woher soll ich das denn wissen? Wenn die sich nächstes... Wisst ihr, das ist eine Wildcard. Das ist eine Wildcard für alles, der letzte Satz. Das ist eine Wildcard komplett für alles. Sie müssen in der Lage sein, alles zu machen, was wir ihnen sagen. Das ist wirklich der absolute Wahnsinn. Leider sagen sie nicht, was sie bezahlen, noch nicht mal grob. Aber wir bieten es auch vollkommen an der Realität vorbei. Flexible Arbeitszeiten und Vertrauenszeiten. Das sind die einzigen Vorteile, die sie haben. Das hier ist kein wirklicher Vorteil. Das ist irgendwie so eines der Sätze, die sie hinschmeißen. Das ist kein Vorteil für dich. Weiterentwicklungsmöglichkeiten durch die maßgebliche Leitung, neue Technologien. Das ist auch kein wirklich wir bieten. Das ist einfach ein Teil, wie sie sich sehen. Und das auch nicht. Also im Prinzip haben die keine Vorteile. Neugierig auf das Gehalt anzeigen. Das geht nicht. Das ist Chebat. Das ist Chebat. Das sind mehrere Abteilungen. Genau, du hast recht. Das sind nicht nur mehrere Stellen in einer Person. Das sind diesmal mehrere Abteilungen in einer Person. Das solltest du nicht bewerben und den Portemonnaie nicht KQ machen. Bitte mal. Man sieht das gar nicht. Das ist einfach nur komplettes Chebat. Ich hatte mal einen Account gemacht, um mich dann diese Gehaltsumfrage zu machen. Am Ende kam nichts raus. Das war komplettes Chebat. Ich meine, wir können das mal machen, aber das funktioniert glaube ich nicht. 10-Minute-Mail. Passwort. Was? Ich. Irgendwas werde ich eh nie wieder verwenden. Anhand was errechnet sich das? Ich meine das Gehalt ist durchaus in Ordnung. Aber nicht für das hier. An sich ist das Gehalt durchaus okay. Aber ist das halt die Frage, hat das überhaupt was mit dieser Stelle zu tun? Und nicht für das hier. Das war Brutto. Ja klar, es ist immer Brutto. Das Gehalt ist schon für den IT-Job durchaus in Ordnung. Aber halt nicht für das hier. Aber das hat mit diesem Job gar nichts zu tun. Das ist Gehaltsspanne geschätzt. Das hat mit der Realität nichts zu tun. Bewerbung starten. Wie geht denn das jetzt? Okay. Ich habe kein Nein, habe ich nicht. Lebenslauf erstellen. Oh. Vorgefertigter Lebenslauf. Jawoll. Farbe ändern. Kappa Pride. Nee. Jawoll. Weiter. Äh. Washer. Ahja. Excellent. Ja. Schwachsinnig. Schwachsinnig. Also wer sich das ausgedacht hat ist auch nicht. Ich meine ich müsste mich wirklich ohne Scheiß mal mal sowas bewerben. So mit fake Name just for fun. Und dann sagen keck you. CD Projekt Red Tweet. Was tweeten sie denn? Zeig her. Was tweeten sie? Poggers. Alles klar. All das sind die Agil. Keine Ahnung. Die brauchen einen Crunch Master. Ja stimmt. Das ist für die glaube ich wichtiger als den Scrum Master. Gucken wir uns jetzt an YouTube. Du hast noch mal die Chance uns was zu empfehlen. Ich habe Hunger. Es ist jetzt 11.48 Uhr. Ich kann auch gar keinen Hunger haben. Wobei man kann immer immer Hunger haben. Wir bekommen nur noch ein Battlefield Zeug empfohlen. Never play the German version of a video game. Ah. Der spielt die Mission. Die MW2 Mission wo du in der deutschen Version nicht schießen darfst. Das war nur in der deutschen Version. Deutsche Version. Aber das hat sich glücklicherweise gebessert. Battlefield Top Plays of the Month. Okay das gucken wir jetzt nochmal. Oh ne. Das ist so ein super gehypter Typ. Das halte ich nicht aus. Das ist so ein super. Oh ne das halte ich. Ich halte so Let's Play Typen nicht aus die rumschreien. Ach ne das ist Battlefield Fans. Das sind auch die Stimmen davon oder? Nicht Fans. Nicht Fans. Friends. Battlefield Friends. Nicht Fans. Wie komme ich auf Fans? Oh ne das kann ich nicht haben. Das ist zu viel Reaction. Das halte ich nicht aus. Hey Leute was geht hier ist wieder der Max am Start und heute spielen wir Funny Game XY und ich darf auf gar keinen Fall aufhören zu reden. Solche Videos da kriege ich Anfälle bei. Die dürfen nie die Klappe halten weil die Leute sonst abschalten. Kennst du einen Addon für Opera das YouTube nicht mehr stoppt? Ich wusste gar nicht das YouTube in Opera stoppt. Das ist einfach anstrengend ja. Ich muss auch sagen ich bin irgendwie weiß ich nicht so nicht die richtige YouTube Zielgruppe oder war ich noch nie eigentlich weil ich kann mir die meisten Videos gar nicht angucken. Na gut das ist normal so viel verschiedenen Content wie es da gibt aber gerade im Gaming Bereich ich finde die meisten Videos so ultra anstrengend zu schauen. Genauso die ganzen Funny Games die es da gibt wo ich einfach nur ultra schlechte Spiele sehe und irgendein der das spielt und auch nicht lustig ist also keine Ahnung es ist nicht meins. Du hast aber auch durchgehend in deinen YouTube Videos gelabert. Ich rede durchgehend weil ich was zu einem Thema sage aber du kannst meine Videos nicht vergleichen mit irgendein super hyper aktivem Let's Player Dude. Hol dir wenigstens noch Luft. Ich habe gerade eine Mail bekommen von Victoria sie sucht mich und möchte jetzt über chat live.me mit mir chatten alles klar. Seems legit. So. Gucken wir uns noch an. The man that thinks Koalas are CGI gibt verrückte Leute halt. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will. Gibt es nichts was ich mir angucken will.", "segments": [{"id": 1, "start": 60.0, "end": 77.52, "text": "So, was trinken hier, exzellent, exzellent, moin, ah ja, so heute bin ich nicht so früh"}, {"id": 2, "start": 77.52, "end": 81.56, "text": "wie letzte Woche, letzte Woche war ich ja 8.30 Uhr oder so in dem Dreh schon da, aber da"}, {"id": 3, "start": 81.56, "end": 90.68, "text": "war es ja auch, erst gerade nach der Zeitumstellung. Zeitumstellung ist eh so ein Ding, sollten"}, {"id": 4, "start": 90.68, "end": 95.4, "text": "wir das nicht eigentlich, oder wollten sie das nicht eigentlich abschaffen mit der Zeitumstellung?"}, {"id": 5, "start": 95.4, "end": 102.36, "text": "Ja, es gab doch irgendwie mal so eine Umfrage vor vier Jahren oder so, wo die Leute gesagt"}, {"id": 6, "start": 102.36, "end": 108.44, "text": "haben, ja mach weg, da konnten sie sich nicht einigen auf was, aber ich meine, nur weil"}, {"id": 7, "start": 108.44, "end": 111.52, "text": "man sich nicht auf irgendwas einigen kann, ist ja nicht, dass man es jetzt einfach sein"}, {"id": 8, "start": 111.52, "end": 115.92, "text": "lässt, da muss man halt gucken, dass man sich auf irgendwas einigt. Ah, das ist eh ein"}, {"id": 9, "start": 115.92, "end": 122.48, "text": "aufgeblasenes, keine Ahnung, bürokratisches Teil, also da, keine Ahnung, kannste nix"}, {"id": 10, "start": 122.48, "end": 142.72, "text": "von erwarten. Ah, jetzt, so. Leute, in einer Woche ist Battlefield raus, nicht mal ganz"}, {"id": 11, "start": 142.72, "end": 151.48, "text": "eine Woche, am 12., das ist Freitag, nächste Woche, nächste Woche Freitag, so und ich kann"}, {"id": 12, "start": 151.48, "end": 157.64, "text": "euch sagen, was ich video technisch machen werde. Also, am Montag, oder vielleicht heute"}, {"id": 13, "start": 157.64, "end": 163.68, "text": "noch, muss ich mal gucken, ich geh mal eher vom Montag raus, Montag kommt ein Video allerdings"}, {"id": 14, "start": 163.68, "end": 170.36, "text": "nicht zu Battlefield, sondern Storytime, manche im Stream werden vielleicht sagen Recycle Story,"}, {"id": 15, "start": 170.36, "end": 180.16, "text": "weil ich das schon mal erzählt hab, aber mal gucken, und da muss ich da ein bisschen"}, {"id": 16, "start": 180.16, "end": 186.52, "text": "Hexen das erlaubt machen drin, und nächste Woche, irgendwann, wahrscheinlich einen Tag"}, {"id": 17, "start": 186.52, "end": 194.52, "text": "vor Release, ich hab, weil, leider war das alles, hat das alles nicht so hingehauen,"}, {"id": 18, "start": 194.52, "end": 198.84, "text": "ne? Ich hab ja ein paar Cutter gesucht, die mir aus meinen Battlefield-Livestreams so"}, {"id": 19, "start": 198.84, "end": 205.84, "text": "irgendwie so ein, keine Ahnung, paar Minuten Highlight oder was auch immer, wie viel, Highlight-Videos"}, {"id": 20, "start": 205.84, "end": 212.16, "text": "zu schneiden, aus diesen drei Battlefield-Beta-Livestreams, die ich gemacht hab. Der erste hat gesagt,"}, {"id": 21, "start": 212.16, "end": 217.16, "text": "er macht's, und auf einmal hat er's dann nicht mal gemacht, will ich jetzt nix erzählen,"}, {"id": 22, "start": 217.16, "end": 221.92, "text": "so weiter, weil vielleicht will er nix nicht, haben wir uns einen zweiten gesucht, der hat"}, {"id": 23, "start": 221.92, "end": 225.4, "text": "jetzt gesagt, der braucht eine Woche für, das ist heute fertig, mal gucken, also es"}, {"id": 24, "start": 225.4, "end": 228.6, "text": "war grausam, es ist leider ein bisschen spät, ich wollte es eigentlich schon vor ein paar"}, {"id": 25, "start": 228.6, "end": 233.32, "text": "Wochen hochladen, deswegen hab ich mir gedacht, ich lad das jetzt einfach irgendwie 1-2 Tage"}, {"id": 26, "start": 233.32, "end": 237.24, "text": "vor Release hoch, es kriegt dann zwar nicht so viele Views, aber dann ist das Video nicht"}, {"id": 27, "start": 237.24, "end": 240.52, "text": "umsonst, und vielleicht stimmt's die Leute ein bisschen auf Battlefield ein."}, {"id": 28, "start": 240.52, "end": 269.96, "text": "Müssen wir mal gucken. Alles klar. Wieso? Schauen wir mal."}, {"id": 29, "start": 269.96, "end": 282.6, "text": "Was waren wir denn jetzt? Big Stonks."}, {"id": 30, "start": 282.6, "end": 291.44, "text": "Gab's irgendwelche spannenden News diese Woche, die ich verpasst hab? Facebook benennt"}, {"id": 31, "start": 291.44, "end": 294.72, "text": "sich um, aber das weiß ja schon ein bisschen her."}, {"id": 32, "start": 294.72, "end": 302.96, "text": "Gab's irgendwas spannendes? Lass mal überlegen, was spannendes stehen, gab's irgendwas spannendes?"}, {"id": 33, "start": 302.96, "end": 317.88, "text": "Das weitere Einsatz von Corona war, warum nicht? Hä? Warum nicht? Juckt mich nicht."}, {"id": 34, "start": 317.88, "end": 325.08, "text": "Ja, mal gucken. Das hab ich gelesen, das fand ich witzig."}, {"id": 35, "start": 325.08, "end": 327.8, "text": "Kopierschutz hat Probleme mit den neuen CPUs, weil es wahrscheinlich nicht erkennt, auf"}, {"id": 36, "start": 327.8, "end": 332.0, "text": "welcher Plattform es läuft, ein Crash. Also genau das, was ein Kopierschutz nicht machen"}, {"id": 37, "start": 332.0, "end": 335.68, "text": "sollte. So, Aldi Talk, gab's auch nichts, sondern"}, {"id": 38, "start": 335.68, "end": 348.44, "text": "irgendwie spannendes, ja, Meta, ja. Also es war diese Woche tatsächlich relativ wenig"}, {"id": 39, "start": 348.44, "end": 370.28, "text": "und so. Nix, irgendwie. Vielleicht, ja. Ja, ja, wahrscheinlich."}, {"id": 40, "start": 370.28, "end": 385.72, "text": "Mal gucken. Niemand kauft mehr Intel, das stimmt doch"}, {"id": 41, "start": 385.72, "end": 392.72, "text": "überhaupt nicht. Gerade im größeren Bereich, also im Enterprise"}, {"id": 42, "start": 392.72, "end": 397.92, "text": "Bereich, siehst du immer noch kaum AMD-Systeme. Jetzt mal eine Frage an euch, wer auch hier"}, {"id": 43, "start": 397.92, "end": 401.4, "text": "so aus der IT kommt. Wie ist der Anteil bei euch im Rechenzentrum"}, {"id": 44, "start": 401.4, "end": 405.68, "text": "Intel zu AMD? Also bei uns ist es ungefähr so 99 zu 1."}, {"id": 45, "start": 405.68, "end": 411.56, "text": "Und ich sag dieses 1 auch nur dabei, weil ich mir gar nicht sicher bin, ob wir überhaupt"}, {"id": 46, "start": 411.56, "end": 415.76, "text": "haben dieses Thema. Aber könnte schon sein, könnte schon sein,"}, {"id": 47, "start": 415.76, "end": 422.0, "text": "deswegen sag ich 99 zu 1, anscheinend 100%. Ja, Firmen Notebook ist auch Intel, genau."}, {"id": 48, "start": 422.0, "end": 430.6, "text": "Also gerade im Enterprise Bereich, gut, ja, bei Headstar haben die, ich weiß, aber, gut,"}, {"id": 49, "start": 430.6, "end": 437.36, "text": "ich sag mal, das meine ich jetzt damit nicht. Also, es mag vielleicht im Desktopbereich"}, {"id": 50, "start": 437.36, "end": 442.68, "text": "sein, dass Intel weniger verkauft wird, wobei ich glaube, dass immer noch viele so richtig"}, {"id": 51, "start": 442.68, "end": 446.88, "text": "Hardcore-Gamer, die quasi sagen, ich will jedes letzte FPS, auch egal, koste was es"}, {"id": 52, "start": 446.88, "end": 457.04, "text": "ist, ich wolle immer noch Intel kaufen. Aber das Gute ist, bei den aktuellen CPUs,"}, {"id": 53, "start": 457.04, "end": 461.72, "text": "also das Gute bei den aktuellen CPUs ist ja, dass Intel jetzt auch anfängt, es gab ja jetzt"}, {"id": 54, "start": 461.72, "end": 467.44, "text": "erst letztens einen Intel, was 1200, der da, ne, ist glaube ich der neue, kann das sein."}, {"id": 55, "start": 467.44, "end": 473.28, "text": "Genau, und da habe ich mal ein bisschen Benchmarks geguckt."}, {"id": 56, "start": 473.28, "end": 479.6, "text": "Der ist schon, das sieht man hier wahrscheinlich auch irgendwo drin, der ist schon ein bisschen"}, {"id": 57, "start": 479.6, "end": 485.88, "text": "schneller als der Ryzen hier, verbraucht aber halt auch richtig viel Strom, aber, was man"}, {"id": 58, "start": 485.88, "end": 492.04, "text": "daran sieht ist, eine Sache, die wir wirklich AMD zu verdanken haben, dass wir jetzt endlich"}, {"id": 59, "start": 492.04, "end": 496.2, "text": "angekommen sind auf dem Desktop bei 12 und 16 Kerne. Ich weiß gar nicht, was hat denn"}, {"id": 60, "start": 496.2, "end": 501.56, "text": "der, wie viele Kerne hat der, ich glaube, der hat 2 mal 8 oder so, ne. Hier, 2 mal 8,"}, {"id": 61, "start": 501.56, "end": 512.08, "text": "genau. Die haben 16 Kerne, 8 superschnelle und 8 irgendwie Low Power oder sowas. Und,"}, {"id": 62, "start": 512.08, "end": 518.4, "text": "dass wir jetzt bei, also das haben wir exklusiv einzig und allein AMD zu verdanken, dass wir"}, {"id": 63, "start": 518.4, "end": 525.08, "text": "auf dem Desktop jetzt quasi Mainstream-mäßig 8, 12 und 16 Kerne haben. Hätte Intel noch"}, {"id": 64, "start": 525.08, "end": 531.8, "text": "das Sagen gehabt, die nächsten irgendwie 5, 6 Jahre jetzt, also hier, die letzten 5,"}, {"id": 65, "start": 531.8, "end": 537.44, "text": "6 Jahre und jetzt immer noch, hätten wir im High-End-Segment auf dem Desktop 8 Kerne"}, {"id": 66, "start": 537.44, "end": 547.32, "text": "und ansonsten 4 und 6. Eventuell, eventuell mal 10 oder so, wenn das super krass teuer"}, {"id": 67, "start": 547.32, "end": 553.64, "text": "wäre. Aber wir hätten garantiert nie im Leben Mainstream-mäßig 8, 12 und 16 Kerne,"}, {"id": 68, "start": 553.64, "end": 559.24, "text": "ohne AMD. Da bin ich mir relativ sicher, weil, wenn man sich anguckt, dass Intel über Jahre"}, {"id": 69, "start": 559.24, "end": 565.56, "text": "hinweg eigentlich nie die Core-Zahl geändert hat. Es gab ja im Prinzip immer 4 und dann"}, {"id": 70, "start": 565.56, "end": 573.56, "text": "mal ab dem 8700 ist dann so im High-End-Segment auch 6 Kerne aufgekommen. Wir wären nie im"}, {"id": 71, "start": 573.56, "end": 579.56, "text": "Leben von 6 Kernen auf 16 Kerne raufgegangen, so im normalen, sagen wir mal so im normalen"}, {"id": 72, "start": 579.56, "end": 583.68, "text": "Preis-Segment, also halbwegs normalen Preis-Segment für den Desktop, auch wenn das Zeug hier"}, {"id": 73, "start": 583.68, "end": 590.56, "text": "schweine teuer ist, also sich leistbaren Preis-Segment auf dem Desktop ohne AMD wären wir einfach"}, {"id": 74, "start": 590.56, "end": 595.4, "text": "nicht gewesen. Da bin ich mir sehr sicher. Und das haben wir tatsächlich AMD zu verdanken,"}, {"id": 75, "start": 595.4, "end": 599.48, "text": "unabhängig davon, ob AMD jetzt noch die letzten Jahre großartig hier oben mit dabei sein wird,"}, {"id": 76, "start": 599.48, "end": 605.96, "text": "wobei ich mir durchaus vorstellen könnte, wenn der Ryzen 3 ist das jetzt, also wenn"}, {"id": 77, "start": 605.96, "end": 616.64, "text": "quasi Ryzen 4, wann kommt dann eigentlich Ryzen 4? Was ist denn das dann? Ryzen 6.690"}, {"id": 78, "start": 616.64, "end": 623.16, "text": "oder so? Nächsten Ryzen CPUs Release, wann kommt denn das? Haben die nicht schon irgendwas"}, {"id": 79, "start": 623.16, "end": 635.52, "text": "gesagt? Ryzen alle CPUs 2022, ja erzähl. Ah gut, mal schauen. Also sobald da das nächste"}, {"id": 80, "start": 635.52, "end": 640.16, "text": "kommt, ist wahrscheinlich AMD wieder vorne, zumal Intel ja es aktuell auch nicht so richtig"}, {"id": 81, "start": 640.16, "end": 643.88, "text": "schafft, also das Ding ist zwar schnell, wenn ich hier diesen Test richtig gelesen habe,"}, {"id": 82, "start": 643.88, "end": 648.04, "text": "das ist das Ding ja schnell, aber wird wohl ziemlich warm und verbraucht wohl ziemlich"}, {"id": 83, "start": 648.04, "end": 660.36, "text": "viel Strom. Ja, mal schauen. Ja, das in dem Fall wohl auf jeden Fall, weiß ich was das"}, {"id": 84, "start": 660.36, "end": 665.56, "text": "Ding kostet, aber Intel hat auch CPUs, die tatsächlich ganz günstig sind, für das was"}, {"id": 85, "start": 665.56, "end": 672.76, "text": "sie bringen. Intel muss es ja ein bisschen über den Preis machen in letzter Zeit. Ja,"}, {"id": 86, "start": 672.76, "end": 684.84, "text": "Preis steht nicht dabei. Was kosten so welche hier? Was kosten so einer? Ja. Ach ja, schnapper."}, {"id": 87, "start": 684.84, "end": 691.52, "text": "Naja, muss ich auch mal sagen, denn Ryzen 5950 ist jetzt auch nicht so viel, so viel"}, {"id": 88, "start": 691.52, "end": 708.56, "text": "billiger. Ja, kostet sogar mehr. Also, ja, sofern ist es dann gar nicht mal übel, aber"}, {"id": 89, "start": 708.56, "end": 714.56, "text": "das Ding muss wohl ziemlich großen Stromverbrauch haben. Das ist natürlich High-End-Segment,"}, {"id": 90, "start": 714.56, "end": 719.52, "text": "also sprich, wenn man mal in den unten drunter guckt, ist wahrscheinlich ein bisschen wieder"}, {"id": 91, "start": 719.52, "end": 726.88, "text": "das ganze anders verteilt. Warum ist Arm auf dem Desktop eigentlich? Naja, bei Apple,"}, {"id": 92, "start": 726.88, "end": 733.44, "text": "ich wollte gerade sagen, bei Apple schon, ja, ich weiß nicht, ob es besser ist als X86,"}, {"id": 93, "start": 733.44, "end": 739.48, "text": "nur weil Apple das macht. Man darf nicht vergessen, was da alles dranhängt. Die meiste Software"}, {"id": 94, "start": 739.48, "end": 744.6, "text": "gibt es halt nur für X86. Bei Apple ist es halt so, Apple kann das machen und entweder"}, {"id": 95, "start": 744.6, "end": 748.68, "text": "ziehst du als Softwareentwickler nach, zumal die ja auch nicht umsonst so ihre Emulation"}, {"id": 96, "start": 748.68, "end": 754.32, "text": "dabei haben, entweder ziehst du als Softwareentwickler nach oder bist dead. Apple kann halt einfach"}, {"id": 97, "start": 754.32, "end": 760.6, "text": "machen, was sie wollen. Und nachdem eines der größten Vorteile von X86 in Verbindung"}, {"id": 98, "start": 760.6, "end": 767.4, "text": "mit Windows nun mal ist, dass alles läuft, auch Dinger, die 100 Jahre alt sind, wäre"}, {"id": 99, "start": 767.4, "end": 781.12, "text": "das glaube ich eine blöde Idee. Also, ich wollte euch mal ein Video zeigen, das habe"}, {"id": 100, "start": 781.12, "end": 786.4, "text": "ich richtig gut gemacht, hier, weiß nicht, ob das einer schon gesehen hat, aber das ist"}, {"id": 101, "start": 786.4, "end": 791.84, "text": "wahrscheinlich, weil das ist fast 9 Millionen Aufrufe, aber ich finde das ultra nice gemacht."}, {"id": 102, "start": 791.84, "end": 799.0, "text": "Das ist die Jurassic, diese T-Rex Szene aus Jurassic Park mit einer Katz. Richtig, richtig"}, {"id": 103, "start": 799.0, "end": 817.72, "text": "Pongas gemacht. Moment, ich muss lauter machen. Da weißt du erst mal, wie sich eine Maus fühlt."}, {"id": 104, "start": 817.72, "end": 826.32, "text": "Mikro."}, {"id": 105, "start": 847.72, "end": 876.2, "text": "Ich finde es echt, du hast es echt gut gemacht."}, {"id": 106, "start": 876.2, "end": 880.48, "text": "Aber da kannst du dir erstmal vorstellen, wie sich irgendeine Maus fühlt."}, {"id": 107, "start": 880.48, "end": 883.72, "text": "Stell dir mal vor, du guckst da raus und vor dir steht so eine Katze und klotzt dich an."}, {"id": 108, "start": 883.72, "end": 890.28, "text": "Also ich glaube, die fühlen sich, also man kann, also wer den Film gesehen hat, du hattest"}, {"id": 109, "start": 890.28, "end": 895.84, "text": "ja da schon, ist ja nicht so, also man konnte sich ja doch ganz gut hereinversetzen, wie"}, {"id": 110, "start": 895.84, "end": 898.68, "text": "das ist, wenn ich jetzt gerade so irgendeinen fleischfressenden Dinosaurier angucke."}, {"id": 111, "start": 898.68, "end": 900.84, "text": "Und so ungefähr muss das für die Katze ausgeben."}, {"id": 112, "start": 900.84, "end": 904.28, "text": "Ausgibt neue Battlefield Fans."}, {"id": 113, "start": 904.28, "end": 911.28, "text": "Es gibt neue Battlefield Fans."}, {"id": 114, "start": 911.28, "end": 912.28, "text": "Huge."}, {"id": 115, "start": 912.28, "end": 913.28, "text": "Ist das neu?"}, {"id": 116, "start": 913.28, "end": 914.28, "text": "Hä?"}, {"id": 117, "start": 914.28, "end": 934.96, "text": "Das ist ein Re-Upload."}, {"id": 118, "start": 944.28, "end": 965.56, "text": "Aber wir gucken den trotzdem, der ist glaube ich ganz guter."}, {"id": 119, "start": 965.56, "end": 979.8, "text": "Es gibt halt wirklich so Server."}, {"id": 120, "start": 979.8, "end": 983.24, "text": "Gut, in Battlefield 3 nicht mehr, da gibt es noch 5 Server oder so, die aktiv sind, wenn"}, {"id": 121, "start": 983.24, "end": 985.52, "text": "man da Leute bunt, ist halt, kannst du das Spiel aninstallen."}, {"id": 122, "start": 985.52, "end": 997.6, "text": "Ja, das ist der Administrator, er hat diesen Platz, er ist auf unserem Team."}, {"id": 123, "start": 997.6, "end": 999.4, "text": "Gut, können wir da raus und..."}, {"id": 124, "start": 999.4, "end": 1002.04, "text": "Leute, Leute, Leute, ich habe einen Chopper auf mich, jemand helft."}, {"id": 125, "start": 1002.04, "end": 1003.04, "text": "Wer ist das?"}, {"id": 126, "start": 1003.04, "end": 1004.04, "text": "Bist du campen?"}, {"id": 127, "start": 1004.04, "end": 1006.32, "text": "Nein, nein, ich bin getroffen durch einen Chopper."}, {"id": 128, "start": 1006.32, "end": 1008.24, "text": "Du sitzt da in diesem Gebäude."}, {"id": 129, "start": 1008.24, "end": 1009.24, "text": "Bist du campen?"}, {"id": 130, "start": 1009.24, "end": 1013.0, "text": "Nein, nein, ich stehe in einem Gebäude, damit ich nicht von einem Chopper getroffen werde."}, {"id": 131, "start": 1013.0, "end": 1015.44, "text": "Oh warte, nein, das ist mein Freund, er ist unser Sniper."}, {"id": 132, "start": 1015.44, "end": 1016.44, "text": "Er ist dein Freund?"}, {"id": 133, "start": 1016.44, "end": 1017.44, "text": "Ja."}, {"id": 134, "start": 1017.44, "end": 1018.44, "text": "Was ist der Name des Choppers?"}, {"id": 135, "start": 1018.44, "end": 1019.44, "text": "Was ist sein Name?"}, {"id": 136, "start": 1019.44, "end": 1020.44, "text": "Ich weiß nicht, Freeze etwas?"}, {"id": 137, "start": 1020.44, "end": 1021.44, "text": "Freeze!"}, {"id": 138, "start": 1021.44, "end": 1022.44, "text": "Band!"}, {"id": 139, "start": 1022.44, "end": 1023.44, "text": "Danke."}, {"id": 140, "start": 1023.44, "end": 1024.44, "text": "Wow."}, {"id": 141, "start": 1024.44, "end": 1025.44, "text": "War das großartig?"}, {"id": 142, "start": 1025.44, "end": 1026.44, "text": "Nein, das war es nicht."}, {"id": 143, "start": 1026.44, "end": 1027.44, "text": "Er hat einfach den Typen gebannt."}, {"id": 144, "start": 1027.44, "end": 1028.44, "text": "Ja, aber der Typ spielte fair."}, {"id": 145, "start": 1028.44, "end": 1029.44, "text": "Er hatte einen Chopper."}, {"id": 146, "start": 1029.44, "end": 1030.44, "text": "Das ist auch ein Re-Upload von 2012."}, {"id": 147, "start": 1030.44, "end": 1031.44, "text": "Wir haben einen Chopper in dem Spiel getroffen."}, {"id": 148, "start": 1031.44, "end": 1032.44, "text": "Wenn er in dem Spiel ist..."}, {"id": 149, "start": 1032.44, "end": 1033.44, "text": "Ich mag diesen Typen nicht Storytelling."}, {"id": 150, "start": 1033.44, "end": 1034.44, "text": "Du hast einen schlechten Storytelling."}, {"id": 151, "start": 1034.44, "end": 1035.44, "text": "Ich habe keinen verdammten Storytelling."}, {"id": 152, "start": 1035.44, "end": 1036.44, "text": "Ich weiß nicht, wo ihr die Typen hinkriegt."}, {"id": 153, "start": 1036.44, "end": 1037.44, "text": "Ich bin sehr dumm davon."}, {"id": 154, "start": 1037.44, "end": 1045.44, "text": "Ich werde ihn bannen."}, {"id": 155, "start": 1045.44, "end": 1049.44, "text": "Ja, wenn du ein Storyteller bist, musst du dein Spiel ein bisschen öffnen."}, {"id": 156, "start": 1049.44, "end": 1051.44, "text": "Ich versuche nicht einen verdammten Storyteller zu erzählen."}, {"id": 157, "start": 1051.44, "end": 1052.44, "text": "Nimm noch einen Mittelpunkt."}, {"id": 158, "start": 1052.44, "end": 1053.44, "text": "Ich mag seinen Mittelpunkt nicht."}, {"id": 159, "start": 1053.44, "end": 1054.44, "text": "Ja."}, {"id": 160, "start": 1054.44, "end": 1055.44, "text": "Der Anfang war okay."}, {"id": 161, "start": 1055.44, "end": 1056.44, "text": "Climax?"}, {"id": 162, "start": 1056.44, "end": 1057.44, "text": "Lösung."}, {"id": 163, "start": 1057.44, "end": 1058.44, "text": "Was ist Act 3?"}, {"id": 164, "start": 1058.44, "end": 1059.44, "text": "Okay, hier ist meine Lösung."}, {"id": 165, "start": 1059.44, "end": 1060.44, "text": "Band!"}, {"id": 166, "start": 1060.44, "end": 1061.44, "text": "Meine Lösung ist, man sollte nicht die Typen bannen."}, {"id": 167, "start": 1061.44, "end": 1062.44, "text": "Oh verdammt!"}, {"id": 168, "start": 1062.44, "end": 1063.44, "text": "Oh verdammt, wir haben Feuer."}, {"id": 169, "start": 1063.44, "end": 1064.44, "text": "Okay, schaut mal, Leute, ich werde diese Typen flicken."}, {"id": 170, "start": 1064.44, "end": 1067.44, "text": "Ihr versucht, euch von vorne zu schlagen, okay?"}, {"id": 171, "start": 1067.44, "end": 1068.44, "text": "Ihr versucht, euch von vorne zu schlagen, ihr könnt in der Mitte rennen."}, {"id": 172, "start": 1068.44, "end": 1069.44, "text": "Egal, jeder ist einfach aufgeregt."}, {"id": 173, "start": 1069.44, "end": 1070.44, "text": "Band!"}, {"id": 174, "start": 1070.44, "end": 1071.44, "text": "Band!"}, {"id": 175, "start": 1071.44, "end": 1072.44, "text": "Band!"}, {"id": 176, "start": 1072.44, "end": 1073.44, "text": "Habt ihr gesehen?"}, {"id": 177, "start": 1073.44, "end": 1074.44, "text": "Das Spiel ist einfach."}, {"id": 178, "start": 1074.44, "end": 1075.44, "text": "Das Spiel ist einfach."}, {"id": 179, "start": 1075.44, "end": 1076.44, "text": "Das ist gar nicht Spaß."}, {"id": 180, "start": 1076.44, "end": 1077.44, "text": "Und das ist gar nicht fair für diese Jungs."}, {"id": 181, "start": 1077.44, "end": 1078.44, "text": "Dude, wir werden total gewinnen."}, {"id": 182, "start": 1078.44, "end": 1079.44, "text": "Ja, wir werden gewinnen, weil ihr eigentlich schräg seid."}, {"id": 183, "start": 1079.44, "end": 1080.44, "text": "Als Administrator, ihr bannt Leute nur, weil sie besser sind als ihr."}, {"id": 184, "start": 1080.44, "end": 1081.44, "text": "Das ist nicht Spaß, das ist nicht sportlich."}, {"id": 185, "start": 1081.44, "end": 1082.44, "text": "Das ist halt einfach schräg."}, {"id": 186, "start": 1082.44, "end": 1083.44, "text": "Ihr könnt das nicht machen."}, {"id": 187, "start": 1083.44, "end": 1084.44, "text": "Das ist einfach schräg."}, {"id": 188, "start": 1084.44, "end": 1085.44, "text": "Das ist einfach schräg."}, {"id": 189, "start": 1085.44, "end": 1086.44, "text": "Das ist einfach schräg."}, {"id": 190, "start": 1086.44, "end": 1087.44, "text": "Das ist einfach schräg."}, {"id": 191, "start": 1087.44, "end": 1094.44, "text": "Das ist nicht lustig, das ist nicht sportlich, das ist einfach, das ist schuldig, das kannst du nicht tun."}, {"id": 192, "start": 1094.44, "end": 1098.44, "text": "Oh, die letzte Zeit, in der ich meinen Kreditkart getestet habe, habe ich die Scheiße, die ich will."}, {"id": 193, "start": 1098.44, "end": 1126.44, "text": "Es gibt halt wirklich so Leute und nicht zu wenige. Wisst ihr wo das ganz schlimm war? Bei Venice Unleashed, die drei Wochen wo das Game live war, die hatten halt keinen offiziellen Server und da war sogar so, dass der Server auch noch mitgecheatet hat. Alter, das war echt der Wahnsinn."}, {"id": 194, "start": 1126.44, "end": 1138.44, "text": "Also, nee, nee, seriously, das war für'n Arsch. Ach guck mal, hier hatte ich noch einen auf, aber noch, müssen wir noch einen, müssen wir nicht gucken."}, {"id": 195, "start": 1138.44, "end": 1153.44, "text": "Alter, was ist denn mit YouTube los? YouTube empfiehlt uns ja nur noch Battlefield, ich meine, ich weiß, kommt gleich raus, aber man muss es jetzt nicht, muss es jetzt nicht übertreiben. Twitch meisen, Dankeschön für den Sub."}, {"id": 196, "start": 1153.44, "end": 1179.44, "text": "Ich würde sagen, wir lassen uns jetzt erstmal eine Runde von LevelCaptureBaden und mal gucken, was er erzählt."}, {"id": 197, "start": 1179.44, "end": 1194.44, "text": "Ich meine, er wird im Endeffekt sich darüber auslassen, dass, okay, Overwatch und, ich weiß jetzt schon was kommt, Overwatch und Diablo 4 wurden delayed, das ist ja bekannt jetzt mittlerweile."}, {"id": 198, "start": 1194.44, "end": 1209.44, "text": "Also, und ich frage mich, was everything you need to know, ich meine, das Ganze kommt am 12. raus, wir können jetzt quasi ab, ich glaube, Xbox kann schon preloaden, ich glaube, Xbox kann ab heute preloaden, wenn ich nicht ganz falsch liege. Und PC kann ab 10. preloaden."}, {"id": 199, "start": 1209.44, "end": 1228.44, "text": "Und ansonsten, ja, was muss man wissen? Ja, eigentlich, eigentlich nichts, wenn man ehrlich ist. Was soll man wissen müssen? Man kann ab 12. spielen, außer, also man kann spielen, außer man hat diese ganz ultra low Edition, dann kann man, glaube ich, erst ab 16. oder so spielen."}, {"id": 200, "start": 1228.44, "end": 1231.44, "text": "So, gucken wir mal, lassen wir uns G-Baden."}, {"id": 201, "start": 1231.44, "end": 1238.44, "text": "Moin LevelCapt."}, {"id": 202, "start": 1238.44, "end": 1243.44, "text": "Ach stimmt, ein Vanguard Review, das hatte ich doch hier auch offen."}, {"id": 203, "start": 1243.44, "end": 1250.44, "text": "Ja, das müssen wir uns so angucken, da bin ich mal gespannt. Ich hab mich null informiert, absolut null, ich kauf mir das auch nicht."}, {"id": 204, "start": 1250.44, "end": 1258.44, "text": "Warum lassen wir uns jede Woche von LevelCapt neu G-Baden, ist doch nice, sich G-Baden zu lassen."}, {"id": 205, "start": 1258.44, "end": 1280.44, "text": "Ja, also Vanguard kauf ich mir nicht, es ging voll an mir vorbei, ich sehs auch nicht ein, ich würde das eh nur bis zum Battlefield Release spielen wahrscheinlich. Und außerdem kommt dann SBMM. Und Leute, ich sag euch jetzt mal was, ich hab's ja schon predicted, vor Battlefield 2042 Release und quasi zur Beta nochmal, als da kein Serverbrowser drin war."}, {"id": 206, "start": 1280.44, "end": 1292.44, "text": "Ich könnte wetten, es kommt in irgendeiner Art und Weise limitierter oder nicht vorhandenes Serverbrowser und skill-based Matchmaking."}, {"id": 207, "start": 1292.44, "end": 1299.44, "text": "Ich sag's euch, ich sag's euch, weil dann ist das Game instant dead für mich, da werd ich nicht spielen."}, {"id": 208, "start": 1299.44, "end": 1307.44, "text": "Ich, ich, ich, ich, irgendwie hab ich so im Gefühl, dass was in dieser Richtung passiert."}, {"id": 209, "start": 1307.44, "end": 1327.44, "text": "Aber hoffen wir mal das Beste."}, {"id": 210, "start": 1327.44, "end": 1335.44, "text": "Ist laut genug."}, {"id": 211, "start": 1335.44, "end": 1340.44, "text": "Mental Launch, alles klar."}, {"id": 212, "start": 1340.44, "end": 1362.44, "text": "Ich glaube, der Launch wird erstmal, wie bei fast jedem Battlefield, wer findet die meisten Bugs innerhalb der ersten 24 Stunden."}, {"id": 213, "start": 1362.44, "end": 1376.44, "text": "Nee, Xbox kann schon preloaden."}, {"id": 214, "start": 1376.44, "end": 1380.44, "text": "Ich mein, guckt euch mal, guckt euch mal die anderen Maps an."}, {"id": 215, "start": 1380.44, "end": 1388.44, "text": "Wenn man sich diese Maps aufholt, da ist halt auch nix, außer irgendwo ab und zu mal ein bisschen was."}, {"id": 216, "start": 1388.44, "end": 1394.44, "text": "Und die neuen geleakten Gameplays schauen, oh, das weiß ich nicht, ob man das schauen kann."}, {"id": 217, "start": 1394.44, "end": 1399.44, "text": "Also wenn das, wenn das auf irgendwelchen großen bekannten Channels ist, dann schon."}, {"id": 218, "start": 1399.44, "end": 1406.44, "text": "Wenn das jetzt irgendwelche so ein Video-Channels sind, die sich das nur für die Leaks angemacht haben, dann nicht."}, {"id": 219, "start": 1406.44, "end": 1409.44, "text": "Da weiß ich nicht, wie, wie tost das ist."}, {"id": 220, "start": 1409.44, "end": 1416.44, "text": "Die Maps sehen halt auch alle schon wieder so leer und, und so im Prinzip wie Orbital nur mit einem anderen Setting halt aus."}, {"id": 221, "start": 1416.44, "end": 1420.44, "text": "Ich bin da echt kein Freund von gewesen."}, {"id": 222, "start": 1420.44, "end": 1429.44, "text": "Orbital war ja im Prinzip einfach so eine 0-15-Battle-Royale-Map ohne die typischen Battlefield-Routen, die du so hattest."}, {"id": 223, "start": 1429.44, "end": 1433.44, "text": "Du hattest zwar diesen Tunnel unten drunter, da kannst du aber nicht durchlaufen."}, {"id": 224, "start": 1433.44, "end": 1439.44, "text": "Ansonsten, du hattest im Prinzip nur offenes Feld überall und keine sinnvollen Routen über die Map."}, {"id": 225, "start": 1439.44, "end": 1441.44, "text": "Du hast einfach offenes Feld."}, {"id": 226, "start": 1441.44, "end": 1446.44, "text": "Du kannst sagen, du hast nahezu und endlich viele Routen, aber das bringt ja nix, wenn alles offenes Feld ist."}, {"id": 227, "start": 1446.44, "end": 1449.44, "text": "Also, mal gucken, mal gucken."}, {"id": 228, "start": 1449.44, "end": 1452.44, "text": "Also ich hab da immer noch so meine Bedenken."}, {"id": 229, "start": 1452.44, "end": 1457.44, "text": "Huge M, BAM!"}, {"id": 230, "start": 1466.44, "end": 1468.44, "text": "Ne Auto-Shotgun?"}, {"id": 231, "start": 1468.44, "end": 1483.44, "text": "War das richtig? War das ne Auto-Shotgun? Da wird wieder geflamt."}, {"id": 232, "start": 1498.44, "end": 1511.44, "text": "Hast du den Reddit-User gesehen, der schon spielen kann? Er hat keine..."}, {"id": 233, "start": 1511.44, "end": 1517.44, "text": "Ich hab da irgendeine News-Artikel drüber gelesen, wo die Leute Zweifel daran hatten, dass das legit ist."}, {"id": 234, "start": 1517.44, "end": 1534.44, "text": "Ist das der, der angeblich preloaded hat und er konnte schon spielen?"}, {"id": 235, "start": 1534.44, "end": 1544.44, "text": "Schick mal bitte nen Link, das können wir uns angucken."}, {"id": 236, "start": 1544.44, "end": 1549.44, "text": "Es ist auch sowas, da hab ich ehrlich gesagt ein bisschen Bedenken."}, {"id": 237, "start": 1549.44, "end": 1557.44, "text": "Die Sache ist nämlich die, man hat bei fast jedem Battlefield im Vorfeld irgendwas..."}, {"id": 238, "start": 1557.44, "end": 1560.44, "text": "Also du wusstest quasi bei jedem Battlefield mehr als bei dem hier."}, {"id": 239, "start": 1560.44, "end": 1566.44, "text": "Was wissen wir zu dem Spiel? Wir wissen zwar so die Rahmenbedingungen, was weiß ich, wie viele Maps,"}, {"id": 240, "start": 1566.44, "end": 1573.44, "text": "wir kennen paar Specialists, wir kennen die Waffen und sowas, aber so wirklich substanzielles wissen wir über das Game gar nichts."}, {"id": 241, "start": 1573.44, "end": 1588.44, "text": "Es hat Sound keine Ahnung, Portal nicht so wirklich eine Ahnung, selbst All Out Warfare,"}, {"id": 242, "start": 1588.44, "end": 1593.44, "text": "wo sie fett Werbung gemacht haben und man die Beta spielen kann, so wirklich Ahnung davon hat man auch nicht."}, {"id": 243, "start": 1593.44, "end": 1599.44, "text": "Außer dass man ein paar kurze Videos immer gesehen hat. Dann haben sie angefangen mit ihren Story-Trailer,"}, {"id": 244, "start": 1599.44, "end": 1603.44, "text": "dann kam das mit Irish und ansonsten glaube ich nix, wo man sich halt fragt,"}, {"id": 245, "start": 1603.44, "end": 1610.44, "text": "hätte man nicht vor Release eigentlich mindestens mal fünf dieser Story-Trailer droppen müssen?"}, {"id": 246, "start": 1610.44, "end": 1614.44, "text": "Wenn man eine Story erzählen will, dass man vor Release..."}, {"id": 247, "start": 1614.44, "end": 1620.44, "text": "Ich mein, das Game ist unter einer Woche von Release weg, wo sind denn die ganzen hunderten..."}, {"id": 248, "start": 1620.44, "end": 1631.44, "text": "Wo ist denn die große Marketing Trommel, die rührt? Ich merke davon gerade gar nichts."}, {"id": 249, "start": 1631.44, "end": 1640.44, "text": "Bei Battlefield 3 hattest du komplette Singleplayer Mission vor Release, die du gucken konntest."}, {"id": 250, "start": 1640.44, "end": 1645.44, "text": "Nahezu komplette."}, {"id": 251, "start": 1645.44, "end": 1650.44, "text": "Hey, ist das Captain Price? Der Typ sieht aus wie Captain Price. Guckt euch mal den Typ an, der da rennt."}, {"id": 252, "start": 1650.44, "end": 1654.44, "text": "Der Dude sieht echt... Guck mal, das sieht aus wie Captain Price."}, {"id": 253, "start": 1654.44, "end": 1657.44, "text": "Naja, nee, nicht wirklich. Aber auf den ersten Blick schon."}, {"id": 254, "start": 1657.44, "end": 1668.44, "text": "Er hat halt auch so einen komischen Bart."}, {"id": 255, "start": 1668.44, "end": 1682.44, "text": "Captain Price auf Wish bestellt."}, {"id": 256, "start": 1682.44, "end": 1686.44, "text": "Nimmst du dir frei? Nö. Es ist doch eh Freitag, wann man anfangen kann zu spielen."}, {"id": 257, "start": 1686.44, "end": 1692.44, "text": "Dann habe ich Freitag, Freitag, Samstag, Sonntag, Montag und dazu kommt..."}, {"id": 258, "start": 1692.44, "end": 1700.44, "text": "Jetzt muss ich euch mal was Poggers, Poggers, Poggeriges zeigen. Ich habe ja eh Urlaub ab hier."}, {"id": 259, "start": 1700.44, "end": 1705.44, "text": "So, und ich habe festgestellt, ich habe noch vier Tage Resturlaub. Das heißt, ich kann..."}, {"id": 260, "start": 1705.44, "end": 1710.44, "text": "Hier habe ich eh frei, hier habe ich eh frei. Das heißt, ich nehme hier auf jeden Fall noch den Dienstag frei."}, {"id": 261, "start": 1710.44, "end": 1716.44, "text": "Weil alles andere wäre bescheuert. 29. bin ich eh nicht da. Dienstag, da müsste ich für einen Tag noch mal hin."}, {"id": 262, "start": 1716.44, "end": 1723.44, "text": "Dann nehme ich mir noch mal frei und dann nehme ich einen Tag Kleidzeit und die Woche davor noch mal."}, {"id": 263, "start": 1723.44, "end": 1732.44, "text": "Wenn das passt. Das heißt, dann habe ich quasi Urlaub ab hier. Bis nächstes Jahr."}, {"id": 264, "start": 1732.44, "end": 1746.44, "text": "19. November bis nächstes Jahr. Das heißt, im Endeffekt kann ich ab 19.... 24 Stunden Battlefield spielen."}, {"id": 265, "start": 1746.44, "end": 1763.44, "text": "Also da muss ich mir keinen Urlaub extra zu Release nehmen."}, {"id": 266, "start": 1763.44, "end": 1771.44, "text": "Also was mich am meisten excited immer noch ist, dass es endlich mal wieder ein modernes Battlefield ist."}, {"id": 267, "start": 1771.44, "end": 1781.44, "text": "Das Gesamtkonzept, also das Gesamtding aus, es ist ein modernes Battlefield und es spielt sich auch relativ schnell und zügig und so."}, {"id": 268, "start": 1781.44, "end": 1788.44, "text": "Ich finde das gut. Ich habe bei fast allem anderen Bedenken, habe ich ja in meinem letzten Video auch oder vorletzten Video erzählt."}, {"id": 269, "start": 1788.44, "end": 1794.44, "text": "Aber nichtsdestotrotz, im Kern scheinen sie was richtig gemacht zu haben, weil ich habe immer noch Bock drauf jetzt zu spielen."}, {"id": 270, "start": 1794.44, "end": 1811.44, "text": "Diving in Headfirst, das ist auch so eine Redewendung, das ist genauso wie Redewendung Pushing Boundaries und sowas."}, {"id": 271, "start": 1811.44, "end": 1814.44, "text": "Es gibt so ein paar Redewendungen, die gehen mir einfach richtig auf den Sack."}, {"id": 272, "start": 1814.44, "end": 1826.44, "text": "Wisst ihr, es gibt eine Sache, so ein Deutschspruch auf Deutsch, der mir voll auf den Sack geht, den die Leute zu allem sagen, was sie gut finden."}, {"id": 273, "start": 1826.44, "end": 1832.44, "text": "Und das ist die Kombination richtig und wichtig. Wenn ich das lese, kriege ich Anfälle."}, {"id": 274, "start": 1832.44, "end": 1836.44, "text": "Das sagt jeder zu allem, was er denkt, für alles was er denkt, was gut ist."}, {"id": 275, "start": 1836.44, "end": 1846.44, "text": "Wenn irgendwie einer sagt hier, keine Ahnung, alle Livestreamer sind kacke und einer denkt, das ist richtig und wichtig."}, {"id": 276, "start": 1846.44, "end": 1854.44, "text": "Das ist doch mittlerweile ernsthaft, ist das schon gemimt, ist aber auch verständlich."}, {"id": 277, "start": 1854.44, "end": 1859.44, "text": "Was ist dein Arbeitgeber, dass du Streamer bist?"}, {"id": 278, "start": 1859.44, "end": 1866.44, "text": "Ja, der guckt sogar manchmal meine Videos und letztens habe ich ihn sogar bei mir im Stream hier gesehen."}, {"id": 279, "start": 1866.44, "end": 1871.44, "text": "Das wusstet ihr nicht und ich habe auch nichts gesagt, weil ich da nichts, ich wollte das jetzt nicht outen oder so."}, {"id": 280, "start": 1871.44, "end": 1874.44, "text": "Letztes Mal sogar kurz im Stream."}, {"id": 281, "start": 1874.44, "end": 1877.44, "text": "Das ist richtig und wichtig, das zu erwähnen."}, {"id": 282, "start": 1877.44, "end": 1881.44, "text": "Alter, diese Redewendung geht mir wirklich auf den Keks."}, {"id": 283, "start": 1881.44, "end": 1884.44, "text": "Ist das nicht vermonte? Nein, das ist nicht alles."}, {"id": 284, "start": 1884.44, "end": 1887.44, "text": "Diesen Spruch gibt es ja schon lange."}, {"id": 285, "start": 1887.44, "end": 1898.44, "text": "Schlimm. So, jetzt langen wir so weiter, Chibane."}, {"id": 286, "start": 1898.44, "end": 1903.44, "text": "At first."}, {"id": 287, "start": 1903.44, "end": 1909.44, "text": "Hahaha, das kann man so sagen."}, {"id": 288, "start": 1909.44, "end": 1913.44, "text": "Alter Leute, New World, es ist so krass am abkacken."}, {"id": 289, "start": 1913.44, "end": 1920.44, "text": "Ich hatte ja mal eine Zeit lang, also ich habe den New World nie gespielt, also das Release nie gespielt, weil ich mir wusste, dass das Cluster Fuck hoch 10 ist."}, {"id": 290, "start": 1920.44, "end": 1929.44, "text": "Ich hatte ja richtig Spaß die letzten 1-2 Wochen, ich konnte mir jeden Tag mehrere Videos anschauen zu neuen New World Glitches."}, {"id": 291, "start": 1929.44, "end": 1932.44, "text": "Und was es für Glitches gab, Alter."}, {"id": 292, "start": 1932.44, "end": 1935.44, "text": "Diese Sache mit wir freezen ist ja nur das eine."}, {"id": 293, "start": 1935.44, "end": 1944.44, "text": "Du konntest Items dupen, du konntest HTML injecten, wenn nicht sogar Javascript."}, {"id": 294, "start": 1944.44, "end": 1949.44, "text": "Es war ein abfuck hoch 10, also wirklich krasser Scheiß."}, {"id": 295, "start": 1949.44, "end": 1953.44, "text": "Also New World ist in einem ganz, ganz grausamen Zustand."}, {"id": 296, "start": 1953.44, "end": 1964.44, "text": "Und wir gucken mal, Steam Stats New World."}, {"id": 297, "start": 1964.44, "end": 1974.44, "text": "Es ist irgendwie..."}, {"id": 298, "start": 1974.44, "end": 1976.44, "text": "Es geht schneller als ich mir das gedacht habe."}, {"id": 299, "start": 1976.44, "end": 1977.44, "text": "Es geht schneller als..."}, {"id": 300, "start": 1977.44, "end": 1980.44, "text": "Die hatten eine Million am Anfang von ungefähr einer Million."}, {"id": 301, "start": 1980.44, "end": 1981.44, "text": "Sind die jetzt runter?"}, {"id": 302, "start": 1981.44, "end": 1990.44, "text": "Die haben jetzt noch ein Drittel ungefähr."}, {"id": 303, "start": 1990.44, "end": 1999.44, "text": "Oh Mann, oh Mann."}, {"id": 304, "start": 1999.44, "end": 2006.44, "text": "Man muss sagen, also vergiss nicht, es ist gerade lost, es ist doch scheißegal, es ist doch scheißegal."}, {"id": 305, "start": 2006.44, "end": 2009.44, "text": "Es ist auch Battlefield und Call of Duty Release, es ist scheißegal."}, {"id": 306, "start": 2009.44, "end": 2017.44, "text": "Das ist genauso, das ist genauso wie die Leute früher immer bei MMOs wo es den Bach runtergegangen ist, gesagt haben, oh es ist Sommer, die Leute spielen weniger."}, {"id": 307, "start": 2017.44, "end": 2019.44, "text": "Das ist doch scheißegal, das ist wurscht."}, {"id": 308, "start": 2019.44, "end": 2024.44, "text": "Also bei so einem Spielerverlust von einem Drittel, das kannst du nicht auf irgendwelche äußeren Faktoren schieben."}, {"id": 309, "start": 2024.44, "end": 2030.44, "text": "Das könntest du höchstens, hättest du das damals auf World of Warcraft Release vielleicht machen können, ja."}, {"id": 310, "start": 2030.44, "end": 2035.44, "text": "Aber dieses Kaliber in MMOs haben wir jetzt ja nun nicht gehabt."}, {"id": 311, "start": 2035.44, "end": 2039.44, "text": "Und selbst da hat es länger gedauert, wie die MMOs Spielerverlust."}, {"id": 312, "start": 2039.44, "end": 2043.44, "text": "Ich meine, man muss sich mal vorstellen, das ist kein Subscription-based."}, {"id": 313, "start": 2043.44, "end": 2046.44, "text": "Da steht 30, man muss etwas weiter aufmachen."}, {"id": 314, "start": 2046.44, "end": 2050.44, "text": "Achja, hä?"}, {"id": 315, "start": 2050.44, "end": 2052.44, "text": "Ne, das ist doch 30.9. doch rausgekommen."}, {"id": 316, "start": 2052.44, "end": 2054.44, "text": "Mehr geht doch, mehr geht doch nicht."}, {"id": 317, "start": 2054.44, "end": 2060.44, "text": "Mehr geht doch nicht, guck."}, {"id": 318, "start": 2060.44, "end": 2068.44, "text": "Das Game ist doch quasi erst irgendwie einen Monat oder so raus."}, {"id": 319, "start": 2068.44, "end": 2072.44, "text": "Ja, eineinhalb Monate oder sowas."}, {"id": 320, "start": 2072.44, "end": 2082.44, "text": "Ja, sechs M."}, {"id": 321, "start": 2082.44, "end": 2086.44, "text": "Oder drei, ist es eigentlich egal."}, {"id": 322, "start": 2086.44, "end": 2095.44, "text": "Aber zumindest, ja, zumindest, das ist ja nicht Subscription-based."}, {"id": 323, "start": 2095.44, "end": 2098.44, "text": "Wenn es Subscription-based, guckt euch, das war alles so krass."}, {"id": 324, "start": 2098.44, "end": 2102.44, "text": "Wenn es Subscription-based gewesen wäre, dann könnte man sagen,"}, {"id": 325, "start": 2102.44, "end": 2105.44, "text": "okay, ich verstehe den Drop nach einem Monat, die Leute haben ihre Subscription nicht."}, {"id": 326, "start": 2105.44, "end": 2107.44, "text": "Aber es ist nicht Subscription-based."}, {"id": 327, "start": 2107.44, "end": 2111.44, "text": "Es ist einfach schlecht und hat Probleme."}, {"id": 328, "start": 2111.44, "end": 2117.44, "text": "Ich meine, du musst es erst mal schaffen, zwei Drittel deiner Spieler zu verlieren."}, {"id": 329, "start": 2117.44, "end": 2120.44, "text": "Das letzte Mal waren wir noch bei 40%, was sie verloren haben."}, {"id": 330, "start": 2120.44, "end": 2122.44, "text": "Jetzt haben sie quasi zwei Drittel."}, {"id": 331, "start": 2122.44, "end": 2127.44, "text": "Die haben 60, naja, okay, 66% der Spieler verloren."}, {"id": 332, "start": 2127.44, "end": 2129.44, "text": "Das ist brutal, also das ist wirklich..."}, {"id": 333, "start": 2129.44, "end": 2132.44, "text": "Aber gut, das Game ist auch im Arsch, ja."}, {"id": 334, "start": 2132.44, "end": 2140.44, "text": "Okay, gucken wir uns das jetzt mal fertig an."}, {"id": 335, "start": 2140.44, "end": 2142.44, "text": "150k Spieler ist auch nicht wenig."}, {"id": 336, "start": 2142.44, "end": 2144.44, "text": "Für den Anspruch, wie die gestartet haben, nicht."}, {"id": 337, "start": 2144.44, "end": 2149.44, "text": "Und wir gehen ja mal, also ich gehe ja mal nicht davon aus, dass es irgendwie jetzt schlagartig stoppt."}, {"id": 338, "start": 2149.44, "end": 2157.44, "text": "Ich meine, sieht das irgendwie so aus, als würde diese Linie aufhören, nach unten zu gehen?"}, {"id": 339, "start": 2157.44, "end": 2159.44, "text": "Warte mal, Steam, New World."}, {"id": 340, "start": 2159.44, "end": 2164.44, "text": "Stimmt, wir müssen uns Steam-Rezession angucken, das wäre lustig."}, {"id": 341, "start": 2164.44, "end": 2167.44, "text": "Die interessante Frage ist, wie viele Spieler haben Max Level erreicht?"}, {"id": 342, "start": 2167.44, "end": 2169.44, "text": "Auch bestimmt, bestimmt einen Teil."}, {"id": 343, "start": 2169.44, "end": 2173.44, "text": "Bestimmt, bestimmt."}, {"id": 344, "start": 2173.44, "end": 2176.44, "text": "Aber das ist ja nochmal ein Beweis dafür, dass es ein Fail-MMO ist,"}, {"id": 345, "start": 2176.44, "end": 2181.44, "text": "wenn du Max Level erreicht und dann nichts zu tun hast und alles den Bach runtergeht."}, {"id": 346, "start": 2181.44, "end": 2183.44, "text": "Das ist ja nicht Sinn und Zweck der Sache."}, {"id": 347, "start": 2183.44, "end": 2194.44, "text": "Level-Prozess in einem MMORPG sollte ja eigentlich nur ein Teil davon sein."}, {"id": 348, "start": 2194.44, "end": 2197.44, "text": "Ich hab's gesagt, Leute, ich hab's von Anfang an gesagt."}, {"id": 349, "start": 2197.44, "end": 2199.44, "text": "Leute haben gesagt, ach nee, Max, die kriegen das schon hin."}, {"id": 350, "start": 2199.44, "end": 2205.44, "text": "Nein, die kriegen das nicht hin, das war für mich direkt bei der Beta klar."}, {"id": 351, "start": 2205.44, "end": 2208.44, "text": "Age of Empires 4, ja, das soll richtig gut sein."}, {"id": 352, "start": 2208.44, "end": 2213.44, "text": "So, wir gucken uns das jetzt erstmal an, was er dazu sagt."}, {"id": 353, "start": 2213.44, "end": 2216.44, "text": "Es gibt immer Leute, die so Games hartnäckig verteidigen."}, {"id": 354, "start": 2216.44, "end": 2219.44, "text": "Du weißt ja, du hast dann immer so die gleichen Ausreden."}, {"id": 355, "start": 2219.44, "end": 2221.44, "text": "Wenn's dir nicht gefällt, dann spiel's doch nicht."}, {"id": 356, "start": 2221.44, "end": 2225.44, "text": "Ja, machen die ja auch ganz viele offensichtlich."}, {"id": 357, "start": 2225.44, "end": 2228.44, "text": "Ja, es machen ja ganz viele."}, {"id": 358, "start": 2228.44, "end": 2233.44, "text": "Oder die Leute dann so nach dem Motto, das ist doch alles nicht schlimm, ich habe meinen Spaß."}, {"id": 359, "start": 2233.44, "end": 2236.44, "text": "Das ist ja schön für dich, wenn du deinen Spaß daran hast,"}, {"id": 360, "start": 2236.44, "end": 2239.44, "text": "was aber nicht die Probleme weniger problematisch macht, die das Spiel hat."}, {"id": 361, "start": 2239.44, "end": 2242.44, "text": "Ist ja schön und gut, wenn jemand Einzeles sagt, dass er seinen Spaß hat."}, {"id": 362, "start": 2242.44, "end": 2246.44, "text": "Soll er weiterspielen und gut ist, sein Spaß haben, habe ich überhaupt keine Probleme mit."}, {"id": 363, "start": 2246.44, "end": 2252.44, "text": "Das ändert aber nichts daran, dass das Spiel Fehler und Probleme ohne Ende hat."}, {"id": 364, "start": 2252.44, "end": 2256.44, "text": "So, vielleicht erzählt er ja ein paar."}, {"id": 365, "start": 2256.44, "end": 2264.44, "text": "Ja, ja."}, {"id": 366, "start": 2264.44, "end": 2268.44, "text": "Ich glaube, den Anfang haben wir gar nicht gehört."}, {"id": 367, "start": 2268.44, "end": 2284.44, "text": "Ja."}, {"id": 368, "start": 2284.44, "end": 2288.44, "text": "Also ich habe mir das ein bisschen genauer angeguckt, weil mich interessiert hat, was da los ist."}, {"id": 369, "start": 2288.44, "end": 2292.44, "text": "Also du konntest quasi im Chat posten von New World."}, {"id": 370, "start": 2292.44, "end": 2301.44, "text": "Du konntest quasi Link Text in den Chat posten."}, {"id": 371, "start": 2301.44, "end": 2303.44, "text": "Und das hat funktioniert."}, {"id": 372, "start": 2303.44, "end": 2311.44, "text": "Es war nicht nur so, dass du damit quasi den Chat kaputt machen konntest."}, {"id": 373, "start": 2311.44, "end": 2322.44, "text": "Du konntest auch irgendwie falsche Items linken, die du gar nicht hast."}, {"id": 374, "start": 2322.44, "end": 2329.44, "text": "So, aber wisst ihr, was der Fix von Amazon war?"}, {"id": 375, "start": 2329.44, "end": 2339.44, "text": "Der Fix von Amazon war String Contains."}, {"id": 376, "start": 2339.44, "end": 2349.44, "text": "Das war der Fix von Amazon."}, {"id": 377, "start": 2349.44, "end": 2351.44, "text": "Doch, doch, das ist den, Herr Ernst."}, {"id": 378, "start": 2351.44, "end": 2354.44, "text": "Das war der Fix von Amazon."}, {"id": 379, "start": 2354.44, "end": 2368.44, "text": "Das Problem ist jetzt aber, dass du ohne Probleme das ja mit allen möglichen anderen Text auch machen konntest."}, {"id": 380, "start": 2368.44, "end": 2372.44, "text": "Also ich glaube, mittlerweile ist es gefixt."}, {"id": 381, "start": 2372.44, "end": 2377.44, "text": "Aber Amazon ist einfach krass unfähig, was das Ganze angeht."}, {"id": 382, "start": 2377.44, "end": 2379.44, "text": "Ach ja, und dann gab es übrigens noch einen geilen Bug."}, {"id": 383, "start": 2379.44, "end": 2385.44, "text": "Weiß nicht, ob er das noch erzählen wird, aber es war mein persönlicher Lieblingsbug von dem, was ich gesehen habe."}, {"id": 384, "start": 2385.44, "end": 2399.44, "text": "Du konntest unendlich XP Farmen, indem du an das Quest Board gegangen bist und irgendwie eine was weiß ich Fische Fünf Fische Quest angenommen hast."}, {"id": 385, "start": 2399.44, "end": 2407.44, "text": "Dann bist du zum Marketplace gegangen und hast dir diese Fünf Fische gekauft zum Quest abgeben."}, {"id": 386, "start": 2407.44, "end": 2411.44, "text": "Davor hast du sie allerdings wieder in den Marketplace reingesetzt."}, {"id": 387, "start": 2411.44, "end": 2415.44, "text": "Also hast du sie aus dem Marketplace gekauft, hast sie in den Marketplace reingesetzt."}, {"id": 388, "start": 2415.44, "end": 2420.44, "text": "Normalerweise sollten die dann aus deinem Inventar verschwinden, sind sie wohl auch."}, {"id": 389, "start": 2420.44, "end": 2423.44, "text": "Allerdings intern irgendwie nicht."}, {"id": 390, "start": 2423.44, "end": 2433.44, "text": "Dann bist du zum Quest Board gegangen und dann hatte ich das Quest Board quasi die Fische abgezogen, die du eigentlich gar nicht mehr hattest."}, {"id": 391, "start": 2433.44, "end": 2441.44, "text": "Du hattest die XP gegeben und du konntest zum Marketplace zurück und deine Fische im Auktionshaus cancelen und du hast sie wieder gehabt."}, {"id": 392, "start": 2441.44, "end": 2444.44, "text": "Du konntest quasi so unendlich XP Farmen."}, {"id": 393, "start": 2444.44, "end": 2465.44, "text": "Es war auch bester Back."}, {"id": 394, "start": 2465.44, "end": 2480.44, "text": "So fail, es ist so fail."}, {"id": 395, "start": 2480.44, "end": 2488.44, "text": "Du konntest übrigens, also du konntest glaube ich sogar Items dupen, aber Gold auf jeden Fall und das war irgendein Trading Bug."}, {"id": 396, "start": 2488.44, "end": 2495.44, "text": "Also es gab zwei Gold Duplication Bugs."}, {"id": 397, "start": 2495.44, "end": 2501.44, "text": "Du konntest einmal mit dem Character Transfer dupen, also du konntest quasi irgendwie deinen Character."}, {"id": 398, "start": 2501.44, "end": 2511.44, "text": "Du konntest irgendwie, wie gesagt, nachdem ich selbst nicht spiele, ich kenne sowas wie, du konntest irgendwie Character Transfer machen und vorher dein Geld traden."}, {"id": 399, "start": 2511.44, "end": 2517.44, "text": "Und dann hast du es nach dem Character Transfer wieder gehabt auf dem neuen Server und konntest zurück transferen, das Gold war verdoppelt."}, {"id": 400, "start": 2517.44, "end": 2523.44, "text": "Oder aber du konntest auch über das Trade Window irgendwas buggen."}, {"id": 401, "start": 2523.44, "end": 2525.44, "text": "Also das Geld, dass du das Geld wieder bekommen hast."}, {"id": 402, "start": 2525.44, "end": 2535.44, "text": "Also es war richtig broken as fuck."}, {"id": 403, "start": 2535.44, "end": 2549.44, "text": "Es ist jeden Tag Outpost Rush, es ist immer noch so, dass die Leute gebannt werden, weil sie reported werden."}, {"id": 404, "start": 2549.44, "end": 2553.44, "text": "Das funktioniert ja nicht, selbst das funktioniert ja nicht."}, {"id": 405, "start": 2553.44, "end": 2557.44, "text": "Das funktioniert ja nicht mit den Bands."}, {"id": 406, "start": 2557.44, "end": 2562.44, "text": "Was sagt der Chat, was man kann Bands umgehen, indem man einfach seine E-Mail ändert?"}, {"id": 407, "start": 2562.44, "end": 2565.44, "text": "Was?"}, {"id": 408, "start": 2565.44, "end": 2570.44, "text": "Aber echt äußerst amateurhaft, wenn das wirklich funktioniert."}, {"id": 409, "start": 2570.44, "end": 2572.44, "text": "Was wollte ich jetzt gerade sagen?"}, {"id": 410, "start": 2572.44, "end": 2575.44, "text": "Fuck, was hat er gesagt?"}, {"id": 411, "start": 2575.44, "end": 2577.44, "text": "Achso, das funktioniert ja auch nicht."}, {"id": 412, "start": 2577.44, "end": 2581.44, "text": "Die können ja gar nicht richtig nachvollziehen, wer das gemacht hat."}, {"id": 413, "start": 2581.44, "end": 2583.44, "text": "Man muss sich mal vorstellen, das ist auch relativ schwierig."}, {"id": 414, "start": 2583.44, "end": 2590.44, "text": "Erstens sind die bekannt dafür, falsche Leute zu bannen, weil unfähig."}, {"id": 415, "start": 2590.44, "end": 2601.44, "text": "Und die Leute, die Gold gedupt haben, die haben ja Gold verschickt per Ingame Post und Marketplace und sonst was."}, {"id": 416, "start": 2601.44, "end": 2606.44, "text": "Selbst wenn du das tracken kannst, was willst du machen?"}, {"id": 417, "start": 2606.44, "end": 2617.44, "text": "Willst du jede Ingame Transaction rückgängig machen der letzten zwei Wochen?"}, {"id": 418, "start": 2617.44, "end": 2620.44, "text": "Was latest player kann anbann?"}, {"id": 419, "start": 2620.44, "end": 2621.44, "text": "Wirklich?"}, {"id": 420, "start": 2621.44, "end": 2626.44, "text": "Das kann ich mir nicht vorstellen."}, {"id": 421, "start": 2626.44, "end": 2628.44, "text": "Players kann anbann?"}, {"id": 422, "start": 2628.44, "end": 2631.44, "text": "Haha, was?"}, {"id": 423, "start": 2631.44, "end": 2636.44, "text": "Wait a minute."}, {"id": 424, "start": 2636.44, "end": 2638.44, "text": "Was?"}, {"id": 425, "start": 2638.44, "end": 2645.44, "text": "It appears that Steam Family Sharing allows a player to evade a ban and create a new account."}, {"id": 426, "start": 2645.44, "end": 2647.44, "text": "The same key?"}, {"id": 427, "start": 2647.44, "end": 2648.44, "text": "But it gets worse."}, {"id": 428, "start": 2648.44, "end": 2652.44, "text": "Apparently all it takes to get around a ban is just changing the email address as..."}, {"id": 429, "start": 2652.44, "end": 2653.44, "text": "Hä?"}, {"id": 430, "start": 2653.44, "end": 2658.44, "text": "Moment, ich muss mein Steam-Account-Email-Adresse ändern, dann bin ich unbanned?"}, {"id": 431, "start": 2658.44, "end": 2661.44, "text": "Benutzen die das irgendwie als Identifier oder wie?"}, {"id": 432, "start": 2661.44, "end": 2663.44, "text": "Kein eindeutig..."}, {"id": 433, "start": 2663.44, "end": 2666.44, "text": "Ach Gott, die sind so krass unfähig."}, {"id": 434, "start": 2666.44, "end": 2672.44, "text": "Wie kann man so unfähig sein?"}, {"id": 435, "start": 2672.44, "end": 2675.44, "text": "Ich verstehs nicht."}, {"id": 436, "start": 2675.44, "end": 2678.44, "text": "Ich mein, das sind doch keine Kacknoobs."}, {"id": 437, "start": 2678.44, "end": 2681.44, "text": "Wie kriegen die sowas hin?"}, {"id": 438, "start": 2681.44, "end": 2683.44, "text": "Warum?"}, {"id": 439, "start": 2683.44, "end": 2686.44, "text": "Okay, gucken wir mal erst mal weiter."}, {"id": 440, "start": 2686.44, "end": 2688.44, "text": "Are issuing fans."}, {"id": 441, "start": 2688.44, "end": 2690.44, "text": "The final issue is pretty severe."}, {"id": 442, "start": 2690.44, "end": 2701.44, "text": "Players discovered sharing the game with yourself via Steam's Family Share System or changing the email of your Steam account will actually let you to continue to play the game if you've been banned."}, {"id": 443, "start": 2701.44, "end": 2710.44, "text": "Again, the developers are working on a fix for this, but this is a massive issue as it will allow exploiters and cheaters to get back into the game."}, {"id": 444, "start": 2710.44, "end": 2711.44, "text": "Wetten?"}, {"id": 445, "start": 2711.44, "end": 2715.44, "text": "Die können dich dann auch nicht richtig tracken, wenn du deine E-Mail-Adresse änderst."}, {"id": 446, "start": 2715.44, "end": 2723.44, "text": "Also mal angenommen, du hast Gold gedupt as fuck und du änderst deine E-Mail-Adresse und da können sie dich gar nicht richtig tracken, würd mich nicht wundern."}, {"id": 447, "start": 2723.44, "end": 2731.44, "text": "Having such a rough week, the devs are releasing a blog post outlining all the progress that they've made on these bugs."}, {"id": 448, "start": 2731.44, "end": 2735.44, "text": "What actions they're taking next and they highlighted some engine issues."}, {"id": 449, "start": 2735.44, "end": 2740.44, "text": "You can expect some significant updates in the next few weeks that iron out a lot of the problems."}, {"id": 450, "start": 2740.44, "end": 2744.44, "text": "The critical consensus is in on Call of Duty Vanguard."}, {"id": 451, "start": 2744.44, "end": 2754.44, "text": "Reviewers are saying the game is a decent outing for the franchise, but that it serves as more of a stopgap between Cold War and the next Modern Warfare game than as a standout title."}, {"id": 452, "start": 2754.44, "end": 2762.44, "text": "Before the game was officially revealed, leaks suggested Vanguard was a rush job throwing together COD World War II's assets with Modern Warfare's mechanics."}, {"id": 453, "start": 2762.44, "end": 2770.44, "text": "And while those rumors never held much weight, it's clear that this year's title only makes minor iterations on the template that Modern Warfare established."}, {"id": 454, "start": 2770.44, "end": 2774.44, "text": "Ach nee, Call of Duty macht jedes Jahr minor iterations."}, {"id": 455, "start": 2774.44, "end": 2778.44, "text": "Guckt euch mal FIFA an, FIFA macht auch jedes Jahr nur minor iterations."}, {"id": 456, "start": 2778.44, "end": 2782.44, "text": "Das ist ja mittlerweile Geschäftsmodell bei vielen Serien geworden."}, {"id": 457, "start": 2782.44, "end": 2789.44, "text": "Dass die jedes Jahr oder wenn es sowas ist, was halt mehrere Jahre noch, die machen immer nur minor iterations."}, {"id": 458, "start": 2789.44, "end": 2792.44, "text": "Die gehen null Risiko ein, das ist immer der gleiche Scheiß."}, {"id": 459, "start": 2792.44, "end": 2797.44, "text": "Deswegen ist das auch so ausgelutschter Scheiß mittlerweile alles."}, {"id": 460, "start": 2797.44, "end": 2800.44, "text": "Und es gibt nur noch Serien."}, {"id": 461, "start": 2808.44, "end": 2811.44, "text": "Ich meine, an sich finde ich es eigentlich ganz cool, muss ich sagen."}, {"id": 462, "start": 2811.44, "end": 2817.44, "text": "Also ich hätte echt keine Probleme, wenn es einen ganz guten World War II Shooter geben würde, echt keinen Schmerz mit."}, {"id": 463, "start": 2817.44, "end": 2821.44, "text": "Das Problem, warum ich es mir nicht kaufen werde, ist schlicht und ergreifend die Kombination."}, {"id": 464, "start": 2821.44, "end": 2825.44, "text": "Es ist Call of Duty und es hat quasi Public Skill-Base Matchmaking."}, {"id": 465, "start": 2825.44, "end": 2828.44, "text": "Gegen Skill-Base Matchmaking im Ranked habe ich ja nichts."}, {"id": 466, "start": 2828.44, "end": 2832.44, "text": "Ranked ohne Skill-Base Matchmaking funktioniert ja logischerweise nicht, da wäre es nicht ranked."}, {"id": 467, "start": 2832.44, "end": 2836.44, "text": "Das Bettopfer ist am Start. Danke für den Prime-Sub."}, {"id": 468, "start": 2836.44, "end": 2840.44, "text": "Dann kann man aber wenigstens einen Schwanzvergleich machen mit seinem Rank."}, {"id": 469, "start": 2840.44, "end": 2866.44, "text": "Aber Public Skill-Base Matchmaking ist einfach der größte Scheiß, der jemals erfunden wurde, wo ich keine Lust darauf habe, das zu spielen."}, {"id": 470, "start": 2866.44, "end": 2872.44, "text": "Ein sehr diverser Cast an Charakters."}, {"id": 471, "start": 2872.44, "end": 2874.44, "text": "Das muss heutzutage so sein."}, {"id": 472, "start": 2874.44, "end": 2879.44, "text": "Danke schön für den Sub."}, {"id": 473, "start": 2879.44, "end": 2884.44, "text": "CD sagt, Activision ist der Multiplayer von Cod egal, den geht es nur um Warzone-Integration."}, {"id": 474, "start": 2884.44, "end": 2886.44, "text": "Na wenn denen den Multiplayer egal wäre, dann hätte..."}, {"id": 475, "start": 2886.44, "end": 2894.44, "text": "Also wenn die sich nicht versprechen würden von dem Multiplayer, dann würden die Multiplayer schlicht und ergreifend nicht machen."}, {"id": 476, "start": 2894.44, "end": 2897.44, "text": "Das heißt, sie müssen damit irgendwas bezwecken."}, {"id": 477, "start": 2897.44, "end": 2904.44, "text": "Ja, natürlich, du hast recht, es ist sicherlich auch um Warzone-Verkäufe bzw. Warzone, was ich unlocks, wie auch immer, irgendwas anzuheizen."}, {"id": 478, "start": 2904.44, "end": 2906.44, "text": "Aber ganz so einfach kann es nicht sein."}, {"id": 479, "start": 2906.44, "end": 2916.44, "text": "Es gibt sicherlich eine große Anzahl von Call of Duty-Fans, die mit Warzone nichts großartig anfangen können und die Multiplayer spielen wollen."}, {"id": 480, "start": 2916.44, "end": 2921.44, "text": "Also ganz so einfach ist es nicht."}, {"id": 481, "start": 2921.44, "end": 2928.44, "text": "Und dann gibt es auch kein Skill-Best-Making, also dann könnten sie auch Skill-Best-Making sparen und sowas, wenn sie da nichts reinstecken wollen."}, {"id": 482, "start": 2928.44, "end": 2937.44, "text": "Das ist ganz gezielt drinnen, dass die Leute, dass so diese..."}, {"id": 483, "start": 2937.44, "end": 2948.44, "text": "Ach, ich lock mich einmal die Woche für zwei Stunden abends ein, was weiß ich, wenn meine Kinder beim Fußball spielen und meine Frau irgendwie auf dem Elternabend ist,"}, {"id": 484, "start": 2948.44, "end": 2951.44, "text": "dann lock ich mich mal zwei Stunden ein und spiele eine Runde Vanguard."}, {"id": 485, "start": 2951.44, "end": 2954.44, "text": "So Leute sind das, die nur für die Skill-Best-Making gemacht sind."}, {"id": 486, "start": 2971.44, "end": 2974.44, "text": "Aber auf!"}, {"id": 487, "start": 2974.44, "end": 2981.44, "text": "Also ich will nicht wissen, was da bei Blizzard intern los sein muss, was Overwatch angeht."}, {"id": 488, "start": 2981.44, "end": 2985.44, "text": "Man darf nicht vergessen, das haben die angekündigt, ich glaube 2018 oder so."}, {"id": 489, "start": 2985.44, "end": 2990.44, "text": "Und seitdem ist ja auch der Content für Overwatch 1 quasi nicht vorhanden."}, {"id": 490, "start": 2990.44, "end": 2994.44, "text": "Also da kommt ab und zu mal eine Deathmatch-Map oder so."}, {"id": 491, "start": 2994.44, "end": 2998.44, "text": "Die letzten Jahre ist in Overwatch nichts passiert, gar nichts."}, {"id": 492, "start": 2998.44, "end": 3006.44, "text": "Sowohl lore-technisch kam... na gut, da kamen wir jetzt ab zu meinem Comic oder irgendwas das Unbedeutendes, aber in-game Content mit gar nichts, gar nichts."}, {"id": 493, "start": 3006.44, "end": 3017.44, "text": "So. Und ich gehe davon aus, die wollten das schon in nächster Zeit releasen, aber aus irgendwelchen Gründen haben sie sich umorientiert, was es werden soll."}, {"id": 494, "start": 3017.44, "end": 3028.44, "text": "Jeff Kaplan ist nicht ohne Grund weg und ich habe keinerlei Hoffnung für Overwatch 2. Null."}, {"id": 495, "start": 3034.44, "end": 3039.44, "text": "Hast du mitbekommen, dass McCree unbenannt wird? Ja, McCree ist doch schon unbenannt worden."}, {"id": 496, "start": 3039.44, "end": 3050.44, "text": "Da ist jetzt, wie heißt er, ich glaube Cassidy Cole, Cassidy oder? Nee. Cassidy, Cassidy Cole, Cassidy, irgendwas Cassidy, irgendwas."}, {"id": 497, "start": 3050.44, "end": 3060.44, "text": "Ich weiß nicht, wie McCree jetzt heißt, aber da muss ich sagen, das haben die total, insofern schon taktisch gut, hatten ein gutes Setup."}, {"id": 498, "start": 3060.44, "end": 3072.44, "text": "Wie heißt McCree jetzt? McCree, Cassidy, heißt jetzt Cole, Cassidy, so rum."}, {"id": 499, "start": 3072.44, "end": 3087.44, "text": "Das haben die ganz gut set-up, weil in einem der ursprünglichen lore Videos oder was es war, wurde ja schon quasi gesagt, dass McCree quasi nicht sein echter Name ist, was man ja sich auch denken könnte."}, {"id": 500, "start": 3087.44, "end": 3100.44, "text": "Aber das haben sie insofern ganz gut integriert. Der Grund, warum er McCree unbenannt wurde, ja, an sich hätte ich ja gar keine Schmerzen mit, ich finde es auch nicht schlecht."}, {"id": 501, "start": 3100.44, "end": 3111.44, "text": "Aber es ist so eine typische Blizzard-Geschichte, so nach dem Motto, Welt seht her, wir kümmern uns um die Probleme und Wirklichkeit benennen wir halt bloß einen Character um, ohne dass sich irgendwie nennenswert bei Blizzard was ändert."}, {"id": 502, "start": 3111.44, "end": 3117.44, "text": "Blizzard hat überhaupt kein Interesse daran, dass da irgendwas aufgearbeitet, irgendwas geändert wird, solange der Hubel rollt im Endeffekt."}, {"id": 503, "start": 3117.44, "end": 3125.44, "text": "Ja, ist weg."}, {"id": 504, "start": 3125.44, "end": 3141.44, "text": "Was ich lustig finde, weil der ehemalige Blizzard-Chef ist ja quasi erst vor ein paar Monaten abgedankt, jetzt ist die neue Blizzard-Chefin abgedankt, aber mal gucken was jetzt kommt, wahrscheinlich kommt jetzt irgendein Activision Stonks Anzug an und es wird nicht besser."}, {"id": 505, "start": 3141.44, "end": 3168.44, "text": "Blizzard ist das beste Beispiel für, was passiert, wenn aus, wir machen Spiele, die wir selbst gerne spielen würden, zu, also Blizzard kommt von, wir machen Spiele, die wir selbst gerne spielen würden oder die uns selbst Spaß machen, wir machen Spiele so, wie wir sie selbst mögen würden,"}, {"id": 506, "start": 3168.44, "end": 3180.44, "text": "hin zu, wir haben irgendwelche Stonks-Leute im Anzug ohne Ahnung von Spielen als Chefs. Blizzard ist das beste Beispiel für diese Entwicklung."}, {"id": 507, "start": 3180.44, "end": 3192.44, "text": "Anders kann man es auch nicht erklären. Das hat angefangen mit, im Endeffekt schon während dem ersten Overwatch, das hat eigentlich schon angefangen mit StarCraft 2."}, {"id": 508, "start": 3192.44, "end": 3213.44, "text": "Es war absehbar, dass es berg runter ging. Ohne WoW wäre Blizzard gefühlt dead, gut das ist ja schon lange so, World of Warcraft ist ja quasi das Ding von Blizzard schlechthin gewesen oder ist es glaube ich immer noch, wobei man sagen muss, Blizzard hat auch andere Dinge, gerade Hearthstone es schafft auch gut, scheffelt auch gut Kohle."}, {"id": 509, "start": 3222.44, "end": 3248.44, "text": "Wen? What the fuck, was war das? Moment, es ist Golf, okay das habe ich verstanden, aber was war das für ein Golftyp?"}, {"id": 510, "start": 3248.44, "end": 3269.44, "text": "Warum ist das irgendein Typ in der Wüstenkammer, der Golf spielt?"}, {"id": 511, "start": 3269.44, "end": 3286.44, "text": "Was? Golf mit Killstreaks? Was ist das? Ist das der Battlefield 4 Sniper? Weiß nicht. Mal gucken wie der Battlefield 4 Sniper aussieht."}, {"id": 512, "start": 3286.44, "end": 3303.44, "text": "Das hat tatsächlich gewisse Ähnlichkeiten zum Battlefield 4 Sniper, aber das ist er nicht. Das ist der Battlefield 4 Sniper Leute, das ist der Battlefield 4 Sniper."}, {"id": 513, "start": 3303.44, "end": 3323.44, "text": "Warum ist der Battlefield 4 Sniper in einem Golfspiel? Guck mal, das ist der Battlefield 4 Sniper. Warum ist der Battlefield 4 Sniper in einem Golfspiel? Alles verlaufen."}, {"id": 514, "start": 3333.44, "end": 3341.44, "text": "Das ist ja auch so eine Shitshow gewesen, meine Güte, ich glaube das ist eines der schlecht bewerteten Spiele der Zeit gewesen."}, {"id": 515, "start": 3341.44, "end": 3360.44, "text": "Hast du der Edge of Empires 4 gespielt? Nein, aber ich habe 500 Stunden oder so in dem Teil davor, in den Teilen davor. Ich muss mir das unbedingt noch kaufen."}, {"id": 516, "start": 3360.44, "end": 3379.44, "text": "Juckt mich null. Juckt mich ja mal sowas von mich. Ist mir sowas von egal."}, {"id": 517, "start": 3379.44, "end": 3395.44, "text": "Bozza! Am Start. Bozza am Start. Ist mir auch vollkommen egal. Sowas von egal."}, {"id": 518, "start": 3409.44, "end": 3433.44, "text": "Wirklich? Zack, Zack, Twitch, Splitgate?"}, {"id": 519, "start": 3433.44, "end": 3447.44, "text": "Na ja. Hype, hältschen Grenzen. Muss ich jetzt nicht unbedingt direkt auf die Spielerzahlen auswirken, aber meistens sind Streams ein ganz guter Indikator für."}, {"id": 520, "start": 3447.44, "end": 3460.44, "text": "Ist halt auch 10 Uhr morgens. Na ja, bei uns. Twitch ist ja weltweit."}, {"id": 521, "start": 3460.44, "end": 3480.44, "text": "Irgendwie erinnert mich das trotzdem ein bisschen an Halo. Wer hätte das gedacht, dass es schwierig ist gerade an CPUs zu kommen?"}, {"id": 522, "start": 3480.44, "end": 3492.44, "text": "Es ist so ziemlich schwierig an alles zu kommen gerade in dieser Richtung."}, {"id": 523, "start": 3492.44, "end": 3514.44, "text": "Wir gucken mal. Tatsächlich. Das gucken wir mal kurz, Zack. Splitgate Steam Stats. Lasst mal kurz schauen."}, {"id": 524, "start": 3514.44, "end": 3533.44, "text": "Also den Mega-Hype konnten sie nicht halten. Sagen wir mal so, innerhalb von vier Monaten sind sie halt runter von 67.000 Spieler auf 5.000."}, {"id": 525, "start": 3533.44, "end": 3542.44, "text": "Wobei das nicht schlecht ist, muss man sagen. Also 5.000 Peak-Spieler im Steam-Vergleich ist gar nicht mal so schlecht."}, {"id": 526, "start": 3542.44, "end": 3555.44, "text": "Guck mal hier. Also ich meine, da bist du schon unter Top 100 oder so mit 5.000 Spielern."}, {"id": 527, "start": 3555.44, "end": 3571.44, "text": "Das ist gar nicht mal so mies."}, {"id": 528, "start": 3571.44, "end": 3580.44, "text": "Es ist alles auf Short-Supply. Leute, ich will mir seit Jahren neuen PC kaufen, kannst du vergessen."}, {"id": 529, "start": 3580.44, "end": 3608.44, "text": "Mein PC ist jetzt vier Jahre alt, ziemlich genau."}, {"id": 530, "start": 3608.44, "end": 3617.44, "text": "Was ich bei den Apex Waffen immer lustig finde ist, mich erinnern manche Waffen in Apex wie zum Beispiel dieses Ding voll an Borderlands Waffen."}, {"id": 531, "start": 3617.44, "end": 3623.44, "text": "Guckt euch mal das an. Das Ding. Das könnte original aus Borderlands kommen, oder? Ohne Scheiß."}, {"id": 532, "start": 3623.44, "end": 3639.44, "text": "Das könnte original Borderlands Random Drop Waffe sein."}, {"id": 533, "start": 3639.44, "end": 3649.44, "text": "Ich habe auch eine 1080 Ti. Ja, drei Stücke."}, {"id": 534, "start": 3649.44, "end": 3654.44, "text": "Zumal man ja auch mal sagen muss, der Unterschied ist gar nicht so riesig groß."}, {"id": 535, "start": 3654.44, "end": 3662.44, "text": "Ich meine 60% oder irgendwie sowas. Aber meiner ist ja übertaktet."}, {"id": 536, "start": 3662.44, "end": 3669.44, "text": "Also guck mal, es hält sich wirklich in Grenzen. Single-Core-Performance 64% schneller."}, {"id": 537, "start": 3669.44, "end": 3679.44, "text": "Wenn ich meinen übertakte, sind das keine Ahnung, vielleicht 15%, wo das Ding noch schneller ist."}, {"id": 538, "start": 3679.44, "end": 3684.44, "text": "Also ab 8-Coren wird es natürlich mehr, weil meiner hat bloß 6 Kerne."}, {"id": 539, "start": 3684.44, "end": 3699.44, "text": "Also der Witz ist halt, mein 8700K ein bisschen übertaktet ist im Prinzip auch nur 15-20% langsamer als die aktuelle Top-CPU."}, {"id": 540, "start": 3699.44, "end": 3703.44, "text": "Ja gut, dann nehmen wir den anderen. Was haben wir denn sonst noch hier zu bieten?"}, {"id": 541, "start": 3703.44, "end": 3730.44, "text": "Sag mir eine sinnvolle, die Seite ist scheiße. Ja ok, dann sag mir eine andere Seite, wo man das gut vergleichen kann. Hier, Worth It."}, {"id": 542, "start": 3730.44, "end": 3738.44, "text": "Übertaktens-Stream haben wir doch damals gemacht. Wir haben das doch live hier im Stream mit Elgato-Capture-Karte noch übertaktet, mein Rechner."}, {"id": 543, "start": 3738.44, "end": 3746.44, "text": "Dann habe ich ihn geköpft und dann ging es ab."}, {"id": 544, "start": 3746.44, "end": 3756.44, "text": "Da habe ich meine Zweifel. Da habe ich meine Zweifel, ob das wirklich so ist."}, {"id": 545, "start": 3756.44, "end": 3764.44, "text": "Also mich würden da schon ordentliche Benchmark-Vergleiche interessieren."}, {"id": 546, "start": 3764.44, "end": 3772.44, "text": "Also das mit 20-30% halte ich tatsächlich für realistisch. Hat sich da in den letzten Jahren nicht so wahnsinnig viel getan."}, {"id": 547, "start": 3772.44, "end": 3780.44, "text": "Müssen wir mal gucken. Zumindest hat es eh keinen Sinn, weil ich kaufe mir jetzt keinen neuen Rechner."}, {"id": 548, "start": 3780.44, "end": 3788.44, "text": "Warum sollte ich mir ausgerechnet jetzt einen neuen Rechner kaufen? Ich brauche ja eine neue Grafikkarte. Und was kostet mich aktuell eine 3090?"}, {"id": 549, "start": 3788.44, "end": 3794.44, "text": "Zumal ich auch keine 3090 eigentlich mehr kaufen will. Oh, der Preis-Champ ist abgeschissen."}, {"id": 550, "start": 3794.44, "end": 3810.44, "text": "Für 6. Danke schön für den Sub. Was kostet so eine 3090? 2000 Euro?"}, {"id": 551, "start": 3824.44, "end": 3846.44, "text": "Das ist ja Wahnsinn. Alter, nicht normal."}, {"id": 552, "start": 3846.44, "end": 3854.44, "text": "Was los Rosario? Selten so einen schlechten Tag gehabt wie Freitag. Oh, Pains-Champ."}, {"id": 553, "start": 3854.44, "end": 3860.44, "text": "1&1 hat Merch-Konflikte ausgelöst. Was? Wie schafft es denn 1&1 Merch-Konflikte auszulösen?"}, {"id": 554, "start": 3860.44, "end": 3866.44, "text": "Also man kann sich über den Provider sicherlich öfters beschweren, aber was hat dein Provider mit Merch-Konflikten zu tun?"}, {"id": 555, "start": 3866.44, "end": 3870.44, "text": "Das verstehe ich nicht. Das musst du mir etwas genauer erklären. Das checke ich nicht."}, {"id": 556, "start": 3870.44, "end": 3878.44, "text": "Der Pi kam an, aber fehlte ein Kabel, fiel es Batman. Am Samstag noch Uni."}, {"id": 557, "start": 3878.44, "end": 3890.44, "text": "Was hat 1&1 mit Merch-Konflikten zu tun?"}, {"id": 558, "start": 3890.44, "end": 3896.44, "text": "Es lohnt sich nicht wirklich."}, {"id": 559, "start": 3896.44, "end": 3904.44, "text": "Du bist Consultant für die 1&1 Backendsoftware? Okay, dann ergibt das natürlich Sinn."}, {"id": 560, "start": 3904.44, "end": 3916.44, "text": "Pains-Champ. Dann ist es natürlich doof. Dann verstehe ich auch, wie das Merch-Konflikt auslösen kann."}, {"id": 561, "start": 3916.44, "end": 3930.44, "text": "Obwohl die meisten Merch-Konflikte gar nicht so wild sind. Zumindest bei mir oder bei uns. Aber es kommt natürlich immer darauf an, von welchem Umfang man hier spricht."}, {"id": 562, "start": 3930.44, "end": 3936.44, "text": "Fertig PCS, okay."}, {"id": 563, "start": 3936.44, "end": 3940.44, "text": "Drei Wochen Arbeit von Arsch gewesen."}, {"id": 564, "start": 3940.44, "end": 3948.44, "text": "Massive Pains-Champ. Das ist ja am Preis-Champ echt ganz gut. Man sieht die Preisentwicklung von drei Monaten."}, {"id": 565, "start": 3948.44, "end": 3954.44, "text": "Leider habe ich dieses mit dem ein Jahr auf drei Monate gestellt. Das ist ein Bug. Und ich habe keinen Bock, das zu fixen."}, {"id": 566, "start": 3954.44, "end": 3962.44, "text": "Guck mal, ein Jahr und drei Monate ist das gleiche. Es geht sieben Tage, drei Monate, ein Jahr ist dann das gleiche. Das ist broken."}, {"id": 567, "start": 3962.44, "end": 3968.44, "text": "Das ist ein Feature, genau. Aber das hier ist eigentlich der UVP."}, {"id": 568, "start": 3968.44, "end": 3974.44, "text": "Wann gibt es denn den Nachfolger? Nvidia, was ist denn das dann? 4090?"}, {"id": 569, "start": 3974.44, "end": 3981.44, "text": "Insider Rechnen mit enormem Stromverbrauch. Ja, das Zeug verbraucht immer viel."}, {"id": 570, "start": 3981.44, "end": 3988.44, "text": "Sommer 2022 und möglicher Release im Oktober."}, {"id": 571, "start": 3988.44, "end": 3996.44, "text": "Oh, oh."}, {"id": 572, "start": 3996.44, "end": 4006.44, "text": "550 Watt. Na, abwarten, abwarten."}, {"id": 573, "start": 4006.44, "end": 4014.44, "text": "Ich kaufe mir keinen neuen Rechner. Wisst ihr, dass es das erste Mal ist, dass ich in so einer Situation bin, wie es hier gab?"}, {"id": 574, "start": 4014.44, "end": 4018.44, "text": "Diese Situation, wie jetzt, gab es noch nie."}, {"id": 575, "start": 4018.44, "end": 4026.44, "text": "Also bisher war es eigentlich so, dass ich mir immer gedacht habe, hey, ich könnte mir immer wieder einen neuen Rechner kaufen."}, {"id": 576, "start": 4026.44, "end": 4031.44, "text": "Da war ich entweder zu faul für, zu faul zum Umstellen, zu faul zum Zusammenstellen."}, {"id": 577, "start": 4031.44, "end": 4038.44, "text": "Und irgendwann dachte ich, jetzt wird es aber doch mal Zeit. Dann habe ich geguckt, was es gibt und habe mir dann eingekauft."}, {"id": 578, "start": 4038.44, "end": 4044.44, "text": "Und jetzt ist es so, jetzt stelle ich fest, okay, ich kann mir gar keinen kaufen und ich hoffe einfach nur, dass meiner noch eine Weile hält."}, {"id": 579, "start": 4044.44, "end": 4051.44, "text": "Obwohl er halt schon vier Jahre alt ist. Es gibt ja keine Möglichkeit aktuell, sich einen ordentlichen Rechner zu kaufen, so richtig."}, {"id": 580, "start": 4051.44, "end": 4068.44, "text": "Weil wenn, wenn will ich halt auch was ordentliches und was ordentliches heißt bei mir einfach seit ein paar Jahren so mehr oder weniger das schnellste, was es gibt."}, {"id": 581, "start": 4068.44, "end": 4077.44, "text": "Und ich sehe es halt nicht ein, 3000 Euro zu bezahlen für eine Grafikkarte."}, {"id": 582, "start": 4077.44, "end": 4103.44, "text": "Ja, das ist halt, das ist halt dumm. Deswegen hoffe ich ja auch, meiner tut es noch eine Weile."}, {"id": 583, "start": 4103.44, "end": 4112.44, "text": "Nee, ich will, also eigentlich hatte ich ja letztes Jahr schon vor mir einen Ryzen PC, also ich hatte schon vor zwei Jahren vor mir einen Ryzen PC zu bauen."}, {"id": 584, "start": 4112.44, "end": 4120.44, "text": "Dann habe ich gedacht, man holt sich die 5000er Serie und dann ging das eigentlich alles downhill."}, {"id": 585, "start": 4120.44, "end": 4130.44, "text": "Ach mal gucken, aktuell tut das ja und man muss ja auch sagen, die Kombination aus 8700K und 1080T ist ja vollkommen ausreichend."}, {"id": 586, "start": 4130.44, "end": 4138.44, "text": "Ich stelle Battlefield einfach auf niedrige Details und auf geht's 120 FPS."}, {"id": 587, "start": 4138.44, "end": 4142.44, "text": "Denkst du das nächste Battlefield Spiel spielt wieder in der Vergangenheit?"}, {"id": 588, "start": 4142.44, "end": 4147.44, "text": "Ich warte jetzt erstmal bis es aktuell rauskommt, was das nächste macht, keine Ahnung."}, {"id": 589, "start": 4147.44, "end": 4161.44, "text": "Ich persönlich fände es ja gut, wenn das in einem halbwegs guten Zustand Spaß spielbar ist, dass sie Battlefield 2042 einfach mal 3-4 Jahre supporten."}, {"id": 590, "start": 4161.44, "end": 4170.44, "text": "Apropos, ach ja hier sind es die Leaks zu Battlefield 2042."}, {"id": 591, "start": 4170.44, "end": 4180.44, "text": "Wäre gespannt, ich habe sogar in der Beta 120 FPS teilweise erreicht und die lief beschissen. Hallo, was ist mit Reddit los?"}, {"id": 592, "start": 4180.44, "end": 4183.44, "text": "Was ist mit Reddit los?"}, {"id": 593, "start": 4183.44, "end": 4187.44, "text": "Zack, old."}, {"id": 594, "start": 4187.44, "end": 4190.44, "text": "Was auch immer die da machen."}, {"id": 595, "start": 4190.44, "end": 4194.44, "text": "Hä?"}, {"id": 596, "start": 4194.44, "end": 4209.44, "text": "Was habe ich falsch gemacht?"}, {"id": 597, "start": 4209.44, "end": 4212.44, "text": "So."}, {"id": 598, "start": 4212.44, "end": 4217.44, "text": "I got Battlefield 2042 early."}, {"id": 599, "start": 4217.44, "end": 4224.44, "text": "Wie hat er das?"}, {"id": 600, "start": 4224.44, "end": 4233.44, "text": "Fake oder?"}, {"id": 601, "start": 4233.44, "end": 4237.44, "text": "Also wenn das das einzige ist, was er gepostet hat, das ist doch Fake."}, {"id": 602, "start": 4237.44, "end": 4243.44, "text": "Ich meine, das kann durchaus aus dem Game sein, aber das könnte durchaus aus dem Spiel sein."}, {"id": 603, "start": 4243.44, "end": 4254.44, "text": "Gibt auch Videos, wo gibt es da noch Sachen von ihm?"}, {"id": 604, "start": 4254.44, "end": 4257.44, "text": "Ich habe keine NDA dafür unterschrieben."}, {"id": 605, "start": 4257.44, "end": 4260.44, "text": "Ich schweige denn für für Reddit Leaks."}, {"id": 606, "start": 4260.44, "end": 4265.44, "text": "Hat er da noch irgendwas dazu geschrieben oder?"}, {"id": 607, "start": 4265.44, "end": 4272.44, "text": "I'm in."}, {"id": 608, "start": 4272.44, "end": 4276.44, "text": "Das sieht sehr, sehr echt aus."}, {"id": 609, "start": 4276.44, "end": 4288.44, "text": "Aber warum kann er schon spielen? Ich meine, die Server dürften noch gar nicht da sein."}, {"id": 610, "start": 4288.44, "end": 4293.44, "text": "Warproof Classic Battlefield 3."}, {"id": 611, "start": 4293.44, "end": 4301.44, "text": "Der ist tatsächlich schon am Start."}, {"id": 612, "start": 4301.44, "end": 4309.44, "text": "Der spielt mit gar keinem anscheinend."}, {"id": 613, "start": 4309.44, "end": 4313.44, "text": "Gibt es einen Server Browser?"}, {"id": 614, "start": 4313.44, "end": 4316.44, "text": "Sieht man das Main Menu irgendwo?"}, {"id": 615, "start": 4316.44, "end": 4330.44, "text": "Xbox."}, {"id": 616, "start": 4330.44, "end": 4344.44, "text": "Well, I've been kicked out."}, {"id": 617, "start": 4344.44, "end": 4345.44, "text": "Browse."}, {"id": 618, "start": 4345.44, "end": 4347.44, "text": "Ja, na ja, Moment."}, {"id": 619, "start": 4347.44, "end": 4353.44, "text": "Das ist für das ist für Portal, dass Portal ein Server Browser hat."}, {"id": 620, "start": 4353.44, "end": 4378.44, "text": "Das war ja klar. Ich rede vom normalen Battlefield."}, {"id": 621, "start": 4378.44, "end": 4383.44, "text": "Ja, das ist legit. Gehe ich ganz stark davon aus."}, {"id": 622, "start": 4383.44, "end": 4386.44, "text": "Das ist legit."}, {"id": 623, "start": 4386.44, "end": 4391.44, "text": "Allerdings so wirklich viel sehen tut man jetzt ja nicht."}, {"id": 624, "start": 4391.44, "end": 4403.44, "text": "Warum man schon spielen kann, ist natürlich die große Frage."}, {"id": 625, "start": 4403.44, "end": 4405.44, "text": "Warum die Server schon da sind, ist eine gute Frage."}, {"id": 626, "start": 4405.44, "end": 4408.44, "text": "Na ja, wahrscheinlich, weil sie selbst noch testen wollen."}, {"id": 627, "start": 4408.44, "end": 4414.44, "text": "Warum das nicht irgendwie gesichert ist? Ach, keine Ahnung."}, {"id": 628, "start": 4414.44, "end": 4425.44, "text": "Du kannst es ja nicht starten, wenn du preloaded hast normalerweise."}, {"id": 629, "start": 4425.44, "end": 4432.44, "text": "Na ja, so wirklich viel spannendes ist jetzt ja nicht zu sehen."}, {"id": 630, "start": 4432.44, "end": 4435.44, "text": "Was hältst du von unrate Abstand?"}, {"id": 631, "start": 4435.44, "end": 4437.44, "text": "Nicht, dass es schlecht wäre oder so. Ich habe damit noch nichts gemacht."}, {"id": 632, "start": 4437.44, "end": 4444.44, "text": "Ich wüsste doch nicht, wofür."}, {"id": 633, "start": 4444.44, "end": 4447.44, "text": "Na ja, ist jetzt recht unspektakulär."}, {"id": 634, "start": 4447.44, "end": 4451.44, "text": "Aber wo der eine Typ auf Reddit recht hatte, ist, dass es jetzt 30"}, {"id": 635, "start": 4451.44, "end": 4473.44, "text": "Milliarden Leak Videos geben wird."}, {"id": 636, "start": 4473.44, "end": 4481.44, "text": "Na ja, egal, es ist in einer Woche, wissen wir es."}, {"id": 637, "start": 4481.44, "end": 4487.44, "text": "Er hat ein paar Fragen beantwortet, okay. Schauen wir mal schnell."}, {"id": 638, "start": 4487.44, "end": 4503.44, "text": "Und jetzt hier."}, {"id": 639, "start": 4503.44, "end": 4514.44, "text": "Es spielt an Xbox."}, {"id": 640, "start": 4514.44, "end": 4523.44, "text": "Das stimmt ja nicht."}, {"id": 641, "start": 4523.44, "end": 4530.44, "text": "Na gut, es hält sich sehr in Grenzen."}, {"id": 642, "start": 4530.44, "end": 4533.44, "text": "Egal."}, {"id": 643, "start": 4533.44, "end": 4535.44, "text": "Warum kommen wir weiter?"}, {"id": 644, "start": 4535.44, "end": 4536.44, "text": "Auch hier werden MikroTik-Switch empfohlen."}, {"id": 645, "start": 4536.44, "end": 4540.44, "text": "Zeigt mal her, ob ich da zustimmen kann."}, {"id": 646, "start": 4540.44, "end": 4544.44, "text": "Ja, der ist tatsächlich ganz gut, aber ich würde eher noch einen nehmen."}, {"id": 647, "start": 4544.44, "end": 4547.44, "text": "Wobei, worum ging es denn überhaupt?"}, {"id": 648, "start": 4547.44, "end": 4555.44, "text": "Ein paar, was?"}, {"id": 649, "start": 4555.44, "end": 4558.44, "text": "Kann mir einer Empfehlung geben für Max, für einen, was ist denn ein"}, {"id": 650, "start": 4558.44, "end": 4560.44, "text": "Max-Port-Switch?"}, {"id": 651, "start": 4560.44, "end": 4562.44, "text": "Du willst, ach so acht Ports."}, {"id": 652, "start": 4562.44, "end": 4564.44, "text": "Acht Ports-Switch-Management plus PoE."}, {"id": 653, "start": 4564.44, "end": 4571.44, "text": "Okay, plus PoE ist das Problem, weil ohne PoE hätte ich dir den hier empfohlen."}, {"id": 654, "start": 4571.44, "end": 4577.44, "text": "Moment."}, {"id": 655, "start": 4577.44, "end": 4579.44, "text": "Ohne PoE hätte ich dir den hier empfohlen, wobei ich mir gar nicht sehe,"}, {"id": 656, "start": 4579.44, "end": 4581.44, "text": "wer hat der PoE? Ich glaube, der hat keinen PoE."}, {"id": 657, "start": 4581.44, "end": 4584.44, "text": "Hätte ich dir den hier empfohlen, weil das ist eigentlich preis-leistungsmäßig"}, {"id": 658, "start": 4584.44, "end": 4586.44, "text": "so ziemlich der beste Switch, den du gerade kaufen kannst."}, {"id": 659, "start": 4586.44, "end": 4591.44, "text": "Acht Ports Gigabit, zwei Ports SFP plus zehn Gigabit, aber ich glaube,"}, {"id": 660, "start": 4591.44, "end": 4595.44, "text": "der hat keinen PoE."}, {"id": 661, "start": 4595.44, "end": 4599.44, "text": "Nein, der hat keinen PoE."}, {"id": 662, "start": 4599.44, "end": 4604.44, "text": "Ja, mit PoE muss man, dann wüsste ich jetzt nichts."}, {"id": 663, "start": 4604.44, "end": 4610.44, "text": "In der Richtung."}, {"id": 664, "start": 4610.44, "end": 4614.44, "text": "Wann kann man den Gram nicht irgendwie filtern?"}, {"id": 665, "start": 4614.44, "end": 4618.44, "text": "Nach PoE oder nicht PoE?"}, {"id": 666, "start": 4618.44, "end": 4622.44, "text": "Ich will nicht PoE in, ich will PoE out."}, {"id": 667, "start": 4622.44, "end": 4626.44, "text": "PoE in brauche ich nicht, ich brauche PoE out."}, {"id": 668, "start": 4626.44, "end": 4635.44, "text": "PoE, PoE."}, {"id": 669, "start": 4635.44, "end": 4641.44, "text": "PoE."}, {"id": 670, "start": 4641.44, "end": 4648.44, "text": "Aber das, also ich würde halt einen nehmen mit Gigabit 10G, mindestens mal mit 10G,"}, {"id": 671, "start": 4648.44, "end": 4651.44, "text": "alles andere sack doch."}, {"id": 672, "start": 4651.44, "end": 4656.44, "text": "In der heutigen Zeit."}, {"id": 673, "start": 4656.44, "end": 4660.44, "text": "Das hier macht einen ganz guten Eindruck, 24 Ports, viermal SFP plus,"}, {"id": 674, "start": 4660.44, "end": 4664.44, "text": "397 Euro, krasse, doch eigentlich nice."}, {"id": 675, "start": 4664.44, "end": 4667.44, "text": "Aber es sind mehr Ports, wie du willst. Ja ne, da fällt mir nichts gescheites ein,"}, {"id": 676, "start": 4667.44, "end": 4672.44, "text": "was passt."}, {"id": 677, "start": 4672.44, "end": 4680.44, "text": "Stonks, der hat eindeutig zu wenig Geld, da brauchen wir."}, {"id": 678, "start": 4680.44, "end": 4682.44, "text": "Was ist denn Passive PoE?"}, {"id": 679, "start": 4682.44, "end": 4685.44, "text": "Oh, wahrscheinlich irgendwie."}, {"id": 680, "start": 4685.44, "end": 4689.44, "text": "Irgendwas, was Mikrotik da treibt, entweder 24 Volt, 48 Volt,"}, {"id": 681, "start": 4689.44, "end": 4691.44, "text": "ach, kein Schimmer."}, {"id": 682, "start": 4691.44, "end": 4693.44, "text": "PoE Standards Null."}, {"id": 683, "start": 4693.44, "end": 4698.44, "text": "Aber wofür 10G im Home Bereich, die Frage ist hier, warum kein 10G?"}, {"id": 684, "start": 4698.44, "end": 4701.44, "text": "Vor allem, wenn man sich jetzt einen neuen Switch kauft."}, {"id": 685, "start": 4701.44, "end": 4707.44, "text": "Zumindest mal zwei 10G Ports sind relativ günstig und man hat die Möglichkeit,"}, {"id": 686, "start": 4707.44, "end": 4711.44, "text": "damit halt was zu machen, wenn man will, kann es ja auch sein lassen."}, {"id": 687, "start": 4711.44, "end": 4713.44, "text": "Aber, also heute, warum?"}, {"id": 688, "start": 4713.44, "end": 4719.44, "text": "Also gerade wenn es ein Switch ist hier für Zentrale am Schreibtisch oder so,"}, {"id": 689, "start": 4719.44, "end": 4723.44, "text": "ich würde mir eigentlich nichts mehr holen, ohne 10G."}, {"id": 690, "start": 4723.44, "end": 4728.44, "text": "Mindestens zwei 10G Ports."}, {"id": 691, "start": 4728.44, "end": 4735.44, "text": "Sogar der Switch auf meinem Basteltisch hat zwei mal 10G Ports."}, {"id": 692, "start": 4735.44, "end": 4743.44, "text": "Jo, ok, gucken wir mal weiter, was haben wir sonst noch schönes zu gucken?"}, {"id": 693, "start": 4743.44, "end": 4745.44, "text": "Der Lockpicking Lawyer ist am Start."}, {"id": 694, "start": 4745.44, "end": 4748.44, "text": "Ja, den Vanguard Test von der GameStar wollte ich mir noch angucken,"}, {"id": 695, "start": 4748.44, "end": 4750.44, "text": "ob sich das Spiel in irgendeiner Art und Weise lohnt."}, {"id": 696, "start": 4750.44, "end": 4752.44, "text": "Mal gucken, wer den Test spricht."}, {"id": 697, "start": 4752.44, "end": 4755.44, "text": "Je nachdem, behalte ich mir vor, das Anzug zu brechen."}, {"id": 698, "start": 4755.44, "end": 4757.44, "text": "Mal gucken."}, {"id": 699, "start": 4759.44, "end": 4762.44, "text": "Ah, ist das Dimitri?"}, {"id": 700, "start": 4762.44, "end": 4764.44, "text": "Ist das Dimitri? Ich weiß es nicht."}, {"id": 701, "start": 4764.44, "end": 4766.44, "text": "Wer ist das?"}, {"id": 702, "start": 4767.44, "end": 4771.44, "text": "Nein, das ist nicht Dimitri, das ist Christian Fritz Schneider."}, {"id": 703, "start": 4771.44, "end": 4773.44, "text": "Alles klar."}, {"id": 704, "start": 4773.44, "end": 4779.44, "text": "Ach, das ist nicht der mit dem Bart, der aussieht wie von Vikings."}, {"id": 705, "start": 4779.44, "end": 4782.44, "text": "Ach, das läuft ein bisschen doppelt."}, {"id": 706, "start": 4782.44, "end": 4806.44, "text": "So, gucken wir uns jetzt mal an."}, {"id": 707, "start": 4806.44, "end": 4810.44, "text": "Ich muss das anders machen mit dem Sound, so hört sich das richtig kacke an."}, {"id": 708, "start": 4810.44, "end": 4813.44, "text": "Ich muss gerade mal re-loaden."}, {"id": 709, "start": 4813.44, "end": 4816.44, "text": "... in Berlin auf einer Geheimmission unterwegs ist,"}, {"id": 710, "start": 4816.44, "end": 4820.44, "text": "ziemlich konstruiert und bei der Zusammensetzung der Gruppe"}, {"id": 711, "start": 4820.44, "end": 4823.44, "text": "sogar regelrecht anbiedernd wirkte."}, {"id": 712, "start": 4823.44, "end": 4826.44, "text": "Und so irre weit hergeholt wäre so ein Vorwurf vielleicht auch gar nicht."}, {"id": 713, "start": 4826.44, "end": 4828.44, "text": "Schließlich freuen sich die Entwicklerinnen..."}, {"id": 714, "start": 4828.44, "end": 4830.44, "text": "Zusammensetzung der Gruppe relativ anbiedernd."}, {"id": 715, "start": 4830.44, "end": 4836.44, "text": "Möchte er damit umschreiben, dass das quasi besonders divers sein muss,"}, {"id": 716, "start": 4836.44, "end": 4839.44, "text": "weil es so einen Shitstorm gibt?"}, {"id": 717, "start": 4839.44, "end": 4841.44, "text": "Das ist ja auch garantiert so wäre."}, {"id": 718, "start": 4841.44, "end": 4843.44, "text": "Wir haben Videos unverhohlen darüber, dass der Zweite Weltkrieg"}, {"id": 719, "start": 4843.44, "end": 4847.44, "text": "ja zum Glück an so vielen tollen diversen Schauplätzen stattfand."}, {"id": 720, "start": 4859.44, "end": 4863.44, "text": "Der Grad der Geschmacklosigkeit hat da also schon längst einen neuen Höchststand erreicht,"}, {"id": 721, "start": 4863.44, "end": 4865.44, "text": "aber ich will hier nicht die Moraleposte spielen."}, {"id": 722, "start": 4865.44, "end": 4868.44, "text": "Ich habe schließlich auch jedes Jahr Spaß an den Ballerbuden von Activision"}, {"id": 723, "start": 4868.44, "end": 4871.44, "text": "und ich habe auch kein Problem damit am Computer Krieg zu spielen,"}, {"id": 724, "start": 4871.44, "end": 4874.44, "text": "weil ich den Unterschied zwischen Fiktion und Realität kenne."}, {"id": 725, "start": 4874.44, "end": 4877.44, "text": "Ja, aber ist die Lautstärke irgendwie merkwürdig?"}, {"id": 726, "start": 4877.44, "end": 4879.44, "text": "Am Anfang viel lauter und jetzt leiser?"}, {"id": 727, "start": 4879.44, "end": 4881.44, "text": "Nee, das geht jetzt."}, {"id": 728, "start": 4881.44, "end": 4884.44, "text": "Denn selbst in dem einzigen längeren Abschnitt,"}, {"id": 729, "start": 4884.44, "end": 4888.44, "text": "der vor Release zu sehen war, nämlich ein Level in Stalingrad,"}, {"id": 730, "start": 4888.44, "end": 4891.44, "text": "wirkten die Szenen manchmal noch merkwürdig unfertig."}, {"id": 731, "start": 4891.44, "end": 4893.44, "text": "Hier fehlt zum Beispiel die halbe Beleuchtung."}, {"id": 732, "start": 4893.44, "end": 4898.44, "text": "Das wundert mich nicht, es wird auch nie im Leben wieder gepatcht."}, {"id": 733, "start": 4900.44, "end": 4903.44, "text": "Moment, das ist aber Vorschau, das ist Vorschau gewesen."}, {"id": 734, "start": 4903.44, "end": 4906.44, "text": "Was ist das jetzt? MonkaS?"}, {"id": 735, "start": 4906.44, "end": 4908.44, "text": "Dieses Video wird präsentiert."}, {"id": 736, "start": 4910.44, "end": 4913.44, "text": "Nein, jetzt fangen die auch schon damit an."}, {"id": 737, "start": 4914.44, "end": 4915.44, "text": "...von..."}, {"id": 738, "start": 4916.44, "end": 4917.44, "text": "...die Kampagne..."}, {"id": 739, "start": 4918.44, "end": 4920.44, "text": "Doch meine Sorge war über weite Strecken unbegründet."}, {"id": 740, "start": 4920.44, "end": 4923.44, "text": "Die Kampagne von Call of Duty ist ein solides Blockbuster-Erlebnis"}, {"id": 741, "start": 4923.44, "end": 4925.44, "text": "mit viel Abwechslung."}, {"id": 742, "start": 4925.44, "end": 4927.44, "text": "Ja, das wäre ich jetzt auch vorausgegangen."}, {"id": 743, "start": 4927.44, "end": 4929.44, "text": "...figuren und guter Technik."}, {"id": 744, "start": 4930.44, "end": 4933.44, "text": "Sogar die Schatten haben es noch nach Stalingrad geschafft."}, {"id": 745, "start": 4934.44, "end": 4937.44, "text": "Es ist ganz schön gutes Wetter in Stalingrad, oder?"}, {"id": 746, "start": 4938.44, "end": 4939.44, "text": "Chat."}, {"id": 747, "start": 4939.44, "end": 4942.44, "text": "Also das hat ja gerade einer geschrieben, aber..."}, {"id": 748, "start": 4942.44, "end": 4945.44, "text": "...es ist schon erstaunlich gutes Wetter."}, {"id": 749, "start": 4945.44, "end": 4949.44, "text": "...und verglichen mit dem fast schon experimentellen Cold War"}, {"id": 750, "start": 4949.44, "end": 4952.44, "text": "vom letzten Jahr, das sich ja über weite Strecken..."}, {"id": 751, "start": 4952.44, "end": 4953.44, "text": "Cold War!"}, {"id": 752, "start": 4953.44, "end": 4956.44, "text": "Ich hab ganz ehrlich, ich glaub die Multiplayer hab ich gar nicht gespielt"}, {"id": 753, "start": 4956.44, "end": 4958.44, "text": "oder ganz kurz nur gespielt."}, {"id": 754, "start": 4958.44, "end": 4960.44, "text": "Ich wollte eigentlich die Black Ops Kampagne mir angucken"}, {"id": 755, "start": 4960.44, "end": 4964.44, "text": "und ich muss sagen, die hat echt viel verschenktes Potential gehabt."}, {"id": 756, "start": 4968.44, "end": 4971.44, "text": "Die Ansätze waren echt da, aber die haben viel verschenktes Potential gehabt"}, {"id": 757, "start": 4971.44, "end": 4972.44, "text": "in der Kampagne."}, {"id": 758, "start": 4972.44, "end": 4974.44, "text": "...er wie ein Agentenzriller spielte..."}, {"id": 759, "start": 4974.44, "end": 4978.44, "text": "Ich find immer noch, die beste Call of Duty Kampagne ist für mich"}, {"id": 760, "start": 4978.44, "end": 4979.44, "text": "also die drei."}, {"id": 761, "start": 4979.44, "end": 4980.44, "text": "Sagen wir mal die Top 3."}, {"id": 762, "start": 4980.44, "end": 4984.44, "text": "Die Top 3 Kampagnen sind für mich immer noch Black Ops 1,"}, {"id": 763, "start": 4984.44, "end": 4987.44, "text": "CoD 4 und MW2."}, {"id": 764, "start": 4987.44, "end": 4990.44, "text": "Ich bin da sonst nix mal rangekommen."}, {"id": 765, "start": 5002.44, "end": 5007.44, "text": "Also MW2, der Modern Warfare Reboot"}, {"id": 766, "start": 5007.44, "end": 5010.44, "text": "der war schon zu..."}, {"id": 767, "start": 5010.44, "end": 5013.44, "text": "der Call of Duty war immer scriptet, aber"}, {"id": 768, "start": 5013.44, "end": 5015.44, "text": "da hast du schon zu wenig gespielt."}, {"id": 769, "start": 5015.44, "end": 5018.44, "text": "Das war ja quasi nur noch fast auf Schienen."}, {"id": 770, "start": 5018.44, "end": 5036.44, "text": "Also nee, das hat mir nicht so gut gefallen."}, {"id": 771, "start": 5036.44, "end": 5041.44, "text": "Wer kauft Call of Duty für die Story?"}, {"id": 772, "start": 5041.44, "end": 5044.44, "text": "Relativ viele Leute, weil sonst würden sie keine Story machen."}, {"id": 773, "start": 5044.44, "end": 5048.44, "text": "Aber auf den Außenabschnitten kann sich Vanguard sehen lassen."}, {"id": 774, "start": 5048.44, "end": 5053.44, "text": "Die Wüstenlandschaft von Tobruk sieht dank Photogrammetrietechnik umwerfend aus."}, {"id": 775, "start": 5053.44, "end": 5057.44, "text": "Die Luftschlacht von Midway ist ein gewaltiges Spektakel."}, {"id": 776, "start": 5057.44, "end": 5060.44, "text": "Ja, aber wahrscheinlich typisch Call of Duty mäßig"}, {"id": 777, "start": 5060.44, "end": 5065.44, "text": "absolut sinnloses, anspruchsloses, entweder Quicktime Event"}, {"id": 778, "start": 5065.44, "end": 5068.44, "text": "oder was man eigentlich gar nicht verkaufen kann."}, {"id": 779, "start": 5068.44, "end": 5072.44, "text": "Ich sag's euch, das ist so ein Ding, wo du eigentlich nur 2 cm links und rechts scheuern kannst"}, {"id": 780, "start": 5072.44, "end": 5075.44, "text": "und der Rest passiert wahrscheinlich automatisch."}, {"id": 781, "start": 5075.44, "end": 5079.44, "text": "Das wird wahrscheinlich wirklich Noob Scheiß hoch 3 sein."}, {"id": 782, "start": 5079.44, "end": 5083.44, "text": "Die Luftschlacht von Midway ist ein gewaltiges Spektakel"}, {"id": 783, "start": 5083.44, "end": 5087.44, "text": "und selbst der Gang durch den Flugzeugträger ist ein Augenschmaus."}, {"id": 784, "start": 5087.44, "end": 5091.44, "text": "Besonders eindrucksvoll sind dabei diesmal die Lichtstimmungen"}, {"id": 785, "start": 5091.44, "end": 5093.44, "text": "und allgemein der Einsatz von Beleuchtung."}, {"id": 786, "start": 5093.44, "end": 5097.44, "text": "Vanguard ist sicherlich einer der ästhetisch interessantesten Serienteile."}, {"id": 787, "start": 5097.44, "end": 5101.44, "text": "Und auch der Soundtrack, oder besser gesagt, der dynamische Score"}, {"id": 788, "start": 5101.44, "end": 5105.44, "text": "sticht gerade in der ersten Spielhälfte deutlich hervor."}, {"id": 789, "start": 5106.44, "end": 5111.44, "text": "Erste Spielhälfte heißt in der Call of Duty Kampagne 1,5 Stunden oder so."}, {"id": 790, "start": 5112.44, "end": 5114.44, "text": "Ungefähr ist das die erste Spielhälfte."}, {"id": 791, "start": 5114.44, "end": 5116.44, "text": "Wahrscheinlich also 3 Stunden Kampagne oder sowas."}, {"id": 792, "start": 5116.44, "end": 5125.44, "text": "Klingt aber wirklich ganz nett, der Score."}, {"id": 793, "start": 5132.44, "end": 5135.44, "text": "Willst du ernsthaft den League Arcane Launch verpassen? Ja."}, {"id": 794, "start": 5135.44, "end": 5137.44, "text": "Ich spiel kein Loll."}, {"id": 795, "start": 5137.44, "end": 5143.44, "text": "Telefonmast."}, {"id": 796, "start": 5167.44, "end": 5170.44, "text": "Bei all dem Hass und der grundsätzlichen Ablehnung,"}, {"id": 797, "start": 5170.44, "end": 5173.44, "text": "die den Call of Duty Kampagnen oft entgegenschlägt,"}, {"id": 798, "start": 5173.44, "end": 5178.44, "text": "muss auch mal gesagt werden, dass es diese Art von Hollywood-artiger Bombastunterhaltung"}, {"id": 799, "start": 5178.44, "end": 5181.44, "text": "abseits von Call of Duty eigentlich gar nicht mehr gibt."}, {"id": 800, "start": 5181.44, "end": 5184.44, "text": "Da hat er nicht unrecht, ja."}, {"id": 801, "start": 5184.44, "end": 5189.44, "text": "Alle anderen Mitbewerber haben diese Art von Popcornunterhaltung ja längst aufgegeben"}, {"id": 802, "start": 5189.44, "end": 5194.44, "text": "oder müssen sie aus finanziellen Gründen auf einer deutlich kleineren Flamme köcheln."}, {"id": 803, "start": 5194.44, "end": 5198.44, "text": "Von daher freue ich mich jedes Jahr auf eine neue Dosis Call of Duty Kampagne."}, {"id": 804, "start": 5198.44, "end": 5203.44, "text": "Aber genau da beginnt das Problem von Call of Duty Vanguard."}, {"id": 805, "start": 5203.44, "end": 5206.44, "text": "Denn auch beim Publisher Activision geht man wohl davon aus..."}, {"id": 806, "start": 5206.44, "end": 5209.44, "text": "Es ist wirklich gutes Wetter in Stalingrad, muss man mal sagen."}, {"id": 807, "start": 5209.44, "end": 5211.44, "text": "...jedes Jahr super verkauft."}, {"id": 808, "start": 5211.44, "end": 5214.44, "text": "Also kann man ja einfach mal das machen, was so viele Filmstudios..."}, {"id": 809, "start": 5214.44, "end": 5218.44, "text": "Das ist halt so dieses Call of Duty Ding, das fand ich schon immer kacke."}, {"id": 810, "start": 5218.44, "end": 5221.44, "text": "Sie können ja Schlachten und Inszenierung gut,"}, {"id": 811, "start": 5221.44, "end": 5230.44, "text": "aber diese Camps, die wirken immer so dermaßen statisch und gewollt und nicht gekonnt."}, {"id": 812, "start": 5230.44, "end": 5235.44, "text": "Du siehst, jeder Soldat hat nur zwei Animationen, es passiert gar nichts."}, {"id": 813, "start": 5235.44, "end": 5238.44, "text": "Wir sollten die einfach weglassen."}, {"id": 814, "start": 5238.44, "end": 5241.44, "text": "Und was auch die Call of Duty Serie hier schon mal ausprobiert hat,"}, {"id": 815, "start": 5241.44, "end": 5244.44, "text": "nämlich eine neue Marke zu etablieren."}, {"id": 816, "start": 5244.44, "end": 5246.44, "text": "Bei Modern Warfare oder..."}, {"id": 817, "start": 5246.44, "end": 5251.44, "text": "Übrigens, Fun Fact, weil ich gerade seinen Namen sehe hier."}, {"id": 818, "start": 5251.44, "end": 5254.44, "text": "Efril Fehnbroff."}, {"id": 819, "start": 5254.44, "end": 5258.44, "text": "Wusstet ihr, dass man den Tennisspieler Roger Federer,"}, {"id": 820, "start": 5258.44, "end": 5261.44, "text": "oder Federer, wie spricht man aus, Roger Federer,"}, {"id": 821, "start": 5261.44, "end": 5265.44, "text": "dass die Hälfte seines Namens auf der Kampagne,"}, {"id": 822, "start": 5265.44, "end": 5270.44, "text": "dass die Hälfte seines Namens aus ER besteht?"}, {"id": 823, "start": 5272.44, "end": 5275.44, "text": "Verlegt euch das mal."}, {"id": 824, "start": 5276.44, "end": 5280.44, "text": "Die Hälfte des Namens besteht aus ER."}, {"id": 825, "start": 5285.44, "end": 5288.44, "text": "Gut, dass ich das jetzt mal erwähnt habe."}, {"id": 826, "start": 5288.44, "end": 5291.44, "text": "Auch die Call of Duty Serie hier schon mal ausprobiert hat,"}, {"id": 827, "start": 5291.44, "end": 5294.44, "text": "nämlich eine neue Marke zu etablieren."}, {"id": 828, "start": 5294.44, "end": 5296.44, "text": "Bei Modern Warfare oder Black Ops"}, {"id": 829, "start": 5296.44, "end": 5299.44, "text": "hat das innerhalb des Call of Duty Universums funktioniert."}, {"id": 830, "start": 5299.44, "end": 5301.44, "text": "Bei Call of Duty Ghosts..."}, {"id": 831, "start": 5301.44, "end": 5303.44, "text": "Oh Gott, Ghosts!"}, {"id": 832, "start": 5303.44, "end": 5306.44, "text": "...mit der Idee auf die Nase gefallen."}, {"id": 833, "start": 5306.44, "end": 5309.44, "text": "Denn im Unterschied zu Modern Warfare 1 und Black Ops 1,"}, {"id": 834, "start": 5309.44, "end": 5312.44, "text": "die zunächst als Standalone-Spiele entwickelt wurden"}, {"id": 835, "start": 5312.44, "end": 5316.44, "text": "und auch so funktionierten, also ein abgeschlossenes Erlebnisboten,"}, {"id": 836, "start": 5316.44, "end": 5319.44, "text": "das mit den Fortsetzungen nur ausgebaut wurde,"}, {"id": 837, "start": 5319.44, "end": 5322.44, "text": "setzte Ghosts gleich auf ein Cliffhanger-Ende..."}, {"id": 838, "start": 5322.44, "end": 5324.44, "text": "Ja, das war kacke."}, {"id": 839, "start": 5324.44, "end": 5327.44, "text": "...und fühlte sich dadurch schon ziemlich unbefriedigend an."}, {"id": 840, "start": 5327.44, "end": 5330.44, "text": "Warte mal, war Ghosts das mit Kevin Spacey?"}, {"id": 841, "start": 5330.44, "end": 5333.44, "text": "Nee, was war das? Nee, das war Advanced Warfare, ne?"}, {"id": 842, "start": 5333.44, "end": 5336.44, "text": "Ghosts war das mit Jon Snow."}, {"id": 843, "start": 5337.44, "end": 5339.44, "text": "Oder?"}, {"id": 844, "start": 5339.44, "end": 5341.44, "text": "Oder bitte bringe ich... Nee."}, {"id": 845, "start": 5341.44, "end": 5343.44, "text": "Warte mal."}, {"id": 846, "start": 5343.44, "end": 5346.44, "text": "Nein, Infinite Warfare war das mit Jon Snow."}, {"id": 847, "start": 5346.44, "end": 5350.44, "text": "Und Advanced Warfare war das mit Kevin Spacey?"}, {"id": 848, "start": 5350.44, "end": 5353.44, "text": "Wer war denn der Typ in Ghosts?"}, {"id": 849, "start": 5357.44, "end": 5360.44, "text": "Ach, Ghosts war mit dem Hund, genau!"}, {"id": 850, "start": 5360.44, "end": 5363.44, "text": "Mit dem Hund, der Door-Preachers machen konnte."}, {"id": 851, "start": 5363.44, "end": 5365.44, "text": "Stimmt, genau."}, {"id": 852, "start": 5367.44, "end": 5370.44, "text": "Und genau das macht Call of Duty Vanguard jetzt auch."}, {"id": 853, "start": 5370.44, "end": 5373.44, "text": "Doch während bei Ghosts vor dem Abspann"}, {"id": 854, "start": 5373.44, "end": 5376.44, "text": "immerhin noch eines der spektakulärsten Finale"}, {"id": 855, "start": 5376.44, "end": 5379.44, "text": "der ganzen Serie abgefeuert wurde,"}, {"id": 856, "start": 5379.44, "end": 5382.44, "text": "als der Kampf im Weltraum begann,"}, {"id": 857, "start": 5382.44, "end": 5385.44, "text": "über eine Panzerschlacht in der Wüste reichte"}, {"id": 858, "start": 5385.44, "end": 5388.44, "text": "und schließlich in einer Magnetschwebebahn endete,"}, {"id": 859, "start": 5388.44, "end": 5391.44, "text": "gibt's bei Vanguard am Ende nur eine für Call of Duty-Verhältnisse"}, {"id": 860, "start": 5391.44, "end": 5394.44, "text": "eher unspektakuläre Standardballerei."}, {"id": 861, "start": 5394.44, "end": 5397.44, "text": "Danach heißt es dann, hey, die wirklich tollen Sachen"}, {"id": 862, "start": 5397.44, "end": 5400.44, "text": "erzählen wir dann im Zombie-Modus oder in einem Multiplayer-Update"}, {"id": 863, "start": 5400.44, "end": 5403.44, "text": "oder in einer möglichen Fortsetzung,"}, {"id": 864, "start": 5403.44, "end": 5406.44, "text": "die ihr doch eh alle kaufen werdet, oder?"}, {"id": 865, "start": 5406.44, "end": 5409.44, "text": "Ja, da hat er nicht unrecht."}, {"id": 866, "start": 5409.44, "end": 5412.44, "text": "Ja."}, {"id": 867, "start": 5412.44, "end": 5415.44, "text": "Da sieht man aber auch, dass diese Spiele"}, {"id": 868, "start": 5415.44, "end": 5418.44, "text": "halt nicht gemacht werden von Leuten, also..."}, {"id": 869, "start": 5418.44, "end": 5421.44, "text": "Wobei, das will ich Ihnen gar nicht absprechen,"}, {"id": 870, "start": 5421.44, "end": 5424.44, "text": "dass vielleicht die einzelnen Programmierer und Entwickler"}, {"id": 871, "start": 5424.44, "end": 5427.44, "text": "daran wirklich da noch ihre Liebe reinstecken, ja."}, {"id": 872, "start": 5427.44, "end": 5430.44, "text": "Aber dass das Gesamt-Ding"}, {"id": 873, "start": 5430.44, "end": 5433.44, "text": "einfach Massenware"}, {"id": 874, "start": 5433.44, "end": 5436.44, "text": "ohne..."}, {"id": 875, "start": 5436.44, "end": 5439.44, "text": "Wie soll man sagen? Ohne..."}, {"id": 876, "start": 5439.44, "end": 5442.44, "text": "Ohne Tiefgang..."}, {"id": 877, "start": 5442.44, "end": 5445.44, "text": "...ist. Das trifft, glaube ich, ganz gut."}, {"id": 878, "start": 5445.44, "end": 5448.44, "text": "Weil die denken sich,"}, {"id": 879, "start": 5448.44, "end": 5451.44, "text": "hey, warum sollte ich da noch jemals wieder was dran machen,"}, {"id": 880, "start": 5451.44, "end": 5454.44, "text": "wenn's nicht rund ist? Ich mach einfach nächstes Jahr das nächste."}, {"id": 881, "start": 5454.44, "end": 5457.44, "text": "Vanguard auch an. Wir erleben hier zwar durchaus"}, {"id": 882, "start": 5457.44, "end": 5460.44, "text": "die Origin-Geschichten der einzelnen Teammitglieder in Rückblenden,"}, {"id": 883, "start": 5460.44, "end": 5463.44, "text": "aber wir bekommen nicht mal die Origin-Story des ganzen Teams"}, {"id": 884, "start": 5463.44, "end": 5466.44, "text": "an sich. Wie hat sich diese Truppe zusammengefunden?"}, {"id": 885, "start": 5466.44, "end": 5469.44, "text": "Ja. Keine Ahnung. Dabei ist gerade das Zusammenspiel"}, {"id": 886, "start": 5469.44, "end": 5472.44, "text": "der Helden durchaus eine Stärke von Vanguard,"}, {"id": 887, "start": 5472.44, "end": 5475.44, "text": "auch wenn wir es außerhalb von vorgerenderten"}, {"id": 888, "start": 5475.44, "end": 5478.44, "text": "Zwischensequenzen kaum zu sehen bekommen. Die sehen übrigens"}, {"id": 889, "start": 5478.44, "end": 5481.44, "text": "echt toll aus, also die CGI-Sequenzen. Bisschen schade, dass sie nicht"}, {"id": 890, "start": 5481.44, "end": 5484.44, "text": "mit 60 FPS laufen, weil sie dadurch im Vergleich zum Gameplay etwas"}, {"id": 891, "start": 5484.44, "end": 5487.44, "text": "ruckelig wirken. Warum nicht?"}, {"id": 892, "start": 5487.44, "end": 5490.44, "text": "Warum kriegt man das bis heute nicht hin,"}, {"id": 893, "start": 5490.44, "end": 5493.44, "text": "zwischen..."}, {"id": 894, "start": 5493.44, "end": 5496.44, "text": "Ist das Captain Price im Zweiten Weltkrieg,"}, {"id": 895, "start": 5496.44, "end": 5499.44, "text": "oder was ist das, wenn's fertig ist?"}, {"id": 896, "start": 5499.44, "end": 5502.44, "text": "Das sieht fast aus wie Captain Price, Alter."}, {"id": 897, "start": 5502.44, "end": 5505.44, "text": "Also auch bombardiert,"}, {"id": 898, "start": 5505.44, "end": 5508.44, "text": "das sieht cinematischer aus. Aber 30 FPS,"}, {"id": 899, "start": 5508.44, "end": 5511.44, "text": "ich meine, die könnten den Scheiß da ohne Probleme mit 60 FPS"}, {"id": 900, "start": 5511.44, "end": 5514.44, "text": "rendern. Gut, ich meine, das Spiel hat jetzt schon wahrscheinlich"}, {"id": 901, "start": 5514.44, "end": 5517.44, "text": "30 FPS, oder so."}, {"id": 902, "start": 5517.44, "end": 5520.44, "text": "Ja, und?"}, {"id": 903, "start": 5520.44, "end": 5523.44, "text": "Es ist ja nicht so, als hätten die in irgendeiner..."}, {"id": 904, "start": 5523.44, "end": 5526.44, "text": "Captain Eagle."}, {"id": 905, "start": 5526.44, "end": 5529.44, "text": "Es ist doch jetzt nicht so, als hätten die irgendwie"}, {"id": 906, "start": 5529.44, "end": 5532.44, "text": "Zeitbegrenzung damit. Quatsch, das könnten sie auch."}, {"id": 907, "start": 5532.44, "end": 5535.44, "text": "Das könnten die auch in 60 FPS rendern. Und Leute,"}, {"id": 908, "start": 5535.44, "end": 5538.44, "text": "die könnten einfach auch"}, {"id": 909, "start": 5538.44, "end": 5541.44, "text": "post-processing"}, {"id": 910, "start": 5541.44, "end": 5544.44, "text": "oder hochrechnen. Das hab ich auch gemacht mit Handyvideos,"}, {"id": 911, "start": 5544.44, "end": 5547.44, "text": "die ich aufgenommen hab, bei mir auf dem Rechner."}, {"id": 912, "start": 5547.44, "end": 5550.44, "text": "Und das sieht auch brauchbar aus."}, {"id": 913, "start": 5550.44, "end": 5553.44, "text": "Aber am besten ist natürlich direkt mit 60 FPS rendern."}, {"id": 914, "start": 5553.44, "end": 5556.44, "text": "Und das können die auch machen."}, {"id": 915, "start": 5556.44, "end": 5559.44, "text": "Ruckelig, ja."}, {"id": 916, "start": 5559.44, "end": 5562.44, "text": "Die Vision ist hervorragend. Da könnte man einen eigenen"}, {"id": 917, "start": 5562.44, "end": 5565.44, "text": "kompletten Renderfilm draus machen. Aber zurück zum Thema."}, {"id": 918, "start": 5565.44, "end": 5568.44, "text": "Call of Duty Vengard erinnert mit so einem Fortsetzung folgt Ansatz"}, {"id": 919, "start": 5568.44, "end": 5571.44, "text": "an die ganzen gescheitersten... Exquisite Musik hier."}, {"id": 920, "start": 5571.44, "end": 5574.44, "text": "...Versuche im Kino in den letzten 20 Jahren von Jumper über"}, {"id": 921, "start": 5574.44, "end": 5577.44, "text": "Ich bin Nummer 4 bis zum Die Mumie-Film mit Tom Cruise,"}, {"id": 922, "start": 5577.44, "end": 5580.44, "text": "der eigentlich das Dark Universe hätte kickstarten sollen..."}, {"id": 923, "start": 5580.44, "end": 5583.44, "text": "Der was? Was für ein Dark Universe?"}, {"id": 924, "start": 5583.44, "end": 5586.44, "text": "Das soll jetzt zwar nicht heißen, dass Vengard dasselbe Schicksal"}, {"id": 925, "start": 5586.44, "end": 5589.44, "text": "nicht hätte, aber weil es aus derselben Arroganz heraus"}, {"id": 926, "start": 5589.44, "end": 5592.44, "text": "entwickelt wurde, nämlich aus der Idee heraus,"}, {"id": 927, "start": 5592.44, "end": 5595.44, "text": "dass man für eine Serie nicht erst mal mit einem richtig"}, {"id": 928, "start": 5595.44, "end": 5598.44, "text": "guten ersten Teil loslegen muss, sondern einfach gleich"}, {"id": 929, "start": 5598.44, "end": 5601.44, "text": "auf die Fortsetzung vertrösten kann."}, {"id": 930, "start": 5601.44, "end": 5604.44, "text": "Jetzt hab ich aber eingangs gesagt, dass Vengard ein solides"}, {"id": 931, "start": 5604.44, "end": 5607.44, "text": "Blockbuster-Erlebnis bietet und meine Sorge um das Spiel"}, {"id": 932, "start": 5607.44, "end": 5610.44, "text": "größtenteils unbegründet war. Wie passt das also mit..."}, {"id": 933, "start": 5610.44, "end": 5613.44, "text": "Erst mal stealthen, aber dann durch die Zäune fahren."}, {"id": 934, "start": 5613.44, "end": 5616.44, "text": "Über das Ende oder, sagen wir besser..."}, {"id": 935, "start": 5616.44, "end": 5619.44, "text": "Die stealthen gar nicht. Und die Antwort liegt tatsächlich"}, {"id": 936, "start": 5619.44, "end": 5622.44, "text": "in diesem letzten Drittel. Das sind so Anzeigen,"}, {"id": 937, "start": 5622.44, "end": 5625.44, "text": "die mir bei Call of Duty immer auf den Sack gehen."}, {"id": 938, "start": 5625.44, "end": 5628.44, "text": "F zum Aussteigen drücken. Wenn das quasi"}, {"id": 939, "start": 5628.44, "end": 5631.44, "text": "normal in das Spiel integriert wäre,"}, {"id": 940, "start": 5631.44, "end": 5634.44, "text": "dass du öfters mal in Autos reingehst und rausgehst,"}, {"id": 941, "start": 5634.44, "end": 5637.44, "text": "dann wüsstest du, dass du F zum Aussteigen drücken musst."}, {"id": 942, "start": 5637.44, "end": 5640.44, "text": "Aber nachdem das wahrscheinlich nur einmal vorkommt"}, {"id": 943, "start": 5640.44, "end": 5643.44, "text": "für diese Quicktime-Sequenz, ist das so dumm."}, {"id": 944, "start": 5646.44, "end": 5649.44, "text": "F zum Aussteigen, nicht für Respekt."}, {"id": 945, "start": 5649.44, "end": 5652.44, "text": "Jetzt pressen wir F zum Aussteigen."}, {"id": 946, "start": 5652.44, "end": 5655.44, "text": "Und die Antwort liegt tatsächlich in diesem letzten Drittel,"}, {"id": 947, "start": 5655.44, "end": 5658.44, "text": "wenn klar wird, dass da nicht mehr mehr kommt und dass"}, {"id": 948, "start": 5658.44, "end": 5661.44, "text": "Vengard zudem auch noch unter denselben Problemen wie Cold War leidet."}, {"id": 949, "start": 5661.44, "end": 5664.44, "text": "Cold War fehlte für seine zahlreichen neuen Ideen"}, {"id": 950, "start": 5664.44, "end": 5667.44, "text": "und Ansätze, nämlich vorne und hinten, die Zeit."}, {"id": 951, "start": 5667.44, "end": 5670.44, "text": "Das Spiel hätte doppelt oder dreimal so lang sein müssen,"}, {"id": 952, "start": 5670.44, "end": 5673.44, "text": "damit sich die Elemente wirklich hätten behalten können."}, {"id": 953, "start": 5673.44, "end": 5676.44, "text": "So toll die Neuerungen auch waren."}, {"id": 954, "start": 5676.44, "end": 5679.44, "text": "Und so ist es bei Vengard jetzt auch, dass ja"}, {"id": 955, "start": 5679.44, "end": 5682.44, "text": "fünf steuerbare Figuren einführen muss und"}, {"id": 956, "start": 5682.44, "end": 5685.44, "text": "vieren davon auch noch spezielle Fähigkeiten gibt."}, {"id": 957, "start": 5685.44, "end": 5688.44, "text": "Teamanführer Arthur kann Befehle erteilen,"}, {"id": 958, "start": 5688.44, "end": 5691.44, "text": "Pilot Wade kann seine Sinne schärfen"}, {"id": 959, "start": 5691.44, "end": 5694.44, "text": "und dann Gegner durch Deckungen hindurchsiehen und so weiter."}, {"id": 960, "start": 5694.44, "end": 5697.44, "text": "Das würde mich mal interessieren, wie sehr man"}, {"id": 961, "start": 5697.44, "end": 5700.44, "text": "da seine Sinne schärfen muss, damit man Gegner durch die Wand sieht."}, {"id": 962, "start": 5700.44, "end": 5703.44, "text": "Habt ihr eine Idee, was man da, was"}, {"id": 963, "start": 5703.44, "end": 5706.44, "text": "muss man da so zu sich nehmen, dass das funktioniert?"}, {"id": 964, "start": 5706.44, "end": 5709.44, "text": "Dafür diese Elemente, in denen gerade mal"}, {"id": 965, "start": 5709.44, "end": 5712.44, "text": "neun Missionen des Spiels aber kaum Zeit bleibt,"}, {"id": 966, "start": 5712.44, "end": 5715.44, "text": "wirken sie eher wie Unix. Ja, dann siehst du vielleicht"}, {"id": 967, "start": 5715.44, "end": 5718.44, "text": "Leute durch die Wand, die sind aber nicht da."}, {"id": 968, "start": 5718.44, "end": 5721.44, "text": "Selbst eine neue Gegnerart, die sich unter Beschuss"}, {"id": 969, "start": 5721.44, "end": 5724.44, "text": "der Nebel von Rauchgranaten versteckt, also auch Gameplay"}, {"id": 970, "start": 5724.44, "end": 5727.44, "text": "technisch wirklich mal eine schöne Neuerung, kommt so selten"}, {"id": 971, "start": 5727.44, "end": 5730.44, "text": "zum Einsatz. Wer, wer, wer kennt's nicht?"}, {"id": 972, "start": 5730.44, "end": 5733.44, "text": "Wer kennt's nicht? Ja, in Berlin die"}, {"id": 973, "start": 5733.44, "end": 5736.44, "text": "Leute mit dem Smokgranatengürtel."}, {"id": 974, "start": 5736.44, "end": 5739.44, "text": "Auftreten wie ein Teaser für ein anderes,"}, {"id": 975, "start": 5739.44, "end": 5742.44, "text": "größeres Spiel wirkt. Das alles wirkt dann zudem"}, {"id": 976, "start": 5742.44, "end": 5745.44, "text": "auch noch unbefriedigender als beispielsweise die Kampagne"}, {"id": 977, "start": 5745.44, "end": 5748.44, "text": "von Call of Duty World War II, die zwar auch solche"}, {"id": 978, "start": 5748.44, "end": 5751.44, "text": "Wunderheiten verzichtete, sie dadurch aber auch nicht"}, {"id": 979, "start": 5751.44, "end": 5754.44, "text": "zu Schnickschnack vorkommen ließ."}, {"id": 980, "start": 5754.44, "end": 5757.44, "text": "Und apropos World War II, da gab es in der Singleplayer"}, {"id": 981, "start": 5757.44, "end": 5760.44, "text": "Kampagne ja kein Fadenkreuz, bei Vanguard ist es"}, {"id": 982, "start": 5760.44, "end": 5763.44, "text": "wieder dabei. Gab es da ein Fadenkreuz?"}, {"id": 983, "start": 5763.44, "end": 5766.44, "text": "Dafür könnt ihr aber die Funktionsweise des Deckungssystems"}, {"id": 984, "start": 5766.44, "end": 5769.44, "text": "ach, ich kann mich an die World War II Kampagne erinnern."}, {"id": 985, "start": 5769.44, "end": 5772.44, "text": "Die hat mir nicht so richtig gut gefallen."}, {"id": 986, "start": 5772.44, "end": 5775.44, "text": "Nur die Sprachausgabe lässt sich leider"}, {"id": 987, "start": 5775.44, "end": 5778.44, "text": "nicht gesondert von den Untertiteln einstellen."}, {"id": 988, "start": 5778.44, "end": 5781.44, "text": "Das ist doof."}, {"id": 989, "start": 5781.44, "end": 5784.44, "text": "Ja, das ist blöd."}, {"id": 990, "start": 5794.44, "end": 5797.44, "text": "Ey, das ist der Hobbit, oder?"}, {"id": 991, "start": 5799.44, "end": 5802.44, "text": "Also der, der Herr der Ringe."}, {"id": 992, "start": 5802.44, "end": 5805.44, "text": "Hobbit."}, {"id": 993, "start": 5833.44, "end": 5836.44, "text": "Das ist doch 100% gleiche Schauspieler."}, {"id": 994, "start": 5836.44, "end": 5839.44, "text": "Oder das Facemodel, sagt man da."}, {"id": 995, "start": 5840.44, "end": 5843.44, "text": "Oje, Toss, Toss."}, {"id": 996, "start": 5843.44, "end": 5858.44, "text": "Toss."}, {"id": 997, "start": 5873.44, "end": 5876.44, "text": "Das hat zwar mit dem eigentlichen Gameplay"}, {"id": 998, "start": 5876.44, "end": 5879.44, "text": "dann nichts zu tun, aber da die Render zwischen"}, {"id": 999, "start": 5879.44, "end": 5882.44, "text": "Sequenzen einen nicht zu unterschätzenden Teil"}, {"id": 1000, "start": 5882.44, "end": 5885.44, "text": "der rund 5 Spielstunden einnehmen..."}, {"id": 1001, "start": 5885.44, "end": 5888.44, "text": "Wisst ihr was man da jetzt direkt erkannt hat?"}, {"id": 1002, "start": 5888.44, "end": 5891.44, "text": "Dass die Typen sind Facemodeled"}, {"id": 1003, "start": 5891.44, "end": 5894.44, "text": "und Motion Captured und die Sekretärin nicht."}, {"id": 1004, "start": 5894.44, "end": 5897.44, "text": "Guckt euch das mal an."}, {"id": 1005, "start": 5897.44, "end": 5900.44, "text": "Die Sekretärin ist einfach normal klassisch animiert."}, {"id": 1006, "start": 5900.44, "end": 5903.44, "text": "Guckt euch den Unterschied hierzu an."}, {"id": 1007, "start": 5903.44, "end": 5906.44, "text": "Guckt, die Sekretärin ist einfach ganz normal animiert"}, {"id": 1008, "start": 5906.44, "end": 5909.44, "text": "und gelesen."}, {"id": 1009, "start": 5909.44, "end": 5912.44, "text": "Und die Typen sind halt..."}, {"id": 1010, "start": 5912.44, "end": 5940.44, "text": "So viele Toss-Symbole."}, {"id": 1011, "start": 5940.44, "end": 5943.44, "text": "Jetzt ist halt Massenware."}, {"id": 1012, "start": 5943.44, "end": 5946.44, "text": "Da kann man leider nichts mehr"}, {"id": 1013, "start": 5946.44, "end": 5949.44, "text": "wirklich tiefgreifendes erwarten."}, {"id": 1014, "start": 5949.44, "end": 5952.44, "text": "Was doof ist, aber ist halt leider so."}, {"id": 1015, "start": 5952.44, "end": 5955.44, "text": "Oh nein, der Song, der hat jetzt noch gefehlt"}, {"id": 1016, "start": 5955.44, "end": 5982.44, "text": "hinten drauf."}, {"id": 1017, "start": 5982.44, "end": 5985.44, "text": "So, was gucken wir uns als nächstes an?"}, {"id": 1018, "start": 5985.44, "end": 5988.44, "text": "Motorisierte Schublade."}, {"id": 1019, "start": 5988.44, "end": 5991.44, "text": "Core-S-Binding."}, {"id": 1020, "start": 5991.44, "end": 5994.44, "text": "Cringe-Job-Postings."}, {"id": 1021, "start": 5994.44, "end": 5997.44, "text": "Der Auer ist auch wieder am Start."}, {"id": 1022, "start": 5997.44, "end": 6000.44, "text": "Können wir uns angucken?"}, {"id": 1023, "start": 6000.44, "end": 6003.44, "text": "Oh, das ist witzig gewesen."}, {"id": 1024, "start": 6003.44, "end": 6006.44, "text": "Da habe ich die ersten paar Minuten..."}, {"id": 1025, "start": 6006.44, "end": 6009.44, "text": "Da habe ich die ersten paar Minuten..."}, {"id": 1026, "start": 6009.44, "end": 6012.44, "text": "Da habe ich die ersten paar Minuten"}, {"id": 1027, "start": 6012.44, "end": 6015.44, "text": "und morgen auf dem Handy geguckt."}, {"id": 1028, "start": 6015.44, "end": 6018.44, "text": "Das ist so fail, Alter."}, {"id": 1029, "start": 6018.44, "end": 6021.44, "text": "Ich glaube, das müssen wir jetzt gucken."}, {"id": 1030, "start": 6021.44, "end": 6024.44, "text": "Alter, was die für eine Scheiße erzählen."}, {"id": 1031, "start": 6024.44, "end": 6027.44, "text": "Ich weiß nicht, dass wir Flat-Earser im Chat haben,"}, {"id": 1032, "start": 6027.44, "end": 6030.44, "text": "die sich jetzt angegriffen fühlen."}, {"id": 1033, "start": 6030.44, "end": 6033.44, "text": "Und wenn nicht Pech gehabt, ja."}, {"id": 1034, "start": 6033.44, "end": 6036.44, "text": "Aber das ist wirklich lustig,"}, {"id": 1035, "start": 6036.44, "end": 6039.44, "text": "was die Typen erzählen."}, {"id": 1036, "start": 6039.44, "end": 6042.44, "text": "Das müssen wir uns jetzt angucken."}, {"id": 1037, "start": 6042.44, "end": 6045.44, "text": "Da sind Dinge drin in diesem Video."}, {"id": 1038, "start": 6045.44, "end": 6048.44, "text": "Die erzählen dir zum Beispiel..."}, {"id": 1039, "start": 6048.44, "end": 6051.44, "text": "Passt mal auf, ich spoilere eine Sache."}, {"id": 1040, "start": 6051.44, "end": 6054.44, "text": "Die sagen, dass die Anzahl deiner Finger"}, {"id": 1041, "start": 6054.44, "end": 6057.44, "text": "ein Beleg dafür ist,"}, {"id": 1042, "start": 6057.44, "end": 6060.44, "text": "dass die Erde eine Scheibe sein muss."}, {"id": 1043, "start": 6060.44, "end": 6063.44, "text": "Sowas kommt da in dem Video."}, {"id": 1044, "start": 6063.44, "end": 6066.44, "text": "Ich habe einfach abgedreht, was die Typen erzählen."}, {"id": 1045, "start": 6069.44, "end": 6072.44, "text": "Ich sehe keine die Lautstärke, stimmt nicht."}, {"id": 1046, "start": 6072.44, "end": 6075.44, "text": "Okay."}, {"id": 1047, "start": 6075.44, "end": 6078.44, "text": "Okay."}, {"id": 1048, "start": 6091.44, "end": 6094.44, "text": "Was?"}, {"id": 1049, "start": 6094.44, "end": 6099.44, "text": "Oh."}, {"id": 1050, "start": 6099.44, "end": 6102.44, "text": "Hä?"}, {"id": 1051, "start": 6110.44, "end": 6113.44, "text": "Moment."}, {"id": 1052, "start": 6113.44, "end": 6116.44, "text": "Das habe ich beim ersten Mal angeschaut."}, {"id": 1053, "start": 6116.44, "end": 6119.44, "text": "Es gibt Flat-Earth-Konferenzen?"}, {"id": 1054, "start": 6119.44, "end": 6122.44, "text": "Sowas wie CCC, quasi nur für Flat-Earth?"}, {"id": 1055, "start": 6122.44, "end": 6125.44, "text": "Oder so."}, {"id": 1056, "start": 6125.44, "end": 6128.44, "text": "Wusste ich gar nicht."}, {"id": 1057, "start": 6128.44, "end": 6131.44, "text": "Warum nicht?"}, {"id": 1058, "start": 6131.44, "end": 6134.44, "text": "Sowas wie die Games-Konferenzen für Flat-Earth."}, {"id": 1059, "start": 6134.44, "end": 6137.44, "text": "Genau."}, {"id": 1060, "start": 6147.44, "end": 6150.44, "text": "Oh nein."}, {"id": 1061, "start": 6150.44, "end": 6153.44, "text": "Erst mal."}, {"id": 1062, "start": 6157.44, "end": 6160.44, "text": "Okay."}, {"id": 1063, "start": 6168.44, "end": 6171.44, "text": "Ich ahne Schlimmes."}, {"id": 1064, "start": 6175.44, "end": 6178.44, "text": "Proof."}, {"id": 1065, "start": 6178.44, "end": 6181.44, "text": "Okay, Leute."}, {"id": 1066, "start": 6181.44, "end": 6184.44, "text": "Soll ich euch mal was richtig mind-blowing zeigen?"}, {"id": 1067, "start": 6184.44, "end": 6187.44, "text": "Ich hoffe, das geht mit dem Foto."}, {"id": 1068, "start": 6187.44, "end": 6190.44, "text": "Wenn es eine Fish-Eye-Lens ist, funktioniert das nicht."}, {"id": 1069, "start": 6190.44, "end": 6193.44, "text": "Soll ich euch mal mind-blowing Sachen zeigen?"}, {"id": 1070, "start": 6193.44, "end": 6196.44, "text": "Guckt mal."}, {"id": 1071, "start": 6196.44, "end": 6199.44, "text": "Wenn ihr einen Screenshot macht"}, {"id": 1072, "start": 6199.44, "end": 6202.44, "text": "von einem Bild, wo man sieht, dass die Erde flach ist,"}, {"id": 1073, "start": 6202.44, "end": 6205.44, "text": "dann macht ihr einen Screenshot."}, {"id": 1074, "start": 6205.44, "end": 6208.44, "text": "Geht in Paint. Ich hoffe, das funktioniert mit diesem Foto jetzt."}, {"id": 1075, "start": 6208.44, "end": 6211.44, "text": "Oder wir gehen nicht in Paint. Da geht ihr in irgendein Programm,"}, {"id": 1076, "start": 6211.44, "end": 6214.44, "text": "wo man ordentlich Bilder einfügen kann."}, {"id": 1077, "start": 6214.44, "end": 6217.44, "text": "Und dann"}, {"id": 1078, "start": 6217.44, "end": 6220.44, "text": "nehmt ihr einfach das Foto."}, {"id": 1079, "start": 6220.44, "end": 6223.44, "text": "Macht das Foto rein."}, {"id": 1080, "start": 6223.44, "end": 6226.44, "text": "Und dann schiebt ihr das Foto zusammen."}, {"id": 1081, "start": 6226.44, "end": 6229.44, "text": "Und dann seht ihr, fuck, das funktioniert nicht,"}, {"id": 1082, "start": 6229.44, "end": 6232.44, "text": "weil das nicht gerade ist."}, {"id": 1083, "start": 6232.44, "end": 6235.44, "text": "Jetzt zeige ich euch, wenn wir ein anderes Foto haben."}, {"id": 1084, "start": 6235.44, "end": 6238.44, "text": "Wenn man den Kram zusammenschiebt,"}, {"id": 1085, "start": 6238.44, "end": 6241.44, "text": "ich bin mir nicht ganz sicher."}, {"id": 1086, "start": 6241.44, "end": 6244.44, "text": "Das kann man mathematisch erklären."}, {"id": 1087, "start": 6244.44, "end": 6247.44, "text": "Wenn man hier auf diesem Scale"}, {"id": 1088, "start": 6247.44, "end": 6250.44, "text": "die Krümmung nicht sieht, aber es zusammenschiebt,"}, {"id": 1089, "start": 6250.44, "end": 6253.44, "text": "dann sieht man es."}, {"id": 1090, "start": 6253.44, "end": 6270.44, "text": "Dann muss man abwarten."}, {"id": 1091, "start": 6270.44, "end": 6273.44, "text": "Jetzt sind wir schon mal voll Flat Earths zu Gott."}, {"id": 1092, "start": 6273.44, "end": 6276.44, "text": "Alles klar."}, {"id": 1093, "start": 6276.44, "end": 6283.44, "text": "What does Flat Earth ultimately mean?"}, {"id": 1094, "start": 6283.44, "end": 6286.44, "text": "Flat Earth meint das, was das Wort sagt."}, {"id": 1095, "start": 6286.44, "end": 6289.44, "text": "Die Erde ist flach."}, {"id": 1096, "start": 6289.44, "end": 6292.44, "text": "This thing was designed."}, {"id": 1097, "start": 6292.44, "end": 6295.44, "text": "Top to bottom, bottom to top."}, {"id": 1098, "start": 6295.44, "end": 6298.44, "text": "If that truly is the case, then it is an abysmal design."}, {"id": 1099, "start": 6298.44, "end": 6301.44, "text": "Nothing can be proven, and one explanation violates another."}, {"id": 1100, "start": 6301.44, "end": 6304.44, "text": "You might want to go back to the drawing board on this one"}, {"id": 1101, "start": 6304.44, "end": 6307.44, "text": "if you think it's that good."}, {"id": 1102, "start": 6307.44, "end": 6310.44, "text": "You can prove that this thing was created,"}, {"id": 1103, "start": 6310.44, "end": 6313.44, "text": "that you were designed,"}, {"id": 1104, "start": 6313.44, "end": 6316.44, "text": "and you can do it just by looking at the human body."}, {"id": 1105, "start": 6316.44, "end": 6319.44, "text": "What we're going to do is show that the human being"}, {"id": 1106, "start": 6319.44, "end": 6322.44, "text": "is a perfectly proportioned, perfectly ratioed temple."}, {"id": 1107, "start": 6322.44, "end": 6325.44, "text": "Was sind wir?"}, {"id": 1108, "start": 6325.44, "end": 6328.44, "text": "Hat er sich manche Leute schon mal angeguckt?"}, {"id": 1109, "start": 6328.44, "end": 6331.44, "text": "Perfectly proportioned, perfectly ratioed temple"}, {"id": 1110, "start": 6331.44, "end": 6334.44, "text": "How is the Holy Spirit?"}, {"id": 1111, "start": 6334.44, "end": 6337.44, "text": "Ich bin mir da nicht so ganz sicher,"}, {"id": 1112, "start": 6337.44, "end": 6340.44, "text": "ob das nicht manche Leute schon mal angeguckt hat."}, {"id": 1113, "start": 6340.44, "end": 6343.44, "text": "Meint er wirklich?"}, {"id": 1114, "start": 6343.44, "end": 6346.44, "text": "Naja, egal."}, {"id": 1115, "start": 6346.44, "end": 6349.44, "text": "Das heißt, wir haben nur so perfekte Proportionen?"}, {"id": 1116, "start": 6349.44, "end": 6352.44, "text": "Auch Gott, meine Güte!"}, {"id": 1117, "start": 6352.44, "end": 6355.44, "text": "How bloody arrogant can you be?"}, {"id": 1118, "start": 6355.44, "end": 6358.44, "text": "There are animals in the world that can see better than us,"}, {"id": 1119, "start": 6358.44, "end": 6361.44, "text": "hear better than us, smell better than us,"}, {"id": 1120, "start": 6361.44, "end": 6364.44, "text": "run faster than us, are stronger than us,"}, {"id": 1121, "start": 6364.44, "end": 6367.44, "text": "and can fly."}, {"id": 1122, "start": 6367.44, "end": 6370.44, "text": "Es gibt auch welche, die sind fetter als wir."}, {"id": 1123, "start": 6370.44, "end": 6373.44, "text": "Ach ja."}, {"id": 1124, "start": 6378.44, "end": 6381.44, "text": "Das ist ja auch so."}, {"id": 1125, "start": 6381.44, "end": 6384.44, "text": "Das ist ja auch nicht so."}, {"id": 1126, "start": 6384.44, "end": 6387.44, "text": "Wenn man sich das anguckt, man kommt im Leben nicht darauf raus,"}, {"id": 1127, "start": 6387.44, "end": 6390.44, "text": "dass es so ist."}, {"id": 1128, "start": 6395.44, "end": 6398.44, "text": "Ach ja."}, {"id": 1129, "start": 6398.44, "end": 6401.44, "text": "Also sprich, umso öfter man das sagt,"}, {"id": 1130, "start": 6401.44, "end": 6418.44, "text": "wahrer ist es oder wie?"}, {"id": 1131, "start": 6418.44, "end": 6421.44, "text": "Auffall."}, {"id": 1132, "start": 6421.44, "end": 6424.44, "text": "Wie gesagt, es wird noch viel abgedrehter."}, {"id": 1133, "start": 6424.44, "end": 6427.44, "text": "Da erzählt euch gleich, dass ihr die flache Erde"}, {"id": 1134, "start": 6427.44, "end": 6430.44, "text": "anhand eurer Finger beweisen könnt."}, {"id": 1135, "start": 6430.44, "end": 6433.44, "text": "Jaja."}, {"id": 1136, "start": 6449.44, "end": 6452.44, "text": "Ja, das ist eine gute Frage."}, {"id": 1137, "start": 6452.44, "end": 6455.44, "text": "Das ist eine gute Frage, wenn man sagt,"}, {"id": 1138, "start": 6455.44, "end": 6458.44, "text": "dass die Erde flach ist. Ist der Mond?"}, {"id": 1139, "start": 6458.44, "end": 6461.44, "text": "Aber das wäre eine wirklich gute, eine sinnvolle Frage,"}, {"id": 1140, "start": 6461.44, "end": 6464.44, "text": "wenn man behauptet, dass die Erde flach ist,"}, {"id": 1141, "start": 6464.44, "end": 6467.44, "text": "ob der Mond auch flach ist, was sie dazu sagen würden."}, {"id": 1142, "start": 6467.44, "end": 6470.44, "text": "Das würde mich jetzt wirklich mal interessieren."}, {"id": 1143, "start": 6470.44, "end": 6473.44, "text": "Und was mich auch interessieren würde, ist,"}, {"id": 1144, "start": 6473.44, "end": 6476.44, "text": "wie man erklären möchte, dass wenn die Sonne,"}, {"id": 1145, "start": 6476.44, "end": 6479.44, "text": "wenn man am Meer steht, das ist ja für mich so der,"}, {"id": 1146, "start": 6479.44, "end": 6482.44, "text": "also das ist für mich so die Sache, wo ich gerne mal"}, {"id": 1147, "start": 6482.44, "end": 6485.44, "text": "von Flat Earthern die Erklärung hören würde,"}, {"id": 1148, "start": 6485.44, "end": 6488.44, "text": "wenn ihr eine Drohne mit Kamera geht ans Meer"}, {"id": 1149, "start": 6488.44, "end": 6491.44, "text": "oder irgendwo, wo flach ist."}, {"id": 1150, "start": 6491.44, "end": 6494.44, "text": "Ihr könnt es auch auf dem Salzsee machen oder so,"}, {"id": 1151, "start": 6494.44, "end": 6497.44, "text": "aber Meer ist, glaube ich, für uns besser als Salzsee."}, {"id": 1152, "start": 6497.44, "end": 6500.44, "text": "Geht ans Meer, an Strand, wartet, bis die Sonne untergeht"}, {"id": 1153, "start": 6500.44, "end": 6503.44, "text": "und dann fliegt mit der Drohne einfach mal hoch."}, {"id": 1154, "start": 6503.44, "end": 6506.44, "text": "Ihr werdet auf einmal die Sonne wieder sehen."}, {"id": 1155, "start": 6506.44, "end": 6509.44, "text": "Ich frage mich, wie man das sinnvoll erklären will"}, {"id": 1156, "start": 6509.44, "end": 6512.44, "text": "in irgendeiner Art und Weise"}, {"id": 1157, "start": 6512.44, "end": 6515.44, "text": "mit flacher Erde."}, {"id": 1158, "start": 6515.44, "end": 6518.44, "text": "Weil es kann jeder ausprobieren."}, {"id": 1159, "start": 6518.44, "end": 6521.44, "text": "Es kann jeder machen."}, {"id": 1160, "start": 6521.44, "end": 6524.44, "text": "Wahrscheinlich ist es dann auch Fake News oder so."}, {"id": 1161, "start": 6524.44, "end": 6527.44, "text": "Eines der Lieblingsargumente von Flat Earth Leuten"}, {"id": 1162, "start": 6527.44, "end": 6530.44, "text": "ist ja Perspektive."}, {"id": 1163, "start": 6530.44, "end": 6533.44, "text": "Alles, was nicht erklärbar ist, ist Perspektive."}, {"id": 1164, "start": 6533.44, "end": 6536.44, "text": "Perspektive ist eines der Lieblingswörter von Flat Earth Leuten."}, {"id": 1165, "start": 6536.44, "end": 6539.44, "text": "Perspektive."}, {"id": 1166, "start": 6539.44, "end": 6542.44, "text": "Ja, das ist eine gute Frage."}, {"id": 1167, "start": 6558.44, "end": 6561.44, "text": "Was? Oh nein, die Mondlandung."}, {"id": 1168, "start": 6561.44, "end": 6564.44, "text": "Die Mondlandung muss ja auch Fake sein, wenn die Erde flach ist."}, {"id": 1169, "start": 6564.44, "end": 6567.44, "text": "Logisch."}, {"id": 1170, "start": 6567.44, "end": 6570.44, "text": "Obviously."}, {"id": 1171, "start": 6570.44, "end": 6573.44, "text": "Und wir wissen ja, die internationale Raumstation"}, {"id": 1172, "start": 6573.44, "end": 6576.44, "text": "ist ja eigentlich unter Wasser."}, {"id": 1173, "start": 6576.44, "end": 6579.44, "text": "Kennt ihr diese Geschichte?"}, {"id": 1174, "start": 6579.44, "end": 6582.44, "text": "Also das wird ja auch behauptet, dass die internationale Raumstation"}, {"id": 1175, "start": 6582.44, "end": 6585.44, "text": "des Video-Footage unter Wasser aufgenommen wird"}, {"id": 1176, "start": 6585.44, "end": 6588.44, "text": "und man kann Blasen sehen drum herum."}, {"id": 1177, "start": 6588.44, "end": 6591.44, "text": "Also das wird ja wirklich behauptet."}, {"id": 1178, "start": 6591.44, "end": 6594.44, "text": "Das Problem ist nur, dass jeder Noob mittlerweile"}, {"id": 1179, "start": 6594.44, "end": 6597.44, "text": "mit einer guten Kamera alleine geht das ja schon."}, {"id": 1180, "start": 6597.44, "end": 6600.44, "text": "Da siehst du die IES rumfliegen,"}, {"id": 1181, "start": 6600.44, "end": 6603.44, "text": "wenn du an die richtige Pose im Himmel guckst."}, {"id": 1182, "start": 6603.44, "end": 6606.44, "text": "Und im Teleskop ist recht."}, {"id": 1183, "start": 6606.44, "end": 6609.44, "text": "Du kannst das sehen von unten."}, {"id": 1184, "start": 6609.44, "end": 6612.44, "text": "Es ist nicht einfach so, dass man das behaupten würde"}, {"id": 1185, "start": 6612.44, "end": 6615.44, "text": "und Fake Aufnahmen. Du kannst das selbst."}, {"id": 1186, "start": 6615.44, "end": 6625.44, "text": "Oh Gott, das sehen."}, {"id": 1187, "start": 6625.44, "end": 6632.44, "text": "Was hat er denn jetzt damit zu tun?"}, {"id": 1188, "start": 6632.44, "end": 6635.44, "text": "Ach so, weil Anti-Religion."}, {"id": 1189, "start": 6635.44, "end": 6640.44, "text": "Okay."}, {"id": 1190, "start": 6640.44, "end": 6643.44, "text": "Was für wirres Zeugchen er erzählt."}, {"id": 1191, "start": 6643.44, "end": 6646.44, "text": "Du kannst ja mittlerweile sogar..."}, {"id": 1192, "start": 6646.44, "end": 6649.44, "text": "Das ist richtig Big Brain."}, {"id": 1193, "start": 6649.44, "end": 6652.44, "text": "Du kannst ja mittlerweile sogar, wenn du..."}, {"id": 1194, "start": 6652.44, "end": 6655.44, "text": "Weiß nicht, ob er das in dem Video erzählt,"}, {"id": 1195, "start": 6655.44, "end": 6658.44, "text": "aber es gibt zig Videos auf YouTube drüber."}, {"id": 1196, "start": 6658.44, "end": 6661.44, "text": "Du kannst ja mittlerweile, wenn du Licht hast,"}, {"id": 1197, "start": 6661.44, "end": 6664.44, "text": "was zum Beispiel durch Planeten durchscheint,"}, {"id": 1198, "start": 6664.44, "end": 6667.44, "text": "durch die Atmosphäre von anderen Planeten durchscheint,"}, {"id": 1199, "start": 6667.44, "end": 6670.44, "text": "dann kannst du das sehen."}, {"id": 1200, "start": 6670.44, "end": 6673.44, "text": "Oder das kann man sich beispielsweise"}, {"id": 1201, "start": 6673.44, "end": 6676.44, "text": "auch beim Sonnenlicht angucken."}, {"id": 1202, "start": 6676.44, "end": 6679.44, "text": "Anhand des Spektrums von diesem Licht kannst du quasi erkennen,"}, {"id": 1203, "start": 6679.44, "end": 6682.44, "text": "welche Elemente in der Atmosphäre sind."}, {"id": 1204, "start": 6682.44, "end": 6685.44, "text": "Das ist richtig Big Brain,"}, {"id": 1205, "start": 6685.44, "end": 6688.44, "text": "was man mittlerweile alles machen kann."}, {"id": 1206, "start": 6688.44, "end": 6691.44, "text": "We know all about stars."}, {"id": 1207, "start": 6691.44, "end": 6694.44, "text": "Their absolute magnitude. Their mass."}, {"id": 1208, "start": 6694.44, "end": 6697.44, "text": "Their luminosity."}, {"id": 1209, "start": 6697.44, "end": 6700.44, "text": "Their temperature. Their metallicity."}, {"id": 1210, "start": 6700.44, "end": 6703.44, "text": "Now granted, there's still a lot that we don't know,"}, {"id": 1211, "start": 6703.44, "end": 6706.44, "text": "but to stand there and say that we know nothing"}, {"id": 1212, "start": 6706.44, "end": 6709.44, "text": "is an absolute insult to our species."}, {"id": 1213, "start": 6709.44, "end": 6712.44, "text": "How can we say that yes, I do know that God manifested me"}, {"id": 1214, "start": 6712.44, "end": 6715.44, "text": "from his kingdom above?"}, {"id": 1215, "start": 6715.44, "end": 6718.44, "text": "What are the stars? What are the moons? I don't know."}, {"id": 1216, "start": 6718.44, "end": 6721.44, "text": "You know what we can do?"}, {"id": 1217, "start": 6721.44, "end": 6724.44, "text": "Wir können..."}, {"id": 1218, "start": 6724.44, "end": 6727.44, "text": "Das ist so, aber er kann nicht erklären,"}, {"id": 1219, "start": 6727.44, "end": 6730.44, "text": "was es ist, was an dieser Stelle ist,"}, {"id": 1220, "start": 6730.44, "end": 6733.44, "text": "wo eigentlich der Himmel sein müsste."}, {"id": 1221, "start": 6733.44, "end": 6736.44, "text": "Das ist so pains-champig, Alter."}, {"id": 1222, "start": 6736.44, "end": 6739.44, "text": "Ja, dann mach mal."}, {"id": 1223, "start": 6739.44, "end": 6742.44, "text": "Indeed, we can."}, {"id": 1224, "start": 6742.44, "end": 6745.44, "text": "And when tracked and mapped, you can clearly see"}, {"id": 1225, "start": 6745.44, "end": 6748.44, "text": "that our solar system is a heliocentric one."}, {"id": 1226, "start": 6748.44, "end": 6751.44, "text": "Ja, gut."}, {"id": 1227, "start": 6751.44, "end": 6754.44, "text": "Das ist halt auch noch nicht besser."}, {"id": 1228, "start": 6754.44, "end": 6757.44, "text": "Man darf nicht vergessen, die Griechen waren richtig clever."}, {"id": 1229, "start": 6757.44, "end": 6760.44, "text": "Ich weiß nicht, welcher Grieche das war."}, {"id": 1230, "start": 6760.44, "end": 6763.44, "text": "Die haben ja quasi durch den Sonnenstand an verschiedenen Orten"}, {"id": 1231, "start": 6763.44, "end": 6766.44, "text": "die Größe der Erde errechnet."}, {"id": 1232, "start": 6766.44, "end": 6769.44, "text": "Das war nicht so richtig korrekt, aber die sind schon ziemlich clever."}, {"id": 1233, "start": 6769.44, "end": 6772.44, "text": "Ja, das kam schon so ungefähr hin."}, {"id": 1234, "start": 6772.44, "end": 6775.44, "text": "Also nicht wirklich gut, aber kam schon..."}, {"id": 1235, "start": 6775.44, "end": 6778.44, "text": "Das ist echt... Nein, das war nicht Aristoteles."}, {"id": 1236, "start": 6778.44, "end": 6781.44, "text": "Es gibt noch mehr Griechen, die clevere Sachen gemacht haben."}, {"id": 1237, "start": 6781.44, "end": 6784.44, "text": "Also..."}, {"id": 1238, "start": 6784.44, "end": 6787.44, "text": "Die Idee, dass die Erde rund ist,"}, {"id": 1239, "start": 6787.44, "end": 6790.44, "text": "das gibt es schon relativ lange."}, {"id": 1240, "start": 6790.44, "end": 6793.44, "text": "Und ich meine, nur weil wir bis ins Mittelalter"}, {"id": 1241, "start": 6793.44, "end": 6796.44, "text": "und die Kirche so komisches Zeug erzählt hat,"}, {"id": 1242, "start": 6796.44, "end": 6801.44, "text": "macht es das nicht irgendwie besser."}, {"id": 1243, "start": 6801.44, "end": 6804.44, "text": "Und nur weil mal irgendwelche Leute"}, {"id": 1244, "start": 6804.44, "end": 6807.44, "text": "Sonnengötter angebetet haben,"}, {"id": 1245, "start": 6807.44, "end": 6810.44, "text": "heißt es ja noch lange nicht, dass man das in der heutigen Zeit"}, {"id": 1246, "start": 6810.44, "end": 6813.44, "text": "auch machen muss, wenn man es besser weiß."}, {"id": 1247, "start": 6813.44, "end": 6816.44, "text": "Guck mal, das liegt doch so in der Natur der Menschheit."}, {"id": 1248, "start": 6816.44, "end": 6819.44, "text": "Man versucht irgendwie halbwegs sinnvoll mit dem,"}, {"id": 1249, "start": 6819.44, "end": 6822.44, "text": "was man weiß, zu erklären, was man denn so beobachtet,"}, {"id": 1250, "start": 6822.44, "end": 6825.44, "text": "was man denn so sieht."}, {"id": 1251, "start": 6825.44, "end": 6828.44, "text": "Gut, natürlich, früher ist dem nichts Besseres eingefallen,"}, {"id": 1252, "start": 6828.44, "end": 6831.44, "text": "wie als das muss der Sonnengott sein."}, {"id": 1253, "start": 6831.44, "end": 6834.44, "text": "Aber heute wissen wir es halt besser."}, {"id": 1254, "start": 6834.44, "end": 6837.44, "text": "Der letzten 2000 Jahre,"}, {"id": 1255, "start": 6837.44, "end": 6840.44, "text": "die wir gesammelt haben,"}, {"id": 1256, "start": 6840.44, "end": 6843.44, "text": "und sagen, das ist der Sonnengott wieder."}, {"id": 1257, "start": 6843.44, "end": 6846.44, "text": "Das ist doch bescheuert."}, {"id": 1258, "start": 6846.44, "end": 6849.44, "text": "Also er hat im Prinzip"}, {"id": 1259, "start": 6849.44, "end": 6852.44, "text": "keine Ahnung von nichts, sagt er damit."}, {"id": 1260, "start": 6852.44, "end": 6855.44, "text": "Aha."}, {"id": 1261, "start": 6855.44, "end": 6858.44, "text": "Was auch immer das heißen soll."}, {"id": 1262, "start": 6858.44, "end": 6861.44, "text": "Was heißt das überhaupt?"}, {"id": 1263, "start": 6861.44, "end": 6864.44, "text": "Was heißt das überhaupt,"}, {"id": 1264, "start": 6864.44, "end": 6867.44, "text": "dass das alles auf ihn manifestet?"}, {"id": 1265, "start": 6867.44, "end": 6870.44, "text": "Was möchte er uns damit sagen?"}, {"id": 1266, "start": 6870.44, "end": 6873.44, "text": "Also,"}, {"id": 1267, "start": 6873.44, "end": 6876.44, "text": "ich habe das Video schon teilweise geguckt,"}, {"id": 1268, "start": 6876.44, "end": 6879.44, "text": "aber ich weiß nicht,"}, {"id": 1269, "start": 6879.44, "end": 6882.44, "text": "was das heißt."}, {"id": 1270, "start": 6882.44, "end": 6885.44, "text": "Also,"}, {"id": 1271, "start": 6885.44, "end": 6888.44, "text": "ich weiß nicht,"}, {"id": 1272, "start": 6888.44, "end": 6891.44, "text": "was das heißt,"}, {"id": 1273, "start": 6891.44, "end": 6894.44, "text": "was das heißt,"}, {"id": 1274, "start": 6894.44, "end": 6897.44, "text": "was das heißt,"}, {"id": 1275, "start": 6897.44, "end": 6900.44, "text": "was das heißt,"}, {"id": 1276, "start": 6900.44, "end": 6903.44, "text": "was das heißt,"}, {"id": 1277, "start": 6903.44, "end": 6924.44, "text": "dass wir die sweetheart"}, {"id": 1278, "start": 6924.44, "end": 6926.44, "text": "Das kann man gar nicht mal beschreiben."}, {"id": 1279, "start": 6931.04, "end": 6933.04, "text": "Nein, das hat ja mit überhaupt nichts zu tun."}, {"id": 1280, "start": 6933.04, "end": 6961.04, "text": "Okay, das wusste ich nicht."}, {"id": 1281, "start": 6964.04, "end": 6966.04, "text": "Ich finde es aber gut."}, {"id": 1282, "start": 6966.04, "end": 6968.04, "text": "Eins muss man sagen."}, {"id": 1283, "start": 6968.04, "end": 6970.04, "text": "Ich bin immer wieder überrascht davon,"}, {"id": 1284, "start": 6970.04, "end": 6972.04, "text": "mit wie viel Überzeugung"}, {"id": 1285, "start": 6972.04, "end": 6974.04, "text": "und quasi so"}, {"id": 1286, "start": 6974.04, "end": 6976.04, "text": "so Sicherheit,"}, {"id": 1287, "start": 6976.04, "end": 6978.04, "text": "dass die Leute"}, {"id": 1288, "start": 6978.04, "end": 6980.04, "text": "erzählen können"}, {"id": 1289, "start": 6980.04, "end": 6982.04, "text": "und die sind ja auch selbst davon"}, {"id": 1290, "start": 6982.04, "end": 6984.04, "text": "voll überzeugt, obwohl es Schwachsinn ist."}, {"id": 1291, "start": 6984.04, "end": 6986.04, "text": "Also da sieht man, man kann an Schwachsinn glauben"}, {"id": 1292, "start": 6986.04, "end": 6988.04, "text": "und man kann auch diesen Schwachsinn"}, {"id": 1293, "start": 6988.04, "end": 6994.04, "text": "super überzeugend anderen erzählen."}, {"id": 1294, "start": 6994.04, "end": 7010.04, "text": "Komplette Schwachsinn."}, {"id": 1295, "start": 7010.04, "end": 7012.04, "text": "Okay, jetzt wird die beste"}, {"id": 1296, "start": 7012.04, "end": 7016.04, "text": "Quelle aller Zeiten"}, {"id": 1297, "start": 7016.04, "end": 7018.04, "text": "für"}, {"id": 1298, "start": 7018.04, "end": 7020.04, "text": "unser Weltbild aller Zeiten zitiert."}, {"id": 1299, "start": 7020.04, "end": 7022.04, "text": "Die Bibel."}, {"id": 1300, "start": 7022.04, "end": 7024.04, "text": "Wir wissen ja alle, was da drin steht."}, {"id": 1301, "start": 7024.04, "end": 7026.04, "text": "Das muss wortwörtlich so sein."}, {"id": 1302, "start": 7028.04, "end": 7030.04, "text": "Was?"}, {"id": 1303, "start": 7030.04, "end": 7032.04, "text": "Was?"}, {"id": 1304, "start": 7032.04, "end": 7034.04, "text": "Das ist mir noch gar nicht aufgefallen."}, {"id": 1305, "start": 7034.04, "end": 7036.04, "text": "Und was?"}, {"id": 1306, "start": 7040.04, "end": 7042.04, "text": "Okay, jetzt geht's los."}, {"id": 1307, "start": 7042.04, "end": 7044.04, "text": "Jetzt geht's los."}, {"id": 1308, "start": 7044.04, "end": 7046.04, "text": "Die große Verschwörung."}, {"id": 1309, "start": 7046.04, "end": 7048.04, "text": "7 durch 2 hat jetzt Pi, alles klar."}, {"id": 1310, "start": 7048.04, "end": 7050.04, "text": "Ist das Pi? Sekunde."}, {"id": 1311, "start": 7050.04, "end": 7052.04, "text": "Soll ich jetzt mal kurz überbrücken."}, {"id": 1312, "start": 7052.04, "end": 7054.04, "text": "Äh, nein."}, {"id": 1313, "start": 7056.04, "end": 7058.04, "text": "Das stimmt ja schon ab der dritten Nachkommastelle nicht mehr."}, {"id": 1314, "start": 7060.04, "end": 7062.04, "text": "Der Pi ist 3,1415."}, {"id": 1315, "start": 7064.04, "end": 7066.04, "text": "Das stimmt ja schon ab der dritten Nachkommastelle immer."}, {"id": 1316, "start": 7066.04, "end": 7070.04, "text": "Ja."}, {"id": 1317, "start": 7070.04, "end": 7072.04, "text": "1,415."}, {"id": 1318, "start": 7074.04, "end": 7076.04, "text": "Ja, das Komma lassen wir mal weg."}, {"id": 1319, "start": 7076.04, "end": 7078.04, "text": "Das Komma verschieben."}, {"id": 1320, "start": 7078.04, "end": 7080.04, "text": "Aber das stimmt ja hier schon ab dieser Nachkommastelle nicht mehr."}, {"id": 1321, "start": 7080.04, "end": 7082.04, "text": "3,1415."}, {"id": 1322, "start": 7082.04, "end": 7084.04, "text": "Das ist das einzige, was ich mir merken kann,"}, {"id": 1323, "start": 7084.04, "end": 7086.04, "text": "dass das 3,1415 ist."}, {"id": 1324, "start": 7086.04, "end": 7088.04, "text": "Nein!"}, {"id": 1325, "start": 7088.04, "end": 7090.04, "text": "3,18."}, {"id": 1326, "start": 7090.04, "end": 7092.04, "text": "Oh Gott, das ist so fail."}, {"id": 1327, "start": 7092.04, "end": 7096.04, "text": "Ach, 22."}, {"id": 1328, "start": 7096.04, "end": 7098.04, "text": "Ah, okay."}, {"id": 1329, "start": 7098.04, "end": 7100.04, "text": "Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr."}, {"id": 1330, "start": 7102.04, "end": 7106.04, "text": "Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr."}, {"id": 1331, "start": 7110.04, "end": 7112.04, "text": "Es ist, es ist bloß nicht."}, {"id": 1332, "start": 7112.04, "end": 7114.04, "text": "Es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr."}, {"id": 1333, "start": 7120.04, "end": 7122.04, "text": "Aber es ist, es stimmt trotzdem ab der dritten Nachkommastelle nicht mehr."}, {"id": 1334, "start": 7130.04, "end": 7132.04, "text": "Was will, was genau soll ein Bibel?"}, {"id": 1335, "start": 7132.04, "end": 7134.04, "text": "Was will, was genau soll ein Bibel?"}, {"id": 1336, "start": 7134.04, "end": 7136.04, "text": "Zitat."}, {"id": 1337, "start": 7136.04, "end": 7138.04, "text": "Eigentlich, wenn es um den Aufbau unserer Welt des Universums und sonst was geht."}, {"id": 1338, "start": 7138.04, "end": 7140.04, "text": "Was genau wollen die jetzt eigentlich?"}, {"id": 1339, "start": 7140.04, "end": 7143.44, "text": "Was genau wollen die jetzt eigentlich? Was will der mit einem Bibel-Zitat?"}, {"id": 1340, "start": 7156.44, "end": 7161.2, "text": "Also, irgendjemand ist dann zu Moses gegangen und hat ihm gesagt, sieben durch 22 ist Pi, oder?"}, {"id": 1341, "start": 7161.2, "end": 7172.6, "text": "Ja, wir haben viel von Egypt gelernt. Egypt war eine gut genannte Zivilisation. Was ist dein Punkt hier, Marty?"}, {"id": 1342, "start": 7172.6, "end": 7178.6, "text": "Und ich weiß nicht, ob ihr das schon gesehen habt, aber es ist eigentlich eine Art, dass man Zeit mit den Händen mapen kann."}, {"id": 1343, "start": 7178.6, "end": 7186.6, "text": "Also, wenn du deine Hände ausstecken, um den Horizont, wie du siehst, kannst du eigentlich eine Stunde zählen."}, {"id": 1344, "start": 7186.6, "end": 7190.6, "text": "Und also ist das eine Stunde Hand, die Hände der Uhr. Woher glaubst du, dass das kommt?"}, {"id": 1345, "start": 7190.6, "end": 7209.6, "text": "Hä? Da bin ich jetzt zu dumm für, das verstehe ich nicht. Hä? Ich checke es nicht. Hä? Was macht man?"}, {"id": 1346, "start": 7209.6, "end": 7217.6, "text": "Man hält die Hand so mit dem Daumen an die Sonne. Aber wie soll ich denn um alles in der Welt mit meinem Finger sowas hier machen?"}, {"id": 1347, "start": 7217.6, "end": 7226.6, "text": "Ich kann doch meinen Finger nicht 90 Grad nach unten machen. Ach, die Sonne legt ca. vier Finger breit pro Stunde zurück."}, {"id": 1348, "start": 7226.6, "end": 7233.6, "text": "Ah, jetzt verstehe ich das. Also sprich, ich halte das so an die Sonne, da muss ich erstmal in die Sonne gucken, okay?"}, {"id": 1349, "start": 7233.6, "end": 7239.6, "text": "Halte das so unter die Sonne, dann mache ich die zweite Hand runter, dann kann ich quasi ungefähr zählen. Ah ja, okay, okay, okay."}, {"id": 1350, "start": 7239.6, "end": 7265.6, "text": "Excellent, excellent. Wo bist du hier gelandet? Wir gucken uns gerade irgendein Flat Earth Zeug an."}, {"id": 1351, "start": 7265.6, "end": 7285.6, "text": "Alles klar, easy, easy, obvious, obvious. Ja, aber inwieweit hat es jetzt irgendwas mit flacher Erde und Finger? Und vielleicht das verstehe ich, der Zusammenhang verstehe ich nicht so genau."}, {"id": 1352, "start": 7296.6, "end": 7317.6, "text": "Hä? Was? Hä?"}, {"id": 1353, "start": 7317.6, "end": 7345.6, "text": "Was zum Teufel? Was zum Teufel? Warum ist es nicht gleich 69, Alter? Obvious, true."}, {"id": 1354, "start": 7345.6, "end": 7373.6, "text": "Alles klar. Oh nein, schon wieder Bibel-Zitare."}, {"id": 1355, "start": 7373.6, "end": 7402.6, "text": "Ich glaube nicht, dass damit eigentlich die Hand gemeint ist. Es ist offensichtlich, es ist unausweichbar. Ich glaube nicht, dass damit wirklich die Hand, also physisch die Hand gemeint ist."}, {"id": 1356, "start": 7402.6, "end": 7415.6, "text": "Hand? Wer hat das gedacht? Alles klar."}, {"id": 1357, "start": 7415.6, "end": 7443.6, "text": "In mir? Moment. Excellent, excellent."}, {"id": 1358, "start": 7445.6, "end": 7461.6, "text": "Ah, okay, ja."}, {"id": 1359, "start": 7461.6, "end": 7487.6, "text": "Er will uns garantiert irgendwas mit 27, also soweit habe ich noch nicht geguckt. Er will uns garantiert was mit 27,3 jetzt vorrechnen. Warum 27,3 irgendwie, was weiß ich, irgendwas mit Jesus zu tun hat oder so, garantiert. Irgendwas in der Richtung kommt jetzt."}, {"id": 1360, "start": 7487.6, "end": 7498.6, "text": "Ist es das 28?"}, {"id": 1361, "start": 7498.6, "end": 7507.6, "text": "Ich kann mir gar nicht vorstellen, dass das 28 ist. Wie soll das funktionieren?"}, {"id": 1362, "start": 7507.6, "end": 7523.6, "text": "Ich weiß schon, weil die Nachkommastellen unterschiedlich sind und sich das nicht auf irgendwas glattes addieren. Das kann ich mir nicht vorstellen, dass das 28 ist."}, {"id": 1363, "start": 7523.6, "end": 7540.6, "text": "Also was, Moment, was soll ich machen? Das eine plus das andere und dann durch 2 oder was? Oder was will der jetzt von mir? Plus 29,53."}, {"id": 1364, "start": 7540.6, "end": 7568.6, "text": "So, und das jetzt durch 2. Das ist nicht 28, das ist 28,415. Ah gut, ich meine, denn mit Nachkommastellen haben wir es ja an sich eh nicht so. Mit Nachkommastellen haben wir es ja da allgemein nicht so. Das muss ja nicht so genau sein."}, {"id": 1365, "start": 7568.6, "end": 7588.6, "text": "Ich habe legit keine Ahnung, aber ich wette mit euch, es hat irgendwas damit zu tun, dass die Erde rund ist oder zumindest, dass die Erde sich um die Sonne dreht. Eins vor beiden."}, {"id": 1366, "start": 7588.6, "end": 7608.6, "text": "Ah ja, da habe ich mir noch nie Gedanken drüber gemacht."}, {"id": 1367, "start": 7608.6, "end": 7624.6, "text": "Jetzt kommt es. Was? Moment, eben hatten wir da noch 12 oder so auf meiner Hand. Warum habe ich jetzt auf einmal 28 auf meiner Hand? Oh nein, es geht wieder los."}, {"id": 1368, "start": 7624.6, "end": 7652.6, "text": "Was? Okay, jetzt sind die Daumen dabei. Und? Okay, aber ernsthaft, was genau hat das Zählen von Kliedern quasi an meiner Hand mit der Erde zu tun, ob die flach ist oder nicht?"}, {"id": 1369, "start": 7652.6, "end": 7665.6, "text": "Also wie? Was ist der Zusammenhang dazwischen? Ich meine, ich könnte auch, ich könnte auch einfach was verzichten. Ich habe, ich könnte auch an die Anzahl meiner Knie zählen."}, {"id": 1370, "start": 7665.6, "end": 7689.6, "text": "Oh, ich habe zwei Knie und an mir raussuchen alles mit zwei. Ernsthaft? Ernsthaft? Okay, man könnte sich jetzt, man könnte sich jetzt alles Mögliche raussuchen."}, {"id": 1371, "start": 7689.6, "end": 7712.6, "text": "Ich finde bestimmt genug Leute, die haben am 6.9. Geburtstag 69. Du kannst alles irgendwie mit allem zusammenwursten, wenn du nur lang genug das rumrechnest und rumschiebst."}, {"id": 1372, "start": 7712.6, "end": 7729.6, "text": "Doch, er hat auch eben gesagt, er hat auch eben gesagt, es ist at hand. Oh nein, an den Füßen auch noch."}, {"id": 1373, "start": 7729.6, "end": 7748.6, "text": "Wir haben an den Füßen die gleiche Anzahl wie an den Händen. Wie kann denn das nur sein? Ja, okay, aber das sind dann 56 zusammen. Was ist jetzt mit 56?"}, {"id": 1374, "start": 7748.6, "end": 7762.6, "text": "All based on Cephas und Isoplas. Was? Was will der Dude von mir?"}, {"id": 1375, "start": 7762.6, "end": 7791.6, "text": "Ach ja, ach ja, wir sind ein Abbild von Gott, weil wir aus irgendwelchen Gründen die gleiche Anzahl an Klinern an Händen und Füßen haben oder was. Alles klar, alles klar."}, {"id": 1376, "start": 7791.6, "end": 7817.6, "text": "Und weiter? Und weiter? Und weiter? Oh nein, oh nein, das Kind wieder los."}, {"id": 1377, "start": 7817.6, "end": 7838.6, "text": "Jetzt sind wir bei 180. Jetzt kommen wir bei 180. Okay, jetzt kommt Big Brain Muffs, Alter."}, {"id": 1378, "start": 7838.6, "end": 7852.6, "text": "Und jetzt? 180. Oh mein Gott, 180. Leute, die Welt erscheint mir gerade in komplett anderem Licht."}, {"id": 1379, "start": 7852.6, "end": 7878.6, "text": "180, die Hälfte von einem 360-Dinoscope. Ja, 180. Ein halber Kreis."}, {"id": 1380, "start": 7878.6, "end": 7886.6, "text": "Es gibt genug Leute, die können ihren Kopf bestimmt nicht 180 Grad drehen mehr."}, {"id": 1381, "start": 7886.6, "end": 7912.6, "text": "Ach du Scheiße. Oh Mann, da fällt mir echt nichts mehr zu ein. Da fällt mir wirklich nichts mehr zu ein."}, {"id": 1382, "start": 7912.6, "end": 7925.6, "text": "Was zum? Ey, guck mal, Leute, jetzt mal ernsthaft. Ich kann zu jeder x-beliebigen Zahl viele Dinge raussuchen, die damit irgendwie was zu tun haben."}, {"id": 1383, "start": 7925.6, "end": 7930.6, "text": "Und dann danach einfach die Sachen, die passen, nehmen und in ein Video packen."}, {"id": 1384, "start": 7930.6, "end": 7943.6, "text": "Vor allem, es ist absolut unschlüssig, was der Zusammenhang zwischen all diesem Grad ist. Und geschweige denn, was das alles mit flacher Erde zu tun hat."}, {"id": 1385, "start": 7943.6, "end": 7956.6, "text": "Ach ja. Wenn ich Dünsche ist, muss ich auch siebenmal kacken am Tag."}, {"id": 1386, "start": 7956.6, "end": 7979.6, "text": "Genau. Wo ist das Problem? Alter, was ein Schwachsinn."}, {"id": 1387, "start": 7979.6, "end": 7995.6, "text": "Also heute haben wir gelernt, dass 227 fast Pi ist. Was ist das hier?"}, {"id": 1388, "start": 7995.6, "end": 8003.6, "text": "Was ist das hier? Was sehe ich da?"}, {"id": 1389, "start": 8003.6, "end": 8013.6, "text": "Warum ist das eine Musikgruppe? Das kann ich nicht aufmachen, weil Toss."}, {"id": 1390, "start": 8013.6, "end": 8037.6, "text": "Okay, K-Pop Kram. Alles klar. Das ist der Beweis, genau. Guck mal, das, das, das. Was? Was wollen die von mir? 3,141."}, {"id": 1391, "start": 8037.6, "end": 8053.6, "text": "14159. Ach, kein Schimmer. Was will Google von mir?"}, {"id": 1392, "start": 8053.6, "end": 8070.6, "text": "Okay, alles klar. Jetzt wissen wir Bescheid. Also heute haben wir wirklich unseren Horizont erweitert, kann man so sagen. Also ich kann 3,14159, glaube. Mehr kann ich nicht."}, {"id": 1393, "start": 8070.6, "end": 8089.6, "text": "Reicht aber auch in der Regel. Was empfiehlt uns denn YouTube noch Schönes? Ja, Byte Strikes, Copy Pasten kann ich auch."}, {"id": 1394, "start": 8089.6, "end": 8104.6, "text": "Mist, wir hatten eigentlich keine guten Bilder von Flat Earth Bilder. Jetzt kann ich euch gar nicht diesen Trick mit dem Bild zusammenschieben zeigen. Na gut, gucken wir mal."}, {"id": 1395, "start": 8104.6, "end": 8124.6, "text": "So verändert sich Battlefield 2042 bis zum Release. Ja, mal abwarten. Ja, YouTube, erzähl. Was haben wir hier? Personalmangel meets Corona."}, {"id": 1396, "start": 8124.6, "end": 8134.6, "text": "Damit hätte ihr auch niemand rechnen können, dass zu wenig Personal im Gesundheitssystem schlecht ist. Da hätte man nicht drauf kommen können. Nee, nee, das ist nicht möglich."}, {"id": 1397, "start": 8134.6, "end": 8158.6, "text": "Das ist komplett 28, 180 und sonst was. Wir gucken uns das Video jetzt nicht an. Ich hoffe nur, die haben Fotos drinne davon. Ich will euch diesen Trick zeigen mit dem Editor hier."}, {"id": 1398, "start": 8158.6, "end": 8169.6, "text": "Wir brauchen den Flat Earth Foto. Hier. Nee, das ist auch Mist. Ich brauche ein Flat Earth Foto. So ein richtig typisches Flat Earth Foto brauche ich."}, {"id": 1399, "start": 8169.6, "end": 8195.6, "text": "Und dann das da vielleicht. Nee, hier ist leider nichts drin. Egal, dann lassen wir es."}, {"id": 1400, "start": 8195.6, "end": 8211.6, "text": "Gut, also was gucken wir uns als nächstes an? Absolute Cringe Worth Jobs. Ja, das ist in Englisch. Das ist dumm. Das ist USA. Da sind die Jobs einfach noch cringiger als bei uns."}, {"id": 1401, "start": 8211.6, "end": 8219.6, "text": "Mir hat übrigens gestern einer die beste, das müssen wir uns jetzt angucken Leute. Mir hat gestern per Mail einer die beste Job Beschreibung aller Zeiten geschickt."}, {"id": 1402, "start": 8219.6, "end": 8239.6, "text": "Das muss ich unbedingt ins nächste Video mit reinpacken. Passt mal auf. Beste, beste. Also das toppt wirklich fast alles, was ich bisher mir angeguckt habe in Stellenbeschreibung."}, {"id": 1403, "start": 8239.6, "end": 8253.6, "text": "Guck mal. Leiterin IT und Innovation. Der Anfang ist langweilig. Blablabla. Das müssen wir uns nicht durchlesen. Aber passt mal auf."}, {"id": 1404, "start": 8253.6, "end": 8269.6, "text": "Ihre Aufgaben. Jetzt kommt es. Ihre Aufgaben. Ich muss das so der Reihe nach revealen, weil sonst ist es nicht lustig. Die erzählen dir hier erstmal, dass du irgendwelche Management, du bist Leiter IT und machst irgendwelche Management Geschichten."}, {"id": 1405, "start": 8269.6, "end": 8285.6, "text": "Das erste, was sie dir erzählen ist Remote Support aller IT Systeme, Computernetzwerke und Telefonsysteme. Das ist im Prinzip einfach alles. Das ist im Prinzip einfach alles. Einfach alles, was es gibt."}, {"id": 1406, "start": 8285.6, "end": 8302.6, "text": "Das nächste ist darüber hinaus sind sie für die Informationswerke, Fragen, Produkte, Dienstleistungen, vereinzelte Benutzerschulungen, Netzwerkerweiterung, Hardware und Software Support. Du machst das auch noch. Kommunikation und Koordination der Vertragspartner und IT Dienstleister machst du auch noch."}, {"id": 1407, "start": 8302.6, "end": 8316.6, "text": "Verwaltung der bestehenden IT System Infrastruktur, Hardware, Software Lizenzen, Wartungsverträge, Weiterentwicklung der Software Struktur, also programmierst und auch noch weiter."}, {"id": 1408, "start": 8316.6, "end": 8334.6, "text": "Controlling der IT Kosten machst du auch noch. Verantwortlich für das reibungslose Funktienquotient der Anbieter von Guest Internet, Property Management, PMS, Pointsale, POS, IPTV, Telefonsystem und anderen Softwareanbietern."}, {"id": 1409, "start": 8334.6, "end": 8356.6, "text": "Fähigkeit zur Ursachenanalyse und Fehlerbehebung Software und Hardware Problem. Verantwortlich für die Überwachung von Netzwerk-Conference-Servern, Workstations, Netzwerkausrüstung, Telefonanlagen, E-Mail-Konten sowie Unterstützung der zugrundlichen Server-Desktop-Infrastruktur."}, {"id": 1410, "start": 8356.6, "end": 8377.6, "text": "Sollte in der Lage sein, Ursachenanalyse für ein Problem durchzuführen. Pass auf, es wird noch besser, es wird noch besser. Kenntnisse der Netzwerkinfrastruktur, einschließlich Kan5-6-Verkabelung, WLAN, Netzwerkswitches, WLAN, Domain-Controller, Active Directory, Firewall und VPN."}, {"id": 1411, "start": 8377.6, "end": 8393.6, "text": "Vorbereitung und Durchführung von vorbeugenden Wartungsplänen für die gesamte IT und Hardware und Software. Führung bei der Festlegung des Projektumfangs, der technischen Strategie, der Kosten, des Budgets und den Anforderungen an die personelle Unterstützung."}, {"id": 1412, "start": 8393.6, "end": 8414.6, "text": "Ausarbeitung von Richtlinien und Verfahren für die IT-Abteilung. Verwaltung des Disaster Recovery Prozesses und sicherstellen regelmäßiger Backup. Es wird noch besser Leute, gleich kommt noch der Hammer. Aktualisierung der Richtlinien und Verfahren in Bezug auf PC, was auch immer das ist. Jetzt kommt der Hammer."}, {"id": 1413, "start": 8414.6, "end": 8433.6, "text": "Verantwortung für Datensicherheit und Cyber. Du bist auch noch Security-Experte. Datensicherheit und Cyber-Security. Und jetzt noch, falls das noch nicht reicht. Sie müssen sich außerdem über die neuesten Hotel-Technologien und Software-Risiken auf dem Laufen halten."}, {"id": 1414, "start": 8433.6, "end": 8450.6, "text": "Sie müssen in der Lage sein, andere von der Geschäftsleitung zugewiesene IT oder systembezogene Aufgaben zu erfüllen. Was ist denn das für ein bescheuerter Satz? Woher soll ich das denn wissen? Wenn die sich nächstes... Wisst ihr, das ist eine Wildcard. Das ist eine Wildcard für alles, der letzte Satz."}, {"id": 1415, "start": 8450.6, "end": 8464.6, "text": "Das ist eine Wildcard komplett für alles. Sie müssen in der Lage sein, alles zu machen, was wir ihnen sagen. Das ist wirklich der absolute Wahnsinn."}, {"id": 1416, "start": 8464.6, "end": 8485.6, "text": "Leider sagen sie nicht, was sie bezahlen, noch nicht mal grob. Aber wir bieten es auch vollkommen an der Realität vorbei. Flexible Arbeitszeiten und Vertrauenszeiten. Das sind die einzigen Vorteile, die sie haben. Das hier ist kein wirklicher Vorteil. Das ist irgendwie so eines der Sätze, die sie hinschmeißen. Das ist kein Vorteil für dich."}, {"id": 1417, "start": 8485.6, "end": 8499.6, "text": "Weiterentwicklungsmöglichkeiten durch die maßgebliche Leitung, neue Technologien. Das ist auch kein wirklich wir bieten. Das ist einfach ein Teil, wie sie sich sehen. Und das auch nicht. Also im Prinzip haben die keine Vorteile."}, {"id": 1418, "start": 8499.6, "end": 8526.6, "text": "Neugierig auf das Gehalt anzeigen. Das geht nicht. Das ist Chebat. Das ist Chebat. Das sind mehrere Abteilungen. Genau, du hast recht. Das sind nicht nur mehrere Stellen in einer Person. Das sind diesmal mehrere Abteilungen in einer Person."}, {"id": 1419, "start": 8526.6, "end": 8543.6, "text": "Das solltest du nicht bewerben und den Portemonnaie nicht KQ machen. Bitte mal. Man sieht das gar nicht. Das ist einfach nur komplettes Chebat. Ich hatte mal einen Account gemacht, um mich dann diese Gehaltsumfrage zu machen. Am Ende kam nichts raus. Das war komplettes Chebat."}, {"id": 1420, "start": 8543.6, "end": 8564.6, "text": "Ich meine, wir können das mal machen, aber das funktioniert glaube ich nicht. 10-Minute-Mail. Passwort. Was? Ich. Irgendwas werde ich eh nie wieder verwenden."}, {"id": 1421, "start": 8573.6, "end": 8602.6, "text": "Anhand was errechnet sich das? Ich meine das Gehalt ist durchaus in Ordnung. Aber nicht für das hier. An sich ist das Gehalt durchaus okay. Aber ist das halt die Frage, hat das überhaupt was mit dieser Stelle zu tun? Und nicht für das hier."}, {"id": 1422, "start": 8602.6, "end": 8626.6, "text": "Das war Brutto. Ja klar, es ist immer Brutto. Das Gehalt ist schon für den IT-Job durchaus in Ordnung. Aber halt nicht für das hier. Aber das hat mit diesem Job gar nichts zu tun. Das ist Gehaltsspanne geschätzt. Das hat mit der Realität nichts zu tun. Bewerbung starten. Wie geht denn das jetzt?"}, {"id": 1423, "start": 8626.6, "end": 8651.6, "text": "Okay. Ich habe kein Nein, habe ich nicht. Lebenslauf erstellen. Oh. Vorgefertigter Lebenslauf. Jawoll. Farbe ändern. Kappa Pride. Nee. Jawoll. Weiter."}, {"id": 1424, "start": 8651.6, "end": 8673.6, "text": "Äh. Washer. Ahja. Excellent. Ja. Schwachsinnig. Schwachsinnig. Also wer sich das ausgedacht hat ist auch nicht. Ich meine ich müsste mich wirklich ohne Scheiß mal mal sowas bewerben."}, {"id": 1425, "start": 8673.6, "end": 8683.6, "text": "So mit fake Name just for fun. Und dann sagen keck you."}, {"id": 1426, "start": 8683.6, "end": 8690.6, "text": "CD Projekt Red Tweet. Was tweeten sie denn?"}, {"id": 1427, "start": 8690.6, "end": 8700.6, "text": "Zeig her. Was tweeten sie?"}, {"id": 1428, "start": 8700.6, "end": 8707.6, "text": "Poggers."}, {"id": 1429, "start": 8707.6, "end": 8710.6, "text": "Alles klar."}, {"id": 1430, "start": 8710.6, "end": 8739.6, "text": "All das sind die Agil."}, {"id": 1431, "start": 8739.6, "end": 8742.6, "text": "Keine Ahnung."}, {"id": 1432, "start": 8742.6, "end": 8753.6, "text": "Die brauchen einen Crunch Master. Ja stimmt. Das ist für die glaube ich wichtiger als den Scrum Master. Gucken wir uns jetzt an YouTube. Du hast noch mal die Chance uns was zu empfehlen."}, {"id": 1433, "start": 8753.6, "end": 8772.6, "text": "Ich habe Hunger. Es ist jetzt 11.48 Uhr. Ich kann auch gar keinen Hunger haben. Wobei man kann immer immer Hunger haben."}, {"id": 1434, "start": 8772.6, "end": 8785.6, "text": "Wir bekommen nur noch ein Battlefield Zeug empfohlen."}, {"id": 1435, "start": 8785.6, "end": 8813.6, "text": "Never play the German version of a video game. Ah. Der spielt die Mission. Die MW2 Mission wo du in der deutschen Version nicht schießen darfst."}, {"id": 1436, "start": 8813.6, "end": 8830.6, "text": "Das war nur in der deutschen Version."}, {"id": 1437, "start": 8830.6, "end": 8840.6, "text": "Deutsche Version. Aber das hat sich glücklicherweise gebessert."}, {"id": 1438, "start": 8840.6, "end": 8850.6, "text": "Battlefield Top Plays of the Month. Okay das gucken wir jetzt nochmal. Oh ne. Das ist so ein super gehypter Typ. Das halte ich nicht aus."}, {"id": 1439, "start": 8850.6, "end": 8863.6, "text": "Das ist so ein super. Oh ne das halte ich. Ich halte so Let's Play Typen nicht aus die rumschreien."}, {"id": 1440, "start": 8863.6, "end": 8882.6, "text": "Ach ne das ist Battlefield Fans. Das sind auch die Stimmen davon oder?"}, {"id": 1441, "start": 8882.6, "end": 8900.6, "text": "Nicht Fans. Nicht Fans. Friends. Battlefield Friends. Nicht Fans. Wie komme ich auf Fans?"}, {"id": 1442, "start": 8900.6, "end": 8916.6, "text": "Oh ne das kann ich nicht haben. Das ist zu viel Reaction. Das halte ich nicht aus."}, {"id": 1443, "start": 8916.6, "end": 8930.6, "text": "Hey Leute was geht hier ist wieder der Max am Start und heute spielen wir Funny Game XY und ich darf auf gar keinen Fall aufhören zu reden."}, {"id": 1444, "start": 8930.6, "end": 8940.6, "text": "Solche Videos da kriege ich Anfälle bei. Die dürfen nie die Klappe halten weil die Leute sonst abschalten."}, {"id": 1445, "start": 8940.6, "end": 8948.6, "text": "Kennst du einen Addon für Opera das YouTube nicht mehr stoppt? Ich wusste gar nicht das YouTube in Opera stoppt."}, {"id": 1446, "start": 8948.6, "end": 8961.6, "text": "Das ist einfach anstrengend ja. Ich muss auch sagen ich bin irgendwie weiß ich nicht so nicht die richtige YouTube Zielgruppe oder war ich noch nie eigentlich weil"}, {"id": 1447, "start": 8961.6, "end": 8975.6, "text": "ich kann mir die meisten Videos gar nicht angucken. Na gut das ist normal so viel verschiedenen Content wie es da gibt aber gerade im Gaming Bereich ich finde die meisten Videos so ultra anstrengend zu schauen."}, {"id": 1448, "start": 8975.6, "end": 8989.6, "text": "Genauso die ganzen Funny Games die es da gibt wo ich einfach nur ultra schlechte Spiele sehe und irgendein der das spielt und auch nicht lustig ist also keine Ahnung es ist nicht meins."}, {"id": 1449, "start": 8989.6, "end": 9007.6, "text": "Du hast aber auch durchgehend in deinen YouTube Videos gelabert. Ich rede durchgehend weil ich was zu einem Thema sage aber du kannst meine Videos nicht vergleichen mit irgendein super hyper aktivem Let's Player Dude."}, {"id": 1450, "start": 9007.6, "end": 9035.6, "text": "Hol dir wenigstens noch Luft. Ich habe gerade eine Mail bekommen von Victoria sie sucht mich und möchte jetzt über chat live.me mit mir chatten alles klar. Seems legit."}, {"id": 1451, "start": 9035.6, "end": 9064.6, "text": "So."}, {"id": 1452, "start": 9064.6, "end": 9077.6, "text": "Gucken wir uns noch an."}, {"id": 1453, "start": 9077.6, "end": 9096.6, "text": "The man that thinks Koalas are CGI gibt verrückte Leute halt."}, {"id": 1454, "start": 9096.6, "end": 9108.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1455, "start": 9108.6, "end": 9128.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1456, "start": 9128.6, "end": 9143.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1457, "start": 9143.6, "end": 9158.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1458, "start": 9158.6, "end": 9173.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1459, "start": 9173.6, "end": 9188.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1460, "start": 9188.6, "end": 9203.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1461, "start": 9203.6, "end": 9218.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1462, "start": 9218.6, "end": 9233.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1463, "start": 9233.6, "end": 9248.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1464, "start": 9248.6, "end": 9263.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1465, "start": 9263.6, "end": 9278.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1466, "start": 9278.6, "end": 9293.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1467, "start": 9293.6, "end": 9308.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1468, "start": 9308.6, "end": 9323.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1469, "start": 9323.6, "end": 9338.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1470, "start": 9338.6, "end": 9353.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1471, "start": 9353.6, "end": 9368.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1472, "start": 9368.6, "end": 9383.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1473, "start": 9383.6, "end": 9398.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1474, "start": 9398.6, "end": 9413.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1475, "start": 9413.6, "end": 9428.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1476, "start": 9428.6, "end": 9443.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1477, "start": 9443.6, "end": 9458.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1478, "start": 9458.6, "end": 9473.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1479, "start": 9473.6, "end": 9488.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1480, "start": 9488.6, "end": 9503.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1481, "start": 9503.6, "end": 9518.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1482, "start": 9518.6, "end": 9533.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1483, "start": 9533.6, "end": 9548.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1484, "start": 9548.6, "end": 9563.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1485, "start": 9563.6, "end": 9578.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1486, "start": 9578.6, "end": 9593.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1487, "start": 9593.6, "end": 9608.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1488, "start": 9608.6, "end": 9623.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1489, "start": 9623.6, "end": 9638.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1490, "start": 9638.6, "end": 9653.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1491, "start": 9653.6, "end": 9668.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1492, "start": 9668.6, "end": 9683.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1493, "start": 9683.6, "end": 9698.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1494, "start": 9698.6, "end": 9713.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1495, "start": 9713.6, "end": 9728.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1496, "start": 9728.6, "end": 9743.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1497, "start": 9743.6, "end": 9758.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1498, "start": 9758.6, "end": 9773.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1499, "start": 9773.6, "end": 9788.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1500, "start": 9788.6, "end": 9803.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1501, "start": 9803.6, "end": 9818.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1502, "start": 9818.6, "end": 9833.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1503, "start": 9833.6, "end": 9848.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1504, "start": 9848.6, "end": 9863.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1505, "start": 9863.6, "end": 9878.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1506, "start": 9878.6, "end": 9893.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1507, "start": 9893.6, "end": 9908.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1508, "start": 9908.6, "end": 9923.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1509, "start": 9923.6, "end": 9938.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1510, "start": 9938.6, "end": 9953.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1511, "start": 9953.6, "end": 9968.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1512, "start": 9968.6, "end": 9983.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1513, "start": 9983.6, "end": 9998.6, "text": "Gibt es nichts was ich mir angucken will."}, {"id": 1514, "start": 9998.6, "end": 10013.6, "text": "Gibt es nichts was ich mir angucken will."}]}