{"text": "So, da bin ich, weil irgendwie passt mir mein Headset nicht mehr.Ich vermute, mein Kopf ist größer geworden, am Headset kann das nicht liegen.Seit gestern, zu hoher EQ durch die ganzen Prime-Subs.Logic, danke für den Sub.Pokers Overlay umstellen.Chat, wie sieht es bei euch aus?Aus wem wurden schon die Dislikes auf YouTube deaktiviert?Also bei mir sind die Dislikes noch da.Aber bei mir auf dem zweiten Rechner sind die Dislikes schon weg.Weiß nicht, wie es bei euch aussieht.Was sind es alle da?Was steht heute an?Das, was im Titel steht, nix.Wir schwätzen ein bisschen, ich gucke mir ein paar Sachen an, wir gucken vielleichtein paar Videos.Wir gucken uns vielleicht GitHub Trends an und ich kaufe mir eine SSD, weil ich festgestellthabe.Ich brauche noch eine Aufnahme-SSD, meine SSD ist fast voll.Und ich habe keinen Bock, laufen die Sachen aufs Nass zu schieben, das dauert immer undich will ja weiter aufnehmen, Capture.Ich bräuchte mal so irgendwie, sagen wir mal 1-2TB am besten per USB, USB-C, guckenob es da bei Amazon irgendwas gibt.Von Kingfast, klingt nach irgendeinem AliExpress-Ding, sagte mal, was hatte ich mir noch mal beiAliExpress, nein nicht Alice Weidel, was hatte ich mir noch mal bei AliExpress bestelltdas letzte Mal?Das ist nämlich immer noch nicht da.Was habe ich da für ein Müll drin liegen?Ne, ne, ne, das ist es nicht.Zack, ich muss mal kurz die VM starten.Oder die VM, wie die coolen Leute das sagen.Wir wissen ja, cool ausgesprochen ist alles, das ist viel geiler.Es ist ja auch Jubantu anstatt Ubuntu und Java, ganz wichtig, Java, Java und Gyra undShit.Und Jif, genau.Ja, ich gucke erstmal bei Amazon, es ist nicht gerade irgendwie Black Friday Stels oder sowasangesagt.Ach ne, Early Black Friday Dienst, alter dieser Black Friday Kram, ne?Das geht mir so unglaublich auf den Sack.Erstens ist das zum größten Teil, außer die Amazon eigenen Sachen, mega Chebat, wenndu bei Geist Stels guckst, bist du wirklich besser dran und, und das Schlimme ist, dassja mittlerweile, es ist ja nicht nur einfach Black Friday und Cyber Monday oder sowas inder Richtung, es ist Early Black Friday, Black Friday, After Black Friday, Cyber Monday, BlackFriday Week, Black Friday Month, was kommt denn als nächstes, Black Friday Quartal oderBlack Friday Jahr, Black Friday Millennium, bald ist Dauer Black Friday, die, die übertreibenes total, ich gucke mal ob es irgendwelche SSDs gibt, so, erstmal kurz, mal schnell gucken,Storage kann man auch suchen, ach ne man kann ja hier oben, SSD suchen und dann Black Fridayauswählen, hier, davon hab ich doch jetzt auch schon eine, die sind nicht schlecht,das einzige Problem was ich mit denen hab, ist, ich hab den einen, die überhitzen manchmal,weiß ich ob ihr die auch schon mal, ob irgendjemand von euch den Kram hat, ich hab das Gefühldie überhitzen manchmal, ja das hier ist Chebat im Leben kostet die normalerweisekeine 200 Euro, wir gucken jetzt einfach mal, Portable SSD Geist Stels, aber lasst uns weitergucken, nicht von Amazon, hier Chebaton, ja in rot, wobei mir das eigentlich vollkommenegal ist, ob die in rot ist oder in schwarz ist, was auch immer, hier ist er angeblich3,2 und hier ist er 1, 3,1 und wir wissen alle, USB 3,1 gibt es gar nicht mehr, alledie das schreiben sind zu dumm, die Genialität des USB Standards zu verstehen, es gibt keinUSB 3,1 mehr, alles outdated, overrated, Chebaton, aber das ist tatsächlich relativ günstig,ja Amazon.de, klick mich, das scheint tatsächlich relativ günstig zu sein für 105 ok, eBay,bei Simbershop 2020 oder bei Mlwcomcom, das sind immer so super seriös klingende eBay-Namen,Preisentwicklung, wollen wir Preisentwicklung gucken, Preisentwicklung gucken, Preisentwicklungist wuhu, so Amazon, da kommen wir bestellen, ich bestelle mir einfach, was hab ich eigentlichnoch alles, 1TB, gibt es die auch mit 2TB, gibt es die auch mit 2TB, na gut 1TB reichtfür Aufnahme, was hab ich denn da bei Amazon noch alles hier im Basket liegen, zeig malher, oh das brauch ich noch, das hab ich mir das letzte Mal gar nicht bestellt und denbrauch ich auch noch, den hab ich auch nicht bestellt, die hab ich bestellt, OKS, dannmachen wir hier, Bro Case, warum brauch ich, was ist der Sinn für so ne SSD in den Casezu haben, ich mein die SSD an sich ist ja stabiler als das Case, wo ist der Sinn, manweiß es nicht, Fluxstells, ja beste, der Mini Fluxer, guck mal der ist er, der Mini Fluxer,guck mal, ein Anime Body Pillow, ja brauch ich unbedingt, gibt es sowas auf Amazon.de,wie heißt ein Body Pillow auf Deutsch Körper Kisten, nee, keine Ahnung, Anime Body Pillow,girl, oi oi oi, warum, warum hat die 6 Augen, oi oi oi, oi oi, wo ist der Sebaro wenn manden braucht, das war knapp, war kurz vor Toss, ja ja kurz vor Toss, so, ja kann vorkommen,muss man die wichtigen Sachen sich auf Amazon angucken, nein ich hab kein Anime Body Pillow,ich hab aber ein Seitenschläfer Kisten, wisst ihr warum, weil ich 37 bin und alt, wenn ichzufällig falsch liege tut mir der Rücken weh, so, hast du sinnvolle Ideen was zu programmieren,also was nützliches, ich hab ja für so eine Python API oder, ok Pains Jam, keine Ahnung,das muss ja schon ungefähr, muss ja schon ungefähr irgendwie so ne Richtung haben,ich hab viele sinnvolle Ideen was man programmieren könnte ja, aber nix jetzt so was dich vielleichtinteressiert, du könntest beispielsweise einen Python zu Battlefield Portal XML Converterprogrammieren, es gibt hier ne Menge sinnvolle Dinger, aber das dir gefällt weiß ich nicht,wahrscheinlich, sind Pork, also ich hab die T7 und ich hab das Gefühl die überhit, manchmalkrieg ich nämlich ne Meldung hier, also Fehler schreiben, hab ich irgendwas überlesen, ichbilde mir an es gab noch irgendeine Frage, aber ich seh es jetzt nicht, lass uns heutenicht tippen, nee nee, nix, nix gesehen, das Alex hat überhaupt keine Frage, der postetirgendwas mit der Feuerwehr, ja das ist XML unter der Haube, ja ist es, aber das bringtdir ja nix, weil du kaum Stellen hast wo du den du was draus drehen kannst, gab dochkeine Frage mehr, ich hab wieder Subscribers übersehen, ich bin verwirrt zu spät schon,vor neun Minuten, danke schön für den Sub, Pogu, so und irgendjemand hat gepostet, derhat seine Prüfung bestanden, aber ich find das nicht mehr, irgendwas mit Technik, Prüfung,ach hier, heute anderen Teil der Operative Professional Prüfung geschrieben, Mitarbeiterin Teamführung, Pains Cem, ja Operative Professional ist ja diese IHK Weiterbildung, wo ich michimmer frage ob das jemand macht, aber jetzt hab ich die Antwort, ja das macht anscheinendjemand, Blah oder Blah Blah, danke für den Sub, Massive Sixhead Subscription hier, janix, einfach gar nix, ich hab gedacht ich geh nochmal on, hast du Nasty Schneider malfür Battlefield Portal gemacht, immer, ich mach immer, bevor ich irgendwas mach, machich ein Strukturkram, auch wenn ich morgens aufstehe und aufs Klo muss, dann mach ichvorher ein Strukturkram, weil man weiß ja nie, was da alles passieren kann, wenn esnicht strukturiert ist, so ein Strukturkram wissen wir alle, ist natürlich ganz wichtigfür so ein Ablauf, nee, haben wir nicht Pepo Shy, warum haben wir Pepo Shy nicht aktiviert,Moment das muss ich gleich mal nachholen, haben wir keinen Pepo Shy, Pepo Shy das istein, hab ich letztens erfahren, ich verfolge Valorant nicht so, es gibt ein Valorant FemaleTeam, das Pepo Shy heißt, also jetzt ist Pepo Shy aktiviert, es ist ziemlich limitiert,man kann sich wirklich viel machen, so, also wie gesagt, ich hab nix großartig vor, natürlichhab ich mir ein paar Sachen überlegt, wo ich ein bisschen was drüber erzählen kann,denn hier, wie gesagt erstmal SSD einkaufen, haben wir jetzt gemacht, SSD und der MiniFluxer, der wird jetzt abgestellt, Boss Removed, wunderbar, Marx gibt es eigentlich noch irgendwasFlashbares auf dem Markt, ja, die letzte Flashbare Steckdosenleiste, die ich kenne,ist die hier, die hab ich nämlich erst vor zwei Wochen gekauft und, Smart, muss manbestimmt Smart mit eingeben, die hier, die hab ich erst vor, aber die ist eigentlichzu teuer, aber die hab ich erst vor ein paar Wochen gekauft, die lässt sich noch Tasmotaflashen, haben wir sogar hier live im Stream zusammen gemacht, Hammer, wann lohnt sichder Black Friday eigentlich, nur bei Amazon und eigenem Zeug, also wenn du zum Beispielhier einen, sagen wir mal hier Black, wenn du irgendwie einen HD10 kaufen willst, dannist das ganz sinnvoll, jetzt nicht, jetzt ist doof, aber es geht schon in die richtigeRichtung, aber das muss noch billig werden, wenn das mal bei 89 ist oder so, dann kannstdu es kaufen, am besten natürlich noch günstiger, also für Amazon eigene Sachen lohnt sichdas und ich finde, Amazon eigene Sachen, gibt es eigentlich nur Tablets, die sich lohnen,vor allem wenn man sie danach deploatet und den ganzen Amazon-Campel wieder runterschmeißt,Fire TV Sticks, wenn man's will, kann man sich kaufen, finde ich jetzt aber persönlichnicht so geil, die Tablets sind eigentlich das einzige, was sich lohnt und die Tabletsdann halt auch wie gesagt nur deploatet und zwar nur deploatet mit dem Fire Toolbox oderwie dieses Ding heißt, Fire Toolbox, einfach deploatet, oh mittlerweile ist das rot, istauch neu, ich weiß, ich hab bis heute nicht verstanden, warum dieser Typ so eine ultrahässliche PowerShell Konsolen GUI gemacht hat, anstatt irgendwie was halbwegs ansehnliches,aber wahrscheinlich kann das nicht besser und ich will mich jetzt auch nicht beschweren,dass der den Kram hier quasi schon irgendwie drei Jahre maintained. Man kann das auchmanuell machen, ja, aber dann musst du den ganzen Scheiß raussuchen, da hab ich keinBock drauf.Gibt's das auch für Linux, nee, wenn du Linux hast, musst du dir selbst raussuchen,wobei ich mir nicht sicher bin, ob es da was gibt, musst du dir mal bei XDA gucken, danngeht das. Kannste über Wine ausführen, ich weiß nicht, wie sieht das mit Wine und USBZugriff aus, wenn USB über Wine funktioniert, dann geht das höchstwahrscheinlich auch überWine, ja. Doom Swap, danke für den Sub. Keine Ahnung, wie das ist. Habt ihr alle schonmal ein neues Video geguckt? Wenn nicht, muss ich jetzt ein bisschen Werbung machen fürmein neues Video, ihr könnt euch jetzt mein neues Video angucken nach dem Stream. Wirhaben im Prinzip das gemacht, was ich gestern, vorgestern, gestern, was ich gestern im Streamgemacht hab, nur etwas anders. Wir haben beispielsweise noch eine Nuke eingebaut und manche Sachenanders gemacht als gestern im Stream. Ihr findet ja eigentlich den neuen Thumbnail Style,da hab ich ja hier so mit angefangen, so quasi, so ab hier hab ich ungefähr damit angefangen.Ich bin halt, ich kann sowas eigentlich nicht, aber nachdem Thumbnail Gestalter so unglaublichstunzuverlässig sind, ich wart schon wieder seit drei Wochen oder so, bis sich da irgendwelcheLeute melden. Ob trotz Nachfragen, es ist echter Wahnsinn. Also, die kreativen Leutesind so kreativ, dass sie es nicht schaffen sich zu melden. Ja, aber ich hab's dann geändert.Das kriegen die Leute schon raus. Wirklich? Naja, soll mir recht sein. Es gibt halt kaumgescheite Leute, die sowas machen, ich weiß nicht. Was ist eigentlich aus den Leutengeworden, die Battlefield? Oh, hör mal auf. Alter, hör mal auf. Der erste hat sich irgendwienach einer Woche gemeldet, er ist jetzt im Krankenhaus. Gut, kann er nix für. Ich glaube,der ist ganz gut, mit dem würde ich auch weiter was machen. Dann hat sich noch einer gemeldet,der hat dann auch was zusammengeschnitten, aber das hat mir überhaupt nicht gefallen.Das war wirklich nicht so das, was ich mir irgendwie vorgestellt hab. Der hat zwar einpaar lustige Sachen rausgesucht aus den Streams, aber im Prinzip war da nichts wirklich großartigdabei. Dabei hatten wir wirklich coole Sachen im Stream. Wann kommt eigentlich Halo raus?Das muss doch jetzt auch irgendwann sein. Könnte mich mit meinem Outtakes-Video hier,wie gesagt, ich brauch immer Leute, die Stream-Highlights und so schneiden. Wirklich, du musst dasnoch nicht mal umsonst machen. Das muss halt gut sein. Es muss jetzt hier irgendwie nichtsuper krass Effekte und Bild in Bild und sonst was, aber das muss halt schon feinfühliggemacht sein. Es bringt jetzt nichts da, wie beispielsweise in einem Video, dass man einfachirgendwie drei Tode nimmt, die zusammenschneidet und dann irgendwie einen Meme drüberlegtoder so. Dubstep. Also wenn du das machen willst, ohne Scheiß, dann schreibst du entwederim Discord nochmal oder schreib mir an die Business-Mail, die auf meinem Channel stehtund sag mir, was du haben willst, so für was weiß ich pro Arbeitsstunde oder pro Videooder so ungefähr. Das muss ja nicht konkret sein. Rick Stonks. Was? Wait a minute, istdas gerade eben rausgekommen oder? Nee. Was? Nee, das kommt am 8. Dezember. Hä? Ah, derMultiplayer-Teil. Ach, heute ist ja Xbox-Jubiläum. Stimmt. Ach, ernsthaft? Twitch? Halo? Wirklich?Tatsächlich. Moment, Moment. Ach, das ist der Channel-Halo, man. Ich hab's nicht gecheckt.Ich muss auf Halo Infinite, so rum. Halo Infinite ist da. Kann ich das Ganze auch vielleichtZuschauer viel wenig und wie kann ich denn hier Kanäle auf Deutsch rausmachen? Gehtdas? Ich will keine deutschen Kanäle angezeigt kriegen. Nee, das geht anscheinend nicht.Tatsächlich. Das ist ja interessant, dass das raus ist. Dann werden sich sicherlichviele freuen. Spannend. Hätte ich gar nicht gedacht. So, das heißt, das ist... Ich meine,ich hab die Berichterstattung im Vorfeld ein bisschen verfolgt und ich hab da so rausgehört,dass viele Leute gesagt haben, ja, es macht es ein bisschen anders. Es ist auch im Kernder klassische Halo-Multiplay, aber es macht es ein bisschen anders. Halt, dass es ebenhalt auch längerfristig monetarisierbar ist und sowas. Also ich bin da wirklich mal gespanntdrauf, ob das klappt. Ja. Und wo kriegt man das? Im Store? Ach komm. Please, gibt'sdas nicht auf Steam? Steam, Halo, Infinite? Gibt's das auf... Ach, das gibt's auch aufSteam. Nice, sehr gut. Die Beta, aha. Die Kampagne kommt am 8. Dezember. Sag mal, wennich die Story schon wieder lese... Ich weiß, das Spiel heißt Halo, aber ist es nicht irgendwiemerkwürdig, dass in jedem oder in fast jedem, es ist ja nicht in jedem, in fast jedem Halozufälligerweise irgendwie wieder ein Halo-Ring auftaucht? So, da ist er ja. Wo kommt erdann auf einmal her? Wir wussten gar nicht, dass es den noch gibt, aber diesmal ist esder allerletzte Halo-Ring und der ist ganz wichtig und sowas in der Richtung. NächsterSingleplayer, hoch. Da ist ja noch ein Halo-Ring. Wo kommt der wieder her? Das ist der wichtigstejetzt, ja. Das ist noch wichtiger als die letzten fünf. Wobei man sagen muss, das isttatsächlich nicht wirklich... Das ist nicht immer so. Halo 5 hatte, glaube ich, keinenneuen Halo-Ring. Halo 5 war ja Cortana, dreht durch. Irgendwie sowas in der Richtung, wennich es noch in der richtigen Erinnerung habe. Halo 4, kann ich mich gar nicht mehr dranerinnern, wenn ich bin so richtig... Ach, keine Ahnung. Guck mal, noch keine Steam-Reviews.Normalerweise gibt es Steam-Reviews immer. Meistens schon direkt zu Release und dannsowas sinnloses wie Cortana Big Boops Best Game Ever oder sowas. Das sind typisch dietypischsten sinnlosen Steam-Reviews. Hast du noch eine kleine Review zu Belfilm an Vorrelease?Ja. Ich weiß nicht, ob du das Video von heute geguckt hast, nämlich das da. Da sage ichgenau das. Das sage ich nämlich. Achtung, ich zitiere mich selbst. Wir müssen das nichtlang aushalten. Ich habe in Battlefield Portal fast mehr Spaß als in Battlefield 2042 selber.Die eingebauten Classic-Sachen in Portal selbst sind ja schon ganz nice. Aber richtig Spaß,ich fand ich das selbst, ich nenne es mal Programmieren von eigenen Spielmodi. Deshalbbauen wir heute mal oder nennen wir es mal Programmieren oder Skripten. Es ist schwierigzu sagen, wie ich es genau nennen soll. Wir bauen heute zusammen Nosher Canals TDM mitKillstreaks. So richtig mit ULV, einer Nuke am Ende, einem Blackbird, Sentry Gun, so wasman sich so unter Killstreaks vorstellt. Natürlich ist Portal noch ein bisschen limitiert. Dasheißt, wir müssen manchmal ein bisschen tricksen. Aber am Ende bekommt ihr auch noch den Code,dass ihr das alle mal ausprobieren könnt. Und würde mich mal interessieren, könntihr die Kommentare schreiben, was ihr jetzt von dem Spielmodus haltet, den wir hier zusammengebaut haben. Und nächste Woche zum richtigen Release des Games kommt dann mein komplettesReview oder Fazit zu dem Game. Das heißt, wenn ihr es nicht verpassen wollt, dann drücktjetzt einfach mal den Abo-Button und ich würde sagen, los geht's.Exzellent. Das könnt ihr übrigens auch auf Twitch machen, wenn ihr jetzt gerade frischhier seid. Da muss es nicht unbedingt der Subscribe-Button sein, der Follow-Button reicht natürlichauch erstmal. Aber so sieht es aus. Ich habe das so geplant, dass ich quasi zum 19. odervielleicht am 18. oder so schon, dass der Algorithmus das dann abpickt. Tolles Satz,dass ich das dann starte. Das Video. So, jetzt habe ich das auch beantwortet. Battlefield20. Insane sniping. Insane. Ja, wenn du insane snipen willst in 2042 musst du erstmal lernen,3km vorzuhalten und drüber zu halten. Willst du nur noch eine Woche arbeiten? Das ist ganzeinfach zu erklären, denn, kurz runter scrollen, denn, genau, so sieht es aus, denn ich habeUrlaub eingetragen schon seit Anfang des Jahres für den kompletten Dezember und mirist jetzt aufgefallen, dass ich ja noch 4 Tage Resturlaub habe. Das bedeutet, ich habeden Tag hier noch eingetragen und dann noch den hier eingetragen und hier nehme ich einenTag Kleidzeit. Montag arbeite ich eh nicht. Ich arbeite hier nur 4 Tage in der Woche, genauund jetzt zack, bam, 19. ist der erste Urlaubstag. Also nein, das stimmt nicht, der letzte Arbeitstag.Das heißt also quasi, ich muss jetzt noch 1, 2, 3, 4 Tage arbeiten und das beste ist,morgen muss ich wieder mit der Bahn fahren. Das heißt, wer bei mir auf Twitter am Startist, der muss wahrscheinlich morgen wieder etwas Geflame ertragen. Und das blöde daranist, dass man an diesem Tag eigentlich nichts macht. Ich weiß nicht, ob das Problem auchirgendjemand hat, der im vergangenen Jahr oder die vergangenen eineinhalb Jahre hauptsächlichHomeoffice gearbeitet hat, aber ich finde, der Unterschied von Homeoffice arbeiten zuman ist vor Ort ist einfach riesengroß. Ich meine, daheim hast du erstmal die ganzeHin- und Zurückfahrt nicht. Das ist glaube ich jedem klar. Du bist auch, wenn du fertigbist, bist du fertig. Das ist aber so, du musst dich nicht mit der Bahn umschneiden,das hat alles Vorteile. Aber selbst, wenn du vor Ort bist, im Prinzip ist es nur sinnlosesGemiete, sinnloses Geschwätze. Man schwätzt ja nicht mal übermäßig viel, aber du kannstdich auch nicht richtig konzentrieren, wenn du irgendwas bauen musst. Aber man sich jagedacht hat, oh ja, ja ja, für Programmierer sind, also Großotter, ich arbeite ja eigentlichnicht direkt in der Softwareentwicklung, ich mache auch noch andere Sachen, aber trotzdem,also da muss man sich nicht konzentrieren. Großraumbüros sind eine super Geschichteund das ist natürlich ganz besonders konzentrationsfördernd, wenn jemand im Raum sitzt, der laut telefoniert.Wer kennt es nicht? Und im Prinzip besteht bei mir der Dienstag aus, meeten, meeten, dannsagt dann irgendwer, ach ja Max, bist du auch mal wieder da, ja wie sieht es denn hier aus,bla bla bla bla bla, so nächstes Meeting, dann gehe ich irgendwo hin, was fragen, dannerzählt er mir 20 Minuten was, im Prinzip mache ich Dienstag den ganzen Tag eigentlichnichts und ich frage mich allen Ernstes, wie ich das früher geschafft habe, mit 4 Tagenim Büro dort überhaupt was zu machen und ich glaube, realistisch betrachtet ist esauch so, dass ich da zum größten Teil wahrscheinlich auch nicht wirklich viel gemacht habe. Dasist mit Homeoffice einfach viel viel besser, du kriegst auch viel mehr durch, die dichnerven weniger Leute, das ist eigentlich super, naja, ja das kommt ja auch noch dazu, du sparstdir halt die Fahrzeit, deswegen kannst du zu normalen Zeiten aufstehen und trotzdem haltauch relativ früh anfangen, ja geht mir genauso, Daily 4 Stunden Streams, na nee so viel nicht,aber ich mache auf jeden Fall mehr Streams dann, aber das finde ich spannend, dass dasaktuelle Halo schon raus ist, spoiler Leute, hat irgendjemand von euch noch die Story vonHalo 5 im Kopf, ist Cortana eigentlich wieder gefixt und wieder mit am Start jetzt, weilCortana ist das beste an Halo, ich hab die Story nicht mehr im Kopf, keine Runde Cringe,nein, keine Runde Cringe, das ist spannend, ich werde das mal Offstream ausprobieren,ich bin beim besten Willen kein guter Halo Spieler, dann hat es ja trotzdem für dichVorteile, Halo ist aber auch nicht mehr das was es war von der Magnet Wirkung, denkt malzurück an Halo 3, Halo 3 war jahrelang auf der Xbox einfach so das Multiplayer Ding,neben Cod und ein bisschen später dann Battlefield, aber nach Halo 3 kam nichts mehr, ich glaubenach Halo 3 haben die nicht sogar, nee Reach war das letzte von Bungie, war Halo Reachnoch von Bungie, ja Halo Reach war glaube ich das letzte Bungie Spiel, richtig genau,selbst da ging es schon ein bisschen abwärts, auch mit dem Spieler Interesse, also entwederliegt es daran, dass das Halo Spielprinzip außer Mode gekommen ist oder auch ein bisschenmit daran, dass Halo eben so diesen Glanz verloren hat der etwas früheren Tage, Halo3 war das letzte richtig große Halo wo die richtig die Massen noch hinterher geschrienhaben, so nice Halo, es ist quasi Not Stonks gewesen, übrigens was ich vorhin gelesen habe,was ich auch witzig fand ist, was ich auch lustig fand, dass jetzt wieder überlegt wirdHome Office Pflicht soll zurückkommen, das ist so geil, da werden Sachen abgeschafftund 3 Monate später stellt man dann fest, hoch, wer hätte nur damit rechnen können,es ist jetzt Winter, das wusste man gar nicht, wie bei der Bahn, da kommt das auch jedesJahr komplett überraschend, dass es jetzt kalt wird, so was, es ist September, November,Dezember, da wird es ja kalt, nee das kann eigentlich, das kommt jetzt, das kommt dochnie vor, so Impfzentren zu gemacht, jetzt werden sie wieder aufgemacht, WTF, so alskönnte man das, als könnte man das alles nicht im Vorfeld überlegen, die 4 Feindeder deutschen Bahn, Frühling, Sommer, Herbst und Winter, ja das finde ich lustig und dashier fand ich auch witzig, wo ich die Überschrift heute gelesen habe, Profitgier der Filmindustriestärkt illegale Kopierszene und wisst ihr was ich mir dabei gedacht habe, das erstewas ich mir dabei gedacht habe ist, die lernen es einfach nicht, die, die, die, die können,ich verstehe es nicht, die lernen es einfach nicht, mein Battlefield 2042 Server ist down,ich habe überhaupt kein Battlefield 2042 Server, der abseilen sein sollte, wie kannder down sein, ich habe noch nicht mal einen gestartet, du kannst mit dem Code einen hosten,wenn du willst, glaube ich, ich habe keine Ahnung wie diese Codes funktionieren, ichhabe den einfach mal drunter gehauen, aber hier, die lernen es einfach nicht, ich meine,die meisten Leute von euch werden nicht am Start gewesen sein, sagt euch Napster nochwas, ich glaube den Namen kennt man heute noch, aber wirklich dabei waren wahrscheinlich diewenigsten, Napster, gibt es die überhaupt noch, Napster, gibt es die noch, hey das Logoist noch gleich geblieben, aber sonst, war Napster illegal, aber sowas schon, Napsterwird illegal, äh nein, nein, nein, Aldi, lul, alter, das ursprüngliche Napster kennendie wenigsten wahrscheinlich, das war eines der ersten Musik P2P Tauschbörsen und daswar die Zeit, wo die Musikindustrie damals noch gesagt hat, Streaming, das ist ja hierböse, da entgehen uns, weil die haben ja gesagt, jeder Download wäre ein verpasster CD-Kauf,was ja Schwachsinn ist und die Leute haben gesagt, Musikindustrie, ich will daheim sitzen,auf den Knopf drücken und vorne meinem Rechner den Kram abspielen und die Musikindustriehat gesagt, nein, nein, nein, nein, wir wissen das besser als ihr, ihr wollt das nicht,ihr sollt gefällig CD's kaufen und die Leute haben gesagt, nein, ich will keine CD's kaufen,ich will den Scheiß streamen und wenn ich das nicht bei euch kriege, zu irgendwie demnormalen Preis und zu normalen Release-Zeiten weltweit, dann geh ich zu Napster und hol mirden Scheiß illegal.So, und das gleiche passiert jetzt hier auch, das kann man immer schön sehen, wenn eingewisses Level überschritten ist, was quasi bei den Leuten nicht mehr verhältnismäßigist im Kopf, dann gehen sie illegal hin, wir haben in den letzten Jahren einen komplettenRückgang davon gesehen, ja.Die Leute machen jetzt Spotify, seht ihr, kaum gibt es irgendwie sinnvolle Angebote zu sinnvollenPreisen, wo genug Auswahl an Titeln drin ist, schon machen es die Leute, wer hätte dasso denken können.Es gab zeitlang Streaming-Dienste, du hast eins, zwei Streaming-Dienste gebraucht, konntestdir den meisten Scheiß angucken, so, heute wurden 150 Streaming-Dienste für, keine Ahnung,du brauchst 70 für Musik, 70 für Videos und nochmal zehn, falls du irgendwas lesen willst,irgendwelche Abos und Streaming-Dienste, dann sagen die Leute, wisst ihr was, dann kommensie, dann fangen sie ja mittlerweile wieder mit dem Scheiß an, so nach dem Motto, ah nee,das kommt jetzt in dem Land zuerst raus, in dem Land kommt es später raus, ach nee, hiergibt es wieder keine Untertitel, ach nee, hier gibt es eine Originalsprache und da sagendie Leute einfach, fickt euch, ich lag mir den Kram irgendwo runter, das ist immer dasgleiche und die lernen es einfach nicht und was ich, was ich ja besonders witzig fandzur damaligen Zeit, ich weiß nicht, ob ihr das kennt, Mama, wo ist Papa, äh Kopierschutz,ja ich weiß nicht, was ich suchen soll, Raubkopierer Werbung, das hier, das hier, so, damals habendie sich eher gedacht, hey, wisst ihr was, bevor wir den Leuten irgendwie mal einen ordentlichenStreaming-Surfer geben, machen wir so eine Scheiße hier, ich kriege Anfälle, wenn Kinderrumschreien, deswegen, ich muss das mal ein bisschen leiser machen, sonst bin ich triggert,das hätte ich auch nicht lizenziert, vor allem gerecht, wer entscheidet, das hat michdamals schon immer getriggert, wer entscheidet mit euch gerecht, meinen die ernsthaft imGerechtigkeitsgefühl 99% der Leute, ist es gerecht, dass jemand für das Kopieren vonCD's ins Gefängnis kommt, so, also, so Werbung haben die damals gemacht, ähm, um den Leutenein schlechtes Gewissen zu machen, so nach dem Motto, jaja, bloß nicht Napster oder wasgab's denn dann sonst noch, äh, was gab's denn noch, LimeWire, ähm, Beershare, alter,kennt noch jemand Beershare, was das für ein Kack alles gab, ähm, oder, äh, AudioGalaxyoder sowas, EmuleCasa, genau, diesen ganzen Krempel da, da haben die lieber so dumme Werbunggemacht, richtig, richtig, gestört, naja, gut, so, jetzt haben wir uns da drüber bisschenaufgeregt, wunderbar, alles klar, so, und das ist das, was ich gesagt habe, die lernendaraus einfach nicht, die kriegen es einfach nicht gebacken, ja, pausen war nicht so vielillegale Seiten, wo man Zeug machen kann, Mods, Blitz, einmal, äh, löschen die ganzenSeiten, weil das, das ist im Zweifelsfall, da krieg ich dann auch noch Probleme, wennhier Leute irgendwie links zu illegalen Seiten posten, ja, alles klar, aber sie lernen sieeinfach nicht, ich bin echt begeistert, wie Lernresistent man sein kann, ach ja, ich habdie vm gestartet, weil ich gucken wollte, was ich bei AliExpress bestellt hab und vergessenhab, irgendwas hab ich bei AliExpress bestellt, aha, ist das ein, das ist keine Robbe, wasist denn das, wer ist biologisch, wer kennt sich hier so biologietechnisch aus, was istdas, eine Seekuh, messen, wie schlauter Chat ist, exzellent Chat, so, ähm, was hab ichhier bei AliExpress vergessen, das letzte Mal, hm, nix anscheinend, dann weiß ich auchnicht, keine Ahnung, da hab ich's vergessen, ich bin begeistert, der Chat ist richtig, richtigschlau, ich weiß es ja nicht, weil mein Hintergrund ist ja nicht von mir eingestellt, es ist jaBing Image of the Day, ich glaub ich bin der einzigen, der Bing verwendet, sonst benutztjemand Bing, aber Bing Image of the Day ist das, Toxamonx, danke für den Sub, ich habschon wieder die Hälfte nicht gesehen hier, MatrixHD, danke für den Sub, Legion1498,hier PrimeSub, Poggers, schaff es leider viel zu selten an den Streamszuschauern, bistein neulich mal Lieblings YouTuber, schau dich seit 2011, Massive, nice, dass du hier denWeg hergefunden hast, heute ist aber glaub ich nicht so super spannend, wir schwätzenein bisschen dummes Zeug und ich guck mir ein paar Sachen an, DrGo nutzt doch auch Bingoder nicht, ich dachte DrGo hat irgendeine eigene Search Engine, nutzt DrGo Bing, achden mal die haben was eigenes, Spackhack, sieben Monate, Pog, für Bilder, ja ok für Bilderversteh ich, aber wie gesagt, sind Wish Geschenkgutscheine eine gute Idee für Weihnachten, du bist öftersda, deswegen geh ich davon aus, die Frage ist G-Bait, und falls die Frage ernst gemeintist, nein, Wish ist generell der größte Kack, den man überhaupt benutzen kann, Wish istfür alle Leute, die zu blöd sind, selbst in China zu bestellen, Wish hat keine Existenzberechtigung,ernsthaft, ich weiß nicht, warum Wish überhaupt noch existiert, was ist der Grund, warum gibtes Wish überhaupt noch, für die Memes, ja wahrscheinlich, weil jeder, der wirklichChina Kram haben will und nichts anderes ist ja Wish, kann zu Banggood gehen oder zu Aliexpressoder zu DHgate oder so, was es noch alles gibt, gibt ja zig Milliarden China Shops,wo einer so aussieht wie der andere, die China Shops werden ja eh alle vom chinesischen WebDesign Ministerium erstellt, deswegen sehen die sich auch alle so ähnlich, ich mein mirkann doch keiner erzählen, dass das nicht vom gleichen Web Designer erstellt wurdendiese 3 Shops, das ist doch original der gleiche Kram, approved, die benutzen agiles WordPress,das ist gar nicht kein WordPress, die Noobs lassen sich gerne Jibane, Gearbest gibt esauch noch, genau, gibt viele so China Shops, wir bräuchten ein China Commodate, wie nennensich die Chinesen denn untereinander, das ist ja eher Russisch, the Commodate China,gibt es da denn ein Emote, ne, die Aliexpress ist ein Spring Boot, ernsthaft, Java, na gut,wundert mich nicht, Java ist bei den China Chinesen sehr beliebt, China Commode, ne,wie nennen sich die Chinesen untereinander, es gibt bestimmt so ein China Emote, das machich dann auch noch rein, wenn wir Commodates haben als Emotes, gibt es bestimmt auch China,ja mach, tue dir keinen Zwang an, WinniePoo ist doch jetzt verboten in China, ich hab vergessenwarum, China genau, das bräuchten wir eigentlich, so jetzt machen wir die China Seine wiederzu, da will ich doch eigentlich gar nichts, ich muss mal kurz zur Beruhigung eine RundeASCII Quarium anmachen, UK Emote, ja, da fällt mir aber keins ein, oi, warum machst du immerdas Eins in die Adresszeile, weil ich mir das angewöhnt hab, hat keinen tieferen Sinn,übrigens, Microsoft ist wieder total unfähig, ne, die hatten bei Microsoft letztens so,.net Konferenz und eigentlich haben die gesagt, wir laden alle Watts auf YouTube hoch, sound jetzt guckt man, YouTube.net, das ist halt 3 oder 4 Tagen fertig und, da will ichjetzt net hin, und sie haben nur die Watts hochgeladen bis zum zweiten Tag, die aktuellenWatts gibt's einfach nicht, ach, jetzt fangen sie an mit dem hoch, ne, machen sie nicht,also Microsoft ist da richtig Paynes Champ, dabei gab's 4-5 Talks, die ich eigentlichgucken wollte, Paynes Champ, was hältst du von den tausenden Tech-Stacks, die es mittlerweilegibt, Oldschool, PHP, das kommt ganz drauf an, also ich bin der Meinung, es hat überhauptkeinen Sinn, irgendwie, so dem neuesten Zeug dann nachzurennen, sondern man muss sich dasangucken, was sinnvoll für das jeweilige Projekt ist und ganz im Ernst, wenn man gutPHP kann und ich weiß, wenn man jetzt nicht vielleicht Raw PHP macht, wo man alles selbstmachen muss, sondern fertige Sachen verwendet, die die Fallstrecke ein bisschen, oder sagman so, die Hürde ein bisschen niedriger machen, sehe ich überhaupt kein Problem,was ich PHP, Laravel im Backend und JavaScript Frontend, warum nicht, ist überhaupt keinDing und die ganzen Tech-Stacks, die haben ja eh nur Basswörternamen, wir haben ja letztensim Stream den eigenen, wir haben ja unseren eigenen Tech-Stack erfunden, ich habe aberschon wieder vergessen, wie er hieß, der Chet weiß das bestimmt noch, den Swag, der Swag-Stackhaben wir ja, haben wir im Stream erfunden, Swag-Stack, der Swag-Stack, ich weiß abernicht mal, wie er ihn geschrieben hat, ich glaube so, ich glaube so wurde er geschrieben,ne, SQLite, Vue, ASP.NET Core und das G habe ich schon wieder vergessen, ich glaube, dasSwag-Stack, ich habe schon wieder vergessen, wofür es steht, es war eigentlich nur umwas zu kreieren, was sich cool anhört, Swag-Stack, GraphQL, GraphQL war das, genau, genau, GraphQL,ASP.NET Core, Vue und SQLite, das Swag-Stack und gerade im Javascript Umfeld kannst duja da überhaupt nicht mal Schritt mithalten, also es vergeht ja kein Tag, wo nicht irgendwieein super neues gehypedes Javascript Framework rauskommt, da blickt keiner mehr durch, alsoJavascript ist wirklich abfuck, was das angeht, oh ich habe gerade noch einen Emote hier gefunden,was Twitch mittlerweile nicht mehr haben will, beziehungsweise nicht Twitch, was bettertwitch.tvund better und ffz nicht mehr haben will, hier Band, Band Emote habe ich gerade nochgefunden, wo kommt denn das her, so anstößiges Zeug, warum habe ich denn hier so was in meinemBoard drinnen, es wird gerade aufgefallen, dass es hier noch drinnen ist, das wurde mittlerweile,das wurde mittlerweile gelöscht, es wurde noch mehr gelöscht, ich habe hier richtigRare Emotes mittlerweile drinne, Zulul habe ich zum Beispiel auch noch drinne, Zulul oderoder PogChamp, nee wo habe ich den PogChamp, habe ich den originalen PogChamp noch drinne,wo bestimmt, Band Emotes, also wie gesagt, ich bin der Ansicht, man sollte das nehmen,was man gut kann und was zu dem jeweiligen Projekt passt und der Rest ist eigentlichzweitrangig, ach die machen mittlerweile sogar Werbung in Whistle Studio für Whistle Studio,das ist aber nett, dass man Bescheid weiß, Showidee, Techsack oder Shitcoin, ja daskönnte mittlerweile echt alles sein, habt ihr das mitbekommen mit der Squid Game Coinoder wie dieses Ding hieß, wo der in Anführungsweise Erfinder dann mit irgendwie, was weiß ich,wie viel 100.000 abgehauen ist, das ist der, die Leute sind so blöd, ich checke es einfachnicht, ich checke es einfach nicht, wisst ihr, es gibt Leute, die sind allen Ernsteshier drauf reingefallen, die sind da wirklich drauf reingefallen, diese ganze Show, diehat so krass nach Scam geschrien, wie der Typ schon auf die Bühne ist, wie der Typschon auf die Bühne gekommen ist, wirkt das irgendwie in irgendeiner Weise seriös, wirktdas irgendwie so seriös, wirkt das irgendwie so, als möchte ich da mein Geld reinbuttern,es ist unglaublich, wie einfach sich die Leute bescheißen lassen, der war auch Opfer, jadas glaube ich ja sogar, aber trotzdem, wie kann man sich da so verarschen lassen, dasschreit doch Scam, hat irgendjemand das jetzt gesehen, hat es gedacht, das ist aber maleine seriöse Investitionsmöglichkeit, ich glaube, denen gebe ich jetzt mal 50.000 Euro,da ist bestimmt kein Scam, nein, nein, nein, nein, wer, wer, also keine Ahnung, ich weißnicht, was mit den Leuten los ist, ja wenn es mal reicht, schau dir den Windows 95 LaunchDance an, ne, ne, das ist cringe, oder du kannst ja auch den This is Windows 386, wo dieseSekretärin dann anfängt zu singen vorm Rechner, weil sie Windows 386 hat, ne, ne, das mussnicht sein, Faxgeräte, Bundestag, was, die Faxgeräte sollen weg, ernsthaft, das istja, das ist schon wieder outdated, dann hat man festgestellt, zu Corona-Zeiten brauchtman immer noch Faxgeräte, weil wie soll man denn Corona-Zahlen übertragen ohne Faxgeräte,das geht auch gar nicht, das ist komplett ein Ding der Unmöglichkeit, welche Sprachenkannst du eigentlich, ach keine Programme, ach so, ja eigentlich nur Deutsch und Englisch,es gibt böse Zungen, die behaupten, ich kann auch kein Englisch, aber ich würde sagenDeutsch und Englisch, bisschen hessisch vielleicht noch, ich kann Brötchen bestellen auf Portugiesisch,sonst kann ich nix, ach so, ich kann, ich kann, ich kann Beleidigungen auf Niederländisch,aber ich glaube die Beleidigungen sind mittlerweile TOS und die kann ich hier nicht sagen, weildie, weil die wahrscheinlich Minderheiten diskriminieren oder so auf Niederländischund das, das sage ich jetzt hier lieber nicht, das habe ich mal irgendwo aufgeschnappt undja, ich kann beleidigen, ich kann Leute beleidigen auf Niederländisch, ich kann Brötchen bestellenauf Portugiesisch und ich kann Deutsch und Englisch und so die üblichen Russen und FranzosenFlames aus Online Games, ja klar, BitConnect Remix, ach ne, bloß nicht, das gibt es bestimmt,das gibt es bestimmt, wieviel haben die, ich habe keine Ahnung mehr, für manche ist auchPayPal E-Bahn Aktualisierung seriös, ja ich habe letztens eine, eine Scam SMS bekommen,ihr DHL Paket ist jetzt bereit und da dachte ich erst so Huch, was denn das und dann habeich die Uhr gesehen, die Uhr, Moment wo habe ich mein Handy, ich sage euch mal, ich sageeuch mal, wie die Uhr angefangen hat, sehr, super seriös, super seriös, nein ich willdas Update nicht installieren, MonkaS ist jetzt fast iOS Update angeschmissen, ne, Momenthier, wo habe ich denn, Scam SMS, hier, also Scam SMS, wir haben versucht ihr Paket zuzustellen,prüfen sie hier den Status und dann kommt eine Uhr, ladytittytupfer.com, ich glaubeauch, dass DHL unter ladytittytupfer bestimmt ihren Paketstatus anbietet, klickt drauf,wenn du draufklickst, dann fängst du dir gleich irgendwelche Viren ein, weil das aufdem Smartphone mit aktuellen Patches natürlich deutlich schwieriger ist, die geben sichkeine Mühe, ne, die hätten wenigstens mal einen Shortlink verwenden können oder so,das Schlimme ist, da fallen Leute drauf rein, da fallen Leute drauf rein, maxbestesenglisch,ja zeig mal her, seriöser genannt ist es hier irgendwie Default Comparisons, Englisch,ja ich sag euch kein Englisch, also Schwäbisch wäre mir nicht bekannt, dass ich Schwäbischirgendwie dabei hätte, ich hatte mit Schwaben nichts zu tun, außer dass ich während meinerAusbildungszeit da öfters mal war und da hab ich festgestellt, dass Ulm die unfreundlichstenBusfahrer auf der Welt hat, vielleicht hab ich ja in Ulm auch zufällig damals schonEllo Tricks getroffen und wir wissen es beide nicht, aber Ulm ist wirklich eines der, weißich nicht, also Ulm ist wirklich die Stadt, wo ich am wenigsten jemals wieder hin möchte,ja zum Glück, ich mein, die ganzen Scam-Anrufe und SMS und sowas, die zielen ja gerade ebenauch auf die Generationen, sagen wir mal, über 60 ab, unter anderem, also generellauf Leute, die technisch nicht so bewandt sind, also hätte meine Oma oder mein Opaeine SMS gekriegt, wo sowas drin steht, die hätten das wahrscheinlich angekriegt, wobeimeine Oma und mein Opa, die wären dafür gar nicht anfällig gewesen, weil die hattensowas modernes wie ein Smartphone nicht mal, mein Opa hätte ohne Probleme eins haben können,das gab es da schon, aber der wollte nicht, da wurde das Rechenzentrum, ja genau, ja genauund Generation Z, was kommt eigentlich nach Generation Z, kommt da Generation A wieder,die fallen dann eben auf so Sachen hier rein oder eben auf Generation AA, was kommt, what'safter Gen Z, Alpha, siehst du, so sieht es aus, jetzt müssen wir wieder was gelernt,wir fällt übrigens gerade noch ein, weil ich hier die Steckdose auf habe, wir müssendie noch flashen, ich hab noch 4 Stück hier liegen, ne stimmt nicht, 3 Stück noch, diewir nicht geflasht haben, weil ich hab im letzten Stream gesagt, wir flashen die dannspäter und ich glaube später ist nie eingetreten, also die liegen hier noch ungeflasht rum,müssen wir bei Gelegenheit auch mal machen, aber Steckdosen leisten Flashen beste, esist immer noch später, genau, später ist dehnbar, was machen eigentlich die GithubTrends, was machen eigentlich, lass uns mal ganz kurz in die Github Trends reingucken,das ist Trending, mal schnell drüber scrollen, alles klar, die China-Chinesen sind am Start,Open Source SDK Instant Messenger, das muss man unbedingt was Neues erfinden, es gibtja noch nichts zum Instant Messenger, Instant Messenger ist ja sowas, da gab es noch niewas und gibt es ja auch nie was für, ich weiß nicht warum alle immer so viele Instant MessengerZeug sich ausdenken, ich mein muss ich mal überlegen, wir sind ja schon relativ weitgekommen seit ICQ und AOL Messenger, aber nicht jede Entwicklung in diesem Sektor warzum besseren, was bringt euch smarte Steckdosen eigentlich, mir fällt absolut keine wie icheine Steckdose als Verbraucher aussehen vielleicht für eine Lampe zum Beispiel oder für dieHeizung oder für den Heizlüfter oder für irgendwie Beleuchtung im Schlafzimmer oderwenn du was im Keller hast, was du regelmäßig neu starten willst oder wenn du was im Kellerhast, wo du sagst, hey das muss ich nur einmal im Monat einschalten oder so, da gibt esdoch jede Menge Sachen, ich glaube, ich glaube, smarte Steckdosen leisten oder für 3D Drucker,was auch immer, also ich denke mal smarte Steckdosen leisten dürften eigentlich dieSmart Home Geräte schlechthin sein, mit denen fast jeder irgendwas sinnvolles anfangenkann.So, also was haben wir denn hier schönes, was trennt ihr denn diesen Monat auf Shithub,HashLibsArtEngine, alles klar, Telegram, QuestDB, wisst ihr was ich mir denke zu den ganzenDatenbankdingern, die es so gibt und ich tue jetzt wahrscheinlich einigen unrecht, weildas da sicherlich coole Sachen gibt, aber vollkommen egal, ob es so bekannte Sachensind wie MongoDB oder sowas hier in der Richtung, in der Regel nimmst du Postgres und im ZweifelsfallPostgres mit irgendwelchen, wie heißt das, Addons, Plugins, ich weiß gar nicht, wie dasbei Postgres heißt oder irgendwas, was mittlerweile standardmäßig drin ist und du fährst eigentlichin der Regel ganz gut.Kennst du schon das, Workplace.com, Facebook für Workplace, nein, kenn ich nicht, Next.jsReact Framework, AniCL, ah, guck mal hier, da ist was für die Weeps unter uns, CLI-Toolto Browse and Play Anime, jawoll, endlich, aus welchen, aus welchen Quellen holt dasdiese Dinger denn, das ist doch bestimmt nicht rein legale Streaming-Anbieter oder?Ne, ich kann AniCL eigentlich installieren, weil wenn ich das starte, dann ist das MonkaToss und ich werde im Zweifelsfall noch gestrikt, das muss nicht sein, Tokenlist, was auch immer,XMRIG, auch Bitcoin trendet mal wieder, war eine Weile nicht drin, ist doch irgendwasspannendes dabei, super Fast Compiler, äh, was, ich kann Rust jetzt zu JavaScript kompilierenoder was, was, aber warum, examples, ich habe keine Ahnung wofür es gut ist, es istein JavaScript-Compiler in Rust, ah, ich kann JavaScript programmieren und der kompiliertes dann, ok, das ist wenn ich JavaScript verstehe, wenn ich JavaScript-Native-Anwendungen machenwill, also im Prinzip, wenn ich nur JavaScript ohne irgendwelche großartigen Library-Geschichtenverwenden will, wobei die meisten JavaScript-Libraries, die rein JavaScript sind gehen, aber mit Node-Geschichtenist dann wahrscheinlich schon wieder vorbei, ja, warum nicht, willst du Halo Infinite streamen,wahrscheinlich nicht, ich bin ziemlich schlecht was Halo angeht, aber ich gucke es mir aufjeden Fall an und wenn es mir bock macht und ich vielleicht ein bisschen besser bin, dannkann ich es auch mal streamen, OS X KVM, das haben wir schon mal ausprobiert, das ist wirklichcool, hier hat einer ein KVM, only commercial paid, what the fuck, darf man dafür überhauptGeld kassieren, Apple sagt doch, du darfst glaube ich Mac gar nicht virtualisieren, dasist bestimmt allein schon Toss für Fragen danach, das haben wir aber glaube ich malausprobiert, das war wirklich ganz cool, dass wir dann Mac in der VM hatten, ne, ne, wirhaben es mit VirtualBox unter Windows gemacht, wie lange hast du Urlaub, ich habe Urlaubvom neunzehnten bis zum dritten, vierten, bis zum vierten, also ist ein bisschen, CubeSphere,Container, Platform Tail, da gibt es auch jeden Tag irgendwas neues, YOLO V5, da weißich zur Abwechslung mal, was es ist, das ist Objekterkennung in Bildern, so eines der bekanntesteneigentlich, YOLO, steht für you only look once, alles klar, ist nichts spannendes dabeidiesen Monat muss ich ehrlich sagen, guck mal diese Woche, wie viele Mail Accounts hastdu und wie organisierst du die, oh ich habe viele Mail Accounts, ich organisiere die garnicht großartig, ich habe einen Passwortmanager, da steht alles drin, das wollte ich übrigensgar nicht anklicken, ich habe einen Passwortmanager, da steht alles drin und in der Regel weißich so halbwegs für was und für was ich welchen Account benutzt habe und im Zweifelsfall istes in der Browserhistorie drin, warum eigentlich nur eine Woche arbeiten, weil ich dann Urlaubhabe, ich habe Urlaub ab 19., also ich muss jetzt noch eins, also Montag, also heute arbeiteich, also Montags arbeite ich ja prinzipiell nicht, ich muss jetzt noch 1,2,3,4 Tage arbeitenund dann habe ich bis 4. Januar Urlaub, Pock, so was trendet heute, äh this week, Doggecointrendet, PowerShell, IGIT, warum trendet PowerShell, warum, was machen die, warum denn so was,ich meine PowerShell an sich ist eine coole Sache für Windows Automatisierung, als interaktiveShell finde ich es nicht schön, na gut, ich verstehe, dass es trendet, die Windows Leutehaben lange nach rauf gewartet, dass sie auch mal eine brauchbare Shell bekommen, ja sonderlichspannende Sachen trenden da diesmal aber nicht, Rastic für Backups ist tatsächlich ganznice, Flutter trendet, ich habe übrigens bis heute nicht verstanden, warum Flutterunbedingt Dart verwenden muss, warum kann Flutter nicht Go verwenden, weil das ist auchvon Google und Go ist mit Sicherheit die verbreitere Sprache und hat mit Sicherheit mehr Librariesals Dart, nö ist ja langweilig, trendet ja gar nichts spannendes.So, ja gut, ähm, machst du gerade Werbung für deine Seite, könnte das sein?Ich wollte gerade sagen, das liest sich jetzt aber doch schon ganz leicht offensichtlichnach Werbung, aber meinetwegen, heute, heute will ich mal nicht so sein, lasst, lasst,lasst stehen Leute, lasst stehen, lasst stehen, komm ich bin sogar mal so nett, ich guck malnach was es ist, aber wahrscheinlich gehts nicht über die Suchmaschine raus, weil werweiß wo ich dann da lande, ah das ist quasi so eine, so eine GitHub Alternative für wennman kein Geld ausgeben will, aber warum, was ist da, ok, da musst du uns das jetzt aberauch verkaufen, was ist der Vorteil versus GitHub und warum sollte ich das verwendenanstatt, wenn ich ganz super viel Wert auf Privatsphäre lege für eine selbst installiertesetze XY Software ein oder warum soll ich auch das eher verwenden als GitLab?Jetzt musst du es uns ein bisschen schmackhaft machen, aber eigentlich keine Lust auf ReactNative, aber bei Flutter finde ich, ja geht mir ähnlich, also ich bin ja der Ansichtdass, also kann man sich wohl streiten, es ist erstens Microsoft schuld, dass wir heutemittlerweile so viel Elektronen Anwendung ertragen müssen und leider ist es so, das einzig sinnvolleCrossplatform GUI Framework ist tatsächlich mittlerweile Elektron, Qt ist C++ und dementsprechendschon mal Müll, Flutter ist auf dem Desktop noch nicht gut genug am Start, Maui unterstütztkein Linux, es gibt leider nichts außer Elektron und das ist wirklich sehr pains champ, okes ist also, ja ok, da kann ich aber auch, ich muss sagen das stört mich jetzt persönlichnicht so lange es gut funktioniert, aber dann könnte ich auch GitLab nehmen und es haltbackt bei einem Verein mit dem Ziel Open Source Software in Deutschland zu fördern,ach das ist ein deutsches Projekt, ok das ist zum Beispiel was wo ich sage ja, das lasseich mir gefallen, wenn man deutsche Open Source Software fördern will warum nicht,ja ok, ok verstehe, Non-Profit, was läuft da unten drunter, ist das was eigenes oderist das irgendein, ah hier, das ist quasi GTHS Service oder wie darf man das sehen,ja das habe ich bei mir nämlich lokal auch laufen, dachte mir kam mir irgendwie bekanntvor, C++ triggert mich, Microsoft meine ich, ja das ist Elektron, Elektron ist, ja dasElektron ist die Chrome Browser Engine plus Node.js und wenn du da ein Hallo Welt Programmstartest, dann brauchst du erst mal 300 MB RAM, aber gut RAM haben wir ja heute genugDaily Driver Linux naja, ihr wisst meine Meinung dazu, ihr wisst dass ich Linux Fan bin undmit Linux mein Geld verdiene, aber für mich ist die beste Kombination immer noch Windowsund Linux VM, vielleicht wird das mal durch WSL abgelöst, mal gucken und ich finde esimmer noch sinnvoller Linux unter Windows zu virtualisieren als Windows unter Linux,dementsprechend einfach das besten aus beiden Welten nehmen und nicht irgendwie sich dasLeben schwer machen von Leuten die quasi sagen man muss das eine verwenden und dasandere ist scheiße, einfach immer das Tool nehmen was für die jeweiligen Anwendungszweckeam sinnvollsten ist, ja das wäre nice, naja wisst ihr was wir gucken uns auch mal einpaar Videos an, was haben wir denn hier zu bieten, ich habe einfach ein paar random Videosaufgemacht die ich mir auf dem Handy zum später gucken gespeichert habe, was haben wir dennhier, Homemade Catfeeder 3D Printed, alles klar, Dear Dice please listen, ok ok, daswürde mir empfohlen, das können wir uns tatsächlich mal geben, Raspberry Pi Zero, gut da habenwir uns eigentlich letztes Mal schon angeguckt, das müssen wir uns nicht nochmal anschauen,wir wissen dass der Raspberry Pi Zero 2 schneller ist, weil er die CPU vom 3er drin hat und dementsprechend4 Kerne oder waren es 2 Kerne und 4 Fakekerne, ne ich glaube 4 richtige Kerne, 10 Wege umbesserer Entwickler zu werden, oh ich glaube das ist jetzt ein bisschen zu langweilig, wasist das hier, oh mehr LEDs zeig her, LEDs ich brauch LEDs, das ist wieder, das ist WLED,das ist 100 pro WLED, was da unten drunter läuft, die Frage die sich mir bei mir immerso was stellt ist, warum, ich mein mag zwar cool aussehen, aber warum, der Vorteil vonirgendwelchen 3D getruckten Lampen und LED Ketten, das verstehe ich ja noch, aber warumein LED Würfel, wahrscheinlich weil es geht, ne wenn das Arduino ist dann ist es kein WLED,schön 1 Ampere, oh die ziehen definitiv mehr, das sind ja 16 mal 16 mal 16, da kann ichdoch bestimmt 16 hoch 3 einfach rechnen oder, das sind 4096 LEDs, das zieht um einigesmehr als ein, wahrscheinlich sind das auch noch 5 Volt LEDs, das braucht, boah da brauchstdu ja das brutalste Netzteil dafür, vielleicht sind das auch 12 Volt LEDs oder noch mehr,keine Ahnung, aber wenn du 4095 LEDs, du brauchst mehrere Netzteile, glaube ich anders da kommstdu da gar nicht hin, also wenn du wirklich 4095 LEDs, sodass du es auch ordentlich siehst,alles versorgen willst mit einem Netzteil, 5 Volt LEDs mit einem Netzteil, das Ding mussja, was weiß ich da brauchst, 80 Ampere Netzteil 5 Volt oder sowas, dass das ordentlich funktioniert,vor allem werden dann die dünnen Kabels bisschen warm, könnte ich mir vorstellen, das kannja so nicht nur zweck der Sache sein, was ist denn so das stärkste, gibt es 5 Volt 100Ampere, oh das gibt es tatsächlich, du hättest so mit 200, kann auch durchaus sein, ich habejetzt einfach irgendwie irgendwas mal gesagt, was viel ist, Power Supply, ne steht nichtda, der hat ein Github, stand da was von Github, hier, ach ne das sind die Files, also wasdas zieht, wird mich echt mal interessieren, wie gesagt vielleicht 100 200 Ampere, gibtes 5 Volt 200 Ampere Netzteile, was braucht man da für Kabel, was jetzt mal ernsthaft,ich hab davon ja, so Elektronik Sachen sind ja eh nicht so komplett meins, was für einKabel brauche ich denn überhaupt, dass ich da 200 Ampere drüber machen kann, oh beiAliExpress, oh das ist natürlich die beste, ich glaube der Ort an dem ich mir das kaufenwill ist definitiv AliExpress, Mikrocontroler, oh nein, please nicht das MikrocontrollerForum, monkaS, wetten die Antworten sind unter aller Sau, oh ne, geht schon los, das ist dasschlimmste Forum was es gibt alter, was 14, 14 Quadrat Millimeter, das bedeutet ein 1,5Zentimeter großes, ne Moment, wie viel Millimeter sind Zentimeter, doch, doch oder, 10 Millimetersind ein Zentimeter, das ist ja nicht wie Millisekunden, achso da hab ich, aber ein 1,4 Zentimeterdickes Kabel, das ist ja, das ist ja sag mal mal so, das ist kleiner Finger dick das Kabel,du brauchst nen Kabel wie mein kleiner Finger, oder nicht, ja das stimmt aber ich muss esja irgendwo ans Netzteil anschließen, also zumindest am Netzteil brauch ich das, Leitungsquerschnittberechnen, exellent, Kommentarfunktion geschlossen, oh ne, please jetzt nicht, nur noch eine Wochearbeiten, ich muss mal kurz gucken ob mein neues Video noch gut ankommt, ja ja, ja kommtgut an, ich hab es erst vor ein paar Stunden hochgeladen 12.000 Views, kann ich mich nichtbeschweren, so gucken wir uns mal irgendwas an, was gucken wir uns den jetzt an, zeigtmal her, Homemade Cat Feeder, den gucken wir uns jetzt an, selbst gebaute Katzenfütter,Automatisierung, Stellz, Arduino kontrolliert, jawoll, auf gehts, das müssen wir jetzt angucken,Hacker News, ja da war heute nix spannendes.Hey guys, I have two cats, one is named Yoko and the other one is named Johnny and sometimeswe have to call each other Johnny, Johnny, Johnny, Johnny, Johnny, Johnny, Johnny, Johnny,Johnny, Zack!Jesus!funktioniert mit schicko funktioniert das nichtok zeig ja das ist sehr laut das ist sehr laut sehr laut überspringen wir jetztwas meine katze machen würde die wird sich erschrecken sobald das geräusche macht diewürde so machen und abhauen ok wir skippen mal ein bisschen vorok das ding auszudrucken das dauert aber dauert wahrscheinlich schon mal zwei tagebei so groß ist das gar nicht wahrscheinlich vielleicht geht sogar in einem tach die leiseund für weiter auf dieser bau welches die insite big play der unddies part will rotate inside and control the amount of food that will get outeverything was printed with PLA material and without support a rotator I've used toparameters 20 percent infill a 0.25 millimeter layer height and 0.4 millimeter nozzle and that'sit for the 3d printed parts okay together with these parts we need to use a servo motor likethis one the mg 195 da könnte ich vielleicht den motor recyceln den ich in diesemja wie hießen dieses gerät was wir uns letztens im stream angeguckt haben diesemautomatischen ventil öffnen schließen konstrukt noch drinne habe könnte ich den motor fürirgendwas verwenden noch das was wir kaputt gemacht haben das sieht aus wie das was manfrüher in inline skates drinne hatte beste beste leute wenn ihr 3d drucke habt und das und sowasnicht habt das ist das beste gadget was ihr braucht wenn ihr 3d drucke drucke macht und diemiteinander verschrauben wollte beziehungsweise deckel oder so drauf machen wollte er hieltetinsatz ne ja reddit insatz für 3d print das braucht man passt mal auf das ist massivebig brain sack guten tag everybody moin stefan ja ja guck es euch an guck es euch ankolben holen und reinschmelzen wie man sieht ja gar nicht man schmelzt das man schmelztdas einfach rein guck man schmelzt das einfach rein und dann lässt man das kalt werden das zeugist wirklich bomben fest ich habe das auch schon öfters verwendet man braucht doch nicht mal einloch unten drunter aber ihr solltet das fenster aufmachen weil es ein bisschen stinkt und ihrsolltet nicht ganz so heiß machen das ist wirklich nice also mit dass sie und du kannsthalt danach schrauben und so reindrehen also kriegst viel besser teile miteinander verbunden als wennman irgendwelche löscher in 3d print druckt und dann da schrauben durchdreht also das wirklicheines der besten eines der besten zusätzlichen sachen wenn man 3d drucke hat kostet ja auchnicht viel kostet ein paar euro das ist richtig park ja was für ein ding warum nicht einfach ntpdas ding kommt doch ins wlan oder? ach nee im moment der arduino nano hat ja gar kein wlanweil akkubetrieben will man das doch eh nicht machen mit einem motor drinich würde da einfach ein esp32 nehmen und ntp machen weil das ding eh ins wlan kommtalso manchmal sind glaube ich die einfachen ansätze die besseren guckweil da macht er sogar strom dran da macht er sogar strom dran ntp wlan fertig ja das sinddie steine da habe ich auch massig davon was super titte was das das ist ein kleber oder?ja ja das macht er auch nur jetzt weil er ein video davon macht ich habe mir das auchschon überlegt ob ich nicht irgendwie meine drucke teilweise ein bisschen schöner machensoll indem ich sie polieren mache ich nie mache ich nie ich habe das ausprobiert dasfunktioniert aber mache ich nicht wozu null ja beste hier sieht man es zack richtig reinstecken beste also da seht ihr dass die dinger sind wirklich nice und man denkt jetzt das hältauch nicht aber das zeug schmilzt dann wieder rein weil das ist ja wieder direkt darum unddas zeug ist wirklich kriegt das nicht raus also wenn ihr das raus kriegen wollt da müsstihr schon eine schraube reindrehen und an der anderen seite wirklich mit irgendwie schweremwerkzeug dran irgendwie einspannen und mit drehen oder so also ihr kriegt das definitivnicht mit eurer normalen kraft im armen da wieder raus es sei denn ihr seid hier irgendwieder riesen muskelmann der ansonsten irgendwie auch 200 kilo oder hochhebt oder so meinetwegenvielleicht aber normalerweise kriegt ihr das nimmer raus und wir tun das selbe für diebottom part for the electronics case we had four insertion an chat im otte case with screwswe will add the bearings on these holes later once we have the servo motor in place so nowlet's hack the servo motor servo motors usually can rotate 180 degrees i want to make thisto rotate without stopping if we open any servo motor we will find some kind of feedbackwhich usually is just a simple potentiometer so clearly that the motor is always in themiddle position we need to replace this potentiometer with a fixed value resistor so i want to solarto resist thishätte jetzt mal ein mini floxer da wird sich das viel viel sauberer wieder anlöten lassenam ende in a voltage divider configuration and they must have the same value so we havea middle value in between ich mein nicht dass man dafür wirklich irgendwelches flussmittelbräuchte ne das ist dafür überhaupt nicht notwendig aber es wird trotzdem meistensschöner so i soldered them like this to the control pcb so now the dc motor should spinwithout stopping when we apply a pwm signal to it is all spinning but there is one morething to do if you open the oh so viel kogast one of the gear has one pin and this is usedto restrain the rotation to only 180 degrees so viele kogast hatten wir lange nicht mehrim stream so we could rotate freely 360 degrees and that's it we can now close back the motorand here i have it connected to the arduino and the potentiometer so as you can see ican still control the rotation direction but the servo will now rotate without stoppingok so now get the m3 threaded rod and cut it to around 20 cm if needed we can cut itshorter later we can screw this on the servo motor to fix it in place i will also addsome entry nuts and tie them to the motor you could even apply some glue if you wantimmer schön heiß moment ist es überhaupt heißkleber macht er da some glue if you wantyou could even apply some glue if you want so eher so als sekundenkleber oder sowasist es ist es der titty kleber den er eben gezeigt hat mit dem tollen namenim zweifelsfall also es gibt es gibt aber eine grundsätzliche regel wennwas nicht hält einfach heißkleber drauf als kleber ist die lösung für sehr vieleprobleme and the bearing and insert this entire setup inside of the plastic part and measurewhere that nut should be so the bearing will fit exactly oh guck mal wie gut das passtinside of the part and when you find a perfect position i add two more nuts and tie them tothe bearing außer deine beziehung weiß ich hast du mal ausprobiert also ich hab da große erwartungimmer in heißkleber als kleber hilft für fast alles now that the bearing is in place all isleft to do is to add the feeder separator in between so place that feeder inside till you can seethe insertion nuts to the hole so now we add a threaded rod and rotate it till the screw willget on the other side and on this other side we add another nut and tied it to the feederinside so it won't get loose you could also add so man aber ganz schön viel geschraubt ichmag das ja wenn man 3d drucke mit ordentlich stabilen sachen kombiniert vieles 3d gedruckteist halt oftmals ein bisschen wackelig vor allem wenn halt bewegliche teile 3d gedruckt sind die dannineinander greifen ja ich habe jetzt zum beispiel schon leute gesehen die also sieht man auch inyoutube videos die drucken dann zahnräder aus dem 3d drucker und machen die ineinander und das istmir nichts also ich finde manchmal haben so metallteile schon ihre daseinsberechtigungan die second bearing we could add to more nuts and tighten them so dass es langfristig ebenfunktioniert und die other side we can also screen place the servo motor using entry nutsand insertion that we have added before now the feeder mechanism is ready and as you can see wecan now rotate the feeder but after some tests I realized that we also need this part in placeand we use this part so not all the food would get on top of the rotating feeder because thatwill block it in place like this we can control the flow of food so get this part and 3d printedwackelt ich sehe es genau dass es wackelt also warum er sich die mühe mit der batterie und deruhr macht verstehe ich nicht wie gesagt esp 32 nehmen ntp wlan fertig zumal das e ans netzteilanschließt ist connected to the servo and the real-time clock module and everything is suppliedwith 5 volts from the buck converter i also want to add three push buttons so we can change the timeyou can also save the battery so falling the schematic i connect everything to a prototyping pcb and addthe arduino nano through hole pains champ outdated overrated so for the craft it is of course agreat story but if you follow youtube videos they tell you that you have to order some ready-madeputzding bei bcb way oder sonst was dir schon irgendwelche fertigen boards bestellen nee hatder wlan die die die arduino dinger also die die älteren arduino dinger haben alle keinen wlan aberes zwingt ihn ja keiner arduino zu verwenden in die rtc module ich weiß dass die batterie zumzum ur modul gehört aber man könnte sich das alles sparen indem man einfach was wlan fähigesnimmt weil man sehr eh schon in den steck vorzusteckt wlan ntp fertig i get the buck converter and isoldered the 5 volts connection als usv nee mit der batterie kannst du den motor gar nicht betreibenon the back then i added to the pcb to supply the digital parts hat eigentlich keinen sinnon one side of the electronics case i made a hole and i will add a jack connector like this one forthe supply und wenn internet weg ist und wurde von aus fungel die kratz ntp ist ja nicht irgendwieso dass das instant out of sync ist du rufst dir per ntp ab und süngst dann konstant und wennein internet mal zwei drei tage weg ist selbst dann ist es nicht wirklich out of sync überhaupt keinproblem i also make another hole on top and i pass the server wire to this hole i make theconnections and fix the pcb inside of the case hat der sp nicht sogar eine clock in der clockon board der sp 32 doch der hat glaube ich sogar eine clock on board weil du kannst ja deep sleeptimer machen und sowas hat die push buttons like this one here and i soldered wires to each forground and then i connect them to the arduino so now i could close the case but first we need toupload vielleicht wollte das gerne selbst machen im arduino keine ahnung using the ds 32 32 librarywe get the real time and we store this time and the feeding time on the eeprom memory so even if iunplug the feeder we will still have the schedule saved onto the memory die on board lock wäre ihmnicht genau genug ok ich weiß nicht ob das wichtig ist für die katzen dass sie zur millisekunde genaugefüttert werden but we can select the portions of who to serve between one and ten fifteen twentyand back to one and using another push button we can select the time interval in hours from one totwenty four and using the third button okay das muss man sich nicht angucken ich will eigentlichsehen wie es funktioniert and when we get to that time we spin the motor for so long according tothe portions and that's it we also send some notifications with the buzzer using analog rightkein c++ 20 style painstamp und der macht es richtig der übertreibt sich mit c++ weilsobald du anfängst wirklich c++ features zu verwenden dann wird sie nach kurzer zeit aufden kick skin i finally decided to add a display as well leute ich habe die idee warum überhaupt ntpund warum überhaupt in the real-time clock einfach einen gps empfänger dran genauere zeit als übergps kannst du gar nicht holen einfach gps empfänger dran und urzeit beste so it will be easier to seethe portions and the time so i connect this to the ice crazy pains on a4 and a5 include in place onthe plastic case i would change the design of the case so it will already ah da macht sogarbedienung über knöpfe da dran ok das ist big brain übrigens das ist ein weiterer grund warumman esp 32 viel besser wäre wenn im esp 32 könntest du dir nämlich ins wlan hängen und das ganze überden web interface einstellen anstatt über irgendwelche knöpfchen but like this we can now see theportions and the time and not rely on the buzzer notification dann nehmen wir doch gleich ein atomoren modul naja es gibt sehr viele also zeitzeit sync dinger die über gps gehen also selbst wenn dueine ordentliche selbst wenn du eine ordentliche uhr nimmst die du so per funk singst das ist auchnicht genauer als gps also das kann sich kann sie nicht nicht beschweren das ist wirklich superund so gps modul kostet ja auch nicht viel also ganz ehrlich in dem fall ich hätte sp 32 drangemacht jetzt in web interface zum einstellen wie die katz gefüttert werden soll so download thecode from below and upload it to the arduino nano und mit esp 32 könntest du gar noch cloud ai undblockchain anbinden genau da könntest du nämlich automatisch lernen wann du deine katze am bestenfüttern solltest dann wir können die case mit m3 schrauben ai unterstützt wie auf der einenseite macht da überall so so coole dinge rein und hier wird die schraube einfach so durchgeschraubtwas ist da los an da unten drunter sind wahrscheinlich die dinger das schienlernenkette wieder als nächstes wollen mich ein 50 billar pressing the first button we can changethe portions glaube das sind zu wenig data points kein problem einfach genug diagonalskalieren dann geht das und daily scrum nicht vergessen und wenn wir get to that time dinneris served and the server will start rotating so ich meine coole coole idee ist das schon aberich hätte es anders gemacht meine wird abhauen okay sie würde wegrennen i made this whole here sowe can see the food level and inside we have to glue in place a transparent plastic film so i cutto size a plastic sheet and glue it in place like this we can see inside of the plastic aber guteidee gute idee finde ich gut wobei wisst ihr man hätte es jetzt noch etwas machen könnenmärkte das mit einem ultra schall oder oder laser entfernung sensor könnte man das messen wieviel der stand ist ist also recommended to add a silica back like this one on top of this topplate so like this we can absorb the moisture and keep the food dry and that is quite importantso now i can feel the hopper with dry food then we can use the ultra schall fällt aus wegen katzeja ist vielleicht wirklich das keine gute idee ja hast du recht da rennt sehr direkt weg dabeiaber laser entfernungsmesser geht was die haper i add the ball below the feeder and i set thetime to only 20 seconds in the code just for this test will ja dass die katze sich in augeaussticht oder was wisst ihr was man machen könnte man könnte wirklich eine waage drunter stellen dakann man die katze auch gleich noch messen die kann sie gleich noch wiegen ob sie nicht nochmehr pfiffet geworden ist ja oder genau einfach einfach tatsächlich wagemäßig load cell oderirgendwas für für gemischt messen ja wobei diese dinger sind ja selten für dauerbelastung gedachtdie werden ja dauer mit dauerbelastung ungenauer wobei ich weiß ja nicht ob katzenfutter alsbelastung zählt man könnte sogar sagen wenn man nicht will dass die katze zunimmt kommt nurdann setzt man ein maximalgewicht das sagt man dann quasi wenn katze nur unter maximalgewichtist und da kommt immer nur genau so viel essen raus bis zum maximalgewicht das heißt wenn mangesagt maximalgewicht fünf kilo und die katze wiegt 4900 da kommt 100 gram essen raus erst wenndie katze abgenommen hat gibt es wieder so viel essen dass sie dann quasi mit essen auf fünfkilometerwage kommt ich meine die katze treten steigt ihr aufs dach die mauz die mauz sich sosehr im flur ein ab wenn da nichts raus kommt und die wird dann auch sauer die haut das ding dannum und macht kaputt im zweifelsfall so the project works and now my cats will always have food iwill leave this device running while i'm home as well for a few months so i'll make sure itdoesn't fail maybe a future improvement is to make it based on batteries and using batteries somaybe that would be interesting ich würde es mit wehlein machen aber trotzdem an strom anschließenwireless mit akku ist ist halt dumm mit einem motor vor allem wenn es mehrfach am tach sich bewegtdas ist kacke das geht so schnell her aber man könnte big brain time machen das in irgendeinerart und weise aufladen da noch mit irgendwie solar energie oder so aber im haus ist halt doof dascheint halt nicht die sonne another improvement would be maybe to add some suction ventos likethis one below the support so the feeder will get zeigt er uns jetzt auch noch wie die katzendas fressen oder aber zum aufladen genau du machst hamster rad daneben die katze muss erst malordentlich rennen und erst wenn der akku voll ist kommt essen raus ich will jetzt ich willerzählen wie die katze angeht zeige ich die katze auf jetzt katzen wie kacke waitwir bekommen es noch nicht mal vorgeführt lasse mich raten das hat nicht funktionierthat nicht funktioniert hat weit gibt es kacke weite emote kacke weite gibt es kacke weite jaus versus german players let's find out neinok wir gucken uns jetzt noch dieses eine acht minuten video an zu battlefield 2042hier da ist please listen da bin mal gespannt was er sagt weil danach muss ich auch pennen schonspät ich glaube die haben ich glaube da ist hat ehrlich gesagt ziemliche zweifel gerade anihrer eigenen fähigkeit das sieht man die letzten battlefields über den flieger anja das stimmt ich finde es cool dass er battlefield 5 nicht erwähnt hat weil es ja ganz einfachbattlefield 5 wenn man es einem nicht gefällt soll man es nicht kaufen ja da hat er rechtich habe jetzt von einigen leuten gehört noch ich lese das öfters auf twitter dass die leuteangeblich richtig spaß am wenngarten multiplayer haben das ist eines der wenigen color duties wasich mir nicht gekauft habe weil es mich so überhaupt nicht gejuckt hat sie aber wie kannes spaß machen mit spmm spite changing things up wahrscheinlich reverse boosted alle it'sbreaking the mold of what previous battlefield games stuck to map size game modes classesin game gibt ja keine ich mein es hat keinen inhalt das spiel all out warfare hat zweispielmodi breakthrough is crap auf der hälfte der maps das andere hat box hoch drei alsoja das video ist so voll dick aufgetragen mit der aussprache her8 videos ich weiß dass er das nicht meint aber alle mit 8 videos immer ich kenne alsoich habe viele videos jetzt gesehen auch zu diesem thema hier kann aus bdfield 42 angehtund das hatte klar da waren ein paar blöde kommentare aber das meiste ist eigentlich relativsachliche kritik aber viele leute verkraften das einfach nicht für die für also ich habhat den Eindruck, dass für viele Leute einfach normale Kritik heutzutage immer automatischgleich Hate bedeutet.Und wenn man das schon immer unterscheiden kann...Ja, geht mir genauso, Chet, ich hätte mir auch so gewünscht, dass das Game, ich wäreder glücklichste Gamer gewesen, seit langer Zeit mal wieder, wenn das Spiel richtig gutgewesen wäre.Also, gerade die All-out-Warfare-Portionen, der Day One-Patch, der kommt am 19., fixt ervieles, wo soll ich das wissen, keine Ahnung, ich gehe davon aus, dass ein paar grobe Schnitzergefixt sind, aber sag mal so, den Kern des Games, wo es was ja auch viele Probleme hat,wird er nicht fixen können.Moment, was?Warte nochmal mal.Achso, ja, die Concepts looken gut, ihre In-Game-Menüs in Battlefield 7, looken gut, ihre In-Game-Menüsin Battlefield 7, looken nicht gut.Ich finde, Voice-Chat ist eine coole Sache, ja, aber es ist so inkonsequent oder so undurchdacht.Voice-Chat, ja, also ich bin sofort, die sollen sofort Voice-Chat einbauen, habe ich keinProblem mit, aber dann, dass die Teams nicht bestehen bleiben nach der Runde, das heißt,du machst das Game anonymer und mit Voice-Chat wieder entanonymisierst du es, du willstdoch, stell dir mal vor, du bist mit jemand hier in der Lobby am Start und ihr verstehteuch gut und ihr labert In-Game-Voice, Team läuft gut und ihr werdet einfach direkt rausgeschmissennach der Runde, dann müsst ihr euch adden und könnt zusammen neu suchen und so was,ja, aber das ist doch doof, warum bleiben die Squats nicht einfach bestehen?Klar, ich weiß, warum das so ist, weil es irgendwelche Kacknoobs davon abhalten könnte,um das Spiel länger zu spielen und wenn sie das Spiel nicht länger spielen, kaufen siekeine Microtransaction-Season-Passes oder sonst was, ja, und sie brauchen es natürlichfür ihr angeblich nicht vorhandenes SBMM, das brauchen sie ja auch, aber ich sage euch,das ist echte, ich habe es von Anfang an prediktet mit dem Server-Browser, dass es keinen gibtund es wird nicht lange dauern, dass rauskommt, dass dieses Spiel auch SBMM hat, ich sageeuch, so wie es ist, und da gibt es Leute, die sagen, Max, mit 128 Spielern geht dasgar nicht mit SBMM, natürlich funktioniert das, das mag vielleicht nicht so detailliertfunktionieren, aber du kannst im Prinzip alles mehr oder weniger scalen von klein und funktioniertziemlich gut, so ein bisschen größer funktioniert noch halbwegs passabel, musst du ja auchgar nicht mit 128 Spielern, das muss ja gar nicht so genau gefeintuned sein, es gibt keinenServer-Browser, nein, gibt es nicht, in Portal gibt es einen Server-Browser, aber das istüberhaupt kein Ersatz für den Kernspielmodus, der keinen Server-Browser hat, diese All-of-Warfare-Geschichtehat keinen Server-Browser, nein, und ich habe es prediktet, vor über einem Jahr habe ichein Video zugemacht, da haben alle so, nein, Max, das kann überhaupt nicht sein, war Battlefield00 Server-Browser, nein, nein, da wird es niemals, es wird sein, ich kann euch das aber auch,ich kann euch das instant sagen, ob es SBMM gibt, nämlich am 19., ich habe jetzt ja relativviel gespielt, ich glaube, zum größten Teil auch ganz brauchbar, bestimmt nicht superkrass Elite-Stells, aber ganz brauchbar, wenn ich am 19. nicht alles voller Noobs habe,dann gibt es SBMM, ganz einfach.Joa, Bock ist auch nicht tamam.Joa, gibt es nicht.Wenn das das ist, was du tun willst, dann geh für es.Wir müssen es einfach anstecken.Aber wirklich, die meisten dieser Dinge sollten nur in der Spielzeit sein.Ich meine, eine Statistik-Page.Das kann sein, weil es eine artistische Richtung ist.Das sollte einfach ein Ding sein.Lieber Dice,nehmt nicht den Fuß des Acceleratores.Bitte.Das hat mit Battlefield V passiert.Und mit den Weihnachten, die nach Weihnachten kommen,bin ich ein wenig versorgt.Das wird langsam.Eine Menge Zeit und Effort wurde über die letzten drei oder so Jahre in diesem Spiel gespielt.Und um die meisten von hierher zu kommen,ist ein riesiges Erlebnis.Ich kann es schlecht einschätzen, wie krass die Herausforderung ist, Corona Homeoffice für Spieleentwickler.Aber ich übertrag das mal so ein bisschen auf das bei uns.Ob ich jetzt den ganzen Tag am Rechner auf der Arbeit sitze oder am ganzen Tag am Rechner daheim.In der Regel klappt das daheim sogar besser.Und ich bin mir nicht sicher, ob es die Herausforderung so sehr steigertfür die Spieleentwicklung, wenn die Leute von daheim arbeiten.Ja, nur weil es zwar ab und zu Level 1 gibt. Gut, die können ja reingeworfen werden zum Testen.Mittlerweile bin ich eher der Meinung, ich würde wundern, wenn es nicht sowas gibt.Das kann ja sein, dass es nicht so krass wie in Call of Duty ist,aber mich würde wundern, wenn es sowas nicht gibt.Was bringt die ganze Anonymisierung von Scoreboard wegmachen und sonstige Geschichten,wenn man nicht im Zuge dessen eben solche Noob-Schutz-Mechanismen wie SBMM einführt?Also warum sollte man das eine ohne das andere machen?Oder warum sollte man das überhaupt einbauen, wenn nicht als Voraussetzung dafür?Nö, das Game hat keinen Inhalt.Nein, sowohl Hazard Zone als auch Portal ist kein Ersatz für das Kern Battlefield.Sie sind doch nicht incredible, die haben das Game mega verkackt.Das ist so ein typisches Video, der muss es so super freundlich Kleinigkeiten auferhypen,damit die ganzen Ultra-Fanboys ihm nicht aufs Dach steigen.Das Spiel kann schon wirklich Bock machen, das will ich auch gar nicht mal bestreiten,aber ich sehe das Gold unter der Oberfläche nicht bei Battlefield 2042,wohingegen ich es bei Battlefield 4 gesehen habe, trotz verbacktem Kack am Anfang.Guckt euch doch nur mal die Maps an, das ist einfach offen zu 90% Gelände,diese Sachen, diese Hotspots hier mit den Gebäuden, das kann schon wirklich Bock machen,aber die ganzen anderen Sachen sind in Conquest quasi entweder, also aktuell,entweder fährst du mit dem Hovercraft rum oder die Helis zerficken dich instant.So läuft es aktuell in Conquest.Und im Prinzip hat in Conquest nur die Seite Spaß mit Luftüberlegenheit,weil es gibt einfach nichts, wo du dich irgendwie, du hast ja mal da Häuschenund da mal irgendwie eine Lagerhalle, du kannst ja nicht die ganze,du willst doch nicht die ganze Runde um eine Lagerhalle spielen in Conquest.Also 2042 von der Grafik nicht so nice aus wie Battlefield 4, naja doch,es sieht schon gut aus, die Sache ist nur die, dass es detailarm ist, wie ich finde.Also der grafische Unterbau, also das Frostbite Gerüst ist schon echt gut,kannst dir nichts sagen, aber es ist halt sehr detailarm.Also es wirkt halt so, als bräuchten die Maps noch bestimmt ein halbes Jahrintern bisschen Iterationen und Ausprobieren und Fine-Tuningund vor allem eben auch ein bisschen mehr Liebe zum Detail.Ja es hat, ich meine guckt euch mal die Brücke in Kaleidoskop an,das ist ein leerer Betonblock.Weiß ich, ob man das hier irgendwo sieht, ob hier irgendwo die Brückehoch und runter gefahren wird im Video?Hier, guckt euch das an, das ist eine fucking Brücke, was ist das?Das sieht aus wie ein Block aus Unreal 1, das soll eine Brücke sein.Das hat kein Geländer, das hat keine richtige Straße, das hat nichts.Das ist, und irgendwie klitscht es hier auch gerade raus, das ist ein Block aus Half-Life 1.Das ist gerade auch ernsthaft, doch ich sag nichts, es hat anscheinend wirklich ein Geländer.Das ist doch kein, nee.Das sieht aus wie eine Xbox 3, wie eine Xbox 1 Brücke, also die Xbox 0 Brücke.The PC Performance in particular FPS on high settings.General bug fixes and optimization on PC, I think it's okay on console,but on PC at least it just has to be a priority right now, it's crazy.It nearly makes some maps unplayable like Manifest.Add back in some of those legacy features the online community is crying out for.Maybe have another look at the real core of the multiplayer experience.By the way, Panzerplatten nerven mich übrigens auch ziemlich,weil du nicht mehr predikten kannst, wann Gegner downgehen.Anything can be tweaked to make it more familiar on the surface level.Keep the gameplay loop, I think most of the experience is really good fun.The sandbox nature of everything is really in the spotlight with 2042.And fans are definitely having fun.I just think a little more should be done to smooth out those edgesand really nail what the Battlefield experience is supposed to be.Das Game muss quasi nochmal zur Hälfte komplett überarbeitet werden,dass da was Gutes rauskommt.Nicht sagen, dass es little more ist.Granted, most of it isn't constructive, but behind it all is a point of shock.Warum schaffen sie es sich so was wie Battlefield 3 aufzustellen, nur moderner?Weil die glaube ich einfach keine Leute mehr haben, die das passende Gespür dafür haben.Und das kommt wahrscheinlich noch dazu, weil wir in anderen Zeiten leben.Wahrscheinlich Management und oberes Management und noch höheres Managementund dann kommt wahrscheinlich Bobby selbst vorbei.Moment, wir sind ja bei EA, wir sind ja nicht bei Activision.Oberstonkstyp selbst vorbei und sagt das und das muss aber seinund die Leute sagen ja Moment, das passt überhaupt nicht in unser Design,dann sagt er mir doch scheißegal.Ja, das ist so eine Kombination aus allem.Zu viel Stonksleute, die mitreden und wahrscheinlich tatsächlich auch zu viele Leute,die oder zu wenige Leute, die noch wissen, was richtiges Battlefield ausmacht.Ich meine, hier ist nichts drinne in den Räumen.Das ist einfach leer.Hier oben an der Decke siehst du, die können, wenn sie wollen.Aber was ich meine, hier ist nichts drinne.Das ist einfach leer.Hier oben an der Decke siehst du, die können, wenn sie wollen.Aber was ich meine, hier ist nichts drinne.Das ist einfach leer.Hier oben an der Decke siehst du, die können, wenn sie wollen.Aber was ich meine, hier ist einfach nichts drinne.Vor allem, warum ist das ein Rechenzentrum mit RGB-Räumen?Hier ist einfach nichts drinne.Das soll eine Kunstgalerie sein, ja ok.Krass moderne Kunst.Da habe ich jetzt mal eine Pflanze gesehen.Das sieht so steril aus.Ich meine, nur mal zur Erinnerung.Und die Battlefield 3-Maps waren definitiv kein Wunder der Detailverliebtheit.Das war aber damals auch schlicht und ergreifend, also erstens mal dem Gameplay geschuldet.Man wollte wahrscheinlich nicht zu viel reinstellen oder sonst wie.Aber das war gar nicht das Problem.Das Hauptproblem war wahrscheinlich eher, dass es eben auf der Xbox 360 sonst was wie laufen musste.Ich meine vergleicht mal Siebertower damit.Guck mal, der sieht wenigstens in irgendeiner Art und Weise nach Büro aus.Das ist auch sehr steril, klar.Aber das ist ein Xbox 360 Game.Aber das geht als Bürogebäude durch.Da hast du ein Klo.Da kannst du Peppupupu machen drauf.Du hast irgendwo einen Pool.Also klar, man sieht schon, der Style ist relativ ähnlich tatsächlich.Aber hier ist halt was da.Hier hast du diese Sonnenbänke und sowas, was auch immer die da machen.Da ist halt was da.Ja hier das Zeug, das sieht nach einem Gebäude aus.Das macht auch nicht wirklich Sinn.Das sieht halt nach einem Halbweg.Guckt euch das mal an.Hier steht mehr.Hier ist mehr drauf als in dem ganzen Korridor des gesamten Gebäudes in BF2042.Und das ist ein Xbox 360 Game.Den hat einfach die Zeit gefehlt.Muss ich jetzt einfach mal loswerden.Da muss noch sehr, sehr viel gemacht werden.Auch vieles im Kern nochmal überarbeitet werden.Es ist nicht nur Feintuning und Balancing, was da gemacht werden muss.Bellevue 3 Grafik ist zeitlos.Ja, das stimmt.Ja, schon ziemlich.Okay.Leute, ich glaube, ich gehe jetzt auf.Schon spät.Bedgetime.Liegt gerade, ob ich noch irgendjemand hosten soll.Witzig.Ein anderer Battlefield-Streamer, den ich ab und zu gucke, spielt wieder Battlefield 3.Null W.War ja klar.Keine Ahnung.Tauscht jetzt keinen.Also ich gehe ins Bett, Leute.Wir sehen uns.Bis denn.Macht's gut.Tschüss.", "segments": [{"id": 1, "start": 120.0, "end": 149.92, "text": "So, da bin ich, weil irgendwie passt mir mein Headset nicht mehr."}, {"id": 2, "start": 149.92, "end": 155.88, "text": "Ich vermute, mein Kopf ist größer geworden, am Headset kann das nicht liegen."}, {"id": 3, "start": 155.88, "end": 169.6, "text": "Seit gestern, zu hoher EQ durch die ganzen Prime-Subs."}, {"id": 4, "start": 169.6, "end": 186.32, "text": "Logic, danke für den Sub."}, {"id": 5, "start": 186.32, "end": 187.88, "text": "Pokers Overlay umstellen."}, {"id": 6, "start": 187.88, "end": 196.08, "text": "Chat, wie sieht es bei euch aus?"}, {"id": 7, "start": 196.08, "end": 205.32, "text": "Aus wem wurden schon die Dislikes auf YouTube deaktiviert?"}, {"id": 8, "start": 205.32, "end": 206.88, "text": "Also bei mir sind die Dislikes noch da."}, {"id": 9, "start": 206.88, "end": 214.48, "text": "Aber bei mir auf dem zweiten Rechner sind die Dislikes schon weg."}, {"id": 10, "start": 214.48, "end": 227.92, "text": "Weiß nicht, wie es bei euch aussieht."}, {"id": 11, "start": 227.92, "end": 228.92, "text": "Was sind es alle da?"}, {"id": 12, "start": 228.92, "end": 230.52, "text": "Was steht heute an?"}, {"id": 13, "start": 230.52, "end": 232.24, "text": "Das, was im Titel steht, nix."}, {"id": 14, "start": 232.24, "end": 237.48, "text": "Wir schwätzen ein bisschen, ich gucke mir ein paar Sachen an, wir gucken vielleicht"}, {"id": 15, "start": 237.48, "end": 238.48, "text": "ein paar Videos."}, {"id": 16, "start": 238.48, "end": 243.72, "text": "Wir gucken uns vielleicht GitHub Trends an und ich kaufe mir eine SSD, weil ich festgestellt"}, {"id": 17, "start": 243.72, "end": 244.72, "text": "habe."}, {"id": 18, "start": 244.72, "end": 250.52, "text": "Ich brauche noch eine Aufnahme-SSD, meine SSD ist fast voll."}, {"id": 19, "start": 250.52, "end": 258.36, "text": "Und ich habe keinen Bock, laufen die Sachen aufs Nass zu schieben, das dauert immer und"}, {"id": 20, "start": 258.36, "end": 260.16, "text": "ich will ja weiter aufnehmen, Capture."}, {"id": 21, "start": 260.16, "end": 268.16, "text": "Ich bräuchte mal so irgendwie, sagen wir mal 1-2TB am besten per USB, USB-C, gucken"}, {"id": 22, "start": 268.16, "end": 269.72, "text": "ob es da bei Amazon irgendwas gibt."}, {"id": 23, "start": 269.72, "end": 277.84, "text": "Von Kingfast, klingt nach irgendeinem AliExpress-Ding, sagte mal, was hatte ich mir noch mal bei"}, {"id": 24, "start": 277.84, "end": 282.04, "text": "AliExpress, nein nicht Alice Weidel, was hatte ich mir noch mal bei AliExpress bestellt"}, {"id": 25, "start": 282.04, "end": 283.04, "text": "das letzte Mal?"}, {"id": 26, "start": 283.04, "end": 285.28, "text": "Das ist nämlich immer noch nicht da."}, {"id": 27, "start": 285.28, "end": 288.76, "text": "Was habe ich da für ein Müll drin liegen?"}, {"id": 28, "start": 288.76, "end": 290.32, "text": "Ne, ne, ne, das ist es nicht."}, {"id": 29, "start": 290.32, "end": 293.16, "text": "Zack, ich muss mal kurz die VM starten."}, {"id": 30, "start": 293.16, "end": 296.12, "text": "Oder die VM, wie die coolen Leute das sagen."}, {"id": 31, "start": 296.12, "end": 299.84, "text": "Wir wissen ja, cool ausgesprochen ist alles, das ist viel geiler."}, {"id": 32, "start": 299.84, "end": 316.28, "text": "Es ist ja auch Jubantu anstatt Ubuntu und Java, ganz wichtig, Java, Java und Gyra und"}, {"id": 33, "start": 316.28, "end": 317.28, "text": "Shit."}, {"id": 34, "start": 317.28, "end": 329.2, "text": "Und Jif, genau."}, {"id": 35, "start": 329.2, "end": 336.88, "text": "Ja, ich gucke erstmal bei Amazon, es ist nicht gerade irgendwie Black Friday Stels oder sowas"}, {"id": 36, "start": 336.88, "end": 337.88, "text": "angesagt."}, {"id": 37, "start": 337.88, "end": 342.56, "text": "Ach ne, Early Black Friday Dienst, alter dieser Black Friday Kram, ne?"}, {"id": 38, "start": 342.56, "end": 346.08, "text": "Das geht mir so unglaublich auf den Sack."}, {"id": 39, "start": 346.08, "end": 350.56, "text": "Erstens ist das zum größten Teil, außer die Amazon eigenen Sachen, mega Chebat, wenn"}, {"id": 40, "start": 350.56, "end": 356.24, "text": "du bei Geist Stels guckst, bist du wirklich besser dran und, und das Schlimme ist, dass"}, {"id": 41, "start": 356.24, "end": 361.36, "text": "ja mittlerweile, es ist ja nicht nur einfach Black Friday und Cyber Monday oder sowas in"}, {"id": 42, "start": 361.36, "end": 367.6, "text": "der Richtung, es ist Early Black Friday, Black Friday, After Black Friday, Cyber Monday, Black"}, {"id": 43, "start": 367.6, "end": 375.52, "text": "Friday Week, Black Friday Month, was kommt denn als nächstes, Black Friday Quartal oder"}, {"id": 44, "start": 375.52, "end": 384.8, "text": "Black Friday Jahr, Black Friday Millennium, bald ist Dauer Black Friday, die, die übertreiben"}, {"id": 45, "start": 384.8, "end": 398.6, "text": "es total, ich gucke mal ob es irgendwelche SSDs gibt, so, erstmal kurz, mal schnell gucken,"}, {"id": 46, "start": 398.6, "end": 402.24, "text": "Storage kann man auch suchen, ach ne man kann ja hier oben, SSD suchen und dann Black Friday"}, {"id": 47, "start": 402.24, "end": 408.4, "text": "auswählen, hier, davon hab ich doch jetzt auch schon eine, die sind nicht schlecht,"}, {"id": 48, "start": 408.4, "end": 414.84, "text": "das einzige Problem was ich mit denen hab, ist, ich hab den einen, die überhitzen manchmal,"}, {"id": 49, "start": 414.84, "end": 418.68, "text": "weiß ich ob ihr die auch schon mal, ob irgendjemand von euch den Kram hat, ich hab das Gefühl"}, {"id": 50, "start": 418.68, "end": 423.12, "text": "die überhitzen manchmal, ja das hier ist Chebat im Leben kostet die normalerweise"}, {"id": 51, "start": 423.12, "end": 429.44, "text": "keine 200 Euro, wir gucken jetzt einfach mal, Portable SSD Geist Stels, aber lasst uns weiter"}, {"id": 52, "start": 429.44, "end": 434.84, "text": "gucken, nicht von Amazon, hier Chebaton, ja in rot, wobei mir das eigentlich vollkommen"}, {"id": 53, "start": 434.84, "end": 438.64, "text": "egal ist, ob die in rot ist oder in schwarz ist, was auch immer, hier ist er angeblich"}, {"id": 54, "start": 438.64, "end": 449.88, "text": "3,2 und hier ist er 1, 3,1 und wir wissen alle, USB 3,1 gibt es gar nicht mehr, alle"}, {"id": 55, "start": 449.88, "end": 457.24, "text": "die das schreiben sind zu dumm, die Genialität des USB Standards zu verstehen, es gibt kein"}, {"id": 56, "start": 457.24, "end": 462.68, "text": "USB 3,1 mehr, alles outdated, overrated, Chebaton, aber das ist tatsächlich relativ günstig,"}, {"id": 57, "start": 462.68, "end": 475.84, "text": "ja Amazon.de, klick mich, das scheint tatsächlich relativ günstig zu sein für 105 ok, eBay,"}, {"id": 58, "start": 475.84, "end": 487.48, "text": "bei Simbershop 2020 oder bei Mlwcomcom, das sind immer so super seriös klingende eBay-Namen,"}, {"id": 59, "start": 487.48, "end": 491.52, "text": "Preisentwicklung, wollen wir Preisentwicklung gucken, Preisentwicklung gucken, Preisentwicklung"}, {"id": 60, "start": 491.52, "end": 497.2, "text": "ist wuhu, so Amazon, da kommen wir bestellen, ich bestelle mir einfach, was hab ich eigentlich"}, {"id": 61, "start": 497.2, "end": 506.28, "text": "noch alles, 1TB, gibt es die auch mit 2TB, gibt es die auch mit 2TB, na gut 1TB reicht"}, {"id": 62, "start": 506.28, "end": 513.8, "text": "für Aufnahme, was hab ich denn da bei Amazon noch alles hier im Basket liegen, zeig mal"}, {"id": 63, "start": 513.8, "end": 518.04, "text": "her, oh das brauch ich noch, das hab ich mir das letzte Mal gar nicht bestellt und den"}, {"id": 64, "start": 518.04, "end": 523.0, "text": "brauch ich auch noch, den hab ich auch nicht bestellt, die hab ich bestellt, OKS, dann"}, {"id": 65, "start": 523.0, "end": 529.92, "text": "machen wir hier, Bro Case, warum brauch ich, was ist der Sinn für so ne SSD in den Case"}, {"id": 66, "start": 529.92, "end": 540.72, "text": "zu haben, ich mein die SSD an sich ist ja stabiler als das Case, wo ist der Sinn, man"}, {"id": 67, "start": 540.72, "end": 548.88, "text": "weiß es nicht, Fluxstells, ja beste, der Mini Fluxer, guck mal der ist er, der Mini Fluxer,"}, {"id": 68, "start": 548.88, "end": 558.52, "text": "guck mal, ein Anime Body Pillow, ja brauch ich unbedingt, gibt es sowas auf Amazon.de,"}, {"id": 69, "start": 558.52, "end": 567.68, "text": "wie heißt ein Body Pillow auf Deutsch Körper Kisten, nee, keine Ahnung, Anime Body Pillow,"}, {"id": 70, "start": 567.68, "end": 586.28, "text": "girl, oi oi oi, warum, warum hat die 6 Augen, oi oi oi, oi oi, wo ist der Sebaro wenn man"}, {"id": 71, "start": 586.28, "end": 606.52, "text": "den braucht, das war knapp, war kurz vor Toss, ja ja kurz vor Toss, so, ja kann vorkommen,"}, {"id": 72, "start": 606.52, "end": 612.64, "text": "muss man die wichtigen Sachen sich auf Amazon angucken, nein ich hab kein Anime Body Pillow,"}, {"id": 73, "start": 612.64, "end": 617.12, "text": "ich hab aber ein Seitenschläfer Kisten, wisst ihr warum, weil ich 37 bin und alt, wenn ich"}, {"id": 74, "start": 617.12, "end": 623.28, "text": "zufällig falsch liege tut mir der Rücken weh, so, hast du sinnvolle Ideen was zu programmieren,"}, {"id": 75, "start": 623.28, "end": 632.4, "text": "also was nützliches, ich hab ja für so eine Python API oder, ok Pains Jam, keine Ahnung,"}, {"id": 76, "start": 632.4, "end": 636.92, "text": "das muss ja schon ungefähr, muss ja schon ungefähr irgendwie so ne Richtung haben,"}, {"id": 77, "start": 636.92, "end": 645.12, "text": "ich hab viele sinnvolle Ideen was man programmieren könnte ja, aber nix jetzt so was dich vielleicht"}, {"id": 78, "start": 645.12, "end": 657.44, "text": "interessiert, du könntest beispielsweise einen Python zu Battlefield Portal XML Converter"}, {"id": 79, "start": 657.44, "end": 676.32, "text": "programmieren, es gibt hier ne Menge sinnvolle Dinger, aber das dir gefällt weiß ich nicht,"}, {"id": 80, "start": 676.32, "end": 688.8, "text": "wahrscheinlich, sind Pork, also ich hab die T7 und ich hab das Gefühl die überhit, manchmal"}, {"id": 81, "start": 688.8, "end": 698.0, "text": "krieg ich nämlich ne Meldung hier, also Fehler schreiben, hab ich irgendwas überlesen, ich"}, {"id": 82, "start": 698.0, "end": 705.56, "text": "bilde mir an es gab noch irgendeine Frage, aber ich seh es jetzt nicht, lass uns heute"}, {"id": 83, "start": 705.56, "end": 717.0, "text": "nicht tippen, nee nee, nix, nix gesehen, das Alex hat überhaupt keine Frage, der postet"}, {"id": 84, "start": 717.0, "end": 728.48, "text": "irgendwas mit der Feuerwehr, ja das ist XML unter der Haube, ja ist es, aber das bringt"}, {"id": 85, "start": 728.48, "end": 743.52, "text": "dir ja nix, weil du kaum Stellen hast wo du den du was draus drehen kannst, gab doch"}, {"id": 86, "start": 743.52, "end": 765.4, "text": "keine Frage mehr, ich hab wieder Subscribers übersehen, ich bin verwirrt zu spät schon,"}, {"id": 87, "start": 765.4, "end": 781.12, "text": "vor neun Minuten, danke schön für den Sub, Pogu, so und irgendjemand hat gepostet, der"}, {"id": 88, "start": 781.12, "end": 786.68, "text": "hat seine Prüfung bestanden, aber ich find das nicht mehr, irgendwas mit Technik, Prüfung,"}, {"id": 89, "start": 786.68, "end": 790.64, "text": "ach hier, heute anderen Teil der Operative Professional Prüfung geschrieben, Mitarbeiter"}, {"id": 90, "start": 790.64, "end": 802.88, "text": "in Teamführung, Pains Cem, ja Operative Professional ist ja diese IHK Weiterbildung, wo ich mich"}, {"id": 91, "start": 802.88, "end": 806.32, "text": "immer frage ob das jemand macht, aber jetzt hab ich die Antwort, ja das macht anscheinend"}, {"id": 92, "start": 806.32, "end": 821.56, "text": "jemand, Blah oder Blah Blah, danke für den Sub, Massive Sixhead Subscription hier, ja"}, {"id": 93, "start": 821.56, "end": 830.64, "text": "nix, einfach gar nix, ich hab gedacht ich geh nochmal on, hast du Nasty Schneider mal"}, {"id": 94, "start": 830.64, "end": 834.4, "text": "für Battlefield Portal gemacht, immer, ich mach immer, bevor ich irgendwas mach, mach"}, {"id": 95, "start": 834.4, "end": 838.28, "text": "ich ein Strukturkram, auch wenn ich morgens aufstehe und aufs Klo muss, dann mach ich"}, {"id": 96, "start": 838.28, "end": 842.12, "text": "vorher ein Strukturkram, weil man weiß ja nie, was da alles passieren kann, wenn es"}, {"id": 97, "start": 842.12, "end": 846.28, "text": "nicht strukturiert ist, so ein Strukturkram wissen wir alle, ist natürlich ganz wichtig"}, {"id": 98, "start": 846.28, "end": 853.76, "text": "für so ein Ablauf, nee, haben wir nicht Pepo Shy, warum haben wir Pepo Shy nicht aktiviert,"}, {"id": 99, "start": 853.76, "end": 861.24, "text": "Moment das muss ich gleich mal nachholen, haben wir keinen Pepo Shy, Pepo Shy das ist"}, {"id": 100, "start": 861.24, "end": 867.56, "text": "ein, hab ich letztens erfahren, ich verfolge Valorant nicht so, es gibt ein Valorant Female"}, {"id": 101, "start": 867.56, "end": 897.2, "text": "Team, das Pepo Shy heißt, also jetzt ist Pepo Shy aktiviert, es ist ziemlich limitiert,"}, {"id": 102, "start": 897.2, "end": 902.04, "text": "man kann sich wirklich viel machen, so, also wie gesagt, ich hab nix großartig vor, natürlich"}, {"id": 103, "start": 902.04, "end": 907.16, "text": "hab ich mir ein paar Sachen überlegt, wo ich ein bisschen was drüber erzählen kann,"}, {"id": 104, "start": 907.16, "end": 913.16, "text": "denn hier, wie gesagt erstmal SSD einkaufen, haben wir jetzt gemacht, SSD und der Mini"}, {"id": 105, "start": 913.16, "end": 919.02, "text": "Fluxer, der wird jetzt abgestellt, Boss Removed, wunderbar, Marx gibt es eigentlich noch irgendwas"}, {"id": 106, "start": 919.02, "end": 927.28, "text": "Flashbares auf dem Markt, ja, die letzte Flashbare Steckdosenleiste, die ich kenne,"}, {"id": 107, "start": 927.28, "end": 945.62, "text": "ist die hier, die hab ich nämlich erst vor zwei Wochen gekauft und, Smart, muss man"}, {"id": 108, "start": 945.62, "end": 950.84, "text": "bestimmt Smart mit eingeben, die hier, die hab ich erst vor, aber die ist eigentlich"}, {"id": 109, "start": 950.84, "end": 954.28, "text": "zu teuer, aber die hab ich erst vor ein paar Wochen gekauft, die lässt sich noch Tasmota"}, {"id": 110, "start": 954.28, "end": 965.04, "text": "flashen, haben wir sogar hier live im Stream zusammen gemacht, Hammer, wann lohnt sich"}, {"id": 111, "start": 965.04, "end": 969.08, "text": "der Black Friday eigentlich, nur bei Amazon und eigenem Zeug, also wenn du zum Beispiel"}, {"id": 112, "start": 969.08, "end": 975.68, "text": "hier einen, sagen wir mal hier Black, wenn du irgendwie einen HD10 kaufen willst, dann"}, {"id": 113, "start": 975.68, "end": 980.2, "text": "ist das ganz sinnvoll, jetzt nicht, jetzt ist doof, aber es geht schon in die richtige"}, {"id": 114, "start": 980.2, "end": 986.44, "text": "Richtung, aber das muss noch billig werden, wenn das mal bei 89 ist oder so, dann kannst"}, {"id": 115, "start": 986.44, "end": 996.0, "text": "du es kaufen, am besten natürlich noch günstiger, also für Amazon eigene Sachen lohnt sich"}, {"id": 116, "start": 996.0, "end": 1000.36, "text": "das und ich finde, Amazon eigene Sachen, gibt es eigentlich nur Tablets, die sich lohnen,"}, {"id": 117, "start": 1000.36, "end": 1005.96, "text": "vor allem wenn man sie danach deploatet und den ganzen Amazon-Campel wieder runterschmeißt,"}, {"id": 118, "start": 1005.96, "end": 1010.48, "text": "Fire TV Sticks, wenn man's will, kann man sich kaufen, finde ich jetzt aber persönlich"}, {"id": 119, "start": 1010.48, "end": 1013.96, "text": "nicht so geil, die Tablets sind eigentlich das einzige, was sich lohnt und die Tablets"}, {"id": 120, "start": 1013.96, "end": 1022.48, "text": "dann halt auch wie gesagt nur deploatet und zwar nur deploatet mit dem Fire Toolbox oder"}, {"id": 121, "start": 1022.48, "end": 1028.56, "text": "wie dieses Ding heißt, Fire Toolbox, einfach deploatet, oh mittlerweile ist das rot, ist"}, {"id": 122, "start": 1028.56, "end": 1034.2, "text": "auch neu, ich weiß, ich hab bis heute nicht verstanden, warum dieser Typ so eine ultra"}, {"id": 123, "start": 1034.2, "end": 1041.36, "text": "hässliche PowerShell Konsolen GUI gemacht hat, anstatt irgendwie was halbwegs ansehnliches,"}, {"id": 124, "start": 1041.36, "end": 1045.96, "text": "aber wahrscheinlich kann das nicht besser und ich will mich jetzt auch nicht beschweren,"}, {"id": 125, "start": 1045.96, "end": 1055.24, "text": "dass der den Kram hier quasi schon irgendwie drei Jahre maintained. Man kann das auch"}, {"id": 126, "start": 1055.24, "end": 1058.16, "text": "manuell machen, ja, aber dann musst du den ganzen Scheiß raussuchen, da hab ich kein"}, {"id": 127, "start": 1058.16, "end": 1059.16, "text": "Bock drauf."}, {"id": 128, "start": 1059.16, "end": 1080.2, "text": "Gibt's das auch für Linux, nee, wenn du Linux hast, musst du dir selbst raussuchen,"}, {"id": 129, "start": 1080.2, "end": 1084.0, "text": "wobei ich mir nicht sicher bin, ob es da was gibt, musst du dir mal bei XDA gucken, dann"}, {"id": 130, "start": 1084.0, "end": 1090.52, "text": "geht das. Kannste über Wine ausführen, ich weiß nicht, wie sieht das mit Wine und USB"}, {"id": 131, "start": 1090.52, "end": 1095.52, "text": "Zugriff aus, wenn USB über Wine funktioniert, dann geht das höchstwahrscheinlich auch über"}, {"id": 132, "start": 1095.52, "end": 1113.0, "text": "Wine, ja. Doom Swap, danke für den Sub. Keine Ahnung, wie das ist. Habt ihr alle schon"}, {"id": 133, "start": 1113.0, "end": 1120.2, "text": "mal ein neues Video geguckt? Wenn nicht, muss ich jetzt ein bisschen Werbung machen für"}, {"id": 134, "start": 1120.2, "end": 1124.96, "text": "mein neues Video, ihr könnt euch jetzt mein neues Video angucken nach dem Stream. Wir"}, {"id": 135, "start": 1124.96, "end": 1130.4, "text": "haben im Prinzip das gemacht, was ich gestern, vorgestern, gestern, was ich gestern im Stream"}, {"id": 136, "start": 1130.4, "end": 1138.04, "text": "gemacht hab, nur etwas anders. Wir haben beispielsweise noch eine Nuke eingebaut und manche Sachen"}, {"id": 137, "start": 1138.04, "end": 1144.84, "text": "anders gemacht als gestern im Stream. Ihr findet ja eigentlich den neuen Thumbnail Style,"}, {"id": 138, "start": 1144.84, "end": 1150.72, "text": "da hab ich ja hier so mit angefangen, so quasi, so ab hier hab ich ungefähr damit angefangen."}, {"id": 139, "start": 1150.72, "end": 1163.24, "text": "Ich bin halt, ich kann sowas eigentlich nicht, aber nachdem Thumbnail Gestalter so unglaublichst"}, {"id": 140, "start": 1163.24, "end": 1167.36, "text": "unzuverlässig sind, ich wart schon wieder seit drei Wochen oder so, bis sich da irgendwelche"}, {"id": 141, "start": 1167.36, "end": 1174.16, "text": "Leute melden. Ob trotz Nachfragen, es ist echter Wahnsinn. Also, die kreativen Leute"}, {"id": 142, "start": 1174.16, "end": 1185.6, "text": "sind so kreativ, dass sie es nicht schaffen sich zu melden. Ja, aber ich hab's dann geändert."}, {"id": 143, "start": 1185.6, "end": 1202.36, "text": "Das kriegen die Leute schon raus. Wirklich? Naja, soll mir recht sein. Es gibt halt kaum"}, {"id": 144, "start": 1202.36, "end": 1210.48, "text": "gescheite Leute, die sowas machen, ich weiß nicht. Was ist eigentlich aus den Leuten"}, {"id": 145, "start": 1210.48, "end": 1215.68, "text": "geworden, die Battlefield? Oh, hör mal auf. Alter, hör mal auf. Der erste hat sich irgendwie"}, {"id": 146, "start": 1215.68, "end": 1220.2, "text": "nach einer Woche gemeldet, er ist jetzt im Krankenhaus. Gut, kann er nix für. Ich glaube,"}, {"id": 147, "start": 1220.2, "end": 1225.0, "text": "der ist ganz gut, mit dem würde ich auch weiter was machen. Dann hat sich noch einer gemeldet,"}, {"id": 148, "start": 1225.0, "end": 1229.16, "text": "der hat dann auch was zusammengeschnitten, aber das hat mir überhaupt nicht gefallen."}, {"id": 149, "start": 1229.16, "end": 1237.88, "text": "Das war wirklich nicht so das, was ich mir irgendwie vorgestellt hab. Der hat zwar ein"}, {"id": 150, "start": 1237.88, "end": 1248.72, "text": "paar lustige Sachen rausgesucht aus den Streams, aber im Prinzip war da nichts wirklich großartig"}, {"id": 151, "start": 1248.72, "end": 1259.8, "text": "dabei. Dabei hatten wir wirklich coole Sachen im Stream. Wann kommt eigentlich Halo raus?"}, {"id": 152, "start": 1259.8, "end": 1268.56, "text": "Das muss doch jetzt auch irgendwann sein. Könnte mich mit meinem Outtakes-Video hier,"}, {"id": 153, "start": 1268.56, "end": 1274.4, "text": "wie gesagt, ich brauch immer Leute, die Stream-Highlights und so schneiden. Wirklich, du musst das"}, {"id": 154, "start": 1274.4, "end": 1280.72, "text": "noch nicht mal umsonst machen. Das muss halt gut sein. Es muss jetzt hier irgendwie nicht"}, {"id": 155, "start": 1280.72, "end": 1289.36, "text": "super krass Effekte und Bild in Bild und sonst was, aber das muss halt schon feinfühlig"}, {"id": 156, "start": 1289.36, "end": 1293.88, "text": "gemacht sein. Es bringt jetzt nichts da, wie beispielsweise in einem Video, dass man einfach"}, {"id": 157, "start": 1293.88, "end": 1297.4, "text": "irgendwie drei Tode nimmt, die zusammenschneidet und dann irgendwie einen Meme drüberlegt"}, {"id": 158, "start": 1297.4, "end": 1305.28, "text": "oder so. Dubstep. Also wenn du das machen willst, ohne Scheiß, dann schreibst du entweder"}, {"id": 159, "start": 1305.28, "end": 1311.6, "text": "im Discord nochmal oder schreib mir an die Business-Mail, die auf meinem Channel steht"}, {"id": 160, "start": 1311.6, "end": 1316.16, "text": "und sag mir, was du haben willst, so für was weiß ich pro Arbeitsstunde oder pro Video"}, {"id": 161, "start": 1316.16, "end": 1329.12, "text": "oder so ungefähr. Das muss ja nicht konkret sein. Rick Stonks. Was? Wait a minute, ist"}, {"id": 162, "start": 1329.12, "end": 1344.72, "text": "das gerade eben rausgekommen oder? Nee. Was? Nee, das kommt am 8. Dezember. Hä? Ah, der"}, {"id": 163, "start": 1344.72, "end": 1360.88, "text": "Multiplayer-Teil. Ach, heute ist ja Xbox-Jubiläum. Stimmt. Ach, ernsthaft? Twitch? Halo? Wirklich?"}, {"id": 164, "start": 1360.88, "end": 1371.8, "text": "Tatsächlich. Moment, Moment. Ach, das ist der Channel-Halo, man. Ich hab's nicht gecheckt."}, {"id": 165, "start": 1371.8, "end": 1378.36, "text": "Ich muss auf Halo Infinite, so rum. Halo Infinite ist da. Kann ich das Ganze auch vielleicht"}, {"id": 166, "start": 1378.36, "end": 1383.32, "text": "Zuschauer viel wenig und wie kann ich denn hier Kanäle auf Deutsch rausmachen? Geht"}, {"id": 167, "start": 1383.32, "end": 1388.88, "text": "das? Ich will keine deutschen Kanäle angezeigt kriegen. Nee, das geht anscheinend nicht."}, {"id": 168, "start": 1388.88, "end": 1401.24, "text": "Tatsächlich. Das ist ja interessant, dass das raus ist. Dann werden sich sicherlich"}, {"id": 169, "start": 1401.24, "end": 1409.12, "text": "viele freuen. Spannend. Hätte ich gar nicht gedacht. So, das heißt, das ist... Ich meine,"}, {"id": 170, "start": 1409.12, "end": 1413.36, "text": "ich hab die Berichterstattung im Vorfeld ein bisschen verfolgt und ich hab da so rausgehört,"}, {"id": 171, "start": 1413.36, "end": 1418.08, "text": "dass viele Leute gesagt haben, ja, es macht es ein bisschen anders. Es ist auch im Kern"}, {"id": 172, "start": 1418.08, "end": 1423.4, "text": "der klassische Halo-Multiplay, aber es macht es ein bisschen anders. Halt, dass es eben"}, {"id": 173, "start": 1423.4, "end": 1427.56, "text": "halt auch längerfristig monetarisierbar ist und sowas. Also ich bin da wirklich mal gespannt"}, {"id": 174, "start": 1427.56, "end": 1446.6, "text": "drauf, ob das klappt. Ja. Und wo kriegt man das? Im Store? Ach komm. Please, gibt's"}, {"id": 175, "start": 1446.6, "end": 1452.24, "text": "das nicht auf Steam? Steam, Halo, Infinite? Gibt's das auf... Ach, das gibt's auch auf"}, {"id": 176, "start": 1452.24, "end": 1467.0, "text": "Steam. Nice, sehr gut. Die Beta, aha. Die Kampagne kommt am 8. Dezember. Sag mal, wenn"}, {"id": 177, "start": 1467.0, "end": 1475.0, "text": "ich die Story schon wieder lese... Ich weiß, das Spiel heißt Halo, aber ist es nicht irgendwie"}, {"id": 178, "start": 1475.0, "end": 1480.44, "text": "merkwürdig, dass in jedem oder in fast jedem, es ist ja nicht in jedem, in fast jedem Halo"}, {"id": 179, "start": 1480.44, "end": 1485.56, "text": "zufälligerweise irgendwie wieder ein Halo-Ring auftaucht? So, da ist er ja. Wo kommt er"}, {"id": 180, "start": 1485.56, "end": 1489.28, "text": "dann auf einmal her? Wir wussten gar nicht, dass es den noch gibt, aber diesmal ist es"}, {"id": 181, "start": 1489.28, "end": 1494.32, "text": "der allerletzte Halo-Ring und der ist ganz wichtig und sowas in der Richtung. Nächster"}, {"id": 182, "start": 1494.32, "end": 1501.4, "text": "Singleplayer, hoch. Da ist ja noch ein Halo-Ring. Wo kommt der wieder her? Das ist der wichtigste"}, {"id": 183, "start": 1501.4, "end": 1508.36, "text": "jetzt, ja. Das ist noch wichtiger als die letzten fünf. Wobei man sagen muss, das ist"}, {"id": 184, "start": 1508.36, "end": 1512.48, "text": "tatsächlich nicht wirklich... Das ist nicht immer so. Halo 5 hatte, glaube ich, keinen"}, {"id": 185, "start": 1512.48, "end": 1519.04, "text": "neuen Halo-Ring. Halo 5 war ja Cortana, dreht durch. Irgendwie sowas in der Richtung, wenn"}, {"id": 186, "start": 1519.04, "end": 1526.48, "text": "ich es noch in der richtigen Erinnerung habe. Halo 4, kann ich mich gar nicht mehr dran"}, {"id": 187, "start": 1526.48, "end": 1538.0, "text": "erinnern, wenn ich bin so richtig... Ach, keine Ahnung. Guck mal, noch keine Steam-Reviews."}, {"id": 188, "start": 1538.0, "end": 1544.04, "text": "Normalerweise gibt es Steam-Reviews immer. Meistens schon direkt zu Release und dann"}, {"id": 189, "start": 1544.04, "end": 1552.72, "text": "sowas sinnloses wie Cortana Big Boops Best Game Ever oder sowas. Das sind typisch die"}, {"id": 190, "start": 1552.72, "end": 1561.64, "text": "typischsten sinnlosen Steam-Reviews. Hast du noch eine kleine Review zu Belfilm an Vorrelease?"}, {"id": 191, "start": 1561.64, "end": 1566.64, "text": "Ja. Ich weiß nicht, ob du das Video von heute geguckt hast, nämlich das da. Da sage ich"}, {"id": 192, "start": 1566.64, "end": 1574.52, "text": "genau das. Das sage ich nämlich. Achtung, ich zitiere mich selbst. Wir müssen das nicht"}, {"id": 193, "start": 1574.52, "end": 1580.48, "text": "lang aushalten. Ich habe in Battlefield Portal fast mehr Spaß als in Battlefield 2042 selber."}, {"id": 194, "start": 1580.48, "end": 1585.12, "text": "Die eingebauten Classic-Sachen in Portal selbst sind ja schon ganz nice. Aber richtig Spaß,"}, {"id": 195, "start": 1585.12, "end": 1589.72, "text": "ich fand ich das selbst, ich nenne es mal Programmieren von eigenen Spielmodi. Deshalb"}, {"id": 196, "start": 1589.72, "end": 1593.4, "text": "bauen wir heute mal oder nennen wir es mal Programmieren oder Skripten. Es ist schwierig"}, {"id": 197, "start": 1593.4, "end": 1598.44, "text": "zu sagen, wie ich es genau nennen soll. Wir bauen heute zusammen Nosher Canals TDM mit"}, {"id": 198, "start": 1598.44, "end": 1605.64, "text": "Killstreaks. So richtig mit ULV, einer Nuke am Ende, einem Blackbird, Sentry Gun, so was"}, {"id": 199, "start": 1605.64, "end": 1609.76, "text": "man sich so unter Killstreaks vorstellt. Natürlich ist Portal noch ein bisschen limitiert. Das"}, {"id": 200, "start": 1609.76, "end": 1614.4, "text": "heißt, wir müssen manchmal ein bisschen tricksen. Aber am Ende bekommt ihr auch noch den Code,"}, {"id": 201, "start": 1614.4, "end": 1617.36, "text": "dass ihr das alle mal ausprobieren könnt. Und würde mich mal interessieren, könnt"}, {"id": 202, "start": 1617.36, "end": 1620.64, "text": "ihr die Kommentare schreiben, was ihr jetzt von dem Spielmodus haltet, den wir hier zusammen"}, {"id": 203, "start": 1620.64, "end": 1626.2, "text": "gebaut haben. Und nächste Woche zum richtigen Release des Games kommt dann mein komplettes"}, {"id": 204, "start": 1626.2, "end": 1630.4, "text": "Review oder Fazit zu dem Game. Das heißt, wenn ihr es nicht verpassen wollt, dann drückt"}, {"id": 205, "start": 1630.4, "end": 1633.36, "text": "jetzt einfach mal den Abo-Button und ich würde sagen, los geht's."}, {"id": 206, "start": 1633.36, "end": 1635.76, "text": "Exzellent. Das könnt ihr übrigens auch auf Twitch machen, wenn ihr jetzt gerade frisch"}, {"id": 207, "start": 1635.76, "end": 1640.0, "text": "hier seid. Da muss es nicht unbedingt der Subscribe-Button sein, der Follow-Button reicht natürlich"}, {"id": 208, "start": 1640.0, "end": 1647.12, "text": "auch erstmal. Aber so sieht es aus. Ich habe das so geplant, dass ich quasi zum 19. oder"}, {"id": 209, "start": 1647.12, "end": 1655.12, "text": "vielleicht am 18. oder so schon, dass der Algorithmus das dann abpickt. Tolles Satz,"}, {"id": 210, "start": 1655.12, "end": 1666.48, "text": "dass ich das dann starte. Das Video. So, jetzt habe ich das auch beantwortet. Battlefield"}, {"id": 211, "start": 1666.48, "end": 1674.36, "text": "20. Insane sniping. Insane. Ja, wenn du insane snipen willst in 2042 musst du erstmal lernen,"}, {"id": 212, "start": 1674.36, "end": 1683.56, "text": "3km vorzuhalten und drüber zu halten. Willst du nur noch eine Woche arbeiten? Das ist ganz"}, {"id": 213, "start": 1683.56, "end": 1694.52, "text": "einfach zu erklären, denn, kurz runter scrollen, denn, genau, so sieht es aus, denn ich habe"}, {"id": 214, "start": 1694.52, "end": 1698.68, "text": "Urlaub eingetragen schon seit Anfang des Jahres für den kompletten Dezember und mir"}, {"id": 215, "start": 1698.68, "end": 1707.8, "text": "ist jetzt aufgefallen, dass ich ja noch 4 Tage Resturlaub habe. Das bedeutet, ich habe"}, {"id": 216, "start": 1707.8, "end": 1712.56, "text": "den Tag hier noch eingetragen und dann noch den hier eingetragen und hier nehme ich einen"}, {"id": 217, "start": 1712.56, "end": 1716.96, "text": "Tag Kleidzeit. Montag arbeite ich eh nicht. Ich arbeite hier nur 4 Tage in der Woche, genau"}, {"id": 218, "start": 1716.96, "end": 1722.76, "text": "und jetzt zack, bam, 19. ist der erste Urlaubstag. Also nein, das stimmt nicht, der letzte Arbeitstag."}, {"id": 219, "start": 1722.76, "end": 1729.76, "text": "Das heißt also quasi, ich muss jetzt noch 1, 2, 3, 4 Tage arbeiten und das beste ist,"}, {"id": 220, "start": 1729.76, "end": 1734.2, "text": "morgen muss ich wieder mit der Bahn fahren. Das heißt, wer bei mir auf Twitter am Start"}, {"id": 221, "start": 1734.2, "end": 1742.12, "text": "ist, der muss wahrscheinlich morgen wieder etwas Geflame ertragen. Und das blöde daran"}, {"id": 222, "start": 1742.12, "end": 1749.04, "text": "ist, dass man an diesem Tag eigentlich nichts macht. Ich weiß nicht, ob das Problem auch"}, {"id": 223, "start": 1749.04, "end": 1753.28, "text": "irgendjemand hat, der im vergangenen Jahr oder die vergangenen eineinhalb Jahre hauptsächlich"}, {"id": 224, "start": 1753.28, "end": 1760.36, "text": "Homeoffice gearbeitet hat, aber ich finde, der Unterschied von Homeoffice arbeiten zu"}, {"id": 225, "start": 1760.36, "end": 1768.76, "text": "man ist vor Ort ist einfach riesengroß. Ich meine, daheim hast du erstmal die ganze"}, {"id": 226, "start": 1768.76, "end": 1773.0, "text": "Hin- und Zurückfahrt nicht. Das ist glaube ich jedem klar. Du bist auch, wenn du fertig"}, {"id": 227, "start": 1773.0, "end": 1776.6, "text": "bist, bist du fertig. Das ist aber so, du musst dich nicht mit der Bahn umschneiden,"}, {"id": 228, "start": 1776.6, "end": 1782.84, "text": "das hat alles Vorteile. Aber selbst, wenn du vor Ort bist, im Prinzip ist es nur sinnloses"}, {"id": 229, "start": 1782.84, "end": 1789.04, "text": "Gemiete, sinnloses Geschwätze. Man schwätzt ja nicht mal übermäßig viel, aber du kannst"}, {"id": 230, "start": 1789.04, "end": 1791.88, "text": "dich auch nicht richtig konzentrieren, wenn du irgendwas bauen musst. Aber man sich ja"}, {"id": 231, "start": 1791.88, "end": 1797.56, "text": "gedacht hat, oh ja, ja ja, für Programmierer sind, also Großotter, ich arbeite ja eigentlich"}, {"id": 232, "start": 1797.56, "end": 1800.92, "text": "nicht direkt in der Softwareentwicklung, ich mache auch noch andere Sachen, aber trotzdem,"}, {"id": 233, "start": 1800.92, "end": 1804.12, "text": "also da muss man sich nicht konzentrieren. Großraumbüros sind eine super Geschichte"}, {"id": 234, "start": 1804.12, "end": 1810.36, "text": "und das ist natürlich ganz besonders konzentrationsfördernd, wenn jemand im Raum sitzt, der laut telefoniert."}, {"id": 235, "start": 1810.36, "end": 1819.44, "text": "Wer kennt es nicht? Und im Prinzip besteht bei mir der Dienstag aus, meeten, meeten, dann"}, {"id": 236, "start": 1819.44, "end": 1822.8, "text": "sagt dann irgendwer, ach ja Max, bist du auch mal wieder da, ja wie sieht es denn hier aus,"}, {"id": 237, "start": 1822.8, "end": 1826.84, "text": "bla bla bla bla bla, so nächstes Meeting, dann gehe ich irgendwo hin, was fragen, dann"}, {"id": 238, "start": 1826.84, "end": 1831.2, "text": "erzählt er mir 20 Minuten was, im Prinzip mache ich Dienstag den ganzen Tag eigentlich"}, {"id": 239, "start": 1831.2, "end": 1840.28, "text": "nichts und ich frage mich allen Ernstes, wie ich das früher geschafft habe, mit 4 Tagen"}, {"id": 240, "start": 1840.28, "end": 1846.08, "text": "im Büro dort überhaupt was zu machen und ich glaube, realistisch betrachtet ist es"}, {"id": 241, "start": 1846.08, "end": 1853.44, "text": "auch so, dass ich da zum größten Teil wahrscheinlich auch nicht wirklich viel gemacht habe. Das"}, {"id": 242, "start": 1853.44, "end": 1857.44, "text": "ist mit Homeoffice einfach viel viel besser, du kriegst auch viel mehr durch, die dich"}, {"id": 243, "start": 1857.44, "end": 1875.64, "text": "nerven weniger Leute, das ist eigentlich super, naja, ja das kommt ja auch noch dazu, du sparst"}, {"id": 244, "start": 1875.64, "end": 1881.0, "text": "dir halt die Fahrzeit, deswegen kannst du zu normalen Zeiten aufstehen und trotzdem halt"}, {"id": 245, "start": 1881.0, "end": 1891.36, "text": "auch relativ früh anfangen, ja geht mir genauso, Daily 4 Stunden Streams, na nee so viel nicht,"}, {"id": 246, "start": 1891.36, "end": 1896.88, "text": "aber ich mache auf jeden Fall mehr Streams dann, aber das finde ich spannend, dass das"}, {"id": 247, "start": 1896.88, "end": 1904.72, "text": "aktuelle Halo schon raus ist, spoiler Leute, hat irgendjemand von euch noch die Story von"}, {"id": 248, "start": 1904.72, "end": 1912.28, "text": "Halo 5 im Kopf, ist Cortana eigentlich wieder gefixt und wieder mit am Start jetzt, weil"}, {"id": 249, "start": 1912.28, "end": 1922.76, "text": "Cortana ist das beste an Halo, ich hab die Story nicht mehr im Kopf, keine Runde Cringe,"}, {"id": 250, "start": 1922.76, "end": 1930.76, "text": "nein, keine Runde Cringe, das ist spannend, ich werde das mal Offstream ausprobieren,"}, {"id": 251, "start": 1930.76, "end": 1941.96, "text": "ich bin beim besten Willen kein guter Halo Spieler, dann hat es ja trotzdem für dich"}, {"id": 252, "start": 1941.96, "end": 1951.8, "text": "Vorteile, Halo ist aber auch nicht mehr das was es war von der Magnet Wirkung, denkt mal"}, {"id": 253, "start": 1951.8, "end": 1958.56, "text": "zurück an Halo 3, Halo 3 war jahrelang auf der Xbox einfach so das Multiplayer Ding,"}, {"id": 254, "start": 1958.56, "end": 1964.52, "text": "neben Cod und ein bisschen später dann Battlefield, aber nach Halo 3 kam nichts mehr, ich glaube"}, {"id": 255, "start": 1964.52, "end": 1971.08, "text": "nach Halo 3 haben die nicht sogar, nee Reach war das letzte von Bungie, war Halo Reach"}, {"id": 256, "start": 1971.08, "end": 1986.24, "text": "noch von Bungie, ja Halo Reach war glaube ich das letzte Bungie Spiel, richtig genau,"}, {"id": 257, "start": 1986.24, "end": 1992.88, "text": "selbst da ging es schon ein bisschen abwärts, auch mit dem Spieler Interesse, also entweder"}, {"id": 258, "start": 1992.88, "end": 1998.6, "text": "liegt es daran, dass das Halo Spielprinzip außer Mode gekommen ist oder auch ein bisschen"}, {"id": 259, "start": 1998.6, "end": 2003.48, "text": "mit daran, dass Halo eben so diesen Glanz verloren hat der etwas früheren Tage, Halo"}, {"id": 260, "start": 2003.48, "end": 2008.68, "text": "3 war das letzte richtig große Halo wo die richtig die Massen noch hinterher geschrien"}, {"id": 261, "start": 2008.68, "end": 2021.48, "text": "haben, so nice Halo, es ist quasi Not Stonks gewesen, übrigens was ich vorhin gelesen habe,"}, {"id": 262, "start": 2021.48, "end": 2029.64, "text": "was ich auch witzig fand ist, was ich auch lustig fand, dass jetzt wieder überlegt wird"}, {"id": 263, "start": 2029.64, "end": 2036.6, "text": "Home Office Pflicht soll zurückkommen, das ist so geil, da werden Sachen abgeschafft"}, {"id": 264, "start": 2036.6, "end": 2041.68, "text": "und 3 Monate später stellt man dann fest, hoch, wer hätte nur damit rechnen können,"}, {"id": 265, "start": 2041.68, "end": 2046.24, "text": "es ist jetzt Winter, das wusste man gar nicht, wie bei der Bahn, da kommt das auch jedes"}, {"id": 266, "start": 2046.24, "end": 2053.72, "text": "Jahr komplett überraschend, dass es jetzt kalt wird, so was, es ist September, November,"}, {"id": 267, "start": 2053.72, "end": 2058.48, "text": "Dezember, da wird es ja kalt, nee das kann eigentlich, das kommt jetzt, das kommt doch"}, {"id": 268, "start": 2058.48, "end": 2065.64, "text": "nie vor, so Impfzentren zu gemacht, jetzt werden sie wieder aufgemacht, WTF, so als"}, {"id": 269, "start": 2065.64, "end": 2069.92, "text": "könnte man das, als könnte man das alles nicht im Vorfeld überlegen, die 4 Feinde"}, {"id": 270, "start": 2069.92, "end": 2080.28, "text": "der deutschen Bahn, Frühling, Sommer, Herbst und Winter, ja das finde ich lustig und das"}, {"id": 271, "start": 2080.28, "end": 2085.92, "text": "hier fand ich auch witzig, wo ich die Überschrift heute gelesen habe, Profitgier der Filmindustrie"}, {"id": 272, "start": 2085.92, "end": 2090.48, "text": "stärkt illegale Kopierszene und wisst ihr was ich mir dabei gedacht habe, das erste"}, {"id": 273, "start": 2090.48, "end": 2097.0, "text": "was ich mir dabei gedacht habe ist, die lernen es einfach nicht, die, die, die, die können,"}, {"id": 274, "start": 2097.0, "end": 2104.56, "text": "ich verstehe es nicht, die lernen es einfach nicht, mein Battlefield 2042 Server ist down,"}, {"id": 275, "start": 2104.56, "end": 2110.68, "text": "ich habe überhaupt kein Battlefield 2042 Server, der abseilen sein sollte, wie kann"}, {"id": 276, "start": 2110.68, "end": 2115.24, "text": "der down sein, ich habe noch nicht mal einen gestartet, du kannst mit dem Code einen hosten,"}, {"id": 277, "start": 2115.24, "end": 2118.24, "text": "wenn du willst, glaube ich, ich habe keine Ahnung wie diese Codes funktionieren, ich"}, {"id": 278, "start": 2118.24, "end": 2127.92, "text": "habe den einfach mal drunter gehauen, aber hier, die lernen es einfach nicht, ich meine,"}, {"id": 279, "start": 2127.92, "end": 2132.16, "text": "die meisten Leute von euch werden nicht am Start gewesen sein, sagt euch Napster noch"}, {"id": 280, "start": 2132.16, "end": 2136.4, "text": "was, ich glaube den Namen kennt man heute noch, aber wirklich dabei waren wahrscheinlich die"}, {"id": 281, "start": 2136.4, "end": 2146.88, "text": "wenigsten, Napster, gibt es die überhaupt noch, Napster, gibt es die noch, hey das Logo"}, {"id": 282, "start": 2146.88, "end": 2154.32, "text": "ist noch gleich geblieben, aber sonst, war Napster illegal, aber sowas schon, Napster"}, {"id": 283, "start": 2154.32, "end": 2171.76, "text": "wird illegal, äh nein, nein, nein, Aldi, lul, alter, das ursprüngliche Napster kennen"}, {"id": 284, "start": 2171.76, "end": 2180.96, "text": "die wenigsten wahrscheinlich, das war eines der ersten Musik P2P Tauschbörsen und das"}, {"id": 285, "start": 2180.96, "end": 2190.0, "text": "war die Zeit, wo die Musikindustrie damals noch gesagt hat, Streaming, das ist ja hier"}, {"id": 286, "start": 2190.0, "end": 2197.72, "text": "böse, da entgehen uns, weil die haben ja gesagt, jeder Download wäre ein verpasster CD-Kauf,"}, {"id": 287, "start": 2197.72, "end": 2202.28, "text": "was ja Schwachsinn ist und die Leute haben gesagt, Musikindustrie, ich will daheim sitzen,"}, {"id": 288, "start": 2202.28, "end": 2206.88, "text": "auf den Knopf drücken und vorne meinem Rechner den Kram abspielen und die Musikindustrie"}, {"id": 289, "start": 2206.88, "end": 2212.4, "text": "hat gesagt, nein, nein, nein, nein, wir wissen das besser als ihr, ihr wollt das nicht,"}, {"id": 290, "start": 2212.4, "end": 2219.56, "text": "ihr sollt gefällig CD's kaufen und die Leute haben gesagt, nein, ich will keine CD's kaufen,"}, {"id": 291, "start": 2219.56, "end": 2223.72, "text": "ich will den Scheiß streamen und wenn ich das nicht bei euch kriege, zu irgendwie dem"}, {"id": 292, "start": 2223.72, "end": 2229.48, "text": "normalen Preis und zu normalen Release-Zeiten weltweit, dann geh ich zu Napster und hol mir"}, {"id": 293, "start": 2229.48, "end": 2230.48, "text": "den Scheiß illegal."}, {"id": 294, "start": 2230.48, "end": 2239.56, "text": "So, und das gleiche passiert jetzt hier auch, das kann man immer schön sehen, wenn ein"}, {"id": 295, "start": 2239.56, "end": 2245.6, "text": "gewisses Level überschritten ist, was quasi bei den Leuten nicht mehr verhältnismäßig"}, {"id": 296, "start": 2245.6, "end": 2249.56, "text": "ist im Kopf, dann gehen sie illegal hin, wir haben in den letzten Jahren einen kompletten"}, {"id": 297, "start": 2249.56, "end": 2251.28, "text": "Rückgang davon gesehen, ja."}, {"id": 298, "start": 2251.28, "end": 2257.64, "text": "Die Leute machen jetzt Spotify, seht ihr, kaum gibt es irgendwie sinnvolle Angebote zu sinnvollen"}, {"id": 299, "start": 2257.64, "end": 2261.88, "text": "Preisen, wo genug Auswahl an Titeln drin ist, schon machen es die Leute, wer hätte das"}, {"id": 300, "start": 2261.88, "end": 2262.88, "text": "so denken können."}, {"id": 301, "start": 2262.88, "end": 2266.64, "text": "Es gab zeitlang Streaming-Dienste, du hast eins, zwei Streaming-Dienste gebraucht, konntest"}, {"id": 302, "start": 2266.64, "end": 2271.44, "text": "dir den meisten Scheiß angucken, so, heute wurden 150 Streaming-Dienste für, keine Ahnung,"}, {"id": 303, "start": 2271.44, "end": 2276.96, "text": "du brauchst 70 für Musik, 70 für Videos und nochmal zehn, falls du irgendwas lesen willst,"}, {"id": 304, "start": 2276.96, "end": 2280.88, "text": "irgendwelche Abos und Streaming-Dienste, dann sagen die Leute, wisst ihr was, dann kommen"}, {"id": 305, "start": 2280.88, "end": 2284.6, "text": "sie, dann fangen sie ja mittlerweile wieder mit dem Scheiß an, so nach dem Motto, ah nee,"}, {"id": 306, "start": 2284.6, "end": 2288.36, "text": "das kommt jetzt in dem Land zuerst raus, in dem Land kommt es später raus, ach nee, hier"}, {"id": 307, "start": 2288.36, "end": 2292.32, "text": "gibt es wieder keine Untertitel, ach nee, hier gibt es eine Originalsprache und da sagen"}, {"id": 308, "start": 2292.32, "end": 2298.12, "text": "die Leute einfach, fickt euch, ich lag mir den Kram irgendwo runter, das ist immer das"}, {"id": 309, "start": 2298.12, "end": 2302.52, "text": "gleiche und die lernen es einfach nicht und was ich, was ich ja besonders witzig fand"}, {"id": 310, "start": 2302.52, "end": 2317.96, "text": "zur damaligen Zeit, ich weiß nicht, ob ihr das kennt, Mama, wo ist Papa, äh Kopierschutz,"}, {"id": 311, "start": 2317.96, "end": 2338.24, "text": "ja ich weiß nicht, was ich suchen soll, Raubkopierer Werbung, das hier, das hier, so, damals haben"}, {"id": 312, "start": 2338.24, "end": 2342.96, "text": "die sich eher gedacht, hey, wisst ihr was, bevor wir den Leuten irgendwie mal einen ordentlichen"}, {"id": 313, "start": 2342.96, "end": 2351.12, "text": "Streaming-Surfer geben, machen wir so eine Scheiße hier, ich kriege Anfälle, wenn Kinder"}, {"id": 314, "start": 2351.12, "end": 2364.52, "text": "rumschreien, deswegen, ich muss das mal ein bisschen leiser machen, sonst bin ich triggert,"}, {"id": 315, "start": 2364.52, "end": 2377.2, "text": "das hätte ich auch nicht lizenziert, vor allem gerecht, wer entscheidet, das hat mich"}, {"id": 316, "start": 2377.2, "end": 2381.48, "text": "damals schon immer getriggert, wer entscheidet mit euch gerecht, meinen die ernsthaft im"}, {"id": 317, "start": 2381.48, "end": 2387.2, "text": "Gerechtigkeitsgefühl 99% der Leute, ist es gerecht, dass jemand für das Kopieren von"}, {"id": 318, "start": 2387.2, "end": 2407.24, "text": "CD's ins Gefängnis kommt, so, also, so Werbung haben die damals gemacht, ähm, um den Leuten"}, {"id": 319, "start": 2407.24, "end": 2411.2, "text": "ein schlechtes Gewissen zu machen, so nach dem Motto, jaja, bloß nicht Napster oder was"}, {"id": 320, "start": 2411.2, "end": 2417.4, "text": "gab's denn dann sonst noch, äh, was gab's denn noch, LimeWire, ähm, Beershare, alter,"}, {"id": 321, "start": 2417.4, "end": 2424.52, "text": "kennt noch jemand Beershare, was das für ein Kack alles gab, ähm, oder, äh, AudioGalaxy"}, {"id": 322, "start": 2424.52, "end": 2433.08, "text": "oder sowas, EmuleCasa, genau, diesen ganzen Krempel da, da haben die lieber so dumme Werbung"}, {"id": 323, "start": 2433.08, "end": 2443.84, "text": "gemacht, richtig, richtig, gestört, naja, gut, so, jetzt haben wir uns da drüber bisschen"}, {"id": 324, "start": 2443.84, "end": 2448.88, "text": "aufgeregt, wunderbar, alles klar, so, und das ist das, was ich gesagt habe, die lernen"}, {"id": 325, "start": 2448.88, "end": 2454.44, "text": "daraus einfach nicht, die kriegen es einfach nicht gebacken, ja, pausen war nicht so viel"}, {"id": 326, "start": 2454.44, "end": 2460.28, "text": "illegale Seiten, wo man Zeug machen kann, Mods, Blitz, einmal, äh, löschen die ganzen"}, {"id": 327, "start": 2460.28, "end": 2463.8, "text": "Seiten, weil das, das ist im Zweifelsfall, da krieg ich dann auch noch Probleme, wenn"}, {"id": 328, "start": 2463.8, "end": 2471.76, "text": "hier Leute irgendwie links zu illegalen Seiten posten, ja, alles klar, aber sie lernen sie"}, {"id": 329, "start": 2471.76, "end": 2479.92, "text": "einfach nicht, ich bin echt begeistert, wie Lernresistent man sein kann, ach ja, ich hab"}, {"id": 330, "start": 2479.92, "end": 2483.16, "text": "die vm gestartet, weil ich gucken wollte, was ich bei AliExpress bestellt hab und vergessen"}, {"id": 331, "start": 2483.16, "end": 2497.16, "text": "hab, irgendwas hab ich bei AliExpress bestellt, aha, ist das ein, das ist keine Robbe, was"}, {"id": 332, "start": 2497.16, "end": 2502.92, "text": "ist denn das, wer ist biologisch, wer kennt sich hier so biologietechnisch aus, was ist"}, {"id": 333, "start": 2502.92, "end": 2522.28, "text": "das, eine Seekuh, messen, wie schlauter Chat ist, exzellent Chat, so, ähm, was hab ich"}, {"id": 334, "start": 2522.28, "end": 2535.2, "text": "hier bei AliExpress vergessen, das letzte Mal, hm, nix anscheinend, dann weiß ich auch"}, {"id": 335, "start": 2535.2, "end": 2539.92, "text": "nicht, keine Ahnung, da hab ich's vergessen, ich bin begeistert, der Chat ist richtig, richtig"}, {"id": 336, "start": 2539.92, "end": 2544.72, "text": "schlau, ich weiß es ja nicht, weil mein Hintergrund ist ja nicht von mir eingestellt, es ist ja"}, {"id": 337, "start": 2544.72, "end": 2550.48, "text": "Bing Image of the Day, ich glaub ich bin der einzigen, der Bing verwendet, sonst benutzt"}, {"id": 338, "start": 2550.48, "end": 2557.24, "text": "jemand Bing, aber Bing Image of the Day ist das, Toxamonx, danke für den Sub, ich hab"}, {"id": 339, "start": 2557.24, "end": 2563.68, "text": "schon wieder die Hälfte nicht gesehen hier, MatrixHD, danke für den Sub, Legion1498,"}, {"id": 340, "start": 2563.68, "end": 2567.64, "text": "hier PrimeSub, Poggers, schaff es leider viel zu selten an den Streamszuschauern, bist"}, {"id": 341, "start": 2567.64, "end": 2571.8, "text": "ein neulich mal Lieblings YouTuber, schau dich seit 2011, Massive, nice, dass du hier den"}, {"id": 342, "start": 2571.8, "end": 2576.88, "text": "Weg hergefunden hast, heute ist aber glaub ich nicht so super spannend, wir schwätzen"}, {"id": 343, "start": 2576.88, "end": 2583.4, "text": "ein bisschen dummes Zeug und ich guck mir ein paar Sachen an, DrGo nutzt doch auch Bing"}, {"id": 344, "start": 2583.4, "end": 2594.84, "text": "oder nicht, ich dachte DrGo hat irgendeine eigene Search Engine, nutzt DrGo Bing, ach"}, {"id": 345, "start": 2594.84, "end": 2610.44, "text": "den mal die haben was eigenes, Spackhack, sieben Monate, Pog, für Bilder, ja ok für Bilder"}, {"id": 346, "start": 2610.44, "end": 2618.56, "text": "versteh ich, aber wie gesagt, sind Wish Geschenkgutscheine eine gute Idee für Weihnachten, du bist öfters"}, {"id": 347, "start": 2618.56, "end": 2625.88, "text": "da, deswegen geh ich davon aus, die Frage ist G-Bait, und falls die Frage ernst gemeint"}, {"id": 348, "start": 2625.88, "end": 2631.84, "text": "ist, nein, Wish ist generell der größte Kack, den man überhaupt benutzen kann, Wish ist"}, {"id": 349, "start": 2631.84, "end": 2639.72, "text": "für alle Leute, die zu blöd sind, selbst in China zu bestellen, Wish hat keine Existenzberechtigung,"}, {"id": 350, "start": 2639.72, "end": 2647.48, "text": "ernsthaft, ich weiß nicht, warum Wish überhaupt noch existiert, was ist der Grund, warum gibt"}, {"id": 351, "start": 2647.48, "end": 2658.76, "text": "es Wish überhaupt noch, für die Memes, ja wahrscheinlich, weil jeder, der wirklich"}, {"id": 352, "start": 2658.76, "end": 2665.28, "text": "China Kram haben will und nichts anderes ist ja Wish, kann zu Banggood gehen oder zu Aliexpress"}, {"id": 353, "start": 2665.28, "end": 2671.32, "text": "oder zu DHgate oder so, was es noch alles gibt, gibt ja zig Milliarden China Shops,"}, {"id": 354, "start": 2671.32, "end": 2676.64, "text": "wo einer so aussieht wie der andere, die China Shops werden ja eh alle vom chinesischen Web"}, {"id": 355, "start": 2676.64, "end": 2682.84, "text": "Design Ministerium erstellt, deswegen sehen die sich auch alle so ähnlich, ich mein mir"}, {"id": 356, "start": 2682.84, "end": 2686.88, "text": "kann doch keiner erzählen, dass das nicht vom gleichen Web Designer erstellt wurden"}, {"id": 357, "start": 2686.88, "end": 2704.6, "text": "diese 3 Shops, das ist doch original der gleiche Kram, approved, die benutzen agiles WordPress,"}, {"id": 358, "start": 2704.6, "end": 2716.08, "text": "das ist gar nicht kein WordPress, die Noobs lassen sich gerne Jibane, Gearbest gibt es"}, {"id": 359, "start": 2716.08, "end": 2727.04, "text": "auch noch, genau, gibt viele so China Shops, wir bräuchten ein China Commodate, wie nennen"}, {"id": 360, "start": 2727.04, "end": 2734.84, "text": "sich die Chinesen denn untereinander, das ist ja eher Russisch, the Commodate China,"}, {"id": 361, "start": 2734.84, "end": 2752.0, "text": "gibt es da denn ein Emote, ne, die Aliexpress ist ein Spring Boot, ernsthaft, Java, na gut,"}, {"id": 362, "start": 2752.0, "end": 2775.24, "text": "wundert mich nicht, Java ist bei den China Chinesen sehr beliebt, China Commode, ne,"}, {"id": 363, "start": 2775.24, "end": 2778.88, "text": "wie nennen sich die Chinesen untereinander, es gibt bestimmt so ein China Emote, das mach"}, {"id": 364, "start": 2778.88, "end": 2792.12, "text": "ich dann auch noch rein, wenn wir Commodates haben als Emotes, gibt es bestimmt auch China,"}, {"id": 365, "start": 2792.12, "end": 2805.28, "text": "ja mach, tue dir keinen Zwang an, WinniePoo ist doch jetzt verboten in China, ich hab vergessen"}, {"id": 366, "start": 2805.28, "end": 2817.64, "text": "warum, China genau, das bräuchten wir eigentlich, so jetzt machen wir die China Seine wieder"}, {"id": 367, "start": 2817.64, "end": 2824.16, "text": "zu, da will ich doch eigentlich gar nichts, ich muss mal kurz zur Beruhigung eine Runde"}, {"id": 368, "start": 2824.16, "end": 2834.96, "text": "ASCII Quarium anmachen, UK Emote, ja, da fällt mir aber keins ein, oi, warum machst du immer"}, {"id": 369, "start": 2834.96, "end": 2848.76, "text": "das Eins in die Adresszeile, weil ich mir das angewöhnt hab, hat keinen tieferen Sinn,"}, {"id": 370, "start": 2848.76, "end": 2855.52, "text": "übrigens, Microsoft ist wieder total unfähig, ne, die hatten bei Microsoft letztens so,"}, {"id": 371, "start": 2855.52, "end": 2862.04, "text": ".net Konferenz und eigentlich haben die gesagt, wir laden alle Watts auf YouTube hoch, so"}, {"id": 372, "start": 2862.04, "end": 2872.52, "text": "und jetzt guckt man, YouTube.net, das ist halt 3 oder 4 Tagen fertig und, da will ich"}, {"id": 373, "start": 2872.52, "end": 2878.74, "text": "jetzt net hin, und sie haben nur die Watts hochgeladen bis zum zweiten Tag, die aktuellen"}, {"id": 374, "start": 2878.74, "end": 2884.88, "text": "Watts gibt's einfach nicht, ach, jetzt fangen sie an mit dem hoch, ne, machen sie nicht,"}, {"id": 375, "start": 2884.88, "end": 2889.4, "text": "also Microsoft ist da richtig Paynes Champ, dabei gab's 4-5 Talks, die ich eigentlich"}, {"id": 376, "start": 2889.4, "end": 2900.08, "text": "gucken wollte, Paynes Champ, was hältst du von den tausenden Tech-Stacks, die es mittlerweile"}, {"id": 377, "start": 2900.08, "end": 2907.84, "text": "gibt, Oldschool, PHP, das kommt ganz drauf an, also ich bin der Meinung, es hat überhaupt"}, {"id": 378, "start": 2907.84, "end": 2914.82, "text": "keinen Sinn, irgendwie, so dem neuesten Zeug dann nachzurennen, sondern man muss sich das"}, {"id": 379, "start": 2914.82, "end": 2918.56, "text": "angucken, was sinnvoll für das jeweilige Projekt ist und ganz im Ernst, wenn man gut"}, {"id": 380, "start": 2918.56, "end": 2925.56, "text": "PHP kann und ich weiß, wenn man jetzt nicht vielleicht Raw PHP macht, wo man alles selbst"}, {"id": 381, "start": 2925.56, "end": 2931.52, "text": "machen muss, sondern fertige Sachen verwendet, die die Fallstrecke ein bisschen, oder sag"}, {"id": 382, "start": 2931.52, "end": 2935.32, "text": "man so, die Hürde ein bisschen niedriger machen, sehe ich überhaupt kein Problem,"}, {"id": 383, "start": 2935.32, "end": 2941.24, "text": "was ich PHP, Laravel im Backend und JavaScript Frontend, warum nicht, ist überhaupt kein"}, {"id": 384, "start": 2941.24, "end": 2947.76, "text": "Ding und die ganzen Tech-Stacks, die haben ja eh nur Basswörternamen, wir haben ja letztens"}, {"id": 385, "start": 2947.76, "end": 2953.24, "text": "im Stream den eigenen, wir haben ja unseren eigenen Tech-Stack erfunden, ich habe aber"}, {"id": 386, "start": 2953.24, "end": 2960.88, "text": "schon wieder vergessen, wie er hieß, der Chet weiß das bestimmt noch, den Swag, der Swag-Stack"}, {"id": 387, "start": 2960.88, "end": 2967.04, "text": "haben wir ja, haben wir im Stream erfunden, Swag-Stack, der Swag-Stack, ich weiß aber"}, {"id": 388, "start": 2967.04, "end": 2972.52, "text": "nicht mal, wie er ihn geschrieben hat, ich glaube so, ich glaube so wurde er geschrieben,"}, {"id": 389, "start": 2972.52, "end": 2986.44, "text": "ne, SQLite, Vue, ASP.NET Core und das G habe ich schon wieder vergessen, ich glaube, das"}, {"id": 390, "start": 2986.44, "end": 2995.64, "text": "Swag-Stack, ich habe schon wieder vergessen, wofür es steht, es war eigentlich nur um"}, {"id": 391, "start": 2995.64, "end": 3005.12, "text": "was zu kreieren, was sich cool anhört, Swag-Stack, GraphQL, GraphQL war das, genau, genau, GraphQL,"}, {"id": 392, "start": 3005.12, "end": 3018.76, "text": "ASP.NET Core, Vue und SQLite, das Swag-Stack und gerade im Javascript Umfeld kannst du"}, {"id": 393, "start": 3018.76, "end": 3023.72, "text": "ja da überhaupt nicht mal Schritt mithalten, also es vergeht ja kein Tag, wo nicht irgendwie"}, {"id": 394, "start": 3023.72, "end": 3028.84, "text": "ein super neues gehypedes Javascript Framework rauskommt, da blickt keiner mehr durch, also"}, {"id": 395, "start": 3028.84, "end": 3039.96, "text": "Javascript ist wirklich abfuck, was das angeht, oh ich habe gerade noch einen Emote hier gefunden,"}, {"id": 396, "start": 3039.96, "end": 3049.04, "text": "was Twitch mittlerweile nicht mehr haben will, beziehungsweise nicht Twitch, was bettertwitch.tv"}, {"id": 397, "start": 3049.04, "end": 3055.08, "text": "und better und ffz nicht mehr haben will, hier Band, Band Emote habe ich gerade noch"}, {"id": 398, "start": 3055.08, "end": 3062.4, "text": "gefunden, wo kommt denn das her, so anstößiges Zeug, warum habe ich denn hier so was in meinem"}, {"id": 399, "start": 3062.4, "end": 3071.16, "text": "Board drinnen, es wird gerade aufgefallen, dass es hier noch drinnen ist, das wurde mittlerweile,"}, {"id": 400, "start": 3071.16, "end": 3076.32, "text": "das wurde mittlerweile gelöscht, es wurde noch mehr gelöscht, ich habe hier richtig"}, {"id": 401, "start": 3076.32, "end": 3087.92, "text": "Rare Emotes mittlerweile drinne, Zulul habe ich zum Beispiel auch noch drinne, Zulul oder"}, {"id": 402, "start": 3087.92, "end": 3095.32, "text": "oder PogChamp, nee wo habe ich den PogChamp, habe ich den originalen PogChamp noch drinne,"}, {"id": 403, "start": 3095.32, "end": 3109.32, "text": "wo bestimmt, Band Emotes, also wie gesagt, ich bin der Ansicht, man sollte das nehmen,"}, {"id": 404, "start": 3109.32, "end": 3115.4, "text": "was man gut kann und was zu dem jeweiligen Projekt passt und der Rest ist eigentlich"}, {"id": 405, "start": 3115.4, "end": 3127.28, "text": "zweitrangig, ach die machen mittlerweile sogar Werbung in Whistle Studio für Whistle Studio,"}, {"id": 406, "start": 3127.28, "end": 3137.68, "text": "das ist aber nett, dass man Bescheid weiß, Showidee, Techsack oder Shitcoin, ja das"}, {"id": 407, "start": 3137.68, "end": 3142.48, "text": "könnte mittlerweile echt alles sein, habt ihr das mitbekommen mit der Squid Game Coin"}, {"id": 408, "start": 3142.48, "end": 3150.32, "text": "oder wie dieses Ding hieß, wo der in Anführungsweise Erfinder dann mit irgendwie, was weiß ich,"}, {"id": 409, "start": 3150.32, "end": 3159.4, "text": "wie viel 100.000 abgehauen ist, das ist der, die Leute sind so blöd, ich checke es einfach"}, {"id": 410, "start": 3159.4, "end": 3163.28, "text": "nicht, ich checke es einfach nicht, wisst ihr, es gibt Leute, die sind allen Ernstes"}, {"id": 411, "start": 3163.28, "end": 3180.52, "text": "hier drauf reingefallen, die sind da wirklich drauf reingefallen, diese ganze Show, die"}, {"id": 412, "start": 3180.52, "end": 3191.8, "text": "hat so krass nach Scam geschrien, wie der Typ schon auf die Bühne ist, wie der Typ"}, {"id": 413, "start": 3191.8, "end": 3212.2, "text": "schon auf die Bühne gekommen ist, wirkt das irgendwie in irgendeiner Weise seriös, wirkt"}, {"id": 414, "start": 3212.2, "end": 3224.52, "text": "das irgendwie so seriös, wirkt das irgendwie so, als möchte ich da mein Geld reinbuttern,"}, {"id": 415, "start": 3224.52, "end": 3232.6, "text": "es ist unglaublich, wie einfach sich die Leute bescheißen lassen, der war auch Opfer, ja"}, {"id": 416, "start": 3232.6, "end": 3237.92, "text": "das glaube ich ja sogar, aber trotzdem, wie kann man sich da so verarschen lassen, das"}, {"id": 417, "start": 3237.92, "end": 3242.6, "text": "schreit doch Scam, hat irgendjemand das jetzt gesehen, hat es gedacht, das ist aber mal"}, {"id": 418, "start": 3242.6, "end": 3249.52, "text": "eine seriöse Investitionsmöglichkeit, ich glaube, denen gebe ich jetzt mal 50.000 Euro,"}, {"id": 419, "start": 3249.52, "end": 3256.68, "text": "da ist bestimmt kein Scam, nein, nein, nein, nein, wer, wer, also keine Ahnung, ich weiß"}, {"id": 420, "start": 3256.68, "end": 3267.24, "text": "nicht, was mit den Leuten los ist, ja wenn es mal reicht, schau dir den Windows 95 Launch"}, {"id": 421, "start": 3267.24, "end": 3273.0, "text": "Dance an, ne, ne, das ist cringe, oder du kannst ja auch den This is Windows 386, wo diese"}, {"id": 422, "start": 3273.0, "end": 3278.88, "text": "Sekretärin dann anfängt zu singen vorm Rechner, weil sie Windows 386 hat, ne, ne, das muss"}, {"id": 423, "start": 3278.88, "end": 3286.68, "text": "nicht sein, Faxgeräte, Bundestag, was, die Faxgeräte sollen weg, ernsthaft, das ist"}, {"id": 424, "start": 3286.68, "end": 3291.48, "text": "ja, das ist schon wieder outdated, dann hat man festgestellt, zu Corona-Zeiten braucht"}, {"id": 425, "start": 3291.48, "end": 3296.88, "text": "man immer noch Faxgeräte, weil wie soll man denn Corona-Zahlen übertragen ohne Faxgeräte,"}, {"id": 426, "start": 3296.88, "end": 3314.16, "text": "das geht auch gar nicht, das ist komplett ein Ding der Unmöglichkeit, welche Sprachen"}, {"id": 427, "start": 3314.16, "end": 3324.04, "text": "kannst du eigentlich, ach keine Programme, ach so, ja eigentlich nur Deutsch und Englisch,"}, {"id": 428, "start": 3324.04, "end": 3328.08, "text": "es gibt böse Zungen, die behaupten, ich kann auch kein Englisch, aber ich würde sagen"}, {"id": 429, "start": 3328.08, "end": 3344.68, "text": "Deutsch und Englisch, bisschen hessisch vielleicht noch, ich kann Brötchen bestellen auf Portugiesisch,"}, {"id": 430, "start": 3344.68, "end": 3353.16, "text": "sonst kann ich nix, ach so, ich kann, ich kann, ich kann Beleidigungen auf Niederländisch,"}, {"id": 431, "start": 3353.16, "end": 3358.24, "text": "aber ich glaube die Beleidigungen sind mittlerweile TOS und die kann ich hier nicht sagen, weil"}, {"id": 432, "start": 3358.24, "end": 3363.24, "text": "die, weil die wahrscheinlich Minderheiten diskriminieren oder so auf Niederländisch"}, {"id": 433, "start": 3363.24, "end": 3370.08, "text": "und das, das sage ich jetzt hier lieber nicht, das habe ich mal irgendwo aufgeschnappt und"}, {"id": 434, "start": 3370.08, "end": 3376.4, "text": "ja, ich kann beleidigen, ich kann Leute beleidigen auf Niederländisch, ich kann Brötchen bestellen"}, {"id": 435, "start": 3376.4, "end": 3388.44, "text": "auf Portugiesisch und ich kann Deutsch und Englisch und so die üblichen Russen und Franzosen"}, {"id": 436, "start": 3388.44, "end": 3405.96, "text": "Flames aus Online Games, ja klar, BitConnect Remix, ach ne, bloß nicht, das gibt es bestimmt,"}, {"id": 437, "start": 3405.96, "end": 3419.52, "text": "das gibt es bestimmt, wieviel haben die, ich habe keine Ahnung mehr, für manche ist auch"}, {"id": 438, "start": 3419.52, "end": 3427.32, "text": "PayPal E-Bahn Aktualisierung seriös, ja ich habe letztens eine, eine Scam SMS bekommen,"}, {"id": 439, "start": 3427.32, "end": 3433.16, "text": "ihr DHL Paket ist jetzt bereit und da dachte ich erst so Huch, was denn das und dann habe"}, {"id": 440, "start": 3433.16, "end": 3437.28, "text": "ich die Uhr gesehen, die Uhr, Moment wo habe ich mein Handy, ich sage euch mal, ich sage"}, {"id": 441, "start": 3437.28, "end": 3442.96, "text": "euch mal, wie die Uhr angefangen hat, sehr, super seriös, super seriös, nein ich will"}, {"id": 442, "start": 3442.96, "end": 3449.84, "text": "das Update nicht installieren, MonkaS ist jetzt fast iOS Update angeschmissen, ne, Moment"}, {"id": 443, "start": 3449.84, "end": 3466.92, "text": "hier, wo habe ich denn, Scam SMS, hier, also Scam SMS, wir haben versucht ihr Paket zuzustellen,"}, {"id": 444, "start": 3466.92, "end": 3485.92, "text": "prüfen sie hier den Status und dann kommt eine Uhr, ladytittytupfer.com, ich glaube"}, {"id": 445, "start": 3485.92, "end": 3494.76, "text": "auch, dass DHL unter ladytittytupfer bestimmt ihren Paketstatus anbietet, klickt drauf,"}, {"id": 446, "start": 3494.76, "end": 3498.36, "text": "wenn du draufklickst, dann fängst du dir gleich irgendwelche Viren ein, weil das auf"}, {"id": 447, "start": 3498.36, "end": 3502.04, "text": "dem Smartphone mit aktuellen Patches natürlich deutlich schwieriger ist, die geben sich"}, {"id": 448, "start": 3502.04, "end": 3509.76, "text": "keine Mühe, ne, die hätten wenigstens mal einen Shortlink verwenden können oder so,"}, {"id": 449, "start": 3509.76, "end": 3518.72, "text": "das Schlimme ist, da fallen Leute drauf rein, da fallen Leute drauf rein, maxbestesenglisch,"}, {"id": 450, "start": 3518.72, "end": 3538.24, "text": "ja zeig mal her, seriöser genannt ist es hier irgendwie Default Comparisons, Englisch,"}, {"id": 451, "start": 3538.24, "end": 3556.0, "text": "ja ich sag euch kein Englisch, also Schwäbisch wäre mir nicht bekannt, dass ich Schwäbisch"}, {"id": 452, "start": 3556.0, "end": 3561.44, "text": "irgendwie dabei hätte, ich hatte mit Schwaben nichts zu tun, außer dass ich während meiner"}, {"id": 453, "start": 3561.44, "end": 3568.88, "text": "Ausbildungszeit da öfters mal war und da hab ich festgestellt, dass Ulm die unfreundlichsten"}, {"id": 454, "start": 3568.88, "end": 3574.32, "text": "Busfahrer auf der Welt hat, vielleicht hab ich ja in Ulm auch zufällig damals schon"}, {"id": 455, "start": 3574.32, "end": 3581.16, "text": "Ello Tricks getroffen und wir wissen es beide nicht, aber Ulm ist wirklich eines der, weiß"}, {"id": 456, "start": 3581.16, "end": 3595.48, "text": "ich nicht, also Ulm ist wirklich die Stadt, wo ich am wenigsten jemals wieder hin möchte,"}, {"id": 457, "start": 3595.48, "end": 3601.6, "text": "ja zum Glück, ich mein, die ganzen Scam-Anrufe und SMS und sowas, die zielen ja gerade eben"}, {"id": 458, "start": 3601.6, "end": 3608.44, "text": "auch auf die Generationen, sagen wir mal, über 60 ab, unter anderem, also generell"}, {"id": 459, "start": 3608.44, "end": 3612.92, "text": "auf Leute, die technisch nicht so bewandt sind, also hätte meine Oma oder mein Opa"}, {"id": 460, "start": 3612.92, "end": 3617.6, "text": "eine SMS gekriegt, wo sowas drin steht, die hätten das wahrscheinlich angekriegt, wobei"}, {"id": 461, "start": 3617.6, "end": 3622.04, "text": "meine Oma und mein Opa, die wären dafür gar nicht anfällig gewesen, weil die hatten"}, {"id": 462, "start": 3622.04, "end": 3627.8, "text": "sowas modernes wie ein Smartphone nicht mal, mein Opa hätte ohne Probleme eins haben können,"}, {"id": 463, "start": 3627.8, "end": 3649.24, "text": "das gab es da schon, aber der wollte nicht, da wurde das Rechenzentrum, ja genau, ja genau"}, {"id": 464, "start": 3649.24, "end": 3657.0, "text": "und Generation Z, was kommt eigentlich nach Generation Z, kommt da Generation A wieder,"}, {"id": 465, "start": 3657.0, "end": 3671.52, "text": "die fallen dann eben auf so Sachen hier rein oder eben auf Generation AA, was kommt, what's"}, {"id": 466, "start": 3671.52, "end": 3694.8, "text": "after Gen Z, Alpha, siehst du, so sieht es aus, jetzt müssen wir wieder was gelernt,"}, {"id": 467, "start": 3694.8, "end": 3705.92, "text": "wir fällt übrigens gerade noch ein, weil ich hier die Steckdose auf habe, wir müssen"}, {"id": 468, "start": 3705.92, "end": 3711.8, "text": "die noch flashen, ich hab noch 4 Stück hier liegen, ne stimmt nicht, 3 Stück noch, die"}, {"id": 469, "start": 3711.8, "end": 3716.88, "text": "wir nicht geflasht haben, weil ich hab im letzten Stream gesagt, wir flashen die dann"}, {"id": 470, "start": 3716.88, "end": 3732.64, "text": "später und ich glaube später ist nie eingetreten, also die liegen hier noch ungeflasht rum,"}, {"id": 471, "start": 3732.64, "end": 3740.6, "text": "müssen wir bei Gelegenheit auch mal machen, aber Steckdosen leisten Flashen beste, es"}, {"id": 472, "start": 3740.6, "end": 3750.28, "text": "ist immer noch später, genau, später ist dehnbar, was machen eigentlich die Github"}, {"id": 473, "start": 3750.28, "end": 3758.96, "text": "Trends, was machen eigentlich, lass uns mal ganz kurz in die Github Trends reingucken,"}, {"id": 474, "start": 3758.96, "end": 3774.24, "text": "das ist Trending, mal schnell drüber scrollen, alles klar, die China-Chinesen sind am Start,"}, {"id": 475, "start": 3774.24, "end": 3779.48, "text": "Open Source SDK Instant Messenger, das muss man unbedingt was Neues erfinden, es gibt"}, {"id": 476, "start": 3779.48, "end": 3785.68, "text": "ja noch nichts zum Instant Messenger, Instant Messenger ist ja sowas, da gab es noch nie"}, {"id": 477, "start": 3785.68, "end": 3789.36, "text": "was und gibt es ja auch nie was für, ich weiß nicht warum alle immer so viele Instant Messenger"}, {"id": 478, "start": 3789.36, "end": 3794.0, "text": "Zeug sich ausdenken, ich mein muss ich mal überlegen, wir sind ja schon relativ weit"}, {"id": 479, "start": 3794.0, "end": 3801.04, "text": "gekommen seit ICQ und AOL Messenger, aber nicht jede Entwicklung in diesem Sektor war"}, {"id": 480, "start": 3801.04, "end": 3811.32, "text": "zum besseren, was bringt euch smarte Steckdosen eigentlich, mir fällt absolut keine wie ich"}, {"id": 481, "start": 3811.32, "end": 3815.68, "text": "eine Steckdose als Verbraucher aussehen vielleicht für eine Lampe zum Beispiel oder für die"}, {"id": 482, "start": 3815.68, "end": 3824.96, "text": "Heizung oder für den Heizlüfter oder für irgendwie Beleuchtung im Schlafzimmer oder"}, {"id": 483, "start": 3824.96, "end": 3828.92, "text": "wenn du was im Keller hast, was du regelmäßig neu starten willst oder wenn du was im Keller"}, {"id": 484, "start": 3828.92, "end": 3832.76, "text": "hast, wo du sagst, hey das muss ich nur einmal im Monat einschalten oder so, da gibt es"}, {"id": 485, "start": 3832.76, "end": 3838.0, "text": "doch jede Menge Sachen, ich glaube, ich glaube, smarte Steckdosen leisten oder für 3D Drucker,"}, {"id": 486, "start": 3838.0, "end": 3843.6, "text": "was auch immer, also ich denke mal smarte Steckdosen leisten dürften eigentlich die"}, {"id": 487, "start": 3843.6, "end": 3847.56, "text": "Smart Home Geräte schlechthin sein, mit denen fast jeder irgendwas sinnvolles anfangen"}, {"id": 488, "start": 3847.56, "end": 3848.56, "text": "kann."}, {"id": 489, "start": 3848.56, "end": 3861.96, "text": "So, also was haben wir denn hier schönes, was trennt ihr denn diesen Monat auf Shithub,"}, {"id": 490, "start": 3861.96, "end": 3872.8, "text": "HashLibsArtEngine, alles klar, Telegram, QuestDB, wisst ihr was ich mir denke zu den ganzen"}, {"id": 491, "start": 3872.8, "end": 3878.48, "text": "Datenbankdingern, die es so gibt und ich tue jetzt wahrscheinlich einigen unrecht, weil"}, {"id": 492, "start": 3878.48, "end": 3884.6, "text": "das da sicherlich coole Sachen gibt, aber vollkommen egal, ob es so bekannte Sachen"}, {"id": 493, "start": 3884.6, "end": 3891.8, "text": "sind wie MongoDB oder sowas hier in der Richtung, in der Regel nimmst du Postgres und im Zweifelsfall"}, {"id": 494, "start": 3891.8, "end": 3895.4, "text": "Postgres mit irgendwelchen, wie heißt das, Addons, Plugins, ich weiß gar nicht, wie das"}, {"id": 495, "start": 3895.4, "end": 3899.76, "text": "bei Postgres heißt oder irgendwas, was mittlerweile standardmäßig drin ist und du fährst eigentlich"}, {"id": 496, "start": 3899.76, "end": 3900.76, "text": "in der Regel ganz gut."}, {"id": 497, "start": 3900.76, "end": 3909.44, "text": "Kennst du schon das, Workplace.com, Facebook für Workplace, nein, kenn ich nicht, Next.js"}, {"id": 498, "start": 3909.44, "end": 3918.56, "text": "React Framework, AniCL, ah, guck mal hier, da ist was für die Weeps unter uns, CLI-Tool"}, {"id": 499, "start": 3918.56, "end": 3937.88, "text": "to Browse and Play Anime, jawoll, endlich, aus welchen, aus welchen Quellen holt das"}, {"id": 500, "start": 3937.88, "end": 3943.0, "text": "diese Dinger denn, das ist doch bestimmt nicht rein legale Streaming-Anbieter oder?"}, {"id": 501, "start": 3943.0, "end": 3949.16, "text": "Ne, ich kann AniCL eigentlich installieren, weil wenn ich das starte, dann ist das Monka"}, {"id": 502, "start": 3949.16, "end": 3958.76, "text": "Toss und ich werde im Zweifelsfall noch gestrikt, das muss nicht sein, Tokenlist, was auch immer,"}, {"id": 503, "start": 3958.76, "end": 3967.12, "text": "XMRIG, auch Bitcoin trendet mal wieder, war eine Weile nicht drin, ist doch irgendwas"}, {"id": 504, "start": 3967.12, "end": 3981.6, "text": "spannendes dabei, super Fast Compiler, äh, was, ich kann Rust jetzt zu JavaScript kompilieren"}, {"id": 505, "start": 3981.6, "end": 4006.8, "text": "oder was, was, aber warum, examples, ich habe keine Ahnung wofür es gut ist, es ist"}, {"id": 506, "start": 4006.8, "end": 4012.32, "text": "ein JavaScript-Compiler in Rust, ah, ich kann JavaScript programmieren und der kompiliert"}, {"id": 507, "start": 4012.32, "end": 4018.2, "text": "es dann, ok, das ist wenn ich JavaScript verstehe, wenn ich JavaScript-Native-Anwendungen machen"}, {"id": 508, "start": 4018.2, "end": 4024.36, "text": "will, also im Prinzip, wenn ich nur JavaScript ohne irgendwelche großartigen Library-Geschichten"}, {"id": 509, "start": 4024.36, "end": 4030.72, "text": "verwenden will, wobei die meisten JavaScript-Libraries, die rein JavaScript sind gehen, aber mit Node-Geschichten"}, {"id": 510, "start": 4030.72, "end": 4039.0, "text": "ist dann wahrscheinlich schon wieder vorbei, ja, warum nicht, willst du Halo Infinite streamen,"}, {"id": 511, "start": 4039.0, "end": 4043.04, "text": "wahrscheinlich nicht, ich bin ziemlich schlecht was Halo angeht, aber ich gucke es mir auf"}, {"id": 512, "start": 4043.04, "end": 4045.64, "text": "jeden Fall an und wenn es mir bock macht und ich vielleicht ein bisschen besser bin, dann"}, {"id": 513, "start": 4045.64, "end": 4051.72, "text": "kann ich es auch mal streamen, OS X KVM, das haben wir schon mal ausprobiert, das ist wirklich"}, {"id": 514, "start": 4051.72, "end": 4063.04, "text": "cool, hier hat einer ein KVM, only commercial paid, what the fuck, darf man dafür überhaupt"}, {"id": 515, "start": 4063.04, "end": 4070.36, "text": "Geld kassieren, Apple sagt doch, du darfst glaube ich Mac gar nicht virtualisieren, das"}, {"id": 516, "start": 4070.36, "end": 4075.84, "text": "ist bestimmt allein schon Toss für Fragen danach, das haben wir aber glaube ich mal"}, {"id": 517, "start": 4075.84, "end": 4080.88, "text": "ausprobiert, das war wirklich ganz cool, dass wir dann Mac in der VM hatten, ne, ne, wir"}, {"id": 518, "start": 4080.88, "end": 4090.24, "text": "haben es mit VirtualBox unter Windows gemacht, wie lange hast du Urlaub, ich habe Urlaub"}, {"id": 519, "start": 4090.24, "end": 4108.04, "text": "vom neunzehnten bis zum dritten, vierten, bis zum vierten, also ist ein bisschen, CubeSphere,"}, {"id": 520, "start": 4108.04, "end": 4118.2, "text": "Container, Platform Tail, da gibt es auch jeden Tag irgendwas neues, YOLO V5, da weiß"}, {"id": 521, "start": 4118.2, "end": 4123.72, "text": "ich zur Abwechslung mal, was es ist, das ist Objekterkennung in Bildern, so eines der bekanntesten"}, {"id": 522, "start": 4123.72, "end": 4134.76, "text": "eigentlich, YOLO, steht für you only look once, alles klar, ist nichts spannendes dabei"}, {"id": 523, "start": 4134.76, "end": 4139.08, "text": "diesen Monat muss ich ehrlich sagen, guck mal diese Woche, wie viele Mail Accounts hast"}, {"id": 524, "start": 4139.08, "end": 4142.72, "text": "du und wie organisierst du die, oh ich habe viele Mail Accounts, ich organisiere die gar"}, {"id": 525, "start": 4142.72, "end": 4146.32, "text": "nicht großartig, ich habe einen Passwortmanager, da steht alles drin, das wollte ich übrigens"}, {"id": 526, "start": 4146.32, "end": 4152.8, "text": "gar nicht anklicken, ich habe einen Passwortmanager, da steht alles drin und in der Regel weiß"}, {"id": 527, "start": 4152.8, "end": 4157.64, "text": "ich so halbwegs für was und für was ich welchen Account benutzt habe und im Zweifelsfall ist"}, {"id": 528, "start": 4157.64, "end": 4163.32, "text": "es in der Browserhistorie drin, warum eigentlich nur eine Woche arbeiten, weil ich dann Urlaub"}, {"id": 529, "start": 4163.32, "end": 4169.48, "text": "habe, ich habe Urlaub ab 19., also ich muss jetzt noch eins, also Montag, also heute arbeite"}, {"id": 530, "start": 4169.48, "end": 4173.84, "text": "ich, also Montags arbeite ich ja prinzipiell nicht, ich muss jetzt noch 1,2,3,4 Tage arbeiten"}, {"id": 531, "start": 4173.84, "end": 4186.84, "text": "und dann habe ich bis 4. Januar Urlaub, Pock, so was trendet heute, äh this week, Doggecoin"}, {"id": 532, "start": 4186.84, "end": 4200.24, "text": "trendet, PowerShell, IGIT, warum trendet PowerShell, warum, was machen die, warum denn so was,"}, {"id": 533, "start": 4200.24, "end": 4205.6, "text": "ich meine PowerShell an sich ist eine coole Sache für Windows Automatisierung, als interaktive"}, {"id": 534, "start": 4205.6, "end": 4213.34, "text": "Shell finde ich es nicht schön, na gut, ich verstehe, dass es trendet, die Windows Leute"}, {"id": 535, "start": 4213.34, "end": 4225.72, "text": "haben lange nach rauf gewartet, dass sie auch mal eine brauchbare Shell bekommen, ja sonderlich"}, {"id": 536, "start": 4225.72, "end": 4230.36, "text": "spannende Sachen trenden da diesmal aber nicht, Rastic für Backups ist tatsächlich ganz"}, {"id": 537, "start": 4230.36, "end": 4244.04, "text": "nice, Flutter trendet, ich habe übrigens bis heute nicht verstanden, warum Flutter"}, {"id": 538, "start": 4244.04, "end": 4248.84, "text": "unbedingt Dart verwenden muss, warum kann Flutter nicht Go verwenden, weil das ist auch"}, {"id": 539, "start": 4248.84, "end": 4254.64, "text": "von Google und Go ist mit Sicherheit die verbreitere Sprache und hat mit Sicherheit mehr Libraries"}, {"id": 540, "start": 4254.64, "end": 4263.28, "text": "als Dart, nö ist ja langweilig, trendet ja gar nichts spannendes."}, {"id": 541, "start": 4284.64, "end": 4303.32, "text": "So, ja gut, ähm, machst du gerade Werbung für deine Seite, könnte das sein?"}, {"id": 542, "start": 4303.32, "end": 4310.2, "text": "Ich wollte gerade sagen, das liest sich jetzt aber doch schon ganz leicht offensichtlich"}, {"id": 543, "start": 4310.2, "end": 4317.8, "text": "nach Werbung, aber meinetwegen, heute, heute will ich mal nicht so sein, lasst, lasst,"}, {"id": 544, "start": 4317.8, "end": 4325.84, "text": "lasst stehen Leute, lasst stehen, lasst stehen, komm ich bin sogar mal so nett, ich guck mal"}, {"id": 545, "start": 4325.84, "end": 4330.36, "text": "nach was es ist, aber wahrscheinlich gehts nicht über die Suchmaschine raus, weil wer"}, {"id": 546, "start": 4330.36, "end": 4338.72, "text": "weiß wo ich dann da lande, ah das ist quasi so eine, so eine GitHub Alternative für wenn"}, {"id": 547, "start": 4338.72, "end": 4342.92, "text": "man kein Geld ausgeben will, aber warum, was ist da, ok, da musst du uns das jetzt aber"}, {"id": 548, "start": 4342.92, "end": 4348.56, "text": "auch verkaufen, was ist der Vorteil versus GitHub und warum sollte ich das verwenden"}, {"id": 549, "start": 4348.56, "end": 4354.8, "text": "anstatt, wenn ich ganz super viel Wert auf Privatsphäre lege für eine selbst installierte"}, {"id": 550, "start": 4354.8, "end": 4359.24, "text": "setze XY Software ein oder warum soll ich auch das eher verwenden als GitLab?"}, {"id": 551, "start": 4359.24, "end": 4372.16, "text": "Jetzt musst du es uns ein bisschen schmackhaft machen, aber eigentlich keine Lust auf React"}, {"id": 552, "start": 4372.16, "end": 4375.84, "text": "Native, aber bei Flutter finde ich, ja geht mir ähnlich, also ich bin ja der Ansicht"}, {"id": 553, "start": 4375.84, "end": 4381.84, "text": "dass, also kann man sich wohl streiten, es ist erstens Microsoft schuld, dass wir heute"}, {"id": 554, "start": 4381.84, "end": 4387.48, "text": "mittlerweile so viel Elektronen Anwendung ertragen müssen und leider ist es so, das einzig sinnvolle"}, {"id": 555, "start": 4387.48, "end": 4395.96, "text": "Crossplatform GUI Framework ist tatsächlich mittlerweile Elektron, Qt ist C++ und dementsprechend"}, {"id": 556, "start": 4395.96, "end": 4401.08, "text": "schon mal Müll, Flutter ist auf dem Desktop noch nicht gut genug am Start, Maui unterstützt"}, {"id": 557, "start": 4401.08, "end": 4413.88, "text": "kein Linux, es gibt leider nichts außer Elektron und das ist wirklich sehr pains champ, ok"}, {"id": 558, "start": 4413.88, "end": 4424.2, "text": "es ist also, ja ok, da kann ich aber auch, ich muss sagen das stört mich jetzt persönlich"}, {"id": 559, "start": 4424.2, "end": 4429.6, "text": "nicht so lange es gut funktioniert, aber dann könnte ich auch GitLab nehmen und es halt"}, {"id": 560, "start": 4429.6, "end": 4433.24, "text": "backt bei einem Verein mit dem Ziel Open Source Software in Deutschland zu fördern,"}, {"id": 561, "start": 4433.24, "end": 4438.04, "text": "ach das ist ein deutsches Projekt, ok das ist zum Beispiel was wo ich sage ja, das lasse"}, {"id": 562, "start": 4438.04, "end": 4443.84, "text": "ich mir gefallen, wenn man deutsche Open Source Software fördern will warum nicht,"}, {"id": 563, "start": 4443.84, "end": 4455.64, "text": "ja ok, ok verstehe, Non-Profit, was läuft da unten drunter, ist das was eigenes oder"}, {"id": 564, "start": 4455.64, "end": 4463.52, "text": "ist das irgendein, ah hier, das ist quasi GTHS Service oder wie darf man das sehen,"}, {"id": 565, "start": 4463.52, "end": 4469.28, "text": "ja das habe ich bei mir nämlich lokal auch laufen, dachte mir kam mir irgendwie bekannt"}, {"id": 566, "start": 4469.28, "end": 4498.72, "text": "vor, C++ triggert mich, Microsoft meine ich, ja das ist Elektron, Elektron ist, ja das"}, {"id": 567, "start": 4498.72, "end": 4505.48, "text": "Elektron ist die Chrome Browser Engine plus Node.js und wenn du da ein Hallo Welt Programm"}, {"id": 568, "start": 4505.48, "end": 4512.0, "text": "startest, dann brauchst du erst mal 300 MB RAM, aber gut RAM haben wir ja heute genug"}, {"id": 569, "start": 4512.0, "end": 4537.52, "text": "Daily Driver Linux naja, ihr wisst meine Meinung dazu, ihr wisst dass ich Linux Fan bin und"}, {"id": 570, "start": 4537.52, "end": 4543.04, "text": "mit Linux mein Geld verdiene, aber für mich ist die beste Kombination immer noch Windows"}, {"id": 571, "start": 4543.04, "end": 4550.88, "text": "und Linux VM, vielleicht wird das mal durch WSL abgelöst, mal gucken und ich finde es"}, {"id": 572, "start": 4550.88, "end": 4557.6, "text": "immer noch sinnvoller Linux unter Windows zu virtualisieren als Windows unter Linux,"}, {"id": 573, "start": 4557.6, "end": 4565.0, "text": "dementsprechend einfach das besten aus beiden Welten nehmen und nicht irgendwie sich das"}, {"id": 574, "start": 4565.0, "end": 4569.88, "text": "Leben schwer machen von Leuten die quasi sagen man muss das eine verwenden und das"}, {"id": 575, "start": 4569.88, "end": 4573.48, "text": "andere ist scheiße, einfach immer das Tool nehmen was für die jeweiligen Anwendungszwecke"}, {"id": 576, "start": 4573.48, "end": 4601.88, "text": "am sinnvollsten ist, ja das wäre nice, naja wisst ihr was wir gucken uns auch mal ein"}, {"id": 577, "start": 4601.88, "end": 4605.76, "text": "paar Videos an, was haben wir denn hier zu bieten, ich habe einfach ein paar random Videos"}, {"id": 578, "start": 4605.76, "end": 4614.6, "text": "aufgemacht die ich mir auf dem Handy zum später gucken gespeichert habe, was haben wir denn"}, {"id": 579, "start": 4614.6, "end": 4625.76, "text": "hier, Homemade Catfeeder 3D Printed, alles klar, Dear Dice please listen, ok ok, das"}, {"id": 580, "start": 4625.76, "end": 4633.8, "text": "würde mir empfohlen, das können wir uns tatsächlich mal geben, Raspberry Pi Zero, gut da haben"}, {"id": 581, "start": 4633.8, "end": 4637.04, "text": "wir uns eigentlich letztes Mal schon angeguckt, das müssen wir uns nicht nochmal anschauen,"}, {"id": 582, "start": 4637.04, "end": 4643.16, "text": "wir wissen dass der Raspberry Pi Zero 2 schneller ist, weil er die CPU vom 3er drin hat und dementsprechend"}, {"id": 583, "start": 4643.16, "end": 4660.92, "text": "4 Kerne oder waren es 2 Kerne und 4 Fakekerne, ne ich glaube 4 richtige Kerne, 10 Wege um"}, {"id": 584, "start": 4660.92, "end": 4664.44, "text": "besserer Entwickler zu werden, oh ich glaube das ist jetzt ein bisschen zu langweilig, was"}, {"id": 585, "start": 4664.44, "end": 4678.0, "text": "ist das hier, oh mehr LEDs zeig her, LEDs ich brauch LEDs, das ist wieder, das ist WLED,"}, {"id": 586, "start": 4678.0, "end": 4685.76, "text": "das ist 100 pro WLED, was da unten drunter läuft, die Frage die sich mir bei mir immer"}, {"id": 587, "start": 4685.76, "end": 4697.44, "text": "so was stellt ist, warum, ich mein mag zwar cool aussehen, aber warum, der Vorteil von"}, {"id": 588, "start": 4697.44, "end": 4702.68, "text": "irgendwelchen 3D getruckten Lampen und LED Ketten, das verstehe ich ja noch, aber warum"}, {"id": 589, "start": 4702.68, "end": 4713.76, "text": "ein LED Würfel, wahrscheinlich weil es geht, ne wenn das Arduino ist dann ist es kein WLED,"}, {"id": 590, "start": 4713.76, "end": 4725.6, "text": "schön 1 Ampere, oh die ziehen definitiv mehr, das sind ja 16 mal 16 mal 16, da kann ich"}, {"id": 591, "start": 4725.6, "end": 4738.04, "text": "doch bestimmt 16 hoch 3 einfach rechnen oder, das sind 4096 LEDs, das zieht um einiges"}, {"id": 592, "start": 4738.04, "end": 4743.68, "text": "mehr als ein, wahrscheinlich sind das auch noch 5 Volt LEDs, das braucht, boah da brauchst"}, {"id": 593, "start": 4743.68, "end": 4761.0, "text": "du ja das brutalste Netzteil dafür, vielleicht sind das auch 12 Volt LEDs oder noch mehr,"}, {"id": 594, "start": 4761.0, "end": 4767.96, "text": "keine Ahnung, aber wenn du 4095 LEDs, du brauchst mehrere Netzteile, glaube ich anders da kommst"}, {"id": 595, "start": 4767.96, "end": 4775.08, "text": "du da gar nicht hin, also wenn du wirklich 4095 LEDs, sodass du es auch ordentlich siehst,"}, {"id": 596, "start": 4775.08, "end": 4778.84, "text": "alles versorgen willst mit einem Netzteil, 5 Volt LEDs mit einem Netzteil, das Ding muss"}, {"id": 597, "start": 4778.84, "end": 4786.2, "text": "ja, was weiß ich da brauchst, 80 Ampere Netzteil 5 Volt oder sowas, dass das ordentlich funktioniert,"}, {"id": 598, "start": 4786.2, "end": 4798.2, "text": "vor allem werden dann die dünnen Kabels bisschen warm, könnte ich mir vorstellen, das kann"}, {"id": 599, "start": 4798.2, "end": 4808.2, "text": "ja so nicht nur zweck der Sache sein, was ist denn so das stärkste, gibt es 5 Volt 100"}, {"id": 600, "start": 4808.2, "end": 4815.48, "text": "Ampere, oh das gibt es tatsächlich, du hättest so mit 200, kann auch durchaus sein, ich habe"}, {"id": 601, "start": 4815.48, "end": 4828.36, "text": "jetzt einfach irgendwie irgendwas mal gesagt, was viel ist, Power Supply, ne steht nicht"}, {"id": 602, "start": 4828.36, "end": 4857.56, "text": "da, der hat ein Github, stand da was von Github, hier, ach ne das sind die Files, also was"}, {"id": 603, "start": 4857.56, "end": 4861.76, "text": "das zieht, wird mich echt mal interessieren, wie gesagt vielleicht 100 200 Ampere, gibt"}, {"id": 604, "start": 4861.76, "end": 4867.08, "text": "es 5 Volt 200 Ampere Netzteile, was braucht man da für Kabel, was jetzt mal ernsthaft,"}, {"id": 605, "start": 4867.08, "end": 4871.64, "text": "ich hab davon ja, so Elektronik Sachen sind ja eh nicht so komplett meins, was für ein"}, {"id": 606, "start": 4871.64, "end": 4880.52, "text": "Kabel brauche ich denn überhaupt, dass ich da 200 Ampere drüber machen kann, oh bei"}, {"id": 607, "start": 4880.52, "end": 4887.16, "text": "AliExpress, oh das ist natürlich die beste, ich glaube der Ort an dem ich mir das kaufen"}, {"id": 608, "start": 4887.16, "end": 4897.6, "text": "will ist definitiv AliExpress, Mikrocontroler, oh nein, please nicht das Mikrocontroller"}, {"id": 609, "start": 4897.6, "end": 4918.48, "text": "Forum, monkaS, wetten die Antworten sind unter aller Sau, oh ne, geht schon los, das ist das"}, {"id": 610, "start": 4918.48, "end": 4943.44, "text": "schlimmste Forum was es gibt alter, was 14, 14 Quadrat Millimeter, das bedeutet ein 1,5"}, {"id": 611, "start": 4943.44, "end": 4961.6, "text": "Zentimeter großes, ne Moment, wie viel Millimeter sind Zentimeter, doch, doch oder, 10 Millimeter"}, {"id": 612, "start": 4961.6, "end": 4972.76, "text": "sind ein Zentimeter, das ist ja nicht wie Millisekunden, achso da hab ich, aber ein 1,4 Zentimeter"}, {"id": 613, "start": 4972.76, "end": 4982.52, "text": "dickes Kabel, das ist ja, das ist ja sag mal mal so, das ist kleiner Finger dick das Kabel,"}, {"id": 614, "start": 4982.52, "end": 5006.36, "text": "du brauchst nen Kabel wie mein kleiner Finger, oder nicht, ja das stimmt aber ich muss es"}, {"id": 615, "start": 5006.36, "end": 5017.12, "text": "ja irgendwo ans Netzteil anschließen, also zumindest am Netzteil brauch ich das, Leitungsquerschnitt"}, {"id": 616, "start": 5017.12, "end": 5028.84, "text": "berechnen, exellent, Kommentarfunktion geschlossen, oh ne, please jetzt nicht, nur noch eine Woche"}, {"id": 617, "start": 5028.84, "end": 5040.96, "text": "arbeiten, ich muss mal kurz gucken ob mein neues Video noch gut ankommt, ja ja, ja kommt"}, {"id": 618, "start": 5040.96, "end": 5045.36, "text": "gut an, ich hab es erst vor ein paar Stunden hochgeladen 12.000 Views, kann ich mich nicht"}, {"id": 619, "start": 5045.36, "end": 5061.04, "text": "beschweren, so gucken wir uns mal irgendwas an, was gucken wir uns den jetzt an, zeigt"}, {"id": 620, "start": 5061.04, "end": 5068.24, "text": "mal her, Homemade Cat Feeder, den gucken wir uns jetzt an, selbst gebaute Katzenfütter,"}, {"id": 621, "start": 5068.24, "end": 5077.32, "text": "Automatisierung, Stellz, Arduino kontrolliert, jawoll, auf gehts, das müssen wir jetzt angucken,"}, {"id": 622, "start": 5077.32, "end": 5079.16, "text": "Hacker News, ja da war heute nix spannendes."}, {"id": 623, "start": 5079.16, "end": 5099.16, "text": "Hey guys, I have two cats, one is named Yoko and the other one is named Johnny and sometimes"}, {"id": 624, "start": 5099.16, "end": 5115.64, "text": "we have to call each other Johnny, Johnny, Johnny, Johnny, Johnny, Johnny, Johnny, Johnny,"}, {"id": 625, "start": 5115.64, "end": 5131.16, "text": "Johnny, Zack!"}, {"id": 626, "start": 5131.16, "end": 5133.72, "text": "Jesus!"}, {"id": 627, "start": 5133.72, "end": 5142.12, "text": "funktioniert mit schicko funktioniert das nicht"}, {"id": 628, "start": 5146.52, "end": 5151.68, "text": "ok zeig ja das ist sehr laut das ist sehr laut sehr laut überspringen wir jetzt"}, {"id": 629, "start": 5151.68, "end": 5180.72, "text": "was meine katze machen würde die wird sich erschrecken sobald das geräusche macht die"}, {"id": 630, "start": 5180.72, "end": 5193.36, "text": "würde so machen und abhauen ok wir skippen mal ein bisschen vor"}, {"id": 631, "start": 5193.36, "end": 5204.64, "text": "ok das ding auszudrucken das dauert aber dauert wahrscheinlich schon mal zwei tage"}, {"id": 632, "start": 5204.64, "end": 5214.6, "text": "bei so groß ist das gar nicht wahrscheinlich vielleicht geht sogar in einem tach die leise"}, {"id": 633, "start": 5235.52, "end": 5238.8, "text": "und für weiter auf dieser bau welches die insite big play der und"}, {"id": 634, "start": 5238.8, "end": 5243.36, "text": "dies part will rotate inside and control the amount of food that will get out"}, {"id": 635, "start": 5243.36, "end": 5250.28, "text": "everything was printed with PLA material and without support a rotator I've used to"}, {"id": 636, "start": 5250.28, "end": 5258.92, "text": "parameters 20 percent infill a 0.25 millimeter layer height and 0.4 millimeter nozzle and that's"}, {"id": 637, "start": 5258.92, "end": 5264.52, "text": "it for the 3d printed parts okay together with these parts we need to use a servo motor like"}, {"id": 638, "start": 5264.52, "end": 5273.52, "text": "this one the mg 195 da könnte ich vielleicht den motor recyceln den ich in diesem"}, {"id": 639, "start": 5277.84, "end": 5282.2, "text": "ja wie hießen dieses gerät was wir uns letztens im stream angeguckt haben diesem"}, {"id": 640, "start": 5282.2, "end": 5289.92, "text": "automatischen ventil öffnen schließen konstrukt noch drinne habe könnte ich den motor für"}, {"id": 641, "start": 5289.92, "end": 5306.76, "text": "irgendwas verwenden noch das was wir kaputt gemacht haben das sieht aus wie das was man"}, {"id": 642, "start": 5306.76, "end": 5322.2, "text": "früher in inline skates drinne hatte beste beste leute wenn ihr 3d drucke habt und das und sowas"}, {"id": 643, "start": 5322.2, "end": 5331.92, "text": "nicht habt das ist das beste gadget was ihr braucht wenn ihr 3d drucke drucke macht und die"}, {"id": 644, "start": 5331.92, "end": 5337.12, "text": "miteinander verschrauben wollte beziehungsweise deckel oder so drauf machen wollte er hieltet"}, {"id": 645, "start": 5337.12, "end": 5349.96, "text": "insatz ne ja reddit insatz für 3d print das braucht man passt mal auf das ist massive"}, {"id": 646, "start": 5349.96, "end": 5364.52, "text": "big brain sack guten tag everybody moin stefan ja ja guck es euch an guck es euch an"}, {"id": 647, "start": 5364.52, "end": 5378.04, "text": "kolben holen und reinschmelzen wie man sieht ja gar nicht man schmelzt das man schmelzt"}, {"id": 648, "start": 5378.04, "end": 5384.2, "text": "das einfach rein guck man schmelzt das einfach rein und dann lässt man das kalt werden das zeug"}, {"id": 649, "start": 5384.2, "end": 5391.6, "text": "ist wirklich bomben fest ich habe das auch schon öfters verwendet man braucht doch nicht mal ein"}, {"id": 650, "start": 5391.6, "end": 5402.4, "text": "loch unten drunter aber ihr solltet das fenster aufmachen weil es ein bisschen stinkt und ihr"}, {"id": 651, "start": 5402.4, "end": 5410.36, "text": "solltet nicht ganz so heiß machen das ist wirklich nice also mit dass sie und du kannst"}, {"id": 652, "start": 5410.36, "end": 5415.44, "text": "halt danach schrauben und so reindrehen also kriegst viel besser teile miteinander verbunden als wenn"}, {"id": 653, "start": 5415.44, "end": 5421.2, "text": "man irgendwelche löscher in 3d print druckt und dann da schrauben durchdreht also das wirklich"}, {"id": 654, "start": 5421.2, "end": 5426.2, "text": "eines der besten eines der besten zusätzlichen sachen wenn man 3d drucke hat kostet ja auch"}, {"id": 655, "start": 5426.2, "end": 5452.44, "text": "nicht viel kostet ein paar euro das ist richtig park ja was für ein ding warum nicht einfach ntp"}, {"id": 656, "start": 5452.44, "end": 5458.92, "text": "das ding kommt doch ins wlan oder? ach nee im moment der arduino nano hat ja gar kein wlan"}, {"id": 657, "start": 5460.92, "end": 5464.56, "text": "weil akkubetrieben will man das doch eh nicht machen mit einem motor drin"}, {"id": 658, "start": 5467.04, "end": 5475.72, "text": "ich würde da einfach ein esp32 nehmen und ntp machen weil das ding eh ins wlan kommt"}, {"id": 659, "start": 5475.72, "end": 5486.88, "text": "also manchmal sind glaube ich die einfachen ansätze die besseren guck"}, {"id": 660, "start": 5486.88, "end": 5502.08, "text": "weil da macht er sogar strom dran da macht er sogar strom dran ntp wlan fertig ja das sind"}, {"id": 661, "start": 5502.08, "end": 5520.4, "text": "die steine da habe ich auch massig davon was super titte was das das ist ein kleber oder?"}, {"id": 662, "start": 5520.4, "end": 5536.92, "text": "ja ja das macht er auch nur jetzt weil er ein video davon macht ich habe mir das auch"}, {"id": 663, "start": 5536.92, "end": 5541.2, "text": "schon überlegt ob ich nicht irgendwie meine drucke teilweise ein bisschen schöner machen"}, {"id": 664, "start": 5541.2, "end": 5544.76, "text": "soll indem ich sie polieren mache ich nie mache ich nie ich habe das ausprobiert das"}, {"id": 665, "start": 5544.76, "end": 5559.76, "text": "funktioniert aber mache ich nicht wozu null ja beste hier sieht man es zack richtig rein"}, {"id": 666, "start": 5559.76, "end": 5573.24, "text": "stecken beste also da seht ihr dass die dinger sind wirklich nice und man denkt jetzt das hält"}, {"id": 667, "start": 5573.24, "end": 5578.16, "text": "auch nicht aber das zeug schmilzt dann wieder rein weil das ist ja wieder direkt darum und"}, {"id": 668, "start": 5578.16, "end": 5582.68, "text": "das zeug ist wirklich kriegt das nicht raus also wenn ihr das raus kriegen wollt da müsst"}, {"id": 669, "start": 5582.68, "end": 5589.64, "text": "ihr schon eine schraube reindrehen und an der anderen seite wirklich mit irgendwie schwerem"}, {"id": 670, "start": 5589.64, "end": 5596.16, "text": "werkzeug dran irgendwie einspannen und mit drehen oder so also ihr kriegt das definitiv"}, {"id": 671, "start": 5596.16, "end": 5603.32, "text": "nicht mit eurer normalen kraft im armen da wieder raus es sei denn ihr seid hier irgendwie"}, {"id": 672, "start": 5603.32, "end": 5610.64, "text": "der riesen muskelmann der ansonsten irgendwie auch 200 kilo oder hochhebt oder so meinetwegen"}, {"id": 673, "start": 5610.64, "end": 5615.56, "text": "vielleicht aber normalerweise kriegt ihr das nimmer raus und wir tun das selbe für die"}, {"id": 674, "start": 5615.56, "end": 5626.2, "text": "bottom part for the electronics case we had four insertion an chat im otte case with screws"}, {"id": 675, "start": 5626.2, "end": 5632.0, "text": "we will add the bearings on these holes later once we have the servo motor in place so now"}, {"id": 676, "start": 5632.0, "end": 5639.56, "text": "let's hack the servo motor servo motors usually can rotate 180 degrees i want to make this"}, {"id": 677, "start": 5639.56, "end": 5646.32, "text": "to rotate without stopping if we open any servo motor we will find some kind of feedback"}, {"id": 678, "start": 5646.32, "end": 5652.44, "text": "which usually is just a simple potentiometer so clearly that the motor is always in the"}, {"id": 679, "start": 5652.44, "end": 5658.36, "text": "middle position we need to replace this potentiometer with a fixed value resistor so i want to solar"}, {"id": 680, "start": 5658.36, "end": 5659.76, "text": "to resist this"}, {"id": 681, "start": 5659.76, "end": 5665.6, "text": "hätte jetzt mal ein mini floxer da wird sich das viel viel sauberer wieder anlöten lassen"}, {"id": 682, "start": 5665.6, "end": 5672.16, "text": "am ende in a voltage divider configuration and they must have the same value so we have"}, {"id": 683, "start": 5672.16, "end": 5676.32, "text": "a middle value in between ich mein nicht dass man dafür wirklich irgendwelches flussmittel"}, {"id": 684, "start": 5676.32, "end": 5683.16, "text": "bräuchte ne das ist dafür überhaupt nicht notwendig aber es wird trotzdem meistens"}, {"id": 685, "start": 5683.16, "end": 5690.52, "text": "schöner so i soldered them like this to the control pcb so now the dc motor should spin"}, {"id": 686, "start": 5690.52, "end": 5695.96, "text": "without stopping when we apply a pwm signal to it is all spinning but there is one more"}, {"id": 687, "start": 5695.96, "end": 5702.92, "text": "thing to do if you open the oh so viel kogast one of the gear has one pin and this is used"}, {"id": 688, "start": 5702.92, "end": 5707.08, "text": "to restrain the rotation to only 180 degrees so viele kogast hatten wir lange nicht mehr"}, {"id": 689, "start": 5707.08, "end": 5717.16, "text": "im stream so we could rotate freely 360 degrees and that's it we can now close back the motor"}, {"id": 690, "start": 5717.16, "end": 5721.56, "text": "and here i have it connected to the arduino and the potentiometer so as you can see i"}, {"id": 691, "start": 5721.56, "end": 5725.92, "text": "can still control the rotation direction but the servo will now rotate without stopping"}, {"id": 692, "start": 5725.92, "end": 5734.76, "text": "ok so now get the m3 threaded rod and cut it to around 20 cm if needed we can cut it"}, {"id": 693, "start": 5734.76, "end": 5743.08, "text": "shorter later we can screw this on the servo motor to fix it in place i will also add"}, {"id": 694, "start": 5743.08, "end": 5748.8, "text": "some entry nuts and tie them to the motor you could even apply some glue if you want"}, {"id": 695, "start": 5748.8, "end": 5755.66, "text": "immer schön heiß moment ist es überhaupt heißkleber macht er da some glue if you want"}, {"id": 696, "start": 5755.66, "end": 5761.8, "text": "you could even apply some glue if you want so eher so als sekundenkleber oder sowas"}, {"id": 697, "start": 5763.8, "end": 5768.84, "text": "ist es ist es der titty kleber den er eben gezeigt hat mit dem tollen namen"}, {"id": 698, "start": 5768.84, "end": 5777.16, "text": "im zweifelsfall also es gibt es gibt aber eine grundsätzliche regel wenn"}, {"id": 699, "start": 5777.16, "end": 5781.56, "text": "was nicht hält einfach heißkleber drauf als kleber ist die lösung für sehr viele"}, {"id": 700, "start": 5781.56, "end": 5788.76, "text": "probleme and the bearing and insert this entire setup inside of the plastic part and measure"}, {"id": 701, "start": 5788.76, "end": 5792.8, "text": "where that nut should be so the bearing will fit exactly oh guck mal wie gut das passt"}, {"id": 702, "start": 5792.8, "end": 5799.52, "text": "inside of the part and when you find a perfect position i add two more nuts and tie them to"}, {"id": 703, "start": 5799.52, "end": 5806.88, "text": "the bearing außer deine beziehung weiß ich hast du mal ausprobiert also ich hab da große erwartung"}, {"id": 704, "start": 5806.88, "end": 5812.16, "text": "immer in heißkleber als kleber hilft für fast alles now that the bearing is in place all is"}, {"id": 705, "start": 5812.16, "end": 5817.72, "text": "left to do is to add the feeder separator in between so place that feeder inside till you can see"}, {"id": 706, "start": 5817.72, "end": 5823.64, "text": "the insertion nuts to the hole so now we add a threaded rod and rotate it till the screw will"}, {"id": 707, "start": 5823.64, "end": 5831.52, "text": "get on the other side and on this other side we add another nut and tied it to the feeder"}, {"id": 708, "start": 5831.52, "end": 5838.56, "text": "inside so it won't get loose you could also add so man aber ganz schön viel geschraubt ich"}, {"id": 709, "start": 5838.56, "end": 5844.6, "text": "mag das ja wenn man 3d drucke mit ordentlich stabilen sachen kombiniert vieles 3d gedruckte"}, {"id": 710, "start": 5844.6, "end": 5853.36, "text": "ist halt oftmals ein bisschen wackelig vor allem wenn halt bewegliche teile 3d gedruckt sind die dann"}, {"id": 711, "start": 5853.36, "end": 5859.08, "text": "ineinander greifen ja ich habe jetzt zum beispiel schon leute gesehen die also sieht man auch in"}, {"id": 712, "start": 5859.08, "end": 5864.72, "text": "youtube videos die drucken dann zahnräder aus dem 3d drucker und machen die ineinander und das ist"}, {"id": 713, "start": 5864.72, "end": 5868.68, "text": "mir nichts also ich finde manchmal haben so metallteile schon ihre daseinsberechtigung"}, {"id": 714, "start": 5868.68, "end": 5877.24, "text": "an die second bearing we could add to more nuts and tighten them so dass es langfristig eben"}, {"id": 715, "start": 5877.24, "end": 5882.24, "text": "funktioniert und die other side we can also screen place the servo motor using entry nuts"}, {"id": 716, "start": 5882.24, "end": 5888.96, "text": "and insertion that we have added before now the feeder mechanism is ready and as you can see we"}, {"id": 717, "start": 5888.96, "end": 5895.12, "text": "can now rotate the feeder but after some tests I realized that we also need this part in place"}, {"id": 718, "start": 5895.12, "end": 5901.2, "text": "and we use this part so not all the food would get on top of the rotating feeder because that"}, {"id": 719, "start": 5901.2, "end": 5907.64, "text": "will block it in place like this we can control the flow of food so get this part and 3d printed"}, {"id": 720, "start": 5907.64, "end": 5915.56, "text": "wackelt ich sehe es genau dass es wackelt also warum er sich die mühe mit der batterie und der"}, {"id": 721, "start": 5915.56, "end": 5926.36, "text": "uhr macht verstehe ich nicht wie gesagt esp 32 nehmen ntp wlan fertig zumal das e ans netzteil"}, {"id": 722, "start": 5926.36, "end": 5931.92, "text": "anschließt ist connected to the servo and the real-time clock module and everything is supplied"}, {"id": 723, "start": 5931.92, "end": 5937.64, "text": "with 5 volts from the buck converter i also want to add three push buttons so we can change the time"}, {"id": 724, "start": 5937.64, "end": 5945.48, "text": "you can also save the battery so falling the schematic i connect everything to a prototyping pcb and add"}, {"id": 725, "start": 5945.48, "end": 5954.48, "text": "the arduino nano through hole pains champ outdated overrated so for the craft it is of course a"}, {"id": 726, "start": 5954.48, "end": 5960.0, "text": "great story but if you follow youtube videos they tell you that you have to order some ready-made"}, {"id": 727, "start": 5960.0, "end": 5968.44, "text": "putzding bei bcb way oder sonst was dir schon irgendwelche fertigen boards bestellen nee hat"}, {"id": 728, "start": 5968.44, "end": 5975.6, "text": "der wlan die die die arduino dinger also die die älteren arduino dinger haben alle keinen wlan aber"}, {"id": 729, "start": 5975.6, "end": 5982.92, "text": "es zwingt ihn ja keiner arduino zu verwenden in die rtc module ich weiß dass die batterie zum"}, {"id": 730, "start": 5982.92, "end": 5988.16, "text": "zum ur modul gehört aber man könnte sich das alles sparen indem man einfach was wlan fähiges"}, {"id": 731, "start": 5988.16, "end": 5996.56, "text": "nimmt weil man sehr eh schon in den steck vorzusteckt wlan ntp fertig i get the buck converter and i"}, {"id": 732, "start": 5996.56, "end": 6001.68, "text": "soldered the 5 volts connection als usv nee mit der batterie kannst du den motor gar nicht betreiben"}, {"id": 733, "start": 6001.68, "end": 6008.0, "text": "on the back then i added to the pcb to supply the digital parts hat eigentlich keinen sinn"}, {"id": 734, "start": 6008.0, "end": 6014.96, "text": "on one side of the electronics case i made a hole and i will add a jack connector like this one for"}, {"id": 735, "start": 6014.96, "end": 6021.76, "text": "the supply und wenn internet weg ist und wurde von aus fungel die kratz ntp ist ja nicht irgendwie"}, {"id": 736, "start": 6021.76, "end": 6033.4, "text": "so dass das instant out of sync ist du rufst dir per ntp ab und süngst dann konstant und wenn"}, {"id": 737, "start": 6033.4, "end": 6038.84, "text": "ein internet mal zwei drei tage weg ist selbst dann ist es nicht wirklich out of sync überhaupt kein"}, {"id": 738, "start": 6038.84, "end": 6052.44, "text": "problem i also make another hole on top and i pass the server wire to this hole i make the"}, {"id": 739, "start": 6052.44, "end": 6059.68, "text": "connections and fix the pcb inside of the case hat der sp nicht sogar eine clock in der clock"}, {"id": 740, "start": 6059.68, "end": 6069.0, "text": "on board der sp 32 doch der hat glaube ich sogar eine clock on board weil du kannst ja deep sleep"}, {"id": 741, "start": 6069.0, "end": 6075.6, "text": "timer machen und sowas hat die push buttons like this one here and i soldered wires to each for"}, {"id": 742, "start": 6075.6, "end": 6083.68, "text": "ground and then i connect them to the arduino so now i could close the case but first we need to"}, {"id": 743, "start": 6083.68, "end": 6089.84, "text": "upload vielleicht wollte das gerne selbst machen im arduino keine ahnung using the ds 32 32 library"}, {"id": 744, "start": 6089.84, "end": 6096.32, "text": "we get the real time and we store this time and the feeding time on the eeprom memory so even if i"}, {"id": 745, "start": 6096.32, "end": 6103.12, "text": "unplug the feeder we will still have the schedule saved onto the memory die on board lock wäre ihm"}, {"id": 746, "start": 6103.12, "end": 6110.4, "text": "nicht genau genug ok ich weiß nicht ob das wichtig ist für die katzen dass sie zur millisekunde genau"}, {"id": 747, "start": 6110.4, "end": 6116.6, "text": "gefüttert werden but we can select the portions of who to serve between one and ten fifteen twenty"}, {"id": 748, "start": 6116.6, "end": 6123.04, "text": "and back to one and using another push button we can select the time interval in hours from one to"}, {"id": 749, "start": 6123.04, "end": 6128.44, "text": "twenty four and using the third button okay das muss man sich nicht angucken ich will eigentlich"}, {"id": 750, "start": 6128.44, "end": 6133.6, "text": "sehen wie es funktioniert and when we get to that time we spin the motor for so long according to"}, {"id": 751, "start": 6133.6, "end": 6140.6, "text": "the portions and that's it we also send some notifications with the buzzer using analog right"}, {"id": 752, "start": 6140.6, "end": 6150.76, "text": "kein c++ 20 style painstamp und der macht es richtig der übertreibt sich mit c++ weil"}, {"id": 753, "start": 6150.76, "end": 6155.92, "text": "sobald du anfängst wirklich c++ features zu verwenden dann wird sie nach kurzer zeit auf"}, {"id": 754, "start": 6155.92, "end": 6163.8, "text": "den kick skin i finally decided to add a display as well leute ich habe die idee warum überhaupt ntp"}, {"id": 755, "start": 6163.8, "end": 6172.96, "text": "und warum überhaupt in the real-time clock einfach einen gps empfänger dran genauere zeit als über"}, {"id": 756, "start": 6172.96, "end": 6181.84, "text": "gps kannst du gar nicht holen einfach gps empfänger dran und urzeit beste so it will be easier to see"}, {"id": 757, "start": 6181.84, "end": 6188.56, "text": "the portions and the time so i connect this to the ice crazy pains on a4 and a5 include in place on"}, {"id": 758, "start": 6188.56, "end": 6195.24, "text": "the plastic case i would change the design of the case so it will already ah da macht sogar"}, {"id": 759, "start": 6195.24, "end": 6201.8, "text": "bedienung über knöpfe da dran ok das ist big brain übrigens das ist ein weiterer grund warum"}, {"id": 760, "start": 6201.8, "end": 6209.44, "text": "man esp 32 viel besser wäre wenn im esp 32 könntest du dir nämlich ins wlan hängen und das ganze über"}, {"id": 761, "start": 6209.44, "end": 6214.92, "text": "den web interface einstellen anstatt über irgendwelche knöpfchen but like this we can now see the"}, {"id": 762, "start": 6214.92, "end": 6219.52, "text": "portions and the time and not rely on the buzzer notification dann nehmen wir doch gleich ein atom"}, {"id": 763, "start": 6219.52, "end": 6230.52, "text": "oren modul naja es gibt sehr viele also zeitzeit sync dinger die über gps gehen also selbst wenn du"}, {"id": 764, "start": 6230.52, "end": 6237.68, "text": "eine ordentliche selbst wenn du eine ordentliche uhr nimmst die du so per funk singst das ist auch"}, {"id": 765, "start": 6237.68, "end": 6244.32, "text": "nicht genauer als gps also das kann sich kann sie nicht nicht beschweren das ist wirklich super"}, {"id": 766, "start": 6244.32, "end": 6250.68, "text": "und so gps modul kostet ja auch nicht viel also ganz ehrlich in dem fall ich hätte sp 32 dran"}, {"id": 767, "start": 6250.68, "end": 6256.44, "text": "gemacht jetzt in web interface zum einstellen wie die katz gefüttert werden soll so download the"}, {"id": 768, "start": 6256.44, "end": 6262.12, "text": "code from below and upload it to the arduino nano und mit esp 32 könntest du gar noch cloud ai und"}, {"id": 769, "start": 6262.12, "end": 6267.44, "text": "blockchain anbinden genau da könntest du nämlich automatisch lernen wann du deine katze am besten"}, {"id": 770, "start": 6267.44, "end": 6280.72, "text": "füttern solltest dann wir können die case mit m3 schrauben ai unterstützt wie auf der einen"}, {"id": 771, "start": 6280.72, "end": 6284.96, "text": "seite macht da überall so so coole dinge rein und hier wird die schraube einfach so durchgeschraubt"}, {"id": 772, "start": 6284.96, "end": 6296.84, "text": "was ist da los an da unten drunter sind wahrscheinlich die dinger das schienlernen"}, {"id": 773, "start": 6296.84, "end": 6309.76, "text": "kette wieder als nächstes wollen mich ein 50 billar pressing the first button we can change"}, {"id": 774, "start": 6309.76, "end": 6316.52, "text": "the portions glaube das sind zu wenig data points kein problem einfach genug diagonal"}, {"id": 775, "start": 6316.52, "end": 6324.88, "text": "skalieren dann geht das und daily scrum nicht vergessen und wenn wir get to that time dinner"}, {"id": 776, "start": 6324.88, "end": 6332.08, "text": "is served and the server will start rotating so ich meine coole coole idee ist das schon aber"}, {"id": 777, "start": 6332.08, "end": 6339.2, "text": "ich hätte es anders gemacht meine wird abhauen okay sie würde wegrennen i made this whole here so"}, {"id": 778, "start": 6339.2, "end": 6346.24, "text": "we can see the food level and inside we have to glue in place a transparent plastic film so i cut"}, {"id": 779, "start": 6346.24, "end": 6352.56, "text": "to size a plastic sheet and glue it in place like this we can see inside of the plastic aber gute"}, {"id": 780, "start": 6352.56, "end": 6360.64, "text": "idee gute idee finde ich gut wobei wisst ihr man hätte es jetzt noch etwas machen können"}, {"id": 781, "start": 6360.64, "end": 6366.64, "text": "märkte das mit einem ultra schall oder oder laser entfernung sensor könnte man das messen wie"}, {"id": 782, "start": 6366.64, "end": 6374.36, "text": "viel der stand ist ist also recommended to add a silica back like this one on top of this top"}, {"id": 783, "start": 6374.36, "end": 6380.48, "text": "plate so like this we can absorb the moisture and keep the food dry and that is quite important"}, {"id": 784, "start": 6380.48, "end": 6388.72, "text": "so now i can feel the hopper with dry food then we can use the ultra schall fällt aus wegen katze"}, {"id": 785, "start": 6388.72, "end": 6394.88, "text": "ja ist vielleicht wirklich das keine gute idee ja hast du recht da rennt sehr direkt weg dabei"}, {"id": 786, "start": 6394.88, "end": 6405.16, "text": "aber laser entfernungsmesser geht was die haper i add the ball below the feeder and i set the"}, {"id": 787, "start": 6405.16, "end": 6410.56, "text": "time to only 20 seconds in the code just for this test will ja dass die katze sich in auge"}, {"id": 788, "start": 6410.56, "end": 6417.88, "text": "aussticht oder was wisst ihr was man machen könnte man könnte wirklich eine waage drunter stellen da"}, {"id": 789, "start": 6417.88, "end": 6423.12, "text": "kann man die katze auch gleich noch messen die kann sie gleich noch wiegen ob sie nicht noch"}, {"id": 790, "start": 6423.12, "end": 6437.0, "text": "mehr pfiffet geworden ist ja oder genau einfach einfach tatsächlich wagemäßig load cell oder"}, {"id": 791, "start": 6437.0, "end": 6442.8, "text": "irgendwas für für gemischt messen ja wobei diese dinger sind ja selten für dauerbelastung gedacht"}, {"id": 792, "start": 6442.8, "end": 6450.2, "text": "die werden ja dauer mit dauerbelastung ungenauer wobei ich weiß ja nicht ob katzenfutter als"}, {"id": 793, "start": 6450.2, "end": 6469.56, "text": "belastung zählt man könnte sogar sagen wenn man nicht will dass die katze zunimmt kommt nur"}, {"id": 794, "start": 6469.56, "end": 6476.32, "text": "dann setzt man ein maximalgewicht das sagt man dann quasi wenn katze nur unter maximalgewicht"}, {"id": 795, "start": 6476.32, "end": 6481.44, "text": "ist und da kommt immer nur genau so viel essen raus bis zum maximalgewicht das heißt wenn man"}, {"id": 796, "start": 6481.44, "end": 6488.8, "text": "gesagt maximalgewicht fünf kilo und die katze wiegt 4900 da kommt 100 gram essen raus erst wenn"}, {"id": 797, "start": 6488.8, "end": 6493.32, "text": "die katze abgenommen hat gibt es wieder so viel essen dass sie dann quasi mit essen auf fünf"}, {"id": 798, "start": 6493.32, "end": 6501.72, "text": "kilometerwage kommt ich meine die katze treten steigt ihr aufs dach die mauz die mauz sich so"}, {"id": 799, "start": 6501.72, "end": 6505.68, "text": "sehr im flur ein ab wenn da nichts raus kommt und die wird dann auch sauer die haut das ding dann"}, {"id": 800, "start": 6505.68, "end": 6513.56, "text": "um und macht kaputt im zweifelsfall so the project works and now my cats will always have food i"}, {"id": 801, "start": 6513.56, "end": 6519.28, "text": "will leave this device running while i'm home as well for a few months so i'll make sure it"}, {"id": 802, "start": 6519.28, "end": 6529.36, "text": "doesn't fail maybe a future improvement is to make it based on batteries and using batteries so"}, {"id": 803, "start": 6529.36, "end": 6534.52, "text": "maybe that would be interesting ich würde es mit wehlein machen aber trotzdem an strom anschließen"}, {"id": 804, "start": 6534.52, "end": 6540.92, "text": "wireless mit akku ist ist halt dumm mit einem motor vor allem wenn es mehrfach am tach sich bewegt"}, {"id": 805, "start": 6540.92, "end": 6546.92, "text": "das ist kacke das geht so schnell her aber man könnte big brain time machen das in irgendeiner"}, {"id": 806, "start": 6546.92, "end": 6552.8, "text": "art und weise aufladen da noch mit irgendwie solar energie oder so aber im haus ist halt doof da"}, {"id": 807, "start": 6552.8, "end": 6559.16, "text": "scheint halt nicht die sonne another improvement would be maybe to add some suction ventos like"}, {"id": 808, "start": 6559.16, "end": 6563.44, "text": "this one below the support so the feeder will get zeigt er uns jetzt auch noch wie die katzen"}, {"id": 809, "start": 6563.44, "end": 6572.76, "text": "das fressen oder aber zum aufladen genau du machst hamster rad daneben die katze muss erst mal"}, {"id": 810, "start": 6572.76, "end": 6592.0, "text": "ordentlich rennen und erst wenn der akku voll ist kommt essen raus ich will jetzt ich will"}, {"id": 811, "start": 6592.0, "end": 6615.04, "text": "erzählen wie die katze angeht zeige ich die katze auf jetzt katzen wie kacke wait"}, {"id": 812, "start": 6622.36, "end": 6628.2, "text": "wir bekommen es noch nicht mal vorgeführt lasse mich raten das hat nicht funktioniert"}, {"id": 813, "start": 6628.2, "end": 6656.88, "text": "hat nicht funktioniert hat weit gibt es kacke weite emote kacke weite gibt es kacke weite ja"}, {"id": 814, "start": 6658.2, "end": 6668.08, "text": "us versus german players let's find out nein"}, {"id": 815, "start": 6668.08, "end": 6678.12, "text": "ok wir gucken uns jetzt noch dieses eine acht minuten video an zu battlefield 2042"}, {"id": 816, "start": 6678.12, "end": 6685.44, "text": "hier da ist please listen da bin mal gespannt was er sagt weil danach muss ich auch pennen schon"}, {"id": 817, "start": 6685.44, "end": 6697.92, "text": "spät ich glaube die haben ich glaube da ist hat ehrlich gesagt ziemliche zweifel gerade an"}, {"id": 818, "start": 6697.92, "end": 6721.0, "text": "ihrer eigenen fähigkeit das sieht man die letzten battlefields über den flieger an"}, {"id": 819, "start": 6721.0, "end": 6731.4, "text": "ja das stimmt ich finde es cool dass er battlefield 5 nicht erwähnt hat weil es ja ganz einfach"}, {"id": 820, "start": 6731.4, "end": 6750.76, "text": "battlefield 5 wenn man es einem nicht gefällt soll man es nicht kaufen ja da hat er recht"}, {"id": 821, "start": 6750.76, "end": 6771.04, "text": "ich habe jetzt von einigen leuten gehört noch ich lese das öfters auf twitter dass die leute"}, {"id": 822, "start": 6771.04, "end": 6776.52, "text": "angeblich richtig spaß am wenngarten multiplayer haben das ist eines der wenigen color duties was"}, {"id": 823, "start": 6776.52, "end": 6782.4, "text": "ich mir nicht gekauft habe weil es mich so überhaupt nicht gejuckt hat sie aber wie kann"}, {"id": 824, "start": 6782.4, "end": 6788.72, "text": "es spaß machen mit spmm spite changing things up wahrscheinlich reverse boosted alle it's"}, {"id": 825, "start": 6788.72, "end": 6795.72, "text": "breaking the mold of what previous battlefield games stuck to map size game modes classes"}, {"id": 826, "start": 6795.72, "end": 6802.2, "text": "in game gibt ja keine ich mein es hat keinen inhalt das spiel all out warfare hat zwei"}, {"id": 827, "start": 6802.2, "end": 6809.28, "text": "spielmodi breakthrough is crap auf der hälfte der maps das andere hat box hoch drei also"}, {"id": 828, "start": 6809.28, "end": 6834.24, "text": "ja das video ist so voll dick aufgetragen mit der aussprache her"}, {"id": 829, "start": 6834.24, "end": 6844.64, "text": "8 videos ich weiß dass er das nicht meint aber alle mit 8 videos immer ich kenne also"}, {"id": 830, "start": 6844.64, "end": 6849.14, "text": "ich habe viele videos jetzt gesehen auch zu diesem thema hier kann aus bdfield 42 angeht"}, {"id": 831, "start": 6849.14, "end": 6854.08, "text": "und das hatte klar da waren ein paar blöde kommentare aber das meiste ist eigentlich relativ"}, {"id": 832, "start": 6854.08, "end": 6860.76, "text": "sachliche kritik aber viele leute verkraften das einfach nicht für die für also ich hab"}, {"id": 833, "start": 6860.76, "end": 6865.92, "text": "hat den Eindruck, dass für viele Leute einfach normale Kritik heutzutage immer automatisch"}, {"id": 834, "start": 6865.92, "end": 6867.48, "text": "gleich Hate bedeutet."}, {"id": 835, "start": 6867.48, "end": 6896.84, "text": "Und wenn man das schon immer unterscheiden kann..."}, {"id": 836, "start": 6896.84, "end": 6925.2, "text": "Ja, geht mir genauso, Chet, ich hätte mir auch so gewünscht, dass das Game, ich wäre"}, {"id": 837, "start": 6925.2, "end": 6928.72, "text": "der glücklichste Gamer gewesen, seit langer Zeit mal wieder, wenn das Spiel richtig gut"}, {"id": 838, "start": 6928.72, "end": 6929.72, "text": "gewesen wäre."}, {"id": 839, "start": 6929.72, "end": 6949.64, "text": "Also, gerade die All-out-Warfare-Portionen, der Day One-Patch, der kommt am 19., fixt er"}, {"id": 840, "start": 6949.64, "end": 6953.48, "text": "vieles, wo soll ich das wissen, keine Ahnung, ich gehe davon aus, dass ein paar grobe Schnitzer"}, {"id": 841, "start": 6953.48, "end": 6959.44, "text": "gefixt sind, aber sag mal so, den Kern des Games, wo es was ja auch viele Probleme hat,"}, {"id": 842, "start": 6959.44, "end": 6960.44, "text": "wird er nicht fixen können."}, {"id": 843, "start": 6960.44, "end": 6961.44, "text": "Moment, was?"}, {"id": 844, "start": 6961.44, "end": 6962.44, "text": "Warte nochmal mal."}, {"id": 845, "start": 6962.44, "end": 6982.44, "text": "Achso, ja, die Concepts looken gut, ihre In-Game-Menüs in Battlefield 7, looken gut, ihre In-Game-Menüs"}, {"id": 846, "start": 6982.44, "end": 6984.16, "text": "in Battlefield 7, looken nicht gut."}, {"id": 847, "start": 7012.44, "end": 7026.36, "text": "Ich finde, Voice-Chat ist eine coole Sache, ja, aber es ist so inkonsequent oder so undurchdacht."}, {"id": 848, "start": 7026.36, "end": 7031.6, "text": "Voice-Chat, ja, also ich bin sofort, die sollen sofort Voice-Chat einbauen, habe ich kein"}, {"id": 849, "start": 7031.6, "end": 7038.2, "text": "Problem mit, aber dann, dass die Teams nicht bestehen bleiben nach der Runde, das heißt,"}, {"id": 850, "start": 7038.2, "end": 7043.72, "text": "du machst das Game anonymer und mit Voice-Chat wieder entanonymisierst du es, du willst"}, {"id": 851, "start": 7043.72, "end": 7047.68, "text": "doch, stell dir mal vor, du bist mit jemand hier in der Lobby am Start und ihr versteht"}, {"id": 852, "start": 7047.68, "end": 7054.24, "text": "euch gut und ihr labert In-Game-Voice, Team läuft gut und ihr werdet einfach direkt rausgeschmissen"}, {"id": 853, "start": 7054.24, "end": 7059.04, "text": "nach der Runde, dann müsst ihr euch adden und könnt zusammen neu suchen und so was,"}, {"id": 854, "start": 7059.04, "end": 7062.36, "text": "ja, aber das ist doch doof, warum bleiben die Squats nicht einfach bestehen?"}, {"id": 855, "start": 7062.36, "end": 7067.2, "text": "Klar, ich weiß, warum das so ist, weil es irgendwelche Kacknoobs davon abhalten könnte,"}, {"id": 856, "start": 7067.2, "end": 7070.28, "text": "um das Spiel länger zu spielen und wenn sie das Spiel nicht länger spielen, kaufen sie"}, {"id": 857, "start": 7070.28, "end": 7079.36, "text": "keine Microtransaction-Season-Passes oder sonst was, ja, und sie brauchen es natürlich"}, {"id": 858, "start": 7079.36, "end": 7085.4, "text": "für ihr angeblich nicht vorhandenes SBMM, das brauchen sie ja auch, aber ich sage euch,"}, {"id": 859, "start": 7085.4, "end": 7090.52, "text": "das ist echte, ich habe es von Anfang an prediktet mit dem Server-Browser, dass es keinen gibt"}, {"id": 860, "start": 7090.52, "end": 7095.52, "text": "und es wird nicht lange dauern, dass rauskommt, dass dieses Spiel auch SBMM hat, ich sage"}, {"id": 861, "start": 7095.52, "end": 7102.44, "text": "euch, so wie es ist, und da gibt es Leute, die sagen, Max, mit 128 Spielern geht das"}, {"id": 862, "start": 7102.44, "end": 7107.52, "text": "gar nicht mit SBMM, natürlich funktioniert das, das mag vielleicht nicht so detailliert"}, {"id": 863, "start": 7107.52, "end": 7113.32, "text": "funktionieren, aber du kannst im Prinzip alles mehr oder weniger scalen von klein und funktioniert"}, {"id": 864, "start": 7113.32, "end": 7117.04, "text": "ziemlich gut, so ein bisschen größer funktioniert noch halbwegs passabel, musst du ja auch"}, {"id": 865, "start": 7117.04, "end": 7121.48, "text": "gar nicht mit 128 Spielern, das muss ja gar nicht so genau gefeintuned sein, es gibt keinen"}, {"id": 866, "start": 7121.48, "end": 7125.6, "text": "Server-Browser, nein, gibt es nicht, in Portal gibt es einen Server-Browser, aber das ist"}, {"id": 867, "start": 7125.6, "end": 7133.76, "text": "überhaupt kein Ersatz für den Kernspielmodus, der keinen Server-Browser hat, diese All-of-Warfare-Geschichte"}, {"id": 868, "start": 7133.76, "end": 7137.32, "text": "hat keinen Server-Browser, nein, und ich habe es prediktet, vor über einem Jahr habe ich"}, {"id": 869, "start": 7137.32, "end": 7142.68, "text": "ein Video zugemacht, da haben alle so, nein, Max, das kann überhaupt nicht sein, war Battlefield"}, {"id": 870, "start": 7142.68, "end": 7148.32, "text": "00 Server-Browser, nein, nein, da wird es niemals, es wird sein, ich kann euch das aber auch,"}, {"id": 871, "start": 7148.32, "end": 7155.28, "text": "ich kann euch das instant sagen, ob es SBMM gibt, nämlich am 19., ich habe jetzt ja relativ"}, {"id": 872, "start": 7155.28, "end": 7160.48, "text": "viel gespielt, ich glaube, zum größten Teil auch ganz brauchbar, bestimmt nicht super"}, {"id": 873, "start": 7160.48, "end": 7167.48, "text": "krass Elite-Stells, aber ganz brauchbar, wenn ich am 19. nicht alles voller Noobs habe,"}, {"id": 874, "start": 7167.48, "end": 7169.04, "text": "dann gibt es SBMM, ganz einfach."}, {"id": 875, "start": 7169.04, "end": 7179.08, "text": "Joa, Bock ist auch nicht tamam."}, {"id": 876, "start": 7179.08, "end": 7186.64, "text": "Joa, gibt es nicht."}, {"id": 877, "start": 7186.64, "end": 7189.64, "text": "Wenn das das ist, was du tun willst, dann geh für es."}, {"id": 878, "start": 7189.64, "end": 7191.64, "text": "Wir müssen es einfach anstecken."}, {"id": 879, "start": 7191.64, "end": 7194.64, "text": "Aber wirklich, die meisten dieser Dinge sollten nur in der Spielzeit sein."}, {"id": 880, "start": 7194.64, "end": 7196.64, "text": "Ich meine, eine Statistik-Page."}, {"id": 881, "start": 7196.64, "end": 7198.64, "text": "Das kann sein, weil es eine artistische Richtung ist."}, {"id": 882, "start": 7198.64, "end": 7200.64, "text": "Das sollte einfach ein Ding sein."}, {"id": 883, "start": 7200.64, "end": 7201.64, "text": "Lieber Dice,"}, {"id": 884, "start": 7201.64, "end": 7203.64, "text": "nehmt nicht den Fuß des Acceleratores."}, {"id": 885, "start": 7203.64, "end": 7204.64, "text": "Bitte."}, {"id": 886, "start": 7204.64, "end": 7206.64, "text": "Das hat mit Battlefield V passiert."}, {"id": 887, "start": 7206.64, "end": 7209.64, "text": "Und mit den Weihnachten, die nach Weihnachten kommen,"}, {"id": 888, "start": 7209.64, "end": 7211.64, "text": "bin ich ein wenig versorgt."}, {"id": 889, "start": 7211.64, "end": 7212.64, "text": "Das wird langsam."}, {"id": 890, "start": 7212.64, "end": 7219.64, "text": "Eine Menge Zeit und Effort wurde über die letzten drei oder so Jahre in diesem Spiel gespielt."}, {"id": 891, "start": 7219.64, "end": 7222.64, "text": "Und um die meisten von hierher zu kommen,"}, {"id": 892, "start": 7222.64, "end": 7225.64, "text": "ist ein riesiges Erlebnis."}, {"id": 893, "start": 7225.64, "end": 7239.64, "text": "Ich kann es schlecht einschätzen, wie krass die Herausforderung ist, Corona Homeoffice für Spieleentwickler."}, {"id": 894, "start": 7239.64, "end": 7243.64, "text": "Aber ich übertrag das mal so ein bisschen auf das bei uns."}, {"id": 895, "start": 7243.64, "end": 7247.64, "text": "Ob ich jetzt den ganzen Tag am Rechner auf der Arbeit sitze oder am ganzen Tag am Rechner daheim."}, {"id": 896, "start": 7247.64, "end": 7250.64, "text": "In der Regel klappt das daheim sogar besser."}, {"id": 897, "start": 7250.64, "end": 7259.64, "text": "Und ich bin mir nicht sicher, ob es die Herausforderung so sehr steigert"}, {"id": 898, "start": 7259.64, "end": 7281.64, "text": "für die Spieleentwicklung, wenn die Leute von daheim arbeiten."}, {"id": 899, "start": 7281.64, "end": 7289.64, "text": "Ja, nur weil es zwar ab und zu Level 1 gibt. Gut, die können ja reingeworfen werden zum Testen."}, {"id": 900, "start": 7289.64, "end": 7292.64, "text": "Mittlerweile bin ich eher der Meinung, ich würde wundern, wenn es nicht sowas gibt."}, {"id": 901, "start": 7292.64, "end": 7294.64, "text": "Das kann ja sein, dass es nicht so krass wie in Call of Duty ist,"}, {"id": 902, "start": 7294.64, "end": 7297.64, "text": "aber mich würde wundern, wenn es sowas nicht gibt."}, {"id": 903, "start": 7297.64, "end": 7303.64, "text": "Was bringt die ganze Anonymisierung von Scoreboard wegmachen und sonstige Geschichten,"}, {"id": 904, "start": 7303.64, "end": 7311.64, "text": "wenn man nicht im Zuge dessen eben solche Noob-Schutz-Mechanismen wie SBMM einführt?"}, {"id": 905, "start": 7311.64, "end": 7314.64, "text": "Also warum sollte man das eine ohne das andere machen?"}, {"id": 906, "start": 7314.64, "end": 7327.64, "text": "Oder warum sollte man das überhaupt einbauen, wenn nicht als Voraussetzung dafür?"}, {"id": 907, "start": 7327.64, "end": 7331.64, "text": "Nö, das Game hat keinen Inhalt."}, {"id": 908, "start": 7331.64, "end": 7358.64, "text": "Nein, sowohl Hazard Zone als auch Portal ist kein Ersatz für das Kern Battlefield."}, {"id": 909, "start": 7358.64, "end": 7361.64, "text": "Sie sind doch nicht incredible, die haben das Game mega verkackt."}, {"id": 910, "start": 7361.64, "end": 7371.64, "text": "Das ist so ein typisches Video, der muss es so super freundlich Kleinigkeiten auferhypen,"}, {"id": 911, "start": 7371.64, "end": 7390.64, "text": "damit die ganzen Ultra-Fanboys ihm nicht aufs Dach steigen."}, {"id": 912, "start": 7390.64, "end": 7398.64, "text": "Das Spiel kann schon wirklich Bock machen, das will ich auch gar nicht mal bestreiten,"}, {"id": 913, "start": 7398.64, "end": 7404.64, "text": "aber ich sehe das Gold unter der Oberfläche nicht bei Battlefield 2042,"}, {"id": 914, "start": 7404.64, "end": 7431.64, "text": "wohingegen ich es bei Battlefield 4 gesehen habe, trotz verbacktem Kack am Anfang."}, {"id": 915, "start": 7431.64, "end": 7436.64, "text": "Guckt euch doch nur mal die Maps an, das ist einfach offen zu 90% Gelände,"}, {"id": 916, "start": 7436.64, "end": 7441.64, "text": "diese Sachen, diese Hotspots hier mit den Gebäuden, das kann schon wirklich Bock machen,"}, {"id": 917, "start": 7441.64, "end": 7446.64, "text": "aber die ganzen anderen Sachen sind in Conquest quasi entweder, also aktuell,"}, {"id": 918, "start": 7446.64, "end": 7453.64, "text": "entweder fährst du mit dem Hovercraft rum oder die Helis zerficken dich instant."}, {"id": 919, "start": 7453.64, "end": 7457.64, "text": "So läuft es aktuell in Conquest."}, {"id": 920, "start": 7457.64, "end": 7463.64, "text": "Und im Prinzip hat in Conquest nur die Seite Spaß mit Luftüberlegenheit,"}, {"id": 921, "start": 7463.64, "end": 7471.64, "text": "weil es gibt einfach nichts, wo du dich irgendwie, du hast ja mal da Häuschen"}, {"id": 922, "start": 7471.64, "end": 7474.64, "text": "und da mal irgendwie eine Lagerhalle, du kannst ja nicht die ganze,"}, {"id": 923, "start": 7474.64, "end": 7483.64, "text": "du willst doch nicht die ganze Runde um eine Lagerhalle spielen in Conquest."}, {"id": 924, "start": 7483.64, "end": 7489.64, "text": "Also 2042 von der Grafik nicht so nice aus wie Battlefield 4, naja doch,"}, {"id": 925, "start": 7489.64, "end": 7495.64, "text": "es sieht schon gut aus, die Sache ist nur die, dass es detailarm ist, wie ich finde."}, {"id": 926, "start": 7495.64, "end": 7500.64, "text": "Also der grafische Unterbau, also das Frostbite Gerüst ist schon echt gut,"}, {"id": 927, "start": 7500.64, "end": 7504.64, "text": "kannst dir nichts sagen, aber es ist halt sehr detailarm."}, {"id": 928, "start": 7504.64, "end": 7513.64, "text": "Also es wirkt halt so, als bräuchten die Maps noch bestimmt ein halbes Jahr"}, {"id": 929, "start": 7513.64, "end": 7517.64, "text": "intern bisschen Iterationen und Ausprobieren und Fine-Tuning"}, {"id": 930, "start": 7517.64, "end": 7519.64, "text": "und vor allem eben auch ein bisschen mehr Liebe zum Detail."}, {"id": 931, "start": 7519.64, "end": 7524.64, "text": "Ja es hat, ich meine guckt euch mal die Brücke in Kaleidoskop an,"}, {"id": 932, "start": 7524.64, "end": 7526.64, "text": "das ist ein leerer Betonblock."}, {"id": 933, "start": 7526.64, "end": 7530.64, "text": "Weiß ich, ob man das hier irgendwo sieht, ob hier irgendwo die Brücke"}, {"id": 934, "start": 7530.64, "end": 7532.64, "text": "hoch und runter gefahren wird im Video?"}, {"id": 935, "start": 7532.64, "end": 7545.64, "text": "Hier, guckt euch das an, das ist eine fucking Brücke, was ist das?"}, {"id": 936, "start": 7545.64, "end": 7553.64, "text": "Das sieht aus wie ein Block aus Unreal 1, das soll eine Brücke sein."}, {"id": 937, "start": 7553.64, "end": 7560.64, "text": "Das hat kein Geländer, das hat keine richtige Straße, das hat nichts."}, {"id": 938, "start": 7560.64, "end": 7567.64, "text": "Das ist, und irgendwie klitscht es hier auch gerade raus, das ist ein Block aus Half-Life 1."}, {"id": 939, "start": 7567.64, "end": 7575.64, "text": "Das ist gerade auch ernsthaft, doch ich sag nichts, es hat anscheinend wirklich ein Geländer."}, {"id": 940, "start": 7575.64, "end": 7577.64, "text": "Das ist doch kein, nee."}, {"id": 941, "start": 7577.64, "end": 7587.64, "text": "Das sieht aus wie eine Xbox 3, wie eine Xbox 1 Brücke, also die Xbox 0 Brücke."}, {"id": 942, "start": 7587.64, "end": 7593.64, "text": "The PC Performance in particular FPS on high settings."}, {"id": 943, "start": 7593.64, "end": 7599.64, "text": "General bug fixes and optimization on PC, I think it's okay on console,"}, {"id": 944, "start": 7599.64, "end": 7605.64, "text": "but on PC at least it just has to be a priority right now, it's crazy."}, {"id": 945, "start": 7605.64, "end": 7609.64, "text": "It nearly makes some maps unplayable like Manifest."}, {"id": 946, "start": 7609.64, "end": 7614.64, "text": "Add back in some of those legacy features the online community is crying out for."}, {"id": 947, "start": 7614.64, "end": 7619.64, "text": "Maybe have another look at the real core of the multiplayer experience."}, {"id": 948, "start": 7619.64, "end": 7622.64, "text": "By the way, Panzerplatten nerven mich übrigens auch ziemlich,"}, {"id": 949, "start": 7622.64, "end": 7625.64, "text": "weil du nicht mehr predikten kannst, wann Gegner downgehen."}, {"id": 950, "start": 7625.64, "end": 7628.64, "text": "Anything can be tweaked to make it more familiar on the surface level."}, {"id": 951, "start": 7628.64, "end": 7633.64, "text": "Keep the gameplay loop, I think most of the experience is really good fun."}, {"id": 952, "start": 7633.64, "end": 7638.64, "text": "The sandbox nature of everything is really in the spotlight with 2042."}, {"id": 953, "start": 7638.64, "end": 7641.64, "text": "And fans are definitely having fun."}, {"id": 954, "start": 7641.64, "end": 7645.64, "text": "I just think a little more should be done to smooth out those edges"}, {"id": 955, "start": 7645.64, "end": 7649.64, "text": "and really nail what the Battlefield experience is supposed to be."}, {"id": 956, "start": 7649.64, "end": 7652.64, "text": "Das Game muss quasi nochmal zur Hälfte komplett überarbeitet werden,"}, {"id": 957, "start": 7652.64, "end": 7654.64, "text": "dass da was Gutes rauskommt."}, {"id": 958, "start": 7654.64, "end": 7657.64, "text": "Nicht sagen, dass es little more ist."}, {"id": 959, "start": 7657.64, "end": 7661.64, "text": "Granted, most of it isn't constructive, but behind it all is a point of shock."}, {"id": 960, "start": 7661.64, "end": 7664.64, "text": "Warum schaffen sie es sich so was wie Battlefield 3 aufzustellen, nur moderner?"}, {"id": 961, "start": 7664.64, "end": 7668.64, "text": "Weil die glaube ich einfach keine Leute mehr haben, die das passende Gespür dafür haben."}, {"id": 962, "start": 7668.64, "end": 7672.64, "text": "Und das kommt wahrscheinlich noch dazu, weil wir in anderen Zeiten leben."}, {"id": 963, "start": 7672.64, "end": 7677.64, "text": "Wahrscheinlich Management und oberes Management und noch höheres Management"}, {"id": 964, "start": 7677.64, "end": 7679.64, "text": "und dann kommt wahrscheinlich Bobby selbst vorbei."}, {"id": 965, "start": 7679.64, "end": 7682.64, "text": "Moment, wir sind ja bei EA, wir sind ja nicht bei Activision."}, {"id": 966, "start": 7682.64, "end": 7687.64, "text": "Oberstonkstyp selbst vorbei und sagt das und das muss aber sein"}, {"id": 967, "start": 7687.64, "end": 7689.64, "text": "und die Leute sagen ja Moment, das passt überhaupt nicht in unser Design,"}, {"id": 968, "start": 7689.64, "end": 7692.64, "text": "dann sagt er mir doch scheißegal."}, {"id": 969, "start": 7692.64, "end": 7694.64, "text": "Ja, das ist so eine Kombination aus allem."}, {"id": 970, "start": 7694.64, "end": 7700.64, "text": "Zu viel Stonksleute, die mitreden und wahrscheinlich tatsächlich auch zu viele Leute,"}, {"id": 971, "start": 7700.64, "end": 7707.64, "text": "die oder zu wenige Leute, die noch wissen, was richtiges Battlefield ausmacht."}, {"id": 972, "start": 7707.64, "end": 7712.64, "text": "Ich meine, hier ist nichts drinne in den Räumen."}, {"id": 973, "start": 7712.64, "end": 7715.64, "text": "Das ist einfach leer."}, {"id": 974, "start": 7715.64, "end": 7720.64, "text": "Hier oben an der Decke siehst du, die können, wenn sie wollen."}, {"id": 975, "start": 7720.64, "end": 7724.64, "text": "Aber was ich meine, hier ist nichts drinne."}, {"id": 976, "start": 7724.64, "end": 7727.64, "text": "Das ist einfach leer."}, {"id": 977, "start": 7727.64, "end": 7731.64, "text": "Hier oben an der Decke siehst du, die können, wenn sie wollen."}, {"id": 978, "start": 7731.64, "end": 7734.64, "text": "Aber was ich meine, hier ist nichts drinne."}, {"id": 979, "start": 7734.64, "end": 7737.64, "text": "Das ist einfach leer."}, {"id": 980, "start": 7737.64, "end": 7740.64, "text": "Hier oben an der Decke siehst du, die können, wenn sie wollen."}, {"id": 981, "start": 7740.64, "end": 7744.64, "text": "Aber was ich meine, hier ist einfach nichts drinne."}, {"id": 982, "start": 7744.64, "end": 7748.64, "text": "Vor allem, warum ist das ein Rechenzentrum mit RGB-Räumen?"}, {"id": 983, "start": 7748.64, "end": 7751.64, "text": "Hier ist einfach nichts drinne."}, {"id": 984, "start": 7751.64, "end": 7768.64, "text": "Das soll eine Kunstgalerie sein, ja ok."}, {"id": 985, "start": 7768.64, "end": 7771.64, "text": "Krass moderne Kunst."}, {"id": 986, "start": 7771.64, "end": 7786.64, "text": "Da habe ich jetzt mal eine Pflanze gesehen."}, {"id": 987, "start": 7786.64, "end": 7794.64, "text": "Das sieht so steril aus."}, {"id": 988, "start": 7794.64, "end": 7797.64, "text": "Ich meine, nur mal zur Erinnerung."}, {"id": 989, "start": 7797.64, "end": 7808.64, "text": "Und die Battlefield 3-Maps waren definitiv kein Wunder der Detailverliebtheit."}, {"id": 990, "start": 7808.64, "end": 7812.64, "text": "Das war aber damals auch schlicht und ergreifend, also erstens mal dem Gameplay geschuldet."}, {"id": 991, "start": 7812.64, "end": 7815.64, "text": "Man wollte wahrscheinlich nicht zu viel reinstellen oder sonst wie."}, {"id": 992, "start": 7815.64, "end": 7817.64, "text": "Aber das war gar nicht das Problem."}, {"id": 993, "start": 7817.64, "end": 7824.64, "text": "Das Hauptproblem war wahrscheinlich eher, dass es eben auf der Xbox 360 sonst was wie laufen musste."}, {"id": 994, "start": 7824.64, "end": 7827.64, "text": "Ich meine vergleicht mal Siebertower damit."}, {"id": 995, "start": 7827.64, "end": 7834.64, "text": "Guck mal, der sieht wenigstens in irgendeiner Art und Weise nach Büro aus."}, {"id": 996, "start": 7834.64, "end": 7837.64, "text": "Das ist auch sehr steril, klar."}, {"id": 997, "start": 7837.64, "end": 7846.64, "text": "Aber das ist ein Xbox 360 Game."}, {"id": 998, "start": 7846.64, "end": 7853.64, "text": "Aber das geht als Bürogebäude durch."}, {"id": 999, "start": 7853.64, "end": 7856.64, "text": "Da hast du ein Klo."}, {"id": 1000, "start": 7856.64, "end": 7862.64, "text": "Da kannst du Peppupupu machen drauf."}, {"id": 1001, "start": 7862.64, "end": 7865.64, "text": "Du hast irgendwo einen Pool."}, {"id": 1002, "start": 7865.64, "end": 7869.64, "text": "Also klar, man sieht schon, der Style ist relativ ähnlich tatsächlich."}, {"id": 1003, "start": 7869.64, "end": 7872.64, "text": "Aber hier ist halt was da."}, {"id": 1004, "start": 7872.64, "end": 7875.64, "text": "Hier hast du diese Sonnenbänke und sowas, was auch immer die da machen."}, {"id": 1005, "start": 7875.64, "end": 7878.64, "text": "Da ist halt was da."}, {"id": 1006, "start": 7878.64, "end": 7881.64, "text": "Ja hier das Zeug, das sieht nach einem Gebäude aus."}, {"id": 1007, "start": 7881.64, "end": 7883.64, "text": "Das macht auch nicht wirklich Sinn."}, {"id": 1008, "start": 7883.64, "end": 7884.64, "text": "Das sieht halt nach einem Halbweg."}, {"id": 1009, "start": 7884.64, "end": 7885.64, "text": "Guckt euch das mal an."}, {"id": 1010, "start": 7885.64, "end": 7886.64, "text": "Hier steht mehr."}, {"id": 1011, "start": 7886.64, "end": 7898.64, "text": "Hier ist mehr drauf als in dem ganzen Korridor des gesamten Gebäudes in BF2042."}, {"id": 1012, "start": 7898.64, "end": 7904.64, "text": "Und das ist ein Xbox 360 Game."}, {"id": 1013, "start": 7904.64, "end": 7914.64, "text": "Den hat einfach die Zeit gefehlt."}, {"id": 1014, "start": 7914.64, "end": 7917.64, "text": "Muss ich jetzt einfach mal loswerden."}, {"id": 1015, "start": 7917.64, "end": 7919.64, "text": "Da muss noch sehr, sehr viel gemacht werden."}, {"id": 1016, "start": 7919.64, "end": 7922.64, "text": "Auch vieles im Kern nochmal überarbeitet werden."}, {"id": 1017, "start": 7922.64, "end": 7928.64, "text": "Es ist nicht nur Feintuning und Balancing, was da gemacht werden muss."}, {"id": 1018, "start": 7928.64, "end": 7930.64, "text": "Bellevue 3 Grafik ist zeitlos."}, {"id": 1019, "start": 7930.64, "end": 7932.64, "text": "Ja, das stimmt."}, {"id": 1020, "start": 7932.64, "end": 7948.64, "text": "Ja, schon ziemlich."}, {"id": 1021, "start": 7948.64, "end": 7949.64, "text": "Okay."}, {"id": 1022, "start": 7949.64, "end": 7952.64, "text": "Leute, ich glaube, ich gehe jetzt auf."}, {"id": 1023, "start": 7952.64, "end": 7955.64, "text": "Schon spät."}, {"id": 1024, "start": 7955.64, "end": 7958.64, "text": "Bedgetime."}, {"id": 1025, "start": 7958.64, "end": 7968.64, "text": "Liegt gerade, ob ich noch irgendjemand hosten soll."}, {"id": 1026, "start": 7968.64, "end": 7970.64, "text": "Witzig."}, {"id": 1027, "start": 7970.64, "end": 7975.64, "text": "Ein anderer Battlefield-Streamer, den ich ab und zu gucke, spielt wieder Battlefield 3."}, {"id": 1028, "start": 7975.64, "end": 7976.64, "text": "Null W."}, {"id": 1029, "start": 7976.64, "end": 7986.64, "text": "War ja klar."}, {"id": 1030, "start": 7986.64, "end": 7988.64, "text": "Keine Ahnung."}, {"id": 1031, "start": 7988.64, "end": 7990.64, "text": "Tauscht jetzt keinen."}, {"id": 1032, "start": 7990.64, "end": 7992.64, "text": "Also ich gehe ins Bett, Leute."}, {"id": 1033, "start": 7992.64, "end": 7993.64, "text": "Wir sehen uns."}, {"id": 1034, "start": 7993.64, "end": 7994.64, "text": "Bis denn."}, {"id": 1035, "start": 7994.64, "end": 7995.64, "text": "Macht's gut."}, {"id": 1036, "start": 7995.64, "end": 8017.64, "text": "Tschüss."}]}