{"text": "So, jetzt gucken wir uns mal den angeblichen russischen Battlefield Killer an.Ich habe das Spiel mir schon mal angeschaut vor zwei Jahren oder so und ich muss sagen,ich habe da nicht allzu viel eines Battlefield Killers erkannt, aber es gibt ja Leute die behaupten,dass World War 3 das bessere Battlefield ist. Gut, ich meine das ist bei Battlefield 2042 auchnicht schwer, aber das Spiel war ja schon am Start bevor es Battlefield 2042 überhaupt gegeben hat.So, ups. Und danach gucken wir uns den aktuellen Battlefield Patch an und spielen vielleichtpaar Runden oder was heißt vielleicht relativ sicher. Eins, zwei Runden vielleicht auch mehrwenn es Bock macht Battlefield, aber ich fürchte da wird nicht allzu viel gefixt.Ach Wub Arrive Moment, das mache ich jetzt gerade mal in die in die Sack. Wub Arrive kommt jetztdirekt in die GIFs rein. Wub Arrive. Das machen wir jetzt gleich, ich mache jetzt die Emotes rein.Community, oh das ist so verkackt. Partner, ich finde das immer nicht. Emotes, besuchensie die Emotes Website. Animierte Emotes. GIF hochladen. Wub Arrive. Schauen wir mal ob es jetztfunktioniert. Ja, nice, funktioniert. So passt. Das Ding soll heißen Wub Arrive und jetzt sagen wir hochladen.Wub Arrive ist am Start, probiert mal. Refresh wollen wir, wir refreshen mal Chat. Chat, ChatRefreshen, hier Refreshen, alles Refreshen. Jetzt probieren wir es gleich nochmal. Also laut Twitch ist es drinne. Wub, Wub, Wub Arrive. Ey! Funktioniert.Nice. Fock. Wie viele Tabs willst du auf einen Moment, Moment, wenn du denkst das sind viele Tabs.Wir haben ja noch, wir haben ja noch mehr Tabs, das war es ja noch nicht. Außerdem, ich meine,ich muss noch meine 32G RAM irgendwie sinnvoll voll kriegen. Wie kommt euch gerade mein aktuellesVideo an? Ich habe das ja vor einer halben Stunde oder so erst freigeschaltet. Ich habe gar nichtmehr reingeguckt seit einer Weile. Dislike Anzeigen wieder herstellen. Dislike. Die meisten Leute inDeutschland denken mit dem Dislike, damit SS. Gedisst. Gedisterlike. Das Gedisst, man.Ich finde es so lustig. Die Leute, die hier, die hier öfters im Stream am Start sind, die fangenschon immer an, so mein, mein bescheuertes Twitch-Speak zu reden. Ist halt, ist halt schon schlimm,Alter. Die Stunks gehen hoch für dieses Video, Kappa. Da weißt du, weißt du Bescheid. Da weißtdu Bescheid. Joa, wir müssen es nehmen hier am Start. Gucken wir uns jetzt mal an. Alter, gut,das kann man zumachen. Ich weiß gar nicht, wo läuft denn die Musik aktuell überhaupt. Leute,ich mache mal, ich mache mal ein bisschen, ein bisschen was zu hier gerade. Ist vielleicht. Alter,das Ding kommt überhaupt nicht mehr mit. Ich drücke die ganze Zeit schon Steuerung W. Ihr hörtes vielleicht, aber das ist nicht schnell genug mit Schließen der Tabs. Okay. Wo war denn dasBattlefield-Change-Log? Das hatten wir hier? Nee. Das gucken wir uns dann später an. Jaja,die Games da. Hier, das da. Hier, Update 2. Da müssen wir dann später mal gucken. Aber jetztgucken wir uns erstmal den russischen Battlefield-Killer an. Spoiler, das Letzte,was ich von dem Game gesehen habe, war halt nicht so der krasse Killer. Und zwar nur so ein bisschen,das wäre von diesem Game nichts mitgekriegt. Habe ich beobachtet, das ist ja schon eine Weile. Ichhabe das auch vor zwei Jahren oder so schon mal ausprobiert, aber da war noch nicht allzuviel zu holen. Mal gucken, ob das jetzt besser geworden ist. Ihr seht ja schon, ich habe auchsagenhafte 76 Minuten Playtime insgesamt schon auf Steam dafür. Also da war wirklich nicht soviel zu holen. Ich habe es vorhin mal gestartet und geguckt, dass es geht. Oh, was ist? Wollendie mich verarschen? Ich habe eben noch gespielt. Warum ist... Sagt bloß, die Server sind jetztoffline. Ich habe eben noch gespielt. Ich habe eben das Game angemacht und habe mich geqt undhabe geguckt, ob alles funktioniert. Also eben vor 45 Minuten oder so. Aber vor 45 Minuten warder Tweet ja schon raus. Zumindest, also wir gucken uns jetzt mal, bevor wir in das Game reingen,wir gucken uns jetzt mal zusammen den Closed Beta, das Closed Beta Pax Trailer. Closed Beta?Was ist denn ein Pax Trailer? Ach Pax, wahrscheinlich Microtransactions oder so. Dass ihr wisst,was das Game sein möchte und anhand dessen, was ihr gleich dann an Gameplay seht, könnt ihrbeurteilen, ob das Game das auch ist, was es sein möchte. So, einmal Fullscreen. Du sollsteinfach, lass mal das Video einfach nebenbei durchlaufen für mehr View-Stalks. Oh, das ist jamal, hör dir das, das ist mal richtig gekommener Style hier.Also sie machen eindeutig auf Battlefield. Oh, Kilkona ist auch am Start. Also quasidieses Video müsste eigentlich heißen Kilkona vs. Kilkona. Svayi, Svayi. Heißt wahrscheinlichsowas wie Stop Stop oder so. Keine Ahnung. Das heißt sowas wie eigene. Ah, so friendlyquasi. Also es ist offensichtlich, dass Battlefield ihre Vorlage war. Ich mein, ich muss jetztmal eins sagen, Zack, ich muss nur, ich finde der Trailer vermittelt tatsächlich einenbesseren Battlefield Eindruck als Battlefield 2049, aber es ist einfach dahingestellt.Spiel World War 3 auch in 2042. Nee, ich glaub vorher. Okay, wenn das kein Ami ist,dann weiß ich auch nicht. Der ist so advanced, der hat nicht mal Abzeichen auf der Uniform.Alle beide nicht. Warum auch immer der das nicht gesehen hat und direkt vor ihn laufenkonnte, keine Ahnung. So, also, das möchte das Spiel sein. Ich will jetzt noch nichtzu früh was sagen, aber ich hab das Spiel mir mal angeguckt und das letzte Mal wardas äußerst glitchy und langsam. Es hat eigentlich kaum was von diesem Trailer gehabt,den man da jetzt gesehen hat. Aber probieren wir das mal aus. Das Schlimmste ist, wennman das startet, das startet nicht einfach das Game. Es startet erst mal irgendeinenrussischen Launcher, dass das funktioniert und der russische Launcher startet dann, fallsjemand das nicht kennt. Ich wusste auch nicht, dass es das gibt. Mail.ru Anti-Cheat. KeinWitz, es gibt Mail.ru Anti-Cheat. Also mir war das gar nicht bewusst, dass es Mail.ruAnti-Cheat gibt. Okay, ich hab mich wirklich überwinden müssen, dass ich auf Accept gedrückthabe, als mich Mail.ru Anti-Cheat nach Admin-Berechtigung gefragt hat. Der Launcher zählt schon zur Spielzeit,ja klar, weil sie wusste, dass die gestartet ist. Okay, auch jetzt, probieren wir das malaus. Mal gucken, ob Lautstärke passt und überhaupt. Und ob es überhaupt läuft, weil man musssagen, die hatten richtig krasse Serverprobleme. Good Game, keine Ahnung. Das letzte Mal,wo ich es gesehen habe, war es noch äußerst klitschig und kaputt. So, hier richtig, richtigKekona-Soldier am Start. Lautstärke scheint ein bisschen laut zu sein. Mach mal kurz einbisschen. Ups, nein, nein, nein. Mixer. Mach mal kurz ein bisschen runter. Okay, QuickPlay. Bam. Tactical Ops in Berlin. Dieser Chat ist jetzt deutsch. Nee, ist er ja auchso auch schon. Tactical Ops, Control. Ah, okay, das ist quasi so Art Conquest. Conquest.So, Anti-Tank, Assault, Support, Sniper-Man. Also Assault, das Spiel hat keinen Sound oderMusik. Ich höre einfach gar nichts. Assault, Medic, Pack, Anti-Tank-Mine. Und jetzt jahier, technical. Ich weiß nicht mal, was es macht. Oh, okay, es ist immer noch klitschig.Fällt euch was auf? Weiß nicht, ob euch irgendwas auffällt. Nicht der Recall, dassdu keinen Sound hast beim Schießen. Also keinen eigenen Sound. Au. Okay, nice. Waiting forplayers. 37 von 30. Moment, 37 von 30 nötigen Players. Sollte man da nicht davon ausgehen,dass das Spiel eigentlich jetzt losgeht. Weil nur, vielleicht kann ich auch einfachnicht gut genug auf Russisch zählen. Oh, jetzt habe ich den gehittert. Okay, wir stellenes jetzt einfach mal irgendwo hin und gucken, ob wir Gegner sehen. Wohlgemerkt, die hattenmehr oder weniger die gleichen Probleme vor zwei Jahren schon. Und angeblich wurde diesesSpiel jetzt massiv überarbeitet. Sie haben wohl auch den Publisher gewechselt. Oder wasauch immer, mygames.ru oder sowas ist. Und sag mal so, Release ist... Oh, Hi-Rez. Guckmal, wir haben eine Lampe. Das sind ja die mit Abstand schönsten Reifen, die ich jemalsin einem Game gesehen habe. Liegelung ist da nix. So, wo sind denn die Gegner? Habenwir vielleicht ein paar Gegner zur Abwechslung? Die killen sich die ganze Zeit selbst. Oh,es geht los. Es können auch Polen sein. Ich weiß es nicht, ob es Russen oder Polen. Irgendwasim Osten auf jeden Fall. Der Osten meldet sich zurück. Guck mal, da gibt es einen Tank.Ach, F muss man drücken. Und jetzt? Ja? Ja? Dazu fällt mir bloß ein. Also, wir habenkeinerlei Sound, wie es aussieht. Sound ist anscheinend schon mal, schon mal broken. Ichmach das grad mal, ich mach, Leute, ich mach euch hier Mixer. Ich mach euch grad mal wiedernormal laut. Das ihr hört, es gibt eigentlich nix zu hören. Vielleicht hab ich nicht dasSoundpack gekauft. Oh, okay. Schon mal gut, einen Aussteiger, Animationen gibt es nicht.Okay, wir Captchern. Captchern wir denn? Wo sieht man das? Wir Captchern. Ach, da, dasblaue. Oh, das Captchert ja abfahrklangsam. Nee, guck mal, das geht nach links und rechtsgleichermaßen hoch, das Captchern. Das ist Big Brain-Status-Anzeige. Möglichst kompliziertgemacht. Und man kann, man kann Lehnstells machen, guckt hier. Ach, wir haben es erobert,jawoll. Was ist Nachkampf? Gibt es Nachkampf? Das Problem ist ohne Sound irgendwas zu ortenist natürlich schon Pain's Champ Deluxe. Da guckt er, Pain's Champ Deluxe. Map, habenwir ne Map? Okay, wir haben ne Map. Das ist schon mal nice, ne Map, wo man auch was erkennt.Das ist schon mal schön. Wir müssen, aha, wir müssen eigentlich da hinten hin. Okay,kann man spotten? Nee, kann man X? Marker, X oder so? Ah, hier, Marker setzen geht schonmal. Nee, ach, doppelt X. Doppelt X für Marker, okay. Ich hab ne Jit, keine Ahnung. Hä,da ist er doch, dahinter. Auf, gekommen Rit, komm raus. Immerhin hat er cool seinen Helmverloren. Das ist doch schon mal was. TSM ist am Start. TSM has won Rit. Wart mir nicht,wie ich da drauf gerade komme. So, gehts hier weiter? Die Frage ist, wo, ah, guck mal, hier,wir sind schon am Captchern. Massive Captcherstellen. Oh, jawoll, weg, weg mit dem. Easy. Ist dadead? Ist da dead der Typ, der gecaptchert hat? Nee, der lebt noch. Nice. Aber Leute,es gibt ein Scoreboard. Seht ihr das? Pog, Pog like this, Alter, Scoreboard. What the,okay es ist ziemlich dumm ohne Sound, wenn man nicht hört von wo man beschossen wirdund auch nix am Indikator wirklich sieht. Das ist ziemlich dumm. Übrigens ist es mitdem kaputtenen Sound, war vor zwei Jahren auch schon so in diesem Spielmodus. Hat sichnicht so viel getan. Orpens, Nee, das ist, man hört auch keine Schritte, das ist wirklichblöd. Wir spielen mal gleich ne Runde Team Deathmatch. Aber immerhin gibt es nen Ton,wenn man auf Deploy klickt. Die Maps sind glaub ich der krasseste Camper abfuckts.Alter, du hörst nichts, du hast keine Schüsse, du hörst keine Schritte. Da fuck, was istdas denn? Okay, das ist, das ist, das ist wild, wild. Das ist äußerst wild. Vielleichthört der ja was, vielleicht ist ja mein Sound nur verbackt. Okay, wo geht hier was, hier?Next. Tactical Sprint gibt es auch, guck hier, Huge Tactical Sprint. Wir flanken die jetzt,wir flanken jetzt hier durch und sliden um die Eck. Bin ich kleiner geworden durch Sliden?Leute, ich bin kleiner geworden durch Sliden, guck mal. Small, Small Soldier, Soldier, jetzt.Achso, man muss Space drücken um wieder aufzustehen, rekt, Next. Der crouched immer noch, ja, wares natürlich sehr merkwürdig. Au, von wo? Okay, ich seh hier nichts. Hier drinnen hates geschossen, guck mal, habt ihr das gesehen? Hier gibt es zu viele, hier gibt es definitivviel zu viele Ecken wo was abgehen könnte. Hier kann es ja wirklich an jeder Ecke abcampen.Tja, von wo ist halt die Frage? Gräb'nhaus Stels. Hier geht es nicht weiter, alles klar.Oh, guck mal, RPGs am Start. Okay, springen Stels geht nicht. Es ist aber wirklich dummohne Sound. Hab ich ne Granate? Oh hier, Massive Nades. Wir sind doch hinter diesem komischenAuto hier gewesen, oder? Was? Ah, Q ist nicht hinlegen. Was ist hinlegen? Äh, X? Ne. Okay,keine Ahnung. Ich hab legit keine Ahnung von wo mich was getroffen hat. Von wo? Kannman hier irgendwie aus dem Fenster schießen, oder? Ach, der hier. Komplette Überforderung.Es ist auch echt, wir, es ist wirklich hart, hart, wir hier. Okay, drei ist heal. Nice.Ich verpiss mich mal. Ah, hier ist nix, okay. Vielleicht müssten wir... Okay, so kannman hier auf jeden Fall nicht schießen über Range. Wahrscheinlich muss man hier Singelschussmachen, dass man trifft. In der Mitte ist auch einer, oder? Okay, springen, schießengeht nicht, hab ich grad festgestellt. Wenn man springt, kann man nicht schießen. Espiepst, Leute. Hört ihr das auch? Ganz eklig piepsen. Jetzt ist weg. Aber ohne Sound istschon ganz schön beschissen, Mann. Also guck mal, wenn man springt, kann man... Hä? Ne,wenn man springt, kann man nicht schießen, ne? Restart mal das Game. Ne, das ist normalin dem Modus, dass der Sound kaputt ist. Guck mal, es gibt sogar Metro. Was ist das deutscheAnsage? Oh, die Map ist ja riesig, Mann. Also riesig verwinkelt. Nicht unbedingt von derreinen Fläche, aber insgesamt ist die Map ja riesig. Ich hab keinen Plan. Wo lasertmich hier irgendwas? Okay. Okay, das Game ist, wir bleiben einfach sitzen und guckenin eine Richtung. Das ist schon mal nice. Wenn ich jetzt krasser Rainbow Six Pro wäre,würde ich quasi so rumlaufen. Ne, warte mal, wie laufen die Rainbow Six Leute immer so?Ach, keine Ahnung. Die haben doch so einen super geilen Rainbow Six Stels. Okay. Metro,Metro. Ich muss in der Metro sporen. Ach ja, man kann übrigens am Sprint nicht direktschießen, wie ihr gerade gesehen habt. Okay, hier muss man wirklich ein bisschen langsamersein, glaub ich. Hey, die haben Native Speaker Ansagen. Das klang nicht wie in den Russen,man versucht Deutsch zu sprechen. Nice, okay. Ob wir captchern das gerade? Wie legt mansich denn hin? C? Control ist es auch nicht? C? Weiß nicht. Aber wir haben es doch gleichgecaptchert. Von Recht hab ich irgendwas schießen gehört. Okay, ah jetzt haben wir es, jetzthaben wir es, okay. Ist über uns ein Panzer? Alles klar, oder auch nicht. Wie viele Spielersind das eigentlich? Ach, sind kaum Gegner drinnen. Der Tactical Sprint ist immer nochverbuggt, da geht mal, mal geht da nicht. Sehr merkwürdig. Nee. Okay, das ist immer,ach ich krieche immer noch, stimmt. Ja, das ist Fail. Das ist Fail mit dem Griechen. Ichglaube es gibt keine Claymores oder irgendwelche Dinger. Stellt euch mal diese Maps noch mitClaymores vor. Dann ist es doch komplett vorbei. Nice. Next. Oh, ergeblich ist hier was. Hä?Pointstack, guckt euch das mal an. Mein Pointstack hört gar nicht mehr auf. 2000 Punkte, esgehört, guck mal, es hört nicht auf. Es, es, es stackt einfach, das ist wie, das isttatsächlich in dem Fall wie in alten Battlefields. Also ohne Schusssound ist tatsächlich, oh,oh, lul, ich habe ihn gekillt. Einfach mal in die Richtung gesprayed. Wassermelone istam Start. Einfach in die Richtung gesprayed, lul. Komm, ich stelle es jetzt mit unseremTyp davor. Es fühlt sich aber richtig schwerfällig und, und. Okay, die Typen können nicht wirklichweit Granaten werfen. Hä? Na gut, das Schöne für mich ist, das Schöne für mich ist,die haben auch keinen Sound, alle. Okay, was war das, drei? Midi-Pack, Midi-Pack. Alter,heil dich, heil dich, der Typ ist immer noch im Fenster oben. Ich habe einen Killstreak,guck mal, ich kann jetzt einen Air-Strike holen, aber dafür habe ich nicht genug Punkte, oder?So, ist der Typ immer noch oben im Fenster? Und welches Fenster ist es überhaupt? Undwarum klingeln hier so viele Telefone? Ey, das Spiel ist so, das ist das krassestegekommen und game, was ich je gespielt habe. Der Atmen, wir sollen leise ballern, ich habenicht mal Sound beim Ballern. Von wo? Von hier? Von hier? Nee. Von wo? Das ist ein Air-Strike?Kann ich auch einen Air-Strike holen? Hui! Äh, A2. Nee, wo sind wir? Was ist das hier,Zack? Das ist C1. Nee, ich mache da keinen Air-Strike. Okay, campen wir mal uns ein bisschenam Fenster noch ab. Da war er. Guck mal, da hat mich, die anderen haben mich gesehen.Oh, wow, wow, wow. Oh, meine Ammo ist leer. Pants-Man, der Pants-Man kriegt jetzt einenAir-Strike. C1, Panzer. Keine Ahnung, gibt es, gibt es Kriege, kann ich mir Ammo da rausnehmen oder? Stirbt man, wenn man da runterfällt, bestimmt. Au, nee. Oh, das fühlt sich äußerst,also sehr, sehr, jetzt, jetzt kriegen wir einen Air-Strike. Bam, Air-Strike, 7. Nee,da wird schon gerade ein Air-Strike. Da, da geht er hin. Da geht er jetzt hin, der Air-Strike.Oh, oh, auf den Panzer, der Pants-Man, Leute, der Pants-Man. Bam. Geiler Air-Strike. Nichtso satisfying, nicht so satisfying Air-Strike. Das klingt wie das Griechen. Okay, man solltein dem Game nicht über freie Felder laufen, das habe ich schon gecheckt. Guck mal, soviele gekommen sind auf einem, auf einem Haufen. Oh, von wo, von wo? Da, oh nee, meine Muniist leer. Jetzt wird gerusht, Leute. Jetzt wird gerusht. Kann man, kann man das aufheben?Okay. Der Camera-Shake beim Laufen, ja, es fühlt sich sehr, sehr träge und, und klitschigan, also im Prinzip so wie vor zwei Jahren, wo ich es mal ausprobiert habe. Ripp. Gehmal bei MikeyDog rein. Der macht das gut, der sitzt hier schön im Häuschen und bewegtsich nett. MikeyDog. Das Hit-Feedback ist halt auch nicht so das geilste. Das Hit-Feedbackist auch bisschen merkwürdig. Achtung, Massive-Nade. Bin mir nicht ganz sicher, wo wir hingucken,wo wir jetzt hin können. Hier, Reinslide-On. Jawoll. Massive-Flight-Action. Komm, flanken,Massive-Flank. Die wissen noch nicht, dass wir hier sind. Pack. Enemy-Hit 91. Wie, daswar kein Kill? Alter, da hat nur der Cop rausgeguckt. Der Waffensound, den gibt's nicht. Waffensoundist overrated, outdated, debated, den braucht man nicht. Die haben sich gedacht, Waffensoundist zu OP. Waffensound ist nicht notwendig für ein Game. Also ohne Waffensound ist tatsächlichecht hängen geblieben. Und auch dieses Hinlegen und so. Ne, ne. Was ist hier? Angeblich geht'shier voll ab, ich seh nix. Alles klar. Leckt. Boah, es leckt. Krass, haben wir eine guteVerbindung angeblich schon. Alter, beweg dich, man. Also die ganze Bewegung, da müssen sieauf jeden Fall noch was dran machen. Das fühlt sich nicht schwerfällig an. Wenn ihr wasschwerfällig sehen wollt, dann spielt Halo. Halo spielt sich zwar schwerfällig, aberbei Halo fühlst du dich so wie Herr der Lage, was hier nicht so ist. Ich muss mal gucken,kann man jetzt hier irgendwie peeken oder so? Irgendwas hab ich gekillt. So, wir peeken,wir peeken da. Einer lebt doch da noch. Oh, meine Ammo ist schon wieder leer. Also damüssen sie auf jeden Fall noch irgendwas machen. Das fühlt sich nicht... Kann ich hier wasrausnehmen? Request, hier, warte, Request. Request, Gadget Use. Ja, ja, ich will Ammohaben. Gib her, gib Ammo. Pog, Ehrenmann hier, guckt euch an. Hallo? Mehr geht nicht. RichtigEhrenmann hier. Mickey, alter. Jawoll. Jetzt hab ich, jetzt hab ich was, aber von hintenwäre weggestellt. Okay. Kann man Klassen wechseln? Equipment Anti-Tank. Hä, ich binAnti-Tank? Das ist doch keine... Die Waffe, die ich hab, sieht anders aus als das. Ichbin Assault. Ich will Anti, ich will das hier spielen. Ne. Anti-Tank, Character? Oh Leute,habt ihr es gesehen? Man kann Squads wechseln. Sachen gibt's, es gibt Spiele, die haben tatsächlichnoch sowas Basic-mäßiges wie Squads wechseln drin. Oh, oh. The Forsen Troll. Oh, oh, Toss.Es gibt wenige Schimpfwörter, die ich kenne, so auf Russisch, aber das war Toss. Das wardefinitiv Toss. Ist das ein Gegner? Ne. Ich hab keine Ahnung wo... Alter Mann. Hab ichden gekillt? Ne, oder? Was ein Gestellte, Mann. Das ist glaub ich kein Game für mich. Dasist mir dann doch ein bisschen zu langsam. Okay, kommen wir hier raus? Oh, da ist was.Oh ne, das ist ein gegnerischer Panzer. Okay, das war 1A Headshot. Direkt Down Gegner. Treffer,Treffer, Feedback nicht vorhanden. Wallbang. Alter. Der Typ. Lul. Lul. Alter, die lassensich ja wegspringen wie sonst was hier. Man hört halt nichts. Man hört keine Schritteund nichts. Das ist extremst irritierend. Und auch das Move ist so laggy. Okay, ichwill mich mal nicht beschweren, das Ding ist Beta und alles, aber es spielt sich nichtwirklich gut. Ich könnte mir aber vorstellen, wenn sie das auf die Reihe kriegen, ist dasso ein bisschen Taktik, FPS, mit Battlefield-Einschlag. Wirklich viel Battlefield sehe ich jetztweder beim Moveman noch bei anderen Sachen. Ich mein es geht Panzer oder so. Also richtigviel Battlefield ist da nicht dabei. Aber es ist so ein bisschen Taktik. Taktik stelltes mit Battlefield-Anleihen. Das stelle ich mir gar nicht mal so schlecht vor. Wieso fliegenGranaten, als würde man tote Forelle schmeißen? Ich weiß nicht, das sind super krasse Elite-Soldaten,die können das halt nicht besser. Du meinst heute das Game ist traurig, was die auf Russischsprechen oder du meinst aktuell ist Battlefield traurig mit russischen Sprüchen? Weil diemüssten eigentlich theoretisch richtig nice russisches Voice Acting haben, weil die kommenaus Polen und ich glaube die haben bestimmt auch viele Entwickler aus Russland. Ach BF2124,also die hier müssten das eigentlich ganz gut hinkriegen. Aber die haben auch bei denDurchsagen in der U-Bahn richtig deutsche Sprecher gehabt. Guck mal wir haben jetztM14, äh nicht M14, M417. MSBSK. Holosight, jawoll. Next. Lobby. Wir gucken mal, vielleichtkönnen wir das schon, ach guck mal jetzt haben wir das Holosight schon drauf. Hattedas alles automatisch Attached? Jetzt sind wir in Warschau. Oder, oder, nee. Ist dasüberhaupt Warschau oder ist das Kriegsäge? Ist das Warschau oder ist das die Kriegsäge?Moment, ich weiß, dass ich das anlockt hab, das müsst ihr mir nicht nochmal zeigen. DieGesichtsanimation ist tatsächlich, das könnte man in der Tat eins zu eins eigentlich hierso rein machen. Es sieht wirklich äußerst Gang-Wade-mäßig aus. Ah jetzt sind wir inMoskau. Jetzt sind wir quasi, so, ja was denn jetzt Game? Kriege ich jetzt einfach immerLevel geschenkt für nicht spielen? Ok Customize. Guck mal was wir hier machen können. Anti-TankEquipment, nee Assault. Assault hatten wir von den Dingern. Ok. MSBSK Default. Und dakönnen wir jetzt unser Zeug Attachchen? Nee. Iron Sight, Secondary Sight. Ich hab doch,ich hab doch eben irgendeinen Holosight unlockt, hat er mir gesagt. Welches Holosight hab ichdenn unlockt? Irgendwie glaube ich, dass es verbackt ist. Body Parts? Was für Body Parts?Ah Stock und Griff und so, ok. Aber wo ist denn? Ok, das ist cool gemacht. Das findeich nice. Nee das muss doch die, war das auf der anderen? Ah Moment, ich war ja Anti-Tank.Sekunde, ich war ja Anti-Tank. Man muss das hierfür gewesen sein. Nee. Das ist nichtdas Holo, was ich unlockt hab. Configs? Customize? Nee. Nee, das ist auch wieder was anderes.Ich bin verwirrt Leute. Ich hab keine Ahnung, was ich da gerade unlockt habe. Assault. Backpack?Ach hier ist jetzt im Backpack? Ok, das ist maximal verwirrend. Ich hab nen Rucksack jetztmit nem Visier drinnen. Primary, dann glaube Holo. Nee, da haben wir gerade geguckt, daist das nicht. Du kannst bei den Visieren den Reiter wechseln. Ah Moment, ich blickgerade nicht mehr durch. So hier, Customization? Moment, den Skin für nen Visier oder? PrimarySide. Wo kann ich hier was wechseln? Nee, hier kannst du nix wechseln. Oben? Ah, boah.Ok, ok, das ist Hardcore ohne übersicht. Aber wenn man es weiß, wenn man es weiß, dannsieht man das. Also dieses Grau auf Schwarz im Hintergrund, das ist wirklich sehr sehrschwierig zu sehen. Zumal du es auch nicht siehst, dass es überhaupt wechselt von demMenü ins Untermenü rein. Ok, Holo Side. Bam, jawoll. Haben wir sonst noch irgendwas?Secondary Side? Nee, Secondary Side brauchen wir nicht. Under Barrel. Gleich den Noobtubeauspacken. Es gibt nen Skin für nen Magazin. Na gut, da kann man Magazin halt dann lilamachen oder so. Secondary Ammo. Wenn ich kann den ganzen Kram im Shop kaufen für Big Money,gibt es nen Schalldämpfer? 35. Das ist doch lange Spiele. Nächste gibt es hier? Moment,wir gucken mal kurz den Shop, Leute. Keine Sorge, ich kauf nix. Ich will nur mal gucken,was es da gibt. Shop. Ah, Shop ist broken. Shop geht grad nicht, alles klar. Ok, ja dannPlayer Banner. Oh, aber ich muss sagen, die Menüs sind unübersichtlich, aber es gibtwenigstens Sachen zum Einstellen im Vergleich zu Battlefield. Team Formation. Ja, LLV anStart. Banner. Red Powder. Banner Flag. Ok. Brasilien. Keine Ahnung. Fiji. El Salvador.Come here. Bam. Dieser Chat ist jetzt deutsch. Alles klar. Quick Play. Auf gehts. TacticalOps. In der Kriegssege wieder. Und wie ist WW3? Also ich erkenne ganz gute Ansätze. Esfühlt sich an wie irgendein Tactical FPS mit Battlefield anleihen. Es ist weniger wirklichBattlefield. Sag mal, ich hab doch eben Anti-Tank ausgewählt, hab aber Assault gespielt, ne?Ja. Guck mal, jetzt hab ich mein... Ach, Waiting for Players. Also ich erkenne dasmassive Textur. Huge Textures hier. Guckt's euch an. Ah, es lädt noch rein, aber naja.Da geht noch was. Also ich entdecke Ansätze in dem Game, die ich gar nicht so schlechtfinde. Es ist halt noch sehr groh und das Movement müssen sie auf jeden Fall was dranmachen. Also was mit dem Movement, das fühlt sich einfach falsch an. Vor allem wenn derTactical Sprint dann immer nicht funktioniert zwischendurch. Manchmal geht er, manchmalnicht. 40 für 30 Spiele. Aha, verstehe, verstehe. Vielleicht zählen die da einfachanders. Vielleicht heißt es 30 von 38 sind ready oder es müssen noch 7 ready werden.Oder sowas. Oh, wir haben Waffensaugen, Leute. Du musst halten, ausstellen beim Sprinten.Ah, ok. Controls. Alles klar. Browse. So. Auf Toggle. Ist das jetzt dann Tactical Sprintda los geht? Probieren wir mal aus. Ja, aber dann macht immer noch kein Tactical Sprint.Der Tactical Sprint ist ja der hier. Dann musst du es zweimal drücken. Ok, das istgewöhnungsbedürftig, ja. Tatsächlich. Da gucken wir mal. So, mal schauen wir die Map.Es kann man hier hoch. Das würde mich mal interessieren, ob man irgendwie krasse Kletter-Actionmachen kann. Nope. Boah, es ruckelt. Es laggt. Das ist Kaufhaus oder sowas. Vielleicht sollteich nicht unbedingt mit meinen Leuten hier auf einen Platz stellen. Das ist nicht sogut. Gehe jetzt runter. Mal Map gucken. Ah, ok. A1 wird gerade gecaptured. Das heißt,wir gehen jetzt geradeaus und dann links. Die Maps sind, von der Größe her sehen dieschon mal ganz brauchbar aus. Was genau geht mit euch da ab? Von der Größe finde ichdie schon mal relativ brauchbar. Kann man durch? Nope. Ok, Maps sind relativ statisch.Wir gehen jetzt ans Fenster. Eins habe ich gelernt, nehme immer am Fenster die Leuteauf der Straße weg. Ich bin tot, wenn ich hier rüber laufe. Ich sage es euch. Bin ichüberhaupt richtig, Zack? Wo bin ich auf der Map? Ach, da unten. Ok, wenn ich hier rübergehe, dann komme ich direkt bei A1 raus. Ok, wir probieren es. Achtung! Ah, Technik Sprint,A1. Ah, ok, Pantsman. Da schreit er. Gut, da macht sie jetzt nichts dagegen. Also ichmuss sagen, die Map Größe sagt mir schon mal deutlich mehr zu. Ich finde es ein bisschenorschverwinkelt. Oh, GG Eatsporn. Also die Map Größe finde ich ein bisschen orschverwinkelt.Aber es ist auf jeden Fall schon mal besser mit Waffensound als die letzte Runde. Wobeiletzte Runde waren wir gar nicht so schlecht. The Clinton. Gibt es Defis? Das wird michmal interessieren, ob es Defistells gibt. Ok, wir müssen jetzt den Rainbow-Six-Stellsmachen. Hier, da geht es so. Oh ja. Immer schön. The Pantsman. Alter, ich will taktischsprinten. Lass mich taktisch... Richtig zuordnen Buff von... What the fuck? Aber die Trefferanzeigeist tatsächlich... Ok, da hat mir einfach zweimal ins Gesicht geschossen. Aber meinTeam macht das schon. Also Sprinten ist keine gute Idee, merke ich. Sprinten brauchst duviel zu lang, bis du schießen kannst. Aber ohne Sprinten ist er lahm as fuck. Schießendie hinten? Oder nicht? Aber man hat ihn gehört, Leute. Der kommt sich jetzt auch mega abgekemptvor. Haha. Nein. Drei. Heal. Ich brauch ne Granate. Das. War er das?Oh, was ein Gestellte. Das ist kein Game für mich. Ich sag's euch. Das ist kein Gamefür mich. Hier wird so krass gestellst. Ich hör was. Ich bräuchte mal... Haben wirnoch hier was? Ok, ok. Ja, Battlefield und Rainbow Six. Es ist eher Rainbow Six. Es isteher Rainbow Six. Ok, mit der Pistole machst du da nichts. Es ist eher Rainbow Six. Featuresein bisschen Battlefield. Ah ja. Da haben wir auch immer ganz gut reingegangen. Da wirder geslided. Da slided er richtig rein, Gatschi-Buzz. Ok, aber dass der Tactical-Sprint nicht funktioniert,das fuckt mich ab. Guck mal, das ist so broken. Das Game ist nice, wenn man gerne Ecken abkempt.Eckenstelles macht. Das ist gut hier. Hallo? Oh, oh, au. Da vorne geht was. Aber eins merktman, und das finde ich gut, das finde ich gut, sobald es ein bisschen Tactical und nichtso Spray and Pray ist, die Leute laufen realistischer, weil normalerweise wird auch keiner hier aufder Straße laufen, sondern eher an der Wand. Das finde ich schon mal ganz gut. Oh, oh.Und es hat Friendly Fire. Oh, Tactical-Sprint. Wo sind denn meine Leute jetzt hin? Iron Sidesgegen gerade nicht. Ok, zu hinten über Range ist echt nicht ohne.Ok, über Range was zu klatschen ist wirklich schwierig.Ok, Hüfte sprayen ist nicht. Hüfte sprayen ist nicht. Wunder, dass das gut läuft mitdem Detailgrad. Ich habe alles auf Null. Ich habe alles auf Low. Und es hat ziemlicheSlowdowns zwischendurch, das merkt man auch. Ich habe keinen Plan, wo wir auf der Map sind.Das sieht für mich alles aus wie eigene Maps. Wo sind wir denn jetzt hier auf einmal? Metrosind wir jetzt am Start. Metro. Aber ich glaube die Maps lernt man halbwegs mit derZeit. Ok, da ist ein anderer Typ. Wir gucken jetzt, ob der hier rein pusht. Der aimt dochab. Nee, das sind meine jetzt. So, probieren wir das nochmal hier drinnen, unser Glück.Ok. Ok. Ich verpiss mich mal wieder. Ich weiß gar nicht vor wo. Ok, da hat er Eckenkugstills gemacht. Hätte ich auch machen sollen. Kann der länger rutschen als ich? Aber wirsind ganz gut dabei. Ich glaube, ich glaube, ich sporene gerade bei dem, das war keine,auf auf auf, du machst das schon. Lass dich nicht von der Seite killen. Was ich, ja, ichhabe vergessen, was ich sagen wollte. Ich glaube, das ist kein Game, wo du mit 35 Killsam Ende rausgehst oder so. Wirklich nicht. Gehen wir mal kurz hier gucken. Oh. Panzer?Wenn ich sehe, ob ich da was gesehen habe. Kann man die Granaten vielleicht weiter?Ich habe nur G gedrückt. Ich habe noch nicht mal abgedrückt. Man kann die nicht halten.Sobald man G drückt, wirft er die. Ok, das ist. Das ist der Panzer. Der Panzer. Machihn platt. Bäm. Mach ihn kaputt. Jawoll. Oh, das war nice. Das fühlt sich deutlich,aber mal realistischer an als Battlefield. Das war also taktischer, langsamer, realistischer.Das ist wirklich ab abfuck. Also das mag ich nicht. Vor allem, dass der tactical Sprintnie funktioniert. Wenn du ihn bräuchtest. Nehmen wir mal hier Max mit. Jawoll. Und vielleichtauch mit. Guck mal, wir haben noch Kills. Wir können auch Kills holen. Wo geht hier was?Ok, alles klar. Was planen die Entwickler so ehrlich gesagt? Keine Ahnung. Können wirmal gucken. Boah, aber das Movement ist wirklich Pains. Pains Champ. Richtiger Pains Champ.Richtig Pains Champ Movement, ja. Da oben war ein Gegner. Oh, ich sollte hier weg. Kannich jetzt? Ich wollte gerade sagen, ich kann jetzt einen Airstrike darauf machen, aberjetzt rennen unsere Leute darum. Oh, Airstrike. Direkt hier auf uns. Hä? Ah, Refill. Nice.A health restore? Ok. Sag mal, sind die über uns? Was ist das? Grenades? Ammo? Ich findees auch cool, dass man restocken muss erstmal. Nee, da macht nichts. Kann man hier oben wasins Fenster werfen? Nee. Interessant. So, wo sind die jetzt? Unter uns? Über uns? Tiefgarage?Boah, das ist echt, das ist mal richtig unübersichtlich. Ich glaube, das ist eher so ein Game fürLeute, die 5 Minuten stelzen wollen und richtig so outsmarten die Gegner. Für mich ist dasnix. Ich brauche mehr run and gun. Da ist es nur kleine Indie-Company. Ja, so wie Blizzard.Kann man nicht so viel erwarten, finde ich auch. Capture? Nee, wir capturen C1. Wo geheich denn jetzt am besten hin? Hier ist was, angeblich. Angeblich stellst du dir was.Von wo? Hier? Boah, das ist ja verwinkelt hoch 3. Das ist ja mal wirklich krass verwinkelt,das ist echt krass. Wo bin ich überhaupt auf der Map? Da. Okay, dann gehen wir malzu A2 jetzt vor. Wahrscheinlich werde ich aus irgendeinem Fenster gebashed jetzt. Moment,ist hier was? Ah, da hinten ist was. Achtung, Massive-Nade. So, wenn es Spotten gäbe, wärecool, aber das ist glaube ich nicht tactical genug hier, das Spotten. Ah, haben wir gehitted?Meine Muni ist alt. Man darf hier definitiv, ah, tactical sprint, mach tactical sprint.Man darf nicht so viel sprayen. Das habe ich glaube ich schon kapiert. Immerhin, wir sinddas beste Squad, ich habe 11 Kills. Bin ich zufrieden mit, weil es gibt kaum welche, diemehr haben. Für so richtig einen Kack-Noop wie mich in dem Game ist es gut. Aber mankann am Punkt spawnen, man kann aber auch bei den Leuten spawnen. Das klingt schonmal sehr sinnvoll. Oh, der ist da stauner, Dude. Ich muss spawnen, Leute. Was, Deploymentin progress? Wie jetzt? Ah, jetzt. Oh, tactical sprint, please.MonkaS, wo soll ich denn hin? Das ist mir viel zu hoch. Warum die den Scoreboard haben?Ja, weil es denen scheiß egal ist, ob die Leute abfucken oder nicht. Und DICE hat sichgedacht, ne ne, das geht nicht, wir können hier nicht. Alter, der geht nicht ins ADS.Der Dude ist noch da, ich sag's euch. Der hat mich doch gesehen, der Kerl. Wer weg?Ey, ich weiß gar nicht, warum ihr... Ah, friendly fire, friendly fire, na geil. Ge-friendlyund deploy. Lass mich rein. Leute, ich geh hoch, ich wette die Flanken hoch. Ich wettemit euch die Flanken von oben hier unten rein. Oder auch nicht. Aber der tactical sprintmacht mich wirklich fertig. Ah, guck mal, da. Ein medikit. Huge. Ist da einer in derEcke? Findet ihr das auch ziemlich verschwommen auf range? Ist das vielleicht nicht auf max?Doch, doch, passt, ist eigentlich alles gut. Die respawn cam. Ohne Mist, die respawn camist viel besser als vom Battlefield. Du siehst wenigstens, wo du rein spawnst. Aber am Movementmüssen sie unbedingt noch was machen. Also das Movement ist wirklich richtig loss, achne. Richtig pains, pains, champig. War da was? Hab ich da grad was gesehen? Hab ich dagrad einen Gegner gesehen oder war das einer von mir? Nee, das war wohl was von mir. Ja,ich glaub die Beta kostet 13€ Early Access, aber ich hab das Spiel vor 2 oder 3 Jahren,also schon ewig her, hab ich das auf Steam gekauft. Ich darf als Veteran mit 15 MinutenSpielzeit oder so, als Veteran darf ich jetzt auch dran teilnehmen. Wir haben gecaptured.So, wir haben den ersten. Leute, wollen wir mal LLV fahren? Land Drone haben wir. Guckmal, wir haben. Gib ihm. Gib ihm. Gib ihm. Jawoll. Was ein Ding, sieht aus wie aus demVincent's Door. Ach, wir haben nur beschränkte Range, ok. Man kann nicht steuern im Ironside.Oh, da kommt der Pantsman, ich muss weg. Der real Pantsman ist am Start. Ok, gut. Nein.Link Brocken. Nein, nein, Link ist nicht Brocken. Ich bin wieder da. Ich bin wieder in Range.Ich hab, ich hab kein Ironside. Ich hab, mein Ironside ist weg. Warum ist mein Ironsidekaputt? Das ist ziemlich blöd, wenn mein Ironside kaputt ist, ich seh nix mehr. Ok,was? Was? Oh, oh. Ha, da hast du gedacht. Das hast du dir so gedacht, Alter. Das hastdu dir so gedacht. Ich kann auch dieses Kocken abstellten hier. Wo ist er? Ok, ich hab ihnhier. Ok, ich hab keine Ahnung, wo er ist. Ha, ha, ha. Im Kopf, Mann. Jetzt hat er sichgedacht, er kann mich outmoven. Oh. Ok, ich hab nix gesagt. Was willst du machen? Waswillst du machen? Was willst du machen? Die Sprüche sind ziemlich tost, würde ich sagen.Also ich kann ja nicht viele russische Schimpfwörter, aber das ist auf jeden Fall fast, fast, fastschon in Richtung wie die Battlefield 3 Soldaten. Die haben ja auch geflucht ohne Ende. Eher,das ist russisch tost, das ist kein Problem, das wird nicht gebannt. Englischsprachigeswird auf jeden Fall. Was ist hier? Oh, da ist er. Alles klar. Kein Wort verstanden, abereinfach gesagt, ich hab ihn richtig hart weggecockt. Keine Ahnung. Panzer? Nein, da ist einer.Nein, nein, nein, nein, nein, nein. Nein. Restore health, restore health. Nein, nein,nein, nein, nein. Er schreckt mich nicht so. Da stehen unsere Leute in der Ecke und vonwo wärste weggeklatscht? Von hinten. Das Game hat definitiv keine Zwe- Doch, das Gameist glaube ich schon 4 oder 5 Jahre in Entwicklung, aber ich glaube dazwischen hatten sie keinenBock mehr oder so, keine Ahnung. Fuck, jetzt hätt ich sie wegklatschen können. Achso,Battlefield, nee, Battlefield nicht, Battlefield nicht. Leute, wir sind richtig gut, guckt'seuch mal an. Wir sind richtig gut. Gut, bock. Ok, wir stellzen wieder in der Tiefgaragerum. Ok, wir sprinten, der kommt von oben jetzt. Ich weiß, der kommt von oben. Ah, altertactical sprint, man funktioniert doch halt. Ich hör so rumrennen, ich weiß nicht vonwo. Nee, das ist einer von mir. Dann sind die doch unten. Wer ist noch da? Jetzt nichtmehr. Kann man sich hinlegen Leute? Hat jemand einen Plan, wie man sich hinlegt? Wow. Niemandeinen Plan, wie man sich hinlegt? Z? Nee, Y ist es nicht. Alter, Z. Wer ist denn aufdiese glorreiche Idee gekommen? Z. Ranker Z. Jetzt kommt was von hinten, pass mal auf.Ich hör die über uns rennen, wir müssen jetzt tactical sprint, please, funktioniertdoch einfach. Jetzt hört er nicht mehr mal auf zu tactical sprinten, obwohl er aufhörensoll. Sag ich doch, dass ich was über mir flitzen hab hören. Nice Flitzer. Nice Flitzer.Da kommt doch was unten, oder? Moment mal, da kommt doch was. Auf dem Radar ist genauhier jemand. Seht ihr das? Genau hier ist jemand auf dem Radar. Hier. Genau hier. Invisiblecheat. Leute, ich würde ja mal gerne einen Airstrike holen, wofür brauchen wir den Airstrike?Ich hol mal einen Airstrike. Wo könnte man einen guten Airstrike hinklatschen jetzt?C2, äh C1, C1, perfekt. Oh, Predator. Da ist die Moab. Bäm. Haben wir was gekillt?Es gab auf jeden Fall einen Hitmarker. Oder da fährt was. Oh. Au. Was haut er mir einfachüber den Kopf? Oder was auch immer das gewesen sein soll, ich weiß es nicht. Delta Modusaktiviert. Da vorne ist ja auf jeden Fall was. Da hab ich gerade meinen Airstrike draufgejagt. Oh, wir haben wieder die nice Drohne. Bäm. Hallo? Rundstells. Bäm. Ich stehe haltmitten, mitten auf der, auf der Map, ne? Das ist ziemlich dumm. Nimmt? Captured der?Ne, der captured nicht. Au. Ach da. Äh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh.Oh. Ha. Drohnenstells. Äh. Ach, Reloading. Au. Oh. Oh. Oh. Nice. Oh. Oh. Oh. Oh. Oh.Nice. Easy. Alter, wir haben richtig geowned. Ich glaub die Drohne ist OP. Guckt euch dasmal an. Die hält mehrere Panzer, Panzerfaustreffer aus. Und die two-hitted die Gegner. Siehtman was? Ich hab Scoreboard, your squad best Scoreboard. Alter, 28. Richtig gut hier.Pock. Wie von Zulu. Zulul ist ja Band Emote hier. Aber das ist, ähm, gar nicht mal soschlecht. Gar nicht mal so übel, muss ich sagen. Level 4. Aber an die Movement müssensie auch. Oh, Schneiber. X6 HD am Stahl. Aber an der, also an die Movement müssen sieauf jeden Fall irgendwas machen. Oh, guck mal, jetzt kriegen wir Griffs. Und aus irgendwelchenGründen Mini Tactical Laser. Customize. Equipment. Assault. Also Customization. Also das Holosighthaben wir am Stand. Was haben wir gerade Unlocked? Hier. ADS Time. Nee. Recoil. Nee, der Recoilist easy as fuck zu handeln. Das ist kein Problem. Der Spread und das Rumgewackele isteher problematisch. Underbarrel haben wir Unlocked. Classic. Okay. Darf man nicht.Gibt's den Halo Multiplayer eigentlich auch kostenlaufender Konsole? Ja. Moin, erstmaldanke für das Dislaken. Wie ist das, WW3? Kann man als Battle, nee, Battlefield Ersatzist es definitiv nicht. Ich denke, das kann man so viel kann ich jetzt schon sagen. Esist eher so eine Richtung Rainbow Six Stels mit ein bisschen Battlefield. Es gibt Panzer.Guck mal, wir können uns da reinsetzen jetzt. Wir fahren jetzt mal. Nee, ich darf nicht.Ach so, weil Warm Up ist. Also wenn sie das, also die Maps und so, das erinnert mich tatsächlichein bisschen an Zen Crossing, findet ihr nicht auch? Das hat ein bisschen was von Zen Crossing.Es sieht halt, die Maps sehen halt komplett leblos aus. Muss man jetzt halt auch mal sagen.Das hat Battlefield 3 schon besser hingekriegt. Das Sound Kulisse ist, also die Waffensoundsund das Teufel finde ich okay. Aber das Movement müssen sie hinkriegen. Ich sage euch, wenndie das Movement hinkriegen, dann kann ich mir das durchaus für Leute vorstellen, dieein bisschen taktischeres Battlefield wollen oder die taktischen Modern Military Shooterwollen mit ein bisschen Battlefield-Einschlag. Kann ich mir schon vorstellen. Wo sind denndie Gegner? Die sind bestimmt da hinten irgendwo. Die Maps sind auch bei weitem nicht so großwie es beispielsweise eine Battlefield 2042 Map ist, aber sie sind halt eben relativ verwinkelt.Ich meine, das hier könnte legit irgendwie so in irgendeinem Industriegebiet Berlin sein.Klar, mich würde es sogar nicht wundern, wenn die sich nicht da irgendwo hätten inspirierenlassen. He, he, he. Lull. Er ist Tactical Sprinter. Oh, wisst ihr? Guck mal, ich habeihm mit dem Helm runter. Habt ihr gesehen? Ich habe ihm mit dem Helm runter geschossen,dem anderen. Bin gerade an der Agentur für Arbeit vorbeigelaufen. Ja, wahrscheinlich.Real, Real Life. Real Life Schauplatz. Wahrscheinlich wohnen die Leute hier. Hier sind agile Start-ups.Ja. Richtig agil. Sieht man hier schon. Was bitte? Ali hit? Angeblich habe ich geradeein Team-Mate gehittert, den ich oben ans Fenster geschossen habe. Oh, oh, oh, Team-Kill.Weiß gar nicht, ob ich im Panzer Team Roadkills machen kann. Bäume umfahren und so geht glaubeich nicht. Also die Maps scheinen mir relativ statisch zu sein. Man kann aber, das habeich schon, man kann durch Regale und so durchschießen. Also man kann durch dünne Wändekommen man durch. Da hinten sind Gegner. Das ist nicht sicher. Guck mal, noch ein Panzer.Okay, kaputt machen. Ah doch, Bäume umfahren kann man tatsächlich. Panzmann 2.0, wo sindwir? Hier sind auf jeden Fall keine Gegner. Okay, Schussgefühl der Dinger ist Pains Champ.Ein extrem Pains Champ. Trefferzonen gibt es eigentlich auch keine. Und ich kriegt denKill geklaut. Nice, GG Eats. Also Trefferfeedback Fahrzeuge ist mies. Ja, wir kommen aneinandervorbei, nice. Oh, au, mein Ohr. Okay, das fliegt ja das Gehör weg mit. Mag es vielleichtrealistisch sein, aber es gibt so Realismus Sachen, die müssen in Spielen nicht sein.Guck mal, hier wird gecaptchert, hier wird gecaptchert. Die werden jetzt gebasht. Dieliegen bestimmt hier in der Mitte irgendwo rum. Garantiert, hier irgendwo. Da ist er.Okay, er ist down. Da hinten ist wieder was. Wenn ihr einfach mal mein Bahnkreuz funktionierenwürde. Alter, das ist doch nicht euer Ernst, oder? Das hört sich an, als knallt der Opadie Garage zu. Der Opa knallt das Garagentor zu, so hört sich das an. Aber nicht nachdem Panzer. Aber anscheinend haben die RPGs auch ordentliche Time to kill, also du brauchstnicht drei Stunden die zu killen. Okay, pass auf, wir probieren mal was, wir probierendurchzukommen. Lass mich in Ruhe. Wir haben weggestellt. So, Minipack aufnehmen. Ich finde,das Healen dauert einen Ticken lang. Oh, hinter mir, hinter mir. Alter, kletter doch.Ist der down? War der down? Oh, Tactical Sprint, man, funktioniert doch einfach. Muss michverpissen. Weil auf der anderen Seite sind sie ja auch. Oh, was ein Gewackel. Hier sindbestimmt noch mehr, hier sind bestimmt noch mehr. Lass es mal meine Tuts machen. Oh, derkotzt Leute, der kotzt ab, ich sag's euch. Der kotzt richtig ab. Alter, die kotzen richtigab. Oh, meine Schüsse sind gleich leer. Pass auf, Poggas, Poggas Schutz jetzt gleich.Oh, die Pistole hat Travel Time. Das ist dumm. Nee, Pistolen kannst du vergessen. Also PistolenNahkampf, no pass, no pass, aber ganz großes no pass. Hackert, ich bin gehackermant. Kannman das aufheben? Ah, der ist despawned, der da. Was muss ich drücken? F? Okay, Pog.Okay, ich renn jetzt, ich renn jetzt hier rein, weil ich hab. Nein. Oh Gott, Leute.Richtige Noobies. Als wär ich jetzt hier der richtige Hardcore-Pro, ne? Achtung, BigBrain Time. Big Brain Flank. Wenn Tactical Sprint gehen würde, Mann. Äh, wo, wo, woexactly ist hier was? Oh, wie der hackermant. Wie, ich hab nix gekillt? Seriously? Alter,das verzieht ja mal richtig. Äh, ich guck mal, kann ich mich heilen? Ich vermute mal,ich hab mich gehalten. Oh, oh. Wo, wo? Da, nice. Da is er down. Okay, nix wie um dieEck, um die Eck. Das ist ja voll intense hier. Ist ja richtig anstrengend. Da mussman ja richtig, muss man sich ja richtig Mühe geben. Passt es nicht. Guck mal, jetzt kommtwieder von der anderen Seite was. Ich bin mir noch nicht ganz sicher, wann die gemarktwerden. Das hab ich noch nicht gecheckt. Hier ist doch einer. Guck mal, genau hier ist wiedereiner. Oder ist der rote Punkt auf dem Radar etwa kein Gegner? Ich glaube fast die rotenPunkte sind keine Gegner. Sind keine Gegner. Die sind was anderes. Was auch immer. Nurkeine Gegner. Achtung, Heel stellst. Das mag ich. Der Heel könnte ein bisschen schnellersein. Also das ist sehr langsam. Vor allem, weil du da drauf, weil du da runter guckenmusst. Und wenn du runter guckst, kannst du nicht, kriegst ja von der Umgebung nix mit.Jaja, stellts weiter. Aber wir können die Big Brain Drohne losfahren lassen gleich.Okay, hier rüber. Hier drüben sind sie. Ich lasse gleich die Drohne losfahren, wennich weiß, wo die Gegner sind. Wow. Monarch. S. Ach guck mal, ich kann mir selbst Munigeben. Ach nee, N ist der Feuermodus. Da kommt jetzt die Drohne. Achtung, Drohnen stellts.Acht. Drohnen stellts. Drohnen stellts. Gib ihm. Huge Drohnen stellts. Die Steuerung ist haltwirklich pain, pain. Richtig pain. Wo ist die geile Drohne? Oh, sehr gut, sehr guterWinkel. Sehr guter Winkel. Schreckt. Schreckt. Die Drohne, man. Die Drohne ist so geil. Diemacht brutals Damage. Als sagen wir uns, die Steuerung ist ein bisschen gewöhnungsbedürftig.Wo sind sie? Wo sind sie? Achtung, die Drohne kommt. Massive. Mini Panzer. Die Steuerungist wirklich äußerst gewöhnungsbedürftig. Aber seht ihr, die hat einen richtigen Spoilerhinten drauf, die Drohne. Oh, ich bin down. Nee, nee, nee, ich lebe noch. Da steht er.Oh, ich muss weg. Gegen den Panzer kann ich wahrscheinlich nichts machen. Halbes Hovercraft,au. Nein, nein, nein, nein. Der schießt, der macht mich blatt, der Typ jetzt. Ich steheda mitten im Tor. Oh Gott, oh fuck. Ein bisschen mehr Zerstörung wäre schon cool. Ein bisschenmehr Zeit. Oh, hallo, hallo. Hallo. Nein. Ich lebe noch. Das ist doch schon sehr behelfsmäßig,die Drohnensteuerung gerade. Okay, wir gehen mal oben ans Fenster, falls es hier ein Fenstergibt. Der Dude. Oh, genau zur richtigen Zeit hier. Ach, der hat auch keine Muni mehr. Shit.Okay, nice. Wir haben jetzt ein. Wie war das? One shot, one opportunity. Grinch. Wer habenwir nicht? Hat der hier was dabei? Oh, es piepst im Kopfhörer. Oh, macht das so gutwie kein Splash Damage. Jetzt habe ich gar nichts mehr. Ja, das ist schön, wenn ihralle Medics seid. Jetzt habe ich gar nichts mehr. Ich kann keinen Gegner killen. Hatder hier was dabei? Irgendwas? Haben wir ein Mehle? Messer? Irgendwas? Irgendwas? Wasist Nahkampf? V? V, V. Okay, V ist Pains Champion. Wie soll ich den mit V ein killen?Hier, da, da, da, da. Geh weg, geh weg. Okay, perfekt. Eats. Jetzt haben wir wieder was.Z dort auf BG. Warum nicht? Warum nicht? Okay, wo geht's hier? Wo ist jetzt hier? Sekunde,wir schauen mal Map. Was ist hinlegen? Z. Map. Kann man Marker setzen auf der? Nein.Da unten sind sie. Und hopp. Oh, oh. Oh, KS, Alter. Wie findest du das Spiel? Das machterstaunlich viel Bock. Ihr 14 Kills die Runde schon. Alles wegen Drohnenstells. Das machterstaunlich viel Bock, aber ein Problem gibt es und das ist für mich so gravierend, dassich, nee, dass ich eigentlich fast keinen Bock hab, dass langfristig jetzt zumindestdie Beta zu spielen. Die Steuerung ist wirklich sehr, sehr verkackt. Also, der Sprinter nichtrichtig funktioniert teilweise. Das Hängenbleiben, das Rumgewackel, das Sliden und nicht richtigaufstehen und, also, das fühlt sich nicht nach Gewicht an, das fühlt sich einfachnach unfertig an. Aber okay, das ist ja auch eine Beta, das ist alles in Ordnung. War dawas gerade? Okay. Den Kopf. Moment. Zack, ist der nicht gestorben gerade?Ich glaube, der ist dead. Deadge. Hört euch mal den Radio an. Ich will Radio hören. Wolfburg,Stuttgart, Ingolstadt und München, habt ihr das gehört?Bayern ist fast vollständig von feindlichen Truppen eingenommen. Bayern ist fast vollständigvon feindlichen Truppen eingenommen. Bayern ist fast vollständig von feindlichen Truppeneingenommen. Truppen eingenommen. Oh. Maintenance 10 minutes. Oh, okay. But good job on the Betaso far. Muss man mal ein bisschen nett sein. Move and Patch kommt. Wir passen auf, wahrscheinlichMove and Patch. Auf geht's. Move. So, wind is quick. Ja, das machen wir. Wir winnendas jetzt mega quick. Wo sehe ich überhaupt die Anzeige? Wann ist denn voll? Ist bei1000 Schluss? Okay. Oh, guck mal. Blank, Leute. Blank action. The biggest flank of all time.Den Heli brauche ich auch. Nee, nee, nee. Moment, Moment. Viel besser. Viel besser,viel besser. Viel besser. The Pantsman kommt wieder. The Pantsman. Auf geht's. Oh. Okay.Das ist natürlich dumm, wenn da einfach so ein fetter Panzer vor mir steht. The Pantsmanhat mich richtig weggehauen, ja. Den kann man nicht, den Panzer kann man nicht spawnen.Aber wir gewinnen, wir gewinnen. Guck mal. Ich glaube 4500 muss man, muss man haben.Das ist ein Gegnerpanzer, Mann. Gehst da weg. Wenn die Maintenance haben, dann können wiruns den neuen Battlefield Patch angucken gleich. Slider end. Okay, keine Ahnung. Ich habeeinfach mal, ich habe einfach mal in die Richtung gehalten. Oh ja, krass, krasser Beat hier.Catch him. Ich habe eine 1080 Ti. Oh, oh. Was ist der Panzer da? Oh. Alter. Was?Paweczka. Paweczka. Oh ne. Der nächste Pantsman am Start.Ich hoffe, der hat mich nicht gesehen. Oh. Wo? Wo ist der hin? Okay, ich habe Schiss,die Street zu crossen, Leute. Doch, auf geht's. Tactical Sprint. Was, wir haben verloren?Oh ne, loss. Ich camp mich mal kurz in die Ecke. Das ist dumm, dass man runterguckenmuss. Oh, oh. Ich habe es gleich gecaptured. Oh, oh. Mann, Alter. Oh, oh. Oh, oh, oh.Alter. Alter, machen die einen Krach. Okay, wir haben es jetzt. Können sie nicht malspawnen. 5.000 haben wir gewonnen. Okay, 5k haben wir gleich. Oh, nichts wie weg. Move,Alter. Tactical Sprint. Der Tactical Sprint ist halt überhaupt nicht tactical, da funktioniertdie Hälfte der Zeit nicht. Okay. Okay, Pantsman am Start. Pantsman am Start. Jawoll.Pantsman in the ass, ass shooted. Die Steuerung von dieser Drohne ist wirklich krass. Ich.Die Drohne ist so geil, Mann. Das ist so heftig OP, das Ding. Victory, easy, easy win. Dazukann ich nur sagen. Nee, du musst Veteran sein, das heißt, das Spiel vor 2 Jahren aufSteam gekauft haben oder du kaufst dir für 13€ den Beta Access, wobei ich warten würde.Ich würde wirklich abwarten. Wenn du das Spiel damals gekauft hast, Scoreboard. Guckmal, es gibt ein richtiges Scoreboard. Wie ist das eigentlich möglich? Wo haben diediese Technologie her? Wo gibt es die Technologie für Scoreboards? Also ich meine sicher, wenndas so einfach wäre, hätte so ein großes Studio mit so einem riesen Publisher dahinterwie DICE das auch gekonnt. Also das ist ja, das glaube ich, das ist absolut neueste BleedingEdge Technologie. Die Zukunft ist da, ja. Es ist ja 2042 hat man das halt nicht mehr.Okay, die haben Maintenance. Wann haben sie Maintenance, sagen sie? 90 Minuten? Was habensie geschrieben? Ah, in 10 Minuten, 90 Minuten wäre Maintenance, okay. Ja gut, dann gehenwir mal raus und warten mal bis die Maintenance vorbei ist und gucken uns mal eine Runde Battlefieldan. Ich muss das Game umstellen, wie der neue Patch ist. Battlefield 2042, fertig. Bam.Also, kurz ein bisschen gedudel an. Nein, nein, nein, bestimmt nicht den BattlefieldSoundtrack. Viel besser. Weniger Hovercraft, okay also Patch, Battlefield Patch. Bevorwir anfangen, hier, Battlefield Patch 2. Wir gucken mal schnell rein, was sich geänderthat. Also, Hovercraft, Little Bird, Dings wurden adjusted. PPGar29 mehr Recoil, dasprobieren wir gleich mal aus, ob die immer, weil ich mein, wenn sie der PP29 einfachnur mehr so vertikalen Recoil gegeben haben, dann ist das überhaupt kein Ding. Dann kannstdu einfach runterziehen. Okay, Bullet Spread Reduced, wir probieren jetzt gleich mal, wirprobieren jetzt gleich mal Assault Rifles aus. PP29, Little Bird, Super Hockum, OverallMinigun Land Vehicles, UAV in Bad Company ist wieder am Start. Breakthrough, haben siewas an Breakthrough, haben sie was an den Blacks gemacht? Nee, das heißt Breakthroughist immer noch nicht richtig spielbar. Na gut. Dann schauen wir uns das doch an. Abgeschlossen.Park Download Manager, auf geht's. Gehen wir. Ich muss jetzt gleich das Game Capture umstellen,weil es immer, wobei Battlefield ging, Battlefield ging, im Battlefield hat ja nur im Menü geruckelt.FeelsBadMan. Ich guck mal ein bisschen Chat, während das lädt. Wie gesagt Beta, man brauchthier, 1 for 3 Steam. Nein, Battlefield möchte jetzt in den Vordergrund gehen. On Steam hatman hier das Beta Pack für 13 Euro, wobei ganz ehrlich, hat man dafür überhaupt, jadas sind irgendwelche Skins, braucht kein Mensch. Also, dass es ruckelt im Menü istnormal. Auf geht's, Play. Dann spielen wir vielleicht gleich noch ein paar Runden. WorldWar 3. An den Flaggen, ob die an Breakthrough was an den Flaggen gemacht haben. Weil Orbitalwar kacke, Kaleidoskop war kacke, Hourglass war kacke. Ach Leute, die Subz habe ich jakomplett übersehen. Ja, ihr habt ja recht. Moment, Moment, Moment. Danke für die Subz,wen haben wir hier am Start? Subze. Kaijit1. Gerhenrik. Pog. Sandpp. DavidsuStyle. DerTaser hat verlängert. Aja ja, aber richtig hier. Ne, das war's. Und irgendwer hat gesterngegiftet? Anygifters? 500 Bits, ja, hab ich nicht gesehen. Gönn euch Subz. Dankeschön,wer hat denn hier gedodged? Alle erfolgreich gedodged, Leute hier. Außer JustSky, Ryukenshin,Sandwich, Adonis, Adipo, Adipös. Also der quasi Pepofet Adonis. Defi und xPubot. Aufgeht's. Leute, das hat bis jetzt, iiih, mp9. Ok, mp9 ist ziemlich das dümmste, was du hierspiele kannst, Ridiploi. Das hat so lange geladen, das Game. Bis jetzt, bis jetzt hates geladen. Ok, pp29, wir müssen es jetzt ausprobieren, Leute. Pip, lass mich pleasehier spawnen. Sack, Sack, Sack, Sack, Sack, Testen, Sound, Display. Ok, stimmt alles.Was denn hier? Die Sense fühlt sich schepp an im Vergleich zu dem anderen. Ich liebeBattlefield 2042, who's? Wegschneibert. Mal gucken, ich bin mal gespannt, wie sich diepp29 spielt. Gut, gerätzt werden wir hier nicht. Wir switchen mal, wir switchen malvon der Ollen zu Crapling Man. Leute, ich hatte das Game übrigens zwischenzeitlichuninstalliert, ne? Ich hab nur für den Stream wieder installiert. Ich hab gedacht, komm,das können wir uns mal angucken. Oh, was ist denn da vorne los, man? Bisschen leise, oder?Bisschen leise. Mal nen Ticken lauter hier. Ja, so ist besser, ne? Alles klar. Ja, dasRätseln ist wirklich, äh, es ist rätselig keiner. Man selbst rätselt aber auch kaum.Hier ist halt richtig klasse da. Warum spielen wir eigentlich gleich die schlechteste Mapzu Release, äh, zu, wir haben die Beta gespielt, die haben grad Maintenance, ja? Die habengrad Maintenance, die haben sich sogar bei uns im Twitch Chat gemeldet und haben gesagt,sie haben gleich Maintenance. Das Spiel ist so abfackt, da ist einfach so, da ist so viellos, man. Gibt eh jeder Instant aus. Das hab ich schon gesehen in Patch 3. In Patch 3kommt angeblich eine Ent-, oh, na, Mist. Eine Entfernungsanzeige für Medics und dieMedics können dich dann wohl angeblich auch pingen, dass du sagen kannst, ähm, ob siedich wiederbeleben wollen oder nicht. Okay. Darf ich jetzt mal irgendwie einen Gegner headon sehen? Jetzt machen wir Big Brain Play, passt auf. Warum ist das Spiel eigentlichzu broken? Jaja. Pass mal auf, vielleicht gehts jetzt. Hovercraft am Start, nice. Gefixtist, gefixt ist Hovercraft am Start. Ich schätze. Ist das Hovercraft wirklich gefixt, by theway? Die Sache ist, oh, nice. Die Sache ist die, wenn der PP29 nicht mehr spielen kann,was spielst du denn dann jetzt? Alter Mann, dieses Spiel, es ist, ich, es ist, ich warganz normal drauf, als ich das andere gespielt hab, ne? Aber kaum ist Battlefield 2042 amStart, leg ich mich instant auf. Nee, MP9 auf die Range ist Müll. MP9 hat ausgewebt,dann machen wir es doch jetzt mal anders. Dann nehmen wir doch jetzt mal Assault Rifle,die hier angeblich dafür da sind, hier auf diese Range zu spielen. Sehr gut. Exzellent.PoK, die hab, hab ich die schon? Hab ich die schon? Naja, gut, der Grappling bringtja grad gar nix. Geh mal hier rein. Oh, jetzt können wir Fliegestell machen, Leute. Ichbin ein, wie hat letztens einer so schön gesagt, ich bin ein Ironsight-Enjoyer. LangerSaks, Rest passt. Wollte jetzt eigentlich runter, hinterfliegen. Wollte eigentlich hinterfliegen,aber ich, ich kann nicht abheben. Wir probieren mal, ob ich abheben kann. Okay, nop, nop, nop.Gut, hier ist ja noch gar keiner. Oh, ein Rauf da. Ist Assassin's Creed kacke? Weißich nicht. Ja, weil Haller ist sackig. Ich mein, das ist einfach nur flach. Halo istwirklich gerade am spaßigsten von FPS. Ja, ist wirklich so. Es ist einfach nur breiteFrontline. Äh, äh, ich hab die gerade durch, durch, durch, durch Air, durch die Luft erschossen.Also nicht durch die Luft, durch, durch, durch das Ding durch erschossen. Habt ihr's gesehen,die war eigentlich schon längst dahinter. GG Game. Ja, nice. Okay, irgendwie ist esauch noch nicht viel nicer, sind die Assault-Rifles auf Range-on geworden. Oh, oh, oh, oh, Monarch.Alter, die Assault-Rifles. Mit der alten PP-Gard 920 hätte ich ja schon drei Gegner gekillt.Okay, oh, oh. Okay, das war PP-Gard von mir, da kann die Waffe wirklich nix für. Oh,oh, oh. Nice. Äh, ich wollte eigentlich gerade die Scatternade schmeißen, aber ich hab denKnopf nicht gefunden. Die Sturmgewehre gehen voll fit, das werden wir jetzt sehen, dasfinden wir jetzt raus. Also mein Lieblings-Setup für die M5 ist ja das mit Schnellfeuer. Alsoim Prinzip das da, da, Game, das da, das Game. Ist das verbackt jetzt? Ne, das hat sich jetztnicht so gelohnt. Okay, die müssen, die müssen ja hier irgendwo lang. Irgendwie da großartigrumstellen ist hier unten hat ja so keinen Sinn. Vielleicht kann ich irgendwo hinfliegen.Irgendwo sinnvoll. Oh nein, nicht hängen bleiben. Hängen bleiben ist gleich dead. Okay, hochkommt man hier nicht. Unka! Wieder einfach mal der Jet am Start ist. Oh, jetzt wird gepusht.Puschke, Puschke. Puschke. Motion. Man ist halt dauergespotted auch in dem Game, ne. Dahätte ich weiter wegspringen müssen, ich dachte es läuft weiter. Oh, Poggers. Ich magdas Schnellfeuer Ding. Heil dich, heil dich. Knopf. Oh, da habe ich es ja von oben. Abergut, was willst du machen? Also ich muss sagen, ich habe tatsächlich das Gefühl, die M5 istein bisschen genauer. Was richtig gut ist, weil die M5 mit Schnellfeuer macht auch richtig,richtig gut DPS. Wie kommen wir denn jetzt hier am besten rauf? Was zum? Ah, okay, derist dead. Der ist ja dead schon. Hat man bloß nicht erkannt. Das Game hat sich gedacht,nope, das spawnen wir jetzt nicht oder das despawnen wir jetzt nicht. Ich will eigentlichauf der anderen Seite hoch, aber ich glaube, das funktioniert so nicht. Oh, ah. Okay, was?Ach ja, aber dicke Spot XP. Was ist das für eine ppega Map? Das ist die beste Map in Battlefield.Nein, die sucked hardcore. So wie fast alle Maps, aber das ist mit Abstand die schlechteste.Game please. Nein, okay. Pants man. Hallo. Und Tschüss. Halfway to victory, aber gleichist die Base weg. Von wegen halfway to victory. Halfway to ppega eher. Was hintet mich dennvon der Seite? Geh weg. Geh weg. Ich meine, mit der pp920 konnte ich den Typ wenigstenswegsprayen über die Distanz. Reds please. Reds please. Reds please. Ehrenmänner, Teammates.Ehrenmänner, Ehrenerinnen und Ehrenfrauen hier. Please. Please. Battlefield 2042 in a nutshell.Da machst du nix. Echt, das ist deine Lieblingsmap. Das kann ich nicht verstehen. Ich finde,die sucked einfach nur richtig krass. Oh hier, bashen, bashen, bashen. Ja klar. Na klar.Weil das auf Range auch so easy ist zu treffen. Alter, please. Kill die halt mal einfach.Geile Waffe. Weißt du, die haben sich gedacht, wir machen riesige Ranges hin, aber Waffen,die 5 Minuten brauchen Gegner über Ranges zu killen. Ich meine, ich spiele das Dingjetzt auch nicht in dem Setup wegen der Schussfrequenz. Hat sich was verbessert. Ich habe bis jetztweniger Hovercrafts gesehen. Aber ansonsten, nee. Das ist einfach riesiges Terrain mitnix. Ja. Büt, büt. Vielleicht, ich droppe jetzt auch einen Ranger. Ja, bam, Ranger.Ranger drop. Ich weiß gar nicht, woran die jetzt gestorben ist überhaupt. Guck mal an,was für riesen Fronten. Ok, da kommt ein Panzer. Da fliegt. Nice. Oh guck mal, ein Hovercraft.Ich dachte, oh, oh, oh, oh, oh, oh, oh. Ok, vor dem Patch wären wir definitiv tot gewesen.Vor dem Patch wären wir down gewesen. Das macht nicht mehr so viel krass Damage, oh,oh. Das macht, also der Heli macht nicht mehr so viel Splash Damage wie vorher. Ist dasdie Map mit den Pingui? Kann schon sein. Es ist auf jeden Fall die schlechteste Map imganzen Game. Nicht, dass die anderen wahnsinnig gut wären, aber diese wirklich doppelt, doppeltund plus mies. Aha, ach nee, ich bin Spotter. Will kein Spotter sein.Eigentlich macht es überhaupt keinen Sinn. Alles klar. GG Eats. Was, was Grinnt man inHalo eigentlich so den Season Pass? Ansonsten, ich spiele auch nicht ranked. Ich spiele auchbloß die ganz normale Playlist. Ok. Nice, wir fahren jetzt hier mit dem Typ.Alter, beweg dich doch nicht so. Nicht so viel Moven. Nicht so viel Moven.Ok, es macht, finde ich, ein bisschen weniger Damage, die Gatling Gun. Das sind keine Bots,nee, das sind Spieler. Ich finde, die macht ein bisschen weniger Damage als vorher. Oderdie Spreader, die hatten mehr Spread oder so. Das kann auch sein. Würde gerne spawnen,wenn das erlaubt ist, wenn das irgendwie möglich ist. Danke schön. Alter, was kommt denn dafür eine Lawine runter? Gachibass. Pass mal auf, kann man von hier starten? Vorgass.Was ist World War 3? So eine Mischung aus Rainbow Six-Gestellte mit Battlefield-Einschlägen.Wobei, es hat halt Movement aus der Hölle. Noch. Mal gucken, ob es besser wird. Ja, dashat nicht so gut funktioniert, wie ich mir das vorgestellt habe. Guck mal noch mal hierhin. War das nicht geplant? Ich merke das gleich, ich bin schon ein bisschen raus. Einfachweil ich jetzt ein paar Tage nicht gespielt habe. Aber ich vermisse es ehrlich gesagtauch nicht. Battlefield 2042 hier. Oh, guck mal hier, was er kann. Wie er nice. Ich meine,wer hat sich gedacht, diese Waffen sind gute Range dafür? Wer hat sich das überlegt?Wer hat sich gedacht, oh ja, die Assault-Rifles auf diesem Range, ja, das ist schon gut so.Ich meine, es gibt ja nichts, was du auf diese Range gescheit spielen kannst. DMRs vielleicht.Ich bin ein Ironside-Enjoyer. Und als Ironside-Enjoyer, aha, enjoyt man Ironsides. Aber die Visierewürden es jetzt auch nicht großartig anders machen, bei dem Gewackel. Richtig, Männerbrauchen Ironsides. Richtige Schützinnen brauchen Ironsides. Please sterbt halt mal.Nice Game. GG Eats. Es ist lächerlich. Es ist so hardcore lächerlich. Ja, die PP-29wurde genervt und jetzt kannst du nichts mehr spielen über Range bei diesen Riesen-Maps.Ob das jetzt so viel besser ist, bin ich mir da nicht so sicher. Hab da so meine Zweifel.Oh. Ich hatte aber drei Gegner, egal mit wie viel Spread hätte es hitten müssen. Undich habe hier extra Rapid Fire genommen. Das kann es trotzdem nicht sein. Yeah, nice, easy,verloren, yeah. Okay, vielleicht, vielleicht, oh nee, da fährt was rum. Alter, wie sollich denn, wie soll ich jetzt hier rüberkommen überhaupt? Ich weiß, dass neben mir wasist, aber vielleicht schaffe ich es da. Probieren wir mal AKV 24 mit Extended Max. Okay. Ichhabe für die noch nichts frei gespielt. Probieren wir mal. Wir machen nochmal was anderes. Ichgucke mal, ob das wirklich an meinen Attachments liegt, dass die nicht sterben. Ja, lass michrein hier. Perfekt. Nicht jetzt, genau. So, jetzt habe ich ja explizit den Range-Stellzdrauf. Alles klar. Oh Mann, Game, come on. Ich sage euch, ich aninstall gleich. Das isteinfach so ein Crap. Ich habe die ganze Zeit Leertaste gespammt. Es hat einfach nichtsfunktioniert. Aber vielleicht können wir das noch gewinnen. Also hier auf der Map,hier geht es ja eigentlich. Hier kann man schön Dach stellen. Übrigens, es gibt einenrichtig geilen Trick. Gucken, ob ich den hinkriege. Wenn die hier reinpushen, wenn man sich hierin die Ecke schießt, das klappt manchmal, dann bleibt man, wenn das Spiel der Meinungist, man darf, darf man da oben drauf stehen und es sieht keiner. Das checkt, das checkendie nicht. Wir können eigentlich Rapid Fire spielen. Machen das hier eigentlich? Effectiveauf Range. Nee, wir müssen auf Range, müssen wir das hier spielen. Was kommt denn hier?Was ist hier los? Wo wird hier gestellt auf der Map? Wo ist passiert überhaupt was gerade?Ach, wir verlieren C2. Ja, das ist ja gut zu wissen. Aber C2 sollte wieder eingenommensein, denke ich mal. Man kann ja nicht zoomen und sieht nichts. Nee, C2 ist glaube ich vorbei.Na klar. Wo kommt denn hier jetzt was an gerannt? Alles klar. Es ist explodiert, ich weiß nichtmal von wo. Nicht bei Ansatzweise. Jetzt, jetzt sehen wir, ob es noch OP ist oder nicht.Wir fahren jetzt eine Runde mit. Okay, da kann das genauso gut wie ich mit dem Hovercraft.C2, gib ihm. Und raus hier. Ey, du sollst nicht so weit springen. Hab gehört neuer PatchRettet Battlefield. Oh ja, offensichtlich. Obvious Lee rettet das Battlefield. So, jetztsind wir close dran. Jetzt können wir auch mal ne Runde Dings hier spielen. Wir schreien.Gatschi Buzz. Okay, okay, okay. Wo sind wir? C2. Wenn der C2 ist. Achtung, Achtung, jetztkommt Big Brain. Stonks. Ihr seht mich alle nicht. Ihr könnt mich nicht sehen. Unmöglich.Unmöglich zu sehen. Unmöglich zu sehen. Kann man die PP29 wegwerfen? Nee, ich habirgendwie den Eindruck, also ich könnte mir vorstellen, dass die PP29 immer noch diebeste Waffe ist. Ich müsste das mal ausprobieren. Müsste das mal ausprobieren. Haben wir da?Ich will kein Spotter sein im Tank. By the way, es ist übrigens normal in dem Game,dass man permanent tot ist. Ist by design. Okay, ich glaube retten kann mich hier obenkeiner. Die MP9 ist auch auf Close Quarter ziemlich nice. Gerade mit, ja das ist dasrichtige Mag. Also gerade mit diesem Magazin für ein bisschen mehr Schuss. Standardmäßighat es einen Ticken zu wenig Schuss, finde ich. Delsen wir mal rüber. Vielleicht kriegenwir irgendwas weg. Da kommt was. Ey, warum ist das so verbugt, man?Okay, okay. Ich bin in Ordnung.Die checken es nicht, lull.Oh, ein rotes Fass, rotes Fass, gefährlich.Rotes Fass, ganz schlecht.Rotes Fass, ganz gefährlich immer.Oh, Monka, Monka, alles klar, ne, du hast keine Ahnung warum das die Leute so krasshat, das siehst du doch hier, für einen Gegner den du siehst, seh' ich halt 20.Das ist übrigens das beste Gebiet auf der Map, hier kann man das halbwegs spielen.Ich mein, dafür kann ja ruhig jeder seinen Spaß dran haben.Aber dann sich so zu stellen, ich verstehe nicht warum es die Leute haten, ich mein,es gibt 30 Milliarden Videos die die Probleme erklären, die die Leute mit dem Spiel haben.Also man sollte es zumindest nachvollziehen können, ob man das selbst dann Spaß dran hatoder nicht, ist ja was anderes.Aber ich glaube nachvollziehen sollte es nur mittlerweile jeder können.Ja, die PP29 hat sich geändert und das Assault Rifles jetzt theoretisch einen Ticken bessersind.Theoretisch.Oh, wir machen jetzt unsere Big Brain Tag, das ist zum Beispiel was was mich abfuckt.Du siehst, du weißt nicht was abgeht, von wo irgendwas ist und bist down, ja beste, beste.Kommst du her, komm her, kommt ihr her, kommt ihr her, irgend einer, Leute, das ist nichtdie Battlefield Experience.Fuck, ich hab mich zu sehr bewegt.Die Battlefield Experience war zwar immer nicht ganz übersichtlich, aber noch halbwegskontrollierbar und durchschaubar.Das ist es einfach nicht mehr, das regt mich auf.Deswegen kann ja jeder spielen, wenn er da Spaß dran hat, ich hab ja kein Problem, wenneiner das Game spielt.Ja, aber wenn du Videos gesehen hast, wo die Bugs drin sind, dann ist es ja offensichtlichso, dass die Bugs existieren.Dass du die nicht hast oder dass sie dir nicht auffallen, macht die ja nicht weniger existent.Ja, die Hovercrafts sind jetzt nicht mehr ganz so krass und die PP29 ist ein bisschenschlechter, mit mehr Recoil und die Assault Rifle sind angeblich besser.Aber es ist immer noch im Kern, gleiches abgefucktes Battlefield 2042.Was ist hier?Ah, das ist ein Ranger, ok.Nee, und spielbar ist das nicht, wenn man spielbar so definiert ist.Man kommt in das Spiel rein und kann das genießen will ich nicht sagen.Das kann rumlaufen und ein paar Gegner killen, das funktioniert, also die absoluten Basics,die ein Multiplayer Spiel haben muss, die sind da.Hätte man das vielleicht nicht als Battlefield angepriesen, hätte ich vielleicht sogar wenigerSchmerzen mit gehabt.Was ist hier los, wir werden eh gleich von der Seite gebashed.Alles klar, jetzt wissen sie, dass ich oben bin.Hab ich eigentlich ordentlich FPS?Ja geht.PP29, ok die spielen immer noch alle PP29, ich mach das jetzt auch.Ich mach das jetzt auch wieder und guck ob das wirklich, ob das wirklich so viel schlechterist.So, gib ihm.Oh, ich muss schnell sein, die sehen mich, oh, 50 Milliarden Gegner, 50 Milliarden Gegner,50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden,was genau geht hier eigentlich ab?Was war der Unterschied von Battlefield 1 zu Battlefield 5?Naja, 2. Weltkrieg statt 1. Weltkrieg und ich glaube, ich glaube das erste war weiblicheSoldaten, wo es sich alle drüber aufgeregt haben, da kann ich mich noch dran erinnern.Da waren sie alle richtig, richtig nice getriggert.Ich dachte nein, das darf nicht sein und by the way, warum kann ich hier nicht rüberspringen?Also, hallo, ich möchte auf diesen, hier doch, ok, die zieht deutlich mehr, die PP29, diezieht deutlich mehr, jetzt habe ich es gerade gemerkt, die zieht deutlich mehr jetzt nachdem Patch rum.Ich würde sagen nach links oben, nach links oben, könnte sein, hat sich gerade so angefühlt.Ja, ok, ok, oh, wie hat der mich davon da gekillt, guck mal, der sieht mich noch nichtmal, jetzt ist er nicht mal mehr spielbar, ja, das stimmt schon, man hat jetzt halt ineinem Spiel, was einfach hauptsächlich, also man hat kaum Waffen in diesem Spiel, die fürdie Distanz gemacht sind, über die sich das Game abspielt, das ist sehr merkwürdigesDesign von den Battlefield Leuten, sehr, sehr merkwürdig, so, da steht irgendein Typ mitder Gatling gun und ballert rein, nice, gepega aim, oh, ich will da nicht rein, hier istnichts, guck mal, hier ist einfach legit nichts, wo du rüberpushen kannst, hier ist einfachnur randomized, guck mal, guck mal, es ist einfach flach, du kannst da nicht langlaufen,einfach nur flachok, ich brauche Sundance mit den Granaten und was man auch hier dran sieht ist 128 Spielerist eine dumme Idee, ich meine, the fuck, wie soll denn hier irgendjemand noch was checken?ich brauche die Sundance Granaten, sonst geht da nichtsguck mal, die aimen mich schon abalso, ganz ehrlich, 64 Spieler hätten es wirklich getan und die Map ist einfach kleiner,gut, mp9 funktioniert, wir müssen auf jeden Fall switchen, McCree bringt uns hier nichtsvon Mobility, wobei hier jetzt McCree wirklich nice ist, komm, wir nehmen noch mal, nehmenwir jetzt einfach noch mal, schnell Feuer dran, ja ja, alles gut, Ironside Enjoyer Max istwieder am Start, pass mal auf, wir machen jetzt Big Brain Move, obacht, weiß ich genau, woder hin ist, ist der down, wo ist der hin, also Massive Massive Move machen wir jetzt,in der Hoffnung es funktioniert, ich höre mich nicht sehen, sind die oben, ich weißda, ihr weiß da halt auch nicht, sind die oben, sind die unten, kann man nicht, ich meine,das ist der sittliche Mehrwert, dass man da oben hin kann, da ist tatsächlich einer,dieses Spiel man, du kannst da wirklich rauf, gepega hoch drei alles, oh, gib ihm, gibihm, ok, ich wollte jetzt eigentlich, da ist, ja klar, easy, der Patch, ja, der Patch hatjetzt dafür gesagt und gesorgt, dass die einzige Waffe, die man sinnvoll spielen konnte,auf den Kampfdistanzen des Games nicht mehr gut ist, sehr gute Idee, richtig, richtiggut, kann ich da rauf jetzt, ok, nice, beweg dich, ok, next please, ich weiß halt nicht,wo da was ist, ich will eigentlich Big Brain Move machen, ok, der Big Brain Move geht anders,das Problem ist, dass hier gerade zu viel los ist für Big Brain Move, der Big BrainMove ist vollender, was, was, der ist nicht gestorben, lul, ey, oh, oh, oh, oh, oh, oh,oh, oh, oh, oh, oh, da ist was, bin mir nicht so sicher, ob ich da, der Stream war schonimmer 48 FPS, ja, alter, Sniper, jetzt Sniper, ey, Game, was ist das, was ist das, das istdoch nicht denjenigen ernst, warum sterben die nicht, ich weiß wirklich gar nicht, daskann doch nicht sein, warum, warum stirbt man bei sowas nicht, das leuchtet mir, alsowirklich, dass man sich da wieder dabei gedacht hat man, und wir haben schon die Maximum-Damage-Variantedavon, ich konnte nichts machen, by the way, ich konnte nichts machen, jetzt ist das Gameangecrashed, geil, richtig geil, richtig gutes Game, das ist einfach so abgefuckt, ist wasandere wieder online, BF3, hey, ich hab ne Battlefield 3 Gameplay, Leute, das lad ichdemnächst hoch, Return to Battlefield 3, nicht, dass es irgendwie jetzt heißen würde, ichspiel das jetzt täglich oder so, aber, komm, eine Runde probieren wir noch, ne, ich werdheute wieder weiter Halo Cri'n heute Abend, in Portal bekommt man XP, ok, also eine Rundewill ich noch spielen, eine Runde machen wir noch, dann machen wir entweder WW3 weiteroder ich geh was essen, ich hab Hunger langsam, mal gucken, während wir suchen, nicht Conquest,während wir suchen, das ist ja der Witz, wisst ihr was, was auch ein richtig guter Indikatordafür ist, dass es Broken-By-Design ist, Conquest ist eigentlich der bessere Spielmodus, aufden Maps, aber dadurch, dass halt so ewiges rumgerenne und nix los ist, spielen die Leutelieber komplett Broken Breakthrough, heute kam der Patch, der Patch, der alles gefixthat, ja, nein, es wurde im Prinzip nix großartiges gefixt, was das Spiel besser macht, ja,warte mal hier, Steam-Stats, Battlefield 2042, gucken wir mal, BR4, ich mein, das ist nichtwirklich repräsentativ, ne, das ist Battlefield 4, das ist nicht wirklich repräsentativ,weil Origin und Konsolenspieler und so, aber die haben halt schon mal einfach 50% ihrerSpieler verloren, in, keine Ahnung, in den ersten zwei Wochen, was sagst du zur Roadmap,ganz ehrlich, das was ich noch am interessantesten finde, bei der Roadmap ist, dass es Rush inPortal gibt, aber wenn die gleichen Leute, die Breakthrough fahren, platziert haben Rush,Encoms platziert haben, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein,nicht our Breakaway, ganz bestimmt nicht, ganz bestimmt nicht, was wollte ich jetztsagen, ja genau, also und, genau Rush und die 150 Fixes für die Maps, auf die bin ichauch gespannt, ob die die Maps halbwegs spielbar machen, ich persönlich fürchte nicht, zumaldie Sache halb die ist, die müssten jetzt ja eigentlich richtig krass mal rankommenmit Content Drops, die müssen ja das Spiel exciting halten, wie man so schön sagt heutzutage,aber die sind ja gerade aktuell damit beschäftigt, komplett das zu fixen irgendwie, also dasist so ein zweischneidiges Schwert, ja, du musst das Spiel fixen, weil ansonsten rennendie Leute weg, wenn du kein Content bringst, rennen die Leute aber auch weg, oh Gott, istdas euer Ernst, erst kommt Breakaway, jetzt kommt Our Class, die zwei schlimmsten, schlechtestenMaps hintereinander, ja gut, gut sichtbar alles hier, ja sehr gut, übrigens ist auchein Kritikpunkt, den es gar nicht bis in mein Video geschafft hat, ich finde die Fahrzeugezum größten Teil mega lame, also klar ist das manchmal richtig OP, aber ich finde dieFahrzeuge an sich langweilig, erinnert euch noch dran, was das so richtiges Helimeter war,wo du unter dem Radar nimmst in Battlefield 4 und Battlefield 3, oder ob du irgendwelcheanderen Lowdots, so Heatseeker nimmst oder sonst was, so ein richtiges Fahrzeugmeter,das existiert nicht, Panzer Attachments sind eigentlich auch zum größten Teil totalerCrap, das schlechteste Panzer Attachments ist die Shotgun, es gibt so ein Shotgun alsPanzer Attachments, ich weiß nicht, ob ihr das schon mal gesehen habt, das ist einfachnur richtig pepega, das killt nichts, das ist auch über die Range, da kannst du haltnicht mehr drauf schießen, nice Game, sehr gut, Poggers, ganz großes Kino, der durftenicht sterben, nicht sterben, kein Ding, Shotgun 0, ja die Shotgun ist angeblich jetzt auchbesser, habe ich gelesen, ach nee, Moment, Moment, sie haben für alle den Spread reduziertaußer die Shotgun, nee das stimmt nicht, weil ich gesagt habe, die Shotgun ist genausogut oder fast, fast useless wie vorher, das capturen die, da rennen gerade 40 Leute drauf,kann mich nicht entscheiden Leute, ja natürlich ist das Aim nicht wirklich on point, wenndu da 50, ich habe den Gegner nicht mal gesehen durch den ganzen Rauch, aber trotzdem, ihrhabt die Hitmarker gesehen, ich komme, ihr habt die Hitmarker, der ist zwar ver-aimed,ja aber ihr habt die Hitmarker gesehen, der hatte bestimmt 5 Hitmarker, die Katze istrichtig, oh hier darf ich ja nicht hin, ich habe es ganz vergessen, achja, ja kill mich,alles gut, ok, Hourclass spielen wir nicht Leute, Hourclass spielen wir nicht, irgendwas,so vielleicht, vielleicht Manifest, Manifest, ich gebe mir ja sogar kein Leidoskop meinetwegennoch, aber please, nicht Breakaway oder Hourclass, Praege Leute, Praege, Praege, was kommt,Kaleidoskop, ok, ok, die kann man spielen, hier unten steht übrigens die Map, weil hierwar zu wenig Platz, wisst ihr, dieses leere Feld hier in der Mitte, da war zu wenig Platzdie Map anzuzeigen, Custom Load Sequenz für eine Map zu machen oder so, das geht nicht,echt du magst Manifest nicht, ich mag Manifest, ich mag sowohl den Containerhafen als auchoben das auf dem Berg, was genau hat eigentlich dieses Schiff mit dem Spiel zu tun, fälltmir gerade auf, was hat das Schiff im Ladebildschirm und das Schiff im Intro eigentlich mit demSpiel zu tun, es gibt in dem Spiel überhaupt keine Schiffe, es gibt Hovercrafts, ach dieStory von Irish, ja das kann sein, aber es gibt es halt im Spiel nicht, hat halt, hathalt mit dem Spiel nichts zu tun, es gab einen Kurzfilm, ja super, es gab einen Kurzfilmmit einem Schiff, aber es gibt, das ist ja auch schon mal wieder widersprüchlich, esgab einen Kurzfilm mit einem Schiff, aber es gibt kein einziges Schiff im Spiel, außerdas auf, ähm, äh, wie heißt das D-Dings, deconstructed, ne wie heißt die Map, mitdem kaputtenen Containerschiff, Songdo, wir sind Attacker, das ist schon mal ganz gut,ja, wir striken richtig, discarded, genau, deep lore, die unfassbar vielen DLCs von Battlefield5, wie viele Handbilder von Battlefield 5 haben wir am Ende jetzt gehabt, einen, einen,die Pacific Maps, ja du kannst die Map nicht gewinnen als Attacker, ne ne, werdet ihr auchgleich sehen, dass man die Maps nicht gewinnen kann, oh oh, ich bleib mal kurz hier dringenau, da, da, da passt, ok, was, alles klar, game, das hat gut funktioniert, was zum,das war die Messer-Animation, oder, dass ich die nicht killen durfte, ich glaub das wardie Messer-Animation, echt, du hast es geschafft hier, was, wirklich, ich hab noch nie einen,einen Attacker-Win erlebt hier, dachte das ist gar nicht möglich, kein Ironside-Enjoyermehr, hat sich ausenjoyed, und wir haben A2, nice, easy, ok, auf die Range brauche ichwas anderes, ah, One-shot-Sniper, bashen, alter, bashen, naja, aber Motion-Sensor istgut, weil Motion-Sensor immer gleich fett XP, ich bin tatsächlich richtiger Ironside-Enjoyerin so Games, also ich sag euch, wie das, das war zwar ver-aimt, am Anfang, am Battlefield3, wär der gestorben, instant, noch, mit einem M16 oder MP16-Burst, na guck mal, dawillst du was anschleichen von hinten, was ist hier, was soll das, ok, ich seh ihn nicht,ich seh ihn nicht, ich hab keinen Plassen-Schimmer, wo er ist, oh, da ist ein Auto, ok, nice, M16,weil die M16 war halt broken as fuck in Battlefield 3, aber, die haben es trotzdem hingekriegt,obwohl es quasi eine universell beste Waffe eigentlich in fast allem gab, also Allround-mäßig,mit fast besten Stats in fast allen anderen Stats, mit der M16 haben sie es trotzdemgeschafft, dass es competitive war, was anderes zu spielen, du konntest der AEK spielen, dukonntest der M416 spielen, du konntest der M490 spielen, wenn du das gut konntest, ach,ich find's so gut, dass die Leute sterben über Range, was gab's denn noch, AS Valkonszu spielen, aber das war ja so ein allgemeines Ding, was hat's noch, also AK war in Battlefield3, hat er halt gesagt, AEK M16, M416, F2000, F2000 war ein bisschen AEK für Arme, ja,das stimmt, aber was ist hier los, ist halt auch einfach alles flach, wie das Game nachdem Patch läuft, im Prinzip genauso schlecht wie vorher, ach, war die F2000 DLC Waffe, dakann ich mich nicht mehr dran, oh, jetzt wollte sie mich retten, da kann ich mich nicht mehrdran erinnern, ob das DLC Waffe war oder nicht, P90, oh ja, P90 war mega poggers, P90 warmega poggers, hier ist alles wieder so flach, man, was willst du hier machen, schön gespottet,oh, oh, any spotters, es ist einfach nur komplett flach, Farmers, nee, Farmers fand ich nichtso geil, Farmers fand ich jetzt nicht so wahnsinnig, nice, ach guck mal, wir haben A1, ok, da istwieder alles wie gedacht, man passt wieder, ich meine das geile ist ja, dass diese Ranges,diese Range ist quasi mal mit Noshah Canals betrachtet, das wo ich jetzt gelaufen bin istNoshah Canals vom Meer bis zu den Bahnschienen, oder waren das Bahnschienen, das war NoshahCanals Meer bis zu den Bahnschienen, das war die komplette TDM Map, die ich gerade gelaufenbin, so einfach mittendrin in der Runde, ohne dass es irgendwas besonderes war, und hierist auch wieder komplett offen, Moment, wir müssen unsere Granaten umschalten, ach nice,ist kaputt, es wäre eine Frechheit die Seasons zu starten bevor das Game gefixt ist, sagtder Chat, ich glaube den wird nichts anderes übrig bleiben, die müssten die Seasons starten,weil du hast im Prinzip ja zwei, hier kann man hoch, interessant, Pog, ich blinke Leute,ich blinke, warum blinke, ich wurde Gehackermann, die haben ja im Prinzip nur die Auswahl zwischenPest und Cholera wenn man so will, die können das Spiel erst komplett fixen und dann rennendie Leute weg, die es jetzt spielen weil es kein Content mehr gibt, oder die bringenContent und alle regen sich auf, dass keiner fixt, also im Prinzip können die es gar nichtrichtig machen, und das ist das Problem wenn du in so einem Zustand launchst, du musstjetzt nicht nur fixen was eh immer zu machen ist und neuen Content liefern und das pünktlichund das möglichst schnell, nein, du musst auch erst noch mal dein Game fertig entwickelnund das ist halt echt schwierig, die sind jetzt quasi schon, die sind ja im Prinzipein halbes Jahr hinten dran mit ihrem Spiel durch diesen Zustand jetzt, und das stelleich mir, ich stelle mir das wirklich, guck mal wie lange das dauert, das stelle ichmir echt äußerst schwierig vor, der Content ist schon produziert, da bin ich mal gespannt,woher weißt du das, also redest du das oder haben die das gesagt, was kann ich sagen,ja seh mal das Spiel produziert, lull, das haben die gesagt und dieser tolle, du meinstja den Tom Henderson, also wenn der Content schon produziert ist, in diesem Zustand wieder Content jetzt ist, dann gute Nacht, sag mal sterb halt mal Mann, ja, das mit denmehreren Entwicklerstudios, das ist ja auch meine Vermutung, dass sie das versucht haben,möglichst parallel, also die mehreren Entwicklerstudios ist so mein Ansatz, warum es überhaupt dreiverschiedene Spielmodi gibt, dass du die vielen Leute überhaupt parallel irgendwo hinbringenkannst, aber dass es nicht funktioniert, hat man ja am Release des Spiels gesehen, alsofür das Geld, was die haben und für die Manpower, die die haben, ist der Zustand schon echtmies, ich sag doch gar nichts Panda, ihr wisst doch, ich bin eh Fan davon, dass die Leuteihre eigene Meinung haben dürfen, auch wenn ich der Sache nicht zustimme, ich muss euchja nicht zustimmen, aber es ist ja überhaupt kein Problem, wenn ihr irgendwie eine andereAnsicht seid, ich hab mir da keine Schmerzen mit, solange ihr nicht sagt, Max ich fickdeine Mutter, du Kackspaß, dann ist alles in Ordnung, dann hab ich keine Schmerzen mit,weil einer etwas anderes meint als ich, man sieht auch so gut was hier, ein Toss, ichhab Hunger, die Runde machen wir noch fertig, aber danach gehen wir was fuddern, Flugstells,kann man von hier abheben davon, für den nächsten finde ich tatsächlich Webster ziemlichgut, weil man sich da in die Galerie rein hucken kann, ja ich hab ja auch gesagt inmeinem Video, das Game hat durchaus seine Momente, ich bin immer noch ein bisschen unschlüssig,ob es wirklich so gut war das Battlefield zu nennen, also gut, das verkauft sich, wassollen sie sonst machen, ich wollte eigentlich fliegen, ich darf nicht fliegen, also fürmich, ich hab es ja mal im Video gesagt, für mich hat das nicht so wirklich das Gefühlvon Battlefield, siehst du einen, seh'n dich 5, Frosch68, bist du der Frosch von YouTube,aber argle, aber argle null, oder irgendwie sowas, oder heißt du nur zufällig Frosch,oh Big Flank, Big Flank, ja klar, eh klar, perfekt, das ist der richtige echte Frosch,Big Flank, und wisst ihr was Big Flanks in dem Spiel bringen, gar nichts, gib ihm, gibihm, jaja ist gut Panzer, jaja Panzer, ist gut, kriegt euch ein Mann, kriegt euch ein,ich verpiss mich mal, ich bin raus hier, oh da steht ja wieder was auf der Gasse, HellJesus ist am Start Leute, Hell Jesus, aber Hell Jesus sieht nichts, Hell Jesus ist komplettblind, hallo ich möchte Waffe wechseln please, danke, nice game, GG Eats, ok hier darf manwieder nicht springen, ah Midipack, oh Girls, so ein Motionball da hinten in die Ecke, ichwürde den ja retzen, das Dumme ist, ah der hat schon gecancelt, oh Leute, abfuck, 12kills 21 assists ist schon eine gute Runde in dem Battlefield, nein nein nein, ach Mistich wollte ja gar nicht mit der spawn, ziehst du 2, sehen dich 15, jo echt so, ja ja sehr,high speed wingsuit, ok Achtung, das Schlimme ist halt, dass die selbst außerhalb spawnen,die spawnen auch da hinten, das sackt halt mal richtig, ist das ein Schneiber, ups daswar gar keine, ah, in the cop, da ist doch was, hier ist doch angeblich was, das istgar kein Sniper oder, das ist gar kein Sniper, das ist einfach nur ein Scheinwerfer, Kegmit, boah, weggerotzt, so jetzt spawnen wir mal mit dem anderen, meistens ist hier schon,ist hier schon fertig, aber man kann, also die nächste Sache ist nicht einnehmbar, aberdas hier kann man schaffen, das kann man einnehmen, das andere, das andere ist nicht schaffbar,achja, nice, jetzt gehen wir fliegen, was ist da, war das, das war nur die Kiste dieich gehittet habe oder, nicht der Typ selbst, von vorne kannst du halt auch nichts machen,das ist so offen man, das ist so offen einfach nur überall, pass auf, ich wette mit euchbald kommen sie auf die Idee hier C4 runterzuschmeißen, auf die Idee sind sie ja bis jetzt noch nichtgekommen, aber das dauert nicht lang, ok, jetzt machen wir, ja wir haben das dran, kriegdich alter, ich krieg dich, come on, the demon mantis, einfach mal reinspringen, einfachmal reinspringen, da war doch links auch noch was, oh habe ich wiederbelebt bug, kann das,habe ich wiederbelebt bug, nee, ach nee, das ist dieser, dieses komische rumgebagge, jawoll,gibts mir, easy gachi pass, jawoll, Spritze rein, Booster Impfung am Start, Booster istraus, schuldig, schuldig, was ist das hier, Moment, wo ist hier, wo ist hier oben und woist unten, wir haben es Leute, wir haben es, mal ab aimen falls hier irgendjemand rein will,mal schauen, der stellt es doch hier noch, war doch klar, oh wir haben kaum noch, kaumnoch money, nice, so jetzt müssen wir irgendeine Waffe finden, die hier vielleicht noch rumliegt, da stellt sich eine Waffe, gib ihm, 15, 15, was ist das, mp9, ich nenne auch einemp9 mit drum mag, hatte ich noch nie, keine Ahnung ob das was taugt, mp9 drum mag, aufgehts, die sind halt immer noch da oben, was sagt der neue Patch, pp 29, wird nicht malso oft gespielt, hovercraft ist ein bisschen genervt, aber ansonsten hat es am Battlefieldnicht allzu viel geändert an 2042, so wir haben noch, ach das ist schon der letzte Punkt,ja jetzt schaffen wir, also Leute jetzt ist die Map vorbei, jetzt ist die Map vorbei,also C1 geht noch, C2 ist nicht einnehmbar, guckt euch mal die Motion Sensors an, wieviele Motion Sensors hier rumfliegen, keck w, Dankeschön dass man nicht drüberspringendarf, ach das war der Typ noch in der Ecke dabei, gibt doch noch ein Fahrstuhl, ja esgibt, passt mal auf, das müsst ihr gesehen haben, das ist wirklich Map, aber wirklichMassive Big Brain Map Design in Reinform, also besser gehts nicht, fährt er hoch, 30 StundenReload Zeit, oh da ist ein hovercraft, wenn ich Reloaded hab, wenn ich Reloaded hab dann,ok wir habens, so und jetzt passt mal auf Leute, wir müssen jetzt, alles klar, wir müssenjetzt auf das Dach hoch, also du kannst, wie haben sie es denn bei Orbital gemacht, dumeinst dass du von mehreren Seiten mit der Zip Line hoch kannst, ja bei Orbital ist eigentlichauch nicht einnehmbar, Orbital ist auch nicht einnehmbar, guck mal da links, das geht hier,was geht hier, so du hast zwei Varianten, ich zeige euch, Mensch hovercraft, ah der versuchthoch zu fahren, ok, du hast zwei Sachen, du kannst hier mit dem Fahrstuhl, wo ist dennhier der Fahrstuhl überhaupt, hier, du kannst hier mit dem Fahrstuhl hoch und dann rüberZip Line oder bei dem anderen mit dem Fahrstuhl hoch, das Problem ist jetzt, ihr werdet esgleich sehen, ihr werdet es gleich sehen, also was anderes fällt mir da wirklich nichtzu ein, oh guck mal, ich werde wiederbelebt, ok, vielleicht schaffe ich es noch mir wasrein zu drücken, wir machen jetzt Trick 17, ich flieg jetzt, ich flieg jetzt, pass malauf, ich flieg jetzt woanders hin, sobald die Tür aufgeht, guckts euch an, ich hab'sversucht, ich wollte den Big Flank machen hier, aus der Tür raus, nehm das Schild,das hört sich in der Theorie gut an mit dem Schild, aber da wird so viel reingespampt,das kannst du vergessen, selbst wenn du schildert, du kriegst ja nicht mal tot, wer hat sichdenn sowas ausgedacht, ja irgendwas mit schwedischem Name auf jeden Fall, irgendein 3-Head Schwede,achja man kann auch in das andere Haus übrigens rein, wir gucken uns das jetzt mal, ok, wirmachen das jetzt von der anderen Seite, Achtung, wir können nämlich auch hier in den Fahrstuhlrein, so wir können nämlich auch hier rein und hier hochfahren, so, das ist nämlich vielbesser, das ist nämlich viel besser hier hoch zu fahren, weil wenn man hier hoch fährt,dann passiert nämlich gar nichts, guckt hier, das easy kommt man raus und basht alles, ach,hm, ach guck mal da steht sogar ein Hovercraft auf dem Dach, achja und das Hovercraft hebtgerade ab, das ist einfach in die Luft geflogen gerade, die hat gerade gesagt, our victoryis imminent, ich, hm, x, x daubt, wir overwhelmen die überhaupt nicht, das stimmt nicht, dasGamer zählt einfach Stuss, ok, ja das war zu viel spread, das war zu viel spread, ichhab das auf, oh oh, oh oh, ist aber mal gut ey, Transportheli von oben, ja das funktioniert,aber im Prinzip wirst du eigentlich schon gebashed, während du runterspringst, es isthalt äußerst, ach Leute, der Ansage, jetzt hab ich's verstanden, der Ansage hat's gesagt,wir müssen nur noch das final objective taken, dann gewinnen wir, ach so, jetzt weiß ichauch was ich fast falsch mache, just take the final objective, Mensch, wie hab ich, warumhab ich das so lange nicht gesehen, Achtung, wir fliegen jetzt wieder wohin, da steht einfucking Panzer auf dem Dach und schießt in den Fahrstuhl rein, ein Panzer, ein Panzersteht auf dem Dach und schießt, ach Gott, das ist so schlecht, die sollen AC, die sollenhier Leute, wisst ihr was die machen müssten, die Attacker, wisst ihr was die Attacker machenmüssten, ich zeig's euch, Sekunde, wenn meine Maus funktionieren würde, die Mausmüssten das hier machen und einfach alles wegsprengen, was da oben drauf steht, by theway, dass das nach drei Wochen immer noch nicht hotfixed wird, wurde hier dieses Objective,ein absolutes Armutszeugnis, das sollte das einfachste sein, von der Welt so eine publischeFlagge umzusetzen, hat das Ding hier nicht auch Fahrstühle irgendwo, Moment, hat dasTeil hier nicht auch Fahrstühle, ne Jonas hat keine Fahrstühle, doch hat Fahrstühle,oh der kommt gleich, guck mal, oh der kommt, wegen der, die kommen runtergefahren, da kommengleich Gegner raus und tschüss, die fahren jetzt schon runter, welches Herz dann empfiehlstdu, das einzige Herz, das ich empfehlen kann, ist das Spider-Nexx MMX300, kannst du C4 indas mal an, da ist die gesamte Grundschule auf dem Dach, das ist eine richtig gute Ideegewesen, C4, da muss ich ja C4 werfen, C4 im Fahrstuhl selbst sind die glaube ich nichtnah genug dran, hätte man jetzt einen Mörser wie in Battlefield 3, ja, ach fahr mal nochmalhoch, ich probiere das mal, ich probiere das mal mit C4, man könnte C4 hier hinlegen undsich selbst, und sich selbst in die Luft sprengen, oh man, das ist nicht Battlefield, das istdemlichstes Design aus der Hölle, so, wo ist der C4 überhaupt, hier, sind wir oben,sind wir oben, sind wir oben, ne oder, ne, ne, ne, ich habe C4 glaube ich noch nichteinmal ausprobiert hier, oh der Shieldman, ok, wie machen wir das hier, ne, der Shieldmanhat doch keinen Bock mehr, ok, doch jetzt hier, ist das C4 gerade in die Luft geflogenals der Fasche losgedingst ist, das C4 ist in die Luft geflogen als der, oh, ich dachtewir müssen, ich dachte wir müssen just, just einfach nur noch das objective, das finalobjective captchern, dann war es das, cringe Sprüche, die Sprüche sind so dumm, die Durchsagemeinte, dass wir gewinnen, achja, 182, ok, boah, ey, alter, dieses Game, man, boah,der erste Typ hat das letzte Emblem für Hovercraft, ja, wundert mich nicht, mancheLeute haben das Hovercraft ja nix anderes gespielt, seit, seit, im Prinzip, seit EarlyAccess start, fahren die quasi permanent kreisel mit dem Hovercraft, was hältst duvon World War 3, ich muss sagen, ich fand es gar nicht schlecht, das Movement ist abertop, komplett abgefuckt, ja, ich würde den Streamer Mikro Tick up, hier, genau, oh man,ja ne, es war Stream, Leute, ich gehe jetzt was futtern, wir sehen uns, bis dann, macht'sgut, tschüss.", "segments": [{"id": 1, "start": 120.0, "end": 148.48, "text": "So, jetzt gucken wir uns mal den angeblichen russischen Battlefield Killer an."}, {"id": 2, "start": 148.48, "end": 153.64, "text": "Ich habe das Spiel mir schon mal angeschaut vor zwei Jahren oder so und ich muss sagen,"}, {"id": 3, "start": 153.64, "end": 159.36, "text": "ich habe da nicht allzu viel eines Battlefield Killers erkannt, aber es gibt ja Leute die behaupten,"}, {"id": 4, "start": 159.36, "end": 168.84, "text": "dass World War 3 das bessere Battlefield ist. Gut, ich meine das ist bei Battlefield 2042 auch"}, {"id": 5, "start": 168.84, "end": 173.68, "text": "nicht schwer, aber das Spiel war ja schon am Start bevor es Battlefield 2042 überhaupt gegeben hat."}, {"id": 6, "start": 173.68, "end": 186.56, "text": "So, ups. Und danach gucken wir uns den aktuellen Battlefield Patch an und spielen vielleicht"}, {"id": 7, "start": 186.56, "end": 191.44, "text": "paar Runden oder was heißt vielleicht relativ sicher. Eins, zwei Runden vielleicht auch mehr"}, {"id": 8, "start": 191.44, "end": 195.2, "text": "wenn es Bock macht Battlefield, aber ich fürchte da wird nicht allzu viel gefixt."}, {"id": 9, "start": 195.2, "end": 212.6, "text": "Ach Wub Arrive Moment, das mache ich jetzt gerade mal in die in die Sack. Wub Arrive kommt jetzt"}, {"id": 10, "start": 212.6, "end": 223.92, "text": "direkt in die GIFs rein. Wub Arrive. Das machen wir jetzt gleich, ich mache jetzt die Emotes rein."}, {"id": 11, "start": 223.92, "end": 231.52, "text": "Community, oh das ist so verkackt. Partner, ich finde das immer nicht. Emotes, besuchen"}, {"id": 12, "start": 231.52, "end": 245.92, "text": "sie die Emotes Website. Animierte Emotes. GIF hochladen. Wub Arrive. Schauen wir mal ob es jetzt"}, {"id": 13, "start": 245.92, "end": 261.8, "text": "funktioniert. Ja, nice, funktioniert. So passt. Das Ding soll heißen Wub Arrive und jetzt sagen wir hochladen."}, {"id": 14, "start": 261.8, "end": 270.68, "text": "Wub Arrive ist am Start, probiert mal. Refresh wollen wir, wir refreshen mal Chat. Chat, Chat"}, {"id": 15, "start": 270.68, "end": 287.2, "text": "Refreshen, hier Refreshen, alles Refreshen. Jetzt probieren wir es gleich nochmal. Also laut Twitch ist es drinne. Wub, Wub, Wub Arrive. Ey! Funktioniert."}, {"id": 16, "start": 287.2, "end": 310.96, "text": "Nice. Fock. Wie viele Tabs willst du auf einen Moment, Moment, wenn du denkst das sind viele Tabs."}, {"id": 17, "start": 310.96, "end": 321.64, "text": "Wir haben ja noch, wir haben ja noch mehr Tabs, das war es ja noch nicht. Außerdem, ich meine,"}, {"id": 18, "start": 321.64, "end": 330.8, "text": "ich muss noch meine 32G RAM irgendwie sinnvoll voll kriegen. Wie kommt euch gerade mein aktuelles"}, {"id": 19, "start": 330.8, "end": 335.56, "text": "Video an? Ich habe das ja vor einer halben Stunde oder so erst freigeschaltet. Ich habe gar nicht"}, {"id": 20, "start": 335.56, "end": 343.64, "text": "mehr reingeguckt seit einer Weile. Dislike Anzeigen wieder herstellen. Dislike. Die meisten Leute in"}, {"id": 21, "start": 343.64, "end": 356.04, "text": "Deutschland denken mit dem Dislike, damit SS. Gedisst. Gedisterlike. Das Gedisst, man."}, {"id": 22, "start": 356.04, "end": 369.04, "text": "Ich finde es so lustig. Die Leute, die hier, die hier öfters im Stream am Start sind, die fangen"}, {"id": 23, "start": 369.04, "end": 380.6, "text": "schon immer an, so mein, mein bescheuertes Twitch-Speak zu reden. Ist halt, ist halt schon schlimm,"}, {"id": 24, "start": 380.6, "end": 389.96, "text": "Alter. Die Stunks gehen hoch für dieses Video, Kappa. Da weißt du, weißt du Bescheid. Da weißt"}, {"id": 25, "start": 389.96, "end": 396.6, "text": "du Bescheid. Joa, wir müssen es nehmen hier am Start. Gucken wir uns jetzt mal an. Alter, gut,"}, {"id": 26, "start": 396.6, "end": 402.08, "text": "das kann man zumachen. Ich weiß gar nicht, wo läuft denn die Musik aktuell überhaupt. Leute,"}, {"id": 27, "start": 402.08, "end": 411.76, "text": "ich mache mal, ich mache mal ein bisschen, ein bisschen was zu hier gerade. Ist vielleicht. Alter,"}, {"id": 28, "start": 411.76, "end": 416.84, "text": "das Ding kommt überhaupt nicht mehr mit. Ich drücke die ganze Zeit schon Steuerung W. Ihr hört"}, {"id": 29, "start": 416.84, "end": 426.44, "text": "es vielleicht, aber das ist nicht schnell genug mit Schließen der Tabs. Okay. Wo war denn das"}, {"id": 30, "start": 426.44, "end": 435.76, "text": "Battlefield-Change-Log? Das hatten wir hier? Nee. Das gucken wir uns dann später an. Jaja,"}, {"id": 31, "start": 435.76, "end": 443.36, "text": "die Games da. Hier, das da. Hier, Update 2. Da müssen wir dann später mal gucken. Aber jetzt"}, {"id": 32, "start": 443.36, "end": 449.16, "text": "gucken wir uns erstmal den russischen Battlefield-Killer an. Spoiler, das Letzte,"}, {"id": 33, "start": 449.16, "end": 454.12, "text": "was ich von dem Game gesehen habe, war halt nicht so der krasse Killer. Und zwar nur so ein bisschen,"}, {"id": 34, "start": 454.12, "end": 457.8, "text": "das wäre von diesem Game nichts mitgekriegt. Habe ich beobachtet, das ist ja schon eine Weile. Ich"}, {"id": 35, "start": 457.8, "end": 460.8, "text": "habe das auch vor zwei Jahren oder so schon mal ausprobiert, aber da war noch nicht allzu"}, {"id": 36, "start": 460.8, "end": 465.4, "text": "viel zu holen. Mal gucken, ob das jetzt besser geworden ist. Ihr seht ja schon, ich habe auch"}, {"id": 37, "start": 465.4, "end": 472.0, "text": "sagenhafte 76 Minuten Playtime insgesamt schon auf Steam dafür. Also da war wirklich nicht so"}, {"id": 38, "start": 472.0, "end": 478.12, "text": "viel zu holen. Ich habe es vorhin mal gestartet und geguckt, dass es geht. Oh, was ist? Wollen"}, {"id": 39, "start": 478.12, "end": 485.28, "text": "die mich verarschen? Ich habe eben noch gespielt. Warum ist... Sagt bloß, die Server sind jetzt"}, {"id": 40, "start": 485.28, "end": 492.08, "text": "offline. Ich habe eben noch gespielt. Ich habe eben das Game angemacht und habe mich geqt und"}, {"id": 41, "start": 492.08, "end": 511.52, "text": "habe geguckt, ob alles funktioniert. Also eben vor 45 Minuten oder so. Aber vor 45 Minuten war"}, {"id": 42, "start": 511.52, "end": 518.08, "text": "der Tweet ja schon raus. Zumindest, also wir gucken uns jetzt mal, bevor wir in das Game reingen,"}, {"id": 43, "start": 518.08, "end": 530.32, "text": "wir gucken uns jetzt mal zusammen den Closed Beta, das Closed Beta Pax Trailer. Closed Beta?"}, {"id": 44, "start": 530.32, "end": 538.68, "text": "Was ist denn ein Pax Trailer? Ach Pax, wahrscheinlich Microtransactions oder so. Dass ihr wisst,"}, {"id": 45, "start": 538.68, "end": 543.68, "text": "was das Game sein möchte und anhand dessen, was ihr gleich dann an Gameplay seht, könnt ihr"}, {"id": 46, "start": 543.68, "end": 559.12, "text": "beurteilen, ob das Game das auch ist, was es sein möchte. So, einmal Fullscreen. Du sollst"}, {"id": 47, "start": 559.12, "end": 568.2, "text": "einfach, lass mal das Video einfach nebenbei durchlaufen für mehr View-Stalks. Oh, das ist ja"}, {"id": 48, "start": 568.2, "end": 585.44, "text": "mal, hör dir das, das ist mal richtig gekommener Style hier."}, {"id": 49, "start": 598.2, "end": 609.04, "text": "Also sie machen eindeutig auf Battlefield. Oh, Kilkona ist auch am Start. Also quasi"}, {"id": 50, "start": 609.04, "end": 637.2, "text": "dieses Video müsste eigentlich heißen Kilkona vs. Kilkona. Svayi, Svayi. Heißt wahrscheinlich"}, {"id": 51, "start": 637.2, "end": 656.76, "text": "sowas wie Stop Stop oder so. Keine Ahnung. Das heißt sowas wie eigene. Ah, so friendly"}, {"id": 52, "start": 656.76, "end": 680.0, "text": "quasi. Also es ist offensichtlich, dass Battlefield ihre Vorlage war. Ich mein, ich muss jetzt"}, {"id": 53, "start": 680.0, "end": 684.44, "text": "mal eins sagen, Zack, ich muss nur, ich finde der Trailer vermittelt tatsächlich einen"}, {"id": 54, "start": 684.44, "end": 689.08, "text": "besseren Battlefield Eindruck als Battlefield 2049, aber es ist einfach dahingestellt."}, {"id": 55, "start": 714.44, "end": 725.08, "text": "Spiel World War 3 auch in 2042. Nee, ich glaub vorher. Okay, wenn das kein Ami ist,"}, {"id": 56, "start": 725.08, "end": 737.16, "text": "dann weiß ich auch nicht. Der ist so advanced, der hat nicht mal Abzeichen auf der Uniform."}, {"id": 57, "start": 737.16, "end": 745.88, "text": "Alle beide nicht. Warum auch immer der das nicht gesehen hat und direkt vor ihn laufen"}, {"id": 58, "start": 745.88, "end": 757.8, "text": "konnte, keine Ahnung. So, also, das möchte das Spiel sein. Ich will jetzt noch nicht"}, {"id": 59, "start": 757.8, "end": 763.44, "text": "zu früh was sagen, aber ich hab das Spiel mir mal angeguckt und das letzte Mal war"}, {"id": 60, "start": 763.44, "end": 771.12, "text": "das äußerst glitchy und langsam. Es hat eigentlich kaum was von diesem Trailer gehabt,"}, {"id": 61, "start": 771.12, "end": 774.88, "text": "den man da jetzt gesehen hat. Aber probieren wir das mal aus. Das Schlimmste ist, wenn"}, {"id": 62, "start": 774.88, "end": 779.6, "text": "man das startet, das startet nicht einfach das Game. Es startet erst mal irgendeinen"}, {"id": 63, "start": 779.6, "end": 790.68, "text": "russischen Launcher, dass das funktioniert und der russische Launcher startet dann, falls"}, {"id": 64, "start": 790.68, "end": 801.24, "text": "jemand das nicht kennt. Ich wusste auch nicht, dass es das gibt. Mail.ru Anti-Cheat. Kein"}, {"id": 65, "start": 801.24, "end": 814.04, "text": "Witz, es gibt Mail.ru Anti-Cheat. Also mir war das gar nicht bewusst, dass es Mail.ru"}, {"id": 66, "start": 814.04, "end": 820.08, "text": "Anti-Cheat gibt. Okay, ich hab mich wirklich überwinden müssen, dass ich auf Accept gedrückt"}, {"id": 67, "start": 820.08, "end": 829.72, "text": "habe, als mich Mail.ru Anti-Cheat nach Admin-Berechtigung gefragt hat. Der Launcher zählt schon zur Spielzeit,"}, {"id": 68, "start": 829.72, "end": 841.4, "text": "ja klar, weil sie wusste, dass die gestartet ist. Okay, auch jetzt, probieren wir das mal"}, {"id": 69, "start": 841.4, "end": 852.12, "text": "aus. Mal gucken, ob Lautstärke passt und überhaupt. Und ob es überhaupt läuft, weil man muss"}, {"id": 70, "start": 852.12, "end": 867.84, "text": "sagen, die hatten richtig krasse Serverprobleme. Good Game, keine Ahnung. Das letzte Mal,"}, {"id": 71, "start": 867.84, "end": 871.92, "text": "wo ich es gesehen habe, war es noch äußerst klitschig und kaputt. So, hier richtig, richtig"}, {"id": 72, "start": 871.92, "end": 880.68, "text": "Kekona-Soldier am Start. Lautstärke scheint ein bisschen laut zu sein. Mach mal kurz ein"}, {"id": 73, "start": 880.68, "end": 892.44, "text": "bisschen. Ups, nein, nein, nein. Mixer. Mach mal kurz ein bisschen runter. Okay, Quick"}, {"id": 74, "start": 892.44, "end": 899.72, "text": "Play. Bam. Tactical Ops in Berlin. Dieser Chat ist jetzt deutsch. Nee, ist er ja auch"}, {"id": 75, "start": 899.72, "end": 911.2, "text": "so auch schon. Tactical Ops, Control. Ah, okay, das ist quasi so Art Conquest. Conquest."}, {"id": 76, "start": 911.2, "end": 922.76, "text": "So, Anti-Tank, Assault, Support, Sniper-Man. Also Assault, das Spiel hat keinen Sound oder"}, {"id": 77, "start": 922.76, "end": 933.44, "text": "Musik. Ich höre einfach gar nichts. Assault, Medic, Pack, Anti-Tank-Mine. Und jetzt ja"}, {"id": 78, "start": 933.44, "end": 941.44, "text": "hier, technical. Ich weiß nicht mal, was es macht. Oh, okay, es ist immer noch klitschig."}, {"id": 79, "start": 941.44, "end": 956.28, "text": "Fällt euch was auf? Weiß nicht, ob euch irgendwas auffällt. Nicht der Recall, dass"}, {"id": 80, "start": 956.28, "end": 971.84, "text": "du keinen Sound hast beim Schießen. Also keinen eigenen Sound. Au. Okay, nice. Waiting for"}, {"id": 81, "start": 971.84, "end": 981.96, "text": "players. 37 von 30. Moment, 37 von 30 nötigen Players. Sollte man da nicht davon ausgehen,"}, {"id": 82, "start": 981.96, "end": 989.96, "text": "dass das Spiel eigentlich jetzt losgeht. Weil nur, vielleicht kann ich auch einfach"}, {"id": 83, "start": 989.96, "end": 996.44, "text": "nicht gut genug auf Russisch zählen. Oh, jetzt habe ich den gehittert. Okay, wir stellen"}, {"id": 84, "start": 996.44, "end": 1003.0, "text": "es jetzt einfach mal irgendwo hin und gucken, ob wir Gegner sehen. Wohlgemerkt, die hatten"}, {"id": 85, "start": 1003.0, "end": 1010.72, "text": "mehr oder weniger die gleichen Probleme vor zwei Jahren schon. Und angeblich wurde dieses"}, {"id": 86, "start": 1010.72, "end": 1015.4, "text": "Spiel jetzt massiv überarbeitet. Sie haben wohl auch den Publisher gewechselt. Oder was"}, {"id": 87, "start": 1015.4, "end": 1027.64, "text": "auch immer, mygames.ru oder sowas ist. Und sag mal so, Release ist... Oh, Hi-Rez. Guck"}, {"id": 88, "start": 1027.64, "end": 1032.32, "text": "mal, wir haben eine Lampe. Das sind ja die mit Abstand schönsten Reifen, die ich jemals"}, {"id": 89, "start": 1032.32, "end": 1039.92, "text": "in einem Game gesehen habe. Liegelung ist da nix. So, wo sind denn die Gegner? Haben"}, {"id": 90, "start": 1039.92, "end": 1048.12, "text": "wir vielleicht ein paar Gegner zur Abwechslung? Die killen sich die ganze Zeit selbst. Oh,"}, {"id": 91, "start": 1048.12, "end": 1058.4, "text": "es geht los. Es können auch Polen sein. Ich weiß es nicht, ob es Russen oder Polen. Irgendwas"}, {"id": 92, "start": 1058.4, "end": 1064.36, "text": "im Osten auf jeden Fall. Der Osten meldet sich zurück. Guck mal, da gibt es einen Tank."}, {"id": 93, "start": 1064.36, "end": 1088.92, "text": "Ach, F muss man drücken. Und jetzt? Ja? Ja? Dazu fällt mir bloß ein. Also, wir haben"}, {"id": 94, "start": 1088.92, "end": 1097.08, "text": "keinerlei Sound, wie es aussieht. Sound ist anscheinend schon mal, schon mal broken. Ich"}, {"id": 95, "start": 1097.08, "end": 1101.32, "text": "mach das grad mal, ich mach, Leute, ich mach euch hier Mixer. Ich mach euch grad mal wieder"}, {"id": 96, "start": 1101.32, "end": 1111.8, "text": "normal laut. Das ihr hört, es gibt eigentlich nix zu hören. Vielleicht hab ich nicht das"}, {"id": 97, "start": 1111.8, "end": 1116.48, "text": "Soundpack gekauft. Oh, okay. Schon mal gut, einen Aussteiger, Animationen gibt es nicht."}, {"id": 98, "start": 1116.48, "end": 1123.84, "text": "Okay, wir Captchern. Captchern wir denn? Wo sieht man das? Wir Captchern. Ach, da, das"}, {"id": 99, "start": 1123.84, "end": 1129.56, "text": "blaue. Oh, das Captchert ja abfahrklangsam. Nee, guck mal, das geht nach links und rechts"}, {"id": 100, "start": 1129.56, "end": 1135.96, "text": "gleichermaßen hoch, das Captchern. Das ist Big Brain-Status-Anzeige. Möglichst kompliziert"}, {"id": 101, "start": 1135.96, "end": 1150.56, "text": "gemacht. Und man kann, man kann Lehnstells machen, guckt hier. Ach, wir haben es erobert,"}, {"id": 102, "start": 1150.56, "end": 1162.4, "text": "jawoll. Was ist Nachkampf? Gibt es Nachkampf? Das Problem ist ohne Sound irgendwas zu orten"}, {"id": 103, "start": 1162.4, "end": 1170.84, "text": "ist natürlich schon Pain's Champ Deluxe. Da guckt er, Pain's Champ Deluxe. Map, haben"}, {"id": 104, "start": 1170.84, "end": 1175.8, "text": "wir ne Map? Okay, wir haben ne Map. Das ist schon mal nice, ne Map, wo man auch was erkennt."}, {"id": 105, "start": 1175.8, "end": 1180.24, "text": "Das ist schon mal schön. Wir müssen, aha, wir müssen eigentlich da hinten hin. Okay,"}, {"id": 106, "start": 1180.24, "end": 1186.08, "text": "kann man spotten? Nee, kann man X? Marker, X oder so? Ah, hier, Marker setzen geht schon"}, {"id": 107, "start": 1186.08, "end": 1211.72, "text": "mal. Nee, ach, doppelt X. Doppelt X für Marker, okay. Ich hab ne Jit, keine Ahnung. Hä,"}, {"id": 108, "start": 1211.72, "end": 1223.12, "text": "da ist er doch, dahinter. Auf, gekommen Rit, komm raus. Immerhin hat er cool seinen Helm"}, {"id": 109, "start": 1223.12, "end": 1235.96, "text": "verloren. Das ist doch schon mal was. TSM ist am Start. TSM has won Rit. Wart mir nicht,"}, {"id": 110, "start": 1235.96, "end": 1244.92, "text": "wie ich da drauf gerade komme. So, gehts hier weiter? Die Frage ist, wo, ah, guck mal, hier,"}, {"id": 111, "start": 1244.92, "end": 1258.36, "text": "wir sind schon am Captchern. Massive Captcherstellen. Oh, jawoll, weg, weg mit dem. Easy. Ist da"}, {"id": 112, "start": 1258.36, "end": 1266.16, "text": "dead? Ist da dead der Typ, der gecaptchert hat? Nee, der lebt noch. Nice. Aber Leute,"}, {"id": 113, "start": 1266.16, "end": 1275.8, "text": "es gibt ein Scoreboard. Seht ihr das? Pog, Pog like this, Alter, Scoreboard. What the,"}, {"id": 114, "start": 1275.8, "end": 1280.04, "text": "okay es ist ziemlich dumm ohne Sound, wenn man nicht hört von wo man beschossen wird"}, {"id": 115, "start": 1280.04, "end": 1289.0, "text": "und auch nix am Indikator wirklich sieht. Das ist ziemlich dumm. Übrigens ist es mit"}, {"id": 116, "start": 1289.0, "end": 1294.24, "text": "dem kaputtenen Sound, war vor zwei Jahren auch schon so in diesem Spielmodus. Hat sich"}, {"id": 117, "start": 1294.24, "end": 1304.36, "text": "nicht so viel getan. Orpens, Nee, das ist, man hört auch keine Schritte, das ist wirklich"}, {"id": 118, "start": 1304.36, "end": 1312.16, "text": "blöd. Wir spielen mal gleich ne Runde Team Deathmatch. Aber immerhin gibt es nen Ton,"}, {"id": 119, "start": 1312.16, "end": 1322.12, "text": "wenn man auf Deploy klickt. Die Maps sind glaub ich der krasseste Camper abfuckts."}, {"id": 120, "start": 1322.12, "end": 1337.36, "text": "Alter, du hörst nichts, du hast keine Schüsse, du hörst keine Schritte. Da fuck, was ist"}, {"id": 121, "start": 1337.36, "end": 1347.6, "text": "das denn? Okay, das ist, das ist, das ist wild, wild. Das ist äußerst wild. Vielleicht"}, {"id": 122, "start": 1347.6, "end": 1361.24, "text": "hört der ja was, vielleicht ist ja mein Sound nur verbackt. Okay, wo geht hier was, hier?"}, {"id": 123, "start": 1361.24, "end": 1367.96, "text": "Next. Tactical Sprint gibt es auch, guck hier, Huge Tactical Sprint. Wir flanken die jetzt,"}, {"id": 124, "start": 1367.96, "end": 1375.72, "text": "wir flanken jetzt hier durch und sliden um die Eck. Bin ich kleiner geworden durch Sliden?"}, {"id": 125, "start": 1375.72, "end": 1385.56, "text": "Leute, ich bin kleiner geworden durch Sliden, guck mal. Small, Small Soldier, Soldier, jetzt."}, {"id": 126, "start": 1385.56, "end": 1397.76, "text": "Achso, man muss Space drücken um wieder aufzustehen, rekt, Next. Der crouched immer noch, ja, war"}, {"id": 127, "start": 1397.76, "end": 1404.36, "text": "es natürlich sehr merkwürdig. Au, von wo? Okay, ich seh hier nichts. Hier drinnen hat"}, {"id": 128, "start": 1404.36, "end": 1412.68, "text": "es geschossen, guck mal, habt ihr das gesehen? Hier gibt es zu viele, hier gibt es definitiv"}, {"id": 129, "start": 1412.68, "end": 1420.04, "text": "viel zu viele Ecken wo was abgehen könnte. Hier kann es ja wirklich an jeder Ecke abcampen."}, {"id": 130, "start": 1420.04, "end": 1434.88, "text": "Tja, von wo ist halt die Frage? Gräb'nhaus Stels. Hier geht es nicht weiter, alles klar."}, {"id": 131, "start": 1434.88, "end": 1453.92, "text": "Oh, guck mal, RPGs am Start. Okay, springen Stels geht nicht. Es ist aber wirklich dumm"}, {"id": 132, "start": 1453.92, "end": 1467.24, "text": "ohne Sound. Hab ich ne Granate? Oh hier, Massive Nades. Wir sind doch hinter diesem komischen"}, {"id": 133, "start": 1467.24, "end": 1477.88, "text": "Auto hier gewesen, oder? Was? Ah, Q ist nicht hinlegen. Was ist hinlegen? Äh, X? Ne. Okay,"}, {"id": 134, "start": 1477.88, "end": 1484.08, "text": "keine Ahnung. Ich hab legit keine Ahnung von wo mich was getroffen hat. Von wo? Kann"}, {"id": 135, "start": 1484.08, "end": 1490.92, "text": "man hier irgendwie aus dem Fenster schießen, oder? Ach, der hier. Komplette Überforderung."}, {"id": 136, "start": 1490.92, "end": 1506.6, "text": "Es ist auch echt, wir, es ist wirklich hart, hart, wir hier. Okay, drei ist heal. Nice."}, {"id": 137, "start": 1506.6, "end": 1519.36, "text": "Ich verpiss mich mal. Ah, hier ist nix, okay. Vielleicht müssten wir... Okay, so kann"}, {"id": 138, "start": 1519.36, "end": 1523.6, "text": "man hier auf jeden Fall nicht schießen über Range. Wahrscheinlich muss man hier Singelschuss"}, {"id": 139, "start": 1523.6, "end": 1535.12, "text": "machen, dass man trifft. In der Mitte ist auch einer, oder? Okay, springen, schießen"}, {"id": 140, "start": 1535.12, "end": 1541.84, "text": "geht nicht, hab ich grad festgestellt. Wenn man springt, kann man nicht schießen. Es"}, {"id": 141, "start": 1541.84, "end": 1555.2, "text": "piepst, Leute. Hört ihr das auch? Ganz eklig piepsen. Jetzt ist weg. Aber ohne Sound ist"}, {"id": 142, "start": 1555.2, "end": 1565.92, "text": "schon ganz schön beschissen, Mann. Also guck mal, wenn man springt, kann man... Hä? Ne,"}, {"id": 143, "start": 1565.92, "end": 1573.92, "text": "wenn man springt, kann man nicht schießen, ne? Restart mal das Game. Ne, das ist normal"}, {"id": 144, "start": 1573.92, "end": 1580.88, "text": "in dem Modus, dass der Sound kaputt ist. Guck mal, es gibt sogar Metro. Was ist das deutsche"}, {"id": 145, "start": 1580.88, "end": 1593.52, "text": "Ansage? Oh, die Map ist ja riesig, Mann. Also riesig verwinkelt. Nicht unbedingt von der"}, {"id": 146, "start": 1593.52, "end": 1602.28, "text": "reinen Fläche, aber insgesamt ist die Map ja riesig. Ich hab keinen Plan. Wo lasert"}, {"id": 147, "start": 1602.28, "end": 1612.08, "text": "mich hier irgendwas? Okay. Okay, das Game ist, wir bleiben einfach sitzen und gucken"}, {"id": 148, "start": 1612.08, "end": 1616.76, "text": "in eine Richtung. Das ist schon mal nice. Wenn ich jetzt krasser Rainbow Six Pro wäre,"}, {"id": 149, "start": 1616.76, "end": 1623.64, "text": "würde ich quasi so rumlaufen. Ne, warte mal, wie laufen die Rainbow Six Leute immer so?"}, {"id": 150, "start": 1623.64, "end": 1639.52, "text": "Ach, keine Ahnung. Die haben doch so einen super geilen Rainbow Six Stels. Okay. Metro,"}, {"id": 151, "start": 1639.52, "end": 1645.36, "text": "Metro. Ich muss in der Metro sporen. Ach ja, man kann übrigens am Sprint nicht direkt"}, {"id": 152, "start": 1645.36, "end": 1651.04, "text": "schießen, wie ihr gerade gesehen habt. Okay, hier muss man wirklich ein bisschen langsamer"}, {"id": 153, "start": 1651.04, "end": 1659.88, "text": "sein, glaub ich. Hey, die haben Native Speaker Ansagen. Das klang nicht wie in den Russen,"}, {"id": 154, "start": 1659.88, "end": 1680.48, "text": "man versucht Deutsch zu sprechen. Nice, okay. Ob wir captchern das gerade? Wie legt man"}, {"id": 155, "start": 1680.48, "end": 1691.24, "text": "sich denn hin? C? Control ist es auch nicht? C? Weiß nicht. Aber wir haben es doch gleich"}, {"id": 156, "start": 1691.24, "end": 1704.04, "text": "gecaptchert. Von Recht hab ich irgendwas schießen gehört. Okay, ah jetzt haben wir es, jetzt"}, {"id": 157, "start": 1704.04, "end": 1722.08, "text": "haben wir es, okay. Ist über uns ein Panzer? Alles klar, oder auch nicht. Wie viele Spieler"}, {"id": 158, "start": 1722.08, "end": 1727.36, "text": "sind das eigentlich? Ach, sind kaum Gegner drinnen. Der Tactical Sprint ist immer noch"}, {"id": 159, "start": 1727.36, "end": 1743.8, "text": "verbuggt, da geht mal, mal geht da nicht. Sehr merkwürdig. Nee. Okay, das ist immer,"}, {"id": 160, "start": 1743.8, "end": 1756.56, "text": "ach ich krieche immer noch, stimmt. Ja, das ist Fail. Das ist Fail mit dem Griechen. Ich"}, {"id": 161, "start": 1756.56, "end": 1760.44, "text": "glaube es gibt keine Claymores oder irgendwelche Dinger. Stellt euch mal diese Maps noch mit"}, {"id": 162, "start": 1760.44, "end": 1787.6, "text": "Claymores vor. Dann ist es doch komplett vorbei. Nice. Next. Oh, ergeblich ist hier was. Hä?"}, {"id": 163, "start": 1787.6, "end": 1793.76, "text": "Pointstack, guckt euch das mal an. Mein Pointstack hört gar nicht mehr auf. 2000 Punkte, es"}, {"id": 164, "start": 1793.76, "end": 1799.88, "text": "gehört, guck mal, es hört nicht auf. Es, es, es stackt einfach, das ist wie, das ist"}, {"id": 165, "start": 1799.88, "end": 1811.12, "text": "tatsächlich in dem Fall wie in alten Battlefields. Also ohne Schusssound ist tatsächlich, oh,"}, {"id": 166, "start": 1811.12, "end": 1818.52, "text": "oh, lul, ich habe ihn gekillt. Einfach mal in die Richtung gesprayed. Wassermelone ist"}, {"id": 167, "start": 1818.52, "end": 1829.2, "text": "am Start. Einfach in die Richtung gesprayed, lul. Komm, ich stelle es jetzt mit unserem"}, {"id": 168, "start": 1829.2, "end": 1846.12, "text": "Typ davor. Es fühlt sich aber richtig schwerfällig und, und. Okay, die Typen können nicht wirklich"}, {"id": 169, "start": 1846.12, "end": 1860.68, "text": "weit Granaten werfen. Hä? Na gut, das Schöne für mich ist, das Schöne für mich ist,"}, {"id": 170, "start": 1860.68, "end": 1866.88, "text": "die haben auch keinen Sound, alle. Okay, was war das, drei? Midi-Pack, Midi-Pack. Alter,"}, {"id": 171, "start": 1866.88, "end": 1870.88, "text": "heil dich, heil dich, der Typ ist immer noch im Fenster oben. Ich habe einen Killstreak,"}, {"id": 172, "start": 1870.88, "end": 1876.88, "text": "guck mal, ich kann jetzt einen Air-Strike holen, aber dafür habe ich nicht genug Punkte, oder?"}, {"id": 173, "start": 1876.88, "end": 1888.6, "text": "So, ist der Typ immer noch oben im Fenster? Und welches Fenster ist es überhaupt? Und"}, {"id": 174, "start": 1888.6, "end": 1901.96, "text": "warum klingeln hier so viele Telefone? Ey, das Spiel ist so, das ist das krasseste"}, {"id": 175, "start": 1901.96, "end": 1909.44, "text": "gekommen und game, was ich je gespielt habe. Der Atmen, wir sollen leise ballern, ich habe"}, {"id": 176, "start": 1909.44, "end": 1918.68, "text": "nicht mal Sound beim Ballern. Von wo? Von hier? Von hier? Nee. Von wo? Das ist ein Air-Strike?"}, {"id": 177, "start": 1918.68, "end": 1927.84, "text": "Kann ich auch einen Air-Strike holen? Hui! Äh, A2. Nee, wo sind wir? Was ist das hier,"}, {"id": 178, "start": 1927.84, "end": 1947.24, "text": "Zack? Das ist C1. Nee, ich mache da keinen Air-Strike. Okay, campen wir mal uns ein bisschen"}, {"id": 179, "start": 1947.24, "end": 1952.32, "text": "am Fenster noch ab. Da war er. Guck mal, da hat mich, die anderen haben mich gesehen."}, {"id": 180, "start": 1952.32, "end": 1960.6, "text": "Oh, wow, wow, wow. Oh, meine Ammo ist leer. Pants-Man, der Pants-Man kriegt jetzt einen"}, {"id": 181, "start": 1960.6, "end": 1971.64, "text": "Air-Strike. C1, Panzer. Keine Ahnung, gibt es, gibt es Kriege, kann ich mir Ammo da raus"}, {"id": 182, "start": 1971.64, "end": 1985.52, "text": "nehmen oder? Stirbt man, wenn man da runterfällt, bestimmt. Au, nee. Oh, das fühlt sich äußerst,"}, {"id": 183, "start": 1985.52, "end": 1992.16, "text": "also sehr, sehr, jetzt, jetzt kriegen wir einen Air-Strike. Bam, Air-Strike, 7. Nee,"}, {"id": 184, "start": 1992.16, "end": 1996.56, "text": "da wird schon gerade ein Air-Strike. Da, da geht er hin. Da geht er jetzt hin, der Air-Strike."}, {"id": 185, "start": 1996.56, "end": 2021.76, "text": "Oh, oh, auf den Panzer, der Pants-Man, Leute, der Pants-Man. Bam. Geiler Air-Strike. Nicht"}, {"id": 186, "start": 2021.76, "end": 2034.0, "text": "so satisfying, nicht so satisfying Air-Strike. Das klingt wie das Griechen. Okay, man sollte"}, {"id": 187, "start": 2034.0, "end": 2038.16, "text": "in dem Game nicht über freie Felder laufen, das habe ich schon gecheckt. Guck mal, so"}, {"id": 188, "start": 2038.16, "end": 2056.6, "text": "viele gekommen sind auf einem, auf einem Haufen. Oh, von wo, von wo? Da, oh nee, meine Muni"}, {"id": 189, "start": 2056.6, "end": 2062.16, "text": "ist leer. Jetzt wird gerusht, Leute. Jetzt wird gerusht. Kann man, kann man das aufheben?"}, {"id": 190, "start": 2062.16, "end": 2071.32, "text": "Okay. Der Camera-Shake beim Laufen, ja, es fühlt sich sehr, sehr träge und, und klitschig"}, {"id": 191, "start": 2071.32, "end": 2076.76, "text": "an, also im Prinzip so wie vor zwei Jahren, wo ich es mal ausprobiert habe. Ripp. Geh"}, {"id": 192, "start": 2076.76, "end": 2085.8, "text": "mal bei MikeyDog rein. Der macht das gut, der sitzt hier schön im Häuschen und bewegt"}, {"id": 193, "start": 2085.8, "end": 2103.16, "text": "sich nett. MikeyDog. Das Hit-Feedback ist halt auch nicht so das geilste. Das Hit-Feedback"}, {"id": 194, "start": 2103.16, "end": 2117.28, "text": "ist auch bisschen merkwürdig. Achtung, Massive-Nade. Bin mir nicht ganz sicher, wo wir hingucken,"}, {"id": 195, "start": 2117.28, "end": 2132.36, "text": "wo wir jetzt hin können. Hier, Reinslide-On. Jawoll. Massive-Flight-Action. Komm, flanken,"}, {"id": 196, "start": 2132.36, "end": 2152.56, "text": "Massive-Flank. Die wissen noch nicht, dass wir hier sind. Pack. Enemy-Hit 91. Wie, das"}, {"id": 197, "start": 2152.56, "end": 2166.24, "text": "war kein Kill? Alter, da hat nur der Cop rausgeguckt. Der Waffensound, den gibt's nicht. Waffensound"}, {"id": 198, "start": 2166.24, "end": 2170.28, "text": "ist overrated, outdated, debated, den braucht man nicht. Die haben sich gedacht, Waffensound"}, {"id": 199, "start": 2170.28, "end": 2179.88, "text": "ist zu OP. Waffensound ist nicht notwendig für ein Game. Also ohne Waffensound ist tatsächlich"}, {"id": 200, "start": 2179.88, "end": 2191.64, "text": "echt hängen geblieben. Und auch dieses Hinlegen und so. Ne, ne. Was ist hier? Angeblich geht's"}, {"id": 201, "start": 2191.64, "end": 2204.2, "text": "hier voll ab, ich seh nix. Alles klar. Leckt. Boah, es leckt. Krass, haben wir eine gute"}, {"id": 202, "start": 2204.2, "end": 2219.68, "text": "Verbindung angeblich schon. Alter, beweg dich, man. Also die ganze Bewegung, da müssen sie"}, {"id": 203, "start": 2219.68, "end": 2224.72, "text": "auf jeden Fall noch was dran machen. Das fühlt sich nicht schwerfällig an. Wenn ihr was"}, {"id": 204, "start": 2224.72, "end": 2229.48, "text": "schwerfällig sehen wollt, dann spielt Halo. Halo spielt sich zwar schwerfällig, aber"}, {"id": 205, "start": 2229.48, "end": 2237.08, "text": "bei Halo fühlst du dich so wie Herr der Lage, was hier nicht so ist. Ich muss mal gucken,"}, {"id": 206, "start": 2237.08, "end": 2245.8, "text": "kann man jetzt hier irgendwie peeken oder so? Irgendwas hab ich gekillt. So, wir peeken,"}, {"id": 207, "start": 2245.8, "end": 2259.88, "text": "wir peeken da. Einer lebt doch da noch. Oh, meine Ammo ist schon wieder leer. Also da"}, {"id": 208, "start": 2259.88, "end": 2264.12, "text": "müssen sie auf jeden Fall noch irgendwas machen. Das fühlt sich nicht... Kann ich hier was"}, {"id": 209, "start": 2264.12, "end": 2276.44, "text": "rausnehmen? Request, hier, warte, Request. Request, Gadget Use. Ja, ja, ich will Ammo"}, {"id": 210, "start": 2276.44, "end": 2291.56, "text": "haben. Gib her, gib Ammo. Pog, Ehrenmann hier, guckt euch an. Hallo? Mehr geht nicht. Richtig"}, {"id": 211, "start": 2291.56, "end": 2298.64, "text": "Ehrenmann hier. Mickey, alter. Jawoll. Jetzt hab ich, jetzt hab ich was, aber von hinten"}, {"id": 212, "start": 2298.64, "end": 2304.96, "text": "wäre weggestellt. Okay. Kann man Klassen wechseln? Equipment Anti-Tank. Hä, ich bin"}, {"id": 213, "start": 2304.96, "end": 2309.64, "text": "Anti-Tank? Das ist doch keine... Die Waffe, die ich hab, sieht anders aus als das. Ich"}, {"id": 214, "start": 2309.64, "end": 2323.08, "text": "bin Assault. Ich will Anti, ich will das hier spielen. Ne. Anti-Tank, Character? Oh Leute,"}, {"id": 215, "start": 2323.08, "end": 2328.8, "text": "habt ihr es gesehen? Man kann Squads wechseln. Sachen gibt's, es gibt Spiele, die haben tatsächlich"}, {"id": 216, "start": 2328.8, "end": 2346.16, "text": "noch sowas Basic-mäßiges wie Squads wechseln drin. Oh, oh. The Forsen Troll. Oh, oh, Toss."}, {"id": 217, "start": 2346.16, "end": 2352.04, "text": "Es gibt wenige Schimpfwörter, die ich kenne, so auf Russisch, aber das war Toss. Das war"}, {"id": 218, "start": 2352.04, "end": 2374.48, "text": "definitiv Toss. Ist das ein Gegner? Ne. Ich hab keine Ahnung wo... Alter Mann. Hab ich"}, {"id": 219, "start": 2374.48, "end": 2385.32, "text": "den gekillt? Ne, oder? Was ein Gestellte, Mann. Das ist glaub ich kein Game für mich. Das"}, {"id": 220, "start": 2385.32, "end": 2391.44, "text": "ist mir dann doch ein bisschen zu langsam. Okay, kommen wir hier raus? Oh, da ist was."}, {"id": 221, "start": 2391.44, "end": 2401.12, "text": "Oh ne, das ist ein gegnerischer Panzer. Okay, das war 1A Headshot. Direkt Down Gegner. Treffer,"}, {"id": 222, "start": 2401.12, "end": 2424.08, "text": "Treffer, Feedback nicht vorhanden. Wallbang. Alter. Der Typ. Lul. Lul. Alter, die lassen"}, {"id": 223, "start": 2424.08, "end": 2431.96, "text": "sich ja wegspringen wie sonst was hier. Man hört halt nichts. Man hört keine Schritte"}, {"id": 224, "start": 2431.96, "end": 2443.04, "text": "und nichts. Das ist extremst irritierend. Und auch das Move ist so laggy. Okay, ich"}, {"id": 225, "start": 2443.04, "end": 2447.64, "text": "will mich mal nicht beschweren, das Ding ist Beta und alles, aber es spielt sich nicht"}, {"id": 226, "start": 2447.64, "end": 2455.6, "text": "wirklich gut. Ich könnte mir aber vorstellen, wenn sie das auf die Reihe kriegen, ist das"}, {"id": 227, "start": 2455.6, "end": 2464.52, "text": "so ein bisschen Taktik, FPS, mit Battlefield-Einschlag. Wirklich viel Battlefield sehe ich jetzt"}, {"id": 228, "start": 2464.52, "end": 2468.92, "text": "weder beim Moveman noch bei anderen Sachen. Ich mein es geht Panzer oder so. Also richtig"}, {"id": 229, "start": 2468.92, "end": 2473.36, "text": "viel Battlefield ist da nicht dabei. Aber es ist so ein bisschen Taktik. Taktik stellt"}, {"id": 230, "start": 2473.36, "end": 2479.88, "text": "es mit Battlefield-Anleihen. Das stelle ich mir gar nicht mal so schlecht vor. Wieso fliegen"}, {"id": 231, "start": 2479.88, "end": 2483.68, "text": "Granaten, als würde man tote Forelle schmeißen? Ich weiß nicht, das sind super krasse Elite-Soldaten,"}, {"id": 232, "start": 2483.68, "end": 2497.4, "text": "die können das halt nicht besser. Du meinst heute das Game ist traurig, was die auf Russisch"}, {"id": 233, "start": 2497.4, "end": 2503.12, "text": "sprechen oder du meinst aktuell ist Battlefield traurig mit russischen Sprüchen? Weil die"}, {"id": 234, "start": 2503.12, "end": 2509.72, "text": "müssten eigentlich theoretisch richtig nice russisches Voice Acting haben, weil die kommen"}, {"id": 235, "start": 2509.72, "end": 2515.4, "text": "aus Polen und ich glaube die haben bestimmt auch viele Entwickler aus Russland. Ach BF2124,"}, {"id": 236, "start": 2515.4, "end": 2519.24, "text": "also die hier müssten das eigentlich ganz gut hinkriegen. Aber die haben auch bei den"}, {"id": 237, "start": 2519.24, "end": 2524.68, "text": "Durchsagen in der U-Bahn richtig deutsche Sprecher gehabt. Guck mal wir haben jetzt"}, {"id": 238, "start": 2524.68, "end": 2542.48, "text": "M14, äh nicht M14, M417. MSBSK. Holosight, jawoll. Next. Lobby. Wir gucken mal, vielleicht"}, {"id": 239, "start": 2542.48, "end": 2547.4, "text": "können wir das schon, ach guck mal jetzt haben wir das Holosight schon drauf. Hatte"}, {"id": 240, "start": 2547.4, "end": 2556.72, "text": "das alles automatisch Attached? Jetzt sind wir in Warschau. Oder, oder, nee. Ist das"}, {"id": 241, "start": 2556.72, "end": 2563.08, "text": "überhaupt Warschau oder ist das Kriegsäge? Ist das Warschau oder ist das die Kriegsäge?"}, {"id": 242, "start": 2563.08, "end": 2578.24, "text": "Moment, ich weiß, dass ich das anlockt hab, das müsst ihr mir nicht nochmal zeigen. Die"}, {"id": 243, "start": 2578.24, "end": 2588.24, "text": "Gesichtsanimation ist tatsächlich, das könnte man in der Tat eins zu eins eigentlich hier"}, {"id": 244, "start": 2588.24, "end": 2595.64, "text": "so rein machen. Es sieht wirklich äußerst Gang-Wade-mäßig aus. Ah jetzt sind wir in"}, {"id": 245, "start": 2595.64, "end": 2610.76, "text": "Moskau. Jetzt sind wir quasi, so, ja was denn jetzt Game? Kriege ich jetzt einfach immer"}, {"id": 246, "start": 2610.76, "end": 2618.0, "text": "Level geschenkt für nicht spielen? Ok Customize. Guck mal was wir hier machen können. Anti-Tank"}, {"id": 247, "start": 2618.0, "end": 2625.2, "text": "Equipment, nee Assault. Assault hatten wir von den Dingern. Ok. MSBSK Default. Und da"}, {"id": 248, "start": 2625.2, "end": 2636.2, "text": "können wir jetzt unser Zeug Attachchen? Nee. Iron Sight, Secondary Sight. Ich hab doch,"}, {"id": 249, "start": 2636.2, "end": 2642.04, "text": "ich hab doch eben irgendeinen Holosight unlockt, hat er mir gesagt. Welches Holosight hab ich"}, {"id": 250, "start": 2642.04, "end": 2655.24, "text": "denn unlockt? Irgendwie glaube ich, dass es verbackt ist. Body Parts? Was für Body Parts?"}, {"id": 251, "start": 2655.24, "end": 2669.84, "text": "Ah Stock und Griff und so, ok. Aber wo ist denn? Ok, das ist cool gemacht. Das finde"}, {"id": 252, "start": 2669.84, "end": 2678.28, "text": "ich nice. Nee das muss doch die, war das auf der anderen? Ah Moment, ich war ja Anti-Tank."}, {"id": 253, "start": 2678.28, "end": 2691.56, "text": "Sekunde, ich war ja Anti-Tank. Man muss das hierfür gewesen sein. Nee. Das ist nicht"}, {"id": 254, "start": 2691.56, "end": 2708.6, "text": "das Holo, was ich unlockt hab. Configs? Customize? Nee. Nee, das ist auch wieder was anderes."}, {"id": 255, "start": 2708.6, "end": 2720.92, "text": "Ich bin verwirrt Leute. Ich hab keine Ahnung, was ich da gerade unlockt habe. Assault. Backpack?"}, {"id": 256, "start": 2720.92, "end": 2730.92, "text": "Ach hier ist jetzt im Backpack? Ok, das ist maximal verwirrend. Ich hab nen Rucksack jetzt"}, {"id": 257, "start": 2730.92, "end": 2736.28, "text": "mit nem Visier drinnen. Primary, dann glaube Holo. Nee, da haben wir gerade geguckt, da"}, {"id": 258, "start": 2736.28, "end": 2744.28, "text": "ist das nicht. Du kannst bei den Visieren den Reiter wechseln. Ah Moment, ich blick"}, {"id": 259, "start": 2744.28, "end": 2753.32, "text": "gerade nicht mehr durch. So hier, Customization? Moment, den Skin für nen Visier oder? Primary"}, {"id": 260, "start": 2753.32, "end": 2774.36, "text": "Side. Wo kann ich hier was wechseln? Nee, hier kannst du nix wechseln. Oben? Ah, boah."}, {"id": 261, "start": 2774.36, "end": 2780.76, "text": "Ok, ok, das ist Hardcore ohne übersicht. Aber wenn man es weiß, wenn man es weiß, dann"}, {"id": 262, "start": 2780.76, "end": 2786.04, "text": "sieht man das. Also dieses Grau auf Schwarz im Hintergrund, das ist wirklich sehr sehr"}, {"id": 263, "start": 2786.04, "end": 2790.92, "text": "schwierig zu sehen. Zumal du es auch nicht siehst, dass es überhaupt wechselt von dem"}, {"id": 264, "start": 2790.92, "end": 2796.64, "text": "Menü ins Untermenü rein. Ok, Holo Side. Bam, jawoll. Haben wir sonst noch irgendwas?"}, {"id": 265, "start": 2796.64, "end": 2801.56, "text": "Secondary Side? Nee, Secondary Side brauchen wir nicht. Under Barrel. Gleich den Noobtube"}, {"id": 266, "start": 2801.56, "end": 2808.72, "text": "auspacken. Es gibt nen Skin für nen Magazin. Na gut, da kann man Magazin halt dann lila"}, {"id": 267, "start": 2808.72, "end": 2822.04, "text": "machen oder so. Secondary Ammo. Wenn ich kann den ganzen Kram im Shop kaufen für Big Money,"}, {"id": 268, "start": 2822.04, "end": 2831.48, "text": "gibt es nen Schalldämpfer? 35. Das ist doch lange Spiele. Nächste gibt es hier? Moment,"}, {"id": 269, "start": 2831.48, "end": 2837.68, "text": "wir gucken mal kurz den Shop, Leute. Keine Sorge, ich kauf nix. Ich will nur mal gucken,"}, {"id": 270, "start": 2837.68, "end": 2846.72, "text": "was es da gibt. Shop. Ah, Shop ist broken. Shop geht grad nicht, alles klar. Ok, ja dann"}, {"id": 271, "start": 2846.72, "end": 2850.68, "text": "Player Banner. Oh, aber ich muss sagen, die Menüs sind unübersichtlich, aber es gibt"}, {"id": 272, "start": 2850.68, "end": 2859.92, "text": "wenigstens Sachen zum Einstellen im Vergleich zu Battlefield. Team Formation. Ja, LLV an"}, {"id": 273, "start": 2859.92, "end": 2880.28, "text": "Start. Banner. Red Powder. Banner Flag. Ok. Brasilien. Keine Ahnung. Fiji. El Salvador."}, {"id": 274, "start": 2880.28, "end": 2890.52, "text": "Come here. Bam. Dieser Chat ist jetzt deutsch. Alles klar. Quick Play. Auf gehts. Tactical"}, {"id": 275, "start": 2890.52, "end": 2898.76, "text": "Ops. In der Kriegssege wieder. Und wie ist WW3? Also ich erkenne ganz gute Ansätze. Es"}, {"id": 276, "start": 2898.76, "end": 2904.24, "text": "fühlt sich an wie irgendein Tactical FPS mit Battlefield anleihen. Es ist weniger wirklich"}, {"id": 277, "start": 2904.24, "end": 2913.24, "text": "Battlefield. Sag mal, ich hab doch eben Anti-Tank ausgewählt, hab aber Assault gespielt, ne?"}, {"id": 278, "start": 2913.24, "end": 2921.32, "text": "Ja. Guck mal, jetzt hab ich mein... Ach, Waiting for Players. Also ich erkenne das"}, {"id": 279, "start": 2921.32, "end": 2934.72, "text": "massive Textur. Huge Textures hier. Guckt's euch an. Ah, es lädt noch rein, aber naja."}, {"id": 280, "start": 2934.72, "end": 2939.68, "text": "Da geht noch was. Also ich entdecke Ansätze in dem Game, die ich gar nicht so schlecht"}, {"id": 281, "start": 2939.68, "end": 2946.32, "text": "finde. Es ist halt noch sehr groh und das Movement müssen sie auf jeden Fall was dran"}, {"id": 282, "start": 2946.32, "end": 2951.48, "text": "machen. Also was mit dem Movement, das fühlt sich einfach falsch an. Vor allem wenn der"}, {"id": 283, "start": 2951.48, "end": 2955.24, "text": "Tactical Sprint dann immer nicht funktioniert zwischendurch. Manchmal geht er, manchmal"}, {"id": 284, "start": 2955.24, "end": 2962.0, "text": "nicht. 40 für 30 Spiele. Aha, verstehe, verstehe. Vielleicht zählen die da einfach"}, {"id": 285, "start": 2962.0, "end": 2975.36, "text": "anders. Vielleicht heißt es 30 von 38 sind ready oder es müssen noch 7 ready werden."}, {"id": 286, "start": 2975.36, "end": 2989.0, "text": "Oder sowas. Oh, wir haben Waffensaugen, Leute. Du musst halten, ausstellen beim Sprinten."}, {"id": 287, "start": 2989.0, "end": 3013.52, "text": "Ah, ok. Controls. Alles klar. Browse. So. Auf Toggle. Ist das jetzt dann Tactical Sprint"}, {"id": 288, "start": 3013.52, "end": 3023.08, "text": "da los geht? Probieren wir mal aus. Ja, aber dann macht immer noch kein Tactical Sprint."}, {"id": 289, "start": 3023.08, "end": 3027.96, "text": "Der Tactical Sprint ist ja der hier. Dann musst du es zweimal drücken. Ok, das ist"}, {"id": 290, "start": 3027.96, "end": 3033.64, "text": "gewöhnungsbedürftig, ja. Tatsächlich. Da gucken wir mal. So, mal schauen wir die Map."}, {"id": 291, "start": 3033.64, "end": 3037.56, "text": "Es kann man hier hoch. Das würde mich mal interessieren, ob man irgendwie krasse Kletter-Action"}, {"id": 292, "start": 3037.56, "end": 3047.44, "text": "machen kann. Nope. Boah, es ruckelt. Es laggt. Das ist Kaufhaus oder sowas. Vielleicht sollte"}, {"id": 293, "start": 3047.44, "end": 3050.44, "text": "ich nicht unbedingt mit meinen Leuten hier auf einen Platz stellen. Das ist nicht so"}, {"id": 294, "start": 3050.44, "end": 3059.56, "text": "gut. Gehe jetzt runter. Mal Map gucken. Ah, ok. A1 wird gerade gecaptured. Das heißt,"}, {"id": 295, "start": 3059.56, "end": 3064.96, "text": "wir gehen jetzt geradeaus und dann links. Die Maps sind, von der Größe her sehen die"}, {"id": 296, "start": 3064.96, "end": 3074.96, "text": "schon mal ganz brauchbar aus. Was genau geht mit euch da ab? Von der Größe finde ich"}, {"id": 297, "start": 3074.96, "end": 3080.16, "text": "die schon mal relativ brauchbar. Kann man durch? Nope. Ok, Maps sind relativ statisch."}, {"id": 298, "start": 3080.16, "end": 3084.84, "text": "Wir gehen jetzt ans Fenster. Eins habe ich gelernt, nehme immer am Fenster die Leute"}, {"id": 299, "start": 3084.84, "end": 3089.08, "text": "auf der Straße weg. Ich bin tot, wenn ich hier rüber laufe. Ich sage es euch. Bin ich"}, {"id": 300, "start": 3089.08, "end": 3096.08, "text": "überhaupt richtig, Zack? Wo bin ich auf der Map? Ach, da unten. Ok, wenn ich hier rüber"}, {"id": 301, "start": 3096.08, "end": 3106.0, "text": "gehe, dann komme ich direkt bei A1 raus. Ok, wir probieren es. Achtung! Ah, Technik Sprint,"}, {"id": 302, "start": 3106.0, "end": 3118.68, "text": "A1. Ah, ok, Pantsman. Da schreit er. Gut, da macht sie jetzt nichts dagegen. Also ich"}, {"id": 303, "start": 3118.68, "end": 3122.36, "text": "muss sagen, die Map Größe sagt mir schon mal deutlich mehr zu. Ich finde es ein bisschen"}, {"id": 304, "start": 3122.36, "end": 3130.4, "text": "orschverwinkelt. Oh, GG Eatsporn. Also die Map Größe finde ich ein bisschen orschverwinkelt."}, {"id": 305, "start": 3130.4, "end": 3139.48, "text": "Aber es ist auf jeden Fall schon mal besser mit Waffensound als die letzte Runde. Wobei"}, {"id": 306, "start": 3139.48, "end": 3157.4, "text": "letzte Runde waren wir gar nicht so schlecht. The Clinton. Gibt es Defis? Das wird mich"}, {"id": 307, "start": 3157.4, "end": 3164.08, "text": "mal interessieren, ob es Defistells gibt. Ok, wir müssen jetzt den Rainbow-Six-Stells"}, {"id": 308, "start": 3164.08, "end": 3177.52, "text": "machen. Hier, da geht es so. Oh ja. Immer schön. The Pantsman. Alter, ich will taktisch"}, {"id": 309, "start": 3177.52, "end": 3191.72, "text": "sprinten. Lass mich taktisch... Richtig zuordnen Buff von... What the fuck? Aber die Trefferanzeige"}, {"id": 310, "start": 3191.72, "end": 3197.0, "text": "ist tatsächlich... Ok, da hat mir einfach zweimal ins Gesicht geschossen. Aber mein"}, {"id": 311, "start": 3197.0, "end": 3209.6, "text": "Team macht das schon. Also Sprinten ist keine gute Idee, merke ich. Sprinten brauchst du"}, {"id": 312, "start": 3209.6, "end": 3216.0, "text": "viel zu lang, bis du schießen kannst. Aber ohne Sprinten ist er lahm as fuck. Schießen"}, {"id": 313, "start": 3216.0, "end": 3231.24, "text": "die hinten? Oder nicht? Aber man hat ihn gehört, Leute. Der kommt sich jetzt auch mega abgekempt"}, {"id": 314, "start": 3231.24, "end": 3257.32, "text": "vor. Haha. Nein. Drei. Heal. Ich brauch ne Granate. Das. War er das?"}, {"id": 315, "start": 3257.32, "end": 3277.52, "text": "Oh, was ein Gestellte. Das ist kein Game für mich. Ich sag's euch. Das ist kein Game"}, {"id": 316, "start": 3277.52, "end": 3298.68, "text": "für mich. Hier wird so krass gestellst. Ich hör was. Ich bräuchte mal... Haben wir"}, {"id": 317, "start": 3298.68, "end": 3308.04, "text": "noch hier was? Ok, ok. Ja, Battlefield und Rainbow Six. Es ist eher Rainbow Six. Es ist"}, {"id": 318, "start": 3308.04, "end": 3316.24, "text": "eher Rainbow Six. Ok, mit der Pistole machst du da nichts. Es ist eher Rainbow Six. Features"}, {"id": 319, "start": 3316.24, "end": 3324.0, "text": "ein bisschen Battlefield. Ah ja. Da haben wir auch immer ganz gut reingegangen. Da wird"}, {"id": 320, "start": 3324.0, "end": 3338.92, "text": "er geslided. Da slided er richtig rein, Gatschi-Buzz. Ok, aber dass der Tactical-Sprint nicht funktioniert,"}, {"id": 321, "start": 3338.92, "end": 3363.64, "text": "das fuckt mich ab. Guck mal, das ist so broken. Das Game ist nice, wenn man gerne Ecken abkempt."}, {"id": 322, "start": 3363.64, "end": 3385.32, "text": "Eckenstelles macht. Das ist gut hier. Hallo? Oh, oh, au. Da vorne geht was. Aber eins merkt"}, {"id": 323, "start": 3385.32, "end": 3390.12, "text": "man, und das finde ich gut, das finde ich gut, sobald es ein bisschen Tactical und nicht"}, {"id": 324, "start": 3390.12, "end": 3395.76, "text": "so Spray and Pray ist, die Leute laufen realistischer, weil normalerweise wird auch keiner hier auf"}, {"id": 325, "start": 3395.76, "end": 3403.08, "text": "der Straße laufen, sondern eher an der Wand. Das finde ich schon mal ganz gut. Oh, oh."}, {"id": 326, "start": 3403.08, "end": 3430.0, "text": "Und es hat Friendly Fire. Oh, Tactical-Sprint. Wo sind denn meine Leute jetzt hin? Iron Sides"}, {"id": 327, "start": 3430.0, "end": 3458.8, "text": "gegen gerade nicht. Ok, zu hinten über Range ist echt nicht ohne."}, {"id": 328, "start": 3458.8, "end": 3472.44, "text": "Ok, über Range was zu klatschen ist wirklich schwierig."}, {"id": 329, "start": 3472.44, "end": 3499.4, "text": "Ok, Hüfte sprayen ist nicht. Hüfte sprayen ist nicht. Wunder, dass das gut läuft mit"}, {"id": 330, "start": 3499.4, "end": 3506.08, "text": "dem Detailgrad. Ich habe alles auf Null. Ich habe alles auf Low. Und es hat ziemliche"}, {"id": 331, "start": 3506.08, "end": 3517.08, "text": "Slowdowns zwischendurch, das merkt man auch. Ich habe keinen Plan, wo wir auf der Map sind."}, {"id": 332, "start": 3517.08, "end": 3521.0, "text": "Das sieht für mich alles aus wie eigene Maps. Wo sind wir denn jetzt hier auf einmal? Metro"}, {"id": 333, "start": 3521.0, "end": 3532.32, "text": "sind wir jetzt am Start. Metro. Aber ich glaube die Maps lernt man halbwegs mit der"}, {"id": 334, "start": 3532.32, "end": 3544.64, "text": "Zeit. Ok, da ist ein anderer Typ. Wir gucken jetzt, ob der hier rein pusht. Der aimt doch"}, {"id": 335, "start": 3544.64, "end": 3559.68, "text": "ab. Nee, das sind meine jetzt. So, probieren wir das nochmal hier drinnen, unser Glück."}, {"id": 336, "start": 3559.68, "end": 3589.48, "text": "Ok. Ok. Ich verpiss mich mal wieder. Ich weiß gar nicht vor wo. Ok, da hat er Eckenkug"}, {"id": 337, "start": 3589.48, "end": 3603.2, "text": "stills gemacht. Hätte ich auch machen sollen. Kann der länger rutschen als ich? Aber wir"}, {"id": 338, "start": 3603.2, "end": 3610.2, "text": "sind ganz gut dabei. Ich glaube, ich glaube, ich sporene gerade bei dem, das war keine,"}, {"id": 339, "start": 3610.2, "end": 3616.16, "text": "auf auf auf, du machst das schon. Lass dich nicht von der Seite killen. Was ich, ja, ich"}, {"id": 340, "start": 3616.16, "end": 3619.88, "text": "habe vergessen, was ich sagen wollte. Ich glaube, das ist kein Game, wo du mit 35 Kills"}, {"id": 341, "start": 3619.88, "end": 3646.76, "text": "am Ende rausgehst oder so. Wirklich nicht. Gehen wir mal kurz hier gucken. Oh. Panzer?"}, {"id": 342, "start": 3646.76, "end": 3661.48, "text": "Wenn ich sehe, ob ich da was gesehen habe. Kann man die Granaten vielleicht weiter?"}, {"id": 343, "start": 3661.48, "end": 3666.68, "text": "Ich habe nur G gedrückt. Ich habe noch nicht mal abgedrückt. Man kann die nicht halten."}, {"id": 344, "start": 3666.68, "end": 3679.84, "text": "Sobald man G drückt, wirft er die. Ok, das ist. Das ist der Panzer. Der Panzer. Mach"}, {"id": 345, "start": 3679.84, "end": 3695.72, "text": "ihn platt. Bäm. Mach ihn kaputt. Jawoll. Oh, das war nice. Das fühlt sich deutlich,"}, {"id": 346, "start": 3695.72, "end": 3700.36, "text": "aber mal realistischer an als Battlefield. Das war also taktischer, langsamer, realistischer."}, {"id": 347, "start": 3700.36, "end": 3706.68, "text": "Das ist wirklich ab abfuck. Also das mag ich nicht. Vor allem, dass der tactical Sprint"}, {"id": 348, "start": 3706.68, "end": 3716.88, "text": "nie funktioniert. Wenn du ihn bräuchtest. Nehmen wir mal hier Max mit. Jawoll. Und vielleicht"}, {"id": 349, "start": 3716.88, "end": 3729.88, "text": "auch mit. Guck mal, wir haben noch Kills. Wir können auch Kills holen. Wo geht hier was?"}, {"id": 350, "start": 3729.88, "end": 3747.72, "text": "Ok, alles klar. Was planen die Entwickler so ehrlich gesagt? Keine Ahnung. Können wir"}, {"id": 351, "start": 3747.72, "end": 3768.16, "text": "mal gucken. Boah, aber das Movement ist wirklich Pains. Pains Champ. Richtiger Pains Champ."}, {"id": 352, "start": 3768.16, "end": 3787.56, "text": "Richtig Pains Champ Movement, ja. Da oben war ein Gegner. Oh, ich sollte hier weg. Kann"}, {"id": 353, "start": 3787.56, "end": 3790.04, "text": "ich jetzt? Ich wollte gerade sagen, ich kann jetzt einen Airstrike darauf machen, aber"}, {"id": 354, "start": 3790.04, "end": 3806.04, "text": "jetzt rennen unsere Leute darum. Oh, Airstrike. Direkt hier auf uns. Hä? Ah, Refill. Nice."}, {"id": 355, "start": 3806.04, "end": 3815.76, "text": "A health restore? Ok. Sag mal, sind die über uns? Was ist das? Grenades? Ammo? Ich finde"}, {"id": 356, "start": 3815.76, "end": 3820.04, "text": "es auch cool, dass man restocken muss erstmal. Nee, da macht nichts. Kann man hier oben was"}, {"id": 357, "start": 3820.04, "end": 3829.88, "text": "ins Fenster werfen? Nee. Interessant. So, wo sind die jetzt? Unter uns? Über uns? Tiefgarage?"}, {"id": 358, "start": 3829.88, "end": 3839.12, "text": "Boah, das ist echt, das ist mal richtig unübersichtlich. Ich glaube, das ist eher so ein Game für"}, {"id": 359, "start": 3839.12, "end": 3847.84, "text": "Leute, die 5 Minuten stelzen wollen und richtig so outsmarten die Gegner. Für mich ist das"}, {"id": 360, "start": 3847.84, "end": 3858.72, "text": "nix. Ich brauche mehr run and gun. Da ist es nur kleine Indie-Company. Ja, so wie Blizzard."}, {"id": 361, "start": 3858.72, "end": 3873.2, "text": "Kann man nicht so viel erwarten, finde ich auch. Capture? Nee, wir capturen C1. Wo gehe"}, {"id": 362, "start": 3873.2, "end": 3879.6, "text": "ich denn jetzt am besten hin? Hier ist was, angeblich. Angeblich stellst du dir was."}, {"id": 363, "start": 3879.6, "end": 3903.0, "text": "Von wo? Hier? Boah, das ist ja verwinkelt hoch 3. Das ist ja mal wirklich krass verwinkelt,"}, {"id": 364, "start": 3903.0, "end": 3911.88, "text": "das ist echt krass. Wo bin ich überhaupt auf der Map? Da. Okay, dann gehen wir mal"}, {"id": 365, "start": 3911.88, "end": 3919.16, "text": "zu A2 jetzt vor. Wahrscheinlich werde ich aus irgendeinem Fenster gebashed jetzt. Moment,"}, {"id": 366, "start": 3919.16, "end": 3942.64, "text": "ist hier was? Ah, da hinten ist was. Achtung, Massive-Nade. So, wenn es Spotten gäbe, wäre"}, {"id": 367, "start": 3942.64, "end": 3947.88, "text": "cool, aber das ist glaube ich nicht tactical genug hier, das Spotten. Ah, haben wir gehitted?"}, {"id": 368, "start": 3947.88, "end": 3958.12, "text": "Meine Muni ist alt. Man darf hier definitiv, ah, tactical sprint, mach tactical sprint."}, {"id": 369, "start": 3958.12, "end": 3964.08, "text": "Man darf nicht so viel sprayen. Das habe ich glaube ich schon kapiert. Immerhin, wir sind"}, {"id": 370, "start": 3964.08, "end": 3968.28, "text": "das beste Squad, ich habe 11 Kills. Bin ich zufrieden mit, weil es gibt kaum welche, die"}, {"id": 371, "start": 3968.28, "end": 3972.28, "text": "mehr haben. Für so richtig einen Kack-Noop wie mich in dem Game ist es gut. Aber man"}, {"id": 372, "start": 3972.28, "end": 3976.76, "text": "kann am Punkt spawnen, man kann aber auch bei den Leuten spawnen. Das klingt schon"}, {"id": 373, "start": 3976.76, "end": 3983.12, "text": "mal sehr sinnvoll. Oh, der ist da stauner, Dude. Ich muss spawnen, Leute. Was, Deployment"}, {"id": 374, "start": 3983.12, "end": 4012.4, "text": "in progress? Wie jetzt? Ah, jetzt. Oh, tactical sprint, please."}, {"id": 375, "start": 4012.4, "end": 4020.32, "text": "MonkaS, wo soll ich denn hin? Das ist mir viel zu hoch. Warum die den Scoreboard haben?"}, {"id": 376, "start": 4020.32, "end": 4025.52, "text": "Ja, weil es denen scheiß egal ist, ob die Leute abfucken oder nicht. Und DICE hat sich"}, {"id": 377, "start": 4025.52, "end": 4038.16, "text": "gedacht, ne ne, das geht nicht, wir können hier nicht. Alter, der geht nicht ins ADS."}, {"id": 378, "start": 4038.16, "end": 4055.92, "text": "Der Dude ist noch da, ich sag's euch. Der hat mich doch gesehen, der Kerl. Wer weg?"}, {"id": 379, "start": 4055.92, "end": 4078.08, "text": "Ey, ich weiß gar nicht, warum ihr... Ah, friendly fire, friendly fire, na geil. Ge-friendly"}, {"id": 380, "start": 4078.08, "end": 4091.24, "text": "und deploy. Lass mich rein. Leute, ich geh hoch, ich wette die Flanken hoch. Ich wette"}, {"id": 381, "start": 4091.24, "end": 4110.8, "text": "mit euch die Flanken von oben hier unten rein. Oder auch nicht. Aber der tactical sprint"}, {"id": 382, "start": 4110.8, "end": 4129.0, "text": "macht mich wirklich fertig. Ah, guck mal, da. Ein medikit. Huge. Ist da einer in der"}, {"id": 383, "start": 4129.0, "end": 4136.08, "text": "Ecke? Findet ihr das auch ziemlich verschwommen auf range? Ist das vielleicht nicht auf max?"}, {"id": 384, "start": 4136.08, "end": 4144.0, "text": "Doch, doch, passt, ist eigentlich alles gut. Die respawn cam. Ohne Mist, die respawn cam"}, {"id": 385, "start": 4144.0, "end": 4157.28, "text": "ist viel besser als vom Battlefield. Du siehst wenigstens, wo du rein spawnst. Aber am Movement"}, {"id": 386, "start": 4157.28, "end": 4166.68, "text": "müssen sie unbedingt noch was machen. Also das Movement ist wirklich richtig loss, ach"}, {"id": 387, "start": 4166.68, "end": 4174.56, "text": "ne. Richtig pains, pains, champig. War da was? Hab ich da grad was gesehen? Hab ich da"}, {"id": 388, "start": 4174.56, "end": 4185.52, "text": "grad einen Gegner gesehen oder war das einer von mir? Nee, das war wohl was von mir. Ja,"}, {"id": 389, "start": 4185.52, "end": 4189.68, "text": "ich glaub die Beta kostet 13€ Early Access, aber ich hab das Spiel vor 2 oder 3 Jahren,"}, {"id": 390, "start": 4189.68, "end": 4195.48, "text": "also schon ewig her, hab ich das auf Steam gekauft. Ich darf als Veteran mit 15 Minuten"}, {"id": 391, "start": 4195.48, "end": 4200.68, "text": "Spielzeit oder so, als Veteran darf ich jetzt auch dran teilnehmen. Wir haben gecaptured."}, {"id": 392, "start": 4200.68, "end": 4207.68, "text": "So, wir haben den ersten. Leute, wollen wir mal LLV fahren? Land Drone haben wir. Guck"}, {"id": 393, "start": 4207.68, "end": 4226.92, "text": "mal, wir haben. Gib ihm. Gib ihm. Gib ihm. Jawoll. Was ein Ding, sieht aus wie aus dem"}, {"id": 394, "start": 4226.92, "end": 4246.16, "text": "Vincent's Door. Ach, wir haben nur beschränkte Range, ok. Man kann nicht steuern im Ironside."}, {"id": 395, "start": 4246.16, "end": 4266.44, "text": "Oh, da kommt der Pantsman, ich muss weg. Der real Pantsman ist am Start. Ok, gut. Nein."}, {"id": 396, "start": 4266.44, "end": 4273.96, "text": "Link Brocken. Nein, nein, Link ist nicht Brocken. Ich bin wieder da. Ich bin wieder in Range."}, {"id": 397, "start": 4273.96, "end": 4291.24, "text": "Ich hab, ich hab kein Ironside. Ich hab, mein Ironside ist weg. Warum ist mein Ironside"}, {"id": 398, "start": 4291.24, "end": 4296.96, "text": "kaputt? Das ist ziemlich blöd, wenn mein Ironside kaputt ist, ich seh nix mehr. Ok,"}, {"id": 399, "start": 4296.96, "end": 4318.08, "text": "was? Was? Oh, oh. Ha, da hast du gedacht. Das hast du dir so gedacht, Alter. Das hast"}, {"id": 400, "start": 4318.08, "end": 4346.24, "text": "du dir so gedacht. Ich kann auch dieses Kocken abstellten hier. Wo ist er? Ok, ich hab ihn"}, {"id": 401, "start": 4346.24, "end": 4357.16, "text": "hier. Ok, ich hab keine Ahnung, wo er ist. Ha, ha, ha. Im Kopf, Mann. Jetzt hat er sich"}, {"id": 402, "start": 4357.16, "end": 4362.64, "text": "gedacht, er kann mich outmoven. Oh. Ok, ich hab nix gesagt. Was willst du machen? Was"}, {"id": 403, "start": 4362.64, "end": 4372.0, "text": "willst du machen? Was willst du machen? Die Sprüche sind ziemlich tost, würde ich sagen."}, {"id": 404, "start": 4372.0, "end": 4380.08, "text": "Also ich kann ja nicht viele russische Schimpfwörter, aber das ist auf jeden Fall fast, fast, fast"}, {"id": 405, "start": 4380.08, "end": 4393.4, "text": "schon in Richtung wie die Battlefield 3 Soldaten. Die haben ja auch geflucht ohne Ende. Eher,"}, {"id": 406, "start": 4393.4, "end": 4397.44, "text": "das ist russisch tost, das ist kein Problem, das wird nicht gebannt. Englischsprachiges"}, {"id": 407, "start": 4397.44, "end": 4414.16, "text": "wird auf jeden Fall. Was ist hier? Oh, da ist er. Alles klar. Kein Wort verstanden, aber"}, {"id": 408, "start": 4414.16, "end": 4427.6, "text": "einfach gesagt, ich hab ihn richtig hart weggecockt. Keine Ahnung. Panzer? Nein, da ist einer."}, {"id": 409, "start": 4427.6, "end": 4447.88, "text": "Nein, nein, nein, nein, nein, nein. Nein. Restore health, restore health. Nein, nein,"}, {"id": 410, "start": 4447.88, "end": 4462.16, "text": "nein, nein, nein. Er schreckt mich nicht so. Da stehen unsere Leute in der Ecke und von"}, {"id": 411, "start": 4462.16, "end": 4467.6, "text": "wo wärste weggeklatscht? Von hinten. Das Game hat definitiv keine Zwe- Doch, das Game"}, {"id": 412, "start": 4467.6, "end": 4470.92, "text": "ist glaube ich schon 4 oder 5 Jahre in Entwicklung, aber ich glaube dazwischen hatten sie keinen"}, {"id": 413, "start": 4470.92, "end": 4487.88, "text": "Bock mehr oder so, keine Ahnung. Fuck, jetzt hätt ich sie wegklatschen können. Achso,"}, {"id": 414, "start": 4487.88, "end": 4491.88, "text": "Battlefield, nee, Battlefield nicht, Battlefield nicht. Leute, wir sind richtig gut, guckt's"}, {"id": 415, "start": 4491.88, "end": 4505.88, "text": "euch mal an. Wir sind richtig gut. Gut, bock. Ok, wir stellzen wieder in der Tiefgarage"}, {"id": 416, "start": 4505.88, "end": 4514.48, "text": "rum. Ok, wir sprinten, der kommt von oben jetzt. Ich weiß, der kommt von oben. Ah, alter"}, {"id": 417, "start": 4514.48, "end": 4540.76, "text": "tactical sprint, man funktioniert doch halt. Ich hör so rumrennen, ich weiß nicht von"}, {"id": 418, "start": 4540.76, "end": 4568.76, "text": "wo. Nee, das ist einer von mir. Dann sind die doch unten. Wer ist noch da? Jetzt nicht"}, {"id": 419, "start": 4568.76, "end": 4581.24, "text": "mehr. Kann man sich hinlegen Leute? Hat jemand einen Plan, wie man sich hinlegt? Wow. Niemand"}, {"id": 420, "start": 4581.24, "end": 4587.88, "text": "einen Plan, wie man sich hinlegt? Z? Nee, Y ist es nicht. Alter, Z. Wer ist denn auf"}, {"id": 421, "start": 4587.88, "end": 4611.0, "text": "diese glorreiche Idee gekommen? Z. Ranker Z. Jetzt kommt was von hinten, pass mal auf."}, {"id": 422, "start": 4611.0, "end": 4618.08, "text": "Ich hör die über uns rennen, wir müssen jetzt tactical sprint, please, funktioniert"}, {"id": 423, "start": 4618.08, "end": 4621.64, "text": "doch einfach. Jetzt hört er nicht mehr mal auf zu tactical sprinten, obwohl er aufhören"}, {"id": 424, "start": 4621.64, "end": 4648.04, "text": "soll. Sag ich doch, dass ich was über mir flitzen hab hören. Nice Flitzer. Nice Flitzer."}, {"id": 425, "start": 4648.04, "end": 4661.4, "text": "Da kommt doch was unten, oder? Moment mal, da kommt doch was. Auf dem Radar ist genau"}, {"id": 426, "start": 4661.4, "end": 4672.8, "text": "hier jemand. Seht ihr das? Genau hier ist jemand auf dem Radar. Hier. Genau hier. Invisible"}, {"id": 427, "start": 4672.8, "end": 4684.0, "text": "cheat. Leute, ich würde ja mal gerne einen Airstrike holen, wofür brauchen wir den Airstrike?"}, {"id": 428, "start": 4684.0, "end": 4688.32, "text": "Ich hol mal einen Airstrike. Wo könnte man einen guten Airstrike hinklatschen jetzt?"}, {"id": 429, "start": 4688.32, "end": 4702.16, "text": "C2, äh C1, C1, perfekt. Oh, Predator. Da ist die Moab. Bäm. Haben wir was gekillt?"}, {"id": 430, "start": 4702.16, "end": 4717.88, "text": "Es gab auf jeden Fall einen Hitmarker. Oder da fährt was. Oh. Au. Was haut er mir einfach"}, {"id": 431, "start": 4717.88, "end": 4729.2, "text": "über den Kopf? Oder was auch immer das gewesen sein soll, ich weiß es nicht. Delta Modus"}, {"id": 432, "start": 4729.2, "end": 4733.08, "text": "aktiviert. Da vorne ist ja auf jeden Fall was. Da hab ich gerade meinen Airstrike drauf"}, {"id": 433, "start": 4733.08, "end": 4754.24, "text": "gejagt. Oh, wir haben wieder die nice Drohne. Bäm. Hallo? Rundstells. Bäm. Ich stehe halt"}, {"id": 434, "start": 4754.24, "end": 4764.28, "text": "mitten, mitten auf der, auf der Map, ne? Das ist ziemlich dumm. Nimmt? Captured der?"}, {"id": 435, "start": 4764.28, "end": 4789.6, "text": "Ne, der captured nicht. Au. Ach da. Äh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh."}, {"id": 436, "start": 4789.6, "end": 4818.16, "text": "Oh. Ha. Drohnenstells. Äh. Ach, Reloading. Au. Oh. Oh. Oh. Nice. Oh. Oh. Oh. Oh. Oh."}, {"id": 437, "start": 4818.16, "end": 4829.68, "text": "Nice. Easy. Alter, wir haben richtig geowned. Ich glaub die Drohne ist OP. Guckt euch das"}, {"id": 438, "start": 4829.68, "end": 4845.92, "text": "mal an. Die hält mehrere Panzer, Panzerfaustreffer aus. Und die two-hitted die Gegner. Sieht"}, {"id": 439, "start": 4845.92, "end": 4854.56, "text": "man was? Ich hab Scoreboard, your squad best Scoreboard. Alter, 28. Richtig gut hier."}, {"id": 440, "start": 4854.56, "end": 4868.2, "text": "Pock. Wie von Zulu. Zulul ist ja Band Emote hier. Aber das ist, ähm, gar nicht mal so"}, {"id": 441, "start": 4868.2, "end": 4879.96, "text": "schlecht. Gar nicht mal so übel, muss ich sagen. Level 4. Aber an die Movement müssen"}, {"id": 442, "start": 4879.96, "end": 4889.0, "text": "sie auch. Oh, Schneiber. X6 HD am Stahl. Aber an der, also an die Movement müssen sie"}, {"id": 443, "start": 4889.0, "end": 4899.64, "text": "auf jeden Fall irgendwas machen. Oh, guck mal, jetzt kriegen wir Griffs. Und aus irgendwelchen"}, {"id": 444, "start": 4899.64, "end": 4911.6, "text": "Gründen Mini Tactical Laser. Customize. Equipment. Assault. Also Customization. Also das Holosight"}, {"id": 445, "start": 4911.6, "end": 4923.44, "text": "haben wir am Stand. Was haben wir gerade Unlocked? Hier. ADS Time. Nee. Recoil. Nee, der Recoil"}, {"id": 446, "start": 4923.44, "end": 4929.16, "text": "ist easy as fuck zu handeln. Das ist kein Problem. Der Spread und das Rumgewackele ist"}, {"id": 447, "start": 4929.16, "end": 4937.04, "text": "eher problematisch. Underbarrel haben wir Unlocked. Classic. Okay. Darf man nicht."}, {"id": 448, "start": 4937.04, "end": 4941.76, "text": "Gibt's den Halo Multiplayer eigentlich auch kostenlaufender Konsole? Ja. Moin, erstmal"}, {"id": 449, "start": 4941.76, "end": 4946.24, "text": "danke für das Dislaken. Wie ist das, WW3? Kann man als Battle, nee, Battlefield Ersatz"}, {"id": 450, "start": 4946.24, "end": 4950.0, "text": "ist es definitiv nicht. Ich denke, das kann man so viel kann ich jetzt schon sagen. Es"}, {"id": 451, "start": 4950.0, "end": 4954.84, "text": "ist eher so eine Richtung Rainbow Six Stels mit ein bisschen Battlefield. Es gibt Panzer."}, {"id": 452, "start": 4954.84, "end": 4958.88, "text": "Guck mal, wir können uns da reinsetzen jetzt. Wir fahren jetzt mal. Nee, ich darf nicht."}, {"id": 453, "start": 4958.88, "end": 4968.48, "text": "Ach so, weil Warm Up ist. Also wenn sie das, also die Maps und so, das erinnert mich tatsächlich"}, {"id": 454, "start": 4968.48, "end": 4974.28, "text": "ein bisschen an Zen Crossing, findet ihr nicht auch? Das hat ein bisschen was von Zen Crossing."}, {"id": 455, "start": 4974.28, "end": 4979.16, "text": "Es sieht halt, die Maps sehen halt komplett leblos aus. Muss man jetzt halt auch mal sagen."}, {"id": 456, "start": 4979.16, "end": 4989.6, "text": "Das hat Battlefield 3 schon besser hingekriegt. Das Sound Kulisse ist, also die Waffensounds"}, {"id": 457, "start": 4989.6, "end": 4997.04, "text": "und das Teufel finde ich okay. Aber das Movement müssen sie hinkriegen. Ich sage euch, wenn"}, {"id": 458, "start": 4997.04, "end": 5003.84, "text": "die das Movement hinkriegen, dann kann ich mir das durchaus für Leute vorstellen, die"}, {"id": 459, "start": 5003.84, "end": 5010.2, "text": "ein bisschen taktischeres Battlefield wollen oder die taktischen Modern Military Shooter"}, {"id": 460, "start": 5010.2, "end": 5023.36, "text": "wollen mit ein bisschen Battlefield-Einschlag. Kann ich mir schon vorstellen. Wo sind denn"}, {"id": 461, "start": 5023.36, "end": 5029.96, "text": "die Gegner? Die sind bestimmt da hinten irgendwo. Die Maps sind auch bei weitem nicht so groß"}, {"id": 462, "start": 5029.96, "end": 5037.64, "text": "wie es beispielsweise eine Battlefield 2042 Map ist, aber sie sind halt eben relativ verwinkelt."}, {"id": 463, "start": 5037.64, "end": 5045.08, "text": "Ich meine, das hier könnte legit irgendwie so in irgendeinem Industriegebiet Berlin sein."}, {"id": 464, "start": 5045.08, "end": 5050.76, "text": "Klar, mich würde es sogar nicht wundern, wenn die sich nicht da irgendwo hätten inspirieren"}, {"id": 465, "start": 5050.76, "end": 5066.84, "text": "lassen. He, he, he. Lull. Er ist Tactical Sprinter. Oh, wisst ihr? Guck mal, ich habe"}, {"id": 466, "start": 5066.84, "end": 5070.4, "text": "ihm mit dem Helm runter. Habt ihr gesehen? Ich habe ihm mit dem Helm runter geschossen,"}, {"id": 467, "start": 5070.4, "end": 5077.2, "text": "dem anderen. Bin gerade an der Agentur für Arbeit vorbeigelaufen. Ja, wahrscheinlich."}, {"id": 468, "start": 5077.2, "end": 5087.8, "text": "Real, Real Life. Real Life Schauplatz. Wahrscheinlich wohnen die Leute hier. Hier sind agile Start-ups."}, {"id": 469, "start": 5087.8, "end": 5101.2, "text": "Ja. Richtig agil. Sieht man hier schon. Was bitte? Ali hit? Angeblich habe ich gerade"}, {"id": 470, "start": 5101.2, "end": 5111.24, "text": "ein Team-Mate gehittert, den ich oben ans Fenster geschossen habe. Oh, oh, oh, Team-Kill."}, {"id": 471, "start": 5111.24, "end": 5120.48, "text": "Weiß gar nicht, ob ich im Panzer Team Roadkills machen kann. Bäume umfahren und so geht glaube"}, {"id": 472, "start": 5120.48, "end": 5125.28, "text": "ich nicht. Also die Maps scheinen mir relativ statisch zu sein. Man kann aber, das habe"}, {"id": 473, "start": 5125.28, "end": 5131.16, "text": "ich schon, man kann durch Regale und so durchschießen. Also man kann durch dünne Wände"}, {"id": 474, "start": 5131.16, "end": 5155.72, "text": "kommen man durch. Da hinten sind Gegner. Das ist nicht sicher. Guck mal, noch ein Panzer."}, {"id": 475, "start": 5155.72, "end": 5169.44, "text": "Okay, kaputt machen. Ah doch, Bäume umfahren kann man tatsächlich. Panzmann 2.0, wo sind"}, {"id": 476, "start": 5169.44, "end": 5181.56, "text": "wir? Hier sind auf jeden Fall keine Gegner. Okay, Schussgefühl der Dinger ist Pains Champ."}, {"id": 477, "start": 5181.56, "end": 5197.2, "text": "Ein extrem Pains Champ. Trefferzonen gibt es eigentlich auch keine. Und ich kriegt den"}, {"id": 478, "start": 5197.2, "end": 5207.44, "text": "Kill geklaut. Nice, GG Eats. Also Trefferfeedback Fahrzeuge ist mies. Ja, wir kommen aneinander"}, {"id": 479, "start": 5207.44, "end": 5225.56, "text": "vorbei, nice. Oh, au, mein Ohr. Okay, das fliegt ja das Gehör weg mit. Mag es vielleicht"}, {"id": 480, "start": 5225.56, "end": 5229.32, "text": "realistisch sein, aber es gibt so Realismus Sachen, die müssen in Spielen nicht sein."}, {"id": 481, "start": 5229.32, "end": 5240.44, "text": "Guck mal, hier wird gecaptchert, hier wird gecaptchert. Die werden jetzt gebasht. Die"}, {"id": 482, "start": 5240.44, "end": 5249.24, "text": "liegen bestimmt hier in der Mitte irgendwo rum. Garantiert, hier irgendwo. Da ist er."}, {"id": 483, "start": 5249.24, "end": 5267.28, "text": "Okay, er ist down. Da hinten ist wieder was. Wenn ihr einfach mal mein Bahnkreuz funktionieren"}, {"id": 484, "start": 5267.28, "end": 5282.0, "text": "würde. Alter, das ist doch nicht euer Ernst, oder? Das hört sich an, als knallt der Opa"}, {"id": 485, "start": 5282.0, "end": 5290.16, "text": "die Garage zu. Der Opa knallt das Garagentor zu, so hört sich das an. Aber nicht nach"}, {"id": 486, "start": 5290.16, "end": 5301.76, "text": "dem Panzer. Aber anscheinend haben die RPGs auch ordentliche Time to kill, also du brauchst"}, {"id": 487, "start": 5301.76, "end": 5324.12, "text": "nicht drei Stunden die zu killen. Okay, pass auf, wir probieren mal was, wir probieren"}, {"id": 488, "start": 5324.12, "end": 5333.16, "text": "durchzukommen. Lass mich in Ruhe. Wir haben weggestellt. So, Minipack aufnehmen. Ich finde,"}, {"id": 489, "start": 5333.16, "end": 5345.16, "text": "das Healen dauert einen Ticken lang. Oh, hinter mir, hinter mir. Alter, kletter doch."}, {"id": 490, "start": 5345.16, "end": 5362.0, "text": "Ist der down? War der down? Oh, Tactical Sprint, man, funktioniert doch einfach. Muss mich"}, {"id": 491, "start": 5362.0, "end": 5381.56, "text": "verpissen. Weil auf der anderen Seite sind sie ja auch. Oh, was ein Gewackel. Hier sind"}, {"id": 492, "start": 5381.56, "end": 5395.16, "text": "bestimmt noch mehr, hier sind bestimmt noch mehr. Lass es mal meine Tuts machen. Oh, der"}, {"id": 493, "start": 5395.16, "end": 5414.76, "text": "kotzt Leute, der kotzt ab, ich sag's euch. Der kotzt richtig ab. Alter, die kotzen richtig"}, {"id": 494, "start": 5414.76, "end": 5422.76, "text": "ab. Oh, meine Schüsse sind gleich leer. Pass auf, Poggas, Poggas Schutz jetzt gleich."}, {"id": 495, "start": 5422.76, "end": 5433.6, "text": "Oh, die Pistole hat Travel Time. Das ist dumm. Nee, Pistolen kannst du vergessen. Also Pistolen"}, {"id": 496, "start": 5433.6, "end": 5442.24, "text": "Nahkampf, no pass, no pass, aber ganz großes no pass. Hackert, ich bin gehackermant. Kann"}, {"id": 497, "start": 5442.24, "end": 5451.24, "text": "man das aufheben? Ah, der ist despawned, der da. Was muss ich drücken? F? Okay, Pog."}, {"id": 498, "start": 5451.24, "end": 5471.88, "text": "Okay, ich renn jetzt, ich renn jetzt hier rein, weil ich hab. Nein. Oh Gott, Leute."}, {"id": 499, "start": 5471.88, "end": 5491.32, "text": "Richtige Noobies. Als wär ich jetzt hier der richtige Hardcore-Pro, ne? Achtung, Big"}, {"id": 500, "start": 5491.32, "end": 5507.44, "text": "Brain Time. Big Brain Flank. Wenn Tactical Sprint gehen würde, Mann. Äh, wo, wo, wo"}, {"id": 501, "start": 5507.44, "end": 5527.36, "text": "exactly ist hier was? Oh, wie der hackermant. Wie, ich hab nix gekillt? Seriously? Alter,"}, {"id": 502, "start": 5527.36, "end": 5533.12, "text": "das verzieht ja mal richtig. Äh, ich guck mal, kann ich mich heilen? Ich vermute mal,"}, {"id": 503, "start": 5533.12, "end": 5551.08, "text": "ich hab mich gehalten. Oh, oh. Wo, wo? Da, nice. Da is er down. Okay, nix wie um die"}, {"id": 504, "start": 5551.08, "end": 5560.48, "text": "Eck, um die Eck. Das ist ja voll intense hier. Ist ja richtig anstrengend. Da muss"}, {"id": 505, "start": 5560.48, "end": 5570.04, "text": "man ja richtig, muss man sich ja richtig Mühe geben. Passt es nicht. Guck mal, jetzt kommt"}, {"id": 506, "start": 5570.04, "end": 5573.8, "text": "wieder von der anderen Seite was. Ich bin mir noch nicht ganz sicher, wann die gemarkt"}, {"id": 507, "start": 5573.8, "end": 5581.2, "text": "werden. Das hab ich noch nicht gecheckt. Hier ist doch einer. Guck mal, genau hier ist wieder"}, {"id": 508, "start": 5581.2, "end": 5589.4, "text": "einer. Oder ist der rote Punkt auf dem Radar etwa kein Gegner? Ich glaube fast die roten"}, {"id": 509, "start": 5589.4, "end": 5602.52, "text": "Punkte sind keine Gegner. Sind keine Gegner. Die sind was anderes. Was auch immer. Nur"}, {"id": 510, "start": 5602.52, "end": 5609.24, "text": "keine Gegner. Achtung, Heel stellst. Das mag ich. Der Heel könnte ein bisschen schneller"}, {"id": 511, "start": 5609.24, "end": 5612.2, "text": "sein. Also das ist sehr langsam. Vor allem, weil du da drauf, weil du da runter gucken"}, {"id": 512, "start": 5612.2, "end": 5617.0, "text": "musst. Und wenn du runter guckst, kannst du nicht, kriegst ja von der Umgebung nix mit."}, {"id": 513, "start": 5617.0, "end": 5621.2, "text": "Jaja, stellts weiter. Aber wir können die Big Brain Drohne losfahren lassen gleich."}, {"id": 514, "start": 5621.2, "end": 5629.2, "text": "Okay, hier rüber. Hier drüben sind sie. Ich lasse gleich die Drohne losfahren, wenn"}, {"id": 515, "start": 5629.2, "end": 5653.24, "text": "ich weiß, wo die Gegner sind. Wow. Monarch. S. Ach guck mal, ich kann mir selbst Muni"}, {"id": 516, "start": 5653.24, "end": 5661.36, "text": "geben. Ach nee, N ist der Feuermodus. Da kommt jetzt die Drohne. Achtung, Drohnen stellts."}, {"id": 517, "start": 5661.36, "end": 5676.32, "text": "Acht. Drohnen stellts. Drohnen stellts. Gib ihm. Huge Drohnen stellts. Die Steuerung ist halt"}, {"id": 518, "start": 5676.32, "end": 5696.92, "text": "wirklich pain, pain. Richtig pain. Wo ist die geile Drohne? Oh, sehr gut, sehr guter"}, {"id": 519, "start": 5696.92, "end": 5707.24, "text": "Winkel. Sehr guter Winkel. Schreckt. Schreckt. Die Drohne, man. Die Drohne ist so geil. Die"}, {"id": 520, "start": 5707.24, "end": 5715.8, "text": "macht brutals Damage. Als sagen wir uns, die Steuerung ist ein bisschen gewöhnungsbedürftig."}, {"id": 521, "start": 5715.8, "end": 5740.84, "text": "Wo sind sie? Wo sind sie? Achtung, die Drohne kommt. Massive. Mini Panzer. Die Steuerung"}, {"id": 522, "start": 5740.84, "end": 5749.48, "text": "ist wirklich äußerst gewöhnungsbedürftig. Aber seht ihr, die hat einen richtigen Spoiler"}, {"id": 523, "start": 5749.48, "end": 5756.6, "text": "hinten drauf, die Drohne. Oh, ich bin down. Nee, nee, nee, ich lebe noch. Da steht er."}, {"id": 524, "start": 5756.6, "end": 5766.6, "text": "Oh, ich muss weg. Gegen den Panzer kann ich wahrscheinlich nichts machen. Halbes Hovercraft,"}, {"id": 525, "start": 5766.6, "end": 5778.12, "text": "au. Nein, nein, nein, nein. Der schießt, der macht mich blatt, der Typ jetzt. Ich stehe"}, {"id": 526, "start": 5778.12, "end": 5793.56, "text": "da mitten im Tor. Oh Gott, oh fuck. Ein bisschen mehr Zerstörung wäre schon cool. Ein bisschen"}, {"id": 527, "start": 5793.56, "end": 5807.48, "text": "mehr Zeit. Oh, hallo, hallo. Hallo. Nein. Ich lebe noch. Das ist doch schon sehr behelfsmäßig,"}, {"id": 528, "start": 5807.48, "end": 5813.72, "text": "die Drohnensteuerung gerade. Okay, wir gehen mal oben ans Fenster, falls es hier ein Fenster"}, {"id": 529, "start": 5813.72, "end": 5827.56, "text": "gibt. Der Dude. Oh, genau zur richtigen Zeit hier. Ach, der hat auch keine Muni mehr. Shit."}, {"id": 530, "start": 5827.56, "end": 5837.4, "text": "Okay, nice. Wir haben jetzt ein. Wie war das? One shot, one opportunity. Grinch. Wer haben"}, {"id": 531, "start": 5837.4, "end": 5849.12, "text": "wir nicht? Hat der hier was dabei? Oh, es piepst im Kopfhörer. Oh, macht das so gut"}, {"id": 532, "start": 5849.12, "end": 5855.36, "text": "wie kein Splash Damage. Jetzt habe ich gar nichts mehr. Ja, das ist schön, wenn ihr"}, {"id": 533, "start": 5855.36, "end": 5861.36, "text": "alle Medics seid. Jetzt habe ich gar nichts mehr. Ich kann keinen Gegner killen. Hat"}, {"id": 534, "start": 5861.36, "end": 5867.8, "text": "der hier was dabei? Irgendwas? Haben wir ein Mehle? Messer? Irgendwas? Irgendwas? Was"}, {"id": 535, "start": 5867.8, "end": 5873.6, "text": "ist Nahkampf? V? V, V. Okay, V ist Pains Champion. Wie soll ich den mit V ein killen?"}, {"id": 536, "start": 5873.6, "end": 5890.08, "text": "Hier, da, da, da, da. Geh weg, geh weg. Okay, perfekt. Eats. Jetzt haben wir wieder was."}, {"id": 537, "start": 5890.08, "end": 5902.88, "text": "Z dort auf BG. Warum nicht? Warum nicht? Okay, wo geht's hier? Wo ist jetzt hier? Sekunde,"}, {"id": 538, "start": 5902.88, "end": 5909.32, "text": "wir schauen mal Map. Was ist hinlegen? Z. Map. Kann man Marker setzen auf der? Nein."}, {"id": 539, "start": 5909.32, "end": 5923.6, "text": "Da unten sind sie. Und hopp. Oh, oh. Oh, KS, Alter. Wie findest du das Spiel? Das macht"}, {"id": 540, "start": 5923.6, "end": 5930.92, "text": "erstaunlich viel Bock. Ihr 14 Kills die Runde schon. Alles wegen Drohnenstells. Das macht"}, {"id": 541, "start": 5930.92, "end": 5936.24, "text": "erstaunlich viel Bock, aber ein Problem gibt es und das ist für mich so gravierend, dass"}, {"id": 542, "start": 5936.24, "end": 5941.84, "text": "ich, nee, dass ich eigentlich fast keinen Bock hab, dass langfristig jetzt zumindest"}, {"id": 543, "start": 5941.84, "end": 5948.44, "text": "die Beta zu spielen. Die Steuerung ist wirklich sehr, sehr verkackt. Also, der Sprinter nicht"}, {"id": 544, "start": 5948.44, "end": 5957.64, "text": "richtig funktioniert teilweise. Das Hängenbleiben, das Rumgewackel, das Sliden und nicht richtig"}, {"id": 545, "start": 5957.64, "end": 5963.32, "text": "aufstehen und, also, das fühlt sich nicht nach Gewicht an, das fühlt sich einfach"}, {"id": 546, "start": 5963.32, "end": 5974.16, "text": "nach unfertig an. Aber okay, das ist ja auch eine Beta, das ist alles in Ordnung. War da"}, {"id": 547, "start": 5974.16, "end": 5993.52, "text": "was gerade? Okay. Den Kopf. Moment. Zack, ist der nicht gestorben gerade?"}, {"id": 548, "start": 5993.52, "end": 6017.12, "text": "Ich glaube, der ist dead. Deadge. Hört euch mal den Radio an. Ich will Radio hören. Wolfburg,"}, {"id": 549, "start": 6017.12, "end": 6023.36, "text": "Stuttgart, Ingolstadt und München, habt ihr das gehört?"}, {"id": 550, "start": 6023.36, "end": 6028.32, "text": "Bayern ist fast vollständig von feindlichen Truppen eingenommen. Bayern ist fast vollständig"}, {"id": 551, "start": 6028.32, "end": 6033.92, "text": "von feindlichen Truppen eingenommen. Bayern ist fast vollständig von feindlichen Truppen"}, {"id": 552, "start": 6033.92, "end": 6050.56, "text": "eingenommen. Truppen eingenommen. Oh. Maintenance 10 minutes. Oh, okay. But good job on the Beta"}, {"id": 553, "start": 6050.56, "end": 6059.04, "text": "so far. Muss man mal ein bisschen nett sein. Move and Patch kommt. Wir passen auf, wahrscheinlich"}, {"id": 554, "start": 6059.04, "end": 6071.08, "text": "Move and Patch. Auf geht's. Move. So, wind is quick. Ja, das machen wir. Wir winnen"}, {"id": 555, "start": 6071.08, "end": 6076.68, "text": "das jetzt mega quick. Wo sehe ich überhaupt die Anzeige? Wann ist denn voll? Ist bei"}, {"id": 556, "start": 6076.68, "end": 6096.92, "text": "1000 Schluss? Okay. Oh, guck mal. Blank, Leute. Blank action. The biggest flank of all time."}, {"id": 557, "start": 6096.92, "end": 6101.64, "text": "Den Heli brauche ich auch. Nee, nee, nee. Moment, Moment. Viel besser. Viel besser,"}, {"id": 558, "start": 6101.64, "end": 6124.92, "text": "viel besser. Viel besser. The Pantsman kommt wieder. The Pantsman. Auf geht's. Oh. Okay."}, {"id": 559, "start": 6124.92, "end": 6130.8, "text": "Das ist natürlich dumm, wenn da einfach so ein fetter Panzer vor mir steht. The Pantsman"}, {"id": 560, "start": 6130.8, "end": 6135.2, "text": "hat mich richtig weggehauen, ja. Den kann man nicht, den Panzer kann man nicht spawnen."}, {"id": 561, "start": 6135.2, "end": 6139.44, "text": "Aber wir gewinnen, wir gewinnen. Guck mal. Ich glaube 4500 muss man, muss man haben."}, {"id": 562, "start": 6139.44, "end": 6151.64, "text": "Das ist ein Gegnerpanzer, Mann. Gehst da weg. Wenn die Maintenance haben, dann können wir"}, {"id": 563, "start": 6151.64, "end": 6170.08, "text": "uns den neuen Battlefield Patch angucken gleich. Slider end. Okay, keine Ahnung. Ich habe"}, {"id": 564, "start": 6170.08, "end": 6182.52, "text": "einfach mal, ich habe einfach mal in die Richtung gehalten. Oh ja, krass, krasser Beat hier."}, {"id": 565, "start": 6182.52, "end": 6204.96, "text": "Catch him. Ich habe eine 1080 Ti. Oh, oh. Was ist der Panzer da? Oh. Alter. Was?"}, {"id": 566, "start": 6204.96, "end": 6228.28, "text": "Paweczka. Paweczka. Oh ne. Der nächste Pantsman am Start."}, {"id": 567, "start": 6228.28, "end": 6254.08, "text": "Ich hoffe, der hat mich nicht gesehen. Oh. Wo? Wo ist der hin? Okay, ich habe Schiss,"}, {"id": 568, "start": 6254.08, "end": 6270.84, "text": "die Street zu crossen, Leute. Doch, auf geht's. Tactical Sprint. Was, wir haben verloren?"}, {"id": 569, "start": 6270.84, "end": 6299.24, "text": "Oh ne, loss. Ich camp mich mal kurz in die Ecke. Das ist dumm, dass man runtergucken"}, {"id": 570, "start": 6299.24, "end": 6327.76, "text": "muss. Oh, oh. Ich habe es gleich gecaptured. Oh, oh. Mann, Alter. Oh, oh. Oh, oh, oh."}, {"id": 571, "start": 6327.76, "end": 6336.6, "text": "Alter. Alter, machen die einen Krach. Okay, wir haben es jetzt. Können sie nicht mal"}, {"id": 572, "start": 6336.6, "end": 6352.92, "text": "spawnen. 5.000 haben wir gewonnen. Okay, 5k haben wir gleich. Oh, nichts wie weg. Move,"}, {"id": 573, "start": 6352.92, "end": 6359.76, "text": "Alter. Tactical Sprint. Der Tactical Sprint ist halt überhaupt nicht tactical, da funktioniert"}, {"id": 574, "start": 6359.76, "end": 6382.36, "text": "die Hälfte der Zeit nicht. Okay. Okay, Pantsman am Start. Pantsman am Start. Jawoll."}, {"id": 575, "start": 6382.36, "end": 6403.72, "text": "Pantsman in the ass, ass shooted. Die Steuerung von dieser Drohne ist wirklich krass. Ich."}, {"id": 576, "start": 6403.72, "end": 6419.56, "text": "Die Drohne ist so geil, Mann. Das ist so heftig OP, das Ding. Victory, easy, easy win. Dazu"}, {"id": 577, "start": 6419.56, "end": 6426.12, "text": "kann ich nur sagen. Nee, du musst Veteran sein, das heißt, das Spiel vor 2 Jahren auf"}, {"id": 578, "start": 6426.12, "end": 6431.16, "text": "Steam gekauft haben oder du kaufst dir für 13€ den Beta Access, wobei ich warten würde."}, {"id": 579, "start": 6431.16, "end": 6441.8, "text": "Ich würde wirklich abwarten. Wenn du das Spiel damals gekauft hast, Scoreboard. Guck"}, {"id": 580, "start": 6441.8, "end": 6447.24, "text": "mal, es gibt ein richtiges Scoreboard. Wie ist das eigentlich möglich? Wo haben die"}, {"id": 581, "start": 6447.24, "end": 6455.28, "text": "diese Technologie her? Wo gibt es die Technologie für Scoreboards? Also ich meine sicher, wenn"}, {"id": 582, "start": 6455.28, "end": 6460.16, "text": "das so einfach wäre, hätte so ein großes Studio mit so einem riesen Publisher dahinter"}, {"id": 583, "start": 6460.16, "end": 6466.16, "text": "wie DICE das auch gekonnt. Also das ist ja, das glaube ich, das ist absolut neueste Bleeding"}, {"id": 584, "start": 6466.16, "end": 6472.24, "text": "Edge Technologie. Die Zukunft ist da, ja. Es ist ja 2042 hat man das halt nicht mehr."}, {"id": 585, "start": 6472.24, "end": 6481.08, "text": "Okay, die haben Maintenance. Wann haben sie Maintenance, sagen sie? 90 Minuten? Was haben"}, {"id": 586, "start": 6481.08, "end": 6493.6, "text": "sie geschrieben? Ah, in 10 Minuten, 90 Minuten wäre Maintenance, okay. Ja gut, dann gehen"}, {"id": 587, "start": 6493.6, "end": 6501.4, "text": "wir mal raus und warten mal bis die Maintenance vorbei ist und gucken uns mal eine Runde Battlefield"}, {"id": 588, "start": 6501.4, "end": 6514.56, "text": "an. Ich muss das Game umstellen, wie der neue Patch ist. Battlefield 2042, fertig. Bam."}, {"id": 589, "start": 6514.56, "end": 6522.28, "text": "Also, kurz ein bisschen gedudel an. Nein, nein, nein, bestimmt nicht den Battlefield"}, {"id": 590, "start": 6522.28, "end": 6530.24, "text": "Soundtrack. Viel besser. Weniger Hovercraft, okay also Patch, Battlefield Patch. Bevor"}, {"id": 591, "start": 6530.24, "end": 6533.64, "text": "wir anfangen, hier, Battlefield Patch 2. Wir gucken mal schnell rein, was sich geändert"}, {"id": 592, "start": 6533.64, "end": 6543.48, "text": "hat. Also, Hovercraft, Little Bird, Dings wurden adjusted. PPGar29 mehr Recoil, das"}, {"id": 593, "start": 6543.48, "end": 6548.36, "text": "probieren wir gleich mal aus, ob die immer, weil ich mein, wenn sie der PP29 einfach"}, {"id": 594, "start": 6548.36, "end": 6554.28, "text": "nur mehr so vertikalen Recoil gegeben haben, dann ist das überhaupt kein Ding. Dann kannst"}, {"id": 595, "start": 6554.28, "end": 6561.08, "text": "du einfach runterziehen. Okay, Bullet Spread Reduced, wir probieren jetzt gleich mal, wir"}, {"id": 596, "start": 6561.08, "end": 6574.28, "text": "probieren jetzt gleich mal Assault Rifles aus. PP29, Little Bird, Super Hockum, Overall"}, {"id": 597, "start": 6574.28, "end": 6583.28, "text": "Minigun Land Vehicles, UAV in Bad Company ist wieder am Start. Breakthrough, haben sie"}, {"id": 598, "start": 6583.28, "end": 6590.44, "text": "was an Breakthrough, haben sie was an den Blacks gemacht? Nee, das heißt Breakthrough"}, {"id": 599, "start": 6590.44, "end": 6600.36, "text": "ist immer noch nicht richtig spielbar. Na gut. Dann schauen wir uns das doch an. Abgeschlossen."}, {"id": 600, "start": 6600.36, "end": 6607.84, "text": "Park Download Manager, auf geht's. Gehen wir. Ich muss jetzt gleich das Game Capture umstellen,"}, {"id": 601, "start": 6607.84, "end": 6613.6, "text": "weil es immer, wobei Battlefield ging, Battlefield ging, im Battlefield hat ja nur im Menü geruckelt."}, {"id": 602, "start": 6613.6, "end": 6626.92, "text": "FeelsBadMan. Ich guck mal ein bisschen Chat, während das lädt. Wie gesagt Beta, man braucht"}, {"id": 603, "start": 6626.92, "end": 6637.56, "text": "hier, 1 for 3 Steam. Nein, Battlefield möchte jetzt in den Vordergrund gehen. On Steam hat"}, {"id": 604, "start": 6637.56, "end": 6651.56, "text": "man hier das Beta Pack für 13 Euro, wobei ganz ehrlich, hat man dafür überhaupt, ja"}, {"id": 605, "start": 6651.56, "end": 6660.68, "text": "das sind irgendwelche Skins, braucht kein Mensch. Also, dass es ruckelt im Menü ist"}, {"id": 606, "start": 6660.68, "end": 6669.76, "text": "normal. Auf geht's, Play. Dann spielen wir vielleicht gleich noch ein paar Runden. World"}, {"id": 607, "start": 6669.76, "end": 6679.8, "text": "War 3. An den Flaggen, ob die an Breakthrough was an den Flaggen gemacht haben. Weil Orbital"}, {"id": 608, "start": 6679.8, "end": 6684.72, "text": "war kacke, Kaleidoskop war kacke, Hourglass war kacke. Ach Leute, die Subz habe ich ja"}, {"id": 609, "start": 6684.72, "end": 6691.12, "text": "komplett übersehen. Ja, ihr habt ja recht. Moment, Moment, Moment. Danke für die Subz,"}, {"id": 610, "start": 6691.12, "end": 6704.84, "text": "wen haben wir hier am Start? Subze. Kaijit1. Gerhenrik. Pog. Sandpp. DavidsuStyle. Der"}, {"id": 611, "start": 6704.84, "end": 6715.16, "text": "Taser hat verlängert. Aja ja, aber richtig hier. Ne, das war's. Und irgendwer hat gestern"}, {"id": 612, "start": 6715.16, "end": 6722.88, "text": "gegiftet? Anygifters? 500 Bits, ja, hab ich nicht gesehen. Gönn euch Subz. Dankeschön,"}, {"id": 613, "start": 6722.88, "end": 6728.72, "text": "wer hat denn hier gedodged? Alle erfolgreich gedodged, Leute hier. Außer JustSky, Ryukenshin,"}, {"id": 614, "start": 6728.72, "end": 6741.48, "text": "Sandwich, Adonis, Adipo, Adipös. Also der quasi Pepofet Adonis. Defi und xPubot. Auf"}, {"id": 615, "start": 6741.48, "end": 6748.48, "text": "geht's. Leute, das hat bis jetzt, iiih, mp9. Ok, mp9 ist ziemlich das dümmste, was du hier"}, {"id": 616, "start": 6748.48, "end": 6756.48, "text": "spiele kannst, Ridiploi. Das hat so lange geladen, das Game. Bis jetzt, bis jetzt hat"}, {"id": 617, "start": 6756.48, "end": 6762.36, "text": "es geladen. Ok, pp29, wir müssen es jetzt ausprobieren, Leute. Pip, lass mich please"}, {"id": 618, "start": 6762.36, "end": 6787.0, "text": "hier spawnen. Sack, Sack, Sack, Sack, Sack, Testen, Sound, Display. Ok, stimmt alles."}, {"id": 619, "start": 6787.0, "end": 6797.68, "text": "Was denn hier? Die Sense fühlt sich schepp an im Vergleich zu dem anderen. Ich liebe"}, {"id": 620, "start": 6797.68, "end": 6808.4, "text": "Battlefield 2042, who's? Wegschneibert. Mal gucken, ich bin mal gespannt, wie sich die"}, {"id": 621, "start": 6808.4, "end": 6815.6, "text": "pp29 spielt. Gut, gerätzt werden wir hier nicht. Wir switchen mal, wir switchen mal"}, {"id": 622, "start": 6815.6, "end": 6825.96, "text": "von der Ollen zu Crapling Man. Leute, ich hatte das Game übrigens zwischenzeitlich"}, {"id": 623, "start": 6825.96, "end": 6834.76, "text": "uninstalliert, ne? Ich hab nur für den Stream wieder installiert. Ich hab gedacht, komm,"}, {"id": 624, "start": 6834.76, "end": 6838.6, "text": "das können wir uns mal angucken. Oh, was ist denn da vorne los, man? Bisschen leise, oder?"}, {"id": 625, "start": 6838.6, "end": 6857.44, "text": "Bisschen leise. Mal nen Ticken lauter hier. Ja, so ist besser, ne? Alles klar. Ja, das"}, {"id": 626, "start": 6857.44, "end": 6862.24, "text": "Rätseln ist wirklich, äh, es ist rätselig keiner. Man selbst rätselt aber auch kaum."}, {"id": 627, "start": 6862.24, "end": 6868.4, "text": "Hier ist halt richtig klasse da. Warum spielen wir eigentlich gleich die schlechteste Map"}, {"id": 628, "start": 6868.4, "end": 6874.44, "text": "zu Release, äh, zu, wir haben die Beta gespielt, die haben grad Maintenance, ja? Die haben"}, {"id": 629, "start": 6874.44, "end": 6877.84, "text": "grad Maintenance, die haben sich sogar bei uns im Twitch Chat gemeldet und haben gesagt,"}, {"id": 630, "start": 6877.84, "end": 6888.24, "text": "sie haben gleich Maintenance. Das Spiel ist so abfackt, da ist einfach so, da ist so viel"}, {"id": 631, "start": 6888.24, "end": 6898.92, "text": "los, man. Gibt eh jeder Instant aus. Das hab ich schon gesehen in Patch 3. In Patch 3"}, {"id": 632, "start": 6898.92, "end": 6903.64, "text": "kommt angeblich eine Ent-, oh, na, Mist. Eine Entfernungsanzeige für Medics und die"}, {"id": 633, "start": 6903.64, "end": 6911.6, "text": "Medics können dich dann wohl angeblich auch pingen, dass du sagen kannst, ähm, ob sie"}, {"id": 634, "start": 6911.6, "end": 6920.0, "text": "dich wiederbeleben wollen oder nicht. Okay. Darf ich jetzt mal irgendwie einen Gegner head"}, {"id": 635, "start": 6920.0, "end": 6929.92, "text": "on sehen? Jetzt machen wir Big Brain Play, passt auf. Warum ist das Spiel eigentlich"}, {"id": 636, "start": 6929.92, "end": 6950.8, "text": "zu broken? Jaja. Pass mal auf, vielleicht gehts jetzt. Hovercraft am Start, nice. Gefixt"}, {"id": 637, "start": 6950.8, "end": 6966.6, "text": "ist, gefixt ist Hovercraft am Start. Ich schätze. Ist das Hovercraft wirklich gefixt, by the"}, {"id": 638, "start": 6966.6, "end": 6977.72, "text": "way? Die Sache ist, oh, nice. Die Sache ist die, wenn der PP29 nicht mehr spielen kann,"}, {"id": 639, "start": 6977.72, "end": 6987.04, "text": "was spielst du denn dann jetzt? Alter Mann, dieses Spiel, es ist, ich, es ist, ich war"}, {"id": 640, "start": 6987.04, "end": 6993.08, "text": "ganz normal drauf, als ich das andere gespielt hab, ne? Aber kaum ist Battlefield 2042 am"}, {"id": 641, "start": 6993.08, "end": 7001.64, "text": "Start, leg ich mich instant auf. Nee, MP9 auf die Range ist Müll. MP9 hat ausgewebt,"}, {"id": 642, "start": 7001.64, "end": 7004.4, "text": "dann machen wir es doch jetzt mal anders. Dann nehmen wir doch jetzt mal Assault Rifle,"}, {"id": 643, "start": 7004.4, "end": 7017.92, "text": "die hier angeblich dafür da sind, hier auf diese Range zu spielen. Sehr gut. Exzellent."}, {"id": 644, "start": 7017.92, "end": 7039.68, "text": "PoK, die hab, hab ich die schon? Hab ich die schon? Naja, gut, der Grappling bringt"}, {"id": 645, "start": 7039.68, "end": 7048.44, "text": "ja grad gar nix. Geh mal hier rein. Oh, jetzt können wir Fliegestell machen, Leute. Ich"}, {"id": 646, "start": 7048.44, "end": 7053.2, "text": "bin ein, wie hat letztens einer so schön gesagt, ich bin ein Ironsight-Enjoyer. Langer"}, {"id": 647, "start": 7053.2, "end": 7075.8, "text": "Saks, Rest passt. Wollte jetzt eigentlich runter, hinterfliegen. Wollte eigentlich hinterfliegen,"}, {"id": 648, "start": 7075.8, "end": 7086.08, "text": "aber ich, ich kann nicht abheben. Wir probieren mal, ob ich abheben kann. Okay, nop, nop, nop."}, {"id": 649, "start": 7086.08, "end": 7101.96, "text": "Gut, hier ist ja noch gar keiner. Oh, ein Rauf da. Ist Assassin's Creed kacke? Weiß"}, {"id": 650, "start": 7101.96, "end": 7111.32, "text": "ich nicht. Ja, weil Haller ist sackig. Ich mein, das ist einfach nur flach. Halo ist"}, {"id": 651, "start": 7111.32, "end": 7118.52, "text": "wirklich gerade am spaßigsten von FPS. Ja, ist wirklich so. Es ist einfach nur breite"}, {"id": 652, "start": 7118.52, "end": 7130.32, "text": "Frontline. Äh, äh, ich hab die gerade durch, durch, durch, durch Air, durch die Luft erschossen."}, {"id": 653, "start": 7130.32, "end": 7134.72, "text": "Also nicht durch die Luft, durch, durch, durch das Ding durch erschossen. Habt ihr's gesehen,"}, {"id": 654, "start": 7134.72, "end": 7149.2, "text": "die war eigentlich schon längst dahinter. GG Game. Ja, nice. Okay, irgendwie ist es"}, {"id": 655, "start": 7149.2, "end": 7162.08, "text": "auch noch nicht viel nicer, sind die Assault-Rifles auf Range-on geworden. Oh, oh, oh, oh, Monarch."}, {"id": 656, "start": 7162.08, "end": 7179.84, "text": "Alter, die Assault-Rifles. Mit der alten PP-Gard 920 hätte ich ja schon drei Gegner gekillt."}, {"id": 657, "start": 7179.84, "end": 7197.08, "text": "Okay, oh, oh. Okay, das war PP-Gard von mir, da kann die Waffe wirklich nix für. Oh,"}, {"id": 658, "start": 7197.08, "end": 7216.04, "text": "oh, oh. Nice. Äh, ich wollte eigentlich gerade die Scatternade schmeißen, aber ich hab den"}, {"id": 659, "start": 7216.04, "end": 7220.92, "text": "Knopf nicht gefunden. Die Sturmgewehre gehen voll fit, das werden wir jetzt sehen, das"}, {"id": 660, "start": 7220.92, "end": 7231.2, "text": "finden wir jetzt raus. Also mein Lieblings-Setup für die M5 ist ja das mit Schnellfeuer. Also"}, {"id": 661, "start": 7231.2, "end": 7254.56, "text": "im Prinzip das da, da, Game, das da, das Game. Ist das verbackt jetzt? Ne, das hat sich jetzt"}, {"id": 662, "start": 7254.56, "end": 7261.52, "text": "nicht so gelohnt. Okay, die müssen, die müssen ja hier irgendwo lang. Irgendwie da großartig"}, {"id": 663, "start": 7261.52, "end": 7265.6, "text": "rumstellen ist hier unten hat ja so keinen Sinn. Vielleicht kann ich irgendwo hinfliegen."}, {"id": 664, "start": 7265.6, "end": 7276.0, "text": "Irgendwo sinnvoll. Oh nein, nicht hängen bleiben. Hängen bleiben ist gleich dead. Okay, hoch"}, {"id": 665, "start": 7276.0, "end": 7290.2, "text": "kommt man hier nicht. Unka! Wieder einfach mal der Jet am Start ist. Oh, jetzt wird gepusht."}, {"id": 666, "start": 7290.2, "end": 7308.88, "text": "Puschke, Puschke. Puschke. Motion. Man ist halt dauergespotted auch in dem Game, ne. Da"}, {"id": 667, "start": 7308.88, "end": 7320.76, "text": "hätte ich weiter wegspringen müssen, ich dachte es läuft weiter. Oh, Poggers. Ich mag"}, {"id": 668, "start": 7320.76, "end": 7333.72, "text": "das Schnellfeuer Ding. Heil dich, heil dich. Knopf. Oh, da habe ich es ja von oben. Aber"}, {"id": 669, "start": 7333.72, "end": 7338.36, "text": "gut, was willst du machen? Also ich muss sagen, ich habe tatsächlich das Gefühl, die M5 ist"}, {"id": 670, "start": 7338.36, "end": 7346.24, "text": "ein bisschen genauer. Was richtig gut ist, weil die M5 mit Schnellfeuer macht auch richtig,"}, {"id": 671, "start": 7346.24, "end": 7363.12, "text": "richtig gut DPS. Wie kommen wir denn jetzt hier am besten rauf? Was zum? Ah, okay, der"}, {"id": 672, "start": 7363.12, "end": 7370.08, "text": "ist dead. Der ist ja dead schon. Hat man bloß nicht erkannt. Das Game hat sich gedacht,"}, {"id": 673, "start": 7370.08, "end": 7379.88, "text": "nope, das spawnen wir jetzt nicht oder das despawnen wir jetzt nicht. Ich will eigentlich"}, {"id": 674, "start": 7379.88, "end": 7401.24, "text": "auf der anderen Seite hoch, aber ich glaube, das funktioniert so nicht. Oh, ah. Okay, was?"}, {"id": 675, "start": 7401.24, "end": 7412.56, "text": "Ach ja, aber dicke Spot XP. Was ist das für eine ppega Map? Das ist die beste Map in Battlefield."}, {"id": 676, "start": 7412.56, "end": 7418.0, "text": "Nein, die sucked hardcore. So wie fast alle Maps, aber das ist mit Abstand die schlechteste."}, {"id": 677, "start": 7418.0, "end": 7429.88, "text": "Game please. Nein, okay. Pants man. Hallo. Und Tschüss. Halfway to victory, aber gleich"}, {"id": 678, "start": 7429.88, "end": 7440.04, "text": "ist die Base weg. Von wegen halfway to victory. Halfway to ppega eher. Was hintet mich denn"}, {"id": 679, "start": 7440.04, "end": 7453.52, "text": "von der Seite? Geh weg. Geh weg. Ich meine, mit der pp920 konnte ich den Typ wenigstens"}, {"id": 680, "start": 7453.52, "end": 7462.72, "text": "wegsprayen über die Distanz. Reds please. Reds please. Reds please. Ehrenmänner, Teammates."}, {"id": 681, "start": 7462.72, "end": 7477.96, "text": "Ehrenmänner, Ehrenerinnen und Ehrenfrauen hier. Please. Please. Battlefield 2042 in a nutshell."}, {"id": 682, "start": 7477.96, "end": 7489.52, "text": "Da machst du nix. Echt, das ist deine Lieblingsmap. Das kann ich nicht verstehen. Ich finde,"}, {"id": 683, "start": 7489.52, "end": 7504.12, "text": "die sucked einfach nur richtig krass. Oh hier, bashen, bashen, bashen. Ja klar. Na klar."}, {"id": 684, "start": 7504.12, "end": 7516.36, "text": "Weil das auf Range auch so easy ist zu treffen. Alter, please. Kill die halt mal einfach."}, {"id": 685, "start": 7516.36, "end": 7521.72, "text": "Geile Waffe. Weißt du, die haben sich gedacht, wir machen riesige Ranges hin, aber Waffen,"}, {"id": 686, "start": 7521.72, "end": 7527.44, "text": "die 5 Minuten brauchen Gegner über Ranges zu killen. Ich meine, ich spiele das Ding"}, {"id": 687, "start": 7527.44, "end": 7533.88, "text": "jetzt auch nicht in dem Setup wegen der Schussfrequenz. Hat sich was verbessert. Ich habe bis jetzt"}, {"id": 688, "start": 7533.88, "end": 7546.04, "text": "weniger Hovercrafts gesehen. Aber ansonsten, nee. Das ist einfach riesiges Terrain mit"}, {"id": 689, "start": 7546.04, "end": 7564.76, "text": "nix. Ja. Büt, büt. Vielleicht, ich droppe jetzt auch einen Ranger. Ja, bam, Ranger."}, {"id": 690, "start": 7564.76, "end": 7572.84, "text": "Ranger drop. Ich weiß gar nicht, woran die jetzt gestorben ist überhaupt. Guck mal an,"}, {"id": 691, "start": 7572.84, "end": 7594.2, "text": "was für riesen Fronten. Ok, da kommt ein Panzer. Da fliegt. Nice. Oh guck mal, ein Hovercraft."}, {"id": 692, "start": 7594.2, "end": 7602.76, "text": "Ich dachte, oh, oh, oh, oh, oh, oh, oh. Ok, vor dem Patch wären wir definitiv tot gewesen."}, {"id": 693, "start": 7602.76, "end": 7608.84, "text": "Vor dem Patch wären wir down gewesen. Das macht nicht mehr so viel krass Damage, oh,"}, {"id": 694, "start": 7608.84, "end": 7614.68, "text": "oh. Das macht, also der Heli macht nicht mehr so viel Splash Damage wie vorher. Ist das"}, {"id": 695, "start": 7614.68, "end": 7618.68, "text": "die Map mit den Pingui? Kann schon sein. Es ist auf jeden Fall die schlechteste Map im"}, {"id": 696, "start": 7618.68, "end": 7623.76, "text": "ganzen Game. Nicht, dass die anderen wahnsinnig gut wären, aber diese wirklich doppelt, doppelt"}, {"id": 697, "start": 7623.76, "end": 7633.64, "text": "und plus mies. Aha, ach nee, ich bin Spotter. Will kein Spotter sein."}, {"id": 698, "start": 7653.76, "end": 7663.4, "text": "Eigentlich macht es überhaupt keinen Sinn. Alles klar. GG Eats. Was, was Grinnt man in"}, {"id": 699, "start": 7663.4, "end": 7669.96, "text": "Halo eigentlich so den Season Pass? Ansonsten, ich spiele auch nicht ranked. Ich spiele auch"}, {"id": 700, "start": 7669.96, "end": 7676.48, "text": "bloß die ganz normale Playlist. Ok. Nice, wir fahren jetzt hier mit dem Typ."}, {"id": 701, "start": 7676.48, "end": 7688.8, "text": "Alter, beweg dich doch nicht so. Nicht so viel Moven. Nicht so viel Moven."}, {"id": 702, "start": 7706.48, "end": 7718.92, "text": "Ok, es macht, finde ich, ein bisschen weniger Damage, die Gatling Gun. Das sind keine Bots,"}, {"id": 703, "start": 7718.92, "end": 7723.36, "text": "nee, das sind Spieler. Ich finde, die macht ein bisschen weniger Damage als vorher. Oder"}, {"id": 704, "start": 7723.36, "end": 7729.52, "text": "die Spreader, die hatten mehr Spread oder so. Das kann auch sein. Würde gerne spawnen,"}, {"id": 705, "start": 7729.52, "end": 7741.2, "text": "wenn das erlaubt ist, wenn das irgendwie möglich ist. Danke schön. Alter, was kommt denn da"}, {"id": 706, "start": 7741.2, "end": 7763.64, "text": "für eine Lawine runter? Gachibass. Pass mal auf, kann man von hier starten? Vorgass."}, {"id": 707, "start": 7763.64, "end": 7770.36, "text": "Was ist World War 3? So eine Mischung aus Rainbow Six-Gestellte mit Battlefield-Einschlägen."}, {"id": 708, "start": 7770.36, "end": 7778.8, "text": "Wobei, es hat halt Movement aus der Hölle. Noch. Mal gucken, ob es besser wird. Ja, das"}, {"id": 709, "start": 7778.8, "end": 7784.4, "text": "hat nicht so gut funktioniert, wie ich mir das vorgestellt habe. Guck mal noch mal hier"}, {"id": 710, "start": 7784.4, "end": 7801.28, "text": "hin. War das nicht geplant? Ich merke das gleich, ich bin schon ein bisschen raus. Einfach"}, {"id": 711, "start": 7801.28, "end": 7806.08, "text": "weil ich jetzt ein paar Tage nicht gespielt habe. Aber ich vermisse es ehrlich gesagt"}, {"id": 712, "start": 7806.08, "end": 7818.88, "text": "auch nicht. Battlefield 2042 hier. Oh, guck mal hier, was er kann. Wie er nice. Ich meine,"}, {"id": 713, "start": 7818.88, "end": 7824.64, "text": "wer hat sich gedacht, diese Waffen sind gute Range dafür? Wer hat sich das überlegt?"}, {"id": 714, "start": 7824.64, "end": 7834.8, "text": "Wer hat sich gedacht, oh ja, die Assault-Rifles auf diesem Range, ja, das ist schon gut so."}, {"id": 715, "start": 7834.8, "end": 7842.88, "text": "Ich meine, es gibt ja nichts, was du auf diese Range gescheit spielen kannst. DMRs vielleicht."}, {"id": 716, "start": 7842.88, "end": 7863.48, "text": "Ich bin ein Ironside-Enjoyer. Und als Ironside-Enjoyer, aha, enjoyt man Ironsides. Aber die Visiere"}, {"id": 717, "start": 7863.48, "end": 7868.16, "text": "würden es jetzt auch nicht großartig anders machen, bei dem Gewackel. Richtig, Männer"}, {"id": 718, "start": 7868.16, "end": 7890.04, "text": "brauchen Ironsides. Richtige Schützinnen brauchen Ironsides. Please sterbt halt mal."}, {"id": 719, "start": 7890.04, "end": 7908.2, "text": "Nice Game. GG Eats. Es ist lächerlich. Es ist so hardcore lächerlich. Ja, die PP-29"}, {"id": 720, "start": 7908.2, "end": 7912.08, "text": "wurde genervt und jetzt kannst du nichts mehr spielen über Range bei diesen Riesen-Maps."}, {"id": 721, "start": 7912.08, "end": 7922.84, "text": "Ob das jetzt so viel besser ist, bin ich mir da nicht so sicher. Hab da so meine Zweifel."}, {"id": 722, "start": 7922.84, "end": 7947.56, "text": "Oh. Ich hatte aber drei Gegner, egal mit wie viel Spread hätte es hitten müssen. Und"}, {"id": 723, "start": 7947.56, "end": 7954.64, "text": "ich habe hier extra Rapid Fire genommen. Das kann es trotzdem nicht sein. Yeah, nice, easy,"}, {"id": 724, "start": 7954.64, "end": 7960.72, "text": "verloren, yeah. Okay, vielleicht, vielleicht, oh nee, da fährt was rum. Alter, wie soll"}, {"id": 725, "start": 7960.72, "end": 7971.36, "text": "ich denn, wie soll ich jetzt hier rüberkommen überhaupt? Ich weiß, dass neben mir was"}, {"id": 726, "start": 7971.36, "end": 7989.96, "text": "ist, aber vielleicht schaffe ich es da. Probieren wir mal AKV 24 mit Extended Max. Okay. Ich"}, {"id": 727, "start": 7989.96, "end": 7999.72, "text": "habe für die noch nichts frei gespielt. Probieren wir mal. Wir machen nochmal was anderes. Ich"}, {"id": 728, "start": 7999.72, "end": 8005.44, "text": "gucke mal, ob das wirklich an meinen Attachments liegt, dass die nicht sterben. Ja, lass mich"}, {"id": 729, "start": 8005.44, "end": 8015.24, "text": "rein hier. Perfekt. Nicht jetzt, genau. So, jetzt habe ich ja explizit den Range-Stellz"}, {"id": 730, "start": 8015.24, "end": 8037.36, "text": "drauf. Alles klar. Oh Mann, Game, come on. Ich sage euch, ich aninstall gleich. Das ist"}, {"id": 731, "start": 8037.36, "end": 8046.28, "text": "einfach so ein Crap. Ich habe die ganze Zeit Leertaste gespammt. Es hat einfach nichts"}, {"id": 732, "start": 8046.28, "end": 8051.12, "text": "funktioniert. Aber vielleicht können wir das noch gewinnen. Also hier auf der Map,"}, {"id": 733, "start": 8051.12, "end": 8054.76, "text": "hier geht es ja eigentlich. Hier kann man schön Dach stellen. Übrigens, es gibt einen"}, {"id": 734, "start": 8054.76, "end": 8058.72, "text": "richtig geilen Trick. Gucken, ob ich den hinkriege. Wenn die hier reinpushen, wenn man sich hier"}, {"id": 735, "start": 8058.72, "end": 8063.64, "text": "in die Ecke schießt, das klappt manchmal, dann bleibt man, wenn das Spiel der Meinung"}, {"id": 736, "start": 8063.64, "end": 8069.68, "text": "ist, man darf, darf man da oben drauf stehen und es sieht keiner. Das checkt, das checken"}, {"id": 737, "start": 8069.68, "end": 8080.96, "text": "die nicht. Wir können eigentlich Rapid Fire spielen. Machen das hier eigentlich? Effective"}, {"id": 738, "start": 8080.96, "end": 8094.2, "text": "auf Range. Nee, wir müssen auf Range, müssen wir das hier spielen. Was kommt denn hier?"}, {"id": 739, "start": 8094.2, "end": 8098.6, "text": "Was ist hier los? Wo wird hier gestellt auf der Map? Wo ist passiert überhaupt was gerade?"}, {"id": 740, "start": 8098.6, "end": 8110.48, "text": "Ach, wir verlieren C2. Ja, das ist ja gut zu wissen. Aber C2 sollte wieder eingenommen"}, {"id": 741, "start": 8110.48, "end": 8118.88, "text": "sein, denke ich mal. Man kann ja nicht zoomen und sieht nichts. Nee, C2 ist glaube ich vorbei."}, {"id": 742, "start": 8118.88, "end": 8144.0, "text": "Na klar. Wo kommt denn hier jetzt was an gerannt? Alles klar. Es ist explodiert, ich weiß nicht"}, {"id": 743, "start": 8144.0, "end": 8156.12, "text": "mal von wo. Nicht bei Ansatzweise. Jetzt, jetzt sehen wir, ob es noch OP ist oder nicht."}, {"id": 744, "start": 8156.12, "end": 8162.04, "text": "Wir fahren jetzt eine Runde mit. Okay, da kann das genauso gut wie ich mit dem Hovercraft."}, {"id": 745, "start": 8162.04, "end": 8182.72, "text": "C2, gib ihm. Und raus hier. Ey, du sollst nicht so weit springen. Hab gehört neuer Patch"}, {"id": 746, "start": 8182.72, "end": 8194.04, "text": "Rettet Battlefield. Oh ja, offensichtlich. Obvious Lee rettet das Battlefield. So, jetzt"}, {"id": 747, "start": 8194.04, "end": 8199.88, "text": "sind wir close dran. Jetzt können wir auch mal ne Runde Dings hier spielen. Wir schreien."}, {"id": 748, "start": 8199.88, "end": 8223.56, "text": "Gatschi Buzz. Okay, okay, okay. Wo sind wir? C2. Wenn der C2 ist. Achtung, Achtung, jetzt"}, {"id": 749, "start": 8223.56, "end": 8229.6, "text": "kommt Big Brain. Stonks. Ihr seht mich alle nicht. Ihr könnt mich nicht sehen. Unmöglich."}, {"id": 750, "start": 8229.6, "end": 8238.6, "text": "Unmöglich zu sehen. Unmöglich zu sehen. Kann man die PP29 wegwerfen? Nee, ich hab"}, {"id": 751, "start": 8238.6, "end": 8241.32, "text": "irgendwie den Eindruck, also ich könnte mir vorstellen, dass die PP29 immer noch die"}, {"id": 752, "start": 8241.32, "end": 8254.72, "text": "beste Waffe ist. Ich müsste das mal ausprobieren. Müsste das mal ausprobieren. Haben wir da?"}, {"id": 753, "start": 8254.72, "end": 8270.44, "text": "Ich will kein Spotter sein im Tank. By the way, es ist übrigens normal in dem Game,"}, {"id": 754, "start": 8270.44, "end": 8276.04, "text": "dass man permanent tot ist. Ist by design. Okay, ich glaube retten kann mich hier oben"}, {"id": 755, "start": 8276.04, "end": 8285.68, "text": "keiner. Die MP9 ist auch auf Close Quarter ziemlich nice. Gerade mit, ja das ist das"}, {"id": 756, "start": 8285.68, "end": 8292.28, "text": "richtige Mag. Also gerade mit diesem Magazin für ein bisschen mehr Schuss. Standardmäßig"}, {"id": 757, "start": 8292.28, "end": 8302.64, "text": "hat es einen Ticken zu wenig Schuss, finde ich. Delsen wir mal rüber. Vielleicht kriegen"}, {"id": 758, "start": 8302.64, "end": 8318.52, "text": "wir irgendwas weg. Da kommt was. Ey, warum ist das so verbugt, man?"}, {"id": 759, "start": 8318.52, "end": 8340.08, "text": "Okay, okay. Ich bin in Ordnung."}, {"id": 760, "start": 8340.08, "end": 8351.72, "text": "Die checken es nicht, lull."}, {"id": 761, "start": 8351.72, "end": 8365.84, "text": "Oh, ein rotes Fass, rotes Fass, gefährlich."}, {"id": 762, "start": 8365.84, "end": 8379.16, "text": "Rotes Fass, ganz schlecht."}, {"id": 763, "start": 8379.16, "end": 8380.52, "text": "Rotes Fass, ganz gefährlich immer."}, {"id": 764, "start": 8380.52, "end": 8404.72, "text": "Oh, Monka, Monka, alles klar, ne, du hast keine Ahnung warum das die Leute so krass"}, {"id": 765, "start": 8404.72, "end": 8412.48, "text": "hat, das siehst du doch hier, für einen Gegner den du siehst, seh' ich halt 20."}, {"id": 766, "start": 8412.48, "end": 8420.24, "text": "Das ist übrigens das beste Gebiet auf der Map, hier kann man das halbwegs spielen."}, {"id": 767, "start": 8420.24, "end": 8424.4, "text": "Ich mein, dafür kann ja ruhig jeder seinen Spaß dran haben."}, {"id": 768, "start": 8424.4, "end": 8430.32, "text": "Aber dann sich so zu stellen, ich verstehe nicht warum es die Leute haten, ich mein,"}, {"id": 769, "start": 8430.32, "end": 8434.36, "text": "es gibt 30 Milliarden Videos die die Probleme erklären, die die Leute mit dem Spiel haben."}, {"id": 770, "start": 8434.36, "end": 8438.12, "text": "Also man sollte es zumindest nachvollziehen können, ob man das selbst dann Spaß dran hat"}, {"id": 771, "start": 8438.12, "end": 8439.12, "text": "oder nicht, ist ja was anderes."}, {"id": 772, "start": 8439.12, "end": 8443.76, "text": "Aber ich glaube nachvollziehen sollte es nur mittlerweile jeder können."}, {"id": 773, "start": 8443.76, "end": 8450.44, "text": "Ja, die PP29 hat sich geändert und das Assault Rifles jetzt theoretisch einen Ticken besser"}, {"id": 774, "start": 8450.44, "end": 8451.44, "text": "sind."}, {"id": 775, "start": 8451.44, "end": 8452.44, "text": "Theoretisch."}, {"id": 776, "start": 8452.44, "end": 8459.0, "text": "Oh, wir machen jetzt unsere Big Brain Tag, das ist zum Beispiel was was mich abfuckt."}, {"id": 777, "start": 8459.0, "end": 8471.6, "text": "Du siehst, du weißt nicht was abgeht, von wo irgendwas ist und bist down, ja beste, beste."}, {"id": 778, "start": 8471.6, "end": 8483.56, "text": "Kommst du her, komm her, kommt ihr her, kommt ihr her, irgend einer, Leute, das ist nicht"}, {"id": 779, "start": 8483.56, "end": 8485.0, "text": "die Battlefield Experience."}, {"id": 780, "start": 8485.0, "end": 8489.16, "text": "Fuck, ich hab mich zu sehr bewegt."}, {"id": 781, "start": 8489.16, "end": 8494.88, "text": "Die Battlefield Experience war zwar immer nicht ganz übersichtlich, aber noch halbwegs"}, {"id": 782, "start": 8494.88, "end": 8496.64, "text": "kontrollierbar und durchschaubar."}, {"id": 783, "start": 8496.64, "end": 8502.6, "text": "Das ist es einfach nicht mehr, das regt mich auf."}, {"id": 784, "start": 8502.6, "end": 8516.12, "text": "Deswegen kann ja jeder spielen, wenn er da Spaß dran hat, ich hab ja kein Problem, wenn"}, {"id": 785, "start": 8516.12, "end": 8517.12, "text": "einer das Game spielt."}, {"id": 786, "start": 8517.12, "end": 8526.4, "text": "Ja, aber wenn du Videos gesehen hast, wo die Bugs drin sind, dann ist es ja offensichtlich"}, {"id": 787, "start": 8526.4, "end": 8527.88, "text": "so, dass die Bugs existieren."}, {"id": 788, "start": 8527.88, "end": 8532.24, "text": "Dass du die nicht hast oder dass sie dir nicht auffallen, macht die ja nicht weniger existent."}, {"id": 789, "start": 8532.24, "end": 8539.88, "text": "Ja, die Hovercrafts sind jetzt nicht mehr ganz so krass und die PP29 ist ein bisschen"}, {"id": 790, "start": 8539.88, "end": 8544.28, "text": "schlechter, mit mehr Recoil und die Assault Rifle sind angeblich besser."}, {"id": 791, "start": 8544.28, "end": 8557.12, "text": "Aber es ist immer noch im Kern, gleiches abgefucktes Battlefield 2042."}, {"id": 792, "start": 8557.12, "end": 8559.12, "text": "Was ist hier?"}, {"id": 793, "start": 8559.12, "end": 8570.04, "text": "Ah, das ist ein Ranger, ok."}, {"id": 794, "start": 8570.04, "end": 8579.0, "text": "Nee, und spielbar ist das nicht, wenn man spielbar so definiert ist."}, {"id": 795, "start": 8579.0, "end": 8586.28, "text": "Man kommt in das Spiel rein und kann das genießen will ich nicht sagen."}, {"id": 796, "start": 8586.28, "end": 8591.72, "text": "Das kann rumlaufen und ein paar Gegner killen, das funktioniert, also die absoluten Basics,"}, {"id": 797, "start": 8591.72, "end": 8595.28, "text": "die ein Multiplayer Spiel haben muss, die sind da."}, {"id": 798, "start": 8595.28, "end": 8600.04, "text": "Hätte man das vielleicht nicht als Battlefield angepriesen, hätte ich vielleicht sogar weniger"}, {"id": 799, "start": 8600.04, "end": 8601.04, "text": "Schmerzen mit gehabt."}, {"id": 800, "start": 8601.04, "end": 8618.84, "text": "Was ist hier los, wir werden eh gleich von der Seite gebashed."}, {"id": 801, "start": 8618.84, "end": 8647.96, "text": "Alles klar, jetzt wissen sie, dass ich oben bin."}, {"id": 802, "start": 8647.96, "end": 8652.76, "text": "Hab ich eigentlich ordentlich FPS?"}, {"id": 803, "start": 8652.76, "end": 8653.76, "text": "Ja geht."}, {"id": 804, "start": 8653.76, "end": 8657.16, "text": "PP29, ok die spielen immer noch alle PP29, ich mach das jetzt auch."}, {"id": 805, "start": 8657.16, "end": 8666.6, "text": "Ich mach das jetzt auch wieder und guck ob das wirklich, ob das wirklich so viel schlechter"}, {"id": 806, "start": 8666.6, "end": 8667.6, "text": "ist."}, {"id": 807, "start": 8667.6, "end": 8668.6, "text": "So, gib ihm."}, {"id": 808, "start": 8668.6, "end": 8677.08, "text": "Oh, ich muss schnell sein, die sehen mich, oh, 50 Milliarden Gegner, 50 Milliarden Gegner,"}, {"id": 809, "start": 8677.08, "end": 8693.88, "text": "50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden, 50 Milliarden,"}, {"id": 810, "start": 8693.88, "end": 8701.08, "text": "was genau geht hier eigentlich ab?"}, {"id": 811, "start": 8701.08, "end": 8704.48, "text": "Was war der Unterschied von Battlefield 1 zu Battlefield 5?"}, {"id": 812, "start": 8704.48, "end": 8711.08, "text": "Naja, 2. Weltkrieg statt 1. Weltkrieg und ich glaube, ich glaube das erste war weibliche"}, {"id": 813, "start": 8711.08, "end": 8714.44, "text": "Soldaten, wo es sich alle drüber aufgeregt haben, da kann ich mich noch dran erinnern."}, {"id": 814, "start": 8714.44, "end": 8719.88, "text": "Da waren sie alle richtig, richtig nice getriggert."}, {"id": 815, "start": 8719.88, "end": 8734.44, "text": "Ich dachte nein, das darf nicht sein und by the way, warum kann ich hier nicht rüberspringen?"}, {"id": 816, "start": 8734.44, "end": 8756.16, "text": "Also, hallo, ich möchte auf diesen, hier doch, ok, die zieht deutlich mehr, die PP29, die"}, {"id": 817, "start": 8756.16, "end": 8762.44, "text": "zieht deutlich mehr, jetzt habe ich es gerade gemerkt, die zieht deutlich mehr jetzt nach"}, {"id": 818, "start": 8762.44, "end": 8763.44, "text": "dem Patch rum."}, {"id": 819, "start": 8763.44, "end": 8770.84, "text": "Ich würde sagen nach links oben, nach links oben, könnte sein, hat sich gerade so angefühlt."}, {"id": 820, "start": 8770.84, "end": 8786.48, "text": "Ja, ok, ok, oh, wie hat der mich davon da gekillt, guck mal, der sieht mich noch nicht"}, {"id": 821, "start": 8786.48, "end": 8791.96, "text": "mal, jetzt ist er nicht mal mehr spielbar, ja, das stimmt schon, man hat jetzt halt in"}, {"id": 822, "start": 8791.96, "end": 8796.2, "text": "einem Spiel, was einfach hauptsächlich, also man hat kaum Waffen in diesem Spiel, die für"}, {"id": 823, "start": 8796.2, "end": 8802.2, "text": "die Distanz gemacht sind, über die sich das Game abspielt, das ist sehr merkwürdiges"}, {"id": 824, "start": 8802.2, "end": 8816.2, "text": "Design von den Battlefield Leuten, sehr, sehr merkwürdig, so, da steht irgendein Typ mit"}, {"id": 825, "start": 8816.2, "end": 8829.04, "text": "der Gatling gun und ballert rein, nice, gepega aim, oh, ich will da nicht rein, hier ist"}, {"id": 826, "start": 8829.04, "end": 8834.28, "text": "nichts, guck mal, hier ist einfach legit nichts, wo du rüberpushen kannst, hier ist einfach"}, {"id": 827, "start": 8834.28, "end": 8840.8, "text": "nur randomized, guck mal, guck mal, es ist einfach flach, du kannst da nicht langlaufen,"}, {"id": 828, "start": 8840.8, "end": 8851.56, "text": "einfach nur flach"}, {"id": 829, "start": 8870.8, "end": 8885.0, "text": "ok, ich brauche Sundance mit den Granaten und was man auch hier dran sieht ist 128 Spieler"}, {"id": 830, "start": 8885.0, "end": 8888.72, "text": "ist eine dumme Idee, ich meine, the fuck, wie soll denn hier irgendjemand noch was checken?"}, {"id": 831, "start": 8888.72, "end": 8902.04, "text": "ich brauche die Sundance Granaten, sonst geht da nichts"}, {"id": 832, "start": 8902.04, "end": 8915.28, "text": "guck mal, die aimen mich schon ab"}, {"id": 833, "start": 8915.28, "end": 8936.88, "text": "also, ganz ehrlich, 64 Spieler hätten es wirklich getan und die Map ist einfach kleiner,"}, {"id": 834, "start": 8936.88, "end": 8945.4, "text": "gut, mp9 funktioniert, wir müssen auf jeden Fall switchen, McCree bringt uns hier nichts"}, {"id": 835, "start": 8945.4, "end": 8954.32, "text": "von Mobility, wobei hier jetzt McCree wirklich nice ist, komm, wir nehmen noch mal, nehmen"}, {"id": 836, "start": 8954.32, "end": 8967.76, "text": "wir jetzt einfach noch mal, schnell Feuer dran, ja ja, alles gut, Ironside Enjoyer Max ist"}, {"id": 837, "start": 8967.76, "end": 8979.4, "text": "wieder am Start, pass mal auf, wir machen jetzt Big Brain Move, obacht, weiß ich genau, wo"}, {"id": 838, "start": 8979.4, "end": 8988.76, "text": "der hin ist, ist der down, wo ist der hin, also Massive Massive Move machen wir jetzt,"}, {"id": 839, "start": 8988.76, "end": 9001.72, "text": "in der Hoffnung es funktioniert, ich höre mich nicht sehen, sind die oben, ich weiß"}, {"id": 840, "start": 9001.72, "end": 9006.16, "text": "da, ihr weiß da halt auch nicht, sind die oben, sind die unten, kann man nicht, ich meine,"}, {"id": 841, "start": 9006.16, "end": 9019.0, "text": "das ist der sittliche Mehrwert, dass man da oben hin kann, da ist tatsächlich einer,"}, {"id": 842, "start": 9019.0, "end": 9033.96, "text": "dieses Spiel man, du kannst da wirklich rauf, gepega hoch drei alles, oh, gib ihm, gib"}, {"id": 843, "start": 9033.96, "end": 9061.96, "text": "ihm, ok, ich wollte jetzt eigentlich, da ist, ja klar, easy, der Patch, ja, der Patch hat"}, {"id": 844, "start": 9061.96, "end": 9067.96, "text": "jetzt dafür gesagt und gesorgt, dass die einzige Waffe, die man sinnvoll spielen konnte,"}, {"id": 845, "start": 9067.96, "end": 9075.4, "text": "auf den Kampfdistanzen des Games nicht mehr gut ist, sehr gute Idee, richtig, richtig"}, {"id": 846, "start": 9075.4, "end": 9096.56, "text": "gut, kann ich da rauf jetzt, ok, nice, beweg dich, ok, next please, ich weiß halt nicht,"}, {"id": 847, "start": 9096.56, "end": 9114.28, "text": "wo da was ist, ich will eigentlich Big Brain Move machen, ok, der Big Brain Move geht anders,"}, {"id": 848, "start": 9114.28, "end": 9118.4, "text": "das Problem ist, dass hier gerade zu viel los ist für Big Brain Move, der Big Brain"}, {"id": 849, "start": 9118.4, "end": 9146.76, "text": "Move ist vollender, was, was, der ist nicht gestorben, lul, ey, oh, oh, oh, oh, oh, oh,"}, {"id": 850, "start": 9146.76, "end": 9164.92, "text": "oh, oh, oh, oh, oh, da ist was, bin mir nicht so sicher, ob ich da, der Stream war schon"}, {"id": 851, "start": 9164.92, "end": 9183.56, "text": "immer 48 FPS, ja, alter, Sniper, jetzt Sniper, ey, Game, was ist das, was ist das, das ist"}, {"id": 852, "start": 9183.56, "end": 9192.48, "text": "doch nicht denjenigen ernst, warum sterben die nicht, ich weiß wirklich gar nicht, das"}, {"id": 853, "start": 9192.48, "end": 9204.44, "text": "kann doch nicht sein, warum, warum stirbt man bei sowas nicht, das leuchtet mir, also"}, {"id": 854, "start": 9204.44, "end": 9214.8, "text": "wirklich, dass man sich da wieder dabei gedacht hat man, und wir haben schon die Maximum-Damage-Variante"}, {"id": 855, "start": 9214.8, "end": 9231.6, "text": "davon, ich konnte nichts machen, by the way, ich konnte nichts machen, jetzt ist das Game"}, {"id": 856, "start": 9231.6, "end": 9245.48, "text": "angecrashed, geil, richtig geil, richtig gutes Game, das ist einfach so abgefuckt, ist was"}, {"id": 857, "start": 9245.48, "end": 9250.6, "text": "andere wieder online, BF3, hey, ich hab ne Battlefield 3 Gameplay, Leute, das lad ich"}, {"id": 858, "start": 9250.6, "end": 9257.24, "text": "demnächst hoch, Return to Battlefield 3, nicht, dass es irgendwie jetzt heißen würde, ich"}, {"id": 859, "start": 9257.24, "end": 9264.08, "text": "spiel das jetzt täglich oder so, aber, komm, eine Runde probieren wir noch, ne, ich werd"}, {"id": 860, "start": 9264.08, "end": 9270.96, "text": "heute wieder weiter Halo Cri'n heute Abend, in Portal bekommt man XP, ok, also eine Runde"}, {"id": 861, "start": 9270.96, "end": 9276.64, "text": "will ich noch spielen, eine Runde machen wir noch, dann machen wir entweder WW3 weiter"}, {"id": 862, "start": 9276.64, "end": 9288.92, "text": "oder ich geh was essen, ich hab Hunger langsam, mal gucken, während wir suchen, nicht Conquest,"}, {"id": 863, "start": 9288.92, "end": 9292.92, "text": "während wir suchen, das ist ja der Witz, wisst ihr was, was auch ein richtig guter Indikator"}, {"id": 864, "start": 9292.92, "end": 9300.96, "text": "dafür ist, dass es Broken-By-Design ist, Conquest ist eigentlich der bessere Spielmodus, auf"}, {"id": 865, "start": 9300.96, "end": 9307.4, "text": "den Maps, aber dadurch, dass halt so ewiges rumgerenne und nix los ist, spielen die Leute"}, {"id": 866, "start": 9307.4, "end": 9315.12, "text": "lieber komplett Broken Breakthrough, heute kam der Patch, der Patch, der alles gefixt"}, {"id": 867, "start": 9315.12, "end": 9321.0, "text": "hat, ja, nein, es wurde im Prinzip nix großartiges gefixt, was das Spiel besser macht, ja,"}, {"id": 868, "start": 9321.0, "end": 9331.16, "text": "warte mal hier, Steam-Stats, Battlefield 2042, gucken wir mal, BR4, ich mein, das ist nicht"}, {"id": 869, "start": 9331.16, "end": 9337.2, "text": "wirklich repräsentativ, ne, das ist Battlefield 4, das ist nicht wirklich repräsentativ,"}, {"id": 870, "start": 9337.2, "end": 9344.44, "text": "weil Origin und Konsolenspieler und so, aber die haben halt schon mal einfach 50% ihrer"}, {"id": 871, "start": 9344.44, "end": 9352.08, "text": "Spieler verloren, in, keine Ahnung, in den ersten zwei Wochen, was sagst du zur Roadmap,"}, {"id": 872, "start": 9352.08, "end": 9358.64, "text": "ganz ehrlich, das was ich noch am interessantesten finde, bei der Roadmap ist, dass es Rush in"}, {"id": 873, "start": 9358.64, "end": 9363.44, "text": "Portal gibt, aber wenn die gleichen Leute, die Breakthrough fahren, platziert haben Rush,"}, {"id": 874, "start": 9363.44, "end": 9369.04, "text": "Encoms platziert haben, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein,"}, {"id": 875, "start": 9369.04, "end": 9384.56, "text": "nicht our Breakaway, ganz bestimmt nicht, ganz bestimmt nicht, was wollte ich jetzt"}, {"id": 876, "start": 9384.56, "end": 9391.2, "text": "sagen, ja genau, also und, genau Rush und die 150 Fixes für die Maps, auf die bin ich"}, {"id": 877, "start": 9391.2, "end": 9397.6, "text": "auch gespannt, ob die die Maps halbwegs spielbar machen, ich persönlich fürchte nicht, zumal"}, {"id": 878, "start": 9397.6, "end": 9404.48, "text": "die Sache halb die ist, die müssten jetzt ja eigentlich richtig krass mal rankommen"}, {"id": 879, "start": 9404.48, "end": 9411.92, "text": "mit Content Drops, die müssen ja das Spiel exciting halten, wie man so schön sagt heutzutage,"}, {"id": 880, "start": 9411.92, "end": 9420.04, "text": "aber die sind ja gerade aktuell damit beschäftigt, komplett das zu fixen irgendwie, also das"}, {"id": 881, "start": 9420.04, "end": 9424.2, "text": "ist so ein zweischneidiges Schwert, ja, du musst das Spiel fixen, weil ansonsten rennen"}, {"id": 882, "start": 9424.2, "end": 9439.04, "text": "die Leute weg, wenn du kein Content bringst, rennen die Leute aber auch weg, oh Gott, ist"}, {"id": 883, "start": 9439.04, "end": 9444.0, "text": "das euer Ernst, erst kommt Breakaway, jetzt kommt Our Class, die zwei schlimmsten, schlechtesten"}, {"id": 884, "start": 9444.0, "end": 9455.32, "text": "Maps hintereinander, ja gut, gut sichtbar alles hier, ja sehr gut, übrigens ist auch"}, {"id": 885, "start": 9455.32, "end": 9459.96, "text": "ein Kritikpunkt, den es gar nicht bis in mein Video geschafft hat, ich finde die Fahrzeuge"}, {"id": 886, "start": 9459.96, "end": 9466.24, "text": "zum größten Teil mega lame, also klar ist das manchmal richtig OP, aber ich finde die"}, {"id": 887, "start": 9466.24, "end": 9471.04, "text": "Fahrzeuge an sich langweilig, erinnert euch noch dran, was das so richtiges Helimeter war,"}, {"id": 888, "start": 9471.04, "end": 9475.32, "text": "wo du unter dem Radar nimmst in Battlefield 4 und Battlefield 3, oder ob du irgendwelche"}, {"id": 889, "start": 9475.32, "end": 9479.48, "text": "anderen Lowdots, so Heatseeker nimmst oder sonst was, so ein richtiges Fahrzeugmeter,"}, {"id": 890, "start": 9479.48, "end": 9484.68, "text": "das existiert nicht, Panzer Attachments sind eigentlich auch zum größten Teil totaler"}, {"id": 891, "start": 9484.68, "end": 9489.16, "text": "Crap, das schlechteste Panzer Attachments ist die Shotgun, es gibt so ein Shotgun als"}, {"id": 892, "start": 9489.16, "end": 9492.88, "text": "Panzer Attachments, ich weiß nicht, ob ihr das schon mal gesehen habt, das ist einfach"}, {"id": 893, "start": 9492.88, "end": 9502.2, "text": "nur richtig pepega, das killt nichts, das ist auch über die Range, da kannst du halt"}, {"id": 894, "start": 9502.2, "end": 9513.8, "text": "nicht mehr drauf schießen, nice Game, sehr gut, Poggers, ganz großes Kino, der durfte"}, {"id": 895, "start": 9513.8, "end": 9521.08, "text": "nicht sterben, nicht sterben, kein Ding, Shotgun 0, ja die Shotgun ist angeblich jetzt auch"}, {"id": 896, "start": 9521.08, "end": 9525.8, "text": "besser, habe ich gelesen, ach nee, Moment, Moment, sie haben für alle den Spread reduziert"}, {"id": 897, "start": 9525.8, "end": 9529.96, "text": "außer die Shotgun, nee das stimmt nicht, weil ich gesagt habe, die Shotgun ist genauso"}, {"id": 898, "start": 9529.96, "end": 9544.68, "text": "gut oder fast, fast useless wie vorher, das capturen die, da rennen gerade 40 Leute drauf,"}, {"id": 899, "start": 9544.68, "end": 9550.4, "text": "kann mich nicht entscheiden Leute, ja natürlich ist das Aim nicht wirklich on point, wenn"}, {"id": 900, "start": 9550.4, "end": 9556.24, "text": "du da 50, ich habe den Gegner nicht mal gesehen durch den ganzen Rauch, aber trotzdem, ihr"}, {"id": 901, "start": 9556.24, "end": 9560.28, "text": "habt die Hitmarker gesehen, ich komme, ihr habt die Hitmarker, der ist zwar ver-aimed,"}, {"id": 902, "start": 9560.28, "end": 9568.44, "text": "ja aber ihr habt die Hitmarker gesehen, der hatte bestimmt 5 Hitmarker, die Katze ist"}, {"id": 903, "start": 9568.44, "end": 9578.12, "text": "richtig, oh hier darf ich ja nicht hin, ich habe es ganz vergessen, achja, ja kill mich,"}, {"id": 904, "start": 9578.12, "end": 9582.6, "text": "alles gut, ok, Hourclass spielen wir nicht Leute, Hourclass spielen wir nicht, irgendwas,"}, {"id": 905, "start": 9582.6, "end": 9588.64, "text": "so vielleicht, vielleicht Manifest, Manifest, ich gebe mir ja sogar kein Leidoskop meinetwegen"}, {"id": 906, "start": 9588.64, "end": 9609.2, "text": "noch, aber please, nicht Breakaway oder Hourclass, Praege Leute, Praege, Praege, was kommt,"}, {"id": 907, "start": 9609.2, "end": 9615.96, "text": "Kaleidoskop, ok, ok, die kann man spielen, hier unten steht übrigens die Map, weil hier"}, {"id": 908, "start": 9615.96, "end": 9620.64, "text": "war zu wenig Platz, wisst ihr, dieses leere Feld hier in der Mitte, da war zu wenig Platz"}, {"id": 909, "start": 9620.64, "end": 9627.16, "text": "die Map anzuzeigen, Custom Load Sequenz für eine Map zu machen oder so, das geht nicht,"}, {"id": 910, "start": 9627.16, "end": 9633.16, "text": "echt du magst Manifest nicht, ich mag Manifest, ich mag sowohl den Containerhafen als auch"}, {"id": 911, "start": 9633.16, "end": 9642.04, "text": "oben das auf dem Berg, was genau hat eigentlich dieses Schiff mit dem Spiel zu tun, fällt"}, {"id": 912, "start": 9642.04, "end": 9646.48, "text": "mir gerade auf, was hat das Schiff im Ladebildschirm und das Schiff im Intro eigentlich mit dem"}, {"id": 913, "start": 9646.48, "end": 9659.68, "text": "Spiel zu tun, es gibt in dem Spiel überhaupt keine Schiffe, es gibt Hovercrafts, ach die"}, {"id": 914, "start": 9659.68, "end": 9668.36, "text": "Story von Irish, ja das kann sein, aber es gibt es halt im Spiel nicht, hat halt, hat"}, {"id": 915, "start": 9668.36, "end": 9673.28, "text": "halt mit dem Spiel nichts zu tun, es gab einen Kurzfilm, ja super, es gab einen Kurzfilm"}, {"id": 916, "start": 9673.28, "end": 9677.2, "text": "mit einem Schiff, aber es gibt, das ist ja auch schon mal wieder widersprüchlich, es"}, {"id": 917, "start": 9677.2, "end": 9680.68, "text": "gab einen Kurzfilm mit einem Schiff, aber es gibt kein einziges Schiff im Spiel, außer"}, {"id": 918, "start": 9680.68, "end": 9687.04, "text": "das auf, ähm, äh, wie heißt das D-Dings, deconstructed, ne wie heißt die Map, mit"}, {"id": 919, "start": 9687.04, "end": 9696.96, "text": "dem kaputtenen Containerschiff, Songdo, wir sind Attacker, das ist schon mal ganz gut,"}, {"id": 920, "start": 9696.96, "end": 9725.48, "text": "ja, wir striken richtig, discarded, genau, deep lore, die unfassbar vielen DLCs von Battlefield"}, {"id": 921, "start": 9725.48, "end": 9732.36, "text": "5, wie viele Handbilder von Battlefield 5 haben wir am Ende jetzt gehabt, einen, einen,"}, {"id": 922, "start": 9732.36, "end": 9746.36, "text": "die Pacific Maps, ja du kannst die Map nicht gewinnen als Attacker, ne ne, werdet ihr auch"}, {"id": 923, "start": 9746.36, "end": 9753.68, "text": "gleich sehen, dass man die Maps nicht gewinnen kann, oh oh, ich bleib mal kurz hier drin"}, {"id": 924, "start": 9753.68, "end": 9774.56, "text": "genau, da, da, da passt, ok, was, alles klar, game, das hat gut funktioniert, was zum,"}, {"id": 925, "start": 9774.56, "end": 9795.88, "text": "das war die Messer-Animation, oder, dass ich die nicht killen durfte, ich glaub das war"}, {"id": 926, "start": 9795.88, "end": 9801.72, "text": "die Messer-Animation, echt, du hast es geschafft hier, was, wirklich, ich hab noch nie einen,"}, {"id": 927, "start": 9801.72, "end": 9818.68, "text": "einen Attacker-Win erlebt hier, dachte das ist gar nicht möglich, kein Ironside-Enjoyer"}, {"id": 928, "start": 9818.68, "end": 9839.36, "text": "mehr, hat sich ausenjoyed, und wir haben A2, nice, easy, ok, auf die Range brauche ich"}, {"id": 929, "start": 9839.36, "end": 9857.28, "text": "was anderes, ah, One-shot-Sniper, bashen, alter, bashen, naja, aber Motion-Sensor ist"}, {"id": 930, "start": 9857.28, "end": 9866.6, "text": "gut, weil Motion-Sensor immer gleich fett XP, ich bin tatsächlich richtiger Ironside-Enjoyer"}, {"id": 931, "start": 9866.6, "end": 9878.16, "text": "in so Games, also ich sag euch, wie das, das war zwar ver-aimt, am Anfang, am Battlefield"}, {"id": 932, "start": 9878.16, "end": 9896.04, "text": "3, wär der gestorben, instant, noch, mit einem M16 oder MP16-Burst, na guck mal, da"}, {"id": 933, "start": 9896.04, "end": 9904.72, "text": "willst du was anschleichen von hinten, was ist hier, was soll das, ok, ich seh ihn nicht,"}, {"id": 934, "start": 9904.72, "end": 9921.8, "text": "ich seh ihn nicht, ich hab keinen Plassen-Schimmer, wo er ist, oh, da ist ein Auto, ok, nice, M16,"}, {"id": 935, "start": 9921.8, "end": 9929.88, "text": "weil die M16 war halt broken as fuck in Battlefield 3, aber, die haben es trotzdem hingekriegt,"}, {"id": 936, "start": 9929.88, "end": 9935.12, "text": "obwohl es quasi eine universell beste Waffe eigentlich in fast allem gab, also Allround-mäßig,"}, {"id": 937, "start": 9935.12, "end": 9938.4, "text": "mit fast besten Stats in fast allen anderen Stats, mit der M16 haben sie es trotzdem"}, {"id": 938, "start": 9938.4, "end": 9944.4, "text": "geschafft, dass es competitive war, was anderes zu spielen, du konntest der AEK spielen, du"}, {"id": 939, "start": 9944.4, "end": 9951.0, "text": "konntest der M416 spielen, du konntest der M490 spielen, wenn du das gut konntest, ach,"}, {"id": 940, "start": 9951.0, "end": 9964.4, "text": "ich find's so gut, dass die Leute sterben über Range, was gab's denn noch, AS Valkons"}, {"id": 941, "start": 9964.4, "end": 9970.48, "text": "zu spielen, aber das war ja so ein allgemeines Ding, was hat's noch, also AK war in Battlefield"}, {"id": 942, "start": 9970.48, "end": 9986.92, "text": "3, hat er halt gesagt, AEK M16, M416, F2000, F2000 war ein bisschen AEK für Arme, ja,"}, {"id": 943, "start": 9986.92, "end": 10011.56, "text": "das stimmt, aber was ist hier los, ist halt auch einfach alles flach, wie das Game nach"}, {"id": 944, "start": 10011.56, "end": 10019.36, "text": "dem Patch läuft, im Prinzip genauso schlecht wie vorher, ach, war die F2000 DLC Waffe, da"}, {"id": 945, "start": 10019.36, "end": 10022.28, "text": "kann ich mich nicht mehr dran, oh, jetzt wollte sie mich retten, da kann ich mich nicht mehr"}, {"id": 946, "start": 10022.28, "end": 10038.68, "text": "dran erinnern, ob das DLC Waffe war oder nicht, P90, oh ja, P90 war mega poggers, P90 war"}, {"id": 947, "start": 10038.68, "end": 10054.8, "text": "mega poggers, hier ist alles wieder so flach, man, was willst du hier machen, schön gespottet,"}, {"id": 948, "start": 10054.8, "end": 10062.4, "text": "oh, oh, any spotters, es ist einfach nur komplett flach, Farmers, nee, Farmers fand ich nicht"}, {"id": 949, "start": 10062.4, "end": 10074.24, "text": "so geil, Farmers fand ich jetzt nicht so wahnsinnig, nice, ach guck mal, wir haben A1, ok, da ist"}, {"id": 950, "start": 10074.24, "end": 10101.04, "text": "wieder alles wie gedacht, man passt wieder, ich meine das geile ist ja, dass diese Ranges,"}, {"id": 951, "start": 10101.04, "end": 10106.12, "text": "diese Range ist quasi mal mit Noshah Canals betrachtet, das wo ich jetzt gelaufen bin ist"}, {"id": 952, "start": 10106.12, "end": 10114.2, "text": "Noshah Canals vom Meer bis zu den Bahnschienen, oder waren das Bahnschienen, das war Noshah"}, {"id": 953, "start": 10114.2, "end": 10117.48, "text": "Canals Meer bis zu den Bahnschienen, das war die komplette TDM Map, die ich gerade gelaufen"}, {"id": 954, "start": 10117.48, "end": 10126.88, "text": "bin, so einfach mittendrin in der Runde, ohne dass es irgendwas besonderes war, und hier"}, {"id": 955, "start": 10126.88, "end": 10134.56, "text": "ist auch wieder komplett offen, Moment, wir müssen unsere Granaten umschalten, ach nice,"}, {"id": 956, "start": 10134.56, "end": 10142.16, "text": "ist kaputt, es wäre eine Frechheit die Seasons zu starten bevor das Game gefixt ist, sagt"}, {"id": 957, "start": 10142.16, "end": 10147.16, "text": "der Chat, ich glaube den wird nichts anderes übrig bleiben, die müssten die Seasons starten,"}, {"id": 958, "start": 10147.16, "end": 10153.08, "text": "weil du hast im Prinzip ja zwei, hier kann man hoch, interessant, Pog, ich blinke Leute,"}, {"id": 959, "start": 10153.08, "end": 10159.32, "text": "ich blinke, warum blinke, ich wurde Gehackermann, die haben ja im Prinzip nur die Auswahl zwischen"}, {"id": 960, "start": 10159.32, "end": 10165.76, "text": "Pest und Cholera wenn man so will, die können das Spiel erst komplett fixen und dann rennen"}, {"id": 961, "start": 10165.76, "end": 10172.68, "text": "die Leute weg, die es jetzt spielen weil es kein Content mehr gibt, oder die bringen"}, {"id": 962, "start": 10172.68, "end": 10181.6, "text": "Content und alle regen sich auf, dass keiner fixt, also im Prinzip können die es gar nicht"}, {"id": 963, "start": 10181.6, "end": 10202.2, "text": "richtig machen, und das ist das Problem wenn du in so einem Zustand launchst, du musst"}, {"id": 964, "start": 10202.2, "end": 10207.16, "text": "jetzt nicht nur fixen was eh immer zu machen ist und neuen Content liefern und das pünktlich"}, {"id": 965, "start": 10207.16, "end": 10211.6, "text": "und das möglichst schnell, nein, du musst auch erst noch mal dein Game fertig entwickeln"}, {"id": 966, "start": 10211.6, "end": 10216.8, "text": "und das ist halt echt schwierig, die sind jetzt quasi schon, die sind ja im Prinzip"}, {"id": 967, "start": 10216.8, "end": 10223.08, "text": "ein halbes Jahr hinten dran mit ihrem Spiel durch diesen Zustand jetzt, und das stelle"}, {"id": 968, "start": 10223.08, "end": 10230.04, "text": "ich mir, ich stelle mir das wirklich, guck mal wie lange das dauert, das stelle ich"}, {"id": 969, "start": 10230.04, "end": 10248.16, "text": "mir echt äußerst schwierig vor, der Content ist schon produziert, da bin ich mal gespannt,"}, {"id": 970, "start": 10248.16, "end": 10265.44, "text": "woher weißt du das, also redest du das oder haben die das gesagt, was kann ich sagen,"}, {"id": 971, "start": 10265.44, "end": 10284.24, "text": "ja seh mal das Spiel produziert, lull, das haben die gesagt und dieser tolle, du meinst"}, {"id": 972, "start": 10284.24, "end": 10300.0, "text": "ja den Tom Henderson, also wenn der Content schon produziert ist, in diesem Zustand wie"}, {"id": 973, "start": 10300.0, "end": 10326.36, "text": "der Content jetzt ist, dann gute Nacht, sag mal sterb halt mal Mann, ja, das mit den"}, {"id": 974, "start": 10326.36, "end": 10330.96, "text": "mehreren Entwicklerstudios, das ist ja auch meine Vermutung, dass sie das versucht haben,"}, {"id": 975, "start": 10330.96, "end": 10335.32, "text": "möglichst parallel, also die mehreren Entwicklerstudios ist so mein Ansatz, warum es überhaupt drei"}, {"id": 976, "start": 10335.32, "end": 10339.56, "text": "verschiedene Spielmodi gibt, dass du die vielen Leute überhaupt parallel irgendwo hinbringen"}, {"id": 977, "start": 10339.56, "end": 10348.12, "text": "kannst, aber dass es nicht funktioniert, hat man ja am Release des Spiels gesehen, also"}, {"id": 978, "start": 10348.12, "end": 10357.12, "text": "für das Geld, was die haben und für die Manpower, die die haben, ist der Zustand schon echt"}, {"id": 979, "start": 10357.12, "end": 10380.68, "text": "mies, ich sag doch gar nichts Panda, ihr wisst doch, ich bin eh Fan davon, dass die Leute"}, {"id": 980, "start": 10380.68, "end": 10386.04, "text": "ihre eigene Meinung haben dürfen, auch wenn ich der Sache nicht zustimme, ich muss euch"}, {"id": 981, "start": 10386.04, "end": 10389.24, "text": "ja nicht zustimmen, aber es ist ja überhaupt kein Problem, wenn ihr irgendwie eine andere"}, {"id": 982, "start": 10389.24, "end": 10392.96, "text": "Ansicht seid, ich hab mir da keine Schmerzen mit, solange ihr nicht sagt, Max ich fick"}, {"id": 983, "start": 10392.96, "end": 10397.28, "text": "deine Mutter, du Kackspaß, dann ist alles in Ordnung, dann hab ich keine Schmerzen mit,"}, {"id": 984, "start": 10397.28, "end": 10413.52, "text": "weil einer etwas anderes meint als ich, man sieht auch so gut was hier, ein Toss, ich"}, {"id": 985, "start": 10413.52, "end": 10422.04, "text": "hab Hunger, die Runde machen wir noch fertig, aber danach gehen wir was fuddern, Flugstells,"}, {"id": 986, "start": 10422.04, "end": 10428.0, "text": "kann man von hier abheben davon, für den nächsten finde ich tatsächlich Webster ziemlich"}, {"id": 987, "start": 10428.0, "end": 10440.96, "text": "gut, weil man sich da in die Galerie rein hucken kann, ja ich hab ja auch gesagt in"}, {"id": 988, "start": 10440.96, "end": 10448.2, "text": "meinem Video, das Game hat durchaus seine Momente, ich bin immer noch ein bisschen unschlüssig,"}, {"id": 989, "start": 10448.2, "end": 10451.08, "text": "ob es wirklich so gut war das Battlefield zu nennen, also gut, das verkauft sich, was"}, {"id": 990, "start": 10451.08, "end": 10460.28, "text": "sollen sie sonst machen, ich wollte eigentlich fliegen, ich darf nicht fliegen, also für"}, {"id": 991, "start": 10460.28, "end": 10463.2, "text": "mich, ich hab es ja mal im Video gesagt, für mich hat das nicht so wirklich das Gefühl"}, {"id": 992, "start": 10463.2, "end": 10484.4, "text": "von Battlefield, siehst du einen, seh'n dich 5, Frosch68, bist du der Frosch von YouTube,"}, {"id": 993, "start": 10484.4, "end": 10493.84, "text": "aber argle, aber argle null, oder irgendwie sowas, oder heißt du nur zufällig Frosch,"}, {"id": 994, "start": 10493.84, "end": 10501.4, "text": "oh Big Flank, Big Flank, ja klar, eh klar, perfekt, das ist der richtige echte Frosch,"}, {"id": 995, "start": 10501.4, "end": 10514.08, "text": "Big Flank, und wisst ihr was Big Flanks in dem Spiel bringen, gar nichts, gib ihm, gib"}, {"id": 996, "start": 10514.08, "end": 10541.88, "text": "ihm, jaja ist gut Panzer, jaja Panzer, ist gut, kriegt euch ein Mann, kriegt euch ein,"}, {"id": 997, "start": 10541.88, "end": 10549.68, "text": "ich verpiss mich mal, ich bin raus hier, oh da steht ja wieder was auf der Gasse, Hell"}, {"id": 998, "start": 10549.68, "end": 10558.76, "text": "Jesus ist am Start Leute, Hell Jesus, aber Hell Jesus sieht nichts, Hell Jesus ist komplett"}, {"id": 999, "start": 10558.76, "end": 10574.2, "text": "blind, hallo ich möchte Waffe wechseln please, danke, nice game, GG Eats, ok hier darf man"}, {"id": 1000, "start": 10574.2, "end": 10590.0, "text": "wieder nicht springen, ah Midipack, oh Girls, so ein Motionball da hinten in die Ecke, ich"}, {"id": 1001, "start": 10590.0, "end": 10609.72, "text": "würde den ja retzen, das Dumme ist, ah der hat schon gecancelt, oh Leute, abfuck, 12"}, {"id": 1002, "start": 10609.72, "end": 10615.52, "text": "kills 21 assists ist schon eine gute Runde in dem Battlefield, nein nein nein, ach Mist"}, {"id": 1003, "start": 10615.52, "end": 10625.48, "text": "ich wollte ja gar nicht mit der spawn, ziehst du 2, sehen dich 15, jo echt so, ja ja sehr,"}, {"id": 1004, "start": 10625.48, "end": 10655.0, "text": "high speed wingsuit, ok Achtung, das Schlimme ist halt, dass die selbst außerhalb spawnen,"}, {"id": 1005, "start": 10655.0, "end": 10672.52, "text": "die spawnen auch da hinten, das sackt halt mal richtig, ist das ein Schneiber, ups das"}, {"id": 1006, "start": 10672.52, "end": 10689.76, "text": "war gar keine, ah, in the cop, da ist doch was, hier ist doch angeblich was, das ist"}, {"id": 1007, "start": 10689.76, "end": 10698.24, "text": "gar kein Sniper oder, das ist gar kein Sniper, das ist einfach nur ein Scheinwerfer, Keg"}, {"id": 1008, "start": 10698.24, "end": 10717.88, "text": "mit, boah, weggerotzt, so jetzt spawnen wir mal mit dem anderen, meistens ist hier schon,"}, {"id": 1009, "start": 10717.88, "end": 10725.8, "text": "ist hier schon fertig, aber man kann, also die nächste Sache ist nicht einnehmbar, aber"}, {"id": 1010, "start": 10725.8, "end": 10736.52, "text": "das hier kann man schaffen, das kann man einnehmen, das andere, das andere ist nicht schaffbar,"}, {"id": 1011, "start": 10736.52, "end": 10744.68, "text": "achja, nice, jetzt gehen wir fliegen, was ist da, war das, das war nur die Kiste die"}, {"id": 1012, "start": 10744.68, "end": 10758.8, "text": "ich gehittet habe oder, nicht der Typ selbst, von vorne kannst du halt auch nichts machen,"}, {"id": 1013, "start": 10758.8, "end": 10770.94, "text": "das ist so offen man, das ist so offen einfach nur überall, pass auf, ich wette mit euch"}, {"id": 1014, "start": 10770.94, "end": 10775.88, "text": "bald kommen sie auf die Idee hier C4 runterzuschmeißen, auf die Idee sind sie ja bis jetzt noch nicht"}, {"id": 1015, "start": 10775.88, "end": 10791.4, "text": "gekommen, aber das dauert nicht lang, ok, jetzt machen wir, ja wir haben das dran, krieg"}, {"id": 1016, "start": 10791.4, "end": 10800.4, "text": "dich alter, ich krieg dich, come on, the demon mantis, einfach mal reinspringen, einfach"}, {"id": 1017, "start": 10800.4, "end": 10818.52, "text": "mal reinspringen, da war doch links auch noch was, oh habe ich wiederbelebt bug, kann das,"}, {"id": 1018, "start": 10818.52, "end": 10823.76, "text": "habe ich wiederbelebt bug, nee, ach nee, das ist dieser, dieses komische rumgebagge, jawoll,"}, {"id": 1019, "start": 10823.76, "end": 10838.96, "text": "gibts mir, easy gachi pass, jawoll, Spritze rein, Booster Impfung am Start, Booster ist"}, {"id": 1020, "start": 10838.96, "end": 10863.04, "text": "raus, schuldig, schuldig, was ist das hier, Moment, wo ist hier, wo ist hier oben und wo"}, {"id": 1021, "start": 10863.04, "end": 10891.76, "text": "ist unten, wir haben es Leute, wir haben es, mal ab aimen falls hier irgendjemand rein will,"}, {"id": 1022, "start": 10891.76, "end": 10898.28, "text": "mal schauen, der stellt es doch hier noch, war doch klar, oh wir haben kaum noch, kaum"}, {"id": 1023, "start": 10898.28, "end": 10908.82, "text": "noch money, nice, so jetzt müssen wir irgendeine Waffe finden, die hier vielleicht noch rum"}, {"id": 1024, "start": 10908.82, "end": 10914.52, "text": "liegt, da stellt sich eine Waffe, gib ihm, 15, 15, was ist das, mp9, ich nenne auch eine"}, {"id": 1025, "start": 10914.52, "end": 10924.32, "text": "mp9 mit drum mag, hatte ich noch nie, keine Ahnung ob das was taugt, mp9 drum mag, auf"}, {"id": 1026, "start": 10924.32, "end": 10942.44, "text": "gehts, die sind halt immer noch da oben, was sagt der neue Patch, pp 29, wird nicht mal"}, {"id": 1027, "start": 10942.44, "end": 10949.12, "text": "so oft gespielt, hovercraft ist ein bisschen genervt, aber ansonsten hat es am Battlefield"}, {"id": 1028, "start": 10949.12, "end": 10958.64, "text": "nicht allzu viel geändert an 2042, so wir haben noch, ach das ist schon der letzte Punkt,"}, {"id": 1029, "start": 10958.64, "end": 10964.28, "text": "ja jetzt schaffen wir, also Leute jetzt ist die Map vorbei, jetzt ist die Map vorbei,"}, {"id": 1030, "start": 10964.28, "end": 10980.28, "text": "also C1 geht noch, C2 ist nicht einnehmbar, guckt euch mal die Motion Sensors an, wie"}, {"id": 1031, "start": 10980.28, "end": 10991.64, "text": "viele Motion Sensors hier rumfliegen, keck w, Dankeschön dass man nicht drüberspringen"}, {"id": 1032, "start": 10991.64, "end": 10996.72, "text": "darf, ach das war der Typ noch in der Ecke dabei, gibt doch noch ein Fahrstuhl, ja es"}, {"id": 1033, "start": 10996.72, "end": 11001.0, "text": "gibt, passt mal auf, das müsst ihr gesehen haben, das ist wirklich Map, aber wirklich"}, {"id": 1034, "start": 11001.0, "end": 11023.32, "text": "Massive Big Brain Map Design in Reinform, also besser gehts nicht, fährt er hoch, 30 Stunden"}, {"id": 1035, "start": 11023.32, "end": 11037.88, "text": "Reload Zeit, oh da ist ein hovercraft, wenn ich Reloaded hab, wenn ich Reloaded hab dann,"}, {"id": 1036, "start": 11037.88, "end": 11047.72, "text": "ok wir habens, so und jetzt passt mal auf Leute, wir müssen jetzt, alles klar, wir müssen"}, {"id": 1037, "start": 11047.72, "end": 11060.16, "text": "jetzt auf das Dach hoch, also du kannst, wie haben sie es denn bei Orbital gemacht, du"}, {"id": 1038, "start": 11060.16, "end": 11064.68, "text": "meinst dass du von mehreren Seiten mit der Zip Line hoch kannst, ja bei Orbital ist eigentlich"}, {"id": 1039, "start": 11064.68, "end": 11081.64, "text": "auch nicht einnehmbar, Orbital ist auch nicht einnehmbar, guck mal da links, das geht hier,"}, {"id": 1040, "start": 11081.64, "end": 11094.8, "text": "was geht hier, so du hast zwei Varianten, ich zeige euch, Mensch hovercraft, ah der versucht"}, {"id": 1041, "start": 11094.8, "end": 11097.36, "text": "hoch zu fahren, ok, du hast zwei Sachen, du kannst hier mit dem Fahrstuhl, wo ist denn"}, {"id": 1042, "start": 11097.36, "end": 11102.6, "text": "hier der Fahrstuhl überhaupt, hier, du kannst hier mit dem Fahrstuhl hoch und dann rüber"}, {"id": 1043, "start": 11102.6, "end": 11107.36, "text": "Zip Line oder bei dem anderen mit dem Fahrstuhl hoch, das Problem ist jetzt, ihr werdet es"}, {"id": 1044, "start": 11107.36, "end": 11125.64, "text": "gleich sehen, ihr werdet es gleich sehen, also was anderes fällt mir da wirklich nicht"}, {"id": 1045, "start": 11125.64, "end": 11137.0, "text": "zu ein, oh guck mal, ich werde wiederbelebt, ok, vielleicht schaffe ich es noch mir was"}, {"id": 1046, "start": 11137.0, "end": 11141.76, "text": "rein zu drücken, wir machen jetzt Trick 17, ich flieg jetzt, ich flieg jetzt, pass mal"}, {"id": 1047, "start": 11141.76, "end": 11148.0, "text": "auf, ich flieg jetzt woanders hin, sobald die Tür aufgeht, guckts euch an, ich hab's"}, {"id": 1048, "start": 11148.0, "end": 11158.88, "text": "versucht, ich wollte den Big Flank machen hier, aus der Tür raus, nehm das Schild,"}, {"id": 1049, "start": 11158.88, "end": 11162.96, "text": "das hört sich in der Theorie gut an mit dem Schild, aber da wird so viel reingespampt,"}, {"id": 1050, "start": 11162.96, "end": 11171.04, "text": "das kannst du vergessen, selbst wenn du schildert, du kriegst ja nicht mal tot, wer hat sich"}, {"id": 1051, "start": 11171.04, "end": 11185.84, "text": "denn sowas ausgedacht, ja irgendwas mit schwedischem Name auf jeden Fall, irgendein 3-Head Schwede,"}, {"id": 1052, "start": 11185.84, "end": 11191.72, "text": "achja man kann auch in das andere Haus übrigens rein, wir gucken uns das jetzt mal, ok, wir"}, {"id": 1053, "start": 11191.72, "end": 11195.64, "text": "machen das jetzt von der anderen Seite, Achtung, wir können nämlich auch hier in den Fahrstuhl"}, {"id": 1054, "start": 11195.64, "end": 11203.0, "text": "rein, so wir können nämlich auch hier rein und hier hochfahren, so, das ist nämlich viel"}, {"id": 1055, "start": 11203.0, "end": 11209.8, "text": "besser, das ist nämlich viel besser hier hoch zu fahren, weil wenn man hier hoch fährt,"}, {"id": 1056, "start": 11209.8, "end": 11215.84, "text": "dann passiert nämlich gar nichts, guckt hier, das easy kommt man raus und basht alles, ach,"}, {"id": 1057, "start": 11215.84, "end": 11223.16, "text": "hm, ach guck mal da steht sogar ein Hovercraft auf dem Dach, achja und das Hovercraft hebt"}, {"id": 1058, "start": 11223.16, "end": 11231.96, "text": "gerade ab, das ist einfach in die Luft geflogen gerade, die hat gerade gesagt, our victory"}, {"id": 1059, "start": 11231.96, "end": 11242.36, "text": "is imminent, ich, hm, x, x daubt, wir overwhelmen die überhaupt nicht, das stimmt nicht, das"}, {"id": 1060, "start": 11242.36, "end": 11255.76, "text": "Gamer zählt einfach Stuss, ok, ja das war zu viel spread, das war zu viel spread, ich"}, {"id": 1061, "start": 11255.76, "end": 11269.84, "text": "hab das auf, oh oh, oh oh, ist aber mal gut ey, Transportheli von oben, ja das funktioniert,"}, {"id": 1062, "start": 11269.84, "end": 11277.68, "text": "aber im Prinzip wirst du eigentlich schon gebashed, während du runterspringst, es ist"}, {"id": 1063, "start": 11277.68, "end": 11287.28, "text": "halt äußerst, ach Leute, der Ansage, jetzt hab ich's verstanden, der Ansage hat's gesagt,"}, {"id": 1064, "start": 11287.28, "end": 11294.76, "text": "wir müssen nur noch das final objective taken, dann gewinnen wir, ach so, jetzt weiß ich"}, {"id": 1065, "start": 11294.76, "end": 11302.76, "text": "auch was ich fast falsch mache, just take the final objective, Mensch, wie hab ich, warum"}, {"id": 1066, "start": 11302.76, "end": 11318.24, "text": "hab ich das so lange nicht gesehen, Achtung, wir fliegen jetzt wieder wohin, da steht ein"}, {"id": 1067, "start": 11318.24, "end": 11323.72, "text": "fucking Panzer auf dem Dach und schießt in den Fahrstuhl rein, ein Panzer, ein Panzer"}, {"id": 1068, "start": 11323.72, "end": 11332.24, "text": "steht auf dem Dach und schießt, ach Gott, das ist so schlecht, die sollen AC, die sollen"}, {"id": 1069, "start": 11332.24, "end": 11337.12, "text": "hier Leute, wisst ihr was die machen müssten, die Attacker, wisst ihr was die Attacker machen"}, {"id": 1070, "start": 11337.12, "end": 11343.36, "text": "müssten, ich zeig's euch, Sekunde, wenn meine Maus funktionieren würde, die Maus"}, {"id": 1071, "start": 11343.36, "end": 11357.4, "text": "müssten das hier machen und einfach alles wegsprengen, was da oben drauf steht, by the"}, {"id": 1072, "start": 11357.4, "end": 11365.44, "text": "way, dass das nach drei Wochen immer noch nicht hotfixed wird, wurde hier dieses Objective,"}, {"id": 1073, "start": 11365.44, "end": 11369.76, "text": "ein absolutes Armutszeugnis, das sollte das einfachste sein, von der Welt so eine publische"}, {"id": 1074, "start": 11369.76, "end": 11376.92, "text": "Flagge umzusetzen, hat das Ding hier nicht auch Fahrstühle irgendwo, Moment, hat das"}, {"id": 1075, "start": 11376.92, "end": 11383.28, "text": "Teil hier nicht auch Fahrstühle, ne Jonas hat keine Fahrstühle, doch hat Fahrstühle,"}, {"id": 1076, "start": 11383.28, "end": 11404.32, "text": "oh der kommt gleich, guck mal, oh der kommt, wegen der, die kommen runtergefahren, da kommen"}, {"id": 1077, "start": 11404.32, "end": 11417.24, "text": "gleich Gegner raus und tschüss, die fahren jetzt schon runter, welches Herz dann empfiehlst"}, {"id": 1078, "start": 11417.24, "end": 11436.76, "text": "du, das einzige Herz, das ich empfehlen kann, ist das Spider-Nexx MMX300, kannst du C4 in"}, {"id": 1079, "start": 11436.76, "end": 11455.56, "text": "das mal an, da ist die gesamte Grundschule auf dem Dach, das ist eine richtig gute Idee"}, {"id": 1080, "start": 11455.56, "end": 11465.12, "text": "gewesen, C4, da muss ich ja C4 werfen, C4 im Fahrstuhl selbst sind die glaube ich nicht"}, {"id": 1081, "start": 11465.12, "end": 11489.12, "text": "nah genug dran, hätte man jetzt einen Mörser wie in Battlefield 3, ja, ach fahr mal nochmal"}, {"id": 1082, "start": 11489.12, "end": 11495.28, "text": "hoch, ich probiere das mal, ich probiere das mal mit C4, man könnte C4 hier hinlegen und"}, {"id": 1083, "start": 11495.28, "end": 11521.56, "text": "sich selbst, und sich selbst in die Luft sprengen, oh man, das ist nicht Battlefield, das ist"}, {"id": 1084, "start": 11521.56, "end": 11534.88, "text": "demlichstes Design aus der Hölle, so, wo ist der C4 überhaupt, hier, sind wir oben,"}, {"id": 1085, "start": 11534.88, "end": 11546.04, "text": "sind wir oben, sind wir oben, ne oder, ne, ne, ne, ich habe C4 glaube ich noch nicht"}, {"id": 1086, "start": 11546.04, "end": 11557.72, "text": "einmal ausprobiert hier, oh der Shieldman, ok, wie machen wir das hier, ne, der Shieldman"}, {"id": 1087, "start": 11557.72, "end": 11572.84, "text": "hat doch keinen Bock mehr, ok, doch jetzt hier, ist das C4 gerade in die Luft geflogen"}, {"id": 1088, "start": 11572.84, "end": 11590.6, "text": "als der Fasche losgedingst ist, das C4 ist in die Luft geflogen als der, oh, ich dachte"}, {"id": 1089, "start": 11590.6, "end": 11595.68, "text": "wir müssen, ich dachte wir müssen just, just einfach nur noch das objective, das final"}, {"id": 1090, "start": 11595.68, "end": 11613.24, "text": "objective captchern, dann war es das, cringe Sprüche, die Sprüche sind so dumm, die Durchsage"}, {"id": 1091, "start": 11613.24, "end": 11624.04, "text": "meinte, dass wir gewinnen, achja, 182, ok, boah, ey, alter, dieses Game, man, boah,"}, {"id": 1092, "start": 11624.04, "end": 11633.32, "text": "der erste Typ hat das letzte Emblem für Hovercraft, ja, wundert mich nicht, manche"}, {"id": 1093, "start": 11633.32, "end": 11637.88, "text": "Leute haben das Hovercraft ja nix anderes gespielt, seit, seit, im Prinzip, seit Early"}, {"id": 1094, "start": 11637.88, "end": 11645.64, "text": "Access start, fahren die quasi permanent kreisel mit dem Hovercraft, was hältst du"}, {"id": 1095, "start": 11645.64, "end": 11649.0, "text": "von World War 3, ich muss sagen, ich fand es gar nicht schlecht, das Movement ist aber"}, {"id": 1096, "start": 11649.0, "end": 11667.72, "text": "top, komplett abgefuckt, ja, ich würde den Streamer Mikro Tick up, hier, genau, oh man,"}, {"id": 1097, "start": 11667.72, "end": 11672.8, "text": "ja ne, es war Stream, Leute, ich gehe jetzt was futtern, wir sehen uns, bis dann, macht's"}, {"id": 1098, "start": 11672.8, "end": 11679.8, "text": "gut, tschüss."}]}