{"text": "hallo hallo hallo btf was jetzt hallo Vodafone Vodafone Vodafone hallo alsobattlefield ist nicht ausgelockt auf jeden fall geht wieder nice warum hast du den deafoperator gesperrt hast du dich verklickt also was fragt denn hier fatal sag mal läuft das nochoder oder ist das irgendwie broken dq also sag mal hab seit einer woche ein ganz komischesproblem mit meinem pc hatte 2 mal 8 gigabyte ddr 3 riegel ddr 3 dann ist der pc aber dochschon ein bisschen älter seit letzter woche startet er nicht mehr mit beiden riegel aberbeide funktionieren habe jeden einzeln schon probiert ebenso wie alle slots hab aber hardwaretechnische bis auf ein paar hdd installiert kann es sein dass er nicht so viel power brauchen dasnicht naja festplatten verbrauchen hauptsächlich beim anlaufen viel strom also wenn die an dasanlaufen überleben also spätestens mit einem reset sollten ja nicht neu anlaufen das kann ichremote schlecht diagnostizieren ich würde mal den ram test machen in so einem test oder sowas alsowenn die queue ist nicht gleich ob welche waffen sind meter weiß ich nicht welche waffen sind meterm9 bei mir m9 und grad 30 was ist denn zu allgemein meter ak ak 24 glaube ich ak ist beibei sturm gewähren ziemlich meter zu deiner nachricht achso ja du kannst ein bild schickensolang es nicht von rick ashley ist und mich rick rollen bild kannst du machen der out dasgame train ist am start leute eins ab brauchst noch eins ab dann haben wir den den den scam danndann seid ihr in der abo falle wo kann ich das schicken ja sucht ihr irgendeine image hostingseite aus jetzt bin ich in q 2 von 4 sogar schon der kuchen anders gore ist am startdankeschön progas halb das ist jetzt ruckelt ist normal weil das game der meinung ist immenü braucht man 100 prozent cpu last muss man 100 prozent cpu last erzeugen ne image hosting ichkann nicht in discord hier reingucken gescheit also ich glaube aber nicht ich glaube auch nicht dasses an der festplatte liegt 2 ja das spiel mag nicht dass wir join oder da werden auch leuteaus diesem spiel quitten es quitten ständig leute aus dem game raus wisst ihr was was wenndie was wir jetzt mal machen in der zwischenzeit wir stellen mal unser super tolles profil einplayer card was kann man da so alles einstellen specialist images specialist also zeigt man jawas ist das field of operation alles klar das problem jetzt mp9 also ein auto so ein autoproblem auch ich finde das lustig dass sie dann ein boot haben und es existiert in diesem spielda kein boot weiß auch nicht was man sich da so genau dabei überlegt hat smg brodachy killseuer smg brodachy richtig brodachy badges mckay master kann man nicht noch mehr machenmachen wir so ok tags sie sind wett data meinerehrlich gesagt juckt mich das so überhaupt nichtground breaker so super so vielleicht geht es irgendwann auch los demnächstbettel wie sieht es aus was der stand der rundeich vermisse diese zeit wo man sich emblem selber gestalten konnte also ich vermissediese zeit auch und auch nicht weil erinnert sich einen black ops 1 90 prozent der playercards bestanden aus dicks oder tippen foto ab google ok so gewonnen easy dann geht esjetzt los klar also ergeblich bin ich noch in der queue aber sollte ja gleich funktionierenso also was sieht man hier es ist auf jeden fall schon mal richtignice ist ekearec oder falls es ekearec sind keine ahnung auf jeden fall schon mal richtigbig brain zusammen mit zusammengeschraubt warum du so ultra viele strom strom fressendes surfer hast oder ich weiß ich das von dir oder von wem ist dases leht ich will nicht dass es leht das ist vermieter ja ich guck gleich ich guck gleichweiter da hat sogar eine konsole gucken wir gleich ach manifest jetztmanifest finde ich ist die beste map im spiel aber in rush leider schlecht gemacht ich glaubemanifest ist für alle anderen spielmodi mit das beste aber in rush ist es mit die schlechtesteich weiß nicht was man sich dort mit den mit den platzierungen gedacht hatoh was gehen mit dem kran hier oben ab was hat der kran für schmerzenja ich sag dir ich sag dir gleich was was da abgeht aber sowieso ich kann dir zwar sagenwas was ist so ungefähr aber mehr als sieht aus wie so was sieht aus wie storage siehtaus wie netzwerksachen kann ich dir natürlich auf dem bild auch nicht sagen weil wohersoll ich wissenoh oh depends manok das war nicht so gut das war ein low iq grappling hook wir müssen mal kurz wartenbis das zack zack ich muss kurz warten bis es reloaded hat jetztok nice hier geht was ok das war pepega aimed was hatte mich gekillt m5 ah m5 enjoyer sehschon ein richtiger m5 enjoyer muss auch mal seinda kommt ein pence mancap'n poggers ich hol dich yolo res oh neeoh oh shit da ist ja ne panzer auf der straßdafür mach ich ne krasse flank action aber nein ja manifestes pence champextreme nerd danke für den sub oh hier sehr guter spawnexzellente exzellente exquisita spawnoh oh ganz schlecht ganz schlechtdu kannst ja grad echt nichts machen der hat sich auch nicht selbst geheiltaber wir haben es guck mal wir haben es gelegt legehänge ist die legehänge ist strong heutesteigt ausok vielleicht kriegen wir jetzt ein bisschen struktur reinalles klar nice gg battlefieldwhat the hell ist das ist das ne hacker man fähigkeit oder oder war das gelecktist leute ist das ich bin verwirrtist das ne fähigkeit von dem specialist oder oder es ist lege gewesenwenn sie fähigkeit von dem specialist ist würde ich auch ziemlich ziemlich ein pencechamp findenleck warum nicht beides das ist ne gute frage warum nicht beidesja der bruder bruder get wreckedwenn wenn mechanics im game sind die nicht funktionieren dann triggert mich das immerso ein bisschen bot fähigkeit weiß nicht das war glaube ich richtigkrasses gelege hätte die rechte ecke gucken sollen anscheinendes einfach durchrennen aber ich dachte laut map der ist irgendwie daist auch immer besser als die esl matches von letztensoh hier unten geht es ab wie nix abgekriegt nix abgekriegtich habe keine ahnung wo hier was abgehtdie die die die enjoyen das nicht so hiersag mal können wir sterben bliesdas spiel hat ja kein soundtrack deswegen habe ich mir gedacht ich mache einfach malthematisch passende musik anich finde das passt auch ziemlich gut dazuoder was sagt ihres ist es ist auf jeden fall besser es ist auf jeden fall besser als der normale soundtrackweil der normale soundtrack ist ja nicht vorhandengame blies kann aber einer sterbenvielleicht kriege ich den rett hier oben ist viel am start jawir bräuchten irgendein mit amok jetzt auch hier oben geht es aber rundhier oben geht es aber rundoh was ist hier los ist das auto ich brauche muni ich brauche muniübrigens habe ich schon mal gesagt dass ich die nachlade animation von der von derlg 18 eigentlich ziemlich nice findeok achtung ein nicer rusheralso die spawns in wirklich komplette katastrophe hier inder katastropherauf aufs dachoh ist er hinter mirschon wieder leerich bin froh dass es kein radio gibtwenn es ein radio geben würde dann müsste ich das radio muten weil mittlerweile tostauf twitch istdie mp ist nur auf range gut auf entfernung sagt es mal richtigdas hier ist die mitnehmen habe ich in der ak gesehendas hier ist anscheinend so die krass so die mit die richtige meta waffe gerademit diesem attachment glaube ich auch probieren wir mal die meta waffe ausich meine ich bin ja froh ich bin ja froh dass es eine assault rifle gibt was man spielenkann weil ansonstenalles ein grund dass die alle ppega 29 gespielt habenmeine motion sensors mehr schmeißenwo ist hier was ich sehe die gegner sterben und leute sterben neben mir abersehr gut hab wieder top funktioniertihr seht ihr wie die motion balls lagenhabt ihr es unten auf der map gesehen wie der motion ball einfach flupp flupp fluppfluppso als rush nur wieder mit der k30 rein viel besserder könnt sich umdrehen und mich retten macht er nichtjawoll kein respawn ist poggerskein respawn timer ist der beste respawn timeralso wenn ich bin wenn es für mich für die gegner nichtweggespray die gutenlege henne und healdankeschön gameda oben auf dem turm hat das einen single playerdie haben 5 eingestellt und auf den single player verzichtetum sich nur auf den multiplayer zu konzentrierenund ich finde das sieht man auchdie musik ist perfekt finde ich passt richtig gut dazuaber die haben wir gerade schon weggeklatschtdie skins sind nicht nur dämlich die sehen auch noch dämlich ausalso die fault dinger die gehen ja noch halbwegsdie fault dinger sehen halt dafür aus dass es richtig clone army istalso in battle field 3 funktioniert deine maus nichtwarum das denn nichtachja wir wollen uns ja das server build hier wieder weiter anguckenalso was sehe ich denn hier sonst noch draufalso ich sehe hier unten plate center sind das ernsthaft plate centersieht ein bisschen aus wie plate center ich erkenne es nicht so wirklichdas ist von der von der größe her schlecht zu erkennenes könnten auch festplatten einschübe sein aberich würde so spontan das hier oben sind festplatten einschübedas hier sind auch festplatten einschübe die sind keine plate centerdas sind festplatten einschübe das sieht man hier oben das metall dranist von der größe her nicht ganz klaroder wobei das sind es doch plate center schwer zu erkennenhpc 7.000 möglich jakann durchaus sein so das ist auf jeden fall storagerelativ viel frage ist halt nur ob große platten oder nichtich meine so ein storage kann durchaus auch wenig storage seinder heutigen zeit ich hab ich hab festgestellt es wurden heute30 terabyte platten vorgestellt eine konsole was mich ein bisschen stutzigmacht eine konsole mit windows das schon äußerst painschampig ist ein patch panel noch ein patch panelwer zu sagen das hier ist das dürfte irgendwie ein dsl modem seindas hier in der mitte noch mal noch mal einen storage ist da obenkeine ahnung ja was der da typ mit dem keller machtist wirklich sehr fragwürdig keine ahnung ja es ist auf jeden fall nichtnicht billig so viel so viel ist sicherdas ist eine ganz schlechte idee maxalter meine fresse battlefield movement please lass mich doch einfach mal da hochlaufenwow fuck alter seht ihr wie viel dahinter mir istdas sind 40 leute hinter mir ok es können nicht sein es können maximal16 sein aber trotzdemalter krass ist das pp geheim aller zeiten aber hat gereichtjetzt gehen wir schon rein warum gehen wir rein weil es noch zweisekunden sind und jetzt gehts auf jawoll massiveich kann nicht retzender waffensound ist tatsächlich in ordnung wobei man sagen muss für battlefield verhältnissefinde ich ihn gar nicht malso gut also ihr seht auf range geht mit dem ding nicht so viel reinja komm onich wollte den den den container aufmachen und reingehendas war doch range gerade da ging nicht so viel reinund obwohl ich schon burst geschossen habe niceschon planten am startkann man sich eigentlichhätte auch sein könnenja der kill danach schonjawoll aufgeholt bunny bunny gehobthier überrennen die aber schon ganz schön oderalso balance ist wirklich was anderesbalance ist was anderes leuteund wir können doch nicht gehen wir können bei fünf bei so keine ahnung bei zehn sekundenoder wann weiß ich jetztich denke mal ich denke mal jetzt können wir gehenhabe ich glück jawoll es geht auf poggerscharlie mikeda ist ein dude dahinter und ohne sentry gun ist oder kommt ein gegnerist wie weg oh oh sentry stelltsentry stellt muss wegvon hintenget fucked up in the ass over hier leutesind die dauerjetzt aber jetzt sind sie dauerndja ja ja ist gerade richtig anstrengend hierran hier ran hier leuteranso mal kurz kurz noch was reindrücken den booster impfung drinnen jetzt geht's losok ich war auf der falschen waffeaber kann ja mal passieren die gegner haben ist ähnlich so wirklich viel resistance zuspüren geradeoh gott ist dieses spiel verpackt mandas spiel ist so verpacktmonach sich wurde ich habe gekrappelt und nach dem rest wurde ich beginnt das krabbel automatischaus dachau wieder schon ziemlich prognose oder schon schon ziemlich prognosetot nach dem bus dann suswar richtig susich war schon längst um die ecknetcode 0 hdalso ist das halt mit kleinzeit hd detections muss auch so sein letztendlichwie wir haben es nicht gekriegtlulguckt euch das mal anhätte ich jetzt nicht gedachtwar das die bill gates boosterjawoll aus dach aus dach big brain dachnein nein er stirbt gleichoderdie sind alle unter ihmralphiosnein nein ralphios lassnein ralphios ralphios pleaseok ich gehe unten hin besserich sollte vielleicht lieber mal hier hinter so ein komischessorry weil die stellsten die stellsten ja hier rumso motion motion ballswar nix wie wegoh wie warum schießen die zurückich glaube jetzt erlauben die sich aber hier waseinfach zurückschießenich glaubecake wait manachtung achtunghugeäh schlecht das war schlechtweil von da hinten kommt wasja ja ich weiß dass hinter mir einer isthinter mir ist noch mehrja ja ja ja ist ja gutlass mich in ruhedurchs fenster jawollboah hier drinnen ist ja die hölle losähhier drinnen hier gehts abhier bräuchten wir jetzt irgendeinen panzer oder sodas wäre richtig niceaber die machen das gut die gegnermuss man mal sagen endlich mal ihre leute die irgendwie so eine art taktik wenigstenshabenso wenn ich glück habe kann ich da irgendwie reinsporn soman kann ja auch die gegner die die die team jetzt nicht richtig selectenweil ich das game denkt nope no pass hier drüberlass mich spawnen spawn spawn spawn spawn spawn spawn spawn spawn spawn spawn spawn spawnnicep h xjetzt haben wirsboahalter warum kriegt man hier immer headshotsvon was krieg ich bitteschön headshots ich spray einfach sinnlos auf die gegner draufkann doch keine headshots kriegenaber wenn das game meint ich mein ich werd mich jetztich werd mich natürlich nicht beschweren über headshotsvon da hat er mich gehittet na gutchat chain lore poc niceahja jachain lore ist am start dann kann er nix mehr schief gehenwhoop arrive leute whoop arrivedas emote haben wir dem chain lore zu verdankendie weihnachts emote achja stimmt da war ja wasweihnachts emote da war ja waswollt ihr weihnachts emote rein machen rein machenübrigens hier probieren wir jetzt mal was es ist nicht auf dem dach a ist nicht aufdem dach a ist in der mitte wir probieren mal oder fatalist schon am start ich wollte eigentlich versuchen ob manherum flenken kann aufs dach und dann von oben reintroppenaber ich glaube wir haben das schneller gelegt und gewonnen als ich irgendwie überhauptam objective bingame game hallogameah ok alles klar verstehe verstehemanchmal klappt daswir sprechen einfach lull das hat gehittet stolte stellt euch mal voreasy winthe enemy is bugging out im wahrsten sinne des worteser möchte uns damit so was anderes sagenüberlegt euch mal wie schnell die runden starten könnten wiederwenn wir uns diese cringe sprüche nicht jedes mal anhören müsstendieses stage hat nie jemand getestet nö wahrscheinlich wie das meisteich habe ein equipment destroyed dass die meistens kills im squad hatte ist egalhauptsache hauptsache ich habe ein equipment destroyed das ist mal richtig massiveda gibt es bestimmt bald demnächst eine badge für equipment destroyerso was sehe ich denn hier sonst noch schönes draufalso fox da habe ich keine ahnung was das istvon der größe würde ich sagen fast ein lüfter oder sohier unten das erkennt man zu schlecht erkennt man auch nichthier würde ich sagen tatsächlich auch irgendwelches netzwerk equipment oder soaber jetzt mal ernsthaft das sind irgendwelche alten hp kisten dl 380oder so was was macht dein nachbar damit im kelleroder dein mieter damit im keller das ist schon ein nichts zu unterschätzendesequipment alles wahrscheinlich eher von ebayund dementsprechend halt auch warm und energie fressend und lauthat jemand eine ahnung was das hier in der mitte ist ist das ein fernsehist das ein fernseh ist das ein crt fernseh hier in der mitte oder was ist dasder macht web hosting ok web hosting im keller ist auch nichtverkehrt leute wenn ihr zu einem ordentlichenholster volt für eure für euer hosting ausrufezeichen hetzner im chat20 euro startgut haben für alle eure hosting ansprüche und besser als dasdas game wusste gerade nicht wo ich hin willguck mal wir sind vor den defendern am mkong am mkong was ist denn das für einstumpfsinn game wer hat sich das wer hat sich das aus was hier losnein in der s schicken er ist geschudetwir haben a gelegt einfach schon nur wir waren wir waren vor den defendern dadas hat doch nie im leben jemand getestet oder wir haben wir haben dieerste base wir haben die erste base in luftgeschreckung in die luftgesprengt bevor die defender überhaupt da warenpepega testing sage ich mal dazudas ist auch so ein teil der map hier den keiner warum warum existiert dieserteil der map überhauptergibt nicht wirklich sind hätte ja keine ahnung können dass sie dass esgeht näher hätte man vielleicht mal testen müssen aber ich glaube die habenihr spiel eh nicht gespielt ok wir gucken jetzt mal wie ich nein nein neinich renne jetzt einfach du triffst mich eh nicht soll du triffst mich nichtpack neinhier kommen welche motion sensors hin motion sensorsda unten ist ereasy das ist äußerst äußerst durchdacht gibt es imBattlefield Revolution? Nö. Gibt es nicht.Es kann eine Antenne einstürzen, das ist aber alles.Monarch! Monarch S! Alter! Jetzt wurde aber zugesprägt. Die Maps sind einfach zubig. Naja, in Rush geht es ja noch, aber ich gebe dir prinzipiell recht und dieMaps sind dann auch null für Rush ausgelegt.Es gibt keine Revolution, wie man das aus Battlefield 4 kennt. Das einzigeRevolution Event ist das, was man im Trailer gesehen hat, wo die Seite vomSchiff umfällt und dann gibt es noch halt diese Geschichte mit dem...Okay, alles klar.Da gibt es noch die Geschichte mit dem Mast auf dem Dach.Aua! Die wollen es aber echt wissen hier. Ich verpiss mich mal kurz.Fuck man! Aber jetzt gucken sie ja wirklich überall hin.Das ganze Budget ging für den Tornado drauf, ja anscheinend. Der Tornado istauch eines der sinnlossten Features überhaupt. Benutzt jetzt nach dem, sagman mal, nach dem anfänglichen Hype, benutzt irgendjemand diese Tornadosüberhaupt, wenn sie kommen?Also ich bin immer froh, wenn der Tornado nicht auf der Map spawnen, woich hin möchte. Alter, wir haben hier eine ziemliche PP-Gap-Position.Gib ihm, gib ihm, gib ihm, gib ihm! Bunny hop in die Deckung! Bunny hoppen in dieDeckung hat funktioniert. Jetzt geht's ran hier.Gib ihm. Raus mit dem Crabling Hook und oben drauf.Darf ich mal fragen von wo? Ach da, obvius, da hat, da, der, ah okay.Das oben war ein Gegner? Wirklich? Ach das war ein Gegner! Ich dachte das ist einTeammate, null. Ja dann ist okay. Dann war, dann war es richtig, dann war es richtigdumm. Ich dachte das ist, Moment, dann war der aber ganz schön langsam, oder?Fuck! Wird der Roboterhund vom Tornado aufgesaugt? Weiß ich nicht.Ich dachte das, ich hab den gesehen, ich dachte das wäre ein Teammate. Guck mal, da istübrigens Gehirntod. Gehirntod und Nutmage. Alles klar, wir haben, die Gegner, die Gegner wissen, wissenwas das ist. Okay, das wird wirklich gerade ziemlich, ziemlich knapp hier. Die pushendoch jetzt auch gleich rum, die Jungs hier. So, erst mal kurz den Maul, sehr gut Max,sehr gut. Pack, da komm ich nicht hin. Okay, oder auch nicht. Alter, Pepega Aim. Zu viel,zu viel Hipspray, Mann. Zu viel Hipspray. Da wird man faul, ich sag euch, da wird, dawird man faul und bewegt die Maus immer richtig. Alter, ist ja gut jetzt. Was die Umständebei DICE sollen echt nicht so geil sein, das kann ich mir vorstellen. Ich glaub die Kombinationaus DICE wissen nicht mal, wie man Battlefield macht plus EA macht Druck und nervt, da kommtsowas raus. Oh, was ist das hier für ein Clusterfuck gerade? Da kommt was. What? Guter Play, dashat er gut gemacht. Das hat er gut gemacht, das hat er taktisch geschickt gemacht, C4um die Ecke und weg rennen. Das man muss das ja auch mal anerkennen können, wenn einerwas Gescheites macht. Die haben aber jetzt ziemlich, oh wir haben nur noch 6 Tickets,wir verlieren. Leute, das ist die erste Runde, die wir losen. Was ist denn jetzt los? Losers,Any Losers? Will ich verlieren? Gib ihm, gib ihm. Ahhhh. Erste Runde, die wir losen.Erste Runde verloren. Wo blief? Ach, ihr hattet hier mal ein paar euch, Chet, der dort gearbeitethat, das ist interessant. Chet sagt, sie kennt einen DICE Entwickler. Ist das so wie früher,wo man gesagt hat, mein Vater arbeitet bei Microsoft, du wirst gebannt oder kennst duwirklich einen DICE Entwickler? Ja, kann ich mir durchaus vorstellen, dass es nicht sogeil ist. Ich mein, wir haben uns ja letztens den, das mir gerade so eingefallen, wir habenuns ja letztens mal ein paar Stellenbewertungen, also ein paar Arbeitsplatzbewertungen von DICEangeguckt und die Leute haben ja auch geschrieben, sie verstehen nicht, wie man an den Wünschen,also wie man so an den Wünschen der Spieler vorbei entwickeln konnte. Zehn Flagen ineiner Runde. Ja, wahrscheinlich random. Draus war schon ein gutes Quad und einen guten Heli-Flieger.Ich glaube, wenn du einen guten Heli-Flieger hast, mit dem du mit kannst, das ist gar nichtso unmöglich. Was macht euch der Captain Poggers, ist der wieder am Start? Poggers?Ach guck mal da, das sparen wir jetzt rein. Übrigens, das ist der LLV, ich hätte dasnicht für Möglichkeiten, aber LLV ist schlecht gegen Infanterie, die haben in diesem Spielnichts getestet. Das Ding sollte eigentlich der Infanterie-Zerstörer sein. LLV, du alterZerstörer. Ist es aber nicht. Das Ding schießt zu langsam und macht zu wenig Splashdamageund allgemein zu wenig Damage. Richtig hängen geblieben. Da geht einer auf B. Oh, oh, oh,oh, über mir. Fuck, da hinten war er noch. Aber die Legehenne ist raus. Legehenne wurdegemacht, Legehenne war erfolgreich. Mal gucken, ob die Legehenne durchgeht. Oh nee, ich glaube,die diffusen. Nein, einfach diffuse. Oh, Jutsch. Oh, Combat, Combat, Combat. Der verreckt jetzt.Oh, oh, oooh. Also, wir können noch eins, zwei für Squad gebrauchen, dass wir hier wiedergut easy durchgehen. Guckt euch mal die Maps an. Es ist einfach offen. Einfach offen unddu musst jetzt da ranrennen. Oh jetzt hat das Bunnyhop nicht funktioniert. Jetzt mussIrgendwie wieder mehr husten vielleicht klickt das auch mit anzahle das sind was ich erzähle wenn ich viel erzählen muss ich mehr husten oderWenn ich wenig erzählen keine ahnungIch sollte ein paarSmokes mitnehmenVerpiss dich ich baller einfach in deine richtung jetztJa klar manOmikron auf fack leutemorgen tot fackKönnt schon das video hochladenYoutuber stirbt bei live stream oder was auch immerWas darf man als keine witzel drüber machen heutzutage weil doch man kann fast alles witzel machenGuck mal der lhw macht keinen splash damageGuck mal der lhw seht ihr wie der sackt, der sackt so hardcore der lhw manSeht ihr das, seht ihr dasSo schlecht manJetzt leckt er auch nochDie musik passt ja ist wirklich so ein bisschen mario kart styleOk tschüss und tschüssMal gucken ob wir wieder den nice move hier hinbekommenJa hat wieder funktioniertIch habe gedacht ich spreche aus der hüfte das war eine dumme idee ich hätte die iron sights gehen sollenIch dachte komm du machst einfach links rechts strafe und baller wild in die richtungDas war nicht so schlauEin richtiger pepega moveEin richtiger pepega moveEin richtiger pepega move was ist da oben losOkay jetzt aberLeute wir haben schon gelegt, Leute wir haben schon die lege hände gemacht bevor ich überhaupt fertig binDas war ein hitX daubtDaubt, aber ganz große daubt dasDas war ein hitDas war ein hitDas war ein hitDas war ein hitDas war ein hitDaubt, aber ganz große daubt dasDaubt, aber ganz große daubt dasDaubt, aber ganz große daubt dasAlso ein könnten wir als zwei als zwei könnten wir für es konnt noch gebraun, weiß ob der captain po bleach noch mal kommtJa rühren und betenAchtung wo ane ist ein schild im welchDurfte nicht einsteigen war weil warum weilAber wir haben sieGuck mal die jenkler haben das eigentlich ganz gut gemachtDie haben uns auch die haben uns auch wirklich ganz gut im zaum gehalten aber das hat das game hat sich gedacht nopeStyle downEs ist übrigens extrem irritierend das tote gegner noch sprechen und man denkt dort ist wasDie haben übrigens auch nicht gefixt dass man gegner neber sich hört die 50 kilometer weg sindauch so ein dingWenn er jetzt hat keiner getestet jetzt jetzt wird spannend wieAchtungOhBackLiegt an der siedels soundkarte nein das legt da well viel problem hast du mehr oder weniger überallAch mensch jetzt leute seid man nicht so oft zackLk 0 sagt da das game heute deinstalliert kann ich verstehenAlso wenn ich nicht ab und zu mal hier noch ein streemStreben würde und das mit mit euch zusammen halbwegs spaß machen würde würde ich wahrscheinlich auch nicht mehr spielen ich habe das nurNoch installiert wegen wegen stream sorOhne ist weil wir das hier macht mir tatsächlich echt spaß mit den leuten dabei jetztJetzt geht wieder nix aber ich glaube der kriegt mich glaube der kann mich retten um die eckeSo ein paar motion sensors rüber kloppenBin mir nicht sicher wo hier was ist gerade noch mal noch mehr mauschen jetzt rüber rüber hierAus irgendwelchen pointen ist da oben was achtung mensch game come onEs hätte so gut funktionieren könnenHat es aber nicht wir haben noch mal eine chance leute noch mal eine chanceAch man das game fackt mich teilweise richtig abMan kann sich auch nicht mehr auf auf geländer stellen das funktioniert nicht so immer wenn du auf den geländer gehen willst springt da rüberRittenfriede für den zappSagtist abel anzeige ist rausDer typisch liegt bestimmt immer noch da ich spreide jetzt einfach dass er sich nicht trautOkay die gegner das wird jetzt richtig zum es zum esl match hierLull wie so nicht das hast du dir so gedacht alda naDas hast du dir so gedacht ich warte mal dass die beim dass er bei mir spawnen kannAhWas hältst du von coding bootcamps?Kommt drauf an!Was das für ein thema ist und ob das mit oder ohne bezahlung ist oder oder oder jenachdem also von der firma nicht von der firma irgendwas freiwilliges irgendwas hackerstelltsmäßiges oder alter ich habe 50 gegner um mich drum herum obwohl hier eigentlich garnichts ist weiß gar nicht wo der istder typ ist immer noch da oben ich fasse es nicht alterok wir müssen auf jeden fall noch motion sensor darüber klatschen jetzt dass wir wassehen da oben ist ja die familien ist ja weihnachtsfeier da ist ja wirklich weihnachtsfeier draufeinmal probiert ich habe noch ich habe übrigens noch nie erlebt dass es in stocken gerätan dieser base das ist das ist mir neu ich glaube fast rush ist ziemlich defender heavywenn man einmal in stocken kommt jetzt einen sagen die leute ja klar max das ist rush aberdas muss ja nicht zwangsläufig so sein weiß gar nicht wo ich hin soll wir sind zu wenigewisst ihr was wir gehen jetzt hierübernein ich weiß nicht was ich tuesieht so aus als wüsste ich was ich tueweiß nicht was ich tue steigt mal lieber ab jungsmonka stierda hinter mir steht er monka stier aber vielleicht sind wir jetzt ein bisschen rangekommennein verloren so wir brauchen noch zwei teammates leute es geht nicht dass wir runden verlierenzweite runde in folge verlorendas ist ausgeschlossen das ist only wind streamder guckt schon so richtig pains champhast du schon mal drüber nach einer handschauderung zu spielen habe ich mir noch nie angegucktich weiß was das ist dass das die das ist das crytek wie nennt man diese genre keineahnungright jetzt ist ja kein battle royale es ist crytekwie nennt man das genre von von handschauderungkannst du mal zeigen wie das geht mit aufsätze level mit botsja das würde ich eigentlich zeigen bevor ich oft gehe weil sonst müssen die leute imsquad hier wartenoh nee our class battle kann ich mal kurz zeigen wie man aufsätzeleveledauf our class habe ich eh keinen bockwürde sagen dauert 10 minuten oder so 10 10 minuten 10 15also als nächster gehen wir die map auslassen ok also dann zeige ich euch das jetzt malschnellwie man aufsätze leveledalsozackalso ihr geht all out warfareneinachso ich bin nicht der party leader deswegen ich muss die party leavenleave partyso ihr geht auf all out warfarechange game mode solo dann sagt ihr hier change settings mit f warum auch immerund ihr müsst kaleidoskop auswählen und startwichtig ist ihr müsst attacker sein aber ich glaube es gibt nur attacker wenn ihr solospieltso und dann müsst ihr die erste base schnell clearund dann aufs hochhaus und auf dem hochhaus gibt es den level bug glitchwie auch immer man das nennen magich euchstellt die bots auf noob bots ist es egal ob ihr noob bots oder gute bots killtüberhaupt kein unterschiedzähltübrigens ihr müsst auch wenn ihr solo spielt 5 stunden warten bis das game startetwarum weiß ich nicht müssen wir dice fragender grinst auch schon sotruckel übrigens bei mir auch das nicht nur bei euch im strebenso da müsst ihr hin guck hier oben hier auf dieses auf dieses haus müsst ihr kleinalso erst mal erste und zweite base clearerste zweite base clearwas gegen bots relativ einfach istund dann da oben da oben drauf hier oben ist so ein lüftungsschachtda müsst ihr hineigentlich euch kleinich weiß auch nicht ob es da nicht vielleicht bessere varianten gibtim direkten panzerpanzer noobsmuss erst mal intro anguckenmuss man die runde gewinnt für xp neines geht ja nicht um xp es geht ja um attachments freischaltenich will nicht ich ach so shotgun level ja das können wir dann gleich machenalso ihr müsst jetzt erst mal also unser ziel ist glaube ich c1wir müssen jetzt a2 a1 schnell machen dann b1 b gibt es nur ein objective wenn ich dasrichtig im kopf habeund ja dann ja ja bots lasst mich in ruheeasy as fuckso wir müssen jetzt erst mal die bots clear die hier rumstehenne das stirbt nichtmeine team mates sind richtig richtig richtig porgasok wenn wir glück haben kommen wir da jetzt schon ran und legenach das ist ja break through das ist ja gar kein rushwas erzähle ich denn hier legen man richtig hängen gebliebenso also a1 cap schondrei stunden späterhabt ihr gestern eine runde trat ja ich auchich habe fast die komplette fast die komplette k30 dort geleweltalso einnehmen drei stunden später ist es dann irgendwanneingenommendann geht es rüber zu a2 dann b2 und dann oben aufs hausda kommt noch was ok wir haben es jetzt rüberdas müsst ihr auch nur einmal machen das könnt ihr euch auch ein bisschen zeit lassenund die waffe leveln oder so das ist das ist easyoh nein die bots sind gar nicht so dummdas war jetzt schlechtes beispiel hier waren die bots jetzt wirklich dummaber an sich sind die bots gar nicht gar nicht so dummja der bot killt mich gleich team komm on pleaseok da konnte ich jetzt gar wirklich nix machenes ist wirklich wenn du akkus ziehst von den botsachja übrigens meine teammates sind so schlau die wiederbeleben nichtdie haben da schon mal gar kein bock draufrichtiges bot team ja korrektaber das machen wir jetzt schnell das zeige ich ihr könnt auch wunderbar die waffe levelnguck mal also easier kriegt ihr keine 20 killsso team please kommt mal reinkommt mal rein team auf gib ihm wir gehen jetzt einfach hier obendrauf das kann euch das kann euch bei bot battlesmanchmal passieren dass euer team wirklich nicht nicht nachrücktund das ist dann natürlich pains champ er so nehmt ne muni kiste mit leutedas ist das allerwichtigste ihr müsst ne muni kiste mitnehmenmuni kiste mitnehmen unglaublich wichtig ihr braucht ne muni kisteohne muni kiste könnt ihr das nämlich gleich auf dem dach nicht machenok ich glaub wir haben es steht hier einer in der eckso das jetzt ne ihr braucht ne muni kiste weil ihr auf dem dach später keine möglichkeithabt euch zu refreshenihr müsst muni kiste und mckay ist auch ein dummer specialistihr müsst maria falck mitnehmen maria falck für sehr viel und ammo kistedas ist das ist eigentlich das eigentliche meta für waffen unlocksdas heißt ich werd mich nochmal killen lassen wenn wir das hier eingenommen habenund so jetzt brauchen wir noch eine eine genau das hier brauchen wir jetzt noch b1und dann gehts hoch aufs hochhaus und dann ist unlock waffen unlock farmenangesagt true luvie genaukomm mal macht das eigentlich damage macht das hier damagelass mich mal kurz so durchrushen b1der grappling hook hat auch 50 prozent damage gemacht noch vorm patchweiß nicht warum es das jetzt nicht mehr machthier ist das problem die bots sind zu dummdie bots sind zu dumm hier durchzukommen das heißt ihr müsst auf jeden fall dasclearen sonst wird das nix und nachdem ihr euch heilen müsstwie gesagt maria falck ammo pack midi midi midi stelsdie sind alle hier unten die bots gucktirgendwas hinter mir stellts da jetzt rum so mein team ist halt so richtigrichtig schnellokay jetzt switchen wir mal auf die eigentlich sinnvolle klasse dafürkomm mal schon schon 42 kills für fast nix ihr braucht 300 kills ihr braucht 300 killsfür für allesokay also jetzt switchen wir mal auf die sinnvolle klasse dafüralso maria falck midi packschiebt da rein mit dem g baited beste musik dafürso da unten ist wieder alles vollich hab da so viel gekillt die müssten es eigentlich ohne probleme hinbekommen aberich meine das sind bots darf man nicht vergessenmein teammates können sich reviven ich probiere das mal ob die ob die reviven ob die so schlausind und reviven können aber das geht glaube ich nichtauto ja die lasern dich teilweisehuge car steuerung monka monka steer das war keine so gute ideeokay jetzt aber hiersag mal ich muss bots bashen alter ich will euch einfach nur zeigen wo man waffen leveltaber gerade wollen die bots nichtaber noch irgendwas spannendeses gibt übrigens auch keine squats in diesem modusdie ai geht manchmal richtig abdas ziel ist ja waffenleveln deswegen finde ich mit autos gar nicht mal so sinnvolldie bots können mehrnee ich hab das gestern auch gemacht das ist easy as fuckich hab ich hab da zehn minuten für gebrauchtalter okay jetzt aberdu musst dich richtig anstrengen man gegen die botssollen es sojetzt haben wir es aberich glaube jetzt haben wir es meine güte das war ja schwere geburtdas war eine schwere geburt so wenn wir das haben es gibt nur b1 was anderes gibt esnichtdann kommt die geschichte mit dem haus auf die kommt es andeswegen braucht ihr auch die muni kiste sonst wird das ganze nichtich meine guck mal ich hab schon 58 killskann man easy kills machen zwischendurchso wir haben es und jetzt geht das andere aufund jetzt und jetzt jetzt kommt jetzt wird esmuss man nicht angel nehmen nur ich hab das auch ohne angel gestern gemachtes gibt es gibt bestimmt zig taktiken für ich hab es gestern so gemachtich hab es gestern so gemacht ich bleib mal hier bevor es die bots noch verlierenalso ich ich hab es gestern so gemacht weil du hast ammo box und du kannst dich selbstverteilenist wahrscheinlich wahrscheinlich geschmackssacheso jetzt müssen wir hier oben hinda da hoch c1c1 hinter und da müssen wir möglichst schnell hoch bevor die 30 milliarden bots da sindich bin jetzt mit dem heli hochgeflogen das hat gut funktioniertals als passagier wir gucken ob wir es mit dem fahrstuhl auch schaffenaber wahrscheinlich wirst du komplett weggespreit im fahrstuhl schonda da müssen wir hin da ist so eine luftschacht und da muss man hinohne heli wirst du es gelasert mal gucken ich hab es noch nicht probiert mit dem fahrstuhlwo sind die fahrstühle noch mal hierwo sind die fahrstühlehier rechtsda hierpass auf ich werde jetzt weggelasert von den botsalso da dahin nicht der ach der ah ja falsche seiteso so müsste ich einmal durch das einmal durch das dach das wird nichts also wir müssenhier raus und an die recht rechts runter was wahrscheinlich nichts wirdprobieren wir mal ansonsten ansonsten mit dem heli ansonsten mit dem heli raufund es kann ja auch ein bisschen dauernso hier hin müsst ihr leute hier hin und jetzt einfach nur ihr legt hier hinten dasding hin und jetztjetzt fahrt ihr eure 300 killsdie bots können euch nicht hittendu kannst auch hier man kann auch hier drüber gucken das geht auchaber ich habe es gestern so gemacht hin hingelegt ich habe es im prinzip so gemachtich habe mich in mein ammo pack gelegt ammo pack hier hinich habe mich in mein ammo pack gelegt und ungefährungefähr zehn minuten hier gelegen ach so ihr dürft nicht so viele bots killen sonstpassiert daseure ai gewinnt und das ist schlecht ihr wollt nicht dass eure ai gewinnteure ai soll verrecken das war jetzt dumm ich habe zu viele bots gekilltalso ich warte jetzt mal bis meine ai hoffentlich stirbthoffentlich hoffentlich stirbt meine ai leute kratzt mal ababer ihr habt es gesehen das ist im prinzip das ist im prinzip der trickok meine ai ist tot sehr gut das ist der trickjanein ich würde auf gar keinen fall belphi kaufen geradeso und da macht ihr jetzt einfach eure 300 killsbleibt hier in diesem ammo pack liegen und und seit ironside enjoyerfertig und legt euch irgendwie so hin dass es nicht rumklitschtso funktioniert das die bots können euch nicht hindie einzige sache wo euch die bots manchmal hitten könnten ist von hierund deswegen lege ich mich da unten hin ja du kannst nur aufsätze levelnich lege mich so hin weil das checken die bots nichtso was wollte ich leveln auto shotgunwaren wir jetzt aber nicht im stream so also ihr habt es gesehen easyso funktioniert das und da habt ihr in einer viertelstunde diewaffe frei auf gehtsihr da ist hast diesen trick ja wahrscheinlich weil jetzt können dieleute easy alles anlocken aber ganz ehrlich ich finde das ist auchnotwendig das ist ich ganz ehrlich ich finde das anlocken in dem game ist soeines der unenjoyigsten sachen aller zeiten toller satz also es macht überhauptkein bock sachen hier frei zu spielen weil es gibt alles doppelt und dreifachund eigentlich gibt es ja auch nur sagen wir mal 2 1 2 kombinationen die duhaben willst du willst bei den smgs willst du das 40 und 50 40 und 50 jamerkt haben fertig in einem spiel kann konquest nur im momentalso den sinn verstehe ich nicht so genau warum in portal xp aus ist undsolche dinger im single player halt easy möglich sind gegen portal spielst duimmer noch gegen echte leutegut ich meine natürlich ist xp und das nicht genau das gleiche aber trotzdemnormalerweise sollte ja auch das anlocken mit zum game gehören aber ichfinde es macht überhaupt keinen spaß und so kann man wie gesagt ihr habtgesehen viertelstunde und ihr habt alles anlocktoh wir sind die fände haben wir uns die fände geben was meinst du ich spielewir spielen mal ein zwei runden die fände dass wir war auch aus die fändeauch nicht bin fack ich bin falscher specialist leute ich habe falsche setupes muss ein medik oma spielen medik oma ohne mobility ist in rastumich bin ironside enjoyer oder fack moment mal ich will mich heilenshit hätte drei tricken müssen jetzt du fragst dich warum es überhaupt einenmodus gibt ich denke mal das ist dass man das spiel üben kann weil die davonausgehen dass die leute so schlecht sind dass die auch mal entspannt gegen botspielen müssen wenn es wenn es ist das leiderda komme ich nicht rein all da hier ist ja alles vollfack zu früh ausgemachtshit es hätte klappen können es hätte klappen können ich hätte es vielleichteher von der sauer nice danke die gehen jetzt für den retz da oben da kann ichauch schnell hoch aber von der seite game please das wollte ich doch gar nichtwas was genau hat mich gerade gekillt hat es jemand mitbekommen was was waswas genau hat mich gekilltspielt eigentlich ein menschen herz hat so und wahrscheinlich nichtwüsste auch nicht warum man herz hat so und spielen sollte es hat so nicht so einmodus der macht für zweier übrigens wisst ihr was mit meinem da ist feedbackpassiert ich habe es euch doch letztens vorgelesen die haben ja wirklich dienerven noch nach feedback zu fragen er meinte er hat das noch malgefiltert und manche punkte aufgenommen also es war wahrscheinlich nicht nettgenug was ich geschrieben habe um das an die verantwortlichen badeis weiter zuleitenja verstehen mein wo kämen wir dahin wenn die auch damit konfrontiert werdenwürden dass ihr spiel sagt das geht ja nett also das sind wir uns ja einigirgendwie die realität ist ja aktuell 2021 allgemein nicht mehr hoch im kursyoutube deaktiviert ja auch dislikes nicht ohne grund wir machen jetzt bigbrainmove leute big brainmove next level shit oh oh oh sehr viel nice lassmich weg und tschüss und tschüss nice grappling hook grappling hook enjoyerok pass mal auf pass mal auf alles klar kritik fähigkeiten so das war doch malnice play oder easy hat er mich getbackt oder hat es nur so ausgesehen hat ermir wirklich getbackt glaube ich wissen gar nicht was das istoh nice nicebin mir nicht ganz sicher wo die wo die gegner gerade enjoyenda enjoyen die gegner aber richtig richtig richtige flanke enjoyer sind dashier kommen wir das auch kannpush mich push mich push mich gachi bass was zum was zuder war doch überm schild warum er warum ging da eben gar nichts reinhabt ihr das gesehenverstehe nicht im ortel ja oder war das wieder leck die getter sind ja stimmtdie getter da kann man also richtig durch schießen ist mir auch schonaufgefallenkomisch richtiger richtiger dass ich nicht treff enjoyer no no hit rackenjoyer manchmal geht's manchmal nicht das ist über range so gut oh get fuckedup in the ass over hier mein es v m l l rgenerell ist viel spiel ist rad viel einiges random nicht nur nicht nur diegetter ob es immerhin hier big plane pass bigplane posioh nee hier ist aus hier sauer auf map schitt nicht so gutfuck gut es wusste jetzt nicht von wo der kommt ist das spiel eigentlich sehrenttäuscht oder spiel sehr enttäuschend ich bin mega enttäuscht über dasspiel ist no cuppa wirklich ihr habt wenn man video gesehen hat weiß daswahrscheinlich ich bin ultra enttäuscht über das gamelull pepega emt habt ihr das gesehendenn auch hier ne oder ist das nicht mehr daja wo gehen wir jetzt hin mal zur a würde ich sagen die pusht eigentlich inder regel immer auf art zuerst map mal kurz map check nicht noch check mapcheck alles klar da sind sie slidermann ok auto da war wir nicht hinangel did it again hinter mir hinter mir menschin der ask schuldet wieder hallo die checkens die checkens auch nichtpepega pepega scheibenwischer pepega scheibenwischer richtig aber hatfunktioniert alter 20 jetzt geht aber ab mit dem wichtigen supply trop ja dassupply tropf ist so was von wichtig wichtigstes gadget wichtigstefähigkeit überhaupt man merkt an dem supply tropf ja überhaupt nicht dass esmal ein battle royale oder sowas in der richtung werden sollte ja ich weiß jetztkommen wieder die super krassen historiker die sagen max es gab nochauch schon im battlefield 2 einen supply tropf oder irgendwie sowas in derrichtung meine wirklich die haben das eingebaut weil es es schon imbattlefield 2 gab ich meine es gab in battlefield 2 viele coole sachen diesenicht eingebaut haben manche der supply tropf ist drinne weil dasbattlefield 2 auch drinne ist oder weil das gut wäre für den battle royale oderfür hesser zonen muss battlefield 2 sein muss battlefield 2 dann es lagbestimmt daran dass es den supply tropf auch schon in battlefield 2 gegeben hatalso manchmal frage ich mich echt ob so die so die kommentiere auf youtube undreddit und so ob die wirklich jegliche gehind zellen verloren haben wenn sowas geschrieben wird ok mal gucken ob man da oben drauf kannoh nice da kann man oben drauf nice oh was ist das für komische lag manrichtiger pains pains chamble aber wir haben gleich gewonnen dasschneiber man schneiber man erstmal sprengen in die ecke rein das kann ichnicht kontest mit meiner smg über die range also man hat man hat schon malgewonnen wenn die gegner kämpen als attacker in ihrem spawn das was daskann zwei zwei möglichkeiten haben wenn die attacker im spawn kämpen man istentweder so krass überlegen oder die spawn sind blödich tippe gerade mal auf beides wir sind wir sind besser als die gegnerund die spawn sind dumm das kommt beideswer warum soll ich warum ein zeit wer braucht ein zeit leute wer braucht einzeit wenn er einfach aus der hüfte spray sollen kannwas auch immer ach ich falle auf das schild alter lullok wir haben gewonnen es gibt bloß noch drei gegnerrichtig gesprüht und gebetet mal gucken was ich angeblich wichtiges gemacht habealso 30 kills waren ja nicht wichtig mal gucken was ich wichtiges gemacht habewahrscheinlich wahrscheinlich hipfire kills oder sowas was habe ich wichtigesgemacht hipfire kills endlich gut zu wissenalso das game denkt wirklich hipfire kills ist ganz wichtigkann ich jetzt das kann ich immer im battle battle log profil schreiben 13rekord 13 hipfire kills die musik passt richtig gut dazu finde ich die musik istrichtig richtig richtig kogasrenewales gibt noch bettel oder leider hat man sich dafür entschiedenkein bettel log zu machen leute ich wusste heute ein bisschen muss michmanchmal räuschen wegen trockenem hals aber es ist besser als gestern oder malso an die frage oder vorgestern war der letzte stream war also ich heute ichwusste heute schon weniger und man so weniger hals probleme als im streamvorher oder finde ich auchist schon besser geworden also anscheinend bringt eukalyptus dampfbartund salbei t wasomikron der schweiß jet alles klaraber eigentlich hoch wäre auch zu zu kogas pogas gewesen wenn man hier hochkann was denn da hintenals jetzt schreckt der lv sagt vor dem lv muss man keine angst habenwas mit dir los stelz nicht der stelzer der oberstelzerwo ist denn hier was die gegner kommen wieder gar nicht aus dem spawn rauswated er dacht aberOh fuck, jetzt hab ich mich verschluckt. Ich wurde Hacker-Man.In den Kopf. Ich mag McCree. Leute, im Kern, ich sag's euch, im Kern, das Spiel hat schonmanche Sachen, die cool sind. Also ich mag das Movement hier auch mit dem Köppling undso was. Man kann sich jetzt streiten, ob's Battlefield ist, aber es ist halt einfachso unten nicht zu Ende gedacht. Au. Und die kriegen grad richtig, richtig reingefahren.Richtig reingefahren kriegen sie. Ja, schlau Max, sehr schlau, schlau, schlau von dir gewesen,in das brennende Ding rein zu rennen. Sehr schlau, richtig, richtig Big Brain Poggers.Was, da war noch einer, den hab ich nicht gesehen. Habt ihr den gesehen? Der ist bestimmt dagespawnt. Chat sagt, Battlelog war für die damalige Zeit echt top, hat sich sehr gutmit den Platoons ergänzt. Battlelog find ich heut immer noch top. Könnt ihr euch vielleichtnoch dran erinnern, so wie ich bin. Ich hab am Anfang gegen Battlelog geflamed, weilich gesagt hab, oh ist das dumm, dass man da aus dem Game muss, aber ich bin relativschnell auf den Richter gekommen. Ich mein, ich hab am Anfang auf der Xbox gespielt,ja kein Wunder. Ich bin relativ schnell auf den Richter gekommen, dass Battlelog eigentlichziemlich Poggers ist. Generell muss man echt mal sagen, mit Battlefield 3, die waren ihrerZeit voraus, insofern, die waren halt richtig innovativ und haben was richtig Gutes, Zusammenhängendesgebaut. Was sie danach meiner Meinung nach in der Form nie wieder hinbekommen haben,Battlefield 4 ist natürlich jetzt auch nicht schlecht und auch mittlerweile richtig gutgepatcht, aber nicht zu vergleichen zum Release in Battlefield 3. Die kriegen gerade richtigreingefahren die Gegner. Ich hab nicht gesagt, dass ich Battlefield 3 nicht so gut finde,es ging zum Release, in welchem Zustand die Games war und Battlelog wurde mit Battlefield3 erfunden. Da kannst du sagen, was du willst, die waren ihrer Zeit innovativ, also die wareneinfach richtig innovativ damals. Die Gegner sehen keine Sonne gerade, oder? Die Gegnercampen schon wieder nicht mehr, mein Spring ist kaputt, mein Springbutton funktioniertmal wieder nicht. Manchmal funktioniert auch der Nahkampfbutton nicht, das ist immer gut,wenn man das Tasten einfach mal spontan anbindet. Wackfreies Spiel. Jaja, der LVsack, der kannnicht springen, ich würde gerne springen, aber ich kann nicht springen, weil meine Springtasteanbindet wurde. Seht ihr, wie schlecht der LV ist? Ich kann nicht springen. So painsChamp, so dumm. Ok, nice. Ja, also was war Battlelog? Ich zeige euch, was Battlelog war,während ihr die nächste Runde sucht. Für alle, die sich kennen, Battlelog war ein Browser,also ein Webservice und Browser Addon in einem, wo du quasi Serverbrowser und Profilverwaltungund Progress Tracking, hoops, ich wollte nicht auf Battlefield 1 gehen, ich wollte auf Battlefield3 gehen, im Browser hattest. Und sowas ist einfach im Browser tausendmal besser als inGame, weil Webbrowser und HTML, CSS, JavaScript Sachen ist für sowas einfach richtig prädestiniert.Und du hattest einen Serverbrowser, du konntest aussuchen, was du spielen willst, konntestdanach suchen und hast dann gesagt, ok, ich will jetzt Operation Metro spielen, groß,sehr schön, vielen, sehr schön, bam, join. Dann hat dein Game gestartet und ist direktdraufgegangen. Du hast auch gesehen, was das, du konntest dir auch die Server-Settings angucken,konntest du sagen, aha, Server Rotation, Terran, Highway, Sand Crossing, Metro, Firestorm magich nicht so, Damavant Peak, Hark Island, ok, die haben coole Maps. Du konntest dir sogarRänge anzeigen lassen, der Spieler, mit dem du gespielt hattest. Du hattest eine History,was deine letzten Matches waren, du konntest Leute adden, du konntest dementsprechend auchbestimmen, was du spielen magst und was nicht. Falls du keinen Bock hast auf Hourglass, hättesteinfach Hourglass nicht ausgewählt oder einen Server rausgesucht ohne Hourglass Rotation,Battlelog war richtig nice. Warum die das abgeschafft haben, weil ich glaube, dass Battlelogziemlich schlampig implementiert war und die einfach zu blöd war und es ihnen zu vielWartungsaufwand letztendlich war, weil die mussten ja trotzdem ein Ingame-Menü fürKonsole machen. Konsole hat ja, konnte man eigentlich, ich weiß es gar nicht mehr, Chet,konnte man mit der Xbox über Battlelog, weil man einen PC hatte, mit den Servern joinen?Ging das? Also man konnte sein Profil tracken und sowas im Battlelog, das wusste ich, aberkonnte man Server joinen und Server suchen für Xbox? Ja? Ne, das ging nicht, oder? Ichspreche übrigens da einfach mal sinnlos rein, ich denke, dass ich was kill. Ne, ging nicht,ne? Max hört sich mit dem Mic an, wieso, stimmt was mit meinem Mikrofon nicht? Ichglaube, ich bin ein bisschen heißer oder so. Auto-tune. Oh shit, ich wollte da hoch. Ja,es haben damals viele geheult bei Battlelog, das stimmt, weil das was Neues war und wiedas so ist, bei neuen Sachen wird oftmals erstmal rumgeheult, aber es hat sich dannrelativ schnell, also eigentlich so nach dem ersten Monat oder so gelegt und die Leutehaben Battlelog gefeiert, ich auch. Ich auch. Ich habe am Anfang auch gesagt, ich findeBattlelog doof, dass du nicht mehr im Game den Browser hast und sowas, aber ich bindann relativ schnell auf den Dichter gekommen, dass Battlelog schon ziemlich nice ist. Diehätten eigentlich richtig gut das ganze ausbauen können. Stellt euch mal vor, die hätteneine API und eine Pluginschnittstelle für Battlelog gemacht. Wisst ihr, wie geil dashätte werden können, wenn du quasi Custom Plugins für deinen Server oder deinen Squadoder so erstellen könntest, wie auch immer, was man da mit machen könnte. Das wäre richtigPOG gewesen. Alter, wer hat dieses Innending hier designed? Ich weiß gar nicht, wo esruntergeht. Ah, hier. Ich bin gerade 30 FPS-Enjoyer, weil es laggt. Warum ruckelt das so im Hintergrund?Warte mal, ich muss es hier mal zumachen. Runtermachen, Browser ausmachen. Warum ruckeltdas gerade so? Könnte Explosive gar nichts geplantet haben. Oh. 7 TV, 7 TV habe ichnicht aktiviert. Max, willst du mitspielen? Oh ja. Bam, wo ist er? Nicht on. Also so 3-4Runden machen wir noch, weil dann ist 22 Uhr und ihr wisst, was 22 Uhr ist. 22 Uhr istschon spät. Schon spät. Boomer schlafen, schon spät. Wo ist die Treppe? Oh shit. Oh,oh. Oh, oh. Alter, das laggt ja mal so krass gerade. Nein, ich will, ich will ihn nichtretten, ich will diffusen, man. Das Spiel, nein, nein, nein, nein, nein. Du diffusstjetzt nicht, du rettest jetzt erst mal. Oh, da unten geht gut was ab. Oh, da ist. Fuck.Alter, hier geht was, hier geht, hier geht gut was ab. Ich brauche meinen Motionball.Was ein bescheuerter Soundeffekt. Ball, nein, nein, nein, lass mich nur. Alter, es ruckelthier. Leute, falls es bei euch ruckelt, es ist nicht nur bei euch so, es ruckelt hier.Was ist das denn? Warum ruckelt denn das so? Ich glaube, das ist die Map. Ich habe geradegefühlt 30 FPS. Ich glaube, das ist Memory Leak. Man muss das Spiel ja öfters mal neustarten, weil es Memory Leaks hat. Nein, da wollte ich nicht hin. Oh, oh, ich glaube,jetzt wird geplantet. Also, Max, keine Ahnung, ob du mitspielen willst. Ich weiß, ich habees gerade nicht gelesen, aber wenn du mitspielen willst, kann ich dich nach der Runde entweiten.Nee, nee, an den offenen Chrome Tabs liegt das nicht. Jetzt hat er die Runden vorherauch nicht geruckelt. Ich glaube, das ist einfach huge. Ein nice Memory Leak. Gut, sonice ist das nicht, aber es ruckelt. Obwohl ich angeblich 90 FPS habe, das fühlt sichüberhaupt nicht an wie 90 FPS. Was ist denn jetzt los? Warum ist die Map auf einmal kleinergeworden? Ah, weil die es gesprengt haben. Ja, das war vorher auch nicht so. Das istauch eine dumme Implementierung. Ich kann kaum noch um die Ecke laufen, so sehr ruckelts.Nee, das ist ja mal ganz pains jambig. Der Battlelog Bitcoin Miner. Ja, ich habe ja sogarschon das Battlelog wieder zugemacht im Hintergrund. Ihr habt es nicht gesehen. Also, ich startenach der Runde neu das Game. Ich hoffe, ich bin so schnell, dass ich wieder reinkomme.Mal gucken, ob es hier jetzt geht. Nee, es ruckelt auch noch. Fuck man, wie kann dasso kaputt sein? So ist es nicht gedacht. Eher gedacht, dass die uns hier abfarben könnenvon der Seite. Auch nice. Guck mal da. Hallo. Wo kommen sie hier? Massive Spray. Das istübrigens auch wahnsinnig gutes Design hier. Einfach mal offenes offenes Dünenfeld. Achtungdamit. Ist das die Shotgun Leute? Ist das die? Ist das die Shotgun? Die mich da geradegekillt hat? Ist das diese angebliche One Shot Shotgun? Nee, das nicht. OK. MonkaS. MonkaS.Alter. By the way, warum ich nicht geaimt habe, ist folgendes. Ich dachte mir, es istbesser in Bewegung zu bleiben, anstatt anstatt ins Iron-Sein hoch zu gehen. Aber gut, manist nachher immer schlauer. So einen Rats wäre mega poggers, falls wir einen kriegen,ich glaube nicht. Die awnen die gerade. Guck mal hier. Ich glaube die bashen die gerade.Na ja nice. Medic Oma. Nein, du musst mich ratzen. Mich. Nice. Nice. Guck mal, du schaffstes überhaupt nicht zum M kommen, bis das gelegt ist. Es bringt nichts, da muss ichgar nicht hin. Ich schaff es nicht bis dahin. Es ist sinnlos überhaupt dahin zu rennen.Die Zeit des M-Coms genügt nicht, um einmal über die Map zu rennen. Depega Style oder?Das ist das. Ist es das oder nicht? Das geht oder Panzer?Pants Man fährt im Kreis da oben. Oh, der Pants Man. Oh, gerade noch weggekommen.Okay, jetzt müsste ich halt wissen, wo die sind. Hier ist nichts mehr. Okay, wir solltenmal zu B. Wir sollten mal zu B. Alles klar. Game. Sehr gut. Du bist in meiner Lobby.Gegnerteam oder mein Team? Wir haben es. Nice. Es ist übrigens auch sehr irritierend, dassdie Gegner noch was sagen, wenn sie schon tot sind. Da denkst du immer, da ist nocheiner, da bist da gar keiner. Sehr, sehr, sehr viel undurchdachte Dinge. Vielleichtkönnen wir ihn rausschießen. Pass mal auf. Das ging am Anfang. Am Anfang ist der CrabblingHook quasi durch, durchgegangen. Zumindest sollten wir nicht im offenen laufen, solangeder Healy hier rumstellt. Oh, oh, der Pants Man. Nichts wie weg. Oh, get fucked up indie Hose. Ich glaube, die sind, wir müssen mal so einen Tier Ranking von den Waffen machen.Im Prinzip ist alles die Tier, bis auf ein paar die sind ganz gut. 74 ist ganz gut. 24ist ganz gut. 9 30 ist ganz gut und die DMS ganz gut. Ansonsten kannst du den Rest eigentlichmehr oder weniger vergessen. Wie sind die noch hier? Nee, das kriegen wir nicht. KeineChance. Ich habe dich schon zweimal gekillt. Ups. Machen wir es so, machen wir es so. Wennich es noch, wenn ich es nicht schaffe, fünf Mal zu killen, dann kriege ich dein Prime-Sub.Wobei, nee, nee, nee, das ist ja blödsinn. Das ist ja gar kein Anreiz. Das ist ja garkein Anreiz. Wenn du es fünf Mal schaffst, mich zu killen, dann kriege ich dein Prime-Sub,weil so gewinne ich immer irgendwas. Das finde ich eigentlich einen sinnvolleren Ansatz alsumgedreht. So hat jeder was. Du hast den Win und ich habe den Prime-Sub. Oder umgedreht,ich habe den Win, du kannst den Prime-Sub behalten. Ich finde, das ist eine gute Idee.Das sollten wir öfter so machen. Ey, by the way, auch noch was. Wer bei DICE diesen Granatwerferdesignt hat, der gehört gekickt. Das ist die most useless Waffe im gesamten Spiel. Oh,guck mal, da wird geteabacked. So, jetzt wird es hier schwierig, wir müssen darüber. Wosind denn die M-Coms hier überhaupt? Hier ist das M-Com, okay. Oh, die sind schon amStart. Hier ist keiner. Ich muss hier durch, der Heli basht mich sonst. Alter Webster,heile dich doch. Hier geht es aber gerade rund drin. Ist Webster Premium? Guck mal,das ist ein Up-T-Back, null. Webster ist Level 15, du musst das anloggen. Wie gesagt Max,ich kann dich entweiten, wenn du am Start bist. Ist er aber nicht. Enemy Forces. Er spieltsich wirklich wie 30 FPS, Leute. Das Memory Leak kickt gerade richtig rein. Man sieht eswitziger, weil es an den FPS nicht. Aber es ist so, ich merke es. Es rockelt und lecktas fuck. Okay, nice. Von der Seite. Du hast mich geteabacked, das ist doch nice. Wer mages nicht, geteabacked zu werden. Hyper Gachi. Letzter Base. Leute, danach mache ich nochein, zwei Runden und dann muss ich mal sowas von trinken aufs Klo. Pe-Pu-Pu-Pu machen.Alles klar, Game. Alles klar, alles klar. Gibt es eigentlich in Warzone aktuell auchrichtige OP-Waffen? Ist jemand da so im Warzone-Game, Warzone-Meta? Irgendwie drinne gerade. Nice,diese Waffe ist auf Range top. Gibt es die nicht immer? Doch. Aber ich weiß nicht welche.Welche ist dann gerade OP in Warzone? Ich habe nämlich tatsächlich mir überlegt, obich nicht, wenn diese Pazifik-Karte rauskommt, ob ich mir nicht echt noch mal Warzone gebe,weil Battlefield, ich spiele aktuell relativ viel Halo, was auch mega Bock macht, aberBattlefield kattet es dieses Jahr halt einfach nicht so für mich. 187G. Ja, ich habe dochjetzt eine extra SSD, da kann das drauf. Die drücken aber gut die Gegner. Die drückengut, Gatschi-Buzz. Auf geht's. Aber da gehe ich nicht runter. Okay, ich muss rüber. Wennich nicht rüber gehe, das macht keiner. Game, Mann. F***, Alter. Guck mal, wie viele stehen.Ne, keine Chance. Du, du, du. Du, du, du, du. Ich muss das Spiel neu starten, weil es lecktwie Sau. Petel, du kannst ja, wobei, ne, wir gehen raus, wir suchen danach neu, vielleichtkönnen wir noch mal ein bisschen Attacker spielen. Ich habe jetzt genug Defended. Lull, das reicht.Wir haben es eh verloren, ich starte mal schnell neu. So, play. Das hat wirklich so heftiggeleckt gerade. Siehst du das kritisch mit dem Colonel Treiber für Anti-Cheat? Tja,schon lange, aber ich verstehe die Notwendigkeit. Also, das ist ja so easy Anti-Cheat und wassonst nicht noch alles gibt. Ach, ich habe Display. Leute, habe ich die ganze Zeit schonDisplay Capture. Der Stream muss doch geleckt haben wie Sau. Oder hat er nicht geleckt?War gut. Hä? Dann verstehe ich es nicht. Aber das Lag in Game lag nicht da dran. Dasist schon mal klar. Das liegt an diesem komischen Memory League in Battlefield. So, Social. Ach,das ist das Game. Ja, es ist auch das Game. So, vielleicht sind wir jetzt noch mal Attacker.Da habe ich jetzt Bock drauf, noch mal eine Runde Attacker. Noch zwei, drei Runden Attacker.Das wäre noch mal Pock. Ja, bei mir laggt es auch. Es gibt zwei Sachen. Wenn das Spielzu viel CPU zieht. Mal gucken. Wenn wir nicht Attacker sind, suche ich neu. Dann laggt esim Stream, weil das irgendwie mit OBS nicht hinterherkommt. Und wenn es für mich laggt,ist es aber immer eine Game-Geschichte. Wenn es für euch laggt, ist es vielleicht aucheine OBS-Geschichte. Aber höchstwahrscheinlich eine Game-Geschichte. Sind wir Attacker? Wirsind, wir sind, wo sind wir denn? Defender? Nee, Leave Game. Exit. Dieser Fisch? Dankeschönfür den Sub. Bist du dieser Fisch von YouTube? Von vor ein paar Jahren? Oder bist du einfachnur zufällig dieser Fisch? Bist du dieser Fisch, wo ich mit dem mal mit Kaboom mit zusammenAll You Can Eat stellst? Fressen war in Frankfurt. Genau der. Nice. Du bist eindeutig. Es gibtso manche Sachen, die können nur die Leute. Alter, Game, come on. Es gibt so Sachen,das wissen nur die Leute, die dabei waren. Der Goldcock, genau. Yep, Yep, Goldcock.Ist auch so hängen geblieben. Jawoll, please Attacker, lasst mich noch 2, 3 Runden Attackerspielen bis 22 Uhr. Attacker, Preyge, Leute, Preyge, Preyge, Preyge. Attacker. Preygege,Prey, Prey, Prey, Prey, Preyge hat funktioniert, Leute. Es hat funktioniert. Preyget, Preyget.Sag mal, fehlt, sag mal, fehlt dem Crapling Hook der Lauf, wenn der so rennt? Der fehlt,guck mal, der fehlt, der fehlt der Lauf vorne, oder? Oder nicht? Oh man, Game, please nichtdrum baggen. Tango down, Tango, Tango, Tango, Tango, Tango down. Tango Sucker. Lul, wiees erst nicht registrat hat. Oder habe ich nicht getroffen? Wahrscheinlich habe ich beides.Es hat nicht registrat und ich habe nicht getroffen. Gehe ich mal von aus, war wahrscheinlichbeides fail. Ah, fuck. Der Frontgriff steht einfach nur vorne. Ja, das dachte ich aucham Anfang, aber dann passt die Ansicht, wenn man die Waffe normal hält, nicht? Guck, guck,der Frontgriff ist da unten, also der, oh Gott, jetzt ist ja gut, man. Dann würde es nichtzusammenpassen. Oder, oder ich, oder meine Augen haben einfach nicht die richtige Perspektive.Der Yolos, wir spielen gegen den Yolo Swagger. Ich glaube, wir können eigentlich gar nichtgewinnen. Sag mal, da fuck. Wie soll man gegen den Yolo Swagger? Der Fisch Nummer drei hatauch Subscribed. Danke, danke. Wie soll man gegen den Yolo Swagger dann auch gewinnen?Das ist eigentlich impossible. Impossible. Yolo Swagger. Fuck man, in the ass, von unten,ah, da kann man durchgucken. Das wusste ich nicht, dass man nur durchgucken kann. Daswar pepega dumm. Da machst du nichts, aber wenn wir Glück haben, können wir auf demDach neu spawnen. Jawoll. Poggers Spawn, auf dem Dach. Okay, das wird so nichts. Vielleichtsollte ich mal, vielleicht sollte ich mal ein paar Rauchgranaten mitnehmen. Ich habe dasGefühl, Rauchgranaten könnten tatsächlich echt was bringen in dem Fall. Ja, unser PoggersSpawn ist noch am Start. Was ist denn hier Rauch? Hey, fuck.Ich warte jetzt, bis sie diffusen.Shit. Ich meine, es war gut gedacht.Es war gut gedacht, das müsst ihr zugeben.Mann, game please. Was trifft mich hier eigentlich? Chat, was trifft mich? Was trifft mich?Ich verstehe das Spiel nicht.Die Löschanlage. Oh ja, das war wichtig einzubauen. Nichts in dem Spiel funktioniert, aber Hauptsache,die Löschanlage klappt.Das war enorm wichtig, das zu implementieren. Funktionierte Löschanlage. Pogger. Fuck,Uni leer. Gerade mal andere Ansichten gegoogelt, alles okay. Okay. Nee, nee, ich meine dasnatürlich ernst. Das ist schon wichtig. Ich meine, man weiß es ja in so Lagerhallen,dass die Löschanlage funktioniert. Das ist eigentlich essentiell.Ach, wir müssen B noch holen. Ich noob. Ich dachte, wir haben es schon. Das Spiel istso kaputt, guckt euch mal. Hallo. Funktioniert halt mal. Oh, von hinten, von hinten, vonhinten. We got fucked up in the ass over here. Ich hab den links gesehen, by the way.Oh, hier ist ja gar nix. Hier ist ja gar nix. Wo müssen wir denn hin? Wo müssen wir dennhin? Wo sind die obendrauf, oder? Die K30 sinkt richtig rein. Du hättest nicht gedacht,dass ich noch existiere. Naja, so alt bin ich jetzt auch noch nicht. Ich bin zwar alt,aber so alt auch noch nicht. Also ich bin noch nicht unter der Erde. Kettner stelltja 85 plus. 85 plus. Battlefield Opa FPS bei Wilhelm Kramer 2.0.Kennt noch jemanden, Wilhelm Kramer LP? Das ist klar. Weiß gar nicht, ob es hier nochgibt. Wo die Leute früher gesagt haben, das ist bestimmt Kollege. Ich dachte mir so immerschon seit der Zeit total hängen geblieben, Leute. Warum sollte es Kollege sein? Der hatbesseres zu tun, als Wilhelm Kramer LP auf YouTube zu machen. Aber gut, die Leute aufYouTube haben schon immer viel Stuss erzählt, wenn der Tag lang ist. Also eine wirklichgute Range Waffe ist das nicht. Halber Skandal, das kann echt der Opa war. Ja, die Leutesind auch richtig hängen geblieben. Ich meine, das war klar, dass es weder Kollege ist, nochdass es ein richtiger Opa ist. Also keine Ahnung. Es gibt schon nicht so high IQ Leuteauf YouTube. Was ist deine Meinung zu dem neuen Battlefield? Ich bin schwer enttäuscht.Ernsthaft jetzt. No Copper. Ich kann es jetzt Video zu angucken. Ich bin wirklich schwerenttäuscht von dem Game. Unfertig, undurchdacht. Bugs ohne Ende. Wobei die Bugs ganz ehrlich,die Bugs sind nicht mal mein größtes Kritikpunkt. Mein größter Kritikpunkt, dass es einfachkein richtiges Battlefield mehr ist und so undurchdacht ist an vielen Stellen. Kannman da oben drauf Big Brain? Kranstells? Nee, hat nicht funktioniert. Wo ist der denn?Ohne Granate. Bäm, Bäm, kaputt. Oh, das ist ganz schlecht für mich hier. Ganz schlechtfür mich. Okay. Pass auf, Yolo, Yolo, Yolo, Yolo.Okay, jetzt ein Motionball hin. Okay, hier kommt nix. Game, komm on, funktionier halt.Game, funktionier please. Was, was, was ist mit dem Spiel los? So broken. Oh shit. Alsonormalerweise sollte mich der Crabling hoch oben aufs Dach ziehen. Anstatt dreimal hintereinandernicht zu funktionieren. Oh sorry, ich hab nicht gesehen, dass du mich retzen willst.Released. Wie nennt man das eigentlich? Released ist noch so dark, MMO, Jargon. Wie nennt mandas eigentlich offiziell? Wenn man, also Chet, wie nennt man das, wenn jemand dich retzenwill, aber du respawnst schon so schnell, bevor er dich retzen kann. Gibt's da irgendwieein tolles, tolles englisches Anglizismus Wort für? In dark hat man dazu gesagt released.Oh, I got shot in the ass over here. Dafür gibt's den Wort, nee, nee, respawn ist jadas eigentliche, wie die erscheinen auf der Map. So dieses, oh, dieses zu früh, zu frührausgehen. Da muss es, da muss es ein richtig krasses Anglizismus Wort für geben und daswill ich benutzen. Early, ähm, da brauchen wir irgendwas für, Leute. Da brauchen wirirgendwas für. Irgendwas. Okay, das war zu mutig. Gibt's Leute, die Hexazone spielen?Nö. Ich glaube Hexazone spielt keiner. Ich hab zwei, drei Runden gespielt für dieseDice Promotion bei mir auf dem Channel. Ansonsten ist es glaube ich dead. Und wenn es nichtfree to play wird und auch sehr, sehr, sehr viel Liebe bekommt, wird's auch dead bleiben.Deadge. Oh, einer, der sich nie aus der Hüftehals sprechen lassen. Sunnybaited, das findeich gut. Early Sunnybait. ESB, Early Sunnybait, das finde ich gut. Wir brauchen mehr Anglizismen.Ich benutze schon, ich benutze schon viel zu wenig englische Wörter. Sagen die Leuteja auch auf YouTube immer unter den Videos. Die sagen, Junge, was laberst du? Sind abereinfach nur zu noob, high IQ speak zu verstehen. Äh. Ich habe jetzt keine Ahnung, wo hierwas ist. Ich weiß nur, dass ich einen Motion Sensor brauche. Alter, guckste dir an. DieTypen mit ihren Panzerplates. Guck mal hier, die halten gut. Die, die, die halten volldagegen. 33 Tickets nur noch. MonkaS, wir verlieren die Runde ja vielleicht. Was istdenn hier los? So geht es aber nicht. Wir können, wir können nicht einfach losen. Guck mal,guck mal, der LLV, der LLV ist so schlecht, man. Habt ihr gesehen, der LLV, der ist sorichtig, also so schlecht kannst du gar nicht sein, wie der LLV ist. Ich möchte jetzt ungernda als erstes vorstellen. Achtung, bunnyhop, volle Pulle, bunnyhop, jawoll, excellent, excellentund jetzt hoch, jetzt hoch. BigBrain stellt's, auf geht's. Da oben erwartet mich jetzt,nein, nein, nein, nein, nein, nein. Shit, shit, shit, shit, shit, shit. Okay, versteckenund einen heiligen Corona Booster reindrücken. Oh, da kommt, oh fuck, in the ass geshootet.Sag mal Max, werden heutzutage noch in der Zukunft Linux Adminen? Ja, klar. Ich hab erst,ich hab erst mit einem Kollege telefoniert am letzten Arbeitstag, der irgendwelche StorageGeschichten bei uns gemacht hat, der geht jetzt zu einer anderen Firma, lustigerweiseauch zu einer anderen Bank und macht dort Linux, weil die interne Linux Leute gesuchthaben, was ich richtig cool finde, dass es das noch gibt. Alter, der hat ja mich ernsthaftgerade noobtubt, hat er mich noobtubt? Oh, oh, massive res. Foff hochstellen, nee, ichkomm mit hohem Foff, lustigerweise, oh, oh, oh, oh. Ich komm mit hohem Foff in diesemBattlefield 3 nicht klar. Ich glaube, ich hab, was hab ich, 90er oder 80er Foff? Ichglaub 90er, ich komm mit, ich komm mit mehr Foff nicht klar. Sehr merkwürdig, ich weißnicht, woran das liegt. Vielleicht, vielleicht Performancegründe oder so. Ich fände esnice, wenn mein Craplinghook ready kommt, dass ich da hoch kann. Nee, das hat jetztaber, das war schwere Geburt, schwere Geburt. Alter, da ist ne Muni-Kiste, da muss ich hin.Ich brauche Muni. All dies unten. Geht es noch jemand so, dass ihr gar nicht, dass mangar nicht richtig erkennt auf der Map, ob es ne Muni-Kiste ist oder ob es ne Medic-Kisteist? Was ist das hier vor mir, Chat? Ist das ne Medic-Kiste oder ist das ne Muni-Kiste?Ich erkenne es irgendwie nicht richtig auf der Map. Massive-Range-Waffe. Muni? Medic,was denn jetzt, Chat? Ich sehe es, ihr seid euch auch nicht einig. Ich bräuchte mal, bräuchtemal ein bisschen Munition. Ich bräuchte noch mehr Munition. Ist der hier oben drauf?Er muss da. Oh, oh. Bam! Voll in die Fresse. Sollte ich eigentlich ein bisschen Ammo droppen?Ich mag das Movement mit Webster wirklich. Es kann nicht alles doof in dem Game. Aberder Rest ist halt so. P-P-P-P-Pega. Pega. Oh, ich hab immer keine Motion-Sensors, ichhab Smoke immer noch. Passt mal auf, geht das? Ich hab gedacht, man kann sich da vielleichtdran schießen. Geht doch! Geht doch, manchmal geht das. Das war wahrscheinlich einfach zuweit weg. Oh Gott, P-P-Pega. Zwei Leute, die nicht aimen können unter sich.Das war ja richtig hängen geblieben, Alter. Zu geil eben. Aber wir haben's, wir haben's,wir haben's. Richtig P-P-Pega aimt alle beide und sich dann gemessert gegenseitig.Okay, ich darf nicht wieder. Oh, oh. Ach, da kommt noch ne Base. Ist das die längsteRush-Map? Kann das sein? Oh nee, das sind immer vier, ne? Bin verwirrt. Da oben ister noch. Ich hoffe, der Pantsman sieht mich nicht. Der müsste hier oben, wir sind überhauptnicht clear, was der Ansager wieder für'n Shit erzählt. Wir sind definitiv not not clear.So, wir nebeln den Dude jetzt einfach mal ein. Pass mal auf, big brain play. Wir nebeln denjetzt ein und jetzt sieht uns natürlich keiner. Und stellts ihn hier hoch, so muss das sein.So magisch das. Way too smart. Way too smart. Wie das? Work smart, not hard. Ach, da geht'snoch höher. Oh, nicer, nicer. Klitschspot. Passt mal auf, wir boosten uns da jetzt hoch.Komm her. Big brain mode activated, Leute. Und jetzt noch eins weiter, noch eins weiter.Ja. Oh man, das gibt's net. Was macht der Dude? Was macht der da? Warum ist der da?Was macht der denn hier? Keine Sau sollte hier oben sein. Streamsniper, Leute, Streamsniper,wer ist es von euch? Wer ist es von euch? Jetzt zu. Warum sollte der Typ sonst hier obensein? BP gar elmt, richtig krass.Nee, nee, nee, noch mal, noch mal geht hier, geht hier nix.Einen haben wir da. Alle weg. Au, war auf mich zu schneiden. Oh fuck, in dem Moment, wo ichruntergehe, kommen die hoch. Dumm. Die Musik ist richtig paper please, ja. Dustin, dankefür den Sub. Wir sollten es schaffen, denke ich. Wir brauchen nur noch A. Oh, da warenganz schön viele. Wenn man jetzt Trick 17 stellt. Get rekt. Tyrannosaurus rekt.So macht man das, Leute, so macht man das. Fatal, ich hole dich. Nein, Fatal, ich holedich nicht. Ich kämpfe jetzt hier, weil wenn das kaputt geht, Hände hoch, Wochenende, jawohl,Bam. Wochenende, Schwachsinn. Dummes Gelaber, aber easy win easy win. Anstrengend. Too easy.Wisst ihr, diese Cringe Sprüche, die hätten richtig, also es gibt zwei Varianten, entwederdie hätten halt so realistisches Battlefield Zeug machen müssen, so irgendwie so MilitaryTalk, wisst ihr, das hätte funktioniert, oder die hätten so richtig in die Elite Eckegehen müssen. Der Typ hätte einfach sagen müssen easy as fuck oder irgendwie sowasam Ende. Eats AF oder irgendwie sowas. Das wäre schon so übertrieben gewesen, dass esdie Leute gefeiert hätten. Aber so dieses nix halbes und nix ganzes Cringe Sprüchesind halt Cringe. Also genau, der hätte entweder easy as fuck sagen müssen und einen Backflipmachen, so richtig voll übertrieben. So Bad Company 2 Style nur noch heftiger. Oder siehätten halt irgendwelches Military Speak machen müssen. Jens Kappa ist bei uns. Na,da kann ja eigentlich nix, Jens Kappa ist raus. Da kann eigentlich gar nix mehr schief gehen,aber so. So, wo geht man rein? Auto? Ach, man muss Sponsor nur für das Auto, ok. VollePulle B, Volle Pulle B. Gib ihm. Es ist auch Cringe, dass wir schon legen können, bevordie Defender richtig da. Wow. Oder kommt einer von der Seite, der killt mich gleich. Pack,das war mir zu viel. Oder das Gelaber ganz einfach weglassen. Das wäre auch eine Möglichkeitgewesen, das Gelaber einfach wegzulassen, ja. Und das komplette Auto wegzulassen. Denn,genialer Spawn. Denn das Gelaber braucht, wenn man ehrlich ist, kein Mensch. Oh fuck, dachtemir, es wird noch was. Warum spawne ich Dreck unter mir? Ok, das sind mal Gegner, die Widerstandleisten, wie es aussieht. Zumindest etwas. Oh shit, jetzt bin ich down. Fuck. Oder auchnicht. Fuck. Warum ist die nicht umgekippt? Der Pressart. Der Pressart hat mich geschreckt.Das wäre noch viel schöner, wenn hier unten auch ein bisschen was abgehen würde. Sehrgut durchdacht, wieder Dice. Ey, what the hell. Funktioniert ja richtig gut. Ok, das sinddefinitiv mal Gegner, die Gegenwehr leisten. Da müssen wir was machen. Am besten direktmit dem LLV drüber fahren. Wobei der LLV macht ja keinen Damage an Infanterie, habeich ja vergessen. Massive, nicer Spawn. Irgendwo ist doch hier nur einer. Wo sind sie denn?Oh, da oben. Oh, Alter, jetzt haben sie aber von allen Seiten Attacks dort.Spielst du auf hohen oder niedrigen Grafikeinstellungen? Ich spiele auf den niedrigsten Grafikeinstellungen,die es gibt. Und warum ich jetzt sogar noch ein bisschen mehr FPS habe liegt daran, weiles 16 vs. 16 Rush ist und 16 vs. 16 ein bisschen mehr FPS hat als... Warum man sich gedachthat, das ist eine gute Idee, dass die in unseren Spawn schießen können und wir in ihren Spawnnach der nächsten Base. I don't know. Horge. Horge erst. Ich will da nicht als erster rein,ehrlich gesagt. O-oh. O-oh. Beringer. Fuck. Please sterben.Alter, die sind ja überall. Seht ihr mal, wie schlecht der LRV ist? Habt ihr das gesehen?Progress, Progress. Fuck. Die sind auf Zack, die Gegner. Das merkst du sofort, wenn duauf Zack kommst. Dann ist das halbes ESL-Match. Direkt auf Zack. Vielleicht kann ich da Spawnsollen? Sollte man nicht hier eigentlich drin Spawn können? Okay, jetzt haben wir ein Problem.Wenn der Angriff nicht klappt, haben wir gelitten und ich glaube nicht, dass der klappt.Wir sind auf Zylinder-Driving. Orgas. Exquisite-Driving. Nicht am fucking Felsen hängen bleiben,aber das ist die Runde. Richtig hart geschwitzt ist die Runde. Es ist aber auch nicht richtigbalanced. Mal rasiert man, mal wird man rasiert. So ist es halt, Leute. Und ich sage euch,so muss es sein. So muss es sein. Diese ganze Skill-Base-Matchmaking-Scheiß. Ich habe keinProblem, wenn ich manchmal auf den Zack kriege. Aber so dieses permanente 50-50-Zack-Teil einfach.Moment. Chat, was geht ab? Hallo. Jetzt, da ich endlich mal den Stream erwische, wennes nicht gerade zu Ende geht. Ja, Pech manchmal. Wie ist die Performance vom Battle? Schlecht.Immer noch schlecht. Immer noch schlecht. Die wird nicht besser sein. Muss die ja keineHoffnung machen. Wisst ihr was auch witzig ist, dass die in ihren ganzen Patch-Geschichten,oh, Hauer Class, come on. Dass sie in ihren ganzen Patch-Geschichten nichts zu Performance-Improvementswirklich sagen. Warum man sich beim Liegen im Aim nicht bewegen kann, weil das die Noobsüberfordert. Du kannst doch nicht die Noobs überfordern. Die müssen sich Skins kaufen.Das geht aber nicht. Stell dir mal vor, die müssen eine Taste zum Hinlegen drücken undkönnen noch während dem Liegen links und rechts robben. Nee, das geht nicht. Das gehtnur wirklich nicht. Das kannst du nicht machen. Das kannst du nicht bringen 2021. Legacy Feature,das geht nicht. Ja, so sieht es aus. Legacy Feature. Dieses Bunnyhop, das finde ich tatsächlichganz witzig. Jetzt geht es Omikron am Start. Alter, Monarch S. Ich habe die Gegner gesehen.Ich hoffe, die nehmen mich nicht.Ich höre die ja diffusen. F***, das ist zu viel. Alter, ich bin gerade voll am sterben.Alter, ich bin voll am abkratzen. Mit wieviel DPI? 800. Ja ja, Omikron, jetzt vorbei. Gibtes das eigentlich in Hessen schon? Hat Hessen schon den ersten Fall? Hoffe ja nicht. ObjectiveAlpha. Jetzt pass auf, richtig krasse Stells Action. Riechtiger, richtiger Five-Hand-Stell.Wir stellen uns von der Seite rein. Hallo, Digger Sack. Ich habe nichts gesagt. Ich dachte,Big Brain Play, dabei haben die mich outplayed. Fluffykick sagt, er findet die Maps so hässlich.Ja, da bist du nicht der einzige. Ich finde die Map nicht nur hässlich, ich finde dieMap auch schlecht zu spielen. Das ist ja die fatalste Kombination. Schlecht zu spielenund sieht kacke aus. Alles dead? Alles dead? Und Scheiben. Lohnt sich das Game nach? Nein,das ist glaube ich die häufigst schnellste Frage, nicht nur des Tages, sondern der ganzenBattlefield Streams. Nein, das Game lohnt sich vor den Patches nicht, das Game lohntsich auch nach den Patches nicht. Und ich gehe mal davon aus, das Game wird sich einesehr sehr lange Zeit nicht lohnen, wenn überhaupt, jemals. Ich sage es euch, wie es ist. Ichhabe kein Interesse dran, irgendwie hier was zu sellen, was nicht... Wozu auch? Kriegeich immer Geld für. Wenn mir DICE irgendwie 2000€ Monatsgehalt als Battlefield Anpreiserbezahlen würde, ja gut, dann erzähle ich alles mögliche. Aber was willst du machen?Aber ansonsten, sage ich was Sache ist. Ist Rush jetzt für kurze Zeit Standard? Das weißich nicht so genau. Es ist eine dieser angebließenen Playlists, was im Prinzip heißt, es könntejederzeit rausfliegen, aber ich bin mir nicht sicher, ob es dazu ein Statement gibt. Solltendie Rush rausschmeißen, das ist das dümmste, was sie machen könnten, weil Rush ist daseinzige, was sich in diesem Spiel halbwegs spielenswert ist. Jaja, jaja. Achtung, wirmachen jetzt Schildstells. Schildstells. Hätte ja funktionieren können. Location Revealed,oh nein. Meine Location ist Revealed. Da machst du nichts, da muss ich jetzt eigentlich gleichraus. Da bin ich gleich heim. Übrigens auch so ein Ding, in alten Battlefields bist duin der gleichen Pose gespawnt, wie der Typ, bei dem du gespawnt bist, wisst ihr was ichmeine? Alles klar. Hier nicht. Oh, Pogas Ratz, Pogas Ratz. Nein, nicht Pogas Ratz. PogasRatz, noch mal ein. Zwei Stück gehen da nicht. Oh, nice, nice, nice. Ein Spawn Beacon. Jawoll.Beacon. Alter, wie soll man denn hier durch, wie genau hat man sich das bei DICE vorgestellt,an dieser Stelle? Was ist da jetzt so, was ist der, was ist the way? Was ist der Plan?Ich war hinter der Säule. Es gibt kein TDM in All Out Warfare. Nein, All Out WarfareTDM finde ich ist echt eine gute Idee. Die müssten die Maps glaube ich trotzdem einTicken kleiner machen. Ihr habt eine Panzer hier, ich sehe nicht, irgendwo hier stellstherum da. Ja, wunderbar. Ich spreide jetzt einfach nur wild rein. Sieht doch schon malviel besser aus. Das sieht doch schon mal viel besser aus jetzt. Alter, kannst du dichmal heilen? Pippo Fett, Webster. Was? What the fuck? Hit Detection please, come on. Warumwar die nicht tot? Es ist einfach wieder die Hälfte durchgeflogen. Anders kann ich mirdas nicht erklären. Ich habe jetzt so viele gekillt. Da muss doch jetzt mal irgendwie,da muss doch jetzt was gehen hier. Bam, bam, bam, auf geht's. Durch hier, durch, next,fuck. Ist ja sehr nett. Oh ja, tolle Idee. Da ist ein Auto. Ich fahre keinen Panzer,was sag ich? Rein da. Rum, rum, rum. Monkastier. Monkastier. Vielleicht haben wir Glück. PaarLeute sind da, wir gehen eher dahin. Wir gehen eher dahin würde ich sagen. Weil da habenwir noch paar Monkastiers am Start. Okay, kann ich mitleben. Geht ja nicht. Du wartestmich am M-Kombi da. Nice, nice, das ist ein guter Plan. Ich würde auch nicht einfachso rein sporen und 3 Stunden rennen. Warum auch? Nice, die lege Henne ist on air. Wasmacht der hier? Was ist er hier am Doen? Aus dem Fatal Fast zu Killen. Dich Killen. StreamSchneiber. Ich muss, geht nicht anders. Alles immer Stream Schneiber. Oh, die diffusen,ich habe nix gesehen. Dumme Kacke, wenn es nicht richtig funzt, was es eigentlich funzensollte. Aber dadurch, dass ich jetzt eingesmoked habe, habe ich glaube ich, haben wir ganzgute Chancen vor zu pushen. Ja, guck mal hier. Da ist er schon. Ne, der ist da dauernd. Oh,ich kriege den Rats. Der Rats, da ist er. Oh, ich habe keine Muni mehr. Oh, nice, nice.Alter, oh. Monka, da geht es aber gerade mal richtig, richtig zu sagen. Nein, nein, nein,nicht diffusen, Alter, nicht diffusen. Macht den Fatal, lebt der noch? Ne, ne, ich glaubeso bewegt man sich in dem Spiel nicht, wenn man noch lebt. Nein, nein, nein, da gehteiner ran. No. Bam. Die hat die Reetaste nicht gefunden. Für so Leute, wie die Sundanceeben, ist das gemacht, damit, dass man sich nicht hinlegen kann und gleichermaßen sichbewegen. Weil ihr habt es gesehen, die hat es nicht geschafft, an das M-Com ranzugehenund E zu drücken. Und wenn man es nicht schafft, an ein M-Com ranzugehen und E zu drücken,kann man noch nicht erwarten, dass man sich hinlegen kann und dabei moveen. Nein, schlechteIdee. Gute Idee. Alter, man bleibt doch mal stehen. Okay. Sehr gut. Monka, stehe. Leute,weg, während ich hier liege. Das muss jetzt einfach mal an der Stelle sein. Bis ich respawnedbin. Sonst lag das Game. Muss es leider umschalten. Lass mich reinspawnen, please. Reinspawn,reinspawn, reinspawn, reinspawn, reinspawn, reinspawn, reinspawn. Da ist was. Da war was.Tollisch. Ui. Blup. Warum haben eigentlich in diesem Battlefield alle einen D-Feederbei? Ist das irgendwie...nice Logik? Egal, das Spiel hat keine Logik. Warum frage ichan Logik? Lul. Logik overrated, jebaited, outdated. Äh. Hallo? Der hat einfach nichtgeschossen. Aber das ist schon das Dritte, was manchmal Aussetzer hat. Springen gehtmanchmal gar nicht, Nahkampfen geht manchmal...Nahkampfen, Alter. Melee geht manchmal gar nicht und manchmalgeht anscheinend schießen auch nicht. Wo kämen wir auch hin, wenn in dem Shooter schießenfunktionieren würde. Das wäre ja komplett...Also wer kann...Also nee, das kann man ja nichterwarten. Das kann man ja beim besten Bild nicht erwarten. Das ist das Shooten einfachüber mir. Über uns sind die. Endgame, Alter. Up we go! Up we go!Yolo Swagger. Der Yolo Swagger ist da. Endlich. Der Yolo Swagger. Der Yolo Swagger, da war er.Nee, da war er nicht. Achtung, Flank Action. Der Yolo Swagger. Also Leute, ich muss sagen,ich bin mit meiner Performance mittlerweile in Multiplayer-Spielen als 37-jähriger Boomereigentlich ganz zufrieden. Das war jetzt dumm, aber ganz ehrlich, wenn ich mir andere 37-Jährigeangucke, wie die Spiele spielen online, dann ist das durchaus in Ordnung. Nice Rats. Gut,ich mein, man darf nicht vergessen, die ältesten CS-Spieler sind nicht so viel jünger alsich. Auch wenn die nicht mal so in ihrer Prime sind. Wie alt ist Guardian jetzt? Oder Testoder so? Die sind doch auch schon irgendwie 34 oder sowas. Wer weiß, dass die jemand wiealt sind. Richtig nice ist PP-GM. Oh, da schießt was auf mich. Guck mal hier, da kommt wasrüber und will mich shooten. Da kommt noch was. Monka Shoot. Alter, oh nee, ich hab nichtsmehr. Ich nebel mich jetzt einfach ein und warte hier. Alter, ich hör hier 50 Gegnerum mich drum herum und du weißt in diesem Battlefield nie, ob sie nah oder entferntsind. Monka S. Wir machen das Trick 17, guckt euch das mal an. Oh nee, hat nicht funktioniert.Hat nicht gefunzt. Moni, Moni, Moni, gib mir Moni. Watch my back. Ok, pass auf, passauf, big brain move. Massive big brain move. Jawoll, jawoll, schießt mir nicht in Bobbes,nicht in der Ice shooten. Sehr gut. Oh, in der Ask shootet. 37 ist das, 29. Ist so. Ichsag euch Leute, die jetzt, also in meinem Alter und noch älter, die werden auch bis 70 plusspielen und noch ganz ok sein können, wenn sie da in die nötige Zeit in den Game reinstecken.Ich mein, ich merk das schon, dass ich jetzt nicht mehr so mega schnell in den Game reinkommen wie früher vielleicht. Nein, die haben Disabled. Die Noobs. Hast du nicht mehr soviel Zeit in den Westin? Naja, es hat schon seinen Grund, dass die ganzen, dass die ganzenCompetitive Pros alle irgendwie 16, 16 bis 25 sind oder so. Ich bin mir nicht so ganzsicher, wo die Gegner sind. Ah fuck, ich hab ja noch, nein, ich brauch meine Motion Balls.Shit, ich brauch die Motion Balls, sonst seh ich ja gar nichts. Nope, wir kriegen keinRest, passt nicht. Haben wir eigentlich schon ein M-Com geplantet hier? Banana Planter 27,das wollte ich jetzt machen hier. Gib ihm, gib ihm. Oh man, ich spawn hier ernsthaftmitten auf dem Feld, Alter. Keine, not, not Pog. Ich weiß, was hier, what? Not, not Pog.Ich wollte runterlegen, da unten ist das M-Com vollkommen frei. Das ist doch unterirdisch,das ist das M-Com. Not Pog, wo ist der Panz, der Panzman überhaupt, dass der mich da gehittedhat? Genau, hier runter müssen wir. So, einmal Balls, einmal Balls. Und jetzt Legehennenmachen, Leute. Ach nee, haben wir das schon? Ich bin verwirrt. Zack. Ach, wir haben nurnoch das oben. Lull. Ja Mensch, sagt mir das doch mal einer. Boomer hier, das ist nichtso schnell. Aber wir können jetzt da oben drauf. Okay, das ist definitiv not, not range weapon.Fuck, jetzt sind sie oben. Da machst du nichts. Aber wir hätten im gleichen Moment, wo ichda hinten Action mache in der Backline, hätten wir rüberpushen müssen. Aber wir haben einenschönen Motion Sensor drin, das heißt, man sieht alles. Rätsel wird mich hier oben natürlichkeiner, das ist klar, wie auch. Nice, wir sind fast dran, Leute, wir sind fast dran.Jetzt nicht sinnlos sterben, wir haben immer viele. Wir haben nur noch sechs Tickets. Nice,wir sind fast dran. Oh, shit, shit, shit. Fuck, ich wusste, dass der von hinten kommt. Nein,nein, nein. Aber der ist dead, der ist dead, da geht jetzt gleich noch einer ran. Ich habereloaded, ich hätte Pistole switchen müssen. Perfekt. Nein, das macht nichts, die kommennicht mehr ran, die kommen nicht mehr ran. Die kommen nicht mehr ran. Nein, nein, nein,nein, da liegt einer und diffused. No. Not like this. Danach hätten wir gewonnen. Sendensoll die Klappe. Maria auch die Klappe halten. Webster auch die Klappe halten. Das war knapp,das war richtig klaus, die Runde. Hipfire Kills, der mag das Game mag Hipfire Kills,wie es aussieht. Fast Match of the Day. Jedes Match ist anscheinend noch dem Game Fast Matchof the Day. Was ist das XP Boost so zum Release oder was? Also ich denke, eine Runde kanndie noch spielen. Ich merke schon, dass man hier nicht mehr richtig mitmacht. Was? Ichfrage mich echt, warum die XP? Ja, weil es XP Farm Server gab, aber der Witz ist halt.Könnt ihr euch noch an den Portal Trailer erinnern? Das erste, was ich gesagt habe,ist, was machen die, dass es keine Booster Server gibt und BÄM, es gibt Booster Server.Das hätte ja niemand, für mich auch die letzte Runde, hätte niemand ahnen können. Man könntedas Ganze übrigens fixen. Also wenn die Bot Booster Server haben in Portal, dann einfachabschalten, ist es gegen echte Spieler einfach, solange es die default Settings sind, wasHells und sowas angeht, erlauben. Warum nicht? Ich meine, scheiß drauf. Warum nicht? Dannsind die Leute Level 300, wem die juckts. Jetzt nochmal World War 3. Ich habe es versuchtzu deinstallieren, habe keinen Deinstaller gefunden und musste meinen Rechner von russischemAnti-Cheat Deepnoten, das ich wegbekommen habe, Windows Service löschen und sonstigeSachen klären, ich werde das nie wieder installieren. Zu viel russische K-K-K-K-KommandatSpyware drauf. Naja, nicht wirklich Spyware, kann man nicht sagen. Es ist halt legit Anti-Cheat,aber keine, die ich haben will. Ich weiß gar nicht, wo die sind. Es geschult. Ihr wolltauch nicht flanken oder? Wollt ihr flanken? Wieder schön um die Ecke. LMG legit. Die kriegendas glaub ich noch, die kriegen das noch diffused oder? Nein, nein, gut, gut, gut. Angel, retzmich Angel. Angelo, gib mir. Voll in Ass, in Ass geballert. Wow. Macht's mit Rush wiederrichtig bock? Nein, es macht mit Rush erträglich. Rush macht das Spiel erträglich. Oben istdoch einer. Nice, nice, der Viertel macht das. Nice, nice, nice. Gut, gleich das Loch getroffenhier. Nach die Base. Vielleicht haben wir Glück. Nein. Das ist ein Sentry Gun da oben. Ichgeh da mal rein. Ich seh da zwar nix, aber wenn ich was sehen würde. Alter, ich kannmeine Waffe nicht wechseln. Ich kann nicht switchen. Meine Güte ey. Alter, ich kannnicht anvisieren. Meine Iron Sides gehen nicht. Es ist broken. Es ist broken. Meine Iron Sides,na jetzt geht's wieder. Meine Güte, Alter. Ein Shooter in dem Shooten nicht funktioniert.Sehr gut gemacht da ist. Pog, Pog, Pog, Pog, Pog, Pog. Poggers. Ein, ein nicest, nicestGame. Oh, aber den haben wir noch schön geklatscht. Shooten ist ja auch eine Legacy Mechanik, genauwie Scoreboard. Richtig. Alles, alles Legacy. Alles was nicht funktioniert ist Legacy Feature,das brauchen wir nicht. Es ist ja auch, sag mal so, reliable Waffen und Hit Detection indem Online-FPS. Also, wer kommt auf so eine Idee, dass man das bräuchte? Das ist ja komplettoverrated, outdated, outdated. Oh, nee. Panikhoppen hat man nicht von uns. Über Ranges? Oh, oh,oh, oh, oh, oh, oh. Der hat's auch nicht gecheckt, oder? The Nightbot ist schlau.Rush mit 128 Spielern, das werde ich nicht spielen. Die können noch 24 Spieler erhöhenund die Maps vielleicht ein bisschen besser ausnutzen. Aber ansonsten? Ich persönlichfinde ja eigentlich 16 versus 16 am besten. Auf Range ist die halt wirklich nicht so derBringer. Okay, jetzt rennen sie rüber, jetzt gehen wir hier hin. Sag mal, okay, ich habnicht jeden Schuss getroffen, ja? Okay. Aber. So mies war das jetzt auch nicht. Sag mal,what the fuck? Kann ich den mal umkippen? Oder ist mein Boomer hier einfach zu lang gespielt?Ich hätte nix mehr. Das wird es wahrscheinlich sein. Liegt es in dem Fall nicht mal am Game.Metro, ja, aber Metro bitte nicht mit 128. Okay, da rechne ich da. Fuck! Ich dachte,da rechne ich damit, dass ich direkt reiße. Oh, hier liegen sie. Das ganze, das ganzeKaligua-Squad. Massive Spawn-Punkte, die sind so richtig pock, die Spawn-Punkte. Inthe ass shooted. Jetzt liege ich hoffentlich, nein, ich liege in der Mauer. Webster, dudicker Sack, leg dich nicht in die Mauer. Wenn ich in der Mauer bin, kann ich gerestwerden. Oh, kann auch so nicht gerest werden. Okay. Kein Q-Squad, nö, keiner da sonst.Ich glaube, das wird nix. Leute, das wird nix. Wir haben nur noch 18 Tickets. Es wäreübrigens sinnvoller, die Tickets ein bisschen hochzumachen. Die Katze möchte bei mir insZimmer. Alter, Chico. Jetzt ist Chico drinnen. Reingestürmt. Richtig reingestellst istes. Oh, wir müssen hier lang. Leute, ich habe das Headset nicht richtig auf, ich weiß.So, jetzt habe ich es richtig auf. Oh, jetzt die Legehennen machen. Legehennen. Legehennen.Legehennen und abcampen. Legehennen und abcampen. Ich hoffe, es kommt keiner von der Seite. Boah.Nein. Sie diffusen. Sie diffusen. Rip. Diffuse Champ. Diffuse Champ. Oh, was machen wir dennhier? Was machen wir denn hier? Ganz, ganz dumme Idee, Max. Keine Chance. Chico, wasist denn? Was ist los, Chico? Welche Maps würdest du noch wünschen? Terran Highway fände ichgeil. Das ist übelste Underrated-Map. Und natürlich sind das die Klassiker von Metrobis Grand Bazaar, meinetwegen können die auch locker rein machen. Die können einfachalle. Die sollen einfach alle Rush-Maps, Side-Bad-Copy, die eins reinschmeißen, 16 vs. 16. Easy.Die sollen einfach die Spawns da lassen, wo sie sind und die M-Comp-Platzierungen dalassen, wo sie sind. Fertig. Die müssen eigentlich gar nichts machen und schon wäre das vielbesser. Okay, Leute. Wenn die Katze schon am Start ist und rumnervt, das heißt schonspät. Schon spät. Und schon spät bedeutet, ich gehe jetzt gleich pennen. Mal gucken,ob ich den hosten kann. Nope, keiner da. Schön, dass ihr alle dabei gewesen seid. Wenn ihrnoch einen Prime-Sub übrig habt, würde ich mich freuen. Ansonsten könnt ihr euch auchmal auf YouTube und auf Twitter vorbeigucken. Und morgen früh, 9.30 Uhr, so in dem Dreh,wieder auf Wachstream. Wir sehen uns bis dann, machts gut. See you.", "segments": [{"id": 1, "start": 0.0, "end": 22.3, "text": "hallo hallo hallo btf was jetzt hallo Vodafone Vodafone Vodafone hallo also"}, {"id": 2, "start": 22.3, "end": 35.28, "text": "battlefield ist nicht ausgelockt auf jeden fall geht wieder nice warum hast du den deaf"}, {"id": 3, "start": 35.28, "end": 48.04, "text": "operator gesperrt hast du dich verklickt also was fragt denn hier fatal sag mal läuft das noch"}, {"id": 4, "start": 48.04, "end": 62.44, "text": "oder oder ist das irgendwie broken dq also sag mal hab seit einer woche ein ganz komisches"}, {"id": 5, "start": 62.44, "end": 68.64, "text": "problem mit meinem pc hatte 2 mal 8 gigabyte ddr 3 riegel ddr 3 dann ist der pc aber doch"}, {"id": 6, "start": 68.64, "end": 74.44, "text": "schon ein bisschen älter seit letzter woche startet er nicht mehr mit beiden riegel aber"}, {"id": 7, "start": 74.44, "end": 79.36, "text": "beide funktionieren habe jeden einzeln schon probiert ebenso wie alle slots hab aber hardware"}, {"id": 8, "start": 79.36, "end": 83.96, "text": "technische bis auf ein paar hdd installiert kann es sein dass er nicht so viel power brauchen das"}, {"id": 9, "start": 83.96, "end": 90.96, "text": "nicht naja festplatten verbrauchen hauptsächlich beim anlaufen viel strom also wenn die an das"}, {"id": 10, "start": 90.96, "end": 102.64, "text": "anlaufen überleben also spätestens mit einem reset sollten ja nicht neu anlaufen das kann ich"}, {"id": 11, "start": 102.64, "end": 110.36, "text": "remote schlecht diagnostizieren ich würde mal den ram test machen in so einem test oder sowas also"}, {"id": 12, "start": 110.36, "end": 122.96, "text": "wenn die queue ist nicht gleich ob welche waffen sind meter weiß ich nicht welche waffen sind meter"}, {"id": 13, "start": 122.96, "end": 133.6, "text": "m9 bei mir m9 und grad 30 was ist denn zu allgemein meter ak ak 24 glaube ich ak ist bei"}, {"id": 14, "start": 133.6, "end": 156.84, "text": "bei sturm gewähren ziemlich meter zu deiner nachricht achso ja du kannst ein bild schicken"}, {"id": 15, "start": 156.84, "end": 161.52, "text": "solang es nicht von rick ashley ist und mich rick rollen bild kannst du machen der out das"}, {"id": 16, "start": 161.52, "end": 167.16, "text": "game train ist am start leute eins ab brauchst noch eins ab dann haben wir den den den scam dann"}, {"id": 17, "start": 167.16, "end": 172.4, "text": "dann seid ihr in der abo falle wo kann ich das schicken ja sucht ihr irgendeine image hosting"}, {"id": 18, "start": 172.4, "end": 181.32, "text": "seite aus jetzt bin ich in q 2 von 4 sogar schon der kuchen anders gore ist am start"}, {"id": 19, "start": 181.32, "end": 186.52, "text": "dankeschön progas halb das ist jetzt ruckelt ist normal weil das game der meinung ist im"}, {"id": 20, "start": 186.52, "end": 193.2, "text": "menü braucht man 100 prozent cpu last muss man 100 prozent cpu last erzeugen ne image hosting ich"}, {"id": 21, "start": 193.2, "end": 198.64, "text": "kann nicht in discord hier reingucken gescheit also ich glaube aber nicht ich glaube auch nicht dass"}, {"id": 22, "start": 198.64, "end": 210.76, "text": "es an der festplatte liegt 2 ja das spiel mag nicht dass wir join oder da werden auch leute"}, {"id": 23, "start": 210.76, "end": 220.48, "text": "aus diesem spiel quitten es quitten ständig leute aus dem game raus wisst ihr was was wenn"}, {"id": 24, "start": 220.48, "end": 224.72, "text": "die was wir jetzt mal machen in der zwischenzeit wir stellen mal unser super tolles profil ein"}, {"id": 25, "start": 224.72, "end": 231.6, "text": "player card was kann man da so alles einstellen specialist images specialist also zeigt man ja"}, {"id": 26, "start": 231.6, "end": 243.24, "text": "was ist das field of operation alles klar das problem jetzt mp9 also ein auto so ein auto"}, {"id": 27, "start": 243.24, "end": 251.76, "text": "problem auch ich finde das lustig dass sie dann ein boot haben und es existiert in diesem spiel"}, {"id": 28, "start": 251.76, "end": 263.48, "text": "da kein boot weiß auch nicht was man sich da so genau dabei überlegt hat smg brodachy kills"}, {"id": 29, "start": 263.48, "end": 275.28, "text": "euer smg brodachy richtig brodachy badges mckay master kann man nicht noch mehr machen"}, {"id": 30, "start": 275.28, "end": 287.68, "text": "machen wir so ok tags sie sind wett data meiner"}, {"id": 31, "start": 293.68, "end": 295.72, "text": "ehrlich gesagt juckt mich das so überhaupt nicht"}, {"id": 32, "start": 295.72, "end": 307.0, "text": "ground breaker so super so vielleicht geht es irgendwann auch los demnächst"}, {"id": 33, "start": 307.0, "end": 317.08, "text": "bettel wie sieht es aus was der stand der runde"}, {"id": 34, "start": 317.08, "end": 329.2, "text": "ich vermisse diese zeit wo man sich emblem selber gestalten konnte also ich vermisse"}, {"id": 35, "start": 329.2, "end": 336.68, "text": "diese zeit auch und auch nicht weil erinnert sich einen black ops 1 90 prozent der player"}, {"id": 36, "start": 336.68, "end": 352.12, "text": "cards bestanden aus dicks oder tippen foto ab google ok so gewonnen easy dann geht es"}, {"id": 37, "start": 352.12, "end": 362.2, "text": "jetzt los klar also ergeblich bin ich noch in der queue aber sollte ja gleich funktionieren"}, {"id": 38, "start": 362.2, "end": 367.4, "text": "so also was sieht man hier es ist auf jeden fall schon mal richtig"}, {"id": 39, "start": 367.4, "end": 373.28, "text": "nice ist ekearec oder falls es ekearec sind keine ahnung auf jeden fall schon mal richtig"}, {"id": 40, "start": 373.28, "end": 379.44, "text": "big brain zusammen mit zusammengeschraubt warum du so ultra viele strom strom fressen"}, {"id": 41, "start": 379.44, "end": 382.16, "text": "des surfer hast oder ich weiß ich das von dir oder von wem ist das"}, {"id": 42, "start": 382.16, "end": 394.8, "text": "es leht ich will nicht dass es leht das ist vermieter ja ich guck gleich ich guck gleich"}, {"id": 43, "start": 394.8, "end": 401.4, "text": "weiter da hat sogar eine konsole gucken wir gleich ach manifest jetzt"}, {"id": 44, "start": 401.4, "end": 415.96, "text": "manifest finde ich ist die beste map im spiel aber in rush leider schlecht gemacht ich glaube"}, {"id": 45, "start": 415.96, "end": 422.08, "text": "manifest ist für alle anderen spielmodi mit das beste aber in rush ist es mit die schlechteste"}, {"id": 46, "start": 422.08, "end": 425.0, "text": "ich weiß nicht was man sich dort mit den mit den platzierungen gedacht hat"}, {"id": 47, "start": 425.0, "end": 435.28, "text": "oh was gehen mit dem kran hier oben ab was hat der kran für schmerzen"}, {"id": 48, "start": 435.28, "end": 444.24, "text": "ja ich sag dir ich sag dir gleich was was da abgeht aber sowieso ich kann dir zwar sagen"}, {"id": 49, "start": 444.24, "end": 450.04, "text": "was was ist so ungefähr aber mehr als sieht aus wie so was sieht aus wie storage sieht"}, {"id": 50, "start": 450.04, "end": 454.84, "text": "aus wie netzwerksachen kann ich dir natürlich auf dem bild auch nicht sagen weil woher"}, {"id": 51, "start": 454.84, "end": 460.84, "text": "soll ich wissen"}, {"id": 52, "start": 460.84, "end": 468.08, "text": "oh oh depends man"}, {"id": 53, "start": 468.08, "end": 474.12, "text": "ok das war nicht so gut das war ein low iq grappling hook wir müssen mal kurz warten"}, {"id": 54, "start": 474.12, "end": 480.72, "text": "bis das zack zack ich muss kurz warten bis es reloaded hat jetzt"}, {"id": 55, "start": 480.72, "end": 496.56, "text": "ok nice hier geht was ok das war pepega aimed was hatte mich gekillt m5 ah m5 enjoyer seh"}, {"id": 56, "start": 496.56, "end": 517.6, "text": "schon ein richtiger m5 enjoyer muss auch mal sein"}, {"id": 57, "start": 517.6, "end": 527.08, "text": "da kommt ein pence man"}, {"id": 58, "start": 527.08, "end": 537.16, "text": "cap'n poggers ich hol dich yolo res oh nee"}, {"id": 59, "start": 537.16, "end": 541.0, "text": "oh oh shit da ist ja ne panzer auf der straß"}, {"id": 60, "start": 541.0, "end": 550.12, "text": "dafür mach ich ne krasse flank action aber nein ja manifestes pence champ"}, {"id": 61, "start": 550.12, "end": 553.36, "text": "extreme nerd danke für den sub oh hier sehr guter spawn"}, {"id": 62, "start": 553.36, "end": 556.04, "text": "exzellente exzellente exquisita spawn"}, {"id": 63, "start": 556.04, "end": 562.32, "text": "oh oh ganz schlecht ganz schlecht"}, {"id": 64, "start": 562.32, "end": 570.64, "text": "du kannst ja grad echt nichts machen der hat sich auch nicht selbst geheilt"}, {"id": 65, "start": 570.64, "end": 578.72, "text": "aber wir haben es guck mal wir haben es gelegt legehänge ist die legehänge ist strong heute"}, {"id": 66, "start": 578.72, "end": 579.72, "text": "steigt aus"}, {"id": 67, "start": 579.72, "end": 597.24, "text": "ok vielleicht kriegen wir jetzt ein bisschen struktur rein"}, {"id": 68, "start": 597.24, "end": 599.32, "text": "alles klar nice gg battlefield"}, {"id": 69, "start": 599.32, "end": 612.04, "text": "what the hell ist das ist das ne hacker man fähigkeit oder oder war das geleckt"}, {"id": 70, "start": 612.04, "end": 618.64, "text": "ist leute ist das ich bin verwirrt"}, {"id": 71, "start": 618.64, "end": 633.68, "text": "ist das ne fähigkeit von dem specialist oder oder es ist lege gewesen"}, {"id": 72, "start": 633.68, "end": 637.12, "text": "wenn sie fähigkeit von dem specialist ist würde ich auch ziemlich ziemlich ein pence"}, {"id": 73, "start": 637.12, "end": 638.12, "text": "champ finden"}, {"id": 74, "start": 638.12, "end": 644.28, "text": "leck warum nicht beides das ist ne gute frage warum nicht beides"}, {"id": 75, "start": 644.28, "end": 655.92, "text": "ja der bruder bruder get wrecked"}, {"id": 76, "start": 655.92, "end": 659.24, "text": "wenn wenn mechanics im game sind die nicht funktionieren dann triggert mich das immer"}, {"id": 77, "start": 659.24, "end": 673.92, "text": "so ein bisschen bot fähigkeit weiß nicht das war glaube ich richtig"}, {"id": 78, "start": 673.92, "end": 677.68, "text": "krasses gelege hätte die rechte ecke gucken sollen anscheinend"}, {"id": 79, "start": 677.68, "end": 683.76, "text": "es einfach durchrennen aber ich dachte laut map der ist irgendwie da"}, {"id": 80, "start": 683.76, "end": 691.72, "text": "ist auch immer besser als die esl matches von letztens"}, {"id": 81, "start": 691.72, "end": 719.88, "text": "oh hier unten geht es ab wie nix abgekriegt nix abgekriegt"}, {"id": 82, "start": 719.88, "end": 732.68, "text": "ich habe keine ahnung wo hier was abgeht"}, {"id": 83, "start": 732.68, "end": 734.8, "text": "die die die die enjoyen das nicht so hier"}, {"id": 84, "start": 734.8, "end": 759.8, "text": "sag mal können wir sterben blies"}, {"id": 85, "start": 759.8, "end": 771.28, "text": "das spiel hat ja kein soundtrack deswegen habe ich mir gedacht ich mache einfach mal"}, {"id": 86, "start": 771.28, "end": 773.0, "text": "thematisch passende musik an"}, {"id": 87, "start": 773.0, "end": 776.28, "text": "ich finde das passt auch ziemlich gut dazu"}, {"id": 88, "start": 776.28, "end": 778.36, "text": "oder was sagt ihr"}, {"id": 89, "start": 778.36, "end": 792.0, "text": "es ist es ist auf jeden fall besser es ist auf jeden fall besser als der normale soundtrack"}, {"id": 90, "start": 792.0, "end": 793.64, "text": "weil der normale soundtrack ist ja nicht vorhanden"}, {"id": 91, "start": 793.64, "end": 811.88, "text": "game blies kann aber einer sterben"}, {"id": 92, "start": 811.88, "end": 814.08, "text": "vielleicht kriege ich den rett hier oben ist viel am start ja"}, {"id": 93, "start": 814.08, "end": 825.96, "text": "wir bräuchten irgendein mit amok jetzt auch hier oben geht es aber rund"}, {"id": 94, "start": 825.96, "end": 827.12, "text": "hier oben geht es aber rund"}, {"id": 95, "start": 827.12, "end": 845.44, "text": "oh was ist hier los ist das auto ich brauche muni ich brauche muni"}, {"id": 96, "start": 845.44, "end": 848.6, "text": "übrigens habe ich schon mal gesagt dass ich die nachlade animation von der von der"}, {"id": 97, "start": 848.6, "end": 866.56, "text": "lg 18 eigentlich ziemlich nice finde"}, {"id": 98, "start": 866.56, "end": 878.96, "text": "ok achtung ein nicer rusher"}, {"id": 99, "start": 878.96, "end": 893.4, "text": "also die spawns in wirklich komplette katastrophe hier in"}, {"id": 100, "start": 893.4, "end": 905.96, "text": "der katastrophe"}, {"id": 101, "start": 905.96, "end": 907.68, "text": "rauf aufs dach"}, {"id": 102, "start": 907.68, "end": 925.32, "text": "oh ist er hinter mir"}, {"id": 103, "start": 925.32, "end": 939.24, "text": "schon wieder leer"}, {"id": 104, "start": 939.24, "end": 940.92, "text": "ich bin froh dass es kein radio gibt"}, {"id": 105, "start": 940.92, "end": 947.6, "text": "wenn es ein radio geben würde dann müsste ich das radio muten weil mittlerweile tost"}, {"id": 106, "start": 947.6, "end": 948.6, "text": "auf twitch ist"}, {"id": 107, "start": 948.6, "end": 956.08, "text": "die mp ist nur auf range gut auf entfernung sagt es mal richtig"}, {"id": 108, "start": 956.08, "end": 961.92, "text": "das hier ist die mitnehmen habe ich in der ak gesehen"}, {"id": 109, "start": 961.92, "end": 965.36, "text": "das hier ist anscheinend so die krass so die mit die richtige meta waffe gerade"}, {"id": 110, "start": 965.36, "end": 971.8, "text": "mit diesem attachment glaube ich auch probieren wir mal die meta waffe aus"}, {"id": 111, "start": 971.8, "end": 984.36, "text": "ich meine ich bin ja froh ich bin ja froh dass es eine assault rifle gibt was man spielen"}, {"id": 112, "start": 984.36, "end": 987.36, "text": "kann weil ansonsten"}, {"id": 113, "start": 987.36, "end": 992.0, "text": "alles ein grund dass die alle ppega 29 gespielt haben"}, {"id": 114, "start": 992.0, "end": 995.76, "text": "meine motion sensors mehr schmeißen"}, {"id": 115, "start": 995.76, "end": 1005.08, "text": "wo ist hier was ich sehe die gegner sterben und leute sterben neben mir aber"}, {"id": 116, "start": 1005.08, "end": 1006.44, "text": "sehr gut hab wieder top funktioniert"}, {"id": 117, "start": 1006.44, "end": 1025.88, "text": "ihr seht ihr wie die motion balls lagen"}, {"id": 118, "start": 1025.88, "end": 1029.16, "text": "habt ihr es unten auf der map gesehen wie der motion ball einfach flupp flupp flupp"}, {"id": 119, "start": 1029.16, "end": 1030.16, "text": "flupp"}, {"id": 120, "start": 1030.16, "end": 1034.08, "text": "so als rush nur wieder mit der k30 rein viel besser"}, {"id": 121, "start": 1034.08, "end": 1036.96, "text": "der könnt sich umdrehen und mich retten macht er nicht"}, {"id": 122, "start": 1036.96, "end": 1043.64, "text": "jawoll kein respawn ist poggers"}, {"id": 123, "start": 1043.64, "end": 1045.88, "text": "kein respawn timer ist der beste respawn timer"}, {"id": 124, "start": 1045.88, "end": 1064.4, "text": "also wenn ich bin wenn es für mich für die gegner nicht"}, {"id": 125, "start": 1064.4, "end": 1065.4, "text": "weggespray die guten"}, {"id": 126, "start": 1065.4, "end": 1082.72, "text": "lege henne und heal"}, {"id": 127, "start": 1082.72, "end": 1097.48, "text": "dankeschön game"}, {"id": 128, "start": 1097.48, "end": 1105.52, "text": "da oben auf dem turm hat das einen single player"}, {"id": 129, "start": 1105.52, "end": 1114.92, "text": "die haben 5 eingestellt und auf den single player verzichtet"}, {"id": 130, "start": 1114.92, "end": 1118.12, "text": "um sich nur auf den multiplayer zu konzentrieren"}, {"id": 131, "start": 1118.12, "end": 1127.4, "text": "und ich finde das sieht man auch"}, {"id": 132, "start": 1127.4, "end": 1129.48, "text": "die musik ist perfekt finde ich passt richtig gut dazu"}, {"id": 133, "start": 1129.48, "end": 1148.92, "text": "aber die haben wir gerade schon weggeklatscht"}, {"id": 134, "start": 1148.92, "end": 1151.96, "text": "die skins sind nicht nur dämlich die sehen auch noch dämlich aus"}, {"id": 135, "start": 1151.96, "end": 1158.24, "text": "also die fault dinger die gehen ja noch halbwegs"}, {"id": 136, "start": 1158.24, "end": 1161.48, "text": "die fault dinger sehen halt dafür aus dass es richtig clone army ist"}, {"id": 137, "start": 1161.48, "end": 1165.04, "text": "also in battle field 3 funktioniert deine maus nicht"}, {"id": 138, "start": 1165.04, "end": 1166.04, "text": "warum das denn nicht"}, {"id": 139, "start": 1166.04, "end": 1168.52, "text": "achja wir wollen uns ja das server build hier wieder weiter angucken"}, {"id": 140, "start": 1168.52, "end": 1171.0, "text": "also was sehe ich denn hier sonst noch drauf"}, {"id": 141, "start": 1171.0, "end": 1180.76, "text": "also ich sehe hier unten plate center sind das ernsthaft plate center"}, {"id": 142, "start": 1180.76, "end": 1183.52, "text": "sieht ein bisschen aus wie plate center ich erkenne es nicht so wirklich"}, {"id": 143, "start": 1183.52, "end": 1185.76, "text": "das ist von der von der größe her schlecht zu erkennen"}, {"id": 144, "start": 1185.76, "end": 1189.28, "text": "es könnten auch festplatten einschübe sein aber"}, {"id": 145, "start": 1189.28, "end": 1191.88, "text": "ich würde so spontan das hier oben sind festplatten einschübe"}, {"id": 146, "start": 1191.88, "end": 1194.76, "text": "das hier sind auch festplatten einschübe die sind keine plate center"}, {"id": 147, "start": 1194.76, "end": 1198.08, "text": "das sind festplatten einschübe das sieht man hier oben das metall dran"}, {"id": 148, "start": 1198.08, "end": 1201.08, "text": "ist von der größe her nicht ganz klar"}, {"id": 149, "start": 1201.08, "end": 1207.56, "text": "oder wobei das sind es doch plate center schwer zu erkennen"}, {"id": 150, "start": 1207.56, "end": 1221.8, "text": "hpc 7.000 möglich ja"}, {"id": 151, "start": 1221.8, "end": 1225.88, "text": "kann durchaus sein so das ist auf jeden fall storage"}, {"id": 152, "start": 1225.88, "end": 1230.04, "text": "relativ viel frage ist halt nur ob große platten oder nicht"}, {"id": 153, "start": 1230.04, "end": 1232.32, "text": "ich meine so ein storage kann durchaus auch wenig storage sein"}, {"id": 154, "start": 1232.32, "end": 1234.8, "text": "der heutigen zeit ich hab ich hab festgestellt es wurden heute"}, {"id": 155, "start": 1234.8, "end": 1241.12, "text": "30 terabyte platten vorgestellt eine konsole was mich ein bisschen stutzig"}, {"id": 156, "start": 1241.12, "end": 1245.0, "text": "macht eine konsole mit windows das schon äußerst pains"}, {"id": 157, "start": 1245.0, "end": 1249.68, "text": "champig ist ein patch panel noch ein patch panel"}, {"id": 158, "start": 1249.68, "end": 1257.92, "text": "wer zu sagen das hier ist das dürfte irgendwie ein dsl modem sein"}, {"id": 159, "start": 1257.92, "end": 1262.76, "text": "das hier in der mitte noch mal noch mal einen storage ist da oben"}, {"id": 160, "start": 1262.76, "end": 1266.4, "text": "keine ahnung ja was der da typ mit dem keller macht"}, {"id": 161, "start": 1266.4, "end": 1271.28, "text": "ist wirklich sehr fragwürdig keine ahnung ja es ist auf jeden fall nicht"}, {"id": 162, "start": 1271.28, "end": 1288.12, "text": "nicht billig so viel so viel ist sicher"}, {"id": 163, "start": 1288.12, "end": 1302.48, "text": "das ist eine ganz schlechte idee max"}, {"id": 164, "start": 1302.48, "end": 1306.4, "text": "alter meine fresse battlefield movement please lass mich doch einfach mal da hochlaufen"}, {"id": 165, "start": 1306.4, "end": 1314.2, "text": "wow fuck alter seht ihr wie viel dahinter mir ist"}, {"id": 166, "start": 1314.2, "end": 1317.36, "text": "das sind 40 leute hinter mir ok es können nicht sein es können maximal"}, {"id": 167, "start": 1317.36, "end": 1321.8, "text": "16 sein aber trotzdem"}, {"id": 168, "start": 1321.8, "end": 1332.12, "text": "alter krass ist das pp geheim aller zeiten aber hat gereicht"}, {"id": 169, "start": 1332.12, "end": 1351.4, "text": "jetzt gehen wir schon rein warum gehen wir rein weil es noch zwei"}, {"id": 170, "start": 1351.4, "end": 1355.6, "text": "sekunden sind und jetzt gehts auf jawoll massive"}, {"id": 171, "start": 1355.6, "end": 1362.72, "text": "ich kann nicht retzen"}, {"id": 172, "start": 1362.72, "end": 1366.76, "text": "der waffensound ist tatsächlich in ordnung wobei man sagen muss für battlefield verhältnisse"}, {"id": 173, "start": 1366.76, "end": 1371.32, "text": "finde ich ihn gar nicht mal"}, {"id": 174, "start": 1371.32, "end": 1374.4, "text": "so gut also ihr seht auf range geht mit dem ding nicht so viel rein"}, {"id": 175, "start": 1374.4, "end": 1386.04, "text": "ja komm on"}, {"id": 176, "start": 1386.04, "end": 1391.72, "text": "ich wollte den den den container aufmachen und reingehen"}, {"id": 177, "start": 1391.72, "end": 1398.04, "text": "das war doch range gerade da ging nicht so viel rein"}, {"id": 178, "start": 1398.04, "end": 1406.04, "text": "und obwohl ich schon burst geschossen habe nice"}, {"id": 179, "start": 1406.04, "end": 1409.04, "text": "schon planten am start"}, {"id": 180, "start": 1409.04, "end": 1410.04, "text": "kann man sich eigentlich"}, {"id": 181, "start": 1410.04, "end": 1413.08, "text": "hätte auch sein können"}, {"id": 182, "start": 1413.08, "end": 1415.64, "text": "ja der kill danach schon"}, {"id": 183, "start": 1415.64, "end": 1423.36, "text": "jawoll aufgeholt bunny bunny gehobt"}, {"id": 184, "start": 1423.36, "end": 1427.28, "text": "hier überrennen die aber schon ganz schön oder"}, {"id": 185, "start": 1427.28, "end": 1436.56, "text": "also balance ist wirklich was anderes"}, {"id": 186, "start": 1436.56, "end": 1448.8, "text": "balance ist was anderes leute"}, {"id": 187, "start": 1448.8, "end": 1465.48, "text": "und wir können doch nicht gehen wir können bei fünf bei so keine ahnung bei zehn sekunden"}, {"id": 188, "start": 1465.48, "end": 1467.36, "text": "oder wann weiß ich jetzt"}, {"id": 189, "start": 1467.36, "end": 1469.36, "text": "ich denke mal ich denke mal jetzt können wir gehen"}, {"id": 190, "start": 1469.36, "end": 1483.0, "text": "habe ich glück jawoll es geht auf poggers"}, {"id": 191, "start": 1483.0, "end": 1484.0, "text": "charlie mike"}, {"id": 192, "start": 1484.0, "end": 1501.8, "text": "da ist ein dude dahinter und ohne sentry gun ist oder kommt ein gegner"}, {"id": 193, "start": 1501.8, "end": 1511.44, "text": "ist wie weg oh oh sentry stellt"}, {"id": 194, "start": 1511.44, "end": 1512.44, "text": "sentry stellt muss weg"}, {"id": 195, "start": 1512.44, "end": 1515.44, "text": "von hinten"}, {"id": 196, "start": 1515.44, "end": 1517.28, "text": "get fucked up in the ass over hier leute"}, {"id": 197, "start": 1517.28, "end": 1529.8, "text": "sind die dauer"}, {"id": 198, "start": 1529.8, "end": 1534.28, "text": "jetzt aber jetzt sind sie dauernd"}, {"id": 199, "start": 1534.28, "end": 1537.32, "text": "ja ja ja ist gerade richtig anstrengend hier"}, {"id": 200, "start": 1537.32, "end": 1543.76, "text": "ran hier ran hier leute"}, {"id": 201, "start": 1543.76, "end": 1545.76, "text": "ran"}, {"id": 202, "start": 1545.76, "end": 1552.2, "text": "so mal kurz kurz noch was reindrücken den booster impfung drinnen jetzt geht's los"}, {"id": 203, "start": 1552.2, "end": 1557.72, "text": "ok ich war auf der falschen waffe"}, {"id": 204, "start": 1557.72, "end": 1564.44, "text": "aber kann ja mal passieren die gegner haben ist ähnlich so wirklich viel resistance zu"}, {"id": 205, "start": 1564.44, "end": 1565.44, "text": "spüren gerade"}, {"id": 206, "start": 1565.44, "end": 1570.04, "text": "oh gott ist dieses spiel verpackt man"}, {"id": 207, "start": 1570.04, "end": 1578.08, "text": "das spiel ist so verpackt"}, {"id": 208, "start": 1578.08, "end": 1579.08, "text": "monach s"}, {"id": 209, "start": 1579.08, "end": 1586.88, "text": "ich wurde ich habe gekrappelt und nach dem rest wurde ich beginnt das krabbel automatisch"}, {"id": 210, "start": 1586.88, "end": 1597.56, "text": "aus dachau wieder schon ziemlich prognose oder schon schon ziemlich prognose"}, {"id": 211, "start": 1597.56, "end": 1603.72, "text": "tot nach dem bus dann sus"}, {"id": 212, "start": 1603.72, "end": 1621.28, "text": "war richtig sus"}, {"id": 213, "start": 1621.28, "end": 1624.96, "text": "ich war schon längst um die eck"}, {"id": 214, "start": 1624.96, "end": 1628.56, "text": "netcode 0 hd"}, {"id": 215, "start": 1628.56, "end": 1635.2, "text": "also ist das halt mit kleinzeit hd detections muss auch so sein letztendlich"}, {"id": 216, "start": 1635.2, "end": 1636.92, "text": "wie wir haben es nicht gekriegt"}, {"id": 217, "start": 1636.92, "end": 1637.92, "text": "lul"}, {"id": 218, "start": 1637.92, "end": 1639.6, "text": "guckt euch das mal an"}, {"id": 219, "start": 1639.6, "end": 1640.6, "text": "hätte ich jetzt nicht gedacht"}, {"id": 220, "start": 1640.6, "end": 1646.6, "text": "war das die bill gates booster"}, {"id": 221, "start": 1646.6, "end": 1650.0, "text": "jawoll aus dach aus dach big brain dach"}, {"id": 222, "start": 1650.0, "end": 1651.76, "text": "nein nein er stirbt gleich"}, {"id": 223, "start": 1651.76, "end": 1652.76, "text": "oder"}, {"id": 224, "start": 1652.76, "end": 1653.76, "text": "die sind alle unter ihm"}, {"id": 225, "start": 1653.76, "end": 1654.76, "text": "ralphios"}, {"id": 226, "start": 1654.76, "end": 1655.8, "text": "nein nein ralphios lass"}, {"id": 227, "start": 1655.8, "end": 1658.0, "text": "nein ralphios ralphios please"}, {"id": 228, "start": 1658.0, "end": 1659.44, "text": "ok ich gehe unten hin besser"}, {"id": 229, "start": 1659.44, "end": 1666.88, "text": "ich sollte vielleicht lieber mal hier hinter so ein komisches"}, {"id": 230, "start": 1666.88, "end": 1668.8, "text": "sorry weil die stellsten die stellsten ja hier rum"}, {"id": 231, "start": 1668.8, "end": 1670.4, "text": "so motion motion balls"}, {"id": 232, "start": 1670.4, "end": 1676.88, "text": "war nix wie weg"}, {"id": 233, "start": 1676.88, "end": 1682.16, "text": "oh wie warum schießen die zurück"}, {"id": 234, "start": 1682.16, "end": 1683.92, "text": "ich glaube jetzt erlauben die sich aber hier was"}, {"id": 235, "start": 1683.92, "end": 1690.88, "text": "einfach zurückschießen"}, {"id": 236, "start": 1690.88, "end": 1691.88, "text": "ich glaube"}, {"id": 237, "start": 1691.88, "end": 1694.04, "text": "cake wait man"}, {"id": 238, "start": 1694.04, "end": 1695.04, "text": "achtung achtung"}, {"id": 239, "start": 1695.04, "end": 1696.04, "text": "huge"}, {"id": 240, "start": 1696.04, "end": 1701.6, "text": "äh schlecht das war schlecht"}, {"id": 241, "start": 1701.6, "end": 1703.16, "text": "weil von da hinten kommt was"}, {"id": 242, "start": 1703.16, "end": 1704.64, "text": "ja ja ich weiß dass hinter mir einer ist"}, {"id": 243, "start": 1704.64, "end": 1711.56, "text": "hinter mir ist noch mehr"}, {"id": 244, "start": 1711.56, "end": 1714.0, "text": "ja ja ja ja ist ja gut"}, {"id": 245, "start": 1714.0, "end": 1715.0, "text": "lass mich in ruhe"}, {"id": 246, "start": 1715.0, "end": 1718.64, "text": "durchs fenster jawoll"}, {"id": 247, "start": 1718.64, "end": 1726.48, "text": "boah hier drinnen ist ja die hölle los"}, {"id": 248, "start": 1726.48, "end": 1727.48, "text": "äh"}, {"id": 249, "start": 1727.48, "end": 1734.04, "text": "hier drinnen hier gehts ab"}, {"id": 250, "start": 1734.04, "end": 1736.08, "text": "hier bräuchten wir jetzt irgendeinen panzer oder so"}, {"id": 251, "start": 1736.08, "end": 1737.08, "text": "das wäre richtig nice"}, {"id": 252, "start": 1737.08, "end": 1738.44, "text": "aber die machen das gut die gegner"}, {"id": 253, "start": 1738.44, "end": 1742.52, "text": "muss man mal sagen endlich mal ihre leute die irgendwie so eine art taktik wenigstens"}, {"id": 254, "start": 1742.52, "end": 1743.52, "text": "haben"}, {"id": 255, "start": 1743.52, "end": 1746.4, "text": "so wenn ich glück habe kann ich da irgendwie reinsporn so"}, {"id": 256, "start": 1746.4, "end": 1750.36, "text": "man kann ja auch die gegner die die die team jetzt nicht richtig selecten"}, {"id": 257, "start": 1750.36, "end": 1755.88, "text": "weil ich das game denkt nope no pass hier drüber"}, {"id": 258, "start": 1755.88, "end": 1766.04, "text": "lass mich spawnen spawn spawn spawn spawn spawn spawn spawn spawn spawn spawn spawn spawn"}, {"id": 259, "start": 1766.04, "end": 1767.04, "text": "nice"}, {"id": 260, "start": 1767.04, "end": 1769.84, "text": "p h x"}, {"id": 261, "start": 1769.84, "end": 1770.84, "text": "jetzt haben wirs"}, {"id": 262, "start": 1770.84, "end": 1773.84, "text": "boah"}, {"id": 263, "start": 1773.84, "end": 1780.28, "text": "alter warum kriegt man hier immer headshots"}, {"id": 264, "start": 1780.28, "end": 1784.08, "text": "von was krieg ich bitteschön headshots ich spray einfach sinnlos auf die gegner drauf"}, {"id": 265, "start": 1784.08, "end": 1785.24, "text": "kann doch keine headshots kriegen"}, {"id": 266, "start": 1785.24, "end": 1791.64, "text": "aber wenn das game meint ich mein ich werd mich jetzt"}, {"id": 267, "start": 1791.64, "end": 1800.56, "text": "ich werd mich natürlich nicht beschweren über headshots"}, {"id": 268, "start": 1800.56, "end": 1803.16, "text": "von da hat er mich gehittet na gut"}, {"id": 269, "start": 1803.16, "end": 1806.28, "text": "chat chain lore poc nice"}, {"id": 270, "start": 1806.28, "end": 1809.28, "text": "ahja ja"}, {"id": 271, "start": 1809.28, "end": 1813.0, "text": "chain lore ist am start dann kann er nix mehr schief gehen"}, {"id": 272, "start": 1813.0, "end": 1816.36, "text": "whoop arrive leute whoop arrive"}, {"id": 273, "start": 1816.36, "end": 1818.76, "text": "das emote haben wir dem chain lore zu verdanken"}, {"id": 274, "start": 1818.76, "end": 1820.92, "text": "die weihnachts emote achja stimmt da war ja was"}, {"id": 275, "start": 1820.92, "end": 1824.6, "text": "weihnachts emote da war ja was"}, {"id": 276, "start": 1824.6, "end": 1828.68, "text": "wollt ihr weihnachts emote rein machen rein machen"}, {"id": 277, "start": 1828.68, "end": 1842.92, "text": "übrigens hier probieren wir jetzt mal was es ist nicht auf dem dach a ist nicht auf"}, {"id": 278, "start": 1842.92, "end": 1846.68, "text": "dem dach a ist in der mitte wir probieren mal oder fatal"}, {"id": 279, "start": 1846.68, "end": 1849.2, "text": "ist schon am start ich wollte eigentlich versuchen ob man"}, {"id": 280, "start": 1849.2, "end": 1851.92, "text": "herum flenken kann aufs dach und dann von oben reintroppen"}, {"id": 281, "start": 1851.92, "end": 1856.16, "text": "aber ich glaube wir haben das schneller gelegt und gewonnen als ich irgendwie überhaupt"}, {"id": 282, "start": 1856.16, "end": 1857.16, "text": "am objective bin"}, {"id": 283, "start": 1857.16, "end": 1863.44, "text": "game game hallo"}, {"id": 284, "start": 1863.44, "end": 1868.44, "text": "game"}, {"id": 285, "start": 1868.44, "end": 1881.44, "text": "ah ok alles klar verstehe verstehe"}, {"id": 286, "start": 1881.44, "end": 1882.44, "text": "manchmal klappt das"}, {"id": 287, "start": 1882.44, "end": 1891.56, "text": "wir sprechen einfach lull das hat gehittet stolte stellt euch mal vor"}, {"id": 288, "start": 1891.56, "end": 1892.56, "text": "easy win"}, {"id": 289, "start": 1892.56, "end": 1899.8, "text": "the enemy is bugging out im wahrsten sinne des wortes"}, {"id": 290, "start": 1899.8, "end": 1901.56, "text": "er möchte uns damit so was anderes sagen"}, {"id": 291, "start": 1901.56, "end": 1908.32, "text": "überlegt euch mal wie schnell die runden starten könnten wieder"}, {"id": 292, "start": 1908.32, "end": 1910.76, "text": "wenn wir uns diese cringe sprüche nicht jedes mal anhören müssten"}, {"id": 293, "start": 1910.76, "end": 1916.16, "text": "dieses stage hat nie jemand getestet nö wahrscheinlich wie das meiste"}, {"id": 294, "start": 1916.16, "end": 1924.16, "text": "ich habe ein equipment destroyed dass die meistens kills im squad hatte ist egal"}, {"id": 295, "start": 1924.16, "end": 1928.36, "text": "hauptsache hauptsache ich habe ein equipment destroyed das ist mal richtig massive"}, {"id": 296, "start": 1928.36, "end": 1934.32, "text": "da gibt es bestimmt bald demnächst eine badge für equipment destroyer"}, {"id": 297, "start": 1934.32, "end": 1936.88, "text": "so was sehe ich denn hier sonst noch schönes drauf"}, {"id": 298, "start": 1936.88, "end": 1939.24, "text": "also fox da habe ich keine ahnung was das ist"}, {"id": 299, "start": 1939.24, "end": 1941.32, "text": "von der größe würde ich sagen fast ein lüfter oder so"}, {"id": 300, "start": 1941.32, "end": 1946.44, "text": "hier unten das erkennt man zu schlecht erkennt man auch nicht"}, {"id": 301, "start": 1946.44, "end": 1951.96, "text": "hier würde ich sagen tatsächlich auch irgendwelches netzwerk equipment oder so"}, {"id": 302, "start": 1951.96, "end": 1957.48, "text": "aber jetzt mal ernsthaft das sind irgendwelche alten hp kisten dl 380"}, {"id": 303, "start": 1957.48, "end": 1961.72, "text": "oder so was was macht dein nachbar damit im keller"}, {"id": 304, "start": 1961.72, "end": 1966.44, "text": "oder dein mieter damit im keller das ist schon ein nichts zu unterschätzendes"}, {"id": 305, "start": 1966.44, "end": 1970.08, "text": "equipment alles wahrscheinlich eher von ebay"}, {"id": 306, "start": 1970.08, "end": 1974.8, "text": "und dementsprechend halt auch warm und energie fressend und laut"}, {"id": 307, "start": 1974.8, "end": 1978.04, "text": "hat jemand eine ahnung was das hier in der mitte ist ist das ein fernseh"}, {"id": 308, "start": 1978.04, "end": 1984.68, "text": "ist das ein fernseh ist das ein crt fernseh hier in der mitte oder was ist das"}, {"id": 309, "start": 1984.68, "end": 1989.08, "text": "der macht web hosting ok web hosting im keller ist auch nicht"}, {"id": 310, "start": 1989.08, "end": 1994.4, "text": "verkehrt leute wenn ihr zu einem ordentlichen"}, {"id": 311, "start": 1994.4, "end": 2001.08, "text": "holster volt für eure für euer hosting ausrufezeichen hetzner im chat"}, {"id": 312, "start": 2003.6, "end": 2012.24, "text": "20 euro startgut haben für alle eure hosting ansprüche und besser als das"}, {"id": 313, "start": 2015.56, "end": 2019.76, "text": "das game wusste gerade nicht wo ich hin will"}, {"id": 314, "start": 2019.76, "end": 2025.24, "text": "guck mal wir sind vor den defendern am mkong am mkong was ist denn das für ein"}, {"id": 315, "start": 2025.24, "end": 2032.92, "text": "stumpfsinn game wer hat sich das wer hat sich das aus was hier los"}, {"id": 316, "start": 2032.92, "end": 2050.64, "text": "nein in der s schicken er ist geschudet"}, {"id": 317, "start": 2050.64, "end": 2066.76, "text": "wir haben a gelegt einfach schon nur wir waren wir waren vor den defendern da"}, {"id": 318, "start": 2066.76, "end": 2073.4, "text": "das hat doch nie im leben jemand getestet oder wir haben wir haben die"}, {"id": 319, "start": 2073.4, "end": 2076.88, "text": "erste base wir haben die erste base in luftgeschreckung in die luft"}, {"id": 320, "start": 2076.88, "end": 2081.48, "text": "gesprengt bevor die defender überhaupt da waren"}, {"id": 321, "start": 2081.48, "end": 2085.84, "text": "pepega testing sage ich mal dazu"}, {"id": 322, "start": 2089.52, "end": 2095.0, "text": "das ist auch so ein teil der map hier den keiner warum warum existiert dieser"}, {"id": 323, "start": 2095.0, "end": 2097.92, "text": "teil der map überhaupt"}, {"id": 324, "start": 2097.92, "end": 2107.76, "text": "ergibt nicht wirklich sind hätte ja keine ahnung können dass sie dass es"}, {"id": 325, "start": 2107.76, "end": 2111.16, "text": "geht näher hätte man vielleicht mal testen müssen aber ich glaube die haben"}, {"id": 326, "start": 2111.16, "end": 2115.56, "text": "ihr spiel eh nicht gespielt ok wir gucken jetzt mal wie ich nein nein nein"}, {"id": 327, "start": 2115.56, "end": 2121.16, "text": "ich renne jetzt einfach du triffst mich eh nicht soll du triffst mich nicht"}, {"id": 328, "start": 2121.16, "end": 2126.76, "text": "pack nein"}, {"id": 329, "start": 2137.76, "end": 2142.0, "text": "hier kommen welche motion sensors hin motion sensors"}, {"id": 330, "start": 2142.0, "end": 2153.24, "text": "da unten ist er"}, {"id": 331, "start": 2164.42, "end": 2169.68, "text": "easy das ist äußerst äußerst durchdacht gibt es im"}, {"id": 332, "start": 2169.68, "end": 2174.88, "text": "Battlefield Revolution? Nö. Gibt es nicht."}, {"id": 333, "start": 2177.2, "end": 2182.92, "text": "Es kann eine Antenne einstürzen, das ist aber alles."}, {"id": 334, "start": 2186.24, "end": 2191.48, "text": "Monarch! Monarch S! Alter! Jetzt wurde aber zugesprägt. Die Maps sind einfach zu"}, {"id": 335, "start": 2191.48, "end": 2197.84, "text": "big. Naja, in Rush geht es ja noch, aber ich gebe dir prinzipiell recht und die"}, {"id": 336, "start": 2197.84, "end": 2201.48, "text": "Maps sind dann auch null für Rush ausgelegt."}, {"id": 337, "start": 2205.84, "end": 2210.28, "text": "Es gibt keine Revolution, wie man das aus Battlefield 4 kennt. Das einzige"}, {"id": 338, "start": 2210.28, "end": 2213.88, "text": "Revolution Event ist das, was man im Trailer gesehen hat, wo die Seite vom"}, {"id": 339, "start": 2213.88, "end": 2221.92, "text": "Schiff umfällt und dann gibt es noch halt diese Geschichte mit dem..."}, {"id": 340, "start": 2221.92, "end": 2226.64, "text": "Okay, alles klar."}, {"id": 341, "start": 2229.04, "end": 2234.04, "text": "Da gibt es noch die Geschichte mit dem Mast auf dem Dach."}, {"id": 342, "start": 2234.04, "end": 2254.48, "text": "Aua! Die wollen es aber echt wissen hier. Ich verpiss mich mal kurz."}, {"id": 343, "start": 2256.48, "end": 2259.6, "text": "Fuck man! Aber jetzt gucken sie ja wirklich überall hin."}, {"id": 344, "start": 2259.6, "end": 2265.96, "text": "Das ganze Budget ging für den Tornado drauf, ja anscheinend. Der Tornado ist"}, {"id": 345, "start": 2265.96, "end": 2270.92, "text": "auch eines der sinnlossten Features überhaupt. Benutzt jetzt nach dem, sag"}, {"id": 346, "start": 2270.92, "end": 2275.48, "text": "man mal, nach dem anfänglichen Hype, benutzt irgendjemand diese Tornados"}, {"id": 347, "start": 2275.48, "end": 2278.56, "text": "überhaupt, wenn sie kommen?"}, {"id": 348, "start": 2281.12, "end": 2286.12, "text": "Also ich bin immer froh, wenn der Tornado nicht auf der Map spawnen, wo"}, {"id": 349, "start": 2286.12, "end": 2292.36, "text": "ich hin möchte. Alter, wir haben hier eine ziemliche PP-Gap-Position."}, {"id": 350, "start": 2294.56, "end": 2302.84, "text": "Gib ihm, gib ihm, gib ihm, gib ihm! Bunny hop in die Deckung! Bunny hoppen in die"}, {"id": 351, "start": 2302.84, "end": 2307.96, "text": "Deckung hat funktioniert. Jetzt geht's ran hier."}, {"id": 352, "start": 2307.96, "end": 2315.92, "text": "Gib ihm. Raus mit dem Crabling Hook und oben drauf."}, {"id": 353, "start": 2321.36, "end": 2329.0, "text": "Darf ich mal fragen von wo? Ach da, obvius, da hat, da, der, ah okay."}, {"id": 354, "start": 2329.0, "end": 2338.64, "text": "Das oben war ein Gegner? Wirklich? Ach das war ein Gegner! Ich dachte das ist ein"}, {"id": 355, "start": 2338.64, "end": 2345.56, "text": "Teammate, null. Ja dann ist okay. Dann war, dann war es richtig, dann war es richtig"}, {"id": 356, "start": 2345.56, "end": 2352.92, "text": "dumm. Ich dachte das ist, Moment, dann war der aber ganz schön langsam, oder?"}, {"id": 357, "start": 2352.92, "end": 2361.92, "text": "Fuck! Wird der Roboterhund vom Tornado aufgesaugt? Weiß ich nicht."}, {"id": 358, "start": 2361.92, "end": 2365.56, "text": "Ich dachte das, ich hab den gesehen, ich dachte das wäre ein Teammate. Guck mal, da ist"}, {"id": 359, "start": 2365.56, "end": 2374.0, "text": "übrigens Gehirntod. Gehirntod und Nutmage. Alles klar, wir haben, die Gegner, die Gegner wissen, wissen"}, {"id": 360, "start": 2374.0, "end": 2385.6, "text": "was das ist. Okay, das wird wirklich gerade ziemlich, ziemlich knapp hier. Die pushen"}, {"id": 361, "start": 2385.6, "end": 2389.84, "text": "doch jetzt auch gleich rum, die Jungs hier. So, erst mal kurz den Maul, sehr gut Max,"}, {"id": 362, "start": 2389.84, "end": 2406.24, "text": "sehr gut. Pack, da komm ich nicht hin. Okay, oder auch nicht. Alter, Pepega Aim. Zu viel,"}, {"id": 363, "start": 2406.24, "end": 2416.24, "text": "zu viel Hipspray, Mann. Zu viel Hipspray. Da wird man faul, ich sag euch, da wird, da"}, {"id": 364, "start": 2416.24, "end": 2429.6, "text": "wird man faul und bewegt die Maus immer richtig. Alter, ist ja gut jetzt. Was die Umstände"}, {"id": 365, "start": 2429.6, "end": 2434.28, "text": "bei DICE sollen echt nicht so geil sein, das kann ich mir vorstellen. Ich glaub die Kombination"}, {"id": 366, "start": 2434.28, "end": 2441.08, "text": "aus DICE wissen nicht mal, wie man Battlefield macht plus EA macht Druck und nervt, da kommt"}, {"id": 367, "start": 2441.08, "end": 2451.48, "text": "sowas raus. Oh, was ist das hier für ein Clusterfuck gerade? Da kommt was. What? Guter Play, das"}, {"id": 368, "start": 2451.48, "end": 2456.12, "text": "hat er gut gemacht. Das hat er gut gemacht, das hat er taktisch geschickt gemacht, C4"}, {"id": 369, "start": 2456.12, "end": 2460.12, "text": "um die Ecke und weg rennen. Das man muss das ja auch mal anerkennen können, wenn einer"}, {"id": 370, "start": 2460.12, "end": 2471.76, "text": "was Gescheites macht. Die haben aber jetzt ziemlich, oh wir haben nur noch 6 Tickets,"}, {"id": 371, "start": 2471.76, "end": 2481.24, "text": "wir verlieren. Leute, das ist die erste Runde, die wir losen. Was ist denn jetzt los? Losers,"}, {"id": 372, "start": 2481.24, "end": 2510.68, "text": "Any Losers? Will ich verlieren? Gib ihm, gib ihm. Ahhhh. Erste Runde, die wir losen."}, {"id": 373, "start": 2510.68, "end": 2531.68, "text": "Erste Runde verloren. Wo blief? Ach, ihr hattet hier mal ein paar euch, Chet, der dort gearbeitet"}, {"id": 374, "start": 2531.68, "end": 2541.48, "text": "hat, das ist interessant. Chet sagt, sie kennt einen DICE Entwickler. Ist das so wie früher,"}, {"id": 375, "start": 2541.48, "end": 2546.56, "text": "wo man gesagt hat, mein Vater arbeitet bei Microsoft, du wirst gebannt oder kennst du"}, {"id": 376, "start": 2546.56, "end": 2549.08, "text": "wirklich einen DICE Entwickler? Ja, kann ich mir durchaus vorstellen, dass es nicht so"}, {"id": 377, "start": 2549.08, "end": 2557.76, "text": "geil ist. Ich mein, wir haben uns ja letztens den, das mir gerade so eingefallen, wir haben"}, {"id": 378, "start": 2557.76, "end": 2563.44, "text": "uns ja letztens mal ein paar Stellenbewertungen, also ein paar Arbeitsplatzbewertungen von DICE"}, {"id": 379, "start": 2563.44, "end": 2568.48, "text": "angeguckt und die Leute haben ja auch geschrieben, sie verstehen nicht, wie man an den Wünschen,"}, {"id": 380, "start": 2568.48, "end": 2576.36, "text": "also wie man so an den Wünschen der Spieler vorbei entwickeln konnte. Zehn Flagen in"}, {"id": 381, "start": 2576.36, "end": 2586.24, "text": "einer Runde. Ja, wahrscheinlich random. Draus war schon ein gutes Quad und einen guten Heli-Flieger."}, {"id": 382, "start": 2586.24, "end": 2590.04, "text": "Ich glaube, wenn du einen guten Heli-Flieger hast, mit dem du mit kannst, das ist gar nicht"}, {"id": 383, "start": 2590.04, "end": 2602.44, "text": "so unmöglich. Was macht euch der Captain Poggers, ist der wieder am Start? Poggers?"}, {"id": 384, "start": 2602.44, "end": 2619.68, "text": "Ach guck mal da, das sparen wir jetzt rein. Übrigens, das ist der LLV, ich hätte das"}, {"id": 385, "start": 2619.68, "end": 2623.8, "text": "nicht für Möglichkeiten, aber LLV ist schlecht gegen Infanterie, die haben in diesem Spiel"}, {"id": 386, "start": 2623.8, "end": 2631.76, "text": "nichts getestet. Das Ding sollte eigentlich der Infanterie-Zerstörer sein. LLV, du alter"}, {"id": 387, "start": 2631.76, "end": 2637.68, "text": "Zerstörer. Ist es aber nicht. Das Ding schießt zu langsam und macht zu wenig Splashdamage"}, {"id": 388, "start": 2637.68, "end": 2662.28, "text": "und allgemein zu wenig Damage. Richtig hängen geblieben. Da geht einer auf B. Oh, oh, oh,"}, {"id": 389, "start": 2662.28, "end": 2676.44, "text": "oh, über mir. Fuck, da hinten war er noch. Aber die Legehenne ist raus. Legehenne wurde"}, {"id": 390, "start": 2676.44, "end": 2680.92, "text": "gemacht, Legehenne war erfolgreich. Mal gucken, ob die Legehenne durchgeht. Oh nee, ich glaube,"}, {"id": 391, "start": 2680.92, "end": 2690.88, "text": "die diffusen. Nein, einfach diffuse. Oh, Jutsch. Oh, Combat, Combat, Combat. Der verreckt jetzt."}, {"id": 392, "start": 2690.88, "end": 2700.98, "text": "Oh, oh, oooh. Also, wir können noch eins, zwei für Squad gebrauchen, dass wir hier wieder"}, {"id": 393, "start": 2700.98, "end": 2710.6, "text": "gut easy durchgehen. Guckt euch mal die Maps an. Es ist einfach offen. Einfach offen und"}, {"id": 394, "start": 2710.6, "end": 2717.56, "text": "du musst jetzt da ranrennen. Oh jetzt hat das Bunnyhop nicht funktioniert. Jetzt muss"}, {"id": 395, "start": 2717.56, "end": 2723.52, "text": "Irgendwie wieder mehr husten vielleicht klickt das auch mit anzahle das sind was ich erzähle wenn ich viel erzählen muss ich mehr husten oder"}, {"id": 396, "start": 2723.52, "end": 2725.52, "text": "Wenn ich wenig erzählen keine ahnung"}, {"id": 397, "start": 2726.32, "end": 2728.32, "text": "Ich sollte ein paar"}, {"id": 398, "start": 2728.92, "end": 2730.92, "text": "Smokes mitnehmen"}, {"id": 399, "start": 2732.8, "end": 2734.8, "text": "Verpiss dich ich baller einfach in deine richtung jetzt"}, {"id": 400, "start": 2739.96, "end": 2741.96, "text": "Ja klar man"}, {"id": 401, "start": 2743.2, "end": 2745.2, "text": "Omikron auf fack leute"}, {"id": 402, "start": 2745.2, "end": 2747.2, "text": "morgen tot fack"}, {"id": 403, "start": 2749.44, "end": 2751.44, "text": "Könnt schon das video hochladen"}, {"id": 404, "start": 2753.32, "end": 2755.44, "text": "Youtuber stirbt bei live stream oder was auch immer"}, {"id": 405, "start": 2757.28, "end": 2762.68, "text": "Was darf man als keine witzel drüber machen heutzutage weil doch man kann fast alles witzel machen"}, {"id": 406, "start": 2762.68, "end": 2778.92, "text": "Guck mal der lhw macht keinen splash damage"}, {"id": 407, "start": 2778.92, "end": 2784.2, "text": "Guck mal der lhw seht ihr wie der sackt, der sackt so hardcore der lhw man"}, {"id": 408, "start": 2788.52, "end": 2790.52, "text": "Seht ihr das, seht ihr das"}, {"id": 409, "start": 2790.52, "end": 2792.52, "text": "So schlecht man"}, {"id": 410, "start": 2795.8, "end": 2797.8, "text": "Jetzt leckt er auch noch"}, {"id": 411, "start": 2806.44, "end": 2809.88, "text": "Die musik passt ja ist wirklich so ein bisschen mario kart style"}, {"id": 412, "start": 2814.04, "end": 2816.8, "text": "Ok tschüss und tschüss"}, {"id": 413, "start": 2816.8, "end": 2818.8, "text": "Mal gucken ob wir wieder den nice move hier hinbekommen"}, {"id": 414, "start": 2822.8, "end": 2824.8, "text": "Ja hat wieder funktioniert"}, {"id": 415, "start": 2827.84, "end": 2832.24, "text": "Ich habe gedacht ich spreche aus der hüfte das war eine dumme idee ich hätte die iron sights gehen sollen"}, {"id": 416, "start": 2832.96, "end": 2838.24, "text": "Ich dachte komm du machst einfach links rechts strafe und baller wild in die richtung"}, {"id": 417, "start": 2838.88, "end": 2840.88, "text": "Das war nicht so schlau"}, {"id": 418, "start": 2840.88, "end": 2842.88, "text": "Ein richtiger pepega move"}, {"id": 419, "start": 2842.88, "end": 2844.88, "text": "Ein richtiger pepega move"}, {"id": 420, "start": 2844.88, "end": 2872.88, "text": "Ein richtiger pepega move was ist da oben los"}, {"id": 421, "start": 2874.88, "end": 2876.88, "text": "Okay jetzt aber"}, {"id": 422, "start": 2876.88, "end": 2878.88, "text": "Leute wir haben schon gelegt, Leute wir haben schon die lege hände gemacht bevor ich überhaupt fertig bin"}, {"id": 423, "start": 2878.88, "end": 2880.88, "text": "Das war ein hit"}, {"id": 424, "start": 2880.88, "end": 2882.88, "text": "X daubt"}, {"id": 425, "start": 2890.88, "end": 2892.88, "text": "Daubt, aber ganz große daubt das"}, {"id": 426, "start": 2892.88, "end": 2894.88, "text": "Das war ein hit"}, {"id": 427, "start": 2894.88, "end": 2896.88, "text": "Das war ein hit"}, {"id": 428, "start": 2896.88, "end": 2898.88, "text": "Das war ein hit"}, {"id": 429, "start": 2898.88, "end": 2900.88, "text": "Das war ein hit"}, {"id": 430, "start": 2900.88, "end": 2904.88, "text": "Das war ein hit"}, {"id": 431, "start": 2904.88, "end": 2906.88, "text": "Daubt, aber ganz große daubt das"}, {"id": 432, "start": 2909.88, "end": 2911.88, "text": "Daubt, aber ganz große daubt das"}, {"id": 433, "start": 2911.88, "end": 2913.88, "text": "Daubt, aber ganz große daubt das"}, {"id": 434, "start": 2923.88, "end": 2924.88, "text": "Also ein könnten wir als zwei als zwei könnten wir für es konnt noch gebraun, weiß ob der captain po bleach noch mal kommt"}, {"id": 435, "start": 2924.88, "end": 2926.88, "text": "Ja rühren und beten"}, {"id": 436, "start": 2931.6, "end": 2935.68, "text": "Achtung wo ane ist ein schild im welch"}, {"id": 437, "start": 2938.36, "end": 2941.72, "text": "Durfte nicht einsteigen war weil warum weil"}, {"id": 438, "start": 2943.64, "end": 2945.64, "text": "Aber wir haben sie"}, {"id": 439, "start": 2946.96, "end": 2949.48, "text": "Guck mal die jenkler haben das eigentlich ganz gut gemacht"}, {"id": 440, "start": 2949.48, "end": 2954.96, "text": "Die haben uns auch die haben uns auch wirklich ganz gut im zaum gehalten aber das hat das game hat sich gedacht nope"}, {"id": 441, "start": 2962.0, "end": 2964.0, "text": "Style down"}, {"id": 442, "start": 2965.12, "end": 2970.04, "text": "Es ist übrigens extrem irritierend das tote gegner noch sprechen und man denkt dort ist was"}, {"id": 443, "start": 2971.4, "end": 2977.4, "text": "Die haben übrigens auch nicht gefixt dass man gegner neber sich hört die 50 kilometer weg sind"}, {"id": 444, "start": 2977.4, "end": 2979.4, "text": "auch so ein ding"}, {"id": 445, "start": 2982.08, "end": 2986.44, "text": "Wenn er jetzt hat keiner getestet jetzt jetzt wird spannend wie"}, {"id": 446, "start": 2995.64, "end": 2997.64, "text": "Achtung"}, {"id": 447, "start": 2997.64, "end": 2999.64, "text": "Oh"}, {"id": 448, "start": 3006.0, "end": 3008.0, "text": "Back"}, {"id": 449, "start": 3009.96, "end": 3017.12, "text": "Liegt an der siedels soundkarte nein das legt da well viel problem hast du mehr oder weniger überall"}, {"id": 450, "start": 3017.12, "end": 3026.6, "text": "Ach mensch jetzt leute seid man nicht so oft zack"}, {"id": 451, "start": 3030.2, "end": 3033.72, "text": "Lk 0 sagt da das game heute deinstalliert kann ich verstehen"}, {"id": 452, "start": 3034.56, "end": 3036.76, "text": "Also wenn ich nicht ab und zu mal hier noch ein streem"}, {"id": 453, "start": 3037.56, "end": 3043.72, "text": "Streben würde und das mit mit euch zusammen halbwegs spaß machen würde würde ich wahrscheinlich auch nicht mehr spielen ich habe das nur"}, {"id": 454, "start": 3043.72, "end": 3047.4, "text": "Noch installiert wegen wegen stream sor"}, {"id": 455, "start": 3047.4, "end": 3075.04, "text": "Ohne ist weil wir das hier macht mir tatsächlich echt spaß mit den leuten dabei jetzt"}, {"id": 456, "start": 3077.44, "end": 3085.96, "text": "Jetzt geht wieder nix aber ich glaube der kriegt mich glaube der kann mich retten um die ecke"}, {"id": 457, "start": 3091.68, "end": 3093.68, "text": "So ein paar motion sensors rüber kloppen"}, {"id": 458, "start": 3096.56, "end": 3101.76, "text": "Bin mir nicht sicher wo hier was ist gerade noch mal noch mehr mauschen jetzt rüber rüber hier"}, {"id": 459, "start": 3101.76, "end": 3113.6, "text": "Aus irgendwelchen pointen ist da oben was achtung mensch game come on"}, {"id": 460, "start": 3117.36, "end": 3119.36, "text": "Es hätte so gut funktionieren können"}, {"id": 461, "start": 3123.04, "end": 3126.8, "text": "Hat es aber nicht wir haben noch mal eine chance leute noch mal eine chance"}, {"id": 462, "start": 3126.8, "end": 3135.28, "text": "Ach man das game fackt mich teilweise richtig ab"}, {"id": 463, "start": 3136.8, "end": 3143.92, "text": "Man kann sich auch nicht mehr auf auf geländer stellen das funktioniert nicht so immer wenn du auf den geländer gehen willst springt da rüber"}, {"id": 464, "start": 3147.28, "end": 3149.28, "text": "Rittenfriede für den zapp"}, {"id": 465, "start": 3153.28, "end": 3155.28, "text": "Sagt"}, {"id": 466, "start": 3155.28, "end": 3157.76, "text": "ist abel anzeige ist raus"}, {"id": 467, "start": 3160.08, "end": 3166.6, "text": "Der typisch liegt bestimmt immer noch da ich spreide jetzt einfach dass er sich nicht traut"}, {"id": 468, "start": 3166.6, "end": 3177.32, "text": "Okay die gegner das wird jetzt richtig zum es zum esl match hier"}, {"id": 469, "start": 3189.52, "end": 3194.28, "text": "Lull wie so nicht das hast du dir so gedacht alda na"}, {"id": 470, "start": 3194.28, "end": 3198.8, "text": "Das hast du dir so gedacht ich warte mal dass die beim dass er bei mir spawnen kann"}, {"id": 471, "start": 3198.8, "end": 3204.0, "text": "Ah"}, {"id": 472, "start": 3204.0, "end": 3231.14, "text": "Was hältst du von coding bootcamps?"}, {"id": 473, "start": 3231.14, "end": 3232.14, "text": "Kommt drauf an!"}, {"id": 474, "start": 3232.14, "end": 3241.32, "text": "Was das für ein thema ist und ob das mit oder ohne bezahlung ist oder oder oder je"}, {"id": 475, "start": 3241.32, "end": 3246.42, "text": "nachdem also von der firma nicht von der firma irgendwas freiwilliges irgendwas hackerstellts"}, {"id": 476, "start": 3246.42, "end": 3250.72, "text": "mäßiges oder alter ich habe 50 gegner um mich drum herum obwohl hier eigentlich gar"}, {"id": 477, "start": 3250.72, "end": 3255.24, "text": "nichts ist weiß gar nicht wo der ist"}, {"id": 478, "start": 3255.24, "end": 3262.44, "text": "der typ ist immer noch da oben ich fasse es nicht alter"}, {"id": 479, "start": 3262.44, "end": 3275.44, "text": "ok wir müssen auf jeden fall noch motion sensor darüber klatschen jetzt dass wir was"}, {"id": 480, "start": 3275.44, "end": 3287.88, "text": "sehen da oben ist ja die familien ist ja weihnachtsfeier da ist ja wirklich weihnachtsfeier drauf"}, {"id": 481, "start": 3287.88, "end": 3297.88, "text": "einmal probiert ich habe noch ich habe übrigens noch nie erlebt dass es in stocken gerät"}, {"id": 482, "start": 3297.88, "end": 3303.88, "text": "an dieser base das ist das ist mir neu ich glaube fast rush ist ziemlich defender heavy"}, {"id": 483, "start": 3303.88, "end": 3307.88, "text": "wenn man einmal in stocken kommt jetzt einen sagen die leute ja klar max das ist rush aber"}, {"id": 484, "start": 3307.88, "end": 3313.8, "text": "das muss ja nicht zwangsläufig so sein weiß gar nicht wo ich hin soll wir sind zu wenige"}, {"id": 485, "start": 3313.8, "end": 3315.68, "text": "wisst ihr was wir gehen jetzt hierüber"}, {"id": 486, "start": 3315.68, "end": 3319.88, "text": "nein ich weiß nicht was ich tue"}, {"id": 487, "start": 3319.88, "end": 3326.56, "text": "sieht so aus als wüsste ich was ich tue"}, {"id": 488, "start": 3326.56, "end": 3338.76, "text": "weiß nicht was ich tue steigt mal lieber ab jungs"}, {"id": 489, "start": 3338.76, "end": 3339.76, "text": "monka stier"}, {"id": 490, "start": 3339.76, "end": 3344.8, "text": "da hinter mir steht er monka stier aber vielleicht sind wir jetzt ein bisschen rangekommen"}, {"id": 491, "start": 3344.8, "end": 3353.56, "text": "nein verloren so wir brauchen noch zwei teammates leute es geht nicht dass wir runden verlieren"}, {"id": 492, "start": 3353.56, "end": 3357.48, "text": "zweite runde in folge verloren"}, {"id": 493, "start": 3357.48, "end": 3369.2, "text": "das ist ausgeschlossen das ist only wind stream"}, {"id": 494, "start": 3369.2, "end": 3370.84, "text": "der guckt schon so richtig pains champ"}, {"id": 495, "start": 3370.84, "end": 3380.04, "text": "hast du schon mal drüber nach einer handschauderung zu spielen habe ich mir noch nie angeguckt"}, {"id": 496, "start": 3380.04, "end": 3386.36, "text": "ich weiß was das ist dass das die das ist das crytek wie nennt man diese genre keine"}, {"id": 497, "start": 3386.36, "end": 3387.36, "text": "ahnung"}, {"id": 498, "start": 3387.36, "end": 3390.44, "text": "right jetzt ist ja kein battle royale es ist crytek"}, {"id": 499, "start": 3390.44, "end": 3393.88, "text": "wie nennt man das genre von von handschauderung"}, {"id": 500, "start": 3393.88, "end": 3399.2, "text": "kannst du mal zeigen wie das geht mit aufsätze level mit bots"}, {"id": 501, "start": 3399.2, "end": 3402.24, "text": "ja das würde ich eigentlich zeigen bevor ich oft gehe weil sonst müssen die leute im"}, {"id": 502, "start": 3402.24, "end": 3403.24, "text": "squad hier warten"}, {"id": 503, "start": 3403.24, "end": 3410.64, "text": "oh nee our class battle kann ich mal kurz zeigen wie man aufsätze"}, {"id": 504, "start": 3410.64, "end": 3411.64, "text": "leveled"}, {"id": 505, "start": 3411.64, "end": 3413.84, "text": "auf our class habe ich eh keinen bock"}, {"id": 506, "start": 3413.84, "end": 3423.64, "text": "würde sagen dauert 10 minuten oder so 10 10 minuten 10 15"}, {"id": 507, "start": 3423.64, "end": 3428.46, "text": "also als nächster gehen wir die map auslassen ok also dann zeige ich euch das jetzt mal"}, {"id": 508, "start": 3428.46, "end": 3429.46, "text": "schnell"}, {"id": 509, "start": 3429.46, "end": 3435.32, "text": "wie man aufsätze leveled"}, {"id": 510, "start": 3435.32, "end": 3436.32, "text": "also"}, {"id": 511, "start": 3436.32, "end": 3437.32, "text": "zack"}, {"id": 512, "start": 3437.32, "end": 3445.16, "text": "also ihr geht all out warfare"}, {"id": 513, "start": 3445.16, "end": 3446.16, "text": "nein"}, {"id": 514, "start": 3446.16, "end": 3451.36, "text": "achso ich bin nicht der party leader deswegen ich muss die party leaven"}, {"id": 515, "start": 3451.36, "end": 3452.36, "text": "leave party"}, {"id": 516, "start": 3452.36, "end": 3455.36, "text": "so ihr geht auf all out warfare"}, {"id": 517, "start": 3455.36, "end": 3462.2, "text": "change game mode solo dann sagt ihr hier change settings mit f warum auch immer"}, {"id": 518, "start": 3462.2, "end": 3466.52, "text": "und ihr müsst kaleidoskop auswählen und start"}, {"id": 519, "start": 3466.52, "end": 3470.0, "text": "wichtig ist ihr müsst attacker sein aber ich glaube es gibt nur attacker wenn ihr solo"}, {"id": 520, "start": 3470.0, "end": 3471.0, "text": "spielt"}, {"id": 521, "start": 3471.0, "end": 3488.04, "text": "so und dann müsst ihr die erste base schnell clear"}, {"id": 522, "start": 3488.04, "end": 3493.44, "text": "und dann aufs hochhaus und auf dem hochhaus gibt es den level bug glitch"}, {"id": 523, "start": 3493.44, "end": 3499.24, "text": "wie auch immer man das nennen mag"}, {"id": 524, "start": 3499.24, "end": 3501.24, "text": "ich euch"}, {"id": 525, "start": 3501.24, "end": 3505.28, "text": "stellt die bots auf noob bots ist es egal ob ihr noob bots oder gute bots killt"}, {"id": 526, "start": 3505.28, "end": 3507.52, "text": "überhaupt kein unterschied"}, {"id": 527, "start": 3507.52, "end": 3508.52, "text": "zählt"}, {"id": 528, "start": 3508.52, "end": 3515.86, "text": "übrigens ihr müsst auch wenn ihr solo spielt 5 stunden warten bis das game startet"}, {"id": 529, "start": 3515.86, "end": 3523.36, "text": "warum weiß ich nicht müssen wir dice fragen"}, {"id": 530, "start": 3523.36, "end": 3531.92, "text": "der grinst auch schon so"}, {"id": 531, "start": 3531.92, "end": 3534.36, "text": "truckel übrigens bei mir auch das nicht nur bei euch im streben"}, {"id": 532, "start": 3534.36, "end": 3543.72, "text": "so da müsst ihr hin guck hier oben hier auf dieses auf dieses haus müsst ihr klein"}, {"id": 533, "start": 3543.72, "end": 3547.36, "text": "also erst mal erste und zweite base clear"}, {"id": 534, "start": 3547.36, "end": 3549.0, "text": "erste zweite base clear"}, {"id": 535, "start": 3549.0, "end": 3551.56, "text": "was gegen bots relativ einfach ist"}, {"id": 536, "start": 3551.56, "end": 3555.0, "text": "und dann da oben da oben drauf hier oben ist so ein lüftungsschacht"}, {"id": 537, "start": 3555.0, "end": 3558.16, "text": "da müsst ihr hin"}, {"id": 538, "start": 3558.16, "end": 3559.16, "text": "eigentlich euch klein"}, {"id": 539, "start": 3559.16, "end": 3566.16, "text": "ich weiß auch nicht ob es da nicht vielleicht bessere varianten gibt"}, {"id": 540, "start": 3566.16, "end": 3567.16, "text": "im direkten panzer"}, {"id": 541, "start": 3567.16, "end": 3570.16, "text": "panzer noobs"}, {"id": 542, "start": 3570.16, "end": 3577.84, "text": "muss erst mal intro angucken"}, {"id": 543, "start": 3577.84, "end": 3582.44, "text": "muss man die runde gewinnt für xp nein"}, {"id": 544, "start": 3582.44, "end": 3585.04, "text": "es geht ja nicht um xp es geht ja um attachments freischalten"}, {"id": 545, "start": 3585.04, "end": 3592.88, "text": "ich will nicht ich ach so shotgun level ja das können wir dann gleich machen"}, {"id": 546, "start": 3592.88, "end": 3596.76, "text": "also ihr müsst jetzt erst mal also unser ziel ist glaube ich c1"}, {"id": 547, "start": 3596.76, "end": 3601.56, "text": "wir müssen jetzt a2 a1 schnell machen dann b1 b gibt es nur ein objective wenn ich das"}, {"id": 548, "start": 3601.56, "end": 3602.56, "text": "richtig im kopf habe"}, {"id": 549, "start": 3602.56, "end": 3609.24, "text": "und ja dann ja ja bots lasst mich in ruhe"}, {"id": 550, "start": 3609.24, "end": 3610.24, "text": "easy as fuck"}, {"id": 551, "start": 3610.24, "end": 3617.64, "text": "so wir müssen jetzt erst mal die bots clear die hier rumstehen"}, {"id": 552, "start": 3617.64, "end": 3634.56, "text": "ne das stirbt nicht"}, {"id": 553, "start": 3634.56, "end": 3636.96, "text": "meine team mates sind richtig richtig richtig porgas"}, {"id": 554, "start": 3636.96, "end": 3643.16, "text": "ok wenn wir glück haben kommen wir da jetzt schon ran und legen"}, {"id": 555, "start": 3643.16, "end": 3645.56, "text": "ach das ist ja break through das ist ja gar kein rush"}, {"id": 556, "start": 3645.56, "end": 3648.6, "text": "was erzähle ich denn hier legen man richtig hängen geblieben"}, {"id": 557, "start": 3648.6, "end": 3655.6, "text": "so also a1 cap schon"}, {"id": 558, "start": 3655.6, "end": 3663.16, "text": "drei stunden später"}, {"id": 559, "start": 3663.16, "end": 3667.52, "text": "habt ihr gestern eine runde trat ja ich auch"}, {"id": 560, "start": 3667.52, "end": 3672.92, "text": "ich habe fast die komplette fast die komplette k30 dort gelewelt"}, {"id": 561, "start": 3672.92, "end": 3677.04, "text": "also einnehmen drei stunden später ist es dann irgendwann"}, {"id": 562, "start": 3677.04, "end": 3678.04, "text": "eingenommen"}, {"id": 563, "start": 3678.04, "end": 3683.24, "text": "dann geht es rüber zu a2 dann b2 und dann oben aufs haus"}, {"id": 564, "start": 3683.24, "end": 3688.52, "text": "da kommt noch was ok wir haben es jetzt rüber"}, {"id": 565, "start": 3688.52, "end": 3691.42, "text": "das müsst ihr auch nur einmal machen das könnt ihr euch auch ein bisschen zeit lassen"}, {"id": 566, "start": 3691.42, "end": 3694.92, "text": "und die waffe leveln oder so das ist das ist easy"}, {"id": 567, "start": 3694.92, "end": 3705.0, "text": "oh nein die bots sind gar nicht so dumm"}, {"id": 568, "start": 3705.0, "end": 3707.72, "text": "das war jetzt schlechtes beispiel hier waren die bots jetzt wirklich dumm"}, {"id": 569, "start": 3707.72, "end": 3733.88, "text": "aber an sich sind die bots gar nicht gar nicht so dumm"}, {"id": 570, "start": 3733.88, "end": 3737.76, "text": "ja der bot killt mich gleich team komm on please"}, {"id": 571, "start": 3737.76, "end": 3750.56, "text": "ok da konnte ich jetzt gar wirklich nix machen"}, {"id": 572, "start": 3750.56, "end": 3754.28, "text": "es ist wirklich wenn du akkus ziehst von den bots"}, {"id": 573, "start": 3754.28, "end": 3756.92, "text": "achja übrigens meine teammates sind so schlau die wiederbeleben nicht"}, {"id": 574, "start": 3756.92, "end": 3760.52, "text": "die haben da schon mal gar kein bock drauf"}, {"id": 575, "start": 3760.52, "end": 3765.08, "text": "richtiges bot team ja korrekt"}, {"id": 576, "start": 3765.08, "end": 3767.72, "text": "aber das machen wir jetzt schnell das zeige ich ihr könnt auch wunderbar die waffe leveln"}, {"id": 577, "start": 3767.72, "end": 3771.16, "text": "guck mal also easier kriegt ihr keine 20 kills"}, {"id": 578, "start": 3771.16, "end": 3789.36, "text": "so team please kommt mal rein"}, {"id": 579, "start": 3789.36, "end": 3795.4, "text": "kommt mal rein team auf gib ihm wir gehen jetzt einfach hier oben"}, {"id": 580, "start": 3795.4, "end": 3801.24, "text": "drauf das kann euch das kann euch bei bot battles"}, {"id": 581, "start": 3801.24, "end": 3805.24, "text": "manchmal passieren dass euer team wirklich nicht nicht nachrückt"}, {"id": 582, "start": 3805.24, "end": 3812.68, "text": "und das ist dann natürlich pains champ er so nehmt ne muni kiste mit leute"}, {"id": 583, "start": 3812.68, "end": 3820.36, "text": "das ist das allerwichtigste ihr müsst ne muni kiste mitnehmen"}, {"id": 584, "start": 3820.36, "end": 3825.36, "text": "muni kiste mitnehmen unglaublich wichtig ihr braucht ne muni kiste"}, {"id": 585, "start": 3825.36, "end": 3828.6, "text": "ohne muni kiste könnt ihr das nämlich gleich auf dem dach nicht machen"}, {"id": 586, "start": 3828.6, "end": 3830.64, "text": "ok ich glaub wir haben es steht hier einer in der eck"}, {"id": 587, "start": 3830.64, "end": 3840.12, "text": "so das jetzt ne ihr braucht ne muni kiste weil ihr auf dem dach später keine möglichkeit"}, {"id": 588, "start": 3840.12, "end": 3841.92, "text": "habt euch zu refreshen"}, {"id": 589, "start": 3841.92, "end": 3845.88, "text": "ihr müsst muni kiste und mckay ist auch ein dummer specialist"}, {"id": 590, "start": 3845.88, "end": 3850.36, "text": "ihr müsst maria falck mitnehmen maria falck für sehr viel und ammo kiste"}, {"id": 591, "start": 3850.36, "end": 3855.04, "text": "das ist das ist eigentlich das eigentliche meta für waffen unlocks"}, {"id": 592, "start": 3855.04, "end": 3860.6, "text": "das heißt ich werd mich nochmal killen lassen wenn wir das hier eingenommen haben"}, {"id": 593, "start": 3860.6, "end": 3868.76, "text": "und so jetzt brauchen wir noch eine eine genau das hier brauchen wir jetzt noch b1"}, {"id": 594, "start": 3868.76, "end": 3872.96, "text": "und dann gehts hoch aufs hochhaus und dann ist unlock waffen unlock farmen"}, {"id": 595, "start": 3872.96, "end": 3879.64, "text": "angesagt true luvie genau"}, {"id": 596, "start": 3879.64, "end": 3886.8, "text": "komm mal macht das eigentlich damage macht das hier damage"}, {"id": 597, "start": 3886.8, "end": 3904.24, "text": "lass mich mal kurz so durchrushen b1"}, {"id": 598, "start": 3904.24, "end": 3909.36, "text": "der grappling hook hat auch 50 prozent damage gemacht noch vorm patch"}, {"id": 599, "start": 3909.36, "end": 3912.64, "text": "weiß nicht warum es das jetzt nicht mehr macht"}, {"id": 600, "start": 3912.64, "end": 3916.08, "text": "hier ist das problem die bots sind zu dumm"}, {"id": 601, "start": 3916.08, "end": 3919.32, "text": "die bots sind zu dumm hier durchzukommen das heißt ihr müsst auf jeden fall das"}, {"id": 602, "start": 3919.32, "end": 3923.16, "text": "clearen sonst wird das nix und nachdem ihr euch heilen müsst"}, {"id": 603, "start": 3923.16, "end": 3927.64, "text": "wie gesagt maria falck ammo pack midi midi midi stels"}, {"id": 604, "start": 3927.64, "end": 3930.32, "text": "die sind alle hier unten die bots guckt"}, {"id": 605, "start": 3930.32, "end": 3946.72, "text": "irgendwas hinter mir stellts da jetzt rum so mein team ist halt so richtig"}, {"id": 606, "start": 3946.72, "end": 3963.88, "text": "richtig schnell"}, {"id": 607, "start": 3963.88, "end": 3978.72, "text": "okay jetzt switchen wir mal auf die eigentlich sinnvolle klasse dafür"}, {"id": 608, "start": 3978.72, "end": 3983.64, "text": "komm mal schon schon 42 kills für fast nix ihr braucht 300 kills ihr braucht 300 kills"}, {"id": 609, "start": 3983.64, "end": 3984.64, "text": "für für alles"}, {"id": 610, "start": 3984.64, "end": 3990.6, "text": "okay also jetzt switchen wir mal auf die sinnvolle klasse dafür"}, {"id": 611, "start": 3990.6, "end": 4003.76, "text": "also maria falck midi pack"}, {"id": 612, "start": 4003.76, "end": 4022.64, "text": "schiebt da rein mit dem g baited beste musik dafür"}, {"id": 613, "start": 4022.64, "end": 4036.0, "text": "so da unten ist wieder alles voll"}, {"id": 614, "start": 4036.0, "end": 4038.92, "text": "ich hab da so viel gekillt die müssten es eigentlich ohne probleme hinbekommen aber"}, {"id": 615, "start": 4038.92, "end": 4040.4, "text": "ich meine das sind bots darf man nicht vergessen"}, {"id": 616, "start": 4040.4, "end": 4054.04, "text": "mein teammates können sich reviven ich probiere das mal ob die ob die reviven ob die so schlau"}, {"id": 617, "start": 4054.04, "end": 4057.04, "text": "sind und reviven können aber das geht glaube ich nicht"}, {"id": 618, "start": 4057.04, "end": 4074.48, "text": "auto ja die lasern dich teilweise"}, {"id": 619, "start": 4074.48, "end": 4087.04, "text": "huge car steuerung monka monka steer das war keine so gute idee"}, {"id": 620, "start": 4087.04, "end": 4088.04, "text": "okay jetzt aber hier"}, {"id": 621, "start": 4088.04, "end": 4100.2, "text": "sag mal ich muss bots bashen alter ich will euch einfach nur zeigen wo man waffen levelt"}, {"id": 622, "start": 4100.2, "end": 4109.92, "text": "aber gerade wollen die bots nicht"}, {"id": 623, "start": 4109.92, "end": 4113.52, "text": "aber noch irgendwas spannendes"}, {"id": 624, "start": 4113.52, "end": 4115.52, "text": "es gibt übrigens auch keine squats in diesem modus"}, {"id": 625, "start": 4115.52, "end": 4119.2, "text": "die ai geht manchmal richtig ab"}, {"id": 626, "start": 4119.2, "end": 4129.72, "text": "das ziel ist ja waffenleveln deswegen finde ich mit autos gar nicht mal so sinnvoll"}, {"id": 627, "start": 4129.72, "end": 4130.72, "text": "die bots können mehr"}, {"id": 628, "start": 4130.72, "end": 4134.32, "text": "nee ich hab das gestern auch gemacht das ist easy as fuck"}, {"id": 629, "start": 4134.32, "end": 4136.2, "text": "ich hab ich hab da zehn minuten für gebraucht"}, {"id": 630, "start": 4136.2, "end": 4159.08, "text": "alter okay jetzt aber"}, {"id": 631, "start": 4159.08, "end": 4167.84, "text": "du musst dich richtig anstrengen man gegen die bots"}, {"id": 632, "start": 4167.84, "end": 4176.24, "text": "sollen es so"}, {"id": 633, "start": 4176.24, "end": 4177.24, "text": "jetzt haben wir es aber"}, {"id": 634, "start": 4177.24, "end": 4194.92, "text": "ich glaube jetzt haben wir es meine güte das war ja schwere geburt"}, {"id": 635, "start": 4194.92, "end": 4199.24, "text": "das war eine schwere geburt so wenn wir das haben es gibt nur b1 was anderes gibt es"}, {"id": 636, "start": 4199.24, "end": 4202.24, "text": "nicht"}, {"id": 637, "start": 4202.24, "end": 4208.92, "text": "dann kommt die geschichte mit dem haus auf die kommt es an"}, {"id": 638, "start": 4208.92, "end": 4211.32, "text": "deswegen braucht ihr auch die muni kiste sonst wird das ganze nicht"}, {"id": 639, "start": 4211.32, "end": 4215.88, "text": "ich meine guck mal ich hab schon 58 kills"}, {"id": 640, "start": 4215.88, "end": 4221.8, "text": "kann man easy kills machen zwischendurch"}, {"id": 641, "start": 4221.8, "end": 4227.84, "text": "so wir haben es und jetzt geht das andere auf"}, {"id": 642, "start": 4227.84, "end": 4233.96, "text": "und jetzt und jetzt jetzt kommt jetzt wird es"}, {"id": 643, "start": 4233.96, "end": 4238.92, "text": "muss man nicht angel nehmen nur ich hab das auch ohne angel gestern gemacht"}, {"id": 644, "start": 4238.92, "end": 4245.76, "text": "es gibt es gibt bestimmt zig taktiken für ich hab es gestern so gemacht"}, {"id": 645, "start": 4245.76, "end": 4248.44, "text": "ich hab es gestern so gemacht ich bleib mal hier bevor es die bots noch verlieren"}, {"id": 646, "start": 4248.44, "end": 4257.36, "text": "also ich ich hab es gestern so gemacht weil du hast ammo box und du kannst dich selbst"}, {"id": 647, "start": 4257.36, "end": 4258.36, "text": "verteilen"}, {"id": 648, "start": 4258.36, "end": 4262.2, "text": "ist wahrscheinlich wahrscheinlich geschmackssache"}, {"id": 649, "start": 4262.2, "end": 4265.56, "text": "so jetzt müssen wir hier oben hin"}, {"id": 650, "start": 4265.56, "end": 4269.36, "text": "da da hoch c1"}, {"id": 651, "start": 4269.36, "end": 4276.44, "text": "c1 hinter und da müssen wir möglichst schnell hoch bevor die 30 milliarden bots da sind"}, {"id": 652, "start": 4276.44, "end": 4280.56, "text": "ich bin jetzt mit dem heli hochgeflogen das hat gut funktioniert"}, {"id": 653, "start": 4280.56, "end": 4288.96, "text": "als als passagier wir gucken ob wir es mit dem fahrstuhl auch schaffen"}, {"id": 654, "start": 4288.96, "end": 4293.6, "text": "aber wahrscheinlich wirst du komplett weggespreit im fahrstuhl schon"}, {"id": 655, "start": 4293.6, "end": 4298.08, "text": "da da müssen wir hin da ist so eine luftschacht und da muss man hin"}, {"id": 656, "start": 4298.08, "end": 4302.56, "text": "ohne heli wirst du es gelasert mal gucken ich hab es noch nicht probiert mit dem fahrstuhl"}, {"id": 657, "start": 4302.56, "end": 4312.12, "text": "wo sind die fahrstühle noch mal hier"}, {"id": 658, "start": 4312.12, "end": 4313.12, "text": "wo sind die fahrstühle"}, {"id": 659, "start": 4313.12, "end": 4315.88, "text": "hier rechts"}, {"id": 660, "start": 4315.88, "end": 4318.68, "text": "da hier"}, {"id": 661, "start": 4318.68, "end": 4324.56, "text": "pass auf ich werde jetzt weggelasert von den bots"}, {"id": 662, "start": 4324.56, "end": 4333.96, "text": "also da dahin nicht der ach der ah ja falsche seite"}, {"id": 663, "start": 4333.96, "end": 4342.4, "text": "so so müsste ich einmal durch das einmal durch das dach das wird nichts also wir müssen"}, {"id": 664, "start": 4342.4, "end": 4345.52, "text": "hier raus und an die recht rechts runter was wahrscheinlich nichts wird"}, {"id": 665, "start": 4345.52, "end": 4351.28, "text": "probieren wir mal ansonsten ansonsten mit dem heli ansonsten mit dem heli rauf"}, {"id": 666, "start": 4351.28, "end": 4362.52, "text": "und es kann ja auch ein bisschen dauern"}, {"id": 667, "start": 4362.52, "end": 4367.04, "text": "so hier hin müsst ihr leute hier hin und jetzt einfach nur ihr legt hier hinten das"}, {"id": 668, "start": 4367.04, "end": 4373.12, "text": "ding hin und jetzt"}, {"id": 669, "start": 4373.12, "end": 4377.52, "text": "jetzt fahrt ihr eure 300 kills"}, {"id": 670, "start": 4377.52, "end": 4391.08, "text": "die bots können euch nicht hitten"}, {"id": 671, "start": 4391.08, "end": 4393.52, "text": "du kannst auch hier man kann auch hier drüber gucken das geht auch"}, {"id": 672, "start": 4393.52, "end": 4403.88, "text": "aber ich habe es gestern so gemacht hin hingelegt ich habe es im prinzip so gemacht"}, {"id": 673, "start": 4403.88, "end": 4408.52, "text": "ich habe mich in mein ammo pack gelegt ammo pack hier hin"}, {"id": 674, "start": 4408.52, "end": 4411.56, "text": "ich habe mich in mein ammo pack gelegt und ungefähr"}, {"id": 675, "start": 4411.56, "end": 4415.08, "text": "ungefähr zehn minuten hier gelegen ach so ihr dürft nicht so viele bots killen sonst"}, {"id": 676, "start": 4415.08, "end": 4416.08, "text": "passiert das"}, {"id": 677, "start": 4416.08, "end": 4420.2, "text": "eure ai gewinnt und das ist schlecht ihr wollt nicht dass eure ai gewinnt"}, {"id": 678, "start": 4420.2, "end": 4425.88, "text": "eure ai soll verrecken das war jetzt dumm ich habe zu viele bots gekillt"}, {"id": 679, "start": 4425.88, "end": 4435.56, "text": "also ich warte jetzt mal bis meine ai hoffentlich stirbt"}, {"id": 680, "start": 4435.56, "end": 4444.88, "text": "hoffentlich hoffentlich stirbt meine ai leute kratzt mal ab"}, {"id": 681, "start": 4444.88, "end": 4454.92, "text": "aber ihr habt es gesehen das ist im prinzip das ist im prinzip der trick"}, {"id": 682, "start": 4454.92, "end": 4458.96, "text": "ok meine ai ist tot sehr gut das ist der trick"}, {"id": 683, "start": 4458.96, "end": 4478.96, "text": "ja"}, {"id": 684, "start": 4478.96, "end": 4482.32, "text": "nein ich würde auf gar keinen fall belphi kaufen gerade"}, {"id": 685, "start": 4482.32, "end": 4487.12, "text": "so und da macht ihr jetzt einfach eure 300 kills"}, {"id": 686, "start": 4487.12, "end": 4494.32, "text": "bleibt hier in diesem ammo pack liegen und und seit ironside enjoyer"}, {"id": 687, "start": 4494.32, "end": 4515.68, "text": "fertig und legt euch irgendwie so hin dass es nicht rumklitscht"}, {"id": 688, "start": 4515.68, "end": 4517.88, "text": "so funktioniert das die bots können euch nicht hin"}, {"id": 689, "start": 4517.88, "end": 4522.6, "text": "die einzige sache wo euch die bots manchmal hitten könnten ist von hier"}, {"id": 690, "start": 4522.6, "end": 4527.12, "text": "und deswegen lege ich mich da unten hin ja du kannst nur aufsätze leveln"}, {"id": 691, "start": 4527.12, "end": 4530.08, "text": "ich lege mich so hin weil das checken die bots nicht"}, {"id": 692, "start": 4530.08, "end": 4541.04, "text": "so was wollte ich leveln auto shotgun"}, {"id": 693, "start": 4541.04, "end": 4546.04, "text": "waren wir jetzt aber nicht im stream so also ihr habt es gesehen easy"}, {"id": 694, "start": 4546.04, "end": 4557.68, "text": "so funktioniert das und da habt ihr in einer viertelstunde die"}, {"id": 695, "start": 4557.68, "end": 4571.92, "text": "waffe frei auf gehts"}, {"id": 696, "start": 4571.92, "end": 4577.48, "text": "ihr da ist hast diesen trick ja wahrscheinlich weil jetzt können die"}, {"id": 697, "start": 4577.48, "end": 4587.44, "text": "leute easy alles anlocken aber ganz ehrlich ich finde das ist auch"}, {"id": 698, "start": 4587.44, "end": 4595.24, "text": "notwendig das ist ich ganz ehrlich ich finde das anlocken in dem game ist so"}, {"id": 699, "start": 4595.24, "end": 4602.24, "text": "eines der unenjoyigsten sachen aller zeiten toller satz also es macht überhaupt"}, {"id": 700, "start": 4602.24, "end": 4607.84, "text": "kein bock sachen hier frei zu spielen weil es gibt alles doppelt und dreifach"}, {"id": 701, "start": 4607.84, "end": 4614.0, "text": "und eigentlich gibt es ja auch nur sagen wir mal 2 1 2 kombinationen die du"}, {"id": 702, "start": 4614.0, "end": 4622.0, "text": "haben willst du willst bei den smgs willst du das 40 und 50 40 und 50 ja"}, {"id": 703, "start": 4622.0, "end": 4629.6, "text": "merkt haben fertig in einem spiel kann konquest nur im moment"}, {"id": 704, "start": 4644.56, "end": 4650.56, "text": "also den sinn verstehe ich nicht so genau warum in portal xp aus ist und"}, {"id": 705, "start": 4650.56, "end": 4654.4, "text": "solche dinger im single player halt easy möglich sind gegen portal spielst du"}, {"id": 706, "start": 4654.4, "end": 4657.44, "text": "immer noch gegen echte leute"}, {"id": 707, "start": 4658.6, "end": 4663.32, "text": "gut ich meine natürlich ist xp und das nicht genau das gleiche aber trotzdem"}, {"id": 708, "start": 4663.32, "end": 4667.32, "text": "normalerweise sollte ja auch das anlocken mit zum game gehören aber ich"}, {"id": 709, "start": 4667.32, "end": 4670.44, "text": "finde es macht überhaupt keinen spaß und so kann man wie gesagt ihr habt"}, {"id": 710, "start": 4670.44, "end": 4673.36, "text": "gesehen viertelstunde und ihr habt alles anlockt"}, {"id": 711, "start": 4673.36, "end": 4681.2, "text": "oh wir sind die fände haben wir uns die fände geben was meinst du ich spiele"}, {"id": 712, "start": 4681.2, "end": 4684.48, "text": "wir spielen mal ein zwei runden die fände dass wir war auch aus die fände"}, {"id": 713, "start": 4684.48, "end": 4691.72, "text": "auch nicht bin fack ich bin falscher specialist leute ich habe falsche setup"}, {"id": 714, "start": 4691.72, "end": 4716.96, "text": "es muss ein medik oma spielen medik oma ohne mobility ist in rastum"}, {"id": 715, "start": 4716.96, "end": 4721.76, "text": "ich bin ironside enjoyer oder fack moment mal ich will mich heilen"}, {"id": 716, "start": 4721.76, "end": 4727.36, "text": "shit hätte drei tricken müssen jetzt du fragst dich warum es überhaupt einen"}, {"id": 717, "start": 4727.36, "end": 4733.36, "text": "modus gibt ich denke mal das ist dass man das spiel üben kann weil die davon"}, {"id": 718, "start": 4733.36, "end": 4737.48, "text": "ausgehen dass die leute so schlecht sind dass die auch mal entspannt gegen bot"}, {"id": 719, "start": 4737.48, "end": 4748.6, "text": "spielen müssen wenn es wenn es ist das leider"}, {"id": 720, "start": 4748.6, "end": 4764.2, "text": "da komme ich nicht rein all da hier ist ja alles voll"}, {"id": 721, "start": 4764.2, "end": 4775.16, "text": "fack zu früh ausgemacht"}, {"id": 722, "start": 4775.16, "end": 4787.0, "text": "shit es hätte klappen können es hätte klappen können ich hätte es vielleicht"}, {"id": 723, "start": 4787.0, "end": 4791.36, "text": "eher von der sauer nice danke die gehen jetzt für den retz da oben da kann ich"}, {"id": 724, "start": 4791.36, "end": 4800.92, "text": "auch schnell hoch aber von der seite game please das wollte ich doch gar nicht"}, {"id": 725, "start": 4807.36, "end": 4818.96, "text": "was was genau hat mich gerade gekillt hat es jemand mitbekommen was was was"}, {"id": 726, "start": 4818.96, "end": 4822.16, "text": "was genau hat mich gekillt"}, {"id": 727, "start": 4827.32, "end": 4832.92, "text": "spielt eigentlich ein menschen herz hat so und wahrscheinlich nicht"}, {"id": 728, "start": 4835.92, "end": 4840.4, "text": "wüsste auch nicht warum man herz hat so und spielen sollte es hat so nicht so ein"}, {"id": 729, "start": 4840.4, "end": 4844.28, "text": "modus der macht für zweier übrigens wisst ihr was mit meinem da ist feedback"}, {"id": 730, "start": 4844.28, "end": 4847.28, "text": "passiert ich habe es euch doch letztens vorgelesen die haben ja wirklich die"}, {"id": 731, "start": 4847.28, "end": 4851.84, "text": "nerven noch nach feedback zu fragen er meinte er hat das noch mal"}, {"id": 732, "start": 4851.84, "end": 4856.04, "text": "gefiltert und manche punkte aufgenommen also es war wahrscheinlich nicht nett"}, {"id": 733, "start": 4856.04, "end": 4860.32, "text": "genug was ich geschrieben habe um das an die verantwortlichen badeis weiter zu"}, {"id": 734, "start": 4860.32, "end": 4862.64, "text": "leiten"}, {"id": 735, "start": 4864.88, "end": 4871.12, "text": "ja verstehen mein wo kämen wir dahin wenn die auch damit konfrontiert werden"}, {"id": 736, "start": 4871.12, "end": 4881.04, "text": "würden dass ihr spiel sagt das geht ja nett also das sind wir uns ja einig"}, {"id": 737, "start": 4881.04, "end": 4885.68, "text": "irgendwie die realität ist ja aktuell 2021 allgemein nicht mehr hoch im kurs"}, {"id": 738, "start": 4885.68, "end": 4892.96, "text": "youtube deaktiviert ja auch dislikes nicht ohne grund wir machen jetzt big"}, {"id": 739, "start": 4892.96, "end": 4901.84, "text": "brainmove leute big brainmove next level shit oh oh oh sehr viel nice lass"}, {"id": 740, "start": 4901.84, "end": 4909.16, "text": "mich weg und tschüss und tschüss nice grappling hook grappling hook enjoyer"}, {"id": 741, "start": 4909.16, "end": 4929.96, "text": "ok pass mal auf pass mal auf alles klar kritik fähigkeiten so das war doch mal"}, {"id": 742, "start": 4929.96, "end": 4939.28, "text": "nice play oder easy hat er mich getbackt oder hat es nur so ausgesehen hat er"}, {"id": 743, "start": 4939.28, "end": 4943.28, "text": "mir wirklich getbackt glaube ich wissen gar nicht was das ist"}, {"id": 744, "start": 4943.28, "end": 4947.36, "text": "oh nice nice"}, {"id": 745, "start": 4949.0, "end": 4956.28, "text": "bin mir nicht ganz sicher wo die wo die gegner gerade enjoyen"}, {"id": 746, "start": 4956.28, "end": 4962.8, "text": "da enjoyen die gegner aber richtig richtig richtige flanke enjoyer sind das"}, {"id": 747, "start": 4962.8, "end": 4966.44, "text": "hier kommen wir das auch kann"}, {"id": 748, "start": 4966.44, "end": 4987.72, "text": "push mich push mich push mich gachi bass was zum was zu"}, {"id": 749, "start": 4987.72, "end": 4997.96, "text": "der war doch überm schild warum er warum ging da eben gar nichts rein"}, {"id": 750, "start": 4997.96, "end": 5003.16, "text": "habt ihr das gesehen"}, {"id": 751, "start": 5003.16, "end": 5017.56, "text": "verstehe nicht im ortel ja oder war das wieder leck die getter sind ja stimmt"}, {"id": 752, "start": 5017.56, "end": 5021.16, "text": "die getter da kann man also richtig durch schießen ist mir auch schon"}, {"id": 753, "start": 5021.16, "end": 5023.6, "text": "aufgefallen"}, {"id": 754, "start": 5024.92, "end": 5034.64, "text": "komisch richtiger richtiger dass ich nicht treff enjoyer no no hit rack"}, {"id": 755, "start": 5034.64, "end": 5049.6, "text": "enjoyer manchmal geht's manchmal nicht das ist über range so gut oh get fucked"}, {"id": 756, "start": 5049.6, "end": 5057.64, "text": "up in the ass over hier mein es v m l l r"}, {"id": 757, "start": 5059.64, "end": 5064.4, "text": "generell ist viel spiel ist rad viel einiges random nicht nur nicht nur die"}, {"id": 758, "start": 5064.4, "end": 5068.56, "text": "getter ob es immerhin hier big plane pass big"}, {"id": 759, "start": 5068.56, "end": 5071.16, "text": "plane posi"}, {"id": 760, "start": 5071.72, "end": 5080.04, "text": "oh nee hier ist aus hier sauer auf map schitt nicht so gut"}, {"id": 761, "start": 5080.04, "end": 5096.6, "text": "fuck gut es wusste jetzt nicht von wo der kommt ist das spiel eigentlich sehr"}, {"id": 762, "start": 5096.6, "end": 5100.72, "text": "enttäuscht oder spiel sehr enttäuschend ich bin mega enttäuscht über das"}, {"id": 763, "start": 5100.72, "end": 5105.32, "text": "spiel ist no cuppa wirklich ihr habt wenn man video gesehen hat weiß das"}, {"id": 764, "start": 5105.32, "end": 5110.28, "text": "wahrscheinlich ich bin ultra enttäuscht über das game"}, {"id": 765, "start": 5110.28, "end": 5132.44, "text": "lull pepega emt habt ihr das gesehen"}, {"id": 766, "start": 5141.28, "end": 5148.44, "text": "denn auch hier ne oder ist das nicht mehr da"}, {"id": 767, "start": 5149.84, "end": 5153.12, "text": "ja wo gehen wir jetzt hin mal zur a würde ich sagen die pusht eigentlich in"}, {"id": 768, "start": 5153.12, "end": 5159.8, "text": "der regel immer auf art zuerst map mal kurz map check nicht noch check map"}, {"id": 769, "start": 5159.8, "end": 5176.2, "text": "check alles klar da sind sie slidermann ok auto da war wir nicht hin"}, {"id": 770, "start": 5176.2, "end": 5201.32, "text": "angel did it again hinter mir hinter mir mensch"}, {"id": 771, "start": 5201.32, "end": 5215.48, "text": "in der ask schuldet wieder hallo die checkens die checkens auch nicht"}, {"id": 772, "start": 5215.48, "end": 5234.32, "text": "pepega pepega scheibenwischer pepega scheibenwischer richtig aber hat"}, {"id": 773, "start": 5234.32, "end": 5242.0, "text": "funktioniert alter 20 jetzt geht aber ab mit dem wichtigen supply trop ja das"}, {"id": 774, "start": 5242.0, "end": 5247.12, "text": "supply tropf ist so was von wichtig wichtigstes gadget wichtigste"}, {"id": 775, "start": 5247.12, "end": 5251.24, "text": "fähigkeit überhaupt man merkt an dem supply tropf ja überhaupt nicht dass es"}, {"id": 776, "start": 5251.24, "end": 5254.6, "text": "mal ein battle royale oder sowas in der richtung werden sollte ja ich weiß jetzt"}, {"id": 777, "start": 5254.6, "end": 5258.16, "text": "kommen wieder die super krassen historiker die sagen max es gab noch"}, {"id": 778, "start": 5258.16, "end": 5261.64, "text": "auch schon im battlefield 2 einen supply tropf oder irgendwie sowas in der"}, {"id": 779, "start": 5261.64, "end": 5265.28, "text": "richtung meine wirklich die haben das eingebaut weil es es schon im"}, {"id": 780, "start": 5265.28, "end": 5269.08, "text": "battlefield 2 gab ich meine es gab in battlefield 2 viele coole sachen diese"}, {"id": 781, "start": 5269.08, "end": 5272.96, "text": "nicht eingebaut haben manche der supply tropf ist drinne weil das"}, {"id": 782, "start": 5272.96, "end": 5276.68, "text": "battlefield 2 auch drinne ist oder weil das gut wäre für den battle royale oder"}, {"id": 783, "start": 5276.68, "end": 5281.0, "text": "für hesser zonen muss battlefield 2 sein muss battlefield 2 dann es lag"}, {"id": 784, "start": 5281.0, "end": 5285.88, "text": "bestimmt daran dass es den supply tropf auch schon in battlefield 2 gegeben hat"}, {"id": 785, "start": 5285.88, "end": 5290.6, "text": "also manchmal frage ich mich echt ob so die so die kommentiere auf youtube und"}, {"id": 786, "start": 5290.6, "end": 5293.8, "text": "reddit und so ob die wirklich jegliche gehind zellen verloren haben wenn so"}, {"id": 787, "start": 5293.8, "end": 5297.0, "text": "was geschrieben wird ok mal gucken ob man da oben drauf kann"}, {"id": 788, "start": 5297.0, "end": 5308.76, "text": "oh nice da kann man oben drauf nice oh was ist das für komische lag man"}, {"id": 789, "start": 5308.76, "end": 5314.8, "text": "richtiger pains pains chamble aber wir haben gleich gewonnen das"}, {"id": 790, "start": 5314.8, "end": 5332.72, "text": "schneiber man schneiber man erstmal sprengen in die ecke rein das kann ich"}, {"id": 791, "start": 5332.72, "end": 5337.68, "text": "nicht kontest mit meiner smg über die range also man hat man hat schon mal"}, {"id": 792, "start": 5337.68, "end": 5344.56, "text": "gewonnen wenn die gegner kämpen als attacker in ihrem spawn das was das"}, {"id": 793, "start": 5344.56, "end": 5347.72, "text": "kann zwei zwei möglichkeiten haben wenn die attacker im spawn kämpen man ist"}, {"id": 794, "start": 5347.72, "end": 5354.24, "text": "entweder so krass überlegen oder die spawn sind blöd"}, {"id": 795, "start": 5354.24, "end": 5359.96, "text": "ich tippe gerade mal auf beides wir sind wir sind besser als die gegner"}, {"id": 796, "start": 5359.96, "end": 5373.36, "text": "und die spawn sind dumm das kommt beides"}, {"id": 797, "start": 5373.36, "end": 5380.24, "text": "wer warum soll ich warum ein zeit wer braucht ein zeit leute wer braucht ein"}, {"id": 798, "start": 5380.24, "end": 5382.2, "text": "zeit wenn er einfach aus der hüfte spray sollen kann"}, {"id": 799, "start": 5382.2, "end": 5395.52, "text": "was auch immer ach ich falle auf das schild alter lull"}, {"id": 800, "start": 5395.52, "end": 5397.76, "text": "ok wir haben gewonnen es gibt bloß noch drei gegner"}, {"id": 801, "start": 5397.76, "end": 5419.68, "text": "richtig gesprüht und gebetet mal gucken was ich angeblich wichtiges gemacht habe"}, {"id": 802, "start": 5419.68, "end": 5423.44, "text": "also 30 kills waren ja nicht wichtig mal gucken was ich wichtiges gemacht habe"}, {"id": 803, "start": 5423.44, "end": 5428.36, "text": "wahrscheinlich wahrscheinlich hipfire kills oder sowas was habe ich wichtiges"}, {"id": 804, "start": 5428.36, "end": 5433.6, "text": "gemacht hipfire kills endlich gut zu wissen"}, {"id": 805, "start": 5433.84, "end": 5437.44, "text": "also das game denkt wirklich hipfire kills ist ganz wichtig"}, {"id": 806, "start": 5437.44, "end": 5442.44, "text": "kann ich jetzt das kann ich immer im battle battle log profil schreiben 13"}, {"id": 807, "start": 5442.44, "end": 5451.56, "text": "rekord 13 hipfire kills die musik passt richtig gut dazu finde ich die musik ist"}, {"id": 808, "start": 5451.56, "end": 5460.96, "text": "richtig richtig richtig kogas"}, {"id": 809, "start": 5466.96, "end": 5469.96, "text": "renewal"}, {"id": 810, "start": 5472.12, "end": 5480.68, "text": "es gibt noch bettel oder leider hat man sich dafür entschieden"}, {"id": 811, "start": 5480.68, "end": 5484.52, "text": "kein bettel log zu machen leute ich wusste heute ein bisschen muss mich"}, {"id": 812, "start": 5484.52, "end": 5488.84, "text": "manchmal räuschen wegen trockenem hals aber es ist besser als gestern oder mal"}, {"id": 813, "start": 5488.84, "end": 5492.08, "text": "so an die frage oder vorgestern war der letzte stream war also ich heute ich"}, {"id": 814, "start": 5492.08, "end": 5497.24, "text": "wusste heute schon weniger und man so weniger hals probleme als im stream"}, {"id": 815, "start": 5497.24, "end": 5500.32, "text": "vorher oder finde ich auch"}, {"id": 816, "start": 5500.76, "end": 5505.88, "text": "ist schon besser geworden also anscheinend bringt eukalyptus dampfbart"}, {"id": 817, "start": 5505.88, "end": 5511.0, "text": "und salbei t was"}, {"id": 818, "start": 5518.04, "end": 5522.92, "text": "omikron der schweiß jet alles klar"}, {"id": 819, "start": 5527.28, "end": 5533.48, "text": "aber eigentlich hoch wäre auch zu zu kogas pogas gewesen wenn man hier hoch"}, {"id": 820, "start": 5533.48, "end": 5537.64, "text": "kann was denn da hinten"}, {"id": 821, "start": 5537.64, "end": 5547.04, "text": "als jetzt schreckt der lv sagt vor dem lv muss man keine angst haben"}, {"id": 822, "start": 5547.04, "end": 5566.12, "text": "was mit dir los stelz nicht der stelzer der oberstelzer"}, {"id": 823, "start": 5566.12, "end": 5578.24, "text": "wo ist denn hier was die gegner kommen wieder gar nicht aus dem spawn raus"}, {"id": 824, "start": 5578.24, "end": 5599.16, "text": "wated er dacht aber"}, {"id": 825, "start": 5599.16, "end": 5606.76, "text": "Oh fuck, jetzt hab ich mich verschluckt. Ich wurde Hacker-Man."}, {"id": 826, "start": 5606.76, "end": 5623.8, "text": "In den Kopf. Ich mag McCree. Leute, im Kern, ich sag's euch, im Kern, das Spiel hat schon"}, {"id": 827, "start": 5623.8, "end": 5627.64, "text": "manche Sachen, die cool sind. Also ich mag das Movement hier auch mit dem Köppling und"}, {"id": 828, "start": 5627.64, "end": 5630.48, "text": "so was. Man kann sich jetzt streiten, ob's Battlefield ist, aber es ist halt einfach"}, {"id": 829, "start": 5630.48, "end": 5648.44, "text": "so unten nicht zu Ende gedacht. Au. Und die kriegen grad richtig, richtig reingefahren."}, {"id": 830, "start": 5648.44, "end": 5664.68, "text": "Richtig reingefahren kriegen sie. Ja, schlau Max, sehr schlau, schlau, schlau von dir gewesen,"}, {"id": 831, "start": 5664.68, "end": 5668.72, "text": "in das brennende Ding rein zu rennen. Sehr schlau, richtig, richtig Big Brain Poggers."}, {"id": 832, "start": 5668.72, "end": 5678.8, "text": "Was, da war noch einer, den hab ich nicht gesehen. Habt ihr den gesehen? Der ist bestimmt da"}, {"id": 833, "start": 5678.8, "end": 5685.72, "text": "gespawnt. Chat sagt, Battlelog war für die damalige Zeit echt top, hat sich sehr gut"}, {"id": 834, "start": 5685.72, "end": 5689.4, "text": "mit den Platoons ergänzt. Battlelog find ich heut immer noch top. Könnt ihr euch vielleicht"}, {"id": 835, "start": 5689.4, "end": 5693.36, "text": "noch dran erinnern, so wie ich bin. Ich hab am Anfang gegen Battlelog geflamed, weil"}, {"id": 836, "start": 5693.36, "end": 5697.68, "text": "ich gesagt hab, oh ist das dumm, dass man da aus dem Game muss, aber ich bin relativ"}, {"id": 837, "start": 5697.68, "end": 5700.72, "text": "schnell auf den Richter gekommen. Ich mein, ich hab am Anfang auf der Xbox gespielt,"}, {"id": 838, "start": 5700.72, "end": 5709.04, "text": "ja kein Wunder. Ich bin relativ schnell auf den Richter gekommen, dass Battlelog eigentlich"}, {"id": 839, "start": 5709.04, "end": 5718.6, "text": "ziemlich Poggers ist. Generell muss man echt mal sagen, mit Battlefield 3, die waren ihrer"}, {"id": 840, "start": 5718.6, "end": 5726.12, "text": "Zeit voraus, insofern, die waren halt richtig innovativ und haben was richtig Gutes, Zusammenhängendes"}, {"id": 841, "start": 5726.12, "end": 5732.16, "text": "gebaut. Was sie danach meiner Meinung nach in der Form nie wieder hinbekommen haben,"}, {"id": 842, "start": 5732.16, "end": 5736.88, "text": "Battlefield 4 ist natürlich jetzt auch nicht schlecht und auch mittlerweile richtig gut"}, {"id": 843, "start": 5736.88, "end": 5755.12, "text": "gepatcht, aber nicht zu vergleichen zum Release in Battlefield 3. Die kriegen gerade richtig"}, {"id": 844, "start": 5755.12, "end": 5764.16, "text": "reingefahren die Gegner. Ich hab nicht gesagt, dass ich Battlefield 3 nicht so gut finde,"}, {"id": 845, "start": 5764.16, "end": 5768.0, "text": "es ging zum Release, in welchem Zustand die Games war und Battlelog wurde mit Battlefield"}, {"id": 846, "start": 5768.0, "end": 5775.0, "text": "3 erfunden. Da kannst du sagen, was du willst, die waren ihrer Zeit innovativ, also die waren"}, {"id": 847, "start": 5775.0, "end": 5792.44, "text": "einfach richtig innovativ damals. Die Gegner sehen keine Sonne gerade, oder? Die Gegner"}, {"id": 848, "start": 5792.44, "end": 5797.96, "text": "campen schon wieder nicht mehr, mein Spring ist kaputt, mein Springbutton funktioniert"}, {"id": 849, "start": 5797.96, "end": 5805.12, "text": "mal wieder nicht. Manchmal funktioniert auch der Nahkampfbutton nicht, das ist immer gut,"}, {"id": 850, "start": 5805.12, "end": 5829.24, "text": "wenn man das Tasten einfach mal spontan anbindet. Wackfreies Spiel. Jaja, der LVsack, der kann"}, {"id": 851, "start": 5829.24, "end": 5835.0, "text": "nicht springen, ich würde gerne springen, aber ich kann nicht springen, weil meine Springtaste"}, {"id": 852, "start": 5835.0, "end": 5851.92, "text": "anbindet wurde. Seht ihr, wie schlecht der LV ist? Ich kann nicht springen. So pains"}, {"id": 853, "start": 5851.92, "end": 5857.88, "text": "Champ, so dumm. Ok, nice. Ja, also was war Battlelog? Ich zeige euch, was Battlelog war,"}, {"id": 854, "start": 5857.88, "end": 5864.76, "text": "während ihr die nächste Runde sucht. Für alle, die sich kennen, Battlelog war ein Browser,"}, {"id": 855, "start": 5864.76, "end": 5872.0, "text": "also ein Webservice und Browser Addon in einem, wo du quasi Serverbrowser und Profilverwaltung"}, {"id": 856, "start": 5872.0, "end": 5878.88, "text": "und Progress Tracking, hoops, ich wollte nicht auf Battlefield 1 gehen, ich wollte auf Battlefield"}, {"id": 857, "start": 5878.88, "end": 5888.16, "text": "3 gehen, im Browser hattest. Und sowas ist einfach im Browser tausendmal besser als in"}, {"id": 858, "start": 5888.16, "end": 5895.68, "text": "Game, weil Webbrowser und HTML, CSS, JavaScript Sachen ist für sowas einfach richtig prädestiniert."}, {"id": 859, "start": 5895.68, "end": 5901.6, "text": "Und du hattest einen Serverbrowser, du konntest aussuchen, was du spielen willst, konntest"}, {"id": 860, "start": 5901.6, "end": 5908.56, "text": "danach suchen und hast dann gesagt, ok, ich will jetzt Operation Metro spielen, groß,"}, {"id": 861, "start": 5908.56, "end": 5912.48, "text": "sehr schön, vielen, sehr schön, bam, join. Dann hat dein Game gestartet und ist direkt"}, {"id": 862, "start": 5912.48, "end": 5917.6, "text": "draufgegangen. Du hast auch gesehen, was das, du konntest dir auch die Server-Settings angucken,"}, {"id": 863, "start": 5917.6, "end": 5922.44, "text": "konntest du sagen, aha, Server Rotation, Terran, Highway, Sand Crossing, Metro, Firestorm mag"}, {"id": 864, "start": 5922.44, "end": 5926.72, "text": "ich nicht so, Damavant Peak, Hark Island, ok, die haben coole Maps. Du konntest dir sogar"}, {"id": 865, "start": 5926.72, "end": 5934.2, "text": "Ränge anzeigen lassen, der Spieler, mit dem du gespielt hattest. Du hattest eine History,"}, {"id": 866, "start": 5934.2, "end": 5940.96, "text": "was deine letzten Matches waren, du konntest Leute adden, du konntest dementsprechend auch"}, {"id": 867, "start": 5940.96, "end": 5947.08, "text": "bestimmen, was du spielen magst und was nicht. Falls du keinen Bock hast auf Hourglass, hättest"}, {"id": 868, "start": 5947.08, "end": 5951.12, "text": "einfach Hourglass nicht ausgewählt oder einen Server rausgesucht ohne Hourglass Rotation,"}, {"id": 869, "start": 5951.12, "end": 5957.32, "text": "Battlelog war richtig nice. Warum die das abgeschafft haben, weil ich glaube, dass Battlelog"}, {"id": 870, "start": 5957.32, "end": 5961.28, "text": "ziemlich schlampig implementiert war und die einfach zu blöd war und es ihnen zu viel"}, {"id": 871, "start": 5961.28, "end": 5966.4, "text": "Wartungsaufwand letztendlich war, weil die mussten ja trotzdem ein Ingame-Menü für"}, {"id": 872, "start": 5966.4, "end": 5971.8, "text": "Konsole machen. Konsole hat ja, konnte man eigentlich, ich weiß es gar nicht mehr, Chet,"}, {"id": 873, "start": 5971.8, "end": 5976.72, "text": "konnte man mit der Xbox über Battlelog, weil man einen PC hatte, mit den Servern joinen?"}, {"id": 874, "start": 5976.72, "end": 5982.16, "text": "Ging das? Also man konnte sein Profil tracken und sowas im Battlelog, das wusste ich, aber"}, {"id": 875, "start": 5982.16, "end": 5995.92, "text": "konnte man Server joinen und Server suchen für Xbox? Ja? Ne, das ging nicht, oder? Ich"}, {"id": 876, "start": 5995.92, "end": 6002.04, "text": "spreche übrigens da einfach mal sinnlos rein, ich denke, dass ich was kill. Ne, ging nicht,"}, {"id": 877, "start": 6002.04, "end": 6009.28, "text": "ne? Max hört sich mit dem Mic an, wieso, stimmt was mit meinem Mikrofon nicht? Ich"}, {"id": 878, "start": 6009.28, "end": 6021.64, "text": "glaube, ich bin ein bisschen heißer oder so. Auto-tune. Oh shit, ich wollte da hoch. Ja,"}, {"id": 879, "start": 6021.64, "end": 6025.72, "text": "es haben damals viele geheult bei Battlelog, das stimmt, weil das was Neues war und wie"}, {"id": 880, "start": 6025.72, "end": 6029.84, "text": "das so ist, bei neuen Sachen wird oftmals erstmal rumgeheult, aber es hat sich dann"}, {"id": 881, "start": 6029.84, "end": 6035.16, "text": "relativ schnell, also eigentlich so nach dem ersten Monat oder so gelegt und die Leute"}, {"id": 882, "start": 6035.16, "end": 6042.2, "text": "haben Battlelog gefeiert, ich auch. Ich auch. Ich habe am Anfang auch gesagt, ich finde"}, {"id": 883, "start": 6042.2, "end": 6046.04, "text": "Battlelog doof, dass du nicht mehr im Game den Browser hast und sowas, aber ich bin"}, {"id": 884, "start": 6046.04, "end": 6055.88, "text": "dann relativ schnell auf den Dichter gekommen, dass Battlelog schon ziemlich nice ist. Die"}, {"id": 885, "start": 6055.88, "end": 6060.92, "text": "hätten eigentlich richtig gut das ganze ausbauen können. Stellt euch mal vor, die hätten"}, {"id": 886, "start": 6060.92, "end": 6065.24, "text": "eine API und eine Pluginschnittstelle für Battlelog gemacht. Wisst ihr, wie geil das"}, {"id": 887, "start": 6065.24, "end": 6069.0, "text": "hätte werden können, wenn du quasi Custom Plugins für deinen Server oder deinen Squad"}, {"id": 888, "start": 6069.0, "end": 6073.04, "text": "oder so erstellen könntest, wie auch immer, was man da mit machen könnte. Das wäre richtig"}, {"id": 889, "start": 6073.04, "end": 6079.64, "text": "POG gewesen. Alter, wer hat dieses Innending hier designed? Ich weiß gar nicht, wo es"}, {"id": 890, "start": 6079.64, "end": 6092.68, "text": "runtergeht. Ah, hier. Ich bin gerade 30 FPS-Enjoyer, weil es laggt. Warum ruckelt das so im Hintergrund?"}, {"id": 891, "start": 6092.68, "end": 6097.88, "text": "Warte mal, ich muss es hier mal zumachen. Runtermachen, Browser ausmachen. Warum ruckelt"}, {"id": 892, "start": 6097.88, "end": 6118.44, "text": "das gerade so? Könnte Explosive gar nichts geplantet haben. Oh. 7 TV, 7 TV habe ich"}, {"id": 893, "start": 6118.44, "end": 6128.76, "text": "nicht aktiviert. Max, willst du mitspielen? Oh ja. Bam, wo ist er? Nicht on. Also so 3-4"}, {"id": 894, "start": 6128.76, "end": 6136.12, "text": "Runden machen wir noch, weil dann ist 22 Uhr und ihr wisst, was 22 Uhr ist. 22 Uhr ist"}, {"id": 895, "start": 6136.12, "end": 6163.92, "text": "schon spät. Schon spät. Boomer schlafen, schon spät. Wo ist die Treppe? Oh shit. Oh,"}, {"id": 896, "start": 6163.92, "end": 6191.92, "text": "oh. Oh, oh. Alter, das laggt ja mal so krass gerade. Nein, ich will, ich will ihn nicht"}, {"id": 897, "start": 6191.92, "end": 6203.88, "text": "retten, ich will diffusen, man. Das Spiel, nein, nein, nein, nein, nein. Du diffusst"}, {"id": 898, "start": 6203.88, "end": 6232.64, "text": "jetzt nicht, du rettest jetzt erst mal. Oh, da unten geht gut was ab. Oh, da ist. Fuck."}, {"id": 899, "start": 6232.64, "end": 6243.56, "text": "Alter, hier geht was, hier geht, hier geht gut was ab. Ich brauche meinen Motionball."}, {"id": 900, "start": 6243.56, "end": 6266.56, "text": "Was ein bescheuerter Soundeffekt. Ball, nein, nein, nein, lass mich nur. Alter, es ruckelt"}, {"id": 901, "start": 6266.56, "end": 6271.56, "text": "hier. Leute, falls es bei euch ruckelt, es ist nicht nur bei euch so, es ruckelt hier."}, {"id": 902, "start": 6271.56, "end": 6279.96, "text": "Was ist das denn? Warum ruckelt denn das so? Ich glaube, das ist die Map. Ich habe gerade"}, {"id": 903, "start": 6279.96, "end": 6292.6, "text": "gefühlt 30 FPS. Ich glaube, das ist Memory Leak. Man muss das Spiel ja öfters mal neu"}, {"id": 904, "start": 6292.6, "end": 6299.88, "text": "starten, weil es Memory Leaks hat. Nein, da wollte ich nicht hin. Oh, oh, ich glaube,"}, {"id": 905, "start": 6299.88, "end": 6309.84, "text": "jetzt wird geplantet. Also, Max, keine Ahnung, ob du mitspielen willst. Ich weiß, ich habe"}, {"id": 906, "start": 6309.84, "end": 6314.68, "text": "es gerade nicht gelesen, aber wenn du mitspielen willst, kann ich dich nach der Runde entweiten."}, {"id": 907, "start": 6314.68, "end": 6318.96, "text": "Nee, nee, an den offenen Chrome Tabs liegt das nicht. Jetzt hat er die Runden vorher"}, {"id": 908, "start": 6318.96, "end": 6327.48, "text": "auch nicht geruckelt. Ich glaube, das ist einfach huge. Ein nice Memory Leak. Gut, so"}, {"id": 909, "start": 6327.48, "end": 6334.72, "text": "nice ist das nicht, aber es ruckelt. Obwohl ich angeblich 90 FPS habe, das fühlt sich"}, {"id": 910, "start": 6334.72, "end": 6345.84, "text": "überhaupt nicht an wie 90 FPS. Was ist denn jetzt los? Warum ist die Map auf einmal kleiner"}, {"id": 911, "start": 6345.84, "end": 6350.12, "text": "geworden? Ah, weil die es gesprengt haben. Ja, das war vorher auch nicht so. Das ist"}, {"id": 912, "start": 6350.12, "end": 6357.72, "text": "auch eine dumme Implementierung. Ich kann kaum noch um die Ecke laufen, so sehr ruckelts."}, {"id": 913, "start": 6357.72, "end": 6378.92, "text": "Nee, das ist ja mal ganz pains jambig. Der Battlelog Bitcoin Miner. Ja, ich habe ja sogar"}, {"id": 914, "start": 6378.92, "end": 6383.52, "text": "schon das Battlelog wieder zugemacht im Hintergrund. Ihr habt es nicht gesehen. Also, ich starte"}, {"id": 915, "start": 6383.52, "end": 6392.24, "text": "nach der Runde neu das Game. Ich hoffe, ich bin so schnell, dass ich wieder reinkomme."}, {"id": 916, "start": 6392.24, "end": 6397.76, "text": "Mal gucken, ob es hier jetzt geht. Nee, es ruckelt auch noch. Fuck man, wie kann das"}, {"id": 917, "start": 6397.76, "end": 6414.88, "text": "so kaputt sein? So ist es nicht gedacht. Eher gedacht, dass die uns hier abfarben können"}, {"id": 918, "start": 6414.88, "end": 6438.0, "text": "von der Seite. Auch nice. Guck mal da. Hallo. Wo kommen sie hier? Massive Spray. Das ist"}, {"id": 919, "start": 6438.0, "end": 6445.96, "text": "übrigens auch wahnsinnig gutes Design hier. Einfach mal offenes offenes Dünenfeld. Achtung"}, {"id": 920, "start": 6445.96, "end": 6454.16, "text": "damit. Ist das die Shotgun Leute? Ist das die? Ist das die Shotgun? Die mich da gerade"}, {"id": 921, "start": 6454.16, "end": 6472.08, "text": "gekillt hat? Ist das diese angebliche One Shot Shotgun? Nee, das nicht. OK. MonkaS. MonkaS."}, {"id": 922, "start": 6472.08, "end": 6487.24, "text": "Alter. By the way, warum ich nicht geaimt habe, ist folgendes. Ich dachte mir, es ist"}, {"id": 923, "start": 6487.24, "end": 6492.04, "text": "besser in Bewegung zu bleiben, anstatt anstatt ins Iron-Sein hoch zu gehen. Aber gut, man"}, {"id": 924, "start": 6492.04, "end": 6500.8, "text": "ist nachher immer schlauer. So einen Rats wäre mega poggers, falls wir einen kriegen,"}, {"id": 925, "start": 6500.8, "end": 6507.4, "text": "ich glaube nicht. Die awnen die gerade. Guck mal hier. Ich glaube die bashen die gerade."}, {"id": 926, "start": 6507.4, "end": 6519.84, "text": "Na ja nice. Medic Oma. Nein, du musst mich ratzen. Mich. Nice. Nice. Guck mal, du schaffst"}, {"id": 927, "start": 6519.84, "end": 6523.72, "text": "es überhaupt nicht zum M kommen, bis das gelegt ist. Es bringt nichts, da muss ich"}, {"id": 928, "start": 6523.72, "end": 6527.96, "text": "gar nicht hin. Ich schaff es nicht bis dahin. Es ist sinnlos überhaupt dahin zu rennen."}, {"id": 929, "start": 6527.96, "end": 6537.8, "text": "Die Zeit des M-Coms genügt nicht, um einmal über die Map zu rennen. Depega Style oder?"}, {"id": 930, "start": 6537.8, "end": 6565.52, "text": "Das ist das. Ist es das oder nicht? Das geht oder Panzer?"}, {"id": 931, "start": 6565.52, "end": 6594.2, "text": "Pants Man fährt im Kreis da oben. Oh, der Pants Man. Oh, gerade noch weggekommen."}, {"id": 932, "start": 6594.2, "end": 6605.4, "text": "Okay, jetzt müsste ich halt wissen, wo die sind. Hier ist nichts mehr. Okay, wir sollten"}, {"id": 933, "start": 6605.4, "end": 6614.8, "text": "mal zu B. Wir sollten mal zu B. Alles klar. Game. Sehr gut. Du bist in meiner Lobby."}, {"id": 934, "start": 6614.8, "end": 6638.84, "text": "Gegnerteam oder mein Team? Wir haben es. Nice. Es ist übrigens auch sehr irritierend, dass"}, {"id": 935, "start": 6638.84, "end": 6643.56, "text": "die Gegner noch was sagen, wenn sie schon tot sind. Da denkst du immer, da ist noch"}, {"id": 936, "start": 6643.56, "end": 6647.56, "text": "einer, da bist da gar keiner. Sehr, sehr, sehr viel undurchdachte Dinge. Vielleicht"}, {"id": 937, "start": 6647.56, "end": 6653.88, "text": "können wir ihn rausschießen. Pass mal auf. Das ging am Anfang. Am Anfang ist der Crabbling"}, {"id": 938, "start": 6653.88, "end": 6662.8, "text": "Hook quasi durch, durchgegangen. Zumindest sollten wir nicht im offenen laufen, solange"}, {"id": 939, "start": 6662.8, "end": 6686.52, "text": "der Healy hier rumstellt. Oh, oh, der Pants Man. Nichts wie weg. Oh, get fucked up in"}, {"id": 940, "start": 6686.52, "end": 6696.68, "text": "die Hose. Ich glaube, die sind, wir müssen mal so einen Tier Ranking von den Waffen machen."}, {"id": 941, "start": 6696.68, "end": 6704.0, "text": "Im Prinzip ist alles die Tier, bis auf ein paar die sind ganz gut. 74 ist ganz gut. 24"}, {"id": 942, "start": 6704.0, "end": 6712.28, "text": "ist ganz gut. 9 30 ist ganz gut und die DMS ganz gut. Ansonsten kannst du den Rest eigentlich"}, {"id": 943, "start": 6712.28, "end": 6730.44, "text": "mehr oder weniger vergessen. Wie sind die noch hier? Nee, das kriegen wir nicht. Keine"}, {"id": 944, "start": 6730.44, "end": 6738.36, "text": "Chance. Ich habe dich schon zweimal gekillt. Ups. Machen wir es so, machen wir es so. Wenn"}, {"id": 945, "start": 6738.36, "end": 6743.2, "text": "ich es noch, wenn ich es nicht schaffe, fünf Mal zu killen, dann kriege ich dein Prime-Sub."}, {"id": 946, "start": 6743.2, "end": 6747.28, "text": "Wobei, nee, nee, nee, das ist ja blödsinn. Das ist ja gar kein Anreiz. Das ist ja gar"}, {"id": 947, "start": 6747.28, "end": 6752.0, "text": "kein Anreiz. Wenn du es fünf Mal schaffst, mich zu killen, dann kriege ich dein Prime-Sub,"}, {"id": 948, "start": 6752.0, "end": 6756.0, "text": "weil so gewinne ich immer irgendwas. Das finde ich eigentlich einen sinnvolleren Ansatz als"}, {"id": 949, "start": 6756.0, "end": 6766.32, "text": "umgedreht. So hat jeder was. Du hast den Win und ich habe den Prime-Sub. Oder umgedreht,"}, {"id": 950, "start": 6766.32, "end": 6772.16, "text": "ich habe den Win, du kannst den Prime-Sub behalten. Ich finde, das ist eine gute Idee."}, {"id": 951, "start": 6772.16, "end": 6780.16, "text": "Das sollten wir öfter so machen. Ey, by the way, auch noch was. Wer bei DICE diesen Granatwerfer"}, {"id": 952, "start": 6780.16, "end": 6788.36, "text": "designt hat, der gehört gekickt. Das ist die most useless Waffe im gesamten Spiel. Oh,"}, {"id": 953, "start": 6788.36, "end": 6809.24, "text": "guck mal, da wird geteabacked. So, jetzt wird es hier schwierig, wir müssen darüber. Wo"}, {"id": 954, "start": 6809.24, "end": 6813.36, "text": "sind denn die M-Coms hier überhaupt? Hier ist das M-Com, okay. Oh, die sind schon am"}, {"id": 955, "start": 6813.36, "end": 6825.4, "text": "Start. Hier ist keiner. Ich muss hier durch, der Heli basht mich sonst. Alter Webster,"}, {"id": 956, "start": 6825.4, "end": 6850.24, "text": "heile dich doch. Hier geht es aber gerade rund drin. Ist Webster Premium? Guck mal,"}, {"id": 957, "start": 6850.24, "end": 6858.04, "text": "das ist ein Up-T-Back, null. Webster ist Level 15, du musst das anloggen. Wie gesagt Max,"}, {"id": 958, "start": 6858.04, "end": 6870.28, "text": "ich kann dich entweiten, wenn du am Start bist. Ist er aber nicht. Enemy Forces. Er spielt"}, {"id": 959, "start": 6870.28, "end": 6879.24, "text": "sich wirklich wie 30 FPS, Leute. Das Memory Leak kickt gerade richtig rein. Man sieht es"}, {"id": 960, "start": 6879.24, "end": 6889.88, "text": "witziger, weil es an den FPS nicht. Aber es ist so, ich merke es. Es rockelt und leckt"}, {"id": 961, "start": 6889.88, "end": 6905.68, "text": "as fuck. Okay, nice. Von der Seite. Du hast mich geteabacked, das ist doch nice. Wer mag"}, {"id": 962, "start": 6905.68, "end": 6917.4, "text": "es nicht, geteabacked zu werden. Hyper Gachi. Letzter Base. Leute, danach mache ich noch"}, {"id": 963, "start": 6917.4, "end": 6936.68, "text": "ein, zwei Runden und dann muss ich mal sowas von trinken aufs Klo. Pe-Pu-Pu-Pu machen."}, {"id": 964, "start": 6936.68, "end": 6945.24, "text": "Alles klar, Game. Alles klar, alles klar. Gibt es eigentlich in Warzone aktuell auch"}, {"id": 965, "start": 6945.24, "end": 6969.32, "text": "richtige OP-Waffen? Ist jemand da so im Warzone-Game, Warzone-Meta? Irgendwie drinne gerade. Nice,"}, {"id": 966, "start": 6969.32, "end": 6976.08, "text": "diese Waffe ist auf Range top. Gibt es die nicht immer? Doch. Aber ich weiß nicht welche."}, {"id": 967, "start": 6976.08, "end": 6982.44, "text": "Welche ist dann gerade OP in Warzone? Ich habe nämlich tatsächlich mir überlegt, ob"}, {"id": 968, "start": 6982.44, "end": 6988.68, "text": "ich nicht, wenn diese Pazifik-Karte rauskommt, ob ich mir nicht echt noch mal Warzone gebe,"}, {"id": 969, "start": 6988.68, "end": 6993.76, "text": "weil Battlefield, ich spiele aktuell relativ viel Halo, was auch mega Bock macht, aber"}, {"id": 970, "start": 6993.76, "end": 7007.52, "text": "Battlefield kattet es dieses Jahr halt einfach nicht so für mich. 187G. Ja, ich habe doch"}, {"id": 971, "start": 7007.52, "end": 7026.24, "text": "jetzt eine extra SSD, da kann das drauf. Die drücken aber gut die Gegner. Die drücken"}, {"id": 972, "start": 7026.24, "end": 7038.68, "text": "gut, Gatschi-Buzz. Auf geht's. Aber da gehe ich nicht runter. Okay, ich muss rüber. Wenn"}, {"id": 973, "start": 7038.68, "end": 7047.6, "text": "ich nicht rüber gehe, das macht keiner. Game, Mann. F***, Alter. Guck mal, wie viele stehen."}, {"id": 974, "start": 7047.6, "end": 7056.56, "text": "Ne, keine Chance. Du, du, du. Du, du, du, du. Ich muss das Spiel neu starten, weil es leckt"}, {"id": 975, "start": 7056.56, "end": 7061.0, "text": "wie Sau. Petel, du kannst ja, wobei, ne, wir gehen raus, wir suchen danach neu, vielleicht"}, {"id": 976, "start": 7061.0, "end": 7067.84, "text": "können wir noch mal ein bisschen Attacker spielen. Ich habe jetzt genug Defended. Lull, das reicht."}, {"id": 977, "start": 7067.84, "end": 7075.64, "text": "Wir haben es eh verloren, ich starte mal schnell neu. So, play. Das hat wirklich so heftig"}, {"id": 978, "start": 7075.64, "end": 7082.4, "text": "geleckt gerade. Siehst du das kritisch mit dem Colonel Treiber für Anti-Cheat? Tja,"}, {"id": 979, "start": 7082.4, "end": 7090.6, "text": "schon lange, aber ich verstehe die Notwendigkeit. Also, das ist ja so easy Anti-Cheat und was"}, {"id": 980, "start": 7090.6, "end": 7094.96, "text": "sonst nicht noch alles gibt. Ach, ich habe Display. Leute, habe ich die ganze Zeit schon"}, {"id": 981, "start": 7094.96, "end": 7099.84, "text": "Display Capture. Der Stream muss doch geleckt haben wie Sau. Oder hat er nicht geleckt?"}, {"id": 982, "start": 7099.84, "end": 7114.88, "text": "War gut. Hä? Dann verstehe ich es nicht. Aber das Lag in Game lag nicht da dran. Das"}, {"id": 983, "start": 7114.88, "end": 7131.32, "text": "ist schon mal klar. Das liegt an diesem komischen Memory League in Battlefield. So, Social. Ach,"}, {"id": 984, "start": 7131.32, "end": 7135.64, "text": "das ist das Game. Ja, es ist auch das Game. So, vielleicht sind wir jetzt noch mal Attacker."}, {"id": 985, "start": 7135.64, "end": 7140.24, "text": "Da habe ich jetzt Bock drauf, noch mal eine Runde Attacker. Noch zwei, drei Runden Attacker."}, {"id": 986, "start": 7140.24, "end": 7150.4, "text": "Das wäre noch mal Pock. Ja, bei mir laggt es auch. Es gibt zwei Sachen. Wenn das Spiel"}, {"id": 987, "start": 7150.4, "end": 7158.68, "text": "zu viel CPU zieht. Mal gucken. Wenn wir nicht Attacker sind, suche ich neu. Dann laggt es"}, {"id": 988, "start": 7158.68, "end": 7164.24, "text": "im Stream, weil das irgendwie mit OBS nicht hinterherkommt. Und wenn es für mich laggt,"}, {"id": 989, "start": 7164.24, "end": 7168.76, "text": "ist es aber immer eine Game-Geschichte. Wenn es für euch laggt, ist es vielleicht auch"}, {"id": 990, "start": 7168.76, "end": 7178.24, "text": "eine OBS-Geschichte. Aber höchstwahrscheinlich eine Game-Geschichte. Sind wir Attacker? Wir"}, {"id": 991, "start": 7178.24, "end": 7187.68, "text": "sind, wir sind, wo sind wir denn? Defender? Nee, Leave Game. Exit. Dieser Fisch? Dankeschön"}, {"id": 992, "start": 7187.68, "end": 7196.68, "text": "für den Sub. Bist du dieser Fisch von YouTube? Von vor ein paar Jahren? Oder bist du einfach"}, {"id": 993, "start": 7196.68, "end": 7209.48, "text": "nur zufällig dieser Fisch? Bist du dieser Fisch, wo ich mit dem mal mit Kaboom mit zusammen"}, {"id": 994, "start": 7209.48, "end": 7224.12, "text": "All You Can Eat stellst? Fressen war in Frankfurt. Genau der. Nice. Du bist eindeutig. Es gibt"}, {"id": 995, "start": 7224.12, "end": 7230.16, "text": "so manche Sachen, die können nur die Leute. Alter, Game, come on. Es gibt so Sachen,"}, {"id": 996, "start": 7230.16, "end": 7236.68, "text": "das wissen nur die Leute, die dabei waren. Der Goldcock, genau. Yep, Yep, Goldcock."}, {"id": 997, "start": 7236.68, "end": 7255.12, "text": "Ist auch so hängen geblieben. Jawoll, please Attacker, lasst mich noch 2, 3 Runden Attacker"}, {"id": 998, "start": 7255.12, "end": 7268.52, "text": "spielen bis 22 Uhr. Attacker, Preyge, Leute, Preyge, Preyge, Preyge. Attacker. Preygege,"}, {"id": 999, "start": 7268.52, "end": 7278.56, "text": "Prey, Prey, Prey, Prey, Preyge hat funktioniert, Leute. Es hat funktioniert. Preyget, Preyget."}, {"id": 1000, "start": 7278.56, "end": 7293.04, "text": "Sag mal, fehlt, sag mal, fehlt dem Crapling Hook der Lauf, wenn der so rennt? Der fehlt,"}, {"id": 1001, "start": 7293.04, "end": 7309.72, "text": "guck mal, der fehlt, der fehlt der Lauf vorne, oder? Oder nicht? Oh man, Game, please nicht"}, {"id": 1002, "start": 7309.72, "end": 7335.84, "text": "drum baggen. Tango down, Tango, Tango, Tango, Tango, Tango down. Tango Sucker. Lul, wie"}, {"id": 1003, "start": 7335.84, "end": 7345.96, "text": "es erst nicht registrat hat. Oder habe ich nicht getroffen? Wahrscheinlich habe ich beides."}, {"id": 1004, "start": 7345.96, "end": 7349.52, "text": "Es hat nicht registrat und ich habe nicht getroffen. Gehe ich mal von aus, war wahrscheinlich"}, {"id": 1005, "start": 7349.52, "end": 7363.2, "text": "beides fail. Ah, fuck. Der Frontgriff steht einfach nur vorne. Ja, das dachte ich auch"}, {"id": 1006, "start": 7363.2, "end": 7372.2, "text": "am Anfang, aber dann passt die Ansicht, wenn man die Waffe normal hält, nicht? Guck, guck,"}, {"id": 1007, "start": 7372.2, "end": 7377.44, "text": "der Frontgriff ist da unten, also der, oh Gott, jetzt ist ja gut, man. Dann würde es nicht"}, {"id": 1008, "start": 7377.44, "end": 7381.56, "text": "zusammenpassen. Oder, oder ich, oder meine Augen haben einfach nicht die richtige Perspektive."}, {"id": 1009, "start": 7381.56, "end": 7387.84, "text": "Der Yolos, wir spielen gegen den Yolo Swagger. Ich glaube, wir können eigentlich gar nicht"}, {"id": 1010, "start": 7387.84, "end": 7397.16, "text": "gewinnen. Sag mal, da fuck. Wie soll man gegen den Yolo Swagger? Der Fisch Nummer drei hat"}, {"id": 1011, "start": 7397.16, "end": 7402.72, "text": "auch Subscribed. Danke, danke. Wie soll man gegen den Yolo Swagger dann auch gewinnen?"}, {"id": 1012, "start": 7402.72, "end": 7427.92, "text": "Das ist eigentlich impossible. Impossible. Yolo Swagger. Fuck man, in the ass, von unten,"}, {"id": 1013, "start": 7427.92, "end": 7433.64, "text": "ah, da kann man durchgucken. Das wusste ich nicht, dass man nur durchgucken kann. Das"}, {"id": 1014, "start": 7433.64, "end": 7439.52, "text": "war pepega dumm. Da machst du nichts, aber wenn wir Glück haben, können wir auf dem"}, {"id": 1015, "start": 7439.52, "end": 7455.24, "text": "Dach neu spawnen. Jawoll. Poggers Spawn, auf dem Dach. Okay, das wird so nichts. Vielleicht"}, {"id": 1016, "start": 7455.24, "end": 7461.96, "text": "sollte ich mal, vielleicht sollte ich mal ein paar Rauchgranaten mitnehmen. Ich habe das"}, {"id": 1017, "start": 7461.96, "end": 7467.28, "text": "Gefühl, Rauchgranaten könnten tatsächlich echt was bringen in dem Fall. Ja, unser Poggers"}, {"id": 1018, "start": 7467.28, "end": 7489.12, "text": "Spawn ist noch am Start. Was ist denn hier Rauch? Hey, fuck."}, {"id": 1019, "start": 7489.12, "end": 7518.6, "text": "Ich warte jetzt, bis sie diffusen."}, {"id": 1020, "start": 7518.6, "end": 7547.28, "text": "Shit. Ich meine, es war gut gedacht."}, {"id": 1021, "start": 7547.28, "end": 7555.2, "text": "Es war gut gedacht, das müsst ihr zugeben."}, {"id": 1022, "start": 7555.2, "end": 7584.36, "text": "Mann, game please. Was trifft mich hier eigentlich? Chat, was trifft mich? Was trifft mich?"}, {"id": 1023, "start": 7584.36, "end": 7588.72, "text": "Ich verstehe das Spiel nicht."}, {"id": 1024, "start": 7588.72, "end": 7606.68, "text": "Die Löschanlage. Oh ja, das war wichtig einzubauen. Nichts in dem Spiel funktioniert, aber Hauptsache,"}, {"id": 1025, "start": 7606.68, "end": 7607.68, "text": "die Löschanlage klappt."}, {"id": 1026, "start": 7607.68, "end": 7625.84, "text": "Das war enorm wichtig, das zu implementieren. Funktionierte Löschanlage. Pogger. Fuck,"}, {"id": 1027, "start": 7625.84, "end": 7639.04, "text": "Uni leer. Gerade mal andere Ansichten gegoogelt, alles okay. Okay. Nee, nee, ich meine das"}, {"id": 1028, "start": 7639.04, "end": 7643.72, "text": "natürlich ernst. Das ist schon wichtig. Ich meine, man weiß es ja in so Lagerhallen,"}, {"id": 1029, "start": 7643.72, "end": 7647.0, "text": "dass die Löschanlage funktioniert. Das ist eigentlich essentiell."}, {"id": 1030, "start": 7647.0, "end": 7660.64, "text": "Ach, wir müssen B noch holen. Ich noob. Ich dachte, wir haben es schon. Das Spiel ist"}, {"id": 1031, "start": 7660.64, "end": 7674.64, "text": "so kaputt, guckt euch mal. Hallo. Funktioniert halt mal. Oh, von hinten, von hinten, von"}, {"id": 1032, "start": 7674.64, "end": 7690.88, "text": "hinten. We got fucked up in the ass over here. Ich hab den links gesehen, by the way."}, {"id": 1033, "start": 7690.88, "end": 7708.8, "text": "Oh, hier ist ja gar nix. Hier ist ja gar nix. Wo müssen wir denn hin? Wo müssen wir denn"}, {"id": 1034, "start": 7708.8, "end": 7724.76, "text": "hin? Wo sind die obendrauf, oder? Die K30 sinkt richtig rein. Du hättest nicht gedacht,"}, {"id": 1035, "start": 7724.76, "end": 7730.96, "text": "dass ich noch existiere. Naja, so alt bin ich jetzt auch noch nicht. Ich bin zwar alt,"}, {"id": 1036, "start": 7730.96, "end": 7736.84, "text": "aber so alt auch noch nicht. Also ich bin noch nicht unter der Erde. Kettner stellt"}, {"id": 1037, "start": 7736.84, "end": 7755.04, "text": "ja 85 plus. 85 plus. Battlefield Opa FPS bei Wilhelm Kramer 2.0."}, {"id": 1038, "start": 7755.04, "end": 7775.04, "text": "Kennt noch jemanden, Wilhelm Kramer LP? Das ist klar. Weiß gar nicht, ob es hier noch"}, {"id": 1039, "start": 7775.04, "end": 7778.56, "text": "gibt. Wo die Leute früher gesagt haben, das ist bestimmt Kollege. Ich dachte mir so immer"}, {"id": 1040, "start": 7778.56, "end": 7785.12, "text": "schon seit der Zeit total hängen geblieben, Leute. Warum sollte es Kollege sein? Der hat"}, {"id": 1041, "start": 7785.12, "end": 7790.84, "text": "besseres zu tun, als Wilhelm Kramer LP auf YouTube zu machen. Aber gut, die Leute auf"}, {"id": 1042, "start": 7790.84, "end": 7798.24, "text": "YouTube haben schon immer viel Stuss erzählt, wenn der Tag lang ist. Also eine wirklich"}, {"id": 1043, "start": 7798.24, "end": 7805.64, "text": "gute Range Waffe ist das nicht. Halber Skandal, das kann echt der Opa war. Ja, die Leute"}, {"id": 1044, "start": 7805.64, "end": 7812.08, "text": "sind auch richtig hängen geblieben. Ich meine, das war klar, dass es weder Kollege ist, noch"}, {"id": 1045, "start": 7812.08, "end": 7820.44, "text": "dass es ein richtiger Opa ist. Also keine Ahnung. Es gibt schon nicht so high IQ Leute"}, {"id": 1046, "start": 7820.44, "end": 7826.92, "text": "auf YouTube. Was ist deine Meinung zu dem neuen Battlefield? Ich bin schwer enttäuscht."}, {"id": 1047, "start": 7826.92, "end": 7831.64, "text": "Ernsthaft jetzt. No Copper. Ich kann es jetzt Video zu angucken. Ich bin wirklich schwer"}, {"id": 1048, "start": 7831.64, "end": 7841.52, "text": "enttäuscht von dem Game. Unfertig, undurchdacht. Bugs ohne Ende. Wobei die Bugs ganz ehrlich,"}, {"id": 1049, "start": 7841.52, "end": 7844.88, "text": "die Bugs sind nicht mal mein größtes Kritikpunkt. Mein größter Kritikpunkt, dass es einfach"}, {"id": 1050, "start": 7844.88, "end": 7851.24, "text": "kein richtiges Battlefield mehr ist und so undurchdacht ist an vielen Stellen. Kann"}, {"id": 1051, "start": 7851.24, "end": 7860.16, "text": "man da oben drauf Big Brain? Kranstells? Nee, hat nicht funktioniert. Wo ist der denn?"}, {"id": 1052, "start": 7860.16, "end": 7875.6, "text": "Ohne Granate. Bäm, Bäm, kaputt. Oh, das ist ganz schlecht für mich hier. Ganz schlecht"}, {"id": 1053, "start": 7875.6, "end": 7895.92, "text": "für mich. Okay. Pass auf, Yolo, Yolo, Yolo, Yolo."}, {"id": 1054, "start": 7895.92, "end": 7918.76, "text": "Okay, jetzt ein Motionball hin. Okay, hier kommt nix. Game, komm on, funktionier halt."}, {"id": 1055, "start": 7918.76, "end": 7942.44, "text": "Game, funktionier please. Was, was, was ist mit dem Spiel los? So broken. Oh shit. Also"}, {"id": 1056, "start": 7942.44, "end": 7950.76, "text": "normalerweise sollte mich der Crabling hoch oben aufs Dach ziehen. Anstatt dreimal hintereinander"}, {"id": 1057, "start": 7950.76, "end": 7956.12, "text": "nicht zu funktionieren. Oh sorry, ich hab nicht gesehen, dass du mich retzen willst."}, {"id": 1058, "start": 7956.12, "end": 7962.72, "text": "Released. Wie nennt man das eigentlich? Released ist noch so dark, MMO, Jargon. Wie nennt man"}, {"id": 1059, "start": 7962.72, "end": 7967.96, "text": "das eigentlich offiziell? Wenn man, also Chet, wie nennt man das, wenn jemand dich retzen"}, {"id": 1060, "start": 7967.96, "end": 7973.28, "text": "will, aber du respawnst schon so schnell, bevor er dich retzen kann. Gibt's da irgendwie"}, {"id": 1061, "start": 7973.28, "end": 7981.32, "text": "ein tolles, tolles englisches Anglizismus Wort für? In dark hat man dazu gesagt released."}, {"id": 1062, "start": 7981.32, "end": 8009.84, "text": "Oh, I got shot in the ass over here. Dafür gibt's den Wort, nee, nee, respawn ist ja"}, {"id": 1063, "start": 8009.84, "end": 8015.04, "text": "das eigentliche, wie die erscheinen auf der Map. So dieses, oh, dieses zu früh, zu früh"}, {"id": 1064, "start": 8015.04, "end": 8019.48, "text": "rausgehen. Da muss es, da muss es ein richtig krasses Anglizismus Wort für geben und das"}, {"id": 1065, "start": 8019.48, "end": 8035.04, "text": "will ich benutzen. Early, ähm, da brauchen wir irgendwas für, Leute. Da brauchen wir"}, {"id": 1066, "start": 8035.04, "end": 8050.48, "text": "irgendwas für. Irgendwas. Okay, das war zu mutig. Gibt's Leute, die Hexazone spielen?"}, {"id": 1067, "start": 8050.48, "end": 8056.28, "text": "Nö. Ich glaube Hexazone spielt keiner. Ich hab zwei, drei Runden gespielt für diese"}, {"id": 1068, "start": 8056.28, "end": 8060.68, "text": "Dice Promotion bei mir auf dem Channel. Ansonsten ist es glaube ich dead. Und wenn es nicht"}, {"id": 1069, "start": 8060.68, "end": 8066.4, "text": "free to play wird und auch sehr, sehr, sehr viel Liebe bekommt, wird's auch dead bleiben."}, {"id": 1070, "start": 8066.4, "end": 8076.0, "text": "Deadge. Oh, einer, der sich nie aus der Hüftehals sprechen lassen. Sunnybaited, das finde"}, {"id": 1071, "start": 8076.0, "end": 8092.76, "text": "ich gut. Early Sunnybait. ESB, Early Sunnybait, das finde ich gut. Wir brauchen mehr Anglizismen."}, {"id": 1072, "start": 8092.76, "end": 8101.6, "text": "Ich benutze schon, ich benutze schon viel zu wenig englische Wörter. Sagen die Leute"}, {"id": 1073, "start": 8101.6, "end": 8109.84, "text": "ja auch auf YouTube immer unter den Videos. Die sagen, Junge, was laberst du? Sind aber"}, {"id": 1074, "start": 8109.84, "end": 8124.08, "text": "einfach nur zu noob, high IQ speak zu verstehen. Äh. Ich habe jetzt keine Ahnung, wo hier"}, {"id": 1075, "start": 8124.08, "end": 8145.28, "text": "was ist. Ich weiß nur, dass ich einen Motion Sensor brauche. Alter, guckste dir an. Die"}, {"id": 1076, "start": 8145.28, "end": 8163.0, "text": "Typen mit ihren Panzerplates. Guck mal hier, die halten gut. Die, die, die halten voll"}, {"id": 1077, "start": 8163.0, "end": 8167.24, "text": "dagegen. 33 Tickets nur noch. MonkaS, wir verlieren die Runde ja vielleicht. Was ist"}, {"id": 1078, "start": 8167.24, "end": 8176.44, "text": "denn hier los? So geht es aber nicht. Wir können, wir können nicht einfach losen. Guck mal,"}, {"id": 1079, "start": 8176.44, "end": 8194.36, "text": "guck mal, der LLV, der LLV ist so schlecht, man. Habt ihr gesehen, der LLV, der ist so"}, {"id": 1080, "start": 8194.36, "end": 8200.16, "text": "richtig, also so schlecht kannst du gar nicht sein, wie der LLV ist. Ich möchte jetzt ungern"}, {"id": 1081, "start": 8200.16, "end": 8207.68, "text": "da als erstes vorstellen. Achtung, bunnyhop, volle Pulle, bunnyhop, jawoll, excellent, excellent"}, {"id": 1082, "start": 8207.68, "end": 8212.32, "text": "und jetzt hoch, jetzt hoch. BigBrain stellt's, auf geht's. Da oben erwartet mich jetzt,"}, {"id": 1083, "start": 8212.32, "end": 8223.84, "text": "nein, nein, nein, nein, nein, nein. Shit, shit, shit, shit, shit, shit. Okay, verstecken"}, {"id": 1084, "start": 8223.84, "end": 8240.32, "text": "und einen heiligen Corona Booster reindrücken. Oh, da kommt, oh fuck, in the ass geshootet."}, {"id": 1085, "start": 8240.32, "end": 8247.72, "text": "Sag mal Max, werden heutzutage noch in der Zukunft Linux Adminen? Ja, klar. Ich hab erst,"}, {"id": 1086, "start": 8247.72, "end": 8254.8, "text": "ich hab erst mit einem Kollege telefoniert am letzten Arbeitstag, der irgendwelche Storage"}, {"id": 1087, "start": 8254.8, "end": 8258.92, "text": "Geschichten bei uns gemacht hat, der geht jetzt zu einer anderen Firma, lustigerweise"}, {"id": 1088, "start": 8258.92, "end": 8264.4, "text": "auch zu einer anderen Bank und macht dort Linux, weil die interne Linux Leute gesucht"}, {"id": 1089, "start": 8264.4, "end": 8280.92, "text": "haben, was ich richtig cool finde, dass es das noch gibt. Alter, der hat ja mich ernsthaft"}, {"id": 1090, "start": 8280.92, "end": 8300.16, "text": "gerade noobtubt, hat er mich noobtubt? Oh, oh, massive res. Foff hochstellen, nee, ich"}, {"id": 1091, "start": 8300.16, "end": 8307.4, "text": "komm mit hohem Foff, lustigerweise, oh, oh, oh, oh. Ich komm mit hohem Foff in diesem"}, {"id": 1092, "start": 8307.4, "end": 8312.28, "text": "Battlefield 3 nicht klar. Ich glaube, ich hab, was hab ich, 90er oder 80er Foff? Ich"}, {"id": 1093, "start": 8312.28, "end": 8316.08, "text": "glaub 90er, ich komm mit, ich komm mit mehr Foff nicht klar. Sehr merkwürdig, ich weiß"}, {"id": 1094, "start": 8316.08, "end": 8328.24, "text": "nicht, woran das liegt. Vielleicht, vielleicht Performancegründe oder so. Ich fände es"}, {"id": 1095, "start": 8328.24, "end": 8338.4, "text": "nice, wenn mein Craplinghook ready kommt, dass ich da hoch kann. Nee, das hat jetzt"}, {"id": 1096, "start": 8338.4, "end": 8344.04, "text": "aber, das war schwere Geburt, schwere Geburt. Alter, da ist ne Muni-Kiste, da muss ich hin."}, {"id": 1097, "start": 8344.04, "end": 8350.32, "text": "Ich brauche Muni. All dies unten. Geht es noch jemand so, dass ihr gar nicht, dass man"}, {"id": 1098, "start": 8350.32, "end": 8355.48, "text": "gar nicht richtig erkennt auf der Map, ob es ne Muni-Kiste ist oder ob es ne Medic-Kiste"}, {"id": 1099, "start": 8355.48, "end": 8360.92, "text": "ist? Was ist das hier vor mir, Chat? Ist das ne Medic-Kiste oder ist das ne Muni-Kiste?"}, {"id": 1100, "start": 8360.92, "end": 8378.68, "text": "Ich erkenne es irgendwie nicht richtig auf der Map. Massive-Range-Waffe. Muni? Medic,"}, {"id": 1101, "start": 8378.68, "end": 8387.64, "text": "was denn jetzt, Chat? Ich sehe es, ihr seid euch auch nicht einig. Ich bräuchte mal, bräuchte"}, {"id": 1102, "start": 8387.64, "end": 8398.88, "text": "mal ein bisschen Munition. Ich bräuchte noch mehr Munition. Ist der hier oben drauf?"}, {"id": 1103, "start": 8398.88, "end": 8414.12, "text": "Er muss da. Oh, oh. Bam! Voll in die Fresse. Sollte ich eigentlich ein bisschen Ammo droppen?"}, {"id": 1104, "start": 8414.12, "end": 8425.64, "text": "Ich mag das Movement mit Webster wirklich. Es kann nicht alles doof in dem Game. Aber"}, {"id": 1105, "start": 8425.64, "end": 8435.36, "text": "der Rest ist halt so. P-P-P-P-Pega. Pega. Oh, ich hab immer keine Motion-Sensors, ich"}, {"id": 1106, "start": 8435.36, "end": 8444.8, "text": "hab Smoke immer noch. Passt mal auf, geht das? Ich hab gedacht, man kann sich da vielleicht"}, {"id": 1107, "start": 8444.8, "end": 8459.52, "text": "dran schießen. Geht doch! Geht doch, manchmal geht das. Das war wahrscheinlich einfach zu"}, {"id": 1108, "start": 8459.52, "end": 8485.6, "text": "weit weg. Oh Gott, P-P-Pega. Zwei Leute, die nicht aimen können unter sich."}, {"id": 1109, "start": 8485.6, "end": 8511.12, "text": "Das war ja richtig hängen geblieben, Alter. Zu geil eben. Aber wir haben's, wir haben's,"}, {"id": 1110, "start": 8511.12, "end": 8519.28, "text": "wir haben's. Richtig P-P-Pega aimt alle beide und sich dann gemessert gegenseitig."}, {"id": 1111, "start": 8541.12, "end": 8546.92, "text": "Okay, ich darf nicht wieder. Oh, oh. Ach, da kommt noch ne Base. Ist das die längste"}, {"id": 1112, "start": 8546.92, "end": 8558.2, "text": "Rush-Map? Kann das sein? Oh nee, das sind immer vier, ne? Bin verwirrt. Da oben ist"}, {"id": 1113, "start": 8558.2, "end": 8564.88, "text": "er noch. Ich hoffe, der Pantsman sieht mich nicht. Der müsste hier oben, wir sind überhaupt"}, {"id": 1114, "start": 8564.88, "end": 8571.76, "text": "nicht clear, was der Ansager wieder für'n Shit erzählt. Wir sind definitiv not not clear."}, {"id": 1115, "start": 8571.76, "end": 8580.24, "text": "So, wir nebeln den Dude jetzt einfach mal ein. Pass mal auf, big brain play. Wir nebeln den"}, {"id": 1116, "start": 8580.24, "end": 8596.36, "text": "jetzt ein und jetzt sieht uns natürlich keiner. Und stellts ihn hier hoch, so muss das sein."}, {"id": 1117, "start": 8596.36, "end": 8620.08, "text": "So magisch das. Way too smart. Way too smart. Wie das? Work smart, not hard. Ach, da geht's"}, {"id": 1118, "start": 8620.08, "end": 8633.96, "text": "noch höher. Oh, nicer, nicer. Klitschspot. Passt mal auf, wir boosten uns da jetzt hoch."}, {"id": 1119, "start": 8633.96, "end": 8650.24, "text": "Komm her. Big brain mode activated, Leute. Und jetzt noch eins weiter, noch eins weiter."}, {"id": 1120, "start": 8650.24, "end": 8662.64, "text": "Ja. Oh man, das gibt's net. Was macht der Dude? Was macht der da? Warum ist der da?"}, {"id": 1121, "start": 8662.64, "end": 8669.76, "text": "Was macht der denn hier? Keine Sau sollte hier oben sein. Streamsniper, Leute, Streamsniper,"}, {"id": 1122, "start": 8669.76, "end": 8675.6, "text": "wer ist es von euch? Wer ist es von euch? Jetzt zu. Warum sollte der Typ sonst hier oben"}, {"id": 1123, "start": 8675.6, "end": 8692.04, "text": "sein? BP gar elmt, richtig krass."}, {"id": 1124, "start": 8692.04, "end": 8716.52, "text": "Nee, nee, nee, noch mal, noch mal geht hier, geht hier nix."}, {"id": 1125, "start": 8716.52, "end": 8740.28, "text": "Einen haben wir da. Alle weg. Au, war auf mich zu schneiden. Oh fuck, in dem Moment, wo ich"}, {"id": 1126, "start": 8740.28, "end": 8746.84, "text": "runtergehe, kommen die hoch. Dumm. Die Musik ist richtig paper please, ja. Dustin, danke"}, {"id": 1127, "start": 8746.84, "end": 8771.68, "text": "für den Sub. Wir sollten es schaffen, denke ich. Wir brauchen nur noch A. Oh, da waren"}, {"id": 1128, "start": 8771.68, "end": 8792.76, "text": "ganz schön viele. Wenn man jetzt Trick 17 stellt. Get rekt. Tyrannosaurus rekt."}, {"id": 1129, "start": 8792.76, "end": 8819.72, "text": "So macht man das, Leute, so macht man das. Fatal, ich hole dich. Nein, Fatal, ich hole"}, {"id": 1130, "start": 8819.72, "end": 8826.0, "text": "dich nicht. Ich kämpfe jetzt hier, weil wenn das kaputt geht, Hände hoch, Wochenende, jawohl,"}, {"id": 1131, "start": 8826.0, "end": 8846.36, "text": "Bam. Wochenende, Schwachsinn. Dummes Gelaber, aber easy win easy win. Anstrengend. Too easy."}, {"id": 1132, "start": 8846.36, "end": 8855.24, "text": "Wisst ihr, diese Cringe Sprüche, die hätten richtig, also es gibt zwei Varianten, entweder"}, {"id": 1133, "start": 8855.24, "end": 8860.76, "text": "die hätten halt so realistisches Battlefield Zeug machen müssen, so irgendwie so Military"}, {"id": 1134, "start": 8860.76, "end": 8868.48, "text": "Talk, wisst ihr, das hätte funktioniert, oder die hätten so richtig in die Elite Ecke"}, {"id": 1135, "start": 8868.48, "end": 8873.64, "text": "gehen müssen. Der Typ hätte einfach sagen müssen easy as fuck oder irgendwie sowas"}, {"id": 1136, "start": 8873.64, "end": 8878.04, "text": "am Ende. Eats AF oder irgendwie sowas. Das wäre schon so übertrieben gewesen, dass es"}, {"id": 1137, "start": 8878.04, "end": 8882.4, "text": "die Leute gefeiert hätten. Aber so dieses nix halbes und nix ganzes Cringe Sprüche"}, {"id": 1138, "start": 8882.4, "end": 8888.68, "text": "sind halt Cringe. Also genau, der hätte entweder easy as fuck sagen müssen und einen Backflip"}, {"id": 1139, "start": 8888.68, "end": 8898.08, "text": "machen, so richtig voll übertrieben. So Bad Company 2 Style nur noch heftiger. Oder sie"}, {"id": 1140, "start": 8898.08, "end": 8914.0, "text": "hätten halt irgendwelches Military Speak machen müssen. Jens Kappa ist bei uns. Na,"}, {"id": 1141, "start": 8914.0, "end": 8917.56, "text": "da kann ja eigentlich nix, Jens Kappa ist raus. Da kann eigentlich gar nix mehr schief gehen,"}, {"id": 1142, "start": 8917.56, "end": 8935.8, "text": "aber so. So, wo geht man rein? Auto? Ach, man muss Sponsor nur für das Auto, ok. Volle"}, {"id": 1143, "start": 8935.8, "end": 8942.48, "text": "Pulle B, Volle Pulle B. Gib ihm. Es ist auch Cringe, dass wir schon legen können, bevor"}, {"id": 1144, "start": 8942.48, "end": 8964.44, "text": "die Defender richtig da. Wow. Oder kommt einer von der Seite, der killt mich gleich. Pack,"}, {"id": 1145, "start": 8964.44, "end": 8970.52, "text": "das war mir zu viel. Oder das Gelaber ganz einfach weglassen. Das wäre auch eine Möglichkeit"}, {"id": 1146, "start": 8970.52, "end": 8981.96, "text": "gewesen, das Gelaber einfach wegzulassen, ja. Und das komplette Auto wegzulassen. Denn,"}, {"id": 1147, "start": 8981.96, "end": 8994.76, "text": "genialer Spawn. Denn das Gelaber braucht, wenn man ehrlich ist, kein Mensch. Oh fuck, dachte"}, {"id": 1148, "start": 8994.76, "end": 9004.88, "text": "mir, es wird noch was. Warum spawne ich Dreck unter mir? Ok, das sind mal Gegner, die Widerstand"}, {"id": 1149, "start": 9004.88, "end": 9027.04, "text": "leisten, wie es aussieht. Zumindest etwas. Oh shit, jetzt bin ich down. Fuck. Oder auch"}, {"id": 1150, "start": 9027.04, "end": 9042.0, "text": "nicht. Fuck. Warum ist die nicht umgekippt? Der Pressart. Der Pressart hat mich geschreckt."}, {"id": 1151, "start": 9042.0, "end": 9062.24, "text": "Das wäre noch viel schöner, wenn hier unten auch ein bisschen was abgehen würde. Sehr"}, {"id": 1152, "start": 9062.24, "end": 9076.2, "text": "gut durchdacht, wieder Dice. Ey, what the hell. Funktioniert ja richtig gut. Ok, das sind"}, {"id": 1153, "start": 9076.2, "end": 9082.6, "text": "definitiv mal Gegner, die Gegenwehr leisten. Da müssen wir was machen. Am besten direkt"}, {"id": 1154, "start": 9082.6, "end": 9087.72, "text": "mit dem LLV drüber fahren. Wobei der LLV macht ja keinen Damage an Infanterie, habe"}, {"id": 1155, "start": 9087.72, "end": 9109.08, "text": "ich ja vergessen. Massive, nicer Spawn. Irgendwo ist doch hier nur einer. Wo sind sie denn?"}, {"id": 1156, "start": 9109.08, "end": 9135.0, "text": "Oh, da oben. Oh, Alter, jetzt haben sie aber von allen Seiten Attacks dort."}, {"id": 1157, "start": 9135.0, "end": 9140.64, "text": "Spielst du auf hohen oder niedrigen Grafikeinstellungen? Ich spiele auf den niedrigsten Grafikeinstellungen,"}, {"id": 1158, "start": 9140.64, "end": 9145.08, "text": "die es gibt. Und warum ich jetzt sogar noch ein bisschen mehr FPS habe liegt daran, weil"}, {"id": 1159, "start": 9145.08, "end": 9153.72, "text": "es 16 vs. 16 Rush ist und 16 vs. 16 ein bisschen mehr FPS hat als... Warum man sich gedacht"}, {"id": 1160, "start": 9153.72, "end": 9157.24, "text": "hat, das ist eine gute Idee, dass die in unseren Spawn schießen können und wir in ihren Spawn"}, {"id": 1161, "start": 9157.24, "end": 9174.2, "text": "nach der nächsten Base. I don't know. Horge. Horge erst. Ich will da nicht als erster rein,"}, {"id": 1162, "start": 9174.2, "end": 9198.2, "text": "ehrlich gesagt. O-oh. O-oh. Beringer. Fuck. Please sterben."}, {"id": 1163, "start": 9198.2, "end": 9210.32, "text": "Alter, die sind ja überall. Seht ihr mal, wie schlecht der LRV ist? Habt ihr das gesehen?"}, {"id": 1164, "start": 9210.32, "end": 9228.36, "text": "Progress, Progress. Fuck. Die sind auf Zack, die Gegner. Das merkst du sofort, wenn du"}, {"id": 1165, "start": 9228.36, "end": 9242.08, "text": "auf Zack kommst. Dann ist das halbes ESL-Match. Direkt auf Zack. Vielleicht kann ich da Spawn"}, {"id": 1166, "start": 9242.08, "end": 9254.28, "text": "sollen? Sollte man nicht hier eigentlich drin Spawn können? Okay, jetzt haben wir ein Problem."}, {"id": 1167, "start": 9254.28, "end": 9265.0, "text": "Wenn der Angriff nicht klappt, haben wir gelitten und ich glaube nicht, dass der klappt."}, {"id": 1168, "start": 9265.0, "end": 9289.96, "text": "Wir sind auf Zylinder-Driving. Orgas. Exquisite-Driving. Nicht am fucking Felsen hängen bleiben,"}, {"id": 1169, "start": 9289.96, "end": 9301.08, "text": "aber das ist die Runde. Richtig hart geschwitzt ist die Runde. Es ist aber auch nicht richtig"}, {"id": 1170, "start": 9301.08, "end": 9306.56, "text": "balanced. Mal rasiert man, mal wird man rasiert. So ist es halt, Leute. Und ich sage euch,"}, {"id": 1171, "start": 9306.56, "end": 9311.36, "text": "so muss es sein. So muss es sein. Diese ganze Skill-Base-Matchmaking-Scheiß. Ich habe kein"}, {"id": 1172, "start": 9311.36, "end": 9320.36, "text": "Problem, wenn ich manchmal auf den Zack kriege. Aber so dieses permanente 50-50-Zack-Teil einfach."}, {"id": 1173, "start": 9320.36, "end": 9344.76, "text": "Moment. Chat, was geht ab? Hallo. Jetzt, da ich endlich mal den Stream erwische, wenn"}, {"id": 1174, "start": 9344.76, "end": 9351.96, "text": "es nicht gerade zu Ende geht. Ja, Pech manchmal. Wie ist die Performance vom Battle? Schlecht."}, {"id": 1175, "start": 9351.96, "end": 9358.04, "text": "Immer noch schlecht. Immer noch schlecht. Die wird nicht besser sein. Muss die ja keine"}, {"id": 1176, "start": 9358.04, "end": 9365.36, "text": "Hoffnung machen. Wisst ihr was auch witzig ist, dass die in ihren ganzen Patch-Geschichten,"}, {"id": 1177, "start": 9365.36, "end": 9371.64, "text": "oh, Hauer Class, come on. Dass sie in ihren ganzen Patch-Geschichten nichts zu Performance-Improvements"}, {"id": 1178, "start": 9371.64, "end": 9378.6, "text": "wirklich sagen. Warum man sich beim Liegen im Aim nicht bewegen kann, weil das die Noobs"}, {"id": 1179, "start": 9378.6, "end": 9386.08, "text": "überfordert. Du kannst doch nicht die Noobs überfordern. Die müssen sich Skins kaufen."}, {"id": 1180, "start": 9386.08, "end": 9391.44, "text": "Das geht aber nicht. Stell dir mal vor, die müssen eine Taste zum Hinlegen drücken und"}, {"id": 1181, "start": 9391.44, "end": 9399.32, "text": "können noch während dem Liegen links und rechts robben. Nee, das geht nicht. Das geht"}, {"id": 1182, "start": 9399.32, "end": 9405.64, "text": "nur wirklich nicht. Das kannst du nicht machen. Das kannst du nicht bringen 2021. Legacy Feature,"}, {"id": 1183, "start": 9405.64, "end": 9420.88, "text": "das geht nicht. Ja, so sieht es aus. Legacy Feature. Dieses Bunnyhop, das finde ich tatsächlich"}, {"id": 1184, "start": 9420.88, "end": 9437.4, "text": "ganz witzig. Jetzt geht es Omikron am Start. Alter, Monarch S. Ich habe die Gegner gesehen."}, {"id": 1185, "start": 9437.4, "end": 9466.04, "text": "Ich hoffe, die nehmen mich nicht."}, {"id": 1186, "start": 9466.04, "end": 9485.08, "text": "Ich höre die ja diffusen. F***, das ist zu viel. Alter, ich bin gerade voll am sterben."}, {"id": 1187, "start": 9485.08, "end": 9511.72, "text": "Alter, ich bin voll am abkratzen. Mit wieviel DPI? 800. Ja ja, Omikron, jetzt vorbei. Gibt"}, {"id": 1188, "start": 9511.72, "end": 9522.44, "text": "es das eigentlich in Hessen schon? Hat Hessen schon den ersten Fall? Hoffe ja nicht. Objective"}, {"id": 1189, "start": 9522.44, "end": 9529.8, "text": "Alpha. Jetzt pass auf, richtig krasse Stells Action. Riechtiger, richtiger Five-Hand-Stell."}, {"id": 1190, "start": 9529.8, "end": 9544.4, "text": "Wir stellen uns von der Seite rein. Hallo, Digger Sack. Ich habe nichts gesagt. Ich dachte,"}, {"id": 1191, "start": 9544.4, "end": 9549.76, "text": "Big Brain Play, dabei haben die mich outplayed. Fluffykick sagt, er findet die Maps so hässlich."}, {"id": 1192, "start": 9549.76, "end": 9553.24, "text": "Ja, da bist du nicht der einzige. Ich finde die Map nicht nur hässlich, ich finde die"}, {"id": 1193, "start": 9553.24, "end": 9560.6, "text": "Map auch schlecht zu spielen. Das ist ja die fatalste Kombination. Schlecht zu spielen"}, {"id": 1194, "start": 9560.6, "end": 9588.72, "text": "und sieht kacke aus. Alles dead? Alles dead? Und Scheiben. Lohnt sich das Game nach? Nein,"}, {"id": 1195, "start": 9588.72, "end": 9592.64, "text": "das ist glaube ich die häufigst schnellste Frage, nicht nur des Tages, sondern der ganzen"}, {"id": 1196, "start": 9592.64, "end": 9596.12, "text": "Battlefield Streams. Nein, das Game lohnt sich vor den Patches nicht, das Game lohnt"}, {"id": 1197, "start": 9596.12, "end": 9599.44, "text": "sich auch nach den Patches nicht. Und ich gehe mal davon aus, das Game wird sich eine"}, {"id": 1198, "start": 9599.44, "end": 9605.4, "text": "sehr sehr lange Zeit nicht lohnen, wenn überhaupt, jemals. Ich sage es euch, wie es ist. Ich"}, {"id": 1199, "start": 9605.4, "end": 9616.24, "text": "habe kein Interesse dran, irgendwie hier was zu sellen, was nicht... Wozu auch? Kriege"}, {"id": 1200, "start": 9616.24, "end": 9623.0, "text": "ich immer Geld für. Wenn mir DICE irgendwie 2000€ Monatsgehalt als Battlefield Anpreiser"}, {"id": 1201, "start": 9623.0, "end": 9629.68, "text": "bezahlen würde, ja gut, dann erzähle ich alles mögliche. Aber was willst du machen?"}, {"id": 1202, "start": 9629.68, "end": 9641.48, "text": "Aber ansonsten, sage ich was Sache ist. Ist Rush jetzt für kurze Zeit Standard? Das weiß"}, {"id": 1203, "start": 9641.48, "end": 9647.42, "text": "ich nicht so genau. Es ist eine dieser angebließenen Playlists, was im Prinzip heißt, es könnte"}, {"id": 1204, "start": 9647.42, "end": 9650.96, "text": "jederzeit rausfliegen, aber ich bin mir nicht sicher, ob es dazu ein Statement gibt. Sollten"}, {"id": 1205, "start": 9650.96, "end": 9654.96, "text": "die Rush rausschmeißen, das ist das dümmste, was sie machen könnten, weil Rush ist das"}, {"id": 1206, "start": 9654.96, "end": 9666.72, "text": "einzige, was sich in diesem Spiel halbwegs spielenswert ist. Jaja, jaja. Achtung, wir"}, {"id": 1207, "start": 9666.72, "end": 9678.44, "text": "machen jetzt Schildstells. Schildstells. Hätte ja funktionieren können. Location Revealed,"}, {"id": 1208, "start": 9678.44, "end": 9684.76, "text": "oh nein. Meine Location ist Revealed. Da machst du nichts, da muss ich jetzt eigentlich gleich"}, {"id": 1209, "start": 9684.76, "end": 9692.92, "text": "raus. Da bin ich gleich heim. Übrigens auch so ein Ding, in alten Battlefields bist du"}, {"id": 1210, "start": 9692.92, "end": 9701.28, "text": "in der gleichen Pose gespawnt, wie der Typ, bei dem du gespawnt bist, wisst ihr was ich"}, {"id": 1211, "start": 9701.28, "end": 9714.6, "text": "meine? Alles klar. Hier nicht. Oh, Pogas Ratz, Pogas Ratz. Nein, nicht Pogas Ratz. Pogas"}, {"id": 1212, "start": 9714.6, "end": 9726.0, "text": "Ratz, noch mal ein. Zwei Stück gehen da nicht. Oh, nice, nice, nice. Ein Spawn Beacon. Jawoll."}, {"id": 1213, "start": 9726.0, "end": 9739.4, "text": "Beacon. Alter, wie soll man denn hier durch, wie genau hat man sich das bei DICE vorgestellt,"}, {"id": 1214, "start": 9739.4, "end": 9744.96, "text": "an dieser Stelle? Was ist da jetzt so, was ist der, was ist the way? Was ist der Plan?"}, {"id": 1215, "start": 9744.96, "end": 9753.28, "text": "Ich war hinter der Säule. Es gibt kein TDM in All Out Warfare. Nein, All Out Warfare"}, {"id": 1216, "start": 9753.28, "end": 9756.96, "text": "TDM finde ich ist echt eine gute Idee. Die müssten die Maps glaube ich trotzdem ein"}, {"id": 1217, "start": 9756.96, "end": 9762.2, "text": "Ticken kleiner machen. Ihr habt eine Panzer hier, ich sehe nicht, irgendwo hier stellst"}, {"id": 1218, "start": 9762.2, "end": 9786.16, "text": "herum da. Ja, wunderbar. Ich spreide jetzt einfach nur wild rein. Sieht doch schon mal"}, {"id": 1219, "start": 9786.16, "end": 9795.84, "text": "viel besser aus. Das sieht doch schon mal viel besser aus jetzt. Alter, kannst du dich"}, {"id": 1220, "start": 9795.84, "end": 9819.48, "text": "mal heilen? Pippo Fett, Webster. Was? What the fuck? Hit Detection please, come on. Warum"}, {"id": 1221, "start": 9819.48, "end": 9824.68, "text": "war die nicht tot? Es ist einfach wieder die Hälfte durchgeflogen. Anders kann ich mir"}, {"id": 1222, "start": 9824.68, "end": 9827.96, "text": "das nicht erklären. Ich habe jetzt so viele gekillt. Da muss doch jetzt mal irgendwie,"}, {"id": 1223, "start": 9827.96, "end": 9833.32, "text": "da muss doch jetzt was gehen hier. Bam, bam, bam, auf geht's. Durch hier, durch, next,"}, {"id": 1224, "start": 9833.32, "end": 9848.08, "text": "fuck. Ist ja sehr nett. Oh ja, tolle Idee. Da ist ein Auto. Ich fahre keinen Panzer,"}, {"id": 1225, "start": 9848.08, "end": 9865.68, "text": "was sag ich? Rein da. Rum, rum, rum. Monkastier. Monkastier. Vielleicht haben wir Glück. Paar"}, {"id": 1226, "start": 9865.68, "end": 9871.12, "text": "Leute sind da, wir gehen eher dahin. Wir gehen eher dahin würde ich sagen. Weil da haben"}, {"id": 1227, "start": 9871.12, "end": 9886.88, "text": "wir noch paar Monkastiers am Start. Okay, kann ich mitleben. Geht ja nicht. Du wartest"}, {"id": 1228, "start": 9886.88, "end": 9891.28, "text": "mich am M-Kombi da. Nice, nice, das ist ein guter Plan. Ich würde auch nicht einfach"}, {"id": 1229, "start": 9891.28, "end": 9903.48, "text": "so rein sporen und 3 Stunden rennen. Warum auch? Nice, die lege Henne ist on air. Was"}, {"id": 1230, "start": 9903.48, "end": 9922.28, "text": "macht der hier? Was ist er hier am Doen? Aus dem Fatal Fast zu Killen. Dich Killen. Stream"}, {"id": 1231, "start": 9922.28, "end": 9934.2, "text": "Schneiber. Ich muss, geht nicht anders. Alles immer Stream Schneiber. Oh, die diffusen,"}, {"id": 1232, "start": 9952.28, "end": 9966.44, "text": "ich habe nix gesehen. Dumme Kacke, wenn es nicht richtig funzt, was es eigentlich funzen"}, {"id": 1233, "start": 9966.44, "end": 9972.4, "text": "sollte. Aber dadurch, dass ich jetzt eingesmoked habe, habe ich glaube ich, haben wir ganz"}, {"id": 1234, "start": 9972.4, "end": 9978.36, "text": "gute Chancen vor zu pushen. Ja, guck mal hier. Da ist er schon. Ne, der ist da dauernd. Oh,"}, {"id": 1235, "start": 9978.36, "end": 10004.24, "text": "ich kriege den Rats. Der Rats, da ist er. Oh, ich habe keine Muni mehr. Oh, nice, nice."}, {"id": 1236, "start": 10004.24, "end": 10015.32, "text": "Alter, oh. Monka, da geht es aber gerade mal richtig, richtig zu sagen. Nein, nein, nein,"}, {"id": 1237, "start": 10015.32, "end": 10019.24, "text": "nicht diffusen, Alter, nicht diffusen. Macht den Fatal, lebt der noch? Ne, ne, ich glaube"}, {"id": 1238, "start": 10019.24, "end": 10022.36, "text": "so bewegt man sich in dem Spiel nicht, wenn man noch lebt. Nein, nein, nein, da geht"}, {"id": 1239, "start": 10022.36, "end": 10029.52, "text": "einer ran. No. Bam. Die hat die Reetaste nicht gefunden. Für so Leute, wie die Sundance"}, {"id": 1240, "start": 10029.52, "end": 10034.84, "text": "eben, ist das gemacht, damit, dass man sich nicht hinlegen kann und gleichermaßen sich"}, {"id": 1241, "start": 10034.84, "end": 10038.84, "text": "bewegen. Weil ihr habt es gesehen, die hat es nicht geschafft, an das M-Com ranzugehen"}, {"id": 1242, "start": 10038.84, "end": 10044.12, "text": "und E zu drücken. Und wenn man es nicht schafft, an ein M-Com ranzugehen und E zu drücken,"}, {"id": 1243, "start": 10044.12, "end": 10052.96, "text": "kann man noch nicht erwarten, dass man sich hinlegen kann und dabei moveen. Nein, schlechte"}, {"id": 1244, "start": 10052.96, "end": 10076.68, "text": "Idee. Gute Idee. Alter, man bleibt doch mal stehen. Okay. Sehr gut. Monka, stehe. Leute,"}, {"id": 1245, "start": 10076.68, "end": 10087.08, "text": "weg, während ich hier liege. Das muss jetzt einfach mal an der Stelle sein. Bis ich respawned"}, {"id": 1246, "start": 10087.08, "end": 10100.92, "text": "bin. Sonst lag das Game. Muss es leider umschalten. Lass mich reinspawnen, please. Reinspawn,"}, {"id": 1247, "start": 10100.92, "end": 10109.56, "text": "reinspawn, reinspawn, reinspawn, reinspawn, reinspawn, reinspawn. Da ist was. Da war was."}, {"id": 1248, "start": 10109.56, "end": 10116.56, "text": "Tollisch. Ui. Blup. Warum haben eigentlich in diesem Battlefield alle einen D-Feeder"}, {"id": 1249, "start": 10116.56, "end": 10123.36, "text": "bei? Ist das irgendwie...nice Logik? Egal, das Spiel hat keine Logik. Warum frage ich"}, {"id": 1250, "start": 10123.36, "end": 10135.04, "text": "an Logik? Lul. Logik overrated, jebaited, outdated. Äh. Hallo? Der hat einfach nicht"}, {"id": 1251, "start": 10135.04, "end": 10140.68, "text": "geschossen. Aber das ist schon das Dritte, was manchmal Aussetzer hat. Springen geht"}, {"id": 1252, "start": 10140.68, "end": 10146.92, "text": "manchmal gar nicht, Nahkampfen geht manchmal...Nahkampfen, Alter. Melee geht manchmal gar nicht und manchmal"}, {"id": 1253, "start": 10146.92, "end": 10150.76, "text": "geht anscheinend schießen auch nicht. Wo kämen wir auch hin, wenn in dem Shooter schießen"}, {"id": 1254, "start": 10150.76, "end": 10155.64, "text": "funktionieren würde. Das wäre ja komplett...Also wer kann...Also nee, das kann man ja nicht"}, {"id": 1255, "start": 10155.64, "end": 10167.24, "text": "erwarten. Das kann man ja beim besten Bild nicht erwarten. Das ist das Shooten einfach"}, {"id": 1256, "start": 10167.24, "end": 10197.16, "text": "über mir. Über uns sind die. Endgame, Alter. Up we go! Up we go!"}, {"id": 1257, "start": 10197.16, "end": 10211.6, "text": "Yolo Swagger. Der Yolo Swagger ist da. Endlich. Der Yolo Swagger. Der Yolo Swagger, da war er."}, {"id": 1258, "start": 10211.6, "end": 10236.08, "text": "Nee, da war er nicht. Achtung, Flank Action. Der Yolo Swagger. Also Leute, ich muss sagen,"}, {"id": 1259, "start": 10236.08, "end": 10241.76, "text": "ich bin mit meiner Performance mittlerweile in Multiplayer-Spielen als 37-jähriger Boomer"}, {"id": 1260, "start": 10241.76, "end": 10247.28, "text": "eigentlich ganz zufrieden. Das war jetzt dumm, aber ganz ehrlich, wenn ich mir andere 37-Jährige"}, {"id": 1261, "start": 10247.28, "end": 10257.84, "text": "angucke, wie die Spiele spielen online, dann ist das durchaus in Ordnung. Nice Rats. Gut,"}, {"id": 1262, "start": 10257.84, "end": 10262.68, "text": "ich mein, man darf nicht vergessen, die ältesten CS-Spieler sind nicht so viel jünger als"}, {"id": 1263, "start": 10262.68, "end": 10268.36, "text": "ich. Auch wenn die nicht mal so in ihrer Prime sind. Wie alt ist Guardian jetzt? Oder Test"}, {"id": 1264, "start": 10268.36, "end": 10284.32, "text": "oder so? Die sind doch auch schon irgendwie 34 oder sowas. Wer weiß, dass die jemand wie"}, {"id": 1265, "start": 10284.32, "end": 10299.4, "text": "alt sind. Richtig nice ist PP-GM. Oh, da schießt was auf mich. Guck mal hier, da kommt was"}, {"id": 1266, "start": 10299.4, "end": 10316.04, "text": "rüber und will mich shooten. Da kommt noch was. Monka Shoot. Alter, oh nee, ich hab nichts"}, {"id": 1267, "start": 10316.04, "end": 10326.76, "text": "mehr. Ich nebel mich jetzt einfach ein und warte hier. Alter, ich hör hier 50 Gegner"}, {"id": 1268, "start": 10326.76, "end": 10330.44, "text": "um mich drum herum und du weißt in diesem Battlefield nie, ob sie nah oder entfernt"}, {"id": 1269, "start": 10330.44, "end": 10342.88, "text": "sind. Monka S. Wir machen das Trick 17, guckt euch das mal an. Oh nee, hat nicht funktioniert."}, {"id": 1270, "start": 10342.88, "end": 10372.8, "text": "Hat nicht gefunzt. Moni, Moni, Moni, gib mir Moni. Watch my back. Ok, pass auf, pass"}, {"id": 1271, "start": 10372.8, "end": 10378.52, "text": "auf, big brain move. Massive big brain move. Jawoll, jawoll, schießt mir nicht in Bobbes,"}, {"id": 1272, "start": 10378.52, "end": 10399.92, "text": "nicht in der Ice shooten. Sehr gut. Oh, in der Ask shootet. 37 ist das, 29. Ist so. Ich"}, {"id": 1273, "start": 10399.92, "end": 10406.72, "text": "sag euch Leute, die jetzt, also in meinem Alter und noch älter, die werden auch bis 70 plus"}, {"id": 1274, "start": 10406.72, "end": 10412.36, "text": "spielen und noch ganz ok sein können, wenn sie da in die nötige Zeit in den Game reinstecken."}, {"id": 1275, "start": 10412.36, "end": 10416.16, "text": "Ich mein, ich merk das schon, dass ich jetzt nicht mehr so mega schnell in den Game rein"}, {"id": 1276, "start": 10416.16, "end": 10433.76, "text": "kommen wie früher vielleicht. Nein, die haben Disabled. Die Noobs. Hast du nicht mehr so"}, {"id": 1277, "start": 10433.76, "end": 10439.56, "text": "viel Zeit in den Westin? Naja, es hat schon seinen Grund, dass die ganzen, dass die ganzen"}, {"id": 1278, "start": 10439.56, "end": 10460.24, "text": "Competitive Pros alle irgendwie 16, 16 bis 25 sind oder so. Ich bin mir nicht so ganz"}, {"id": 1279, "start": 10460.24, "end": 10465.48, "text": "sicher, wo die Gegner sind. Ah fuck, ich hab ja noch, nein, ich brauch meine Motion Balls."}, {"id": 1280, "start": 10465.48, "end": 10481.68, "text": "Shit, ich brauch die Motion Balls, sonst seh ich ja gar nichts. Nope, wir kriegen kein"}, {"id": 1281, "start": 10481.68, "end": 10488.88, "text": "Rest, passt nicht. Haben wir eigentlich schon ein M-Com geplantet hier? Banana Planter 27,"}, {"id": 1282, "start": 10488.88, "end": 10496.84, "text": "das wollte ich jetzt machen hier. Gib ihm, gib ihm. Oh man, ich spawn hier ernsthaft"}, {"id": 1283, "start": 10496.84, "end": 10510.24, "text": "mitten auf dem Feld, Alter. Keine, not, not Pog. Ich weiß, was hier, what? Not, not Pog."}, {"id": 1284, "start": 10510.24, "end": 10515.32, "text": "Ich wollte runterlegen, da unten ist das M-Com vollkommen frei. Das ist doch unterirdisch,"}, {"id": 1285, "start": 10515.32, "end": 10524.84, "text": "das ist das M-Com. Not Pog, wo ist der Panz, der Panzman überhaupt, dass der mich da gehitted"}, {"id": 1286, "start": 10524.84, "end": 10546.36, "text": "hat? Genau, hier runter müssen wir. So, einmal Balls, einmal Balls. Und jetzt Legehennen"}, {"id": 1287, "start": 10546.36, "end": 10557.84, "text": "machen, Leute. Ach nee, haben wir das schon? Ich bin verwirrt. Zack. Ach, wir haben nur"}, {"id": 1288, "start": 10557.84, "end": 10566.72, "text": "noch das oben. Lull. Ja Mensch, sagt mir das doch mal einer. Boomer hier, das ist nicht"}, {"id": 1289, "start": 10566.72, "end": 10591.52, "text": "so schnell. Aber wir können jetzt da oben drauf. Okay, das ist definitiv not, not range weapon."}, {"id": 1290, "start": 10591.52, "end": 10607.2, "text": "Fuck, jetzt sind sie oben. Da machst du nichts. Aber wir hätten im gleichen Moment, wo ich"}, {"id": 1291, "start": 10607.2, "end": 10613.84, "text": "da hinten Action mache in der Backline, hätten wir rüberpushen müssen. Aber wir haben einen"}, {"id": 1292, "start": 10613.84, "end": 10617.24, "text": "schönen Motion Sensor drin, das heißt, man sieht alles. Rätsel wird mich hier oben natürlich"}, {"id": 1293, "start": 10617.24, "end": 10622.64, "text": "keiner, das ist klar, wie auch. Nice, wir sind fast dran, Leute, wir sind fast dran."}, {"id": 1294, "start": 10622.64, "end": 10647.84, "text": "Jetzt nicht sinnlos sterben, wir haben immer viele. Wir haben nur noch sechs Tickets. Nice,"}, {"id": 1295, "start": 10647.84, "end": 10655.32, "text": "wir sind fast dran. Oh, shit, shit, shit. Fuck, ich wusste, dass der von hinten kommt. Nein,"}, {"id": 1296, "start": 10655.32, "end": 10661.92, "text": "nein, nein. Aber der ist dead, der ist dead, da geht jetzt gleich noch einer ran. Ich habe"}, {"id": 1297, "start": 10661.92, "end": 10669.28, "text": "reloaded, ich hätte Pistole switchen müssen. Perfekt. Nein, das macht nichts, die kommen"}, {"id": 1298, "start": 10669.28, "end": 10674.92, "text": "nicht mehr ran, die kommen nicht mehr ran. Die kommen nicht mehr ran. Nein, nein, nein,"}, {"id": 1299, "start": 10674.92, "end": 10692.68, "text": "nein, da liegt einer und diffused. No. Not like this. Danach hätten wir gewonnen. Senden"}, {"id": 1300, "start": 10692.68, "end": 10702.02, "text": "soll die Klappe. Maria auch die Klappe halten. Webster auch die Klappe halten. Das war knapp,"}, {"id": 1301, "start": 10702.02, "end": 10707.64, "text": "das war richtig klaus, die Runde. Hipfire Kills, der mag das Game mag Hipfire Kills,"}, {"id": 1302, "start": 10707.64, "end": 10719.04, "text": "wie es aussieht. Fast Match of the Day. Jedes Match ist anscheinend noch dem Game Fast Match"}, {"id": 1303, "start": 10719.04, "end": 10725.68, "text": "of the Day. Was ist das XP Boost so zum Release oder was? Also ich denke, eine Runde kann"}, {"id": 1304, "start": 10725.68, "end": 10737.92, "text": "die noch spielen. Ich merke schon, dass man hier nicht mehr richtig mitmacht. Was? Ich"}, {"id": 1305, "start": 10737.92, "end": 10743.72, "text": "frage mich echt, warum die XP? Ja, weil es XP Farm Server gab, aber der Witz ist halt."}, {"id": 1306, "start": 10743.72, "end": 10747.84, "text": "Könnt ihr euch noch an den Portal Trailer erinnern? Das erste, was ich gesagt habe,"}, {"id": 1307, "start": 10747.84, "end": 10752.32, "text": "ist, was machen die, dass es keine Booster Server gibt und BÄM, es gibt Booster Server."}, {"id": 1308, "start": 10752.32, "end": 10757.88, "text": "Das hätte ja niemand, für mich auch die letzte Runde, hätte niemand ahnen können. Man könnte"}, {"id": 1309, "start": 10757.88, "end": 10763.68, "text": "das Ganze übrigens fixen. Also wenn die Bot Booster Server haben in Portal, dann einfach"}, {"id": 1310, "start": 10763.68, "end": 10771.48, "text": "abschalten, ist es gegen echte Spieler einfach, solange es die default Settings sind, was"}, {"id": 1311, "start": 10771.48, "end": 10777.28, "text": "Hells und sowas angeht, erlauben. Warum nicht? Ich meine, scheiß drauf. Warum nicht? Dann"}, {"id": 1312, "start": 10777.28, "end": 10795.16, "text": "sind die Leute Level 300, wem die juckts. Jetzt nochmal World War 3. Ich habe es versucht"}, {"id": 1313, "start": 10795.16, "end": 10799.84, "text": "zu deinstallieren, habe keinen Deinstaller gefunden und musste meinen Rechner von russischem"}, {"id": 1314, "start": 10799.84, "end": 10805.56, "text": "Anti-Cheat Deepnoten, das ich wegbekommen habe, Windows Service löschen und sonstige"}, {"id": 1315, "start": 10805.56, "end": 10810.8, "text": "Sachen klären, ich werde das nie wieder installieren. Zu viel russische K-K-K-K-Kommandat"}, {"id": 1316, "start": 10810.8, "end": 10817.32, "text": "Spyware drauf. Naja, nicht wirklich Spyware, kann man nicht sagen. Es ist halt legit Anti-Cheat,"}, {"id": 1317, "start": 10817.32, "end": 10842.08, "text": "aber keine, die ich haben will. Ich weiß gar nicht, wo die sind. Es geschult. Ihr wollt"}, {"id": 1318, "start": 10842.08, "end": 10852.8, "text": "auch nicht flanken oder? Wollt ihr flanken? Wieder schön um die Ecke. LMG legit. Die kriegen"}, {"id": 1319, "start": 10852.8, "end": 10861.68, "text": "das glaub ich noch, die kriegen das noch diffused oder? Nein, nein, gut, gut, gut. Angel, retz"}, {"id": 1320, "start": 10861.68, "end": 10887.84, "text": "mich Angel. Angelo, gib mir. Voll in Ass, in Ass geballert. Wow. Macht's mit Rush wieder"}, {"id": 1321, "start": 10887.84, "end": 10897.16, "text": "richtig bock? Nein, es macht mit Rush erträglich. Rush macht das Spiel erträglich. Oben ist"}, {"id": 1322, "start": 10897.16, "end": 10917.0, "text": "doch einer. Nice, nice, der Viertel macht das. Nice, nice, nice. Gut, gleich das Loch getroffen"}, {"id": 1323, "start": 10917.0, "end": 10937.72, "text": "hier. Nach die Base. Vielleicht haben wir Glück. Nein. Das ist ein Sentry Gun da oben. Ich"}, {"id": 1324, "start": 10937.72, "end": 10946.96, "text": "geh da mal rein. Ich seh da zwar nix, aber wenn ich was sehen würde. Alter, ich kann"}, {"id": 1325, "start": 10946.96, "end": 10953.56, "text": "meine Waffe nicht wechseln. Ich kann nicht switchen. Meine Güte ey. Alter, ich kann"}, {"id": 1326, "start": 10953.56, "end": 10963.56, "text": "nicht anvisieren. Meine Iron Sides gehen nicht. Es ist broken. Es ist broken. Meine Iron Sides,"}, {"id": 1327, "start": 10963.56, "end": 10968.92, "text": "na jetzt geht's wieder. Meine Güte, Alter. Ein Shooter in dem Shooten nicht funktioniert."}, {"id": 1328, "start": 10968.92, "end": 10995.48, "text": "Sehr gut gemacht da ist. Pog, Pog, Pog, Pog, Pog, Pog. Poggers. Ein, ein nicest, nicest"}, {"id": 1329, "start": 10995.48, "end": 11011.04, "text": "Game. Oh, aber den haben wir noch schön geklatscht. Shooten ist ja auch eine Legacy Mechanik, genau"}, {"id": 1330, "start": 11011.04, "end": 11018.24, "text": "wie Scoreboard. Richtig. Alles, alles Legacy. Alles was nicht funktioniert ist Legacy Feature,"}, {"id": 1331, "start": 11018.24, "end": 11023.52, "text": "das brauchen wir nicht. Es ist ja auch, sag mal so, reliable Waffen und Hit Detection in"}, {"id": 1332, "start": 11023.52, "end": 11029.04, "text": "dem Online-FPS. Also, wer kommt auf so eine Idee, dass man das bräuchte? Das ist ja komplett"}, {"id": 1333, "start": 11029.04, "end": 11040.44, "text": "overrated, outdated, outdated. Oh, nee. Panikhoppen hat man nicht von uns. Über Ranges? Oh, oh,"}, {"id": 1334, "start": 11040.44, "end": 11066.0, "text": "oh, oh, oh, oh, oh. Der hat's auch nicht gecheckt, oder? The Nightbot ist schlau."}, {"id": 1335, "start": 11066.0, "end": 11074.52, "text": "Rush mit 128 Spielern, das werde ich nicht spielen. Die können noch 24 Spieler erhöhen"}, {"id": 1336, "start": 11074.52, "end": 11081.04, "text": "und die Maps vielleicht ein bisschen besser ausnutzen. Aber ansonsten? Ich persönlich"}, {"id": 1337, "start": 11081.04, "end": 11093.16, "text": "finde ja eigentlich 16 versus 16 am besten. Auf Range ist die halt wirklich nicht so der"}, {"id": 1338, "start": 11093.16, "end": 11123.04, "text": "Bringer. Okay, jetzt rennen sie rüber, jetzt gehen wir hier hin. Sag mal, okay, ich hab"}, {"id": 1339, "start": 11123.04, "end": 11146.6, "text": "nicht jeden Schuss getroffen, ja? Okay. Aber. So mies war das jetzt auch nicht. Sag mal,"}, {"id": 1340, "start": 11146.6, "end": 11158.28, "text": "what the fuck? Kann ich den mal umkippen? Oder ist mein Boomer hier einfach zu lang gespielt?"}, {"id": 1341, "start": 11158.28, "end": 11177.96, "text": "Ich hätte nix mehr. Das wird es wahrscheinlich sein. Liegt es in dem Fall nicht mal am Game."}, {"id": 1342, "start": 11177.96, "end": 11191.48, "text": "Metro, ja, aber Metro bitte nicht mit 128. Okay, da rechne ich da. Fuck! Ich dachte,"}, {"id": 1343, "start": 11191.48, "end": 11199.24, "text": "da rechne ich damit, dass ich direkt reiße. Oh, hier liegen sie. Das ganze, das ganze"}, {"id": 1344, "start": 11199.24, "end": 11221.92, "text": "Kaligua-Squad. Massive Spawn-Punkte, die sind so richtig pock, die Spawn-Punkte. In"}, {"id": 1345, "start": 11221.92, "end": 11226.08, "text": "the ass shooted. Jetzt liege ich hoffentlich, nein, ich liege in der Mauer. Webster, du"}, {"id": 1346, "start": 11226.08, "end": 11229.88, "text": "dicker Sack, leg dich nicht in die Mauer. Wenn ich in der Mauer bin, kann ich gerest"}, {"id": 1347, "start": 11229.88, "end": 11235.6, "text": "werden. Oh, kann auch so nicht gerest werden. Okay. Kein Q-Squad, nö, keiner da sonst."}, {"id": 1348, "start": 11235.6, "end": 11243.12, "text": "Ich glaube, das wird nix. Leute, das wird nix. Wir haben nur noch 18 Tickets. Es wäre"}, {"id": 1349, "start": 11243.12, "end": 11255.4, "text": "übrigens sinnvoller, die Tickets ein bisschen hochzumachen. Die Katze möchte bei mir ins"}, {"id": 1350, "start": 11255.4, "end": 11277.84, "text": "Zimmer. Alter, Chico. Jetzt ist Chico drinnen. Reingestürmt. Richtig reingestellst ist"}, {"id": 1351, "start": 11277.84, "end": 11288.36, "text": "es. Oh, wir müssen hier lang. Leute, ich habe das Headset nicht richtig auf, ich weiß."}, {"id": 1352, "start": 11288.36, "end": 11304.76, "text": "So, jetzt habe ich es richtig auf. Oh, jetzt die Legehennen machen. Legehennen. Legehennen."}, {"id": 1353, "start": 11304.76, "end": 11327.72, "text": "Legehennen und abcampen. Legehennen und abcampen. Ich hoffe, es kommt keiner von der Seite. Boah."}, {"id": 1354, "start": 11327.72, "end": 11348.36, "text": "Nein. Sie diffusen. Sie diffusen. Rip. Diffuse Champ. Diffuse Champ. Oh, was machen wir denn"}, {"id": 1355, "start": 11348.36, "end": 11372.32, "text": "hier? Was machen wir denn hier? Ganz, ganz dumme Idee, Max. Keine Chance. Chico, was"}, {"id": 1356, "start": 11372.32, "end": 11380.32, "text": "ist denn? Was ist los, Chico? Welche Maps würdest du noch wünschen? Terran Highway fände ich"}, {"id": 1357, "start": 11380.32, "end": 11383.8, "text": "geil. Das ist übelste Underrated-Map. Und natürlich sind das die Klassiker von Metro"}, {"id": 1358, "start": 11383.8, "end": 11386.84, "text": "bis Grand Bazaar, meinetwegen können die auch locker rein machen. Die können einfach"}, {"id": 1359, "start": 11386.84, "end": 11392.56, "text": "alle. Die sollen einfach alle Rush-Maps, Side-Bad-Copy, die eins reinschmeißen, 16 vs. 16. Easy."}, {"id": 1360, "start": 11392.56, "end": 11397.4, "text": "Die sollen einfach die Spawns da lassen, wo sie sind und die M-Comp-Platzierungen da"}, {"id": 1361, "start": 11397.4, "end": 11400.56, "text": "lassen, wo sie sind. Fertig. Die müssen eigentlich gar nichts machen und schon wäre das viel"}, {"id": 1362, "start": 11400.56, "end": 11411.32, "text": "besser. Okay, Leute. Wenn die Katze schon am Start ist und rumnervt, das heißt schon"}, {"id": 1363, "start": 11411.32, "end": 11418.28, "text": "spät. Schon spät. Und schon spät bedeutet, ich gehe jetzt gleich pennen. Mal gucken,"}, {"id": 1364, "start": 11418.28, "end": 11423.24, "text": "ob ich den hosten kann. Nope, keiner da. Schön, dass ihr alle dabei gewesen seid. Wenn ihr"}, {"id": 1365, "start": 11423.24, "end": 11425.64, "text": "noch einen Prime-Sub übrig habt, würde ich mich freuen. Ansonsten könnt ihr euch auch"}, {"id": 1366, "start": 11425.64, "end": 11433.32, "text": "mal auf YouTube und auf Twitter vorbeigucken. Und morgen früh, 9.30 Uhr, so in dem Dreh,"}, {"id": 1367, "start": 11433.32, "end": 11456.16, "text": "wieder auf Wachstream. Wir sehen uns bis dann, machts gut. See you."}]}