{"text": "vonIch brauche ein paar Leute, die mitspielen, weil ansonsten wären wir wieder von irgendwelchenkomischen Wallhackern und sonst was direkt geohnt.Ähm, ja gut, wenn du es nicht installiert hast, wird es schwierig.Stripes, moin, willst du mitspielen?Also ein paar Leute brauche ich noch hier.Passion, Alter, Passion.Also wer mitspielen will, am besten schon einen, den ich geeditert habe, wäre ganzpraktisch.Ein bisschen Boomer Games spielen hier.Jo, na dann, dann suche ich mal einen Server raus, nee, Moment, wie funktioniert das jetztnochmal?Battlefield 3, Leute adden.Achso, ja dann warte ich mal bis du online bist, irgendwo hier kann man Leute adden dann,ne?Ja.Wie auch immer das genau funktioniert hat, das weiß ich nicht, das kriegen wir abergleich raus.Das kriegen wir gleich raus.Excellent, aber du hast jetzt den goldenen Keks hier, zum ersten Mal, huge, massive Keks.Du hast mich nicht auf Origin, du musst mich doch auf Origin haben, hä?Wenn nicht, schick mir einfach eine Anfrage und ich adde dich, hab die echt nicht aufOrigin?Hätte ich gar nicht gedacht.Hätte ich keinen Mr.Army hier?Nee.Sieht nicht so aus.Wahnsinn.Kannst dir ja eine Anfrage schicken, dann adde ich dich, ganz unten in den Requests.Ah, da ist er, exellent, exellent.Willst du mal auf eine richtig kaputte Webseite gehen?Nee, das ist bestimmt irgendwelche Torzgeschichten, da will ich nicht drauf, da will ich nichtdrauf.Ach komm mal, er ist auch am Start.Ja, kann man auch adden, klar.Wie macht man denn hier noch mal ein Squad?Wie hat denn das noch mal funktioniert?Ich check's, ich check's, ne, warte mal, wie ging das hier noch mal?Add, oft, nee.Create Chat.Jaja.Chat, wie hat denn das noch mal funktioniert?Wie hat man hier noch mal Squads gemacht?Hier drüber irgendwie?Create Chat?Nein, ich bin nicht im Discord, ich hab Streamer, lul.Kann man sich irgendwie...Leg grad, wie das funktioniert.Wo haben wir Mr.Jacks nicht, wie hat man hier noch mal, wie hat man hier noch mal, doch online.Ich hab keine Ahnung mehr, wie das funktioniert, wie man hier Squads macht.Musste man überhaupt nen Chat createn?Nee, oder?Ich glaub, man musste da gar keinen Chat createn.Aber ich bin Battlelog jetzt echt hier irgendwie drüber?Also ihr seht, es ist ein Monat her, dass ich gespielt hab, ne?Create a match?Was?Nein, nein, nein, nein, lul.Das war Create Chat, ne?Select.Wo ist denn dann Mr.Ami?Seh ich den nicht?Warum ist der hier nicht drinnen?Die Hälfte, die hat doch die Hälfte wieder nicht geladen.Ne, Platoon sind Clans quasi, sowas wie, ne.Ich bin da zu dumm für F5en.Ich hab keine Ahnung mehr, wie der Campel funktioniert.Aber ich stell mich einfach mal auf Abwesen oder so, dann sieht man, was Sache ist undman kann nachjoinen.Kein Schimmer mehr, wie das funktioniert.Stripes, hab ich dich im Origin drinnen?Stripes, da isser.Stripes, da isser, guck hier.Und wenn man hier Leute edit, dann joint man zusammen, oder wie ist das?Ich hab keine Ahnung mehr, wirklich nicht mehr, das ist komplett random.Kein Schimmer.Ich weiß nicht mal, wie das funktioniert.Leute, wir haben das doch auch schon mal geschafft.Wir haben auch schon mal hier Battlefield zusammen gespielt, weiß gar nicht mal, wiewir das gemacht haben.Keine Ahnung.So, äh, gut, gehen wir hier drauf, was anderes gibt's ja, äh, Kark Island, Conquest Lodge,gibt's da nicht irgendwas ordentliches?Rushed Classics, ok, Rushed Classics klingt doch schon mal ganz brauchbar.Q Nummer 3, perfekt.Leute, ihr könnt einfach über Origin gleich nachjoinen bei mir.Mr.Kark Island und Stripes, joint einfach nach, oder sagt mir mal, ob's funktioniert.Wenn nicht, mach ich hier nochmal nen Chat auf.Ich bin mir nicht mehr sicher, wie der Kram funktioniert hat.Ach guck mal, der joint ja auch schon, pock.So, wie gesagt Leute, ich hab nen Monat oder so nicht mal gespielt, bin wahrscheinlichrichtig schlecht.Sacke.Zumindest ein Vorteil hat, dass das Game läuft, das Game läuft halt erst mal ordentlich mit,äh, nee, wie war das, Perf, nee, Draw, oh, wie war das in, nee, das war nicht Perf Overlay,äh, BF3, Draw FPS, Sac, wie war das in BF3 nochmal?Render, Draw FPS, Render.Render, Draw, FPS, 1, bam, jawoll, Bastion, Alter, Bastion, wie jetzt, oh, bisschen lauter,wobei, ich glaube, Lautstärke ist durchaus in Ordnung, oder?Lautstärke geht sogar halbwegs, klar.So Leute, guck mal, ob du das mit dem nachjoinen findest.Boah, ich bin, Alter, ich bin es ja überhaupt nicht mehr gewöhnt hier, an was sterben diedenn bitteschön hier?Gar nicht, Rättsstellts, ja, Captain Pongas, join mal rein, lass mal gucken, ob's, oh,okay, ich hab absolut keinen Plan mehr, oh, nice hier, huge Rats, fuck, alles klar, gehtja gut los.Ich glaub, die überrennen uns ganz schön, guck mal, der erst 23.6, jetzt schon, ichmein, ich weiß nicht, vielleicht spielt der ja Heli und geht voll ab oder Amtrak odersonst was, das ist ja immer noch möglich.Alter, oh Gott, wie ist denn meine Maus hier eingestellt?Alter, MonkaS, Captain Pongas ist am Start, aber nicht bei mir, sondern dem anderen Team,okay, ich glaube, man konnte hier gar nicht mit Squad zu richtig joinen, sag mal, leckdas wie Sau, kann das sein?Wo ist denn hier mein, ne, äh, Captain Pongas, du bist bei den Attackern, vielleicht kannstdu switchen, ansonsten versuch ich mal zu switchen, man muss einfach auf die gleicheSeite, Leute, man braucht ja gar keinen Squad aufmachen hier auch, ich kann auch den Chatund so wieder ausmachen, das braucht man ja gar nicht, Mister Ami ist am Start, nice,das braucht man doch gar nicht, man muss einfach auf die gleiche Seite und dann kann man sagen,man geht in D oder so, oh, es ist ungewohnt, es ist ungewohnt, dass man nicht mehr slidenkann, kein Slider, war hier nicht ein M-Com? War hier nicht normalerweise ein M-Com? Ahne, hier ist das gewesen, lull, Alter, als hätt ich das Game noch nie gespielt, man,okay, kein Plan, Leute, das dauert jetzt kurz, bis ich da wieder reingekommen bin, und manmuss ja auch wieder Q drücken, das hab ich auch ganz vergessen, man muss ja Q drückenfür Spot Action, okay, wir lernen Battlefield 3 neu, easy, konnte man da hinten rein, okay,hier ist es, ah, meine Maus-Handsettings, lull, das muss ich irgendwie umstellen, Klei,mal gucken, mal gucken, ob ich überhaupt Gegner treffe, okay, krasser, ah, Rüstungstelz,nein, nein, nein, das war das Battlefield 3 Movement, das hat so seine Tücken, yup,nice, also, wir sind Leute, wer bei uns in Squads will, wir sind Squad India, ich kannIch kann auch einfach ein Neues gleich aufmachen, wobei Mr. Army ist nicht mehr da.Ist er...Geh mal, da geh ich mal zu Fate rein, jetzt bin ich in Juliott.Boah, die Oberrennern uns hier heftig.Ich dachte, ich kann jetzt erst mal ein bisschen Noob-mäßig hier wieder einsteigen.Aber das geht ja, kannst du ja komplett vergessen.Punkbuster-Kick-Player? Seriously?Warum das denn?Ah, das musst du starten. Kann es sein, dass du das nicht gestartet hast im Service?Man muss das ja im Service starten, dass das funktioniert.Leute, hier ist...Hier ist ja 64-Mann schon clusterfuck.Wie hat man sich da gedacht, bei Battlefield 2042 ist es eine gute Idee...Alter, es ist eine gute Idee, 128 Spieler zu nehmen.Aber gut, ich werde gerätzt, ich bin ja...Ich bin ja schon zufrieden.Wir aimen das hier mal kurz ab.Da stellt es gerne...Sieht irgendjemand überhaupt die Gegner?Äh, läuft das Stream flüssig?Okay, alles klar.Ach nee, Moment, man muss ja die ganze Zeit springen, dass man nicht mehr aufhört.Ach nee, Moment, man muss ja die ganze Zeit springen, dass man schneller läuft.Ich erinnere mich, Leute, ich erinnere mich.Huge, I remember, I remember.Punkbuster A und B laufen, ja dann ist es komisch.Nee, nee, nee, nee, ich wusste, dass da einer steht.Okay, ich habe keine Ahnung wo, aber...Oh, da vorne irgendwo.Rein, rein stellst du, rechts, rechts ist er.Irgendwo, irgendwo hier.Wo zum Geier kamen die denn jetzt her?Sind die, sind die parachuted hinter mir oder so?Boah, wir müssen irgendwas anderes spielen als 64 Spieler.Das überfordert mich jetzt.Boomer hier, erstmal.Wenn ich das so lange nicht gespielt habe, ich brauchte immer ein bisschen, bis ich wieder reinkomme.Okay.Attack.Okay.Okay.Attack.Oh oh, oh oh.Nice, next.Wo ist das Auto?Weiß ich was.Aber der Stream lag nicht, oder?Der Stream, also Battlefield 3 braucht ja nichts an Leistung.Der sollte ohne Probleme laufen hier.Stream läuft gut, ok.Nice, GG Eats.Hier sind sie doch, hier.Was? Alter, Battlefield Hit-Rag.Battlefield Hit-Rag.Keg Wayne.Habt ihr das gesehen?Alter, Battlefield Hit-Rag. Lul, das ist ja schon der Wahnsinn.Es ruckelt durch Explosionen, da kannst du nichts gegen machen.Ich hab den Eindruck, ich muss ein bisschen hochstellen.Ziemlich hinterher bin mit der Maus.Aber gut, komm.Wisst ihr was, Leute, ich hab so lange nicht gespielt.Wir müssen, ich hab jetzt eine Ausrede für M16.Siehste, wie schön das in Battlefield 3 war. Einfach ne Runde Defi-Spammen und schon easy.War das der Gegner?Einfach Defi-Spammen und schon stehen sie wieder alle.Keine Ahnung.Aber es geht.Es geht, es geht, es geht.Es geht, es geht.Es geht, es geht.Es geht, es geht.Es geht, es geht.Es geht, es geht.Einfach Defi-Spammen und schon stehen sie wieder alle.Keine zwei Stunden hoffen, dass sich Gegner nicht basht, während du wiederbelebst.Okay, gib ihm, Leute, gib ihm.Oh, ich hab rechts einen gesehen.Bin mir nicht so sicher genau, was ich gehitted hab.Alter, ich treff nix. Irgendwas stimmt meins. Oder ich bin Battlefield 2042 gewöhnt.Lul, das kann natürlich auch sein.Wahrscheinlich bin ich Battlefield 2042 gewöhnt.Das ist vorbei. Da hat man sich dran gewöhnt, dass man nix trifft und dass man ein bisschen was trifft bei nix treffen und jetzt ist es vorbei.Äh, hallo? Wo ist der?Wo?Cool.Die schießen mich vom Dach an, oder?Schießen die mich vom Dach an?Schießen die mich vom Dach an?Bam, ba, ba, bam. Helibash.Au. Keine gute, keine gute Sache.In the Kopf. Nein, nein, nein. Kopf raus.Kopf raus. Kopf raus. Jawoll. Sehr gut.Oh. Ist das modded oder normale Version? Das ist die ganz normale Version.Das ist die ganz normale Version, die man, die jeder spielen kann gerade.Was hier? Was ist mit dem da los?Was ist mit dem da los? Was ist mit dem da los?Auf, auf.Schön defien.Über Bande.Boah. Game. Hör auf zu ruckeln.Das Game ist so krass am ruckeln. Du kannst ja nicht immer zielen.Hier auf irgendwas. Lebt der noch auf dem Dach? Oder nicht? Oder?Die Konfig Option zum Abschalten des Geruckels.Moment, da unten ist was.Wo, wo, wo?Erst mal hinlegen.Y ist es. Ich denke mir schon irgendwie, ich drücke zwar Y automatisch.Aber mir war gar nicht klar, weil ich für ein Getaste gerade drücke.Okay, nächste Runde jetzt mal gucken, ob das jetzt ein bisschen kontrolliertervonstatten geht.Tja, ich hatte die Auswahl heute.Ähm, guck ich mir den neuen Patch Battlefield 2042 an.Leute, es gibt ein Scoreboard. Ja, stellt euch mal vor. Guckt mal, guckt mal.Seht ihr das?Ein Scoreboard.Das ist unglaublich.Hexen wird es.Das ist unglaublich. Hexenwerk, dass es sowas überhaupt gibt.Ich meine, es gibt schon keinen Chat am Ende der Runde.Das haben sie ja schon, haben sie ja schon weggelassen, weil Ende der Runde immer,immer krass geflamet wird.Nose, Hair, Candles, jetzt Attacker.Auf, pass auf Leute, jetzt geht es, jetzt geht es drüber. Jetzt wird drüber geschlittert.Chat, konntest du einstellen? Nee.Chat, konntest du nicht einstellen Ende der Runde? Oder ist das was Neues, was mir noch nichts sagt?Ende der Runde, Chat? Ich meine, du kannst hier Chat machen so.Peck, Wait, konntest du machen.Aber Ende der Runde, Chat? Wie hat man das, und wie soll das gehen?Du musst den Punkbuster-Service neu starten.Du musst den Punkbuster-Service neu starten, also starten in den Services von Windows,dann funktioniert das.So, hau, ah, Granate, damn, das war klar, komm ich hol dich, Kollege, müssen wir malgucken.Boah, nein, ja was, huge suppression, Poggers, Poggers suppression, so, tja, M16 würde ichdazu sagen, M16, M16.Alles klar, M16, was mit H ging das noch, während das Spiel läuft, kann ich mich jetztnicht dran erinnern.I don't know, so, bashen, wo sind's, ah, stuck, bitte random step bro, I'm stuck,Joke einsetzen, oh, ich dachte das geht, wenn ich einfach nur drauf spray aus der Hüfte.Nur plus, während am Ende nicht mehr, ok, ein Prozent, wollen die mich veräbbeln.Wünsche für das nächste Battlefield, hey, was heißt das nächste Battlefield, das nächsteBattlefield kam vor zwei Monaten raus und es hat leider gesagt, ich muss michan das Q drücken gewöhnen. Ich drück kaum Q Leute. Geht das noch jemand so?Ganz schlechte Idee. Geht das noch jemand so, der vorher 2042 gespielt hat,dass man sich abgewöhnt hat Q zu drücken. So krass, ich bin es null gewöhnt Q zu drücken.Geh basten, jetzt hier basten. Jetzt gehts rein. Da ist der nächste. Weggesprayt. Aber guck malhier, beste Squad Leute, beste Squad, easy win. Danke schön für den Sub. Was spielen wir denn?Sand Crossing. Sand Crossing ist Pog. Die Legehänne ist am Start Leute. Doppel, Dual,Multithreaded Legehänne. Okay, nice. Multithreaded Legehänne war am Start.Jetzt müssen wir mal gucken. Jetzt kommen wir da rüber. Bashen, alter, bashen. Okay, nice. Wirhaben einen Smokeman am Start. Beste, easy win. Oh oh. Legehänne. Pog. Hast du noch Kontakt zumKaboom? Selten, selten. Aber Granatenspam. Genau, einfach Granatenspam drauf. Easy win. Oh nee,die haben diffused. Haben die? Anzeige ist raus. Warum diffusen die einfach? By the way,diese MGs an den Booten und den Panzern, diese stationären Dinger, die waren so schlecht,krass. Krass hier. Wo? Da. In der Treppe war der drinne gestucked. Wir könnten nochmehr Suppression vertragen. War Anti-Suppression nicht verbackt? War das nicht irgendwie verbacktAnti-Suppression? War da nicht was? Ich erinnere mich irgendwie, ich dachte Anti-Suppression istirgendwie verbackt. So seit 10 Jahren. Fuck. Okay, jetzt nochmal durchzukommen ist schwierig.Auf, streck deinen Kopf raus. In the ass. I get fucked up in the ass over here. Ichcampere mal kurz hier eine Runde. Mir bleibt gerade nichts anderes übrig. Von hinten kommtwas Leute. Von hinten kommt was. Die wollen mich bashen, Alter. Ich sehe es schon kaumhier. Da sind doch noch mehr hier. Jetzt flankt einer rum. Ja klar. Nice, nice, nice. An derSeite, hä? Okay, jetzt kommen wir ein Stückchen vor. Gucken wir mal. Gucken wir mal. Ja, please,Battlefield. Hallo, ich möchte einfach nur drüberspringen. Wenn es im Bereich des Möglichenist. Ich habe Schiss, Leute. Ich verpiss mich. Oh, oh, oh.Wo ist er? Keiner da. Auf jetzt, lege Hände hier. Lege Hände in Action. Ach, wir habenes schon. Hä? Leute, what the? Wann haben wir das gelegt? Wait, Kek. Kek, wait. Ichdachte, ich dachte, ich muss hier noch krasse Stells Action machen. Wann haben wir das geholt?Habt ihr das mitgekriegt? Wann haben wir denn, wann haben wir das M-Kong erwischt? Okay,ich will mich ja nicht beschweren. Achtung, Achtung, Achtung, Achtung. Hier ist noch irgendwowas drüben. Muss ich mal kurz ein Stückchen verpissen. Da wird reingedroppt. Okay, A solltenwir eigentlich mit dem M-Track kriegen. Eins merkt man, Leute, die, äh, wie soll man sosagen? Die Abtastrate auf dem Server ist halt wirklich krottig. Das Witzige ist, die istja potenziell in Battlefield 2042 besser, aber in Battlefield 2042 registrieren dieSchüsse halt einfach nicht. Oh, oh, Monkeys. Boah, Alter, wie viele Granaten, Mann. Mr.Army auch und wieder alles hier. Nice, TRX. Leute. Oh, oh, oh. Guck mal, hier sind so vieleLeichen. Wir müssen jetzt ein bisschen weiter hinter. Ich glaube, boah, wenn wir hier, wennwir hier, auf der, auf der Seite kommen wir nicht durch. Hier, nice, nice, nice, nice,nice. Lege Hände, lege Hände, lege Hände. Ich setze mich jetzt da rein. Das hast dujetzt, oh nee, fuck. Ich wollte gerade switchen auf die Magnum. Leute, rein da. Jetzt wirdgesprägt. So eine Action hast du in Battlefield 2042 nicht. Welchen Server? Ach, keine Ahnung,der erste, beste, den du angezeigt kriegst bei Rush. Sag mal, da krabbelt noch einerda oben. Krasser Krabbelhaus. Boister Krabbelhaus. Nice Krabbelhaus, guckt euch mal. Guck mal,seht ihr das? Seht ihr das? Wie geil die Leute hier aufs Rassen und Punktefarmen sind. Konnteman eins? Nein, konnte man nicht. Ja, 64 Spieler Rush, das ist, das ist schon, ist schon knappam Clusterfuck. Au, au, nein, nein, nein. Wo, wo? Streck deinen Kopf raus. Ach da, jetzthätte ich mal ein bisschen Burst schießen sollen. Aber das Gute ist, M16, wozu brauchstdu Burst? Blank Action hier, flankerino, massive flank. Irgendwo hier unten war doch geradeeiner, oder? Oder wurde das auf der Map? Alter, die krassen Sneaky Leute, guckt sie euchan. Einfach da in der Ecke hat er gelegen, einfach in der Ecke. Engstellt, hoch 10.Auf, auf, beeil dich, beeil dich, mann, beeil dich. Ey, das ist ja Battlefield 2042 Hit-Rack.Habt ihr das gesehen? Alter, Battlefield, das war richtig krass, Battlefield 2042 Hit-Rack.Wird Bad Company 2 noch gespielt? Ja, aber deutlich weniger. Ja, leider hat Venice denHype nicht geschafft, ja. Das lag, da waren die aber mit, mit selbst dran schuld. Diehätten zum Beispiel Surfer anbieten müssen von ihnen. Anders funktioniert das nicht,mit, mit gutem Rules. Alter, von, von wo? Ach, von der Straße aus. Aber Battlefield3 Kreise laufen geht eigentlich immer. Oh, nice, huge risk. Alter. Okay, nice. Jetztkommt von da noch einer. Der hat sich jetzt auch gedacht, ich weiß nicht genau, was mirpassiert. Einfach gespornet und den Arsch mit der Magne umgeshootet bekommen. Oh, dasfetzt hier richtig rein wieder. Au, au, au, au. Bin mir nicht ganz sicher, von wo? Shit,shit, shit, shit, shit. Von wo, von wo, von wo? Ach, von der Anti-Air. Shit, die habich ja gar nicht gedacht. Okay, auf gehts. So, verstecken, erst, erst mal, erst mal ver...Verstecken im Busch. Verstecken im Busch, das geht eigentlich immer. Busch, Busch stellt,das ist da unten. Null. Ja, ja, ist da gut, reg nicht mal ab. So, next, next. Oh, daswird, das wird jetzt was hier durchzukommen. Oh, von rechts, von rechts, von rechts. Ichrenn einfach mal rum und retze ein bisschen. Alter, die sind hinter uns. Oh, shit. Ichseh gar nix. Wo ist denn hier was? Leute, ich hab legit keine Ahnung, wo hier irgendwasgeht gerade. Okay. Nein? Ah, da. Ach, da. Obvious, obvious. Das reviven war so OP. Naja,aber das hat dazu geführt, ja, das war schon OP, aber das hat dazu geführt, dass die Leutedas wenigstens machen. Nieseln wie in Battlefield 2041. Wir wollen Zen Crossing spielen. So,Yolo, Yolo Res. Alter, rein da, rein da, Leute, es muss klatschen. Bam, bababam. Granatenspamaufs M kommen. Macht sie platt. Oh, nice, huge res. Ah, mehr res, res drain am Start.Fuck man, Alter. Das war nicht normal. Guckt euch, ach du Scheiße. Boah, und von der Seiteweggerotzt. Richtig Gatchi-Buzz. Das ist richtig Gatchi-Buzz hier gerade. Okay, ich rede wiederwie ihres Zeug, aber Alter, ich krieg hier mal. Übrigens, das reviven, dass das nichtals Tod zählt, finde ich auch sehr, sehr nice. Das ist auch wieder ein Anreiz, ja.Ich mein, das ist doch das Optimale aus beiden Welten. Okay, ich hab keine Ahnung, wo derPizzen ist. Die Leute behalten ihre Kills und die Leute verlieren ihre Deaths. Das istim Prinzip alle glücklich gemacht. Ich laufe übrigens die ganze Zeit im Kreis, weil ichnicht weiß, wo ich hin soll. Gatchirole. Ich Gatchirole. Alter. Aber fuck, ich habkeine Ahnung. Aber fünf. Ich will Sandcrossing spielen. Oder wie wir früher gesagt haben,ahnungslos seine Crossing. Seine Crossing. Leute, was? Seid ihr Sandcrossing-Spieler oderseine Crossing-Enjoyer? Sandcrossing. Sandcrossing, ja. Die Aussprache gab es auch noch. Sandcrossing.Ich muss mehr Q drücken, Leute. Ich drücke überhaupt keinen Q. Guck mal hier. Hätteich mehr Q gedrückt, hätt ich gleich gewusst, dass ich hier durch den Smoke Leute sprayenkann. Einfach durch den Smoke sprayen. Oh, da hinten ist was los. Da hinten ist Gatchirolein der Ecke. Ich hab's genau gesehen. Ich Gatchirole. Seht ihr den? Jetzt so Websteraufs Dach. Okay, nice, nice, nice, nice, nice, nice, nice. Aber da sieht man, dassdiese Specialist-Powers zwar vielleicht nicht ganz cool spaßig für den einzelnen Spielen,aber halt für die Struktur der Map und so, dass normale Battlefield-Gampler halt garnicht mal so sinnig sind, ne? Alter, hier wird wiederbelebt. Hier wird wiederbelebtauf Doom. Was? Wo ist der Typ? Oh, da ist noch mehr. Da hinten ist er. Da hinten istnoch einer. Guck mal hier. Der Gatchi bastet uns von hinten. Das fand ich auch cool. DiesesSpringen und Rassen dabei. Bam, bap, bap, bam. So muss das sein. Oh, die sind eh immernoch da. Ich wollte ein Messer. Kick, Wade. Hätte ja funktionieren können. Es hätteja klappen können. NA-Aim. Ja gut, das kann man jetzt von mir nicht anders erwarten als37-jähriger Boomer. 37-jähriger Boomer, dafür geht es noch durchaus in Ordnung. Ja, daswaren halt typische Battlefield-Rasses. Mal geht's, mal geht's nicht. Die letzte Baseist schwer. Pass mal auf, wir machen jetzt den Big Brain Play schlechthin. Ich zeigeeuch mal den Massive. High IQ, only 150 IQ plus Play für die letzte Base. Pass mal auf,werdet ihr gleich sehen. 6 head, 11, 25 head. Wo? Okay, only 5 heads, only 5 head plays.Es geht aber nicht, weil die Leute im Stream gucken. Nein, wir wollen Sandcrossing spielen.Wir sind Sandcrossing-Enjoyer. Oh ne, der hat mein 5-Head-Plan zunichte gemacht, weiler mit dem Schiff langgefahren ist. Der Bender-Bubber. Der eigentliche 11-Head-Play ist hier langschwimmenund dann hinten rausstelzen am Wasser. Das geht natürlich nicht, wenn die Leute dortmit dem Boot am Start sind. Okay, jetzt 6 head, 6 head. Only 6 head plays. Oh, da ist einTyp. Oh ne, das ist eine ganz schlechte Idee. Die Seite ist schon komplett voll. Jawoll,jetzt sind sie abgelenkt. Nein, nein. Was bist du noch im Boot? Was bist du noch imBoot? So sollst du gefälligstes M-Com diffusen. Anzeige ist raus. Nein, Battlefield, so istdas nicht, wie der Fallschirm funktioniert. Ich glaube, das war Server-Lag, der uns gekillthat. Kann es sein, dass ich auf diesem komischen Mast gelandet bin? Alter, 50 Milliarden Gegner.Muss er vielleicht 5 schreiben, anstatt Slash 5 zu machen? Ich glaube, das jebaitet unseinfach nur zum sinnlos Reintroppen hier oben. Das hat, glaube ich, gar keinen sinnigenMehrwert hier. Wir sollten, glaube ich, lieber hinten spawnen. Ey du. Danke für die Subs,ich kann gerade nicht gucken. Ich sehe nichts. Sixhead, Sixhead-Time, Leute, Sixhead-Time.Wehe, du bist wieder in diesem komischen Schlauchboot drinne. Sixhead-Time. Die stehen da mit demAuto, ich fasse es nicht. Oh nee. Oh, in der S geschudelt, Mann. Krass, in der S geschudelt.Okay, hier kannst du nichts machen. Okay, hier ist mit, oh mein Gott, hier ist mit vielzu viel los. Aber das war erfolgreich. Nicht so sehr erfolgreich für das Mkomm. Ja, esgibt noch, wenn es unleashed, aber die haben es leider ein wenig verkackt. Du entschärfstes. Jawoll, komm, Mkomm. Praege, Praege, Praege. Jawoll, wir haben es, nice. Erfolgreich gepraegt.Wegfahren, Alter. Okay, unser Amtrak ist down. Nein, unser Amtrak ist nicht down. MassiveAmtrak-Rap. Nee, das ist der Jeep. Alter, Boomer hier macht es nicht mehr mit, Leute,es ist vorbei. Nee, jetzt, Venice hat keine Spieler mehr. Ja, ich gehe in unseren Amtrak,damit ich den retten kann. Boah, hier ist ja so Action, Alter, das ist ja nicht normal.The charge has been set, sehr gut. Gehen wir mal ran, wenn der Charge gesettet ist. Lassmich rein. Aber wir könnten es durchaus kriegen, also wir drücken da gerade richtig, richtigheftig rein. Gachi-Buzz. Alter, ich sehe nichts.Ich habe keine Ahnung, wo hier was abgeht. Ja, wenn die Server abgeschaltet werden, dafürist Venice natürlich richtig nice. Wenn Server abgeschaltet wird, dann kann man mit Venicehalt noch weiterspielen. Das hat das Game auch wirklich verdient, also damit ist dasGame ja quasi unsterblich, wenn man es so will. Oh, das sind ganz schön viele Leute.Oh, auch von hinten. Oh, oh, oh nee. Ich wusste nicht, ob ich auf 3 oder 4 mein RPG habe.Wo habe ich mein RPG? 3 oder 4? Ich spiele es zu wenig. Ich spiele auch viel zu selten,Engineer. Oh nee, jetzt ist er down. Jetzt ist der M-Track hinüber. Da machst du nichtsmehr. Es ist aber halt ziemlich kacke, hier rein zu kommen. Boah, vergiss es. Du kannstdich in 64 Mann reintropfen. Nö, keine Chance. Das geht nicht, wir müssen das irgendwienormal aufbauen. Das wird nicht, das baitet höchstens die Leute rein. Einmal weggeguckt,direkt deadge. 64 Spieler Rush ist einfach zu viel. Ja, dann denkt man sich so, was habendie sich bei DICE gedacht mit 128 Mann Breakthrough? Sollte ich euch sagen, was die sich dabeigedacht haben? Nix. Nix haben die sich dabei gedacht. Gachibas haben die sich dabei gedacht.Da kommt jetzt gleich noch mehr hier, Leute. Das hast du dir so gedacht. Ach, der Dudelebt noch. Nein, ich hab die Taste gar nicht gedrückt. Leute, wir haben's nicht. Wir habenes verloren. Alles draufschmeißen, Leute, alles draufschmeißen. Yes. Yes. Wir haben's,wir haben's, oder? Haben wir's? Bam! In your face, nice. Alter Corona schlägt zu. DerServer war überfordert. Warum war der Server überfordert? Es lief doch halbwegs flüssig.Ach so, das meinst du Hittrack. Ja, das hatte ich zwischendurch auch. Die Musik im Hintergrund.Was kommt denn als nächstes für eine Map? Ich hoffe Zen Crossing. Seine, seine Überquerung.Dema wird Peacrush, auch gut. Sehr gut. Exquisite. Zen Crossing, Leute. Excellent, excellent.Warum kann ich eigentlich keine Vollbild-Memes einblenden? Sag bloß ich spiele nicht im Fullscreen.Alter, wer spielt denn bitteschön Fullscreen? Fullscreen? Nee, Moment. Konnte das Spielüberhaupt borderless Fullscreen? Wait a minute, konnte das borderless Fullscreen? Okay, ichspiele jetzt erstmal ne Runde. Team Switch please, Server erlaubt's nicht. Dann versuchneu zu joinen, dann vielleicht. Wir sind eh total verteilt. So. Chat ist voll am Durchdrehen.Konnte das kein borderless Fullscreen? Nee, jetzt ist Fullscreen off. Geht aber immernoch nicht. Das lügt einfach nur. Fullscreen ist nicht off. Lügengame.Nice spawn protection. Was, irgendjemand soll gebannt werden? Warum ist Hackerman am Start?Oh nee, was ist hier los? Anzeige ist raus. Jaja, schön diffusen. Diffuse-Champ. Diffuse-Champ.Was ist hier los? Warum aimt da mehr als einer auf die gleiche Person? Direkt blocken. Allesbannt. Nein. Alter. Ich muss... Oost-Champ. Ai ai ai.Richtig heftiger Hoost-Champ. Von wo? Von wo? Okay, ich hab keine Ahnung was mich hiervon wo hittet gerade. Um ehrlich zu sein. Aber irgendwas hittet mich von irgendwo. Ahda oben ist ein Auto. Moment mal ein BBBBBB. Von oben? Nee.Okay, hier ist aber gerade ziemlicher Druck drauf. Leute, ich spotte immer noch nicht.Ich hab's mir mit 2042 abgewöhnt zu spotten. Und dabei ist das hier das OPste was man machenkann ordentlich spotten. Nein, nein, nein. Nee, nee, nee, nee, nee, nee. So, erst malkurz ausruhen. Just, ja, just cool. Der kommt doch jetzt hier rum gleich der Kerl.Okay, das Problem an der ersten Base Demavent Peak ist, die artet halt auch relativ schnellin Spawn-Rape aus, wenn man mal die Gegner ordentlich zurückgepusht hat. Hallo, Game.Nice. Hätte das mal schneller funktioniert. Du hast damals angefangen mit Battlefield3, Atlon 2, GeForce GT 520, 30 FPS, Enjoyer. Hört sich zumindest so an. Auf der Xbox liefdas ja noch nicht mal mit, also auf der Xbox lief das weder mit 720p noch mit konstanten30 FPS. Ich hab keine Ahnung, ehrlich gesagt, wie ich den Krempel damals überhaupt spielenkonnte, realistisch betrachtet, aber tja, aus irgendwelchen Gründen, aus irgendwelchenGründen fand ich das Game trotzdem geil, obwohl ich quasi keine FPS hatte und keineordentliche Auflösung und nix. Das Gute ist, dass man nicht so einfach zu hitten ist, wennman die ganze Zeit über so Zeug drüberspringt. Ja, 64 Spawn Rush ist zu viel. Ich guck danach auch mal nach einem anderen Surfer, aber ein paar Runden spielen wir noch mal, wirhaben ja Zeit. Wo ist er? Wo ist er? Alter, geh fort. Oh ne, so wenn ich hier zu langrausgucke ist direkt, wirste, wenn ich hier einmal zu lang Peaks bitte. Alter, wie kommstdu her? Wo, wo, da ist er einfach bei uns in der Base. Backrage. Gatschi-Buzz. Ok, daswar eine dumme Idee hier rauszustellen. Das ist wieder so eine dumme Demavent Peak Runde,das artet schon in halbem Spawn Rape aus der Attacker, aber noch geht's, noch ist es halbwegsim Rahmen. Also die kommen ja immer noch rangepusht und alles. Ach, da oben sind sie. Warte, wirhaben die erst jetzt geschafft. Glaubste, ich glaub's ja nicht. So, ich bleib hier.Wenn wir jetzt alle rüberrennen zu B, man denkt ja immer nur man ist der einzige, deres selbst reißen kann, ne, aber wenn man alle rüberrennt, dann sind sie halt easy durchgepusht.Weißt du, dabei geht's auch ohne Probleme so. Konnte man hier nicht irgendwie sogarraus? Ich glaube, ich glaube, das testen wir jetzt mal, ich glaube, das ging. Spawn BashEnjoyer. Aber so sollte man das eigentlich nicht machen, weil dann ist ganz schnell Ragequitangesagt bei den Attackern. Fuck, es ist abgelaufen.Ja, das ist das Dumme an der ersten Base von Demavent Peak. Das ist richtig blöde.Oh, jetzt pushen sie. Jetzt pushen sie aber gut hier. Gatschi push. Was war das? Schneibermanhat mir den Fuß geschneibt. Okay, ich glaube, wir haben es abgewehrt. Pass auf, wenn dasjetzt hittet, dann muss ich aber kecken. Aber geiert das halbe Gegner-Team hier nur, na gut,nein, die geiern auf alle. Das ist halt das Problem des Attacker-Team, dass, da ist nocheiner. Das Attacker-Team ist halt, hat zu viel Schiss. Oh Mist, das war stumpf. Das Attacker-Teamhat halt zu viel Schiss. Wie? Das ist mein Team hier? Lul. Und jetzt können wir sieabfacken, Leute. Jetzt können wir sie richtig abfacken. Wir klauen uns ihren Jeep. Jetztkönnen wir sie richtig abfacken, Leute. Ich sag's euch. Fuck. Einfach hier mit dem Jeepstehen bleiben. Jetzt können sie nicht mal mit dem Jeep spawnen. Guck mal, wie es einschlägtdie ganze Zeit. Aber die Runde ist ja gleich vorbei. Alter, der Bender-Baba will es aberecht wissen mit seinem Schneiberzeug. Lass mal auf einen leeren 32-Mann-Säuber gehen.Das ist eine gute Idee. Aber erstmal will ich gucken, was nach dieser Runde kommt. Oh.Jetzt mal gucken, was nach dieser Runde kommt. Wenn da nämlich ZenCross hin kommt, dannspielen wir die noch. Ansonsten machen wir den Server voll mit dem cutesten Chat aufTwitch. Nach dieser Runde kommt Attacker-Rückrunde. Ja gut. Denn wir rutschen mal schnell drüber.Hoff ich mal. Sag mal, hat der Mörser-Kerl nichts besseres zu tun, als einfach nur aufmich seine komischen Mörser am Arsch der Welt abzuballern? Im Prinzip ist es, Leute,dass es eh nur noch aussitzen jetzt. Sagt mal, läuft das Spiel, kann das Spiel nichtmit Fullscreen off? Nee, nee, nee, nee. Das geht, glaube ich, nicht. Ich glaube, dashatte kein Borderless-Fullscreen, oder? Ich glaube echt, das hatte kein Borderless-Fullscreen.Weil es ist dumm, wenn das kein Borderless-Fullscreen hat, dann kann ich gar nicht irgendwelchesinnlosen Sachen einplanten oder so. Und das ist ja unglaublich wichtig, wie wir allewissen. Oh, was ist hier los? Lul, das war ein Hit. Das war angeblich ein Hit. Ja, ichmeine Borderless-Window, genau. Borderless-Window meine ich. Das soll ein Hit gewesen seingerade. Ich habe irgendwo einfach random in die Luft gesprayt und er ist gestorben.Ich meine, ich habe schon in die Richtung geschossen, aber ich war garantiert nichtdrauf. Hacker-Man. Hacks activated. 25 Jahre altes Game. Okay, nicht wirklich ganz. Wiealt ist es jetzt? 11 Jahre? 11 Jahre, ich glaube 11 Jahre, oder? Game, please, come on.Ja, ja. Oh, ich habe es nicht mehr raus geschafft.Grün gleich FPS, ja, korrekt. 10 Jahre alt, 10 Jahre alt. Grün in das Game frisst janichts. Ich glaube, mehr als 200 FPS kann man gar nicht haben in Battlefield 3. Ichmeine, ich habe einen 240-Hertz-Monitor und ich habe V-Sync aus, also insofern, ich glaube,mehr geht nicht. Ohne Scheiß, Leute. So ultra viel schlechterals 2042 sieht das jetzt auch nicht aus. Von der Performance her halt ganz zu schweigen.Aber 2042 hat halt die deutlich neuere Engine und könnte sicherlich, wenn die sich Mühegegeben hätten, die Karten detailliert und schön zu machen, deutlich besser aussehen.Ich meine, guckt euch Battlefield 5 an. Battlefield 5 war wirklich und auch Battlefield 1, abergerade Battlefield 5 hatte schon sehr hübsche Szenerie, sehr hübsche Maps und Hintergründeund Details und so. Das war schon nice. Battlefield 5 sieht schon viel, viel cooler aus als Battlefield3, aber es ist jetzt nicht so, als wären da irgendwie Welten dazwischen.Das Problem ist, dass es kacke aussieht, weil es halt keine Details hat und die keineMühe reingesteckt haben. Okay, die Runde war jetzt nicht sonderlichspannend. Defense, erste Base, easy win. Nice. Ich würde sagen, GG Eats, auf geht's.Laschen, direkt ins Auto rein, direkt ins Auto rein, Leute. Kommt her, volle Pulle. Ich fahreeuch in die Base und ihr macht Gatschi-Buzz mit den Gegnern. Die Pro-Route, Leute.Nein, nein, nein. Vor uns, vor uns, vor uns. Ich habe mich überfahren, aber die Leutesind zum Glück ausgestiegen. Der Schneiber-Typ, erstmal richtig drübergerollt.Wie gut auch der Sound ist. Da kommt was, da kommt was, Leute. Wie gut auch einfach derSound ist in dem Game. Oh, Gatschi-Buzz, Gatschi-Buzz. Nein, zu spät. Und es hatte tatsächlicheinen ganz guten Singleplayer. Ich meine, der Singleplayer ist jetzt nichts, wo ichsagen würde, er hat, denke ich, in 100 Jahren noch dran jetzt übertrieben gesagt, aberes ist durchaus in Ordnung gewesen, der Singleplayer. Ich finde, von allen Battlefield-Singleplayerhatte der die beste, die beste Story immerhin. Sag mal. Wow, da habe ich nämlich gerechnet,so viele hier drum rumstehen. Die Jett-Mission war richtig nice, von der Optik her. Vom Gameplayher war die Jett-Mission pepega. Ich aim jetzt einfach die Ecke ab, bis da einer rauskommt.Ich kann nicht raus. Okay. Ich habe unten links jetzt auf mein Team geguckt, wo einervorbeigelaufen ist. Okay, pass mal auf, hier kommt bestimmt gleich was. Einfach easy, easy,easy. Einfach, einfach, einfach Ecke, wie ein CS. Komm mal, wir spielen, wir spielendas jetzt wie CS. CS muss dir auch permanent werden, wenn du um die Ecken läufst. Irgendwiegucken. Und im CS läuft das halt dann so um die Ecken. So. Ui. Die Maus funktioniertohne probleme also wenn man schon anfängt dummes zeug zu machen dann sieht man da siehtman dass glaube ich mein team gerade ziemlich und so wann konnte man denn rausrennen überhauptjetzt schon jetzt ah nee wer hätte vorher rausrennen können auf drauf hier wo wo momentwo war das noch mal wo man hoch konnte hier man konnte ja den also die pros sind ja außengelaufen nicht irgendwie da innen da innen rennen plus die nups und außen sind auchdie ersten die vom heli gebäst werden was alter der bender baba mann was ist denn mit was istdenn mit dem dude los das ist original bellfield 3 ja oh das ist aber ein sehr soll ich sagensehr optimistisches spawn beacon sehr optimistisches spawn beacon äußerst optimistisches spawnbeacon ich würde das thema gar nicht unterstellen dass der hier krassen hackerstellz macht seincrossing please die nächste also die base hier finde ich übrigens extrem schwer wennman einen guten heli mann hat dann geht es klar also wenn man denn den heli bekommtweil ich mir gar nicht sicher bin die defender haben den heli spawn hier ne genau aber ansonstenist die base finde ich also wenn die gegner auch nur halb hallo halbwegs kompetenz sindfinde ich die base hier wirklich schwer ich muss ich muss glaube ich mal ach nee ichwar zu früh smoke smoke einpacken ach guck mal wir sind hier schon durchdie defender haben den heli den heli mann okay wir brauchen bisschen smokeja das flankieren ist halt auch so ein ding gegen den heli wenn du einen guten heli gegendich hast und die gegner halbwegs kompetenz spiel ist das hier also ist schon schwierigwarte mal wo war denn der kram jetzt hier noch mal da hier smoke die nächste base gehtdafür dann wieder eigentlich müssen wir den heli geiern irgendwiedrei leute mit stinger genau wir müssen eigentlich den heli bisschen geiernja super jetzt haben sie mich gespottet und können durchschießen gg spotting so und jetztnein man muss ja nicht hier rum guck mal man kann also wenn man gut ist und das geschicktmacht geht man darum problem ist dass da auch schon 20.000 gegner sitzen da machst du janix da machst du nix ich wollte heli geier machen mit mit das stinger die base ist aberauch finde ich echt eines der schwersten also es gibt es gibt aber noch härtere dinge beispielsweiseerste base send crossing im im im hof wisst ihr welche ich meine das da wenn viel gutgg die base im hof dies krass die haben ein auto am startok kein schimmer was hier gerade abgeht aber smoke geht abjetzt man smoke all smoke pepega pepega smoke aber die gegner stellen sich halt halbwegskompetent an der kommst hier kaum durch das ist wirklich heftig aber wir sind wir sindeigentlich ganz gut da ich meine auf der anderen seite brauchst halt einen guten push und esoh wir sind dranweggesprägt von hinten wir müssen es probieren du kannst im prinzip nur heli weg geiern undsmokeen was anderes kannst nicht wirklich machen ich gehe jetzt mal unter die heli geiererist doch eine drohne moment das geht seck ich ich wusste bis heute nicht dass man lulldas war mir nicht bewusst ja heli verpiss dich ich geier dich ab ich sags dir ich geierdich weg ich geier dich sowas von weg heli komm komm da raus komm da raus heli ich geierdich so weg jaja heli ich geier dich so hardcore weg jetzt sind sie am kotzen das mögen diedas mögen die nicht die heli spieler stinger ist so das das das ding schlechthin da wirstauch immer geflammt im chat für dann wieso stink hat man auch wenigstweiter heli nervtbei fett time was denn sonst und der heli quasi der hauptgrund war dass wir die basefast nicht gekriegt haben easy das kaum ist der heli weg oder sagt man einer ich würdenicht fürs team spielen ich meine ich habe mich hier sacrificed voll fürs team die rundewas ein satz wieder was ein bescheuertes hat ich habe mich sacrificed fürs team ja allesklar habt ihr verstanden was ich meine war hier nicht war hier nicht irgendwie ein bildemir ein hier war eine medipack dann setzt sich auch in heli ich rieche der angepissterheli pilot irgendwie so ein bisschen im chat gerade die battlefield drei soldaten sprüchensind halt auch so poc quit fucking around wir fucking nicht around wenn schon gatschipassen wir ok ich dachte das jetzt in der eck wo wir sind wir sind wieder am start easyguck mal hier kaum ist der heli weg bäm instant win wir sind auf dem dach hier jetzt habeich natürlich eine klasse ich glaube ich muss mal was auf was aufheben das ist jetzthalt so ziemlich das blödeste was man haben kann für den tunnel aber wenn wir schnellsind oder hat der hat die poc posi heute hier ist das ist die beste posi hinter dem truckok jetzt wieder was ordentliches rein spawnen hinterm truck ist halt richtig brutal opoh the terminator geht ab monka die spaß headshot mit der spaß spaß headshot das mussjetzt sein das immer leute das immer lege hänner am start ich sehe nix da kommt dochklein was lege hänner nice rüberthe pants man oh kommst du her alteroh misst gerade im falschen moment aufgestanden die slug money vermisse ich echt nicht slugmoney vermisse ich nicht und ganz ehrlich das game ist nicht perfekt das muss man jaauch echt mal sagen auch random suppression und manche sachen die bis heute verpackt sindaber trotzdem jedes mal wenn ich das game spiele habe ich habe ich bock drauf ja dasist einfach poggers das gamefack ich wollte außer line of sight laufen einfach massive poc haben wir die bae wirhaben die base easy to win easiest win würde ich fast schon sagen so die letzte base istnoch ein bisschen schwieriger aber die schwerste haben wir die zweite ist die schwerste woman da über das offene feld laufen mussaber guck mal das stripes ist am start pogu haben wir pogu überhaupt noch aktiviert imchat pogu ist nicht mehr aktiviert leute jetzt haben wir verlorenpogu muss aktiviert seinpogu im chat genau im ingame chat in battlefield ja da ist pogu mit sicherheit aktiviertbattlefield ingame chat pogu check pleaseaha kriegen wir den noch ja bleib damanchmal weiß den battlefield 3 auch nicht so genau wo du wo du hin defi muss dass esfunkt ks alter ich habe ich habe ihn gesehen ich habe ihn gesehen vergesst das vergesstdie sind hartnäckig an der letzten base leute das habe ich gewusst dass du zurück kommstdas war mir so klar das mag ich auch an battlefield 3 das ist irgendwie das oh fuck man hiersieht man alter man sieht ja gar nichts er dass man es irgendwie predicten kann wasdie gegner machen das server ist gerade wieder heftig überlastetdie gegner also gegner und eigene leute klitschen schon klitschen schon durch den boden durchwieder i get fucked up the ass over here sagt erund weg pepega aimed aber letzte base also komm wenn wir die zweite base geschafft habenmüssen wir die letzte base eigentlich auch schaffendie zweite ist viel schwerer wir packen mal wieder unser smoke ist einfach mvp wenn mannicht durchkommt chat um übrigens guckt euch mal den chat oben an das ist doch gar nichtso wild oder jetzt wird es mal wirklich klar wird da ein bisschen geflamed aber es istjetzt nicht so als wäre das so ultra toxik dass permanent die mutter beleidigt wird dassdu das ausschalten müsstest dann hier keine chance ok ich komme nicht hinich habe schiss leute ich habe richtig schiss keine ahnung wo hier gerade was abgeht ichsmoke ich nein ah wir haben gelegt das habe ich gar nicht mitbekommen in der zwischenzeitdie lege henne easy clap so präge leute präge für zen crossing präge präge 30 sekundenzeit für präge wenn genug wenn genug leute im chat prägen zentri senkos 64 präge wennsenkos in durchsicht suchen wir uns einen anderen server das ist nicht level 25 dasist kindle level 25 ach so meinst du das ja ach so ja das ist ja nicht hoch das stimmtschon das ist auch nicht hoch kindle 25 das liegt daran weil der account tatsächlichnoch nicht so alt ist die mal ich habe ja die meisten ich habe ja die meisten spielstundenich habe keine ahnung 400 stunden auf der xbox oder so und ich habe smoke dabei fackdas war ziemlich dumm wo sind wir smoke defense 64 man ist ziemlich pepega moment war dasdieser dieser granat werfer granat werfer handgranaten werfer launcher dieses ding was niemand aberauch wirklich absolut niemand spielt sehe ich das richtig ja was zum geier ist denn hierlos ok die haben uns ganz schön geschreckt jetzt würde ich mal sagen die haben uns ganzschön gebumst am anfang alle hier machst du nix was zum acht der hat über meine klassegenommen ey vergesst es 64 mit 64 kranpa sauber monac es da stirbt nix von please ich lebeauch keine fünf sekunden hechte heftige monac erstellt hier aber jetzt endlich mal ordentlicheordentliche waffe ich finde kranpa sauber defense die base ist ganz gut zu defend aberdie nächste finde ich richtig krass zu defend die nächste kommst du eigentlich kaum durchwenn die eigentlich direkt am anfang überrennen und irgendwie noch was falsch läuftholberg bliat bliat gekommnet alter was ist mit den duels los geht ja alles mit rechtending zu wenn der baba ist dauernd ich lasse dich nichtretten was alle der captain peng anzeige ist raus man des modding des mod demod mitder pumpe sind sie am start hier was haben wir denn was ich habe keine gadgets leuteich habe ich habe keine gadgets irgendjemand spielt in der klasse komplett ohne gadgetsgeht das überhaupt kann ich den hier aufheben jawoll nochein shotgun dude mann was ist mit den shotgun leuten los ich dachte mir vielleicht ja jaja ja ja ja please nicht retten fliegt noch lasst mich in ruhe lasst mich einfach liegenich will respawn ich lasse mich respawn please respawn lasst mich respawn ja da ist tx ggjetzt halten wir die hier gerade kommt ein stückchen zurück ein stückchen also hiermuss man sich tatsächlich ein bisschen aufzupritten aber ich finde es ist einfacher mit die mittezu halten als die straße aber meistens ist es so dass auch mehr gegner die mitte pushenalso das heißt in dem sinn ich gehe ich gehe mal auf die andere seite und wenn die mittepushen dann hoffe ich dass ich es mitkriege okay hier ist von verloren eigentlich alsozumindest die die straße wir müssen jetzt ein bisschen an die ecke hier vorne ist immernoch gut conquest ist tatsächlich ganz nice so erstmal schön spotten bitte was bittewas shotgun slug headshot oder pence mann ist da der pence mann ist da leuteich habe mich hier mal wie sieht es in der mitte aus in der mitte sterben auch ein paarleute erstmal alles so pressen was geht da ist übrigens jetzt die top posi ich gehemal ich gehe mal in die mitte gucken was da so abgeht das ist mit ja nach der rundenach der runde suche ich ein suchen wir uns einen neuen server nach der runde suchen wiruns neuen server machen neuen server voll trost ich doch ich sehe nichts leutewie ich einfach mal wusste dass da was ist ein nicer wallhackalles klar alles klar obvios was hier gerade passiert komplett komplett logisch komplettlogisch überhaupt keine frage also chat ich glaube euch ist auch allen klar was geradepassiert ist vollkommen easy durch zu blicken easy as fuckder chat wenn die map in 64 mark ist kaputt ja stimmt schon das stimmt schonvielleicht hätten wir wasblickste wirklich immer durch easy einfach einfach auf rote punkte einfach auf rotepunkte schießen so ist das top easy einfach rote punkte schießen beste posi am startwieder einfach mit der m16 in eine richtung schießen das ist absolut high skill hierdas soll mir keiner was anderes sagen kann nicht jeder da musste schon da musste schondas game mindestens 1000 stunden plus gespielt haben dass du das dass du das auf die reihekriegst achtung wir raschen da jetzt reindie sind doch immer noch da hinten drin wusste ich doch klar wo die stellsten was die habengesetzt wie können die die lege hände hier machen gerade ihr könnt auch nicht einfachlege hände hinter meinem rücken machen das glaube ich doch jetzt nicht das glaube ichhat da waren die einfach lege händeeinfach hier sitzt so gerade ausschießen high skill gameplay leute hier richtig exzellenthigh skill gameplay und dieser screen shake weggerotztjemand hier einfach doch einfach nur geradeaus einfach nur gerade aussprayen man einfachnur gerade aussprayen da ist nix dabei guck mal da lebt wieder einer ich hab ich hab'szucken sehendas ist so der das ist so dumm high skill leute high skill cap haben wir's bald ich hoffewir haben's bald da sind noch welche da sind noch welche komm streck deinen kopf rausjawoll also bei wo ich hab kein dieser kills wirklich irgendwie verdient ich schießeim prinzip immer nur auf einen punkt geradeaus jetzt kommen die z4 jungs acht jetzt wirdgepusht push action pusherino nice wir müssen back gepusht haben gachi bus gachi bus weggepusht haben wir sieok das ist ein bug das sieht aus wie ein gegner ist aber kein gegnerman kann es ja mal probieren ok wir haben es gleich leute danach suchen wir uns ein 32mann server und machen den voll weil auf basar attacker runde noch mal ne ne ne ne es reichtes reichtja die map ist halt nix für 64 also 64 mann conquest geht eigentlich aber was halt überhauptnicht geht ist 64 mann rushach komm wir gucken mal was auf der anderen seite der map gehtirgendwas im hals stecken gachi gasmok leute wir suchen uns jetzt einen neuen serverich bleib mal hier drinnen und mal gucken was es was es gibt refreshalso irgendwas was halt irgendwas mit gutem ping und was leer ist wir können auch einfachauf den 64 mann conquest zeigt mal hier was haben wir denn für gute rush servergibt nicht so viele leute empty emptyes gibt ja kaum rush server noch oder ist die suche verbacktja ja ich suche ja einen leerenfree for allleute ich fürchte es gibt keinen server mehr auf dem wir spielen könnensuchen wir mal suchen wir mal suchen wir mal suchen wir mal einen leeren conquest serverwo wir drauf könnenne venice kann ich nicht machen die meisten leute haben hier kein venice installierteu rusherconquest large caspian borders no rules noob neindie map rotations suckednaja die map rotations ist jetzt anders so geilpcgamer.com aber ich hab ein 15er ping auf den united states serverbest hitrack alles klarden 32er conquest ist blöd 32er rush gibt's keinekann man hier suchen nachgame size 64 machen wir mal sook was was haben wir hier zu bieten ist viel viel ist es ja nicht hier den konnten wirnehmen bf3 birthday 10 years of pc bf3 bazaar karkent firestorm das wellina meinetwegenok das ist das erscheint mir doch als ganz sinnige mischungso eine mischung aus allem möglichen also hier bf3 birthday 10 years bf3 pc joindie dlcs hat glaub ich fast jederdie waren ja nicht sogar kostenlos mit premiumdas ist immer welche gibt die sie nicht habenok aber die meisten haben glaub ich die dlcsaber das andere den anderen sinnigen server gibt's ja hier nichtsonst hätte ich den anderen genommen danach noch mal guckenso leute auf geht'sdu weißt ja was das schlimme ist die straße hier die sieht detaillierter aus als strassenin bf 2042 mapsohm scheiß drauf m16versucht das bf 7 zu m gehen aber das geht nicht richtig oderfunktioniert nicht wirklichauf wahrscheinlich habe ich jetzt die ganzen ultra pros hier draufdas hat ja keinen sinn in den lv zu rennen leutein den lv rennen ist ziemlich ppegappega mich juckt seine nassschnauzewie gesagt macht ruhig den surfer voll, wenn wir den surfer nicht voll kriegen dann hat es ja keinen sinn dass ich jetzt auf einen leeren surfer gegangen binWas mit dem losWie heißt der surfer, dass der hierBf3 birthday 10 years of bf3 pcJa alles klar genau bf3 bf3 10 years of bf3 pceasy eats eats eats eats eatsMoment ich will immer noch rutschenDabei ist rutschen ja nichts mehr hier in oder war rutschen noch nichts in bf3 was ich eigentlich auch ganz gut finde ich finde dieses hüppen fast besser als das rutschenDas rutschen ist so wir wollen krampf auf warzone seinIch weiß dass das rutschen auch in bf5 gabAber trotzdemWas ist da vorne losIch sehe gerade geschnass aber es füllt sich langsamJa ja gut Kollege ist gut Kollege alles klar alles klarEigentlich wollte ich mal hier hochstelzen siehste das dachte ich mir zum Glück und zum Glück hat er mich nicht getroffen richtigOh wie er das wusste alterGab es das rutschen nicht schon in bf1 das ist eine gute frageIch weiß nicht ich habe bf1 so gut wie nicht gespieltIch weiß nicht ob man das schon rutschen konnte konnte man chat das müsst ihr wissen konnte man schon rutschen in bf1Lass den rutschstelz machenJetzt haben wir es gebenWas ist denn hier losSoll man nicht voll kriegen dann suche ich mir was anderes weil es ist halt doof mein acht vs acht muss muss nicht seinWas ist mit euch los warum wird hier gang bang von beiden seiten gemachtHinten gemachtOh, von hinten, fuck, in the bobs.Nee Leute, ich glaub das kriegen wir nicht voll.Das kriegen wir glaube ich nicht voll.Ja es gibt leider keinen anderen Surfer.Wobei ich finde er hat eine coole Map-Rotation, ja wenn ihr keine DLCs habt geht das nicht.Aber es gibt auch keinen anderen Surfer, das ist das Problem.Was wir haben deren LLV, easy, denn ich will meinen Flank aussparen können.Nee, ich würde die DLCs jetzt nicht kaufen für so ein altes Game.Nee, es gibt keinen anderen Surfer Leute, es gibt keinen anderen Surfer.Wir haben die, wir haben volle Surfer, aber wir haben keinen leeren Surfer wo man nichtdie DLCs braucht.Meine Lieblings Posi Leute, beste, beste Posi hier, beste Posi, guck her da sind sieschon.Habt ihr den gesehen?Ich nicht.Ich hab einfach nur random in die Richtung geschossen weil ich gedacht hab ich hab wasgesehen, aber anscheinend war das echt.Okay wir müssen das, wir müssen das protekten.Nope, nope, nope, nope, nope, nope, ah es füllt sich, es füllt sich, es füllt sich.Oder wenn die Leute heute wieder Hardcore getriggert gewesen hätten, dann hätten diedas in Battlefield 2042 gesagt.Oh shit, ich dachte ich komm noch um die Ecke, nee den hab ich auch gesehen, Caspian BorderOnly war das Ding, nee, nee nicht Caspian, es waren zwei Maps, Caspian Border und nochirgendwas, das ist aber auch dumm, das will ich auch nicht in der Dauerrotation spielen.Wow, hoho, FJ hast du nicht mit uns letzten Stings gespielt, Battlefield 2042, der Namekommt mir bekannt vor.Warst du nicht der der mit der AK-24 da so abgegangen ist, doch ich glaub ja, doch, dochich erinnere mich, ich erinnere mich, so mal gucken wie es ausschaut, wird das noch irgendwievoll kriegen hier?Eigentlich hat es ja auch keinen Sinn sich immer da um die Mitte zu kloppen.Muss mal die anderen Dinge auch Captchern.Battlefield please, auf Captchern, gib ihm, nice, ok hier vorne wird gebashed, mal außenrumflanken, a 10 10, schau ma mal, oh gatchi bus, Leute gatchi bus, gatchi bus, gatchi bus,gatchi bus, gatchi bus, gatchi bus, gatchi bus, oh fuck,icher hast probiert, oh nice res.ich glaube es nicht sitzen immer noch da sind wir noch 10 10die leben doch nochAh, guck mal, schon wieder noch mehr Spieler.Ich hoffe wir kriegen das Ding voll.Ich hab ein Problem, ich hab keine Muni mehr.Das kommt äußerst selten vor eigentlich in dem Game.Das kommt wirklich nicht oft vor.Kann einer droppen?Nee, ich glaub wir haben gar keinen mit Munistells am Start.Ah gut, gehen wir mal hier runter.Ohne 3D-Spotting wäre man lost, ja.Aber ich finde es trotzdem, auch wenn das OP erst fuck ist mit dem 3D-Spotting, findeich trotzdem besser als dieses komische Motion-Sensor gespottet.In Battlefield 2049 bist du entweder quasi permanent gespottet und weißt es nicht sorichtig.Oder bist du aus anderen Gründen Gachibust um die Ecke?Okay der hat's nicht so.Fuck.Ich dachte ich kann den Jumpshot irgendwie um die Ecke.Was ist Gachibust, gib es doch mal ein im Chat.Ja das ist eines meiner Standard-Emotes.Gachibust.Ey Leute, wo ist denn die Rex?Bin ich blöd, wo ist denn die?Hab ich die nicht?Kann das sein, dass ich die nicht hab?Wo hab ich die nicht?Ist das die Co-Op Waffe, oh nein, ich hab wirklich auf dem Account keine Co-Op.Na gut, okay Chat ihr wisst was demnächst ansteht, wir müssen Co-Op spielen.Opfert sich einer mit mir Co-Op.Joa, ging das voll, also sag mal so die Hälfte, knapp die Hälfte des Servers ist voll.Aber wir sind schon aufgerundet ja.Null Dankeschön OpM16, KeckWade.Op tut es schnicks, woa, woa, woa, okay, okay, das ist natürlich doof, über Bande.Oh shit, oh oh, oh von hinten.Oh fuck, kommt sich ja vor wie ein CS hier beimeckigen Ab-Aim.Der Rest.Alter Schneiber, man das war nix.Ey das Ding ist schon krass, Op, oh der hat uns weggesprayt, der Buschwuggy.G3A3, ich hab hier auf dem Account auch nicht alles unlockt.Okay, beweg dich, 11, 11, also egal wir spielen das jetzt einfach, vielleicht kriegen wirdas hier, Captain Poggers, Massive Poggers Driving.Ah das hast du dir so gedacht.Hallo.Massive Skillwaffen, Skillwaffen only heute.Ihr sehts, heute ist nur ein 94, Scar, Sniper, G3, ihr seht heute keine Lowskillwaffen wieM16.Ausgeschlossen heute, only wins und only highskill, wie man gerade gesehen hat.Mit der Magnum, oh und der ASC, der ASC shootet.Pray, dass wir den Server vollkriegen, so ne richtig fette 64m Conquest Runde mit allenaus dem Chat wär schon echt ziemlicher Pog.Ziemlicher Pog, Pogge wär das, Pogge.Oh fuck, ich hab mich reloaded.Der ist doch noch da hinten drinnen, oder?Da stellts doch einer von euch hier, nö.Hab nix gesagt, ok die Leute lieven schon wieder, das wär doch nix mit vollem Server,das ist nicht VU, ne ich hab extra nicht VU gestartet, weil ich mir gedacht hab es isteinfacher hier Leute zu finden.No Pass, aber es könnten jetzt ja auch mal langsam Leute außen, ja klar M16, ne heuteist nicht M16, weiß gar nicht wo du M16 siehst, ich seh hier keine, ah von hinten, ich sehhier keine M16.Wie heißt der Server, achja Leute hier, bf3 birthday 10 years of bf3 pc, Link im Chat,ne, mein copy paste funktioniert nicht, mein copy paste klappt nicht, 1, mein copy pasteist broken, af, oh, ja der hier aber, also wenn wir das nicht voll kriegen, in 10 minutensuche ich mir noch für die restlichen abends was anderes, also um 20 nach, also was heißtvoll.Sagen wir mal nennenswert, hallo spring, spring, nennenswert, nennenswert gefüllt.Sagen wir mal 30, 40 plus Leute, ich hab ihn immer gesehen.Oh oh, da kommt ein Auto, das ist ziemlich, ziemlich pain's jam, ne das bekomm man Leute,den kriegen wir nicht voll, den kriegen wir nicht voll, das hat keinen Sinn, feels Batman,feels zu wenig Leute, seriously, seriously, die sind hinter uns gespawnt, lul, nice gg,na jetzt sind wieder ein paar gejohnt.Alter die farmen sich hier ein ab.Oh das war meine eigene, keck wait, ne wir kriegen das nicht voll, das sackt doch, waskönnen wir denn sonst, hat jemand noch ne gute serveridee Leute, irgendwas, weil nochmal 64 man conquest, äh nicht 64 man conquest, äh noch mal 64 man irgendwie bazaar oderso hab ich kein bock drauf, und auf 64 man metro hält sich mein bock auch hinkränzenmuss ich ehrlich sagen.64 man metro ist nicht so enjoyer modus, was sind die alle down, spawnen bestimmt jetztauch werder.00000000000haben wir es baldhaben wir es haben wir es baldhaben wir es heute haben wir es heute noch malja die sollen die dlc einfach mal kostenlos verteilen ich meine allen ernstdass das game ist zehn jahre alt wer sich jetzt die dlc nicht gekauft hatjetzt die dlc auch nicht mehr kaufen oder ist das autodas ist dumm ich suche mir da ich suche jetzt einen anderen zauber wir sind wirquasi seit eine viertel stunde die kleinen spieleranzahl ja ich suche jetztanderen zu aber was sehen wir denn jetzt zeig doch mal jaalles ich nehme alles leutees gibt kein zauber mit dem base game das ist ja das problem dann hätte ichden ja genommen gibt es nicht es gab keinen 64 mann konquest aber mit dembase game mit einer guten rotation und der lever ich glaube das kriegst ja nichtso viele leute drauf also was schnappen was sehen wir jetztnoch mal für die letzten paar runden also eher legends auf jeden fall nichtmetro only auch nichtkonquest large markas molin ich die map finde ich jetzt nicht so geilwarum gibt es da eigentlich eigentlich surfer was nix was nix anderes hat mitmit der rotationich habe es doch probiert den selber zu füllen ging nichteierstorm habe ich auch keinen bock draufes gibt ja nixes gibt nichts was wir spielen könntenaber noch einen haben wir noch einen 32 rushvielleichtbier und rush aber das ist das ist in kokona so aber da hab ich einen scheiß pingdrauf dem aber wenn pg metro abwechseln ich gucke mal kurz wieder mein ping istwenn ich drauf binbackbattlefield 3 ich habe heute die auswahl zwischenbattlefield 20 42 und battlefield 3 habe ich so gedacht weißt du was wir spielenwir wieder eine runde battlefield 3ob ich den ordentlichen ping habe aber ich finde keinen gescheiten surfer denich spielen will ziemlich sagt 115 ping ja ganz bestimmtganz bestimmt ganz bestimmtja leute es bleibt uns wohl nichts anderes übrig als diesen müll zuspielen von wegen 64 mann rushwas haben die für eine rotation armord schild banda desert halbos mal acht dugroße kakel was ist denn das ist der schake die einzig geizig gute mapja 20 42 kannst du voll knickenes gibt nixchat es gibt nichts konquest large eine mapden hier vielleichtwobei das halt krass an balance ist den surfer kenn ich da habe ich öfters maldrauf gespielt das ist halt wirklich ziemlich pp gar egal wir gehen jetztdrauf was anderes bleibt uns nicht übrig reconnect gogo was anderes bleibt unsnicht übrig ich will jetzt noch ein zwei runden spielen was wahrscheinlich einerunde noch dann ist gutselber hosten das dumme ist battlefield 3 surferselber hosten das ist nicht mal gemacht mit wir klicken zwei dreimal bei einemhost da du musst da schon ein bisschen gedanken zu machen also ich meine esnicht nur zu rotation und so was du brauchst ja auch ein paar plugins dubrauchst die plugins für bands du brauchst vielleicht noch sniper limit undsowas das ist dass das da bist du schon mal sagen halb tag mit beschäftigt unddas lohnt sich im endeffekt auch nicht weil das hat jetzt auch nicht wahnsinnigviele kommen sehr balanced sehr balanced wo wir hier drauf sind megabalancedhuge balancedoh oh in den kopfwir sind wir haben ja sogar tatsächlich basar konkurs 64 man na dann schauen wirmal dann wollen wir malwas haben wir eigentlich für den perk set uphaben wir irgendwas okay das natürlich ziemlich pepega eigentlich aber okliegen sie drin wollte gerade sagen warum warum sie wieder durchgerannt javu ist der leider leider muss man sagen ist vor der die haben es selbst einbisschen mit verkackt an sich von technischer seite her kann ich echtnichts negatives sagen also für das dass es ein mod ist dass es ein fanprojekt ist wirklich wirklich an sich richtig gutdas problem ist nur die hatten halt so komische community so was die fastalle gesagt haben oder teilweise die admins sogar den sheets ausgepackt habenwenn es schlecht lief oder habe ich mal gedacht das kann es ja nur wirklichnicht sein von ks also und auch komische regeln teilweise die hätten wenn esein offiziellen server machen müssen das offiziellen server in wenn es mitguten rules die nicht so weit von vanilla weg sindall das oppression ist ja gut mensch ich habe so ein problem ich komme nichtweg weggespray der chat guck mal der chat wieder richtig toxic toxic chat jetztwisst ihr auch warum sie den abgeschalten an den battlefield 2242die haben ihn abgeschaltet weil sie über wie soll ich sagen so so aufoperative sein wollen das tante brunhilde sich nicht auf den schlipsgetreten fühlt wo es wollen wir denn jetzt rein ja b was anderes gibt es jagerade nicht und suppression wie gesagt suppression war auch eines der coolensachen diese in wenn es abgeschaltet haben beziehungsweise runter drehenkonnten und alles alter was clusterfuck wieder ich komme nicht mal sopressen irgendwie raus nicht gegen den toter bei mir um so aus oder istschlecht monka esoh ich seh mich nicht ihr seht mir nicht leute da hier ist keine granate keinegranate erst mal in kopfalle wie schnell ist der unterwegsdas ist doch mal kacke also da müssen wir woanders da das müssen wir andersanders angehen komme ich ob ich hier rauskomme noch malich vermute ja mal nicht glaube ich kann ich einfach nur abkämpfen und hoffendass ich irgendwann sterbe ja easy easy komme ich hier raus ok easyguckt euch an zack raus ja bämpfoh god was ein klasse fahrer aha wir machen hätte klitschennaja naja ist er hätte klitsch oh jetzt so weg da obenmonial lasst mich please liegen lasst mich liegen lasst ich will woandersspawn ja ja lasst mich liegen lasst mich liegen ach so fps render draw f was renderdraw fps 1 denk mal so 180 oder so ok eh nee andere seite hätten wir gemusstwar flank action was machen die denn da da kommt nichts leute da kommt nichtsunsere leute sitzen gerade im ganggachi basealso ich kann auch nicht mehr als 200 haben hier ist natürlich doof jetzt sinddie leute schon am start hieroh f 2000 ok vielleicht hätte ich doch mal b bleiben sollendie anderen seite ok wo ist hier was vielleicht haben wir glück und kommenrüber safe safe nice rüber vielleicht haben wir nämlich glück oder kommt wasachtung das waren zwei ja 200 fps wie gesagt ich bin mir nicht sicher ob manmehr anlocken kann als 200 fps in battlefield 3 keine ahnungwov nice gg jetzt was ist im chatgekommnet im chat gekommnet am startoh nee jetzt verlieren wir wieder alles ich glaube jetzt müssen wir doch b reinkeine andere chance außer klasse da fackdas da fack deluxealles klar ob wir ist was hier passiert also wer hier nicht durchblick solltelieber an install easy easy easy ist durchblick of my life hierach hier geht die wand kaputt das wusste ich ja noch gar nicht das war mir garnicht bewusst dass sie die wand kaputt gehen kannmeine güde was ein klasse fack keine explosiv limit ja feifein time wasalso wie ich habe doch wieder gelegen das ist ich glaube das server ist kannein bisschen am ab verbrennenokböser strike wir sollten aber ehrlich gesagt lieber squad cover nehmenbesser was zum teufel ist mit den leuten losvielleicht können wir flanken da kommen noch mehr klein und da kommen noch mehrpass mal auf okay der muss im prinzip nur gerade ausmir das kannst du nicht kontesten das kannst du nicht kontesten gescheit hiergeradeaus keine chance der muss einfach nur geradeaus zielenhier unten ist einer drinkönnen vielleicht außen rum ich habe keinen bock hier auf die ganzezeit in diesem gang rum zu rennen ist ziemlich low iq und durch eure ganzenprime prime subs habe ich so hohen iq da kann ich nicht so diese diese low iqspielweise machenkann ich mal sterben90 90 prozent im gang ja das kann auch andere was stecken hier wassind das das steckt was drinihr trifft mich nicht easy ihr trefft mir nicht leute easy ihr könnt mich garnicht treffen wenn sich jetzt uns bewegen würdenein nein lasst michNein!Lass mich!Geh weg!Weg!Ach ja stimmt, es gibt ja den 64-Player-Mode, den wollte ich eigentlich ausprobieren.Alter, hier kannst du nicht raus, vielleicht hab ich Glück, jetzt, jawoll, ok, ok, nice.Ok, ok, ok, nein, nein, nein, nein, ah, Alter, es ist ja, du konntest ja nirgendswo hin,du kannst so wirklich nirgendswo hin, ich hab's jetzt ja echt probiert mal außenrumzu kommen.Im Prinzip bleibt der ja echt nur Gangstels hier, einfach, einfach Gangstels, ja, Gangstels,was willst du machen?Die haben auch noch nen Jeep auf der anderen Seite stehen und Mörser, und Mörser nocham Start.Ja ne, das klappt nicht, ok, wir flanken, wir gehen andersrum, andersrum, wir gehenso rum, nicht hier, sondern so rum, warum liegen da welche, einfach random mitten aufder Map, liegen irgendwelche Typen auf der Erde, Gangway, was ist jetzt mit euch los,Gangstelstels, ja, Corona kickt wieder, Leute, Februar wird Boosterstels gemacht.Wenn wir hier rausgehen sind wir Deadge, ich sag euch wie es ist, Instant Deadge, richtigDeadge, da fährt sogar ein Panzer rum auf der anderen Seite, Alter, es gibt ja keineEcke wo du raus kannst gerade, ok, YOLO, YOLO, YOLO, was zum, was, achja, ich habeinen, ach da, Alter, BTF, was ist mit euch los, ich bin einfach in der Ecke rumgammelt,oh, was haben wir denn hier, Aswall ohne Extended Mac, he is Batman, kann ja nichts werden, ja,wir probieren das mal die Tage aus, Leute, wir probieren die Tage 2042 wieder aus mit64 Mann, ein anderes Squad oder so vielleicht, wo die, wo die high IQ Leute drin sind, alsguter Spieler haben wir nur den Bushwookie gerade, ey, das ist mir zu Pains Champ gerade,aber habt ihr es gesehen Leute, man kann Squad wechseln, ist euch das aufgefallen, habt ihres gemerkt, was für krasse High End Funktionen hier in dem Spiel auf einmal drin sind, alsoda muss, die haben echt bestimmt so ein Pakt mit dem Teufel eingegangen in Schweden damals,das geht das nicht, ja, natürlich, der stirbt davon nicht, was, ein Mörser, ne, das machtgerade auch keinen Bock, macht auch nicht wirklich Bock gerade, gibt's, game not starting, ja,schön, gerade kein gescheiten Server, den wir spielen können, ein gescheiten Server,aber er ist dumm, 32 Mann Rush, das Problem ist, die Server, diese Cloverfield Serversind halt mega krass unbalanced, meistens dominatet da eine Seite, heftig, wieso, wasist bei der Steam Version so schlecht, achso, ja, ich weiß, was du meinst, dass die SteamVersion keine Steam Version ist, dass die Steam Version quasi einfach Origin startet,ja, das ist richtig dumm, ne, Markas Monolith bin ich jetzt nicht so scharf drauf, Leute,ich hab keine Ahnung, was spielen soll, kein Schimmer, Leute, ich weiß es nicht, ich glaube,ich lass es jetzt gut sein, gibt ja nix, was ist, vielleicht ist, pass auf mal auf, vielleichtist der andere Server jetzt wieder voll, ne, der hat Null, ja, BattleLock ist auch Hexenwerk,Leute, wir sehen uns nicht die Office, gibt nix was, ich gibt keine gescheiten Servergerade und alles andere, was es gibt, hab ich keinen Bock richtig drauf, da waren die 64 MannRush-Dinger tatsächlich noch am besten, bis denn Leute, wir sehen uns, machts gut, CU.", "segments": [{"id": 1, "start": 30.0, "end": 49.08, "text": "von"}, {"id": 2, "start": 49.08, "end": 71.02, "text": "Ich brauche ein paar Leute, die mitspielen, weil ansonsten wären wir wieder von irgendwelchen"}, {"id": 3, "start": 71.02, "end": 73.38, "text": "komischen Wallhackern und sonst was direkt geohnt."}, {"id": 4, "start": 73.38, "end": 82.52, "text": "Ähm, ja gut, wenn du es nicht installiert hast, wird es schwierig."}, {"id": 5, "start": 82.52, "end": 83.92, "text": "Stripes, moin, willst du mitspielen?"}, {"id": 6, "start": 83.92, "end": 87.76, "text": "Also ein paar Leute brauche ich noch hier."}, {"id": 7, "start": 87.76, "end": 88.76, "text": "Passion, Alter, Passion."}, {"id": 8, "start": 88.76, "end": 95.92, "text": "Also wer mitspielen will, am besten schon einen, den ich geeditert habe, wäre ganz"}, {"id": 9, "start": 95.92, "end": 96.92, "text": "praktisch."}, {"id": 10, "start": 96.92, "end": 101.92, "text": "Ein bisschen Boomer Games spielen hier."}, {"id": 11, "start": 101.92, "end": 112.32, "text": "Jo, na dann, dann suche ich mal einen Server raus, nee, Moment, wie funktioniert das jetzt"}, {"id": 12, "start": 112.32, "end": 113.32, "text": "nochmal?"}, {"id": 13, "start": 113.32, "end": 114.32, "text": "Battlefield 3, Leute adden."}, {"id": 14, "start": 114.32, "end": 120.8, "text": "Achso, ja dann warte ich mal bis du online bist, irgendwo hier kann man Leute adden dann,"}, {"id": 15, "start": 120.8, "end": 121.8, "text": "ne?"}, {"id": 16, "start": 121.8, "end": 122.8, "text": "Ja."}, {"id": 17, "start": 122.8, "end": 125.0, "text": "Wie auch immer das genau funktioniert hat, das weiß ich nicht, das kriegen wir aber"}, {"id": 18, "start": 125.0, "end": 126.0, "text": "gleich raus."}, {"id": 19, "start": 126.0, "end": 129.56, "text": "Das kriegen wir gleich raus."}, {"id": 20, "start": 129.56, "end": 142.92, "text": "Excellent, aber du hast jetzt den goldenen Keks hier, zum ersten Mal, huge, massive Keks."}, {"id": 21, "start": 142.92, "end": 148.36, "text": "Du hast mich nicht auf Origin, du musst mich doch auf Origin haben, hä?"}, {"id": 22, "start": 148.36, "end": 155.12, "text": "Wenn nicht, schick mir einfach eine Anfrage und ich adde dich, hab die echt nicht auf"}, {"id": 23, "start": 155.12, "end": 156.12, "text": "Origin?"}, {"id": 24, "start": 156.12, "end": 159.56, "text": "Hätte ich gar nicht gedacht."}, {"id": 25, "start": 159.56, "end": 164.28, "text": "Hätte ich keinen Mr."}, {"id": 26, "start": 164.28, "end": 171.28, "text": "Army hier?"}, {"id": 27, "start": 171.28, "end": 176.04, "text": "Nee."}, {"id": 28, "start": 176.04, "end": 180.4, "text": "Sieht nicht so aus."}, {"id": 29, "start": 180.4, "end": 181.4, "text": "Wahnsinn."}, {"id": 30, "start": 181.4, "end": 188.6, "text": "Kannst dir ja eine Anfrage schicken, dann adde ich dich, ganz unten in den Requests."}, {"id": 31, "start": 188.6, "end": 192.04, "text": "Ah, da ist er, exellent, exellent."}, {"id": 32, "start": 192.04, "end": 197.4, "text": "Willst du mal auf eine richtig kaputte Webseite gehen?"}, {"id": 33, "start": 197.4, "end": 208.0, "text": "Nee, das ist bestimmt irgendwelche Torzgeschichten, da will ich nicht drauf, da will ich nicht"}, {"id": 34, "start": 208.0, "end": 209.0, "text": "drauf."}, {"id": 35, "start": 209.0, "end": 210.0, "text": "Ach komm mal, er ist auch am Start."}, {"id": 36, "start": 210.0, "end": 215.44, "text": "Ja, kann man auch adden, klar."}, {"id": 37, "start": 215.44, "end": 220.28, "text": "Wie macht man denn hier noch mal ein Squad?"}, {"id": 38, "start": 220.28, "end": 222.48, "text": "Wie hat denn das noch mal funktioniert?"}, {"id": 39, "start": 222.48, "end": 228.08, "text": "Ich check's, ich check's, ne, warte mal, wie ging das hier noch mal?"}, {"id": 40, "start": 228.08, "end": 229.08, "text": "Add, oft, nee."}, {"id": 41, "start": 229.08, "end": 230.08, "text": "Create Chat."}, {"id": 42, "start": 230.08, "end": 231.08, "text": "Jaja."}, {"id": 43, "start": 231.08, "end": 250.04, "text": "Chat, wie hat denn das noch mal funktioniert?"}, {"id": 44, "start": 250.04, "end": 255.64, "text": "Wie hat man hier noch mal Squads gemacht?"}, {"id": 45, "start": 255.64, "end": 256.64, "text": "Hier drüber irgendwie?"}, {"id": 46, "start": 256.64, "end": 257.64, "text": "Create Chat?"}, {"id": 47, "start": 257.64, "end": 270.08, "text": "Nein, ich bin nicht im Discord, ich hab Streamer, lul."}, {"id": 48, "start": 270.08, "end": 271.6, "text": "Kann man sich irgendwie..."}, {"id": 49, "start": 271.6, "end": 279.28, "text": "Leg grad, wie das funktioniert."}, {"id": 50, "start": 279.28, "end": 284.28, "text": "Wo haben wir Mr."}, {"id": 51, "start": 284.28, "end": 298.84, "text": "Jacks nicht, wie hat man hier noch mal, wie hat man hier noch mal, doch online."}, {"id": 52, "start": 298.84, "end": 311.44, "text": "Ich hab keine Ahnung mehr, wie das funktioniert, wie man hier Squads macht."}, {"id": 53, "start": 311.44, "end": 316.72, "text": "Musste man überhaupt nen Chat createn?"}, {"id": 54, "start": 316.72, "end": 317.72, "text": "Nee, oder?"}, {"id": 55, "start": 317.72, "end": 320.84, "text": "Ich glaub, man musste da gar keinen Chat createn."}, {"id": 56, "start": 320.84, "end": 325.64, "text": "Aber ich bin Battlelog jetzt echt hier irgendwie drüber?"}, {"id": 57, "start": 325.64, "end": 330.76, "text": "Also ihr seht, es ist ein Monat her, dass ich gespielt hab, ne?"}, {"id": 58, "start": 330.76, "end": 331.76, "text": "Create a match?"}, {"id": 59, "start": 331.76, "end": 332.76, "text": "Was?"}, {"id": 60, "start": 332.76, "end": 339.08, "text": "Nein, nein, nein, nein, lul."}, {"id": 61, "start": 339.08, "end": 348.08, "text": "Das war Create Chat, ne?"}, {"id": 62, "start": 348.08, "end": 349.08, "text": "Select."}, {"id": 63, "start": 349.08, "end": 354.08, "text": "Wo ist denn dann Mr."}, {"id": 64, "start": 354.08, "end": 355.08, "text": "Ami?"}, {"id": 65, "start": 355.08, "end": 356.08, "text": "Seh ich den nicht?"}, {"id": 66, "start": 356.08, "end": 357.08, "text": "Warum ist der hier nicht drinnen?"}, {"id": 67, "start": 357.08, "end": 362.56, "text": "Die Hälfte, die hat doch die Hälfte wieder nicht geladen."}, {"id": 68, "start": 362.56, "end": 372.52, "text": "Ne, Platoon sind Clans quasi, sowas wie, ne."}, {"id": 69, "start": 372.52, "end": 381.44, "text": "Ich bin da zu dumm für F5en."}, {"id": 70, "start": 381.44, "end": 391.2, "text": "Ich hab keine Ahnung mehr, wie der Campel funktioniert."}, {"id": 71, "start": 391.2, "end": 400.64, "text": "Aber ich stell mich einfach mal auf Abwesen oder so, dann sieht man, was Sache ist und"}, {"id": 72, "start": 400.64, "end": 401.64, "text": "man kann nachjoinen."}, {"id": 73, "start": 401.64, "end": 403.76, "text": "Kein Schimmer mehr, wie das funktioniert."}, {"id": 74, "start": 403.76, "end": 405.84, "text": "Stripes, hab ich dich im Origin drinnen?"}, {"id": 75, "start": 405.84, "end": 410.84, "text": "Stripes, da isser."}, {"id": 76, "start": 410.84, "end": 418.8, "text": "Stripes, da isser, guck hier."}, {"id": 77, "start": 418.8, "end": 425.08, "text": "Und wenn man hier Leute edit, dann joint man zusammen, oder wie ist das?"}, {"id": 78, "start": 425.08, "end": 429.28, "text": "Ich hab keine Ahnung mehr, wirklich nicht mehr, das ist komplett random."}, {"id": 79, "start": 429.28, "end": 434.28, "text": "Kein Schimmer."}, {"id": 80, "start": 434.28, "end": 440.56, "text": "Ich weiß nicht mal, wie das funktioniert."}, {"id": 81, "start": 440.56, "end": 444.24, "text": "Leute, wir haben das doch auch schon mal geschafft."}, {"id": 82, "start": 444.24, "end": 447.04, "text": "Wir haben auch schon mal hier Battlefield zusammen gespielt, weiß gar nicht mal, wie"}, {"id": 83, "start": 447.04, "end": 448.04, "text": "wir das gemacht haben."}, {"id": 84, "start": 448.04, "end": 449.04, "text": "Keine Ahnung."}, {"id": 85, "start": 449.04, "end": 458.08, "text": "So, äh, gut, gehen wir hier drauf, was anderes gibt's ja, äh, Kark Island, Conquest Lodge,"}, {"id": 86, "start": 458.08, "end": 460.0, "text": "gibt's da nicht irgendwas ordentliches?"}, {"id": 87, "start": 460.0, "end": 465.48, "text": "Rushed Classics, ok, Rushed Classics klingt doch schon mal ganz brauchbar."}, {"id": 88, "start": 465.48, "end": 467.04, "text": "Q Nummer 3, perfekt."}, {"id": 89, "start": 467.04, "end": 474.64, "text": "Leute, ihr könnt einfach über Origin gleich nachjoinen bei mir."}, {"id": 90, "start": 474.64, "end": 475.64, "text": "Mr."}, {"id": 91, "start": 475.64, "end": 479.36, "text": "Kark Island und Stripes, joint einfach nach, oder sagt mir mal, ob's funktioniert."}, {"id": 92, "start": 479.36, "end": 482.08, "text": "Wenn nicht, mach ich hier nochmal nen Chat auf."}, {"id": 93, "start": 482.08, "end": 487.16, "text": "Ich bin mir nicht mehr sicher, wie der Kram funktioniert hat."}, {"id": 94, "start": 487.16, "end": 491.2, "text": "Ach guck mal, der joint ja auch schon, pock."}, {"id": 95, "start": 491.2, "end": 495.44, "text": "So, wie gesagt Leute, ich hab nen Monat oder so nicht mal gespielt, bin wahrscheinlich"}, {"id": 96, "start": 495.44, "end": 496.44, "text": "richtig schlecht."}, {"id": 97, "start": 496.44, "end": 497.44, "text": "Sacke."}, {"id": 98, "start": 497.44, "end": 508.56, "text": "Zumindest ein Vorteil hat, dass das Game läuft, das Game läuft halt erst mal ordentlich mit,"}, {"id": 99, "start": 508.56, "end": 516.32, "text": "äh, nee, wie war das, Perf, nee, Draw, oh, wie war das in, nee, das war nicht Perf Overlay,"}, {"id": 100, "start": 516.32, "end": 521.36, "text": "äh, BF3, Draw FPS, Sac, wie war das in BF3 nochmal?"}, {"id": 101, "start": 521.36, "end": 524.84, "text": "Render, Draw FPS, Render."}, {"id": 102, "start": 524.84, "end": 538.72, "text": "Render, Draw, FPS, 1, bam, jawoll, Bastion, Alter, Bastion, wie jetzt, oh, bisschen lauter,"}, {"id": 103, "start": 538.72, "end": 550.36, "text": "wobei, ich glaube, Lautstärke ist durchaus in Ordnung, oder?"}, {"id": 104, "start": 550.36, "end": 555.12, "text": "Lautstärke geht sogar halbwegs, klar."}, {"id": 105, "start": 555.12, "end": 557.32, "text": "So Leute, guck mal, ob du das mit dem nachjoinen findest."}, {"id": 106, "start": 557.32, "end": 568.16, "text": "Boah, ich bin, Alter, ich bin es ja überhaupt nicht mehr gewöhnt hier, an was sterben die"}, {"id": 107, "start": 568.16, "end": 569.16, "text": "denn bitteschön hier?"}, {"id": 108, "start": 569.16, "end": 579.04, "text": "Gar nicht, Rättsstellts, ja, Captain Pongas, join mal rein, lass mal gucken, ob's, oh,"}, {"id": 109, "start": 579.04, "end": 586.52, "text": "okay, ich hab absolut keinen Plan mehr, oh, nice hier, huge Rats, fuck, alles klar, geht"}, {"id": 110, "start": 586.52, "end": 587.52, "text": "ja gut los."}, {"id": 111, "start": 587.52, "end": 595.92, "text": "Ich glaub, die überrennen uns ganz schön, guck mal, der erst 23.6, jetzt schon, ich"}, {"id": 112, "start": 595.92, "end": 599.64, "text": "mein, ich weiß nicht, vielleicht spielt der ja Heli und geht voll ab oder Amtrak oder"}, {"id": 113, "start": 599.64, "end": 602.24, "text": "sonst was, das ist ja immer noch möglich."}, {"id": 114, "start": 602.24, "end": 627.2, "text": "Alter, oh Gott, wie ist denn meine Maus hier eingestellt?"}, {"id": 115, "start": 627.2, "end": 640.16, "text": "Alter, MonkaS, Captain Pongas ist am Start, aber nicht bei mir, sondern dem anderen Team,"}, {"id": 116, "start": 640.16, "end": 644.16, "text": "okay, ich glaube, man konnte hier gar nicht mit Squad zu richtig joinen, sag mal, leck"}, {"id": 117, "start": 644.16, "end": 646.64, "text": "das wie Sau, kann das sein?"}, {"id": 118, "start": 646.64, "end": 655.92, "text": "Wo ist denn hier mein, ne, äh, Captain Pongas, du bist bei den Attackern, vielleicht kannst"}, {"id": 119, "start": 655.92, "end": 660.08, "text": "du switchen, ansonsten versuch ich mal zu switchen, man muss einfach auf die gleiche"}, {"id": 120, "start": 660.08, "end": 664.32, "text": "Seite, Leute, man braucht ja gar keinen Squad aufmachen hier auch, ich kann auch den Chat"}, {"id": 121, "start": 664.32, "end": 670.24, "text": "und so wieder ausmachen, das braucht man ja gar nicht, Mister Ami ist am Start, nice,"}, {"id": 122, "start": 670.24, "end": 675.56, "text": "das braucht man doch gar nicht, man muss einfach auf die gleiche Seite und dann kann man sagen,"}, {"id": 123, "start": 675.56, "end": 681.48, "text": "man geht in D oder so, oh, es ist ungewohnt, es ist ungewohnt, dass man nicht mehr sliden"}, {"id": 124, "start": 681.48, "end": 687.12, "text": "kann, kein Slider, war hier nicht ein M-Com? War hier nicht normalerweise ein M-Com? Ah"}, {"id": 125, "start": 687.12, "end": 698.88, "text": "ne, hier ist das gewesen, lull, Alter, als hätt ich das Game noch nie gespielt, man,"}, {"id": 126, "start": 698.88, "end": 712.4, "text": "okay, kein Plan, Leute, das dauert jetzt kurz, bis ich da wieder reingekommen bin, und man"}, {"id": 127, "start": 712.4, "end": 716.76, "text": "muss ja auch wieder Q drücken, das hab ich auch ganz vergessen, man muss ja Q drücken"}, {"id": 128, "start": 716.76, "end": 734.84, "text": "für Spot Action, okay, wir lernen Battlefield 3 neu, easy, konnte man da hinten rein, okay,"}, {"id": 129, "start": 734.84, "end": 747.56, "text": "hier ist es, ah, meine Maus-Handsettings, lull, das muss ich irgendwie umstellen, Klei,"}, {"id": 130, "start": 747.56, "end": 756.24, "text": "mal gucken, mal gucken, ob ich überhaupt Gegner treffe, okay, krasser, ah, Rüstungstelz,"}, {"id": 131, "start": 756.24, "end": 768.48, "text": "nein, nein, nein, das war das Battlefield 3 Movement, das hat so seine Tücken, yup,"}, {"id": 132, "start": 768.48, "end": 778.4, "text": "nice, also, wir sind Leute, wer bei uns in Squads will, wir sind Squad India, ich kann"}, {"id": 133, "start": 778.4, "end": 782.4, "text": "Ich kann auch einfach ein Neues gleich aufmachen, wobei Mr. Army ist nicht mehr da."}, {"id": 134, "start": 783.4, "end": 784.4, "text": "Ist er..."}, {"id": 135, "start": 785.4, "end": 788.4, "text": "Geh mal, da geh ich mal zu Fate rein, jetzt bin ich in Juliott."}, {"id": 136, "start": 796.4, "end": 798.4, "text": "Boah, die Oberrennern uns hier heftig."}, {"id": 137, "start": 798.4, "end": 803.4, "text": "Ich dachte, ich kann jetzt erst mal ein bisschen Noob-mäßig hier wieder einsteigen."}, {"id": 138, "start": 803.4, "end": 805.4, "text": "Aber das geht ja, kannst du ja komplett vergessen."}, {"id": 139, "start": 805.4, "end": 809.4, "text": "Punkbuster-Kick-Player? Seriously?"}, {"id": 140, "start": 811.4, "end": 812.4, "text": "Warum das denn?"}, {"id": 141, "start": 812.4, "end": 817.4, "text": "Ah, das musst du starten. Kann es sein, dass du das nicht gestartet hast im Service?"}, {"id": 142, "start": 818.4, "end": 821.4, "text": "Man muss das ja im Service starten, dass das funktioniert."}, {"id": 143, "start": 825.4, "end": 826.4, "text": "Leute, hier ist..."}, {"id": 144, "start": 828.4, "end": 830.4, "text": "Hier ist ja 64-Mann schon clusterfuck."}, {"id": 145, "start": 830.4, "end": 834.4, "text": "Wie hat man sich da gedacht, bei Battlefield 2042 ist es eine gute Idee..."}, {"id": 146, "start": 836.4, "end": 841.4, "text": "Alter, es ist eine gute Idee, 128 Spieler zu nehmen."}, {"id": 147, "start": 842.4, "end": 844.4, "text": "Aber gut, ich werde gerätzt, ich bin ja..."}, {"id": 148, "start": 845.4, "end": 846.4, "text": "Ich bin ja schon zufrieden."}, {"id": 149, "start": 850.4, "end": 851.4, "text": "Wir aimen das hier mal kurz ab."}, {"id": 150, "start": 852.4, "end": 853.4, "text": "Da stellt es gerne..."}, {"id": 151, "start": 853.4, "end": 857.4, "text": "Sieht irgendjemand überhaupt die Gegner?"}, {"id": 152, "start": 859.4, "end": 862.4, "text": "Äh, läuft das Stream flüssig?"}, {"id": 153, "start": 871.4, "end": 872.4, "text": "Okay, alles klar."}, {"id": 154, "start": 876.4, "end": 880.4, "text": "Ach nee, Moment, man muss ja die ganze Zeit springen, dass man nicht mehr aufhört."}, {"id": 155, "start": 880.4, "end": 883.4, "text": "Ach nee, Moment, man muss ja die ganze Zeit springen, dass man schneller läuft."}, {"id": 156, "start": 884.4, "end": 886.4, "text": "Ich erinnere mich, Leute, ich erinnere mich."}, {"id": 157, "start": 887.4, "end": 888.4, "text": "Huge, I remember, I remember."}, {"id": 158, "start": 891.4, "end": 893.4, "text": "Punkbuster A und B laufen, ja dann ist es komisch."}, {"id": 159, "start": 900.4, "end": 902.4, "text": "Nee, nee, nee, nee, ich wusste, dass da einer steht."}, {"id": 160, "start": 907.4, "end": 908.4, "text": "Okay, ich habe keine Ahnung wo, aber..."}, {"id": 161, "start": 908.4, "end": 909.4, "text": "Oh, da vorne irgendwo."}, {"id": 162, "start": 910.4, "end": 912.4, "text": "Rein, rein stellst du, rechts, rechts ist er."}, {"id": 163, "start": 916.4, "end": 918.4, "text": "Irgendwo, irgendwo hier."}, {"id": 164, "start": 926.4, "end": 929.4, "text": "Wo zum Geier kamen die denn jetzt her?"}, {"id": 165, "start": 929.4, "end": 932.4, "text": "Sind die, sind die parachuted hinter mir oder so?"}, {"id": 166, "start": 936.4, "end": 939.4, "text": "Boah, wir müssen irgendwas anderes spielen als 64 Spieler."}, {"id": 167, "start": 940.4, "end": 941.4, "text": "Das überfordert mich jetzt."}, {"id": 168, "start": 942.4, "end": 943.4, "text": "Boomer hier, erstmal."}, {"id": 169, "start": 944.4, "end": 948.4, "text": "Wenn ich das so lange nicht gespielt habe, ich brauchte immer ein bisschen, bis ich wieder reinkomme."}, {"id": 170, "start": 950.4, "end": 951.4, "text": "Okay."}, {"id": 171, "start": 952.4, "end": 953.4, "text": "Attack."}, {"id": 172, "start": 954.4, "end": 955.4, "text": "Okay."}, {"id": 173, "start": 956.4, "end": 957.4, "text": "Okay."}, {"id": 174, "start": 957.4, "end": 958.4, "text": "Attack."}, {"id": 175, "start": 959.4, "end": 960.4, "text": "Oh oh, oh oh."}, {"id": 176, "start": 964.4, "end": 965.4, "text": "Nice, next."}, {"id": 177, "start": 966.4, "end": 967.4, "text": "Wo ist das Auto?"}, {"id": 178, "start": 973.4, "end": 974.4, "text": "Weiß ich was."}, {"id": 179, "start": 976.4, "end": 977.4, "text": "Aber der Stream lag nicht, oder?"}, {"id": 180, "start": 979.4, "end": 983.4, "text": "Der Stream, also Battlefield 3 braucht ja nichts an Leistung."}, {"id": 181, "start": 983.4, "end": 986.4, "text": "Der sollte ohne Probleme laufen hier."}, {"id": 182, "start": 993.4, "end": 994.4, "text": "Stream läuft gut, ok."}, {"id": 183, "start": 995.4, "end": 996.4, "text": "Nice, GG Eats."}, {"id": 184, "start": 998.4, "end": 999.4, "text": "Hier sind sie doch, hier."}, {"id": 185, "start": 1000.4, "end": 1002.4, "text": "Was? Alter, Battlefield Hit-Rag."}, {"id": 186, "start": 1003.4, "end": 1004.4, "text": "Battlefield Hit-Rag."}, {"id": 187, "start": 1005.4, "end": 1006.4, "text": "Keg Wayne."}, {"id": 188, "start": 1006.4, "end": 1007.4, "text": "Habt ihr das gesehen?"}, {"id": 189, "start": 1007.4, "end": 1010.4, "text": "Alter, Battlefield Hit-Rag. Lul, das ist ja schon der Wahnsinn."}, {"id": 190, "start": 1012.4, "end": 1014.4, "text": "Es ruckelt durch Explosionen, da kannst du nichts gegen machen."}, {"id": 191, "start": 1016.4, "end": 1019.4, "text": "Ich hab den Eindruck, ich muss ein bisschen hochstellen."}, {"id": 192, "start": 1021.4, "end": 1023.4, "text": "Ziemlich hinterher bin mit der Maus."}, {"id": 193, "start": 1024.4, "end": 1025.4, "text": "Aber gut, komm."}, {"id": 194, "start": 1025.4, "end": 1027.4, "text": "Wisst ihr was, Leute, ich hab so lange nicht gespielt."}, {"id": 195, "start": 1028.4, "end": 1030.4, "text": "Wir müssen, ich hab jetzt eine Ausrede für M16."}, {"id": 196, "start": 1030.4, "end": 1035.4, "text": "Siehste, wie schön das in Battlefield 3 war. Einfach ne Runde Defi-Spammen und schon easy."}, {"id": 197, "start": 1036.4, "end": 1037.4, "text": "War das der Gegner?"}, {"id": 198, "start": 1038.4, "end": 1041.4, "text": "Einfach Defi-Spammen und schon stehen sie wieder alle."}, {"id": 199, "start": 1042.4, "end": 1043.4, "text": "Keine Ahnung."}, {"id": 200, "start": 1044.4, "end": 1045.4, "text": "Aber es geht."}, {"id": 201, "start": 1046.4, "end": 1047.4, "text": "Es geht, es geht, es geht."}, {"id": 202, "start": 1048.4, "end": 1049.4, "text": "Es geht, es geht."}, {"id": 203, "start": 1050.4, "end": 1051.4, "text": "Es geht, es geht."}, {"id": 204, "start": 1052.4, "end": 1053.4, "text": "Es geht, es geht."}, {"id": 205, "start": 1054.4, "end": 1055.4, "text": "Es geht, es geht."}, {"id": 206, "start": 1056.4, "end": 1057.4, "text": "Es geht, es geht."}, {"id": 207, "start": 1057.4, "end": 1059.4, "text": "Einfach Defi-Spammen und schon stehen sie wieder alle."}, {"id": 208, "start": 1060.4, "end": 1064.4, "text": "Keine zwei Stunden hoffen, dass sich Gegner nicht basht, während du wiederbelebst."}, {"id": 209, "start": 1072.4, "end": 1074.4, "text": "Okay, gib ihm, Leute, gib ihm."}, {"id": 210, "start": 1075.4, "end": 1077.4, "text": "Oh, ich hab rechts einen gesehen."}, {"id": 211, "start": 1077.4, "end": 1083.4, "text": "Bin mir nicht so sicher genau, was ich gehitted hab."}, {"id": 212, "start": 1091.4, "end": 1096.4, "text": "Alter, ich treff nix. Irgendwas stimmt meins. Oder ich bin Battlefield 2042 gewöhnt."}, {"id": 213, "start": 1098.4, "end": 1100.4, "text": "Lul, das kann natürlich auch sein."}, {"id": 214, "start": 1101.4, "end": 1103.4, "text": "Wahrscheinlich bin ich Battlefield 2042 gewöhnt."}, {"id": 215, "start": 1103.4, "end": 1113.4, "text": "Das ist vorbei. Da hat man sich dran gewöhnt, dass man nix trifft und dass man ein bisschen was trifft bei nix treffen und jetzt ist es vorbei."}, {"id": 216, "start": 1116.4, "end": 1118.4, "text": "Äh, hallo? Wo ist der?"}, {"id": 217, "start": 1119.4, "end": 1120.4, "text": "Wo?"}, {"id": 218, "start": 1123.4, "end": 1124.4, "text": "Cool."}, {"id": 219, "start": 1126.4, "end": 1128.4, "text": "Die schießen mich vom Dach an, oder?"}, {"id": 220, "start": 1130.4, "end": 1131.4, "text": "Schießen die mich vom Dach an?"}, {"id": 221, "start": 1131.4, "end": 1133.4, "text": "Schießen die mich vom Dach an?"}, {"id": 222, "start": 1136.4, "end": 1138.4, "text": "Bam, ba, ba, bam. Helibash."}, {"id": 223, "start": 1141.4, "end": 1144.4, "text": "Au. Keine gute, keine gute Sache."}, {"id": 224, "start": 1149.4, "end": 1152.4, "text": "In the Kopf. Nein, nein, nein. Kopf raus."}, {"id": 225, "start": 1152.4, "end": 1159.4, "text": "Kopf raus. Kopf raus. Jawoll. Sehr gut."}, {"id": 226, "start": 1161.4, "end": 1167.4, "text": "Oh. Ist das modded oder normale Version? Das ist die ganz normale Version."}, {"id": 227, "start": 1167.4, "end": 1179.4, "text": "Das ist die ganz normale Version, die man, die jeder spielen kann gerade."}, {"id": 228, "start": 1189.4, "end": 1192.4, "text": "Was hier? Was ist mit dem da los?"}, {"id": 229, "start": 1192.4, "end": 1194.4, "text": "Was ist mit dem da los? Was ist mit dem da los?"}, {"id": 230, "start": 1197.4, "end": 1198.4, "text": "Auf, auf."}, {"id": 231, "start": 1199.4, "end": 1200.4, "text": "Schön defien."}, {"id": 232, "start": 1201.4, "end": 1202.4, "text": "Über Bande."}, {"id": 233, "start": 1206.4, "end": 1209.4, "text": "Boah. Game. Hör auf zu ruckeln."}, {"id": 234, "start": 1210.4, "end": 1213.4, "text": "Das Game ist so krass am ruckeln. Du kannst ja nicht immer zielen."}, {"id": 235, "start": 1214.4, "end": 1217.4, "text": "Hier auf irgendwas. Lebt der noch auf dem Dach? Oder nicht? Oder?"}, {"id": 236, "start": 1217.4, "end": 1222.4, "text": "Die Konfig Option zum Abschalten des Geruckels."}, {"id": 237, "start": 1223.4, "end": 1224.4, "text": "Moment, da unten ist was."}, {"id": 238, "start": 1235.4, "end": 1236.4, "text": "Wo, wo, wo?"}, {"id": 239, "start": 1240.4, "end": 1241.4, "text": "Erst mal hinlegen."}, {"id": 240, "start": 1241.4, "end": 1246.4, "text": "Y ist es. Ich denke mir schon irgendwie, ich drücke zwar Y automatisch."}, {"id": 241, "start": 1248.4, "end": 1251.4, "text": "Aber mir war gar nicht klar, weil ich für ein Getaste gerade drücke."}, {"id": 242, "start": 1252.4, "end": 1255.4, "text": "Okay, nächste Runde jetzt mal gucken, ob das jetzt ein bisschen kontrollierter"}, {"id": 243, "start": 1256.4, "end": 1257.4, "text": "vonstatten geht."}, {"id": 244, "start": 1262.4, "end": 1264.4, "text": "Tja, ich hatte die Auswahl heute."}, {"id": 245, "start": 1264.4, "end": 1269.4, "text": "Ähm, guck ich mir den neuen Patch Battlefield 2042 an."}, {"id": 246, "start": 1270.4, "end": 1272.4, "text": "Leute, es gibt ein Scoreboard. Ja, stellt euch mal vor. Guckt mal, guckt mal."}, {"id": 247, "start": 1273.4, "end": 1274.4, "text": "Seht ihr das?"}, {"id": 248, "start": 1275.4, "end": 1276.4, "text": "Ein Scoreboard."}, {"id": 249, "start": 1282.4, "end": 1283.4, "text": "Das ist unglaublich."}, {"id": 250, "start": 1286.4, "end": 1287.4, "text": "Hexen wird es."}, {"id": 251, "start": 1287.4, "end": 1293.4, "text": "Das ist unglaublich. Hexenwerk, dass es sowas überhaupt gibt."}, {"id": 252, "start": 1294.4, "end": 1296.4, "text": "Ich meine, es gibt schon keinen Chat am Ende der Runde."}, {"id": 253, "start": 1297.4, "end": 1300.4, "text": "Das haben sie ja schon, haben sie ja schon weggelassen, weil Ende der Runde immer,"}, {"id": 254, "start": 1301.4, "end": 1302.4, "text": "immer krass geflamet wird."}, {"id": 255, "start": 1310.4, "end": 1312.4, "text": "Nose, Hair, Candles, jetzt Attacker."}, {"id": 256, "start": 1312.4, "end": 1317.4, "text": "Auf, pass auf Leute, jetzt geht es, jetzt geht es drüber. Jetzt wird drüber geschlittert."}, {"id": 257, "start": 1318.4, "end": 1321.4, "text": "Chat, konntest du einstellen? Nee."}, {"id": 258, "start": 1322.4, "end": 1328.4, "text": "Chat, konntest du nicht einstellen Ende der Runde? Oder ist das was Neues, was mir noch nichts sagt?"}, {"id": 259, "start": 1334.4, "end": 1337.4, "text": "Ende der Runde, Chat? Ich meine, du kannst hier Chat machen so."}, {"id": 260, "start": 1337.4, "end": 1340.4, "text": "Peck, Wait, konntest du machen."}, {"id": 261, "start": 1350.4, "end": 1353.4, "text": "Aber Ende der Runde, Chat? Wie hat man das, und wie soll das gehen?"}, {"id": 262, "start": 1356.4, "end": 1359.4, "text": "Du musst den Punkbuster-Service neu starten."}, {"id": 263, "start": 1359.4, "end": 1368.72, "text": "Du musst den Punkbuster-Service neu starten, also starten in den Services von Windows,"}, {"id": 264, "start": 1368.72, "end": 1369.72, "text": "dann funktioniert das."}, {"id": 265, "start": 1369.72, "end": 1380.2, "text": "So, hau, ah, Granate, damn, das war klar, komm ich hol dich, Kollege, müssen wir mal"}, {"id": 266, "start": 1380.2, "end": 1381.2, "text": "gucken."}, {"id": 267, "start": 1381.2, "end": 1409.28, "text": "Boah, nein, ja was, huge suppression, Poggers, Poggers suppression, so, tja, M16 würde ich"}, {"id": 268, "start": 1409.28, "end": 1416.28, "text": "dazu sagen, M16, M16."}, {"id": 269, "start": 1439.28, "end": 1458.16, "text": "Alles klar, M16, was mit H ging das noch, während das Spiel läuft, kann ich mich jetzt"}, {"id": 270, "start": 1458.16, "end": 1459.16, "text": "nicht dran erinnern."}, {"id": 271, "start": 1459.16, "end": 1482.0, "text": "I don't know, so, bashen, wo sind's, ah, stuck, bitte random step bro, I'm stuck,"}, {"id": 272, "start": 1482.0, "end": 1489.76, "text": "Joke einsetzen, oh, ich dachte das geht, wenn ich einfach nur drauf spray aus der Hüfte."}, {"id": 273, "start": 1489.76, "end": 1497.24, "text": "Nur plus, während am Ende nicht mehr, ok, ein Prozent, wollen die mich veräbbeln."}, {"id": 274, "start": 1497.24, "end": 1505.32, "text": "Wünsche für das nächste Battlefield, hey, was heißt das nächste Battlefield, das nächste"}, {"id": 275, "start": 1505.32, "end": 1515.24, "text": "Battlefield kam vor zwei Monaten raus und es hat leider gesagt, ich muss mich"}, {"id": 276, "start": 1515.24, "end": 1520.88, "text": "an das Q drücken gewöhnen. Ich drück kaum Q Leute. Geht das noch jemand so?"}, {"id": 277, "start": 1520.88, "end": 1525.48, "text": "Ganz schlechte Idee. Geht das noch jemand so, der vorher 2042 gespielt hat,"}, {"id": 278, "start": 1525.48, "end": 1546.4, "text": "dass man sich abgewöhnt hat Q zu drücken. So krass, ich bin es null gewöhnt Q zu drücken."}, {"id": 279, "start": 1546.4, "end": 1559.68, "text": "Geh basten, jetzt hier basten. Jetzt gehts rein. Da ist der nächste. Weggesprayt. Aber guck mal"}, {"id": 280, "start": 1559.68, "end": 1574.04, "text": "hier, beste Squad Leute, beste Squad, easy win. Danke schön für den Sub. Was spielen wir denn?"}, {"id": 281, "start": 1574.04, "end": 1581.24, "text": "Sand Crossing. Sand Crossing ist Pog. Die Legehänne ist am Start Leute. Doppel, Dual,"}, {"id": 282, "start": 1581.24, "end": 1604.96, "text": "Multithreaded Legehänne. Okay, nice. Multithreaded Legehänne war am Start."}, {"id": 283, "start": 1604.96, "end": 1613.12, "text": "Jetzt müssen wir mal gucken. Jetzt kommen wir da rüber. Bashen, alter, bashen. Okay, nice. Wir"}, {"id": 284, "start": 1613.12, "end": 1631.64, "text": "haben einen Smokeman am Start. Beste, easy win. Oh oh. Legehänne. Pog. Hast du noch Kontakt zum"}, {"id": 285, "start": 1631.64, "end": 1641.4, "text": "Kaboom? Selten, selten. Aber Granatenspam. Genau, einfach Granatenspam drauf. Easy win. Oh nee,"}, {"id": 286, "start": 1641.4, "end": 1652.68, "text": "die haben diffused. Haben die? Anzeige ist raus. Warum diffusen die einfach? By the way,"}, {"id": 287, "start": 1652.68, "end": 1661.24, "text": "diese MGs an den Booten und den Panzern, diese stationären Dinger, die waren so schlecht,"}, {"id": 288, "start": 1661.24, "end": 1690.24, "text": "krass. Krass hier. Wo? Da. In der Treppe war der drinne gestucked. Wir könnten noch"}, {"id": 289, "start": 1690.24, "end": 1703.64, "text": "mehr Suppression vertragen. War Anti-Suppression nicht verbackt? War das nicht irgendwie verbackt"}, {"id": 290, "start": 1703.64, "end": 1713.72, "text": "Anti-Suppression? War da nicht was? Ich erinnere mich irgendwie, ich dachte Anti-Suppression ist"}, {"id": 291, "start": 1713.72, "end": 1726.68, "text": "irgendwie verbackt. So seit 10 Jahren. Fuck. Okay, jetzt nochmal durchzukommen ist schwierig."}, {"id": 292, "start": 1743.72, "end": 1764.28, "text": "Auf, streck deinen Kopf raus. In the ass. I get fucked up in the ass over here. Ich"}, {"id": 293, "start": 1764.28, "end": 1769.48, "text": "campere mal kurz hier eine Runde. Mir bleibt gerade nichts anderes übrig. Von hinten kommt"}, {"id": 294, "start": 1769.48, "end": 1776.04, "text": "was Leute. Von hinten kommt was. Die wollen mich bashen, Alter. Ich sehe es schon kaum"}, {"id": 295, "start": 1776.04, "end": 1805.64, "text": "hier. Da sind doch noch mehr hier. Jetzt flankt einer rum. Ja klar. Nice, nice, nice. An der"}, {"id": 296, "start": 1805.64, "end": 1817.8, "text": "Seite, hä? Okay, jetzt kommen wir ein Stückchen vor. Gucken wir mal. Gucken wir mal. Ja, please,"}, {"id": 297, "start": 1817.8, "end": 1822.92, "text": "Battlefield. Hallo, ich möchte einfach nur drüberspringen. Wenn es im Bereich des Möglichen"}, {"id": 298, "start": 1822.92, "end": 1846.12, "text": "ist. Ich habe Schiss, Leute. Ich verpiss mich. Oh, oh, oh."}, {"id": 299, "start": 1846.12, "end": 1864.44, "text": "Wo ist er? Keiner da. Auf jetzt, lege Hände hier. Lege Hände in Action. Ach, wir haben"}, {"id": 300, "start": 1864.44, "end": 1874.56, "text": "es schon. Hä? Leute, what the? Wann haben wir das gelegt? Wait, Kek. Kek, wait. Ich"}, {"id": 301, "start": 1874.56, "end": 1884.84, "text": "dachte, ich dachte, ich muss hier noch krasse Stells Action machen. Wann haben wir das geholt?"}, {"id": 302, "start": 1884.84, "end": 1895.08, "text": "Habt ihr das mitgekriegt? Wann haben wir denn, wann haben wir das M-Kong erwischt? Okay,"}, {"id": 303, "start": 1895.08, "end": 1904.96, "text": "ich will mich ja nicht beschweren. Achtung, Achtung, Achtung, Achtung. Hier ist noch irgendwo"}, {"id": 304, "start": 1904.96, "end": 1918.4, "text": "was drüben. Muss ich mal kurz ein Stückchen verpissen. Da wird reingedroppt. Okay, A sollten"}, {"id": 305, "start": 1918.4, "end": 1928.12, "text": "wir eigentlich mit dem M-Track kriegen. Eins merkt man, Leute, die, äh, wie soll man so"}, {"id": 306, "start": 1928.12, "end": 1933.72, "text": "sagen? Die Abtastrate auf dem Server ist halt wirklich krottig. Das Witzige ist, die ist"}, {"id": 307, "start": 1933.72, "end": 1939.4, "text": "ja potenziell in Battlefield 2042 besser, aber in Battlefield 2042 registrieren die"}, {"id": 308, "start": 1939.4, "end": 1959.8, "text": "Schüsse halt einfach nicht. Oh, oh, Monkeys. Boah, Alter, wie viele Granaten, Mann. Mr."}, {"id": 309, "start": 1959.8, "end": 1971.56, "text": "Army auch und wieder alles hier. Nice, TRX. Leute. Oh, oh, oh. Guck mal, hier sind so viele"}, {"id": 310, "start": 1971.56, "end": 1985.04, "text": "Leichen. Wir müssen jetzt ein bisschen weiter hinter. Ich glaube, boah, wenn wir hier, wenn"}, {"id": 311, "start": 1985.04, "end": 1990.04, "text": "wir hier, auf der, auf der Seite kommen wir nicht durch. Hier, nice, nice, nice, nice,"}, {"id": 312, "start": 1990.04, "end": 1995.72, "text": "nice. Lege Hände, lege Hände, lege Hände. Ich setze mich jetzt da rein. Das hast du"}, {"id": 313, "start": 1995.72, "end": 2006.64, "text": "jetzt, oh nee, fuck. Ich wollte gerade switchen auf die Magnum. Leute, rein da. Jetzt wird"}, {"id": 314, "start": 2006.64, "end": 2018.24, "text": "gesprägt. So eine Action hast du in Battlefield 2042 nicht. Welchen Server? Ach, keine Ahnung,"}, {"id": 315, "start": 2018.24, "end": 2027.04, "text": "der erste, beste, den du angezeigt kriegst bei Rush. Sag mal, da krabbelt noch einer"}, {"id": 316, "start": 2027.04, "end": 2041.0, "text": "da oben. Krasser Krabbelhaus. Boister Krabbelhaus. Nice Krabbelhaus, guckt euch mal. Guck mal,"}, {"id": 317, "start": 2041.0, "end": 2047.12, "text": "seht ihr das? Seht ihr das? Wie geil die Leute hier aufs Rassen und Punktefarmen sind. Konnte"}, {"id": 318, "start": 2047.12, "end": 2055.28, "text": "man eins? Nein, konnte man nicht. Ja, 64 Spieler Rush, das ist, das ist schon, ist schon knapp"}, {"id": 319, "start": 2055.28, "end": 2071.28, "text": "am Clusterfuck. Au, au, nein, nein, nein. Wo, wo? Streck deinen Kopf raus. Ach da, jetzt"}, {"id": 320, "start": 2071.28, "end": 2076.08, "text": "hätte ich mal ein bisschen Burst schießen sollen. Aber das Gute ist, M16, wozu brauchst"}, {"id": 321, "start": 2076.08, "end": 2085.8, "text": "du Burst? Blank Action hier, flankerino, massive flank. Irgendwo hier unten war doch gerade"}, {"id": 322, "start": 2085.8, "end": 2094.88, "text": "einer, oder? Oder wurde das auf der Map? Alter, die krassen Sneaky Leute, guckt sie euch"}, {"id": 323, "start": 2094.88, "end": 2107.52, "text": "an. Einfach da in der Ecke hat er gelegen, einfach in der Ecke. Engstellt, hoch 10."}, {"id": 324, "start": 2107.52, "end": 2125.28, "text": "Auf, auf, beeil dich, beeil dich, mann, beeil dich. Ey, das ist ja Battlefield 2042 Hit-Rack."}, {"id": 325, "start": 2125.28, "end": 2135.44, "text": "Habt ihr das gesehen? Alter, Battlefield, das war richtig krass, Battlefield 2042 Hit-Rack."}, {"id": 326, "start": 2135.44, "end": 2142.32, "text": "Wird Bad Company 2 noch gespielt? Ja, aber deutlich weniger. Ja, leider hat Venice den"}, {"id": 327, "start": 2142.32, "end": 2149.84, "text": "Hype nicht geschafft, ja. Das lag, da waren die aber mit, mit selbst dran schuld. Die"}, {"id": 328, "start": 2149.84, "end": 2157.28, "text": "hätten zum Beispiel Surfer anbieten müssen von ihnen. Anders funktioniert das nicht,"}, {"id": 329, "start": 2157.28, "end": 2171.68, "text": "mit, mit gutem Rules. Alter, von, von wo? Ach, von der Straße aus. Aber Battlefield"}, {"id": 330, "start": 2171.68, "end": 2197.6, "text": "3 Kreise laufen geht eigentlich immer. Oh, nice, huge risk. Alter. Okay, nice. Jetzt"}, {"id": 331, "start": 2197.6, "end": 2210.36, "text": "kommt von da noch einer. Der hat sich jetzt auch gedacht, ich weiß nicht genau, was mir"}, {"id": 332, "start": 2210.36, "end": 2228.76, "text": "passiert. Einfach gespornet und den Arsch mit der Magne umgeshootet bekommen. Oh, das"}, {"id": 333, "start": 2228.76, "end": 2241.4, "text": "fetzt hier richtig rein wieder. Au, au, au, au. Bin mir nicht ganz sicher, von wo? Shit,"}, {"id": 334, "start": 2241.4, "end": 2248.0, "text": "shit, shit, shit, shit. Von wo, von wo, von wo? Ach, von der Anti-Air. Shit, die hab"}, {"id": 335, "start": 2248.0, "end": 2265.84, "text": "ich ja gar nicht gedacht. Okay, auf gehts. So, verstecken, erst, erst mal, erst mal ver..."}, {"id": 336, "start": 2265.84, "end": 2273.84, "text": "Verstecken im Busch. Verstecken im Busch, das geht eigentlich immer. Busch, Busch stellt,"}, {"id": 337, "start": 2273.84, "end": 2291.64, "text": "das ist da unten. Null. Ja, ja, ist da gut, reg nicht mal ab. So, next, next. Oh, das"}, {"id": 338, "start": 2291.64, "end": 2298.52, "text": "wird, das wird jetzt was hier durchzukommen. Oh, von rechts, von rechts, von rechts. Ich"}, {"id": 339, "start": 2298.52, "end": 2314.04, "text": "renn einfach mal rum und retze ein bisschen. Alter, die sind hinter uns. Oh, shit. Ich"}, {"id": 340, "start": 2314.04, "end": 2331.32, "text": "seh gar nix. Wo ist denn hier was? Leute, ich hab legit keine Ahnung, wo hier irgendwas"}, {"id": 341, "start": 2331.32, "end": 2354.6, "text": "geht gerade. Okay. Nein? Ah, da. Ach, da. Obvious, obvious. Das reviven war so OP. Naja,"}, {"id": 342, "start": 2354.6, "end": 2358.32, "text": "aber das hat dazu geführt, ja, das war schon OP, aber das hat dazu geführt, dass die Leute"}, {"id": 343, "start": 2358.32, "end": 2368.4, "text": "das wenigstens machen. Nieseln wie in Battlefield 2041. Wir wollen Zen Crossing spielen. So,"}, {"id": 344, "start": 2368.4, "end": 2379.72, "text": "Yolo, Yolo Res. Alter, rein da, rein da, Leute, es muss klatschen. Bam, bababam. Granatenspam"}, {"id": 345, "start": 2379.72, "end": 2388.92, "text": "aufs M kommen. Macht sie platt. Oh, nice, huge res. Ah, mehr res, res drain am Start."}, {"id": 346, "start": 2388.92, "end": 2405.4, "text": "Fuck man, Alter. Das war nicht normal. Guckt euch, ach du Scheiße. Boah, und von der Seite"}, {"id": 347, "start": 2405.4, "end": 2414.8, "text": "weggerotzt. Richtig Gatchi-Buzz. Das ist richtig Gatchi-Buzz hier gerade. Okay, ich rede wieder"}, {"id": 348, "start": 2414.8, "end": 2420.24, "text": "wie ihres Zeug, aber Alter, ich krieg hier mal. Übrigens, das reviven, dass das nicht"}, {"id": 349, "start": 2420.24, "end": 2425.48, "text": "als Tod zählt, finde ich auch sehr, sehr nice. Das ist auch wieder ein Anreiz, ja."}, {"id": 350, "start": 2425.48, "end": 2431.48, "text": "Ich mein, das ist doch das Optimale aus beiden Welten. Okay, ich hab keine Ahnung, wo der"}, {"id": 351, "start": 2431.48, "end": 2437.48, "text": "Pizzen ist. Die Leute behalten ihre Kills und die Leute verlieren ihre Deaths. Das ist"}, {"id": 352, "start": 2437.48, "end": 2443.64, "text": "im Prinzip alle glücklich gemacht. Ich laufe übrigens die ganze Zeit im Kreis, weil ich"}, {"id": 353, "start": 2443.64, "end": 2458.64, "text": "nicht weiß, wo ich hin soll. Gatchirole. Ich Gatchirole. Alter. Aber fuck, ich hab"}, {"id": 354, "start": 2458.64, "end": 2466.4, "text": "keine Ahnung. Aber fünf. Ich will Sandcrossing spielen. Oder wie wir früher gesagt haben,"}, {"id": 355, "start": 2466.4, "end": 2482.2, "text": "ahnungslos seine Crossing. Seine Crossing. Leute, was? Seid ihr Sandcrossing-Spieler oder"}, {"id": 356, "start": 2482.2, "end": 2507.16, "text": "seine Crossing-Enjoyer? Sandcrossing. Sandcrossing, ja. Die Aussprache gab es auch noch. Sandcrossing."}, {"id": 357, "start": 2507.16, "end": 2510.8, "text": "Ich muss mehr Q drücken, Leute. Ich drücke überhaupt keinen Q. Guck mal hier. Hätte"}, {"id": 358, "start": 2510.8, "end": 2515.88, "text": "ich mehr Q gedrückt, hätt ich gleich gewusst, dass ich hier durch den Smoke Leute sprayen"}, {"id": 359, "start": 2515.88, "end": 2533.68, "text": "kann. Einfach durch den Smoke sprayen. Oh, da hinten ist was los. Da hinten ist Gatchirole"}, {"id": 360, "start": 2533.68, "end": 2543.24, "text": "in der Ecke. Ich hab's genau gesehen. Ich Gatchirole. Seht ihr den? Jetzt so Webster"}, {"id": 361, "start": 2543.24, "end": 2566.28, "text": "aufs Dach. Okay, nice, nice, nice, nice, nice, nice, nice. Aber da sieht man, dass"}, {"id": 362, "start": 2566.28, "end": 2572.12, "text": "diese Specialist-Powers zwar vielleicht nicht ganz cool spaßig für den einzelnen Spielen,"}, {"id": 363, "start": 2572.12, "end": 2577.52, "text": "aber halt für die Struktur der Map und so, dass normale Battlefield-Gampler halt gar"}, {"id": 364, "start": 2577.52, "end": 2587.6, "text": "nicht mal so sinnig sind, ne? Alter, hier wird wiederbelebt. Hier wird wiederbelebt"}, {"id": 365, "start": 2587.6, "end": 2604.0, "text": "auf Doom. Was? Wo ist der Typ? Oh, da ist noch mehr. Da hinten ist er. Da hinten ist"}, {"id": 366, "start": 2604.0, "end": 2620.76, "text": "noch einer. Guck mal hier. Der Gatchi bastet uns von hinten. Das fand ich auch cool. Dieses"}, {"id": 367, "start": 2620.76, "end": 2634.64, "text": "Springen und Rassen dabei. Bam, bap, bap, bam. So muss das sein. Oh, die sind eh immer"}, {"id": 368, "start": 2634.64, "end": 2644.92, "text": "noch da. Ich wollte ein Messer. Kick, Wade. Hätte ja funktionieren können. Es hätte"}, {"id": 369, "start": 2644.92, "end": 2651.0, "text": "ja klappen können. NA-Aim. Ja gut, das kann man jetzt von mir nicht anders erwarten als"}, {"id": 370, "start": 2651.0, "end": 2673.08, "text": "37-jähriger Boomer. 37-jähriger Boomer, dafür geht es noch durchaus in Ordnung. Ja, das"}, {"id": 371, "start": 2673.08, "end": 2677.44, "text": "waren halt typische Battlefield-Rasses. Mal geht's, mal geht's nicht. Die letzte Base"}, {"id": 372, "start": 2677.44, "end": 2685.24, "text": "ist schwer. Pass mal auf, wir machen jetzt den Big Brain Play schlechthin. Ich zeige"}, {"id": 373, "start": 2685.24, "end": 2694.32, "text": "euch mal den Massive. High IQ, only 150 IQ plus Play für die letzte Base. Pass mal auf,"}, {"id": 374, "start": 2694.32, "end": 2720.24, "text": "werdet ihr gleich sehen. 6 head, 11, 25 head. Wo? Okay, only 5 heads, only 5 head plays."}, {"id": 375, "start": 2720.24, "end": 2728.24, "text": "Es geht aber nicht, weil die Leute im Stream gucken. Nein, wir wollen Sandcrossing spielen."}, {"id": 376, "start": 2728.24, "end": 2739.32, "text": "Wir sind Sandcrossing-Enjoyer. Oh ne, der hat mein 5-Head-Plan zunichte gemacht, weil"}, {"id": 377, "start": 2739.32, "end": 2751.04, "text": "er mit dem Schiff langgefahren ist. Der Bender-Bubber. Der eigentliche 11-Head-Play ist hier langschwimmen"}, {"id": 378, "start": 2751.04, "end": 2756.32, "text": "und dann hinten rausstelzen am Wasser. Das geht natürlich nicht, wenn die Leute dort"}, {"id": 379, "start": 2756.32, "end": 2778.32, "text": "mit dem Boot am Start sind. Okay, jetzt 6 head, 6 head. Only 6 head plays. Oh, da ist ein"}, {"id": 380, "start": 2778.32, "end": 2785.68, "text": "Typ. Oh ne, das ist eine ganz schlechte Idee. Die Seite ist schon komplett voll. Jawoll,"}, {"id": 381, "start": 2785.68, "end": 2790.92, "text": "jetzt sind sie abgelenkt. Nein, nein. Was bist du noch im Boot? Was bist du noch im"}, {"id": 382, "start": 2790.92, "end": 2815.12, "text": "Boot? So sollst du gefälligstes M-Com diffusen. Anzeige ist raus. Nein, Battlefield, so ist"}, {"id": 383, "start": 2815.12, "end": 2824.88, "text": "das nicht, wie der Fallschirm funktioniert. Ich glaube, das war Server-Lag, der uns gekillt"}, {"id": 384, "start": 2824.88, "end": 2846.48, "text": "hat. Kann es sein, dass ich auf diesem komischen Mast gelandet bin? Alter, 50 Milliarden Gegner."}, {"id": 385, "start": 2846.48, "end": 2856.2, "text": "Muss er vielleicht 5 schreiben, anstatt Slash 5 zu machen? Ich glaube, das jebaitet uns"}, {"id": 386, "start": 2856.2, "end": 2861.96, "text": "einfach nur zum sinnlos Reintroppen hier oben. Das hat, glaube ich, gar keinen sinnigen"}, {"id": 387, "start": 2861.96, "end": 2887.12, "text": "Mehrwert hier. Wir sollten, glaube ich, lieber hinten spawnen. Ey du. Danke für die Subs,"}, {"id": 388, "start": 2887.12, "end": 2902.56, "text": "ich kann gerade nicht gucken. Ich sehe nichts. Sixhead, Sixhead-Time, Leute, Sixhead-Time."}, {"id": 389, "start": 2902.56, "end": 2914.96, "text": "Wehe, du bist wieder in diesem komischen Schlauchboot drinne. Sixhead-Time. Die stehen da mit dem"}, {"id": 390, "start": 2914.96, "end": 2937.12, "text": "Auto, ich fasse es nicht. Oh nee. Oh, in der S geschudelt, Mann. Krass, in der S geschudelt."}, {"id": 391, "start": 2937.12, "end": 2965.52, "text": "Okay, hier kannst du nichts machen. Okay, hier ist mit, oh mein Gott, hier ist mit viel"}, {"id": 392, "start": 2965.52, "end": 2981.8, "text": "zu viel los. Aber das war erfolgreich. Nicht so sehr erfolgreich für das Mkomm. Ja, es"}, {"id": 393, "start": 2981.8, "end": 2996.2, "text": "gibt noch, wenn es unleashed, aber die haben es leider ein wenig verkackt. Du entschärfst"}, {"id": 394, "start": 2996.2, "end": 3011.84, "text": "es. Jawoll, komm, Mkomm. Praege, Praege, Praege. Jawoll, wir haben es, nice. Erfolgreich gepraegt."}, {"id": 395, "start": 3011.84, "end": 3026.16, "text": "Wegfahren, Alter. Okay, unser Amtrak ist down. Nein, unser Amtrak ist nicht down. Massive"}, {"id": 396, "start": 3026.16, "end": 3031.96, "text": "Amtrak-Rap. Nee, das ist der Jeep. Alter, Boomer hier macht es nicht mehr mit, Leute,"}, {"id": 397, "start": 3031.96, "end": 3041.84, "text": "es ist vorbei. Nee, jetzt, Venice hat keine Spieler mehr. Ja, ich gehe in unseren Amtrak,"}, {"id": 398, "start": 3041.84, "end": 3071.32, "text": "damit ich den retten kann. Boah, hier ist ja so Action, Alter, das ist ja nicht normal."}, {"id": 399, "start": 3071.32, "end": 3078.16, "text": "The charge has been set, sehr gut. Gehen wir mal ran, wenn der Charge gesettet ist. Lass"}, {"id": 400, "start": 3078.16, "end": 3087.48, "text": "mich rein. Aber wir könnten es durchaus kriegen, also wir drücken da gerade richtig, richtig"}, {"id": 401, "start": 3087.48, "end": 3108.24, "text": "heftig rein. Gachi-Buzz. Alter, ich sehe nichts."}, {"id": 402, "start": 3108.24, "end": 3127.32, "text": "Ich habe keine Ahnung, wo hier was abgeht. Ja, wenn die Server abgeschaltet werden, dafür"}, {"id": 403, "start": 3127.32, "end": 3134.6, "text": "ist Venice natürlich richtig nice. Wenn Server abgeschaltet wird, dann kann man mit Venice"}, {"id": 404, "start": 3134.6, "end": 3138.44, "text": "halt noch weiterspielen. Das hat das Game auch wirklich verdient, also damit ist das"}, {"id": 405, "start": 3138.44, "end": 3144.2, "text": "Game ja quasi unsterblich, wenn man es so will. Oh, das sind ganz schön viele Leute."}, {"id": 406, "start": 3144.2, "end": 3156.76, "text": "Oh, auch von hinten. Oh, oh, oh nee. Ich wusste nicht, ob ich auf 3 oder 4 mein RPG habe."}, {"id": 407, "start": 3156.76, "end": 3162.32, "text": "Wo habe ich mein RPG? 3 oder 4? Ich spiele es zu wenig. Ich spiele auch viel zu selten,"}, {"id": 408, "start": 3162.32, "end": 3167.88, "text": "Engineer. Oh nee, jetzt ist er down. Jetzt ist der M-Track hinüber. Da machst du nichts"}, {"id": 409, "start": 3167.88, "end": 3179.04, "text": "mehr. Es ist aber halt ziemlich kacke, hier rein zu kommen. Boah, vergiss es. Du kannst"}, {"id": 410, "start": 3179.04, "end": 3185.04, "text": "dich in 64 Mann reintropfen. Nö, keine Chance. Das geht nicht, wir müssen das irgendwie"}, {"id": 411, "start": 3185.04, "end": 3205.8, "text": "normal aufbauen. Das wird nicht, das baitet höchstens die Leute rein. Einmal weggeguckt,"}, {"id": 412, "start": 3205.8, "end": 3214.6, "text": "direkt deadge. 64 Spieler Rush ist einfach zu viel. Ja, dann denkt man sich so, was haben"}, {"id": 413, "start": 3214.6, "end": 3219.32, "text": "die sich bei DICE gedacht mit 128 Mann Breakthrough? Sollte ich euch sagen, was die sich dabei"}, {"id": 414, "start": 3219.32, "end": 3235.4, "text": "gedacht haben? Nix. Nix haben die sich dabei gedacht. Gachibas haben die sich dabei gedacht."}, {"id": 415, "start": 3235.4, "end": 3252.92, "text": "Da kommt jetzt gleich noch mehr hier, Leute. Das hast du dir so gedacht. Ach, der Dude"}, {"id": 416, "start": 3252.92, "end": 3272.04, "text": "lebt noch. Nein, ich hab die Taste gar nicht gedrückt. Leute, wir haben's nicht. Wir haben"}, {"id": 417, "start": 3272.04, "end": 3285.04, "text": "es verloren. Alles draufschmeißen, Leute, alles draufschmeißen. Yes. Yes. Wir haben's,"}, {"id": 418, "start": 3285.04, "end": 3306.04, "text": "wir haben's, oder? Haben wir's? Bam! In your face, nice. Alter Corona schlägt zu. Der"}, {"id": 419, "start": 3306.04, "end": 3310.44, "text": "Server war überfordert. Warum war der Server überfordert? Es lief doch halbwegs flüssig."}, {"id": 420, "start": 3310.44, "end": 3325.0, "text": "Ach so, das meinst du Hittrack. Ja, das hatte ich zwischendurch auch. Die Musik im Hintergrund."}, {"id": 421, "start": 3325.0, "end": 3341.12, "text": "Was kommt denn als nächstes für eine Map? Ich hoffe Zen Crossing. Seine, seine Überquerung."}, {"id": 422, "start": 3341.12, "end": 3368.36, "text": "Dema wird Peacrush, auch gut. Sehr gut. Exquisite. Zen Crossing, Leute. Excellent, excellent."}, {"id": 423, "start": 3368.36, "end": 3376.48, "text": "Warum kann ich eigentlich keine Vollbild-Memes einblenden? Sag bloß ich spiele nicht im Fullscreen."}, {"id": 424, "start": 3376.48, "end": 3389.56, "text": "Alter, wer spielt denn bitteschön Fullscreen? Fullscreen? Nee, Moment. Konnte das Spiel"}, {"id": 425, "start": 3389.56, "end": 3409.84, "text": "überhaupt borderless Fullscreen? Wait a minute, konnte das borderless Fullscreen? Okay, ich"}, {"id": 426, "start": 3409.84, "end": 3421.2, "text": "spiele jetzt erstmal ne Runde. Team Switch please, Server erlaubt's nicht. Dann versuch"}, {"id": 427, "start": 3421.2, "end": 3447.04, "text": "neu zu joinen, dann vielleicht. Wir sind eh total verteilt. So. Chat ist voll am Durchdrehen."}, {"id": 428, "start": 3447.04, "end": 3452.56, "text": "Konnte das kein borderless Fullscreen? Nee, jetzt ist Fullscreen off. Geht aber immer"}, {"id": 429, "start": 3452.56, "end": 3466.2, "text": "noch nicht. Das lügt einfach nur. Fullscreen ist nicht off. Lügengame."}, {"id": 430, "start": 3466.2, "end": 3494.04, "text": "Nice spawn protection. Was, irgendjemand soll gebannt werden? Warum ist Hackerman am Start?"}, {"id": 431, "start": 3494.04, "end": 3513.12, "text": "Oh nee, was ist hier los? Anzeige ist raus. Jaja, schön diffusen. Diffuse-Champ. Diffuse-Champ."}, {"id": 432, "start": 3513.12, "end": 3534.44, "text": "Was ist hier los? Warum aimt da mehr als einer auf die gleiche Person? Direkt blocken. Alles"}, {"id": 433, "start": 3534.44, "end": 3562.36, "text": "bannt. Nein. Alter. Ich muss... Oost-Champ. Ai ai ai."}, {"id": 434, "start": 3562.36, "end": 3583.64, "text": "Richtig heftiger Hoost-Champ. Von wo? Von wo? Okay, ich hab keine Ahnung was mich hier"}, {"id": 435, "start": 3583.64, "end": 3593.04, "text": "von wo hittet gerade. Um ehrlich zu sein. Aber irgendwas hittet mich von irgendwo. Ah"}, {"id": 436, "start": 3593.04, "end": 3615.48, "text": "da oben ist ein Auto. Moment mal ein BBBBBB. Von oben? Nee."}, {"id": 437, "start": 3615.48, "end": 3629.84, "text": "Okay, hier ist aber gerade ziemlicher Druck drauf. Leute, ich spotte immer noch nicht."}, {"id": 438, "start": 3629.84, "end": 3639.4, "text": "Ich hab's mir mit 2042 abgewöhnt zu spotten. Und dabei ist das hier das OPste was man machen"}, {"id": 439, "start": 3639.4, "end": 3650.92, "text": "kann ordentlich spotten. Nein, nein, nein. Nee, nee, nee, nee, nee, nee. So, erst mal"}, {"id": 440, "start": 3650.92, "end": 3667.24, "text": "kurz ausruhen. Just, ja, just cool. Der kommt doch jetzt hier rum gleich der Kerl."}, {"id": 441, "start": 3667.24, "end": 3674.92, "text": "Okay, das Problem an der ersten Base Demavent Peak ist, die artet halt auch relativ schnell"}, {"id": 442, "start": 3674.92, "end": 3697.92, "text": "in Spawn-Rape aus, wenn man mal die Gegner ordentlich zurückgepusht hat. Hallo, Game."}, {"id": 443, "start": 3697.92, "end": 3705.68, "text": "Nice. Hätte das mal schneller funktioniert. Du hast damals angefangen mit Battlefield"}, {"id": 444, "start": 3705.68, "end": 3717.0, "text": "3, Atlon 2, GeForce GT 520, 30 FPS, Enjoyer. Hört sich zumindest so an. Auf der Xbox lief"}, {"id": 445, "start": 3717.0, "end": 3722.88, "text": "das ja noch nicht mal mit, also auf der Xbox lief das weder mit 720p noch mit konstanten"}, {"id": 446, "start": 3722.88, "end": 3727.92, "text": "30 FPS. Ich hab keine Ahnung, ehrlich gesagt, wie ich den Krempel damals überhaupt spielen"}, {"id": 447, "start": 3727.92, "end": 3735.4, "text": "konnte, realistisch betrachtet, aber tja, aus irgendwelchen Gründen, aus irgendwelchen"}, {"id": 448, "start": 3735.4, "end": 3742.04, "text": "Gründen fand ich das Game trotzdem geil, obwohl ich quasi keine FPS hatte und keine"}, {"id": 449, "start": 3742.04, "end": 3748.72, "text": "ordentliche Auflösung und nix. Das Gute ist, dass man nicht so einfach zu hitten ist, wenn"}, {"id": 450, "start": 3748.72, "end": 3754.48, "text": "man die ganze Zeit über so Zeug drüberspringt. Ja, 64 Spawn Rush ist zu viel. Ich guck da"}, {"id": 451, "start": 3754.48, "end": 3757.16, "text": "nach auch mal nach einem anderen Surfer, aber ein paar Runden spielen wir noch mal, wir"}, {"id": 452, "start": 3757.16, "end": 3767.76, "text": "haben ja Zeit. Wo ist er? Wo ist er? Alter, geh fort. Oh ne, so wenn ich hier zu lang"}, {"id": 453, "start": 3767.76, "end": 3775.4, "text": "rausgucke ist direkt, wirste, wenn ich hier einmal zu lang Peaks bitte. Alter, wie kommst"}, {"id": 454, "start": 3775.4, "end": 3805.04, "text": "du her? Wo, wo, da ist er einfach bei uns in der Base. Backrage. Gatschi-Buzz. Ok, das"}, {"id": 455, "start": 3805.04, "end": 3815.2, "text": "war eine dumme Idee hier rauszustellen. Das ist wieder so eine dumme Demavent Peak Runde,"}, {"id": 456, "start": 3815.2, "end": 3823.52, "text": "das artet schon in halbem Spawn Rape aus der Attacker, aber noch geht's, noch ist es halbwegs"}, {"id": 457, "start": 3823.52, "end": 3847.84, "text": "im Rahmen. Also die kommen ja immer noch rangepusht und alles. Ach, da oben sind sie. Warte, wir"}, {"id": 458, "start": 3847.84, "end": 3853.64, "text": "haben die erst jetzt geschafft. Glaubste, ich glaub's ja nicht. So, ich bleib hier."}, {"id": 459, "start": 3853.64, "end": 3857.12, "text": "Wenn wir jetzt alle rüberrennen zu B, man denkt ja immer nur man ist der einzige, der"}, {"id": 460, "start": 3857.12, "end": 3861.44, "text": "es selbst reißen kann, ne, aber wenn man alle rüberrennt, dann sind sie halt easy durchgepusht."}, {"id": 461, "start": 3861.44, "end": 3872.4, "text": "Weißt du, dabei geht's auch ohne Probleme so. Konnte man hier nicht irgendwie sogar"}, {"id": 462, "start": 3872.4, "end": 3897.6, "text": "raus? Ich glaube, ich glaube, das testen wir jetzt mal, ich glaube, das ging. Spawn Bash"}, {"id": 463, "start": 3897.6, "end": 3906.52, "text": "Enjoyer. Aber so sollte man das eigentlich nicht machen, weil dann ist ganz schnell Ragequit"}, {"id": 464, "start": 3906.52, "end": 3935.68, "text": "angesagt bei den Attackern. Fuck, es ist abgelaufen."}, {"id": 465, "start": 3935.68, "end": 3947.32, "text": "Ja, das ist das Dumme an der ersten Base von Demavent Peak. Das ist richtig blöde."}, {"id": 466, "start": 3947.32, "end": 3964.92, "text": "Oh, jetzt pushen sie. Jetzt pushen sie aber gut hier. Gatschi push. Was war das? Schneiberman"}, {"id": 467, "start": 3964.92, "end": 3982.56, "text": "hat mir den Fuß geschneibt. Okay, ich glaube, wir haben es abgewehrt. Pass auf, wenn das"}, {"id": 468, "start": 3982.56, "end": 3993.04, "text": "jetzt hittet, dann muss ich aber kecken. Aber geiert das halbe Gegner-Team hier nur, na gut,"}, {"id": 469, "start": 3993.04, "end": 4005.52, "text": "nein, die geiern auf alle. Das ist halt das Problem des Attacker-Team, dass, da ist noch"}, {"id": 470, "start": 4005.52, "end": 4020.6, "text": "einer. Das Attacker-Team ist halt, hat zu viel Schiss. Oh Mist, das war stumpf. Das Attacker-Team"}, {"id": 471, "start": 4020.6, "end": 4034.64, "text": "hat halt zu viel Schiss. Wie? Das ist mein Team hier? Lul. Und jetzt können wir sie"}, {"id": 472, "start": 4034.64, "end": 4042.68, "text": "abfacken, Leute. Jetzt können wir sie richtig abfacken. Wir klauen uns ihren Jeep. Jetzt"}, {"id": 473, "start": 4042.68, "end": 4052.12, "text": "können wir sie richtig abfacken, Leute. Ich sag's euch. Fuck. Einfach hier mit dem Jeep"}, {"id": 474, "start": 4052.12, "end": 4059.44, "text": "stehen bleiben. Jetzt können sie nicht mal mit dem Jeep spawnen. Guck mal, wie es einschlägt"}, {"id": 475, "start": 4059.44, "end": 4066.36, "text": "die ganze Zeit. Aber die Runde ist ja gleich vorbei. Alter, der Bender-Baba will es aber"}, {"id": 476, "start": 4066.36, "end": 4076.72, "text": "echt wissen mit seinem Schneiberzeug. Lass mal auf einen leeren 32-Mann-Säuber gehen."}, {"id": 477, "start": 4076.72, "end": 4093.88, "text": "Das ist eine gute Idee. Aber erstmal will ich gucken, was nach dieser Runde kommt. Oh."}, {"id": 478, "start": 4093.88, "end": 4097.56, "text": "Jetzt mal gucken, was nach dieser Runde kommt. Wenn da nämlich ZenCross hin kommt, dann"}, {"id": 479, "start": 4097.56, "end": 4102.92, "text": "spielen wir die noch. Ansonsten machen wir den Server voll mit dem cutesten Chat auf"}, {"id": 480, "start": 4102.92, "end": 4117.24, "text": "Twitch. Nach dieser Runde kommt Attacker-Rückrunde. Ja gut. Denn wir rutschen mal schnell drüber."}, {"id": 481, "start": 4117.24, "end": 4133.04, "text": "Hoff ich mal. Sag mal, hat der Mörser-Kerl nichts besseres zu tun, als einfach nur auf"}, {"id": 482, "start": 4133.04, "end": 4143.68, "text": "mich seine komischen Mörser am Arsch der Welt abzuballern? Im Prinzip ist es, Leute,"}, {"id": 483, "start": 4143.68, "end": 4149.0, "text": "dass es eh nur noch aussitzen jetzt. Sagt mal, läuft das Spiel, kann das Spiel nicht"}, {"id": 484, "start": 4149.0, "end": 4176.16, "text": "mit Fullscreen off? Nee, nee, nee, nee. Das geht, glaube ich, nicht. Ich glaube, das"}, {"id": 485, "start": 4176.16, "end": 4183.04, "text": "hatte kein Borderless-Fullscreen, oder? Ich glaube echt, das hatte kein Borderless-Fullscreen."}, {"id": 486, "start": 4183.04, "end": 4197.36, "text": "Weil es ist dumm, wenn das kein Borderless-Fullscreen hat, dann kann ich gar nicht irgendwelche"}, {"id": 487, "start": 4197.36, "end": 4205.72, "text": "sinnlosen Sachen einplanten oder so. Und das ist ja unglaublich wichtig, wie wir alle"}, {"id": 488, "start": 4205.72, "end": 4223.28, "text": "wissen. Oh, was ist hier los? Lul, das war ein Hit. Das war angeblich ein Hit. Ja, ich"}, {"id": 489, "start": 4223.28, "end": 4230.56, "text": "meine Borderless-Window, genau. Borderless-Window meine ich. Das soll ein Hit gewesen sein"}, {"id": 490, "start": 4230.56, "end": 4235.84, "text": "gerade. Ich habe irgendwo einfach random in die Luft gesprayt und er ist gestorben."}, {"id": 491, "start": 4235.84, "end": 4240.88, "text": "Ich meine, ich habe schon in die Richtung geschossen, aber ich war garantiert nicht"}, {"id": 492, "start": 4240.88, "end": 4250.16, "text": "drauf. Hacker-Man. Hacks activated. 25 Jahre altes Game. Okay, nicht wirklich ganz. Wie"}, {"id": 493, "start": 4250.16, "end": 4261.2, "text": "alt ist es jetzt? 11 Jahre? 11 Jahre, ich glaube 11 Jahre, oder? Game, please, come on."}, {"id": 494, "start": 4261.2, "end": 4290.04, "text": "Ja, ja. Oh, ich habe es nicht mehr raus geschafft."}, {"id": 495, "start": 4290.04, "end": 4297.0, "text": "Grün gleich FPS, ja, korrekt. 10 Jahre alt, 10 Jahre alt. Grün in das Game frisst ja"}, {"id": 496, "start": 4297.0, "end": 4302.04, "text": "nichts. Ich glaube, mehr als 200 FPS kann man gar nicht haben in Battlefield 3. Ich"}, {"id": 497, "start": 4302.04, "end": 4308.24, "text": "meine, ich habe einen 240-Hertz-Monitor und ich habe V-Sync aus, also insofern, ich glaube,"}, {"id": 498, "start": 4308.24, "end": 4318.48, "text": "mehr geht nicht. Ohne Scheiß, Leute. So ultra viel schlechter"}, {"id": 499, "start": 4318.48, "end": 4324.8, "text": "als 2042 sieht das jetzt auch nicht aus. Von der Performance her halt ganz zu schweigen."}, {"id": 500, "start": 4324.8, "end": 4332.6, "text": "Aber 2042 hat halt die deutlich neuere Engine und könnte sicherlich, wenn die sich Mühe"}, {"id": 501, "start": 4332.6, "end": 4338.88, "text": "gegeben hätten, die Karten detailliert und schön zu machen, deutlich besser aussehen."}, {"id": 502, "start": 4338.88, "end": 4343.36, "text": "Ich meine, guckt euch Battlefield 5 an. Battlefield 5 war wirklich und auch Battlefield 1, aber"}, {"id": 503, "start": 4343.36, "end": 4351.6, "text": "gerade Battlefield 5 hatte schon sehr hübsche Szenerie, sehr hübsche Maps und Hintergründe"}, {"id": 504, "start": 4351.6, "end": 4356.24, "text": "und Details und so. Das war schon nice. Battlefield 5 sieht schon viel, viel cooler aus als Battlefield"}, {"id": 505, "start": 4356.24, "end": 4359.12, "text": "3, aber es ist jetzt nicht so, als wären da irgendwie Welten dazwischen."}, {"id": 506, "start": 4359.12, "end": 4370.72, "text": "Das Problem ist, dass es kacke aussieht, weil es halt keine Details hat und die keine"}, {"id": 507, "start": 4370.72, "end": 4375.36, "text": "Mühe reingesteckt haben. Okay, die Runde war jetzt nicht sonderlich"}, {"id": 508, "start": 4375.36, "end": 4396.04, "text": "spannend. Defense, erste Base, easy win. Nice. Ich würde sagen, GG Eats, auf geht's."}, {"id": 509, "start": 4396.04, "end": 4403.24, "text": "Laschen, direkt ins Auto rein, direkt ins Auto rein, Leute. Kommt her, volle Pulle. Ich fahre"}, {"id": 510, "start": 4403.24, "end": 4412.48, "text": "euch in die Base und ihr macht Gatschi-Buzz mit den Gegnern. Die Pro-Route, Leute."}, {"id": 511, "start": 4412.48, "end": 4426.84, "text": "Nein, nein, nein. Vor uns, vor uns, vor uns. Ich habe mich überfahren, aber die Leute"}, {"id": 512, "start": 4426.84, "end": 4431.28, "text": "sind zum Glück ausgestiegen. Der Schneiber-Typ, erstmal richtig drübergerollt."}, {"id": 513, "start": 4431.28, "end": 4446.84, "text": "Wie gut auch der Sound ist. Da kommt was, da kommt was, Leute. Wie gut auch einfach der"}, {"id": 514, "start": 4446.84, "end": 4462.16, "text": "Sound ist in dem Game. Oh, Gatschi-Buzz, Gatschi-Buzz. Nein, zu spät. Und es hatte tatsächlich"}, {"id": 515, "start": 4462.16, "end": 4465.48, "text": "einen ganz guten Singleplayer. Ich meine, der Singleplayer ist jetzt nichts, wo ich"}, {"id": 516, "start": 4465.48, "end": 4469.56, "text": "sagen würde, er hat, denke ich, in 100 Jahren noch dran jetzt übertrieben gesagt, aber"}, {"id": 517, "start": 4469.56, "end": 4474.64, "text": "es ist durchaus in Ordnung gewesen, der Singleplayer. Ich finde, von allen Battlefield-Singleplayer"}, {"id": 518, "start": 4474.64, "end": 4491.36, "text": "hatte der die beste, die beste Story immerhin. Sag mal. Wow, da habe ich nämlich gerechnet,"}, {"id": 519, "start": 4491.36, "end": 4497.48, "text": "so viele hier drum rumstehen. Die Jett-Mission war richtig nice, von der Optik her. Vom Gameplay"}, {"id": 520, "start": 4497.48, "end": 4508.16, "text": "her war die Jett-Mission pepega. Ich aim jetzt einfach die Ecke ab, bis da einer rauskommt."}, {"id": 521, "start": 4508.16, "end": 4513.12, "text": "Ich kann nicht raus. Okay. Ich habe unten links jetzt auf mein Team geguckt, wo einer"}, {"id": 522, "start": 4513.12, "end": 4520.04, "text": "vorbeigelaufen ist. Okay, pass mal auf, hier kommt bestimmt gleich was. Einfach easy, easy,"}, {"id": 523, "start": 4520.04, "end": 4531.16, "text": "easy. Einfach, einfach, einfach Ecke, wie ein CS. Komm mal, wir spielen, wir spielen"}, {"id": 524, "start": 4531.16, "end": 4541.0, "text": "das jetzt wie CS. CS muss dir auch permanent werden, wenn du um die Ecken läufst. Irgendwie"}, {"id": 525, "start": 4541.0, "end": 4548.72, "text": "gucken. Und im CS läuft das halt dann so um die Ecken. So. Ui. Die Maus funktioniert"}, {"id": 526, "start": 4548.72, "end": 4555.68, "text": "ohne probleme also wenn man schon anfängt dummes zeug zu machen dann sieht man da sieht"}, {"id": 527, "start": 4555.68, "end": 4567.28, "text": "man dass glaube ich mein team gerade ziemlich und so wann konnte man denn rausrennen überhaupt"}, {"id": 528, "start": 4567.28, "end": 4575.4, "text": "jetzt schon jetzt ah nee wer hätte vorher rausrennen können auf drauf hier wo wo moment"}, {"id": 529, "start": 4575.4, "end": 4581.28, "text": "wo war das noch mal wo man hoch konnte hier man konnte ja den also die pros sind ja außen"}, {"id": 530, "start": 4581.28, "end": 4588.12, "text": "gelaufen nicht irgendwie da innen da innen rennen plus die nups und außen sind auch"}, {"id": 531, "start": 4588.12, "end": 4608.52, "text": "die ersten die vom heli gebäst werden was alter der bender baba mann was ist denn mit was ist"}, {"id": 532, "start": 4608.52, "end": 4618.36, "text": "denn mit dem dude los das ist original bellfield 3 ja oh das ist aber ein sehr soll ich sagen"}, {"id": 533, "start": 4618.36, "end": 4627.0, "text": "sehr optimistisches spawn beacon sehr optimistisches spawn beacon äußerst optimistisches spawn"}, {"id": 534, "start": 4627.0, "end": 4639.28, "text": "beacon ich würde das thema gar nicht unterstellen dass der hier krassen hackerstellz macht sein"}, {"id": 535, "start": 4639.28, "end": 4648.24, "text": "crossing please die nächste also die base hier finde ich übrigens extrem schwer wenn"}, {"id": 536, "start": 4648.24, "end": 4652.24, "text": "man einen guten heli mann hat dann geht es klar also wenn man denn den heli bekommt"}, {"id": 537, "start": 4652.24, "end": 4659.08, "text": "weil ich mir gar nicht sicher bin die defender haben den heli spawn hier ne genau aber ansonsten"}, {"id": 538, "start": 4659.08, "end": 4666.4, "text": "ist die base finde ich also wenn die gegner auch nur halb hallo halbwegs kompetenz sind"}, {"id": 539, "start": 4666.4, "end": 4670.72, "text": "finde ich die base hier wirklich schwer ich muss ich muss glaube ich mal ach nee ich"}, {"id": 540, "start": 4670.72, "end": 4686.84, "text": "war zu früh smoke smoke einpacken ach guck mal wir sind hier schon durch"}, {"id": 541, "start": 4686.84, "end": 4701.44, "text": "die defender haben den heli den heli mann okay wir brauchen bisschen smoke"}, {"id": 542, "start": 4701.44, "end": 4707.52, "text": "ja das flankieren ist halt auch so ein ding gegen den heli wenn du einen guten heli gegen"}, {"id": 543, "start": 4707.52, "end": 4712.64, "text": "dich hast und die gegner halbwegs kompetenz spiel ist das hier also ist schon schwierig"}, {"id": 544, "start": 4712.64, "end": 4720.72, "text": "warte mal wo war denn der kram jetzt hier noch mal da hier smoke die nächste base geht"}, {"id": 545, "start": 4720.72, "end": 4731.44, "text": "dafür dann wieder eigentlich müssen wir den heli geiern irgendwie"}, {"id": 546, "start": 4731.44, "end": 4754.6, "text": "drei leute mit stinger genau wir müssen eigentlich den heli bisschen geiern"}, {"id": 547, "start": 4754.6, "end": 4766.0, "text": "ja super jetzt haben sie mich gespottet und können durchschießen gg spotting so und jetzt"}, {"id": 548, "start": 4766.0, "end": 4772.2, "text": "nein man muss ja nicht hier rum guck mal man kann also wenn man gut ist und das geschickt"}, {"id": 549, "start": 4772.2, "end": 4787.36, "text": "macht geht man darum problem ist dass da auch schon 20.000 gegner sitzen da machst du ja"}, {"id": 550, "start": 4787.36, "end": 4812.64, "text": "nix da machst du nix ich wollte heli geier machen mit mit das stinger die base ist aber"}, {"id": 551, "start": 4812.64, "end": 4817.72, "text": "auch finde ich echt eines der schwersten also es gibt es gibt aber noch härtere dinge beispielsweise"}, {"id": 552, "start": 4817.72, "end": 4826.48, "text": "erste base send crossing im im im hof wisst ihr welche ich meine das da wenn viel gut"}, {"id": 553, "start": 4826.48, "end": 4846.56, "text": "gg die base im hof dies krass die haben ein auto am start"}, {"id": 554, "start": 4846.56, "end": 4875.56, "text": "ok kein schimmer was hier gerade abgeht aber smoke geht ab"}, {"id": 555, "start": 4875.56, "end": 4896.84, "text": "jetzt man smoke all smoke pepega pepega smoke aber die gegner stellen sich halt halbwegs"}, {"id": 556, "start": 4896.84, "end": 4903.8, "text": "kompetent an der kommst hier kaum durch das ist wirklich heftig aber wir sind wir sind"}, {"id": 557, "start": 4903.8, "end": 4907.44, "text": "eigentlich ganz gut da ich meine auf der anderen seite brauchst halt einen guten push und es"}, {"id": 558, "start": 4933.8, "end": 4958.56, "text": "oh wir sind dran"}, {"id": 559, "start": 4958.56, "end": 4970.04, "text": "weggesprägt von hinten wir müssen es probieren du kannst im prinzip nur heli weg geiern und"}, {"id": 560, "start": 4970.04, "end": 4990.08, "text": "smokeen was anderes kannst nicht wirklich machen ich gehe jetzt mal unter die heli geierer"}, {"id": 561, "start": 4990.08, "end": 5005.8, "text": "ist doch eine drohne moment das geht seck ich ich wusste bis heute nicht dass man lull"}, {"id": 562, "start": 5005.8, "end": 5013.44, "text": "das war mir nicht bewusst ja heli verpiss dich ich geier dich ab ich sags dir ich geier"}, {"id": 563, "start": 5013.44, "end": 5032.6, "text": "dich weg ich geier dich sowas von weg heli komm komm da raus komm da raus heli ich geier"}, {"id": 564, "start": 5032.6, "end": 5053.2, "text": "dich so weg jaja heli ich geier dich so hardcore weg jetzt sind sie am kotzen das mögen die"}, {"id": 565, "start": 5053.2, "end": 5062.36, "text": "das mögen die nicht die heli spieler stinger ist so das das das ding schlechthin da wirst"}, {"id": 566, "start": 5062.36, "end": 5068.8, "text": "auch immer geflammt im chat für dann wieso stink hat man auch wenigstweiter heli nervt"}, {"id": 567, "start": 5068.8, "end": 5077.88, "text": "bei fett time was denn sonst und der heli quasi der hauptgrund war dass wir die base"}, {"id": 568, "start": 5077.88, "end": 5089.36, "text": "fast nicht gekriegt haben easy das kaum ist der heli weg oder sagt man einer ich würde"}, {"id": 569, "start": 5089.36, "end": 5095.96, "text": "nicht fürs team spielen ich meine ich habe mich hier sacrificed voll fürs team die runde"}, {"id": 570, "start": 5095.96, "end": 5104.4, "text": "was ein satz wieder was ein bescheuertes hat ich habe mich sacrificed fürs team ja alles"}, {"id": 571, "start": 5104.4, "end": 5113.8, "text": "klar habt ihr verstanden was ich meine war hier nicht war hier nicht irgendwie ein bilde"}, {"id": 572, "start": 5113.8, "end": 5125.44, "text": "mir ein hier war eine medipack dann setzt sich auch in heli ich rieche der angepisster"}, {"id": 573, "start": 5125.44, "end": 5141.12, "text": "heli pilot irgendwie so ein bisschen im chat gerade die battlefield drei soldaten sprüchen"}, {"id": 574, "start": 5141.12, "end": 5160.0, "text": "sind halt auch so poc quit fucking around wir fucking nicht around wenn schon gatschi"}, {"id": 575, "start": 5160.0, "end": 5178.48, "text": "passen wir ok ich dachte das jetzt in der eck wo wir sind wir sind wieder am start easy"}, {"id": 576, "start": 5178.48, "end": 5190.52, "text": "guck mal hier kaum ist der heli weg bäm instant win wir sind auf dem dach hier jetzt habe"}, {"id": 577, "start": 5190.52, "end": 5196.32, "text": "ich natürlich eine klasse ich glaube ich muss mal was auf was aufheben das ist jetzt"}, {"id": 578, "start": 5196.32, "end": 5201.04, "text": "halt so ziemlich das blödeste was man haben kann für den tunnel aber wenn wir schnell"}, {"id": 579, "start": 5201.04, "end": 5211.92, "text": "sind oder hat der hat die poc posi heute hier ist das ist die beste posi hinter dem truck"}, {"id": 580, "start": 5211.92, "end": 5229.56, "text": "ok jetzt wieder was ordentliches rein spawnen hinterm truck ist halt richtig brutal op"}, {"id": 581, "start": 5229.56, "end": 5258.92, "text": "oh the terminator geht ab monka die spaß headshot mit der spaß spaß headshot das muss"}, {"id": 582, "start": 5258.92, "end": 5270.36, "text": "jetzt sein das immer leute das immer lege hänner am start ich sehe nix da kommt doch"}, {"id": 583, "start": 5270.36, "end": 5291.48, "text": "klein was lege hänner nice rüber"}, {"id": 584, "start": 5291.48, "end": 5303.44, "text": "the pants man oh kommst du her alter"}, {"id": 585, "start": 5303.44, "end": 5325.84, "text": "oh misst gerade im falschen moment aufgestanden die slug money vermisse ich echt nicht slug"}, {"id": 586, "start": 5325.84, "end": 5330.4, "text": "money vermisse ich nicht und ganz ehrlich das game ist nicht perfekt das muss man ja"}, {"id": 587, "start": 5330.4, "end": 5334.24, "text": "auch echt mal sagen auch random suppression und manche sachen die bis heute verpackt sind"}, {"id": 588, "start": 5334.24, "end": 5339.68, "text": "aber trotzdem jedes mal wenn ich das game spiele habe ich habe ich bock drauf ja das"}, {"id": 589, "start": 5339.68, "end": 5343.32, "text": "ist einfach poggers das game"}, {"id": 590, "start": 5343.32, "end": 5360.6, "text": "fack ich wollte außer line of sight laufen einfach massive poc haben wir die bae wir"}, {"id": 591, "start": 5360.6, "end": 5370.28, "text": "haben die base easy to win easiest win würde ich fast schon sagen so die letzte base ist"}, {"id": 592, "start": 5370.28, "end": 5374.4, "text": "noch ein bisschen schwieriger aber die schwerste haben wir die zweite ist die schwerste wo"}, {"id": 593, "start": 5374.4, "end": 5376.12, "text": "man da über das offene feld laufen muss"}, {"id": 594, "start": 5376.12, "end": 5401.04, "text": "aber guck mal das stripes ist am start pogu haben wir pogu überhaupt noch aktiviert im"}, {"id": 595, "start": 5401.04, "end": 5411.96, "text": "chat pogu ist nicht mehr aktiviert leute jetzt haben wir verloren"}, {"id": 596, "start": 5411.96, "end": 5412.96, "text": "pogu muss aktiviert sein"}, {"id": 597, "start": 5412.96, "end": 5420.32, "text": "pogu im chat genau im ingame chat in battlefield ja da ist pogu mit sicherheit aktiviert"}, {"id": 598, "start": 5420.32, "end": 5436.76, "text": "battlefield ingame chat pogu check please"}, {"id": 599, "start": 5436.76, "end": 5439.16, "text": "aha kriegen wir den noch ja bleib da"}, {"id": 600, "start": 5439.16, "end": 5456.2, "text": "manchmal weiß den battlefield 3 auch nicht so genau wo du wo du hin defi muss dass es"}, {"id": 601, "start": 5456.2, "end": 5472.88, "text": "funkt ks alter ich habe ich habe ihn gesehen ich habe ihn gesehen vergesst das vergesst"}, {"id": 602, "start": 5472.88, "end": 5486.96, "text": "die sind hartnäckig an der letzten base leute das habe ich gewusst dass du zurück kommst"}, {"id": 603, "start": 5486.96, "end": 5492.84, "text": "das war mir so klar das mag ich auch an battlefield 3 das ist irgendwie das oh fuck man hier"}, {"id": 604, "start": 5492.84, "end": 5497.44, "text": "sieht man alter man sieht ja gar nichts er dass man es irgendwie predicten kann was"}, {"id": 605, "start": 5497.44, "end": 5504.64, "text": "die gegner machen das server ist gerade wieder heftig überlastet"}, {"id": 606, "start": 5504.64, "end": 5509.56, "text": "die gegner also gegner und eigene leute klitschen schon klitschen schon durch den boden durch"}, {"id": 607, "start": 5509.56, "end": 5529.16, "text": "wieder i get fucked up the ass over here sagt er"}, {"id": 608, "start": 5529.16, "end": 5533.52, "text": "und weg pepega aimed aber letzte base also komm wenn wir die zweite base geschafft haben"}, {"id": 609, "start": 5533.52, "end": 5537.28, "text": "müssen wir die letzte base eigentlich auch schaffen"}, {"id": 610, "start": 5537.28, "end": 5549.04, "text": "die zweite ist viel schwerer wir packen mal wieder unser smoke ist einfach mvp wenn man"}, {"id": 611, "start": 5549.04, "end": 5567.36, "text": "nicht durchkommt chat um übrigens guckt euch mal den chat oben an das ist doch gar nicht"}, {"id": 612, "start": 5567.36, "end": 5571.8, "text": "so wild oder jetzt wird es mal wirklich klar wird da ein bisschen geflamed aber es ist"}, {"id": 613, "start": 5571.8, "end": 5575.88, "text": "jetzt nicht so als wäre das so ultra toxik dass permanent die mutter beleidigt wird dass"}, {"id": 614, "start": 5575.88, "end": 5601.6, "text": "du das ausschalten müsstest dann hier keine chance ok ich komme nicht hin"}, {"id": 615, "start": 5601.6, "end": 5615.28, "text": "ich habe schiss leute ich habe richtig schiss keine ahnung wo hier gerade was abgeht ich"}, {"id": 616, "start": 5615.28, "end": 5624.08, "text": "smoke ich nein ah wir haben gelegt das habe ich gar nicht mitbekommen in der zwischenzeit"}, {"id": 617, "start": 5624.08, "end": 5640.12, "text": "die lege henne easy clap so präge leute präge für zen crossing präge präge 30 sekunden"}, {"id": 618, "start": 5640.12, "end": 5653.96, "text": "zeit für präge wenn genug wenn genug leute im chat prägen zentri senkos 64 präge wenn"}, {"id": 619, "start": 5653.96, "end": 5660.72, "text": "senkos in durchsicht suchen wir uns einen anderen server das ist nicht level 25 das"}, {"id": 620, "start": 5660.72, "end": 5668.52, "text": "ist kindle level 25 ach so meinst du das ja ach so ja das ist ja nicht hoch das stimmt"}, {"id": 621, "start": 5668.52, "end": 5677.92, "text": "schon das ist auch nicht hoch kindle 25 das liegt daran weil der account tatsächlich"}, {"id": 622, "start": 5677.92, "end": 5685.56, "text": "noch nicht so alt ist die mal ich habe ja die meisten ich habe ja die meisten spielstunden"}, {"id": 623, "start": 5685.56, "end": 5702.28, "text": "ich habe keine ahnung 400 stunden auf der xbox oder so und ich habe smoke dabei fack"}, {"id": 624, "start": 5702.28, "end": 5725.96, "text": "das war ziemlich dumm wo sind wir smoke defense 64 man ist ziemlich pepega moment war das"}, {"id": 625, "start": 5725.96, "end": 5733.08, "text": "dieser dieser granat werfer granat werfer handgranaten werfer launcher dieses ding was niemand aber"}, {"id": 626, "start": 5733.08, "end": 5745.12, "text": "auch wirklich absolut niemand spielt sehe ich das richtig ja was zum geier ist denn hier"}, {"id": 627, "start": 5745.12, "end": 5753.4, "text": "los ok die haben uns ganz schön geschreckt jetzt würde ich mal sagen die haben uns ganz"}, {"id": 628, "start": 5753.4, "end": 5765.48, "text": "schön gebumst am anfang alle hier machst du nix was zum acht der hat über meine klasse"}, {"id": 629, "start": 5765.48, "end": 5791.32, "text": "genommen ey vergesst es 64 mit 64 kranpa sauber monac es da stirbt nix von please ich lebe"}, {"id": 630, "start": 5791.32, "end": 5800.04, "text": "auch keine fünf sekunden hechte heftige monac erstellt hier aber jetzt endlich mal ordentliche"}, {"id": 631, "start": 5800.04, "end": 5807.84, "text": "ordentliche waffe ich finde kranpa sauber defense die base ist ganz gut zu defend aber"}, {"id": 632, "start": 5807.84, "end": 5811.68, "text": "die nächste finde ich richtig krass zu defend die nächste kommst du eigentlich kaum durch"}, {"id": 633, "start": 5811.68, "end": 5818.28, "text": "wenn die eigentlich direkt am anfang überrennen und irgendwie noch was falsch läuft"}, {"id": 634, "start": 5818.28, "end": 5834.96, "text": "holberg bliat bliat gekommnet alter was ist mit den duels los geht ja alles mit rechten"}, {"id": 635, "start": 5834.96, "end": 5861.9, "text": "ding zu wenn der baba ist dauernd ich lasse dich nicht"}, {"id": 636, "start": 5861.9, "end": 5880.8, "text": "retten was alle der captain peng anzeige ist raus man des modding des mod demod mit"}, {"id": 637, "start": 5880.8, "end": 5896.16, "text": "der pumpe sind sie am start hier was haben wir denn was ich habe keine gadgets leute"}, {"id": 638, "start": 5896.16, "end": 5901.12, "text": "ich habe ich habe keine gadgets irgendjemand spielt in der klasse komplett ohne gadgets"}, {"id": 639, "start": 5901.12, "end": 5913.84, "text": "geht das überhaupt kann ich den hier aufheben jawoll noch"}, {"id": 640, "start": 5913.84, "end": 5936.64, "text": "ein shotgun dude mann was ist mit den shotgun leuten los ich dachte mir vielleicht ja ja"}, {"id": 641, "start": 5936.64, "end": 5942.0, "text": "ja ja ja ja please nicht retten fliegt noch lasst mich in ruhe lasst mich einfach liegen"}, {"id": 642, "start": 5942.0, "end": 5947.88, "text": "ich will respawn ich lasse mich respawn please respawn lasst mich respawn ja da ist tx gg"}, {"id": 643, "start": 5947.88, "end": 5961.6, "text": "jetzt halten wir die hier gerade kommt ein stückchen zurück ein stückchen also hier"}, {"id": 644, "start": 5961.6, "end": 5966.28, "text": "muss man sich tatsächlich ein bisschen aufzupritten aber ich finde es ist einfacher mit die mitte"}, {"id": 645, "start": 5966.28, "end": 5975.0, "text": "zu halten als die straße aber meistens ist es so dass auch mehr gegner die mitte pushen"}, {"id": 646, "start": 5975.0, "end": 5983.04, "text": "also das heißt in dem sinn ich gehe ich gehe mal auf die andere seite und wenn die mitte"}, {"id": 647, "start": 5983.04, "end": 5993.28, "text": "pushen dann hoffe ich dass ich es mitkriege okay hier ist von verloren eigentlich also"}, {"id": 648, "start": 5993.28, "end": 5998.36, "text": "zumindest die die straße wir müssen jetzt ein bisschen an die ecke hier vorne ist immer"}, {"id": 649, "start": 5998.36, "end": 6020.72, "text": "noch gut conquest ist tatsächlich ganz nice so erstmal schön spotten bitte was bitte"}, {"id": 650, "start": 6020.72, "end": 6036.08, "text": "was shotgun slug headshot oder pence mann ist da der pence mann ist da leute"}, {"id": 651, "start": 6036.08, "end": 6055.12, "text": "ich habe mich hier mal wie sieht es in der mitte aus in der mitte sterben auch ein paar"}, {"id": 652, "start": 6055.12, "end": 6076.44, "text": "leute erstmal alles so pressen was geht da ist übrigens jetzt die top posi ich gehe"}, {"id": 653, "start": 6076.44, "end": 6083.0, "text": "mal ich gehe mal in die mitte gucken was da so abgeht das ist mit ja nach der runde"}, {"id": 654, "start": 6083.0, "end": 6097.6, "text": "nach der runde suche ich ein suchen wir uns einen neuen server nach der runde suchen wir"}, {"id": 655, "start": 6097.6, "end": 6125.24, "text": "uns neuen server machen neuen server voll trost ich doch ich sehe nichts leute"}, {"id": 656, "start": 6125.24, "end": 6136.68, "text": "wie ich einfach mal wusste dass da was ist ein nicer wallhack"}, {"id": 657, "start": 6155.24, "end": 6162.2, "text": "alles klar alles klar obvios was hier gerade passiert komplett komplett logisch komplett"}, {"id": 658, "start": 6162.2, "end": 6170.2, "text": "logisch überhaupt keine frage also chat ich glaube euch ist auch allen klar was gerade"}, {"id": 659, "start": 6170.2, "end": 6188.88, "text": "passiert ist vollkommen easy durch zu blicken easy as fuck"}, {"id": 660, "start": 6188.88, "end": 6216.96, "text": "der chat wenn die map in 64 mark ist kaputt ja stimmt schon das stimmt schon"}, {"id": 661, "start": 6216.96, "end": 6241.8, "text": "vielleicht hätten wir was"}, {"id": 662, "start": 6241.8, "end": 6252.36, "text": "blickste wirklich immer durch easy einfach einfach auf rote punkte einfach auf rote"}, {"id": 663, "start": 6252.36, "end": 6264.16, "text": "punkte schießen so ist das top easy einfach rote punkte schießen beste posi am start"}, {"id": 664, "start": 6264.16, "end": 6274.2, "text": "wieder einfach mit der m16 in eine richtung schießen das ist absolut high skill hier"}, {"id": 665, "start": 6274.2, "end": 6284.68, "text": "das soll mir keiner was anderes sagen kann nicht jeder da musste schon da musste schon"}, {"id": 666, "start": 6284.68, "end": 6289.44, "text": "das game mindestens 1000 stunden plus gespielt haben dass du das dass du das auf die reihe"}, {"id": 667, "start": 6289.44, "end": 6310.16, "text": "kriegst achtung wir raschen da jetzt rein"}, {"id": 668, "start": 6310.16, "end": 6337.64, "text": "die sind doch immer noch da hinten drin wusste ich doch klar wo die stellsten was die haben"}, {"id": 669, "start": 6337.64, "end": 6348.76, "text": "gesetzt wie können die die lege hände hier machen gerade ihr könnt auch nicht einfach"}, {"id": 670, "start": 6348.76, "end": 6360.24, "text": "lege hände hinter meinem rücken machen das glaube ich doch jetzt nicht das glaube ich"}, {"id": 671, "start": 6360.24, "end": 6387.48, "text": "hat da waren die einfach lege hände"}, {"id": 672, "start": 6387.48, "end": 6400.16, "text": "einfach hier sitzt so gerade ausschießen high skill gameplay leute hier richtig exzellent"}, {"id": 673, "start": 6400.16, "end": 6419.84, "text": "high skill gameplay und dieser screen shake weggerotzt"}, {"id": 674, "start": 6419.84, "end": 6426.36, "text": "jemand hier einfach doch einfach nur geradeaus einfach nur gerade aussprayen man einfach"}, {"id": 675, "start": 6426.36, "end": 6430.32, "text": "nur gerade aussprayen da ist nix dabei guck mal da lebt wieder einer ich hab ich hab's"}, {"id": 676, "start": 6430.32, "end": 6439.32, "text": "zucken sehen"}, {"id": 677, "start": 6439.32, "end": 6454.56, "text": "das ist so der das ist so dumm high skill leute high skill cap haben wir's bald ich hoffe"}, {"id": 678, "start": 6454.56, "end": 6461.32, "text": "wir haben's bald da sind noch welche da sind noch welche komm streck deinen kopf raus"}, {"id": 679, "start": 6461.32, "end": 6472.44, "text": "jawoll also bei wo ich hab kein dieser kills wirklich irgendwie verdient ich schieße"}, {"id": 680, "start": 6472.44, "end": 6477.56, "text": "im prinzip immer nur auf einen punkt geradeaus jetzt kommen die z4 jungs acht jetzt wird"}, {"id": 681, "start": 6477.56, "end": 6498.12, "text": "gepusht push action pusherino nice wir müssen back gepusht haben gachi bus gachi bus weg"}, {"id": 682, "start": 6498.12, "end": 6515.16, "text": "gepusht haben wir sie"}, {"id": 683, "start": 6515.16, "end": 6518.72, "text": "ok das ist ein bug das sieht aus wie ein gegner ist aber kein gegner"}, {"id": 684, "start": 6518.72, "end": 6535.0, "text": "man kann es ja mal probieren ok wir haben es gleich leute danach suchen wir uns ein 32"}, {"id": 685, "start": 6535.0, "end": 6549.92, "text": "mann server und machen den voll weil auf basar attacker runde noch mal ne ne ne ne es reicht"}, {"id": 686, "start": 6549.92, "end": 6554.92, "text": "es reicht"}, {"id": 687, "start": 6554.92, "end": 6562.92, "text": "ja die map ist halt nix für 64 also 64 mann conquest geht eigentlich aber was halt überhaupt"}, {"id": 688, "start": 6562.92, "end": 6564.92, "text": "nicht geht ist 64 mann rush"}, {"id": 689, "start": 6564.92, "end": 6569.48, "text": "ach komm wir gucken mal was auf der anderen seite der map geht"}, {"id": 690, "start": 6569.48, "end": 6595.48, "text": "irgendwas im hals stecken gachi gasm"}, {"id": 691, "start": 6595.48, "end": 6603.44, "text": "ok leute wir suchen uns jetzt einen neuen server"}, {"id": 692, "start": 6603.44, "end": 6607.68, "text": "ich bleib mal hier drinnen und mal gucken was es was es gibt refresh"}, {"id": 693, "start": 6607.68, "end": 6626.2, "text": "also irgendwas was halt irgendwas mit gutem ping und was leer ist wir können auch einfach"}, {"id": 694, "start": 6626.2, "end": 6637.72, "text": "auf den 64 mann conquest zeigt mal hier was haben wir denn für gute rush server"}, {"id": 695, "start": 6637.72, "end": 6658.56, "text": "gibt nicht so viele leute empty empty"}, {"id": 696, "start": 6658.56, "end": 6673.04, "text": "es gibt ja kaum rush server noch oder ist die suche verbackt"}, {"id": 697, "start": 6673.04, "end": 6694.48, "text": "ja ja ich suche ja einen leeren"}, {"id": 698, "start": 6694.48, "end": 6697.48, "text": "free for all"}, {"id": 699, "start": 6697.48, "end": 6707.44, "text": "leute ich fürchte es gibt keinen server mehr auf dem wir spielen können"}, {"id": 700, "start": 6707.44, "end": 6712.44, "text": "suchen wir mal suchen wir mal suchen wir mal suchen wir mal einen leeren conquest server"}, {"id": 701, "start": 6712.44, "end": 6717.44, "text": "wo wir drauf können"}, {"id": 702, "start": 6717.44, "end": 6728.32, "text": "ne venice kann ich nicht machen die meisten leute haben hier kein venice installiert"}, {"id": 703, "start": 6728.32, "end": 6729.32, "text": "eu rusher"}, {"id": 704, "start": 6729.32, "end": 6738.12, "text": "conquest large caspian borders no rules noob nein"}, {"id": 705, "start": 6738.12, "end": 6748.2, "text": "die map rotations sucked"}, {"id": 706, "start": 6748.2, "end": 6750.52, "text": "naja die map rotations ist jetzt anders so geil"}, {"id": 707, "start": 6750.52, "end": 6761.84, "text": "pcgamer.com aber ich hab ein 15er ping auf den united states server"}, {"id": 708, "start": 6761.84, "end": 6775.96, "text": "best hitrack alles klar"}, {"id": 709, "start": 6775.96, "end": 6780.24, "text": "den 32er conquest ist blöd 32er rush gibt's keine"}, {"id": 710, "start": 6780.24, "end": 6792.36, "text": "kann man hier suchen nach"}, {"id": 711, "start": 6792.36, "end": 6794.48, "text": "game size 64 machen wir mal so"}, {"id": 712, "start": 6794.48, "end": 6804.32, "text": "ok was was haben wir hier zu bieten ist viel viel ist es ja nicht hier den konnten wir"}, {"id": 713, "start": 6804.32, "end": 6813.6, "text": "nehmen bf3 birthday 10 years of pc bf3 bazaar karkent firestorm das wellina meinetwegen"}, {"id": 714, "start": 6813.6, "end": 6821.52, "text": "ok das ist das erscheint mir doch als ganz sinnige mischung"}, {"id": 715, "start": 6821.52, "end": 6829.68, "text": "so eine mischung aus allem möglichen also hier bf3 birthday 10 years bf3 pc join"}, {"id": 716, "start": 6829.68, "end": 6834.84, "text": "die dlcs hat glaub ich fast jeder"}, {"id": 717, "start": 6834.84, "end": 6838.88, "text": "die waren ja nicht sogar kostenlos mit premium"}, {"id": 718, "start": 6838.88, "end": 6848.72, "text": "das ist immer welche gibt die sie nicht haben"}, {"id": 719, "start": 6848.72, "end": 6850.72, "text": "ok aber die meisten haben glaub ich die dlcs"}, {"id": 720, "start": 6850.72, "end": 6855.28, "text": "aber das andere den anderen sinnigen server gibt's ja hier nicht"}, {"id": 721, "start": 6855.28, "end": 6862.72, "text": "sonst hätte ich den anderen genommen danach noch mal gucken"}, {"id": 722, "start": 6862.72, "end": 6863.72, "text": "so leute auf geht's"}, {"id": 723, "start": 6863.72, "end": 6890.28, "text": "du weißt ja was das schlimme ist die straße hier die sieht detaillierter aus als strassen"}, {"id": 724, "start": 6890.28, "end": 6902.24, "text": "in bf 2042 maps"}, {"id": 725, "start": 6902.24, "end": 6932.2, "text": "ohm scheiß drauf m16"}, {"id": 726, "start": 6932.2, "end": 6946.56, "text": "versucht das bf 7 zu m gehen aber das geht nicht richtig oder"}, {"id": 727, "start": 6946.56, "end": 6957.56, "text": "funktioniert nicht wirklich"}, {"id": 728, "start": 6957.56, "end": 6979.76, "text": "auf wahrscheinlich habe ich jetzt die ganzen ultra pros hier drauf"}, {"id": 729, "start": 6979.76, "end": 6991.68, "text": "das hat ja keinen sinn in den lv zu rennen leute"}, {"id": 730, "start": 6991.68, "end": 6996.24, "text": "in den lv rennen ist ziemlich ppega"}, {"id": 731, "start": 6996.24, "end": 7015.32, "text": "ppega mich juckt seine nass"}, {"id": 732, "start": 7015.32, "end": 7042.0, "text": "schnauze"}, {"id": 733, "start": 7042.0, "end": 7048.08, "text": "wie gesagt macht ruhig den surfer voll, wenn wir den surfer nicht voll kriegen dann hat es ja keinen sinn dass ich jetzt auf einen leeren surfer gegangen bin"}, {"id": 734, "start": 7060.08, "end": 7062.08, "text": "Was mit dem los"}, {"id": 735, "start": 7065.16, "end": 7067.16, "text": "Wie heißt der surfer, dass der hier"}, {"id": 736, "start": 7067.16, "end": 7073.92, "text": "Bf3 birthday 10 years of bf3 pc"}, {"id": 737, "start": 7073.92, "end": 7093.28, "text": "Ja alles klar genau bf3 bf3 10 years of bf3 pc"}, {"id": 738, "start": 7093.28, "end": 7105.28, "text": "easy eats eats eats eats eats"}, {"id": 739, "start": 7105.28, "end": 7107.28, "text": "Moment ich will immer noch rutschen"}, {"id": 740, "start": 7107.28, "end": 7119.28, "text": "Dabei ist rutschen ja nichts mehr hier in oder war rutschen noch nichts in bf3 was ich eigentlich auch ganz gut finde ich finde dieses hüppen fast besser als das rutschen"}, {"id": 741, "start": 7119.28, "end": 7124.28, "text": "Das rutschen ist so wir wollen krampf auf warzone sein"}, {"id": 742, "start": 7124.28, "end": 7127.28, "text": "Ich weiß dass das rutschen auch in bf5 gab"}, {"id": 743, "start": 7131.28, "end": 7133.28, "text": "Aber trotzdem"}, {"id": 744, "start": 7133.28, "end": 7151.28, "text": "Was ist da vorne los"}, {"id": 745, "start": 7151.28, "end": 7164.28, "text": "Ich sehe gerade geschnass aber es füllt sich langsam"}, {"id": 746, "start": 7164.28, "end": 7173.28, "text": "Ja ja gut Kollege ist gut Kollege alles klar alles klar"}, {"id": 747, "start": 7173.28, "end": 7182.28, "text": "Eigentlich wollte ich mal hier hochstelzen siehste das dachte ich mir zum Glück und zum Glück hat er mich nicht getroffen richtig"}, {"id": 748, "start": 7192.28, "end": 7194.28, "text": "Oh wie er das wusste alter"}, {"id": 749, "start": 7194.28, "end": 7201.28, "text": "Gab es das rutschen nicht schon in bf1 das ist eine gute frage"}, {"id": 750, "start": 7201.28, "end": 7207.28, "text": "Ich weiß nicht ich habe bf1 so gut wie nicht gespielt"}, {"id": 751, "start": 7207.28, "end": 7213.28, "text": "Ich weiß nicht ob man das schon rutschen konnte konnte man chat das müsst ihr wissen konnte man schon rutschen in bf1"}, {"id": 752, "start": 7213.28, "end": 7238.28, "text": "Lass den rutschstelz machen"}, {"id": 753, "start": 7238.28, "end": 7263.28, "text": "Jetzt haben wir es geben"}, {"id": 754, "start": 7263.28, "end": 7273.28, "text": "Was ist denn hier los"}, {"id": 755, "start": 7273.28, "end": 7295.28, "text": "Soll man nicht voll kriegen dann suche ich mir was anderes weil es ist halt doof mein acht vs acht muss muss nicht sein"}, {"id": 756, "start": 7295.28, "end": 7314.28, "text": "Was ist mit euch los warum wird hier gang bang von beiden seiten gemacht"}, {"id": 757, "start": 7314.28, "end": 7340.28, "text": "Hinten gemacht"}, {"id": 758, "start": 7340.28, "end": 7355.04, "text": "Oh, von hinten, fuck, in the bobs."}, {"id": 759, "start": 7355.04, "end": 7358.68, "text": "Nee Leute, ich glaub das kriegen wir nicht voll."}, {"id": 760, "start": 7358.68, "end": 7364.44, "text": "Das kriegen wir glaube ich nicht voll."}, {"id": 761, "start": 7364.44, "end": 7369.24, "text": "Ja es gibt leider keinen anderen Surfer."}, {"id": 762, "start": 7369.24, "end": 7374.48, "text": "Wobei ich finde er hat eine coole Map-Rotation, ja wenn ihr keine DLCs habt geht das nicht."}, {"id": 763, "start": 7374.48, "end": 7376.6, "text": "Aber es gibt auch keinen anderen Surfer, das ist das Problem."}, {"id": 764, "start": 7376.6, "end": 7391.72, "text": "Was wir haben deren LLV, easy, denn ich will meinen Flank aussparen können."}, {"id": 765, "start": 7391.72, "end": 7411.08, "text": "Nee, ich würde die DLCs jetzt nicht kaufen für so ein altes Game."}, {"id": 766, "start": 7411.08, "end": 7418.28, "text": "Nee, es gibt keinen anderen Surfer Leute, es gibt keinen anderen Surfer."}, {"id": 767, "start": 7418.28, "end": 7423.44, "text": "Wir haben die, wir haben volle Surfer, aber wir haben keinen leeren Surfer wo man nicht"}, {"id": 768, "start": 7423.44, "end": 7424.44, "text": "die DLCs braucht."}, {"id": 769, "start": 7424.44, "end": 7440.8, "text": "Meine Lieblings Posi Leute, beste, beste Posi hier, beste Posi, guck her da sind sie"}, {"id": 770, "start": 7440.8, "end": 7441.8, "text": "schon."}, {"id": 771, "start": 7441.8, "end": 7455.44, "text": "Habt ihr den gesehen?"}, {"id": 772, "start": 7455.44, "end": 7456.44, "text": "Ich nicht."}, {"id": 773, "start": 7456.44, "end": 7466.64, "text": "Ich hab einfach nur random in die Richtung geschossen weil ich gedacht hab ich hab was"}, {"id": 774, "start": 7466.64, "end": 7468.64, "text": "gesehen, aber anscheinend war das echt."}, {"id": 775, "start": 7468.64, "end": 7474.56, "text": "Okay wir müssen das, wir müssen das protekten."}, {"id": 776, "start": 7474.56, "end": 7492.56, "text": "Nope, nope, nope, nope, nope, nope, ah es füllt sich, es füllt sich, es füllt sich."}, {"id": 777, "start": 7492.56, "end": 7500.16, "text": "Oder wenn die Leute heute wieder Hardcore getriggert gewesen hätten, dann hätten die"}, {"id": 778, "start": 7500.16, "end": 7501.64, "text": "das in Battlefield 2042 gesagt."}, {"id": 779, "start": 7501.64, "end": 7519.84, "text": "Oh shit, ich dachte ich komm noch um die Ecke, nee den hab ich auch gesehen, Caspian Border"}, {"id": 780, "start": 7519.84, "end": 7524.0, "text": "Only war das Ding, nee, nee nicht Caspian, es waren zwei Maps, Caspian Border und noch"}, {"id": 781, "start": 7524.0, "end": 7527.52, "text": "irgendwas, das ist aber auch dumm, das will ich auch nicht in der Dauerrotation spielen."}, {"id": 782, "start": 7527.52, "end": 7541.52, "text": "Wow, hoho, FJ hast du nicht mit uns letzten Stings gespielt, Battlefield 2042, der Name"}, {"id": 783, "start": 7541.52, "end": 7542.52, "text": "kommt mir bekannt vor."}, {"id": 784, "start": 7542.52, "end": 7552.84, "text": "Warst du nicht der der mit der AK-24 da so abgegangen ist, doch ich glaub ja, doch, doch"}, {"id": 785, "start": 7552.84, "end": 7571.52, "text": "ich erinnere mich, ich erinnere mich, so mal gucken wie es ausschaut, wird das noch irgendwie"}, {"id": 786, "start": 7571.52, "end": 7572.52, "text": "voll kriegen hier?"}, {"id": 787, "start": 7572.52, "end": 7582.16, "text": "Eigentlich hat es ja auch keinen Sinn sich immer da um die Mitte zu kloppen."}, {"id": 788, "start": 7582.16, "end": 7593.36, "text": "Muss mal die anderen Dinge auch Captchern."}, {"id": 789, "start": 7593.36, "end": 7618.64, "text": "Battlefield please, auf Captchern, gib ihm, nice, ok hier vorne wird gebashed, mal außen"}, {"id": 790, "start": 7618.64, "end": 7648.56, "text": "rumflanken, a 10 10, schau ma mal, oh gatchi bus, Leute gatchi bus, gatchi bus, gatchi bus,"}, {"id": 791, "start": 7648.56, "end": 7676.68, "text": "gatchi bus, gatchi bus, gatchi bus, gatchi bus, oh fuck,icher hast probiert, oh nice res."}, {"id": 792, "start": 7676.68, "end": 7697.8, "text": "ich glaube es nicht sitzen immer noch da sind wir noch 10 10"}, {"id": 793, "start": 7706.68, "end": 7735.96, "text": "die leben doch noch"}, {"id": 794, "start": 7736.68, "end": 7746.56, "text": "Ah, guck mal, schon wieder noch mehr Spieler."}, {"id": 795, "start": 7746.56, "end": 7750.72, "text": "Ich hoffe wir kriegen das Ding voll."}, {"id": 796, "start": 7750.72, "end": 7764.12, "text": "Ich hab ein Problem, ich hab keine Muni mehr."}, {"id": 797, "start": 7764.12, "end": 7768.88, "text": "Das kommt äußerst selten vor eigentlich in dem Game."}, {"id": 798, "start": 7768.88, "end": 7774.44, "text": "Das kommt wirklich nicht oft vor."}, {"id": 799, "start": 7774.44, "end": 7777.64, "text": "Kann einer droppen?"}, {"id": 800, "start": 7777.64, "end": 7781.28, "text": "Nee, ich glaub wir haben gar keinen mit Munistells am Start."}, {"id": 801, "start": 7781.28, "end": 7804.12, "text": "Ah gut, gehen wir mal hier runter."}, {"id": 802, "start": 7804.12, "end": 7807.52, "text": "Ohne 3D-Spotting wäre man lost, ja."}, {"id": 803, "start": 7807.52, "end": 7814.32, "text": "Aber ich finde es trotzdem, auch wenn das OP erst fuck ist mit dem 3D-Spotting, finde"}, {"id": 804, "start": 7814.32, "end": 7818.24, "text": "ich trotzdem besser als dieses komische Motion-Sensor gespottet."}, {"id": 805, "start": 7818.24, "end": 7824.72, "text": "In Battlefield 2049 bist du entweder quasi permanent gespottet und weißt es nicht so"}, {"id": 806, "start": 7824.72, "end": 7825.72, "text": "richtig."}, {"id": 807, "start": 7825.72, "end": 7841.12, "text": "Oder bist du aus anderen Gründen Gachibust um die Ecke?"}, {"id": 808, "start": 7841.12, "end": 7842.12, "text": "Okay der hat's nicht so."}, {"id": 809, "start": 7842.12, "end": 7844.0, "text": "Fuck."}, {"id": 810, "start": 7844.0, "end": 7853.84, "text": "Ich dachte ich kann den Jumpshot irgendwie um die Ecke."}, {"id": 811, "start": 7853.84, "end": 7860.52, "text": "Was ist Gachibust, gib es doch mal ein im Chat."}, {"id": 812, "start": 7860.52, "end": 7864.56, "text": "Ja das ist eines meiner Standard-Emotes."}, {"id": 813, "start": 7864.56, "end": 7867.56, "text": "Gachibust."}, {"id": 814, "start": 7867.56, "end": 7877.52, "text": "Ey Leute, wo ist denn die Rex?"}, {"id": 815, "start": 7877.52, "end": 7885.48, "text": "Bin ich blöd, wo ist denn die?"}, {"id": 816, "start": 7885.48, "end": 7890.76, "text": "Hab ich die nicht?"}, {"id": 817, "start": 7890.76, "end": 7891.76, "text": "Kann das sein, dass ich die nicht hab?"}, {"id": 818, "start": 7891.76, "end": 7897.0, "text": "Wo hab ich die nicht?"}, {"id": 819, "start": 7897.0, "end": 7920.36, "text": "Ist das die Co-Op Waffe, oh nein, ich hab wirklich auf dem Account keine Co-Op."}, {"id": 820, "start": 7920.36, "end": 7924.48, "text": "Na gut, okay Chat ihr wisst was demnächst ansteht, wir müssen Co-Op spielen."}, {"id": 821, "start": 7924.48, "end": 7933.4, "text": "Opfert sich einer mit mir Co-Op."}, {"id": 822, "start": 7933.4, "end": 7949.36, "text": "Joa, ging das voll, also sag mal so die Hälfte, knapp die Hälfte des Servers ist voll."}, {"id": 823, "start": 7949.36, "end": 7961.6, "text": "Aber wir sind schon aufgerundet ja."}, {"id": 824, "start": 7961.6, "end": 7966.16, "text": "Null Dankeschön OpM16, KeckWade."}, {"id": 825, "start": 7966.16, "end": 7982.6, "text": "Op tut es schnicks, woa, woa, woa, okay, okay, das ist natürlich doof, über Bande."}, {"id": 826, "start": 7982.6, "end": 8004.68, "text": "Oh shit, oh oh, oh von hinten."}, {"id": 827, "start": 8004.68, "end": 8026.64, "text": "Oh fuck, kommt sich ja vor wie ein CS hier beim"}, {"id": 828, "start": 8026.64, "end": 8045.08, "text": "eckigen Ab-Aim."}, {"id": 829, "start": 8045.08, "end": 8048.08, "text": "Der Rest."}, {"id": 830, "start": 8048.08, "end": 8061.12, "text": "Alter Schneiber, man das war nix."}, {"id": 831, "start": 8061.12, "end": 8070.72, "text": "Ey das Ding ist schon krass, Op, oh der hat uns weggesprayt, der Buschwuggy."}, {"id": 832, "start": 8070.72, "end": 8083.44, "text": "G3A3, ich hab hier auf dem Account auch nicht alles unlockt."}, {"id": 833, "start": 8083.44, "end": 8104.32, "text": "Okay, beweg dich, 11, 11, also egal wir spielen das jetzt einfach, vielleicht kriegen wir"}, {"id": 834, "start": 8104.32, "end": 8114.5, "text": "das hier, Captain Poggers, Massive Poggers Driving."}, {"id": 835, "start": 8114.5, "end": 8118.4, "text": "Ah das hast du dir so gedacht."}, {"id": 836, "start": 8118.4, "end": 8124.4, "text": "Hallo."}, {"id": 837, "start": 8124.4, "end": 8127.78, "text": "Massive Skillwaffen, Skillwaffen only heute."}, {"id": 838, "start": 8127.78, "end": 8139.64, "text": "Ihr sehts, heute ist nur ein 94, Scar, Sniper, G3, ihr seht heute keine Lowskillwaffen wie"}, {"id": 839, "start": 8139.64, "end": 8144.64, "text": "M16."}, {"id": 840, "start": 8144.64, "end": 8151.52, "text": "Ausgeschlossen heute, only wins und only highskill, wie man gerade gesehen hat."}, {"id": 841, "start": 8151.52, "end": 8178.4, "text": "Mit der Magnum, oh und der ASC, der ASC shootet."}, {"id": 842, "start": 8178.4, "end": 8196.92, "text": "Pray, dass wir den Server vollkriegen, so ne richtig fette 64m Conquest Runde mit allen"}, {"id": 843, "start": 8196.92, "end": 8200.08, "text": "aus dem Chat wär schon echt ziemlicher Pog."}, {"id": 844, "start": 8200.08, "end": 8217.84, "text": "Ziemlicher Pog, Pogge wär das, Pogge."}, {"id": 845, "start": 8217.84, "end": 8236.64, "text": "Oh fuck, ich hab mich reloaded."}, {"id": 846, "start": 8236.64, "end": 8257.96, "text": "Der ist doch noch da hinten drinnen, oder?"}, {"id": 847, "start": 8257.96, "end": 8265.92, "text": "Da stellts doch einer von euch hier, nö."}, {"id": 848, "start": 8265.92, "end": 8273.4, "text": "Hab nix gesagt, ok die Leute lieven schon wieder, das wär doch nix mit vollem Server,"}, {"id": 849, "start": 8273.4, "end": 8278.12, "text": "das ist nicht VU, ne ich hab extra nicht VU gestartet, weil ich mir gedacht hab es ist"}, {"id": 850, "start": 8278.12, "end": 8279.44, "text": "einfacher hier Leute zu finden."}, {"id": 851, "start": 8279.44, "end": 8292.52, "text": "No Pass, aber es könnten jetzt ja auch mal langsam Leute außen, ja klar M16, ne heute"}, {"id": 852, "start": 8292.52, "end": 8302.84, "text": "ist nicht M16, weiß gar nicht wo du M16 siehst, ich seh hier keine, ah von hinten, ich seh"}, {"id": 853, "start": 8302.84, "end": 8303.84, "text": "hier keine M16."}, {"id": 854, "start": 8303.84, "end": 8314.48, "text": "Wie heißt der Server, achja Leute hier, bf3 birthday 10 years of bf3 pc, Link im Chat,"}, {"id": 855, "start": 8314.48, "end": 8331.0, "text": "ne, mein copy paste funktioniert nicht, mein copy paste klappt nicht, 1, mein copy paste"}, {"id": 856, "start": 8331.0, "end": 8352.32, "text": "ist broken, af, oh, ja der hier aber, also wenn wir das nicht voll kriegen, in 10 minuten"}, {"id": 857, "start": 8352.32, "end": 8361.52, "text": "suche ich mir noch für die restlichen abends was anderes, also um 20 nach, also was heißt"}, {"id": 858, "start": 8361.52, "end": 8362.52, "text": "voll."}, {"id": 859, "start": 8362.52, "end": 8366.52, "text": "Sagen wir mal nennenswert, hallo spring, spring, nennenswert, nennenswert gefüllt."}, {"id": 860, "start": 8366.52, "end": 8390.24, "text": "Sagen wir mal 30, 40 plus Leute, ich hab ihn immer gesehen."}, {"id": 861, "start": 8390.24, "end": 8406.92, "text": "Oh oh, da kommt ein Auto, das ist ziemlich, ziemlich pain's jam, ne das bekomm man Leute,"}, {"id": 862, "start": 8406.92, "end": 8414.64, "text": "den kriegen wir nicht voll, den kriegen wir nicht voll, das hat keinen Sinn, feels Batman,"}, {"id": 863, "start": 8414.64, "end": 8444.4, "text": "feels zu wenig Leute, seriously, seriously, die sind hinter uns gespawnt, lul, nice gg,"}, {"id": 864, "start": 8444.4, "end": 8449.28, "text": "na jetzt sind wieder ein paar gejohnt."}, {"id": 865, "start": 8474.4, "end": 8491.84, "text": "Alter die farmen sich hier ein ab."}, {"id": 866, "start": 8491.84, "end": 8517.36, "text": "Oh das war meine eigene, keck wait, ne wir kriegen das nicht voll, das sackt doch, was"}, {"id": 867, "start": 8517.36, "end": 8523.28, "text": "können wir denn sonst, hat jemand noch ne gute serveridee Leute, irgendwas, weil noch"}, {"id": 868, "start": 8523.28, "end": 8529.4, "text": "mal 64 man conquest, äh nicht 64 man conquest, äh noch mal 64 man irgendwie bazaar oder"}, {"id": 869, "start": 8529.4, "end": 8534.36, "text": "so hab ich kein bock drauf, und auf 64 man metro hält sich mein bock auch hinkränzen"}, {"id": 870, "start": 8534.36, "end": 8535.36, "text": "muss ich ehrlich sagen."}, {"id": 871, "start": 8535.36, "end": 8565.08, "text": "64 man metro ist nicht so enjoyer modus, was sind die alle down, spawnen bestimmt jetzt"}, {"id": 872, "start": 8565.08, "end": 8568.22, "text": "auch werder."}, {"id": 873, "start": 8569.22, "end": 8570.22, "text": "0"}, {"id": 874, "start": 8572.22, "end": 8573.22, "text": "0"}, {"id": 875, "start": 8575.22, "end": 8576.22, "text": "0"}, {"id": 876, "start": 8577.22, "end": 8578.22, "text": "0"}, {"id": 877, "start": 8580.22, "end": 8581.22, "text": "0"}, {"id": 878, "start": 8583.22, "end": 8584.22, "text": "0"}, {"id": 879, "start": 8586.22, "end": 8587.22, "text": "0"}, {"id": 880, "start": 8588.22, "end": 8589.22, "text": "0"}, {"id": 881, "start": 8590.22, "end": 8591.22, "text": "0"}, {"id": 882, "start": 8593.22, "end": 8594.22, "text": "0"}, {"id": 883, "start": 8595.22, "end": 8596.22, "text": "0"}, {"id": 884, "start": 8596.22, "end": 8601.86, "text": "haben wir es bald"}, {"id": 885, "start": 8601.86, "end": 8610.1, "text": "haben wir es haben wir es bald"}, {"id": 886, "start": 8610.1, "end": 8621.66, "text": "haben wir es heute haben wir es heute noch mal"}, {"id": 887, "start": 8621.66, "end": 8641.78, "text": "ja die sollen die dlc einfach mal kostenlos verteilen ich meine allen ernst"}, {"id": 888, "start": 8641.78, "end": 8645.78, "text": "dass das game ist zehn jahre alt wer sich jetzt die dlc nicht gekauft hat"}, {"id": 889, "start": 8645.78, "end": 8660.78, "text": "jetzt die dlc auch nicht mehr kaufen oder ist das auto"}, {"id": 890, "start": 8660.78, "end": 8672.58, "text": "das ist dumm ich suche mir da ich suche jetzt einen anderen zauber wir sind wir"}, {"id": 891, "start": 8672.58, "end": 8679.66, "text": "quasi seit eine viertel stunde die kleinen spieleranzahl ja ich suche jetzt"}, {"id": 892, "start": 8679.66, "end": 8687.34, "text": "anderen zu aber was sehen wir denn jetzt zeig doch mal ja"}, {"id": 893, "start": 8687.34, "end": 8691.46, "text": "alles ich nehme alles leute"}, {"id": 894, "start": 8693.46, "end": 8698.78, "text": "es gibt kein zauber mit dem base game das ist ja das problem dann hätte ich"}, {"id": 895, "start": 8698.78, "end": 8704.7, "text": "den ja genommen gibt es nicht es gab keinen 64 mann konquest aber mit dem"}, {"id": 896, "start": 8704.7, "end": 8712.3, "text": "base game mit einer guten rotation und der lever ich glaube das kriegst ja nicht"}, {"id": 897, "start": 8712.3, "end": 8716.94, "text": "so viele leute drauf also was schnappen was sehen wir jetzt"}, {"id": 898, "start": 8716.94, "end": 8722.06, "text": "noch mal für die letzten paar runden also eher legends auf jeden fall nicht"}, {"id": 899, "start": 8722.06, "end": 8733.7, "text": "metro only auch nicht"}, {"id": 900, "start": 8733.7, "end": 8737.62, "text": "konquest large markas molin ich die map finde ich jetzt nicht so geil"}, {"id": 901, "start": 8737.62, "end": 8744.02, "text": "warum gibt es da eigentlich eigentlich surfer was nix was nix anderes hat mit"}, {"id": 902, "start": 8745.9, "end": 8748.9, "text": "mit der rotation"}, {"id": 903, "start": 8748.9, "end": 8755.7, "text": "ich habe es doch probiert den selber zu füllen ging nicht"}, {"id": 904, "start": 8757.42, "end": 8761.22, "text": "eierstorm habe ich auch keinen bock drauf"}, {"id": 905, "start": 8761.9, "end": 8764.9, "text": "es gibt ja nix"}, {"id": 906, "start": 8764.9, "end": 8776.3, "text": "es gibt nichts was wir spielen könnten"}, {"id": 907, "start": 8787.66, "end": 8794.34, "text": "aber noch einen haben wir noch einen 32 rush"}, {"id": 908, "start": 8794.34, "end": 8797.34, "text": "vielleicht"}, {"id": 909, "start": 8803.14, "end": 8807.1, "text": "bier und rush aber das ist das ist in kokona so aber da hab ich einen scheiß ping"}, {"id": 910, "start": 8807.1, "end": 8812.74, "text": "drauf dem aber wenn pg metro abwechseln ich gucke mal kurz wieder mein ping ist"}, {"id": 911, "start": 8812.74, "end": 8815.3, "text": "wenn ich drauf bin"}, {"id": 912, "start": 8816.5, "end": 8822.38, "text": "backbattlefield 3 ich habe heute die auswahl zwischen"}, {"id": 913, "start": 8822.38, "end": 8827.58, "text": "battlefield 20 42 und battlefield 3 habe ich so gedacht weißt du was wir spielen"}, {"id": 914, "start": 8827.58, "end": 8830.58, "text": "wir wieder eine runde battlefield 3"}, {"id": 915, "start": 8832.22, "end": 8836.46, "text": "ob ich den ordentlichen ping habe aber ich finde keinen gescheiten surfer den"}, {"id": 916, "start": 8836.46, "end": 8847.66, "text": "ich spielen will ziemlich sagt 115 ping ja ganz bestimmt"}, {"id": 917, "start": 8847.66, "end": 8852.66, "text": "ganz bestimmt ganz bestimmt"}, {"id": 918, "start": 8854.18, "end": 8857.22, "text": "ja leute es bleibt uns wohl nichts anderes übrig als diesen müll zu"}, {"id": 919, "start": 8857.22, "end": 8861.5, "text": "spielen von wegen 64 mann rush"}, {"id": 920, "start": 8868.9, "end": 8874.62, "text": "was haben die für eine rotation armord schild banda desert halbos mal acht du"}, {"id": 921, "start": 8874.62, "end": 8881.18, "text": "große kakel was ist denn das ist der schake die einzig geizig gute map"}, {"id": 922, "start": 8887.26, "end": 8892.1, "text": "ja 20 42 kannst du voll knicken"}, {"id": 923, "start": 8894.58, "end": 8897.58, "text": "es gibt nix"}, {"id": 924, "start": 8897.58, "end": 8904.02, "text": "chat es gibt nichts konquest large eine map"}, {"id": 925, "start": 8910.98, "end": 8913.98, "text": "den hier vielleicht"}, {"id": 926, "start": 8915.1, "end": 8918.26, "text": "wobei das halt krass an balance ist den surfer kenn ich da habe ich öfters mal"}, {"id": 927, "start": 8918.26, "end": 8922.78, "text": "drauf gespielt das ist halt wirklich ziemlich pp gar egal wir gehen jetzt"}, {"id": 928, "start": 8922.78, "end": 8930.54, "text": "drauf was anderes bleibt uns nicht übrig reconnect gogo was anderes bleibt uns"}, {"id": 929, "start": 8930.54, "end": 8934.54, "text": "nicht übrig ich will jetzt noch ein zwei runden spielen was wahrscheinlich eine"}, {"id": 930, "start": 8934.54, "end": 8939.54, "text": "runde noch dann ist gut"}, {"id": 931, "start": 8942.42, "end": 8948.02, "text": "selber hosten das dumme ist battlefield 3 surfer"}, {"id": 932, "start": 8948.02, "end": 8953.18, "text": "selber hosten das ist nicht mal gemacht mit wir klicken zwei dreimal bei einem"}, {"id": 933, "start": 8953.18, "end": 8957.18, "text": "host da du musst da schon ein bisschen gedanken zu machen also ich meine es"}, {"id": 934, "start": 8957.18, "end": 8960.46, "text": "nicht nur zu rotation und so was du brauchst ja auch ein paar plugins du"}, {"id": 935, "start": 8960.46, "end": 8963.78, "text": "brauchst die plugins für bands du brauchst vielleicht noch sniper limit und"}, {"id": 936, "start": 8963.78, "end": 8969.26, "text": "sowas das ist dass das da bist du schon mal sagen halb tag mit beschäftigt und"}, {"id": 937, "start": 8969.26, "end": 8974.22, "text": "das lohnt sich im endeffekt auch nicht weil das hat jetzt auch nicht wahnsinnig"}, {"id": 938, "start": 8974.22, "end": 8980.62, "text": "viele kommen sehr balanced sehr balanced wo wir hier drauf sind megabalanced"}, {"id": 939, "start": 8984.02, "end": 8987.02, "text": "huge balanced"}, {"id": 940, "start": 8987.02, "end": 8999.78, "text": "oh oh in den kopf"}, {"id": 941, "start": 8999.78, "end": 9009.7, "text": "wir sind wir haben ja sogar tatsächlich basar konkurs 64 man na dann schauen wir"}, {"id": 942, "start": 9009.7, "end": 9020.82, "text": "mal dann wollen wir mal"}, {"id": 943, "start": 9020.82, "end": 9032.78, "text": "was haben wir eigentlich für den perk set up"}, {"id": 944, "start": 9032.78, "end": 9043.54, "text": "haben wir irgendwas okay das natürlich ziemlich pepega eigentlich aber ok"}, {"id": 945, "start": 9046.3, "end": 9055.1, "text": "liegen sie drin wollte gerade sagen warum warum sie wieder durchgerannt ja"}, {"id": 946, "start": 9055.1, "end": 9059.98, "text": "vu ist der leider leider muss man sagen ist vor der die haben es selbst ein"}, {"id": 947, "start": 9059.98, "end": 9063.1, "text": "bisschen mit verkackt an sich von technischer seite her kann ich echt"}, {"id": 948, "start": 9063.1, "end": 9066.5, "text": "nichts negatives sagen also für das dass es ein mod ist dass es ein fan"}, {"id": 949, "start": 9066.5, "end": 9071.82, "text": "projekt ist wirklich wirklich an sich richtig gut"}, {"id": 950, "start": 9072.3, "end": 9077.02, "text": "das problem ist nur die hatten halt so komische community so was die fast"}, {"id": 951, "start": 9077.02, "end": 9080.62, "text": "alle gesagt haben oder teilweise die admins sogar den sheets ausgepackt haben"}, {"id": 952, "start": 9080.62, "end": 9083.3, "text": "wenn es schlecht lief oder habe ich mal gedacht das kann es ja nur wirklich"}, {"id": 953, "start": 9083.3, "end": 9093.3, "text": "nicht sein von ks also und auch komische regeln teilweise die hätten wenn es"}, {"id": 954, "start": 9093.3, "end": 9102.86, "text": "ein offiziellen server machen müssen das offiziellen server in wenn es mit"}, {"id": 955, "start": 9102.86, "end": 9107.58, "text": "guten rules die nicht so weit von vanilla weg sind"}, {"id": 956, "start": 9107.58, "end": 9116.22, "text": "all das oppression ist ja gut mensch ich habe so ein problem ich komme nicht"}, {"id": 957, "start": 9116.22, "end": 9141.26, "text": "weg weggespray der chat guck mal der chat wieder richtig toxic toxic chat jetzt"}, {"id": 958, "start": 9141.26, "end": 9145.94, "text": "wisst ihr auch warum sie den abgeschalten an den battlefield 2242"}, {"id": 959, "start": 9151.38, "end": 9156.86, "text": "die haben ihn abgeschaltet weil sie über wie soll ich sagen so so auf"}, {"id": 960, "start": 9156.86, "end": 9160.9, "text": "operative sein wollen das tante brunhilde sich nicht auf den schlips"}, {"id": 961, "start": 9160.9, "end": 9165.06, "text": "getreten fühlt wo es wollen wir denn jetzt rein ja b was anderes gibt es ja"}, {"id": 962, "start": 9165.06, "end": 9171.3, "text": "gerade nicht und suppression wie gesagt suppression war auch eines der coolen"}, {"id": 963, "start": 9171.3, "end": 9174.78, "text": "sachen diese in wenn es abgeschaltet haben beziehungsweise runter drehen"}, {"id": 964, "start": 9174.78, "end": 9195.02, "text": "konnten und alles alter was clusterfuck wieder ich komme nicht mal so"}, {"id": 965, "start": 9195.02, "end": 9205.5, "text": "pressen irgendwie raus nicht gegen den toter bei mir um so aus oder ist"}, {"id": 966, "start": 9205.5, "end": 9211.94, "text": "schlecht monka es"}, {"id": 967, "start": 9214.94, "end": 9221.3, "text": "oh ich seh mich nicht ihr seht mir nicht leute da hier ist keine granate keine"}, {"id": 968, "start": 9221.3, "end": 9231.7, "text": "granate erst mal in kopf"}, {"id": 969, "start": 9233.38, "end": 9237.14, "text": "alle wie schnell ist der unterwegs"}, {"id": 970, "start": 9239.7, "end": 9243.98, "text": "das ist doch mal kacke also da müssen wir woanders da das müssen wir anders"}, {"id": 971, "start": 9243.98, "end": 9251.94, "text": "anders angehen komme ich ob ich hier rauskomme noch mal"}, {"id": 972, "start": 9251.94, "end": 9257.02, "text": "ich vermute ja mal nicht glaube ich kann ich einfach nur abkämpfen und hoffen"}, {"id": 973, "start": 9257.02, "end": 9262.22, "text": "dass ich irgendwann sterbe ja easy easy komme ich hier raus ok easy"}, {"id": 974, "start": 9262.22, "end": 9275.86, "text": "guckt euch an zack raus ja bämpf"}, {"id": 975, "start": 9275.86, "end": 9287.54, "text": "oh god was ein klasse fahrer aha wir machen hätte klitschen"}, {"id": 976, "start": 9287.54, "end": 9293.42, "text": "naja naja ist er hätte klitsch oh jetzt so weg da oben"}, {"id": 977, "start": 9299.9, "end": 9306.46, "text": "monial lasst mich please liegen lasst mich liegen lasst ich will woanders"}, {"id": 978, "start": 9306.46, "end": 9317.26, "text": "spawn ja ja lasst mich liegen lasst mich liegen ach so fps render draw f was render"}, {"id": 979, "start": 9317.26, "end": 9330.94, "text": "draw fps 1 denk mal so 180 oder so ok eh nee andere seite hätten wir gemusst"}, {"id": 980, "start": 9330.94, "end": 9339.54, "text": "war flank action was machen die denn da da kommt nichts leute da kommt nichts"}, {"id": 981, "start": 9339.54, "end": 9342.94, "text": "unsere leute sitzen gerade im gang"}, {"id": 982, "start": 9345.02, "end": 9348.02, "text": "gachi base"}, {"id": 983, "start": 9348.02, "end": 9362.82, "text": "also ich kann auch nicht mehr als 200 haben hier ist natürlich doof jetzt sind"}, {"id": 984, "start": 9362.82, "end": 9365.82, "text": "die leute schon am start hier"}, {"id": 985, "start": 9365.82, "end": 9378.7, "text": "oh f 2000 ok vielleicht hätte ich doch mal b bleiben sollen"}, {"id": 986, "start": 9378.7, "end": 9397.02, "text": "die anderen seite ok wo ist hier was vielleicht haben wir glück und kommen"}, {"id": 987, "start": 9397.02, "end": 9408.46, "text": "rüber safe safe nice rüber vielleicht haben wir nämlich glück oder kommt was"}, {"id": 988, "start": 9408.46, "end": 9416.46, "text": "achtung das waren zwei ja 200 fps wie gesagt ich bin mir nicht sicher ob man"}, {"id": 989, "start": 9416.46, "end": 9422.34, "text": "mehr anlocken kann als 200 fps in battlefield 3 keine ahnung"}, {"id": 990, "start": 9422.34, "end": 9440.3, "text": "wov nice gg jetzt was ist im chat"}, {"id": 991, "start": 9440.94, "end": 9446.14, "text": "gekommnet im chat gekommnet am start"}, {"id": 992, "start": 9446.14, "end": 9450.38, "text": "oh nee jetzt verlieren wir wieder alles ich glaube jetzt müssen wir doch b rein"}, {"id": 993, "start": 9450.38, "end": 9454.94, "text": "keine andere chance außer klasse da fack"}, {"id": 994, "start": 9461.46, "end": 9465.26, "text": "das da fack deluxe"}, {"id": 995, "start": 9471.98, "end": 9476.78, "text": "alles klar ob wir ist was hier passiert also wer hier nicht durchblick sollte"}, {"id": 996, "start": 9476.78, "end": 9487.3, "text": "lieber an install easy easy easy ist durchblick of my life hier"}, {"id": 997, "start": 9500.5, "end": 9504.18, "text": "ach hier geht die wand kaputt das wusste ich ja noch gar nicht das war mir gar"}, {"id": 998, "start": 9504.18, "end": 9508.06, "text": "nicht bewusst dass sie die wand kaputt gehen kann"}, {"id": 999, "start": 9516.62, "end": 9527.3, "text": "meine güde was ein klasse fack keine explosiv limit ja feifein time was"}, {"id": 1000, "start": 9527.3, "end": 9532.74, "text": "also wie ich habe doch wieder gelegen das ist ich glaube das server ist kann"}, {"id": 1001, "start": 9532.74, "end": 9536.26, "text": "ein bisschen am ab verbrennen"}, {"id": 1002, "start": 9542.02, "end": 9545.02, "text": "ok"}, {"id": 1003, "start": 9548.5, "end": 9559.98, "text": "böser strike wir sollten aber ehrlich gesagt lieber squad cover nehmen"}, {"id": 1004, "start": 9559.98, "end": 9570.38, "text": "besser was zum teufel ist mit den leuten los"}, {"id": 1005, "start": 9570.38, "end": 9594.06, "text": "vielleicht können wir flanken da kommen noch mehr klein und da kommen noch mehr"}, {"id": 1006, "start": 9594.06, "end": 9603.62, "text": "pass mal auf okay der muss im prinzip nur gerade aus"}, {"id": 1007, "start": 9603.62, "end": 9607.62, "text": "mir das kannst du nicht kontesten das kannst du nicht kontesten gescheit hier"}, {"id": 1008, "start": 9607.62, "end": 9615.82, "text": "geradeaus keine chance der muss einfach nur geradeaus zielen"}, {"id": 1009, "start": 9615.82, "end": 9621.46, "text": "hier unten ist einer drin"}, {"id": 1010, "start": 9621.46, "end": 9631.38, "text": "können vielleicht außen rum ich habe keinen bock hier auf die ganze"}, {"id": 1011, "start": 9631.38, "end": 9641.3, "text": "zeit in diesem gang rum zu rennen ist ziemlich low iq und durch eure ganzen"}, {"id": 1012, "start": 9641.3, "end": 9647.86, "text": "prime prime subs habe ich so hohen iq da kann ich nicht so diese diese low iq"}, {"id": 1013, "start": 9647.86, "end": 9650.74, "text": "spielweise machen"}, {"id": 1014, "start": 9655.46, "end": 9658.46, "text": "kann ich mal sterben"}, {"id": 1015, "start": 9660.94, "end": 9667.5, "text": "90 90 prozent im gang ja das kann auch andere was stecken hier was"}, {"id": 1016, "start": 9667.5, "end": 9673.34, "text": "sind das das steckt was drin"}, {"id": 1017, "start": 9676.78, "end": 9682.02, "text": "ihr trifft mich nicht easy ihr trefft mir nicht leute easy ihr könnt mich gar"}, {"id": 1018, "start": 9682.02, "end": 9687.38, "text": "nicht treffen wenn sich jetzt uns bewegen würde"}, {"id": 1019, "start": 9687.38, "end": 9694.74, "text": "nein nein lasst mich"}, {"id": 1020, "start": 9694.74, "end": 9695.74, "text": "Nein!"}, {"id": 1021, "start": 9695.74, "end": 9696.74, "text": "Lass mich!"}, {"id": 1022, "start": 9696.74, "end": 9697.74, "text": "Geh weg!"}, {"id": 1023, "start": 9697.74, "end": 9698.74, "text": "Weg!"}, {"id": 1024, "start": 9698.74, "end": 9717.86, "text": "Ach ja stimmt, es gibt ja den 64-Player-Mode, den wollte ich eigentlich ausprobieren."}, {"id": 1025, "start": 9717.86, "end": 9732.42, "text": "Alter, hier kannst du nicht raus, vielleicht hab ich Glück, jetzt, jawoll, ok, ok, nice."}, {"id": 1026, "start": 9732.42, "end": 9747.5, "text": "Ok, ok, ok, nein, nein, nein, nein, ah, Alter, es ist ja, du konntest ja nirgendswo hin,"}, {"id": 1027, "start": 9747.5, "end": 9753.7, "text": "du kannst so wirklich nirgendswo hin, ich hab's jetzt ja echt probiert mal außenrum"}, {"id": 1028, "start": 9753.7, "end": 9754.7, "text": "zu kommen."}, {"id": 1029, "start": 9754.7, "end": 9771.06, "text": "Im Prinzip bleibt der ja echt nur Gangstels hier, einfach, einfach Gangstels, ja, Gangstels,"}, {"id": 1030, "start": 9771.06, "end": 9780.02, "text": "was willst du machen?"}, {"id": 1031, "start": 9780.02, "end": 9783.66, "text": "Die haben auch noch nen Jeep auf der anderen Seite stehen und Mörser, und Mörser noch"}, {"id": 1032, "start": 9783.66, "end": 9784.66, "text": "am Start."}, {"id": 1033, "start": 9784.66, "end": 9793.82, "text": "Ja ne, das klappt nicht, ok, wir flanken, wir gehen andersrum, andersrum, wir gehen"}, {"id": 1034, "start": 9793.82, "end": 9812.34, "text": "so rum, nicht hier, sondern so rum, warum liegen da welche, einfach random mitten auf"}, {"id": 1035, "start": 9812.34, "end": 9820.7, "text": "der Map, liegen irgendwelche Typen auf der Erde, Gangway, was ist jetzt mit euch los,"}, {"id": 1036, "start": 9820.7, "end": 9830.18, "text": "Gangstelstels, ja, Corona kickt wieder, Leute, Februar wird Boosterstels gemacht."}, {"id": 1037, "start": 9850.7, "end": 9864.1, "text": "Wenn wir hier rausgehen sind wir Deadge, ich sag euch wie es ist, Instant Deadge, richtig"}, {"id": 1038, "start": 9864.1, "end": 9886.62, "text": "Deadge, da fährt sogar ein Panzer rum auf der anderen Seite, Alter, es gibt ja keine"}, {"id": 1039, "start": 9886.62, "end": 9913.94, "text": "Ecke wo du raus kannst gerade, ok, YOLO, YOLO, YOLO, was zum, was, achja, ich hab"}, {"id": 1040, "start": 9913.94, "end": 9927.1, "text": "einen, ach da, Alter, BTF, was ist mit euch los, ich bin einfach in der Ecke rumgammelt,"}, {"id": 1041, "start": 9927.1, "end": 9953.22, "text": "oh, was haben wir denn hier, Aswall ohne Extended Mac, he is Batman, kann ja nichts werden, ja,"}, {"id": 1042, "start": 9953.22, "end": 9957.26, "text": "wir probieren das mal die Tage aus, Leute, wir probieren die Tage 2042 wieder aus mit"}, {"id": 1043, "start": 9957.26, "end": 9971.3, "text": "64 Mann, ein anderes Squad oder so vielleicht, wo die, wo die high IQ Leute drin sind, als"}, {"id": 1044, "start": 9971.3, "end": 9980.38, "text": "guter Spieler haben wir nur den Bushwookie gerade, ey, das ist mir zu Pains Champ gerade,"}, {"id": 1045, "start": 9980.38, "end": 9985.3, "text": "aber habt ihr es gesehen Leute, man kann Squad wechseln, ist euch das aufgefallen, habt ihr"}, {"id": 1046, "start": 9985.3, "end": 9996.18, "text": "es gemerkt, was für krasse High End Funktionen hier in dem Spiel auf einmal drin sind, also"}, {"id": 1047, "start": 9996.18, "end": 10004.14, "text": "da muss, die haben echt bestimmt so ein Pakt mit dem Teufel eingegangen in Schweden damals,"}, {"id": 1048, "start": 10004.14, "end": 10030.38, "text": "das geht das nicht, ja, natürlich, der stirbt davon nicht, was, ein Mörser, ne, das macht"}, {"id": 1049, "start": 10030.38, "end": 10043.9, "text": "gerade auch keinen Bock, macht auch nicht wirklich Bock gerade, gibt's, game not starting, ja,"}, {"id": 1050, "start": 10043.9, "end": 10055.86, "text": "schön, gerade kein gescheiten Server, den wir spielen können, ein gescheiten Server,"}, {"id": 1051, "start": 10055.86, "end": 10065.14, "text": "aber er ist dumm, 32 Mann Rush, das Problem ist, die Server, diese Cloverfield Server"}, {"id": 1052, "start": 10065.14, "end": 10073.38, "text": "sind halt mega krass unbalanced, meistens dominatet da eine Seite, heftig, wieso, was"}, {"id": 1053, "start": 10073.38, "end": 10077.86, "text": "ist bei der Steam Version so schlecht, achso, ja, ich weiß, was du meinst, dass die Steam"}, {"id": 1054, "start": 10077.86, "end": 10082.1, "text": "Version keine Steam Version ist, dass die Steam Version quasi einfach Origin startet,"}, {"id": 1055, "start": 10082.1, "end": 10088.74, "text": "ja, das ist richtig dumm, ne, Markas Monolith bin ich jetzt nicht so scharf drauf, Leute,"}, {"id": 1056, "start": 10088.74, "end": 10098.34, "text": "ich hab keine Ahnung, was spielen soll, kein Schimmer, Leute, ich weiß es nicht, ich glaube,"}, {"id": 1057, "start": 10098.34, "end": 10110.18, "text": "ich lass es jetzt gut sein, gibt ja nix, was ist, vielleicht ist, pass auf mal auf, vielleicht"}, {"id": 1058, "start": 10110.18, "end": 10117.22, "text": "ist der andere Server jetzt wieder voll, ne, der hat Null, ja, BattleLock ist auch Hexenwerk,"}, {"id": 1059, "start": 10117.22, "end": 10124.58, "text": "Leute, wir sehen uns nicht die Office, gibt nix was, ich gibt keine gescheiten Server"}, {"id": 1060, "start": 10124.58, "end": 10133.98, "text": "gerade und alles andere, was es gibt, hab ich keinen Bock richtig drauf, da waren die 64 Mann"}, {"id": 1061, "start": 10133.98, "end": 10141.9, "text": "Rush-Dinger tatsächlich noch am besten, bis denn Leute, wir sehen uns, machts gut, CU."}]}