{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal.Fuck. Moin.Moin Leute.Boah, ja, exzellent, exzellent.Ich bin zwar schon irgendwie 40 Minuten wach, aber ich bin nicht wirklich wach, ist ja so, also halb wach.So. Irgendwie kommen auf meinem Vorschaubildschirm wieder irgendwelche Chatnachrichten nicht an, das ist auch ziemlich bebäger.So, müssen wir mal refreshen, vielleicht geht es dann.Mal kurz testen. Keg. KegU. Ja, jetzt kommt es gleichzeitig an.Okay, müssen wir einfach mal den Browser-Tab refreshen. Hat sich Chrome gedacht. Nee, machen wir nicht, kein Bock.Chrome. Warum heißt Chrome eigentlich Chrome?Weil Google Chrome ist Chrome.Okay, jetzt kriegen wir es erklärt. Der Zoomer muss kurz weg.Also, product must name Chrome. Codename.Die dümmste, naheliegendste Antwort ist in dem Fall tatsächlich richtig.Autos und Geschwindigkeit. Das ist ja langweilig. Dachte, das hätte vielleicht irgendwelche spannenderen Hintergründe, warum Chrome Chrome heißt.Naja, nee, bin ich nicht.Leute, ich habe Cobalt letztes Jahr. Brauchen wir fort dran dieses Jahr.Ja, Leute. Seid ihr schon wach? Also ich nicht. Ich befinde mich so in einem halb wachen Zustand.Ich kann mich gar nicht dazu überreden, jetzt meine Maus in die Hand zu nehmen und irgendwas zu klicken.Habt ihr schöne, ich habe Socken gekriegt. Die übliche Geschichte.Ich habe Socken gekriegt. Bist noch wach, Pog.Buch, richtig old school. Betrucktes Papier.Du hast einen Xbox 360 Elite Controller bekommen. Das ist tatsächlich nice. Die gibt es ja so neu nicht mehr.Ach Moment, du hast so einen normalen Controller gekriegt.Weil die gibt es gar nicht mehr zu kaufen. Wenn du hier nach Xbox gerade wired, nicht weird champ wired, ist alsowirklich wirklich schwierig zu finden. Also die gibt es kaum noch zu kaufen.Das ist alles, das ist alles fake. Guck, seht ihr hier, das ist, das ist alles fake.Das ist der originale. Das andere ist alles fake.360 Old Controller gibt es nicht mehr. Alles nur fake. Ich habe zum Glück noch einen.Aber ist alles, alles fake.Das ist glaube ich so, das dürfte ja so mit der billigste Schraubmaterialerzeiten sein hier.Alles fake, das sieht man nachher, dass es halt kein Xbox Logo drauf hat. Das ist ein Yes Team und, undYai Yei. Oder Diswo. Alles fake.Und wenn schon, kommt mir nur der Original. Ich muss euch ja ehrlich sagen, ich finde der Xbox 360 Controller ist der beste Controller.Der Xbox One Controller bzw. der Xbox Series S Controller. Ich weiß nicht, was da der Unterschied ist, ob ich mal was geändert habe.Da sind mir die Analog-Sticks zu klein oben.Also, weiß nicht, irgendwie war der Xbox 360 Controller so für mich peak, peak Controller.PS5 Controller könnte tatsächlich noch nice sein. Die Sache ist die, warum ich den PlayStation Controller noch nie mochte ist,der hat auch kleinere Analog-Sticks und der ist so, vielleicht ist es jetzt besser geworden,aber der ist so klein im Vergleich zu dem Xbox 360 Controller.Beim Xbox 360 Controller fand ich gut. Du hattest halt wirklich das Ding fest in der Hand und musstest nicht selbst so fest halten,weil das Ding so klein ist.Der ist groß. Vielleicht sollte ich mal, ich bräuchte ja noch mal ein paar Controller für den PC. Ich habe ja nur mal einen Xbox 360 Controller noch.Vielleicht sollte ich mal einen anderen ausprobieren. Ahja. Egal.Aber was machen die Japaner? Gibt es dann in Japan einen kleineren?Weil ich habe früher immer als Argument gehört, ja ist doch ganz klar, die PlayStation kommt ja aus Japan,die Japaner haben kleinere Hände und deswegen kleine Controller.Das war also das Standard-Argument, warum der PlayStation Controller so klein ist.Und wie ist das jetzt bei der PS5? Ist der in Japan kleiner?Oder kommen jetzt auf magische Art und Weise die Leute da doch mit klar?Weil das war ja so das Argument schlechthin, was die Leute früher immer gebracht haben.Adaptive Trigger ist wirklich eine nice Geschichte.Es gibt ja sogar auch Tastaturen, die sowas haben.Da kannst du dann theoretisch die Tasten unterschiedlich tief runterdrücken und anders drauf reagieren.Excellent. So, was gucken wir uns denn jetzt an? 100% Allmann.Der geilste Kleingärtner. Nee, das müssen wir uns jetzt nicht angucken.Ich weiß nicht mal, was Autoklember sein soll. Was ist Autoklember?Meint der Kleimber? Nee, Klember. Was ist ein Autoklember?Kein Schimmer.Das Super-Video ist jetzt in deiner Empfehlung, ja. Ich hab sogar noch eins aufgemacht von dem gucken.Also das Gamestar-Video zur derzeit in der Spielbranche gesehen,also wenn du das von Maurice meinst, wo im Titel sowas steht wieihr seid den Herstellern egal, dann haben wir uns das angeguckt, ja.Oder wir haben besser gesagt darauf reacted, wie man das heute so schön nennt.Aktuelle Corona-Zahlen. Mittlerweile muss ich sagen, interessiert mich das alles sowas von gar nicht mehr.Ich glaub das ging jedem so, ne. Ich hab das ja am Anfang täglich verfolgt, wie sich das so entwickelt,aber seit über einem Jahr oder so geht das einfach so ins eine Ohr rein, ins andere Ohr raus.Juckt mich so gar nicht mehr. Spätestens seit ich mich hab impfen lassen, gehts mir noch mehr am Arsch vorbei.Was übrigens der hauptsächliche Grund ist, warum ich mich hab impfen lassen.Ich hab mich nicht impfen lassen, also ich will jetzt da gar nicht irgendwie großartig Sachen sagen, die nicht stimmen, ne.Weil ich hab mich nicht impfen lassen für Solidarität und Nächstenliebe.Ich hab mich impfen lassen, dass ich selbst keine Probleme krieg, fertig.Rest ist mir scheißegal. Was interessiert mich die Menschheit? Hauptsache ich kratz nicht ab.Ich hab mich rein aus Eigennutzen impfen lassen.So und seitdem verfolge ich das auch überhaupt nicht mehr.Ich hab mir gedacht, warum auch, ne.Mein gut, jetzt hast du die Geschichte mit, gibt jetzt neue Corona-Variante, aber das wird garantiert nicht die letzte Corona-Variante sein.Also mich würd's nicht wundern, wenn wir dann, was ist eigentlich Omikron für nen Buchstabe im griechischen Alphabet?Was entspricht denn das? A, B, C, D, E, F, G oder sowas?Keine Ahnung. Griechisches Alphabet.Okay, zeig mal her.Alpha, Beta, Gamma, Delta, Epsilon, Zeta, Eta, Teta, Iota hab ich noch nie gehört.Kappa, Kappa HD, Golden Kappa Check.Lambda, Mi, Ni, Xi, Omega, ah okay.Also quasi A, B, C, D, E, F, G, H, I, J, K, L, M, N, O.O, O entspricht das, okay.Aber der Rest stimmt, also es könnte auch so einfach sein.Also es heißt, danach kommt die Pi-Variante.Pi ist vielleicht schon ein bisschen doppeldeutig belegt im Vorfeld.Oh, hier, Sigma-Variante ist am Start.Das ist dann die Chat, die Corona-Chat-Variante.Also quasi die, da ist dann vorbei.Oh, das wird eh nicht das erste sein.Was uns da halt, also ist ja nicht das erste.Da kommen eh noch mehrere Varianten.Also da muss man sich glaube ich die nächsten Jahre über darauf einstellen.Was ich halt geil fand, was ich halt nur geil fand ist,so irgendwie im Sommer, oder warte, sagen wir mal so,letztes Jahr im TikTok-Cringe.Ich watche ja auch kein TikTok-Cringe.Letztes Jahr, so um diese Zeit herum,hat man erzählt so nach dem Motto, ja,obwohl man es eigentlich hätte besser wissen müssen,hat man so erzählt, ja, also wir machen jetzt nochmal ganz kurz Lockdownund dann sind wir ja kurz vorm Ziel und alles ist wieder gut.Und dann hat sich das das letzte Jahr über so hingezogenund dieses Jahr pünktlich zum Winter haben alle gesagt,was, wo kommt denn jetzt Corona auf einmal wieder her?Da hätte ja absolut niemand mit rechnen können,dass das dieses Jahr im Winter wieder akut wird.Wo kommt das auf einmal, ist es wieder da?Komplett, ohne dass man hätte das vermuten können im Vorfeld.Da haben alle so super überrascht getan, so nach dem Motto,was, da ist es ja wieder.Nein, im Leben nicht.Das ist wie die vier Feinde der deutschen Bahn, genau.Frühling, Sommer, Herbst und Winter.Ist auch immer wieder, auf einmal konnte niemand mit rechnen,dass es direkt Winter ist.Juli Genetics, Dankeschön für den normaler Sub.Nee, also das fand ich auch lustig.Auf einmal ist es wieder am Start.Das ist auch so was, was ich nicht verstehe.Man hätte sich ja im Vorfeld schon im Sommer,als es nicht so akut war, Pläne machen können,was man macht, wenn es im Winter wieder akut wird.Aber hat man irgendwie ausgesessen und sich gedacht,nee, nee, wir stecken jetzt den Kopf in den Sandund machen mal lieber nichts.Und dann müssen wir uns nämlich, wenn es dann im Winterwieder akut wird, wahnsinnig schnell wiederirgendwelche komischen Konferenzen einberufen,die dann nachts bis um 3.50 Uhr gehen.Weil es ja bekannt ist, dass man nachts um 3.00 Uhrdie besten Entscheidungen trifft.Das gibt es auch nicht, die kann ich nicht so ganz nachvollziehen.Also ich hab im Februar,hab ich Auffrischung, nee, wie nennt man?Boosterimpfung, nicht Auffrischung.Auffrischung ist ja out.Es ist ja Booster mittlerweile.Wobei dann die Frage ist, ob das im Februarüberhaupt noch sinnvoll ist, wenn 99% Omikronist und das dagegen gar nicht richtig hilft.Mal gucken.Wisst ihr, was das Beste ist?Versus Corona wenig Kontakt zu Menschen haben.Easy.Und da hab ich keine Probleme mit.Nachdem mir andere Menschen eh auf den Sack gehen,ah ja, und Hände waschen, nachdem mir andereMenschen eh auf den Sack gehen, einfach nicht rausgehen.Einfach nicht rausgehen und einfach sich,kein Kontakt mit anderen Menschen.Easy, hab ich überhaupt kein Problem mit.Andere Menschen nerven mich eh.So wenig wie möglich.Könnt ihr euch noch dran erinnern, wo am Anfangerzählt wurde, ich meine, da hat es ja laufen,das ist ja, du musst ja eigentlich nur mal soein paar Monate warten, dann ist ja oftmals das,was heute quasi als, so muss es sein, dargestellt wird,nicht unbedingt, nicht mal aktuell.Könnt ihr euch noch am Anfang dran erinnern,wo es hieß so nach dem Motto, also Masken bringenja gar nichts, weil das geht da ja durch,das ist ja viel zu klein und Leute,kauft euch keine Masken, das bringt ja gar nichts.Kauft, nein, nein, nein, nein.Und irgendwie dann ein halbes Jahr später so nach demMotto, ja jetzt müsst ihr aber alle eine Maske aufziehen.Ich hab mich von Anfang an ehrlich gesagt,also gefragt, so nach dem Motto, warum soll das dennnichts bringen? Ich mein, okay,natürlich ist so ein Virus kleiner als vielleichtirgendwelche Maschen in der Maske.Aber das ist ja in der Luft drin oder eventuellim, weiß ich so im, in der Luft Feuchtigkeitirgendwie drin und wenn die Hälfte davon an der Maskehängen bleibt, warum, natürlich bringt das was.Also ich hab da keinen Plan von, aber es klangfür mich von Anfang an irgendwie unlogisch,dass es nichts bringen soll. Egal, es hat sich jaim Nachhinein rausgestellt, man hat das nur behauptet,damit die Leute nicht wie für Rückwassen kaufen.Ja, Osterruhe und dann gab's noch einmal den,jetzt ist wieder alles Erlaubtag und solcheDinger, meine Güte.Das ganze Hickhack da drumherum.Wer also das da dran geforscht wurde, ob Maskenjetzt was bringen oder nicht, das halte ich jetztja mal für ein Gerücht, dass ich das irgendwieda drin habe.An irgendwelchen Forschungsergebnissen.Also ich mein, ob Masken ja was bringen oder nicht,das wusstest du von Anfang an und es ist ja auchmittlerweile rausgekommen, dass man das einfach nurgesagt hat, dass die Leute nicht wie für Rückwassenkaufen gehen, sodass man genug für medizinischeEinrichtungen hat. Kann man sagen ehrenwertes Ziel,aber wahrscheinlich nicht unbedingt das, um Vertrauenda zu schaffen.Ansonsten ja, gebe ich dir recht, aber trotzdem,auch wenn sich aktuelle Erkenntnisse oder Ansichtendazu ändern, man muss das halt ordentlich erklären.Und gerade wenn man heute A sagt und morgen B und Bsteht im Kontrast zu A, muss man das sinnvollbegründen oder erklären, nachvollziehbar erklären,dass das so ist.Und so Sachen wie ab, keine Ahnung, 190 Quadratmeterist alles in Ordnung und ab 200 Quadratmeterist böse, muss extra, ergibt es ja auch keinen Sinn.Da hätte man ganz klar sagen müssen, ja wir habendas halt willkürlich irgendwo festgelegt.Also, das ist echt nicht so glücklich gelaufen alleskommunikationstechnisch, das war schon ziemlichfür'n Arsch an vielen Stellen. Genauso wie mangesagt hat, dass diese, wie erfassend bei Restaurantswar da gewesen ist, dass es rein zur Nachverfolgungvon Infektionsketten dient und jetzt kommt halt rausund nach dem auch, ne ne, wir doch für alles andereverwendet. Das mag alles okay sein, aber man kannes halt nicht am Anfang behaupten und es danachnicht machen und sich dann wundern, warum glaubtnicht keiner mehr was. Hä? Das ist ja logisch.Ich mein, wenn du 500 mal Scheiße erzählst bekommst,501. Mal hat man es dann vielleicht irgendwanngecheckt, dass man es nicht mehr glaubt. Was haltgerade jetzt ein bisschen doof ist, weil das immermehr Leute dazu bringt, dass sie vielleicht ins andereLager wechseln und so sagen sie nach dem Wort,jetzt mach ich gar nichts mehr.Ah ja, ich denke das wird uns auf jeden Fall nocheine Weile begleiten und ich denke auch nicht,dass Omikron das letzte sein wird, was wir kriegenin der Richtung.Da kommt bestimmt noch mehr.Wir haben ja gerade nachgeguckt, als nächstes kommt dannPi und dann kommt Ro und spätestens bei Sigma gehtdie Welt unter, da ist vorbei.Dann ist Schluss.Wahrscheinlich, wahrscheinlich Winter 2023 oder soist Sigma Corona am Start.So.Experiment V24.Minecraft. Warum kriege ich Minecraft Sachen empfohlen?Okay, lass mich raten. Der sprengt jetzt alles in dieLuft und dann macht sie Bum.Ja.Okay.Ah, das ist ein Amboss oder was?Das könntest du auf normalem Java Edition Serverwahrscheinlich gar nicht machen, weil der kompletteServer zusammenbrechen würde vor Lag.Okay, die Grube explodiert.Alles klar, da hätte ich jetzt auch mit gerechnet,ehrlich gesagt, bei so viel TNT.Okay, was auch immer.Man sollte vielleicht nicht Scheiße erzählen, obwohlman weiß, dass es nicht so ist.Ich erwarte ja gar nicht, dass das alles 100% stimmt,immer, was man sagt.Aber wenn sich halt rausstellt, es war totaler Bullshit,dann sollte man das wenigstens auch mal erwähnen.Und nicht so tun, so nach dem Motto, ich habe gesternScheiße erzählt und es alles richtig verkauft und heuteverkaufe ich wieder was als richtig und das wirdwahrscheinlich auch wieder richtig sein.Da muss man halt auch mal sagen können, okay, Datenlagehat sich geändert, was auch immer.Und aus diesen und diesen Gründen machen wir das jetztanders.Aber man kann nicht immer so tun, als liegt manultimativ richtig.Ach ja, und dass das verfolgt, musst du gucken.Such nach Corona.Wie heißt der Kram?Wie heißt diese Anwesenheitslisten?Die bayerische Polizei macht da überhaupt keinenHeld, um dass sie das verwenden.Ich finde es nur ein bisschen bedenklich, dass dudadurch im Endeffekt auch Leute vielleicht ins falscheLager treibst.Ich finde es nur ein bisschen bedenklich, dass dudadurch im Endeffekt auch Leute vielleicht ins falscheLager treibst.Das ist ein bisschen komplex.Das ist ein bisschen komplex, dass man mal etwasauch Leute vielleicht ins falsche Lager treibst, weil die sagen, hey ich glaub eh nix mehrund dann glaub ich lieber irgendwie dem Kerl in der Telegram Gruppe, was jetzt nur füralle nicht das ist, was man sich wünschen kann.So, jetzt, guck mal, das ist Taktik von YouTube, wenn du ein Video angeklickt hast in einerPosition und hast es geguckt, kriegst du ein ähnliches Video an der gleichen Positionwieder.Bayern gehört nicht zu Deutschland, ja wenn du manche Bayern fragst, ist das wirklichso und auch wenn du manche anderen fragst, ja, die kriegen nur Mist empfohlen.Mario Kart DS Tracks, ach ne, ich dachte das ist Mario Kart Speed Trans, da gibt es auchrichtig krasse Dinger.Ich hab jetzt zwei Minecraft Videos angeklickt, ne und jetzt ist YouTube der Meinung, gib mirmeine Minecraft Videos, auf gehts.Haartrockner in der Badewanne, was passiert?Wahrscheinlich gar nix, also ich hab mir da noch nie großartig, Freunde des Stroms, dasist ja auch mal ein geiler Channelname, man kennt das ja nur aus Filmen, so nach dem Motto,mit einem Bein in der Badewanne, man wirft den Föhn rein und instantly komplett geschocktund alles hinüber, wahrscheinlich passiert gar nix, vielleicht geht, vielleicht gehtauf jeden Fall der Föhn kaputt, aber das will ich mir jetzt nicht angucken, das istso lang, komm ich guck mal kurz rein, was passiert damit, liebe Freunde des Stroms,ich find das schon mal ein geiler Channelname, seid ihr auch Freunde des Stroms, wie siehtes bei euch aus, Freunde des Stroms, ja, ich spule jetzt mal ein bisschen vor, man siehtschon Orgas Dialect, ach das ist der Föhn, aber er hat seine coole Quickscope Brillean, die ist wichtig, also ohne die Gunner Optics Quickscope Brille geht gar nix, okwas passiert, guck mal der Föhn, der Föhn läuft sogar noch unter Wasser weiter, okes passiert einfach mal gar nix, ich hätte gedacht der Föhn geht wenigstens kaputt,jetzt mit dem gerechnet, also wir haben uns jetzt einen wunderschönen Außenbordmotorgebaut oder, schaut euch das an, der pumpt jetzt das Wasser dadurch, natürlich der Lüftermuss jetzt schinden, aber es passiert gar nix, im ersten Moment und jetzt werden wirdas Ganze natürlich auf elektrischer Manier einmal analysieren, aber so wie in die Krimisist es nicht, ich zeige es euch natürlich noch, wenn es euch interessiert, schaut euchdas an, was ist das jetzt, der Widerstand von, nee keine Ahnung, da hätte ich jetztvielleicht noch komplett gucken müssen, wo hält das denn dran, an die Wand, an die Wandund?Also das Wasser ist jetzt auch nicht isoliert, gar nix, es ist ganz normales Wasser mit Badezusatzund bis jetzt hat noch nix ausgelöst, das ist hier, ich mache jetzt keine Werbung, aberda ist keine Tonibox im Bad auf der Bade, Widerstand wahrscheinlich von, definitiv wiederkracht und schäbert und dann schauen wir mal, ob man die Selektivität herhält oderob es wieder kommt, schauen wir mal, lassen wir uns überraschen, ich möchte jetzt nochnix verraten.Aha, ok, das müssen wir uns glaube ich echt ganz angucken, damit man das checkt, aberich will mir keine 30 Minuten Föhn in der Badewanne angucken jetzt.Ich freu mir nicht, Stroms, how to crash Minecraft ist ganz einfach, soll ich euch zeigen, wieman Minecraft crash?Ich hab da gehört, es gibt da so gewisse Sachen, die man ins Chatlog schreiben kannund dann ist vorbei, 2022 wird das Jahr für Open World Spiele, das Problem ist nur, dassmich Open World Spiele überhaupt nicht jucken, Dying Light 2, Horizon, Elden Ring, LX2, GTA2, Stalker, Saint Rose, Test Drive Unlimited, Solar Crown, Starfield Ark 2, Avatar, brauchtman das wirklich jetzt noch?Irgendwie gefühlt 20 Jahre nachdem der erste Kinofilm rausgekommen ist?Sollte es da nicht sogar einen zweiten Film geben, nicht als hätte das eine Fortsetzunggebraucht oder so, Cyberpunk, ach schon wieder, ja gut, ja gut, bisschen Harry Potter verwurstenmuss man natürlich auch noch, ja ok, das Sequel zu Breath of the Wild, das sehen wirwahrscheinlich wenn Nintendo so weitermacht, 2030 oder so, was will denn der Switcher nochmalhier am Start, ja gut, das kommt noch für Next Gen raus, das ist ja fast schon wie SkyrimAlter, wie mich New World Spiele nicht interessieren, das ist der Wahnsinn, die ganze Welt gehtvoll ab auf Open World, also nicht New World, sondern Open World und ich muss sagen, bisauf ein paar Ausnahmen gehen mir Open World Spiele komplett am Arsch vorbei, also Witcher3 war eine gute Ausnahme aber auch nur, weil es eine schlüssige Main Quest als roten Fadengab und man quasi drum herum noch so ein bisschen spielen konnte und nicht die OpenWorld so als einziges da war, mit der man sich beschäftigen kann, spielt das doch einerNew World, lass doch mal gucken, naja, also ich glaube man könnte sagen, in absolutenZahlen gesehen, ja da spielt noch jemand, anteilmäßig könnte man sagen, es ist eigentlichfast dead, guck mal, tolle Entwicklung, erster Monat minus 62%, nächster Monat minus 43%,doch ich wollte am 24.Video bringen, ich wollte mit dem Friseur ein Video aufnehmen, aber das Internet, alsoVodafone hat komplett das Internet beim Frasier abgeschaltet am 23., beste, bestes Timing,und ab 27.gehts angeblich wieder, was ja auch nice ist, die Leute über Weihnachten einfach mal sohocken zu lassen, naja, mal gespannt, ob das noch klappt, ne, aber das ist Deadge und dashier ist auch Deadge, das sind die hängengebliebenen, die sie jetzt an Weihnachten bekommen habenund ein paar aus dem Free Weekend, guck mal, ich mein wir waren schon runter, wir warenschon runter auf 18., guck mal, es war jetzt heilig Abend, ne, Leute, es hat sich einfachnichts getan, niemand hat dieses Spiel zu heiliger Abend bekommen und gespielt, niemand,jedes Sau interessiert sich dafür, so muss es auch sein, ne, hab ich noch nie, ich habnur bei Shroud ab und zu mal ein bisschen auf Twitch geguckt und was mich abschrecktist, dass das wieder so ein Game ist mit kleinteiligem Inventorymanagement, ja, ich weiß, ich weiß,ich kenn die Videos, Belfin5 hatte gestern mehr Streamer, aber mal Steam, ah nein, ichhab's noch nicht auf Shithub gepusht, Moment, schreib ich mir auf, GitHub, App, guck mal,die hatten 10.000 Spieler mehr, Alter, guck mal, die hatten fast 10.000 Spieler mehr alsBattlefield 2042, das ist so schlecht und wohlgemerkt, Battlefield 5 kam auch schon nicht gut an,wie sieht denn Battlefield, ok, das kann man jetzt schlecht vergleichen, das ist schonso alt, es hat wahrscheinlich kaum noch einer auf Steam gekauft, ne, ok, das kannst du nicht,das spielt auch kaum einer über Steam, mal auf Steam gucken, äh, nicht Steam, Steam Charts,es hat fast genauso viel, ok, die Hälfte von 2042, das Problem ist, dass man das nichtso gut vergleichen kann, weil Battlefield 20, also es ist eigentlich, es ist noch schlechter,weil das kam von Anfang an auf Steam raus und die Games, die kamen erst mal nur auf,also bei dem weiß ich nicht, aber die anderen kamen nur auf Origin raus und kamen jetzterst vor einem Jahr oder so auf Steam, also das ist, eigentlich ist es noch schlechtervom Verhältnis, als es hier aussieht, so mies, alter, so schlecht, Wahnsinn, absolut Wahnsinn,was die da wieder für einen Scheiß getrieben haben, naja gut, was willst du machen, dieSache ist eh in Brunnen gefallen, da wird sich nichts mehr tun, also die werden das Spielnie aus dem Dreck ziehen können, neue Grafik für AMA 4, wirst du gar nicht, dass AMA 4war, AJAJA, das fühlt sich an wie Anime Fans am Start, ok, was können wir uns jetzt angucken,Dropping an iPhone 13, 13, 13, ja 13, Pro down, Feet, alter, ok, Feet 2 Meter, gibt'sdas, ok, 487 Meter tiefer See, Kekona Freedom Units, hell yeah, Feet, wie gesagt, man könntees auch noch in Galonen oder in Ounces oder in Miles oder so, dann gucken wir uns dasdoch jetzt mal an, also es könnte natürlich auch sein, dass es sehr langweilig ist, wenndas permanent einfach nur runterfällt, aber so lang fällt das 480 Meter auch nicht, Willit blend, don't try this, nee wie geht das, don't breeze this, gibt's die überhauptnoch, Planttec YouTube, nee so wirklich machen die nichts mehr, so wirklich aktiv machendie nicht mehr, ok gucken wir uns mal an, also lass mal überlegen, will das, überlebtes das iPhone, ja ich denke schon, ob es noch läuft weiß ich nicht, kann man schwer sagen,ich weiß nicht, wie wasserdicht die Dinger sind, aber ich denke mal spätestens, wennman das dann trocknet, geht es wieder, ich habe das Gefühl, Chat sagt, ich habe das Gefühl,dass die Spiele sich immer weiter von den Gamern entfernt, also du meinst jetzt von dem,was die Spieler eigentlich sich wünschen an Spielen, ja, es geht halt um Monetarisierungund Big Stonks, nicht darum jetzt irgendwie, wo kämen wir denn dahin, wenn man die Spielerirgendwie glücklich machen will, das will man, nein, nein, nein, nein, man möchte dieSpieler insofern glücklich genug machen, dass sie viel Geld ausgeben, aber zu happy sollendie auch nicht sein, die sollen ja völlig den anderen Kram kaufen, so, what is up guys,what is up, in this video we got the brand new iPhone 13 Pro, this is in pristine condition,brand new device, guys, everything works perfectly fine, na gut, der kann sich das leisten, wegot the GoPro Hero 9 here, okay, wir gucken, ich kroll mal ein bisschen vor, wo es jetzteigentlich anfängt, deepest point of this lake, we're actually at Lake Tahoe, it'sone of the deepest lakes in the world and we're gonna see what happens when we send both theGoPro in the waterproof housing in the water, okay guys, we're ready to go, ja, was istdenn das, das ist hier die Profi-Angel, ah, wie tief das ganze ist, okay, auf gehts, aufgehts, gib ihm, ah, by the way, dass das nur auf einer Seite ist, der Sound, das ist normal,also mein Sound ist vollkommen okay, hör dir, auf beiden Seiten, aber das Video ist nurleft side irgendwie, das hätte er aber schöner nachbearbeiten können, ne, das hätte eraber schöner nachbearbeiten können, ne, kann man hier vielleicht Pen oder so, Penning einstellen,ne, kann man nicht, naja, wir brauchen ja schon einen Livestream von der GoPro, ich mein,so ist das vielleicht ein bisschen unspektakulär, ich dachte, wir sehen jetzt, wie das da reinfällt, also eben bei der Angel zuzugucken ist jetzt ja nur wirklich nicht sonderlichspannend, das ist eine Angel mit Motor, das ist für Leute wie mich, die keinen Bock habenselbst zu kurbeln, ne, dem iPhone wirst du das sicherlich nicht ansehen, ja, das habeich mir schon fast gedacht, also ich, ne, ne, hab ich mir nicht gedacht, ich hab mir gedacht,das geht wahrscheinlich aus und wenn man das trocknet gehts wieder, ja ne, aber wundertmich, wundert mich jetzt auch nicht wirklich, ach jetzt, jetzt kann man zugucken, ok, jo,mach dir mal überhaupt gar nichts, juckt es, juckt es nicht wirklich, wobei ich sagen muss,je nachdem wie tief die sind, ganz schön hell, oder, ganz schön hell für die, na gut, 200Meter oder so, ich weiß nicht ab wanns richtig dunkel wird, ah jetzt wirds dunkel, ja, Leute,das könnte natürlich jetzt so, das könnte auch aus irgendeinem Horrorfilm sein, oder,du siehst ja nix und jetzt kommt von hinten auf einmal irgendwas großes, großes angeschwommenso, wuhu, ich habs ja eh nicht, ich habs ja eh nicht so mit tiefem Wasser, das wisstder, ja, guck mal jetzt ist richtig, jetzt ist richtigein Toaster, also zumindest wenns auf den Boden ankommt, müsste man eigentlich sehen,sollst du dann machen blonk und auf den Boden ankomm, ok, ok, ok, ok, ok, ok, ok, ok, ok,ok, ok, ok, ok, ja, ok, ok, ok, ok, ok, ok, ok, ja, ok, ok, ok, ok, ok, ok, ok, ok, ok,Oder ist das der Screenlock?Ist das Handy noch am Netz?Und kommt es jetzt unten an?Ah, die GoPro ist kaputt?Deswegen ging das jetzt aus.Scheint doch nicht mehr so richtig zu funktionieren.Siehste, das ist doch nicht angeblieben.Das einzige was noch an ist, ist die Lampe, okay.Aber wie gesagt, ich hätte auch vermutet das Display geht aus, aber wenn man es kompletttrocknen lässt, dann geht's wieder.Oder der Drucker hat das Display kaputt gemacht, ja das kann natürlich auch sein.Du musst das trocknen lassen und dann...Okay, anscheinend geht es doch nicht mehr richtig.Na gut, okay es geht doch nicht mehr.Ich hätte fast vermutet, das iPhone geht noch, weil man es wieder komplett trocknen lässtund nach Möglichkeit dann mal eine Woche liegen lässt, bis wirklich der letzte Vizel hieran Wasser getrocknet ist und dann noch mal neu ein- und ausschaltet, äh, aus- und einschalten,bzw.halt mal irgendwie ein Akku abmacht oder irgendwas.Das geht ja, wobei das geht ja nicht, muss man ja aufschreiben.Der Drucker hat den Bildschirm kaputt gemacht, ja kann durchaus sein, Chat.Eigentlich komplett sinnloses Video, wenn man sich mal so überlegt.Ich mein, wozu?Steht auf der Herstellerseite nicht ein Meter Tiefe.Ja gut, was Hersteller so schreiben und was dann in der Realität ist, kann entweder vielviel mehr sein oder viel viel weniger.Bei manchen kommt es auch ungefähr hin.Also, making was?A drone with Lego Motor.Das soll funktionieren?Ist das Lego Motor Zeug nicht viel zu schwer?Also, das war immer so mein Traum, wie ich klein war.Ich hab ja auch viel Lego Technik gebastelt.Ich hatte auch so einen fetten Lego Motor und hatte auch ein paar Propeller und sonstwas.Das höchste der Gefühle, was ich geschafft hab, ist ein Schiff, was fahren konnte mitPropeller und ein, da hatte ich so ein Brett gebaut, das war ja nicht wirklich ein Schiff,also so ein Brett mit Lego Motor drauf, was man dann so minimalsteuern konnte.Aber ansonsten, dass das abhebt, habe ich so meine Zweifel, wobei, je nachdem, was esfür neue Lego Motoren gibt, ach so, der betreibt es auch nicht mit dem normalen Lego MotorMotor, sondern der benutzt nur den Lego Motor und dann ein ordentliches Netzteil für.Okay, ja, dann könnte ich mir das natürlich vorstellen, dass das doch funktionieren könnte.Was hat er da unten drunter stehen, ach, das ist eine Waage, oder, das ist eine Waage,dass er gucken kann, wie viel hebt das Ding hoch.Der L-Motor ist der Mehr-Pepo-Fett.Gleich geht's durch die Decke, okay, Minus, Minus ist schon mal gut, das ist nice, okay,das heißt, wenn er so eine Drohne baut, wenn er davon jetzt vier Stück nimmt, dann musser das Ding ungefähr, sag mal, der Rest darf maximal 200 Gramm zusätzlich wiegen, dasses noch funktioniert, am besten deutlich weniger, weil ansonsten wird es halt mit dem Fliegenein bisschen eklig, ach, gucken wir mal, Stress-Test, na gut, dass die Lego kaputt geht, denke ichmal nicht, aber ob es am Ende abhebt, habe ich trotzdem so meine Zweifel, ich meine,da muss ja noch Steuerung dran, da müssen Akkus dran, also sprich, da muss irgendwiedie Akkus dran bekommen und das alles, sagen wir mal, sollte unter 150 Gramm zusammenwiegen,Akkus, Steuerung, alles, Kabel, was auch immer man braucht, das sollte alles unter 150 Gramm,das müssen wir mal wiegen, sonst fliegt es halt nicht gescheit, ach, Moment, der brauchtja zwei, der braucht zwei Motoren, die sich links rumdrehen und zwei, die sich rechtsrumdrehen, dass die Drohne nicht so einen Trall hat, im Kreis sich zu drehen, oder,oder warum braucht der zwei in die Richtung, zwei in die Richtung, nee, das funktioniertso nicht, das wackelt, das bounce ja, das ist ihm aber voll, das bounce ja wie verrücktrum, ok, dann hat er insgesamt noch weniger, also da muss er auf jeden Fall unter 150 Grammzusätzliche noch bleiben, sonst hebt das Ding nicht ab, Big Brain Lego Skills, ah,der gute Wackeltest, oh nee, das wird so nichts, ah, yes, weiß aber nicht, wie gut das dannfunktioniert, wenn sich das überlagert, macht das bestimmt ein bisschen größer, ja, ja,gib ihm, ja, viel besser gleich, viel besser, wenn sich das nicht überlappt, ok, das heißt,der muss jetzt, ok, ok, mal langsam, also der muss jetzt den Rest Akkus und Verkabelungund Steuerung, muss unter 125 Gramm sein, dass das Ding abhebt, wobei es sollte eineganze Ecke unter 125 Gramm sein, also was weiß ich, unter 100 Gramm, aber allein schondie Akkus dürften über 120, da bin ich mal gespannt was da rauskommt, na gut, oder essind halt welche mit nicht viel Ladung, was ist denn so ein normaler Drohnen Akku, ichhab keine Ahnung ehrlich gesagt, was fährt man da normalerweise, 800 milliampere Stundenoder, ich hab keinen Schimmer, ich hab da mich null mit beschäftigt bisher, eine rundeTransistor, jetzt wird es gesteckt, PWM Signal für die, ach, das ist der Controller fürdie Lüfter, ok, PWM Signal braucht man für die Steuerung vom, warum hat er nochmal, warumhat er nochmal, ah, ok, das ist PWM Signal, 3,3 Volt vom Controller an den Transistorund da drüber gehen dann bis zu 55 Volt, ok, der Controller wird mit anderer Spannungbetrieben logischerweise als der Motor, passt ja auch, klingt ja irgendwie logisch, dasheißt er braucht das PWM Signal, nimmt damit, wenn ich das richtig verstehe, vom Controllermit 3 Volt als Input und der Transistor gibt das dann irgendwie weiter, das PWM Signal,ok, warte mal, boah, was ist das für Big Brain Software, ach, der Controller hat auchautomatisch gleich so einen, wie nennt man das, so einen Accelerator oder was auch immerSensor mit eingebaut, dass du weißt, wie das gerade liegt und wie es beschleunigt undsonst was, Lage Controller, ok, ja, aha, jetzt flutscht es, das hat mir der Chat beigebracht,ich wusste gar nicht, dass man das mit nem Teppichmesser abschneiden kann, könnt ihreuch noch, falls da jemand dabei war von euch, ich hab mich ja auch mal gefragt, wie ichso ein paar Platten abkriege, dann meint der Chat, nehm einfach Teppichmesser und schneidezweimal durch und brechst es dann ab und was hab ich gemacht, zweimal mit dem Messer drüberund abgebrochen und es hat funktioniert, richtig Expanded Brain vom Chat wieder gewesen.Und das, wenns fertig ist, warum bohrt der da Löcher rein, hat niemand, warum bohrtder da Löcher rein, ach Leiterbahn unterbrechen, ok, exzellent, exzellent, bohr, das ist jadie halbe Rolle, lützchen, warum du pink bist, weil das random im Chat ist, also indem Anzeige Chat, ok, 4 Stück, weil 4 Motoren vermute ich mal, das ist ja so ein bisschender Unterschied zwischen Drohnen oder sag mal mal auch so Spielzeughelis und echten Helikoptern,bei echten Helikoptern hast du ja in der Regel das, also wie stark der sinkt und steigt,machst du ja bei echten Helis mit dem Anstellwinkel quasi der Rotorblätter und bei Drohnen machstdu es über die Drehgeschwindigkeit der Motoren, ich mein wisst ihr was das coole ist im Jahr2021, dass es schon für ein Appel und ein Ei solche fertigen Controller gibt, wo dueigentlich nix machen musst außer den Kram anlöten und vielleicht irgendwie Firma draufflaschen, Pog, ah ja klar, er muss das Ding ja irgendwie fernsteuern, kommt das Xbox,das Xbox Gamepad, ok jetzt muss er das wahrscheinlich irgendwie peern, dass das ordentlich funktioniert,also das ganze Zeug was er da jetzt baut muss unter 100 Gramm wiegen, inklusive Akkus, sonsthebt das Ding nicht gescheit ab und ich weiß nicht wie dieser Effekt heißt, aber man darfsich da nicht jebaiten lassen, also überm Boden erzeugt das Ding mehr Auftrieb als höherin der Luft, da gibt es irgendwie so ein, frag mich nicht, da gibt es irgendwie so einenspeziellen Turbulenzen, Verwirbelungseffekt irgendwie, also du brauchst quasi wenigerPower knapp überm Boden, wie wenn du hochfliegst, deswegen kann das sein, dass es quasi abhebtund dann direkt wieder runterfällt, wenn es zu schwer ist, ah ja Obvious, SC, na klar,Verlängerungskabel, bin mir da gar nicht so sicher, ab einer gewissen Höhe ist wahrscheinlichso ein Verlängerungskabel genauso schwer und ab einer gewissen Höhe ein Verlängerungskabelnoch schwerer als die Akkus, weil das wiegt ja auch was, wobei ich weiß nicht, 100 GrammKabel, wieviel Meter sind das, Power Offer Wifi müsste das betreiben, genau, da brauchtman gar keine Akkus mehr, naja, ok, das wird aber, das wird, ok, 50 Gramm für die Akkus,das sein Controller und Kabelzeug wird wahrscheinlich auch nochmal 10-15 Gramm wiegen, da bleibter auf jeden Fall, also das Ding kann zumindest potenziell abheben, ey man soll da nicht krasseFlugeigenschaften, wenn wir das jetzt nicht haben, das ist richtig geil, dass es sowasschon als kostenlose Software beziehungsweise für kleines Geld gibt an Controller und Softwareals mega Poggers, ich hab davon keinen Plan, also ich hab mich nie mit Drohnen großartigbeschäftigt, aber ist schon geil, oh, das sieht schon besser aus, so, das ist das wasich meine, wenn der, wenn der, ich hab, wie gesagt, ich hab keine Ahnung, da gibt esirgend so ein Effekt, gibt es auch bei Helis und so, wenn der so knapp über den Bodenfliegt, braucht der weniger Auftrieb um zu fliegen, als wenn er hoch fliegt, weil esirgendwie, weil es einmal, glaube ich, Auftrieb erzeugt durch das Luft durchziehen und dannweil die Luft von unten vom Boden quasi abprallt und nochmal, also du brauchst weniger, BetaFlight auf GitHub, Beta Flight, ah ja, nice, guck mal da, Beta Flight, nicht Sigma Flight,es ist Beta Flight, nice, hier, das meine ich Leute, das meine ich, hier, der Bodeneffekt,als Bodeneffekt bezeichnet man ein physikalisches Phänomen, das ein umströmter Körper in Bodennäheerfährt, jeweils kann je nach Form des umströmten Körpers zusätzlicher dynamischer Auftrieboder auch Abtrieb entstehen, alles klar, jetzt wissen wir Bescheid, noted, ah jetzt musser den Kram noch kalibrieren, dass das überall gleichermaßen stabil bleibt, ok, das siehtschon viel besser aus jetzt, ey, das könnte wirklich funktionieren, ne, wahrscheinlichfunktioniert es, als hätte er das Video nicht gemacht, auf der anderen Seite, auch wennes nicht funktioniert, ist das trotzdem ein Video, das viele Leute angucken, das siehterstaunlich gut aus, was hat er denn jetzt, ich hab jetzt gar nicht geguckt, was hat erdenn jetzt für Akkus, oh, oh, boah, guck, dann sieht man es, sobald er ein bisschenvom Boden wegfliegt, hat das Ding ordentliche Probleme hochzukommen, ah, mehr Power, ok,33 Volt, was sind das für welche, weiß man nicht, kann man das kalibrieren, auch wenndie Gewichtsverteilung nicht optimal ist, ja genau dafür ist es da denke ich mal, javiel besser Klai, ja viel besser, oh, und zack, pock, oh, rip, ok, ok, ok, ok, ok, ok,lopass, jaFunktioniert erstaunlich gut, oh jetzt muss es fein, da ist sehr wenig Platz für dieGröße der Drohne und so super ruhig liegt die ja auch nicht in der Luft, also das stelleich mir schwer vor, rums, das wird nichts, ein bisschen mehr Platz, aber cool das esüberhaupt funktioniert, ja, schon nice, da habe ich immer davon geträumt, wie ich kleinwar mal irgendwas mit Lego Motor zu bauen, das was fliegen kann, man muss ja sagen, esist natürlich nicht pur Lego, allein schon die Akkus und das Teilstrom herum ist nichts,was du mit Lego alleine bauen konntest, aber ist schon nice, kannst du den Videolink, dumeinst das hier, ja, Org, funktioniert, oh was hat es gekostet, guck mal ist gar nichtso teuer, guck mal der Controller 22 Euro und der Empfänger für den Controller nochmal20 Euro, also du bist mit 40 Euro für so ein Steuerungs Ding dabei und 7 Euro fürden Astronaut, ja, ah der Controller und die Batterien, ja gut, die Akku Packs, 200mAh, ok, lange fliegt die Drohne aber nicht, oh ok, also ein Schnapper ist es nicht gerade,da kriegt man mit Sicherheit bessere und günstigere Drohne, aber es geht ja auch darum, dass esgeht, jo nice, die 9 Stück sind zusammen wie ein kleiner Handyakku, nee, die sind bestimmtnicht parallel betrieben oder, oder doch, nee, wie kommt er sonst auf 33,3 Volt, washat er für Akkus, Akkus, ach hier sind die Akku Packs, naja, aber cool, dass das funktioniert,nicht übel, hätt ich am Anfang nicht gedacht ehrlich gesagt, dass das funktioniert, Battlefield2042, aber wenn du Battlefield ausmachst, sobald du eine Cringe-Voice-Line hörst, dannist ja quasi direkt nach Start aus, ja, oh, das ist der schlimmste Spruch im ganzen Game,und Spiel ausschalten, ja, komm mal, jetzt haben wir ein Lego-Video geguckt, jetzt kriegenwir nur noch Lego-Videos empfohlen, der YouTube-Algorithmus ist bei der Arbeit, der Drachenlord versagterneut bei Mario 64, ist der nicht im Gefängnis, ich dachte der muss ins Gefängnis, hab ichirgendwas mitbekommen, was ist denn da rausgekommen jetzt, ich hab, ich kann mich noch an dasGerichtsurteil erinnern, dass er irgendwie ins Gefängnis muss, oh, aber anscheinenddoch nicht, aha, geht noch weiter, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,ok, ok, ok,olui, jetzt abdomen, ok, ok, ok, ok, ok, ok,ok, ok, mal schauen, mal schauen,Das brauchen wir nichtOkay, was gucken wir uns als nächstes an schuldinge die ich nie verstanden habe das ist wieder das summa video haben wir uns letzten schonwas angegucktUnd das sind nur drei minuten 43. Mal gucken ob ich ob ichdie summa high speed schnitte dieses mehr aushaltenNach all meinen jahren schule gibt es immer noch einiges dass ich einfach nie verstanden haben eines davon ist wer hat sich die regeln ausgedachtUnd verbreitet dass wenn lehrer nach 15 minuten nicht das ist schwachsinn hause gehen dürfteDas ist das das haben die bei mir schon in der schule erzählt aber das ist halt komplett das schwachsinn allein schon aushaftungstechnischen gründen kann das nicht funktionieren sollten schulden so eine regel haben jedes mal gab es bei mir immer irgendjemanden der nach fünf minuten meinteJo leute noch zehn minuten dann dürfen wir gehen ja ja das ist die regel glaubt mir einfach und falls das jemand von euch auch noch glaubtSorry schwachsinn die regel ist ja das ist ich meine jeder der nur irgendwie fünf gehirnzellen im kopf hat sollte eigentlich auf die idee kommenDass das bescheuert ist aber das haben die bei mir auch erzähltIch bin mir nicht sicher ob ich glaube bei mir waren sogar noch zehn minuten wenn zehn minuten keiner kommt oder soWir hatten es auch ein paar mal da kann ich mich noch daran erinnernWir hatten es auch ein paar mal dass sie lehrer wirklich nicht gekommen sind undDann sind die da sind die leute dann runter insBeim lehrerzimmer und da wusste dann auch keiner wo das stecktUnd da durften wir in in diesen pausenraum gehen für die stunde ja das ist ein paar mal passiert ich weiß bis heute nicht was mit dem los warWir hatten die ultra fertige lehrer also unsere chemie lehrerin die hat permanent gezittertUnd nachher habe ich auch rausgekriegt warum die hat sich halt öfters mal ein bisschen zu viel gegönntDas ist dann später rausgekommen und ein lehrer bei uns hat sich umgebrachtDas fand ich damals mega schockierendAber ein lehrer der hat der hatte bei uns auch den informatik kann man es nicht nicht nennencomputer kurs sagen wir mal der hat sich umgebrachtSagen wir mal der hat sich umgebracht und das fand ich damals richtig schockierbar ist es ja im prinzip auch du rechtest ja mit nixUnd auf einmal kriegst du morgens erzählt hier übrigens euer lehrer hat sich umgebrachtDas war schon heftig geschichte damalsJa genau so war das so war das bei uns auchMan ist dann man ist dann in zum lehrerzimmer gegangen und dann wurde geguckt was halt witzig warWas halt was halt witzig war bei uns dassDie im lehrerzimmer nicht mal wussten wo der typ warAlso wir hatten so ein üblichen üblichen verdächtigen also es war eigentlich immer der gleiche der zu spät gekommen istErst mal nach zehn minuten zum lehrerzimmer und hat gefragt wie es ist und da wusste auch keiner wo der istHat sich irgendwo abgeseilt zwischendurch und keiner wusste wo er stecktTjaIn den 2000 auch verständlich warum in den 2000er war die welt noch in ordnungWünschte es wäre war ich dachte auch immer die blaue seite von diesen radier gummys wäre zum tinte radieren daDas das dachte ich nie aber ich das dachte ich tatsächlich nie aber ich weiß bis heute nicht wofür die blaue seite der radier gummys eigentlich da istEs funktioniert nicht also wer hat sich auch diese lüftungEs funktioniert nicht also wer hat sich auch diese lüge ausgedacht und für was ist es sonst da ja anscheinend ist es wirklich für tinteAh cool merke ich bei klassenarbeiten war es bei mir auch immer mit tinte quatsch ernsthaftIch habe da nicht auf die ich bin noch nie auf die idee gekommen da tinte für das kannst du noch mit keine tinte mit weg machenAber wofür die blaue seite bei radieren da ist habe ich auch nicht verstandenDie lehrer haben ewig gebraucht um sie zu korrigieren und meinten zu uns immer so ja ihr seid ja noch in der mittelstufeIch muss zuerst die elften und zwölften korrigieren die machen gerade abitur ist viel wichtiger und ich denke mir ok ok ergibtDen doch sobald ich selbst in den abiturklassen bin heißt es hier ich bin klassenlehrer ja ich muss ich muss so viel von den unterenStufen nochDas ist einfach das ist halt einfach ausrede jaDas spielchen also und wieso machen lehrer auch das so oft sie sind am pc sie machen einen filmen und setzen sich nach hinten und lassen denMauszeiger durch geht mitten im bild wie jetztSehen sie das nicht wo ist das problem was macht man in der situation soll ich jetzt mittendrin nach vorne ich sehe das problem nichtDann werden wir alle wohl ein müssen irgendwann hat jemand von mir einfach einen normalen vortrag haltenIhr wisst wilder benutzt freigesprochen deswegen kommt am ende natürlichIhr wisst hand andere hand klatsch der klassiker doch plapper ich aus dem nicht haben alle ab da statt zu klatschen auf den tischGeklopft ja das verstehe ich auch nicht warumDas das habe ich bis heute auch das habe ich bis heute nicht verstandenMacht ihr das nicht ein bisschen falsch oder habe ich irgendwas verpasst habe nie krank will einer von euch erklären dass ihr abgehtHabs ab da nicht mehr hinterfragt und ab da auch immer gemacht ich verstehe es immer noch nicht zum nächsten ding französischEin anderes ding sind glami patrouille wieso jemand fragt hey hat ihr mit einer tinten patrouille wisst ihr was ich nicht versteheWarum schreibt man warum kann man nicht einfach mit bleistift mit mit bleistift oder mit kulli schreiben warum braucht man so ein so ein krab wie füllerVon handschreiben eigentlich heutzutage noch ich freibildlich wie ich bin haben natürlich eine parat hier hierAha dank oh nee nicht so eine ich brauche eine lami patrouille warum hat lami eigene tinten patrouille formenWarum passen die normalen weil weil wenn du lock inNicht rein die sind sogar kleiner was ich auch nicht verstehe die märchen ihr sitzt im klassenraum rum der lehrer kommt rein und kommt mit diesenDingern an erstens was ist das überhaupt und zweitens warum existieren die man kriegt ein testschreibAch das ist so ein sicht schutzdingerDa steht immer irgendwas drauf warum gehen bleistift aus rechtlichen gründen nicht wenn ich in der klasseSitze und mal also bei arbeiten kann ich ja noch verstehen aber wenn ich in der klasse sitze und dort was aufschreibe kann ich das doch machen mit was ich willUnd bei uns wollten sie auch immer dass man das mit füller schreibt was ziemlich bescheuert war aber gerade bleistiftMüsste funktionierenAblenkt und das design ist irgendwie und wenn ich wirklich abschreiben wollen würde könnte man ja trotzdemManchmal blockiert genau das teilt sicht zum lehrer entweder es gibt einen guten lehrer rabatt oder sie hat krasse special lehrer funktionen alles kann ich mir nicht erklären warum jeder lehrer diese tasche hat und wo wir bei taschen sind ich hatte bis zur sechsten klasse noch so einen schuhranzenIch hatte ich hatte ein east pack in east pack rucksack und die ganzen die ganzen coolen leuteDie haben bei uns immer weiß nicht ob man das heutzutage noch so macht east pack logoDie haben die haben das so übermalt dass dann also sie haben halt die haben quasi hier das das das e und das t übermalt dass dann asi pack drauf stande richtig richtig pains jamDas da war man cool damals wenn man das gemacht hat man hat einfach einen schwarzen adding genommen hat das e weggemacht und das t und dann war das asi packGenau das hier genau das genau das ja oder hat man sie richtig nice gefühlt weil asi pack hatteWährend alle anderen nach der zeit schon auf rucksäcke gewechselt sindEs ist nicht mehr cool es funktioniert doch noch einwandfrei was anderes was mich verwirrt so ein klassen frühstückAlso rucksäcke rucksäcke waren bei uns auch so ein ding also ich hatte ich hatte immer rucksäcke also ne in der grundschule nicht aber ich hatte immer rucksäcke und ich habe heute noch einen rucksack weil ich rucksäcke einfach praktisch finde aber irgendwann haben die leute bei uns dann angefangen so coole umhängetaschen so hipster umhängetaschen zu habenHipster umhängetascheNe ne ne ne nicht sowas okay hipster soll ich vielleicht weglassenDie leute hatten dann so coole so was da in der richtung die hatten dann alle so coole umhängetaschen nur nochUnd ich hab den sinn und die daseinsberechtigung von umhängetaschen bis heute noch nicht verstanden wenn man doch einfach einen rucksack anziehen kannDie bammelt nicht rum die ist nicht im weg ein rucksack passt mehr rein wo ist der sinn von einer umhängetascheWer von euch sich die mühe macht 60 brötchen zu kaufen um sie um acht uhr in die schule mitzunehmen also versteht mich nicht falsch ich bin dir auf ewig dankbar dass du uns für das team einsetzt und opferst oder deine eltern aber bro es gibt viel leichtere jobsKäse Brotaufschnitt Marmelade Obst ich hab zum beispiel zum klassen frühstück immer wasser mitgenommenwasser mitgenommen wasser perfektMarmelade ist halt auch easy stell sie drei kleser hin und gut istWasserWarum benutzen manche lehrer noch Overheadprojektoren vor allem wenn direktWeil warum wohlWeil boomer lehrer weil sonst ich hätte es nicht für möglich gehalten dass leute 2021 noch in der schule sitzen und lehrer Overheadprojektoren verwendenIch fand die dinger 1998 schon kackeAber zwar über 20 jahre später muss man sich den kram immer noch ergebenDa hinter ihnen ein pc mit bima steht ein pc macht nicht geräusche als würde das gleichNa bima bima ist ja für die also pc und bima ist ja nur wirklich für die meisten lehrer komplettes teufel zeug ich stelle mir das ähnlich vorBei uns hatten die lehrer damals probleme video recorder zu bedienen dann kam die dann mit dem fernsehwagen um die ecke und da musste immer der schleimer vom dienst vorne zum lehrer hin und dem helfen den video recorder einzuschaltenWeil die unfähig waren dafür soUndHeute ist es wahrscheinlich so dassProjektor projektor und pc das abgelöst hat und dann auch der schleimer vom dienst vorne hin muss und dem lehrer helfen den film zu starten auf dem pc warum können lehrer eigentlich das was man für ihre tägliche arbeit braucht nichtNa jaWas dein lehrer hat den aufwärtsprojektor per camera auf teams übertragen oh ja das ist da besonders tolle qualität gewesen dannNa gut schulpc sind tatsächlich mulattMan muss das nicht so komisch scharf stellen man kann jedes arbeitsblatt einfach direkt anzeigen das einzige was man machen muss ist den bima einzuschaltenOhUnd wie es für mich war bei solchen lehrern während der online unterrichtszeit mein abitur schulabschluss zu machen das hat er schon erzählt jaDie Zeit war wirklich weirdWeird champJetzt haben wir uns schon zwei videos von ihm angeguckt das heißt ich kriege jetzt hier die youtube youtube algorithm schlägt schlägt wieder zuWas ohne witz unser fernsehen hat damals nicht funktioniert und meine geschichtslehrerin hat ernsthaft gesagt kann man das nicht mit einer pdf verknüpfenIch wüsste bei dieser aussage noch nicht mal was sie eigentlich meintGibt es gibt es eigentlich schulpc die schon abgegradet sind auf windows 10 oder laufen die alle noch mit windows xpWindows 3 1 ist es nicht mehr aberDie laufen bestimmt alle mit windows xpSchon auf vista immerhinJa linux ist auch nicht verkehrt da ganz ehrlich in der schule je nachdem was man braucht ist da eine linux installation gar nicht so blöde draufWenn man nur also was weiß ich wenn man nur im internet gucken will oder irgendwie die ein oder anderen office dokumente machen will warum nichtEine linux geschichte drauf das muss kein win noch sein was auch den großen vorteil hat du fängst dir nicht irgendeinen scheiß einIst das nur in deutschland so mit technik ja in kolumbien ist es besserDas geht das geht doch sogar noch ich meine kann durchaus schlimmer seinInternet explorerAlso ich weiß noch in der berufsschule in der berufsschule da hat der lehrer so eine eigene remote steuerung software selbst programmiert allein schon das ist eineSehr merkwürdige idee gewesen zumindest war dieses dingEtwas verbackt der hatte das war relativ simpelDer hatte quasi auf jedem rechner einen agent installiert und vorne hat er halt so ein steuerungs ding gehabt da konnte er auch die bildschirme sperren per knopfdruckAber du konntest ohne problemen diese software beenden nicht weil du rechte dazu hat das das haben sie geschickt gemacht also hat es nicht die rechte die software zu binden aberDu konntest einfach in telnet machen telnet localhost port was weiß ich 5050 weil die software auf 5050 liefUnd dann hast du einfach telnet gemacht auf 5050 und hast irgendeinen random shit reingeschriebenUnd die software war nicht in der lage random shit zu verarbeiten ist gecrashed und dann konnte er den rechner nicht mal sperren und war immer höchst verwirrtArch by the way ja so ist esWie nicht archlinux warum archlinux ist das einzig wahre da kann man nämlich der ganzen welt erzählen dass man beide bei archlinux by the way verwendetAch cmd ist gesperrt bei den schulrechnern das ist aber schwierig in einer lageIn einer fachinformatiker ausbildungsklasse weil dann brauchst du manchmal die cmd für dingerArchlinux was archlinux ist archlinux ist by the way archlinux das beste linux was es gibt by the wayArchlinux ist eine linux distribution für absolute hackermans wird nur noch getoppt durch gendu alles selbst kompilierenOder linux vom scratch drei monate bauen und dann nicht am end nicht mehr aktualisieren könnenAlso ich glaube archlinux by the way wird bloß nicht mehr aktualisierenAlso ich glaube archlinux by the way wird bloß noch von gendu selbst kompilieren getopptJa wir hatten in der berufsschule auch die üblichen geschichten drauf cs dungeon keeper hatten wir noch draufDurfte man zwar offiziell nicht spielen hat man aber trotzdem gemacht das war dann immer so das kann man daran erinnern stunde ist vorbei stunde ist vorbeiUnd man hat gesagt wir sind nicht ganz fertig geworden können wir die pause über hier in dem raum brauche in dem raum bleiben wenn die nächsten kommen gehen wir rausUnd haben die lehrer eigentlich in der regel immer gesagt ja ja macht ruhig in ruhe fertig ich lasse euch aufUnd da haben die da sind vorne an den plan haben raufgeguckt okay nächste stunde ist hier ist hier klasse xy drinneUnd sowieso lehrer passt okUnd da haben wir dann quasi zeug gespielt in der pause lehrer hat natürlich gedacht wir mal wobei ganz ehrlich lehrer sind ja auch nicht blödWir haben gesagt wir wollen das zeug fertig machen dem war klar dass wir irgendwas spielen die sind ja auch nicht dummDie wussten bloß okHauptsache sie können es offiziell abstreiten dass sie davon wusstenDie wussten bloß ok das hauptsache sie können es offiziell abstreiten dass sie davon wusstenRichtig hackermans kompilieren alles selbst das ist stellt euch mal vor soll es richtig krass agent du hacker manIhr bekommt eine mail geschickt mit einem open office dokument im anhang da müsst ihr erst mal fünf stunden open office kompilierenOder chrome leute hat mal jemand ernsthaft von euch chrome selber kompiliertWisst ihr eigentlich wie lang das dauert wie kompliziert das ist und wie viel ram und plattenplatz das brauchtDu brauchst da irgendwie keine ahnung 60 gigabit nach geht es übertrieben du brauchst da schon16 16 g ram 80 80 g festplatte und es läuft trotzdem zwei stundenAlso chrome selber kompilieren ist glaube ich das schlimmste was man machen kannAlso wir hatten nur ein lehrer der selbst was gespielt hatUnd der hat immer während der stunde während die leute was gemacht haben hat er immer world of warcraft forum gesurft vorne am rechnerDer hat world of warcraft gebrauchst die halbe stundeJa wahrscheinlich reicht es wahrscheinlich reicht es für chrome auch nicht ich habe jetzt einfach mal 16 g gesagt das kannst du knickenHey day auf dem ipad was ist denn hey dayIrgendein casual casual game oderOr farmbild ein farmbild clone oh meine güteDer war kurz afkWas ist das dachte in overwatch geschichteNa ja so was können wir uns als nächstes gebenZeigst mal herNochmal eine chance youtubeNein kündigung bei ubisoft ja das sind eh so dreck säcke ne ist jetzt super ist eine super geschichte wir kündigen einfach mal eine woche vor weihnachten was ein scheißladen oderIch weiß einfach mal leute vor weihnachten raus wahrscheinlich macht es dann macht sich dann besser im jahresabschluss oder soOder sind die leute selbst weg gerannt ach andersrum die leute sind ihn abgehauenAch sehr noch besser ok dann ist gut dann ist gut in den würde ich wünschen dass alle leute wegrennenAlle wegAlle wegScheißladen ja die haben sich besser verdient ich hoffe blizzard rennen auch die ganzen leute wegIhr habt ubisoft azubis in der klasse poc was ubisoft hat fisi azubisOk nice warum nichtJa 50 Milliarden lang ist schon hugeSo also was kommt jetzt an was ist dasBudget storage server 2021 ist das aus dem kokona landWenn es nämlich aus dem kokona land ist dann ist das für uns nicht wirklich übertragbarWeil die haben es nicht so mit strompreisenBei den amis sind die strompreise viel billigerIch frage mich immer was die alle machen ich mein 80 terabyteIch nehme ja auch ein bisschen gameplay auf und sowas dass ich was dass ich was habe für für zukünftige videos aber ich wüsste gar nichtWo ich achte wofür ich 80 terabyte für als als content creator für content bräuchteNa ja das teure dabei sind ja eh die festplattenBei so einer also bei so einer kapazität sind das teure die festplatten und die festplatten kosten gleich viel ob ich sie jetzt in den zynology reinpacke oder ob ich die jetzt inKeine ahnung meine bei ebay gekaufte 2h e-kiste mache 80 terabyte wenn man davon ausgeht der nimmt 10 terabyte platten das sind 18 terabyte platten das kostet 4000 euro die platten so über den daumen gepeiltUngefähr 4000 euro für die platten muss ausgeben da macht der macht das preis für so ein einsteiger zynology oder irgendwie macht der da auch nicht so fettsind das 80 terabyte ohne redundanz oder backups das ist die frage keine ahnung wenn das 80 terabyte nach irgendwelchen rate geschichten sind braucht er ja noch viel mehr platten müssen wir uns angucken keine ahnungKeine ahnung das problem ist dass die platten so teuer sind genau genau das ist das problemOkay 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 okay wie ich gesagt habe 8 terabyte mal 10 oder halt ne ich habe gesagt 8 mal 10 und er hat 10 mal 8 aber das ist trotzdem das kostet wahrscheinlich trotzdem irgendwie 4000 pro ne ne ne wobei 8 ich glaube 8 8 terabyte sind günstigergünstiger oh was okay 200 euro oh ein paar amazon180 euro also 180 mal 8 ne ach mal 10 ja das ist gut das muss ich dann rechnen also ungefähr 2000 euro für platten was kostet eine 18 t platte 18 tbdas ist richtig günstig geworden warum ist das denn so günstig amazon ich habe meine ich habe vor zwei jahren oder so eine 12 terabyte platte gekauft und die hat glaube ich noch 400 euro gekostet oder sosack orders das ist rausch liegt am handy z gate glaube ich war das noch z gate z gate 10 tb ne das ist die falsche was haben wir sonst noch anstatt z gate haben wir noch wd ne wd stopp wd habe ich gekauft nicht ed alter autocorrekt autocorrekt auf dem handy wdwd interne platte ne dies von 2000 disc disc alter warum ist die suche bei amazon eigentlich so scheiße dass du nichts findest fest platte hier 10 tbes ist aber die falsche ich habe 12 tb aber hier sind aber 10 10 10 tb die hat die hat schon gekostet oder details 2017 hat die 400 euro gekostet 400 euro für eine 10 tb platte das ist tatsächlich relativ günstig gewordendurchaus in ordnung das das das geht ja direkt gucken wir mal geizhals kurzes gibt schon 20 terabyte es gibt sogar schon 20 t massive was ist die größte festplatte die es aktuell gibt 96 ja aber guck mal 447 ach ne momentein bisschen laut die musik lull warum ist das dochhä hier hard drives so gucken wir mal ok 20 ah da sind wir schon in anderen preisregionen ok ok das sind 24 euro pro terabyte und wie sieht es aus bei den18 auf viel viel günstiger alter pok champ so jetzt machen wir das mal raus und jetzt sortieren wir mal alles nach preis preis pro terabyte ok die günstigsten sind anscheinend wirklichdie günstigsten sind anscheinend wirklich 14 14 terabyte 18 ne mit mit einer der günstigsten sind die hier guck mal 18 terabyte sind die mit dieser fake plattenüberlagerungsmagnetechnik oder ist das normal mit mehr platten drinneexos enterprise ja das ist eigentlich gar nicht schlecht ich meine mal ernsthaft 300 euro das ist das ist durchaus okequipper hat schon mal jemand bei equipper bestellt a mine factory nur 309 euro ich bin ich bin geneigt mir da sogar eine zu bestellenja nice egal gucken wir das video mal weiter also aber auch was man hier sieht trotzdem die festplattenpreise sind wahrscheinlich das entscheidenderelativ gut das ding braucht wahrscheinlich massig strom weil es relativ alte server hat wer von ebay istwas hast du den shitstorm wegen dem neuen arch lilux wiki layout bekommen ne schauen wir mal wie ist denn das neue layoutist das ist das schmaler geworden im vergleich zu sonst ansonsten sieht das doch mehr oder weniger noch exakt so aus wie vorheraußer dass es glaube ich ein bisschen schmaler ist dann sieht man es eh besser mit boomeraugen und schon hat man die ganze seite wieder ausgefülltman hätte einfach gucken können wenn die geräte groß sind dann macht man das breiter das ist halt das ist halt das ding wenn man mobile firstmacht heißt ja nicht dass man desktop last machen muss man kann ja mobile first und desktop first machen es gibt ja media querieskannst du einfach sagen wenn gerät größer ist als also man braucht ja diesen diesen mist gar nicht so zu machen das ist auf dem fetten desktopweil es gibt ja mal ehrlich gesagt es gibt ja überhaupt keinen grund warum auf dem desktop das nur die hälfte des bildschirms verwenden sollteeinfach ein media query gemacht und gesagt hey bildschirm ab einer gewissen größe einfach das hier größer machen ich meine so schwer kann das ja nicht seinpage main content main content so wo stehts hier max width 80 so schwer wäre das jetzt da nicht eine media query zu machen was das hier macht oderoder oder oder sah das jetzt super komplex aus das zu implementierenHIich könnte sogar noch weiter gehen und sagen 100 prozent das geht nicht ok jetzt habe ich jetzt habe ich geprägtJetzt hab ich's geprägt.Nee, aber ihr wisst, ihr seht, was ich meine, also an sich, an sich gar kein Problem.Okay, jetzt wird's durch was anderes limitiert, aber es wär kein Ding gewesen, sowas einzubauen,wirklich nett.Die Seite ist besser lesbar, wenn sie schmal ist, naja, also da kann man sich jetzt wirklichdrüber streiten, also ich wüsste jetzt nicht, wo das Sinn sein sollte, zu sagen, hey, duhast zwar einen fetten Bildschirm, aber wir benutzen nur die Hälfte.So, gucken wir, gucken wir doch mal, ob das stimmt, ob das schlechter, wir gucken jetztmal, ob das stimmt, ob das schlechter lesbar ist, wenn ich das jetzt überscale, 100, nee,ich bin falsch, oder, so, guck mal, ungefähr so sah das vorher aus, ungefähr so sah dasvorher aus, und weiter ist das jetzt so viel schlechter lesbar, außer dass man seinenkompletten Monitor verwendet, und mal ganz davon abgesehen, man könnte ja durchausirgendeinen Toggle einbauen dafür, ja, das ist ja für Hacker-Mans, für Casual-User istdas ja nicht gemacht hier, also da kann mir jetzt keiner erzählen, dass das hier superschwerzu lesen wär.Ungefähr so sah das ja früher aus, und wo, wo, wo gibt es da jetzt den Arch-Wiki,und wo gab es dann den Shitstorm dazu, Arch-Wiki-Shit-Shitstorm, das findet man nichts dazu, wahrscheinlichauf Reddit, oder, wahrscheinlich auf Reddit, so, guck mal mal weiter, Budget-Storage-Server.Gen-Bro, die China-Chinesen-Pros, was ist drinne, Säck, Säck, Säck, Säck, Säck,Säck, Säck, DDR3 ist schon eine ganze Ecke älter, die Kiste also, Xeon Quad Core sagtja mal gar nichts aus, kann ja alles sein, maximal 8G, also ist auf jeden Fall, ist aufjeden Fall, oder E3, okay, das ist in die Desktop Xeons gewesen, das ist 6-7 Jahrealte Hardware, die verbrauchen auch ein bisschen mehr Strom noch, wir brauchen einen China-Keks,das stimmt, wir brauchen einen China-Keks, ein China-Chinesen-Keks, ja, das brauchen wirwirklich.Ja, das ist von 2000, 2014, oder so, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja,ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja.Ja, natürlich sind die Dinger schwer, das ist halt auch ein Kupferblock, aber, das istnormal ins surfer hardware die kriegen ja auch die luft so durchgezogen oder ich weiß jetzt nichtwo vorne und wo hinten ist wahrscheinlich ist wahrscheinlich ist das hier das hier vorne unddas hier hinten wird so durchgezogen quasi ist ja immer so all of its airflow from the 40 millimeterfans place towards the middle of the case also der threat wenn ich wenn ich schon die den titellese das sind wieder ultra viele geträgerte linux fanboys dabei sehe ich jetzt schon in plasticshroud that ensures three of the fans blow directly onto the heat sink and ram the motherboard thesystem uses is on the lga 1155 platt der gute alte vga port der darf bei server natürlich nichtfehlen und ihr werdet lachen so gut wie jeder server der im rechenzentrum steht heutzutagehat immer noch einen vga port wobei wobei ich sagen muss so ganz stimmt es nicht ich war mitphoenix vor noch nicht allzu langer zeit im rz unsere neuen dellkisten haben glaube ich nebenvga auch display port aber vga geht halt einfach company called tyan it is for ram slots a bunchof pcie slots which aren't that important because of the systems when you form factor but would begood in a more standard thickness case the io on this board is for usb2 ports dual gigabit ethernetmanagement an ipmi port vga serial and a uid led button this isn't great for a normal system butfor a server this selection of ports is fine the real feature of this board that makes it perfectfor this use case is the 14 yes 14 built-in sata ports this allows all 12 of the main drives toplay directly into the list ja wisst ihr was ich daran doof finde es ist kein hot swap das heißt dumusst auf jeden fall selbst tracken wo was angeschlossen ist das heißt du musst dir dieseriennummern sollten notieren wo was angeschlossen ist also welche platte welcher seriennummerentspricht musst du eh machen und du musst es halt aufmachen und und also wenn du da jetztkein rack hast mit schienen wo du easy rausziehen kannst vom platz her aufklappen kannst und dieeinzelne platte raus machen ist das dann auch nicht so schön dann lieber ganz ehrlich dannlieber eine 2he kiste wo du die nämlich hochkant reinstecken kannst die platten und dann kannst dudie platten hochkant reinstecken und bekommst es auch in ein gehäuse und kannst hot swapendas bringt überhaupt nichts weil das was da dran steht heißt ja noch lange nicht dass das imsystem auch sda 1 wird oder sowas das ist das einzige was du machen kannst ist du musstdir einmalig aufschreiben also wenn du kein kein gehäuse hast was das unterstützt mitmanagement kabel und led anzeige welche festplatte das ist das einzige was du machen kannst istausgabe unter linux machen die weiß zu ordnung zu seriennummern jetzt also port zu seriennummer unddann am besten noch ein aufkleber drauf machen was was ist dass du es wie dass du es findestlinux sagt ja nicht linux sagt ja nicht hier die dritte platte von vorne ist ausgefallen oder so dasagt ihr entweder sd sdb oder stc oder was auch immer ist ausgefallen oder halt im zweifelsfalldef bei serial bla bla bla ist ausgefallen schön und gut aber dann musst du es halt immer nochsuchen welche welche das ist und ich glaube da hat keiner bock dann mit der lupe und der lampehinzugehen und drauf zu leuchten was hat es denn jetzt für eine seriennummer gehabt also sortierungim gehäuse spiegelt sich nicht zwangsläufig wieder in sortierung in intern wie linux dieplatten erkennt und das ding würde gar nicht in meinen rack reinpassen weil esglaubt wahrscheinlich 80 zentimeter oder so ist oder das dürfte fast schon ein meter sein alsoaber 80 zentimeter so eine komplette bautiefe die passt immer mini rack gar nicht rein meinrack ist ja bloß glaubt 40 zentimeter tief pack considering how much hardware can fit in itwith the server picked out and received i could start figuring out and ordering other parts for asystem like this you ideally want ecc memory but unfortunately this doesn't really memorybecause of this i hopped onto ebay looking for a ram kit that would fit my needs and budget what iended up getting was four four gigabytes sticks of crucial unbuffered ddr3 ram running at 1066megahertz these four sticks cost a total of around 43 dollars which is an okay deal for unbufferedecc ram 16 gigabytes is an adequate amount especially for the configuration i ended upwith and luckily they installed and worked flawlessly in this system with ram picked out all that wasleft to do was purchase drives i did a bunch of thinking and planning to get drives and waswaiting for good deals on higher capacity it's jetzt werden wieder die extern platten ge wieheißt das geschackt wie lade sich das wenn man das wenn man das wenn man das raus ripptaus so ein extern geschackt ist das glaube ich wenn die hdd ist geschacktalso es war mal eine zeit lang so dass die festplatten in solchen externengehäusen wenn du die ausgebaut hast die platten die drinne waren dass es billiger war sich so einexternes gehäuse zu kaufen als die platte selbst die drives but with the looming possibility of adrive shortage due to chia mining i eventually decide to pull the trigger on 10 8 terabyteextern seagate drives see normally you would buy stand-alone drives but believe it or not it'scheaper to buy the external version ja sagte ja ist immer noch so wobei ich jetzt gelesen habedass viele hersteller da gar nicht mehr normale sata platten drinne habenund take the drives out of them this practice is known as shocking ja sag ich doch wenn geschacktwerden sie within the data hoarding community again i originally wanted to get something like 12 or 14terabyte drives but i couldn't find a good enough deal so again purchase 10 8 terabyte drives anaverage of a hundred twenty five dollars each this totals to twelve hundred fifty dollars spent onmechanical drives for the array i also purchased a 500 gigabyte sata ssd to be used as a cash drivethis is the mx 500 which is a good quality sata drive and i'll be explaining more details aboutusing it as a cash drive later in the video with all the drives in hand i could begin shocking openingup the packaging on one of these drives i found that was heißt das eigentlich direkt übersetztschack ging deutsch entleeren ah also quasi ok verstehei've itself some paperwork a usb cable and a power cable i start by taking the drives out of theirpackaging and plugging them in to ensure they powered on and reported normal functionality oncethis was done i could begin opening them up one thing to note is that taking the drives out ofthe casings does void the warranty but these drives are much cheaper than their standalonecounterparts so you have to decide for yourself if the cost saving is worth it or not to get intothese enclosures you need to start by wedging something super thin which is not the stuffin dem fall tatsächlich auch mal nicht außer acht lassen die chancen bei wie viel hat er jetzt zehnzehn platten dass das ist aber so in den ersten eins zwei jahren mal eine kaputt geht ist nichtso unrealistisch und umso mehr platten man hat umso sinniger finde ich sich dass tatsächlichdas normale ding vom hersteller zu kaufen weil die tauschen das ja bis zu fünf jahren oder biszu zehn jahre teilweise noch um die gefährlich aus mit dem cutter wir wissen aber schon dasser sich nicht schneidet weil sonst könnte youtube das video nicht sonst könnte das video nichthochladen weil selbst verletzten ist ja nicht erlaubt auf youtube dann bleibt die garantieerhalten dass es gut gut zu wissen guck mal da hat der gleichen fehler gemacht wie ich der hatsein i fix it spachtel schon zu oft in ritzen geschoben die nicht richtig aufzumachen gingund hat verbogen erinnert sich noch einer wo ich den wo ich wo ich den spachtel an der steckdosekomplett verbogen habe musstest du mal eine platte umtauschen ja schon mehrfachvon teuren sachen die rechnung ich muss dir ehrlich sagen ich glaube mich hat noch nichtein festplatten hersteller wirklich nach der rechnung gefragt dann musst du seriennummereingeben und auf geht's ich bin mir nicht mehr sicher aber nachdem ich fast nur wd und siegeld habe wird es wahrscheinlich auch ich glaube wd wd wd cream musste ich ein paar umtauschenwd cream waren das 2 terabyte wd cream musste ich einige mal umtauschen da habe ich bestimmt45 umgetauscht über ein paar jahre also behältst du auch den teuren sachen die rechnung nö weilich bestell die sachen online zweifel zwei kann ich bei amazon die rechnung einfach ausdruckenich bestell fast nur noch online alsoich glaube ich habe letzten jahre über nichts offline gekauft wo ich eine rechnung hätte aufhebenmüssen also ich vermute mal nicht dass sie das prüfen ich bin mir nicht mal so ganz sicher alsoich glaube das war folgendermaßen du gehst bei wd komando wd return hard drive guck mal probieres doch mal aus return policy wd check drive failure product also immerich bin unfähig das zu finden jetztich bin immer noch nicht mal sicher ob ich die überhaupt zurück schicken musste dieein doch die muss ich zurück schicken ich glaube nicht dass die wirklich prüfen obdas kaputt ist vielleicht wenn du jetzt so notorischer zurückschicker bistich habe mal eine frage du hast ja ein bisschen mehr mit den lux zu tun ich habe für einabschlussprojekt bei der ihk ein nassserver mit 32 gigabyte ram nun ist meine frage ist es richtigwenn man ab 16 g nur noch 8 g swap hat also bei 32 g nur 16 g als swap oder ist das wie alle sagendas doppelte das grundsystem mit dem das musst du dir überlegen ich habe mittlerweile gar keinswap mehr also ich habe bei meinen linux kisten die haben 16 gigabyte ram ich habe gar kein swap mehrob man das ob man das machen sollte keine ahnung aber es funktioniert auf jeden fall aberletztendlich kommt ja drauf an wartet mal letztendlich kommt ja darauf an was du erwartestwas du mit dem system machst ich glaube so eine so eine pauschale regel mit doppeltem ram istbei einer großen ram anzahl irgendwie unsinnig ich meine du bräuchte es ja dann quasi stellemal vor du hast 128 g ram dann bräuchte es ja eine extra ssd für swap ja und wenn duund wenn du 16 g ram hast ist die frage ob ich 8 g swap noch retten also was was also wenn manauf nummer sicher gehen will würde ich wahrscheinlich bei 16 g ram noch mal 16 g swap machen und bei 3232 g würde ich wahrscheinlich auch noch mal irgendwie 16 g ja finde ich finde ich finde ichsinnig ganz ehrlich aber ich würde es wahrscheinlich komplett ohne swap betreiben ab 16 g ramwenn es ein ssd ist hast du mehr wo du speichern kannst drauf und 16 g ram musst du ja aucherstmal voll kriegen das ist gar nicht mal so einfach außer mit fünf elektronen anwendungund ein paar chrome tabs was ist swap das ist quasi auslagerungsdatei unter windowsbraucht man eine swap datei für hibernate ich dachte das kann der anderweitige speichernne oder ach keine ahnung ich habe schon so lange keine liegungskiste mal hibernate iphonehabe ich auch online gekauftbei den server würde ich nicht hibernate deswegen sage ich ja ich habe schon ewig keine liegungskistemal hibernate ok weil meine vms hibernate ich nicht da nehme ich die vmw Geschichte zum zum postchampen und server werden nicht hibernatedas board das little board ist just a saturday usb adapter and i may save these to use in thefuture with one drive done i then had to repeat the process nine more times and here's a littletimelapse of me doing it wird geschockt geschackt wird der master schacker schacking intensifiesso with all the drives out i was ready to mount them now when shucking external drives you neverreally know what you're gonna get most of the why benutzt du ein iphone und x android mäßiges okda kann ich jetzt wieder die aus dem weg geringverdienerkarte ziehen ich habemittlerweile 13 geräte bei mir daheim und ungefähr die hälfte davon ist androidthe seagate external drives use iron wolf nas or even exos drives which are super high qualityand one of the reasons i originally wanted to go for the larger capacity ones inside of theseeight terabyte external drives were 10 seagate barracuda compute ones these are model numberst8000 dm 004 and i got these for about thirty dollars less per drive compared to buying thesestand alone that's what i saved around three and get geschockt schocken schocken lohnt sichdollars buying as external ones this is when i came to a very important realization these areactually smr drives smr or shingle magnetic recording is an inferior and outdated designwhich is very unideal for certain use cases but with them all shocked i had to proceed withthe shagged and in the end it worked out fine for my use case which i'll explain in a minute tomount these i needed a few things that didn't come with the case i needed these little rubbergaskets that i got off of amazon and some 630 second bolts that i got from my local hardwarestore the gasket slips over the bolt that one is secured into each of the four bottom mountingholes on the drive i installed four into each meaning 40 once again with anti-vibrations nipple40 gaskets the first one was brought to mount number one the sata data and power was plugged init was lowered down and then slid back to secure all four gaskets into place with the first onedone all i had to do was install the other nine drives one at a time into mounts two through tenwith that completed the last component i had to install was the cash drive which is in mount11 and currently not secured but i will probably mount it with some double-sided tape in thefuture with that done i needed to decide what kind of os and file system i'd be using with this ioriginally debated between true nascore with a zfs raid z2 file system but because of the wayzfs stripes data across the array shows that smr drives would not be good to use in that kind ofja kann ich mir vorstellen dass das warum will er denn zfs machen wenn er kein kein rate gedöns machtweil es hat durchaus auch so vorteil aber ich glaube nicht dass er die braucht ja ich glaubeder will keine snapshots machen und keine off-site zfs backups und und sonstige dingermal gucken was er einstellt schauen wir maler will ja kein rate machen glaube ich zumindest deswegen verstehe ich nochweniger was er mit mit zfs hatset up this made the choice to use unrate much easier now unrate is paid software but it'sunrate warum stehen die alle so auf unrate ich verstehe es nichtalternative to raid or zfs ich muss mit leute wir gucken uns das wir gucken uns das mal anstreben ideen unrate wir gucken uns das mal in einem stream an was was haben die alle nur mitunrate das was ich bisher davon gesehen habe hat mich so null überzeugt moment die geek freaks dasist doch der das ist doch das ist doch dieser channel auf youtube mit dem wir optimierenwindows auf 15 mb runter und sowas ach nee das ist hier hochgeladen downloadkann man das wenigstens ausprobieren ohne lizenzbasicich es hat mich bisher überhaupt nicht geschockt aber ich würde es für den stream mal ausprobierenja 90 tage ok machen wirja aber aber du kriegst auch keine performance boost genau aberder heim erinnert noch undzu dem Erreifungsgerät. Für mich ist das toll, weil es eine Menge archivales Stauern bedeutet,das reliable und mit einer hohen Anwendung sein sollte, aber der langsame Geschwindigkeit bedeutet,dass das Editing direkt vom Erreifungsgerät nicht möglich ist, was wiederum gut für mich ist.Setzten Unrate ist sehr einfach und ich habe einen Guide von Juan M. Tech verfolgt,der eine tolle Arbeit auf Erklärung der Basis des Setzes gemacht hat.Ich habe gar kein ZFS mehr am Start, ich hatte ja die, kennt ihr ja, habe ich euch ja letztensim Video gesehen hier, Server Raum, Server Raum, da liegt er, da liegt die alte 4 HE-Kiste.Mit, das hatte ZFS-Rate drauf, das war eine richtig fette Kiste für damals 8 Kerne Xeon,ich glaube 48G RAM und sonst was, das war ein richtig fettes Ding, sogar mit Lüfter-Mod hier.Und das habe ich mittlerweile alles rausgeschmissen zugunsten einer Low-Power-Intel-Kiste.Hastest du schon mal einen Stream über Ansible gemacht?Ja, wir verwenden Ansible öfters hier im Stream und wir haben auch mal zusammen komplettgelernt und Files from scratch erstellt.Wie funktioniert das? Wie funktioniert das bei Android und USB? Startet das immer vonUSB und schreibt das restliche Betriebssystem in RAM oder wie ist das? Sodass es weiterläuft,wenn ein USB abkackt. Ja, ja das ist sinnvoll. Ja, ich habe nicht zugehört. Und wenn manSettings speichern will, muss man wahrscheinlich explizit sagen, ja ich will jetzt USB schreiben,wahrscheinlich. Die Streams gibt es archiviert, ja. Die Streams gibt es übrigens archiviert auch,mach mal Ausrufezeichen Archiv, ich weiß nicht, ob das schon geupdatet wurde. Oder was? Archiv?Ach so Archiv. Ja, also es ist noch nicht alles hochgeladen. Es gibt jetzt einen VOD-Channel,wo findige Mods die ganzen alten VODs hochladen von mir. Aktuell gibt es noch einen Google Drive.Ach guck mal, es gibt schon, alter, guck mal die Mods sind mal richtig, richtig advanced,guckt euch das mal an. Kürzliches Streams. Gibt sogar, gibt sogar hier Übersicht, Jahresansicht,kürzlich Stats, richtig advanceder Shit, den wir hier langsam haben. Also auf den YouTube-Channelkommen alle VODs, den betreibe nicht ich und ist auch nicht verlinkt mit meinem YouTube-Account,weil falls Strike wegen Musik im Hintergrund oder so. Und aktuell gibt es, die TXT-Suche geht noch,gibt es einen Google Drive, wo man gucken kann.Hat jemand schon mal versucht, ob man das mit Ubuntu auch gut hinbekommt? Ubuntu booten von USBund quasi dann RAM, komplett im RAM laufen lassen, read only. Da muss man bestimmt ein bisschenselbst von Hand wurschteln, bis das funktioniert. Ja, das probieren wir demnächst auch mal aus.Wie gesagt, mich hat das bisher nicht überzeugt, aber wir probieren das mal für den Stream aus,mal wirklich komplett live, mal ausprobieren. Vielleicht machen wir es sogar auf einer echtenHardware-Kiste, weil ich habe ja meine 4HE-Kiste hier noch rumstehen.Okay, sind 60 TI am Ende noch übrig. Leute, sind es jetzt TBbyte oder TBbyte oder Terabyte oderoder was ist das jetzt? Also das sind auf jeden Fall in bytes. So, aber ich kann es mir einfachnicht merken. Also TBbytes sind 1024 oder wie ist das?Okay, wie sieht es mit Stromverbrauch aus? Das ist das, was mich eigentlich interessieren würde.Hat er irgendwas zum Thema Stromverbrauch gesagt? Das zieht schon ein bisschen was. Also ich denke,das könnte durchaus 200 Watt Eidl ziehen. Auf was würdet ihr so tippen? 200 Watt Eidl?Ich denke, es kommt wahrscheinlich ganz gut hin. Hast du einen Pop-Schutz auf deinem Mikrofon?Ja, auf dem normalen schon, auf dem Headset nicht. Auf dem Headset ist halt das ganz normale Teildrauf. Ja, ja klar ist bei ihm der Strom billiger. Das ist ja das Ding. Bei uns in Deutschland istStrom allübelst teuer. Und ich muss aufs Klo. 50 Watt Eidl. Nee, das braucht auf jeden Fall mehrals 50 Watt Eidl. Okay, wenn alle Festplatten im Sleep sind vielleicht, wenn alle Festplatten im Sleepsind, der Rest gar nichts macht vielleicht. Leute, ich muss aufs Klo. Ich gehe jetzt off.Vielleicht mache ich nachher nochmal streamen. Vielleicht mache ich nachher nochmal streamenund wir basteln ein bisschen, muss ich mal gucken. Schön, dass ihr dabei gewesen seid.Heute ein bisschen kürzerer Aufwachstream, weil wir jetzt drei Tage in Folge gestreamt.Gestern insgesamt über sechs Stunden. Reicht. Bis denn. Macht's gut. Wir sehen uns Leute. See you.", "segments": [{"id": 1, "start": 30.0, "end": 35.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 60.0, "end": 74.0, "text": "Fuck. Moin."}, {"id": 3, "start": 74.0, "end": 83.0, "text": "Moin Leute."}, {"id": 4, "start": 83.0, "end": 100.0, "text": "Boah, ja, exzellent, exzellent."}, {"id": 5, "start": 100.0, "end": 123.0, "text": "Ich bin zwar schon irgendwie 40 Minuten wach, aber ich bin nicht wirklich wach, ist ja so, also halb wach."}, {"id": 6, "start": 123.0, "end": 133.0, "text": "So. Irgendwie kommen auf meinem Vorschaubildschirm wieder irgendwelche Chatnachrichten nicht an, das ist auch ziemlich bebäger."}, {"id": 7, "start": 133.0, "end": 139.0, "text": "So, müssen wir mal refreshen, vielleicht geht es dann."}, {"id": 8, "start": 139.0, "end": 147.0, "text": "Mal kurz testen. Keg. KegU. Ja, jetzt kommt es gleichzeitig an."}, {"id": 9, "start": 147.0, "end": 159.0, "text": "Okay, müssen wir einfach mal den Browser-Tab refreshen. Hat sich Chrome gedacht. Nee, machen wir nicht, kein Bock."}, {"id": 10, "start": 159.0, "end": 170.0, "text": "Chrome. Warum heißt Chrome eigentlich Chrome?"}, {"id": 11, "start": 170.0, "end": 180.0, "text": "Weil Google Chrome ist Chrome."}, {"id": 12, "start": 180.0, "end": 201.0, "text": "Okay, jetzt kriegen wir es erklärt. Der Zoomer muss kurz weg."}, {"id": 13, "start": 201.0, "end": 210.0, "text": "Also, product must name Chrome. Codename."}, {"id": 14, "start": 210.0, "end": 217.0, "text": "Die dümmste, naheliegendste Antwort ist in dem Fall tatsächlich richtig."}, {"id": 15, "start": 217.0, "end": 232.0, "text": "Autos und Geschwindigkeit. Das ist ja langweilig. Dachte, das hätte vielleicht irgendwelche spannenderen Hintergründe, warum Chrome Chrome heißt."}, {"id": 16, "start": 232.0, "end": 247.0, "text": "Naja, nee, bin ich nicht."}, {"id": 17, "start": 247.0, "end": 266.0, "text": "Leute, ich habe Cobalt letztes Jahr. Brauchen wir fort dran dieses Jahr."}, {"id": 18, "start": 266.0, "end": 278.0, "text": "Ja, Leute. Seid ihr schon wach? Also ich nicht. Ich befinde mich so in einem halb wachen Zustand."}, {"id": 19, "start": 278.0, "end": 285.0, "text": "Ich kann mich gar nicht dazu überreden, jetzt meine Maus in die Hand zu nehmen und irgendwas zu klicken."}, {"id": 20, "start": 285.0, "end": 297.0, "text": "Habt ihr schöne, ich habe Socken gekriegt. Die übliche Geschichte."}, {"id": 21, "start": 297.0, "end": 316.0, "text": "Ich habe Socken gekriegt. Bist noch wach, Pog."}, {"id": 22, "start": 316.0, "end": 322.0, "text": "Buch, richtig old school. Betrucktes Papier."}, {"id": 23, "start": 322.0, "end": 335.0, "text": "Du hast einen Xbox 360 Elite Controller bekommen. Das ist tatsächlich nice. Die gibt es ja so neu nicht mehr."}, {"id": 24, "start": 335.0, "end": 341.0, "text": "Ach Moment, du hast so einen normalen Controller gekriegt."}, {"id": 25, "start": 341.0, "end": 357.0, "text": "Weil die gibt es gar nicht mehr zu kaufen. Wenn du hier nach Xbox gerade wired, nicht weird champ wired, ist also"}, {"id": 26, "start": 357.0, "end": 370.0, "text": "wirklich wirklich schwierig zu finden. Also die gibt es kaum noch zu kaufen."}, {"id": 27, "start": 370.0, "end": 377.0, "text": "Das ist alles, das ist alles fake. Guck, seht ihr hier, das ist, das ist alles fake."}, {"id": 28, "start": 377.0, "end": 385.0, "text": "Das ist der originale. Das andere ist alles fake."}, {"id": 29, "start": 385.0, "end": 395.0, "text": "360 Old Controller gibt es nicht mehr. Alles nur fake. Ich habe zum Glück noch einen."}, {"id": 30, "start": 395.0, "end": 404.0, "text": "Aber ist alles, alles fake."}, {"id": 31, "start": 404.0, "end": 409.0, "text": "Das ist glaube ich so, das dürfte ja so mit der billigste Schraubmaterialerzeiten sein hier."}, {"id": 32, "start": 409.0, "end": 416.0, "text": "Alles fake, das sieht man nachher, dass es halt kein Xbox Logo drauf hat. Das ist ein Yes Team und, und"}, {"id": 33, "start": 416.0, "end": 430.0, "text": "Yai Yei. Oder Diswo. Alles fake."}, {"id": 34, "start": 430.0, "end": 437.0, "text": "Und wenn schon, kommt mir nur der Original. Ich muss euch ja ehrlich sagen, ich finde der Xbox 360 Controller ist der beste Controller."}, {"id": 35, "start": 437.0, "end": 443.0, "text": "Der Xbox One Controller bzw. der Xbox Series S Controller. Ich weiß nicht, was da der Unterschied ist, ob ich mal was geändert habe."}, {"id": 36, "start": 443.0, "end": 450.0, "text": "Da sind mir die Analog-Sticks zu klein oben."}, {"id": 37, "start": 450.0, "end": 461.0, "text": "Also, weiß nicht, irgendwie war der Xbox 360 Controller so für mich peak, peak Controller."}, {"id": 38, "start": 461.0, "end": 469.0, "text": "PS5 Controller könnte tatsächlich noch nice sein. Die Sache ist die, warum ich den PlayStation Controller noch nie mochte ist,"}, {"id": 39, "start": 469.0, "end": 477.0, "text": "der hat auch kleinere Analog-Sticks und der ist so, vielleicht ist es jetzt besser geworden,"}, {"id": 40, "start": 477.0, "end": 484.0, "text": "aber der ist so klein im Vergleich zu dem Xbox 360 Controller."}, {"id": 41, "start": 484.0, "end": 491.0, "text": "Beim Xbox 360 Controller fand ich gut. Du hattest halt wirklich das Ding fest in der Hand und musstest nicht selbst so fest halten,"}, {"id": 42, "start": 491.0, "end": 513.0, "text": "weil das Ding so klein ist."}, {"id": 43, "start": 513.0, "end": 521.0, "text": "Der ist groß. Vielleicht sollte ich mal, ich bräuchte ja noch mal ein paar Controller für den PC. Ich habe ja nur mal einen Xbox 360 Controller noch."}, {"id": 44, "start": 521.0, "end": 527.0, "text": "Vielleicht sollte ich mal einen anderen ausprobieren. Ahja. Egal."}, {"id": 45, "start": 527.0, "end": 531.0, "text": "Aber was machen die Japaner? Gibt es dann in Japan einen kleineren?"}, {"id": 46, "start": 531.0, "end": 536.0, "text": "Weil ich habe früher immer als Argument gehört, ja ist doch ganz klar, die PlayStation kommt ja aus Japan,"}, {"id": 47, "start": 536.0, "end": 539.0, "text": "die Japaner haben kleinere Hände und deswegen kleine Controller."}, {"id": 48, "start": 539.0, "end": 543.0, "text": "Das war also das Standard-Argument, warum der PlayStation Controller so klein ist."}, {"id": 49, "start": 543.0, "end": 546.0, "text": "Und wie ist das jetzt bei der PS5? Ist der in Japan kleiner?"}, {"id": 50, "start": 546.0, "end": 550.0, "text": "Oder kommen jetzt auf magische Art und Weise die Leute da doch mit klar?"}, {"id": 51, "start": 550.0, "end": 557.0, "text": "Weil das war ja so das Argument schlechthin, was die Leute früher immer gebracht haben."}, {"id": 52, "start": 557.0, "end": 561.0, "text": "Adaptive Trigger ist wirklich eine nice Geschichte."}, {"id": 53, "start": 561.0, "end": 565.0, "text": "Es gibt ja sogar auch Tastaturen, die sowas haben."}, {"id": 54, "start": 565.0, "end": 570.0, "text": "Da kannst du dann theoretisch die Tasten unterschiedlich tief runterdrücken und anders drauf reagieren."}, {"id": 55, "start": 579.0, "end": 586.0, "text": "Excellent. So, was gucken wir uns denn jetzt an? 100% Allmann."}, {"id": 56, "start": 586.0, "end": 598.0, "text": "Der geilste Kleingärtner. Nee, das müssen wir uns jetzt nicht angucken."}, {"id": 57, "start": 598.0, "end": 606.0, "text": "Ich weiß nicht mal, was Autoklember sein soll. Was ist Autoklember?"}, {"id": 58, "start": 606.0, "end": 611.0, "text": "Meint der Kleimber? Nee, Klember. Was ist ein Autoklember?"}, {"id": 59, "start": 611.0, "end": 619.0, "text": "Kein Schimmer."}, {"id": 60, "start": 619.0, "end": 637.0, "text": "Das Super-Video ist jetzt in deiner Empfehlung, ja. Ich hab sogar noch eins aufgemacht von dem gucken."}, {"id": 61, "start": 637.0, "end": 641.0, "text": "Also das Gamestar-Video zur derzeit in der Spielbranche gesehen,"}, {"id": 62, "start": 641.0, "end": 645.0, "text": "also wenn du das von Maurice meinst, wo im Titel sowas steht wie"}, {"id": 63, "start": 645.0, "end": 651.0, "text": "ihr seid den Herstellern egal, dann haben wir uns das angeguckt, ja."}, {"id": 64, "start": 651.0, "end": 657.0, "text": "Oder wir haben besser gesagt darauf reacted, wie man das heute so schön nennt."}, {"id": 65, "start": 657.0, "end": 664.0, "text": "Aktuelle Corona-Zahlen. Mittlerweile muss ich sagen, interessiert mich das alles sowas von gar nicht mehr."}, {"id": 66, "start": 664.0, "end": 670.0, "text": "Ich glaub das ging jedem so, ne. Ich hab das ja am Anfang täglich verfolgt, wie sich das so entwickelt,"}, {"id": 67, "start": 670.0, "end": 677.0, "text": "aber seit über einem Jahr oder so geht das einfach so ins eine Ohr rein, ins andere Ohr raus."}, {"id": 68, "start": 677.0, "end": 683.0, "text": "Juckt mich so gar nicht mehr. Spätestens seit ich mich hab impfen lassen, gehts mir noch mehr am Arsch vorbei."}, {"id": 69, "start": 683.0, "end": 688.0, "text": "Was übrigens der hauptsächliche Grund ist, warum ich mich hab impfen lassen."}, {"id": 70, "start": 688.0, "end": 694.0, "text": "Ich hab mich nicht impfen lassen, also ich will jetzt da gar nicht irgendwie großartig Sachen sagen, die nicht stimmen, ne."}, {"id": 71, "start": 694.0, "end": 699.0, "text": "Weil ich hab mich nicht impfen lassen für Solidarität und Nächstenliebe."}, {"id": 72, "start": 699.0, "end": 703.0, "text": "Ich hab mich impfen lassen, dass ich selbst keine Probleme krieg, fertig."}, {"id": 73, "start": 703.0, "end": 709.0, "text": "Rest ist mir scheißegal. Was interessiert mich die Menschheit? Hauptsache ich kratz nicht ab."}, {"id": 74, "start": 709.0, "end": 717.0, "text": "Ich hab mich rein aus Eigennutzen impfen lassen."}, {"id": 75, "start": 717.0, "end": 726.0, "text": "So und seitdem verfolge ich das auch überhaupt nicht mehr."}, {"id": 76, "start": 726.0, "end": 731.0, "text": "Ich hab mir gedacht, warum auch, ne."}, {"id": 77, "start": 731.0, "end": 740.0, "text": "Mein gut, jetzt hast du die Geschichte mit, gibt jetzt neue Corona-Variante, aber das wird garantiert nicht die letzte Corona-Variante sein."}, {"id": 78, "start": 740.0, "end": 746.0, "text": "Also mich würd's nicht wundern, wenn wir dann, was ist eigentlich Omikron für nen Buchstabe im griechischen Alphabet?"}, {"id": 79, "start": 746.0, "end": 751.0, "text": "Was entspricht denn das? A, B, C, D, E, F, G oder sowas?"}, {"id": 80, "start": 751.0, "end": 759.0, "text": "Keine Ahnung. Griechisches Alphabet."}, {"id": 81, "start": 759.0, "end": 761.0, "text": "Okay, zeig mal her."}, {"id": 82, "start": 761.0, "end": 766.0, "text": "Alpha, Beta, Gamma, Delta, Epsilon, Zeta, Eta, Teta, Iota hab ich noch nie gehört."}, {"id": 83, "start": 766.0, "end": 769.0, "text": "Kappa, Kappa HD, Golden Kappa Check."}, {"id": 84, "start": 769.0, "end": 774.0, "text": "Lambda, Mi, Ni, Xi, Omega, ah okay."}, {"id": 85, "start": 774.0, "end": 785.0, "text": "Also quasi A, B, C, D, E, F, G, H, I, J, K, L, M, N, O."}, {"id": 86, "start": 785.0, "end": 789.0, "text": "O, O entspricht das, okay."}, {"id": 87, "start": 789.0, "end": 792.0, "text": "Aber der Rest stimmt, also es könnte auch so einfach sein."}, {"id": 88, "start": 792.0, "end": 795.0, "text": "Also es heißt, danach kommt die Pi-Variante."}, {"id": 89, "start": 795.0, "end": 799.0, "text": "Pi ist vielleicht schon ein bisschen doppeldeutig belegt im Vorfeld."}, {"id": 90, "start": 799.0, "end": 803.0, "text": "Oh, hier, Sigma-Variante ist am Start."}, {"id": 91, "start": 803.0, "end": 808.0, "text": "Das ist dann die Chat, die Corona-Chat-Variante."}, {"id": 92, "start": 808.0, "end": 823.0, "text": "Also quasi die, da ist dann vorbei."}, {"id": 93, "start": 823.0, "end": 826.0, "text": "Oh, das wird eh nicht das erste sein."}, {"id": 94, "start": 826.0, "end": 829.0, "text": "Was uns da halt, also ist ja nicht das erste."}, {"id": 95, "start": 829.0, "end": 830.0, "text": "Da kommen eh noch mehrere Varianten."}, {"id": 96, "start": 830.0, "end": 833.0, "text": "Also da muss man sich glaube ich die nächsten Jahre über darauf einstellen."}, {"id": 97, "start": 833.0, "end": 836.0, "text": "Was ich halt geil fand, was ich halt nur geil fand ist,"}, {"id": 98, "start": 836.0, "end": 839.0, "text": "so irgendwie im Sommer, oder warte, sagen wir mal so,"}, {"id": 99, "start": 839.0, "end": 845.0, "text": "letztes Jahr im TikTok-Cringe."}, {"id": 100, "start": 845.0, "end": 848.0, "text": "Ich watche ja auch kein TikTok-Cringe."}, {"id": 101, "start": 848.0, "end": 851.0, "text": "Letztes Jahr, so um diese Zeit herum,"}, {"id": 102, "start": 851.0, "end": 854.0, "text": "hat man erzählt so nach dem Motto, ja,"}, {"id": 103, "start": 854.0, "end": 857.0, "text": "obwohl man es eigentlich hätte besser wissen müssen,"}, {"id": 104, "start": 857.0, "end": 862.0, "text": "hat man so erzählt, ja, also wir machen jetzt nochmal ganz kurz Lockdown"}, {"id": 105, "start": 862.0, "end": 867.0, "text": "und dann sind wir ja kurz vorm Ziel und alles ist wieder gut."}, {"id": 106, "start": 867.0, "end": 870.0, "text": "Und dann hat sich das das letzte Jahr über so hingezogen"}, {"id": 107, "start": 870.0, "end": 874.0, "text": "und dieses Jahr pünktlich zum Winter haben alle gesagt,"}, {"id": 108, "start": 874.0, "end": 878.0, "text": "was, wo kommt denn jetzt Corona auf einmal wieder her?"}, {"id": 109, "start": 878.0, "end": 882.0, "text": "Da hätte ja absolut niemand mit rechnen können,"}, {"id": 110, "start": 882.0, "end": 885.0, "text": "dass das dieses Jahr im Winter wieder akut wird."}, {"id": 111, "start": 885.0, "end": 888.0, "text": "Wo kommt das auf einmal, ist es wieder da?"}, {"id": 112, "start": 888.0, "end": 893.0, "text": "Komplett, ohne dass man hätte das vermuten können im Vorfeld."}, {"id": 113, "start": 893.0, "end": 897.0, "text": "Da haben alle so super überrascht getan, so nach dem Motto,"}, {"id": 114, "start": 897.0, "end": 900.0, "text": "was, da ist es ja wieder."}, {"id": 115, "start": 900.0, "end": 903.0, "text": "Nein, im Leben nicht."}, {"id": 116, "start": 903.0, "end": 906.0, "text": "Das ist wie die vier Feinde der deutschen Bahn, genau."}, {"id": 117, "start": 906.0, "end": 908.0, "text": "Frühling, Sommer, Herbst und Winter."}, {"id": 118, "start": 908.0, "end": 910.0, "text": "Ist auch immer wieder, auf einmal konnte niemand mit rechnen,"}, {"id": 119, "start": 910.0, "end": 915.0, "text": "dass es direkt Winter ist."}, {"id": 120, "start": 915.0, "end": 920.0, "text": "Juli Genetics, Dankeschön für den normaler Sub."}, {"id": 121, "start": 920.0, "end": 925.0, "text": "Nee, also das fand ich auch lustig."}, {"id": 122, "start": 925.0, "end": 930.0, "text": "Auf einmal ist es wieder am Start."}, {"id": 123, "start": 930.0, "end": 933.0, "text": "Das ist auch so was, was ich nicht verstehe."}, {"id": 124, "start": 933.0, "end": 936.0, "text": "Man hätte sich ja im Vorfeld schon im Sommer,"}, {"id": 125, "start": 936.0, "end": 940.0, "text": "als es nicht so akut war, Pläne machen können,"}, {"id": 126, "start": 940.0, "end": 943.0, "text": "was man macht, wenn es im Winter wieder akut wird."}, {"id": 127, "start": 943.0, "end": 945.0, "text": "Aber hat man irgendwie ausgesessen und sich gedacht,"}, {"id": 128, "start": 945.0, "end": 947.0, "text": "nee, nee, wir stecken jetzt den Kopf in den Sand"}, {"id": 129, "start": 947.0, "end": 949.0, "text": "und machen mal lieber nichts."}, {"id": 130, "start": 949.0, "end": 953.0, "text": "Und dann müssen wir uns nämlich, wenn es dann im Winter"}, {"id": 131, "start": 953.0, "end": 957.0, "text": "wieder akut wird, wahnsinnig schnell wieder"}, {"id": 132, "start": 957.0, "end": 959.0, "text": "irgendwelche komischen Konferenzen einberufen,"}, {"id": 133, "start": 959.0, "end": 963.0, "text": "die dann nachts bis um 3.50 Uhr gehen."}, {"id": 134, "start": 963.0, "end": 966.0, "text": "Weil es ja bekannt ist, dass man nachts um 3.00 Uhr"}, {"id": 135, "start": 966.0, "end": 969.0, "text": "die besten Entscheidungen trifft."}, {"id": 136, "start": 969.0, "end": 973.0, "text": "Das gibt es auch nicht, die kann ich nicht so ganz nachvollziehen."}, {"id": 137, "start": 978.0, "end": 982.0, "text": "Also ich hab im Februar,"}, {"id": 138, "start": 982.0, "end": 985.0, "text": "hab ich Auffrischung, nee, wie nennt man?"}, {"id": 139, "start": 985.0, "end": 987.0, "text": "Boosterimpfung, nicht Auffrischung."}, {"id": 140, "start": 987.0, "end": 989.0, "text": "Auffrischung ist ja out."}, {"id": 141, "start": 989.0, "end": 992.0, "text": "Es ist ja Booster mittlerweile."}, {"id": 142, "start": 992.0, "end": 995.0, "text": "Wobei dann die Frage ist, ob das im Februar"}, {"id": 143, "start": 995.0, "end": 998.0, "text": "überhaupt noch sinnvoll ist, wenn 99% Omikron"}, {"id": 144, "start": 998.0, "end": 1001.0, "text": "ist und das dagegen gar nicht richtig hilft."}, {"id": 145, "start": 1001.0, "end": 1003.0, "text": "Mal gucken."}, {"id": 146, "start": 1003.0, "end": 1005.0, "text": "Wisst ihr, was das Beste ist?"}, {"id": 147, "start": 1005.0, "end": 1009.0, "text": "Versus Corona wenig Kontakt zu Menschen haben."}, {"id": 148, "start": 1009.0, "end": 1011.0, "text": "Easy."}, {"id": 149, "start": 1013.0, "end": 1015.0, "text": "Und da hab ich keine Probleme mit."}, {"id": 150, "start": 1015.0, "end": 1017.0, "text": "Nachdem mir andere Menschen eh auf den Sack gehen,"}, {"id": 151, "start": 1017.0, "end": 1020.0, "text": "ah ja, und Hände waschen, nachdem mir andere"}, {"id": 152, "start": 1020.0, "end": 1023.0, "text": "Menschen eh auf den Sack gehen, einfach nicht rausgehen."}, {"id": 153, "start": 1023.0, "end": 1026.0, "text": "Einfach nicht rausgehen und einfach sich,"}, {"id": 154, "start": 1026.0, "end": 1028.0, "text": "kein Kontakt mit anderen Menschen."}, {"id": 155, "start": 1028.0, "end": 1030.0, "text": "Easy, hab ich überhaupt kein Problem mit."}, {"id": 156, "start": 1030.0, "end": 1032.0, "text": "Andere Menschen nerven mich eh."}, {"id": 157, "start": 1034.0, "end": 1036.0, "text": "So wenig wie möglich."}, {"id": 158, "start": 1036.0, "end": 1038.0, "text": "Könnt ihr euch noch dran erinnern, wo am Anfang"}, {"id": 159, "start": 1038.0, "end": 1040.0, "text": "erzählt wurde, ich meine, da hat es ja laufen,"}, {"id": 160, "start": 1040.0, "end": 1042.0, "text": "das ist ja, du musst ja eigentlich nur mal so"}, {"id": 161, "start": 1042.0, "end": 1044.0, "text": "ein paar Monate warten, dann ist ja oftmals das,"}, {"id": 162, "start": 1044.0, "end": 1047.0, "text": "was heute quasi als, so muss es sein, dargestellt wird,"}, {"id": 163, "start": 1047.0, "end": 1049.0, "text": "nicht unbedingt, nicht mal aktuell."}, {"id": 164, "start": 1049.0, "end": 1051.0, "text": "Könnt ihr euch noch am Anfang dran erinnern,"}, {"id": 165, "start": 1051.0, "end": 1054.0, "text": "wo es hieß so nach dem Motto, also Masken bringen"}, {"id": 166, "start": 1054.0, "end": 1058.0, "text": "ja gar nichts, weil das geht da ja durch,"}, {"id": 167, "start": 1058.0, "end": 1060.0, "text": "das ist ja viel zu klein und Leute,"}, {"id": 168, "start": 1060.0, "end": 1063.0, "text": "kauft euch keine Masken, das bringt ja gar nichts."}, {"id": 169, "start": 1063.0, "end": 1065.0, "text": "Kauft, nein, nein, nein, nein."}, {"id": 170, "start": 1065.0, "end": 1067.0, "text": "Und irgendwie dann ein halbes Jahr später so nach dem"}, {"id": 171, "start": 1067.0, "end": 1070.0, "text": "Motto, ja jetzt müsst ihr aber alle eine Maske aufziehen."}, {"id": 172, "start": 1070.0, "end": 1072.0, "text": "Ich hab mich von Anfang an ehrlich gesagt,"}, {"id": 173, "start": 1072.0, "end": 1074.0, "text": "also gefragt, so nach dem Motto, warum soll das denn"}, {"id": 174, "start": 1074.0, "end": 1076.0, "text": "nichts bringen? Ich mein, okay,"}, {"id": 175, "start": 1076.0, "end": 1079.0, "text": "natürlich ist so ein Virus kleiner als vielleicht"}, {"id": 176, "start": 1079.0, "end": 1082.0, "text": "irgendwelche Maschen in der Maske."}, {"id": 177, "start": 1082.0, "end": 1085.0, "text": "Aber das ist ja in der Luft drin oder eventuell"}, {"id": 178, "start": 1085.0, "end": 1088.0, "text": "im, weiß ich so im, in der Luft Feuchtigkeit"}, {"id": 179, "start": 1088.0, "end": 1091.0, "text": "irgendwie drin und wenn die Hälfte davon an der Maske"}, {"id": 180, "start": 1091.0, "end": 1095.0, "text": "hängen bleibt, warum, natürlich bringt das was."}, {"id": 181, "start": 1095.0, "end": 1098.0, "text": "Also ich hab da keinen Plan von, aber es klang"}, {"id": 182, "start": 1098.0, "end": 1100.0, "text": "für mich von Anfang an irgendwie unlogisch,"}, {"id": 183, "start": 1100.0, "end": 1103.0, "text": "dass es nichts bringen soll. Egal, es hat sich ja"}, {"id": 184, "start": 1103.0, "end": 1105.0, "text": "im Nachhinein rausgestellt, man hat das nur behauptet,"}, {"id": 185, "start": 1105.0, "end": 1108.0, "text": "damit die Leute nicht wie für Rückwassen kaufen."}, {"id": 186, "start": 1108.0, "end": 1111.0, "text": "Ja, Osterruhe und dann gab's noch einmal den,"}, {"id": 187, "start": 1111.0, "end": 1114.0, "text": "jetzt ist wieder alles Erlaubtag und solche"}, {"id": 188, "start": 1114.0, "end": 1117.0, "text": "Dinger, meine Güte."}, {"id": 189, "start": 1117.0, "end": 1120.0, "text": "Das ganze Hickhack da drumherum."}, {"id": 190, "start": 1125.0, "end": 1128.0, "text": "Wer also das da dran geforscht wurde, ob Masken"}, {"id": 191, "start": 1128.0, "end": 1131.0, "text": "jetzt was bringen oder nicht, das halte ich jetzt"}, {"id": 192, "start": 1131.0, "end": 1134.0, "text": "ja mal für ein Gerücht, dass ich das irgendwie"}, {"id": 193, "start": 1134.0, "end": 1136.0, "text": "da drin habe."}, {"id": 194, "start": 1136.0, "end": 1139.0, "text": "An irgendwelchen Forschungsergebnissen."}, {"id": 195, "start": 1139.0, "end": 1142.0, "text": "Also ich mein, ob Masken ja was bringen oder nicht,"}, {"id": 196, "start": 1142.0, "end": 1145.0, "text": "das wusstest du von Anfang an und es ist ja auch"}, {"id": 197, "start": 1145.0, "end": 1148.0, "text": "mittlerweile rausgekommen, dass man das einfach nur"}, {"id": 198, "start": 1148.0, "end": 1151.0, "text": "gesagt hat, dass die Leute nicht wie für Rückwassen"}, {"id": 199, "start": 1151.0, "end": 1154.0, "text": "kaufen gehen, sodass man genug für medizinische"}, {"id": 200, "start": 1154.0, "end": 1157.0, "text": "Einrichtungen hat. Kann man sagen ehrenwertes Ziel,"}, {"id": 201, "start": 1157.0, "end": 1160.0, "text": "aber wahrscheinlich nicht unbedingt das, um Vertrauen"}, {"id": 202, "start": 1160.0, "end": 1163.0, "text": "da zu schaffen."}, {"id": 203, "start": 1163.0, "end": 1166.0, "text": "Ansonsten ja, gebe ich dir recht, aber trotzdem,"}, {"id": 204, "start": 1166.0, "end": 1174.0, "text": "auch wenn sich aktuelle Erkenntnisse oder Ansichten"}, {"id": 205, "start": 1174.0, "end": 1177.0, "text": "dazu ändern, man muss das halt ordentlich erklären."}, {"id": 206, "start": 1177.0, "end": 1182.0, "text": "Und gerade wenn man heute A sagt und morgen B und B"}, {"id": 207, "start": 1182.0, "end": 1188.0, "text": "steht im Kontrast zu A, muss man das sinnvoll"}, {"id": 208, "start": 1188.0, "end": 1191.0, "text": "begründen oder erklären, nachvollziehbar erklären,"}, {"id": 209, "start": 1191.0, "end": 1194.0, "text": "dass das so ist."}, {"id": 210, "start": 1194.0, "end": 1198.0, "text": "Und so Sachen wie ab, keine Ahnung, 190 Quadratmeter"}, {"id": 211, "start": 1198.0, "end": 1201.0, "text": "ist alles in Ordnung und ab 200 Quadratmeter"}, {"id": 212, "start": 1201.0, "end": 1205.0, "text": "ist böse, muss extra, ergibt es ja auch keinen Sinn."}, {"id": 213, "start": 1205.0, "end": 1208.0, "text": "Da hätte man ganz klar sagen müssen, ja wir haben"}, {"id": 214, "start": 1208.0, "end": 1211.0, "text": "das halt willkürlich irgendwo festgelegt."}, {"id": 215, "start": 1211.0, "end": 1219.0, "text": "Also, das ist echt nicht so glücklich gelaufen alles"}, {"id": 216, "start": 1219.0, "end": 1222.0, "text": "kommunikationstechnisch, das war schon ziemlich"}, {"id": 217, "start": 1222.0, "end": 1225.0, "text": "für'n Arsch an vielen Stellen. Genauso wie man"}, {"id": 218, "start": 1225.0, "end": 1232.0, "text": "gesagt hat, dass diese, wie erfassend bei Restaurants"}, {"id": 219, "start": 1232.0, "end": 1235.0, "text": "war da gewesen ist, dass es rein zur Nachverfolgung"}, {"id": 220, "start": 1235.0, "end": 1237.0, "text": "von Infektionsketten dient und jetzt kommt halt raus"}, {"id": 221, "start": 1237.0, "end": 1239.0, "text": "und nach dem auch, ne ne, wir doch für alles andere"}, {"id": 222, "start": 1239.0, "end": 1243.0, "text": "verwendet. Das mag alles okay sein, aber man kann"}, {"id": 223, "start": 1243.0, "end": 1245.0, "text": "es halt nicht am Anfang behaupten und es danach"}, {"id": 224, "start": 1245.0, "end": 1248.0, "text": "nicht machen und sich dann wundern, warum glaubt"}, {"id": 225, "start": 1248.0, "end": 1251.0, "text": "nicht keiner mehr was. Hä? Das ist ja logisch."}, {"id": 226, "start": 1251.0, "end": 1254.0, "text": "Ich mein, wenn du 500 mal Scheiße erzählst bekommst,"}, {"id": 227, "start": 1254.0, "end": 1257.0, "text": "501. Mal hat man es dann vielleicht irgendwann"}, {"id": 228, "start": 1257.0, "end": 1260.0, "text": "gecheckt, dass man es nicht mehr glaubt. Was halt"}, {"id": 229, "start": 1260.0, "end": 1262.0, "text": "gerade jetzt ein bisschen doof ist, weil das immer"}, {"id": 230, "start": 1262.0, "end": 1265.0, "text": "mehr Leute dazu bringt, dass sie vielleicht ins andere"}, {"id": 231, "start": 1265.0, "end": 1267.0, "text": "Lager wechseln und so sagen sie nach dem Wort,"}, {"id": 232, "start": 1267.0, "end": 1270.0, "text": "jetzt mach ich gar nichts mehr."}, {"id": 233, "start": 1272.0, "end": 1274.0, "text": "Ah ja, ich denke das wird uns auf jeden Fall noch"}, {"id": 234, "start": 1274.0, "end": 1277.0, "text": "eine Weile begleiten und ich denke auch nicht,"}, {"id": 235, "start": 1277.0, "end": 1280.0, "text": "dass Omikron das letzte sein wird, was wir kriegen"}, {"id": 236, "start": 1280.0, "end": 1282.0, "text": "in der Richtung."}, {"id": 237, "start": 1283.0, "end": 1285.0, "text": "Da kommt bestimmt noch mehr."}, {"id": 238, "start": 1286.0, "end": 1288.0, "text": "Wir haben ja gerade nachgeguckt, als nächstes kommt dann"}, {"id": 239, "start": 1288.0, "end": 1291.0, "text": "Pi und dann kommt Ro und spätestens bei Sigma geht"}, {"id": 240, "start": 1291.0, "end": 1293.0, "text": "die Welt unter, da ist vorbei."}, {"id": 241, "start": 1294.0, "end": 1296.0, "text": "Dann ist Schluss."}, {"id": 242, "start": 1297.0, "end": 1301.0, "text": "Wahrscheinlich, wahrscheinlich Winter 2023 oder so"}, {"id": 243, "start": 1301.0, "end": 1307.0, "text": "ist Sigma Corona am Start."}, {"id": 244, "start": 1310.0, "end": 1312.0, "text": "So."}, {"id": 245, "start": 1312.0, "end": 1315.0, "text": "Experiment V24."}, {"id": 246, "start": 1315.0, "end": 1319.0, "text": "Minecraft. Warum kriege ich Minecraft Sachen empfohlen?"}, {"id": 247, "start": 1322.0, "end": 1325.0, "text": "Okay, lass mich raten. Der sprengt jetzt alles in die"}, {"id": 248, "start": 1325.0, "end": 1331.0, "text": "Luft und dann macht sie Bum."}, {"id": 249, "start": 1333.0, "end": 1335.0, "text": "Ja."}, {"id": 250, "start": 1335.0, "end": 1337.0, "text": "Okay."}, {"id": 251, "start": 1337.0, "end": 1340.0, "text": "Ah, das ist ein Amboss oder was?"}, {"id": 252, "start": 1344.0, "end": 1346.0, "text": "Das könntest du auf normalem Java Edition Server"}, {"id": 253, "start": 1346.0, "end": 1348.0, "text": "wahrscheinlich gar nicht machen, weil der komplette"}, {"id": 254, "start": 1348.0, "end": 1356.0, "text": "Server zusammenbrechen würde vor Lag."}, {"id": 255, "start": 1360.0, "end": 1362.0, "text": "Okay, die Grube explodiert."}, {"id": 256, "start": 1362.0, "end": 1364.0, "text": "Alles klar, da hätte ich jetzt auch mit gerechnet,"}, {"id": 257, "start": 1364.0, "end": 1370.0, "text": "ehrlich gesagt, bei so viel TNT."}, {"id": 258, "start": 1370.0, "end": 1376.0, "text": "Okay, was auch immer."}, {"id": 259, "start": 1393.0, "end": 1395.0, "text": "Man sollte vielleicht nicht Scheiße erzählen, obwohl"}, {"id": 260, "start": 1395.0, "end": 1397.0, "text": "man weiß, dass es nicht so ist."}, {"id": 261, "start": 1397.0, "end": 1403.0, "text": "Ich erwarte ja gar nicht, dass das alles 100% stimmt,"}, {"id": 262, "start": 1403.0, "end": 1405.0, "text": "immer, was man sagt."}, {"id": 263, "start": 1405.0, "end": 1408.0, "text": "Aber wenn sich halt rausstellt, es war totaler Bullshit,"}, {"id": 264, "start": 1408.0, "end": 1410.0, "text": "dann sollte man das wenigstens auch mal erwähnen."}, {"id": 265, "start": 1410.0, "end": 1413.0, "text": "Und nicht so tun, so nach dem Motto, ich habe gestern"}, {"id": 266, "start": 1413.0, "end": 1416.0, "text": "Scheiße erzählt und es alles richtig verkauft und heute"}, {"id": 267, "start": 1416.0, "end": 1418.0, "text": "verkaufe ich wieder was als richtig und das wird"}, {"id": 268, "start": 1418.0, "end": 1420.0, "text": "wahrscheinlich auch wieder richtig sein."}, {"id": 269, "start": 1420.0, "end": 1424.0, "text": "Da muss man halt auch mal sagen können, okay, Datenlage"}, {"id": 270, "start": 1424.0, "end": 1426.0, "text": "hat sich geändert, was auch immer."}, {"id": 271, "start": 1426.0, "end": 1429.0, "text": "Und aus diesen und diesen Gründen machen wir das jetzt"}, {"id": 272, "start": 1429.0, "end": 1430.0, "text": "anders."}, {"id": 273, "start": 1430.0, "end": 1432.0, "text": "Aber man kann nicht immer so tun, als liegt man"}, {"id": 274, "start": 1432.0, "end": 1434.0, "text": "ultimativ richtig."}, {"id": 275, "start": 1434.0, "end": 1437.0, "text": "Ach ja, und dass das verfolgt, musst du gucken."}, {"id": 276, "start": 1437.0, "end": 1439.0, "text": "Such nach Corona."}, {"id": 277, "start": 1439.0, "end": 1442.0, "text": "Wie heißt der Kram?"}, {"id": 278, "start": 1442.0, "end": 1445.0, "text": "Wie heißt diese Anwesenheitslisten?"}, {"id": 279, "start": 1445.0, "end": 1448.0, "text": "Die bayerische Polizei macht da überhaupt keinen"}, {"id": 280, "start": 1448.0, "end": 1455.0, "text": "Held, um dass sie das verwenden."}, {"id": 281, "start": 1455.0, "end": 1458.0, "text": "Ich finde es nur ein bisschen bedenklich, dass du"}, {"id": 282, "start": 1458.0, "end": 1462.0, "text": "dadurch im Endeffekt auch Leute vielleicht ins falsche"}, {"id": 283, "start": 1462.0, "end": 1465.0, "text": "Lager treibst."}, {"id": 284, "start": 1465.0, "end": 1468.0, "text": "Ich finde es nur ein bisschen bedenklich, dass du"}, {"id": 285, "start": 1468.0, "end": 1473.0, "text": "dadurch im Endeffekt auch Leute vielleicht ins falsche"}, {"id": 286, "start": 1473.0, "end": 1475.0, "text": "Lager treibst."}, {"id": 287, "start": 1475.0, "end": 1477.0, "text": "Das ist ein bisschen komplex."}, {"id": 288, "start": 1477.0, "end": 1480.0, "text": "Das ist ein bisschen komplex, dass man mal etwas"}, {"id": 289, "start": 1480.0, "end": 1486.5, "text": "auch Leute vielleicht ins falsche Lager treibst, weil die sagen, hey ich glaub eh nix mehr"}, {"id": 290, "start": 1486.5, "end": 1491.68, "text": "und dann glaub ich lieber irgendwie dem Kerl in der Telegram Gruppe, was jetzt nur für"}, {"id": 291, "start": 1491.68, "end": 1493.72, "text": "alle nicht das ist, was man sich wünschen kann."}, {"id": 292, "start": 1493.72, "end": 1505.28, "text": "So, jetzt, guck mal, das ist Taktik von YouTube, wenn du ein Video angeklickt hast in einer"}, {"id": 293, "start": 1505.28, "end": 1510.76, "text": "Position und hast es geguckt, kriegst du ein ähnliches Video an der gleichen Position"}, {"id": 294, "start": 1510.76, "end": 1511.76, "text": "wieder."}, {"id": 295, "start": 1511.76, "end": 1519.92, "text": "Bayern gehört nicht zu Deutschland, ja wenn du manche Bayern fragst, ist das wirklich"}, {"id": 296, "start": 1519.92, "end": 1530.44, "text": "so und auch wenn du manche anderen fragst, ja, die kriegen nur Mist empfohlen."}, {"id": 297, "start": 1530.44, "end": 1537.24, "text": "Mario Kart DS Tracks, ach ne, ich dachte das ist Mario Kart Speed Trans, da gibt es auch"}, {"id": 298, "start": 1537.24, "end": 1538.24, "text": "richtig krasse Dinger."}, {"id": 299, "start": 1538.24, "end": 1556.16, "text": "Ich hab jetzt zwei Minecraft Videos angeklickt, ne und jetzt ist YouTube der Meinung, gib mir"}, {"id": 300, "start": 1556.16, "end": 1562.12, "text": "meine Minecraft Videos, auf gehts."}, {"id": 301, "start": 1562.12, "end": 1565.16, "text": "Haartrockner in der Badewanne, was passiert?"}, {"id": 302, "start": 1565.16, "end": 1574.92, "text": "Wahrscheinlich gar nix, also ich hab mir da noch nie großartig, Freunde des Stroms, das"}, {"id": 303, "start": 1574.92, "end": 1581.4, "text": "ist ja auch mal ein geiler Channelname, man kennt das ja nur aus Filmen, so nach dem Motto,"}, {"id": 304, "start": 1581.4, "end": 1588.6, "text": "mit einem Bein in der Badewanne, man wirft den Föhn rein und instantly komplett geschockt"}, {"id": 305, "start": 1588.6, "end": 1601.72, "text": "und alles hinüber, wahrscheinlich passiert gar nix, vielleicht geht, vielleicht geht"}, {"id": 306, "start": 1601.72, "end": 1608.36, "text": "auf jeden Fall der Föhn kaputt, aber das will ich mir jetzt nicht angucken, das ist"}, {"id": 307, "start": 1608.36, "end": 1614.6, "text": "so lang, komm ich guck mal kurz rein, was passiert damit, liebe Freunde des Stroms,"}, {"id": 308, "start": 1614.6, "end": 1620.6, "text": "ich find das schon mal ein geiler Channelname, seid ihr auch Freunde des Stroms, wie sieht"}, {"id": 309, "start": 1620.6, "end": 1637.32, "text": "es bei euch aus, Freunde des Stroms, ja, ich spule jetzt mal ein bisschen vor, man sieht"}, {"id": 310, "start": 1637.32, "end": 1653.24, "text": "schon Orgas Dialect, ach das ist der Föhn, aber er hat seine coole Quickscope Brille"}, {"id": 311, "start": 1653.24, "end": 1670.2, "text": "an, die ist wichtig, also ohne die Gunner Optics Quickscope Brille geht gar nix, ok"}, {"id": 312, "start": 1670.2, "end": 1689.8, "text": "was passiert, guck mal der Föhn, der Föhn läuft sogar noch unter Wasser weiter, ok"}, {"id": 313, "start": 1689.8, "end": 1693.44, "text": "es passiert einfach mal gar nix, ich hätte gedacht der Föhn geht wenigstens kaputt,"}, {"id": 314, "start": 1693.44, "end": 1702.64, "text": "jetzt mit dem gerechnet, also wir haben uns jetzt einen wunderschönen Außenbordmotor"}, {"id": 315, "start": 1702.64, "end": 1708.28, "text": "gebaut oder, schaut euch das an, der pumpt jetzt das Wasser dadurch, natürlich der Lüfter"}, {"id": 316, "start": 1708.28, "end": 1718.16, "text": "muss jetzt schinden, aber es passiert gar nix, im ersten Moment und jetzt werden wir"}, {"id": 317, "start": 1718.16, "end": 1725.08, "text": "das Ganze natürlich auf elektrischer Manier einmal analysieren, aber so wie in die Krimis"}, {"id": 318, "start": 1725.08, "end": 1733.52, "text": "ist es nicht, ich zeige es euch natürlich noch, wenn es euch interessiert, schaut euch"}, {"id": 319, "start": 1733.52, "end": 1740.4, "text": "das an, was ist das jetzt, der Widerstand von, nee keine Ahnung, da hätte ich jetzt"}, {"id": 320, "start": 1740.4, "end": 1746.16, "text": "vielleicht noch komplett gucken müssen, wo hält das denn dran, an die Wand, an die Wand"}, {"id": 321, "start": 1746.16, "end": 1748.16, "text": "und?"}, {"id": 322, "start": 1748.16, "end": 1755.68, "text": "Also das Wasser ist jetzt auch nicht isoliert, gar nix, es ist ganz normales Wasser mit Badezusatz"}, {"id": 323, "start": 1755.68, "end": 1762.88, "text": "und bis jetzt hat noch nix ausgelöst, das ist hier, ich mache jetzt keine Werbung, aber"}, {"id": 324, "start": 1762.88, "end": 1769.8, "text": "da ist keine Tonibox im Bad auf der Bade, Widerstand wahrscheinlich von, definitiv wieder"}, {"id": 325, "start": 1769.8, "end": 1774.4, "text": "kracht und schäbert und dann schauen wir mal, ob man die Selektivität herhält oder"}, {"id": 326, "start": 1774.4, "end": 1779.64, "text": "ob es wieder kommt, schauen wir mal, lassen wir uns überraschen, ich möchte jetzt noch"}, {"id": 327, "start": 1779.64, "end": 1780.64, "text": "nix verraten."}, {"id": 328, "start": 1780.64, "end": 1791.16, "text": "Aha, ok, das müssen wir uns glaube ich echt ganz angucken, damit man das checkt, aber"}, {"id": 329, "start": 1791.16, "end": 1794.08, "text": "ich will mir keine 30 Minuten Föhn in der Badewanne angucken jetzt."}, {"id": 330, "start": 1794.08, "end": 1810.84, "text": "Ich freu mir nicht, Stroms, how to crash Minecraft ist ganz einfach, soll ich euch zeigen, wie"}, {"id": 331, "start": 1810.84, "end": 1811.84, "text": "man Minecraft crash?"}, {"id": 332, "start": 1811.84, "end": 1823.88, "text": "Ich hab da gehört, es gibt da so gewisse Sachen, die man ins Chatlog schreiben kann"}, {"id": 333, "start": 1823.88, "end": 1839.0, "text": "und dann ist vorbei, 2022 wird das Jahr für Open World Spiele, das Problem ist nur, dass"}, {"id": 334, "start": 1839.0, "end": 1846.56, "text": "mich Open World Spiele überhaupt nicht jucken, Dying Light 2, Horizon, Elden Ring, LX2, GTA"}, {"id": 335, "start": 1846.56, "end": 1856.4, "text": "2, Stalker, Saint Rose, Test Drive Unlimited, Solar Crown, Starfield Ark 2, Avatar, braucht"}, {"id": 336, "start": 1856.4, "end": 1857.4, "text": "man das wirklich jetzt noch?"}, {"id": 337, "start": 1857.4, "end": 1861.24, "text": "Irgendwie gefühlt 20 Jahre nachdem der erste Kinofilm rausgekommen ist?"}, {"id": 338, "start": 1861.24, "end": 1872.04, "text": "Sollte es da nicht sogar einen zweiten Film geben, nicht als hätte das eine Fortsetzung"}, {"id": 339, "start": 1872.04, "end": 1884.72, "text": "gebraucht oder so, Cyberpunk, ach schon wieder, ja gut, ja gut, bisschen Harry Potter verwursten"}, {"id": 340, "start": 1884.72, "end": 1888.76, "text": "muss man natürlich auch noch, ja ok, das Sequel zu Breath of the Wild, das sehen wir"}, {"id": 341, "start": 1888.76, "end": 1900.32, "text": "wahrscheinlich wenn Nintendo so weitermacht, 2030 oder so, was will denn der Switcher nochmal"}, {"id": 342, "start": 1900.32, "end": 1907.08, "text": "hier am Start, ja gut, das kommt noch für Next Gen raus, das ist ja fast schon wie Skyrim"}, {"id": 343, "start": 1907.08, "end": 1917.48, "text": "Alter, wie mich New World Spiele nicht interessieren, das ist der Wahnsinn, die ganze Welt geht"}, {"id": 344, "start": 1917.48, "end": 1925.8, "text": "voll ab auf Open World, also nicht New World, sondern Open World und ich muss sagen, bis"}, {"id": 345, "start": 1925.8, "end": 1932.04, "text": "auf ein paar Ausnahmen gehen mir Open World Spiele komplett am Arsch vorbei, also Witcher"}, {"id": 346, "start": 1932.04, "end": 1940.84, "text": "3 war eine gute Ausnahme aber auch nur, weil es eine schlüssige Main Quest als roten Faden"}, {"id": 347, "start": 1940.84, "end": 1946.32, "text": "gab und man quasi drum herum noch so ein bisschen spielen konnte und nicht die Open"}, {"id": 348, "start": 1946.32, "end": 1971.88, "text": "World so als einziges da war, mit der man sich beschäftigen kann, spielt das doch einer"}, {"id": 349, "start": 1971.88, "end": 1984.24, "text": "New World, lass doch mal gucken, naja, also ich glaube man könnte sagen, in absoluten"}, {"id": 350, "start": 1984.24, "end": 1989.56, "text": "Zahlen gesehen, ja da spielt noch jemand, anteilmäßig könnte man sagen, es ist eigentlich"}, {"id": 351, "start": 1989.56, "end": 2002.88, "text": "fast dead, guck mal, tolle Entwicklung, erster Monat minus 62%, nächster Monat minus 43%,"}, {"id": 352, "start": 2002.88, "end": 2004.28, "text": "doch ich wollte am 24."}, {"id": 353, "start": 2004.28, "end": 2009.36, "text": "Video bringen, ich wollte mit dem Friseur ein Video aufnehmen, aber das Internet, also"}, {"id": 354, "start": 2009.36, "end": 2018.12, "text": "Vodafone hat komplett das Internet beim Frasier abgeschaltet am 23., beste, bestes Timing,"}, {"id": 355, "start": 2018.12, "end": 2025.64, "text": "und ab 27."}, {"id": 356, "start": 2025.64, "end": 2030.4, "text": "gehts angeblich wieder, was ja auch nice ist, die Leute über Weihnachten einfach mal so"}, {"id": 357, "start": 2030.4, "end": 2048.88, "text": "hocken zu lassen, naja, mal gespannt, ob das noch klappt, ne, aber das ist Deadge und das"}, {"id": 358, "start": 2048.88, "end": 2056.8, "text": "hier ist auch Deadge, das sind die hängengebliebenen, die sie jetzt an Weihnachten bekommen haben"}, {"id": 359, "start": 2056.8, "end": 2060.72, "text": "und ein paar aus dem Free Weekend, guck mal, ich mein wir waren schon runter, wir waren"}, {"id": 360, "start": 2060.72, "end": 2067.04, "text": "schon runter auf 18., guck mal, es war jetzt heilig Abend, ne, Leute, es hat sich einfach"}, {"id": 361, "start": 2067.04, "end": 2074.8, "text": "nichts getan, niemand hat dieses Spiel zu heiliger Abend bekommen und gespielt, niemand,"}, {"id": 362, "start": 2074.8, "end": 2087.08, "text": "jedes Sau interessiert sich dafür, so muss es auch sein, ne, hab ich noch nie, ich hab"}, {"id": 363, "start": 2087.08, "end": 2092.36, "text": "nur bei Shroud ab und zu mal ein bisschen auf Twitch geguckt und was mich abschreckt"}, {"id": 364, "start": 2092.36, "end": 2103.88, "text": "ist, dass das wieder so ein Game ist mit kleinteiligem Inventorymanagement, ja, ich weiß, ich weiß,"}, {"id": 365, "start": 2103.88, "end": 2119.44, "text": "ich kenn die Videos, Belfin5 hatte gestern mehr Streamer, aber mal Steam, ah nein, ich"}, {"id": 366, "start": 2119.44, "end": 2133.24, "text": "hab's noch nicht auf Shithub gepusht, Moment, schreib ich mir auf, GitHub, App, guck mal,"}, {"id": 367, "start": 2133.24, "end": 2144.16, "text": "die hatten 10.000 Spieler mehr, Alter, guck mal, die hatten fast 10.000 Spieler mehr als"}, {"id": 368, "start": 2144.16, "end": 2161.6, "text": "Battlefield 2042, das ist so schlecht und wohlgemerkt, Battlefield 5 kam auch schon nicht gut an,"}, {"id": 369, "start": 2161.6, "end": 2167.08, "text": "wie sieht denn Battlefield, ok, das kann man jetzt schlecht vergleichen, das ist schon"}, {"id": 370, "start": 2167.08, "end": 2171.76, "text": "so alt, es hat wahrscheinlich kaum noch einer auf Steam gekauft, ne, ok, das kannst du nicht,"}, {"id": 371, "start": 2171.76, "end": 2189.04, "text": "das spielt auch kaum einer über Steam, mal auf Steam gucken, äh, nicht Steam, Steam Charts,"}, {"id": 372, "start": 2189.04, "end": 2192.68, "text": "es hat fast genauso viel, ok, die Hälfte von 2042, das Problem ist, dass man das nicht"}, {"id": 373, "start": 2192.68, "end": 2198.4, "text": "so gut vergleichen kann, weil Battlefield 20, also es ist eigentlich, es ist noch schlechter,"}, {"id": 374, "start": 2198.4, "end": 2203.68, "text": "weil das kam von Anfang an auf Steam raus und die Games, die kamen erst mal nur auf,"}, {"id": 375, "start": 2203.68, "end": 2208.56, "text": "also bei dem weiß ich nicht, aber die anderen kamen nur auf Origin raus und kamen jetzt"}, {"id": 376, "start": 2208.56, "end": 2213.8, "text": "erst vor einem Jahr oder so auf Steam, also das ist, eigentlich ist es noch schlechter"}, {"id": 377, "start": 2213.8, "end": 2229.16, "text": "vom Verhältnis, als es hier aussieht, so mies, alter, so schlecht, Wahnsinn, absolut Wahnsinn,"}, {"id": 378, "start": 2229.16, "end": 2234.92, "text": "was die da wieder für einen Scheiß getrieben haben, naja gut, was willst du machen, die"}, {"id": 379, "start": 2234.92, "end": 2239.56, "text": "Sache ist eh in Brunnen gefallen, da wird sich nichts mehr tun, also die werden das Spiel"}, {"id": 380, "start": 2239.56, "end": 2247.8, "text": "nie aus dem Dreck ziehen können, neue Grafik für AMA 4, wirst du gar nicht, dass AMA 4"}, {"id": 381, "start": 2247.8, "end": 2259.52, "text": "war, AJAJA, das fühlt sich an wie Anime Fans am Start, ok, was können wir uns jetzt angucken,"}, {"id": 382, "start": 2259.52, "end": 2272.48, "text": "Dropping an iPhone 13, 13, 13, ja 13, Pro down, Feet, alter, ok, Feet 2 Meter, gibt's"}, {"id": 383, "start": 2272.48, "end": 2282.88, "text": "das, ok, 487 Meter tiefer See, Kekona Freedom Units, hell yeah, Feet, wie gesagt, man könnte"}, {"id": 384, "start": 2282.88, "end": 2289.64, "text": "es auch noch in Galonen oder in Ounces oder in Miles oder so, dann gucken wir uns das"}, {"id": 385, "start": 2289.64, "end": 2294.0, "text": "doch jetzt mal an, also es könnte natürlich auch sein, dass es sehr langweilig ist, wenn"}, {"id": 386, "start": 2294.0, "end": 2301.52, "text": "das permanent einfach nur runterfällt, aber so lang fällt das 480 Meter auch nicht, Will"}, {"id": 387, "start": 2301.52, "end": 2309.64, "text": "it blend, don't try this, nee wie geht das, don't breeze this, gibt's die überhaupt"}, {"id": 388, "start": 2309.64, "end": 2335.44, "text": "noch, Planttec YouTube, nee so wirklich machen die nichts mehr, so wirklich aktiv machen"}, {"id": 389, "start": 2335.44, "end": 2353.6, "text": "die nicht mehr, ok gucken wir uns mal an, also lass mal überlegen, will das, überlebt"}, {"id": 390, "start": 2353.6, "end": 2359.52, "text": "es das iPhone, ja ich denke schon, ob es noch läuft weiß ich nicht, kann man schwer sagen,"}, {"id": 391, "start": 2359.52, "end": 2366.84, "text": "ich weiß nicht, wie wasserdicht die Dinger sind, aber ich denke mal spätestens, wenn"}, {"id": 392, "start": 2366.84, "end": 2377.6, "text": "man das dann trocknet, geht es wieder, ich habe das Gefühl, Chat sagt, ich habe das Gefühl,"}, {"id": 393, "start": 2377.6, "end": 2383.32, "text": "dass die Spiele sich immer weiter von den Gamern entfernt, also du meinst jetzt von dem,"}, {"id": 394, "start": 2383.32, "end": 2388.28, "text": "was die Spieler eigentlich sich wünschen an Spielen, ja, es geht halt um Monetarisierung"}, {"id": 395, "start": 2388.28, "end": 2392.28, "text": "und Big Stonks, nicht darum jetzt irgendwie, wo kämen wir denn dahin, wenn man die Spieler"}, {"id": 396, "start": 2392.28, "end": 2397.08, "text": "irgendwie glücklich machen will, das will man, nein, nein, nein, nein, man möchte die"}, {"id": 397, "start": 2397.08, "end": 2402.88, "text": "Spieler insofern glücklich genug machen, dass sie viel Geld ausgeben, aber zu happy sollen"}, {"id": 398, "start": 2402.88, "end": 2407.28, "text": "die auch nicht sein, die sollen ja völlig den anderen Kram kaufen, so, what is up guys,"}, {"id": 399, "start": 2407.28, "end": 2413.36, "text": "what is up, in this video we got the brand new iPhone 13 Pro, this is in pristine condition,"}, {"id": 400, "start": 2413.36, "end": 2421.12, "text": "brand new device, guys, everything works perfectly fine, na gut, der kann sich das leisten, we"}, {"id": 401, "start": 2421.12, "end": 2426.56, "text": "got the GoPro Hero 9 here, okay, wir gucken, ich kroll mal ein bisschen vor, wo es jetzt"}, {"id": 402, "start": 2426.56, "end": 2430.88, "text": "eigentlich anfängt, deepest point of this lake, we're actually at Lake Tahoe, it's"}, {"id": 403, "start": 2430.88, "end": 2435.52, "text": "one of the deepest lakes in the world and we're gonna see what happens when we send both the"}, {"id": 404, "start": 2435.52, "end": 2441.96, "text": "GoPro in the waterproof housing in the water, okay guys, we're ready to go, ja, was ist"}, {"id": 405, "start": 2441.96, "end": 2461.96, "text": "denn das, das ist hier die Profi-Angel, ah, wie tief das ganze ist, okay, auf gehts, auf"}, {"id": 406, "start": 2461.96, "end": 2474.48, "text": "gehts, gib ihm, ah, by the way, dass das nur auf einer Seite ist, der Sound, das ist normal,"}, {"id": 407, "start": 2474.48, "end": 2479.84, "text": "also mein Sound ist vollkommen okay, hör dir, auf beiden Seiten, aber das Video ist nur"}, {"id": 408, "start": 2479.84, "end": 2489.12, "text": "left side irgendwie, das hätte er aber schöner nachbearbeiten können, ne, das hätte er"}, {"id": 409, "start": 2489.12, "end": 2495.88, "text": "aber schöner nachbearbeiten können, ne, kann man hier vielleicht Pen oder so, Penning einstellen,"}, {"id": 410, "start": 2495.88, "end": 2514.96, "text": "ne, kann man nicht, naja, wir brauchen ja schon einen Livestream von der GoPro, ich mein,"}, {"id": 411, "start": 2514.96, "end": 2526.68, "text": "so ist das vielleicht ein bisschen unspektakulär, ich dachte, wir sehen jetzt, wie das da rein"}, {"id": 412, "start": 2526.68, "end": 2531.12, "text": "fällt, also eben bei der Angel zuzugucken ist jetzt ja nur wirklich nicht sonderlich"}, {"id": 413, "start": 2531.12, "end": 2543.12, "text": "spannend, das ist eine Angel mit Motor, das ist für Leute wie mich, die keinen Bock haben"}, {"id": 414, "start": 2543.12, "end": 2560.76, "text": "selbst zu kurbeln, ne, dem iPhone wirst du das sicherlich nicht ansehen, ja, das habe"}, {"id": 415, "start": 2560.76, "end": 2564.88, "text": "ich mir schon fast gedacht, also ich, ne, ne, hab ich mir nicht gedacht, ich hab mir gedacht,"}, {"id": 416, "start": 2564.88, "end": 2568.6, "text": "das geht wahrscheinlich aus und wenn man das trocknet gehts wieder, ja ne, aber wundert"}, {"id": 417, "start": 2568.6, "end": 2579.4, "text": "mich, wundert mich jetzt auch nicht wirklich, ach jetzt, jetzt kann man zugucken, ok, jo,"}, {"id": 418, "start": 2579.4, "end": 2588.04, "text": "mach dir mal überhaupt gar nichts, juckt es, juckt es nicht wirklich, wobei ich sagen muss,"}, {"id": 419, "start": 2588.04, "end": 2597.36, "text": "je nachdem wie tief die sind, ganz schön hell, oder, ganz schön hell für die, na gut, 200"}, {"id": 420, "start": 2597.36, "end": 2618.32, "text": "Meter oder so, ich weiß nicht ab wanns richtig dunkel wird, ah jetzt wirds dunkel, ja, Leute,"}, {"id": 421, "start": 2618.32, "end": 2622.8, "text": "das könnte natürlich jetzt so, das könnte auch aus irgendeinem Horrorfilm sein, oder,"}, {"id": 422, "start": 2622.8, "end": 2628.0, "text": "du siehst ja nix und jetzt kommt von hinten auf einmal irgendwas großes, großes angeschwommen"}, {"id": 423, "start": 2628.0, "end": 2639.28, "text": "so, wuhu, ich habs ja eh nicht, ich habs ja eh nicht so mit tiefem Wasser, das wisst"}, {"id": 424, "start": 2639.28, "end": 2663.6, "text": "der, ja, guck mal jetzt ist richtig, jetzt ist richtig"}, {"id": 425, "start": 2663.6, "end": 2672.88, "text": "ein Toaster, also zumindest wenns auf den Boden ankommt, müsste man eigentlich sehen,"}, {"id": 426, "start": 2672.88, "end": 2702.64, "text": "sollst du dann machen blonk und auf den Boden ankomm, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 427, "start": 2702.64, "end": 2723.64, "text": "ok, ok, ok, ok, ja, ok, ok, ok, ok, ok, ok, ok, ja, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 428, "start": 2723.64, "end": 2746.0, "text": "Oder ist das der Screenlock?"}, {"id": 429, "start": 2746.0, "end": 2757.28, "text": "Ist das Handy noch am Netz?"}, {"id": 430, "start": 2757.28, "end": 2758.28, "text": "Und kommt es jetzt unten an?"}, {"id": 431, "start": 2758.28, "end": 2774.96, "text": "Ah, die GoPro ist kaputt?"}, {"id": 432, "start": 2774.96, "end": 2797.6, "text": "Deswegen ging das jetzt aus."}, {"id": 433, "start": 2797.6, "end": 2805.0, "text": "Scheint doch nicht mehr so richtig zu funktionieren."}, {"id": 434, "start": 2805.0, "end": 2806.96, "text": "Siehste, das ist doch nicht angeblieben."}, {"id": 435, "start": 2806.96, "end": 2811.8, "text": "Das einzige was noch an ist, ist die Lampe, okay."}, {"id": 436, "start": 2811.8, "end": 2816.48, "text": "Aber wie gesagt, ich hätte auch vermutet das Display geht aus, aber wenn man es komplett"}, {"id": 437, "start": 2816.48, "end": 2818.44, "text": "trocknen lässt, dann geht's wieder."}, {"id": 438, "start": 2818.44, "end": 2822.96, "text": "Oder der Drucker hat das Display kaputt gemacht, ja das kann natürlich auch sein."}, {"id": 439, "start": 2822.96, "end": 2834.84, "text": "Du musst das trocknen lassen und dann..."}, {"id": 440, "start": 2834.84, "end": 2842.44, "text": "Okay, anscheinend geht es doch nicht mehr richtig."}, {"id": 441, "start": 2842.44, "end": 2848.92, "text": "Na gut, okay es geht doch nicht mehr."}, {"id": 442, "start": 2848.92, "end": 2853.28, "text": "Ich hätte fast vermutet, das iPhone geht noch, weil man es wieder komplett trocknen lässt"}, {"id": 443, "start": 2853.28, "end": 2858.92, "text": "und nach Möglichkeit dann mal eine Woche liegen lässt, bis wirklich der letzte Vizel hier"}, {"id": 444, "start": 2858.92, "end": 2863.92, "text": "an Wasser getrocknet ist und dann noch mal neu ein- und ausschaltet, äh, aus- und einschalten,"}, {"id": 445, "start": 2863.92, "end": 2864.92, "text": "bzw."}, {"id": 446, "start": 2864.92, "end": 2865.92, "text": "halt mal irgendwie ein Akku abmacht oder irgendwas."}, {"id": 447, "start": 2865.92, "end": 2867.48, "text": "Das geht ja, wobei das geht ja nicht, muss man ja aufschreiben."}, {"id": 448, "start": 2867.48, "end": 2873.44, "text": "Der Drucker hat den Bildschirm kaputt gemacht, ja kann durchaus sein, Chat."}, {"id": 449, "start": 2873.44, "end": 2875.72, "text": "Eigentlich komplett sinnloses Video, wenn man sich mal so überlegt."}, {"id": 450, "start": 2875.72, "end": 2879.16, "text": "Ich mein, wozu?"}, {"id": 451, "start": 2879.16, "end": 2885.68, "text": "Steht auf der Herstellerseite nicht ein Meter Tiefe."}, {"id": 452, "start": 2885.68, "end": 2889.8, "text": "Ja gut, was Hersteller so schreiben und was dann in der Realität ist, kann entweder viel"}, {"id": 453, "start": 2889.8, "end": 2891.36, "text": "viel mehr sein oder viel viel weniger."}, {"id": 454, "start": 2891.36, "end": 2894.56, "text": "Bei manchen kommt es auch ungefähr hin."}, {"id": 455, "start": 2894.56, "end": 2898.16, "text": "Also, making was?"}, {"id": 456, "start": 2898.16, "end": 2901.2, "text": "A drone with Lego Motor."}, {"id": 457, "start": 2901.2, "end": 2902.92, "text": "Das soll funktionieren?"}, {"id": 458, "start": 2902.92, "end": 2906.36, "text": "Ist das Lego Motor Zeug nicht viel zu schwer?"}, {"id": 459, "start": 2906.36, "end": 2909.84, "text": "Also, das war immer so mein Traum, wie ich klein war."}, {"id": 460, "start": 2909.84, "end": 2911.96, "text": "Ich hab ja auch viel Lego Technik gebastelt."}, {"id": 461, "start": 2911.96, "end": 2916.46, "text": "Ich hatte auch so einen fetten Lego Motor und hatte auch ein paar Propeller und sonst"}, {"id": 462, "start": 2916.46, "end": 2917.46, "text": "was."}, {"id": 463, "start": 2917.46, "end": 2924.12, "text": "Das höchste der Gefühle, was ich geschafft hab, ist ein Schiff, was fahren konnte mit"}, {"id": 464, "start": 2924.12, "end": 2936.2, "text": "Propeller und ein, da hatte ich so ein Brett gebaut, das war ja nicht wirklich ein Schiff,"}, {"id": 465, "start": 2936.2, "end": 2940.92, "text": "also so ein Brett mit Lego Motor drauf, was man dann so minimalsteuern konnte."}, {"id": 466, "start": 2940.92, "end": 2950.08, "text": "Aber ansonsten, dass das abhebt, habe ich so meine Zweifel, wobei, je nachdem, was es"}, {"id": 467, "start": 2950.08, "end": 2966.96, "text": "für neue Lego Motoren gibt, ach so, der betreibt es auch nicht mit dem normalen Lego Motor"}, {"id": 468, "start": 2966.96, "end": 2971.72, "text": "Motor, sondern der benutzt nur den Lego Motor und dann ein ordentliches Netzteil für."}, {"id": 469, "start": 2971.72, "end": 2979.24, "text": "Okay, ja, dann könnte ich mir das natürlich vorstellen, dass das doch funktionieren könnte."}, {"id": 470, "start": 2979.24, "end": 2990.8, "text": "Was hat er da unten drunter stehen, ach, das ist eine Waage, oder, das ist eine Waage,"}, {"id": 471, "start": 2990.8, "end": 2993.08, "text": "dass er gucken kann, wie viel hebt das Ding hoch."}, {"id": 472, "start": 2993.08, "end": 3009.36, "text": "Der L-Motor ist der Mehr-Pepo-Fett."}, {"id": 473, "start": 3009.36, "end": 3037.28, "text": "Gleich geht's durch die Decke, okay, Minus, Minus ist schon mal gut, das ist nice, okay,"}, {"id": 474, "start": 3037.28, "end": 3042.16, "text": "das heißt, wenn er so eine Drohne baut, wenn er davon jetzt vier Stück nimmt, dann muss"}, {"id": 475, "start": 3042.16, "end": 3050.72, "text": "er das Ding ungefähr, sag mal, der Rest darf maximal 200 Gramm zusätzlich wiegen, dass"}, {"id": 476, "start": 3050.72, "end": 3056.48, "text": "es noch funktioniert, am besten deutlich weniger, weil ansonsten wird es halt mit dem Fliegen"}, {"id": 477, "start": 3056.48, "end": 3076.16, "text": "ein bisschen eklig, ach, gucken wir mal, Stress-Test, na gut, dass die Lego kaputt geht, denke ich"}, {"id": 478, "start": 3076.16, "end": 3081.32, "text": "mal nicht, aber ob es am Ende abhebt, habe ich trotzdem so meine Zweifel, ich meine,"}, {"id": 479, "start": 3081.32, "end": 3085.72, "text": "da muss ja noch Steuerung dran, da müssen Akkus dran, also sprich, da muss irgendwie"}, {"id": 480, "start": 3085.72, "end": 3092.44, "text": "die Akkus dran bekommen und das alles, sagen wir mal, sollte unter 150 Gramm zusammenwiegen,"}, {"id": 481, "start": 3092.44, "end": 3099.72, "text": "Akkus, Steuerung, alles, Kabel, was auch immer man braucht, das sollte alles unter 150 Gramm,"}, {"id": 482, "start": 3099.72, "end": 3125.2, "text": "das müssen wir mal wiegen, sonst fliegt es halt nicht gescheit, ach, Moment, der braucht"}, {"id": 483, "start": 3125.2, "end": 3128.8, "text": "ja zwei, der braucht zwei Motoren, die sich links rumdrehen und zwei, die sich rechts"}, {"id": 484, "start": 3128.8, "end": 3133.52, "text": "rumdrehen, dass die Drohne nicht so einen Trall hat, im Kreis sich zu drehen, oder,"}, {"id": 485, "start": 3133.52, "end": 3143.84, "text": "oder warum braucht der zwei in die Richtung, zwei in die Richtung, nee, das funktioniert"}, {"id": 486, "start": 3143.84, "end": 3150.08, "text": "so nicht, das wackelt, das bounce ja, das ist ihm aber voll, das bounce ja wie verrückt"}, {"id": 487, "start": 3150.08, "end": 3159.4, "text": "rum, ok, dann hat er insgesamt noch weniger, also da muss er auf jeden Fall unter 150 Gramm"}, {"id": 488, "start": 3159.4, "end": 3181.88, "text": "zusätzliche noch bleiben, sonst hebt das Ding nicht ab, Big Brain Lego Skills, ah,"}, {"id": 489, "start": 3181.88, "end": 3195.36, "text": "der gute Wackeltest, oh nee, das wird so nichts, ah, yes, weiß aber nicht, wie gut das dann"}, {"id": 490, "start": 3195.36, "end": 3222.56, "text": "funktioniert, wenn sich das überlagert, macht das bestimmt ein bisschen größer, ja, ja,"}, {"id": 491, "start": 3222.56, "end": 3241.52, "text": "gib ihm, ja, viel besser gleich, viel besser, wenn sich das nicht überlappt, ok, das heißt,"}, {"id": 492, "start": 3241.52, "end": 3249.16, "text": "der muss jetzt, ok, ok, mal langsam, also der muss jetzt den Rest Akkus und Verkabelung"}, {"id": 493, "start": 3249.16, "end": 3254.36, "text": "und Steuerung, muss unter 125 Gramm sein, dass das Ding abhebt, wobei es sollte eine"}, {"id": 494, "start": 3254.36, "end": 3259.72, "text": "ganze Ecke unter 125 Gramm sein, also was weiß ich, unter 100 Gramm, aber allein schon"}, {"id": 495, "start": 3259.72, "end": 3270.36, "text": "die Akkus dürften über 120, da bin ich mal gespannt was da rauskommt, na gut, oder es"}, {"id": 496, "start": 3270.36, "end": 3278.12, "text": "sind halt welche mit nicht viel Ladung, was ist denn so ein normaler Drohnen Akku, ich"}, {"id": 497, "start": 3278.12, "end": 3285.4, "text": "hab keine Ahnung ehrlich gesagt, was fährt man da normalerweise, 800 milliampere Stunden"}, {"id": 498, "start": 3285.4, "end": 3295.8, "text": "oder, ich hab keinen Schimmer, ich hab da mich null mit beschäftigt bisher, eine runde"}, {"id": 499, "start": 3295.8, "end": 3320.76, "text": "Transistor, jetzt wird es gesteckt, PWM Signal für die, ach, das ist der Controller für"}, {"id": 500, "start": 3320.76, "end": 3331.6, "text": "die Lüfter, ok, PWM Signal braucht man für die Steuerung vom, warum hat er nochmal, warum"}, {"id": 501, "start": 3331.6, "end": 3344.36, "text": "hat er nochmal, ah, ok, das ist PWM Signal, 3,3 Volt vom Controller an den Transistor"}, {"id": 502, "start": 3344.36, "end": 3352.16, "text": "und da drüber gehen dann bis zu 55 Volt, ok, der Controller wird mit anderer Spannung"}, {"id": 503, "start": 3352.16, "end": 3358.04, "text": "betrieben logischerweise als der Motor, passt ja auch, klingt ja irgendwie logisch, das"}, {"id": 504, "start": 3358.04, "end": 3363.96, "text": "heißt er braucht das PWM Signal, nimmt damit, wenn ich das richtig verstehe, vom Controller"}, {"id": 505, "start": 3363.96, "end": 3371.16, "text": "mit 3 Volt als Input und der Transistor gibt das dann irgendwie weiter, das PWM Signal,"}, {"id": 506, "start": 3371.16, "end": 3383.12, "text": "ok, warte mal, boah, was ist das für Big Brain Software, ach, der Controller hat auch"}, {"id": 507, "start": 3383.12, "end": 3391.88, "text": "automatisch gleich so einen, wie nennt man das, so einen Accelerator oder was auch immer"}, {"id": 508, "start": 3391.88, "end": 3398.24, "text": "Sensor mit eingebaut, dass du weißt, wie das gerade liegt und wie es beschleunigt und"}, {"id": 509, "start": 3398.24, "end": 3419.36, "text": "sonst was, Lage Controller, ok, ja, aha, jetzt flutscht es, das hat mir der Chat beigebracht,"}, {"id": 510, "start": 3419.36, "end": 3422.56, "text": "ich wusste gar nicht, dass man das mit nem Teppichmesser abschneiden kann, könnt ihr"}, {"id": 511, "start": 3422.56, "end": 3426.04, "text": "euch noch, falls da jemand dabei war von euch, ich hab mich ja auch mal gefragt, wie ich"}, {"id": 512, "start": 3426.04, "end": 3430.92, "text": "so ein paar Platten abkriege, dann meint der Chat, nehm einfach Teppichmesser und schneide"}, {"id": 513, "start": 3430.92, "end": 3435.24, "text": "zweimal durch und brechst es dann ab und was hab ich gemacht, zweimal mit dem Messer drüber"}, {"id": 514, "start": 3435.24, "end": 3440.24, "text": "und abgebrochen und es hat funktioniert, richtig Expanded Brain vom Chat wieder gewesen."}, {"id": 515, "start": 3440.24, "end": 3458.32, "text": "Und das, wenns fertig ist, warum bohrt der da Löcher rein, hat niemand, warum bohrt"}, {"id": 516, "start": 3458.32, "end": 3473.08, "text": "der da Löcher rein, ach Leiterbahn unterbrechen, ok, exzellent, exzellent, bohr, das ist ja"}, {"id": 517, "start": 3473.08, "end": 3487.28, "text": "die halbe Rolle, lützchen, warum du pink bist, weil das random im Chat ist, also in"}, {"id": 518, "start": 3487.28, "end": 3509.44, "text": "dem Anzeige Chat, ok, 4 Stück, weil 4 Motoren vermute ich mal, das ist ja so ein bisschen"}, {"id": 519, "start": 3509.44, "end": 3521.24, "text": "der Unterschied zwischen Drohnen oder sag mal mal auch so Spielzeughelis und echten Helikoptern,"}, {"id": 520, "start": 3521.24, "end": 3528.56, "text": "bei echten Helikoptern hast du ja in der Regel das, also wie stark der sinkt und steigt,"}, {"id": 521, "start": 3528.56, "end": 3536.76, "text": "machst du ja bei echten Helis mit dem Anstellwinkel quasi der Rotorblätter und bei Drohnen machst"}, {"id": 522, "start": 3536.76, "end": 3560.84, "text": "du es über die Drehgeschwindigkeit der Motoren, ich mein wisst ihr was das coole ist im Jahr"}, {"id": 523, "start": 3560.84, "end": 3567.04, "text": "2021, dass es schon für ein Appel und ein Ei solche fertigen Controller gibt, wo du"}, {"id": 524, "start": 3567.04, "end": 3570.84, "text": "eigentlich nix machen musst außer den Kram anlöten und vielleicht irgendwie Firma drauf"}, {"id": 525, "start": 3570.84, "end": 3600.76, "text": "flaschen, Pog, ah ja klar, er muss das Ding ja irgendwie fernsteuern, kommt das Xbox,"}, {"id": 526, "start": 3600.76, "end": 3625.76, "text": "das Xbox Gamepad, ok jetzt muss er das wahrscheinlich irgendwie peern, dass das ordentlich funktioniert,"}, {"id": 527, "start": 3625.76, "end": 3633.68, "text": "also das ganze Zeug was er da jetzt baut muss unter 100 Gramm wiegen, inklusive Akkus, sonst"}, {"id": 528, "start": 3633.68, "end": 3639.96, "text": "hebt das Ding nicht gescheit ab und ich weiß nicht wie dieser Effekt heißt, aber man darf"}, {"id": 529, "start": 3639.96, "end": 3647.6, "text": "sich da nicht jebaiten lassen, also überm Boden erzeugt das Ding mehr Auftrieb als höher"}, {"id": 530, "start": 3647.6, "end": 3651.56, "text": "in der Luft, da gibt es irgendwie so ein, frag mich nicht, da gibt es irgendwie so einen"}, {"id": 531, "start": 3651.56, "end": 3660.44, "text": "speziellen Turbulenzen, Verwirbelungseffekt irgendwie, also du brauchst quasi weniger"}, {"id": 532, "start": 3660.44, "end": 3668.64, "text": "Power knapp überm Boden, wie wenn du hochfliegst, deswegen kann das sein, dass es quasi abhebt"}, {"id": 533, "start": 3668.64, "end": 3686.0, "text": "und dann direkt wieder runterfällt, wenn es zu schwer ist, ah ja Obvious, SC, na klar,"}, {"id": 534, "start": 3686.0, "end": 3692.0, "text": "Verlängerungskabel, bin mir da gar nicht so sicher, ab einer gewissen Höhe ist wahrscheinlich"}, {"id": 535, "start": 3692.0, "end": 3695.88, "text": "so ein Verlängerungskabel genauso schwer und ab einer gewissen Höhe ein Verlängerungskabel"}, {"id": 536, "start": 3695.88, "end": 3705.24, "text": "noch schwerer als die Akkus, weil das wiegt ja auch was, wobei ich weiß nicht, 100 Gramm"}, {"id": 537, "start": 3705.24, "end": 3735.16, "text": "Kabel, wieviel Meter sind das, Power Offer Wifi müsste das betreiben, genau, da braucht"}, {"id": 538, "start": 3735.16, "end": 3749.0, "text": "man gar keine Akkus mehr, naja, ok, das wird aber, das wird, ok, 50 Gramm für die Akkus,"}, {"id": 539, "start": 3749.0, "end": 3755.2, "text": "das sein Controller und Kabelzeug wird wahrscheinlich auch nochmal 10-15 Gramm wiegen, da bleibt"}, {"id": 540, "start": 3755.2, "end": 3765.96, "text": "er auf jeden Fall, also das Ding kann zumindest potenziell abheben, ey man soll da nicht krasse"}, {"id": 541, "start": 3765.96, "end": 3780.32, "text": "Flugeigenschaften, wenn wir das jetzt nicht haben, das ist richtig geil, dass es sowas"}, {"id": 542, "start": 3780.32, "end": 3784.48, "text": "schon als kostenlose Software beziehungsweise für kleines Geld gibt an Controller und Software"}, {"id": 543, "start": 3784.48, "end": 3790.16, "text": "als mega Poggers, ich hab davon keinen Plan, also ich hab mich nie mit Drohnen großartig"}, {"id": 544, "start": 3790.16, "end": 3806.2, "text": "beschäftigt, aber ist schon geil, oh, das sieht schon besser aus, so, das ist das was"}, {"id": 545, "start": 3806.2, "end": 3809.88, "text": "ich meine, wenn der, wenn der, ich hab, wie gesagt, ich hab keine Ahnung, da gibt es"}, {"id": 546, "start": 3809.88, "end": 3815.92, "text": "irgend so ein Effekt, gibt es auch bei Helis und so, wenn der so knapp über den Boden"}, {"id": 547, "start": 3815.92, "end": 3822.08, "text": "fliegt, braucht der weniger Auftrieb um zu fliegen, als wenn er hoch fliegt, weil es"}, {"id": 548, "start": 3822.08, "end": 3829.68, "text": "irgendwie, weil es einmal, glaube ich, Auftrieb erzeugt durch das Luft durchziehen und dann"}, {"id": 549, "start": 3829.68, "end": 3836.16, "text": "weil die Luft von unten vom Boden quasi abprallt und nochmal, also du brauchst weniger, Beta"}, {"id": 550, "start": 3836.16, "end": 3852.0, "text": "Flight auf GitHub, Beta Flight, ah ja, nice, guck mal da, Beta Flight, nicht Sigma Flight,"}, {"id": 551, "start": 3852.0, "end": 3878.84, "text": "es ist Beta Flight, nice, hier, das meine ich Leute, das meine ich, hier, der Bodeneffekt,"}, {"id": 552, "start": 3878.84, "end": 3884.52, "text": "als Bodeneffekt bezeichnet man ein physikalisches Phänomen, das ein umströmter Körper in Bodennähe"}, {"id": 553, "start": 3884.52, "end": 3892.36, "text": "erfährt, jeweils kann je nach Form des umströmten Körpers zusätzlicher dynamischer Auftrieb"}, {"id": 554, "start": 3892.36, "end": 3905.52, "text": "oder auch Abtrieb entstehen, alles klar, jetzt wissen wir Bescheid, noted, ah jetzt muss"}, {"id": 555, "start": 3905.52, "end": 3913.84, "text": "er den Kram noch kalibrieren, dass das überall gleichermaßen stabil bleibt, ok, das sieht"}, {"id": 556, "start": 3913.84, "end": 3919.88, "text": "schon viel besser aus jetzt, ey, das könnte wirklich funktionieren, ne, wahrscheinlich"}, {"id": 557, "start": 3919.88, "end": 3924.4, "text": "funktioniert es, als hätte er das Video nicht gemacht, auf der anderen Seite, auch wenn"}, {"id": 558, "start": 3924.4, "end": 3931.88, "text": "es nicht funktioniert, ist das trotzdem ein Video, das viele Leute angucken, das sieht"}, {"id": 559, "start": 3931.88, "end": 3937.08, "text": "erstaunlich gut aus, was hat er denn jetzt, ich hab jetzt gar nicht geguckt, was hat er"}, {"id": 560, "start": 3937.08, "end": 3949.52, "text": "denn jetzt für Akkus, oh, oh, boah, guck, dann sieht man es, sobald er ein bisschen"}, {"id": 561, "start": 3949.52, "end": 3959.8, "text": "vom Boden wegfliegt, hat das Ding ordentliche Probleme hochzukommen, ah, mehr Power, ok,"}, {"id": 562, "start": 3959.8, "end": 3971.6, "text": "33 Volt, was sind das für welche, weiß man nicht, kann man das kalibrieren, auch wenn"}, {"id": 563, "start": 3971.6, "end": 3984.92, "text": "die Gewichtsverteilung nicht optimal ist, ja genau dafür ist es da denke ich mal, ja"}, {"id": 564, "start": 3984.92, "end": 4012.72, "text": "viel besser Klai, ja viel besser, oh, und zack, pock, oh, rip, ok, ok, ok, ok, ok, ok,"}, {"id": 565, "start": 4012.72, "end": 4019.2, "text": "lopass, ja"}, {"id": 566, "start": 4042.72, "end": 4056.94, "text": "Funktioniert erstaunlich gut, oh jetzt muss es fein, da ist sehr wenig Platz für die"}, {"id": 567, "start": 4056.94, "end": 4061.78, "text": "Größe der Drohne und so super ruhig liegt die ja auch nicht in der Luft, also das stelle"}, {"id": 568, "start": 4061.78, "end": 4089.0, "text": "ich mir schwer vor, rums, das wird nichts, ein bisschen mehr Platz, aber cool das es"}, {"id": 569, "start": 4089.0, "end": 4101.08, "text": "überhaupt funktioniert, ja, schon nice, da habe ich immer davon geträumt, wie ich klein"}, {"id": 570, "start": 4101.08, "end": 4109.2, "text": "war mal irgendwas mit Lego Motor zu bauen, das was fliegen kann, man muss ja sagen, es"}, {"id": 571, "start": 4109.2, "end": 4116.88, "text": "ist natürlich nicht pur Lego, allein schon die Akkus und das Teilstrom herum ist nichts,"}, {"id": 572, "start": 4116.88, "end": 4125.72, "text": "was du mit Lego alleine bauen konntest, aber ist schon nice, kannst du den Videolink, du"}, {"id": 573, "start": 4125.72, "end": 4151.24, "text": "meinst das hier, ja, Org, funktioniert, oh was hat es gekostet, guck mal ist gar nicht"}, {"id": 574, "start": 4151.24, "end": 4160.44, "text": "so teuer, guck mal der Controller 22 Euro und der Empfänger für den Controller nochmal"}, {"id": 575, "start": 4160.44, "end": 4169.68, "text": "20 Euro, also du bist mit 40 Euro für so ein Steuerungs Ding dabei und 7 Euro für"}, {"id": 576, "start": 4169.68, "end": 4185.14, "text": "den Astronaut, ja, ah der Controller und die Batterien, ja gut, die Akku Packs, 200"}, {"id": 577, "start": 4185.14, "end": 4208.68, "text": "mAh, ok, lange fliegt die Drohne aber nicht, oh ok, also ein Schnapper ist es nicht gerade,"}, {"id": 578, "start": 4208.68, "end": 4216.44, "text": "da kriegt man mit Sicherheit bessere und günstigere Drohne, aber es geht ja auch darum, dass es"}, {"id": 579, "start": 4216.44, "end": 4238.54, "text": "geht, jo nice, die 9 Stück sind zusammen wie ein kleiner Handyakku, nee, die sind bestimmt"}, {"id": 580, "start": 4238.54, "end": 4252.36, "text": "nicht parallel betrieben oder, oder doch, nee, wie kommt er sonst auf 33,3 Volt, was"}, {"id": 581, "start": 4252.36, "end": 4281.2, "text": "hat er für Akkus, Akkus, ach hier sind die Akku Packs, naja, aber cool, dass das funktioniert,"}, {"id": 582, "start": 4281.2, "end": 4292.32, "text": "nicht übel, hätt ich am Anfang nicht gedacht ehrlich gesagt, dass das funktioniert, Battlefield"}, {"id": 583, "start": 4292.32, "end": 4299.56, "text": "2042, aber wenn du Battlefield ausmachst, sobald du eine Cringe-Voice-Line hörst, dann"}, {"id": 584, "start": 4299.56, "end": 4318.36, "text": "ist ja quasi direkt nach Start aus, ja, oh, das ist der schlimmste Spruch im ganzen Game,"}, {"id": 585, "start": 4318.36, "end": 4325.8, "text": "und Spiel ausschalten, ja, komm mal, jetzt haben wir ein Lego-Video geguckt, jetzt kriegen"}, {"id": 586, "start": 4325.8, "end": 4333.8, "text": "wir nur noch Lego-Videos empfohlen, der YouTube-Algorithmus ist bei der Arbeit, der Drachenlord versagt"}, {"id": 587, "start": 4333.8, "end": 4339.04, "text": "erneut bei Mario 64, ist der nicht im Gefängnis, ich dachte der muss ins Gefängnis, hab ich"}, {"id": 588, "start": 4339.04, "end": 4347.08, "text": "irgendwas mitbekommen, was ist denn da rausgekommen jetzt, ich hab, ich kann mich noch an das"}, {"id": 589, "start": 4347.08, "end": 4356.52, "text": "Gerichtsurteil erinnern, dass er irgendwie ins Gefängnis muss, oh, aber anscheinend"}, {"id": 590, "start": 4356.52, "end": 4386.28, "text": "doch nicht, aha, geht noch weiter, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 591, "start": 4386.28, "end": 4406.42, "text": "ok, ok, ok,olui, jetzt abdomen, ok, ok, ok, ok, ok, ok,ok, ok, mal schauen, mal schauen,"}, {"id": 592, "start": 4406.42, "end": 4408.42, "text": "Das brauchen wir nicht"}, {"id": 593, "start": 4409.72, "end": 4416.1, "text": "Okay, was gucken wir uns als nächstes an schuldinge die ich nie verstanden habe das ist wieder das summa video haben wir uns letzten schon"}, {"id": 594, "start": 4416.1, "end": 4417.86, "text": "was angeguckt"}, {"id": 595, "start": 4417.86, "end": 4421.42, "text": "Und das sind nur drei minuten 43. Mal gucken ob ich ob ich"}, {"id": 596, "start": 4422.46, "end": 4425.46, "text": "die summa high speed schnitte dieses mehr aushalten"}, {"id": 597, "start": 4428.22, "end": 4435.82, "text": "Nach all meinen jahren schule gibt es immer noch einiges dass ich einfach nie verstanden haben eines davon ist wer hat sich die regeln ausgedacht"}, {"id": 598, "start": 4435.82, "end": 4440.62, "text": "Und verbreitet dass wenn lehrer nach 15 minuten nicht das ist schwachsinn hause gehen dürfte"}, {"id": 599, "start": 4440.82, "end": 4446.98, "text": "Das ist das das haben die bei mir schon in der schule erzählt aber das ist halt komplett das schwachsinn allein schon aus"}, {"id": 600, "start": 4447.62, "end": 4454.38, "text": "haftungstechnischen gründen kann das nicht funktionieren sollten schulden so eine regel haben jedes mal gab es bei mir immer irgendjemanden der nach fünf minuten meinte"}, {"id": 601, "start": 4454.5, "end": 4461.14, "text": "Jo leute noch zehn minuten dann dürfen wir gehen ja ja das ist die regel glaubt mir einfach und falls das jemand von euch auch noch glaubt"}, {"id": 602, "start": 4461.14, "end": 4469.54, "text": "Sorry schwachsinn die regel ist ja das ist ich meine jeder der nur irgendwie fünf gehirnzellen im kopf hat sollte eigentlich auf die idee kommen"}, {"id": 603, "start": 4470.26, "end": 4472.86, "text": "Dass das bescheuert ist aber das haben die bei mir auch erzählt"}, {"id": 604, "start": 4473.5, "end": 4479.14, "text": "Ich bin mir nicht sicher ob ich glaube bei mir waren sogar noch zehn minuten wenn zehn minuten keiner kommt oder so"}, {"id": 605, "start": 4480.3, "end": 4483.1, "text": "Wir hatten es auch ein paar mal da kann ich mich noch daran erinnern"}, {"id": 606, "start": 4484.22, "end": 4488.46, "text": "Wir hatten es auch ein paar mal dass sie lehrer wirklich nicht gekommen sind und"}, {"id": 607, "start": 4488.46, "end": 4493.1, "text": "Dann sind die da sind die leute dann runter ins"}, {"id": 608, "start": 4494.3, "end": 4498.26, "text": "Beim lehrerzimmer und da wusste dann auch keiner wo das steckt"}, {"id": 609, "start": 4499.38, "end": 4506.3, "text": "Und da durften wir in in diesen pausenraum gehen für die stunde ja das ist ein paar mal passiert ich weiß bis heute nicht was mit dem los war"}, {"id": 610, "start": 4507.3, "end": 4512.94, "text": "Wir hatten die ultra fertige lehrer also unsere chemie lehrerin die hat permanent gezittert"}, {"id": 611, "start": 4512.94, "end": 4518.18, "text": "Und nachher habe ich auch rausgekriegt warum die hat sich halt öfters mal ein bisschen zu viel gegönnt"}, {"id": 612, "start": 4519.02, "end": 4523.58, "text": "Das ist dann später rausgekommen und ein lehrer bei uns hat sich umgebracht"}, {"id": 613, "start": 4525.26, "end": 4527.26, "text": "Das fand ich damals mega schockierend"}, {"id": 614, "start": 4528.22, "end": 4533.98, "text": "Aber ein lehrer der hat der hatte bei uns auch den informatik kann man es nicht nicht nennen"}, {"id": 615, "start": 4535.26, "end": 4538.7, "text": "computer kurs sagen wir mal der hat sich umgebracht"}, {"id": 616, "start": 4538.7, "end": 4545.3, "text": "Sagen wir mal der hat sich umgebracht und das fand ich damals richtig schockierbar ist es ja im prinzip auch du rechtest ja mit nix"}, {"id": 617, "start": 4545.74, "end": 4549.1, "text": "Und auf einmal kriegst du morgens erzählt hier übrigens euer lehrer hat sich umgebracht"}, {"id": 618, "start": 4550.66, "end": 4553.58, "text": "Das war schon heftig geschichte damals"}, {"id": 619, "start": 4560.38, "end": 4563.14, "text": "Ja genau so war das so war das bei uns auch"}, {"id": 620, "start": 4563.14, "end": 4568.34, "text": "Man ist dann man ist dann in zum lehrerzimmer gegangen und dann wurde geguckt was halt witzig war"}, {"id": 621, "start": 4569.94, "end": 4572.5, "text": "Was halt was halt witzig war bei uns dass"}, {"id": 622, "start": 4573.22, "end": 4576.66, "text": "Die im lehrerzimmer nicht mal wussten wo der typ war"}, {"id": 623, "start": 4577.38, "end": 4581.62, "text": "Also wir hatten so ein üblichen üblichen verdächtigen also es war eigentlich immer der gleiche der zu spät gekommen ist"}, {"id": 624, "start": 4581.62, "end": 4585.86, "text": "Erst mal nach zehn minuten zum lehrerzimmer und hat gefragt wie es ist und da wusste auch keiner wo der ist"}, {"id": 625, "start": 4587.62, "end": 4591.3, "text": "Hat sich irgendwo abgeseilt zwischendurch und keiner wusste wo er steckt"}, {"id": 626, "start": 4591.3, "end": 4593.3, "text": "Tja"}, {"id": 627, "start": 4594.58, "end": 4599.06, "text": "In den 2000 auch verständlich warum in den 2000er war die welt noch in ordnung"}, {"id": 628, "start": 4600.1, "end": 4605.86, "text": "Wünschte es wäre war ich dachte auch immer die blaue seite von diesen radier gummys wäre zum tinte radieren da"}, {"id": 629, "start": 4606.5, "end": 4613.94, "text": "Das das dachte ich nie aber ich das dachte ich tatsächlich nie aber ich weiß bis heute nicht wofür die blaue seite der radier gummys eigentlich da ist"}, {"id": 630, "start": 4615.14, "end": 4618.18, "text": "Es funktioniert nicht also wer hat sich auch diese lüftung"}, {"id": 631, "start": 4618.18, "end": 4624.9, "text": "Es funktioniert nicht also wer hat sich auch diese lüge ausgedacht und für was ist es sonst da ja anscheinend ist es wirklich für tinte"}, {"id": 632, "start": 4624.9, "end": 4630.66, "text": "Ah cool merke ich bei klassenarbeiten war es bei mir auch immer mit tinte quatsch ernsthaft"}, {"id": 633, "start": 4630.82, "end": 4635.9, "text": "Ich habe da nicht auf die ich bin noch nie auf die idee gekommen da tinte für das kannst du noch mit keine tinte mit weg machen"}, {"id": 634, "start": 4636.7, "end": 4639.74, "text": "Aber wofür die blaue seite bei radieren da ist habe ich auch nicht verstanden"}, {"id": 635, "start": 4640.18, "end": 4645.7, "text": "Die lehrer haben ewig gebraucht um sie zu korrigieren und meinten zu uns immer so ja ihr seid ja noch in der mittelstufe"}, {"id": 636, "start": 4645.7, "end": 4651.62, "text": "Ich muss zuerst die elften und zwölften korrigieren die machen gerade abitur ist viel wichtiger und ich denke mir ok ok ergibt"}, {"id": 637, "start": 4651.62, "end": 4657.7, "text": "Den doch sobald ich selbst in den abiturklassen bin heißt es hier ich bin klassenlehrer ja ich muss ich muss so viel von den unteren"}, {"id": 638, "start": 4657.7, "end": 4658.7, "text": "Stufen noch"}, {"id": 639, "start": 4658.7, "end": 4661.8, "text": "Das ist einfach das ist halt einfach ausrede ja"}, {"id": 640, "start": 4663.5, "end": 4671.42, "text": "Das spielchen also und wieso machen lehrer auch das so oft sie sind am pc sie machen einen filmen und setzen sich nach hinten und lassen den"}, {"id": 641, "start": 4671.42, "end": 4674.18, "text": "Mauszeiger durch geht mitten im bild wie jetzt"}, {"id": 642, "start": 4674.18, "end": 4681.14, "text": "Sehen sie das nicht wo ist das problem was macht man in der situation soll ich jetzt mittendrin nach vorne ich sehe das problem nicht"}, {"id": 643, "start": 4683.22, "end": 4687.34, "text": "Dann werden wir alle wohl ein müssen irgendwann hat jemand von mir einfach einen normalen vortrag halten"}, {"id": 644, "start": 4687.34, "end": 4690.82, "text": "Ihr wisst wilder benutzt freigesprochen deswegen kommt am ende natürlich"}, {"id": 645, "start": 4690.82, "end": 4699.1, "text": "Ihr wisst hand andere hand klatsch der klassiker doch plapper ich aus dem nicht haben alle ab da statt zu klatschen auf den tisch"}, {"id": 646, "start": 4699.1, "end": 4702.26, "text": "Geklopft ja das verstehe ich auch nicht warum"}, {"id": 647, "start": 4702.26, "end": 4705.26, "text": "Das das habe ich bis heute auch das habe ich bis heute nicht verstanden"}, {"id": 648, "start": 4706.26, "end": 4710.26, "text": "Macht ihr das nicht ein bisschen falsch oder habe ich irgendwas verpasst habe nie krank will einer von euch erklären dass ihr abgeht"}, {"id": 649, "start": 4710.26, "end": 4715.26, "text": "Habs ab da nicht mehr hinterfragt und ab da auch immer gemacht ich verstehe es immer noch nicht zum nächsten ding französisch"}, {"id": 650, "start": 4717.26, "end": 4722.26, "text": "Ein anderes ding sind glami patrouille wieso jemand fragt hey hat ihr mit einer tinten patrouille wisst ihr was ich nicht verstehe"}, {"id": 651, "start": 4722.26, "end": 4730.26, "text": "Warum schreibt man warum kann man nicht einfach mit bleistift mit mit bleistift oder mit kulli schreiben warum braucht man so ein so ein krab wie füller"}, {"id": 652, "start": 4730.26, "end": 4737.26, "text": "Von handschreiben eigentlich heutzutage noch ich freibildlich wie ich bin haben natürlich eine parat hier hier"}, {"id": 653, "start": 4737.26, "end": 4744.26, "text": "Aha dank oh nee nicht so eine ich brauche eine lami patrouille warum hat lami eigene tinten patrouille formen"}, {"id": 654, "start": 4744.26, "end": 4747.26, "text": "Warum passen die normalen weil weil wenn du lock in"}, {"id": 655, "start": 4749.26, "end": 4756.26, "text": "Nicht rein die sind sogar kleiner was ich auch nicht verstehe die märchen ihr sitzt im klassenraum rum der lehrer kommt rein und kommt mit diesen"}, {"id": 656, "start": 4756.26, "end": 4762.26, "text": "Dingern an erstens was ist das überhaupt und zweitens warum existieren die man kriegt ein testschreib"}, {"id": 657, "start": 4762.26, "end": 4764.26, "text": "Ach das ist so ein sicht schutzdinger"}, {"id": 658, "start": 4766.26, "end": 4772.26, "text": "Da steht immer irgendwas drauf warum gehen bleistift aus rechtlichen gründen nicht wenn ich in der klasse"}, {"id": 659, "start": 4772.26, "end": 4778.26, "text": "Sitze und mal also bei arbeiten kann ich ja noch verstehen aber wenn ich in der klasse sitze und dort was aufschreibe kann ich das doch machen mit was ich will"}, {"id": 660, "start": 4779.26, "end": 4785.26, "text": "Und bei uns wollten sie auch immer dass man das mit füller schreibt was ziemlich bescheuert war aber gerade bleistift"}, {"id": 661, "start": 4785.26, "end": 4787.26, "text": "Müsste funktionieren"}, {"id": 662, "start": 4790.26, "end": 4795.26, "text": "Ablenkt und das design ist irgendwie und wenn ich wirklich abschreiben wollen würde könnte man ja trotzdem"}, {"id": 663, "start": 4796.26, "end": 4810.26, "text": "Manchmal blockiert genau das teilt sicht zum lehrer entweder es gibt einen guten lehrer rabatt oder sie hat krasse special lehrer funktionen alles kann ich mir nicht erklären warum jeder lehrer diese tasche hat und wo wir bei taschen sind ich hatte bis zur sechsten klasse noch so einen schuhranzen"}, {"id": 664, "start": 4810.26, "end": 4819.26, "text": "Ich hatte ich hatte ein east pack in east pack rucksack und die ganzen die ganzen coolen leute"}, {"id": 665, "start": 4821.26, "end": 4828.26, "text": "Die haben bei uns immer weiß nicht ob man das heutzutage noch so macht east pack logo"}, {"id": 666, "start": 4828.26, "end": 4850.26, "text": "Die haben die haben das so übermalt dass dann also sie haben halt die haben quasi hier das das das e und das t übermalt dass dann asi pack drauf stande richtig richtig pains jam"}, {"id": 667, "start": 4850.26, "end": 4865.26, "text": "Das da war man cool damals wenn man das gemacht hat man hat einfach einen schwarzen adding genommen hat das e weggemacht und das t und dann war das asi pack"}, {"id": 668, "start": 4865.26, "end": 4889.26, "text": "Genau das hier genau das genau das ja oder hat man sie richtig nice gefühlt weil asi pack hatte"}, {"id": 669, "start": 4889.26, "end": 4893.26, "text": "Während alle anderen nach der zeit schon auf rucksäcke gewechselt sind"}, {"id": 670, "start": 4894.26, "end": 4900.26, "text": "Es ist nicht mehr cool es funktioniert doch noch einwandfrei was anderes was mich verwirrt so ein klassen frühstück"}, {"id": 671, "start": 4900.26, "end": 4920.26, "text": "Also rucksäcke rucksäcke waren bei uns auch so ein ding also ich hatte ich hatte immer rucksäcke also ne in der grundschule nicht aber ich hatte immer rucksäcke und ich habe heute noch einen rucksack weil ich rucksäcke einfach praktisch finde aber irgendwann haben die leute bei uns dann angefangen so coole umhängetaschen so hipster umhängetaschen zu haben"}, {"id": 672, "start": 4921.26, "end": 4925.26, "text": "Hipster umhängetasche"}, {"id": 673, "start": 4925.26, "end": 4932.26, "text": "Ne ne ne ne nicht sowas okay hipster soll ich vielleicht weglassen"}, {"id": 674, "start": 4933.26, "end": 4938.26, "text": "Die leute hatten dann so coole so was da in der richtung die hatten dann alle so coole umhängetaschen nur noch"}, {"id": 675, "start": 4939.26, "end": 4949.26, "text": "Und ich hab den sinn und die daseinsberechtigung von umhängetaschen bis heute noch nicht verstanden wenn man doch einfach einen rucksack anziehen kann"}, {"id": 676, "start": 4949.26, "end": 4957.26, "text": "Die bammelt nicht rum die ist nicht im weg ein rucksack passt mehr rein wo ist der sinn von einer umhängetasche"}, {"id": 677, "start": 4958.26, "end": 4970.26, "text": "Wer von euch sich die mühe macht 60 brötchen zu kaufen um sie um acht uhr in die schule mitzunehmen also versteht mich nicht falsch ich bin dir auf ewig dankbar dass du uns für das team einsetzt und opferst oder deine eltern aber bro es gibt viel leichtere jobs"}, {"id": 678, "start": 4971.26, "end": 4976.26, "text": "Käse Brotaufschnitt Marmelade Obst ich hab zum beispiel zum klassen frühstück immer wasser mitgenommen"}, {"id": 679, "start": 4976.26, "end": 4978.26, "text": "wasser mitgenommen wasser perfekt"}, {"id": 680, "start": 4979.26, "end": 4982.26, "text": "Marmelade ist halt auch easy stell sie drei kleser hin und gut ist"}, {"id": 681, "start": 4983.26, "end": 4984.26, "text": "Wasser"}, {"id": 682, "start": 4985.26, "end": 4987.26, "text": "Warum benutzen manche lehrer noch Overheadprojektoren vor allem wenn direkt"}, {"id": 683, "start": 4988.26, "end": 4990.26, "text": "Weil warum wohl"}, {"id": 684, "start": 4991.26, "end": 5003.26, "text": "Weil boomer lehrer weil sonst ich hätte es nicht für möglich gehalten dass leute 2021 noch in der schule sitzen und lehrer Overheadprojektoren verwenden"}, {"id": 685, "start": 5003.26, "end": 5006.26, "text": "Ich fand die dinger 1998 schon kacke"}, {"id": 686, "start": 5008.26, "end": 5013.26, "text": "Aber zwar über 20 jahre später muss man sich den kram immer noch ergeben"}, {"id": 687, "start": 5015.26, "end": 5018.26, "text": "Da hinter ihnen ein pc mit bima steht ein pc macht nicht geräusche als würde das gleich"}, {"id": 688, "start": 5019.26, "end": 5026.26, "text": "Na bima bima ist ja für die also pc und bima ist ja nur wirklich für die meisten lehrer komplettes teufel zeug ich stelle mir das ähnlich vor"}, {"id": 689, "start": 5026.26, "end": 5038.26, "text": "Bei uns hatten die lehrer damals probleme video recorder zu bedienen dann kam die dann mit dem fernsehwagen um die ecke und da musste immer der schleimer vom dienst vorne zum lehrer hin und dem helfen den video recorder einzuschalten"}, {"id": 690, "start": 5039.26, "end": 5041.26, "text": "Weil die unfähig waren dafür so"}, {"id": 691, "start": 5042.26, "end": 5043.26, "text": "Und"}, {"id": 692, "start": 5044.26, "end": 5046.26, "text": "Heute ist es wahrscheinlich so dass"}, {"id": 693, "start": 5046.26, "end": 5060.26, "text": "Projektor projektor und pc das abgelöst hat und dann auch der schleimer vom dienst vorne hin muss und dem lehrer helfen den film zu starten auf dem pc warum können lehrer eigentlich das was man für ihre tägliche arbeit braucht nicht"}, {"id": 694, "start": 5063.26, "end": 5064.26, "text": "Na ja"}, {"id": 695, "start": 5064.26, "end": 5074.26, "text": "Was dein lehrer hat den aufwärtsprojektor per camera auf teams übertragen oh ja das ist da besonders tolle qualität gewesen dann"}, {"id": 696, "start": 5076.26, "end": 5078.26, "text": "Na gut schulpc sind tatsächlich mulatt"}, {"id": 697, "start": 5078.26, "end": 5085.26, "text": "Man muss das nicht so komisch scharf stellen man kann jedes arbeitsblatt einfach direkt anzeigen das einzige was man machen muss ist den bima einzuschalten"}, {"id": 698, "start": 5086.26, "end": 5087.26, "text": "Oh"}, {"id": 699, "start": 5088.26, "end": 5094.26, "text": "Und wie es für mich war bei solchen lehrern während der online unterrichtszeit mein abitur schulabschluss zu machen das hat er schon erzählt ja"}, {"id": 700, "start": 5095.26, "end": 5096.26, "text": "Die Zeit war wirklich weird"}, {"id": 701, "start": 5097.26, "end": 5098.26, "text": "Weird champ"}, {"id": 702, "start": 5098.26, "end": 5107.26, "text": "Jetzt haben wir uns schon zwei videos von ihm angeguckt das heißt ich kriege jetzt hier die youtube youtube algorithm schlägt schlägt wieder zu"}, {"id": 703, "start": 5114.26, "end": 5123.26, "text": "Was ohne witz unser fernsehen hat damals nicht funktioniert und meine geschichtslehrerin hat ernsthaft gesagt kann man das nicht mit einer pdf verknüpfen"}, {"id": 704, "start": 5123.26, "end": 5127.26, "text": "Ich wüsste bei dieser aussage noch nicht mal was sie eigentlich meint"}, {"id": 705, "start": 5129.26, "end": 5137.26, "text": "Gibt es gibt es eigentlich schulpc die schon abgegradet sind auf windows 10 oder laufen die alle noch mit windows xp"}, {"id": 706, "start": 5138.26, "end": 5140.26, "text": "Windows 3 1 ist es nicht mehr aber"}, {"id": 707, "start": 5140.26, "end": 5152.26, "text": "Die laufen bestimmt alle mit windows xp"}, {"id": 708, "start": 5153.26, "end": 5155.26, "text": "Schon auf vista immerhin"}, {"id": 709, "start": 5158.26, "end": 5166.26, "text": "Ja linux ist auch nicht verkehrt da ganz ehrlich in der schule je nachdem was man braucht ist da eine linux installation gar nicht so blöde drauf"}, {"id": 710, "start": 5166.26, "end": 5172.26, "text": "Wenn man nur also was weiß ich wenn man nur im internet gucken will oder irgendwie die ein oder anderen office dokumente machen will warum nicht"}, {"id": 711, "start": 5172.26, "end": 5178.26, "text": "Eine linux geschichte drauf das muss kein win noch sein was auch den großen vorteil hat du fängst dir nicht irgendeinen scheiß ein"}, {"id": 712, "start": 5180.26, "end": 5183.26, "text": "Ist das nur in deutschland so mit technik ja in kolumbien ist es besser"}, {"id": 713, "start": 5188.26, "end": 5192.26, "text": "Das geht das geht doch sogar noch ich meine kann durchaus schlimmer sein"}, {"id": 714, "start": 5192.26, "end": 5194.26, "text": "Internet explorer"}, {"id": 715, "start": 5196.26, "end": 5204.26, "text": "Also ich weiß noch in der berufsschule in der berufsschule da hat der lehrer so eine eigene remote steuerung software selbst programmiert allein schon das ist eine"}, {"id": 716, "start": 5206.26, "end": 5210.26, "text": "Sehr merkwürdige idee gewesen zumindest war dieses ding"}, {"id": 717, "start": 5211.26, "end": 5214.26, "text": "Etwas verbackt der hatte das war relativ simpel"}, {"id": 718, "start": 5214.26, "end": 5221.26, "text": "Der hatte quasi auf jedem rechner einen agent installiert und vorne hat er halt so ein steuerungs ding gehabt da konnte er auch die bildschirme sperren per knopfdruck"}, {"id": 719, "start": 5222.26, "end": 5229.26, "text": "Aber du konntest ohne problemen diese software beenden nicht weil du rechte dazu hat das das haben sie geschickt gemacht also hat es nicht die rechte die software zu binden aber"}, {"id": 720, "start": 5230.26, "end": 5237.26, "text": "Du konntest einfach in telnet machen telnet localhost port was weiß ich 5050 weil die software auf 5050 lief"}, {"id": 721, "start": 5237.26, "end": 5243.26, "text": "Und dann hast du einfach telnet gemacht auf 5050 und hast irgendeinen random shit reingeschrieben"}, {"id": 722, "start": 5244.26, "end": 5250.26, "text": "Und die software war nicht in der lage random shit zu verarbeiten ist gecrashed und dann konnte er den rechner nicht mal sperren und war immer höchst verwirrt"}, {"id": 723, "start": 5253.26, "end": 5255.26, "text": "Arch by the way ja so ist es"}, {"id": 724, "start": 5255.26, "end": 5264.26, "text": "Wie nicht archlinux warum archlinux ist das einzig wahre da kann man nämlich der ganzen welt erzählen dass man beide bei archlinux by the way verwendet"}, {"id": 725, "start": 5267.26, "end": 5274.26, "text": "Ach cmd ist gesperrt bei den schulrechnern das ist aber schwierig in einer lage"}, {"id": 726, "start": 5274.26, "end": 5284.26, "text": "In einer fachinformatiker ausbildungsklasse weil dann brauchst du manchmal die cmd für dinger"}, {"id": 727, "start": 5287.26, "end": 5293.26, "text": "Archlinux was archlinux ist archlinux ist by the way archlinux das beste linux was es gibt by the way"}, {"id": 728, "start": 5293.26, "end": 5302.26, "text": "Archlinux ist eine linux distribution für absolute hackermans wird nur noch getoppt durch gendu alles selbst kompilieren"}, {"id": 729, "start": 5303.26, "end": 5308.26, "text": "Oder linux vom scratch drei monate bauen und dann nicht am end nicht mehr aktualisieren können"}, {"id": 730, "start": 5310.26, "end": 5314.26, "text": "Also ich glaube archlinux by the way wird bloß nicht mehr aktualisieren"}, {"id": 731, "start": 5314.26, "end": 5322.26, "text": "Also ich glaube archlinux by the way wird bloß noch von gendu selbst kompilieren getoppt"}, {"id": 732, "start": 5324.26, "end": 5329.26, "text": "Ja wir hatten in der berufsschule auch die üblichen geschichten drauf cs dungeon keeper hatten wir noch drauf"}, {"id": 733, "start": 5330.26, "end": 5337.26, "text": "Durfte man zwar offiziell nicht spielen hat man aber trotzdem gemacht das war dann immer so das kann man daran erinnern stunde ist vorbei stunde ist vorbei"}, {"id": 734, "start": 5337.26, "end": 5344.26, "text": "Und man hat gesagt wir sind nicht ganz fertig geworden können wir die pause über hier in dem raum brauche in dem raum bleiben wenn die nächsten kommen gehen wir raus"}, {"id": 735, "start": 5345.26, "end": 5349.26, "text": "Und haben die lehrer eigentlich in der regel immer gesagt ja ja macht ruhig in ruhe fertig ich lasse euch auf"}, {"id": 736, "start": 5350.26, "end": 5356.26, "text": "Und da haben die da sind vorne an den plan haben raufgeguckt okay nächste stunde ist hier ist hier klasse xy drinne"}, {"id": 737, "start": 5357.26, "end": 5359.26, "text": "Und sowieso lehrer passt ok"}, {"id": 738, "start": 5359.26, "end": 5367.26, "text": "Und da haben wir dann quasi zeug gespielt in der pause lehrer hat natürlich gedacht wir mal wobei ganz ehrlich lehrer sind ja auch nicht blöd"}, {"id": 739, "start": 5368.26, "end": 5372.26, "text": "Wir haben gesagt wir wollen das zeug fertig machen dem war klar dass wir irgendwas spielen die sind ja auch nicht dumm"}, {"id": 740, "start": 5373.26, "end": 5375.26, "text": "Die wussten bloß ok"}, {"id": 741, "start": 5376.26, "end": 5380.26, "text": "Hauptsache sie können es offiziell abstreiten dass sie davon wussten"}, {"id": 742, "start": 5380.26, "end": 5387.26, "text": "Die wussten bloß ok das hauptsache sie können es offiziell abstreiten dass sie davon wussten"}, {"id": 743, "start": 5391.26, "end": 5397.26, "text": "Richtig hackermans kompilieren alles selbst das ist stellt euch mal vor soll es richtig krass agent du hacker man"}, {"id": 744, "start": 5397.26, "end": 5403.26, "text": "Ihr bekommt eine mail geschickt mit einem open office dokument im anhang da müsst ihr erst mal fünf stunden open office kompilieren"}, {"id": 745, "start": 5403.26, "end": 5407.26, "text": "Oder chrome leute hat mal jemand ernsthaft von euch chrome selber kompiliert"}, {"id": 746, "start": 5408.26, "end": 5415.26, "text": "Wisst ihr eigentlich wie lang das dauert wie kompliziert das ist und wie viel ram und plattenplatz das braucht"}, {"id": 747, "start": 5416.26, "end": 5420.26, "text": "Du brauchst da irgendwie keine ahnung 60 gigabit nach geht es übertrieben du brauchst da schon"}, {"id": 748, "start": 5421.26, "end": 5427.26, "text": "16 16 g ram 80 80 g festplatte und es läuft trotzdem zwei stunden"}, {"id": 749, "start": 5427.26, "end": 5432.26, "text": "Also chrome selber kompilieren ist glaube ich das schlimmste was man machen kann"}, {"id": 750, "start": 5433.26, "end": 5436.26, "text": "Also wir hatten nur ein lehrer der selbst was gespielt hat"}, {"id": 751, "start": 5436.26, "end": 5458.26, "text": "Und der hat immer während der stunde während die leute was gemacht haben hat er immer world of warcraft forum gesurft vorne am rechner"}, {"id": 752, "start": 5496.26, "end": 5501.26, "text": "Der hat world of warcraft gebrauchst die halbe stunde"}, {"id": 753, "start": 5506.26, "end": 5513.26, "text": "Ja wahrscheinlich reicht es wahrscheinlich reicht es für chrome auch nicht ich habe jetzt einfach mal 16 g gesagt das kannst du knicken"}, {"id": 754, "start": 5513.26, "end": 5517.26, "text": "Hey day auf dem ipad was ist denn hey day"}, {"id": 755, "start": 5518.26, "end": 5520.26, "text": "Irgendein casual casual game oder"}, {"id": 756, "start": 5521.26, "end": 5525.26, "text": "Or farmbild ein farmbild clone oh meine güte"}, {"id": 757, "start": 5528.26, "end": 5530.26, "text": "Der war kurz afk"}, {"id": 758, "start": 5530.26, "end": 5544.26, "text": "Was ist das dachte in overwatch geschichte"}, {"id": 759, "start": 5545.26, "end": 5548.26, "text": "Na ja so was können wir uns als nächstes geben"}, {"id": 760, "start": 5549.26, "end": 5551.26, "text": "Zeigst mal her"}, {"id": 761, "start": 5552.26, "end": 5554.26, "text": "Nochmal eine chance youtube"}, {"id": 762, "start": 5554.26, "end": 5566.26, "text": "Nein kündigung bei ubisoft ja das sind eh so dreck säcke ne ist jetzt super ist eine super geschichte wir kündigen einfach mal eine woche vor weihnachten was ein scheißladen oder"}, {"id": 763, "start": 5568.26, "end": 5575.26, "text": "Ich weiß einfach mal leute vor weihnachten raus wahrscheinlich macht es dann macht sich dann besser im jahresabschluss oder so"}, {"id": 764, "start": 5575.26, "end": 5581.26, "text": "Oder sind die leute selbst weg gerannt ach andersrum die leute sind ihn abgehauen"}, {"id": 765, "start": 5582.26, "end": 5587.26, "text": "Ach sehr noch besser ok dann ist gut dann ist gut in den würde ich wünschen dass alle leute wegrennen"}, {"id": 766, "start": 5588.26, "end": 5590.26, "text": "Alle weg"}, {"id": 767, "start": 5591.26, "end": 5593.26, "text": "Alle weg"}, {"id": 768, "start": 5593.26, "end": 5608.26, "text": "Scheißladen ja die haben sich besser verdient ich hoffe blizzard rennen auch die ganzen leute weg"}, {"id": 769, "start": 5609.26, "end": 5614.26, "text": "Ihr habt ubisoft azubis in der klasse poc was ubisoft hat fisi azubis"}, {"id": 770, "start": 5614.26, "end": 5623.26, "text": "Ok nice warum nicht"}, {"id": 771, "start": 5623.26, "end": 5644.26, "text": "Ja 50 Milliarden lang ist schon huge"}, {"id": 772, "start": 5645.26, "end": 5648.26, "text": "So also was kommt jetzt an was ist das"}, {"id": 773, "start": 5648.26, "end": 5657.26, "text": "Budget storage server 2021 ist das aus dem kokona land"}, {"id": 774, "start": 5658.26, "end": 5663.26, "text": "Wenn es nämlich aus dem kokona land ist dann ist das für uns nicht wirklich übertragbar"}, {"id": 775, "start": 5664.26, "end": 5667.26, "text": "Weil die haben es nicht so mit strompreisen"}, {"id": 776, "start": 5669.26, "end": 5673.26, "text": "Bei den amis sind die strompreise viel billiger"}, {"id": 777, "start": 5673.26, "end": 5690.26, "text": "Ich frage mich immer was die alle machen ich mein 80 terabyte"}, {"id": 778, "start": 5691.26, "end": 5699.26, "text": "Ich nehme ja auch ein bisschen gameplay auf und sowas dass ich was dass ich was habe für für zukünftige videos aber ich wüsste gar nicht"}, {"id": 779, "start": 5699.26, "end": 5705.26, "text": "Wo ich achte wofür ich 80 terabyte für als als content creator für content bräuchte"}, {"id": 780, "start": 5706.26, "end": 5713.26, "text": "Na ja das teure dabei sind ja eh die festplatten"}, {"id": 781, "start": 5713.26, "end": 5728.26, "text": "Bei so einer also bei so einer kapazität sind das teure die festplatten und die festplatten kosten gleich viel ob ich sie jetzt in den zynology reinpacke oder ob ich die jetzt in"}, {"id": 782, "start": 5728.26, "end": 5741.26, "text": "Keine ahnung meine bei ebay gekaufte 2h e-kiste mache 80 terabyte wenn man davon ausgeht der nimmt 10 terabyte platten das sind 18 terabyte platten das kostet 4000 euro die platten so über den daumen gepeilt"}, {"id": 783, "start": 5741.26, "end": 5761.26, "text": "Ungefähr 4000 euro für die platten muss ausgeben da macht der macht das preis für so ein einsteiger zynology oder irgendwie macht der da auch nicht so fett"}, {"id": 784, "start": 5761.26, "end": 5773.26, "text": "sind das 80 terabyte ohne redundanz oder backups das ist die frage keine ahnung wenn das 80 terabyte nach irgendwelchen rate geschichten sind braucht er ja noch viel mehr platten müssen wir uns angucken keine ahnung"}, {"id": 785, "start": 5773.26, "end": 5790.26, "text": "Keine ahnung das problem ist dass die platten so teuer sind genau genau das ist das problem"}, {"id": 786, "start": 5790.26, "end": 5818.26, "text": "Okay 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 okay wie ich gesagt habe 8 terabyte mal 10 oder halt ne ich habe gesagt 8 mal 10 und er hat 10 mal 8 aber das ist trotzdem das kostet wahrscheinlich trotzdem irgendwie 4000 pro ne ne ne wobei 8 ich glaube 8 8 terabyte sind günstiger"}, {"id": 787, "start": 5818.26, "end": 5844.26, "text": "günstiger oh was okay 200 euro oh ein paar amazon"}, {"id": 788, "start": 5844.26, "end": 5861.26, "text": "180 euro also 180 mal 8 ne ach mal 10 ja das ist gut das muss ich dann rechnen also ungefähr 2000 euro für platten was kostet eine 18 t platte 18 tb"}, {"id": 789, "start": 5861.26, "end": 5885.26, "text": "das ist richtig günstig geworden warum ist das denn so günstig amazon ich habe meine ich habe vor zwei jahren oder so eine 12 terabyte platte gekauft und die hat glaube ich noch 400 euro gekostet oder so"}, {"id": 790, "start": 5885.26, "end": 5911.26, "text": "sack orders das ist rausch liegt am handy z gate glaube ich war das noch z gate z gate 10 tb ne das ist die falsche was haben wir sonst noch anstatt z gate haben wir noch wd ne wd stopp wd habe ich gekauft nicht ed alter autocorrekt autocorrekt auf dem handy wd"}, {"id": 791, "start": 5911.26, "end": 5936.26, "text": "wd interne platte ne dies von 2000 disc disc alter warum ist die suche bei amazon eigentlich so scheiße dass du nichts findest fest platte hier 10 tb"}, {"id": 792, "start": 5936.26, "end": 5960.26, "text": "es ist aber die falsche ich habe 12 tb aber hier sind aber 10 10 10 tb die hat die hat schon gekostet oder details 2017 hat die 400 euro gekostet 400 euro für eine 10 tb platte das ist tatsächlich relativ günstig geworden"}, {"id": 793, "start": 5960.26, "end": 5974.26, "text": "durchaus in ordnung das das das geht ja direkt gucken wir mal geizhals kurz"}, {"id": 794, "start": 5974.26, "end": 5998.26, "text": "es gibt schon 20 terabyte es gibt sogar schon 20 t massive was ist die größte festplatte die es aktuell gibt 96 ja aber guck mal 447 ach ne moment"}, {"id": 795, "start": 5998.26, "end": 6022.26, "text": "ein bisschen laut die musik lull warum ist das doch"}, {"id": 796, "start": 6022.26, "end": 6042.26, "text": "hä hier hard drives so gucken wir mal ok 20 ah da sind wir schon in anderen preisregionen ok ok das sind 24 euro pro terabyte und wie sieht es aus bei den"}, {"id": 797, "start": 6042.26, "end": 6067.26, "text": "18 auf viel viel günstiger alter pok champ so jetzt machen wir das mal raus und jetzt sortieren wir mal alles nach preis preis pro terabyte ok die günstigsten sind anscheinend wirklich"}, {"id": 798, "start": 6067.26, "end": 6092.26, "text": "die günstigsten sind anscheinend wirklich 14 14 terabyte 18 ne mit mit einer der günstigsten sind die hier guck mal 18 terabyte sind die mit dieser fake plattenüberlagerungsmagnetechnik oder ist das normal mit mehr platten drinne"}, {"id": 799, "start": 6092.26, "end": 6119.26, "text": "exos enterprise ja das ist eigentlich gar nicht schlecht ich meine mal ernsthaft 300 euro das ist das ist durchaus ok"}, {"id": 800, "start": 6119.26, "end": 6140.26, "text": "equipper hat schon mal jemand bei equipper bestellt a mine factory nur 309 euro ich bin ich bin geneigt mir da sogar eine zu bestellen"}, {"id": 801, "start": 6140.26, "end": 6161.26, "text": "ja nice egal gucken wir das video mal weiter also aber auch was man hier sieht trotzdem die festplattenpreise sind wahrscheinlich das entscheidende"}, {"id": 802, "start": 6161.26, "end": 6185.26, "text": "relativ gut das ding braucht wahrscheinlich massig strom weil es relativ alte server hat wer von ebay ist"}, {"id": 803, "start": 6185.26, "end": 6200.26, "text": "was hast du den shitstorm wegen dem neuen arch lilux wiki layout bekommen ne schauen wir mal wie ist denn das neue layout"}, {"id": 804, "start": 6200.26, "end": 6215.26, "text": "ist das ist das schmaler geworden im vergleich zu sonst ansonsten sieht das doch mehr oder weniger noch exakt so aus wie vorher"}, {"id": 805, "start": 6215.26, "end": 6231.26, "text": "außer dass es glaube ich ein bisschen schmaler ist dann sieht man es eh besser mit boomeraugen und schon hat man die ganze seite wieder ausgefüllt"}, {"id": 806, "start": 6231.26, "end": 6245.26, "text": "man hätte einfach gucken können wenn die geräte groß sind dann macht man das breiter das ist halt das ist halt das ding wenn man mobile first"}, {"id": 807, "start": 6246.26, "end": 6253.26, "text": "macht heißt ja nicht dass man desktop last machen muss man kann ja mobile first und desktop first machen es gibt ja media queries"}, {"id": 808, "start": 6253.26, "end": 6260.26, "text": "kannst du einfach sagen wenn gerät größer ist als also man braucht ja diesen diesen mist gar nicht so zu machen das ist auf dem fetten desktop"}, {"id": 809, "start": 6261.26, "end": 6270.26, "text": "weil es gibt ja mal ehrlich gesagt es gibt ja überhaupt keinen grund warum auf dem desktop das nur die hälfte des bildschirms verwenden sollte"}, {"id": 810, "start": 6271.26, "end": 6281.26, "text": "einfach ein media query gemacht und gesagt hey bildschirm ab einer gewissen größe einfach das hier größer machen ich meine so schwer kann das ja nicht sein"}, {"id": 811, "start": 6281.26, "end": 6303.26, "text": "page main content main content so wo stehts hier max width 80 so schwer wäre das jetzt da nicht eine media query zu machen was das hier macht oder"}, {"id": 812, "start": 6303.26, "end": 6311.26, "text": "oder oder oder sah das jetzt super komplex aus das zu implementieren"}, {"id": 813, "start": 6311.26, "end": 6315.26, "text": "HI"}, {"id": 814, "start": 6316.26, "end": 6328.26, "text": "ich könnte sogar noch weiter gehen und sagen 100 prozent das geht nicht ok jetzt habe ich jetzt habe ich geprägt"}, {"id": 815, "start": 6328.26, "end": 6329.26, "text": "Jetzt hab ich's geprägt."}, {"id": 816, "start": 6329.26, "end": 6339.5, "text": "Nee, aber ihr wisst, ihr seht, was ich meine, also an sich, an sich gar kein Problem."}, {"id": 817, "start": 6339.5, "end": 6348.18, "text": "Okay, jetzt wird's durch was anderes limitiert, aber es wär kein Ding gewesen, sowas einzubauen,"}, {"id": 818, "start": 6348.18, "end": 6362.38, "text": "wirklich nett."}, {"id": 819, "start": 6362.38, "end": 6367.98, "text": "Die Seite ist besser lesbar, wenn sie schmal ist, naja, also da kann man sich jetzt wirklich"}, {"id": 820, "start": 6367.98, "end": 6372.54, "text": "drüber streiten, also ich wüsste jetzt nicht, wo das Sinn sein sollte, zu sagen, hey, du"}, {"id": 821, "start": 6372.54, "end": 6378.54, "text": "hast zwar einen fetten Bildschirm, aber wir benutzen nur die Hälfte."}, {"id": 822, "start": 6378.54, "end": 6387.26, "text": "So, gucken wir, gucken wir doch mal, ob das stimmt, ob das schlechter, wir gucken jetzt"}, {"id": 823, "start": 6387.26, "end": 6397.98, "text": "mal, ob das stimmt, ob das schlechter lesbar ist, wenn ich das jetzt überscale, 100, nee,"}, {"id": 824, "start": 6397.98, "end": 6408.62, "text": "ich bin falsch, oder, so, guck mal, ungefähr so sah das vorher aus, ungefähr so sah das"}, {"id": 825, "start": 6408.62, "end": 6416.62, "text": "vorher aus, und weiter ist das jetzt so viel schlechter lesbar, außer dass man seinen"}, {"id": 826, "start": 6416.62, "end": 6420.66, "text": "kompletten Monitor verwendet, und mal ganz davon abgesehen, man könnte ja durchaus"}, {"id": 827, "start": 6420.66, "end": 6427.94, "text": "irgendeinen Toggle einbauen dafür, ja, das ist ja für Hacker-Mans, für Casual-User ist"}, {"id": 828, "start": 6427.94, "end": 6434.9, "text": "das ja nicht gemacht hier, also da kann mir jetzt keiner erzählen, dass das hier superschwer"}, {"id": 829, "start": 6434.9, "end": 6435.9, "text": "zu lesen wär."}, {"id": 830, "start": 6435.9, "end": 6453.26, "text": "Ungefähr so sah das ja früher aus, und wo, wo, wo gibt es da jetzt den Arch-Wiki,"}, {"id": 831, "start": 6453.26, "end": 6475.98, "text": "und wo gab es dann den Shitstorm dazu, Arch-Wiki-Shit-Shitstorm, das findet man nichts dazu, wahrscheinlich"}, {"id": 832, "start": 6475.98, "end": 6484.98, "text": "auf Reddit, oder, wahrscheinlich auf Reddit, so, guck mal mal weiter, Budget-Storage-Server."}, {"id": 833, "start": 6484.98, "end": 6514.34, "text": "Gen-Bro, die China-Chinesen-Pros, was ist drinne, Säck, Säck, Säck, Säck, Säck,"}, {"id": 834, "start": 6514.34, "end": 6521.54, "text": "Säck, Säck, DDR3 ist schon eine ganze Ecke älter, die Kiste also, Xeon Quad Core sagt"}, {"id": 835, "start": 6521.54, "end": 6531.18, "text": "ja mal gar nichts aus, kann ja alles sein, maximal 8G, also ist auf jeden Fall, ist auf"}, {"id": 836, "start": 6531.18, "end": 6539.58, "text": "jeden Fall, oder E3, okay, das ist in die Desktop Xeons gewesen, das ist 6-7 Jahre"}, {"id": 837, "start": 6539.58, "end": 6562.54, "text": "alte Hardware, die verbrauchen auch ein bisschen mehr Strom noch, wir brauchen einen China-Keks,"}, {"id": 838, "start": 6562.54, "end": 6572.34, "text": "das stimmt, wir brauchen einen China-Keks, ein China-Chinesen-Keks, ja, das brauchen wir"}, {"id": 839, "start": 6572.34, "end": 6573.34, "text": "wirklich."}, {"id": 840, "start": 6573.34, "end": 6599.18, "text": "Ja, das ist von 2000, 2014, oder so, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja,"}, {"id": 841, "start": 6599.18, "end": 6609.8, "text": "ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja."}, {"id": 842, "start": 6609.8, "end": 6627.72, "text": "Ja, natürlich sind die Dinger schwer, das ist halt auch ein Kupferblock, aber, das ist"}, {"id": 843, "start": 6627.72, "end": 6633.88, "text": "normal ins surfer hardware die kriegen ja auch die luft so durchgezogen oder ich weiß jetzt nicht"}, {"id": 844, "start": 6633.88, "end": 6638.8, "text": "wo vorne und wo hinten ist wahrscheinlich ist wahrscheinlich ist das hier das hier vorne und"}, {"id": 845, "start": 6638.8, "end": 6646.06, "text": "das hier hinten wird so durchgezogen quasi ist ja immer so all of its airflow from the 40 millimeter"}, {"id": 846, "start": 6646.06, "end": 6651.24, "text": "fans place towards the middle of the case also der threat wenn ich wenn ich schon die den titel"}, {"id": 847, "start": 6651.24, "end": 6655.96, "text": "lese das sind wieder ultra viele geträgerte linux fanboys dabei sehe ich jetzt schon in plastic"}, {"id": 848, "start": 6655.96, "end": 6661.08, "text": "shroud that ensures three of the fans blow directly onto the heat sink and ram the motherboard the"}, {"id": 849, "start": 6661.08, "end": 6667.72, "text": "system uses is on the lga 1155 platt der gute alte vga port der darf bei server natürlich nicht"}, {"id": 850, "start": 6667.72, "end": 6672.48, "text": "fehlen und ihr werdet lachen so gut wie jeder server der im rechenzentrum steht heutzutage"}, {"id": 851, "start": 6672.48, "end": 6680.52, "text": "hat immer noch einen vga port wobei wobei ich sagen muss so ganz stimmt es nicht ich war mit"}, {"id": 852, "start": 6680.52, "end": 6690.16, "text": "phoenix vor noch nicht allzu langer zeit im rz unsere neuen dellkisten haben glaube ich neben"}, {"id": 853, "start": 6690.16, "end": 6701.16, "text": "vga auch display port aber vga geht halt einfach company called tyan it is for ram slots a bunch"}, {"id": 854, "start": 6701.16, "end": 6706.08, "text": "of pcie slots which aren't that important because of the systems when you form factor but would be"}, {"id": 855, "start": 6706.08, "end": 6712.48, "text": "good in a more standard thickness case the io on this board is for usb2 ports dual gigabit ethernet"}, {"id": 856, "start": 6712.48, "end": 6720.76, "text": "management an ipmi port vga serial and a uid led button this isn't great for a normal system but"}, {"id": 857, "start": 6720.76, "end": 6725.48, "text": "for a server this selection of ports is fine the real feature of this board that makes it perfect"}, {"id": 858, "start": 6725.48, "end": 6731.76, "text": "for this use case is the 14 yes 14 built-in sata ports this allows all 12 of the main drives to"}, {"id": 859, "start": 6731.76, "end": 6739.36, "text": "play directly into the list ja wisst ihr was ich daran doof finde es ist kein hot swap das heißt du"}, {"id": 860, "start": 6739.36, "end": 6743.2, "text": "musst auf jeden fall selbst tracken wo was angeschlossen ist das heißt du musst dir die"}, {"id": 861, "start": 6743.2, "end": 6750.28, "text": "seriennummern sollten notieren wo was angeschlossen ist also welche platte welcher seriennummer"}, {"id": 862, "start": 6750.28, "end": 6759.56, "text": "entspricht musst du eh machen und du musst es halt aufmachen und und also wenn du da jetzt"}, {"id": 863, "start": 6759.56, "end": 6765.48, "text": "kein rack hast mit schienen wo du easy rausziehen kannst vom platz her aufklappen kannst und die"}, {"id": 864, "start": 6765.48, "end": 6770.36, "text": "einzelne platte raus machen ist das dann auch nicht so schön dann lieber ganz ehrlich dann"}, {"id": 865, "start": 6770.36, "end": 6777.28, "text": "lieber eine 2he kiste wo du die nämlich hochkant reinstecken kannst die platten und dann kannst du"}, {"id": 866, "start": 6777.28, "end": 6806.64, "text": "die platten hochkant reinstecken und bekommst es auch in ein gehäuse und kannst hot swapen"}, {"id": 867, "start": 6806.64, "end": 6833.28, "text": "das bringt überhaupt nichts weil das was da dran steht heißt ja noch lange nicht dass das im"}, {"id": 868, "start": 6833.28, "end": 6839.88, "text": "system auch sda 1 wird oder sowas das ist das einzige was du machen kannst ist du musst"}, {"id": 869, "start": 6839.88, "end": 6845.88, "text": "dir einmalig aufschreiben also wenn du kein kein gehäuse hast was das unterstützt mit"}, {"id": 870, "start": 6845.88, "end": 6852.48, "text": "management kabel und led anzeige welche festplatte das ist das einzige was du machen kannst ist"}, {"id": 871, "start": 6852.48, "end": 6864.56, "text": "ausgabe unter linux machen die weiß zu ordnung zu seriennummern jetzt also port zu seriennummer und"}, {"id": 872, "start": 6864.56, "end": 6870.0, "text": "dann am besten noch ein aufkleber drauf machen was was ist dass du es wie dass du es findest"}, {"id": 873, "start": 6870.0, "end": 6881.84, "text": "linux sagt ja nicht linux sagt ja nicht hier die dritte platte von vorne ist ausgefallen oder so da"}, {"id": 874, "start": 6881.84, "end": 6887.88, "text": "sagt ihr entweder sd sdb oder stc oder was auch immer ist ausgefallen oder halt im zweifelsfall"}, {"id": 875, "start": 6887.88, "end": 6894.48, "text": "def bei serial bla bla bla ist ausgefallen schön und gut aber dann musst du es halt immer noch"}, {"id": 876, "start": 6894.48, "end": 6902.08, "text": "suchen welche welche das ist und ich glaube da hat keiner bock dann mit der lupe und der lampe"}, {"id": 877, "start": 6902.08, "end": 6908.52, "text": "hinzugehen und drauf zu leuchten was hat es denn jetzt für eine seriennummer gehabt also sortierung"}, {"id": 878, "start": 6908.52, "end": 6913.96, "text": "im gehäuse spiegelt sich nicht zwangsläufig wieder in sortierung in intern wie linux die"}, {"id": 879, "start": 6913.96, "end": 6924.16, "text": "platten erkennt und das ding würde gar nicht in meinen rack reinpassen weil es"}, {"id": 880, "start": 6924.16, "end": 6928.76, "text": "glaubt wahrscheinlich 80 zentimeter oder so ist oder das dürfte fast schon ein meter sein also"}, {"id": 881, "start": 6928.76, "end": 6934.6, "text": "aber 80 zentimeter so eine komplette bautiefe die passt immer mini rack gar nicht rein mein"}, {"id": 882, "start": 6934.6, "end": 6939.44, "text": "rack ist ja bloß glaubt 40 zentimeter tief pack considering how much hardware can fit in it"}, {"id": 883, "start": 6939.44, "end": 6944.72, "text": "with the server picked out and received i could start figuring out and ordering other parts for a"}, {"id": 884, "start": 6944.72, "end": 6950.72, "text": "system like this you ideally want ecc memory but unfortunately this doesn't really memory"}, {"id": 885, "start": 6950.72, "end": 6955.92, "text": "because of this i hopped onto ebay looking for a ram kit that would fit my needs and budget what i"}, {"id": 886, "start": 6955.92, "end": 6961.88, "text": "ended up getting was four four gigabytes sticks of crucial unbuffered ddr3 ram running at 1066"}, {"id": 887, "start": 6961.88, "end": 6967.72, "text": "megahertz these four sticks cost a total of around 43 dollars which is an okay deal for unbuffered"}, {"id": 888, "start": 6967.72, "end": 6973.4, "text": "ecc ram 16 gigabytes is an adequate amount especially for the configuration i ended up"}, {"id": 889, "start": 6973.4, "end": 6978.68, "text": "with and luckily they installed and worked flawlessly in this system with ram picked out all that was"}, {"id": 890, "start": 6978.68, "end": 6983.44, "text": "left to do was purchase drives i did a bunch of thinking and planning to get drives and was"}, {"id": 891, "start": 6983.44, "end": 6988.48, "text": "waiting for good deals on higher capacity it's jetzt werden wieder die extern platten ge wie"}, {"id": 892, "start": 6988.48, "end": 6996.04, "text": "heißt das geschackt wie lade sich das wenn man das wenn man das wenn man das raus rippt"}, {"id": 893, "start": 6996.04, "end": 7002.64, "text": "aus so ein extern geschackt ist das glaube ich wenn die hdd ist geschackt"}, {"id": 894, "start": 7002.64, "end": 7010.24, "text": "also es war mal eine zeit lang so dass die festplatten in solchen externen"}, {"id": 895, "start": 7010.24, "end": 7015.68, "text": "gehäusen wenn du die ausgebaut hast die platten die drinne waren dass es billiger war sich so ein"}, {"id": 896, "start": 7015.68, "end": 7021.96, "text": "externes gehäuse zu kaufen als die platte selbst die drives but with the looming possibility of a"}, {"id": 897, "start": 7021.96, "end": 7027.4, "text": "drive shortage due to chia mining i eventually decide to pull the trigger on 10 8 terabyte"}, {"id": 898, "start": 7027.4, "end": 7032.72, "text": "extern seagate drives see normally you would buy stand-alone drives but believe it or not it's"}, {"id": 899, "start": 7032.72, "end": 7037.6, "text": "cheaper to buy the external version ja sagte ja ist immer noch so wobei ich jetzt gelesen habe"}, {"id": 900, "start": 7037.6, "end": 7041.16, "text": "dass viele hersteller da gar nicht mehr normale sata platten drinne haben"}, {"id": 901, "start": 7044.32, "end": 7049.8, "text": "und take the drives out of them this practice is known as shocking ja sag ich doch wenn geschackt"}, {"id": 902, "start": 7049.8, "end": 7057.12, "text": "werden sie within the data hoarding community again i originally wanted to get something like 12 or 14"}, {"id": 903, "start": 7057.12, "end": 7062.52, "text": "terabyte drives but i couldn't find a good enough deal so again purchase 10 8 terabyte drives an"}, {"id": 904, "start": 7062.52, "end": 7067.6, "text": "average of a hundred twenty five dollars each this totals to twelve hundred fifty dollars spent on"}, {"id": 905, "start": 7067.6, "end": 7073.68, "text": "mechanical drives for the array i also purchased a 500 gigabyte sata ssd to be used as a cash drive"}, {"id": 906, "start": 7073.68, "end": 7079.56, "text": "this is the mx 500 which is a good quality sata drive and i'll be explaining more details about"}, {"id": 907, "start": 7079.56, "end": 7085.36, "text": "using it as a cash drive later in the video with all the drives in hand i could begin shocking opening"}, {"id": 908, "start": 7085.36, "end": 7089.72, "text": "up the packaging on one of these drives i found that was heißt das eigentlich direkt übersetzt"}, {"id": 909, "start": 7089.72, "end": 7104.96, "text": "schack ging deutsch entleeren ah also quasi ok verstehe"}, {"id": 910, "start": 7104.96, "end": 7112.64, "text": "i've itself some paperwork a usb cable and a power cable i start by taking the drives out of their"}, {"id": 911, "start": 7112.64, "end": 7118.28, "text": "packaging and plugging them in to ensure they powered on and reported normal functionality once"}, {"id": 912, "start": 7118.28, "end": 7123.44, "text": "this was done i could begin opening them up one thing to note is that taking the drives out of"}, {"id": 913, "start": 7123.44, "end": 7127.84, "text": "the casings does void the warranty but these drives are much cheaper than their standalone"}, {"id": 914, "start": 7127.84, "end": 7132.72, "text": "counterparts so you have to decide for yourself if the cost saving is worth it or not to get into"}, {"id": 915, "start": 7132.72, "end": 7137.84, "text": "these enclosures you need to start by wedging something super thin which is not the stuff"}, {"id": 916, "start": 7137.84, "end": 7147.48, "text": "in dem fall tatsächlich auch mal nicht außer acht lassen die chancen bei wie viel hat er jetzt zehn"}, {"id": 917, "start": 7147.48, "end": 7155.04, "text": "zehn platten dass das ist aber so in den ersten eins zwei jahren mal eine kaputt geht ist nicht"}, {"id": 918, "start": 7155.04, "end": 7161.08, "text": "so unrealistisch und umso mehr platten man hat umso sinniger finde ich sich dass tatsächlich"}, {"id": 919, "start": 7161.08, "end": 7167.48, "text": "das normale ding vom hersteller zu kaufen weil die tauschen das ja bis zu fünf jahren oder bis"}, {"id": 920, "start": 7167.48, "end": 7181.96, "text": "zu zehn jahre teilweise noch um die gefährlich aus mit dem cutter wir wissen aber schon dass"}, {"id": 921, "start": 7181.96, "end": 7186.4, "text": "er sich nicht schneidet weil sonst könnte youtube das video nicht sonst könnte das video nicht"}, {"id": 922, "start": 7186.4, "end": 7202.56, "text": "hochladen weil selbst verletzten ist ja nicht erlaubt auf youtube dann bleibt die garantie"}, {"id": 923, "start": 7202.56, "end": 7207.64, "text": "erhalten dass es gut gut zu wissen guck mal da hat der gleichen fehler gemacht wie ich der hat"}, {"id": 924, "start": 7207.64, "end": 7216.72, "text": "sein i fix it spachtel schon zu oft in ritzen geschoben die nicht richtig aufzumachen ging"}, {"id": 925, "start": 7216.72, "end": 7222.28, "text": "und hat verbogen erinnert sich noch einer wo ich den wo ich wo ich den spachtel an der steckdose"}, {"id": 926, "start": 7222.28, "end": 7238.28, "text": "komplett verbogen habe musstest du mal eine platte umtauschen ja schon mehrfach"}, {"id": 927, "start": 7238.28, "end": 7243.12, "text": "von teuren sachen die rechnung ich muss dir ehrlich sagen ich glaube mich hat noch nicht"}, {"id": 928, "start": 7243.12, "end": 7248.4, "text": "ein festplatten hersteller wirklich nach der rechnung gefragt dann musst du seriennummer"}, {"id": 929, "start": 7248.4, "end": 7263.16, "text": "eingeben und auf geht's ich bin mir nicht mehr sicher aber nachdem ich fast nur wd und sie"}, {"id": 930, "start": 7263.16, "end": 7268.36, "text": "geld habe wird es wahrscheinlich auch ich glaube wd wd wd cream musste ich ein paar umtauschen"}, {"id": 931, "start": 7268.36, "end": 7273.84, "text": "wd cream waren das 2 terabyte wd cream musste ich einige mal umtauschen da habe ich bestimmt"}, {"id": 932, "start": 7273.84, "end": 7283.84, "text": "45 umgetauscht über ein paar jahre also behältst du auch den teuren sachen die rechnung nö weil"}, {"id": 933, "start": 7283.84, "end": 7287.68, "text": "ich bestell die sachen online zweifel zwei kann ich bei amazon die rechnung einfach ausdrucken"}, {"id": 934, "start": 7291.04, "end": 7293.64, "text": "ich bestell fast nur noch online also"}, {"id": 935, "start": 7296.88, "end": 7301.2, "text": "ich glaube ich habe letzten jahre über nichts offline gekauft wo ich eine rechnung hätte aufheben"}, {"id": 936, "start": 7301.2, "end": 7313.36, "text": "müssen also ich vermute mal nicht dass sie das prüfen ich bin mir nicht mal so ganz sicher also"}, {"id": 937, "start": 7313.36, "end": 7321.0, "text": "ich glaube das war folgendermaßen du gehst bei wd komando wd return hard drive guck mal probier"}, {"id": 938, "start": 7321.0, "end": 7341.16, "text": "es doch mal aus return policy wd check drive failure product also immer"}, {"id": 939, "start": 7341.16, "end": 7349.56, "text": "ich bin unfähig das zu finden jetzt"}, {"id": 940, "start": 7354.76, "end": 7358.84, "text": "ich bin immer noch nicht mal sicher ob ich die überhaupt zurück schicken musste die"}, {"id": 941, "start": 7358.84, "end": 7366.68, "text": "ein doch die muss ich zurück schicken ich glaube nicht dass die wirklich prüfen ob"}, {"id": 942, "start": 7366.68, "end": 7372.68, "text": "das kaputt ist vielleicht wenn du jetzt so notorischer zurückschicker bist"}, {"id": 943, "start": 7375.24, "end": 7379.16, "text": "ich habe mal eine frage du hast ja ein bisschen mehr mit den lux zu tun ich habe für ein"}, {"id": 944, "start": 7379.16, "end": 7384.68, "text": "abschlussprojekt bei der ihk ein nassserver mit 32 gigabyte ram nun ist meine frage ist es richtig"}, {"id": 945, "start": 7384.68, "end": 7392.84, "text": "wenn man ab 16 g nur noch 8 g swap hat also bei 32 g nur 16 g als swap oder ist das wie alle sagen"}, {"id": 946, "start": 7392.84, "end": 7397.28, "text": "das doppelte das grundsystem mit dem das musst du dir überlegen ich habe mittlerweile gar kein"}, {"id": 947, "start": 7397.28, "end": 7404.44, "text": "swap mehr also ich habe bei meinen linux kisten die haben 16 gigabyte ram ich habe gar kein swap mehr"}, {"id": 948, "start": 7411.44, "end": 7420.56, "text": "ob man das ob man das machen sollte keine ahnung aber es funktioniert auf jeden fall aber"}, {"id": 949, "start": 7420.56, "end": 7427.84, "text": "letztendlich kommt ja drauf an wartet mal letztendlich kommt ja darauf an was du erwartest"}, {"id": 950, "start": 7427.84, "end": 7433.52, "text": "was du mit dem system machst ich glaube so eine so eine pauschale regel mit doppeltem ram ist"}, {"id": 951, "start": 7433.52, "end": 7439.16, "text": "bei einer großen ram anzahl irgendwie unsinnig ich meine du bräuchte es ja dann quasi stelle"}, {"id": 952, "start": 7439.16, "end": 7446.92, "text": "mal vor du hast 128 g ram dann bräuchte es ja eine extra ssd für swap ja und wenn du"}, {"id": 953, "start": 7446.92, "end": 7452.76, "text": "und wenn du 16 g ram hast ist die frage ob ich 8 g swap noch retten also was was also wenn man"}, {"id": 954, "start": 7452.76, "end": 7459.68, "text": "auf nummer sicher gehen will würde ich wahrscheinlich bei 16 g ram noch mal 16 g swap machen und bei 32"}, {"id": 955, "start": 7459.68, "end": 7465.88, "text": "32 g würde ich wahrscheinlich auch noch mal irgendwie 16 g ja finde ich finde ich finde ich"}, {"id": 956, "start": 7465.88, "end": 7477.28, "text": "sinnig ganz ehrlich aber ich würde es wahrscheinlich komplett ohne swap betreiben ab 16 g ram"}, {"id": 957, "start": 7477.28, "end": 7483.36, "text": "wenn es ein ssd ist hast du mehr wo du speichern kannst drauf und 16 g ram musst du ja auch"}, {"id": 958, "start": 7483.36, "end": 7488.08, "text": "erstmal voll kriegen das ist gar nicht mal so einfach außer mit fünf elektronen anwendung"}, {"id": 959, "start": 7488.08, "end": 7498.84, "text": "und ein paar chrome tabs was ist swap das ist quasi auslagerungsdatei unter windows"}, {"id": 960, "start": 7508.24, "end": 7513.08, "text": "braucht man eine swap datei für hibernate ich dachte das kann der anderweitige speichern"}, {"id": 961, "start": 7513.08, "end": 7523.44, "text": "ne oder ach keine ahnung ich habe schon so lange keine liegungskiste mal hibernate iphone"}, {"id": 962, "start": 7523.44, "end": 7524.56, "text": "habe ich auch online gekauft"}, {"id": 963, "start": 7530.76, "end": 7535.16, "text": "bei den server würde ich nicht hibernate deswegen sage ich ja ich habe schon ewig keine liegungskiste"}, {"id": 964, "start": 7535.16, "end": 7543.24, "text": "mal hibernate ok weil meine vms hibernate ich nicht da nehme ich die vmw Geschichte zum zum post"}, {"id": 965, "start": 7543.24, "end": 7545.48, "text": "champen und server werden nicht hibernate"}, {"id": 966, "start": 7552.0, "end": 7557.48, "text": "das board das little board ist just a saturday usb adapter and i may save these to use in the"}, {"id": 967, "start": 7557.48, "end": 7562.64, "text": "future with one drive done i then had to repeat the process nine more times and here's a little"}, {"id": 968, "start": 7562.64, "end": 7571.64, "text": "timelapse of me doing it wird geschockt geschackt wird der master schacker schacking intensifies"}, {"id": 969, "start": 7571.64, "end": 7579.24, "text": "so with all the drives out i was ready to mount them now when shucking external drives you never"}, {"id": 970, "start": 7579.24, "end": 7584.68, "text": "really know what you're gonna get most of the why benutzt du ein iphone und x android mäßiges ok"}, {"id": 971, "start": 7584.68, "end": 7588.32, "text": "da kann ich jetzt wieder die aus dem weg geringverdienerkarte ziehen ich habe"}, {"id": 972, "start": 7588.32, "end": 7593.04, "text": "mittlerweile 13 geräte bei mir daheim und ungefähr die hälfte davon ist android"}, {"id": 973, "start": 7593.04, "end": 7599.28, "text": "the seagate external drives use iron wolf nas or even exos drives which are super high quality"}, {"id": 974, "start": 7599.28, "end": 7604.44, "text": "and one of the reasons i originally wanted to go for the larger capacity ones inside of these"}, {"id": 975, "start": 7604.44, "end": 7609.56, "text": "eight terabyte external drives were 10 seagate barracuda compute ones these are model number"}, {"id": 976, "start": 7609.56, "end": 7616.56, "text": "st8000 dm 004 and i got these for about thirty dollars less per drive compared to buying these"}, {"id": 977, "start": 7616.56, "end": 7621.72, "text": "stand alone that's what i saved around three and get geschockt schocken schocken lohnt sich"}, {"id": 978, "start": 7621.72, "end": 7628.72, "text": "dollars buying as external ones this is when i came to a very important realization these are"}, {"id": 979, "start": 7628.72, "end": 7634.84, "text": "actually smr drives smr or shingle magnetic recording is an inferior and outdated design"}, {"id": 980, "start": 7634.84, "end": 7640.08, "text": "which is very unideal for certain use cases but with them all shocked i had to proceed with"}, {"id": 981, "start": 7640.08, "end": 7644.88, "text": "the shagged and in the end it worked out fine for my use case which i'll explain in a minute to"}, {"id": 982, "start": 7644.88, "end": 7649.12, "text": "mount these i needed a few things that didn't come with the case i needed these little rubber"}, {"id": 983, "start": 7649.12, "end": 7654.64, "text": "gaskets that i got off of amazon and some 630 second bolts that i got from my local hardware"}, {"id": 984, "start": 7654.64, "end": 7659.4, "text": "store the gasket slips over the bolt that one is secured into each of the four bottom mounting"}, {"id": 985, "start": 7659.4, "end": 7665.64, "text": "holes on the drive i installed four into each meaning 40 once again with anti-vibrations nipple"}, {"id": 986, "start": 7665.64, "end": 7671.84, "text": "40 gaskets the first one was brought to mount number one the sata data and power was plugged in"}, {"id": 987, "start": 7671.84, "end": 7677.32, "text": "it was lowered down and then slid back to secure all four gaskets into place with the first one"}, {"id": 988, "start": 7677.32, "end": 7682.12, "text": "done all i had to do was install the other nine drives one at a time into mounts two through ten"}, {"id": 989, "start": 7682.12, "end": 7686.88, "text": "with that completed the last component i had to install was the cash drive which is in mount"}, {"id": 990, "start": 7686.88, "end": 7691.36, "text": "11 and currently not secured but i will probably mount it with some double-sided tape in the"}, {"id": 991, "start": 7691.36, "end": 7696.48, "text": "future with that done i needed to decide what kind of os and file system i'd be using with this i"}, {"id": 992, "start": 7696.48, "end": 7702.48, "text": "originally debated between true nascore with a zfs raid z2 file system but because of the way"}, {"id": 993, "start": 7702.48, "end": 7708.76, "text": "zfs stripes data across the array shows that smr drives would not be good to use in that kind of"}, {"id": 994, "start": 7708.76, "end": 7718.0, "text": "ja kann ich mir vorstellen dass das warum will er denn zfs machen wenn er kein kein rate gedöns macht"}, {"id": 995, "start": 7721.52, "end": 7725.68, "text": "weil es hat durchaus auch so vorteil aber ich glaube nicht dass er die braucht ja ich glaube"}, {"id": 996, "start": 7725.68, "end": 7731.48, "text": "der will keine snapshots machen und keine off-site zfs backups und und sonstige dinger"}, {"id": 997, "start": 7733.8, "end": 7735.68, "text": "mal gucken was er einstellt schauen wir mal"}, {"id": 998, "start": 7738.36, "end": 7742.28, "text": "er will ja kein rate machen glaube ich zumindest deswegen verstehe ich noch"}, {"id": 999, "start": 7742.28, "end": 7744.36, "text": "weniger was er mit mit zfs hat"}, {"id": 1000, "start": 7744.36, "end": 7750.44, "text": "set up this made the choice to use unrate much easier now unrate is paid software but it's"}, {"id": 1001, "start": 7750.44, "end": 7754.6, "text": "unrate warum stehen die alle so auf unrate ich verstehe es nicht"}, {"id": 1002, "start": 7754.6, "end": 7761.16, "text": "alternative to raid or zfs ich muss mit leute wir gucken uns das wir gucken uns das mal an"}, {"id": 1003, "start": 7761.16, "end": 7769.84, "text": "streben ideen unrate wir gucken uns das mal in einem stream an was was haben die alle nur mit"}, {"id": 1004, "start": 7769.84, "end": 7787.44, "text": "unrate das was ich bisher davon gesehen habe hat mich so null überzeugt moment die geek freaks das"}, {"id": 1005, "start": 7787.44, "end": 7794.6, "text": "ist doch der das ist doch das ist doch dieser channel auf youtube mit dem wir optimieren"}, {"id": 1006, "start": 7794.6, "end": 7807.12, "text": "windows auf 15 mb runter und sowas ach nee das ist hier hochgeladen download"}, {"id": 1007, "start": 7811.64, "end": 7814.0, "text": "kann man das wenigstens ausprobieren ohne lizenz"}, {"id": 1008, "start": 7814.0, "end": 7820.72, "text": "basic"}, {"id": 1009, "start": 7826.84, "end": 7831.4, "text": "ich es hat mich bisher überhaupt nicht geschockt aber ich würde es für den stream mal ausprobieren"}, {"id": 1010, "start": 7831.4, "end": 7848.24, "text": "ja 90 tage ok machen wir"}, {"id": 1011, "start": 7848.24, "end": 7865.92, "text": "ja aber aber du kriegst auch keine performance boost genau aber"}, {"id": 1012, "start": 7865.92, "end": 7883.36, "text": "der heim erinnert noch und"}, {"id": 1013, "start": 7883.36, "end": 7888.06, "text": "zu dem Erreifungsgerät. Für mich ist das toll, weil es eine Menge archivales Stauern bedeutet,"}, {"id": 1014, "start": 7888.06, "end": 7891.96, "text": "das reliable und mit einer hohen Anwendung sein sollte, aber der langsame Geschwindigkeit bedeutet,"}, {"id": 1015, "start": 7891.96, "end": 7896.96, "text": "dass das Editing direkt vom Erreifungsgerät nicht möglich ist, was wiederum gut für mich ist."}, {"id": 1016, "start": 7896.96, "end": 7901.46, "text": "Setzten Unrate ist sehr einfach und ich habe einen Guide von Juan M. Tech verfolgt,"}, {"id": 1017, "start": 7901.46, "end": 7904.46, "text": "der eine tolle Arbeit auf Erklärung der Basis des Setzes gemacht hat."}, {"id": 1018, "start": 7904.46, "end": 7914.46, "text": "Ich habe gar kein ZFS mehr am Start, ich hatte ja die, kennt ihr ja, habe ich euch ja letztens"}, {"id": 1019, "start": 7914.46, "end": 7931.96, "text": "im Video gesehen hier, Server Raum, Server Raum, da liegt er, da liegt die alte 4 HE-Kiste."}, {"id": 1020, "start": 7931.96, "end": 7942.46, "text": "Mit, das hatte ZFS-Rate drauf, das war eine richtig fette Kiste für damals 8 Kerne Xeon,"}, {"id": 1021, "start": 7942.46, "end": 7950.46, "text": "ich glaube 48G RAM und sonst was, das war ein richtig fettes Ding, sogar mit Lüfter-Mod hier."}, {"id": 1022, "start": 7950.46, "end": 7965.46, "text": "Und das habe ich mittlerweile alles rausgeschmissen zugunsten einer Low-Power-Intel-Kiste."}, {"id": 1023, "start": 7965.46, "end": 7977.96, "text": "Hastest du schon mal einen Stream über Ansible gemacht?"}, {"id": 1024, "start": 7977.96, "end": 7984.46, "text": "Ja, wir verwenden Ansible öfters hier im Stream und wir haben auch mal zusammen komplett"}, {"id": 1025, "start": 7984.46, "end": 8002.96, "text": "gelernt und Files from scratch erstellt."}, {"id": 1026, "start": 8002.96, "end": 8007.96, "text": "Wie funktioniert das? Wie funktioniert das bei Android und USB? Startet das immer von"}, {"id": 1027, "start": 8007.96, "end": 8015.96, "text": "USB und schreibt das restliche Betriebssystem in RAM oder wie ist das? Sodass es weiterläuft,"}, {"id": 1028, "start": 8015.96, "end": 8033.96, "text": "wenn ein USB abkackt. Ja, ja das ist sinnvoll. Ja, ich habe nicht zugehört. Und wenn man"}, {"id": 1029, "start": 8033.96, "end": 8039.96, "text": "Settings speichern will, muss man wahrscheinlich explizit sagen, ja ich will jetzt USB schreiben,"}, {"id": 1030, "start": 8039.96, "end": 8045.96, "text": "wahrscheinlich. Die Streams gibt es archiviert, ja. Die Streams gibt es übrigens archiviert auch,"}, {"id": 1031, "start": 8045.96, "end": 8051.96, "text": "mach mal Ausrufezeichen Archiv, ich weiß nicht, ob das schon geupdatet wurde. Oder was? Archiv?"}, {"id": 1032, "start": 8051.96, "end": 8073.96, "text": "Ach so Archiv. Ja, also es ist noch nicht alles hochgeladen. Es gibt jetzt einen VOD-Channel,"}, {"id": 1033, "start": 8073.96, "end": 8100.96, "text": "wo findige Mods die ganzen alten VODs hochladen von mir. Aktuell gibt es noch einen Google Drive."}, {"id": 1034, "start": 8100.96, "end": 8104.96, "text": "Ach guck mal, es gibt schon, alter, guck mal die Mods sind mal richtig, richtig advanced,"}, {"id": 1035, "start": 8104.96, "end": 8116.96, "text": "guckt euch das mal an. Kürzliches Streams. Gibt sogar, gibt sogar hier Übersicht, Jahresansicht,"}, {"id": 1036, "start": 8116.96, "end": 8125.96, "text": "kürzlich Stats, richtig advanceder Shit, den wir hier langsam haben. Also auf den YouTube-Channel"}, {"id": 1037, "start": 8125.96, "end": 8131.96, "text": "kommen alle VODs, den betreibe nicht ich und ist auch nicht verlinkt mit meinem YouTube-Account,"}, {"id": 1038, "start": 8131.96, "end": 8149.96, "text": "weil falls Strike wegen Musik im Hintergrund oder so. Und aktuell gibt es, die TXT-Suche geht noch,"}, {"id": 1039, "start": 8149.96, "end": 8176.96, "text": "gibt es einen Google Drive, wo man gucken kann."}, {"id": 1040, "start": 8176.96, "end": 8184.96, "text": "Hat jemand schon mal versucht, ob man das mit Ubuntu auch gut hinbekommt? Ubuntu booten von USB"}, {"id": 1041, "start": 8184.96, "end": 8195.96, "text": "und quasi dann RAM, komplett im RAM laufen lassen, read only. Da muss man bestimmt ein bisschen"}, {"id": 1042, "start": 8195.96, "end": 8215.96, "text": "selbst von Hand wurschteln, bis das funktioniert. Ja, das probieren wir demnächst auch mal aus."}, {"id": 1043, "start": 8215.96, "end": 8219.96, "text": "Wie gesagt, mich hat das bisher nicht überzeugt, aber wir probieren das mal für den Stream aus,"}, {"id": 1044, "start": 8219.96, "end": 8225.96, "text": "mal wirklich komplett live, mal ausprobieren. Vielleicht machen wir es sogar auf einer echten"}, {"id": 1045, "start": 8225.96, "end": 8254.96, "text": "Hardware-Kiste, weil ich habe ja meine 4HE-Kiste hier noch rumstehen."}, {"id": 1046, "start": 8254.96, "end": 8274.96, "text": "Okay, sind 60 TI am Ende noch übrig. Leute, sind es jetzt TBbyte oder TBbyte oder Terabyte oder"}, {"id": 1047, "start": 8274.96, "end": 8284.96, "text": "oder was ist das jetzt? Also das sind auf jeden Fall in bytes. So, aber ich kann es mir einfach"}, {"id": 1048, "start": 8284.96, "end": 8305.96, "text": "nicht merken. Also TBbytes sind 1024 oder wie ist das?"}, {"id": 1049, "start": 8344.96, "end": 8359.96, "text": "Okay, wie sieht es mit Stromverbrauch aus? Das ist das, was mich eigentlich interessieren würde."}, {"id": 1050, "start": 8359.96, "end": 8373.96, "text": "Hat er irgendwas zum Thema Stromverbrauch gesagt? Das zieht schon ein bisschen was. Also ich denke,"}, {"id": 1051, "start": 8373.96, "end": 8387.96, "text": "das könnte durchaus 200 Watt Eidl ziehen. Auf was würdet ihr so tippen? 200 Watt Eidl?"}, {"id": 1052, "start": 8387.96, "end": 8394.96, "text": "Ich denke, es kommt wahrscheinlich ganz gut hin. Hast du einen Pop-Schutz auf deinem Mikrofon?"}, {"id": 1053, "start": 8394.96, "end": 8399.96, "text": "Ja, auf dem normalen schon, auf dem Headset nicht. Auf dem Headset ist halt das ganz normale Teil"}, {"id": 1054, "start": 8399.96, "end": 8406.96, "text": "drauf. Ja, ja klar ist bei ihm der Strom billiger. Das ist ja das Ding. Bei uns in Deutschland ist"}, {"id": 1055, "start": 8406.96, "end": 8429.96, "text": "Strom allübelst teuer. Und ich muss aufs Klo. 50 Watt Eidl. Nee, das braucht auf jeden Fall mehr"}, {"id": 1056, "start": 8429.96, "end": 8438.96, "text": "als 50 Watt Eidl. Okay, wenn alle Festplatten im Sleep sind vielleicht, wenn alle Festplatten im Sleep"}, {"id": 1057, "start": 8438.96, "end": 8462.96, "text": "sind, der Rest gar nichts macht vielleicht. Leute, ich muss aufs Klo. Ich gehe jetzt off."}, {"id": 1058, "start": 8462.96, "end": 8472.96, "text": "Vielleicht mache ich nachher nochmal streamen. Vielleicht mache ich nachher nochmal streamen"}, {"id": 1059, "start": 8472.96, "end": 8477.96, "text": "und wir basteln ein bisschen, muss ich mal gucken. Schön, dass ihr dabei gewesen seid."}, {"id": 1060, "start": 8477.96, "end": 8480.96, "text": "Heute ein bisschen kürzerer Aufwachstream, weil wir jetzt drei Tage in Folge gestreamt."}, {"id": 1061, "start": 8480.96, "end": 8493.96, "text": "Gestern insgesamt über sechs Stunden. Reicht. Bis denn. Macht's gut. Wir sehen uns Leute. See you."}]}