{"text": "Das war's für heute.Vielen Dank für's Zuschauen.Bis zum nächsten Mal.Das war's für heute.Das war's für heute.Bis zum nächsten Mal.Das war's für heute.Bis zum ersten Mal.Igitt.Dass war's für heute.Bis zum nächsten Mal.Dass war's für heute.Bis zum zweiten Mal.Bis zum bleiben.Bis zum strategies.algorithm feelManagementDesignSo Leute, ich hab gedacht wir machen heute mal einen außer der Reihe eingeschobenenAufwachstream.Aber ich weiß nicht wie lang genau.Mal gucken.Es ist relativ früh.Das heißt es geht ja wahrscheinlich jetzt schon noch ein bisschen.Aber ich kann jetzt nicht den halben Tag streamen, sondern auch wenn heute Feiertag ist.So ich muss erstmal kurz was trinken.Wir sind noch voll gefuttert von gestern.Ich hab ja gestern Abend massig Sushi gefuttert und Zeug.Ich musste heute Nacht um 3 aufs Klo.Das ist voll draus.Ich hab die Katze komplett verwirrt.So nach dem Motto was macht der Kerl um 3 Uhr nachts auf dem Klo.Die hat danach keine Ruhe gegeben.Die war alle 5 Minuten an der Tür und hat gesagt jetzt mach auf.Es ist aufstehen hier.Komm.Moin Michael 50 spiel hier an.So kurz noch mal meinen Tee leertrinken.Dann gucken wir uns ein bisschen was an.Eigentlich ist es noch zu früh zum aufwachen.Du hast Werbung.Nein da bringt es Subscriber, mein Subscriber ist natürlich immer gut, aber das bringtdir auch nix.Oder?Oder sieht man keine Werbung mehr auf Channels wo man subscribt hat.Das Kamillentee, nix ausgefallenes heute.Richtig Pfeifer, 25 Monate Hyper Subscription hier.Oder besser gesagt, Regen, noch nix, mit Subscription hat man keine Werbung tatsächlich.Aha, siehst du mal wusste ich gar nicht, zählt das auch für Prime Subscription?Es ist eh so, Prime Subscription war eines der besten Ideen überhaupt, die sie auf Twitcheingeführt haben.Ich glaube dadurch haben sich die Subscriberzahlen nicht nur verdoppelt, sondern teilweise verdreifachtbei manchen Leuten, GIF Emotes sind auch top, GIF Emotes sind Poggers, da kann man nämlichzum Beispiel dann sowas machen wie, was haben wir denn hier für GIFs, zum Beispiel dasAdressen unser.Was empfiehlt uns YouTube denn heute Schönes?Clownfield 2042, Prepare your wallets, ja das haben wir schon gesehen auf Steam.Von der Grafik her sieht es aus, als hätten die Crunker Leute ein Battlefield gemacht.Nas 2.0, was macht er da mit Nas 1.0? Kommt es in Müll? Du meinst das hier? Ja das gucken wir uns auch noch an.Wisst ihr was ich nicht verstehe? Die haben doch gesagt, oder was heißt die? Der Creator vonBattlefield Friends, die haben doch großartig angekündigt vor Battlefield 2042, so nach demMotto Battlefield Friends Return. Und bisher ist es einfach nur ein Rerun der alten Staffel.Also gibt es jetzt gar kein neues Battlefield Friends mehr? Oder wie ist das? Ich könnte esihm nicht verübeln, zu sagen nach dem Kack-Launch, Scheiß drauf. Aber ich frag mich halt was geplant war.Du hast dir 4x12TB gekauft, weißt gar nicht was du damit machen sollst. Ja, Linux ISUS LAN, genau,Torrent, Torrent Linux ISUS. Was anderes macht man über Torrent ja auch nicht. Alternativ kannst duauch Sicherheitskopien speichern.Ich habe auch letztens ein PC am Straßenrand gefunden, da hätte ich auch ein Video darübermachen müssen. Du glaubst nicht was als nächstes geschieht. Einsamer PC am Straßenrand. Du glaubstnicht was als nächstes geschieht. Gone wrong, gone sexual. Irgendwie sowas in der Richtung. Aberich habe es einfach stehen lassen, weil ich keinen Dreck mit heimnehmen wollte.Das war noch IDE-Festplatten drin. Das haben wir doch. Das gucken wir uns an. Das ist die umgedrehteVariante, die wir zu dem was wir vorhin gesehen haben. Aber ich glaube nicht, dass der Motor inder Lage ist das zu spinnen. Groter Pfeil mit Thumbnail. Ja, natürlich, natürlich. Das mussschon sein. Die Leute haben einfach keine Ahnung. Die schmeißen ihre PCs weg. Vielleicht legen sievorher noch ihren Ordner in Papierkorb oder so und sagen jetzt ist alles gelöscht. Jetzt kann das,jetzt kann das. Niemand wieder her. Was habe ich da jetzt eigentlich gelöscht? Andu. Wagtes nicht normalerweise, ob man das in Papierkorb schieben will? Windows, oh, oh. Ich habe dasMeme-Board gelöscht, Leute. Das sollte ich vielleicht besser, das sollte ich vielleicht besser dalassen.Fastest First Person Drone View. Excellent. Okay, das sieht nicht sonderlich spektakulär aus.Seht ihr mal, wenn es wirklich schnell gehen muss, ohne Lack, was machen sie? Analoge VideoÜbertragung Old School. Low res analoges Video. Da wird nichts encoded. Da wird nichts irgendwie 60FPS, 4K, voll HD. Da wird analog Video gemacht. So muss das sein. Ey, das dieses hat, das könnteaus irgendeinem billigen Game sein. Moment, Moment, was ist mit denen los? Habt ihr es gesehen? DieAnzeige ist in Meter. Wo kommen wir dann dahin? Warum ist die Anzeige nicht in Feed oder inOunces oder in Miles? Warum Meter? Vielleicht sind es auch Miles. Man weiß ja nicht, M.Ja, die Amis haben doch so komische Einheiten. Warum auch immer noch die das haben? Ich weißnicht, so genau. What's on my home server? Oder Wolfgang erklärt uns das jetzt. So ein Video sollteich auch machen. Das kommt, glaube ich, gut an. Das ist eine gute Idee. Was ist auf meinemHome Server? Da mach ich ein Video zu. Länge in Ounces messen, das ist kein Problem. Bei den Amis geht das.Ist doch wieder irgendwas zusammengeschnitten ist, oder? Muss er nicht ins Gefängnis oder was istdenn da jetzt eigentlich rausgekommen? Anspannung vor Weihnachten. Ich habe keine VR Filmchen. Ichhabe generell auf meiner Platte quasi Backups liegen und sonst fast nichts. Und die Backupsmache ich nicht mal richtig regelmäßig, aber ich bin froh, dass ich sie habe. Ich mache meistensBackups, wenn ich irgendwas Wichtiges gemacht habe und mir denke, so okay, jetzt wird es malZeit. Jetzt, jetzt könntest du mal wieder ein Backup machen. Stirb langsam eins. Gab es dasgestern mal wieder? Finde ich es immer noch nice. 3D Druckerempfehlung. Kommt auf den Preis an.Wenn der Preis egal ist, dann kauft ihr einen von denen. Die sind richtig nice, aber teuer. Moment,das Dark Reader macht es kaputt. Oh, meine Augen, Alter. Die Dinger sind halt richtig nice vondem, aber ein bisschen teuer. Die Dinger sind ganz gut, aber teuer. Ansonsten gibt es auchganz viele Möglichkeiten. Aber ich bin nicht mehr so richtig drin, was diese 3D DruckerSachen angeht. Ich habe mir vor einer Weile ja auch ein i3 Mega S gekauft, aber der istjetzt auch schon alt, den würde ich mir jetzt wahrscheinlich nicht mehr kaufen. Aber seitdemhabe ich mich nicht mehr mit beschäftigt. Wenn ich etwas ausdrucken muss, drücke ichetwas aus und ansonsten nicht. Wer hätte das gedacht? Das ist auch nicht so, dass manden so oft braucht. Also ich habe gedacht, ich benutze den 3D Drucker weniger als ichgedacht habe vor dem Kauf des 3D Druckers, dass ich ihn benutzen würde. Wo soll ich dennwissen, was du willst? Keine Ahnung. Musst du wissen, was du trocken willst. K.E.5 Schrott.Im Home Office mehr benutzen. Das habe ich nie miteinander in Verbindung gebracht. Alsoich drücke ab und zu Gehäuse für irgendwelche Bastelgeschichten mit dem 3D Drucker. Ganzganz selten mal irgendwelche Teile, die man sonst nicht bekommt. Ich habe beispielsweiseein Sieb gedruckt für unsere Regenrinne, weil die nicht so Standard ist vom Durchmesserher. Da habe ich etwas ausgemessen und ausgedruckt, dass nicht so viel Dreck durchschlüpft, aberdas kommt nicht oft vor. Das kann man auch machen. 3D Drucker hat halt den Vorteil, dassdu auch etwas komplexere Sachen relativ schnell ausdrucken kannst, wenn du nicht gerade derProbe bist, was Holz- und Metallbearbeitung angeht. 3D Drucken kann halt jeder. Und esgeht meist wahrscheinlich sogar schneller. Und man muss sagen, 3D Drucker, wenn die richtigeingestellt sind, ist das Zeug echt präzise. Wichtig ist beim 3D Drucker, dass man denersten Layer richtig einstellt. Also, dass die erste Schicht gut ist, sonst reißt esab. Oder es stimmt von der Höhe nicht richtig, es passt am Ende nicht richtig. Der ersteLayer ist fast das wichtigste, was es gibt beim 3D Drucker. Wie ihr habt keine CNC-Maschinezu Hause, da gibt es doch immer diese Videos. Da haben wir schon ein paar geguckt, so nachdem Motto, das ist ja nicht nur eine CNC, von Aliexpress, so cheap CNC-Laser-Graviererund Dings von Aliexpress. Und das ist dann meistens sehr abenteuerlich. So nach demMotto, Laser-Gravierer ohne jegliche Schutzausrüstung oder so, einfach mal falsch reingeguckt undAugen weg gelasert. Aber es ist halt Aliexpress-Standards, ja. Was haben die meisten drinne? Die habenam meisten einen CNC-Aufsatz, Laser-Gravierer-Aufsatz und irgendwie cutten kannst du damit auchnoch oder so, keine Ahnung. Eigentlich ziemlicher Schrott von Aliexpress, aber gut. Zumal diemeisten Leute sich das mit Laser-Gravierer wahrscheinlich so ähnlich vorstellen wiebei 3D Druckern, dass man das total oft verwendet. Aber man verwendet das irgendwie wenn es hochkommteinmal im Monat oder so. So Leute, was gucken wir uns jetzt an? What's on my home-Server?Ne, das ist jetzt, wir gucken uns jetzt, ich schieb mir mal einen Bom-Bom ins Hals, inGachi-Base und dann gucken wir uns mal das LEGO-Video an. Fock. So, Zeitmaier. Requested LEGO-Experiments.Now do one to Google and see how fast it spins. Ja, das dachte ich mir. Das dachte ich mir,dass es der Motor nicht drehen kann. Das ist das erste was ich gesagt habe, dass er eswirklich drehen kann. Zumal das ja noch nichtmal die fertige Übersetzung ist. Die fertige Übersetzungist ja sonst wie riesig. Ja. What happens if you open the jar while spinning? MonkaS, waspassiert? Was, was bin ich sehend? Dass sich der Reifen vom Rad löst oder was? Ja, gut.Das klappt aber wahrscheinlich auch nur, wenn das relativ elastisch ist und das hier, dashalt relativ elastisch ist und sich nach außen drückt. Dann ist dann halt ein bisschen, alsoes dreht sich schnell, dann drückt es das nach außen und dann hast du halt hier, weiles elastisch ist, hast du ein bisschen Luft dazwischen. Moment, ich dachte das geht jetztum diese Geschichte hier am Anfang. Ne, gehts nicht. Jebaited, Alter! Dachte er zeigt unsjetzt wie hier Massive Huge Übersetzung angesagt ist. Richtig jebaited. Weil gerade einer sagtSpeedrun, wir können uns jetzt angucken. Das ist ja auch ein leicht misleading Intro-Bild.How Speedrunners Warp Straight Up to the Moon in Majora's Mask. Können wir uns jetzt angucken.Da müssen wir bescheiden. Viertelstunde. Bam. Oh, das ist viel zu leise.Die Majora's Mask Speedruns waren ja an sich nie sonderlich geschwind, weil du musstestimmer halb durch das Game durch. Huge Graphics. Huge N64 Graphics. Das ist laut genug. Ichhatte übelst übelst Schiss, wie ich klein war bei Majora's Mask. Kann das sein, dassdas N64, fällt mir jetzt gerade so im Nachhinein auf, kann das sein, dass das mit N64 die einzigePlattform ist, die jemals zwei Haupt-Zelda-Titel bekommen hat? Also, der Super Nintendo hatnur A Link to the Past bekommen. Der N64 hat Ocarina of Time und Majora's Mask bekommen.Der Gamecube hat nur, und das ist auch ziemlich am Ende seiner, ne, der Gamecube, ja. Ja,das zählt natürlich. Der Gamecube, der hatte ganz am Anfang Wind Waker und am Ende seinerLeiter hatte er noch Twilight Princess gekriegt. Und die Wii hatte Twilight Princess und danntatsächlich Skyward Sword. Ne, stimmt nicht, was ich gesagt habe. Was hatte denn die WiiU? Ah, die Wii U hat noch, hat noch Dings bekommen. Breath of the Wild zum Schluss,ne. Ne, dann stimmt das nicht. Aber wie gesagt, ich hatte ja damals das Glück, ich hatteein N64, ich musste mir dafür extra so einen Memory Pack, weil man ist sicher, wie dasDing hieß. Ich glaub, da hatte der N64 entweder 4 oder 8 MB RAM danach. Dann konnte ich Majora'sMask spielen und da war ich nicht darauf vorbereitet nach Ocarina of Time. Ich mein, Ocarina ofTime hat den kleinen Max auch schon ziemlich geschockt, aber Majora's Mask hat mich echtfertig gemacht. Egal. Ja, das hat mir schon, wie ich klein war, überhaupt nicht gefallen,dass es einen Timer in dem Spiel gab. Das hat mich immer nervös gemacht. Zumal es eineziemlich coole Mechanik hatte, das war eines der ersten Games, also zumindest, die mirso einfallen, wo die ganzen NPCs wirklich einen Tagesablauf hatten. Gut, das war natürlichhier alles hardcoded für jeden einzelnen NPC und was wie wo passiert anhand der Ingame-Zeit,aber das war schon wirklich cool. Du konntest ja auch nicht alle Quests überall erledigenund sowas, also das war schon nice, aber trotzdem, das hat mich immer so psychisch voll unterDruck gesetzt, dass es einen Timer gab. Das hat mir nicht gefallen. Und ich muss euchehrlich sagen, auch wenn mir wahrscheinlich Majora's Mask bis heute am besten gefälltvon allen Zelda-Spielen, die es gibt, ist das immer noch was, ich sehe, dass das notwendigwar für das Game, aber es ist immer noch etwas, was ich nicht vollkommen überzeugtfinde. Egal, gucken wir mal hier weiter. Ja, die waren relativ schnell, äh, nicht relativ,die waren relativ langsam, die Majora's Mask-Speedruns. Ich mein, Ocarina of Time ist jetzt runterauf was? 17 Minuten oder so? Nee, Quatsch, die haben ja mittlerweile den Credit Warp-Klitsch.5 Minuten oder so? Was ist das? Wobei, dieses Credit Warps-Ding ist halt komplett sinnlos,aber dann spielst du das Game halt gar nicht mehr. Ja, 6 Minuten 49. Das sackt halt irgendwie.Ich weiß nicht, ob mal jemand von euch so in den Ocarina of Time-Speedruns geguckt hatmit diesem Credit Warp-Klitsch. Credit Warp-Klitsch, das ist richtig dumm. Du rennst einfach nurdurchs Dorf, machst ein paar Aktionen, um Speicherbereiche zu überschreiben und dannklitschst du am Ende bei dieser Piranha-Pflanze oder was das ist? Nee, das ist Mario beidieser, was da aus dem Boden kommt, klitschst du durch die Wand und bist in den Credits.Das ist irgendwie langweilig. Da find ich die anderen Kategorien tatsächlich spannender.Okay, jetzt gucken wir mal ins Video.Das klingt auch wieder nach irgendwelchen Memory-Leak-Geschichten.Das ist bestimmt eklig.Hyper Extended Superslide, Obvious, alles klar.Easy, easy!Alles klar. Easy! Easy!In Spanien, die Pandemie,Orn SAS kids.Oder in D WARFMATIM.Geht es dir gleich also mit They Set!Jetzt wording,Ja, soasing,Zelfettationsgagen,Anfulu,Neukr personellLeerenavais,Stand- area,Ir Course,Ocarina of Time ist und ja die Engine unten drunter mehr oder weniger die gleiche ist und auch viele Glitches ähnlich sindDa wird mich nix wundernDa muss ich gar nichts mehr bei den Sorten spielenAttitudes muss man sagen n64 sind glaube ich mit die kaputtesten die es gibt guckt euch mario 64 ocarina of time andas hat mehrere gründe denke ich war erstens weil es einer der ersten 3d spiele waren in diesemprofil experimentiert werden muss auch und weil die spiele haltsaumäßig beliebt und bekannt sind und auseinander genommen wurden ohne endeWenn es 3ds remake hat es ein paar verrückte Glitches die nicht so nahe waren als die originalverrücktewenig wusste jeder ein team von Glitch-Hunters war silenzig im Hintergrund für eine weile jetzt und sie haben etwas gefundenIn august 2019 hat fash eine weite access zu dem debug menüAha, das ist ein verletzter von der wahl der spieler ist ein item aus dem spieler in der inventorieAuch die Td. Remains die vorherige bewegung der DüngeObwohl das ist okay. Okay. Ich weiß jetzt schon was passiertDie manipulieren halt in game diese den memory bereich wo drin steht wie viele bosser gekillt wurdenOkay, das ist glaube ichDann wird das game wahrscheinlich genauso langweilig wieDas credit credit swap ding in ocarina of time ich finde speedruns langweiligWurde das game nicht mal gespielt, aber die members für something absolutely game breaking to be foundThis is not what they were hoping forControversy ensued where some felt that the glitch shouldn't be allowed stating that using the debug menu runs counter to everything speed running is aboutAccessing the menu was mind numbing requiring runners to play the song of storing 70 times in a row taking 12 minutesDefinitely faster than beating all the dungeons, but replaced exciting and skillful gameplay with boring menuingGenau, das ist doch felt that since it was accessible in the game without cheats. It had to be allowed. HoweverAccessible might have been a strong word considering that the menu crashes on n64Ich frage mich, wie sie das wieder rausgefunden haben. Ich meine wer spielt im richtigen Abstand71 mal das gleiche lied auf der flöteWas ist denn mit?Was ist denn mit den beiden wieder los?Doesn't exist on gamecube and it's impossible on wii vc leaving the japanese wii u virtual console as the only optionNot only was this a version that most people didn't own but it also suffered from horrible input delaySo things were still bleak for the Majora's mask community until october of that same yearFirst, let's go back in 2016 Majora's mask speed on her full-grown gaming was doing a 100% run when this happenedDude, speaking of squash. He should be getting back from his exam pretty soon. I thinkWhat what what what whatHey, was hat er denn für was hat er denn für schmerzen dass da gerade eine tür gespornet ist oder was?Die türYeah, his boat just shot a door instead of an arrowOddly enough weird things like this happen to many players and were documented as early as 2009But when unexplained man kann doch mal so eine tür verschießen es ist problemlich oktober 10 2019Glitches and stuff posted an ocarina time video that demonstrated throwing a boomerang at a skulltula token in the forest templeBy adjusting the camera while exiting and reentering the room a door was flying through the air stuck to the boomerangThis unassuming trick quickly became known as stale reference manipulation or SRMI just got any deeper into the history. I'll need to explain our SRM works. It's a bit tricky and honestly pretty intimidatingBut I'll simplify it as much as I canThe programming concept that SRM exploits is called a pointerLike the name suggests a pointer directs to the memory location of something relevant to the game at that momentTelling it where the data it's looking for can be foundAny programmer trying to manage pointers will tell you that they could be quite easy to mess up asIt turns out even Nintendo's professional developers fall victim to themNintendo professional developers, wenn man sich anguckt was die gerade in den letzten jahren so produziert habenWundert mich nix gut aber das ist ja schon 20 jahr herThere's a few ways that pointers can be misused, but here's a relevant exampleImagine having a pointer to someplace in memory if the data associated with that pointer is no longer at that memory locationAnd some other data is there instead the pointer should be resetSo information isn't being written to the incorrect spot in memoryBut if the pointer isn't reset and is still being used then information will be written over whatever happens to be thereAt its core. This is what SRM is doing. Ich bin ich da das ist schon. Das ist schon zuDas ist zu früh am tach da blicke ich nicht durch bei der erklärung versteht irgendjemand was er meint?Abusing a dangling pointer or a stale reference to manipulate a memory location to write data where it shouldn't beGlitches and stuff confirm this with that boomerang videoWhen you throw the boomerang it attaches to an item and brings it back to youIt does this by creating a pointer between the boomerang and that object so the XYZ position of the boomerang will be copied to thememory of the object in questionThis creates the illusion that both objects are traveling togetherThat pointer exists as long as the boomerang is loaded and by keeping the boomerang activeBut unloading whatever picked up glitches and stuff prevented the game from resetting the pointer nowwasEs ist zu früh dass ich blicke nicht durch egal big brain timeIf the game uses that memory location for some other dataThe boomerang will modify that data as it believes that the object it's carrying is still in that memory locationSo glitches just began salivating at the possibilities. Well, how broken could this really be?Could you give yourself any item in the game?Es sind N64 zellnerdinger, die sind eh schon broken as fuck. Set flags to complete quests? No problemWhat about warp to inaccessible locations?A community member nameOh, it's Vash againVash theorized that you could use SRM to make owl statues even more useful. In Majora's MaskThere are 10 owl statues spread across the worldThey're mostly used to warp between areas and save your progressEach owl statue has its own ID number ranging from zero to nineWhen loading, ich weiß nicht schon was am Ende passiertThe game saves the statuesDie überschreiben den den counter wie viele dungeons du geklärt hast beziehungsweise wie viele bosser du gekillt hast und dann kannst du wahrscheinlich direktAm Anfang wenn du auf den Mond kommst gleich das Spiel beenden 100 pro so wird es seinAlong with its ID number. If a statue's ID number happens to be higher than nineIt starts to behave in strange and unintended waysBy using SRM you could change any value you wantSo Vash's goal was to get the southern swamp statue to have an ID value of 14Ich will zu big brain spick da nicht durch muss mit dem ende angucken. Jetzt wird es noch abgedrehtOkay, wisst ihr was wir kürzen es jetzt einfach wir gucken jetzt einfachWir gucken jetzt einfach wo der record ist und dann wissen wir bescheidUnrestricted 18 minuten easyDazu kann ich nur sagenJa kein problem, okay jetzt wissen wir bescheid und das video zu gucken alles klar perfekt was gibt es als nächstesDas ist das war mir zu zu big brain time für so frühL. E. D cube showing your cpu status sechs minuten. Jawa ich wollte schon immer eine led panel mir anzeigen lassen wie heiß meine cpu istdeutsches VideoDieser chat ist jetzt deutschIch wollte einen 2 haben.Letztes Jahr hatte ich den Ehren eine Sitzung auf der 36. Chaos-Kommunikation auf der anderen Seite zu geben.Diese beeindruckenden Teile, besonders wenn man sie in der Hand hält und die Bilder reagieren auf den Tilt der Kugel.Also wollte ich einen 2 bauen.Die Frage ist halt, was ist der Vorteil von einem Würfel mit LEDs, der mir anzeigt, wie warm meine CPU ist,anstatt einfach ein Overlay auf dem Display zu haben, wo drauf steht, wie warm meine CPU ist.Ich meine, es sieht cooler aus. Das ist aber auch das einzig Sinnvolle, oder?Weil es geht.Ich skippe mal einfach mal kurz. Das ist doch ein 3D-Render, oder?Ich meine, es sieht optisch wirklich cool aus, daneben erstmal das Fritz-Phone am Start.Es sieht optisch schon cool aus.Es ist zwar reichlich unsinnig, aber es sieht optisch cool aus.Vor allem auch irgendwie diese......Ding, was auch immer das sein soll. Dieser Faden da drin. Das sieht schon cool aus.Aber ich würde es mir nicht auf den Schreibtisch stellen, allein schon, weil mein Schreibtisch eh immer voll liegt mit allem möglichem Zeug.Und dann wäre er noch voller. Aha. Exzellent, exzellent.Jetzt wissen wir mal Bescheid. Also, wenn wir mal nicht wissen, wie warm unsere CPU ist, dann stellen wir uns einen Würfel daneben.So, gucken wir uns mal an, was Maurice zu sagen hat zu 2021.Also, ich wette mit euch, es ist Battlefield dabei. Das muss sein. Es ist Battlefield dabei.Es ist Maurice. Das heißt, es ist auf jeden Fall......ehm......Blizzard Fails dabei.Das soll überlegen. Was könnte es denn noch sein? Es ist auf jeden Fall Battlefield und Blizzard Fails dabei.GTA. GTA ist wahrscheinlich auch dabei. Das war ja auch ein Riesenaufschrei dieses Jahr.Mal gucken.Battlefield. Ja.Platz 1 ist bestimmt äh......Battlefield.Ja, auch dieses Jahr gibt es hier wieder amüsante Fails und absurde Peinlichkeiten. Aber vor allem Platz 1 wird jedes Jahr schockierender und alarmierender.Platz 1 ist bestimmt Blizzard.So kacke Battlefield an sich als Game ist, die ganze Geschichte, was da dieses Jahr bei Blizzard rausgekommen ist, ist bestimmt Nummer 1.Wichtiger wird es auch darüber zu reden. Also legen wir ohne große Umschweife los.Auf Maurice, erzähl uns was da heißt.Werbung. Werbung.Ich konzentriere mich hier auf neue Vorfälle aus dem Jahr 2021.Ja klar.Ich könnte mich hier auch nochmal aufregen...Warcraft 3 Reforged könnte man sich nochmal ein bisschen drüber...Wobei, wann war das denn? Das war letztes Jahr, ne?...ich immer noch keine PS5 kaufen konnte.Ach so.Aber das mache ich nicht.Das interessiert mich nicht. Ich kaufe mir keine PS5.PC Master Race.Und ich habe mich längst damit abgefunden.Wie ein Mönch, der allen weltlichen Gelüsten entsagt hat.Wieso? Er kann den Kram doch auf dem PC spielen und gut ist. Zumindest das meiste.Und es kommen ja mittlerweile sogar exklusive Sachen auf dem PC raus.Die wollen jetzt irgendeine Uncharted Collection raushauen.Dann Horizon Zero Dawn gibt es auf dem PC.Den DHL Simulator gibt es auf dem PC.Also es gibt ja schon vieles exklusive auf dem PC mittlerweile.Es gibt gar nicht mal so viel, wo für sich unbedingt...Was würdet ihr sagen, Leute? Was ist der Kaufgrund für eine PlayStation 5?Also habt ihr einen Kaufgrund?Also was würdet ihr sagen, ist das, warum man sich......das kaufen sollte?Um sie zu haben.Ja, um sie zu haben, habe ich mit der alten Konsolengeneration gemacht.Und ich hatte Xbox One und PS4, keine Ahnung, insgesamt 10 Stunden an zusammen oder sowas.Die heizt gut. Ja, das wird es sein.Das ist natürlich das Beste.Mein PC kann aber auch gut heizen, wenn es sein muss.Wenn, Leute. Ehrlich. Ich bin ruhig.Weiter im Test.Das glaube ich dir nicht, Moris.Okay, aber seien wir ehrlich, Platz 5 ist nicht...Ah, Pro Evolution Soccer oder der Nachfolger von Pro Evolution Soccer.Wie heißt das nochmal? Football 2021 oder so?Der Pro Evolution Soccer Nachfolger. Ja, das war auch richtig fail....neu, denn irgendein Sportspiel, über das man sich so richtig aufregen kann,...gibt es eigentlich jedes Jahr.Wenn es reicht.Und 2021 waren es die Fußballspiele.Den Anfang machte das neue FIFA, das eine absolut unterirdische PC-Version ablieferte.Mit kaum spielerischen Verbesserungen und Grafik wie auf den alten Konsolen.Hä?Während es gleichzeitig...Wait a minute. Warum war die PC... Warum war die PC-Version......das sei mal ein Port von den alten Versionen und nicht von den neuen?Hä?Was ist das schon wieder für eine Logik?...eine viel bessere Next-Gen-Version gibt, die EA aber dem PC in Sachen Hardware-Anforderungen nicht zutraut.Aus Gründen.Hä?Wahrscheinlich wollten sie damit irgendwie Konsolenverkäufe ankurbeln oder so.Ja, aber warum? Das ergibt überhaupt keinen Sinn.Und gerade wenn das auf der PS5 oder Xbox Series X läuft, läuft das auch ohne großartigen Anpassungen.Wenn überhaupt. Auch auf dem PC.Also hä?Wenn man meinen, dass so ein Fehltritt, zumindest dem größten Konkurrenten Pro Evolution Soccer, eine perfekte Torvorlage gibt.Ne, Pro Evolution Soccer hat richtig reingeschossen dieses Jahr.Aber ach.Aber richtig reingeschossen.Einfach selbst.FIFA ist dieses Jahr sogar noch der kleinste Aufreger auf dem Fußballplatz.Denn Pro Evo gibt es gar nicht mehr.Es heißt jetzt E-Football.Ach, E-Football, ja.Und es ist richtig im Arsch....mit dem alten Namen auch schon ziemlich alles, was die Serie je gut gemacht hat.Der neue Teil punktet wirklich in keiner Disziplin.Er sieht gruselig aus, spielt sich unfassbar zäh,bietet kaum Spielmodi und strotzt auch noch vor Bugs.Die Quittung E-Football 2022 schaffte es für eine Weile lang sogar zum am schlechtesten bewerteten Steam-Spiel aller Zeiten.Wir wissen alle, wer zumindest kurzzeitig da ganz oben mitgemischt hat bei schlechtesten Steam-Games.Ich glaube, Battlefield 2042 ist mittlerweile nicht mehr Top 10, aber immer noch weit oben.Und wurde erst kurz vor Veröffentlichung dieses Videos noch entthont von War of the Three Kingdoms,einem chinesischen Online-Spiel, das wohl so gieriger Pay-to-win-Schrott ist,dass chinesische Spieler in Scharen die Steam-Seite stürmen, um uns wessen.Also wenn die China-Chinesen schon sagen, es ist Pay-to-win,dann ist es aus unserer Sicht schon nicht mehr Pay-to-win,sondern noch irgendwie, was kommt danach Pay-to-win?Pay-to überhaupt den Spawn verlassen können oder so.Was ist die Steigerung von Pay-to-win?Weil die Chinesen haben da gerne Pay-to-Casino.Nee, Pay-to-play ist ja was anderes, das ist schon belegt.Verletzung der Menschenrechte.Hey, wenn sich die Chinesen darüber beschweren, dann muss es noch schlimmer sein.Also generell muss man sagen, in Asien, gerade auch in China und auch teilweise Korea,vor allem in China, ist ja Pay-to-win viel akzeptierter als bei uns.Und wenn die sich da drüber aufregen schon, dann muss das wirklich eine ganz extreme Geschichte sein.Zwar weiß ich nicht ganz, was Sie uns damit sagen wollen,dass wir immer eine Blitzhund-Karte auf der Stirn haben, aber es muss schlimm sein,denn War of the Three Kingdoms kommt auf miserable 10% positive Reviews.Aber selbst das...Battlefield 2042 hatte teilweise 20% oder 21%.I see, danke schön für den Sub.Aber das ist natürlich nochmal eine Nummer härter....nur knapp schlechter als eFootball.Das schafft auch nur 14% von über 25.000 Bewertungen.Und auch auf Metacritic wurde das Spiel offiziell zum Schlechtesten.Aber Hauptsache, sie haben fette Lizenzgebühren reingebuttert,dass sie die offiziellen Namen und so haben können.Also Geld scheint ja da zu sein....musste das große Update 1.0 aber auf Frühling 2022 verschieben und es ist irgendwie schwer vorstellbar,dass es diesen Karren noch aus dem Dreck ziehen kann.Wenn ihr euch jetzt fragt, warum all das nur für Platz 5 reicht,naja, dann schnallt euch mal an.Platz 4 geht an einen Aufreger, der auch außerhalb der Gaming-Szene Wellen schlug.Ah, Dislikes.Ach Moment, sowas haben sie da auch mit drin.Okay, ich dachte es ging rein um Games.Okay, dann fällt mir 2021 auch noch ein bisschen mehr ein.Aber ja, das hat es verdient.Ja, so fail, Alter.Ach, das ist, ich hab mich schon so oft darüber aufgeregt.Das ist einfach so krasser Schwachsinn.YouTube macht das nur fürs Geldverdienen unterm Strich.Ja, weil keine Ahnung, Ubisoft und Activision und wer auch immer es nicht mag,zu sehen, dass ihr Dreck gedisliked wird.Und was auch noch dazu kommt, das ist das eine.Und weil die Leute vielleicht abschalten, wenn das Video kaputt geht,und was auch noch dazu kommt, das ist das eine, und weil die Leute vielleicht abschalten, wenn das Video zu sehr disliked ist.Also es hat bestimmt Statistik, die haben bestimmt Statistiken bei YouTube,wo sie sehen können, dass die Leute, wenn sie disliked sehen, das Video quasi erst gar nicht mehr ausprobieren.Was ja auch wahrscheinlich gut ist, weil das Video höchstwahrscheinlich Müll ist.Du kannst über die Apis, also theoretisch kannst du über die Apis nicht mehr abgreifen, aber ich glaube es geht noch.Die wollten das eigentlich zum 12.12.Glaub abschalten mit der Api, aber ich glaube es geht noch.Ja, dass das wegen Hatewellen ist, ist halt schwachsinnig.Ja, das stimmt schon, es gibt halt viele dumme Leute auf YouTube, aber Dislikebombing muss ich ehrlich sagen.Also ich will jetzt nicht abschreiten, dass es das gibt, dass sich Leute irgendwie zusammenrotten,oder gar irgendwelche Bots kaufen, um Leute da fertig zu machen, aber im Großen und Ganzen ist das jetzt nur wirklich gering.Und zumindest ist die Antwort darauf nicht, eines der wichtigsten Features für alle abzuschalten.Die Leute kritisierten, dass die Dislikeleiste ja auch einen positiven Zweck erfüllt.Ja natürlich.Die erlaubt es beispielsweise direkt zu sehen, wenn ein Video einfach nur clickbait ist und sein Versprechen nicht erfüllt.Zum Beispiel ein angeblicher Guide, der die Frage im Titel nicht beantwortet oder ein Fake-Trailer zu einem Kinofilm.Und die Dislikeleiste konnte ähnlich wie Steam oder Metacritic Reviews ja nicht nur für böswilliges Reviewbombing genutzt werden,sondern auch als legitime Form des Protests.Ja, ich sag nur Diablo Immortal Trailer.Das Ding hatte auch so heftig viele Dislikes.Oder neueres Beispiel, das Ubisoft NFT, äh, äh, NFT, äh, Ubisoft, ich weiß nicht mal, Unlisted, Trailer, Quarz, Quarz, YouTube.Haben wir das irgendwo? Nein.Ich brauch den Link da drauf, Leute. Quarz.Quarz, wo ist das Link? Alter, mir gehen diese News-Posts immer so auf den Sack, die da keinen Link dazu drin haben.Hat jemand den? Ja. Nein.Ich würde das nicht auf eurer Seite angucken. Ich will das auf YouTube gucken.Ihr werdet es doch schaffen, dort einen Link auf YouTube, oder ist es mittlerweile gelöscht auf YouTube?Die werden es doch schaffen, einen Link auf YouTube zu packen, worüber sie sich aufregen.Das ist ja wieder lächerlich, alter News-Seiten.Unlisted.Wenn es da Tom Henderson schreibt, jawoll, da sind wir doch.Ups, hallo, wo ist es jetzt hin?Ach, da hinten.Hier.1,7k zu 42k.Das wollen die auch nicht, dass man das noch sieht.Alter, das ist so schlecht, das ist so mies.Okay, machen wir das Video weiter.Zum Beispiel gegen lächerliche Glücksspiel-Trailer, wie dieses Machwerk von NBA 2K20 damals.Ich meine nicht, dass so was große Firmen je umstimmen würde, wenn der Hubel rollt.Aber so einem Video darf man schon mal ansehen, wie bescheuert es ist.Kritik kam sogar von einem der drei YouTube-Gründer.Das ist das erste YouTube-Video, by the way.Wer das nicht kennt, das ist das erste YouTube-Video, das hochgeladen wurde.Ja, es ist sehr viel Schrott auf YouTube mittlerweile.Zumal ja am Anfang, zu der Zeit, gab es ja sogar noch das Sternesystem.Vielleicht erinnert sich der ein oder andere noch.Ich kann euch mal zeigen, wie das Sternesystem ausgesehen hat.Archiv, Org, Dislike-System. Achtung, nicht Dislike-System.YouTube.com, nehmen wir mal meinen Channel.Nehmen wir mal meinen Channel.Wayback Machine.Und gehen wir mal zurück auf 2011.Und dann hier, keine Ahnung.Gucken wir uns mal den Channel an von 2011.Java hat man, äh nicht Java, Flash-Play hat man damals noch gebraucht.Es ist natürlich blöd, dass es jetzt auf Japanisch ist.Oh guck mal, da gab es keine, da gab es nur schon Up und Down, da gab es noch keine Sternebewertung mehr.Ich bin mir aber relativ sicher, dass es am Anfang noch Sterne gab.Okay, da habe ich ungefähr meinen Channel erstellt, ein paar Monate vorher.Also, da waren es auch schon Likes und Dislikes, guck mal.Dann habe ich gar nicht so viel mitbekommen, da hatte ich noch den Tux-Keks-Avatar.Daher kommt auch diese Keks-Geschichte her.Ich hatte so einen Linux-Avatar ursprünglich drin.Und da habe ich mir gedacht, okay, wenn ich da jetzt sogar Geld mit verdiene,dann kopiere ich mir keine Bilder, die andere Leute erstellt haben, sondern lasse ich mir was eigenes erstellen.Tja, irgendwie sah YouTube doch tatsächlich mal übersichtlich aus.Du konntest letzten Kommentare sehen von einem Creator,was auch schon sinnvoll war, weil die Leute das vielleicht einfach interessiert hat.Du hast gesehen, was hier abgeht.Du konntest Kommentare posten, so sichtbar auf dem Channel.War eigentlich gar nicht so schlecht.So, was ist jetzt, wenn wir hier draufklicken? Sehen wir es dann?Aber guck mal, der hat sogar ein bisschen...Moment, das Video geht noch.Glaub ich jetzt aber nicht.Tatsächlich.Alter, der Sound!Alter, der Sound!Alter, der Sound.Oh, ist das schlecht.Wer hat hier Kappa Pride Flames gemacht?Das eigentliche Comment kann man sich nicht mal anzeigen lassen.Okay, nice, guck mal weiter.Ja, leider, leider können die ja auch nicht zaubern mit dieser Browser-Erweiterung.Die habe ich ja auch am Start, deswegen seht ihr ja nur Dislikes bei mir noch.Die haben sich bei Videos eine interne Datenbank angelegt,mit Dislikes, als sie noch abrufbar waren.Und für neue Videos müssen die das irgendwie errechnen.Das heißt, das wird nie so richtig genau sein.YouTube hat die API schon abgeschaltet.Das heißt, eigentlich ist es jetzt mehr oder weniger useless schon.Man kann es so grob erkennen, weil die die Dislikes errechnen.Was heißt errechnen? Errechnen ist ja das falsche Wort.Errechnen wird ja bedeuten, da kommt was so...Klar, inputbasiertes raus am Ende.Die sagen einfach anhand der View zu Like Ratio,aha, so und so viele Dislikes müsste das haben, ungefähr.Die schätzen das eher, genau.Oh, cringe.Auf Platz 3 landet der rechtmäßige Erbe...GTA, natürlich, was sonst?Die GTA Trilogy Definitive Edition.Ein großer Titel für eine Neuauflage, bei der eigentlich fast alles daneben ging.Mal angefangen beim Inhalt.Das größte Verkaufsargument wäre das Grafikupdate,aber die neuen Charaktermodelle sind in vielen Fällen eher comichaft und...Die Rechnen hoch, was die Leute liken und Disliken mit dem Addon.Das ist neu, ich habe bei ihnen gelesen auf der Seite,wo sie selbst erklären, wie es funktioniert.So.Habe ich ein Video gezeigt, erklären sie ja, wie es funktioniert.Und...Estimated extrapolated...Ah!Okay, das ist neu.Based on View Like Ratios.Das scheint jetzt neu zu sein.Estimates extrapolated from extension user data.Das habe ich nicht gelesen, oder es ist jetzt wirklich neu.Ich wusste nur, dass sie das hier machen.Lächerlich als wirklich eine Verbesserung.Ja, es gibt unter anderem neue Effekte und einige davon sind sogar gelungen,aber andere, wie der Regen, wirken einfach nur so.Haben die das nicht sogar entfernt, zwischenzeitlich?Haben die nicht das GTA Remake sogar entfernt, um danach quasi,weil es irgendwie Modding Code enthielte,und um es danach wieder quasi zu entfernen und neu hochzuladen, übertrieben.Und zu allem Überfluss gibt es selbst mit einer GeForce 3080ernsthaft noch Performance-Probleme bei diesen uralt Spielen.Inhaltliche Verbesserungen, wie die überarbeitete Steuerung,stellten sich dann auch noch als viel weniger tiefgreifend als erhofft heraus.Und es fehlte sogar...Und das Schlimme ist ja, dass sie gleichermaßen versuchen,dass man an die alten Spiele nicht mehr rankommt.So ein bisschen, wie bei Warcraft 3 Reforged.Keiner wollte es so wirklich haben, gerade von den Pros, die...Und jetzt sagen wir Pros, ja doch.Sagen wir mal, von den richtig guten Leuten, die Multiplayer spielen.Die wollten ja eigentlich das alte weiter spielen.Und dann hat Blizzard gesagt, nö, gibt's das nicht mehr.Songs auf den Original spielen.Kurzzeitig nahm Rockstar die Definitive Edition sogar offline,weil angeblich noch irgendwelche Dateien drinsteckten,die nicht drin sein sollten.Das alles wäre für saftige 60 Euro schon peinlich genug.Aber viel schlimmer stieß den Fans noch auf,wie Rockstar sie regelrecht zum Kauf nötigen wollte.Das Studio nahm nicht nur die Originale aus dem Handel.Publisher Take-Two verklagte auch noch Modder,die völlig kostenlos Verbesserungen für die alten Spiele produziert hatten.Das ist ja fast...Also Nintendo ist ja auch so ein Laden,der alles verklagt, was bei 3 nicht auf dem Baum ist.Das ist jetzt aber noch mal eine krassere Geschichte,weil ich meine, die Games wurden jetzt, was weiß ich,10, 15 Jahre nicht mehr supportet,und die Leute haben quasi selbst dafür gesorgt,dass sie gut spielbar blieben und auch auf neuere Hardware.Und jetzt kommen die einfach, oh nö, wir verklagen euch.Dabei teilweise sogar einen besseren Job gemacht hatten.Hinterher entschuldigte sich Rockstar zwar für das Release-Debakelund brachte die Originalspiele zurück in den Store,aber der Schaden war angerichtet.Selbst schuld.Auf Metacritic...Komplett verdient.Da spiegelt jetzt vielleicht nicht die reale Sachen wieder,die die Spiele trotzdem verdient hätten,aber das haben sie sich wirklich verdient....steht die Trilogie bei einer Kritiker-Wertung von 49und traurigen 0,5 User-Score.Was tatsächlich noch mal schlechter ist...Das haben sie sich...Ja, das muss er erst mal schaffen.Zwar recht knapp, aber hey...Glückwunsch, Rockstar.Das muss man...Das muss man schaffen, ja.Ja.Auf Platz 2 schafft es eine Katastrophe mit Anseige.Battlefield?Der Release von Battlefield 2042.Ich wusste es, ich wusste es, Battlefield.Okay, wenn jetzt Battlefield kommt,dann ist Final bei Maurice garantiert Blizzard.Muss.Das ist bestimmt 100, ich könnte wetten....spiel jede Menge Alarmglocken klingelnund ein Monat Verschiebung war viel zu wenig,um die alle aus der Welt zu schaffen.So ging Battlefield 2042 in einem schlichtweginakzeptablen Zustand an den Start.Die Performance enttäuschte selbst auf High-End-Rechnern,das Waffenhandling war lächerlich ungenauund es verging eigentlich keine Runde ohne auffällige Bugs.Zum Beispiel das wundersame Senkrecht-Starter-Luftkissenboot hier.Aber mehr noch, viele Fans kritisierten auchgrinsch Sprüche.Allen voran die Streichung der Klassen.Angel does it again.Einer der archätypischsten Merkmale von Battlefield als Serie.Zugunsten der Specialists,die zwar immer noch Teamplay erlauben,aber dazu weniger Anreiz geben als vorherund wirken wie dem Hero-Shooter-Trend hinterhergerannt.Und die Klassen waren nicht das einzige Feature,das DICE aus dem Spiel warf.Es fehlten auch essentielle Funktionenwie Voice-Chat und ein Scoreboard.Legacy Feature ist das Scoreboard, haben wir jetzt gelernt.Oder wie Angel sagen würde,don't be sad, that's the way it works out sometimes.Oder so ähnlich.Ganz ähnlich wie bei E-Football,gab's auch hier eine brutale Quittung auf Steam.Battlefield 2042 rangiert auf Platz 16der am schlechtesten bewerteten Spiele.Ja, verdient, verdient.I'm as shocked as you are, genau.Es kassierte über 70.000 negative Reviews.E-Football immerhin nur 22.000.DICE hat zwar schon begonnen, das Spiel fleißig zu patchenund eine Roadmap vorgestellt,aber dieses Ruder noch mal herumzuweißenwird eine echte Mammut-Aufgabe.Ich weiß gar nicht, warum da so viele zuversichtlich sind.Bei Battlefield 4 hat das geklappt.Ja, aber Battlefield 4 war von Anfang an ein gut durchdachtes Game.Broken as fuck, aber ein gutes Game.Battlefield 2042 ist absoluter Schrotthaufenauf Designersicht und auf......vom Zustand her.Also ich weiß nicht, warum die Leute da so zuversichtlich sind.Die Steam-Spieler-Zahlen brachen nach Release so gnadenlos ein,dass teilweise der Vorgänger Battlefield 5 auf die gleiche Aktivität kam.Geil, oder?Bleibt Battlefield 5 übrigens, grün ist 2042.Ich sag's nur noch mal, weil's nicht mehr lange hin ist,dass Battlefield 5 das sogar umdreht und den Nachfolger überholt.Denn für diesen dicken Anstieg am Ende der Kurve...Und by the way, die haben Battlefield 5 eingestellt dafür....2042 ein Gratiswochenende und einen dicken Sale gebraucht,was einen Monat nach Release allein schon ein echt übles Zeichen ist.Ja.Ey, soll ich euch mal einen zeigen,der's ähnlich schlecht hingekriegt hätte?Übrigens, das fehlt mir in Maurice's Liste auch noch, falls es jetzt nicht kommt.Aber ich wette mit euch, es ist Blizzard.Es gibt noch einen, der das ähnlich gut hinbekommt.Mit Spielerzahlen verlieren.Wir sind jetzt unter 100.000!Leute, an Weihnachten!An Weihnachten!Das muss man sich mal auf der Zunge zergehen lassen.Also es ist jetzt quasi die Zeit, wo Leute Zeit haben, spielen können,mehr denn je als das ganze Jahr über.Und die haben es tatsächlich geschafft, das erste Mal unter 100.000 zu droppen.Das ist so ein...Wie sagen sie immer?Ein Train...Wie heißt das auf Englisch?Trainwreck oder so?Also das ist so im Arsch.Das ist der Wahnsinn.Also New World, das ist einfach mal...Das war aber auch Fail mit Ansagen, ne?Ist doch noch okay.Ja.92% der Spieler verlieren.Das ist sicherlich noch okay, ja?Wir haben ja stehen geblieben hier.Aber all das verblasst gegen Platz 1.Und seien wir ehrlich...Blizzard, ich wusste es.Wir wussten es.Es ist Maurice, da musste Blizzard kommen.Da musste Blizzard kommen.Aber New World hätte es durchaus da auch noch reingeschafft....hier stehen muss.Keine Firma ist in der Geschichte des Gaming so tief gefallen wie Activision Blizzard.Und vor allem natürlich der Blizzard-Teil der Firma.Kaum ein Entwickler genoss zu seinem ganzes Zeichen...Ich hab letztens ein Video gesehen von einem Warcraft 3 Level-Designer.Und er hat ein bisschen über Blizzard, wo er gearbeitet hat,und aktuell in Blizzard geredet.Und er hat halt zum Schluss gemeint, Leute, hört auf euch das so sinngemäß.Ich krieg's jetzt zitatmäßig nicht hin.Leute, hört auf euch einzureden, dass da noch irgendwas übrig...Der Easter-Egg-Typ, genau den meine ich.Hört auf euch einzureden, dass da noch was übrig ist.Das alte Blizzard gibt's nicht mehr.Und was ich witzig fand, was er in seinen Videos erzählt hat,dass er vom ehemaligen Blizzard-Chef und von Jeff Kaplan rausgemobbt wurde als Level-Designer.Also damals war sicherlich auch nicht alles rosig.Aber Papa Jeff war ja eh früher so der richtig krasse Flamer.Es gibt ja noch Posts von ihm, ich weiß nicht, ob das jemand, weil er sich angeguckt hat,wo er EverQuest 2, das war ja damals, bevor er zu Blizzard gegangen ist,war er einer der besten Raid-Gilden von EverQuest 2.Und er hat so krass geflamt im Forum damals.Würde man von Papa Jeff heutzutage gar nicht mehr erwarten, aber...Das war auch mal ein junger Flamer.Er hatte einen so unangreifbaren Ruf als die Bastion der Gaming-Perfektion.Kaum ein Spieler ist nicht zumindest mit irgendeiner Blizzard-Marke aufgewachsen.Bei mir war es Diablo, das mir am Herzen lag wie wenige Schindler-Serien.Ich meine, die hatten damals einen richtig krassen Rand, muss man sich mal überlegen.Ich glaube, das erste Blizzard-Spiel war sogar Warcraft 2.Aber die hatten richtig krasse Sachen.Die hatten von Diablo bis StarCraft, bis dann später Warcraft 3.Das war dann auch so, wo ich aufgehört habe, so richtig alles, was Blizzard gemacht hat zu spielen.Die hatten so viele geile Sachen.Also, man hat eigentlich gedacht, die können keinen Mist produzieren.Alles, was die raushauen, ist geil.Ich habe angefangen, Warcraft 2 zu spielen, fand ich nice.Dann kam Diablo 1.Diablo 1, absolut wegweisendes Ding.Dann kam irgendwann StarCraft, auch ultra geil.Und natürlich Diablo 2.Diablo 2 ist, glaube ich, eines meiner meistgespielten Sucht-Games aller Zeiten.Und dann Warcraft 3.Das habe ich bei weitem nicht mal so viel gespielt.Ich habe fast nur Singleplayer gespielt.Ich habe StarCraft 1, habe ich ja sogar Battle.net gespielt damals.Aber Warcraft 3 habe ich nur Kampagne gespielt.War auch ein super Game.Aber danach war es bei mir mit Blizzard ein bisschen vorbei.Ich habe World of Warcraft nebenbei, neben Daug ein bisschen gespielt damals.Aber danach war es das für mich mit Blizzard.Dann kam irgendwann StarCraft 2 oder so.Ich weiß gar nicht in welcher Reihenfolge.Hearthstone habe ich auch noch ein bisschen gespielt.Aber die hatten innerhalb von 5 Jahren, haben die einfach mega krasse Games rausgehauen.Das ging los, wie gesagt.Warcraft 2 und ging bis Diablo 2, Warcraft 3.Also 5, 6, 7 Jahre haben die quasi nach und nach absolut weg...Stimmt, Overwatch habe ich ganz vergessen.Natürlich habt ihr recht.Overwatch habe ich schon wieder so verdrängt.Die haben diese 5, 6 Jahre einfach wegweisende Spiele nacheinander rausgehauen.Das ist jetzt einfach schon lange vorbei.Vielleicht waren es Warcraft oder StarCraft.Und deswegen haben wir uns die letzten Jahre auch so hart getroffen.Weil Blizzard für viele eben mehr war als nur ein Erzeuger von Entertainment-Produkten.Blizzard war unsere Kindheit.Blizzard war eine der tiefsten Wurzeln meiner Gaming-Leidenschaft.Und ich dachte, nach dem Blitzschrank-Skandal könnten sie schon nicht mehr viel tiefer sinken.Ich dachte, nach Warcraft 3 Reforge konnten sie nicht mehr tiefer sinken.Es geht immer weiter runter.Oh, sweet summer child.2021 verklagte der Staat Californien Activision...Ich finde das immer noch heftig.Das musst du erst mal schaffen, dass sich der Staat Californien verklagt.Weil die Firma Frauen und Minderheiten jahrelang systematisch benachteiligt und misshandelt haben soll.Gipfel der Anschuldigungen.Eine Mitarbeiterin soll sich als Folge dieser frauenfeindlichen Kultur auf eine Geschäftsreise das Leben genommen haben.Es ist mega heftiges Zeug, wenn man sich damit mal beschäftigt.Es gibt ja noch viel mehr Sachen.Das CEO Bobby Kotick, seine Assistentin, einmal per Sprachnachricht ankündigte, dass er sie ermorden lassen will.Und das ist wirklich nur die Spitze des Eisbergs.Ich kann die ganze Bandbreite der ekelhaften Vorkommnisse in diesem Video nur anreißen.Wir haben aber eine eigene Talkrunde und einen Sammelartikel zu dem Skandal erstellt,wenn ihr euch ein umfassenderes Bild machen wollt.Was viele Spieler wohl am meisten traf, war, dass es hier eben nicht nur um die bösen Anzugträger wie Bobby Kotick ging.Es waren auch viele führende Entwickler unserer Lieblingsspiele.Die ganz alte Garde von Blizzard, die plötzlich in völlig neuem Licht dastand.Der ehemalige Blizzard-CEO Mike Morhaime und der langjährige Story-Gurro Chris Metzen entschuldigten sich beide für die Vorkommnisse.Aber gaben sich auch überrascht, als hätten sie selbst kaum etwas davon gewusst.Und beide erhielten Antworten von ehemaligen Mitarbeiterinnen,dass sie sehr wohl Teil der frauenfeindlichen Blizzard-Kultur waren und diese aktiv beförderten.Selbst wenn sich Frauen hilfesuchend an sie wandten.Auch in der Anklage steht, dass die Firma und ihre Chefs im Zweifelsfall eher die Täter in Schutz nahmen und die Opfer bestraften, wenn sie...Ja, weil das mehr Stonks gibt unterm Strich.Ja.Oder man hat sich halt außergerichtlich irgendwie geeinigt und es bloß nicht an die große Glocke zu hängen....den Mund aufmachten.Bobby Kotick soll laut Ermittlungen des Wall Street Journals sogar Vergewaltigungsfälle bei Sledgehammer Games unter den Tisch gekriegt haben.Ja, das ist das, was ich meine.Da hat man sich dann außergerichtlich geeinigt und er hat nicht im Aufsichtsrat danach Bescheid gesagt, was er eigentlich hätte machen müssen....gehehrt haben.Zwar nahmen nach den Enthüllungen viele führende Köpfe ihren Hut oder wurden gefeuert.Darunter Blizzard-Präsident J. Allen Bragg und der Game Director von Diablo 4.Aber trotzdem ließ die Reaktion von Activision Blizzard...Tja, ich denke mal, Jett, das wird so ein Zwischending sein aus, abhängig davon sein, dass man Geld verdient und im Zweifelsfall auch nicht wissen, wo man sonst was anderes bekommt.Du kannst dir in der Regel nur Leute richtig ausnutzen, wenn sie auch noch besonders abhängig von dir sind.Weil ansonsten sind sie einfach instant weg....einiges zu wünschen übrig.Wie Bobby noch CEO sein kann, ganz einfach, weil er fette Kohle macht.Angesichts stetig wachsender Mitarbeiterproteste hält die Firma etwa an Bobby Kotick als CEO fest.Und behauptet, er sei der Richtige, um den tolerantesten und offensten Arbeitsplatz wegzugehen.Ja, bla, bla, bla, bla, was? Das ist so ein Gelaber.Das ist einfach nur Bullshit.Es hat sich ja mittlerweile rausgestellt, dass die, ähm, die hatten ja irgendeine Frau eingestellt für Integration und, äh, Harassment und sonst was.Und die sollte sich eigentlich die Sache annehmen.Und die hat dann eine Mail geschrieben, wie geil es eigentlich ist, bei Blizzard arbeiten zu können.Und im Nachhinein hat sich rausgestellt, Bobby hat diese Mail in ihrem Namen geschrieben.Das hat er sogar zugegeben.Also, das ist einfach nur komplette Augenwischerei und dummes Gelaber, den geht's nur um Stonks und Geld.Und wahrscheinlich hat Bobby seine besten Buddys da an den passenden Positionen, ähm, untergebracht, dass, äh, er nicht so einfach abgesägt werden kann.Tolerantesten und offensten Arbeitsplatz der Gamingbranche zu schaffen.Gleichzeitig erklärte man...Ja, dazu kann man wirklich nur sagen......Belger vom kalifornischen Amt für faire Arbeitsbedingungen hätten sich, Zitat, schändlich und unprofessionell verhalten und ein verzerrtes Bild der Blizzard-Geschichte gezeichnet.Außerdem geht die Firma bis heute immer wieder dagegen vor, dass sich die Mitarbeiter zu sehr organisieren und etwa eine Gewerkschaft gründen.Das ist aber so ein allgemeines Ding. Guckt euch bei Amazon an. Ist ja gut oder schlecht, aber das würde ich jetzt nicht in dem gleichen Kontext sehen.Dass die da nicht schafft drauf sind, ist ja bekannt.Blizzard nach J. Allen Braggs Abgang eine Doppelführung aus Jen O'Neil und Mikey Barra an die Spitze von Blizzard setzte, hielt das gerade mal ein paar Monate, bevor Jen O'Neil ihren Hut nahm.Weil die Firma sich nach all dem ernsthaft weigerte, ihr das gleiche Gehalt zu zahlen wie ihrem männlichen Kollegen.Kurzum, nichts davon erweckt den Eindruck einer Firma, deren Chefs ernsthaft um besseren Gemüts sind.Nö. Überhaupt gar nicht.Die so Sachen wie, wir benennen McCree um, das ist rein öffentliche Marketing-Stonks-Versuche, sich in ein besseres Licht zu rücken.Nicht, weil man wirklich grundsätzlich was ändern will. Also mit dem Umbenennen von McCree ändert man sicherlich nicht die Firmenkultur komplett.Das mag da vielleicht Teil von sein, aber diese einzelnen Dinge, die sind einfach nur vorgeschoben.Um zu zeigen, seht her, seht her, wir machen was, um wirklich nichts zu machen.Wenn die Mitarbeiter weiter leidenschaftlich dafür kämpfen. Und das traurigste an all dem ist wohl, dass es sich inzwischen nicht mehr wie ein Einzelfall anfühlt.Das traurigste daran, für mich so als jemand der Spiele mag, ist, dass dort auch immer noch Leute arbeiten, die tatsächlich alles geben, um gute Games zu machen.Und die trifft's jetzt doppelt. Die haben scheiß Arbeitsbedingungen.Und im Zweifelsfall verlieren sie noch ihren Job, weil das Management es so verkackt hat und die Leute jetzt die Games nicht mehr kaufen und sowas.Das ist ein äußerst vielschichtiges Problem.Und das ist einfach nur mega für'n Arsch. Und die machen nicht den Eindruck, als haben die irgendwie Bock daran, was zu ändern.Warum soll der unbenannt werden? Der wurde unbenannt.Weil McCree wohl nach einem Blizzard-Mitarbeiter benannt wurde, der in diese ganze Geschichte verwickelt ist.Ubisoft bis hin zu Activision Blizzard und vielen weiteren Fällen.Wir alle müssten der Tatsache ins Gesicht sehen, dass die Gaming-Branche...Ubisoft ist auch so'n Scheißladen. Die haben erst vor einer Woche wieder massig Leute entlassen.Oder vor zwei Wochen. So, wisst ihr, das ist doch mal super nett, oder? Mal kurz vor Weihnachten einfach mal Leute entlassen.Nicht das Kindheitsidyll, nicht der Traum-Spielplatz, nicht der sichere Ort ist, den wir uns vielleicht ausmalten, als wir dieses Hobby zum ersten Mal für uns entdeckten.Ja, aber Rista, hast du recht.Denn das hier ist nie wirklich wahr. Nun bleibt nur noch die Frage, wie wir damit umgehen.Ja, alle recht.Ist leider so.Twitter-Empörung, ja.Ja, das ist typisch, das ist wirklich Twitter. Genauso ist Twitter.Patriachat ist daran schuld, kommt. Also das ist typische Twitter-Antwort.Wer zum Teufel ist Helen Keller? Das ist irgendeine Ami-Kakona-Geschichte, oder? Ich weiß nicht, wer das ist.Genau so ist Twitter. Das trifft es ziemlich gut. Was auch der Grund ist, warum mein Twitter auf Andorra steht und nicht auf Deutschland, weil da muss ich mir deutsche Trends angucken.Und deutsche Trends auf Twitter sind Paints-Champ. Ich werde es euch beweisen. Ich weiß nicht, was für Twitter-Trends in Deutschland heute aktiv sind, aber ich wette mit euch, zwei Drittel davon sind ganz, ganz hochgradiger Paints-Champ.So, zeig her.Bestimmt Paints-Champ?Ich weiß nicht, was das ist, aber wahrscheinlich auch Paints-Champ.Okay, es ist Weihnachten, das ist gar nicht so schlimm. Aber deutsche Twitter-Trends sind einfach abpackt.Ich habe richtig reingespachtelt gestern. Gestern war richtig Pepofet angesagt. Extremes Pepofet war gestern angesagt.So, gucken wir mal weiter. Was können wir als nächstes angucken?What's on my home server? Da mache ich auch so ein Video.13 Advanced JIT-Techniken.Level-Captchi-Bait, Alter.Warum Auto-Play von Videos? Was ist hier los? Auto-Play 2021.What's on my home server? Okay, zeig her. Was ist auf deinem Home Server?Der Wolfgang ist am Start.Ungefähr so sieht man Schreibtisch auch gerade aus. So, geht in die Richtung.Habe ich gar nicht. Ich hatte auch mal so ein Dashboard, aber ich habe es nie verwendet.Okay, lass mal gucken, was hat er denn? Jellyfin, das ist irgendwie so eine Downloader-Geschichte, oder?Oder ist Jellyfin eine Plex-Alternative? Ich bringe das gerade durcheinander.Ich glaube, das hier sind beides Downloader. Ich glaube, Radar und Solar sind auf jeden Fall irgendwelche Torrent-Download-Geschichten oder so.Deluge weiß ich jetzt nicht, was es ist. OpenBooks klingt halt wie... Im Prinzip ist das hier wahrscheinlich das, wo er seine Sicherheitskopien speichert.Werden natürlich nur und Linux-ISOs. Also das hier ist für Sicherheitskopien und Linux-ISOs.Passwort-Manager, Foto-Manager, ja, File-Sync, Kalender-Sync für seine Netzwerk-Geschichten.Wahrscheinlich hauptsächlich WLAN-Controller und falls er Kameras hat, wahrscheinlich hauptsächlich WLAN-Controller.Zum Management-Jacket, keine Ahnung. Fritzbox ist klar. PyKVM ist auch klar. PyHole, gut.DNS, Adblock, Gedöns, Foscon, das ist ZigBee, Gedöns und Home Assistant.Okay, jetzt wissen wir eigentlich schon alles. Müssen wir uns gerade angucken.Wir skippen das jetzt. Wir skippen jetzt vor zur Home-Automation, weil ich glaube, der Rest ist nicht sonderlich spannend.GW, warum nicht CACW? Ja, ZigBee.Ja, das verwende ich unter der Haube auch. Also ich habe einen KonBee-2-Stick, das ist vom gleichen Hersteller,der auch das macht, wobei ich das hier nicht die Cons verwende, sondern ZigBee-2-MQTT.Klappt sein ganzes Home-Automation-System noch, wenn das Internet ausfällt? Ja, wahrscheinlich.Das ist ja der Vorteil, wenn er das lokal mit ZigBee-Geräten macht.Also meins geht auch noch, wenn das Internet ausfällt. Wo es bei mir nicht mehr geht, ist, wenn ich meinen Home-Automation-Server ausschalte.So viel hat er da gar nicht drin. Er hat ein paar Thermostate, die Standard-Sonne ist auf, ist untergegangen und ein paar Lichter.So viel ist da gar nicht dabei. Also ich habe bei mir das ähnlich wie er, nur dass ich das Raum basiert habe.Also ich habe hier das Arbeitszimmer, Moment, ich mache es mal kurz auf, aber so, dass ihr es nicht sehen könnt, weil da ist zu viel Leak.Ich habe ein Home-Dashboard, da sieht man, wer daheim ist und der Batteriestand und Außentemperatur und Müllkalender und offene Fenster und Heizungstruck im Keller.Tankstellen in der Nähe, Heizungstemperatur, das habe ich auf dem Dashboard.Dann habe ich fürs Wohnzimmer einen Tab, dann habe ich fürs Arbeitszimmer und Serverraum einen Tab.Dann habe ich fürs Klo einen extra Tab in meinem Home Assistant, weil mein Bad braucht einen extra Tab.Dann habe ich die Küche drin und den Keller und den Stall.Im Stall ist ein Temperaturfühler für den Fischteich und eine Steckdose.Ich schiebe die großen Lichter an, dann kann ich sie öffnen.Das ist, denke ich, ziemlich cool, eine Menge gute Kälte im Leben.Und der Grund, warum ich kein Cloud-Sensor habe, ist, weil ich kein Methan-Sensor habe.Vielleicht IKEA Smart-Home-Stuff oder Philips, ist, weil ich voll Kontrolle über meine Smart-Home-Device haben will.Mach doch mal einen Screenshot von deinem Home Assistant.Okay.Ich will absolut selbstsufficient sein, ich will ohne Internet arbeiten.Auch wenn nichts mehr funktioniert, auch wenn ich kein Internet habe.Ich will, dass mein Heizungsgerät immer noch funktioniert, wie ein normaler Heizungsgerät.Aber ich will auch, dass es so schön ist, wenn du aus der Runde gehst, und du denkst, du hast vergessen, die Lichter zu öffnen.Aber jetzt bin ich zu langweilig, und dann machst du das.Und bam, die Lichter sind aus.Ich weiß, es klingt wie ein Bunch von Problemen aus dem ersten Welt, wo du zu langweilig bist, um die Lichter zu öffnen.Aber ich sage nicht, dass es ein Spaßprojekt für mich war.Und ich denke, ich werde versuchen, mehr und mehr von meinen Smart-Home-Devices zu machen.Nur um den Zweck.Nicht, weil ich zu langweilig bin, sondern weil es einfach Spaß macht.Also werde ich dich definitiv auf das Posten halten, und du solltest sehr bald ein Video über Smart-Home erwarten.Was in der Sprache meines Channels vielleicht dieses Jahr ist.Ich weiß nicht, ich kann mir nichts versprechen.Also ja, das ist es eigentlich.Das sind alle Services, die ich runne.Ich weiß nicht, ob ich das alles zensiere.Ich will dir auch noch etwas über diese grüne und rote Indikator sagen.Sie sollen indizieren, ob ein Service hoch oder runter ist.Aber weil es viele HTTPS und Kurs-Schananigans gibt, funktioniert es nicht wie erwartet.Ich copy-paste euch jetzt mal.Ich hoffe, ich habe alles zensiert.Ich copy-paste euch mal hier mein Home Assistant-Dashboard.So.So sieht das Dashboard aus, wenn ich das Ganze aufmache.Ich habe hier oben eine Anzeige für wann der Müll kommt.Da stehen normalerweise die Tage unten drunter.Dann habe ich eine Anzeige Luft, Luftdaten.Die aber gerade aus irgendwelchen Gründen.Da steht dann so Feinstaub, Feinstaubbelastung und sowas drauf.Weiß ich nicht, warum das gerade nicht funktioniert.Kein Schimmer.Außentemperatur.Dann Anwesenheitsstatus.Dann wann der nächste Zug kommt nach Frankfurt.Dann die Batterieladung, das geht normalerweise noch ein bisschen weiter nach unten.Dann die Batterie von den ganzen Geräten.Das hier ist verbackt.Weiß ich nicht, warum das auf 0% steht.Das funktioniert noch und das ist frisch gewechselt die Batterie.Die müsste eigentlich 90% haben.Keine Ahnung, das ist irgendwie verbackt, aber der Rest passt.Dann habe ich hier das, was wir zusammen programmiert haben im Stream.Der Heizchamp ist am Start.Heizung an aus.Temperatur, aktuelle Temperatursensor im Flur, der das ausliest.Dann habe ich Anzeige Fenster oben unten auf zu.Also sprich jetzt die Haustür auf zu, das Bad oben unten auf zu.Jetzt gibt es einen Wasserlieg im Keller.Ich kann quasi neues Wasser auffüllen per Knopfdruck im Keller.Da habe ich dieses Ventilding dran gemacht, was wir uns im Stream angeguckt haben.Ich habe mir noch eins gekauft.Also ich habe jetzt unten im Keller quasi das, was wir versucht haben im Stream, was nicht funktioniert hat.Jetzt kann ich quasi ein Ventil aufmachen mit so einem Drehmotor.Mit so einem Motor, der so was, der so eine, äh, was heißt denn?Valve auf Deutsch, so ein Ventil auf und zu macht.Dann kann ich Heizungsdruck auffüllen.Dann sehe ich die nächsten drei Tankstellen, was es da gerade kostet.Dann sehe ich Verbrauch vom Haus insgesamt, was gerade irgendwie auch ein bisschen der Kraft packt.Und dann habe ich für jeden Raum, der relevant ist, habe ich einen eigenen Tab.Das ist das Wohnzimmer.Das ist mein Arbeitszimmer.Das ist das Klo.Das ist die Küche.Das ist der Keller.Und das ist der Stall am Garten.Und hier ist die Übersicht für die ganzen Kameras.Was ist das für ein Ventil und wie liest du den Heizungsdruck aus?Ich lese den Heizungsdruck nicht aus.Ich habe eine Kamera an der Druckanzeige von der Heizung.Da kann ich einfach auf die Kamera gucken.Und wenn das dann quasi unter eins fällt, dann drücke ich hier einfach drauf.Und dann geht das Ventil im Keller auf und füllt Wasser nach.Ja.OCR und automatisch gibt es sogar fertige Sachen, aber ich habe kein Bock, das doppelt zu machen.Hast du für alles Bahntanken eine API oder Scrapes oder etwas selber?Die verwende, das ist in Home Assistant eingebaut.Also was ich hierfür verwende, ist Home Assistant mit Home Assistant.Schauen wir mal kurz Musik an.Home Assistant Tankerkönig.Home Assistant.So, das da.Das Home Assistant Tankerkönig, Erdon.Da kannst du deinen Wohnort angeben und der sucht dir dann die Tankstellen in der Nähe raus.Und zeigt dir das an.Wann das aktualisiert wurde, steht normalerweise noch drunter.Was es da gerade kostet.Das wollte ich jetzt gar nicht zeigen.Das Erdon brauchste.Und für die Bahn ist auch relativ einfach.Weil Home Assistant hat eine offizielle Bahn API Integration.Also sprich, da trage ich ein Abfahrt, Ort, Ankunft, Zielort und dann sagt dir die nächste Verbindung.Ja und das ist hier komplett selbst gebastelt mit der Heizung.So und ihr seht, ich habe hier alles doppelt und dreifach.Ich habe Z-Wave Sachen am Start.Ich habe ZigBee Sachen am Start.Ach ja, diese Anzeige bzw. die Daten für die Müllabfuhr.Das verwendet ein Erdon.Das kann ich euch mal zeigen.Das ist tatsächlich ganz praktisch.Das nennt sich.Ich mal kurz nachgucken.GitHub Waste Collection Home Assistant.Und Waste Collection Schedule.Ja und die Musik ist ein bisschen laut, oder?Ok, so ist besser.Ja, normalerweise stehen hier unten die Tage, wann das abgeholt wird.Da steht dann, keine Ahnung, Biotonne in zwei Tagen, Plastiktonne in vier Tagen und das in zwei Wochen und sowas.Und als Datengrundlage nimmt er das hier.Das ist tatsächlich relativ Big Prane gemacht.Ich muss gerade mal gucken, gibt es da noch Alternativen, wusste ich gar nicht.Ach ne, das ist ein Frontend.Das ist ein Frontend dafür, glaube.Oder?Ne, genau.Ich verwende das in Zusammenarbeit mit, ich glaube, Müllmax.Oder so.Zumindest sieht man hier, der hat für Germany ganz viele Provider, wo man abfragen kann, wenn man seinen Wohnort einträgt, wann die Müllabfuhr kommt.Das heißt, man muss sich da auch nie wieder drum kümmern.Das aktualisiert sich quasi am 31.12.Aktualisiert sich das automatisch auf den Müllkalender für nächstes Jahr.Ja, du kannst es auch bei ICS-Datei machen, wenn du dir den Kalender runterlädst, aber du kriegst so gut wie ganz Deutschland hiermit irgendwie abgefackelt.Weil das hier sind ja so Meta-Dinger, die für verschiedene Orte gehen.Dann nicht? Okay, Pech.RIP.Ja, so schaut mein Homocysten aus.So, gucken wir mal sein Video weiter.Das speichere ich mir mal kurz hier, weil das interessiert bestimmt noch mehr ab und zu mal.So, was kommt als nächstes? Other Stuff. Ja, juckt mir nicht.Okay, OS. Was hat er? Ubuntu!Äh, wo hab ich's denn?Warum? Ubuntu bin ich auch voll und ganz dafür.Ubuntu ist das einfach, ja, seh ich auch so.Ja, genau. Deswegen mach ich das auch so.So mach ich das auch so. Deswegen mach ich das auch so.Wie gesagt, ich hab auch mein Ubuntu-Server und einfach dann da drauf eine VM für meine Smart-Home-Geschichte und ein paar Container für den Rest. Fertig, aus, Schluss.Okay, das hab ich nicht. Das hab ich nicht, weil, wozu auch? Ich hab nur eine große 12TB Festplatte dran, da muss ich nix merken.Oh, 10G, Pog. Pog. Pog. 10G.Okay, brauch ich nicht, weil ich hab nur eine 12TB Platte und ich hab da noch zusätzlich über USB einfach eine Platte dran, wo ich einen R-Sync mach, einmal die Nacht.Das ist zwar absolut Ghetto im Vergleich zu den coolen Sachen, die du heutzutage machen kannst, aber es ist easy as fuck und es funktioniert.Das ist tatsächlich ganz praktisch. Ich hab auch die meisten Sachen. Ich hab ein größeres Docker-Compose-File und da ist eigentlich alles mehr oder weniger drin.... und dann back up my persistent storage folder to the hard drive array weekly.Next time I set up my server, I just have to copy the persistent storage folder back and launch Docker containers again.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.... and that wasn't some kind of a zero-day issue or hidden exploit.all of your public web-services that already support...Ja gut, public web-services geb ich ihm ja voll und ganz recht,aber ich hab ja keine public web-services für mein Smart-Home und solche internen Geschichten....for two-factor authentication such as Nextcloud or Bitwarden,but if you're especially paranoid about unauthorized access to your services,you should definitely take a look.One other thing that you could do for your security and privacyis using a Cloudflare proxy for your web-services.If you're hosting public-facing services from home,you don't necessarily want everyone to...Also, ich würde gar keine public-facing services at home hosten.Das ist das Erste.Aber eine Cloudflare DNS oder generell eine Domain und eine passende DNS dafür,den man benutzen kann für Zertifikate, ist tatsächlich sehr praktisch.Ich hab mir auch ein paar Domains registriert und eine davon verwende ich für daheim.Und ich hab's einfach so eingestellt, dass mein Router......diese Domain prinzipiell Wildcard, also alles, was zu dieser Domain gehört,bei mir auf meine 2hE Serverkiste weiterleitet anstatt ins Internet.Im Internet lösen die Dinger auch gar nicht auf.Und ich benutze die Domain, das ist eine ganz normale public-auflösbare Domain.Also, die gibt's.Das ist also ganz normal offiziell registrierte Domain.Und die DNS benutze ich, um Let's Encrypt-Zertifikate zu generieren.Also sprich, ich hab für alle meine internen Servicesdadurch gültige Let's Encrypt-Zertifikate, was ich äußerst praktisch finde.Und ohne sich irgendwie den Bein auszureißen.Weil Let's Encrypt ist easy as fuck.Selbstgebaute Zertifikate und CA ist halt painstamp.Das musst du dann überall installieren.Und manche Browser mögen das mittlerweile auch gar nicht mehr.Deswegen einfach Let's Encrypt nur gut ist.Ja, Moment, die proxien das.Also ich würde einfach generell nie Public Services daheim hosten.Und wenn, dann nur hinter einem VPN, fertig.Da kann eigentlich nicht viel passieren.Das hab ich, also mein VPN hab ich damals sogar anders gelöst.Ich hab mir keinen Dynamisch-DNS-Eintrag gemacht.Ich hab mir damals einen 2-Euro-Server gemietet bei irgendeinem Hoster.Und hab per Auto-SSH ne Port-Forwarding gemacht auf meinen VPN-Eingang.Ich glaub das ist nicht die schönste Variante, aber da bin ich um Dynamic-DNS rumgekommendamals.Da hatte ich quasi nen Public Server, der mich auf mein SSH-Intern weitergeleitet hat.Auf mein VPN-Geld bei intern weitergeleitet hat.Wo würdest du dann zum Beispiel am eigenen Nextcloud hosten?Lokal, bei mir auf irgendeiner Kiste.Es sei denn, du hast wirklich den Anspruch, dass du Public-erreichbare Links sharen willstzu deiner Nextcloud, dann musst du es irgendwie von extern erreichbar machen.Aber dann würd ich tatsächlich mir überlegen, ob ich nicht zwei aufsetze, eine im Internetfür alles was Public geshared werden soll und eine für mein internes wichtiges Zeug.Ich würde meine Nextcloud nie ins Internet stellen.Ich weiß, das machen einige, aber ich bin da absolut kein Fan von.Und man hat gesehen, wie einfach sowas zu knacken ist, spätestens ein Log4j.Gut, Nextcloud ist PHP, die hatten das Problem nicht, aber das kann da genauso passieren.Ja, und wenn du dann, also wenn du wirklich für irgendwie Public, um Sachen zu sharen,was weiß ich, stell dir, wenn man sich vorstellt, du bist Fotograf und willst den Leuten überdeine Nextcloud die Bilder sharen, einfach nur mal irgendwas eingebrochen, dann musstdu das externe irgendwie hosten.Da kannst du zum Beispiel mal Ausrufezeichen Hetzer in den Chat eingeben und da kannstdu dir 21€ Startgutschein sichern für Hetzercloud, da kannst du dir dann einen Server mietenund da dann Zeug drauf installieren, aber da würde ich dann keine privaten Sachen draufschmeißen.Ich habe zwei Sachen, ich habe Porkbun, das ist so der billigste, schlechteste Domainregistrat,das es gibt und dann habe ich Namecheap, also keqw-services läuft über Namecheap, vonhand,ganz ehrlich, das kann man, wenn man eine Kiste daheim hat, auch heutzutage ohne Problemeimmer noch so machen.Für, ich sag mal reproduzierbare und vor allem nachvollziehbare Sachen nach 1-2 Jahren,wenn man sich dann selbst fragt, was habe ich denn da eigentlich gemacht, ist so eineAnsible-Config gar nicht mal so blöd.Weil darin ist dann quasi automatisch der Aufbau automatisiert und du kannst nachgucken,was du gemacht hast.Das ist gar nicht so blöd, auch wenn es erstmal wie Overkill wirkt, weil du richtest deinServer eigentlich nur einmal ein, aber allein schon, dass du nachgucken kannst in einemJahr oder zwei nochmal, was hast du da eigentlich gemacht, ist so eine Ansible-Playbook vielleichtgar nicht so schlecht.Reuen Freigast, danke für den Sub, several weeks ist vielleicht ein bisschen übertrieben.Passwort-Manager, ich habe Keypass seit Ewigkeiten.Dry-Failure, Natural Disasters, und einfach einfach in deiner Installation über Reparatur arbeiten.Das passiert mit den besten von uns.Und nebenbei, ich weiß nicht von euch, aber nachdem ich Linux auf dem Server installiert und es für ein bisschen Zeit benutze,fühlt es sich irgendwie... dreckig an.Ich weiß nicht mehr, was da drin ist, und ich habe keine Kontrolle über es.Also habe ich immer die Möglichkeit, es zu reinstallieren, es zu machen, es zu öffnen und besser zu machen.Es gibt auch noch ein Problem.Wenn ich eine neue Linux-Maschine setze, komme ich persönlich an Probleme, die nicht so einfach zu diagnostizieren sind.Aber wenn ich sie löse, vergesse ich sofort, wie ich es gemacht habe.Also die nächste Zeit, wenn ich sie reinstalle, bekomme ich wieder die gleichen Probleme und muss wieder durch den ganzen Problem-Prozess gehen.Und ich denke, ich habe einen Weg gefunden, um meinen Server in einem cleanerer, weniger verabschiedeten, besseren Weg zu setzen.Es heißt Infrastruktur als Kode.Infrastruktur als Kode ist eine Philosophie der Managung von Konfigurationen...Ja, im Prinzip sowas wie Ansible.Ahem.Ich gehe schon mal von aus.Was hat er?Ansible, sag ich doch!Was sonst?Ich bin echt froh, dass sich Ansible aus dieser ganzen Masse so ein bisschen abgehoben und durchgesetzt hat.Weil ganz ehrlich Puppet, also wir haben auf der Arbeit relativ viel Puppet oder auch Chef ist ja auch so ein Ding, das haben wir aber nicht.Das gibt es ja schon richtig lange.Oder auch CF Engine, das war ja so der Vorreiter der Sache, falls sich das irgendjemand mal angeguckt hat.Ich finde von allen diesen Lösungen, die es da gibt, ist Ansible immer noch die angenehmste.Keine Frage für mich.Eine sehr wichtige Frage.Wie ist Ansible besser, als nur mit einem Bash Script den Installationprozess zu automatisieren?Natürlich gibt es viele Ausgaben, für die Ansible kein Gehirn ist und ein Shellscript zu verwenden wäre verrückend.Aber Ansible für eine Single-Home-Server zu verwenden, scheint ein bisschen überwältigend, oder?Nachher, Dinge wie umsetzten, die Anwendung von Hard Drives zu montieren oder Packages zu installieren, können definitiv durch ein Shellscript erreicht werden, oder?Also, warum Ansible?Also, wir beginnen mit Item Potency.Item Potency ist die Möglichkeit, ein Programm mehrmals zu runnen und den gleichen Result zu produzieren, egal welches System der Situation ist.Hier ist ein sehr einfaches Beispiel.Lass uns ein Folder mit mkdir kreieren.Wie du siehst, funktioniert es einmal wie erwartet, das Folder wird kreiert.Aber wenn wir es wieder runnen, bekommen wir einen Error, weil das Folder bereits existiert ist.Jedoch, wenn wir das Dash-P-Flag in die Anwendung geben, sehen wir keinen Error.Also nun ist die Anwendung Item Potent.Jedoch, in anderen Fällen könnte es nicht so einfach sein.Zum Beispiel werden einige Package-Manager, wenn du einen Package installierst, schon installiert.Und in einigen anderen Fällen, musst du Error-Konditionen, If-Loups, und so weiter und so fort.Jedoch, mit Ansible ist das Item Potency gebacken.Ansible hat ja schon alles programmiert für einen....unser System, unless es noch eine Veränderung gibt.Hahahaha.Das ist nicht schlecht.Was ist die Mischung von Terraform und Ansible? Terrible.Das stimmt.Wer gestern oder wann war das vorgestern im Stream dabei war,da haben wir selbst wieder ein bisschen Ansible Zeug gebastelt.Das ist einfach praktisch.Und zumal, wenn man damit beispielsweise Cloud-Server aufsetzt,wie wir schon öfters im Stream gemacht haben,du brauchst halt nur kleine Anpassungen und kannst immer wieder das benutzen.Du musst dir gar keine großartigen Gedanken mehr machen.Nimmst deinen Ansible-Skript, editierst den Namen vom Service-File,editierst drei Sachen, führst aus, gut ist.Guck mal letztens vor zwei Streams, wie einfach wir...Kannst du noch mal zeigen? Mach das jetzt einfach auf.Ich zitiere mich jetzt einfach mal selbst,wie einfach wir hier was deployed haben auf der Linux-Kiste.Guck mal.Hier.War relativ am Anfang.Hier, guck mal.Das ist alles, was wir machen mussten.Wir haben das Create.Da ist der Chat ein bisschen im Weg jetzt, natürlich blöd.Hat jetzt keiner gesehen.Wir führen einfach nur aus, Server erstellenund danach lassen wir das Ansible-Playbook laufen.Und wenn ich das ausführe, dann ist der Server einfach gleich da.Jetzt weiß ich auch, warum manchmal Leute auf einmal nix mehr schreiben.Das ist, weil die sehen wollen, was ich im Terminal habe.Vielleicht soll ich den Chat irgendwie anders platzieren bei sowas.Guck.Server aufgebaut, Server erstellt sich automatisch und jetzt...Max, schalt mal zurück.Und jetzt wartet er 20 Sekunden, dass der Server oben ist.Rechts oben könnte man den Chat machen, ja.Muss man mal gucken.So, und guck.Jetzt läuft der komplette Aufbau des Systems durch.Der macht...Ach, jetzt gucken wir gar nicht zu.Jetzt mache ich irgendwelche Musikstelles anstatt während der Aufbau.Ja, aber guck.Der Server baut jetzt auf, Updating Packages, Updated Things, Installiert Packages, so unddas alles mit einem Ansible-File, was eigentlich schon mehr oder weniger fertig war.Und du, jetzt machst Forward-File.auf ziemlich all die großen Linux-Distros.Dank an Modulen wie Package und Servicekönnen Ansible Playbooks auch auf eine große Variante von Linux- und BSD-basierten Distros verwendet werden,da viele Modul sind distro-agnostik.So jetzt, dass ich dich auf die ganze Ansible-Tippe gekauft habe,zeige ich dir das Ansible-Playbook, das ich geschrieben habe, um meinen Serum zu setzten,und zeige dir ein paar Tricks, die ich verwendet habe, um mein Leben einfacher zu machen.Also hier ist mein Playbook.Ich weiß, dass es ziemlich komisch sein kann, wenn du nie mit Ansible verhandelt hast,das rösten wir uns jetzt nicht angucken, aber ich finde es schön zu sehen,dass man da jetzt wieder erkennt, dass es halt auch für einen Serverinsofern sinnvoll ist, wenn ich nach zwei Jahren nachgucken will, was hast du da eigentlich gemacht,oder wo hast du das jetzt hingelegt,du guckst in dein Ansible-Playbook und du weißt halt gleich, was Sache ist.Also das erste, was man machen muss, ist, wenn man sein Bootsektor kaputt machen will,dd if=\"def0\", of=\"def-sa\", bs=\"4k\", count=\"1\".So, und dann ist der Bootsektor weg.Ja gut, das ist jetzt ja noch gültig bei seinem lokalen Setup.Ja.Gut, das kann man machen, wobei ich sagen muss,das finde ich fast schon für einen lokalen Server dann wirklich zu viel des Guten,weil ich meine, braucht man wirklich ein automatisches Setup für einen Server?Den installierst du ja nie neu.Den installierst du höchstens neu, wenn dir die System-SSD verreckt.Ich weiß nicht, ob das so sinnig ist.Das ist gut, Default Port 69.Das gefällt mir.Das gefällt mir, ja.Ja, haben wir schon geguckt.Wo passen?Bin ich auch.Also ich finde das sinnvoll, gerade, dass du nachgucken kannst, auch noch mal nach zwei,drei Jahren, was hast du denn gemacht?Ähm, ich glaube, letzte Woche haben wir das geguckt, Chat, aber dieses Setup an sich,ich weiß nicht, ob man das jetzt braucht.Jetzt wissen wir Bescheid.Ups, das habe ich dazu gemacht.Half-Life 2 League, oh nee, da kann ich mich noch dran erinnern.Da hat man rausbekommen im Half-Life 2 League, dass vieles von den Sachen, was angeblichAI war, auch nur gescriptet war und sowas.Gucken, was uns YouTube noch vorschlägt.Eso juckt mich so überhaupt gar nicht.Singleplayer, MMOs, Lull.Das Teleskop startet doch jetzt irgendwann, oder?Das ist doch jetzt irgendwann demnächst.Zwei Stunden, Leute.CS, Monka, Monka, Launch.Gucke ich mir nachher an, wie es lau-, wie es launcht.Es sind zwei Stunden, bedeutet 13.20.Das sieht nicht nach einer SpaceX-Rakete aus, oder?Wo starten die denn?Französisch Guiana, oder irgendwie sowas mit der?Sitzt denn da Mensch drinnen, nö?Wie findest du das Spiel, ready or not?Sagt mir nix.Ach, ist das diese, ähm, Tactical-Polizei-Einsatz-Stell-Geschichte?Ja, das hat ziemlich gute Bewertung, das habe ich auch schon gesehen auf Steam, aber ichkaufe mir prinzipiell keine Spiele, die Early Access sind.Ne, wir schauen den Launch nicht im Stream, weil ich gehe gleich auf und dann Mittagessen.Ja, ich kaufe mir keine, es soll wirklich gut sein, aber ich kaufe mir keine Early AccessSpiele.Hat jemand eine Idee, ich frage jetzt wirklich, ich weiß, ich hab keine Ahnung, hat jemandeine Idee oder eine Vorstellung davon, wie viele der Early Access Spiele, also wie vieleder Anteil der Spiele, die als Early Access auf Steam rauskommen, jemals Early Accessüberhaupt verlassen und voll released werden?Also ich würde drauf tippen, vielleicht 20%, was würdet ihr sagen?Wie viele Spiele verlassen, 69%, wie viele Spiele verlassen Early Access wieder?QSC, kein Plastenschimmer.Only 25%, das war schon mit 20% gar nicht so schlecht und ich dachte auch schon 20% sindrelativ hoch, ich hatte auch gedacht wahrscheinlich eher unter 10%, weil ich meine es gibt soviel Bullshit und das meiste davon ist auch noch Early Access, ja gucken wir uns dann,also wir nicht zusammen, gucke ich mir dann um 13 Uhr gucke ich mir das an, wie gestartetwird.So Starts können ja immer noch mal relativ kurzfristig abgesagt werden, wenn zu schlechteWetterbedingungen oder sonst was.Hat das Video einen Chat, ja, es gibt aber mehrere Videos, Europa fahrt runter, was solldas nicht fährt runter heißen, Europa fahrt runter, was ist das für ein Satz?Kostespare, die Schwaben wieder am Start, GTX 660 TI, ja aktuell kannst du alles gutverkaufen, was eine Grafikkarte drin hat.Leute ich glaube am 31.12. sind die Tage für den Preischamp gezählt, ich glaube dann schalteich das ab, ok Leute ich gehe jetzt was essen, schön dass ihr kurzfristig dabei gewesenseid, Runde geschwätzt, morgen gibt es wieder Aufwachen Stream, weil morgen ist ja Sonntag,der Preischamp, keine Ahnung, ein Jahr oder so, ich habe da einen Twitter Post gemacht,ja ungefähr ein Jahr, das ist doch in Ordnung, der Preischamp hat da auch ein Changelog, gucktdas letzte Mal was gemacht, habe ich am 1.2.0, bester Changelog Eintrag ist immer noch addedChangelog, ok Leute wir sehen uns bis dann, machts gut, see you.", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Das war's für heute."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 3, "start": 64.0, "end": 66.0, "text": "Bis zum nächsten Mal."}, {"id": 4, "start": 66.0, "end": 94.0, "text": "Das war's für heute."}, {"id": 5, "start": 94.0, "end": 96.0, "text": "Das war's für heute."}, {"id": 6, "start": 96.0, "end": 98.0, "text": "Bis zum nächsten Mal."}, {"id": 7, "start": 98.0, "end": 100.0, "text": "Das war's für heute."}, {"id": 8, "start": 100.0, "end": 102.0, "text": "Bis zum ersten Mal."}, {"id": 9, "start": 102.0, "end": 104.0, "text": "Igitt."}, {"id": 10, "start": 104.0, "end": 106.0, "text": "Dass war's für heute."}, {"id": 11, "start": 106.0, "end": 108.0, "text": "Bis zum nächsten Mal."}, {"id": 12, "start": 108.0, "end": 110.0, "text": "Dass war's für heute."}, {"id": 13, "start": 110.0, "end": 112.0, "text": "Bis zum zweiten Mal."}, {"id": 14, "start": 112.0, "end": 114.0, "text": "Bis zum bleiben."}, {"id": 15, "start": 114.0, "end": 116.0, "text": "Bis zum strategies."}, {"id": 16, "start": 116.0, "end": 118.0, "text": "algorithm feel"}, {"id": 17, "start": 118.0, "end": 120.16, "text": "Management"}, {"id": 18, "start": 120.16, "end": 122.16, "text": "Design"}, {"id": 19, "start": 122.16, "end": 138.72, "text": "So Leute, ich hab gedacht wir machen heute mal einen außer der Reihe eingeschobenen"}, {"id": 20, "start": 138.72, "end": 139.72, "text": "Aufwachstream."}, {"id": 21, "start": 139.72, "end": 143.72, "text": "Aber ich weiß nicht wie lang genau."}, {"id": 22, "start": 143.72, "end": 149.36, "text": "Mal gucken."}, {"id": 23, "start": 149.36, "end": 153.76, "text": "Es ist relativ früh."}, {"id": 24, "start": 153.76, "end": 158.56, "text": "Das heißt es geht ja wahrscheinlich jetzt schon noch ein bisschen."}, {"id": 25, "start": 158.56, "end": 163.96, "text": "Aber ich kann jetzt nicht den halben Tag streamen, sondern auch wenn heute Feiertag ist."}, {"id": 26, "start": 163.96, "end": 166.0, "text": "So ich muss erstmal kurz was trinken."}, {"id": 27, "start": 166.0, "end": 175.0, "text": "Wir sind noch voll gefuttert von gestern."}, {"id": 28, "start": 175.0, "end": 180.4, "text": "Ich hab ja gestern Abend massig Sushi gefuttert und Zeug."}, {"id": 29, "start": 180.4, "end": 183.08, "text": "Ich musste heute Nacht um 3 aufs Klo."}, {"id": 30, "start": 183.08, "end": 185.44, "text": "Das ist voll draus."}, {"id": 31, "start": 185.44, "end": 188.72, "text": "Ich hab die Katze komplett verwirrt."}, {"id": 32, "start": 188.72, "end": 191.8, "text": "So nach dem Motto was macht der Kerl um 3 Uhr nachts auf dem Klo."}, {"id": 33, "start": 191.8, "end": 193.88, "text": "Die hat danach keine Ruhe gegeben."}, {"id": 34, "start": 193.88, "end": 196.76, "text": "Die war alle 5 Minuten an der Tür und hat gesagt jetzt mach auf."}, {"id": 35, "start": 196.76, "end": 197.76, "text": "Es ist aufstehen hier."}, {"id": 36, "start": 197.76, "end": 198.76, "text": "Komm."}, {"id": 37, "start": 198.76, "end": 201.64, "text": "Moin Michael 50 spiel hier an."}, {"id": 38, "start": 201.64, "end": 231.12, "text": "So kurz noch mal meinen Tee leertrinken."}, {"id": 39, "start": 231.12, "end": 233.36, "text": "Dann gucken wir uns ein bisschen was an."}, {"id": 40, "start": 233.36, "end": 238.6, "text": "Eigentlich ist es noch zu früh zum aufwachen."}, {"id": 41, "start": 238.6, "end": 255.8, "text": "Du hast Werbung."}, {"id": 42, "start": 255.8, "end": 260.92, "text": "Nein da bringt es Subscriber, mein Subscriber ist natürlich immer gut, aber das bringt"}, {"id": 43, "start": 260.92, "end": 261.92, "text": "dir auch nix."}, {"id": 44, "start": 261.92, "end": 262.92, "text": "Oder?"}, {"id": 45, "start": 262.92, "end": 268.68, "text": "Oder sieht man keine Werbung mehr auf Channels wo man subscribt hat."}, {"id": 46, "start": 268.68, "end": 274.24, "text": "Das Kamillentee, nix ausgefallenes heute."}, {"id": 47, "start": 274.24, "end": 282.08, "text": "Richtig Pfeifer, 25 Monate Hyper Subscription hier."}, {"id": 48, "start": 282.08, "end": 309.92, "text": "Oder besser gesagt, Regen, noch nix, mit Subscription hat man keine Werbung tatsächlich."}, {"id": 49, "start": 309.92, "end": 318.88, "text": "Aha, siehst du mal wusste ich gar nicht, zählt das auch für Prime Subscription?"}, {"id": 50, "start": 318.88, "end": 327.68, "text": "Es ist eh so, Prime Subscription war eines der besten Ideen überhaupt, die sie auf Twitch"}, {"id": 51, "start": 327.68, "end": 328.68, "text": "eingeführt haben."}, {"id": 52, "start": 328.68, "end": 335.2, "text": "Ich glaube dadurch haben sich die Subscriberzahlen nicht nur verdoppelt, sondern teilweise verdreifacht"}, {"id": 53, "start": 335.2, "end": 345.64, "text": "bei manchen Leuten, GIF Emotes sind auch top, GIF Emotes sind Poggers, da kann man nämlich"}, {"id": 54, "start": 345.64, "end": 355.08, "text": "zum Beispiel dann sowas machen wie, was haben wir denn hier für GIFs, zum Beispiel das"}, {"id": 55, "start": 355.08, "end": 366.0, "text": "Adressen unser."}, {"id": 56, "start": 366.0, "end": 383.28, "text": "Was empfiehlt uns YouTube denn heute Schönes?"}, {"id": 57, "start": 383.28, "end": 391.04, "text": "Clownfield 2042, Prepare your wallets, ja das haben wir schon gesehen auf Steam."}, {"id": 58, "start": 391.04, "end": 397.52, "text": "Von der Grafik her sieht es aus, als hätten die Crunker Leute ein Battlefield gemacht."}, {"id": 59, "start": 397.52, "end": 416.72, "text": "Nas 2.0, was macht er da mit Nas 1.0? Kommt es in Müll? Du meinst das hier? Ja das gucken wir uns auch noch an."}, {"id": 60, "start": 428.08, "end": 436.48, "text": "Wisst ihr was ich nicht verstehe? Die haben doch gesagt, oder was heißt die? Der Creator von"}, {"id": 61, "start": 436.48, "end": 442.56, "text": "Battlefield Friends, die haben doch großartig angekündigt vor Battlefield 2042, so nach dem"}, {"id": 62, "start": 442.56, "end": 450.64, "text": "Motto Battlefield Friends Return. Und bisher ist es einfach nur ein Rerun der alten Staffel."}, {"id": 63, "start": 450.64, "end": 467.2, "text": "Also gibt es jetzt gar kein neues Battlefield Friends mehr? Oder wie ist das? Ich könnte es"}, {"id": 64, "start": 467.2, "end": 484.24, "text": "ihm nicht verübeln, zu sagen nach dem Kack-Launch, Scheiß drauf. Aber ich frag mich halt was geplant war."}, {"id": 65, "start": 484.24, "end": 490.48, "text": "Du hast dir 4x12TB gekauft, weißt gar nicht was du damit machen sollst. Ja, Linux ISUS LAN, genau,"}, {"id": 66, "start": 490.48, "end": 499.52, "text": "Torrent, Torrent Linux ISUS. Was anderes macht man über Torrent ja auch nicht. Alternativ kannst du"}, {"id": 67, "start": 499.52, "end": 528.96, "text": "auch Sicherheitskopien speichern."}, {"id": 68, "start": 528.96, "end": 536.48, "text": "Ich habe auch letztens ein PC am Straßenrand gefunden, da hätte ich auch ein Video darüber"}, {"id": 69, "start": 536.48, "end": 545.52, "text": "machen müssen. Du glaubst nicht was als nächstes geschieht. Einsamer PC am Straßenrand. Du glaubst"}, {"id": 70, "start": 545.52, "end": 556.48, "text": "nicht was als nächstes geschieht. Gone wrong, gone sexual. Irgendwie sowas in der Richtung. Aber"}, {"id": 71, "start": 556.48, "end": 561.6, "text": "ich habe es einfach stehen lassen, weil ich keinen Dreck mit heimnehmen wollte."}, {"id": 72, "start": 561.6, "end": 584.04, "text": "Das war noch IDE-Festplatten drin. Das haben wir doch. Das gucken wir uns an. Das ist die umgedrehte"}, {"id": 73, "start": 584.04, "end": 590.36, "text": "Variante, die wir zu dem was wir vorhin gesehen haben. Aber ich glaube nicht, dass der Motor in"}, {"id": 74, "start": 590.36, "end": 605.32, "text": "der Lage ist das zu spinnen. Groter Pfeil mit Thumbnail. Ja, natürlich, natürlich. Das muss"}, {"id": 75, "start": 605.32, "end": 629.04, "text": "schon sein. Die Leute haben einfach keine Ahnung. Die schmeißen ihre PCs weg. Vielleicht legen sie"}, {"id": 76, "start": 629.04, "end": 634.32, "text": "vorher noch ihren Ordner in Papierkorb oder so und sagen jetzt ist alles gelöscht. Jetzt kann das,"}, {"id": 77, "start": 634.32, "end": 645.12, "text": "jetzt kann das. Niemand wieder her. Was habe ich da jetzt eigentlich gelöscht? Andu. Wagt"}, {"id": 78, "start": 645.12, "end": 651.52, "text": "es nicht normalerweise, ob man das in Papierkorb schieben will? Windows, oh, oh. Ich habe das"}, {"id": 79, "start": 651.52, "end": 666.12, "text": "Meme-Board gelöscht, Leute. Das sollte ich vielleicht besser, das sollte ich vielleicht besser dalassen."}, {"id": 80, "start": 666.12, "end": 687.0, "text": "Fastest First Person Drone View. Excellent. Okay, das sieht nicht sonderlich spektakulär aus."}, {"id": 81, "start": 687.0, "end": 693.76, "text": "Seht ihr mal, wenn es wirklich schnell gehen muss, ohne Lack, was machen sie? Analoge Video"}, {"id": 82, "start": 693.76, "end": 714.16, "text": "Übertragung Old School. Low res analoges Video. Da wird nichts encoded. Da wird nichts irgendwie 60"}, {"id": 83, "start": 714.16, "end": 725.2, "text": "FPS, 4K, voll HD. Da wird analog Video gemacht. So muss das sein. Ey, das dieses hat, das könnte"}, {"id": 84, "start": 725.2, "end": 736.16, "text": "aus irgendeinem billigen Game sein. Moment, Moment, was ist mit denen los? Habt ihr es gesehen? Die"}, {"id": 85, "start": 736.16, "end": 743.08, "text": "Anzeige ist in Meter. Wo kommen wir dann dahin? Warum ist die Anzeige nicht in Feed oder in"}, {"id": 86, "start": 743.08, "end": 753.08, "text": "Ounces oder in Miles? Warum Meter? Vielleicht sind es auch Miles. Man weiß ja nicht, M."}, {"id": 87, "start": 753.08, "end": 763.8, "text": "Ja, die Amis haben doch so komische Einheiten. Warum auch immer noch die das haben? Ich weiß"}, {"id": 88, "start": 763.8, "end": 772.68, "text": "nicht, so genau. What's on my home server? Oder Wolfgang erklärt uns das jetzt. So ein Video sollte"}, {"id": 89, "start": 772.68, "end": 779.52, "text": "ich auch machen. Das kommt, glaube ich, gut an. Das ist eine gute Idee. Was ist auf meinem"}, {"id": 90, "start": 779.52, "end": 789.48, "text": "Home Server? Da mach ich ein Video zu. Länge in Ounces messen, das ist kein Problem. Bei den Amis geht das."}, {"id": 91, "start": 789.48, "end": 807.2, "text": "Ist doch wieder irgendwas zusammengeschnitten ist, oder? Muss er nicht ins Gefängnis oder was ist"}, {"id": 92, "start": 807.2, "end": 829.76, "text": "denn da jetzt eigentlich rausgekommen? Anspannung vor Weihnachten. Ich habe keine VR Filmchen. Ich"}, {"id": 93, "start": 829.76, "end": 843.28, "text": "habe generell auf meiner Platte quasi Backups liegen und sonst fast nichts. Und die Backups"}, {"id": 94, "start": 843.28, "end": 857.4, "text": "mache ich nicht mal richtig regelmäßig, aber ich bin froh, dass ich sie habe. Ich mache meistens"}, {"id": 95, "start": 857.4, "end": 862.8, "text": "Backups, wenn ich irgendwas Wichtiges gemacht habe und mir denke, so okay, jetzt wird es mal"}, {"id": 96, "start": 862.8, "end": 873.12, "text": "Zeit. Jetzt, jetzt könntest du mal wieder ein Backup machen. Stirb langsam eins. Gab es das"}, {"id": 97, "start": 873.12, "end": 890.04, "text": "gestern mal wieder? Finde ich es immer noch nice. 3D Druckerempfehlung. Kommt auf den Preis an."}, {"id": 98, "start": 890.04, "end": 902.36, "text": "Wenn der Preis egal ist, dann kauft ihr einen von denen. Die sind richtig nice, aber teuer. Moment,"}, {"id": 99, "start": 902.36, "end": 914.0, "text": "das Dark Reader macht es kaputt. Oh, meine Augen, Alter. Die Dinger sind halt richtig nice von"}, {"id": 100, "start": 914.0, "end": 943.12, "text": "dem, aber ein bisschen teuer. Die Dinger sind ganz gut, aber teuer. Ansonsten gibt es auch"}, {"id": 101, "start": 943.12, "end": 953.32, "text": "ganz viele Möglichkeiten. Aber ich bin nicht mehr so richtig drin, was diese 3D Drucker"}, {"id": 102, "start": 953.32, "end": 958.04, "text": "Sachen angeht. Ich habe mir vor einer Weile ja auch ein i3 Mega S gekauft, aber der ist"}, {"id": 103, "start": 958.04, "end": 962.72, "text": "jetzt auch schon alt, den würde ich mir jetzt wahrscheinlich nicht mehr kaufen. Aber seitdem"}, {"id": 104, "start": 962.72, "end": 965.32, "text": "habe ich mich nicht mehr mit beschäftigt. Wenn ich etwas ausdrucken muss, drücke ich"}, {"id": 105, "start": 965.32, "end": 975.48, "text": "etwas aus und ansonsten nicht. Wer hätte das gedacht? Das ist auch nicht so, dass man"}, {"id": 106, "start": 975.48, "end": 984.84, "text": "den so oft braucht. Also ich habe gedacht, ich benutze den 3D Drucker weniger als ich"}, {"id": 107, "start": 984.84, "end": 993.44, "text": "gedacht habe vor dem Kauf des 3D Druckers, dass ich ihn benutzen würde. Wo soll ich denn"}, {"id": 108, "start": 993.44, "end": 1019.24, "text": "wissen, was du willst? Keine Ahnung. Musst du wissen, was du trocken willst. K.E.5 Schrott."}, {"id": 109, "start": 1019.24, "end": 1041.44, "text": "Im Home Office mehr benutzen. Das habe ich nie miteinander in Verbindung gebracht. Also"}, {"id": 110, "start": 1041.44, "end": 1048.0, "text": "ich drücke ab und zu Gehäuse für irgendwelche Bastelgeschichten mit dem 3D Drucker. Ganz"}, {"id": 111, "start": 1048.0, "end": 1056.16, "text": "ganz selten mal irgendwelche Teile, die man sonst nicht bekommt. Ich habe beispielsweise"}, {"id": 112, "start": 1056.16, "end": 1065.24, "text": "ein Sieb gedruckt für unsere Regenrinne, weil die nicht so Standard ist vom Durchmesser"}, {"id": 113, "start": 1065.24, "end": 1084.48, "text": "her. Da habe ich etwas ausgemessen und ausgedruckt, dass nicht so viel Dreck durchschlüpft, aber"}, {"id": 114, "start": 1084.48, "end": 1098.44, "text": "das kommt nicht oft vor. Das kann man auch machen. 3D Drucker hat halt den Vorteil, dass"}, {"id": 115, "start": 1098.44, "end": 1103.24, "text": "du auch etwas komplexere Sachen relativ schnell ausdrucken kannst, wenn du nicht gerade der"}, {"id": 116, "start": 1103.24, "end": 1115.88, "text": "Probe bist, was Holz- und Metallbearbeitung angeht. 3D Drucken kann halt jeder. Und es"}, {"id": 117, "start": 1115.88, "end": 1121.0, "text": "geht meist wahrscheinlich sogar schneller. Und man muss sagen, 3D Drucker, wenn die richtig"}, {"id": 118, "start": 1121.0, "end": 1128.32, "text": "eingestellt sind, ist das Zeug echt präzise. Wichtig ist beim 3D Drucker, dass man den"}, {"id": 119, "start": 1128.32, "end": 1134.2, "text": "ersten Layer richtig einstellt. Also, dass die erste Schicht gut ist, sonst reißt es"}, {"id": 120, "start": 1134.2, "end": 1139.16, "text": "ab. Oder es stimmt von der Höhe nicht richtig, es passt am Ende nicht richtig. Der erste"}, {"id": 121, "start": 1139.16, "end": 1152.88, "text": "Layer ist fast das wichtigste, was es gibt beim 3D Drucker. Wie ihr habt keine CNC-Maschine"}, {"id": 122, "start": 1152.88, "end": 1156.88, "text": "zu Hause, da gibt es doch immer diese Videos. Da haben wir schon ein paar geguckt, so nach"}, {"id": 123, "start": 1156.88, "end": 1167.16, "text": "dem Motto, das ist ja nicht nur eine CNC, von Aliexpress, so cheap CNC-Laser-Gravierer"}, {"id": 124, "start": 1167.16, "end": 1173.72, "text": "und Dings von Aliexpress. Und das ist dann meistens sehr abenteuerlich. So nach dem"}, {"id": 125, "start": 1173.72, "end": 1181.52, "text": "Motto, Laser-Gravierer ohne jegliche Schutzausrüstung oder so, einfach mal falsch reingeguckt und"}, {"id": 126, "start": 1181.52, "end": 1191.6, "text": "Augen weg gelasert. Aber es ist halt Aliexpress-Standards, ja. Was haben die meisten drinne? Die haben"}, {"id": 127, "start": 1191.6, "end": 1199.2, "text": "am meisten einen CNC-Aufsatz, Laser-Gravierer-Aufsatz und irgendwie cutten kannst du damit auch"}, {"id": 128, "start": 1199.2, "end": 1209.8, "text": "noch oder so, keine Ahnung. Eigentlich ziemlicher Schrott von Aliexpress, aber gut. Zumal die"}, {"id": 129, "start": 1209.8, "end": 1213.24, "text": "meisten Leute sich das mit Laser-Gravierer wahrscheinlich so ähnlich vorstellen wie"}, {"id": 130, "start": 1213.24, "end": 1219.08, "text": "bei 3D Druckern, dass man das total oft verwendet. Aber man verwendet das irgendwie wenn es hochkommt"}, {"id": 131, "start": 1219.08, "end": 1227.44, "text": "einmal im Monat oder so. So Leute, was gucken wir uns jetzt an? What's on my home-Server?"}, {"id": 132, "start": 1227.44, "end": 1232.0, "text": "Ne, das ist jetzt, wir gucken uns jetzt, ich schieb mir mal einen Bom-Bom ins Hals, in"}, {"id": 133, "start": 1232.0, "end": 1257.96, "text": "Gachi-Base und dann gucken wir uns mal das LEGO-Video an. Fock. So, Zeitmaier. Requested LEGO-Experiments."}, {"id": 134, "start": 1257.96, "end": 1269.76, "text": "Now do one to Google and see how fast it spins. Ja, das dachte ich mir. Das dachte ich mir,"}, {"id": 135, "start": 1269.76, "end": 1273.04, "text": "dass es der Motor nicht drehen kann. Das ist das erste was ich gesagt habe, dass er es"}, {"id": 136, "start": 1273.04, "end": 1278.32, "text": "wirklich drehen kann. Zumal das ja noch nichtmal die fertige Übersetzung ist. Die fertige Übersetzung"}, {"id": 137, "start": 1278.32, "end": 1299.76, "text": "ist ja sonst wie riesig. Ja. What happens if you open the jar while spinning? MonkaS, was"}, {"id": 138, "start": 1299.76, "end": 1316.96, "text": "passiert? Was, was bin ich sehend? Dass sich der Reifen vom Rad löst oder was? Ja, gut."}, {"id": 139, "start": 1316.96, "end": 1324.92, "text": "Das klappt aber wahrscheinlich auch nur, wenn das relativ elastisch ist und das hier, das"}, {"id": 140, "start": 1324.92, "end": 1329.92, "text": "halt relativ elastisch ist und sich nach außen drückt. Dann ist dann halt ein bisschen, also"}, {"id": 141, "start": 1329.92, "end": 1334.24, "text": "es dreht sich schnell, dann drückt es das nach außen und dann hast du halt hier, weil"}, {"id": 142, "start": 1334.24, "end": 1349.92, "text": "es elastisch ist, hast du ein bisschen Luft dazwischen. Moment, ich dachte das geht jetzt"}, {"id": 143, "start": 1349.92, "end": 1357.68, "text": "um diese Geschichte hier am Anfang. Ne, gehts nicht. Jebaited, Alter! Dachte er zeigt uns"}, {"id": 144, "start": 1357.68, "end": 1369.8, "text": "jetzt wie hier Massive Huge Übersetzung angesagt ist. Richtig jebaited. Weil gerade einer sagt"}, {"id": 145, "start": 1369.8, "end": 1380.12, "text": "Speedrun, wir können uns jetzt angucken. Das ist ja auch ein leicht misleading Intro-Bild."}, {"id": 146, "start": 1380.12, "end": 1385.24, "text": "How Speedrunners Warp Straight Up to the Moon in Majora's Mask. Können wir uns jetzt angucken."}, {"id": 147, "start": 1385.24, "end": 1392.24, "text": "Da müssen wir bescheiden. Viertelstunde. Bam. Oh, das ist viel zu leise."}, {"id": 148, "start": 1392.24, "end": 1407.42, "text": "Die Majora's Mask Speedruns waren ja an sich nie sonderlich geschwind, weil du musstest"}, {"id": 149, "start": 1407.42, "end": 1422.0, "text": "immer halb durch das Game durch. Huge Graphics. Huge N64 Graphics. Das ist laut genug. Ich"}, {"id": 150, "start": 1422.0, "end": 1430.32, "text": "hatte übelst übelst Schiss, wie ich klein war bei Majora's Mask. Kann das sein, dass"}, {"id": 151, "start": 1430.32, "end": 1436.88, "text": "das N64, fällt mir jetzt gerade so im Nachhinein auf, kann das sein, dass das mit N64 die einzige"}, {"id": 152, "start": 1436.88, "end": 1450.0, "text": "Plattform ist, die jemals zwei Haupt-Zelda-Titel bekommen hat? Also, der Super Nintendo hat"}, {"id": 153, "start": 1450.0, "end": 1456.12, "text": "nur A Link to the Past bekommen. Der N64 hat Ocarina of Time und Majora's Mask bekommen."}, {"id": 154, "start": 1456.12, "end": 1464.36, "text": "Der Gamecube hat nur, und das ist auch ziemlich am Ende seiner, ne, der Gamecube, ja. Ja,"}, {"id": 155, "start": 1464.36, "end": 1469.16, "text": "das zählt natürlich. Der Gamecube, der hatte ganz am Anfang Wind Waker und am Ende seiner"}, {"id": 156, "start": 1469.16, "end": 1477.88, "text": "Leiter hatte er noch Twilight Princess gekriegt. Und die Wii hatte Twilight Princess und dann"}, {"id": 157, "start": 1477.88, "end": 1483.88, "text": "tatsächlich Skyward Sword. Ne, stimmt nicht, was ich gesagt habe. Was hatte denn die Wii"}, {"id": 158, "start": 1483.88, "end": 1491.32, "text": "U? Ah, die Wii U hat noch, hat noch Dings bekommen. Breath of the Wild zum Schluss,"}, {"id": 159, "start": 1491.32, "end": 1499.04, "text": "ne. Ne, dann stimmt das nicht. Aber wie gesagt, ich hatte ja damals das Glück, ich hatte"}, {"id": 160, "start": 1499.04, "end": 1505.84, "text": "ein N64, ich musste mir dafür extra so einen Memory Pack, weil man ist sicher, wie das"}, {"id": 161, "start": 1505.84, "end": 1511.0, "text": "Ding hieß. Ich glaub, da hatte der N64 entweder 4 oder 8 MB RAM danach. Dann konnte ich Majora's"}, {"id": 162, "start": 1511.0, "end": 1515.2, "text": "Mask spielen und da war ich nicht darauf vorbereitet nach Ocarina of Time. Ich mein, Ocarina of"}, {"id": 163, "start": 1515.2, "end": 1520.64, "text": "Time hat den kleinen Max auch schon ziemlich geschockt, aber Majora's Mask hat mich echt"}, {"id": 164, "start": 1520.64, "end": 1542.88, "text": "fertig gemacht. Egal. Ja, das hat mir schon, wie ich klein war, überhaupt nicht gefallen,"}, {"id": 165, "start": 1542.88, "end": 1552.04, "text": "dass es einen Timer in dem Spiel gab. Das hat mich immer nervös gemacht. Zumal es eine"}, {"id": 166, "start": 1552.04, "end": 1556.72, "text": "ziemlich coole Mechanik hatte, das war eines der ersten Games, also zumindest, die mir"}, {"id": 167, "start": 1556.72, "end": 1563.32, "text": "so einfallen, wo die ganzen NPCs wirklich einen Tagesablauf hatten. Gut, das war natürlich"}, {"id": 168, "start": 1563.32, "end": 1570.88, "text": "hier alles hardcoded für jeden einzelnen NPC und was wie wo passiert anhand der Ingame-Zeit,"}, {"id": 169, "start": 1570.88, "end": 1575.96, "text": "aber das war schon wirklich cool. Du konntest ja auch nicht alle Quests überall erledigen"}, {"id": 170, "start": 1575.96, "end": 1581.2, "text": "und sowas, also das war schon nice, aber trotzdem, das hat mich immer so psychisch voll unter"}, {"id": 171, "start": 1581.2, "end": 1584.88, "text": "Druck gesetzt, dass es einen Timer gab. Das hat mir nicht gefallen. Und ich muss euch"}, {"id": 172, "start": 1584.88, "end": 1590.44, "text": "ehrlich sagen, auch wenn mir wahrscheinlich Majora's Mask bis heute am besten gefällt"}, {"id": 173, "start": 1590.44, "end": 1598.2, "text": "von allen Zelda-Spielen, die es gibt, ist das immer noch was, ich sehe, dass das notwendig"}, {"id": 174, "start": 1598.2, "end": 1604.44, "text": "war für das Game, aber es ist immer noch etwas, was ich nicht vollkommen überzeugt"}, {"id": 175, "start": 1604.44, "end": 1626.08, "text": "finde. Egal, gucken wir mal hier weiter. Ja, die waren relativ schnell, äh, nicht relativ,"}, {"id": 176, "start": 1626.08, "end": 1632.12, "text": "die waren relativ langsam, die Majora's Mask-Speedruns. Ich mein, Ocarina of Time ist jetzt runter"}, {"id": 177, "start": 1632.12, "end": 1638.64, "text": "auf was? 17 Minuten oder so? Nee, Quatsch, die haben ja mittlerweile den Credit Warp-Klitsch."}, {"id": 178, "start": 1638.64, "end": 1647.24, "text": "5 Minuten oder so? Was ist das? Wobei, dieses Credit Warps-Ding ist halt komplett sinnlos,"}, {"id": 179, "start": 1647.24, "end": 1658.92, "text": "aber dann spielst du das Game halt gar nicht mehr. Ja, 6 Minuten 49. Das sackt halt irgendwie."}, {"id": 180, "start": 1658.92, "end": 1663.2, "text": "Ich weiß nicht, ob mal jemand von euch so in den Ocarina of Time-Speedruns geguckt hat"}, {"id": 181, "start": 1663.2, "end": 1669.68, "text": "mit diesem Credit Warp-Klitsch. Credit Warp-Klitsch, das ist richtig dumm. Du rennst einfach nur"}, {"id": 182, "start": 1669.68, "end": 1675.32, "text": "durchs Dorf, machst ein paar Aktionen, um Speicherbereiche zu überschreiben und dann"}, {"id": 183, "start": 1675.32, "end": 1679.68, "text": "klitschst du am Ende bei dieser Piranha-Pflanze oder was das ist? Nee, das ist Mario bei"}, {"id": 184, "start": 1679.68, "end": 1687.16, "text": "dieser, was da aus dem Boden kommt, klitschst du durch die Wand und bist in den Credits."}, {"id": 185, "start": 1687.16, "end": 1695.8, "text": "Das ist irgendwie langweilig. Da find ich die anderen Kategorien tatsächlich spannender."}, {"id": 186, "start": 1695.8, "end": 1696.92, "text": "Okay, jetzt gucken wir mal ins Video."}, {"id": 187, "start": 1696.92, "end": 1708.64, "text": "Das klingt auch wieder nach irgendwelchen Memory-Leak-Geschichten."}, {"id": 188, "start": 1708.64, "end": 1723.0, "text": "Das ist bestimmt eklig."}, {"id": 189, "start": 1723.0, "end": 1750.8, "text": "Hyper Extended Superslide, Obvious, alles klar."}, {"id": 190, "start": 1750.8, "end": 1764.62, "text": "Easy, easy!"}, {"id": 191, "start": 1764.62, "end": 1766.62, "text": "Alles klar. Easy! Easy!"}, {"id": 192, "start": 1795.4, "end": 1797.38, "text": "In Spanien, die Pandemie,"}, {"id": 193, "start": 1797.38, "end": 1799.38, "text": "Orn SAS kids."}, {"id": 194, "start": 1799.38, "end": 1801.38, "text": "Oder in D WARFMATIM."}, {"id": 195, "start": 1801.38, "end": 1803.38, "text": "Geht es dir gleich also mit They Set!"}, {"id": 196, "start": 1803.64, "end": 1809.0, "text": "Jetzt wording,"}, {"id": 197, "start": 1809.0, "end": 1811.0, "text": "Ja, soasing,"}, {"id": 198, "start": 1811.0, "end": 1813.0, "text": "Zelfettationsgagen,"}, {"id": 199, "start": 1813.0, "end": 1815.0, "text": "Anfulu,"}, {"id": 200, "start": 1815.0, "end": 1817.0, "text": "Neukr personell"}, {"id": 201, "start": 1817.0, "end": 1819.0, "text": "Leerenavais,"}, {"id": 202, "start": 1818.82, "end": 1820.82, "text": "Stand- area,"}, {"id": 203, "start": 1820.82, "end": 1822.12, "text": "Ir Course,"}, {"id": 204, "start": 1822.12, "end": 1828.38, "text": "Ocarina of Time ist und ja die Engine unten drunter mehr oder weniger die gleiche ist und auch viele Glitches ähnlich sind"}, {"id": 205, "start": 1829.56, "end": 1831.56, "text": "Da wird mich nix wundern"}, {"id": 206, "start": 1831.6, "end": 1833.88, "text": "Da muss ich gar nichts mehr bei den Sorten spielen"}, {"id": 207, "start": 1835.0, "end": 1842.72, "text": "Attitudes muss man sagen n64 sind glaube ich mit die kaputtesten die es gibt guckt euch mario 64 ocarina of time an"}, {"id": 208, "start": 1842.88, "end": 1847.28, "text": "das hat mehrere gründe denke ich war erstens weil es einer der ersten 3d spiele waren in diesem"}, {"id": 209, "start": 1847.28, "end": 1851.84, "text": "profil experimentiert werden muss auch und weil die spiele halt"}, {"id": 210, "start": 1852.52, "end": 1856.78, "text": "saumäßig beliebt und bekannt sind und auseinander genommen wurden ohne ende"}, {"id": 211, "start": 1857.2, "end": 1862.68, "text": "Wenn es 3ds remake hat es ein paar verrückte Glitches die nicht so nahe waren als die original"}, {"id": 212, "start": 1862.68, "end": 1863.64, "text": "verrückte"}, {"id": 213, "start": 1863.64, "end": 1869.52, "text": "wenig wusste jeder ein team von Glitch-Hunters war silenzig im Hintergrund für eine weile jetzt und sie haben etwas gefunden"}, {"id": 214, "start": 1871.48, "end": 1875.72, "text": "In august 2019 hat fash eine weite access zu dem debug menü"}, {"id": 215, "start": 1875.72, "end": 1881.72, "text": "Aha, das ist ein verletzter von der wahl der spieler ist ein item aus dem spieler in der inventorie"}, {"id": 216, "start": 1881.84, "end": 1885.12, "text": "Auch die Td. Remains die vorherige bewegung der Dünge"}, {"id": 217, "start": 1885.8, "end": 1889.0, "text": "Obwohl das ist okay. Okay. Ich weiß jetzt schon was passiert"}, {"id": 218, "start": 1889.6, "end": 1895.6, "text": "Die manipulieren halt in game diese den memory bereich wo drin steht wie viele bosser gekillt wurden"}, {"id": 219, "start": 1896.96, "end": 1898.96, "text": "Okay, das ist glaube ich"}, {"id": 220, "start": 1900.36, "end": 1902.88, "text": "Dann wird das game wahrscheinlich genauso langweilig wie"}, {"id": 221, "start": 1902.88, "end": 1907.64, "text": "Das credit credit swap ding in ocarina of time ich finde speedruns langweilig"}, {"id": 222, "start": 1907.64, "end": 1911.84, "text": "Wurde das game nicht mal gespielt, aber die members für something absolutely game breaking to be found"}, {"id": 223, "start": 1911.84, "end": 1913.84, "text": "This is not what they were hoping for"}, {"id": 224, "start": 1914.64, "end": 1922.16, "text": "Controversy ensued where some felt that the glitch shouldn't be allowed stating that using the debug menu runs counter to everything speed running is about"}, {"id": 225, "start": 1922.72, "end": 1928.96, "text": "Accessing the menu was mind numbing requiring runners to play the song of storing 70 times in a row taking 12 minutes"}, {"id": 226, "start": 1928.96, "end": 1934.6, "text": "Definitely faster than beating all the dungeons, but replaced exciting and skillful gameplay with boring menuing"}, {"id": 227, "start": 1934.6, "end": 1940.64, "text": "Genau, das ist doch felt that since it was accessible in the game without cheats. It had to be allowed. However"}, {"id": 228, "start": 1941.32, "end": 1945.32, "text": "Accessible might have been a strong word considering that the menu crashes on n64"}, {"id": 229, "start": 1945.56, "end": 1949.8, "text": "Ich frage mich, wie sie das wieder rausgefunden haben. Ich meine wer spielt im richtigen Abstand"}, {"id": 230, "start": 1950.44, "end": 1953.64, "text": "71 mal das gleiche lied auf der flöte"}, {"id": 231, "start": 1954.28, "end": 1956.28, "text": "Was ist denn mit?"}, {"id": 232, "start": 1956.28, "end": 1958.28, "text": "Was ist denn mit den beiden wieder los?"}, {"id": 233, "start": 1959.68, "end": 1967.64, "text": "Doesn't exist on gamecube and it's impossible on wii vc leaving the japanese wii u virtual console as the only option"}, {"id": 234, "start": 1968.24, "end": 1973.94, "text": "Not only was this a version that most people didn't own but it also suffered from horrible input delay"}, {"id": 235, "start": 1974.64, "end": 1979.48, "text": "So things were still bleak for the Majora's mask community until october of that same year"}, {"id": 236, "start": 1979.48, "end": 1987.4, "text": "First, let's go back in 2016 Majora's mask speed on her full-grown gaming was doing a 100% run when this happened"}, {"id": 237, "start": 1987.96, "end": 1991.44, "text": "Dude, speaking of squash. He should be getting back from his exam pretty soon. I think"}, {"id": 238, "start": 1995.04, "end": 1998.0, "text": "What what what what what"}, {"id": 239, "start": 1998.0, "end": 2007.24, "text": "Hey, was hat er denn für was hat er denn für schmerzen dass da gerade eine tür gespornet ist oder was?"}, {"id": 240, "start": 2012.12, "end": 2013.32, "text": "Die tür"}, {"id": 241, "start": 2013.32, "end": 2015.92, "text": "Yeah, his boat just shot a door instead of an arrow"}, {"id": 242, "start": 2016.6, "end": 2021.84, "text": "Oddly enough weird things like this happen to many players and were documented as early as 2009"}, {"id": 243, "start": 2021.84, "end": 2028.04, "text": "But when unexplained man kann doch mal so eine tür verschießen es ist problemlich oktober 10 2019"}, {"id": 244, "start": 2028.4, "end": 2034.44, "text": "Glitches and stuff posted an ocarina time video that demonstrated throwing a boomerang at a skulltula token in the forest temple"}, {"id": 245, "start": 2034.52, "end": 2040.56, "text": "By adjusting the camera while exiting and reentering the room a door was flying through the air stuck to the boomerang"}, {"id": 246, "start": 2040.84, "end": 2045.4, "text": "This unassuming trick quickly became known as stale reference manipulation or SRM"}, {"id": 247, "start": 2045.4, "end": 2052.88, "text": "I just got any deeper into the history. I'll need to explain our SRM works. It's a bit tricky and honestly pretty intimidating"}, {"id": 248, "start": 2052.88, "end": 2054.88, "text": "But I'll simplify it as much as I can"}, {"id": 249, "start": 2055.4, "end": 2058.92, "text": "The programming concept that SRM exploits is called a pointer"}, {"id": 250, "start": 2059.32, "end": 2065.16, "text": "Like the name suggests a pointer directs to the memory location of something relevant to the game at that moment"}, {"id": 251, "start": 2065.84, "end": 2068.4, "text": "Telling it where the data it's looking for can be found"}, {"id": 252, "start": 2069.32, "end": 2074.32, "text": "Any programmer trying to manage pointers will tell you that they could be quite easy to mess up as"}, {"id": 253, "start": 2074.32, "end": 2078.8, "text": "It turns out even Nintendo's professional developers fall victim to them"}, {"id": 254, "start": 2079.68, "end": 2084.48, "text": "Nintendo professional developers, wenn man sich anguckt was die gerade in den letzten jahren so produziert haben"}, {"id": 255, "start": 2085.6, "end": 2088.6, "text": "Wundert mich nix gut aber das ist ja schon 20 jahr her"}, {"id": 256, "start": 2089.12, "end": 2092.64, "text": "There's a few ways that pointers can be misused, but here's a relevant example"}, {"id": 257, "start": 2093.92, "end": 2101.16, "text": "Imagine having a pointer to someplace in memory if the data associated with that pointer is no longer at that memory location"}, {"id": 258, "start": 2101.16, "end": 2106.48, "text": "And some other data is there instead the pointer should be reset"}, {"id": 259, "start": 2106.48, "end": 2109.88, "text": "So information isn't being written to the incorrect spot in memory"}, {"id": 260, "start": 2110.28, "end": 2117.12, "text": "But if the pointer isn't reset and is still being used then information will be written over whatever happens to be there"}, {"id": 261, "start": 2117.36, "end": 2122.4, "text": "At its core. This is what SRM is doing. Ich bin ich da das ist schon. Das ist schon zu"}, {"id": 262, "start": 2122.4, "end": 2131.24, "text": "Das ist zu früh am tach da blicke ich nicht durch bei der erklärung versteht irgendjemand was er meint?"}, {"id": 263, "start": 2131.24, "end": 2137.72, "text": "Abusing a dangling pointer or a stale reference to manipulate a memory location to write data where it shouldn't be"}, {"id": 264, "start": 2138.68, "end": 2141.18, "text": "Glitches and stuff confirm this with that boomerang video"}, {"id": 265, "start": 2141.92, "end": 2145.8, "text": "When you throw the boomerang it attaches to an item and brings it back to you"}, {"id": 266, "start": 2145.8, "end": 2153.56, "text": "It does this by creating a pointer between the boomerang and that object so the XYZ position of the boomerang will be copied to the"}, {"id": 267, "start": 2153.56, "end": 2155.56, "text": "memory of the object in question"}, {"id": 268, "start": 2155.8, "end": 2159.08, "text": "This creates the illusion that both objects are traveling together"}, {"id": 269, "start": 2159.72, "end": 2164.76, "text": "That pointer exists as long as the boomerang is loaded and by keeping the boomerang active"}, {"id": 270, "start": 2164.76, "end": 2170.52, "text": "But unloading whatever picked up glitches and stuff prevented the game from resetting the pointer now"}, {"id": 271, "start": 2171.48, "end": 2173.16, "text": "was"}, {"id": 272, "start": 2173.16, "end": 2177.92, "text": "Es ist zu früh dass ich blicke nicht durch egal big brain time"}, {"id": 273, "start": 2177.92, "end": 2180.98, "text": "If the game uses that memory location for some other data"}, {"id": 274, "start": 2181.12, "end": 2187.24, "text": "The boomerang will modify that data as it believes that the object it's carrying is still in that memory location"}, {"id": 275, "start": 2187.8, "end": 2193.24, "text": "So glitches just began salivating at the possibilities. Well, how broken could this really be?"}, {"id": 276, "start": 2193.44, "end": 2196.16, "text": "Could you give yourself any item in the game?"}, {"id": 277, "start": 2196.16, "end": 2203.36, "text": "Es sind N64 zellnerdinger, die sind eh schon broken as fuck. Set flags to complete quests? No problem"}, {"id": 278, "start": 2204.16, "end": 2207.28, "text": "What about warp to inaccessible locations?"}, {"id": 279, "start": 2210.08, "end": 2212.08, "text": "A community member name"}, {"id": 280, "start": 2212.08, "end": 2213.84, "text": "Oh, it's Vash again"}, {"id": 281, "start": 2213.84, "end": 2219.36, "text": "Vash theorized that you could use SRM to make owl statues even more useful. In Majora's Mask"}, {"id": 282, "start": 2219.44, "end": 2222.08, "text": "There are 10 owl statues spread across the world"}, {"id": 283, "start": 2222.08, "end": 2226.08, "text": "They're mostly used to warp between areas and save your progress"}, {"id": 284, "start": 2226.08, "end": 2230.56, "text": "Each owl statue has its own ID number ranging from zero to nine"}, {"id": 285, "start": 2231.2, "end": 2233.68, "text": "When loading, ich weiß nicht schon was am Ende passiert"}, {"id": 286, "start": 2233.68, "end": 2235.52, "text": "The game saves the statues"}, {"id": 287, "start": 2235.52, "end": 2243.04, "text": "Die überschreiben den den counter wie viele dungeons du geklärt hast beziehungsweise wie viele bosser du gekillt hast und dann kannst du wahrscheinlich direkt"}, {"id": 288, "start": 2243.92, "end": 2248.08, "text": "Am Anfang wenn du auf den Mond kommst gleich das Spiel beenden 100 pro so wird es sein"}, {"id": 289, "start": 2248.08, "end": 2253.2, "text": "Along with its ID number. If a statue's ID number happens to be higher than nine"}, {"id": 290, "start": 2253.6, "end": 2256.32, "text": "It starts to behave in strange and unintended ways"}, {"id": 291, "start": 2256.96, "end": 2259.68, "text": "By using SRM you could change any value you want"}, {"id": 292, "start": 2259.76, "end": 2264.8, "text": "So Vash's goal was to get the southern swamp statue to have an ID value of 14"}, {"id": 293, "start": 2264.8, "end": 2272.88, "text": "Ich will zu big brain spick da nicht durch muss mit dem ende angucken. Jetzt wird es noch abgedreht"}, {"id": 294, "start": 2283.92, "end": 2286.72, "text": "Okay, wisst ihr was wir kürzen es jetzt einfach wir gucken jetzt einfach"}, {"id": 295, "start": 2289.68, "end": 2292.0, "text": "Wir gucken jetzt einfach wo der record ist und dann wissen wir bescheid"}, {"id": 296, "start": 2292.0, "end": 2296.56, "text": "Unrestricted 18 minuten easy"}, {"id": 297, "start": 2298.8, "end": 2300.8, "text": "Dazu kann ich nur sagen"}, {"id": 298, "start": 2302.4, "end": 2308.0, "text": "Ja kein problem, okay jetzt wissen wir bescheid und das video zu gucken alles klar perfekt was gibt es als nächstes"}, {"id": 299, "start": 2310.0, "end": 2313.2, "text": "Das ist das war mir zu zu big brain time für so früh"}, {"id": 300, "start": 2313.2, "end": 2323.6, "text": "L. E. D cube showing your cpu status sechs minuten. Jawa ich wollte schon immer eine led panel mir anzeigen lassen wie heiß meine cpu ist"}, {"id": 301, "start": 2325.2, "end": 2327.2, "text": "deutsches Video"}, {"id": 302, "start": 2330.8, "end": 2332.8, "text": "Dieser chat ist jetzt deutsch"}, {"id": 303, "start": 2332.8, "end": 2334.8, "text": "Ich wollte einen 2 haben."}, {"id": 304, "start": 2342.4, "end": 2347.5, "text": "Letztes Jahr hatte ich den Ehren eine Sitzung auf der 36. Chaos-Kommunikation auf der anderen Seite zu geben."}, {"id": 305, "start": 2347.5, "end": 2352.88, "text": "Diese beeindruckenden Teile, besonders wenn man sie in der Hand hält und die Bilder reagieren auf den Tilt der Kugel."}, {"id": 306, "start": 2352.88, "end": 2354.64, "text": "Also wollte ich einen 2 bauen."}, {"id": 307, "start": 2354.64, "end": 2367.04, "text": "Die Frage ist halt, was ist der Vorteil von einem Würfel mit LEDs, der mir anzeigt, wie warm meine CPU ist,"}, {"id": 308, "start": 2367.04, "end": 2375.64, "text": "anstatt einfach ein Overlay auf dem Display zu haben, wo drauf steht, wie warm meine CPU ist."}, {"id": 309, "start": 2375.64, "end": 2385.64, "text": "Ich meine, es sieht cooler aus. Das ist aber auch das einzig Sinnvolle, oder?"}, {"id": 310, "start": 2385.64, "end": 2388.64, "text": "Weil es geht."}, {"id": 311, "start": 2394.64, "end": 2398.64, "text": "Ich skippe mal einfach mal kurz. Das ist doch ein 3D-Render, oder?"}, {"id": 312, "start": 2398.64, "end": 2403.64, "text": "Ich meine, es sieht optisch wirklich cool aus, daneben erstmal das Fritz-Phone am Start."}, {"id": 313, "start": 2403.64, "end": 2406.64, "text": "Es sieht optisch schon cool aus."}, {"id": 314, "start": 2406.64, "end": 2411.64, "text": "Es ist zwar reichlich unsinnig, aber es sieht optisch cool aus."}, {"id": 315, "start": 2411.64, "end": 2414.64, "text": "Vor allem auch irgendwie diese..."}, {"id": 316, "start": 2414.64, "end": 2420.64, "text": "...Ding, was auch immer das sein soll. Dieser Faden da drin. Das sieht schon cool aus."}, {"id": 317, "start": 2420.64, "end": 2426.64, "text": "Aber ich würde es mir nicht auf den Schreibtisch stellen, allein schon, weil mein Schreibtisch eh immer voll liegt mit allem möglichem Zeug."}, {"id": 318, "start": 2426.64, "end": 2446.64, "text": "Und dann wäre er noch voller. Aha. Exzellent, exzellent."}, {"id": 319, "start": 2446.64, "end": 2456.64, "text": "Jetzt wissen wir mal Bescheid. Also, wenn wir mal nicht wissen, wie warm unsere CPU ist, dann stellen wir uns einen Würfel daneben."}, {"id": 320, "start": 2456.64, "end": 2460.64, "text": "So, gucken wir uns mal an, was Maurice zu sagen hat zu 2021."}, {"id": 321, "start": 2460.64, "end": 2467.64, "text": "Also, ich wette mit euch, es ist Battlefield dabei. Das muss sein. Es ist Battlefield dabei."}, {"id": 322, "start": 2467.64, "end": 2470.64, "text": "Es ist Maurice. Das heißt, es ist auf jeden Fall..."}, {"id": 323, "start": 2470.64, "end": 2471.64, "text": "...ehm..."}, {"id": 324, "start": 2471.64, "end": 2477.64, "text": "...Blizzard Fails dabei."}, {"id": 325, "start": 2477.64, "end": 2485.64, "text": "Das soll überlegen. Was könnte es denn noch sein? Es ist auf jeden Fall Battlefield und Blizzard Fails dabei."}, {"id": 326, "start": 2485.64, "end": 2492.64, "text": "GTA. GTA ist wahrscheinlich auch dabei. Das war ja auch ein Riesenaufschrei dieses Jahr."}, {"id": 327, "start": 2492.64, "end": 2497.64, "text": "Mal gucken."}, {"id": 328, "start": 2497.64, "end": 2505.64, "text": "Battlefield. Ja."}, {"id": 329, "start": 2505.64, "end": 2511.64, "text": "Platz 1 ist bestimmt äh..."}, {"id": 330, "start": 2511.64, "end": 2514.64, "text": "...Battlefield."}, {"id": 331, "start": 2514.64, "end": 2527.64, "text": "Ja, auch dieses Jahr gibt es hier wieder amüsante Fails und absurde Peinlichkeiten. Aber vor allem Platz 1 wird jedes Jahr schockierender und alarmierender."}, {"id": 332, "start": 2527.64, "end": 2530.64, "text": "Platz 1 ist bestimmt Blizzard."}, {"id": 333, "start": 2530.64, "end": 2539.64, "text": "So kacke Battlefield an sich als Game ist, die ganze Geschichte, was da dieses Jahr bei Blizzard rausgekommen ist, ist bestimmt Nummer 1."}, {"id": 334, "start": 2539.64, "end": 2544.64, "text": "Wichtiger wird es auch darüber zu reden. Also legen wir ohne große Umschweife los."}, {"id": 335, "start": 2544.64, "end": 2546.64, "text": "Auf Maurice, erzähl uns was da heißt."}, {"id": 336, "start": 2546.64, "end": 2548.64, "text": "Werbung. Werbung."}, {"id": 337, "start": 2548.64, "end": 2553.64, "text": "Ich konzentriere mich hier auf neue Vorfälle aus dem Jahr 2021."}, {"id": 338, "start": 2553.64, "end": 2554.64, "text": "Ja klar."}, {"id": 339, "start": 2554.64, "end": 2556.64, "text": "Ich könnte mich hier auch nochmal aufregen..."}, {"id": 340, "start": 2556.64, "end": 2559.64, "text": "Warcraft 3 Reforged könnte man sich nochmal ein bisschen drüber..."}, {"id": 341, "start": 2559.64, "end": 2561.64, "text": "Wobei, wann war das denn? Das war letztes Jahr, ne?"}, {"id": 342, "start": 2561.64, "end": 2564.64, "text": "...ich immer noch keine PS5 kaufen konnte."}, {"id": 343, "start": 2564.64, "end": 2565.64, "text": "Ach so."}, {"id": 344, "start": 2565.64, "end": 2566.64, "text": "Aber das mache ich nicht."}, {"id": 345, "start": 2566.64, "end": 2569.64, "text": "Das interessiert mich nicht. Ich kaufe mir keine PS5."}, {"id": 346, "start": 2569.64, "end": 2572.64, "text": "PC Master Race."}, {"id": 347, "start": 2572.64, "end": 2575.64, "text": "Und ich habe mich längst damit abgefunden."}, {"id": 348, "start": 2575.64, "end": 2579.64, "text": "Wie ein Mönch, der allen weltlichen Gelüsten entsagt hat."}, {"id": 349, "start": 2579.64, "end": 2583.64, "text": "Wieso? Er kann den Kram doch auf dem PC spielen und gut ist. Zumindest das meiste."}, {"id": 350, "start": 2583.64, "end": 2588.64, "text": "Und es kommen ja mittlerweile sogar exklusive Sachen auf dem PC raus."}, {"id": 351, "start": 2588.64, "end": 2592.64, "text": "Die wollen jetzt irgendeine Uncharted Collection raushauen."}, {"id": 352, "start": 2592.64, "end": 2595.64, "text": "Dann Horizon Zero Dawn gibt es auf dem PC."}, {"id": 353, "start": 2595.64, "end": 2597.64, "text": "Den DHL Simulator gibt es auf dem PC."}, {"id": 354, "start": 2597.64, "end": 2600.64, "text": "Also es gibt ja schon vieles exklusive auf dem PC mittlerweile."}, {"id": 355, "start": 2600.64, "end": 2603.64, "text": "Es gibt gar nicht mal so viel, wo für sich unbedingt..."}, {"id": 356, "start": 2603.64, "end": 2608.64, "text": "Was würdet ihr sagen, Leute? Was ist der Kaufgrund für eine PlayStation 5?"}, {"id": 357, "start": 2611.64, "end": 2612.64, "text": "Also habt ihr einen Kaufgrund?"}, {"id": 358, "start": 2612.64, "end": 2616.64, "text": "Also was würdet ihr sagen, ist das, warum man sich..."}, {"id": 359, "start": 2617.64, "end": 2619.64, "text": "...das kaufen sollte?"}, {"id": 360, "start": 2619.64, "end": 2620.64, "text": "Um sie zu haben."}, {"id": 361, "start": 2620.64, "end": 2623.64, "text": "Ja, um sie zu haben, habe ich mit der alten Konsolengeneration gemacht."}, {"id": 362, "start": 2623.64, "end": 2628.64, "text": "Und ich hatte Xbox One und PS4, keine Ahnung, insgesamt 10 Stunden an zusammen oder sowas."}, {"id": 363, "start": 2631.64, "end": 2634.64, "text": "Die heizt gut. Ja, das wird es sein."}, {"id": 364, "start": 2636.64, "end": 2638.64, "text": "Das ist natürlich das Beste."}, {"id": 365, "start": 2638.64, "end": 2641.64, "text": "Mein PC kann aber auch gut heizen, wenn es sein muss."}, {"id": 366, "start": 2641.64, "end": 2648.64, "text": "Wenn, Leute. Ehrlich. Ich bin ruhig."}, {"id": 367, "start": 2648.64, "end": 2649.64, "text": "Weiter im Test."}, {"id": 368, "start": 2649.64, "end": 2651.64, "text": "Das glaube ich dir nicht, Moris."}, {"id": 369, "start": 2651.64, "end": 2653.64, "text": "Okay, aber seien wir ehrlich, Platz 5 ist nicht..."}, {"id": 370, "start": 2653.64, "end": 2656.64, "text": "Ah, Pro Evolution Soccer oder der Nachfolger von Pro Evolution Soccer."}, {"id": 371, "start": 2656.64, "end": 2661.64, "text": "Wie heißt das nochmal? Football 2021 oder so?"}, {"id": 372, "start": 2661.64, "end": 2664.64, "text": "Der Pro Evolution Soccer Nachfolger. Ja, das war auch richtig fail."}, {"id": 373, "start": 2664.64, "end": 2670.64, "text": "...neu, denn irgendein Sportspiel, über das man sich so richtig aufregen kann,"}, {"id": 374, "start": 2670.64, "end": 2673.64, "text": "...gibt es eigentlich jedes Jahr."}, {"id": 375, "start": 2673.64, "end": 2674.64, "text": "Wenn es reicht."}, {"id": 376, "start": 2674.64, "end": 2677.64, "text": "Und 2021 waren es die Fußballspiele."}, {"id": 377, "start": 2677.64, "end": 2683.64, "text": "Den Anfang machte das neue FIFA, das eine absolut unterirdische PC-Version ablieferte."}, {"id": 378, "start": 2683.64, "end": 2688.64, "text": "Mit kaum spielerischen Verbesserungen und Grafik wie auf den alten Konsolen."}, {"id": 379, "start": 2688.64, "end": 2689.64, "text": "Hä?"}, {"id": 380, "start": 2689.64, "end": 2690.64, "text": "Während es gleichzeitig..."}, {"id": 381, "start": 2690.64, "end": 2693.64, "text": "Wait a minute. Warum war die PC... Warum war die PC-Version..."}, {"id": 382, "start": 2693.64, "end": 2697.64, "text": "...das sei mal ein Port von den alten Versionen und nicht von den neuen?"}, {"id": 383, "start": 2697.64, "end": 2698.64, "text": "Hä?"}, {"id": 384, "start": 2698.64, "end": 2700.64, "text": "Was ist das schon wieder für eine Logik?"}, {"id": 385, "start": 2700.64, "end": 2709.64, "text": "...eine viel bessere Next-Gen-Version gibt, die EA aber dem PC in Sachen Hardware-Anforderungen nicht zutraut."}, {"id": 386, "start": 2709.64, "end": 2711.64, "text": "Aus Gründen."}, {"id": 387, "start": 2711.64, "end": 2713.64, "text": "Hä?"}, {"id": 388, "start": 2713.64, "end": 2724.64, "text": "Wahrscheinlich wollten sie damit irgendwie Konsolenverkäufe ankurbeln oder so."}, {"id": 389, "start": 2724.64, "end": 2727.64, "text": "Ja, aber warum? Das ergibt überhaupt keinen Sinn."}, {"id": 390, "start": 2727.64, "end": 2732.64, "text": "Und gerade wenn das auf der PS5 oder Xbox Series X läuft, läuft das auch ohne großartigen Anpassungen."}, {"id": 391, "start": 2732.64, "end": 2734.64, "text": "Wenn überhaupt. Auch auf dem PC."}, {"id": 392, "start": 2734.64, "end": 2735.64, "text": "Also hä?"}, {"id": 393, "start": 2735.64, "end": 2741.64, "text": "Wenn man meinen, dass so ein Fehltritt, zumindest dem größten Konkurrenten Pro Evolution Soccer, eine perfekte Torvorlage gibt."}, {"id": 394, "start": 2741.64, "end": 2744.64, "text": "Ne, Pro Evolution Soccer hat richtig reingeschossen dieses Jahr."}, {"id": 395, "start": 2744.64, "end": 2745.64, "text": "Aber ach."}, {"id": 396, "start": 2745.64, "end": 2747.64, "text": "Aber richtig reingeschossen."}, {"id": 397, "start": 2747.64, "end": 2758.64, "text": "Einfach selbst."}, {"id": 398, "start": 2758.64, "end": 2763.64, "text": "FIFA ist dieses Jahr sogar noch der kleinste Aufreger auf dem Fußballplatz."}, {"id": 399, "start": 2763.64, "end": 2765.64, "text": "Denn Pro Evo gibt es gar nicht mehr."}, {"id": 400, "start": 2765.64, "end": 2767.64, "text": "Es heißt jetzt E-Football."}, {"id": 401, "start": 2767.64, "end": 2769.64, "text": "Ach, E-Football, ja."}, {"id": 402, "start": 2769.64, "end": 2770.64, "text": "Und es ist richtig im Arsch."}, {"id": 403, "start": 2770.64, "end": 2775.64, "text": "...mit dem alten Namen auch schon ziemlich alles, was die Serie je gut gemacht hat."}, {"id": 404, "start": 2775.64, "end": 2778.64, "text": "Der neue Teil punktet wirklich in keiner Disziplin."}, {"id": 405, "start": 2778.64, "end": 2781.64, "text": "Er sieht gruselig aus, spielt sich unfassbar zäh,"}, {"id": 406, "start": 2781.64, "end": 2785.64, "text": "bietet kaum Spielmodi und strotzt auch noch vor Bugs."}, {"id": 407, "start": 2785.64, "end": 2794.64, "text": "Die Quittung E-Football 2022 schaffte es für eine Weile lang sogar zum am schlechtesten bewerteten Steam-Spiel aller Zeiten."}, {"id": 408, "start": 2794.64, "end": 2802.64, "text": "Wir wissen alle, wer zumindest kurzzeitig da ganz oben mitgemischt hat bei schlechtesten Steam-Games."}, {"id": 409, "start": 2802.64, "end": 2807.64, "text": "Ich glaube, Battlefield 2042 ist mittlerweile nicht mehr Top 10, aber immer noch weit oben."}, {"id": 410, "start": 2807.64, "end": 2814.64, "text": "Und wurde erst kurz vor Veröffentlichung dieses Videos noch entthont von War of the Three Kingdoms,"}, {"id": 411, "start": 2814.64, "end": 2820.64, "text": "einem chinesischen Online-Spiel, das wohl so gieriger Pay-to-win-Schrott ist,"}, {"id": 412, "start": 2820.64, "end": 2825.64, "text": "dass chinesische Spieler in Scharen die Steam-Seite stürmen, um uns wessen."}, {"id": 413, "start": 2825.64, "end": 2829.64, "text": "Also wenn die China-Chinesen schon sagen, es ist Pay-to-win,"}, {"id": 414, "start": 2829.64, "end": 2833.64, "text": "dann ist es aus unserer Sicht schon nicht mehr Pay-to-win,"}, {"id": 415, "start": 2833.64, "end": 2836.64, "text": "sondern noch irgendwie, was kommt danach Pay-to-win?"}, {"id": 416, "start": 2836.64, "end": 2841.64, "text": "Pay-to überhaupt den Spawn verlassen können oder so."}, {"id": 417, "start": 2841.64, "end": 2844.64, "text": "Was ist die Steigerung von Pay-to-win?"}, {"id": 418, "start": 2844.64, "end": 2848.64, "text": "Weil die Chinesen haben da gerne Pay-to-Casino."}, {"id": 419, "start": 2848.64, "end": 2852.64, "text": "Nee, Pay-to-play ist ja was anderes, das ist schon belegt."}, {"id": 420, "start": 2852.64, "end": 2855.64, "text": "Verletzung der Menschenrechte."}, {"id": 421, "start": 2855.64, "end": 2859.64, "text": "Hey, wenn sich die Chinesen darüber beschweren, dann muss es noch schlimmer sein."}, {"id": 422, "start": 2859.64, "end": 2864.64, "text": "Also generell muss man sagen, in Asien, gerade auch in China und auch teilweise Korea,"}, {"id": 423, "start": 2864.64, "end": 2872.64, "text": "vor allem in China, ist ja Pay-to-win viel akzeptierter als bei uns."}, {"id": 424, "start": 2872.64, "end": 2886.64, "text": "Und wenn die sich da drüber aufregen schon, dann muss das wirklich eine ganz extreme Geschichte sein."}, {"id": 425, "start": 2886.64, "end": 2889.64, "text": "Zwar weiß ich nicht ganz, was Sie uns damit sagen wollen,"}, {"id": 426, "start": 2889.64, "end": 2895.64, "text": "dass wir immer eine Blitzhund-Karte auf der Stirn haben, aber es muss schlimm sein,"}, {"id": 427, "start": 2895.64, "end": 2901.64, "text": "denn War of the Three Kingdoms kommt auf miserable 10% positive Reviews."}, {"id": 428, "start": 2901.64, "end": 2903.64, "text": "Aber selbst das..."}, {"id": 429, "start": 2903.64, "end": 2907.64, "text": "Battlefield 2042 hatte teilweise 20% oder 21%."}, {"id": 430, "start": 2907.64, "end": 2909.64, "text": "I see, danke schön für den Sub."}, {"id": 431, "start": 2913.64, "end": 2915.64, "text": "Aber das ist natürlich nochmal eine Nummer härter."}, {"id": 432, "start": 2915.64, "end": 2917.64, "text": "...nur knapp schlechter als eFootball."}, {"id": 433, "start": 2917.64, "end": 2924.64, "text": "Das schafft auch nur 14% von über 25.000 Bewertungen."}, {"id": 434, "start": 2924.64, "end": 2928.64, "text": "Und auch auf Metacritic wurde das Spiel offiziell zum Schlechtesten."}, {"id": 435, "start": 2928.64, "end": 2932.64, "text": "Aber Hauptsache, sie haben fette Lizenzgebühren reingebuttert,"}, {"id": 436, "start": 2932.64, "end": 2934.64, "text": "dass sie die offiziellen Namen und so haben können."}, {"id": 437, "start": 2939.64, "end": 2941.64, "text": "Also Geld scheint ja da zu sein."}, {"id": 438, "start": 2941.64, "end": 2948.64, "text": "...musste das große Update 1.0 aber auf Frühling 2022 verschieben und es ist irgendwie schwer vorstellbar,"}, {"id": 439, "start": 2948.64, "end": 2952.64, "text": "dass es diesen Karren noch aus dem Dreck ziehen kann."}, {"id": 440, "start": 2952.64, "end": 2957.64, "text": "Wenn ihr euch jetzt fragt, warum all das nur für Platz 5 reicht,"}, {"id": 441, "start": 2957.64, "end": 2960.64, "text": "naja, dann schnallt euch mal an."}, {"id": 442, "start": 2960.64, "end": 2965.64, "text": "Platz 4 geht an einen Aufreger, der auch außerhalb der Gaming-Szene Wellen schlug."}, {"id": 443, "start": 2965.64, "end": 2967.64, "text": "Ah, Dislikes."}, {"id": 444, "start": 2967.64, "end": 2970.64, "text": "Ach Moment, sowas haben sie da auch mit drin."}, {"id": 445, "start": 2970.64, "end": 2972.64, "text": "Okay, ich dachte es ging rein um Games."}, {"id": 446, "start": 2972.64, "end": 2975.64, "text": "Okay, dann fällt mir 2021 auch noch ein bisschen mehr ein."}, {"id": 447, "start": 2975.64, "end": 2977.64, "text": "Aber ja, das hat es verdient."}, {"id": 448, "start": 2986.64, "end": 2988.64, "text": "Ja, so fail, Alter."}, {"id": 449, "start": 2988.64, "end": 2991.64, "text": "Ach, das ist, ich hab mich schon so oft darüber aufgeregt."}, {"id": 450, "start": 2991.64, "end": 2994.64, "text": "Das ist einfach so krasser Schwachsinn."}, {"id": 451, "start": 2994.64, "end": 2997.64, "text": "YouTube macht das nur fürs Geldverdienen unterm Strich."}, {"id": 452, "start": 2997.64, "end": 3002.64, "text": "Ja, weil keine Ahnung, Ubisoft und Activision und wer auch immer es nicht mag,"}, {"id": 453, "start": 3002.64, "end": 3005.64, "text": "zu sehen, dass ihr Dreck gedisliked wird."}, {"id": 454, "start": 3005.64, "end": 3008.64, "text": "Und was auch noch dazu kommt, das ist das eine."}, {"id": 455, "start": 3008.64, "end": 3012.64, "text": "Und weil die Leute vielleicht abschalten, wenn das Video kaputt geht,"}, {"id": 456, "start": 3012.64, "end": 3019.64, "text": "und was auch noch dazu kommt, das ist das eine, und weil die Leute vielleicht abschalten, wenn das Video zu sehr disliked ist."}, {"id": 457, "start": 3025.64, "end": 3029.64, "text": "Also es hat bestimmt Statistik, die haben bestimmt Statistiken bei YouTube,"}, {"id": 458, "start": 3029.64, "end": 3035.64, "text": "wo sie sehen können, dass die Leute, wenn sie disliked sehen, das Video quasi erst gar nicht mehr ausprobieren."}, {"id": 459, "start": 3035.64, "end": 3040.64, "text": "Was ja auch wahrscheinlich gut ist, weil das Video höchstwahrscheinlich Müll ist."}, {"id": 460, "start": 3040.64, "end": 3047.64, "text": "Du kannst über die Apis, also theoretisch kannst du über die Apis nicht mehr abgreifen, aber ich glaube es geht noch."}, {"id": 461, "start": 3047.64, "end": 3054.64, "text": "Die wollten das eigentlich zum 12.12.Glaub abschalten mit der Api, aber ich glaube es geht noch."}, {"id": 462, "start": 3054.64, "end": 3072.64, "text": "Ja, dass das wegen Hatewellen ist, ist halt schwachsinnig."}, {"id": 463, "start": 3072.64, "end": 3081.64, "text": "Ja, das stimmt schon, es gibt halt viele dumme Leute auf YouTube, aber Dislikebombing muss ich ehrlich sagen."}, {"id": 464, "start": 3081.64, "end": 3088.64, "text": "Also ich will jetzt nicht abschreiten, dass es das gibt, dass sich Leute irgendwie zusammenrotten,"}, {"id": 465, "start": 3088.64, "end": 3099.64, "text": "oder gar irgendwelche Bots kaufen, um Leute da fertig zu machen, aber im Großen und Ganzen ist das jetzt nur wirklich gering."}, {"id": 466, "start": 3099.64, "end": 3104.64, "text": "Und zumindest ist die Antwort darauf nicht, eines der wichtigsten Features für alle abzuschalten."}, {"id": 467, "start": 3104.64, "end": 3109.64, "text": "Die Leute kritisierten, dass die Dislikeleiste ja auch einen positiven Zweck erfüllt."}, {"id": 468, "start": 3109.64, "end": 3110.64, "text": "Ja natürlich."}, {"id": 469, "start": 3110.64, "end": 3116.64, "text": "Die erlaubt es beispielsweise direkt zu sehen, wenn ein Video einfach nur clickbait ist und sein Versprechen nicht erfüllt."}, {"id": 470, "start": 3116.64, "end": 3123.64, "text": "Zum Beispiel ein angeblicher Guide, der die Frage im Titel nicht beantwortet oder ein Fake-Trailer zu einem Kinofilm."}, {"id": 471, "start": 3123.64, "end": 3131.64, "text": "Und die Dislikeleiste konnte ähnlich wie Steam oder Metacritic Reviews ja nicht nur für böswilliges Reviewbombing genutzt werden,"}, {"id": 472, "start": 3131.64, "end": 3134.64, "text": "sondern auch als legitime Form des Protests."}, {"id": 473, "start": 3134.64, "end": 3137.64, "text": "Ja, ich sag nur Diablo Immortal Trailer."}, {"id": 474, "start": 3137.64, "end": 3140.64, "text": "Das Ding hatte auch so heftig viele Dislikes."}, {"id": 475, "start": 3140.64, "end": 3159.64, "text": "Oder neueres Beispiel, das Ubisoft NFT, äh, äh, NFT, äh, Ubisoft, ich weiß nicht mal, Unlisted, Trailer, Quarz, Quarz, YouTube."}, {"id": 476, "start": 3159.64, "end": 3161.64, "text": "Haben wir das irgendwo? Nein."}, {"id": 477, "start": 3163.64, "end": 3167.64, "text": "Ich brauch den Link da drauf, Leute. Quarz."}, {"id": 478, "start": 3168.64, "end": 3176.64, "text": "Quarz, wo ist das Link? Alter, mir gehen diese News-Posts immer so auf den Sack, die da keinen Link dazu drin haben."}, {"id": 479, "start": 3176.64, "end": 3191.64, "text": "Hat jemand den? Ja. Nein."}, {"id": 480, "start": 3191.64, "end": 3195.64, "text": "Ich würde das nicht auf eurer Seite angucken. Ich will das auf YouTube gucken."}, {"id": 481, "start": 3195.64, "end": 3203.64, "text": "Ihr werdet es doch schaffen, dort einen Link auf YouTube, oder ist es mittlerweile gelöscht auf YouTube?"}, {"id": 482, "start": 3210.64, "end": 3215.64, "text": "Die werden es doch schaffen, einen Link auf YouTube zu packen, worüber sie sich aufregen."}, {"id": 483, "start": 3215.64, "end": 3218.64, "text": "Das ist ja wieder lächerlich, alter News-Seiten."}, {"id": 484, "start": 3220.64, "end": 3221.64, "text": "Unlisted."}, {"id": 485, "start": 3221.64, "end": 3225.64, "text": "Wenn es da Tom Henderson schreibt, jawoll, da sind wir doch."}, {"id": 486, "start": 3225.64, "end": 3228.64, "text": "Ups, hallo, wo ist es jetzt hin?"}, {"id": 487, "start": 3232.64, "end": 3233.64, "text": "Ach, da hinten."}, {"id": 488, "start": 3235.64, "end": 3236.64, "text": "Hier."}, {"id": 489, "start": 3238.64, "end": 3241.64, "text": "1,7k zu 42k."}, {"id": 490, "start": 3245.64, "end": 3247.64, "text": "Das wollen die auch nicht, dass man das noch sieht."}, {"id": 491, "start": 3247.64, "end": 3251.64, "text": "Alter, das ist so schlecht, das ist so mies."}, {"id": 492, "start": 3251.64, "end": 3253.64, "text": "Okay, machen wir das Video weiter."}, {"id": 493, "start": 3253.64, "end": 3263.64, "text": "Zum Beispiel gegen lächerliche Glücksspiel-Trailer, wie dieses Machwerk von NBA 2K20 damals."}, {"id": 494, "start": 3263.64, "end": 3268.64, "text": "Ich meine nicht, dass so was große Firmen je umstimmen würde, wenn der Hubel rollt."}, {"id": 495, "start": 3268.64, "end": 3273.64, "text": "Aber so einem Video darf man schon mal ansehen, wie bescheuert es ist."}, {"id": 496, "start": 3273.64, "end": 3277.64, "text": "Kritik kam sogar von einem der drei YouTube-Gründer."}, {"id": 497, "start": 3277.64, "end": 3279.64, "text": "Das ist das erste YouTube-Video, by the way."}, {"id": 498, "start": 3279.64, "end": 3284.64, "text": "Wer das nicht kennt, das ist das erste YouTube-Video, das hochgeladen wurde."}, {"id": 499, "start": 3284.64, "end": 3302.64, "text": "Ja, es ist sehr viel Schrott auf YouTube mittlerweile."}, {"id": 500, "start": 3314.64, "end": 3331.64, "text": "Zumal ja am Anfang, zu der Zeit, gab es ja sogar noch das Sternesystem."}, {"id": 501, "start": 3337.64, "end": 3339.64, "text": "Vielleicht erinnert sich der ein oder andere noch."}, {"id": 502, "start": 3339.64, "end": 3342.64, "text": "Ich kann euch mal zeigen, wie das Sternesystem ausgesehen hat."}, {"id": 503, "start": 3342.64, "end": 3353.64, "text": "Archiv, Org, Dislike-System. Achtung, nicht Dislike-System."}, {"id": 504, "start": 3353.64, "end": 3359.64, "text": "YouTube.com, nehmen wir mal meinen Channel."}, {"id": 505, "start": 3359.64, "end": 3362.64, "text": "Nehmen wir mal meinen Channel."}, {"id": 506, "start": 3362.64, "end": 3365.64, "text": "Wayback Machine."}, {"id": 507, "start": 3365.64, "end": 3373.64, "text": "Und gehen wir mal zurück auf 2011."}, {"id": 508, "start": 3373.64, "end": 3378.64, "text": "Und dann hier, keine Ahnung."}, {"id": 509, "start": 3378.64, "end": 3383.64, "text": "Gucken wir uns mal den Channel an von 2011."}, {"id": 510, "start": 3383.64, "end": 3389.64, "text": "Java hat man, äh nicht Java, Flash-Play hat man damals noch gebraucht."}, {"id": 511, "start": 3389.64, "end": 3398.64, "text": "Es ist natürlich blöd, dass es jetzt auf Japanisch ist."}, {"id": 512, "start": 3398.64, "end": 3407.64, "text": "Oh guck mal, da gab es keine, da gab es nur schon Up und Down, da gab es noch keine Sternebewertung mehr."}, {"id": 513, "start": 3407.64, "end": 3416.64, "text": "Ich bin mir aber relativ sicher, dass es am Anfang noch Sterne gab."}, {"id": 514, "start": 3416.64, "end": 3423.64, "text": "Okay, da habe ich ungefähr meinen Channel erstellt, ein paar Monate vorher."}, {"id": 515, "start": 3423.64, "end": 3428.64, "text": "Also, da waren es auch schon Likes und Dislikes, guck mal."}, {"id": 516, "start": 3428.64, "end": 3433.64, "text": "Dann habe ich gar nicht so viel mitbekommen, da hatte ich noch den Tux-Keks-Avatar."}, {"id": 517, "start": 3433.64, "end": 3438.64, "text": "Daher kommt auch diese Keks-Geschichte her."}, {"id": 518, "start": 3438.64, "end": 3442.64, "text": "Ich hatte so einen Linux-Avatar ursprünglich drin."}, {"id": 519, "start": 3442.64, "end": 3446.64, "text": "Und da habe ich mir gedacht, okay, wenn ich da jetzt sogar Geld mit verdiene,"}, {"id": 520, "start": 3446.64, "end": 3460.64, "text": "dann kopiere ich mir keine Bilder, die andere Leute erstellt haben, sondern lasse ich mir was eigenes erstellen."}, {"id": 521, "start": 3460.64, "end": 3465.64, "text": "Tja, irgendwie sah YouTube doch tatsächlich mal übersichtlich aus."}, {"id": 522, "start": 3465.64, "end": 3468.64, "text": "Du konntest letzten Kommentare sehen von einem Creator,"}, {"id": 523, "start": 3468.64, "end": 3472.64, "text": "was auch schon sinnvoll war, weil die Leute das vielleicht einfach interessiert hat."}, {"id": 524, "start": 3472.64, "end": 3481.64, "text": "Du hast gesehen, was hier abgeht."}, {"id": 525, "start": 3481.64, "end": 3485.64, "text": "Du konntest Kommentare posten, so sichtbar auf dem Channel."}, {"id": 526, "start": 3485.64, "end": 3487.64, "text": "War eigentlich gar nicht so schlecht."}, {"id": 527, "start": 3487.64, "end": 3495.64, "text": "So, was ist jetzt, wenn wir hier draufklicken? Sehen wir es dann?"}, {"id": 528, "start": 3495.64, "end": 3499.64, "text": "Aber guck mal, der hat sogar ein bisschen..."}, {"id": 529, "start": 3499.64, "end": 3504.64, "text": "Moment, das Video geht noch."}, {"id": 530, "start": 3504.64, "end": 3509.64, "text": "Glaub ich jetzt aber nicht."}, {"id": 531, "start": 3509.64, "end": 3516.64, "text": "Tatsächlich."}, {"id": 532, "start": 3516.64, "end": 3525.64, "text": "Alter, der Sound!"}, {"id": 533, "start": 3525.64, "end": 3532.64, "text": "Alter, der Sound!"}, {"id": 534, "start": 3532.64, "end": 3538.64, "text": "Alter, der Sound."}, {"id": 535, "start": 3538.64, "end": 3543.64, "text": "Oh, ist das schlecht."}, {"id": 536, "start": 3543.64, "end": 3547.64, "text": "Wer hat hier Kappa Pride Flames gemacht?"}, {"id": 537, "start": 3547.64, "end": 3556.64, "text": "Das eigentliche Comment kann man sich nicht mal anzeigen lassen."}, {"id": 538, "start": 3556.64, "end": 3570.64, "text": "Okay, nice, guck mal weiter."}, {"id": 539, "start": 3570.64, "end": 3576.64, "text": "Ja, leider, leider können die ja auch nicht zaubern mit dieser Browser-Erweiterung."}, {"id": 540, "start": 3576.64, "end": 3579.64, "text": "Die habe ich ja auch am Start, deswegen seht ihr ja nur Dislikes bei mir noch."}, {"id": 541, "start": 3579.64, "end": 3584.64, "text": "Die haben sich bei Videos eine interne Datenbank angelegt,"}, {"id": 542, "start": 3584.64, "end": 3587.64, "text": "mit Dislikes, als sie noch abrufbar waren."}, {"id": 543, "start": 3587.64, "end": 3592.64, "text": "Und für neue Videos müssen die das irgendwie errechnen."}, {"id": 544, "start": 3592.64, "end": 3599.64, "text": "Das heißt, das wird nie so richtig genau sein."}, {"id": 545, "start": 3599.64, "end": 3603.64, "text": "YouTube hat die API schon abgeschaltet."}, {"id": 546, "start": 3603.64, "end": 3606.64, "text": "Das heißt, eigentlich ist es jetzt mehr oder weniger useless schon."}, {"id": 547, "start": 3606.64, "end": 3612.64, "text": "Man kann es so grob erkennen, weil die die Dislikes errechnen."}, {"id": 548, "start": 3612.64, "end": 3614.64, "text": "Was heißt errechnen? Errechnen ist ja das falsche Wort."}, {"id": 549, "start": 3614.64, "end": 3617.64, "text": "Errechnen wird ja bedeuten, da kommt was so..."}, {"id": 550, "start": 3617.64, "end": 3621.64, "text": "Klar, inputbasiertes raus am Ende."}, {"id": 551, "start": 3621.64, "end": 3626.64, "text": "Die sagen einfach anhand der View zu Like Ratio,"}, {"id": 552, "start": 3626.64, "end": 3629.64, "text": "aha, so und so viele Dislikes müsste das haben, ungefähr."}, {"id": 553, "start": 3629.64, "end": 3636.64, "text": "Die schätzen das eher, genau."}, {"id": 554, "start": 3636.64, "end": 3639.64, "text": "Oh, cringe."}, {"id": 555, "start": 3639.64, "end": 3642.64, "text": "Auf Platz 3 landet der rechtmäßige Erbe..."}, {"id": 556, "start": 3642.64, "end": 3644.64, "text": "GTA, natürlich, was sonst?"}, {"id": 557, "start": 3644.64, "end": 3647.64, "text": "Die GTA Trilogy Definitive Edition."}, {"id": 558, "start": 3647.64, "end": 3653.64, "text": "Ein großer Titel für eine Neuauflage, bei der eigentlich fast alles daneben ging."}, {"id": 559, "start": 3653.64, "end": 3656.64, "text": "Mal angefangen beim Inhalt."}, {"id": 560, "start": 3656.64, "end": 3659.64, "text": "Das größte Verkaufsargument wäre das Grafikupdate,"}, {"id": 561, "start": 3659.64, "end": 3663.64, "text": "aber die neuen Charaktermodelle sind in vielen Fällen eher comichaft und..."}, {"id": 562, "start": 3663.64, "end": 3666.64, "text": "Die Rechnen hoch, was die Leute liken und Disliken mit dem Addon."}, {"id": 563, "start": 3666.64, "end": 3669.64, "text": "Das ist neu, ich habe bei ihnen gelesen auf der Seite,"}, {"id": 564, "start": 3669.64, "end": 3676.64, "text": "wo sie selbst erklären, wie es funktioniert."}, {"id": 565, "start": 3676.64, "end": 3680.64, "text": "So."}, {"id": 566, "start": 3680.64, "end": 3684.64, "text": "Habe ich ein Video gezeigt, erklären sie ja, wie es funktioniert."}, {"id": 567, "start": 3684.64, "end": 3688.64, "text": "Und..."}, {"id": 568, "start": 3688.64, "end": 3690.64, "text": "Estimated extrapolated..."}, {"id": 569, "start": 3690.64, "end": 3692.64, "text": "Ah!"}, {"id": 570, "start": 3692.64, "end": 3694.64, "text": "Okay, das ist neu."}, {"id": 571, "start": 3694.64, "end": 3696.64, "text": "Based on View Like Ratios."}, {"id": 572, "start": 3696.64, "end": 3700.64, "text": "Das scheint jetzt neu zu sein."}, {"id": 573, "start": 3700.64, "end": 3705.64, "text": "Estimates extrapolated from extension user data."}, {"id": 574, "start": 3705.64, "end": 3708.64, "text": "Das habe ich nicht gelesen, oder es ist jetzt wirklich neu."}, {"id": 575, "start": 3708.64, "end": 3715.64, "text": "Ich wusste nur, dass sie das hier machen."}, {"id": 576, "start": 3715.64, "end": 3718.64, "text": "Lächerlich als wirklich eine Verbesserung."}, {"id": 577, "start": 3718.64, "end": 3723.64, "text": "Ja, es gibt unter anderem neue Effekte und einige davon sind sogar gelungen,"}, {"id": 578, "start": 3723.64, "end": 3726.64, "text": "aber andere, wie der Regen, wirken einfach nur so."}, {"id": 579, "start": 3726.64, "end": 3729.64, "text": "Haben die das nicht sogar entfernt, zwischenzeitlich?"}, {"id": 580, "start": 3729.64, "end": 3733.64, "text": "Haben die nicht das GTA Remake sogar entfernt, um danach quasi,"}, {"id": 581, "start": 3733.64, "end": 3737.64, "text": "weil es irgendwie Modding Code enthielte,"}, {"id": 582, "start": 3737.64, "end": 3742.64, "text": "und um es danach wieder quasi zu entfernen und neu hochzuladen, übertrieben."}, {"id": 583, "start": 3742.64, "end": 3746.64, "text": "Und zu allem Überfluss gibt es selbst mit einer GeForce 3080"}, {"id": 584, "start": 3746.64, "end": 3751.64, "text": "ernsthaft noch Performance-Probleme bei diesen uralt Spielen."}, {"id": 585, "start": 3751.64, "end": 3754.64, "text": "Inhaltliche Verbesserungen, wie die überarbeitete Steuerung,"}, {"id": 586, "start": 3754.64, "end": 3759.64, "text": "stellten sich dann auch noch als viel weniger tiefgreifend als erhofft heraus."}, {"id": 587, "start": 3759.64, "end": 3760.64, "text": "Und es fehlte sogar..."}, {"id": 588, "start": 3760.64, "end": 3763.64, "text": "Und das Schlimme ist ja, dass sie gleichermaßen versuchen,"}, {"id": 589, "start": 3763.64, "end": 3766.64, "text": "dass man an die alten Spiele nicht mehr rankommt."}, {"id": 590, "start": 3766.64, "end": 3770.64, "text": "So ein bisschen, wie bei Warcraft 3 Reforged."}, {"id": 591, "start": 3770.64, "end": 3773.64, "text": "Keiner wollte es so wirklich haben, gerade von den Pros, die..."}, {"id": 592, "start": 3773.64, "end": 3774.64, "text": "Und jetzt sagen wir Pros, ja doch."}, {"id": 593, "start": 3774.64, "end": 3776.64, "text": "Sagen wir mal, von den richtig guten Leuten, die Multiplayer spielen."}, {"id": 594, "start": 3776.64, "end": 3780.64, "text": "Die wollten ja eigentlich das alte weiter spielen."}, {"id": 595, "start": 3780.64, "end": 3782.64, "text": "Und dann hat Blizzard gesagt, nö, gibt's das nicht mehr."}, {"id": 596, "start": 3782.64, "end": 3784.64, "text": "Songs auf den Original spielen."}, {"id": 597, "start": 3784.64, "end": 3787.64, "text": "Kurzzeitig nahm Rockstar die Definitive Edition sogar offline,"}, {"id": 598, "start": 3787.64, "end": 3790.64, "text": "weil angeblich noch irgendwelche Dateien drinsteckten,"}, {"id": 599, "start": 3790.64, "end": 3793.64, "text": "die nicht drin sein sollten."}, {"id": 600, "start": 3793.64, "end": 3797.64, "text": "Das alles wäre für saftige 60 Euro schon peinlich genug."}, {"id": 601, "start": 3797.64, "end": 3800.64, "text": "Aber viel schlimmer stieß den Fans noch auf,"}, {"id": 602, "start": 3800.64, "end": 3804.64, "text": "wie Rockstar sie regelrecht zum Kauf nötigen wollte."}, {"id": 603, "start": 3804.64, "end": 3807.64, "text": "Das Studio nahm nicht nur die Originale aus dem Handel."}, {"id": 604, "start": 3807.64, "end": 3810.64, "text": "Publisher Take-Two verklagte auch noch Modder,"}, {"id": 605, "start": 3810.64, "end": 3815.64, "text": "die völlig kostenlos Verbesserungen für die alten Spiele produziert hatten."}, {"id": 606, "start": 3815.64, "end": 3816.64, "text": "Das ist ja fast..."}, {"id": 607, "start": 3816.64, "end": 3818.64, "text": "Also Nintendo ist ja auch so ein Laden,"}, {"id": 608, "start": 3818.64, "end": 3821.64, "text": "der alles verklagt, was bei 3 nicht auf dem Baum ist."}, {"id": 609, "start": 3821.64, "end": 3823.64, "text": "Das ist jetzt aber noch mal eine krassere Geschichte,"}, {"id": 610, "start": 3823.64, "end": 3825.64, "text": "weil ich meine, die Games wurden jetzt, was weiß ich,"}, {"id": 611, "start": 3825.64, "end": 3827.64, "text": "10, 15 Jahre nicht mehr supportet,"}, {"id": 612, "start": 3827.64, "end": 3829.64, "text": "und die Leute haben quasi selbst dafür gesorgt,"}, {"id": 613, "start": 3829.64, "end": 3832.64, "text": "dass sie gut spielbar blieben und auch auf neuere Hardware."}, {"id": 614, "start": 3832.64, "end": 3835.64, "text": "Und jetzt kommen die einfach, oh nö, wir verklagen euch."}, {"id": 615, "start": 3835.64, "end": 3838.64, "text": "Dabei teilweise sogar einen besseren Job gemacht hatten."}, {"id": 616, "start": 3838.64, "end": 3841.64, "text": "Hinterher entschuldigte sich Rockstar zwar für das Release-Debakel"}, {"id": 617, "start": 3841.64, "end": 3844.64, "text": "und brachte die Originalspiele zurück in den Store,"}, {"id": 618, "start": 3844.64, "end": 3846.64, "text": "aber der Schaden war angerichtet."}, {"id": 619, "start": 3846.64, "end": 3847.64, "text": "Selbst schuld."}, {"id": 620, "start": 3847.64, "end": 3848.64, "text": "Auf Metacritic..."}, {"id": 621, "start": 3848.64, "end": 3850.64, "text": "Komplett verdient."}, {"id": 622, "start": 3850.64, "end": 3854.64, "text": "Da spiegelt jetzt vielleicht nicht die reale Sachen wieder,"}, {"id": 623, "start": 3854.64, "end": 3856.64, "text": "die die Spiele trotzdem verdient hätten,"}, {"id": 624, "start": 3856.64, "end": 3858.64, "text": "aber das haben sie sich wirklich verdient."}, {"id": 625, "start": 3858.64, "end": 3861.64, "text": "...steht die Trilogie bei einer Kritiker-Wertung von 49"}, {"id": 626, "start": 3861.64, "end": 3865.64, "text": "und traurigen 0,5 User-Score."}, {"id": 627, "start": 3865.64, "end": 3867.64, "text": "Was tatsächlich noch mal schlechter ist..."}, {"id": 628, "start": 3867.64, "end": 3868.64, "text": "Das haben sie sich..."}, {"id": 629, "start": 3868.64, "end": 3870.64, "text": "Ja, das muss er erst mal schaffen."}, {"id": 630, "start": 3870.64, "end": 3872.64, "text": "Zwar recht knapp, aber hey..."}, {"id": 631, "start": 3872.64, "end": 3874.64, "text": "Glückwunsch, Rockstar."}, {"id": 632, "start": 3874.64, "end": 3876.64, "text": "Das muss man..."}, {"id": 633, "start": 3876.64, "end": 3878.64, "text": "Das muss man schaffen, ja."}, {"id": 634, "start": 3878.64, "end": 3880.64, "text": "Ja."}, {"id": 635, "start": 3880.64, "end": 3883.64, "text": "Auf Platz 2 schafft es eine Katastrophe mit Anseige."}, {"id": 636, "start": 3883.64, "end": 3884.64, "text": "Battlefield?"}, {"id": 637, "start": 3884.64, "end": 3886.64, "text": "Der Release von Battlefield 2042."}, {"id": 638, "start": 3886.64, "end": 3888.64, "text": "Ich wusste es, ich wusste es, Battlefield."}, {"id": 639, "start": 3888.64, "end": 3890.64, "text": "Okay, wenn jetzt Battlefield kommt,"}, {"id": 640, "start": 3890.64, "end": 3894.64, "text": "dann ist Final bei Maurice garantiert Blizzard."}, {"id": 641, "start": 3894.64, "end": 3895.64, "text": "Muss."}, {"id": 642, "start": 3895.64, "end": 3897.64, "text": "Das ist bestimmt 100, ich könnte wetten."}, {"id": 643, "start": 3897.64, "end": 3900.64, "text": "...spiel jede Menge Alarmglocken klingeln"}, {"id": 644, "start": 3900.64, "end": 3903.64, "text": "und ein Monat Verschiebung war viel zu wenig,"}, {"id": 645, "start": 3903.64, "end": 3906.64, "text": "um die alle aus der Welt zu schaffen."}, {"id": 646, "start": 3906.64, "end": 3909.64, "text": "So ging Battlefield 2042 in einem schlichtweg"}, {"id": 647, "start": 3909.64, "end": 3912.64, "text": "inakzeptablen Zustand an den Start."}, {"id": 648, "start": 3912.64, "end": 3915.64, "text": "Die Performance enttäuschte selbst auf High-End-Rechnern,"}, {"id": 649, "start": 3915.64, "end": 3917.64, "text": "das Waffenhandling war lächerlich ungenau"}, {"id": 650, "start": 3917.64, "end": 3920.64, "text": "und es verging eigentlich keine Runde ohne auffällige Bugs."}, {"id": 651, "start": 3920.64, "end": 3925.64, "text": "Zum Beispiel das wundersame Senkrecht-Starter-Luftkissenboot hier."}, {"id": 652, "start": 3925.64, "end": 3927.64, "text": "Aber mehr noch, viele Fans kritisierten auch"}, {"id": 653, "start": 3927.64, "end": 3930.64, "text": "grinsch Sprüche."}, {"id": 654, "start": 3930.64, "end": 3932.64, "text": "Allen voran die Streichung der Klassen."}, {"id": 655, "start": 3932.64, "end": 3934.64, "text": "Angel does it again."}, {"id": 656, "start": 3934.64, "end": 3938.64, "text": "Einer der archätypischsten Merkmale von Battlefield als Serie."}, {"id": 657, "start": 3938.64, "end": 3940.64, "text": "Zugunsten der Specialists,"}, {"id": 658, "start": 3940.64, "end": 3942.64, "text": "die zwar immer noch Teamplay erlauben,"}, {"id": 659, "start": 3942.64, "end": 3945.64, "text": "aber dazu weniger Anreiz geben als vorher"}, {"id": 660, "start": 3945.64, "end": 3949.64, "text": "und wirken wie dem Hero-Shooter-Trend hinterhergerannt."}, {"id": 661, "start": 3949.64, "end": 3951.64, "text": "Und die Klassen waren nicht das einzige Feature,"}, {"id": 662, "start": 3951.64, "end": 3953.64, "text": "das DICE aus dem Spiel warf."}, {"id": 663, "start": 3953.64, "end": 3955.64, "text": "Es fehlten auch essentielle Funktionen"}, {"id": 664, "start": 3955.64, "end": 3957.64, "text": "wie Voice-Chat und ein Scoreboard."}, {"id": 665, "start": 3957.64, "end": 3962.64, "text": "Legacy Feature ist das Scoreboard, haben wir jetzt gelernt."}, {"id": 666, "start": 3962.64, "end": 3964.64, "text": "Oder wie Angel sagen würde,"}, {"id": 667, "start": 3964.64, "end": 3968.64, "text": "don't be sad, that's the way it works out sometimes."}, {"id": 668, "start": 3968.64, "end": 3970.64, "text": "Oder so ähnlich."}, {"id": 669, "start": 3970.64, "end": 3972.64, "text": "Ganz ähnlich wie bei E-Football,"}, {"id": 670, "start": 3972.64, "end": 3974.64, "text": "gab's auch hier eine brutale Quittung auf Steam."}, {"id": 671, "start": 3974.64, "end": 3977.64, "text": "Battlefield 2042 rangiert auf Platz 16"}, {"id": 672, "start": 3977.64, "end": 3979.64, "text": "der am schlechtesten bewerteten Spiele."}, {"id": 673, "start": 3979.64, "end": 3981.64, "text": "Ja, verdient, verdient."}, {"id": 674, "start": 3981.64, "end": 3984.64, "text": "I'm as shocked as you are, genau."}, {"id": 675, "start": 3984.64, "end": 3988.64, "text": "Es kassierte über 70.000 negative Reviews."}, {"id": 676, "start": 3988.64, "end": 3993.64, "text": "E-Football immerhin nur 22.000."}, {"id": 677, "start": 3993.64, "end": 3996.64, "text": "DICE hat zwar schon begonnen, das Spiel fleißig zu patchen"}, {"id": 678, "start": 3996.64, "end": 3998.64, "text": "und eine Roadmap vorgestellt,"}, {"id": 679, "start": 3998.64, "end": 4000.64, "text": "aber dieses Ruder noch mal herumzuweißen"}, {"id": 680, "start": 4000.64, "end": 4002.64, "text": "wird eine echte Mammut-Aufgabe."}, {"id": 681, "start": 4002.64, "end": 4005.64, "text": "Ich weiß gar nicht, warum da so viele zuversichtlich sind."}, {"id": 682, "start": 4005.64, "end": 4007.64, "text": "Bei Battlefield 4 hat das geklappt."}, {"id": 683, "start": 4007.64, "end": 4010.64, "text": "Ja, aber Battlefield 4 war von Anfang an ein gut durchdachtes Game."}, {"id": 684, "start": 4010.64, "end": 4012.64, "text": "Broken as fuck, aber ein gutes Game."}, {"id": 685, "start": 4012.64, "end": 4015.64, "text": "Battlefield 2042 ist absoluter Schrotthaufen"}, {"id": 686, "start": 4015.64, "end": 4018.64, "text": "auf Designersicht und auf..."}, {"id": 687, "start": 4021.64, "end": 4023.64, "text": "...vom Zustand her."}, {"id": 688, "start": 4023.64, "end": 4028.64, "text": "Also ich weiß nicht, warum die Leute da so zuversichtlich sind."}, {"id": 689, "start": 4028.64, "end": 4032.64, "text": "Die Steam-Spieler-Zahlen brachen nach Release so gnadenlos ein,"}, {"id": 690, "start": 4032.64, "end": 4037.64, "text": "dass teilweise der Vorgänger Battlefield 5 auf die gleiche Aktivität kam."}, {"id": 691, "start": 4037.64, "end": 4038.64, "text": "Geil, oder?"}, {"id": 692, "start": 4038.64, "end": 4041.64, "text": "Bleibt Battlefield 5 übrigens, grün ist 2042."}, {"id": 693, "start": 4041.64, "end": 4044.64, "text": "Ich sag's nur noch mal, weil's nicht mehr lange hin ist,"}, {"id": 694, "start": 4044.64, "end": 4048.64, "text": "dass Battlefield 5 das sogar umdreht und den Nachfolger überholt."}, {"id": 695, "start": 4048.64, "end": 4051.64, "text": "Denn für diesen dicken Anstieg am Ende der Kurve..."}, {"id": 696, "start": 4051.64, "end": 4054.64, "text": "Und by the way, die haben Battlefield 5 eingestellt dafür."}, {"id": 697, "start": 4054.64, "end": 4059.64, "text": "...2042 ein Gratiswochenende und einen dicken Sale gebraucht,"}, {"id": 698, "start": 4059.64, "end": 4064.64, "text": "was einen Monat nach Release allein schon ein echt übles Zeichen ist."}, {"id": 699, "start": 4064.64, "end": 4065.64, "text": "Ja."}, {"id": 700, "start": 4065.64, "end": 4067.64, "text": "Ey, soll ich euch mal einen zeigen,"}, {"id": 701, "start": 4067.64, "end": 4070.64, "text": "der's ähnlich schlecht hingekriegt hätte?"}, {"id": 702, "start": 4070.64, "end": 4075.64, "text": "Übrigens, das fehlt mir in Maurice's Liste auch noch, falls es jetzt nicht kommt."}, {"id": 703, "start": 4075.64, "end": 4077.64, "text": "Aber ich wette mit euch, es ist Blizzard."}, {"id": 704, "start": 4077.64, "end": 4080.64, "text": "Es gibt noch einen, der das ähnlich gut hinbekommt."}, {"id": 705, "start": 4080.64, "end": 4082.64, "text": "Mit Spielerzahlen verlieren."}, {"id": 706, "start": 4082.64, "end": 4084.64, "text": "Wir sind jetzt unter 100.000!"}, {"id": 707, "start": 4084.64, "end": 4086.64, "text": "Leute, an Weihnachten!"}, {"id": 708, "start": 4086.64, "end": 4087.64, "text": "An Weihnachten!"}, {"id": 709, "start": 4087.64, "end": 4090.64, "text": "Das muss man sich mal auf der Zunge zergehen lassen."}, {"id": 710, "start": 4090.64, "end": 4093.64, "text": "Also es ist jetzt quasi die Zeit, wo Leute Zeit haben, spielen können,"}, {"id": 711, "start": 4093.64, "end": 4095.64, "text": "mehr denn je als das ganze Jahr über."}, {"id": 712, "start": 4095.64, "end": 4099.64, "text": "Und die haben es tatsächlich geschafft, das erste Mal unter 100.000 zu droppen."}, {"id": 713, "start": 4099.64, "end": 4101.64, "text": "Das ist so ein..."}, {"id": 714, "start": 4101.64, "end": 4103.64, "text": "Wie sagen sie immer?"}, {"id": 715, "start": 4103.64, "end": 4105.64, "text": "Ein Train..."}, {"id": 716, "start": 4105.64, "end": 4107.64, "text": "Wie heißt das auf Englisch?"}, {"id": 717, "start": 4107.64, "end": 4109.64, "text": "Trainwreck oder so?"}, {"id": 718, "start": 4109.64, "end": 4111.64, "text": "Also das ist so im Arsch."}, {"id": 719, "start": 4111.64, "end": 4113.64, "text": "Das ist der Wahnsinn."}, {"id": 720, "start": 4113.64, "end": 4115.64, "text": "Also New World, das ist einfach mal..."}, {"id": 721, "start": 4115.64, "end": 4118.64, "text": "Das war aber auch Fail mit Ansagen, ne?"}, {"id": 722, "start": 4120.64, "end": 4122.64, "text": "Ist doch noch okay."}, {"id": 723, "start": 4122.64, "end": 4124.64, "text": "Ja."}, {"id": 724, "start": 4124.64, "end": 4126.64, "text": "92% der Spieler verlieren."}, {"id": 725, "start": 4126.64, "end": 4129.64, "text": "Das ist sicherlich noch okay, ja?"}, {"id": 726, "start": 4132.64, "end": 4135.64, "text": "Wir haben ja stehen geblieben hier."}, {"id": 727, "start": 4137.64, "end": 4140.64, "text": "Aber all das verblasst gegen Platz 1."}, {"id": 728, "start": 4140.64, "end": 4141.64, "text": "Und seien wir ehrlich..."}, {"id": 729, "start": 4141.64, "end": 4143.64, "text": "Blizzard, ich wusste es."}, {"id": 730, "start": 4143.64, "end": 4144.64, "text": "Wir wussten es."}, {"id": 731, "start": 4144.64, "end": 4147.64, "text": "Es ist Maurice, da musste Blizzard kommen."}, {"id": 732, "start": 4147.64, "end": 4149.64, "text": "Da musste Blizzard kommen."}, {"id": 733, "start": 4149.64, "end": 4153.64, "text": "Aber New World hätte es durchaus da auch noch reingeschafft."}, {"id": 734, "start": 4153.64, "end": 4155.64, "text": "...hier stehen muss."}, {"id": 735, "start": 4155.64, "end": 4160.64, "text": "Keine Firma ist in der Geschichte des Gaming so tief gefallen wie Activision Blizzard."}, {"id": 736, "start": 4160.64, "end": 4164.64, "text": "Und vor allem natürlich der Blizzard-Teil der Firma."}, {"id": 737, "start": 4164.64, "end": 4166.64, "text": "Kaum ein Entwickler genoss zu seinem ganzes Zeichen..."}, {"id": 738, "start": 4166.64, "end": 4171.64, "text": "Ich hab letztens ein Video gesehen von einem Warcraft 3 Level-Designer."}, {"id": 739, "start": 4171.64, "end": 4176.64, "text": "Und er hat ein bisschen über Blizzard, wo er gearbeitet hat,"}, {"id": 740, "start": 4176.64, "end": 4178.64, "text": "und aktuell in Blizzard geredet."}, {"id": 741, "start": 4178.64, "end": 4182.64, "text": "Und er hat halt zum Schluss gemeint, Leute, hört auf euch das so sinngemäß."}, {"id": 742, "start": 4182.64, "end": 4184.64, "text": "Ich krieg's jetzt zitatmäßig nicht hin."}, {"id": 743, "start": 4184.64, "end": 4188.64, "text": "Leute, hört auf euch einzureden, dass da noch irgendwas übrig..."}, {"id": 744, "start": 4188.64, "end": 4190.64, "text": "Der Easter-Egg-Typ, genau den meine ich."}, {"id": 745, "start": 4190.64, "end": 4193.64, "text": "Hört auf euch einzureden, dass da noch was übrig ist."}, {"id": 746, "start": 4193.64, "end": 4195.64, "text": "Das alte Blizzard gibt's nicht mehr."}, {"id": 747, "start": 4195.64, "end": 4198.64, "text": "Und was ich witzig fand, was er in seinen Videos erzählt hat,"}, {"id": 748, "start": 4198.64, "end": 4204.64, "text": "dass er vom ehemaligen Blizzard-Chef und von Jeff Kaplan rausgemobbt wurde als Level-Designer."}, {"id": 749, "start": 4204.64, "end": 4207.64, "text": "Also damals war sicherlich auch nicht alles rosig."}, {"id": 750, "start": 4208.64, "end": 4211.64, "text": "Aber Papa Jeff war ja eh früher so der richtig krasse Flamer."}, {"id": 751, "start": 4211.64, "end": 4216.64, "text": "Es gibt ja noch Posts von ihm, ich weiß nicht, ob das jemand, weil er sich angeguckt hat,"}, {"id": 752, "start": 4216.64, "end": 4220.64, "text": "wo er EverQuest 2, das war ja damals, bevor er zu Blizzard gegangen ist,"}, {"id": 753, "start": 4220.64, "end": 4224.64, "text": "war er einer der besten Raid-Gilden von EverQuest 2."}, {"id": 754, "start": 4224.64, "end": 4227.64, "text": "Und er hat so krass geflamt im Forum damals."}, {"id": 755, "start": 4228.64, "end": 4232.64, "text": "Würde man von Papa Jeff heutzutage gar nicht mehr erwarten, aber..."}, {"id": 756, "start": 4233.64, "end": 4235.64, "text": "Das war auch mal ein junger Flamer."}, {"id": 757, "start": 4235.64, "end": 4241.64, "text": "Er hatte einen so unangreifbaren Ruf als die Bastion der Gaming-Perfektion."}, {"id": 758, "start": 4241.64, "end": 4246.64, "text": "Kaum ein Spieler ist nicht zumindest mit irgendeiner Blizzard-Marke aufgewachsen."}, {"id": 759, "start": 4246.64, "end": 4250.64, "text": "Bei mir war es Diablo, das mir am Herzen lag wie wenige Schindler-Serien."}, {"id": 760, "start": 4250.64, "end": 4254.64, "text": "Ich meine, die hatten damals einen richtig krassen Rand, muss man sich mal überlegen."}, {"id": 761, "start": 4254.64, "end": 4259.64, "text": "Ich glaube, das erste Blizzard-Spiel war sogar Warcraft 2."}, {"id": 762, "start": 4261.64, "end": 4263.64, "text": "Aber die hatten richtig krasse Sachen."}, {"id": 763, "start": 4263.64, "end": 4268.64, "text": "Die hatten von Diablo bis StarCraft, bis dann später Warcraft 3."}, {"id": 764, "start": 4268.64, "end": 4272.64, "text": "Das war dann auch so, wo ich aufgehört habe, so richtig alles, was Blizzard gemacht hat zu spielen."}, {"id": 765, "start": 4274.64, "end": 4276.64, "text": "Die hatten so viele geile Sachen."}, {"id": 766, "start": 4278.64, "end": 4283.64, "text": "Also, man hat eigentlich gedacht, die können keinen Mist produzieren."}, {"id": 767, "start": 4284.64, "end": 4286.64, "text": "Alles, was die raushauen, ist geil."}, {"id": 768, "start": 4287.64, "end": 4291.64, "text": "Ich habe angefangen, Warcraft 2 zu spielen, fand ich nice."}, {"id": 769, "start": 4291.64, "end": 4293.64, "text": "Dann kam Diablo 1."}, {"id": 770, "start": 4293.64, "end": 4297.64, "text": "Diablo 1, absolut wegweisendes Ding."}, {"id": 771, "start": 4297.64, "end": 4301.64, "text": "Dann kam irgendwann StarCraft, auch ultra geil."}, {"id": 772, "start": 4301.64, "end": 4303.64, "text": "Und natürlich Diablo 2."}, {"id": 773, "start": 4303.64, "end": 4307.64, "text": "Diablo 2 ist, glaube ich, eines meiner meistgespielten Sucht-Games aller Zeiten."}, {"id": 774, "start": 4307.64, "end": 4309.64, "text": "Und dann Warcraft 3."}, {"id": 775, "start": 4309.64, "end": 4311.64, "text": "Das habe ich bei weitem nicht mal so viel gespielt."}, {"id": 776, "start": 4313.64, "end": 4315.64, "text": "Ich habe fast nur Singleplayer gespielt."}, {"id": 777, "start": 4315.64, "end": 4319.64, "text": "Ich habe StarCraft 1, habe ich ja sogar Battle.net gespielt damals."}, {"id": 778, "start": 4319.64, "end": 4321.64, "text": "Aber Warcraft 3 habe ich nur Kampagne gespielt."}, {"id": 779, "start": 4321.64, "end": 4323.64, "text": "War auch ein super Game."}, {"id": 780, "start": 4323.64, "end": 4326.64, "text": "Aber danach war es bei mir mit Blizzard ein bisschen vorbei."}, {"id": 781, "start": 4326.64, "end": 4330.64, "text": "Ich habe World of Warcraft nebenbei, neben Daug ein bisschen gespielt damals."}, {"id": 782, "start": 4330.64, "end": 4335.64, "text": "Aber danach war es das für mich mit Blizzard."}, {"id": 783, "start": 4335.64, "end": 4337.64, "text": "Dann kam irgendwann StarCraft 2 oder so."}, {"id": 784, "start": 4337.64, "end": 4339.64, "text": "Ich weiß gar nicht in welcher Reihenfolge."}, {"id": 785, "start": 4339.64, "end": 4341.64, "text": "Hearthstone habe ich auch noch ein bisschen gespielt."}, {"id": 786, "start": 4341.64, "end": 4348.64, "text": "Aber die hatten innerhalb von 5 Jahren, haben die einfach mega krasse Games rausgehauen."}, {"id": 787, "start": 4348.64, "end": 4350.64, "text": "Das ging los, wie gesagt."}, {"id": 788, "start": 4350.64, "end": 4356.64, "text": "Warcraft 2 und ging bis Diablo 2, Warcraft 3."}, {"id": 789, "start": 4356.64, "end": 4362.64, "text": "Also 5, 6, 7 Jahre haben die quasi nach und nach absolut weg..."}, {"id": 790, "start": 4362.64, "end": 4364.64, "text": "Stimmt, Overwatch habe ich ganz vergessen."}, {"id": 791, "start": 4364.64, "end": 4365.64, "text": "Natürlich habt ihr recht."}, {"id": 792, "start": 4365.64, "end": 4367.64, "text": "Overwatch habe ich schon wieder so verdrängt."}, {"id": 793, "start": 4369.64, "end": 4373.64, "text": "Die haben diese 5, 6 Jahre einfach wegweisende Spiele nacheinander rausgehauen."}, {"id": 794, "start": 4373.64, "end": 4375.64, "text": "Das ist jetzt einfach schon lange vorbei."}, {"id": 795, "start": 4375.64, "end": 4378.64, "text": "Vielleicht waren es Warcraft oder StarCraft."}, {"id": 796, "start": 4378.64, "end": 4382.64, "text": "Und deswegen haben wir uns die letzten Jahre auch so hart getroffen."}, {"id": 797, "start": 4382.64, "end": 4387.64, "text": "Weil Blizzard für viele eben mehr war als nur ein Erzeuger von Entertainment-Produkten."}, {"id": 798, "start": 4387.64, "end": 4389.64, "text": "Blizzard war unsere Kindheit."}, {"id": 799, "start": 4389.64, "end": 4394.64, "text": "Blizzard war eine der tiefsten Wurzeln meiner Gaming-Leidenschaft."}, {"id": 800, "start": 4394.64, "end": 4399.64, "text": "Und ich dachte, nach dem Blitzschrank-Skandal könnten sie schon nicht mehr viel tiefer sinken."}, {"id": 801, "start": 4399.64, "end": 4402.64, "text": "Ich dachte, nach Warcraft 3 Reforge konnten sie nicht mehr tiefer sinken."}, {"id": 802, "start": 4402.64, "end": 4404.64, "text": "Es geht immer weiter runter."}, {"id": 803, "start": 4404.64, "end": 4406.64, "text": "Oh, sweet summer child."}, {"id": 804, "start": 4406.64, "end": 4410.64, "text": "2021 verklagte der Staat Californien Activision..."}, {"id": 805, "start": 4410.64, "end": 4412.64, "text": "Ich finde das immer noch heftig."}, {"id": 806, "start": 4412.64, "end": 4415.64, "text": "Das musst du erst mal schaffen, dass sich der Staat Californien verklagt."}, {"id": 807, "start": 4415.64, "end": 4422.64, "text": "Weil die Firma Frauen und Minderheiten jahrelang systematisch benachteiligt und misshandelt haben soll."}, {"id": 808, "start": 4422.64, "end": 4424.64, "text": "Gipfel der Anschuldigungen."}, {"id": 809, "start": 4424.64, "end": 4431.64, "text": "Eine Mitarbeiterin soll sich als Folge dieser frauenfeindlichen Kultur auf eine Geschäftsreise das Leben genommen haben."}, {"id": 810, "start": 4431.64, "end": 4435.64, "text": "Es ist mega heftiges Zeug, wenn man sich damit mal beschäftigt."}, {"id": 811, "start": 4435.64, "end": 4437.64, "text": "Es gibt ja noch viel mehr Sachen."}, {"id": 812, "start": 4437.64, "end": 4444.64, "text": "Das CEO Bobby Kotick, seine Assistentin, einmal per Sprachnachricht ankündigte, dass er sie ermorden lassen will."}, {"id": 813, "start": 4444.64, "end": 4448.64, "text": "Und das ist wirklich nur die Spitze des Eisbergs."}, {"id": 814, "start": 4448.64, "end": 4453.64, "text": "Ich kann die ganze Bandbreite der ekelhaften Vorkommnisse in diesem Video nur anreißen."}, {"id": 815, "start": 4453.64, "end": 4458.64, "text": "Wir haben aber eine eigene Talkrunde und einen Sammelartikel zu dem Skandal erstellt,"}, {"id": 816, "start": 4458.64, "end": 4461.64, "text": "wenn ihr euch ein umfassenderes Bild machen wollt."}, {"id": 817, "start": 4461.64, "end": 4469.64, "text": "Was viele Spieler wohl am meisten traf, war, dass es hier eben nicht nur um die bösen Anzugträger wie Bobby Kotick ging."}, {"id": 818, "start": 4469.64, "end": 4473.64, "text": "Es waren auch viele führende Entwickler unserer Lieblingsspiele."}, {"id": 819, "start": 4473.64, "end": 4478.64, "text": "Die ganz alte Garde von Blizzard, die plötzlich in völlig neuem Licht dastand."}, {"id": 820, "start": 4478.64, "end": 4485.64, "text": "Der ehemalige Blizzard-CEO Mike Morhaime und der langjährige Story-Gurro Chris Metzen entschuldigten sich beide für die Vorkommnisse."}, {"id": 821, "start": 4485.64, "end": 4490.64, "text": "Aber gaben sich auch überrascht, als hätten sie selbst kaum etwas davon gewusst."}, {"id": 822, "start": 4490.64, "end": 4494.64, "text": "Und beide erhielten Antworten von ehemaligen Mitarbeiterinnen,"}, {"id": 823, "start": 4494.64, "end": 4500.64, "text": "dass sie sehr wohl Teil der frauenfeindlichen Blizzard-Kultur waren und diese aktiv beförderten."}, {"id": 824, "start": 4500.64, "end": 4504.64, "text": "Selbst wenn sich Frauen hilfesuchend an sie wandten."}, {"id": 825, "start": 4506.64, "end": 4514.64, "text": "Auch in der Anklage steht, dass die Firma und ihre Chefs im Zweifelsfall eher die Täter in Schutz nahmen und die Opfer bestraften, wenn sie..."}, {"id": 826, "start": 4514.64, "end": 4517.64, "text": "Ja, weil das mehr Stonks gibt unterm Strich."}, {"id": 827, "start": 4518.64, "end": 4519.64, "text": "Ja."}, {"id": 828, "start": 4519.64, "end": 4524.64, "text": "Oder man hat sich halt außergerichtlich irgendwie geeinigt und es bloß nicht an die große Glocke zu hängen."}, {"id": 829, "start": 4524.64, "end": 4525.64, "text": "...den Mund aufmachten."}, {"id": 830, "start": 4525.64, "end": 4532.64, "text": "Bobby Kotick soll laut Ermittlungen des Wall Street Journals sogar Vergewaltigungsfälle bei Sledgehammer Games unter den Tisch gekriegt haben."}, {"id": 831, "start": 4532.64, "end": 4534.64, "text": "Ja, das ist das, was ich meine."}, {"id": 832, "start": 4534.64, "end": 4541.64, "text": "Da hat man sich dann außergerichtlich geeinigt und er hat nicht im Aufsichtsrat danach Bescheid gesagt, was er eigentlich hätte machen müssen."}, {"id": 833, "start": 4541.64, "end": 4542.64, "text": "...gehehrt haben."}, {"id": 834, "start": 4542.64, "end": 4547.64, "text": "Zwar nahmen nach den Enthüllungen viele führende Köpfe ihren Hut oder wurden gefeuert."}, {"id": 835, "start": 4547.64, "end": 4551.64, "text": "Darunter Blizzard-Präsident J. Allen Bragg und der Game Director von Diablo 4."}, {"id": 836, "start": 4551.64, "end": 4553.64, "text": "Aber trotzdem ließ die Reaktion von Activision Blizzard..."}, {"id": 837, "start": 4553.64, "end": 4564.64, "text": "Tja, ich denke mal, Jett, das wird so ein Zwischending sein aus, abhängig davon sein, dass man Geld verdient und im Zweifelsfall auch nicht wissen, wo man sonst was anderes bekommt."}, {"id": 838, "start": 4565.64, "end": 4569.64, "text": "Du kannst dir in der Regel nur Leute richtig ausnutzen, wenn sie auch noch besonders abhängig von dir sind."}, {"id": 839, "start": 4569.64, "end": 4571.64, "text": "Weil ansonsten sind sie einfach instant weg."}, {"id": 840, "start": 4571.64, "end": 4574.64, "text": "...einiges zu wünschen übrig."}, {"id": 841, "start": 4574.64, "end": 4578.64, "text": "Wie Bobby noch CEO sein kann, ganz einfach, weil er fette Kohle macht."}, {"id": 842, "start": 4578.64, "end": 4583.64, "text": "Angesichts stetig wachsender Mitarbeiterproteste hält die Firma etwa an Bobby Kotick als CEO fest."}, {"id": 843, "start": 4583.64, "end": 4589.64, "text": "Und behauptet, er sei der Richtige, um den tolerantesten und offensten Arbeitsplatz wegzugehen."}, {"id": 844, "start": 4589.64, "end": 4593.64, "text": "Ja, bla, bla, bla, bla, was? Das ist so ein Gelaber."}, {"id": 845, "start": 4593.64, "end": 4595.64, "text": "Das ist einfach nur Bullshit."}, {"id": 846, "start": 4595.64, "end": 4607.64, "text": "Es hat sich ja mittlerweile rausgestellt, dass die, ähm, die hatten ja irgendeine Frau eingestellt für Integration und, äh, Harassment und sonst was."}, {"id": 847, "start": 4607.64, "end": 4610.64, "text": "Und die sollte sich eigentlich die Sache annehmen."}, {"id": 848, "start": 4610.64, "end": 4615.64, "text": "Und die hat dann eine Mail geschrieben, wie geil es eigentlich ist, bei Blizzard arbeiten zu können."}, {"id": 849, "start": 4615.64, "end": 4619.64, "text": "Und im Nachhinein hat sich rausgestellt, Bobby hat diese Mail in ihrem Namen geschrieben."}, {"id": 850, "start": 4619.64, "end": 4620.64, "text": "Das hat er sogar zugegeben."}, {"id": 851, "start": 4620.64, "end": 4626.64, "text": "Also, das ist einfach nur komplette Augenwischerei und dummes Gelaber, den geht's nur um Stonks und Geld."}, {"id": 852, "start": 4626.64, "end": 4637.64, "text": "Und wahrscheinlich hat Bobby seine besten Buddys da an den passenden Positionen, ähm, untergebracht, dass, äh, er nicht so einfach abgesägt werden kann."}, {"id": 853, "start": 4638.64, "end": 4643.64, "text": "Tolerantesten und offensten Arbeitsplatz der Gamingbranche zu schaffen."}, {"id": 854, "start": 4644.64, "end": 4646.64, "text": "Gleichzeitig erklärte man..."}, {"id": 855, "start": 4646.64, "end": 4650.64, "text": "Ja, dazu kann man wirklich nur sagen..."}, {"id": 856, "start": 4652.64, "end": 4664.64, "text": "...Belger vom kalifornischen Amt für faire Arbeitsbedingungen hätten sich, Zitat, schändlich und unprofessionell verhalten und ein verzerrtes Bild der Blizzard-Geschichte gezeichnet."}, {"id": 857, "start": 4664.64, "end": 4672.64, "text": "Außerdem geht die Firma bis heute immer wieder dagegen vor, dass sich die Mitarbeiter zu sehr organisieren und etwa eine Gewerkschaft gründen."}, {"id": 858, "start": 4672.64, "end": 4679.64, "text": "Das ist aber so ein allgemeines Ding. Guckt euch bei Amazon an. Ist ja gut oder schlecht, aber das würde ich jetzt nicht in dem gleichen Kontext sehen."}, {"id": 859, "start": 4679.64, "end": 4682.64, "text": "Dass die da nicht schafft drauf sind, ist ja bekannt."}, {"id": 860, "start": 4682.64, "end": 4692.64, "text": "Blizzard nach J. Allen Braggs Abgang eine Doppelführung aus Jen O'Neil und Mikey Barra an die Spitze von Blizzard setzte, hielt das gerade mal ein paar Monate, bevor Jen O'Neil ihren Hut nahm."}, {"id": 861, "start": 4692.64, "end": 4702.64, "text": "Weil die Firma sich nach all dem ernsthaft weigerte, ihr das gleiche Gehalt zu zahlen wie ihrem männlichen Kollegen."}, {"id": 862, "start": 4702.64, "end": 4707.64, "text": "Kurzum, nichts davon erweckt den Eindruck einer Firma, deren Chefs ernsthaft um besseren Gemüts sind."}, {"id": 863, "start": 4707.64, "end": 4710.64, "text": "Nö. Überhaupt gar nicht."}, {"id": 864, "start": 4710.64, "end": 4722.64, "text": "Die so Sachen wie, wir benennen McCree um, das ist rein öffentliche Marketing-Stonks-Versuche, sich in ein besseres Licht zu rücken."}, {"id": 865, "start": 4722.64, "end": 4730.64, "text": "Nicht, weil man wirklich grundsätzlich was ändern will. Also mit dem Umbenennen von McCree ändert man sicherlich nicht die Firmenkultur komplett."}, {"id": 866, "start": 4730.64, "end": 4737.64, "text": "Das mag da vielleicht Teil von sein, aber diese einzelnen Dinge, die sind einfach nur vorgeschoben."}, {"id": 867, "start": 4737.64, "end": 4741.64, "text": "Um zu zeigen, seht her, seht her, wir machen was, um wirklich nichts zu machen."}, {"id": 868, "start": 4741.64, "end": 4750.64, "text": "Wenn die Mitarbeiter weiter leidenschaftlich dafür kämpfen. Und das traurigste an all dem ist wohl, dass es sich inzwischen nicht mehr wie ein Einzelfall anfühlt."}, {"id": 869, "start": 4750.64, "end": 4762.64, "text": "Das traurigste daran, für mich so als jemand der Spiele mag, ist, dass dort auch immer noch Leute arbeiten, die tatsächlich alles geben, um gute Games zu machen."}, {"id": 870, "start": 4762.64, "end": 4768.64, "text": "Und die trifft's jetzt doppelt. Die haben scheiß Arbeitsbedingungen."}, {"id": 871, "start": 4768.64, "end": 4775.64, "text": "Und im Zweifelsfall verlieren sie noch ihren Job, weil das Management es so verkackt hat und die Leute jetzt die Games nicht mehr kaufen und sowas."}, {"id": 872, "start": 4775.64, "end": 4779.64, "text": "Das ist ein äußerst vielschichtiges Problem."}, {"id": 873, "start": 4779.64, "end": 4786.64, "text": "Und das ist einfach nur mega für'n Arsch. Und die machen nicht den Eindruck, als haben die irgendwie Bock daran, was zu ändern."}, {"id": 874, "start": 4786.64, "end": 4791.64, "text": "Warum soll der unbenannt werden? Der wurde unbenannt."}, {"id": 875, "start": 4791.64, "end": 4797.64, "text": "Weil McCree wohl nach einem Blizzard-Mitarbeiter benannt wurde, der in diese ganze Geschichte verwickelt ist."}, {"id": 876, "start": 4797.64, "end": 4801.64, "text": "Ubisoft bis hin zu Activision Blizzard und vielen weiteren Fällen."}, {"id": 877, "start": 4801.64, "end": 4805.64, "text": "Wir alle müssten der Tatsache ins Gesicht sehen, dass die Gaming-Branche..."}, {"id": 878, "start": 4805.64, "end": 4810.64, "text": "Ubisoft ist auch so'n Scheißladen. Die haben erst vor einer Woche wieder massig Leute entlassen."}, {"id": 879, "start": 4810.64, "end": 4817.64, "text": "Oder vor zwei Wochen. So, wisst ihr, das ist doch mal super nett, oder? Mal kurz vor Weihnachten einfach mal Leute entlassen."}, {"id": 880, "start": 4817.64, "end": 4828.64, "text": "Nicht das Kindheitsidyll, nicht der Traum-Spielplatz, nicht der sichere Ort ist, den wir uns vielleicht ausmalten, als wir dieses Hobby zum ersten Mal für uns entdeckten."}, {"id": 881, "start": 4828.64, "end": 4829.64, "text": "Ja, aber Rista, hast du recht."}, {"id": 882, "start": 4829.64, "end": 4835.64, "text": "Denn das hier ist nie wirklich wahr. Nun bleibt nur noch die Frage, wie wir damit umgehen."}, {"id": 883, "start": 4835.64, "end": 4837.64, "text": "Ja, alle recht."}, {"id": 884, "start": 4837.64, "end": 4863.64, "text": "Ist leider so."}, {"id": 885, "start": 4863.64, "end": 4887.64, "text": "Twitter-Empörung, ja."}, {"id": 886, "start": 4887.64, "end": 4907.64, "text": "Ja, das ist typisch, das ist wirklich Twitter. Genauso ist Twitter."}, {"id": 887, "start": 4907.64, "end": 4921.64, "text": "Patriachat ist daran schuld, kommt. Also das ist typische Twitter-Antwort."}, {"id": 888, "start": 4937.64, "end": 4961.64, "text": "Wer zum Teufel ist Helen Keller? Das ist irgendeine Ami-Kakona-Geschichte, oder? Ich weiß nicht, wer das ist."}, {"id": 889, "start": 4961.64, "end": 4977.64, "text": "Genau so ist Twitter. Das trifft es ziemlich gut. Was auch der Grund ist, warum mein Twitter auf Andorra steht und nicht auf Deutschland, weil da muss ich mir deutsche Trends angucken."}, {"id": 890, "start": 4977.64, "end": 4991.64, "text": "Und deutsche Trends auf Twitter sind Paints-Champ. Ich werde es euch beweisen. Ich weiß nicht, was für Twitter-Trends in Deutschland heute aktiv sind, aber ich wette mit euch, zwei Drittel davon sind ganz, ganz hochgradiger Paints-Champ."}, {"id": 891, "start": 4991.64, "end": 4999.64, "text": "So, zeig her."}, {"id": 892, "start": 4999.64, "end": 5009.64, "text": "Bestimmt Paints-Champ?"}, {"id": 893, "start": 5009.64, "end": 5017.64, "text": "Ich weiß nicht, was das ist, aber wahrscheinlich auch Paints-Champ."}, {"id": 894, "start": 5017.64, "end": 5045.64, "text": "Okay, es ist Weihnachten, das ist gar nicht so schlimm. Aber deutsche Twitter-Trends sind einfach abpackt."}, {"id": 895, "start": 5045.64, "end": 5061.64, "text": "Ich habe richtig reingespachtelt gestern. Gestern war richtig Pepofet angesagt. Extremes Pepofet war gestern angesagt."}, {"id": 896, "start": 5061.64, "end": 5067.64, "text": "So, gucken wir mal weiter. Was können wir als nächstes angucken?"}, {"id": 897, "start": 5067.64, "end": 5085.64, "text": "What's on my home server? Da mache ich auch so ein Video."}, {"id": 898, "start": 5085.64, "end": 5097.64, "text": "13 Advanced JIT-Techniken."}, {"id": 899, "start": 5097.64, "end": 5105.64, "text": "Level-Captchi-Bait, Alter."}, {"id": 900, "start": 5105.64, "end": 5115.64, "text": "Warum Auto-Play von Videos? Was ist hier los? Auto-Play 2021."}, {"id": 901, "start": 5115.64, "end": 5121.64, "text": "What's on my home server? Okay, zeig her. Was ist auf deinem Home Server?"}, {"id": 902, "start": 5121.64, "end": 5137.64, "text": "Der Wolfgang ist am Start."}, {"id": 903, "start": 5137.64, "end": 5165.64, "text": "Ungefähr so sieht man Schreibtisch auch gerade aus. So, geht in die Richtung."}, {"id": 904, "start": 5165.64, "end": 5171.64, "text": "Habe ich gar nicht. Ich hatte auch mal so ein Dashboard, aber ich habe es nie verwendet."}, {"id": 905, "start": 5171.64, "end": 5179.64, "text": "Okay, lass mal gucken, was hat er denn? Jellyfin, das ist irgendwie so eine Downloader-Geschichte, oder?"}, {"id": 906, "start": 5179.64, "end": 5187.64, "text": "Oder ist Jellyfin eine Plex-Alternative? Ich bringe das gerade durcheinander."}, {"id": 907, "start": 5187.64, "end": 5197.64, "text": "Ich glaube, das hier sind beides Downloader. Ich glaube, Radar und Solar sind auf jeden Fall irgendwelche Torrent-Download-Geschichten oder so."}, {"id": 908, "start": 5197.64, "end": 5207.64, "text": "Deluge weiß ich jetzt nicht, was es ist. OpenBooks klingt halt wie... Im Prinzip ist das hier wahrscheinlich das, wo er seine Sicherheitskopien speichert."}, {"id": 909, "start": 5207.64, "end": 5214.64, "text": "Werden natürlich nur und Linux-ISOs. Also das hier ist für Sicherheitskopien und Linux-ISOs."}, {"id": 910, "start": 5214.64, "end": 5222.64, "text": "Passwort-Manager, Foto-Manager, ja, File-Sync, Kalender-Sync für seine Netzwerk-Geschichten."}, {"id": 911, "start": 5222.64, "end": 5228.64, "text": "Wahrscheinlich hauptsächlich WLAN-Controller und falls er Kameras hat, wahrscheinlich hauptsächlich WLAN-Controller."}, {"id": 912, "start": 5228.64, "end": 5236.64, "text": "Zum Management-Jacket, keine Ahnung. Fritzbox ist klar. PyKVM ist auch klar. PyHole, gut."}, {"id": 913, "start": 5236.64, "end": 5244.64, "text": "DNS, Adblock, Gedöns, Foscon, das ist ZigBee, Gedöns und Home Assistant."}, {"id": 914, "start": 5244.64, "end": 5250.64, "text": "Okay, jetzt wissen wir eigentlich schon alles. Müssen wir uns gerade angucken."}, {"id": 915, "start": 5250.64, "end": 5265.64, "text": "Wir skippen das jetzt. Wir skippen jetzt vor zur Home-Automation, weil ich glaube, der Rest ist nicht sonderlich spannend."}, {"id": 916, "start": 5265.64, "end": 5273.64, "text": "GW, warum nicht CACW? Ja, ZigBee."}, {"id": 917, "start": 5273.64, "end": 5283.64, "text": "Ja, das verwende ich unter der Haube auch. Also ich habe einen KonBee-2-Stick, das ist vom gleichen Hersteller,"}, {"id": 918, "start": 5283.64, "end": 5299.64, "text": "der auch das macht, wobei ich das hier nicht die Cons verwende, sondern ZigBee-2-MQTT."}, {"id": 919, "start": 5299.64, "end": 5313.64, "text": "Klappt sein ganzes Home-Automation-System noch, wenn das Internet ausfällt? Ja, wahrscheinlich."}, {"id": 920, "start": 5313.64, "end": 5319.64, "text": "Das ist ja der Vorteil, wenn er das lokal mit ZigBee-Geräten macht."}, {"id": 921, "start": 5319.64, "end": 5329.64, "text": "Also meins geht auch noch, wenn das Internet ausfällt. Wo es bei mir nicht mehr geht, ist, wenn ich meinen Home-Automation-Server ausschalte."}, {"id": 922, "start": 5349.64, "end": 5365.64, "text": "So viel hat er da gar nicht drin. Er hat ein paar Thermostate, die Standard-Sonne ist auf, ist untergegangen und ein paar Lichter."}, {"id": 923, "start": 5365.64, "end": 5373.64, "text": "So viel ist da gar nicht dabei. Also ich habe bei mir das ähnlich wie er, nur dass ich das Raum basiert habe."}, {"id": 924, "start": 5373.64, "end": 5379.64, "text": "Also ich habe hier das Arbeitszimmer, Moment, ich mache es mal kurz auf, aber so, dass ihr es nicht sehen könnt, weil da ist zu viel Leak."}, {"id": 925, "start": 5379.64, "end": 5389.64, "text": "Ich habe ein Home-Dashboard, da sieht man, wer daheim ist und der Batteriestand und Außentemperatur und Müllkalender und offene Fenster und Heizungstruck im Keller."}, {"id": 926, "start": 5389.64, "end": 5394.64, "text": "Tankstellen in der Nähe, Heizungstemperatur, das habe ich auf dem Dashboard."}, {"id": 927, "start": 5394.64, "end": 5399.64, "text": "Dann habe ich fürs Wohnzimmer einen Tab, dann habe ich fürs Arbeitszimmer und Serverraum einen Tab."}, {"id": 928, "start": 5399.64, "end": 5407.64, "text": "Dann habe ich fürs Klo einen extra Tab in meinem Home Assistant, weil mein Bad braucht einen extra Tab."}, {"id": 929, "start": 5407.64, "end": 5414.64, "text": "Dann habe ich die Küche drin und den Keller und den Stall."}, {"id": 930, "start": 5414.64, "end": 5429.64, "text": "Im Stall ist ein Temperaturfühler für den Fischteich und eine Steckdose."}, {"id": 931, "start": 5429.64, "end": 5444.64, "text": "Ich schiebe die großen Lichter an, dann kann ich sie öffnen."}, {"id": 932, "start": 5444.64, "end": 5447.64, "text": "Das ist, denke ich, ziemlich cool, eine Menge gute Kälte im Leben."}, {"id": 933, "start": 5447.64, "end": 5454.64, "text": "Und der Grund, warum ich kein Cloud-Sensor habe, ist, weil ich kein Methan-Sensor habe."}, {"id": 934, "start": 5454.64, "end": 5462.64, "text": "Vielleicht IKEA Smart-Home-Stuff oder Philips, ist, weil ich voll Kontrolle über meine Smart-Home-Device haben will."}, {"id": 935, "start": 5462.64, "end": 5466.64, "text": "Mach doch mal einen Screenshot von deinem Home Assistant."}, {"id": 936, "start": 5466.64, "end": 5468.64, "text": "Okay."}, {"id": 937, "start": 5468.64, "end": 5472.64, "text": "Ich will absolut selbstsufficient sein, ich will ohne Internet arbeiten."}, {"id": 938, "start": 5472.64, "end": 5475.64, "text": "Auch wenn nichts mehr funktioniert, auch wenn ich kein Internet habe."}, {"id": 939, "start": 5475.64, "end": 5479.64, "text": "Ich will, dass mein Heizungsgerät immer noch funktioniert, wie ein normaler Heizungsgerät."}, {"id": 940, "start": 5479.64, "end": 5485.64, "text": "Aber ich will auch, dass es so schön ist, wenn du aus der Runde gehst, und du denkst, du hast vergessen, die Lichter zu öffnen."}, {"id": 941, "start": 5485.64, "end": 5487.64, "text": "Aber jetzt bin ich zu langweilig, und dann machst du das."}, {"id": 942, "start": 5487.64, "end": 5488.64, "text": "Und bam, die Lichter sind aus."}, {"id": 943, "start": 5488.64, "end": 5494.64, "text": "Ich weiß, es klingt wie ein Bunch von Problemen aus dem ersten Welt, wo du zu langweilig bist, um die Lichter zu öffnen."}, {"id": 944, "start": 5494.64, "end": 5497.64, "text": "Aber ich sage nicht, dass es ein Spaßprojekt für mich war."}, {"id": 945, "start": 5497.64, "end": 5501.64, "text": "Und ich denke, ich werde versuchen, mehr und mehr von meinen Smart-Home-Devices zu machen."}, {"id": 946, "start": 5501.64, "end": 5502.64, "text": "Nur um den Zweck."}, {"id": 947, "start": 5502.64, "end": 5506.64, "text": "Nicht, weil ich zu langweilig bin, sondern weil es einfach Spaß macht."}, {"id": 948, "start": 5506.64, "end": 5512.64, "text": "Also werde ich dich definitiv auf das Posten halten, und du solltest sehr bald ein Video über Smart-Home erwarten."}, {"id": 949, "start": 5512.64, "end": 5515.64, "text": "Was in der Sprache meines Channels vielleicht dieses Jahr ist."}, {"id": 950, "start": 5515.64, "end": 5517.64, "text": "Ich weiß nicht, ich kann mir nichts versprechen."}, {"id": 951, "start": 5517.64, "end": 5518.64, "text": "Also ja, das ist es eigentlich."}, {"id": 952, "start": 5518.64, "end": 5520.64, "text": "Das sind alle Services, die ich runne."}, {"id": 953, "start": 5520.64, "end": 5522.64, "text": "Ich weiß nicht, ob ich das alles zensiere."}, {"id": 954, "start": 5522.64, "end": 5526.64, "text": "Ich will dir auch noch etwas über diese grüne und rote Indikator sagen."}, {"id": 955, "start": 5526.64, "end": 5530.64, "text": "Sie sollen indizieren, ob ein Service hoch oder runter ist."}, {"id": 956, "start": 5530.64, "end": 5535.64, "text": "Aber weil es viele HTTPS und Kurs-Schananigans gibt, funktioniert es nicht wie erwartet."}, {"id": 957, "start": 5535.64, "end": 5540.64, "text": "Ich copy-paste euch jetzt mal."}, {"id": 958, "start": 5540.64, "end": 5543.64, "text": "Ich hoffe, ich habe alles zensiert."}, {"id": 959, "start": 5543.64, "end": 5549.64, "text": "Ich copy-paste euch mal hier mein Home Assistant-Dashboard."}, {"id": 960, "start": 5549.64, "end": 5551.64, "text": "So."}, {"id": 961, "start": 5551.64, "end": 5561.64, "text": "So sieht das Dashboard aus, wenn ich das Ganze aufmache."}, {"id": 962, "start": 5561.64, "end": 5568.64, "text": "Ich habe hier oben eine Anzeige für wann der Müll kommt."}, {"id": 963, "start": 5568.64, "end": 5571.64, "text": "Da stehen normalerweise die Tage unten drunter."}, {"id": 964, "start": 5571.64, "end": 5577.64, "text": "Dann habe ich eine Anzeige Luft, Luftdaten."}, {"id": 965, "start": 5577.64, "end": 5579.64, "text": "Die aber gerade aus irgendwelchen Gründen."}, {"id": 966, "start": 5579.64, "end": 5583.64, "text": "Da steht dann so Feinstaub, Feinstaubbelastung und sowas drauf."}, {"id": 967, "start": 5583.64, "end": 5588.64, "text": "Weiß ich nicht, warum das gerade nicht funktioniert."}, {"id": 968, "start": 5588.64, "end": 5590.64, "text": "Kein Schimmer."}, {"id": 969, "start": 5590.64, "end": 5592.64, "text": "Außentemperatur."}, {"id": 970, "start": 5592.64, "end": 5596.64, "text": "Dann Anwesenheitsstatus."}, {"id": 971, "start": 5596.64, "end": 5603.64, "text": "Dann wann der nächste Zug kommt nach Frankfurt."}, {"id": 972, "start": 5603.64, "end": 5611.64, "text": "Dann die Batterieladung, das geht normalerweise noch ein bisschen weiter nach unten."}, {"id": 973, "start": 5611.64, "end": 5614.64, "text": "Dann die Batterie von den ganzen Geräten."}, {"id": 974, "start": 5614.64, "end": 5616.64, "text": "Das hier ist verbackt."}, {"id": 975, "start": 5616.64, "end": 5618.64, "text": "Weiß ich nicht, warum das auf 0% steht."}, {"id": 976, "start": 5618.64, "end": 5621.64, "text": "Das funktioniert noch und das ist frisch gewechselt die Batterie."}, {"id": 977, "start": 5621.64, "end": 5623.64, "text": "Die müsste eigentlich 90% haben."}, {"id": 978, "start": 5623.64, "end": 5626.64, "text": "Keine Ahnung, das ist irgendwie verbackt, aber der Rest passt."}, {"id": 979, "start": 5626.64, "end": 5631.64, "text": "Dann habe ich hier das, was wir zusammen programmiert haben im Stream."}, {"id": 980, "start": 5631.64, "end": 5633.64, "text": "Der Heizchamp ist am Start."}, {"id": 981, "start": 5633.64, "end": 5634.64, "text": "Heizung an aus."}, {"id": 982, "start": 5634.64, "end": 5638.64, "text": "Temperatur, aktuelle Temperatursensor im Flur, der das ausliest."}, {"id": 983, "start": 5638.64, "end": 5645.64, "text": "Dann habe ich Anzeige Fenster oben unten auf zu."}, {"id": 984, "start": 5645.64, "end": 5649.64, "text": "Also sprich jetzt die Haustür auf zu, das Bad oben unten auf zu."}, {"id": 985, "start": 5649.64, "end": 5652.64, "text": "Jetzt gibt es einen Wasserlieg im Keller."}, {"id": 986, "start": 5652.64, "end": 5659.64, "text": "Ich kann quasi neues Wasser auffüllen per Knopfdruck im Keller."}, {"id": 987, "start": 5659.64, "end": 5664.64, "text": "Da habe ich dieses Ventilding dran gemacht, was wir uns im Stream angeguckt haben."}, {"id": 988, "start": 5664.64, "end": 5666.64, "text": "Ich habe mir noch eins gekauft."}, {"id": 989, "start": 5666.64, "end": 5672.64, "text": "Also ich habe jetzt unten im Keller quasi das, was wir versucht haben im Stream, was nicht funktioniert hat."}, {"id": 990, "start": 5672.64, "end": 5677.64, "text": "Jetzt kann ich quasi ein Ventil aufmachen mit so einem Drehmotor."}, {"id": 991, "start": 5677.64, "end": 5681.64, "text": "Mit so einem Motor, der so was, der so eine, äh, was heißt denn?"}, {"id": 992, "start": 5681.64, "end": 5684.64, "text": "Valve auf Deutsch, so ein Ventil auf und zu macht."}, {"id": 993, "start": 5684.64, "end": 5686.64, "text": "Dann kann ich Heizungsdruck auffüllen."}, {"id": 994, "start": 5686.64, "end": 5689.64, "text": "Dann sehe ich die nächsten drei Tankstellen, was es da gerade kostet."}, {"id": 995, "start": 5689.64, "end": 5694.64, "text": "Dann sehe ich Verbrauch vom Haus insgesamt, was gerade irgendwie auch ein bisschen der Kraft packt."}, {"id": 996, "start": 5694.64, "end": 5700.64, "text": "Und dann habe ich für jeden Raum, der relevant ist, habe ich einen eigenen Tab."}, {"id": 997, "start": 5700.64, "end": 5702.64, "text": "Das ist das Wohnzimmer."}, {"id": 998, "start": 5702.64, "end": 5704.64, "text": "Das ist mein Arbeitszimmer."}, {"id": 999, "start": 5704.64, "end": 5705.64, "text": "Das ist das Klo."}, {"id": 1000, "start": 5705.64, "end": 5707.64, "text": "Das ist die Küche."}, {"id": 1001, "start": 5707.64, "end": 5709.64, "text": "Das ist der Keller."}, {"id": 1002, "start": 5709.64, "end": 5713.64, "text": "Und das ist der Stall am Garten."}, {"id": 1003, "start": 5713.64, "end": 5716.64, "text": "Und hier ist die Übersicht für die ganzen Kameras."}, {"id": 1004, "start": 5720.64, "end": 5724.64, "text": "Was ist das für ein Ventil und wie liest du den Heizungsdruck aus?"}, {"id": 1005, "start": 5724.64, "end": 5727.64, "text": "Ich lese den Heizungsdruck nicht aus."}, {"id": 1006, "start": 5727.64, "end": 5735.64, "text": "Ich habe eine Kamera an der Druckanzeige von der Heizung."}, {"id": 1007, "start": 5735.64, "end": 5737.64, "text": "Da kann ich einfach auf die Kamera gucken."}, {"id": 1008, "start": 5741.64, "end": 5746.64, "text": "Und wenn das dann quasi unter eins fällt, dann drücke ich hier einfach drauf."}, {"id": 1009, "start": 5746.64, "end": 5750.64, "text": "Und dann geht das Ventil im Keller auf und füllt Wasser nach."}, {"id": 1010, "start": 5750.64, "end": 5755.64, "text": "Ja."}, {"id": 1011, "start": 5755.64, "end": 5762.64, "text": "OCR und automatisch gibt es sogar fertige Sachen, aber ich habe kein Bock, das doppelt zu machen."}, {"id": 1012, "start": 5762.64, "end": 5770.64, "text": "Hast du für alles Bahntanken eine API oder Scrapes oder etwas selber?"}, {"id": 1013, "start": 5770.64, "end": 5774.64, "text": "Die verwende, das ist in Home Assistant eingebaut."}, {"id": 1014, "start": 5774.64, "end": 5780.64, "text": "Also was ich hierfür verwende, ist Home Assistant mit Home Assistant."}, {"id": 1015, "start": 5780.64, "end": 5783.64, "text": "Schauen wir mal kurz Musik an."}, {"id": 1016, "start": 5783.64, "end": 5787.64, "text": "Home Assistant Tankerkönig."}, {"id": 1017, "start": 5787.64, "end": 5788.64, "text": "Home Assistant."}, {"id": 1018, "start": 5788.64, "end": 5789.64, "text": "So, das da."}, {"id": 1019, "start": 5789.64, "end": 5795.64, "text": "Das Home Assistant Tankerkönig, Erdon."}, {"id": 1020, "start": 5795.64, "end": 5807.64, "text": "Da kannst du deinen Wohnort angeben und der sucht dir dann die Tankstellen in der Nähe raus."}, {"id": 1021, "start": 5807.64, "end": 5808.64, "text": "Und zeigt dir das an."}, {"id": 1022, "start": 5808.64, "end": 5810.64, "text": "Wann das aktualisiert wurde, steht normalerweise noch drunter."}, {"id": 1023, "start": 5810.64, "end": 5812.64, "text": "Was es da gerade kostet."}, {"id": 1024, "start": 5819.64, "end": 5821.64, "text": "Das wollte ich jetzt gar nicht zeigen."}, {"id": 1025, "start": 5821.64, "end": 5823.64, "text": "Das Erdon brauchste."}, {"id": 1026, "start": 5823.64, "end": 5827.64, "text": "Und für die Bahn ist auch relativ einfach."}, {"id": 1027, "start": 5827.64, "end": 5832.64, "text": "Weil Home Assistant hat eine offizielle Bahn API Integration."}, {"id": 1028, "start": 5832.64, "end": 5850.64, "text": "Also sprich, da trage ich ein Abfahrt, Ort, Ankunft, Zielort und dann sagt dir die nächste Verbindung."}, {"id": 1029, "start": 5850.64, "end": 5854.64, "text": "Ja und das ist hier komplett selbst gebastelt mit der Heizung."}, {"id": 1030, "start": 5864.64, "end": 5866.64, "text": "So und ihr seht, ich habe hier alles doppelt und dreifach."}, {"id": 1031, "start": 5866.64, "end": 5868.64, "text": "Ich habe Z-Wave Sachen am Start."}, {"id": 1032, "start": 5868.64, "end": 5870.64, "text": "Ich habe ZigBee Sachen am Start."}, {"id": 1033, "start": 5870.64, "end": 5879.64, "text": "Ach ja, diese Anzeige bzw. die Daten für die Müllabfuhr."}, {"id": 1034, "start": 5879.64, "end": 5881.64, "text": "Das verwendet ein Erdon."}, {"id": 1035, "start": 5881.64, "end": 5883.64, "text": "Das kann ich euch mal zeigen."}, {"id": 1036, "start": 5883.64, "end": 5885.64, "text": "Das ist tatsächlich ganz praktisch."}, {"id": 1037, "start": 5887.64, "end": 5889.64, "text": "Das nennt sich."}, {"id": 1038, "start": 5892.64, "end": 5893.64, "text": "Ich mal kurz nachgucken."}, {"id": 1039, "start": 5897.64, "end": 5901.64, "text": "GitHub Waste Collection Home Assistant."}, {"id": 1040, "start": 5901.64, "end": 5907.64, "text": "Und Waste Collection Schedule."}, {"id": 1041, "start": 5910.64, "end": 5916.64, "text": "Ja und die Musik ist ein bisschen laut, oder?"}, {"id": 1042, "start": 5926.64, "end": 5928.64, "text": "Ok, so ist besser."}, {"id": 1043, "start": 5928.64, "end": 5932.64, "text": "Ja, normalerweise stehen hier unten die Tage, wann das abgeholt wird."}, {"id": 1044, "start": 5934.64, "end": 5940.64, "text": "Da steht dann, keine Ahnung, Biotonne in zwei Tagen, Plastiktonne in vier Tagen und das in zwei Wochen und sowas."}, {"id": 1045, "start": 5941.64, "end": 5944.64, "text": "Und als Datengrundlage nimmt er das hier."}, {"id": 1046, "start": 5944.64, "end": 5948.64, "text": "Das ist tatsächlich relativ Big Prane gemacht."}, {"id": 1047, "start": 5948.64, "end": 5958.64, "text": "Ich muss gerade mal gucken, gibt es da noch Alternativen, wusste ich gar nicht."}, {"id": 1048, "start": 5958.64, "end": 5960.64, "text": "Ach ne, das ist ein Frontend."}, {"id": 1049, "start": 5960.64, "end": 5962.64, "text": "Das ist ein Frontend dafür, glaube."}, {"id": 1050, "start": 5962.64, "end": 5964.64, "text": "Oder?"}, {"id": 1051, "start": 5968.64, "end": 5970.64, "text": "Ne, genau."}, {"id": 1052, "start": 5970.64, "end": 5974.64, "text": "Ich verwende das in Zusammenarbeit mit, ich glaube, Müllmax."}, {"id": 1053, "start": 5974.64, "end": 5975.64, "text": "Oder so."}, {"id": 1054, "start": 5975.64, "end": 5984.64, "text": "Zumindest sieht man hier, der hat für Germany ganz viele Provider, wo man abfragen kann, wenn man seinen Wohnort einträgt, wann die Müllabfuhr kommt."}, {"id": 1055, "start": 5984.64, "end": 5986.64, "text": "Das heißt, man muss sich da auch nie wieder drum kümmern."}, {"id": 1056, "start": 5986.64, "end": 5989.64, "text": "Das aktualisiert sich quasi am 31.12."}, {"id": 1057, "start": 5989.64, "end": 5994.64, "text": "Aktualisiert sich das automatisch auf den Müllkalender für nächstes Jahr."}, {"id": 1058, "start": 5994.64, "end": 6011.64, "text": "Ja, du kannst es auch bei ICS-Datei machen, wenn du dir den Kalender runterlädst, aber du kriegst so gut wie ganz Deutschland hiermit irgendwie abgefackelt."}, {"id": 1059, "start": 6011.64, "end": 6020.64, "text": "Weil das hier sind ja so Meta-Dinger, die für verschiedene Orte gehen."}, {"id": 1060, "start": 6020.64, "end": 6025.64, "text": "Dann nicht? Okay, Pech."}, {"id": 1061, "start": 6025.64, "end": 6027.64, "text": "RIP."}, {"id": 1062, "start": 6027.64, "end": 6030.64, "text": "Ja, so schaut mein Homocysten aus."}, {"id": 1063, "start": 6036.64, "end": 6038.64, "text": "So, gucken wir mal sein Video weiter."}, {"id": 1064, "start": 6038.64, "end": 6046.64, "text": "Das speichere ich mir mal kurz hier, weil das interessiert bestimmt noch mehr ab und zu mal."}, {"id": 1065, "start": 6046.64, "end": 6052.64, "text": "So, was kommt als nächstes? Other Stuff. Ja, juckt mir nicht."}, {"id": 1066, "start": 6056.64, "end": 6059.64, "text": "Okay, OS. Was hat er? Ubuntu!"}, {"id": 1067, "start": 6066.64, "end": 6068.64, "text": "Äh, wo hab ich's denn?"}, {"id": 1068, "start": 6068.64, "end": 6071.64, "text": "Warum? Ubuntu bin ich auch voll und ganz dafür."}, {"id": 1069, "start": 6071.64, "end": 6092.64, "text": "Ubuntu ist das einfach, ja, seh ich auch so."}, {"id": 1070, "start": 6092.64, "end": 6102.64, "text": "Ja, genau. Deswegen mach ich das auch so."}, {"id": 1071, "start": 6102.64, "end": 6105.64, "text": "So mach ich das auch so. Deswegen mach ich das auch so."}, {"id": 1072, "start": 6105.64, "end": 6124.64, "text": "Wie gesagt, ich hab auch mein Ubuntu-Server und einfach dann da drauf eine VM für meine Smart-Home-Geschichte und ein paar Container für den Rest. Fertig, aus, Schluss."}, {"id": 1073, "start": 6124.64, "end": 6150.64, "text": "Okay, das hab ich nicht. Das hab ich nicht, weil, wozu auch? Ich hab nur eine große 12TB Festplatte dran, da muss ich nix merken."}, {"id": 1074, "start": 6154.64, "end": 6181.64, "text": "Oh, 10G, Pog. Pog. Pog. 10G."}, {"id": 1075, "start": 6184.64, "end": 6199.64, "text": "Okay, brauch ich nicht, weil ich hab nur eine 12TB Platte und ich hab da noch zusätzlich über USB einfach eine Platte dran, wo ich einen R-Sync mach, einmal die Nacht."}, {"id": 1076, "start": 6199.64, "end": 6214.64, "text": "Das ist zwar absolut Ghetto im Vergleich zu den coolen Sachen, die du heutzutage machen kannst, aber es ist easy as fuck und es funktioniert."}, {"id": 1077, "start": 6229.64, "end": 6258.64, "text": "Das ist tatsächlich ganz praktisch. Ich hab auch die meisten Sachen. Ich hab ein größeres Docker-Compose-File und da ist eigentlich alles mehr oder weniger drin."}, {"id": 1078, "start": 6258.64, "end": 6264.64, "text": "... und dann back up my persistent storage folder to the hard drive array weekly."}, {"id": 1079, "start": 6264.64, "end": 6293.64, "text": "Next time I set up my server, I just have to copy the persistent storage folder back and launch Docker containers again."}, {"id": 1080, "start": 6293.64, "end": 6314.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1081, "start": 6314.64, "end": 6314.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1082, "start": 6314.64, "end": 6339.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1083, "start": 6339.64, "end": 6363.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1084, "start": 6363.64, "end": 6387.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1085, "start": 6387.64, "end": 6404.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1086, "start": 6404.64, "end": 6428.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1087, "start": 6428.64, "end": 6457.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1088, "start": 6457.64, "end": 6460.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1089, "start": 6460.64, "end": 6474.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1090, "start": 6474.64, "end": 6502.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1091, "start": 6502.64, "end": 6517.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1092, "start": 6517.64, "end": 6531.64, "text": "... and that wasn't some kind of a zero-day issue or hidden exploit."}, {"id": 1093, "start": 6531.64, "end": 6534.0, "text": "all of your public web-services that already support..."}, {"id": 1094, "start": 6534.0, "end": 6537.12, "text": "Ja gut, public web-services geb ich ihm ja voll und ganz recht,"}, {"id": 1095, "start": 6537.12, "end": 6541.52, "text": "aber ich hab ja keine public web-services für mein Smart-Home und solche internen Geschichten."}, {"id": 1096, "start": 6541.52, "end": 6544.88, "text": "...for two-factor authentication such as Nextcloud or Bitwarden,"}, {"id": 1097, "start": 6544.88, "end": 6548.0, "text": "but if you're especially paranoid about unauthorized access to your services,"}, {"id": 1098, "start": 6548.0, "end": 6549.56, "text": "you should definitely take a look."}, {"id": 1099, "start": 6549.56, "end": 6552.68, "text": "One other thing that you could do for your security and privacy"}, {"id": 1100, "start": 6552.68, "end": 6555.8, "text": "is using a Cloudflare proxy for your web-services."}, {"id": 1101, "start": 6555.8, "end": 6558.44, "text": "If you're hosting public-facing services from home,"}, {"id": 1102, "start": 6558.44, "end": 6560.12, "text": "you don't necessarily want everyone to..."}, {"id": 1103, "start": 6560.12, "end": 6564.4, "text": "Also, ich würde gar keine public-facing services at home hosten."}, {"id": 1104, "start": 6564.4, "end": 6566.0, "text": "Das ist das Erste."}, {"id": 1105, "start": 6566.0, "end": 6573.28, "text": "Aber eine Cloudflare DNS oder generell eine Domain und eine passende DNS dafür,"}, {"id": 1106, "start": 6573.28, "end": 6577.56, "text": "den man benutzen kann für Zertifikate, ist tatsächlich sehr praktisch."}, {"id": 1107, "start": 6577.56, "end": 6581.68, "text": "Ich hab mir auch ein paar Domains registriert und eine davon verwende ich für daheim."}, {"id": 1108, "start": 6581.68, "end": 6586.68, "text": "Und ich hab's einfach so eingestellt, dass mein Router..."}, {"id": 1109, "start": 6586.68, "end": 6592.68, "text": "...diese Domain prinzipiell Wildcard, also alles, was zu dieser Domain gehört,"}, {"id": 1110, "start": 6592.68, "end": 6598.16, "text": "bei mir auf meine 2hE Serverkiste weiterleitet anstatt ins Internet."}, {"id": 1111, "start": 6598.16, "end": 6600.8, "text": "Im Internet lösen die Dinger auch gar nicht auf."}, {"id": 1112, "start": 6600.8, "end": 6609.88, "text": "Und ich benutze die Domain, das ist eine ganz normale public-auflösbare Domain."}, {"id": 1113, "start": 6609.88, "end": 6611.36, "text": "Also, die gibt's."}, {"id": 1114, "start": 6611.36, "end": 6614.88, "text": "Das ist also ganz normal offiziell registrierte Domain."}, {"id": 1115, "start": 6614.88, "end": 6618.72, "text": "Und die DNS benutze ich, um Let's Encrypt-Zertifikate zu generieren."}, {"id": 1116, "start": 6618.72, "end": 6622.08, "text": "Also sprich, ich hab für alle meine internen Services"}, {"id": 1117, "start": 6622.08, "end": 6626.52, "text": "dadurch gültige Let's Encrypt-Zertifikate, was ich äußerst praktisch finde."}, {"id": 1118, "start": 6626.52, "end": 6629.88, "text": "Und ohne sich irgendwie den Bein auszureißen."}, {"id": 1119, "start": 6629.88, "end": 6632.24, "text": "Weil Let's Encrypt ist easy as fuck."}, {"id": 1120, "start": 6632.24, "end": 6636.36, "text": "Selbstgebaute Zertifikate und CA ist halt painstamp."}, {"id": 1121, "start": 6636.36, "end": 6638.16, "text": "Das musst du dann überall installieren."}, {"id": 1122, "start": 6638.16, "end": 6644.04, "text": "Und manche Browser mögen das mittlerweile auch gar nicht mehr."}, {"id": 1123, "start": 6644.04, "end": 6645.76, "text": "Deswegen einfach Let's Encrypt nur gut ist."}, {"id": 1124, "start": 6645.76, "end": 6674.2, "text": "Ja, Moment, die proxien das."}, {"id": 1125, "start": 6674.2, "end": 6683.96, "text": "Also ich würde einfach generell nie Public Services daheim hosten."}, {"id": 1126, "start": 6683.96, "end": 6687.72, "text": "Und wenn, dann nur hinter einem VPN, fertig."}, {"id": 1127, "start": 6687.72, "end": 6689.28, "text": "Da kann eigentlich nicht viel passieren."}, {"id": 1128, "start": 6689.28, "end": 6705.36, "text": "Das hab ich, also mein VPN hab ich damals sogar anders gelöst."}, {"id": 1129, "start": 6705.36, "end": 6709.8, "text": "Ich hab mir keinen Dynamisch-DNS-Eintrag gemacht."}, {"id": 1130, "start": 6709.8, "end": 6714.24, "text": "Ich hab mir damals einen 2-Euro-Server gemietet bei irgendeinem Hoster."}, {"id": 1131, "start": 6714.24, "end": 6720.28, "text": "Und hab per Auto-SSH ne Port-Forwarding gemacht auf meinen VPN-Eingang."}, {"id": 1132, "start": 6720.28, "end": 6725.4, "text": "Ich glaub das ist nicht die schönste Variante, aber da bin ich um Dynamic-DNS rumgekommen"}, {"id": 1133, "start": 6725.4, "end": 6726.4, "text": "damals."}, {"id": 1134, "start": 6726.4, "end": 6731.92, "text": "Da hatte ich quasi nen Public Server, der mich auf mein SSH-Intern weitergeleitet hat."}, {"id": 1135, "start": 6731.92, "end": 6737.16, "text": "Auf mein VPN-Geld bei intern weitergeleitet hat."}, {"id": 1136, "start": 6737.16, "end": 6745.48, "text": "Wo würdest du dann zum Beispiel am eigenen Nextcloud hosten?"}, {"id": 1137, "start": 6745.48, "end": 6751.56, "text": "Lokal, bei mir auf irgendeiner Kiste."}, {"id": 1138, "start": 6751.56, "end": 6759.76, "text": "Es sei denn, du hast wirklich den Anspruch, dass du Public-erreichbare Links sharen willst"}, {"id": 1139, "start": 6759.76, "end": 6764.6, "text": "zu deiner Nextcloud, dann musst du es irgendwie von extern erreichbar machen."}, {"id": 1140, "start": 6764.6, "end": 6772.48, "text": "Aber dann würd ich tatsächlich mir überlegen, ob ich nicht zwei aufsetze, eine im Internet"}, {"id": 1141, "start": 6772.48, "end": 6776.28, "text": "für alles was Public geshared werden soll und eine für mein internes wichtiges Zeug."}, {"id": 1142, "start": 6776.28, "end": 6781.28, "text": "Ich würde meine Nextcloud nie ins Internet stellen."}, {"id": 1143, "start": 6781.28, "end": 6786.72, "text": "Ich weiß, das machen einige, aber ich bin da absolut kein Fan von."}, {"id": 1144, "start": 6786.72, "end": 6792.0, "text": "Und man hat gesehen, wie einfach sowas zu knacken ist, spätestens ein Log4j."}, {"id": 1145, "start": 6792.0, "end": 6797.08, "text": "Gut, Nextcloud ist PHP, die hatten das Problem nicht, aber das kann da genauso passieren."}, {"id": 1146, "start": 6822.0, "end": 6829.68, "text": "Ja, und wenn du dann, also wenn du wirklich für irgendwie Public, um Sachen zu sharen,"}, {"id": 1147, "start": 6829.68, "end": 6833.36, "text": "was weiß ich, stell dir, wenn man sich vorstellt, du bist Fotograf und willst den Leuten über"}, {"id": 1148, "start": 6833.36, "end": 6838.56, "text": "deine Nextcloud die Bilder sharen, einfach nur mal irgendwas eingebrochen, dann musst"}, {"id": 1149, "start": 6838.56, "end": 6840.24, "text": "du das externe irgendwie hosten."}, {"id": 1150, "start": 6840.24, "end": 6844.0, "text": "Da kannst du zum Beispiel mal Ausrufezeichen Hetzer in den Chat eingeben und da kannst"}, {"id": 1151, "start": 6844.0, "end": 6850.0, "text": "du dir 21€ Startgutschein sichern für Hetzercloud, da kannst du dir dann einen Server mieten"}, {"id": 1152, "start": 6850.0, "end": 6857.76, "text": "und da dann Zeug drauf installieren, aber da würde ich dann keine privaten Sachen drauf"}, {"id": 1153, "start": 6857.76, "end": 6858.76, "text": "schmeißen."}, {"id": 1154, "start": 6858.76, "end": 6877.12, "text": "Ich habe zwei Sachen, ich habe Porkbun, das ist so der billigste, schlechteste Domainregistrat,"}, {"id": 1155, "start": 6877.12, "end": 6905.88, "text": "das es gibt und dann habe ich Namecheap, also keqw-services läuft über Namecheap, vonhand,"}, {"id": 1156, "start": 6905.88, "end": 6916.16, "text": "ganz ehrlich, das kann man, wenn man eine Kiste daheim hat, auch heutzutage ohne Probleme"}, {"id": 1157, "start": 6916.16, "end": 6917.16, "text": "immer noch so machen."}, {"id": 1158, "start": 6917.16, "end": 6927.16, "text": "Für, ich sag mal reproduzierbare und vor allem nachvollziehbare Sachen nach 1-2 Jahren,"}, {"id": 1159, "start": 6927.16, "end": 6931.36, "text": "wenn man sich dann selbst fragt, was habe ich denn da eigentlich gemacht, ist so eine"}, {"id": 1160, "start": 6931.36, "end": 6933.8, "text": "Ansible-Config gar nicht mal so blöd."}, {"id": 1161, "start": 6933.8, "end": 6940.0, "text": "Weil darin ist dann quasi automatisch der Aufbau automatisiert und du kannst nachgucken,"}, {"id": 1162, "start": 6940.0, "end": 6941.0, "text": "was du gemacht hast."}, {"id": 1163, "start": 6941.0, "end": 6950.08, "text": "Das ist gar nicht so blöd, auch wenn es erstmal wie Overkill wirkt, weil du richtest dein"}, {"id": 1164, "start": 6950.08, "end": 6953.8, "text": "Server eigentlich nur einmal ein, aber allein schon, dass du nachgucken kannst in einem"}, {"id": 1165, "start": 6953.8, "end": 6958.32, "text": "Jahr oder zwei nochmal, was hast du da eigentlich gemacht, ist so eine Ansible-Playbook vielleicht"}, {"id": 1166, "start": 6958.32, "end": 6959.32, "text": "gar nicht so schlecht."}, {"id": 1167, "start": 6959.32, "end": 6976.94, "text": "Reuen Freigast, danke für den Sub, several weeks ist vielleicht ein bisschen übertrieben."}, {"id": 1168, "start": 6976.94, "end": 6981.12, "text": "Passwort-Manager, ich habe Keypass seit Ewigkeiten."}, {"id": 1169, "start": 6981.12, "end": 6985.64, "text": "Dry-Failure, Natural Disasters, und einfach einfach in deiner Installation über Reparatur arbeiten."}, {"id": 1170, "start": 6985.64, "end": 6987.08, "text": "Das passiert mit den besten von uns."}, {"id": 1171, "start": 6987.08, "end": 6991.3, "text": "Und nebenbei, ich weiß nicht von euch, aber nachdem ich Linux auf dem Server installiert und es für ein bisschen Zeit benutze,"}, {"id": 1172, "start": 6991.3, "end": 6993.46, "text": "fühlt es sich irgendwie... dreckig an."}, {"id": 1173, "start": 6993.46, "end": 6996.96, "text": "Ich weiß nicht mehr, was da drin ist, und ich habe keine Kontrolle über es."}, {"id": 1174, "start": 6996.96, "end": 7001.52, "text": "Also habe ich immer die Möglichkeit, es zu reinstallieren, es zu machen, es zu öffnen und besser zu machen."}, {"id": 1175, "start": 7001.52, "end": 7003.04, "text": "Es gibt auch noch ein Problem."}, {"id": 1176, "start": 7003.04, "end": 7008.44, "text": "Wenn ich eine neue Linux-Maschine setze, komme ich persönlich an Probleme, die nicht so einfach zu diagnostizieren sind."}, {"id": 1177, "start": 7008.44, "end": 7011.08, "text": "Aber wenn ich sie löse, vergesse ich sofort, wie ich es gemacht habe."}, {"id": 1178, "start": 7011.08, "end": 7017.28, "text": "Also die nächste Zeit, wenn ich sie reinstalle, bekomme ich wieder die gleichen Probleme und muss wieder durch den ganzen Problem-Prozess gehen."}, {"id": 1179, "start": 7017.28, "end": 7022.12, "text": "Und ich denke, ich habe einen Weg gefunden, um meinen Server in einem cleanerer, weniger verabschiedeten, besseren Weg zu setzen."}, {"id": 1180, "start": 7022.12, "end": 7024.38, "text": "Es heißt Infrastruktur als Kode."}, {"id": 1181, "start": 7024.38, "end": 7027.6, "text": "Infrastruktur als Kode ist eine Philosophie der Managung von Konfigurationen..."}, {"id": 1182, "start": 7027.6, "end": 7029.32, "text": "Ja, im Prinzip sowas wie Ansible."}, {"id": 1183, "start": 7029.32, "end": 7030.28, "text": "Ahem."}, {"id": 1184, "start": 7030.28, "end": 7032.28, "text": "Ich gehe schon mal von aus."}, {"id": 1185, "start": 7032.28, "end": 7033.18, "text": "Was hat er?"}, {"id": 1186, "start": 7033.18, "end": 7034.48, "text": "Ansible, sag ich doch!"}, {"id": 1187, "start": 7034.48, "end": 7035.48, "text": "Was sonst?"}, {"id": 1188, "start": 7035.48, "end": 7042.6, "text": "Ich bin echt froh, dass sich Ansible aus dieser ganzen Masse so ein bisschen abgehoben und durchgesetzt hat."}, {"id": 1189, "start": 7042.6, "end": 7050.6, "text": "Weil ganz ehrlich Puppet, also wir haben auf der Arbeit relativ viel Puppet oder auch Chef ist ja auch so ein Ding, das haben wir aber nicht."}, {"id": 1190, "start": 7050.6, "end": 7052.6, "text": "Das gibt es ja schon richtig lange."}, {"id": 1191, "start": 7052.6, "end": 7057.64, "text": "Oder auch CF Engine, das war ja so der Vorreiter der Sache, falls sich das irgendjemand mal angeguckt hat."}, {"id": 1192, "start": 7057.64, "end": 7063.16, "text": "Ich finde von allen diesen Lösungen, die es da gibt, ist Ansible immer noch die angenehmste."}, {"id": 1193, "start": 7063.16, "end": 7064.68, "text": "Keine Frage für mich."}, {"id": 1194, "start": 7064.68, "end": 7066.68, "text": "Eine sehr wichtige Frage."}, {"id": 1195, "start": 7066.68, "end": 7071.08, "text": "Wie ist Ansible besser, als nur mit einem Bash Script den Installationprozess zu automatisieren?"}, {"id": 1196, "start": 7071.08, "end": 7076.36, "text": "Natürlich gibt es viele Ausgaben, für die Ansible kein Gehirn ist und ein Shellscript zu verwenden wäre verrückend."}, {"id": 1197, "start": 7076.36, "end": 7081.08, "text": "Aber Ansible für eine Single-Home-Server zu verwenden, scheint ein bisschen überwältigend, oder?"}, {"id": 1198, "start": 7081.08, "end": 7088.04, "text": "Nachher, Dinge wie umsetzten, die Anwendung von Hard Drives zu montieren oder Packages zu installieren, können definitiv durch ein Shellscript erreicht werden, oder?"}, {"id": 1199, "start": 7088.04, "end": 7089.56, "text": "Also, warum Ansible?"}, {"id": 1200, "start": 7089.56, "end": 7091.56, "text": "Also, wir beginnen mit Item Potency."}, {"id": 1201, "start": 7091.56, "end": 7098.04, "text": "Item Potency ist die Möglichkeit, ein Programm mehrmals zu runnen und den gleichen Result zu produzieren, egal welches System der Situation ist."}, {"id": 1202, "start": 7098.04, "end": 7099.56, "text": "Hier ist ein sehr einfaches Beispiel."}, {"id": 1203, "start": 7099.56, "end": 7101.56, "text": "Lass uns ein Folder mit mkdir kreieren."}, {"id": 1204, "start": 7101.56, "end": 7104.92, "text": "Wie du siehst, funktioniert es einmal wie erwartet, das Folder wird kreiert."}, {"id": 1205, "start": 7104.92, "end": 7108.84, "text": "Aber wenn wir es wieder runnen, bekommen wir einen Error, weil das Folder bereits existiert ist."}, {"id": 1206, "start": 7108.84, "end": 7112.52, "text": "Jedoch, wenn wir das Dash-P-Flag in die Anwendung geben, sehen wir keinen Error."}, {"id": 1207, "start": 7112.52, "end": 7114.52, "text": "Also nun ist die Anwendung Item Potent."}, {"id": 1208, "start": 7114.52, "end": 7117.24, "text": "Jedoch, in anderen Fällen könnte es nicht so einfach sein."}, {"id": 1209, "start": 7117.24, "end": 7121.64, "text": "Zum Beispiel werden einige Package-Manager, wenn du einen Package installierst, schon installiert."}, {"id": 1210, "start": 7121.64, "end": 7126.92, "text": "Und in einigen anderen Fällen, musst du Error-Konditionen, If-Loups, und so weiter und so fort."}, {"id": 1211, "start": 7126.92, "end": 7129.48, "text": "Jedoch, mit Ansible ist das Item Potency gebacken."}, {"id": 1212, "start": 7129.48, "end": 7133.4, "text": "Ansible hat ja schon alles programmiert für einen."}, {"id": 1213, "start": 7137.4, "end": 7139.88, "text": "...unser System, unless es noch eine Veränderung gibt."}, {"id": 1214, "start": 7139.88, "end": 7141.08, "text": "Hahahaha."}, {"id": 1215, "start": 7142.36, "end": 7143.64, "text": "Das ist nicht schlecht."}, {"id": 1216, "start": 7143.64, "end": 7147.48, "text": "Was ist die Mischung von Terraform und Ansible? Terrible."}, {"id": 1217, "start": 7159.96, "end": 7160.92, "text": "Das stimmt."}, {"id": 1218, "start": 7160.92, "end": 7164.6, "text": "Wer gestern oder wann war das vorgestern im Stream dabei war,"}, {"id": 1219, "start": 7164.6, "end": 7166.92, "text": "da haben wir selbst wieder ein bisschen Ansible Zeug gebastelt."}, {"id": 1220, "start": 7166.92, "end": 7168.28, "text": "Das ist einfach praktisch."}, {"id": 1221, "start": 7168.28, "end": 7173.8, "text": "Und zumal, wenn man damit beispielsweise Cloud-Server aufsetzt,"}, {"id": 1222, "start": 7173.8, "end": 7175.64, "text": "wie wir schon öfters im Stream gemacht haben,"}, {"id": 1223, "start": 7175.64, "end": 7182.52, "text": "du brauchst halt nur kleine Anpassungen und kannst immer wieder das benutzen."}, {"id": 1224, "start": 7182.52, "end": 7184.68, "text": "Du musst dir gar keine großartigen Gedanken mehr machen."}, {"id": 1225, "start": 7184.68, "end": 7188.2, "text": "Nimmst deinen Ansible-Skript, editierst den Namen vom Service-File,"}, {"id": 1226, "start": 7188.2, "end": 7190.68, "text": "editierst drei Sachen, führst aus, gut ist."}, {"id": 1227, "start": 7190.68, "end": 7195.88, "text": "Guck mal letztens vor zwei Streams, wie einfach wir..."}, {"id": 1228, "start": 7195.88, "end": 7198.6, "text": "Kannst du noch mal zeigen? Mach das jetzt einfach auf."}, {"id": 1229, "start": 7198.6, "end": 7201.96, "text": "Ich zitiere mich jetzt einfach mal selbst,"}, {"id": 1230, "start": 7201.96, "end": 7207.4, "text": "wie einfach wir hier was deployed haben auf der Linux-Kiste."}, {"id": 1231, "start": 7207.4, "end": 7209.48, "text": "Guck mal."}, {"id": 1232, "start": 7209.48, "end": 7211.8, "text": "Hier."}, {"id": 1233, "start": 7211.8, "end": 7216.76, "text": "War relativ am Anfang."}, {"id": 1234, "start": 7216.76, "end": 7218.92, "text": "Hier, guck mal."}, {"id": 1235, "start": 7218.92, "end": 7223.0, "text": "Das ist alles, was wir machen mussten."}, {"id": 1236, "start": 7223.0, "end": 7224.92, "text": "Wir haben das Create."}, {"id": 1237, "start": 7224.92, "end": 7228.2, "text": "Da ist der Chat ein bisschen im Weg jetzt, natürlich blöd."}, {"id": 1238, "start": 7228.2, "end": 7232.28, "text": "Hat jetzt keiner gesehen."}, {"id": 1239, "start": 7232.28, "end": 7236.44, "text": "Wir führen einfach nur aus, Server erstellen"}, {"id": 1240, "start": 7236.44, "end": 7239.24, "text": "und danach lassen wir das Ansible-Playbook laufen."}, {"id": 1241, "start": 7239.24, "end": 7247.64, "text": "Und wenn ich das ausführe, dann ist der Server einfach gleich da."}, {"id": 1242, "start": 7247.64, "end": 7251.32, "text": "Jetzt weiß ich auch, warum manchmal Leute auf einmal nix mehr schreiben."}, {"id": 1243, "start": 7251.32, "end": 7255.72, "text": "Das ist, weil die sehen wollen, was ich im Terminal habe."}, {"id": 1244, "start": 7255.72, "end": 7266.52, "text": "Vielleicht soll ich den Chat irgendwie anders platzieren bei sowas."}, {"id": 1245, "start": 7266.52, "end": 7268.04, "text": "Guck."}, {"id": 1246, "start": 7268.04, "end": 7271.8, "text": "Server aufgebaut, Server erstellt sich automatisch und jetzt..."}, {"id": 1247, "start": 7271.8, "end": 7274.52, "text": "Max, schalt mal zurück."}, {"id": 1248, "start": 7274.52, "end": 7280.36, "text": "Und jetzt wartet er 20 Sekunden, dass der Server oben ist."}, {"id": 1249, "start": 7280.36, "end": 7283.72, "text": "Rechts oben könnte man den Chat machen, ja."}, {"id": 1250, "start": 7283.72, "end": 7290.52, "text": "Muss man mal gucken."}, {"id": 1251, "start": 7290.52, "end": 7292.04, "text": "So, und guck."}, {"id": 1252, "start": 7292.04, "end": 7297.0, "text": "Jetzt läuft der komplette Aufbau des Systems durch."}, {"id": 1253, "start": 7297.0, "end": 7299.4, "text": "Der macht..."}, {"id": 1254, "start": 7299.4, "end": 7302.6, "text": "Ach, jetzt gucken wir gar nicht zu."}, {"id": 1255, "start": 7302.6, "end": 7307.8, "text": "Jetzt mache ich irgendwelche Musikstelles anstatt während der Aufbau."}, {"id": 1256, "start": 7307.8, "end": 7308.6, "text": "Ja, aber guck."}, {"id": 1257, "start": 7308.6, "end": 7315.16, "text": "Der Server baut jetzt auf, Updating Packages, Updated Things, Installiert Packages, so und"}, {"id": 1258, "start": 7315.16, "end": 7342.84, "text": "das alles mit einem Ansible-File, was eigentlich schon mehr oder weniger fertig war."}, {"id": 1259, "start": 7342.84, "end": 7360.16, "text": "Und du, jetzt machst Forward-File."}, {"id": 1260, "start": 7360.16, "end": 7362.46, "text": "auf ziemlich all die großen Linux-Distros."}, {"id": 1261, "start": 7362.46, "end": 7365.16, "text": "Dank an Modulen wie Package und Service"}, {"id": 1262, "start": 7365.16, "end": 7369.96, "text": "können Ansible Playbooks auch auf eine große Variante von Linux- und BSD-basierten Distros verwendet werden,"}, {"id": 1263, "start": 7369.96, "end": 7372.16, "text": "da viele Modul sind distro-agnostik."}, {"id": 1264, "start": 7372.16, "end": 7374.76, "text": "So jetzt, dass ich dich auf die ganze Ansible-Tippe gekauft habe,"}, {"id": 1265, "start": 7374.76, "end": 7378.26, "text": "zeige ich dir das Ansible-Playbook, das ich geschrieben habe, um meinen Serum zu setzten,"}, {"id": 1266, "start": 7378.26, "end": 7381.26, "text": "und zeige dir ein paar Tricks, die ich verwendet habe, um mein Leben einfacher zu machen."}, {"id": 1267, "start": 7381.26, "end": 7382.96, "text": "Also hier ist mein Playbook."}, {"id": 1268, "start": 7382.96, "end": 7385.86, "text": "Ich weiß, dass es ziemlich komisch sein kann, wenn du nie mit Ansible verhandelt hast,"}, {"id": 1269, "start": 7385.86, "end": 7391.66, "text": "das rösten wir uns jetzt nicht angucken, aber ich finde es schön zu sehen,"}, {"id": 1270, "start": 7391.66, "end": 7396.06, "text": "dass man da jetzt wieder erkennt, dass es halt auch für einen Server"}, {"id": 1271, "start": 7396.06, "end": 7401.56, "text": "insofern sinnvoll ist, wenn ich nach zwei Jahren nachgucken will, was hast du da eigentlich gemacht,"}, {"id": 1272, "start": 7401.56, "end": 7403.56, "text": "oder wo hast du das jetzt hingelegt,"}, {"id": 1273, "start": 7403.56, "end": 7431.76, "text": "du guckst in dein Ansible-Playbook und du weißt halt gleich, was Sache ist."}, {"id": 1274, "start": 7431.76, "end": 7435.66, "text": "Also das erste, was man machen muss, ist, wenn man sein Bootsektor kaputt machen will,"}, {"id": 1275, "start": 7435.66, "end": 7448.26, "text": "dd if=\"def0\", of=\"def-sa\", bs=\"4k\", count=\"1\"."}, {"id": 1276, "start": 7448.26, "end": 7450.66, "text": "So, und dann ist der Bootsektor weg."}, {"id": 1277, "start": 7450.66, "end": 7476.56, "text": "Ja gut, das ist jetzt ja noch gültig bei seinem lokalen Setup."}, {"id": 1278, "start": 7476.56, "end": 7504.56, "text": "Ja."}, {"id": 1279, "start": 7504.56, "end": 7515.26, "text": "Gut, das kann man machen, wobei ich sagen muss,"}, {"id": 1280, "start": 7515.26, "end": 7519.46, "text": "das finde ich fast schon für einen lokalen Server dann wirklich zu viel des Guten,"}, {"id": 1281, "start": 7519.46, "end": 7524.86, "text": "weil ich meine, braucht man wirklich ein automatisches Setup für einen Server?"}, {"id": 1282, "start": 7524.86, "end": 7527.26, "text": "Den installierst du ja nie neu."}, {"id": 1283, "start": 7527.26, "end": 7535.36, "text": "Den installierst du höchstens neu, wenn dir die System-SSD verreckt."}, {"id": 1284, "start": 7535.36, "end": 7560.86, "text": "Ich weiß nicht, ob das so sinnig ist."}, {"id": 1285, "start": 7560.86, "end": 7565.16, "text": "Das ist gut, Default Port 69."}, {"id": 1286, "start": 7565.16, "end": 7566.16, "text": "Das gefällt mir."}, {"id": 1287, "start": 7566.16, "end": 7567.16, "text": "Das gefällt mir, ja."}, {"id": 1288, "start": 7567.16, "end": 7575.16, "text": "Ja, haben wir schon geguckt."}, {"id": 1289, "start": 7575.16, "end": 7596.16, "text": "Wo passen?"}, {"id": 1290, "start": 7596.16, "end": 7608.16, "text": "Bin ich auch."}, {"id": 1291, "start": 7608.16, "end": 7615.56, "text": "Also ich finde das sinnvoll, gerade, dass du nachgucken kannst, auch noch mal nach zwei,"}, {"id": 1292, "start": 7615.56, "end": 7616.56, "text": "drei Jahren, was hast du denn gemacht?"}, {"id": 1293, "start": 7616.56, "end": 7623.96, "text": "Ähm, ich glaube, letzte Woche haben wir das geguckt, Chat, aber dieses Setup an sich,"}, {"id": 1294, "start": 7623.96, "end": 7628.16, "text": "ich weiß nicht, ob man das jetzt braucht."}, {"id": 1295, "start": 7628.16, "end": 7631.16, "text": "Jetzt wissen wir Bescheid."}, {"id": 1296, "start": 7631.16, "end": 7637.16, "text": "Ups, das habe ich dazu gemacht."}, {"id": 1297, "start": 7637.16, "end": 7653.36, "text": "Half-Life 2 League, oh nee, da kann ich mich noch dran erinnern."}, {"id": 1298, "start": 7653.36, "end": 7657.96, "text": "Da hat man rausbekommen im Half-Life 2 League, dass vieles von den Sachen, was angeblich"}, {"id": 1299, "start": 7657.96, "end": 7660.56, "text": "AI war, auch nur gescriptet war und sowas."}, {"id": 1300, "start": 7660.56, "end": 7669.52, "text": "Gucken, was uns YouTube noch vorschlägt."}, {"id": 1301, "start": 7669.52, "end": 7678.28, "text": "Eso juckt mich so überhaupt gar nicht."}, {"id": 1302, "start": 7678.28, "end": 7681.28, "text": "Singleplayer, MMOs, Lull."}, {"id": 1303, "start": 7681.28, "end": 7701.0, "text": "Das Teleskop startet doch jetzt irgendwann, oder?"}, {"id": 1304, "start": 7701.0, "end": 7702.76, "text": "Das ist doch jetzt irgendwann demnächst."}, {"id": 1305, "start": 7702.76, "end": 7705.76, "text": "Zwei Stunden, Leute."}, {"id": 1306, "start": 7705.76, "end": 7711.76, "text": "CS, Monka, Monka, Launch."}, {"id": 1307, "start": 7711.76, "end": 7718.76, "text": "Gucke ich mir nachher an, wie es lau-, wie es launcht."}, {"id": 1308, "start": 7718.76, "end": 7738.44, "text": "Es sind zwei Stunden, bedeutet 13.20."}, {"id": 1309, "start": 7738.44, "end": 7740.88, "text": "Das sieht nicht nach einer SpaceX-Rakete aus, oder?"}, {"id": 1310, "start": 7740.88, "end": 7746.16, "text": "Wo starten die denn?"}, {"id": 1311, "start": 7746.16, "end": 7764.6, "text": "Französisch Guiana, oder irgendwie sowas mit der?"}, {"id": 1312, "start": 7764.6, "end": 7771.68, "text": "Sitzt denn da Mensch drinnen, nö?"}, {"id": 1313, "start": 7771.68, "end": 7776.72, "text": "Wie findest du das Spiel, ready or not?"}, {"id": 1314, "start": 7776.72, "end": 7777.72, "text": "Sagt mir nix."}, {"id": 1315, "start": 7777.72, "end": 7785.12, "text": "Ach, ist das diese, ähm, Tactical-Polizei-Einsatz-Stell-Geschichte?"}, {"id": 1316, "start": 7785.12, "end": 7792.12, "text": "Ja, das hat ziemlich gute Bewertung, das habe ich auch schon gesehen auf Steam, aber ich"}, {"id": 1317, "start": 7792.12, "end": 7795.84, "text": "kaufe mir prinzipiell keine Spiele, die Early Access sind."}, {"id": 1318, "start": 7795.84, "end": 7800.08, "text": "Ne, wir schauen den Launch nicht im Stream, weil ich gehe gleich auf und dann Mittagessen."}, {"id": 1319, "start": 7800.08, "end": 7817.68, "text": "Ja, ich kaufe mir keine, es soll wirklich gut sein, aber ich kaufe mir keine Early Access"}, {"id": 1320, "start": 7817.68, "end": 7818.68, "text": "Spiele."}, {"id": 1321, "start": 7818.68, "end": 7824.08, "text": "Hat jemand eine Idee, ich frage jetzt wirklich, ich weiß, ich hab keine Ahnung, hat jemand"}, {"id": 1322, "start": 7824.08, "end": 7829.8, "text": "eine Idee oder eine Vorstellung davon, wie viele der Early Access Spiele, also wie viele"}, {"id": 1323, "start": 7829.8, "end": 7835.52, "text": "der Anteil der Spiele, die als Early Access auf Steam rauskommen, jemals Early Access"}, {"id": 1324, "start": 7835.52, "end": 7838.96, "text": "überhaupt verlassen und voll released werden?"}, {"id": 1325, "start": 7838.96, "end": 7846.8, "text": "Also ich würde drauf tippen, vielleicht 20%, was würdet ihr sagen?"}, {"id": 1326, "start": 7846.8, "end": 7853.32, "text": "Wie viele Spiele verlassen, 69%, wie viele Spiele verlassen Early Access wieder?"}, {"id": 1327, "start": 7853.32, "end": 7868.2, "text": "QSC, kein Plastenschimmer."}, {"id": 1328, "start": 7868.2, "end": 7894.88, "text": "Only 25%, das war schon mit 20% gar nicht so schlecht und ich dachte auch schon 20% sind"}, {"id": 1329, "start": 7894.88, "end": 7900.68, "text": "relativ hoch, ich hatte auch gedacht wahrscheinlich eher unter 10%, weil ich meine es gibt so"}, {"id": 1330, "start": 7900.68, "end": 7914.84, "text": "viel Bullshit und das meiste davon ist auch noch Early Access, ja gucken wir uns dann,"}, {"id": 1331, "start": 7914.84, "end": 7926.2, "text": "also wir nicht zusammen, gucke ich mir dann um 13 Uhr gucke ich mir das an, wie gestartet"}, {"id": 1332, "start": 7926.2, "end": 7927.2, "text": "wird."}, {"id": 1333, "start": 7927.2, "end": 7931.12, "text": "So Starts können ja immer noch mal relativ kurzfristig abgesagt werden, wenn zu schlechte"}, {"id": 1334, "start": 7931.12, "end": 7932.48, "text": "Wetterbedingungen oder sonst was."}, {"id": 1335, "start": 7932.48, "end": 7959.28, "text": "Hat das Video einen Chat, ja, es gibt aber mehrere Videos, Europa fahrt runter, was soll"}, {"id": 1336, "start": 7959.28, "end": 7986.04, "text": "das nicht fährt runter heißen, Europa fahrt runter, was ist das für ein Satz?"}, {"id": 1337, "start": 7986.04, "end": 7995.56, "text": "Kostespare, die Schwaben wieder am Start, GTX 660 TI, ja aktuell kannst du alles gut"}, {"id": 1338, "start": 7995.56, "end": 7997.48, "text": "verkaufen, was eine Grafikkarte drin hat."}, {"id": 1339, "start": 7997.48, "end": 8006.36, "text": "Leute ich glaube am 31.12. sind die Tage für den Preischamp gezählt, ich glaube dann schalte"}, {"id": 1340, "start": 8006.36, "end": 8031.2, "text": "ich das ab, ok Leute ich gehe jetzt was essen, schön dass ihr kurzfristig dabei gewesen"}, {"id": 1341, "start": 8031.2, "end": 8039.32, "text": "seid, Runde geschwätzt, morgen gibt es wieder Aufwachen Stream, weil morgen ist ja Sonntag,"}, {"id": 1342, "start": 8039.32, "end": 8050.72, "text": "der Preischamp, keine Ahnung, ein Jahr oder so, ich habe da einen Twitter Post gemacht,"}, {"id": 1343, "start": 8050.72, "end": 8065.4, "text": "ja ungefähr ein Jahr, das ist doch in Ordnung, der Preischamp hat da auch ein Changelog, guckt"}, {"id": 1344, "start": 8065.4, "end": 8076.0, "text": "das letzte Mal was gemacht, habe ich am 1.2.0, bester Changelog Eintrag ist immer noch added"}, {"id": 1345, "start": 8076.0, "end": 8093.24, "text": "Changelog, ok Leute wir sehen uns bis dann, machts gut, see you."}]}