{"text": "Das fängt ja schon gut an, geht schon gut los hier, Monarch S.Was geht so und geht es geht es so euch ja immer immer geht es so mirja wir machen heute weiter wo wir gestern aufgehört haben nur mit dem unterschied dass ich schon wasgefixt habe guckt mal her geht mal auf tut euch da kann es euch auch lokal sein geht mal hierguckt mal da es speichert sich jetzt die änderung es speichert sich jetzt die änderung nach demseiten reload und guckt mal hier ich habe eine neue search field gebaut eben gerade noch nichtmehr mit diesem hässlichen button da unten da kann man jetzt reinklicken und dann irgendwienach was suchen zum beispiel guckt ist deutlich besser als dieses hässliche ding was ich gesternnoch hatte wieso nicht über der progress bar weiß ich finde das so viel viel nicer wir könnenes auch über die progress bar machen ja und ich habe gesehen guck mal wir hatten den ersten pullrequest gestern what the fuck buttons kleiner machen nach breakpoint habe ich habe ich gemerchtund danach habe ich es mit einem force pull über mit einem force push überschrieben weil ich zufaul war das anzupassen lokal das ist jetzt nicht mehr in der history drin und ich bin ja der derimmer sagt man macht keine force pushs in public repos oder in public branches public repos nichtdas problem er macht keine force pushes in public branches aber da habe ich mir gedachtaber einfach trotzdem und ihr glaubt gar nicht das hätte ich echt nicht gedacht mir machtdieser frontend kram wirklich spaß gerade auch wenn es extremer pains champ ist teilweise vorallem das css geproot force so tests und kommentarier beides absolut overratedoverrated gbated outdated keine ahnung übrigens ich habe letztens muss ich euch jetzt mal hier imstream zeigen wir gucken uns das nicht an also die ganzen weeps unter uns hier gendet maleuer hope nicht so high ja aber ich muss euch das einfach mal zeigen wisst ihr was ich letztensgefunden habe das wurde mir vorgeschlagen von youtube internet explorer chan season 1es gibt allen ernstes irgendein das ist ja im prinzip animierte comic strips mitdem internet explorer was auch immeredge kommt auch drin vor internet explorer evolve dann in einem fight mit chrome zu edgedas ist so richtig over the top shit totaler blödsinn ich frag mich einfach ob es das gibtgut warum soll es das nicht geben ist ja eigentlich keine schlechte idee es war aber übrigens dietage die tage des preis champs sind gezählt leute übermorgen hat sich ausgechampft das werde icham ersten abschalten rib preis champ vorbei kommt weg übrigens java script ist logischoder type of not a number is number zu lull oh nee verbotene emotes hier wiederich habe hier ich habe hier auch noch bless rng als emotes drinne das ist auch nicht mehr erlaubtbless rng ist auch wegsehr gut wir machen mal weiter da aber nicht so viel wie gesternhabe das ich habe ich merke das immer noch im hausihr könnt euch doch dran erinnern ich hatte nicht bis vor ein paar tagen eigentlich nochals wehe vielleicht keine so clevere idee kurz hier ein bisschen hohli zu machen nicht dassich hier nackig sitzen würde oder so aber bis zum haus mal zu machen ich muss jetzt nicht wiederübertreiben also das habe ich jetzt noch gefixt wir hatten ja gestern das problem dass der ichund ich glaube wirklich ich habe einen back gefunden wir hatten auch das problem dass derden status nicht gespeichert hat so und ich zeige euch mal was wir geben wir geben uns jetzt malhier den status von diesem globalen to dus objekt aus so und ihr werdet sehen ach neejason stringify wer ist denn dieser jason eigentlich so und wenn man jetzt hier wasaktualisiert werdet ihr sehen guckt der setzt hier dann immer auf true und falls so aber wasder nicht gemacht hat ist also er bekommt offensichtlich die updates mit was der abernicht gemacht hat ist die custom hooks im store laufen lassen was die sachen in local storagespeicher das ging nicht und ich bin mir relativ sicher dass das ein back ist weil das to dusobjekt wird hier aktualisiert aber die custom hooks laufen nicht so und warum bin ich mirrelativ sicher dass das ein back ist naja ich zeige euch mal wie ich das ganze gefixt habedass es jetzt doch funktioniert ich habe einfach gesagt wenn sich to dus ändert dann setzeto dus neu was absolut keinen sinn ergibt aber funktioniert also wenn sich to dus aktualisierthat dann aktualisiere to dus mit sich selbst das ergibt überhaupt keinen sinn dass esnotwendig ist aber dann funktioniert so die custom hooks laufen und ich glaube deswegendass das ein wirklich ein richtig echter back ist den wir gefunden haben im wie heißtdas so reactive tracking binding was auch immer guckt ich kann es euch zeigen wenn ichdas hier aus kommentiere so ich kommentiere das aus es funktioniert alles aber wenn ichreloade ist der zustand nicht gespeichert weil diese save hooks hier nicht laufen sound aktualisiere ich nach dem aktualisieren mit mir selbst was allein schon von der aussageabsolut bescheuert ist dann funktioniert es guckt und deswegen denke ich das muss einback sein weil wo ist denn der sinn dass ich die aktualisierung ja offensichtlich mit bekommesie aber zurückschreiben muss in den store weil er ja sich aktualisieren muss das ergibtüberhaupt keinen sinn so und ich glaube das ist echt ein back und guckt mal wie ordentlichich jetzt hier dieses sorting machen konnte hier guckt mal so wir haben jetzt unsere todus die to dus sind aber nicht sortiert aber wir wollen die to dus ja sortieren nach dannalle die abgehakt sind soll nach unten und nach erstelldatum das neueste soll nach obenne das älteste soll nach oben und das neueste soll nach oben ich weiß nicht warum wir dassortiert haben und da habe ich eine massive big brain seite gefunden das habe ich mireinfach copy paste copy pasted kann man sich die geschweiften klammern sparen guck malda ist es noch kürzer so und da habe ich was gefunden im internet ich habe keine ahnungwas es macht aber man kann sort by property sortieren also ich kann jetzt also meine todus haben ja pelder id created mit einem datum drin den text ob es gelöscht ist und ob esabgeschlossen ist und das kann man wohl hiermit irgendwie filtern lassen exzellent keine ahnungaber das ist jetzt richtig richtig gut zu lesen also wenn presa rief da ist das ist ja jederselbst ernannte spell master hacker man erklär mir mal please warum man das hier brauchtdass es funktioniert mach jetzt mal klammern drum warum braucht man das damit meine customhooks auf den store laufen obwohl er ansonsten ja mitbekommt dass er updated wird keine ahnungich glaube wirklich dass es ein bug ist ich glaube wirklich dass es ein bug ist weilweil wie gesagt der bekommt es ja mit wie gesagt er bekommt es ja mit man siehter jetzt aktualisiert sich aber der lässt die hooks im store nicht laufen der storeselber bekommt es mit ja guck sonst würde das hier nicht funktionieren der store selberbekommt es mit du siehst ja dass ich das aktualisiert das ist ja quasi direkt derstore selber der store selber bekommt es mit aber wenn ich moment ich mache das mal rausich habe es ja noch drin aber du siehst also guck der store bekommt es mit der store bekommtnene die methoden werden das normalerweise geht aus normalerweise geht das gwent wennich anstatt sortata schuld zahldig direkt tutti verwendet dann geht's dann geht's sofort?티this tracking dieses tracking war dass ich was ändert geht irgendwie unterwegsDadurch, dass das über so eine durch so eine reactive variabel durchgeht undWas muss ich aber nie sehen und nachdem es aber im store obwohl ich gesortet to do's verwende nachdem es sich ja im storeaktualisiert aber die store hooks nicht laufenGehe ich davon aus dass es ein bug ist deswegen brauche ich so merkwürdige dinge wie wenn sich to do'sAktualisiert hat dann überschreibe noch mal es mit sich selbst dass die hooks laufen also ich gehe davon aus dass es sind bugalles andere wäre irgendwie nicht nach vollziehbare magicIch habe auch versucht mal auf github danach zu suchen aber ich weiß nicht so genau was ich suchen soll zumindest habe ich nichts gefundenSoDa sind wir jetzt stehen gebliebenIch glaube nicht dass das layer 8 problem ist und wenn ja vielleicht ist es ein layer 8 problemAber dann hat ein pallet ja unten drunter irgendwie einer was nicht so ganz logisch gemachtSo also wo machen wir denn heute weiter ich würde sagen ich mache mal kurz hier meinen ganzen krempel zuSonst wird es ein bisschen unübersichtlichSo read me wo sind wir stehen gebliebenAlso suche suche haben wir guck suche funktioniertWas nicht funktioniert irgendwie spezial so was der fack ich werde spezial suchen so eins oder zwei oder so das machen wir auch nicht wir machenEinfach eins zu eins case insensitiv volltext sucheguckt hier das ist unsere suche die wir machentext zulauer case lokel wen interessiert lokel keck wehzu lauer caseincludes to lauer case also im prinzip wir ignorieren einfach ob es groß und klein geschrieben ist also wenn ich zum beispielein to do habeWo keine ahnung anstatt titel keck weh drinne steht und ich suche jetzt hier nach keck in kleinFinde das auch oder wenn ich nach keck in groß suche oder wie auch immer geartet finde dasLöschen geht auch nochVielleicht musst du ja auch so ein store update machen das problem ist ich habe keine möglichkeit an irgendeiner stelle ein store update zu machenWeil das hier direkt auf das to do gebeindet ist ich kann ja kein custom custom zeug ausführenWieso er die zweier findet wo findet er die zweierWasAch so ja warum findet er die zweier chat dreimal dürft ihr ratenIhr könnt es nicht wissen aber da steht keck weh drinIn demBadeAber war kein absichtlicher tschübett als als als hätte ich das jetzt vorbereitet oder soaber das steht da mit drin so ja gut wo machen wir jetzt weiter wie gesagt es funktioniert allesalso was haben wir als nächstes hübsch gemacht haben wir wir haben das tatsächlich das muss manecht mal sagen ich glaube das ist meine man muss mal abhaken moment wie ging moment der kunde markdown icsen ging das so weiß ich guck mal mal brief mark down preview ne gab es nicht möglich konnteman nicht in mark doch irgendwie schön schön schön icsis icsis machen irgendwie mark down sein checkder gov floor das mache ich doch ist das vielleicht github genau das ist irgendwiespecial github markdown das hier ist normales magda wobei das auch nicht normales magdaun istweil normales magdaun braucht lehrzeichen am ende für neue zeile ok ich sag nix das ist das istnormales magdaun also dass das hier und zwei unterschiedliche zeilen sind es auch githubmagdaun normalerweise müsste man zwei lehrzeichen dran machen für neue zeile wäre auch immer aufso eine bescheuerte idee gekommen ist man kann aber das preview man kann das preview doch bestimmtumstellen settings wir gucken jetzt mal magdaun preview breakskann man das nicht auf auf gfm umstellenkann man nicht wie es kaut magdaun preview gfm github flavoret das schmeckt nach github pepo fettoder muss man jegliche sache irgendwiemagdaun preview render github flavoretdas support github no wie es kauta es kommen magdaun using na geil dabrauchst wahrscheinlich echt ein plugin für was sollen das scheiß alle das gehört jetztmittlerweile sogar dem gleichen laden wollen die mich rollen oder was was ist hier losmicrosoft denkt sich einfach nur egal wir machen jetzt einfach so häkchen hin so dashaben wir gemacht hübsch gemacht den komponenten ausgelagert haben wir bei dir geht'sjetzt nicht was ich da anders machen solltedas ist exakt so wie die das hier ein beispiel haben magdaun preview github flavoret visualstudio code plugin github styling jawoll es hat nur 523.000 installationendu hast welche extension magdaun all in one peers code visual studio code hat so krassviele extensions mittlerweile mach ach nur drei millionen dreieinhalb millionen installationendas ist ja ist ja nix und das ist next level magdaun shit wofür ist das da all you needfor magdaun keyboard shortcuts preview na gut hauen wir einfach mal rein china chinesenplugins installiere ich immer am liebstenmagdaun view auf der shell ja das könnte man auch verwenden somit autoreload oder soaber ich hab das hier lieber im editor drin ok install oh nu magdaun preview all magdaunoder einfach nur das preview öffnen und es passiert nix ne das reicht nicht was mussich jetzt machen magdaun all in all all preview ne wie macht man da jetzt das preview vonauf scheint big brain time zu sein geht nicht so einfach print current document to htmlne hab ich jetzt n html angelegt hier drin oder was zack ja ja wie wie wie macht mandas sein preview kann er zu kompliziert sein review overview overwrite open review togglepreview ok open preview ne alter wir halten uns hier schon wieder mit zeug auf extensionswo ist es warum steht das nicht unter extensions druntercontrol kv kontrol shift v kontrol shift vum diehaben wir gemacht. Auslagerung in Komponenten, Slots und Events haben wir gemacht. Wohlgemerkt,man muss sagen, das ist doch mittlerweile echt ordentlich im Vergleich zu dem anderen Zeug,was wir sonst so fabrizieren. Guck mal, das kann man richtig gut lesen. Unser Main hatjetzt gerade mal 80 Zeilen, ungefähr 80 Zeilen und es ist alles gut lesbar. Man kann jetztnicht sagen, das wäre irgendwie großartig kompliziert. Ja. Und die Suche, die Sucheist richtig pork, guck mal hier. Heck weh. Seht ihr, seht ihr mal auch, guckt mal, wennich hier reinklicke in die Suche, es ist nicht nur, dass die Suche sich ausbreitet, ja, dasssie sich erweitert, sondern der, das Icon mit der Lupe, guck mal, das wird auch blau,wenn man reinklickt. Wie die Umrandung. Seht ihr mal, wie pock das ist? Das ist Tailwind,das ist Tailwind Magic und zwar macht der Fokus hier, Fokus within, also sprich, wenn es fokussiertist, dann setzt der Text auf, also nein, wenn der Fokus irgendwo in diesem Diff drinne ist,dann setzt das Text auf blue und ansonsten ist halt Text grey und hier unten ist haltkein Text gesetzt. Richtig, Magic. Alter, komplett ohne Javascript hier. Wir könnenauch noch mal kurz die Huge Animation bewundern, guck mal hier. Hier, die ist slided. Wo kommeneigentlich diese komischen, dieser komische Rahmen, das ist noch irgendein Hover-Effektoder so. Egal, machen wir jetzt weg. Duration 75, perfekt. Gut, dann würde ich sagen, könnenwir weitermachen. Was machen wir als nächstes? Dark Light Theme, das würde ich wahrscheinlichnoch mal ein bisschen aufschieben, das ist eher sowas für Brain AFK. Wir haben jetztaktuell Dark Theme und eigentlich ganz gut. Das ist eindeutig Advanced-Thema. To Do'sListe Sharing als Link. Ein Delete All-Button. Also ich glaube ein Delete All-Button dürfterelativ easy sein. Musik nennt ein bisschen laut. Geht eigentlich ganz gut. Also einDelete All-Button ist easy, das können wir jetzt gleich machen. Da haben wir unten einfacheinen zweiten Knopf. Wobei, ich glaube ein Delete All-Button neben dem Add-Button istvielleicht ein bisschen... Chain-Lo ist wieder da, guck mal da. Ich glaube so ein DeleteAll-Button neben dem Add-Button ist vielleicht ein bisschen schlecht positioniert. Shortcutskönnten wir uns überlegen. Nur bin ich nicht ganz sicher, wie man Shortcuts im Browserfängt. Das gucken wir uns jetzt an. Wie fängt man Shortcuts im Browser ab? Wie bekomme ichShortcuts? Das müsste doch, also nix sagen Chat, nix sagen. Das müsste doch eigentlichrelativ easy sein. Ich bräuchte so ein On-Click-Event für die gesamte Seite. Wie auch immer ichein On-Click-Event für die gesamte Seite bekomme. Gibt es sowas wie Window-On-Click? Also sowaswie Window-Click? Nee. Ah, Key-Down, nee. Svelte-Window, ah yes, excellent, guck ich wusstedoch die Leute sind schlau. Svelte-Window, Special-Elements, Svelte-Window-On-Key-Down,Alter ist das wieder 5Head was da eingebaut ist. Guckt euch das doch mal an. Massive 5HeadPoggers, Big Brain Time. Das war jetzt glaube ich so der Twitch Chat. Leute, ich muss euchwas erzählen. Ich spiele ja gerade nebenbei wieder 20 Jahre altes MMO auf einem Test-Serverso nebenbei und ich hab nen Char der heißt Pepega. Weiß nicht wie er bis danach war.Zumindest ich hab gestern mit ein paar anderen Leuten zusammen PvP gespielt und wir habenuns ernsthaft mit einem anderen aus der Gruppe hab ich mich in Twitch Emotes unterhalten.Und was sieht man daran? Wenn sich Leute in-Game in einem 20 Jahre altem MMO mit Twitch Emotesunterhalten dann weiß man das ist Mainstream und ist angekommen. Welches MMO Dark Ageof Camelot auf einem Test-Server hier? Bin es interessiert. Atlas, FreeShot, da. Istaber komplett Test und wird gevibe am Ende der Testphase. Also das ist nur was für Leutedie früher auch da auch gespielt haben denke ich. Zumindest fand ich das äußerst erfrischend.Ich hab geschrieben für alle im Chat so nach dem Motto hier I'm tired AF was weiß ich ichgeh ins Bett und dann hab ich reingeschrieben Bettge und dann hat der andere Typ daraufgeantwortet Zetge. In einem 20 Jahre altem MMO da wird man denken die Leute sind nochmehr Boomer als ich. Da wird man davon ausgehen die Leute sind noch mehr Boomer als ich abernein Twitch ist mittlerweile so Mainstream das funktioniert. Aber die Musik ist mir gradezu belastend. Mumu jawoll. Ja Twitch ist auch bei Mainstream Boomer angekommen das heißtschon was. Ok Handle Keydown. Function. Function. Handle wir wollen nicht Keydown gibt es nichteinfach. On Key oder sowas. On Key Press ist mir lieber. So. Hand. Nein. Handle. Easy.Quatsch was mach ich denn da Handle Key Event so rum muss das sein. Lock Event. Was jetzt?Warum Error? Nö kein Error. Keyboard Event. Porkas Hagger Man. Ok Maus Event gibt es wahrscheinlichnochmal extra. So also wo ist der Unterschied zwischen Svelte Kit und Svelte. Svelte istdas eigentliche Framework und Svelte Kit ist was was die Arbeit ein bisschen einfachermacht. Zum Beispiel hast du in Svelte Kit deine Routendefinition pro Feil also legstein Feil an der macht automatisch eine Route draus. So und Svelte Kit unterstützt dannbeispielsweise auch dass du die Seiten schon mal prerendern kannst auf dem Server bevordu sie rüber schickst. Also du brauchst Svelte Kit nicht. Svelte Kit macht manche Sachenein bisschen einfacher oder naheliegender. Aber ansonsten ist das alles Svelte. Was coolist ist Server Side Rendering also dieses Prerendern von den Seiten weil du bekommstdie Seite quasi schon vorgerendert geschickt und der Browser muss sich dann bloß nochübernehmen und nicht erstmal quasi 10 MB JavaScript drunterladen dass er anfangen kanndie Seite zu rendern. Das ist eigentlich ziemlich schlau. Das ist so das beste ausbeiden Welten. Früher hattest du quasi nur Server Seiten die Seiten gerendert. Zwischenzeitlichwaren Single Page Applications übelst angesagt dass du alles kleinseitig gemacht hast undjetzt so eine Mischungdas ist nicht Friday oder heißt die Musik so. So also Handle Key jetzt kriegen wir dieKey Events auf der Seite und jetzt muss ich gucken also wir machen jetzt zum Beispielsowas wie Alt Enter würde ich sagen Alt Enter legt ein neues Emote an oder nicht ein neuesEmote was erzähl ich dir? Neues To Do. Alt Enter neues Neues To Do. Alt plus Enter neuesTo Do und oder Control Enter und Alt plus D gleich dann. Probieren wir das mal ausist ja nur zum testen. Also das war doch irgendwie Modifier oder sowas. Wie man das raus bekommenkonnte ob einer. Achso. Ah ne Alt plus D geht nicht Alt plus D ist. Wäre Tab nichtbesser als neues To Do ich verwende Tab meistens. Weiß ja. Alt Key genau. Ich brauche jetztirgendwas was nicht schon belegt ist. Moment ich brauche Keys die nicht schon belegt sindvom Browser. Was ist denn zum Beispiel frei? Das ist ja alle schon belegt und der erkenntauch nicht das. Guck mal der erkennt auch nicht wenn ich was mit Modifier drücke. Kannes sein dass das On Key Press nicht funktioniert? Sondern dass ich Key Down wirklich brauchedafür. Ja Key Down ja. Das sollte jetzt Alt Key True sein ja. Okay Key Down muss essein. Oder Key Up. Verstehe. Aber lieber Key Up dann passiert das. Wobei ne wir machenes bei Key Down dann passiert es gleich. So wir machen jetzt was passiert wenn ich Enterdrücke. Keyboard Event. Key Enter. Wir testen es jetzt einfach mal damit. Also Alt Enterbedeutet also If Event Key gleich Enter und E Punkt was war das? Alt Key dann Add ToDo. Gucken wir mal ob das jetzt funktioniert. So ich bin irgendwo auf der Seite und jetztAlt Enter. Bäm. Leute neues To Do am Start. Massive. Deshalb 50 Milliarden To Do's. Okayjetzt muss ich ganz schön lang klicken bis da wieder. Excellent. Vielleicht hätte ichauch gleich lieber All Clear All Button machen sollen. Ähm Moment Chat was? MeinLuzent lässt nach dem Kommentarding immer ein Leerzeichen. Ich mach das auch so. Ichmach auch gerne Leerzeichen. Es ist aber würde ich sagen ziemlich Geschmackssache. Genauund das Schließen. Du hast recht. Sackfalte. Bester Name. Hier können wir einfach guckenob wir in dem Feld drin sind und dann schließen wir es. Wieso benutzt du eigentlich WishlStudio Code anstatt Wishl Studio? Weil für so Frontend JavaScript Sachen Wishl StudioCode deutlich besser ist. Der JavaScript Support in Wishl Studio ist PaintsChamp und du hastgerade in Wishl Studio Code schon out of the box ziemlich guten JavaScript Support. Dazukommt dass du Milliarden an Extensions hast für alles was du brauchst. Guck mal zum Beispielmal ein gutes Beispiel für wenn man zum Beispiel Icons einbinden will. So. Icon. Icon. Wasmal als Beispiel. So und jetzt ich benutze hier Iconify für und jetzt gibt es ein Pluginfür das Autocomplete der Icons inklusive. Inklusive Vorschau wie die Icons aussehen.Das ist halt das geile an Plugins. So. Fügen wir das ein. Bam. Das habe ich irgendwie kaputtgemacht weil ich das Code vergessen habe. Und schon haben wir das Icon drin. Kannstdann auch sagen wir wollen Tweemoji haben. Tweemoji. Tweemoji wollen wir den Döner.Oder das Taco. Taco. Bam. Hat Tweemoji Taco drinne. Wir können dann jetzt sowas sagenwir hier Class Text 8XL. Jetzt haben wir ein großes Taco. Bumba Dings Bums Bada Bums Dingsalles klar. Poggers. 18 Monate am Start. Wir können auch Cookie. Cookie. Das ist aberein XL Cookie drinne. Oder Kappa. Ah nee Kappa heißt das nicht. Das ist ja Moon offiziell.Das ist ja Hull Moon. Hull Moon Face. Thanks to JetBrains Fleet wird Visual Studio Codeübertreffen. Ich denke die werden denen ganz schön Konkurrenz machen aber ich glaube indem Fall nicht dass es das übertreffen wird weil es einfach Java versus Javascript ist.Du wirst tausendmal mehr Leute finden gerade für Frontend Sachen die die Sachen in Javascriptprogrammieren wollen als in Java. Solange Plugins in Fleet in Java programmiert werdenwird für Frontends Geschichten denke ich zumindest Visual Studio Code weiter das Ding schlechthinbleiben. Bin mal gespannt. Ich stelle mir Fleet eher in Richtung so Sachen wo es keineoffiziellen Ideen von JetBrains gibt. Aktuell ist es so man will Rust programmieren. Esgibt ja ein ganz gutes Rust Plugin für diese ganzen JetBrains Dinger. Dann verwendest dustandardmäßig IntelliJ und machst dann irgendein Plugin für rein. Obwohl du eigentlich garnicht IntelliJ haben willst. Für sowas ist Fleet gut. Dann stelle ich mir zum Beispielvor du nimmst Fleet dann machst du das Rust Plugin rein hast eine ganz gute Rust IDE.Du nimmst Fleet und machst das BrainFuck Plugin rein hast einen ganz guten BrainFuck Editor.Haben die Ruby? Die haben RubyMine die haben auch für Ruby was. Für welche halbwegs verbreiteteProgrammiersprache hat JetBrains eigentlich nichts? Flutter zum Beispiel. Flutter könntees ein gutes Fleet Plugin geben und gut ist. Oder für das meiste haben die ja schon. Fürdas meiste haben die ja mittlerweile irgendwas. Aber da hälst du schon zwei Sachen. Du machstein Rust Plugin rein, ein Flutter Plugin und hälst eine ganz gute IDE dafür. Ohne dassdu den ganzen IntelliJ Kram drumherum brauchst. Rubey haben sie. Die haben RubyMine. Habeich früher auch mal verwendet als ich noch viel Ruby gemacht habe aber jetzt gar nichtmehr. Also wir drücken Alt-Enter und es gibt ein neues To-Do. Das ist doch schon mal Pog.So und dann wollen wir. So und dann wollen wir wenn wir klicken. Wie machen wir das jetztdass es Closed wird? Also es gibt zwei Sachen. Zum To-Do Closen. Wir könnten entweder dasglobal machen und dann schauen welches To-Do gerade aktiv ist. Oder wir machen das in derTo-Do Component. Oder wir werfen ein Event in der To-Do Component. JetBrains hat nichtsfür Haskell. Ja dann auf gehts. Fleet Plugin. So wie machen wir das jetzt mit dem schließen?Also wir wollen auf jeden Fall schon mal. Brauchen wir kein else. If. If Key ist waswas? Was hatten wir gesagt? Ach so hier Alt. Wenn es D ist. Alt und D okay. 0W. Alt undD ist dann zum schließen. Und jetzt müssten wir an der Stelle noch wissen was das aktiveTo-Do ist zum schließen. So und da bin ich mir jetzt nicht sicher wie wir das machen.Entweder track ich das hier drinnen was aktiv ist. Oder ich werfe oder ich machs im To-Doselbst. Wahrscheinlich ist es im To-Do Handeln sinniger. Dann ist das auch gekapselt unddann muss ich da keine Gedanken drüber machen. Also Text Area. Key Down. Machen wir das jetztinline? Machen wir das jetzt inline? Dann muss das aber Quoten. Nee Klammern machensonst funktioniert der Kram nicht. If. Ich hab keine Ahnung ob das so funktioniert.Schauen wir mal. Mal gucken. Wenn Key D und Alt Key dann. Dann To-Do dann gleich True.Kann man das so schreiben? Nee natürlich nicht. Muss man bestimmt nochmal klammern.Excellent. Okay Alt D. Bäm. Funst. Easy. So und jetzt müssen wir das. Wir brauchen aberzwei Sachen. Wenn man nochmal Ctrl D drückt dann wird das wieder Entdant. Wieder geöffnetquasi. Entdant wird das dann. So also das wollen wir auf jeden Fall schon mal hier nichtals Inline Funktion haben. Das ist ein bisschen hässlich. Handle. Handle. Close. Oder so.Handle. Key. Hardle. Hardle. Key. Stimmt! Der Byte Strikes ist schlau. Natürlich. Dasist viel einfacher. Byte Strikes ist richtig big brain heute am Start. Guck mal.Ja. Vorgass. Nice. Ja das ist das. Ich mein. Chat was sagt ihr? Inline oder extra extraFunktion hier oben. Ich glaub wir können schon eine extra Funktion machen oder? Das checktdoch sonst niemand der das durchguckt. Handle. Key. Um. If. Äh Moment. If. Ey das ist MarioGalaxy oder? Das ist Mario Kart irgendwie Mario Galaxy. Ja. Das ist die Regenbogen Streckeoder? Aus Mario Kart 8. Oder? Nee hatte die Mario Galaxy. Ach keine Ahnung. So. Kunst.Chat. Ich versteh das Ende nicht ganz. Du prüfst auf all die und prüfst das mit demmit einem und und. Ach du meinst das hier. Du meinst. Als ich das so geschrieben hatte.Das ist das das das funktioniert wahrscheinlich in den meisten Programmiersprachen aber dasin JavaScript funktioniert. Wundert mich. Wundert mich nicht. Und dann war das hiernoch eine extra extra Funktion. Also das da ist eine anonyme Funktion. Weil. On clickoder on Keydown halt eine Funktion haben will. Und und sonst nichts. Das hier ist quasiein Ausdruck den man auswerten kann in JavaScript. Kann ich dir auch zeigen. Das ist quasi wasweiß ich. Das gleiche wie so. Ach so ups. Niede. Das ist halt ein Ausdruck da kommtTrue oder False bei raus logischerweise. So. Und das verknüpft du einfach zu einem quasiweiteren logischen Ausdruck. Oder am Ende auch True oder False rauskommt. Aber dadurchwird es quasi ein Ausdruck den JavaScript auswertet. Deswegen musst du es nicht klammern.Du hättest es auch klammern können und extra. Also. Du könntest auch hier drin jetzt einganz normales If machen. Dann musst du es aber klammern. Wenn du das in einer Zeileschreiben willst dann muss das ein Ausdruck sein. So. Und was hier rauskommt ist das kannman im Prinzip ausprobieren. Keine Ahnung das da. Und dadurch dass es ein und und istwird das zweite nur ausgeführt wenn das erste True ist. Weil es ist ja logisch wenn mansowas hier hat. Oder keine Ahnung. Dann muss der das zweite also machen wir es umgedreht.So. Der muss also das ist jetzt stellvertretend für ein Ausdruck der True oder False ergibt.Wenn das erste False ist dann muss er das zweite nach dem und und ja gar nicht mehrauswerten um das Ergebnis zu wissen. Also. Stell euch mal vor das hier ist ein Ausdruck.Da sag ich zum Beispiel 1 gleich gleich 1 und 2 gleich gleich 2. Oder 2 gleich gleich1. Hier kommt False raus. Hier kommt True raus. Das heißt um zu wissen was B ist mussder das hier auswerten. Weil es ist True. Und er weiß er muss das zweite auswertenum zu wissen was da was bei B rauskommt. Hätte man jetzt sowas hier stehen. Dann werteter den ersten Ausdruck aus und erkennt aha. Der erste Ausdruck ist schon False. Das heißtich muss die zweite Hälfte gar nicht ausführen um zu wissen dass B False ist. Ist ja auchirgendwie eine Optimierungsgeschichte. So. Und das hier ist im Prinzip nichts andereswie das. Nur dass man nur das in JavaScript aus irgendwelchen Gründen. Was das funktioniertübrigens nicht. Das funktioniert übrigens nicht in jeder in jeder Sprache. Du kannstzum Beispiel. Also ja für JavaScript ist hat das hier einen Return Wert. Ehrlich gesagtkein Plan warum. Also was weiß ich. Let B gleich 0. So und jetzt wenn ich sage B gleich1. Aus irgendwelchen Gründen ist das in Ordnung. Dass das keinen eigentlichen Bool Return Werthat. Ich habe keinen blassen Schimmer warum das in JavaScript erlaubt ist. Da gibt eigentlichkeinen Sinn. Aber das funktioniert. Es Lind. So was benutzen wir hier nicht. Wir haben immergut selbst dokumentierten fehlerfreien Code. Da braucht man sowas nicht. In anderen Programmiersprachenmit sinnvollem Typing. Geht das nicht. Also wenn du sowas in C sharp ausprobieren willst.C sharp Lab ist das glaube ich. Also wenn du sowas in C sharp machen willst klappt dasnicht. Und KS wo sind wir hier. Also wenn du in C sharp beispielsweise sowas machen willsthier was ich in B gleich 0 und dann willst du und dann willst du überprüfen sowas wie. Ich meineder erste Teil funktioniert noch. Aber da kannst du nicht einfach sagen. Ja. Irgendwie if. Undund wobei mit if geht es ja auch so nicht. Das ist schon so so so so pains. Das ist mir da garnicht so. Und und B gleich 1. Das lässt er dich hier an der Stelle schon gar nicht machen.Er sagt was. Was zum Teufel. Wie willst du. Bitteschön. Bull Operator und Int miteinanderunter einen Hut bringen. Also das ist. Ich würde fast behaupten. In den meisten Programmiersprachendie irgendein Default Return Type haben für alle Statements klappt das. Aber in normal geteiltenSprachen klappt das nicht. Was man in C sharp machen kann ist zum Beispiel wenn man wasabbrechen will. Man darf. Man kann glaube ich sowas hier machen. Das oder oder throw.Oder nicht. Ich bilde mir ein sowas ist jetzt eigentlich erlaubt gewesen. Das könnte aberauch in einem anderen Kontext sein. Wir haben nämlich was geändert in einem letzten Versiondas sowas in der Richtung jetzt geht aber anscheinend an der Stelle nicht. Egal dasist nicht unser Problem heute. Wo sind wir denn stehen geblieben. Wir können unser Todo Closen. Und öffnen wieder. Ist eigentlich alles was wir machen müssen. Mehr müssenwir nicht machen. Wir können unser To do öffnen und schließen. Und wir können mit alt enterbeliebig viele To do anlegen. Wenn wir wieder reinklicken macht das wieder auf. Eigentlichgenau das was man haben will. Man könnte jetzt. Man könnte vielleicht noch sagen.Wenn man entfernen drückt. Was haltet ihr von der Idee wenn man entfernen drückt aufeinem geclosen To do. Dass man es löscht. Hast du schon mal ein Fim fürs Programmierenausprobiert. Ja ich hab früher. War ich richtiger Hardcore Wim. Und ich verwende Wim eigentlichauch immer noch täglich aber halt nur für irgendwelche. Dinger wo ich in der KommandoZeile bleiben will. Also nur wenn ich in der Kommando Zeile bleiben will. Ansonstenmache ich da relativ wenig mit. Zumal. Ich hatte früher den Tick. Ich habe versuchtmein Wim übelst aufzubohren. Mit Fuzzy Search Geschichten mit irgendwelchen Python Pluginsmit JavaScript Gedöns und sonst was. Und irgendwann habe ich mir gedacht Alter. Du bastelst jamehr an deiner Editor Konfig und an deinem. Dass dein Editor halbwegs bedienbar ist rumanstatt irgendwas sinnvolles zu machen. Ach Papierkorb. Nee in Papierkorb gibt es nochnicht. Das machen wir als nächstes. Wir machen als nächstes den Papierkorb. Also wir machenjetzt genau. So. Wir machen jetzt die Shortcuts. Genau die drei Sachen machen wir jetzt. Shortcuts.Ach ja genau du hast recht. Ja genau das meine ich. Richtig. Richtig. Der Chat hatrecht. Ich meine das hier. Eins. Gleich. Gleich. Zwei. Und dann. New Exception. Kekwe. Oderauch nicht. Aber ja ich meine ich meinte ich meinte meinte das. Ich bin mir gerade nichtmal sicher wie man es benutzt. Das haben die in einem der letzten C-Sharp Versionen eingeführtdass du quasi jetzt Exceptions werfen kannst an Stellen wo du eigentlich irgendein Statementschreiben müsstest. Aber zur Abkürzung. Dass du quasi wenn du eh einen Error werfen willstdas an der Stelle machen kannst. Nee nee nee das meinte ich nicht. Ein wie heißt das TernaryOperator. Ach. Keine Ahnung das sind so Nischendinger die braucht man so selten. So. Also entfernenkönnen wir machen. Was für einen Knopf kommt denn wenn man entfernen drückt. Log. E. Wasfür einen Knopf kommt wenn man entfernen drückt. Delete. Aha. If. E. Delete. Sagt mal. Istdas hier. Hat das jemand schon mal mit TypeScript gemacht. Ist das hier eine getypte. IrgendwieEnamoration oder was auch immer in TypeScript. Also hat TypeScript autocomplete für dieKeys dann die es gibt. Das wäre ja schon cool. Oder vielleicht dies. So if key delete. Dannremove to do. To do Punkt ID. Oh. Ja nice. Oh Moment das funktioniert. Ich muss checkenob es. Ich muss checken ob es. To do und dann und und. So das kann ich nämlich sonst allelöschen. Guck jetzt passiert nichts und wenn es jetzt dann ist dann kann ich es löschen.Das finde ich eigentlich ganz gut. So. Faut nicht so auf. Stell dir vor jemand will denText eines fertigen to do's ändern und löscht plötzlich sein to do. Kann er Feature Requestaufbauen auf GitHub. Nee aber du hast schon recht das ist vielleicht keine all zu clevereIdee wenn man einfach entfernen drückt. Du willst dir was reinschreiben und dann. Dannfunst das nicht. Aber zu Testzwecken finde ich das gar nicht mal so verkehrt. Sonstjetzt muss ich mir jetzt eine ordentliche Tastenkombination ausdrücken. Was ist denneine gute Alt. Alt. Alt entfernen. Bäm Alt entfernen. Und und. Alt key kommt noch dabei.Alt entfernen. Das drückt keiner einfach mal so. Alt entfernen. Also wir haben jetztAlt Enter anlegen. Alt D zumachen und Alt entfernen löschen. Das finde ich ok. Daskönnen wir so lassen. So next. Papierkorb. Ja Papierkorb wird etwas komplizierter. Aberich glaube die grundsätzliche Sachen. Ein Andubutton ist eine gute Idee. Das ist aberauf jeden Fall. Ein advanced Thema. Papierkorb haben wir die grundlegenden Sachen schon da.Weil. Wir haben schon ein Feld. Deleted für die To do's. Aktuell löschen wir die jawirklich. Ja kein que. Also aktuell ist ja wenn ich hier drauf klicke. Dann löscht erdas ja wirklich komplett. Was wir jetzt machen müssten ist nicht. Richtig die To do's löschensondern. Eigentlich nur noch sagen. To do. Deleted. Gleich true. Aber da wird jetzt erstmalnichts mehr passieren. Wenn er mal drauf klickt. Aber ich muss jetzt hier. Filter. Ich mussdie deleted die deleted rausfiltern. Also filtern. To do. Bringst hier mal mal die Klammerweg. To do wo es not. To do. Deleted ist. So. Ok. Oh ich muss mein local storage löschenda sind noch To do's drinne. Da sind noch To do's drinne wo diese neuen die dieses neueproperty gar nicht haben. Oder wir löschen sie. Ja Funst. So. So jetzt zeigt er nur nochjetzt zeigt er nur noch die To do's an. Die. Nicht deleted sind. Ok. Lull. Gut. So undgucken wir mal in local storage rein. Das sollten jetzt. To do's drinne sein. Die deleted sind.Hier zum Beispiel. So und jetzt müssen wir eine Möglichkeit einbauen um das anzuzeigen.Wie was für To do's deleted sind. Da habe ich aber ehrlich gesagt keine gute Idee zu.Was war da ein erster Gameboy in grau. Ich glaube ich hatte den klassischen den ganzklassischen alten Gameboy der da 19 was weiß ich in 89 oder so raus kam. Und den gab esgab es den nicht nur in grau und später gab es den dann glaube ich auch in rot und soaber ich glaube am Anfang gab es den nur in grau. Hat den in grau. So jetzt haben wirdie Möglichkeit unsere To do's zu markieren. Als. Oh. Das ist schlecht. Wobei ne das istok passt. Ja jetzt haben wir jetzt haben wir die Möglichkeit unsere To do's zu markierenals deleted. Die Sache ist bloß die wie hat jemand eine eine clevere Idee für den Papierkorb.Und wie stellen wir das dann wieder her. Braucht es einen neuen storage für die deleted.Ich meine wir könnten einfach ein Filter einbauen. Show deleted. Wir machen genau wir macheneinfach den Toggle hier oben hin. Show deleted oder sowas in der Richtung. Und dann zeigtda alles an. Also nur mal so mal so als Beispiel wir machen jetzt einfach mal einen sehr hässlichenButton. Button. Ja und dann genau da könnten wir die komplett durch gestrichen unten drunterund unten drunter. Ja. Show deleted gleich Pauls. Und klick. So langsam lärm ich. Undklick. Show deleted. Ne das müssen wir jetzt so machen. Gleich not. Show deleted. Wo istder Button hin. Der Button hat kein Text. Klick. Ja massive Button. Gut jetzt jetzttoggle das deleted auf true oder false. Show deleted. Genau. So und jetzt können wir anhanddessen das filtern. So nämlich hier hier filtern wir deleted raus. Und dann sagen wir einfach.Wenn. Show deleted. Und und. Oh. Warte mal. Nee. Moment. Das ist die Logik. Die Logikergibt keinen Sinn die ich hier gebaut habe. Also Filter. Show. Moment ich will jetzt nurwenn es nicht. Nee warte mal oder oder will ich. Show deleted. Ja. Im Prinzip ist. Eigentlichdas die Logik oder. Ja. Kunst. Jetzt jetzt jetzt zeigt er einfach alle an. Guckt. WubbelWubbel Wub. Reload. Ja. So ist sie open und dann bräuchte man oder. Wieso habe ich doch.Ich habe dann als Date. Und deleted als Date. Aber sagt der Chat dazu. Genau und jetzt denRestore Knopf anstatt dem. Massive. Der Chat ist wieder hier. Expanded. Mega Gehirn. Definiereverschiedene Filter für alles deleted search. Du nimmst eine Variable in der steht immerwelche Filter Funktion gerade stehen. Könnte man auch machen. Ja aber das passt doch wenndas deleted ist dann ist das icon ein Restore Knopf. Das ist richtig schlau der Chat wiederhier exquisite high IQ. Way to smart Hacker Mans. Ja. Also. Gehen wir mal in to do rein.Wir lassen das jetzt übrigens standardmäßig zum testen mal auf show deleted auf auf truestehen. Man könnte sich noch überlegen wenn man das umschaltet auf show deleted dasser nur die gelöschten anzeigt. Und die normalen gar nicht. Egal. Egal. So. Und jetzt tauschenwir das einfach aus. Hier ist das icon für remove. So und das icon für remove jetztmüssen wir den if machen ins Welt da bin ich mir nicht so ganz sicher wie das funktioniertirgendwie so wahrscheinlich. Aha. Wobei das if muss ja da außen drum herum. Was ganzwas anderes. Warum habe ich hier überhaupt noch ein extra diff drumherum warum macheich das click nicht auf das icon. Gebt dem Kram hier unten die classes und macht es weg.Warum mache ich das nicht. Weil. Weil on click bei icon nicht funktioniert. Ja das ist jaziemlicher pains. Genau. Und click ging ja nicht auf icon. Jetzt weiß ich wieder warumich den Mist habe. Also brauchen wir if. So if. Das to do deleted. Dann das und ansonstenelse das. Else war glaube so. Ich finde also ich weiß nicht was das für eine für einebig brain Syntax ist. Die finde ich nicht schön wenn ich ehrlich bin. Was hat er jetztfür was was will er hier von mir jetzt. Ach so weil das empty ist. Also da muss ich sagenda finde ich die Vue.js Syntax viel schöner. In Vue würdest du sowas machen. Vue if unddann würdest du sagen. Else. Das wäre das Gegenstück dazu. Ich weiß nicht was jederschöner findet aber. Ich. Bin da jetzt auch kein all zu großer Fan von dieser Syntaxehrlich gesagt. Man erkennt schon was deleted ist. So und alles die deleted sind die kriegenein extra Button. Die Vue Syntax findest du ganz schlimm. Ich finde die eigentlich nice.Wir brauchen ein gutes Icon für Restore. Hero Icons. Gibt es dann Restore. Sowas. Ok wirmachen jetzt mal Iconify. Wir suchen jetzt mal ein gutes Icon für Restore. Bros Icons.Restore. Ja sowas wäre richtig gut. Such mal nach Return. Ne gibt es nicht. Sowas wärehalt richtig cool ne. Aber das passt halt vom vom Design her überhaupt nicht zu denanderen Icons. Da muss man ja schon genau sein. Re. Sowas. Ich meine. Ich finde dasist gar nicht so schlecht dafür. So. Also ich fand das fand das hier mit. Fand daseigentlich besser. Was war schöner. Der Kasten ja. So. Machen wir es mal so. So jetzt wollenwir allerdings nicht remove machen sondern. Restore to do. Übrigens allein schon dassich hier I.D.s übergebe ist ziemlich beknackt. Weil. Ich brauche überhaupt keine I.D.s mehr.Can't wait. Restore to do. Ist auch sehr einfach. Wir setzen einfach die I.D.s wieder auf. Ichglaube viel simpler kann es nicht sein. So. Oh. Ich habe es geprägt. Oh. Oh je. Äh.Was habe ich gemacht. Was habe ich falsch gemacht. Das mit den I.D.s. Das mit den I.D.sist eigentlich nichts Schlimmes. OK. I.D.s. Ich übergebe jetzt einfach eine I.D. um derI.D.s übergeben Willen. Nicht dass man das brauchen würde. Jetzt geht. Hä. K. Häh.Ist das wieder die Geschichte wo ich das da eigentlich machen müsste.Das ist ja hängen geblieben. Warum geht das denn mit Parametern und ohne Parameter gehtdas nicht. Ist ja dumm. Zack. Komm mal hier. Und sonst sind sie wieder restored. Sindsie gelöscht. Alle löschen. Bäm. Restore. Zack. Hawkchamp. Übergibt doch direkt todo. Nee ich muss da gar nichts übergeben. Es gibt nur einen to do. Deswegen die I.D.ssind eigentlich komplett unsinnig. Ja aber. Aber guck mal. Hier habe ich doch auch Klammern.Da müsste er sich da nicht stören. Da kann ich nicht ausführen. So. Jetzt machen wirdas hier mal wieder weg. Wo ist mein hässlicher Button. Da brauchen wir jetzt einen Switchoder so. Ach nee. Erst mal gucken was das mit den Funktionen jetzt hier auf sich hat.Ich meine ganz im Ernst. Scheiß drauf. Wir machen das jetzt einfach so. To do. Deleteequals false und unten drunter deleted true. Fertig. Kunst. Ich glaube das ist die deutlicheinfache Variante. Oder. Oder wir würden das machen. Was der. Ich glaube ich gesagt hat.Wir würden sowas machen wie Funktion toggle deleted oder sowas. Wisst ihr was. Was fürextra Funktion oder in line. Also extra Funktion würde dann so aussehen. To do gleich deleted.Not deleted. Aber was ich nicht was ich jetzt nicht verstehe ist. Aber wenn ich das danneinfach so reinschreiben würde ohne Klammern das würde dann gehen oder wie. Würde dasjetzt funktionieren. Ach das geht jetzt oder was. Das ist quasi Pointer Pointer auf dieKlammern. Und wenn ich so sage fühle das direkt aus. Aber was ist der Unterschied zwischenso mit einem Parameter oder Parameterless. Weil da müsste man auch meckern. Cannot cannotexecute. Wie dem auch sei wir hinterfragen wir hinterfragen da die JavaScript Geschichtenicht weiter. Das ist jetzt einfach so. Swell Magic. Ok. Verstehe. Was denn. Macht das ifüber die Icons und der Button um die Icons. Ah ja ja das ist eine gute Idee. Wir machendas. Wir machen das wirklich so. Wir machen das if so. Innen drinnen. Weil das hier obenist ja immer gleich. Wir machen das if quasi. Hier rein. Und das if hier rein. Das schmeißenwir weg. Da machen wir das. Und das. Schon wieder schon ein bisschen übersichtlicher.Übrigens wir machen so das nicht alle angezeigt werden. Ich habe es mir anders überlegt.Das ist zu das ist zu verwirrend. Wir sagen Show deleted. Und wenn die to do's deletedUps. Ich will die eigentlich filtern. Ich will inzwischen umschalten können. Das istrichtig. Du machst trash icon by deleted. Warte mal. Habe ich jetzt falsch rum? Achso. Ich habe es falsch rum ne. Das hier marscht gerade nochmal weg. Das war Blödsinn. Title.Und jetzt. Das können wir so lassen. Das müssen wir nicht inline machen. Das könnenwir ruhig so lassen. Was jetzt halt cool wäre irgendwie wenn wir da nicht so unterschiedliche.Warum braucht man das? Warum braucht man das doppelt? Könnte ich nicht. Moment. Wir checkenjetzt. Moment. Wir machen jetzt big brain play. Kann man nicht einfach anstatt das hier dasicon dynamisch beinden. Dass ich quasi sag icon. Moment. Ich muss mal ausprobieren.Und dann. Wenn to do deleted ist. Dann machen wir hero icons das da. Und wenn das nichtdeleted ist. Dann machen wir hero icons trash. Oh. Was jetzt? Ach so ich habe es nicht gequotetich noob. Ja das funktioniert nämlich auch. Das ist dann nämlich viel kürzer und knackiger.Sagen wir das noch so. Ich mein warum kann er. Ach so weil der ist eigentlich viel längererText ist. Ja die Sackfalte wusste es wieder. So und jetzt machen wir noch den Filter.Also da muss ich jetzt binary logic. Also wenn show. Ups. Wenn show deleted ist. Dann willich. Dann will ich checken ob das to do auch wirklich deleted ist. Nicht to do's alter.So. Jetzt heißt jetzt so zeigt er nur die to do's an. Kann man umschalten die. Das istquasi Papierkorb Ansicht jetzt. Das ist quasi Papierkorb Ansicht. Nur die die. So. Unddann machen wir die Papierkorb Ansicht wieder aus. Und dann müssen wir jetzt noch filtern.Also quasi show deleted. So und jetzt können wir sagen. Oder. Oder. Ne Moment. Und. Ne.Jetzt. Jetzt. Jetzt bin ich verwirrt. Dieses Reactive Label ist richtig big brain. Ichmein. Das kann es jetzt ja nicht sein. Das muss doch einfacher gehen oder. Und das funktioniertimmer noch nicht. Moment meine binary logic Dinger sind gerade nicht. Hier ab vor dentask. Ich will einfach switchen. Also wenn es. Nicht show deleted ist und. Das müsstedoch eigentlich so funktionieren oder. Low IQ. Chat ihr müsst mir helfen. Hä? Hä?Hä? Hä? Also ich habe keine. Ich habe keine mehr die nicht gelöscht sind. Es funktioniertoder. Ich muss nur welche löschen. Ah ok. Alles klar. Hat alles funktioniert. Ok. Hierlege ich. Aber das muss doch trotzdem einfacher gehen. Ich meine was ist denn das hier. Und.Und. Das. Irgendwie wieder strebt mir das. Das muss man doch einfacher schreiben können.Wer ist gut in binary magic. Das ist jetzt einfach so. Könnt ihr pullrequest machen.Wem es sich gefällt. So. Ja wunderbar. Das hier ist jetzt quasi die Papierkorb ansicht.Das ist die Papierkorb ansicht. Guckt hier. So. Das müssen wir jetzt nur noch. Das sindjetzt alle. Das sind jetzt alle gelöscht. Die können wir jetzt einfach alle restoren.Jetzt der Papierkorb leer. Ja. Ey wir müssen übrigens hier oben bei der progress Anzeigealle gelöschten rausfiltern. Guck mal sonst kann das nicht funktionieren. Das show. Notshow deleted ist da unnötig. Nee wenn ich das weg mache dann würde der immer. Egalwas ich was ich also wenn wenn show deleted. Quasi. Also. Auch wenn show deleted an istwürde er dann alle die nicht deleted sind anzeigen. Ohne diesen filter davor. Ich habeheute morgen gepusht. Was passiert wenn man in der Papierkorb ansicht ein neues Elementhinzufügt. Dann wird ein neues Element hinzugefügt aber man sieht es nicht. Sondern man siehtes erst wenn man switcht. Ja das sind so die details. Wir brauchen noch ein Papierkorbleeren icon. Ein so richtig so richtig Papierkorb Papierkorb leeren icon. Wir machen es zumtesten hier oben wieder eins. Clear. So. Und da was weiß ich. Empty Trash oder so. Showdeleted gleich gleich. Ja. Du hast recht das müsste eigentlich funktionieren ja. Klingtlogisch. Der Chat wieder. Hier guck mal da. Big brain time. Massives Gehirn wieder. Dasliegt einfach daran dass die ganzen Prime Sub schon einfach so den Wahnsinns IQ Boostausgelöst haben. Dass der Chat mittlerweile so viele high IQ Leute hat. Das ist einfachschon quasi von Twitch nicht mehr gehandelt werden kann. So nice. So jetzt brauchen wirnoch ein True. Und jetzt brauchen wir noch einen Clear Button. Empty Empty Trash machenwir jetzt. Empty Trash. So Empty Trash heißt wir filtern alle To Do's die also To Do'sNe. To Do's gleich. To Do's. Filter. Alles was nicht. Alles was nicht deleted ist wirdgelöscht. Ok. Clear. Bam. Dann können wir den Papierkorb wieder schließen. In der Papierkorban sich könnte man das Add Icon durch ein Empty Trash. Alter. Der Chat ist ja richtigExpanded. Expanded hier heute. Das hört ja gar nicht mehr auf mit Massive Ideen hier.Das ist eine super Idee. Das ist eine richtig gute Idee. Manchmal hat es echt seinen Vorteilwenn man nicht einfach alleine da ist und daran rumfrickelt. Warum muss Empty Trash Reactivesein mit den. Muss es nicht. Das hier ist die Zuordnung weil das weil To Do's ein Storeist. Und ein Store kannst du nur accessen mit dem Dollar davor oder alternativ so. Dasist die Store. Store Assign. Operator oder wie immer das heißt. Keine Ahnung. Das hatin dem Fall nichts mit Reactive zu tun. Ja das machen wir jetzt. Wenn man in Papierkorban sich sind dann. Moment mal machen wir das mit dem Clear. Add Button. Wo ist der AddButton. Da. Wenn wir im. Gibt es denn ein schönes Papierkorb so Trash Empty. Nee gibtes nicht. Ok wir ersetzen das mal nur durch Trash. Empty. Gibt es so etwas wie Empty.Recycle. Vielleicht sollten wir einfach einen anderen Icon Font nehmen der mehr Zeugs drinhat. Weil der ist schon sehr limitiert. So aber dann machen wir das doch an der Stellemal. Das Icon ändert sich einfach entsprechend dem Status. Also wenn wir in Active. Nee Momentwie hab ich den Kram genannt. Nee nicht Search Active. Show Deleted. Also wenn wir in derPapierkorb ansicht sind. Dann machen wir ein Papierkorb Icon hin und wenn wir in dernormalen ansicht sind machen wir das normale Icon hin. Probieren wir das schon mal ausob das funktioniert. Trash. Ja. Wir sind in Papierkorb. Ich lösche mal kurz was. Wirsind in der Papierkorb ansicht. Dann ist das unten ein Clear All. Und wir sind in der normalenansicht. Dann ist das unten ein Add. Das finde ich eigentlich relativ clever. Byte Strikealles klar. Ist das die Assembler Variante vom Papierkorb oder wie? Nee das ist irgendwaswas du von Stack Overflow kopiert hast wahrscheinlich. Gehe ich jetzt einfach mal von aus. So undjetzt müssen wir noch gucken, dass je nachdem in welchem Modus wir sind, was unterschiedlichespassiert. Also on click kann man. Ok das ist jetzt die Frage. Kann man hier drinnen checken?Kann man hier drinnen checken? Geht sowas? Nee wie habe ich es gerade? Empty Trash. Meintihr das? Funzt es? Ok jetzt wenn tu du es. Nee es funktioniert nicht. Das funktioniertnicht. Ach Moment. Das ist auch falsch rum. Falsch rum. Ah. Oh das ist ja nice. Das istja richtig nice. Lul. Zum Programmieren bin ich quasi gezwungen Englisch zu können.Nee aber es ist von Vorteil, wenn du die Sachen in deinem Source Code in Englisch schreibst.Weil ansonsten hast du das Problem, wie wenn Franzosen irgendwas programmieren, dass dieVariablen dann auch Französisch sind und das checkt dann keiner mehr. Ja genau. Daskommt auch noch dabei. Tutorials und Webcasts und Konferenztalks und sowas sind eigentlichauf Englisch. Aber man muss dazu sagen, es ist ein Unterschied ob du jetzt irgendwieEnglisch in einem Film verstehst oder gar Englisch reden kannst mit Leuten oder ob duirgendwie IT Englisch Sachen verstehst. Also das ist nochmal ne Runde weniger anspruchsvoll.Ich könnte mal wieder pushen wo wir gerade dabei sind. Ich deploy gerade mal ne Rundewieder. Ansible Playbook. Damn. Ja aber so komplett ohne Englisch sagen kommt es nichtaus. Das ist übrigens auch der Grund warum ich den Browser und mein Betriebssystem komplettauf Englisch stehen habe. Ah zwei Gründe. Erstens ist man findet Fehler deutlich einfacher.Also wenn man in die Windows Settings guckt und danach irgendwas sucht, wenn man das aufEnglisch sucht ist es einfach viel einfacher zu finden. Und weil es doch irgendwie Wörtergibt wo man sich halt, also auch technisch, zum Beispiel dass das Flight Mode heißt wüssteich jetzt nicht so standardmäßig. Das ist halt dieser Wi-Fi und alles an aus Modus oderwas auch immer wie die Sachen so genannt sind. Das finde ich ganz praktisch wenn mandas eigentlich täglich so mitbekommt ja. So. Also jetzt haben wir hier unser PapierkoppModus. Das ist eigentlich richtig nice. Das gefällt mir echt. Guck mal hier wir löschenden Kram jetzt, gehen in den Papierkopp Modus, können es entweder Restore oder wir löschenalles. Wir könnten vielleicht noch eine Abfrage machen. Englische Tastatur mag ich aus irgendwelchenGründen nicht. Das kann ich nicht so genau sagen warum, aber englische Tastatur magich nicht. Übrigens die hier oben machen wir doch irgendwie einen Switch oder sowasne für. Ok. F*** was wollte ich jetzt machen? Bumer Gehirn schlägt zu alter. Ne falsch hierder. Und ein Hover Info wenn man die Maus drüber hält. Ja, könnte man auch machen.Ich war an den Alert wollte ich noch machen. Weil wir programmieren jetzt keinen eigenenDialog oder? Wir können Alert machen oder Dialog auf Popup vom Browser benutzen. Alsoempty empty trash, Dialog, ne nicht Alert. Was ist denn das Gegenstück zu Alert mitne Abfrage? Alert with yes no Browser. Prompt war es, Prompt, genau Prompt nicht Dialog.Prompt, Message, delete all Fragezeichen. So if BAM zack. Ok ne das ist Javascript Logikdie funktioniert anders. Options. Alert Prompt wurden deprecated. Tja. Confirm. Ah yes.Das will ich haben. Delete all ok genau das will ich haben. So hier delete PapierkorbAnsicht. Delete all ok BAM. Confirm will ich haben. Exquisite. Ja sehr nice. Ich meintheoretisch müssten wir ja ein eigenes Overlay machen. Aber ihr wisst wie meine Poggers CSSSkills sind. Eigentlich nachdem ihr habt recht das ist deprecated. Eigentlich müssten wirein Overlay mit Z-Index machen. Also wir müssten quasi sowas hier machen. Style Z-Index 9999oder sowas. Das probieren wir jetzt mal schnell. Komm wir machen den eigenen Dialog. Lull.Glass. Wir brauchen keine Ahnung Breite Höhe. Pull. Pull. Ah ne brauchen wir nicht. Es mussabsolut sein. Nein es muss fixed sein. Oder Static. Static muss es sein. Wie macht manam besten so ein Overlay. Static. Background. BG Red einfach so das man das sieht. Ok. Undjetzt right. Right Null. Top Null. Bottom Null. Left Null. Ne. Ok how to. Ah so. NichtStatic. Absolut. Oder vielleicht sogar fixed. Fixed. Ok alles klar. So wir haben ein Overlayam Start. Es war kein schönes Overlay aber wir haben ein Overlay am Start. Opacity 50.Ja ok ok wir kommen der Sache schon mal näher. Jetzt kann man hier auch nicht mehr durchklickendas ist schon mal sehr schön. Ja und meine Key Events werden auch nicht mehr gecrapped.So wir haben ein Overlay. Wir haben ein Overlay. Ich habe das jetzt nur rot das man es erkennt.So und da drinnen bräuchten wir jetzt noch das eigentliche Dialog Fenster. Also Diff.Das ist Blurry. Oh ja Blur. Blur SM. Wie macht man das Tailwind. Tailwind Blur Background.Backdrop Blur. Backdrop Blur MD. Ja wie macht man das Blurry. Ok CSS Blur nicht BackgroundBlur. Opacity. How can I make it CSS Class Blur Effect von Overlay. Aha aha. Ja genausowas hier wollen wir haben. Backdrop Filter Blur. Also das funktioniert schon mal nett.Ich habe keine Ahnung wie ich das Blurry mache. Das muss der Massive IQ Chat wissen ich weißdas nicht. Blur Overlay. Genau. Overlay. Einfach nur Blur. Filter. Filter Blur. Unddann 10px. Hey hey da macht was. Da macht was. Ich erkenne aber nicht was. Ja Momentder Blur ist nicht unten drunter sondern mein eigentlichen Background. Das ist aber nichtso Sinn und Zweck der Sache. Ich habe legit keine Ahnung wie das funktioniert. Also mitBackdrop war schon mal nichts. Backdrop. Tja Leute. Keine Ahnung. Das ist jetzt eure Aufgabewir suchen aber CSS Set Index Blur. Ne ne ne mit Class Backdrop. Ok. Zeig her wie hatdas, wie hat das gemacht. Ich erkenne da nix geblurrtes. Ich erkenne auch nix geblurrtes.Der Blur muss auf das Stift drauf wo deine ganzen Hintergrund Elemente zum Blurren draufsind. Ah. Ich müsste quasi sowas setzen wie. Ah verstehe. Ich müsste quasi sowas setzenwie Overlay aktiv. Overlay aktiv und dann müsste ich quasi sowas wie sagen wir hierauf der. Auf der Liste müsste ich dann sowas sagen wie Blur. Da muss ich sagen Diff. Diffrum rum machen. Der Twinko Moin. So und jetzt was? Style? Filter? Jetzt kommen wir jetzthier schon. Bei so komischen CSS Dingern. Ne ne ne so funktioniert das nicht. Ne. Achso Moment ich hab hier gar nix was angezeigt für den Lul ich kann noob. Natürlich funktioniertdas guck mal. Funktioniert alles. Ich bin nur zu blöd. Funktioniert alles. Oh hier wirdgeblurrt. Komm her. Huge Blur. Alles klar verstehe verstehe. Ich hab kapiert wie esfunktioniert. Der Chat hat aber auch immer so super advanced Feature Ideen. Kann ichSvelte Window Blur machen? Geht das? Geht. Ne. Ne. Wie Blurre ich denn die komplette Seite?Ich hab sowas wie Svelte Page oder so. Body? So vielleicht. So. Ne. Svelte Blur. Ne. Ne.Svelte Blur. Body. Was? Head? Ne oder? Den Head? Ne. Svelte Blur. Body. Svelte Blur.Geht das überhaupt? Lass mal eben kurz in die Sache rein. Body? Hier auf dieses RouteDiff müsste eigentlich jetzt ein Style kommen. War der Blur vielleicht nur nicht sichtbar.Listeners. Es ist nur Listeners. Es hat nichts zu tun mit. Ah. Oh der Chat ist wieder richtigbig brain. Ok verstehe. Svelte Head. Ok ok. Svelte Head. Kann man das noch schließenirgendwie? Head. Svelte Head. Style. Body. Aha. Alter Filter. Blur. Nicht Blut. BlutBlur. 10 Pixels. Ah. Renax macht hier nichts draus ich auch nicht. So und jetzt müssenwir das ganze nur noch irgendwie dynamisch. Jetzt müssen wir das ganze nur noch dynamischhinbekommen. Wie bekommt man das jetzt dynamisch hin? Weil ich will das ja nur anzeigen wennder Dialog aktiv ist. Also ja Klasse setzen und löschen. Das könnte man tatsächlichmachen ja. Also dass wir dann sowas machen. Body. Was ist Blur oder so? Aber jetzt wirddoch auch der Dialog Blurred. Das stimmt wohl. Jetzt wird auch der Dialog Blurred. Oder?Jetzt wird auch der Dialog Blurred. Aha so einfach ist es doch nicht. Ich meine ichhätte eine richtige Noob Idee. Wir würden einfach das hier oben lassen und das da untenalles in den Diff schmeißen. Komplette Seite in den Diff. Und das machen wir wieder weg.Und sagen einfach hier mal zum testen irgendwie Style. Filter Blur. 5 Pixels. So und jetztgucken wir mal ob das Overlay ich hab da gar nichts reingeschrieben ob das Overlay überhauptdavon. Ne das Overlay passt. Nice. Ja weil hätte ich das vorher gemacht mit dem. Dasprobieren wir jetzt noch mal kurz aus. Hätte ich das vorher gemacht. Was war das Sveld.Hätte ich das nämlich vorher gemacht dann würde der wahrscheinlich auch das Body dannwürde er auch das komplette Dialogding Blurren. Der Chat hat wieder hier so anspruchsvolleIdeen. So ja genau jetzt blurrt er auch den Dialog. Alles klar ok. Ja dann müssen wirdas komplett wrappen. In ein Diff. Find ich so ein bisschen doof aber ok. Gibt es da nichteinfach ein Model? Ne ich hab nichts drinne an irgendwelchen fertigen CSS Sachen. Müssenwir alles selbst bauen. Dann wär das ja easy. Dann wär das ja easy. Ah der legt immer nochSachen an. Ok widmen wir uns der Sache gleich. So jetzt haben wir ein Overlay. Wie triggernwir das Overlay überhaupt. Wir wollten. Sekunde ich bin grad viel. Das Overlay soll passierenwenn man auf den Button zum to do. Also anstatt des confirms das eigene Overlay. Gibt esnicht Standard HTML Element für Models inzwischen. Keine Ahnung ob sowas gibt. Nö anscheinendnicht. Die machen Diff und CSS Stellz. Nö. Nö nö nö. Gibt es anscheinend nicht. Sowir wollen das öffnen. An der Stelle wo. Hier. If confirmed. Das ist aber schon einbisschen eklig da müssen wir da ne eigene Komponente oder so draus machen. Also emptytrash. Click. Mozilla Element Dialog. Ok wenn Mozilla weiß da Bescheid. Also. Das ist dochbestimmt einfach nur so Syntaktik Ding was eigentlich gar nichts macht oder. Die habendoch jede Menge Sachen eingeführt in HTML die einfach nur Syntaktisch sind und eigentlichgar nichts ändert. So was für navigations bar Artikel und sonst was die eigentlich nurfür die Optik sind und nichts machen. Aber mal gucken vielleicht ist das so. Haben diewas zum ausführen. Aha das einer irgendwelche. Ja genau der hat der hat der hat eine Komponentedafür. Ja ja auf die auf die Idee wäre ich auch gekommen jetzt schon. Und hier untenmachen sie was. Da gibt es. Da gibt es wirklich irgendwas fertiges dafür schon. Tiger Chatja habe ich geändert. Das muss ich jetzt mal ausprobieren. Das wusste ich gar nichtdass es so was gibt. Ok das Copy Paste wieder jetzt einfach rein. Allerdings ohne irgendwassoll einfach nur hier Dialog Kekwe. Guck mal das wird standardmäßig nicht nicht gezeigt.Document Get Element ich meine das ist sicherlich nicht die Welt Art. Aber wir können schlechtda jetzt irgendwas komplizierteres drum bauen. So und dann triggern die das so. Das ist bestimmtnicht bei allen wetten mobile Safari wetten mobile Safari und supporte das nicht. Kommmal da. Richtig Park. Wenn das geht nicht mobile. Mobile Safari Alter. Mobile Safarikann nix. Ok Firefox kann es auch nicht. Das ist Internet Explorer nix kann. Ok ok ok daslasse ich mir gefallen. Ok das ist nix wo man sich darauf verlassen kann dass es daist. Ja unter IOS da habe ich ja mal ein Video zugemacht das fand ich lustig. Safari dahaben die Leute gesagt Max das stimmt nicht was du sagst die haben einfach hier ich hattedazu ein Video gemacht. Chrome auf IOS existiert nicht. Ja ein bisschen klickt bei den Titelaber ok. Und da waren wirklich müsst ihr mal durchgucken sind Leute in die Kommentaredie sagen Max das stimmt nicht. Ich meine ich erzähle einfach das komplette Video sowie es ist ich zeige sogar glaube ich ich habe nicht sogar Links auf die Apple Guidelinesoder. Was ist denn das eigentlich für Anzeige da unten. Was haben wir haben wir irgendwelchekomischen YouTube Plugins oder sowas. Warum sieht die Seite so komisch aus. Warum kannich warum kann ich die Videobeschreibung nicht aufmachen. Das neue Design. Also wie gesagtich habe da glaube ich sogar Apple Entwickler Richtlinien irgendwie drinne gezeigt wo daswo das hier. Wo das drin steht Store Guidelines und sowas. Ich habe das sogar gezeigt im Videound die Leute schreiben trotzdem in den Kommentaren ne ne ne das ist nicht so. Also ich habeFirefox installiert auf meinem iPhone. Das ganze Video geht darüber dass Firefox nichtFirefox ist sondern eigentlich Safari. Aber die Leute checken es wieder nicht. Nein neinich habe Safari installiert bei mir auf dem iPhone. Die lecken richtig huge critical information.Aber aber aber extrem critical information lecken sie. Übrigens zum Thema dumme Leuteauf YouTube. Es hat mich ja wieder fertig gemacht. Wenn man sich die Kommentare hierteilweise durchliest. Egal ich will es nicht davon anfangen. Aber die Leute waren so richtigabgedreht. Pepega wieder im Kopf. Unglaublich. Also wo sind wir jetzt. Wo sind wir stehengeblieben. Wir wollten den Dialog ansteigen. Let's show. Das ist rein zu rein zu Übungszweckenhier jetzt. Ich würde das wahrscheinlich normalerweise nicht so implementieren. SoShow Dialog. Der wird nur angezeigt. Also das ist mit Vue schon. Guck mal in Vue würdeich jetzt so machen. Vue if Show Dialog fertig. Aber geht nicht. Also müssen wir jetzt nichtdieses komische if wieder machen. If. If. Show Dialog. So. Und wenn wir jetzt aufClear drücken. Empty Trash. Kommt jetzt Show Dialog gleich True. Zack und jetzt geht derDialog an. Sehr gut. Das mache als eigene Komponente aber. Hast du Lieblings UI KomponentLeibniz? Ja. Das womit ich fast alles gemacht habe. Nachdem mir das übrigens auch maljemand im Stream vor 2 Jahren oder so oder 3 Jahren empfohlen hat. Ich habe fast alleswas ich danach irgendwie halbwegs ernsthaft gemacht habe damit gemacht. Einfach weil eseasy ist und ich hauptsächlich die Sachen in Vue gemacht habe. Der Preis Champ ist beispielsweiseauch Vutify. Obwohl man das eigentlich, wenn man mal ehrlich ist, eigentlich überhauptnicht braucht für so eine Seite. Wozu brauche ich irgendein komisches Komponent Frameworkfür eine Seite die ein paar Icons hat. Ja. Aber zum Beispiel hier das Overlay. Das Overlayhabe ich mit Vue gemacht. Easy. Ja. So. Programmiere den Scheiß mal selbst. Guck mal das machtsogar den Hintergrund dunkler. Und auch das hier oben den Filter und sowas.So. Aber wir sind ja gerade am üben. Deswegen machen wir das jetzt selbst. Also hier wirdder Dialog angezeigt. Okay. Der ist im Hintergrund. So und jetzt müssen wir das noch blurren.Also Style. Brauchen wir Style. Style. Blur. Filter. Blur. Was haben wir gesagt? 5 Pixeloder so. So. Und das machen wir nur. Glass. Blur. Wenn. Wenn Dialog. Ach ne wir müssendas so machen. Wenn Dialog. Show Dialog ist. Also. Zack. Und es ist geblurrt. Massive.Huge. Blur Logic. Warum ist das Icon auf einmal da oben? Warum ist das Icon jetzt da oben?Chat. Ich sehe es genau das das Icon da oben ist. Was macht es da oben? Das darf da nichtoben sein. Warum ist das da oben jetzt? Man erkennt es kaum aber es ist da oben. Ich sehees genau. So Dialog. Da brauchen wir jetzt noch ein Button drauf. Button. Close. So undClose. On. Click. On. Click. Wollen wir jetzt einfach machen irgendwie Show. VielleichtFalls. So. Close. Hä? Was ist das? Moment. Was haben wir bei dem Icon irgendwelchen Blödsinndrin stehen? Fix. Vielleicht ist es das. Vielleicht muss ich es absolut machen. Keine Ahnung.CSS Kickweight. Kein Schimmer. Keine Ahnung was das für Schmerzen hat. Chain of Plaguenicht so ein Blödsinn. Du kennst die Antwort doch genau. Du schreibst das nur, dass duAusrufezeichen Frage machen kannst. Meinst du ich erkenne das nicht oder was? Das istder Chebat Versuch wieder. So Show und Dialog. Wir ignorieren jetzt mal, dass dieser Buttondort auf einmal an einer Stelle ist wo er eigentlich gar nicht hin sollte. Was machtdieser hässliche Button da? Gut. Und jetzt brauchen wir da drin eine Abfrage. Also dasses rot ist, das ist ja nur, dass ich sehe, dass es über die gesamte Seite drüber geht.So und jetzt machen wir Show-Dialog standardmäßig auf True, dass ich die Übersicht habe. Okay.So und jetzt brauchen wir irgendwie einen Dialog, der nicht mega hässlich aussieht.Okay? Also huge CSS-Skills jetzt wieder Leute. Also was machen wir da? Also wir machen erstmalRed. Wir machen erstmal weg. Das hier. Gut. Okay. Also. Class. Keine Ahnung. Höhe 40,Seite 40. So. Background. Background-Color. So. Rounded. So. Absolute. Und wie kriegeich das jetzt in die Mitte? Tailwind-Center-Element-Middle-Page. So. Das ist bestimmt irgendwie Translate odersowas. Nee, nee, nicht Margin und Padding. Es gibt so ein Trick mit Translate irgendwie.Was? Margin-Left-Auto-Auto. Wirklich? Das geht? Margin. Auto. Nee. Ja. Okay. Nee, dasging mir was mit Translate. Der Unterschied zu Bootstrap und Tailwind ist, Bootstrap istfertig, hat fertige Komponenten wie Buttons und sonst was. Tailwind ist eigentlich bloßso ein Helper für Inline-Styles. War das nicht Translate? Translate? Irgendwie einsvon zwei oder irgendwie sowas? Oh nee, Alter. Nee. Nee, nee, nee. Centered-Page. Centered-Content.Jawoll, zeig her. Ne, nee, nee, nee. Ne, nee, nee. CSS-Center-Absolute-Middle. Warda irgendwas mit Translate? Ah ja. Alter, das ist schon wieder megakompliziert. Top.Ach, Moment. Nee, nee, Moment, Moment. Wir können das doch so machen. Wir können dasdoch so machen. Center? Was war das andere? Align? Align-Middle? Nee. Wie kriege ich denMist jetzt in die Mitte? Item-Center ist da schon mal ganz gut. Chat-CSS-Big-Brainer-Justify-Center.Was war das? Ah. Chat wieder next level hier. Okay. Gut. Text-Cray-100? Okay. Richtig.Shadow. Drop. Pass mal auf hier. Drop. Shadow. Nee. Shadow? Deutlich, ich erkenne da keinShadow. Erkennt jeder was? Shadow. Shadow-Black. Shadow. XL. Ah. Ah. Ah. Ah. Ah. Ah. Ah.Ah. Massive-Shadow. Wie mache ich denn den Shadow jetzt ein bisschen weniger aufdringlich?Wie mache ich denn den Shadow ein bisschen weniger aufdringlich? Box-Shadow? Shadow?Das ist Box-Shadow? Okay. Drop-Shadow. Was ist der Unterschied zwischen Drop-Shadowund Box-Shadow? Leute, ich erkenne legit zwischen diesen Bildern keinen Unterschied. Ich sehezwischen diesen Bildern absolut keinen Unterschied. Ach ja, stimmt. Ich habe immer noch Dark-Readeran. Der war schon dumm. Richtig dumm. Richtig hängen geblieben bei mir wieder. So. Drop-Shadow.Drop-Shadow ist viel besser. Drop-Shadow-MB. Der erkenne ich. Hat das jetzt, hat das irgendwasim Hintergrund jetzt? Ja. Tatsächlich. Leute. Tatsächlich. Ich sehe es. Ich sehe es. So,wie macht man die, wie macht man die Color? Invert. Was? Invert? Bäh. Äh, kann man dieFarbe irgendwie ändern? Ja. Aha, jetzt erkennt man was. Richtig Massive-Shadow hier. Siehtaber auch kacke aus. Wisst ihr was? Ignorieren wir jetzt erstmal. Ähm, denn wir haben wichtigeszu tun. Wir müssen ein ordentliches, ein ordentliches Dialog, eine ordentliche Dialog-Box. Kannman sagen, voll? Oh, das ist ein bisschen sehr, bisschen sehr groß. Ähm. Aber trinkenwir mal was. Okay. Also. Jetzt haben wir eine, jetzt haben wir eine Dialog-Box. Breite. Breite50% von der Seite. Eins. Weil dann, guck mal, dann scaled nämlich unsere Dialog-Box. Sehtihr das? Huge scaling. Oh. Ah, sorry. Epilepsy-Warnung hier wieder. Jetzt scaled. Guck mal. Bleibtimmer damit. Jetzt scaled unsere Dialog-Box mit. So, Höhe ist okay, denke ich. So. Also.Da drinnen brauchen wir jetzt einmal einen Titel. Ähm, was weiß ich. Äh, Titel istDelete. Oder ne, wir machen. Wie heißt denn das unter Windows? Empty Trash? Wie heißtPapierkorb leeren? Empty Recycle Bin. Empty. Empty Trash. Was ist Clear oder Empty? ClearTrash. Wie heißt Clear Trash? Fragezeichen. Äh, äh, äh, äh, was? Ach so. Bin ja auchblöd. Muss ja da rein. So, Clear Trash. So, dann braucht das noch irgendwie Padding odersowas. Ich kann mir immer noch nicht den Unterschied merken zwischen Padding und Margin. Paddingist in, Margin ist nach außen. War das so? Padding ist nach in und Margin ist das, wases nach außen hat. So, Clear Trash? Fragezeichen. Plus gleich Text. Wobei Text haben wir schongesessen. Haben irgendwie Text Bold. Ne, das ist Font. Also Font Dick. Und, ähm, Titeloder so. Ich hab doch Tailwind Typography installiert. Das heißt ich kann jetzt sowaswie H1 verwenden, oder? Ne. Hab ich nicht? Hab ich nicht? Tailwind. Tailwind Textformatierungsgeschissinstalliert. Nein, hab ich nicht. Ok. Da muss ich selbst machen. Also Clear Trash? Fragezeichen.Wie macht man denn jetzt eine Überschrift hübsch, sodass man die sieht? Unterschiedist wichtig, wenn du mit Borders arbeitest. So advanced bin ich ja nicht. Wobei wir könnenda noch einen Border drumherum machen. Ich glaube das wird gar nicht so schlecht aussehen,wenn wir noch einen Border drumherum machen. Border? Border? Cray? Äh. Ach Quatsch. Ichbin auf dem falschen Element. Hier. Ja. So. Massive Box. Mach den pink. Das ist ne guteIdee. Weil, das soll ja ins Auge staschen. Was haben wir? Pink 600 hatten wir bei denanderen. Ja. Clear Trash. Ok. Button. Icon. Das triggert mich, dass man auf den Iconskeine on Clicks binden kann. Icon. Shadow auch pink. Ja ich bin nicht in der Lage dieShadowfarbe gescheit zu ändern. Der Shadow ist jetzt schwarz. Ok also Icon. Ne wir brauchenkein Icon. Wir machen einfach yes no oder? Wo haben wir denn unseren Button hier oben?Den kopiere ich mir jetzt einfach. Wo ist unser Big Brain Button? Da. Was? Das Leerzeichen.Ja ich weiß das ist das allerwichtigste jetzt. Ich bin ja vollkommen falsch wo ich das reincopy paste the top. Keg weight. Jawoll. Guck mal da ist unser Button. Huge. So. Button. Undso. Huge. Ganz ganz tolle Buttons. Class. Oho guckt euch mal an hier. Und jetzt könnenwir sagen. So wie kann ich die Dinger jetzt sagen? Space around oder so? Around? Ne. Betweenoder sowas? Oh ne keine Ahnung. Ich will das die Dinger links und rechts sind. Angel doesit again. Genau. Ah ich bin im falschen. Ja bin ich tatsächlich. Justify. Ja genau dashabe ich. Das habe ich gesucht. So wir könnten die Höhe eigentlich noch weg machen da istes nämlich nur so groß wie es sein muss. Clear trash. Guck mal das sieht doch jetztschon gar nicht so beschissen mehr aus. Even sieht besser aus. Ja hast recht. Guck maldas sieht gar nicht mehr so schlecht aus jetzt. Das machen wir zu einer extra component. Genau.Clear trash. Yes no. Es passiert jetzt natürlich noch nichts wenn man draufklickt. Guck malseht ihr sogar dieses Highlight von dem Button. Alter ist das poggers. Übrigens mein DropShadow. Mein Drop Shadow ist kaputt wenn man das movet. Den Drop Shadow machen wir weg.Drop Shadow. Wo ist der Drop Shadow überhaupt? Aber es sieht schon cooler aus mit Drop Shadow.Wie sieht es mit normalem Shadow aus? Shadow. Shadow SM. Naja. Naja. Ich weiß ja nicht.Oh ist gar nicht schlecht. So ist es gar nicht schlecht. Das ist gar nicht mal so übelwie es jetzt ist. Den Shadow auch pink? Guck mal mal. Ach so. Nein. Den Shadow war nichtpink. So. Aber so. Das ist gar nicht mal so schlecht. Guck mal. Das geht sogar. Das istnicht übel. Das lassen wir jetzt so. So. Aber natürlich nicht yes no. Da kommt einanderes Icon hin. Das gibt es dann besser. Accept oder so. Ne. Yes. Tja. Was haben diefür Icons für yes or no? Ok. Sign? Ah. Checkmark? Ne. Yes. Ok. Ok. Ok. Ok. Ok. Ok. Ok.Ja. Hey das ist gar nicht so schlecht. Check. Badge. Badge. Leute. Sollte. Sollte neuesEmote werden. Badge. Clipboard. Badge. Check. Check Circle. Ok. Yes. Und das andere ist.Deny? Ne. Close. Boah. Cross? Was? X-Circle? Seriously? X-Circle. Alter da werde ich einemLiebenden drauf kommen, dass es X-Circle heißt. X-Circle. Leute. Soll ich euch mal was sagen?Das sieht gar nicht so beschissen mehr aus. Das ist. Das ist. Das ist durchaus in Ordnungfinde ich jetzt. Clear Trash? Yes. No. Das ist wirklich ganz ok. Wie sieht es im Fullscreenaus? Genau so. Naja. Bisschen breiter. Hat das schon eine Animation? Nein. Ähm. DieSache ist plus die. Soll das überhaupt mitskalieren Leute? Soll das mitskalieren? Das sieht ziemlichunsinnig aus oder? Wenn das. Wenn das mitskaliert. Clear Trash noch Centern. Ja. Ok. Ok. Ok.Ähm. Vielleicht. Vielleicht Centern wir das. Vielleicht. Warum lassen wir es nicht einfachso Leute? Oder was ist denn wenn wir die Breite ganz weg machen? Ja. Was haltet ihr denn davon?Das ist doch ok. Muss das muss die Überschrift mittig sein ja? Sehe ich das sehe ich dasrichtig? Überschrift muss. Wie kriege ich wie kriege ich denn die Überschrift jetztmittig? Center. Was? Align Center. Center. Text Center. Ist das jetzt ist das jetzt besser?Ok. Dann machen wir noch Padding hier. Sowas? Chat. Jetzt kann man doch nichts mehr sagenoder? Jetzt ist es doch richtig. Ne? Ja wie? Ne. Ok P2. So. Ne so ist das gut.So. Lassen wir das jetzt. Clear Trash. Yes. No. Perfekt. Poggers. Poggers. Ok. Yes. No.Ehrlich gesagt ist mir egal was wir klicken. Wir machen einfach egal was und klick dasjetzt ja nur zum testen. Show. Ne das müssen wir. Show. Dialog. Gleich Falls. Logsby dankefür den Sub. Warum warum schließt sich das jetzt nicht? Ach so weil ich wieder die üblicheGeschichte nicht gemacht habe. Das ist aber auch echt hart und intuitiv. Gut. Excellent.Guck mal hier. Ist das nicht Pog? Alter. Huge. Guck mal hier. Wie cool das jetzt aufbloppt.So und jetzt braucht es noch eine Animation beim aufploppen. Obbei braucht das eine Animationbeim aufploppen? Wir könnten opacity irgendwie. Boah da weiß ich nicht wie das geht. Dasgeht irgendwie. Translate. Was? Yes. No. Ne. Das geht. Also man kann man kann so eineso eine Einfader Animation machen. Da bin ich mir jetzt aber ehrlich gesagt nicht ganzganz schlüssig wie. Einfach Transition. Da muss man aber bestimmt hier das Weltzeugimportieren. Fly. So. Svelte Transition. Import Fade vom Svelte Transition. Ok dannmachen wir das damit testweise. Oder Fly. Fly. So und jetzt if visible. Ja das haben wir.Und dann sagt man was? Transition. Fly. Also. Transition. Warum gibt es das hier nicht?Ne. Flyt da jetzt was? Das fadet eher oder? Fade. Fade. Fade. Fade. Fade. Fade. Fade.Hä? Das ist genau das gleiche? Das habe ich bestimmt nicht richtig verwendet. Svelte.Wir probieren es mal einfach hier drinnen aus. Fly. Fly. Svelte Transition. Fly. Hier.Aha. Ok. Fly. Transition. Fly. X 100%. Genauso. So und nicht anders.So wirklich Flyen tut das nicht oder? Auf Next. Fly. Hier. Wir kriegen das noch erklärt.So. Fly. Duration. Fly. Ok. Ah. Huge.Bisschen langsam vielleicht aber. Aber schonmal cool. Duration 200. Ja die Scrollbar könnenwir dann weg machen. Ich glaube ich weiß woran die Scrollbar liegt. Das ist eigentlich ganzcool. So Moment Scrollbar. Scrollbar off. War einfach dass die Scrollbar immer da ist.Ne. Wir machen die Scrollbar immer weg. Wer braucht Scrollbars? Alter guck mal. Scrollbarssind einfach mal extrem overrated, outdated, debated. Wer will denn hier bitteschön Scrollbarhaben? Das sieht hässlich aus wie die Nacht. Scrollbars kommen weg. Scrollbars werden einfachglobal ausgeschaltet. Genau. Userfehler. Exakt. So jetzt können wir mal was anwendenvon dem was wir vorhin gelernt haben. Svelte. Head. Die Scrollbar Darkman. Das Problem istan Scrollbar stylen ist dass es mit IOS und Safari wieder nicht richtig funktioniert.Weil da ist die Scrollbar immer weg. Sondern ist nur so ein halb durchsichtiges Ding ander Seite. Wie so alles ja. Ne. Body. Body. Achso Moment das ist doch gar kein Style Tag.Backweight. Style. So. Guck mal Leute. Jetzt gibt es auch keine Scrollbars mehr. Das istreal das ich muss sagen finde ich auch dass es relativ schick aussieht jetzt. Das siehtwirklich cool aus. Clear Trash. Yes. Die kannst du in die globale CSS machen. Du meinstda drin. Da wo aktuell nix drin steht. Also quasi. Hoffentlich funktioniert ein Tailwindnoch wenn man hier irgendwas reinschreibt. Ja. Nice. Kann man die Icons nicht irgendwiereloaden lassen. Das sieht hässlich aus beim Refresh wenn das immer die Icons erst ladenmuss. Das ist wirklich schick. Das gefällt mir jetzt. Das sieht wirklich gut aus. Undich muss sagen das ist eine super super Übungs Anwendung. Weil da kann ich einfach in Zukunftwenn ich da wieder wenn ich da wenn ich da drüber kann ich einfach hier immer nachgucken.Das Scrollbar CSS ist sonst doppelt. Meinst du. Ja stimmt das müsste sich eigentlichvererben ne. Ja. Genau. Wir haben nirgendswo Scrollbars. Scrollbars sind outdated overratedgebaited in mobile Anwendungen. Ja aber ich hab hier oben ja auch Icons. Ich find dasist echt schick. So ok. Jetzt haben wir jetzt haben wir den Dialog. Clear Trash. So undwenn ich jetzt sagen Clear Trash. Dann mach ich das da. So Empty Trash ist im Prinzipeinfach nur das da. Und Show Dialog kommt hier raus. So wenn ich sage Yes im Dialog.Es wird mir schon wieder Blur. Brauchen wir das überhaupt noch? Ach ja. Das brauchenwir noch. Jetzt wo es der Chat gerade sagt ich muss meinen Staubsauger auch flaschenwieder demnächst. Den hab ich jetzt 2 Wochen oder so nur nachdem ich Reset hatte in derEcke stehen gehabt. Ich muss aber sagen ich bin jetzt ein bisschen von Staubsauger Roboternein bisschen wieder umgestiegen seit ich jetzt Homeoffice hab und mehr daheim bin. Auf zumgrößten Teil mit dem Staubsauger Staubsaugern, weil das geht einfach so viel schneller.Wohin ein Staubsauger Roboter halt irgendwie 2 Stunden rumgurgt bis er dann die erste Etagefertig hat insgesamt. Da Fleiß ist übertrieben. Na doch doch 2 Stunden kommt schon hin. Mitdem Staubsauger bist du in einer Viertelstunde durchgeflitzt wenn du schnell bist. Ne ichhab das so gemacht, dass es normalerweise losfährt wenn ich nicht daheim bin. Das machter jetzt auch. Das funktioniert. Wenn mein Handy nicht daheim ist dann darf er. Wo sindwir jetzt stehen geblieben? Wir sind hier bei Clear Trash. Clear Trash. Yes. Okay wennYes geklickt wird, dann sagt er, wenn Yes geklickt wird macht er, ähm, remove? Ne,wie heißt das? Empty Trash. Ich nenne das Ding Clear Trash. Weil ansonsten. Gibt esRefactor? Rename? Oh ne das macht bestimmt wieder die Hälfte kaputt. Clear Trash. Undäh Dialog. False. Clear Trash. Oh was ist das? Ne ne. Oh da muss ich mir noch was überlegengleich. Clear Trash. Yes. No. Ja und bei No macht er einfach. Ich könnte auch einfachsagen Clear Trash. Sowas? Könnte man machen. Das müsste funktionieren. Oh jetzt ist esnicht Brocken. Jetzt habe ich es kaputt gemacht. Jetzt habe ich es kaputt gemacht. Ah. Ichdeploy gleich. Warum ist das Brocken? Show Dialog ist doch auf True. Ach ist es wiederdas gleiche? Dass er das jetzt ausführt ohne? Ja das ist ja bescheuert Alter. Okay und jetztmüsste ich hier sagen. Okay das ist jetzt, das ist jetzt schon ziemlich hässlich. Dasist jetzt schon ziemlich hässlich. Oh ne jetzt habe ich sie gelöscht. Okay löschen.Ne das funktioniert so nicht. Okay Funs. Oh der löscht die trotzdem? Moment der löschtdie trotzdem? Ach so. If Clear Trash. Clear. Okay wunderbar. No. Also löschen. Papierkorbsagen. Clear. No. Es bleibt noch da. Clear. Yes. Und es ist. Ach fuck. Er sollte es dochimmer closen. Alter. Nein. False. Oh er soll den Dialog immer weg machen. So. Also paarneue hinzufügen. Löschen, löschen, löschen. Papierkorb Ansicht. Clear All. No es passiertnichts. Clear All. Yes alles ist weg. Okay nice. Sehr schön. Das gefällt mir. Das findeich gut. So und jetzt machen wir noch Show Deleted Balls. Da geht er nämlich zurückwenn man alles geklärt hat. Zurück in die normale Ansicht. Das ist doch nice. Guckmal. Jetzt gehen wir hier hin. So. Sagen Papierkorb Ansicht. Da brauchen wir irgendwie noch eingescheites Icon für gleich. Papierkorb Ansicht sagen jetzt Clear All. Yes. Zack. Da löschter alles und zwitscht in der zurück in die normale Ansicht. Das finde ich gut. So mussdas sein. Pogchamp. Nice. Das mag ich. Da haben wir doch heute mal richtig coole Dingergebastelt. Wobei hier oben brauchen wir noch irgendwas für meinen. Hier oben, dass dasein Button ist glaube ich. Check. Hab ich deploy schon mal. Weil ihr seid Leute. Könnt ihreuch angucken. Zack. Da sind wir. Könnt ihr mal gehen auf ToDoCacW.Services.Oh. Ich hab standardmäßig immer noch auf True stehen. Das Ganze. Nein. Nein. Nein.Das muss ich gleich. Siehst du. Ist da erst mal direkt Production Deployed. Show DeletedBalls. Und Show Dialog Balls. So. Wird das einfach nur. Das wird eine ToDo List Anwendungzum Weltüben. Genau. Correct. ToDo List sind ja quasi die Hello Worlds des Internets. AusFunst. Guck mal hier. Nice. Zack. Zack. Zack. Papierkorb. Löschen. Papierkorb Ansicht.Restore. Und den Rest. Delete All. Yes. Und alles weg. Pogchamp. Das ist richtig gut.Das. Das gefällt mir. Und ich muss sagen. Das war richtig Big Brain vom Chat. Also wasmit dem Alken da oben in der Ecke los ist habe ich immer noch nicht. Ja die. Die. Die.Die Progress Bar. Die. Die stimmt immer noch nicht. Die Progress Bar. Da muss man so wasüberlegen. Die ist sus. Ach so. So der Nachricht Papierkorb ist leer. Ich glaube das brauchenwir nicht. Weil. Wenn du den Papierkorb leerst. Dann verschwinden dir alles und es wird dichwieder in die normale Ansicht. Ist die Progress Bar kaputt. Die Progress Bar ist kaputt weilwenn ich Sachen lösche dann dürfen die nicht im Progress auftauchen. Ok. Progress Percentist to do filter done. Und not not deleted. Ja. Ach jetzt muss ich den Kram hier auchnochmal filtern. Ok jetzt muss ich das auslagern. Das ist jetzt ein bisschen eklig. Jetzt stimmtes nicht weil die Länge nicht stimmt. Jetzt ist ja nicht mal Länge insgesamt. SondernLänge quasi Bilder die nicht nicht deleted sind. Das sieht jetzt aber hässlich aus.Ja guckt jetzt funktioniert es. Jetzt funktioniert es. Der Papierkorb wird da nicht mehr mitgerechnet.Was in der Desktop Ansicht taucht bei mir rechts eine Scrollbar auf. Beim auf den DeleteButton klicken. Das sollte eigentlich nicht so sein. Das ist wieder so eine Browser Geschichteweg. Pass auf im FireFox ist es wahrscheinlich jetzt kaputt. Wahrscheinlich ist es im FireFoxjetzt kaputt. Warum ist es im FireFox jetzt kaputt. Warum ist es im FireFox jetzt kaputt.Braucht man noch extra was für Mozilla. Ne das ist ergeblich FireFox. Ergeblich solltedas im FireFox. Hast du FireFox. Gibt es noch etwas wie Mods. Scroll. Ja eigentlichsollte das für alle gesetzt sein. Jetzt ist es aber anscheinend nicht. Es gibt kein extrafür Mozilla. So aber der Rest ist schon mal in Ordnung. Hier oben für das umschaltenmüssen wir uns jetzt noch was ordentliches überlegen. Geht die Suche eigentlich. Jadie geht. Das haben wir richtig gemacht. Checken wir mal wirklich ob die Suche geht. 1,2,3umschalten. Ja die Suche funzt immer. Eigentlich bräuchten wir jetzt so ein Toggle Ding. Wieheisst denn das. Switch. So was bräuchten wir. Genau. So was bräuchten wir eigentlich.Label Class Input Type. Was. Ach so was gibt es nicht fertig im Browser oder was. So waswill ich nicht selber machen. Das habe ich schon gefixt mit dem wenn du no drückst.Da müsste ich nur nochmal neu pushen. Wenn du no drückst bleibt die jetzt drinnen imPapierkorb. So. Also jetzt müssen wir diesen Button da oben weg machen. Also hier machenwir ich glaube das machen wir das nächste Mal. Dass wir hier ne ordentliche Komponentedraus machen. Wir machen diesen hässlichen Button weg. Ich finde den Button schon garnicht mehr. Wo ist der Button. Wo ist der Button mit Klick drauf. Klick. Button. Istdas der Button. Ja. So. Jetzt bräuchten wir irgendwie nen ordentlichen Switch. Ich weißnicht so genau wo wir den hin machen. Wo machen wir den Switch hin. Für Papierkorb an undaus. Wir können ja nicht noch nen Ding hier neben machen oder. Wobei es eigentlich thematischist. Leute doch wir machen das da hin und machen die Suchleiste oben drüber. Das könnenwir nix hin machen. Neben default kommen ja noch die ganzen anderen Notizbücher dieich es geben kann. Wir machen das jetzt einfach hier hin. Erstmal search. WB chain lore wirmachen das erstmal hier hin. Die Sache ist nur die. Ich bin wirklich nicht. Ich sehemich jetzt auf kurzfristig nicht in der Lage einen schönen CSS Toggle Switch zu bauen.Oha. Guckt euch das an. Koggas Toggle Switch. Dabei ist das gar nicht so kompliziert wiees aussieht. Ich will kein fertiges UI Kit verwenden. Simple switch CSS. Simple CSS ToggleSwitch. Simple. Simple. Nee das ist finde ich nicht simple. Switch. Switch input. Switch.Switch diff. Alter. Übertreibs halt mal. Gibt es da nicht irgendwas mit drei Zeilen.Simple. Alter das sind alles fünf Seiten lang. Hellwind Components. Excellent. Toggleme. Ja Gachibas Toggle mich. So wie kann man das jetzt einbinden? Kann man dann irgendwiesagen Component Toggle Switch oder so? Moment. Achso ich dachte ich kann das. Ich dachteich kann das hier irgendwie. Ich dachte ich kann das hier irgendwie einbinden als Plugin.Und dann ist gut. Download. Nee das ist anscheinend wirklich Copy Paste. Copy Paste. Ey meindas ist schon relativ simple. Das nehmen wir jetzt einfach mal. Ich Copy Paste, nehmedas jetzt raus. Wir machen jetzt mal kurz. Wir machen mal schnell eine neue Componentdafür. Switch. Welt. Zack. Jaja MonkaS. So. Script. Script. Weiß gar nicht ob wirdas überhaupt brauchen. So Class Inline. Gut und jetzt binden wir das ein. Switch.Okay das Ding hat irgendeinen Sonntagsfehler drin. Apply. Oh ist das das? Ist Apply istdas das? Oder was ist das? Oder warum funktioniert das nicht? Nee oder was ist das? Ich weißüberhaupt nicht was ich damit anfangen soll. Ist Post CSS? Ja wunderbar. Pog oder notPog? Nee MonkaW machen wir nicht. Wir haben so viele MonkaEmo's schon. Machen wir einfachweg. So Switch. So und jetzt binden wir den mal ein. Gucken ob der irgendwie was taugt.Ja. Gut ich hab ja auch die Sachen gelöscht. Switch. Was macht Apply? Okay ich hab keineAhnung was das macht. Da bin ich zur Pepega für. Kein Schimmer. Toggle me. Ah gut. Ichmeine es ist kein schöner Switch. Warum funktioniert das nicht? Da muss ja was geben. Simple. AlsoToggle Checkshop bekommt alle Styles von allen Klassen die im Apply drin sind. Ja schönund gut aber Apply. Ich weiß nicht warum das bei mir nicht funktioniert. Weil Post CSSnicht funktioniert oder was? Muss ich das nicht in Style machen? Wo hab ich denn? Components?Wie verwendet man das? Style? Nö. Muss das hier vielleicht irgendwie in meine? Nee oder?Unown Rule. Unown Rule. Ja das ist irgendwie eine Magic die wahrscheinlich total simpelist wenn man weiß was man macht. Aha. Aha. Lange Post CSS. Lange Post CSS. Lange PostCSS. Aha. Es hört sich vielleicht so an aber ich hab keine Ahnung was abgeht. Ähm.Okay Lack of Critical Information. Keine Ahnung. Das ist irgendwie irgendwelche Magic im Hintergrunddie nicht läuft weil keine Ahnung. Was haben wir nochmal? Sveiled? Add? Da haben wir dochirgendwie so ein komisches. Add. Ja. So das haben wir verwendet. So Apply. Erzähl mirwie es funktioniert. Issues. Hier. Da stand noch was. Apply. Apply. You can use StyleCSS Blocks. Aha. Aber ja ich muss Post CSS installieren aber sollte der mir nicht eigentlichsein. Ich habe kein Post CSS installiert. Also machen wir das dann mal. Wobei NPM ListPosts. Posts. Ist nicht installiert. Style Lange Post CSS. Haben wir doch gemacht.Na. Wird da irgendwas? Ich meine.Was macht dieses Ding? Deswegen mag ich das nicht wenn zu viel Magic im Hintergrund istweil ich dann keine Ahnung hab was eigentlich passiert. Stuff. Bester Name. Stuff JS. Obvious.Ich installiere jetzt einfach Post CSS.Moment. Guck mal. Hier sind Applies. Haben wir überhaupt keinen Doppelpunkt mehr dahinter.Aber es funktioniert auch nicht. Macht überhaupt keinen Unter. Ah. Ok. Das macht schon was.Funktioniert nicht. Alter ist das freudig. Das machen wir heute nicht mehr Leute. Dasmachen wir heute nicht mehr. Das machen wir heute mal. Das reicht mir für heute wieder.Also was haben wir geschafft? Wir haben den Delete All Button. Wir haben einen Papierkorbso halb. So Minus. Such haben wir auch geschafft. Wo ist der Delete All? Der Delete All Knopfist ja den kannst du grad nicht sehen weil ich den durch diesen Toggle Button ersetzenwollte. Du musst in die Papierkorb Ansicht wechseln aber das funktioniert gerade nichtweil Toggle. Ich mein ich kanns ja mal kurz wieder einbinden. Was passiert eigentlichwenn ich den ganzen Shit hier weg mache? Ok dann Toggles gar nichts mehr alles klar.Ist das ReactOS? Ja. Eindeutig ist das ReactOS. Ok also hier wird getoggelt. Toggle me. Kommtweg. Braucht kein Text. Das Label. Brauchen wir das Label überhaupt? Nö null. Kein Label.Oder wahrscheinlich ist es sonst broken. So. Und jetzt müssen wir irgendein Event schmeißenwenn das hier getoggelt wird. Also Let. Nee war das der Export. Let. Active oder sowas.Active. Und wo bekommt man überhaupt jetzt mit wenn das getoggelt wird. Input. Checkbox.Hier bekommt man das mit. Find. Checked. Active. Ja ja ich weiß ich muss es klammern.So das sollte jetzt eigentlich funsten. Gucken wir mal. Active. Ok. False. Ok. Es sieht haltmega beschissen aus. Aber immerhin. Das machen wir das nächste Mal machen wir das ordentlich.So. Let. Active. Gut. So. Kann man das jetzt binden irgendwie hier von von oben drüber.Switch. Active. Also ich quasi sage hier. Bind. Show. Deleted. Nee. Bind. Active. ShowDeleted. 30 Monate. Richtig poggers. Hey Funds guck mal. Die Papierkorb umschalte Anzeigeist da. Nur das der Switch halt richtig extremst hängen geblieben aussieht. Aber ich pushes jetzt trotzdem. Ja Massive. Richtig richtig. Hyper Subscription am Start. Wieso ist dasScrollbar Label User Selectable. Es ist eine gute Frage. Weil das Crap ist was die Typengebaut haben da wahrscheinlich. Einmal das Scrollbar. Welches Scrollbar Label. NPM installkann ich das einfach wieder aninstall machen. Es geht immer noch. Ok funktioniert immernoch alles. Alles gut. Die 33 Prozent waren gerade mal hier. Stimmt warum ist das Selectable.Ja das ist dumm. Das können wir das können wir weg machen. Procress. Procress. Weil daseinfach hier ist. Select. User Select ist glaube ich User. Select. User Select. Select.Select none ist es. Ok jetzt kannst du nix mehr selecten. Das bleibt jetzt da oben.Das sieht zwar beschissen aus. Aber. Also es würde gar nicht so beschissen aussehen.Wenn. Das kein Haken macht. So wenn ich das hier wenn ich das hier weg mache dann funses schon mal nicht. Wobei doch funs immer noch. Und warum. Was genau war jetzt der Sinndavon von diesem Apply. Ich sehe da überhaupt keinen Unterschied dazwischen. Ich muss dochich muss doch eigentlich nur dafür sorgen dass da kein Checkmark reinkommt. Das Togglekannst du noch nicht verstehen. Das ist einfach random drin. Was das Toggle machen soll istAnsicht zwischen Papierkorb und normal. Wenn du irgendwie andere in Big Brain Ideen hastaußer den Switch. Der sagt mir irgendwas. Das Switch zwischen Papierkorb Ansicht undnormal. Du musst nur die Background Color setzen beim checkt oder. Passt. Es passteigentlich alles. Ich will. Ich will das wegbekommen dass der überhaupt. Da noch ein Checkmarkund so komische Kringel drum herum hat soll soll alles weg. Papierkorb Eichen. Wir könnenda neben Papierkorb Eichen machen. Ich will jetzt aber erst mal gucken wie man das mitder Toggle hinkriegt. Was ist denn das hier wieder. Wie kann ich dasstylen dass das Checkmark Ding wegkommt. CSS. Height. Check. Sign. Checkmark. Na. Dasist eine bescheuerte Antwort. Was. Was. Was ist denn. Alter. Ist der Golfer Flau. Wasist denn mit euch los. Alter ist das wieder kompliziert.Macht doch ein Toggle wie in den Battlefield Settings. Es sieht von der Farbe fast schonein bisschen nach Battlefield Settings aus. Das ist außen drum herum. Aha. Das hier istdas Ding schon mal. Outline Null. Der Unterschied. Border. Border. Null. Oh ne. Ach ne das iston hover wieder hier ne. On Focus. Das ist wieder. Focus. Boah ist das Känzer des stylendas Zeug. Alter. Meine Güte. Das bleibt jetzt so. Das bleibt jetzt so. Da habe ich jetztkeine Musel für das mir zu überlegen. Das lasse ich jetzt so. Und das nächste Mal machenwir das dann schon noch. Und lagern den Kram auch in Komponenten aus und sowas. Das istgerade. Das reicht mir. So. Git. Status. Add. Push. Force. Immer schön Force pushen.Habe ich irgendwas vergessen. Ah ne ich habe vergessen. Komm. Komm jetzt. Ja ich habeLocal Storage gefixt. Ich weiß nicht warum. KQ. Giga. Chat. Push. Alles klar. So. Wersich das angucken will. Source Code technisch. Ist. Falsches Repo. Ist hier am Start. Isthier am Start auf GitHub. Und. Auf. To do. Punkt. Kek. W. Punkt. Services. Oh ich mussnoch deployen. Playbook. Bäm. So. Jetzt habt ihr uns ein komisches Toggl. Alter. Siehtrichtig angeblieben aus. Oh Leute. Es gibt ein Problem. Wir haben das nicht richtig angepasstmit der Prozent Anzeige. Es gäbe da so ein kleines Problem.So. Jetzt also. Anzeige. Papierkorb. Löschen. Aber das finde ich cool. Das hat es mir echtecht. Alter der Firefox mit seinem komischen. Dumm. Scrollbar. Das hat es mir echt angetan.Clear Trash. No. Clear Trash. Yes. Das finde ich ist cool. Auch wie das ein faded und so.Richtig Pogchamp. Das gefällt mir. Leider. Leider ist das mit der. Mit der Firefox Scrollbarso ein bisschen so ein Ding. Der Toggl wird nicht geblurrt. Oh. Na gut. Man kann nichtalles haben. Ich weiß warum der nicht geblurrt wird. Ist eigentlich ganz einfach warum derToggl nicht geblurrt wird. Das ist weil ich den nicht im Diff drinne hab. Guck hier. Undjetzt wird es ja auch geblurrt. Weil ihr seid chat. Oh. Status. Bam. Überschreiben wirden Kram mal wieder. Shit. Repo. So jetzt wird auch. Jetzt wird auch geblurrt. Ups.Jetzt wird auch ordentlich geblurrt hier oben. Was passiert eigentlich mit AusrufezeichenHetzner mit dem zweiten. Das ist eine gute Frage. Ich hab mir für nächstes Jahr mitdem noch nichts überlegt. Aber sag mal so von meiner Seite aus würde ich das weitermachen.Und ich guck mal ob die irgendwelche Mails geschrieben haben. Und ich glaube auch dassdas zahlentechnisch bei denen nicht schlecht war. Also auch so exposure technisch. Man kannes ja nicht immer nur anhand von irgendwelchen Anmeldungen messen. Also ich denke mal dasgeht nächstes Jahr weiter. Wird sich zeigen. Müssen wir mal gucken. Nach wie vielen Tagenverfällt das. Oh das ist eine gute Idee für Big Brain Feature. Papierkorb. Wie machtman das auch mal? Papierkorb verfällt nach 14 Tagen. 7 Tagen. Was auch immer. Dein HetznerGuthaben. Wenn du das eingelöst hast sollte das da bleiben. Also ihr könnt euch noch weres jetzt noch nicht gesehen hat. Ausrufezeichen Hetzner in Chat. Ihr könnt euch einen 20Euro Cloud Guthaben sichern. Bei Hetzner Cloud. Mit meinem Anmeldecode. Das müsst ihr abereinlösen bis 31 in 12. Und ich glaube alles was eingelöst ist bis dahin bleibt erhalten.Kleine Comets. Overrated. Outdated. Shebaited. Ja und ich mein. Guck mal. Mit 20 Euro könntihr ja schon eine Triple Core Kiste fast 3 Monate laufen lassen. Das ist nicht übel.Aber insgesamt muss man sagen haben wir heute trotzdem ganz gut Progress gemacht. Auch wenndas jetzt gerade ein bisschen hässlich aussieht hier. Aber es ist nicht verkehrt. Und ichmuss sagen gerade dieses Papierkorb leeren hat es mir wirklich angetan. Das finde ichsehr sehr. Wieso benutzt du das Profilbild von Max FPS ja krass krass abgerippt hier.Du brauchst nicht Deutsch zu wissen. CAC ist glaubbar. CAC W. Aber in Deutsch ist es CACW. Because W equals W. Ja mir gefällt das wirklich das hat was. Das hat was. Wobeiich mir immer noch ziemlich sicher bin dass ich hier einen Bug gefunden habe. Dass mandiese Geschichte hier braucht. Dass man das braucht. Ich glaube das ist ein Bug. Das ergibtsonst keinen Sinn. One Englischer Stream ja. Nie. Wisst ihr was ich gerade gefunden habehier auf Basteltisch. Was ist das? Das ist der ihr wisst es genau. Chat. Was ist das?Smoke fast. Da haben wir es auch. Ist der abisoliert Champ. So richtig. Das ist nichtillegal. Kannst einen neuen Account machen. Aber ich soll das nicht so explizit bewerbenhaben sie immer gesagt. Das geht aber es geht. Letztendlich ist es für mich ja nicht verkehrt.Umso mehr Leute sich neu anmelden umso besser sieht meine Statistik aus. W. Stonks genau.Ach ja. Ja Leute. Ich weiß. Gute Idee. Ich wollte eigentlich noch ein Video machen. Wasich alles auf mein. Wie sage ich das anders sagen. Ich wollte eigentlich ein Video aufnehmennoch. Weil wir letztes Video gesehen haben. So was wollte ich auch machen. Nur dass ichdas wahrscheinlich nicht alles in einem Video machen werde. Weil zu viel ist. Ich machemir extra für euch ein Dashboard habe ich mir überlegt. Weil das kommt in YouTube Videosimmer gut an wenn man Dashboards hat. Dashboards wirken einfach besser als wenn ich Kommandozeileaufmache. Den Krieger Rainn. Dass ihr wieder etwas auf den Kopf fällt. Wild. Was machter denn gerade. Red Dead Redemption 2. Das juckt mich ja so gar nicht. Weil das nächsteBattlefield 3. Keine Ahnung. Echt. Kein Plan. Spielst du noch Battlefield 4. Nee Battlefield3 habe ich nicht inszeniert. C++ Stream. Welchen C++ Stream soll ich hosten. Sag es mir. Guckenwir mal. Twitch. Software. Endgame Development. Welchen C++ Hacker Mann oder Hacker Frau hostenwir denn. Guck mal. Ich bin. Ach auf Deutsch. Okay. Trotzdem. Ich bin auf Platz 1. In dieseKategorie streamt einfach keiner. Empfohlene Kanäle Wubblos. Wie jetzt. Was. Ist das nichtnach Zuschauern gedingst. Doch. Einfach gerade sagen. Es sah aus als hat er nichts an. Aberdas ist das T-Shirt. Nee keine Ahnung Leute. Aber ich kann mich überhaupt nicht mehr konzentrierenich haue jetzt einfach ab. Was. Was macht er. Sagt mir nichts. Ich ich haue es am liebstenLeute den ich selbst haue. Aber es ist niemand. Und. Also dies bräuchten. Richtig pencegempe ich. Warte noch mal. Leute ich gehe jetzt auf. Wir sehen uns. Bis dann. Macht'sgut zu.", "segments": [{"id": 1, "start": 120.0, "end": 139.6, "text": "Das fängt ja schon gut an, geht schon gut los hier, Monarch S."}, {"id": 2, "start": 139.6, "end": 159.76, "text": "Was geht so und geht es geht es so euch ja immer immer geht es so mir"}, {"id": 3, "start": 159.76, "end": 169.96, "text": "ja wir machen heute weiter wo wir gestern aufgehört haben nur mit dem unterschied dass ich schon was"}, {"id": 4, "start": 169.96, "end": 175.36, "text": "gefixt habe guckt mal her geht mal auf tut euch da kann es euch auch lokal sein geht mal hier"}, {"id": 5, "start": 175.36, "end": 185.16, "text": "guckt mal da es speichert sich jetzt die änderung es speichert sich jetzt die änderung nach dem"}, {"id": 6, "start": 185.16, "end": 194.36, "text": "seiten reload und guckt mal hier ich habe eine neue search field gebaut eben gerade noch nicht"}, {"id": 7, "start": 194.36, "end": 198.56, "text": "mehr mit diesem hässlichen button da unten da kann man jetzt reinklicken und dann irgendwie"}, {"id": 8, "start": 198.56, "end": 207.56, "text": "nach was suchen zum beispiel guckt ist deutlich besser als dieses hässliche ding was ich gestern"}, {"id": 9, "start": 207.56, "end": 216.56, "text": "noch hatte wieso nicht über der progress bar weiß ich finde das so viel viel nicer wir können"}, {"id": 10, "start": 216.56, "end": 222.8, "text": "es auch über die progress bar machen ja und ich habe gesehen guck mal wir hatten den ersten pull"}, {"id": 11, "start": 222.8, "end": 230.68, "text": "request gestern what the fuck buttons kleiner machen nach breakpoint habe ich habe ich gemercht"}, {"id": 12, "start": 230.68, "end": 235.76, "text": "und danach habe ich es mit einem force pull über mit einem force push überschrieben weil ich zu"}, {"id": 13, "start": 235.76, "end": 247.52, "text": "faul war das anzupassen lokal das ist jetzt nicht mehr in der history drin und ich bin ja der der"}, {"id": 14, "start": 247.52, "end": 252.84, "text": "immer sagt man macht keine force pushs in public repos oder in public branches public repos nicht"}, {"id": 15, "start": 252.84, "end": 257.28, "text": "das problem er macht keine force pushes in public branches aber da habe ich mir gedacht"}, {"id": 16, "start": 257.28, "end": 270.96, "text": "aber einfach trotzdem und ihr glaubt gar nicht das hätte ich echt nicht gedacht mir macht"}, {"id": 17, "start": 270.96, "end": 277.04, "text": "dieser frontend kram wirklich spaß gerade auch wenn es extremer pains champ ist teilweise vor"}, {"id": 18, "start": 277.04, "end": 288.08, "text": "allem das css geproot force so tests und kommentarier beides absolut overrated"}, {"id": 19, "start": 288.08, "end": 308.32, "text": "overrated gbated outdated keine ahnung übrigens ich habe letztens muss ich euch jetzt mal hier im"}, {"id": 20, "start": 308.32, "end": 314.36, "text": "stream zeigen wir gucken uns das nicht an also die ganzen weeps unter uns hier gendet mal"}, {"id": 21, "start": 314.36, "end": 319.04, "text": "euer hope nicht so high ja aber ich muss euch das einfach mal zeigen wisst ihr was ich letztens"}, {"id": 22, "start": 319.04, "end": 326.8, "text": "gefunden habe das wurde mir vorgeschlagen von youtube internet explorer chan season 1"}, {"id": 23, "start": 336.0, "end": 343.16, "text": "es gibt allen ernstes irgendein das ist ja im prinzip animierte comic strips mit"}, {"id": 24, "start": 343.16, "end": 350.56, "text": "dem internet explorer was auch immer"}, {"id": 25, "start": 357.56, "end": 363.28, "text": "edge kommt auch drin vor internet explorer evolve dann in einem fight mit chrome zu edge"}, {"id": 26, "start": 363.28, "end": 373.56, "text": "das ist so richtig over the top shit totaler blödsinn ich frag mich einfach ob es das gibt"}, {"id": 27, "start": 373.56, "end": 381.52, "text": "gut warum soll es das nicht geben ist ja eigentlich keine schlechte idee es war aber übrigens die"}, {"id": 28, "start": 381.52, "end": 392.56, "text": "tage die tage des preis champs sind gezählt leute übermorgen hat sich ausgechampft das werde ich"}, {"id": 29, "start": 392.56, "end": 414.76, "text": "am ersten abschalten rib preis champ vorbei kommt weg übrigens java script ist logisch"}, {"id": 30, "start": 414.76, "end": 425.8, "text": "oder type of not a number is number zu lull oh nee verbotene emotes hier wieder"}, {"id": 31, "start": 433.8, "end": 440.64, "text": "ich habe hier ich habe hier auch noch bless rng als emotes drinne das ist auch nicht mehr erlaubt"}, {"id": 32, "start": 440.64, "end": 444.96, "text": "bless rng ist auch weg"}, {"id": 33, "start": 444.96, "end": 473.92, "text": "sehr gut wir machen mal weiter da aber nicht so viel wie gestern"}, {"id": 34, "start": 473.92, "end": 477.36, "text": "habe das ich habe ich merke das immer noch im haus"}, {"id": 35, "start": 477.36, "end": 484.88, "text": "ihr könnt euch doch dran erinnern ich hatte nicht bis vor ein paar tagen eigentlich noch"}, {"id": 36, "start": 484.88, "end": 491.96, "text": "als wehe vielleicht keine so clevere idee kurz hier ein bisschen hohli zu machen nicht dass"}, {"id": 37, "start": 491.96, "end": 497.16, "text": "ich hier nackig sitzen würde oder so aber bis zum haus mal zu machen ich muss jetzt nicht wieder"}, {"id": 38, "start": 497.16, "end": 504.76, "text": "übertreiben also das habe ich jetzt noch gefixt wir hatten ja gestern das problem dass der ich"}, {"id": 39, "start": 504.76, "end": 509.28, "text": "und ich glaube wirklich ich habe einen back gefunden wir hatten auch das problem dass der"}, {"id": 40, "start": 509.28, "end": 515.0, "text": "den status nicht gespeichert hat so und ich zeige euch mal was wir geben wir geben uns jetzt mal"}, {"id": 41, "start": 515.0, "end": 522.44, "text": "hier den status von diesem globalen to dus objekt aus so und ihr werdet sehen ach nee"}, {"id": 42, "start": 522.44, "end": 530.4, "text": "jason stringify wer ist denn dieser jason eigentlich so und wenn man jetzt hier was"}, {"id": 43, "start": 530.4, "end": 538.32, "text": "aktualisiert werdet ihr sehen guckt der setzt hier dann immer auf true und falls so aber was"}, {"id": 44, "start": 538.32, "end": 543.12, "text": "der nicht gemacht hat ist also er bekommt offensichtlich die updates mit was der aber"}, {"id": 45, "start": 543.12, "end": 552.52, "text": "nicht gemacht hat ist die custom hooks im store laufen lassen was die sachen in local storage"}, {"id": 46, "start": 552.52, "end": 560.76, "text": "speicher das ging nicht und ich bin mir relativ sicher dass das ein back ist weil das to dus"}, {"id": 47, "start": 560.76, "end": 565.32, "text": "objekt wird hier aktualisiert aber die custom hooks laufen nicht so und warum bin ich mir"}, {"id": 48, "start": 565.32, "end": 569.48, "text": "relativ sicher dass das ein back ist naja ich zeige euch mal wie ich das ganze gefixt habe"}, {"id": 49, "start": 569.48, "end": 576.84, "text": "dass es jetzt doch funktioniert ich habe einfach gesagt wenn sich to dus ändert dann setze"}, {"id": 50, "start": 576.84, "end": 586.04, "text": "to dus neu was absolut keinen sinn ergibt aber funktioniert also wenn sich to dus aktualisiert"}, {"id": 51, "start": 586.04, "end": 590.76, "text": "hat dann aktualisiere to dus mit sich selbst das ergibt überhaupt keinen sinn dass es"}, {"id": 52, "start": 590.76, "end": 597.48, "text": "notwendig ist aber dann funktioniert so die custom hooks laufen und ich glaube deswegen"}, {"id": 53, "start": 597.48, "end": 603.64, "text": "dass das ein wirklich ein richtig echter back ist den wir gefunden haben im wie heißt"}, {"id": 54, "start": 603.64, "end": 611.44, "text": "das so reactive tracking binding was auch immer guckt ich kann es euch zeigen wenn ich"}, {"id": 55, "start": 611.44, "end": 618.68, "text": "das hier aus kommentiere so ich kommentiere das aus es funktioniert alles aber wenn ich"}, {"id": 56, "start": 618.68, "end": 624.92, "text": "reloade ist der zustand nicht gespeichert weil diese save hooks hier nicht laufen so"}, {"id": 57, "start": 624.92, "end": 631.92, "text": "und aktualisiere ich nach dem aktualisieren mit mir selbst was allein schon von der aussage"}, {"id": 58, "start": 631.92, "end": 642.0, "text": "absolut bescheuert ist dann funktioniert es guckt und deswegen denke ich das muss ein"}, {"id": 59, "start": 642.0, "end": 647.36, "text": "back sein weil wo ist denn der sinn dass ich die aktualisierung ja offensichtlich mit bekomme"}, {"id": 60, "start": 647.36, "end": 651.52, "text": "sie aber zurückschreiben muss in den store weil er ja sich aktualisieren muss das ergibt"}, {"id": 61, "start": 651.52, "end": 656.48, "text": "überhaupt keinen sinn so und ich glaube das ist echt ein back und guckt mal wie ordentlich"}, {"id": 62, "start": 656.48, "end": 660.76, "text": "ich jetzt hier dieses sorting machen konnte hier guckt mal so wir haben jetzt unsere to"}, {"id": 63, "start": 660.76, "end": 667.4, "text": "dus die to dus sind aber nicht sortiert aber wir wollen die to dus ja sortieren nach dann"}, {"id": 64, "start": 667.4, "end": 674.2, "text": "alle die abgehakt sind soll nach unten und nach erstelldatum das neueste soll nach oben"}, {"id": 65, "start": 674.2, "end": 677.48, "text": "ne das älteste soll nach oben und das neueste soll nach oben ich weiß nicht warum wir das"}, {"id": 66, "start": 677.48, "end": 683.08, "text": "sortiert haben und da habe ich eine massive big brain seite gefunden das habe ich mir"}, {"id": 67, "start": 683.08, "end": 694.08, "text": "einfach copy paste copy pasted kann man sich die geschweiften klammern sparen guck mal"}, {"id": 68, "start": 694.08, "end": 699.88, "text": "da ist es noch kürzer so und da habe ich was gefunden im internet ich habe keine ahnung"}, {"id": 69, "start": 699.88, "end": 708.28, "text": "was es macht aber man kann sort by property sortieren also ich kann jetzt also meine to"}, {"id": 70, "start": 708.28, "end": 718.72, "text": "dus haben ja pelder id created mit einem datum drin den text ob es gelöscht ist und ob es"}, {"id": 71, "start": 718.72, "end": 732.4, "text": "abgeschlossen ist und das kann man wohl hiermit irgendwie filtern lassen exzellent keine ahnung"}, {"id": 72, "start": 732.4, "end": 736.72, "text": "aber das ist jetzt richtig richtig gut zu lesen also wenn presa rief da ist das ist ja jeder"}, {"id": 73, "start": 736.72, "end": 742.76, "text": "selbst ernannte spell master hacker man erklär mir mal please warum man das hier braucht"}, {"id": 74, "start": 742.76, "end": 753.48, "text": "dass es funktioniert mach jetzt mal klammern drum warum braucht man das damit meine custom"}, {"id": 75, "start": 753.48, "end": 766.6, "text": "hooks auf den store laufen obwohl er ansonsten ja mitbekommt dass er updated wird keine ahnung"}, {"id": 76, "start": 766.6, "end": 777.72, "text": "ich glaube wirklich dass es ein bug ist ich glaube wirklich dass es ein bug ist weil"}, {"id": 77, "start": 777.72, "end": 789.4, "text": "weil wie gesagt der bekommt es ja mit wie gesagt er bekommt es ja mit man sieht"}, {"id": 78, "start": 789.4, "end": 795.4, "text": "er jetzt aktualisiert sich aber der lässt die hooks im store nicht laufen der store"}, {"id": 79, "start": 795.4, "end": 799.6, "text": "selber bekommt es mit ja guck sonst würde das hier nicht funktionieren der store selber"}, {"id": 80, "start": 799.6, "end": 804.08, "text": "bekommt es mit du siehst ja dass ich das aktualisiert das ist ja quasi direkt der"}, {"id": 81, "start": 804.08, "end": 811.88, "text": "store selber der store selber bekommt es mit aber wenn ich moment ich mache das mal raus"}, {"id": 82, "start": 811.88, "end": 819.12, "text": "ich habe es ja noch drin aber du siehst also guck der store bekommt es mit der store bekommt"}, {"id": 83, "start": 819.12, "end": 825.72, "text": "nene die methoden werden das normalerweise geht aus normalerweise geht das gwent wenn"}, {"id": 84, "start": 825.72, "end": 834.18, "text": "ich anstatt sortata schuld zahldig direkt tutti verwendet dann geht's dann geht's so"}, {"id": 85, "start": 834.18, "end": 840.08, "text": "fort?티this tracking dieses tracking war dass ich was ändert geht irgendwie unterwegs"}, {"id": 86, "start": 840.08, "end": 844.14, "text": "Dadurch, dass das über so eine durch so eine reactive variabel durchgeht und"}, {"id": 87, "start": 847.24, "end": 854.6, "text": "Was muss ich aber nie sehen und nachdem es aber im store obwohl ich gesortet to do's verwende nachdem es sich ja im store"}, {"id": 88, "start": 855.2, "end": 858.56, "text": "aktualisiert aber die store hooks nicht laufen"}, {"id": 89, "start": 859.16, "end": 865.36, "text": "Gehe ich davon aus dass es ein bug ist deswegen brauche ich so merkwürdige dinge wie wenn sich to do's"}, {"id": 90, "start": 865.36, "end": 871.6, "text": "Aktualisiert hat dann überschreibe noch mal es mit sich selbst dass die hooks laufen also ich gehe davon aus dass es sind bug"}, {"id": 91, "start": 871.88, "end": 875.16, "text": "alles andere wäre irgendwie nicht nach vollziehbare magic"}, {"id": 92, "start": 876.76, "end": 882.4, "text": "Ich habe auch versucht mal auf github danach zu suchen aber ich weiß nicht so genau was ich suchen soll zumindest habe ich nichts gefunden"}, {"id": 93, "start": 884.96, "end": 886.16, "text": "So"}, {"id": 94, "start": 886.16, "end": 888.16, "text": "Da sind wir jetzt stehen geblieben"}, {"id": 95, "start": 888.68, "end": 894.32, "text": "Ich glaube nicht dass das layer 8 problem ist und wenn ja vielleicht ist es ein layer 8 problem"}, {"id": 96, "start": 894.32, "end": 899.12, "text": "Aber dann hat ein pallet ja unten drunter irgendwie einer was nicht so ganz logisch gemacht"}, {"id": 97, "start": 905.2, "end": 910.64, "text": "So also wo machen wir denn heute weiter ich würde sagen ich mache mal kurz hier meinen ganzen krempel zu"}, {"id": 98, "start": 911.4, "end": 913.4, "text": "Sonst wird es ein bisschen unübersichtlich"}, {"id": 99, "start": 914.48, "end": 916.48, "text": "So read me wo sind wir stehen geblieben"}, {"id": 100, "start": 917.32, "end": 921.2, "text": "Also suche suche haben wir guck suche funktioniert"}, {"id": 101, "start": 921.2, "end": 928.48, "text": "Was nicht funktioniert irgendwie spezial so was der fack ich werde spezial suchen so eins oder zwei oder so das machen wir auch nicht wir machen"}, {"id": 102, "start": 928.48, "end": 932.24, "text": "Einfach eins zu eins case insensitiv volltext suche"}, {"id": 103, "start": 932.84, "end": 935.08, "text": "guckt hier das ist unsere suche die wir machen"}, {"id": 104, "start": 935.76, "end": 937.76, "text": "text zu"}, {"id": 105, "start": 938.04, "end": 941.04, "text": "lauer case lokel wen interessiert lokel keck weh"}, {"id": 106, "start": 941.64, "end": 943.64, "text": "zu lauer case"}, {"id": 107, "start": 944.56, "end": 949.64, "text": "includes to lauer case also im prinzip wir ignorieren einfach ob es groß und klein geschrieben ist also wenn ich zum beispiel"}, {"id": 108, "start": 949.64, "end": 951.64, "text": "ein to do habe"}, {"id": 109, "start": 952.64, "end": 958.76, "text": "Wo keine ahnung anstatt titel keck weh drinne steht und ich suche jetzt hier nach keck in klein"}, {"id": 110, "start": 959.16, "end": 965.92, "text": "Finde das auch oder wenn ich nach keck in groß suche oder wie auch immer geartet finde das"}, {"id": 111, "start": 967.88, "end": 969.88, "text": "Löschen geht auch noch"}, {"id": 112, "start": 969.88, "end": 979.08, "text": "Vielleicht musst du ja auch so ein store update machen das problem ist ich habe keine möglichkeit an irgendeiner stelle ein store update zu machen"}, {"id": 113, "start": 981.0, "end": 987.16, "text": "Weil das hier direkt auf das to do gebeindet ist ich kann ja kein custom custom zeug ausführen"}, {"id": 114, "start": 990.4, "end": 992.8, "text": "Wieso er die zweier findet wo findet er die zweier"}, {"id": 115, "start": 994.36, "end": 995.84, "text": "Was"}, {"id": 116, "start": 995.84, "end": 1001.92, "text": "Ach so ja warum findet er die zweier chat dreimal dürft ihr raten"}, {"id": 117, "start": 1003.04, "end": 1006.4, "text": "Ihr könnt es nicht wissen aber da steht keck weh drin"}, {"id": 118, "start": 1006.4, "end": 1013.4, "text": "In dem"}, {"id": 119, "start": 1019.76, "end": 1021.88, "text": "Bade"}, {"id": 120, "start": 1021.88, "end": 1027.16, "text": "Aber war kein absichtlicher tschübett als als als hätte ich das jetzt vorbereitet oder so"}, {"id": 121, "start": 1027.16, "end": 1045.48, "text": "aber das steht da mit drin so ja gut wo machen wir jetzt weiter wie gesagt es funktioniert alles"}, {"id": 122, "start": 1045.48, "end": 1050.68, "text": "also was haben wir als nächstes hübsch gemacht haben wir wir haben das tatsächlich das muss man"}, {"id": 123, "start": 1050.68, "end": 1056.44, "text": "echt mal sagen ich glaube das ist meine man muss mal abhaken moment wie ging moment der kunde mark"}, {"id": 124, "start": 1056.44, "end": 1067.04, "text": "down icsen ging das so weiß ich guck mal mal brief mark down preview ne gab es nicht möglich konnte"}, {"id": 125, "start": 1067.04, "end": 1074.24, "text": "man nicht in mark doch irgendwie schön schön schön icsis icsis machen irgendwie mark down sein check"}, {"id": 126, "start": 1074.24, "end": 1097.64, "text": "der gov floor das mache ich doch ist das vielleicht github genau das ist irgendwie"}, {"id": 127, "start": 1097.64, "end": 1105.92, "text": "special github markdown das hier ist normales magda wobei das auch nicht normales magdaun ist"}, {"id": 128, "start": 1105.92, "end": 1113.4, "text": "weil normales magdaun braucht lehrzeichen am ende für neue zeile ok ich sag nix das ist das ist"}, {"id": 129, "start": 1113.4, "end": 1119.16, "text": "normales magdaun also dass das hier und zwei unterschiedliche zeilen sind es auch github"}, {"id": 130, "start": 1119.16, "end": 1123.64, "text": "magdaun normalerweise müsste man zwei lehrzeichen dran machen für neue zeile wäre auch immer auf"}, {"id": 131, "start": 1123.64, "end": 1130.2, "text": "so eine bescheuerte idee gekommen ist man kann aber das preview man kann das preview doch bestimmt"}, {"id": 132, "start": 1130.2, "end": 1155.04, "text": "umstellen settings wir gucken jetzt mal magdaun preview breaks"}, {"id": 133, "start": 1160.2, "end": 1169.24, "text": "kann man das nicht auf auf gfm umstellen"}, {"id": 134, "start": 1169.24, "end": 1190.0, "text": "kann man nicht wie es kaut magdaun preview gfm github flavoret das schmeckt nach github pepo fett"}, {"id": 135, "start": 1190.0, "end": 1200.12, "text": "oder muss man jegliche sache irgendwie"}, {"id": 136, "start": 1200.12, "end": 1204.12, "text": "magdaun preview render github flavoret"}, {"id": 137, "start": 1204.12, "end": 1219.4, "text": "das support github no wie es kauta es kommen magdaun using na geil da"}, {"id": 138, "start": 1219.4, "end": 1223.6, "text": "brauchst wahrscheinlich echt ein plugin für was sollen das scheiß alle das gehört jetzt"}, {"id": 139, "start": 1223.6, "end": 1228.2, "text": "mittlerweile sogar dem gleichen laden wollen die mich rollen oder was was ist hier los"}, {"id": 140, "start": 1228.2, "end": 1240.36, "text": "microsoft denkt sich einfach nur egal wir machen jetzt einfach so häkchen hin so das"}, {"id": 141, "start": 1240.36, "end": 1247.56, "text": "haben wir gemacht hübsch gemacht den komponenten ausgelagert haben wir bei dir geht's"}, {"id": 142, "start": 1247.56, "end": 1258.68, "text": "jetzt nicht was ich da anders machen sollte"}, {"id": 143, "start": 1258.68, "end": 1281.56, "text": "das ist exakt so wie die das hier ein beispiel haben magdaun preview github flavoret visual"}, {"id": 144, "start": 1281.56, "end": 1292.84, "text": "studio code plugin github styling jawoll es hat nur 523.000 installationen"}, {"id": 145, "start": 1292.84, "end": 1306.52, "text": "du hast welche extension magdaun all in one peers code visual studio code hat so krass"}, {"id": 146, "start": 1306.52, "end": 1313.0, "text": "viele extensions mittlerweile mach ach nur drei millionen dreieinhalb millionen installationen"}, {"id": 147, "start": 1313.0, "end": 1320.68, "text": "das ist ja ist ja nix und das ist next level magdaun shit wofür ist das da all you need"}, {"id": 148, "start": 1320.68, "end": 1330.92, "text": "for magdaun keyboard shortcuts preview na gut hauen wir einfach mal rein china chinesen"}, {"id": 149, "start": 1330.92, "end": 1332.8, "text": "plugins installiere ich immer am liebsten"}, {"id": 150, "start": 1332.8, "end": 1345.68, "text": "magdaun view auf der shell ja das könnte man auch verwenden somit autoreload oder so"}, {"id": 151, "start": 1345.68, "end": 1372.24, "text": "aber ich hab das hier lieber im editor drin ok install oh nu magdaun preview all magdaun"}, {"id": 152, "start": 1372.24, "end": 1378.84, "text": "oder einfach nur das preview öffnen und es passiert nix ne das reicht nicht was muss"}, {"id": 153, "start": 1378.84, "end": 1391.28, "text": "ich jetzt machen magdaun all in all all preview ne wie macht man da jetzt das preview von"}, {"id": 154, "start": 1391.28, "end": 1405.88, "text": "auf scheint big brain time zu sein geht nicht so einfach print current document to html"}, {"id": 155, "start": 1405.88, "end": 1423.6, "text": "ne hab ich jetzt n html angelegt hier drin oder was zack ja ja wie wie wie macht man"}, {"id": 156, "start": 1423.6, "end": 1439.32, "text": "das sein preview kann er zu kompliziert sein review overview overwrite open review toggle"}, {"id": 157, "start": 1439.32, "end": 1469.28, "text": "preview ok open preview ne alter wir halten uns hier schon wieder mit zeug auf extensions"}, {"id": 158, "start": 1469.28, "end": 1485.6, "text": "wo ist es warum steht das nicht unter extensions drunter"}, {"id": 159, "start": 1485.6, "end": 1508.16, "text": "control kv kontrol shift v kontrol shift v"}, {"id": 160, "start": 1508.16, "end": 1534.54, "text": "um die"}, {"id": 161, "start": 1534.54, "end": 1539.54, "text": "haben wir gemacht. Auslagerung in Komponenten, Slots und Events haben wir gemacht. Wohlgemerkt,"}, {"id": 162, "start": 1539.54, "end": 1544.94, "text": "man muss sagen, das ist doch mittlerweile echt ordentlich im Vergleich zu dem anderen Zeug,"}, {"id": 163, "start": 1544.94, "end": 1548.38, "text": "was wir sonst so fabrizieren. Guck mal, das kann man richtig gut lesen. Unser Main hat"}, {"id": 164, "start": 1548.38, "end": 1555.26, "text": "jetzt gerade mal 80 Zeilen, ungefähr 80 Zeilen und es ist alles gut lesbar. Man kann jetzt"}, {"id": 165, "start": 1555.26, "end": 1570.58, "text": "nicht sagen, das wäre irgendwie großartig kompliziert. Ja. Und die Suche, die Suche"}, {"id": 166, "start": 1570.58, "end": 1579.18, "text": "ist richtig pork, guck mal hier. Heck weh. Seht ihr, seht ihr mal auch, guckt mal, wenn"}, {"id": 167, "start": 1579.18, "end": 1587.18, "text": "ich hier reinklicke in die Suche, es ist nicht nur, dass die Suche sich ausbreitet, ja, dass"}, {"id": 168, "start": 1587.18, "end": 1597.14, "text": "sie sich erweitert, sondern der, das Icon mit der Lupe, guck mal, das wird auch blau,"}, {"id": 169, "start": 1597.14, "end": 1605.7, "text": "wenn man reinklickt. Wie die Umrandung. Seht ihr mal, wie pock das ist? Das ist Tailwind,"}, {"id": 170, "start": 1605.7, "end": 1616.94, "text": "das ist Tailwind Magic und zwar macht der Fokus hier, Fokus within, also sprich, wenn es fokussiert"}, {"id": 171, "start": 1616.94, "end": 1624.14, "text": "ist, dann setzt der Text auf, also nein, wenn der Fokus irgendwo in diesem Diff drinne ist,"}, {"id": 172, "start": 1624.14, "end": 1630.62, "text": "dann setzt das Text auf blue und ansonsten ist halt Text grey und hier unten ist halt"}, {"id": 173, "start": 1630.62, "end": 1639.26, "text": "kein Text gesetzt. Richtig, Magic. Alter, komplett ohne Javascript hier. Wir können"}, {"id": 174, "start": 1639.26, "end": 1661.5, "text": "auch noch mal kurz die Huge Animation bewundern, guck mal hier. Hier, die ist slided. Wo kommen"}, {"id": 175, "start": 1661.5, "end": 1669.46, "text": "eigentlich diese komischen, dieser komische Rahmen, das ist noch irgendein Hover-Effekt"}, {"id": 176, "start": 1669.46, "end": 1676.42, "text": "oder so. Egal, machen wir jetzt weg. Duration 75, perfekt. Gut, dann würde ich sagen, können"}, {"id": 177, "start": 1676.42, "end": 1680.58, "text": "wir weitermachen. Was machen wir als nächstes? Dark Light Theme, das würde ich wahrscheinlich"}, {"id": 178, "start": 1680.58, "end": 1684.42, "text": "noch mal ein bisschen aufschieben, das ist eher sowas für Brain AFK. Wir haben jetzt"}, {"id": 179, "start": 1684.42, "end": 1695.62, "text": "aktuell Dark Theme und eigentlich ganz gut. Das ist eindeutig Advanced-Thema. To Do's"}, {"id": 180, "start": 1695.62, "end": 1706.58, "text": "Liste Sharing als Link. Ein Delete All-Button. Also ich glaube ein Delete All-Button dürfte"}, {"id": 181, "start": 1706.58, "end": 1724.18, "text": "relativ easy sein. Musik nennt ein bisschen laut. Geht eigentlich ganz gut. Also ein"}, {"id": 182, "start": 1724.18, "end": 1729.06, "text": "Delete All-Button ist easy, das können wir jetzt gleich machen. Da haben wir unten einfach"}, {"id": 183, "start": 1729.06, "end": 1737.14, "text": "einen zweiten Knopf. Wobei, ich glaube ein Delete All-Button neben dem Add-Button ist"}, {"id": 184, "start": 1737.14, "end": 1745.74, "text": "vielleicht ein bisschen... Chain-Lo ist wieder da, guck mal da. Ich glaube so ein Delete"}, {"id": 185, "start": 1745.74, "end": 1751.18, "text": "All-Button neben dem Add-Button ist vielleicht ein bisschen schlecht positioniert. Shortcuts"}, {"id": 186, "start": 1751.18, "end": 1756.94, "text": "könnten wir uns überlegen. Nur bin ich nicht ganz sicher, wie man Shortcuts im Browser"}, {"id": 187, "start": 1756.94, "end": 1768.34, "text": "fängt. Das gucken wir uns jetzt an. Wie fängt man Shortcuts im Browser ab? Wie bekomme ich"}, {"id": 188, "start": 1768.34, "end": 1772.7, "text": "Shortcuts? Das müsste doch, also nix sagen Chat, nix sagen. Das müsste doch eigentlich"}, {"id": 189, "start": 1772.7, "end": 1781.98, "text": "relativ easy sein. Ich bräuchte so ein On-Click-Event für die gesamte Seite. Wie auch immer ich"}, {"id": 190, "start": 1781.98, "end": 1793.86, "text": "ein On-Click-Event für die gesamte Seite bekomme. Gibt es sowas wie Window-On-Click? Also sowas"}, {"id": 191, "start": 1793.86, "end": 1817.5, "text": "wie Window-Click? Nee. Ah, Key-Down, nee. Svelte-Window, ah yes, excellent, guck ich wusste"}, {"id": 192, "start": 1817.5, "end": 1829.02, "text": "doch die Leute sind schlau. Svelte-Window, Special-Elements, Svelte-Window-On-Key-Down,"}, {"id": 193, "start": 1829.02, "end": 1836.06, "text": "Alter ist das wieder 5Head was da eingebaut ist. Guckt euch das doch mal an. Massive 5Head"}, {"id": 194, "start": 1836.06, "end": 1842.7, "text": "Poggers, Big Brain Time. Das war jetzt glaube ich so der Twitch Chat. Leute, ich muss euch"}, {"id": 195, "start": 1842.7, "end": 1849.78, "text": "was erzählen. Ich spiele ja gerade nebenbei wieder 20 Jahre altes MMO auf einem Test-Server"}, {"id": 196, "start": 1849.78, "end": 1858.06, "text": "so nebenbei und ich hab nen Char der heißt Pepega. Weiß nicht wie er bis danach war."}, {"id": 197, "start": 1858.06, "end": 1865.98, "text": "Zumindest ich hab gestern mit ein paar anderen Leuten zusammen PvP gespielt und wir haben"}, {"id": 198, "start": 1865.98, "end": 1871.74, "text": "uns ernsthaft mit einem anderen aus der Gruppe hab ich mich in Twitch Emotes unterhalten."}, {"id": 199, "start": 1871.74, "end": 1882.5, "text": "Und was sieht man daran? Wenn sich Leute in-Game in einem 20 Jahre altem MMO mit Twitch Emotes"}, {"id": 200, "start": 1882.5, "end": 1888.34, "text": "unterhalten dann weiß man das ist Mainstream und ist angekommen. Welches MMO Dark Age"}, {"id": 201, "start": 1888.34, "end": 1898.62, "text": "of Camelot auf einem Test-Server hier? Bin es interessiert. Atlas, FreeShot, da. Ist"}, {"id": 202, "start": 1898.62, "end": 1911.18, "text": "aber komplett Test und wird gevibe am Ende der Testphase. Also das ist nur was für Leute"}, {"id": 203, "start": 1911.18, "end": 1916.62, "text": "die früher auch da auch gespielt haben denke ich. Zumindest fand ich das äußerst erfrischend."}, {"id": 204, "start": 1916.62, "end": 1924.38, "text": "Ich hab geschrieben für alle im Chat so nach dem Motto hier I'm tired AF was weiß ich ich"}, {"id": 205, "start": 1924.38, "end": 1931.14, "text": "geh ins Bett und dann hab ich reingeschrieben Bettge und dann hat der andere Typ darauf"}, {"id": 206, "start": 1931.14, "end": 1938.58, "text": "geantwortet Zetge. In einem 20 Jahre altem MMO da wird man denken die Leute sind noch"}, {"id": 207, "start": 1938.58, "end": 1947.58, "text": "mehr Boomer als ich. Da wird man davon ausgehen die Leute sind noch mehr Boomer als ich aber"}, {"id": 208, "start": 1947.58, "end": 1955.34, "text": "nein Twitch ist mittlerweile so Mainstream das funktioniert. Aber die Musik ist mir grade"}, {"id": 209, "start": 1955.34, "end": 1972.54, "text": "zu belastend. Mumu jawoll. Ja Twitch ist auch bei Mainstream Boomer angekommen das heißt"}, {"id": 210, "start": 1972.54, "end": 1986.66, "text": "schon was. Ok Handle Keydown. Function. Function. Handle wir wollen nicht Keydown gibt es nicht"}, {"id": 211, "start": 1986.66, "end": 2003.5, "text": "einfach. On Key oder sowas. On Key Press ist mir lieber. So. Hand. Nein. Handle. Easy."}, {"id": 212, "start": 2003.5, "end": 2011.02, "text": "Quatsch was mach ich denn da Handle Key Event so rum muss das sein. Lock Event. Was jetzt?"}, {"id": 213, "start": 2011.02, "end": 2023.22, "text": "Warum Error? Nö kein Error. Keyboard Event. Porkas Hagger Man. Ok Maus Event gibt es wahrscheinlich"}, {"id": 214, "start": 2023.22, "end": 2032.34, "text": "nochmal extra. So also wo ist der Unterschied zwischen Svelte Kit und Svelte. Svelte ist"}, {"id": 215, "start": 2032.34, "end": 2038.3, "text": "das eigentliche Framework und Svelte Kit ist was was die Arbeit ein bisschen einfacher"}, {"id": 216, "start": 2038.3, "end": 2045.34, "text": "macht. Zum Beispiel hast du in Svelte Kit deine Routendefinition pro Feil also legst"}, {"id": 217, "start": 2045.34, "end": 2050.94, "text": "ein Feil an der macht automatisch eine Route draus. So und Svelte Kit unterstützt dann"}, {"id": 218, "start": 2050.94, "end": 2055.26, "text": "beispielsweise auch dass du die Seiten schon mal prerendern kannst auf dem Server bevor"}, {"id": 219, "start": 2055.26, "end": 2060.86, "text": "du sie rüber schickst. Also du brauchst Svelte Kit nicht. Svelte Kit macht manche Sachen"}, {"id": 220, "start": 2060.86, "end": 2070.06, "text": "ein bisschen einfacher oder naheliegender. Aber ansonsten ist das alles Svelte. Was cool"}, {"id": 221, "start": 2070.06, "end": 2076.42, "text": "ist ist Server Side Rendering also dieses Prerendern von den Seiten weil du bekommst"}, {"id": 222, "start": 2076.42, "end": 2082.26, "text": "die Seite quasi schon vorgerendert geschickt und der Browser muss sich dann bloß noch"}, {"id": 223, "start": 2082.26, "end": 2086.94, "text": "übernehmen und nicht erstmal quasi 10 MB JavaScript drunterladen dass er anfangen kann"}, {"id": 224, "start": 2086.94, "end": 2091.02, "text": "die Seite zu rendern. Das ist eigentlich ziemlich schlau. Das ist so das beste aus"}, {"id": 225, "start": 2091.02, "end": 2095.94, "text": "beiden Welten. Früher hattest du quasi nur Server Seiten die Seiten gerendert. Zwischenzeitlich"}, {"id": 226, "start": 2095.94, "end": 2101.02, "text": "waren Single Page Applications übelst angesagt dass du alles kleinseitig gemacht hast und"}, {"id": 227, "start": 2101.02, "end": 2119.06, "text": "jetzt so eine Mischung"}, {"id": 228, "start": 2119.06, "end": 2133.86, "text": "das ist nicht Friday oder heißt die Musik so. So also Handle Key jetzt kriegen wir die"}, {"id": 229, "start": 2133.86, "end": 2137.9, "text": "Key Events auf der Seite und jetzt muss ich gucken also wir machen jetzt zum Beispiel"}, {"id": 230, "start": 2137.9, "end": 2147.5, "text": "sowas wie Alt Enter würde ich sagen Alt Enter legt ein neues Emote an oder nicht ein neues"}, {"id": 231, "start": 2147.5, "end": 2156.82, "text": "Emote was erzähl ich dir? Neues To Do. Alt Enter neues Neues To Do. Alt plus Enter neues"}, {"id": 232, "start": 2156.82, "end": 2166.02, "text": "To Do und oder Control Enter und Alt plus D gleich dann. Probieren wir das mal aus"}, {"id": 233, "start": 2166.02, "end": 2174.7, "text": "ist ja nur zum testen. Also das war doch irgendwie Modifier oder sowas. Wie man das raus bekommen"}, {"id": 234, "start": 2174.7, "end": 2192.82, "text": "konnte ob einer. Achso. Ah ne Alt plus D geht nicht Alt plus D ist. Wäre Tab nicht"}, {"id": 235, "start": 2192.82, "end": 2211.5, "text": "besser als neues To Do ich verwende Tab meistens. Weiß ja. Alt Key genau. Ich brauche jetzt"}, {"id": 236, "start": 2211.5, "end": 2225.58, "text": "irgendwas was nicht schon belegt ist. Moment ich brauche Keys die nicht schon belegt sind"}, {"id": 237, "start": 2225.58, "end": 2239.58, "text": "vom Browser. Was ist denn zum Beispiel frei? Das ist ja alle schon belegt und der erkennt"}, {"id": 238, "start": 2239.58, "end": 2251.58, "text": "auch nicht das. Guck mal der erkennt auch nicht wenn ich was mit Modifier drücke. Kann"}, {"id": 239, "start": 2251.58, "end": 2259.22, "text": "es sein dass das On Key Press nicht funktioniert? Sondern dass ich Key Down wirklich brauche"}, {"id": 240, "start": 2259.22, "end": 2269.9, "text": "dafür. Ja Key Down ja. Das sollte jetzt Alt Key True sein ja. Okay Key Down muss es"}, {"id": 241, "start": 2269.9, "end": 2279.5, "text": "sein. Oder Key Up. Verstehe. Aber lieber Key Up dann passiert das. Wobei ne wir machen"}, {"id": 242, "start": 2279.5, "end": 2307.34, "text": "es bei Key Down dann passiert es gleich. So wir machen jetzt was passiert wenn ich Enter"}, {"id": 243, "start": 2307.34, "end": 2313.98, "text": "drücke. Keyboard Event. Key Enter. Wir testen es jetzt einfach mal damit. Also Alt Enter"}, {"id": 244, "start": 2313.98, "end": 2331.5, "text": "bedeutet also If Event Key gleich Enter und E Punkt was war das? Alt Key dann Add To"}, {"id": 245, "start": 2331.5, "end": 2338.26, "text": "Do. Gucken wir mal ob das jetzt funktioniert. So ich bin irgendwo auf der Seite und jetzt"}, {"id": 246, "start": 2338.26, "end": 2348.98, "text": "Alt Enter. Bäm. Leute neues To Do am Start. Massive. Deshalb 50 Milliarden To Do's. Okay"}, {"id": 247, "start": 2348.98, "end": 2362.3, "text": "jetzt muss ich ganz schön lang klicken bis da wieder. Excellent. Vielleicht hätte ich"}, {"id": 248, "start": 2362.3, "end": 2383.86, "text": "auch gleich lieber All Clear All Button machen sollen. Ähm Moment Chat was? Mein"}, {"id": 249, "start": 2383.86, "end": 2392.26, "text": "Luzent lässt nach dem Kommentarding immer ein Leerzeichen. Ich mach das auch so. Ich"}, {"id": 250, "start": 2392.26, "end": 2406.5, "text": "mach auch gerne Leerzeichen. Es ist aber würde ich sagen ziemlich Geschmackssache. Genau"}, {"id": 251, "start": 2406.5, "end": 2414.94, "text": "und das Schließen. Du hast recht. Sackfalte. Bester Name. Hier können wir einfach gucken"}, {"id": 252, "start": 2414.94, "end": 2424.26, "text": "ob wir in dem Feld drin sind und dann schließen wir es. Wieso benutzt du eigentlich Wishl"}, {"id": 253, "start": 2424.26, "end": 2429.06, "text": "Studio Code anstatt Wishl Studio? Weil für so Frontend JavaScript Sachen Wishl Studio"}, {"id": 254, "start": 2429.06, "end": 2433.6, "text": "Code deutlich besser ist. Der JavaScript Support in Wishl Studio ist PaintsChamp und du hast"}, {"id": 255, "start": 2433.6, "end": 2439.98, "text": "gerade in Wishl Studio Code schon out of the box ziemlich guten JavaScript Support. Dazu"}, {"id": 256, "start": 2439.98, "end": 2446.1, "text": "kommt dass du Milliarden an Extensions hast für alles was du brauchst. Guck mal zum Beispiel"}, {"id": 257, "start": 2446.1, "end": 2455.3, "text": "mal ein gutes Beispiel für wenn man zum Beispiel Icons einbinden will. So. Icon. Icon. Was"}, {"id": 258, "start": 2455.3, "end": 2462.1, "text": "mal als Beispiel. So und jetzt ich benutze hier Iconify für und jetzt gibt es ein Plugin"}, {"id": 259, "start": 2462.1, "end": 2472.58, "text": "für das Autocomplete der Icons inklusive. Inklusive Vorschau wie die Icons aussehen."}, {"id": 260, "start": 2472.58, "end": 2479.98, "text": "Das ist halt das geile an Plugins. So. Fügen wir das ein. Bam. Das habe ich irgendwie kaputt"}, {"id": 261, "start": 2479.98, "end": 2484.78, "text": "gemacht weil ich das Code vergessen habe. Und schon haben wir das Icon drin. Kannst"}, {"id": 262, "start": 2484.78, "end": 2492.22, "text": "dann auch sagen wir wollen Tweemoji haben. Tweemoji. Tweemoji wollen wir den Döner."}, {"id": 263, "start": 2492.22, "end": 2498.7, "text": "Oder das Taco. Taco. Bam. Hat Tweemoji Taco drinne. Wir können dann jetzt sowas sagen"}, {"id": 264, "start": 2498.7, "end": 2518.02, "text": "wir hier Class Text 8XL. Jetzt haben wir ein großes Taco. Bumba Dings Bums Bada Bums Dings"}, {"id": 265, "start": 2518.02, "end": 2533.34, "text": "alles klar. Poggers. 18 Monate am Start. Wir können auch Cookie. Cookie. Das ist aber"}, {"id": 266, "start": 2533.34, "end": 2541.46, "text": "ein XL Cookie drinne. Oder Kappa. Ah nee Kappa heißt das nicht. Das ist ja Moon offiziell."}, {"id": 267, "start": 2541.46, "end": 2555.42, "text": "Das ist ja Hull Moon. Hull Moon Face. Thanks to JetBrains Fleet wird Visual Studio Code"}, {"id": 268, "start": 2555.42, "end": 2559.58, "text": "übertreffen. Ich denke die werden denen ganz schön Konkurrenz machen aber ich glaube in"}, {"id": 269, "start": 2559.58, "end": 2565.78, "text": "dem Fall nicht dass es das übertreffen wird weil es einfach Java versus Javascript ist."}, {"id": 270, "start": 2565.78, "end": 2571.34, "text": "Du wirst tausendmal mehr Leute finden gerade für Frontend Sachen die die Sachen in Javascript"}, {"id": 271, "start": 2571.34, "end": 2576.54, "text": "programmieren wollen als in Java. Solange Plugins in Fleet in Java programmiert werden"}, {"id": 272, "start": 2576.54, "end": 2582.46, "text": "wird für Frontends Geschichten denke ich zumindest Visual Studio Code weiter das Ding schlechthin"}, {"id": 273, "start": 2582.46, "end": 2599.1, "text": "bleiben. Bin mal gespannt. Ich stelle mir Fleet eher in Richtung so Sachen wo es keine"}, {"id": 274, "start": 2599.1, "end": 2605.14, "text": "offiziellen Ideen von JetBrains gibt. Aktuell ist es so man will Rust programmieren. Es"}, {"id": 275, "start": 2605.14, "end": 2610.66, "text": "gibt ja ein ganz gutes Rust Plugin für diese ganzen JetBrains Dinger. Dann verwendest du"}, {"id": 276, "start": 2610.66, "end": 2616.06, "text": "standardmäßig IntelliJ und machst dann irgendein Plugin für rein. Obwohl du eigentlich gar"}, {"id": 277, "start": 2616.06, "end": 2620.3, "text": "nicht IntelliJ haben willst. Für sowas ist Fleet gut. Dann stelle ich mir zum Beispiel"}, {"id": 278, "start": 2620.3, "end": 2625.74, "text": "vor du nimmst Fleet dann machst du das Rust Plugin rein hast eine ganz gute Rust IDE."}, {"id": 279, "start": 2625.74, "end": 2630.98, "text": "Du nimmst Fleet und machst das BrainFuck Plugin rein hast einen ganz guten BrainFuck Editor."}, {"id": 280, "start": 2630.98, "end": 2640.38, "text": "Haben die Ruby? Die haben RubyMine die haben auch für Ruby was. Für welche halbwegs verbreitete"}, {"id": 281, "start": 2640.38, "end": 2647.82, "text": "Programmiersprache hat JetBrains eigentlich nichts? Flutter zum Beispiel. Flutter könnte"}, {"id": 282, "start": 2647.82, "end": 2655.02, "text": "es ein gutes Fleet Plugin geben und gut ist. Oder für das meiste haben die ja schon. Für"}, {"id": 283, "start": 2655.02, "end": 2660.22, "text": "das meiste haben die ja mittlerweile irgendwas. Aber da hälst du schon zwei Sachen. Du machst"}, {"id": 284, "start": 2660.22, "end": 2666.5, "text": "ein Rust Plugin rein, ein Flutter Plugin und hälst eine ganz gute IDE dafür. Ohne dass"}, {"id": 285, "start": 2666.5, "end": 2675.1, "text": "du den ganzen IntelliJ Kram drumherum brauchst. Rubey haben sie. Die haben RubyMine. Habe"}, {"id": 286, "start": 2675.1, "end": 2678.1, "text": "ich früher auch mal verwendet als ich noch viel Ruby gemacht habe aber jetzt gar nicht"}, {"id": 287, "start": 2678.1, "end": 2682.34, "text": "mehr. Also wir drücken Alt-Enter und es gibt ein neues To-Do. Das ist doch schon mal Pog."}, {"id": 288, "start": 2682.34, "end": 2698.1, "text": "So und dann wollen wir. So und dann wollen wir wenn wir klicken. Wie machen wir das jetzt"}, {"id": 289, "start": 2698.1, "end": 2712.3, "text": "dass es Closed wird? Also es gibt zwei Sachen. Zum To-Do Closen. Wir könnten entweder das"}, {"id": 290, "start": 2712.3, "end": 2721.74, "text": "global machen und dann schauen welches To-Do gerade aktiv ist. Oder wir machen das in der"}, {"id": 291, "start": 2721.74, "end": 2729.34, "text": "To-Do Component. Oder wir werfen ein Event in der To-Do Component. JetBrains hat nichts"}, {"id": 292, "start": 2729.34, "end": 2738.82, "text": "für Haskell. Ja dann auf gehts. Fleet Plugin. So wie machen wir das jetzt mit dem schließen?"}, {"id": 293, "start": 2738.82, "end": 2747.34, "text": "Also wir wollen auf jeden Fall schon mal. Brauchen wir kein else. If. If Key ist was"}, {"id": 294, "start": 2747.34, "end": 2765.02, "text": "was? Was hatten wir gesagt? Ach so hier Alt. Wenn es D ist. Alt und D okay. 0W. Alt und"}, {"id": 295, "start": 2765.02, "end": 2772.1, "text": "D ist dann zum schließen. Und jetzt müssten wir an der Stelle noch wissen was das aktive"}, {"id": 296, "start": 2772.1, "end": 2777.54, "text": "To-Do ist zum schließen. So und da bin ich mir jetzt nicht sicher wie wir das machen."}, {"id": 297, "start": 2777.54, "end": 2786.58, "text": "Entweder track ich das hier drinnen was aktiv ist. Oder ich werfe oder ich machs im To-Do"}, {"id": 298, "start": 2786.58, "end": 2801.86, "text": "selbst. Wahrscheinlich ist es im To-Do Handeln sinniger. Dann ist das auch gekapselt und"}, {"id": 299, "start": 2801.86, "end": 2815.02, "text": "dann muss ich da keine Gedanken drüber machen. Also Text Area. Key Down. Machen wir das jetzt"}, {"id": 300, "start": 2815.02, "end": 2827.3, "text": "inline? Machen wir das jetzt inline? Dann muss das aber Quoten. Nee Klammern machen"}, {"id": 301, "start": 2827.3, "end": 2833.5, "text": "sonst funktioniert der Kram nicht. If. Ich hab keine Ahnung ob das so funktioniert."}, {"id": 302, "start": 2833.5, "end": 2857.7, "text": "Schauen wir mal. Mal gucken. Wenn Key D und Alt Key dann. Dann To-Do dann gleich True."}, {"id": 303, "start": 2857.7, "end": 2860.38, "text": "Kann man das so schreiben? Nee natürlich nicht. Muss man bestimmt nochmal klammern."}, {"id": 304, "start": 2860.38, "end": 2870.42, "text": "Excellent. Okay Alt D. Bäm. Funst. Easy. So und jetzt müssen wir das. Wir brauchen aber"}, {"id": 305, "start": 2870.42, "end": 2884.62, "text": "zwei Sachen. Wenn man nochmal Ctrl D drückt dann wird das wieder Entdant. Wieder geöffnet"}, {"id": 306, "start": 2884.62, "end": 2889.34, "text": "quasi. Entdant wird das dann. So also das wollen wir auf jeden Fall schon mal hier nicht"}, {"id": 307, "start": 2889.34, "end": 2896.58, "text": "als Inline Funktion haben. Das ist ein bisschen hässlich. Handle. Handle. Close. Oder so."}, {"id": 308, "start": 2896.58, "end": 2907.74, "text": "Handle. Key. Hardle. Hardle. Key. Stimmt! Der Byte Strikes ist schlau. Natürlich. Das"}, {"id": 309, "start": 2907.74, "end": 2912.78, "text": "ist viel einfacher. Byte Strikes ist richtig big brain heute am Start. Guck mal."}, {"id": 310, "start": 2912.78, "end": 2942.42, "text": "Ja. Vorgass. Nice. Ja das ist das. Ich mein. Chat was sagt ihr? Inline oder extra extra"}, {"id": 311, "start": 2942.42, "end": 2948.34, "text": "Funktion hier oben. Ich glaub wir können schon eine extra Funktion machen oder? Das checkt"}, {"id": 312, "start": 2948.34, "end": 2966.7, "text": "doch sonst niemand der das durchguckt. Handle. Key. Um. If. Äh Moment. If. Ey das ist Mario"}, {"id": 313, "start": 2966.7, "end": 2978.86, "text": "Galaxy oder? Das ist Mario Kart irgendwie Mario Galaxy. Ja. Das ist die Regenbogen Strecke"}, {"id": 314, "start": 2978.86, "end": 3002.34, "text": "oder? Aus Mario Kart 8. Oder? Nee hatte die Mario Galaxy. Ach keine Ahnung. So. Kunst."}, {"id": 315, "start": 3002.34, "end": 3010.82, "text": "Chat. Ich versteh das Ende nicht ganz. Du prüfst auf all die und prüfst das mit dem"}, {"id": 316, "start": 3010.82, "end": 3017.9, "text": "mit einem und und. Ach du meinst das hier. Du meinst. Als ich das so geschrieben hatte."}, {"id": 317, "start": 3017.9, "end": 3027.34, "text": "Das ist das das das funktioniert wahrscheinlich in den meisten Programmiersprachen aber das"}, {"id": 318, "start": 3027.34, "end": 3032.54, "text": "in JavaScript funktioniert. Wundert mich. Wundert mich nicht. Und dann war das hier"}, {"id": 319, "start": 3032.54, "end": 3041.5, "text": "noch eine extra extra Funktion. Also das da ist eine anonyme Funktion. Weil. On click"}, {"id": 320, "start": 3041.5, "end": 3051.38, "text": "oder on Keydown halt eine Funktion haben will. Und und sonst nichts. Das hier ist quasi"}, {"id": 321, "start": 3051.38, "end": 3057.82, "text": "ein Ausdruck den man auswerten kann in JavaScript. Kann ich dir auch zeigen. Das ist quasi was"}, {"id": 322, "start": 3057.82, "end": 3071.7, "text": "weiß ich. Das gleiche wie so. Ach so ups. Niede. Das ist halt ein Ausdruck da kommt"}, {"id": 323, "start": 3071.7, "end": 3081.02, "text": "True oder False bei raus logischerweise. So. Und das verknüpft du einfach zu einem quasi"}, {"id": 324, "start": 3081.02, "end": 3086.46, "text": "weiteren logischen Ausdruck. Oder am Ende auch True oder False rauskommt. Aber dadurch"}, {"id": 325, "start": 3086.46, "end": 3091.22, "text": "wird es quasi ein Ausdruck den JavaScript auswertet. Deswegen musst du es nicht klammern."}, {"id": 326, "start": 3091.22, "end": 3095.74, "text": "Du hättest es auch klammern können und extra. Also. Du könntest auch hier drin jetzt ein"}, {"id": 327, "start": 3095.74, "end": 3102.46, "text": "ganz normales If machen. Dann musst du es aber klammern. Wenn du das in einer Zeile"}, {"id": 328, "start": 3102.46, "end": 3109.9, "text": "schreiben willst dann muss das ein Ausdruck sein. So. Und was hier rauskommt ist das kann"}, {"id": 329, "start": 3109.9, "end": 3115.58, "text": "man im Prinzip ausprobieren. Keine Ahnung das da. Und dadurch dass es ein und und ist"}, {"id": 330, "start": 3115.58, "end": 3121.58, "text": "wird das zweite nur ausgeführt wenn das erste True ist. Weil es ist ja logisch wenn man"}, {"id": 331, "start": 3121.58, "end": 3130.58, "text": "sowas hier hat. Oder keine Ahnung. Dann muss der das zweite also machen wir es umgedreht."}, {"id": 332, "start": 3130.58, "end": 3140.06, "text": "So. Der muss also das ist jetzt stellvertretend für ein Ausdruck der True oder False ergibt."}, {"id": 333, "start": 3140.06, "end": 3147.78, "text": "Wenn das erste False ist dann muss er das zweite nach dem und und ja gar nicht mehr"}, {"id": 334, "start": 3147.78, "end": 3153.78, "text": "auswerten um das Ergebnis zu wissen. Also. Stell euch mal vor das hier ist ein Ausdruck."}, {"id": 335, "start": 3153.78, "end": 3160.9, "text": "Da sag ich zum Beispiel 1 gleich gleich 1 und 2 gleich gleich 2. Oder 2 gleich gleich"}, {"id": 336, "start": 3160.9, "end": 3166.86, "text": "1. Hier kommt False raus. Hier kommt True raus. Das heißt um zu wissen was B ist muss"}, {"id": 337, "start": 3166.86, "end": 3171.02, "text": "der das hier auswerten. Weil es ist True. Und er weiß er muss das zweite auswerten"}, {"id": 338, "start": 3171.02, "end": 3177.22, "text": "um zu wissen was da was bei B rauskommt. Hätte man jetzt sowas hier stehen. Dann wertet"}, {"id": 339, "start": 3177.22, "end": 3184.02, "text": "er den ersten Ausdruck aus und erkennt aha. Der erste Ausdruck ist schon False. Das heißt"}, {"id": 340, "start": 3184.02, "end": 3191.1, "text": "ich muss die zweite Hälfte gar nicht ausführen um zu wissen dass B False ist. Ist ja auch"}, {"id": 341, "start": 3191.1, "end": 3201.34, "text": "irgendwie eine Optimierungsgeschichte. So. Und das hier ist im Prinzip nichts anderes"}, {"id": 342, "start": 3201.34, "end": 3209.62, "text": "wie das. Nur dass man nur das in JavaScript aus irgendwelchen Gründen. Was das funktioniert"}, {"id": 343, "start": 3209.62, "end": 3215.18, "text": "übrigens nicht. Das funktioniert übrigens nicht in jeder in jeder Sprache. Du kannst"}, {"id": 344, "start": 3215.18, "end": 3221.42, "text": "zum Beispiel. Also ja für JavaScript ist hat das hier einen Return Wert. Ehrlich gesagt"}, {"id": 345, "start": 3221.42, "end": 3231.62, "text": "kein Plan warum. Also was weiß ich. Let B gleich 0. So und jetzt wenn ich sage B gleich"}, {"id": 346, "start": 3231.62, "end": 3242.3, "text": "1. Aus irgendwelchen Gründen ist das in Ordnung. Dass das keinen eigentlichen Bool Return Wert"}, {"id": 347, "start": 3242.3, "end": 3249.14, "text": "hat. Ich habe keinen blassen Schimmer warum das in JavaScript erlaubt ist. Da gibt eigentlich"}, {"id": 348, "start": 3249.14, "end": 3263.42, "text": "keinen Sinn. Aber das funktioniert. Es Lind. So was benutzen wir hier nicht. Wir haben immer"}, {"id": 349, "start": 3263.42, "end": 3271.9, "text": "gut selbst dokumentierten fehlerfreien Code. Da braucht man sowas nicht. In anderen Programmiersprachen"}, {"id": 350, "start": 3271.9, "end": 3281.74, "text": "mit sinnvollem Typing. Geht das nicht. Also wenn du sowas in C sharp ausprobieren willst."}, {"id": 351, "start": 3281.74, "end": 3287.66, "text": "C sharp Lab ist das glaube ich. Also wenn du sowas in C sharp machen willst klappt das"}, {"id": 352, "start": 3287.66, "end": 3294.02, "text": "nicht. Und KS wo sind wir hier. Also wenn du in C sharp beispielsweise sowas machen willst"}, {"id": 353, "start": 3294.02, "end": 3301.82, "text": "hier was ich in B gleich 0 und dann willst du und dann willst du überprüfen sowas wie. Ich meine"}, {"id": 354, "start": 3301.82, "end": 3312.22, "text": "der erste Teil funktioniert noch. Aber da kannst du nicht einfach sagen. Ja. Irgendwie if. Und"}, {"id": 355, "start": 3312.22, "end": 3318.26, "text": "und wobei mit if geht es ja auch so nicht. Das ist schon so so so so pains. Das ist mir da gar"}, {"id": 356, "start": 3318.26, "end": 3327.06, "text": "nicht so. Und und B gleich 1. Das lässt er dich hier an der Stelle schon gar nicht machen."}, {"id": 357, "start": 3327.06, "end": 3333.94, "text": "Er sagt was. Was zum Teufel. Wie willst du. Bitteschön. Bull Operator und Int miteinander"}, {"id": 358, "start": 3333.94, "end": 3348.42, "text": "unter einen Hut bringen. Also das ist. Ich würde fast behaupten. In den meisten Programmiersprachen"}, {"id": 359, "start": 3348.42, "end": 3356.3, "text": "die irgendein Default Return Type haben für alle Statements klappt das. Aber in normal geteilten"}, {"id": 360, "start": 3356.3, "end": 3362.46, "text": "Sprachen klappt das nicht. Was man in C sharp machen kann ist zum Beispiel wenn man was"}, {"id": 361, "start": 3362.46, "end": 3369.66, "text": "abbrechen will. Man darf. Man kann glaube ich sowas hier machen. Das oder oder throw."}, {"id": 362, "start": 3369.66, "end": 3395.9, "text": "Oder nicht. Ich bilde mir ein sowas ist jetzt eigentlich erlaubt gewesen. Das könnte aber"}, {"id": 363, "start": 3395.9, "end": 3400.98, "text": "auch in einem anderen Kontext sein. Wir haben nämlich was geändert in einem letzten Version"}, {"id": 364, "start": 3400.98, "end": 3407.22, "text": "das sowas in der Richtung jetzt geht aber anscheinend an der Stelle nicht. Egal das"}, {"id": 365, "start": 3407.22, "end": 3418.16, "text": "ist nicht unser Problem heute. Wo sind wir denn stehen geblieben. Wir können unser To"}, {"id": 366, "start": 3418.16, "end": 3427.54, "text": "do Closen. Und öffnen wieder. Ist eigentlich alles was wir machen müssen. Mehr müssen"}, {"id": 367, "start": 3427.54, "end": 3433.98, "text": "wir nicht machen. Wir können unser To do öffnen und schließen. Und wir können mit alt enter"}, {"id": 368, "start": 3433.98, "end": 3444.54, "text": "beliebig viele To do anlegen. Wenn wir wieder reinklicken macht das wieder auf. Eigentlich"}, {"id": 369, "start": 3444.54, "end": 3448.94, "text": "genau das was man haben will. Man könnte jetzt. Man könnte vielleicht noch sagen."}, {"id": 370, "start": 3448.94, "end": 3454.86, "text": "Wenn man entfernen drückt. Was haltet ihr von der Idee wenn man entfernen drückt auf"}, {"id": 371, "start": 3454.86, "end": 3464.34, "text": "einem geclosen To do. Dass man es löscht. Hast du schon mal ein Fim fürs Programmieren"}, {"id": 372, "start": 3464.34, "end": 3470.58, "text": "ausprobiert. Ja ich hab früher. War ich richtiger Hardcore Wim. Und ich verwende Wim eigentlich"}, {"id": 373, "start": 3470.58, "end": 3476.14, "text": "auch immer noch täglich aber halt nur für irgendwelche. Dinger wo ich in der Kommando"}, {"id": 374, "start": 3476.14, "end": 3490.38, "text": "Zeile bleiben will. Also nur wenn ich in der Kommando Zeile bleiben will. Ansonsten"}, {"id": 375, "start": 3490.38, "end": 3495.94, "text": "mache ich da relativ wenig mit. Zumal. Ich hatte früher den Tick. Ich habe versucht"}, {"id": 376, "start": 3495.94, "end": 3502.7, "text": "mein Wim übelst aufzubohren. Mit Fuzzy Search Geschichten mit irgendwelchen Python Plugins"}, {"id": 377, "start": 3502.7, "end": 3509.38, "text": "mit JavaScript Gedöns und sonst was. Und irgendwann habe ich mir gedacht Alter. Du bastelst ja"}, {"id": 378, "start": 3509.38, "end": 3516.18, "text": "mehr an deiner Editor Konfig und an deinem. Dass dein Editor halbwegs bedienbar ist rum"}, {"id": 379, "start": 3516.18, "end": 3525.54, "text": "anstatt irgendwas sinnvolles zu machen. Ach Papierkorb. Nee in Papierkorb gibt es noch"}, {"id": 380, "start": 3525.54, "end": 3529.82, "text": "nicht. Das machen wir als nächstes. Wir machen als nächstes den Papierkorb. Also wir machen"}, {"id": 381, "start": 3529.82, "end": 3541.82, "text": "jetzt genau. So. Wir machen jetzt die Shortcuts. Genau die drei Sachen machen wir jetzt. Shortcuts."}, {"id": 382, "start": 3541.82, "end": 3554.58, "text": "Ach ja genau du hast recht. Ja genau das meine ich. Richtig. Richtig. Der Chat hat"}, {"id": 383, "start": 3554.58, "end": 3570.46, "text": "recht. Ich meine das hier. Eins. Gleich. Gleich. Zwei. Und dann. New Exception. Kekwe. Oder"}, {"id": 384, "start": 3570.46, "end": 3576.46, "text": "auch nicht. Aber ja ich meine ich meinte ich meinte meinte das. Ich bin mir gerade nicht"}, {"id": 385, "start": 3576.46, "end": 3582.06, "text": "mal sicher wie man es benutzt. Das haben die in einem der letzten C-Sharp Versionen eingeführt"}, {"id": 386, "start": 3582.06, "end": 3587.06, "text": "dass du quasi jetzt Exceptions werfen kannst an Stellen wo du eigentlich irgendein Statement"}, {"id": 387, "start": 3587.06, "end": 3591.98, "text": "schreiben müsstest. Aber zur Abkürzung. Dass du quasi wenn du eh einen Error werfen willst"}, {"id": 388, "start": 3591.98, "end": 3602.86, "text": "das an der Stelle machen kannst. Nee nee nee das meinte ich nicht. Ein wie heißt das Ternary"}, {"id": 389, "start": 3602.86, "end": 3615.9, "text": "Operator. Ach. Keine Ahnung das sind so Nischendinger die braucht man so selten. So. Also entfernen"}, {"id": 390, "start": 3615.9, "end": 3625.5, "text": "können wir machen. Was für einen Knopf kommt denn wenn man entfernen drückt. Log. E. Was"}, {"id": 391, "start": 3625.5, "end": 3637.66, "text": "für einen Knopf kommt wenn man entfernen drückt. Delete. Aha. If. E. Delete. Sagt mal. Ist"}, {"id": 392, "start": 3637.66, "end": 3646.38, "text": "das hier. Hat das jemand schon mal mit TypeScript gemacht. Ist das hier eine getypte. Irgendwie"}, {"id": 393, "start": 3646.38, "end": 3655.38, "text": "Enamoration oder was auch immer in TypeScript. Also hat TypeScript autocomplete für die"}, {"id": 394, "start": 3655.38, "end": 3684.9, "text": "Keys dann die es gibt. Das wäre ja schon cool. Oder vielleicht dies. So if key delete. Dann"}, {"id": 395, "start": 3684.9, "end": 3702.22, "text": "remove to do. To do Punkt ID. Oh. Ja nice. Oh Moment das funktioniert. Ich muss checken"}, {"id": 396, "start": 3702.22, "end": 3708.38, "text": "ob es. Ich muss checken ob es. To do und dann und und. So das kann ich nämlich sonst alle"}, {"id": 397, "start": 3708.38, "end": 3713.3, "text": "löschen. Guck jetzt passiert nichts und wenn es jetzt dann ist dann kann ich es löschen."}, {"id": 398, "start": 3713.3, "end": 3725.5, "text": "Das finde ich eigentlich ganz gut. So. Faut nicht so auf. Stell dir vor jemand will den"}, {"id": 399, "start": 3725.5, "end": 3738.14, "text": "Text eines fertigen to do's ändern und löscht plötzlich sein to do. Kann er Feature Request"}, {"id": 400, "start": 3738.14, "end": 3741.58, "text": "aufbauen auf GitHub. Nee aber du hast schon recht das ist vielleicht keine all zu clevere"}, {"id": 401, "start": 3741.58, "end": 3747.82, "text": "Idee wenn man einfach entfernen drückt. Du willst dir was reinschreiben und dann. Dann"}, {"id": 402, "start": 3747.82, "end": 3757.62, "text": "funst das nicht. Aber zu Testzwecken finde ich das gar nicht mal so verkehrt. Sonst"}, {"id": 403, "start": 3757.62, "end": 3761.22, "text": "jetzt muss ich mir jetzt eine ordentliche Tastenkombination ausdrücken. Was ist denn"}, {"id": 404, "start": 3761.22, "end": 3772.98, "text": "eine gute Alt. Alt. Alt entfernen. Bäm Alt entfernen. Und und. Alt key kommt noch dabei."}, {"id": 405, "start": 3772.98, "end": 3779.46, "text": "Alt entfernen. Das drückt keiner einfach mal so. Alt entfernen. Also wir haben jetzt"}, {"id": 406, "start": 3779.46, "end": 3791.86, "text": "Alt Enter anlegen. Alt D zumachen und Alt entfernen löschen. Das finde ich ok. Das"}, {"id": 407, "start": 3791.86, "end": 3801.14, "text": "können wir so lassen. So next. Papierkorb. Ja Papierkorb wird etwas komplizierter. Aber"}, {"id": 408, "start": 3801.14, "end": 3808.78, "text": "ich glaube die grundsätzliche Sachen. Ein Andubutton ist eine gute Idee. Das ist aber"}, {"id": 409, "start": 3808.78, "end": 3817.98, "text": "auf jeden Fall. Ein advanced Thema. Papierkorb haben wir die grundlegenden Sachen schon da."}, {"id": 410, "start": 3817.98, "end": 3827.86, "text": "Weil. Wir haben schon ein Feld. Deleted für die To do's. Aktuell löschen wir die ja"}, {"id": 411, "start": 3827.86, "end": 3834.22, "text": "wirklich. Ja kein que. Also aktuell ist ja wenn ich hier drauf klicke. Dann löscht er"}, {"id": 412, "start": 3834.22, "end": 3841.66, "text": "das ja wirklich komplett. Was wir jetzt machen müssten ist nicht. Richtig die To do's löschen"}, {"id": 413, "start": 3841.66, "end": 3854.5, "text": "sondern. Eigentlich nur noch sagen. To do. Deleted. Gleich true. Aber da wird jetzt erstmal"}, {"id": 414, "start": 3854.5, "end": 3867.02, "text": "nichts mehr passieren. Wenn er mal drauf klickt. Aber ich muss jetzt hier. Filter. Ich muss"}, {"id": 415, "start": 3867.02, "end": 3875.14, "text": "die deleted die deleted rausfiltern. Also filtern. To do. Bringst hier mal mal die Klammer"}, {"id": 416, "start": 3875.14, "end": 3894.62, "text": "weg. To do wo es not. To do. Deleted ist. So. Ok. Oh ich muss mein local storage löschen"}, {"id": 417, "start": 3894.62, "end": 3899.1, "text": "da sind noch To do's drinne. Da sind noch To do's drinne wo diese neuen die dieses neue"}, {"id": 418, "start": 3899.1, "end": 3909.14, "text": "property gar nicht haben. Oder wir löschen sie. Ja Funst. So. So jetzt zeigt er nur noch"}, {"id": 419, "start": 3909.14, "end": 3923.5, "text": "jetzt zeigt er nur noch die To do's an. Die. Nicht deleted sind. Ok. Lull. Gut. So und"}, {"id": 420, "start": 3923.5, "end": 3934.02, "text": "gucken wir mal in local storage rein. Das sollten jetzt. To do's drinne sein. Die deleted sind."}, {"id": 421, "start": 3934.02, "end": 3946.3, "text": "Hier zum Beispiel. So und jetzt müssen wir eine Möglichkeit einbauen um das anzuzeigen."}, {"id": 422, "start": 3946.3, "end": 3951.54, "text": "Wie was für To do's deleted sind. Da habe ich aber ehrlich gesagt keine gute Idee zu."}, {"id": 423, "start": 3951.54, "end": 3957.42, "text": "Was war da ein erster Gameboy in grau. Ich glaube ich hatte den klassischen den ganz"}, {"id": 424, "start": 3957.42, "end": 3964.14, "text": "klassischen alten Gameboy der da 19 was weiß ich in 89 oder so raus kam. Und den gab es"}, {"id": 425, "start": 3964.14, "end": 3967.14, "text": "gab es den nicht nur in grau und später gab es den dann glaube ich auch in rot und so"}, {"id": 426, "start": 3967.14, "end": 3973.7, "text": "aber ich glaube am Anfang gab es den nur in grau. Hat den in grau. So jetzt haben wir"}, {"id": 427, "start": 3973.7, "end": 3982.38, "text": "die Möglichkeit unsere To do's zu markieren. Als. Oh. Das ist schlecht. Wobei ne das ist"}, {"id": 428, "start": 3982.38, "end": 3986.82, "text": "ok passt. Ja jetzt haben wir jetzt haben wir die Möglichkeit unsere To do's zu markieren"}, {"id": 429, "start": 3986.82, "end": 3993.3, "text": "als deleted. Die Sache ist bloß die wie hat jemand eine eine clevere Idee für den Papierkorb."}, {"id": 430, "start": 3993.3, "end": 4000.58, "text": "Und wie stellen wir das dann wieder her. Braucht es einen neuen storage für die deleted."}, {"id": 431, "start": 4000.58, "end": 4011.86, "text": "Ich meine wir könnten einfach ein Filter einbauen. Show deleted. Wir machen genau wir machen"}, {"id": 432, "start": 4011.86, "end": 4018.58, "text": "einfach den Toggle hier oben hin. Show deleted oder sowas in der Richtung. Und dann zeigt"}, {"id": 433, "start": 4018.58, "end": 4025.22, "text": "da alles an. Also nur mal so mal so als Beispiel wir machen jetzt einfach mal einen sehr hässlichen"}, {"id": 434, "start": 4025.22, "end": 4034.22, "text": "Button. Button. Ja und dann genau da könnten wir die komplett durch gestrichen unten drunter"}, {"id": 435, "start": 4034.22, "end": 4047.14, "text": "und unten drunter. Ja. Show deleted gleich Pauls. Und klick. So langsam lärm ich. Und"}, {"id": 436, "start": 4047.14, "end": 4057.74, "text": "klick. Show deleted. Ne das müssen wir jetzt so machen. Gleich not. Show deleted. Wo ist"}, {"id": 437, "start": 4057.74, "end": 4070.86, "text": "der Button hin. Der Button hat kein Text. Klick. Ja massive Button. Gut jetzt jetzt"}, {"id": 438, "start": 4070.86, "end": 4084.86, "text": "toggle das deleted auf true oder false. Show deleted. Genau. So und jetzt können wir anhand"}, {"id": 439, "start": 4084.86, "end": 4093.66, "text": "dessen das filtern. So nämlich hier hier filtern wir deleted raus. Und dann sagen wir einfach."}, {"id": 440, "start": 4093.66, "end": 4116.94, "text": "Wenn. Show deleted. Und und. Oh. Warte mal. Nee. Moment. Das ist die Logik. Die Logik"}, {"id": 441, "start": 4116.94, "end": 4123.62, "text": "ergibt keinen Sinn die ich hier gebaut habe. Also Filter. Show. Moment ich will jetzt nur"}, {"id": 442, "start": 4123.62, "end": 4150.1, "text": "wenn es nicht. Nee warte mal oder oder will ich. Show deleted. Ja. Im Prinzip ist. Eigentlich"}, {"id": 443, "start": 4150.1, "end": 4168.58, "text": "das die Logik oder. Ja. Kunst. Jetzt jetzt jetzt zeigt er einfach alle an. Guckt. Wubbel"}, {"id": 444, "start": 4168.58, "end": 4187.82, "text": "Wubbel Wub. Reload. Ja. So ist sie open und dann bräuchte man oder. Wieso habe ich doch."}, {"id": 445, "start": 4187.82, "end": 4197.1, "text": "Ich habe dann als Date. Und deleted als Date. Aber sagt der Chat dazu. Genau und jetzt den"}, {"id": 446, "start": 4197.1, "end": 4210.74, "text": "Restore Knopf anstatt dem. Massive. Der Chat ist wieder hier. Expanded. Mega Gehirn. Definiere"}, {"id": 447, "start": 4210.74, "end": 4214.86, "text": "verschiedene Filter für alles deleted search. Du nimmst eine Variable in der steht immer"}, {"id": 448, "start": 4214.86, "end": 4222.74, "text": "welche Filter Funktion gerade stehen. Könnte man auch machen. Ja aber das passt doch wenn"}, {"id": 449, "start": 4222.74, "end": 4228.34, "text": "das deleted ist dann ist das icon ein Restore Knopf. Das ist richtig schlau der Chat wieder"}, {"id": 450, "start": 4228.34, "end": 4237.94, "text": "hier exquisite high IQ. Way to smart Hacker Mans. Ja. Also. Gehen wir mal in to do rein."}, {"id": 451, "start": 4237.94, "end": 4242.54, "text": "Wir lassen das jetzt übrigens standardmäßig zum testen mal auf show deleted auf auf true"}, {"id": 452, "start": 4242.54, "end": 4246.9, "text": "stehen. Man könnte sich noch überlegen wenn man das umschaltet auf show deleted dass"}, {"id": 453, "start": 4246.9, "end": 4257.42, "text": "er nur die gelöschten anzeigt. Und die normalen gar nicht. Egal. Egal. So. Und jetzt tauschen"}, {"id": 454, "start": 4257.42, "end": 4264.3, "text": "wir das einfach aus. Hier ist das icon für remove. So und das icon für remove jetzt"}, {"id": 455, "start": 4264.3, "end": 4267.58, "text": "müssen wir den if machen ins Welt da bin ich mir nicht so ganz sicher wie das funktioniert"}, {"id": 456, "start": 4267.58, "end": 4285.7, "text": "irgendwie so wahrscheinlich. Aha. Wobei das if muss ja da außen drum herum. Was ganz"}, {"id": 457, "start": 4285.7, "end": 4289.66, "text": "was anderes. Warum habe ich hier überhaupt noch ein extra diff drumherum warum mache"}, {"id": 458, "start": 4289.66, "end": 4301.14, "text": "ich das click nicht auf das icon. Gebt dem Kram hier unten die classes und macht es weg."}, {"id": 459, "start": 4301.14, "end": 4310.22, "text": "Warum mache ich das nicht. Weil. Weil on click bei icon nicht funktioniert. Ja das ist ja"}, {"id": 460, "start": 4310.22, "end": 4315.58, "text": "ziemlicher pains. Genau. Und click ging ja nicht auf icon. Jetzt weiß ich wieder warum"}, {"id": 461, "start": 4315.58, "end": 4329.82, "text": "ich den Mist habe. Also brauchen wir if. So if. Das to do deleted. Dann das und ansonsten"}, {"id": 462, "start": 4329.82, "end": 4337.42, "text": "else das. Else war glaube so. Ich finde also ich weiß nicht was das für eine für eine"}, {"id": 463, "start": 4337.42, "end": 4343.22, "text": "big brain Syntax ist. Die finde ich nicht schön wenn ich ehrlich bin. Was hat er jetzt"}, {"id": 464, "start": 4343.22, "end": 4351.02, "text": "für was was will er hier von mir jetzt. Ach so weil das empty ist. Also da muss ich sagen"}, {"id": 465, "start": 4351.02, "end": 4357.66, "text": "da finde ich die Vue.js Syntax viel schöner. In Vue würdest du sowas machen. Vue if und"}, {"id": 466, "start": 4357.66, "end": 4363.94, "text": "dann würdest du sagen. Else. Das wäre das Gegenstück dazu. Ich weiß nicht was jeder"}, {"id": 467, "start": 4363.94, "end": 4371.18, "text": "schöner findet aber. Ich. Bin da jetzt auch kein all zu großer Fan von dieser Syntax"}, {"id": 468, "start": 4371.18, "end": 4386.22, "text": "ehrlich gesagt. Man erkennt schon was deleted ist. So und alles die deleted sind die kriegen"}, {"id": 469, "start": 4386.22, "end": 4396.38, "text": "ein extra Button. Die Vue Syntax findest du ganz schlimm. Ich finde die eigentlich nice."}, {"id": 470, "start": 4396.38, "end": 4410.22, "text": "Wir brauchen ein gutes Icon für Restore. Hero Icons. Gibt es dann Restore. Sowas. Ok wir"}, {"id": 471, "start": 4410.22, "end": 4417.34, "text": "machen jetzt mal Iconify. Wir suchen jetzt mal ein gutes Icon für Restore. Bros Icons."}, {"id": 472, "start": 4417.34, "end": 4430.58, "text": "Restore. Ja sowas wäre richtig gut. Such mal nach Return. Ne gibt es nicht. Sowas wäre"}, {"id": 473, "start": 4430.58, "end": 4439.74, "text": "halt richtig cool ne. Aber das passt halt vom vom Design her überhaupt nicht zu den"}, {"id": 474, "start": 4439.74, "end": 4464.66, "text": "anderen Icons. Da muss man ja schon genau sein. Re. Sowas. Ich meine. Ich finde das"}, {"id": 475, "start": 4464.66, "end": 4487.74, "text": "ist gar nicht so schlecht dafür. So. Also ich fand das fand das hier mit. Fand das"}, {"id": 476, "start": 4487.74, "end": 4504.46, "text": "eigentlich besser. Was war schöner. Der Kasten ja. So. Machen wir es mal so. So jetzt wollen"}, {"id": 477, "start": 4504.46, "end": 4512.34, "text": "wir allerdings nicht remove machen sondern. Restore to do. Übrigens allein schon dass"}, {"id": 478, "start": 4512.34, "end": 4523.26, "text": "ich hier I.D.s übergebe ist ziemlich beknackt. Weil. Ich brauche überhaupt keine I.D.s mehr."}, {"id": 479, "start": 4523.26, "end": 4539.9, "text": "Can't wait. Restore to do. Ist auch sehr einfach. Wir setzen einfach die I.D.s wieder auf. Ich"}, {"id": 480, "start": 4539.9, "end": 4565.94, "text": "glaube viel simpler kann es nicht sein. So. Oh. Ich habe es geprägt. Oh. Oh je. Äh."}, {"id": 481, "start": 4565.94, "end": 4594.02, "text": "Was habe ich gemacht. Was habe ich falsch gemacht. Das mit den I.D.s. Das mit den I.D.s"}, {"id": 482, "start": 4594.02, "end": 4600.1, "text": "ist eigentlich nichts Schlimmes. OK. I.D.s. Ich übergebe jetzt einfach eine I.D. um der"}, {"id": 483, "start": 4600.1, "end": 4620.42, "text": "I.D.s übergeben Willen. Nicht dass man das brauchen würde. Jetzt geht. Hä. K. Häh."}, {"id": 484, "start": 4620.42, "end": 4623.26, "text": "Ist das wieder die Geschichte wo ich das da eigentlich machen müsste."}, {"id": 485, "start": 4623.26, "end": 4631.18, "text": "Das ist ja hängen geblieben. Warum geht das denn mit Parametern und ohne Parameter geht"}, {"id": 486, "start": 4631.18, "end": 4640.94, "text": "das nicht. Ist ja dumm. Zack. Komm mal hier. Und sonst sind sie wieder restored. Sind"}, {"id": 487, "start": 4640.94, "end": 4658.38, "text": "sie gelöscht. Alle löschen. Bäm. Restore. Zack. Hawkchamp. Übergibt doch direkt to"}, {"id": 488, "start": 4658.38, "end": 4663.42, "text": "do. Nee ich muss da gar nichts übergeben. Es gibt nur einen to do. Deswegen die I.D.s"}, {"id": 489, "start": 4663.42, "end": 4673.9, "text": "sind eigentlich komplett unsinnig. Ja aber. Aber guck mal. Hier habe ich doch auch Klammern."}, {"id": 490, "start": 4673.9, "end": 4688.94, "text": "Da müsste er sich da nicht stören. Da kann ich nicht ausführen. So. Jetzt machen wir"}, {"id": 491, "start": 4688.94, "end": 4700.46, "text": "das hier mal wieder weg. Wo ist mein hässlicher Button. Da brauchen wir jetzt einen Switch"}, {"id": 492, "start": 4700.46, "end": 4704.38, "text": "oder so. Ach nee. Erst mal gucken was das mit den Funktionen jetzt hier auf sich hat."}, {"id": 493, "start": 4704.38, "end": 4718.7, "text": "Ich meine ganz im Ernst. Scheiß drauf. Wir machen das jetzt einfach so. To do. Delete"}, {"id": 494, "start": 4718.7, "end": 4737.98, "text": "equals false und unten drunter deleted true. Fertig. Kunst. Ich glaube das ist die deutlich"}, {"id": 495, "start": 4737.98, "end": 4749.02, "text": "einfache Variante. Oder. Oder wir würden das machen. Was der. Ich glaube ich gesagt hat."}, {"id": 496, "start": 4749.02, "end": 4759.54, "text": "Wir würden sowas machen wie Funktion toggle deleted oder sowas. Wisst ihr was. Was für"}, {"id": 497, "start": 4759.54, "end": 4767.62, "text": "extra Funktion oder in line. Also extra Funktion würde dann so aussehen. To do gleich deleted."}, {"id": 498, "start": 4767.62, "end": 4778.14, "text": "Not deleted. Aber was ich nicht was ich jetzt nicht verstehe ist. Aber wenn ich das dann"}, {"id": 499, "start": 4778.14, "end": 4785.06, "text": "einfach so reinschreiben würde ohne Klammern das würde dann gehen oder wie. Würde das"}, {"id": 500, "start": 4785.06, "end": 4794.86, "text": "jetzt funktionieren. Ach das geht jetzt oder was. Das ist quasi Pointer Pointer auf die"}, {"id": 501, "start": 4794.86, "end": 4800.38, "text": "Klammern. Und wenn ich so sage fühle das direkt aus. Aber was ist der Unterschied zwischen"}, {"id": 502, "start": 4800.38, "end": 4811.22, "text": "so mit einem Parameter oder Parameterless. Weil da müsste man auch meckern. Cannot cannot"}, {"id": 503, "start": 4811.22, "end": 4818.34, "text": "execute. Wie dem auch sei wir hinterfragen wir hinterfragen da die JavaScript Geschichte"}, {"id": 504, "start": 4818.34, "end": 4843.9, "text": "nicht weiter. Das ist jetzt einfach so. Swell Magic. Ok. Verstehe. Was denn. Macht das if"}, {"id": 505, "start": 4843.9, "end": 4849.82, "text": "über die Icons und der Button um die Icons. Ah ja ja das ist eine gute Idee. Wir machen"}, {"id": 506, "start": 4849.82, "end": 4857.3, "text": "das. Wir machen das wirklich so. Wir machen das if so. Innen drinnen. Weil das hier oben"}, {"id": 507, "start": 4857.3, "end": 4871.38, "text": "ist ja immer gleich. Wir machen das if quasi. Hier rein. Und das if hier rein. Das schmeißen"}, {"id": 508, "start": 4871.38, "end": 4879.66, "text": "wir weg. Da machen wir das. Und das. Schon wieder schon ein bisschen übersichtlicher."}, {"id": 509, "start": 4879.66, "end": 4890.86, "text": "Übrigens wir machen so das nicht alle angezeigt werden. Ich habe es mir anders überlegt."}, {"id": 510, "start": 4890.86, "end": 4902.74, "text": "Das ist zu das ist zu verwirrend. Wir sagen Show deleted. Und wenn die to do's deleted"}, {"id": 511, "start": 4902.74, "end": 4925.86, "text": "Ups. Ich will die eigentlich filtern. Ich will inzwischen umschalten können. Das ist"}, {"id": 512, "start": 4925.86, "end": 4940.58, "text": "richtig. Du machst trash icon by deleted. Warte mal. Habe ich jetzt falsch rum? Ach"}, {"id": 513, "start": 4940.58, "end": 4964.98, "text": "so. Ich habe es falsch rum ne. Das hier marscht gerade nochmal weg. Das war Blödsinn. Title."}, {"id": 514, "start": 4964.98, "end": 4983.54, "text": "Und jetzt. Das können wir so lassen. Das müssen wir nicht inline machen. Das können"}, {"id": 515, "start": 4983.54, "end": 4988.02, "text": "wir ruhig so lassen. Was jetzt halt cool wäre irgendwie wenn wir da nicht so unterschiedliche."}, {"id": 516, "start": 4988.02, "end": 4997.06, "text": "Warum braucht man das? Warum braucht man das doppelt? Könnte ich nicht. Moment. Wir checken"}, {"id": 517, "start": 4997.06, "end": 5007.18, "text": "jetzt. Moment. Wir machen jetzt big brain play. Kann man nicht einfach anstatt das hier das"}, {"id": 518, "start": 5007.18, "end": 5019.46, "text": "icon dynamisch beinden. Dass ich quasi sag icon. Moment. Ich muss mal ausprobieren."}, {"id": 519, "start": 5019.46, "end": 5031.02, "text": "Und dann. Wenn to do deleted ist. Dann machen wir hero icons das da. Und wenn das nicht"}, {"id": 520, "start": 5031.02, "end": 5042.46, "text": "deleted ist. Dann machen wir hero icons trash. Oh. Was jetzt? Ach so ich habe es nicht gequotet"}, {"id": 521, "start": 5042.46, "end": 5052.94, "text": "ich noob. Ja das funktioniert nämlich auch. Das ist dann nämlich viel kürzer und knackiger."}, {"id": 522, "start": 5052.94, "end": 5061.94, "text": "Sagen wir das noch so. Ich mein warum kann er. Ach so weil der ist eigentlich viel längerer"}, {"id": 523, "start": 5061.94, "end": 5071.42, "text": "Text ist. Ja die Sackfalte wusste es wieder. So und jetzt machen wir noch den Filter."}, {"id": 524, "start": 5071.42, "end": 5085.02, "text": "Also da muss ich jetzt binary logic. Also wenn show. Ups. Wenn show deleted ist. Dann will"}, {"id": 525, "start": 5085.02, "end": 5095.42, "text": "ich. Dann will ich checken ob das to do auch wirklich deleted ist. Nicht to do's alter."}, {"id": 526, "start": 5095.42, "end": 5103.86, "text": "So. Jetzt heißt jetzt so zeigt er nur die to do's an. Kann man umschalten die. Das ist"}, {"id": 527, "start": 5103.86, "end": 5110.1, "text": "quasi Papierkorb Ansicht jetzt. Das ist quasi Papierkorb Ansicht. Nur die die. So. Und"}, {"id": 528, "start": 5110.1, "end": 5113.1, "text": "dann machen wir die Papierkorb Ansicht wieder aus. Und dann müssen wir jetzt noch filtern."}, {"id": 529, "start": 5113.1, "end": 5135.66, "text": "Also quasi show deleted. So und jetzt können wir sagen. Oder. Oder. Ne Moment. Und. Ne."}, {"id": 530, "start": 5135.66, "end": 5146.98, "text": "Jetzt. Jetzt. Jetzt bin ich verwirrt. Dieses Reactive Label ist richtig big brain. Ich"}, {"id": 531, "start": 5146.98, "end": 5151.74, "text": "mein. Das kann es jetzt ja nicht sein. Das muss doch einfacher gehen oder. Und das funktioniert"}, {"id": 532, "start": 5151.74, "end": 5163.5, "text": "immer noch nicht. Moment meine binary logic Dinger sind gerade nicht. Hier ab vor den"}, {"id": 533, "start": 5163.5, "end": 5175.38, "text": "task. Ich will einfach switchen. Also wenn es. Nicht show deleted ist und. Das müsste"}, {"id": 534, "start": 5175.38, "end": 5201.1, "text": "doch eigentlich so funktionieren oder. Low IQ. Chat ihr müsst mir helfen. Hä? Hä?"}, {"id": 535, "start": 5201.1, "end": 5222.34, "text": "Hä? Hä? Also ich habe keine. Ich habe keine mehr die nicht gelöscht sind. Es funktioniert"}, {"id": 536, "start": 5222.34, "end": 5241.46, "text": "oder. Ich muss nur welche löschen. Ah ok. Alles klar. Hat alles funktioniert. Ok. Hier"}, {"id": 537, "start": 5241.46, "end": 5252.82, "text": "lege ich. Aber das muss doch trotzdem einfacher gehen. Ich meine was ist denn das hier. Und."}, {"id": 538, "start": 5252.82, "end": 5259.3, "text": "Und. Das. Irgendwie wieder strebt mir das. Das muss man doch einfacher schreiben können."}, {"id": 539, "start": 5259.3, "end": 5280.9, "text": "Wer ist gut in binary magic. Das ist jetzt einfach so. Könnt ihr pullrequest machen."}, {"id": 540, "start": 5280.9, "end": 5291.82, "text": "Wem es sich gefällt. So. Ja wunderbar. Das hier ist jetzt quasi die Papierkorb ansicht."}, {"id": 541, "start": 5291.82, "end": 5300.42, "text": "Das ist die Papierkorb ansicht. Guckt hier. So. Das müssen wir jetzt nur noch. Das sind"}, {"id": 542, "start": 5300.42, "end": 5305.22, "text": "jetzt alle. Das sind jetzt alle gelöscht. Die können wir jetzt einfach alle restoren."}, {"id": 543, "start": 5305.22, "end": 5312.74, "text": "Jetzt der Papierkorb leer. Ja. Ey wir müssen übrigens hier oben bei der progress Anzeige"}, {"id": 544, "start": 5312.74, "end": 5322.18, "text": "alle gelöschten rausfiltern. Guck mal sonst kann das nicht funktionieren. Das show. Not"}, {"id": 545, "start": 5322.18, "end": 5328.22, "text": "show deleted ist da unnötig. Nee wenn ich das weg mache dann würde der immer. Egal"}, {"id": 546, "start": 5328.22, "end": 5338.06, "text": "was ich was ich also wenn wenn show deleted. Quasi. Also. Auch wenn show deleted an ist"}, {"id": 547, "start": 5338.06, "end": 5349.18, "text": "würde er dann alle die nicht deleted sind anzeigen. Ohne diesen filter davor. Ich habe"}, {"id": 548, "start": 5349.18, "end": 5357.22, "text": "heute morgen gepusht. Was passiert wenn man in der Papierkorb ansicht ein neues Element"}, {"id": 549, "start": 5357.22, "end": 5367.9, "text": "hinzufügt. Dann wird ein neues Element hinzugefügt aber man sieht es nicht. Sondern man sieht"}, {"id": 550, "start": 5367.9, "end": 5378.98, "text": "es erst wenn man switcht. Ja das sind so die details. Wir brauchen noch ein Papierkorb"}, {"id": 551, "start": 5378.98, "end": 5387.58, "text": "leeren icon. Ein so richtig so richtig Papierkorb Papierkorb leeren icon. Wir machen es zum"}, {"id": 552, "start": 5387.58, "end": 5405.7, "text": "testen hier oben wieder eins. Clear. So. Und da was weiß ich. Empty Trash oder so. Show"}, {"id": 553, "start": 5405.7, "end": 5420.98, "text": "deleted gleich gleich. Ja. Du hast recht das müsste eigentlich funktionieren ja. Klingt"}, {"id": 554, "start": 5420.98, "end": 5436.46, "text": "logisch. Der Chat wieder. Hier guck mal da. Big brain time. Massives Gehirn wieder. Das"}, {"id": 555, "start": 5436.46, "end": 5444.34, "text": "liegt einfach daran dass die ganzen Prime Sub schon einfach so den Wahnsinns IQ Boost"}, {"id": 556, "start": 5444.34, "end": 5449.54, "text": "ausgelöst haben. Dass der Chat mittlerweile so viele high IQ Leute hat. Das ist einfach"}, {"id": 557, "start": 5449.54, "end": 5456.9, "text": "schon quasi von Twitch nicht mehr gehandelt werden kann. So nice. So jetzt brauchen wir"}, {"id": 558, "start": 5456.9, "end": 5463.98, "text": "noch ein True. Und jetzt brauchen wir noch einen Clear Button. Empty Empty Trash machen"}, {"id": 559, "start": 5463.98, "end": 5478.9, "text": "wir jetzt. Empty Trash. So Empty Trash heißt wir filtern alle To Do's die also To Do's"}, {"id": 560, "start": 5478.9, "end": 5494.3, "text": "Ne. To Do's gleich. To Do's. Filter. Alles was nicht. Alles was nicht deleted ist wird"}, {"id": 561, "start": 5494.3, "end": 5510.54, "text": "gelöscht. Ok. Clear. Bam. Dann können wir den Papierkorb wieder schließen. In der Papierkorb"}, {"id": 562, "start": 5510.54, "end": 5517.18, "text": "an sich könnte man das Add Icon durch ein Empty Trash. Alter. Der Chat ist ja richtig"}, {"id": 563, "start": 5517.18, "end": 5529.42, "text": "Expanded. Expanded hier heute. Das hört ja gar nicht mehr auf mit Massive Ideen hier."}, {"id": 564, "start": 5529.42, "end": 5534.86, "text": "Das ist eine super Idee. Das ist eine richtig gute Idee. Manchmal hat es echt seinen Vorteil"}, {"id": 565, "start": 5534.86, "end": 5540.02, "text": "wenn man nicht einfach alleine da ist und daran rumfrickelt. Warum muss Empty Trash Reactive"}, {"id": 566, "start": 5540.02, "end": 5547.38, "text": "sein mit den. Muss es nicht. Das hier ist die Zuordnung weil das weil To Do's ein Store"}, {"id": 567, "start": 5547.38, "end": 5560.54, "text": "ist. Und ein Store kannst du nur accessen mit dem Dollar davor oder alternativ so. Das"}, {"id": 568, "start": 5560.54, "end": 5569.14, "text": "ist die Store. Store Assign. Operator oder wie immer das heißt. Keine Ahnung. Das hat"}, {"id": 569, "start": 5569.14, "end": 5573.54, "text": "in dem Fall nichts mit Reactive zu tun. Ja das machen wir jetzt. Wenn man in Papierkorb"}, {"id": 570, "start": 5573.54, "end": 5579.98, "text": "an sich sind dann. Moment mal machen wir das mit dem Clear. Add Button. Wo ist der Add"}, {"id": 571, "start": 5579.98, "end": 5592.74, "text": "Button. Da. Wenn wir im. Gibt es denn ein schönes Papierkorb so Trash Empty. Nee gibt"}, {"id": 572, "start": 5592.74, "end": 5603.14, "text": "es nicht. Ok wir ersetzen das mal nur durch Trash. Empty. Gibt es so etwas wie Empty."}, {"id": 573, "start": 5603.14, "end": 5608.26, "text": "Recycle. Vielleicht sollten wir einfach einen anderen Icon Font nehmen der mehr Zeugs drin"}, {"id": 574, "start": 5608.26, "end": 5616.02, "text": "hat. Weil der ist schon sehr limitiert. So aber dann machen wir das doch an der Stelle"}, {"id": 575, "start": 5616.02, "end": 5628.9, "text": "mal. Das Icon ändert sich einfach entsprechend dem Status. Also wenn wir in Active. Nee Moment"}, {"id": 576, "start": 5628.9, "end": 5641.42, "text": "wie hab ich den Kram genannt. Nee nicht Search Active. Show Deleted. Also wenn wir in der"}, {"id": 577, "start": 5641.42, "end": 5646.5, "text": "Papierkorb ansicht sind. Dann machen wir ein Papierkorb Icon hin und wenn wir in der"}, {"id": 578, "start": 5646.5, "end": 5650.98, "text": "normalen ansicht sind machen wir das normale Icon hin. Probieren wir das schon mal aus"}, {"id": 579, "start": 5650.98, "end": 5660.46, "text": "ob das funktioniert. Trash. Ja. Wir sind in Papierkorb. Ich lösche mal kurz was. Wir"}, {"id": 580, "start": 5660.46, "end": 5667.66, "text": "sind in der Papierkorb ansicht. Dann ist das unten ein Clear All. Und wir sind in der normalen"}, {"id": 581, "start": 5667.66, "end": 5678.3, "text": "ansicht. Dann ist das unten ein Add. Das finde ich eigentlich relativ clever. Byte Strike"}, {"id": 582, "start": 5678.3, "end": 5694.14, "text": "alles klar. Ist das die Assembler Variante vom Papierkorb oder wie? Nee das ist irgendwas"}, {"id": 583, "start": 5694.14, "end": 5705.34, "text": "was du von Stack Overflow kopiert hast wahrscheinlich. Gehe ich jetzt einfach mal von aus. So und"}, {"id": 584, "start": 5705.34, "end": 5710.94, "text": "jetzt müssen wir noch gucken, dass je nachdem in welchem Modus wir sind, was unterschiedliches"}, {"id": 585, "start": 5710.94, "end": 5719.26, "text": "passiert. Also on click kann man. Ok das ist jetzt die Frage. Kann man hier drinnen checken?"}, {"id": 586, "start": 5719.26, "end": 5741.3, "text": "Kann man hier drinnen checken? Geht sowas? Nee wie habe ich es gerade? Empty Trash. Meint"}, {"id": 587, "start": 5741.3, "end": 5765.78, "text": "ihr das? Funzt es? Ok jetzt wenn tu du es. Nee es funktioniert nicht. Das funktioniert"}, {"id": 588, "start": 5765.78, "end": 5781.3, "text": "nicht. Ach Moment. Das ist auch falsch rum. Falsch rum. Ah. Oh das ist ja nice. Das ist"}, {"id": 589, "start": 5781.3, "end": 5791.54, "text": "ja richtig nice. Lul. Zum Programmieren bin ich quasi gezwungen Englisch zu können."}, {"id": 590, "start": 5791.54, "end": 5796.98, "text": "Nee aber es ist von Vorteil, wenn du die Sachen in deinem Source Code in Englisch schreibst."}, {"id": 591, "start": 5796.98, "end": 5803.58, "text": "Weil ansonsten hast du das Problem, wie wenn Franzosen irgendwas programmieren, dass die"}, {"id": 592, "start": 5803.58, "end": 5811.1, "text": "Variablen dann auch Französisch sind und das checkt dann keiner mehr. Ja genau. Das"}, {"id": 593, "start": 5811.1, "end": 5818.5, "text": "kommt auch noch dabei. Tutorials und Webcasts und Konferenztalks und sowas sind eigentlich"}, {"id": 594, "start": 5818.5, "end": 5826.02, "text": "auf Englisch. Aber man muss dazu sagen, es ist ein Unterschied ob du jetzt irgendwie"}, {"id": 595, "start": 5826.02, "end": 5834.1, "text": "Englisch in einem Film verstehst oder gar Englisch reden kannst mit Leuten oder ob du"}, {"id": 596, "start": 5834.1, "end": 5848.9, "text": "irgendwie IT Englisch Sachen verstehst. Also das ist nochmal ne Runde weniger anspruchsvoll."}, {"id": 597, "start": 5848.9, "end": 5855.5, "text": "Ich könnte mal wieder pushen wo wir gerade dabei sind. Ich deploy gerade mal ne Runde"}, {"id": 598, "start": 5855.5, "end": 5865.18, "text": "wieder. Ansible Playbook. Damn. Ja aber so komplett ohne Englisch sagen kommt es nicht"}, {"id": 599, "start": 5865.18, "end": 5872.36, "text": "aus. Das ist übrigens auch der Grund warum ich den Browser und mein Betriebssystem komplett"}, {"id": 600, "start": 5872.36, "end": 5877.06, "text": "auf Englisch stehen habe. Ah zwei Gründe. Erstens ist man findet Fehler deutlich einfacher."}, {"id": 601, "start": 5877.06, "end": 5881.54, "text": "Also wenn man in die Windows Settings guckt und danach irgendwas sucht, wenn man das auf"}, {"id": 602, "start": 5881.54, "end": 5885.54, "text": "Englisch sucht ist es einfach viel einfacher zu finden. Und weil es doch irgendwie Wörter"}, {"id": 603, "start": 5885.54, "end": 5893.74, "text": "gibt wo man sich halt, also auch technisch, zum Beispiel dass das Flight Mode heißt wüsste"}, {"id": 604, "start": 5893.74, "end": 5900.34, "text": "ich jetzt nicht so standardmäßig. Das ist halt dieser Wi-Fi und alles an aus Modus oder"}, {"id": 605, "start": 5900.34, "end": 5903.78, "text": "was auch immer wie die Sachen so genannt sind. Das finde ich ganz praktisch wenn man"}, {"id": 606, "start": 5903.78, "end": 5918.5, "text": "das eigentlich täglich so mitbekommt ja. So. Also jetzt haben wir hier unser Papierkopp"}, {"id": 607, "start": 5918.5, "end": 5925.42, "text": "Modus. Das ist eigentlich richtig nice. Das gefällt mir echt. Guck mal hier wir löschen"}, {"id": 608, "start": 5925.42, "end": 5931.18, "text": "den Kram jetzt, gehen in den Papierkopp Modus, können es entweder Restore oder wir löschen"}, {"id": 609, "start": 5931.18, "end": 5937.22, "text": "alles. Wir könnten vielleicht noch eine Abfrage machen. Englische Tastatur mag ich aus irgendwelchen"}, {"id": 610, "start": 5937.22, "end": 5941.54, "text": "Gründen nicht. Das kann ich nicht so genau sagen warum, aber englische Tastatur mag"}, {"id": 611, "start": 5941.54, "end": 5945.94, "text": "ich nicht. Übrigens die hier oben machen wir doch irgendwie einen Switch oder sowas"}, {"id": 612, "start": 5945.94, "end": 5961.7, "text": "ne für. Ok. F*** was wollte ich jetzt machen? Bumer Gehirn schlägt zu alter. Ne falsch hier"}, {"id": 613, "start": 5961.7, "end": 5968.9, "text": "der. Und ein Hover Info wenn man die Maus drüber hält. Ja, könnte man auch machen."}, {"id": 614, "start": 5968.9, "end": 5973.7, "text": "Ich war an den Alert wollte ich noch machen. Weil wir programmieren jetzt keinen eigenen"}, {"id": 615, "start": 5973.7, "end": 5991.58, "text": "Dialog oder? Wir können Alert machen oder Dialog auf Popup vom Browser benutzen. Also"}, {"id": 616, "start": 5991.58, "end": 5998.46, "text": "empty empty trash, Dialog, ne nicht Alert. Was ist denn das Gegenstück zu Alert mit"}, {"id": 617, "start": 5998.46, "end": 6006.22, "text": "ne Abfrage? Alert with yes no Browser. Prompt war es, Prompt, genau Prompt nicht Dialog."}, {"id": 618, "start": 6006.22, "end": 6029.74, "text": "Prompt, Message, delete all Fragezeichen. So if BAM zack. Ok ne das ist Javascript Logik"}, {"id": 619, "start": 6029.74, "end": 6049.58, "text": "die funktioniert anders. Options. Alert Prompt wurden deprecated. Tja. Confirm. Ah yes."}, {"id": 620, "start": 6049.58, "end": 6057.02, "text": "Das will ich haben. Delete all ok genau das will ich haben. So hier delete Papierkorb"}, {"id": 621, "start": 6057.02, "end": 6067.74, "text": "Ansicht. Delete all ok BAM. Confirm will ich haben. Exquisite. Ja sehr nice. Ich mein"}, {"id": 622, "start": 6067.74, "end": 6077.1, "text": "theoretisch müssten wir ja ein eigenes Overlay machen. Aber ihr wisst wie meine Poggers CSS"}, {"id": 623, "start": 6077.1, "end": 6081.3, "text": "Skills sind. Eigentlich nachdem ihr habt recht das ist deprecated. Eigentlich müssten wir"}, {"id": 624, "start": 6081.3, "end": 6094.18, "text": "ein Overlay mit Z-Index machen. Also wir müssten quasi sowas hier machen. Style Z-Index 9999"}, {"id": 625, "start": 6094.18, "end": 6102.66, "text": "oder sowas. Das probieren wir jetzt mal schnell. Komm wir machen den eigenen Dialog. Lull."}, {"id": 626, "start": 6102.66, "end": 6117.98, "text": "Glass. Wir brauchen keine Ahnung Breite Höhe. Pull. Pull. Ah ne brauchen wir nicht. Es muss"}, {"id": 627, "start": 6117.98, "end": 6124.7, "text": "absolut sein. Nein es muss fixed sein. Oder Static. Static muss es sein. Wie macht man"}, {"id": 628, "start": 6124.7, "end": 6140.7, "text": "am besten so ein Overlay. Static. Background. BG Red einfach so das man das sieht. Ok. Und"}, {"id": 629, "start": 6140.7, "end": 6159.54, "text": "jetzt right. Right Null. Top Null. Bottom Null. Left Null. Ne. Ok how to. Ah so. Nicht"}, {"id": 630, "start": 6159.54, "end": 6167.02, "text": "Static. Absolut. Oder vielleicht sogar fixed. Fixed. Ok alles klar. So wir haben ein Overlay"}, {"id": 631, "start": 6167.02, "end": 6174.58, "text": "am Start. Es war kein schönes Overlay aber wir haben ein Overlay am Start. Opacity 50."}, {"id": 632, "start": 6174.58, "end": 6180.26, "text": "Ja ok ok wir kommen der Sache schon mal näher. Jetzt kann man hier auch nicht mehr durchklicken"}, {"id": 633, "start": 6180.26, "end": 6187.86, "text": "das ist schon mal sehr schön. Ja und meine Key Events werden auch nicht mehr gecrapped."}, {"id": 634, "start": 6187.86, "end": 6202.46, "text": "So wir haben ein Overlay. Wir haben ein Overlay. Ich habe das jetzt nur rot das man es erkennt."}, {"id": 635, "start": 6202.46, "end": 6211.46, "text": "So und da drinnen bräuchten wir jetzt noch das eigentliche Dialog Fenster. Also Diff."}, {"id": 636, "start": 6211.46, "end": 6238.86, "text": "Das ist Blurry. Oh ja Blur. Blur SM. Wie macht man das Tailwind. Tailwind Blur Background."}, {"id": 637, "start": 6238.86, "end": 6264.94, "text": "Backdrop Blur. Backdrop Blur MD. Ja wie macht man das Blurry. Ok CSS Blur nicht Background"}, {"id": 638, "start": 6264.94, "end": 6274.98, "text": "Blur. Opacity. How can I make it CSS Class Blur Effect von Overlay. Aha aha. Ja genau"}, {"id": 639, "start": 6274.98, "end": 6303.74, "text": "sowas hier wollen wir haben. Backdrop Filter Blur. Also das funktioniert schon mal nett."}, {"id": 640, "start": 6303.74, "end": 6309.94, "text": "Ich habe keine Ahnung wie ich das Blurry mache. Das muss der Massive IQ Chat wissen ich weiß"}, {"id": 641, "start": 6309.94, "end": 6335.7, "text": "das nicht. Blur Overlay. Genau. Overlay. Einfach nur Blur. Filter. Filter Blur. Und"}, {"id": 642, "start": 6335.7, "end": 6353.86, "text": "dann 10px. Hey hey da macht was. Da macht was. Ich erkenne aber nicht was. Ja Moment"}, {"id": 643, "start": 6353.86, "end": 6361.46, "text": "der Blur ist nicht unten drunter sondern mein eigentlichen Background. Das ist aber nicht"}, {"id": 644, "start": 6361.46, "end": 6372.94, "text": "so Sinn und Zweck der Sache. Ich habe legit keine Ahnung wie das funktioniert. Also mit"}, {"id": 645, "start": 6372.94, "end": 6393.26, "text": "Backdrop war schon mal nichts. Backdrop. Tja Leute. Keine Ahnung. Das ist jetzt eure Aufgabe"}, {"id": 646, "start": 6393.26, "end": 6422.7, "text": "wir suchen aber CSS Set Index Blur. Ne ne ne mit Class Backdrop. Ok. Zeig her wie hat"}, {"id": 647, "start": 6422.7, "end": 6432.14, "text": "das, wie hat das gemacht. Ich erkenne da nix geblurrtes. Ich erkenne auch nix geblurrtes."}, {"id": 648, "start": 6432.14, "end": 6447.06, "text": "Der Blur muss auf das Stift drauf wo deine ganzen Hintergrund Elemente zum Blurren drauf"}, {"id": 649, "start": 6447.06, "end": 6453.9, "text": "sind. Ah. Ich müsste quasi sowas setzen wie. Ah verstehe. Ich müsste quasi sowas setzen"}, {"id": 650, "start": 6453.9, "end": 6462.18, "text": "wie Overlay aktiv. Overlay aktiv und dann müsste ich quasi sowas wie sagen wir hier"}, {"id": 651, "start": 6462.18, "end": 6477.26, "text": "auf der. Auf der Liste müsste ich dann sowas sagen wie Blur. Da muss ich sagen Diff. Diff"}, {"id": 652, "start": 6477.26, "end": 6492.54, "text": "rum rum machen. Der Twinko Moin. So und jetzt was? Style? Filter? Jetzt kommen wir jetzt"}, {"id": 653, "start": 6492.54, "end": 6499.7, "text": "hier schon. Bei so komischen CSS Dingern. Ne ne ne so funktioniert das nicht. Ne. Ach"}, {"id": 654, "start": 6499.7, "end": 6504.34, "text": "so Moment ich hab hier gar nix was angezeigt für den Lul ich kann noob. Natürlich funktioniert"}, {"id": 655, "start": 6504.34, "end": 6511.82, "text": "das guck mal. Funktioniert alles. Ich bin nur zu blöd. Funktioniert alles. Oh hier wird"}, {"id": 656, "start": 6511.82, "end": 6527.9, "text": "geblurrt. Komm her. Huge Blur. Alles klar verstehe verstehe. Ich hab kapiert wie es"}, {"id": 657, "start": 6527.9, "end": 6532.82, "text": "funktioniert. Der Chat hat aber auch immer so super advanced Feature Ideen. Kann ich"}, {"id": 658, "start": 6532.82, "end": 6551.54, "text": "Svelte Window Blur machen? Geht das? Geht. Ne. Ne. Wie Blurre ich denn die komplette Seite?"}, {"id": 659, "start": 6551.54, "end": 6579.9, "text": "Ich hab sowas wie Svelte Page oder so. Body? So vielleicht. So. Ne. Svelte Blur. Ne. Ne."}, {"id": 660, "start": 6579.9, "end": 6609.66, "text": "Svelte Blur. Body. Was? Head? Ne oder? Den Head? Ne. Svelte Blur. Body. Svelte Blur."}, {"id": 661, "start": 6609.66, "end": 6618.34, "text": "Geht das überhaupt? Lass mal eben kurz in die Sache rein. Body? Hier auf dieses Route"}, {"id": 662, "start": 6618.34, "end": 6626.06, "text": "Diff müsste eigentlich jetzt ein Style kommen. War der Blur vielleicht nur nicht sichtbar."}, {"id": 663, "start": 6626.06, "end": 6646.62, "text": "Listeners. Es ist nur Listeners. Es hat nichts zu tun mit. Ah. Oh der Chat ist wieder richtig"}, {"id": 664, "start": 6646.62, "end": 6659.22, "text": "big brain. Ok verstehe. Svelte Head. Ok ok. Svelte Head. Kann man das noch schließen"}, {"id": 665, "start": 6659.22, "end": 6678.74, "text": "irgendwie? Head. Svelte Head. Style. Body. Aha. Alter Filter. Blur. Nicht Blut. Blut"}, {"id": 666, "start": 6678.74, "end": 6689.14, "text": "Blur. 10 Pixels. Ah. Renax macht hier nichts draus ich auch nicht. So und jetzt müssen"}, {"id": 667, "start": 6689.14, "end": 6692.66, "text": "wir das ganze nur noch irgendwie dynamisch. Jetzt müssen wir das ganze nur noch dynamisch"}, {"id": 668, "start": 6692.66, "end": 6703.58, "text": "hinbekommen. Wie bekommt man das jetzt dynamisch hin? Weil ich will das ja nur anzeigen wenn"}, {"id": 669, "start": 6703.58, "end": 6715.54, "text": "der Dialog aktiv ist. Also ja Klasse setzen und löschen. Das könnte man tatsächlich"}, {"id": 670, "start": 6715.54, "end": 6733.9, "text": "machen ja. Also dass wir dann sowas machen. Body. Was ist Blur oder so? Aber jetzt wird"}, {"id": 671, "start": 6733.9, "end": 6743.58, "text": "doch auch der Dialog Blurred. Das stimmt wohl. Jetzt wird auch der Dialog Blurred. Oder?"}, {"id": 672, "start": 6743.58, "end": 6755.62, "text": "Jetzt wird auch der Dialog Blurred. Aha so einfach ist es doch nicht. Ich meine ich"}, {"id": 673, "start": 6755.62, "end": 6767.98, "text": "hätte eine richtige Noob Idee. Wir würden einfach das hier oben lassen und das da unten"}, {"id": 674, "start": 6767.98, "end": 6776.18, "text": "alles in den Diff schmeißen. Komplette Seite in den Diff. Und das machen wir wieder weg."}, {"id": 675, "start": 6776.18, "end": 6794.66, "text": "Und sagen einfach hier mal zum testen irgendwie Style. Filter Blur. 5 Pixels. So und jetzt"}, {"id": 676, "start": 6794.66, "end": 6799.3, "text": "gucken wir mal ob das Overlay ich hab da gar nichts reingeschrieben ob das Overlay überhaupt"}, {"id": 677, "start": 6799.3, "end": 6814.1, "text": "davon. Ne das Overlay passt. Nice. Ja weil hätte ich das vorher gemacht mit dem. Das"}, {"id": 678, "start": 6814.1, "end": 6827.42, "text": "probieren wir jetzt noch mal kurz aus. Hätte ich das vorher gemacht. Was war das Sveld."}, {"id": 679, "start": 6827.42, "end": 6832.02, "text": "Hätte ich das nämlich vorher gemacht dann würde der wahrscheinlich auch das Body dann"}, {"id": 680, "start": 6832.02, "end": 6839.22, "text": "würde er auch das komplette Dialogding Blurren. Der Chat hat wieder hier so anspruchsvolle"}, {"id": 681, "start": 6839.22, "end": 6844.66, "text": "Ideen. So ja genau jetzt blurrt er auch den Dialog. Alles klar ok. Ja dann müssen wir"}, {"id": 682, "start": 6844.66, "end": 6856.86, "text": "das komplett wrappen. In ein Diff. Find ich so ein bisschen doof aber ok. Gibt es da nicht"}, {"id": 683, "start": 6856.86, "end": 6863.18, "text": "einfach ein Model? Ne ich hab nichts drinne an irgendwelchen fertigen CSS Sachen. Müssen"}, {"id": 684, "start": 6863.18, "end": 6879.9, "text": "wir alles selbst bauen. Dann wär das ja easy. Dann wär das ja easy. Ah der legt immer noch"}, {"id": 685, "start": 6879.9, "end": 6894.18, "text": "Sachen an. Ok widmen wir uns der Sache gleich. So jetzt haben wir ein Overlay. Wie triggern"}, {"id": 686, "start": 6894.18, "end": 6901.9, "text": "wir das Overlay überhaupt. Wir wollten. Sekunde ich bin grad viel. Das Overlay soll passieren"}, {"id": 687, "start": 6901.9, "end": 6910.98, "text": "wenn man auf den Button zum to do. Also anstatt des confirms das eigene Overlay. Gibt es"}, {"id": 688, "start": 6910.98, "end": 6921.42, "text": "nicht Standard HTML Element für Models inzwischen. Keine Ahnung ob sowas gibt. Nö anscheinend"}, {"id": 689, "start": 6921.42, "end": 6940.82, "text": "nicht. Die machen Diff und CSS Stellz. Nö. Nö nö nö. Gibt es anscheinend nicht. So"}, {"id": 690, "start": 6940.82, "end": 6954.62, "text": "wir wollen das öffnen. An der Stelle wo. Hier. If confirmed. Das ist aber schon ein"}, {"id": 691, "start": 6954.62, "end": 6960.46, "text": "bisschen eklig da müssen wir da ne eigene Komponente oder so draus machen. Also empty"}, {"id": 692, "start": 6960.46, "end": 6977.18, "text": "trash. Click. Mozilla Element Dialog. Ok wenn Mozilla weiß da Bescheid. Also. Das ist doch"}, {"id": 693, "start": 6977.18, "end": 6982.7, "text": "bestimmt einfach nur so Syntaktik Ding was eigentlich gar nichts macht oder. Die haben"}, {"id": 694, "start": 6982.7, "end": 6986.58, "text": "doch jede Menge Sachen eingeführt in HTML die einfach nur Syntaktisch sind und eigentlich"}, {"id": 695, "start": 6986.58, "end": 6992.58, "text": "gar nichts ändert. So was für navigations bar Artikel und sonst was die eigentlich nur"}, {"id": 696, "start": 6992.58, "end": 6999.94, "text": "für die Optik sind und nichts machen. Aber mal gucken vielleicht ist das so. Haben die"}, {"id": 697, "start": 6999.94, "end": 7019.06, "text": "was zum ausführen. Aha das einer irgendwelche. Ja genau der hat der hat der hat eine Komponente"}, {"id": 698, "start": 7019.06, "end": 7026.58, "text": "dafür. Ja ja auf die auf die Idee wäre ich auch gekommen jetzt schon. Und hier unten"}, {"id": 699, "start": 7026.58, "end": 7045.38, "text": "machen sie was. Da gibt es. Da gibt es wirklich irgendwas fertiges dafür schon. Tiger Chat"}, {"id": 700, "start": 7045.38, "end": 7057.62, "text": "ja habe ich geändert. Das muss ich jetzt mal ausprobieren. Das wusste ich gar nicht"}, {"id": 701, "start": 7057.62, "end": 7065.9, "text": "dass es so was gibt. Ok das Copy Paste wieder jetzt einfach rein. Allerdings ohne irgendwas"}, {"id": 702, "start": 7065.9, "end": 7077.3, "text": "soll einfach nur hier Dialog Kekwe. Guck mal das wird standardmäßig nicht nicht gezeigt."}, {"id": 703, "start": 7077.3, "end": 7084.18, "text": "Document Get Element ich meine das ist sicherlich nicht die Welt Art. Aber wir können schlecht"}, {"id": 704, "start": 7084.18, "end": 7091.34, "text": "da jetzt irgendwas komplizierteres drum bauen. So und dann triggern die das so. Das ist bestimmt"}, {"id": 705, "start": 7091.34, "end": 7101.46, "text": "nicht bei allen wetten mobile Safari wetten mobile Safari und supporte das nicht. Komm"}, {"id": 706, "start": 7101.46, "end": 7126.38, "text": "mal da. Richtig Park. Wenn das geht nicht mobile. Mobile Safari Alter. Mobile Safari"}, {"id": 707, "start": 7126.38, "end": 7132.42, "text": "kann nix. Ok Firefox kann es auch nicht. Das ist Internet Explorer nix kann. Ok ok ok das"}, {"id": 708, "start": 7132.42, "end": 7143.1, "text": "lasse ich mir gefallen. Ok das ist nix wo man sich darauf verlassen kann dass es da"}, {"id": 709, "start": 7143.1, "end": 7152.18, "text": "ist. Ja unter IOS da habe ich ja mal ein Video zugemacht das fand ich lustig. Safari da"}, {"id": 710, "start": 7152.18, "end": 7156.54, "text": "haben die Leute gesagt Max das stimmt nicht was du sagst die haben einfach hier ich hatte"}, {"id": 711, "start": 7156.54, "end": 7162.58, "text": "dazu ein Video gemacht. Chrome auf IOS existiert nicht. Ja ein bisschen klickt bei den Titel"}, {"id": 712, "start": 7162.58, "end": 7166.74, "text": "aber ok. Und da waren wirklich müsst ihr mal durchgucken sind Leute in die Kommentare"}, {"id": 713, "start": 7166.74, "end": 7171.82, "text": "die sagen Max das stimmt nicht. Ich meine ich erzähle einfach das komplette Video so"}, {"id": 714, "start": 7171.82, "end": 7176.58, "text": "wie es ist ich zeige sogar glaube ich ich habe nicht sogar Links auf die Apple Guidelines"}, {"id": 715, "start": 7176.58, "end": 7185.14, "text": "oder. Was ist denn das eigentlich für Anzeige da unten. Was haben wir haben wir irgendwelche"}, {"id": 716, "start": 7185.14, "end": 7190.54, "text": "komischen YouTube Plugins oder sowas. Warum sieht die Seite so komisch aus. Warum kann"}, {"id": 717, "start": 7190.54, "end": 7201.94, "text": "ich warum kann ich die Videobeschreibung nicht aufmachen. Das neue Design. Also wie gesagt"}, {"id": 718, "start": 7201.94, "end": 7207.26, "text": "ich habe da glaube ich sogar Apple Entwickler Richtlinien irgendwie drinne gezeigt wo das"}, {"id": 719, "start": 7207.26, "end": 7214.38, "text": "wo das hier. Wo das drin steht Store Guidelines und sowas. Ich habe das sogar gezeigt im Video"}, {"id": 720, "start": 7214.38, "end": 7219.54, "text": "und die Leute schreiben trotzdem in den Kommentaren ne ne ne das ist nicht so. Also ich habe"}, {"id": 721, "start": 7219.54, "end": 7225.58, "text": "Firefox installiert auf meinem iPhone. Das ganze Video geht darüber dass Firefox nicht"}, {"id": 722, "start": 7225.58, "end": 7229.74, "text": "Firefox ist sondern eigentlich Safari. Aber die Leute checken es wieder nicht. Nein nein"}, {"id": 723, "start": 7229.74, "end": 7235.98, "text": "ich habe Safari installiert bei mir auf dem iPhone. Die lecken richtig huge critical information."}, {"id": 724, "start": 7235.98, "end": 7244.5, "text": "Aber aber aber extrem critical information lecken sie. Übrigens zum Thema dumme Leute"}, {"id": 725, "start": 7244.5, "end": 7254.74, "text": "auf YouTube. Es hat mich ja wieder fertig gemacht. Wenn man sich die Kommentare hier"}, {"id": 726, "start": 7254.74, "end": 7262.26, "text": "teilweise durchliest. Egal ich will es nicht davon anfangen. Aber die Leute waren so richtig"}, {"id": 727, "start": 7262.26, "end": 7271.9, "text": "abgedreht. Pepega wieder im Kopf. Unglaublich. Also wo sind wir jetzt. Wo sind wir stehen"}, {"id": 728, "start": 7271.9, "end": 7280.34, "text": "geblieben. Wir wollten den Dialog ansteigen. Let's show. Das ist rein zu rein zu Übungszwecken"}, {"id": 729, "start": 7280.34, "end": 7286.3, "text": "hier jetzt. Ich würde das wahrscheinlich normalerweise nicht so implementieren. So"}, {"id": 730, "start": 7286.3, "end": 7294.42, "text": "Show Dialog. Der wird nur angezeigt. Also das ist mit Vue schon. Guck mal in Vue würde"}, {"id": 731, "start": 7294.42, "end": 7303.06, "text": "ich jetzt so machen. Vue if Show Dialog fertig. Aber geht nicht. Also müssen wir jetzt nicht"}, {"id": 732, "start": 7303.06, "end": 7318.94, "text": "dieses komische if wieder machen. If. If. Show Dialog. So. Und wenn wir jetzt auf"}, {"id": 733, "start": 7318.94, "end": 7332.86, "text": "Clear drücken. Empty Trash. Kommt jetzt Show Dialog gleich True. Zack und jetzt geht der"}, {"id": 734, "start": 7332.86, "end": 7338.9, "text": "Dialog an. Sehr gut. Das mache als eigene Komponente aber. Hast du Lieblings UI Komponent"}, {"id": 735, "start": 7338.9, "end": 7344.62, "text": "Leibniz? Ja. Das womit ich fast alles gemacht habe. Nachdem mir das übrigens auch mal"}, {"id": 736, "start": 7344.62, "end": 7349.3, "text": "jemand im Stream vor 2 Jahren oder so oder 3 Jahren empfohlen hat. Ich habe fast alles"}, {"id": 737, "start": 7349.3, "end": 7355.42, "text": "was ich danach irgendwie halbwegs ernsthaft gemacht habe damit gemacht. Einfach weil es"}, {"id": 738, "start": 7355.42, "end": 7359.5, "text": "easy ist und ich hauptsächlich die Sachen in Vue gemacht habe. Der Preis Champ ist beispielsweise"}, {"id": 739, "start": 7359.5, "end": 7364.18, "text": "auch Vutify. Obwohl man das eigentlich, wenn man mal ehrlich ist, eigentlich überhaupt"}, {"id": 740, "start": 7364.18, "end": 7367.94, "text": "nicht braucht für so eine Seite. Wozu brauche ich irgendein komisches Komponent Framework"}, {"id": 741, "start": 7367.94, "end": 7375.46, "text": "für eine Seite die ein paar Icons hat. Ja. Aber zum Beispiel hier das Overlay. Das Overlay"}, {"id": 742, "start": 7375.46, "end": 7385.74, "text": "habe ich mit Vue gemacht. Easy. Ja. So. Programmiere den Scheiß mal selbst. Guck mal das macht"}, {"id": 743, "start": 7385.74, "end": 7391.02, "text": "sogar den Hintergrund dunkler. Und auch das hier oben den Filter und sowas."}, {"id": 744, "start": 7391.02, "end": 7407.5, "text": "So. Aber wir sind ja gerade am üben. Deswegen machen wir das jetzt selbst. Also hier wird"}, {"id": 745, "start": 7407.5, "end": 7412.9, "text": "der Dialog angezeigt. Okay. Der ist im Hintergrund. So und jetzt müssen wir das noch blurren."}, {"id": 746, "start": 7412.9, "end": 7425.7, "text": "Also Style. Brauchen wir Style. Style. Blur. Filter. Blur. Was haben wir gesagt? 5 Pixel"}, {"id": 747, "start": 7425.7, "end": 7440.38, "text": "oder so. So. Und das machen wir nur. Glass. Blur. Wenn. Wenn Dialog. Ach ne wir müssen"}, {"id": 748, "start": 7440.38, "end": 7447.58, "text": "das so machen. Wenn Dialog. Show Dialog ist. Also. Zack. Und es ist geblurrt. Massive."}, {"id": 749, "start": 7447.58, "end": 7460.22, "text": "Huge. Blur Logic. Warum ist das Icon auf einmal da oben? Warum ist das Icon jetzt da oben?"}, {"id": 750, "start": 7460.22, "end": 7464.74, "text": "Chat. Ich sehe es genau das das Icon da oben ist. Was macht es da oben? Das darf da nicht"}, {"id": 751, "start": 7464.74, "end": 7475.7, "text": "oben sein. Warum ist das da oben jetzt? Man erkennt es kaum aber es ist da oben. Ich sehe"}, {"id": 752, "start": 7475.7, "end": 7485.5, "text": "es genau. So Dialog. Da brauchen wir jetzt noch ein Button drauf. Button. Close. So und"}, {"id": 753, "start": 7485.5, "end": 7495.18, "text": "Close. On. Click. On. Click. Wollen wir jetzt einfach machen irgendwie Show. Vielleicht"}, {"id": 754, "start": 7495.18, "end": 7511.38, "text": "Falls. So. Close. Hä? Was ist das? Moment. Was haben wir bei dem Icon irgendwelchen Blödsinn"}, {"id": 755, "start": 7511.38, "end": 7522.1, "text": "drin stehen? Fix. Vielleicht ist es das. Vielleicht muss ich es absolut machen. Keine Ahnung."}, {"id": 756, "start": 7522.1, "end": 7539.42, "text": "CSS Kickweight. Kein Schimmer. Keine Ahnung was das für Schmerzen hat. Chain of Plague"}, {"id": 757, "start": 7539.42, "end": 7544.86, "text": "nicht so ein Blödsinn. Du kennst die Antwort doch genau. Du schreibst das nur, dass du"}, {"id": 758, "start": 7544.86, "end": 7552.58, "text": "Ausrufezeichen Frage machen kannst. Meinst du ich erkenne das nicht oder was? Das ist"}, {"id": 759, "start": 7552.58, "end": 7562.74, "text": "der Chebat Versuch wieder. So Show und Dialog. Wir ignorieren jetzt mal, dass dieser Button"}, {"id": 760, "start": 7562.74, "end": 7573.54, "text": "dort auf einmal an einer Stelle ist wo er eigentlich gar nicht hin sollte. Was macht"}, {"id": 761, "start": 7573.54, "end": 7578.54, "text": "dieser hässliche Button da? Gut. Und jetzt brauchen wir da drin eine Abfrage. Also dass"}, {"id": 762, "start": 7578.54, "end": 7584.26, "text": "es rot ist, das ist ja nur, dass ich sehe, dass es über die gesamte Seite drüber geht."}, {"id": 763, "start": 7584.26, "end": 7595.86, "text": "So und jetzt machen wir Show-Dialog standardmäßig auf True, dass ich die Übersicht habe. Okay."}, {"id": 764, "start": 7595.86, "end": 7602.02, "text": "So und jetzt brauchen wir irgendwie einen Dialog, der nicht mega hässlich aussieht."}, {"id": 765, "start": 7602.02, "end": 7609.3, "text": "Okay? Also huge CSS-Skills jetzt wieder Leute. Also was machen wir da? Also wir machen erstmal"}, {"id": 766, "start": 7609.3, "end": 7627.7, "text": "Red. Wir machen erstmal weg. Das hier. Gut. Okay. Also. Class. Keine Ahnung. Höhe 40,"}, {"id": 767, "start": 7627.7, "end": 7649.86, "text": "Seite 40. So. Background. Background-Color. So. Rounded. So. Absolute. Und wie kriege"}, {"id": 768, "start": 7649.86, "end": 7663.1, "text": "ich das jetzt in die Mitte? Tailwind-Center-Element-Middle-Page. So. Das ist bestimmt irgendwie Translate oder"}, {"id": 769, "start": 7663.1, "end": 7669.5, "text": "sowas. Nee, nee, nicht Margin und Padding. Es gibt so ein Trick mit Translate irgendwie."}, {"id": 770, "start": 7669.5, "end": 7695.78, "text": "Was? Margin-Left-Auto-Auto. Wirklich? Das geht? Margin. Auto. Nee. Ja. Okay. Nee, das"}, {"id": 771, "start": 7695.78, "end": 7702.1, "text": "ging mir was mit Translate. Der Unterschied zu Bootstrap und Tailwind ist, Bootstrap ist"}, {"id": 772, "start": 7702.1, "end": 7706.38, "text": "fertig, hat fertige Komponenten wie Buttons und sonst was. Tailwind ist eigentlich bloß"}, {"id": 773, "start": 7706.38, "end": 7718.34, "text": "so ein Helper für Inline-Styles. War das nicht Translate? Translate? Irgendwie eins"}, {"id": 774, "start": 7718.34, "end": 7736.38, "text": "von zwei oder irgendwie sowas? Oh nee, Alter. Nee. Nee, nee, nee. Centered-Page. Centered-Content."}, {"id": 775, "start": 7736.38, "end": 7754.22, "text": "Jawoll, zeig her. Ne, nee, nee, nee. Ne, nee, nee. CSS-Center-Absolute-Middle. War"}, {"id": 776, "start": 7754.22, "end": 7775.58, "text": "da irgendwas mit Translate? Ah ja. Alter, das ist schon wieder megakompliziert. Top."}, {"id": 777, "start": 7775.58, "end": 7803.58, "text": "Ach, Moment. Nee, nee, Moment, Moment. Wir können das doch so machen. Wir können das"}, {"id": 778, "start": 7803.58, "end": 7818.06, "text": "doch so machen. Center? Was war das andere? Align? Align-Middle? Nee. Wie kriege ich den"}, {"id": 779, "start": 7818.06, "end": 7834.34, "text": "Mist jetzt in die Mitte? Item-Center ist da schon mal ganz gut. Chat-CSS-Big-Brainer-Justify-Center."}, {"id": 780, "start": 7834.34, "end": 7854.58, "text": "Was war das? Ah. Chat wieder next level hier. Okay. Gut. Text-Cray-100? Okay. Richtig."}, {"id": 781, "start": 7854.58, "end": 7865.34, "text": "Shadow. Drop. Pass mal auf hier. Drop. Shadow. Nee. Shadow? Deutlich, ich erkenne da kein"}, {"id": 782, "start": 7865.34, "end": 7893.9, "text": "Shadow. Erkennt jeder was? Shadow. Shadow-Black. Shadow. XL. Ah. Ah. Ah. Ah. Ah. Ah. Ah."}, {"id": 783, "start": 7893.9, "end": 7912.7, "text": "Ah. Massive-Shadow. Wie mache ich denn den Shadow jetzt ein bisschen weniger aufdringlich?"}, {"id": 784, "start": 7912.7, "end": 7930.22, "text": "Wie mache ich denn den Shadow ein bisschen weniger aufdringlich? Box-Shadow? Shadow?"}, {"id": 785, "start": 7930.22, "end": 7941.54, "text": "Das ist Box-Shadow? Okay. Drop-Shadow. Was ist der Unterschied zwischen Drop-Shadow"}, {"id": 786, "start": 7941.54, "end": 7949.34, "text": "und Box-Shadow? Leute, ich erkenne legit zwischen diesen Bildern keinen Unterschied. Ich sehe"}, {"id": 787, "start": 7949.34, "end": 7958.74, "text": "zwischen diesen Bildern absolut keinen Unterschied. Ach ja, stimmt. Ich habe immer noch Dark-Reader"}, {"id": 788, "start": 7958.74, "end": 7966.7, "text": "an. Der war schon dumm. Richtig dumm. Richtig hängen geblieben bei mir wieder. So. Drop-Shadow."}, {"id": 789, "start": 7966.7, "end": 7980.82, "text": "Drop-Shadow ist viel besser. Drop-Shadow-MB. Der erkenne ich. Hat das jetzt, hat das irgendwas"}, {"id": 790, "start": 7980.82, "end": 7990.5, "text": "im Hintergrund jetzt? Ja. Tatsächlich. Leute. Tatsächlich. Ich sehe es. Ich sehe es. So,"}, {"id": 791, "start": 7990.5, "end": 8013.78, "text": "wie macht man die, wie macht man die Color? Invert. Was? Invert? Bäh. Äh, kann man die"}, {"id": 792, "start": 8013.78, "end": 8036.18, "text": "Farbe irgendwie ändern? Ja. Aha, jetzt erkennt man was. Richtig Massive-Shadow hier. Sieht"}, {"id": 793, "start": 8036.18, "end": 8046.06, "text": "aber auch kacke aus. Wisst ihr was? Ignorieren wir jetzt erstmal. Ähm, denn wir haben wichtiges"}, {"id": 794, "start": 8046.06, "end": 8051.86, "text": "zu tun. Wir müssen ein ordentliches, ein ordentliches Dialog, eine ordentliche Dialog-Box. Kann"}, {"id": 795, "start": 8051.86, "end": 8059.22, "text": "man sagen, voll? Oh, das ist ein bisschen sehr, bisschen sehr groß. Ähm. Aber trinken"}, {"id": 796, "start": 8059.22, "end": 8068.94, "text": "wir mal was. Okay. Also. Jetzt haben wir eine, jetzt haben wir eine Dialog-Box. Breite. Breite"}, {"id": 797, "start": 8068.94, "end": 8076.86, "text": "50% von der Seite. Eins. Weil dann, guck mal, dann scaled nämlich unsere Dialog-Box. Seht"}, {"id": 798, "start": 8076.86, "end": 8088.58, "text": "ihr das? Huge scaling. Oh. Ah, sorry. Epilepsy-Warnung hier wieder. Jetzt scaled. Guck mal. Bleibt"}, {"id": 799, "start": 8088.58, "end": 8097.06, "text": "immer damit. Jetzt scaled unsere Dialog-Box mit. So, Höhe ist okay, denke ich. So. Also."}, {"id": 800, "start": 8097.06, "end": 8105.74, "text": "Da drinnen brauchen wir jetzt einmal einen Titel. Ähm, was weiß ich. Äh, Titel ist"}, {"id": 801, "start": 8105.74, "end": 8119.34, "text": "Delete. Oder ne, wir machen. Wie heißt denn das unter Windows? Empty Trash? Wie heißt"}, {"id": 802, "start": 8119.34, "end": 8131.98, "text": "Papierkorb leeren? Empty Recycle Bin. Empty. Empty Trash. Was ist Clear oder Empty? Clear"}, {"id": 803, "start": 8131.98, "end": 8144.18, "text": "Trash. Wie heißt Clear Trash? Fragezeichen. Äh, äh, äh, äh, was? Ach so. Bin ja auch"}, {"id": 804, "start": 8144.18, "end": 8155.1, "text": "blöd. Muss ja da rein. So, Clear Trash. So, dann braucht das noch irgendwie Padding oder"}, {"id": 805, "start": 8155.1, "end": 8161.42, "text": "sowas. Ich kann mir immer noch nicht den Unterschied merken zwischen Padding und Margin. Padding"}, {"id": 806, "start": 8161.42, "end": 8167.54, "text": "ist in, Margin ist nach außen. War das so? Padding ist nach in und Margin ist das, was"}, {"id": 807, "start": 8167.54, "end": 8177.38, "text": "es nach außen hat. So, Clear Trash? Fragezeichen. Plus gleich Text. Wobei Text haben wir schon"}, {"id": 808, "start": 8177.38, "end": 8192.3, "text": "gesessen. Haben irgendwie Text Bold. Ne, das ist Font. Also Font Dick. Und, ähm, Titel"}, {"id": 809, "start": 8192.3, "end": 8202.66, "text": "oder so. Ich hab doch Tailwind Typography installiert. Das heißt ich kann jetzt sowas"}, {"id": 810, "start": 8202.66, "end": 8217.22, "text": "wie H1 verwenden, oder? Ne. Hab ich nicht? Hab ich nicht? Tailwind. Tailwind Textformatierungsgeschiss"}, {"id": 811, "start": 8217.22, "end": 8229.26, "text": "installiert. Nein, hab ich nicht. Ok. Da muss ich selbst machen. Also Clear Trash? Fragezeichen."}, {"id": 812, "start": 8229.26, "end": 8243.14, "text": "Wie macht man denn jetzt eine Überschrift hübsch, sodass man die sieht? Unterschied"}, {"id": 813, "start": 8243.14, "end": 8246.86, "text": "ist wichtig, wenn du mit Borders arbeitest. So advanced bin ich ja nicht. Wobei wir können"}, {"id": 814, "start": 8246.86, "end": 8250.3, "text": "da noch einen Border drumherum machen. Ich glaube das wird gar nicht so schlecht aussehen,"}, {"id": 815, "start": 8250.3, "end": 8268.22, "text": "wenn wir noch einen Border drumherum machen. Border? Border? Cray? Äh. Ach Quatsch. Ich"}, {"id": 816, "start": 8268.22, "end": 8291.74, "text": "bin auf dem falschen Element. Hier. Ja. So. Massive Box. Mach den pink. Das ist ne gute"}, {"id": 817, "start": 8291.74, "end": 8298.34, "text": "Idee. Weil, das soll ja ins Auge staschen. Was haben wir? Pink 600 hatten wir bei den"}, {"id": 818, "start": 8298.34, "end": 8321.62, "text": "anderen. Ja. Clear Trash. Ok. Button. Icon. Das triggert mich, dass man auf den Icons"}, {"id": 819, "start": 8321.62, "end": 8339.86, "text": "keine on Clicks binden kann. Icon. Shadow auch pink. Ja ich bin nicht in der Lage die"}, {"id": 820, "start": 8339.86, "end": 8353.62, "text": "Shadowfarbe gescheit zu ändern. Der Shadow ist jetzt schwarz. Ok also Icon. Ne wir brauchen"}, {"id": 821, "start": 8353.62, "end": 8360.34, "text": "kein Icon. Wir machen einfach yes no oder? Wo haben wir denn unseren Button hier oben?"}, {"id": 822, "start": 8360.34, "end": 8381.22, "text": "Den kopiere ich mir jetzt einfach. Wo ist unser Big Brain Button? Da. Was? Das Leerzeichen."}, {"id": 823, "start": 8381.22, "end": 8390.86, "text": "Ja ich weiß das ist das allerwichtigste jetzt. Ich bin ja vollkommen falsch wo ich das rein"}, {"id": 824, "start": 8390.86, "end": 8416.9, "text": "copy paste the top. Keg weight. Jawoll. Guck mal da ist unser Button. Huge. So. Button. Und"}, {"id": 825, "start": 8416.9, "end": 8431.34, "text": "so. Huge. Ganz ganz tolle Buttons. Class. Oho guckt euch mal an hier. Und jetzt können"}, {"id": 826, "start": 8431.34, "end": 8448.46, "text": "wir sagen. So wie kann ich die Dinger jetzt sagen? Space around oder so? Around? Ne. Between"}, {"id": 827, "start": 8448.46, "end": 8462.5, "text": "oder sowas? Oh ne keine Ahnung. Ich will das die Dinger links und rechts sind. Angel does"}, {"id": 828, "start": 8462.5, "end": 8480.54, "text": "it again. Genau. Ah ich bin im falschen. Ja bin ich tatsächlich. Justify. Ja genau das"}, {"id": 829, "start": 8480.54, "end": 8486.02, "text": "habe ich. Das habe ich gesucht. So wir könnten die Höhe eigentlich noch weg machen da ist"}, {"id": 830, "start": 8486.02, "end": 8492.18, "text": "es nämlich nur so groß wie es sein muss. Clear trash. Guck mal das sieht doch jetzt"}, {"id": 831, "start": 8492.18, "end": 8504.9, "text": "schon gar nicht so beschissen mehr aus. Even sieht besser aus. Ja hast recht. Guck mal"}, {"id": 832, "start": 8504.9, "end": 8513.3, "text": "das sieht gar nicht mehr so schlecht aus jetzt. Das machen wir zu einer extra component. Genau."}, {"id": 833, "start": 8513.3, "end": 8517.5, "text": "Clear trash. Yes no. Es passiert jetzt natürlich noch nichts wenn man draufklickt. Guck mal"}, {"id": 834, "start": 8517.5, "end": 8523.02, "text": "seht ihr sogar dieses Highlight von dem Button. Alter ist das poggers. Übrigens mein Drop"}, {"id": 835, "start": 8523.02, "end": 8538.34, "text": "Shadow. Mein Drop Shadow ist kaputt wenn man das movet. Den Drop Shadow machen wir weg."}, {"id": 836, "start": 8538.34, "end": 8547.54, "text": "Drop Shadow. Wo ist der Drop Shadow überhaupt? Aber es sieht schon cooler aus mit Drop Shadow."}, {"id": 837, "start": 8547.54, "end": 8564.74, "text": "Wie sieht es mit normalem Shadow aus? Shadow. Shadow SM. Naja. Naja. Ich weiß ja nicht."}, {"id": 838, "start": 8564.74, "end": 8589.82, "text": "Oh ist gar nicht schlecht. So ist es gar nicht schlecht. Das ist gar nicht mal so übel"}, {"id": 839, "start": 8589.82, "end": 8614.42, "text": "wie es jetzt ist. Den Shadow auch pink? Guck mal mal. Ach so. Nein. Den Shadow war nicht"}, {"id": 840, "start": 8614.42, "end": 8623.86, "text": "pink. So. Aber so. Das ist gar nicht mal so schlecht. Guck mal. Das geht sogar. Das ist"}, {"id": 841, "start": 8623.86, "end": 8630.94, "text": "nicht übel. Das lassen wir jetzt so. So. Aber natürlich nicht yes no. Da kommt ein"}, {"id": 842, "start": 8630.94, "end": 8640.62, "text": "anderes Icon hin. Das gibt es dann besser. Accept oder so. Ne. Yes. Tja. Was haben die"}, {"id": 843, "start": 8640.62, "end": 8669.78, "text": "für Icons für yes or no? Ok. Sign? Ah. Checkmark? Ne. Yes. Ok. Ok. Ok. Ok. Ok. Ok. Ok."}, {"id": 844, "start": 8669.78, "end": 8684.26, "text": "Ja. Hey das ist gar nicht so schlecht. Check. Badge. Badge. Leute. Sollte. Sollte neues"}, {"id": 845, "start": 8684.26, "end": 8694.34, "text": "Emote werden. Badge. Clipboard. Badge. Check. Check Circle. Ok. Yes. Und das andere ist."}, {"id": 846, "start": 8694.34, "end": 8718.42, "text": "Deny? Ne. Close. Boah. Cross? Was? X-Circle? Seriously? X-Circle. Alter da werde ich einem"}, {"id": 847, "start": 8718.42, "end": 8727.82, "text": "Liebenden drauf kommen, dass es X-Circle heißt. X-Circle. Leute. Soll ich euch mal was sagen?"}, {"id": 848, "start": 8727.82, "end": 8734.74, "text": "Das sieht gar nicht so beschissen mehr aus. Das ist. Das ist. Das ist durchaus in Ordnung"}, {"id": 849, "start": 8734.74, "end": 8744.3, "text": "finde ich jetzt. Clear Trash? Yes. No. Das ist wirklich ganz ok. Wie sieht es im Fullscreen"}, {"id": 850, "start": 8744.3, "end": 8756.54, "text": "aus? Genau so. Naja. Bisschen breiter. Hat das schon eine Animation? Nein. Ähm. Die"}, {"id": 851, "start": 8756.54, "end": 8764.62, "text": "Sache ist plus die. Soll das überhaupt mitskalieren Leute? Soll das mitskalieren? Das sieht ziemlich"}, {"id": 852, "start": 8764.62, "end": 8774.22, "text": "unsinnig aus oder? Wenn das. Wenn das mitskaliert. Clear Trash noch Centern. Ja. Ok. Ok. Ok."}, {"id": 853, "start": 8774.22, "end": 8784.78, "text": "Ähm. Vielleicht. Vielleicht Centern wir das. Vielleicht. Warum lassen wir es nicht einfach"}, {"id": 854, "start": 8784.78, "end": 8795.98, "text": "so Leute? Oder was ist denn wenn wir die Breite ganz weg machen? Ja. Was haltet ihr denn davon?"}, {"id": 855, "start": 8795.98, "end": 8808.5, "text": "Das ist doch ok. Muss das muss die Überschrift mittig sein ja? Sehe ich das sehe ich das"}, {"id": 856, "start": 8808.5, "end": 8816.98, "text": "richtig? Überschrift muss. Wie kriege ich wie kriege ich denn die Überschrift jetzt"}, {"id": 857, "start": 8816.98, "end": 8839.38, "text": "mittig? Center. Was? Align Center. Center. Text Center. Ist das jetzt ist das jetzt besser?"}, {"id": 858, "start": 8839.38, "end": 8847.74, "text": "Ok. Dann machen wir noch Padding hier. Sowas? Chat. Jetzt kann man doch nichts mehr sagen"}, {"id": 859, "start": 8847.74, "end": 8869.1, "text": "oder? Jetzt ist es doch richtig. Ne? Ja wie? Ne. Ok P2. So. Ne so ist das gut."}, {"id": 860, "start": 8869.1, "end": 8884.26, "text": "So. Lassen wir das jetzt. Clear Trash. Yes. No. Perfekt. Poggers. Poggers. Ok. Yes. No."}, {"id": 861, "start": 8884.26, "end": 8891.86, "text": "Ehrlich gesagt ist mir egal was wir klicken. Wir machen einfach egal was und klick das"}, {"id": 862, "start": 8891.86, "end": 8909.5, "text": "jetzt ja nur zum testen. Show. Ne das müssen wir. Show. Dialog. Gleich Falls. Logsby danke"}, {"id": 863, "start": 8909.5, "end": 8924.58, "text": "für den Sub. Warum warum schließt sich das jetzt nicht? Ach so weil ich wieder die übliche"}, {"id": 864, "start": 8924.58, "end": 8938.06, "text": "Geschichte nicht gemacht habe. Das ist aber auch echt hart und intuitiv. Gut. Excellent."}, {"id": 865, "start": 8938.06, "end": 8945.74, "text": "Guck mal hier. Ist das nicht Pog? Alter. Huge. Guck mal hier. Wie cool das jetzt aufbloppt."}, {"id": 866, "start": 8945.74, "end": 8951.74, "text": "So und jetzt braucht es noch eine Animation beim aufploppen. Obbei braucht das eine Animation"}, {"id": 867, "start": 8951.74, "end": 8962.3, "text": "beim aufploppen? Wir könnten opacity irgendwie. Boah da weiß ich nicht wie das geht. Das"}, {"id": 868, "start": 8962.3, "end": 8970.22, "text": "geht irgendwie. Translate. Was? Yes. No. Ne. Das geht. Also man kann man kann so eine"}, {"id": 869, "start": 8970.22, "end": 8975.94, "text": "so eine Einfader Animation machen. Da bin ich mir jetzt aber ehrlich gesagt nicht ganz"}, {"id": 870, "start": 8975.94, "end": 8986.78, "text": "ganz schlüssig wie. Einfach Transition. Da muss man aber bestimmt hier das Weltzeug"}, {"id": 871, "start": 8986.78, "end": 9008.3, "text": "importieren. Fly. So. Svelte Transition. Import Fade vom Svelte Transition. Ok dann"}, {"id": 872, "start": 9008.3, "end": 9017.46, "text": "machen wir das damit testweise. Oder Fly. Fly. So und jetzt if visible. Ja das haben wir."}, {"id": 873, "start": 9017.46, "end": 9040.82, "text": "Und dann sagt man was? Transition. Fly. Also. Transition. Warum gibt es das hier nicht?"}, {"id": 874, "start": 9040.82, "end": 9070.74, "text": "Ne. Flyt da jetzt was? Das fadet eher oder? Fade. Fade. Fade. Fade. Fade. Fade. Fade."}, {"id": 875, "start": 9070.74, "end": 9083.58, "text": "Hä? Das ist genau das gleiche? Das habe ich bestimmt nicht richtig verwendet. Svelte."}, {"id": 876, "start": 9083.58, "end": 9112.02, "text": "Wir probieren es mal einfach hier drinnen aus. Fly. Fly. Svelte Transition. Fly. Hier."}, {"id": 877, "start": 9112.02, "end": 9120.42, "text": "Aha. Ok. Fly. Transition. Fly. X 100%. Genauso. So und nicht anders."}, {"id": 878, "start": 9142.02, "end": 9161.26, "text": "So wirklich Flyen tut das nicht oder? Auf Next. Fly. Hier. Wir kriegen das noch erklärt."}, {"id": 879, "start": 9161.26, "end": 9186.7, "text": "So. Fly. Duration. Fly. Ok. Ah. Huge."}, {"id": 880, "start": 9191.26, "end": 9208.3, "text": "Bisschen langsam vielleicht aber. Aber schonmal cool. Duration 200. Ja die Scrollbar können"}, {"id": 881, "start": 9208.3, "end": 9222.1, "text": "wir dann weg machen. Ich glaube ich weiß woran die Scrollbar liegt. Das ist eigentlich ganz"}, {"id": 882, "start": 9222.1, "end": 9237.3, "text": "cool. So Moment Scrollbar. Scrollbar off. War einfach dass die Scrollbar immer da ist."}, {"id": 883, "start": 9237.3, "end": 9244.26, "text": "Ne. Wir machen die Scrollbar immer weg. Wer braucht Scrollbars? Alter guck mal. Scrollbars"}, {"id": 884, "start": 9244.26, "end": 9251.38, "text": "sind einfach mal extrem overrated, outdated, debated. Wer will denn hier bitteschön Scrollbar"}, {"id": 885, "start": 9251.38, "end": 9258.42, "text": "haben? Das sieht hässlich aus wie die Nacht. Scrollbars kommen weg. Scrollbars werden einfach"}, {"id": 886, "start": 9258.42, "end": 9271.34, "text": "global ausgeschaltet. Genau. Userfehler. Exakt. So jetzt können wir mal was anwenden"}, {"id": 887, "start": 9271.34, "end": 9282.26, "text": "von dem was wir vorhin gelernt haben. Svelte. Head. Die Scrollbar Darkman. Das Problem ist"}, {"id": 888, "start": 9282.26, "end": 9288.42, "text": "an Scrollbar stylen ist dass es mit IOS und Safari wieder nicht richtig funktioniert."}, {"id": 889, "start": 9288.42, "end": 9295.62, "text": "Weil da ist die Scrollbar immer weg. Sondern ist nur so ein halb durchsichtiges Ding an"}, {"id": 890, "start": 9295.62, "end": 9319.34, "text": "der Seite. Wie so alles ja. Ne. Body. Body. Achso Moment das ist doch gar kein Style Tag."}, {"id": 891, "start": 9319.34, "end": 9336.46, "text": "Backweight. Style. So. Guck mal Leute. Jetzt gibt es auch keine Scrollbars mehr. Das ist"}, {"id": 892, "start": 9336.46, "end": 9343.1, "text": "real das ich muss sagen finde ich auch dass es relativ schick aussieht jetzt. Das sieht"}, {"id": 893, "start": 9343.1, "end": 9355.54, "text": "wirklich cool aus. Clear Trash. Yes. Die kannst du in die globale CSS machen. Du meinst"}, {"id": 894, "start": 9355.54, "end": 9372.86, "text": "da drin. Da wo aktuell nix drin steht. Also quasi. Hoffentlich funktioniert ein Tailwind"}, {"id": 895, "start": 9372.86, "end": 9383.18, "text": "noch wenn man hier irgendwas reinschreibt. Ja. Nice. Kann man die Icons nicht irgendwie"}, {"id": 896, "start": 9383.18, "end": 9387.3, "text": "reloaden lassen. Das sieht hässlich aus beim Refresh wenn das immer die Icons erst laden"}, {"id": 897, "start": 9387.3, "end": 9410.18, "text": "muss. Das ist wirklich schick. Das gefällt mir jetzt. Das sieht wirklich gut aus. Und"}, {"id": 898, "start": 9410.18, "end": 9416.46, "text": "ich muss sagen das ist eine super super Übungs Anwendung. Weil da kann ich einfach in Zukunft"}, {"id": 899, "start": 9416.46, "end": 9420.34, "text": "wenn ich da wieder wenn ich da wenn ich da drüber kann ich einfach hier immer nachgucken."}, {"id": 900, "start": 9420.34, "end": 9436.94, "text": "Das Scrollbar CSS ist sonst doppelt. Meinst du. Ja stimmt das müsste sich eigentlich"}, {"id": 901, "start": 9436.94, "end": 9445.58, "text": "vererben ne. Ja. Genau. Wir haben nirgendswo Scrollbars. Scrollbars sind outdated overrated"}, {"id": 902, "start": 9445.58, "end": 9457.82, "text": "gebaited in mobile Anwendungen. Ja aber ich hab hier oben ja auch Icons. Ich find das"}, {"id": 903, "start": 9457.82, "end": 9464.66, "text": "ist echt schick. So ok. Jetzt haben wir jetzt haben wir den Dialog. Clear Trash. So und"}, {"id": 904, "start": 9464.66, "end": 9473.86, "text": "wenn ich jetzt sagen Clear Trash. Dann mach ich das da. So Empty Trash ist im Prinzip"}, {"id": 905, "start": 9473.86, "end": 9487.1, "text": "einfach nur das da. Und Show Dialog kommt hier raus. So wenn ich sage Yes im Dialog."}, {"id": 906, "start": 9487.1, "end": 9501.94, "text": "Es wird mir schon wieder Blur. Brauchen wir das überhaupt noch? Ach ja. Das brauchen"}, {"id": 907, "start": 9501.94, "end": 9512.86, "text": "wir noch. Jetzt wo es der Chat gerade sagt ich muss meinen Staubsauger auch flaschen"}, {"id": 908, "start": 9512.86, "end": 9517.9, "text": "wieder demnächst. Den hab ich jetzt 2 Wochen oder so nur nachdem ich Reset hatte in der"}, {"id": 909, "start": 9517.9, "end": 9525.18, "text": "Ecke stehen gehabt. Ich muss aber sagen ich bin jetzt ein bisschen von Staubsauger Robotern"}, {"id": 910, "start": 9525.18, "end": 9537.66, "text": "ein bisschen wieder umgestiegen seit ich jetzt Homeoffice hab und mehr daheim bin. Auf zum"}, {"id": 911, "start": 9537.66, "end": 9543.54, "text": "größten Teil mit dem Staubsauger Staubsaugern, weil das geht einfach so viel schneller."}, {"id": 912, "start": 9543.54, "end": 9548.06, "text": "Wohin ein Staubsauger Roboter halt irgendwie 2 Stunden rumgurgt bis er dann die erste Etage"}, {"id": 913, "start": 9548.06, "end": 9553.1, "text": "fertig hat insgesamt. Da Fleiß ist übertrieben. Na doch doch 2 Stunden kommt schon hin. Mit"}, {"id": 914, "start": 9553.1, "end": 9568.74, "text": "dem Staubsauger bist du in einer Viertelstunde durchgeflitzt wenn du schnell bist. Ne ich"}, {"id": 915, "start": 9568.74, "end": 9576.02, "text": "hab das so gemacht, dass es normalerweise losfährt wenn ich nicht daheim bin. Das macht"}, {"id": 916, "start": 9576.02, "end": 9589.54, "text": "er jetzt auch. Das funktioniert. Wenn mein Handy nicht daheim ist dann darf er. Wo sind"}, {"id": 917, "start": 9589.54, "end": 9597.26, "text": "wir jetzt stehen geblieben? Wir sind hier bei Clear Trash. Clear Trash. Yes. Okay wenn"}, {"id": 918, "start": 9597.26, "end": 9613.7, "text": "Yes geklickt wird, dann sagt er, wenn Yes geklickt wird macht er, ähm, remove? Ne,"}, {"id": 919, "start": 9613.7, "end": 9620.62, "text": "wie heißt das? Empty Trash. Ich nenne das Ding Clear Trash. Weil ansonsten. Gibt es"}, {"id": 920, "start": 9620.62, "end": 9628.74, "text": "Refactor? Rename? Oh ne das macht bestimmt wieder die Hälfte kaputt. Clear Trash. Und"}, {"id": 921, "start": 9628.74, "end": 9644.74, "text": "äh Dialog. False. Clear Trash. Oh was ist das? Ne ne. Oh da muss ich mir noch was überlegen"}, {"id": 922, "start": 9644.74, "end": 9656.62, "text": "gleich. Clear Trash. Yes. No. Ja und bei No macht er einfach. Ich könnte auch einfach"}, {"id": 923, "start": 9656.62, "end": 9684.9, "text": "sagen Clear Trash. Sowas? Könnte man machen. Das müsste funktionieren. Oh jetzt ist es"}, {"id": 924, "start": 9684.9, "end": 9702.58, "text": "nicht Brocken. Jetzt habe ich es kaputt gemacht. Jetzt habe ich es kaputt gemacht. Ah. Ich"}, {"id": 925, "start": 9702.58, "end": 9713.46, "text": "deploy gleich. Warum ist das Brocken? Show Dialog ist doch auf True. Ach ist es wieder"}, {"id": 926, "start": 9713.46, "end": 9731.06, "text": "das gleiche? Dass er das jetzt ausführt ohne? Ja das ist ja bescheuert Alter. Okay und jetzt"}, {"id": 927, "start": 9731.06, "end": 9740.94, "text": "müsste ich hier sagen. Okay das ist jetzt, das ist jetzt schon ziemlich hässlich. Das"}, {"id": 928, "start": 9740.94, "end": 9747.9, "text": "ist jetzt schon ziemlich hässlich. Oh ne jetzt habe ich sie gelöscht. Okay löschen."}, {"id": 929, "start": 9747.9, "end": 9775.82, "text": "Ne das funktioniert so nicht. Okay Funs. Oh der löscht die trotzdem? Moment der löscht"}, {"id": 930, "start": 9775.82, "end": 9799.7, "text": "die trotzdem? Ach so. If Clear Trash. Clear. Okay wunderbar. No. Also löschen. Papierkorb"}, {"id": 931, "start": 9799.7, "end": 9807.74, "text": "sagen. Clear. No. Es bleibt noch da. Clear. Yes. Und es ist. Ach fuck. Er sollte es doch"}, {"id": 932, "start": 9807.74, "end": 9820.82, "text": "immer closen. Alter. Nein. False. Oh er soll den Dialog immer weg machen. So. Also paar"}, {"id": 933, "start": 9820.82, "end": 9826.62, "text": "neue hinzufügen. Löschen, löschen, löschen. Papierkorb Ansicht. Clear All. No es passiert"}, {"id": 934, "start": 9826.62, "end": 9832.38, "text": "nichts. Clear All. Yes alles ist weg. Okay nice. Sehr schön. Das gefällt mir. Das finde"}, {"id": 935, "start": 9832.38, "end": 9841.18, "text": "ich gut. So und jetzt machen wir noch Show Deleted Balls. Da geht er nämlich zurück"}, {"id": 936, "start": 9841.18, "end": 9845.18, "text": "wenn man alles geklärt hat. Zurück in die normale Ansicht. Das ist doch nice. Guck"}, {"id": 937, "start": 9845.18, "end": 9848.86, "text": "mal. Jetzt gehen wir hier hin. So. Sagen Papierkorb Ansicht. Da brauchen wir irgendwie noch ein"}, {"id": 938, "start": 9848.86, "end": 9854.02, "text": "gescheites Icon für gleich. Papierkorb Ansicht sagen jetzt Clear All. Yes. Zack. Da löscht"}, {"id": 939, "start": 9854.02, "end": 9860.7, "text": "er alles und zwitscht in der zurück in die normale Ansicht. Das finde ich gut. So muss"}, {"id": 940, "start": 9860.7, "end": 9866.7, "text": "das sein. Pogchamp. Nice. Das mag ich. Da haben wir doch heute mal richtig coole Dinger"}, {"id": 941, "start": 9866.7, "end": 9869.3, "text": "gebastelt. Wobei hier oben brauchen wir noch irgendwas für meinen. Hier oben, dass das"}, {"id": 942, "start": 9869.3, "end": 9872.74, "text": "ein Button ist glaube ich. Check. Hab ich deploy schon mal. Weil ihr seid Leute. Könnt ihr"}, {"id": 943, "start": 9872.74, "end": 9883.46, "text": "euch angucken. Zack. Da sind wir. Könnt ihr mal gehen auf ToDoCacW.Services."}, {"id": 944, "start": 9883.46, "end": 9889.3, "text": "Oh. Ich hab standardmäßig immer noch auf True stehen. Das Ganze. Nein. Nein. Nein."}, {"id": 945, "start": 9889.3, "end": 9894.58, "text": "Das muss ich gleich. Siehst du. Ist da erst mal direkt Production Deployed. Show Deleted"}, {"id": 946, "start": 9894.58, "end": 9908.06, "text": "Balls. Und Show Dialog Balls. So. Wird das einfach nur. Das wird eine ToDo List Anwendung"}, {"id": 947, "start": 9908.06, "end": 9914.94, "text": "zum Weltüben. Genau. Correct. ToDo List sind ja quasi die Hello Worlds des Internets. Aus"}, {"id": 948, "start": 9914.94, "end": 9923.46, "text": "Funst. Guck mal hier. Nice. Zack. Zack. Zack. Papierkorb. Löschen. Papierkorb Ansicht."}, {"id": 949, "start": 9923.46, "end": 9929.5, "text": "Restore. Und den Rest. Delete All. Yes. Und alles weg. Pogchamp. Das ist richtig gut."}, {"id": 950, "start": 9929.5, "end": 9937.98, "text": "Das. Das gefällt mir. Und ich muss sagen. Das war richtig Big Brain vom Chat. Also was"}, {"id": 951, "start": 9937.98, "end": 9942.38, "text": "mit dem Alken da oben in der Ecke los ist habe ich immer noch nicht. Ja die. Die. Die."}, {"id": 952, "start": 9942.38, "end": 9947.18, "text": "Die Progress Bar. Die. Die stimmt immer noch nicht. Die Progress Bar. Da muss man so was"}, {"id": 953, "start": 9947.18, "end": 9973.78, "text": "überlegen. Die ist sus. Ach so. So der Nachricht Papierkorb ist leer. Ich glaube das brauchen"}, {"id": 954, "start": 9973.78, "end": 9979.86, "text": "wir nicht. Weil. Wenn du den Papierkorb leerst. Dann verschwinden dir alles und es wird dich"}, {"id": 955, "start": 9979.86, "end": 9994.42, "text": "wieder in die normale Ansicht. Ist die Progress Bar kaputt. Die Progress Bar ist kaputt weil"}, {"id": 956, "start": 9994.42, "end": 10004.9, "text": "wenn ich Sachen lösche dann dürfen die nicht im Progress auftauchen. Ok. Progress Percent"}, {"id": 957, "start": 10004.9, "end": 10022.1, "text": "ist to do filter done. Und not not deleted. Ja. Ach jetzt muss ich den Kram hier auch"}, {"id": 958, "start": 10022.1, "end": 10026.82, "text": "nochmal filtern. Ok jetzt muss ich das auslagern. Das ist jetzt ein bisschen eklig. Jetzt stimmt"}, {"id": 959, "start": 10026.82, "end": 10032.3, "text": "es nicht weil die Länge nicht stimmt. Jetzt ist ja nicht mal Länge insgesamt. Sondern"}, {"id": 960, "start": 10032.3, "end": 10053.86, "text": "Länge quasi Bilder die nicht nicht deleted sind. Das sieht jetzt aber hässlich aus."}, {"id": 961, "start": 10053.86, "end": 10059.66, "text": "Ja guckt jetzt funktioniert es. Jetzt funktioniert es. Der Papierkorb wird da nicht mehr mitgerechnet."}, {"id": 962, "start": 10059.66, "end": 10074.3, "text": "Was in der Desktop Ansicht taucht bei mir rechts eine Scrollbar auf. Beim auf den Delete"}, {"id": 963, "start": 10074.3, "end": 10079.9, "text": "Button klicken. Das sollte eigentlich nicht so sein. Das ist wieder so eine Browser Geschichte"}, {"id": 964, "start": 10079.9, "end": 10089.9, "text": "weg. Pass auf im FireFox ist es wahrscheinlich jetzt kaputt. Wahrscheinlich ist es im FireFox"}, {"id": 965, "start": 10089.9, "end": 10115.22, "text": "jetzt kaputt. Warum ist es im FireFox jetzt kaputt. Warum ist es im FireFox jetzt kaputt."}, {"id": 966, "start": 10115.22, "end": 10128.26, "text": "Braucht man noch extra was für Mozilla. Ne das ist ergeblich FireFox. Ergeblich sollte"}, {"id": 967, "start": 10128.26, "end": 10149.58, "text": "das im FireFox. Hast du FireFox. Gibt es noch etwas wie Mods. Scroll. Ja eigentlich"}, {"id": 968, "start": 10149.58, "end": 10156.38, "text": "sollte das für alle gesetzt sein. Jetzt ist es aber anscheinend nicht. Es gibt kein extra"}, {"id": 969, "start": 10156.38, "end": 10174.82, "text": "für Mozilla. So aber der Rest ist schon mal in Ordnung. Hier oben für das umschalten"}, {"id": 970, "start": 10174.82, "end": 10193.7, "text": "müssen wir uns jetzt noch was ordentliches überlegen. Geht die Suche eigentlich. Ja"}, {"id": 971, "start": 10193.7, "end": 10204.94, "text": "die geht. Das haben wir richtig gemacht. Checken wir mal wirklich ob die Suche geht. 1,2,3"}, {"id": 972, "start": 10204.94, "end": 10215.66, "text": "umschalten. Ja die Suche funzt immer. Eigentlich bräuchten wir jetzt so ein Toggle Ding. Wie"}, {"id": 973, "start": 10215.66, "end": 10225.94, "text": "heisst denn das. Switch. So was bräuchten wir. Genau. So was bräuchten wir eigentlich."}, {"id": 974, "start": 10225.94, "end": 10238.02, "text": "Label Class Input Type. Was. Ach so was gibt es nicht fertig im Browser oder was. So was"}, {"id": 975, "start": 10238.02, "end": 10249.94, "text": "will ich nicht selber machen. Das habe ich schon gefixt mit dem wenn du no drückst."}, {"id": 976, "start": 10249.94, "end": 10257.02, "text": "Da müsste ich nur nochmal neu pushen. Wenn du no drückst bleibt die jetzt drinnen im"}, {"id": 977, "start": 10257.02, "end": 10267.14, "text": "Papierkorb. So. Also jetzt müssen wir diesen Button da oben weg machen. Also hier machen"}, {"id": 978, "start": 10267.14, "end": 10270.26, "text": "wir ich glaube das machen wir das nächste Mal. Dass wir hier ne ordentliche Komponente"}, {"id": 979, "start": 10270.26, "end": 10277.1, "text": "draus machen. Wir machen diesen hässlichen Button weg. Ich finde den Button schon gar"}, {"id": 980, "start": 10277.1, "end": 10300.58, "text": "nicht mehr. Wo ist der Button. Wo ist der Button mit Klick drauf. Klick. Button. Ist"}, {"id": 981, "start": 10300.58, "end": 10304.98, "text": "das der Button. Ja. So. Jetzt bräuchten wir irgendwie nen ordentlichen Switch. Ich weiß"}, {"id": 982, "start": 10304.98, "end": 10314.86, "text": "nicht so genau wo wir den hin machen. Wo machen wir den Switch hin. Für Papierkorb an und"}, {"id": 983, "start": 10314.86, "end": 10323.34, "text": "aus. Wir können ja nicht noch nen Ding hier neben machen oder. Wobei es eigentlich thematisch"}, {"id": 984, "start": 10323.34, "end": 10334.7, "text": "ist. Leute doch wir machen das da hin und machen die Suchleiste oben drüber. Das können"}, {"id": 985, "start": 10334.7, "end": 10338.46, "text": "wir nix hin machen. Neben default kommen ja noch die ganzen anderen Notizbücher die"}, {"id": 986, "start": 10338.46, "end": 10349.5, "text": "ich es geben kann. Wir machen das jetzt einfach hier hin. Erstmal search. WB chain lore wir"}, {"id": 987, "start": 10349.5, "end": 10356.82, "text": "machen das erstmal hier hin. Die Sache ist nur die. Ich bin wirklich nicht. Ich sehe"}, {"id": 988, "start": 10356.82, "end": 10363.14, "text": "mich jetzt auf kurzfristig nicht in der Lage einen schönen CSS Toggle Switch zu bauen."}, {"id": 989, "start": 10363.14, "end": 10384.14, "text": "Oha. Guckt euch das an. Koggas Toggle Switch. Dabei ist das gar nicht so kompliziert wie"}, {"id": 990, "start": 10384.14, "end": 10400.66, "text": "es aussieht. Ich will kein fertiges UI Kit verwenden. Simple switch CSS. Simple CSS Toggle"}, {"id": 991, "start": 10400.66, "end": 10414.7, "text": "Switch. Simple. Simple. Nee das ist finde ich nicht simple. Switch. Switch input. Switch."}, {"id": 992, "start": 10414.7, "end": 10424.3, "text": "Switch diff. Alter. Übertreibs halt mal. Gibt es da nicht irgendwas mit drei Zeilen."}, {"id": 993, "start": 10424.3, "end": 10448.18, "text": "Simple. Alter das sind alles fünf Seiten lang. Hellwind Components. Excellent. Toggle"}, {"id": 994, "start": 10448.18, "end": 10462.74, "text": "me. Ja Gachibas Toggle mich. So wie kann man das jetzt einbinden? Kann man dann irgendwie"}, {"id": 995, "start": 10462.74, "end": 10478.16, "text": "sagen Component Toggle Switch oder so? Moment. Achso ich dachte ich kann das. Ich dachte"}, {"id": 996, "start": 10478.16, "end": 10485.14, "text": "ich kann das hier irgendwie. Ich dachte ich kann das hier irgendwie einbinden als Plugin."}, {"id": 997, "start": 10485.14, "end": 10511.58, "text": "Und dann ist gut. Download. Nee das ist anscheinend wirklich Copy Paste. Copy Paste. Ey mein"}, {"id": 998, "start": 10511.58, "end": 10516.2, "text": "das ist schon relativ simple. Das nehmen wir jetzt einfach mal. Ich Copy Paste, nehme"}, {"id": 999, "start": 10516.2, "end": 10520.58, "text": "das jetzt raus. Wir machen jetzt mal kurz. Wir machen mal schnell eine neue Component"}, {"id": 1000, "start": 10520.58, "end": 10535.0, "text": "dafür. Switch. Welt. Zack. Jaja MonkaS. So. Script. Script. Weiß gar nicht ob wir"}, {"id": 1001, "start": 10535.0, "end": 10548.04, "text": "das überhaupt brauchen. So Class Inline. Gut und jetzt binden wir das ein. Switch."}, {"id": 1002, "start": 10548.04, "end": 10567.12, "text": "Okay das Ding hat irgendeinen Sonntagsfehler drin. Apply. Oh ist das das? Ist Apply ist"}, {"id": 1003, "start": 10567.12, "end": 10581.16, "text": "das das? Oder was ist das? Oder warum funktioniert das nicht? Nee oder was ist das? Ich weiß"}, {"id": 1004, "start": 10581.16, "end": 10592.72, "text": "überhaupt nicht was ich damit anfangen soll. Ist Post CSS? Ja wunderbar. Pog oder not"}, {"id": 1005, "start": 10592.72, "end": 10613.32, "text": "Pog? Nee MonkaW machen wir nicht. Wir haben so viele MonkaEmo's schon. Machen wir einfach"}, {"id": 1006, "start": 10613.32, "end": 10623.52, "text": "weg. So Switch. So und jetzt binden wir den mal ein. Gucken ob der irgendwie was taugt."}, {"id": 1007, "start": 10623.52, "end": 10644.32, "text": "Ja. Gut ich hab ja auch die Sachen gelöscht. Switch. Was macht Apply? Okay ich hab keine"}, {"id": 1008, "start": 10644.32, "end": 10664.4, "text": "Ahnung was das macht. Da bin ich zur Pepega für. Kein Schimmer. Toggle me. Ah gut. Ich"}, {"id": 1009, "start": 10664.4, "end": 10687.36, "text": "meine es ist kein schöner Switch. Warum funktioniert das nicht? Da muss ja was geben. Simple. Also"}, {"id": 1010, "start": 10687.36, "end": 10692.72, "text": "Toggle Checkshop bekommt alle Styles von allen Klassen die im Apply drin sind. Ja schön"}, {"id": 1011, "start": 10692.72, "end": 10701.04, "text": "und gut aber Apply. Ich weiß nicht warum das bei mir nicht funktioniert. Weil Post CSS"}, {"id": 1012, "start": 10701.04, "end": 10716.0, "text": "nicht funktioniert oder was? Muss ich das nicht in Style machen? Wo hab ich denn? Components?"}, {"id": 1013, "start": 10716.0, "end": 10745.64, "text": "Wie verwendet man das? Style? Nö. Muss das hier vielleicht irgendwie in meine? Nee oder?"}, {"id": 1014, "start": 10745.64, "end": 10763.68, "text": "Unown Rule. Unown Rule. Ja das ist irgendwie eine Magic die wahrscheinlich total simpel"}, {"id": 1015, "start": 10763.68, "end": 10793.16, "text": "ist wenn man weiß was man macht. Aha. Aha. Lange Post CSS. Lange Post CSS. Lange Post"}, {"id": 1016, "start": 10793.16, "end": 10813.6, "text": "CSS. Aha. Es hört sich vielleicht so an aber ich hab keine Ahnung was abgeht. Ähm."}, {"id": 1017, "start": 10813.6, "end": 10836.04, "text": "Okay Lack of Critical Information. Keine Ahnung. Das ist irgendwie irgendwelche Magic im Hintergrund"}, {"id": 1018, "start": 10836.04, "end": 10843.32, "text": "die nicht läuft weil keine Ahnung. Was haben wir nochmal? Sveiled? Add? Da haben wir doch"}, {"id": 1019, "start": 10843.32, "end": 10855.2, "text": "irgendwie so ein komisches. Add. Ja. So das haben wir verwendet. So Apply. Erzähl mir"}, {"id": 1020, "start": 10855.2, "end": 10866.56, "text": "wie es funktioniert. Issues. Hier. Da stand noch was. Apply. Apply. You can use Style"}, {"id": 1021, "start": 10866.56, "end": 10885.12, "text": "CSS Blocks. Aha. Aber ja ich muss Post CSS installieren aber sollte der mir nicht eigentlich"}, {"id": 1022, "start": 10885.12, "end": 10900.92, "text": "sein. Ich habe kein Post CSS installiert. Also machen wir das dann mal. Wobei NPM List"}, {"id": 1023, "start": 10900.92, "end": 10926.24, "text": "Posts. Posts. Ist nicht installiert. Style Lange Post CSS. Haben wir doch gemacht."}, {"id": 1024, "start": 10926.24, "end": 10954.04, "text": "Na. Wird da irgendwas? Ich meine."}, {"id": 1025, "start": 10954.04, "end": 10963.4, "text": "Was macht dieses Ding? Deswegen mag ich das nicht wenn zu viel Magic im Hintergrund ist"}, {"id": 1026, "start": 10963.4, "end": 10984.92, "text": "weil ich dann keine Ahnung hab was eigentlich passiert. Stuff. Bester Name. Stuff JS. Obvious."}, {"id": 1027, "start": 10984.92, "end": 11001.36, "text": "Ich installiere jetzt einfach Post CSS."}, {"id": 1028, "start": 11001.36, "end": 11020.44, "text": "Moment. Guck mal. Hier sind Applies. Haben wir überhaupt keinen Doppelpunkt mehr dahinter."}, {"id": 1029, "start": 11020.44, "end": 11042.44, "text": "Aber es funktioniert auch nicht. Macht überhaupt keinen Unter. Ah. Ok. Das macht schon was."}, {"id": 1030, "start": 11042.44, "end": 11063.16, "text": "Funktioniert nicht. Alter ist das freudig. Das machen wir heute nicht mehr Leute. Das"}, {"id": 1031, "start": 11063.16, "end": 11072.84, "text": "machen wir heute nicht mehr. Das machen wir heute mal. Das reicht mir für heute wieder."}, {"id": 1032, "start": 11072.84, "end": 11081.24, "text": "Also was haben wir geschafft? Wir haben den Delete All Button. Wir haben einen Papierkorb"}, {"id": 1033, "start": 11081.24, "end": 11101.2, "text": "so halb. So Minus. Such haben wir auch geschafft. Wo ist der Delete All? Der Delete All Knopf"}, {"id": 1034, "start": 11101.2, "end": 11104.96, "text": "ist ja den kannst du grad nicht sehen weil ich den durch diesen Toggle Button ersetzen"}, {"id": 1035, "start": 11104.96, "end": 11111.4, "text": "wollte. Du musst in die Papierkorb Ansicht wechseln aber das funktioniert gerade nicht"}, {"id": 1036, "start": 11111.4, "end": 11119.56, "text": "weil Toggle. Ich mein ich kanns ja mal kurz wieder einbinden. Was passiert eigentlich"}, {"id": 1037, "start": 11119.56, "end": 11124.64, "text": "wenn ich den ganzen Shit hier weg mache? Ok dann Toggles gar nichts mehr alles klar."}, {"id": 1038, "start": 11124.64, "end": 11144.84, "text": "Ist das ReactOS? Ja. Eindeutig ist das ReactOS. Ok also hier wird getoggelt. Toggle me. Kommt"}, {"id": 1039, "start": 11144.84, "end": 11159.96, "text": "weg. Braucht kein Text. Das Label. Brauchen wir das Label überhaupt? Nö null. Kein Label."}, {"id": 1040, "start": 11159.96, "end": 11171.84, "text": "Oder wahrscheinlich ist es sonst broken. So. Und jetzt müssen wir irgendein Event schmeißen"}, {"id": 1041, "start": 11171.84, "end": 11186.28, "text": "wenn das hier getoggelt wird. Also Let. Nee war das der Export. Let. Active oder sowas."}, {"id": 1042, "start": 11186.28, "end": 11203.32, "text": "Active. Und wo bekommt man überhaupt jetzt mit wenn das getoggelt wird. Input. Checkbox."}, {"id": 1043, "start": 11203.32, "end": 11213.64, "text": "Hier bekommt man das mit. Find. Checked. Active. Ja ja ich weiß ich muss es klammern."}, {"id": 1044, "start": 11213.64, "end": 11229.08, "text": "So das sollte jetzt eigentlich funsten. Gucken wir mal. Active. Ok. False. Ok. Es sieht halt"}, {"id": 1045, "start": 11229.08, "end": 11237.0, "text": "mega beschissen aus. Aber immerhin. Das machen wir das nächste Mal machen wir das ordentlich."}, {"id": 1046, "start": 11237.0, "end": 11250.24, "text": "So. Let. Active. Gut. So. Kann man das jetzt binden irgendwie hier von von oben drüber."}, {"id": 1047, "start": 11250.24, "end": 11269.2, "text": "Switch. Active. Also ich quasi sage hier. Bind. Show. Deleted. Nee. Bind. Active. Show"}, {"id": 1048, "start": 11269.2, "end": 11280.04, "text": "Deleted. 30 Monate. Richtig poggers. Hey Funds guck mal. Die Papierkorb umschalte Anzeige"}, {"id": 1049, "start": 11280.04, "end": 11287.48, "text": "ist da. Nur das der Switch halt richtig extremst hängen geblieben aussieht. Aber ich push"}, {"id": 1050, "start": 11287.48, "end": 11308.56, "text": "es jetzt trotzdem. Ja Massive. Richtig richtig. Hyper Subscription am Start. Wieso ist das"}, {"id": 1051, "start": 11308.56, "end": 11315.6, "text": "Scrollbar Label User Selectable. Es ist eine gute Frage. Weil das Crap ist was die Typen"}, {"id": 1052, "start": 11315.6, "end": 11336.16, "text": "gebaut haben da wahrscheinlich. Einmal das Scrollbar. Welches Scrollbar Label. NPM install"}, {"id": 1053, "start": 11336.16, "end": 11344.16, "text": "kann ich das einfach wieder aninstall machen. Es geht immer noch. Ok funktioniert immer"}, {"id": 1054, "start": 11344.16, "end": 11352.24, "text": "noch alles. Alles gut. Die 33 Prozent waren gerade mal hier. Stimmt warum ist das Selectable."}, {"id": 1055, "start": 11352.24, "end": 11363.16, "text": "Ja das ist dumm. Das können wir das können wir weg machen. Procress. Procress. Weil das"}, {"id": 1056, "start": 11363.16, "end": 11377.72, "text": "einfach hier ist. Select. User Select ist glaube ich User. Select. User Select. Select."}, {"id": 1057, "start": 11377.72, "end": 11382.88, "text": "Select none ist es. Ok jetzt kannst du nix mehr selecten. Das bleibt jetzt da oben."}, {"id": 1058, "start": 11382.88, "end": 11387.92, "text": "Das sieht zwar beschissen aus. Aber. Also es würde gar nicht so beschissen aussehen."}, {"id": 1059, "start": 11387.92, "end": 11399.08, "text": "Wenn. Das kein Haken macht. So wenn ich das hier wenn ich das hier weg mache dann funs"}, {"id": 1060, "start": 11399.08, "end": 11408.04, "text": "es schon mal nicht. Wobei doch funs immer noch. Und warum. Was genau war jetzt der Sinn"}, {"id": 1061, "start": 11408.04, "end": 11425.84, "text": "davon von diesem Apply. Ich sehe da überhaupt keinen Unterschied dazwischen. Ich muss doch"}, {"id": 1062, "start": 11425.84, "end": 11433.72, "text": "ich muss doch eigentlich nur dafür sorgen dass da kein Checkmark reinkommt. Das Toggle"}, {"id": 1063, "start": 11433.72, "end": 11440.76, "text": "kannst du noch nicht verstehen. Das ist einfach random drin. Was das Toggle machen soll ist"}, {"id": 1064, "start": 11440.76, "end": 11448.92, "text": "Ansicht zwischen Papierkorb und normal. Wenn du irgendwie andere in Big Brain Ideen hast"}, {"id": 1065, "start": 11448.92, "end": 11455.0, "text": "außer den Switch. Der sagt mir irgendwas. Das Switch zwischen Papierkorb Ansicht und"}, {"id": 1066, "start": 11455.0, "end": 11463.92, "text": "normal. Du musst nur die Background Color setzen beim checkt oder. Passt. Es passt"}, {"id": 1067, "start": 11463.92, "end": 11469.84, "text": "eigentlich alles. Ich will. Ich will das wegbekommen dass der überhaupt. Da noch ein Checkmark"}, {"id": 1068, "start": 11469.84, "end": 11478.4, "text": "und so komische Kringel drum herum hat soll soll alles weg. Papierkorb Eichen. Wir können"}, {"id": 1069, "start": 11478.4, "end": 11481.28, "text": "da neben Papierkorb Eichen machen. Ich will jetzt aber erst mal gucken wie man das mit"}, {"id": 1070, "start": 11481.28, "end": 11508.52, "text": "der Toggle hinkriegt. Was ist denn das hier wieder. Wie kann ich das"}, {"id": 1071, "start": 11508.52, "end": 11523.16, "text": "stylen dass das Checkmark Ding wegkommt. CSS. Height. Check. Sign. Checkmark. Na. Das"}, {"id": 1072, "start": 11523.16, "end": 11537.52, "text": "ist eine bescheuerte Antwort. Was. Was. Was ist denn. Alter. Ist der Golfer Flau. Was"}, {"id": 1073, "start": 11537.52, "end": 11548.72, "text": "ist denn mit euch los. Alter ist das wieder kompliziert."}, {"id": 1074, "start": 11548.72, "end": 11570.68, "text": "Macht doch ein Toggle wie in den Battlefield Settings. Es sieht von der Farbe fast schon"}, {"id": 1075, "start": 11570.68, "end": 11596.76, "text": "ein bisschen nach Battlefield Settings aus. Das ist außen drum herum. Aha. Das hier ist"}, {"id": 1076, "start": 11596.76, "end": 11621.88, "text": "das Ding schon mal. Outline Null. Der Unterschied. Border. Border. Null. Oh ne. Ach ne das ist"}, {"id": 1077, "start": 11621.88, "end": 11632.04, "text": "on hover wieder hier ne. On Focus. Das ist wieder. Focus. Boah ist das Känzer des stylen"}, {"id": 1078, "start": 11632.04, "end": 11640.04, "text": "das Zeug. Alter. Meine Güte. Das bleibt jetzt so. Das bleibt jetzt so. Da habe ich jetzt"}, {"id": 1079, "start": 11640.04, "end": 11646.04, "text": "keine Musel für das mir zu überlegen. Das lasse ich jetzt so. Und das nächste Mal machen"}, {"id": 1080, "start": 11646.04, "end": 11650.56, "text": "wir das dann schon noch. Und lagern den Kram auch in Komponenten aus und sowas. Das ist"}, {"id": 1081, "start": 11650.56, "end": 11661.24, "text": "gerade. Das reicht mir. So. Git. Status. Add. Push. Force. Immer schön Force pushen."}, {"id": 1082, "start": 11661.24, "end": 11669.08, "text": "Habe ich irgendwas vergessen. Ah ne ich habe vergessen. Komm. Komm jetzt. Ja ich habe"}, {"id": 1083, "start": 11669.08, "end": 11687.36, "text": "Local Storage gefixt. Ich weiß nicht warum. KQ. Giga. Chat. Push. Alles klar. So. Wer"}, {"id": 1084, "start": 11687.36, "end": 11698.84, "text": "sich das angucken will. Source Code technisch. Ist. Falsches Repo. Ist hier am Start. Ist"}, {"id": 1085, "start": 11698.84, "end": 11707.56, "text": "hier am Start auf GitHub. Und. Auf. To do. Punkt. Kek. W. Punkt. Services. Oh ich muss"}, {"id": 1086, "start": 11707.56, "end": 11727.04, "text": "noch deployen. Playbook. Bäm. So. Jetzt habt ihr uns ein komisches Toggl. Alter. Sieht"}, {"id": 1087, "start": 11727.04, "end": 11737.36, "text": "richtig angeblieben aus. Oh Leute. Es gibt ein Problem. Wir haben das nicht richtig angepasst"}, {"id": 1088, "start": 11737.36, "end": 11758.96, "text": "mit der Prozent Anzeige. Es gäbe da so ein kleines Problem."}, {"id": 1089, "start": 11758.96, "end": 11777.84, "text": "So. Jetzt also. Anzeige. Papierkorb. Löschen. Aber das finde ich cool. Das hat es mir echt"}, {"id": 1090, "start": 11777.84, "end": 11786.24, "text": "echt. Alter der Firefox mit seinem komischen. Dumm. Scrollbar. Das hat es mir echt angetan."}, {"id": 1091, "start": 11786.24, "end": 11793.2, "text": "Clear Trash. No. Clear Trash. Yes. Das finde ich ist cool. Auch wie das ein faded und so."}, {"id": 1092, "start": 11793.2, "end": 11807.56, "text": "Richtig Pogchamp. Das gefällt mir. Leider. Leider ist das mit der. Mit der Firefox Scrollbar"}, {"id": 1093, "start": 11807.56, "end": 11817.44, "text": "so ein bisschen so ein Ding. Der Toggl wird nicht geblurrt. Oh. Na gut. Man kann nicht"}, {"id": 1094, "start": 11817.44, "end": 11830.0, "text": "alles haben. Ich weiß warum der nicht geblurrt wird. Ist eigentlich ganz einfach warum der"}, {"id": 1095, "start": 11830.0, "end": 11839.4, "text": "Toggl nicht geblurrt wird. Das ist weil ich den nicht im Diff drinne hab. Guck hier. Und"}, {"id": 1096, "start": 11839.4, "end": 11859.84, "text": "jetzt wird es ja auch geblurrt. Weil ihr seid chat. Oh. Status. Bam. Überschreiben wir"}, {"id": 1097, "start": 11859.84, "end": 11866.64, "text": "den Kram mal wieder. Shit. Repo. So jetzt wird auch. Jetzt wird auch geblurrt. Ups."}, {"id": 1098, "start": 11866.64, "end": 11875.8, "text": "Jetzt wird auch ordentlich geblurrt hier oben. Was passiert eigentlich mit Ausrufezeichen"}, {"id": 1099, "start": 11875.8, "end": 11880.16, "text": "Hetzner mit dem zweiten. Das ist eine gute Frage. Ich hab mir für nächstes Jahr mit"}, {"id": 1100, "start": 11880.16, "end": 11885.44, "text": "dem noch nichts überlegt. Aber sag mal so von meiner Seite aus würde ich das weitermachen."}, {"id": 1101, "start": 11885.44, "end": 11891.32, "text": "Und ich guck mal ob die irgendwelche Mails geschrieben haben. Und ich glaube auch dass"}, {"id": 1102, "start": 11891.32, "end": 11902.76, "text": "das zahlentechnisch bei denen nicht schlecht war. Also auch so exposure technisch. Man kann"}, {"id": 1103, "start": 11902.76, "end": 11908.12, "text": "es ja nicht immer nur anhand von irgendwelchen Anmeldungen messen. Also ich denke mal das"}, {"id": 1104, "start": 11908.12, "end": 11919.12, "text": "geht nächstes Jahr weiter. Wird sich zeigen. Müssen wir mal gucken. Nach wie vielen Tagen"}, {"id": 1105, "start": 11919.12, "end": 11930.56, "text": "verfällt das. Oh das ist eine gute Idee für Big Brain Feature. Papierkorb. Wie macht"}, {"id": 1106, "start": 11930.56, "end": 11943.36, "text": "man das auch mal? Papierkorb verfällt nach 14 Tagen. 7 Tagen. Was auch immer. Dein Hetzner"}, {"id": 1107, "start": 11943.36, "end": 11949.64, "text": "Guthaben. Wenn du das eingelöst hast sollte das da bleiben. Also ihr könnt euch noch wer"}, {"id": 1108, "start": 11949.64, "end": 11954.48, "text": "es jetzt noch nicht gesehen hat. Ausrufezeichen Hetzner in Chat. Ihr könnt euch einen 20"}, {"id": 1109, "start": 11954.48, "end": 11969.64, "text": "Euro Cloud Guthaben sichern. Bei Hetzner Cloud. Mit meinem Anmeldecode. Das müsst ihr aber"}, {"id": 1110, "start": 11969.64, "end": 11974.52, "text": "einlösen bis 31 in 12. Und ich glaube alles was eingelöst ist bis dahin bleibt erhalten."}, {"id": 1111, "start": 11974.52, "end": 11988.88, "text": "Kleine Comets. Overrated. Outdated. Shebaited. Ja und ich mein. Guck mal. Mit 20 Euro könnt"}, {"id": 1112, "start": 11988.88, "end": 11994.4, "text": "ihr ja schon eine Triple Core Kiste fast 3 Monate laufen lassen. Das ist nicht übel."}, {"id": 1113, "start": 11994.4, "end": 11999.84, "text": "Aber insgesamt muss man sagen haben wir heute trotzdem ganz gut Progress gemacht. Auch wenn"}, {"id": 1114, "start": 11999.84, "end": 12004.28, "text": "das jetzt gerade ein bisschen hässlich aussieht hier. Aber es ist nicht verkehrt. Und ich"}, {"id": 1115, "start": 12004.28, "end": 12009.96, "text": "muss sagen gerade dieses Papierkorb leeren hat es mir wirklich angetan. Das finde ich"}, {"id": 1116, "start": 12009.96, "end": 12029.6, "text": "sehr sehr. Wieso benutzt du das Profilbild von Max FPS ja krass krass abgerippt hier."}, {"id": 1117, "start": 12029.6, "end": 12045.28, "text": "Du brauchst nicht Deutsch zu wissen. CAC ist glaubbar. CAC W. Aber in Deutsch ist es CAC"}, {"id": 1118, "start": 12045.28, "end": 12073.2, "text": "W. Because W equals W. Ja mir gefällt das wirklich das hat was. Das hat was. Wobei"}, {"id": 1119, "start": 12073.2, "end": 12079.52, "text": "ich mir immer noch ziemlich sicher bin dass ich hier einen Bug gefunden habe. Dass man"}, {"id": 1120, "start": 12079.52, "end": 12084.68, "text": "diese Geschichte hier braucht. Dass man das braucht. Ich glaube das ist ein Bug. Das ergibt"}, {"id": 1121, "start": 12084.68, "end": 12096.0, "text": "sonst keinen Sinn. One Englischer Stream ja. Nie. Wisst ihr was ich gerade gefunden habe"}, {"id": 1122, "start": 12096.0, "end": 12113.72, "text": "hier auf Basteltisch. Was ist das? Das ist der ihr wisst es genau. Chat. Was ist das?"}, {"id": 1123, "start": 12113.72, "end": 12131.88, "text": "Smoke fast. Da haben wir es auch. Ist der abisoliert Champ. So richtig. Das ist nicht"}, {"id": 1124, "start": 12131.88, "end": 12135.64, "text": "illegal. Kannst einen neuen Account machen. Aber ich soll das nicht so explizit bewerben"}, {"id": 1125, "start": 12135.64, "end": 12145.84, "text": "haben sie immer gesagt. Das geht aber es geht. Letztendlich ist es für mich ja nicht verkehrt."}, {"id": 1126, "start": 12145.84, "end": 12159.08, "text": "Umso mehr Leute sich neu anmelden umso besser sieht meine Statistik aus. W. Stonks genau."}, {"id": 1127, "start": 12159.08, "end": 12184.56, "text": "Ach ja. Ja Leute. Ich weiß. Gute Idee. Ich wollte eigentlich noch ein Video machen. Was"}, {"id": 1128, "start": 12184.56, "end": 12190.12, "text": "ich alles auf mein. Wie sage ich das anders sagen. Ich wollte eigentlich ein Video aufnehmen"}, {"id": 1129, "start": 12190.12, "end": 12198.2, "text": "noch. Weil wir letztes Video gesehen haben. So was wollte ich auch machen. Nur dass ich"}, {"id": 1130, "start": 12198.2, "end": 12201.28, "text": "das wahrscheinlich nicht alles in einem Video machen werde. Weil zu viel ist. Ich mache"}, {"id": 1131, "start": 12201.28, "end": 12205.32, "text": "mir extra für euch ein Dashboard habe ich mir überlegt. Weil das kommt in YouTube Videos"}, {"id": 1132, "start": 12205.32, "end": 12209.84, "text": "immer gut an wenn man Dashboards hat. Dashboards wirken einfach besser als wenn ich Kommandozeile"}, {"id": 1133, "start": 12209.84, "end": 12225.56, "text": "aufmache. Den Krieger Rainn. Dass ihr wieder etwas auf den Kopf fällt. Wild. Was macht"}, {"id": 1134, "start": 12225.56, "end": 12241.52, "text": "er denn gerade. Red Dead Redemption 2. Das juckt mich ja so gar nicht. Weil das nächste"}, {"id": 1135, "start": 12241.52, "end": 12266.72, "text": "Battlefield 3. Keine Ahnung. Echt. Kein Plan. Spielst du noch Battlefield 4. Nee Battlefield"}, {"id": 1136, "start": 12266.72, "end": 12278.16, "text": "3 habe ich nicht inszeniert. C++ Stream. Welchen C++ Stream soll ich hosten. Sag es mir. Gucken"}, {"id": 1137, "start": 12278.16, "end": 12288.52, "text": "wir mal. Twitch. Software. Endgame Development. Welchen C++ Hacker Mann oder Hacker Frau hosten"}, {"id": 1138, "start": 12288.52, "end": 12297.68, "text": "wir denn. Guck mal. Ich bin. Ach auf Deutsch. Okay. Trotzdem. Ich bin auf Platz 1. In diese"}, {"id": 1139, "start": 12297.68, "end": 12317.28, "text": "Kategorie streamt einfach keiner. Empfohlene Kanäle Wubblos. Wie jetzt. Was. Ist das nicht"}, {"id": 1140, "start": 12317.28, "end": 12343.0, "text": "nach Zuschauern gedingst. Doch. Einfach gerade sagen. Es sah aus als hat er nichts an. Aber"}, {"id": 1141, "start": 12343.0, "end": 12350.76, "text": "das ist das T-Shirt. Nee keine Ahnung Leute. Aber ich kann mich überhaupt nicht mehr konzentrieren"}, {"id": 1142, "start": 12350.76, "end": 12376.52, "text": "ich haue jetzt einfach ab. Was. Was macht er. Sagt mir nichts. Ich ich haue es am liebsten"}, {"id": 1143, "start": 12376.52, "end": 12391.92, "text": "Leute den ich selbst haue. Aber es ist niemand. Und. Also dies bräuchten. Richtig pence"}, {"id": 1144, "start": 12391.92, "end": 12407.0, "text": "gempe ich. Warte noch mal. Leute ich gehe jetzt auf. Wir sehen uns. Bis dann. Macht's"}, {"id": 1145, "start": 12407.0, "end": 12422.24, "text": "gut zu."}]}