{"text": "Moin, da bin ich.Was ist das für ein Emote, das kenne ich gar nicht.Wusste gar nicht, dass ich das aktiviert habe.Hab ich das aktiviert oder ist das irgendwie ein Personal Emote von dir?Find ich gar nicht übel.Ich glaube es ist ein Personal Emote von dir.Ich hab das noch nie gesehen.So, Sound mal kurz checken.Ob Teams wieder irgendwas verkackt hat.Achso, hört man mich?Gut.Ja, weil das letzte Mal hab ich ja geschwätzt, 10 Minuten lang und ihr habt mich nicht gehört.Personal, ja, dachte ich mir, ok, Sound passt, exellent, exellent.Ja Leute, ich muss heute ein bisschen entspannter sprechen mit euch, ja.Etwas ruhiger, entspannter, weil mir tut wieder der Hals weh, war jetzt ein paar Wochen langrichtig gut.Aber seit ein, zwei Tagen tut mir der Hals wieder ein bisschen weh und ich will nicht,dass es wieder, äh, so beschissen wird wie es letztes Mal war, 50 Minuten bis, bis was,was für ein Ding?Ach du, ja ok, ich glaube jetzt weiß ich was du meinst, ich muss mal kurz, du meinst,du meinst dieses Gerichtsverfahren mit, mit, mit Dings, mit Johnny Depp?Ach so, ja da muss ich jetzt mal kurz, kurz in mich, ja ganz ehrlich, das geht mir vollam Arsch vorbei, ich interessiere mich für solche Celebrity Geschichten, absolut garnicht.Ich mein, gut, das ist jetzt als weniger darum, ob das jetzt irgendwelche bekannten Schauspielersind, sondern eher, so die eigentliche Sache, die die Leute in dem Fall interessieren,wobei auch, auch, ja, wenn jetzt irgendwie, äh, Nachbar um die Ecke sich, äh, dann wirdauch keinen interessieren.Abofalle, ja, Pock, so muss das sein, ne, aber das interessiert mich überhaupt nicht.Ich bekomme, ich bekomme Laufe, aber ich dachte, der hat ihn immer auf den Tisch gehauen, warumsollte ihm der Hals davon weh tun, ähm, was wollte ich denn jetzt sagen, fuck, ich habgerade zu sehr auf einen anderen Bildschirm geguckt, ach so, ja, man bekommt ja laufendirgendwelche Videos von empfohlen, ich hab auch ein paar mal Kleinigkeiten geguckt, aberdas hat mich so überhaupt nicht interessiert, aber ich interessiere mich für so CelebritySachen auch absolut gar nicht.Danke für die Subs, Leute, Jis Jix, Jis Jix, Leon, Pock Zapp, jo, also wie gesagt, mussich mich ein bisschen zusammenreißen, ich muss mit euch heute, äh, entspannt und, äh,ASMR Style reden und immer schön was trinken, dass mir der Hals nicht weiter weh tut, ichhab mir jetzt sogar schon, komm mir langsam vor wie der, wie der, wie der riesen Opa,ich hab mir sogar so ein Inhalationsgerät auf Amazon gekauft, dass man dann irgendwiemit so einer Ladung 10 Minuten, äh, Salz, Salzwasser, Dampf inhalieren kann, weil daswohl gegen trockenen Hals und sonst was hilft, es hilft auch ein bisschen was, aber, ichwar ja wie gesagt, ich war ja auch schon mal im HNO, als so wirklich rausgekommen istja da nix, so, tja, im Prinzip wie Kopium, ja, nur dass ich das selbst halten muss undnicht umgeschnallt hab.Also, das sieht aus, sieht aus wie das Kopium-Emote, genau, eigentlich geiler Vergleich, hättich jetzt überhaupt nicht dran gedacht, aber ja, das trifft's gut, so, ach ja, warum habenwir Kopium eigentlich nicht aktiviert als Emote?Muss ich mal kurz nachholen, Kopium, Max, hast du meinen Kommentar ernst genommen?Welchen?Du hast doch gar nix geschrieben, außer LOL, oder meinst du diesen Kommentar hier jetzt?Ach so, nee, hab ich nicht gesehen, ich hab aber auch die letzten, letzte halbe Stundeoder so nicht mehr reingeguckt auf YouTube.Wisst ihr, was mir gerade einfällt, der Karsten, also so Real Life-Kollege vom Friseur undmir, der hat früher immer gesagt, das heißt nicht YouTube, sondern U2B, und der Karstenhat meistens Ahnung wovon er spricht, dankeschön Michael, 50 Billionen, Massive Q-Chat, aberich mein, das heißt YouTube, da sind wir uns einig in dem Fall, aber der hat immer gesagt,U2B, nee, man wird nicht aufgemacht, man wird vielleicht eingeschlafen, kann auch sein.Du hast mit Keqvee kommentiert, wirklich, Moment, das muss ich jetzt überprüfen, ja,ich habe Keq, hab ich Keqvee kommen, das ist mal, ich antworte manchmal auf Comments ohnerichtig was mir das, also das geht nicht durchs normale Gehirn durch, das nimmt so extraWeg, gerade wenn es Twitch-Emotes sind, Sneakflavor, danke für den Sub, zeig mal her, wo habeich Keqvee?Das da?Nee, das ist der Tainsaw, den hab ich schon eine Weile hier gesehen, zeig mal her, ichhab hier drauf geantwortet, hier, Keqvee hab ich drauf geantwortet, ja Moment, tatsächlichich hab drauf geantwortet und das ist erst 13 Minuten her, tja, siehst du mal, hab ichdas gar nicht richtig, dann hab ich tatsächlich nicht vor einer halben Stunde, sondern vor13 Minuten zuletzt in YouTube reingeguckt und deinen Comment da drauf hab ich nichtmehr gesehen, ist schon, Keq, Keqvee ist quasi so, bei mir ohne Gehirnleistung möglich wieeinsen copypasten, weißt du, irgendjemand schreibt was, ich muss das gar nicht lesen,Keqvee, Lul geht auch, weil wir wissen ja, dass Lul größer, größer Lul ist, allerdingsich bin mir nicht sicher, chat, jetzt in Anbetracht der Tatsache, ja, ich mein die Voraussetzungensind ja ähnlich, beides sind lange Zeit die ultimativen Lach-Emotes gewesen, also Luloder Keqvee, ja, und beide sind tot mittlerweile, also sowohl TotalBiscuit als auch El Resitas,die sind beide, die sind beide schon gestorben, leider, jetzt mal in Anbetracht der Tatsache,dass das jetzt ja beides wirklich einschneidende Emotes sind, was sagt ihr, was ist das ultimativeTwitch, also es gibt nur diese zwei zur Auswahl, was ist das ultimative Twitch, also ehrlichgesagt, die richtet das richtig originale, das richtig originale ist ja auch Lul undnicht das nachgemachte, aber fassen wir mal Lul und Lul zusammen, was ist das ultimativeTwitch Lach-Emote, Keqvee oder Lul, was sagt ihr, ich ändere da eigentlich fast wöchentlichmeine Meinung, ich tendiere so overall zu Lul, aber von dem, was ich öfters benutze, istes Keqvee, das heißt, ich bin mir, Lulvee ist natürlich auch gut, aber das zähl ichmal zu Lul dabei, okay Keqvee, ja das ist, das ist witzig, ich mag, ich mag Lul eigentlichals Emote mehr, aber ich verwende Keqvee häufiger, was eigentlich keinen Sinn ergibt, weil manja davon ausgehen würde, dass man das Emote, was man mehr mag, auch öfters verwendet,aber das muss man nicht verstehen, das ist das übrig gebliebene Zoomer hier in mir,habt ihr mein Video von heute geguckt, ja, es gibt, es kennst du Lul, ne, es gibt wenigeälteres Videos in letzter Zeit, das Keqvee, oh man, das ist quasi Emote Rickrolling, wennman das so will, ja, das ist Emote Rickrolling, ja, also Chat, ich hab paar Themen, die wiruns die nächsten Streams unbedingt angucken müssen, aber ich hatte in den letzten Tagenwenig Zeit, wir müssen uns unbedingt angucken, also was, was ich mir schon eine Weile anguckenwill ist ein bisschen WebAssembly Zeug, einfach, dass ich mal ein bisschen Ahnung hab, wahrscheinlichmit Rust, dann müssen wir noch ein bisschen an der Monitoring-Geschichte weiter programmieren,äh, programmieren, was erzähl ich denn, weiter, weiter basteln und ich muss noch wasfür ein Fernsehen machen, aber das erzähl ich euch dann, wenn es soweit ist, dass wireine Analoge, ähm, Fernsehtechnik, fuck up, abfuck, nicht fuck up, abfuck, der Labelchamp,den hab ich ganz vergessen, ja, das Ding steht hier bei mir rum und geht nicht, das mussauch noch fertig gemacht werden, ja, tatsächlich, ne, der ist nicht tot, den muss ich fertigmachen, ich hab mir nicht umsonst dieses Gerät gekauft, zumal der Labelchamp eigentlich fastschon funktional ist, der ist eigentlich zu, sag mal mal, 70-80% fertig, ähm, und wisstihr wie ich auf das Thema WebAssembly gekommen bin, dass ich mir das unbedingt mal anguckenmuss, ich hab mir überlegt, ob man nicht, ähm, Videos im Browser abspielen kann, inSachen, die nicht vom Browser supportet werden, also im Prinzip, was wird vom Browser supportetan Videos, WebM, A264, Codec, ähm, ich glaub das war's zum größten Teil, oder, so, unddann hab ich gesehen, ne, die ToDo-App war doch nur zum üben, du meinst, du meinstCACW as a Service, ach ne, du meinst diese andere ToDo-App, wo, ja Moment, die ToDo-App,die haben wir, die haben wir doch, die haben wir doch nur gebaut zum üben von's Welt damals,das war ToDo-App, niemand braucht die ToDo-App, das war einfach, ToDo-App gibt's 30 Milliardenim Internet, ne, das war einfach nur zum üben, ja, und dann hab ich, dann hab ich Folgendesgefunden auf GitHub, FFmpeg, Wasm, ja, irgendwelche verrückten Leute haben FFmpeg, äh, cross-compiled,so dass es jetzt über WebAssembly im Browser läuft, es ist mittlerweile, ich sag euch,Browser sind eigene Betriebssysteme, mittlerweile, und es kommen so viele coole Entwicklungennoch für Browser, wo man halt echt sagen muss, das ist quasi fast schon egal mittlerweile,was man für einen Unterbau hat, Hauptsache es gibt einen Browser, ja, zum Beispiel, dasneueste was angesagt ist in Browsern ist, ja, also Hype ist aktuell ziemlich WebAssembly,dann ist WebGPU voll angesagt aktuell, es gibt noch kaum Browser-Unterstützung, aberdas ist so, im Kommen, das ist quasi noch mal eine Stufe tiefer als WebGL, dann gibtes WebCodecs, gibt es noch, was dann besseres Video-Rendering im Browser macht, es gibtso viele, es gibt so viele Sachen, ja, und wisst ihr, wisst ihr was das, was das Bitteredabei ist, wenn man sich das hier mal anguckt, so can I use, und ihr gebt mal irgendwas,ein irgendwas halbwegs modernes, keine Ahnung, WebCodecs, ich weiß, weiß gar nicht ob manhier was nehmen kann, kann man hier gar nicht suchen, zumindest, ihr werdet feststellen,wenn ihr irgendwas halbwegs modernes sucht, Safari supportet den Scheiß immer nicht,also ganz ehrlich, Safari ist der schlimmste Browser und noch, Safari ist der neue Internet-Explorer,ja, und noch schlimmer, warte mal, was hatte ich denn heute Morgen, ja, es gab ja mal sowaswie Media Extensions zum Beispiel, sowas wie Media Extensions gab es ja mal, das warso ein Versuch Video-Playback zu machen, aber hat sich nicht so wirklich durchgesetzt, weilihr seht es, im Endeffekt, es unterstützt zu jeder Browser, Safari war ein bisschenlangsamer, aber, was unterstützt es nicht, eine ganz wichtige Plattform, Safari und iOSunterstützt es nicht, und das hier steht unterstützt ist debated, wirklich unterstütztwird das ganze nur von, auf dem iPad, nicht auf dem iPhone, also es ist schlimm, Safariist der neue Internet-Explorer, ich mein, sogar so Sachen wie WebP und sowas, brauchendie ewig, oder WebM Unterstützung hatten die beispielsweise auch ewig nicht, jetzt guckteuch das mal an, WebM ist Standard, das ist ewig schon, ihr müsst euch das mal angucken,die erste Unterstützung gab es in Chrome 6, in Chrome 6, das müsst ihr euch mal vorstellen,den ersten Partialsupport gab es in Chrome 6 und in Firefox 4, aber Safari denkt sichso, ne, das brauchen wir nicht, und das, wenn ihr hier guckt, das ist übrigens auch derdefault WebRTC-Codec, was natürlich nochmal doppelt dumm ist, wenn das Safari nicht kann,so, mittlerweile ist es halt in Safari so, Safari kann es theoretisch, aber es ist hintereinem Config-Switch versteckt, und niemand schaltet das an, außer er hat eine eigeneAnwendung, die es braucht, und will das machen, also du kannst nicht was im App-Store veröffentlichen,was da drauf setzt oder so, weil im Prinzip, nachdem es ja nur Safari gibt unter iOS, esgibt ja kein, es gibt ja nicht wirklich, es gibt zwar die App, die so heißt, aber istes nicht, es gibt ja nicht wirklich Chrome und Firefox unter iOS, das ist ja alles Safarireprended, sind natürlich auch die Webviews, die man in der Anwendung hat, letztendlichSafari, und wenn Safari irgendwas nicht kann, dann kann das das auch im Webview nicht, zumalWebview in der Regel noch deutlich restriktiver ist als die richtige Safari-App, auch ganz,ganz bitteres, Progressive-Web-Apps, gibt's wieder nicht, Notification, weiß ich, Web-Notifications,gibt's wieder nicht, warum, warum gibt es die coolen Sachen immer nicht auf Safari undgerade auf Safari iOS, das ist so ein Abfuck, ich mein, die wissen genau, dass es eigentlichunmöglich ist, was rauszubringen, was nicht auch Safari iOS berücksichtigt, außer manmöchte halt irgendwie Millionen an Kunden außen vor lassen, das will natürlich keiner,jemand, der eine Web-Service rausbringt oder eine App dafür rausbringt oder eine App rausbringt,der muss auf, ich mein, heute sind 80% der User bei so was auf Mobilgeräten unterwegsund das meiste ist für Android, aber ein Riesenteil ist auch iOS, ja, aber das gleiche könnteman, das gleiche könnte man ja bei Android auch sagen und Android ist da besser, Androidunterstützt den meisten Krämpel und sogar Web-Notifications, Android Chrome und solcheSachen, also das funktioniert, der Preis-Champ, der konnte zum Beispiel unter, also als esihn noch gab, konnte der Preis-Champ, wenn eine Grafikkarte in deiner angegebenen Price-Rangedrinne war, konnte der dir eine Notification schicken, das ging aber nur auf dem Desktopoder auf Android, das ging nicht an Safari, weil Apple sich denkt, Moment, das benutzeich selten, aber das muss man jetzt mal machen, Apple denkt sich, genau das denkt sich Applebeim Support von Safari, Keyukon, lange nicht gesehen, ja, schön, dass du wieder da bist,28 Monate, Samuel, danke für 7 Monate Subscription, was ich so spät mache, ich streben jetztbis 22 Uhr und dann gehe ich ins Bett gehen, tja, ja, aber die hätten doch, das was ichmeine, die hätten ja prinzipiell die gleiche Motivation dahinter wie Apple, aber sie machenes nicht, dafür macht, dafür macht Google etwas andere, fragwürdige Sachen, ja, zumBeispiel, mal gucken, wie es hier aussieht, ich weiß nicht, ob ihr auch schon die Ehrehabt, gucken wir mal, ob es hier auch so ist, nee, hier sieht es noch normal aus, hier siehtes in dem Firefox aus, probieren wir es, wir machen einfach mal ein paar Browser auf undgucken uns das an, what the fuck, warum sieht das so ästlich aus, also hier habe ich esnoch nicht, hat jemand von euch schon die neue, die neue Navigationsleiste oder dieseneue Video, nicht Navigation, den neuen Videotitel auf YouTube, guck, wie beschissen das aussieht,hier, guck mal, das ist neu, was ist das, also jetzt mal, jetzt mal seriously, wer, welcherLow IQ Designer hat er sich gedacht, das ist eine gute Idee, vor allem, ich meine, wasist das denn bitte für eine Usability, was ist das für eine Usability, mach die Kommentarerechts, wer zum Geier will so Kommentare lesen, wer will so ernsthaft, seriously, wer willso, wie beschissen, alter, wer will so Kommentare lesen, man, und wisst ihr, was das, was dasverdächtige ist, wenn YouTube sowas macht, die pushen gerne solche Changes und nach einemdreiviertel Jahr oder so wird das Standard, also ganz ehrlich, wer will diesen Scheißals Standard haben, ja, und ich glaube, tatsächlich, also ich könnte mir das wirklich vorstellen,dass YouTube irgendwann, ich glaube es nicht wirklich, aber ich könnte es mir irgendwievorstellen, dass YouTube die Kommentare abschafft und dann auch mit der Begründung, die Leutesollen sich safe fühlen oder sowas, das ist ja die neue ultimative Begründung, die mittlerweileüberall rausgehauen wird und irgendwie aus mir nicht verständlichen Gründen auch überallgelten gelassen wird, ja, auch wenn es damit gar nichts zu tun hat, so nach dem Motto, dasist alles so negativ, die Leute könnten sich da gekränkt fühlen, da fühlen sich die Leutenicht safe in den Kommentaren, deswegen schaffen wir die Kommentare ab, ja, anstatt das Kommentarsystemweiter zu verbessern, nein, schafft man sie dann im Zweifelsfall ab, es ist genauso wiemit den Videobewertungen, wo ja auch erzählt wurde, die Videobewertungen werden abgeschafft,dass keiner Hate-Bewertung abgibt und sowas, sowas bescheuertes, Alter, und das Schlimmeist, dass du das heute überhaupt so argumentieren kannst und dass die Leute dann auch nochfressen und das glauben, dabei ist es so offensichtlich, dass das irgendeine Marketing-Stonks-Geld-Money-Entscheidungist, als würde es ernsthaft YouTube irgendwie interessieren, ob sich da irgendeiner, diepersönlichen Gefühle der Leute interessiert, YouTube doch nicht die Bode, wenn die dasinteressieren würden, dann hätten sie zum Beispiel bessere psychologische Betreuungfür ihre, genauso wie bei Facebook, für ihre Content-Kontrolleure, die das nicht längerals ein halbes Jahr machen können und teilweise sich schon umgebracht haben, weil sie sichden ganzen kranken Scheiß angucken müssen, die die Leute hochladen.Das ist einzig und allein eine Stonks-Geld-Entscheidung gewesen, die Kommentare abzuschaffen, deswegenkann ich euch nur empfehlen, Leute, was ist was, was möchte, was, warum war da eben keinanderes Symbol oben? Chat, wart ihr das? Wer ist es gewesen? Wer hat das andere Symbolda gerade oben hingemacht? Die Hacker-Mans im Chat waren's wieder. Weiß war's, ne, werwar's denn jetzt? Jetzt Chat, gebt euch zu erkennen, wer ist es gewesen? Ich glaub jaKyokon war das. Der war so lang nicht da. Was wollte ich jetzt sagen? Ja, deswegen kannich euch nur empfehlen, wenn ihr, ich kann nicht mal meinen, ich kann noch nicht malmeinen eigenen Namen schreiben, ja. Wenn ihr auf YouTube seid und dann zum Beispiel aufmeinen Channel geht, ihr müsst, Return YouTube Dislikes, oder ne, wie heißt dieses Addonüberhaupt? Return YouTube Dislikes müsst ihr euch installieren. Das ist erstaunlichakkurat. Soll ich euch mal sagen, wie genau das ist? Soll ich mal kurz reingucken beimir? Also wie gesagt, ich bin hier nicht eingeloggt, ne, also normalerweise kann ich das nichtsehen. Das ist erstaunlich akkurat. Ich sag's euch mal, wie genau das ist. Achso, fuck,wo sieht man diese Bewertung überhaupt jetzt? Ja, ich hab 1037 Daumen hoch und neun Daumenrunter und das Plugin hat das quasi, obwohl es das gar nicht sehen kann, auf acht geschätzt.Das ist nicht schlecht. Obwohl das Plugin halt total versagt, geh ich mal von aus, vermuteich, rate ich jetzt mal, ist, wenn du einen Channel hast, der so das Like Dislike Verhältnishat von meinem und der lädt dann auf einen Schlag was super kontroverses rauf und esentspricht überhaupt nicht mehr so dem, was ihr Algorithmus gelernt hat über diesen Channel,dann könnte es wahrscheinlich komplett nebendran liegen. Ich mein, die machen ja mehrere Sachenin diesem Addon, das beschreiben die hier auch irgendwo, was sie genau machen, um dieDislikes zu errechnen. Also die haben ein, einfach ein soziales Experiment. Schminkvideomit dem Friseur steht eh noch aus, ja, seit 50 Jahren. So, die haben ja, weiß ich, obsie hier irgendwas erklären, wo sie das machen. How does it work? Genau. Also, ja gut, dasist natürlich sehr, ja. Also, die Leute sharen das. Die Leute, die eingeloggt sind, dieseExtension installiert haben, die können das mit sharen und die machen das aus historischenDaten fest und im Hintergrund Auswertung, Comment, View, Ratio und sowas, Like zu Comments, Likeszu Views und so. Aber man sieht insgesamt, das funktioniert nicht schlecht, das kommtgut hin. Es liegt nur ein Dislike daneben. Ja, normalerweise würde ich sagen, ja, okay,bei meinem ist es jetzt besonders korrekt gewesen, aber ich denke mal, so ungefähr wird es beianderen Videos auch stimmen, ja. Es ist doch jetzt egal, ob ein Video 50 Dislikes hat oder250 Dislikes hat, wenn das so im Verhältnis ungefähr stimmt. Wichtig ist, dass man ebenerkennt, welche Videos einfach Schrott sind und welche nichts. Und das ist ja auch meinKritikpunkt an diesem Entfernen gewesen, der Dislikes, dass du gerade im Technologiebereich,wenn du dir Talks anguckst von irgendwelchen Konferenzen, die einfach shit sind oder irgendwelcheindischen Tutorial-Videos hast, wo es eigentlich kaum ums Thema geht oder irgendwas, was ichauch geil finde. Manchmal, kennt ihr diese Videos, da steht da irgendwie so, keine Ahnung,how to frontend development, Vue.js, bla, bla, bla, wie man was macht. Dann klickstdu das Video an, auf einmal redet dann einer Indisch. Also Moment, also dieser Titel istdefinitiv nicht einfach nur, weil das die ähnlichen englischen Wörter sind, sondernweil er es explizit auf Englisch geschrieben hat. Das verwirrt mich dann auch immer. Duhast ein Video, komplett englischen Titel, mit genau dem Problem, was du hast und hastso ein Inder im Video, wo du nichts verstehst. Und dann ist wichtig, dass man sowas direkterkennen kann. Gut, mein Inder erkennst du gleich, den verstehst du nicht, aber geradeKonferenz-Talks und Tutorials ist das wichtig, dass man Dislikes hat, weil ansonsten erkennstdu schlicht und ergreifend nicht. Ich guck mir doch nicht eine Stunde einen Konferenz-Talkan, um dann vielleicht bei der Hälfte festzustellen, da kommt jetzt nichts Interessantes. Das finggern zu Indisch, das ist ein Fivehead, so vorbildlich. So sollte man das machen. Boah,Leute, mir fällt gerade noch Sache ein. Ich sag euch aber gleich, das gucken wir uns nichtim Stream zusammen, man. Ich hab letztens ein ultra Fremdschirm-Video gesehen auf YouTube,nicht meins, nicht meins, könnte auch so sein, aber ich hab ein Video gesehen von irgendeinem,von der ARD oder so, weiß ich gar nicht genau. Also es hat irgendeiner von Funk auf jedenFall produziert und da haben sie so zwei Twitter-Eltern, so zwei empörte Twitter-Eltern begleiteteinen Tag lang mit ihrem Kind. Alter, diese Leute waren so fertig. Die waren so fertig,das war richtig cringe, Alter, ich konnte mir das kaum angucken. Das Kind ist irgendwiezwei oder drei oder glaub ich jetzt, nee, nee, ich glaub vier mittlerweile und es legit,pass mal auf, die durfte, das Kind durfte keine normalen Kinderbücher lesen, sondernmusste Kinderbücher lesen wie My Little Feminist Family und so was. Und da hab ich auch gedacht,what the fuck, Alter, was ist mit euch los? Oh no, ja. Ich dachte erst ohne Scheiß, alsich das gesehen hab, als ich das gesehen hab, ich dachte erst, das ist ein Witz, ja, alsoich dachte, das ist im Endeffekt Satire, so könnte man sagen, ist es aber nicht, diemeinen das wirklich ernst. Ja, ach du hast das auch geguckt, ja. Jaja, genau, das Kind,das Kind, das ohne Gender erzogen wird. Alter, das war so cringe, meine Güte, die Leutewaren auch noch so überzeugt davon. Ich hab nur Schwierigkeiten, das durchzuhalten. Ja,genau, die hab ich ja auch an, deswegen seh ich das ja auch. Übrigens, wisst ihr, wisstihr, wer wieder geschrieben hat? Ihr werdet es kaum glauben, mehrfach, mehrfach. ZweiSachen, ratet mal, ratet mal zwei Sachen, die mir wieder Sponsoranfragen geschriebenhaben, zwei Sachen, zwei verschiedene Sachen. Wahrscheinlich kommt ihr drauf, weil es istziemlich offensichtlich. Raid, ja, Raid ist das eine, Raid, Raid, korrekt, korrekt, unddas NordVPN, du, Major Laser, du hast erraten, NordVPN und Raid Shadow Legends, korrekt.Und witzigerweise, Raid Shadow Legends ist mega hartnäckig, die schreiben mich gerademit vier, von vier unterschiedliche Leute an. Vier unterschiedliche Leute. Also, habendie alle Werbeagenturen der Welt beauftragt oder was? Quatsch, ich mach mit denen nix.Das ist Schwachsinn, die Jugend wird nicht den Bach runtergehen. Die aktuelle Jugendist mehr Five Head, als man sich das vorstellen kann. Deswegen finde ich es immer blöd, wennLeute, sagen wir so, in meinem Alter und plus, so tun, als sind alle jungen Leute doof.Das ist nicht so. Die jungen Leute sind nicht doof. Die jungen Leute sind im Verhältnisgenauso doof und schlau wie die älteren Leute. Ein Faktor gibt es aber. Manche Sachen, damacht es die Erfahrung auch ein bisschen aus. Zum Beispiel, diese ganzen Scams, komm indie Gruppe, kauf meine Stonks, du wirst reich, die ganzen Scams, die es überall gibt. Ichglaube, manchmal muss man einfach, da muss ein paar Jahre ins Land gezogen sein, vielleichtmuss man auch schon mal gescampt worden sein und dann lernt man es vielleicht früher oderspäter, dass wenn die Leute versprechen, sie machen dich reich und nur sie wissen,wie das geht, dass das in der Regel nur zum besten dieser Leute ist und nicht für dichselbst. Das ist wieder was anderes. Die alten Leute fallen auf den Enkeltrick rein odersolche Dinge. Na gut, es gibt ja auch noch den Handwerkertrick, das ist quasi der Enkeltrickfür etwas Jüngere. Ja, das gibt es schon. Aber gerade so diese Beschisssachen, die esgibt, auch von Schneeballsystemen und sonst was. Ich glaube, manche Sachen muss der ersteMal am eigenen Leib erfahren haben oder oft genug das mitbekommen haben, wie es passiertist und realisiert haben. Die meisten Leute, die versprechen, dass sie dich reich machen,wollen dich scammen. Übrigens, wisst ihr, was das erste Mal war, wo ich gescampt wurde?Nichts Schlimmes. Nichts Schlimmes. Aber wo ich mich richtig krass gescampt gefühlthabe, mir hat in Diablo 2 einmal einer meine Windforce gescampt in einem Trade. Falls jemandDiablo 2 gespielt hat, der weiß Windforce ist so ziemlich der beste Bogen im Spiel,gerade wenn man Amazone spielt und der hat Trade-Window-Trick, was es in fast jedem MMOoder Action-RPG mit Trade in irgendeiner Weise schon gegeben hat. Also was ist Trade-Window-Trick?Trade-Window-Trick ist also Trade-Window D2. Ich zeige euch einfach mal was hochaufgelösteres.Zum Beispiel das Path of Exile Trade-Window. Das sieht fast genauso aus wie das Trade-Windowaus Diablo 2, nur ein bisschen mehr High-Res. Das ist halt ein Trade-Window. Und was passiertbeim Trade-Window-Scam und was man dagegen machen kann? Naja, man tauscht einfach Sachenaus, die entweder so aussehen, wie die eigentlichen Sachen die man haben will. Ja zum Beispielhier tradet einer in Path of Exile einen Stab mit drei Sockel in dieser Farbe. Was jetztpassieren kann ist, dass der sich das anguckt, drüber geht und sagt ah ist alles okay. Alsoder hier, der oben und dann tauscht er den Stab aus gegen einen anderen Stab, der auchgenauso aussieht mit den gleichen Sockel und wenn du dann halt nicht guckst bist du gescammt.So und sowas in der Richtung ist mir in Diablo 2 auch passiert mit dem ziemlich poggers Bogen.Ja, Trade-Window-Scam gibt es und das einfachste ist, sobald ihr mitbekommt, dass irgendjemandin den Trade-Windows, das ist jetzt für alle Spiele mit Trade, wenn einer anfängt rumzu klicken in den Trade-Windows, bricht den Trade ab. Es gibt keinen Grund, dass du indiesem Trade-Window die Items 50 mal klicken musst, rein oder raus legen, gibt es nicht.Der einzige Grund ist Scam und das ist sowas, das lernt man einfach nur durch Erfahrung,das weiß man noch nicht. Ja, es ist im Prinzip auch wie BitConnect, ich meine ernsthaft,irgendjemand der BeConnect geguckt hat, war der Meinung, das ist kein Scam und das isteine legit Unternehmung, der man Geld geben soll und da frage ich mich jetzt, wer siehtso ein Video? Also wer guckt sich sowas an? Wer guckt sich sowas an? Es reichen schondie ersten 10 Sekunden und denkt sich, jawoll, denen gebe ich mein Geld. Wirkt das in irgendeinerArt und Weise seriös, als sollte ich denen mein Geld geben? So und das haben sich Leuteangeguckt und haben daraufhin gesagt, jawoll, Carlos, nimm meine Kohle. By the way, es hatsich ja im Nachhinein rausgestellt, die Leute, ich hab's nicht mehr so genau im Kopf, alsonehmt das mal mit einer Portion Skepsis, kann sein, dass ich euch jetzt Mist erzähle, aberich bilde mir ein, ich hab sowas mal gelesen, die Leute, die hier auf der Bühne standenwussten gar nicht um was es geht, das war einfach nur Show, dann stell dich mal aufdie Bühne. So, okay, das reicht jetzt, das reicht jetzt. Wer hat sich gedacht, dengebe ich mal, wobei, der Typ wurde ja auch gescampt, aber wer hat sich gedacht, kennstdu den Typ mit dem 2 Millionen, ja, das hab ich schon gesehen, da gibt's ein Video von,gibt's ein Video zu, dieser YouTuber hat fast 2 Millionen Videos veröffentlicht, aberich weiß nicht, ob das mal, ob das jetzt noch mal kurz hier abzuschließen, oh ne, derInsimodus, das ist so dumm, das hab ich mir gemerkt, alter, der Insimodus wurde aktiviert,das klingt immer noch zu geil, alter, der Insimodus, ich fass es nicht, egal, so, aber um die Sacheabzuschließen, also niemand, der ernsthaft noch seine Tassen alle im Schrank hat undvielleicht schon mal mitbekommen hat, dass die Leute öfters mal gescampt werden, gerademit solchen Sachen, gibt den Leuten oder hat den Leuten von Bitconnect sein Geld gegeben,das ist das, was ich mein, manchmal brauchst du einfach ein bisschen Erfahrung, weil duweißt, wenn die Leute versprechen, sie machen dich reich, dann ist es Schwachsinn, hey,ich sag nicht, dass da keiner drauf reinfällt, aber es ging ja darum, dass alle Boomer, alleZoomer doof sind und das ist ja nicht so.Das ist tatsächlich so, ja, wir haben auch dumme Sachen gemacht und wisst ihr, wisstihr was ich mich teilweise frage?Ich bin letztens an meiner alten Schule vorbeigelaufen und irgendwann Nachmittags und die haben jetzteinen neuen Parkplatz, früher war das so, da gab es einen Parkplatz vor der Schule,keine Ahnung, acht Stellplätze oder so, das war im Prinzip für die Lehrer oder wennmal irgendwie Nachmittags da einer hin musste oder so, war im Prinzip für die Lehrer undansonsten, manchmal wurden die Kinder vorbeigebracht, aber zu 90% sind eigentlich früher die Kinderimmer mit dem Fahrrad gefahren oder in die Schule gelaufen, ja, das war ja auch nichtweit, aber ich bin letztens bei mir an der Schule vorbeigegangen mittags und die habenjetzt einen extra Parkplatz, mal kurz Musik an, die haben jetzt einen extra Parkplatz,weil es morgens zu viel Stress gegeben hat, weil die alle ihre Kinder nicht mehr abliefernkönnen und da frage ich mich immer so, ich meine, wir haben den Kram überlebt und meineOma hat auch irgendwie überlebt, wie haben die das eigentlich gemacht alle, wie habenwir das überhaupt überlebt, das ist doch eigentlich gar nicht möglich, also müssteman sich halt denken, ja, also ich meine, ich verstehe beispielsweise nicht, warum dudie Kinder unbedingt mit dem Auto zur Schule fahren musst, ich meine, ich wäre auch gernezur Schule gefahren worden, ja, das ist angenehm, es ist angenehm, aber ich meine, du musstdoch nicht bei jedem Schritt und Dritt dabei sein, ja, und also, ist so schlimm, fahreich Fahrrad, fahre ich jetzt auch nicht, ja, so ist es, ja, CSGO Skin Trades, das ist genauso was in der Richtung, doch, ist so, doch, doch, doch, doch, genau das passiert auchin den Trade Windows, sobald er das Item bewegt, ist er weg, aber du musst dann erneut bestätigen,aber wenn der Typ das 3, 4 mal rein und raus zieht, dann guckst du vielleicht nicht malrichtig nach, ja, zumal das ja noch heimtückischer machen kannst, es gibt ja Items, die sindultra viel wert, weil sie 2, 3 Stats in der richtigen Kombination haben und dann hastdu was mit vielleicht schlecht gewürfelten Stats, aber den gleichen Stats, was genauso aussieht und dann guckst du drüber, wenn das wieder hingeht, der Verify Button unddann guckst du nicht genau auf die Zahl, also Trade Scam is real, mittlerweile versuchendie Leute, versucht man da ein bisschen vorzubeugen, aber damals wurdest du Diablo 2 quasi dieganze Zeit versucht zu Trade Windows scammen, im Trade Channel, übrigens, ich hab mir dasVideo tatsächlich nochmal angeguckt, wir haben ja letztens nur den Ausschnitt geguckt, woApoRed den Insie Modus aktiviert hat, wobei ich glaube ich hab's zugemacht, boah, waswar das denn, irgendein Musikvideo, ich hab mir das jetzt nochmal angeguckt das Videound wisst ihr, was ich mir so gedacht habe, ich hab keine Ahnung ob das stimmt, alsoerstens hab ich mir dabei gedacht, das ist ganz schön blöd, quasi öffentlich zuzugeben,dass man den Staat bescheißen will, indem man Privatinsolvenz anmeldet und dann im Auslanddie fette Kohle macht, so, das öffentlich zu sagen ist schonmal blöd, aber wisst ihrwas deutlich wahrscheinlicher ist oder was naheliegender ist, was ich so noch gar nichtgehört hab, aber was mir sofort eingefallen ist, vielleicht denkt er sich das einfachnur aus, vielleicht ist es ihm peinlich Insolvenz anmelden zu müssen, das kann ich mir gutvorstellen, wär's mir auch, vielleicht ist das einfach nur ne Story, dass es nicht sopeinlich wirkt, dass er Insolvenz anmelden muss, dann kann er sowas ja erzählen, alsofinde ich witzig, dass das kommt, ja den Anwalt YouTuber haben wir letztes Jahr den Ausschnittgeguckt, der Insimodus, das ist finde ich die viel naheliegendste Variante, ich meinder hat schon ein paar doofe Sachen gebracht in der Vergangenheit, aber dass er so unvorsichtigist und wenn er dann den Staat da um Geld scammen will und dann sich öffentlich im Videohinstellt, kann ich mir nicht vorstellen, das ist irgendeine Story, weil es ihm peinlichist, dass er Insolvent ist, was ich auch voll verstehen kann an der Stelle, also insofern.Hast du, du hast doch für die China-Chinesen gerät ein eigenes WLAN, ja hab ich. Wie bekommeich das günstig hin, würde da, ja, also Mikrotik kann mehr oder weniger alles wasman braucht, die haben WLAN Support, du kannst mehrere SSIDs haben, das ist kein Ding, wobeiich sagen muss, die haben mich nicht so überzeugt, die Mikrotik Access Points, ich hab mir dasaktuelle Lineup aber nicht angeguckt, ich bin riesen Fan was Mikrotik Router und Switcherangeht, gerade im Heimbereich und wenn es preisleistungsmäßig gut sein soll, man kannsich sowas ohne Probleme auch ins Rechenzentrum hängen, ja, fand ich witzig, könnt ihr euchauch dran erinnern, es war mal irgendeiner im Stream, da hab ich gesagt, ja, im Zweifelsfallkannst du dir so ein Mikrotik auch ins Rechenzentrum hängen, da hat der Typ dann hier, es könnenauch die Kommentare von YouTube gewesen sein, ich weiß es nicht mehr, wo so ein Besserwisserwieder am Start war, so nach dem Motto, ha lol Max, sowas hängt man sich doch nicht inein Rechenzentrum, in ein Rechenzentrum da kommen Cisco Geräte hin oder DLG, aber Mikrotik,das kommt nicht ins Rechenzentrum, als weiß der das, ja, als kennt er jedes Rechenzentrumund auch ein paar billige, die auf ein letztes Loch pfeifen und aufs Geld achten müssen undweiß das, ja, mit Sicherheit, mit Sicherheit gibt es mehr als genug Serverräume und Rechenzentren,wo auch, wir reden jetzt ja hier nicht von einem DC Style Riesenrechenzentrum unterirdisch,es wird genug Rechenzentren geben, wo Mikrotik Geräte rumhängen, es wird genauso gut auchdie ein oder anderen Racks geben, wo tatsächlich Ubiquiti Dinger drinnen hängen, wobei ichdas wirklich nicht ins Rechenzentrum hängen würde, aber was anderes, davon auszugehen,dass die Leute nur die super krass hochpreisigen Netzwerkgeräte da reinhauen, ist bescheuert,weil das kostet einfach ein Schweine Geld, guckt euch mal Preise von aktuellen CiscoSwitches an, du kriegst beim Mikrotik einen richtig guten Switch oder einen richtig gutenRouter für irgendwas um 1000 Euro, also richtig fetten, bei Cisco bezahlst du dann 35.000Euro, also der Grab ist mega teuer, deswegen, das hat schon seine Daseinsberechtigung, wennich das Geld hätte, dann sieht das anders aus, aber viele müssen halt tatsächlich einbisschen drauf gucken, was sie ausgeben, deswegen so besser wisseregen mich dann auch immerauf, so als wüssten sie das irgendwie, wie das auf der ganzen Welt so zu sein hat, ja.Guckt dir mal die Elon Musk Stream hier auf Twitch an, was Elon Musk hat streamt auf Twitch,das ist doch Scam, oder? Das ist das, was beim M-Core auf dem Channel gelaufen ist,wo er sein Channel gehackt wurde, diese Scams, ach Deepfakes, ernsthaft? Geil. Ihr hattetmit dem Mikrotik immer LZ und es war Shit, ja, das ist natürlich nicht gut. Ok, SwitchOSist auch Pain in the Ass, ja, mit SwitchOS bin ich auch noch nicht warm geworden, aberda sieht man es, es gibt ja offensichtlich Rechenzentren, wo Mikrotik steht, zum Beispielin eurem, zumindest mal kurzzeitig. Ja, ichkenne sogar eins, ich kenne sogar zwei, wo eine Fritzbox ist. Das eine ist bei mir aufder Arbeit, da gibt es nämlich einen kleinen Technikraum mit zwei Racks drinnen, das könnteman quasi so grob als Rechenzentrum klassifizieren, da stehen zwei Racks drin und neben, auf demSchrank neben den Racks, liegt eine Fritzbox. Und wisst ihr wofür die Fritzbox da ist,das ist gar nicht so dumm, wie es auf den ersten Blick erscheinen mag, dass da eineFritzbox da liegt, tatsächlich, ja, ja, ja, ja, da ist ein Notfalltelefon dran, das isttatsächlich richtig, habt ihr gut geraten. Aber hauptsächlich ist es dafür da, da istnämlich ein extra Internetanschluss hingelegt worden. Sollte mal bei uns wirklich irgendwiedie super krasse Hacker-Scheiße am Start sein oder totaler Netzwerkzusammenbruch oder wasauch immer, in dem Raum gibt es Strom, gut Strom gibt es im EZ auch, aber da gibt esnochmal extra Strom und es gibt einen DSL-Anschluss mit der Fritzbox, unabhängig von komplettdem restlichen Netzwerk im Haus. Der Raum ist übrigens abgeschlossen, nur mal so, alsoes ist nicht so, dass da irgendjemand reingehen kann und sagen, im Moment, die Jungs, ichstöpsel mich mal kurz an die Fritzbox an. Also, ist gar nicht so doof, ist gar nichtso doof, dass es das gibt. Und den zweiten Raum, den ich kenne, war beim ehemaligen Arbeitgeberim, das war nicht wirklich ein Rechensendung, es war auch so ein Abstellraum, da hing aucheine Fritzbox. Es hat seinen Sinn, kann durchaus seinen Sinn haben, dass da eine Fritzbox baumelt.Das ist Pfeilfeld, ja. Hattet ihr noch eine Frage zu deinem Video, Leute, ich muss langsamer,ich muss langsamer, entspannter und ruhiger reden und zu, mein Hals wieder weh. Das mussja nicht sein. Wir machen jetzt ASMR-Stream. Ne, machen wir nicht. Also, ich habe aucheine Frage zu deinem Video von heute. Gibt es solche Probleme eigentlich auch bei macOSin meinem Bekanntenkreis heißt es immer, dass das System so sicher ist. Also, das Videovon heute, was ich gemacht habe, da ging es ja. Wollen wir uns das Video noch mal zusammenangucken und ihr könnt dann was fragen und ich sage noch ein paar Sachen zu, weil eshaben sich ein paar neue Erkenntnisse ergeben in der Zwischenzeit. Zumindest es geht indem Video darum, also es geht, aber ihr müsst das Video danach, ich reakte jetzt auf meineneigenen Content von heute. Das ist quasi so krasses Content-Recycling, das ist 11-Headschon. Das müssen wir eigentlich auf das, also in dem Video geht es darum, nur mal ganzkurz, oder wie Semper Video sagen würde, in diesem Video nur ganz kurz, also es gehtum eine neue Sicherheitslücke aus der Kombination Word plus Windows. Und zwar, Word ist insofernbetroffen, dass man, ich mache jetzt mal ganz kurz einen Recap, vielleicht müssen wir esuns gar nicht angucken, aber um das hier beantworten zu können, muss ich da ein bisschen ausholen.Also, genau, also es gibt eine Sicherheitslücke in Word, die es erlaubt Templates nachzuholen,also Teile, so wie das funktioniert ist. Also du kannst in Word Templates nachladen, dasist auf Deutsch sowas wie Dokumentenvorlage. Nur hat sich irgendein extrem Sixheader beiMicrosoft gedacht, es ist eine gute Idee, dass man diese Dokumentenvorlagen auch übersInternet nachladen kann. Wozu das gut sein soll, ich habe keine Ahnung. So, und ein,tja, da reichen sechs Köpfe gar nicht mehr. Ein Sevenhead bei Microsoft hat sich danachgedacht, es ist noch besser, wenn wir an unsere Templates Embedded HTML mit JavaScript erlauben.Das heißt, du kriegst jetzt Microsoft Office Word Dokumente, Vorlagen, Word Vorlagen manipuliertmit Embedded JavaScript und das ist vollkommen okay und Microsoft sagt, das ist ein Feature,das muss so sein. Wenn du diese Dokumente öffnest, dann lädt Microsoft automatischden JavaScript Code und führt ihn aus. Warum es das macht? Weil sie bescheuert sind, keineAhnung. So, und dann kann man hiermit, ja, dann kann man mit diesem manipulierten JavaScript,das ist nur ein Beispiel, es gibt noch mehr. Ja, also so sieht der Payload aus, der HTMLPayload in dieser Word Vorlage und im Endeffekt passiert Folgendes, die tricksen hier einbisschen rum mit ganz vielen A's am Anfang, das dient dazu, dass man an der richtigen Speicheradresseist, also wozu sind die ganzen A's, das ist, dass man an der richtigen Speicheradresseist, dann wird das umgebogen, die Adresse, auf die das JavaScript zeigt oder auf dem dasaktuelle Browser Fenster zeigt, von HTTP quasi auf MS-MSDT und MS-MSDT dahinter stecktein lokales Windows Programm, wo man eigentlich irgendwelche Remote Hilfen drüber anbietenkann oder irgendwas, irgendwas bescheuertes in Windows und zumindest kann man darüberdann eine PowerShell starten im Kontext von Word, also im Kontext vom aktuellen User unddann dementsprechend alles auf dem System machen, was man will. So, ich sag, wir könnenuns das gleich zusammen noch mal angucken, aber um diese Frage zu beantworten, gibtes solche Probleme eigentlich auch bei macOS und eurem Bekannten, das heißt, das Systemist unsicher. Also, das sind ja zwei Probleme. Das erste Problem ist, dass Word, warum macheich eigentlich immer gerade ihn auf, so, das erste Problem ist, dass Word so beschissenist, genau, man muss doch atmen werden, das ist das einzige, was einen ein bisschen beschützt,also das erste Problem ist, dass Word so was bescheuertes mit Templates macht und das zweiteProblem ist, dass mit MSDST, ich hab schon wieder vergessen, wie es heißt, das sindzwei Probleme, deswegen ist auch jeder Windows-User betroffen, das stimmt, was ich da geschriebenhab, sind zwei unterschiedliche Probleme, die aktuell aber in Kombination ausgenutztwerden. So, und zu dieser Frage, also das erste ist, Mac hat ja auch Microsoft Word,ich hab aber keine Ahnung, ob das Word oder Office für Mac die gleichen Schwachstellenhat, das hängt davon ab, ob die ja zu den gleichen, den gleichen Basis haben, wie dasOffice für Windows. Zum Beispiel das Office im Browser hat es logischerweise nicht, alsohaben die die gleiche Basis und machen die das gleiche mit Templates, ist das erste Problemauch genauso unter MacOS. Das zweite Problem mit diesen MSD-Dingsbumms, MSDST-Excel, dasgibt es natürlich unter Mac nicht, weil ja das Programm gibt es unter Mac nicht. Potenziellgeht sowas aber auch unter Mac, weil der eigentliche Ablauf ist äußerst simpel, dulädst irgendwas runter und der nächste Schritt ist, es muss ausgeführt werden, das ist jadas Schwierige eigentlich. Egal um welche Virus oder wie Sempervideos sagen wir, Schadwäre, um die es geht, der erste Schritt, du musst es irgendwie auf das Gerät des Opfersbringen, das ist aber meistens noch das einfachere, du musst es irgendwie dazu bringen, dass esausgeführt wird und dass der Schadcode ausgeführt wird, das ist tatsächlich dann wiederum nichtso einfach, aber vom Ablauf her in dem Fall ist es total simpel und wenn du dir irgendwasrunterladen würdest und das ausführen aus dem Internet, dann hast du im Prinzip exaktdas gleiche unter jedem Betriebssystem und das gibt es unter Linux tatsächlich totaloft, ja es gibt unter Linux ganz viele Installationsanleitungen, die beispielsweise sowas hier als in ihre Installationsanleitungreinschreiben. Die sagen Installation ist ganz einfach, du musst einfach nur diesenBefehl ausführen um unsere Software zu installieren. So und dieser Befehl sieht normalerweise folgendermaßenaus, ja sinngemäß sowas wie curlcacw.omega-poggers.org slash install.sh gpiped nach bash, so am bestenauch sudo bash, das ist genau der gleiche Scheiß, ja du lädst irgendwas aus dem Internetrunter was du nicht kontrolliert hast und lässt es lokal bei dir ausführen, in demFall sogar noch mit Adminrechten, das ist genau der gleiche Müll wenn man nicht gucktwas man sich runter lädt. Also potenziell hast du so ähnlich gelagerte Probleme selbstverständlichunter jedem Betriebssystem, das heimtückische bei dieser Lücke ist jetzt eben, dass du esnicht erkennen kannst. Während du bei sowas relativ offensichtlich siehst, ok ich ladehier irgendwelche random Sachen von denen ich keine Ahnung hab aus dem Internet undführe sie in einer Rootshell aus, weißt du das ja bei Dokumentenvorlagen nicht. Du lädstdir eine Word Dokumentenvorlage runter, machst die auf oder startest den Explorer mit derVorschau und dann fängst du dir was ein. Und sowas gibt es natürlich auch unter allenmöglichen Betriebssystemen, ich würde aber sagen, dass das potenziell unter Windowsam häufigsten passiert, hauptsächlich aber, weil Windows das Hauptangriffsziel ist. Sicherlichauch, weil Windows irgendwie ja jahrzehntelange Exploiterfahrungen die Leute haben, aber manmuss sagen Microsoft macht den Angreifern schon in vielen Fällen wirklich das Lebensehr schwer. Und es ist nicht so, dass es easy wäre und dass Microsoft, es wird da immergerne auf Microsoft rumgebashed, dass Microsoft einfach nur doof wäre. Microsoft, ich glaubedas größte Problem was Microsoft hat ist, dass die jahrzehntelange Legacy Code habendennoch in Windows schlummert. Und es sind ja oftmals auch Sicherheitslücken in Bereichendie uralt sind. Letztens gab es beispielsweise eine Sicherheitslücke in der alten WindowsHilfe, ich weiß gar nicht mehr wie ich die aufmache Leute. Hat jemand einen Plan wieman die alte Windows Hilfe öffnet? Wie man das noch aufkriegt? Help? Ne nicht die HelpApp, die alte Windows Hilfe. Diese chf oder wie der Kram heißt, files oder ne nicht chf,ist immer noch drinne. Ne das ist nicht Chrono Trigger Musik, das ist ziemlich sicher MarioGalaxy. Nein ich mein die, die, wie heißen denn diese alten Windows Hilfe, wir macheneinfach 7zip auf, die haben glaube ich noch sowas. About, ne wo ist Help, Contents, dasDing meine ich hier. Da gab es nämlich letztens auch in 7zip eine Sicherheitslücke was dasangeht. Ja. So. Ich mein den Kram hier. Da gab es letztens auch eine Sicherheitslückeund Microsoft schleppt halt jahrzehntelange Legacy Scheiß mit sich rum. Und haben nochsolche Dinger drinne. Ich weiß noch da hab ich mal die Frau in der Bücherei von unsgeschockt früher. Also ich bin ab und zu mal früher in die Bücherei gegangen und dagab es auch einen Rechner, da konntest du dann irgendwie ne halbe Stunde umsonst benutzenund sonst musst du bezahlen oder komische Regeln. Zumindest konntest du damals, dieserRechner hatte irgendwie so ein komisches Windows mit so nem Kiosk, Kiosk Mode. Das war aberdamals noch frag mich nicht. Windows ist ewig her. Ich weiß nicht ob es noch 98 war oderschon 2000. Ist aber auch egal. Man konnte aus diesem, aus dieser Kiosk Box total easyausbrechen. Das hab ich random rausgefunden an dem, an diesem Rechner in der Büchereiund zwar, du musstest Word aufmachen, lustigerweise auch Word, ja. Du musstest Word aufmachenund dann musstest du in Word eine Verknüpfung einfügen und da geht ja so ein Dialogfensterauf, so wählen sie jetzt das aus, welche Verknüpfung möchten sie dann ausführenund da konntest du einfach CMD auswählen. Muss ich ja vorstellen. Da konntest du CMDVerknüpfung in Word machen und dann klicken. Oder hast du nen Shell gehabt. Geiler KioskModus, oder? Voll geiles Ding ab. Zumindest hab ich das der Frau versucht von der Büchereizu zeigen und die hat es halt überhaupt nicht gecheckt. Und die hat sich dann irgendwannaufgeschrieben, meint, ja das muss sie mal mit ihrem Computerleut besprechen. Die warauch grade nicht verwirrt danach. Kann ich auch verstehen. Die haben ja da keine Ahnungvon. Wie läufts mit Arch? Naja ich verwende ja im Prinzip schon Arch seit Jahren. Mitdem neuen hab ich jetzt nicht weitergemacht. Muss ich auch noch machen, das waren so vieleSachen, die man noch machen muss. Wurz gefixt, nee. Glaube nicht. Ich kann mich jetzt nichtdran erinnern, dass ich es irgendwann mal ausprobiert habe und es ging nicht, aber ich hab das danachauch nicht wirklich oft ausprobiert. Du hattest auch gleich Admin, ja das ist halt Fail. Wasfür ne Mode? MonkaS als Totenkopf, warum nicht? So also ok, weil ihr seid Leute, wir guckenjetzt das Video von mir an und ich sag euch noch ein paar Takte zu. Ist es nicht schlechtfür deinen YouTube-Kanal, dass du aus dem Homeoffice arbeitest? Ich mein die ganzenStorys, die du schon erzählt hast, wären so. Ach nö, ich hab doch auch genug Sachenerzählt, die nur nicht so lange her sind. Ja das Video kenn ich, das hab ich auch geguckt.Mal eine sehr oberflächliche Frage. Kann man ein, also ich hab nie Informatik studiert,ja, muss ich dazu sagen. Nochmal so, auch wenn das Informatiker TV ist, ich hab nie Informatikstudiert. Kann man ein Informatiker als mathematisch durch die begabte Person bewältigen? Du hastja wie ich weiß Informatik, achja sagst du ja auch. Ja, also ich kann dir nur das sagen,was ich von Leuten vernommen habe, die Informatik studiert haben, beziehungsweise teilweiseauch von Leuten, die Mathe studiert haben. Ja, du musst aber bereit sein, nicht damitauseinander zu setzen. Also du musst das nicht irgendwie, wie soll ich sagen, so instinktivgottgegeben alles wissen, du musst dich halt damit auseinandersetzen und das, was man inder Schule an Mathe gelernt hat, hat damit nicht wirklich großartig was zu tun. Da geht'seher darum, dass du Sachen beweisen kannst, ja, von Algorithmenlaufzeit, ja, bis was weißich, wie Hash-Algorithmen funktionieren und solche Dinger. Das ist teilweise schon etwashärtere Kost und dementsprechend musst du dich anstrengen. Und also Mathe ist das,was den meisten Leuten im Informatikstudio mit Abstand am schwersten fällt, von dem,was ich so höre. Ja, genau, so würde ich das auch sehen. Man muss sich da einfach,wenn es dir halt aber komplett zuwider ist und du quasi kotzen musst, sobald es dahingeht, dann wird das nichts. Ja, also wenn du sagst, hier, ich kann mir das einfach nichtgeben, dann wirst du es wahrscheinlich nicht schaffen, weil da kommst du nicht drumherum.Sowas hattet ihr in Mathe nie? Moment, ihr hattet in Mathe im Informatikstudio nie Algorithmenlaufzeitabschätzen? Bestimmt. Was ist das für ein Informatikstudium? What the fuck? Sowas istda doch eigentlich Standard. Also das weiß ich nicht, was, wahrscheinlich Wirtschaftsinformatikoder sowas. Nee, keine Ahnung. Es war bei euch nicht Teil von Mathe, sondern vom Algorithmus-Konkurs.Ja Leute, jetzt sind sie mal wieder päpstlicher als der Papst, Alter, im Chat. Ist doch egal,das muss er auch durch. Ja, den hab ich auch schon gesehen. Den Proof of Concept für Folina.Sprich man das eigentlich aus? Das müssen wir uns jetzt mal. Das ist ja was in Italien.Jetzt hören wir mal, wer Folina ausspricht. Nein, so spricht das kein Italiener aus, definitivnicht. Folina. Folina. Folina. Das hört sich deutlich Italienischer an. Folina heißtdas. Sonst Chat durch. Das probier ich jetzt nicht aus. Ist eine äußerst, ich muss sagen,eine äußerst unglückliche Benahmung dieses Programms. Schon Amazon Stonks Aktie angeschaut?Oh, muss ich mal gucken. Gab's da heute Big Stonks? Also ich hab tatsächlich relativviel gut Stonks gemacht. Die letzte Woche waren 850 Euro mehr oder so. Moment, mal kurzmeine Amazon Stonks checken. Na ja. Oh, nee nicht? Na ja, Pog. Das ist ja geil. Das habich mir noch gar nicht angeguckt. Ich hab Amazon gekauft bei um die 2000 und jetzt istes 2317. Also one week 377 Euro. Na dann. Massive Stonks. Jetzt verkaufe ich die einfachwieder. Da hab ich mir ein bisschen Kohle ausgemacht. Ja, also genau. Wenn schon Leute, dann machtso wie ich mit meinen Stonks, weil ich hab trotzdem, dass es die letzte Woche ziemlichgut war, hab ich in diesem Jahr minus 1000, nee stimmt nicht, minus 908 Euro und 67 Centgemacht. Also beste, beste Stonks Beratung hier bei mir. Weil wenn ihr Geld verlierenwollt, dann macht es so wie ich. Worüber kaufst du? Ich hab Scalable als App. Kann ich garnicht mehr sagen warum. Ich glaub, das würde öfters auf YouTube und öfters auf Redditempfohlen. Eine Milliarde Bits? Dankeschön. Jetzt ist alles weg. Jetzt bin ich wiederreich. Alle Stonks Verluste ausgeglichen durch Twitch Bits. Polina könnten ohne Problemeirgendwelche Nudeln sein in irgendwie geschwungener Form oder so. Es gibt ja 30 Milliarden Nudelsorten.Wolle, danke für den Sub. Übrigens danke für alle, die gestubbt haben, die ich übersehenhab. Schau mal kurz. Wolle hat gesagt, Battle Day Z, Dates. Danke schön für den Sub.DasSteinAtler5 hat Subscribed. Danke schön. KioKun wieder am Start. Oder Samuel, ja euchhab ich schon gesehen. Gut, nice. So, ja gut Leute, dann gucken wir jetzt mal schnellmein Video und ich sag noch was zu, weil es haben sich in ein paar Kleinigkeiten jetztnoch ergeben. Achtung. Eigenen Content Recycle im Stream am gleichen Tag. Das ist Pog, somuss man das machen. Scale Capital, ja. Muss man da was beachten? Naja. Du brauchst einengültigen Personalausweis, weil du Post-Ident machen musstest und ich hatte keinen zu demZeitpunkt. Muss mir vorübergehenden Personalausweis holen. Leute, das war auch, hab ich euch daserzählt mit dem Perso, was es für ein Act war? Alter, ich wollte nach Hanau mir einenPersonalausweis holen, weil ich Post-Ident machen muss und die hatten irgendwie 6 Wochenkeinen Termin. Und dann hab ich mir gedacht, ok, guckst du mal beim Bundesinnenministeriumnach auf der Webseite, was die sagen, was man in besonders dringenden Fällen machensoll. Und da steht, in besonders dringenden Fällen kann jedes beliebige, ja, NiederlassungsbürgerAmtsstelle dir einen temporären Personalausweis ausstellen. Jede. Das steht auf der Webseitevom Bundesinnenministerium. Also hab ich in der Nachbarschaft rumgeguckt, also in Nachbargemeindenund so rumgeguckt und da hab ich einen Stadtteil gefunden von Offenbach, also quasi bei Haftbefehlum die Ecke und hab da angerufen und hab gesagt, wie sieht es denn bei euch aus, ichbräuchte einen neuen Personalausweis, ganz dringend, weil Post-Ident und so und das isteilig und ich muss da dran. Und kleines Problem ist aber, der Tipp könnte tatsächlich aus,nee, weiß ich nicht, ob dieser Tipp aus dem Chat gekommen ist, aber der Chat hat auf jedenFall Fivehead-Ideen gehabt und da hab ich gesagt, das Problem ist nur, ich komm nichtaus ihrer Gemeinde, ich komm aus Hanau und da hat die dann gleich zu mir gesagt, nee,nee, das geht nicht und dann hab ich gesagt, Fivehead-Modus aktiviert und dann hab ichgesagt, doch, das geht in dringenden Fällen, das steht nämlich sogar auf der Seite vomBundesinnenministerium und dann hat die gesagt, ach ja, ah ja, wenn das da steht, dann gehtdas. Ja, die hatte bloß keinen Bock, die wollte bloß nicht, die hatte bloß keinen Bock. Aberals ich ihr das dann quasi zitiert habe von, dann hat das funktioniert und die war auchwirklich sehr nett und sehr schnell. Tag später konnte ich den Gramm holen. Tja, dergilt aber nur drei Monate. Das heißt, ich müsste jetzt so langsam aber sicher mal wirklichnach Hanau einen Termin machen. Ja, das hab ich mal sogar auf Twitter gepostet, die Hecklerund Kochakte ging ja auch übelst ab, die ganzen Rüstungsunternehmen, die haben haltrichtig am Anfang richtig massive Stonks gemacht. Also ganz ehrlich, ich nehm dir dasnicht böse, man muss gucken, wo man bleibt. Man kann sich nicht darauf verlassen, dassirgendjemand, weder den man wählt noch irgendjemand anderes, was in seinem eigenen Interesse macht,nachdem jeder gucken muss, woran er bleibt, warum nicht? Es ist ja nicht so, als würdestdu damit irgendwie Kinder erschießen oder so. Zumindest nicht du persönlich. Was damit den Sachen passiert, sei mal dahingestellt. Aha, das macht ihr da. Tja, gut, damit habich zum Glück nichts am Hut. Gab es heute schon überfüllte Züge, ich musste heutezum Glück nicht fahren. Ich bin zuletzt gefahren am Dienstag und da war außer 10 Minuten Verspätungmittags, das ist aber eigentlich schon, ja was heißt, da twitter ich schon gar nichtmehr drüber, wenn es einfach nur 10, 15 Minuten Verspätung sind, ohne was, war es relativproblemlos, ja. Bin aber mal gespannt, wie das wird nächste Woche. Na gut, okay, alsogucken wir uns mal mein Video an, ich erzähle euch ein paar neue Sachen zu. Hallo Leute,hier ist der Max und haltet euch fest. Inception, Inception. Heute wird's wild. Übrigens, wisstihr, wie ich das Video zuerst nennen wollte? Leute, ich hatte richtige Probleme, diesesVideo hochzuladen. Das muss ich jetzt hier an der Stelle einfach nochmal kurz erzählen.Und zwar, ich hatte mega Probleme, das Video hochzuladen. Ursprünglicher Titel diesesVideos war, wilde Sicherheitslücke in Word und Windows. Jeder ist betroffen und dieserTitel ging einfach nicht. Immer wurde das Video geplockt, also geplockt, halt entmonitarisiert.So, und dann habe ich verschiedene Variationen ausprobiert mit dem Titel und das war dereinzige Titel, den YouTube gefressen hat. So, also ohne Microsoft im Titel. Danach habeich unten drunter in das Kommentarfeld versucht, die Links einzufügen zu diesen Blogartikeln,worüber ich rede im Video, Video wieder entmonitarisiert. So, danach habe ich einfach nur meine SocialMedia Links eingefügt, Video entmonitarisiert. So, und dann musste ich exakt diesen Textnehmen, ich habe das Video 5-6 mal hochgeladen insgesamt. Und dann musste ich genau diesenText nehmen und ich durfte nicht schreiben, große Sicherheitslücke in Word und Windows,weil Word anscheinend ein super triggendes Wort ist, sondern ich musste aus Word MicrosoftWord machen und dann wurde es monetarisiert. Warum? Man hat keine Ahnung. YouTube sagteinem das ja auch nicht, warum was entmonitarisiert wird. YouTube sagt einfach nur BAM, not suitablefür irgendwie Advertisement, limited ads. Keine Ahnung. Nee, ich gehe auch nicht davonaus, dass die das wissen. Ja, du kannst bei YouTube dann eine Überprüfung beantragen,die dauert aber höchstwahrscheinlich eine ganze Weile und im Zweifelsfall landest dudann noch bei irgendeinem unwissenden Kacknoob, der dich fleckt für Hacker-Content. Alsoich habe null Vertrauen in YouTube, was diese Abläufe angeht. Gar nichts, null. So, wirgucken uns trotzdem jetzt das Video an und ich sage noch ein paar Takte zu. Eine neueSicherheitslücke in Word und in Windows. Ich gebe zu, das an sich ist jetzt weder wildnoch sonderlich überraschend, das kommt ja nur öfters mal vor, aber ich versprecheeuch diesmal wird es wirklich wild, denn es sind gleich mehrere Probleme, Word selber,aber auch Windows eigene Tools. Das geht am Ende so weit, dass jeder der Word nur installierthat betroffen sein kann. Ja, was ich hier hätte dazu sagen sollen ist, potenzielljeder der Word installiert hat, ist von der Word-Problematik betroffen, aber jeder, deswegenhabe ich jetzt auch einen Titel geschrieben, jeder Windows-Benutzer ist von der zweitenHälfte dieses Problems betroffen. Als wäre das noch nicht genug, ist das Ganzeauch noch ziemlich einfach auszunutzen und wird auch schon aktiv ausgenutzt. Gibt esmehrere Beispiele für, also das in der Kombination kommt doch relativ selten vor und übrigensder Windows-Defender hat auch seine Probleme damit das ganze festzustellen.Und ja, das ist immer noch so, weil ein paar Leute in den Kommentaren geschrieben habenja, der Windows-Defender würde das erkennen, wenn man sich die Paid-Lizenz von Microsoftdafür kauft. Naja, das erste ist, keiner hat diese Paid-Windows-Defender-Lizenz, alsoder Windows-Defender macht bei 99,9% der Windows-Benutzer nichts. Ist das eigentlich der Windows-11-Marketing-Trailer?Nee, der Windows-11-Trailer, den habe ich nachher aber auch noch drin. Und, was wollteich jetzt sagen, ich darf nicht Chat lesen auf dem zweiten Bildschirm, das lenkt michteilweise so ab, dass mein Boomer-Prain das nicht mehr mitmacht. Was habe ich gesagtgerade Chat, 11 mal auf die Sprünge, Boomer-Alarm, dass der Defender nichts dagegen macht, genauhabe ich gesagt. Ja, und das 99% der Leute, die eben keine Cloud-Sache haben. Das nächsteist, selbst der Windows-Defender mit irgendwelchen Cloud-AI-Five-Hat-Geschichten dabei, erkenntdas auch nicht richtig. Mittlerweile, wenn man die Ursprungs-Datei hoch lädt, ja, dannsieht man auch auf Virus-Total, das kann ich euch ja an der Stelle zeigen, das ist derursprüngliche Twitter-Post, wo das angekündigt wurde, ja, und wenn man jetzt hier auf Virus-Totalgeht, 38 von 62 erkennen diesen Kram mittlerweile zum größten Teil irgendwie als Generic undhier als Word-Fail, erkennen das Ding als Virus, aber das ist die ursprüngliche Datei,und wenn man das, dass sie den GitHub-Proof-of-Concept erkennen, wundert mich auch nicht, aber dukannst halt hier relativ easy variieren, ja, allein schon das Encoding, wenn du das änderst,sieht das komplett anders aus danach, und ich gehe mal davon aus, dass die mittlerweileschon checken, sind dort irgendwelche Aufrufe drin, MS, MSDT, aber das kannst du ja beliebigobfoscaden, und ich gehe davon aus, wenn man das geschickt macht, dann wird das kein Virenscannerwirklich stichhaltig erkennen. Was ist die MP6-Stub-Axe, ich hab keine Ahnung, ich versuche,ich denke mal irgendwas für Signaturen oder so, ich weiß es nicht. Wobei man sagen muss,das hier ist ja auch der ursprüngliche russische oder weißrussische Code, die versuchen daauch Gerafiles zu entpacken drin, vielleicht hat es damit was zu tun, keine Ahnung wofürdas in dem Fall da ist. Wichtig an der Stelle ist übrigens, dass MSDST aufgerufen wirdmit IT-Browse-for-File oder IT-Run, nee IT-Rebrowse-for-File, das ist wichtig, weil ansonstensieht man ein Popup, und Popups machen die Leute ja erst mal skeptisch, und wenn mandas angibt, gibt es noch nicht mal ein Popup. Muss ich mal überlegen, was für ein Abfaktdas eigentlich ist, dass du Word-Vorlagen überhaupt mit Embedded JavaScript ausführen kannst,der dann im Word-Kontext läuft und sich weitere Dinger runter, das ist doch total hängengebliebenerMüll, ja. Also wer sich bei Microsoft denkt, das ist eine gute Idee, verstehe ich nicht.Äh, wo ist denn, wait a minute, Leute wo ist mein Video hin, da, wer auf Nummer sichergegangen ist in der Vergangenheit und seine Makros in Word... Moment, ganz kurz war esim Chat noch ziemlich ein Problem beim Abspiel von Videos in VMWare Pro, hast du eine Ideeworan das liegt? Ja, weil du in der VM kein Hardware-Video-Decoder hast, also da ist hoheCPU-Last normal, wenn du versuchst dort 1080p plus Videos abzuspielen, teilweise schon mal720p Videos, je nachdem wie stark dein Rechner ist, dann ruckelst, weil du keinen Hardware-Decoderhast, weil alles komplett von der CPU decodet werden muss. Das habe ich auch, wenn ich inmeine VM gehe und mache jetzt hier mal mein Video auf, ja, nehmen wir mal irgendwas mitein bisschen Bewegung drin, ich gehe mal hier mal rein, oh die muss ich mal neu starten,die ist ziemlich lahm. Nehmen wir mal hier irgendwie das da zum Beispiel, und ich stelledas Ganze jetzt tatsächlich mal auf 1440p, dann gucken wir mal Hardtop an, da siehstdu Firefox, Moment, ja, wenn ich ihn aufmache noch mehr, da siehst du mal, also es ist ordentlich,ordentlich, guck mal, also es sind 4 CPU-Kerne jeweils zu einem Viertel ausgelassen, schonordentlich, also das ist normal, dass du da hohe CPU-Auslastung hast. Leider, es gibtkeine Möglichkeit den Hardware-Decoder zu verwenden, es sei denn, du benutzt was anderesund machst dann GPU-Pass-Through, aber da hast du komplett andere Probleme wieder. Nö,das ist ganz normal, das kann man scheinbar nicht. Achso, ja, dann, dann weiß ich auchnicht, wenn du es gar nicht sehen kannst. Da braucht man auch normalerweise nichts zusätzlichinstallieren, weil das alles im Browser dabei ist. Ne, dann weiß ich es auch nicht, wenndu es nicht abspielen kannst, keine Ahnung. Ja, guck mal die CPU-Auslastung an, ansonstenweiß ich es nicht. GPU-Pass-Through geht überhaupt nicht ohne Probleme, also ja, GPU-Pass-Throughgeht ohne Probleme, aber das was daraus resultiert, die Probleme gibt es immer noch. Ja, zumBeispiel, dass du dann erst einmal die Grafikkarte nicht im Hausbetriebssystem hast, wenn duGPU-Pass-Through gemacht hast. Das heißt, wie guckst du dir dann dein Hausbetriebssysteman? Ich weiß, du kannst dann wieder sowas wie Looking Class machen und dann doch nochein bisschen weniger Delay haben, du kannst mit Virtual GL rum, jaja, aber das sind imPrinzip alles was ich meine, du hast dann andere Probleme. Dann musst du gucken wiedu deine Maus Pass-Throughs, also du kannst zwei GPUs kannst du auch machen, ja klar,vielleicht machst du komplett USB-Root-Dings Pass-Through, also du hast dann andere Probleme,die du lösen musst, dass das funktioniert. Ich weiß, dass du USB-Geräte Pass-Through-kannst,also sobald du USB-Geräte Pass-Throughs, kannst du sie nicht mehr auf dem Host verwenden,das heißt du brauchst dann theoretisch zwei Mäuse und zwei Monitore und vielleicht, vielleichtsogar zwei GPUs, was du natürlich am Ende nicht wirklich brauchst, sondern du kannstdann sowas wie mit Looking Class tricksen, dass du sagst, ok, ich nehme minimalen Lackim Kauf, dass ich das dann aber alles über den Host machen kann, du hast dann einfachandere Probleme und das ist das was ich meine, das ist cool, dass das geht, du hast danneinfach andere Probleme, die du lösen musst. Es gibt für fast alles irgendwelche Lösungen,mal mehr, mal weniger gefrickelt. So, jetzt gucken wir jetzt aber endlich mal, jetzt wirddas ja heute gar nichts mehr. Ein falsches, falsches Video. Komplett ausgeschaltet hat,klingt alles nix, schützt euch nicht davor. Ausnutzen lässt sich das Ganze aktuell wohlin einer breiten Anzahl an Office-Versionen von Office 2013 bis 2016, 2019, übrigensfür alle die es immer noch nicht mitbekommen haben, das heißt eigentlich gar nicht mehrOffice 365, sondern mittlerweile heißt es Windows 365, falls Sie es nicht schon wiederumbenannt haben. Ernsthaft? Ne, oder? Doch. Microsoft ist sich selber nicht so ganz einigwie der Campbell heißt. Ach du Scheiße, Microsoft und Benahmung. Ja, aber Office 365 heißt eigentlichWindows 365 mittlerweile. Der Name ist lächerlich, ich meine, warum heißt das Office?Man weiß auch nicht, heißt es Microsoft 365, heißt es Windows 365, Microsoft und Benahmung.Dass es das überhaupt gibt, dann Office Pro Plus und natürlich auch und das ist wahrscheinlichdas Wichtigste, Office 365 und das ist jetzt eine Anmerkung von mir, was ich jetzt dazusage, das steht nicht in den offiziellen Analysedokumenten drin, wer Office 365 nur im Browser benutzt,der müsste wahrscheinlich safe sein. Es geht darum, wenn ihr das auf eurem Windows Rechnerverwendet. Ja, also was ist los? Übrigens, wo wir gerade dabei sind, ich komme aktuellleider wenig dazu, so viele Videos rauszuhauen, wie ich gerne möchte. Ja, das ist tatsächlichleider so, ich würde lieber mehr Videos machen als so wenige, aber dafür muss ich sagen,eine Sache, die mich wirklich freut, ist, das aktuelle Video kommt auch relativ gutan und das letzte Video kam wirklich gut an. Also gerade für so ein Thema sind 65.000Views wirklich nicht übel und auch eine richtig viele Anzahl an Comments. Comments wäre nichtso ausführlich vom Text her, da würde dann drin stehen Plupfix 1 oder sowas. Und ansonsteninsgesamt muss ich wirklich sagen, Chat, ich kann mich echt nicht beschweren. Ich machediesen Krempel auf YouTube jetzt seit 12 Jahren fast, nicht ganz, aber seit 2010 und ich denke,das können nicht viele Leute von sich behaupten, dass sie 12 Jahre auf YouTube sind und imaktuellen Jahr, quasi wenn man sich die Videos anguckt, immer noch Views haben, die, ja nicht,das kann man schlecht vergleichen. Ich meine, ich habe damals Videos rausgehauen, 5 Minutenam Call of Duty Gameplay gemacht und hatte teilweise 60.000 Views am zweiten Tag. Soist es nicht, aber die YouTube Welt hat sich geändert. Aber wenn man das mal im Verhältnissich anguckt, nach 12 Jahren YouTube bekommen meine Videos immer noch ähnlich viele Aufrufewie damals zum Call of Duty Hype und ich denke, das können wirklich nicht viele Leute sagen,dass sie nach 12 Jahren immer noch die Leute auf YouTube erreichen können und das mitteilweise komplett anderem Zeug als damals. Da bin ich wirklich froh drum, dass das sogut geklappt hat oder dass das so gut funktioniert. Und was mich auch wieder daran bestätigt,dass ich eine wirklich besondere Zuschauergruppe habe, also damit seid jetzt natürlich auchindirekt, ist der Chat gemeint und zwar, das kannst du aber auch erst haben, wenn du eineWeile auf YouTube dabei bist und zwar die Leute, die mich damals geguckt haben und ichweiß das aus dem Chat, weil da sind öfters mal welche, die genau das schreiben. Die Leutewaren damals zwölf, dreizehn, vierzehn, fünfzehnjährige Call of Duty Kinder. Jetztohne das abwertend zu meinen, aber ihr wisst, was ich meine, da sind die Leute, die damalsin die Kommentare gegangen sind und haben dann reingeschrieben, ah Max, du kack Spaß,du spielst Xbox, fuck Vixbox, Playstation 3 for life. Ja, okay, so Leute waren das unddie sind heute noch da, zwar natürlich nicht alle, aber zum Gehirn, das war mir klar,also du bist der Erste, der mich das zugetraut hätte, sowas. Zumindest, die Leute sind heuteimmer noch da, aber das Geile ist, die Leute sind mit mir quasi gewachsen oder mit mirälter geworden, also sprich, ich war damals paarundzwanzig, jetzt bin ich siebenunddreißigund die anderen Leute, die sind heute zwischen 22 und 27. Das ist halt krass, oder? Das habennicht viele auf YouTube, wirklich nicht. Nicht nur ihr seid alt geworden, ich auch. Gehtzwischen 21 und 27 und viele tatsächlich mittlerweile auch in der IT. Ich mein, was mich ja wirklichfreut ist, ich muss sagen, ich hab die Videos damals nicht mit dem Hinblick darauf gemacht,weil ich mir dachte, es interessiert eh keinen, aber anscheinend hat es doch jemand interessiert.Ich hab mir damals schon viele Videos gemacht über Fachinformatiker-Ausbildung, über Berufan sich und sowas. Wir haben jetzt schon viele Leute hier im Twitch-Chat gesagt, als auchin den YouTube-Kommentaren gesagt, dass sie nur deswegen, weil ich sie da mal drauf gebrachthab, letztendlich das dann auch sich angeguckt haben und deswegen auch machen. Das ist haltwirklich was, da gibt es wirklich nicht viele, die das sagen können, weil das ist ja, dasist jetzt nicht irgendeinen Schwachsinnseinfluss auf die Leute, sondern es ist tatsächlich,man hat da tatsächlich, man hat irgendwie auch noch was Gutes bewirkt, ja. Das hätteich damals nicht gedacht. Sieht man eigentlich so, ich seh das manchmal, weil ich noch E-Mail-Benachrichtigungenvon damals habe auf Google-Mail. Du selbst, weiß ich nicht, doch man selbst kann das bestimmtauch irgendwie sehen. Nö, hab ich nicht. So, aber jetzt müssen wir das endlich. Du hastdie Zusage für die, äh, ich erinnere mich, du hast letztens was geschrieben im Chat. Jaja.Äh, Moment, Leute, ich mach jetzt mal Pfeiffer-Time, ich kann doch nachgucken, was die Leute zuletztim Chat geschrieben haben. Da muss ich mich gar nicht dran erinnern. Massive. Also, deineletzte Chat-Nachricht für heute, Tommy, war Betge. Beste Chat-Nachricht überhaupt. Betgeist in 13 Minuten auch angesagt. Passt. Also, eine zeitlose Chat-Nachricht, Betge. Ach ja,jetzt weiß ich's wieder. Du hast geschrieben mit dem Third-Level-Support. Jaja, okay, jetzterinnere ich mich wieder. Und dass du dich beworben hast. Ja, freut mich, dass das geklappthat. Jetzt hoffen wir, dass es auch gut läuft. Gläserne Viewer. Jaja, hier ist nichts. Leute,nicht dass ihr denkt, im Zweifelsfall kann ich nachgucken. Und noch schlimmer, wisstihr was noch schlimmer ist? Muss mir der Serious Max mal sagen, ob das stimmt. Die Mods könnendas auch sehen. Also, wenn irgendjemand sagt, warum wurde ich gebannt mit meinem anderenAccount? Ich hab doch nie was Schlimmes gesagt. Da guckt einfach irgendein Mod rein. Und höchstwahrscheinlichhabt ihr irgendwas Schlimmes gesagt. Oder irgendwas. Ich hab ja teilweise auch schonLeute gebannt, weil sie mich einfach so sehr abgefuckt haben. Ich banne meist... Ich temp-banneeigentlich nur Leute. Ich hab ganz selten wirklich Leute richtig gebannt. Also meistenstemp-banne ich nur Leute. Und ich gebe zu, ich hab auch schon Leute temp-bannt... Achja, Chainloids, wo du da bist, ich muss mal kurz auf deine Nachrichten klicken. Du hastinsgesamt schon... Alter! Der Chainloy ist der Ober-Spammer, man! Wie viel der schongepostet hat. Das ist so viel, das passt da gar nicht rein. Ähm, tja. Ja, ich temp-bannein der Regel eigentlich nur Leute. Und ich gebe zu, ich hab auch schon Leute echt malim Affekt temp-bannt. Und eine Sache, was mich immer hart triggert, wenn ich irgendwasnicht hinbekomme, sei es wenn mir irgendwas programmieren oder irgendwas konfiguriertwird oder irgendwas nicht will oder beim Löten was nicht klappt. Keine Ahnung. Wenn was istund die Leute fangen so ultra krass an zu backseaten. So nach dem Motto, ja, probiermal das aus, ja, guck dir mal das, hast du den Link schon gesehen? Und in der Regel,ist es so, meistens kenn ich das schon, ja. Die Leute kommen dann ins Stream rein, wissennicht was die letzte Stunde war und schreiben dann so nach dem Motto, ja, mach doch maldas, hast du das schon ausprobiert, jetzt mach doch mal endlich hier. Da flippe ichimmer aus bei, da hab ich auch schon Leute temp-bannt, weil es mir auf den Keks gegangenist. Also das ist, ähm, warst du früher Admin auf dem Teamspeak? Nee. Ja, könnte manso sagen. Die Leute haben aber auch teilweise schon richtig krass genervt, also. Ich warweder Teamspeak-Mod noch Reddit-Mod. Ich hab aber gehört, ganz ehrlich, dass, äh, wennman mal so eine Mod-Tierlist machen würde, hab ich gehört, dass Discord-Mods wohl dieschlimmsten sein sollen. Also nicht Discord-Mods bei mir und auch nicht Discord-Mods von meinenMods, die einfach jetzt zufälligerweise auch Mods im Discord sind. Ähm, aber so, wennman so ein Mod-Tier-Ranking machen würde, wären wahrscheinlich Discord-Mods die schlimmsten.Wahrscheinlich, wahrscheinlich dicht gefolgt von Reddit-Mods, ja. Reddit-Mods sind auchso. 4chan-Mods, da krieg ich wenig moderiertes mit. Ich bin aber auch schon lange kein regelmäßiger4chan-Leser mehr. Und auch kein 8chan-Leser und was es nicht alles gibt. Das hab ich vorlanger Zeit, also bestimmt seit 2012, 2013, ja, lese ich das nicht mehr aktiv. Ja gut,die haben ja auch einiges zu tun. Also als Zoomer müsstest du wissen, was 4chan ist.Bestimmt, es sind auch Leute auf Program und sowas noch. Also gerade Zoomer müssten docheigentlich wissen, was 4chan ist, oder? Und wenn du Anime-Schauender-Zoomer bist, dannhast du recht. So, jetzt mal endlich mal fertig. Guck mal, es wird nichts mehr hier, Leute,heute. Also, jetzt widmen wir uns mal der aktuellen Office-Sicherheitslücke, weil es gibt tatsächlichnoch ein paar Sachen, die ich dazu sagen wollte. Ihr könnt mich übrigens abonnieren, wenneuch der Content gefällt. Wer auch nicht hat, ne? Also, by the way, Sub-Abo-Falle. Wir habenvor allem auch im YouTube-Algorithmus, und das ist natürlich heutzutage unglaublichwichtig. Und da solche Themen immer komplexer sind, als es auf den ersten Blick erscheintoder auf den ersten Blick wirkt, hab ich euch auch unten nochmal die ganzen Seiten verlinkt,auf denen ich... Ja, das hab ich versucht, aber YouTube hatmich nicht gelassen. Leider sind Word-Dokumente auch heutzutage immernoch eine beliebte Form des Datenaustauschs. Ich frag mich gerade an der Stelle, ob siebei uns auf der Arbeit den Kram per Gruppenrichtlinie deaktiviert haben oder so. Ansonsten wird'swahrscheinlich am Morgen lustig. Zum Glück hab ich hier wenigstens nichts zu tun.Es stoms auch privat. Die Leute schicken sich gerne Doc-Files rum, obwohl es viel bessereAlternativen gibt. Ja, einfach online auf ne Seite oder im Zweifelsfall ein PDF gemacht.Aber nein, die Leute schicken sich gerne Doc-Files rum. Aber diesmal betrifft es nicht nur Doc-Files.Gute Frage. Face... Face? Oh, ich kann dich nicht aussprechen. Ich kann dich nicht aussprechen.Ich kann dich nicht aussprechen. Phasero... Son... Keine Ahnung. Oder soll man das überhauptals A aussprechen? Phar... Pharazon? Ja, aber um auf deine Frage einzugehen. Max, hattedeine Firma schon mal Hacker-Man-Angriffe, wo was passiert ist? Ja, hatten wir schon.Und zwar die dümmsten der dummen Angriffe. Und zwar, irgendjemand hat es geschafft, einemungesicherten Windows-Server... Ne, muss ich anders anfangen. Einen Windows-SFTP-Servermuss man sich mal auf der Zunge zergehen lassen, dass es sowas überhaupt gibt. Einen Windows-SFTP-Serverungesichert mit alter Windows-Version ins Internet zu hängen. So. Und das haben irgendwelcheHacker-Mans rausbekommen. Und daraufhin... Ja, ging es dann weiter. Im Detail erzähleich es jetzt nicht. Oh no no, ja. Das war auch so was ganz Spezielles. So, weiter. Kommenwir aber am Schluss vom Video zu. Ich muss erst ein bisschen ausholen, um was es eigentlichgeht. Also, wir gucken uns jetzt mal grob an, um was geht es bei der ganzen Geschichte.Und, ja, dann natürlich auch, was kann man denn... Ja, Major Lazer, da bist du schon langedabei. Ja, das habe ich euch ja gerade schon gezeigt. Ja, das habe ich euch ja gerade schongezeigt. Denke ich mal, nennt ein Word-Dokument entdeckt, das von einer IP-Ausweis Russlandoder Belarus, sollten wir glaube ich heutzutage eher sagen, raufgeladen wurde. Was habendie bei Virus... Was ist da? Was hat es eigentlich... Ich meine, es kann doch nicht sein, dassdie gesamte RKM-Geschichte in letzter Zeit entweder China-Chinesen oder Russen sind.Wo ist denn der Rest? Die gibt es doch auch noch. Total entdeckt und das ist jetzt ja,sag mal, so irgendwelche Word-Dokumente mit fragwürdigem Inhalt, ja, da aus Russlandund der Ecke. Das ist jetzt ja erstmal nichts Besonderes. Die machen alle VPN nach Russlandmit NordVPN wahrscheinlich, ja. Wobei, ohne Scheiß, das kann wirklich sein, ne? Das istgar nicht mal so unwahrscheinlich, dass die meisten... Also, was ich letztens gelesenhabe, ist, dass für die richtig krassen Hacker-Mans nun VPN in den Iran wohl angesagt ist. Ichwusste gar nicht, dass der Iran VPN-Anbieter hat, aber anscheinend muss das aktuell angesagtsein, dass man als Hacker über zig Proxies geht und über iranische VPNs. Warum Iran?Ich kann es mir nur so erklären, dass dort halt es keiner mit, tja, Nachvollziehbarkeitsonderlich ernst nimmt und da auch keine Gesetze für gibt. Diesmal war es tatsächlichwas Spannendes, denn es ging um einen neuen Zero-Day-Exploit für Word. Ja, der ist heutenicht wirklich mehr Zero-Day, weil eigentlich ist die Sicherheitslücke schon seit 5 Tagenbekannt. Das hört sich natürlich an mit einem manipulierten Word-Dokument. Aber es hörtsich besser an. Das sagt an sich nichts Besonderes. Tausende Sicherheitslücken fangen mit einemmanipulierten Word-Dokument an. Leider auch 2022 noch. So, und in diesem Fall nutzt dasWord-Dokument Templates. Ich frage mich gerade, wie Templates auf Deutsch heißt, wahrscheinlichsowas wie... Ja, weiß das jemand? Heißt das Dokumentenvorlage oder so in Word auf Deutsch?Templates? Bestimmt Dokumentenvorlage, ja. Microsoft Word Dokumentenvorlagen oder sowas.Ich hab geraten im Video. Ja, wahrscheinlich Dokumentenvorlage wird das wahrscheinlichheißen. So was da. Aber die verwenden nicht... Wobei es um die ja gar nicht geht. Nein, dieverwenden Remote Templates. Das heißt... Ich fände es immer noch so affig, dass esüberhaupt möglich ist, ne? Remote Templates. Man kann die Dokumentenvorlagen, die müssennicht lokal sein, sondern die kann man von irgendwo downloaden. Das passiert normalerweisenur, wenn das Dokument geöffnet wird. Wie gesagt, normalerweise. Diesmal ist es leiderein bisschen schlimmer. So. Das klingt alleine ja schon etwas, wie man heutzutage... Da binich sehr stolz drauf, Leute. Dass ich diesen Gag jetzt auch mal machen konnte....sagenwir denn. Sass. Also sprich, das Word......von irgendwelchen Quellen im Internet sich Templatesrunterladen kann und das einfach passiert, nur wenn man das Dokument öffnet. Aber dasist Absicht und das ist ein Feature. Das soll so sein. Und das ist auch nur der Einstiegbei dem ganzen Problem, denn es reicht nicht einfach nur, dass man Word Templates... Obdas mit Signaturen in Office möglich ist, das ist eine gute Frage. Also, keine Ahnung,habe ich nichts zugelesen. Ich denke nicht, weil in dem Fall ist es ja so, dass das HTMLund der JavaScript da drin von Word intern quasi ausgeführt werden und das wird wahrscheinlichbei Signaturen nicht passieren. Also, mich würde es wundern, wenn Signaturen mit JavaScriptüberhaupt ein Ding wären. Bestimmt ist Zenitized vorher. Wie bricht man das überhaupt so aus?Also, Escaped. Ich glaube nicht, dass es mit Signaturen funktioniert. Irgendwo sonst wieim Internet runterladen kann. Nein, nein. Ja, du musst ja... Dark Zone, du musst ja nochnicht mal anklicken. Das ist ja das Fatale da dran. Das sieht man ja später gleich.In diesen Templates kann auch HTML-Code eingefügt sein. Mag ja sinnvoll sein für ein Template,dass man da irgendwie HTML reinschreibt. Also sprich, das hier ist das Beispiel von denen,was Embedded war in einem Word Template. Also, warum sowas überhaupt erlaubt sein muss ineinem Word Template? Verstehe ich nicht. Ich meine, warum braucht man... Also, warum istJavaScript überhaupt erlaubt in einem Word Template? Warum kann man Word Sachen scriptenmit JavaScript, selbst wenn Makros deaktiviert sind? Was ist das für ein bescheuertes Designvon Microsoft wieder? Wo HTML ist, ist natürlich JavaScript auch nicht weit und das heißt,man kann ein Word Template erstellen mit HTML drin und in diesem HTML ist dann JavaScriptdrin. Es ist quasi, könnte man sagen, eine Webseite als Template. So, und bei dieser Kombination,ja, da kommt es jetzt natürlich so, wie es kommen muss. Der JavaScript...Übrigens, was ich in dem Video nicht zeige, ist, das hier ist Base64 encoded, das PowerShell gedönnt, was dann versucht, irgendwelche RAR-Files zu entpacken. Das war jetzt abernicht wirklich relevant für das Video. Wie es kommen muss, der JavaScript im HTML WordTemplate führt mit einem Trick am Ende Power Shell Befehle aus. Wir können uns das Ganzemal kurz angucken, was da so drin steht. Ich zeige euch mal das Bild. Das ist jetzt vielleichtauf den ersten Blick nicht so super verständlich. Zumindest, was hier dran interessant ist, dassdie Window Location geändert wird. Die Window Location ist in JavaScript quasi das, wasin eurem Browser die Adressleiste ist. Wenn das habe ich ganz gut erklärt mit der Adressleiste,ich meine, praktisch gesehen stimmt es nicht wirklich, aber das ist das, was die meistenLeute sich darin vorstellen können. Dort, wo ihr Seiten rein tippt, die ihr aufrufenwollt. Man beachte hier an der Stelle auch, dass da am Anfang steht MS-MSDT-Doppelpunkt.Also normal schreibt man ja im Browser...Weiterbei, hier habe ich geschnitten. Ich habe in der Ursprungsaufnahme gesagt MS-MSDT-Doppelpunkt-Doppelslash.Dann ist mir aufgefallen, das ist ja gar kein Doppelslash.Mittlerweile muss man es nicht mehr schreiben, aber man würde sowas normalerweise hinschreibenim Browser HTTP-Doppelpunkt-Doppelslash-Google.de oder sowas. In dem Fall könnte man sagen,wird hier eine MS-MSDT-Seite aufgerufen. Also es wird nicht HTTP als Protokoll verwendet,sondern MS-MSDT als Protokoll verwendet. Das wird die Sache noch deutlich schlimmer machen,denn dahinter verbirgt sich ein Windows-Tool von Microsoft.Gibt es den Base64-Text auch zum Copy... ja. Achso, nee. Die haben nur ein Bild. Die haben nur ein Bild hier drinnen irgendwo.Hier glaube ich. Guck mal.Das hier. Ja, kannst du aber nicht copypasten.Das ist der decodete PowerShell-Befehl. Also sprich, das Base64 ist das hier.Das versucht, irgendwelche RAR-Files zu decoden oder zu entpacken und sowas.Komisches, komisches großen Zeugs. Hacker, Hacker-Man-Zeugs.MSDT, das ist wohl der... es gibt leider ein paar doppeldeutige Abkürzungen bei Windows.In dem Fall ist es wohl das Microsoft Support Diagnostic Tool.Übrigens, ich habe keine Ahnung, warum das überhaupt Bestandteil ist und ich habe keine Ahnung, was das macht.Was auch immer man damit genau macht. Ich habe mir nur zusammengereim, dass das wohl dieser Fehler Wizard sein muss.Kennt ihr diesen Wizard? Windows, Wizard, Error, Troubleshoot, Troubleshooting Wizard.Ja, diese Soundprobleme beheben. Genau.Dieser Crap muss das irgendwie damit zu tun haben.Dieser Troubleshooting Wizard. Reime ich mir so zusammen.Wichtig an der Stelle ist, dass es ein offizielles Tool ist, das von Windows mitgeliefert wird, von Microsoft.Das heißt, wenn das aufgerufen wird, wird kaum ein Antivirus herkommen und sagen, das ist problematisch.Da wird MSDT aufgerufen. Nein, das ist ein offizieller Bestandteil.Okay, an der Stelle könnten aktuell wirklich Antiviren-Software ansetzen und einfach mal alles, was MSDT ist und aufrufen will, plocken.Weil 99% dürfte kein gewollter Aufruf sein aktuell.Von Windows. Das heißt, da wird kein Virenscanner anschlagen und Windows-Defender fliegt.Also sollen sie es doch blacklisten und irgendeinen Admin, der den Shit wirklich verwenden will, soll es dann whitelisten.Das ist an der Stelle auch nicht an. Das heißt, man schafft es jetzt mit diesem manipulierten Java, mit diesem Template, mit dem manipulierten JavaScript-Inhalt im MSDT aufzurufen.Das ist schon mal blöd, dass sowas überhaupt möglich ist.Aber wir sind noch nicht bei PowerShell angelangt. So einfach ist es noch nicht.Und über dieses MSDT-Tool kann man jetzt mit Geschick...Von KS, Alter.Ich glaube, ich hätte an der Stelle ein paar Pfeile machen sollen, wo man gucken muss.Man muss nämlich hier gucken, dass es MSDT ist, und man muss hier gucken, dass es diese IT-Rebrowse-for-File-Zeugs-Parameter-Kram gesetzt hat.Mit der Auswahl der Startparameter, vor allem ist es wohl IT underscore rebrowse for file, kann man MSDT Excel dazu benutzen, dass das wiederum PowerShell aufruft.Und das Ganze, wenn man das mit den richtigen Startparametern macht, ohne dass ein Fenster aufploppt oder ohne...Das habe ich gut übergeplendet, oder? In dem Moment, wo Fenster kommt, startet der Windows-Trailer.Das ist tatsächlich Absicht an der Stelle gewesen.Aktuell sind wir so, sind wir an der Stelle, du bekommst ein Dokument, ein Word-Dokument, klickst noch, sind wir beim Anklicken.Du klickst das an, der lädt im Hintergrund von irgendwo auf der Welt ein Template runter mit HTML drin, in dem JavaScript drin ist,das dann wiederum MSDT.exe startet, das dann wiederum PowerShell aufruft mit quasi, ja, beliebigem Inhalt.Ja, das ist ja klar. Also sobald, sobald das irgendeiner geschafft hat, bei euch und auch nur im User-Kontext eine PowerShell zu starten,da hat er erstmal gewonnen. Weil, damit kannst du alles machen.Nicht der Rechner offen. Für so ziemlich alles. Aber du kannst in PowerShell nahezu alles machen, was man so machen kann.Das Einzige, was an der Stelle vielleicht ein noch so ein bisschen rettet, ist, dass MSDT nicht mit Admin-Rechten läuft.Das heißt, erstmal... Aber du hast so viele Möglichkeiten, du wirst über kurz oder lange Admin-Berechtigung auf dem System kriegen.Und sei es nur, dass du irgendwie was nachlädst, was so einen UAC-Dialog faked oder... Es gibt tausend Möglichkeiten.Also wenn du die, wenn du das Einfallstor offen hast und da PowerShell laufen hast, kannst dir jeder, du machst dir da irgendeinen Reverse-Shell auf,dass du dich immer drauf connecten kannst und... Also, da hast du gelitten.Du kannst ja auch Autostartsachen machen, geht ja auch als normaler Benutzer.Und das ist gelaufen. Also im Prinzip... Im Prinzip kannst du dein Rechner formatieren.Und das Schlimme ist halt, selbst wenn du keine Admin-Berechtigung hast, ich meine, die wichtigen Daten haben die Leute doch auf ihrem eigenen Windows-Account.Also User-Account im Arsch. Das ist nur schwacher Trost.Was aber ziemlich wurscht ist, weil ihr wahrscheinlich private Files und wichtige Sachen eh unter eurem Windows, unter eurem normalen Windows User-Account abgelegt habt.Ja, die wenigsten Leute switchen erst auf den zweiten Windows-Account, um Word-Dokumente aufzumachen oder sowas.Die Leute arbeiten unter ihrem normalen Windows-Account.Oder ja, vielleicht ist man auch gleich Teil eines DDoS-Botnetzes...Chet, dazu muss ich was sagen.Oh Mist.Muss ich mal stehen?Oh Mist.Ohne, dass ein Fenster aufploppt oder nur euer User-Account im Arsch..exe startet.Muss ich mal stehen geblieben..powershell aufruft..file.Hier, oder?Hintergrund von irgendwo auf der Welt.Template runter, mit HTML drin, in dem Jahr.Ja, irgendwo hier.Ich wollte aber schnell was zum Chats sagen und zwar...Es ist ein Irrglaube, dass Open Source bug-freier oder besser ist.Ja, das muss nicht zwangsläufig so sein.Das stimmt schon.Für mich ist ein Riesenvorteil davon, dass ich deutlich mehr Vertrauen habe in ein Open Source Projekt,wenn ich es bei mir mit sensitiven Sachen laufen lasse, als irgendeinem Closed-Source-Campel.Weil ganz im Ernst, wer würde, oder was würdest du nehmen als Passwortmanager?Würdest du ein Open Source Passwortmanager nehmen?Oder würdest du irgendeinen Cloud-Source...Ja, noch schlimmer.Cloud-based, proprietärer Cloud-based Passwortmanager nehmen?Oder würdest du irgendwas nehmen, was 50.000 GitHub-Sterne hat?Also reichen aus dem Gesichtspunkt...Ja klar kann man nicht sagen, dass das automatisch besser ist.Ist es nicht?Ja, die meisten Open Source-Dinger sind auch teilweise richtig im Arsch.Wenn du dir das ganze mit Log4j und das Gedöns anguckst, ist da mega kaputt.Aber das ist für mich ein ganz, ganz wichtiger Punkt.Letztens war auch irgendwas...Ich hab...Irgendeine richtig coole...Obsidian war das, glaub ich.Kennt das jemand?Das ist so ein Notizprogramm.Hab ich mir angeguckt und dachte, das ist doch richtig cool.Und dann hab ich festgestellt, es ist keine Open Source.Und deswegen benutze ich das nicht.Es gibt wirklich Leute, die gucken danach.Gerade ein Notizprogramm, wo ich wirklich vertrauenswürdige Sachen reinschreibe...Und bestimmt auch mal kurzzeitig das eine oder andere Passwort reincopypaste...Das will ich Open Source haben.Ich will, dass der Kram...Dass ich mir im Zweifelsfall auch drüber gucken kann.Und das mache ich bei mancher Software tatsächlich.Ich meine, gut, das kann nicht jeder Nupe-Benutzer machen.Aber ich will, dass das ein Open Source Projekt ist.Natürlich hast du noch ganz andere Probleme dann.Ist halt die Frage...Okay, die Quelle, von wo du es downloadest, vertraust du der Quelle...Dass das, was du auf GitHub siehst...Also das, was du dir auf GitHub als Source-Code anguckst...Das, was du dir runterlädst, dass das wirklich das Gleiche ist.Das ist oftmals gar nicht so einfach.Wer überprüft denn irgendwelche Hash-Werte nach dem Download und so?Also das ist wieder was anderes.Nee, aber prinzipiell gebe ich dir an der Stelle recht...Es muss nicht zwangsläufig bugfrei und besser sein.Aber zumindest der Vertrauensaspekt und wenn das wirklich große Projekte sind...Da kannst du zumindest mal davon ausgehen...Dass mein Ikea-Sensor blinkt.Der Windrückning-Ikea-Sensor blinkt gerade komisch.Heißt, dass ich hier so hohe Feinstaubkonzentrationen habe, dass es langsam gefährlich wird.Das wollte ich jetzt sagen, dass bei so großen Open Source Projekten...Da kannst du zumindest mal davon ausgehen, dass die grundsätzlich mal tun, was sie sollen.Und auch der normale Betrieb so weit bugfrei möglich ist, weil sonst hätten die keine 50.000 Sterne bekommen.Also sprich, wenn ich jetzt irgendeine Library nehme von GitHub, mit der ich...Nimm FFmpeg oder so oder...Oder nimm React oder Vue.js oder sowas.Wenn ich sowas nehme, dann kann ich davon ausgehen, dass die Basic Funktionalität...Also das, was quasi tausende Benutzer verwenden von dieser Library...Dass das in der Regel ganz passabel funktionieren würde, weil sonst hätten die keine 50.000 GitHub Sterne.Also ein gewisser...Ich weiß nicht, wie soll ich sagen.So ein gewisser Qualitätsindikator, finde ich, ist das schon.Ob es ein großes, bekanntes Open Source Projekt ist.Ob das jetzt aus Security-Sicht wirklich besser und bugfrei ist, das ist natürlich was anderes.Das kann man so nicht sagen.Dafür gibt es viel zu wenige Leute, die die Sachen auch daraufhin analysieren und auch Ahnung davon haben.Das kann man nicht sagen.Das ist natürlich was anderes.Kennst du White Source?Also ich hab den Begriff schon mal gehört.Selbst kann ich mir jetzt wenig darunter vorstellen.Also du kannst natürlich eins, zwei Sätze in den Chat schreiben, dass du uns quasi erhältst, was man da genau darunter versteht.Weil ich muss jetzt erstmal...Max wird kein Apple-Fan.Ich hab ein iPhone.Tja, ich hätte wahrscheinlich privat auch kein iPhone.Ich hab ein iPhone aus dem einzigen Grund, weil ich das nicht bezahlen muss.Und...Tja, warum sollte ich nochmal 600, 700 Euro für ein Smartphone ausgeben?Ja, aber was den Punkt angeht, ist Smartphone eines der kritischsten Dinger.Du hast gerade bei App Store Produkten...Ich rede jetzt mal gar nicht von dem, dass der Betriebssystemhersteller selbst alles mit deinen Daten und mit dir machen kann.Weil da hast du ja gar keinen Einfluss drauf.Dir gehört das Gerät zwar offiziell, aber du hast ja keinen Einfluss drauf, was Android oder iOS da so wirklich machen.Und du weißt das nicht.Und...Was ich viel schlimmer finde, auch wegen Open Source, ja, ist so.Was ich viel schlimmer finde, ist, dass du dir auch bei App Store Produkten nicht so wirklich sicher sein kannst.Ja, die App Store Sachen werden reviewed.Potenziell härter im Apple App Store als im Android App Store.Aber es gab genug Beispiele für...Das ist ein bisschen wie mit Browser Addons zum Beispiel, ja.Es gibt genug Beispiele, wo Leute sehr, sehr fragwürdige Dinge in ihren Apps drin hatten.Und da bei den Apps hast du halt, bei App Store Käufen, du hast halt keine, du hast gar keine Chance dir das anzugucken.Bei Android noch ein bisschen mehr.Android kannst du dir meistens die APKs runterladen.Und Android Anwendungen sind in der Regel relativ easy zu entpacken, die APKs, wenn man das wirklich machen will.Wenn es Java ist, dann lässt sich Java ziemlich einfach decompilen.Und wenn es normale APKs sind mit irgendwelchen Web-Anwendungen, also irgendwelche modernen Web-Anwendungen, dann erst recht.Aber das macht ja keiner. Und unter iOS ist es noch schwieriger.Dieter Ross, danke für den Sub. Nido, danke schön für den Sub.So, wir gucken uns jetzt das Video endlich fertig.Mein eigenes Null.So, gleich geschafft.Java Script drinne ist, dass dann wiederum msdt.exe startet.Dass es dann wiederum PowerShell aufruft mit quasi, ja, beliebigem Inhalt.Und damit ist natürlich der Rechner offen.Oh Mist.Du kannst den PowerShell nachher so alles machen.Ich hab dich gebannt. Ich wollte dich nicht bannen. Ich wollte mit dem Message einigen.Chat. Chat, Moment. Ich muss dich entbannen.Der Ritter Ross war das. Den wollte ich nicht bannen.Alter.Äh. Moment.Anbann.Anbann.Das ist ja auch kacke, dass da nicht nachgefragt wird, Alter.So, aufkommen.Hat er mich subscribt und direkt und direkt gebannt.Null, Alter.Das muss...Ich hoffe, du bist noch da, Alter.Nee.Ich wollte die Nachricht...Das ist aber auch dumm, dass dieses Banz, dieses permanent Banz-Symbol einfach direkt neben dran ist,ohne dass eine Rückfrage kommt.Und anscheinend hab ich noch jemand anderes angeklickt, weil er sagt,deine Sperraktion steht im Konflikt mit einer anderen Sperraktion.Also wahrscheinlich, wir hatten unten drunter gepostet.Äh, TrappedOxygen hat drunter gepostet. Du hast Glück gehabt.Twitter hat aus Versehen, äh, Twitch hat aus Versehen die Sperraktion nicht angenommen.So ein bisschen rettet es, dass MSDT nicht mit Admin-Rechten läuft.Nee, der Sub ist nicht weg.Du kannst aber deinen Sub kündigen mit der Begründung, dich hat der Typ gebannt.Das geht.Erstmal ist nur euer User-Account im Arsch.Was aber ziemlich wurscht ist, weil ihr wahrscheinlich private Files und wichtige Sachen eh unter eurem Windows,unter eurem normalen Windows User-Account abgelegt habt.Genau.Deswegen ist es eigentlich egal.Die wenigsten Leute switchen erst auf einen zweiten Windows-Account, um Word-Dokumente aufzumachen.Richtig.Die Leute arbeiten unter ihrem normalen Windows-Account.Ich find's immer gut, wenn ich eigene Videos von mir gucke, gebe ich mir immer recht.Aber wäre ja auch komisch, wenn nicht.Oder vielleicht ist man auch gleich Teil eines DDoS-Botnetzes.Nein, dafür braucht man auch nicht unbedingt Admin-Rechte.Und wer weiß, sobald es mal wieder ein Admin-Exploit für Windows gibt,kommt hier ab und zu auch mal vor,steht quasi der weißrussische Hacker-Man quasi schon direkt in eurer Wohnung.Also kannst du eigentlich von ausgehen, der Rechner ist versaut, du musst neu installieren.Und du musst theoretisch auch davon ausgehen, dass der Files abgezogen hat.In der Praxis wirst du wahrscheinlich Glück haben, weil es kein gezielter Angriff gegen dich sein wird.Und wahrscheinlich erst mal nichts.Aber man weiß es nicht.Eurem Rechner und kann weitermachen.Das ist natürlich nicht schön.Aber ich hab doch am Anfang irgendwas gesagt mit...Jetzt kommt der Hammer, ja.Der Teil muss nicht mal angeklickt werden.Oder vielleicht, wenn ich mir so richtig überlege,vielleicht schreibe ich das sogar ins...Was?Wenn ich mir so richtig überlege...Ja, manchmal...Das Problem hab ich ja im Stream auch.Manchmal fang ich an zu reden, bevor ich in meinem Hirn den Satz gedacht habe.Ja, es wird noch besser.Wenn die Datei nämlich nicht als Word-Dokument im Doc-Format bei euch ankommt,sondern als RTF, dann reicht es, wenn...By the way, RTF ist dieses Rich Text Format,was beispielsweise auch WordPad verwendet und sowas.Aber WordPad ist nicht betroffen, weil die machen keine Word-Dokumentenvorlagen.Man einen Windows Explorer öffnet mit dem Ordner, wo die Datei drinnen liegt.Also zum Beispiel ihr bekommt eine Webseite mit einem Link auf der Datei,ihr ladet das runter und macht dann irgendwann mal...Wer benutzt WordPad?Ich frag mich, dass bei den meisten eingebauten Windows-Apps, wer diesen Kram verwendet.Euren Download-Ordner auf.Ich hab keine Antwort drauf.Dann seid ihr auch gefickt.Leute, ich hab gesagt, ihr seid auch gefickt,und ich habe nicht bei YouTube angekreuzt Language.Ich hätte Language ankreuzen müssen.Wobei, da steht nur die erste Minute. Nur die erste Minute zählt.Und das ist nach der ersten Minute.Durch die Explorer-Vorschau-Funktion wird das Ganze dann aktiv.Ohne, dass ihr Word öffnen müsst. Ohne, dass in die Datei...Mir fällt das jetzt gerade aus.Guckt euch mal dieses Hintergrundvideo an.Explorer-Vorschau-Funktion.Ohne zuzuhören. Guckt euch mal das an.Was zum Teufel?Ach, das ist TikTok.Okay, dann ist alles klar, was da abgeht.Ohne, dass ihr Word öffnen müsst. Ohne, dass in die Datei anklicken müsst.Da ist man sich noch ein bisschen unsicher,in welcher Kombination das genau funktioniert.Von Windows, von Word, aber...Also sprich, nur mal, falls ihr mitgekriegt habt.Also es kann sein, wenn ihr ein RTF-Dokument runterladetund dann den Ordner öffnet.Zum Beispiel den Download-Ordner, wo das drin ist.Und ihr File-Vorschau anhabt.Ich bin mir nicht sicher, ob das Anzeigen von diesen Sachen hier schon reicht.Dann seid ihr auch gefickt.Das Beste ist einfach, kein Word installiert haben.Wenn ihr Pech habt, funktioniert das.Und das ist natürlich heftig.Ich habe ja schon oft in Videos gesagt,es ist nicht so sehr das Problem,einen Virus auf dem Internet öffnen zu bekommen,sondern eher, dass der auch ausgeführt wird und aktiv wird.Das ist damit natürlich easy möglich.Das heißt, jeder mit installiertem Wordsollte sich nur mal Gedanken machen,was er für Dokumente in letzter Zeit bekommen hat.Zumal es schon viele Beispiele gibt, wo das auch ausgenutzt wird.Da wollte ich was zu sagen.Mittlerweile, jetzt ein paar Stunden, nachdem ich das Video hochgeladen habe,es gibt immer mehr Beispiele, dass das ausgenutzt wird.Gerade vorhin kam sogar ein Post nochmal bei Heise.Du musst den Ordner einklicken und ihn aufmachen,was du ja machst, wenn du hier draufklickst.Wenn es hier drinnen liegt, in Downloads.Ja, sogar Heise hat vorhin einen Artikel gepostet da drübermit irgendwelcher hier da hier.Alert!Wenn sogar Heise da schon was drüber postet,dann ist das wirklich sehr relevant.......Ergibt es konkrete Handlungsempfehlungen?Ja, je nachdem.Man kann über irgendeine Gruppenrichtlinie für seine Clients abschalten lassen,dass das überhaupt soweit kommt.Sprich, dass dieses Protokoll hier aktiv ist.Dieses MS-MSDT.Die eigentliche Word-Sicherheitslücke kannst du damit nicht abschalten.Aber du kannst halt, dass diese Sache in dieser Form ausgenutzt werden kann, abschalten.Das kannst du selbst bei Registry abschalten.Und angeblich ist wohl auch irgendein Windows-Patch schon in der Mache unterwegs.Hab ich irgendwo nebenbei aufgeschnappt.Aber Microsoft selbst ist da nicht so scharf drauf, was dran zu ändern.Weil für die ist ja Remote Templates ein tolles Feature, was da bleiben soll.Warum man nicht einfach sagt, man macht es standardmäßig aus, verstehe ich nicht.Weil ganz ehrlich, eigentlich ist das ein Feature, was man standardmäßig wirklich nicht haben will.Es gibt einen inoffiziellen Preview-Patch nach Geil.Also das Beste aktuell tatsächlich ist Word deinstallieren und was anderes verwenden.Oder macht so wie ich, verwendet gar keine Office-Produkte.Ich meine, ich glaube, ich habe LibreOffice oder hier drauf, ja.Hab ich Word drauf? Nö.Was ist das?Irgendwas vorinstalliertes ist das.Aber ich verwende keine Textverarbeitung.Weder LibreOffice noch Word.Und auch kein PowerPoint und sowas.Textverarbeitung verwende ich zu 90% Texteditor mit Markdown.Und Excel, ja. Ganz ehrlich, ihr kennt meine Meinung zu Excel.Ich denke, Excel ist das einzige Programm im gesamten Office.Also von den Basics-Sachen, was irgendwie eine Daseinsberechtigung hat.Excel ist quasi die IDE des BWLers oder die IDE der Hausfrau.Darf man das, der Hauspersonen, der Hausmenschen, der Haus...Ja, sag mal, gibt es eigentlich auch eine Männlichkeitsform,wenn man standardmäßig Hausfrau sagt?So, man sagt dann HandwerkerInnen.Gibt es dann auch eine Vermännlichung oder sowas dann?Also ja, im Moment Hausmann. Hausmann trifft es ja auch nicht.Also irgendwas, wo man dann aus Hausfrau oder Haus irgendwie dann noch beide einschließt.Ohne, dass man sich ein eigenes Wort ausdenken muss.Hauswirtschafter. Ah ja, das ist natürlich nicht schlecht.Hauswirtschaftende. Das wäre es, oder?Das ist die Pfeifert-Sache, die heute...Hauswirtschaftende. Das ist komplett neutral.Ergibt wenig Sinn, weil das mehrdeutig ist.Es könnten ja auch Leute sein, die im Haus wirtschaftende sind.Aber egal, das ist ein unsinniges Thema.Ja, jetzt haben wir uns das Video nochmal angeguckt.Ich konnte ein paar Takte dazu loswerden.Haushaltsführende Person. Aha, siehst du mal.Find ich toll, dass es da sogar schon Seiten für gibt.Haushaltsführende Person.Das kann aber auch was anderes mit gemeint sein.Mit Haushaltsführend kann man auch... Also es kommt auf den Kontext an.Also es ist nicht so einfach.Okay Leute, ich bin jetzt schon 25 Minuten über Bett getimed.Ich gehe jetzt auch pennen. Wir sehen uns.Spontaner Stream heute gewesen. Im nächsten wird er gebastelt.Also bis denn. Macht's gut. Bis zum nächsten Stream.", "segments": [{"id": 1, "start": 90.0, "end": 115.96, "text": "Moin, da bin ich."}, {"id": 2, "start": 115.96, "end": 123.96, "text": "Was ist das für ein Emote, das kenne ich gar nicht."}, {"id": 3, "start": 123.96, "end": 126.0, "text": "Wusste gar nicht, dass ich das aktiviert habe."}, {"id": 4, "start": 126.0, "end": 129.12, "text": "Hab ich das aktiviert oder ist das irgendwie ein Personal Emote von dir?"}, {"id": 5, "start": 129.12, "end": 133.92, "text": "Find ich gar nicht übel."}, {"id": 6, "start": 133.92, "end": 136.92, "text": "Ich glaube es ist ein Personal Emote von dir."}, {"id": 7, "start": 136.92, "end": 138.2, "text": "Ich hab das noch nie gesehen."}, {"id": 8, "start": 138.2, "end": 140.76, "text": "So, Sound mal kurz checken."}, {"id": 9, "start": 140.76, "end": 144.44, "text": "Ob Teams wieder irgendwas verkackt hat."}, {"id": 10, "start": 144.44, "end": 145.44, "text": "Achso, hört man mich?"}, {"id": 11, "start": 145.44, "end": 146.44, "text": "Gut."}, {"id": 12, "start": 146.44, "end": 149.44, "text": "Ja, weil das letzte Mal hab ich ja geschwätzt, 10 Minuten lang und ihr habt mich nicht gehört."}, {"id": 13, "start": 149.44, "end": 154.08, "text": "Personal, ja, dachte ich mir, ok, Sound passt, exellent, exellent."}, {"id": 14, "start": 154.08, "end": 159.04, "text": "Ja Leute, ich muss heute ein bisschen entspannter sprechen mit euch, ja."}, {"id": 15, "start": 159.04, "end": 163.24, "text": "Etwas ruhiger, entspannter, weil mir tut wieder der Hals weh, war jetzt ein paar Wochen lang"}, {"id": 16, "start": 163.24, "end": 164.24, "text": "richtig gut."}, {"id": 17, "start": 164.24, "end": 170.88, "text": "Aber seit ein, zwei Tagen tut mir der Hals wieder ein bisschen weh und ich will nicht,"}, {"id": 18, "start": 170.88, "end": 181.16, "text": "dass es wieder, äh, so beschissen wird wie es letztes Mal war, 50 Minuten bis, bis was,"}, {"id": 19, "start": 181.16, "end": 182.16, "text": "was für ein Ding?"}, {"id": 20, "start": 182.16, "end": 195.92, "text": "Ach du, ja ok, ich glaube jetzt weiß ich was du meinst, ich muss mal kurz, du meinst,"}, {"id": 21, "start": 195.92, "end": 198.68, "text": "du meinst dieses Gerichtsverfahren mit, mit, mit Dings, mit Johnny Depp?"}, {"id": 22, "start": 198.68, "end": 204.12, "text": "Ach so, ja da muss ich jetzt mal kurz, kurz in mich, ja ganz ehrlich, das geht mir voll"}, {"id": 23, "start": 204.12, "end": 208.16, "text": "am Arsch vorbei, ich interessiere mich für solche Celebrity Geschichten, absolut gar"}, {"id": 24, "start": 208.16, "end": 209.16, "text": "nicht."}, {"id": 25, "start": 209.16, "end": 212.72, "text": "Ich mein, gut, das ist jetzt als weniger darum, ob das jetzt irgendwelche bekannten Schauspieler"}, {"id": 26, "start": 212.72, "end": 216.64, "text": "sind, sondern eher, so die eigentliche Sache, die die Leute in dem Fall interessieren,"}, {"id": 27, "start": 216.64, "end": 222.84, "text": "wobei auch, auch, ja, wenn jetzt irgendwie, äh, Nachbar um die Ecke sich, äh, dann wird"}, {"id": 28, "start": 222.84, "end": 223.84, "text": "auch keinen interessieren."}, {"id": 29, "start": 223.84, "end": 231.32, "text": "Abofalle, ja, Pock, so muss das sein, ne, aber das interessiert mich überhaupt nicht."}, {"id": 30, "start": 231.32, "end": 236.96, "text": "Ich bekomme, ich bekomme Laufe, aber ich dachte, der hat ihn immer auf den Tisch gehauen, warum"}, {"id": 31, "start": 236.96, "end": 244.72, "text": "sollte ihm der Hals davon weh tun, ähm, was wollte ich denn jetzt sagen, fuck, ich hab"}, {"id": 32, "start": 244.72, "end": 249.2, "text": "gerade zu sehr auf einen anderen Bildschirm geguckt, ach so, ja, man bekommt ja laufend"}, {"id": 33, "start": 249.2, "end": 258.28, "text": "irgendwelche Videos von empfohlen, ich hab auch ein paar mal Kleinigkeiten geguckt, aber"}, {"id": 34, "start": 258.28, "end": 261.6, "text": "das hat mich so überhaupt nicht interessiert, aber ich interessiere mich für so Celebrity"}, {"id": 35, "start": 261.6, "end": 263.28, "text": "Sachen auch absolut gar nicht."}, {"id": 36, "start": 263.28, "end": 275.96, "text": "Danke für die Subs, Leute, Jis Jix, Jis Jix, Leon, Pock Zapp, jo, also wie gesagt, muss"}, {"id": 37, "start": 275.96, "end": 281.04, "text": "ich mich ein bisschen zusammenreißen, ich muss mit euch heute, äh, entspannt und, äh,"}, {"id": 38, "start": 281.04, "end": 286.68, "text": "ASMR Style reden und immer schön was trinken, dass mir der Hals nicht weiter weh tut, ich"}, {"id": 39, "start": 286.68, "end": 291.24, "text": "hab mir jetzt sogar schon, komm mir langsam vor wie der, wie der, wie der riesen Opa,"}, {"id": 40, "start": 291.24, "end": 295.44, "text": "ich hab mir sogar so ein Inhalationsgerät auf Amazon gekauft, dass man dann irgendwie"}, {"id": 41, "start": 295.44, "end": 301.92, "text": "mit so einer Ladung 10 Minuten, äh, Salz, Salzwasser, Dampf inhalieren kann, weil das"}, {"id": 42, "start": 301.92, "end": 308.8, "text": "wohl gegen trockenen Hals und sonst was hilft, es hilft auch ein bisschen was, aber, ich"}, {"id": 43, "start": 308.8, "end": 312.24, "text": "war ja wie gesagt, ich war ja auch schon mal im HNO, als so wirklich rausgekommen ist"}, {"id": 44, "start": 312.24, "end": 319.08, "text": "ja da nix, so, tja, im Prinzip wie Kopium, ja, nur dass ich das selbst halten muss und"}, {"id": 45, "start": 319.08, "end": 320.08, "text": "nicht umgeschnallt hab."}, {"id": 46, "start": 320.08, "end": 336.0, "text": "Also, das sieht aus, sieht aus wie das Kopium-Emote, genau, eigentlich geiler Vergleich, hätt"}, {"id": 47, "start": 336.0, "end": 346.52, "text": "ich jetzt überhaupt nicht dran gedacht, aber ja, das trifft's gut, so, ach ja, warum haben"}, {"id": 48, "start": 346.52, "end": 348.76, "text": "wir Kopium eigentlich nicht aktiviert als Emote?"}, {"id": 49, "start": 348.76, "end": 359.04, "text": "Muss ich mal kurz nachholen, Kopium, Max, hast du meinen Kommentar ernst genommen?"}, {"id": 50, "start": 359.04, "end": 360.04, "text": "Welchen?"}, {"id": 51, "start": 360.04, "end": 378.48, "text": "Du hast doch gar nix geschrieben, außer LOL, oder meinst du diesen Kommentar hier jetzt?"}, {"id": 52, "start": 378.48, "end": 385.96, "text": "Ach so, nee, hab ich nicht gesehen, ich hab aber auch die letzten, letzte halbe Stunde"}, {"id": 53, "start": 385.96, "end": 389.16, "text": "oder so nicht mehr reingeguckt auf YouTube."}, {"id": 54, "start": 389.16, "end": 400.04, "text": "Wisst ihr, was mir gerade einfällt, der Karsten, also so Real Life-Kollege vom Friseur und"}, {"id": 55, "start": 400.04, "end": 408.4, "text": "mir, der hat früher immer gesagt, das heißt nicht YouTube, sondern U2B, und der Karsten"}, {"id": 56, "start": 408.4, "end": 416.84, "text": "hat meistens Ahnung wovon er spricht, dankeschön Michael, 50 Billionen, Massive Q-Chat, aber"}, {"id": 57, "start": 416.84, "end": 421.68, "text": "ich mein, das heißt YouTube, da sind wir uns einig in dem Fall, aber der hat immer gesagt,"}, {"id": 58, "start": 421.68, "end": 427.32, "text": "U2B, nee, man wird nicht aufgemacht, man wird vielleicht eingeschlafen, kann auch sein."}, {"id": 59, "start": 427.32, "end": 438.28, "text": "Du hast mit Keqvee kommentiert, wirklich, Moment, das muss ich jetzt überprüfen, ja,"}, {"id": 60, "start": 438.28, "end": 443.04, "text": "ich habe Keq, hab ich Keqvee kommen, das ist mal, ich antworte manchmal auf Comments ohne"}, {"id": 61, "start": 443.04, "end": 448.68, "text": "richtig was mir das, also das geht nicht durchs normale Gehirn durch, das nimmt so extra"}, {"id": 62, "start": 448.68, "end": 453.32, "text": "Weg, gerade wenn es Twitch-Emotes sind, Sneakflavor, danke für den Sub, zeig mal her, wo habe"}, {"id": 63, "start": 453.32, "end": 454.32, "text": "ich Keqvee?"}, {"id": 64, "start": 454.32, "end": 455.32, "text": "Das da?"}, {"id": 65, "start": 455.32, "end": 461.48, "text": "Nee, das ist der Tainsaw, den hab ich schon eine Weile hier gesehen, zeig mal her, ich"}, {"id": 66, "start": 461.48, "end": 471.52, "text": "hab hier drauf geantwortet, hier, Keqvee hab ich drauf geantwortet, ja Moment, tatsächlich"}, {"id": 67, "start": 471.52, "end": 477.6, "text": "ich hab drauf geantwortet und das ist erst 13 Minuten her, tja, siehst du mal, hab ich"}, {"id": 68, "start": 477.6, "end": 480.56, "text": "das gar nicht richtig, dann hab ich tatsächlich nicht vor einer halben Stunde, sondern vor"}, {"id": 69, "start": 480.56, "end": 486.0, "text": "13 Minuten zuletzt in YouTube reingeguckt und deinen Comment da drauf hab ich nicht"}, {"id": 70, "start": 486.0, "end": 492.72, "text": "mehr gesehen, ist schon, Keq, Keqvee ist quasi so, bei mir ohne Gehirnleistung möglich wie"}, {"id": 71, "start": 492.72, "end": 498.44, "text": "einsen copypasten, weißt du, irgendjemand schreibt was, ich muss das gar nicht lesen,"}, {"id": 72, "start": 498.44, "end": 504.56, "text": "Keqvee, Lul geht auch, weil wir wissen ja, dass Lul größer, größer Lul ist, allerdings"}, {"id": 73, "start": 504.56, "end": 511.88, "text": "ich bin mir nicht sicher, chat, jetzt in Anbetracht der Tatsache, ja, ich mein die Voraussetzungen"}, {"id": 74, "start": 511.88, "end": 518.52, "text": "sind ja ähnlich, beides sind lange Zeit die ultimativen Lach-Emotes gewesen, also Lul"}, {"id": 75, "start": 518.52, "end": 535.4, "text": "oder Keqvee, ja, und beide sind tot mittlerweile, also sowohl TotalBiscuit als auch El Resitas,"}, {"id": 76, "start": 535.4, "end": 541.4, "text": "die sind beide, die sind beide schon gestorben, leider, jetzt mal in Anbetracht der Tatsache,"}, {"id": 77, "start": 541.4, "end": 547.96, "text": "dass das jetzt ja beides wirklich einschneidende Emotes sind, was sagt ihr, was ist das ultimative"}, {"id": 78, "start": 547.96, "end": 554.84, "text": "Twitch, also es gibt nur diese zwei zur Auswahl, was ist das ultimative Twitch, also ehrlich"}, {"id": 79, "start": 554.84, "end": 560.56, "text": "gesagt, die richtet das richtig originale, das richtig originale ist ja auch Lul und"}, {"id": 80, "start": 560.56, "end": 567.32, "text": "nicht das nachgemachte, aber fassen wir mal Lul und Lul zusammen, was ist das ultimative"}, {"id": 81, "start": 567.32, "end": 573.4, "text": "Twitch Lach-Emote, Keqvee oder Lul, was sagt ihr, ich ändere da eigentlich fast wöchentlich"}, {"id": 82, "start": 573.4, "end": 588.44, "text": "meine Meinung, ich tendiere so overall zu Lul, aber von dem, was ich öfters benutze, ist"}, {"id": 83, "start": 588.44, "end": 593.12, "text": "es Keqvee, das heißt, ich bin mir, Lulvee ist natürlich auch gut, aber das zähl ich"}, {"id": 84, "start": 593.12, "end": 602.56, "text": "mal zu Lul dabei, okay Keqvee, ja das ist, das ist witzig, ich mag, ich mag Lul eigentlich"}, {"id": 85, "start": 602.56, "end": 608.32, "text": "als Emote mehr, aber ich verwende Keqvee häufiger, was eigentlich keinen Sinn ergibt, weil man"}, {"id": 86, "start": 608.32, "end": 613.68, "text": "ja davon ausgehen würde, dass man das Emote, was man mehr mag, auch öfters verwendet,"}, {"id": 87, "start": 613.68, "end": 631.48, "text": "aber das muss man nicht verstehen, das ist das übrig gebliebene Zoomer hier in mir,"}, {"id": 88, "start": 631.48, "end": 642.68, "text": "habt ihr mein Video von heute geguckt, ja, es gibt, es kennst du Lul, ne, es gibt wenige"}, {"id": 89, "start": 642.68, "end": 656.76, "text": "älteres Videos in letzter Zeit, das Keqvee, oh man, das ist quasi Emote Rickrolling, wenn"}, {"id": 90, "start": 656.76, "end": 676.08, "text": "man das so will, ja, das ist Emote Rickrolling, ja, also Chat, ich hab paar Themen, die wir"}, {"id": 91, "start": 676.08, "end": 679.32, "text": "uns die nächsten Streams unbedingt angucken müssen, aber ich hatte in den letzten Tagen"}, {"id": 92, "start": 679.32, "end": 685.0, "text": "wenig Zeit, wir müssen uns unbedingt angucken, also was, was ich mir schon eine Weile angucken"}, {"id": 93, "start": 685.0, "end": 689.36, "text": "will ist ein bisschen WebAssembly Zeug, einfach, dass ich mal ein bisschen Ahnung hab, wahrscheinlich"}, {"id": 94, "start": 689.36, "end": 694.96, "text": "mit Rust, dann müssen wir noch ein bisschen an der Monitoring-Geschichte weiter programmieren,"}, {"id": 95, "start": 694.96, "end": 700.92, "text": "äh, programmieren, was erzähl ich denn, weiter, weiter basteln und ich muss noch was"}, {"id": 96, "start": 700.92, "end": 704.76, "text": "für ein Fernsehen machen, aber das erzähl ich euch dann, wenn es soweit ist, dass wir"}, {"id": 97, "start": 704.76, "end": 715.16, "text": "eine Analoge, ähm, Fernsehtechnik, fuck up, abfuck, nicht fuck up, abfuck, der Labelchamp,"}, {"id": 98, "start": 715.16, "end": 720.28, "text": "den hab ich ganz vergessen, ja, das Ding steht hier bei mir rum und geht nicht, das muss"}, {"id": 99, "start": 720.28, "end": 723.68, "text": "auch noch fertig gemacht werden, ja, tatsächlich, ne, der ist nicht tot, den muss ich fertig"}, {"id": 100, "start": 723.68, "end": 728.0, "text": "machen, ich hab mir nicht umsonst dieses Gerät gekauft, zumal der Labelchamp eigentlich fast"}, {"id": 101, "start": 728.0, "end": 738.32, "text": "schon funktional ist, der ist eigentlich zu, sag mal mal, 70-80% fertig, ähm, und wisst"}, {"id": 102, "start": 738.32, "end": 741.72, "text": "ihr wie ich auf das Thema WebAssembly gekommen bin, dass ich mir das unbedingt mal angucken"}, {"id": 103, "start": 741.72, "end": 754.76, "text": "muss, ich hab mir überlegt, ob man nicht, ähm, Videos im Browser abspielen kann, in"}, {"id": 104, "start": 754.76, "end": 760.72, "text": "Sachen, die nicht vom Browser supportet werden, also im Prinzip, was wird vom Browser supportet"}, {"id": 105, "start": 760.72, "end": 771.48, "text": "an Videos, WebM, A264, Codec, ähm, ich glaub das war's zum größten Teil, oder, so, und"}, {"id": 106, "start": 771.48, "end": 775.16, "text": "dann hab ich gesehen, ne, die ToDo-App war doch nur zum üben, du meinst, du meinst"}, {"id": 107, "start": 775.16, "end": 781.68, "text": "CACW as a Service, ach ne, du meinst diese andere ToDo-App, wo, ja Moment, die ToDo-App,"}, {"id": 108, "start": 781.68, "end": 786.8, "text": "die haben wir, die haben wir doch, die haben wir doch nur gebaut zum üben von's Welt damals,"}, {"id": 109, "start": 786.8, "end": 793.04, "text": "das war ToDo-App, niemand braucht die ToDo-App, das war einfach, ToDo-App gibt's 30 Milliarden"}, {"id": 110, "start": 793.04, "end": 798.4, "text": "im Internet, ne, das war einfach nur zum üben, ja, und dann hab ich, dann hab ich Folgendes"}, {"id": 111, "start": 798.4, "end": 810.88, "text": "gefunden auf GitHub, FFmpeg, Wasm, ja, irgendwelche verrückten Leute haben FFmpeg, äh, cross-compiled,"}, {"id": 112, "start": 810.88, "end": 820.28, "text": "so dass es jetzt über WebAssembly im Browser läuft, es ist mittlerweile, ich sag euch,"}, {"id": 113, "start": 820.28, "end": 827.44, "text": "Browser sind eigene Betriebssysteme, mittlerweile, und es kommen so viele coole Entwicklungen"}, {"id": 114, "start": 827.44, "end": 837.24, "text": "noch für Browser, wo man halt echt sagen muss, das ist quasi fast schon egal mittlerweile,"}, {"id": 115, "start": 837.24, "end": 842.72, "text": "was man für einen Unterbau hat, Hauptsache es gibt einen Browser, ja, zum Beispiel, das"}, {"id": 116, "start": 842.72, "end": 850.48, "text": "neueste was angesagt ist in Browsern ist, ja, also Hype ist aktuell ziemlich WebAssembly,"}, {"id": 117, "start": 850.48, "end": 854.68, "text": "dann ist WebGPU voll angesagt aktuell, es gibt noch kaum Browser-Unterstützung, aber"}, {"id": 118, "start": 854.68, "end": 861.8, "text": "das ist so, im Kommen, das ist quasi noch mal eine Stufe tiefer als WebGL, dann gibt"}, {"id": 119, "start": 861.8, "end": 871.24, "text": "es WebCodecs, gibt es noch, was dann besseres Video-Rendering im Browser macht, es gibt"}, {"id": 120, "start": 871.24, "end": 875.44, "text": "so viele, es gibt so viele Sachen, ja, und wisst ihr, wisst ihr was das, was das Bittere"}, {"id": 121, "start": 875.44, "end": 881.8, "text": "dabei ist, wenn man sich das hier mal anguckt, so can I use, und ihr gebt mal irgendwas,"}, {"id": 122, "start": 881.8, "end": 888.2, "text": "ein irgendwas halbwegs modernes, keine Ahnung, WebCodecs, ich weiß, weiß gar nicht ob man"}, {"id": 123, "start": 888.2, "end": 893.36, "text": "hier was nehmen kann, kann man hier gar nicht suchen, zumindest, ihr werdet feststellen,"}, {"id": 124, "start": 893.36, "end": 903.72, "text": "wenn ihr irgendwas halbwegs modernes sucht, Safari supportet den Scheiß immer nicht,"}, {"id": 125, "start": 903.72, "end": 911.88, "text": "also ganz ehrlich, Safari ist der schlimmste Browser und noch, Safari ist der neue Internet-Explorer,"}, {"id": 126, "start": 911.88, "end": 919.56, "text": "ja, und noch schlimmer, warte mal, was hatte ich denn heute Morgen, ja, es gab ja mal sowas"}, {"id": 127, "start": 919.56, "end": 927.96, "text": "wie Media Extensions zum Beispiel, sowas wie Media Extensions gab es ja mal, das war"}, {"id": 128, "start": 927.96, "end": 931.96, "text": "so ein Versuch Video-Playback zu machen, aber hat sich nicht so wirklich durchgesetzt, weil"}, {"id": 129, "start": 931.96, "end": 936.44, "text": "ihr seht es, im Endeffekt, es unterstützt zu jeder Browser, Safari war ein bisschen"}, {"id": 130, "start": 936.44, "end": 943.72, "text": "langsamer, aber, was unterstützt es nicht, eine ganz wichtige Plattform, Safari und iOS"}, {"id": 131, "start": 943.72, "end": 950.32, "text": "unterstützt es nicht, und das hier steht unterstützt ist debated, wirklich unterstützt"}, {"id": 132, "start": 950.32, "end": 957.28, "text": "wird das ganze nur von, auf dem iPad, nicht auf dem iPhone, also es ist schlimm, Safari"}, {"id": 133, "start": 957.28, "end": 968.68, "text": "ist der neue Internet-Explorer, ich mein, sogar so Sachen wie WebP und sowas, brauchen"}, {"id": 134, "start": 968.68, "end": 976.64, "text": "die ewig, oder WebM Unterstützung hatten die beispielsweise auch ewig nicht, jetzt guckt"}, {"id": 135, "start": 976.64, "end": 984.32, "text": "euch das mal an, WebM ist Standard, das ist ewig schon, ihr müsst euch das mal angucken,"}, {"id": 136, "start": 984.32, "end": 995.36, "text": "die erste Unterstützung gab es in Chrome 6, in Chrome 6, das müsst ihr euch mal vorstellen,"}, {"id": 137, "start": 995.36, "end": 1003.68, "text": "den ersten Partialsupport gab es in Chrome 6 und in Firefox 4, aber Safari denkt sich"}, {"id": 138, "start": 1003.68, "end": 1019.24, "text": "so, ne, das brauchen wir nicht, und das, wenn ihr hier guckt, das ist übrigens auch der"}, {"id": 139, "start": 1019.24, "end": 1027.0, "text": "default WebRTC-Codec, was natürlich nochmal doppelt dumm ist, wenn das Safari nicht kann,"}, {"id": 140, "start": 1027.0, "end": 1033.72, "text": "so, mittlerweile ist es halt in Safari so, Safari kann es theoretisch, aber es ist hinter"}, {"id": 141, "start": 1033.72, "end": 1040.28, "text": "einem Config-Switch versteckt, und niemand schaltet das an, außer er hat eine eigene"}, {"id": 142, "start": 1040.28, "end": 1045.12, "text": "Anwendung, die es braucht, und will das machen, also du kannst nicht was im App-Store veröffentlichen,"}, {"id": 143, "start": 1045.12, "end": 1050.6, "text": "was da drauf setzt oder so, weil im Prinzip, nachdem es ja nur Safari gibt unter iOS, es"}, {"id": 144, "start": 1050.6, "end": 1054.24, "text": "gibt ja kein, es gibt ja nicht wirklich, es gibt zwar die App, die so heißt, aber ist"}, {"id": 145, "start": 1054.24, "end": 1059.12, "text": "es nicht, es gibt ja nicht wirklich Chrome und Firefox unter iOS, das ist ja alles Safari"}, {"id": 146, "start": 1059.12, "end": 1064.32, "text": "reprended, sind natürlich auch die Webviews, die man in der Anwendung hat, letztendlich"}, {"id": 147, "start": 1064.32, "end": 1070.68, "text": "Safari, und wenn Safari irgendwas nicht kann, dann kann das das auch im Webview nicht, zumal"}, {"id": 148, "start": 1070.68, "end": 1075.64, "text": "Webview in der Regel noch deutlich restriktiver ist als die richtige Safari-App, auch ganz,"}, {"id": 149, "start": 1075.64, "end": 1094.68, "text": "ganz bitteres, Progressive-Web-Apps, gibt's wieder nicht, Notification, weiß ich, Web-Notifications,"}, {"id": 150, "start": 1094.68, "end": 1100.96, "text": "gibt's wieder nicht, warum, warum gibt es die coolen Sachen immer nicht auf Safari und"}, {"id": 151, "start": 1100.96, "end": 1111.88, "text": "gerade auf Safari iOS, das ist so ein Abfuck, ich mein, die wissen genau, dass es eigentlich"}, {"id": 152, "start": 1111.88, "end": 1121.2, "text": "unmöglich ist, was rauszubringen, was nicht auch Safari iOS berücksichtigt, außer man"}, {"id": 153, "start": 1121.2, "end": 1126.96, "text": "möchte halt irgendwie Millionen an Kunden außen vor lassen, das will natürlich keiner,"}, {"id": 154, "start": 1126.96, "end": 1132.92, "text": "jemand, der eine Web-Service rausbringt oder eine App dafür rausbringt oder eine App rausbringt,"}, {"id": 155, "start": 1132.92, "end": 1138.4, "text": "der muss auf, ich mein, heute sind 80% der User bei so was auf Mobilgeräten unterwegs"}, {"id": 156, "start": 1138.4, "end": 1146.92, "text": "und das meiste ist für Android, aber ein Riesenteil ist auch iOS, ja, aber das gleiche könnte"}, {"id": 157, "start": 1146.92, "end": 1151.92, "text": "man, das gleiche könnte man ja bei Android auch sagen und Android ist da besser, Android"}, {"id": 158, "start": 1151.92, "end": 1159.72, "text": "unterstützt den meisten Krämpel und sogar Web-Notifications, Android Chrome und solche"}, {"id": 159, "start": 1159.72, "end": 1166.92, "text": "Sachen, also das funktioniert, der Preis-Champ, der konnte zum Beispiel unter, also als es"}, {"id": 160, "start": 1166.92, "end": 1175.64, "text": "ihn noch gab, konnte der Preis-Champ, wenn eine Grafikkarte in deiner angegebenen Price-Range"}, {"id": 161, "start": 1175.64, "end": 1181.56, "text": "drinne war, konnte der dir eine Notification schicken, das ging aber nur auf dem Desktop"}, {"id": 162, "start": 1181.56, "end": 1188.48, "text": "oder auf Android, das ging nicht an Safari, weil Apple sich denkt, Moment, das benutze"}, {"id": 163, "start": 1188.48, "end": 1197.08, "text": "ich selten, aber das muss man jetzt mal machen, Apple denkt sich, genau das denkt sich Apple"}, {"id": 164, "start": 1197.08, "end": 1203.92, "text": "beim Support von Safari, Keyukon, lange nicht gesehen, ja, schön, dass du wieder da bist,"}, {"id": 165, "start": 1203.92, "end": 1211.04, "text": "28 Monate, Samuel, danke für 7 Monate Subscription, was ich so spät mache, ich streben jetzt"}, {"id": 166, "start": 1211.04, "end": 1222.84, "text": "bis 22 Uhr und dann gehe ich ins Bett gehen, tja, ja, aber die hätten doch, das was ich"}, {"id": 167, "start": 1222.84, "end": 1228.56, "text": "meine, die hätten ja prinzipiell die gleiche Motivation dahinter wie Apple, aber sie machen"}, {"id": 168, "start": 1228.56, "end": 1234.92, "text": "es nicht, dafür macht, dafür macht Google etwas andere, fragwürdige Sachen, ja, zum"}, {"id": 169, "start": 1234.92, "end": 1241.32, "text": "Beispiel, mal gucken, wie es hier aussieht, ich weiß nicht, ob ihr auch schon die Ehre"}, {"id": 170, "start": 1241.32, "end": 1244.96, "text": "habt, gucken wir mal, ob es hier auch so ist, nee, hier sieht es noch normal aus, hier sieht"}, {"id": 171, "start": 1244.96, "end": 1247.88, "text": "es in dem Firefox aus, probieren wir es, wir machen einfach mal ein paar Browser auf und"}, {"id": 172, "start": 1247.88, "end": 1257.72, "text": "gucken uns das an, what the fuck, warum sieht das so ästlich aus, also hier habe ich es"}, {"id": 173, "start": 1257.72, "end": 1264.72, "text": "noch nicht, hat jemand von euch schon die neue, die neue Navigationsleiste oder diese"}, {"id": 174, "start": 1264.72, "end": 1270.44, "text": "neue Video, nicht Navigation, den neuen Videotitel auf YouTube, guck, wie beschissen das aussieht,"}, {"id": 175, "start": 1270.44, "end": 1279.28, "text": "hier, guck mal, das ist neu, was ist das, also jetzt mal, jetzt mal seriously, wer, welcher"}, {"id": 176, "start": 1279.28, "end": 1284.56, "text": "Low IQ Designer hat er sich gedacht, das ist eine gute Idee, vor allem, ich meine, was"}, {"id": 177, "start": 1284.56, "end": 1291.8, "text": "ist das denn bitte für eine Usability, was ist das für eine Usability, mach die Kommentare"}, {"id": 178, "start": 1291.8, "end": 1298.68, "text": "rechts, wer zum Geier will so Kommentare lesen, wer will so ernsthaft, seriously, wer will"}, {"id": 179, "start": 1298.68, "end": 1306.44, "text": "so, wie beschissen, alter, wer will so Kommentare lesen, man, und wisst ihr, was das, was das"}, {"id": 180, "start": 1306.44, "end": 1318.48, "text": "verdächtige ist, wenn YouTube sowas macht, die pushen gerne solche Changes und nach einem"}, {"id": 181, "start": 1318.48, "end": 1324.56, "text": "dreiviertel Jahr oder so wird das Standard, also ganz ehrlich, wer will diesen Scheiß"}, {"id": 182, "start": 1324.56, "end": 1332.08, "text": "als Standard haben, ja, und ich glaube, tatsächlich, also ich könnte mir das wirklich vorstellen,"}, {"id": 183, "start": 1332.08, "end": 1335.92, "text": "dass YouTube irgendwann, ich glaube es nicht wirklich, aber ich könnte es mir irgendwie"}, {"id": 184, "start": 1335.92, "end": 1344.8, "text": "vorstellen, dass YouTube die Kommentare abschafft und dann auch mit der Begründung, die Leute"}, {"id": 185, "start": 1344.8, "end": 1352.32, "text": "sollen sich safe fühlen oder sowas, das ist ja die neue ultimative Begründung, die mittlerweile"}, {"id": 186, "start": 1352.32, "end": 1358.64, "text": "überall rausgehauen wird und irgendwie aus mir nicht verständlichen Gründen auch überall"}, {"id": 187, "start": 1358.64, "end": 1363.88, "text": "gelten gelassen wird, ja, auch wenn es damit gar nichts zu tun hat, so nach dem Motto, das"}, {"id": 188, "start": 1363.88, "end": 1368.48, "text": "ist alles so negativ, die Leute könnten sich da gekränkt fühlen, da fühlen sich die Leute"}, {"id": 189, "start": 1368.48, "end": 1374.0, "text": "nicht safe in den Kommentaren, deswegen schaffen wir die Kommentare ab, ja, anstatt das Kommentarsystem"}, {"id": 190, "start": 1374.0, "end": 1379.28, "text": "weiter zu verbessern, nein, schafft man sie dann im Zweifelsfall ab, es ist genauso wie"}, {"id": 191, "start": 1379.28, "end": 1384.52, "text": "mit den Videobewertungen, wo ja auch erzählt wurde, die Videobewertungen werden abgeschafft,"}, {"id": 192, "start": 1384.52, "end": 1391.04, "text": "dass keiner Hate-Bewertung abgibt und sowas, sowas bescheuertes, Alter, und das Schlimme"}, {"id": 193, "start": 1391.04, "end": 1397.2, "text": "ist, dass du das heute überhaupt so argumentieren kannst und dass die Leute dann auch noch"}, {"id": 194, "start": 1397.2, "end": 1407.72, "text": "fressen und das glauben, dabei ist es so offensichtlich, dass das irgendeine Marketing-Stonks-Geld-Money-Entscheidung"}, {"id": 195, "start": 1407.72, "end": 1414.36, "text": "ist, als würde es ernsthaft YouTube irgendwie interessieren, ob sich da irgendeiner, die"}, {"id": 196, "start": 1414.36, "end": 1420.28, "text": "persönlichen Gefühle der Leute interessiert, YouTube doch nicht die Bode, wenn die das"}, {"id": 197, "start": 1420.28, "end": 1425.08, "text": "interessieren würden, dann hätten sie zum Beispiel bessere psychologische Betreuung"}, {"id": 198, "start": 1425.08, "end": 1429.92, "text": "für ihre, genauso wie bei Facebook, für ihre Content-Kontrolleure, die das nicht länger"}, {"id": 199, "start": 1429.92, "end": 1433.44, "text": "als ein halbes Jahr machen können und teilweise sich schon umgebracht haben, weil sie sich"}, {"id": 200, "start": 1433.44, "end": 1436.04, "text": "den ganzen kranken Scheiß angucken müssen, die die Leute hochladen."}, {"id": 201, "start": 1436.04, "end": 1442.0, "text": "Das ist einzig und allein eine Stonks-Geld-Entscheidung gewesen, die Kommentare abzuschaffen, deswegen"}, {"id": 202, "start": 1442.0, "end": 1450.64, "text": "kann ich euch nur empfehlen, Leute, was ist was, was möchte, was, warum war da eben kein"}, {"id": 203, "start": 1450.64, "end": 1459.92, "text": "anderes Symbol oben? Chat, wart ihr das? Wer ist es gewesen? Wer hat das andere Symbol"}, {"id": 204, "start": 1459.92, "end": 1468.48, "text": "da gerade oben hingemacht? Die Hacker-Mans im Chat waren's wieder. Weiß war's, ne, wer"}, {"id": 205, "start": 1468.48, "end": 1477.64, "text": "war's denn jetzt? Jetzt Chat, gebt euch zu erkennen, wer ist es gewesen? Ich glaub ja"}, {"id": 206, "start": 1477.64, "end": 1485.96, "text": "Kyokon war das. Der war so lang nicht da. Was wollte ich jetzt sagen? Ja, deswegen kann"}, {"id": 207, "start": 1485.96, "end": 1492.56, "text": "ich euch nur empfehlen, wenn ihr, ich kann nicht mal meinen, ich kann noch nicht mal"}, {"id": 208, "start": 1492.56, "end": 1504.52, "text": "meinen eigenen Namen schreiben, ja. Wenn ihr auf YouTube seid und dann zum Beispiel auf"}, {"id": 209, "start": 1504.52, "end": 1512.2, "text": "meinen Channel geht, ihr müsst, Return YouTube Dislikes, oder ne, wie heißt dieses Addon"}, {"id": 210, "start": 1512.2, "end": 1519.0, "text": "überhaupt? Return YouTube Dislikes müsst ihr euch installieren. Das ist erstaunlich"}, {"id": 211, "start": 1519.0, "end": 1523.52, "text": "akkurat. Soll ich euch mal sagen, wie genau das ist? Soll ich mal kurz reingucken bei"}, {"id": 212, "start": 1523.52, "end": 1528.48, "text": "mir? Also wie gesagt, ich bin hier nicht eingeloggt, ne, also normalerweise kann ich das nicht"}, {"id": 213, "start": 1528.48, "end": 1538.24, "text": "sehen. Das ist erstaunlich akkurat. Ich sag's euch mal, wie genau das ist. Achso, fuck,"}, {"id": 214, "start": 1538.24, "end": 1546.0, "text": "wo sieht man diese Bewertung überhaupt jetzt? Ja, ich hab 1037 Daumen hoch und neun Daumen"}, {"id": 215, "start": 1546.0, "end": 1553.08, "text": "runter und das Plugin hat das quasi, obwohl es das gar nicht sehen kann, auf acht geschätzt."}, {"id": 216, "start": 1553.08, "end": 1559.4, "text": "Das ist nicht schlecht. Obwohl das Plugin halt total versagt, geh ich mal von aus, vermute"}, {"id": 217, "start": 1559.4, "end": 1566.0, "text": "ich, rate ich jetzt mal, ist, wenn du einen Channel hast, der so das Like Dislike Verhältnis"}, {"id": 218, "start": 1566.0, "end": 1570.96, "text": "hat von meinem und der lädt dann auf einen Schlag was super kontroverses rauf und es"}, {"id": 219, "start": 1570.96, "end": 1576.28, "text": "entspricht überhaupt nicht mehr so dem, was ihr Algorithmus gelernt hat über diesen Channel,"}, {"id": 220, "start": 1576.28, "end": 1581.6, "text": "dann könnte es wahrscheinlich komplett nebendran liegen. Ich mein, die machen ja mehrere Sachen"}, {"id": 221, "start": 1581.6, "end": 1586.52, "text": "in diesem Addon, das beschreiben die hier auch irgendwo, was sie genau machen, um die"}, {"id": 222, "start": 1586.52, "end": 1592.84, "text": "Dislikes zu errechnen. Also die haben ein, einfach ein soziales Experiment. Schminkvideo"}, {"id": 223, "start": 1592.84, "end": 1598.92, "text": "mit dem Friseur steht eh noch aus, ja, seit 50 Jahren. So, die haben ja, weiß ich, ob"}, {"id": 224, "start": 1598.92, "end": 1604.88, "text": "sie hier irgendwas erklären, wo sie das machen. How does it work? Genau. Also, ja gut, das"}, {"id": 225, "start": 1604.88, "end": 1612.04, "text": "ist natürlich sehr, ja. Also, die Leute sharen das. Die Leute, die eingeloggt sind, diese"}, {"id": 226, "start": 1612.04, "end": 1617.28, "text": "Extension installiert haben, die können das mit sharen und die machen das aus historischen"}, {"id": 227, "start": 1617.28, "end": 1626.64, "text": "Daten fest und im Hintergrund Auswertung, Comment, View, Ratio und sowas, Like zu Comments, Likes"}, {"id": 228, "start": 1626.64, "end": 1630.64, "text": "zu Views und so. Aber man sieht insgesamt, das funktioniert nicht schlecht, das kommt"}, {"id": 229, "start": 1630.64, "end": 1637.88, "text": "gut hin. Es liegt nur ein Dislike daneben. Ja, normalerweise würde ich sagen, ja, okay,"}, {"id": 230, "start": 1637.88, "end": 1643.48, "text": "bei meinem ist es jetzt besonders korrekt gewesen, aber ich denke mal, so ungefähr wird es bei"}, {"id": 231, "start": 1643.48, "end": 1650.16, "text": "anderen Videos auch stimmen, ja. Es ist doch jetzt egal, ob ein Video 50 Dislikes hat oder"}, {"id": 232, "start": 1650.16, "end": 1655.72, "text": "250 Dislikes hat, wenn das so im Verhältnis ungefähr stimmt. Wichtig ist, dass man eben"}, {"id": 233, "start": 1655.72, "end": 1660.6, "text": "erkennt, welche Videos einfach Schrott sind und welche nichts. Und das ist ja auch mein"}, {"id": 234, "start": 1660.6, "end": 1668.68, "text": "Kritikpunkt an diesem Entfernen gewesen, der Dislikes, dass du gerade im Technologiebereich,"}, {"id": 235, "start": 1668.68, "end": 1674.52, "text": "wenn du dir Talks anguckst von irgendwelchen Konferenzen, die einfach shit sind oder irgendwelche"}, {"id": 236, "start": 1674.52, "end": 1679.36, "text": "indischen Tutorial-Videos hast, wo es eigentlich kaum ums Thema geht oder irgendwas, was ich"}, {"id": 237, "start": 1679.36, "end": 1686.04, "text": "auch geil finde. Manchmal, kennt ihr diese Videos, da steht da irgendwie so, keine Ahnung,"}, {"id": 238, "start": 1686.04, "end": 1694.6, "text": "how to frontend development, Vue.js, bla, bla, bla, wie man was macht. Dann klickst"}, {"id": 239, "start": 1694.6, "end": 1702.96, "text": "du das Video an, auf einmal redet dann einer Indisch. Also Moment, also dieser Titel ist"}, {"id": 240, "start": 1702.96, "end": 1707.24, "text": "definitiv nicht einfach nur, weil das die ähnlichen englischen Wörter sind, sondern"}, {"id": 241, "start": 1707.24, "end": 1710.76, "text": "weil er es explizit auf Englisch geschrieben hat. Das verwirrt mich dann auch immer. Du"}, {"id": 242, "start": 1710.76, "end": 1714.36, "text": "hast ein Video, komplett englischen Titel, mit genau dem Problem, was du hast und hast"}, {"id": 243, "start": 1714.36, "end": 1720.2, "text": "so ein Inder im Video, wo du nichts verstehst. Und dann ist wichtig, dass man sowas direkt"}, {"id": 244, "start": 1720.2, "end": 1724.0, "text": "erkennen kann. Gut, mein Inder erkennst du gleich, den verstehst du nicht, aber gerade"}, {"id": 245, "start": 1724.0, "end": 1729.16, "text": "Konferenz-Talks und Tutorials ist das wichtig, dass man Dislikes hat, weil ansonsten erkennst"}, {"id": 246, "start": 1729.16, "end": 1734.36, "text": "du schlicht und ergreifend nicht. Ich guck mir doch nicht eine Stunde einen Konferenz-Talk"}, {"id": 247, "start": 1734.36, "end": 1742.84, "text": "an, um dann vielleicht bei der Hälfte festzustellen, da kommt jetzt nichts Interessantes. Das fing"}, {"id": 248, "start": 1742.84, "end": 1748.88, "text": "gern zu Indisch, das ist ein Fivehead, so vorbildlich. So sollte man das machen. Boah,"}, {"id": 249, "start": 1748.88, "end": 1752.96, "text": "Leute, mir fällt gerade noch Sache ein. Ich sag euch aber gleich, das gucken wir uns nicht"}, {"id": 250, "start": 1752.96, "end": 1757.88, "text": "im Stream zusammen, man. Ich hab letztens ein ultra Fremdschirm-Video gesehen auf YouTube,"}, {"id": 251, "start": 1757.88, "end": 1764.56, "text": "nicht meins, nicht meins, könnte auch so sein, aber ich hab ein Video gesehen von irgendeinem,"}, {"id": 252, "start": 1764.56, "end": 1769.64, "text": "von der ARD oder so, weiß ich gar nicht genau. Also es hat irgendeiner von Funk auf jeden"}, {"id": 253, "start": 1769.64, "end": 1779.4, "text": "Fall produziert und da haben sie so zwei Twitter-Eltern, so zwei empörte Twitter-Eltern begleitet"}, {"id": 254, "start": 1779.4, "end": 1790.04, "text": "einen Tag lang mit ihrem Kind. Alter, diese Leute waren so fertig. Die waren so fertig,"}, {"id": 255, "start": 1790.04, "end": 1795.0, "text": "das war richtig cringe, Alter, ich konnte mir das kaum angucken. Das Kind ist irgendwie"}, {"id": 256, "start": 1795.0, "end": 1799.88, "text": "zwei oder drei oder glaub ich jetzt, nee, nee, ich glaub vier mittlerweile und es legit,"}, {"id": 257, "start": 1799.88, "end": 1807.96, "text": "pass mal auf, die durfte, das Kind durfte keine normalen Kinderbücher lesen, sondern"}, {"id": 258, "start": 1807.96, "end": 1813.92, "text": "musste Kinderbücher lesen wie My Little Feminist Family und so was. Und da hab ich auch gedacht,"}, {"id": 259, "start": 1813.92, "end": 1828.44, "text": "what the fuck, Alter, was ist mit euch los? Oh no, ja. Ich dachte erst ohne Scheiß, als"}, {"id": 260, "start": 1828.44, "end": 1834.28, "text": "ich das gesehen hab, als ich das gesehen hab, ich dachte erst, das ist ein Witz, ja, also"}, {"id": 261, "start": 1834.28, "end": 1843.08, "text": "ich dachte, das ist im Endeffekt Satire, so könnte man sagen, ist es aber nicht, die"}, {"id": 262, "start": 1843.08, "end": 1851.84, "text": "meinen das wirklich ernst. Ja, ach du hast das auch geguckt, ja. Jaja, genau, das Kind,"}, {"id": 263, "start": 1851.84, "end": 1856.96, "text": "das Kind, das ohne Gender erzogen wird. Alter, das war so cringe, meine Güte, die Leute"}, {"id": 264, "start": 1856.96, "end": 1864.64, "text": "waren auch noch so überzeugt davon. Ich hab nur Schwierigkeiten, das durchzuhalten. Ja,"}, {"id": 265, "start": 1864.64, "end": 1869.96, "text": "genau, die hab ich ja auch an, deswegen seh ich das ja auch. Übrigens, wisst ihr, wisst"}, {"id": 266, "start": 1869.96, "end": 1874.88, "text": "ihr, wer wieder geschrieben hat? Ihr werdet es kaum glauben, mehrfach, mehrfach. Zwei"}, {"id": 267, "start": 1874.88, "end": 1881.08, "text": "Sachen, ratet mal, ratet mal zwei Sachen, die mir wieder Sponsoranfragen geschrieben"}, {"id": 268, "start": 1881.08, "end": 1887.56, "text": "haben, zwei Sachen, zwei verschiedene Sachen. Wahrscheinlich kommt ihr drauf, weil es ist"}, {"id": 269, "start": 1887.56, "end": 1893.88, "text": "ziemlich offensichtlich. Raid, ja, Raid ist das eine, Raid, Raid, korrekt, korrekt, und"}, {"id": 270, "start": 1893.88, "end": 1902.92, "text": "das NordVPN, du, Major Laser, du hast erraten, NordVPN und Raid Shadow Legends, korrekt."}, {"id": 271, "start": 1902.92, "end": 1908.6, "text": "Und witzigerweise, Raid Shadow Legends ist mega hartnäckig, die schreiben mich gerade"}, {"id": 272, "start": 1908.6, "end": 1916.2, "text": "mit vier, von vier unterschiedliche Leute an. Vier unterschiedliche Leute. Also, haben"}, {"id": 273, "start": 1916.2, "end": 1923.12, "text": "die alle Werbeagenturen der Welt beauftragt oder was? Quatsch, ich mach mit denen nix."}, {"id": 274, "start": 1923.12, "end": 1933.4, "text": "Das ist Schwachsinn, die Jugend wird nicht den Bach runtergehen. Die aktuelle Jugend"}, {"id": 275, "start": 1933.4, "end": 1938.88, "text": "ist mehr Five Head, als man sich das vorstellen kann. Deswegen finde ich es immer blöd, wenn"}, {"id": 276, "start": 1938.88, "end": 1943.88, "text": "Leute, sagen wir so, in meinem Alter und plus, so tun, als sind alle jungen Leute doof."}, {"id": 277, "start": 1943.88, "end": 1949.72, "text": "Das ist nicht so. Die jungen Leute sind nicht doof. Die jungen Leute sind im Verhältnis"}, {"id": 278, "start": 1949.72, "end": 1957.28, "text": "genauso doof und schlau wie die älteren Leute. Ein Faktor gibt es aber. Manche Sachen, da"}, {"id": 279, "start": 1957.28, "end": 1967.0, "text": "macht es die Erfahrung auch ein bisschen aus. Zum Beispiel, diese ganzen Scams, komm in"}, {"id": 280, "start": 1967.0, "end": 1977.44, "text": "die Gruppe, kauf meine Stonks, du wirst reich, die ganzen Scams, die es überall gibt. Ich"}, {"id": 281, "start": 1977.44, "end": 1983.64, "text": "glaube, manchmal muss man einfach, da muss ein paar Jahre ins Land gezogen sein, vielleicht"}, {"id": 282, "start": 1983.64, "end": 1989.24, "text": "muss man auch schon mal gescampt worden sein und dann lernt man es vielleicht früher oder"}, {"id": 283, "start": 1989.24, "end": 1994.44, "text": "später, dass wenn die Leute versprechen, sie machen dich reich und nur sie wissen,"}, {"id": 284, "start": 1994.44, "end": 1999.12, "text": "wie das geht, dass das in der Regel nur zum besten dieser Leute ist und nicht für dich"}, {"id": 285, "start": 1999.12, "end": 2005.72, "text": "selbst. Das ist wieder was anderes. Die alten Leute fallen auf den Enkeltrick rein oder"}, {"id": 286, "start": 2005.72, "end": 2010.6, "text": "solche Dinge. Na gut, es gibt ja auch noch den Handwerkertrick, das ist quasi der Enkeltrick"}, {"id": 287, "start": 2010.6, "end": 2016.4, "text": "für etwas Jüngere. Ja, das gibt es schon. Aber gerade so diese Beschisssachen, die es"}, {"id": 288, "start": 2016.4, "end": 2021.08, "text": "gibt, auch von Schneeballsystemen und sonst was. Ich glaube, manche Sachen muss der erste"}, {"id": 289, "start": 2021.08, "end": 2029.28, "text": "Mal am eigenen Leib erfahren haben oder oft genug das mitbekommen haben, wie es passiert"}, {"id": 290, "start": 2029.28, "end": 2033.84, "text": "ist und realisiert haben. Die meisten Leute, die versprechen, dass sie dich reich machen,"}, {"id": 291, "start": 2033.84, "end": 2039.6, "text": "wollen dich scammen. Übrigens, wisst ihr, was das erste Mal war, wo ich gescampt wurde?"}, {"id": 292, "start": 2039.6, "end": 2044.56, "text": "Nichts Schlimmes. Nichts Schlimmes. Aber wo ich mich richtig krass gescampt gefühlt"}, {"id": 293, "start": 2044.56, "end": 2056.6, "text": "habe, mir hat in Diablo 2 einmal einer meine Windforce gescampt in einem Trade. Falls jemand"}, {"id": 294, "start": 2056.6, "end": 2062.0, "text": "Diablo 2 gespielt hat, der weiß Windforce ist so ziemlich der beste Bogen im Spiel,"}, {"id": 295, "start": 2062.0, "end": 2071.92, "text": "gerade wenn man Amazone spielt und der hat Trade-Window-Trick, was es in fast jedem MMO"}, {"id": 296, "start": 2071.92, "end": 2081.28, "text": "oder Action-RPG mit Trade in irgendeiner Weise schon gegeben hat. Also was ist Trade-Window-Trick?"}, {"id": 297, "start": 2081.28, "end": 2092.2, "text": "Trade-Window-Trick ist also Trade-Window D2. Ich zeige euch einfach mal was hochaufgelösteres."}, {"id": 298, "start": 2092.2, "end": 2100.56, "text": "Zum Beispiel das Path of Exile Trade-Window. Das sieht fast genauso aus wie das Trade-Window"}, {"id": 299, "start": 2100.56, "end": 2105.6, "text": "aus Diablo 2, nur ein bisschen mehr High-Res. Das ist halt ein Trade-Window. Und was passiert"}, {"id": 300, "start": 2105.6, "end": 2112.6, "text": "beim Trade-Window-Scam und was man dagegen machen kann? Naja, man tauscht einfach Sachen"}, {"id": 301, "start": 2112.6, "end": 2120.6, "text": "aus, die entweder so aussehen, wie die eigentlichen Sachen die man haben will. Ja zum Beispiel"}, {"id": 302, "start": 2120.6, "end": 2127.32, "text": "hier tradet einer in Path of Exile einen Stab mit drei Sockel in dieser Farbe. Was jetzt"}, {"id": 303, "start": 2127.32, "end": 2133.16, "text": "passieren kann ist, dass der sich das anguckt, drüber geht und sagt ah ist alles okay. Also"}, {"id": 304, "start": 2133.16, "end": 2139.32, "text": "der hier, der oben und dann tauscht er den Stab aus gegen einen anderen Stab, der auch"}, {"id": 305, "start": 2139.32, "end": 2144.0, "text": "genauso aussieht mit den gleichen Sockel und wenn du dann halt nicht guckst bist du gescammt."}, {"id": 306, "start": 2144.0, "end": 2149.44, "text": "So und sowas in der Richtung ist mir in Diablo 2 auch passiert mit dem ziemlich poggers Bogen."}, {"id": 307, "start": 2149.44, "end": 2159.4, "text": "Ja, Trade-Window-Scam gibt es und das einfachste ist, sobald ihr mitbekommt, dass irgendjemand"}, {"id": 308, "start": 2159.4, "end": 2164.52, "text": "in den Trade-Windows, das ist jetzt für alle Spiele mit Trade, wenn einer anfängt rum"}, {"id": 309, "start": 2164.52, "end": 2169.56, "text": "zu klicken in den Trade-Windows, bricht den Trade ab. Es gibt keinen Grund, dass du in"}, {"id": 310, "start": 2169.56, "end": 2175.12, "text": "diesem Trade-Window die Items 50 mal klicken musst, rein oder raus legen, gibt es nicht."}, {"id": 311, "start": 2175.12, "end": 2179.76, "text": "Der einzige Grund ist Scam und das ist sowas, das lernt man einfach nur durch Erfahrung,"}, {"id": 312, "start": 2179.76, "end": 2197.32, "text": "das weiß man noch nicht. Ja, es ist im Prinzip auch wie BitConnect, ich meine ernsthaft,"}, {"id": 313, "start": 2197.32, "end": 2203.32, "text": "irgendjemand der BeConnect geguckt hat, war der Meinung, das ist kein Scam und das ist"}, {"id": 314, "start": 2203.32, "end": 2213.92, "text": "eine legit Unternehmung, der man Geld geben soll und da frage ich mich jetzt, wer sieht"}, {"id": 315, "start": 2213.92, "end": 2240.76, "text": "so ein Video? Also wer guckt sich sowas an? Wer guckt sich sowas an? Es reichen schon"}, {"id": 316, "start": 2240.76, "end": 2250.44, "text": "die ersten 10 Sekunden und denkt sich, jawoll, denen gebe ich mein Geld. Wirkt das in irgendeiner"}, {"id": 317, "start": 2250.44, "end": 2265.72, "text": "Art und Weise seriös, als sollte ich denen mein Geld geben? So und das haben sich Leute"}, {"id": 318, "start": 2265.72, "end": 2275.68, "text": "angeguckt und haben daraufhin gesagt, jawoll, Carlos, nimm meine Kohle. By the way, es hat"}, {"id": 319, "start": 2275.68, "end": 2282.56, "text": "sich ja im Nachhinein rausgestellt, die Leute, ich hab's nicht mehr so genau im Kopf, also"}, {"id": 320, "start": 2282.56, "end": 2285.44, "text": "nehmt das mal mit einer Portion Skepsis, kann sein, dass ich euch jetzt Mist erzähle, aber"}, {"id": 321, "start": 2285.44, "end": 2289.12, "text": "ich bilde mir ein, ich hab sowas mal gelesen, die Leute, die hier auf der Bühne standen"}, {"id": 322, "start": 2289.12, "end": 2295.8, "text": "wussten gar nicht um was es geht, das war einfach nur Show, dann stell dich mal auf"}, {"id": 323, "start": 2295.8, "end": 2325.72, "text": "die Bühne. So, okay, das reicht jetzt, das reicht jetzt. Wer hat sich gedacht, den"}, {"id": 324, "start": 2325.72, "end": 2334.28, "text": "gebe ich mal, wobei, der Typ wurde ja auch gescampt, aber wer hat sich gedacht, kennst"}, {"id": 325, "start": 2334.28, "end": 2346.84, "text": "du den Typ mit dem 2 Millionen, ja, das hab ich schon gesehen, da gibt's ein Video von,"}, {"id": 326, "start": 2346.84, "end": 2352.04, "text": "gibt's ein Video zu, dieser YouTuber hat fast 2 Millionen Videos veröffentlicht, aber"}, {"id": 327, "start": 2352.04, "end": 2356.24, "text": "ich weiß nicht, ob das mal, ob das jetzt noch mal kurz hier abzuschließen, oh ne, der"}, {"id": 328, "start": 2356.24, "end": 2363.4, "text": "Insimodus, das ist so dumm, das hab ich mir gemerkt, alter, der Insimodus wurde aktiviert,"}, {"id": 329, "start": 2363.4, "end": 2374.64, "text": "das klingt immer noch zu geil, alter, der Insimodus, ich fass es nicht, egal, so, aber um die Sache"}, {"id": 330, "start": 2374.64, "end": 2383.32, "text": "abzuschließen, also niemand, der ernsthaft noch seine Tassen alle im Schrank hat und"}, {"id": 331, "start": 2383.32, "end": 2388.8, "text": "vielleicht schon mal mitbekommen hat, dass die Leute öfters mal gescampt werden, gerade"}, {"id": 332, "start": 2388.8, "end": 2395.84, "text": "mit solchen Sachen, gibt den Leuten oder hat den Leuten von Bitconnect sein Geld gegeben,"}, {"id": 333, "start": 2395.84, "end": 2398.4, "text": "das ist das, was ich mein, manchmal brauchst du einfach ein bisschen Erfahrung, weil du"}, {"id": 334, "start": 2398.4, "end": 2402.64, "text": "weißt, wenn die Leute versprechen, sie machen dich reich, dann ist es Schwachsinn, hey,"}, {"id": 335, "start": 2402.64, "end": 2407.0, "text": "ich sag nicht, dass da keiner drauf reinfällt, aber es ging ja darum, dass alle Boomer, alle"}, {"id": 336, "start": 2407.0, "end": 2410.04, "text": "Zoomer doof sind und das ist ja nicht so."}, {"id": 337, "start": 2410.04, "end": 2416.88, "text": "Das ist tatsächlich so, ja, wir haben auch dumme Sachen gemacht und wisst ihr, wisst"}, {"id": 338, "start": 2416.88, "end": 2418.08, "text": "ihr was ich mich teilweise frage?"}, {"id": 339, "start": 2418.08, "end": 2429.8, "text": "Ich bin letztens an meiner alten Schule vorbeigelaufen und irgendwann Nachmittags und die haben jetzt"}, {"id": 340, "start": 2429.8, "end": 2435.28, "text": "einen neuen Parkplatz, früher war das so, da gab es einen Parkplatz vor der Schule,"}, {"id": 341, "start": 2435.28, "end": 2438.36, "text": "keine Ahnung, acht Stellplätze oder so, das war im Prinzip für die Lehrer oder wenn"}, {"id": 342, "start": 2438.36, "end": 2444.0, "text": "mal irgendwie Nachmittags da einer hin musste oder so, war im Prinzip für die Lehrer und"}, {"id": 343, "start": 2444.0, "end": 2455.8, "text": "ansonsten, manchmal wurden die Kinder vorbeigebracht, aber zu 90% sind eigentlich früher die Kinder"}, {"id": 344, "start": 2455.8, "end": 2460.8, "text": "immer mit dem Fahrrad gefahren oder in die Schule gelaufen, ja, das war ja auch nicht"}, {"id": 345, "start": 2460.8, "end": 2465.44, "text": "weit, aber ich bin letztens bei mir an der Schule vorbeigegangen mittags und die haben"}, {"id": 346, "start": 2465.44, "end": 2472.52, "text": "jetzt einen extra Parkplatz, mal kurz Musik an, die haben jetzt einen extra Parkplatz,"}, {"id": 347, "start": 2472.52, "end": 2477.6, "text": "weil es morgens zu viel Stress gegeben hat, weil die alle ihre Kinder nicht mehr abliefern"}, {"id": 348, "start": 2477.6, "end": 2488.04, "text": "können und da frage ich mich immer so, ich meine, wir haben den Kram überlebt und meine"}, {"id": 349, "start": 2488.04, "end": 2493.88, "text": "Oma hat auch irgendwie überlebt, wie haben die das eigentlich gemacht alle, wie haben"}, {"id": 350, "start": 2493.88, "end": 2501.04, "text": "wir das überhaupt überlebt, das ist doch eigentlich gar nicht möglich, also müsste"}, {"id": 351, "start": 2501.04, "end": 2506.6, "text": "man sich halt denken, ja, also ich meine, ich verstehe beispielsweise nicht, warum du"}, {"id": 352, "start": 2506.6, "end": 2511.24, "text": "die Kinder unbedingt mit dem Auto zur Schule fahren musst, ich meine, ich wäre auch gerne"}, {"id": 353, "start": 2511.24, "end": 2516.88, "text": "zur Schule gefahren worden, ja, das ist angenehm, es ist angenehm, aber ich meine, du musst"}, {"id": 354, "start": 2516.88, "end": 2526.64, "text": "doch nicht bei jedem Schritt und Dritt dabei sein, ja, und also, ist so schlimm, fahre"}, {"id": 355, "start": 2526.64, "end": 2542.68, "text": "ich Fahrrad, fahre ich jetzt auch nicht, ja, so ist es, ja, CSGO Skin Trades, das ist genau"}, {"id": 356, "start": 2542.68, "end": 2554.16, "text": "so was in der Richtung, doch, ist so, doch, doch, doch, doch, genau das passiert auch"}, {"id": 357, "start": 2554.16, "end": 2560.12, "text": "in den Trade Windows, sobald er das Item bewegt, ist er weg, aber du musst dann erneut bestätigen,"}, {"id": 358, "start": 2560.12, "end": 2564.52, "text": "aber wenn der Typ das 3, 4 mal rein und raus zieht, dann guckst du vielleicht nicht mal"}, {"id": 359, "start": 2564.52, "end": 2568.8, "text": "richtig nach, ja, zumal das ja noch heimtückischer machen kannst, es gibt ja Items, die sind"}, {"id": 360, "start": 2568.8, "end": 2573.64, "text": "ultra viel wert, weil sie 2, 3 Stats in der richtigen Kombination haben und dann hast"}, {"id": 361, "start": 2573.64, "end": 2577.52, "text": "du was mit vielleicht schlecht gewürfelten Stats, aber den gleichen Stats, was genau"}, {"id": 362, "start": 2577.52, "end": 2582.2, "text": "so aussieht und dann guckst du drüber, wenn das wieder hingeht, der Verify Button und"}, {"id": 363, "start": 2582.2, "end": 2589.04, "text": "dann guckst du nicht genau auf die Zahl, also Trade Scam is real, mittlerweile versuchen"}, {"id": 364, "start": 2589.04, "end": 2595.08, "text": "die Leute, versucht man da ein bisschen vorzubeugen, aber damals wurdest du Diablo 2 quasi die"}, {"id": 365, "start": 2595.08, "end": 2605.52, "text": "ganze Zeit versucht zu Trade Windows scammen, im Trade Channel, übrigens, ich hab mir das"}, {"id": 366, "start": 2605.52, "end": 2612.4, "text": "Video tatsächlich nochmal angeguckt, wir haben ja letztens nur den Ausschnitt geguckt, wo"}, {"id": 367, "start": 2612.4, "end": 2619.08, "text": "ApoRed den Insie Modus aktiviert hat, wobei ich glaube ich hab's zugemacht, boah, was"}, {"id": 368, "start": 2619.08, "end": 2625.48, "text": "war das denn, irgendein Musikvideo, ich hab mir das jetzt nochmal angeguckt das Video"}, {"id": 369, "start": 2625.48, "end": 2629.88, "text": "und wisst ihr, was ich mir so gedacht habe, ich hab keine Ahnung ob das stimmt, also"}, {"id": 370, "start": 2629.88, "end": 2635.48, "text": "erstens hab ich mir dabei gedacht, das ist ganz schön blöd, quasi öffentlich zuzugeben,"}, {"id": 371, "start": 2635.48, "end": 2641.68, "text": "dass man den Staat bescheißen will, indem man Privatinsolvenz anmeldet und dann im Ausland"}, {"id": 372, "start": 2641.68, "end": 2648.52, "text": "die fette Kohle macht, so, das öffentlich zu sagen ist schonmal blöd, aber wisst ihr"}, {"id": 373, "start": 2648.52, "end": 2652.92, "text": "was deutlich wahrscheinlicher ist oder was naheliegender ist, was ich so noch gar nicht"}, {"id": 374, "start": 2652.92, "end": 2660.44, "text": "gehört hab, aber was mir sofort eingefallen ist, vielleicht denkt er sich das einfach"}, {"id": 375, "start": 2660.44, "end": 2666.32, "text": "nur aus, vielleicht ist es ihm peinlich Insolvenz anmelden zu müssen, das kann ich mir gut"}, {"id": 376, "start": 2666.32, "end": 2673.24, "text": "vorstellen, wär's mir auch, vielleicht ist das einfach nur ne Story, dass es nicht so"}, {"id": 377, "start": 2673.24, "end": 2682.0, "text": "peinlich wirkt, dass er Insolvenz anmelden muss, dann kann er sowas ja erzählen, also"}, {"id": 378, "start": 2682.0, "end": 2686.8, "text": "finde ich witzig, dass das kommt, ja den Anwalt YouTuber haben wir letztes Jahr den Ausschnitt"}, {"id": 379, "start": 2686.8, "end": 2692.04, "text": "geguckt, der Insimodus, das ist finde ich die viel naheliegendste Variante, ich mein"}, {"id": 380, "start": 2692.04, "end": 2698.72, "text": "der hat schon ein paar doofe Sachen gebracht in der Vergangenheit, aber dass er so unvorsichtig"}, {"id": 381, "start": 2698.72, "end": 2703.76, "text": "ist und wenn er dann den Staat da um Geld scammen will und dann sich öffentlich im Video"}, {"id": 382, "start": 2703.76, "end": 2708.46, "text": "hinstellt, kann ich mir nicht vorstellen, das ist irgendeine Story, weil es ihm peinlich"}, {"id": 383, "start": 2708.46, "end": 2712.52, "text": "ist, dass er Insolvent ist, was ich auch voll verstehen kann an der Stelle, also insofern."}, {"id": 384, "start": 2712.52, "end": 2734.0, "text": "Hast du, du hast doch für die China-Chinesen gerät ein eigenes WLAN, ja hab ich. Wie bekomme"}, {"id": 385, "start": 2734.0, "end": 2738.8, "text": "ich das günstig hin, würde da, ja, also Mikrotik kann mehr oder weniger alles was"}, {"id": 386, "start": 2738.8, "end": 2744.84, "text": "man braucht, die haben WLAN Support, du kannst mehrere SSIDs haben, das ist kein Ding, wobei"}, {"id": 387, "start": 2744.84, "end": 2752.02, "text": "ich sagen muss, die haben mich nicht so überzeugt, die Mikrotik Access Points, ich hab mir das"}, {"id": 388, "start": 2752.02, "end": 2758.0, "text": "aktuelle Lineup aber nicht angeguckt, ich bin riesen Fan was Mikrotik Router und Switcher"}, {"id": 389, "start": 2758.0, "end": 2763.0, "text": "angeht, gerade im Heimbereich und wenn es preisleistungsmäßig gut sein soll, man kann"}, {"id": 390, "start": 2763.0, "end": 2767.8, "text": "sich sowas ohne Probleme auch ins Rechenzentrum hängen, ja, fand ich witzig, könnt ihr euch"}, {"id": 391, "start": 2767.8, "end": 2771.88, "text": "auch dran erinnern, es war mal irgendeiner im Stream, da hab ich gesagt, ja, im Zweifelsfall"}, {"id": 392, "start": 2771.88, "end": 2775.36, "text": "kannst du dir so ein Mikrotik auch ins Rechenzentrum hängen, da hat der Typ dann hier, es können"}, {"id": 393, "start": 2775.36, "end": 2779.34, "text": "auch die Kommentare von YouTube gewesen sein, ich weiß es nicht mehr, wo so ein Besserwisser"}, {"id": 394, "start": 2779.34, "end": 2783.96, "text": "wieder am Start war, so nach dem Motto, ha lol Max, sowas hängt man sich doch nicht in"}, {"id": 395, "start": 2783.96, "end": 2789.2, "text": "ein Rechenzentrum, in ein Rechenzentrum da kommen Cisco Geräte hin oder DLG, aber Mikrotik,"}, {"id": 396, "start": 2789.2, "end": 2794.64, "text": "das kommt nicht ins Rechenzentrum, als weiß der das, ja, als kennt er jedes Rechenzentrum"}, {"id": 397, "start": 2794.64, "end": 2799.48, "text": "und auch ein paar billige, die auf ein letztes Loch pfeifen und aufs Geld achten müssen und"}, {"id": 398, "start": 2799.48, "end": 2807.08, "text": "weiß das, ja, mit Sicherheit, mit Sicherheit gibt es mehr als genug Serverräume und Rechenzentren,"}, {"id": 399, "start": 2807.08, "end": 2814.12, "text": "wo auch, wir reden jetzt ja hier nicht von einem DC Style Riesenrechenzentrum unterirdisch,"}, {"id": 400, "start": 2814.12, "end": 2819.16, "text": "es wird genug Rechenzentren geben, wo Mikrotik Geräte rumhängen, es wird genauso gut auch"}, {"id": 401, "start": 2819.16, "end": 2825.8, "text": "die ein oder anderen Racks geben, wo tatsächlich Ubiquiti Dinger drinnen hängen, wobei ich"}, {"id": 402, "start": 2825.8, "end": 2831.04, "text": "das wirklich nicht ins Rechenzentrum hängen würde, aber was anderes, davon auszugehen,"}, {"id": 403, "start": 2831.04, "end": 2837.84, "text": "dass die Leute nur die super krass hochpreisigen Netzwerkgeräte da reinhauen, ist bescheuert,"}, {"id": 404, "start": 2837.84, "end": 2842.36, "text": "weil das kostet einfach ein Schweine Geld, guckt euch mal Preise von aktuellen Cisco"}, {"id": 405, "start": 2842.36, "end": 2849.72, "text": "Switches an, du kriegst beim Mikrotik einen richtig guten Switch oder einen richtig guten"}, {"id": 406, "start": 2849.72, "end": 2860.04, "text": "Router für irgendwas um 1000 Euro, also richtig fetten, bei Cisco bezahlst du dann 35.000"}, {"id": 407, "start": 2860.04, "end": 2868.08, "text": "Euro, also der Grab ist mega teuer, deswegen, das hat schon seine Daseinsberechtigung, wenn"}, {"id": 408, "start": 2868.08, "end": 2872.76, "text": "ich das Geld hätte, dann sieht das anders aus, aber viele müssen halt tatsächlich ein"}, {"id": 409, "start": 2872.76, "end": 2876.72, "text": "bisschen drauf gucken, was sie ausgeben, deswegen so besser wisseregen mich dann auch immer"}, {"id": 410, "start": 2876.72, "end": 2886.48, "text": "auf, so als wüssten sie das irgendwie, wie das auf der ganzen Welt so zu sein hat, ja."}, {"id": 411, "start": 2886.48, "end": 2891.52, "text": "Guckt dir mal die Elon Musk Stream hier auf Twitch an, was Elon Musk hat streamt auf Twitch,"}, {"id": 412, "start": 2891.52, "end": 2898.8, "text": "das ist doch Scam, oder? Das ist das, was beim M-Core auf dem Channel gelaufen ist,"}, {"id": 413, "start": 2898.8, "end": 2915.44, "text": "wo er sein Channel gehackt wurde, diese Scams, ach Deepfakes, ernsthaft? Geil. Ihr hattet"}, {"id": 414, "start": 2915.44, "end": 2921.72, "text": "mit dem Mikrotik immer LZ und es war Shit, ja, das ist natürlich nicht gut. Ok, SwitchOS"}, {"id": 415, "start": 2921.72, "end": 2930.88, "text": "ist auch Pain in the Ass, ja, mit SwitchOS bin ich auch noch nicht warm geworden, aber"}, {"id": 416, "start": 2930.88, "end": 2937.48, "text": "da sieht man es, es gibt ja offensichtlich Rechenzentren, wo Mikrotik steht, zum Beispiel"}, {"id": 417, "start": 2937.48, "end": 2966.96, "text": "in eurem, zumindest mal kurzzeitig. Ja, ich"}, {"id": 418, "start": 2966.96, "end": 2972.76, "text": "kenne sogar eins, ich kenne sogar zwei, wo eine Fritzbox ist. Das eine ist bei mir auf"}, {"id": 419, "start": 2972.76, "end": 2978.84, "text": "der Arbeit, da gibt es nämlich einen kleinen Technikraum mit zwei Racks drinnen, das könnte"}, {"id": 420, "start": 2978.84, "end": 2986.32, "text": "man quasi so grob als Rechenzentrum klassifizieren, da stehen zwei Racks drin und neben, auf dem"}, {"id": 421, "start": 2986.32, "end": 2993.24, "text": "Schrank neben den Racks, liegt eine Fritzbox. Und wisst ihr wofür die Fritzbox da ist,"}, {"id": 422, "start": 2993.24, "end": 2998.68, "text": "das ist gar nicht so dumm, wie es auf den ersten Blick erscheinen mag, dass da eine"}, {"id": 423, "start": 2998.68, "end": 3006.68, "text": "Fritzbox da liegt, tatsächlich, ja, ja, ja, ja, da ist ein Notfalltelefon dran, das ist"}, {"id": 424, "start": 3006.68, "end": 3011.92, "text": "tatsächlich richtig, habt ihr gut geraten. Aber hauptsächlich ist es dafür da, da ist"}, {"id": 425, "start": 3011.92, "end": 3018.48, "text": "nämlich ein extra Internetanschluss hingelegt worden. Sollte mal bei uns wirklich irgendwie"}, {"id": 426, "start": 3018.48, "end": 3025.16, "text": "die super krasse Hacker-Scheiße am Start sein oder totaler Netzwerkzusammenbruch oder was"}, {"id": 427, "start": 3025.16, "end": 3032.24, "text": "auch immer, in dem Raum gibt es Strom, gut Strom gibt es im EZ auch, aber da gibt es"}, {"id": 428, "start": 3032.24, "end": 3037.92, "text": "nochmal extra Strom und es gibt einen DSL-Anschluss mit der Fritzbox, unabhängig von komplett"}, {"id": 429, "start": 3037.92, "end": 3044.16, "text": "dem restlichen Netzwerk im Haus. Der Raum ist übrigens abgeschlossen, nur mal so, also"}, {"id": 430, "start": 3044.16, "end": 3046.92, "text": "es ist nicht so, dass da irgendjemand reingehen kann und sagen, im Moment, die Jungs, ich"}, {"id": 431, "start": 3046.92, "end": 3051.8, "text": "stöpsel mich mal kurz an die Fritzbox an. Also, ist gar nicht so doof, ist gar nicht"}, {"id": 432, "start": 3051.8, "end": 3058.36, "text": "so doof, dass es das gibt. Und den zweiten Raum, den ich kenne, war beim ehemaligen Arbeitgeber"}, {"id": 433, "start": 3058.36, "end": 3062.24, "text": "im, das war nicht wirklich ein Rechensendung, es war auch so ein Abstellraum, da hing auch"}, {"id": 434, "start": 3062.24, "end": 3068.52, "text": "eine Fritzbox. Es hat seinen Sinn, kann durchaus seinen Sinn haben, dass da eine Fritzbox baumelt."}, {"id": 435, "start": 3068.52, "end": 3076.12, "text": "Das ist Pfeilfeld, ja. Hattet ihr noch eine Frage zu deinem Video, Leute, ich muss langsamer,"}, {"id": 436, "start": 3076.12, "end": 3088.24, "text": "ich muss langsamer, entspannter und ruhiger reden und zu, mein Hals wieder weh. Das muss"}, {"id": 437, "start": 3088.24, "end": 3096.76, "text": "ja nicht sein. Wir machen jetzt ASMR-Stream. Ne, machen wir nicht. Also, ich habe auch"}, {"id": 438, "start": 3096.76, "end": 3103.68, "text": "eine Frage zu deinem Video von heute. Gibt es solche Probleme eigentlich auch bei macOS"}, {"id": 439, "start": 3103.68, "end": 3114.16, "text": "in meinem Bekanntenkreis heißt es immer, dass das System so sicher ist. Also, das Video"}, {"id": 440, "start": 3114.16, "end": 3118.48, "text": "von heute, was ich gemacht habe, da ging es ja. Wollen wir uns das Video noch mal zusammen"}, {"id": 441, "start": 3118.48, "end": 3121.16, "text": "angucken und ihr könnt dann was fragen und ich sage noch ein paar Sachen zu, weil es"}, {"id": 442, "start": 3121.16, "end": 3126.12, "text": "haben sich ein paar neue Erkenntnisse ergeben in der Zwischenzeit. Zumindest es geht in"}, {"id": 443, "start": 3126.12, "end": 3133.76, "text": "dem Video darum, also es geht, aber ihr müsst das Video danach, ich reakte jetzt auf meinen"}, {"id": 444, "start": 3133.76, "end": 3139.28, "text": "eigenen Content von heute. Das ist quasi so krasses Content-Recycling, das ist 11-Head"}, {"id": 445, "start": 3139.28, "end": 3142.84, "text": "schon. Das müssen wir eigentlich auf das, also in dem Video geht es darum, nur mal ganz"}, {"id": 446, "start": 3142.84, "end": 3149.96, "text": "kurz, oder wie Semper Video sagen würde, in diesem Video nur ganz kurz, also es geht"}, {"id": 447, "start": 3149.96, "end": 3158.6, "text": "um eine neue Sicherheitslücke aus der Kombination Word plus Windows. Und zwar, Word ist insofern"}, {"id": 448, "start": 3158.6, "end": 3162.96, "text": "betroffen, dass man, ich mache jetzt mal ganz kurz einen Recap, vielleicht müssen wir es"}, {"id": 449, "start": 3162.96, "end": 3169.44, "text": "uns gar nicht angucken, aber um das hier beantworten zu können, muss ich da ein bisschen ausholen."}, {"id": 450, "start": 3169.44, "end": 3179.56, "text": "Also, genau, also es gibt eine Sicherheitslücke in Word, die es erlaubt Templates nachzuholen,"}, {"id": 451, "start": 3179.56, "end": 3183.68, "text": "also Teile, so wie das funktioniert ist. Also du kannst in Word Templates nachladen, das"}, {"id": 452, "start": 3183.68, "end": 3191.8, "text": "ist auf Deutsch sowas wie Dokumentenvorlage. Nur hat sich irgendein extrem Sixheader bei"}, {"id": 453, "start": 3191.8, "end": 3199.6, "text": "Microsoft gedacht, es ist eine gute Idee, dass man diese Dokumentenvorlagen auch übers"}, {"id": 454, "start": 3199.6, "end": 3206.84, "text": "Internet nachladen kann. Wozu das gut sein soll, ich habe keine Ahnung. So, und ein,"}, {"id": 455, "start": 3206.84, "end": 3212.68, "text": "tja, da reichen sechs Köpfe gar nicht mehr. Ein Sevenhead bei Microsoft hat sich danach"}, {"id": 456, "start": 3212.68, "end": 3222.48, "text": "gedacht, es ist noch besser, wenn wir an unsere Templates Embedded HTML mit JavaScript erlauben."}, {"id": 457, "start": 3222.48, "end": 3231.16, "text": "Das heißt, du kriegst jetzt Microsoft Office Word Dokumente, Vorlagen, Word Vorlagen manipuliert"}, {"id": 458, "start": 3231.16, "end": 3238.68, "text": "mit Embedded JavaScript und das ist vollkommen okay und Microsoft sagt, das ist ein Feature,"}, {"id": 459, "start": 3238.68, "end": 3245.76, "text": "das muss so sein. Wenn du diese Dokumente öffnest, dann lädt Microsoft automatisch"}, {"id": 460, "start": 3245.76, "end": 3252.96, "text": "den JavaScript Code und führt ihn aus. Warum es das macht? Weil sie bescheuert sind, keine"}, {"id": 461, "start": 3252.96, "end": 3267.08, "text": "Ahnung. So, und dann kann man hiermit, ja, dann kann man mit diesem manipulierten JavaScript,"}, {"id": 462, "start": 3267.08, "end": 3280.4, "text": "das ist nur ein Beispiel, es gibt noch mehr. Ja, also so sieht der Payload aus, der HTML"}, {"id": 463, "start": 3280.4, "end": 3287.96, "text": "Payload in dieser Word Vorlage und im Endeffekt passiert Folgendes, die tricksen hier ein"}, {"id": 464, "start": 3287.96, "end": 3296.12, "text": "bisschen rum mit ganz vielen A's am Anfang, das dient dazu, dass man an der richtigen Speicheradresse"}, {"id": 465, "start": 3296.12, "end": 3299.36, "text": "ist, also wozu sind die ganzen A's, das ist, dass man an der richtigen Speicheradresse"}, {"id": 466, "start": 3299.36, "end": 3308.6, "text": "ist, dann wird das umgebogen, die Adresse, auf die das JavaScript zeigt oder auf dem das"}, {"id": 467, "start": 3308.6, "end": 3315.8, "text": "aktuelle Browser Fenster zeigt, von HTTP quasi auf MS-MSDT und MS-MSDT dahinter steckt"}, {"id": 468, "start": 3315.8, "end": 3323.2, "text": "ein lokales Windows Programm, wo man eigentlich irgendwelche Remote Hilfen drüber anbieten"}, {"id": 469, "start": 3323.2, "end": 3327.28, "text": "kann oder irgendwas, irgendwas bescheuertes in Windows und zumindest kann man darüber"}, {"id": 470, "start": 3327.28, "end": 3333.36, "text": "dann eine PowerShell starten im Kontext von Word, also im Kontext vom aktuellen User und"}, {"id": 471, "start": 3333.36, "end": 3337.72, "text": "dann dementsprechend alles auf dem System machen, was man will. So, ich sag, wir können"}, {"id": 472, "start": 3337.72, "end": 3342.2, "text": "uns das gleich zusammen noch mal angucken, aber um diese Frage zu beantworten, gibt"}, {"id": 473, "start": 3342.2, "end": 3345.4, "text": "es solche Probleme eigentlich auch bei macOS und eurem Bekannten, das heißt, das System"}, {"id": 474, "start": 3345.4, "end": 3352.52, "text": "ist unsicher. Also, das sind ja zwei Probleme. Das erste Problem ist, dass Word, warum mache"}, {"id": 475, "start": 3352.52, "end": 3356.84, "text": "ich eigentlich immer gerade ihn auf, so, das erste Problem ist, dass Word so beschissen"}, {"id": 476, "start": 3356.84, "end": 3361.88, "text": "ist, genau, man muss doch atmen werden, das ist das einzige, was einen ein bisschen beschützt,"}, {"id": 477, "start": 3361.88, "end": 3366.16, "text": "also das erste Problem ist, dass Word so was bescheuertes mit Templates macht und das zweite"}, {"id": 478, "start": 3366.16, "end": 3374.24, "text": "Problem ist, dass mit MSDST, ich hab schon wieder vergessen, wie es heißt, das sind"}, {"id": 479, "start": 3374.24, "end": 3377.84, "text": "zwei Probleme, deswegen ist auch jeder Windows-User betroffen, das stimmt, was ich da geschrieben"}, {"id": 480, "start": 3377.84, "end": 3382.68, "text": "hab, sind zwei unterschiedliche Probleme, die aktuell aber in Kombination ausgenutzt"}, {"id": 481, "start": 3382.68, "end": 3390.96, "text": "werden. So, und zu dieser Frage, also das erste ist, Mac hat ja auch Microsoft Word,"}, {"id": 482, "start": 3390.96, "end": 3396.52, "text": "ich hab aber keine Ahnung, ob das Word oder Office für Mac die gleichen Schwachstellen"}, {"id": 483, "start": 3396.52, "end": 3402.72, "text": "hat, das hängt davon ab, ob die ja zu den gleichen, den gleichen Basis haben, wie das"}, {"id": 484, "start": 3402.72, "end": 3411.4, "text": "Office für Windows. Zum Beispiel das Office im Browser hat es logischerweise nicht, also"}, {"id": 485, "start": 3411.4, "end": 3416.28, "text": "haben die die gleiche Basis und machen die das gleiche mit Templates, ist das erste Problem"}, {"id": 486, "start": 3416.28, "end": 3429.44, "text": "auch genauso unter MacOS. Das zweite Problem mit diesen MSD-Dingsbumms, MSDST-Excel, das"}, {"id": 487, "start": 3429.44, "end": 3435.68, "text": "gibt es natürlich unter Mac nicht, weil ja das Programm gibt es unter Mac nicht. Potenziell"}, {"id": 488, "start": 3435.68, "end": 3441.88, "text": "geht sowas aber auch unter Mac, weil der eigentliche Ablauf ist äußerst simpel, du"}, {"id": 489, "start": 3441.88, "end": 3446.84, "text": "lädst irgendwas runter und der nächste Schritt ist, es muss ausgeführt werden, das ist ja"}, {"id": 490, "start": 3446.84, "end": 3452.2, "text": "das Schwierige eigentlich. Egal um welche Virus oder wie Sempervideos sagen wir, Schad"}, {"id": 491, "start": 3452.2, "end": 3459.48, "text": "wäre, um die es geht, der erste Schritt, du musst es irgendwie auf das Gerät des Opfers"}, {"id": 492, "start": 3459.48, "end": 3465.04, "text": "bringen, das ist aber meistens noch das einfachere, du musst es irgendwie dazu bringen, dass es"}, {"id": 493, "start": 3465.04, "end": 3473.08, "text": "ausgeführt wird und dass der Schadcode ausgeführt wird, das ist tatsächlich dann wiederum nicht"}, {"id": 494, "start": 3473.08, "end": 3478.24, "text": "so einfach, aber vom Ablauf her in dem Fall ist es total simpel und wenn du dir irgendwas"}, {"id": 495, "start": 3478.24, "end": 3485.44, "text": "runterladen würdest und das ausführen aus dem Internet, dann hast du im Prinzip exakt"}, {"id": 496, "start": 3485.44, "end": 3489.84, "text": "das gleiche unter jedem Betriebssystem und das gibt es unter Linux tatsächlich total"}, {"id": 497, "start": 3489.84, "end": 3502.84, "text": "oft, ja es gibt unter Linux ganz viele Installationsanleitungen, die beispielsweise sowas hier als in ihre Installationsanleitung"}, {"id": 498, "start": 3502.84, "end": 3510.24, "text": "reinschreiben. Die sagen Installation ist ganz einfach, du musst einfach nur diesen"}, {"id": 499, "start": 3510.24, "end": 3516.8, "text": "Befehl ausführen um unsere Software zu installieren. So und dieser Befehl sieht normalerweise folgendermaßen"}, {"id": 500, "start": 3516.8, "end": 3536.4, "text": "aus, ja sinngemäß sowas wie curlcacw.omega-poggers.org slash install.sh gpiped nach bash, so am besten"}, {"id": 501, "start": 3536.4, "end": 3543.28, "text": "auch sudo bash, das ist genau der gleiche Scheiß, ja du lädst irgendwas aus dem Internet"}, {"id": 502, "start": 3543.28, "end": 3547.52, "text": "runter was du nicht kontrolliert hast und lässt es lokal bei dir ausführen, in dem"}, {"id": 503, "start": 3547.52, "end": 3553.04, "text": "Fall sogar noch mit Adminrechten, das ist genau der gleiche Müll wenn man nicht guckt"}, {"id": 504, "start": 3553.04, "end": 3561.04, "text": "was man sich runter lädt. Also potenziell hast du so ähnlich gelagerte Probleme selbstverständlich"}, {"id": 505, "start": 3561.04, "end": 3567.0, "text": "unter jedem Betriebssystem, das heimtückische bei dieser Lücke ist jetzt eben, dass du es"}, {"id": 506, "start": 3567.0, "end": 3573.28, "text": "nicht erkennen kannst. Während du bei sowas relativ offensichtlich siehst, ok ich lade"}, {"id": 507, "start": 3573.28, "end": 3577.68, "text": "hier irgendwelche random Sachen von denen ich keine Ahnung hab aus dem Internet und"}, {"id": 508, "start": 3577.68, "end": 3583.4, "text": "führe sie in einer Rootshell aus, weißt du das ja bei Dokumentenvorlagen nicht. Du lädst"}, {"id": 509, "start": 3583.4, "end": 3590.48, "text": "dir eine Word Dokumentenvorlage runter, machst die auf oder startest den Explorer mit der"}, {"id": 510, "start": 3590.48, "end": 3596.64, "text": "Vorschau und dann fängst du dir was ein. Und sowas gibt es natürlich auch unter allen"}, {"id": 511, "start": 3596.64, "end": 3601.36, "text": "möglichen Betriebssystemen, ich würde aber sagen, dass das potenziell unter Windows"}, {"id": 512, "start": 3601.36, "end": 3612.72, "text": "am häufigsten passiert, hauptsächlich aber, weil Windows das Hauptangriffsziel ist. Sicherlich"}, {"id": 513, "start": 3612.72, "end": 3621.28, "text": "auch, weil Windows irgendwie ja jahrzehntelange Exploiterfahrungen die Leute haben, aber man"}, {"id": 514, "start": 3621.28, "end": 3626.16, "text": "muss sagen Microsoft macht den Angreifern schon in vielen Fällen wirklich das Leben"}, {"id": 515, "start": 3626.16, "end": 3631.16, "text": "sehr schwer. Und es ist nicht so, dass es easy wäre und dass Microsoft, es wird da immer"}, {"id": 516, "start": 3631.16, "end": 3636.2, "text": "gerne auf Microsoft rumgebashed, dass Microsoft einfach nur doof wäre. Microsoft, ich glaube"}, {"id": 517, "start": 3636.2, "end": 3640.64, "text": "das größte Problem was Microsoft hat ist, dass die jahrzehntelange Legacy Code haben"}, {"id": 518, "start": 3640.64, "end": 3649.16, "text": "dennoch in Windows schlummert. Und es sind ja oftmals auch Sicherheitslücken in Bereichen"}, {"id": 519, "start": 3649.16, "end": 3655.08, "text": "die uralt sind. Letztens gab es beispielsweise eine Sicherheitslücke in der alten Windows"}, {"id": 520, "start": 3655.08, "end": 3658.12, "text": "Hilfe, ich weiß gar nicht mehr wie ich die aufmache Leute. Hat jemand einen Plan wie"}, {"id": 521, "start": 3658.12, "end": 3664.52, "text": "man die alte Windows Hilfe öffnet? Wie man das noch aufkriegt? Help? Ne nicht die Help"}, {"id": 522, "start": 3664.52, "end": 3672.68, "text": "App, die alte Windows Hilfe. Diese chf oder wie der Kram heißt, files oder ne nicht chf,"}, {"id": 523, "start": 3672.68, "end": 3686.24, "text": "ist immer noch drinne. Ne das ist nicht Chrono Trigger Musik, das ist ziemlich sicher Mario"}, {"id": 524, "start": 3686.24, "end": 3694.44, "text": "Galaxy. Nein ich mein die, die, wie heißen denn diese alten Windows Hilfe, wir machen"}, {"id": 525, "start": 3694.44, "end": 3701.32, "text": "einfach 7zip auf, die haben glaube ich noch sowas. About, ne wo ist Help, Contents, das"}, {"id": 526, "start": 3701.32, "end": 3709.72, "text": "Ding meine ich hier. Da gab es nämlich letztens auch in 7zip eine Sicherheitslücke was das"}, {"id": 527, "start": 3709.72, "end": 3720.8, "text": "angeht. Ja. So. Ich mein den Kram hier. Da gab es letztens auch eine Sicherheitslücke"}, {"id": 528, "start": 3720.8, "end": 3725.12, "text": "und Microsoft schleppt halt jahrzehntelange Legacy Scheiß mit sich rum. Und haben noch"}, {"id": 529, "start": 3725.12, "end": 3731.88, "text": "solche Dinger drinne. Ich weiß noch da hab ich mal die Frau in der Bücherei von uns"}, {"id": 530, "start": 3731.88, "end": 3736.88, "text": "geschockt früher. Also ich bin ab und zu mal früher in die Bücherei gegangen und da"}, {"id": 531, "start": 3736.88, "end": 3739.96, "text": "gab es auch einen Rechner, da konntest du dann irgendwie ne halbe Stunde umsonst benutzen"}, {"id": 532, "start": 3739.96, "end": 3744.2, "text": "und sonst musst du bezahlen oder komische Regeln. Zumindest konntest du damals, dieser"}, {"id": 533, "start": 3744.2, "end": 3750.4, "text": "Rechner hatte irgendwie so ein komisches Windows mit so nem Kiosk, Kiosk Mode. Das war aber"}, {"id": 534, "start": 3750.4, "end": 3758.16, "text": "damals noch frag mich nicht. Windows ist ewig her. Ich weiß nicht ob es noch 98 war oder"}, {"id": 535, "start": 3758.16, "end": 3765.76, "text": "schon 2000. Ist aber auch egal. Man konnte aus diesem, aus dieser Kiosk Box total easy"}, {"id": 536, "start": 3765.76, "end": 3770.88, "text": "ausbrechen. Das hab ich random rausgefunden an dem, an diesem Rechner in der Bücherei"}, {"id": 537, "start": 3770.88, "end": 3776.04, "text": "und zwar, du musstest Word aufmachen, lustigerweise auch Word, ja. Du musstest Word aufmachen"}, {"id": 538, "start": 3776.04, "end": 3779.68, "text": "und dann musstest du in Word eine Verknüpfung einfügen und da geht ja so ein Dialogfenster"}, {"id": 539, "start": 3779.68, "end": 3785.6, "text": "auf, so wählen sie jetzt das aus, welche Verknüpfung möchten sie dann ausführen"}, {"id": 540, "start": 3785.6, "end": 3792.44, "text": "und da konntest du einfach CMD auswählen. Muss ich ja vorstellen. Da konntest du CMD"}, {"id": 541, "start": 3792.44, "end": 3799.52, "text": "Verknüpfung in Word machen und dann klicken. Oder hast du nen Shell gehabt. Geiler Kiosk"}, {"id": 542, "start": 3799.52, "end": 3810.64, "text": "Modus, oder? Voll geiles Ding ab. Zumindest hab ich das der Frau versucht von der Bücherei"}, {"id": 543, "start": 3810.64, "end": 3815.16, "text": "zu zeigen und die hat es halt überhaupt nicht gecheckt. Und die hat sich dann irgendwann"}, {"id": 544, "start": 3815.16, "end": 3821.4, "text": "aufgeschrieben, meint, ja das muss sie mal mit ihrem Computerleut besprechen. Die war"}, {"id": 545, "start": 3821.4, "end": 3829.32, "text": "auch grade nicht verwirrt danach. Kann ich auch verstehen. Die haben ja da keine Ahnung"}, {"id": 546, "start": 3829.32, "end": 3836.4, "text": "von. Wie läufts mit Arch? Naja ich verwende ja im Prinzip schon Arch seit Jahren. Mit"}, {"id": 547, "start": 3836.4, "end": 3839.48, "text": "dem neuen hab ich jetzt nicht weitergemacht. Muss ich auch noch machen, das waren so viele"}, {"id": 548, "start": 3839.48, "end": 3852.08, "text": "Sachen, die man noch machen muss. Wurz gefixt, nee. Glaube nicht. Ich kann mich jetzt nicht"}, {"id": 549, "start": 3852.08, "end": 3855.96, "text": "dran erinnern, dass ich es irgendwann mal ausprobiert habe und es ging nicht, aber ich hab das danach"}, {"id": 550, "start": 3855.96, "end": 3867.76, "text": "auch nicht wirklich oft ausprobiert. Du hattest auch gleich Admin, ja das ist halt Fail. Was"}, {"id": 551, "start": 3867.76, "end": 3876.64, "text": "für ne Mode? MonkaS als Totenkopf, warum nicht? So also ok, weil ihr seid Leute, wir gucken"}, {"id": 552, "start": 3876.64, "end": 3883.16, "text": "jetzt das Video von mir an und ich sag euch noch ein paar Takte zu. Ist es nicht schlecht"}, {"id": 553, "start": 3883.16, "end": 3886.0, "text": "für deinen YouTube-Kanal, dass du aus dem Homeoffice arbeitest? Ich mein die ganzen"}, {"id": 554, "start": 3886.0, "end": 3889.04, "text": "Storys, die du schon erzählt hast, wären so. Ach nö, ich hab doch auch genug Sachen"}, {"id": 555, "start": 3889.04, "end": 3896.64, "text": "erzählt, die nur nicht so lange her sind. Ja das Video kenn ich, das hab ich auch geguckt."}, {"id": 556, "start": 3896.64, "end": 3904.08, "text": "Mal eine sehr oberflächliche Frage. Kann man ein, also ich hab nie Informatik studiert,"}, {"id": 557, "start": 3904.08, "end": 3911.68, "text": "ja, muss ich dazu sagen. Nochmal so, auch wenn das Informatiker TV ist, ich hab nie Informatik"}, {"id": 558, "start": 3911.68, "end": 3917.6, "text": "studiert. Kann man ein Informatiker als mathematisch durch die begabte Person bewältigen? Du hast"}, {"id": 559, "start": 3917.6, "end": 3923.32, "text": "ja wie ich weiß Informatik, achja sagst du ja auch. Ja, also ich kann dir nur das sagen,"}, {"id": 560, "start": 3923.32, "end": 3928.76, "text": "was ich von Leuten vernommen habe, die Informatik studiert haben, beziehungsweise teilweise"}, {"id": 561, "start": 3928.76, "end": 3936.84, "text": "auch von Leuten, die Mathe studiert haben. Ja, du musst aber bereit sein, nicht damit"}, {"id": 562, "start": 3936.84, "end": 3944.96, "text": "auseinander zu setzen. Also du musst das nicht irgendwie, wie soll ich sagen, so instinktiv"}, {"id": 563, "start": 3944.96, "end": 3952.96, "text": "gottgegeben alles wissen, du musst dich halt damit auseinandersetzen und das, was man in"}, {"id": 564, "start": 3952.96, "end": 3957.92, "text": "der Schule an Mathe gelernt hat, hat damit nicht wirklich großartig was zu tun. Da geht's"}, {"id": 565, "start": 3957.92, "end": 3967.92, "text": "eher darum, dass du Sachen beweisen kannst, ja, von Algorithmenlaufzeit, ja, bis was weiß"}, {"id": 566, "start": 3967.92, "end": 3976.48, "text": "ich, wie Hash-Algorithmen funktionieren und solche Dinger. Das ist teilweise schon etwas"}, {"id": 567, "start": 3976.48, "end": 3985.44, "text": "härtere Kost und dementsprechend musst du dich anstrengen. Und also Mathe ist das,"}, {"id": 568, "start": 3985.44, "end": 3989.6, "text": "was den meisten Leuten im Informatikstudio mit Abstand am schwersten fällt, von dem,"}, {"id": 569, "start": 3989.6, "end": 4001.08, "text": "was ich so höre. Ja, genau, so würde ich das auch sehen. Man muss sich da einfach,"}, {"id": 570, "start": 4001.08, "end": 4007.48, "text": "wenn es dir halt aber komplett zuwider ist und du quasi kotzen musst, sobald es dahin"}, {"id": 571, "start": 4007.48, "end": 4013.08, "text": "geht, dann wird das nichts. Ja, also wenn du sagst, hier, ich kann mir das einfach nicht"}, {"id": 572, "start": 4013.08, "end": 4019.68, "text": "geben, dann wirst du es wahrscheinlich nicht schaffen, weil da kommst du nicht drumherum."}, {"id": 573, "start": 4019.68, "end": 4031.88, "text": "Sowas hattet ihr in Mathe nie? Moment, ihr hattet in Mathe im Informatikstudio nie Algorithmenlaufzeit"}, {"id": 574, "start": 4031.88, "end": 4044.0, "text": "abschätzen? Bestimmt. Was ist das für ein Informatikstudium? What the fuck? Sowas ist"}, {"id": 575, "start": 4044.0, "end": 4053.44, "text": "da doch eigentlich Standard. Also das weiß ich nicht, was, wahrscheinlich Wirtschaftsinformatik"}, {"id": 576, "start": 4053.44, "end": 4060.96, "text": "oder sowas. Nee, keine Ahnung. Es war bei euch nicht Teil von Mathe, sondern vom Algorithmus-Konkurs."}, {"id": 577, "start": 4060.96, "end": 4067.08, "text": "Ja Leute, jetzt sind sie mal wieder päpstlicher als der Papst, Alter, im Chat. Ist doch egal,"}, {"id": 578, "start": 4067.08, "end": 4092.36, "text": "das muss er auch durch. Ja, den hab ich auch schon gesehen. Den Proof of Concept für Folina."}, {"id": 579, "start": 4092.36, "end": 4101.24, "text": "Sprich man das eigentlich aus? Das müssen wir uns jetzt mal. Das ist ja was in Italien."}, {"id": 580, "start": 4101.24, "end": 4110.08, "text": "Jetzt hören wir mal, wer Folina ausspricht. Nein, so spricht das kein Italiener aus, definitiv"}, {"id": 581, "start": 4110.08, "end": 4126.92, "text": "nicht. Folina. Folina. Folina. Das hört sich deutlich Italienischer an. Folina heißt"}, {"id": 582, "start": 4126.92, "end": 4156.12, "text": "das. Sonst Chat durch. Das probier ich jetzt nicht aus. Ist eine äußerst, ich muss sagen,"}, {"id": 583, "start": 4156.12, "end": 4170.48, "text": "eine äußerst unglückliche Benahmung dieses Programms. Schon Amazon Stonks Aktie angeschaut?"}, {"id": 584, "start": 4170.48, "end": 4174.4, "text": "Oh, muss ich mal gucken. Gab's da heute Big Stonks? Also ich hab tatsächlich relativ"}, {"id": 585, "start": 4174.4, "end": 4181.84, "text": "viel gut Stonks gemacht. Die letzte Woche waren 850 Euro mehr oder so. Moment, mal kurz"}, {"id": 586, "start": 4181.84, "end": 4198.72, "text": "meine Amazon Stonks checken. Na ja. Oh, nee nicht? Na ja, Pog. Das ist ja geil. Das hab"}, {"id": 587, "start": 4198.72, "end": 4205.32, "text": "ich mir noch gar nicht angeguckt. Ich hab Amazon gekauft bei um die 2000 und jetzt ist"}, {"id": 588, "start": 4205.32, "end": 4215.12, "text": "es 2317. Also one week 377 Euro. Na dann. Massive Stonks. Jetzt verkaufe ich die einfach"}, {"id": 589, "start": 4215.12, "end": 4231.88, "text": "wieder. Da hab ich mir ein bisschen Kohle ausgemacht. Ja, also genau. Wenn schon Leute, dann macht"}, {"id": 590, "start": 4231.88, "end": 4236.6, "text": "so wie ich mit meinen Stonks, weil ich hab trotzdem, dass es die letzte Woche ziemlich"}, {"id": 591, "start": 4236.6, "end": 4246.32, "text": "gut war, hab ich in diesem Jahr minus 1000, nee stimmt nicht, minus 908 Euro und 67 Cent"}, {"id": 592, "start": 4246.32, "end": 4255.48, "text": "gemacht. Also beste, beste Stonks Beratung hier bei mir. Weil wenn ihr Geld verlieren"}, {"id": 593, "start": 4255.48, "end": 4262.04, "text": "wollt, dann macht es so wie ich. Worüber kaufst du? Ich hab Scalable als App. Kann ich gar"}, {"id": 594, "start": 4262.04, "end": 4269.12, "text": "nicht mehr sagen warum. Ich glaub, das würde öfters auf YouTube und öfters auf Reddit"}, {"id": 595, "start": 4269.12, "end": 4275.12, "text": "empfohlen. Eine Milliarde Bits? Dankeschön. Jetzt ist alles weg. Jetzt bin ich wieder"}, {"id": 596, "start": 4275.12, "end": 4287.24, "text": "reich. Alle Stonks Verluste ausgeglichen durch Twitch Bits. Polina könnten ohne Probleme"}, {"id": 597, "start": 4287.24, "end": 4293.12, "text": "irgendwelche Nudeln sein in irgendwie geschwungener Form oder so. Es gibt ja 30 Milliarden Nudelsorten."}, {"id": 598, "start": 4293.12, "end": 4305.84, "text": "Wolle, danke für den Sub. Übrigens danke für alle, die gestubbt haben, die ich übersehen"}, {"id": 599, "start": 4305.84, "end": 4313.32, "text": "hab. Schau mal kurz. Wolle hat gesagt, Battle Day Z, Dates. Danke schön für den Sub."}, {"id": 600, "start": 4313.32, "end": 4319.0, "text": "DasSteinAtler5 hat Subscribed. Danke schön. KioKun wieder am Start. Oder Samuel, ja euch"}, {"id": 601, "start": 4319.0, "end": 4322.76, "text": "hab ich schon gesehen. Gut, nice. So, ja gut Leute, dann gucken wir jetzt mal schnell"}, {"id": 602, "start": 4322.76, "end": 4327.0, "text": "mein Video und ich sag noch was zu, weil es haben sich in ein paar Kleinigkeiten jetzt"}, {"id": 603, "start": 4327.0, "end": 4336.56, "text": "noch ergeben. Achtung. Eigenen Content Recycle im Stream am gleichen Tag. Das ist Pog, so"}, {"id": 604, "start": 4336.56, "end": 4344.24, "text": "muss man das machen. Scale Capital, ja. Muss man da was beachten? Naja. Du brauchst einen"}, {"id": 605, "start": 4344.24, "end": 4348.64, "text": "gültigen Personalausweis, weil du Post-Ident machen musstest und ich hatte keinen zu dem"}, {"id": 606, "start": 4348.64, "end": 4354.12, "text": "Zeitpunkt. Muss mir vorübergehenden Personalausweis holen. Leute, das war auch, hab ich euch das"}, {"id": 607, "start": 4354.12, "end": 4361.32, "text": "erzählt mit dem Perso, was es für ein Act war? Alter, ich wollte nach Hanau mir einen"}, {"id": 608, "start": 4361.32, "end": 4364.96, "text": "Personalausweis holen, weil ich Post-Ident machen muss und die hatten irgendwie 6 Wochen"}, {"id": 609, "start": 4364.96, "end": 4376.72, "text": "keinen Termin. Und dann hab ich mir gedacht, ok, guckst du mal beim Bundesinnenministerium"}, {"id": 610, "start": 4376.72, "end": 4381.36, "text": "nach auf der Webseite, was die sagen, was man in besonders dringenden Fällen machen"}, {"id": 611, "start": 4381.36, "end": 4392.52, "text": "soll. Und da steht, in besonders dringenden Fällen kann jedes beliebige, ja, Niederlassungsbürger"}, {"id": 612, "start": 4392.52, "end": 4399.8, "text": "Amtsstelle dir einen temporären Personalausweis ausstellen. Jede. Das steht auf der Webseite"}, {"id": 613, "start": 4399.8, "end": 4406.12, "text": "vom Bundesinnenministerium. Also hab ich in der Nachbarschaft rumgeguckt, also in Nachbargemeinden"}, {"id": 614, "start": 4406.12, "end": 4413.52, "text": "und so rumgeguckt und da hab ich einen Stadtteil gefunden von Offenbach, also quasi bei Haftbefehl"}, {"id": 615, "start": 4413.52, "end": 4418.72, "text": "um die Ecke und hab da angerufen und hab gesagt, wie sieht es denn bei euch aus, ich"}, {"id": 616, "start": 4418.72, "end": 4424.52, "text": "bräuchte einen neuen Personalausweis, ganz dringend, weil Post-Ident und so und das ist"}, {"id": 617, "start": 4424.52, "end": 4432.08, "text": "eilig und ich muss da dran. Und kleines Problem ist aber, der Tipp könnte tatsächlich aus,"}, {"id": 618, "start": 4432.08, "end": 4435.36, "text": "nee, weiß ich nicht, ob dieser Tipp aus dem Chat gekommen ist, aber der Chat hat auf jeden"}, {"id": 619, "start": 4435.36, "end": 4439.08, "text": "Fall Fivehead-Ideen gehabt und da hab ich gesagt, das Problem ist nur, ich komm nicht"}, {"id": 620, "start": 4439.08, "end": 4443.24, "text": "aus ihrer Gemeinde, ich komm aus Hanau und da hat die dann gleich zu mir gesagt, nee,"}, {"id": 621, "start": 4443.24, "end": 4447.68, "text": "nee, das geht nicht und dann hab ich gesagt, Fivehead-Modus aktiviert und dann hab ich"}, {"id": 622, "start": 4447.68, "end": 4452.84, "text": "gesagt, doch, das geht in dringenden Fällen, das steht nämlich sogar auf der Seite vom"}, {"id": 623, "start": 4452.84, "end": 4458.28, "text": "Bundesinnenministerium und dann hat die gesagt, ach ja, ah ja, wenn das da steht, dann geht"}, {"id": 624, "start": 4458.28, "end": 4465.6, "text": "das. Ja, die hatte bloß keinen Bock, die wollte bloß nicht, die hatte bloß keinen Bock. Aber"}, {"id": 625, "start": 4465.6, "end": 4471.56, "text": "als ich ihr das dann quasi zitiert habe von, dann hat das funktioniert und die war auch"}, {"id": 626, "start": 4471.56, "end": 4480.88, "text": "wirklich sehr nett und sehr schnell. Tag später konnte ich den Gramm holen. Tja, der"}, {"id": 627, "start": 4480.88, "end": 4485.28, "text": "gilt aber nur drei Monate. Das heißt, ich müsste jetzt so langsam aber sicher mal wirklich"}, {"id": 628, "start": 4485.28, "end": 4496.44, "text": "nach Hanau einen Termin machen. Ja, das hab ich mal sogar auf Twitter gepostet, die Heckler"}, {"id": 629, "start": 4496.44, "end": 4502.56, "text": "und Kochakte ging ja auch übelst ab, die ganzen Rüstungsunternehmen, die haben halt"}, {"id": 630, "start": 4502.56, "end": 4510.2, "text": "richtig am Anfang richtig massive Stonks gemacht. Also ganz ehrlich, ich nehm dir das"}, {"id": 631, "start": 4510.2, "end": 4513.4, "text": "nicht böse, man muss gucken, wo man bleibt. Man kann sich nicht darauf verlassen, dass"}, {"id": 632, "start": 4513.4, "end": 4520.48, "text": "irgendjemand, weder den man wählt noch irgendjemand anderes, was in seinem eigenen Interesse macht,"}, {"id": 633, "start": 4520.48, "end": 4524.32, "text": "nachdem jeder gucken muss, woran er bleibt, warum nicht? Es ist ja nicht so, als würdest"}, {"id": 634, "start": 4524.32, "end": 4529.84, "text": "du damit irgendwie Kinder erschießen oder so. Zumindest nicht du persönlich. Was da"}, {"id": 635, "start": 4529.84, "end": 4552.48, "text": "mit den Sachen passiert, sei mal dahingestellt. Aha, das macht ihr da. Tja, gut, damit hab"}, {"id": 636, "start": 4552.48, "end": 4558.48, "text": "ich zum Glück nichts am Hut. Gab es heute schon überfüllte Züge, ich musste heute"}, {"id": 637, "start": 4558.48, "end": 4569.28, "text": "zum Glück nicht fahren. Ich bin zuletzt gefahren am Dienstag und da war außer 10 Minuten Verspätung"}, {"id": 638, "start": 4569.28, "end": 4574.0, "text": "mittags, das ist aber eigentlich schon, ja was heißt, da twitter ich schon gar nicht"}, {"id": 639, "start": 4574.0, "end": 4580.48, "text": "mehr drüber, wenn es einfach nur 10, 15 Minuten Verspätung sind, ohne was, war es relativ"}, {"id": 640, "start": 4580.48, "end": 4588.0, "text": "problemlos, ja. Bin aber mal gespannt, wie das wird nächste Woche. Na gut, okay, also"}, {"id": 641, "start": 4588.0, "end": 4591.24, "text": "gucken wir uns mal mein Video an, ich erzähle euch ein paar neue Sachen zu. Hallo Leute,"}, {"id": 642, "start": 4591.24, "end": 4597.12, "text": "hier ist der Max und haltet euch fest. Inception, Inception. Heute wird's wild. Übrigens, wisst"}, {"id": 643, "start": 4597.12, "end": 4600.76, "text": "ihr, wie ich das Video zuerst nennen wollte? Leute, ich hatte richtige Probleme, dieses"}, {"id": 644, "start": 4600.76, "end": 4609.2, "text": "Video hochzuladen. Das muss ich jetzt hier an der Stelle einfach nochmal kurz erzählen."}, {"id": 645, "start": 4609.2, "end": 4614.68, "text": "Und zwar, ich hatte mega Probleme, das Video hochzuladen. Ursprünglicher Titel dieses"}, {"id": 646, "start": 4614.68, "end": 4623.56, "text": "Videos war, wilde Sicherheitslücke in Word und Windows. Jeder ist betroffen und dieser"}, {"id": 647, "start": 4623.56, "end": 4629.76, "text": "Titel ging einfach nicht. Immer wurde das Video geplockt, also geplockt, halt entmonitarisiert."}, {"id": 648, "start": 4629.76, "end": 4636.08, "text": "So, und dann habe ich verschiedene Variationen ausprobiert mit dem Titel und das war der"}, {"id": 649, "start": 4636.08, "end": 4647.44, "text": "einzige Titel, den YouTube gefressen hat. So, also ohne Microsoft im Titel. Danach habe"}, {"id": 650, "start": 4647.44, "end": 4654.48, "text": "ich unten drunter in das Kommentarfeld versucht, die Links einzufügen zu diesen Blogartikeln,"}, {"id": 651, "start": 4654.48, "end": 4663.48, "text": "worüber ich rede im Video, Video wieder entmonitarisiert. So, danach habe ich einfach nur meine Social"}, {"id": 652, "start": 4663.48, "end": 4671.12, "text": "Media Links eingefügt, Video entmonitarisiert. So, und dann musste ich exakt diesen Text"}, {"id": 653, "start": 4671.12, "end": 4678.48, "text": "nehmen, ich habe das Video 5-6 mal hochgeladen insgesamt. Und dann musste ich genau diesen"}, {"id": 654, "start": 4678.48, "end": 4683.6, "text": "Text nehmen und ich durfte nicht schreiben, große Sicherheitslücke in Word und Windows,"}, {"id": 655, "start": 4683.6, "end": 4690.84, "text": "weil Word anscheinend ein super triggendes Wort ist, sondern ich musste aus Word Microsoft"}, {"id": 656, "start": 4690.84, "end": 4698.84, "text": "Word machen und dann wurde es monetarisiert. Warum? Man hat keine Ahnung. YouTube sagt"}, {"id": 657, "start": 4698.84, "end": 4707.92, "text": "einem das ja auch nicht, warum was entmonitarisiert wird. YouTube sagt einfach nur BAM, not suitable"}, {"id": 658, "start": 4707.92, "end": 4724.0, "text": "für irgendwie Advertisement, limited ads. Keine Ahnung. Nee, ich gehe auch nicht davon"}, {"id": 659, "start": 4724.0, "end": 4733.88, "text": "aus, dass die das wissen. Ja, du kannst bei YouTube dann eine Überprüfung beantragen,"}, {"id": 660, "start": 4733.88, "end": 4738.8, "text": "die dauert aber höchstwahrscheinlich eine ganze Weile und im Zweifelsfall landest du"}, {"id": 661, "start": 4738.8, "end": 4747.8, "text": "dann noch bei irgendeinem unwissenden Kacknoob, der dich fleckt für Hacker-Content. Also"}, {"id": 662, "start": 4747.8, "end": 4757.6, "text": "ich habe null Vertrauen in YouTube, was diese Abläufe angeht. Gar nichts, null. So, wir"}, {"id": 663, "start": 4757.6, "end": 4760.56, "text": "gucken uns trotzdem jetzt das Video an und ich sage noch ein paar Takte zu. Eine neue"}, {"id": 664, "start": 4760.56, "end": 4769.76, "text": "Sicherheitslücke in Word und in Windows. Ich gebe zu, das an sich ist jetzt weder wild"}, {"id": 665, "start": 4769.76, "end": 4773.12, "text": "noch sonderlich überraschend, das kommt ja nur öfters mal vor, aber ich verspreche"}, {"id": 666, "start": 4773.12, "end": 4779.0, "text": "euch diesmal wird es wirklich wild, denn es sind gleich mehrere Probleme, Word selber,"}, {"id": 667, "start": 4779.0, "end": 4785.12, "text": "aber auch Windows eigene Tools. Das geht am Ende so weit, dass jeder der Word nur installiert"}, {"id": 668, "start": 4785.12, "end": 4792.68, "text": "hat betroffen sein kann. Ja, was ich hier hätte dazu sagen sollen ist, potenziell"}, {"id": 669, "start": 4792.68, "end": 4797.56, "text": "jeder der Word installiert hat, ist von der Word-Problematik betroffen, aber jeder, deswegen"}, {"id": 670, "start": 4797.56, "end": 4802.04, "text": "habe ich jetzt auch einen Titel geschrieben, jeder Windows-Benutzer ist von der zweiten"}, {"id": 671, "start": 4802.04, "end": 4808.76, "text": "Hälfte dieses Problems betroffen. Als wäre das noch nicht genug, ist das Ganze"}, {"id": 672, "start": 4808.76, "end": 4813.44, "text": "auch noch ziemlich einfach auszunutzen und wird auch schon aktiv ausgenutzt. Gibt es"}, {"id": 673, "start": 4813.44, "end": 4818.56, "text": "mehrere Beispiele für, also das in der Kombination kommt doch relativ selten vor und übrigens"}, {"id": 674, "start": 4818.56, "end": 4822.08, "text": "der Windows-Defender hat auch seine Probleme damit das ganze festzustellen."}, {"id": 675, "start": 4822.08, "end": 4826.92, "text": "Und ja, das ist immer noch so, weil ein paar Leute in den Kommentaren geschrieben haben"}, {"id": 676, "start": 4826.92, "end": 4835.36, "text": "ja, der Windows-Defender würde das erkennen, wenn man sich die Paid-Lizenz von Microsoft"}, {"id": 677, "start": 4835.36, "end": 4842.0, "text": "dafür kauft. Naja, das erste ist, keiner hat diese Paid-Windows-Defender-Lizenz, also"}, {"id": 678, "start": 4842.0, "end": 4851.56, "text": "der Windows-Defender macht bei 99,9% der Windows-Benutzer nichts. Ist das eigentlich der Windows-11-Marketing-Trailer?"}, {"id": 679, "start": 4851.56, "end": 4860.32, "text": "Nee, der Windows-11-Trailer, den habe ich nachher aber auch noch drin. Und, was wollte"}, {"id": 680, "start": 4860.32, "end": 4862.92, "text": "ich jetzt sagen, ich darf nicht Chat lesen auf dem zweiten Bildschirm, das lenkt mich"}, {"id": 681, "start": 4862.92, "end": 4867.68, "text": "teilweise so ab, dass mein Boomer-Prain das nicht mehr mitmacht. Was habe ich gesagt"}, {"id": 682, "start": 4867.68, "end": 4877.08, "text": "gerade Chat, 11 mal auf die Sprünge, Boomer-Alarm, dass der Defender nichts dagegen macht, genau"}, {"id": 683, "start": 4877.08, "end": 4884.88, "text": "habe ich gesagt. Ja, und das 99% der Leute, die eben keine Cloud-Sache haben. Das nächste"}, {"id": 684, "start": 4884.88, "end": 4895.84, "text": "ist, selbst der Windows-Defender mit irgendwelchen Cloud-AI-Five-Hat-Geschichten dabei, erkennt"}, {"id": 685, "start": 4895.84, "end": 4902.32, "text": "das auch nicht richtig. Mittlerweile, wenn man die Ursprungs-Datei hoch lädt, ja, dann"}, {"id": 686, "start": 4902.32, "end": 4906.88, "text": "sieht man auch auf Virus-Total, das kann ich euch ja an der Stelle zeigen, das ist der"}, {"id": 687, "start": 4906.88, "end": 4912.16, "text": "ursprüngliche Twitter-Post, wo das angekündigt wurde, ja, und wenn man jetzt hier auf Virus-Total"}, {"id": 688, "start": 4912.16, "end": 4920.72, "text": "geht, 38 von 62 erkennen diesen Kram mittlerweile zum größten Teil irgendwie als Generic und"}, {"id": 689, "start": 4920.72, "end": 4935.84, "text": "hier als Word-Fail, erkennen das Ding als Virus, aber das ist die ursprüngliche Datei,"}, {"id": 690, "start": 4935.84, "end": 4942.32, "text": "und wenn man das, dass sie den GitHub-Proof-of-Concept erkennen, wundert mich auch nicht, aber du"}, {"id": 691, "start": 4942.32, "end": 4948.36, "text": "kannst halt hier relativ easy variieren, ja, allein schon das Encoding, wenn du das änderst,"}, {"id": 692, "start": 4948.36, "end": 4955.04, "text": "sieht das komplett anders aus danach, und ich gehe mal davon aus, dass die mittlerweile"}, {"id": 693, "start": 4955.04, "end": 4962.56, "text": "schon checken, sind dort irgendwelche Aufrufe drin, MS, MSDT, aber das kannst du ja beliebig"}, {"id": 694, "start": 4962.56, "end": 4969.8, "text": "obfoscaden, und ich gehe davon aus, wenn man das geschickt macht, dann wird das kein Virenscanner"}, {"id": 695, "start": 4969.8, "end": 4978.2, "text": "wirklich stichhaltig erkennen. Was ist die MP6-Stub-Axe, ich hab keine Ahnung, ich versuche,"}, {"id": 696, "start": 4978.2, "end": 4988.16, "text": "ich denke mal irgendwas für Signaturen oder so, ich weiß es nicht. Wobei man sagen muss,"}, {"id": 697, "start": 4988.16, "end": 4994.92, "text": "das hier ist ja auch der ursprüngliche russische oder weißrussische Code, die versuchen da"}, {"id": 698, "start": 4994.92, "end": 5001.32, "text": "auch Gerafiles zu entpacken drin, vielleicht hat es damit was zu tun, keine Ahnung wofür"}, {"id": 699, "start": 5001.32, "end": 5012.48, "text": "das in dem Fall da ist. Wichtig an der Stelle ist übrigens, dass MSDST aufgerufen wird"}, {"id": 700, "start": 5012.48, "end": 5022.88, "text": "mit IT-Browse-for-File oder IT-Run, nee IT-Rebrowse-for-File, das ist wichtig, weil ansonsten"}, {"id": 701, "start": 5022.88, "end": 5029.04, "text": "sieht man ein Popup, und Popups machen die Leute ja erst mal skeptisch, und wenn man"}, {"id": 702, "start": 5029.04, "end": 5033.72, "text": "das angibt, gibt es noch nicht mal ein Popup. Muss ich mal überlegen, was für ein Abfakt"}, {"id": 703, "start": 5033.72, "end": 5040.64, "text": "das eigentlich ist, dass du Word-Vorlagen überhaupt mit Embedded JavaScript ausführen kannst,"}, {"id": 704, "start": 5040.64, "end": 5046.28, "text": "der dann im Word-Kontext läuft und sich weitere Dinger runter, das ist doch total hängengebliebener"}, {"id": 705, "start": 5046.28, "end": 5052.0, "text": "Müll, ja. Also wer sich bei Microsoft denkt, das ist eine gute Idee, verstehe ich nicht."}, {"id": 706, "start": 5052.0, "end": 5060.44, "text": "Äh, wo ist denn, wait a minute, Leute wo ist mein Video hin, da, wer auf Nummer sicher"}, {"id": 707, "start": 5060.44, "end": 5064.84, "text": "gegangen ist in der Vergangenheit und seine Makros in Word... Moment, ganz kurz war es"}, {"id": 708, "start": 5064.84, "end": 5068.84, "text": "im Chat noch ziemlich ein Problem beim Abspiel von Videos in VMWare Pro, hast du eine Idee"}, {"id": 709, "start": 5068.84, "end": 5074.12, "text": "woran das liegt? Ja, weil du in der VM kein Hardware-Video-Decoder hast, also da ist hohe"}, {"id": 710, "start": 5074.12, "end": 5079.84, "text": "CPU-Last normal, wenn du versuchst dort 1080p plus Videos abzuspielen, teilweise schon mal"}, {"id": 711, "start": 5079.84, "end": 5085.2, "text": "720p Videos, je nachdem wie stark dein Rechner ist, dann ruckelst, weil du keinen Hardware-Decoder"}, {"id": 712, "start": 5085.2, "end": 5090.56, "text": "hast, weil alles komplett von der CPU decodet werden muss. Das habe ich auch, wenn ich in"}, {"id": 713, "start": 5090.56, "end": 5096.8, "text": "meine VM gehe und mache jetzt hier mal mein Video auf, ja, nehmen wir mal irgendwas mit"}, {"id": 714, "start": 5096.8, "end": 5103.76, "text": "ein bisschen Bewegung drin, ich gehe mal hier mal rein, oh die muss ich mal neu starten,"}, {"id": 715, "start": 5103.76, "end": 5110.36, "text": "die ist ziemlich lahm. Nehmen wir mal hier irgendwie das da zum Beispiel, und ich stelle"}, {"id": 716, "start": 5110.36, "end": 5117.04, "text": "das Ganze jetzt tatsächlich mal auf 1440p, dann gucken wir mal Hardtop an, da siehst"}, {"id": 717, "start": 5117.04, "end": 5124.6, "text": "du Firefox, Moment, ja, wenn ich ihn aufmache noch mehr, da siehst du mal, also es ist ordentlich,"}, {"id": 718, "start": 5124.6, "end": 5131.08, "text": "ordentlich, guck mal, also es sind 4 CPU-Kerne jeweils zu einem Viertel ausgelassen, schon"}, {"id": 719, "start": 5131.08, "end": 5142.24, "text": "ordentlich, also das ist normal, dass du da hohe CPU-Auslastung hast. Leider, es gibt"}, {"id": 720, "start": 5142.24, "end": 5148.36, "text": "keine Möglichkeit den Hardware-Decoder zu verwenden, es sei denn, du benutzt was anderes"}, {"id": 721, "start": 5148.36, "end": 5162.68, "text": "und machst dann GPU-Pass-Through, aber da hast du komplett andere Probleme wieder. Nö,"}, {"id": 722, "start": 5162.68, "end": 5169.56, "text": "das ist ganz normal, das kann man scheinbar nicht. Achso, ja, dann, dann weiß ich auch"}, {"id": 723, "start": 5169.56, "end": 5173.32, "text": "nicht, wenn du es gar nicht sehen kannst. Da braucht man auch normalerweise nichts zusätzlich"}, {"id": 724, "start": 5173.32, "end": 5177.56, "text": "installieren, weil das alles im Browser dabei ist. Ne, dann weiß ich es auch nicht, wenn"}, {"id": 725, "start": 5177.56, "end": 5184.04, "text": "du es nicht abspielen kannst, keine Ahnung. Ja, guck mal die CPU-Auslastung an, ansonsten"}, {"id": 726, "start": 5184.04, "end": 5194.08, "text": "weiß ich es nicht. GPU-Pass-Through geht überhaupt nicht ohne Probleme, also ja, GPU-Pass-Through"}, {"id": 727, "start": 5194.08, "end": 5201.88, "text": "geht ohne Probleme, aber das was daraus resultiert, die Probleme gibt es immer noch. Ja, zum"}, {"id": 728, "start": 5201.88, "end": 5207.8, "text": "Beispiel, dass du dann erst einmal die Grafikkarte nicht im Hausbetriebssystem hast, wenn du"}, {"id": 729, "start": 5207.8, "end": 5211.4, "text": "GPU-Pass-Through gemacht hast. Das heißt, wie guckst du dir dann dein Hausbetriebssystem"}, {"id": 730, "start": 5211.4, "end": 5215.12, "text": "an? Ich weiß, du kannst dann wieder sowas wie Looking Class machen und dann doch noch"}, {"id": 731, "start": 5215.12, "end": 5219.72, "text": "ein bisschen weniger Delay haben, du kannst mit Virtual GL rum, jaja, aber das sind im"}, {"id": 732, "start": 5219.72, "end": 5223.6, "text": "Prinzip alles was ich meine, du hast dann andere Probleme. Dann musst du gucken wie"}, {"id": 733, "start": 5223.6, "end": 5229.88, "text": "du deine Maus Pass-Throughs, also du kannst zwei GPUs kannst du auch machen, ja klar,"}, {"id": 734, "start": 5229.88, "end": 5246.04, "text": "vielleicht machst du komplett USB-Root-Dings Pass-Through, also du hast dann andere Probleme,"}, {"id": 735, "start": 5246.04, "end": 5257.88, "text": "die du lösen musst, dass das funktioniert. Ich weiß, dass du USB-Geräte Pass-Through-kannst,"}, {"id": 736, "start": 5257.88, "end": 5263.8, "text": "also sobald du USB-Geräte Pass-Throughs, kannst du sie nicht mehr auf dem Host verwenden,"}, {"id": 737, "start": 5263.8, "end": 5271.04, "text": "das heißt du brauchst dann theoretisch zwei Mäuse und zwei Monitore und vielleicht, vielleicht"}, {"id": 738, "start": 5271.04, "end": 5279.36, "text": "sogar zwei GPUs, was du natürlich am Ende nicht wirklich brauchst, sondern du kannst"}, {"id": 739, "start": 5279.36, "end": 5284.04, "text": "dann sowas wie mit Looking Class tricksen, dass du sagst, ok, ich nehme minimalen Lack"}, {"id": 740, "start": 5284.04, "end": 5288.04, "text": "im Kauf, dass ich das dann aber alles über den Host machen kann, du hast dann einfach"}, {"id": 741, "start": 5288.04, "end": 5291.76, "text": "andere Probleme und das ist das was ich meine, das ist cool, dass das geht, du hast dann"}, {"id": 742, "start": 5291.76, "end": 5297.28, "text": "einfach andere Probleme, die du lösen musst. Es gibt für fast alles irgendwelche Lösungen,"}, {"id": 743, "start": 5297.28, "end": 5303.08, "text": "mal mehr, mal weniger gefrickelt. So, jetzt gucken wir jetzt aber endlich mal, jetzt wird"}, {"id": 744, "start": 5303.08, "end": 5310.12, "text": "das ja heute gar nichts mehr. Ein falsches, falsches Video. Komplett ausgeschaltet hat,"}, {"id": 745, "start": 5310.12, "end": 5316.64, "text": "klingt alles nix, schützt euch nicht davor. Ausnutzen lässt sich das Ganze aktuell wohl"}, {"id": 746, "start": 5316.64, "end": 5323.72, "text": "in einer breiten Anzahl an Office-Versionen von Office 2013 bis 2016, 2019, übrigens"}, {"id": 747, "start": 5323.72, "end": 5326.64, "text": "für alle die es immer noch nicht mitbekommen haben, das heißt eigentlich gar nicht mehr"}, {"id": 748, "start": 5326.64, "end": 5332.76, "text": "Office 365, sondern mittlerweile heißt es Windows 365, falls Sie es nicht schon wieder"}, {"id": 749, "start": 5332.76, "end": 5344.72, "text": "umbenannt haben. Ernsthaft? Ne, oder? Doch. Microsoft ist sich selber nicht so ganz einig"}, {"id": 750, "start": 5344.72, "end": 5355.92, "text": "wie der Campbell heißt. Ach du Scheiße, Microsoft und Benahmung. Ja, aber Office 365 heißt eigentlich"}, {"id": 751, "start": 5355.92, "end": 5361.44, "text": "Windows 365 mittlerweile. Der Name ist lächerlich, ich meine, warum heißt das Office?"}, {"id": 752, "start": 5361.44, "end": 5374.68, "text": "Man weiß auch nicht, heißt es Microsoft 365, heißt es Windows 365, Microsoft und Benahmung."}, {"id": 753, "start": 5374.68, "end": 5381.64, "text": "Dass es das überhaupt gibt, dann Office Pro Plus und natürlich auch und das ist wahrscheinlich"}, {"id": 754, "start": 5381.64, "end": 5386.76, "text": "das Wichtigste, Office 365 und das ist jetzt eine Anmerkung von mir, was ich jetzt dazu"}, {"id": 755, "start": 5386.76, "end": 5394.8, "text": "sage, das steht nicht in den offiziellen Analysedokumenten drin, wer Office 365 nur im Browser benutzt,"}, {"id": 756, "start": 5394.8, "end": 5399.28, "text": "der müsste wahrscheinlich safe sein. Es geht darum, wenn ihr das auf eurem Windows Rechner"}, {"id": 757, "start": 5399.28, "end": 5405.84, "text": "verwendet. Ja, also was ist los? Übrigens, wo wir gerade dabei sind, ich komme aktuell"}, {"id": 758, "start": 5405.84, "end": 5411.04, "text": "leider wenig dazu, so viele Videos rauszuhauen, wie ich gerne möchte. Ja, das ist tatsächlich"}, {"id": 759, "start": 5411.04, "end": 5417.8, "text": "leider so, ich würde lieber mehr Videos machen als so wenige, aber dafür muss ich sagen,"}, {"id": 760, "start": 5417.8, "end": 5424.0, "text": "eine Sache, die mich wirklich freut, ist, das aktuelle Video kommt auch relativ gut"}, {"id": 761, "start": 5424.0, "end": 5431.44, "text": "an und das letzte Video kam wirklich gut an. Also gerade für so ein Thema sind 65.000"}, {"id": 762, "start": 5431.44, "end": 5442.48, "text": "Views wirklich nicht übel und auch eine richtig viele Anzahl an Comments. Comments wäre nicht"}, {"id": 763, "start": 5442.48, "end": 5449.44, "text": "so ausführlich vom Text her, da würde dann drin stehen Plupfix 1 oder sowas. Und ansonsten"}, {"id": 764, "start": 5449.44, "end": 5454.44, "text": "insgesamt muss ich wirklich sagen, Chat, ich kann mich echt nicht beschweren. Ich mache"}, {"id": 765, "start": 5454.44, "end": 5467.2, "text": "diesen Krempel auf YouTube jetzt seit 12 Jahren fast, nicht ganz, aber seit 2010 und ich denke,"}, {"id": 766, "start": 5467.2, "end": 5474.72, "text": "das können nicht viele Leute von sich behaupten, dass sie 12 Jahre auf YouTube sind und im"}, {"id": 767, "start": 5474.72, "end": 5487.2, "text": "aktuellen Jahr, quasi wenn man sich die Videos anguckt, immer noch Views haben, die, ja nicht,"}, {"id": 768, "start": 5487.2, "end": 5491.76, "text": "das kann man schlecht vergleichen. Ich meine, ich habe damals Videos rausgehauen, 5 Minuten"}, {"id": 769, "start": 5491.76, "end": 5496.16, "text": "am Call of Duty Gameplay gemacht und hatte teilweise 60.000 Views am zweiten Tag. So"}, {"id": 770, "start": 5496.16, "end": 5501.2, "text": "ist es nicht, aber die YouTube Welt hat sich geändert. Aber wenn man das mal im Verhältnis"}, {"id": 771, "start": 5501.2, "end": 5508.72, "text": "sich anguckt, nach 12 Jahren YouTube bekommen meine Videos immer noch ähnlich viele Aufrufe"}, {"id": 772, "start": 5508.72, "end": 5514.32, "text": "wie damals zum Call of Duty Hype und ich denke, das können wirklich nicht viele Leute sagen,"}, {"id": 773, "start": 5514.32, "end": 5520.6, "text": "dass sie nach 12 Jahren immer noch die Leute auf YouTube erreichen können und das mit"}, {"id": 774, "start": 5520.6, "end": 5529.92, "text": "teilweise komplett anderem Zeug als damals. Da bin ich wirklich froh drum, dass das so"}, {"id": 775, "start": 5529.92, "end": 5536.92, "text": "gut geklappt hat oder dass das so gut funktioniert. Und was mich auch wieder daran bestätigt,"}, {"id": 776, "start": 5536.92, "end": 5546.36, "text": "dass ich eine wirklich besondere Zuschauergruppe habe, also damit seid jetzt natürlich auch"}, {"id": 777, "start": 5546.36, "end": 5551.64, "text": "indirekt, ist der Chat gemeint und zwar, das kannst du aber auch erst haben, wenn du eine"}, {"id": 778, "start": 5551.64, "end": 5556.36, "text": "Weile auf YouTube dabei bist und zwar die Leute, die mich damals geguckt haben und ich"}, {"id": 779, "start": 5556.36, "end": 5564.08, "text": "weiß das aus dem Chat, weil da sind öfters mal welche, die genau das schreiben. Die Leute"}, {"id": 780, "start": 5564.08, "end": 5569.68, "text": "waren damals zwölf, dreizehn, vierzehn, fünfzehnjährige Call of Duty Kinder. Jetzt"}, {"id": 781, "start": 5569.68, "end": 5574.4, "text": "ohne das abwertend zu meinen, aber ihr wisst, was ich meine, da sind die Leute, die damals"}, {"id": 782, "start": 5574.4, "end": 5580.8, "text": "in die Kommentare gegangen sind und haben dann reingeschrieben, ah Max, du kack Spaß,"}, {"id": 783, "start": 5580.8, "end": 5592.52, "text": "du spielst Xbox, fuck Vixbox, Playstation 3 for life. Ja, okay, so Leute waren das und"}, {"id": 784, "start": 5592.52, "end": 5599.92, "text": "die sind heute noch da, zwar natürlich nicht alle, aber zum Gehirn, das war mir klar,"}, {"id": 785, "start": 5599.92, "end": 5605.66, "text": "also du bist der Erste, der mich das zugetraut hätte, sowas. Zumindest, die Leute sind heute"}, {"id": 786, "start": 5605.66, "end": 5615.64, "text": "immer noch da, aber das Geile ist, die Leute sind mit mir quasi gewachsen oder mit mir"}, {"id": 787, "start": 5615.64, "end": 5621.64, "text": "älter geworden, also sprich, ich war damals paarundzwanzig, jetzt bin ich siebenunddreißig"}, {"id": 788, "start": 5621.64, "end": 5634.76, "text": "und die anderen Leute, die sind heute zwischen 22 und 27. Das ist halt krass, oder? Das haben"}, {"id": 789, "start": 5634.76, "end": 5641.84, "text": "nicht viele auf YouTube, wirklich nicht. Nicht nur ihr seid alt geworden, ich auch. Geht"}, {"id": 790, "start": 5641.84, "end": 5648.32, "text": "zwischen 21 und 27 und viele tatsächlich mittlerweile auch in der IT. Ich mein, was mich ja wirklich"}, {"id": 791, "start": 5648.32, "end": 5653.92, "text": "freut ist, ich muss sagen, ich hab die Videos damals nicht mit dem Hinblick darauf gemacht,"}, {"id": 792, "start": 5653.92, "end": 5657.72, "text": "weil ich mir dachte, es interessiert eh keinen, aber anscheinend hat es doch jemand interessiert."}, {"id": 793, "start": 5657.72, "end": 5663.72, "text": "Ich hab mir damals schon viele Videos gemacht über Fachinformatiker-Ausbildung, über Beruf"}, {"id": 794, "start": 5663.72, "end": 5670.04, "text": "an sich und sowas. Wir haben jetzt schon viele Leute hier im Twitch-Chat gesagt, als auch"}, {"id": 795, "start": 5670.04, "end": 5676.32, "text": "in den YouTube-Kommentaren gesagt, dass sie nur deswegen, weil ich sie da mal drauf gebracht"}, {"id": 796, "start": 5676.32, "end": 5681.44, "text": "hab, letztendlich das dann auch sich angeguckt haben und deswegen auch machen. Das ist halt"}, {"id": 797, "start": 5681.44, "end": 5686.28, "text": "wirklich was, da gibt es wirklich nicht viele, die das sagen können, weil das ist ja, das"}, {"id": 798, "start": 5686.28, "end": 5690.68, "text": "ist jetzt nicht irgendeinen Schwachsinnseinfluss auf die Leute, sondern es ist tatsächlich,"}, {"id": 799, "start": 5690.68, "end": 5699.16, "text": "man hat da tatsächlich, man hat irgendwie auch noch was Gutes bewirkt, ja. Das hätte"}, {"id": 800, "start": 5699.16, "end": 5716.72, "text": "ich damals nicht gedacht. Sieht man eigentlich so, ich seh das manchmal, weil ich noch E-Mail-Benachrichtigungen"}, {"id": 801, "start": 5716.72, "end": 5723.88, "text": "von damals habe auf Google-Mail. Du selbst, weiß ich nicht, doch man selbst kann das bestimmt"}, {"id": 802, "start": 5723.88, "end": 5735.88, "text": "auch irgendwie sehen. Nö, hab ich nicht. So, aber jetzt müssen wir das endlich. Du hast"}, {"id": 803, "start": 5735.88, "end": 5740.76, "text": "die Zusage für die, äh, ich erinnere mich, du hast letztens was geschrieben im Chat. Jaja."}, {"id": 804, "start": 5740.76, "end": 5745.96, "text": "Äh, Moment, Leute, ich mach jetzt mal Pfeiffer-Time, ich kann doch nachgucken, was die Leute zuletzt"}, {"id": 805, "start": 5745.96, "end": 5752.8, "text": "im Chat geschrieben haben. Da muss ich mich gar nicht dran erinnern. Massive. Also, deine"}, {"id": 806, "start": 5752.8, "end": 5759.36, "text": "letzte Chat-Nachricht für heute, Tommy, war Betge. Beste Chat-Nachricht überhaupt. Betge"}, {"id": 807, "start": 5759.36, "end": 5772.72, "text": "ist in 13 Minuten auch angesagt. Passt. Also, eine zeitlose Chat-Nachricht, Betge. Ach ja,"}, {"id": 808, "start": 5772.72, "end": 5777.72, "text": "jetzt weiß ich's wieder. Du hast geschrieben mit dem Third-Level-Support. Jaja, okay, jetzt"}, {"id": 809, "start": 5777.72, "end": 5783.04, "text": "erinnere ich mich wieder. Und dass du dich beworben hast. Ja, freut mich, dass das geklappt"}, {"id": 810, "start": 5783.04, "end": 5789.84, "text": "hat. Jetzt hoffen wir, dass es auch gut läuft. Gläserne Viewer. Jaja, hier ist nichts. Leute,"}, {"id": 811, "start": 5789.84, "end": 5793.8, "text": "nicht dass ihr denkt, im Zweifelsfall kann ich nachgucken. Und noch schlimmer, wisst"}, {"id": 812, "start": 5793.8, "end": 5798.44, "text": "ihr was noch schlimmer ist? Muss mir der Serious Max mal sagen, ob das stimmt. Die Mods können"}, {"id": 813, "start": 5798.44, "end": 5806.28, "text": "das auch sehen. Also, wenn irgendjemand sagt, warum wurde ich gebannt mit meinem anderen"}, {"id": 814, "start": 5806.28, "end": 5817.24, "text": "Account? Ich hab doch nie was Schlimmes gesagt. Da guckt einfach irgendein Mod rein. Und höchstwahrscheinlich"}, {"id": 815, "start": 5817.24, "end": 5823.72, "text": "habt ihr irgendwas Schlimmes gesagt. Oder irgendwas. Ich hab ja teilweise auch schon"}, {"id": 816, "start": 5823.72, "end": 5828.72, "text": "Leute gebannt, weil sie mich einfach so sehr abgefuckt haben. Ich banne meist... Ich temp-banne"}, {"id": 817, "start": 5828.72, "end": 5833.68, "text": "eigentlich nur Leute. Ich hab ganz selten wirklich Leute richtig gebannt. Also meistens"}, {"id": 818, "start": 5833.68, "end": 5841.28, "text": "temp-banne ich nur Leute. Und ich gebe zu, ich hab auch schon Leute temp-bannt... Ach"}, {"id": 819, "start": 5841.28, "end": 5845.36, "text": "ja, Chainloids, wo du da bist, ich muss mal kurz auf deine Nachrichten klicken. Du hast"}, {"id": 820, "start": 5845.36, "end": 5851.24, "text": "insgesamt schon... Alter! Der Chainloy ist der Ober-Spammer, man! Wie viel der schon"}, {"id": 821, "start": 5851.24, "end": 5867.88, "text": "gepostet hat. Das ist so viel, das passt da gar nicht rein. Ähm, tja. Ja, ich temp-banne"}, {"id": 822, "start": 5867.88, "end": 5873.36, "text": "in der Regel eigentlich nur Leute. Und ich gebe zu, ich hab auch schon Leute echt mal"}, {"id": 823, "start": 5873.36, "end": 5881.04, "text": "im Affekt temp-bannt. Und eine Sache, was mich immer hart triggert, wenn ich irgendwas"}, {"id": 824, "start": 5881.04, "end": 5884.88, "text": "nicht hinbekomme, sei es wenn mir irgendwas programmieren oder irgendwas konfiguriert"}, {"id": 825, "start": 5884.88, "end": 5890.0, "text": "wird oder irgendwas nicht will oder beim Löten was nicht klappt. Keine Ahnung. Wenn was ist"}, {"id": 826, "start": 5890.0, "end": 5894.36, "text": "und die Leute fangen so ultra krass an zu backseaten. So nach dem Motto, ja, probier"}, {"id": 827, "start": 5894.36, "end": 5900.16, "text": "mal das aus, ja, guck dir mal das, hast du den Link schon gesehen? Und in der Regel,"}, {"id": 828, "start": 5900.16, "end": 5904.6, "text": "ist es so, meistens kenn ich das schon, ja. Die Leute kommen dann ins Stream rein, wissen"}, {"id": 829, "start": 5904.6, "end": 5909.48, "text": "nicht was die letzte Stunde war und schreiben dann so nach dem Motto, ja, mach doch mal"}, {"id": 830, "start": 5909.48, "end": 5912.52, "text": "das, hast du das schon ausprobiert, jetzt mach doch mal endlich hier. Da flippe ich"}, {"id": 831, "start": 5912.52, "end": 5916.2, "text": "immer aus bei, da hab ich auch schon Leute temp-bannt, weil es mir auf den Keks gegangen"}, {"id": 832, "start": 5916.2, "end": 5935.24, "text": "ist. Also das ist, ähm, warst du früher Admin auf dem Teamspeak? Nee. Ja, könnte man"}, {"id": 833, "start": 5935.24, "end": 5939.84, "text": "so sagen. Die Leute haben aber auch teilweise schon richtig krass genervt, also. Ich war"}, {"id": 834, "start": 5939.84, "end": 5944.68, "text": "weder Teamspeak-Mod noch Reddit-Mod. Ich hab aber gehört, ganz ehrlich, dass, äh, wenn"}, {"id": 835, "start": 5944.68, "end": 5951.16, "text": "man mal so eine Mod-Tierlist machen würde, hab ich gehört, dass Discord-Mods wohl die"}, {"id": 836, "start": 5951.16, "end": 5958.24, "text": "schlimmsten sein sollen. Also nicht Discord-Mods bei mir und auch nicht Discord-Mods von meinen"}, {"id": 837, "start": 5958.24, "end": 5963.88, "text": "Mods, die einfach jetzt zufälligerweise auch Mods im Discord sind. Ähm, aber so, wenn"}, {"id": 838, "start": 5963.88, "end": 5970.12, "text": "man so ein Mod-Tier-Ranking machen würde, wären wahrscheinlich Discord-Mods die schlimmsten."}, {"id": 839, "start": 5970.12, "end": 5980.96, "text": "Wahrscheinlich, wahrscheinlich dicht gefolgt von Reddit-Mods, ja. Reddit-Mods sind auch"}, {"id": 840, "start": 5980.96, "end": 5991.2, "text": "so. 4chan-Mods, da krieg ich wenig moderiertes mit. Ich bin aber auch schon lange kein regelmäßiger"}, {"id": 841, "start": 5991.2, "end": 6000.44, "text": "4chan-Leser mehr. Und auch kein 8chan-Leser und was es nicht alles gibt. Das hab ich vor"}, {"id": 842, "start": 6000.44, "end": 6016.32, "text": "langer Zeit, also bestimmt seit 2012, 2013, ja, lese ich das nicht mehr aktiv. Ja gut,"}, {"id": 843, "start": 6016.32, "end": 6022.52, "text": "die haben ja auch einiges zu tun. Also als Zoomer müsstest du wissen, was 4chan ist."}, {"id": 844, "start": 6022.52, "end": 6030.96, "text": "Bestimmt, es sind auch Leute auf Program und sowas noch. Also gerade Zoomer müssten doch"}, {"id": 845, "start": 6030.96, "end": 6036.92, "text": "eigentlich wissen, was 4chan ist, oder? Und wenn du Anime-Schauender-Zoomer bist, dann"}, {"id": 846, "start": 6036.92, "end": 6046.8, "text": "hast du recht. So, jetzt mal endlich mal fertig. Guck mal, es wird nichts mehr hier, Leute,"}, {"id": 847, "start": 6046.8, "end": 6052.84, "text": "heute. Also, jetzt widmen wir uns mal der aktuellen Office-Sicherheitslücke, weil es gibt tatsächlich"}, {"id": 848, "start": 6052.84, "end": 6059.24, "text": "noch ein paar Sachen, die ich dazu sagen wollte. Ihr könnt mich übrigens abonnieren, wenn"}, {"id": 849, "start": 6059.24, "end": 6065.0, "text": "euch der Content gefällt. Wer auch nicht hat, ne? Also, by the way, Sub-Abo-Falle. Wir haben"}, {"id": 850, "start": 6065.0, "end": 6068.48, "text": "vor allem auch im YouTube-Algorithmus, und das ist natürlich heutzutage unglaublich"}, {"id": 851, "start": 6068.48, "end": 6074.44, "text": "wichtig. Und da solche Themen immer komplexer sind, als es auf den ersten Blick erscheint"}, {"id": 852, "start": 6074.44, "end": 6078.6, "text": "oder auf den ersten Blick wirkt, hab ich euch auch unten nochmal die ganzen Seiten verlinkt,"}, {"id": 853, "start": 6078.6, "end": 6080.8, "text": "auf denen ich... Ja, das hab ich versucht, aber YouTube hat"}, {"id": 854, "start": 6080.8, "end": 6084.0, "text": "mich nicht gelassen. Leider sind Word-Dokumente auch heutzutage immer"}, {"id": 855, "start": 6084.0, "end": 6089.28, "text": "noch eine beliebte Form des Datenaustauschs. Ich frag mich gerade an der Stelle, ob sie"}, {"id": 856, "start": 6089.28, "end": 6093.8, "text": "bei uns auf der Arbeit den Kram per Gruppenrichtlinie deaktiviert haben oder so. Ansonsten wird's"}, {"id": 857, "start": 6093.8, "end": 6096.84, "text": "wahrscheinlich am Morgen lustig. Zum Glück hab ich hier wenigstens nichts zu tun."}, {"id": 858, "start": 6096.84, "end": 6101.32, "text": "Es stoms auch privat. Die Leute schicken sich gerne Doc-Files rum, obwohl es viel bessere"}, {"id": 859, "start": 6101.32, "end": 6106.2, "text": "Alternativen gibt. Ja, einfach online auf ne Seite oder im Zweifelsfall ein PDF gemacht."}, {"id": 860, "start": 6106.2, "end": 6111.92, "text": "Aber nein, die Leute schicken sich gerne Doc-Files rum. Aber diesmal betrifft es nicht nur Doc-Files."}, {"id": 861, "start": 6111.92, "end": 6122.92, "text": "Gute Frage. Face... Face? Oh, ich kann dich nicht aussprechen. Ich kann dich nicht aussprechen."}, {"id": 862, "start": 6122.92, "end": 6129.36, "text": "Ich kann dich nicht aussprechen. Phasero... Son... Keine Ahnung. Oder soll man das überhaupt"}, {"id": 863, "start": 6129.36, "end": 6140.8, "text": "als A aussprechen? Phar... Pharazon? Ja, aber um auf deine Frage einzugehen. Max, hatte"}, {"id": 864, "start": 6140.8, "end": 6145.32, "text": "deine Firma schon mal Hacker-Man-Angriffe, wo was passiert ist? Ja, hatten wir schon."}, {"id": 865, "start": 6145.32, "end": 6151.92, "text": "Und zwar die dümmsten der dummen Angriffe. Und zwar, irgendjemand hat es geschafft, einem"}, {"id": 866, "start": 6151.92, "end": 6160.44, "text": "ungesicherten Windows-Server... Ne, muss ich anders anfangen. Einen Windows-SFTP-Server"}, {"id": 867, "start": 6160.44, "end": 6168.92, "text": "muss man sich mal auf der Zunge zergehen lassen, dass es sowas überhaupt gibt. Einen Windows-SFTP-Server"}, {"id": 868, "start": 6168.92, "end": 6175.84, "text": "ungesichert mit alter Windows-Version ins Internet zu hängen. So. Und das haben irgendwelche"}, {"id": 869, "start": 6175.84, "end": 6183.4, "text": "Hacker-Mans rausbekommen. Und daraufhin... Ja, ging es dann weiter. Im Detail erzähle"}, {"id": 870, "start": 6183.4, "end": 6194.68, "text": "ich es jetzt nicht. Oh no no, ja. Das war auch so was ganz Spezielles. So, weiter. Kommen"}, {"id": 871, "start": 6194.68, "end": 6198.6, "text": "wir aber am Schluss vom Video zu. Ich muss erst ein bisschen ausholen, um was es eigentlich"}, {"id": 872, "start": 6198.6, "end": 6202.52, "text": "geht. Also, wir gucken uns jetzt mal grob an, um was geht es bei der ganzen Geschichte."}, {"id": 873, "start": 6202.52, "end": 6206.32, "text": "Und, ja, dann natürlich auch, was kann man denn... Ja, Major Lazer, da bist du schon lange"}, {"id": 874, "start": 6206.32, "end": 6212.6, "text": "dabei. Ja, das habe ich euch ja gerade schon gezeigt. Ja, das habe ich euch ja gerade schon"}, {"id": 875, "start": 6212.6, "end": 6220.68, "text": "gezeigt. Denke ich mal, nennt ein Word-Dokument entdeckt, das von einer IP-Ausweis Russland"}, {"id": 876, "start": 6220.68, "end": 6225.48, "text": "oder Belarus, sollten wir glaube ich heutzutage eher sagen, raufgeladen wurde. Was haben"}, {"id": 877, "start": 6225.48, "end": 6232.4, "text": "die bei Virus... Was ist da? Was hat es eigentlich... Ich meine, es kann doch nicht sein, dass"}, {"id": 878, "start": 6232.4, "end": 6240.04, "text": "die gesamte RKM-Geschichte in letzter Zeit entweder China-Chinesen oder Russen sind."}, {"id": 879, "start": 6240.04, "end": 6250.04, "text": "Wo ist denn der Rest? Die gibt es doch auch noch. Total entdeckt und das ist jetzt ja,"}, {"id": 880, "start": 6250.04, "end": 6255.0, "text": "sag mal, so irgendwelche Word-Dokumente mit fragwürdigem Inhalt, ja, da aus Russland"}, {"id": 881, "start": 6255.0, "end": 6258.6, "text": "und der Ecke. Das ist jetzt ja erstmal nichts Besonderes. Die machen alle VPN nach Russland"}, {"id": 882, "start": 6258.6, "end": 6264.16, "text": "mit NordVPN wahrscheinlich, ja. Wobei, ohne Scheiß, das kann wirklich sein, ne? Das ist"}, {"id": 883, "start": 6264.16, "end": 6267.52, "text": "gar nicht mal so unwahrscheinlich, dass die meisten... Also, was ich letztens gelesen"}, {"id": 884, "start": 6267.52, "end": 6278.52, "text": "habe, ist, dass für die richtig krassen Hacker-Mans nun VPN in den Iran wohl angesagt ist. Ich"}, {"id": 885, "start": 6278.52, "end": 6283.46, "text": "wusste gar nicht, dass der Iran VPN-Anbieter hat, aber anscheinend muss das aktuell angesagt"}, {"id": 886, "start": 6283.46, "end": 6291.0, "text": "sein, dass man als Hacker über zig Proxies geht und über iranische VPNs. Warum Iran?"}, {"id": 887, "start": 6291.0, "end": 6297.6, "text": "Ich kann es mir nur so erklären, dass dort halt es keiner mit, tja, Nachvollziehbarkeit"}, {"id": 888, "start": 6297.6, "end": 6304.16, "text": "sonderlich ernst nimmt und da auch keine Gesetze für gibt. Diesmal war es tatsächlich"}, {"id": 889, "start": 6304.16, "end": 6311.48, "text": "was Spannendes, denn es ging um einen neuen Zero-Day-Exploit für Word. Ja, der ist heute"}, {"id": 890, "start": 6311.48, "end": 6316.2, "text": "nicht wirklich mehr Zero-Day, weil eigentlich ist die Sicherheitslücke schon seit 5 Tagen"}, {"id": 891, "start": 6316.2, "end": 6320.48, "text": "bekannt. Das hört sich natürlich an mit einem manipulierten Word-Dokument. Aber es hört"}, {"id": 892, "start": 6320.48, "end": 6324.12, "text": "sich besser an. Das sagt an sich nichts Besonderes. Tausende Sicherheitslücken fangen mit einem"}, {"id": 893, "start": 6324.12, "end": 6330.44, "text": "manipulierten Word-Dokument an. Leider auch 2022 noch. So, und in diesem Fall nutzt das"}, {"id": 894, "start": 6330.44, "end": 6335.0, "text": "Word-Dokument Templates. Ich frage mich gerade, wie Templates auf Deutsch heißt, wahrscheinlich"}, {"id": 895, "start": 6335.0, "end": 6339.8, "text": "sowas wie... Ja, weiß das jemand? Heißt das Dokumentenvorlage oder so in Word auf Deutsch?"}, {"id": 896, "start": 6339.8, "end": 6346.32, "text": "Templates? Bestimmt Dokumentenvorlage, ja. Microsoft Word Dokumentenvorlagen oder sowas."}, {"id": 897, "start": 6346.32, "end": 6351.04, "text": "Ich hab geraten im Video. Ja, wahrscheinlich Dokumentenvorlage wird das wahrscheinlich"}, {"id": 898, "start": 6351.04, "end": 6355.28, "text": "heißen. So was da. Aber die verwenden nicht... Wobei es um die ja gar nicht geht. Nein, die"}, {"id": 899, "start": 6355.28, "end": 6359.6, "text": "verwenden Remote Templates. Das heißt... Ich fände es immer noch so affig, dass es"}, {"id": 900, "start": 6359.6, "end": 6364.16, "text": "überhaupt möglich ist, ne? Remote Templates. Man kann die Dokumentenvorlagen, die müssen"}, {"id": 901, "start": 6364.16, "end": 6368.56, "text": "nicht lokal sein, sondern die kann man von irgendwo downloaden. Das passiert normalerweise"}, {"id": 902, "start": 6368.56, "end": 6374.56, "text": "nur, wenn das Dokument geöffnet wird. Wie gesagt, normalerweise. Diesmal ist es leider"}, {"id": 903, "start": 6374.56, "end": 6381.72, "text": "ein bisschen schlimmer. So. Das klingt alleine ja schon etwas, wie man heutzutage... Da bin"}, {"id": 904, "start": 6381.72, "end": 6388.28, "text": "ich sehr stolz drauf, Leute. Dass ich diesen Gag jetzt auch mal machen konnte....sagen"}, {"id": 905, "start": 6388.28, "end": 6398.96, "text": "wir denn. Sass. Also sprich, das Word......von irgendwelchen Quellen im Internet sich Templates"}, {"id": 906, "start": 6398.96, "end": 6404.88, "text": "runterladen kann und das einfach passiert, nur wenn man das Dokument öffnet. Aber das"}, {"id": 907, "start": 6404.88, "end": 6410.0, "text": "ist Absicht und das ist ein Feature. Das soll so sein. Und das ist auch nur der Einstieg"}, {"id": 908, "start": 6410.0, "end": 6414.52, "text": "bei dem ganzen Problem, denn es reicht nicht einfach nur, dass man Word Templates... Ob"}, {"id": 909, "start": 6414.52, "end": 6419.12, "text": "das mit Signaturen in Office möglich ist, das ist eine gute Frage. Also, keine Ahnung,"}, {"id": 910, "start": 6419.12, "end": 6428.36, "text": "habe ich nichts zugelesen. Ich denke nicht, weil in dem Fall ist es ja so, dass das HTML"}, {"id": 911, "start": 6428.36, "end": 6438.08, "text": "und der JavaScript da drin von Word intern quasi ausgeführt werden und das wird wahrscheinlich"}, {"id": 912, "start": 6438.08, "end": 6446.84, "text": "bei Signaturen nicht passieren. Also, mich würde es wundern, wenn Signaturen mit JavaScript"}, {"id": 913, "start": 6446.84, "end": 6459.76, "text": "überhaupt ein Ding wären. Bestimmt ist Zenitized vorher. Wie bricht man das überhaupt so aus?"}, {"id": 914, "start": 6459.76, "end": 6465.84, "text": "Also, Escaped. Ich glaube nicht, dass es mit Signaturen funktioniert. Irgendwo sonst wie"}, {"id": 915, "start": 6465.84, "end": 6469.4, "text": "im Internet runterladen kann. Nein, nein. Ja, du musst ja... Dark Zone, du musst ja noch"}, {"id": 916, "start": 6469.4, "end": 6472.64, "text": "nicht mal anklicken. Das ist ja das Fatale da dran. Das sieht man ja später gleich."}, {"id": 917, "start": 6472.64, "end": 6477.68, "text": "In diesen Templates kann auch HTML-Code eingefügt sein. Mag ja sinnvoll sein für ein Template,"}, {"id": 918, "start": 6477.68, "end": 6483.0, "text": "dass man da irgendwie HTML reinschreibt. Also sprich, das hier ist das Beispiel von denen,"}, {"id": 919, "start": 6483.0, "end": 6491.32, "text": "was Embedded war in einem Word Template. Also, warum sowas überhaupt erlaubt sein muss in"}, {"id": 920, "start": 6491.32, "end": 6497.28, "text": "einem Word Template? Verstehe ich nicht. Ich meine, warum braucht man... Also, warum ist"}, {"id": 921, "start": 6497.28, "end": 6505.28, "text": "JavaScript überhaupt erlaubt in einem Word Template? Warum kann man Word Sachen scripten"}, {"id": 922, "start": 6505.28, "end": 6512.4, "text": "mit JavaScript, selbst wenn Makros deaktiviert sind? Was ist das für ein bescheuertes Design"}, {"id": 923, "start": 6512.4, "end": 6519.28, "text": "von Microsoft wieder? Wo HTML ist, ist natürlich JavaScript auch nicht weit und das heißt,"}, {"id": 924, "start": 6519.28, "end": 6527.24, "text": "man kann ein Word Template erstellen mit HTML drin und in diesem HTML ist dann JavaScript"}, {"id": 925, "start": 6527.24, "end": 6534.68, "text": "drin. Es ist quasi, könnte man sagen, eine Webseite als Template. So, und bei dieser Kombination,"}, {"id": 926, "start": 6534.68, "end": 6537.32, "text": "ja, da kommt es jetzt natürlich so, wie es kommen muss. Der JavaScript..."}, {"id": 927, "start": 6537.32, "end": 6545.68, "text": "Übrigens, was ich in dem Video nicht zeige, ist, das hier ist Base64 encoded, das Power"}, {"id": 928, "start": 6545.68, "end": 6553.84, "text": "Shell gedönnt, was dann versucht, irgendwelche RAR-Files zu entpacken. Das war jetzt aber"}, {"id": 929, "start": 6553.84, "end": 6558.12, "text": "nicht wirklich relevant für das Video. Wie es kommen muss, der JavaScript im HTML Word"}, {"id": 930, "start": 6558.12, "end": 6563.76, "text": "Template führt mit einem Trick am Ende Power Shell Befehle aus. Wir können uns das Ganze"}, {"id": 931, "start": 6563.76, "end": 6567.12, "text": "mal kurz angucken, was da so drin steht. Ich zeige euch mal das Bild. Das ist jetzt vielleicht"}, {"id": 932, "start": 6567.12, "end": 6572.92, "text": "auf den ersten Blick nicht so super verständlich. Zumindest, was hier dran interessant ist, dass"}, {"id": 933, "start": 6572.92, "end": 6578.6, "text": "die Window Location geändert wird. Die Window Location ist in JavaScript quasi das, was"}, {"id": 934, "start": 6578.6, "end": 6583.52, "text": "in eurem Browser die Adressleiste ist. Wenn das habe ich ganz gut erklärt mit der Adressleiste,"}, {"id": 935, "start": 6583.52, "end": 6590.4, "text": "ich meine, praktisch gesehen stimmt es nicht wirklich, aber das ist das, was die meisten"}, {"id": 936, "start": 6590.4, "end": 6594.6, "text": "Leute sich darin vorstellen können. Dort, wo ihr Seiten rein tippt, die ihr aufrufen"}, {"id": 937, "start": 6594.6, "end": 6603.24, "text": "wollt. Man beachte hier an der Stelle auch, dass da am Anfang steht MS-MSDT-Doppelpunkt."}, {"id": 938, "start": 6603.24, "end": 6604.56, "text": "Also normal schreibt man ja im Browser..."}, {"id": 939, "start": 6604.56, "end": 6609.64, "text": "Weiterbei, hier habe ich geschnitten. Ich habe in der Ursprungsaufnahme gesagt MS-MSDT-Doppelpunkt-Doppelslash."}, {"id": 940, "start": 6609.64, "end": 6613.72, "text": "Dann ist mir aufgefallen, das ist ja gar kein Doppelslash."}, {"id": 941, "start": 6613.72, "end": 6618.8, "text": "Mittlerweile muss man es nicht mehr schreiben, aber man würde sowas normalerweise hinschreiben"}, {"id": 942, "start": 6618.8, "end": 6624.8, "text": "im Browser HTTP-Doppelpunkt-Doppelslash-Google.de oder sowas. In dem Fall könnte man sagen,"}, {"id": 943, "start": 6624.8, "end": 6631.08, "text": "wird hier eine MS-MSDT-Seite aufgerufen. Also es wird nicht HTTP als Protokoll verwendet,"}, {"id": 944, "start": 6631.08, "end": 6638.76, "text": "sondern MS-MSDT als Protokoll verwendet. Das wird die Sache noch deutlich schlimmer machen,"}, {"id": 945, "start": 6638.76, "end": 6643.0, "text": "denn dahinter verbirgt sich ein Windows-Tool von Microsoft."}, {"id": 946, "start": 6643.0, "end": 6651.0, "text": "Gibt es den Base64-Text auch zum Copy... ja. Achso, nee. Die haben nur ein Bild. Die haben nur ein Bild hier drinnen irgendwo."}, {"id": 947, "start": 6651.0, "end": 6655.0, "text": "Hier glaube ich. Guck mal."}, {"id": 948, "start": 6655.0, "end": 6660.0, "text": "Das hier. Ja, kannst du aber nicht copypasten."}, {"id": 949, "start": 6660.0, "end": 6666.0, "text": "Das ist der decodete PowerShell-Befehl. Also sprich, das Base64 ist das hier."}, {"id": 950, "start": 6666.0, "end": 6672.0, "text": "Das versucht, irgendwelche RAR-Files zu decoden oder zu entpacken und sowas."}, {"id": 951, "start": 6672.0, "end": 6677.0, "text": "Komisches, komisches großen Zeugs. Hacker, Hacker-Man-Zeugs."}, {"id": 952, "start": 6677.0, "end": 6684.0, "text": "MSDT, das ist wohl der... es gibt leider ein paar doppeldeutige Abkürzungen bei Windows."}, {"id": 953, "start": 6684.0, "end": 6689.0, "text": "In dem Fall ist es wohl das Microsoft Support Diagnostic Tool."}, {"id": 954, "start": 6689.0, "end": 6696.0, "text": "Übrigens, ich habe keine Ahnung, warum das überhaupt Bestandteil ist und ich habe keine Ahnung, was das macht."}, {"id": 955, "start": 6696.0, "end": 6703.0, "text": "Was auch immer man damit genau macht. Ich habe mir nur zusammengereim, dass das wohl dieser Fehler Wizard sein muss."}, {"id": 956, "start": 6703.0, "end": 6717.0, "text": "Kennt ihr diesen Wizard? Windows, Wizard, Error, Troubleshoot, Troubleshooting Wizard."}, {"id": 957, "start": 6717.0, "end": 6721.0, "text": "Ja, diese Soundprobleme beheben. Genau."}, {"id": 958, "start": 6721.0, "end": 6728.0, "text": "Dieser Crap muss das irgendwie damit zu tun haben."}, {"id": 959, "start": 6728.0, "end": 6734.0, "text": "Dieser Troubleshooting Wizard. Reime ich mir so zusammen."}, {"id": 960, "start": 6734.0, "end": 6740.0, "text": "Wichtig an der Stelle ist, dass es ein offizielles Tool ist, das von Windows mitgeliefert wird, von Microsoft."}, {"id": 961, "start": 6740.0, "end": 6748.0, "text": "Das heißt, wenn das aufgerufen wird, wird kaum ein Antivirus herkommen und sagen, das ist problematisch."}, {"id": 962, "start": 6748.0, "end": 6752.0, "text": "Da wird MSDT aufgerufen. Nein, das ist ein offizieller Bestandteil."}, {"id": 963, "start": 6752.0, "end": 6760.0, "text": "Okay, an der Stelle könnten aktuell wirklich Antiviren-Software ansetzen und einfach mal alles, was MSDT ist und aufrufen will, plocken."}, {"id": 964, "start": 6760.0, "end": 6765.0, "text": "Weil 99% dürfte kein gewollter Aufruf sein aktuell."}, {"id": 965, "start": 6765.0, "end": 6769.0, "text": "Von Windows. Das heißt, da wird kein Virenscanner anschlagen und Windows-Defender fliegt."}, {"id": 966, "start": 6769.0, "end": 6775.0, "text": "Also sollen sie es doch blacklisten und irgendeinen Admin, der den Shit wirklich verwenden will, soll es dann whitelisten."}, {"id": 967, "start": 6775.0, "end": 6788.0, "text": "Das ist an der Stelle auch nicht an. Das heißt, man schafft es jetzt mit diesem manipulierten Java, mit diesem Template, mit dem manipulierten JavaScript-Inhalt im MSDT aufzurufen."}, {"id": 968, "start": 6788.0, "end": 6792.0, "text": "Das ist schon mal blöd, dass sowas überhaupt möglich ist."}, {"id": 969, "start": 6792.0, "end": 6798.0, "text": "Aber wir sind noch nicht bei PowerShell angelangt. So einfach ist es noch nicht."}, {"id": 970, "start": 6798.0, "end": 6804.0, "text": "Und über dieses MSDT-Tool kann man jetzt mit Geschick..."}, {"id": 971, "start": 6804.0, "end": 6807.0, "text": "Von KS, Alter."}, {"id": 972, "start": 6807.0, "end": 6815.0, "text": "Ich glaube, ich hätte an der Stelle ein paar Pfeile machen sollen, wo man gucken muss."}, {"id": 973, "start": 6815.0, "end": 6828.0, "text": "Man muss nämlich hier gucken, dass es MSDT ist, und man muss hier gucken, dass es diese IT-Rebrowse-for-File-Zeugs-Parameter-Kram gesetzt hat."}, {"id": 974, "start": 6828.0, "end": 6845.0, "text": "Mit der Auswahl der Startparameter, vor allem ist es wohl IT underscore rebrowse for file, kann man MSDT Excel dazu benutzen, dass das wiederum PowerShell aufruft."}, {"id": 975, "start": 6845.0, "end": 6852.0, "text": "Und das Ganze, wenn man das mit den richtigen Startparametern macht, ohne dass ein Fenster aufploppt oder ohne..."}, {"id": 976, "start": 6852.0, "end": 6857.0, "text": "Das habe ich gut übergeplendet, oder? In dem Moment, wo Fenster kommt, startet der Windows-Trailer."}, {"id": 977, "start": 6857.0, "end": 6860.0, "text": "Das ist tatsächlich Absicht an der Stelle gewesen."}, {"id": 978, "start": 6860.0, "end": 6867.0, "text": "Aktuell sind wir so, sind wir an der Stelle, du bekommst ein Dokument, ein Word-Dokument, klickst noch, sind wir beim Anklicken."}, {"id": 979, "start": 6867.0, "end": 6875.0, "text": "Du klickst das an, der lädt im Hintergrund von irgendwo auf der Welt ein Template runter mit HTML drin, in dem JavaScript drin ist,"}, {"id": 980, "start": 6875.0, "end": 6883.0, "text": "das dann wiederum MSDT.exe startet, das dann wiederum PowerShell aufruft mit quasi, ja, beliebigem Inhalt."}, {"id": 981, "start": 6883.0, "end": 6891.0, "text": "Ja, das ist ja klar. Also sobald, sobald das irgendeiner geschafft hat, bei euch und auch nur im User-Kontext eine PowerShell zu starten,"}, {"id": 982, "start": 6891.0, "end": 6893.0, "text": "da hat er erstmal gewonnen. Weil, damit kannst du alles machen."}, {"id": 983, "start": 6893.0, "end": 6899.0, "text": "Nicht der Rechner offen. Für so ziemlich alles. Aber du kannst in PowerShell nahezu alles machen, was man so machen kann."}, {"id": 984, "start": 6899.0, "end": 6907.0, "text": "Das Einzige, was an der Stelle vielleicht ein noch so ein bisschen rettet, ist, dass MSDT nicht mit Admin-Rechten läuft."}, {"id": 985, "start": 6907.0, "end": 6915.0, "text": "Das heißt, erstmal... Aber du hast so viele Möglichkeiten, du wirst über kurz oder lange Admin-Berechtigung auf dem System kriegen."}, {"id": 986, "start": 6915.0, "end": 6927.0, "text": "Und sei es nur, dass du irgendwie was nachlädst, was so einen UAC-Dialog faked oder... Es gibt tausend Möglichkeiten."}, {"id": 987, "start": 6927.0, "end": 6936.0, "text": "Also wenn du die, wenn du das Einfallstor offen hast und da PowerShell laufen hast, kannst dir jeder, du machst dir da irgendeinen Reverse-Shell auf,"}, {"id": 988, "start": 6936.0, "end": 6940.0, "text": "dass du dich immer drauf connecten kannst und... Also, da hast du gelitten."}, {"id": 989, "start": 6940.0, "end": 6944.0, "text": "Du kannst ja auch Autostartsachen machen, geht ja auch als normaler Benutzer."}, {"id": 990, "start": 6944.0, "end": 6953.0, "text": "Und das ist gelaufen. Also im Prinzip... Im Prinzip kannst du dein Rechner formatieren."}, {"id": 991, "start": 6953.0, "end": 6963.0, "text": "Und das Schlimme ist halt, selbst wenn du keine Admin-Berechtigung hast, ich meine, die wichtigen Daten haben die Leute doch auf ihrem eigenen Windows-Account."}, {"id": 992, "start": 6963.0, "end": 6966.0, "text": "Also User-Account im Arsch. Das ist nur schwacher Trost."}, {"id": 993, "start": 6966.0, "end": 6974.0, "text": "Was aber ziemlich wurscht ist, weil ihr wahrscheinlich private Files und wichtige Sachen eh unter eurem Windows, unter eurem normalen Windows User-Account abgelegt habt."}, {"id": 994, "start": 6974.0, "end": 6980.0, "text": "Ja, die wenigsten Leute switchen erst auf den zweiten Windows-Account, um Word-Dokumente aufzumachen oder sowas."}, {"id": 995, "start": 6980.0, "end": 6983.0, "text": "Die Leute arbeiten unter ihrem normalen Windows-Account."}, {"id": 996, "start": 6983.0, "end": 6987.0, "text": "Oder ja, vielleicht ist man auch gleich Teil eines DDoS-Botnetzes..."}, {"id": 997, "start": 6987.0, "end": 6989.0, "text": "Chet, dazu muss ich was sagen."}, {"id": 998, "start": 6989.0, "end": 6990.0, "text": "Oh Mist."}, {"id": 999, "start": 6990.0, "end": 6991.0, "text": "Muss ich mal stehen?"}, {"id": 1000, "start": 6991.0, "end": 6993.0, "text": "Oh Mist."}, {"id": 1001, "start": 6993.0, "end": 6998.0, "text": "Ohne, dass ein Fenster aufploppt oder nur euer User-Account im Arsch."}, {"id": 1002, "start": 6998.0, "end": 6999.0, "text": ".exe startet."}, {"id": 1003, "start": 6999.0, "end": 7000.0, "text": "Muss ich mal stehen geblieben."}, {"id": 1004, "start": 7000.0, "end": 7001.0, "text": ".powershell aufruft."}, {"id": 1005, "start": 7001.0, "end": 7002.0, "text": ".file."}, {"id": 1006, "start": 7002.0, "end": 7003.0, "text": "Hier, oder?"}, {"id": 1007, "start": 7003.0, "end": 7006.0, "text": "Hintergrund von irgendwo auf der Welt."}, {"id": 1008, "start": 7006.0, "end": 7008.0, "text": "Template runter, mit HTML drin, in dem Jahr."}, {"id": 1009, "start": 7008.0, "end": 7009.0, "text": "Ja, irgendwo hier."}, {"id": 1010, "start": 7009.0, "end": 7011.0, "text": "Ich wollte aber schnell was zum Chats sagen und zwar..."}, {"id": 1011, "start": 7011.0, "end": 7019.0, "text": "Es ist ein Irrglaube, dass Open Source bug-freier oder besser ist."}, {"id": 1012, "start": 7019.0, "end": 7022.0, "text": "Ja, das muss nicht zwangsläufig so sein."}, {"id": 1013, "start": 7022.0, "end": 7024.0, "text": "Das stimmt schon."}, {"id": 1014, "start": 7024.0, "end": 7031.0, "text": "Für mich ist ein Riesenvorteil davon, dass ich deutlich mehr Vertrauen habe in ein Open Source Projekt,"}, {"id": 1015, "start": 7031.0, "end": 7036.0, "text": "wenn ich es bei mir mit sensitiven Sachen laufen lasse, als irgendeinem Closed-Source-Campel."}, {"id": 1016, "start": 7036.0, "end": 7042.0, "text": "Weil ganz im Ernst, wer würde, oder was würdest du nehmen als Passwortmanager?"}, {"id": 1017, "start": 7042.0, "end": 7044.0, "text": "Würdest du ein Open Source Passwortmanager nehmen?"}, {"id": 1018, "start": 7044.0, "end": 7046.0, "text": "Oder würdest du irgendeinen Cloud-Source..."}, {"id": 1019, "start": 7046.0, "end": 7048.0, "text": "Ja, noch schlimmer."}, {"id": 1020, "start": 7048.0, "end": 7052.0, "text": "Cloud-based, proprietärer Cloud-based Passwortmanager nehmen?"}, {"id": 1021, "start": 7052.0, "end": 7056.0, "text": "Oder würdest du irgendwas nehmen, was 50.000 GitHub-Sterne hat?"}, {"id": 1022, "start": 7056.0, "end": 7059.0, "text": "Also reichen aus dem Gesichtspunkt..."}, {"id": 1023, "start": 7059.0, "end": 7063.0, "text": "Ja klar kann man nicht sagen, dass das automatisch besser ist."}, {"id": 1024, "start": 7063.0, "end": 7064.0, "text": "Ist es nicht?"}, {"id": 1025, "start": 7064.0, "end": 7068.0, "text": "Ja, die meisten Open Source-Dinger sind auch teilweise richtig im Arsch."}, {"id": 1026, "start": 7068.0, "end": 7075.0, "text": "Wenn du dir das ganze mit Log4j und das Gedöns anguckst, ist da mega kaputt."}, {"id": 1027, "start": 7075.0, "end": 7080.0, "text": "Aber das ist für mich ein ganz, ganz wichtiger Punkt."}, {"id": 1028, "start": 7080.0, "end": 7082.0, "text": "Letztens war auch irgendwas..."}, {"id": 1029, "start": 7082.0, "end": 7083.0, "text": "Ich hab..."}, {"id": 1030, "start": 7083.0, "end": 7084.0, "text": "Irgendeine richtig coole..."}, {"id": 1031, "start": 7084.0, "end": 7086.0, "text": "Obsidian war das, glaub ich."}, {"id": 1032, "start": 7086.0, "end": 7087.0, "text": "Kennt das jemand?"}, {"id": 1033, "start": 7087.0, "end": 7089.0, "text": "Das ist so ein Notizprogramm."}, {"id": 1034, "start": 7089.0, "end": 7091.0, "text": "Hab ich mir angeguckt und dachte, das ist doch richtig cool."}, {"id": 1035, "start": 7091.0, "end": 7094.0, "text": "Und dann hab ich festgestellt, es ist keine Open Source."}, {"id": 1036, "start": 7094.0, "end": 7096.0, "text": "Und deswegen benutze ich das nicht."}, {"id": 1037, "start": 7096.0, "end": 7098.0, "text": "Es gibt wirklich Leute, die gucken danach."}, {"id": 1038, "start": 7098.0, "end": 7104.0, "text": "Gerade ein Notizprogramm, wo ich wirklich vertrauenswürdige Sachen reinschreibe..."}, {"id": 1039, "start": 7104.0, "end": 7109.0, "text": "Und bestimmt auch mal kurzzeitig das eine oder andere Passwort reincopypaste..."}, {"id": 1040, "start": 7109.0, "end": 7111.0, "text": "Das will ich Open Source haben."}, {"id": 1041, "start": 7111.0, "end": 7113.0, "text": "Ich will, dass der Kram..."}, {"id": 1042, "start": 7113.0, "end": 7117.0, "text": "Dass ich mir im Zweifelsfall auch drüber gucken kann."}, {"id": 1043, "start": 7117.0, "end": 7119.0, "text": "Und das mache ich bei mancher Software tatsächlich."}, {"id": 1044, "start": 7119.0, "end": 7124.0, "text": "Ich meine, gut, das kann nicht jeder Nupe-Benutzer machen."}, {"id": 1045, "start": 7124.0, "end": 7126.0, "text": "Aber ich will, dass das ein Open Source Projekt ist."}, {"id": 1046, "start": 7126.0, "end": 7131.0, "text": "Natürlich hast du noch ganz andere Probleme dann."}, {"id": 1047, "start": 7131.0, "end": 7133.0, "text": "Ist halt die Frage..."}, {"id": 1048, "start": 7133.0, "end": 7137.0, "text": "Okay, die Quelle, von wo du es downloadest, vertraust du der Quelle..."}, {"id": 1049, "start": 7137.0, "end": 7140.0, "text": "Dass das, was du auf GitHub siehst..."}, {"id": 1050, "start": 7140.0, "end": 7144.0, "text": "Also das, was du dir auf GitHub als Source-Code anguckst..."}, {"id": 1051, "start": 7144.0, "end": 7147.0, "text": "Das, was du dir runterlädst, dass das wirklich das Gleiche ist."}, {"id": 1052, "start": 7147.0, "end": 7149.0, "text": "Das ist oftmals gar nicht so einfach."}, {"id": 1053, "start": 7149.0, "end": 7153.0, "text": "Wer überprüft denn irgendwelche Hash-Werte nach dem Download und so?"}, {"id": 1054, "start": 7153.0, "end": 7156.0, "text": "Also das ist wieder was anderes."}, {"id": 1055, "start": 7156.0, "end": 7159.0, "text": "Nee, aber prinzipiell gebe ich dir an der Stelle recht..."}, {"id": 1056, "start": 7159.0, "end": 7161.0, "text": "Es muss nicht zwangsläufig bugfrei und besser sein."}, {"id": 1057, "start": 7161.0, "end": 7170.0, "text": "Aber zumindest der Vertrauensaspekt und wenn das wirklich große Projekte sind..."}, {"id": 1058, "start": 7170.0, "end": 7175.0, "text": "Da kannst du zumindest mal davon ausgehen..."}, {"id": 1059, "start": 7175.0, "end": 7180.0, "text": "Dass mein Ikea-Sensor blinkt."}, {"id": 1060, "start": 7180.0, "end": 7185.0, "text": "Der Windrückning-Ikea-Sensor blinkt gerade komisch."}, {"id": 1061, "start": 7185.0, "end": 7194.0, "text": "Heißt, dass ich hier so hohe Feinstaubkonzentrationen habe, dass es langsam gefährlich wird."}, {"id": 1062, "start": 7194.0, "end": 7198.0, "text": "Das wollte ich jetzt sagen, dass bei so großen Open Source Projekten..."}, {"id": 1063, "start": 7198.0, "end": 7204.0, "text": "Da kannst du zumindest mal davon ausgehen, dass die grundsätzlich mal tun, was sie sollen."}, {"id": 1064, "start": 7204.0, "end": 7211.0, "text": "Und auch der normale Betrieb so weit bugfrei möglich ist, weil sonst hätten die keine 50.000 Sterne bekommen."}, {"id": 1065, "start": 7211.0, "end": 7216.0, "text": "Also sprich, wenn ich jetzt irgendeine Library nehme von GitHub, mit der ich..."}, {"id": 1066, "start": 7216.0, "end": 7219.0, "text": "Nimm FFmpeg oder so oder..."}, {"id": 1067, "start": 7219.0, "end": 7223.0, "text": "Oder nimm React oder Vue.js oder sowas."}, {"id": 1068, "start": 7223.0, "end": 7227.0, "text": "Wenn ich sowas nehme, dann kann ich davon ausgehen, dass die Basic Funktionalität..."}, {"id": 1069, "start": 7227.0, "end": 7232.0, "text": "Also das, was quasi tausende Benutzer verwenden von dieser Library..."}, {"id": 1070, "start": 7232.0, "end": 7240.0, "text": "Dass das in der Regel ganz passabel funktionieren würde, weil sonst hätten die keine 50.000 GitHub Sterne."}, {"id": 1071, "start": 7240.0, "end": 7241.0, "text": "Also ein gewisser..."}, {"id": 1072, "start": 7241.0, "end": 7242.0, "text": "Ich weiß nicht, wie soll ich sagen."}, {"id": 1073, "start": 7242.0, "end": 7245.0, "text": "So ein gewisser Qualitätsindikator, finde ich, ist das schon."}, {"id": 1074, "start": 7245.0, "end": 7248.0, "text": "Ob es ein großes, bekanntes Open Source Projekt ist."}, {"id": 1075, "start": 7248.0, "end": 7255.0, "text": "Ob das jetzt aus Security-Sicht wirklich besser und bugfrei ist, das ist natürlich was anderes."}, {"id": 1076, "start": 7255.0, "end": 7258.0, "text": "Das kann man so nicht sagen."}, {"id": 1077, "start": 7258.0, "end": 7265.0, "text": "Dafür gibt es viel zu wenige Leute, die die Sachen auch daraufhin analysieren und auch Ahnung davon haben."}, {"id": 1078, "start": 7265.0, "end": 7267.0, "text": "Das kann man nicht sagen."}, {"id": 1079, "start": 7267.0, "end": 7269.0, "text": "Das ist natürlich was anderes."}, {"id": 1080, "start": 7272.0, "end": 7274.0, "text": "Kennst du White Source?"}, {"id": 1081, "start": 7274.0, "end": 7276.0, "text": "Also ich hab den Begriff schon mal gehört."}, {"id": 1082, "start": 7276.0, "end": 7279.0, "text": "Selbst kann ich mir jetzt wenig darunter vorstellen."}, {"id": 1083, "start": 7279.0, "end": 7287.0, "text": "Also du kannst natürlich eins, zwei Sätze in den Chat schreiben, dass du uns quasi erhältst, was man da genau darunter versteht."}, {"id": 1084, "start": 7287.0, "end": 7289.0, "text": "Weil ich muss jetzt erstmal..."}, {"id": 1085, "start": 7289.0, "end": 7291.0, "text": "Max wird kein Apple-Fan."}, {"id": 1086, "start": 7291.0, "end": 7293.0, "text": "Ich hab ein iPhone."}, {"id": 1087, "start": 7293.0, "end": 7295.0, "text": "Tja, ich hätte wahrscheinlich privat auch kein iPhone."}, {"id": 1088, "start": 7295.0, "end": 7301.0, "text": "Ich hab ein iPhone aus dem einzigen Grund, weil ich das nicht bezahlen muss."}, {"id": 1089, "start": 7301.0, "end": 7302.0, "text": "Und..."}, {"id": 1090, "start": 7302.0, "end": 7306.0, "text": "Tja, warum sollte ich nochmal 600, 700 Euro für ein Smartphone ausgeben?"}, {"id": 1091, "start": 7308.0, "end": 7315.0, "text": "Ja, aber was den Punkt angeht, ist Smartphone eines der kritischsten Dinger."}, {"id": 1092, "start": 7315.0, "end": 7319.0, "text": "Du hast gerade bei App Store Produkten..."}, {"id": 1093, "start": 7319.0, "end": 7326.0, "text": "Ich rede jetzt mal gar nicht von dem, dass der Betriebssystemhersteller selbst alles mit deinen Daten und mit dir machen kann."}, {"id": 1094, "start": 7326.0, "end": 7328.0, "text": "Weil da hast du ja gar keinen Einfluss drauf."}, {"id": 1095, "start": 7328.0, "end": 7334.0, "text": "Dir gehört das Gerät zwar offiziell, aber du hast ja keinen Einfluss drauf, was Android oder iOS da so wirklich machen."}, {"id": 1096, "start": 7334.0, "end": 7336.0, "text": "Und du weißt das nicht."}, {"id": 1097, "start": 7336.0, "end": 7337.0, "text": "Und..."}, {"id": 1098, "start": 7337.0, "end": 7342.0, "text": "Was ich viel schlimmer finde, auch wegen Open Source, ja, ist so."}, {"id": 1099, "start": 7342.0, "end": 7349.0, "text": "Was ich viel schlimmer finde, ist, dass du dir auch bei App Store Produkten nicht so wirklich sicher sein kannst."}, {"id": 1100, "start": 7349.0, "end": 7352.0, "text": "Ja, die App Store Sachen werden reviewed."}, {"id": 1101, "start": 7352.0, "end": 7357.0, "text": "Potenziell härter im Apple App Store als im Android App Store."}, {"id": 1102, "start": 7357.0, "end": 7360.0, "text": "Aber es gab genug Beispiele für..."}, {"id": 1103, "start": 7360.0, "end": 7365.0, "text": "Das ist ein bisschen wie mit Browser Addons zum Beispiel, ja."}, {"id": 1104, "start": 7365.0, "end": 7371.0, "text": "Es gibt genug Beispiele, wo Leute sehr, sehr fragwürdige Dinge in ihren Apps drin hatten."}, {"id": 1105, "start": 7371.0, "end": 7380.0, "text": "Und da bei den Apps hast du halt, bei App Store Käufen, du hast halt keine, du hast gar keine Chance dir das anzugucken."}, {"id": 1106, "start": 7380.0, "end": 7382.0, "text": "Bei Android noch ein bisschen mehr."}, {"id": 1107, "start": 7382.0, "end": 7386.0, "text": "Android kannst du dir meistens die APKs runterladen."}, {"id": 1108, "start": 7386.0, "end": 7394.0, "text": "Und Android Anwendungen sind in der Regel relativ easy zu entpacken, die APKs, wenn man das wirklich machen will."}, {"id": 1109, "start": 7394.0, "end": 7397.0, "text": "Wenn es Java ist, dann lässt sich Java ziemlich einfach decompilen."}, {"id": 1110, "start": 7397.0, "end": 7405.0, "text": "Und wenn es normale APKs sind mit irgendwelchen Web-Anwendungen, also irgendwelche modernen Web-Anwendungen, dann erst recht."}, {"id": 1111, "start": 7405.0, "end": 7410.0, "text": "Aber das macht ja keiner. Und unter iOS ist es noch schwieriger."}, {"id": 1112, "start": 7410.0, "end": 7412.0, "text": "Dieter Ross, danke für den Sub. Nido, danke schön für den Sub."}, {"id": 1113, "start": 7412.0, "end": 7414.0, "text": "So, wir gucken uns jetzt das Video endlich fertig."}, {"id": 1114, "start": 7414.0, "end": 7417.0, "text": "Mein eigenes Null."}, {"id": 1115, "start": 7417.0, "end": 7418.0, "text": "So, gleich geschafft."}, {"id": 1116, "start": 7418.0, "end": 7422.0, "text": "Java Script drinne ist, dass dann wiederum msdt.exe startet."}, {"id": 1117, "start": 7422.0, "end": 7427.0, "text": "Dass es dann wiederum PowerShell aufruft mit quasi, ja, beliebigem Inhalt."}, {"id": 1118, "start": 7427.0, "end": 7430.0, "text": "Und damit ist natürlich der Rechner offen."}, {"id": 1119, "start": 7430.0, "end": 7431.0, "text": "Oh Mist."}, {"id": 1120, "start": 7431.0, "end": 7433.0, "text": "Du kannst den PowerShell nachher so alles machen."}, {"id": 1121, "start": 7433.0, "end": 7436.0, "text": "Ich hab dich gebannt. Ich wollte dich nicht bannen. Ich wollte mit dem Message einigen."}, {"id": 1122, "start": 7436.0, "end": 7439.0, "text": "Chat. Chat, Moment. Ich muss dich entbannen."}, {"id": 1123, "start": 7439.0, "end": 7442.0, "text": "Der Ritter Ross war das. Den wollte ich nicht bannen."}, {"id": 1124, "start": 7442.0, "end": 7444.0, "text": "Alter."}, {"id": 1125, "start": 7448.0, "end": 7451.0, "text": "Äh. Moment."}, {"id": 1126, "start": 7451.0, "end": 7454.0, "text": "Anbann."}, {"id": 1127, "start": 7454.0, "end": 7457.0, "text": "Anbann."}, {"id": 1128, "start": 7457.0, "end": 7461.0, "text": "Das ist ja auch kacke, dass da nicht nachgefragt wird, Alter."}, {"id": 1129, "start": 7461.0, "end": 7462.0, "text": "So, aufkommen."}, {"id": 1130, "start": 7462.0, "end": 7466.0, "text": "Hat er mich subscribt und direkt und direkt gebannt."}, {"id": 1131, "start": 7466.0, "end": 7468.0, "text": "Null, Alter."}, {"id": 1132, "start": 7468.0, "end": 7470.0, "text": "Das muss..."}, {"id": 1133, "start": 7470.0, "end": 7474.0, "text": "Ich hoffe, du bist noch da, Alter."}, {"id": 1134, "start": 7474.0, "end": 7476.0, "text": "Nee."}, {"id": 1135, "start": 7476.0, "end": 7477.0, "text": "Ich wollte die Nachricht..."}, {"id": 1136, "start": 7477.0, "end": 7484.0, "text": "Das ist aber auch dumm, dass dieses Banz, dieses permanent Banz-Symbol einfach direkt neben dran ist,"}, {"id": 1137, "start": 7484.0, "end": 7488.0, "text": "ohne dass eine Rückfrage kommt."}, {"id": 1138, "start": 7488.0, "end": 7491.0, "text": "Und anscheinend hab ich noch jemand anderes angeklickt, weil er sagt,"}, {"id": 1139, "start": 7491.0, "end": 7495.0, "text": "deine Sperraktion steht im Konflikt mit einer anderen Sperraktion."}, {"id": 1140, "start": 7495.0, "end": 7498.0, "text": "Also wahrscheinlich, wir hatten unten drunter gepostet."}, {"id": 1141, "start": 7498.0, "end": 7503.0, "text": "Äh, TrappedOxygen hat drunter gepostet. Du hast Glück gehabt."}, {"id": 1142, "start": 7503.0, "end": 7507.0, "text": "Twitter hat aus Versehen, äh, Twitch hat aus Versehen die Sperraktion nicht angenommen."}, {"id": 1143, "start": 7511.0, "end": 7516.0, "text": "So ein bisschen rettet es, dass MSDT nicht mit Admin-Rechten läuft."}, {"id": 1144, "start": 7516.0, "end": 7517.0, "text": "Nee, der Sub ist nicht weg."}, {"id": 1145, "start": 7517.0, "end": 7521.0, "text": "Du kannst aber deinen Sub kündigen mit der Begründung, dich hat der Typ gebannt."}, {"id": 1146, "start": 7521.0, "end": 7522.0, "text": "Das geht."}, {"id": 1147, "start": 7522.0, "end": 7524.0, "text": "Erstmal ist nur euer User-Account im Arsch."}, {"id": 1148, "start": 7524.0, "end": 7530.0, "text": "Was aber ziemlich wurscht ist, weil ihr wahrscheinlich private Files und wichtige Sachen eh unter eurem Windows,"}, {"id": 1149, "start": 7530.0, "end": 7532.0, "text": "unter eurem normalen Windows User-Account abgelegt habt."}, {"id": 1150, "start": 7532.0, "end": 7533.0, "text": "Genau."}, {"id": 1151, "start": 7533.0, "end": 7534.0, "text": "Deswegen ist es eigentlich egal."}, {"id": 1152, "start": 7534.0, "end": 7538.0, "text": "Die wenigsten Leute switchen erst auf einen zweiten Windows-Account, um Word-Dokumente aufzumachen."}, {"id": 1153, "start": 7538.0, "end": 7539.0, "text": "Richtig."}, {"id": 1154, "start": 7539.0, "end": 7541.0, "text": "Die Leute arbeiten unter ihrem normalen Windows-Account."}, {"id": 1155, "start": 7541.0, "end": 7544.0, "text": "Ich find's immer gut, wenn ich eigene Videos von mir gucke, gebe ich mir immer recht."}, {"id": 1156, "start": 7544.0, "end": 7546.0, "text": "Aber wäre ja auch komisch, wenn nicht."}, {"id": 1157, "start": 7546.0, "end": 7550.0, "text": "Oder vielleicht ist man auch gleich Teil eines DDoS-Botnetzes."}, {"id": 1158, "start": 7550.0, "end": 7553.0, "text": "Nein, dafür braucht man auch nicht unbedingt Admin-Rechte."}, {"id": 1159, "start": 7553.0, "end": 7558.0, "text": "Und wer weiß, sobald es mal wieder ein Admin-Exploit für Windows gibt,"}, {"id": 1160, "start": 7558.0, "end": 7560.0, "text": "kommt hier ab und zu auch mal vor,"}, {"id": 1161, "start": 7560.0, "end": 7564.0, "text": "steht quasi der weißrussische Hacker-Man quasi schon direkt in eurer Wohnung."}, {"id": 1162, "start": 7564.0, "end": 7569.0, "text": "Also kannst du eigentlich von ausgehen, der Rechner ist versaut, du musst neu installieren."}, {"id": 1163, "start": 7569.0, "end": 7573.0, "text": "Und du musst theoretisch auch davon ausgehen, dass der Files abgezogen hat."}, {"id": 1164, "start": 7573.0, "end": 7577.0, "text": "In der Praxis wirst du wahrscheinlich Glück haben, weil es kein gezielter Angriff gegen dich sein wird."}, {"id": 1165, "start": 7577.0, "end": 7578.0, "text": "Und wahrscheinlich erst mal nichts."}, {"id": 1166, "start": 7578.0, "end": 7580.0, "text": "Aber man weiß es nicht."}, {"id": 1167, "start": 7580.0, "end": 7582.0, "text": "Eurem Rechner und kann weitermachen."}, {"id": 1168, "start": 7582.0, "end": 7584.0, "text": "Das ist natürlich nicht schön."}, {"id": 1169, "start": 7584.0, "end": 7587.0, "text": "Aber ich hab doch am Anfang irgendwas gesagt mit..."}, {"id": 1170, "start": 7587.0, "end": 7588.0, "text": "Jetzt kommt der Hammer, ja."}, {"id": 1171, "start": 7588.0, "end": 7590.0, "text": "Der Teil muss nicht mal angeklickt werden."}, {"id": 1172, "start": 7590.0, "end": 7592.0, "text": "Oder vielleicht, wenn ich mir so richtig überlege,"}, {"id": 1173, "start": 7592.0, "end": 7593.0, "text": "vielleicht schreibe ich das sogar ins..."}, {"id": 1174, "start": 7593.0, "end": 7594.0, "text": "Was?"}, {"id": 1175, "start": 7594.0, "end": 7597.0, "text": "Wenn ich mir so richtig überlege..."}, {"id": 1176, "start": 7597.0, "end": 7598.0, "text": "Ja, manchmal..."}, {"id": 1177, "start": 7598.0, "end": 7602.0, "text": "Das Problem hab ich ja im Stream auch."}, {"id": 1178, "start": 7602.0, "end": 7608.0, "text": "Manchmal fang ich an zu reden, bevor ich in meinem Hirn den Satz gedacht habe."}, {"id": 1179, "start": 7608.0, "end": 7611.0, "text": "Ja, es wird noch besser."}, {"id": 1180, "start": 7611.0, "end": 7616.0, "text": "Wenn die Datei nämlich nicht als Word-Dokument im Doc-Format bei euch ankommt,"}, {"id": 1181, "start": 7616.0, "end": 7620.0, "text": "sondern als RTF, dann reicht es, wenn..."}, {"id": 1182, "start": 7620.0, "end": 7623.0, "text": "By the way, RTF ist dieses Rich Text Format,"}, {"id": 1183, "start": 7623.0, "end": 7628.0, "text": "was beispielsweise auch WordPad verwendet und sowas."}, {"id": 1184, "start": 7628.0, "end": 7632.0, "text": "Aber WordPad ist nicht betroffen, weil die machen keine Word-Dokumentenvorlagen."}, {"id": 1185, "start": 7632.0, "end": 7637.0, "text": "Man einen Windows Explorer öffnet mit dem Ordner, wo die Datei drinnen liegt."}, {"id": 1186, "start": 7637.0, "end": 7640.0, "text": "Also zum Beispiel ihr bekommt eine Webseite mit einem Link auf der Datei,"}, {"id": 1187, "start": 7640.0, "end": 7642.0, "text": "ihr ladet das runter und macht dann irgendwann mal..."}, {"id": 1188, "start": 7642.0, "end": 7643.0, "text": "Wer benutzt WordPad?"}, {"id": 1189, "start": 7643.0, "end": 7647.0, "text": "Ich frag mich, dass bei den meisten eingebauten Windows-Apps, wer diesen Kram verwendet."}, {"id": 1190, "start": 7647.0, "end": 7649.0, "text": "Euren Download-Ordner auf."}, {"id": 1191, "start": 7649.0, "end": 7650.0, "text": "Ich hab keine Antwort drauf."}, {"id": 1192, "start": 7650.0, "end": 7652.0, "text": "Dann seid ihr auch gefickt."}, {"id": 1193, "start": 7652.0, "end": 7655.0, "text": "Leute, ich hab gesagt, ihr seid auch gefickt,"}, {"id": 1194, "start": 7655.0, "end": 7661.0, "text": "und ich habe nicht bei YouTube angekreuzt Language."}, {"id": 1195, "start": 7661.0, "end": 7664.0, "text": "Ich hätte Language ankreuzen müssen."}, {"id": 1196, "start": 7664.0, "end": 7668.0, "text": "Wobei, da steht nur die erste Minute. Nur die erste Minute zählt."}, {"id": 1197, "start": 7668.0, "end": 7670.0, "text": "Und das ist nach der ersten Minute."}, {"id": 1198, "start": 7670.0, "end": 7674.0, "text": "Durch die Explorer-Vorschau-Funktion wird das Ganze dann aktiv."}, {"id": 1199, "start": 7674.0, "end": 7677.0, "text": "Ohne, dass ihr Word öffnen müsst. Ohne, dass in die Datei..."}, {"id": 1200, "start": 7677.0, "end": 7679.0, "text": "Mir fällt das jetzt gerade aus."}, {"id": 1201, "start": 7679.0, "end": 7682.0, "text": "Guckt euch mal dieses Hintergrundvideo an."}, {"id": 1202, "start": 7682.0, "end": 7684.0, "text": "Explorer-Vorschau-Funktion."}, {"id": 1203, "start": 7684.0, "end": 7689.0, "text": "Ohne zuzuhören. Guckt euch mal das an."}, {"id": 1204, "start": 7689.0, "end": 7691.0, "text": "Was zum Teufel?"}, {"id": 1205, "start": 7691.0, "end": 7693.0, "text": "Ach, das ist TikTok."}, {"id": 1206, "start": 7693.0, "end": 7695.0, "text": "Okay, dann ist alles klar, was da abgeht."}, {"id": 1207, "start": 7695.0, "end": 7698.0, "text": "Ohne, dass ihr Word öffnen müsst. Ohne, dass in die Datei anklicken müsst."}, {"id": 1208, "start": 7698.0, "end": 7700.0, "text": "Da ist man sich noch ein bisschen unsicher,"}, {"id": 1209, "start": 7700.0, "end": 7704.0, "text": "in welcher Kombination das genau funktioniert."}, {"id": 1210, "start": 7704.0, "end": 7706.0, "text": "Von Windows, von Word, aber..."}, {"id": 1211, "start": 7706.0, "end": 7708.0, "text": "Also sprich, nur mal, falls ihr mitgekriegt habt."}, {"id": 1212, "start": 7708.0, "end": 7712.0, "text": "Also es kann sein, wenn ihr ein RTF-Dokument runterladet"}, {"id": 1213, "start": 7712.0, "end": 7715.0, "text": "und dann den Ordner öffnet."}, {"id": 1214, "start": 7715.0, "end": 7718.0, "text": "Zum Beispiel den Download-Ordner, wo das drin ist."}, {"id": 1215, "start": 7718.0, "end": 7721.0, "text": "Und ihr File-Vorschau anhabt."}, {"id": 1216, "start": 7721.0, "end": 7726.0, "text": "Ich bin mir nicht sicher, ob das Anzeigen von diesen Sachen hier schon reicht."}, {"id": 1217, "start": 7726.0, "end": 7728.0, "text": "Dann seid ihr auch gefickt."}, {"id": 1218, "start": 7730.0, "end": 7732.0, "text": "Das Beste ist einfach, kein Word installiert haben."}, {"id": 1219, "start": 7732.0, "end": 7735.0, "text": "Wenn ihr Pech habt, funktioniert das."}, {"id": 1220, "start": 7735.0, "end": 7737.0, "text": "Und das ist natürlich heftig."}, {"id": 1221, "start": 7737.0, "end": 7739.0, "text": "Ich habe ja schon oft in Videos gesagt,"}, {"id": 1222, "start": 7739.0, "end": 7741.0, "text": "es ist nicht so sehr das Problem,"}, {"id": 1223, "start": 7741.0, "end": 7743.0, "text": "einen Virus auf dem Internet öffnen zu bekommen,"}, {"id": 1224, "start": 7743.0, "end": 7746.0, "text": "sondern eher, dass der auch ausgeführt wird und aktiv wird."}, {"id": 1225, "start": 7746.0, "end": 7748.0, "text": "Das ist damit natürlich easy möglich."}, {"id": 1226, "start": 7748.0, "end": 7752.0, "text": "Das heißt, jeder mit installiertem Word"}, {"id": 1227, "start": 7752.0, "end": 7754.0, "text": "sollte sich nur mal Gedanken machen,"}, {"id": 1228, "start": 7754.0, "end": 7757.0, "text": "was er für Dokumente in letzter Zeit bekommen hat."}, {"id": 1229, "start": 7757.0, "end": 7761.0, "text": "Zumal es schon viele Beispiele gibt, wo das auch ausgenutzt wird."}, {"id": 1230, "start": 7761.0, "end": 7763.0, "text": "Da wollte ich was zu sagen."}, {"id": 1231, "start": 7763.0, "end": 7766.0, "text": "Mittlerweile, jetzt ein paar Stunden, nachdem ich das Video hochgeladen habe,"}, {"id": 1232, "start": 7766.0, "end": 7769.0, "text": "es gibt immer mehr Beispiele, dass das ausgenutzt wird."}, {"id": 1233, "start": 7769.0, "end": 7772.0, "text": "Gerade vorhin kam sogar ein Post nochmal bei Heise."}, {"id": 1234, "start": 7779.0, "end": 7781.0, "text": "Du musst den Ordner einklicken und ihn aufmachen,"}, {"id": 1235, "start": 7781.0, "end": 7784.0, "text": "was du ja machst, wenn du hier draufklickst."}, {"id": 1236, "start": 7784.0, "end": 7787.0, "text": "Wenn es hier drinnen liegt, in Downloads."}, {"id": 1237, "start": 7787.0, "end": 7791.0, "text": "Ja, sogar Heise hat vorhin einen Artikel gepostet da drüber"}, {"id": 1238, "start": 7791.0, "end": 7793.0, "text": "mit irgendwelcher hier da hier."}, {"id": 1239, "start": 7793.0, "end": 7795.0, "text": "Alert!"}, {"id": 1240, "start": 7795.0, "end": 7797.0, "text": "Wenn sogar Heise da schon was drüber postet,"}, {"id": 1241, "start": 7797.0, "end": 7799.0, "text": "dann ist das wirklich sehr relevant."}, {"id": 1242, "start": 7799.0, "end": 7801.0, "text": "..."}, {"id": 1243, "start": 7809.0, "end": 7811.0, "text": "..."}, {"id": 1244, "start": 7816.0, "end": 7818.0, "text": "Ergibt es konkrete Handlungsempfehlungen?"}, {"id": 1245, "start": 7818.0, "end": 7820.0, "text": "Ja, je nachdem."}, {"id": 1246, "start": 7820.0, "end": 7825.0, "text": "Man kann über irgendeine Gruppenrichtlinie für seine Clients abschalten lassen,"}, {"id": 1247, "start": 7825.0, "end": 7828.0, "text": "dass das überhaupt soweit kommt."}, {"id": 1248, "start": 7828.0, "end": 7832.0, "text": "Sprich, dass dieses Protokoll hier aktiv ist."}, {"id": 1249, "start": 7832.0, "end": 7834.0, "text": "Dieses MS-MSDT."}, {"id": 1250, "start": 7834.0, "end": 7838.0, "text": "Die eigentliche Word-Sicherheitslücke kannst du damit nicht abschalten."}, {"id": 1251, "start": 7838.0, "end": 7842.0, "text": "Aber du kannst halt, dass diese Sache in dieser Form ausgenutzt werden kann, abschalten."}, {"id": 1252, "start": 7842.0, "end": 7845.0, "text": "Das kannst du selbst bei Registry abschalten."}, {"id": 1253, "start": 7845.0, "end": 7853.0, "text": "Und angeblich ist wohl auch irgendein Windows-Patch schon in der Mache unterwegs."}, {"id": 1254, "start": 7853.0, "end": 7856.0, "text": "Hab ich irgendwo nebenbei aufgeschnappt."}, {"id": 1255, "start": 7856.0, "end": 7861.0, "text": "Aber Microsoft selbst ist da nicht so scharf drauf, was dran zu ändern."}, {"id": 1256, "start": 7861.0, "end": 7865.0, "text": "Weil für die ist ja Remote Templates ein tolles Feature, was da bleiben soll."}, {"id": 1257, "start": 7865.0, "end": 7871.0, "text": "Warum man nicht einfach sagt, man macht es standardmäßig aus, verstehe ich nicht."}, {"id": 1258, "start": 7871.0, "end": 7877.0, "text": "Weil ganz ehrlich, eigentlich ist das ein Feature, was man standardmäßig wirklich nicht haben will."}, {"id": 1259, "start": 7877.0, "end": 7881.0, "text": "Es gibt einen inoffiziellen Preview-Patch nach Geil."}, {"id": 1260, "start": 7881.0, "end": 7887.0, "text": "Also das Beste aktuell tatsächlich ist Word deinstallieren und was anderes verwenden."}, {"id": 1261, "start": 7887.0, "end": 7891.0, "text": "Oder macht so wie ich, verwendet gar keine Office-Produkte."}, {"id": 1262, "start": 7891.0, "end": 7894.0, "text": "Ich meine, ich glaube, ich habe LibreOffice oder hier drauf, ja."}, {"id": 1263, "start": 7894.0, "end": 7896.0, "text": "Hab ich Word drauf? Nö."}, {"id": 1264, "start": 7896.0, "end": 7898.0, "text": "Was ist das?"}, {"id": 1265, "start": 7898.0, "end": 7901.0, "text": "Irgendwas vorinstalliertes ist das."}, {"id": 1266, "start": 7901.0, "end": 7907.0, "text": "Aber ich verwende keine Textverarbeitung."}, {"id": 1267, "start": 7907.0, "end": 7910.0, "text": "Weder LibreOffice noch Word."}, {"id": 1268, "start": 7910.0, "end": 7915.0, "text": "Und auch kein PowerPoint und sowas."}, {"id": 1269, "start": 7915.0, "end": 7924.0, "text": "Textverarbeitung verwende ich zu 90% Texteditor mit Markdown."}, {"id": 1270, "start": 7924.0, "end": 7932.0, "text": "Und Excel, ja. Ganz ehrlich, ihr kennt meine Meinung zu Excel."}, {"id": 1271, "start": 7932.0, "end": 7937.0, "text": "Ich denke, Excel ist das einzige Programm im gesamten Office."}, {"id": 1272, "start": 7937.0, "end": 7944.0, "text": "Also von den Basics-Sachen, was irgendwie eine Daseinsberechtigung hat."}, {"id": 1273, "start": 7944.0, "end": 7954.0, "text": "Excel ist quasi die IDE des BWLers oder die IDE der Hausfrau."}, {"id": 1274, "start": 7954.0, "end": 7959.0, "text": "Darf man das, der Hauspersonen, der Hausmenschen, der Haus..."}, {"id": 1275, "start": 7959.0, "end": 7968.0, "text": "Ja, sag mal, gibt es eigentlich auch eine Männlichkeitsform,"}, {"id": 1276, "start": 7968.0, "end": 7971.0, "text": "wenn man standardmäßig Hausfrau sagt?"}, {"id": 1277, "start": 7971.0, "end": 7975.0, "text": "So, man sagt dann HandwerkerInnen."}, {"id": 1278, "start": 7975.0, "end": 7979.0, "text": "Gibt es dann auch eine Vermännlichung oder sowas dann?"}, {"id": 1279, "start": 7979.0, "end": 7983.0, "text": "Also ja, im Moment Hausmann. Hausmann trifft es ja auch nicht."}, {"id": 1280, "start": 7983.0, "end": 7991.0, "text": "Also irgendwas, wo man dann aus Hausfrau oder Haus irgendwie dann noch beide einschließt."}, {"id": 1281, "start": 7991.0, "end": 7993.0, "text": "Ohne, dass man sich ein eigenes Wort ausdenken muss."}, {"id": 1282, "start": 7993.0, "end": 8002.0, "text": "Hauswirtschafter. Ah ja, das ist natürlich nicht schlecht."}, {"id": 1283, "start": 8002.0, "end": 8006.0, "text": "Hauswirtschaftende. Das wäre es, oder?"}, {"id": 1284, "start": 8006.0, "end": 8009.0, "text": "Das ist die Pfeifert-Sache, die heute..."}, {"id": 1285, "start": 8009.0, "end": 8013.0, "text": "Hauswirtschaftende. Das ist komplett neutral."}, {"id": 1286, "start": 8013.0, "end": 8018.0, "text": "Ergibt wenig Sinn, weil das mehrdeutig ist."}, {"id": 1287, "start": 8018.0, "end": 8024.0, "text": "Es könnten ja auch Leute sein, die im Haus wirtschaftende sind."}, {"id": 1288, "start": 8024.0, "end": 8027.0, "text": "Aber egal, das ist ein unsinniges Thema."}, {"id": 1289, "start": 8027.0, "end": 8029.0, "text": "Ja, jetzt haben wir uns das Video nochmal angeguckt."}, {"id": 1290, "start": 8029.0, "end": 8038.0, "text": "Ich konnte ein paar Takte dazu loswerden."}, {"id": 1291, "start": 8038.0, "end": 8045.0, "text": "Haushaltsführende Person. Aha, siehst du mal."}, {"id": 1292, "start": 8045.0, "end": 8052.0, "text": "Find ich toll, dass es da sogar schon Seiten für gibt."}, {"id": 1293, "start": 8052.0, "end": 8057.0, "text": "Haushaltsführende Person."}, {"id": 1294, "start": 8057.0, "end": 8062.0, "text": "Das kann aber auch was anderes mit gemeint sein."}, {"id": 1295, "start": 8062.0, "end": 8069.0, "text": "Mit Haushaltsführend kann man auch... Also es kommt auf den Kontext an."}, {"id": 1296, "start": 8069.0, "end": 8071.0, "text": "Also es ist nicht so einfach."}, {"id": 1297, "start": 8071.0, "end": 8077.0, "text": "Okay Leute, ich bin jetzt schon 25 Minuten über Bett getimed."}, {"id": 1298, "start": 8077.0, "end": 8080.0, "text": "Ich gehe jetzt auch pennen. Wir sehen uns."}, {"id": 1299, "start": 8080.0, "end": 8083.0, "text": "Spontaner Stream heute gewesen. Im nächsten wird er gebastelt."}, {"id": 1300, "start": 8083.0, "end": 8102.0, "text": "Also bis denn. Macht's gut. Bis zum nächsten Stream."}]}