{"text": "Ockchamp, Wettke, ich müsste jetzt mal probieren ob ich es schaffe den ganzen Twitch-Streamnur in Emotes zu sprechen. Wahrscheinlich. Das Schlimme ist, wahrscheinlich würde ich dassprechen kriegen. Ja Leute, Twitch hat so nicht kapiert, dass der Stream,und jetzt wartet mal, ich refresche mal kurz die Anzeige bei mir auf dem Vorschaumonitor. Moin. DieAnzeige geht noch nicht. Ah, jetzt hat Twitch mitgekriegt. Angeblich sind es 0 Zuschauer,was ja nicht sein kann Leute. Da sind quasi 3 durch 0. Gleich ist Twitch kaputt. Und wir sinddran schuld. 4 durch 0, 5 durch 0. Schwierig. Oder wie sagt man da heutzutage zu belastend?Oder ist es schon wieder aus? Ich glaube, das sagt man heute auch nicht mehr. Wo ist der Kabum?Das ist eine gute Frage. Wir haben eine Weile schon nicht mehr miteinander gesprochen. Ichhabe keine Ahnung. Ich vermute mal immer noch in Frankfurt irgendwo. Naja, übrigens heute. Heutemachen wir was ganz Tolles. Heute machen wir den Internetführerschein. Es gibt einen neuenInternetführerschein. Aber ich warte jetzt erst mal bis der Stream richtig on ist. Das wird was,ich sage es euch. Ja, das Bundesinnenministerium hat einen neuen Internetführerschein rausgebrachtund den machen wir heute. Hat 6 Kategorien in 3 verschiedenen Schwierigkeitsstufen. Nein,er ist ergeblich wirklich ernst gemeint. Ich habe nur meine Zweifel, ob das wirklich so ist.Ich weiß nicht, bin mir nicht so sicher. Tribulon, danke für den Sub. Take Viagra, die Hard. Dankefür den Sub. Huge Pog. Du bist zertifizierter Datenschutzbeauftragter. Huge Upgrade. KarrierePass Upgrade. Gut, ich hoffe du kriegst wenigstens jetzt da was. Ich hoffe es lohnt sich wenigstens.Zumindest ist es schon mal nicht schlecht zu haben. Hast du denn auch den neuen Internetführerschein?Wenn nicht, den machen wir heute Leute. Du hast auf der Seite 404, ernsthaft ist das schon wiederkaputt? Probieren wir gleich aus, probieren wir gleich aus. Vorhin ging es noch. Vorher hat es nochfunktioniert. Das ist Haaresträumen teilweise, was da drin steht. Da steht drin Herr Stephaniebeauftragt sie. Da haben wir wie fünf Leute zusammen an einer Frage geschrieben. Ist ganzgrausam. Gut, vielleicht gibt es auch einen Herr Stephanie. Heutzutage kann man sowas ja nichtmehr assuming. Dann ist ganz schnell der Spaß vorbei, wenn man sowas macht.Bei nur der Schul und Arbeit habe ich schon ach so, na dann. Der Pog, der Internetführerschein,der ist ganz wichtig ja. Soll ich euch mal was erzählen Leute? Oh nein, Avira will mirmit der Premium aufschwätzen. Warum habe ich diesen Scheiß überhaupt noch auf dem zweitenRechner installiert? Das ist so useless. 10 Monate, danke für den Zapp. Was Cross TalkSolutions hat heute UI Notify gelauncht. Äh, was, wie? Ist das G-Bait? Das ist doch Werbung,oder? Das ist doch Werbung. Ist das Werbung? Sascha, ist das, ist das, ist das verpackteWerbung? Es soll keine Werbung sein, es liest sich aber wie Werbung. Ja, Kommentare gelöschtkann auf YouTube alles bedeuten. Da weiß man nicht so genau. Früher landeten die Kommentareauf YouTube in so einem Bereich, wo man dann als Content Creator gesehen hat, dass Kommentaregeplockt wurden und man konnte die wieder freigeben. Aber mittlerweile landet die meistens,das meiste Zeug gar nicht mehr da. Was ist der Kollege in der Firma, wurde jetzt Kasperskyentfernt, weil ich aus Russland komme. Kappa HD, ja. Kommen die überhaupt aus Russland?Waren die nicht irgendwie aus, irgendwie nur aus, warte mal, Kaspersky-Antivirus. Warendie nicht irgendwie aus Litauen oder sowas oder bringe ich das jetzt durcheinander? Ja?Okay, ne, dann bringe ich das durcheinander. Tatsächlich. Ne, die kommen wirklich nichtaus Russland. Ich dachte, die kommen aus Litauen, mit was verwechsel ich die denn? Fällt euchirgendetwas aus Litauen ein? Wahrscheinlich bin ich komplett neben der Spur. Moment, was?In welchen Programmiersprachen ist das geschrieben? C++ und Nämmerle? Was zum Teufel ist Nämmerlefür eine Programmiersprache? Äh, das ist quasi ein Fake C-Sharp für.NET. Boah ne,F-Sharp-Abklatsch. Ne, ne, ne, ne. Das will ich mir gar nicht weiter angucken. In wasdas alles programmiert ist? Nämmerle, habe ich schon nie gehört. Aber gut. Kasperskywird es schon wissen. Ja, ich wollte euch ja was als... Warum ist denn das jetzt da untenrot? Ist das jetzt normal, wenn man streamt? Normalerweise früher war das immer nur rot,wenn man recordet. Ich vermute mal, dass es jetzt auch rot ist, wenn man... Das hat michjetzt irritiert, will ich, dass meine Festplatte gleich voll ist, weil ich habe nicht mehrso viel Platz. Es ist ein bisschen eng auf manchen meiner Laufwerke. Also hier ist esein bisschen eng. Da ist es ein bisschen eng. Da ist Platz, aber da ist... Weiß nicht sogenau. Mir war so... Ich wusste es. Ich wollte es nicht sagen. Ich wusste, als ich es ausgesprochenhabe, wusste ich, dass irgendjemand schreibt, entweder ein bisschen eng, Gachi Bass odereng ist gut. Irgendwie sowas. Es war mir jetzt so klar. Ich kenne den Chat mittlerweile. Ichweiß halt schon Bescheid, was da los ist. Manchmal ist mir es schon klar, während ich was ausspreche,weiß ich, da kommt jetzt das und es ist immer... Meistens so. 99% der Fälle.Hast noch 2TB auf einer Platte frei. Soll ich dir meine 1TB Platte schicken, die ich beimeiner letzten Kiste aus Versehen mitgeordert habe? Seagate Barracuda 1TB. Wobei, das Versandkostensind teurer, als die Festplatte in Prime bei Amazon zu bestellen. Ah, der Preischamp. DerPreischamp ist offline. Der Preischamp, den gibt es nicht mehr. Den Preischamp, da solltestdu eigentlich noch nicht mal einen 404 kriegen. Beim Preischamp solltest du eigentlich... Achso, ich habe Cloudflare noch nicht gelöscht. Deswegen gibt es den 404. Oder habe ich Cloudflareschon gelöscht? Sehen wir gleich. Bilde mir eigentlich ein, ich habe alles schon gelöscht,aber habe ich Cloudflare vielleicht nicht gelöscht. Na gut. Soll ich euch mal was erzählen? Übrigens,ich zeige euch erstmal, was wir heute machen. Der Defu. Digital. Ne, ne. Ne, ne, ne. Wiehießen die? Defu. Doch, der Defu. Ach, sie haben sogar eine... Guck mal. Defu.de habendie sogar. Eine Umlautdomain. Hier. Eine Emoji-Domain. Also mit diesen Escapes kannman auch Emoji-Domains machen. Guckt euch das mal an. So. Das machen wir gleich. Dasmachen wir gleich. Aber vorher muss ich euch noch was erzählen. Könnt ihr euch noch dranerinnern? Ihr habt mich sogar letzten Sonntag danach gefragt. Könnt ihr euch noch dranerinnern, als ich euch erzählt habe, ich musste letzten Montag was präsentieren auf der Arbeit.Wobei, was heißt ich musste? Ich habe das sogar freiwillig gesagt. Ich mach das. Undich muss was präsentieren. Und ich habe euch ja auch erzählt, ich werde mich wahrscheinlichnicht sonderlich beliebt dabei machen. Könnt ihr euch wahrscheinlich noch dran erinnern,weil es haben mich sogar am Sonntag viele gefragt. So, und Max, wie lief es denn? Undam Sonntag habe ich noch gesagt, jawoll, lief wunderbar. Und heute, Leute, ich sag euch,wir wurden heute, ich hab das ja mit einem Kollegen zusammen gemacht, alter Patrick,35 Monate Hyper-Subscription, jetzt geht's ab. Richtig, Pog, dankeschön. So, wo binich stehen geblieben? Genau, und heute, und heute, wir wurden übertrieben gelobt. Daserlebt man bei mir auf der Arbeit selten, ja. Wir wurden übertrieben gelobt, wie tolldas war, dass wir das präsentiert haben. Und es hat manchen Leuten die Augen geöffnet.Und da habe ich mir auch schon gedacht, easy clap. Wisst ihr, wisst ihr, wisst ihr, waseigentlich, was wir eigentlich gemacht haben? Wir haben eine halbe Stunde eigentlich durchgängigerzählt, wie kacke so eine gewisse Sache ist bei uns. Aber anscheinend musste das malsein. Was hast du präsentiert? Ich muss mal kurz gucken, wie ich das am besten überschreibe.Ich habe über die Probleme beim Remote-Arbeiten berichtet und wie bei uns Sicherheit und Bedienbarkeitin Konflikt steht. Ich glaube, so kann man das ganz gut beschreiben. Weil es wird immerabge... Leute, ich erzähle euch was. Pass mal auf, pass mal auf. Eine absolut abgedrehteAusgeburt der Hölle, die sie sich jetzt überlegt haben bei uns auf der Arbeit. Also, damit dubei uns auf wichtige Systeme kommst, Remote, wenn du Homeoffice machst oder sowas, kannstdu nicht einfach nur dich irgendwie connecten oder kommst du überall hin. Nein, das istein bisschen komplizierter gemacht, was ja prinzipiell auch kein Problem ist. Du verbindestdich per Zwei-Faktor-Authentifizierung auf ein Portal. In diesem Portal... Ja, ich habemir das schon gleich aufgeschrieben in meinem Dokument. So, in diesem Portal machst dudann eine Shitrix-VM auf und von dort kannst du dich dann connecten. Da ist auch ein bisschenmehr drumherum, aber ich will jetzt nicht alles genau erzählen. So, das war schon in der Vergangenheitein bisschen gewöhnungsbedürftig. Aber das war insofern okay, weil man das meistens wirklichnur für Admin... Also, für Live-Administrationszeug... Es ist mega clunky und laggy as fuck. FürAdmin-Administrationszeug gebraucht hat und Wolle, danke schön für den Sub. Und deswegenes ging. Man konnte sich dann auch irgendwie tunneln, auch wenn es nur so Grauzone war,ob das überhaupt erlaubt ist. So, aber jetzt haben sie den Vogel abgeschossen. Die ganzeZeit war das so, für Datenaustausch konnte man entweder VPN verwenden, also was weißich, wenn ich irgendwelche größeren Sachen irgendwie rumkopieren muss. Sei es, dass dieSekretärin irgendeine 50 MB Excel-Datei kopieren muss oder dass man Logs mal rumkopieren mussoder so. Also, für Datenaustausch hatte man Folgendes. Entweder VPN oder man konnte dasNotebook aus der Firma mitnehmen oder sich so geheim schicken lassen, wenn man da Homeofficehat. Oder man hatte eine normale Office-VM, auch über Shitrix. So, und da gab es dannein gemeinsames Windows-Share für seinen User. Und die Musik ist ein bisschen lauter. Außerdemist die Musik äußerst nervös. So. Die ist mir immer noch zu nervös. Die mag zwarhappy sein, ja, viel besser. So. Und dann haben sie sich... Irgendwie ist die Musikjetzt zu nervig gerade. Okay. Gut. Wunderbar. Also, wo bin ich stehen geblieben? Ja, alsodu konntest das Datenaustausch noch halbwegs normal machen. Du hattest so einen Windows-Sharefür deinen User und da konntest du Zeug drüber kopieren. Das war auch relativ schnell. Istalles okay gewesen. So. Und jetzt kommt der Hammer. Das war so auch mit der Steine desAnstoßes. Als ich gesagt habe, jetzt reicht es, kann ich nicht mehr arbeiten. Ich kannmich auch gerne hinsetzen, ohne was zu machen und ihr gebt mir Geld. Aber das kann so nichtsein. Man hat sich jetzt Folgendes überlegt. Jetzt haltet euch fest. Wir ersetzen, alsosie ersetzen den Windows-Share durch OneDrive. So. Und jetzt erzähle ich euch mal ein wirklichpraktisch so passiertes Anwendungsszenario. Ein Kollege von mir, das habe ich euch jaschon mal vor einer Weile erzählt, dass wir in der Richtung was gemacht haben, hat, hat,hat, ja ja OneDrive, OneDrive. Ein Kollege von mir hat Hilfe gebraucht bei Log-Auswertung.Der hatte glaube ich irgendwie zwei Terabyte Squid-Logs. Und die Squid-Logs sollten durchsuchtwerden, ob irgendwelche speziellen Aufrufe drin sind, um daraus ableiten zu können,ob Firewall-Regeln noch gebraucht werden. Ist egal warum. So. Zumindest Squid-Logs durchsuchen.Also was haben wir gemacht? Haben wir gesagt, hey das haben wir doch schon mal gemacht. Ichhatte nämlich, er hatte das damals in Bash programmiert. Und ohne Scheiß, Bash hat eineWoche die Squid-Logs durchsucht. Eine Woche Leute. Eine Woche. So. Danach sind wir hingegangen,haben ein.NET Programm gebastelt. Multithreaded 24 Kerne auf einer richtig fetten Kiste. Multithreaded24 Kerne. Das meiste auch noch irgendwie 128 Gigabyte RAM. Das meiste eben RAM gehaltenmit einem Dictionary gedifft, gemacht, geguckt, gezählt, gecounted. Am Ende lief es irgendwie40 Minuten oder so versus eine Stunde. Also 40 Minuten Programm in C-Sharp Multithreadedversus eine Woche in Bash. Das kann durchaus sein. Bash ist nicht sonderlich effektiv.Vor allem wenn man das auch noch ein bisschen umständlich macht. So. Und das war, das warder Plan. Wir haben gesagt, weißt was, haben wir doch schon mal gemacht. Wir nehmen einfachdieses Programm und passen das, passen das an für den neuen Anwendungsfall. So. Und jetzthaltet euch fest. Jetzt, jetzt kommt's. Mein, mein Datenaustausch. Wie lange habt ihr daranprogrammiert? Das ist nicht sonderlich kompliziert. Zwei, drei Stunden. Das war nicht, ist keingroßer Akt gewesen. Zumindest. Dadurch, dass ich jetzt keinen Share mehr habe, den ichirgendwie von einem Notebook verwenden kann, von einer VM verwenden kann, von einer Administrationskisteverwenden kann. Ich hab keinen Windows Share. Also ich hab keinen Share mehr. Musste ichjetzt folgendes machen. Als erstes musste ich mir eine Beispiel-Log-Datei ziehen. Dasging nicht. Weil der Virenscanner gesagt hat, die Datei ist größer als 30 MB, wird abgebrochen.Ist bestimmt Ransomware. So. Also Testlogs ziehen hat schon mal nicht funktioniert. Okay.Aber jetzt kommt, jetzt kommt, jetzt kommt der absolute Hit. Jetzt kommt der absoluteHit. Ich hab dann, weil ich es ums Verrecken nicht machen konnte, mit der, mit der VM,die mir die Firma zur Verfügung stellt, hab ich lokal bei mir eine Ubuntu VM gebootet,mit Rider und allem, was ich an Entwicklung brauche für.NET Programme, hab mir ein Log-Auszugkopiert, 10 MB, und hab das angepasst, das Programm. So. Also allein schon, dass ichdas auf einer privaten VM machen muss, ist halt absolut lächerlich, dass die Firma dasdann auf die Reihe kriegt. So. Und jetzt, und jetzt, und jetzt, und jetzt kommt wirklichder Hit. Das war, ich war fertig, hab's kompiliert, und wir wissen ja, sobald's kompiliert, funktioniertdas auch, und jetzt war die Frage, wie kriege ich dieses Programm denn auf die fette 24Kerne Kiste drauf, wo die Logs draufliegen zum Auswerten. Ich hatte keinen gemeinsamenShare mehr, und ich hab allen Ernstes, jetzt, kein Witz, ich musste mich lokal auf meinerUbuntu VM in meinem OneDrive einloggen, das Programm dort hochladen, dann musste ichmich über eine Shitrix-Administrations-VM verbinden, dort das Programm runterladenvon OneDrive, dann per SCP auf den Produktionsjump-Host kopieren, von dort auf den Server kopieren,und dann starten, und dann feststellen, und dann feststellen, dass ich was vergessen hab,und wieder von vorne. Ohne Scheiß, das hat zwei Stunden gedauert, für fünfmal kompiliertund dann so. Das war der absolute Over-Up-Fuck. Einziger Workflow, ja, richtig geil, das istso der übende, richtig krasser Business-Enterprise-Workflow, ne? Musst du dich auch mit Microsoft Accessnein, zum Glück nicht. Richtiger Lean-Up, safe, safe und lean ist der, ja. ITIL zertifiziertauch noch, DIN ISO 9001, alles auf einmal. So, und ganz ehrlich, da war der Punkt erreicht,wo ich gesagt, Leute, ich kann so nicht arbeiten, also erst will ich so nicht arbeiten, ich kannauch so nicht arbeiten, und das müssen wir jetzt mal ein bisschen an die größere Glockehängen. Und deswegen haben wir das letzte Woche vorgestellt auf einer abteilungsübergreifendenSecurity-Runde, da waren alle möglichen Abteilungsleiter da, und die sind der letzten Montag da irgendwieaus allen Wolken gefallen. Und heute hat uns dann jemand erzählt, dass das halt eben eineganz tolle, augenöffnende Präsentation war. Was im Endeffekt heißt, ihnen war gar nichtklar, wie beschissen das ist, was sie da gebaut haben. Oh man, die, aber muss ich sagen, alsoentweder ist das die Standard-Taktik, so nach dem Motto, boah habt ihr gut gemacht, wirschmeißen euch jetzt raus, oder die fanden das wirklich gut. Kann ja sein, ja. Zumindestscheint ihnen klar zu sein, aber ich hab auch wirklich, ich hab, wir haben denen auch wirklichalles, alles aufs Brot geschmiert. Also die Präsentation lief ungefähr so ab, also ganz,ganz grob, wir haben gesagt, ja hallo hier Max, und hallo hier Dings, mit dem ich dasgemacht hab, die meisten kennen uns ja, aber wir sind jetzt auch mal hier am Start, undheute müssen wir ein bisschen meckern, und das und das und das kommt heute. Und dannhab ich gleich mit dem richtigen Knaller gestartet, ich hab einen Screenshot gemacht, als meineAdministrations-VM das letzte Mal zu wenig RAM hatte und mein Browser gecrasht ist, habich gleich gescreenshotted, ich hab sogar extra ein GIF danach noch gemacht, von denDingern, die abgekackt sind, da hab ich gesagt, so die Admin-VM, langsam, laggy, copy-pastegeht nicht, und manchmal verliert man seine Arbeit, weil es crasht. Und da konnten sichauch irgendwelche Excel-Schubser relaten dazu und haben das verstanden. Das ist keinegute Idee. Ja, und dann haben wir danach noch, danach hat mein Kollege übernommen, undnein, die Präsentation hatte nur Emojis, keine Twitch-Emojis. So, zumindest, danachhab ich gemeint, so ich übergebe jetzt mal kurz hier an meinen Kollege, ich sag jetztden Namen nicht, weil ich kann sagen, Tim heißt er, das ist ja nix, nix, nix, geheimes,also ich übergebe jetzt an den Tim, und der erzählt jetzt noch mal die vielen Kleinigkeiten,die an der Admin-VM nerven, da hat der Tim angefangen, und ohne Scheiß, vier Seiten,vier Seiten, erster Punkt, zweiter Punkt, dritter Punkt, vierter Punkt, fünfter Punkt,sechster Punkt, da hat er das auch so richtig durchgerannt, vier Seiten, einfach so infünf Minuten, bam, bam, bam, bam, mit Punkten drauf, die alle kacke sind, und danach hatdenen schon der Kopf geraucht, da haben wir gesagt, was, so viel ist da im Arsch, da binich noch mal dran gekommen und hab noch mal, da hab ich das Beispiel gebracht mit dem OneDrivekopieren, und noch ein anderes Beispiel, und ich glaube, spätestens dann war vorbei, ichglaube, da hatten wir uns alle insofern überzeugt, dass das so wie es jetzt ist, absolut kackeist. So, und warum erzähl ich euch das Ganze jetzt, nicht nur weil wir irgendwie, nichtnur weil sie uns super gelobt haben, was ich natürlich immer tolle finde, ja, kann ichgleich, sag ich gleich was zu, nein, nein, noch viel besser, typische Business EnterpriseMove würde heute versucht, die haben uns erstmal, die haben uns total gelobt, habengesagt, oh, war ja richtig, hat die richtig Augen geöffnet in die Präsentation und sonstwas, hab ich schon gedacht, oh nein, freut mich, freut mich, und dann kam die Frage,und jetzt haltet euch fest, das ist so die typische Business Enterprise Frage, dannwollten sie uns fragen, so ja, ob wir denn dieses Thema jetzt auch weiter vorantreibenkönnen, da hab ich mir so gedacht, nee, das dürft ihr schon schön selber machen, ichtreib doch nicht, ich guck mal, ich schreib mir doch nicht dieses Drecks Thema auf dieFahne, allen Ernstes, ob wir das Thema jetzt weiter vorantreiben, ich glaub, es geht los,ja.Das einzige, wozu wir uns haben breitschlagen lassen, ist, dass wir jetzt, dass wir jetztals Ansprechpartner uns bereitstellen, wenn es Updates für diese Administrations-VM gibt,und ob wir, dass wir die dann testen, wenn es sie dann gibt, ja, aber ganz bestimmt treibeich jetzt diesen Mist nicht weiter voran, das ist überhaupt nicht, das ist erstensüber meiner Gehaltsklasse, das ist auch überhaupt nicht mein Ding, ich will damit auch nichtszu tun haben, ich will es einfach nur benutzen, weil ich unterm Strich einfach nur arbeitenwill, ohne dass es mich die ganze Zeit abfuckt, ach, zu scheiße, naja gut, wie alt bist du,ich bin 37, ja, 37, ich bin 1984 geboren, ja, aber jetzt was zu dieser Frage, bevorwir dann den Internetführerschein machen, ja, das hat weder mit DevOps noch mit Entwicklungnoch mit sonst was zu tun, das ist Infrastruktur bereitstellen, das hat mit meinem Zeug überhauptnichts zu tun, zum Glück, ich hätte es überhaupt nichts, ich hätte mir garantiert keine Shit-Tricks-Geschichtehingestellt zum Remote-Arbeiten, so, hier Radiosignal-Frag, habe ich das richtig verstanden,du programmierst unter Linux mit C-Sharp, kompilierst und schiebst dann das Programmauf dem Windows Server, nein, nein, nein, das sind Linux-Kisten, alles Linux, wir habenzu 99% Linux bei uns, Red Hat, Red Hat-Kompatibel, sagen wir es mal so, gibt da nicht viel,außer CentOS, was es sein könnte, ne, es gab mal, früher gab es Scientific und jetztgibt es Rocky, Rocky, ich weiß nicht, ob Rocky, irgendjemand schon Rocky Linux im Einsatzhat, ne, Susie, Susie ist bäh, ne, Red Hat-Kompatibel bedeutet im Endeffekt nur, es ist quasiein Red Hat mit Red Hat-Logos entfernt, das sind die Red Hat-Sources neu kompiliert, ohnedie Copyrights-Sachen drin, ich habe nicht studiert, nein, ich habe mal 2007 fachinformatischerSystemedikation gelernt, ne, ne, aber das sind alles Linux-Kisten bei uns, wir habenein paar Windows Server, aber da habe ich Gott sei Dank nichts mit zu tun, Wushild StudioCode kann doch Remote Code Developen, über SSH würde das gehen, ne, nicht so einfach,tja, möglich, könnte ich das vielleicht sein, ich mein, ich hab das gleiche Profilfoto,ich höre mich genauso an, ich laber den gleichen Scheiß, ich würd sagen Exposed, oh man, ok,Leute, ja und mein YouTube-Kanal ist auch verlinkt, so, das dachte ich mir, das mussich euch jetzt mal erzählen, jetzt gucken wir, jetzt machen wir den Digitalführerschein,wir müssen erst mal gucken, ob die Seite im Darkreader besser aussieht, naja, zumindestkriegt man nicht gleich Augenverbrennung, wenn man sich die Seite anschaut, so, alsodas ist jetzt neu, das gibt es seit heute, kannst du dich noch an mich erinnern, werbist du denn auf YouTube, wahrscheinlich nicht, es gibt ein paar an, die kann ich mich erinnern,oder es gibt ein paar Namen, wenn ich die sehe, kann ich mich dran erinnern, aber beifast 300.000 Abonnenten ist es schwierig, da jetzt im Detail jeden zu kennen, ist ja klar,das ist echt, nein, das ist echt, es gibt jetzt wirklich seit heute, gibt es einen neuenInternetführerschein, du dachtest, wir sind alle deine Freunde, ja ihr seid so, also wennihr Primes habt, können wir darüber reden, aber genauso wie Bibi zufällig die Uhr, diesie vorstellt, heute im Laden entdeckt hat und nicht dafür gesponsert wird.Heißt er auf YouTube HelpfulGuy, einer deiner größten Fans damals, keine Ahnung, also dasist schon so lange her, weiß ich nicht, sagt mir jetzt nichts, aber trotzdem schön, dassdu deine Wege hierher gefunden hast.Cringe wenn ich seine Abonnenten kenne, sage ich dazu nur, ja also es war kein Memetitel,ich mache heute wirklich den neuen Digitalführerschein, so und was das sein soll ist, das ist vomBundesinnenministerium ein neuer Online, wie nennen wir das, Fortbildungslernplattformmit Tests, wo man dann angeblich, so schwebt es denen vor, ich habe da ja so meine Zweifelwenn ich ehrlich bin, woran man dann auch für den beruflichen Weg, also quasi fürJobsuche und sonst was, sein Digital und Internet Knowhow unter Beweis stellen kann, so das sagendie, nachdem das nicht das erste ist in dieser Richtung und die letzten Versuche in dieserRichtung ziemlich beschissen waren, um es mal klar zu sagen, habe ich meine Zweifel,dass das was taugt, aber das gucken wir uns jetzt erstmal an.Moritz danke für den Sub, Lukas danke auch dir für den Sub, 2 Monate Cute Subscriptionhier, aber die sind modern, die sind modern, es ist Beta, es ist Beta, nicht Sigma, esist Beta, ob da der EU Kommissar, der Oettinger für Digitalisierung oder Digital, bestimmtwar da der Oettinger mit am Start, Deutschland sicher im Netz, so loslegen, wir gucken unses jetzt an, Bäm, also, zum DeFi-Lernangebot, wie möchtest du den DeFi nutzen, ok, wasist der Unterschied, beruflicher Kontext, die Arbeitswelt bringt ihre ganz eigenen Herausforderungenmit sich, unser Lernangebot im Beruf, die bietet ihnen Inhalte, die speziell daraufzugestimmt, alles klar beruflicher Kontext, easy, Level 1, ne wir machen mal, wir machenmal eine Sache, wir fangen mal an, warum alles so groß ist, weil mein Browser auf, wobeider ist auch sonst relativ groß, wir fangen mal privat Level 1 an, nur mal so, just forfun um ein bisschen zu kecken, was die, wie die Fragen so sind, so und dann gibt es dannmehrere Kategorien mit jeweils 8 Fragen, Geräte, Internet, Kommunikation, Datenwelt,Gefahrenschutz, Technologie Alltag, so und da kann man jetzt wohl irgendwie einen Testmachen, wir machen jetzt einen Test, jetzt müssen wir uns registrieren, POGChamp, N-Minute,Mail, jawoll, UAS, E-Mail-Adresse, Zack, ich brauche noch kurz ein Passwort random generate,Leute ich random generate jetzt ein Passwort, passt mal auf, exellent, boah das ist dasrandomeste Passwort aller Zeiten, so, vollschönige Name, Geburtstag, wie Geburtstag noch, 1.1.1900,ja genau, indem ich fortfache Stimmen in RGB registrieren, ja ja, ahja gut, wie, ich mussja nicht mal eine Bestätigungs-E-Mail machen, keine Bestätigungs-E-Mail, was ist denn miteuch los, oh fuck jetzt habe ich zugemacht, wenn ich jetzt noch eine Bestätigungs-E-Mailbrauche bin ich, oh nein ich habe mein Passwort geleakt, shit jetzt könnt ihr euch alle beidie für einloggen für mich, nein, ok ich mache einen neuen Account, so geht das dannnicht, neuen Account, neuen Account, 10-minute-mail, wir machen jetzt einen neuen Account, 10-nut-mail,nein, nein, nein, nein, 10-minute-mail.net, ok das ist jetzt neu, wobei scheiß drauf,was hatte ich denn vorher, ist doch scheiß egal ob ihr das Passwort seht, ich habe sogarmeine E-Mail, Leute hat noch jemand die E-Mail Adresse von eben, ich kacke nur, ich habees zugemacht einfach, egal ich registriere mich jetzt neu, so registrieren, jetzt könnensie sich anmelden, nein, nein, nein, ich will mich neu registrieren, lass mich registrieren,jawoll, neues Passwort, ok, so, ja, Geburtstag, 1.01.2019, ok registrieren, anmelden, E-MailAdresse, jawoll, da sind wir, Pock, was erwarte dich in der Diffi Prüfung, Leute ich glaubeich muss euch Flashbangen, ah mal gucken, was erwarte dich, wann gilt meine Prüfungals bestanden, moment, mindestens 50% der Fragen, was ist denn das für ein Müll, 50%,das kriegst du ja schon mit simplem randomisen hin, normalerweise musst du bei sowas 80 habenoder, oder sowas, oder maximal 2 falsch oder 50, das ist ja mies, ok, ich bin einverstanden,gucken wir uns das mal, das ist jetzt wohlgemerkt, das ist für die oberkacknoobs privat, nurzum warm werden, ja, also, was nutzen Smart Home Geräte nicht zur Datenübertragung, push,was auch immer push in dem Kontext bedeuten soll, keine Ahnung, weiter, was würdestdu sagen, welche Maßnahmen tragen im Smart Home zur Sicherheit bei, regelmäßige Installationvon Updates ist gut, Passwort in der Steuerungs App ist auch gut, Sicherheitsindex einschalten,was ist denn der Sicherheitsindex, hä, ok, ihr wisst es auch nicht, oder, ok, wir lassendas einfach mal, ich hab keine Ahnung, was der Sicherheitsindex ist, schalte den Indexein, ok, was musst du beachten, bevor du dir eine App auf dein Smart Home, äh, Smartphonelädst, ok, Bewertung im Netz zur App lesen, bei schlechten Bewertung die App lieber nicht,ja, das finde ich ist eine gute Idee, Kosten überprüfen nicht, alle Apps sind kostenlos,ja, vor dem Laden Cookies prüfen, ich mein, kann man machen, aber wozu ergibt in diesemKontext wenig Sinn, ok, weiter, der Herr Demir hat eine Wetter App auf sein Smartphone heruntergeladen,diese fordert die Berechtigung ein auf das Adressbuch, oh nein, die russischen Hackersind am Start, zuzugreifen, gekommenet, das ist die gehackte Wetter App, also, ähm, Leute,ich muss mal kurz husten, es ist übrigens schon besser, danke für die Nachfrage, letztenshaben ganz viele sich dafür interessiert, ob alles wieder gut ist, husten, schon deutlichbesser, viel, viel besser, ok, also, Herr Demir hat eine Wetter App auf sein Smartphone heruntergeladen,diese fordert die Berechtigung ein auf das Adressbuch im Smartphone zuzugreifen, sollteer der App Bewertung die Berechtigung gewähren, nein, das braucht kein Adressbuch, aber mittlerweilegehört es da zum guten Ton, dass du zig Berechtigungen anfragst, ja, Telefonberechtigungen, Standortlokalberechtigungen,Adressbuchberechtigung, alle möglichen, du brauchst einfach Berechtigung, am Endeffektist es irgendeine App, die Cookie-Clicker macht oder sowas, aber machen wir, machen wir,machen wir, nein, die App braucht nur um das Wetter, ok, Drucker, was, ach, soll ich dasjetzt rüber tracken und droppen oder wie, so, boah, also, ich meine, meine Oma hätteden Test wahrscheinlich auch hingekriegt, aber wer braucht schon eine Erklärung dafür,ich meine, scheiß drauf, einfach, einfach oben hinschreiben, 5 von 8, das reicht, ok,Tastatur, App, Vierenschutz, wobei man, wobei es da jetzt schon ein bisschen Grauzone seinkann, Drucker, Monitor, App Store, Tablet, Betriebssystem, alles klar, next, in welchemStore findest du Apps für das Betriebssystem iOS, welches auf iPhones installiert ist,auf dem Microsoft Store, ganz ehrlich, im Microsoft Store findet man auch nicht malDinger auf Betriebssystem, die, wofür der Microsoft Store gedacht ist, also der MicrosoftStore, den kannst du eigentlich immer streichen, so, App Store, wofür steht das W in WLAN,Watt, Wide, Kabel und Wireless, Wire, Wire, das berühmte WLAN Kabel, jetzt wird's, jetztwird's etwa ein C8 von 8, Mo möchte ein Smart Home Grid kaufen, Mo, bestimmt die Abkürzungfür Moritz oder sowas, Mo, erinnert mich an die Diablo 2 Kühe, kann sich da noch einerausreden, Mo, Mo, Mo, Mo, es könnte auch Mohamed sein, richtig, muss nicht Moritz sein, manweiß ja heutzutage nicht, so, und man weiß auch nicht, ob Mo er ist, es könnte ja auchsie sein oder sonst was, Fahrräder und Helikopter, keine Ahnung, also Mo möchte ein Smart HomeGerät kaufen, er ja nicht triggert sein Chat, nicht gleich wieder ausrasten, ja, ziehtes raus, direkt, so, Mo möchte ein Smart Home Gerät kaufen, leider sind die alle sehr teuer,er hat eine viel günstige Kopie eines Geräts bei einem Hersteller aus China, die China-Chinesen,da sind sie, die sollen genauso gut funktionieren wie das Original, soll er zuschlagen, ja,soll er, ich meine, die wollen wahrscheinlich sagen, dass man das nicht sollte, aber ihrkennt mich, also die richtige Antwort ist, also die Antwort, was die hören wollen istA, die richtige Antwort ist aber eigentlich B, jetzt könnte ich meinen AliExpress AffiliateCode hier mal unter die Leute bringen, den ich nicht besitze, also gucken wir uns maldie Antworten an, nein, Smart Home Geräte sollte man nur von seriösen Herstellern beivertrauenswürdigen Händlern kaufen, Kopien aus China haben leider oft Mängel in der Sicherheitoder in der Qualität, also ich kann euch eins sagen, Smart Home Geräte, wenn man nichtweiß, was die genau machen, beziehungsweise custom Firma vielleicht und sonst was, duweißt nie, was die normalerweise, also was die machen und du weißt auch nie, ob die Sicherheitsmängelhaben, du kannst davon ausgehen, dass so ziemlich 90% dieser normalen Smart Home Dinger, diedu daheim hinstellst, haben Sicherheitsprobleme, ich möchte nur mal daran erinnern, die Leute,die Wisecams hatten, da waren die Streams öffentlich über den China-Chinesen-Serverabrufbar und dazu kommt, selbst wenn ich mir jetzt hier bei Amazon.de ein Gerät von einemdeutschen Hersteller, nennen wir mal Hammer aus Bayern, Hammer, wenn du da von denen eineSteckdosenleiste kaufst, das ist exakt die gleiche Steckdosenleiste wie von den China-Chinesen,das weiß ich, weil ich mir absichtlich die Steckdosenleiste von Hammer gekauft habe,weil es die baugleiche China-Chinesen-Steckdosenleiste ist, wo ich Custom Firmware draufflaschenkann, nur, dass Hammer das glücklicherweise so gemacht hat, eine uralt Firmware draufzu machen, sodass sie noch flashbar war, so, also ja, er sollte zuschlagen, die Technikist ja die gleiche, also Leute, es ist alles genauso sicher, es ist davon überhaupt nichtssicher, wenn du nicht selbst den Kram drauf machst, okay, wir nehmen die offizielle Antwort,aber die eigentliche Antwort ist ja, Teilprüfung abschließend, bam, easy, huge, easy, way todank, genau, so, wir machen noch eine weitere für die Noobs, was kommt nämlich als nächstes,wir machen noch Internet für Noobs, Leute, den Rest machen wir dann für Profis, ja,aber das Internet für Noobs, das müssen wir noch machen, wir machen noch mal das Internetfür Noobs und dann machen wir beruflich Level 3, bam, also starten, jawoll, was bedeutetprivater oder anonymer Modus im Browser, das hängt ein bisschen vom Browser-Herstellerab, okay, ist dieser aktiviert, werden die Webseiten, die ich mir angesehen habe, nichtin einer Liste gespeichert, das wollen sie wahrscheinlich hören, wobei das so nicht ganzrichtig ist, zum Beispiel hast du im privaten Modus Safari IOS, hast du einen extra PrivateTab und solange du den nicht schließt, hast du eine Übersicht der geöffneten Seiten undsowas in der Richtung, also das wollen sie wahrscheinlich hören, ist aber nicht ganzrichtig, ist dieser aktiviert, werden im Browser keine Passwörter gespeichert, die ich aufWebseiten eingebe, es werden normalerweise eh keine Passwörter gespeichert, die ichauf Webseiten eingebe, außer ich sage explizit, ist dieser aktiviert, werden meine Webcamabgeschaltet, schaltet der private Modus die Webcam ab, nee, oder, ist dieser aktiviertmit meiner IP Adresse geändert, also die Nummer, mit der sich meine Geräte im Internet identifizierenund über die HackerInnen, das ist ganz wichtig an der Stelle, auf mein PC zugreifen können,es hängt vom Browser Hersteller ab, normalerweise nicht, aber wenn du sowas wie Opera verwendestmit China-Chinesen VPN, die haben ja so Funktionen drin, also ich würde es jetzt mal so lassen,mal gucken, ob die damit einverstanden sind, was ist kein Browser, Exploration, Safari,Chrome, Firefox, Exploration, Herr Müller akzeptiert immer alle Cookies, wenn er eineWebseite besucht, welche Konsequenzen hat das, wahrscheinlich gar keine, wenn man ehrlichist, es passiert nichts weiter, wenn der Anbieter, was denn der Anbieter erfährt nicht, aufwelchen Unterseiten Herr Müller sich wie lange aufgehalten hat, was, äh, also, du hastschon die Möglichkeit zu tracken, prinzipiell über irgendwelche JavaScript-Geschichten,wie lange einer sich eine Seite anguckt, aber, hä, das habe ich Cookies überhaupt nichtszu tun, ist die Webseite ein Online-Shop und hat er Waren in seinen Warenkorb gelegt, kanner die Bestellung auch einen Tag später abschicken, wenn sein Warenkorb wird beim zweiten Besuchwieder hergestellt, ja, das kann man mit Cookies machen, das geht, das kann man mit Cookiesmachen, das, das geht mit Cookies, das geht aber auch noch anders, aber mit Cookies gehtdas auch, Herr Müller bekommt auf verschiedenen Websites, zum Beispiel im Suchmaschinen immerwieder Werbung angezeigt, die ja zu seiner letzten Bestellung im Online-Shop passen, ja,das muss auch nicht zwangsläufig über Cookies gemacht sein, aber wahrscheinlich oder wieauch immer, yes, yes, also, ich lasse es jetzt einfach mal so, äh, das mit den Unterseiten,keine Ahnung, die sind sehr vage, das erinnert mich an die Leute, ich muss mein Headset malkurz entknoten, äh, das hat Aussetzer, das sackt, so, ich bin wieder da, ok, wir lassenes jetzt einfach so weiter, was ist keine Suchmaschine, ah, Firefox, jetzt hätten siemich fast gebaited, fast, fast wäre der gebaited raus gewesen, äh, was kannst du mit deinemBrowser machen, Dateien und Ordner auf deiner Festplatte sortieren, im WWW auf Webseitensurfen, ja, das auf jeden Fall, dein Rechner auf Virenbefall prüfen, ja, aber das wollensie wahrscheinlich nicht hören, ich sag mal Virus total oder sowas, also, ja, du kannstmit deinem Browser auch Rechner auf Virenbefall prüfen, aber das wollen sie wahrscheinlichnicht hören an der Stelle, den Verlauf deiner besuchten Webseiten löschen, ja, das kannich auch mit einem Browser machen, wobei das eher nicht so der Hauptanwendungszweck einesBrowsers ist, weiter, äh, wo kannst du bei deinem Smartphone zwischen WLAN und mobileInternet umschalten, ja, das kommt, das hängt vom Smartphone ab, ok, wahrscheinlich dashier, wahrscheinlich, aber das hängt ganz entscheidend vom Smartphone ab, das kannstdu so, so, ähm, universell nicht sagen, sollte den Hersteller mal rausbringen, ein Gerät,was Knöpfe dafür hat, dann geht das damit, also, das ist so allgemeingültig, kann mandas überhaupt nicht sagen, weiter, welche Unternehmen betreiben Mobilfunknetze in Deutschland,Telekom, Vodafone, ja, 1&1, GMX und Kongstar, nee, Kongstar ist Telekom, Saturn, Media Marktund Cyberport, nee, das ist Telekom, Vodafone, O2, was ist mit Web, Web 2.0, Leute, Web 2.0ist doch schon wieder, also, das ist komplett, komplett outdated, alter, Web 2.0, wir sind,wir sind Web 4.0, Industrie 8.0, agile, horizontal, diagonalskalierer, serverless, Web, NFT,was auch immer, aber 2.0, also, das Internet ist größer geworden, sodass nun mehr Inhaltehineinpassen, alles klar, das Internet ist mit einem Update aktualisiert worden, sodasses nun sicherer ist, jeder Mensch kann im Internet Inhalte veröffentlichen, was, was, was wolltihr von mir wissen, das letzte, oder, wahrscheinlich C, wahrscheinlich C, Leute, mein Headset hatimmer noch Aussetzer, wartet mal kurz, ich muss es mal kurz fixen und ich muss euch muten,weil ansonsten fliegen euch die Ohren weg, so, ich hoffe, ihr findet alles, ihr könntwahrscheinlich wieder das wissen, okay, Teilprüfung abschließen und, was haben wir richtig, Leute,wir haben Frage 1 verkackt, Frage 1, fail, was bedeutet private oder, okay, ja, meinetwegen,wie gesagt, normalerweise werden die Passwörter eh nur gespeichert, wenn du sagst, ich willnicht speichern, aber in Ordnung, lass ich mir gefallen, so, jetzt upgraden wir, beruflichLevel 3, also, richtig High IQ Modus jetzt aktiviert, Business Class, jetzt wird es heikel,jetzt wird es heikel, ja, hier, Cisco Internet Professional, nein, wie heißt das Ding, CertifiedCisco Internet Engineer, ne, wie heißt das, wie heißt das Oberste von Cisco, NetworkProfessional, ne, CCNA ist das Unterste, CCNA ist das Unterste, das ist Associate, dasmeine ich nicht, gut, also, Prege, Prege, sonst ist die Kündigung direkt raus, wennich das jetzt verkacke, auf geht's, Teilprüfung starten, Level 3 beruflich, übrigens wisstihr, was mir aufgefallen ist, was diesen Test schon instant komplett useless macht, mankann cheaten nebenbei, niemand guckt zu, ich könnte einfach einen Tap aufmachen und nachder richtigen Antwort suchen, jetzt starten, okay, Ubuntu, nein, nein, nein, sorry Leute,wir wissen, ihr wisst genauso gut wie ich, dass das nicht Ubuntu heißt, sondern, sondernChubantu, das verstörendste Video war ja immer noch mal auf YouTube, wo wir danachgeguckt haben, wie das richtig heißt, da gab es ein Video von Nelson Mandela, der dannsagt Ubuntu, und irgendjemand hat dann das Ubuntu Logo dazu gemacht, bloß mit dem Unterschied,Nelson Mandela hatte mit Ubuntu überhaupt gar nichts zu tun, das ist halt ein ganz normalessüdafrikanisches Wort, also Ubuntu ist eine Distribution des Betriebssystems Linux, jawoll,weiter, oh jetzt wird's aber kompliziert, also Herr Meyer ist Administrator in seinerFirma und stellt fest, dass es für das auf allen Firmen-PCs laufende BetriebssystemWindows 7 keine Sicherheitsupdates mehr gibt, ja erstmal direkt Kündigung schreiben, erbespricht dieses Sicherheitsproblem mit seiner Chefin und er hält von ihr den Auftrag aufallen Rechnern in der Firma ein neues Betriebssystem zu installieren, seine Chefin möchte, dassdas neue Betriebssystem Open Source ist, das halte ich für ein Gerücht, das halte ichaber für ein Gerücht, dass das eine Anforderung ist, die von der Chefin kommt, da habe ichmal eine Zweifel, dass das irgendein Chef bzw. Chefin sagen würde, seine Chefin möchte,dass das neue Betriebssystem Open Source ist, für welches wird er sich entscheiden, Androidlogisch oder, übrigens in Chat, wir wissen alle, es heißt nicht Linux, korrekt, der Chathat's wieder, I'd like to interject for a moment, was wir nämlich unter Linux verstehen,ist er in Wirklichkeit eigentlich GNU slash Linux, lasst es mal nicht Richard Stelman,wie spricht man den Typen überhaupt aus, Richard Stelman sehen, dass da einfach nurLinux steht, es ist GNU slash Linux, spricht man das überhaupt GNU aus oder muss man dasGNU oder so aussprechen, GNU plus Linux, okay, Linux, ihr könnt doch Android nehmen,wobei Android mit Open Source jetzt alles so weit her ist, weiter, im Büro von Frau Meierist das Netzwerk ausgefallen, ob LAN oder WLAN, nichts funktioniert mehr, sie fragtsich, ob sie übergangsweise den persönlichen Hotspot ihres privaten Handys aktivierensollte und über die LTE-Verbindung ihres Handys, ihrem Dienstlaptop wieder mit demInternet zu verbinden, ist das sicher, okay, was sagen sie dazu, nein, bei einem Hackerangriffwäre sowohl ihre privaten als auch ihre geschäftlichen Daten gefilmt, hä, ja, der Hotspot ist sicher,obwohl ihre privaten als auch ihre geschäftlichen Daten sind bei einem Hackerangriff nicht denGefahr, hä, also C, also ich meine, die wollen wahrscheinlich A wissen, aber also ich meine,wenn ihr den privaten Hotspot verwendet, dann ist ja nicht irgendwie die privaten Datenihres Handys in Gefahr, sondern im Zweifelsfall halt, was auch immer sie sich da einfängtauf ihrem Laptop, also im Handy wird wahrscheinlich nichts passieren, aber wahrscheinlich wollensie das wissen, was aber wenig Sinn ergibt, ja, das ist zu high IQ der Fragensteller gewesen,welche Vorteile haben Unternehmen, die auf das Betriebssystem Linux haben, ich findedas gut, sehr viele Linux bezogene Fragen, sehr nice, nicht wie der ganze Windows Excel,der kackt da immer, ordentliche Fragen, Linux ist kostenfrei, das Unternehmen spart Geld,das wollen sie wahrscheinlich hören, ist aber falsch, das kommt ganz drauf an, wasfür ein Linux, wenn man in Red Hat ein richtig echtes Red Hat betreiben will, also auchmit offiziellen Update-Servern und sonst was, da braucht man eine Subscription und das kostetGeld, du kannst ein Red Hat gar nicht wirklich betreiben, ein offizielles Red Hat gar nichtwirklich großartig, also nicht gescheit betreiben, ohne Geld zu bezahlen, Linux ist weniger anfälligfür Angriffe mit Well-Ware, das Unternehmen ist somit geschützter, ok, ja, wollen siewahrscheinlich auch hören, es gibt Linux mehr Programme als für Mac und Windows, vor allemUnternehmen in der kreativen Branche profitieren, nein, das kann es nicht sein, aber wir sinduns ja einig, dieses Jahr ist das Jahr des Linux-Desktops, oder Chet, jetzt ist es soweit,ja, gut, seht ihr auch so, ja, es ist für unerfahrene AnwenderInnen sehr einfach, Hardwarebei Linux zu installieren, AdministratorInnen können das im Grunde MitarbeiterInnen überlassen,das ist so ein schöner Fall von, es macht sich immer lesbarer, da einen DoppelpunktInnen hinten dran zu schreiben, ich meine, man weiß ja auch sowas gemeint ist, es istfür, ok, es ist für Unerfahrene sehr einfach, Hardware, nein, ist es nicht, je nachdem,so ist es, aber Hardware installieren können, AdministratorInnen auf jeden Fall nicht demAnwender überlassen, auch nicht unter Windows, weil ein Anwender schraubt bestimmt nichtseinen Desktop in der Firma auf, baut da irgendwie eine neue Netzwerkkarte ein undmacht wieder zu, die haben schon Probleme, den USB-Stick richtig rum einzuklingeln, alsoVorteile, also, ne, dann muss das weg, gibt es überhaupt AdministratorInnen, ja, gibtes, wir haben sogar welche bei mir auf der Arbeit, also, mir fallen direkt aus dem Kopfdrei Stück aus ganz unterschiedlichen Bereichen ein, wir haben eine bei, ok, iOS-Anwendungsentwicklunghaben wir jede Menge, Zeit, scheiß drauf, iOS-Anwendungsentwicklung haben wir jede Menge,aber das zählt nicht, Windows Active Directory-AdministratorInnen fällt mir eine ein, Datenbank-Admin fälltmir eine ein und Software-Tests und Entwicklung fällt mir eine ein, also, wir haben da durchauseinige, so, weiter, Herr Gradmeier ist der IT-Sicherheitsbeauftragte in seiner Firma,er soll für die Büros einen Sprachassistenten anschaffen, er findet ein Gerät, das alleAnfragen in den USA speichert, ich mein, besser als in Russland oder besser als in Chinaund eins, das alle Anfragen in Irland speichert, welches ist sicher, was, welches ist sichert,das sollte er eigentlich wissen als Sicherheitsbeauftragte, oder, warum müssen wir ihm das sagen, dasGerät, das alle Anfragen in Irland speichert, ja, das ist, das ist richtig, letztendlichist das Beste, was man an der Stelle aber machen kann, sich nicht darauf zu verlassen,wo der ganze Mist gespeichert wird und dass es in die EU ist und sich auch, ja, alle dranhalten und sowas, weil im Zweifelsfall ist das eh alles Scheiß, Schall und Rauch, esist wichtig, dass du den Kram am besten verschlüsselt ablegst, weil dann kann auch keiner was damitUnfug treiben, so, weiter, trage das fehlende Wort ein, hat man auf einem Rechner keineRechte, Programme selbst zu installieren, kann man auf Versionen von Programmen zurückgreifen,Lokale, oder, was wollen die, ah, sie erfordern keine Installation, oh, wie nennt man dasnochmal, portable, ne, portable, ich glaube, ihr habt das richtig geschrieben, StreamerRead Chat, ich musste das nur verschleiern, als ich den Chat gelesen hab, so, weiter,tragen sie die fehlende Wörter ein, möchte man unterwegs mit dem Laptop ins Internetgehen und soll dabei das Tablet oder das Smartphone die Rolle des Routers übernehmen, so mussman in den Einstellungen ein, eh, Hotspot, Hotspot einrichten, das haben die uns dochvorher sogar schon gefragt, weiter, Herr Demir schon wieder, der ist aber aktiv, er hateine, Moment, das, Sekunde, das, das kennen wir schon, Level 3, warum ist Level 3 beruflichdie Frage für die Privatlevel 1 Oma drinne, Scamast, Alter, achso, das ist jetzt multiplechoice, das ist jetzt multiple choice, mehr Antworten, also, dieser Vollbrechner auf dasAdressbuch im Smartphone zuzukehren, sollte er der App, die brechen, nein, nein, die Wetterappbraucht keine Kontaktdaten, so, so will ich mal, ich mein, wozu brauchste, ich mein,das kommt auf die Wetterapp an, wenn die Wetterapp irgendwie Sachen hat wie, zu meinem Terminheute Mittag mit dem Max, wie wird das Wetter an seinem Standort, dann ja, aber es kommtauf die App, auf die App an, so, Teilprüfung abschließen, 100%, huge, Leute, doch keineAbmahnung, easy, easy, easy as fuck, easy, easy as fuck, alles klar, weitere Teilprüfungstarten, Internet, jetzt wird's ernst, oder wie man Opa sagen würde, jetzt wird's haarig,ok, trage die fehlenden Wörter ein, Web-Tools zur Verwaltung von Inhalten auf Webseitennennt man, was, Content-Management-Systeme, wie schreibt man Management, ich schreibeManagement immer falsch, Content-Management-Systeme, ja, weiter, Herr Müller surft im Büro mitseinem Browser auf dem Dienst-PC, ja, was der so alles macht, was bedeutet das, HerrMüller, Herr Müllers PC speichert keine Cookies, ja, Herr Müllers PC speichert alle Cookiesaus Erwerbekookies, ne, weiter, Videoanrufe oder Messenger-Calls belasten auf Dienstreisendas, den Akku, ach, das Datenvolumen, meine Güte, das Klima, das Firmenkonto, ja, dasist doch wirklich eine sehr vage Frage, ich mein, woher soll ich wissen, dass der Typkein WLAN hat, das Gehirn belasten die auch, ja, das ist richtig, es belastet die Leute,wenn er öffentlich telefoniert im Zug, das Daten, wir schreiben einfach Datenvolumen,welche Potenziale bietet der neue Mobilfunk-Standard 5G-Unternehmen und Organisationen, ähm, niedrigeLatenzzeiten für die verzerrungsfreie Kommunikation, was sind eine verzerrungsfreie Kommunikation,in Videokonferenzen oder beim Livestreaming von Online-Produkt-Präsentationen, ok, bestimmt,das wollen die wahrscheinlich hören, Übertragungsraten mit bis zu 10 oder sogar 20 Gigabits, ichhab ehrlich gesagt keine Ahnung, wie schnell 5G ist, aber 10 Gigabit erscheint mir etwasunrealistisch zu sein, dass man das auch, ähm, in der Praxis erreicht, ich hab keineAhnung, ob, ob das theoretisch damit geworben wird, dass das maximal möglich wäre, also100 ist auf jeden Fall zu viel, hohe Latenzzeiten für die verzerrungsfreie Kommunikation, nein,ja, weiter, Herr Meier ist Redaktionsleiter bei einem Verlag und möchte, dass seine Online-Redaktionzukünftig ein proprietäres Content-Management, ich sag mal, ist das Absicht, dass die ihreAntworten sich immer selbst geben, ein paar Fragen hinten dran, was meint er, Moment,was, Moment, was, dass sein Online-Redaktion künftig ein proprietäres Content-Management-Systemist, warum möchte denn der Verlag das, dass es ein proprietäres Content-Management ist,das ist komplett aus der Luft gegriffen, aber ok, was meint er, das CMS ist Quellaufnahme,das CMS ist herstellergebunden, wird dann so vom Hersteller beistellt, die Einsicht, ja,was meint er, trage die fehlenden Wörter ein, sehr paar ist die Abkürzung, Response-Page,Response-Page oder sowas, Leute, ich zeige euch jetzt, ich zeige euch jetzt, warum dieserTest komplett für den Arsch ist, Search-Engine-Result-Page, easy clap, agree, mit welchen Technologienkannst du im Homeoffice oder im Büro anonymer im Netz surfen, Proxy-Server, VPN-Tunnel,was nochmal, mit welchen Technologien kannst du im Homeoffice oder im Büro anonymer, ok,Homeoffice und Büro, das kommt drauf an, was geploggt ist und was nicht, theoretisch könnenda alle vier dazu beitragen, theoretisch können da alle vier dazu beitragen, auch, auch,es geht anonymer, ja, es gibt auch DNS-Server, die sagen hier so nach dem Motto, wir machenkeine Aufzeichnung und sonst nichts, wahrscheinlich ist DNS aus deren Sicht falsch, streng genommenist DNS aber richtig bei dieser Fragestellung, welche Mobilfunk-Standard gibt es nicht 6G,oh wir sind schon durch, mal gucken, mal gucken, was ich hab statt Result-Result-Page geschrieben,mal gucken was er sagt, Teilprüfung abschließen, oh Leute, wir haben verkackt, wir haben verkackt,oh tatsächlich, 5G, das macht in der Praxis im Leben keine 10 Gigabit, im Leben nicht,ich mein das sagt vielleicht die maximale theoretisch mögliche, in der Spezifikationoder so sagen vielleicht 10 Gigabit, aber noch ganz bestimmt nicht in der Praxis,ja Kündigung wird schon geschrieben, ok, das haben wir falsch gemacht und DNS-Server,wir haben es schon vermutet, aber DNS-Server ist richtig, weitere Prüfung starten, Kommunikation,Next, welche nützlichen Funktionen haben Programme wie MetaMouse, Slack oder MS Teams für Unternehmen,Teilen von Präsentationen, mein Headset Leute, das macht mich verrückt heute, warum gehtdas immer aus zwischendurch, ganz ätzend, weiß auch nicht was da los ist, ok, Versandempfangvon Chatnachrichten, Videoanrufe oder Versand von ja, Empfang und Versand von Verschlüssenein, Abonnieren von, ich hab keine Ahnung, ob dieser eines dieser drei Dinger nicht auchRSS Feeds abonnieren kann, Pop-Schutz, ich hab den Schwamm hier liegen Leute, ich habden Schwamm für den Pop-Schutz hier liegen, wir schneiden den dem demnächst aus, so könnenUnternehmen ihren Kundenservice zum Beispiel Bestellung bei Lieferdiensten, regelmäßigeNewsletter oder Infos auch per Messenger anbieten, warum nicht, warum sollen sie das nicht,es ist natürlich vielleicht nicht die schönste, aber bestimmt, warum nicht, nein Messengersind nur für privaten Gebrauch, zugesehen, vorgesehen, nur große Konzerne können diesenService nutzen, kleine und mittelständige Unternehmen, Schwachsinn, ja jedes Unternehmenkann in Messenger einen Unternehmensaccount einrichten und so ihren Kundenservice, hä,hä, was ist das für ne Bescheu, das erinnert mich an die IHK Abschlussprüfung, die wollenwahrscheinlich C hören, aber das kommt auf den Messenger an, ich kann mir auch nen JabberAccount installieren irgendwo, Jabber Account anlegen, kenn noch einer, Jabber Xamp, nenicht Xamp, ne was ist die Abkürzung von Jabber, doch Xamp oder, kenn noch jemand,oder weiter, JellyFour du bist Politiker im, einer Fraktion im Bundestag, sie bekommstmit, wer hat diese Fragen geschrieben, dass deine persönliche Assistentin, weil sie fürdich arbeitet in sozialen Netzwerken sexistisch beleidigt wird, Anzeige direkt, dann ist vorbei,ich empfehle ihr, sich im Internet zurückzuhalten und keine Beiträge mehr zu veröffentlichen,es kommt drauf an, was sie so schreibt, das kommt drauf an, ich empfehle ihr, ihre SocialMedia Accounts zu löschen, ne, das will ich auf gar keinen Fall machen, ich empfehle ihr,sich bei Organisationen wie Hate Aid oder Weißer Ring, oh Weißer, heißt das wirklichWeißer Ring, das ist ja auch schon wieder grenzwertig, fast so schlimm wie Master Branch,so ich empfehle ihr, wahrscheinlich wollen sie das hören, ich empfehle ihr, die Haterpersönlich anzukriegen, ja, ja, immer, immer zurückflamen, aber das ist, das meinen diewahrscheinlich nicht, das meinen die wahrscheinlich nicht, immer zurückflamen und das beste ist,das beste ist, zurückflamen und dann bannen, weil dann sind sie richtig abgefuckt, alsoich glaube, ich hab Erfahrung mit sowas, ne, gerade auch durch YouTube und so was, wenndu Leute richtig abfacken willst, du antwortest denen und schreibst was auch immer und dannbannst du sie und dann haben sie keine Möglichkeit zu antworten und das fackt die sowas von ab,da sind die richtig stinkig danach, ich hab sogar schon E-Mails gekriegt, weil ich Leutegebannt hab, ok, also ich empfehle ihr, meinetwegen, ich empfehle ihr, die Hater persönlich anzukriegen,das würde ich, ganz ehrlich, ja, aber wahrscheinlich wollen sie das nicht hören, ich bitte diegesamte Fraktion der Assistentin beizustehen und ihre Unterstützung anzukriegen, die gesamteFraktion ist klar, ich hänge das erstmal an die große Glocke, ja, das ist ja bescheuert,ich stelle mich im Netz schützend vor meiner Assistentin und biete ihr Hilfe an, das kommtauf den Einzelfall an, das wollen sie wahrscheinlich auch hören, so und ganz ehrlich, das erstehängt ganz entscheidend davon ab, was die so schreibt und was das für Hintergründesind, ja, wenn die auf Twitter geht und keine Ahnung, all men are trash oder irgendwie soZeug schreibt, na gut, dann erwartest du ja oft mal schon eine gewisse Reaktion oderkeine Ahnung, wenn sie unter, kurz gesagt, Videos auf YouTube ihr Onlyfans Profil postetals Werbung, da muss man sich über Beleidigung auch nicht wundern, also es kommt auf denEinzelfall an, die Zeit läuft ab, oh nein, aber wenn ich Politiker bin, müsste ich eigentlichignorieren, ja, okay, weiter, weiter, ich lasse es jetzt einfach mal so, trag das fehlendeWort ein, das Team von Frau Meyer plant eine Videokonferenz zur Präsentation zwei neuer,zweier neuen Produkte, der Satz stimmt eben nicht, oder von zwei neuen Produkten oder zweierneue Produkte, die Teilnehmenden der Videokonferenz können am Ende der Präsentation in zweiverschiedene Chat Rooms wahrscheinlich, Chat Rooms gehen und fragen sich, was Breakout,was soll ja ein Breakout sein, weiter, Frau Meyer bietet in ihrer Firma eine Videokonferenzzur Präsentation, Frau Meyer ist ganz schön umtriebig, oder, Frau Meyer bietet in ihrerFirma eine Videokonferenz zur Präsentation des neuen Geschäftsberichts, an leider sindviele Teilnehmer krank, oh, Monka Corona, sie schlägt vor, die Präsentation mitsamtder Beiträge aller Anwesen aufzuzeichnen, oh, DSGVO, DSGVO, wir haben irgendwo einenDSGVO Emote, Leute, TOS, TOS, DSGVO, ganz, ganz schlimm, sie schlägt vor, die Präsentationaufzuzeichnen und die Videodatei den kranken Teilnehmer, darf sie das, nein, ach so, dabin ich mir gar nicht sicher, ehrlich gesagt, nee, Moment, Moment, ich wollte nicht B, ichwollte C sagen, ja, wenn sie zuvor die Zustimmung aller Anwesen einholt, wahrscheinlich, dieSache ist nur die, ich glaube, bei der DSGVO ist sich keiner so sicher, ob und wie wasgenau geregelt, ich würde sagen C, der fiktive E-Mail-Provider Mailix stammt aus den USA,der fiktive E-Mail-Provider Fastix aus Irland, welcher wäre für die NutzerInnen aus deutscherund rechtlicher, ja ja, Fastix, haben wir jetzt ja schon öfters viel gelernt, schonwieder Frau Müller, sendet Ihrem Kollegen Herr Meier eine vertrauliche Rechnung perE-Mail, diese besteht auf einer End-zu-End-Verschlüsselung, was meint er, ja, da hat er Recht, der HerrMeier ist ein guter, der hat keine Ahnung wovon er spricht, bei der Ende-zu-Ende-Verschlüsselungwird zwar die E-Mail mitsamt der vertraulichen Rechnung verschlüsselt, versandt aber unverschlüsseltim Klartext auf Zöl, tja, das kommt drauf an, normalerweise bedeutet Ende-zu-Ende-Verschlüsselung,dass es unterwegs von keinem, der das abgreift, gelesen werden kann, aber war es nicht so,dass bei D-E-Mail oder bei Postings-Mail es nicht eine Hintertür gab bei der Verschlüsselung?Also muss es das sein.Okay, was sind präventive Schutzmaßnahmen gegen digitale Belästigung im Internet?Die machen sich alle wahnsinnig Gedanken über irgendwelche Hate Speech Geschichten und sowas,oder?Ich meine, ich bin jetzt seit 2010 auf YouTube und sonst was, und ich hab mich schon oftmit irgendwelchen richtig saudummen Kack, was weiß ich, ultranerfing Leuten halt, ichmuss jetzt ja nicht mehr beleidigen, als es sein muss, auseinandersetzen müssen, alsomehr als wahrscheinlich 99% der Leute je in ihrem Leben machen müssen, aber so vielGedanken um Hate Speech mache ich mir auch nicht.Okay, was sind präventive Schutzmaßnahmen gegen digitale Belästigung, oh nein, Time,in sozialen Netzwerken keine persönliche Information, jawoll, in sozialen Netzwerkenkeine Freundschaftsverfahren, jawoll, Kinder und Jugendliche, nein, nein, Kinder und Jugendliche,aufklären, Beidenhase, abschließen, easy, die letzte Frage haben wir richtig beantwortet.So, was haben wir denn falsch?Ähm, Moment, was, was, was, wollt ihr mich verarschen?Ich bitte die gesamte Fraktion der Assistentin bei zu schienen ihre Unterstützung, ernsthaft,sondern soll, weil irgend, also, vielleicht möchte die das doch gar nicht, dass das Gottum die Welt mitkriegt, ich mein, stell dir mal vor, du bist, du bist im Internet, flamestdich da mit Leuten, wirst vielleicht sogar noch sexistisch beleidigt, irgendwelche Leuteposten abartige Bilder und sonst was, möchte man wirklich, dass das, dass das jeder erfährt?Okay, keine Ahnung, außerdem, was soll denn die gesamte Fraktion da machen?Erstmal, erstmal, das zum öffentlichen Thema machen, dass jeder weiß, was im Internet dasist, also ich mein, wenn die, wenn die sagt, so nach dem Motto, ich komm damit alleine nichtklar, ich brauch Hilfe, ey, kann man sich jetzt alles überlegen, aber man sollte nichtvon sich aus die gesamte Fraktion, das ist doch bescheuert, wahrscheinlich ist die Fraktionsogar selbst daran beteiligt, irgendwelche Typen in der hinteren Reihe oder so, okay,was hab ich noch falsch gemacht, okay, was ist daran falsch, wo steht denn was richtiges,was falsch, okay, Breakout Room, das hab ich noch nie gehört, noch nie, wirklich, keineAhnung, was in Breakout Room ist, Datenweltgefahren, Schutztechnik, wir machen noch eine, kommLeute, wir machen noch eine, wir machen, wir machen noch Technologie Alltag, danach guckenwir noch ein paar Videos, ich muss was trinken, gibt es in Deutschland einen digitalen Personalausweis?Ja, ja, ich glaube schon, hab ich noch nie verwendet, ich glaube, den gibt's, das warso ein Versuch, den, der sich nie durchgesetzt hat, ja doch, ich glaube, den gibt's, ichglaube, den gibt's, weiter, was kann ein Unternehmen tun, wenn das Opfer eines Betrugs bei einemFake-Shop geworden ist, ja, erstmal gucken, welcher Depp da bestellt hat und wer unfähigist, das zu erkennen, aber okay, Polizeiverstimmungsanzeige wegen Betrugs, kann man immer machen, egalob es online war oder nicht, wenn du gescampt wurdest, Screenshots von der Bestellung istsicherlich auch nicht verkehrt, Bank benachrichtigen, ja, es ist auch sinnvoll, wenn man Geld zurückbuchenmöchte, ja, kann man alle drei sagen, Screenshot von der Bestellung machen, wenn der Shop schonein bisschen shady, scam-mäßig aussieht, warum nicht, ist ja auch verkehrt, alle drei,so, welche der Maßnahmen können Bestandteile des digitalen Detox sein, was für ein Ding,ich glaube, das ist nix für mich als 15 Stunden am Tag vom Rechnerhocker, ich weiß nicht mal,was das sein soll, Detox heißt entgiften, also digitales Entgiften, was, was ist dennder Unterschied zwischen dem Bahnmodus und dem Flugzeugmodus, man darf auch sagen, dasses den Bahnmodus nicht gibt, im Bahnmodus ist es eh kein Problem, weil die Bahn isteh nicht da, kannst im Freien stehen bleiben, ohne alles, ok, Smartphone in den Bahnmodusschalten, Berechtigungen deaktivieren, ich weiß überhaupt nicht, was die von mir wollen,Bahn hat keinen Empfang, in den Flugzeugmodus schalten, Benachrichtigungen deaktivieren,ich rate jetzt mal, ich habe keinen Schimmer, was die von mir wollen, Frau Alunathan möchtedie alten Büromöbel ihrer Firma bei E-Börr verkaufen, die Firma hat aber gar keinen E-BörrAccount, sie hat zwei Möglichkeiten, sie legt einen Account für die Firma an oder sie verkauftdie Schüler über ihren privaten Account, was ist hinsichtlich des Datenschutzes sicherer,sie sollte einen Account für ihre Firma legen, so schützt sie ihre Firma an, sie sollteihren Firmen einen privaten Account, naja, also ganz ehrlich, wenn ich was für die Firmaverkaufe, wie ich es immer mit einem Firmenaccount mache, ich würde das garantiert nicht immermeinen Privataccount machen, außer ich bin super agiles Berliner Startup oder so, daweiß man ja nie, aber wahrscheinlich will die Büromöbel da eh keiner haben, Next, wassollte man beim Online-Banking beachten, das Zugangspasswort sollte sicher sein, aus kleinen,großbuchstaben, Sonderzeichen und Zahlen bestehend, das stimmt nicht, das wollen diehören, aber das stimmt nicht, das wichtigste ist, das wichtigste ist ein langes Passwort,Länge ist deutlich wichtiger als ein großer Zeichenvorrat, es muss lang sein, man sollteein Zahlungsmittel einrichten, um vor dem Abheben hoher Summen durch Betrüger zu schützen,ein Zahlungslimit, kann man auch machen, wenn es sowas gibt, warum nicht, man sollte dasOnline-Banking nicht nachts nutzen, da sind die Betrüger aktiv, ja vor allem die China-Chinesenin der anderen Zeitzone, die sind da immer ganz gefährlich nachts, so lassen wir dasmal so, aber wie gesagt, das mit dem Passwort stimmt nicht, das Passwort muss lang sein,der nachts ist kälter als draußen, wisst ihr doch, weiter, der Herr Meier schon wieder,arbeitet am Tag am PC, nach dem Feierabend schneidet er zu Hause am Schreibtisch Videosfür YouTube, richtig krasser Content-Creator der Herr Meier, eines Tages klagt er überRücken- und Kopfschmerzen, was kann er tun, um zukünftig solche Schmerzen zu verhindern,ein Stuhl mit Armstütze anschaffen, mit Arm lehnen, das ist das allerwichtigste, aberdas steht da wahrscheinlich nicht, er sollte mit geradem Rücken und Schultern arbeitenbeziehungsweise Videos schreiben, das möchten die hören, ist jetzt, man muss vielleichtnicht da hören, wie der letzte Penner so, aber man muss jetzt auch nicht die ganze Zeitkerzen, gerade wichtig ist, dass man die Ärme ablegen kann, das ist richtig, und jetzt übrigenswir alle rein zappen beim Herr Meier gleich, er sollte zum Ausgleich Sport treiben, zumBeispiel, ja das ist richtig, er sollte mehr trinken, er sollte sich einen Massagestuhlkaufen, ja das, also, das ist jetzt eine doofe Antwort, ja das kann durchaus sein, dasses was bringt, aber pauschal würde ich das nicht so sagen, mehr trinken ist auf jedenFall auch sinnvoll, Chat wieder, drei massagische Happy Ends, es war klar, dass der Chat nochmit irgendwie sowas um die Ecke kommt wieder, egal, weiter, so, Frau Meier, arbeitet jedenTag und am Wochenende sehr lange, nach ihrem Feierabend haben in ihrer Kleinstadt immeralle Supermärkte zu, was kann sie tun, krass, jeden Tag und am Wochenende, die ist bestimmtConsultant Frau Meier, sie muss Excel Dateien copypasten, sie kann während der Arbeit imSupermarkt anrufen, frische Lebensmittel bestellen, ja das geht, sie kann frische Lebensmittelonline bestellen, nach Feierabend, Moment, äh, das geht beides, das geht auch beides,sie kann während der Arbeit im Supermarkt, keine Ahnung ob diesen Service einen Supermarktanbieten, sollte ein Supermarkt diesen Service anbieten, dann geht das, ok ihr habt recht,wenn der Punkt ist anrufen, dann ist es B, dann ist es B, Bestellung per Fax wäre auchnoch was, weiter, was bedeutet der Begriff Smart EID, keine Ahnung, dank des Smart EIDGesetzes kann jeder Bürger innen mit einer ID, mit einer Identifikationsnummer sich inOnline-Shops einkaufen, dank des Smart EID Gesetzes kann jeder Bürger innen den Personalausweisnach Online als Ausweis auf, ich hab keine Ahnung, wahrscheinlich B, weil ich mein,irgendwie Online-Shopping keinem mehr vorstellen, hab ich noch nie gesehen in der Richtung,ich kauf viel online an, muss B sein, macht aber wahrscheinlich keiner, Haltprüfungabschließen, 100%, Leute, absolut Next Level Shit hier, 5 Headings da 5 Head, weitere Prüfungsdaten,sollen wir die anderen 2 noch schnell durchklicken, dass wir dann uns am Ende das Zertifikatmal angucken können, wir machen das jetzt sag ich, ok Datenwelt, ich mach mir da, ichmach jetzt da echt mal nen Witz draus, ich speichere mir das Zertifikat als PDF undmorgen schicke ich das in Teams an mein Chef, einfach mal chance vor, guck mal hier, fürdie nächste Gehaltsbehandlung, ok trage die fehlenden Wörter oder die fehlenden Buchstabenbei Nutzenunternehmen Software in einer Cloud spricht man von Software as a Service, wobeidas gar nicht mal sein muss, das stimmt ja nicht was da steht, das muss nicht zwangsläufigsein, aber wahrscheinlich ist es Software as a Service, weiter, trage die fehlendenPasswörter ein, npass last Nordpass sind Password Manager, Nordpass, ja die Geschichte mit NordVPNhabe ich euch ja schon zweimal erzählt, ich muss mal kurz in meine E-Mails gucken, obdie nochmal geantwortet haben, NordVPN wollte ja, dass ich mein VPN-kritisches Video lösche,dass sie zu einer Kooperation bereit sind, das mache ich nicht, gucken ob es was neuesgibt, Sekunde ich schau mal kurz rein, Auszahlungsvergütung, ah das lese ich natürlich immer gerne, Umfrage,ich kriege wieder G2A Werbung, MonkaS, geh weg, ok schnell, also weiter, Herr Demir vertrittseine Kollegin Frau Schmidt auf einem Messe stand, seiner Firma, ein Interessent meldetsich und möchte mit der Firma Kontakt aufnehmen, leider sind Herr Demirs Visitenkarten alle,feels Batman, Visitenkarten, das ist ja schon richtig Boomer Style oder, ok darf er dieVisitenkarte von Frau Schmidt verteilen, ja wenn Frau Schmidt der Weitergabe ihrer persönlichenKontaktdaten an Interessenten zugeschümmelt, ja, Herr Yilmaz meint, meine Daten sind synchronisiertworden, was meint er, wahrscheinlich weiß er nicht wovon er spricht, deswegen könnenwir das eigentlich überspringen, die Daten die er meint sind auf der internen und externenFestplatte gleichzeitig geöffnet worden, die Daten die meint er auf dem internen und externenauf dem gleichen Stand, wahrscheinlich meint er das, ja, wobei, also das, egal, er weißwie gesagt, er weiß nicht wovon er spricht, der Herr Krallmayer ist wieder am Start, sagtzu seinem Kollegen, Verstöße gegen den Datenschutz können Unternehmen bis zu 20 Millionen EuroStrafgeld kosten, hat er recht, keine Ahnung was in der DSGVO als Höchststrafe drin steht,ja das wäre in der Regel sind die Bußgelder viel niedriger, ok, ja die Datenschutzbörsekann aber von der Strafe abziehen, wenn der Datenschutzverschluss schnell beruht, wahrscheinlichauch, nein so hoch darf die Strafe, nein es gibt kein Geld, wahrscheinlich A und B oder,Chat was meint ihr, wahrscheinlich A und B, passt, nur A, warum ist, warum nur A, kannihr nicht davon absehen, ich hab keine Ahnung, wenn ich ehrlich bin, warum sollen die davonabsehen, was weiß ich, ich frage jetzt, ob sie es können oder nicht, egal wir lassendas jetzt so, Ralf bekommt nach dem Login in seinem, die haben es nicht mit richtigdeutschen Sätzen, ich meine ich schreib auch viel Mist, aber wenn das ein offiziellerWebauftritt ist, wer hat denn das geschrieben, haben sie das irgendwie über Pfeifer in IndianOut gesourced oder was, Ralf bekommt nach dem Login in seinen Online Shop eine SMS miteinem Code an sein Smartphone gesendet, mit dem Code soll er den Login bestätigen, erhat die zwei Faktor Authentisierung, schreibt man das in Deutsch so, Authentisierung tatsächlich,es müsste aber eigentlich eine Authentifizierung sein, weil der Unterschied da zwischen denbeiden ist, das eine bedeutet, ob du rein darfst, das andere bedeutet, was du dann danachdarfst, wenn du drinne bist, das ist der Unterschied zwischen Authentifizierung und Authentifizierung,da bin ich mal gespannt, ob die das hinkriegen, wenn man da zwei, da bin ich mal gespannt,wenn man da zwei reinschreibt, dürfen ArbeitnehmerInnen nach einer Kündigung von ihrem ArbeitgeberInnen,von ihrem ArbeitgeberInnen, Moment, Alter, muss man Arbeitgeber ernsthaft gendern, ichmeine ArbeitnehmerInnen verstehe ich ja noch irgendwie, aber von ihrem Arbeitgeber, dasist doch schon so ein abstraktes Ding und bezieht sich halt meistens noch nicht nur auf eineechte Person, sondern eben halt auf das Unternehmen, das Unternehmen ist ja der Arbeitgeber undnicht irgendwie eine Person, naja, dass ihre personenbezogenen Daten im Unternehmen gelöschtwerden, ja, ja, ich denke mal schon, ich meine die erste Antwort ist so bescheuert, das kanneigentlich nicht sein, ja oder, ich denke, dass das passt, ich finde das geil, da sagstdu, Alter, machst du dich einmal über die Geschichte lustig, schon kommen sie im Chatdie Leute an, ja, Max, ja, ha ha, null, fick die Scheiße, was, ne, die Sache ist wie immernicht schwarz und weiß, aber das ist, was, das ist ja klar, das, das, so ist das haltim Chat, das ist, wie viel ist nicht schwarz und weiß und wisst ihr warum, ich persönlichbin ja der Meinung, die ganzen Diskussionen über gendern und nicht gendern sind komplettheiße Luft und eigentlich komplett verschwendetes Geld, Geld auch, verschwendete Zeit. Wisstihr warum da so viel darüber diskutiert wird? Also ich bin der Meinung, das wird sich entwederdurchsetzen oder nicht, wenn es einen sinnvollen Mehrwert bietet und die Leute davon überzeugtmit der Zeit. Wird sich das durchsetzen, übers Knie brechen, kann so nichts, aber wisstihr, wisst ihr warum da so viele Leute wahnsinnig emotional und aufgeheizt darüber diskutieren?Das liegt einzig und allein daran, weil es ein, wie soll ich sagen, ein simples Themaist, wo jeder irgendeine Meinung dazu hat, die er kundtun will. Ja, das ist jetzt keineRaketenwissenschaft, das ist eigentlich ein ziemlich überschaubares, simples Themengebiet,wo man, wo jeder meint, was dazu sagen zu müssen. Und jeder, jeder ist da Meinung,jeder muss sein, jeder, die anderen sagen, nein, darf auf gar keinen Fall sein. Und eigentlichlenkt das von deutlich wichtigeren Problemen ab, die man hat, worüber sich die Leute sichvielleicht mal Gedanken machen sollten. Ansonsten, mir ist das vollkommen egal. Ich könnte esan manchen Stellen sehr unglücklich lesbar, gerade wenn man noch nicht einmal sich daraufgeeinigt hat, wie man es denn jetzt macht, mit Doppelpunkt, mit Unterstrichen, mit Grunesim E-Mail, mit kleinem E-Mail, mit Sternchen auseinandergeschrieben. Wisst ihr eigentlich,wie man Bürgermeister richtig gendert? Es ist, wenn man genau nimmt, ist es der Bürger,also manche, die Noobs würden jetzt schreiben BürgermeisterInnen, aber in Wirklichkeitist es ja BürgerInnen, MeisterInnen, weil Bürger muss ja nicht ein Kerl sein. Eigentlichwäre Bürgermeister korrekt gegendert BürgerInnen-MeisterInnen. Ja, und da wird es mir auch ein bisschen zuabgedreht, ehrlich gesagt. So, weiter ohne noch eine Minute, fuck. GPG4Win, ArchieKripp,Kripp und Schubach sind Programme zur Verschlüsselung und Laufwerken. Exzellent. Und? Und? 100%!Leute, er hat zwei Faktor-Authentifizierungen mit der Zahl 2 gecheckt. Easy. Easy. So, letztePrüfung, starten. Auf geht's. Hilmas ist wieder am Start. Finde bei Twitter einen Accountvon ihm, den er nicht registriert hat. Das waren die Hater bestimmt. Mein Opa ist aufTwitch, nice. Easy. Danke für den Prime-Sub. Den er nicht registriert hat. Offenbar hatjemand seine Identität gestohlen. Was sollte Herr Hilmats machen? Ehrlich gesagt, ignorieren.Wahrscheinlich ist es, ich mein, geht mal auf Twitter und such da mal nach MaxFPS. Da findestdu durchaus einige. Und who cares, ja. Okay, den Betrüger bei Twitter per Direktnachrichtanschreiben und ihn bitten, den Account zu löschen. Kann man probieren. Wird wahrscheinlichnichts bringen, weil das Konto inaktiv ist. Anzeige bei der Polizei erstatten. Nein, dasFake-Konto bei Twitter. Ja. An dem seiner Stelle würde ich einfach einen neuen Account erstellen.Herr Hilmats underscore 2022 oder sowas. Frau Demir ist Systemadministratorin. Ihr Chefmeint, Antiviren-Software anzuschaffen, das wäre zu teuer und unnötig. Ist es auch?Ist es. Was wären gute Argumente um ihren Chef? Gar nicht. Alles bloated. Der Chef hatRecht. Okay, gute Antiviren-Software findet Schadsoftware und kann sie unschädlich machen.Ja, aber der Winner aus Defender macht das auch schon. Worüber man sich unter, genau,real Hilmats macht, das ist ein Twitter-Account. Also, worüber man sich vielleicht unterhaltenkann, ist für den Fileserver sowas anzuschaffen oder sowas. Also, gehen wir mal davon aus,wie sie wollen das wirklich. Sie wollen das wirklich an. Okay. Ja, vielleicht, vielleicht,vielleicht haben sie auch ein Krypto-Miner mit dabei, wie Norton Antivirus neuerdingsund Avira auch. Gute Antiviren-Software kann Phishing-Vorfälle verhindern. Kommt auf denPhishing-Versuch an. Möglich, ja. Gute Antiviren-Software spart Kosten, die nach einem für Hackererfolgreichen Angriff mit Schadsoftware entstehen. Kann auch sein. Gute Antiviren-Software schütztdas gesamte Firmennetzwerk. Nein, das ist Schwachsinn. Gute Antiviren-Software installiertSicherheitsupdates für alle installierten Programme. Nein, das ist auch Schwachsinn.Gute Antiviren-Software installiert Sicherheitsupdates für den Router und Schütten. Nein,das ist auch Schwachsinn. Also, ich würde es jetzt einfach mal so lassen. So, weiter. FrauMeyer ist schon wieder am Start. Der Herr Demir und die Frau Meyer, die haben echt was zu tun. Ist FrauMeyer nicht auch die, die montags bis freitags und samstags und sonntags arbeiten,deswegen nicht in den Supermarkt gehen kann? Jetzt ergibt das auch alles Sinn. Also, sie fragt ihrenKollegen Herr Demir, ob sie auf einen Link klicken sollte, den sie per E-Mail vermeintlich von derDeutschen Bank zugesendet bekommen hat. Ja, wahrscheinlich Deutsche Bank echt at indiamail.cc oder sowas.Denen sie per E-Mail vermeintlich von der Deutschen Bank. Angeblich müsse das Geschäftskontakt aufgrund einer Unregelmäßigkeit überprüferter Absender ist. Kundenbetrug, Deutsche Bank,Kontoprüfung 654d.com. Klingt äußerst vertrauenserweckend. Was solltet ihr anklicken?Klicke nicht auf den Link. So. TheRealDeutscheBank.ru Die folgenden Wörter ein. Ein bezeichnet einenTeil einer Software, der es hackern ermöglicht, Sicherheitseinschränkungen zu umgehen und Zugriffzu Systemen zu bekommen. Ein Exploit? Oder? Oder ein, ein, ein. Was wollen die denn da wissen?Nee. Ein. Keylogger? Oyana? Backdome. Ein Teileiner Software. Der Gerät. Also ich hätte, ich hätte aus dem Bauchhaus gesagt exploit.Wobei er exploit eigentlich nicht ganz korrekt ist. Exploit ist ja quasi das Ausnutzen einersich. Ich habe keine Ahnung, was die VW wissen wollen. Ein exploit ist tatsächlich nicht Teileiner Software. Das ist richtig. Eigentlich ist das Ausnutzen einer sicher. Kann man dasSicherheitslücke reinschreiben? Nee. Ich habe wirklich keine Ahnung. Ein Backdoor?Ein Backdoor? Bezeichnet einen Teil, aber das ist doch kein Teil einer. Ich habe. Nein,ich bleibe jetzt bei exploit. Egal. Mo schon wieder veröffentlicht seinen kompletten Lebenslaufmitsamt Bewerbungsfotos, E-Mails, Adresse, Arbeiten auf allen Social Media, Facebook,LinkedIn, Xing und so weiter. Er hofft so auf Jobangebote. Warum ist das keine gute Idee?Er könnte Opa von Doxid. Wer hat diese Texte geschrieben? Die haben das wirklich nach IndienPfeiffer über Pfeiffer nach Indien outsourced. Er könnte Opa von Doxing werden. Na ja. Nee,könnte er nicht. Er hat sich selber gedoxt. Er hat alles hochgeladen. Er muss gar nichtmehr gedoxt werden. Er könnte mehr Spam per E-Mail bekommen. Mit Sicherheit. Er könnteOpfer von Social Media Management werden. Er könnte Opfer von Social Media Management werden.Von was? Hä? Das könnte wahrscheinlich auch passen. Wobei. Wahrscheinlich. Ich habe keineAhnung. Die wollen bestimmt A und B hören. Ich habe ehrlich gesagt legit kein Plastischimmer,was da die richtige Antwort ist. Weiter. Sollte Administratorinnen Software in Unternehmenso konfigurieren? Das ist an der Stelle auch noch falsch. Sollten Administratorinnen Softwarein Unternehmen oder Administratorinnen in dem Fall Software in Unternehmen so konfigurieren,dass diese sich automatisch aktualisieren? Ja. Nein. Sicherheitsprobe. Das werden jenach Software nur alle paar Wochen oder paar Monate noch mal. Die Mitarbeiter. Jawoll.Trage den fehlenden Fachbegriff ein. Herr Meyer ist CEO eines großen Konzerns und findetplötzlich zahlreiche Accounts von sich auf Xing, die er nicht angenehm hat. In den Profilengibt es viele Fotos und private Daten von ihm. Offensichtlich ist er Opfer von Identitätsdiebstahl.Wie schreibt man das? Identitätsdiebstahl. Identitätsdiebstahl geworden. Was sind Anzeichenvon phishingversuchenden E-Mails? Fragen nach Zugangsdaten? Ja. Fehlende Bilder oderLogos? Ja. Kommt drauf an, aber ja, die tun sich oft mal schwer. Unpersönlich? Ja. Genauso wie bei eurem Test. E-Mail des Absenders passt nicht zum angezeigten Absender-Namen.Ja. Ja, alles. Okay. Oh. 50%! Oh Gott. Das haben wir verschätzt, ne? Okay, Frage 1,ist schon mal falsch. Anzeige! Anzeige! Ich soll allen Ernstes Anzeige erstatten, weilirgendjemand Yilmaz01 mit meinem Foto angelegt hat, oder was? Anzeige! Wegen einem Twitter-Profil,das jemand anderes angelegt hat. Ja, ich hab auch sonst nichts besseres zu tun. Alter!Alarm, Alarm. Okay, 2. Guter Anti-Viren-Softer schützt das gesamte Firmenetz. Nein? Nein?Was ist Schwachsinn? Zeig mir mal eine gute Anti-Viren-Softer, die das gesamte Firmenetzwerkumfassend mit ihr macht. Schwachsinn, Alter. Was ist das? Dumm, dumm. Kack. So. Hier.Okay, hier kriegen wir keine Antwort drauf. Keine Ahnung, was Sie hier wissen wollen vonmir. Frage 8 ist falsch. Wie, fehlende Bilder und Logos nicht? Aber fehlende Bilder undLogos kann da auch drauf hindeuten. Wenn du eine E-Mail, wenn du eine HTML-E-Mail kriegstund da ist anstatt das deutsche Banklogo auf einmal irgendwie ein China-Chinesen-Dingdrin, dann kannst du dir denken, ah ne, da stimmt was nicht. Rootkit. Rootkit. Das,ne, wobei, nein. Das ergibt ja auch keinen Sinn. Aber das ergibt, doch, das ergibt nochwenig, doch, das ergibt noch mehr Sinn. Das ergibt noch mehr Sinn. Bug. Ein Bug, aberein Bug ermöglicht das Hacker nicht automatisch, Sicherheitseinstellungen zu umgehen. Was auchimmer. Wir haben es geschafft, Leute. Wir haben es geschafft. Nein, nein, ich will michnicht mal verbessern. Wo ist mein Zertifikat? Wo ist, wo ist mein Zertifikat. Kommt dasper Fax morgen an? Was? 0 von 6? Ich hab alles durch. Ach so. Ja gut, meine, meineE-Mail. Die E-Mail, die E-Mail ist ja auch, ähm, was? Ne, Moment, Level 1? Hä? Okay,die Seite ist auch noch broken as fuck. So, wir machen jetzt nochmal, wir machen jetztmal Sache. Mich interessiert mal aus, was diese Webseite besteht. Okay, schonmal nichtMinifile, wobei, das ist hart hier. Wobei, Sourcecode? Kein Minifile, Sourcecode und nix.Was ist denn hier los? Auf was basiert denn das Ganze? Wir machen einfach Awesome Stack,Awesome Text Stack. Wir lassen einfach mal die Seite analysieren und uns sagen, was die,was die, was die verwenden. Jawoll, das da. Analysiere die Seite mal und sag mir, wasdie verwenden. JQuery? Wait a minute, das stimmt wahrscheinlich noch nicht. Mal kurzwarten, bis das fertig analysiert hat. Es ist erst Beta, stimmt. Underscore Lowdash,okay, erst mal beides drinne. Backbone.js? Alter, das ist ja antik, das Ding. JQueryUI? JQuery, Michael, JQuery, Anime.cs, MySQL, WordPress. Okay, Capture. WordPress, JQuery.Warum verwendet es Backbone und PHP? Backbone ist ja eigentlich, ne Moment, Moment, sorry.Backbone war so eines der ersten Client-Side-Frameworks, ne? Was ist denn das? Das ist ja antik asfuck. Wer verwendet denn sowas? So sah der Tech Stack mal vor 10 Jahren aus. Awesomeness37. Quality Report. Die Webseite hat wahrscheinlich 10 Jahre Entwicklung gebraucht, ja, das wirdwahrscheinlich sein. Boah, das ist aber schlecht. Nicht mal JJQuery. Ne, das ist schlecht, ja.Also ich hätte wenigstens JJQuery erwartet. Okay, Performance ist schlecht. Best Practiceist es aber. Performance, 41%. Sucked. Okay. Na denn? Wissen wir Bescheid, jetzt haben wirden Internetführerschein. Code this, not that. Okay, wenn wir gerade dabei sind. Ach in React?Ne, in React nicht. Von React habe ich keinen Plan. Rare Interview with a Perl Programmer.Okay, das gucken wir jetzt mal. Perl. Perl Hacker Mans. Oh, mein Zahnarzt schon wieder.Okay, Moment, wo sind wir? Perl Programmer. Okay, das ist nicht lustig. Lul. Critical Updateinbound. Da kommt doch eh nichts Gescheites. Leute, ich könnte morgen ein Video über denInternetführerschein machen, nachdem wir das jetzt ja durch haben. Wo ich ja sage,das ist sehr fragwürdig, was da teilweise drinne gefragt wird. Big Update heißt zwei neue Skinsund drei Sachen wurden gefixt. Sekunde, Sekunde, Sekunde. Steam, Steam Stats. Unter 2000 sindwir jetzt schon. Not Stonks. Es geht abwärts. Obwohl man eigentlich gar nicht für möglichhat, das geht weiter abwärts. Und New World? New World? Was macht New World? Kackt auchweiter ab. Exzellent. Die Abkacker sind weiter am Abkacken. Wunderbar. Es geht ab wie derRostische Rube. In die gleiche Richtung.Also ganz ehrlich, das Spiel ist dadurch nicht weiter großartig nennenswert an meineExpectations rangerückt. Das hat mich ehrlich gesagt nicht so sehr geschockt. Das sindder ehemalige DICE Mitarbeiter. Das hat mich nicht so geschockt im Teaser. Hat mich nichtso geschockt, aber vielleicht taugt's ja. Alter, wo bitte spielt denn der Typ, wennman so eine Jacke anhaben muss beim Spielen? Ist da Minus?Hat mich nicht so geschockt, ehrlich gesagt.Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja.Was genau hat das Space Shuttle mit demSteam Deck zu tun? Der Zusammenhang erschließt sich mir gerade absolut überhaupt nicht. StartendeRakete. Zumal es immer nur exciting und so on wir freuen uns, wir sind hyped, startendeRakete, aber ansonsten hat er nichts damit zu tun.Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja.Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja.Ich bin mal gespannt, ob sie das überhaupt weiter supporten. Also ob das gut ist, wennes da weiter Support gibt. Erinnert sich noch jemand an Steam Machines und solche Dinge?War das ein Steam Controller? Ja, auf jetzt komm. Ist das eine Werbung dafür?Wir gucken uns was anderes an. Level Cap G-Bait wird mir zu sehr gerade. Zu großer G-Bait.So was gucken wir uns denn jetzt an? Mein Zahnarzt ist wieder am Start. Der Chat sagt,das Video wäre nicht gut. Incredible Budget Server. Wo ist er denn? Minecraft. Installin Linux. Das sieht aus wie ein Kühlschrank. Das sieht aus wie ein Kühlschrank gerade,auch mit der Spiegeltür. Schau das, Vassim vs. Stalker. Das ist 40 Minuten lang oderdas gucke ich mir jetzt nicht an. In 24 Minuten? Nein, das gucken wir uns jetzt nicht an. Battlefieldhas a new Contender. Was deine Kleidung über dich verrät? Ah, Lego Stels. Okay, wir schauenmal, was uns YouTube empfiehlt. Gleich ist Badget-Time. Kein Wunder, dass das jetzttrendet. Ein bisschen Gedanken macht es mir schon. Für mich ist diese ganze Geschichtemit Atomkrieg und sonst was, das ist so irgendwas in grauer Vorzeit, so 1980 oder so, so nachdem Motto, das haben wir schon lange hinter uns gelassen. Mich macht es insofern ein bisschenGedanken, dass jetzt öffentlich sogar schon im Fernsehen vor der Politik quasi solcheWörter in den Mund genommen werden. Also sprich, da ist schon ein bisschen die Kackeam Dampfen. Das macht mir schon ein bisschen Gedanken, wenn ich ehrlich bin. Natürlichsollten wir alle hoffen, dass nichts auch nur ansatzweise in dieser Richtung passiert,weil sonst sind wir einfach alle deadge morgen. Nicht badge, sondern deadge. Truth about webdesigners. Das ist ein Risitas Video. Moment, das muss einfach. Mal gucken, ob das was taugt.Du hast mir ein richtig gutes Video. Ah, schickt mal euch. Okay, Moment, nein. Okay.Nein, ich habe es nicht. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay.Okay. Okay. Okay. Okay. Okay. Okay. Ah, ja.Nein! laughsNein!Ja!你就 iba a cosas ovenTuFajasMechagrinDer Chat ist voll im TextSekundeAh ja ich hab jetzt auch noch raysUnd nach einer Sitzung...Meinich kann ja nicht dieWurde sichich arcadejainderJa okayDa habe ich schon Da habe ich Jetzt Aber schon Deutlich Bessere GesehenChat Wieder EinplendenChat Ist Wieder DaDas Haben wir uns schon angeguckt am sonntag den senior java script developer Den Haben wir uns schon angeguckt am sonntag das war nicht schlechtGibt den artikel dazu css als back-end zu verwenden das war auch ganz interessant was css und back-endDas sind Zwei sachen die passen nicht zusammenDas juckt mich überhaupt nicht was da abgehtWas ist denn css das ist das das dafür sorgt dass zum Beispiel der hintergrund dieses buttons rot istStylings für Websites ist dasAlter wenn Du Da die hand dazwischen hast ist aber nicht gut das schlägt dir die hand komplett durchDie Hand dazwischen ist aber vorbeiAlter ich würde mich nicht trauen das selbst auszulösen bei mir am armDas gibt es als competitive frisbee Scheibe werfen gibt es als competitive sportEcht das gibt es bei Olympia jetzt Chebatet mich der Chainlorder es gibt frisbee golf nein das kann ich mir nicht vorstellenEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sportEcht das gibt es als competitive sport", "segments": [{"id": 1, "start": 0.0, "end": 26.48, "text": "Ockchamp, Wettke, ich müsste jetzt mal probieren ob ich es schaffe den ganzen Twitch-Stream"}, {"id": 2, "start": 26.48, "end": 31.76, "text": "nur in Emotes zu sprechen. Wahrscheinlich. Das Schlimme ist, wahrscheinlich würde ich das"}, {"id": 3, "start": 31.76, "end": 48.52, "text": "sprechen kriegen. Ja Leute, Twitch hat so nicht kapiert, dass der Stream,"}, {"id": 4, "start": 48.52, "end": 55.88, "text": "und jetzt wartet mal, ich refresche mal kurz die Anzeige bei mir auf dem Vorschaumonitor. Moin. Die"}, {"id": 5, "start": 55.88, "end": 59.64, "text": "Anzeige geht noch nicht. Ah, jetzt hat Twitch mitgekriegt. Angeblich sind es 0 Zuschauer,"}, {"id": 6, "start": 59.64, "end": 66.6, "text": "was ja nicht sein kann Leute. Da sind quasi 3 durch 0. Gleich ist Twitch kaputt. Und wir sind"}, {"id": 7, "start": 66.6, "end": 77.36, "text": "dran schuld. 4 durch 0, 5 durch 0. Schwierig. Oder wie sagt man da heutzutage zu belastend?"}, {"id": 8, "start": 77.36, "end": 87.84, "text": "Oder ist es schon wieder aus? Ich glaube, das sagt man heute auch nicht mehr. Wo ist der Kabum?"}, {"id": 9, "start": 87.84, "end": 98.36, "text": "Das ist eine gute Frage. Wir haben eine Weile schon nicht mehr miteinander gesprochen. Ich"}, {"id": 10, "start": 98.36, "end": 111.04, "text": "habe keine Ahnung. Ich vermute mal immer noch in Frankfurt irgendwo. Naja, übrigens heute. Heute"}, {"id": 11, "start": 111.04, "end": 114.8, "text": "machen wir was ganz Tolles. Heute machen wir den Internetführerschein. Es gibt einen neuen"}, {"id": 12, "start": 114.8, "end": 119.8, "text": "Internetführerschein. Aber ich warte jetzt erst mal bis der Stream richtig on ist. Das wird was,"}, {"id": 13, "start": 119.8, "end": 127.44, "text": "ich sage es euch. Ja, das Bundesinnenministerium hat einen neuen Internetführerschein rausgebracht"}, {"id": 14, "start": 127.44, "end": 133.4, "text": "und den machen wir heute. Hat 6 Kategorien in 3 verschiedenen Schwierigkeitsstufen. Nein,"}, {"id": 15, "start": 133.4, "end": 137.84, "text": "er ist ergeblich wirklich ernst gemeint. Ich habe nur meine Zweifel, ob das wirklich so ist."}, {"id": 16, "start": 137.84, "end": 145.12, "text": "Ich weiß nicht, bin mir nicht so sicher. Tribulon, danke für den Sub. Take Viagra, die Hard. Danke"}, {"id": 17, "start": 145.12, "end": 159.44, "text": "für den Sub. Huge Pog. Du bist zertifizierter Datenschutzbeauftragter. Huge Upgrade. Karriere"}, {"id": 18, "start": 159.44, "end": 166.44, "text": "Pass Upgrade. Gut, ich hoffe du kriegst wenigstens jetzt da was. Ich hoffe es lohnt sich wenigstens."}, {"id": 19, "start": 166.44, "end": 174.08, "text": "Zumindest ist es schon mal nicht schlecht zu haben. Hast du denn auch den neuen Internetführerschein?"}, {"id": 20, "start": 174.08, "end": 183.68, "text": "Wenn nicht, den machen wir heute Leute. Du hast auf der Seite 404, ernsthaft ist das schon wieder"}, {"id": 21, "start": 183.68, "end": 190.12, "text": "kaputt? Probieren wir gleich aus, probieren wir gleich aus. Vorhin ging es noch. Vorher hat es noch"}, {"id": 22, "start": 190.12, "end": 198.36, "text": "funktioniert. Das ist Haaresträumen teilweise, was da drin steht. Da steht drin Herr Stephanie"}, {"id": 23, "start": 198.36, "end": 204.68, "text": "beauftragt sie. Da haben wir wie fünf Leute zusammen an einer Frage geschrieben. Ist ganz"}, {"id": 24, "start": 204.68, "end": 210.32, "text": "grausam. Gut, vielleicht gibt es auch einen Herr Stephanie. Heutzutage kann man sowas ja nicht"}, {"id": 25, "start": 210.32, "end": 216.32, "text": "mehr assuming. Dann ist ganz schnell der Spaß vorbei, wenn man sowas macht."}, {"id": 26, "start": 216.32, "end": 227.76, "text": "Bei nur der Schul und Arbeit habe ich schon ach so, na dann. Der Pog, der Internetführerschein,"}, {"id": 27, "start": 227.76, "end": 238.04, "text": "der ist ganz wichtig ja. Soll ich euch mal was erzählen Leute? Oh nein, Avira will mir"}, {"id": 28, "start": 238.04, "end": 241.64, "text": "mit der Premium aufschwätzen. Warum habe ich diesen Scheiß überhaupt noch auf dem zweiten"}, {"id": 29, "start": 241.64, "end": 261.0, "text": "Rechner installiert? Das ist so useless. 10 Monate, danke für den Zapp. Was Cross Talk"}, {"id": 30, "start": 261.0, "end": 273.84, "text": "Solutions hat heute UI Notify gelauncht. Äh, was, wie? Ist das G-Bait? Das ist doch Werbung,"}, {"id": 31, "start": 273.84, "end": 294.84, "text": "oder? Das ist doch Werbung. Ist das Werbung? Sascha, ist das, ist das, ist das verpackte"}, {"id": 32, "start": 294.84, "end": 314.68, "text": "Werbung? Es soll keine Werbung sein, es liest sich aber wie Werbung. Ja, Kommentare gelöscht"}, {"id": 33, "start": 314.68, "end": 321.44, "text": "kann auf YouTube alles bedeuten. Da weiß man nicht so genau. Früher landeten die Kommentare"}, {"id": 34, "start": 321.44, "end": 326.28, "text": "auf YouTube in so einem Bereich, wo man dann als Content Creator gesehen hat, dass Kommentare"}, {"id": 35, "start": 326.28, "end": 332.2, "text": "geplockt wurden und man konnte die wieder freigeben. Aber mittlerweile landet die meistens,"}, {"id": 36, "start": 332.2, "end": 340.2, "text": "das meiste Zeug gar nicht mehr da. Was ist der Kollege in der Firma, wurde jetzt Kaspersky"}, {"id": 37, "start": 340.2, "end": 345.72, "text": "entfernt, weil ich aus Russland komme. Kappa HD, ja. Kommen die überhaupt aus Russland?"}, {"id": 38, "start": 345.72, "end": 353.48, "text": "Waren die nicht irgendwie aus, irgendwie nur aus, warte mal, Kaspersky-Antivirus. Waren"}, {"id": 39, "start": 353.48, "end": 361.64, "text": "die nicht irgendwie aus Litauen oder sowas oder bringe ich das jetzt durcheinander? Ja?"}, {"id": 40, "start": 361.64, "end": 371.36, "text": "Okay, ne, dann bringe ich das durcheinander. Tatsächlich. Ne, die kommen wirklich nicht"}, {"id": 41, "start": 371.36, "end": 376.64, "text": "aus Russland. Ich dachte, die kommen aus Litauen, mit was verwechsel ich die denn? Fällt euch"}, {"id": 42, "start": 376.64, "end": 382.56, "text": "irgendetwas aus Litauen ein? Wahrscheinlich bin ich komplett neben der Spur. Moment, was?"}, {"id": 43, "start": 382.56, "end": 389.92, "text": "In welchen Programmiersprachen ist das geschrieben? C++ und Nämmerle? Was zum Teufel ist Nämmerle"}, {"id": 44, "start": 389.92, "end": 419.48, "text": "für eine Programmiersprache? Äh, das ist quasi ein Fake C-Sharp für.NET. Boah ne,"}, {"id": 45, "start": 419.48, "end": 428.36, "text": "F-Sharp-Abklatsch. Ne, ne, ne, ne. Das will ich mir gar nicht weiter angucken. In was"}, {"id": 46, "start": 428.36, "end": 434.2, "text": "das alles programmiert ist? Nämmerle, habe ich schon nie gehört. Aber gut. Kaspersky"}, {"id": 47, "start": 434.2, "end": 442.92, "text": "wird es schon wissen. Ja, ich wollte euch ja was als... Warum ist denn das jetzt da unten"}, {"id": 48, "start": 442.92, "end": 449.0, "text": "rot? Ist das jetzt normal, wenn man streamt? Normalerweise früher war das immer nur rot,"}, {"id": 49, "start": 449.0, "end": 456.16, "text": "wenn man recordet. Ich vermute mal, dass es jetzt auch rot ist, wenn man... Das hat mich"}, {"id": 50, "start": 456.16, "end": 460.44, "text": "jetzt irritiert, will ich, dass meine Festplatte gleich voll ist, weil ich habe nicht mehr"}, {"id": 51, "start": 460.44, "end": 469.56, "text": "so viel Platz. Es ist ein bisschen eng auf manchen meiner Laufwerke. Also hier ist es"}, {"id": 52, "start": 469.56, "end": 481.76, "text": "ein bisschen eng. Da ist es ein bisschen eng. Da ist Platz, aber da ist... Weiß nicht so"}, {"id": 53, "start": 481.76, "end": 488.92, "text": "genau. Mir war so... Ich wusste es. Ich wollte es nicht sagen. Ich wusste, als ich es ausgesprochen"}, {"id": 54, "start": 488.92, "end": 494.16, "text": "habe, wusste ich, dass irgendjemand schreibt, entweder ein bisschen eng, Gachi Bass oder"}, {"id": 55, "start": 494.16, "end": 498.92, "text": "eng ist gut. Irgendwie sowas. Es war mir jetzt so klar. Ich kenne den Chat mittlerweile. Ich"}, {"id": 56, "start": 498.92, "end": 503.84, "text": "weiß halt schon Bescheid, was da los ist. Manchmal ist mir es schon klar, während ich was ausspreche,"}, {"id": 57, "start": 503.84, "end": 508.76, "text": "weiß ich, da kommt jetzt das und es ist immer... Meistens so. 99% der Fälle."}, {"id": 58, "start": 508.76, "end": 516.56, "text": "Hast noch 2TB auf einer Platte frei. Soll ich dir meine 1TB Platte schicken, die ich bei"}, {"id": 59, "start": 516.56, "end": 525.0, "text": "meiner letzten Kiste aus Versehen mitgeordert habe? Seagate Barracuda 1TB. Wobei, das Versandkosten"}, {"id": 60, "start": 525.0, "end": 538.16, "text": "sind teurer, als die Festplatte in Prime bei Amazon zu bestellen. Ah, der Preischamp. Der"}, {"id": 61, "start": 538.16, "end": 543.76, "text": "Preischamp ist offline. Der Preischamp, den gibt es nicht mehr. Den Preischamp, da solltest"}, {"id": 62, "start": 543.76, "end": 547.88, "text": "du eigentlich noch nicht mal einen 404 kriegen. Beim Preischamp solltest du eigentlich... Ach"}, {"id": 63, "start": 547.88, "end": 555.08, "text": "so, ich habe Cloudflare noch nicht gelöscht. Deswegen gibt es den 404. Oder habe ich Cloudflare"}, {"id": 64, "start": 555.08, "end": 561.84, "text": "schon gelöscht? Sehen wir gleich. Bilde mir eigentlich ein, ich habe alles schon gelöscht,"}, {"id": 65, "start": 561.84, "end": 571.68, "text": "aber habe ich Cloudflare vielleicht nicht gelöscht. Na gut. Soll ich euch mal was erzählen? Übrigens,"}, {"id": 66, "start": 571.68, "end": 578.88, "text": "ich zeige euch erstmal, was wir heute machen. Der Defu. Digital. Ne, ne. Ne, ne, ne. Wie"}, {"id": 67, "start": 578.88, "end": 588.32, "text": "hießen die? Defu. Doch, der Defu. Ach, sie haben sogar eine... Guck mal. Defu.de haben"}, {"id": 68, "start": 588.32, "end": 597.2, "text": "die sogar. Eine Umlautdomain. Hier. Eine Emoji-Domain. Also mit diesen Escapes kann"}, {"id": 69, "start": 597.2, "end": 602.72, "text": "man auch Emoji-Domains machen. Guckt euch das mal an. So. Das machen wir gleich. Das"}, {"id": 70, "start": 602.72, "end": 606.88, "text": "machen wir gleich. Aber vorher muss ich euch noch was erzählen. Könnt ihr euch noch dran"}, {"id": 71, "start": 606.88, "end": 612.6, "text": "erinnern? Ihr habt mich sogar letzten Sonntag danach gefragt. Könnt ihr euch noch dran"}, {"id": 72, "start": 612.6, "end": 618.04, "text": "erinnern, als ich euch erzählt habe, ich musste letzten Montag was präsentieren auf der Arbeit."}, {"id": 73, "start": 618.04, "end": 621.96, "text": "Wobei, was heißt ich musste? Ich habe das sogar freiwillig gesagt. Ich mach das. Und"}, {"id": 74, "start": 621.96, "end": 627.16, "text": "ich muss was präsentieren. Und ich habe euch ja auch erzählt, ich werde mich wahrscheinlich"}, {"id": 75, "start": 627.16, "end": 631.92, "text": "nicht sonderlich beliebt dabei machen. Könnt ihr euch wahrscheinlich noch dran erinnern,"}, {"id": 76, "start": 631.92, "end": 634.84, "text": "weil es haben mich sogar am Sonntag viele gefragt. So, und Max, wie lief es denn? Und"}, {"id": 77, "start": 634.84, "end": 640.6, "text": "am Sonntag habe ich noch gesagt, jawoll, lief wunderbar. Und heute, Leute, ich sag euch,"}, {"id": 78, "start": 640.6, "end": 644.68, "text": "wir wurden heute, ich hab das ja mit einem Kollegen zusammen gemacht, alter Patrick,"}, {"id": 79, "start": 644.68, "end": 657.56, "text": "35 Monate Hyper-Subscription, jetzt geht's ab. Richtig, Pog, dankeschön. So, wo bin"}, {"id": 80, "start": 657.56, "end": 664.52, "text": "ich stehen geblieben? Genau, und heute, und heute, wir wurden übertrieben gelobt. Das"}, {"id": 81, "start": 664.52, "end": 670.36, "text": "erlebt man bei mir auf der Arbeit selten, ja. Wir wurden übertrieben gelobt, wie toll"}, {"id": 82, "start": 670.36, "end": 675.68, "text": "das war, dass wir das präsentiert haben. Und es hat manchen Leuten die Augen geöffnet."}, {"id": 83, "start": 675.68, "end": 681.56, "text": "Und da habe ich mir auch schon gedacht, easy clap. Wisst ihr, wisst ihr, wisst ihr, was"}, {"id": 84, "start": 681.56, "end": 687.08, "text": "eigentlich, was wir eigentlich gemacht haben? Wir haben eine halbe Stunde eigentlich durchgängig"}, {"id": 85, "start": 687.08, "end": 696.4, "text": "erzählt, wie kacke so eine gewisse Sache ist bei uns. Aber anscheinend musste das mal"}, {"id": 86, "start": 696.4, "end": 699.96, "text": "sein. Was hast du präsentiert? Ich muss mal kurz gucken, wie ich das am besten überschreibe."}, {"id": 87, "start": 699.96, "end": 711.96, "text": "Ich habe über die Probleme beim Remote-Arbeiten berichtet und wie bei uns Sicherheit und Bedienbarkeit"}, {"id": 88, "start": 711.96, "end": 717.8, "text": "in Konflikt steht. Ich glaube, so kann man das ganz gut beschreiben. Weil es wird immer"}, {"id": 89, "start": 717.8, "end": 722.64, "text": "abge... Leute, ich erzähle euch was. Pass mal auf, pass mal auf. Eine absolut abgedrehte"}, {"id": 90, "start": 722.64, "end": 734.0, "text": "Ausgeburt der Hölle, die sie sich jetzt überlegt haben bei uns auf der Arbeit. Also, damit du"}, {"id": 91, "start": 734.0, "end": 741.76, "text": "bei uns auf wichtige Systeme kommst, Remote, wenn du Homeoffice machst oder sowas, kannst"}, {"id": 92, "start": 741.76, "end": 748.52, "text": "du nicht einfach nur dich irgendwie connecten oder kommst du überall hin. Nein, das ist"}, {"id": 93, "start": 748.52, "end": 753.28, "text": "ein bisschen komplizierter gemacht, was ja prinzipiell auch kein Problem ist. Du verbindest"}, {"id": 94, "start": 753.28, "end": 759.28, "text": "dich per Zwei-Faktor-Authentifizierung auf ein Portal. In diesem Portal... Ja, ich habe"}, {"id": 95, "start": 759.28, "end": 771.32, "text": "mir das schon gleich aufgeschrieben in meinem Dokument. So, in diesem Portal machst du"}, {"id": 96, "start": 771.32, "end": 777.96, "text": "dann eine Shitrix-VM auf und von dort kannst du dich dann connecten. Da ist auch ein bisschen"}, {"id": 97, "start": 777.96, "end": 785.08, "text": "mehr drumherum, aber ich will jetzt nicht alles genau erzählen. So, das war schon in der Vergangenheit"}, {"id": 98, "start": 785.08, "end": 796.24, "text": "ein bisschen gewöhnungsbedürftig. Aber das war insofern okay, weil man das meistens wirklich"}, {"id": 99, "start": 796.24, "end": 804.44, "text": "nur für Admin... Also, für Live-Administrationszeug... Es ist mega clunky und laggy as fuck. Für"}, {"id": 100, "start": 804.44, "end": 810.72, "text": "Admin-Administrationszeug gebraucht hat und Wolle, danke schön für den Sub. Und deswegen"}, {"id": 101, "start": 810.72, "end": 815.12, "text": "es ging. Man konnte sich dann auch irgendwie tunneln, auch wenn es nur so Grauzone war,"}, {"id": 102, "start": 815.12, "end": 822.36, "text": "ob das überhaupt erlaubt ist. So, aber jetzt haben sie den Vogel abgeschossen. Die ganze"}, {"id": 103, "start": 822.36, "end": 829.96, "text": "Zeit war das so, für Datenaustausch konnte man entweder VPN verwenden, also was weiß"}, {"id": 104, "start": 829.96, "end": 836.12, "text": "ich, wenn ich irgendwelche größeren Sachen irgendwie rumkopieren muss. Sei es, dass die"}, {"id": 105, "start": 836.12, "end": 841.32, "text": "Sekretärin irgendeine 50 MB Excel-Datei kopieren muss oder dass man Logs mal rumkopieren muss"}, {"id": 106, "start": 841.32, "end": 848.12, "text": "oder so. Also, für Datenaustausch hatte man Folgendes. Entweder VPN oder man konnte das"}, {"id": 107, "start": 848.12, "end": 851.92, "text": "Notebook aus der Firma mitnehmen oder sich so geheim schicken lassen, wenn man da Homeoffice"}, {"id": 108, "start": 851.92, "end": 859.24, "text": "hat. Oder man hatte eine normale Office-VM, auch über Shitrix. So, und da gab es dann"}, {"id": 109, "start": 859.24, "end": 868.32, "text": "ein gemeinsames Windows-Share für seinen User. Und die Musik ist ein bisschen lauter. Außerdem"}, {"id": 110, "start": 868.32, "end": 883.72, "text": "ist die Musik äußerst nervös. So. Die ist mir immer noch zu nervös. Die mag zwar"}, {"id": 111, "start": 883.72, "end": 896.52, "text": "happy sein, ja, viel besser. So. Und dann haben sie sich... Irgendwie ist die Musik"}, {"id": 112, "start": 896.52, "end": 911.48, "text": "jetzt zu nervig gerade. Okay. Gut. Wunderbar. Also, wo bin ich stehen geblieben? Ja, also"}, {"id": 113, "start": 911.48, "end": 916.04, "text": "du konntest das Datenaustausch noch halbwegs normal machen. Du hattest so einen Windows-Share"}, {"id": 114, "start": 916.04, "end": 919.68, "text": "für deinen User und da konntest du Zeug drüber kopieren. Das war auch relativ schnell. Ist"}, {"id": 115, "start": 919.68, "end": 922.96, "text": "alles okay gewesen. So. Und jetzt kommt der Hammer. Das war so auch mit der Steine des"}, {"id": 116, "start": 922.96, "end": 926.6, "text": "Anstoßes. Als ich gesagt habe, jetzt reicht es, kann ich nicht mehr arbeiten. Ich kann"}, {"id": 117, "start": 926.6, "end": 930.28, "text": "mich auch gerne hinsetzen, ohne was zu machen und ihr gebt mir Geld. Aber das kann so nicht"}, {"id": 118, "start": 930.28, "end": 937.12, "text": "sein. Man hat sich jetzt Folgendes überlegt. Jetzt haltet euch fest. Wir ersetzen, also"}, {"id": 119, "start": 937.12, "end": 944.8, "text": "sie ersetzen den Windows-Share durch OneDrive. So. Und jetzt erzähle ich euch mal ein wirklich"}, {"id": 120, "start": 944.8, "end": 953.48, "text": "praktisch so passiertes Anwendungsszenario. Ein Kollege von mir, das habe ich euch ja"}, {"id": 121, "start": 953.48, "end": 958.84, "text": "schon mal vor einer Weile erzählt, dass wir in der Richtung was gemacht haben, hat, hat,"}, {"id": 122, "start": 958.84, "end": 967.84, "text": "hat, ja ja OneDrive, OneDrive. Ein Kollege von mir hat Hilfe gebraucht bei Log-Auswertung."}, {"id": 123, "start": 967.84, "end": 972.36, "text": "Der hatte glaube ich irgendwie zwei Terabyte Squid-Logs. Und die Squid-Logs sollten durchsucht"}, {"id": 124, "start": 972.36, "end": 977.04, "text": "werden, ob irgendwelche speziellen Aufrufe drin sind, um daraus ableiten zu können,"}, {"id": 125, "start": 977.04, "end": 982.36, "text": "ob Firewall-Regeln noch gebraucht werden. Ist egal warum. So. Zumindest Squid-Logs durchsuchen."}, {"id": 126, "start": 982.36, "end": 987.44, "text": "Also was haben wir gemacht? Haben wir gesagt, hey das haben wir doch schon mal gemacht. Ich"}, {"id": 127, "start": 987.44, "end": 991.84, "text": "hatte nämlich, er hatte das damals in Bash programmiert. Und ohne Scheiß, Bash hat eine"}, {"id": 128, "start": 991.84, "end": 998.36, "text": "Woche die Squid-Logs durchsucht. Eine Woche Leute. Eine Woche. So. Danach sind wir hingegangen,"}, {"id": 129, "start": 998.36, "end": 1004.64, "text": "haben ein.NET Programm gebastelt. Multithreaded 24 Kerne auf einer richtig fetten Kiste. Multithreaded"}, {"id": 130, "start": 1004.64, "end": 1009.96, "text": "24 Kerne. Das meiste auch noch irgendwie 128 Gigabyte RAM. Das meiste eben RAM gehalten"}, {"id": 131, "start": 1009.96, "end": 1015.76, "text": "mit einem Dictionary gedifft, gemacht, geguckt, gezählt, gecounted. Am Ende lief es irgendwie"}, {"id": 132, "start": 1015.76, "end": 1021.88, "text": "40 Minuten oder so versus eine Stunde. Also 40 Minuten Programm in C-Sharp Multithreaded"}, {"id": 133, "start": 1021.88, "end": 1026.16, "text": "versus eine Woche in Bash. Das kann durchaus sein. Bash ist nicht sonderlich effektiv."}, {"id": 134, "start": 1026.16, "end": 1031.52, "text": "Vor allem wenn man das auch noch ein bisschen umständlich macht. So. Und das war, das war"}, {"id": 135, "start": 1031.52, "end": 1034.64, "text": "der Plan. Wir haben gesagt, weißt was, haben wir doch schon mal gemacht. Wir nehmen einfach"}, {"id": 136, "start": 1034.64, "end": 1040.56, "text": "dieses Programm und passen das, passen das an für den neuen Anwendungsfall. So. Und jetzt"}, {"id": 137, "start": 1040.56, "end": 1047.0, "text": "haltet euch fest. Jetzt, jetzt kommt's. Mein, mein Datenaustausch. Wie lange habt ihr daran"}, {"id": 138, "start": 1047.0, "end": 1051.76, "text": "programmiert? Das ist nicht sonderlich kompliziert. Zwei, drei Stunden. Das war nicht, ist kein"}, {"id": 139, "start": 1051.76, "end": 1060.56, "text": "großer Akt gewesen. Zumindest. Dadurch, dass ich jetzt keinen Share mehr habe, den ich"}, {"id": 140, "start": 1060.56, "end": 1064.68, "text": "irgendwie von einem Notebook verwenden kann, von einer VM verwenden kann, von einer Administrationskiste"}, {"id": 141, "start": 1064.68, "end": 1068.12, "text": "verwenden kann. Ich hab keinen Windows Share. Also ich hab keinen Share mehr. Musste ich"}, {"id": 142, "start": 1068.12, "end": 1075.28, "text": "jetzt folgendes machen. Als erstes musste ich mir eine Beispiel-Log-Datei ziehen. Das"}, {"id": 143, "start": 1075.28, "end": 1082.72, "text": "ging nicht. Weil der Virenscanner gesagt hat, die Datei ist größer als 30 MB, wird abgebrochen."}, {"id": 144, "start": 1082.72, "end": 1088.88, "text": "Ist bestimmt Ransomware. So. Also Testlogs ziehen hat schon mal nicht funktioniert. Okay."}, {"id": 145, "start": 1088.88, "end": 1093.28, "text": "Aber jetzt kommt, jetzt kommt, jetzt kommt der absolute Hit. Jetzt kommt der absolute"}, {"id": 146, "start": 1093.28, "end": 1101.24, "text": "Hit. Ich hab dann, weil ich es ums Verrecken nicht machen konnte, mit der, mit der VM,"}, {"id": 147, "start": 1101.24, "end": 1108.16, "text": "die mir die Firma zur Verfügung stellt, hab ich lokal bei mir eine Ubuntu VM gebootet,"}, {"id": 148, "start": 1108.16, "end": 1114.84, "text": "mit Rider und allem, was ich an Entwicklung brauche für.NET Programme, hab mir ein Log-Auszug"}, {"id": 149, "start": 1114.84, "end": 1121.52, "text": "kopiert, 10 MB, und hab das angepasst, das Programm. So. Also allein schon, dass ich"}, {"id": 150, "start": 1121.52, "end": 1124.48, "text": "das auf einer privaten VM machen muss, ist halt absolut lächerlich, dass die Firma das"}, {"id": 151, "start": 1124.48, "end": 1128.48, "text": "dann auf die Reihe kriegt. So. Und jetzt, und jetzt, und jetzt, und jetzt kommt wirklich"}, {"id": 152, "start": 1128.48, "end": 1135.4, "text": "der Hit. Das war, ich war fertig, hab's kompiliert, und wir wissen ja, sobald's kompiliert, funktioniert"}, {"id": 153, "start": 1135.4, "end": 1141.88, "text": "das auch, und jetzt war die Frage, wie kriege ich dieses Programm denn auf die fette 24"}, {"id": 154, "start": 1141.88, "end": 1146.92, "text": "Kerne Kiste drauf, wo die Logs draufliegen zum Auswerten. Ich hatte keinen gemeinsamen"}, {"id": 155, "start": 1146.92, "end": 1152.4, "text": "Share mehr, und ich hab allen Ernstes, jetzt, kein Witz, ich musste mich lokal auf meiner"}, {"id": 156, "start": 1152.4, "end": 1157.6, "text": "Ubuntu VM in meinem OneDrive einloggen, das Programm dort hochladen, dann musste ich"}, {"id": 157, "start": 1157.6, "end": 1162.76, "text": "mich über eine Shitrix-Administrations-VM verbinden, dort das Programm runterladen"}, {"id": 158, "start": 1162.76, "end": 1171.36, "text": "von OneDrive, dann per SCP auf den Produktionsjump-Host kopieren, von dort auf den Server kopieren,"}, {"id": 159, "start": 1171.36, "end": 1177.68, "text": "und dann starten, und dann feststellen, und dann feststellen, dass ich was vergessen hab,"}, {"id": 160, "start": 1177.68, "end": 1184.92, "text": "und wieder von vorne. Ohne Scheiß, das hat zwei Stunden gedauert, für fünfmal kompiliert"}, {"id": 161, "start": 1184.92, "end": 1194.32, "text": "und dann so. Das war der absolute Over-Up-Fuck. Einziger Workflow, ja, richtig geil, das ist"}, {"id": 162, "start": 1194.32, "end": 1201.28, "text": "so der übende, richtig krasser Business-Enterprise-Workflow, ne? Musst du dich auch mit Microsoft Access"}, {"id": 163, "start": 1201.28, "end": 1210.0, "text": "nein, zum Glück nicht. Richtiger Lean-Up, safe, safe und lean ist der, ja. ITIL zertifiziert"}, {"id": 164, "start": 1210.0, "end": 1217.12, "text": "auch noch, DIN ISO 9001, alles auf einmal. So, und ganz ehrlich, da war der Punkt erreicht,"}, {"id": 165, "start": 1217.12, "end": 1222.24, "text": "wo ich gesagt, Leute, ich kann so nicht arbeiten, also erst will ich so nicht arbeiten, ich kann"}, {"id": 166, "start": 1222.24, "end": 1226.96, "text": "auch so nicht arbeiten, und das müssen wir jetzt mal ein bisschen an die größere Glocke"}, {"id": 167, "start": 1226.96, "end": 1233.96, "text": "hängen. Und deswegen haben wir das letzte Woche vorgestellt auf einer abteilungsübergreifenden"}, {"id": 168, "start": 1233.96, "end": 1239.88, "text": "Security-Runde, da waren alle möglichen Abteilungsleiter da, und die sind der letzten Montag da irgendwie"}, {"id": 169, "start": 1239.88, "end": 1245.2, "text": "aus allen Wolken gefallen. Und heute hat uns dann jemand erzählt, dass das halt eben eine"}, {"id": 170, "start": 1245.2, "end": 1251.72, "text": "ganz tolle, augenöffnende Präsentation war. Was im Endeffekt heißt, ihnen war gar nicht"}, {"id": 171, "start": 1251.72, "end": 1262.36, "text": "klar, wie beschissen das ist, was sie da gebaut haben. Oh man, die, aber muss ich sagen, also"}, {"id": 172, "start": 1262.36, "end": 1266.4, "text": "entweder ist das die Standard-Taktik, so nach dem Motto, boah habt ihr gut gemacht, wir"}, {"id": 173, "start": 1266.4, "end": 1274.12, "text": "schmeißen euch jetzt raus, oder die fanden das wirklich gut. Kann ja sein, ja. Zumindest"}, {"id": 174, "start": 1274.12, "end": 1278.0, "text": "scheint ihnen klar zu sein, aber ich hab auch wirklich, ich hab, wir haben denen auch wirklich"}, {"id": 175, "start": 1278.0, "end": 1283.96, "text": "alles, alles aufs Brot geschmiert. Also die Präsentation lief ungefähr so ab, also ganz,"}, {"id": 176, "start": 1283.96, "end": 1289.24, "text": "ganz grob, wir haben gesagt, ja hallo hier Max, und hallo hier Dings, mit dem ich das"}, {"id": 177, "start": 1289.24, "end": 1293.24, "text": "gemacht hab, die meisten kennen uns ja, aber wir sind jetzt auch mal hier am Start, und"}, {"id": 178, "start": 1293.24, "end": 1298.16, "text": "heute müssen wir ein bisschen meckern, und das und das und das kommt heute. Und dann"}, {"id": 179, "start": 1298.16, "end": 1303.36, "text": "hab ich gleich mit dem richtigen Knaller gestartet, ich hab einen Screenshot gemacht, als meine"}, {"id": 180, "start": 1303.36, "end": 1308.04, "text": "Administrations-VM das letzte Mal zu wenig RAM hatte und mein Browser gecrasht ist, hab"}, {"id": 181, "start": 1308.04, "end": 1314.12, "text": "ich gleich gescreenshotted, ich hab sogar extra ein GIF danach noch gemacht, von den"}, {"id": 182, "start": 1314.12, "end": 1321.24, "text": "Dingern, die abgekackt sind, da hab ich gesagt, so die Admin-VM, langsam, laggy, copy-paste"}, {"id": 183, "start": 1321.24, "end": 1327.64, "text": "geht nicht, und manchmal verliert man seine Arbeit, weil es crasht. Und da konnten sich"}, {"id": 184, "start": 1327.64, "end": 1332.8, "text": "auch irgendwelche Excel-Schubser relaten dazu und haben das verstanden. Das ist keine"}, {"id": 185, "start": 1332.8, "end": 1340.76, "text": "gute Idee. Ja, und dann haben wir danach noch, danach hat mein Kollege übernommen, und"}, {"id": 186, "start": 1340.76, "end": 1348.12, "text": "nein, die Präsentation hatte nur Emojis, keine Twitch-Emojis. So, zumindest, danach"}, {"id": 187, "start": 1348.12, "end": 1351.4, "text": "hab ich gemeint, so ich übergebe jetzt mal kurz hier an meinen Kollege, ich sag jetzt"}, {"id": 188, "start": 1351.4, "end": 1355.88, "text": "den Namen nicht, weil ich kann sagen, Tim heißt er, das ist ja nix, nix, nix, geheimes,"}, {"id": 189, "start": 1355.88, "end": 1363.08, "text": "also ich übergebe jetzt an den Tim, und der erzählt jetzt noch mal die vielen Kleinigkeiten,"}, {"id": 190, "start": 1363.08, "end": 1366.76, "text": "die an der Admin-VM nerven, da hat der Tim angefangen, und ohne Scheiß, vier Seiten,"}, {"id": 191, "start": 1366.76, "end": 1370.04, "text": "vier Seiten, erster Punkt, zweiter Punkt, dritter Punkt, vierter Punkt, fünfter Punkt,"}, {"id": 192, "start": 1370.04, "end": 1376.8, "text": "sechster Punkt, da hat er das auch so richtig durchgerannt, vier Seiten, einfach so in"}, {"id": 193, "start": 1376.8, "end": 1382.64, "text": "fünf Minuten, bam, bam, bam, bam, mit Punkten drauf, die alle kacke sind, und danach hat"}, {"id": 194, "start": 1382.64, "end": 1386.84, "text": "denen schon der Kopf geraucht, da haben wir gesagt, was, so viel ist da im Arsch, da bin"}, {"id": 195, "start": 1386.84, "end": 1392.4, "text": "ich noch mal dran gekommen und hab noch mal, da hab ich das Beispiel gebracht mit dem OneDrive"}, {"id": 196, "start": 1392.4, "end": 1399.64, "text": "kopieren, und noch ein anderes Beispiel, und ich glaube, spätestens dann war vorbei, ich"}, {"id": 197, "start": 1399.64, "end": 1403.44, "text": "glaube, da hatten wir uns alle insofern überzeugt, dass das so wie es jetzt ist, absolut kacke"}, {"id": 198, "start": 1403.44, "end": 1408.32, "text": "ist. So, und warum erzähl ich euch das Ganze jetzt, nicht nur weil wir irgendwie, nicht"}, {"id": 199, "start": 1408.32, "end": 1414.44, "text": "nur weil sie uns super gelobt haben, was ich natürlich immer tolle finde, ja, kann ich"}, {"id": 200, "start": 1414.44, "end": 1419.36, "text": "gleich, sag ich gleich was zu, nein, nein, noch viel besser, typische Business Enterprise"}, {"id": 201, "start": 1419.36, "end": 1423.52, "text": "Move würde heute versucht, die haben uns erstmal, die haben uns total gelobt, haben"}, {"id": 202, "start": 1423.52, "end": 1427.2, "text": "gesagt, oh, war ja richtig, hat die richtig Augen geöffnet in die Präsentation und sonst"}, {"id": 203, "start": 1427.2, "end": 1432.36, "text": "was, hab ich schon gedacht, oh nein, freut mich, freut mich, und dann kam die Frage,"}, {"id": 204, "start": 1432.36, "end": 1436.52, "text": "und jetzt haltet euch fest, das ist so die typische Business Enterprise Frage, dann"}, {"id": 205, "start": 1436.52, "end": 1441.08, "text": "wollten sie uns fragen, so ja, ob wir denn dieses Thema jetzt auch weiter vorantreiben"}, {"id": 206, "start": 1441.08, "end": 1451.6, "text": "können, da hab ich mir so gedacht, nee, das dürft ihr schon schön selber machen, ich"}, {"id": 207, "start": 1451.6, "end": 1456.44, "text": "treib doch nicht, ich guck mal, ich schreib mir doch nicht dieses Drecks Thema auf die"}, {"id": 208, "start": 1456.44, "end": 1466.48, "text": "Fahne, allen Ernstes, ob wir das Thema jetzt weiter vorantreiben, ich glaub, es geht los,"}, {"id": 209, "start": 1466.48, "end": 1467.48, "text": "ja."}, {"id": 210, "start": 1467.48, "end": 1474.48, "text": "Das einzige, wozu wir uns haben breitschlagen lassen, ist, dass wir jetzt, dass wir jetzt"}, {"id": 211, "start": 1474.48, "end": 1481.88, "text": "als Ansprechpartner uns bereitstellen, wenn es Updates für diese Administrations-VM gibt,"}, {"id": 212, "start": 1481.88, "end": 1490.2, "text": "und ob wir, dass wir die dann testen, wenn es sie dann gibt, ja, aber ganz bestimmt treibe"}, {"id": 213, "start": 1490.2, "end": 1493.92, "text": "ich jetzt diesen Mist nicht weiter voran, das ist überhaupt nicht, das ist erstens"}, {"id": 214, "start": 1493.92, "end": 1497.96, "text": "über meiner Gehaltsklasse, das ist auch überhaupt nicht mein Ding, ich will damit auch nichts"}, {"id": 215, "start": 1497.96, "end": 1504.2, "text": "zu tun haben, ich will es einfach nur benutzen, weil ich unterm Strich einfach nur arbeiten"}, {"id": 216, "start": 1504.2, "end": 1512.12, "text": "will, ohne dass es mich die ganze Zeit abfuckt, ach, zu scheiße, naja gut, wie alt bist du,"}, {"id": 217, "start": 1512.12, "end": 1521.56, "text": "ich bin 37, ja, 37, ich bin 1984 geboren, ja, aber jetzt was zu dieser Frage, bevor"}, {"id": 218, "start": 1521.56, "end": 1531.12, "text": "wir dann den Internetführerschein machen, ja, das hat weder mit DevOps noch mit Entwicklung"}, {"id": 219, "start": 1531.12, "end": 1534.6, "text": "noch mit sonst was zu tun, das ist Infrastruktur bereitstellen, das hat mit meinem Zeug überhaupt"}, {"id": 220, "start": 1534.6, "end": 1540.52, "text": "nichts zu tun, zum Glück, ich hätte es überhaupt nichts, ich hätte mir garantiert keine Shit-Tricks-Geschichte"}, {"id": 221, "start": 1540.52, "end": 1546.28, "text": "hingestellt zum Remote-Arbeiten, so, hier Radiosignal-Frag, habe ich das richtig verstanden,"}, {"id": 222, "start": 1546.28, "end": 1548.92, "text": "du programmierst unter Linux mit C-Sharp, kompilierst und schiebst dann das Programm"}, {"id": 223, "start": 1548.92, "end": 1552.96, "text": "auf dem Windows Server, nein, nein, nein, das sind Linux-Kisten, alles Linux, wir haben"}, {"id": 224, "start": 1552.96, "end": 1568.8, "text": "zu 99% Linux bei uns, Red Hat, Red Hat-Kompatibel, sagen wir es mal so, gibt da nicht viel,"}, {"id": 225, "start": 1568.8, "end": 1574.8, "text": "außer CentOS, was es sein könnte, ne, es gab mal, früher gab es Scientific und jetzt"}, {"id": 226, "start": 1574.8, "end": 1579.84, "text": "gibt es Rocky, Rocky, ich weiß nicht, ob Rocky, irgendjemand schon Rocky Linux im Einsatz"}, {"id": 227, "start": 1579.84, "end": 1588.92, "text": "hat, ne, Susie, Susie ist bäh, ne, Red Hat-Kompatibel bedeutet im Endeffekt nur, es ist quasi"}, {"id": 228, "start": 1588.92, "end": 1595.92, "text": "ein Red Hat mit Red Hat-Logos entfernt, das sind die Red Hat-Sources neu kompiliert, ohne"}, {"id": 229, "start": 1595.92, "end": 1601.72, "text": "die Copyrights-Sachen drin, ich habe nicht studiert, nein, ich habe mal 2007 fachinformatischer"}, {"id": 230, "start": 1601.72, "end": 1613.84, "text": "Systemedikation gelernt, ne, ne, aber das sind alles Linux-Kisten bei uns, wir haben"}, {"id": 231, "start": 1613.84, "end": 1620.52, "text": "ein paar Windows Server, aber da habe ich Gott sei Dank nichts mit zu tun, Wushild Studio"}, {"id": 232, "start": 1620.52, "end": 1625.72, "text": "Code kann doch Remote Code Developen, über SSH würde das gehen, ne, nicht so einfach,"}, {"id": 233, "start": 1625.72, "end": 1647.28, "text": "tja, möglich, könnte ich das vielleicht sein, ich mein, ich hab das gleiche Profilfoto,"}, {"id": 234, "start": 1647.28, "end": 1668.0, "text": "ich höre mich genauso an, ich laber den gleichen Scheiß, ich würd sagen Exposed, oh man, ok,"}, {"id": 235, "start": 1668.0, "end": 1671.6, "text": "Leute, ja und mein YouTube-Kanal ist auch verlinkt, so, das dachte ich mir, das muss"}, {"id": 236, "start": 1671.6, "end": 1677.04, "text": "ich euch jetzt mal erzählen, jetzt gucken wir, jetzt machen wir den Digitalführerschein,"}, {"id": 237, "start": 1677.04, "end": 1682.6, "text": "wir müssen erst mal gucken, ob die Seite im Darkreader besser aussieht, naja, zumindest"}, {"id": 238, "start": 1682.6, "end": 1687.2, "text": "kriegt man nicht gleich Augenverbrennung, wenn man sich die Seite anschaut, so, also"}, {"id": 239, "start": 1687.2, "end": 1692.48, "text": "das ist jetzt neu, das gibt es seit heute, kannst du dich noch an mich erinnern, wer"}, {"id": 240, "start": 1692.48, "end": 1699.24, "text": "bist du denn auf YouTube, wahrscheinlich nicht, es gibt ein paar an, die kann ich mich erinnern,"}, {"id": 241, "start": 1699.24, "end": 1703.12, "text": "oder es gibt ein paar Namen, wenn ich die sehe, kann ich mich dran erinnern, aber bei"}, {"id": 242, "start": 1703.12, "end": 1713.2, "text": "fast 300.000 Abonnenten ist es schwierig, da jetzt im Detail jeden zu kennen, ist ja klar,"}, {"id": 243, "start": 1713.2, "end": 1718.88, "text": "das ist echt, nein, das ist echt, es gibt jetzt wirklich seit heute, gibt es einen neuen"}, {"id": 244, "start": 1718.88, "end": 1733.04, "text": "Internetführerschein, du dachtest, wir sind alle deine Freunde, ja ihr seid so, also wenn"}, {"id": 245, "start": 1733.04, "end": 1738.2, "text": "ihr Primes habt, können wir darüber reden, aber genauso wie Bibi zufällig die Uhr, die"}, {"id": 246, "start": 1738.2, "end": 1742.04, "text": "sie vorstellt, heute im Laden entdeckt hat und nicht dafür gesponsert wird."}, {"id": 247, "start": 1742.04, "end": 1750.08, "text": "Heißt er auf YouTube HelpfulGuy, einer deiner größten Fans damals, keine Ahnung, also das"}, {"id": 248, "start": 1750.08, "end": 1754.24, "text": "ist schon so lange her, weiß ich nicht, sagt mir jetzt nichts, aber trotzdem schön, dass"}, {"id": 249, "start": 1754.24, "end": 1764.08, "text": "du deine Wege hierher gefunden hast."}, {"id": 250, "start": 1764.08, "end": 1772.08, "text": "Cringe wenn ich seine Abonnenten kenne, sage ich dazu nur, ja also es war kein Memetitel,"}, {"id": 251, "start": 1772.08, "end": 1780.0, "text": "ich mache heute wirklich den neuen Digitalführerschein, so und was das sein soll ist, das ist vom"}, {"id": 252, "start": 1780.0, "end": 1786.64, "text": "Bundesinnenministerium ein neuer Online, wie nennen wir das, Fortbildungslernplattform"}, {"id": 253, "start": 1786.64, "end": 1793.84, "text": "mit Tests, wo man dann angeblich, so schwebt es denen vor, ich habe da ja so meine Zweifel"}, {"id": 254, "start": 1793.84, "end": 1801.2, "text": "wenn ich ehrlich bin, woran man dann auch für den beruflichen Weg, also quasi für"}, {"id": 255, "start": 1801.2, "end": 1811.64, "text": "Jobsuche und sonst was, sein Digital und Internet Knowhow unter Beweis stellen kann, so das sagen"}, {"id": 256, "start": 1811.64, "end": 1820.56, "text": "die, nachdem das nicht das erste ist in dieser Richtung und die letzten Versuche in dieser"}, {"id": 257, "start": 1820.56, "end": 1826.68, "text": "Richtung ziemlich beschissen waren, um es mal klar zu sagen, habe ich meine Zweifel,"}, {"id": 258, "start": 1826.68, "end": 1830.2, "text": "dass das was taugt, aber das gucken wir uns jetzt erstmal an."}, {"id": 259, "start": 1830.2, "end": 1834.6, "text": "Moritz danke für den Sub, Lukas danke auch dir für den Sub, 2 Monate Cute Subscription"}, {"id": 260, "start": 1834.6, "end": 1842.16, "text": "hier, aber die sind modern, die sind modern, es ist Beta, es ist Beta, nicht Sigma, es"}, {"id": 261, "start": 1842.16, "end": 1850.44, "text": "ist Beta, ob da der EU Kommissar, der Oettinger für Digitalisierung oder Digital, bestimmt"}, {"id": 262, "start": 1850.44, "end": 1858.36, "text": "war da der Oettinger mit am Start, Deutschland sicher im Netz, so loslegen, wir gucken uns"}, {"id": 263, "start": 1858.36, "end": 1871.64, "text": "es jetzt an, Bäm, also, zum DeFi-Lernangebot, wie möchtest du den DeFi nutzen, ok, was"}, {"id": 264, "start": 1871.64, "end": 1877.44, "text": "ist der Unterschied, beruflicher Kontext, die Arbeitswelt bringt ihre ganz eigenen Herausforderungen"}, {"id": 265, "start": 1877.44, "end": 1880.24, "text": "mit sich, unser Lernangebot im Beruf, die bietet ihnen Inhalte, die speziell darauf"}, {"id": 266, "start": 1880.24, "end": 1887.2, "text": "zugestimmt, alles klar beruflicher Kontext, easy, Level 1, ne wir machen mal, wir machen"}, {"id": 267, "start": 1887.2, "end": 1891.64, "text": "mal eine Sache, wir fangen mal an, warum alles so groß ist, weil mein Browser auf, wobei"}, {"id": 268, "start": 1891.64, "end": 1897.2, "text": "der ist auch sonst relativ groß, wir fangen mal privat Level 1 an, nur mal so, just for"}, {"id": 269, "start": 1897.2, "end": 1901.76, "text": "fun um ein bisschen zu kecken, was die, wie die Fragen so sind, so und dann gibt es dann"}, {"id": 270, "start": 1901.76, "end": 1909.24, "text": "mehrere Kategorien mit jeweils 8 Fragen, Geräte, Internet, Kommunikation, Datenwelt,"}, {"id": 271, "start": 1909.24, "end": 1914.52, "text": "Gefahrenschutz, Technologie Alltag, so und da kann man jetzt wohl irgendwie einen Test"}, {"id": 272, "start": 1914.52, "end": 1923.2, "text": "machen, wir machen jetzt einen Test, jetzt müssen wir uns registrieren, POGChamp, N-Minute,"}, {"id": 273, "start": 1923.2, "end": 1933.92, "text": "Mail, jawoll, UAS, E-Mail-Adresse, Zack, ich brauche noch kurz ein Passwort random generate,"}, {"id": 274, "start": 1933.92, "end": 1939.68, "text": "Leute ich random generate jetzt ein Passwort, passt mal auf, exellent, boah das ist das"}, {"id": 275, "start": 1939.68, "end": 1955.76, "text": "randomeste Passwort aller Zeiten, so, vollschönige Name, Geburtstag, wie Geburtstag noch, 1.1.1900,"}, {"id": 276, "start": 1955.76, "end": 1967.28, "text": "ja genau, indem ich fortfache Stimmen in RGB registrieren, ja ja, ahja gut, wie, ich muss"}, {"id": 277, "start": 1967.28, "end": 1972.24, "text": "ja nicht mal eine Bestätigungs-E-Mail machen, keine Bestätigungs-E-Mail, was ist denn mit"}, {"id": 278, "start": 1972.24, "end": 1977.8, "text": "euch los, oh fuck jetzt habe ich zugemacht, wenn ich jetzt noch eine Bestätigungs-E-Mail"}, {"id": 279, "start": 1977.8, "end": 1988.24, "text": "brauche bin ich, oh nein ich habe mein Passwort geleakt, shit jetzt könnt ihr euch alle bei"}, {"id": 280, "start": 1988.24, "end": 1993.52, "text": "die für einloggen für mich, nein, ok ich mache einen neuen Account, so geht das dann"}, {"id": 281, "start": 1993.52, "end": 2004.04, "text": "nicht, neuen Account, neuen Account, 10-minute-mail, wir machen jetzt einen neuen Account, 10-nut-mail,"}, {"id": 282, "start": 2004.04, "end": 2017.24, "text": "nein, nein, nein, nein, 10-minute-mail.net, ok das ist jetzt neu, wobei scheiß drauf,"}, {"id": 283, "start": 2017.24, "end": 2021.2, "text": "was hatte ich denn vorher, ist doch scheiß egal ob ihr das Passwort seht, ich habe sogar"}, {"id": 284, "start": 2021.2, "end": 2024.72, "text": "meine E-Mail, Leute hat noch jemand die E-Mail Adresse von eben, ich kacke nur, ich habe"}, {"id": 285, "start": 2024.72, "end": 2029.4, "text": "es zugemacht einfach, egal ich registriere mich jetzt neu, so registrieren, jetzt können"}, {"id": 286, "start": 2029.4, "end": 2034.72, "text": "sie sich anmelden, nein, nein, nein, ich will mich neu registrieren, lass mich registrieren,"}, {"id": 287, "start": 2034.72, "end": 2059.84, "text": "jawoll, neues Passwort, ok, so, ja, Geburtstag, 1.01.2019, ok registrieren, anmelden, E-Mail"}, {"id": 288, "start": 2059.84, "end": 2072.4, "text": "Adresse, jawoll, da sind wir, Pock, was erwarte dich in der Diffi Prüfung, Leute ich glaube"}, {"id": 289, "start": 2072.4, "end": 2081.72, "text": "ich muss euch Flashbangen, ah mal gucken, was erwarte dich, wann gilt meine Prüfung"}, {"id": 290, "start": 2081.72, "end": 2091.0, "text": "als bestanden, moment, mindestens 50% der Fragen, was ist denn das für ein Müll, 50%,"}, {"id": 291, "start": 2091.0, "end": 2099.28, "text": "das kriegst du ja schon mit simplem randomisen hin, normalerweise musst du bei sowas 80 haben"}, {"id": 292, "start": 2099.28, "end": 2110.48, "text": "oder, oder sowas, oder maximal 2 falsch oder 50, das ist ja mies, ok, ich bin einverstanden,"}, {"id": 293, "start": 2110.48, "end": 2117.12, "text": "gucken wir uns das mal, das ist jetzt wohlgemerkt, das ist für die oberkacknoobs privat, nur"}, {"id": 294, "start": 2117.12, "end": 2127.36, "text": "zum warm werden, ja, also, was nutzen Smart Home Geräte nicht zur Datenübertragung, push,"}, {"id": 295, "start": 2127.36, "end": 2138.2, "text": "was auch immer push in dem Kontext bedeuten soll, keine Ahnung, weiter, was würdest"}, {"id": 296, "start": 2138.2, "end": 2143.36, "text": "du sagen, welche Maßnahmen tragen im Smart Home zur Sicherheit bei, regelmäßige Installation"}, {"id": 297, "start": 2143.36, "end": 2152.52, "text": "von Updates ist gut, Passwort in der Steuerungs App ist auch gut, Sicherheitsindex einschalten,"}, {"id": 298, "start": 2152.52, "end": 2167.56, "text": "was ist denn der Sicherheitsindex, hä, ok, ihr wisst es auch nicht, oder, ok, wir lassen"}, {"id": 299, "start": 2167.56, "end": 2173.44, "text": "das einfach mal, ich hab keine Ahnung, was der Sicherheitsindex ist, schalte den Index"}, {"id": 300, "start": 2173.44, "end": 2181.64, "text": "ein, ok, was musst du beachten, bevor du dir eine App auf dein Smart Home, äh, Smartphone"}, {"id": 301, "start": 2181.64, "end": 2186.36, "text": "lädst, ok, Bewertung im Netz zur App lesen, bei schlechten Bewertung die App lieber nicht,"}, {"id": 302, "start": 2186.36, "end": 2190.16, "text": "ja, das finde ich ist eine gute Idee, Kosten überprüfen nicht, alle Apps sind kostenlos,"}, {"id": 303, "start": 2190.16, "end": 2199.16, "text": "ja, vor dem Laden Cookies prüfen, ich mein, kann man machen, aber wozu ergibt in diesem"}, {"id": 304, "start": 2199.16, "end": 2209.64, "text": "Kontext wenig Sinn, ok, weiter, der Herr Demir hat eine Wetter App auf sein Smartphone heruntergeladen,"}, {"id": 305, "start": 2209.64, "end": 2214.08, "text": "diese fordert die Berechtigung ein auf das Adressbuch, oh nein, die russischen Hacker"}, {"id": 306, "start": 2214.08, "end": 2225.28, "text": "sind am Start, zuzugreifen, gekommenet, das ist die gehackte Wetter App, also, ähm, Leute,"}, {"id": 307, "start": 2225.28, "end": 2233.8, "text": "ich muss mal kurz husten, es ist übrigens schon besser, danke für die Nachfrage, letztens"}, {"id": 308, "start": 2233.8, "end": 2237.04, "text": "haben ganz viele sich dafür interessiert, ob alles wieder gut ist, husten, schon deutlich"}, {"id": 309, "start": 2237.04, "end": 2243.56, "text": "besser, viel, viel besser, ok, also, Herr Demir hat eine Wetter App auf sein Smartphone heruntergeladen,"}, {"id": 310, "start": 2243.56, "end": 2248.04, "text": "diese fordert die Berechtigung ein auf das Adressbuch im Smartphone zuzugreifen, sollte"}, {"id": 311, "start": 2248.04, "end": 2256.24, "text": "er der App Bewertung die Berechtigung gewähren, nein, das braucht kein Adressbuch, aber mittlerweile"}, {"id": 312, "start": 2256.24, "end": 2264.12, "text": "gehört es da zum guten Ton, dass du zig Berechtigungen anfragst, ja, Telefonberechtigungen, Standortlokalberechtigungen,"}, {"id": 313, "start": 2264.12, "end": 2268.08, "text": "Adressbuchberechtigung, alle möglichen, du brauchst einfach Berechtigung, am Endeffekt"}, {"id": 314, "start": 2268.08, "end": 2273.64, "text": "ist es irgendeine App, die Cookie-Clicker macht oder sowas, aber machen wir, machen wir,"}, {"id": 315, "start": 2273.64, "end": 2283.04, "text": "machen wir, nein, die App braucht nur um das Wetter, ok, Drucker, was, ach, soll ich das"}, {"id": 316, "start": 2283.04, "end": 2291.44, "text": "jetzt rüber tracken und droppen oder wie, so, boah, also, ich meine, meine Oma hätte"}, {"id": 317, "start": 2291.44, "end": 2295.28, "text": "den Test wahrscheinlich auch hingekriegt, aber wer braucht schon eine Erklärung dafür,"}, {"id": 318, "start": 2295.28, "end": 2300.48, "text": "ich meine, scheiß drauf, einfach, einfach oben hinschreiben, 5 von 8, das reicht, ok,"}, {"id": 319, "start": 2300.48, "end": 2305.8, "text": "Tastatur, App, Vierenschutz, wobei man, wobei es da jetzt schon ein bisschen Grauzone sein"}, {"id": 320, "start": 2305.8, "end": 2316.2, "text": "kann, Drucker, Monitor, App Store, Tablet, Betriebssystem, alles klar, next, in welchem"}, {"id": 321, "start": 2316.2, "end": 2320.4, "text": "Store findest du Apps für das Betriebssystem iOS, welches auf iPhones installiert ist,"}, {"id": 322, "start": 2320.4, "end": 2324.88, "text": "auf dem Microsoft Store, ganz ehrlich, im Microsoft Store findet man auch nicht mal"}, {"id": 323, "start": 2324.88, "end": 2329.2, "text": "Dinger auf Betriebssystem, die, wofür der Microsoft Store gedacht ist, also der Microsoft"}, {"id": 324, "start": 2329.2, "end": 2339.88, "text": "Store, den kannst du eigentlich immer streichen, so, App Store, wofür steht das W in WLAN,"}, {"id": 325, "start": 2339.88, "end": 2349.64, "text": "Watt, Wide, Kabel und Wireless, Wire, Wire, das berühmte WLAN Kabel, jetzt wird's, jetzt"}, {"id": 326, "start": 2349.64, "end": 2362.28, "text": "wird's etwa ein C8 von 8, Mo möchte ein Smart Home Grid kaufen, Mo, bestimmt die Abkürzung"}, {"id": 327, "start": 2362.28, "end": 2370.8, "text": "für Moritz oder sowas, Mo, erinnert mich an die Diablo 2 Kühe, kann sich da noch einer"}, {"id": 328, "start": 2370.8, "end": 2379.88, "text": "ausreden, Mo, Mo, Mo, Mo, es könnte auch Mohamed sein, richtig, muss nicht Moritz sein, man"}, {"id": 329, "start": 2379.88, "end": 2388.72, "text": "weiß ja heutzutage nicht, so, und man weiß auch nicht, ob Mo er ist, es könnte ja auch"}, {"id": 330, "start": 2388.72, "end": 2396.92, "text": "sie sein oder sonst was, Fahrräder und Helikopter, keine Ahnung, also Mo möchte ein Smart Home"}, {"id": 331, "start": 2396.92, "end": 2402.84, "text": "Gerät kaufen, er ja nicht triggert sein Chat, nicht gleich wieder ausrasten, ja, zieht"}, {"id": 332, "start": 2402.84, "end": 2410.8, "text": "es raus, direkt, so, Mo möchte ein Smart Home Gerät kaufen, leider sind die alle sehr teuer,"}, {"id": 333, "start": 2410.8, "end": 2416.2, "text": "er hat eine viel günstige Kopie eines Geräts bei einem Hersteller aus China, die China-Chinesen,"}, {"id": 334, "start": 2416.2, "end": 2422.12, "text": "da sind sie, die sollen genauso gut funktionieren wie das Original, soll er zuschlagen, ja,"}, {"id": 335, "start": 2422.12, "end": 2428.28, "text": "soll er, ich meine, die wollen wahrscheinlich sagen, dass man das nicht sollte, aber ihr"}, {"id": 336, "start": 2428.28, "end": 2432.96, "text": "kennt mich, also die richtige Antwort ist, also die Antwort, was die hören wollen ist"}, {"id": 337, "start": 2432.96, "end": 2441.8, "text": "A, die richtige Antwort ist aber eigentlich B, jetzt könnte ich meinen AliExpress Affiliate"}, {"id": 338, "start": 2441.8, "end": 2445.16, "text": "Code hier mal unter die Leute bringen, den ich nicht besitze, also gucken wir uns mal"}, {"id": 339, "start": 2445.16, "end": 2451.0, "text": "die Antworten an, nein, Smart Home Geräte sollte man nur von seriösen Herstellern bei"}, {"id": 340, "start": 2451.0, "end": 2455.12, "text": "vertrauenswürdigen Händlern kaufen, Kopien aus China haben leider oft Mängel in der Sicherheit"}, {"id": 341, "start": 2455.12, "end": 2459.08, "text": "oder in der Qualität, also ich kann euch eins sagen, Smart Home Geräte, wenn man nicht"}, {"id": 342, "start": 2459.08, "end": 2463.48, "text": "weiß, was die genau machen, beziehungsweise custom Firma vielleicht und sonst was, du"}, {"id": 343, "start": 2463.48, "end": 2468.52, "text": "weißt nie, was die normalerweise, also was die machen und du weißt auch nie, ob die Sicherheitsmängel"}, {"id": 344, "start": 2468.52, "end": 2474.76, "text": "haben, du kannst davon ausgehen, dass so ziemlich 90% dieser normalen Smart Home Dinger, die"}, {"id": 345, "start": 2474.76, "end": 2479.08, "text": "du daheim hinstellst, haben Sicherheitsprobleme, ich möchte nur mal daran erinnern, die Leute,"}, {"id": 346, "start": 2479.08, "end": 2483.2, "text": "die Wisecams hatten, da waren die Streams öffentlich über den China-Chinesen-Server"}, {"id": 347, "start": 2483.2, "end": 2491.56, "text": "abrufbar und dazu kommt, selbst wenn ich mir jetzt hier bei Amazon.de ein Gerät von einem"}, {"id": 348, "start": 2491.56, "end": 2497.52, "text": "deutschen Hersteller, nennen wir mal Hammer aus Bayern, Hammer, wenn du da von denen eine"}, {"id": 349, "start": 2497.52, "end": 2503.92, "text": "Steckdosenleiste kaufst, das ist exakt die gleiche Steckdosenleiste wie von den China-Chinesen,"}, {"id": 350, "start": 2503.92, "end": 2508.24, "text": "das weiß ich, weil ich mir absichtlich die Steckdosenleiste von Hammer gekauft habe,"}, {"id": 351, "start": 2508.24, "end": 2512.96, "text": "weil es die baugleiche China-Chinesen-Steckdosenleiste ist, wo ich Custom Firmware draufflaschen"}, {"id": 352, "start": 2512.96, "end": 2518.16, "text": "kann, nur, dass Hammer das glücklicherweise so gemacht hat, eine uralt Firmware drauf"}, {"id": 353, "start": 2518.16, "end": 2524.44, "text": "zu machen, sodass sie noch flashbar war, so, also ja, er sollte zuschlagen, die Technik"}, {"id": 354, "start": 2524.44, "end": 2529.08, "text": "ist ja die gleiche, also Leute, es ist alles genauso sicher, es ist davon überhaupt nichts"}, {"id": 355, "start": 2529.08, "end": 2533.72, "text": "sicher, wenn du nicht selbst den Kram drauf machst, okay, wir nehmen die offizielle Antwort,"}, {"id": 356, "start": 2533.72, "end": 2548.36, "text": "aber die eigentliche Antwort ist ja, Teilprüfung abschließend, bam, easy, huge, easy, way to"}, {"id": 357, "start": 2548.36, "end": 2560.68, "text": "dank, genau, so, wir machen noch eine weitere für die Noobs, was kommt nämlich als nächstes,"}, {"id": 358, "start": 2560.68, "end": 2565.84, "text": "wir machen noch Internet für Noobs, Leute, den Rest machen wir dann für Profis, ja,"}, {"id": 359, "start": 2565.84, "end": 2570.84, "text": "aber das Internet für Noobs, das müssen wir noch machen, wir machen noch mal das Internet"}, {"id": 360, "start": 2570.84, "end": 2580.36, "text": "für Noobs und dann machen wir beruflich Level 3, bam, also starten, jawoll, was bedeutet"}, {"id": 361, "start": 2580.36, "end": 2587.16, "text": "privater oder anonymer Modus im Browser, das hängt ein bisschen vom Browser-Hersteller"}, {"id": 362, "start": 2587.16, "end": 2593.48, "text": "ab, okay, ist dieser aktiviert, werden die Webseiten, die ich mir angesehen habe, nicht"}, {"id": 363, "start": 2593.48, "end": 2600.08, "text": "in einer Liste gespeichert, das wollen sie wahrscheinlich hören, wobei das so nicht ganz"}, {"id": 364, "start": 2600.08, "end": 2609.84, "text": "richtig ist, zum Beispiel hast du im privaten Modus Safari IOS, hast du einen extra Private"}, {"id": 365, "start": 2609.84, "end": 2614.76, "text": "Tab und solange du den nicht schließt, hast du eine Übersicht der geöffneten Seiten und"}, {"id": 366, "start": 2614.76, "end": 2617.92, "text": "sowas in der Richtung, also das wollen sie wahrscheinlich hören, ist aber nicht ganz"}, {"id": 367, "start": 2617.92, "end": 2622.48, "text": "richtig, ist dieser aktiviert, werden im Browser keine Passwörter gespeichert, die ich auf"}, {"id": 368, "start": 2622.48, "end": 2628.4, "text": "Webseiten eingebe, es werden normalerweise eh keine Passwörter gespeichert, die ich"}, {"id": 369, "start": 2628.4, "end": 2634.0, "text": "auf Webseiten eingebe, außer ich sage explizit, ist dieser aktiviert, werden meine Webcam"}, {"id": 370, "start": 2634.0, "end": 2640.52, "text": "abgeschaltet, schaltet der private Modus die Webcam ab, nee, oder, ist dieser aktiviert"}, {"id": 371, "start": 2640.52, "end": 2646.0, "text": "mit meiner IP Adresse geändert, also die Nummer, mit der sich meine Geräte im Internet identifizieren"}, {"id": 372, "start": 2646.0, "end": 2655.28, "text": "und über die HackerInnen, das ist ganz wichtig an der Stelle, auf mein PC zugreifen können,"}, {"id": 373, "start": 2655.28, "end": 2660.72, "text": "es hängt vom Browser Hersteller ab, normalerweise nicht, aber wenn du sowas wie Opera verwendest"}, {"id": 374, "start": 2660.72, "end": 2666.12, "text": "mit China-Chinesen VPN, die haben ja so Funktionen drin, also ich würde es jetzt mal so lassen,"}, {"id": 375, "start": 2666.12, "end": 2675.36, "text": "mal gucken, ob die damit einverstanden sind, was ist kein Browser, Exploration, Safari,"}, {"id": 376, "start": 2675.36, "end": 2682.64, "text": "Chrome, Firefox, Exploration, Herr Müller akzeptiert immer alle Cookies, wenn er eine"}, {"id": 377, "start": 2682.64, "end": 2686.32, "text": "Webseite besucht, welche Konsequenzen hat das, wahrscheinlich gar keine, wenn man ehrlich"}, {"id": 378, "start": 2686.32, "end": 2691.84, "text": "ist, es passiert nichts weiter, wenn der Anbieter, was denn der Anbieter erfährt nicht, auf"}, {"id": 379, "start": 2691.84, "end": 2715.16, "text": "welchen Unterseiten Herr Müller sich wie lange aufgehalten hat, was, äh, also, du hast"}, {"id": 380, "start": 2715.16, "end": 2721.96, "text": "schon die Möglichkeit zu tracken, prinzipiell über irgendwelche JavaScript-Geschichten,"}, {"id": 381, "start": 2721.96, "end": 2726.4, "text": "wie lange einer sich eine Seite anguckt, aber, hä, das habe ich Cookies überhaupt nichts"}, {"id": 382, "start": 2726.4, "end": 2731.84, "text": "zu tun, ist die Webseite ein Online-Shop und hat er Waren in seinen Warenkorb gelegt, kann"}, {"id": 383, "start": 2731.84, "end": 2736.76, "text": "er die Bestellung auch einen Tag später abschicken, wenn sein Warenkorb wird beim zweiten Besuch"}, {"id": 384, "start": 2736.76, "end": 2745.36, "text": "wieder hergestellt, ja, das kann man mit Cookies machen, das geht, das kann man mit Cookies"}, {"id": 385, "start": 2745.36, "end": 2754.56, "text": "machen, das, das geht mit Cookies, das geht aber auch noch anders, aber mit Cookies geht"}, {"id": 386, "start": 2754.56, "end": 2760.0, "text": "das auch, Herr Müller bekommt auf verschiedenen Websites, zum Beispiel im Suchmaschinen immer"}, {"id": 387, "start": 2760.0, "end": 2765.04, "text": "wieder Werbung angezeigt, die ja zu seiner letzten Bestellung im Online-Shop passen, ja,"}, {"id": 388, "start": 2765.04, "end": 2770.24, "text": "das muss auch nicht zwangsläufig über Cookies gemacht sein, aber wahrscheinlich oder wie"}, {"id": 389, "start": 2770.24, "end": 2779.12, "text": "auch immer, yes, yes, also, ich lasse es jetzt einfach mal so, äh, das mit den Unterseiten,"}, {"id": 390, "start": 2779.12, "end": 2783.52, "text": "keine Ahnung, die sind sehr vage, das erinnert mich an die Leute, ich muss mein Headset mal"}, {"id": 391, "start": 2783.52, "end": 2804.24, "text": "kurz entknoten, äh, das hat Aussetzer, das sackt, so, ich bin wieder da, ok, wir lassen"}, {"id": 392, "start": 2804.24, "end": 2815.08, "text": "es jetzt einfach so weiter, was ist keine Suchmaschine, ah, Firefox, jetzt hätten sie"}, {"id": 393, "start": 2815.08, "end": 2820.36, "text": "mich fast gebaited, fast, fast wäre der gebaited raus gewesen, äh, was kannst du mit deinem"}, {"id": 394, "start": 2820.36, "end": 2825.88, "text": "Browser machen, Dateien und Ordner auf deiner Festplatte sortieren, im WWW auf Webseiten"}, {"id": 395, "start": 2825.88, "end": 2831.76, "text": "surfen, ja, das auf jeden Fall, dein Rechner auf Virenbefall prüfen, ja, aber das wollen"}, {"id": 396, "start": 2831.76, "end": 2837.76, "text": "sie wahrscheinlich nicht hören, ich sag mal Virus total oder sowas, also, ja, du kannst"}, {"id": 397, "start": 2837.76, "end": 2842.8, "text": "mit deinem Browser auch Rechner auf Virenbefall prüfen, aber das wollen sie wahrscheinlich"}, {"id": 398, "start": 2842.8, "end": 2847.76, "text": "nicht hören an der Stelle, den Verlauf deiner besuchten Webseiten löschen, ja, das kann"}, {"id": 399, "start": 2847.76, "end": 2851.24, "text": "ich auch mit einem Browser machen, wobei das eher nicht so der Hauptanwendungszweck eines"}, {"id": 400, "start": 2851.24, "end": 2857.32, "text": "Browsers ist, weiter, äh, wo kannst du bei deinem Smartphone zwischen WLAN und mobile"}, {"id": 401, "start": 2857.32, "end": 2864.92, "text": "Internet umschalten, ja, das kommt, das hängt vom Smartphone ab, ok, wahrscheinlich das"}, {"id": 402, "start": 2864.92, "end": 2869.12, "text": "hier, wahrscheinlich, aber das hängt ganz entscheidend vom Smartphone ab, das kannst"}, {"id": 403, "start": 2869.12, "end": 2874.8, "text": "du so, so, ähm, universell nicht sagen, sollte den Hersteller mal rausbringen, ein Gerät,"}, {"id": 404, "start": 2874.8, "end": 2878.96, "text": "was Knöpfe dafür hat, dann geht das damit, also, das ist so allgemeingültig, kann man"}, {"id": 405, "start": 2878.96, "end": 2884.04, "text": "das überhaupt nicht sagen, weiter, welche Unternehmen betreiben Mobilfunknetze in Deutschland,"}, {"id": 406, "start": 2884.04, "end": 2890.24, "text": "Telekom, Vodafone, ja, 1&1, GMX und Kongstar, nee, Kongstar ist Telekom, Saturn, Media Markt"}, {"id": 407, "start": 2890.24, "end": 2900.84, "text": "und Cyberport, nee, das ist Telekom, Vodafone, O2, was ist mit Web, Web 2.0, Leute, Web 2.0"}, {"id": 408, "start": 2900.84, "end": 2908.24, "text": "ist doch schon wieder, also, das ist komplett, komplett outdated, alter, Web 2.0, wir sind,"}, {"id": 409, "start": 2908.24, "end": 2924.44, "text": "wir sind Web 4.0, Industrie 8.0, agile, horizontal, diagonalskalierer, serverless, Web, NFT,"}, {"id": 410, "start": 2924.44, "end": 2928.76, "text": "was auch immer, aber 2.0, also, das Internet ist größer geworden, sodass nun mehr Inhalte"}, {"id": 411, "start": 2928.76, "end": 2935.88, "text": "hineinpassen, alles klar, das Internet ist mit einem Update aktualisiert worden, sodass"}, {"id": 412, "start": 2935.88, "end": 2947.52, "text": "es nun sicherer ist, jeder Mensch kann im Internet Inhalte veröffentlichen, was, was, was wollt"}, {"id": 413, "start": 2947.52, "end": 2961.6, "text": "ihr von mir wissen, das letzte, oder, wahrscheinlich C, wahrscheinlich C, Leute, mein Headset hat"}, {"id": 414, "start": 2961.6, "end": 2965.88, "text": "immer noch Aussetzer, wartet mal kurz, ich muss es mal kurz fixen und ich muss euch muten,"}, {"id": 415, "start": 2965.88, "end": 2980.04, "text": "weil ansonsten fliegen euch die Ohren weg, so, ich hoffe, ihr findet alles, ihr könnt"}, {"id": 416, "start": 2980.04, "end": 2985.0, "text": "wahrscheinlich wieder das wissen, okay, Teilprüfung abschließen und, was haben wir richtig, Leute,"}, {"id": 417, "start": 2985.0, "end": 2999.36, "text": "wir haben Frage 1 verkackt, Frage 1, fail, was bedeutet private oder, okay, ja, meinetwegen,"}, {"id": 418, "start": 2999.36, "end": 3002.48, "text": "wie gesagt, normalerweise werden die Passwörter eh nur gespeichert, wenn du sagst, ich will"}, {"id": 419, "start": 3002.48, "end": 3009.52, "text": "nicht speichern, aber in Ordnung, lass ich mir gefallen, so, jetzt upgraden wir, beruflich"}, {"id": 420, "start": 3009.52, "end": 3031.2, "text": "Level 3, also, richtig High IQ Modus jetzt aktiviert, Business Class, jetzt wird es heikel,"}, {"id": 421, "start": 3031.2, "end": 3040.52, "text": "jetzt wird es heikel, ja, hier, Cisco Internet Professional, nein, wie heißt das Ding, Certified"}, {"id": 422, "start": 3040.52, "end": 3047.72, "text": "Cisco Internet Engineer, ne, wie heißt das, wie heißt das Oberste von Cisco, Network"}, {"id": 423, "start": 3047.72, "end": 3056.52, "text": "Professional, ne, CCNA ist das Unterste, CCNA ist das Unterste, das ist Associate, das"}, {"id": 424, "start": 3056.52, "end": 3065.52, "text": "meine ich nicht, gut, also, Prege, Prege, sonst ist die Kündigung direkt raus, wenn"}, {"id": 425, "start": 3065.52, "end": 3080.36, "text": "ich das jetzt verkacke, auf geht's, Teilprüfung starten, Level 3 beruflich, übrigens wisst"}, {"id": 426, "start": 3080.36, "end": 3085.08, "text": "ihr, was mir aufgefallen ist, was diesen Test schon instant komplett useless macht, man"}, {"id": 427, "start": 3085.08, "end": 3089.0, "text": "kann cheaten nebenbei, niemand guckt zu, ich könnte einfach einen Tap aufmachen und nach"}, {"id": 428, "start": 3089.0, "end": 3097.28, "text": "der richtigen Antwort suchen, jetzt starten, okay, Ubuntu, nein, nein, nein, sorry Leute,"}, {"id": 429, "start": 3097.28, "end": 3104.32, "text": "wir wissen, ihr wisst genauso gut wie ich, dass das nicht Ubuntu heißt, sondern, sondern"}, {"id": 430, "start": 3104.32, "end": 3111.32, "text": "Chubantu, das verstörendste Video war ja immer noch mal auf YouTube, wo wir danach"}, {"id": 431, "start": 3111.32, "end": 3116.12, "text": "geguckt haben, wie das richtig heißt, da gab es ein Video von Nelson Mandela, der dann"}, {"id": 432, "start": 3116.12, "end": 3122.6, "text": "sagt Ubuntu, und irgendjemand hat dann das Ubuntu Logo dazu gemacht, bloß mit dem Unterschied,"}, {"id": 433, "start": 3122.6, "end": 3126.8, "text": "Nelson Mandela hatte mit Ubuntu überhaupt gar nichts zu tun, das ist halt ein ganz normales"}, {"id": 434, "start": 3126.8, "end": 3135.68, "text": "südafrikanisches Wort, also Ubuntu ist eine Distribution des Betriebssystems Linux, jawoll,"}, {"id": 435, "start": 3135.68, "end": 3140.52, "text": "weiter, oh jetzt wird's aber kompliziert, also Herr Meyer ist Administrator in seiner"}, {"id": 436, "start": 3140.52, "end": 3144.96, "text": "Firma und stellt fest, dass es für das auf allen Firmen-PCs laufende Betriebssystem"}, {"id": 437, "start": 3144.96, "end": 3153.76, "text": "Windows 7 keine Sicherheitsupdates mehr gibt, ja erstmal direkt Kündigung schreiben, er"}, {"id": 438, "start": 3153.76, "end": 3158.8, "text": "bespricht dieses Sicherheitsproblem mit seiner Chefin und er hält von ihr den Auftrag auf"}, {"id": 439, "start": 3158.8, "end": 3163.4, "text": "allen Rechnern in der Firma ein neues Betriebssystem zu installieren, seine Chefin möchte, dass"}, {"id": 440, "start": 3163.4, "end": 3167.72, "text": "das neue Betriebssystem Open Source ist, das halte ich für ein Gerücht, das halte ich"}, {"id": 441, "start": 3167.72, "end": 3173.56, "text": "aber für ein Gerücht, dass das eine Anforderung ist, die von der Chefin kommt, da habe ich"}, {"id": 442, "start": 3173.56, "end": 3179.4, "text": "mal eine Zweifel, dass das irgendein Chef bzw. Chefin sagen würde, seine Chefin möchte,"}, {"id": 443, "start": 3179.4, "end": 3184.8, "text": "dass das neue Betriebssystem Open Source ist, für welches wird er sich entscheiden, Android"}, {"id": 444, "start": 3184.8, "end": 3194.84, "text": "logisch oder, übrigens in Chat, wir wissen alle, es heißt nicht Linux, korrekt, der Chat"}, {"id": 445, "start": 3194.84, "end": 3202.12, "text": "hat's wieder, I'd like to interject for a moment, was wir nämlich unter Linux verstehen,"}, {"id": 446, "start": 3202.12, "end": 3210.2, "text": "ist er in Wirklichkeit eigentlich GNU slash Linux, lasst es mal nicht Richard Stelman,"}, {"id": 447, "start": 3210.2, "end": 3215.56, "text": "wie spricht man den Typen überhaupt aus, Richard Stelman sehen, dass da einfach nur"}, {"id": 448, "start": 3215.56, "end": 3222.76, "text": "Linux steht, es ist GNU slash Linux, spricht man das überhaupt GNU aus oder muss man das"}, {"id": 449, "start": 3222.76, "end": 3234.52, "text": "GNU oder so aussprechen, GNU plus Linux, okay, Linux, ihr könnt doch Android nehmen,"}, {"id": 450, "start": 3234.52, "end": 3240.88, "text": "wobei Android mit Open Source jetzt alles so weit her ist, weiter, im Büro von Frau Meier"}, {"id": 451, "start": 3240.88, "end": 3245.92, "text": "ist das Netzwerk ausgefallen, ob LAN oder WLAN, nichts funktioniert mehr, sie fragt"}, {"id": 452, "start": 3245.92, "end": 3250.4, "text": "sich, ob sie übergangsweise den persönlichen Hotspot ihres privaten Handys aktivieren"}, {"id": 453, "start": 3250.4, "end": 3254.88, "text": "sollte und über die LTE-Verbindung ihres Handys, ihrem Dienstlaptop wieder mit dem"}, {"id": 454, "start": 3254.88, "end": 3260.68, "text": "Internet zu verbinden, ist das sicher, okay, was sagen sie dazu, nein, bei einem Hackerangriff"}, {"id": 455, "start": 3260.68, "end": 3269.92, "text": "wäre sowohl ihre privaten als auch ihre geschäftlichen Daten gefilmt, hä, ja, der Hotspot ist sicher,"}, {"id": 456, "start": 3269.92, "end": 3274.52, "text": "obwohl ihre privaten als auch ihre geschäftlichen Daten sind bei einem Hackerangriff nicht den"}, {"id": 457, "start": 3274.52, "end": 3292.8, "text": "Gefahr, hä, also C, also ich meine, die wollen wahrscheinlich A wissen, aber also ich meine,"}, {"id": 458, "start": 3292.8, "end": 3296.2, "text": "wenn ihr den privaten Hotspot verwendet, dann ist ja nicht irgendwie die privaten Daten"}, {"id": 459, "start": 3296.2, "end": 3302.2, "text": "ihres Handys in Gefahr, sondern im Zweifelsfall halt, was auch immer sie sich da einfängt"}, {"id": 460, "start": 3302.2, "end": 3309.86, "text": "auf ihrem Laptop, also im Handy wird wahrscheinlich nichts passieren, aber wahrscheinlich wollen"}, {"id": 461, "start": 3309.86, "end": 3319.72, "text": "sie das wissen, was aber wenig Sinn ergibt, ja, das ist zu high IQ der Fragensteller gewesen,"}, {"id": 462, "start": 3319.72, "end": 3324.28, "text": "welche Vorteile haben Unternehmen, die auf das Betriebssystem Linux haben, ich finde"}, {"id": 463, "start": 3324.28, "end": 3328.96, "text": "das gut, sehr viele Linux bezogene Fragen, sehr nice, nicht wie der ganze Windows Excel,"}, {"id": 464, "start": 3328.96, "end": 3335.2, "text": "der kackt da immer, ordentliche Fragen, Linux ist kostenfrei, das Unternehmen spart Geld,"}, {"id": 465, "start": 3335.2, "end": 3340.28, "text": "das wollen sie wahrscheinlich hören, ist aber falsch, das kommt ganz drauf an, was"}, {"id": 466, "start": 3340.28, "end": 3346.12, "text": "für ein Linux, wenn man in Red Hat ein richtig echtes Red Hat betreiben will, also auch"}, {"id": 467, "start": 3346.12, "end": 3349.84, "text": "mit offiziellen Update-Servern und sonst was, da braucht man eine Subscription und das kostet"}, {"id": 468, "start": 3349.84, "end": 3355.2, "text": "Geld, du kannst ein Red Hat gar nicht wirklich betreiben, ein offizielles Red Hat gar nicht"}, {"id": 469, "start": 3355.2, "end": 3361.96, "text": "wirklich großartig, also nicht gescheit betreiben, ohne Geld zu bezahlen, Linux ist weniger anfällig"}, {"id": 470, "start": 3361.96, "end": 3365.84, "text": "für Angriffe mit Well-Ware, das Unternehmen ist somit geschützter, ok, ja, wollen sie"}, {"id": 471, "start": 3365.84, "end": 3372.36, "text": "wahrscheinlich auch hören, es gibt Linux mehr Programme als für Mac und Windows, vor allem"}, {"id": 472, "start": 3372.36, "end": 3377.84, "text": "Unternehmen in der kreativen Branche profitieren, nein, das kann es nicht sein, aber wir sind"}, {"id": 473, "start": 3377.84, "end": 3384.08, "text": "uns ja einig, dieses Jahr ist das Jahr des Linux-Desktops, oder Chet, jetzt ist es soweit,"}, {"id": 474, "start": 3384.08, "end": 3393.72, "text": "ja, gut, seht ihr auch so, ja, es ist für unerfahrene AnwenderInnen sehr einfach, Hardware"}, {"id": 475, "start": 3393.72, "end": 3400.2, "text": "bei Linux zu installieren, AdministratorInnen können das im Grunde MitarbeiterInnen überlassen,"}, {"id": 476, "start": 3400.2, "end": 3404.04, "text": "das ist so ein schöner Fall von, es macht sich immer lesbarer, da einen Doppelpunkt"}, {"id": 477, "start": 3404.04, "end": 3407.56, "text": "Innen hinten dran zu schreiben, ich meine, man weiß ja auch sowas gemeint ist, es ist"}, {"id": 478, "start": 3407.56, "end": 3412.64, "text": "für, ok, es ist für Unerfahrene sehr einfach, Hardware, nein, ist es nicht, je nachdem,"}, {"id": 479, "start": 3412.64, "end": 3420.32, "text": "so ist es, aber Hardware installieren können, AdministratorInnen auf jeden Fall nicht dem"}, {"id": 480, "start": 3420.32, "end": 3425.04, "text": "Anwender überlassen, auch nicht unter Windows, weil ein Anwender schraubt bestimmt nicht"}, {"id": 481, "start": 3425.04, "end": 3428.64, "text": "seinen Desktop in der Firma auf, baut da irgendwie eine neue Netzwerkkarte ein und"}, {"id": 482, "start": 3428.64, "end": 3438.56, "text": "macht wieder zu, die haben schon Probleme, den USB-Stick richtig rum einzuklingeln, also"}, {"id": 483, "start": 3438.56, "end": 3448.28, "text": "Vorteile, also, ne, dann muss das weg, gibt es überhaupt AdministratorInnen, ja, gibt"}, {"id": 484, "start": 3448.28, "end": 3455.32, "text": "es, wir haben sogar welche bei mir auf der Arbeit, also, mir fallen direkt aus dem Kopf"}, {"id": 485, "start": 3455.32, "end": 3461.48, "text": "drei Stück aus ganz unterschiedlichen Bereichen ein, wir haben eine bei, ok, iOS-Anwendungsentwicklung"}, {"id": 486, "start": 3461.48, "end": 3466.36, "text": "haben wir jede Menge, Zeit, scheiß drauf, iOS-Anwendungsentwicklung haben wir jede Menge,"}, {"id": 487, "start": 3466.36, "end": 3472.2, "text": "aber das zählt nicht, Windows Active Directory-AdministratorInnen fällt mir eine ein, Datenbank-Admin fällt"}, {"id": 488, "start": 3472.2, "end": 3481.4, "text": "mir eine ein und Software-Tests und Entwicklung fällt mir eine ein, also, wir haben da durchaus"}, {"id": 489, "start": 3481.4, "end": 3488.2, "text": "einige, so, weiter, Herr Gradmeier ist der IT-Sicherheitsbeauftragte in seiner Firma,"}, {"id": 490, "start": 3488.2, "end": 3492.4, "text": "er soll für die Büros einen Sprachassistenten anschaffen, er findet ein Gerät, das alle"}, {"id": 491, "start": 3492.4, "end": 3498.44, "text": "Anfragen in den USA speichert, ich mein, besser als in Russland oder besser als in China"}, {"id": 492, "start": 3498.44, "end": 3506.32, "text": "und eins, das alle Anfragen in Irland speichert, welches ist sicher, was, welches ist sichert,"}, {"id": 493, "start": 3506.32, "end": 3512.0, "text": "das sollte er eigentlich wissen als Sicherheitsbeauftragte, oder, warum müssen wir ihm das sagen, das"}, {"id": 494, "start": 3512.0, "end": 3517.2, "text": "Gerät, das alle Anfragen in Irland speichert, ja, das ist, das ist richtig, letztendlich"}, {"id": 495, "start": 3517.2, "end": 3521.64, "text": "ist das Beste, was man an der Stelle aber machen kann, sich nicht darauf zu verlassen,"}, {"id": 496, "start": 3521.64, "end": 3525.76, "text": "wo der ganze Mist gespeichert wird und dass es in die EU ist und sich auch, ja, alle dran"}, {"id": 497, "start": 3525.76, "end": 3532.12, "text": "halten und sowas, weil im Zweifelsfall ist das eh alles Scheiß, Schall und Rauch, es"}, {"id": 498, "start": 3532.12, "end": 3535.88, "text": "ist wichtig, dass du den Kram am besten verschlüsselt ablegst, weil dann kann auch keiner was damit"}, {"id": 499, "start": 3535.88, "end": 3541.6, "text": "Unfug treiben, so, weiter, trage das fehlende Wort ein, hat man auf einem Rechner keine"}, {"id": 500, "start": 3541.6, "end": 3547.92, "text": "Rechte, Programme selbst zu installieren, kann man auf Versionen von Programmen zurückgreifen,"}, {"id": 501, "start": 3547.92, "end": 3560.6, "text": "Lokale, oder, was wollen die, ah, sie erfordern keine Installation, oh, wie nennt man das"}, {"id": 502, "start": 3560.6, "end": 3573.64, "text": "nochmal, portable, ne, portable, ich glaube, ihr habt das richtig geschrieben, Streamer"}, {"id": 503, "start": 3573.64, "end": 3579.36, "text": "Read Chat, ich musste das nur verschleiern, als ich den Chat gelesen hab, so, weiter,"}, {"id": 504, "start": 3579.36, "end": 3583.04, "text": "tragen sie die fehlende Wörter ein, möchte man unterwegs mit dem Laptop ins Internet"}, {"id": 505, "start": 3583.04, "end": 3588.2, "text": "gehen und soll dabei das Tablet oder das Smartphone die Rolle des Routers übernehmen, so muss"}, {"id": 506, "start": 3588.2, "end": 3595.32, "text": "man in den Einstellungen ein, eh, Hotspot, Hotspot einrichten, das haben die uns doch"}, {"id": 507, "start": 3595.32, "end": 3604.04, "text": "vorher sogar schon gefragt, weiter, Herr Demir schon wieder, der ist aber aktiv, er hat"}, {"id": 508, "start": 3604.04, "end": 3615.6, "text": "eine, Moment, das, Sekunde, das, das kennen wir schon, Level 3, warum ist Level 3 beruflich"}, {"id": 509, "start": 3615.6, "end": 3622.88, "text": "die Frage für die Privatlevel 1 Oma drinne, Scamast, Alter, achso, das ist jetzt multiple"}, {"id": 510, "start": 3622.88, "end": 3628.28, "text": "choice, das ist jetzt multiple choice, mehr Antworten, also, dieser Vollbrechner auf das"}, {"id": 511, "start": 3628.28, "end": 3635.48, "text": "Adressbuch im Smartphone zuzukehren, sollte er der App, die brechen, nein, nein, die Wetterapp"}, {"id": 512, "start": 3635.48, "end": 3642.2, "text": "braucht keine Kontaktdaten, so, so will ich mal, ich mein, wozu brauchste, ich mein,"}, {"id": 513, "start": 3642.2, "end": 3650.08, "text": "das kommt auf die Wetterapp an, wenn die Wetterapp irgendwie Sachen hat wie, zu meinem Termin"}, {"id": 514, "start": 3650.08, "end": 3655.36, "text": "heute Mittag mit dem Max, wie wird das Wetter an seinem Standort, dann ja, aber es kommt"}, {"id": 515, "start": 3655.36, "end": 3665.2, "text": "auf die App, auf die App an, so, Teilprüfung abschließen, 100%, huge, Leute, doch keine"}, {"id": 516, "start": 3665.2, "end": 3676.12, "text": "Abmahnung, easy, easy, easy as fuck, easy, easy as fuck, alles klar, weitere Teilprüfung"}, {"id": 517, "start": 3676.12, "end": 3686.84, "text": "starten, Internet, jetzt wird's ernst, oder wie man Opa sagen würde, jetzt wird's haarig,"}, {"id": 518, "start": 3686.84, "end": 3692.44, "text": "ok, trage die fehlenden Wörter ein, Web-Tools zur Verwaltung von Inhalten auf Webseiten"}, {"id": 519, "start": 3692.44, "end": 3705.2, "text": "nennt man, was, Content-Management-Systeme, wie schreibt man Management, ich schreibe"}, {"id": 520, "start": 3705.2, "end": 3714.32, "text": "Management immer falsch, Content-Management-Systeme, ja, weiter, Herr Müller surft im Büro mit"}, {"id": 521, "start": 3714.32, "end": 3722.72, "text": "seinem Browser auf dem Dienst-PC, ja, was der so alles macht, was bedeutet das, Herr"}, {"id": 522, "start": 3722.72, "end": 3727.88, "text": "Müller, Herr Müllers PC speichert keine Cookies, ja, Herr Müllers PC speichert alle Cookies"}, {"id": 523, "start": 3727.88, "end": 3739.12, "text": "aus Erwerbekookies, ne, weiter, Videoanrufe oder Messenger-Calls belasten auf Dienstreisen"}, {"id": 524, "start": 3739.12, "end": 3759.96, "text": "das, den Akku, ach, das Datenvolumen, meine Güte, das Klima, das Firmenkonto, ja, das"}, {"id": 525, "start": 3759.96, "end": 3764.48, "text": "ist doch wirklich eine sehr vage Frage, ich mein, woher soll ich wissen, dass der Typ"}, {"id": 526, "start": 3764.48, "end": 3771.6, "text": "kein WLAN hat, das Gehirn belasten die auch, ja, das ist richtig, es belastet die Leute,"}, {"id": 527, "start": 3771.6, "end": 3777.12, "text": "wenn er öffentlich telefoniert im Zug, das Daten, wir schreiben einfach Datenvolumen,"}, {"id": 528, "start": 3777.12, "end": 3790.4, "text": "welche Potenziale bietet der neue Mobilfunk-Standard 5G-Unternehmen und Organisationen, ähm, niedrige"}, {"id": 529, "start": 3790.4, "end": 3797.8, "text": "Latenzzeiten für die verzerrungsfreie Kommunikation, was sind eine verzerrungsfreie Kommunikation,"}, {"id": 530, "start": 3797.8, "end": 3806.2, "text": "in Videokonferenzen oder beim Livestreaming von Online-Produkt-Präsentationen, ok, bestimmt,"}, {"id": 531, "start": 3806.2, "end": 3813.8, "text": "das wollen die wahrscheinlich hören, Übertragungsraten mit bis zu 10 oder sogar 20 Gigabits, ich"}, {"id": 532, "start": 3813.8, "end": 3820.6, "text": "hab ehrlich gesagt keine Ahnung, wie schnell 5G ist, aber 10 Gigabit erscheint mir etwas"}, {"id": 533, "start": 3820.6, "end": 3828.4, "text": "unrealistisch zu sein, dass man das auch, ähm, in der Praxis erreicht, ich hab keine"}, {"id": 534, "start": 3828.4, "end": 3834.84, "text": "Ahnung, ob, ob das theoretisch damit geworben wird, dass das maximal möglich wäre, also"}, {"id": 535, "start": 3834.84, "end": 3841.68, "text": "100 ist auf jeden Fall zu viel, hohe Latenzzeiten für die verzerrungsfreie Kommunikation, nein,"}, {"id": 536, "start": 3841.68, "end": 3847.8, "text": "ja, weiter, Herr Meier ist Redaktionsleiter bei einem Verlag und möchte, dass seine Online-Redaktion"}, {"id": 537, "start": 3847.8, "end": 3852.36, "text": "zukünftig ein proprietäres Content-Management, ich sag mal, ist das Absicht, dass die ihre"}, {"id": 538, "start": 3852.36, "end": 3861.52, "text": "Antworten sich immer selbst geben, ein paar Fragen hinten dran, was meint er, Moment,"}, {"id": 539, "start": 3861.52, "end": 3868.88, "text": "was, Moment, was, dass sein Online-Redaktion künftig ein proprietäres Content-Management-System"}, {"id": 540, "start": 3868.88, "end": 3873.48, "text": "ist, warum möchte denn der Verlag das, dass es ein proprietäres Content-Management ist,"}, {"id": 541, "start": 3873.48, "end": 3878.24, "text": "das ist komplett aus der Luft gegriffen, aber ok, was meint er, das CMS ist Quellaufnahme,"}, {"id": 542, "start": 3878.24, "end": 3883.48, "text": "das CMS ist herstellergebunden, wird dann so vom Hersteller beistellt, die Einsicht, ja,"}, {"id": 543, "start": 3883.48, "end": 3902.36, "text": "was meint er, trage die fehlenden Wörter ein, sehr paar ist die Abkürzung, Response-Page,"}, {"id": 544, "start": 3902.36, "end": 3909.08, "text": "Response-Page oder sowas, Leute, ich zeige euch jetzt, ich zeige euch jetzt, warum dieser"}, {"id": 545, "start": 3909.08, "end": 3934.24, "text": "Test komplett für den Arsch ist, Search-Engine-Result-Page, easy clap, agree, mit welchen Technologien"}, {"id": 546, "start": 3934.24, "end": 3941.68, "text": "kannst du im Homeoffice oder im Büro anonymer im Netz surfen, Proxy-Server, VPN-Tunnel,"}, {"id": 547, "start": 3941.68, "end": 3945.72, "text": "was nochmal, mit welchen Technologien kannst du im Homeoffice oder im Büro anonymer, ok,"}, {"id": 548, "start": 3945.72, "end": 3953.96, "text": "Homeoffice und Büro, das kommt drauf an, was geploggt ist und was nicht, theoretisch können"}, {"id": 549, "start": 3953.96, "end": 3961.92, "text": "da alle vier dazu beitragen, theoretisch können da alle vier dazu beitragen, auch, auch,"}, {"id": 550, "start": 3961.92, "end": 3971.4, "text": "es geht anonymer, ja, es gibt auch DNS-Server, die sagen hier so nach dem Motto, wir machen"}, {"id": 551, "start": 3971.4, "end": 3977.8, "text": "keine Aufzeichnung und sonst nichts, wahrscheinlich ist DNS aus deren Sicht falsch, streng genommen"}, {"id": 552, "start": 3977.8, "end": 3985.8, "text": "ist DNS aber richtig bei dieser Fragestellung, welche Mobilfunk-Standard gibt es nicht 6G,"}, {"id": 553, "start": 3985.8, "end": 4001.76, "text": "oh wir sind schon durch, mal gucken, mal gucken, was ich hab statt Result-Result-Page geschrieben,"}, {"id": 554, "start": 4001.76, "end": 4011.36, "text": "mal gucken was er sagt, Teilprüfung abschließen, oh Leute, wir haben verkackt, wir haben verkackt,"}, {"id": 555, "start": 4011.36, "end": 4022.64, "text": "oh tatsächlich, 5G, das macht in der Praxis im Leben keine 10 Gigabit, im Leben nicht,"}, {"id": 556, "start": 4022.64, "end": 4031.36, "text": "ich mein das sagt vielleicht die maximale theoretisch mögliche, in der Spezifikation"}, {"id": 557, "start": 4031.36, "end": 4035.84, "text": "oder so sagen vielleicht 10 Gigabit, aber noch ganz bestimmt nicht in der Praxis,"}, {"id": 558, "start": 4035.84, "end": 4044.2, "text": "ja Kündigung wird schon geschrieben, ok, das haben wir falsch gemacht und DNS-Server,"}, {"id": 559, "start": 4044.2, "end": 4052.6, "text": "wir haben es schon vermutet, aber DNS-Server ist richtig, weitere Prüfung starten, Kommunikation,"}, {"id": 560, "start": 4052.6, "end": 4061.6, "text": "Next, welche nützlichen Funktionen haben Programme wie MetaMouse, Slack oder MS Teams für Unternehmen,"}, {"id": 561, "start": 4061.6, "end": 4067.68, "text": "Teilen von Präsentationen, mein Headset Leute, das macht mich verrückt heute, warum geht"}, {"id": 562, "start": 4067.68, "end": 4088.48, "text": "das immer aus zwischendurch, ganz ätzend, weiß auch nicht was da los ist, ok, Versandempfang"}, {"id": 563, "start": 4088.48, "end": 4092.44, "text": "von Chatnachrichten, Videoanrufe oder Versand von ja, Empfang und Versand von Verschlüsse"}, {"id": 564, "start": 4092.44, "end": 4098.48, "text": "nein, Abonnieren von, ich hab keine Ahnung, ob dieser eines dieser drei Dinger nicht auch"}, {"id": 565, "start": 4098.48, "end": 4105.56, "text": "RSS Feeds abonnieren kann, Pop-Schutz, ich hab den Schwamm hier liegen Leute, ich hab"}, {"id": 566, "start": 4105.56, "end": 4110.32, "text": "den Schwamm für den Pop-Schutz hier liegen, wir schneiden den dem demnächst aus, so können"}, {"id": 567, "start": 4110.32, "end": 4115.36, "text": "Unternehmen ihren Kundenservice zum Beispiel Bestellung bei Lieferdiensten, regelmäßige"}, {"id": 568, "start": 4115.36, "end": 4122.2, "text": "Newsletter oder Infos auch per Messenger anbieten, warum nicht, warum sollen sie das nicht,"}, {"id": 569, "start": 4122.2, "end": 4127.04, "text": "es ist natürlich vielleicht nicht die schönste, aber bestimmt, warum nicht, nein Messenger"}, {"id": 570, "start": 4127.04, "end": 4132.2, "text": "sind nur für privaten Gebrauch, zugesehen, vorgesehen, nur große Konzerne können diesen"}, {"id": 571, "start": 4132.2, "end": 4138.32, "text": "Service nutzen, kleine und mittelständige Unternehmen, Schwachsinn, ja jedes Unternehmen"}, {"id": 572, "start": 4138.32, "end": 4144.48, "text": "kann in Messenger einen Unternehmensaccount einrichten und so ihren Kundenservice, hä,"}, {"id": 573, "start": 4144.48, "end": 4150.24, "text": "hä, was ist das für ne Bescheu, das erinnert mich an die IHK Abschlussprüfung, die wollen"}, {"id": 574, "start": 4150.24, "end": 4155.24, "text": "wahrscheinlich C hören, aber das kommt auf den Messenger an, ich kann mir auch nen Jabber"}, {"id": 575, "start": 4155.24, "end": 4161.2, "text": "Account installieren irgendwo, Jabber Account anlegen, kenn noch einer, Jabber Xamp, ne"}, {"id": 576, "start": 4161.2, "end": 4167.36, "text": "nicht Xamp, ne was ist die Abkürzung von Jabber, doch Xamp oder, kenn noch jemand,"}, {"id": 577, "start": 4167.36, "end": 4180.44, "text": "oder weiter, JellyFour du bist Politiker im, einer Fraktion im Bundestag, sie bekommst"}, {"id": 578, "start": 4180.44, "end": 4188.24, "text": "mit, wer hat diese Fragen geschrieben, dass deine persönliche Assistentin, weil sie für"}, {"id": 579, "start": 4188.24, "end": 4196.6, "text": "dich arbeitet in sozialen Netzwerken sexistisch beleidigt wird, Anzeige direkt, dann ist vorbei,"}, {"id": 580, "start": 4196.6, "end": 4208.44, "text": "ich empfehle ihr, sich im Internet zurückzuhalten und keine Beiträge mehr zu veröffentlichen,"}, {"id": 581, "start": 4208.44, "end": 4225.92, "text": "es kommt drauf an, was sie so schreibt, das kommt drauf an, ich empfehle ihr, ihre Social"}, {"id": 582, "start": 4225.92, "end": 4229.96, "text": "Media Accounts zu löschen, ne, das will ich auf gar keinen Fall machen, ich empfehle ihr,"}, {"id": 583, "start": 4229.96, "end": 4235.32, "text": "sich bei Organisationen wie Hate Aid oder Weißer Ring, oh Weißer, heißt das wirklich"}, {"id": 584, "start": 4235.32, "end": 4242.72, "text": "Weißer Ring, das ist ja auch schon wieder grenzwertig, fast so schlimm wie Master Branch,"}, {"id": 585, "start": 4242.72, "end": 4247.08, "text": "so ich empfehle ihr, wahrscheinlich wollen sie das hören, ich empfehle ihr, die Hater"}, {"id": 586, "start": 4247.08, "end": 4253.0, "text": "persönlich anzukriegen, ja, ja, immer, immer zurückflamen, aber das ist, das meinen die"}, {"id": 587, "start": 4253.0, "end": 4262.28, "text": "wahrscheinlich nicht, das meinen die wahrscheinlich nicht, immer zurückflamen und das beste ist,"}, {"id": 588, "start": 4262.28, "end": 4271.92, "text": "das beste ist, zurückflamen und dann bannen, weil dann sind sie richtig abgefuckt, also"}, {"id": 589, "start": 4271.92, "end": 4275.8, "text": "ich glaube, ich hab Erfahrung mit sowas, ne, gerade auch durch YouTube und so was, wenn"}, {"id": 590, "start": 4275.8, "end": 4282.2, "text": "du Leute richtig abfacken willst, du antwortest denen und schreibst was auch immer und dann"}, {"id": 591, "start": 4282.2, "end": 4286.84, "text": "bannst du sie und dann haben sie keine Möglichkeit zu antworten und das fackt die sowas von ab,"}, {"id": 592, "start": 4286.84, "end": 4292.08, "text": "da sind die richtig stinkig danach, ich hab sogar schon E-Mails gekriegt, weil ich Leute"}, {"id": 593, "start": 4292.08, "end": 4296.96, "text": "gebannt hab, ok, also ich empfehle ihr, meinetwegen, ich empfehle ihr, die Hater persönlich anzukriegen,"}, {"id": 594, "start": 4296.96, "end": 4302.68, "text": "das würde ich, ganz ehrlich, ja, aber wahrscheinlich wollen sie das nicht hören, ich bitte die"}, {"id": 595, "start": 4302.68, "end": 4306.4, "text": "gesamte Fraktion der Assistentin beizustehen und ihre Unterstützung anzukriegen, die gesamte"}, {"id": 596, "start": 4306.4, "end": 4310.72, "text": "Fraktion ist klar, ich hänge das erstmal an die große Glocke, ja, das ist ja bescheuert,"}, {"id": 597, "start": 4310.72, "end": 4316.2, "text": "ich stelle mich im Netz schützend vor meiner Assistentin und biete ihr Hilfe an, das kommt"}, {"id": 598, "start": 4316.2, "end": 4325.68, "text": "auf den Einzelfall an, das wollen sie wahrscheinlich auch hören, so und ganz ehrlich, das erste"}, {"id": 599, "start": 4325.68, "end": 4335.56, "text": "hängt ganz entscheidend davon ab, was die so schreibt und was das für Hintergründe"}, {"id": 600, "start": 4335.56, "end": 4346.36, "text": "sind, ja, wenn die auf Twitter geht und keine Ahnung, all men are trash oder irgendwie so"}, {"id": 601, "start": 4346.36, "end": 4353.24, "text": "Zeug schreibt, na gut, dann erwartest du ja oft mal schon eine gewisse Reaktion oder"}, {"id": 602, "start": 4353.24, "end": 4364.36, "text": "keine Ahnung, wenn sie unter, kurz gesagt, Videos auf YouTube ihr Onlyfans Profil postet"}, {"id": 603, "start": 4364.36, "end": 4369.12, "text": "als Werbung, da muss man sich über Beleidigung auch nicht wundern, also es kommt auf den"}, {"id": 604, "start": 4369.12, "end": 4374.92, "text": "Einzelfall an, die Zeit läuft ab, oh nein, aber wenn ich Politiker bin, müsste ich eigentlich"}, {"id": 605, "start": 4374.92, "end": 4382.12, "text": "ignorieren, ja, okay, weiter, weiter, ich lasse es jetzt einfach mal so, trag das fehlende"}, {"id": 606, "start": 4382.12, "end": 4390.24, "text": "Wort ein, das Team von Frau Meyer plant eine Videokonferenz zur Präsentation zwei neuer,"}, {"id": 607, "start": 4390.24, "end": 4398.4, "text": "zweier neuen Produkte, der Satz stimmt eben nicht, oder von zwei neuen Produkten oder zweier"}, {"id": 608, "start": 4398.4, "end": 4404.44, "text": "neue Produkte, die Teilnehmenden der Videokonferenz können am Ende der Präsentation in zwei"}, {"id": 609, "start": 4404.44, "end": 4421.76, "text": "verschiedene Chat Rooms wahrscheinlich, Chat Rooms gehen und fragen sich, was Breakout,"}, {"id": 610, "start": 4421.76, "end": 4432.24, "text": "was soll ja ein Breakout sein, weiter, Frau Meyer bietet in ihrer Firma eine Videokonferenz"}, {"id": 611, "start": 4432.24, "end": 4438.08, "text": "zur Präsentation, Frau Meyer ist ganz schön umtriebig, oder, Frau Meyer bietet in ihrer"}, {"id": 612, "start": 4438.08, "end": 4442.04, "text": "Firma eine Videokonferenz zur Präsentation des neuen Geschäftsberichts, an leider sind"}, {"id": 613, "start": 4442.04, "end": 4452.0, "text": "viele Teilnehmer krank, oh, Monka Corona, sie schlägt vor, die Präsentation mitsamt"}, {"id": 614, "start": 4452.0, "end": 4460.04, "text": "der Beiträge aller Anwesen aufzuzeichnen, oh, DSGVO, DSGVO, wir haben irgendwo einen"}, {"id": 615, "start": 4460.04, "end": 4468.0, "text": "DSGVO Emote, Leute, TOS, TOS, DSGVO, ganz, ganz schlimm, sie schlägt vor, die Präsentation"}, {"id": 616, "start": 4468.0, "end": 4474.76, "text": "aufzuzeichnen und die Videodatei den kranken Teilnehmer, darf sie das, nein, ach so, da"}, {"id": 617, "start": 4474.76, "end": 4482.72, "text": "bin ich mir gar nicht sicher, ehrlich gesagt, nee, Moment, Moment, ich wollte nicht B, ich"}, {"id": 618, "start": 4482.72, "end": 4488.52, "text": "wollte C sagen, ja, wenn sie zuvor die Zustimmung aller Anwesen einholt, wahrscheinlich, die"}, {"id": 619, "start": 4488.52, "end": 4494.04, "text": "Sache ist nur die, ich glaube, bei der DSGVO ist sich keiner so sicher, ob und wie was"}, {"id": 620, "start": 4494.04, "end": 4504.0, "text": "genau geregelt, ich würde sagen C, der fiktive E-Mail-Provider Mailix stammt aus den USA,"}, {"id": 621, "start": 4504.0, "end": 4509.44, "text": "der fiktive E-Mail-Provider Fastix aus Irland, welcher wäre für die NutzerInnen aus deutscher"}, {"id": 622, "start": 4509.44, "end": 4514.96, "text": "und rechtlicher, ja ja, Fastix, haben wir jetzt ja schon öfters viel gelernt, schon"}, {"id": 623, "start": 4514.96, "end": 4519.04, "text": "wieder Frau Müller, sendet Ihrem Kollegen Herr Meier eine vertrauliche Rechnung per"}, {"id": 624, "start": 4519.04, "end": 4526.0, "text": "E-Mail, diese besteht auf einer End-zu-End-Verschlüsselung, was meint er, ja, da hat er Recht, der Herr"}, {"id": 625, "start": 4526.0, "end": 4532.6, "text": "Meier ist ein guter, der hat keine Ahnung wovon er spricht, bei der Ende-zu-Ende-Verschlüsselung"}, {"id": 626, "start": 4532.6, "end": 4536.44, "text": "wird zwar die E-Mail mitsamt der vertraulichen Rechnung verschlüsselt, versandt aber unverschlüsselt"}, {"id": 627, "start": 4536.44, "end": 4545.68, "text": "im Klartext auf Zöl, tja, das kommt drauf an, normalerweise bedeutet Ende-zu-Ende-Verschlüsselung,"}, {"id": 628, "start": 4545.68, "end": 4554.32, "text": "dass es unterwegs von keinem, der das abgreift, gelesen werden kann, aber war es nicht so,"}, {"id": 629, "start": 4554.32, "end": 4561.92, "text": "dass bei D-E-Mail oder bei Postings-Mail es nicht eine Hintertür gab bei der Verschlüsselung?"}, {"id": 630, "start": 4561.92, "end": 4569.2, "text": "Also muss es das sein."}, {"id": 631, "start": 4569.2, "end": 4583.4, "text": "Okay, was sind präventive Schutzmaßnahmen gegen digitale Belästigung im Internet?"}, {"id": 632, "start": 4583.4, "end": 4588.72, "text": "Die machen sich alle wahnsinnig Gedanken über irgendwelche Hate Speech Geschichten und sowas,"}, {"id": 633, "start": 4588.72, "end": 4589.72, "text": "oder?"}, {"id": 634, "start": 4589.72, "end": 4597.52, "text": "Ich meine, ich bin jetzt seit 2010 auf YouTube und sonst was, und ich hab mich schon oft"}, {"id": 635, "start": 4597.52, "end": 4605.0, "text": "mit irgendwelchen richtig saudummen Kack, was weiß ich, ultranerfing Leuten halt, ich"}, {"id": 636, "start": 4605.0, "end": 4610.36, "text": "muss jetzt ja nicht mehr beleidigen, als es sein muss, auseinandersetzen müssen, also"}, {"id": 637, "start": 4610.36, "end": 4620.08, "text": "mehr als wahrscheinlich 99% der Leute je in ihrem Leben machen müssen, aber so viel"}, {"id": 638, "start": 4620.08, "end": 4622.44, "text": "Gedanken um Hate Speech mache ich mir auch nicht."}, {"id": 639, "start": 4622.44, "end": 4627.32, "text": "Okay, was sind präventive Schutzmaßnahmen gegen digitale Belästigung, oh nein, Time,"}, {"id": 640, "start": 4627.32, "end": 4630.84, "text": "in sozialen Netzwerken keine persönliche Information, jawoll, in sozialen Netzwerken"}, {"id": 641, "start": 4630.84, "end": 4635.56, "text": "keine Freundschaftsverfahren, jawoll, Kinder und Jugendliche, nein, nein, Kinder und Jugendliche,"}, {"id": 642, "start": 4635.56, "end": 4643.92, "text": "aufklären, Beidenhase, abschließen, easy, die letzte Frage haben wir richtig beantwortet."}, {"id": 643, "start": 4643.92, "end": 4646.72, "text": "So, was haben wir denn falsch?"}, {"id": 644, "start": 4646.72, "end": 4656.4, "text": "Ähm, Moment, was, was, was, wollt ihr mich verarschen?"}, {"id": 645, "start": 4656.4, "end": 4664.04, "text": "Ich bitte die gesamte Fraktion der Assistentin bei zu schienen ihre Unterstützung, ernsthaft,"}, {"id": 646, "start": 4664.04, "end": 4670.2, "text": "sondern soll, weil irgend, also, vielleicht möchte die das doch gar nicht, dass das Gott"}, {"id": 647, "start": 4670.2, "end": 4676.2, "text": "um die Welt mitkriegt, ich mein, stell dir mal vor, du bist, du bist im Internet, flamest"}, {"id": 648, "start": 4676.2, "end": 4680.36, "text": "dich da mit Leuten, wirst vielleicht sogar noch sexistisch beleidigt, irgendwelche Leute"}, {"id": 649, "start": 4680.36, "end": 4688.84, "text": "posten abartige Bilder und sonst was, möchte man wirklich, dass das, dass das jeder erfährt?"}, {"id": 650, "start": 4688.84, "end": 4703.44, "text": "Okay, keine Ahnung, außerdem, was soll denn die gesamte Fraktion da machen?"}, {"id": 651, "start": 4703.44, "end": 4713.6, "text": "Erstmal, erstmal, das zum öffentlichen Thema machen, dass jeder weiß, was im Internet das"}, {"id": 652, "start": 4713.6, "end": 4718.92, "text": "ist, also ich mein, wenn die, wenn die sagt, so nach dem Motto, ich komm damit alleine nicht"}, {"id": 653, "start": 4718.92, "end": 4721.72, "text": "klar, ich brauch Hilfe, ey, kann man sich jetzt alles überlegen, aber man sollte nicht"}, {"id": 654, "start": 4721.72, "end": 4731.12, "text": "von sich aus die gesamte Fraktion, das ist doch bescheuert, wahrscheinlich ist die Fraktion"}, {"id": 655, "start": 4731.12, "end": 4739.72, "text": "sogar selbst daran beteiligt, irgendwelche Typen in der hinteren Reihe oder so, okay,"}, {"id": 656, "start": 4739.72, "end": 4763.0, "text": "was hab ich noch falsch gemacht, okay, was ist daran falsch, wo steht denn was richtiges,"}, {"id": 657, "start": 4763.0, "end": 4774.72, "text": "was falsch, okay, Breakout Room, das hab ich noch nie gehört, noch nie, wirklich, keine"}, {"id": 658, "start": 4774.72, "end": 4780.36, "text": "Ahnung, was in Breakout Room ist, Datenweltgefahren, Schutztechnik, wir machen noch eine, komm"}, {"id": 659, "start": 4780.36, "end": 4791.96, "text": "Leute, wir machen noch eine, wir machen, wir machen noch Technologie Alltag, danach gucken"}, {"id": 660, "start": 4791.96, "end": 4800.04, "text": "wir noch ein paar Videos, ich muss was trinken, gibt es in Deutschland einen digitalen Personalausweis?"}, {"id": 661, "start": 4800.04, "end": 4811.12, "text": "Ja, ja, ich glaube schon, hab ich noch nie verwendet, ich glaube, den gibt's, das war"}, {"id": 662, "start": 4811.12, "end": 4816.64, "text": "so ein Versuch, den, der sich nie durchgesetzt hat, ja doch, ich glaube, den gibt's, ich"}, {"id": 663, "start": 4816.64, "end": 4823.6, "text": "glaube, den gibt's, weiter, was kann ein Unternehmen tun, wenn das Opfer eines Betrugs bei einem"}, {"id": 664, "start": 4823.6, "end": 4828.72, "text": "Fake-Shop geworden ist, ja, erstmal gucken, welcher Depp da bestellt hat und wer unfähig"}, {"id": 665, "start": 4828.72, "end": 4833.32, "text": "ist, das zu erkennen, aber okay, Polizeiverstimmungsanzeige wegen Betrugs, kann man immer machen, egal"}, {"id": 666, "start": 4833.32, "end": 4838.04, "text": "ob es online war oder nicht, wenn du gescampt wurdest, Screenshots von der Bestellung ist"}, {"id": 667, "start": 4838.04, "end": 4845.08, "text": "sicherlich auch nicht verkehrt, Bank benachrichtigen, ja, es ist auch sinnvoll, wenn man Geld zurückbuchen"}, {"id": 668, "start": 4845.08, "end": 4850.48, "text": "möchte, ja, kann man alle drei sagen, Screenshot von der Bestellung machen, wenn der Shop schon"}, {"id": 669, "start": 4850.48, "end": 4858.04, "text": "ein bisschen shady, scam-mäßig aussieht, warum nicht, ist ja auch verkehrt, alle drei,"}, {"id": 670, "start": 4858.04, "end": 4868.0, "text": "so, welche der Maßnahmen können Bestandteile des digitalen Detox sein, was für ein Ding,"}, {"id": 671, "start": 4868.0, "end": 4880.44, "text": "ich glaube, das ist nix für mich als 15 Stunden am Tag vom Rechnerhocker, ich weiß nicht mal,"}, {"id": 672, "start": 4880.44, "end": 4893.44, "text": "was das sein soll, Detox heißt entgiften, also digitales Entgiften, was, was ist denn"}, {"id": 673, "start": 4893.44, "end": 4896.84, "text": "der Unterschied zwischen dem Bahnmodus und dem Flugzeugmodus, man darf auch sagen, dass"}, {"id": 674, "start": 4896.84, "end": 4903.08, "text": "es den Bahnmodus nicht gibt, im Bahnmodus ist es eh kein Problem, weil die Bahn ist"}, {"id": 675, "start": 4903.08, "end": 4911.48, "text": "eh nicht da, kannst im Freien stehen bleiben, ohne alles, ok, Smartphone in den Bahnmodus"}, {"id": 676, "start": 4911.48, "end": 4917.8, "text": "schalten, Berechtigungen deaktivieren, ich weiß überhaupt nicht, was die von mir wollen,"}, {"id": 677, "start": 4917.8, "end": 4925.04, "text": "Bahn hat keinen Empfang, in den Flugzeugmodus schalten, Benachrichtigungen deaktivieren,"}, {"id": 678, "start": 4925.04, "end": 4936.84, "text": "ich rate jetzt mal, ich habe keinen Schimmer, was die von mir wollen, Frau Alunathan möchte"}, {"id": 679, "start": 4936.84, "end": 4942.0, "text": "die alten Büromöbel ihrer Firma bei E-Börr verkaufen, die Firma hat aber gar keinen E-Börr"}, {"id": 680, "start": 4942.0, "end": 4945.44, "text": "Account, sie hat zwei Möglichkeiten, sie legt einen Account für die Firma an oder sie verkauft"}, {"id": 681, "start": 4945.44, "end": 4950.6, "text": "die Schüler über ihren privaten Account, was ist hinsichtlich des Datenschutzes sicherer,"}, {"id": 682, "start": 4950.6, "end": 4953.28, "text": "sie sollte einen Account für ihre Firma legen, so schützt sie ihre Firma an, sie sollte"}, {"id": 683, "start": 4953.28, "end": 4958.84, "text": "ihren Firmen einen privaten Account, naja, also ganz ehrlich, wenn ich was für die Firma"}, {"id": 684, "start": 4958.84, "end": 4961.76, "text": "verkaufe, wie ich es immer mit einem Firmenaccount mache, ich würde das garantiert nicht immer"}, {"id": 685, "start": 4961.76, "end": 4967.92, "text": "meinen Privataccount machen, außer ich bin super agiles Berliner Startup oder so, da"}, {"id": 686, "start": 4967.92, "end": 4976.16, "text": "weiß man ja nie, aber wahrscheinlich will die Büromöbel da eh keiner haben, Next, was"}, {"id": 687, "start": 4976.16, "end": 4982.36, "text": "sollte man beim Online-Banking beachten, das Zugangspasswort sollte sicher sein, aus kleinen,"}, {"id": 688, "start": 4982.36, "end": 4987.48, "text": "großbuchstaben, Sonderzeichen und Zahlen bestehend, das stimmt nicht, das wollen die"}, {"id": 689, "start": 4987.48, "end": 4995.12, "text": "hören, aber das stimmt nicht, das wichtigste ist, das wichtigste ist ein langes Passwort,"}, {"id": 690, "start": 4995.12, "end": 5003.6, "text": "Länge ist deutlich wichtiger als ein großer Zeichenvorrat, es muss lang sein, man sollte"}, {"id": 691, "start": 5003.6, "end": 5010.12, "text": "ein Zahlungsmittel einrichten, um vor dem Abheben hoher Summen durch Betrüger zu schützen,"}, {"id": 692, "start": 5010.12, "end": 5016.44, "text": "ein Zahlungslimit, kann man auch machen, wenn es sowas gibt, warum nicht, man sollte das"}, {"id": 693, "start": 5016.44, "end": 5022.64, "text": "Online-Banking nicht nachts nutzen, da sind die Betrüger aktiv, ja vor allem die China-Chinesen"}, {"id": 694, "start": 5022.64, "end": 5030.0, "text": "in der anderen Zeitzone, die sind da immer ganz gefährlich nachts, so lassen wir das"}, {"id": 695, "start": 5030.0, "end": 5038.36, "text": "mal so, aber wie gesagt, das mit dem Passwort stimmt nicht, das Passwort muss lang sein,"}, {"id": 696, "start": 5038.36, "end": 5049.08, "text": "der nachts ist kälter als draußen, wisst ihr doch, weiter, der Herr Meier schon wieder,"}, {"id": 697, "start": 5049.08, "end": 5054.0, "text": "arbeitet am Tag am PC, nach dem Feierabend schneidet er zu Hause am Schreibtisch Videos"}, {"id": 698, "start": 5054.0, "end": 5060.04, "text": "für YouTube, richtig krasser Content-Creator der Herr Meier, eines Tages klagt er über"}, {"id": 699, "start": 5060.04, "end": 5066.16, "text": "Rücken- und Kopfschmerzen, was kann er tun, um zukünftig solche Schmerzen zu verhindern,"}, {"id": 700, "start": 5066.16, "end": 5071.44, "text": "ein Stuhl mit Armstütze anschaffen, mit Arm lehnen, das ist das allerwichtigste, aber"}, {"id": 701, "start": 5071.44, "end": 5075.32, "text": "das steht da wahrscheinlich nicht, er sollte mit geradem Rücken und Schultern arbeiten"}, {"id": 702, "start": 5075.32, "end": 5081.88, "text": "beziehungsweise Videos schreiben, das möchten die hören, ist jetzt, man muss vielleicht"}, {"id": 703, "start": 5081.88, "end": 5089.76, "text": "nicht da hören, wie der letzte Penner so, aber man muss jetzt auch nicht die ganze Zeit"}, {"id": 704, "start": 5089.76, "end": 5095.92, "text": "kerzen, gerade wichtig ist, dass man die Ärme ablegen kann, das ist richtig, und jetzt übrigens"}, {"id": 705, "start": 5095.92, "end": 5100.64, "text": "wir alle rein zappen beim Herr Meier gleich, er sollte zum Ausgleich Sport treiben, zum"}, {"id": 706, "start": 5100.64, "end": 5105.12, "text": "Beispiel, ja das ist richtig, er sollte mehr trinken, er sollte sich einen Massagestuhl"}, {"id": 707, "start": 5105.12, "end": 5115.24, "text": "kaufen, ja das, also, das ist jetzt eine doofe Antwort, ja das kann durchaus sein, dass"}, {"id": 708, "start": 5115.24, "end": 5125.16, "text": "es was bringt, aber pauschal würde ich das nicht so sagen, mehr trinken ist auf jeden"}, {"id": 709, "start": 5125.16, "end": 5132.96, "text": "Fall auch sinnvoll, Chat wieder, drei massagische Happy Ends, es war klar, dass der Chat noch"}, {"id": 710, "start": 5132.96, "end": 5139.68, "text": "mit irgendwie sowas um die Ecke kommt wieder, egal, weiter, so, Frau Meier, arbeitet jeden"}, {"id": 711, "start": 5139.68, "end": 5144.52, "text": "Tag und am Wochenende sehr lange, nach ihrem Feierabend haben in ihrer Kleinstadt immer"}, {"id": 712, "start": 5144.52, "end": 5151.56, "text": "alle Supermärkte zu, was kann sie tun, krass, jeden Tag und am Wochenende, die ist bestimmt"}, {"id": 713, "start": 5151.56, "end": 5164.4, "text": "Consultant Frau Meier, sie muss Excel Dateien copypasten, sie kann während der Arbeit im"}, {"id": 714, "start": 5164.4, "end": 5169.0, "text": "Supermarkt anrufen, frische Lebensmittel bestellen, ja das geht, sie kann frische Lebensmittel"}, {"id": 715, "start": 5169.0, "end": 5190.48, "text": "online bestellen, nach Feierabend, Moment, äh, das geht beides, das geht auch beides,"}, {"id": 716, "start": 5190.48, "end": 5194.6, "text": "sie kann während der Arbeit im Supermarkt, keine Ahnung ob diesen Service einen Supermarkt"}, {"id": 717, "start": 5194.6, "end": 5203.96, "text": "anbieten, sollte ein Supermarkt diesen Service anbieten, dann geht das, ok ihr habt recht,"}, {"id": 718, "start": 5203.96, "end": 5213.2, "text": "wenn der Punkt ist anrufen, dann ist es B, dann ist es B, Bestellung per Fax wäre auch"}, {"id": 719, "start": 5213.2, "end": 5225.92, "text": "noch was, weiter, was bedeutet der Begriff Smart EID, keine Ahnung, dank des Smart EID"}, {"id": 720, "start": 5225.92, "end": 5233.16, "text": "Gesetzes kann jeder Bürger innen mit einer ID, mit einer Identifikationsnummer sich in"}, {"id": 721, "start": 5233.16, "end": 5240.0, "text": "Online-Shops einkaufen, dank des Smart EID Gesetzes kann jeder Bürger innen den Personalausweis"}, {"id": 722, "start": 5240.0, "end": 5246.4, "text": "nach Online als Ausweis auf, ich hab keine Ahnung, wahrscheinlich B, weil ich mein,"}, {"id": 723, "start": 5246.4, "end": 5250.0, "text": "irgendwie Online-Shopping keinem mehr vorstellen, hab ich noch nie gesehen in der Richtung,"}, {"id": 724, "start": 5250.0, "end": 5257.4, "text": "ich kauf viel online an, muss B sein, macht aber wahrscheinlich keiner, Haltprüfung"}, {"id": 725, "start": 5257.4, "end": 5273.56, "text": "abschließen, 100%, Leute, absolut Next Level Shit hier, 5 Headings da 5 Head, weitere Prüfungsdaten,"}, {"id": 726, "start": 5273.56, "end": 5277.64, "text": "sollen wir die anderen 2 noch schnell durchklicken, dass wir dann uns am Ende das Zertifikat"}, {"id": 727, "start": 5277.64, "end": 5287.0, "text": "mal angucken können, wir machen das jetzt sag ich, ok Datenwelt, ich mach mir da, ich"}, {"id": 728, "start": 5287.0, "end": 5295.76, "text": "mach jetzt da echt mal nen Witz draus, ich speichere mir das Zertifikat als PDF und"}, {"id": 729, "start": 5295.76, "end": 5306.72, "text": "morgen schicke ich das in Teams an mein Chef, einfach mal chance vor, guck mal hier, für"}, {"id": 730, "start": 5306.72, "end": 5315.64, "text": "die nächste Gehaltsbehandlung, ok trage die fehlenden Wörter oder die fehlenden Buchstaben"}, {"id": 731, "start": 5315.64, "end": 5324.36, "text": "bei Nutzenunternehmen Software in einer Cloud spricht man von Software as a Service, wobei"}, {"id": 732, "start": 5324.36, "end": 5333.28, "text": "das gar nicht mal sein muss, das stimmt ja nicht was da steht, das muss nicht zwangsläufig"}, {"id": 733, "start": 5333.28, "end": 5343.92, "text": "sein, aber wahrscheinlich ist es Software as a Service, weiter, trage die fehlenden"}, {"id": 734, "start": 5343.92, "end": 5359.92, "text": "Passwörter ein, npass last Nordpass sind Password Manager, Nordpass, ja die Geschichte mit NordVPN"}, {"id": 735, "start": 5359.92, "end": 5363.12, "text": "habe ich euch ja schon zweimal erzählt, ich muss mal kurz in meine E-Mails gucken, ob"}, {"id": 736, "start": 5363.12, "end": 5371.36, "text": "die nochmal geantwortet haben, NordVPN wollte ja, dass ich mein VPN-kritisches Video lösche,"}, {"id": 737, "start": 5371.36, "end": 5376.32, "text": "dass sie zu einer Kooperation bereit sind, das mache ich nicht, gucken ob es was neues"}, {"id": 738, "start": 5376.32, "end": 5387.32, "text": "gibt, Sekunde ich schau mal kurz rein, Auszahlungsvergütung, ah das lese ich natürlich immer gerne, Umfrage,"}, {"id": 739, "start": 5387.32, "end": 5412.88, "text": "ich kriege wieder G2A Werbung, MonkaS, geh weg, ok schnell, also weiter, Herr Demir vertritt"}, {"id": 740, "start": 5412.88, "end": 5419.16, "text": "seine Kollegin Frau Schmidt auf einem Messe stand, seiner Firma, ein Interessent meldet"}, {"id": 741, "start": 5419.16, "end": 5425.28, "text": "sich und möchte mit der Firma Kontakt aufnehmen, leider sind Herr Demirs Visitenkarten alle,"}, {"id": 742, "start": 5425.28, "end": 5440.76, "text": "feels Batman, Visitenkarten, das ist ja schon richtig Boomer Style oder, ok darf er die"}, {"id": 743, "start": 5440.76, "end": 5445.76, "text": "Visitenkarte von Frau Schmidt verteilen, ja wenn Frau Schmidt der Weitergabe ihrer persönlichen"}, {"id": 744, "start": 5445.76, "end": 5453.64, "text": "Kontaktdaten an Interessenten zugeschümmelt, ja, Herr Yilmaz meint, meine Daten sind synchronisiert"}, {"id": 745, "start": 5453.64, "end": 5458.04, "text": "worden, was meint er, wahrscheinlich weiß er nicht wovon er spricht, deswegen können"}, {"id": 746, "start": 5458.04, "end": 5462.84, "text": "wir das eigentlich überspringen, die Daten die er meint sind auf der internen und externen"}, {"id": 747, "start": 5462.84, "end": 5466.44, "text": "Festplatte gleichzeitig geöffnet worden, die Daten die meint er auf dem internen und externen"}, {"id": 748, "start": 5466.44, "end": 5477.44, "text": "auf dem gleichen Stand, wahrscheinlich meint er das, ja, wobei, also das, egal, er weiß"}, {"id": 749, "start": 5477.44, "end": 5481.64, "text": "wie gesagt, er weiß nicht wovon er spricht, der Herr Krallmayer ist wieder am Start, sagt"}, {"id": 750, "start": 5481.64, "end": 5486.64, "text": "zu seinem Kollegen, Verstöße gegen den Datenschutz können Unternehmen bis zu 20 Millionen Euro"}, {"id": 751, "start": 5486.64, "end": 5496.32, "text": "Strafgeld kosten, hat er recht, keine Ahnung was in der DSGVO als Höchststrafe drin steht,"}, {"id": 752, "start": 5496.32, "end": 5500.08, "text": "ja das wäre in der Regel sind die Bußgelder viel niedriger, ok, ja die Datenschutzbörse"}, {"id": 753, "start": 5500.08, "end": 5503.92, "text": "kann aber von der Strafe abziehen, wenn der Datenschutzverschluss schnell beruht, wahrscheinlich"}, {"id": 754, "start": 5503.92, "end": 5509.76, "text": "auch, nein so hoch darf die Strafe, nein es gibt kein Geld, wahrscheinlich A und B oder,"}, {"id": 755, "start": 5509.76, "end": 5529.2, "text": "Chat was meint ihr, wahrscheinlich A und B, passt, nur A, warum ist, warum nur A, kann"}, {"id": 756, "start": 5529.2, "end": 5537.44, "text": "ihr nicht davon absehen, ich hab keine Ahnung, wenn ich ehrlich bin, warum sollen die davon"}, {"id": 757, "start": 5537.44, "end": 5543.48, "text": "absehen, was weiß ich, ich frage jetzt, ob sie es können oder nicht, egal wir lassen"}, {"id": 758, "start": 5543.48, "end": 5552.08, "text": "das jetzt so, Ralf bekommt nach dem Login in seinem, die haben es nicht mit richtig"}, {"id": 759, "start": 5552.08, "end": 5556.64, "text": "deutschen Sätzen, ich meine ich schreib auch viel Mist, aber wenn das ein offizieller"}, {"id": 760, "start": 5556.64, "end": 5561.52, "text": "Webauftritt ist, wer hat denn das geschrieben, haben sie das irgendwie über Pfeifer in Indian"}, {"id": 761, "start": 5561.52, "end": 5569.56, "text": "Out gesourced oder was, Ralf bekommt nach dem Login in seinen Online Shop eine SMS mit"}, {"id": 762, "start": 5569.56, "end": 5578.68, "text": "einem Code an sein Smartphone gesendet, mit dem Code soll er den Login bestätigen, er"}, {"id": 763, "start": 5578.68, "end": 5605.4, "text": "hat die zwei Faktor Authentisierung, schreibt man das in Deutsch so, Authentisierung tatsächlich,"}, {"id": 764, "start": 5605.4, "end": 5613.28, "text": "es müsste aber eigentlich eine Authentifizierung sein, weil der Unterschied da zwischen den"}, {"id": 765, "start": 5613.28, "end": 5621.92, "text": "beiden ist, das eine bedeutet, ob du rein darfst, das andere bedeutet, was du dann danach"}, {"id": 766, "start": 5621.92, "end": 5631.36, "text": "darfst, wenn du drinne bist, das ist der Unterschied zwischen Authentifizierung und Authentifizierung,"}, {"id": 767, "start": 5631.36, "end": 5636.8, "text": "da bin ich mal gespannt, ob die das hinkriegen, wenn man da zwei, da bin ich mal gespannt,"}, {"id": 768, "start": 5636.8, "end": 5644.32, "text": "wenn man da zwei reinschreibt, dürfen ArbeitnehmerInnen nach einer Kündigung von ihrem ArbeitgeberInnen,"}, {"id": 769, "start": 5644.32, "end": 5652.88, "text": "von ihrem ArbeitgeberInnen, Moment, Alter, muss man Arbeitgeber ernsthaft gendern, ich"}, {"id": 770, "start": 5652.88, "end": 5658.64, "text": "meine ArbeitnehmerInnen verstehe ich ja noch irgendwie, aber von ihrem Arbeitgeber, das"}, {"id": 771, "start": 5658.64, "end": 5662.64, "text": "ist doch schon so ein abstraktes Ding und bezieht sich halt meistens noch nicht nur auf eine"}, {"id": 772, "start": 5662.64, "end": 5673.04, "text": "echte Person, sondern eben halt auf das Unternehmen, das Unternehmen ist ja der Arbeitgeber und"}, {"id": 773, "start": 5673.04, "end": 5678.68, "text": "nicht irgendwie eine Person, naja, dass ihre personenbezogenen Daten im Unternehmen gelöscht"}, {"id": 774, "start": 5678.68, "end": 5689.12, "text": "werden, ja, ja, ich denke mal schon, ich meine die erste Antwort ist so bescheuert, das kann"}, {"id": 775, "start": 5689.12, "end": 5705.16, "text": "eigentlich nicht sein, ja oder, ich denke, dass das passt, ich finde das geil, da sagst"}, {"id": 776, "start": 5705.16, "end": 5709.1, "text": "du, Alter, machst du dich einmal über die Geschichte lustig, schon kommen sie im Chat"}, {"id": 777, "start": 5709.1, "end": 5716.16, "text": "die Leute an, ja, Max, ja, ha ha, null, fick die Scheiße, was, ne, die Sache ist wie immer"}, {"id": 778, "start": 5716.16, "end": 5723.04, "text": "nicht schwarz und weiß, aber das ist, was, das ist ja klar, das, das, so ist das halt"}, {"id": 779, "start": 5723.04, "end": 5729.18, "text": "im Chat, das ist, wie viel ist nicht schwarz und weiß und wisst ihr warum, ich persönlich"}, {"id": 780, "start": 5729.18, "end": 5733.4, "text": "bin ja der Meinung, die ganzen Diskussionen über gendern und nicht gendern sind komplett"}, {"id": 781, "start": 5733.4, "end": 5738.6, "text": "heiße Luft und eigentlich komplett verschwendetes Geld, Geld auch, verschwendete Zeit. Wisst"}, {"id": 782, "start": 5738.6, "end": 5743.0, "text": "ihr warum da so viel darüber diskutiert wird? Also ich bin der Meinung, das wird sich entweder"}, {"id": 783, "start": 5743.0, "end": 5749.84, "text": "durchsetzen oder nicht, wenn es einen sinnvollen Mehrwert bietet und die Leute davon überzeugt"}, {"id": 784, "start": 5749.84, "end": 5754.16, "text": "mit der Zeit. Wird sich das durchsetzen, übers Knie brechen, kann so nichts, aber wisst"}, {"id": 785, "start": 5754.16, "end": 5761.64, "text": "ihr, wisst ihr warum da so viele Leute wahnsinnig emotional und aufgeheizt darüber diskutieren?"}, {"id": 786, "start": 5761.64, "end": 5769.2, "text": "Das liegt einzig und allein daran, weil es ein, wie soll ich sagen, ein simples Thema"}, {"id": 787, "start": 5769.2, "end": 5776.88, "text": "ist, wo jeder irgendeine Meinung dazu hat, die er kundtun will. Ja, das ist jetzt keine"}, {"id": 788, "start": 5776.88, "end": 5782.48, "text": "Raketenwissenschaft, das ist eigentlich ein ziemlich überschaubares, simples Themengebiet,"}, {"id": 789, "start": 5782.48, "end": 5789.44, "text": "wo man, wo jeder meint, was dazu sagen zu müssen. Und jeder, jeder ist da Meinung,"}, {"id": 790, "start": 5789.44, "end": 5795.44, "text": "jeder muss sein, jeder, die anderen sagen, nein, darf auf gar keinen Fall sein. Und eigentlich"}, {"id": 791, "start": 5795.44, "end": 5801.28, "text": "lenkt das von deutlich wichtigeren Problemen ab, die man hat, worüber sich die Leute sich"}, {"id": 792, "start": 5801.28, "end": 5804.56, "text": "vielleicht mal Gedanken machen sollten. Ansonsten, mir ist das vollkommen egal. Ich könnte es"}, {"id": 793, "start": 5804.56, "end": 5809.32, "text": "an manchen Stellen sehr unglücklich lesbar, gerade wenn man noch nicht einmal sich darauf"}, {"id": 794, "start": 5809.32, "end": 5813.84, "text": "geeinigt hat, wie man es denn jetzt macht, mit Doppelpunkt, mit Unterstrichen, mit Grunes"}, {"id": 795, "start": 5813.84, "end": 5820.08, "text": "im E-Mail, mit kleinem E-Mail, mit Sternchen auseinandergeschrieben. Wisst ihr eigentlich,"}, {"id": 796, "start": 5820.08, "end": 5830.24, "text": "wie man Bürgermeister richtig gendert? Es ist, wenn man genau nimmt, ist es der Bürger,"}, {"id": 797, "start": 5830.24, "end": 5838.04, "text": "also manche, die Noobs würden jetzt schreiben BürgermeisterInnen, aber in Wirklichkeit"}, {"id": 798, "start": 5838.04, "end": 5848.28, "text": "ist es ja BürgerInnen, MeisterInnen, weil Bürger muss ja nicht ein Kerl sein. Eigentlich"}, {"id": 799, "start": 5848.28, "end": 5856.88, "text": "wäre Bürgermeister korrekt gegendert BürgerInnen-MeisterInnen. Ja, und da wird es mir auch ein bisschen zu"}, {"id": 800, "start": 5856.88, "end": 5866.52, "text": "abgedreht, ehrlich gesagt. So, weiter ohne noch eine Minute, fuck. GPG4Win, ArchieKripp,"}, {"id": 801, "start": 5866.52, "end": 5876.44, "text": "Kripp und Schubach sind Programme zur Verschlüsselung und Laufwerken. Exzellent. Und? Und? 100%!"}, {"id": 802, "start": 5876.44, "end": 5891.72, "text": "Leute, er hat zwei Faktor-Authentifizierungen mit der Zahl 2 gecheckt. Easy. Easy. So, letzte"}, {"id": 803, "start": 5891.72, "end": 5900.6, "text": "Prüfung, starten. Auf geht's. Hilmas ist wieder am Start. Finde bei Twitter einen Account"}, {"id": 804, "start": 5900.6, "end": 5908.32, "text": "von ihm, den er nicht registriert hat. Das waren die Hater bestimmt. Mein Opa ist auf"}, {"id": 805, "start": 5908.32, "end": 5918.84, "text": "Twitch, nice. Easy. Danke für den Prime-Sub. Den er nicht registriert hat. Offenbar hat"}, {"id": 806, "start": 5918.84, "end": 5928.6, "text": "jemand seine Identität gestohlen. Was sollte Herr Hilmats machen? Ehrlich gesagt, ignorieren."}, {"id": 807, "start": 5928.6, "end": 5945.76, "text": "Wahrscheinlich ist es, ich mein, geht mal auf Twitter und such da mal nach MaxFPS. Da findest"}, {"id": 808, "start": 5945.76, "end": 5956.2, "text": "du durchaus einige. Und who cares, ja. Okay, den Betrüger bei Twitter per Direktnachricht"}, {"id": 809, "start": 5956.2, "end": 5963.56, "text": "anschreiben und ihn bitten, den Account zu löschen. Kann man probieren. Wird wahrscheinlich"}, {"id": 810, "start": 5963.56, "end": 5968.8, "text": "nichts bringen, weil das Konto inaktiv ist. Anzeige bei der Polizei erstatten. Nein, das"}, {"id": 811, "start": 5968.8, "end": 5976.32, "text": "Fake-Konto bei Twitter. Ja. An dem seiner Stelle würde ich einfach einen neuen Account erstellen."}, {"id": 812, "start": 5976.32, "end": 5990.24, "text": "Herr Hilmats underscore 2022 oder sowas. Frau Demir ist Systemadministratorin. Ihr Chef"}, {"id": 813, "start": 5990.24, "end": 5995.48, "text": "meint, Antiviren-Software anzuschaffen, das wäre zu teuer und unnötig. Ist es auch?"}, {"id": 814, "start": 5995.48, "end": 6003.32, "text": "Ist es. Was wären gute Argumente um ihren Chef? Gar nicht. Alles bloated. Der Chef hat"}, {"id": 815, "start": 6003.32, "end": 6011.52, "text": "Recht. Okay, gute Antiviren-Software findet Schadsoftware und kann sie unschädlich machen."}, {"id": 816, "start": 6011.52, "end": 6019.16, "text": "Ja, aber der Winner aus Defender macht das auch schon. Worüber man sich unter, genau,"}, {"id": 817, "start": 6019.16, "end": 6028.76, "text": "real Hilmats macht, das ist ein Twitter-Account. Also, worüber man sich vielleicht unterhalten"}, {"id": 818, "start": 6028.76, "end": 6032.96, "text": "kann, ist für den Fileserver sowas anzuschaffen oder sowas. Also, gehen wir mal davon aus,"}, {"id": 819, "start": 6032.96, "end": 6039.4, "text": "wie sie wollen das wirklich. Sie wollen das wirklich an. Okay. Ja, vielleicht, vielleicht,"}, {"id": 820, "start": 6039.4, "end": 6042.72, "text": "vielleicht haben sie auch ein Krypto-Miner mit dabei, wie Norton Antivirus neuerdings"}, {"id": 821, "start": 6042.72, "end": 6053.0, "text": "und Avira auch. Gute Antiviren-Software kann Phishing-Vorfälle verhindern. Kommt auf den"}, {"id": 822, "start": 6053.0, "end": 6065.2, "text": "Phishing-Versuch an. Möglich, ja. Gute Antiviren-Software spart Kosten, die nach einem für Hacker"}, {"id": 823, "start": 6065.2, "end": 6072.36, "text": "erfolgreichen Angriff mit Schadsoftware entstehen. Kann auch sein. Gute Antiviren-Software schützt"}, {"id": 824, "start": 6072.36, "end": 6078.28, "text": "das gesamte Firmennetzwerk. Nein, das ist Schwachsinn. Gute Antiviren-Software installiert"}, {"id": 825, "start": 6078.28, "end": 6081.4, "text": "Sicherheitsupdates für alle installierten Programme. Nein, das ist auch Schwachsinn."}, {"id": 826, "start": 6081.4, "end": 6085.6, "text": "Gute Antiviren-Software installiert Sicherheitsupdates für den Router und Schütten. Nein,"}, {"id": 827, "start": 6085.6, "end": 6090.36, "text": "das ist auch Schwachsinn. Also, ich würde es jetzt einfach mal so lassen. So, weiter. Frau"}, {"id": 828, "start": 6090.36, "end": 6095.28, "text": "Meyer ist schon wieder am Start. Der Herr Demir und die Frau Meyer, die haben echt was zu tun. Ist Frau"}, {"id": 829, "start": 6095.28, "end": 6098.28, "text": "Meyer nicht auch die, die montags bis freitags und samstags und sonntags arbeiten,"}, {"id": 830, "start": 6098.28, "end": 6103.4, "text": "deswegen nicht in den Supermarkt gehen kann? Jetzt ergibt das auch alles Sinn. Also, sie fragt ihren"}, {"id": 831, "start": 6103.4, "end": 6108.32, "text": "Kollegen Herr Demir, ob sie auf einen Link klicken sollte, den sie per E-Mail vermeintlich von der"}, {"id": 832, "start": 6108.32, "end": 6122.0, "text": "Deutschen Bank zugesendet bekommen hat. Ja, wahrscheinlich Deutsche Bank echt at indiamail.cc oder sowas."}, {"id": 833, "start": 6122.0, "end": 6129.52, "text": "Denen sie per E-Mail vermeintlich von der Deutschen Bank. Angeblich müsse das Geschäftskontakt auf"}, {"id": 834, "start": 6129.52, "end": 6135.68, "text": "grund einer Unregelmäßigkeit überprüferter Absender ist. Kundenbetrug, Deutsche Bank,"}, {"id": 835, "start": 6135.68, "end": 6144.8, "text": "Kontoprüfung 654d.com. Klingt äußerst vertrauenserweckend. Was solltet ihr anklicken?"}, {"id": 836, "start": 6144.8, "end": 6157.52, "text": "Klicke nicht auf den Link. So. TheRealDeutscheBank.ru Die folgenden Wörter ein. Ein bezeichnet einen"}, {"id": 837, "start": 6157.52, "end": 6161.32, "text": "Teil einer Software, der es hackern ermöglicht, Sicherheitseinschränkungen zu umgehen und Zugriff"}, {"id": 838, "start": 6161.32, "end": 6176.24, "text": "zu Systemen zu bekommen. Ein Exploit? Oder? Oder ein, ein, ein. Was wollen die denn da wissen?"}, {"id": 839, "start": 6176.24, "end": 6206.2, "text": "Nee. Ein. Keylogger? Oyana? Backdome. Ein Teil"}, {"id": 840, "start": 6206.2, "end": 6224.88, "text": "einer Software. Der Gerät. Also ich hätte, ich hätte aus dem Bauchhaus gesagt exploit."}, {"id": 841, "start": 6236.2, "end": 6245.64, "text": "Wobei er exploit eigentlich nicht ganz korrekt ist. Exploit ist ja quasi das Ausnutzen einer"}, {"id": 842, "start": 6245.64, "end": 6251.08, "text": "sich. Ich habe keine Ahnung, was die VW wissen wollen. Ein exploit ist tatsächlich nicht Teil"}, {"id": 843, "start": 6251.08, "end": 6255.8, "text": "einer Software. Das ist richtig. Eigentlich ist das Ausnutzen einer sicher. Kann man das"}, {"id": 844, "start": 6255.8, "end": 6267.28, "text": "Sicherheitslücke reinschreiben? Nee. Ich habe wirklich keine Ahnung. Ein Backdoor?"}, {"id": 845, "start": 6267.28, "end": 6280.4, "text": "Ein Backdoor? Bezeichnet einen Teil, aber das ist doch kein Teil einer. Ich habe. Nein,"}, {"id": 846, "start": 6280.4, "end": 6289.48, "text": "ich bleibe jetzt bei exploit. Egal. Mo schon wieder veröffentlicht seinen kompletten Lebenslauf"}, {"id": 847, "start": 6289.48, "end": 6294.2, "text": "mitsamt Bewerbungsfotos, E-Mails, Adresse, Arbeiten auf allen Social Media, Facebook,"}, {"id": 848, "start": 6294.2, "end": 6300.28, "text": "LinkedIn, Xing und so weiter. Er hofft so auf Jobangebote. Warum ist das keine gute Idee?"}, {"id": 849, "start": 6300.28, "end": 6305.72, "text": "Er könnte Opa von Doxid. Wer hat diese Texte geschrieben? Die haben das wirklich nach Indien"}, {"id": 850, "start": 6305.72, "end": 6314.68, "text": "Pfeiffer über Pfeiffer nach Indien outsourced. Er könnte Opa von Doxing werden. Na ja. Nee,"}, {"id": 851, "start": 6314.68, "end": 6319.72, "text": "könnte er nicht. Er hat sich selber gedoxt. Er hat alles hochgeladen. Er muss gar nicht"}, {"id": 852, "start": 6319.72, "end": 6325.24, "text": "mehr gedoxt werden. Er könnte mehr Spam per E-Mail bekommen. Mit Sicherheit. Er könnte"}, {"id": 853, "start": 6325.24, "end": 6334.48, "text": "Opfer von Social Media Management werden. Er könnte Opfer von Social Media Management werden."}, {"id": 854, "start": 6334.48, "end": 6346.88, "text": "Von was? Hä? Das könnte wahrscheinlich auch passen. Wobei. Wahrscheinlich. Ich habe keine"}, {"id": 855, "start": 6346.88, "end": 6356.2, "text": "Ahnung. Die wollen bestimmt A und B hören. Ich habe ehrlich gesagt legit kein Plastischimmer,"}, {"id": 856, "start": 6356.2, "end": 6366.68, "text": "was da die richtige Antwort ist. Weiter. Sollte Administratorinnen Software in Unternehmen"}, {"id": 857, "start": 6366.68, "end": 6382.84, "text": "so konfigurieren? Das ist an der Stelle auch noch falsch. Sollten Administratorinnen Software"}, {"id": 858, "start": 6382.84, "end": 6392.12, "text": "in Unternehmen oder Administratorinnen in dem Fall Software in Unternehmen so konfigurieren,"}, {"id": 859, "start": 6392.12, "end": 6397.88, "text": "dass diese sich automatisch aktualisieren? Ja. Nein. Sicherheitsprobe. Das werden je"}, {"id": 860, "start": 6397.88, "end": 6404.2, "text": "nach Software nur alle paar Wochen oder paar Monate noch mal. Die Mitarbeiter. Jawoll."}, {"id": 861, "start": 6404.2, "end": 6413.48, "text": "Trage den fehlenden Fachbegriff ein. Herr Meyer ist CEO eines großen Konzerns und findet"}, {"id": 862, "start": 6413.48, "end": 6417.72, "text": "plötzlich zahlreiche Accounts von sich auf Xing, die er nicht angenehm hat. In den Profilen"}, {"id": 863, "start": 6417.72, "end": 6425.76, "text": "gibt es viele Fotos und private Daten von ihm. Offensichtlich ist er Opfer von Identitätsdiebstahl."}, {"id": 864, "start": 6425.76, "end": 6441.28, "text": "Wie schreibt man das? Identitätsdiebstahl. Identitätsdiebstahl geworden. Was sind Anzeichen"}, {"id": 865, "start": 6441.28, "end": 6447.12, "text": "von phishingversuchenden E-Mails? Fragen nach Zugangsdaten? Ja. Fehlende Bilder oder"}, {"id": 866, "start": 6447.12, "end": 6456.0, "text": "Logos? Ja. Kommt drauf an, aber ja, die tun sich oft mal schwer. Unpersönlich? Ja. Genau"}, {"id": 867, "start": 6456.0, "end": 6460.64, "text": "so wie bei eurem Test. E-Mail des Absenders passt nicht zum angezeigten Absender-Namen."}, {"id": 868, "start": 6460.64, "end": 6484.32, "text": "Ja. Ja, alles. Okay. Oh. 50%! Oh Gott. Das haben wir verschätzt, ne? Okay, Frage 1,"}, {"id": 869, "start": 6484.32, "end": 6493.6, "text": "ist schon mal falsch. Anzeige! Anzeige! Ich soll allen Ernstes Anzeige erstatten, weil"}, {"id": 870, "start": 6493.6, "end": 6501.92, "text": "irgendjemand Yilmaz01 mit meinem Foto angelegt hat, oder was? Anzeige! Wegen einem Twitter-Profil,"}, {"id": 871, "start": 6501.92, "end": 6514.8, "text": "das jemand anderes angelegt hat. Ja, ich hab auch sonst nichts besseres zu tun. Alter!"}, {"id": 872, "start": 6514.8, "end": 6531.88, "text": "Alarm, Alarm. Okay, 2. Guter Anti-Viren-Softer schützt das gesamte Firmenetz. Nein? Nein?"}, {"id": 873, "start": 6531.88, "end": 6540.0, "text": "Was ist Schwachsinn? Zeig mir mal eine gute Anti-Viren-Softer, die das gesamte Firmenetzwerk"}, {"id": 874, "start": 6540.0, "end": 6551.16, "text": "umfassend mit ihr macht. Schwachsinn, Alter. Was ist das? Dumm, dumm. Kack. So. Hier."}, {"id": 875, "start": 6551.16, "end": 6556.56, "text": "Okay, hier kriegen wir keine Antwort drauf. Keine Ahnung, was Sie hier wissen wollen von"}, {"id": 876, "start": 6556.56, "end": 6562.2, "text": "mir. Frage 8 ist falsch. Wie, fehlende Bilder und Logos nicht? Aber fehlende Bilder und"}, {"id": 877, "start": 6562.2, "end": 6566.68, "text": "Logos kann da auch drauf hindeuten. Wenn du eine E-Mail, wenn du eine HTML-E-Mail kriegst"}, {"id": 878, "start": 6566.68, "end": 6571.08, "text": "und da ist anstatt das deutsche Banklogo auf einmal irgendwie ein China-Chinesen-Ding"}, {"id": 879, "start": 6571.08, "end": 6577.96, "text": "drin, dann kannst du dir denken, ah ne, da stimmt was nicht. Rootkit. Rootkit. Das,"}, {"id": 880, "start": 6577.96, "end": 6587.16, "text": "ne, wobei, nein. Das ergibt ja auch keinen Sinn. Aber das ergibt, doch, das ergibt noch"}, {"id": 881, "start": 6587.16, "end": 6593.56, "text": "wenig, doch, das ergibt noch mehr Sinn. Das ergibt noch mehr Sinn. Bug. Ein Bug, aber"}, {"id": 882, "start": 6593.56, "end": 6598.92, "text": "ein Bug ermöglicht das Hacker nicht automatisch, Sicherheitseinstellungen zu umgehen. Was auch"}, {"id": 883, "start": 6598.92, "end": 6604.44, "text": "immer. Wir haben es geschafft, Leute. Wir haben es geschafft. Nein, nein, ich will mich"}, {"id": 884, "start": 6604.44, "end": 6624.72, "text": "nicht mal verbessern. Wo ist mein Zertifikat? Wo ist, wo ist mein Zertifikat. Kommt das"}, {"id": 885, "start": 6624.72, "end": 6646.68, "text": "per Fax morgen an? Was? 0 von 6? Ich hab alles durch. Ach so. Ja gut, meine, meine"}, {"id": 886, "start": 6646.68, "end": 6670.4, "text": "E-Mail. Die E-Mail, die E-Mail ist ja auch, ähm, was? Ne, Moment, Level 1? Hä? Okay,"}, {"id": 887, "start": 6670.4, "end": 6676.8, "text": "die Seite ist auch noch broken as fuck. So, wir machen jetzt nochmal, wir machen jetzt"}, {"id": 888, "start": 6676.8, "end": 6682.96, "text": "mal Sache. Mich interessiert mal aus, was diese Webseite besteht. Okay, schonmal nicht"}, {"id": 889, "start": 6682.96, "end": 6689.92, "text": "Minifile, wobei, das ist hart hier. Wobei, Sourcecode? Kein Minifile, Sourcecode und nix."}, {"id": 890, "start": 6689.92, "end": 6701.52, "text": "Was ist denn hier los? Auf was basiert denn das Ganze? Wir machen einfach Awesome Stack,"}, {"id": 891, "start": 6701.52, "end": 6704.92, "text": "Awesome Text Stack. Wir lassen einfach mal die Seite analysieren und uns sagen, was die,"}, {"id": 892, "start": 6704.92, "end": 6715.6, "text": "was die, was die verwenden. Jawoll, das da. Analysiere die Seite mal und sag mir, was"}, {"id": 893, "start": 6715.6, "end": 6726.52, "text": "die verwenden. JQuery? Wait a minute, das stimmt wahrscheinlich noch nicht. Mal kurz"}, {"id": 894, "start": 6726.52, "end": 6742.76, "text": "warten, bis das fertig analysiert hat. Es ist erst Beta, stimmt. Underscore Lowdash,"}, {"id": 895, "start": 6742.76, "end": 6750.44, "text": "okay, erst mal beides drinne. Backbone.js? Alter, das ist ja antik, das Ding. JQuery"}, {"id": 896, "start": 6750.44, "end": 6769.8, "text": "UI? JQuery, Michael, JQuery, Anime.cs, MySQL, WordPress. Okay, Capture. WordPress, JQuery."}, {"id": 897, "start": 6769.8, "end": 6777.24, "text": "Warum verwendet es Backbone und PHP? Backbone ist ja eigentlich, ne Moment, Moment, sorry."}, {"id": 898, "start": 6777.24, "end": 6784.04, "text": "Backbone war so eines der ersten Client-Side-Frameworks, ne? Was ist denn das? Das ist ja antik as"}, {"id": 899, "start": 6784.04, "end": 6804.8, "text": "fuck. Wer verwendet denn sowas? So sah der Tech Stack mal vor 10 Jahren aus. Awesomeness"}, {"id": 900, "start": 6804.8, "end": 6816.32, "text": "37. Quality Report. Die Webseite hat wahrscheinlich 10 Jahre Entwicklung gebraucht, ja, das wird"}, {"id": 901, "start": 6816.32, "end": 6826.96, "text": "wahrscheinlich sein. Boah, das ist aber schlecht. Nicht mal JJQuery. Ne, das ist schlecht, ja."}, {"id": 902, "start": 6826.96, "end": 6840.52, "text": "Also ich hätte wenigstens JJQuery erwartet. Okay, Performance ist schlecht. Best Practice"}, {"id": 903, "start": 6840.52, "end": 6856.76, "text": "ist es aber. Performance, 41%. Sucked. Okay. Na denn? Wissen wir Bescheid, jetzt haben wir"}, {"id": 904, "start": 6856.76, "end": 6864.44, "text": "den Internetführerschein. Code this, not that. Okay, wenn wir gerade dabei sind. Ach in React?"}, {"id": 905, "start": 6864.44, "end": 6875.88, "text": "Ne, in React nicht. Von React habe ich keinen Plan. Rare Interview with a Perl Programmer."}, {"id": 906, "start": 6875.88, "end": 6886.44, "text": "Okay, das gucken wir jetzt mal. Perl. Perl Hacker Mans. Oh, mein Zahnarzt schon wieder."}, {"id": 907, "start": 6886.44, "end": 6906.84, "text": "Okay, Moment, wo sind wir? Perl Programmer. Okay, das ist nicht lustig. Lul. Critical Update"}, {"id": 908, "start": 6906.84, "end": 6916.72, "text": "inbound. Da kommt doch eh nichts Gescheites. Leute, ich könnte morgen ein Video über den"}, {"id": 909, "start": 6916.72, "end": 6921.24, "text": "Internetführerschein machen, nachdem wir das jetzt ja durch haben. Wo ich ja sage,"}, {"id": 910, "start": 6921.24, "end": 6932.0, "text": "das ist sehr fragwürdig, was da teilweise drinne gefragt wird. Big Update heißt zwei neue Skins"}, {"id": 911, "start": 6932.0, "end": 6944.0, "text": "und drei Sachen wurden gefixt. Sekunde, Sekunde, Sekunde. Steam, Steam Stats. Unter 2000 sind"}, {"id": 912, "start": 6944.0, "end": 6958.16, "text": "wir jetzt schon. Not Stonks. Es geht abwärts. Obwohl man eigentlich gar nicht für möglich"}, {"id": 913, "start": 6958.16, "end": 6964.88, "text": "hat, das geht weiter abwärts. Und New World? New World? Was macht New World? Kackt auch"}, {"id": 914, "start": 6964.88, "end": 6973.08, "text": "weiter ab. Exzellent. Die Abkacker sind weiter am Abkacken. Wunderbar. Es geht ab wie der"}, {"id": 915, "start": 6973.08, "end": 7000.32, "text": "Rostische Rube. In die gleiche Richtung."}, {"id": 916, "start": 7000.32, "end": 7024.92, "text": "Also ganz ehrlich, das Spiel ist dadurch nicht weiter großartig nennenswert an meine"}, {"id": 917, "start": 7024.92, "end": 7047.64, "text": "Expectations rangerückt. Das hat mich ehrlich gesagt nicht so sehr geschockt. Das sind"}, {"id": 918, "start": 7047.64, "end": 7061.6, "text": "der ehemalige DICE Mitarbeiter. Das hat mich nicht so geschockt im Teaser. Hat mich nicht"}, {"id": 919, "start": 7061.6, "end": 7076.0, "text": "so geschockt, aber vielleicht taugt's ja. Alter, wo bitte spielt denn der Typ, wenn"}, {"id": 920, "start": 7076.0, "end": 7092.48, "text": "man so eine Jacke anhaben muss beim Spielen? Ist da Minus?"}, {"id": 921, "start": 7092.48, "end": 7109.76, "text": "Hat mich nicht so geschockt, ehrlich gesagt."}, {"id": 922, "start": 7109.76, "end": 7129.96, "text": "Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja."}, {"id": 923, "start": 7129.96, "end": 7159.88, "text": "Was genau hat das Space Shuttle mit dem"}, {"id": 924, "start": 7159.88, "end": 7169.04, "text": "Steam Deck zu tun? Der Zusammenhang erschließt sich mir gerade absolut überhaupt nicht. Startende"}, {"id": 925, "start": 7169.04, "end": 7176.12, "text": "Rakete. Zumal es immer nur exciting und so on wir freuen uns, wir sind hyped, startende"}, {"id": 926, "start": 7176.12, "end": 7178.24, "text": "Rakete, aber ansonsten hat er nichts damit zu tun."}, {"id": 927, "start": 7178.24, "end": 7193.96, "text": "Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja."}, {"id": 928, "start": 7193.96, "end": 7206.0, "text": "Das Spiel hat mich nicht so geschockt, aber vielleicht taugt's ja."}, {"id": 929, "start": 7206.0, "end": 7230.6, "text": "Ich bin mal gespannt, ob sie das überhaupt weiter supporten. Also ob das gut ist, wenn"}, {"id": 930, "start": 7230.6, "end": 7241.64, "text": "es da weiter Support gibt. Erinnert sich noch jemand an Steam Machines und solche Dinge?"}, {"id": 931, "start": 7241.64, "end": 7268.64, "text": "War das ein Steam Controller? Ja, auf jetzt komm. Ist das eine Werbung dafür?"}, {"id": 932, "start": 7268.64, "end": 7281.76, "text": "Wir gucken uns was anderes an. Level Cap G-Bait wird mir zu sehr gerade. Zu großer G-Bait."}, {"id": 933, "start": 7281.76, "end": 7289.56, "text": "So was gucken wir uns denn jetzt an? Mein Zahnarzt ist wieder am Start. Der Chat sagt,"}, {"id": 934, "start": 7289.56, "end": 7299.24, "text": "das Video wäre nicht gut. Incredible Budget Server. Wo ist er denn? Minecraft. Install"}, {"id": 935, "start": 7299.24, "end": 7307.2, "text": "in Linux. Das sieht aus wie ein Kühlschrank. Das sieht aus wie ein Kühlschrank gerade,"}, {"id": 936, "start": 7307.2, "end": 7314.12, "text": "auch mit der Spiegeltür. Schau das, Vassim vs. Stalker. Das ist 40 Minuten lang oder"}, {"id": 937, "start": 7314.12, "end": 7320.24, "text": "das gucke ich mir jetzt nicht an. In 24 Minuten? Nein, das gucken wir uns jetzt nicht an. Battlefield"}, {"id": 938, "start": 7320.24, "end": 7338.68, "text": "has a new Contender. Was deine Kleidung über dich verrät? Ah, Lego Stels. Okay, wir schauen"}, {"id": 939, "start": 7338.68, "end": 7365.36, "text": "mal, was uns YouTube empfiehlt. Gleich ist Badget-Time. Kein Wunder, dass das jetzt"}, {"id": 940, "start": 7365.36, "end": 7372.96, "text": "trendet. Ein bisschen Gedanken macht es mir schon. Für mich ist diese ganze Geschichte"}, {"id": 941, "start": 7372.96, "end": 7380.2, "text": "mit Atomkrieg und sonst was, das ist so irgendwas in grauer Vorzeit, so 1980 oder so, so nach"}, {"id": 942, "start": 7380.2, "end": 7383.88, "text": "dem Motto, das haben wir schon lange hinter uns gelassen. Mich macht es insofern ein bisschen"}, {"id": 943, "start": 7383.88, "end": 7388.28, "text": "Gedanken, dass jetzt öffentlich sogar schon im Fernsehen vor der Politik quasi solche"}, {"id": 944, "start": 7388.28, "end": 7393.32, "text": "Wörter in den Mund genommen werden. Also sprich, da ist schon ein bisschen die Kacke"}, {"id": 945, "start": 7393.32, "end": 7398.0, "text": "am Dampfen. Das macht mir schon ein bisschen Gedanken, wenn ich ehrlich bin. Natürlich"}, {"id": 946, "start": 7398.0, "end": 7402.6, "text": "sollten wir alle hoffen, dass nichts auch nur ansatzweise in dieser Richtung passiert,"}, {"id": 947, "start": 7402.6, "end": 7413.2, "text": "weil sonst sind wir einfach alle deadge morgen. Nicht badge, sondern deadge. Truth about web"}, {"id": 948, "start": 7413.2, "end": 7424.16, "text": "designers. Das ist ein Risitas Video. Moment, das muss einfach. Mal gucken, ob das was taugt."}, {"id": 949, "start": 7424.16, "end": 7448.0, "text": "Du hast mir ein richtig gutes Video. Ah, schickt mal euch. Okay, Moment, nein. Okay."}, {"id": 950, "start": 7448.0, "end": 7466.76, "text": "Nein, ich habe es nicht. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay."}, {"id": 951, "start": 7466.76, "end": 7475.02, "text": "Okay. Okay. Okay. Okay. Okay. Okay. Ah, ja."}, {"id": 952, "start": 7475.02, "end": 7483.22, "text": "Nein! laughs"}, {"id": 953, "start": 7483.22, "end": 7483.66, "text": "Nein!"}, {"id": 954, "start": 7483.66, "end": 7484.46, "text": "Ja!"}, {"id": 955, "start": 7484.46, "end": 7483.42, "text": "你就 iba a cosas oven"}, {"id": 956, "start": 7483.42, "end": 7487.62, "text": "Tu"}, {"id": 957, "start": 7487.62, "end": 7487.7, "text": "Fajas"}, {"id": 958, "start": 7487.7, "end": 7495.4, "text": "Me"}, {"id": 959, "start": 7495.44, "end": 7498.36, "text": "chagrin"}, {"id": 960, "start": 7498.36, "end": 7500.36, "text": "Der Chat ist voll im Text"}, {"id": 961, "start": 7500.36, "end": 7528.36, "text": "Sekunde"}, {"id": 962, "start": 7528.36, "end": 7540.36, "text": "Ah ja ich hab jetzt auch noch rays"}, {"id": 963, "start": 7558.36, "end": 7560.48, "text": "Und nach einer Sitzung..."}, {"id": 964, "start": 7563.52, "end": 7565.6, "text": "Mein"}, {"id": 965, "start": 7567.54, "end": 7566.0, "text": "ich kann ja nicht die"}, {"id": 966, "start": 7566.0, "end": 7571.48, "text": "Wurde sich"}, {"id": 967, "start": 7571.48, "end": 7573.7, "text": "ich arcade"}, {"id": 968, "start": 7573.7, "end": 7578.34, "text": "ja"}, {"id": 969, "start": 7578.64, "end": 7585.2, "text": "in"}, {"id": 970, "start": 7585.1, "end": 7588.0, "text": "der"}, {"id": 971, "start": 7588.0, "end": 7593.76, "text": "Ja okay"}, {"id": 972, "start": 7604.8, "end": 7608.24, "text": "Da habe ich schon Da habe ich Jetzt Aber schon Deutlich Bessere Gesehen"}, {"id": 973, "start": 7609.52, "end": 7611.52, "text": "Chat Wieder Einplenden"}, {"id": 974, "start": 7611.52, "end": 7621.52, "text": "Chat Ist Wieder Da"}, {"id": 975, "start": 7622.24, "end": 7630.4, "text": "Das Haben wir uns schon angeguckt am sonntag den senior java script developer Den Haben wir uns schon angeguckt am sonntag das war nicht schlecht"}, {"id": 976, "start": 7630.4, "end": 7645.2, "text": "Gibt den artikel dazu css als back-end zu verwenden das war auch ganz interessant was css und back-end"}, {"id": 977, "start": 7645.2, "end": 7662.0, "text": "Das sind Zwei sachen die passen nicht zusammen"}, {"id": 978, "start": 7662.0, "end": 7686.8, "text": "Das juckt mich überhaupt nicht was da abgeht"}, {"id": 979, "start": 7686.8, "end": 7704.8, "text": "Was ist denn css das ist das das dafür sorgt dass zum Beispiel der hintergrund dieses buttons rot ist"}, {"id": 980, "start": 7704.8, "end": 7720.8, "text": "Stylings für Websites ist das"}, {"id": 981, "start": 7720.8, "end": 7736.8, "text": "Alter wenn Du Da die hand dazwischen hast ist aber nicht gut das schlägt dir die hand komplett durch"}, {"id": 982, "start": 7736.8, "end": 7752.8, "text": "Die Hand dazwischen ist aber vorbei"}, {"id": 983, "start": 7752.8, "end": 7778.8, "text": "Alter ich würde mich nicht trauen das selbst auszulösen bei mir am arm"}, {"id": 984, "start": 7778.8, "end": 7790.8, "text": "Das gibt es als competitive frisbee Scheibe werfen gibt es als competitive sport"}, {"id": 985, "start": 7790.8, "end": 7810.8, "text": "Echt das gibt es bei Olympia jetzt Chebatet mich der Chainlorder es gibt frisbee golf nein das kann ich mir nicht vorstellen"}, {"id": 986, "start": 7810.8, "end": 7826.8, "text": "Echt das gibt es als competitive sport"}, {"id": 987, "start": 7826.8, "end": 7842.8, "text": "Echt das gibt es als competitive sport"}, {"id": 988, "start": 7842.8, "end": 7858.8, "text": "Echt das gibt es als competitive sport"}, {"id": 989, "start": 7858.8, "end": 7884.8, "text": "Echt das gibt es als competitive sport"}, {"id": 990, "start": 7884.8, "end": 7904.8, "text": "Echt das gibt es als competitive sport"}, {"id": 991, "start": 7904.8, "end": 7932.8, "text": "Echt das gibt es als competitive sport"}, {"id": 992, "start": 7932.8, "end": 7952.8, "text": "Echt das gibt es als competitive sport"}, {"id": 993, "start": 7952.8, "end": 7968.8, "text": "Echt das gibt es als competitive sport"}, {"id": 994, "start": 7968.8, "end": 7984.8, "text": "Echt das gibt es als competitive sport"}, {"id": 995, "start": 7984.8, "end": 8010.8, "text": "Echt das gibt es als competitive sport"}, {"id": 996, "start": 8010.8, "end": 8036.8, "text": "Echt das gibt es als competitive sport"}, {"id": 997, "start": 8036.8, "end": 8056.8, "text": "Echt das gibt es als competitive sport"}, {"id": 998, "start": 8056.8, "end": 8076.8, "text": "Echt das gibt es als competitive sport"}, {"id": 999, "start": 8076.8, "end": 8104.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1000, "start": 8104.8, "end": 8124.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1001, "start": 8124.8, "end": 8138.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1002, "start": 8138.8, "end": 8158.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1003, "start": 8158.8, "end": 8174.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1004, "start": 8174.8, "end": 8200.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1005, "start": 8200.8, "end": 8220.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1006, "start": 8220.8, "end": 8240.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1007, "start": 8240.8, "end": 8256.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1008, "start": 8256.8, "end": 8284.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1009, "start": 8284.8, "end": 8304.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1010, "start": 8304.8, "end": 8324.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1011, "start": 8324.8, "end": 8340.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1012, "start": 8340.8, "end": 8366.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1013, "start": 8366.8, "end": 8386.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1014, "start": 8386.8, "end": 8402.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1015, "start": 8402.8, "end": 8414.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1016, "start": 8414.8, "end": 8430.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1017, "start": 8430.8, "end": 8444.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1018, "start": 8444.8, "end": 8472.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1019, "start": 8472.8, "end": 8492.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1020, "start": 8492.8, "end": 8512.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1021, "start": 8512.8, "end": 8528.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1022, "start": 8528.8, "end": 8544.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1023, "start": 8544.8, "end": 8564.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1024, "start": 8564.8, "end": 8584.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1025, "start": 8584.8, "end": 8600.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1026, "start": 8600.8, "end": 8616.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1027, "start": 8616.8, "end": 8642.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1028, "start": 8642.8, "end": 8662.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1029, "start": 8662.8, "end": 8682.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1030, "start": 8682.8, "end": 8702.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1031, "start": 8702.8, "end": 8722.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1032, "start": 8722.8, "end": 8742.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1033, "start": 8742.8, "end": 8762.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1034, "start": 8762.8, "end": 8782.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1035, "start": 8782.8, "end": 8802.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1036, "start": 8802.8, "end": 8822.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1037, "start": 8822.8, "end": 8842.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1038, "start": 8842.8, "end": 8862.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1039, "start": 8862.8, "end": 8882.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1040, "start": 8882.8, "end": 8902.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1041, "start": 8902.8, "end": 8922.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1042, "start": 8922.8, "end": 8942.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1043, "start": 8942.8, "end": 8962.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1044, "start": 8962.8, "end": 8982.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1045, "start": 8982.8, "end": 9002.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1046, "start": 9002.8, "end": 9022.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1047, "start": 9022.8, "end": 9042.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1048, "start": 9042.8, "end": 9062.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1049, "start": 9062.8, "end": 9082.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1050, "start": 9082.8, "end": 9102.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1051, "start": 9102.8, "end": 9122.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1052, "start": 9122.8, "end": 9142.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1053, "start": 9142.8, "end": 9162.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1054, "start": 9162.8, "end": 9182.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1055, "start": 9182.8, "end": 9202.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1056, "start": 9202.8, "end": 9222.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1057, "start": 9222.8, "end": 9242.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1058, "start": 9242.8, "end": 9262.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1059, "start": 9262.8, "end": 9282.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1060, "start": 9282.8, "end": 9302.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1061, "start": 9302.8, "end": 9322.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1062, "start": 9322.8, "end": 9342.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1063, "start": 9342.8, "end": 9362.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1064, "start": 9362.8, "end": 9382.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1065, "start": 9382.8, "end": 9402.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1066, "start": 9402.8, "end": 9422.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1067, "start": 9422.8, "end": 9442.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1068, "start": 9442.8, "end": 9462.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1069, "start": 9462.8, "end": 9482.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1070, "start": 9482.8, "end": 9502.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1071, "start": 9502.8, "end": 9522.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1072, "start": 9522.8, "end": 9542.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1073, "start": 9542.8, "end": 9562.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1074, "start": 9562.8, "end": 9582.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1075, "start": 9582.8, "end": 9602.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1076, "start": 9602.8, "end": 9622.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1077, "start": 9622.8, "end": 9642.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1078, "start": 9642.8, "end": 9662.8, "text": "Echt das gibt es als competitive sport"}, {"id": 1079, "start": 9662.8, "end": 9672.8, "text": "Echt das gibt es als competitive sport"}]}