{"text": "Hallo? Hallo? Hallo? Hallo? Hallo? Hallo? Hallo Leute, ich bin auch mal wieder am Start, mal ein Rollo zumachen. Das ihr nicht alle durchs Fenster guckt, während ich am streamen bin. So, ich war gerade noch mal auf dem Klo, ganz wichtige Info, ich weiß. Ja, und was habe ich so verpasst? Gab es irgendwelches Twitch Drama oder so in den letzten Tagen? Ich habe nichts mitgekriegt Leute, ich bin immer noch ein bisschen krank mit meinem Hals. Ich gehe morgen mal zum HNO Arzt, das habe ich mir schon überlegt. Ich werde dann wieder Trick 17 ziehen und ruf an und sage, ich bezahle selbst. Dann geht das immer sehr schnell. Prime Sub, Dankeschön, 08max07. Aber ich glaube, ich höre mich an wie immer. Naja, mir tut immer noch ein bisschen was, wobei mir tut nicht der Hals weh. Es ist vielleicht irgendwie entzündet oder so, keine Ahnung, ich musste echt mal langsam was machen. Habt es jetzt seit 4 Wochen oder so, irgendwann ist es ja auch mal gut. Eins kann ich euch sagen Leute, was ihr nicht machen dürft ist, wenn ihr irgendwas habt, sei es Halsschmerzen, Kopfschmerzen, was auch immer, ihr dürft nicht dem Internet danach suchen. Ihr habt, ihr habt von Kehlkopfkrebs bis Gehirntumor, ihr habt alles. Das kannst du komplett vergessen, guckt, ich meine natürlich könnt ihr im Internet gucken, es ist immer noch sinnvoll, das mit dem abzugleichen, was dein Arzt sagt oder so. Aber sucht nicht zu sehr rum. Zum Beispiel, wenn ich sage, irgendwie, ich muss mich öfters reuspern und husten und so, das ist alles. Wie gesagt von Lungenkrebs bis Kehlkopf, Tumor ist alles, kann alles sein. Da macht man sich komplett verrückt. Dr. Google sagt Schwanger, ja, außeredischer Parasit, du bist immer kurz vorm abkratzen eigentlich, wenn es nach Google geht. Was ja nicht grundsätzlich falsch ist, muss man sagen, es ist ja schon Symptome, aber wir sind alle zum größten Teil unter 50 und wenn ihr euch mal die Verteilung der Krankheiten anguckt, die meisten gehen erst ab 50 langsam hoch und ab 70 dann richtig hoch. Die Chance, dass man mit unter 40 oder unter 50 super krasses Zeug hat, ist sehr gering. Er ist wie bei der Corona-Impfung, da kannst du im Zweifelsfall auch dran sterben, was aber halt äußerst unwahrscheinlich ist. Moin Leute, so, ich habe nichts vor, ich wollte einfach mal wieder Stream anmachen, dass ich euch hier nicht so lange alleine da sitzen lasse. Ich habe die letzten paar Monate so viele Videos gemacht, um so oft gestreamt und jetzt quasi vier Wochen gar nicht, das kann ja nicht sein. Außerdem finde ich das entspannend, das ist echt was, was sich geändert hat. Ich kann mich noch dran erinnern, die ersten Streams, die ich gemacht habe, fand ich mega anstrengend. Da habe ich ja noch ein bisschen BDO mit Fabian gespielt, ich fand das richtig anstrengend. Die ersten paar Streams, also das erste halbe Jahr oder so, ich dachte mir so, was erzählst du denn und was machst du, da kannst du keine Pause machen beim Reden und da musst du immer irgendwas sagen. Was ja Schwachsinn ist, ich sage ja selbst, selbst wenn ich einfach meinen Kopf ausschalte, rede ich mehr oder weniger den ganzen Stream durchgängig, das war voll anstrengend. Mittlerweile ist es genau das Gegenteil, das Einzige, was mich anstrengend ist, es geht mir ein bisschen auf die Stimme und ein bisschen auf den Hals, wenn ich zu sehr schwätze, aber ansonsten finde ich Streamen tatsächlich echt entspannend. Vor allem, wenn es so ein sinnlost Stream ist wie heute, wo wir nicht großartig was machen, außer uns über ein paar aktuelle Dinge zu unterhalten oder sonst wie. Ja, wo wir gerade beim Thema aktuelle Dinge sind, Leute, ich habe mir ein richtig nice neues Heimautomatisierungsprojekt ausgedacht und zwar, ich habe Rauchmelder in fast jedem Raum. Im Bad habe ich keine Rauchmelder, aber ich habe beispielsweise dem Arbeitszimmer Rauchmelder, Flur Rauchmelder, Schlafzimmer Rauchmelder, Flur unten Rauchmelder, Schlafzimmer unten Rauchmelder, sowas. So und ich habe mir ein cooles neues Projekt ausgedacht, inspiriert, inspiriert durch ein YouTube Video, was ich gesehen habe und zwar habe ich mir jetzt gekauft, also ich habe diese Rauchmelder hier, i650, ganz schön passt und die normalen, die ersten gehen aber schon kaputt, die haben so eine Batterie drin, dass sie 10 Jahre halten, so und die ersten sind aber schon kaputt gegangen, deswegen habe ich mir jetzt die hier bestellt, zum Testen erstmal ein, so ein i650RF, das Gute ist, dass die Halterungen an der Decke passen mit denen. So und was man da bekommt ist, das ist eigentlich eine richtig coole Geschichte, was der Typ in dem YouTube Video gezeigt hat, was man dabei bekommt ist, man bekommt den Rauchmelder, man bekommt ein Funkmodul, weiß ich ob man das hier in diesem Video drin sieht, ist gut, aber super, dass ich das uselessste Video aller Zeiten habe, ja es gibt ein Funkmodul, das klipst man im Endeffekt einfach nur rein in diesen Rauchmelder und dann funkt er auf 868 Mhz und dann habe ich mir das hier dazu gekauft, das ist eigentlich nicht dafür gedacht, da bin ich gleich gleich dabei, ne ne ne das stimmt nicht, das stimmt nicht, also das kann ich so nicht unterschreiben, ich wohne seit 2013 hier in dem Haus und jetzt, jetzt ist letztens erst in meinem Schlafzimmer der erste Melder kaputt gegangen und ich meine ja, 2013 bis Ende 2021, das sind keine wirklich 10 Jahre, aber damit kann ich leben, damit, also mit der Dauer kann ich, kann ich leben, moin Michael 50 Billionen, so zumindest habe ich mir den jetzt gekauft und ein i413, das ist ein Empfänger für diese Rauchmelder, so und von der Idee her ist es jetzt so, eigentlich ist das gedacht, dass man das an eine Alarmanlage bzw. an eine Hausbrandmeldeanlage oder sowas anschließt und Moment, was ich jetzt mache ist folgendes, da drinne ist im Prinzip einfach nur eine ganz normale Platine, an der du an Relays Zeug anschließen kannst, was du willst, das heißt von der Idee her, ich perre, wobei ich kann, ich kann euch mal das Video zeigen, was mich dazu inspiriert hat, Shelley Smoke, das Video hat mich dazu inspiriert, wir gucken es jetzt nicht, wir gucken uns den Aufbau an, by the way macht, für Shelley Sachen macht er wirklich gute Videos, ja, so also das Video hat mich dazu inspiriert, so sieht das von innen aus und von der Idee her ist das super easy anzuschließen, man braucht diesen Shelley gar nicht, ich habe jetzt einen ESP D1 Mini genommen und habe hier einfach verkabelt, ich habe die billige Variante gemacht, ich habe einfach hier alles auf das Ground drauf geschraubt, drei Kabel und gut ist, verkabelt, das Dumme ist nur, also von der Idee her wird es dann so funktionieren, hier gibt es einmal einen Ausgang, wenn Batterie von den Meldern kaputt geht, hier gibt es einen Ausgang, wenn Alarm ausgelöst wird, hier gibt es einen Ausgang, wenn CO2 Alarm ausgelöst wird und hiervon kann man, das sind ganz normale Relays, die kann man abgreifen mit jedem x-beliebigen Controller, mit jedem x-beliebigen GPIO, Raspberry Pi, was auch immer und sich das an seine Heimautomatisierung schicken lassen, soweit, von der Idee, ja, netter Ross, Dankeschön für den huge massive Subscription, so, das Problem ist jetzt nur, übersteuere ich heute ein bisschen, nee oder, muss ich mal mal anhören, Test, Test, Test, bin ich heute am übersteuern Leute, was habe ich eben gesagt, was habe ich eben gesagt, das Problem ist nur, dass bla bla bla bla und so und bla und so, mal kurz anhören, das Problem ist nur, dass bla bla bla bla und so und bla und so, ich höre mich an wie immer oder, ist eigentlich kein Unterschied, der Husten fehlt, ja ey, ich habe gerade ein bisschen Salz, nicht Salz, Salz, wie heißt das, Lösung, inhaliert, danach ist es immer besser, ich sag euch mal, mein Hals ist mega im Arsch, genau und so habe ich das bei mir auch angeschlossen, das einzige Problem ist nur, das ist kaputt, das Relay ist kaputt bei mir, das Relay, das Relay für Fire ist kaputt, das merke ich daran, weil das Relay für Fehler funktioniert und das Relay für Fire ist im Arsch, ich habe alles abgestöpselt und habe nur hier mein Messgerät dran gemacht und man kann, wenn man das hier überbrückt, kann man den Testalarm auslösen, das Relay schaltet einfach nicht, das hört man hier auch, das klickt ja auch, die Relays hörst ja auch, so und jetzt schicke ich das zurück und viel Neues haben wir funktioniert, so das ist das, das ist nice, da kann ich meine Rauchmelder nämlich endlich mal an mein Smart Home anbinden, dass ich mir auch, wenn es brennt oder so eine Message schicken lassen so weit die Idee, ah ja und der nächste ganz gute Nebeneffekt ist, dass die Rauchmelder miteinander gekoppelt sind, das heißt, wenn einer unten im Flur angeht, höre ich dann oben auch bei mir klingeln, ja die sind untereinander verbunden, das ist jetzt auch nicht der Fall, weil ich ja die ohne Funk habe, also das ist insgesamt eigentlich schon ganz nice, oder um nicht zu sagen, um nicht zu sagen, wenn es dann funktioniert, so viel die Idee, was ist das hier, die haben aber nicht so gute Bewertungen, außerdem passen die nicht in meine Deckenhalterung, die ich jetzt aktuell habe, nicht zu empfehlen Serienstreuern, exzellent, naja wie dem auch sei, ja das bastle ich gerade nebenbei, um mich ein bisschen vor meinem Hals abzulenken, tja ansonsten, ich überlege gerade, habe ich irgendwie spannende, ach ja wisst ihr was ich gesehen habe, guckt mal hier, hat einer auf Discord gepostet, hast du einen Tipp, wo man MikroTik-Router kaufen kann, es gibt viele Versionen, welche reicht für den privaten Haushalt, wo du die kaufen kannst, bei Amazon zum Beispiel, oder bei Park Geizhals, oder ist die Frage, welchen du kaufen willst, oder welchen du kaufen sollst, weil welchen, das kann ich dir nicht sagen, da musst du ja halt sagen, was du haben willst, das ist sonst ein bisschen schwierig, nicht Salzsäure, Wasser mit Salz, Wasser mit Salz ist vielleicht nicht ganz so schlimm wie Salzsäure, ja welcher würde reichen, was willst du machen, ich meine das ist sehr schwierig zu beantworten, willst du 10 Gigabit, willst du kein 10 Gigabit, willst du 2,5 Gigabit, willst du deinen DSL-Moder anschließen oder nicht, was ich nicht machen würde, aber man weiß ja nie, ja das muss man schon wissen, ja übrigens wisst ihr was ich mitbekomme, aber vorhin, weil es jemand auf dem Discord geschrieben hat, in Vue CLI, das ist das bis vor ein paar Wochen bevorzugte Tool um neue Vue.js Anwendungen anzulegen, dort ist eine Abhängigkeit drinne zu diesem Paket, Node IPC und wisst ihr was die Programmierer von Node IPC gemacht haben, die haben mit ihrer Software einen Check eingebaut, ob du eine russische oder eine weißrussische externe IP hast, wenn ja löscht deine Festplatte, was natürlich auf der einen Seite irgendwie als Protestaktion verstanden werden kann, da kann man natürlich von halten was man will, ich meine das ist ihr Projekt, ja wenn die es für richtig halten, egal ob ich das jetzt für gut oder schlecht halte, ich finde es von der Aussagekraft ja vielleicht nicht schlecht, aber es gibt einen Grund warum ich es wirklich schlecht finde ist, dass sowas zerstört das Vertrauen in so Projekte, ganz ehrlich das ist natürlich schlimm und mag vielleicht aus ihrer Sicht auch gerechtfertigt sein, gerade wenn sie da irgendwie persönlich davon betroffen sind, aber wenn ich so ein Projekt dann verwende weiß ich nicht ob morgen nicht was anderes drin ist, also ich weiß nicht, also das finde ich äußerst fragwürdig, achja kennt jemand einen unmanaged access point mit POE, du meinst der sich über POE betreiben lässt, ja irgendeinen TP Link, irgendeinen billig TP Link, guckst du einfach bei Amazon, TP Link, POE, BAM, achso das sind Switche, Access Point, Access Points, POE, gibt es da nichts von TP Link, boah was denn das, sieht aus wie zerklirrendes Kissen, ja sowas in der Richtung, es gibt es doch bestimmt, also ich kenne aber keinen muss ich dazu sagen, boah was das, oh 1KS, was haben wir denn hier für Ausgeburt in der Hölle offen, wann gibt es das 40 Gigabit Upgrade, ähm ich überlege gerade ob es da ein realistisches Zeitfenster für gibt, also ich meine ich habe ja noch nicht mal ordentlich 10 Gigabit, na wobei doch 10 Gigabit habe ich jetzt mittlerweile ordentlich, aber es ist halt aktuell eher so, ich wüsste gar nicht was ich 40 Gigabit irgendwie benutzen sollte, 40 Gigabit kriegst du vielleicht, vielleicht mit einer super geilen PCI Express SSD voll oder so, aber was willst du denn da machen, ich weiß nicht, du hast direkt LWL bis an den Rechner, nö, nö, nö habe ich nicht, ich habe, also LWL ist für die Leute nicht, wir sind Lichtwellenleiter, das ist quasi das, das was umgangssprachlich unter Glasfaser läuft, ähm ne habe ich nicht bis an den Rechner, hätte ich machen können, ich habe, ich habe, ich habe welche hier, auch die passenden Module, aber mein Mainboard hat ein Onboard 10G, AJ45 Stecker und dementsprechend ganz normales Kupferkabel und die Switche und das NAS intern und sowas, das habe ich zum größten Teil über Direct Attached SFP plus Kupferkabel gemacht, ich habe aktuell kein Glasfaserkabel im Einsatz irgendwo, ich hatte den alten Server, den habe ich bei Glasfaser und Modul angeschlossen, aber ich glaube ich habe nur Direct Attached Kabel aktuell und normale Kupferkabel, guck mal die China Chinesen sind am Start bei Simplicissimus, das gucken wir uns heute nicht an, das ist immer so dramatisch, wenn Vira das alles betont. Ich habe mir aus der Arbeit auch zwei, was, was hast du dir aus der Arbeit, 2x10GR45, Module oder was? Bei Kabel geht ja jedes exbeliebige Kabel mit RJ45 Stecker, ach Module, ja das, also wenn die noch welche übrig hätten auf der Arbeit, würde ich auch welche nehmen, weil Module kosten sagen wir mal 50-60€ aufwärts und PC, ach PC Express Karten, wähä, warte mal, das hat ja mit PC Express Karten nichts zu tun, ach du hast, du hast Netzwerkkarten mitgenommen, nicht Module, du hast Netzwerkkarten mitgenommen, ach so, ja, ja, klar, man muss sich mal überlegen, 10 Gigabit ist im Enterprise Umfeld schon eigentlich out, die schmeißen die Hardware davon ja schon weg und da kann man, wenn es erlaubt ist, immer mal was abgreifen. Ja ansonsten, ich überlege gerade, ach ja, ach ja, chat, chat, ich brauche mal eure Hilfe, bald darf Chico auf meine Terrasse, also ich habe ja, also das in dem Haus hier, in dem Haus hier haben wir es ja so, also du hast, Haus, Erdgeschoss, Keller, erster Stock, Dachgeschoss und dann hast du einen Hof mit Stall, Garage und dann hinten, hinten einen Garten, so und sowohl Hoftor als auch Eingang zum Garten sind eigentlich mit einem relativ undurchlässigen und hohen Zaun zu, dass die Katze nicht drüber kann, aber ich traue meiner Katze nicht, deswegen, deswegen habe ich mir gedacht, Chico ist nämlich, ich muss mal wissen, Chico ist eine reine Hauskatze, war sie bisher immer, war sie bisher immer und ist sie bei mir bis jetzt, wie gesagt ich habe die ja erst seit 3 Jahren oder so, vorher war die ja woanders, wurde ja im Tierheim abgegeben, ich habe mir jetzt überlegt, diesen Sommer darf sie raus und da will ich ein Netz an die Seite von der Terrasse machen, also Terrasse ist im Endeffekt Eingangstür, dann kommt man auf die Terrasse, dann geht es runter in den Hof und dann kann man hinten in den Garten oder in den Garage oder in den Stall oder so, so und ich habe mir jetzt was bestellt und zwar gibt es bei denen so Netze, nicht Netzgarn, Netze, extreme Netze, es gibt zumindest Netze für Terrassen und Balkons und sowas und ich bin zu dumm, guckt mal vielleicht hat da irgendjemand Ahnung von, ich habe mir so einen Seil bestellt, also die Idee ist, ich mache zwischen der Wand vom Stall und zwischen meiner Hauswand so einen Stahlseil und da drüber mache ich dann die, mache ich das Netz und das Netz unten beschwer ich halt mit Steinen und das kann ich dann auch zur Seite schieben, dass man die Treppe hoch und runter kann oder ich ziehe es dann wieder hinter, wenn die Katz rausgeht, was auch immer, hat jemand eine Ahnung, wie man sowas hier verwendet, ihr sagt jetzt Max, das ist ein Stahlseil, da kann man nicht viel falsch machen, aber ich habe da ein Problem, dieses Seil hat nur auf der einen Seite eine Schlaufe, auf der anderen Seite nicht, wie kriege ich denn auf die andere Seite eine Schlaufe, guck mal das hat nur hier so eine Schlaufe und auf der anderen Seite ist es einfach ein Stück Draht, hat irgendjemand sowas schonmal gemacht, wie kriege ich auch eine Schlaufe, ich brauche ja, ich habe hier links einen Haken und rechts einen Haken an der Wand, wie mache ich da eine Schlaufe, wie geht das, was mit dem kleinen Teil auf der rechten Seite, das da, wie kriege ich denn damit, ach muss ich da das Kabel so rein falten oder wie, wie nennt sich sowas denn, es geht gerade nichts, es geht sinnlos Streamsorn bis ich Bett gehen muss und ich versuche gerade rauszufinden, wie ich das Ding montieren kann, du machst einen Knoten, das glaube ich nicht, da war es als letzter Schluss, weiß jemand, wie man das nennt, ich habe mal nach Stahlnetz, Längeneinstellung oder sowas geguckt, da habe ich nichts gefunden, mit dem kleinen Teil, das ist ein Stahlseil, eine Schlaufe machen und damit festschrauben, auf der anderen Seite bestimmt eine Mutter, aha, also ok, das heißt, ich ziehe die andere Ende von dem Stahlseil hier durch, je nach dem, wie viel Seil ich, also was weiß ich, wenn das Seil länger ist, als das was ich brauche, dann schleife ich das quasi weiter durch, sodass das Seil ein bisschen kürzer wird, mache dann am Ende eine Schlaufe rein und dann mache ich auf einem, wenn ich das richtig verstanden habe, dann mache ich auf einem der beiden Seiten, hänge ich das, also das hänge ich in den Haken, das hänge ich in das Seil und damit spanne ich das dann an oder, ich habe sowas noch nie gemacht, ja, ja das mache ich, das mache ich, da habe ich schon dran gedacht, auf der einen Seite ist es kein Problem, da ist nämlich ein Zaun, da kann ich das durchziehen, auf der Seite vom Haus muss ich gucken, da werde ich wahrscheinlich ein paar kleine Haken noch an jemanden machen, so ähnlich wie das hier, ach so funktioniert das, Fifehead, also mal abgesehen davon, von diesem Metall, das ist da nicht drin, ich mache das da rein, so und dann kann ich das hier beliebig lang durchziehen oder und dann mache ich damit kürzer, ah, guck mal der Chat, der Chat weiß wieder, Chat ist einfach massiv, wahnsinnig, ultra high IQ, FliBi, danke für den Sub, MrHarmank, danke für den Sub, 8 Monate Alper Subscription, nice und den Rest vom Seil halt abschneiden, ob ich da mit meinem großen Knibex Seitenschneider durchkomme, eher nicht oder, locker, Leute das ist ziemlich dick, das ist 3mm Stahlseil, da komme ich nicht mit dem Seitenschneider durch oder, das glaube ich nett, also ich rede, ich rede, so ein Ding hier, ne ne ne größerer, größerer ist das, größerer, sowas da, so ein großer ist das, echt, echt, ok, ach guck mal da ist ja sogar ein Bild davon, alter ich bin manchmal pepega, guck mal die haben auf ihrer Seite sogar ein Bild davon, wie man das macht, hätte ich mir das mal angeguckt, dann wäre ich jetzt schlauer gewesen, heute hat auch auf der Arbeit einer geschrieben, Max du musst endlich mal meine Mail lesen, ich habe ihn 5 mal angeschrieben so nach dem Motto, Passwort geht nicht, welcher Username muss ich nehmen, was muss ich dahinter für eine Domain schreiben, jetzt geht das mit dem Popup nicht, aber Max guck doch mal in meine Mails, habe ich alles in der Mail geschrieben, ich habe den irgendwie 10 mal gefragt, dabei hat er es im Vorfeld, aber ich lese prinzipiell eigentlich keine Mails mehr, Mails lesen ist overrated, jebaited, outdated, wer liest da, seriously Leute, lest ihr auf der Arbeit noch regelmäßig Mails, wer liest noch regelmäßig Mails, also ich habe es mittlerweile so auf der Arbeit, dass ich einen Ordner habe, Mails die an mich gehen, die kommen in eigenen Ordner, alles andere bleibt in der Inbox und selbst der Ordner an mich, den lese ich kaum, also Mail geschrieben habe ich glaube ich schon seit einem Monat nicht mehr oder so, ich schreibe äußerst wenig Mails und lese auch ungern Mails, gerade in der aktuellen Zeit, wo alles über Teams geht, ok aber Dankeschön Chat, ihr seid wie erwartet exquisite 5HRQ, ohne euch wüsste ich nicht wie ich der Katze morgen auf der Terrasse ihr Netz montieren soll, exellent, gut, da wissen wir ja Bescheid, macht aber einen Unterschied ob man inhouse unterwegs ist oder als Dienstleister, Leute Leute wisst ihr was, ASMR Stream, ich muss jetzt mal ein bisschen leiser reden und mal ein bisschen beruhigter reden und ich merke mir tut schon wieder der Hals weh, ich schrei immer übelst rum wenn ich am Streamen bin, warum eigentlich, so huge excited, was, Anketten, nein ich habe doch gesagt das ist für ein Netz, das die auf die Terrasse kann, ohne über den Zaun zu springen und vom Auto überfahren zu werden, da kommt ein Netz drüber und dann kann die Katze in, in, in Hof quasi bzw. auf die Terrasse, ja das ist auch sinnvoll, was, was jebaitet uns denn, ey play cancel das ist mir sowas von egal, das juckt mich überhaupt nicht, übrigens doch eine Sache, wisst ihr was für ein get emoji, was für ein wegweisendes emoji seit dem letzten iOS Update verfügbar ist, es gibt jetzt endlich ein emote für fette Männer, pepo fett, es gibt jetzt endlich einen fetten Kerl, also endlich haben die auch mal einen, ich wüsste noch was ich suchen muss hier, ah hier, pepo fett, ich muss ja sagen, der Apple emote sieht irgendwie verstörend aus und ich bin mir nicht sicher, ob das wirklich ein schwangerer Mann sein sollte oder ob die es ursprünglich nicht fetter Mann nennen wollten und sich gedacht haben, fetter Mann triggert schon wieder 30.000 Leute und deswegen wird es schwanger, wobei es halt irgendwie wenig Sinn ergibt, dass es einen schwangeren Mann im emote gibt, also fetter Mann ja, aber schwangerer Mann, ich mein in der heutigen Zeit ist ja vieles möglich und nur weil du heute ein Kerl bist, musst du morgen nicht ein Kerl sein, aber es gibt so ein paar Sachen, die gehen halt nicht, also egal wie sehr ich Frau sein will, wächst mir keine Gebärmutter, das funktioniert halt einfach nicht, der hier ist auch nicht, sondern nicht glücklich darüber, deswegen glaube ich, das sollte ursprünglich eigentlich ein dicker Mann emote werden und dachten sich, dass werden zu viele Leute getriggert und jetzt gibt es dicker Mann, die sollten eher Bracken durch Typical austauschen, ja das könnte man auch machen, Typical äh äh Typical ähm nicht Mann, sondern äh irgendwie Hacker Mann, Typical Hacker Hacker Mann, es gibt ja auch immer noch kein gescheites Hacker Emote, auch Pregnant Person gibt es, na gut, dass es Pregnant Woman gibt, das ist mir klar, warum gibt es Pregnant Person, das ist für Schwangere, die sich nicht als weiblich identifizieren oder wie ist das, was auch immer, ok es gibt Dinge, die muss ich nicht ganz nachvollziehen, stört ja im Endeffekt keinen, dass es die Emotes gibt, aber das finde ich gut, dass es endlich Pepofat Emote gibt und das gibt es seit iOS 15.4 und ich glaube 15.4 ist gestern rausgekommen oder, ja sorry, vor gestern, am Montag, seit dem letzten iOS Update gibt es das, wisst ihr eigentlich, was es für ein Ultra Wildwuchs ist bei Emojis, bei Color Emojis, das muss ich jetzt einfach mal ganz kurz erzählen, weil sich da keiner drüber Gedanken macht, aber das ein unglaublich komplexes und bescheuertes Thema mal wieder ist, also diese Emotes, dass die so aussehen, wie die aussehen, ist euch ja bestimmt auch schon mal aufgefallen, dass zum Beispiel das normale Emote, dass das überall anders aussieht, so und warum ist das so, weil die unterschiedliche Emoji Schriftarten haben oder unterschiedliche Emoji Schriftarten, das ist aber noch nicht der Abfuck, weil der eigentliche Code, also das Encoding, CodePoint nennt sich das bei Unicode, ist ja bei allem die gleichen, also sprich, wahrgenommen, ich kopiere das jetzt, wenn ich das jetzt hier rein mache, sieht das für Windows aus, wenn ich jetzt Steuerung C auf Twitter drücke, sieht das nach Twitter-Emote aus, wie auch immer, aber der richtige Abfuck kommt bei den Emoji-Fonds, irgendwie müssen ja dann diese CodePoints, also das, was ich hier copypasten kann, ich copypaste ja nicht das Emoji, ich copypaste ja quasi das encodete Zeichen, was dann mein Font-Renderer zu einem Colored Emoji macht, so das ist ja im Unicode-Standard definiert, wir reden jetzt gar nicht von der Sache, ist es UTF-8, UTF-16, UTF-32, lassen wir mal außen vor, letztendlich definiert ist das irgendwo im Unicode-Standard und was der riesen Abfuck ist, was der riesen Abfuck ist, Emoji-Schriftarten gibt es mindestens, mindestens vier verschiedene Standards, wie man in einer Schriftart Pub-Informationen und Colour Emojis speichern kann, weil, müsst ihr euch mal vorstellen, eine Schriftart ist ja mal ursprünglich für sowas hier erfunden worden, da war noch nichts mit irgendwelchen Emojis, geschweige denn irgendwelchen Colored Sachen und auch Farbabstufung, es gibt mindestens vier verschiedene Standards für Colour Emojis, es gibt einen von Microsoft, einen von Mozilla, einen von Apple und einen von Adobe, wenn ich jetzt nicht ganz falsch bin, und das geht von, wir speichern PNGs, zu wir speichern Vektor-Grafiken, zu wir haben mehrere Ebenen, die Overlaid werden, das ist abgrund tiefer Abfuck Emoji-Schriftarten, deswegen sieht ja das hier zum Beispiel im Firefox auch anders aus und das Firefox-Emoji, ne das ist unter Windows, ach unter Windows verwenden sie mittlerweile den Windows-Renderer hier drinnen, wunderbar, weil die hatten mal eine ganze Zeit was eigenes, Mozilla hat dieses komische Zeug hier, genau, so und das war eine Zeit lang so, dass das Mozilla-Format im Firefox funktioniert hat, aber der Firefox nicht das Windows-Format unterstützt hat und sie ihren eigenen Font-Renderer verwendet haben, denn nur das Mozilla-Format kann nicht das Windows-Format, es ist schlimm, warte mal, Max, dann machst du ein Wiki für Emojis, warum soll ich das machen, gibt's doch schon, so Emoji-Color-Standards, da gibt es Color irgendwas, Font, es gibt SVG in OT, genau, das ist Vektor-Grafiken im normalen Font, dann gibt es noch irgendwas von Adobe und dann gibt es Apple-Color-Emoji-Standard, das ist das was nur Apple kann und sonst keiner, Leute, das ist wieder ein absolutes Minenfeld, das ist einfach, also das ist jetzt ganz, ja ich sollte meine Stimme schon, das stimmt, es ist wieder ganz eklig, was da für Auswüchse die letzten Jahre über entstanden sind, wusste ich jetzt einfach mal los, wenn, also ganz ehrlich, es ist wieder grausam, übrigens mal eine Frage an euch, wo wir gerade dabei sind, was ist euer Lieblings-Emoji-Font oder sagt mir mal was euer Lieblings-Platform ist, wie die Emojis aussehen, Apple, ich muss sagen meine Lieblings-Platform ist Twitter, ich mag Twitter am besten, Twitter oder die alten Joy-Pixels, die alten Joy-Pixels waren auch gut, die neuen Joy-Pixels sind doof, also ich mag tatsächlich den Twitter-Style mit Abstand am liebsten, den verwende ich nämlich auch unter Linux, da gibt es extra 3-Emoji-Font, also ich mag, was ist denn das, Monac-S-Emoji, das habe ich ja noch nie gesehen, ist das jetzt auch neu, Moment wir müssen mal kurz checken, was im letzten Unicode Standard alles dabei gekommen ist, Monac-S, Leute, was ist das, nee Monac-S, nicht Monac-S, Monac-S, was soll das überhaupt sein, Melting-Face, Abstand am liebsten, die Emoji-Platform, also ich mag Twitter-Style oder ich mag, also die alten Joy-Pixels waren auch gut, die alten, nicht die neuen, die neuen Joy-Pixels mag ich nicht, die alten, die alten Joy-Pixels waren gut, was ich nicht, die hatten noch bestimmt, haben die nicht noch eine alte Version drinnen, Joy-Pixels, die alten Joy-Pixels waren gut, die neuen, die, die neuen, weiß nicht, konnte man hier nicht mal mehrere Emoji-Versionen, ah hier, genau, die alten Joy-Pixels fand ich ganz gut, die neuen sind nicht so meins, wie gesagt, Twitter, Twitter gefällt mir am besten, was gibt's denn, zeigt mal her, Emoji-Version 14, was kam denn da, ups, ups, ups, ups, was kam denn da neues, vielleicht sehen wir uns den Apple-Style an, changed, was, das wurde changed, warum, appearance of face with hand over mouth to mehr consistent, wie sah das vorher aus bei Apple, ah, ok, ich muss sagen, das neue ist besser, also was ist da zugekommen, new added, new, ok, melting face, links, was ist das denn, ok, Commodores-Emoji sind am Start, Leute, gibt's jetzt saluting face, dotted line face, wozu braucht man denn sowas, face holding back tears, ok, dann gibt es Hand nach rechts, Hand nach unten, index finger and thumb crossed, ja gut, das ist bestimmt so ne Geste, die gibt es auf der ganzen Welt und heißt was anderes, was heißt das bei euch, wenn man Daumen und Zeigefinger reibt, bei mir heißt das Geld, für mich heißt es Kohle, Geld, das ist K-Pop-Scheiß, warum ist das K-Pop-Scheiß, machen die da auch sowas, das One Direction oder, ne, nicht One Direction, das ist ja kein K-Pop, One Direction sind ja die Engländer glaube ich, ne, ok, dann gibt es hier Uncle Sam oder was auch immer das sein soll, index pointing and view, ach guck mal, das ist, das ist ein Herz, Hand shaking, Lippo beißen, ok, Krone, dann gibt's den fetten Mann oder offiziell der schwangere Mann, wisst ihr, Leute, ich hatte letztens, ist das Shrek, ist das Shrek Emote, ne, toll, ich hatte ja letztens eine Idee, was endlich mal eingef, nachdem ich dieses Emote gesehen hab, dachte ich mir, es wird doch Zeit, guck mal Leute, wir haben jetzt Gender Modifier im Unicode, wir haben Color, Skin Color Modifier im Unicode Standard drin, warum gibt es keine Body Shape Modifier, warum kann ich nicht sagen, warum kann ich nicht sagen, man, people, wo ist das denn, ja, man, ach ne, man, man, warum kann ich nicht sagen, warum kann ich nicht sagen, man, man shrugging und dann ein Body Shape Modifier dahinter, dass es Pet Man Shrugging ist, also, guck mal, wenn wir so viele Sachen, wenn wir so viele Sachen schon mittlerweile im Unicode drin haben, warum gibt es keine Body Shape Modifier, ich mein, ich kann verstehen, dass das ziemlich schwierig ist, designtechnisch umzusetzen, aber wenn wir doch jetzt schon, wir haben Gender Modifier und wir haben Hauttonen Modifier, also man hat fast, fast alles, um irgendwie alles in alles umzuwandeln, warum kein Body Shape Modifier, dann könnte ich dann zum Beispiel könnte ich das Emote nehmen, plus, plus den, das ist ja schon, das ist Person Shrugging, plus Joiner, plus Male Sign, plus Skin Tone Modifier, kann ich noch machen, dann ist es dann keine Ahnung, White Man Shrugging und dann noch Joiner Fat, Fat Body Size Modifier und dann BÄM und dann hättest du dann Fat White Male Shrugging da draus gemacht, das ist das, was die Welt braucht und dann, ey, kannst du alles machen, könntest du alles machen, ne, Bärte, jawoll, es sind keine Grenzen gesetzt, na Hautfarbe, Bartfarbe ist relativ einfach, Bartfarbe könntest du mit Bart plus einem Farb Modifier machen, dann könntest du nämlich einfach die Skin Tone Modifiers nehmen, ich mein, da kannst du zwar keine roten Bart haben, aber, was auch immer, die haben doch sogar Color Modifier, gibt es doch auch, oder, naja, wie dem auch sei, so viel zum Thema Emojis, Haarfarbe bin ich mir gar nicht sicher, kann sein, ja, mit der Musik los, warum lachen da Leute im Hintergrund, da wird nicht gelacht, warum geht los, lachen sie einfach im Hintergrund, Mensch, ja, das bräuchte man als E-Mode, exakt, die Designer, die Designer drehen durch, nächstes Stream Projekt, sowas kann, das bringt mir im Stream Projekt nix, das muss, das muss auf den Endgeräten unterstützt werden, meine, ketzerische Frage, kann, kann Emacs mittlerweile Emojis, das muss ich jetzt mal nachgucken, Emacs ist ein Text Editor, muss man nicht kennen, ich weiß nur, dass das immer ein, ein richtiger Klaubens, Klaubenskrieg fast war, ob Emacs Emojis bekommen soll oder nicht, ne, immer nur noch diesen Fake, das funktioniert nicht, das ist, das ist Fake, der, der macht aus Zeichen Bilder, das funktioniert nicht richtig, what the fuck ist das, funktioniert nicht, es gibt anscheinend immer noch keine, oh, oh, Leute, seit Ende letztem Jahr, Ema hat es aber voll übersteuert, ich habe es direkt hier im Rechthor gehört, oh, ja schaut mal da, Emacs 28 hat Color Emoji Support 5 Jahre oder so, nachdem es relevant geworden ist, nice, gut verwendet überhaupt noch irgendjemand Emacs, ich habe es eine Weile früher verwendet, aber spätestens seit Visual Studio Code quasi JavaScript erweiterbar ist, das ist doch der größte Vorteil von Emacs eigentlich mit dahin, ey ist es ja im Prinzip jetzt schon, du kannst, du hast so viele Kombinationen an Emojis, die Designer müssen, müssen ausflippen, die Designer haben da bestimmt gar keinen Bock mehr drauf, du wirfst ja keinen Schatten, weil du im Dunkeln sitzt die ganze Zeit oder, so Hacker Man im Keller mit Hoodie auf, die müssen es einfach NFT mäßig machen, NFT mäßig machen, du machst einfach 5 Grundtypen und der Rest geht über einen Random Generator oder über so ein Kombinations Ding, easy, John Wayner danke für den Tag, ach Leute ich habe den Subs wieder nicht nachgeguckt, ich war jetzt so am labern was Color Emojis angeht, ich habe wieder die Hälfte übersehen, Creator Dashboard, danke schön für den Sub, John Wayner und Filby, dich habe ich schon gesehen Freund, Paul was, danke für den Subs, ja ansonsten sehr random gewesen jetzt mit den Emojis, gebe ich zu aber ist mir gerade so eingefallen, mir liegt gerade ob ich das andere noch erzählen soll, Paul ist bei mir auf der Arbeit, ich erzähle euch ja ab und zu mal immer so ein, entweder erzähle ich euch einen Schwank aus meiner Jugend oder ich erzähle euch mal ein paar komische Sachen auf der Arbeit, aber diese Woche hatten wir wieder was, da musste ich echt lachen, es wird, ich muss das natürlich immer so ein bisschen on the fly anonymisieren, bei uns überlegen sie gerade von einem Standort, also von einem gemieteten Rechenzentrum zum anderen gemieteten Rechenzentrum ein paar Services umzuziehen, das ist ganz grob der Rahmen und das planen die seit Mitte letzten Jahres, so und Anfang der Woche, jetzt halt euch auf was, Anfang der Woche kam jemand zu uns und meinte so, ja wie sieht es denn mit euren Tätigkeiten für den Standortumzug aus und da haben wir so gesagt, welche Tätigkeiten, das hat keiner irgendwas gesagt und dann meinte der so irgendwie, ja aber bis Ende der Woche sollen doch die ganzen Systeme schon aufgebaut sein und wir haben gesagt, ne da habe ich nichts von gehört und dann meinte der allen Ernstes, ja dann habt ihr jetzt ja noch dreieinhalb Tage Zeit, dreieinhalb Tage für 80 Stinger, alles klar, kein Problem machen wir mal nebenbei, in dreieinhalb Tagen, so und jetzt passt, sorry nicht 80, 40, 40, 40, so das ist an sich kein Ding 40 Systeme aufzubauen, das geht, das geht, aber der Hit war ja dann, der Hit war ja dann, haben wir gesagt, ja gut, wenn das so ist, dann soll erstmal hier unser Chef sagen, dass wir andere Sachen liegen lassen, liegen lassen sollen und dann nur noch das aufbauen, so aber jetzt kam der Hit, jetzt kommt so ne typische, ich würd's euch sonst gar nicht erzählen, jetzt kommt so ne typische Business Enterprise Geschichte, so dann hieß das wir sollen anfangen und auf einmal dachte ich mir so, ich hatte irgendwie so die Eingebung, ich hatte irgendwie so die Eingebung, hey fragst du mal, also die haben zu uns gesagt, die haben zu uns gesagt, ja baut das mit höchster Priorität so schnell wie's geht, das ist ein Auftrag von unserem Abteilungsdirektor, also quasi viel höher geht's nicht mehr, so und dann, da hatte ich so die Eingabe und hab mir gedacht, Moment, Moment, die können ja viel erzählen, wenn der Tag lang ist, achso und es wäre auch schon alles genehmigt oder sonst was, ich geh mal zu unserem Change Management und frag die, was sie davon halten, dass wir jetzt einfach in Netzen, an Standorten, wo auch teilweise produktive Services laufen, da am Netz rumspielen und neue Kisten hinstellen und so und ich hab gesagt, ja Change Management, das ist ja quasi von unserem Abteilungsdirektor angefragt, ist das aus eurer Sicht okay und dann meint die auf einmal zu mir, nein Max, ihr dürft auf gar keinen Fall anfangen, nicht diese Woche ist Vorstandssitzung, wenn da irgendwas kaputt geht, die drehen alle durch, ihr dürft auf gar keinen Fall was machen, dann hab ich gesagt, ja aber wir haben doch nur dreieinhalb Tage, wir haben noch nur dreieinhalb Tage, das aufzubauen, es ist egal, ihr dürft auf keinen Fall irgendwas machen, bis grünes Licht ist, so und jetzt ratet mal, also das war, Dienstag haben die uns das erzählt und wir hatten damals ja schon nur dreieinhalb Tage, das aufzubauen und jetzt ratet mal, wann wir das okay bekommen haben, dass wir es denn jetzt machen dürfen, also Dienstag, ich sag mal Dienstag 12 Uhr, Dienstag 12 Uhr habe ich gefragt, ob das okay geht und die haben gesagt, sie kümmern sich darum, das okay einzuholen, was meint ihr, wann wir das okay gekriegt haben? Der Freitag ist ja erst morgen, nein, Freitag, das war die Woche, Freitag ist ja erst morgen, ne, wir haben das im Prinzip gar nicht bekommen, wir haben es, es hat einen Tag gedauert, nächsten Tag 14 Uhr und auch nur, weil ich zwischenzeitlich mal gefragt habe, ja Jungs, gibt es was neues und dann meinten die so zu mir, ja ja, ist genehmigt und dann musste ich noch sagen, ja aber ihr sagt doch selbst, mündliche Aussagen sind egal, ich brauche schriftlich quasi einen Change-Antrag, den darf ich für Immersion-Sachen selber doch gar nicht machen, haben sie noch was zusammengeklickt, so zumindest, jetzt kommt der Hit, es war genehmigt, alles gut, wir wollten anfangen und auf einmal gucken wir uns so mal die Netzwerktechnik, die Sache an und stellen fest, ja Moment, die ganzen Switch sind falsch konfiguriert, das ist überhaupt nicht im richtigen WLAN, hat das falsche Netz, die können da keine Server aufbauen, selbst wenn wir Server aufbauen, die funktionieren danach nicht, so und ja, das ist immer noch der aktuelle Stand, also wir haben nicht ein System aufgebaut bisher, also wie gesagt, der Auftrag kam irgendwann hier und wir sollen fertig sein bis da, also im Prinzip, wir können nichts machen aktuell und dann ist irgendeiner der Planungsleuten, der Planungsleute ist dann zu unseren Infrastruktur-Leuten gegangen, hat gesagt, ja jetzt, mach doch mal die Netzwerksachen und Switch richtig und dann meinten die Netzwerkleute, ja also ab 25. können wir uns darum kümmern, das ist so ein geiler Planungsfail immer und ich erzähl euch das, weil ich euch am Ende mal was fragen will jetzt, wir sind doch sicherlich nicht die einzigen, wo solche Planungsfails eigentlich an der Tagesordnung sind oder, das ist doch bei euch auch manchmal so, gibts zu, weil wenn wir echt die einzigen wären, müsste ich mir Gedanken machen, aber ich glaube, das ist eigentlich normal mittlerweile bei vielen, gerade umso größer der Laden und umso Business-Enterpreisiger es wirkt, übrigens noch eine witzige Geschichte von Microsoft, ihr wisst ja der Microsoft Support ist hochgradig useless, wenn man Tickets aufmacht, noch eine Geschichte von Microsoft Support, ich hatte euch ja mal erzählt, dass wir seit einer ganzen Weile gezwungen werden und gezwungen ist der richtige Satz, weil es möchte von uns keiner, auf allen Systemen inklusive allen Linux-Systemen Windows Defender zu installieren, das ist kein Witz, das ist kein Witz, wir werden gezwungen Windows Defender zu installieren, wie wird das enforced, naja gut, es gibt eine Security-Richtlinie, dass das gemacht werden muss, so und jetzt ist, ich muss das immer ein bisschen anonymisieren und jetzt ist vor 1-2 Tagen sind Sachen gecrashed, weil jetzt haltet euch fest, der Windows Defender den kompletten Ram belegt hat und das sind fette Kisten Leute, das sind richtig fette Kisten, also die Kisten, die wir noch haben im Rechenzentrum, die noch nicht in der Cloud sind, das sind richtig fette Kisten, das geht von, das geht bei 128 GB Ram los, das geht rauf bis 2 TB Ram und teilweise mehr, das ist richtig heftig und der Windows Defender hat dafür gesorgt, dass ein paar Sachen crashen, weil der Ram voll ist, zumindest daraufhin Ticket gemacht, also nicht ich, sondern ich habe es nur mitbekommen, es wurde ein Ticket gemacht bei Microsoft und Microsoft sagt, nein, können wir euch nicht helfen, weil ihr habt nicht die letzte Windows Defender Version, wisst ihr was wir haben, wir haben die vorletzte Windows Defender Version, also es ist jetzt irgendwie Punkt 60, Punkt 140 oder so Version und wir haben 60, Punkt 139, also die unsere Version ist, was weiß ich, eine Woche allen oder so und Microsoft hat gesagt, bevor ihr euch an uns wenden könnt und Support bekommt, ihr müsst alles upgraden, also ich weiß nicht, also dieser Support, ja eine Woche End of Life, stellt euch das mal vor, das muss man verkaufen irgendwo, eine Woche End of Life, das ist so eine Rolling Version von Microsoft, ist schon echt lächerlich man, übrigens zum Thema Log Files, der Windows Defender, das ist wirklich absolute Kack Software, der loggt auf Systemen, wenn verdächtige Sachen passieren und schickt das dann an irgendeinen Log Storage in Azure und eines Tages ruft mich ein Kollege auf eine Arbeit so an und meint, Max guck mal hier, ich share mal kurz mein Screen, zeigt der mir das so und meint er so, sag mal Max ist das dein Passwort? Ja, das ist mein Passwort, aber es war zum Glück nicht das Passwort von meinem Hauptbenutzer Account, das Ding hat einfach mein Passwort gelockt, mitten im Log stand mein Passwort drin, das muss man sich mal vorstellen, so eine Kack Software man, das ist absolute Hypercrap ist das wirklich, ich glaube ihr wollt keinen Windows Defender haben, da braucht ihr keine russischen Hacker dafür, Microsoft alleine reicht das schon, dann besser Kaspersky, da wird jetzt gewarnt vor Kaspersky, da wird gewarnt, wir können ja mal Tipps abgeben, wie viele Server wir schaffen morgen aufzubauen, ne schaffen wir ja gar nicht, weil die stellen ja erst zum 25. Also ich hab jetzt auf Heise gelesen, ich dachte mir das ist ein Witz, aber Kaspersky sagt übrigens offiziell, sie haben noch nie mit der russischen Regierung zusammen gearbeitet, die Sache ist halt die, das würde jeder sagen, selbst wenn er mit der russischen Regierung zusammen arbeitet, oder meint ihr das sagt jemand groß, wenn du die fragst, also geht bei denen wirklich irgendjemand davon aus, dass wenn du einen russischen Antivirenhersteller fragst, sagt mal, arbeitet ihr mit der russischen Regierung zusammen, dass der dann sagt, ach jetzt wo ihr fragt, ja klar machen wir das, wir haben nicht dran gedacht euch das zu sagen, aber jetzt wo ihr fragt, jetzt natürlich, ganz was mit Schwachsinn, ja hab ich hier bei Heise gelesen, Kaspersky, was ist denn mit Kaspersky, warte mal, ich weiß nicht, was die hier geschrieben haben, Kaspersky, BSI waren von Kaspersky, siehe jetzt Antivirensoftware, ja, Kaspersky hat jahrelang mit dem BSI, die haben wahrscheinlich mit mehr oder weniger jedem zusammengearbeitet, es gab ja auch ein Paper, weiß nicht, ob man das in dem Zusammenhang so nennt, aber ein Dokument von, fragt mich nicht, CIA, FBI, irgend so einem Kekona-3-Buchstaben-Ding, gab es zum Anfang von diesem Konflikt in der Ukraine, gab es, also noch bevor die Russen angegriffen haben, gab es ein Dokument, wo quasi gewarnt wurde vor Angriffen von russischen Hackern und die Sicherheitslücken, die da drin standen, da dachte ich mir auch so, wahrscheinlich hat das weniger was mit russischen Hackern zu tun, sondern die haben einfach ein Best of ihre eigenen Dinger genommen, die sie gerne verwenden, um andere anzugreifen und haben sich wahrscheinlich gedacht, ey, den Scheiß haben wir vor drei Jahren verwendet, das werden die Russen bestimmt auch verwenden, haben das einfach mal in so ein Paper reingehauen, da standen Dinger drinne, Leute, ich muss mal gucken, ob ich das jetzt finde, da standen Dinger drin, ist ja aber auch egal, Outlook-Sachen von 2017 oder irgendwie sowas und Shitrix-Sachen von 2016 und sowas, da hab ich mir auch gedacht, wenn das jetzt noch einer ungepatcht betreibt, dann hat er schon längst Probleme, lange bevor irgendwelche russischen Hacker anrücken. Wie ist eigentlich so euer Eindruck? Ich weiß, wir haben hier sehr viele IT-Interessierte, es wurde ja am Anfang ein Riesenwind gemacht von Panik, also auch öffentlich, vor russischen Cyber-Angriffen, jetzt Ukraine-Krieg oder generell jetzt durch die Russen, da wurde mega Panik geschoben, mal ganz im Ernst, also so wirklich wahnsinnig viel ist jetzt da nicht gewesen, oder? Also das hält sich doch alles stark in Grenzen, also es gibt kaum Meldungen darüber, dass hier irgendwelche Angriffe und wahrscheinlich sind das Angriffe, die sie gegeben hätte, auf irgendwelche deutschen Unternehmen versucht werden bzw. vielleicht sogar erfolgreich sind, es gibt immer mal wieder was, aber ansonsten, also im Vergleich zu dem Panik, also als das losging in der Ukraine, da hast du ja das Gefühl gehabt, die Russen haben irgendwie quasi 50 Millionen Hacker, die nur drauf warten, alles auf der Welt anzulegen, ja, die Russen selber kriegen es ja fast schon fast noch mehr ab als umgedreht, was Computer-Security-Sachen angeht, aber es ist, also entweder sagt einfach keiner was, wenn er betroffen war, aber ansonsten, also es ist null mit dem vergleichbar, wie das am Anfang hochgehyped wurde, wo du gedacht hast, jetzt kommt gleich aus jedem Gulli kommt ein russischer Hacker mit seinem Laptop raus quasi, es ist im Prinzip genauso wie vorher, die meisten Angriffe kamen, also gerade diese meisten random, wir versuchen bei alle Passwörter durch und sowas, die meisten Sachen kamen doch früher auch schon aus Russland oder aus China, ja oder den üblichen Verdächtigen, BPN in den Iran oder so, ging auch gut, aber ansonsten, viel hat sich da auch nicht anders aus, also viel verändert, viel verändert hat sich da nichts, naja, ich hoffe auch, dass dann, ja wie gesagt, ich hoffe auch, dass da nichts mehr großartig kommt, weil sonst wollen die Leute im Zweifelsfall auf der Arbeit noch, dass wir am Wochenende arbeiten müssen oder sowas, weil die russischen Neckarmens unterwegs sind, nee nee, ich glaube es geht los, wieso hast du so viele Tabs offen, Moment, ich habe nicht nur viele Tabs offen, ich habe sehr viele Tabs offen, ich habe zwei Browser auf mit Tabs und wenn ich meine VM starte, dann habe ich dort auch nochmal 40 Tabs offen, oh nee, die VM ist abgekackt, nee, die VM läuft, aber die ist nicht auf dem Browser, was hat das mit dem Lidl Tab auf sich, eine Zigbee Steckdosenleiste, die ich mal ausprobieren wollte, aber nie bestellt habe, genauso wie mit dem Ikea Tab, im Ikea Tab hat irgendjemand letztens gesagt, Ikea hat ja das Gaming Möbel, das war mir so nicht klar, dass Ikea jetzt Gaming Möbel hat, nee nee, ich mag Tabs, man hat genug Tabs, wenn man den Text nicht mehr lesen kann, dann ist es gar nicht gut, eine Stunde spielt kein Stream richtig, ja wie gesagt, ich sage nicht, dass es gar nichts gab, es kommt schon immer mal wieder was, aber es ist jetzt bei weitem nicht das Riesending, was am Anfang herbeigeredet wurde, mein armer Desktop, warum, der Desktop ist doch, das ist halt ein Ordner und in diesem Ordner sind halt ganz viele Sachen drin, mein Ordner hat vom Namen her was ordentliches, aber das heißt ja nicht, dass es in einem Ordner alles ordentlich sein muss, ach jetzt ein bisschen, jawoll, genau, genau der, wusste gar nicht, dass ich den als Emote drinne hab, oder ist das dein Personal Emote, was ist das Thema vom neuen Video, ich hab tatsächlich 5-6 Sachen schon, auch mit Text, ich baue mir Textdokumente, wo ich da reinschreibe, was ich sagen will, aber solange mir der Hals weh tut, habe ich wenig Motivation gerade aufzunehmen, ja hab ich, und ich hab eine richtig lange Liste mit Ideen, ohne dass ich jetzt konkret da schon ein bisschen was zu geschrieben hab, also Videoinhalte und Ideen hab ich tatsächlich genug, ja aber echt so, ok, du meinst das Ding hier von Lidl, ja das hat mir der Chat empfohlen und ich wollte das ja auch mal ausprobieren, weil es immer weniger Steckdosen gibt, die Tasmota flashbar sind, und da ist so eine Zigbee Steckdose was naheliegendes und das wird ja auch dann in Zukunft, wird es das weitergeben, ja, wird es das weitergeben wenn Meta 2030 kommt, ja Meta ist ja unten drunter auch quasi unter anderem Zigbee, Seawave wird ein bisschen Probleme bekommen, Leute ich merke gerade, ich übersteuere ein bisschen, das liegt daran, ich hab hier einen neuen Pop-Schutz, das hört ihr nicht so krass, weil ich das hier limitiert hab, aber man hört es daran, ich hörs bei mir auf dem Ohr, das liegt daran, ich hab einen neuen Pop-Schutz, ich hab mir nämlich aus einem Autoschwamm und einem Kabelbinder einen neuen Pop-Schutz, also Teppichmesser, Schwamm fürs Auto, Kabelbinder, hab ich mir einen Pop-Schutz aus dem Schwamm rausgeschnitten, hab über das Mikrofon drüber gezogen, hab mit dem Kabelbinder zusammen gezogen, das ist besser das Ding hier, besser als der offizielle Pop-Schutz vom Headset Mikro, ich mein es sieht ein bisschen kacke aus, ich hab jetzt ein grau-schwarzes Headset, also ich hab hier so ein Ding, ich hab die erste Ausgabe, first gen hab ich, das da, ich hab so ein grau-schwarzes Headset und ich hab einen gelben Pop-Schutz dran, aber wen interessiert die Optik, was für eine Soundkarte hast du, äh, onboard, ach Moment, du spielst ja so, ne ne, also ich hab ne onboard Soundkarte, aber die hab ich mit, die hab ich per optischem Kabel mit meinem Audiointerface verboten, als Audiointerface hab ich das da, als Audiointerface hab ich das da, so und da gehen auch die Mikros drüber, das reicht aus fürs Headset, ne, für das Headset hab ich noch einen anderen kleinen Mix-Amp, aber es geht alles an das Audiointerface, ich habe eine Vue-Beautify-Web-App, die ich gerne, oh, dann hast du jetzt auch, dann hast du jetzt auch, ähm, die, wann hast du zuletzt, wann hast du zuletzt NPM-Update da drin gemacht oder NPM-Install oder sowas, dann interessiert dich bestimmt das da, die haben nämlich in einer Dependency von Vue CLI, haben die, also das ist, eine Dependency von Vue CLI, ist quasi eine, wie wir das in ein paar Videos sagen, Schadware drinne, die guckt ob du eine russische Public-IP hast oder eine weißrussische Public-IP und dann löscht seine Platte. So, was war jetzt aber die eigentliche Frage, ähm, ich habe eine Vue-Beautify-Web-App, die ich gerne easy auf meinem Windows-Ordner aus surfen, sowas wie Exe im Projektfolger, da kann ich jetzt nicht mit, ach du hast eine Web, du brauchst einfach, du musst einfach quasi deine Index-HTML ausliefern im Endeffekt, äh, wenn, also das kannst du mit jeder x-beliebigen Kiste, die Python drauf installiert hat, machen, da kannst du nämlich einfach sagen, falls du, ne, aber das ist Windows, ne, das ist Windows, dann, dann nicht, äh, du bräuchst jetzt irgendeinen Ad-hoc-Web-Server-Ding, pff, weiß ich nicht, was es da für Windows gibt, gibt sicherlich 30 Millionen NPM-Packages für, also wenn du einen Python-Interpreter hast, ist das ziemlich easy, das ist eine Zeile, das damit zu starten, ach ja, das ist ganz gut hier, die Seite, guck mal, also was ich meine, ist das hier, also wenn du, wenn du einen Python-Interpreter drauf hast, ist das mega simple, dann führst du das aus und der surft einfach alles im aktuellen Verzeichnis, wenn du Sachen wie Websocket-Support brauchst und sowas, dann ist es glaub ich ein bisschen komplizierter, was gibt's denn sonst noch, äh, Ruby, Ruby, im Endeffekt muss das für eine Lion sein, ach so, ja, dann liefer ihm doch irgendwas mit, dann schicke ihm irgendwas, dann brauchst du irgendeine Echse, die du ausführst und alles im aktuellen Verzeichnis surft, da fällt mir aber für Windows nix hin, keine Ahnung, es gibt doch bestimmt irgendeine, ich meine, im Prinzip ist es, ist es eine 3-Zeilen-Dotnet-Anwendung, ja, die man auch als Echse verpacken kann, da gibt's bestimmt was Fertiges für, hat nicht irgendjemand was gepostet, sogar vor eben gerade, irgendwas mit Desktop, ach ne, Convert tut, ne, das ist was anderes, ne, ne, das, das, das willst du ja nicht, du nutzt doch E3 unter Linux, ja, mach ich, Arch, by the way, benutze ich, wobei ich weiß nicht, ob man als Manjaro-Benutzer sagen darf, ich benutze Arch, haben wir noch nicht gesehen, es wird immer schlechter, Alter, es wird immer schlechter, wenn man denkt, es kann nicht mal schlechter werden, dann kommt, dann kommt ein neuer Tag Battlefield 2242, Alter, haha, das war schlecht, guck mal, wisst ihr was auch das witzig ist, Weihnachten, Weihnachten, guck mal, fucking Weihnachten, es, normalerweise gibt es bei Spielen zu Weihnachten immer so Hup, ein, ein, ein Piek, aber hier gibt es zu Weihnachten ein Dip, das schafft auch nur Battlefield, ähm, wo wir gerade dabei sind, was macht denn mein anderes Sorgen-Kind, New World, Alter, unter 30.000 jetzt gefallen, so schlecht, so schlecht, das ist auch so komplette Totgeburt, das Ding, man darf nicht vergessen, es wurde im November released, November release, das Spiel ist kein halbes Jahr alt, also, ja, Origin weiß man die Spielzahlen nicht, ja, du brauchst im Endeffekt irgendeinen Single-File-Web-Server, ne, du willst halt einfach eine Exe anklicken, die einen Web-Server vom aktuellen Verzeichnis startet, da gibt es garantiert was, mir fällt aber für Windows nichts ein, ansonsten, wie gesagt, irgendeine ex-beliebische Dornett-Anwendung, fünf Zeilen, dann als Exe verpackt, wer ist das andere Amazon, Lost Ark, ja gut, Lost, ne, Lost Ark ist ja nicht von Amazon, Lost Ark ist ja nur von Amazon hier vertrieben, Lost Ark, dem geht's, glaub ich, ganz gut, hat natürlich auch Einbrüche, was aber ja noch relativ normal ist, oh, ich weiß nicht, wie das mit dem Endgame aussieht in Lost Ark, muss ich sagen, spielt jemand von euch Lost Ark, also ist das ein MMO, was man theoretisch auch zwei, drei Jahre spielen könnte und trotzdem was zu tun hat, dass das bei 1,3 Millionen jetzt innerhalb von einem Monat bei einem MMO viele wegrennen ist, ja, ist jetzt nichts ungewöhnliches, wobei, ich mein, ein Drittel, also quasi, die haben ja auch schon, wenn du so willst, zwei Drittel der Spieler verloren jetzt, das ist natürlich schon heftig, aber gerade bei MMOs, aber Halo Infinite läuft auch nicht so gut, Halo läuft auch nicht mal so gut, aber hier, das ist auch ziemlich am abkacken, also es ist im Prinzip alles am abkacken, so von den, von manchen Hoffnungsträgern des letzten Jahres, aber ich weiß, ich weiß, das sagt EA, ich kenne diese Geschichte mit, Halo war so polish, deswegen haben die Leute lieber Halo gespielt als Battlefield, was eine bescheuerte Ausrede, Alter, wirklich, das ist richtig hängen geblieben. Wollen wir mal gucken, was Cyberpunk hat? Es gibt Spiele, die will ich gar nicht anklicken, das Cyberpunk Sex Simulator, man sollte nicht so sehr nach Sachen suchen, Hentai Cyberpunk, das beste Spiel ist immer noch, was mich höchst verstört hat, über den Titel, das beste Spiel ist immer noch, der Chair Fucking Simulator, das ist so gestört, Alter, was es alles gibt, das ist kein Witz, das ist ein offizielles Game of Steam, der Chair Fucking Simulator, da werden die Chairs gefuckt, es gab sogar ein Update für den Chair Fucking Simulator, so sieht das Gameplay dann aus am Ende, wollen wir mal gucken, ob das auf Twitch schon mal irgendjemand gespielt hat, Chair, ne, es hat noch niemand den Chair Fucking Simulator gespielt auf Twitch, mega Toss, da passiert ja nichts, es sind Stühle, aber was sich alles gibt, so, was wollte ich, genau Cyberpunk wollte jemand, dass ich gucke, naja, guck mal, es spielen mehr Leute Cyberpunk, also es spielen mehr Leute Cyberpunk als Battlefield 2047 auf Steam, nicht schlecht, was, es gab einen großen Patch, okay, naja, ja, ja klar, bei den ganzen Stats kommen auch die GOG Leute drauf, es ist ja auch kein, bei Battlefield ist ja auch kein Origin drin, also du kannst von ausgehen, dass die echten Spieler zahlen, naja, ich glaube eine Null dran hängen können wir nicht, aber nimm es mal, mal 3 oder so auf dem PC, vielleicht, vielleicht, ja, so sind wir so bei 7000 ungefähr, was halt immer noch lächerlich ist, die Leute finden doch jetzt schon keine Server mehr, ohne Bots und Portal ist eh komplett dead, übrigens Leute, wisst ihr, ähm, Moment, wisst ihr woran man merkt, dass immer mehr Gamer mittlerweile im Berufsalltag bzw. in normalen Positionen angekommen sind, es hat jemand gepostet letztens in einem Teams Channel, also nicht in einem Chat, sondern Teams Channel, hat gemeint hier, System XY wird jetzt abgeschaltet, so und ich hab dann dieses Bild hier gepostet, Sekunde, Copy Image, ich hab dann dieses, hallo, ich möchte, ich will was kopieren, ja, ich will was kopieren, kann halt so schwierig sein, genau, ich hab dann dieses Image gepostet in den Chat und hat Instant gleich Emotes Reactions bekommen, also sprich wir haben Leute auf der Arbeit, die dieses Bild verstehen, wenn es darum geht, es wird was abgeschaltet, das stimmt mich ja schon durchaus zuversichtlich, ja, tatsächlich, ja, das ist kein Bleeding Edge Meme 2022, das ist schon so alt, das kann jeder schon mal mitbekommen haben, aber dass die Leute es verstanden haben, das fand ich schon mal gut, da kommt Press F her, ja, wobei Press F, der Original ist ja Press X, der allererste Screenshot, der so die Runde gemacht hat, ist von der Xbox gewesen, Press X, aber das mit Press F to pay respects hat sich da irgendwie mehr durchgesetzt, erstmal Keque, ich hab schon mal Poggers bei irgendeine Abstimmung reingehauen, wir hatten mal eine Abstimmung, ich kenne das, wenn Leute Präsentationen halten, dass die manchmal versuchen besonders interaktiv zu sein und zwischenzeitlich dann so, ja, wir haben jetzt mal eine Umfrage gemacht, geht mal alle mit eurem Handy da drauf und wählt was aus, so was machen und da hat mal einer bei uns die Umfrage, da ging es um irgendwie Microsoft Azure oder sonst was, da hat einer die Umfrage gestartet, so nach dem Motto, ja, was sind ihre Meinungen zur Cloud, da hab ich halt einfach mal instant Poggers reingeschrieben, nicht wirklich, weil es in dem Fall besonders Poggers ist, sondern einfach nur weil ich mal Poggers in einer offiziellen Umfrage auf der Arbeit sehen wollte in irgendeinem Chat und es ist, er hat es sogar vorgelesen, hat gemeint, aha aha, Poggers, ich bin mir nicht sicher, ob er wusste, was es bedeutet, aber er hat es ausgesprochen, er hat es vorgelesen, aha aha, Poggers, ich sehe hier Poggers, er hat vorhin gesagt, ich sehe hier Poggers und da habe ich gedacht, gut, hat sich ja schon gelohnt, ich glaube, er wusste nicht, was es bedeutet, das fand ich halt witzig in der Präsentation, aha, ich sehe hier Poggers, Stonks, ja, oh man, ja gut, also ich muss glaube ich echt mal irgendwann Tabs zumachen, weil es ist so unübersichtlich, weil vor allem so viel unsinniges Zeug, warum habe ich den Mailregex zum Beispiel noch offen, warum, also wer übrigens mal AFC-konform E-Mail-Adressen-Regex matchen will, das ist der offizielle RFC-Regex dafür, warum auch immer, wenn ich den so offen habe. Gibt es noch irgendwas Leute, ich habe noch eine Viertelstunde Zeit, ich habe nichts geplant heute und ich habe mehr oder weniger meinen Pulver, was ich so erzählen kann, glaube ich jetzt auch langsam verschossen, ich bleibe auch nicht mal lange on nach 15 Minuten, also 15 Minuten bleibe ich erst noch on bis 22 Uhr, dann muss ich meinen Hals schonen wieder. Meinung zu Steam auf Chromebooks, habe ich noch nie ausprobiert, keine Ahnung, wusste ich gar nicht, dass es geht ehrlich gesagt, aber klar, ich meine, das ist ein Linux, warum soll es nicht gehen. Wie gut der Support ist, keine Ahnung, warum willst du dir ein Chromebook kaufen zum Spielen, ich glaube da gibt es besseres. Vielleicht, achso, das ist jetzt neuester News oder? Achso, das habe ich nicht mitgekriegt. Die erste Alfa für Chromebooks ist erschienen. Aha, Chromebooks, warum nicht? Ich meine, das ist das beste was uns passieren kann, die vielleicht mal darauf hoffen, dass irgendwann man gescheit unter Linux spielen kann, also ohne, dass man immer sich Gedanken machen muss und im Zweifelsfall doch was nicht funktioniert, dass man irgendwann mal vielleicht ganz unbedenkt, ohne großartig nachzudenken auch sagen kann, naja, gut neues Game, installiere ich mir, obwohl ich unter Linux bin, also das ist das beste was Valve machen kann, die können ihr Kram einfach nur verteilen und hoffen, dass es nach und nach mehr Userbase kriegt. Stromo ist es halt kein Linux, ist es nicht? Doch, was soll es denn sonst sein, Windows ist es nicht, was anderes gibt es nicht. Es kann doch nur, BSD wird es nicht sein, es kann doch nur Linux oder Windows sein, Windows ist es nicht, es kann doch eigentlich nichts anderes sein. Ja, ein Gentoo ist das sogar, ein Gentoo Leute, nicht mal Arch by the way, ein Gentoo. Ja, das wurde aber noch zu Zeiten veröffentlicht, wo Google noch die krassen Hackermans hatte, die haben gesagt, wir verwenden Gentoo dafür. Ich habe einen 3D Drucker, ich habe einen 3D Drucker, warum fragst du, ich habe einen 3D Drucker, druck damit nicht so viel, mal ein paar Gehäuse oder sowas ab und zu, druck vielleicht 2-3 mal im Monat was. Gentoo. Hast du schon das neue Chrome OS Flex getestet? Ne, ich habe kein Chromebook und ich wüsste auch nicht, was ich mit Chrome OS machen soll, ehrlich gesagt. Ich meine, man kann sich Chrome OS sicherlich in irgendeiner VM oder so installieren, wobei das reichlich sinnlos ist. Das kannst du einstellen. Du meinst, die erste LED geht mal an, geht mal aus, flackert ein bisschen, aber nur die allererste, so random gefühlt. Es gibt ein Setting dafür, die erste LED zu überspringen. Musst du mal in den Settings gucken. Es gibt explizit für diese Probleme mit der ersten LED gibt es ein Setting in WLED. Also wenn du WLED verwendest, wahrscheinlich, oder? First LED. Randomly first LED turn screen. Ja, da gibt es Settings für. Du kannst es einstellen, skip first oder sowas. Musst du mal in den Settings gucken, gibt es was für. Du bist also nicht der einzige, der das Problem hat. Ich frage, weil er werft das Gehäuse. Die meisten Sachen in Smartphones kannst du doch gar nicht 3D drucken. Gehäuse für Technik Sachen willst du eigentlich auch nicht, gerade für Sachen, die du täglich wirklich 3D drucken. Wenn ich für meinen ESP ein Gehäuse 3D drucke, ist das ein, aber ich druck doch kein 3D Gehäuse für mein Steam Deck oder Smartphone. Und die Innereien kannst du ja gar nicht 3D drucken. Ich meine, vielleicht lobenswert der Ansatz, aber ob das nennenswert irgendwas bringt, ich habe da meine Zweifel. Du wirst jetzt nicht, was man damit machen soll. Bad Good Time, Leute, ich werde müde. Ja, wenn es sonst nichts mehr gibt, soll irgendjemand hosten? Von den kleinen Leuten. Top Cut, keiner da. Ja, kein Problem. Was? Wen? Das Name sagt mir irgendwas. Schon mal irgendwo gelesen. Ach, das R, jetzt weiß ich, wer das ist. Das ist der, den ich eine Weile mit Tanzverbot verwechselt habe. Weil ich das überhaupt nicht verfolge, aber dabei sehen die sich noch nicht mal ähnlich. Ich habe die Stelle als Werkstatt. Ach, bei Rolls Royce oder wo warst du der? Warst du der Rolls Royce Bewerber? Nice. Und wann geht es los? Und bezahlen die was Gescheites oder bezahlen nichts und wollen vollen Einsatz? Also ein bisschen was bezahlen werden sie ja. Also echt ein bisschen. Bist du zufrieden mit dem, was sie was sie bezahlen? Na gut, Leute, dann machen wir jetzt ab. Alles klar. Wir sehen uns bis denn. Macht's gut. CU. Ich bin weg.", "segments": [{"id": 1, "start": 60.0, "end": 61.0, "text": "Hallo?"}, {"id": 2, "start": 61.0, "end": 62.0, "text": "Hallo?"}, {"id": 3, "start": 62.0, "end": 63.0, "text": "Hallo?"}, {"id": 4, "start": 63.0, "end": 64.0, "text": "Hallo?"}, {"id": 5, "start": 64.0, "end": 65.0, "text": "Hallo?"}, {"id": 6, "start": 65.0, "end": 66.0, "text": "Hallo?"}, {"id": 7, "start": 66.0, "end": 94.2, "text": "Hallo Leute, ich bin auch mal wieder am Start, mal ein Rollo zumachen."}, {"id": 8, "start": 94.2, "end": 99.0, "text": "Das ihr nicht alle durchs Fenster guckt, während ich am streamen bin."}, {"id": 9, "start": 99.0, "end": 108.08, "text": "So, ich war gerade noch mal auf dem Klo, ganz wichtige Info, ich weiß."}, {"id": 10, "start": 108.08, "end": 120.6, "text": "Ja, und was habe ich so verpasst?"}, {"id": 11, "start": 120.6, "end": 127.2, "text": "Gab es irgendwelches Twitch Drama oder so in den letzten Tagen?"}, {"id": 12, "start": 127.2, "end": 130.4, "text": "Ich habe nichts mitgekriegt Leute, ich bin immer noch ein bisschen krank mit meinem Hals."}, {"id": 13, "start": 130.4, "end": 133.64, "text": "Ich gehe morgen mal zum HNO Arzt, das habe ich mir schon überlegt."}, {"id": 14, "start": 133.64, "end": 139.24, "text": "Ich werde dann wieder Trick 17 ziehen und ruf an und sage, ich bezahle selbst."}, {"id": 15, "start": 139.24, "end": 140.48, "text": "Dann geht das immer sehr schnell."}, {"id": 16, "start": 140.48, "end": 145.44, "text": "Prime Sub, Dankeschön, 08max07."}, {"id": 17, "start": 145.44, "end": 149.52, "text": "Aber ich glaube, ich höre mich an wie immer."}, {"id": 18, "start": 149.52, "end": 153.56, "text": "Naja, mir tut immer noch ein bisschen was, wobei mir tut nicht der Hals weh."}, {"id": 19, "start": 153.56, "end": 156.96, "text": "Es ist vielleicht irgendwie entzündet oder so, keine Ahnung, ich musste echt mal langsam"}, {"id": 20, "start": 156.96, "end": 157.96, "text": "was machen."}, {"id": 21, "start": 157.96, "end": 162.44, "text": "Habt es jetzt seit 4 Wochen oder so, irgendwann ist es ja auch mal gut."}, {"id": 22, "start": 162.44, "end": 167.48, "text": "Eins kann ich euch sagen Leute, was ihr nicht machen dürft ist, wenn ihr irgendwas habt,"}, {"id": 23, "start": 167.48, "end": 170.6, "text": "sei es Halsschmerzen, Kopfschmerzen, was auch immer, ihr dürft nicht dem Internet"}, {"id": 24, "start": 170.6, "end": 171.6, "text": "danach suchen."}, {"id": 25, "start": 171.6, "end": 177.84, "text": "Ihr habt, ihr habt von Kehlkopfkrebs bis Gehirntumor, ihr habt alles."}, {"id": 26, "start": 177.84, "end": 181.74, "text": "Das kannst du komplett vergessen, guckt, ich meine natürlich könnt ihr im Internet"}, {"id": 27, "start": 181.74, "end": 185.24, "text": "gucken, es ist immer noch sinnvoll, das mit dem abzugleichen, was dein Arzt sagt oder"}, {"id": 28, "start": 185.24, "end": 186.24, "text": "so."}, {"id": 29, "start": 186.24, "end": 188.24, "text": "Aber sucht nicht zu sehr rum."}, {"id": 30, "start": 188.24, "end": 194.52, "text": "Zum Beispiel, wenn ich sage, irgendwie, ich muss mich öfters reuspern und husten und"}, {"id": 31, "start": 194.52, "end": 195.88, "text": "so, das ist alles."}, {"id": 32, "start": 195.88, "end": 203.04, "text": "Wie gesagt von Lungenkrebs bis Kehlkopf, Tumor ist alles, kann alles sein."}, {"id": 33, "start": 203.04, "end": 204.68, "text": "Da macht man sich komplett verrückt."}, {"id": 34, "start": 204.68, "end": 212.08, "text": "Dr. Google sagt Schwanger, ja, außeredischer Parasit, du bist immer kurz vorm abkratzen"}, {"id": 35, "start": 212.08, "end": 215.04, "text": "eigentlich, wenn es nach Google geht."}, {"id": 36, "start": 215.04, "end": 222.56, "text": "Was ja nicht grundsätzlich falsch ist, muss man sagen, es ist ja schon Symptome, aber"}, {"id": 37, "start": 222.56, "end": 227.88, "text": "wir sind alle zum größten Teil unter 50 und wenn ihr euch mal die Verteilung der Krankheiten"}, {"id": 38, "start": 227.88, "end": 233.68, "text": "anguckt, die meisten gehen erst ab 50 langsam hoch und ab 70 dann richtig hoch."}, {"id": 39, "start": 233.68, "end": 239.96, "text": "Die Chance, dass man mit unter 40 oder unter 50 super krasses Zeug hat, ist sehr gering."}, {"id": 40, "start": 239.96, "end": 246.36, "text": "Er ist wie bei der Corona-Impfung, da kannst du im Zweifelsfall auch dran sterben, was"}, {"id": 41, "start": 246.36, "end": 248.04, "text": "aber halt äußerst unwahrscheinlich ist."}, {"id": 42, "start": 248.04, "end": 256.88, "text": "Moin Leute, so, ich habe nichts vor, ich wollte einfach mal wieder Stream anmachen,"}, {"id": 43, "start": 256.88, "end": 259.84, "text": "dass ich euch hier nicht so lange alleine da sitzen lasse."}, {"id": 44, "start": 259.84, "end": 267.72, "text": "Ich habe die letzten paar Monate so viele Videos gemacht, um so oft gestreamt und jetzt"}, {"id": 45, "start": 267.72, "end": 272.88, "text": "quasi vier Wochen gar nicht, das kann ja nicht sein."}, {"id": 46, "start": 272.88, "end": 276.88, "text": "Außerdem finde ich das entspannend, das ist echt was, was sich geändert hat."}, {"id": 47, "start": 276.88, "end": 281.56, "text": "Ich kann mich noch dran erinnern, die ersten Streams, die ich gemacht habe, fand ich mega"}, {"id": 48, "start": 281.56, "end": 282.56, "text": "anstrengend."}, {"id": 49, "start": 282.56, "end": 288.04, "text": "Da habe ich ja noch ein bisschen BDO mit Fabian gespielt, ich fand das richtig anstrengend."}, {"id": 50, "start": 288.04, "end": 294.0, "text": "Die ersten paar Streams, also das erste halbe Jahr oder so, ich dachte mir so, was erzählst"}, {"id": 51, "start": 294.0, "end": 299.08, "text": "du denn und was machst du, da kannst du keine Pause machen beim Reden und da musst du immer"}, {"id": 52, "start": 299.08, "end": 300.08, "text": "irgendwas sagen."}, {"id": 53, "start": 300.08, "end": 303.8, "text": "Was ja Schwachsinn ist, ich sage ja selbst, selbst wenn ich einfach meinen Kopf ausschalte,"}, {"id": 54, "start": 303.8, "end": 308.76, "text": "rede ich mehr oder weniger den ganzen Stream durchgängig, das war voll anstrengend."}, {"id": 55, "start": 308.76, "end": 312.4, "text": "Mittlerweile ist es genau das Gegenteil, das Einzige, was mich anstrengend ist, es geht"}, {"id": 56, "start": 312.4, "end": 316.08, "text": "mir ein bisschen auf die Stimme und ein bisschen auf den Hals, wenn ich zu sehr schwätze, aber"}, {"id": 57, "start": 316.08, "end": 318.84, "text": "ansonsten finde ich Streamen tatsächlich echt entspannend."}, {"id": 58, "start": 318.84, "end": 326.48, "text": "Vor allem, wenn es so ein sinnlost Stream ist wie heute, wo wir nicht großartig was machen,"}, {"id": 59, "start": 326.48, "end": 329.48, "text": "außer uns über ein paar aktuelle Dinge zu unterhalten oder sonst wie."}, {"id": 60, "start": 329.48, "end": 333.6, "text": "Ja, wo wir gerade beim Thema aktuelle Dinge sind, Leute, ich habe mir ein richtig nice"}, {"id": 61, "start": 333.6, "end": 343.0, "text": "neues Heimautomatisierungsprojekt ausgedacht und zwar, ich habe Rauchmelder in fast jedem"}, {"id": 62, "start": 343.0, "end": 344.0, "text": "Raum."}, {"id": 63, "start": 344.0, "end": 348.48, "text": "Im Bad habe ich keine Rauchmelder, aber ich habe beispielsweise dem Arbeitszimmer Rauchmelder,"}, {"id": 64, "start": 348.48, "end": 351.92, "text": "Flur Rauchmelder, Schlafzimmer Rauchmelder, Flur unten Rauchmelder, Schlafzimmer unten"}, {"id": 65, "start": 351.92, "end": 352.92, "text": "Rauchmelder, sowas."}, {"id": 66, "start": 352.92, "end": 357.84, "text": "So und ich habe mir ein cooles neues Projekt ausgedacht, inspiriert, inspiriert durch ein"}, {"id": 67, "start": 357.84, "end": 361.96, "text": "YouTube Video, was ich gesehen habe und zwar habe ich mir jetzt gekauft, also ich habe"}, {"id": 68, "start": 361.96, "end": 374.12, "text": "diese Rauchmelder hier, i650, ganz schön passt und die normalen, die ersten gehen aber"}, {"id": 69, "start": 374.12, "end": 380.68, "text": "schon kaputt, die haben so eine Batterie drin, dass sie 10 Jahre halten, so und die ersten"}, {"id": 70, "start": 380.68, "end": 385.56, "text": "sind aber schon kaputt gegangen, deswegen habe ich mir jetzt die hier bestellt, zum"}, {"id": 71, "start": 385.56, "end": 393.24, "text": "Testen erstmal ein, so ein i650RF, das Gute ist, dass die Halterungen an der Decke passen"}, {"id": 72, "start": 393.24, "end": 394.24, "text": "mit denen."}, {"id": 73, "start": 394.24, "end": 398.44, "text": "So und was man da bekommt ist, das ist eigentlich eine richtig coole Geschichte, was der Typ"}, {"id": 74, "start": 398.44, "end": 403.32, "text": "in dem YouTube Video gezeigt hat, was man dabei bekommt ist, man bekommt den Rauchmelder,"}, {"id": 75, "start": 403.32, "end": 414.28, "text": "man bekommt ein Funkmodul, weiß ich ob man das hier in diesem Video drin sieht, ist gut,"}, {"id": 76, "start": 414.28, "end": 426.12, "text": "aber super, dass ich das uselessste Video aller Zeiten habe, ja es gibt ein Funkmodul,"}, {"id": 77, "start": 426.12, "end": 433.0, "text": "das klipst man im Endeffekt einfach nur rein in diesen Rauchmelder und dann funkt er auf"}, {"id": 78, "start": 433.0, "end": 439.36, "text": "868 Mhz und dann habe ich mir das hier dazu gekauft, das ist eigentlich nicht dafür gedacht,"}, {"id": 79, "start": 439.36, "end": 446.08, "text": "da bin ich gleich gleich dabei, ne ne ne das stimmt nicht, das stimmt nicht, also das kann"}, {"id": 80, "start": 446.08, "end": 454.12, "text": "ich so nicht unterschreiben, ich wohne seit 2013 hier in dem Haus und jetzt, jetzt ist"}, {"id": 81, "start": 454.12, "end": 462.6, "text": "letztens erst in meinem Schlafzimmer der erste Melder kaputt gegangen und ich meine ja, 2013"}, {"id": 82, "start": 462.6, "end": 471.72, "text": "bis Ende 2021, das sind keine wirklich 10 Jahre, aber damit kann ich leben, damit, also"}, {"id": 83, "start": 471.72, "end": 477.44, "text": "mit der Dauer kann ich, kann ich leben, moin Michael 50 Billionen, so zumindest habe ich"}, {"id": 84, "start": 477.44, "end": 484.96, "text": "mir den jetzt gekauft und ein i413, das ist ein Empfänger für diese Rauchmelder, so und"}, {"id": 85, "start": 484.96, "end": 490.96, "text": "von der Idee her ist es jetzt so, eigentlich ist das gedacht, dass man das an eine Alarmanlage"}, {"id": 86, "start": 490.96, "end": 506.4, "text": "bzw. an eine Hausbrandmeldeanlage oder sowas anschließt und Moment, was ich jetzt mache"}, {"id": 87, "start": 506.4, "end": 513.08, "text": "ist folgendes, da drinne ist im Prinzip einfach nur eine ganz normale Platine, an der du an"}, {"id": 88, "start": 513.08, "end": 520.5, "text": "Relays Zeug anschließen kannst, was du willst, das heißt von der Idee her, ich perre, wobei"}, {"id": 89, "start": 520.5, "end": 528.3, "text": "ich kann, ich kann euch mal das Video zeigen, was mich dazu inspiriert hat, Shelley Smoke,"}, {"id": 90, "start": 528.3, "end": 531.12, "text": "das Video hat mich dazu inspiriert, wir gucken es jetzt nicht, wir gucken uns den Aufbau"}, {"id": 91, "start": 531.12, "end": 537.12, "text": "an, by the way macht, für Shelley Sachen macht er wirklich gute Videos, ja, so also das Video"}, {"id": 92, "start": 537.12, "end": 541.24, "text": "hat mich dazu inspiriert, so sieht das von innen aus und von der Idee her ist das super"}, {"id": 93, "start": 541.24, "end": 547.44, "text": "easy anzuschließen, man braucht diesen Shelley gar nicht, ich habe jetzt einen ESP D1 Mini"}, {"id": 94, "start": 547.44, "end": 552.32, "text": "genommen und habe hier einfach verkabelt, ich habe die billige Variante gemacht, ich habe"}, {"id": 95, "start": 552.32, "end": 557.84, "text": "einfach hier alles auf das Ground drauf geschraubt, drei Kabel und gut ist, verkabelt, das Dumme"}, {"id": 96, "start": 557.84, "end": 562.64, "text": "ist nur, also von der Idee her wird es dann so funktionieren, hier gibt es einmal einen"}, {"id": 97, "start": 562.64, "end": 566.84, "text": "Ausgang, wenn Batterie von den Meldern kaputt geht, hier gibt es einen Ausgang, wenn Alarm"}, {"id": 98, "start": 566.84, "end": 574.56, "text": "ausgelöst wird, hier gibt es einen Ausgang, wenn CO2 Alarm ausgelöst wird und hiervon"}, {"id": 99, "start": 574.56, "end": 579.24, "text": "kann man, das sind ganz normale Relays, die kann man abgreifen mit jedem x-beliebigen"}, {"id": 100, "start": 579.24, "end": 585.48, "text": "Controller, mit jedem x-beliebigen GPIO, Raspberry Pi, was auch immer und sich das an seine Heimautomatisierung"}, {"id": 101, "start": 585.48, "end": 595.64, "text": "schicken lassen, soweit, von der Idee, ja, netter Ross, Dankeschön für den huge massive"}, {"id": 102, "start": 595.64, "end": 607.16, "text": "Subscription, so, das Problem ist jetzt nur, übersteuere ich heute ein bisschen, nee oder,"}, {"id": 103, "start": 607.16, "end": 614.04, "text": "muss ich mal mal anhören, Test, Test, Test, bin ich heute am übersteuern Leute, was habe"}, {"id": 104, "start": 614.04, "end": 619.56, "text": "ich eben gesagt, was habe ich eben gesagt, das Problem ist nur, dass bla bla bla bla"}, {"id": 105, "start": 619.56, "end": 625.92, "text": "und so und bla und so, mal kurz anhören, das Problem ist nur, dass bla bla bla bla und"}, {"id": 106, "start": 625.92, "end": 632.52, "text": "so und bla und so, ich höre mich an wie immer oder, ist eigentlich kein Unterschied,"}, {"id": 107, "start": 632.52, "end": 642.6, "text": "der Husten fehlt, ja ey, ich habe gerade ein bisschen Salz, nicht Salz, Salz, wie heißt"}, {"id": 108, "start": 642.6, "end": 647.12, "text": "das, Lösung, inhaliert, danach ist es immer besser, ich sag euch mal, mein Hals ist mega"}, {"id": 109, "start": 647.12, "end": 654.56, "text": "im Arsch, genau und so habe ich das bei mir auch angeschlossen, das einzige Problem ist"}, {"id": 110, "start": 654.56, "end": 661.6, "text": "nur, das ist kaputt, das Relay ist kaputt bei mir, das Relay, das Relay für Fire ist"}, {"id": 111, "start": 661.6, "end": 671.56, "text": "kaputt, das merke ich daran, weil das Relay für Fehler funktioniert und das Relay für"}, {"id": 112, "start": 671.56, "end": 678.36, "text": "Fire ist im Arsch, ich habe alles abgestöpselt und habe nur hier mein Messgerät dran gemacht"}, {"id": 113, "start": 678.36, "end": 682.2, "text": "und man kann, wenn man das hier überbrückt, kann man den Testalarm auslösen, das Relay"}, {"id": 114, "start": 682.2, "end": 689.2, "text": "schaltet einfach nicht, das hört man hier auch, das klickt ja auch, die Relays hörst"}, {"id": 115, "start": 689.2, "end": 701.72, "text": "ja auch, so und jetzt schicke ich das zurück und viel Neues haben wir funktioniert, so"}, {"id": 116, "start": 701.72, "end": 706.36, "text": "das ist das, das ist nice, da kann ich meine Rauchmelder nämlich endlich mal an mein Smart"}, {"id": 117, "start": 706.36, "end": 711.6, "text": "Home anbinden, dass ich mir auch, wenn es brennt oder so eine Message schicken lassen"}, {"id": 118, "start": 711.6, "end": 732.6, "text": "so weit die Idee, ah ja und der nächste ganz gute Nebeneffekt ist, dass die Rauchmelder"}, {"id": 119, "start": 732.6, "end": 735.84, "text": "miteinander gekoppelt sind, das heißt, wenn einer unten im Flur angeht, höre ich dann"}, {"id": 120, "start": 735.84, "end": 741.52, "text": "oben auch bei mir klingeln, ja die sind untereinander verbunden, das ist jetzt auch nicht der Fall,"}, {"id": 121, "start": 741.52, "end": 751.6, "text": "weil ich ja die ohne Funk habe, also das ist insgesamt eigentlich schon ganz nice, oder"}, {"id": 122, "start": 751.6, "end": 764.6, "text": "um nicht zu sagen, um nicht zu sagen, wenn es dann funktioniert, so viel die Idee, was"}, {"id": 123, "start": 764.6, "end": 771.2, "text": "ist das hier, die haben aber nicht so gute Bewertungen, außerdem passen die nicht in"}, {"id": 124, "start": 771.2, "end": 791.28, "text": "meine Deckenhalterung, die ich jetzt aktuell habe, nicht zu empfehlen Serienstreuern, exzellent,"}, {"id": 125, "start": 791.28, "end": 803.72, "text": "naja wie dem auch sei, ja das bastle ich gerade nebenbei, um mich ein bisschen vor meinem"}, {"id": 126, "start": 803.72, "end": 811.68, "text": "Hals abzulenken, tja ansonsten, ich überlege gerade, habe ich irgendwie spannende, ach"}, {"id": 127, "start": 811.68, "end": 818.68, "text": "ja wisst ihr was ich gesehen habe, guckt mal hier, hat einer auf Discord gepostet, hast"}, {"id": 128, "start": 818.68, "end": 822.96, "text": "du einen Tipp, wo man MikroTik-Router kaufen kann, es gibt viele Versionen, welche reicht"}, {"id": 129, "start": 822.96, "end": 836.52, "text": "für den privaten Haushalt, wo du die kaufen kannst, bei Amazon zum Beispiel, oder bei"}, {"id": 130, "start": 836.52, "end": 843.8, "text": "Park Geizhals, oder ist die Frage, welchen du kaufen willst, oder welchen du kaufen sollst,"}, {"id": 131, "start": 843.8, "end": 851.48, "text": "weil welchen, das kann ich dir nicht sagen, da musst du ja halt sagen, was du haben willst,"}, {"id": 132, "start": 851.48, "end": 859.28, "text": "das ist sonst ein bisschen schwierig, nicht Salzsäure, Wasser mit Salz, Wasser mit Salz"}, {"id": 133, "start": 859.28, "end": 869.88, "text": "ist vielleicht nicht ganz so schlimm wie Salzsäure, ja welcher würde reichen, was willst du machen,"}, {"id": 134, "start": 869.88, "end": 874.6, "text": "ich meine das ist sehr schwierig zu beantworten, willst du 10 Gigabit, willst du kein 10 Gigabit,"}, {"id": 135, "start": 874.6, "end": 879.72, "text": "willst du 2,5 Gigabit, willst du deinen DSL-Moder anschließen oder nicht, was ich nicht machen"}, {"id": 136, "start": 879.72, "end": 889.04, "text": "würde, aber man weiß ja nie, ja das muss man schon wissen, ja übrigens wisst ihr was"}, {"id": 137, "start": 889.04, "end": 897.68, "text": "ich mitbekomme, aber vorhin, weil es jemand auf dem Discord geschrieben hat, in Vue CLI,"}, {"id": 138, "start": 897.68, "end": 906.64, "text": "das ist das bis vor ein paar Wochen bevorzugte Tool um neue Vue.js Anwendungen anzulegen,"}, {"id": 139, "start": 906.64, "end": 913.48, "text": "dort ist eine Abhängigkeit drinne zu diesem Paket, Node IPC und wisst ihr was die Programmierer"}, {"id": 140, "start": 913.48, "end": 920.84, "text": "von Node IPC gemacht haben, die haben mit ihrer Software einen Check eingebaut, ob du"}, {"id": 141, "start": 920.84, "end": 931.6, "text": "eine russische oder eine weißrussische externe IP hast, wenn ja löscht deine Festplatte,"}, {"id": 142, "start": 931.6, "end": 941.64, "text": "was natürlich auf der einen Seite irgendwie als Protestaktion verstanden werden kann,"}, {"id": 143, "start": 941.64, "end": 949.12, "text": "da kann man natürlich von halten was man will, ich meine das ist ihr Projekt, ja wenn"}, {"id": 144, "start": 949.12, "end": 954.84, "text": "die es für richtig halten, egal ob ich das jetzt für gut oder schlecht halte, ich finde"}, {"id": 145, "start": 954.84, "end": 960.44, "text": "es von der Aussagekraft ja vielleicht nicht schlecht, aber es gibt einen Grund warum ich"}, {"id": 146, "start": 960.44, "end": 967.6, "text": "es wirklich schlecht finde ist, dass sowas zerstört das Vertrauen in so Projekte, ganz"}, {"id": 147, "start": 967.6, "end": 973.6, "text": "ehrlich das ist natürlich schlimm und mag vielleicht aus ihrer Sicht auch gerechtfertigt"}, {"id": 148, "start": 973.6, "end": 977.92, "text": "sein, gerade wenn sie da irgendwie persönlich davon betroffen sind, aber wenn ich so ein"}, {"id": 149, "start": 977.92, "end": 987.0, "text": "Projekt dann verwende weiß ich nicht ob morgen nicht was anderes drin ist, also ich weiß"}, {"id": 150, "start": 987.0, "end": 997.0, "text": "nicht, also das finde ich äußerst fragwürdig, achja kennt jemand einen unmanaged access"}, {"id": 151, "start": 997.0, "end": 1012.8, "text": "point mit POE, du meinst der sich über POE betreiben lässt, ja irgendeinen TP Link, irgendeinen"}, {"id": 152, "start": 1012.8, "end": 1021.92, "text": "billig TP Link, guckst du einfach bei Amazon, TP Link, POE, BAM, achso das sind Switche,"}, {"id": 153, "start": 1021.92, "end": 1028.6, "text": "Access Point, Access Points, POE, gibt es da nichts von TP Link, boah was denn das, sieht"}, {"id": 154, "start": 1028.6, "end": 1040.04, "text": "aus wie zerklirrendes Kissen, ja sowas in der Richtung, es gibt es doch bestimmt, also"}, {"id": 155, "start": 1040.04, "end": 1045.72, "text": "ich kenne aber keinen muss ich dazu sagen, boah was das, oh 1KS, was haben wir denn hier"}, {"id": 156, "start": 1045.72, "end": 1056.08, "text": "für Ausgeburt in der Hölle offen, wann gibt es das 40 Gigabit Upgrade, ähm ich überlege"}, {"id": 157, "start": 1056.08, "end": 1060.36, "text": "gerade ob es da ein realistisches Zeitfenster für gibt, also ich meine ich habe ja noch"}, {"id": 158, "start": 1060.36, "end": 1063.96, "text": "nicht mal ordentlich 10 Gigabit, na wobei doch 10 Gigabit habe ich jetzt mittlerweile"}, {"id": 159, "start": 1063.96, "end": 1074.72, "text": "ordentlich, aber es ist halt aktuell eher so, ich wüsste gar nicht was ich 40 Gigabit"}, {"id": 160, "start": 1074.72, "end": 1081.24, "text": "irgendwie benutzen sollte, 40 Gigabit kriegst du vielleicht, vielleicht mit einer super"}, {"id": 161, "start": 1081.24, "end": 1090.68, "text": "geilen PCI Express SSD voll oder so, aber was willst du denn da machen, ich weiß nicht,"}, {"id": 162, "start": 1090.68, "end": 1098.44, "text": "du hast direkt LWL bis an den Rechner, nö, nö, nö habe ich nicht, ich habe, also LWL"}, {"id": 163, "start": 1098.44, "end": 1102.96, "text": "ist für die Leute nicht, wir sind Lichtwellenleiter, das ist quasi das, das was umgangssprachlich"}, {"id": 164, "start": 1102.96, "end": 1108.28, "text": "unter Glasfaser läuft, ähm ne habe ich nicht bis an den Rechner, hätte ich machen können,"}, {"id": 165, "start": 1108.28, "end": 1113.72, "text": "ich habe, ich habe, ich habe welche hier, auch die passenden Module, aber mein Mainboard"}, {"id": 166, "start": 1113.72, "end": 1122.8, "text": "hat ein Onboard 10G, AJ45 Stecker und dementsprechend ganz normales Kupferkabel und die Switche"}, {"id": 167, "start": 1122.8, "end": 1127.8, "text": "und das NAS intern und sowas, das habe ich zum größten Teil über Direct Attached SFP"}, {"id": 168, "start": 1127.8, "end": 1137.68, "text": "plus Kupferkabel gemacht, ich habe aktuell kein Glasfaserkabel im Einsatz irgendwo, ich"}, {"id": 169, "start": 1137.68, "end": 1142.84, "text": "hatte den alten Server, den habe ich bei Glasfaser und Modul angeschlossen, aber ich glaube"}, {"id": 170, "start": 1142.84, "end": 1152.8, "text": "ich habe nur Direct Attached Kabel aktuell und normale Kupferkabel, guck mal die China"}, {"id": 171, "start": 1152.8, "end": 1157.12, "text": "Chinesen sind am Start bei Simplicissimus, das gucken wir uns heute nicht an, das ist"}, {"id": 172, "start": 1157.12, "end": 1159.84, "text": "immer so dramatisch, wenn Vira das alles betont."}, {"id": 173, "start": 1159.84, "end": 1173.56, "text": "Ich habe mir aus der Arbeit auch zwei, was, was hast du dir aus der Arbeit, 2x10GR45,"}, {"id": 174, "start": 1173.56, "end": 1174.56, "text": "Module oder was?"}, {"id": 175, "start": 1174.56, "end": 1183.36, "text": "Bei Kabel geht ja jedes exbeliebige Kabel mit RJ45 Stecker, ach Module, ja das, also"}, {"id": 176, "start": 1183.36, "end": 1186.6, "text": "wenn die noch welche übrig hätten auf der Arbeit, würde ich auch welche nehmen, weil"}, {"id": 177, "start": 1186.6, "end": 1195.12, "text": "Module kosten sagen wir mal 50-60€ aufwärts und PC, ach PC Express Karten, wähä, warte"}, {"id": 178, "start": 1195.12, "end": 1204.36, "text": "mal, das hat ja mit PC Express Karten nichts zu tun, ach du hast, du hast Netzwerkkarten"}, {"id": 179, "start": 1204.36, "end": 1210.56, "text": "mitgenommen, nicht Module, du hast Netzwerkkarten mitgenommen, ach so, ja, ja, klar, man muss"}, {"id": 180, "start": 1210.56, "end": 1217.84, "text": "sich mal überlegen, 10 Gigabit ist im Enterprise Umfeld schon eigentlich out, die schmeißen"}, {"id": 181, "start": 1217.84, "end": 1226.0, "text": "die Hardware davon ja schon weg und da kann man, wenn es erlaubt ist, immer mal was abgreifen."}, {"id": 182, "start": 1226.0, "end": 1243.8, "text": "Ja ansonsten, ich überlege gerade, ach ja, ach ja, chat, chat, ich brauche mal eure Hilfe,"}, {"id": 183, "start": 1243.8, "end": 1250.88, "text": "bald darf Chico auf meine Terrasse, also ich habe ja, also das in dem Haus hier, in dem"}, {"id": 184, "start": 1250.88, "end": 1258.8, "text": "Haus hier haben wir es ja so, also du hast, Haus, Erdgeschoss, Keller, erster Stock, Dachgeschoss"}, {"id": 185, "start": 1258.8, "end": 1268.0, "text": "und dann hast du einen Hof mit Stall, Garage und dann hinten, hinten einen Garten, so und"}, {"id": 186, "start": 1268.0, "end": 1275.56, "text": "sowohl Hoftor als auch Eingang zum Garten sind eigentlich mit einem relativ undurchlässigen"}, {"id": 187, "start": 1275.56, "end": 1282.92, "text": "und hohen Zaun zu, dass die Katze nicht drüber kann, aber ich traue meiner Katze nicht, deswegen,"}, {"id": 188, "start": 1282.92, "end": 1286.4, "text": "deswegen habe ich mir gedacht, Chico ist nämlich, ich muss mal wissen, Chico ist eine reine"}, {"id": 189, "start": 1286.4, "end": 1292.72, "text": "Hauskatze, war sie bisher immer, war sie bisher immer und ist sie bei mir bis jetzt, wie gesagt"}, {"id": 190, "start": 1292.72, "end": 1296.96, "text": "ich habe die ja erst seit 3 Jahren oder so, vorher war die ja woanders, wurde ja im Tierheim"}, {"id": 191, "start": 1296.96, "end": 1304.28, "text": "abgegeben, ich habe mir jetzt überlegt, diesen Sommer darf sie raus und da will ich"}, {"id": 192, "start": 1304.28, "end": 1309.76, "text": "ein Netz an die Seite von der Terrasse machen, also Terrasse ist im Endeffekt Eingangstür,"}, {"id": 193, "start": 1309.76, "end": 1313.04, "text": "dann kommt man auf die Terrasse, dann geht es runter in den Hof und dann kann man hinten"}, {"id": 194, "start": 1313.04, "end": 1317.08, "text": "in den Garten oder in den Garage oder in den Stall oder so, so und ich habe mir jetzt was"}, {"id": 195, "start": 1317.08, "end": 1333.28, "text": "bestellt und zwar gibt es bei denen so Netze, nicht Netzgarn, Netze, extreme Netze, es gibt"}, {"id": 196, "start": 1333.28, "end": 1341.64, "text": "zumindest Netze für Terrassen und Balkons und sowas und ich bin zu dumm, guckt mal vielleicht"}, {"id": 197, "start": 1341.64, "end": 1348.04, "text": "hat da irgendjemand Ahnung von, ich habe mir so einen Seil bestellt, also die Idee ist,"}, {"id": 198, "start": 1348.04, "end": 1355.2, "text": "ich mache zwischen der Wand vom Stall und zwischen meiner Hauswand so einen Stahlseil"}, {"id": 199, "start": 1355.2, "end": 1360.0, "text": "und da drüber mache ich dann die, mache ich das Netz und das Netz unten beschwer ich"}, {"id": 200, "start": 1360.0, "end": 1363.6, "text": "halt mit Steinen und das kann ich dann auch zur Seite schieben, dass man die Treppe hoch"}, {"id": 201, "start": 1363.6, "end": 1367.68, "text": "und runter kann oder ich ziehe es dann wieder hinter, wenn die Katz rausgeht, was auch immer,"}, {"id": 202, "start": 1367.68, "end": 1373.08, "text": "hat jemand eine Ahnung, wie man sowas hier verwendet, ihr sagt jetzt Max, das ist ein"}, {"id": 203, "start": 1373.08, "end": 1378.72, "text": "Stahlseil, da kann man nicht viel falsch machen, aber ich habe da ein Problem, dieses"}, {"id": 204, "start": 1378.72, "end": 1385.44, "text": "Seil hat nur auf der einen Seite eine Schlaufe, auf der anderen Seite nicht, wie kriege ich"}, {"id": 205, "start": 1385.44, "end": 1390.04, "text": "denn auf die andere Seite eine Schlaufe, guck mal das hat nur hier so eine Schlaufe und"}, {"id": 206, "start": 1390.04, "end": 1397.84, "text": "auf der anderen Seite ist es einfach ein Stück Draht, hat irgendjemand sowas schonmal gemacht,"}, {"id": 207, "start": 1397.84, "end": 1403.36, "text": "wie kriege ich auch eine Schlaufe, ich brauche ja, ich habe hier links einen Haken und rechts"}, {"id": 208, "start": 1403.36, "end": 1413.0, "text": "einen Haken an der Wand, wie mache ich da eine Schlaufe, wie geht das, was mit dem kleinen"}, {"id": 209, "start": 1413.0, "end": 1422.88, "text": "Teil auf der rechten Seite, das da, wie kriege ich denn damit, ach muss ich da das Kabel"}, {"id": 210, "start": 1422.88, "end": 1430.6, "text": "so rein falten oder wie, wie nennt sich sowas denn, es geht gerade nichts, es geht sinnlos"}, {"id": 211, "start": 1430.6, "end": 1435.32, "text": "Streamsorn bis ich Bett gehen muss und ich versuche gerade rauszufinden, wie ich das"}, {"id": 212, "start": 1435.32, "end": 1442.24, "text": "Ding montieren kann, du machst einen Knoten, das glaube ich nicht, da war es als letzter"}, {"id": 213, "start": 1442.24, "end": 1451.24, "text": "Schluss, weiß jemand, wie man das nennt, ich habe mal nach Stahlnetz, Längeneinstellung"}, {"id": 214, "start": 1451.24, "end": 1458.48, "text": "oder sowas geguckt, da habe ich nichts gefunden, mit dem kleinen Teil, das ist ein Stahlseil,"}, {"id": 215, "start": 1458.48, "end": 1462.12, "text": "eine Schlaufe machen und damit festschrauben, auf der anderen Seite bestimmt eine Mutter,"}, {"id": 216, "start": 1462.12, "end": 1471.6, "text": "aha, also ok, das heißt, ich ziehe die andere Ende von dem Stahlseil hier durch, je nach"}, {"id": 217, "start": 1471.6, "end": 1476.52, "text": "dem, wie viel Seil ich, also was weiß ich, wenn das Seil länger ist, als das was ich"}, {"id": 218, "start": 1476.52, "end": 1481.68, "text": "brauche, dann schleife ich das quasi weiter durch, sodass das Seil ein bisschen kürzer"}, {"id": 219, "start": 1481.68, "end": 1485.92, "text": "wird, mache dann am Ende eine Schlaufe rein und dann mache ich auf einem, wenn ich das"}, {"id": 220, "start": 1485.92, "end": 1490.96, "text": "richtig verstanden habe, dann mache ich auf einem der beiden Seiten, hänge ich das, also"}, {"id": 221, "start": 1490.96, "end": 1495.84, "text": "das hänge ich in den Haken, das hänge ich in das Seil und damit spanne ich das dann"}, {"id": 222, "start": 1495.84, "end": 1517.6, "text": "an oder, ich habe sowas noch nie gemacht, ja, ja das mache ich, das mache ich, da habe"}, {"id": 223, "start": 1517.6, "end": 1522.92, "text": "ich schon dran gedacht, auf der einen Seite ist es kein Problem, da ist nämlich ein Zaun,"}, {"id": 224, "start": 1522.92, "end": 1528.88, "text": "da kann ich das durchziehen, auf der Seite vom Haus muss ich gucken, da werde ich wahrscheinlich"}, {"id": 225, "start": 1528.88, "end": 1541.88, "text": "ein paar kleine Haken noch an jemanden machen, so ähnlich wie das hier, ach so funktioniert"}, {"id": 226, "start": 1541.88, "end": 1555.32, "text": "das, Fifehead, also mal abgesehen davon, von diesem Metall, das ist da nicht drin, ich"}, {"id": 227, "start": 1555.32, "end": 1559.4, "text": "mache das da rein, so und dann kann ich das hier beliebig lang durchziehen oder und dann"}, {"id": 228, "start": 1559.4, "end": 1565.76, "text": "mache ich damit kürzer, ah, guck mal der Chat, der Chat weiß wieder, Chat ist einfach"}, {"id": 229, "start": 1565.76, "end": 1573.84, "text": "massiv, wahnsinnig, ultra high IQ, FliBi, danke für den Sub, MrHarmank, danke für"}, {"id": 230, "start": 1573.84, "end": 1585.36, "text": "den Sub, 8 Monate Alper Subscription, nice und den Rest vom Seil halt abschneiden, ob"}, {"id": 231, "start": 1585.36, "end": 1598.16, "text": "ich da mit meinem großen Knibex Seitenschneider durchkomme, eher nicht oder, locker, Leute"}, {"id": 232, "start": 1598.16, "end": 1617.56, "text": "das ist ziemlich dick, das ist 3mm Stahlseil, da komme ich nicht mit dem Seitenschneider"}, {"id": 233, "start": 1617.56, "end": 1634.28, "text": "durch oder, das glaube ich nett, also ich rede, ich rede, so ein Ding hier, ne ne ne"}, {"id": 234, "start": 1634.28, "end": 1662.24, "text": "größerer, größerer ist das, größerer, sowas da, so ein großer ist das, echt, echt,"}, {"id": 235, "start": 1662.24, "end": 1668.88, "text": "ok, ach guck mal da ist ja sogar ein Bild davon, alter ich bin manchmal pepega, guck"}, {"id": 236, "start": 1668.88, "end": 1679.72, "text": "mal die haben auf ihrer Seite sogar ein Bild davon, wie man das macht, hätte ich mir das"}, {"id": 237, "start": 1679.72, "end": 1687.04, "text": "mal angeguckt, dann wäre ich jetzt schlauer gewesen, heute hat auch auf der Arbeit einer"}, {"id": 238, "start": 1687.04, "end": 1691.84, "text": "geschrieben, Max du musst endlich mal meine Mail lesen, ich habe ihn 5 mal angeschrieben"}, {"id": 239, "start": 1691.84, "end": 1696.28, "text": "so nach dem Motto, Passwort geht nicht, welcher Username muss ich nehmen, was muss ich dahinter"}, {"id": 240, "start": 1696.28, "end": 1700.0, "text": "für eine Domain schreiben, jetzt geht das mit dem Popup nicht, aber Max guck doch mal"}, {"id": 241, "start": 1700.0, "end": 1703.36, "text": "in meine Mails, habe ich alles in der Mail geschrieben, ich habe den irgendwie 10 mal"}, {"id": 242, "start": 1703.36, "end": 1707.28, "text": "gefragt, dabei hat er es im Vorfeld, aber ich lese prinzipiell eigentlich keine Mails"}, {"id": 243, "start": 1707.28, "end": 1713.2, "text": "mehr, Mails lesen ist overrated, jebaited, outdated, wer liest da, seriously Leute, lest"}, {"id": 244, "start": 1713.2, "end": 1724.04, "text": "ihr auf der Arbeit noch regelmäßig Mails, wer liest noch regelmäßig Mails, also ich"}, {"id": 245, "start": 1724.04, "end": 1729.2, "text": "habe es mittlerweile so auf der Arbeit, dass ich einen Ordner habe, Mails die an mich gehen,"}, {"id": 246, "start": 1729.2, "end": 1736.16, "text": "die kommen in eigenen Ordner, alles andere bleibt in der Inbox und selbst der Ordner"}, {"id": 247, "start": 1736.16, "end": 1753.36, "text": "an mich, den lese ich kaum, also Mail geschrieben habe ich glaube ich schon seit einem Monat"}, {"id": 248, "start": 1753.36, "end": 1758.0, "text": "nicht mehr oder so, ich schreibe äußerst wenig Mails und lese auch ungern Mails, gerade"}, {"id": 249, "start": 1758.0, "end": 1764.72, "text": "in der aktuellen Zeit, wo alles über Teams geht, ok aber Dankeschön Chat, ihr seid wie"}, {"id": 250, "start": 1764.72, "end": 1771.6, "text": "erwartet exquisite 5HRQ, ohne euch wüsste ich nicht wie ich der Katze morgen auf der"}, {"id": 251, "start": 1771.6, "end": 1789.32, "text": "Terrasse ihr Netz montieren soll, exellent, gut, da wissen wir ja Bescheid, macht aber"}, {"id": 252, "start": 1789.32, "end": 1795.2, "text": "einen Unterschied ob man inhouse unterwegs ist oder als Dienstleister, Leute Leute wisst"}, {"id": 253, "start": 1795.2, "end": 1800.72, "text": "ihr was, ASMR Stream, ich muss jetzt mal ein bisschen leiser reden und mal ein bisschen"}, {"id": 254, "start": 1800.72, "end": 1803.72, "text": "beruhigter reden und ich merke mir tut schon wieder der Hals weh, ich schrei immer übelst"}, {"id": 255, "start": 1803.72, "end": 1822.56, "text": "rum wenn ich am Streamen bin, warum eigentlich, so huge excited, was, Anketten, nein ich habe"}, {"id": 256, "start": 1822.56, "end": 1829.76, "text": "doch gesagt das ist für ein Netz, das die auf die Terrasse kann, ohne über den Zaun"}, {"id": 257, "start": 1829.76, "end": 1836.84, "text": "zu springen und vom Auto überfahren zu werden, da kommt ein Netz drüber und dann kann die"}, {"id": 258, "start": 1836.84, "end": 1854.76, "text": "Katze in, in, in Hof quasi bzw. auf die Terrasse, ja das ist auch sinnvoll, was, was jebaitet"}, {"id": 259, "start": 1854.76, "end": 1865.48, "text": "uns denn, ey play cancel das ist mir sowas von egal, das juckt mich überhaupt nicht,"}, {"id": 260, "start": 1865.48, "end": 1879.96, "text": "übrigens doch eine Sache, wisst ihr was für ein get emoji, was für ein wegweisendes emoji"}, {"id": 261, "start": 1879.96, "end": 1889.92, "text": "seit dem letzten iOS Update verfügbar ist, es gibt jetzt endlich ein emote für fette"}, {"id": 262, "start": 1889.92, "end": 1912.52, "text": "Männer, pepo fett, es gibt jetzt endlich einen fetten Kerl, also endlich haben die auch mal"}, {"id": 263, "start": 1912.52, "end": 1926.56, "text": "einen, ich wüsste noch was ich suchen muss hier, ah hier, pepo fett, ich muss ja sagen,"}, {"id": 264, "start": 1926.56, "end": 1936.44, "text": "der Apple emote sieht irgendwie verstörend aus und ich bin mir nicht sicher, ob das wirklich"}, {"id": 265, "start": 1936.44, "end": 1942.6, "text": "ein schwangerer Mann sein sollte oder ob die es ursprünglich nicht fetter Mann nennen"}, {"id": 266, "start": 1942.6, "end": 1952.36, "text": "wollten und sich gedacht haben, fetter Mann triggert schon wieder 30.000 Leute und deswegen"}, {"id": 267, "start": 1952.36, "end": 1958.0, "text": "wird es schwanger, wobei es halt irgendwie wenig Sinn ergibt, dass es einen schwangeren"}, {"id": 268, "start": 1958.0, "end": 1966.4, "text": "Mann im emote gibt, also fetter Mann ja, aber schwangerer Mann, ich mein in der heutigen"}, {"id": 269, "start": 1966.4, "end": 1971.24, "text": "Zeit ist ja vieles möglich und nur weil du heute ein Kerl bist, musst du morgen nicht"}, {"id": 270, "start": 1971.24, "end": 1980.08, "text": "ein Kerl sein, aber es gibt so ein paar Sachen, die gehen halt nicht, also egal wie sehr ich"}, {"id": 271, "start": 1980.08, "end": 1986.96, "text": "Frau sein will, wächst mir keine Gebärmutter, das funktioniert halt einfach nicht, der hier"}, {"id": 272, "start": 1986.96, "end": 1991.36, "text": "ist auch nicht, sondern nicht glücklich darüber, deswegen glaube ich, das sollte ursprünglich"}, {"id": 273, "start": 1991.36, "end": 1996.8, "text": "eigentlich ein dicker Mann emote werden und dachten sich, dass werden zu viele Leute getriggert"}, {"id": 274, "start": 1996.8, "end": 2006.92, "text": "und jetzt gibt es dicker Mann, die sollten eher Bracken durch Typical austauschen, ja"}, {"id": 275, "start": 2006.92, "end": 2013.76, "text": "das könnte man auch machen, Typical äh äh Typical ähm nicht Mann, sondern äh irgendwie"}, {"id": 276, "start": 2013.76, "end": 2018.72, "text": "Hacker Mann, Typical Hacker Hacker Mann, es gibt ja auch immer noch kein gescheites Hacker"}, {"id": 277, "start": 2018.72, "end": 2024.92, "text": "Emote, auch Pregnant Person gibt es, na gut, dass es Pregnant Woman gibt, das ist mir"}, {"id": 278, "start": 2024.92, "end": 2030.48, "text": "klar, warum gibt es Pregnant Person, das ist für Schwangere, die sich nicht als weiblich"}, {"id": 279, "start": 2030.48, "end": 2038.64, "text": "identifizieren oder wie ist das, was auch immer, ok es gibt Dinge, die muss ich nicht"}, {"id": 280, "start": 2038.64, "end": 2042.56, "text": "ganz nachvollziehen, stört ja im Endeffekt keinen, dass es die Emotes gibt, aber das"}, {"id": 281, "start": 2042.56, "end": 2048.32, "text": "finde ich gut, dass es endlich Pepofat Emote gibt und das gibt es seit iOS 15.4 und ich"}, {"id": 282, "start": 2048.32, "end": 2057.0, "text": "glaube 15.4 ist gestern rausgekommen oder, ja sorry, vor gestern, am Montag, seit dem"}, {"id": 283, "start": 2057.0, "end": 2065.36, "text": "letzten iOS Update gibt es das, wisst ihr eigentlich, was es für ein Ultra Wildwuchs"}, {"id": 284, "start": 2065.36, "end": 2073.64, "text": "ist bei Emojis, bei Color Emojis, das muss ich jetzt einfach mal ganz kurz erzählen,"}, {"id": 285, "start": 2073.64, "end": 2078.56, "text": "weil sich da keiner drüber Gedanken macht, aber das ein unglaublich komplexes und bescheuertes"}, {"id": 286, "start": 2078.56, "end": 2089.04, "text": "Thema mal wieder ist, also diese Emotes, dass die so aussehen, wie die aussehen, ist euch"}, {"id": 287, "start": 2089.04, "end": 2093.76, "text": "ja bestimmt auch schon mal aufgefallen, dass zum Beispiel das normale Emote, dass das überall"}, {"id": 288, "start": 2093.76, "end": 2099.4, "text": "anders aussieht, so und warum ist das so, weil die unterschiedliche Emoji Schriftarten"}, {"id": 289, "start": 2099.4, "end": 2104.68, "text": "haben oder unterschiedliche Emoji Schriftarten, das ist aber noch nicht der Abfuck, weil der"}, {"id": 290, "start": 2104.68, "end": 2113.52, "text": "eigentliche Code, also das Encoding, CodePoint nennt sich das bei Unicode, ist ja bei allem"}, {"id": 291, "start": 2113.52, "end": 2117.6, "text": "die gleichen, also sprich, wahrgenommen, ich kopiere das jetzt, wenn ich das jetzt hier"}, {"id": 292, "start": 2117.6, "end": 2123.88, "text": "rein mache, sieht das für Windows aus, wenn ich jetzt Steuerung C auf Twitter drücke,"}, {"id": 293, "start": 2123.88, "end": 2129.08, "text": "sieht das nach Twitter-Emote aus, wie auch immer, aber der richtige Abfuck kommt bei"}, {"id": 294, "start": 2129.08, "end": 2136.32, "text": "den Emoji-Fonds, irgendwie müssen ja dann diese CodePoints, also das, was ich hier copypasten"}, {"id": 295, "start": 2136.32, "end": 2142.08, "text": "kann, ich copypaste ja nicht das Emoji, ich copypaste ja quasi das encodete Zeichen, was"}, {"id": 296, "start": 2142.08, "end": 2150.84, "text": "dann mein Font-Renderer zu einem Colored Emoji macht, so das ist ja im Unicode-Standard definiert,"}, {"id": 297, "start": 2150.84, "end": 2156.2, "text": "wir reden jetzt gar nicht von der Sache, ist es UTF-8, UTF-16, UTF-32, lassen wir mal außen"}, {"id": 298, "start": 2156.2, "end": 2161.36, "text": "vor, letztendlich definiert ist das irgendwo im Unicode-Standard und was der riesen Abfuck"}, {"id": 299, "start": 2161.36, "end": 2169.36, "text": "ist, was der riesen Abfuck ist, Emoji-Schriftarten gibt es mindestens, mindestens vier verschiedene"}, {"id": 300, "start": 2169.36, "end": 2178.24, "text": "Standards, wie man in einer Schriftart Pub-Informationen und Colour Emojis speichern kann, weil, müsst"}, {"id": 301, "start": 2178.24, "end": 2183.76, "text": "ihr euch mal vorstellen, eine Schriftart ist ja mal ursprünglich für sowas hier erfunden"}, {"id": 302, "start": 2183.76, "end": 2191.28, "text": "worden, da war noch nichts mit irgendwelchen Emojis, geschweige denn irgendwelchen Colored"}, {"id": 303, "start": 2191.28, "end": 2198.96, "text": "Sachen und auch Farbabstufung, es gibt mindestens vier verschiedene Standards für Colour Emojis,"}, {"id": 304, "start": 2198.96, "end": 2203.76, "text": "es gibt einen von Microsoft, einen von Mozilla, einen von Apple und einen von Adobe, wenn"}, {"id": 305, "start": 2203.76, "end": 2209.84, "text": "ich jetzt nicht ganz falsch bin, und das geht von, wir speichern PNGs, zu wir speichern"}, {"id": 306, "start": 2209.84, "end": 2218.76, "text": "Vektor-Grafiken, zu wir haben mehrere Ebenen, die Overlaid werden, das ist abgrund tiefer"}, {"id": 307, "start": 2218.76, "end": 2226.68, "text": "Abfuck Emoji-Schriftarten, deswegen sieht ja das hier zum Beispiel im Firefox auch anders"}, {"id": 308, "start": 2226.68, "end": 2233.44, "text": "aus und das Firefox-Emoji, ne das ist unter Windows, ach unter Windows verwenden sie mittlerweile"}, {"id": 309, "start": 2233.44, "end": 2240.12, "text": "den Windows-Renderer hier drinnen, wunderbar, weil die hatten mal eine ganze Zeit was eigenes,"}, {"id": 310, "start": 2240.12, "end": 2248.24, "text": "Mozilla hat dieses komische Zeug hier, genau, so und das war eine Zeit lang so, dass das"}, {"id": 311, "start": 2248.24, "end": 2255.8, "text": "Mozilla-Format im Firefox funktioniert hat, aber der Firefox nicht das Windows-Format"}, {"id": 312, "start": 2255.8, "end": 2262.32, "text": "unterstützt hat und sie ihren eigenen Font-Renderer verwendet haben, denn nur das Mozilla-Format"}, {"id": 313, "start": 2262.32, "end": 2270.44, "text": "kann nicht das Windows-Format, es ist schlimm, warte mal, Max, dann machst du ein Wiki für"}, {"id": 314, "start": 2270.44, "end": 2276.68, "text": "Emojis, warum soll ich das machen, gibt's doch schon, so Emoji-Color-Standards, da gibt"}, {"id": 315, "start": 2276.68, "end": 2291.52, "text": "es Color irgendwas, Font, es gibt SVG in OT, genau, das ist Vektor-Grafiken im normalen"}, {"id": 316, "start": 2291.52, "end": 2301.56, "text": "Font, dann gibt es noch irgendwas von Adobe und dann gibt es Apple-Color-Emoji-Standard,"}, {"id": 317, "start": 2301.56, "end": 2309.04, "text": "das ist das was nur Apple kann und sonst keiner, Leute, das ist wieder ein absolutes Minenfeld,"}, {"id": 318, "start": 2309.04, "end": 2313.0, "text": "das ist einfach, also das ist jetzt ganz, ja ich sollte meine Stimme schon, das stimmt,"}, {"id": 319, "start": 2313.0, "end": 2320.6, "text": "es ist wieder ganz eklig, was da für Auswüchse die letzten Jahre über entstanden sind, wusste"}, {"id": 320, "start": 2320.6, "end": 2326.76, "text": "ich jetzt einfach mal los, wenn, also ganz ehrlich, es ist wieder grausam, übrigens"}, {"id": 321, "start": 2326.76, "end": 2332.6, "text": "mal eine Frage an euch, wo wir gerade dabei sind, was ist euer Lieblings-Emoji-Font oder"}, {"id": 322, "start": 2332.6, "end": 2340.04, "text": "sagt mir mal was euer Lieblings-Platform ist, wie die Emojis aussehen, Apple, ich muss"}, {"id": 323, "start": 2340.04, "end": 2348.4, "text": "sagen meine Lieblings-Platform ist Twitter, ich mag Twitter am besten, Twitter oder die"}, {"id": 324, "start": 2348.4, "end": 2357.16, "text": "alten Joy-Pixels, die alten Joy-Pixels waren auch gut, die neuen Joy-Pixels sind doof,"}, {"id": 325, "start": 2357.16, "end": 2363.08, "text": "also ich mag tatsächlich den Twitter-Style mit Abstand am liebsten, den verwende ich"}, {"id": 326, "start": 2363.08, "end": 2373.16, "text": "nämlich auch unter Linux, da gibt es extra 3-Emoji-Font, also ich mag, was ist denn das,"}, {"id": 327, "start": 2373.16, "end": 2379.72, "text": "Monac-S-Emoji, das habe ich ja noch nie gesehen, ist das jetzt auch neu, Moment wir müssen"}, {"id": 328, "start": 2379.72, "end": 2389.24, "text": "mal kurz checken, was im letzten Unicode Standard alles dabei gekommen ist, Monac-S, Leute,"}, {"id": 329, "start": 2389.24, "end": 2405.12, "text": "was ist das, nee Monac-S, nicht Monac-S, Monac-S, was soll das überhaupt sein, Melting-Face,"}, {"id": 330, "start": 2405.12, "end": 2411.32, "text": "Abstand am liebsten, die Emoji-Platform, also ich mag Twitter-Style oder ich mag, also"}, {"id": 331, "start": 2411.32, "end": 2416.92, "text": "die alten Joy-Pixels waren auch gut, die alten, nicht die neuen, die neuen Joy-Pixels mag"}, {"id": 332, "start": 2416.92, "end": 2423.84, "text": "ich nicht, die alten, die alten Joy-Pixels waren gut, was ich nicht, die hatten noch"}, {"id": 333, "start": 2423.84, "end": 2435.28, "text": "bestimmt, haben die nicht noch eine alte Version drinnen, Joy-Pixels, die alten Joy-Pixels"}, {"id": 334, "start": 2435.28, "end": 2441.96, "text": "waren gut, die neuen, die, die neuen, weiß nicht, konnte man hier nicht mal mehrere"}, {"id": 335, "start": 2441.96, "end": 2448.72, "text": "Emoji-Versionen, ah hier, genau, die alten Joy-Pixels fand ich ganz gut, die neuen sind"}, {"id": 336, "start": 2448.72, "end": 2454.92, "text": "nicht so meins, wie gesagt, Twitter, Twitter gefällt mir am besten, was gibt's denn, zeigt"}, {"id": 337, "start": 2454.92, "end": 2463.04, "text": "mal her, Emoji-Version 14, was kam denn da, ups, ups, ups, ups, was kam denn da neues,"}, {"id": 338, "start": 2463.04, "end": 2482.6, "text": "vielleicht sehen wir uns den Apple-Style an, changed, was, das wurde changed, warum, appearance"}, {"id": 339, "start": 2482.6, "end": 2493.44, "text": "of face with hand over mouth to mehr consistent, wie sah das vorher aus bei Apple, ah, ok,"}, {"id": 340, "start": 2493.44, "end": 2503.44, "text": "ich muss sagen, das neue ist besser, also was ist da zugekommen, new added, new, ok, melting"}, {"id": 341, "start": 2503.44, "end": 2518.96, "text": "face, links, was ist das denn, ok, Commodores-Emoji sind am Start, Leute, gibt's jetzt saluting"}, {"id": 342, "start": 2518.96, "end": 2541.4, "text": "face, dotted line face, wozu braucht man denn sowas, face holding back tears, ok, dann"}, {"id": 343, "start": 2541.4, "end": 2552.52, "text": "gibt es Hand nach rechts, Hand nach unten, index finger and thumb crossed, ja gut, das"}, {"id": 344, "start": 2552.52, "end": 2557.28, "text": "ist bestimmt so ne Geste, die gibt es auf der ganzen Welt und heißt was anderes, was"}, {"id": 345, "start": 2557.28, "end": 2564.48, "text": "heißt das bei euch, wenn man Daumen und Zeigefinger reibt, bei mir heißt das Geld, für mich heißt"}, {"id": 346, "start": 2564.48, "end": 2572.8, "text": "es Kohle, Geld, das ist K-Pop-Scheiß, warum ist das K-Pop-Scheiß, machen die da auch"}, {"id": 347, "start": 2572.8, "end": 2584.4, "text": "sowas, das One Direction oder, ne, nicht One Direction, das ist ja kein K-Pop, One Direction"}, {"id": 348, "start": 2584.4, "end": 2592.64, "text": "sind ja die Engländer glaube ich, ne, ok, dann gibt es hier Uncle Sam oder was auch"}, {"id": 349, "start": 2592.64, "end": 2602.04, "text": "immer das sein soll, index pointing and view, ach guck mal, das ist, das ist ein Herz, Hand"}, {"id": 350, "start": 2602.04, "end": 2614.2, "text": "shaking, Lippo beißen, ok, Krone, dann gibt's den fetten Mann oder offiziell der schwangere"}, {"id": 351, "start": 2614.2, "end": 2624.12, "text": "Mann, wisst ihr, Leute, ich hatte letztens, ist das Shrek, ist das Shrek Emote, ne, toll,"}, {"id": 352, "start": 2624.12, "end": 2629.76, "text": "ich hatte ja letztens eine Idee, was endlich mal eingef, nachdem ich dieses Emote gesehen"}, {"id": 353, "start": 2629.76, "end": 2636.12, "text": "hab, dachte ich mir, es wird doch Zeit, guck mal Leute, wir haben jetzt Gender Modifier"}, {"id": 354, "start": 2636.12, "end": 2645.64, "text": "im Unicode, wir haben Color, Skin Color Modifier im Unicode Standard drin, warum gibt es keine"}, {"id": 355, "start": 2645.64, "end": 2658.68, "text": "Body Shape Modifier, warum kann ich nicht sagen, warum kann ich nicht sagen, man, people, wo"}, {"id": 356, "start": 2658.68, "end": 2671.8, "text": "ist das denn, ja, man, ach ne, man, man, warum kann ich nicht sagen, warum kann ich nicht"}, {"id": 357, "start": 2671.8, "end": 2680.92, "text": "sagen, man, man shrugging und dann ein Body Shape Modifier dahinter, dass es Pet Man Shrugging"}, {"id": 358, "start": 2680.92, "end": 2690.12, "text": "ist, also, guck mal, wenn wir so viele Sachen, wenn wir so viele Sachen schon mittlerweile"}, {"id": 359, "start": 2690.12, "end": 2696.08, "text": "im Unicode drin haben, warum gibt es keine Body Shape Modifier, ich mein, ich kann verstehen,"}, {"id": 360, "start": 2696.08, "end": 2700.32, "text": "dass das ziemlich schwierig ist, designtechnisch umzusetzen, aber wenn wir doch jetzt schon,"}, {"id": 361, "start": 2700.32, "end": 2707.56, "text": "wir haben Gender Modifier und wir haben Hauttonen Modifier, also man hat fast, fast alles, um"}, {"id": 362, "start": 2707.56, "end": 2713.76, "text": "irgendwie alles in alles umzuwandeln, warum kein Body Shape Modifier, dann könnte ich"}, {"id": 363, "start": 2713.76, "end": 2722.88, "text": "dann zum Beispiel könnte ich das Emote nehmen, plus, plus den, das ist ja schon, das ist"}, {"id": 364, "start": 2722.88, "end": 2729.6, "text": "Person Shrugging, plus Joiner, plus Male Sign, plus Skin Tone Modifier, kann ich noch machen,"}, {"id": 365, "start": 2729.6, "end": 2740.92, "text": "dann ist es dann keine Ahnung, White Man Shrugging und dann noch Joiner Fat, Fat Body Size Modifier"}, {"id": 366, "start": 2740.92, "end": 2747.32, "text": "und dann BÄM und dann hättest du dann Fat White Male Shrugging da draus gemacht, das"}, {"id": 367, "start": 2747.32, "end": 2757.92, "text": "ist das, was die Welt braucht und dann, ey, kannst du alles machen, könntest du alles"}, {"id": 368, "start": 2757.92, "end": 2770.2, "text": "machen, ne, Bärte, jawoll, es sind keine Grenzen gesetzt, na Hautfarbe, Bartfarbe ist"}, {"id": 369, "start": 2770.2, "end": 2777.6, "text": "relativ einfach, Bartfarbe könntest du mit Bart plus einem Farb Modifier machen, dann"}, {"id": 370, "start": 2777.6, "end": 2780.16, "text": "könntest du nämlich einfach die Skin Tone Modifiers nehmen, ich mein, da kannst du zwar"}, {"id": 371, "start": 2780.16, "end": 2787.44, "text": "keine roten Bart haben, aber, was auch immer, die haben doch sogar Color Modifier, gibt"}, {"id": 372, "start": 2787.44, "end": 2800.96, "text": "es doch auch, oder, naja, wie dem auch sei, so viel zum Thema Emojis, Haarfarbe bin ich"}, {"id": 373, "start": 2800.96, "end": 2816.72, "text": "mir gar nicht sicher, kann sein, ja, mit der Musik los, warum lachen da Leute im Hintergrund,"}, {"id": 374, "start": 2816.72, "end": 2826.68, "text": "da wird nicht gelacht, warum geht los, lachen sie einfach im Hintergrund, Mensch, ja, das"}, {"id": 375, "start": 2826.68, "end": 2833.76, "text": "bräuchte man als E-Mode, exakt, die Designer, die Designer drehen durch, nächstes Stream"}, {"id": 376, "start": 2833.76, "end": 2839.36, "text": "Projekt, sowas kann, das bringt mir im Stream Projekt nix, das muss, das muss auf den Endgeräten"}, {"id": 377, "start": 2839.36, "end": 2851.8, "text": "unterstützt werden, meine, ketzerische Frage, kann, kann Emacs mittlerweile Emojis, das"}, {"id": 378, "start": 2851.8, "end": 2858.88, "text": "muss ich jetzt mal nachgucken, Emacs ist ein Text Editor, muss man nicht kennen, ich weiß"}, {"id": 379, "start": 2858.88, "end": 2866.8, "text": "nur, dass das immer ein, ein richtiger Klaubens, Klaubenskrieg fast war, ob Emacs Emojis bekommen"}, {"id": 380, "start": 2866.8, "end": 2875.44, "text": "soll oder nicht, ne, immer nur noch diesen Fake, das funktioniert nicht, das ist, das"}, {"id": 381, "start": 2875.44, "end": 2881.6, "text": "ist Fake, der, der macht aus Zeichen Bilder, das funktioniert nicht richtig, what the fuck"}, {"id": 382, "start": 2881.6, "end": 2896.92, "text": "ist das, funktioniert nicht, es gibt anscheinend immer noch keine, oh, oh, Leute, seit Ende"}, {"id": 383, "start": 2896.92, "end": 2912.6, "text": "letztem Jahr, Ema hat es aber voll übersteuert, ich habe es direkt hier im Rechthor gehört,"}, {"id": 384, "start": 2912.6, "end": 2915.68, "text": "oh, ja schaut mal da, Emacs 28 hat Color Emoji Support 5 Jahre oder so, nachdem es relevant"}, {"id": 385, "start": 2915.68, "end": 2920.28, "text": "geworden ist, nice, gut verwendet überhaupt noch irgendjemand Emacs, ich habe es eine"}, {"id": 386, "start": 2920.28, "end": 2925.28, "text": "Weile früher verwendet, aber spätestens seit Visual Studio Code quasi JavaScript erweiterbar"}, {"id": 387, "start": 2925.28, "end": 2934.76, "text": "ist, das ist doch der größte Vorteil von Emacs eigentlich mit dahin, ey ist es ja im"}, {"id": 388, "start": 2934.76, "end": 2940.04, "text": "Prinzip jetzt schon, du kannst, du hast so viele Kombinationen an Emojis, die Designer"}, {"id": 389, "start": 2940.04, "end": 2945.72, "text": "müssen, müssen ausflippen, die Designer haben da bestimmt gar keinen Bock mehr drauf,"}, {"id": 390, "start": 2945.72, "end": 2959.8, "text": "du wirfst ja keinen Schatten, weil du im Dunkeln sitzt die ganze Zeit oder, so Hacker"}, {"id": 391, "start": 2959.8, "end": 2971.68, "text": "Man im Keller mit Hoodie auf, die müssen es einfach NFT mäßig machen, NFT mäßig"}, {"id": 392, "start": 2971.68, "end": 2980.04, "text": "machen, du machst einfach 5 Grundtypen und der Rest geht über einen Random Generator"}, {"id": 393, "start": 2980.04, "end": 2996.92, "text": "oder über so ein Kombinations Ding, easy, John Wayner danke für den Tag, ach Leute"}, {"id": 394, "start": 2996.92, "end": 3003.6, "text": "ich habe den Subs wieder nicht nachgeguckt, ich war jetzt so am labern was Color Emojis"}, {"id": 395, "start": 3003.6, "end": 3013.0, "text": "angeht, ich habe wieder die Hälfte übersehen, Creator Dashboard, danke schön für den Sub,"}, {"id": 396, "start": 3013.0, "end": 3018.48, "text": "John Wayner und Filby, dich habe ich schon gesehen Freund, Paul was, danke für den"}, {"id": 397, "start": 3018.48, "end": 3029.76, "text": "Subs, ja ansonsten sehr random gewesen jetzt mit den Emojis, gebe ich zu aber ist mir gerade"}, {"id": 398, "start": 3029.76, "end": 3036.92, "text": "so eingefallen, mir liegt gerade ob ich das andere noch erzählen soll, Paul ist bei mir"}, {"id": 399, "start": 3036.92, "end": 3041.16, "text": "auf der Arbeit, ich erzähle euch ja ab und zu mal immer so ein, entweder erzähle ich"}, {"id": 400, "start": 3041.16, "end": 3044.8, "text": "euch einen Schwank aus meiner Jugend oder ich erzähle euch mal ein paar komische Sachen"}, {"id": 401, "start": 3044.8, "end": 3054.44, "text": "auf der Arbeit, aber diese Woche hatten wir wieder was, da musste ich echt lachen, es"}, {"id": 402, "start": 3054.44, "end": 3059.44, "text": "wird, ich muss das natürlich immer so ein bisschen on the fly anonymisieren, bei uns"}, {"id": 403, "start": 3059.44, "end": 3066.76, "text": "überlegen sie gerade von einem Standort, also von einem gemieteten Rechenzentrum zum"}, {"id": 404, "start": 3066.76, "end": 3072.32, "text": "anderen gemieteten Rechenzentrum ein paar Services umzuziehen, das ist ganz grob der"}, {"id": 405, "start": 3072.32, "end": 3082.36, "text": "Rahmen und das planen die seit Mitte letzten Jahres, so und Anfang der Woche, jetzt halt"}, {"id": 406, "start": 3082.36, "end": 3089.04, "text": "euch auf was, Anfang der Woche kam jemand zu uns und meinte so, ja wie sieht es denn"}, {"id": 407, "start": 3089.04, "end": 3098.36, "text": "mit euren Tätigkeiten für den Standortumzug aus und da haben wir so gesagt, welche Tätigkeiten,"}, {"id": 408, "start": 3098.36, "end": 3105.84, "text": "das hat keiner irgendwas gesagt und dann meinte der so irgendwie, ja aber bis Ende der Woche"}, {"id": 409, "start": 3105.84, "end": 3109.88, "text": "sollen doch die ganzen Systeme schon aufgebaut sein und wir haben gesagt, ne da habe ich"}, {"id": 410, "start": 3109.88, "end": 3114.76, "text": "nichts von gehört und dann meinte der allen Ernstes, ja dann habt ihr jetzt ja noch dreieinhalb"}, {"id": 411, "start": 3114.76, "end": 3122.0, "text": "Tage Zeit, dreieinhalb Tage für 80 Stinger, alles klar, kein Problem machen wir mal nebenbei,"}, {"id": 412, "start": 3122.0, "end": 3129.8, "text": "in dreieinhalb Tagen, so und jetzt passt, sorry nicht 80, 40, 40, 40, so das ist an sich kein"}, {"id": 413, "start": 3129.8, "end": 3135.0, "text": "Ding 40 Systeme aufzubauen, das geht, das geht, aber der Hit war ja dann, der Hit war"}, {"id": 414, "start": 3135.0, "end": 3140.72, "text": "ja dann, haben wir gesagt, ja gut, wenn das so ist, dann soll erstmal hier unser Chef"}, {"id": 415, "start": 3140.72, "end": 3146.28, "text": "sagen, dass wir andere Sachen liegen lassen, liegen lassen sollen und dann nur noch das"}, {"id": 416, "start": 3146.28, "end": 3151.0, "text": "aufbauen, so aber jetzt kam der Hit, jetzt kommt so ne typische, ich würd's euch sonst"}, {"id": 417, "start": 3151.0, "end": 3157.48, "text": "gar nicht erzählen, jetzt kommt so ne typische Business Enterprise Geschichte, so dann hieß"}, {"id": 418, "start": 3157.48, "end": 3163.76, "text": "das wir sollen anfangen und auf einmal dachte ich mir so, ich hatte irgendwie so die Eingebung,"}, {"id": 419, "start": 3163.76, "end": 3168.92, "text": "ich hatte irgendwie so die Eingebung, hey fragst du mal, also die haben zu uns gesagt,"}, {"id": 420, "start": 3168.92, "end": 3175.96, "text": "die haben zu uns gesagt, ja baut das mit höchster Priorität so schnell wie's geht, das ist"}, {"id": 421, "start": 3175.96, "end": 3182.0, "text": "ein Auftrag von unserem Abteilungsdirektor, also quasi viel höher geht's nicht mehr,"}, {"id": 422, "start": 3182.0, "end": 3186.68, "text": "so und dann, da hatte ich so die Eingabe und hab mir gedacht, Moment, Moment, die können"}, {"id": 423, "start": 3186.68, "end": 3190.4, "text": "ja viel erzählen, wenn der Tag lang ist, achso und es wäre auch schon alles genehmigt oder"}, {"id": 424, "start": 3190.4, "end": 3197.48, "text": "sonst was, ich geh mal zu unserem Change Management und frag die, was sie davon halten, dass wir"}, {"id": 425, "start": 3197.48, "end": 3204.72, "text": "jetzt einfach in Netzen, an Standorten, wo auch teilweise produktive Services laufen,"}, {"id": 426, "start": 3204.72, "end": 3209.28, "text": "da am Netz rumspielen und neue Kisten hinstellen und so und ich hab gesagt, ja Change Management,"}, {"id": 427, "start": 3209.28, "end": 3214.28, "text": "das ist ja quasi von unserem Abteilungsdirektor angefragt, ist das aus eurer Sicht okay und"}, {"id": 428, "start": 3214.28, "end": 3221.12, "text": "dann meint die auf einmal zu mir, nein Max, ihr dürft auf gar keinen Fall anfangen, nicht"}, {"id": 429, "start": 3221.12, "end": 3228.48, "text": "diese Woche ist Vorstandssitzung, wenn da irgendwas kaputt geht, die drehen alle durch,"}, {"id": 430, "start": 3228.48, "end": 3231.2, "text": "ihr dürft auf gar keinen Fall was machen, dann hab ich gesagt, ja aber wir haben doch"}, {"id": 431, "start": 3231.2, "end": 3238.24, "text": "nur dreieinhalb Tage, wir haben noch nur dreieinhalb Tage, das aufzubauen, es ist egal, ihr dürft"}, {"id": 432, "start": 3238.24, "end": 3243.6, "text": "auf keinen Fall irgendwas machen, bis grünes Licht ist, so und jetzt ratet mal, also das war,"}, {"id": 433, "start": 3243.6, "end": 3248.04, "text": "Dienstag haben die uns das erzählt und wir hatten damals ja schon nur dreieinhalb Tage,"}, {"id": 434, "start": 3248.04, "end": 3253.16, "text": "das aufzubauen und jetzt ratet mal, wann wir das okay bekommen haben, dass wir es denn jetzt"}, {"id": 435, "start": 3253.16, "end": 3262.0, "text": "machen dürfen, also Dienstag, ich sag mal Dienstag 12 Uhr, Dienstag 12 Uhr habe ich gefragt,"}, {"id": 436, "start": 3262.0, "end": 3267.92, "text": "ob das okay geht und die haben gesagt, sie kümmern sich darum, das okay einzuholen,"}, {"id": 437, "start": 3267.92, "end": 3275.84, "text": "was meint ihr, wann wir das okay gekriegt haben? Der Freitag ist ja erst morgen, nein, Freitag,"}, {"id": 438, "start": 3275.84, "end": 3282.24, "text": "das war die Woche, Freitag ist ja erst morgen, ne, wir haben das im Prinzip gar nicht bekommen,"}, {"id": 439, "start": 3282.24, "end": 3290.24, "text": "wir haben es, es hat einen Tag gedauert, nächsten Tag 14 Uhr und auch nur, weil ich zwischenzeitlich"}, {"id": 440, "start": 3290.24, "end": 3296.2, "text": "mal gefragt habe, ja Jungs, gibt es was neues und dann meinten die so zu mir, ja ja, ist"}, {"id": 441, "start": 3296.2, "end": 3302.0, "text": "genehmigt und dann musste ich noch sagen, ja aber ihr sagt doch selbst, mündliche Aussagen"}, {"id": 442, "start": 3302.0, "end": 3308.0, "text": "sind egal, ich brauche schriftlich quasi einen Change-Antrag, den darf ich für Immersion-Sachen"}, {"id": 443, "start": 3308.0, "end": 3314.0, "text": "selber doch gar nicht machen, haben sie noch was zusammengeklickt, so zumindest, jetzt"}, {"id": 444, "start": 3314.0, "end": 3321.04, "text": "kommt der Hit, es war genehmigt, alles gut, wir wollten anfangen und auf einmal gucken"}, {"id": 445, "start": 3321.04, "end": 3328.84, "text": "wir uns so mal die Netzwerktechnik, die Sache an und stellen fest, ja Moment, die ganzen"}, {"id": 446, "start": 3328.84, "end": 3335.88, "text": "Switch sind falsch konfiguriert, das ist überhaupt nicht im richtigen WLAN, hat das falsche Netz,"}, {"id": 447, "start": 3335.88, "end": 3339.36, "text": "die können da keine Server aufbauen, selbst wenn wir Server aufbauen, die funktionieren"}, {"id": 448, "start": 3339.36, "end": 3351.96, "text": "danach nicht, so und ja, das ist immer noch der aktuelle Stand, also wir haben nicht"}, {"id": 449, "start": 3351.96, "end": 3361.46, "text": "ein System aufgebaut bisher, also wie gesagt, der Auftrag kam irgendwann hier und wir sollen"}, {"id": 450, "start": 3361.46, "end": 3374.92, "text": "fertig sein bis da, also im Prinzip, wir können nichts machen aktuell und dann ist irgendeiner"}, {"id": 451, "start": 3374.92, "end": 3381.36, "text": "der Planungsleuten, der Planungsleute ist dann zu unseren Infrastruktur-Leuten gegangen,"}, {"id": 452, "start": 3381.36, "end": 3387.96, "text": "hat gesagt, ja jetzt, mach doch mal die Netzwerksachen und Switch richtig und dann meinten die Netzwerkleute,"}, {"id": 453, "start": 3387.96, "end": 3398.76, "text": "ja also ab 25. können wir uns darum kümmern, das ist so ein geiler Planungsfail immer und"}, {"id": 454, "start": 3398.76, "end": 3403.76, "text": "ich erzähl euch das, weil ich euch am Ende mal was fragen will jetzt, wir sind doch sicherlich"}, {"id": 455, "start": 3403.76, "end": 3410.0, "text": "nicht die einzigen, wo solche Planungsfails eigentlich an der Tagesordnung sind oder,"}, {"id": 456, "start": 3410.0, "end": 3417.44, "text": "das ist doch bei euch auch manchmal so, gibts zu, weil wenn wir echt die einzigen wären,"}, {"id": 457, "start": 3417.44, "end": 3428.2, "text": "müsste ich mir Gedanken machen, aber ich glaube, das ist eigentlich normal mittlerweile"}, {"id": 458, "start": 3428.2, "end": 3434.44, "text": "bei vielen, gerade umso größer der Laden und umso Business-Enterpreisiger es wirkt,"}, {"id": 459, "start": 3434.44, "end": 3438.56, "text": "übrigens noch eine witzige Geschichte von Microsoft, ihr wisst ja der Microsoft Support"}, {"id": 460, "start": 3438.56, "end": 3447.36, "text": "ist hochgradig useless, wenn man Tickets aufmacht, noch eine Geschichte von Microsoft Support,"}, {"id": 461, "start": 3447.36, "end": 3455.76, "text": "ich hatte euch ja mal erzählt, dass wir seit einer ganzen Weile gezwungen werden und gezwungen"}, {"id": 462, "start": 3455.76, "end": 3462.52, "text": "ist der richtige Satz, weil es möchte von uns keiner, auf allen Systemen inklusive allen"}, {"id": 463, "start": 3462.52, "end": 3477.12, "text": "Linux-Systemen Windows Defender zu installieren, das ist kein Witz, das ist kein Witz, wir"}, {"id": 464, "start": 3477.12, "end": 3483.72, "text": "werden gezwungen Windows Defender zu installieren, wie wird das enforced, naja gut, es gibt eine"}, {"id": 465, "start": 3483.72, "end": 3494.32, "text": "Security-Richtlinie, dass das gemacht werden muss, so und jetzt ist, ich muss das immer"}, {"id": 466, "start": 3494.32, "end": 3504.4, "text": "ein bisschen anonymisieren und jetzt ist vor 1-2 Tagen sind Sachen gecrashed, weil jetzt"}, {"id": 467, "start": 3504.4, "end": 3508.8, "text": "haltet euch fest, der Windows Defender den kompletten Ram belegt hat und das sind fette"}, {"id": 468, "start": 3508.8, "end": 3514.6, "text": "Kisten Leute, das sind richtig fette Kisten, also die Kisten, die wir noch haben im Rechenzentrum,"}, {"id": 469, "start": 3514.6, "end": 3520.36, "text": "die noch nicht in der Cloud sind, das sind richtig fette Kisten, das geht von, das geht"}, {"id": 470, "start": 3520.36, "end": 3531.24, "text": "bei 128 GB Ram los, das geht rauf bis 2 TB Ram und teilweise mehr, das ist richtig heftig"}, {"id": 471, "start": 3531.24, "end": 3535.88, "text": "und der Windows Defender hat dafür gesorgt, dass ein paar Sachen crashen, weil der Ram"}, {"id": 472, "start": 3535.88, "end": 3544.8, "text": "voll ist, zumindest daraufhin Ticket gemacht, also nicht ich, sondern ich habe es nur mitbekommen,"}, {"id": 473, "start": 3544.8, "end": 3554.16, "text": "es wurde ein Ticket gemacht bei Microsoft und Microsoft sagt, nein, können wir euch"}, {"id": 474, "start": 3554.16, "end": 3560.08, "text": "nicht helfen, weil ihr habt nicht die letzte Windows Defender Version, wisst ihr was wir"}, {"id": 475, "start": 3560.08, "end": 3567.84, "text": "haben, wir haben die vorletzte Windows Defender Version, also es ist jetzt irgendwie Punkt"}, {"id": 476, "start": 3567.84, "end": 3578.0, "text": "60, Punkt 140 oder so Version und wir haben 60, Punkt 139, also die unsere Version ist,"}, {"id": 477, "start": 3578.0, "end": 3589.72, "text": "was weiß ich, eine Woche allen oder so und Microsoft hat gesagt, bevor ihr euch an uns"}, {"id": 478, "start": 3589.72, "end": 3597.04, "text": "wenden könnt und Support bekommt, ihr müsst alles upgraden, also ich weiß nicht, also"}, {"id": 479, "start": 3597.04, "end": 3608.0, "text": "dieser Support, ja eine Woche End of Life, stellt euch das mal vor, das muss man verkaufen"}, {"id": 480, "start": 3608.0, "end": 3616.04, "text": "irgendwo, eine Woche End of Life, das ist so eine Rolling Version von Microsoft, ist schon"}, {"id": 481, "start": 3616.04, "end": 3622.52, "text": "echt lächerlich man, übrigens zum Thema Log Files, der Windows Defender, das ist wirklich"}, {"id": 482, "start": 3622.52, "end": 3630.76, "text": "absolute Kack Software, der loggt auf Systemen, wenn verdächtige Sachen passieren und schickt"}, {"id": 483, "start": 3630.76, "end": 3638.36, "text": "das dann an irgendeinen Log Storage in Azure und eines Tages ruft mich ein Kollege auf"}, {"id": 484, "start": 3638.36, "end": 3646.12, "text": "eine Arbeit so an und meint, Max guck mal hier, ich share mal kurz mein Screen, zeigt der"}, {"id": 485, "start": 3646.12, "end": 3661.44, "text": "mir das so und meint er so, sag mal Max ist das dein Passwort? Ja, das ist mein Passwort,"}, {"id": 486, "start": 3661.44, "end": 3666.96, "text": "aber es war zum Glück nicht das Passwort von meinem Hauptbenutzer Account, das Ding hat"}, {"id": 487, "start": 3666.96, "end": 3674.88, "text": "einfach mein Passwort gelockt, mitten im Log stand mein Passwort drin, das muss man sich"}, {"id": 488, "start": 3674.88, "end": 3682.4, "text": "mal vorstellen, so eine Kack Software man, das ist absolute Hypercrap ist das wirklich,"}, {"id": 489, "start": 3682.4, "end": 3688.16, "text": "ich glaube ihr wollt keinen Windows Defender haben, da braucht ihr keine russischen Hacker"}, {"id": 490, "start": 3688.16, "end": 3704.2, "text": "dafür, Microsoft alleine reicht das schon, dann besser Kaspersky, da wird jetzt gewarnt"}, {"id": 491, "start": 3704.2, "end": 3719.88, "text": "vor Kaspersky, da wird gewarnt, wir können ja mal Tipps abgeben, wie viele Server wir"}, {"id": 492, "start": 3719.88, "end": 3724.88, "text": "schaffen morgen aufzubauen, ne schaffen wir ja gar nicht, weil die stellen ja erst zum"}, {"id": 493, "start": 3724.88, "end": 3736.08, "text": "25. Also ich hab jetzt auf Heise gelesen, ich dachte mir das ist ein Witz, aber Kaspersky"}, {"id": 494, "start": 3736.08, "end": 3741.96, "text": "sagt übrigens offiziell, sie haben noch nie mit der russischen Regierung zusammen gearbeitet,"}, {"id": 495, "start": 3741.96, "end": 3746.56, "text": "die Sache ist halt die, das würde jeder sagen, selbst wenn er mit der russischen Regierung"}, {"id": 496, "start": 3746.56, "end": 3754.84, "text": "zusammen arbeitet, oder meint ihr das sagt jemand groß, wenn du die fragst, also geht"}, {"id": 497, "start": 3754.84, "end": 3759.92, "text": "bei denen wirklich irgendjemand davon aus, dass wenn du einen russischen Antivirenhersteller"}, {"id": 498, "start": 3759.92, "end": 3766.2, "text": "fragst, sagt mal, arbeitet ihr mit der russischen Regierung zusammen, dass der dann sagt, ach"}, {"id": 499, "start": 3766.2, "end": 3773.28, "text": "jetzt wo ihr fragt, ja klar machen wir das, wir haben nicht dran gedacht euch das zu sagen,"}, {"id": 500, "start": 3773.28, "end": 3778.44, "text": "aber jetzt wo ihr fragt, jetzt natürlich, ganz was mit Schwachsinn, ja hab ich hier"}, {"id": 501, "start": 3778.44, "end": 3792.24, "text": "bei Heise gelesen, Kaspersky, was ist denn mit Kaspersky, warte mal, ich weiß nicht,"}, {"id": 502, "start": 3792.24, "end": 3797.52, "text": "was die hier geschrieben haben, Kaspersky, BSI waren von Kaspersky, siehe jetzt Antivirensoftware,"}, {"id": 503, "start": 3797.52, "end": 3807.36, "text": "ja, Kaspersky hat jahrelang mit dem BSI, die haben wahrscheinlich mit mehr oder weniger"}, {"id": 504, "start": 3807.36, "end": 3813.2, "text": "jedem zusammengearbeitet, es gab ja auch ein Paper, weiß nicht, ob man das in dem Zusammenhang"}, {"id": 505, "start": 3813.2, "end": 3825.0, "text": "so nennt, aber ein Dokument von, fragt mich nicht, CIA, FBI, irgend so einem Kekona-3-Buchstaben-Ding,"}, {"id": 506, "start": 3825.0, "end": 3831.88, "text": "gab es zum Anfang von diesem Konflikt in der Ukraine, gab es, also noch bevor die Russen"}, {"id": 507, "start": 3831.88, "end": 3841.68, "text": "angegriffen haben, gab es ein Dokument, wo quasi gewarnt wurde vor Angriffen von russischen"}, {"id": 508, "start": 3841.68, "end": 3849.08, "text": "Hackern und die Sicherheitslücken, die da drin standen, da dachte ich mir auch so, wahrscheinlich"}, {"id": 509, "start": 3849.08, "end": 3852.84, "text": "hat das weniger was mit russischen Hackern zu tun, sondern die haben einfach ein Best"}, {"id": 510, "start": 3852.84, "end": 3858.44, "text": "of ihre eigenen Dinger genommen, die sie gerne verwenden, um andere anzugreifen und haben"}, {"id": 511, "start": 3858.44, "end": 3862.44, "text": "sich wahrscheinlich gedacht, ey, den Scheiß haben wir vor drei Jahren verwendet, das werden"}, {"id": 512, "start": 3862.44, "end": 3867.12, "text": "die Russen bestimmt auch verwenden, haben das einfach mal in so ein Paper reingehauen,"}, {"id": 513, "start": 3867.12, "end": 3872.24, "text": "da standen Dinger drinne, Leute, ich muss mal gucken, ob ich das jetzt finde, da standen"}, {"id": 514, "start": 3872.24, "end": 3881.16, "text": "Dinger drin, ist ja aber auch egal, Outlook-Sachen von 2017 oder irgendwie sowas und Shitrix-Sachen"}, {"id": 515, "start": 3881.16, "end": 3888.6, "text": "von 2016 und sowas, da hab ich mir auch gedacht, wenn das jetzt noch einer ungepatcht betreibt,"}, {"id": 516, "start": 3888.6, "end": 3891.76, "text": "dann hat er schon längst Probleme, lange bevor irgendwelche russischen Hacker anrücken."}, {"id": 517, "start": 3891.76, "end": 3896.52, "text": "Wie ist eigentlich so euer Eindruck?"}, {"id": 518, "start": 3896.52, "end": 3907.24, "text": "Ich weiß, wir haben hier sehr viele IT-Interessierte, es wurde ja am Anfang ein Riesenwind gemacht"}, {"id": 519, "start": 3907.24, "end": 3918.44, "text": "von Panik, also auch öffentlich, vor russischen Cyber-Angriffen, jetzt Ukraine-Krieg oder generell"}, {"id": 520, "start": 3918.44, "end": 3930.76, "text": "jetzt durch die Russen, da wurde mega Panik geschoben, mal ganz im Ernst, also so wirklich"}, {"id": 521, "start": 3930.76, "end": 3938.08, "text": "wahnsinnig viel ist jetzt da nicht gewesen, oder?"}, {"id": 522, "start": 3938.08, "end": 3943.76, "text": "Also das hält sich doch alles stark in Grenzen, also es gibt kaum Meldungen darüber, dass"}, {"id": 523, "start": 3943.76, "end": 3947.12, "text": "hier irgendwelche Angriffe und wahrscheinlich sind das Angriffe, die sie gegeben hätte,"}, {"id": 524, "start": 3947.12, "end": 3953.0, "text": "auf irgendwelche deutschen Unternehmen versucht werden bzw. vielleicht sogar erfolgreich"}, {"id": 525, "start": 3953.0, "end": 3959.56, "text": "sind, es gibt immer mal wieder was, aber ansonsten, also im Vergleich zu dem Panik, also als das"}, {"id": 526, "start": 3959.56, "end": 3964.4, "text": "losging in der Ukraine, da hast du ja das Gefühl gehabt, die Russen haben irgendwie quasi 50"}, {"id": 527, "start": 3964.4, "end": 3973.96, "text": "Millionen Hacker, die nur drauf warten, alles auf der Welt anzulegen, ja, die Russen selber"}, {"id": 528, "start": 3973.96, "end": 3977.72, "text": "kriegen es ja fast schon fast noch mehr ab als umgedreht, was Computer-Security-Sachen"}, {"id": 529, "start": 3977.72, "end": 3989.52, "text": "angeht, aber es ist, also entweder sagt einfach keiner was, wenn er betroffen war, aber ansonsten,"}, {"id": 530, "start": 3989.52, "end": 3994.76, "text": "also es ist null mit dem vergleichbar, wie das am Anfang hochgehyped wurde, wo du gedacht"}, {"id": 531, "start": 3994.76, "end": 3998.52, "text": "hast, jetzt kommt gleich aus jedem Gulli kommt ein russischer Hacker mit seinem Laptop raus"}, {"id": 532, "start": 3998.52, "end": 4005.5, "text": "quasi, es ist im Prinzip genauso wie vorher, die meisten Angriffe kamen, also gerade diese"}, {"id": 533, "start": 4005.5, "end": 4009.96, "text": "meisten random, wir versuchen bei alle Passwörter durch und sowas, die meisten Sachen kamen"}, {"id": 534, "start": 4009.96, "end": 4015.84, "text": "doch früher auch schon aus Russland oder aus China, ja oder den üblichen Verdächtigen,"}, {"id": 535, "start": 4015.84, "end": 4031.28, "text": "BPN in den Iran oder so, ging auch gut, aber ansonsten, viel hat sich da auch nicht anders"}, {"id": 536, "start": 4031.28, "end": 4045.8, "text": "aus, also viel verändert, viel verändert hat sich da nichts, naja, ich hoffe auch, dass"}, {"id": 537, "start": 4045.8, "end": 4049.12, "text": "dann, ja wie gesagt, ich hoffe auch, dass da nichts mehr großartig kommt, weil sonst wollen"}, {"id": 538, "start": 4049.12, "end": 4052.04, "text": "die Leute im Zweifelsfall auf der Arbeit noch, dass wir am Wochenende arbeiten müssen oder"}, {"id": 539, "start": 4052.04, "end": 4060.32, "text": "sowas, weil die russischen Neckarmens unterwegs sind, nee nee, ich glaube es geht los, wieso"}, {"id": 540, "start": 4060.32, "end": 4064.68, "text": "hast du so viele Tabs offen, Moment, ich habe nicht nur viele Tabs offen, ich habe sehr"}, {"id": 541, "start": 4064.68, "end": 4070.2, "text": "viele Tabs offen, ich habe zwei Browser auf mit Tabs und wenn ich meine VM starte, dann"}, {"id": 542, "start": 4070.2, "end": 4080.16, "text": "habe ich dort auch nochmal 40 Tabs offen, oh nee, die VM ist abgekackt, nee, die VM läuft,"}, {"id": 543, "start": 4080.16, "end": 4087.36, "text": "aber die ist nicht auf dem Browser, was hat das mit dem Lidl Tab auf sich, eine Zigbee"}, {"id": 544, "start": 4087.36, "end": 4092.52, "text": "Steckdosenleiste, die ich mal ausprobieren wollte, aber nie bestellt habe, genauso wie"}, {"id": 545, "start": 4092.52, "end": 4099.28, "text": "mit dem Ikea Tab, im Ikea Tab hat irgendjemand letztens gesagt, Ikea hat ja das Gaming Möbel,"}, {"id": 546, "start": 4099.28, "end": 4117.36, "text": "das war mir so nicht klar, dass Ikea jetzt Gaming Möbel hat, nee nee, ich mag Tabs,"}, {"id": 547, "start": 4117.36, "end": 4133.12, "text": "man hat genug Tabs, wenn man den Text nicht mehr lesen kann, dann ist es gar nicht gut,"}, {"id": 548, "start": 4133.12, "end": 4139.08, "text": "eine Stunde spielt kein Stream richtig, ja wie gesagt, ich sage nicht, dass es gar nichts"}, {"id": 549, "start": 4139.08, "end": 4145.88, "text": "gab, es kommt schon immer mal wieder was, aber es ist jetzt bei weitem nicht das Riesending,"}, {"id": 550, "start": 4145.88, "end": 4152.2, "text": "was am Anfang herbeigeredet wurde, mein armer Desktop, warum, der Desktop ist doch, das"}, {"id": 551, "start": 4152.2, "end": 4157.76, "text": "ist halt ein Ordner und in diesem Ordner sind halt ganz viele Sachen drin, mein Ordner hat"}, {"id": 552, "start": 4157.76, "end": 4163.2, "text": "vom Namen her was ordentliches, aber das heißt ja nicht, dass es in einem Ordner alles ordentlich"}, {"id": 553, "start": 4163.2, "end": 4191.36, "text": "sein muss, ach jetzt ein bisschen, jawoll, genau, genau der, wusste gar nicht, dass ich"}, {"id": 554, "start": 4191.36, "end": 4198.48, "text": "den als Emote drinne hab, oder ist das dein Personal Emote, was ist das Thema vom neuen"}, {"id": 555, "start": 4198.48, "end": 4204.04, "text": "Video, ich hab tatsächlich 5-6 Sachen schon, auch mit Text, ich baue mir Textdokumente,"}, {"id": 556, "start": 4204.04, "end": 4208.4, "text": "wo ich da reinschreibe, was ich sagen will, aber solange mir der Hals weh tut, habe ich"}, {"id": 557, "start": 4208.4, "end": 4215.28, "text": "wenig Motivation gerade aufzunehmen, ja hab ich, und ich hab eine richtig lange Liste"}, {"id": 558, "start": 4215.28, "end": 4219.36, "text": "mit Ideen, ohne dass ich jetzt konkret da schon ein bisschen was zu geschrieben hab,"}, {"id": 559, "start": 4219.36, "end": 4235.08, "text": "also Videoinhalte und Ideen hab ich tatsächlich genug, ja aber echt so, ok, du meinst das"}, {"id": 560, "start": 4235.08, "end": 4244.0, "text": "Ding hier von Lidl, ja das hat mir der Chat empfohlen und ich wollte das ja auch mal ausprobieren,"}, {"id": 561, "start": 4244.0, "end": 4249.96, "text": "weil es immer weniger Steckdosen gibt, die Tasmota flashbar sind, und da ist so eine"}, {"id": 562, "start": 4249.96, "end": 4253.8, "text": "Zigbee Steckdose was naheliegendes und das wird ja auch dann in Zukunft, wird es das"}, {"id": 563, "start": 4253.8, "end": 4283.08, "text": "weitergeben, ja, wird es das"}, {"id": 564, "start": 4283.08, "end": 4292.04, "text": "weitergeben wenn Meta 2030 kommt, ja Meta ist ja unten drunter auch quasi unter anderem"}, {"id": 565, "start": 4292.04, "end": 4301.68, "text": "Zigbee, Seawave wird ein bisschen Probleme bekommen, Leute ich merke gerade, ich übersteuere"}, {"id": 566, "start": 4301.68, "end": 4310.88, "text": "ein bisschen, das liegt daran, ich hab hier einen neuen Pop-Schutz, das hört ihr nicht"}, {"id": 567, "start": 4310.88, "end": 4318.6, "text": "so krass, weil ich das hier limitiert hab, aber man hört es daran, ich hörs bei mir"}, {"id": 568, "start": 4318.6, "end": 4323.56, "text": "auf dem Ohr, das liegt daran, ich hab einen neuen Pop-Schutz, ich hab mir nämlich aus"}, {"id": 569, "start": 4323.56, "end": 4329.92, "text": "einem Autoschwamm und einem Kabelbinder einen neuen Pop-Schutz, also Teppichmesser, Schwamm"}, {"id": 570, "start": 4329.92, "end": 4336.76, "text": "fürs Auto, Kabelbinder, hab ich mir einen Pop-Schutz aus dem Schwamm rausgeschnitten,"}, {"id": 571, "start": 4336.76, "end": 4341.48, "text": "hab über das Mikrofon drüber gezogen, hab mit dem Kabelbinder zusammen gezogen, das"}, {"id": 572, "start": 4341.48, "end": 4351.52, "text": "ist besser das Ding hier, besser als der offizielle Pop-Schutz vom Headset Mikro, ich mein es"}, {"id": 573, "start": 4351.52, "end": 4355.64, "text": "sieht ein bisschen kacke aus, ich hab jetzt ein grau-schwarzes Headset, also ich hab hier"}, {"id": 574, "start": 4355.64, "end": 4371.76, "text": "so ein Ding, ich hab die erste Ausgabe, first gen hab ich, das da, ich hab so ein grau-schwarzes"}, {"id": 575, "start": 4371.76, "end": 4390.68, "text": "Headset und ich hab einen gelben Pop-Schutz dran, aber wen interessiert die Optik, was"}, {"id": 576, "start": 4390.68, "end": 4402.96, "text": "für eine Soundkarte hast du, äh, onboard, ach Moment, du spielst ja so, ne ne, also"}, {"id": 577, "start": 4402.96, "end": 4408.12, "text": "ich hab ne onboard Soundkarte, aber die hab ich mit, die hab ich per optischem Kabel"}, {"id": 578, "start": 4408.12, "end": 4417.12, "text": "mit meinem Audiointerface verboten, als Audiointerface hab ich das da, als Audiointerface hab ich"}, {"id": 579, "start": 4417.12, "end": 4432.72, "text": "das da, so und da gehen auch die Mikros drüber, das reicht aus fürs Headset, ne, für das"}, {"id": 580, "start": 4432.72, "end": 4443.48, "text": "Headset hab ich noch einen anderen kleinen Mix-Amp, aber es geht alles an das Audiointerface,"}, {"id": 581, "start": 4443.48, "end": 4448.6, "text": "ich habe eine Vue-Beautify-Web-App, die ich gerne, oh, dann hast du jetzt auch, dann hast"}, {"id": 582, "start": 4448.6, "end": 4458.84, "text": "du jetzt auch, ähm, die, wann hast du zuletzt, wann hast du zuletzt NPM-Update da drin gemacht"}, {"id": 583, "start": 4458.84, "end": 4473.0, "text": "oder NPM-Install oder sowas, dann interessiert dich bestimmt das da, die haben nämlich in"}, {"id": 584, "start": 4473.0, "end": 4481.28, "text": "einer Dependency von Vue CLI, haben die, also das ist, eine Dependency von Vue CLI, ist"}, {"id": 585, "start": 4481.28, "end": 4489.72, "text": "quasi eine, wie wir das in ein paar Videos sagen, Schadware drinne, die guckt ob du eine"}, {"id": 586, "start": 4489.72, "end": 4498.36, "text": "russische Public-IP hast oder eine weißrussische Public-IP und dann löscht seine Platte."}, {"id": 587, "start": 4498.36, "end": 4514.56, "text": "So, was war jetzt aber die eigentliche Frage, ähm, ich habe eine Vue-Beautify-Web-App,"}, {"id": 588, "start": 4514.56, "end": 4521.2, "text": "die ich gerne easy auf meinem Windows-Ordner aus surfen, sowas wie Exe im Projektfolger,"}, {"id": 589, "start": 4521.2, "end": 4533.84, "text": "da kann ich jetzt nicht mit, ach du hast eine Web, du brauchst einfach, du musst einfach"}, {"id": 590, "start": 4533.84, "end": 4539.96, "text": "quasi deine Index-HTML ausliefern im Endeffekt, äh, wenn, also das kannst du mit jeder x-beliebigen"}, {"id": 591, "start": 4539.96, "end": 4544.28, "text": "Kiste, die Python drauf installiert hat, machen, da kannst du nämlich einfach sagen, falls"}, {"id": 592, "start": 4544.28, "end": 4548.24, "text": "du, ne, aber das ist Windows, ne, das ist Windows, dann, dann nicht, äh, du bräuchst"}, {"id": 593, "start": 4548.24, "end": 4552.8, "text": "jetzt irgendeinen Ad-hoc-Web-Server-Ding, pff, weiß ich nicht, was es da für Windows"}, {"id": 594, "start": 4552.8, "end": 4561.48, "text": "gibt, gibt sicherlich 30 Millionen NPM-Packages für, also wenn du einen Python-Interpreter"}, {"id": 595, "start": 4561.48, "end": 4572.8, "text": "hast, ist das ziemlich easy, das ist eine Zeile, das damit zu starten, ach ja, das ist ganz"}, {"id": 596, "start": 4572.8, "end": 4582.44, "text": "gut hier, die Seite, guck mal, also was ich meine, ist das hier, also wenn du, wenn du"}, {"id": 597, "start": 4582.44, "end": 4586.24, "text": "einen Python-Interpreter drauf hast, ist das mega simple, dann führst du das aus und der"}, {"id": 598, "start": 4586.24, "end": 4591.56, "text": "surft einfach alles im aktuellen Verzeichnis, wenn du Sachen wie Websocket-Support brauchst"}, {"id": 599, "start": 4591.56, "end": 4597.28, "text": "und sowas, dann ist es glaub ich ein bisschen komplizierter, was gibt's denn sonst noch,"}, {"id": 600, "start": 4597.28, "end": 4610.48, "text": "äh, Ruby, Ruby, im Endeffekt muss das für eine Lion sein, ach so, ja, dann liefer ihm"}, {"id": 601, "start": 4610.48, "end": 4615.08, "text": "doch irgendwas mit, dann schicke ihm irgendwas, dann brauchst du irgendeine Echse, die du"}, {"id": 602, "start": 4615.08, "end": 4621.12, "text": "ausführst und alles im aktuellen Verzeichnis surft, da fällt mir aber für Windows nix"}, {"id": 603, "start": 4621.12, "end": 4630.68, "text": "hin, keine Ahnung, es gibt doch bestimmt irgendeine, ich meine, im Prinzip ist es, ist es eine"}, {"id": 604, "start": 4630.68, "end": 4639.56, "text": "3-Zeilen-Dotnet-Anwendung, ja, die man auch als Echse verpacken kann, da gibt's bestimmt"}, {"id": 605, "start": 4639.56, "end": 4647.28, "text": "was Fertiges für, hat nicht irgendjemand was gepostet, sogar vor eben gerade, irgendwas"}, {"id": 606, "start": 4647.28, "end": 4661.68, "text": "mit Desktop, ach ne, Convert tut, ne, das ist was anderes, ne, ne, das, das, das willst"}, {"id": 607, "start": 4661.68, "end": 4673.96, "text": "du ja nicht, du nutzt doch E3 unter Linux, ja, mach ich, Arch, by the way, benutze ich,"}, {"id": 608, "start": 4673.96, "end": 4685.76, "text": "wobei ich weiß nicht, ob man als Manjaro-Benutzer sagen darf, ich benutze Arch, haben wir noch"}, {"id": 609, "start": 4685.76, "end": 4692.24, "text": "nicht gesehen, es wird immer schlechter, Alter, es wird immer schlechter, wenn man denkt,"}, {"id": 610, "start": 4692.24, "end": 4696.56, "text": "es kann nicht mal schlechter werden, dann kommt, dann kommt ein neuer Tag Battlefield"}, {"id": 611, "start": 4696.56, "end": 4709.44, "text": "2242, Alter, haha, das war schlecht, guck mal, wisst ihr was auch das witzig ist, Weihnachten,"}, {"id": 612, "start": 4709.44, "end": 4718.04, "text": "Weihnachten, guck mal, fucking Weihnachten, es, normalerweise gibt es bei Spielen zu Weihnachten"}, {"id": 613, "start": 4718.04, "end": 4726.92, "text": "immer so Hup, ein, ein, ein Piek, aber hier gibt es zu Weihnachten ein Dip, das schafft"}, {"id": 614, "start": 4726.92, "end": 4734.88, "text": "auch nur Battlefield, ähm, wo wir gerade dabei sind, was macht denn mein anderes Sorgen-Kind,"}, {"id": 615, "start": 4734.88, "end": 4744.4, "text": "New World, Alter, unter 30.000 jetzt gefallen, so schlecht, so schlecht, das ist auch so"}, {"id": 616, "start": 4744.4, "end": 4751.8, "text": "komplette Totgeburt, das Ding, man darf nicht vergessen, es wurde im November released, November"}, {"id": 617, "start": 4751.8, "end": 4760.32, "text": "release, das Spiel ist kein halbes Jahr alt, also, ja, Origin weiß man die Spielzahlen"}, {"id": 618, "start": 4760.32, "end": 4778.72, "text": "nicht, ja, du brauchst im Endeffekt irgendeinen Single-File-Web-Server, ne, du willst halt"}, {"id": 619, "start": 4778.72, "end": 4784.6, "text": "einfach eine Exe anklicken, die einen Web-Server vom aktuellen Verzeichnis startet, da gibt"}, {"id": 620, "start": 4784.6, "end": 4789.84, "text": "es garantiert was, mir fällt aber für Windows nichts ein, ansonsten, wie gesagt, irgendeine"}, {"id": 621, "start": 4789.84, "end": 4802.24, "text": "ex-beliebische Dornett-Anwendung, fünf Zeilen, dann als Exe verpackt, wer ist das andere"}, {"id": 622, "start": 4802.24, "end": 4807.6, "text": "Amazon, Lost Ark, ja gut, Lost, ne, Lost Ark ist ja nicht von Amazon, Lost Ark ist ja nur"}, {"id": 623, "start": 4807.6, "end": 4813.24, "text": "von Amazon hier vertrieben, Lost Ark, dem geht's, glaub ich, ganz gut, hat natürlich"}, {"id": 624, "start": 4813.24, "end": 4826.2, "text": "auch Einbrüche, was aber ja noch relativ normal ist, oh, ich weiß nicht, wie das mit"}, {"id": 625, "start": 4826.2, "end": 4831.36, "text": "dem Endgame aussieht in Lost Ark, muss ich sagen, spielt jemand von euch Lost Ark, also"}, {"id": 626, "start": 4831.36, "end": 4836.6, "text": "ist das ein MMO, was man theoretisch auch zwei, drei Jahre spielen könnte und trotzdem"}, {"id": 627, "start": 4836.6, "end": 4850.36, "text": "was zu tun hat, dass das bei 1,3 Millionen jetzt innerhalb von einem Monat bei einem"}, {"id": 628, "start": 4850.36, "end": 4862.64, "text": "MMO viele wegrennen ist, ja, ist jetzt nichts ungewöhnliches, wobei, ich mein, ein Drittel,"}, {"id": 629, "start": 4862.64, "end": 4867.8, "text": "also quasi, die haben ja auch schon, wenn du so willst, zwei Drittel der Spieler verloren"}, {"id": 630, "start": 4867.8, "end": 4877.88, "text": "jetzt, das ist natürlich schon heftig, aber gerade bei MMOs, aber Halo Infinite läuft"}, {"id": 631, "start": 4877.88, "end": 4892.76, "text": "auch nicht so gut, Halo läuft auch nicht mal so gut, aber hier, das ist auch ziemlich"}, {"id": 632, "start": 4892.76, "end": 4903.44, "text": "am abkacken, also es ist im Prinzip alles am abkacken, so von den, von manchen Hoffnungsträgern"}, {"id": 633, "start": 4903.44, "end": 4913.0, "text": "des letzten Jahres, aber ich weiß, ich weiß, das sagt EA, ich kenne diese Geschichte mit,"}, {"id": 634, "start": 4913.0, "end": 4917.04, "text": "Halo war so polish, deswegen haben die Leute lieber Halo gespielt als Battlefield, was"}, {"id": 635, "start": 4917.04, "end": 4919.84, "text": "eine bescheuerte Ausrede, Alter, wirklich, das ist richtig hängen geblieben."}, {"id": 636, "start": 4919.84, "end": 4939.2, "text": "Wollen wir mal gucken, was Cyberpunk hat?"}, {"id": 637, "start": 4939.2, "end": 4949.16, "text": "Es gibt Spiele, die will ich gar nicht anklicken, das Cyberpunk Sex Simulator, man sollte nicht"}, {"id": 638, "start": 4949.16, "end": 4967.04, "text": "so sehr nach Sachen suchen, Hentai Cyberpunk, das beste Spiel ist immer noch, was mich höchst"}, {"id": 639, "start": 4967.04, "end": 4986.44, "text": "verstört hat, über den Titel, das beste Spiel ist immer noch, der Chair Fucking Simulator,"}, {"id": 640, "start": 4986.44, "end": 4998.0, "text": "das ist so gestört, Alter, was es alles gibt, das ist kein Witz, das ist ein offizielles"}, {"id": 641, "start": 4998.0, "end": 5022.96, "text": "Game of Steam, der Chair Fucking Simulator, da werden die Chairs gefuckt, es gab sogar"}, {"id": 642, "start": 5022.96, "end": 5046.52, "text": "ein Update für den Chair Fucking Simulator, so sieht das Gameplay dann aus am Ende, wollen"}, {"id": 643, "start": 5046.52, "end": 5073.6, "text": "wir mal gucken, ob das auf Twitch schon mal irgendjemand gespielt hat, Chair, ne, es hat"}, {"id": 644, "start": 5073.6, "end": 5082.32, "text": "noch niemand den Chair Fucking Simulator gespielt auf Twitch, mega Toss, da passiert ja nichts,"}, {"id": 645, "start": 5082.32, "end": 5089.44, "text": "es sind Stühle, aber was sich alles gibt, so, was wollte ich, genau Cyberpunk wollte"}, {"id": 646, "start": 5089.44, "end": 5096.16, "text": "jemand, dass ich gucke, naja, guck mal, es spielen mehr Leute Cyberpunk, also es spielen"}, {"id": 647, "start": 5096.16, "end": 5121.72, "text": "mehr Leute Cyberpunk als Battlefield 2047 auf Steam, nicht schlecht, was, es gab einen"}, {"id": 648, "start": 5121.72, "end": 5136.68, "text": "großen Patch, okay, naja, ja, ja klar, bei den ganzen Stats kommen auch die GOG Leute"}, {"id": 649, "start": 5136.68, "end": 5140.84, "text": "drauf, es ist ja auch kein, bei Battlefield ist ja auch kein Origin drin, also du kannst"}, {"id": 650, "start": 5140.84, "end": 5149.0, "text": "von ausgehen, dass die echten Spieler zahlen, naja, ich glaube eine Null dran hängen können"}, {"id": 651, "start": 5149.0, "end": 5157.84, "text": "wir nicht, aber nimm es mal, mal 3 oder so auf dem PC, vielleicht, vielleicht, ja, so"}, {"id": 652, "start": 5157.84, "end": 5163.84, "text": "sind wir so bei 7000 ungefähr, was halt immer noch lächerlich ist, die Leute finden doch"}, {"id": 653, "start": 5163.84, "end": 5177.16, "text": "jetzt schon keine Server mehr, ohne Bots und Portal ist eh komplett dead, übrigens Leute,"}, {"id": 654, "start": 5177.16, "end": 5190.56, "text": "wisst ihr, ähm, Moment, wisst ihr woran man merkt, dass immer mehr Gamer mittlerweile"}, {"id": 655, "start": 5190.56, "end": 5202.16, "text": "im Berufsalltag bzw. in normalen Positionen angekommen sind, es hat jemand gepostet letztens"}, {"id": 656, "start": 5202.16, "end": 5207.76, "text": "in einem Teams Channel, also nicht in einem Chat, sondern Teams Channel, hat gemeint hier,"}, {"id": 657, "start": 5207.76, "end": 5216.84, "text": "System XY wird jetzt abgeschaltet, so und ich hab dann dieses Bild hier gepostet, Sekunde,"}, {"id": 658, "start": 5216.84, "end": 5233.04, "text": "Copy Image, ich hab dann dieses, hallo, ich möchte, ich will was kopieren, ja, ich will"}, {"id": 659, "start": 5233.04, "end": 5238.2, "text": "was kopieren, kann halt so schwierig sein, genau, ich hab dann dieses Image gepostet"}, {"id": 660, "start": 5238.2, "end": 5246.04, "text": "in den Chat und hat Instant gleich Emotes Reactions bekommen, also sprich wir haben Leute"}, {"id": 661, "start": 5246.04, "end": 5253.68, "text": "auf der Arbeit, die dieses Bild verstehen, wenn es darum geht, es wird was abgeschaltet,"}, {"id": 662, "start": 5253.68, "end": 5263.16, "text": "das stimmt mich ja schon durchaus zuversichtlich, ja, tatsächlich, ja, das ist kein Bleeding"}, {"id": 663, "start": 5263.16, "end": 5270.04, "text": "Edge Meme 2022, das ist schon so alt, das kann jeder schon mal mitbekommen haben, aber"}, {"id": 664, "start": 5270.04, "end": 5278.32, "text": "dass die Leute es verstanden haben, das fand ich schon mal gut, da kommt Press F her, ja,"}, {"id": 665, "start": 5278.32, "end": 5284.68, "text": "wobei Press F, der Original ist ja Press X, der allererste Screenshot, der so die Runde"}, {"id": 666, "start": 5284.68, "end": 5290.6, "text": "gemacht hat, ist von der Xbox gewesen, Press X, aber das mit Press F to pay respects hat"}, {"id": 667, "start": 5290.6, "end": 5296.24, "text": "sich da irgendwie mehr durchgesetzt, erstmal Keque, ich hab schon mal Poggers bei irgendeine"}, {"id": 668, "start": 5296.24, "end": 5302.08, "text": "Abstimmung reingehauen, wir hatten mal eine Abstimmung, ich kenne das, wenn Leute Präsentationen"}, {"id": 669, "start": 5302.08, "end": 5306.92, "text": "halten, dass die manchmal versuchen besonders interaktiv zu sein und zwischenzeitlich dann"}, {"id": 670, "start": 5306.92, "end": 5311.32, "text": "so, ja, wir haben jetzt mal eine Umfrage gemacht, geht mal alle mit eurem Handy da drauf und"}, {"id": 671, "start": 5311.32, "end": 5317.8, "text": "wählt was aus, so was machen und da hat mal einer bei uns die Umfrage, da ging es um"}, {"id": 672, "start": 5317.8, "end": 5323.28, "text": "irgendwie Microsoft Azure oder sonst was, da hat einer die Umfrage gestartet, so nach"}, {"id": 673, "start": 5323.28, "end": 5327.52, "text": "dem Motto, ja, was sind ihre Meinungen zur Cloud, da hab ich halt einfach mal instant"}, {"id": 674, "start": 5327.52, "end": 5331.64, "text": "Poggers reingeschrieben, nicht wirklich, weil es in dem Fall besonders Poggers ist, sondern"}, {"id": 675, "start": 5331.64, "end": 5336.08, "text": "einfach nur weil ich mal Poggers in einer offiziellen Umfrage auf der Arbeit sehen wollte"}, {"id": 676, "start": 5336.08, "end": 5344.12, "text": "in irgendeinem Chat und es ist, er hat es sogar vorgelesen, hat gemeint, aha aha, Poggers,"}, {"id": 677, "start": 5344.12, "end": 5348.88, "text": "ich bin mir nicht sicher, ob er wusste, was es bedeutet, aber er hat es ausgesprochen,"}, {"id": 678, "start": 5348.88, "end": 5355.16, "text": "er hat es vorgelesen, aha aha, Poggers, ich sehe hier Poggers, er hat vorhin gesagt, ich"}, {"id": 679, "start": 5355.16, "end": 5361.92, "text": "sehe hier Poggers und da habe ich gedacht, gut, hat sich ja schon gelohnt, ich glaube,"}, {"id": 680, "start": 5361.92, "end": 5366.4, "text": "er wusste nicht, was es bedeutet, das fand ich halt witzig in der Präsentation, aha,"}, {"id": 681, "start": 5366.4, "end": 5381.66, "text": "ich sehe hier Poggers, Stonks, ja, oh man, ja gut, also ich muss glaube ich echt mal"}, {"id": 682, "start": 5381.66, "end": 5388.58, "text": "irgendwann Tabs zumachen, weil es ist so unübersichtlich, weil vor allem so viel unsinniges Zeug, warum"}, {"id": 683, "start": 5388.58, "end": 5396.34, "text": "habe ich den Mailregex zum Beispiel noch offen, warum, also wer übrigens mal AFC-konform"}, {"id": 684, "start": 5396.34, "end": 5404.56, "text": "E-Mail-Adressen-Regex matchen will, das ist der offizielle RFC-Regex dafür, warum auch"}, {"id": 685, "start": 5404.56, "end": 5427.52, "text": "immer, wenn ich den so offen habe. Gibt es noch irgendwas Leute, ich habe noch eine Viertelstunde"}, {"id": 686, "start": 5427.52, "end": 5428.52, "text": "Zeit, ich habe nichts geplant heute und ich habe mehr oder weniger meinen Pulver, was"}, {"id": 687, "start": 5428.52, "end": 5431.68, "text": "ich so erzählen kann, glaube ich jetzt auch langsam verschossen, ich bleibe auch nicht"}, {"id": 688, "start": 5431.68, "end": 5436.46, "text": "mal lange on nach 15 Minuten, also 15 Minuten bleibe ich erst noch on bis 22 Uhr, dann muss"}, {"id": 689, "start": 5436.46, "end": 5445.64, "text": "ich meinen Hals schonen wieder. Meinung zu Steam auf Chromebooks, habe ich noch nie ausprobiert,"}, {"id": 690, "start": 5445.64, "end": 5449.12, "text": "keine Ahnung, wusste ich gar nicht, dass es geht ehrlich gesagt, aber klar, ich meine,"}, {"id": 691, "start": 5449.12, "end": 5459.92, "text": "das ist ein Linux, warum soll es nicht gehen. Wie gut der Support ist, keine Ahnung, warum"}, {"id": 692, "start": 5459.92, "end": 5467.44, "text": "willst du dir ein Chromebook kaufen zum Spielen, ich glaube da gibt es besseres. Vielleicht,"}, {"id": 693, "start": 5467.44, "end": 5478.16, "text": "achso, das ist jetzt neuester News oder? Achso, das habe ich nicht mitgekriegt. Die erste"}, {"id": 694, "start": 5478.16, "end": 5490.76, "text": "Alfa für Chromebooks ist erschienen. Aha, Chromebooks, warum nicht? Ich meine, das ist"}, {"id": 695, "start": 5490.76, "end": 5497.48, "text": "das beste was uns passieren kann, die vielleicht mal darauf hoffen, dass irgendwann man gescheit"}, {"id": 696, "start": 5497.48, "end": 5504.72, "text": "unter Linux spielen kann, also ohne, dass man immer sich Gedanken machen muss und im Zweifelsfall"}, {"id": 697, "start": 5504.72, "end": 5511.0, "text": "doch was nicht funktioniert, dass man irgendwann mal vielleicht ganz unbedenkt, ohne großartig"}, {"id": 698, "start": 5511.0, "end": 5514.88, "text": "nachzudenken auch sagen kann, naja, gut neues Game, installiere ich mir, obwohl ich unter"}, {"id": 699, "start": 5514.88, "end": 5523.52, "text": "Linux bin, also das ist das beste was Valve machen kann, die können ihr Kram einfach"}, {"id": 700, "start": 5523.52, "end": 5529.64, "text": "nur verteilen und hoffen, dass es nach und nach mehr Userbase kriegt. Stromo ist es halt"}, {"id": 701, "start": 5529.64, "end": 5534.76, "text": "kein Linux, ist es nicht? Doch, was soll es denn sonst sein, Windows ist es nicht, was"}, {"id": 702, "start": 5534.76, "end": 5539.6, "text": "anderes gibt es nicht. Es kann doch nur, BSD wird es nicht sein, es kann doch nur Linux"}, {"id": 703, "start": 5539.6, "end": 5542.92, "text": "oder Windows sein, Windows ist es nicht, es kann doch eigentlich nichts anderes sein."}, {"id": 704, "start": 5542.92, "end": 5563.8, "text": "Ja, ein Gentoo ist das sogar, ein Gentoo Leute, nicht mal Arch by the way, ein Gentoo. Ja,"}, {"id": 705, "start": 5563.8, "end": 5567.72, "text": "das wurde aber noch zu Zeiten veröffentlicht, wo Google noch die krassen Hackermans hatte,"}, {"id": 706, "start": 5567.72, "end": 5573.32, "text": "die haben gesagt, wir verwenden Gentoo dafür. Ich habe einen 3D Drucker, ich habe einen"}, {"id": 707, "start": 5573.32, "end": 5580.24, "text": "3D Drucker, warum fragst du, ich habe einen 3D Drucker, druck damit nicht so viel, mal"}, {"id": 708, "start": 5580.24, "end": 5589.8, "text": "ein paar Gehäuse oder sowas ab und zu, druck vielleicht 2-3 mal im Monat was. Gentoo."}, {"id": 709, "start": 5589.8, "end": 5617.04, "text": "Hast du schon das neue Chrome OS Flex getestet? Ne, ich habe kein Chromebook und ich wüsste"}, {"id": 710, "start": 5617.04, "end": 5622.0, "text": "auch nicht, was ich mit Chrome OS machen soll, ehrlich gesagt. Ich meine, man kann sich"}, {"id": 711, "start": 5622.0, "end": 5630.76, "text": "Chrome OS sicherlich in irgendeiner VM oder so installieren, wobei das reichlich sinnlos"}, {"id": 712, "start": 5630.76, "end": 5653.48, "text": "ist. Das kannst du einstellen. Du meinst, die erste LED geht mal an, geht mal aus, flackert"}, {"id": 713, "start": 5653.48, "end": 5660.96, "text": "ein bisschen, aber nur die allererste, so random gefühlt. Es gibt ein Setting dafür,"}, {"id": 714, "start": 5660.96, "end": 5667.32, "text": "die erste LED zu überspringen. Musst du mal in den Settings gucken. Es gibt explizit für"}, {"id": 715, "start": 5667.32, "end": 5680.36, "text": "diese Probleme mit der ersten LED gibt es ein Setting in WLED. Also wenn du WLED verwendest,"}, {"id": 716, "start": 5680.36, "end": 5690.04, "text": "wahrscheinlich, oder? First LED. Randomly first LED turn screen. Ja, da gibt es Settings"}, {"id": 717, "start": 5690.04, "end": 5695.24, "text": "für. Du kannst es einstellen, skip first oder sowas. Musst du mal in den Settings gucken,"}, {"id": 718, "start": 5695.24, "end": 5711.48, "text": "gibt es was für. Du bist also nicht der einzige, der das Problem hat. Ich frage, weil er werft"}, {"id": 719, "start": 5711.48, "end": 5729.32, "text": "das Gehäuse. Die meisten Sachen in Smartphones kannst du doch gar nicht 3D drucken. Gehäuse"}, {"id": 720, "start": 5729.32, "end": 5733.16, "text": "für Technik Sachen willst du eigentlich auch nicht, gerade für Sachen, die du täglich"}, {"id": 721, "start": 5733.16, "end": 5737.84, "text": "wirklich 3D drucken. Wenn ich für meinen ESP ein Gehäuse 3D drucke, ist das ein,"}, {"id": 722, "start": 5737.84, "end": 5748.24, "text": "aber ich druck doch kein 3D Gehäuse für mein Steam Deck oder Smartphone. Und die Innereien"}, {"id": 723, "start": 5748.24, "end": 5755.24, "text": "kannst du ja gar nicht 3D drucken. Ich meine, vielleicht lobenswert der Ansatz, aber ob"}, {"id": 724, "start": 5755.24, "end": 5761.32, "text": "das nennenswert irgendwas bringt, ich habe da meine Zweifel. Du wirst jetzt nicht, was"}, {"id": 725, "start": 5761.32, "end": 5776.68, "text": "man damit machen soll. Bad Good Time, Leute, ich werde müde. Ja, wenn es sonst nichts mehr"}, {"id": 726, "start": 5776.68, "end": 5795.92, "text": "gibt, soll irgendjemand hosten? Von den kleinen Leuten. Top Cut, keiner da. Ja, kein Problem."}, {"id": 727, "start": 5795.92, "end": 5811.84, "text": "Was? Wen? Das Name sagt mir irgendwas. Schon mal irgendwo gelesen. Ach, das R, jetzt weiß"}, {"id": 728, "start": 5811.84, "end": 5819.76, "text": "ich, wer das ist. Das ist der, den ich eine Weile mit Tanzverbot verwechselt habe. Weil"}, {"id": 729, "start": 5819.76, "end": 5832.16, "text": "ich das überhaupt nicht verfolge, aber dabei sehen die sich noch nicht mal ähnlich. Ich"}, {"id": 730, "start": 5832.16, "end": 5837.56, "text": "habe die Stelle als Werkstatt. Ach, bei Rolls Royce oder wo warst du der? Warst du der Rolls"}, {"id": 731, "start": 5837.56, "end": 5857.32, "text": "Royce Bewerber? Nice. Und wann geht es los? Und bezahlen die was Gescheites oder bezahlen"}, {"id": 732, "start": 5857.32, "end": 5862.88, "text": "nichts und wollen vollen Einsatz? Also ein bisschen was bezahlen werden sie ja. Also echt"}, {"id": 733, "start": 5862.88, "end": 5883.92, "text": "ein bisschen. Bist du zufrieden mit dem, was sie was sie bezahlen? Na gut, Leute, dann"}, {"id": 734, "start": 5883.92, "end": 5899.16, "text": "machen wir jetzt ab. Alles klar. Wir sehen uns bis denn. Macht's gut. CU. Ich bin weg."}]}