{"text": "Lass mal warten bis Twitch gecheckt hat, dass da Stream online ist. Was ist hier los? Ja, noch nicht viel. Ah, ich glaube... Jetzt hat's Twitch kapiert, dass da Stream online ist. Proc. Nebulon, danke für den Sub. 28 Monate. Massive Subscriptions hier. Skillkiller auch am Start. 12 Monate. Ja, jetzt hast du den goldenen Keks mit Halsband. Äh, was heißt Halsband? Halsband. HALZKETTE! Michael 50 Trillionen ist auch am Start. Dankeschön für den Sub. Halskette. Halskette. Nicht Halsband. Wo ist der Song her? Das ist irgendeine Mario-Playlist. Uah... Schon spät. Mittagsschlaf. Heute müssen wir uns etwas mit einer China-Chinesen-Kamera auseinandersetzen. Wir haben immer noch kein China-Emote, fällt mir gerade auf. Warum haben wir kein China-Emote? Ich meine, wir haben einen Franzosen-Emote, wir haben einen Bayer-Emote, wir haben einen Russen-Emote, wir haben einen Ami-Emote. Warum haben wir kein China-Chinesen-Emote? Das darf ja für allen schnell wahr sein. Naja, kommt drauf an, ob du FFZ oder Bella-Twitch-TV hattest. Beides zusammen ist relativ... Weiß nicht. Unsinnig. Ok. Gut gefuttert, ja. Spaghetti. Gibt es eigentlich irgendjemand auf der Welt, der keine Spaghetti mit Tomatensauce und... Ok. Ja, doch. Mit Hackfleisch vielleicht weniger. Ganzen Veganer mögen das nicht mit Hackfleisch. Aber so prinzipiell Spaghetti-Bolognese mag doch eigentlich jeder, oder? Ich habe eh das Gefühl, Leute beim Italiener bestellen im Prinzip nur vier verschiedene Sachen. Salami-Pizza, Spaghetti-Bolognese, Spaghetti-Carbonara oder Lasagne. Was anderes gibt es da irgendwie nicht. Also, zumindest von dem, was bestellt wird. Alles andere ist wahrscheinlich... Das machen wahrscheinlich weit über 50% der Bestellungen aus. Schreibs. Danke für den Sub. Ich habe richtig Poggers Spaghetti gefuttert. Nämlich, ich bestelle ja neuerdings aus Italien. Ich bestelle meine Spaghetti immer hier. Die Webseite ist wirklich Paynes-Champ. Achtung. Guckt euch die Webseite an. Bestellkarte. Moment. Wo gibt es... Wo gibt es Nudeln? Hier gibt es Nudeln. Alter, wer diese Seite gemacht hat, ich weiß auch nicht. Das GIF. Oh Gott, das ist so schrecklich, die Seite. Max, doch, es gibt auch viele, die bestellen... Was? Echt? Aber, nee, nee, der Dark Reader macht es eigentlich nur noch besser. Der Dark Reader macht es eigentlich nur noch besser. Guckt, die Seite ist auch ohne Dark Reader. Ziemlich... Naja, Nudeln. Über WLAN in der Bahn. Nee, warte mal ab. Das wird nicht lange funktionieren. So, und da muss man mal hier Spaghetti gucken. Nicht glutenfrei. Spaghetti. Hier. Aber was ich mag, ist die Spaghetti... Ach, die gibt es gerade gar nicht. Die haben so ein Set. Normalerweise. Da gibt es dann zwei davon, zwei davon, zwei davon. Gibt einmal die ganz normalen Spaghetti bei denen. Und es gibt auch welche, die sind ein bisschen dunkler. Das sind die, die sind nicht wirklich voll. Aber sowas, sowas in der Richtung, aber es scheint es gerade nicht zu geben. Und die sind, obwohl ich nicht, normalerweise nicht, sondern Fan von so Ultra Vollkorn-Protokram bin, die sind wirklich gut, weil die sind ein bisschen fester und die machen viel mehr satt. Und die schmecken irgendwie auch gut. Ja, also ich bestelle die Spaghetti immer hier. Also generell die Nudeln bestelle ich hier. Lohnt sich aber nicht wirklich, wenn man nur ab und zu mal einen Pack oder so bestellen muss. Also da muss man schon... Also ab 100 Euro ist das Versand kostenfrei, aber das muss man auch erst mal erreichen. Und die haben noch jede Menge anderen Sachen. Also da bestelle ich gern. Das hat tatsächlich mal jemand im Stream empfohlen. Warum habe ich ein Video von meinem Klo jetzt einfach offen gehabt? Liefer dich auch per LKW. Ich habe keine Ahnung, wie die normalerweise liefern. Am Ende kriegst du es halt per Post. Und nicht per Post, am Ende kommt irgend einer von DHL oder so vorbei und bringt dir dein Paket. Da ist sogar immer Stroh drinne zum Polstern. Kannst du die Seite noch mal zeigen hier? Laviala.com Eigentlich ist das irgendein Weingut. Da kannst du 30 Milliarden Weine bestellen, aber das will ich nicht. Also was ich mir schon bestellt habe, ich habe mir so ein paar Sets bestellt. Mein Klo-Video, man. Sets bestellt mit unterschiedlichen Sachen drin. Auch mal ein bisschen Süßkram, aber hauptsächlich bestelle ich Nudeln und fülle dann auf, dass man eben auf 100 Euro kommt, dass das Versand kostenfrei ist. Ich weiß nicht, ob du sie empfohlen hast, aber die war Proc. Ja, aber die sind besser als die vom Lidl. Ich habe auch jahrelang EDK, Lidl und all die Spaghetti gefuttert, aber die Spaghetti von denen sind wirklich besser. Die sind dicker, die sind fester und die schmecken besser. Ja, die Spaghetti, die wären ja nicht schlecht. Von OneNote habe ich keine Ahnung. Da habe ich keine Ahnung davon, was mit OneNote funktioniert nicht. Ich habe früher mal relativ gerne OneNote verwendet, aber als es noch die Version zum Selbstinstallieren gab, die einfach funktioniert hat und nicht diese ganze komische Online-Integration hatte, aber das ist auch schon 10 Jahre oder länger her. Mittlerweile verwende ich einfach nur noch Plain Text Text Editor fertig. So, ich zeige euch mal was Leute, was wir uns heute angucken müssen. Und zwar hören wir kurz meine VM auf. Meinst du die Standalone Version? Das, was es damals gab, zu Office 2008 oder so war das, glaube ich. OneNote 2008. Ich war es auch 2003 oder so. Nee, das ist schon das Neue. 2003, ich habe es ewig her, wo ich OneNote verwendet habe. Ja, in der Richtung, genau, das da. Das habe ich früher mal relativ viel verwendet. Ab 2008 hatte es irgendwie Ribbons und war komisch, genau. 2003 habe ich gerne verwendet. Hat schon ewig her, oder? So, erstmal updaten. Also ich zeige euch mal nebenbei, was ich mir gekauft habe. Und zwar, ich habe mir gekauft eine China-Chinesen-Kamera Reolink E1 Outdoor. Wofür habe ich mir die gekauft? Für die Terrasse, dass ich die Katze beobachten kann. Die darf jetzt ja neuerdings raus. Ich glaube, die ist das bei Amazon. Ach, derzeit nicht verfügbar, aber ich habe Glück gehabt, dass ich die noch habe. Vielleicht, warte mal. Ist sie doch. Keine Ahnung. So, das Teil habe ich mir bestellt, weil du es schwenken kannst. Links, rechts, oben, unten und ein bisschen zoomen kannst. Das ist perfekt, um quasi die gesamte Terrasse zu erfassen, was die Katze auch immer nach draußen treibt. Sie hat Infrarot-LEDs für nachtlich und sie hat LEDs mit normalem weißem, weißem LED-Licht, wo ich sogar nachts auch mal kurz die Terrasse hell machen kann. Beispielsweise, wenn man von draußen reinkommt und Schlüsselloch sucht oder so. Das ist eine ganz gute Kombination. Das Problem ist nur, entweder muss man die über ein mega hässliches Webinterface bedienen, was unpraktikabel ist. Nein, nein, nein. Ohne Cloud. Ich habe mir die gekauft, weil die braucht keine Cloud. Die braucht nicht mal eine App zum Einrichten. Es geht alles über einen Browser. Es ist ohne Cloud. Mit Cloud würde ich mir ja nicht holen. Entweder musst du das über ein mega hässliches Webinterface machen oder du machst es über die App, was auch dumm ist. So, App gibt es, aber will ich nicht. Ich gehe jetzt mal per Webinterface drauf. So, Admin, Passwort, was auch immer Stream-Type da unten ist, keine Ahnung, Login. So, ich habe die im Serverraum hinter mir stehen. Also nicht wundern, dass man hier nichts erkennt. So, das sieht halt ziemlich kacke aus, weil das 640x84 Auflösung ist. In Wirklichkeit hat die aber, kurz den Darkreader aus, in Wirklichkeit hat die aber 2560x1440. Ihr seid ja schon eingehackt, Chat. Ja, das war mir klar. Ihr seid ja eh richtig krassen Hacker, mehr als immer. Wer ist schon drin? Wer ist drin, Chat? Hockqualität, ja. Alle drin, okay. Fuck, IP League. Leute, keine Clips machen. Ich will nicht, dass die IP Public wird. Easy. Er hat es schon gut. Na dann. So, zumindest, man kann die steuern. Also, so in der Richtung. Jetzt kann ich die runter machen oder hoch machen. Oh guck mal, das Bild hängt. Das ist schlecht. Das ist auch so was, was mir aufgefallen ist, warum das Webinterface komplett unbrauchbar ist. Es laggt und es bricht zwischendurch ab. Also das Webinterface ist einfach nur absolut kacke. Guckt euch das mal an. Das ist absoluter Witz. So, das erste, was wir machen müssen, ist. Na, hat die Kamera Licht an oder so? Kann das sein? Oder ist das das Licht an der Decke? Sekunde, Leute, ich muss mal kurz das Licht an der. Ne, vorher, bevor ich das Licht an der Decke ausmache, suchen wir uns mal schnell raus, was das Ding für ein RTSP Stream hat, weil den brauchen wir gleich. Wir brauchen, wir brauchen ordentlichen RTSP Stream. Also, Reolink E1 Outdoor RTSP. Die hatten RTSP Stream, das weiß ich. Das habe ich schon, hier, das habe ich schon ausprobiert. Aber ich habe die Adresse jetzt gerade nicht. Outdoor, hier. Das da braucht man. Oh, der hat sogar einen Generator. 1, 2, 1, 6, 8, 60, 1, 1, 1. Ja, Passwort ist erstmal egal. Passwort ist erstmal egal. Ne, Main will ich haben, nicht Sub. Main. Ja, Blödsinn. Main ist da gut auch hoch aufgelöst. Das tut okay. FF Play. FF Play. ECP, haben wir da irgendwas? Ne. FF Play. Ach so, na gut, ich kann euch das Passwort verraten. Cute Chat 1, 2, 3. Ich habe das Passwort im Vorfeld geändert. Sind das Ratschenschlüssel auch von Vera? Ja, das sind die hier. Vera Joker. Die sind richtig pock. Wie da sind das? Ja, die waren teuer, aber die sind richtig nice, wenn man sie braucht. Oh, Main. Jetzt sollte der das eigentlich abspielen, wenn ich das richtig gemacht habe. GIF, RTSP Stream. Ich glaube, der Port ist falsch. Leute, ich glaube, der Port ist falsch. Welcher Port? Einfach mal nMap eine Runde scannen. Can't wait. nMap. Was haben wir denn offen? Zeig her, Ports. Ah, auf nMap. Hab dich mal nicht so. Alter, was ist FTP? Was ist denn da alles offen? Okay, RTSP ist off. Geht es schien nach Kines? Also das funktioniert nicht so richtig mit dem Port, oder? Was ist denn wenn ich da Müll eingebe als Passwort, kackst du dann ab? Ja, dann geht es nicht. Geht's nicht. Screenshot Downloads, so Moment, Moment, wir müssen mal kurz Ports gucken. Da, ne nicht Netzwerke, Advanced, Ports, RTSP-Port, 554, Ports, RTSP-Port, 554, Ports, RTSP-Port, 54, das Ding irgendwie kaputt, warum geht das nicht, warum kann ich den RTSP nicht starten? Ich, ich weiß, dass es prinzipiell funktioniert, weil ich hab das, ich hab das schon mal gestartet. VLC vielleicht mal zur Abwechslung, wisst ihr was, wir machen, wir Quoten das mal kurz, nur zur Sicherheit. Warum geht mein Kamerabild nicht, wisst ihr was wir jetzt machen, ich reboote das Ding jetzt, ich reboote das Ding jetzt, ich hab das ausprobiert, das funktioniert prinzipiell, also ich hab den RTSP-Stream schon ausprobiert, der geht eigentlich, 60, 1, 1, 1, ok, Qt-Chat, 1, 2, 3, Generate, ja da kann man nicht viel falsch machen, ok, Ping, Reboot hilft, ja, ist grad noch nicht da, so, also was ich jetzt eigentlich sagen wollte ist, wir brauchen erstmal ein ordentliches Bild von der Kamera, anstatt dieses hängende Web-Interface-Kack-Ding. Äh, ja, ja, say nein, nein, Alter, warum hab ich überhaupt ein Browser-Fenster hier, gut, Qt-Chat, 1, 2, 3, ok, FFPlay, ist das nur TCP, vielleicht, FFPlay, RTSP, Transport-TCP, müssen wir vielleicht machen, Alter, jetzt ist mein Firefox geupdatet worden, jetzt muss ich meine Liebungskiste neu starten, bestes Timing, bestes Timing überhaupt, doch, der kann zwei Streams parallel, das funktioniert, weißt du was, ich mach mal updaten, starte meine Liebungskiste neu, ja, ja, Visual Studio, erstmal alles updaten, warum hat die Kamera so schlechte Latenz beim Ping, geht eigentlich, guck mal, hier, 5 Millisekunden, man, halt WLAN, doch, ich muss meine Linux auch neu starten, weil da hat Kernel Updates gemacht und Zeug, halt WLAN, ist halt so, was willst du machen, besser geht's im Prinzip auch nicht, das steht quasi in den halben Meter neben dem Access-Point, mal kurz warten bis es geupdatet hat, so, also, ich brauche erstmal einen Stream zur Kamera und dann kommt halt der Knackpunkt, man kann die Kamera steuern über eine, ich will nicht sagen offizielle API, weil ganz offiziell ist es nicht, aber es gibt vom Hersteller API-Docs, die eigentlich nicht für die Öffentlichkeit gedacht sind und auch nicht so 100% funktionieren auf jeder Kamera, da müssen wir mal gucken, so, hat er geupdatet, Reboot, Bäm, der Kamerastream lag nicht, der Kamerastream geht gar nicht, der Kamerastream muss erstmal funktionieren per RTSP, dass wir überhaupt weitermachen können, so, was ist das für ein Hintergrund, es ist Bing-Image of the Day, ich weiß immer nicht was es ist, Bing, Restore, ok, F of play, also, wie bringt man Force F of Mpeg use TCP, transports, F of play, transport TCP muss man dran machen, ok, der Stream von der fucking Kamera geht, ok, ich habe nichts gesagt, der Stream von der Kamera geht, alles klar, nice, so, jetzt können wir uns hier verbinden, jetzt sehen wir das nämlich auch halbwegs, wie aktuell sind wir denn von der Zeit, ah, ich habe keine Zeit eingeplant, super, buffer, F of play, Moment, F of play, wie konnte man das buffern abschalten von F of play, no buffer, low delay, frame drop, jaja genau, genau das will ich haben, alles klar, gib her, no delay, low, low delay, under run, under run, so, also, schwenken wir mal, ja, es laggt, guck mal, es laggt deutlich weniger als dieses kacke Web Interface hier, das ist so schlecht, alter, switch to flash player, ganz sicher, ganz sicher, ja, das sind die guten Vera Joker, Joker Schlüssel, sag mal, ist das, ist das das Licht an der Decke oder ist das das Licht von der Kamera, Leute, ich mach mal kurz Serverraum Licht aus, ne, das ist nicht das Licht von der Kamera, das ist das Licht von der Decke und jetzt geht automatisch Nachtsicht von dem Ding an, ok, alles klar, ne, passt, jetzt ist jetzt Licht an der Decke wieder an, so, Licht an der Decke ist wieder an, jetzt switch da wieder um, ok, passt, alles gut, so, jetzt haben wir weniger Delay als da drüben, wobei jetzt ziemlich, ziemlich gleich, FFPlay Buffer Size, konnte man doch auch noch einstellen, Buffer Size 32, wie ging das, Probe Size 32, was ist, der hat, der hat, was hat er denn für ein Delay, ne, guck mal, der ist ziemlich, der ist eigentlich ziemlich gut dabei, ja, guck mal, der Stream funktioniert viel besser, übrigens, da steht drüben im Serverraum auf meinem 3D Drucker, das Ding, also nicht wundern, ich darf jetzt bloß nicht die Tür aufmachen, keck wait, so, so, gehen wir an meine Werkzeugwand, kann man das Bild noch irgendwie flippen, wobleak, genau, so, wobleak, flip, kann man das Bild flippen, Video Settings, Advanced Settings, Image, ah, hier, Ne, ne, ne, Mirron, Rotate, ah, so ist gut, so, so ist gut, jetzt erkennt man auch was, alles klar, ok, also das erste Problem hätten wir schon mal gelöst, die Kamera funktioniert prinzipiell, hat zwar nicht die krasseste, Bitrate gerade, was hatten die für eine Bitrate eingestellt, standardmäßig hier, 1506, also 1,5 MBit, das ist ja nix, 15 FPS ist ok, keine Ahnung, 8, save, kackt das jetzt ab, oder macht es on the fly, es verschiebt sich immer noch eklig, ich guck mal kurz VLC, was VLC meint, was es für eine Bitrate hat, wie heißt die Kamera noch mal, das ist eine Reolink E1 Outdoor, achja, VLC geht ja nicht, weil VLC nicht TCP, geht ja ins Smart, ok, kann FFplay Statistiken wie Bitrate anzeigen, oh, ist einfach weg, Alter, was ist jetzt, Quick Wait, wahrscheinlich muss ich die neu starten für die, na ist auch egal, die Bitrate ist jetzt nicht unser Problem Leute, die Bitrate ist nicht unser Problem, ok, höher kann ich die nicht mal stellen anscheinend, kann man diesen Müll hier nicht einfach zu machen, FFplay, Display, Bitrate, kann das FFplay, FFplay, na FFpro bringt mir jetzt an der Stelle nichts, können M-Player verwenden, vielleicht ist M-Player besser, testen wir mal durch, M-Player, unauthorized, FFprobe, Bitrate, ach ich noob, das ist der, das ist der, das ist der Crap Stream, Leute, das ist der Müll Stream, ich brauch Main, dann ist auch die hohe Quali, das ist der Dreck Stream, ja, das ist doch schonmal deutlich besser jetzt, ich mein es lag zwar aus Gründen, komm wir machen mal Start Calibration, da fährt es einmal im Kreis rum, da können wir zugucken, auf, ja, das ist doch jetzt schonmal besser, das ist doch jetzt schonmal deutlich besser, Coggers ist das jetzt, Coggers, genau, ok, sehr schön, jetzt ist er hier am Kalibrieren, jetzt ist das irgendwie mit der Übertragung abgekackt, sehr schön, ja genau, genau schön auf die Tür fokussieren, dass ich mich selber liege, warum ist das so ein hohes Delay, das liegt, pass mal auf, ich mach das mal wieder runter, ich könnt mir vorstellen, Low Delay ist es ja angeblich, ne, jetzt ist kein Delay, das liegt, dass die CPU es mit dem Encoding wahrscheinlich überfordert, wobei die Bitrate einen nicht wirklich einen großen Unterschied macht, so, aber jetzt das Delay ist ok, so wunderbar, also das funktioniert, so das ist das erste haben wir schonmal geschafft, hupps, jetzt hab ich zugemacht, ich noob, ich will diesen komischen Preview zumachen, kann man hier unten vielleicht einfach stopp drücken und dann hört er auf, achso, ja, nice, dann kann ich nämlich immer noch steuern, so, also was wir jetzt machen müssen ist, oder was ich rauskriegen muss ist folgendes, wie kann man diese Pan, Tilt, Zoom Sachen kontrollieren über die API, wie kann ich Infrarot LEDs an und ausschalten über die API und wie kann ich das Licht an und ausschalten über die API und wie kann ich Presets anfahren über die API, so, das muss ich jetzt irgendwie rauskriegen und ich glaube am besten kriegt man das raus über die Browser Tools, ja, weil wenn ich jetzt zum Beispiel hier nach unten klicke, dann seh ich, aha, API, CMD, PTZ Control und dann irgendeinen Talken, bau dir ein Roboterarm, der das drückt, sehr gute Idee, was denn das, von KS, Böööööö, Chat, irgendeine glorreiche Idee was das ist, Base64 vielleicht, Base64 Decode, ach, was mach ich denn, das ist noch Schwachsinn, Echo, Lul, Gott, Base64 minus D, Chat, von wegen, das ist Base64, der Chat leckt Critical Information, Echo minus N, das dürfte jetzt glaube ich nicht so einen großen Unterschied machen, ok, was könnte das sein Chat, vielleicht ist das China-Chinesen Decoding, vielleicht ist das Chinesisch, das ist nicht UTF8 oder so, das ist China-Chinesen Kram, ich glaub da kommen, was könnte das, es sieht aber doch schon hart aus wie Base64 oder, Chunker, wie meine Katze, aber das brauchen wir gar nicht, ich hab im Vorfeld schon mal geguckt, es gibt nämlich eine Reolink-RP-Documentation, unten bei Projekte auf GitHub, wo man sich Sachen angucken kann, wie das andere Leute machen, ja, Vakuk, schön, dass du einen Weg her gefunden hast, Reolink-World-Commands, Doc, DocX, was sonst, ja, DocX, wie krieg ich denn das jetzt geöffnet Leute, gescheit, brauch ich jetzt mit allen Ernstes LibreOffice, dass ich das aufmachen kann, Fresh, LibreOffice Fresh, was ist denn die Alternative zu Fresh, Still, was, können die ihre Pakete nicht mal so benennen, dass man versteht, was gemeint ist, ne, Fresh AF, der Name ist gut, aber das ist für Afrikans, Alter, das ist irgendwie so ein Zulul-Niederländisch-Ding, Zulul-Niederländisch ist das, was ist denn der Unterschied, LibreOffice Fresh versus Still, was ist der Unterschied, die Still-Version ist eine stabile und ausgiebig getestet, die Fresh ist, mein Gott, können die ihren Shit nicht einfach irgendwie einheitlich sein, was spricht denn gegen Test und Stable, oder Stable und Def, oder Stable und Beta, oder Release und Beta, warum muss es Fresh und Still sein, oh, meine Güte, ey, das ist doch nicht mal Marketing-Stonks, das ist einfach dumm, ok, wir wollen Fresh, wir wollen Fresh, was ist das normale LibreOffice-Paket, hier blicke ich ja gar nicht mehr durch, gibt so viele Packages, LibreOffice, zu, gibt's nicht einfach ganz normal LibreOffice, einfach ganz, ah, Fresh, ganz unten, zwei, ja, Boost, mehr Z plus plus Shit, gib her, jetzt muss ich mir tatsächlich LibreOffice installieren, nur damit ich ein komisches Doc, welcher Hersteller veröffentlicht seine API-Docs in Doc, ich meine, es heißt nicht Doc, weil es ein Doc-Word-Doc sein muss, konvertiere es online, warum soll ich es konvertieren, warum ist es nicht gleich in einem PDF, erst mal 600 MB, soll er öffnen jetzt, gib ihm, da, LibreOffice, ja genau, hier, baue sehr viel Platz für, also, RTMP, Mainstream, Extstream, RTMP, Substream, warum hat das Ding RTMP und RTSP, FLV, RTSP, wo ist denn der Sinn davon, das ist, das geht doch eh alles durch den gleichen Encoder, das ist doch alles nur Transportverpackung drumherum, bei euch war die Sache auch noch in DocX, ja, bei uns ist ganz vieles in Excel, was mich auch immer unglaublich fasziniert, wie die das hinbekommen, den ganzen Müll da in Excel, naja, Business Stonks Zeug halt, so Playback-Uhrl, was, nein, nein, nein, nein, API-Docs, Open den Google Advanced Rest Client, ne, ich brauch, da kann ich auch Postman nehmen, ich brauch irgendwas, wo ich die ganzen Befehle drin stehen hab, Playback, was wollen die denn überhaupt von mir, the fuck, das ist ja mal das uselesste Dokument überhaupt, das stimmt doch überhaupt nicht, guck mal, das ist schlicht und ergreifend gelogen, was da drin steht, das ist was ganz anderes, das Dokument, das ist einfach, das ist wieder typische China Craft, Alter, ja, das mit Login hab ich auch gelesen, PDF, ja, wo haben die noch einen PDF, guck mal, PDF Attached, kann es sein, dass die ja selbst nicht so genau wissen, was die hier angehängt haben, okay, wir suchen, wir können immer noch hier nachgucken, der Download-Button zeigt aufs gleiche, ja, User Guide, hier, User Guide, Google Drive, jawoll, sehr vertrauenserweckend, lad mir das besser mal runter, das ist wahrscheinlich die Vorgänger-Version davon, Version 5, Moment, sieht anders aus, die Seite, ah, das, das, okay, ah, das sieht schon besser aus, guck mal, Control, PTZ und so hab ich da eben gelesen, PTZ Control, PTZ Control, ja, das sowas hab ich gesucht, Interface Description, IP, RPCGI, CMT, PTZ Control, okay, wie machen wir Login, Login, Login, Login, Login, Moment, Security Login, Seite 78, also, mich würde sehr wundern, ob Seite 78 wirklich Seite 78 ist, nee, Seite 14 ist Seite 78, alles klar, also, Post Request oder vielleicht kommt, vielleicht kommt ja auf Seite 78 noch was, nee, Seite 132 kommt das nächste wieder, das schien erzeugen, also, ergeblich steht es auf Seite 78, finden tut was auf Seite 14 und auf Seite 132, alles klar, okay, aber das sieht doch schon mal gut aus, it is used to get Token, ich wollte schon immer Token getten, also Request, Post, also IP CMT Login, Post Data, CMT Login, Moment, ich paste auf Command, Login und muss dann in dem Post nochmal CMT Login machen, sehe ich das richtig, ja, okay, na gut, dann probieren wir das doch mal aus, jetzt was da steht, machen wir unsere IDE auf, Moment, die muss ich glaube ich noch updaten vorher, es gab doch jetzt irgendeine neue Version oder vertue ich mich da, aber wir brauchen einen guten Namen für das Projekt, ja, Moment, wollen wir erstmal updaten, GoLand, Datacryp, ja, update mal, wobei, warum habe ich Datacryp nochmal installiert, Chat, was haben wir da gemacht, wir haben, ah, das war diese Postgres Geschichte mit Autocomplete und, Autocomplete und Textsuche, Autocomplete Textsuche war das, ja, genau, genau, hast du das GitHub Projekt Reolink gesehen, ja, ich weiß, wir können abgucken, hm, das habe ich gesehen, gibt es da was für.NET, ich glaube ich lasse gerade, wir können mal kurz gucken, Reolink, rp.net, GitHub, Go, weißen Zeug, das war wohl ein leerer Query lang gebraucht hat, ja, leeres Query, das hat länger gebraucht, Moment, kann man, Language, ne, okay, wir suchen einfach mal Reolink und sagen dann Language, Alter, die VM ist aber ganz schön hart am Lenken mit dem Update hier, so, und jetzt sagen wir Language, ah, das gibt es gar nicht für, gibt nichts für.NET, okay, nein, nein, nein, nein, das hätte ich fast, der Teufel persönlich hier, ne, gibt es anscheinend nicht, ist auch egal, die paar Dinge kriegen wir auch selbst gebastelt, ist ja grad Sinn und Zweck der Sache, also, wir brauchen einen guten Projektname, CamChamp, haben wir sowas vielleicht schon mal gehabt, ne, haben wir nicht, also, New Solution, CamChamp, sehr gut, okay, great, Backcam hatten wir schon mal, Spannerchamp, das ist nicht schlecht, Spannerchamp, so, das hauen wir mal kurz weg, so, also, Rider, CamChamp,.NET Run, jetzt probieren wir das mal aus, ja, Hello World, alles, alles gut, also, wie machen wir das denn, CW, WTF, sag mal, Spack Rider immer noch rum hier mit Single File Kram, CW, hä, CW, okay, was auch immer, witzig, also, ähm, tja, na, Hello World ist Schwachsinn, also, Klaas, Kamera, AP, Public Static Login oder so, Login, so, jetzt probieren wir mal aus, ob das funktioniert, was die da treiben, irgendwie so, Talken, oder immer, gut, also, jetzt brauchen wir Kamera, AP, Login, so, und jetzt loggen wir uns hier mal ein, also, wie funktioniert das jetzt mit dem Login, das steht doch hier irgendwo, also, CMD Login, das probieren wir jetzt mal mit Curl erst mal aus, Curl minus X, und zwar ist das ein Post, und dann gehen wir auf 192.168.60.111, Login failed, ja, ach, das ist ja klar, ich hab ja keine Benutzer eingegeben, okay, Aram, User, Username, Admin, Passport, äh, also, wie jetzt, minus D, und warum ist das in einem Array drinne, und das Array ist gar nicht geschlossen unten, ach, doch, hier, wat, Array, Objekt, was zum, was machen die Chinesen denn da wieder für Dinger, CMD Login, okay, Param, was ist das denn, Param, da muss man Klammer wieder zu machen, ähm, User, boah, das ist aber schon ein bisschen wie, ja, nochmal wieder Klammer zu, ich finde grad nicht, User, Admin, Passport, Passport ist QChat123, Kunst, easy, okay, wir kriegen einen Token, also, ich vermute mal, das Name, das eigentliche Login-Token ist, was wir dann brauchen für weitere Requests, okay, Copy Paste, wir haben uns den Kram mal kurz hier rein, also, ähm, HTTP, HTTP Client, die können wir auch irgendwie global oder so machen dann, ähm, HTTP Client, Post, ja, das ist in der falschen Reihenfolge, da meckert er jetzt, ach so, ja, gut, das müssen wir erwarten, machen wir alles, okay, Post Async, also, wir wollen es dahin posten, also dahin unseren Request, HTTP Content, Strings und dann, ja, wie kriege ich denn den Müll jetzt gescheit, Top Level Await, ja, muss ich mal vorstellen, das gibt es noch gar nicht so lange, das kriege ich, oh, das muss ich jetzt wieder 30.000 Mal eskapen, vielleicht hätten wir es doch mit der Python-Abi machen sollen, okay, wir gehen an Data, gleich, hat sie Schaap, sowas wie Python-Triple Quotes hatten die noch nie, ne, die haben jetzt nur Template Strings, C-Sharp, Triple Quotes, sowas haben die nicht, ne, Copy JSON-S-Class, ach, ist das was, was die in Rider drin haben oder wie, ne, wie, oder was meinst du, vielleicht doch C++, ne, ne, das ist blödsinn, was der Typ schreibt, ne, ne, das ist blödsinn, was der Typ schreibt, ja, Rust, was interessiert, was ist mit den Rust Leuten eigentlich immer verkehrt, dass die bei so einer Frage reinkommen und sagen, ja, aber Rust, ja, Zellattenzaun, ach, guck mal, es gibt ein Proposal, alles klar, ist wurscht, wir eskapen das jetzt, zack, abfuck, äh, was hat er für Schmerzen, warum muss ich das jetzt nicht eskapen, ach, ne, weil ich das nicht escaped hab, iiiiigitt, das waren jetzt nur einmal zum testen, danach muss ich mir da irgendwas anderes überlegen, das ist ja eklig, ne, schon wieder vergessen, iiiiih, so viel eskabe, ne, das muss ich nicht eskampen, ok, String-Data, alles klar, braucht er sonst noch was, ne, ich glaub, das wars, muss ich ihm noch Content-Typs sagen, ne, Encoding, äh, UTF-8, wahrscheinlich, vermute ich mal, Media-Type, äh, Application-Jason, vermutlich, damit er jetzt wirklich sicher zu sein, was der haben will, so, jetzt schauen wir mal, ob das ganze funktioniert, ob ich mich jetzt da einloggen kann, äh, Result, oder Response, meinetwegen, Read, ne, wie war das, Body, ach, vergessen, Content, Read, S-String, ja, oh, wait, ok, führen wir mal aus, gucken, ob das funktioniert,.net, Run, äh, was, ach, so, jaja, blub, alles klar, please log in first, äh, das hat nicht so funktioniert, wie ich mir das vorstelle, äh, warum, das Hochkammeranfang muss doch weg, wo, ah, warum, was macht das da, wie kommt das da hin, und die schließende Array-Klammer ist auch weg, null, ja, kein Wunder, da kann den Gram nicht pasen, ah, das sieht schon besser aus, das sieht doch schon besser aus, also, hier, talken, ok, wir brauchen jetzt eh eine Runde, äh, zu gibt, ich nehme das, ich weiß, es ist mittlerweile eingebaut, aber, so, also, dann, chasen, convert, please serialize, dynamic, das finde ich tatsächlich ganz praktisch, wenn man dafür dynamic verwendet, so, und jetzt können wir uns das Talken raus holen, also, wo ist das, das erste Array-Element, mal gucken, ob das jetzt funktioniert, also, json, das erste Array-Element, darin, dann, value, darin, Talken, darin, name, ob das jetzt klappt, schauen wir mal, hey, funktioniert, straightforward, easy! Wenn du dich entscheiden müsstest, Svelte-Kit oder Nuxt drei, Nuxt ist React, ich hab keine große Ahnung von React, ich wäre Svelte-Kit nehmen, weil ich mich damit auskenne und von React keinen Plan hab, so, jetzt sollten wir vielleicht noch irgendwie mal testen, ob das funktioniert, wir machen da einfach überall, Nulldings-Checks dahinter, so, und, also, Wir verlassen uns einfach drauf. Warum muss man den Text eskapen? Was denn? Das da? Naja, weil du Strings in C-Sharp mit doppelten Quotes machst und wenn du in diesem String doppelte Quotes verwenden willst, dann weiß er ja nicht, ob das Teil vom String ist oder Stringende. Deswegen musst du die eskapen. Was nimmt C-Sharp 10 und passt das in eine Funktion mit Argument? Was? Ach Nuxt ist Vue.js, stimmt, das habe ich, Next ist React, so rum war das, ne? Ganz ehrlich, wenn ich einfach nur möchte, dass es funktioniert ohne großartig rumgucken, dann würde ich wahrscheinlich Vue nehmen. Das Feld ist auch nicht ganz so umfangreich und so gut alles Mögliche beschrieben. Zwerg-Cringer, weil ich faul bin, weil ich da zu viel überlegen muss. So, throw, new, new IO-Exception oder irgendwie sowas, was weiß ich, put not connect, so wunderbar, Kamera. Gut, wir haben es geschafft, also wir kriegen jetzt ein neues Kameraobjekt zurück mit dem richtigen Token, das heißt, damit können wir jetzt tatsächlich Dinger machen. Zum Beispiel, ach so, ich muss gucken, ob es ungleich Null ist, naja, was, wo ich das noch tue? Ach Moment, was mache ich denn hier, ist doch Schwachsinn, lull, Moment, Moment, wir könnten doch jetzt, oh, wie ging das jetzt wahr, value, ne, wie konnte man das noch mal schreiben? Ah, neue C-Sharp-Features, can't wait, äh, wie ging das jetzt noch mal, ging das überhaupt, was ich davor habe? Ah, so rum, oh, ich will nicht checken, ist wahr, ist string, so, geht das, wobei ne, string ist es ja nicht, es ist ja Jason-Objekt oder so, warte mal, wie kann ich denn das jetzt in einem, in einem Aufrutsch machen, jaja, äh, mach ich das jetzt in einem Aufrutschgeschein, ich mein, ich könnte sagen und und value ungleich Null, aber das ist sicherlich nicht schön. Was? Okay, äh, kann das sein, dass ich noch, Moment, ich muss noch sowas machen, ahhh ja, ja, ja, ja das ist doch schon besser ja das ist das was ich eigentlich machen wollte ja ja ich weiß es gibt zig tausend packages für alles ja so will ich das haben das ist das was ich eigentlich genau so das war dann schön das kann bestimmt ein bisschen klarer schreiben aber ich will erstmal checken wie ich meine never used warum gut also was machen wir jetzt als nächstes wir müssen gucken wie wir den kram hin und her drehen können also wie funktioniert das ganze login login haben wir schon gemacht so jetzt müssen wir gucken wie man die kamera drehen stopp wie geht das get zoom ne pt z pt z pt z kontrol pt pt z kontrol cmd pt z kontrol gleich tauchen ok das sollte von der idee relativ easy sein was braucht man dafür parameter cmd pt channel was für einen channel also falls wahrscheinlich falls der mehrere motoren hat oder so keine ahnung channel 0 op auto haben die auch eine erklärung was diese parameter auch tatsächlich operation to control pt z was wollt ihr mir sagen m o m was ok es gibt die ausfall zwischen m oder o und das ist m obvious was damit gemeint ist natürlich ist das eine offizielle doko so offiziell wie es geht ja ja ja ok ja gut aber was gibt es denn sonst noch to post gibt es ah moment moment ach ne ne ne guck mal man kann sagen stop to position to post ist wahrscheinlich id 1 to post ist für die presets das ist für die presets leute wenn ich presets definiert habe kann ich hier zu der preset id fahren stop gibt es und auto gibt es naja to post reicht mir doch eigentlich to post ist doch vollkommen in ordnung ich kann doch hier einfach einfach positions vergeben guck call oder ja so position call position der channel die achse ja vielleicht ich brauche nur ich brauche nur positions dann mache ich mir einfach im hof im hof mache ich mir einfach presets und gut ist das ist ok das reicht also was brauchen wir das da monka es ok keine ahnung wir fahren jetzt zu go go to post oder sowas ins presets id so also was brauchen wir denn jetzt den kram das tauchen haben wir das tauchen haben wir so dann haben wir private ok also post muss er wieder warten post und kein volt sondern task so post also die url ist ja im prinzip immer die gleiche die können wir die können wir uns im prinzip hier auch noch mal noch mal geben lassen eigentlich bis dahin alter ja so können wir jetzt nämlich das zeug hinten dran schreiben also wir wollen eigentlich haben plus pt z control oder was braucht man da jetzt habe schon wieder cmd gleich cmd gleich bet war das groß geschrieben pt z pt z control uns string content jetzt müssen wir diesen mist irgendwie wieder schön man gibt es irgendeinen kann rider den kram string escape oder sowas ein gutes tool zum net string es kämpen smart paste in rider ok high IQ zeug zeigt mal hier die einfach in anführungszeichen ist ja du meinst dass es vielleicht ordentlich es kämpen kann wenn man es in anführungszeichen machen today i'd like a smart paste right escaping aha ok ach guck mal da das ist cool ok also ja moment das funktioniert natürlich nicht das muss jetzt alles in eine zeile so es kämpfe des press ne was zum minute war ich jetzt zu langsam ich war ja das ist cool nein nein add geht nicht kannst da vormachen dann brauchst du den da musst du aber das glaube ich doppelt machen oder so du musst immer es kämpfen du musst es geht ja auch logischerweise nicht anders woher soll der wissen dass das hier nicht ende vom string ist ja das ist nice das wusste ich nicht dass sie das eingebaut haben was zu string interpolation kann man da sonst noch mitmachen egal das ist das finde ich äußerst äußerst nice übrigens warum ist das cmd nicht im ach hier das das muss auch noch in die in die array klammern ok nein kannst du nicht sie scharp hat das hier ist einzelnes character und das hier ist ein string du kannst es nicht ändern dass also das wäre cool wenn es da noch irgendwas gebe mal in zukunft so data ich war mal richtig cool ist dann würde man jetzt irgendein parameter bilder oder sowas machen so data encoding utf 8 triple triple single quotes nein nein nein so was funktioniert nicht triple single quote sowas wissen wir sind nicht in pisen wir sind in sich ab da gibt es sowas net application jason gut so post pt z control und da muss ich jetzt übergeben to post id 1 speed 32 ok dann schauen wir uns noch mal an was da zurück kommt a weight content read as string und jetzt gucken wir mal ob das sich auch bewegt schauen wir mal ich fahre den mal zu position 3 der sollte jetzt auf jeden fall woanders sein der leckt ganz schön hinterher wenn das eine weile offen ist warum kein on file ist nicht richtig funkt mit der kamera das wäre auch zu schön wenn das einfach geht so ok wird das jetzt also ich sollte es vielleicht noch aufrufen oder lull ap moment warum machen wir das eigentlich nicht hier können wir zugucken aber was macht ap go to post 1 meine noch ist es hardcoded aber das machen wir dann 1 a weight wir machen hier ein terminal auf ach so das tauchen fehlt noch tatsächlich ja stimmt stimmt ihr habt recht das tauchen fehlt und wo wie geht man das da überhaupt an ja tauchen gleich tauchen ok und tauchen gleich und tauchen gleich tauchen warum ist warum muss da tauchen eigentlich in die uhr und das command noch mal doppelt und dreifach was keine ahnung china chinesen api man muss es nicht verstehen dort net run angeblich hat es funktioniert und macht aber hey es fährt das funktioniert park so preset all die jahre aber jetzt hier und jetzt muss ich es neu es käpen keck weh alter das muss ich doch anders machen das fackt mich jetzt schon ab wenn ich dann wenn ich so was sehr preset all die jetzt muss ich oh nee nee nee nee das war das das halt schnell aus weil man ist denn hier noch mal einen dollar da vor bekommen das wird ja mache es doch einfach als dynamic war und chasen stringy feier ist das ist feifett ja das ist das ist wahrscheinlich besser wie macht man das jetzt am besten ich könnte ich könnte so was machen data gleich nu gucke ob das funktioniert cmd gleich tt z control ob das tut ach es ist ja ein array shit also dann ist es jetzt nur ok schauen wir mal ob da was sinnvolles bei rauskommt das ist kacke so das ist mega beschissen so zusammenzubauen alter ist doch mal guckt euch das mal an param so da drin haben wir dann channel channel ist null op ist gleich to pass id reset id speed 32 ok mal schauen ob da jetzt irgendwas sinnvolles bei rauskommt ja geil warum nicht warum geht das warum geht das nicht das habe ich falsch gemacht moment das kann er keine erase aber mal star anlegt als es kommt von hier unten guck mal der chat ist richtig high iq der chat wusste es wieder massive high iq chat wieder so guck mal das sieht doch gar nicht so falsch aus was da jetzt rauskommt oder das sieht doch das sieht doch eigentlich ganz ok aus cmd pt z control param channel op to pass 32 na gut dann fahren wir nochmal zu position position 3 und führen das ganze nochmal aus das ist ja genauso was wie test oder dokumentation schreiben wenn man fehlerfrei programmiert braucht man das alles nicht so und da brauchen wir jetzt allerdings anstatt dem data brauchen wir jetzt ich brächte es mal kurz um das jason convert serialize objekte data so mir fällt nichts besseres ein das einzurücken so schauen wir mal ob das so funktioniert was ich gemacht habe und das kann man jetzt wenigstens lesen halbwegs richtiges per programming hier alles klar ok also jetzt kann man schon mal presets anfahren das ist doch das ist doch schon mal gut warum nennen wir das nicht einfach goto preset anstatt goto pos nenn das einfach goto preset da weiß ich wenigstens in zwei zwei monaten noch was ich da gebaut habe hast du was über fleet gesehen ich bin so halb drauf ja das ist der jet brains editor bin mal gespannt drauf ich glaube nicht dass es frontend technisch visual studio code konkurrenz machen wird weil visual studio code ist halt schon ziemlich gut was javascript gedöns angeht und auch die 30.000 addons die es gibt aber visual studio code ist beispielsweise für java müll für c-sharp naja geht so und für viele solcher etwas nicht so zoomer sprachen ist das ist das nicht so gut auch go ist nur ok jetzt nicht richtig super da könnte ich mir vorstellen dass man mit fleet was ordentliches bauen kann rast habe ich schon ewig nicht gemacht ich glaube das letzte mal wo ich bisschen rast rum probiert habe war mit dem markt glaube ich mit dem intelligent plugin also go war auch nicht so gut in vias code weil ich habe das was ich in go gemacht habe war mit interop zu c und c interop mit go ist eh schon ein bisschen painstamp und da ist visual studio komplett abgekackt mit c imports in den go files da war vorbei hast nicht mehr gecheckt da ist regelmäßig das highlighting und autocomplete abgeschissen neowin mit language server natürlich arch was sonst was sonst was benutzt ihr für by the way nur mal um das jetzt euch mitzuteilen echt geht das mittlerweile dann ist ja gut also mal weiter also presets anfangen können wir das ist doch schon mal nice also presets angefahren kriegen wir was habe ich gesagt was wir noch machen müssen also presets anfangen ach ja licht licht an oder aus falls falsche immer auch das wollte ich gar nicht licht an und aus jetzt ok jetzt wirds jetzt wirds natürlich etwas wie schalt man bei der kamera licht an und aus also audio and light network ok dafür gibt es gar keine api aufruf set white led set white led ok schauen wir mal white led get white led set white led warum willst du das manuell machen zum beispiel weil ich will ja also normalerweise nachts will ich keine led anhaben normalerweise will ich nachts infrarot nachtsicht gedünst anhaben aber wenn zum beispiel das hoftor geöffnet wird hab ich mir überlegt mache ich so wenn das hoftor aufgeht dann fährt sich die kamera auf das preset von der tür macht das spotlight an für zwei minuten damit man was sieht im dunklen damit man ein schlüsselloch findet im dunklen und danach fährt sich die kamera automatisch wieder zurück macht das licht aus und macht infrarot wieder an deswegen muss ich dem irgendwie sagen manuell an oder aus was mich jetzt hier ein bisschen verwirrt ist dass man infrarot lights irgendwie nicht richtig an oder aus machen kann hast du erfahrung mit der cam bei nacht ich hatte die gestern mal draußen stehen das war ok ich hab die aber einfach nur rausgestellt und dann mit dem handy mal drauf geguckt also das war in ordnung also die terrasse sehe ich komplett warum nicht ein zusätzlicher led strahler ja weil das zusätzlich ist warum soll ich was zusätzliches hinstellen wenn ich schon mit dem bild machen kann das ist ok also ich habe alles gesehen mit der mit der infrarot leds auf der terrasse die terrasse ist jetzt auch nicht so wahnsinnig groß also in hof runter konnte ich jetzt nicht wirklich gut gucken ist die kamera lichtstark genug muss ich ausprobieren keine ahnung aber ich denke mal schon also ich hatte die gestern an und also ich bin ich bin da nicht mehr raus und habe es aber nicht probiert auf der terrasse ich habe es einfach nur mal eingeschaltet und hab dann mal aus dem fenster geguckt das sah relativ hell aus ob das reicht weiß nicht infrarot geht ja nicht mal auf der webseite manuell einzuschalten das macht nix das spotlight geht auch nicht auf der webseite ein und auszuschalten aber es hat eine api anscheinend mal schauen wie die funktioniert was was ich mich aber wundert ist dass man das infrarot light hier nicht richtig einen ausschalten kann vielleicht wenn man hier was rum schaltet haben die hier irgendwas für die für die beleuchtung advanced settings daylight led light off macht schon mal gar nichts auto anehmung das mal save drücken set set er light haha was ist day night color was ist was ist day night auto color color black was was das war für ein setting was soll das überhaupt sagen ach color ist wahrscheinlich licht an und black und white ist infrarot an oder wie ist das also wir wissen jetzt ja also wir brauchen hier set er light set set er light is it is used to set configuration of er lights optional state auto das für den sinn du willst das normale licht schalten nicht infrarot ja die sache ist die es kann ja durchaus sein dass du nicht beides anhaben kannst mandatory optional mandatory ja das kann sein was für states gibt es denn keine ahnung da steht nicht da ok da kann man nur states setzen anscheinend dann lassen wir die dann lassen wir die dann lassen wir die infrarot lights auf auto und das normale lassen wir aus ich hoffe dass ich das nicht in die quere kommt also was war das alles set white set white led also ok dann dann gucken wir jetzt mal wie man das licht an und ausschalten kann erstes ergebnis irgendeine s echt ach so kannst du kannst das ding irgendwie den juck dass das ding sonderlich sicher ist mache ich mir keine illusion das ist china china chinesen zeug also wie funktioniert das jetzt mit dem set set white ok set white led token übliche geschichte data state null channel null mode eins pride 79 ok das ist die helligkeit light schedule ai detect nein nein nein nein nix ai detect ich will einfach nur licht anmachen dog cat face people we mode ja was cool wäre wenn die hier irgendwie drinnen stehen hätten welche modes es denn so gibt und state ich meine das channel immer null steht habe ich mich jetzt ja schon dran gewöhnt aber state und mode alles optional ja das ist aber bestimmt nicht optional zum ein und ausschalten da gucken wir mal in das pisten api projekt hier rein ob die das schon rausbekommen haben set white led das suchen das suchen wir einfach mal jetzt set weird champ das haben die hier noch nicht mal drinnen was ist das denn guckt euch das mal an nicht so viel so dann googeln wir mal danach set white led reolink was ich glaube channel ist wenn du einen recorder mit mehreren kameras hast aber warum muss ich das dann bei der api angeben ich meine das geht direkt auf die eine kamera vielleicht dass es einheitlich ist ach guck mal da der westenburg der hat mir früher der hat mir früher call of duty gameplays geschickt ne das war der westersburg ach guck mal hier state on off mode night mode on auto on nee ich will null haben moten null moten null weil ich will ja nicht dass der automatisch irgendwas macht ich will auch nicht dass der mit der zeit irgendwas macht ich will es einfach nur an oder ausschalten ok da bin ich mal gespannt probieren wir das mal aus also public ersten cast wie nenne ich das jetzt einfach mal was ich light on switch also da brauchen wir im prinzip diesen ganzen schmatter hier noch mal so pt z control set white led muss das sein token passt alles rest passt auch so und was brauchen wir da jetzt für also cmd ist set white led parameter white led was oh nee das ist nested oder keck weight das ist das ist nested also ich muss sagen white white led nochmal oh mein so white led state so state eins ich will es ja einschalten channel aus irgendwelchen gründen null weil mode mode ich bleib mal bei null mal gucken mal gucken ob ich das kann ich mein mode ich mal schauen vielleicht muss ich auch vielleicht muss ich auch sagen drei oder so night mode und time on oder sowas und dann das wieder ausschalten danach warte mal gucken 100 ok wir machen das test beispiel von den 79 den rest lasse ich leer sollte doch jetzt eigentlich funktionieren wir machen wir machen bei der gelegenheit wir schalten jetzt einfach mal ein und gucken ob das funktioniert hier ist die kamera ich mache mal komm wir sehen wenn ich wenn wir sehen wenn dies das licht angeht ok also habe ich das richtig mal set white led parameter white led state eins channel null mode null ob das funktioniert muss wir gleich mal gucken bright 79 set white led token ist hinten dran dann führen wir das mal aus also kein preset sondern switch light on und irgendwas hinten dran wobei ich kann das auch hier ausführen run habt ihr es gesehen die led ist angegangen wartet mal ich mache mal in meinen im surferraum die das licht aus guck mal leute das funktioniert led ist an ich muss man das ffm pack neu machen das hat mir schon ein bisschen das hat mir schon ein bisschen viel die lei gerade funktioniert gg eats so und jetzt brauchen wir natürlich switch light off jetzt auch noch switch light off ok set white led state null machen wir auch mal brightness null wo ist das jetzt eigentlich reverse engineering naja wir gucken im webinterface was er schickt aber du hast schon recht so wirklich krasse reverse engineered ist es nicht das konnte ich aber vorher nicht wissen so demot ist oft und state ist oft das eigentlich so passen switch light off alles auf null und licht aus zack jetzt jetzt hat er erkannt dass nacht ist und macht die infrarot leds an das ist cool das finde ich nice so switch light on ne ich will kein toggle ich will wirklich explizit sagen an oder aus das ist wirklich sehr nice so also das heißt was ich jetzt machen kann ist folgendes kommen das ist können wir das verbinden also ich sage jetzt wait api go to preset 2 zum beispiel also sagen wir mal das ist die tür was ich heute mache ich versuche meine china chinesen kameras über die api zu steuern so go to preset 2 ich muss erstmal switch switch light off machen sonst erkennt man das jetzt nicht richtig so geht gleich infrarot zeug an aber egal also go to preset 2 preset 2 ist dann sagen wir mal die tür wobei ich jetzt eigentlich wenn ich mir selbst das leben einfacher machen will mache ich so was hier noch ihn um keine ahnung preset und macht dann so was hier door 2 ist einfach nur dass ich mir besser merken kann left 1 right wobei soll ich aufsteigen machen wenn ich keine ahnung center gleich null falls nie wo gehen die presets los bei 1 oder bei 0 bei 1 ok 1 2 3 und keine ahnung oder oder right 4 da kann ich mir einfacher merken was es ist da könnte ich jetzt nämlich jetzt ein go to preset door so da muss ich dem jetzt noch sagen kann ich dem jetzt noch sagen dass der ein so macht er macht der jason serializer standardmäßig int aus dem preset weiß es nicht so auf jeden fall wenn es jetzt richtig funktioniert dann schwenkt er jetzt nach links und dann also nicht dann schwenkt er dann dann schwenkt er jetzt zur tür dann schwenkt er jetzt zur tür und danach macht er das licht an wenn alles funktioniert also das richtig echte licht ja nice ok das war jetzt glück dass preset 4 door tatsächlich die tür ist das war einfach nur glück dass preset 4 aktuell wirklich auf store zeigt das ist einfach nur random china hexa content ja so das ist cool das gefällt mir und jetzt könnte ich dann noch so was sagen wie keine weight task die lei oder sagen wir nach zwei oder sagen wir noch nach fünf sekunden nach fünf sekunden sagen wir switch light auf nach brightness 100 wisst ihr was wir probieren mal was aus brightness 50 default also int wir mal gucken ob man das überhaupt umstellen kann hast du schon mal shop line shopify habe ich tatsächlich nie verwendet wir machen das mal so ich lasse es ich lasse es erst mal so laufen um zu checken ob das ob das funktioniert weil es wird funktionieren ich mache mal ich will mal die helligkeit testen also switch light on machen wir 10 wir machen das anders wir machen wir machen eine schleife machen eine schleife von keine ahnung 1 bis 100 ist überhaupt 100 maximum gleich 100 zwar von 1 dann da ob 100 maximum ist set white brightness ja man weiß es nicht man weiß nicht ob brightness 100 100 das ist oder vielleicht sind es auch 250 gerade kommen was machst du ich habe mir eine china chinesen kamera gekauft die eine nicht ganz so offizielle api hat das stand in der python api naja so also plus gleich kommen wir machen das mal in 10er schritten also switch light on delay 5 so switch light und wir fangen an mit mit eins so cw was das jetzt warum hat sich das jetzt ausgeschaltet habe da noch gar nichts gemacht oder habe ich doch was gemacht ach was auch immer ja so was heißt eigentlich und premise das heißt wenn du zeug vor ort stehen hast also das ist ja erst seit ein paar jahren aufgekommen seitdem es an angefangen hat üblich zu werden dass man manche sachen eben nicht mehr vor ort im eigenen rechenzentrum stehen hat sondern irgendwo in der cloud und als die coolen leute die sagen ja auch nicht und premise die sagen und präm weil das mehr klaut native und cool und cooler klingt ja also das ist zum unterscheiden ob du sachen lokal stehen hast oder in der cloud und premise ist lokal beziehungsweise vor ort ich glaube und premise heißt übrigens auch eins zu eins übersetzt vor ort ja vor ort aber und präm sagen die kult die die richtigen klaut natives sagen das so ja also wir fangen jetzt ein wir fangen jetzt an mit in 10er schritten die helligkeit hoch hoch zählen schauen wir mal oh was da ach ich nur nicht das die leih 5000 das die leih 5000 das in der millisekunden ändert das irgendwie nennenswert die helligkeit schätten die sind nicht dimmer die leds ich glaube es gibt nur an oder aus guck mal es gibt nur an oder aus helligkeit ist keinerlei unterschied wie ist die api aufgebaut dass es hat über hat ttp aber so wirklich klar ist die nicht ne das ding kann keine helligkeit guck die helligkeit ändert sich nicht immer gleich hell also im prinzip können wir uns den helligkeitsparameter auch komplett sparen es gibt nur an oder aus betail geutz ja das kenne ich und präm ablösen klingt halt so als hat man voll plan ja ok die helligkeit ist kein unterschied was passiert bei pride null das ist tatsächlich gute frage probieren maus brightness null nix nix passiert da du kannst immer können aus dem brightness parameter komplett sparen der ist der ist komplett useless der brightness parameter zumindest bei der kamera mach mal minus eins ok moment das das probieren aber so aus das juckt dir nicht das ist ihm egal immer gebe ich das hier überhaupt jaja brightness da mit schleidung minus eins ist ihm auch egal was ist denn bei 255 ist auch ok 5000 50.000 auch ok in 32 max value ist auch ok interessiert uns überhaupt nicht ok der brightness value ist ziemlich für den arsch den brauchen wir nicht da können wir bei der ich schreibe ich schreibe jetzt einfach brightness 100 rein und fertig brightness parameter ist komplett komplett useless brauche ich ok nice gut so also wir können presets anfahren wir können das licht an und ausschalten presets anfangen kann man zum beispiel sagen hier wird das zu heiß leute kann das sein kann das sein dass es zu heiß wird wenn es zu lang an ist weil er sich immer wieder abschaltet es gab da gab es doch einen schedule beim licht du hast recht aber was konnte man da einstellen ne da kann man nur staatsuhrzeit enduhrzeit einstellen und außerdem habe ich ja dieses automatische steuern ausgeschaltet ich glaube da wird einfach zu warm ja das ist das ist das ist das ist jason über htp genau so sieht das dann aus wir haben glücklicherweise dieses api dock gefunden ich dachte am anfang schon ich muss mir diesen müll alles aus den browser tools mit dem offiziellen web interface holen aber zum glück haben wir so haben wir so ein komisches dock hier gefunden ist nicht dass es gleich brennt was hat das ding gekostet 110 euro 115 euro oder so der pluspunkt war für mich das hat eine led das hat infrarot leds und es braucht keine app und keine cloud und hat rtsp stream und ist halt angeblich outdoor geeignet wie sehr outdoor geeignet muss ich jetzt noch zeigen wenn ich dann das war eine weile draußen hängen habe so ein kölner await api go to preset left also vielleicht hat man auch noch es funktioniert ich bin begeistert wahrscheinlich nur autor damit die gekühlt wird die braucht ja wenn die autor ist also wahrscheinlich geht autor das licht tatsächlich länger aber wahrscheinlich also wenn du sie autor haben willst dann braucht ihr auf jeden fall ein paar dichtungen und so drinne welche kamera das ist das ist eine reolink e1 outdoor china ding ist das hier das hat einen motor und einen zoom einen zoom hat es auch nicht die hier moment das ist falsch die hier die kann auch zoomen wollen wir die mal zoomen lassen chat das mit komm wir lassen die mal zoomen wir lassen die jetzt mal zoomen einfach einmal rumdrehen noch schnell nee ausverkauft ist das falsche modell das soll ich nicht zubehren von amazon so wir zoomen mal kurz achtung blub zum aber er sobt ja wirklich aber der focus ist nicht so geil oder also focus habe ich schon bessere gesehen das web review ist so beschissen das muss weg kann man vielleicht hier den focus kann er nicht einfach autofocus machen die autofocus gibt es nicht doch jetzt jetzt wir müssen das spiegeln das sollte eigentlich tool check plus stehen ich glaube das kann man nicht richtig sehen image mehr ja so ist das doch gut kommen wir uns an das tool check plus angezoomt wie lauter die playlist das ist irgendeine mario mario playlist relaxing and calming music from super mario series ja so jetzt hat es genug gesummt übrigens bei der gelegenheit weiß was kamera eins kann weg das ist doch ganz eklig warum sollte er ohne kamera einstehen logo kann man das logo weg machen datetime datetime ist glaube ich ganz praktisch wie kriegt man dieses hässliche reolink logo weg was machst du da überhaupt ich steuere meine kamera über eine nicht ganz so offizielle api wir machen erstmal den zoom weg muss premium premium subscription kaufen also position das ist ja nur die in den settings war das mit den logos also kamera ist ja zeit oben in der kamera ist sehr gut den name brauche ich netter ist useless das logo soll weg watermark das da wahrscheinlich naja so ist das doch schon mal viel besser kann man da sonst noch etwas einstellen fps stream image das ist jetzt nicht so geil da muss ich mal kurz das licht einschalten dass die infrarotlampe wieder ausmacht so ein licht ist eingeschaltet sollte jetzt eigentlich gleich checken ja hat er gecheckt 15 fps reicht doch für so eine überwachung kamera nachts auf der terrasse so nice also ich muss sagen die auflösung ist doch wirklich nicht schlecht wie so eine billig china camp das hier liegt nicht an der auflösung das hier liegt daran dass die schärfe nicht stört dass die die der fokus nicht richtig ist das doch absolut in ordnung was passiert denn wenn ich jetzt hier einfach mal brightness hoch stelle ich weiß ja was ich mache da gar nichts dran an den settings ich lasse das einfach so wie das so was kann man sonst noch schönes zum einstellen also pan tilt controls hatten wir licht an und aus hatten wir auch led an und aus muss ich nicht machen funktioniert automatisch ganz ok resets anfahren funktioniert auch was hat was haben die denn sonst noch schönes in der ap was kann man da sonst noch so email und sonst was brauche ich nicht ach so die zeitzone sollten wir vielleicht mal richtig einschalten wir haben 6 7 das ist ja prinzipiell richtig aber network settings advanced ntp settings display wo könnte ich die zeitzone einstellen ah date und time device time may be incorrect ja kokona time wie ändert sich die zeitzone ok jetzt ist das stream abgekackt weird jam muss es neu starten dafür wenn du das umschaltest 16 uhr nice kurz mit der urzeit hier vergleichen naja das ist das ist ziemlich gut muss man sagen also da gibt es nichts also das delay ist auch nicht so hoch das ist die leis auch in ordnung guckt mal links rum rechts rum hoch runter das ist ok ja damit kann ich leben das ist nice was anscheinend ist die kamera ip 64 aber nicht das zugehörige netzteil das wird mich bei china china qualität nichts wundern das kann ich mir durchaus vorstellen dass sie die kamera wasserdicht gemacht haben aber das china netzteil nicht ja das kann ich mir schon vorstellen ok habt ihr eine klorarch idee was man noch machen könnte ich mein presets anfahren ich weiß was wir noch machen müssen ganz wichtig logout logout muss ich machen weil ansonsten läuft wahrscheinlich der ram oder die sessions voll oder sowas kann das teil poe nee ich glaube dasselbe dass das die ausgabe kann kein poe aber es gibt welche mit poe aber die einfachste variante wenn du poe machen willst ist einfach du nimmst den extractor genau dann machst du aus deinem poe einfach 12 volt oder 24 volt oder was die braucht du kannst bei den reolink dingern ssh aktivieren wirklich ssh egal wir machen jetzt erstmal logout wo aktiviere ich ssh wieviel kann poe liefern gar nicht so wenig ich glaube das jannard poe sind 48 volt und und 2 ampere oder so nee oder weiß es gar nicht also ist auf jeden fall es reicht für so eine kamera und licht dicke aus warum gibt es modelle von reolink die 4k können poe haben und weniger kosten aus dein modell na wahrscheinlich weil die irgendwelche anderen nachteile haben die sind entweder nicht outdoor geeignet oder sie sind reinklaut ansonsten muss man halt einfach mal vergleichen nee die kann also die kann kein poe wie es aussieht können wir hier kurz gucken ohne poe aber du kannst halt einfach irgendeinen x beliebigen poe poe extractor 12 volt nehmen sowas da und da schließt du dann die kamera dran an nee das ist müll das ist müll was ich gesagt hab die sind müll die taugen nix da muss schon das richtige rauskommen unterstützen nee nee nee nee das muss schon mit spannungswandler sein normales poe ist nämlich 48 volt ja sowas da wahrscheinlich eher kein injector das gegenteil von einem injector achte den artikel kenne ich ja das ist aber ein bisschen umständlicher sowas hier ja das reicht dicke für die kamera kein problem logout müssen wir noch machen leute logout brauchen wir noch logout wie macht man logout so einfach logout toppen und cmd logout mit leeren params alles klar so logout wir machen das gar nicht wir machen i disposable implement interface und da machen wir jetzt den logout drinne client wir kopieren uns den kram von hier oben client data logout logout dann braucht man für logout einfach nur cmd params leer na gut wenn die meinen das könnte man theoretisch mal in eine zeile machen ja kurz genug rückte das überhaupt gescheit ein ja so logout token aus bla bla bla ja so und jetzt kann ich sowas hier sagen guckt mal jetzt jetzt richtig advanced advanced feature nutzung kann ich sagen using war so und wenn er das wenn das jetzt richtig funktioniert dann soll er dann dann lockt er sich sogar noch aus am ende der wenn das programs oder auch nicht er sollte sich doch jetzt eigentlich aus am ende des scopes sollte eigentlich dispose aufrufen und gut ist aber vielleicht macht er das auch und es reicht für das reicht für das output für den output nicht mehr wir mal aus api dispose das war mal kurz eine sekunde warten dann sollte er eigentlich sich auslocken ja logout macht er auch wahrscheinlich reicht es einfach für das für die ausgabe nicht mehr aus ja ok nice passt jetzt räumt das jetzt lockt er sich sogar am ende noch richtig aus da kann man sich doch nicht mal beschweren passt doch laut hersteller das ding auch laut sprechen am mikrofon ist das so ja das ist so das habe ich aber ausgeschaltet das habe ich ausgeschaltet brauche ich nicht wüsste jetzt auch nicht wozu aber für sag mal wenn du den lautsprecher und mikrofon verwenden willst dann musst du auf jeden fall die offizielle app verwenden weil die wahrscheinlich irgendwelche nicht standardmäßigen video geschichten machen erinnert ihr euch noch an die kamera an die türkegensprechanlage die ich mir gekauft habe die wird so wo wir hier mal ausprobiert haben mit der mit dieser komischen die die nicht standardkonform ist hatte tp gemacht haben ne das ist was anderes dass das vielleicht gewesen ja wie könnte dieser stream dann heißen mit der kamera für die klingel irgendwas mit klingel ich weiß es nicht mehr zumindest haben wir da was vielleicht das ist das ist das stream gleich da lulve da haben die allen ernstes alter 5 stunden 58 da war ich aber ausdauernd noch gatschi bass so und da haben wir geschaut genau das ist die kamera so und dann ist uns aufgefallen dass die nicht standardkonform ist hatte tp machen die schicken daten also die machen die machen hatte tp und wenn ich jetzt richtig erinnerung habe nachdem nachdem die verbindung eigentlich geklost ist schicken sie noch weiter daten und nur dann hat die dann hat die sprechverbindung funktioniert das war so ein richtiges china chinesen crap ding was ich da gekauft habe irgendwo habe ich war ja hier guckt euch an war ja schag war der war ja schag jetzt im war ja schag hat man das gut gesehen was für das von mir ja das ich ich finde das war ganz abartig man das war glaube ich das ekligste china chinesen was ich je gekauft habe hilft genau für den sub ja leute wir sind eigentlich durch ich meine das funktioniert soll ich sagen es es klappt einfach zur abwechslung das muss ich jetzt noch in meiner heim automatisierung einbauen aber das mache ich ohne euch weil der plan ist ja dass wenn einer die haus also wenn es wenn einer das hoftor aufmacht und es nach sonnenuntergang ist dann soll die kamera auf das preset gehen von der tür und das licht anmachen und dann nach zwei minuten wieder das licht ausmachen wieder in die standard posi zurückschwenken und infrarot nachtsicht anmachen aber das kriege ich jetzt mit sowas hin dann muss ich ja nicht mal viel das reicht ja das reicht ja was ich hier habe eigentlich chat gibt sonst noch irgendwelche spannenden sachen habt ihr schon mein neuestes video gesehen das bisschen eigenwerbung machen das ist es ist schon ein bisschen clickbait titel oder wirst du zugeben dieses pixel spiel schlägt battlefield und call of duty das ist schon ziemlich level cap die baiting style aber nur 58 leute das interessiert der bauer hat ein neues video aus dem rechner hochgeladen ja schon vor zwei wochen oder so ja so also wen können wir dann hosten nutze zur aufnahme ein anderes ach ich habe wieder mein sound nicht richtig eingestellt leute sag doch was ne passt doch sound ist richtig eingestellt ach so du meinst im vergleich zu videos jaja das ist was anderes also hier ist ja das ist das mikrofon mein headset mikrofon in videos benutze ich das große mikrofon aber ich habe keinen bock hier gerade vorm tisch zu sitzen und immer in das mikrofon reinzugehen stream mache ich mit dem headset mit einem bayern dynamics 300 so ein ding und aufnehmen tue ich mit einem so ein mikrofon was man auf den tisch stellt das klingt ein bisschen besser aber der headset ist einfach deutlich angenehmer ja und denkt dran morgen im tue ist aufwachen stream wieder angesagt so viel schlechter ist es nicht deswegen mache ich ja auch wird sich das wird sich das richtig beschissen anhören dann würde ich das auch nicht machen aber das ist schon ok so chat irgendwelche vorschläge wenn wir hosten können ich schau mal kurz bei mir wenn ich bin voll der lost is on der macht auch just chatting aber ich will mal irgendjemand hosten im jahr so 9 uhr in dem dreh immer leute die tc bau und die haben wir letztens erst gehostet da fällt mir jetzt nicht viel ein wenig haus könnte ich jetzt einfach auf chat wir sehen uns bis zum nächsten stream morgen früh so irgendwie zwischen neun und zehn alles klar wir sehen uns bis denn zu", "segments": [{"id": 1, "start": 120.0, "end": 122.6, "text": "Lass mal warten bis Twitch gecheckt hat, dass da Stream online ist."}, {"id": 2, "start": 125.2, "end": 127.2, "text": "Was ist hier los? Ja, noch nicht viel."}, {"id": 3, "start": 131.2, "end": 132.8, "text": "Ah, ich glaube..."}, {"id": 4, "start": 133.8, "end": 136.0, "text": "Jetzt hat's Twitch kapiert, dass da Stream online ist."}, {"id": 5, "start": 136.1, "end": 136.6, "text": "Proc."}, {"id": 6, "start": 140.4, "end": 141.8, "text": "Nebulon, danke für den Sub."}, {"id": 7, "start": 142.7, "end": 145.6, "text": "28 Monate. Massive Subscriptions hier."}, {"id": 8, "start": 145.6, "end": 150.5, "text": "Skillkiller auch am Start. 12 Monate. Ja, jetzt hast du den goldenen Keks mit Halsband."}, {"id": 9, "start": 150.6, "end": 153.5, "text": "Äh, was heißt Halsband? Halsband. HALZKETTE!"}, {"id": 10, "start": 159.5, "end": 162.5, "text": "Michael 50 Trillionen ist auch am Start."}, {"id": 11, "start": 165.5, "end": 166.5, "text": "Dankeschön für den Sub."}, {"id": 12, "start": 169.5, "end": 171.5, "text": "Halskette. Halskette. Nicht Halsband."}, {"id": 13, "start": 171.5, "end": 173.5, "text": "Wo ist der Song her? Das ist irgendeine Mario-Playlist."}, {"id": 14, "start": 184.5, "end": 185.5, "text": "Uah..."}, {"id": 15, "start": 185.5, "end": 202.5, "text": "Schon spät. Mittagsschlaf."}, {"id": 16, "start": 203.5, "end": 207.5, "text": "Heute müssen wir uns etwas mit einer China-Chinesen-Kamera auseinandersetzen."}, {"id": 17, "start": 208.5, "end": 211.5, "text": "Wir haben immer noch kein China-Emote, fällt mir gerade auf. Warum haben wir kein China-Emote?"}, {"id": 18, "start": 211.5, "end": 222.5, "text": "Ich meine, wir haben einen Franzosen-Emote, wir haben einen Bayer-Emote, wir haben einen Russen-Emote, wir haben einen Ami-Emote."}, {"id": 19, "start": 223.5, "end": 228.5, "text": "Warum haben wir kein China-Chinesen-Emote?"}, {"id": 20, "start": 228.5, "end": 239.5, "text": "Das darf ja für allen schnell wahr sein."}, {"id": 21, "start": 245.5, "end": 254.5, "text": "Naja, kommt drauf an, ob du FFZ oder Bella-Twitch-TV hattest. Beides zusammen ist relativ... Weiß nicht. Unsinnig."}, {"id": 22, "start": 254.5, "end": 260.5, "text": "Ok. Gut gefuttert, ja. Spaghetti."}, {"id": 23, "start": 261.5, "end": 267.5, "text": "Gibt es eigentlich irgendjemand auf der Welt, der keine Spaghetti mit Tomatensauce und..."}, {"id": 24, "start": 268.5, "end": 273.5, "text": "Ok. Ja, doch. Mit Hackfleisch vielleicht weniger. Ganzen Veganer mögen das nicht mit Hackfleisch."}, {"id": 25, "start": 274.5, "end": 278.5, "text": "Aber so prinzipiell Spaghetti-Bolognese mag doch eigentlich jeder, oder?"}, {"id": 26, "start": 278.5, "end": 289.5, "text": "Ich habe eh das Gefühl, Leute beim Italiener bestellen im Prinzip nur vier verschiedene Sachen. Salami-Pizza, Spaghetti-Bolognese, Spaghetti-Carbonara oder Lasagne."}, {"id": 27, "start": 290.5, "end": 298.5, "text": "Was anderes gibt es da irgendwie nicht. Also, zumindest von dem, was bestellt wird. Alles andere ist wahrscheinlich... Das machen wahrscheinlich weit über 50% der Bestellungen aus."}, {"id": 28, "start": 298.5, "end": 307.5, "text": "Schreibs. Danke für den Sub. Ich habe richtig Poggers Spaghetti gefuttert. Nämlich, ich bestelle ja neuerdings aus Italien."}, {"id": 29, "start": 310.5, "end": 319.5, "text": "Ich bestelle meine Spaghetti immer hier. Die Webseite ist wirklich Paynes-Champ. Achtung. Guckt euch die Webseite an. Bestellkarte."}, {"id": 30, "start": 319.5, "end": 328.5, "text": "Moment. Wo gibt es... Wo gibt es Nudeln? Hier gibt es Nudeln. Alter, wer diese Seite gemacht hat, ich weiß auch nicht. Das GIF. Oh Gott, das ist so schrecklich, die Seite."}, {"id": 31, "start": 328.5, "end": 345.5, "text": "Max, doch, es gibt auch viele, die bestellen... Was? Echt? Aber, nee, nee, der Dark Reader macht es eigentlich nur noch besser. Der Dark Reader macht es eigentlich nur noch besser. Guckt, die Seite ist auch ohne Dark Reader. Ziemlich... Naja, Nudeln."}, {"id": 32, "start": 345.5, "end": 362.5, "text": "Über WLAN in der Bahn. Nee, warte mal ab. Das wird nicht lange funktionieren. So, und da muss man mal hier Spaghetti gucken. Nicht glutenfrei. Spaghetti. Hier. Aber was ich mag, ist die Spaghetti..."}, {"id": 33, "start": 362.5, "end": 378.5, "text": "Ach, die gibt es gerade gar nicht. Die haben so ein Set. Normalerweise. Da gibt es dann zwei davon, zwei davon, zwei davon. Gibt einmal die ganz normalen Spaghetti bei denen. Und es gibt auch welche, die sind ein bisschen dunkler. Das sind die, die sind nicht wirklich voll."}, {"id": 34, "start": 378.5, "end": 394.5, "text": "Aber sowas, sowas in der Richtung, aber es scheint es gerade nicht zu geben. Und die sind, obwohl ich nicht, normalerweise nicht, sondern Fan von so Ultra Vollkorn-Protokram bin, die sind wirklich gut, weil die sind ein bisschen fester und die machen viel mehr satt. Und die schmecken irgendwie auch gut."}, {"id": 35, "start": 394.5, "end": 407.5, "text": "Ja, also ich bestelle die Spaghetti immer hier. Also generell die Nudeln bestelle ich hier. Lohnt sich aber nicht wirklich, wenn man nur ab und zu mal einen Pack oder so bestellen muss. Also da muss man schon..."}, {"id": 36, "start": 407.5, "end": 422.5, "text": "Also ab 100 Euro ist das Versand kostenfrei, aber das muss man auch erst mal erreichen. Und die haben noch jede Menge anderen Sachen. Also da bestelle ich gern. Das hat tatsächlich mal jemand im Stream empfohlen. Warum habe ich ein Video von meinem Klo jetzt einfach offen gehabt?"}, {"id": 37, "start": 422.5, "end": 436.5, "text": "Liefer dich auch per LKW. Ich habe keine Ahnung, wie die normalerweise liefern. Am Ende kriegst du es halt per Post. Und nicht per Post, am Ende kommt irgend einer von DHL oder so vorbei und bringt dir dein Paket."}, {"id": 38, "start": 436.5, "end": 451.5, "text": "Da ist sogar immer Stroh drinne zum Polstern. Kannst du die Seite noch mal zeigen hier? Laviala.com"}, {"id": 39, "start": 467.5, "end": 478.5, "text": "Eigentlich ist das irgendein Weingut. Da kannst du 30 Milliarden Weine bestellen, aber das will ich nicht. Also was ich mir schon bestellt habe, ich habe mir so ein paar Sets bestellt. Mein Klo-Video, man. Sets bestellt mit unterschiedlichen Sachen drin."}, {"id": 40, "start": 479.5, "end": 489.5, "text": "Auch mal ein bisschen Süßkram, aber hauptsächlich bestelle ich Nudeln und fülle dann auf, dass man eben auf 100 Euro kommt, dass das Versand kostenfrei ist."}, {"id": 41, "start": 489.5, "end": 496.5, "text": "Ich weiß nicht, ob du sie empfohlen hast, aber die war Proc."}, {"id": 42, "start": 497.5, "end": 514.5, "text": "Ja, aber die sind besser als die vom Lidl. Ich habe auch jahrelang EDK, Lidl und all die Spaghetti gefuttert, aber die Spaghetti von denen sind wirklich besser. Die sind dicker, die sind fester und die schmecken besser."}, {"id": 43, "start": 514.5, "end": 526.5, "text": "Ja, die Spaghetti, die wären ja nicht schlecht. Von OneNote habe ich keine Ahnung."}, {"id": 44, "start": 526.5, "end": 553.5, "text": "Da habe ich keine Ahnung davon, was mit OneNote funktioniert nicht. Ich habe früher mal relativ gerne OneNote verwendet, aber als es noch die Version zum Selbstinstallieren gab, die einfach funktioniert hat und nicht diese ganze komische Online-Integration hatte, aber das ist auch schon 10 Jahre oder länger her. Mittlerweile verwende ich einfach nur noch Plain Text Text Editor fertig."}, {"id": 45, "start": 553.5, "end": 559.5, "text": "So, ich zeige euch mal was Leute, was wir uns heute angucken müssen. Und zwar hören wir kurz meine VM auf."}, {"id": 46, "start": 559.5, "end": 588.5, "text": "Meinst du die Standalone Version? Das, was es damals gab, zu Office 2008 oder so war das, glaube ich. OneNote 2008. Ich war es auch 2003 oder so."}, {"id": 47, "start": 589.5, "end": 604.5, "text": "Nee, das ist schon das Neue. 2003, ich habe es ewig her, wo ich OneNote verwendet habe. Ja, in der Richtung, genau, das da. Das habe ich früher mal relativ viel verwendet."}, {"id": 48, "start": 604.5, "end": 618.5, "text": "Ab 2008 hatte es irgendwie Ribbons und war komisch, genau. 2003 habe ich gerne verwendet. Hat schon ewig her, oder?"}, {"id": 49, "start": 618.5, "end": 638.5, "text": "So, erstmal updaten. Also ich zeige euch mal nebenbei, was ich mir gekauft habe. Und zwar, ich habe mir gekauft eine China-Chinesen-Kamera Reolink E1 Outdoor."}, {"id": 50, "start": 638.5, "end": 647.5, "text": "Wofür habe ich mir die gekauft? Für die Terrasse, dass ich die Katze beobachten kann. Die darf jetzt ja neuerdings raus. Ich glaube, die ist das bei Amazon."}, {"id": 51, "start": 647.5, "end": 668.5, "text": "Ach, derzeit nicht verfügbar, aber ich habe Glück gehabt, dass ich die noch habe. Vielleicht, warte mal. Ist sie doch. Keine Ahnung. So, das Teil habe ich mir bestellt, weil du es schwenken kannst."}, {"id": 52, "start": 668.5, "end": 679.5, "text": "Links, rechts, oben, unten und ein bisschen zoomen kannst. Das ist perfekt, um quasi die gesamte Terrasse zu erfassen, was die Katze auch immer nach draußen treibt."}, {"id": 53, "start": 680.5, "end": 689.5, "text": "Sie hat Infrarot-LEDs für nachtlich und sie hat LEDs mit normalem weißem, weißem LED-Licht, wo ich sogar nachts auch mal kurz die Terrasse hell machen kann."}, {"id": 54, "start": 690.5, "end": 692.5, "text": "Beispielsweise, wenn man von draußen reinkommt und Schlüsselloch sucht oder so."}, {"id": 55, "start": 692.5, "end": 710.5, "text": "Das ist eine ganz gute Kombination. Das Problem ist nur, entweder muss man die über ein mega hässliches Webinterface bedienen, was unpraktikabel ist."}, {"id": 56, "start": 711.5, "end": 719.5, "text": "Nein, nein, nein. Ohne Cloud. Ich habe mir die gekauft, weil die braucht keine Cloud. Die braucht nicht mal eine App zum Einrichten. Es geht alles über einen Browser."}, {"id": 57, "start": 719.5, "end": 735.5, "text": "Es ist ohne Cloud. Mit Cloud würde ich mir ja nicht holen. Entweder musst du das über ein mega hässliches Webinterface machen oder du machst es über die App, was auch dumm ist."}, {"id": 58, "start": 735.5, "end": 754.5, "text": "So, App gibt es, aber will ich nicht. Ich gehe jetzt mal per Webinterface drauf. So, Admin, Passwort, was auch immer Stream-Type da unten ist, keine Ahnung, Login."}, {"id": 59, "start": 754.5, "end": 767.5, "text": "So, ich habe die im Serverraum hinter mir stehen. Also nicht wundern, dass man hier nichts erkennt. So, das sieht halt ziemlich kacke aus, weil das 640x84 Auflösung ist."}, {"id": 60, "start": 767.5, "end": 787.5, "text": "In Wirklichkeit hat die aber, kurz den Darkreader aus, in Wirklichkeit hat die aber 2560x1440. Ihr seid ja schon eingehackt, Chat. Ja, das war mir klar. Ihr seid ja eh richtig krassen Hacker, mehr als immer."}, {"id": 61, "start": 787.5, "end": 807.5, "text": "Wer ist schon drin? Wer ist drin, Chat? Hockqualität, ja. Alle drin, okay. Fuck, IP League. Leute, keine Clips machen. Ich will nicht, dass die IP Public wird."}, {"id": 62, "start": 807.5, "end": 829.5, "text": "Easy. Er hat es schon gut. Na dann. So, zumindest, man kann die steuern. Also, so in der Richtung. Jetzt kann ich die runter machen oder hoch machen."}, {"id": 63, "start": 829.5, "end": 837.5, "text": "Oh guck mal, das Bild hängt. Das ist schlecht. Das ist auch so was, was mir aufgefallen ist, warum das Webinterface komplett unbrauchbar ist."}, {"id": 64, "start": 838.5, "end": 845.5, "text": "Es laggt und es bricht zwischendurch ab. Also das Webinterface ist einfach nur absolut kacke."}, {"id": 65, "start": 845.5, "end": 869.5, "text": "Guckt euch das mal an. Das ist absoluter Witz. So, das erste, was wir machen müssen, ist. Na, hat die Kamera Licht an oder so? Kann das sein? Oder ist das das Licht an der Decke?"}, {"id": 66, "start": 869.5, "end": 881.5, "text": "Sekunde, Leute, ich muss mal kurz das Licht an der. Ne, vorher, bevor ich das Licht an der Decke ausmache, suchen wir uns mal schnell raus, was das Ding für ein RTSP Stream hat, weil den brauchen wir gleich."}, {"id": 67, "start": 882.5, "end": 894.5, "text": "Wir brauchen, wir brauchen ordentlichen RTSP Stream. Also, Reolink E1 Outdoor RTSP. Die hatten RTSP Stream, das weiß ich. Das habe ich schon, hier, das habe ich schon ausprobiert."}, {"id": 68, "start": 894.5, "end": 911.5, "text": "Aber ich habe die Adresse jetzt gerade nicht. Outdoor, hier. Das da braucht man. Oh, der hat sogar einen Generator. 1, 2, 1, 6, 8, 60, 1, 1, 1. Ja, Passwort ist erstmal egal."}, {"id": 69, "start": 911.5, "end": 930.5, "text": "Passwort ist erstmal egal. Ne, Main will ich haben, nicht Sub. Main. Ja, Blödsinn. Main ist da gut auch hoch aufgelöst. Das tut okay. FF Play. FF Play. ECP, haben wir da irgendwas? Ne. FF Play."}, {"id": 70, "start": 930.5, "end": 959.5, "text": "Ach so, na gut, ich kann euch das Passwort verraten. Cute Chat 1, 2, 3. Ich habe das Passwort im Vorfeld geändert. Sind das Ratschenschlüssel auch von Vera? Ja, das sind die hier. Vera Joker. Die sind richtig pock. Wie da sind das? Ja, die waren teuer, aber die sind richtig nice, wenn man sie braucht."}, {"id": 71, "start": 960.5, "end": 971.5, "text": "Oh, Main. Jetzt sollte der das eigentlich abspielen, wenn ich das richtig gemacht habe. GIF, RTSP Stream."}, {"id": 72, "start": 971.5, "end": 989.5, "text": "Ich glaube, der Port ist falsch. Leute, ich glaube, der Port ist falsch. Welcher Port? Einfach mal nMap eine Runde scannen. Can't wait. nMap."}, {"id": 73, "start": 989.5, "end": 1017.5, "text": "Was haben wir denn offen? Zeig her, Ports. Ah, auf nMap. Hab dich mal nicht so. Alter, was ist FTP? Was ist denn da alles offen? Okay, RTSP ist off."}, {"id": 74, "start": 1019.5, "end": 1045.5, "text": "Geht es schien nach Kines? Also das funktioniert nicht so richtig mit dem Port, oder? Was ist denn wenn ich da Müll eingebe als Passwort, kackst du dann ab? Ja, dann geht es nicht."}, {"id": 75, "start": 1045.5, "end": 1046.5, "text": "Geht's nicht."}, {"id": 76, "start": 1046.5, "end": 1054.14, "text": "Screenshot Downloads, so Moment, Moment, wir müssen mal kurz Ports gucken."}, {"id": 77, "start": 1054.14, "end": 1074.42, "text": "Da, ne nicht Netzwerke, Advanced, Ports, RTSP-Port, 554, Ports, RTSP-Port, 554, Ports, RTSP-Port,"}, {"id": 78, "start": 1074.42, "end": 1092.74, "text": "54, das Ding irgendwie kaputt, warum geht das nicht, warum kann ich den RTSP nicht starten?"}, {"id": 79, "start": 1092.74, "end": 1098.02, "text": "Ich, ich weiß, dass es prinzipiell funktioniert, weil ich hab das, ich hab das schon mal gestartet."}, {"id": 80, "start": 1098.02, "end": 1108.98, "text": "VLC vielleicht mal zur Abwechslung, wisst ihr was, wir machen, wir Quoten das mal kurz,"}, {"id": 81, "start": 1108.98, "end": 1109.98, "text": "nur zur Sicherheit."}, {"id": 82, "start": 1109.98, "end": 1121.66, "text": "Warum geht mein Kamerabild nicht, wisst ihr was wir jetzt machen, ich reboote das Ding"}, {"id": 83, "start": 1121.66, "end": 1138.06, "text": "jetzt, ich reboote das Ding jetzt, ich hab das ausprobiert, das funktioniert prinzipiell,"}, {"id": 84, "start": 1138.06, "end": 1148.22, "text": "also ich hab den RTSP-Stream schon ausprobiert, der geht eigentlich, 60, 1, 1, 1, ok, Qt-Chat,"}, {"id": 85, "start": 1148.22, "end": 1159.94, "text": "1, 2, 3, Generate, ja da kann man nicht viel falsch machen, ok, Ping, Reboot hilft, ja,"}, {"id": 86, "start": 1159.94, "end": 1169.78, "text": "ist grad noch nicht da, so, also was ich jetzt eigentlich sagen wollte ist, wir brauchen"}, {"id": 87, "start": 1169.78, "end": 1178.5, "text": "erstmal ein ordentliches Bild von der Kamera, anstatt dieses hängende Web-Interface-Kack-Ding."}, {"id": 88, "start": 1178.5, "end": 1193.7, "text": "Äh, ja, ja, say nein, nein, Alter, warum hab ich überhaupt ein Browser-Fenster hier,"}, {"id": 89, "start": 1193.7, "end": 1213.46, "text": "gut, Qt-Chat, 1, 2, 3, ok, FFPlay, ist das nur TCP, vielleicht, FFPlay, RTSP, Transport-TCP,"}, {"id": 90, "start": 1213.46, "end": 1220.58, "text": "müssen wir vielleicht machen, Alter, jetzt ist mein Firefox geupdatet worden, jetzt"}, {"id": 91, "start": 1220.58, "end": 1226.06, "text": "muss ich meine Liebungskiste neu starten, bestes Timing, bestes Timing überhaupt, doch, der"}, {"id": 92, "start": 1226.06, "end": 1233.22, "text": "kann zwei Streams parallel, das funktioniert, weißt du was, ich mach mal updaten, starte"}, {"id": 93, "start": 1233.22, "end": 1238.26, "text": "meine Liebungskiste neu, ja, ja, Visual Studio, erstmal alles updaten, warum hat die Kamera"}, {"id": 94, "start": 1238.26, "end": 1246.42, "text": "so schlechte Latenz beim Ping, geht eigentlich, guck mal, hier, 5 Millisekunden, man, halt"}, {"id": 95, "start": 1246.42, "end": 1253.54, "text": "WLAN, doch, ich muss meine Linux auch neu starten, weil da hat Kernel Updates gemacht"}, {"id": 96, "start": 1253.54, "end": 1260.38, "text": "und Zeug, halt WLAN, ist halt so, was willst du machen, besser geht's im Prinzip auch"}, {"id": 97, "start": 1260.38, "end": 1272.1, "text": "nicht, das steht quasi in den halben Meter neben dem Access-Point, mal kurz warten bis"}, {"id": 98, "start": 1272.1, "end": 1277.86, "text": "es geupdatet hat, so, also, ich brauche erstmal einen Stream zur Kamera und dann kommt halt"}, {"id": 99, "start": 1277.86, "end": 1286.22, "text": "der Knackpunkt, man kann die Kamera steuern über eine, ich will nicht sagen offizielle"}, {"id": 100, "start": 1286.22, "end": 1293.14, "text": "API, weil ganz offiziell ist es nicht, aber es gibt vom Hersteller API-Docs, die eigentlich"}, {"id": 101, "start": 1293.14, "end": 1298.54, "text": "nicht für die Öffentlichkeit gedacht sind und auch nicht so 100% funktionieren auf jeder"}, {"id": 102, "start": 1298.54, "end": 1309.9, "text": "Kamera, da müssen wir mal gucken, so, hat er geupdatet, Reboot, Bäm, der Kamerastream"}, {"id": 103, "start": 1309.9, "end": 1313.9, "text": "lag nicht, der Kamerastream geht gar nicht, der Kamerastream muss erstmal funktionieren"}, {"id": 104, "start": 1313.9, "end": 1329.54, "text": "per RTSP, dass wir überhaupt weitermachen können, so, was ist das für ein Hintergrund,"}, {"id": 105, "start": 1329.54, "end": 1342.26, "text": "es ist Bing-Image of the Day, ich weiß immer nicht was es ist, Bing, Restore, ok, F of"}, {"id": 106, "start": 1342.26, "end": 1363.06, "text": "play, also, wie bringt man Force F of Mpeg use TCP, transports, F of play, transport TCP"}, {"id": 107, "start": 1363.06, "end": 1378.3, "text": "muss man dran machen, ok, der Stream von der fucking Kamera geht, ok, ich habe nichts gesagt,"}, {"id": 108, "start": 1378.3, "end": 1387.18, "text": "der Stream von der Kamera geht, alles klar, nice, so, jetzt können wir uns hier verbinden,"}, {"id": 109, "start": 1387.18, "end": 1390.58, "text": "jetzt sehen wir das nämlich auch halbwegs, wie aktuell sind wir denn von der Zeit, ah,"}, {"id": 110, "start": 1390.58, "end": 1400.54, "text": "ich habe keine Zeit eingeplant, super, buffer, F of play, Moment, F of play, wie konnte man"}, {"id": 111, "start": 1400.54, "end": 1408.38, "text": "das buffern abschalten von F of play, no buffer, low delay, frame drop, jaja genau, genau das"}, {"id": 112, "start": 1408.38, "end": 1428.3, "text": "will ich haben, alles klar, gib her, no delay, low, low delay, under run, under run, so, also,"}, {"id": 113, "start": 1428.3, "end": 1432.34, "text": "schwenken wir mal, ja, es laggt, guck mal, es laggt deutlich weniger als dieses kacke"}, {"id": 114, "start": 1432.34, "end": 1442.26, "text": "Web Interface hier, das ist so schlecht, alter, switch to flash player, ganz sicher, ganz"}, {"id": 115, "start": 1442.26, "end": 1447.3, "text": "sicher, ja, das sind die guten Vera Joker, Joker Schlüssel, sag mal, ist das, ist das"}, {"id": 116, "start": 1447.3, "end": 1451.62, "text": "das Licht an der Decke oder ist das das Licht von der Kamera, Leute, ich mach mal kurz Serverraum"}, {"id": 117, "start": 1451.62, "end": 1457.62, "text": "Licht aus, ne, das ist nicht das Licht von der Kamera, das ist das Licht von der Decke"}, {"id": 118, "start": 1457.62, "end": 1467.22, "text": "und jetzt geht automatisch Nachtsicht von dem Ding an, ok, alles klar, ne, passt, jetzt"}, {"id": 119, "start": 1467.22, "end": 1471.9, "text": "ist jetzt Licht an der Decke wieder an, so, Licht an der Decke ist wieder an, jetzt switch"}, {"id": 120, "start": 1471.9, "end": 1482.42, "text": "da wieder um, ok, passt, alles gut, so, jetzt haben wir weniger Delay als da drüben, wobei"}, {"id": 121, "start": 1482.42, "end": 1490.02, "text": "jetzt ziemlich, ziemlich gleich, FFPlay Buffer Size, konnte man doch auch noch einstellen,"}, {"id": 122, "start": 1490.02, "end": 1508.1, "text": "Buffer Size 32, wie ging das, Probe Size 32, was ist, der hat, der hat, was hat er denn"}, {"id": 123, "start": 1508.1, "end": 1517.82, "text": "für ein Delay, ne, guck mal, der ist ziemlich, der ist eigentlich ziemlich gut dabei, ja,"}, {"id": 124, "start": 1517.82, "end": 1521.94, "text": "guck mal, der Stream funktioniert viel besser, übrigens, da steht drüben im Serverraum"}, {"id": 125, "start": 1521.94, "end": 1525.26, "text": "auf meinem 3D Drucker, das Ding, also nicht wundern, ich darf jetzt bloß nicht die Tür"}, {"id": 126, "start": 1525.26, "end": 1535.86, "text": "aufmachen, keck wait, so, so, gehen wir an meine Werkzeugwand, kann man das Bild noch"}, {"id": 127, "start": 1535.86, "end": 1555.1, "text": "irgendwie flippen, wobleak, genau, so, wobleak, flip, kann man das Bild flippen, Video Settings,"}, {"id": 128, "start": 1555.1, "end": 1571.38, "text": "Advanced Settings, Image, ah, hier, Ne, ne, ne, Mirron, Rotate, ah, so ist gut, so, so"}, {"id": 129, "start": 1571.38, "end": 1576.46, "text": "ist gut, jetzt erkennt man auch was, alles klar, ok, also das erste Problem hätten"}, {"id": 130, "start": 1576.46, "end": 1585.06, "text": "wir schon mal gelöst, die Kamera funktioniert prinzipiell, hat zwar nicht die krasseste,"}, {"id": 131, "start": 1585.06, "end": 1598.62, "text": "Bitrate gerade, was hatten die für eine Bitrate eingestellt, standardmäßig hier, 1506, also"}, {"id": 132, "start": 1598.62, "end": 1620.1, "text": "1,5 MBit, das ist ja nix, 15 FPS ist ok, keine Ahnung, 8, save, kackt das jetzt ab,"}, {"id": 133, "start": 1620.1, "end": 1635.14, "text": "oder macht es on the fly, es verschiebt sich immer noch eklig, ich guck mal kurz VLC,"}, {"id": 134, "start": 1635.14, "end": 1641.26, "text": "was VLC meint, was es für eine Bitrate hat, wie heißt die Kamera noch mal, das ist eine"}, {"id": 135, "start": 1641.26, "end": 1652.82, "text": "Reolink E1 Outdoor, achja, VLC geht ja nicht, weil VLC nicht TCP, geht ja ins Smart, ok,"}, {"id": 136, "start": 1652.82, "end": 1669.9, "text": "kann FFplay Statistiken wie Bitrate anzeigen, oh, ist einfach weg, Alter, was ist jetzt,"}, {"id": 137, "start": 1669.9, "end": 1678.98, "text": "Quick Wait, wahrscheinlich muss ich die neu starten für die, na ist auch egal, die Bitrate"}, {"id": 138, "start": 1678.98, "end": 1685.42, "text": "ist jetzt nicht unser Problem Leute, die Bitrate ist nicht unser Problem, ok, höher kann ich"}, {"id": 139, "start": 1685.42, "end": 1690.58, "text": "die nicht mal stellen anscheinend, kann man diesen Müll hier nicht einfach zu machen,"}, {"id": 140, "start": 1690.58, "end": 1712.3, "text": "FFplay, Display, Bitrate, kann das FFplay, FFplay, na FFpro bringt mir jetzt an der Stelle"}, {"id": 141, "start": 1712.3, "end": 1729.38, "text": "nichts, können M-Player verwenden, vielleicht ist M-Player besser, testen wir mal durch,"}, {"id": 142, "start": 1729.38, "end": 1759.34, "text": "M-Player, unauthorized, FFprobe, Bitrate, ach ich noob, das ist der, das ist der, das"}, {"id": 143, "start": 1759.34, "end": 1765.42, "text": "ist der Crap Stream, Leute, das ist der Müll Stream, ich brauch Main, dann ist auch die"}, {"id": 144, "start": 1765.42, "end": 1783.18, "text": "hohe Quali, das ist der Dreck Stream, ja, das ist doch schonmal deutlich besser jetzt,"}, {"id": 145, "start": 1783.18, "end": 1789.46, "text": "ich mein es lag zwar aus Gründen, komm wir machen mal Start Calibration, da fährt es"}, {"id": 146, "start": 1789.46, "end": 1807.1, "text": "einmal im Kreis rum, da können wir zugucken, auf, ja, das ist doch jetzt schonmal besser,"}, {"id": 147, "start": 1807.1, "end": 1817.62, "text": "das ist doch jetzt schonmal deutlich besser, Coggers ist das jetzt, Coggers, genau, ok,"}, {"id": 148, "start": 1817.62, "end": 1823.78, "text": "sehr schön, jetzt ist er hier am Kalibrieren, jetzt ist das irgendwie mit der Übertragung"}, {"id": 149, "start": 1823.78, "end": 1828.98, "text": "abgekackt, sehr schön, ja genau, genau schön auf die Tür fokussieren, dass ich mich selber"}, {"id": 150, "start": 1828.98, "end": 1836.7, "text": "liege, warum ist das so ein hohes Delay, das liegt, pass mal auf, ich mach das mal wieder"}, {"id": 151, "start": 1836.7, "end": 1850.94, "text": "runter, ich könnt mir vorstellen, Low Delay ist es ja angeblich, ne, jetzt ist kein Delay,"}, {"id": 152, "start": 1850.94, "end": 1855.62, "text": "das liegt, dass die CPU es mit dem Encoding wahrscheinlich überfordert, wobei die Bitrate"}, {"id": 153, "start": 1855.62, "end": 1863.26, "text": "einen nicht wirklich einen großen Unterschied macht, so, aber jetzt das Delay ist ok, so"}, {"id": 154, "start": 1863.26, "end": 1869.62, "text": "wunderbar, also das funktioniert, so das ist das erste haben wir schonmal geschafft,"}, {"id": 155, "start": 1869.62, "end": 1881.1, "text": "hupps, jetzt hab ich zugemacht, ich noob, ich will diesen komischen Preview zumachen,"}, {"id": 156, "start": 1881.1, "end": 1885.34, "text": "kann man hier unten vielleicht einfach stopp drücken und dann hört er auf, achso, ja,"}, {"id": 157, "start": 1885.34, "end": 1894.38, "text": "nice, dann kann ich nämlich immer noch steuern, so, also was wir jetzt machen müssen ist,"}, {"id": 158, "start": 1894.38, "end": 1903.78, "text": "oder was ich rauskriegen muss ist folgendes, wie kann man diese Pan, Tilt, Zoom Sachen"}, {"id": 159, "start": 1903.78, "end": 1911.1, "text": "kontrollieren über die API, wie kann ich Infrarot LEDs an und ausschalten über die"}, {"id": 160, "start": 1911.1, "end": 1921.22, "text": "API und wie kann ich das Licht an und ausschalten über die API und wie kann ich Presets anfahren"}, {"id": 161, "start": 1921.22, "end": 1929.94, "text": "über die API, so, das muss ich jetzt irgendwie rauskriegen und ich glaube am besten kriegt"}, {"id": 162, "start": 1929.94, "end": 1937.42, "text": "man das raus über die Browser Tools, ja, weil wenn ich jetzt zum Beispiel hier nach"}, {"id": 163, "start": 1937.42, "end": 1953.34, "text": "unten klicke, dann seh ich, aha, API, CMD, PTZ Control und dann irgendeinen Talken, bau"}, {"id": 164, "start": 1953.34, "end": 1967.34, "text": "dir ein Roboterarm, der das drückt, sehr gute Idee, was denn das, von KS, Böööööö,"}, {"id": 165, "start": 1967.34, "end": 1982.06, "text": "Chat, irgendeine glorreiche Idee was das ist, Base64 vielleicht, Base64 Decode, ach, was"}, {"id": 166, "start": 1982.06, "end": 1993.1, "text": "mach ich denn, das ist noch Schwachsinn, Echo, Lul, Gott, Base64 minus D, Chat, von wegen,"}, {"id": 167, "start": 1993.1, "end": 2007.94, "text": "das ist Base64, der Chat leckt Critical Information, Echo minus N, das dürfte jetzt glaube ich"}, {"id": 168, "start": 2007.94, "end": 2022.1, "text": "nicht so einen großen Unterschied machen, ok, was könnte das sein Chat, vielleicht ist"}, {"id": 169, "start": 2022.1, "end": 2029.98, "text": "das China-Chinesen Decoding, vielleicht ist das Chinesisch, das ist nicht UTF8 oder so,"}, {"id": 170, "start": 2029.98, "end": 2041.66, "text": "das ist China-Chinesen Kram, ich glaub da kommen, was könnte das, es sieht aber doch"}, {"id": 171, "start": 2041.66, "end": 2059.3, "text": "schon hart aus wie Base64 oder, Chunker, wie meine Katze, aber das brauchen wir gar nicht,"}, {"id": 172, "start": 2059.3, "end": 2071.82, "text": "ich hab im Vorfeld schon mal geguckt, es gibt nämlich eine Reolink-RP-Documentation, unten"}, {"id": 173, "start": 2071.82, "end": 2076.9, "text": "bei Projekte auf GitHub, wo man sich Sachen angucken kann, wie das andere Leute machen,"}, {"id": 174, "start": 2076.9, "end": 2094.26, "text": "ja, Vakuk, schön, dass du einen Weg her gefunden hast, Reolink-World-Commands, Doc, DocX, was"}, {"id": 175, "start": 2094.26, "end": 2101.22, "text": "sonst, ja, DocX, wie krieg ich denn das jetzt geöffnet Leute, gescheit, brauch ich jetzt"}, {"id": 176, "start": 2101.22, "end": 2118.54, "text": "mit allen Ernstes LibreOffice, dass ich das aufmachen kann, Fresh, LibreOffice Fresh,"}, {"id": 177, "start": 2118.54, "end": 2130.86, "text": "was ist denn die Alternative zu Fresh, Still, was, können die ihre Pakete nicht mal so benennen,"}, {"id": 178, "start": 2130.86, "end": 2139.3, "text": "dass man versteht, was gemeint ist, ne, Fresh AF, der Name ist gut, aber das ist für Afrikans,"}, {"id": 179, "start": 2139.3, "end": 2151.22, "text": "Alter, das ist irgendwie so ein Zulul-Niederländisch-Ding, Zulul-Niederländisch ist das, was ist denn"}, {"id": 180, "start": 2151.22, "end": 2160.46, "text": "der Unterschied, LibreOffice Fresh versus Still, was ist der Unterschied, die Still-Version"}, {"id": 181, "start": 2160.46, "end": 2166.22, "text": "ist eine stabile und ausgiebig getestet, die Fresh ist, mein Gott, können die ihren Shit"}, {"id": 182, "start": 2166.22, "end": 2175.86, "text": "nicht einfach irgendwie einheitlich sein, was spricht denn gegen Test und Stable, oder"}, {"id": 183, "start": 2175.86, "end": 2184.62, "text": "Stable und Def, oder Stable und Beta, oder Release und Beta, warum muss es Fresh und"}, {"id": 184, "start": 2184.62, "end": 2196.54, "text": "Still sein, oh, meine Güte, ey, das ist doch nicht mal Marketing-Stonks, das ist einfach"}, {"id": 185, "start": 2196.54, "end": 2205.82, "text": "dumm, ok, wir wollen Fresh, wir wollen Fresh, was ist das normale LibreOffice-Paket, hier"}, {"id": 186, "start": 2205.82, "end": 2212.82, "text": "blicke ich ja gar nicht mehr durch, gibt so viele Packages, LibreOffice, zu, gibt's"}, {"id": 187, "start": 2212.82, "end": 2223.46, "text": "nicht einfach ganz normal LibreOffice, einfach ganz, ah, Fresh, ganz unten, zwei, ja, Boost,"}, {"id": 188, "start": 2223.46, "end": 2231.94, "text": "mehr Z plus plus Shit, gib her, jetzt muss ich mir tatsächlich LibreOffice installieren,"}, {"id": 189, "start": 2231.94, "end": 2237.78, "text": "nur damit ich ein komisches Doc, welcher Hersteller veröffentlicht seine API-Docs in Doc, ich"}, {"id": 190, "start": 2237.78, "end": 2247.66, "text": "meine, es heißt nicht Doc, weil es ein Doc-Word-Doc sein muss, konvertiere es online, warum soll"}, {"id": 191, "start": 2247.66, "end": 2255.62, "text": "ich es konvertieren, warum ist es nicht gleich in einem PDF, erst mal 600 MB, soll er öffnen"}, {"id": 192, "start": 2255.62, "end": 2263.86, "text": "jetzt, gib ihm, da, LibreOffice, ja genau, hier, baue sehr viel Platz für, also, RTMP,"}, {"id": 193, "start": 2263.86, "end": 2287.02, "text": "Mainstream, Extstream, RTMP, Substream, warum hat das Ding RTMP und RTSP, FLV, RTSP, wo"}, {"id": 194, "start": 2287.02, "end": 2293.74, "text": "ist denn der Sinn davon, das ist, das geht doch eh alles durch den gleichen Encoder,"}, {"id": 195, "start": 2293.74, "end": 2300.58, "text": "das ist doch alles nur Transportverpackung drumherum, bei euch war die Sache auch noch"}, {"id": 196, "start": 2300.58, "end": 2310.98, "text": "in DocX, ja, bei uns ist ganz vieles in Excel, was mich auch immer unglaublich fasziniert,"}, {"id": 197, "start": 2310.98, "end": 2319.42, "text": "wie die das hinbekommen, den ganzen Müll da in Excel, naja, Business Stonks Zeug halt,"}, {"id": 198, "start": 2319.42, "end": 2335.74, "text": "so Playback-Uhrl, was, nein, nein, nein, nein, API-Docs, Open den Google Advanced Rest Client,"}, {"id": 199, "start": 2335.74, "end": 2348.58, "text": "ne, ich brauch, da kann ich auch Postman nehmen, ich brauch irgendwas, wo ich die ganzen Befehle"}, {"id": 200, "start": 2348.58, "end": 2359.78, "text": "drin stehen hab, Playback, was wollen die denn überhaupt von mir, the fuck, das ist"}, {"id": 201, "start": 2359.78, "end": 2375.14, "text": "ja mal das uselesste Dokument überhaupt, das stimmt doch überhaupt nicht, guck mal,"}, {"id": 202, "start": 2375.14, "end": 2380.14, "text": "das ist schlicht und ergreifend gelogen, was da drin steht, das ist was ganz anderes,"}, {"id": 203, "start": 2380.14, "end": 2396.62, "text": "das Dokument, das ist einfach, das ist wieder typische China Craft, Alter, ja, das mit Login"}, {"id": 204, "start": 2396.62, "end": 2404.94, "text": "hab ich auch gelesen, PDF, ja, wo haben die noch einen PDF, guck mal, PDF Attached, kann"}, {"id": 205, "start": 2404.94, "end": 2410.54, "text": "es sein, dass die ja selbst nicht so genau wissen, was die hier angehängt haben, okay,"}, {"id": 206, "start": 2410.54, "end": 2421.54, "text": "wir suchen, wir können immer noch hier nachgucken, der Download-Button zeigt aufs gleiche, ja,"}, {"id": 207, "start": 2421.54, "end": 2434.02, "text": "User Guide, hier, User Guide, Google Drive, jawoll, sehr vertrauenserweckend, lad mir"}, {"id": 208, "start": 2434.02, "end": 2456.82, "text": "das besser mal runter, das ist wahrscheinlich die Vorgänger-Version davon, Version 5, Moment,"}, {"id": 209, "start": 2456.82, "end": 2465.46, "text": "sieht anders aus, die Seite, ah, das, das, okay, ah, das sieht schon besser aus, guck"}, {"id": 210, "start": 2465.46, "end": 2478.78, "text": "mal, Control, PTZ und so hab ich da eben gelesen, PTZ Control, PTZ Control, ja, das sowas hab"}, {"id": 211, "start": 2478.78, "end": 2493.66, "text": "ich gesucht, Interface Description, IP, RPCGI, CMT, PTZ Control, okay, wie machen wir Login,"}, {"id": 212, "start": 2493.66, "end": 2504.46, "text": "Login, Login, Login, Login, Moment, Security Login, Seite 78, also, mich würde sehr wundern,"}, {"id": 213, "start": 2504.46, "end": 2515.82, "text": "ob Seite 78 wirklich Seite 78 ist, nee, Seite 14 ist Seite 78, alles klar, also, Post Request"}, {"id": 214, "start": 2515.82, "end": 2522.86, "text": "oder vielleicht kommt, vielleicht kommt ja auf Seite 78 noch was, nee, Seite 132 kommt"}, {"id": 215, "start": 2522.86, "end": 2532.54, "text": "das nächste wieder, das schien erzeugen, also, ergeblich steht es auf Seite 78, finden tut"}, {"id": 216, "start": 2532.54, "end": 2543.66, "text": "was auf Seite 14 und auf Seite 132, alles klar, okay, aber das sieht doch schon mal gut aus,"}, {"id": 217, "start": 2543.66, "end": 2555.5, "text": "it is used to get Token, ich wollte schon immer Token getten, also Request, Post, also IP"}, {"id": 218, "start": 2555.5, "end": 2571.5, "text": "CMT Login, Post Data, CMT Login, Moment, ich paste auf Command, Login und muss dann in"}, {"id": 219, "start": 2571.5, "end": 2590.34, "text": "dem Post nochmal CMT Login machen, sehe ich das richtig, ja, okay, na gut, dann probieren"}, {"id": 220, "start": 2590.34, "end": 2595.34, "text": "wir das doch mal aus, jetzt was da steht, machen wir unsere IDE auf, Moment, die muss"}, {"id": 221, "start": 2595.34, "end": 2601.78, "text": "ich glaube ich noch updaten vorher, es gab doch jetzt irgendeine neue Version oder vertue"}, {"id": 222, "start": 2601.78, "end": 2609.42, "text": "ich mich da, aber wir brauchen einen guten Namen für das Projekt, ja, Moment, wollen"}, {"id": 223, "start": 2609.42, "end": 2620.46, "text": "wir erstmal updaten, GoLand, Datacryp, ja, update mal, wobei, warum habe ich Datacryp"}, {"id": 224, "start": 2620.46, "end": 2627.74, "text": "nochmal installiert, Chat, was haben wir da gemacht, wir haben, ah, das war diese Postgres"}, {"id": 225, "start": 2627.74, "end": 2637.98, "text": "Geschichte mit Autocomplete und, Autocomplete und Textsuche, Autocomplete Textsuche war"}, {"id": 226, "start": 2637.98, "end": 2643.94, "text": "das, ja, genau, genau, hast du das GitHub Projekt Reolink gesehen, ja, ich weiß, wir"}, {"id": 227, "start": 2643.94, "end": 2666.78, "text": "können abgucken, hm, das habe ich gesehen, gibt es da was für.NET, ich glaube ich lasse"}, {"id": 228, "start": 2666.78, "end": 2685.78, "text": "gerade, wir können mal kurz gucken, Reolink, rp.net, GitHub, Go, weißen Zeug, das war wohl"}, {"id": 229, "start": 2685.78, "end": 2700.5, "text": "ein leerer Query lang gebraucht hat, ja, leeres Query, das hat länger gebraucht, Moment, kann"}, {"id": 230, "start": 2700.5, "end": 2708.58, "text": "man, Language, ne, okay, wir suchen einfach mal Reolink und sagen dann Language, Alter,"}, {"id": 231, "start": 2708.58, "end": 2717.1, "text": "die VM ist aber ganz schön hart am Lenken mit dem Update hier, so, und jetzt sagen wir"}, {"id": 232, "start": 2717.1, "end": 2726.18, "text": "Language, ah, das gibt es gar nicht für, gibt nichts für.NET, okay, nein, nein, nein,"}, {"id": 233, "start": 2726.18, "end": 2733.34, "text": "nein, das hätte ich fast, der Teufel persönlich hier, ne, gibt es anscheinend nicht, ist auch"}, {"id": 234, "start": 2733.34, "end": 2739.06, "text": "egal, die paar Dinge kriegen wir auch selbst gebastelt, ist ja grad Sinn und Zweck der"}, {"id": 235, "start": 2739.06, "end": 2747.46, "text": "Sache, also, wir brauchen einen guten Projektname, CamChamp, haben wir sowas vielleicht schon"}, {"id": 236, "start": 2747.46, "end": 2761.34, "text": "mal gehabt, ne, haben wir nicht, also, New Solution, CamChamp, sehr gut, okay, great,"}, {"id": 237, "start": 2761.34, "end": 2778.02, "text": "Backcam hatten wir schon mal, Spannerchamp, das ist nicht schlecht, Spannerchamp, so,"}, {"id": 238, "start": 2778.02, "end": 2794.22, "text": "das hauen wir mal kurz weg, so, also, Rider, CamChamp,.NET Run, jetzt probieren wir das"}, {"id": 239, "start": 2794.22, "end": 2808.22, "text": "mal aus, ja, Hello World, alles, alles gut, also, wie machen wir das denn, CW, WTF, sag"}, {"id": 240, "start": 2808.22, "end": 2821.02, "text": "mal, Spack Rider immer noch rum hier mit Single File Kram, CW, hä, CW, okay, was auch"}, {"id": 241, "start": 2821.02, "end": 2836.82, "text": "immer, witzig, also, ähm, tja, na, Hello World ist Schwachsinn, also, Klaas, Kamera,"}, {"id": 242, "start": 2836.82, "end": 2858.98, "text": "AP, Public Static Login oder so, Login, so, jetzt probieren wir mal aus, ob das funktioniert,"}, {"id": 243, "start": 2858.98, "end": 2867.9, "text": "was die da treiben, irgendwie so, Talken, oder immer, gut, also, jetzt brauchen wir"}, {"id": 244, "start": 2867.9, "end": 2873.9, "text": "Kamera, AP, Login, so, und jetzt loggen wir uns hier mal ein, also, wie funktioniert das"}, {"id": 245, "start": 2873.9, "end": 2878.46, "text": "jetzt mit dem Login, das steht doch hier irgendwo, also, CMD Login, das probieren wir jetzt mal"}, {"id": 246, "start": 2878.46, "end": 2891.42, "text": "mit Curl erst mal aus, Curl minus X, und zwar ist das ein Post, und dann gehen wir auf 192.168.60.111,"}, {"id": 247, "start": 2891.42, "end": 2898.38, "text": "Login failed, ja, ach, das ist ja klar, ich hab ja keine Benutzer eingegeben, okay, Aram,"}, {"id": 248, "start": 2898.38, "end": 2919.02, "text": "User, Username, Admin, Passport, äh, also, wie jetzt, minus D, und warum ist das in einem"}, {"id": 249, "start": 2919.02, "end": 2928.02, "text": "Array drinne, und das Array ist gar nicht geschlossen unten, ach, doch, hier, wat, Array, Objekt,"}, {"id": 250, "start": 2928.02, "end": 2942.58, "text": "was zum, was machen die Chinesen denn da wieder für Dinger, CMD Login, okay, Param, was ist"}, {"id": 251, "start": 2942.58, "end": 2952.82, "text": "das denn, Param, da muss man Klammer wieder zu machen, ähm, User, boah, das ist aber"}, {"id": 252, "start": 2952.82, "end": 2962.62, "text": "schon ein bisschen wie, ja, nochmal wieder Klammer zu, ich finde grad nicht, User, Admin,"}, {"id": 253, "start": 2962.62, "end": 2982.34, "text": "Passport, Passport ist QChat123, Kunst, easy, okay, wir kriegen einen Token, also, ich vermute"}, {"id": 254, "start": 2982.34, "end": 2988.78, "text": "mal, das Name, das eigentliche Login-Token ist, was wir dann brauchen für weitere Requests,"}, {"id": 255, "start": 2988.78, "end": 3009.54, "text": "okay, Copy Paste, wir haben uns den Kram mal kurz hier rein, also, ähm, HTTP, HTTP Client,"}, {"id": 256, "start": 3009.54, "end": 3021.94, "text": "die können wir auch irgendwie global oder so machen dann, ähm, HTTP Client, Post, ja,"}, {"id": 257, "start": 3021.94, "end": 3030.66, "text": "das ist in der falschen Reihenfolge, da meckert er jetzt, ach so, ja, gut, das müssen wir"}, {"id": 258, "start": 3030.66, "end": 3042.22, "text": "erwarten, machen wir alles, okay, Post Async, also, wir wollen es dahin posten, also dahin"}, {"id": 259, "start": 3042.22, "end": 3052.22, "text": "unseren Request, HTTP Content, Strings und dann, ja, wie kriege ich denn den Müll jetzt"}, {"id": 260, "start": 3052.22, "end": 3062.18, "text": "gescheit, Top Level Await, ja, muss ich mal vorstellen, das gibt es noch gar nicht so"}, {"id": 261, "start": 3062.18, "end": 3068.66, "text": "lange, das kriege ich, oh, das muss ich jetzt wieder 30.000 Mal eskapen, vielleicht hätten"}, {"id": 262, "start": 3068.66, "end": 3081.78, "text": "wir es doch mit der Python-Abi machen sollen, okay, wir gehen an Data, gleich, hat sie Schaap,"}, {"id": 263, "start": 3081.78, "end": 3087.9, "text": "sowas wie Python-Triple Quotes hatten die noch nie, ne, die haben jetzt nur Template"}, {"id": 264, "start": 3087.9, "end": 3102.74, "text": "Strings, C-Sharp, Triple Quotes, sowas haben die nicht, ne, Copy JSON-S-Class, ach, ist"}, {"id": 265, "start": 3102.74, "end": 3114.14, "text": "das was, was die in Rider drin haben oder wie, ne, wie, oder was meinst du, vielleicht"}, {"id": 266, "start": 3114.14, "end": 3127.82, "text": "doch C++, ne, ne, das ist blödsinn, was der Typ schreibt, ne, ne, das ist blödsinn, was"}, {"id": 267, "start": 3127.82, "end": 3150.58, "text": "der Typ schreibt, ja, Rust, was interessiert, was ist mit den Rust Leuten eigentlich immer"}, {"id": 268, "start": 3150.58, "end": 3168.06, "text": "verkehrt, dass die bei so einer Frage reinkommen und sagen, ja, aber Rust, ja, Zellattenzaun,"}, {"id": 269, "start": 3168.06, "end": 3181.62, "text": "ach, guck mal, es gibt ein Proposal, alles klar, ist wurscht, wir eskapen das jetzt,"}, {"id": 270, "start": 3181.62, "end": 3198.58, "text": "zack, abfuck, äh, was hat er für Schmerzen, warum muss ich das jetzt nicht eskapen, ach,"}, {"id": 271, "start": 3198.58, "end": 3205.86, "text": "ne, weil ich das nicht escaped hab, iiiiigitt, das waren jetzt nur einmal zum testen, danach"}, {"id": 272, "start": 3205.86, "end": 3215.38, "text": "muss ich mir da irgendwas anderes überlegen, das ist ja eklig, ne, schon wieder vergessen,"}, {"id": 273, "start": 3215.38, "end": 3227.3, "text": "iiiiih, so viel eskabe, ne, das muss ich nicht eskampen, ok, String-Data, alles klar, braucht"}, {"id": 274, "start": 3227.3, "end": 3236.98, "text": "er sonst noch was, ne, ich glaub, das wars, muss ich ihm noch Content-Typs sagen, ne, Encoding,"}, {"id": 275, "start": 3236.98, "end": 3255.78, "text": "äh, UTF-8, wahrscheinlich, vermute ich mal, Media-Type, äh, Application-Jason, vermutlich,"}, {"id": 276, "start": 3255.78, "end": 3259.22, "text": "damit er jetzt wirklich sicher zu sein, was der haben will, so, jetzt schauen wir mal,"}, {"id": 277, "start": 3259.22, "end": 3268.38, "text": "ob das ganze funktioniert, ob ich mich jetzt da einloggen kann, äh, Result, oder Response,"}, {"id": 278, "start": 3268.38, "end": 3282.34, "text": "meinetwegen, Read, ne, wie war das, Body, ach, vergessen, Content, Read, S-String, ja,"}, {"id": 279, "start": 3282.34, "end": 3292.94, "text": "oh, wait, ok, führen wir mal aus, gucken, ob das funktioniert,.net, Run, äh, was, ach,"}, {"id": 280, "start": 3292.94, "end": 3318.1, "text": "so, jaja, blub, alles klar, please log in first, äh, das hat nicht so funktioniert,"}, {"id": 281, "start": 3318.1, "end": 3341.46, "text": "wie ich mir das vorstelle, äh, warum, das Hochkammeranfang muss doch weg, wo, ah, warum,"}, {"id": 282, "start": 3341.46, "end": 3351.5, "text": "was macht das da, wie kommt das da hin, und die schließende Array-Klammer ist auch weg,"}, {"id": 283, "start": 3351.5, "end": 3358.14, "text": "null, ja, kein Wunder, da kann den Gram nicht pasen, ah, das sieht schon besser aus, das"}, {"id": 284, "start": 3358.14, "end": 3368.82, "text": "sieht doch schon besser aus, also, hier, talken, ok, wir brauchen jetzt eh eine Runde, äh,"}, {"id": 285, "start": 3368.82, "end": 3389.54, "text": "zu gibt, ich nehme das, ich weiß, es ist mittlerweile eingebaut, aber, so, also, dann, chasen, convert,"}, {"id": 286, "start": 3389.54, "end": 3399.42, "text": "please serialize, dynamic, das finde ich tatsächlich ganz praktisch, wenn man dafür dynamic verwendet,"}, {"id": 287, "start": 3399.42, "end": 3406.02, "text": "so, und jetzt können wir uns das Talken raus holen, also, wo ist das, das erste Array-Element,"}, {"id": 288, "start": 3406.02, "end": 3420.34, "text": "mal gucken, ob das jetzt funktioniert, also, json, das erste Array-Element, darin, dann,"}, {"id": 289, "start": 3420.34, "end": 3431.98, "text": "value, darin, Talken, darin, name, ob das jetzt klappt, schauen wir mal, hey, funktioniert,"}, {"id": 290, "start": 3431.98, "end": 3438.9, "text": "straightforward, easy!"}, {"id": 291, "start": 3438.9, "end": 3443.9, "text": "Wenn du dich entscheiden müsstest, Svelte-Kit oder Nuxt drei, Nuxt ist React, ich hab keine"}, {"id": 292, "start": 3443.9, "end": 3447.84, "text": "große Ahnung von React, ich wäre Svelte-Kit nehmen, weil ich mich damit auskenne und von"}, {"id": 293, "start": 3447.84, "end": 3453.58, "text": "React keinen Plan hab, so, jetzt sollten wir vielleicht noch irgendwie mal testen, ob das"}, {"id": 294, "start": 3453.58, "end": 3461.42, "text": "funktioniert, wir machen da einfach überall, Nulldings-Checks dahinter, so, und, also,"}, {"id": 295, "start": 3461.42, "end": 3473.62, "text": "Wir verlassen uns einfach drauf."}, {"id": 296, "start": 3473.62, "end": 3477.18, "text": "Warum muss man den Text eskapen?"}, {"id": 297, "start": 3477.18, "end": 3482.18, "text": "Was denn?"}, {"id": 298, "start": 3482.18, "end": 3486.62, "text": "Das da?"}, {"id": 299, "start": 3486.62, "end": 3494.74, "text": "Naja, weil du Strings in C-Sharp mit doppelten Quotes machst und wenn du in diesem String"}, {"id": 300, "start": 3494.74, "end": 3499.46, "text": "doppelte Quotes verwenden willst, dann weiß er ja nicht, ob das Teil vom String ist oder"}, {"id": 301, "start": 3499.46, "end": 3500.46, "text": "Stringende."}, {"id": 302, "start": 3500.46, "end": 3502.34, "text": "Deswegen musst du die eskapen."}, {"id": 303, "start": 3502.34, "end": 3510.34, "text": "Was nimmt C-Sharp 10 und passt das in eine Funktion mit Argument?"}, {"id": 304, "start": 3510.34, "end": 3513.34, "text": "Was?"}, {"id": 305, "start": 3513.34, "end": 3521.46, "text": "Ach Nuxt ist Vue.js, stimmt, das habe ich, Next ist React, so rum war das, ne?"}, {"id": 306, "start": 3521.46, "end": 3527.66, "text": "Ganz ehrlich, wenn ich einfach nur möchte, dass es funktioniert ohne großartig rumgucken,"}, {"id": 307, "start": 3527.66, "end": 3529.1, "text": "dann würde ich wahrscheinlich Vue nehmen."}, {"id": 308, "start": 3529.1, "end": 3539.38, "text": "Das Feld ist auch nicht ganz so umfangreich und so gut alles Mögliche beschrieben."}, {"id": 309, "start": 3539.38, "end": 3545.02, "text": "Zwerg-Cringer, weil ich faul bin, weil ich da zu viel überlegen muss."}, {"id": 310, "start": 3545.02, "end": 3562.02, "text": "So, throw, new, new IO-Exception oder irgendwie sowas, was weiß ich, put not connect, so wunderbar,"}, {"id": 311, "start": 3562.02, "end": 3563.02, "text": "Kamera."}, {"id": 312, "start": 3563.02, "end": 3571.98, "text": "Gut, wir haben es geschafft, also wir kriegen jetzt ein neues Kameraobjekt zurück mit dem"}, {"id": 313, "start": 3571.98, "end": 3577.34, "text": "richtigen Token, das heißt, damit können wir jetzt tatsächlich Dinger machen."}, {"id": 314, "start": 3577.34, "end": 3597.3, "text": "Zum Beispiel, ach so, ich muss gucken, ob es ungleich Null ist, naja, was, wo ich das"}, {"id": 315, "start": 3597.3, "end": 3598.3, "text": "noch tue?"}, {"id": 316, "start": 3598.3, "end": 3607.18, "text": "Ach Moment, was mache ich denn hier, ist doch Schwachsinn, lull, Moment, Moment, wir könnten"}, {"id": 317, "start": 3607.18, "end": 3614.86, "text": "doch jetzt, oh, wie ging das jetzt wahr, value, ne, wie konnte man das noch mal schreiben?"}, {"id": 318, "start": 3614.86, "end": 3623.74, "text": "Ah, neue C-Sharp-Features, can't wait, äh, wie ging das jetzt noch mal, ging das überhaupt,"}, {"id": 319, "start": 3623.74, "end": 3628.74, "text": "was ich davor habe?"}, {"id": 320, "start": 3628.74, "end": 3648.06, "text": "Ah, so rum, oh, ich will nicht checken, ist wahr, ist string, so, geht das, wobei ne, string"}, {"id": 321, "start": 3648.06, "end": 3655.18, "text": "ist es ja nicht, es ist ja Jason-Objekt oder so, warte mal, wie kann ich denn das jetzt"}, {"id": 322, "start": 3655.18, "end": 3669.5, "text": "in einem, in einem Aufrutsch machen, jaja, äh, mach ich das jetzt in einem Aufrutschgeschein,"}, {"id": 323, "start": 3669.5, "end": 3675.02, "text": "ich mein, ich könnte sagen und und value ungleich Null, aber das ist sicherlich nicht schön."}, {"id": 324, "start": 3675.02, "end": 3687.78, "text": "Was?"}, {"id": 325, "start": 3687.78, "end": 3704.7, "text": "Okay, äh, kann das sein, dass ich noch, Moment, ich muss noch sowas machen, ahhh ja, ja, ja,"}, {"id": 326, "start": 3704.7, "end": 3721.94, "text": "ja das ist doch schon besser ja das ist das was ich eigentlich machen wollte ja ja ich"}, {"id": 327, "start": 3721.94, "end": 3727.54, "text": "weiß es gibt zig tausend packages für alles ja so will ich das haben das ist das was ich"}, {"id": 328, "start": 3727.54, "end": 3733.06, "text": "eigentlich genau so das war dann schön das kann bestimmt ein bisschen klarer schreiben aber ich"}, {"id": 329, "start": 3733.06, "end": 3744.66, "text": "will erstmal checken wie ich meine never used warum gut also was machen wir jetzt als nächstes wir"}, {"id": 330, "start": 3744.66, "end": 3749.46, "text": "müssen gucken wie wir den kram hin und her drehen können also wie funktioniert das ganze login"}, {"id": 331, "start": 3749.46, "end": 3753.58, "text": "login haben wir schon gemacht so jetzt müssen wir gucken wie man die kamera drehen"}, {"id": 332, "start": 3753.58, "end": 3764.3, "text": "stopp wie geht das get zoom ne pt z pt z pt z kontrol"}, {"id": 333, "start": 3764.3, "end": 3783.46, "text": "pt pt z kontrol cmd pt z kontrol gleich tauchen ok das sollte von der idee relativ easy sein was"}, {"id": 334, "start": 3783.46, "end": 3793.38, "text": "braucht man dafür parameter cmd pt channel was für einen channel also falls wahrscheinlich"}, {"id": 335, "start": 3793.38, "end": 3801.5, "text": "falls der mehrere motoren hat oder so keine ahnung channel 0 op auto haben die auch eine"}, {"id": 336, "start": 3801.5, "end": 3816.18, "text": "erklärung was diese parameter auch tatsächlich operation to control pt z was wollt ihr mir sagen"}, {"id": 337, "start": 3816.18, "end": 3828.7, "text": "m o m was ok es gibt die ausfall zwischen m oder o und das ist m obvious was damit gemeint ist"}, {"id": 338, "start": 3828.7, "end": 3839.26, "text": "natürlich ist das eine offizielle doko so offiziell wie es geht ja"}, {"id": 339, "start": 3846.38, "end": 3853.66, "text": "ja ja ok ja gut aber was gibt es denn sonst noch to post gibt es ah moment moment ach"}, {"id": 340, "start": 3853.66, "end": 3864.5, "text": "ne ne ne guck mal man kann sagen stop to position to post ist wahrscheinlich id 1 to post ist für"}, {"id": 341, "start": 3864.5, "end": 3870.8, "text": "die presets das ist für die presets leute wenn ich presets definiert habe kann ich hier zu der"}, {"id": 342, "start": 3870.8, "end": 3890.62, "text": "preset id fahren stop gibt es und auto gibt es naja to post reicht mir doch eigentlich to"}, {"id": 343, "start": 3890.62, "end": 3895.58, "text": "post ist doch vollkommen in ordnung ich kann doch hier einfach einfach positions vergeben guck"}, {"id": 344, "start": 3895.58, "end": 3914.66, "text": "call oder ja so position call position der channel die achse ja vielleicht"}, {"id": 345, "start": 3914.66, "end": 3929.06, "text": "ich brauche nur ich brauche nur positions dann mache ich mir einfach im hof im hof mache ich"}, {"id": 346, "start": 3929.06, "end": 3944.34, "text": "mir einfach presets und gut ist das ist ok das reicht also was brauchen wir das da monka es ok"}, {"id": 347, "start": 3944.34, "end": 3962.3, "text": "keine ahnung wir fahren jetzt zu go go to post oder sowas ins presets id"}, {"id": 348, "start": 3962.3, "end": 3975.94, "text": "so also was brauchen wir denn jetzt den kram das tauchen haben wir das tauchen haben wir so"}, {"id": 349, "start": 3975.94, "end": 4000.7, "text": "dann haben wir private ok also post muss er wieder warten post und kein volt sondern task so post"}, {"id": 350, "start": 4000.7, "end": 4005.98, "text": "also die url ist ja im prinzip immer die gleiche die können wir die können wir uns im prinzip"}, {"id": 351, "start": 4005.98, "end": 4032.34, "text": "hier auch noch mal noch mal geben lassen eigentlich bis dahin alter"}, {"id": 352, "start": 4036.98, "end": 4042.06, "text": "ja so können wir jetzt nämlich das zeug hinten dran schreiben also wir wollen eigentlich haben"}, {"id": 353, "start": 4042.06, "end": 4060.22, "text": "plus pt z control oder was braucht man da jetzt habe schon wieder cmd gleich cmd gleich bet war"}, {"id": 354, "start": 4060.22, "end": 4073.9, "text": "das groß geschrieben pt z pt z control uns string content jetzt müssen wir diesen mist"}, {"id": 355, "start": 4073.9, "end": 4093.7, "text": "irgendwie wieder schön man gibt es irgendeinen kann rider den kram string escape oder sowas"}, {"id": 356, "start": 4093.7, "end": 4104.42, "text": "ein gutes tool zum net string es kämpen smart paste in rider ok high IQ zeug zeigt mal hier"}, {"id": 357, "start": 4104.42, "end": 4112.74, "text": "die einfach in anführungszeichen ist ja du meinst dass es vielleicht ordentlich es kämpen kann"}, {"id": 358, "start": 4112.74, "end": 4127.98, "text": "wenn man es in anführungszeichen machen today i'd like a smart paste right escaping aha ok"}, {"id": 359, "start": 4127.98, "end": 4153.82, "text": "ach guck mal da das ist cool ok also ja moment das funktioniert natürlich nicht das muss jetzt"}, {"id": 360, "start": 4153.82, "end": 4170.06, "text": "alles in eine zeile so es kämpfe des press"}, {"id": 361, "start": 4170.06, "end": 4191.38, "text": "ne was zum minute war ich jetzt zu langsam"}, {"id": 362, "start": 4191.38, "end": 4205.78, "text": "ich war ja das ist cool nein nein add geht nicht kannst da vormachen dann brauchst du den da"}, {"id": 363, "start": 4205.78, "end": 4210.3, "text": "musst du aber das glaube ich doppelt machen oder so du musst immer es kämpfen du musst es geht ja"}, {"id": 364, "start": 4210.3, "end": 4215.46, "text": "auch logischerweise nicht anders woher soll der wissen dass das hier nicht ende vom string ist"}, {"id": 365, "start": 4215.46, "end": 4222.66, "text": "ja das ist nice das wusste ich nicht dass sie das eingebaut haben was zu string interpolation"}, {"id": 366, "start": 4222.66, "end": 4234.38, "text": "kann man da sonst noch mitmachen egal das ist das finde ich äußerst äußerst nice übrigens"}, {"id": 367, "start": 4234.38, "end": 4248.26, "text": "warum ist das cmd nicht im ach hier das das muss auch noch in die in die array klammern ok nein"}, {"id": 368, "start": 4248.26, "end": 4254.78, "text": "kannst du nicht sie scharp hat das hier ist einzelnes character und das hier ist ein string"}, {"id": 369, "start": 4254.78, "end": 4261.9, "text": "du kannst es nicht ändern dass also das wäre cool wenn es da noch irgendwas gebe mal in zukunft"}, {"id": 370, "start": 4261.9, "end": 4271.78, "text": "so data ich war mal richtig cool ist dann würde man jetzt irgendein parameter bilder oder sowas"}, {"id": 371, "start": 4271.78, "end": 4295.66, "text": "machen so data encoding utf 8 triple triple single quotes nein nein nein so was funktioniert nicht"}, {"id": 372, "start": 4295.66, "end": 4302.66, "text": "triple single quote sowas wissen wir sind nicht in pisen wir sind in sich ab da gibt es sowas"}, {"id": 373, "start": 4302.66, "end": 4324.46, "text": "net application jason gut so post pt z control und da muss ich jetzt übergeben to post id 1 speed"}, {"id": 374, "start": 4324.46, "end": 4335.38, "text": "32 ok dann schauen wir uns noch mal an was da zurück kommt a weight content read as string und"}, {"id": 375, "start": 4335.38, "end": 4343.06, "text": "jetzt gucken wir mal ob das sich auch bewegt schauen wir mal ich fahre den mal zu position 3 der"}, {"id": 376, "start": 4343.06, "end": 4347.74, "text": "sollte jetzt auf jeden fall woanders sein der leckt ganz schön hinterher wenn das eine weile offen"}, {"id": 377, "start": 4347.74, "end": 4367.38, "text": "ist warum kein on file ist nicht richtig funkt mit der kamera das wäre auch zu schön wenn"}, {"id": 378, "start": 4367.38, "end": 4380.18, "text": "das einfach geht so ok wird das jetzt also ich sollte es vielleicht noch aufrufen oder lull"}, {"id": 379, "start": 4380.18, "end": 4392.42, "text": "ap moment warum machen wir das eigentlich nicht hier können wir zugucken aber was macht ap go"}, {"id": 380, "start": 4392.42, "end": 4404.66, "text": "to post 1 meine noch ist es hardcoded aber das machen wir dann 1 a weight wir machen hier"}, {"id": 381, "start": 4404.66, "end": 4411.74, "text": "ein terminal auf ach so das tauchen fehlt noch tatsächlich ja stimmt stimmt ihr habt recht"}, {"id": 382, "start": 4411.74, "end": 4422.86, "text": "das tauchen fehlt und wo wie geht man das da überhaupt an ja tauchen gleich tauchen ok und"}, {"id": 383, "start": 4422.86, "end": 4438.42, "text": "tauchen gleich und tauchen gleich tauchen warum ist warum muss da tauchen eigentlich in die uhr"}, {"id": 384, "start": 4438.42, "end": 4444.26, "text": "und das command noch mal doppelt und dreifach was keine ahnung china chinesen api man muss"}, {"id": 385, "start": 4444.26, "end": 4453.82, "text": "es nicht verstehen dort net run angeblich hat es funktioniert und macht aber hey es fährt"}, {"id": 386, "start": 4453.82, "end": 4472.26, "text": "das funktioniert park so preset all die jahre aber jetzt hier und jetzt muss ich es neu es"}, {"id": 387, "start": 4472.26, "end": 4478.74, "text": "käpen keck weh alter das muss ich doch anders machen das fackt mich jetzt schon ab wenn ich"}, {"id": 388, "start": 4478.74, "end": 4487.5, "text": "dann wenn ich so was sehr preset all die jetzt muss ich oh nee nee nee nee das war das das"}, {"id": 389, "start": 4487.5, "end": 4494.34, "text": "halt schnell aus weil man ist denn hier noch mal einen dollar da vor bekommen das wird ja"}, {"id": 390, "start": 4494.34, "end": 4507.18, "text": "mache es doch einfach als dynamic war und chasen stringy feier ist das ist feifett ja das ist"}, {"id": 391, "start": 4507.18, "end": 4517.86, "text": "das ist wahrscheinlich besser wie macht man das jetzt am besten ich könnte ich könnte so was"}, {"id": 392, "start": 4517.86, "end": 4538.74, "text": "machen data gleich nu gucke ob das funktioniert cmd gleich tt z control ob das tut ach es ist ja"}, {"id": 393, "start": 4538.74, "end": 4562.1, "text": "ein array shit also dann ist es jetzt nur ok schauen wir mal ob da was sinnvolles bei rauskommt"}, {"id": 394, "start": 4562.1, "end": 4576.74, "text": "das ist kacke so das ist mega beschissen so zusammenzubauen alter ist doch mal guckt euch"}, {"id": 395, "start": 4576.74, "end": 4594.34, "text": "das mal an param so da drin haben wir dann channel channel ist null op ist gleich to pass id"}, {"id": 396, "start": 4594.34, "end": 4611.34, "text": "reset id speed 32 ok mal schauen ob da jetzt irgendwas sinnvolles bei rauskommt"}, {"id": 397, "start": 4611.34, "end": 4628.18, "text": "ja geil"}, {"id": 398, "start": 4628.18, "end": 4636.06, "text": "warum nicht warum geht das warum geht das nicht das habe ich falsch gemacht"}, {"id": 399, "start": 4636.06, "end": 4661.02, "text": "moment das kann er keine erase aber mal star anlegt"}, {"id": 400, "start": 4661.02, "end": 4673.98, "text": "als es kommt von hier unten"}, {"id": 401, "start": 4673.98, "end": 4692.74, "text": "guck mal der chat ist richtig high iq der chat wusste es wieder massive high iq chat"}, {"id": 402, "start": 4692.74, "end": 4706.94, "text": "wieder so guck mal das sieht doch gar nicht so falsch aus was da jetzt rauskommt oder"}, {"id": 403, "start": 4706.94, "end": 4712.86, "text": "das sieht doch das sieht doch eigentlich ganz ok aus cmd pt z control param channel op to"}, {"id": 404, "start": 4712.86, "end": 4723.46, "text": "pass 32 na gut dann fahren wir nochmal zu position position 3 und führen das ganze"}, {"id": 405, "start": 4723.46, "end": 4727.94, "text": "nochmal aus das ist ja genauso was wie test oder dokumentation schreiben wenn man fehlerfrei"}, {"id": 406, "start": 4727.94, "end": 4739.7, "text": "programmiert braucht man das alles nicht so und da brauchen wir jetzt allerdings anstatt"}, {"id": 407, "start": 4739.7, "end": 4751.46, "text": "dem data brauchen wir jetzt ich brächte es mal kurz um das jason convert serialize objekte"}, {"id": 408, "start": 4751.46, "end": 4762.42, "text": "data so mir fällt nichts besseres ein das einzurücken so schauen wir mal ob das so funktioniert"}, {"id": 409, "start": 4762.42, "end": 4781.62, "text": "was ich gemacht habe und das kann man jetzt wenigstens lesen halbwegs"}, {"id": 410, "start": 4781.62, "end": 4788.72, "text": "richtiges per programming hier alles klar ok also jetzt kann man schon mal presets anfahren"}, {"id": 411, "start": 4788.72, "end": 4795.14, "text": "das ist doch das ist doch schon mal gut warum nennen wir das nicht einfach goto preset"}, {"id": 412, "start": 4795.14, "end": 4801.62, "text": "anstatt goto pos nenn das einfach goto preset da weiß ich wenigstens in zwei zwei monaten"}, {"id": 413, "start": 4801.62, "end": 4808.66, "text": "noch was ich da gebaut habe hast du was über fleet gesehen ich bin so halb drauf ja das"}, {"id": 414, "start": 4808.66, "end": 4816.58, "text": "ist der jet brains editor bin mal gespannt drauf ich glaube nicht dass es frontend technisch"}, {"id": 415, "start": 4816.58, "end": 4820.34, "text": "visual studio code konkurrenz machen wird weil visual studio code ist halt schon ziemlich"}, {"id": 416, "start": 4820.34, "end": 4825.26, "text": "gut was javascript gedöns angeht und auch die 30.000 addons die es gibt aber visual"}, {"id": 417, "start": 4825.26, "end": 4833.1, "text": "studio code ist beispielsweise für java müll für c-sharp naja geht so und für viele solcher"}, {"id": 418, "start": 4833.1, "end": 4841.58, "text": "etwas nicht so zoomer sprachen ist das ist das nicht so gut auch go ist nur ok jetzt"}, {"id": 419, "start": 4841.58, "end": 4846.66, "text": "nicht richtig super da könnte ich mir vorstellen dass man mit fleet was ordentliches bauen"}, {"id": 420, "start": 4846.66, "end": 4860.3, "text": "kann rast habe ich schon ewig nicht gemacht ich glaube das letzte mal wo ich bisschen"}, {"id": 421, "start": 4860.3, "end": 4876.3, "text": "rast rum probiert habe war mit dem markt glaube ich mit dem intelligent plugin"}, {"id": 422, "start": 4876.3, "end": 4887.98, "text": "also go war auch nicht so gut in vias code weil ich habe das was ich in go gemacht habe"}, {"id": 423, "start": 4887.98, "end": 4894.5, "text": "war mit interop zu c und c interop mit go ist eh schon ein bisschen painstamp und da"}, {"id": 424, "start": 4894.5, "end": 4903.02, "text": "ist visual studio komplett abgekackt mit c imports in den go files da war vorbei hast"}, {"id": 425, "start": 4903.02, "end": 4907.42, "text": "nicht mehr gecheckt da ist regelmäßig das highlighting und autocomplete abgeschissen"}, {"id": 426, "start": 4907.42, "end": 4919.02, "text": "neowin mit language server natürlich arch was sonst was sonst was benutzt ihr für"}, {"id": 427, "start": 4919.02, "end": 4939.78, "text": "by the way nur mal um das jetzt euch mitzuteilen echt geht das mittlerweile dann ist ja gut"}, {"id": 428, "start": 4939.78, "end": 4949.14, "text": "also mal weiter also presets anfangen können wir das ist doch schon mal nice also presets"}, {"id": 429, "start": 4949.14, "end": 4957.02, "text": "angefahren kriegen wir was habe ich gesagt was wir noch machen müssen also presets anfangen"}, {"id": 430, "start": 4957.02, "end": 4966.02, "text": "ach ja licht licht an oder aus falls falsche immer auch das wollte ich gar nicht licht"}, {"id": 431, "start": 4966.02, "end": 4970.86, "text": "an und aus jetzt ok jetzt wirds jetzt wirds natürlich etwas wie schalt man bei der kamera"}, {"id": 432, "start": 4970.86, "end": 4994.98, "text": "licht an und aus also audio and light network ok"}, {"id": 433, "start": 4994.98, "end": 5023.94, "text": "dafür gibt es gar keine api aufruf set white led set white led ok schauen wir mal white"}, {"id": 434, "start": 5023.94, "end": 5036.98, "text": "led get white led set white led warum willst du das manuell machen zum beispiel weil ich"}, {"id": 435, "start": 5036.98, "end": 5041.94, "text": "will ja also normalerweise nachts will ich keine led anhaben normalerweise will ich nachts"}, {"id": 436, "start": 5041.94, "end": 5049.46, "text": "infrarot nachtsicht gedünst anhaben aber wenn zum beispiel das hoftor geöffnet wird hab"}, {"id": 437, "start": 5049.46, "end": 5054.82, "text": "ich mir überlegt mache ich so wenn das hoftor aufgeht dann fährt sich die kamera auf das"}, {"id": 438, "start": 5054.82, "end": 5062.94, "text": "preset von der tür macht das spotlight an für zwei minuten damit man was sieht im dunklen"}, {"id": 439, "start": 5062.94, "end": 5067.74, "text": "damit man ein schlüsselloch findet im dunklen und danach fährt sich die kamera automatisch"}, {"id": 440, "start": 5067.74, "end": 5075.94, "text": "wieder zurück macht das licht aus und macht infrarot wieder an deswegen muss ich dem irgendwie"}, {"id": 441, "start": 5075.94, "end": 5086.02, "text": "sagen manuell an oder aus was mich jetzt hier ein bisschen verwirrt ist dass man infrarot"}, {"id": 442, "start": 5086.02, "end": 5096.5, "text": "lights irgendwie nicht richtig an oder aus machen kann hast du erfahrung mit der cam"}, {"id": 443, "start": 5096.5, "end": 5101.7, "text": "bei nacht ich hatte die gestern mal draußen stehen das war ok ich hab die aber einfach"}, {"id": 444, "start": 5101.7, "end": 5106.14, "text": "nur rausgestellt und dann mit dem handy mal drauf geguckt also das war in ordnung also"}, {"id": 445, "start": 5106.14, "end": 5111.54, "text": "die terrasse sehe ich komplett warum nicht ein zusätzlicher led strahler ja weil das"}, {"id": 446, "start": 5111.54, "end": 5119.06, "text": "zusätzlich ist warum soll ich was zusätzliches hinstellen wenn ich schon mit dem bild machen"}, {"id": 447, "start": 5119.06, "end": 5130.7, "text": "kann das ist ok also ich habe alles gesehen mit der mit der infrarot leds auf der terrasse"}, {"id": 448, "start": 5130.7, "end": 5134.98, "text": "die terrasse ist jetzt auch nicht so wahnsinnig groß also in hof runter konnte ich jetzt nicht"}, {"id": 449, "start": 5134.98, "end": 5142.98, "text": "wirklich gut gucken ist die kamera lichtstark genug muss ich ausprobieren keine ahnung aber"}, {"id": 450, "start": 5142.98, "end": 5150.82, "text": "ich denke mal schon also ich hatte die gestern an und also ich bin ich bin da nicht mehr"}, {"id": 451, "start": 5150.82, "end": 5155.82, "text": "raus und habe es aber nicht probiert auf der terrasse ich habe es einfach nur mal eingeschaltet"}, {"id": 452, "start": 5155.82, "end": 5161.62, "text": "und hab dann mal aus dem fenster geguckt das sah relativ hell aus ob das reicht weiß"}, {"id": 453, "start": 5161.62, "end": 5170.5, "text": "nicht infrarot geht ja nicht mal auf der webseite manuell einzuschalten das macht nix das spotlight"}, {"id": 454, "start": 5170.5, "end": 5176.54, "text": "geht auch nicht auf der webseite ein und auszuschalten aber es hat eine api anscheinend mal schauen"}, {"id": 455, "start": 5176.54, "end": 5183.5, "text": "wie die funktioniert was was ich mich aber wundert ist dass man das infrarot light hier"}, {"id": 456, "start": 5183.5, "end": 5188.14, "text": "nicht richtig einen ausschalten kann vielleicht wenn man hier was rum schaltet haben die hier"}, {"id": 457, "start": 5188.14, "end": 5196.82, "text": "irgendwas für die für die beleuchtung advanced settings daylight led light off macht schon"}, {"id": 458, "start": 5196.82, "end": 5212.66, "text": "mal gar nichts auto anehmung das mal save drücken set set er light haha was ist day"}, {"id": 459, "start": 5212.66, "end": 5214.66, "text": "night color"}, {"id": 460, "start": 5214.66, "end": 5231.18, "text": "was ist was ist day night auto color color black was was das war für ein setting was"}, {"id": 461, "start": 5231.18, "end": 5245.62, "text": "soll das überhaupt sagen ach color ist wahrscheinlich licht an und black und white ist infrarot an"}, {"id": 462, "start": 5245.62, "end": 5262.86, "text": "oder wie ist das also wir wissen jetzt ja also wir brauchen hier set er light set set er"}, {"id": 463, "start": 5262.86, "end": 5276.38, "text": "light is it is used to set configuration of er lights"}, {"id": 464, "start": 5276.38, "end": 5296.58, "text": "optional state auto das für den sinn"}, {"id": 465, "start": 5296.58, "end": 5301.42, "text": "du willst das normale licht schalten nicht infrarot ja die sache ist die es kann ja durchaus"}, {"id": 466, "start": 5301.42, "end": 5309.14, "text": "sein dass du nicht beides anhaben kannst mandatory optional mandatory ja das kann sein was für"}, {"id": 467, "start": 5309.14, "end": 5324.38, "text": "states gibt es denn keine ahnung da steht nicht da"}, {"id": 468, "start": 5324.38, "end": 5336.38, "text": "ok da kann man nur states setzen anscheinend dann lassen wir die dann lassen wir die dann"}, {"id": 469, "start": 5336.38, "end": 5341.3, "text": "lassen wir die infrarot lights auf auto und das normale lassen wir aus ich hoffe dass"}, {"id": 470, "start": 5341.3, "end": 5351.9, "text": "ich das nicht in die quere kommt also was war das alles set white set white led also ok"}, {"id": 471, "start": 5351.9, "end": 5356.18, "text": "dann dann gucken wir jetzt mal wie man das licht an und ausschalten kann erstes ergebnis"}, {"id": 472, "start": 5356.18, "end": 5379.14, "text": "irgendeine s echt ach so kannst du kannst das ding irgendwie den juck dass das ding sonderlich"}, {"id": 473, "start": 5379.14, "end": 5389.9, "text": "sicher ist mache ich mir keine illusion das ist china china chinesen zeug also wie funktioniert"}, {"id": 474, "start": 5389.9, "end": 5400.9, "text": "das jetzt mit dem set set white ok set white led token übliche geschichte data state null"}, {"id": 475, "start": 5400.9, "end": 5416.18, "text": "channel null mode eins pride 79 ok das ist die helligkeit light schedule ai detect nein"}, {"id": 476, "start": 5416.18, "end": 5430.78, "text": "nein nein nein nix ai detect ich will einfach nur licht anmachen dog cat face people we"}, {"id": 477, "start": 5430.78, "end": 5440.02, "text": "mode ja was cool wäre wenn die hier irgendwie drinnen stehen hätten welche modes es denn"}, {"id": 478, "start": 5440.02, "end": 5452.34, "text": "so gibt und state ich meine das channel immer null steht habe ich mich jetzt ja schon dran"}, {"id": 479, "start": 5452.34, "end": 5463.14, "text": "gewöhnt aber state und mode alles optional ja das ist aber bestimmt nicht optional zum"}, {"id": 480, "start": 5463.14, "end": 5469.38, "text": "ein und ausschalten da gucken wir mal in das pisten api projekt hier rein ob die das schon"}, {"id": 481, "start": 5469.38, "end": 5486.98, "text": "rausbekommen haben set white led das suchen das suchen wir einfach mal jetzt set weird"}, {"id": 482, "start": 5486.98, "end": 5510.06, "text": "champ das haben die hier noch nicht mal drinnen was ist das denn guckt euch das mal an nicht"}, {"id": 483, "start": 5510.06, "end": 5521.22, "text": "so viel so dann googeln wir mal danach set white led reolink was ich glaube channel ist"}, {"id": 484, "start": 5521.22, "end": 5526.54, "text": "wenn du einen recorder mit mehreren kameras hast aber warum muss ich das dann bei der"}, {"id": 485, "start": 5526.54, "end": 5531.5, "text": "api angeben ich meine das geht direkt auf die eine kamera vielleicht dass es einheitlich"}, {"id": 486, "start": 5531.5, "end": 5541.14, "text": "ist ach guck mal da der westenburg der hat mir früher der hat mir früher call of duty"}, {"id": 487, "start": 5541.14, "end": 5562.1, "text": "gameplays geschickt ne das war der westersburg ach guck mal hier state on off mode night mode"}, {"id": 488, "start": 5562.1, "end": 5576.86, "text": "on auto on nee ich will null haben moten null moten null weil ich will ja nicht dass der"}, {"id": 489, "start": 5576.86, "end": 5583.1, "text": "automatisch irgendwas macht ich will auch nicht dass der mit der zeit irgendwas macht"}, {"id": 490, "start": 5583.1, "end": 5595.42, "text": "ich will es einfach nur an oder ausschalten ok da bin ich mal gespannt probieren wir das"}, {"id": 491, "start": 5595.42, "end": 5613.62, "text": "mal aus also public ersten cast wie nenne ich das jetzt einfach mal was ich light on switch"}, {"id": 492, "start": 5613.62, "end": 5629.7, "text": "also da brauchen wir im prinzip diesen ganzen schmatter hier noch mal so pt z control set white"}, {"id": 493, "start": 5629.7, "end": 5640.7, "text": "led muss das sein token passt alles rest passt auch so und was brauchen wir da jetzt für also"}, {"id": 494, "start": 5640.7, "end": 5661.5, "text": "cmd ist set white led parameter white led was oh nee das ist nested oder keck weight das"}, {"id": 495, "start": 5661.5, "end": 5680.38, "text": "ist das ist nested also ich muss sagen white white led nochmal oh mein so white led state"}, {"id": 496, "start": 5680.38, "end": 5691.06, "text": "so state eins ich will es ja einschalten channel aus irgendwelchen gründen null weil mode"}, {"id": 497, "start": 5691.06, "end": 5700.66, "text": "mode ich bleib mal bei null mal gucken mal gucken ob ich das kann ich mein mode ich mal"}, {"id": 498, "start": 5700.66, "end": 5706.62, "text": "schauen vielleicht muss ich auch vielleicht muss ich auch sagen drei oder so night mode"}, {"id": 499, "start": 5706.62, "end": 5722.58, "text": "und time on oder sowas und dann das wieder ausschalten danach warte mal gucken 100 ok"}, {"id": 500, "start": 5722.58, "end": 5738.34, "text": "wir machen das test beispiel von den 79 den rest lasse ich leer sollte doch jetzt eigentlich"}, {"id": 501, "start": 5738.34, "end": 5745.26, "text": "funktionieren wir machen wir machen bei der gelegenheit wir schalten jetzt einfach mal"}, {"id": 502, "start": 5745.26, "end": 5755.18, "text": "ein und gucken ob das funktioniert hier ist die kamera ich mache mal komm wir sehen wenn"}, {"id": 503, "start": 5755.18, "end": 5759.66, "text": "ich wenn wir sehen wenn dies das licht angeht ok also habe ich das richtig mal set white"}, {"id": 504, "start": 5759.66, "end": 5765.26, "text": "led parameter white led state eins channel null mode null ob das funktioniert muss wir gleich"}, {"id": 505, "start": 5765.26, "end": 5774.54, "text": "mal gucken bright 79 set white led token ist hinten dran dann führen wir das mal aus also"}, {"id": 506, "start": 5774.54, "end": 5782.42, "text": "kein preset sondern switch light on und irgendwas hinten dran wobei ich kann das auch hier ausführen"}, {"id": 507, "start": 5782.42, "end": 5787.42, "text": "run"}, {"id": 508, "start": 5787.42, "end": 5812.14, "text": "habt ihr es gesehen die led ist angegangen wartet mal ich mache mal in meinen im surferraum die das licht aus"}, {"id": 509, "start": 5812.14, "end": 5824.02, "text": "guck mal leute das funktioniert led ist an ich muss man das ffm pack neu machen das hat"}, {"id": 510, "start": 5824.02, "end": 5827.42, "text": "mir schon ein bisschen das hat mir schon ein bisschen viel die lei gerade"}, {"id": 511, "start": 5827.42, "end": 5839.26, "text": "funktioniert gg eats so und jetzt brauchen wir natürlich switch light off jetzt auch noch"}, {"id": 512, "start": 5839.26, "end": 5860.7, "text": "switch light off ok set white led state null machen wir auch mal brightness null wo ist das"}, {"id": 513, "start": 5860.7, "end": 5865.14, "text": "jetzt eigentlich reverse engineering naja wir gucken im webinterface was er schickt"}, {"id": 514, "start": 5865.14, "end": 5871.62, "text": "aber du hast schon recht so wirklich krasse reverse engineered ist es nicht"}, {"id": 515, "start": 5871.62, "end": 5876.54, "text": "das konnte ich aber vorher nicht wissen so"}, {"id": 516, "start": 5876.54, "end": 5896.58, "text": "demot ist oft und state ist oft das eigentlich so passen switch light off alles auf null"}, {"id": 517, "start": 5896.58, "end": 5912.34, "text": "und licht aus zack jetzt jetzt hat er erkannt dass nacht ist und macht die infrarot leds an"}, {"id": 518, "start": 5912.34, "end": 5924.38, "text": "das ist cool das finde ich nice so switch light on ne ich will kein toggle ich will"}, {"id": 519, "start": 5924.38, "end": 5931.06, "text": "wirklich explizit sagen an oder aus das ist wirklich sehr nice"}, {"id": 520, "start": 5931.06, "end": 5947.3, "text": "so also das heißt was ich jetzt machen kann ist folgendes kommen das ist können wir das"}, {"id": 521, "start": 5947.3, "end": 5955.06, "text": "verbinden also ich sage jetzt wait api go to preset 2 zum beispiel also sagen wir mal das"}, {"id": 522, "start": 5955.06, "end": 5961.26, "text": "ist die tür was ich heute mache ich versuche meine china chinesen kameras über die api zu"}, {"id": 523, "start": 5961.26, "end": 5970.7, "text": "steuern so go to preset 2 ich muss erstmal switch switch light off machen sonst erkennt man das"}, {"id": 524, "start": 5970.7, "end": 5980.38, "text": "jetzt nicht richtig so geht gleich infrarot zeug an aber egal also go to preset 2 preset"}, {"id": 525, "start": 5980.38, "end": 5986.3, "text": "2 ist dann sagen wir mal die tür wobei ich jetzt eigentlich wenn ich mir selbst das leben"}, {"id": 526, "start": 5986.3, "end": 5991.38, "text": "einfacher machen will mache ich so was hier noch ihn um keine ahnung preset und macht"}, {"id": 527, "start": 5991.38, "end": 6001.58, "text": "dann so was hier door 2 ist einfach nur dass ich mir besser merken kann left 1 right wobei"}, {"id": 528, "start": 6001.58, "end": 6010.98, "text": "soll ich aufsteigen machen wenn ich keine ahnung center gleich null falls nie wo gehen"}, {"id": 529, "start": 6010.98, "end": 6023.9, "text": "die presets los bei 1 oder bei 0 bei 1 ok 1 2 3 und keine ahnung oder oder right 4"}, {"id": 530, "start": 6023.9, "end": 6034.62, "text": "da kann ich mir einfacher merken was es ist da könnte ich jetzt nämlich jetzt ein go to"}, {"id": 531, "start": 6034.62, "end": 6052.06, "text": "preset door so da muss ich dem jetzt noch sagen kann ich dem jetzt noch sagen dass der ein"}, {"id": 532, "start": 6052.06, "end": 6070.9, "text": "so macht er macht der jason serializer standardmäßig int aus dem preset weiß"}, {"id": 533, "start": 6070.9, "end": 6083.54, "text": "es nicht so auf jeden fall wenn es jetzt richtig funktioniert dann schwenkt er jetzt nach links"}, {"id": 534, "start": 6083.54, "end": 6091.9, "text": "und dann also nicht dann schwenkt er dann dann schwenkt er jetzt zur tür dann schwenkt er jetzt"}, {"id": 535, "start": 6091.9, "end": 6098.58, "text": "zur tür und danach macht er das licht an wenn alles funktioniert also das richtig echte licht"}, {"id": 536, "start": 6098.58, "end": 6112.46, "text": "ja nice ok das war jetzt glück dass preset 4 door tatsächlich die tür ist das war einfach"}, {"id": 537, "start": 6112.46, "end": 6122.42, "text": "nur glück dass preset 4 aktuell wirklich auf store zeigt das ist einfach nur random china"}, {"id": 538, "start": 6122.42, "end": 6131.38, "text": "hexa content ja so das ist cool das gefällt mir und jetzt könnte ich dann noch so was"}, {"id": 539, "start": 6131.38, "end": 6136.86, "text": "sagen wie keine weight task die lei oder sagen wir nach zwei oder sagen wir noch nach fünf"}, {"id": 540, "start": 6136.86, "end": 6145.9, "text": "sekunden nach fünf sekunden sagen wir switch light auf nach brightness 100 wisst ihr was wir"}, {"id": 541, "start": 6145.9, "end": 6164.26, "text": "probieren mal was aus brightness 50 default also int wir mal gucken ob man das überhaupt umstellen"}, {"id": 542, "start": 6164.26, "end": 6171.18, "text": "kann hast du schon mal shop line shopify habe ich tatsächlich nie verwendet wir machen das mal so"}, {"id": 543, "start": 6171.18, "end": 6181.78, "text": "ich lasse es ich lasse es erst mal so laufen um zu checken ob das ob das funktioniert weil"}, {"id": 544, "start": 6181.78, "end": 6188.1, "text": "es wird funktionieren ich mache mal ich will mal die helligkeit testen also switch light on"}, {"id": 545, "start": 6188.1, "end": 6200.78, "text": "machen wir 10 wir machen das anders wir machen wir machen eine schleife machen eine schleife von keine"}, {"id": 546, "start": 6200.78, "end": 6214.58, "text": "ahnung 1 bis 100 ist überhaupt 100 maximum gleich 100 zwar von 1"}, {"id": 547, "start": 6214.58, "end": 6233.14, "text": "dann da ob 100 maximum ist set white brightness ja man weiß es nicht"}, {"id": 548, "start": 6233.14, "end": 6251.94, "text": "man weiß nicht ob brightness 100 100 das ist oder vielleicht sind es auch 250 gerade kommen was"}, {"id": 549, "start": 6251.94, "end": 6259.82, "text": "machst du ich habe mir eine china chinesen kamera gekauft die eine nicht ganz so offizielle api"}, {"id": 550, "start": 6259.82, "end": 6266.06, "text": "hat das stand in der python api naja so also plus gleich kommen wir machen das mal in 10er"}, {"id": 551, "start": 6266.06, "end": 6283.86, "text": "schritten also switch light on delay 5 so switch light und wir fangen an mit mit eins so cw was"}, {"id": 552, "start": 6283.86, "end": 6290.42, "text": "das jetzt warum hat sich das jetzt ausgeschaltet habe da noch gar nichts gemacht oder habe ich"}, {"id": 553, "start": 6290.42, "end": 6304.1, "text": "doch was gemacht ach was auch immer ja so was heißt eigentlich und premise das heißt wenn"}, {"id": 554, "start": 6304.1, "end": 6310.62, "text": "du zeug vor ort stehen hast also das ist ja erst seit ein paar jahren aufgekommen seitdem es"}, {"id": 555, "start": 6310.62, "end": 6315.38, "text": "an angefangen hat üblich zu werden dass man manche sachen eben nicht mehr vor ort im eigenen"}, {"id": 556, "start": 6315.38, "end": 6320.54, "text": "rechenzentrum stehen hat sondern irgendwo in der cloud und als die coolen leute die sagen ja auch"}, {"id": 557, "start": 6320.54, "end": 6325.46, "text": "nicht und premise die sagen und präm weil das mehr klaut native und cool und cooler klingt ja"}, {"id": 558, "start": 6325.46, "end": 6334.02, "text": "also das ist zum unterscheiden ob du sachen lokal stehen hast oder in der cloud und premise ist"}, {"id": 559, "start": 6334.02, "end": 6340.62, "text": "lokal beziehungsweise vor ort ich glaube und premise heißt übrigens auch eins zu eins übersetzt vor"}, {"id": 560, "start": 6340.62, "end": 6352.7, "text": "ort ja vor ort aber und präm sagen die kult die die richtigen klaut natives sagen das so ja also"}, {"id": 561, "start": 6352.7, "end": 6360.9, "text": "wir fangen jetzt ein wir fangen jetzt an mit in 10er schritten die helligkeit hoch hoch zählen"}, {"id": 562, "start": 6360.9, "end": 6375.94, "text": "schauen wir mal oh was da ach ich nur nicht das die leih 5000 das die leih 5000 das in"}, {"id": 563, "start": 6375.94, "end": 6389.7, "text": "der millisekunden ändert das irgendwie nennenswert die helligkeit schätten die sind nicht dimmer die"}, {"id": 564, "start": 6389.7, "end": 6395.54, "text": "leds ich glaube es gibt nur an oder aus guck mal es gibt nur an oder aus helligkeit ist keinerlei"}, {"id": 565, "start": 6395.54, "end": 6406.06, "text": "unterschied wie ist die api aufgebaut dass es hat über hat ttp aber so wirklich klar ist die nicht"}, {"id": 566, "start": 6406.06, "end": 6415.62, "text": "ne das ding kann keine helligkeit guck die helligkeit ändert sich nicht immer gleich"}, {"id": 567, "start": 6415.62, "end": 6420.34, "text": "hell also im prinzip können wir uns den helligkeitsparameter auch komplett sparen"}, {"id": 568, "start": 6420.34, "end": 6430.06, "text": "es gibt nur an oder aus betail geutz ja das kenne ich und präm ablösen klingt halt so"}, {"id": 569, "start": 6430.06, "end": 6437.26, "text": "als hat man voll plan ja ok die helligkeit ist kein unterschied was passiert bei pride null"}, {"id": 570, "start": 6437.26, "end": 6448.22, "text": "das ist tatsächlich gute frage probieren maus brightness null nix nix passiert da"}, {"id": 571, "start": 6450.22, "end": 6456.18, "text": "du kannst immer können aus dem brightness parameter komplett sparen der ist der ist"}, {"id": 572, "start": 6456.18, "end": 6462.22, "text": "komplett useless der brightness parameter zumindest bei der kamera mach mal minus"}, {"id": 573, "start": 6462.22, "end": 6479.62, "text": "eins ok moment das das probieren aber so aus das juckt dir nicht das ist ihm egal immer"}, {"id": 574, "start": 6479.62, "end": 6487.94, "text": "gebe ich das hier überhaupt jaja brightness da mit schleidung minus eins ist ihm auch egal was"}, {"id": 575, "start": 6487.94, "end": 6514.86, "text": "ist denn bei 255 ist auch ok 5000 50.000 auch ok in 32 max value ist auch ok interessiert uns"}, {"id": 576, "start": 6514.86, "end": 6524.38, "text": "überhaupt nicht ok der brightness value ist ziemlich für den arsch den brauchen wir nicht"}, {"id": 577, "start": 6524.38, "end": 6529.54, "text": "da können wir bei der ich schreibe ich schreibe jetzt einfach brightness 100 rein und fertig"}, {"id": 578, "start": 6529.54, "end": 6539.58, "text": "brightness parameter ist komplett komplett useless brauche ich ok nice gut so also wir"}, {"id": 579, "start": 6539.58, "end": 6545.3, "text": "können presets anfahren wir können das licht an und ausschalten presets anfangen kann man zum"}, {"id": 580, "start": 6545.3, "end": 6554.46, "text": "beispiel sagen hier wird das zu heiß leute kann das sein kann das sein dass es zu heiß wird wenn"}, {"id": 581, "start": 6554.46, "end": 6565.18, "text": "es zu lang an ist weil er sich immer wieder abschaltet es gab da gab es doch einen schedule"}, {"id": 582, "start": 6565.18, "end": 6578.5, "text": "beim licht du hast recht aber was konnte man da einstellen ne da kann man nur staatsuhrzeit"}, {"id": 583, "start": 6578.5, "end": 6583.14, "text": "enduhrzeit einstellen und außerdem habe ich ja dieses automatische steuern ausgeschaltet"}, {"id": 584, "start": 6583.14, "end": 6592.5, "text": "ich glaube da wird einfach zu warm ja das ist das ist das ist das ist jason über htp genau"}, {"id": 585, "start": 6592.5, "end": 6597.78, "text": "so sieht das dann aus wir haben glücklicherweise dieses api dock gefunden ich dachte am anfang"}, {"id": 586, "start": 6597.78, "end": 6604.54, "text": "schon ich muss mir diesen müll alles aus den browser tools mit dem offiziellen web interface"}, {"id": 587, "start": 6604.54, "end": 6609.02, "text": "holen aber zum glück haben wir so haben wir so ein komisches dock hier gefunden ist nicht dass"}, {"id": 588, "start": 6609.02, "end": 6618.1, "text": "es gleich brennt was hat das ding gekostet 110 euro 115 euro oder so der pluspunkt war für mich"}, {"id": 589, "start": 6618.1, "end": 6624.5, "text": "das hat eine led das hat infrarot leds und es braucht keine app und keine cloud und hat"}, {"id": 590, "start": 6624.5, "end": 6631.06, "text": "rtsp stream und ist halt angeblich outdoor geeignet wie sehr outdoor geeignet muss ich"}, {"id": 591, "start": 6631.06, "end": 6637.54, "text": "jetzt noch zeigen wenn ich dann das war eine weile draußen hängen habe so ein kölner"}, {"id": 592, "start": 6637.54, "end": 6649.3, "text": "await api go to preset left also vielleicht hat man auch noch"}, {"id": 593, "start": 6649.3, "end": 6656.58, "text": "es funktioniert"}, {"id": 594, "start": 6659.7, "end": 6661.5, "text": "ich bin begeistert"}, {"id": 595, "start": 6661.5, "end": 6674.38, "text": "wahrscheinlich nur autor damit die gekühlt wird die braucht ja wenn die autor ist also"}, {"id": 596, "start": 6674.38, "end": 6678.9, "text": "wahrscheinlich geht autor das licht tatsächlich länger aber wahrscheinlich also wenn du sie"}, {"id": 597, "start": 6678.9, "end": 6684.26, "text": "autor haben willst dann braucht ihr auf jeden fall ein paar dichtungen und so drinne welche"}, {"id": 598, "start": 6684.26, "end": 6697.22, "text": "kamera das ist das ist eine reolink e1 outdoor china ding ist das hier das hat einen motor und"}, {"id": 599, "start": 6697.22, "end": 6710.26, "text": "einen zoom einen zoom hat es auch nicht die hier moment das ist falsch die hier die kann auch"}, {"id": 600, "start": 6710.26, "end": 6715.7, "text": "zoomen wollen wir die mal zoomen lassen chat das mit komm wir lassen die mal zoomen"}, {"id": 601, "start": 6715.7, "end": 6726.34, "text": "wir lassen die jetzt mal zoomen einfach einmal rumdrehen noch schnell"}, {"id": 602, "start": 6726.34, "end": 6737.34, "text": "nee ausverkauft ist das falsche modell das soll ich nicht zubehren von amazon"}, {"id": 603, "start": 6737.34, "end": 6750.66, "text": "so wir zoomen mal kurz achtung blub zum"}, {"id": 604, "start": 6750.66, "end": 6769.5, "text": "aber er sobt ja wirklich aber der focus ist nicht so geil oder also focus habe ich schon"}, {"id": 605, "start": 6769.5, "end": 6778.34, "text": "bessere gesehen das web review ist so beschissen das muss weg kann man vielleicht hier den focus"}, {"id": 606, "start": 6778.34, "end": 6795.18, "text": "kann er nicht einfach autofocus machen die autofocus gibt es nicht doch jetzt jetzt"}, {"id": 607, "start": 6795.18, "end": 6807.22, "text": "wir müssen das spiegeln das sollte eigentlich tool check plus stehen ich glaube das kann man"}, {"id": 608, "start": 6807.22, "end": 6822.54, "text": "nicht richtig sehen image mehr ja so ist das doch gut kommen wir uns an das tool check plus"}, {"id": 609, "start": 6822.54, "end": 6830.22, "text": "angezoomt wie lauter die playlist das ist irgendeine mario mario playlist relaxing and calming music"}, {"id": 610, "start": 6830.22, "end": 6845.46, "text": "from super mario series"}, {"id": 611, "start": 6845.46, "end": 6853.5, "text": "ja so jetzt hat es genug gesummt übrigens bei der gelegenheit weiß was kamera eins kann"}, {"id": 612, "start": 6853.5, "end": 6859.02, "text": "weg das ist doch ganz eklig warum sollte er ohne kamera einstehen logo kann man das logo"}, {"id": 613, "start": 6859.02, "end": 6870.1, "text": "weg machen datetime datetime ist glaube ich ganz praktisch wie kriegt man dieses hässliche"}, {"id": 614, "start": 6870.1, "end": 6877.66, "text": "reolink logo weg was machst du da überhaupt ich steuere meine kamera über eine nicht"}, {"id": 615, "start": 6877.66, "end": 6902.5, "text": "ganz so offizielle api wir machen erstmal den zoom weg"}, {"id": 616, "start": 6902.5, "end": 6917.94, "text": "muss premium premium subscription kaufen also position das ist ja nur die in den settings"}, {"id": 617, "start": 6917.94, "end": 6925.82, "text": "war das mit den logos also kamera ist ja zeit oben in der kamera ist sehr gut den name brauche"}, {"id": 618, "start": 6925.82, "end": 6943.26, "text": "ich netter ist useless das logo soll weg watermark das da wahrscheinlich naja so ist das doch"}, {"id": 619, "start": 6943.26, "end": 6953.14, "text": "schon mal viel besser kann man da sonst noch etwas einstellen fps stream image das ist"}, {"id": 620, "start": 6953.14, "end": 6958.5, "text": "jetzt nicht so geil da muss ich mal kurz das licht einschalten dass die infrarotlampe"}, {"id": 621, "start": 6958.5, "end": 6968.42, "text": "wieder ausmacht so ein licht ist eingeschaltet sollte jetzt eigentlich gleich checken ja"}, {"id": 622, "start": 6968.42, "end": 6975.06, "text": "hat er gecheckt 15 fps reicht doch für so eine überwachung kamera nachts auf der terrasse"}, {"id": 623, "start": 6975.06, "end": 6984.02, "text": "so nice also ich muss sagen die auflösung ist doch wirklich nicht schlecht wie so eine"}, {"id": 624, "start": 6984.02, "end": 6989.74, "text": "billig china camp das hier liegt nicht an der auflösung das hier liegt daran dass die"}, {"id": 625, "start": 6989.74, "end": 6998.54, "text": "schärfe nicht stört dass die die der fokus nicht richtig ist das doch absolut in ordnung"}, {"id": 626, "start": 6998.54, "end": 7011.9, "text": "was passiert denn wenn ich jetzt hier einfach mal brightness hoch stelle ich weiß ja was"}, {"id": 627, "start": 7011.9, "end": 7022.38, "text": "ich mache da gar nichts dran an den settings ich lasse das einfach so wie das so was kann"}, {"id": 628, "start": 7022.38, "end": 7029.34, "text": "man sonst noch schönes zum einstellen also pan tilt controls hatten wir licht an und"}, {"id": 629, "start": 7029.34, "end": 7033.3, "text": "aus hatten wir auch led an und aus muss ich nicht machen funktioniert automatisch ganz"}, {"id": 630, "start": 7033.3, "end": 7040.58, "text": "ok resets anfahren funktioniert auch was hat was haben die denn sonst noch schönes in der"}, {"id": 631, "start": 7040.58, "end": 7051.06, "text": "ap was kann man da sonst noch so email und sonst was brauche ich nicht ach so die zeitzone"}, {"id": 632, "start": 7051.06, "end": 7056.06, "text": "sollten wir vielleicht mal richtig einschalten wir haben 6 7 das ist ja prinzipiell richtig"}, {"id": 633, "start": 7056.06, "end": 7085.5, "text": "aber network settings advanced ntp settings display wo könnte ich die zeitzone einstellen"}, {"id": 634, "start": 7085.5, "end": 7103.74, "text": "ah date und time device time may be incorrect ja kokona time wie ändert sich die zeitzone"}, {"id": 635, "start": 7103.74, "end": 7127.02, "text": "ok jetzt ist das stream abgekackt weird jam muss es neu starten dafür wenn du das umschaltest"}, {"id": 636, "start": 7127.02, "end": 7140.9, "text": "16 uhr nice kurz mit der urzeit hier vergleichen naja das ist das ist ziemlich gut muss man"}, {"id": 637, "start": 7140.9, "end": 7147.06, "text": "sagen also da gibt es nichts also das delay ist auch nicht so hoch das ist die leis auch"}, {"id": 638, "start": 7147.06, "end": 7156.78, "text": "in ordnung guckt mal links rum rechts rum hoch runter das ist ok ja damit kann ich leben"}, {"id": 639, "start": 7156.78, "end": 7168.62, "text": "das ist nice was anscheinend ist die kamera ip 64 aber nicht das zugehörige netzteil"}, {"id": 640, "start": 7168.62, "end": 7178.66, "text": "das wird mich bei china china qualität nichts wundern das kann ich mir durchaus vorstellen"}, {"id": 641, "start": 7178.66, "end": 7184.9, "text": "dass sie die kamera wasserdicht gemacht haben aber das china netzteil nicht ja das kann"}, {"id": 642, "start": 7184.9, "end": 7192.94, "text": "ich mir schon vorstellen ok habt ihr eine klorarch idee was man noch machen könnte"}, {"id": 643, "start": 7192.94, "end": 7204.42, "text": "ich mein presets anfahren ich weiß was wir noch machen müssen ganz wichtig logout logout"}, {"id": 644, "start": 7204.42, "end": 7211.78, "text": "muss ich machen weil ansonsten läuft wahrscheinlich der ram oder die sessions voll oder sowas"}, {"id": 645, "start": 7211.78, "end": 7225.86, "text": "kann das teil poe nee ich glaube dasselbe dass das die ausgabe kann kein poe aber es"}, {"id": 646, "start": 7225.86, "end": 7234.66, "text": "gibt welche mit poe aber die einfachste variante wenn du poe machen willst ist einfach du"}, {"id": 647, "start": 7234.66, "end": 7242.42, "text": "nimmst den extractor genau dann machst du aus deinem poe einfach 12 volt oder 24 volt"}, {"id": 648, "start": 7242.42, "end": 7254.3, "text": "oder was die braucht du kannst bei den reolink dingern ssh aktivieren wirklich ssh egal"}, {"id": 649, "start": 7254.3, "end": 7267.42, "text": "wir machen jetzt erstmal logout wo aktiviere ich ssh wieviel kann poe liefern gar nicht"}, {"id": 650, "start": 7267.42, "end": 7276.98, "text": "so wenig ich glaube das jannard poe sind 48 volt und und 2 ampere oder so nee oder weiß"}, {"id": 651, "start": 7276.98, "end": 7294.02, "text": "es gar nicht also ist auf jeden fall es reicht für so eine kamera und licht dicke aus warum"}, {"id": 652, "start": 7294.02, "end": 7298.22, "text": "gibt es modelle von reolink die 4k können poe haben und weniger kosten aus dein modell"}, {"id": 653, "start": 7298.22, "end": 7302.5, "text": "na wahrscheinlich weil die irgendwelche anderen nachteile haben die sind entweder nicht outdoor"}, {"id": 654, "start": 7302.5, "end": 7322.02, "text": "geeignet oder sie sind reinklaut ansonsten muss man halt einfach mal vergleichen nee die"}, {"id": 655, "start": 7322.02, "end": 7331.22, "text": "kann also die kann kein poe wie es aussieht können wir hier kurz gucken ohne poe aber"}, {"id": 656, "start": 7331.22, "end": 7340.26, "text": "du kannst halt einfach irgendeinen x beliebigen poe poe extractor 12 volt nehmen sowas da"}, {"id": 657, "start": 7340.26, "end": 7346.34, "text": "und da schließt du dann die kamera dran an nee das ist müll das ist müll was ich gesagt"}, {"id": 658, "start": 7346.34, "end": 7353.46, "text": "hab die sind müll die taugen nix da muss schon das richtige rauskommen unterstützen"}, {"id": 659, "start": 7353.46, "end": 7363.74, "text": "nee nee nee nee das muss schon mit spannungswandler sein normales poe ist nämlich 48 volt ja sowas"}, {"id": 660, "start": 7363.74, "end": 7382.14, "text": "da wahrscheinlich eher kein injector das gegenteil von einem injector achte den artikel"}, {"id": 661, "start": 7382.14, "end": 7395.06, "text": "kenne ich ja das ist aber ein bisschen umständlicher sowas hier ja das reicht dicke für die kamera"}, {"id": 662, "start": 7395.06, "end": 7404.42, "text": "kein problem logout müssen wir noch machen leute logout brauchen wir noch logout wie"}, {"id": 663, "start": 7404.42, "end": 7414.74, "text": "macht man logout so einfach logout toppen und cmd logout mit leeren params alles klar"}, {"id": 664, "start": 7414.74, "end": 7443.66, "text": "so logout wir machen das gar nicht wir machen i disposable implement interface und da machen"}, {"id": 665, "start": 7443.66, "end": 7458.42, "text": "wir jetzt den logout drinne client wir kopieren uns den kram von hier oben client data logout"}, {"id": 666, "start": 7458.42, "end": 7466.9, "text": "logout dann braucht man für logout einfach nur cmd params leer na gut wenn die meinen"}, {"id": 667, "start": 7466.9, "end": 7485.82, "text": "das könnte man theoretisch mal in eine zeile machen ja kurz genug rückte das überhaupt"}, {"id": 668, "start": 7485.82, "end": 7498.5, "text": "gescheit ein ja so logout token aus bla bla bla ja so und jetzt kann ich sowas hier sagen"}, {"id": 669, "start": 7498.5, "end": 7505.22, "text": "guckt mal jetzt jetzt richtig advanced advanced feature nutzung kann ich sagen using war so"}, {"id": 670, "start": 7505.22, "end": 7509.86, "text": "und wenn er das wenn das jetzt richtig funktioniert dann soll er dann dann lockt er sich sogar"}, {"id": 671, "start": 7509.86, "end": 7527.58, "text": "noch aus am ende der wenn das programs oder auch nicht er sollte sich doch jetzt eigentlich"}, {"id": 672, "start": 7527.58, "end": 7534.78, "text": "aus am ende des scopes sollte eigentlich dispose aufrufen und gut ist aber vielleicht"}, {"id": 673, "start": 7534.78, "end": 7540.94, "text": "macht er das auch und es reicht für das reicht für das output für den output nicht mehr"}, {"id": 674, "start": 7540.94, "end": 7552.78, "text": "wir mal aus api dispose das war mal kurz eine sekunde warten dann sollte er eigentlich"}, {"id": 675, "start": 7552.78, "end": 7566.86, "text": "sich auslocken ja logout macht er auch wahrscheinlich reicht es einfach für das für die ausgabe"}, {"id": 676, "start": 7566.86, "end": 7575.26, "text": "nicht mehr aus ja ok nice passt jetzt räumt das jetzt lockt er sich sogar am ende noch"}, {"id": 677, "start": 7575.26, "end": 7581.18, "text": "richtig aus da kann man sich doch nicht mal beschweren passt doch laut hersteller das"}, {"id": 678, "start": 7581.18, "end": 7587.34, "text": "ding auch laut sprechen am mikrofon ist das so ja das ist so das habe ich aber ausgeschaltet"}, {"id": 679, "start": 7587.34, "end": 7599.02, "text": "das habe ich ausgeschaltet brauche ich nicht wüsste jetzt auch nicht wozu aber für sag"}, {"id": 680, "start": 7599.02, "end": 7603.22, "text": "mal wenn du den lautsprecher und mikrofon verwenden willst dann musst du auf jeden"}, {"id": 681, "start": 7603.22, "end": 7610.7, "text": "fall die offizielle app verwenden weil die wahrscheinlich irgendwelche nicht standardmäßigen"}, {"id": 682, "start": 7610.7, "end": 7616.38, "text": "video geschichten machen erinnert ihr euch noch an die kamera an die türkegensprechanlage"}, {"id": 683, "start": 7616.38, "end": 7623.46, "text": "die ich mir gekauft habe die wird so wo wir hier mal ausprobiert haben mit der mit dieser"}, {"id": 684, "start": 7623.46, "end": 7649.78, "text": "komischen die die nicht standardkonform ist hatte tp gemacht haben"}, {"id": 685, "start": 7649.78, "end": 7671.42, "text": "ne das ist was anderes dass das vielleicht gewesen ja wie könnte dieser stream dann"}, {"id": 686, "start": 7671.42, "end": 7690.86, "text": "heißen mit der kamera für die klingel irgendwas mit klingel ich weiß es nicht mehr zumindest"}, {"id": 687, "start": 7690.86, "end": 7703.26, "text": "haben wir da was vielleicht das ist das ist das stream gleich da lulve da haben die allen"}, {"id": 688, "start": 7703.26, "end": 7716.02, "text": "ernstes alter 5 stunden 58 da war ich aber ausdauernd noch gatschi bass so und da haben"}, {"id": 689, "start": 7716.02, "end": 7725.42, "text": "wir geschaut genau das ist die kamera so und dann ist uns aufgefallen dass die nicht standardkonform"}, {"id": 690, "start": 7725.42, "end": 7731.78, "text": "ist hatte tp machen die schicken daten also die machen die machen hatte tp und wenn ich"}, {"id": 691, "start": 7731.78, "end": 7741.1, "text": "jetzt richtig erinnerung habe nachdem nachdem die verbindung eigentlich geklost ist schicken"}, {"id": 692, "start": 7741.1, "end": 7746.66, "text": "sie noch weiter daten und nur dann hat die dann hat die sprechverbindung funktioniert"}, {"id": 693, "start": 7746.66, "end": 7754.3, "text": "das war so ein richtiges china chinesen crap ding was ich da gekauft habe irgendwo habe"}, {"id": 694, "start": 7754.3, "end": 7772.98, "text": "ich war ja hier guckt euch an war ja schag war der war ja schag jetzt im war ja schag"}, {"id": 695, "start": 7772.98, "end": 7793.74, "text": "hat man das gut gesehen was für das von mir"}, {"id": 696, "start": 7793.74, "end": 7820.26, "text": "ja das ich ich finde das war ganz abartig man das war glaube ich das ekligste china chinesen"}, {"id": 697, "start": 7820.26, "end": 7832.38, "text": "was ich je gekauft habe hilft genau für den sub ja leute wir sind eigentlich durch ich"}, {"id": 698, "start": 7832.38, "end": 7839.3, "text": "meine das funktioniert soll ich sagen es es klappt einfach zur abwechslung das muss"}, {"id": 699, "start": 7839.3, "end": 7847.02, "text": "ich jetzt noch in meiner heim automatisierung einbauen aber das mache ich ohne euch weil"}, {"id": 700, "start": 7847.02, "end": 7854.42, "text": "der plan ist ja dass wenn einer die haus also wenn es wenn einer das hoftor aufmacht und"}, {"id": 701, "start": 7854.42, "end": 7860.42, "text": "es nach sonnenuntergang ist dann soll die kamera auf das preset gehen von der tür und"}, {"id": 702, "start": 7860.42, "end": 7864.86, "text": "das licht anmachen und dann nach zwei minuten wieder das licht ausmachen wieder in die standard"}, {"id": 703, "start": 7864.86, "end": 7869.46, "text": "posi zurückschwenken und infrarot nachtsicht anmachen aber das kriege ich jetzt mit sowas"}, {"id": 704, "start": 7869.46, "end": 7878.58, "text": "hin dann muss ich ja nicht mal viel das reicht ja das reicht ja was ich hier habe eigentlich"}, {"id": 705, "start": 7878.58, "end": 7881.62, "text": "chat gibt sonst noch irgendwelche spannenden sachen habt ihr schon mein neuestes video"}, {"id": 706, "start": 7881.62, "end": 7889.74, "text": "gesehen das bisschen eigenwerbung machen das ist es ist schon ein bisschen clickbait titel"}, {"id": 707, "start": 7889.74, "end": 7895.86, "text": "oder wirst du zugeben dieses pixel spiel schlägt battlefield und call of duty das ist schon"}, {"id": 708, "start": 7895.86, "end": 7912.98, "text": "ziemlich level cap die baiting style aber nur 58 leute das interessiert der bauer hat"}, {"id": 709, "start": 7912.98, "end": 7933.9, "text": "ein neues video aus dem rechner hochgeladen ja schon vor zwei wochen oder so ja so also"}, {"id": 710, "start": 7933.9, "end": 7939.06, "text": "wen können wir dann hosten nutze zur aufnahme ein anderes ach ich habe wieder mein sound"}, {"id": 711, "start": 7939.06, "end": 7943.94, "text": "nicht richtig eingestellt leute sag doch was ne passt doch sound ist richtig eingestellt"}, {"id": 712, "start": 7943.94, "end": 7956.06, "text": "ach so du meinst im vergleich zu videos jaja das ist was anderes also hier ist ja das ist"}, {"id": 713, "start": 7956.06, "end": 7960.98, "text": "das mikrofon mein headset mikrofon in videos benutze ich das große mikrofon aber ich habe"}, {"id": 714, "start": 7960.98, "end": 7965.78, "text": "keinen bock hier gerade vorm tisch zu sitzen und immer in das mikrofon reinzugehen stream"}, {"id": 715, "start": 7965.78, "end": 7976.46, "text": "mache ich mit dem headset mit einem bayern dynamics 300 so ein ding und aufnehmen tue"}, {"id": 716, "start": 7976.46, "end": 7982.54, "text": "ich mit einem so ein mikrofon was man auf den tisch stellt das klingt ein bisschen"}, {"id": 717, "start": 7982.54, "end": 7995.74, "text": "besser aber der headset ist einfach deutlich angenehmer ja und denkt dran morgen im"}, {"id": 718, "start": 7995.74, "end": 8002.46, "text": "tue ist aufwachen stream wieder angesagt so viel schlechter ist es nicht deswegen mache"}, {"id": 719, "start": 8002.46, "end": 8006.34, "text": "ich ja auch wird sich das wird sich das richtig beschissen anhören dann würde ich das auch"}, {"id": 720, "start": 8006.34, "end": 8012.58, "text": "nicht machen aber das ist schon ok so chat irgendwelche vorschläge wenn wir hosten"}, {"id": 721, "start": 8012.58, "end": 8016.74, "text": "können ich schau mal kurz bei mir wenn ich bin voll der lost is on der macht auch just"}, {"id": 722, "start": 8016.74, "end": 8021.9, "text": "chatting aber ich will mal irgendjemand hosten im jahr so 9 uhr in dem dreh immer leute"}, {"id": 723, "start": 8021.9, "end": 8046.74, "text": "die tc bau und die haben wir letztens erst gehostet da fällt mir jetzt nicht viel ein"}, {"id": 724, "start": 8046.74, "end": 8065.14, "text": "wenig haus könnte ich jetzt einfach auf chat wir sehen uns bis zum nächsten stream morgen"}, {"id": 725, "start": 8065.14, "end": 8080.1, "text": "früh so irgendwie zwischen neun und zehn alles klar wir sehen uns bis denn zu"}]}