{"text": "Fockchamp, moin, djsw77, und der Enrixl ist auch am Start, Massive, macht ihr um die Uhrzeit alle hier. Es ist 12.40 Uhr, müsste ich hier arbeiten? Ich muss nicht arbeiten, ich muss morgen wieder arbeiten, muss ich nach Frankfurt fahren, hab ich gar keinen Bock drauf. Ach du hast auch am Montag Freitag, das ist natürlich 5-Hetter-Time. 6-Hetter, 7, 8, 9, 10-Hetter ist das. Selbstständig, ja da würde ich auch noch den ganzen Tag stehen, wobei ich bin selbstständig zur Hälfte. Das Team wird heute wahrscheinlich ein bisschen länger dauern, mal gucken, ob ich das alles raus bekomme. Ich habe im Vorfeld schon ein bisschen geguckt, aber... Übrigens, wollte mal kecken, Microsoft hat mir gerade folgende Werbung geschaltet auf Twitter. Passt mal auf. Das habe ich gerade als Werbung bekommen auf Twitter. Microsoft möchte mir erklären, welche Riesingen es hat, wenn man sich Microsoft-Lizenzkeys irgendwo kauft, und den Hashtag finde ich geil. Bleibe echt. Was soll mir das denn sagen? Bleibe echt. Das ist irgendwie so schlecht ins Deutsch übersetzt, der Hashtag, Alter. Bleibe echt. Das ist mal richtig schlecht. Bleibe echt Talk. Das ist der Bleibech Talk Nummer 3. Den kann man sich sogar anschauen, wenn man will. Den wollen wir uns jetzt nicht anschauen. Aber Microsoft... Guck mal, mal sehen, ob der Link funktioniert. Oder ist mein Internet am abkacken? Ne. Der Microsoft-Link funktioniert nicht. Keck-WHD. Tja. Vor allem die Antworten da drauf auch wieder. By the way, es ist ja echt, ne? Also du kannst ohne Probleme einen echten Key kaufen für 20 Euro. Wenn der nicht echt wäre, würde Microsoft den Gramm ja gar nicht aktivieren. Ja, ich erinnere mich auch daran. Natürlich würde ich das auch... Damals hätte ich auch gesagt, sind Sie Opfer einer Softwarefelder? Ja, klar, das muss gefälscht gewesen sein. Ich wusste vor nichts. Aber wie gesagt, die letzten Jahre, ich kaufe eigentlich mittlerweile wirklich alles, nachdem man auch Streaming, Videos, Musik und sonstige Sachen heute halbwegs erschwinglich bekommt. Kein Ding. Einziges, wo ich ab und zu mal auf irgendwelche Streaming-Seiten gucke, ist, wenn es das nicht gibt. Weil das sehe ich nicht ein. Aber das sind dann meist irgendwelche Nischen-Dinger, die keinen interessieren. Oh, das ist Dings. Ich habe heute eine neue Playlist angemacht. Erkennt ihr das? Wobei man hört kaum was. Ich muss mal kurz ein bisschen lauter machen. Erkennt das hier, Mann? Ich erkenne das sofort. Das ist Terranigma, muss das sein, wenn ich nicht ganz falsch liege. Ja, richtig Proc G-Game. Ich war zu jung für das Game damals. Ich habe es nicht gecheckt, was die mir sagen wollten. Die Story ist auch ein bisschen konfus, aber ja, Japan RPG halt. Ja, also was wir heute machen, ist folgendes sein. Wir gucken uns nicht Microsoft an. Und wir gucken uns auch nicht Vodafone an. Den ganzen Mist muss ich mal zumachen. Und wir gucken uns auch nicht den CCC-Talk an. Ich lasse jetzt einfach den Chat auf, hier an der Stelle, um gut ist. So, ich mache mal die VM an. Also ich habe meinen Access-Point am Start und ich habe festgestellt, dass das CLI für den Access-Point richtiger Müll ist. Du kannst damit fast nichts machen. Okay, restarten kannst du. Aber Sachen, die man machen will, kann man über das Web-Interface machen, aber nicht über das CLI. Also das CLI für den Access-Point ist wirklich pains-champ, richtiger pains-champ. Deswegen habe ich mir gedacht, wir gucken einfach mal, was das Web-Interface für Request schickt. Und dann gehen wir über die API vom Web-Interface und gucken uns das an. Wer entwickelt denn sowas? Ruggus macht das anscheinend. Ja, zum Beispiel, ich lock mich mal kurz ein. Also, Admin. Pass auf, Passwort leak, Leute. Passwort ist aber nicht schlimm, weil der Access-Point ist nicht von außen erreichbar und ich werde nach dem Stream auch das Passwort ändern. Achtung, Leute. Passwort leak gleich. Moment, wo habe ich das Passwort? Hier, Passwort. Ihr werdet es gleich sehen, wir werden es gleich hardcoded in Code reinschreiben. Also, ich habe auch alles disabled. Zum Beispiel, was man, Services, DPSK. Also, wenn man WLAN-Passwörter generiert für User, kann man die sich zum Beispiel hier im Web-Interface anzeigen lassen. Inklusive Passwort mittlerweile. Man kann sogar sich einen passenden QR-Code dafür anzeigen lassen. Das geht alles über die Kommando-Zeile nicht. Und auch das Generaten, quasi das Batch-Generaten von Usern geht nur übers Web-Interface, nicht übers CLI. Das heißt, dadurch, dass es übers Web-Interface geht, du kannst den Mist nicht automatisieren. Das heißt, wenn ich jetzt ein Gäste-WLAN habe, ich habe hier testweise mal ein Gäste-WLAN angelegt, was wir jetzt benutzen werden. Also, ich habe ein Gäste-WLAN angelegt. Mal angenommen, es kommt jemand zu Gast. Ihr kennt mich, was eh nicht passiert, aber für den Fall der Fälle, ich bin ja nicht der Einzige, der sowas verwendet, ist mir aufgefallen, ich könnte gar nicht hergehen und sagen, bla, bla, bla, bla, bla, add User und dann was hinzufügen oder so. Es gibt keine Tools für, das musst du alles übers Web-Interface machen. Was natürlich auch ein bisschen blöd ist, wenn du die einfach mal einem User anzeigen lassen willst und sowas. Das klappt alles nicht so richtig gut übers CLI. Das ist alles ziemlicher Mist, was die programmiert haben. Übrigens, Leute, da steht zwar Java Server Pages, aber ich glaube, das sind gar keine Java Server Pages. Das sieht nur aus wie Java Server Pages, weil wer würde denn auf irgendeinem Low Performance Embedded-Ding wirklich Java laufen lassen? Wer macht denn sowas? Die Seiten heißen wahrscheinlich einfach nur aus Rückwärtskompatibilitätsgründen und unter der Haube ist es wahrscheinlich PHP oder Note oder so. Keine Ahnung. Zumindest habe ich mir gedacht, wir schauen einfach mal nach und bauen uns ein Kommando-Zeilen-Tool, wo wir User auflisten können, User adden können und sowas, aber wir müssen erst mal gucken, wie man sich da prinzipiell einloggt. So, und ich sehe da zwei Möglichkeiten zu, das zu machen. Entweder, das haben wir das letzte Mal gemacht, also entweder, das müssen wir jetzt mal rausbekommen, entweder nehmen wir einen Chrome, Fernsteuern, das ist die Möglichkeit, dass wir einen Chrome nehmen und den Fernsteuern und dann quasi sagen dem Chrome, er soll hier klicken oder er soll da klicken, er soll er soll da klicken, er soll da klicken, er soll dann da klicken und so. Das ist aber nicht so schön, vielleicht, und das hoffe ich eher drauf, ja, bekommen wir raus, wie die API funst. Also sprich, wir gucken entweder hier mit dem, wir gucken entweder hier mit dem mit dem Tool nach, was der, was der überträgt und oder wir probieren mit Postman ein bisschen. Bestimmt gibt es eine einfache JSON-API. Nein, Spoiler, Spoiler, es wird richtig eklig, ich habe nämlich im Vorfeld schon ein bisschen nachgeguckt, es ist keine JSON-API, es ist XML. Es ist XML, ja und richtig eklig ist XML, ihr werdet es gleich sehen. Es ist JavaScript in XML, ihr werdet euch denken, wer hat sich das denn ausgedacht. Ich habe im Vorfeld schon ein bisschen auf GitHub rumgeguckt, was andere Leute so rausbekommen haben. Es ist teilweise JavaScript in XML und das ist richtig, richtig abartig. So und als erstes müssen wir mal rausbekommen, wie lockt man sich ein und sonst was. Ich habe was gefunden auf Shithub, da hat nämlich jemand schon ein bisschen was rausbekommen und zwar irgendjemand hat, was heißt irgendjemand, der MMMollinari hat das rausbekommen, der hat hier so ein Postman JSON gebaut, damit man mit Postman Request schicken kann. Da bin ich nicht so wirklich daran interessiert, wenn ich ehrlich bin. Mich interessiert, was er gemacht hat und es geht schon los. Ich zeige euch mal so ein bisschen, was ihr gleich seht, was auf uns zukommt. Also das geht schon mal mit dem Login los. Das Login ist kein Postrequest, sondern das Login ist ein Postrequest, der, nee ist gar kein Postrequest, ist ein Get, der das Ganze natürlich in irgendeiner Art und Weise in der Url encoded, weil, ja, muss so sein, weil macht man ja 2022 noch so, inklusive Passwort und so alles in der Url encoded. Der Glück, was die haben, ist, dass das harte TPS ist. Wäre das nicht harte TPS, wäre das hochgradig unsicherer Krempel. Gut, aber man, wäre es im Postbody auch. So, und jetzt kommt der Hit. Um sich sein Session-Token zu besorgen, muss man Folgendes machen. Man muss eine JSON-Response, eine XML-Response umwandeln, zumindest macht der Typ das hier so, zu JSON und sich das dann rausparsen. Also man muss quasi JavaScript aus XML rausparsen, nachdem man das in JSON konvertiert hat. Wobei man das in JSON konvertieren nicht unbedingt braucht, das macht der Typ hier jetzt nur. So, und die API sieht dann ansonsten so aus ungefähr. Hier. XML mit vereinzelt JavaScript in XML. Das wird richtig, richtig abartiger Shit. Das kann ich euch jetzt schon sagen. Das wird ganz, ganz furchtbar eklig. Ja. Schauen wir mal. Ich bin gespannt, ob wir das auf die Reihe kriegen. Kann man echt nur das zu sagen. Oh, ich sollte mal updaten. Sehe ich hier gerade updaten? Hallo? Wo ist die Toolbox? Warum ist die Toolbox aus? Was startest du? Wo sollst du die Toolbox geben? Toolbox sollst du starten. So. Open Toolbox. Update, Update. Service Tab. Got it. Juckt mich überhaupt nicht. Wintime beste API. Was ist denn Wintime? Ist das irgendeine Test API wie die Star Wars API? Wintime, das finde ich viel besser zum Testen als die Star Wars API. Das ist für alle exquisite Fiveheader unter uns, die sich nur immer 5000 Euro teuren Wien beim Programmieren und beim High IQ Tätigkeit nachgehend reinhauen. So wie ich nicht. Wir haben das Emote auch. Too Smart ist das Emote bei mir. So hat er geupdatet. Kann man die Toolbox updaten? Check for updates. Ja, übrigens ist euch immer aufgefallen, wie kreativ ich meine. Ich mache den ganzen Krabbel hier mal kurz zu. Ist euch aufgefallen, wie ultra kreativ ich meine User benannt habe zum Testen? Also es geht von Keku, Kekus, Kekus, Batch User Omega Lul und Poggers haben wir zum Start. Habe ich gestern angelegt zum ausprobieren. Ja, Gäste, WLAN. Das Leute, ich sage es jetzt nochmal, bevor jetzt wieder irgendwie 20.000 Leute schreien. User Leak, WLAN Leak, Mac Leak, alles Leak. Das ist ein Test WLAN, was ich angelegt habe für den Stream beziehungsweise zum ausprobieren mit Usern, die ich niemals in echt verwenden werde und mit einem deaktivierten WLAN. Es ist kein WLAN auf dem Access Point aktuell auf. Es kann also noch so viel geleakt werden. Es passiert einfach gar nichts. Aber das wird natürlich trotzdem mich die Leute davon abhalten, was von Leak alle 5 Minuten zu schreiben. So, ihr seid quasi schon drin. Ja, ich weiß, ich kenne euch ja, kenne euch ja. Gut, so, dann legen wir mal ein Projekt an. Leute, sagt mir mal, wollen wir in Just Chatting bleiben oder wollen wir in Softwareentwicklung gehen? Das ist bei mir immer so ein Zwischending. Ich mache Softwareentwicklung mit irgendwie gefühlt 50% Just Chatting. Und wir brauchen guten Projekten haben. New Solution, weiß hier, der Rokoschamp. In Beach und Pool. Moment, streamen da überhaupt noch Leute? Twitch, Beach, Pool. Whirlpool und Strände. Okay, okay. Man weiß Bescheid, was da läuft, ja. Oh, ein KS, Alter. What the fuck? Aber das außer Amorant oder wie man die genau ausspricht, hat kaum noch Zuschauer. Was wäre ich aus Indie Fox geworden? Gibt es die noch? Lange nichts mehr gehört hier auf Twitch. Wurde die nicht sogar gebannt? Ach, keine Ahnung. Ehrlich gesagt ist mir das auch ziemlich wurscht. Ist mir nur gerade so eingefallen. Wisst ihr, was Schlimmes? Wisst ihr was Schlimmes? Dass man sich sogar die Namen merkt. Ich hab das nie geguckt und ich weiß, jetzt sagt der Chat wieder, haha, null Max, ja, ja, nie geguckt, deswegen weiß ich die Namen nicht. Ich hab das nie geguckt, aber man hat genug mitbekommen, dass man sich die Namen merkt. Das ist so eigentlich Marketing-technisch alles richtig gemacht. Die ist gebannt. Na gut. Dann hat sich das ja wohl erledigt. Okay, auf geht's. Also, probieren wir das mal aus, wie man sich einloggen kann. Hello World ist schon mal nicht das, was wir brauchen. War, hattet, ach nee, ich wollte mal was anderes ausprobieren und zwar der normale Poki-W-Virgin-Check-Chat. Auf geht's. Poki-W-Virgin-Check, I'm safe. Ich hab die Copypasta gerade nicht zur Hand. Aber alle einmal Poki-W-Check im Chat hier. Hier keine versteckten Poki-Subs am Start, alles klar. Nicht das ist schlimm, wer soll jeder Subscriber werden will. Gibt so viele Channels, die übelst gefeiert werden, die ich nicht gucke und umgedreht. I'm safe, jawoll. Nice. Nochmal Glück, ja, ganz knapp. So, okay, also, ich wollte nämlich was anderes finden und zwar, weil mir der Standard-HTTP-Kline in.NET so auf den Keks geht. Ich hab nämlich letztens was anderes gefunden, was ich mal ausprobieren wollte..NET-HTTP-Kline und zwar Flurl hieß das, glaube ich. Ja. Flurnd, H-T-T, Moment, wo kommt denn das? Wo kommt das R und ich hab keinen flassen Schimmer. Ach, URL. Okay, da hätte ich auch selbst drauf kommen können. Ja, das wollte ich mal ausprobieren. Keine Ahnung, ob das jemand von euch schon verwendet hat. Wenn ja, kann das ja mal in den Chat schreiben. Das sah mir deutlich angenehmer aus als den eingebauten H-T-T-P-Kline, weil der geht mir regelmäßig auf den Keks, der eingebaute H-T-T-P-Kline. Deswegen dachte ich, probieren wir das mal aus. Und das Coole daran ist, man kann zum Beispiel solche Sachen jetzt machen. Guck, also ich zeige mal. Normalerweise macht man sowas. H-T-T-P-Kline, gleich, new, H-T-T-P-Kline, H-T-T-P-Kline oder irgendwie keine Ahnung, get. Mittlerweile haben wir sowas wie get string und sowas, das gab es glaube ich am Anfang gar nicht. So, get string, google.de und dann kann ich das ausgeben. So, das macht man normalerweise so, hallo. Und wenn ich das jetzt ausführe, haben wir ein Terminal hier unten auf,.net run, dann kommt jetzt gleich Google als Antwort. Dem Terminal. So, nee. Warum nicht? Ach so, weil H-T-T-P-S wahrscheinlich davor muss. Jetzt? Was zum? W-W-W? Was mache ich denn falsch? Ach so, ich habe 3 Slashes, null. So, jetzt kriegt man hier ganz viel Google-Gedöns zurück. So, das ist normal, so macht man Requests mit dem eingebauten H-T-T-P-Kline. Und mit Flurl, habe ich gesehen, kann man sowas hier machen. Guck mal, das finde ich mega nice. Man kann das alles weglassen. Man kann das alles weglassen. Und sagt einfach get string async. Fertig. Ich meine, spart jetzt an der Stelle nicht so viel, aber H-T-T-P-Handling ist in.net eh etwas painstampig. Da ist das auf jeden Fall die schönere Variante. Und man kann auch wohl noch mehr machen. Man kann nämlich auch einfach Header setzen und Basic Auth kann man. Wer schon mal Basic Auth gemacht hat mit dem Standard.net Client, wird wissen, das ist mega, mega eklig, weil du musst dich selbst darum kümmern, dass du die Sachen in Base64 encodest und sowas. Das ist richtig hängen geblieben. Ich weiß nicht warum. Ja, guck, Standard, man muss sowas machen hier. Encoding, get bytes, authorization, header, convert to Base64. So viel boilerplate für einen Basic Auth Request. Das finde ich cool, dass man das hier alles eingebaut hat. So, aber wir wollen ja keinen Request auf Google machen. Wir wollen einen Request machen auf eh ja wohin eigentlich? Login. Login. Da wollen wir einen Request hin machen. So Leute, ich werde jetzt mein Passwort leaken. Achtung. Das wird jetzt nach dem Stream resettet, aber das ist der Moment, den Markter chat immer, wenn irgendwas geleakt wird. Also erstmal die IP von dem Ding 192.168.2.2.143. Das ist die IP da. Sieht man ja hier oben. War User gleich Admin. Wer hätte das gedacht? Und jetzt war Passwort Achtung Massive Passwort Leak. Das ist mein Passwort für den Access Point. Jetzt ist es raus. Wer sich fragt, wie ich das Passwort generiert habe, ganz einfach. Dazu gibt es das schöne Programm PV GAN. Wenn man nicht gerade über den Passwort Manager macht, PV GAN und er generiert euch halbwegs gut merkbare Passwörter mit unterschiedlicher Länge. Ich glaube Minus D ist es oder so. Ah ne einfach hinten dran. So 32. Dann bekommt man solche Orogeheinsheini. Das kriegt man dann da. First try erraten. Ja war klar der Chat ist so sick, der kann in Zukunft quasi meinen Randomizer auslesen und weiß schon, was ich für Passwörter erzeugen werde. Das war mir aber schon klar. Predicted alles. Also PV GAN ist da ganz praktisch und ich glaube, dass PV GAN auch human readable Passwörter machen kann. Obwohl macht standardmäßig schon human readable Passwörter. Ist ganz praktisch. Ist ganz praktisch ja. Was mit SY? Ja das ist, dass er alle Zeichen nimmt. Das will man dann wahrscheinlich nicht unbedingt haben. Das ist das irgendwie schöner. Wie gesagt jeder Passwort Manager kann sowas generieren aber auf die schnelle ist PV GAN eigentlich ganz nützlich. Also wir machen jetzt mal einen Request und zwar wir müssen jetzt gucken wohin der Request geht. Dahin geht der Request. Also. So dahin geht der Request. Mach mal den Krempel mal kurz hier dicht. Also Base URL ist die IP. User ist User und PV Passwort. Okay von der Theorie her wenn das jetzt alles funktioniert. Warum kann ich das nicht erwarten? Ach so weil ich noch sagen muss. Get. String. Async. So von der Idee her sollte ich jetzt einfach. In den Login Bildschirm oder so als Antwort bekommen. Ist das auch ein Post. Ein Get. Ist das ein Get. Ja das ist ein Get Request. Mal gucken. Leute ob ich alle. Ob ich alle gebräuchlichen HTTP Dinge aus dem Kopf hinkriege. Was haben wir denn. Get Post ist klar. Patch. Delete. Ich hab keine Ahnung. Gibt noch mehr. Het genau. Options. Und da gibt es auch noch Zeug was web darf und so verwendet. Putt. Putt hab ich vergessen. Natürlich. Genau. Putt ist eigentlich das normale. Patch verwendet kaum noch irgendjemand. Hier. Header. Das ist ein quasi ein Zero Header. Der hat weder keine Zahl davor. Post. Putt. Delete. Connect. Ja das ist für SSL Gedöns. Options. Patch. Trace. Da hab ich noch nie verwendet Trace. So siehts aus. Wieder was gelernt. Genau. Gut. Also. Dotnet. Run. Hallo. Was ist denn mit meiner. Mit meiner Shell unten da. Ok Leute. Wisst ihr was. Wir brauchen eine ordentliche Shell. Machen wir mal so. Wobei wir brauchen doch nicht mal. Ryder. Pro. Prochanks. Rogoschamp. Dotnet. Run. Ordentliche Shell. Oh. Was jetzt. Ach. Zertifikat. Zertifikat nicht gültig. Ach so. Ja das war klar. Dass der sich dran stört. Mal gucken ob sie das auch einfacher gemacht haben. Ignore. Gibt's da sowas. Ignore. SSL. Nee. Oh nee. Haben die da nichts einfaches eingebaut. Weil Zertifikats Errors ignorieren ist auch was was mir richtig extrem auf den Sack geht. Bei dem Standard Dotnet HTTP Client. Da muss man immer einen extra Händler einfügen und haste nicht gesehen. Blurrl und untrusted Zertifikats. Fiveheader Time. Was. Untrusted Zert Client Factory. Na wenn das ja nicht mal OOP. Of Doom ist. Untrusted Zert Client Factory. Erb von Default HTTP Client Factory. Und macht im Prinzip das was man beim normalen HTTP Client auch machen muss. Man überschreibt das. Okay. Ich hab ne Idee. Wir machen mal was Fiveheader mäßiges. Ich sehe nämlich schon kommen dass wir jede Menge HTTP Helper Methoden hier brauchen. Deswegen machen wir einfach mal eine extra klasse HTTP Helper. Nur nicht ganz sicher was da alles reinkommt. Aber da kommt auf jeden Fall JSON to XML und so gedönnt rein. Ne ne XML to JSON und sowas. Was jetzt? Ah Chrono Trigger Musik. So also machen wir eben so viel Void. Global. Global. Ignore. Zert. Error. Ja. Jetzt müssen wir bloß auch schauen was man da reinschreibt. Abblick. Fertig. So also was braucht man da jetzt? Untrusted Client Factory. Bonkers Alter. So und jetzt? Alter was ist das für High IQ Shit wieder? Warum warum machen die es einem immer so schwer so simple Sachen wie Zertifikatswarnung zu deaktivieren? Oh Url kann man das nicht irgendwie global überschreiben? Also irgendwie. Also irgendwie keine Ahnung. Was macht der hier? Flurl. Wieso nicht einfach Curl ausführen und Insecure setzen? Na weil das ein bisschen nervig ist wenn du Kommando Teilen Tools aufrufst und dann zu checken. Keine Ahnung. Was ist der Return Code? Das musst du dir irgendwie aus der Response rausparsen. Du kriegst kein fertiges JSON als Response. Das kannst du machen aber schöner ist es wenn man irgendeine integrierte HTTP Library verwendet. Wenn gar nichts hilft kann man Curl aufrufen. Ja. So gibt es hier so Global Settings? Das ist doch schon mal gut. Du hast wie Händler oder so? Nee. Factory? Ah guck mal da. Flurl Client Factory. New Untrusted Client Factory. Leute warum fresst ihr den eigenen Kram nicht wenn es doch extra davon abgeleitet ist? Ah Moment das ist eine HTTP Client Factory. Alles klar. So. Moment jetzt mal gucken ob das jetzt funktioniert. Zack. Gotnet Run. Immer noch das. Moment ruft er diesen Krempel überhaupt auf? Dass man sich immer mit so einem Bullshit aufhalten muss man. Ich will was machen. Keck. Führt er das denn überhaupt aus? Er führte es aus. Ok. Ihr kennt mich Breakpoint setzen ist nicht meins. So. Das interessiert den nicht. Ist das vielleicht gar kein Problem mit dem Zertifikat? Weil da steht ja nichts von Zertifikat. Da steht einfach nur SSL Handshake failed. Also quasi hier. Ok. Google. Google. Gotnet. Ne 6. Moment da ist doch schon was. Was? Wie? Wollt ihr mich verarschen kann man keine Zertifikatsmeldung mehr deaktivieren? Das macht es. Das kann nicht sein. Das wäre ja komplett unbenutzbar. Die Hälfte der Seiten die man automatisch auslesen will intern oder sonst. Die haben kein gültiges Zertifikat. Ok. Was machen die da für Dinger? Was? Soll eine eigene OpenSSL konft? Im Leben mache ich keine eigene OpenSSL konft dafür. Was kommt denn als nächstes? OpenSSL selbst kompilieren oder was? Oder wie? Ich glaube dass SSL V3 steht ist einfach nur in der Fehlermeldung. Das heißt einfach so. Ich bin mir gar nicht sicher ob das wirklich. Wobei TLS. SSL 3 ist doch im Endeffekt. TLS 1 2. Kann man das hier vielleicht einstellen? Kann man hier vielleicht einstellen? TLS oder SSL? SSL Protokolls kann man da einstellen. Guck mal da. Benutzst du Rider? Ja. Ok was muss man da angeben? SSL Protokolls? Eine Liste? Irgendwie sowas? SSL Protokolls? TLS? Ach das ist ein Enum. Den muss man wahrscheinlich mit und zusammen machen oder mit oder zusammen machen. So war es da. Ok was passiert jetzt? In Python wäre das nicht passiert. Du wirst immer was finden was in anderen Programmiersprachen nicht passiert wäre und umgedreht. No ciphers available. Aha. Max du machst das echt gut wollte ich dir sagen. Dankeschön. Schön dass es dir gefällt. Aktuell läuft es zwar nicht so aber kann ich ja nichts für. No ciphers available. Was zum Teufel will der Dude mir sagen? Was ist das? Ok wir müssen glaube ich die Runde google noch. Aha ok. Sobald man das aktiviert kommt das mit dem Handshake fail. Ich aktiviere jetzt einfach alles. Ich aktiviere jetzt alles inklusive none. Mal gucken was passiert. Beim SSL hatte ich auch Probleme ja. Weil RSA deaktiviert war aber das muss jetzt ja was anderes sein. Oder kann in die ähnliche Richtung gehen. Ok also das ist es schon mal nicht. Aber wir haben eine neue Fehlermeldung nach der wir suchen können. Dotnet. No ciphers available. Guck mal wir finden. My SQL connector. Nee. Onkar. No ciphers available. Ich hatte sowas schon mal. Ich bin mir aber nicht mehr sicher wie man den krempelt. Nein das ist OpenSSL. GitHub. Oh Gott. Ich mach also was ich nicht machen werde ist das hier. Ich werde definitiv nicht. Hier. Das werde ich nicht machen. Das sage ich euch. Das sehe ich nicht ein. Ich werde mir definitiv keine. Eigene. Jetzt blicke ich dann mal durch. Wir hatten doch eben irgendwo was wo sie geschrieben hat man soll sich eine eigene ciphers policy. Man soll sich eine eigene OpenSSL konf machen. Das sehe ich nicht ein. Hier. OpenSSL konf. Das mache ich nicht. Das kann es doch jemand der vielleicht das tool verwendet doch nicht zumuten. Ich bin eh der einzige der es verwendet. Das sehe ich nicht ein. Ich mache mir garantiert keine eigene OpenSSL konf weil dort nicht irgendwelche komischen default settings hat. Ok was haben die gesagt alternativ kann man cipher suites policy verwenden. Ok. Cipher suites policy http client. Wie setzt man das da. Aha. Sockets http händler. Aha was haben wir da denn. Der Ghost hat gepostet. Also da sind User die es nicht mal auf github gibt. SSL Client Authentification Options. Alter. Dass man für so einfachen Kram in den Untiefen wieder rum suchen muss ist doch absolut für ein Bobbles man. Also was machen die Dudes hier. SSL Client. Ok. Das machen wir hier rein. SSL Authentification Options. New cipher suites. Jetzt müssen wir bloß noch die cipher suites raus bekommen die wir brauchen. Sockets http händler. New sockets http händler http client. Ne das brauchen wir an der Stelle gar nicht. Kann man diesen Kram hier returnen anstatt den da unten. Ok das funktioniert. Das ist schon mal gut. Jetzt müssen wir nur raus bekommen was der für ciphers haben will das es funktioniert. Äh gleiche Fehlermeldung. Ok wie viele ciphers gibt es denn. Vielleicht können wir einfach try and error machen. Oh. Ähm ich hab ne andere Idee wir aktivieren einfach alle. Wir aktivieren einfach alle. Oder im Browser nachschauen. Ok. Zwei Sachen wir aktivieren einfach mal alle. Wir aktivieren einfach mal alle. Richtig 5 hat wusste ich auch lange Zeit nicht das es das gibt. Guck mal. Das ist ja ein Enum hier. Dieses tsl cipher suites. Wenn ihr eine Liste erzeugen wollt mit allen möglichen values für einen Enum geht das folgendermaßen. Enum. Ähm. Get values. Und jetzt bekommt ihr eine Liste mit allen Enums da drinnen. Also das was das Ding frisst schauen wir mal ob es jetzt funktioniert. Oh man. Ah. Guckt mal. Das ist jetzt ein anderes Fehlermeldung. Das ist jetzt die Fehlermeldung was das Zertifikat nicht gültig ist. Das heißt die Cipher Geschichte haben wir um shift. Jetzt müssen wir dem Ding nur noch beibringen. Wie man das Zertifikat accepten kann. Also vielleicht irgendwas mit SSL. Ne. Cert. Richtiger 5 hat stream ja. Local Zertifikat. Remote Zertifikat validation check. Ich hab. Also ich benutze selten Methoden mit. Wie viele Buchstaben hat das. 36 Buchstaben alles klar. Importier das doch einfach in deinen lokalen Zert Store. Nö. Da könnte ich mir genauso gut auch. Custom Open SSL Konfig anlegen. Das will ich nicht. Ok. Wie geht der Krempel. Wie funktioniert das. Aha aha. New Validations. Die Termen da einfach true und gut ist. True Lul Lul W. Ob's. Nicht so machen. Noch mehr. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ok. Sekundeauto. So mijn das jetzt. Jetzt wissen wir Bescheid. Was. Ein Krampf mercy Euch anfallen kann ok nann Dann wrap ich ich das mal hier rein. Jetzt sagen wir einfach. dass es auch ein bisschen sprechend ist am anfang global ignore third error dann weiß man gleich was passiert fix me im response ja da weißt du bescheid fix me remove this one after using user legacy code refactor ich sag euch mal eins das wird nie passieren die werden nie den user legacy code refactor jquery wir haben hier mit einem absolute bleeding edge hook modernstem modernstem GUI zu tun überhaupt ja sehe ich schon ist aber egal wir sind ja auf die api scharf und nicht etwa so sehr danach was denn jetzt da in denen ihr frontend passiert ist mir ehrlich gesagt ziemlich egal also gut response das sehe ich das richtig wir konnten uns jetzt anmelden hat das mit dem anmelden jetzt funktioniert wahrscheinlich ok jetzt brauchen wir unser tauchen unser tauchen bekommen wir ich muss mal kurz husten ich muss ausmachen ok so und jetzt brauchen wir unser tauchen das da und das bekommen wir mit dieser url underscore wahrscheinlich ist sachen mit underscore private api aber es gibt eh keine publik api also können wir auch eine private private api verwenden müsste ich jetzt nicht irgendein session cookie oder session header oder irgendwas zurückbekommen eigentlich den muss ich mir bestimmt merken den header six hat header headers for each header header schauen wir mal weird champ es gibt keinen session header oder sonst was woher weiß der denn jetzt dass ich eingeloggt bin cookie cookies cookies cookie name cookie value dass ich weiß wo es aufhört gibt keine cookie ja moment wie merkt er sich denn dann dass ich mich überhaupt korrekt eingeloggt habe vielleicht habe ich mich auch nicht korrekt eingeloggt der access point ist kann hell sehen der ist richtig high IQ machine learning trainiert egal wir machen einfach mal weiter in der hoffnung das funktioniert jetzt also so also response das ignorieren wir mal ich weiß nicht was ich damit machen soll und jetzt brauchen wir einen weiteren get request auf auf jsp oder auf csrf token war string cv alter warum kann er mein makro für die konsole nicht so run mal gucken was wir zurück bekommen ich sagte wir bekommen javascript in xml zurück bzw in html aber html ist ja quasi xml so was zum geil was ist das für eine bescheuerte response was ist das für eine beschissene response alter den script hack return aber man normalerweise würde ich sagen was haben die china chinesen da programmiert aber das waren gar nicht die china chinesen kann man da irgendwie sagen content typ oder so content content media irgendwie dass ich dann sagen kann irgendwie content type application json gucken ob das funktioniert wobei nie das ist was ich sende oder wie gibt es einen header mit was was was die erlaubte response ist wer das programmiert except header except einfach so okay ist egal kommt kommt immer das gleiche zurück also da müssen wir das jetzt irgendwie hasen das ist an der stelle tatsächlich sogar noch relativ einfach guck mal wir bekommen hier zurück in den javascript hack das können wir alles ignorieren wir sagen einfach response split split am am gleichheitszeichen und dann das zweite weil also wenn wir am gleichheitszeichen splitten dann ist das hier das nullte element und das ist das erste element und dann einfach das 1 2 3 4 5 6 in dem moment das muss man mit zählen 1 2 2 ne 1 weil bei null ab dem zweiten zeich also ab dem dritten zeichen bis zum 1 2 3 4 5 6 7 8 9 10 hatte der nicht sowas hier drin stehen 12 alles klar 12 kannst auch gleich am quotes richtig wir können bei den quotes split da hast du vollkommen recht noch besser ja hast recht ist noch besser aber wir haben es auch so schon aber du hast recht wir können an den quotes das ist eigentlich noch viel viel sinnvoller wir splitten an den quotes kann man eigentlich sowas hier machen chat ist wieder richtig feifert so wenn wir splitten an den quotes dann ist es nämlich direkt 0 bis 8 oder so also anfangen bis nicht bis 12 dann bis 10 10 was so habe ich doch gerade weggemacht ok alles klar gut man könnte jetzt sogar noch so man könnte jetzt noch weitergehen an der stelle eins kann man noch sagen last weil das ist dann auch nicht schöner ne wobei last geht an der stelle nicht eins wir brauchen das in der mitte wobei leute das geht so ich lasse es jetzt so also das hier ist unser du kannst auch zwei von den auch noch besser noch noch sichs hättiger also das hier ist jetzt mein cross request und die wir um sind die wörter da drinne cross seit s cf er heißt es nicht ist doch richtig richtig so klappt token und jetzt so gut so kann er mal ordentlich meine sachen expanden hier anstatt mir das einzufügen der rüpel danke für den zapp oder ist es cf haben die sich da auch noch verschrieben drinne oder was die haben sich die haben sich die haben sich verschrieben oder also das lässt mir sehr viel mut macht mir das für diese tolle für diesen access point also korrekt korrekt heißt das ding c s f ist richtig geschrieben ja okay jetzt haben wir unser token was passiert denn jetzt wenn ich das tauchen anfordere ohne mich vorher eingeloggt zu haben ich würde sagen den error wahrscheinlich bei ich immer noch nicht ok wenn ich mich vorher nicht eingeloggt habe dann gibt es keine response aber was ich immer noch nicht gecheckt habe ist wie dass ich das merkt der muss hier irgendwelche cookies setzen aber er hat keine cookies was zwei von hinten noch besser katschi bass ne stimmt nicht eins von hinten ne moment ich brauch das gar nicht oder weil da nachher noch ein quote kommt dass so müsste es doch eigentlich reichen das ist unnötig obfuscated so jetzt haben wir unser token hier ja der chat hat es natürlich schon wieder fünf meter gegen fünf kilometer gegen den wind gesehen alles klar so alles klar gut schön wunderbar jetzt habe ich mein token und wie geht es weiter get system information aha dann muss man das hier setzen als als herdo kann ich nicht ne kann ich nicht dass man das kann das ding wie die folgt die folgt hätte hätte global settings hätte die folgt hätte müsste ich jetzt setzen können das wäre natürlich sehr praktisch wie heißt der krempel noch die folgt hätte also jetzt müssen wir das ja bei jedem request dabei schreiben na gut gibt schlimmeres so system settings wobei will ich system settings überhaupt abrufen nicht dass ich jetzt vielleicht wirklich irgendwelche sachen liege die ich nicht liegen will weil was soll ich nicht ich gesetzt in excess poinina im stream was soll passieren was soll passieren jetzt kommt xml leute xml in weißt ihr was scheiß drauf wir machen kein wir machen kein get stats wir gucken admin wir gucken was der was der schickt weil was ich eigentlich machen will ist aufgeploppte da geht mir auch auf dem fix was ich eigentlich machen will ist mit die user auflisten lassen nicht die nicht diese user hier sondern die dpsk user wenn ich hier drauf klicke sollte das ja eigentlich laden konf request get konf response möchte da unten drauf gott blieb das ist das pass das ist das die pass phrase von meinem wlan das wollte ich nicht haben ich will die pass phrase von den usern haben konf also ich will ich will eine liste mit usern haben alter warum geht das immer weg wenn ich da drauf klicke pains champ hier request so kann man sich das doch nicht angucken guck mal das ist verbackt ne das ist der access point ja wie soll man das jetzt bedienen man dpsk list das sieht gut aus dpsk list ja hier sind die user alles klar die user die brauche ich pass phrase ip address ip address man kann sogar die ip auslesen das ist ja nice das sehe ich dann aber nur wenn einer verbunden ist da drin da sehe ich auch gleich was der für eine ip hat das ist nur das ist gut wlan id wlan id aber die kann man dann auch direkt da drüber setzen ja das ist nice da kann sogar mein tool dann mehr als das web interface start point pass phrase ja du ich glaube aber sind gar keine java server pages weil das ist irgendwie ich glaube nicht dass sie da java drauf laufen haben ich glaube das ist jebait also request was müssen wir für den request machen dass wir das bekommen get stat updater und dann habe ich als response was alter wer hat sich das ausgedacht schon wie die wlan die wlan performance ist richtig gut ich habe gestern das ganze mal angeschaltet ich habe mein altes wlan auf vergessen geklickt beim handy und ich bin also aktuell ist es so ich komme mit dem wlan bis in garten mit vier access points access point im keller, access point im erster stock, access point im erdgeschoss access point neben mir auf die seite zur terrasse ich habe gestern eingeschaltet ich hatte überragenden speed ich meine das ist kein wifi 6 nur wifi 5 access point äh 3 400 mbit und das bis an eingang also bis die terrasse runter mit einem access point nicht mit vier also die wlan performance ist wirklich gut so also das müssen wir da jetzt schicken oder wie also leute wir müssen jetzt xml zeug schicken jetzt wirds jetzt wirds eklig so das können wir uns glaube ich wahrscheinlich sparen get stat dpsk list power ob irgendjemand diesen kram schon mal irgendwo gemapped hat im internet aha aha so so da haben auch schon ein paar andere leute dran geforscht wie heißt der access point das ist eine rugus r710 lass dich nicht abschrecken von dem neupreis der neupreis würde so halt keiner mehr kaufen weil das ist die letzte generation nicht die aktuelle die aktuelle generation ist der r750 der r750 gibt es für 1242 also ein schnapper du musst auf ebay gucken schauen wir mal ebay also ich habe irgendwie 260 270 euro für bezahlt aus vereinigte staaten nee ich mein kann man machen aber guckt euch mal den versand an das will man wahrscheinlich nicht haben ok neu eingestellt 405 alter was ist denn mit euch los was ist denn mit euch jetzt verkehrt guck mal da aus großbritannien dran aber 376 also wie gesagt ich habe 270 euro bezahlt was kann er mehr als 61 euro access point einiges kann jetzt schlecht alles aufzählen haben wir uns gestern im stream alles angeguckt der kann zum beispiel eines der features die ich ja persönlich mega nice finde und musst du kurz was trinken eines der features die ich ja persönlich mega nice finde ist dass der passwörter kann für jedes pro gerät also kannst quasi ein wlan aufmachen und jedem gerät ein eigenes wlan passwort geben was du dann löscht wenn du das gerät weg schmeißt unify habe ich aktuell mal kurz darauf einzugehen also unify habe ich aktuell aber da bin ich an einigen stellen nicht so wirklich damit zufrieden vor allem dass sie sich dagegen sträuben schon seit jahren eben das zuletzt genannte feature einzubauen dass man unterschiedlichen geräten unterschiedliche passwörter geben kann und ich rede nicht von wpi enterprise sondern von iot geräten die kein wpi enterprise können dann das kann fast jeder mittlerweile mikrotik kanns rakus kanns cisco kanns aruba kanns aber die haben andere probleme und warum nicht von cisco weil cisco den krempel nur in zusammenhang mit irgendeiner komischen network appliance von ihnen kann und aruba ähnlich da brauchst du irgendeine cloud clearpass cloud lizenz oder sowas dass das funktioniert und sozige gesachen und preisleistungstechnisch und handlingstechnisch war das ding das beste was ich gefunden habe zumal man die ohne controller betreiben kann mit der unleashed firmware für alle anderen mann controller brauchen ich bin nicht so scharf drauf für einen access point noch einen controller daneben zu stellen ok also jetzt probieren wir das mal aus ja er kann vor allem mehr als 60 euro kosten das das stimmt wobei das unify auch kann ganz ehrlich ein neuer unify access point oder gebraucht hier ein für 260 270 würde ich sofort den nehmen ok aber also ihr könnt euch entweder ein r710 oder ein r610 kaufen ich würde keine wirklich aber nicht für den preis nicht für die preise leute wie gesagt ich habe 260 270 euro irgendwie dem dreh bezahlt da muss man muss man ein bisschen abwarten und gucken man kann auch mal gucken ob es r720 gibt aber es macht eh keinen großen unterschied ne das wird schon zu teuer das muss man einfach mal abwarten einfach abwarten bis es gute angebote gibt und dann zuschlagen also wie gesagt unter 300 euro ist ein guter preis dafür und die dinger sind obwohl sie quasi jetzt nicht mehr verkauft werden weil die schon ein nachfolgerprodukt haben trotzdem sehr sehr nice so wie schicken wir denn jetzt hier einen request get stats dpsk list was muss ich dann aufrufen leute das habe ich hier schon zugemacht wo waren wir denn hier cmd stat jsp muss ich aufrufen also ok jetzt wirds jetzt wirds spannend cmd cmd stat punkt stats stat jsp so und ich will nicht get string sondern post post will ich wahrscheinlich einfach nur machen und jetzt will ich ihm sagen http content also new string content und zwar will ich ihm habe ich das hier nicht eingestellt immer im rider das alt und moment das muss ich mal kurz einstellen shortcuts keyboard shortcuts ich möchte move line up line siehts irgendjemand move line wenns irgendjemand sieht sagt mir bescheid move line up move line up genau keyboard shortcut alt file up ist dafür schon ja das ist mir egal yes und jetzt edge down ja viel besser so also new string content wir wollen das xml posten kein encoding mit schicken soll er standardmäßig machen was auch immer er will und jetzt wollen wir ihm sagen das ist weiß jemand zufällig aus dem kopf den den mime type xml ist es application xml xml warum sie schab und nicht javascript warum nicht pisen warum nicht rust warum nicht go kannst du genauso gut fragen hat keinen tieferen grund außer dass ich gerne sich habe moment text xml und was war das andere application xml aha moment was nehmen die denn hier xml hier nehmen sie text xml was sagt denn mein browser was macht denn mein browser beim request header request header content type what er sagt es ist form es ist eine form aber es ist überhaupt keine form komm und hier hat er doch einen session cookie gesetzt warum hat er denn sonst kein cookie bei mir gehabt vorhin nur mal dass ich das richtig verstehe die halten sich selbst nicht dran es ist angeblich hier eine unencoded form und es ist offensichtlich keine unencoded form sondern xml string na geil alter da kann ich auch application xml setzen wird wahrscheinlich egal sein ok ich sechs ich setze text xml weil das beispiel auch text xml macht und wo ist jetzt das problem ok gut das heißt es hat nicht response und rasp headers get string einfach noch mal gucken ob das funktioniert run fack ich muss das tauchen ich muss ich muss das des dieses dieses tauchen ja dann auch irgendwie setzen sonst bin ich ja bin ich ja gar nicht authentifiziert oder identifiziert schon aber nicht so wie er das haben will wie heißt der header hier c ok also muss ich jetzt hier noch zusätzlich sagen ich möchte noch hätte etten ette header x cs f tauchen cs f tauchen und jetzt bäm please praege praege das immer nice massive xml response alter leute wir haben jetzt zwei sachen die wir machen können entweder wenn xml parser und passen aus dem xml den ganzen krempel raus oder wir machen das sowie der typ hier und konvertieren das xml zu jason und bearbeiten das dann somit reggex reggex ist auch noch eine möglichkeit vielleicht ist das mit reggex gar keine so schlechte idee leute kennt irgendjemand einen schönen einen schönen xml format für commander zeile oder xml format bestes geht auch bestimmt relativ von pretty pretty print xml lind xml lind das du mal hier habe ich das überhaupt installiert minus minus format habe ich witzigerweise installiert ich weiß ehrlich gesagt nicht warum aber ok es ist noch nicht mal gültiges xml es ist noch nicht mal gültiges xml meine güte was haben die da programmiert man was ist das ok ok ich habe ich habe nichts gesagt ist ok ich habe nichts gesagt es ist alles in ordnung nicht nichts schlimmes ich bin ich printe das ja selbst ok ok leute wir könnten wir könnten reggexen wir könnten reggexen massive da braucht aber den massive 5 hat reggex hier dafür ok reggex wir können es auch lassen ja was ist ich bin mir jetzt gar nicht sicher also wir haben wir haben drei varianten so wie ich das sehe xml parser benutzen in dotnet eingebaut xml in jason konvertieren oder reggex rauskrabben wir kommen wir machen mal test string so rum also also komm also reggex skills das ist doch gar nicht so schwierig das sieht doch gar nicht so schwierig aus also punktsternchen sollte alles matchen ok wir matchen mac mac gefolgt von quotes punktsternchen non creedy quote und eigentlich will ich das hier matchen das geht doch das geht doch das ist doch in ordnung das kann man sich doch so rausholen ok als nächstes wählen es sedings user user interessiert mich als nächstes user moment muss jetzt so machen reggex ok group 1 ok das das geht das klappt das klappt warum funktioniert das so mit dem leerzeichen dazwischen dass das ist kein guld das match überhaupt nicht weil hier nix dazwischen steht das müsstest du eigentlich schon so machen kann das sein dass das der reggex tester einfach für mich macht um um 5 hat zu sein egal so also wir brauchen den user wir brauchen last rekey next rekey expire start point pass phrase brauchen wir noch pass phrase ip vielleicht ja ist doch gut so und das jetzt reggexen leute die fall fertigste methode wäre dass du nach dass du nach space splittest dann jeden part nach dann hast du die wer was nach space splitten stimmt das würde tatsächlich funktionieren aber nur in dem fall aber nur in dem fall würde es funktionieren ich könnte ich könnte splitten ich könnte splitten am sp am space dann bekomme ich diesen ganzen müll hier einzeln und dann muss ich gucken contained das split ein gleichheitszeichen und dann splitten am gleichheit vor nie das ist aber das ist aber eklig ne ne ne ne aber wir machen jetzt wir machen jetzt reggex reggex stellt okay also was wie nennen wenn das denn jetzt hier das muss man nachher noch irgendwie reppen in der eigenen klasse wie nennen wir das ding jetzt hier xml response per line kann ich nicht machen weil das ist nur die line weil ich xml format hier in wirklichkeit in wirklichkeit sieht der output so aus keine lines oder ein bisschen x-part ja ja das ging auch aber ich habe ehrlich gesagt seit 15 jahren kein xml mehr gepasst weiß gar nicht wie man das dort nicht gescheit machen dort nicht gescheit macht dokument xml document irgendwie was load und dann sonst wie zeigt mal vielleicht ist es noch vielleicht ist es einfach xml document pass c-sharp wie sehen das aus x-object x-node im x-document was ist das warum gibt es da schon wieder verschiedene sachen ok x x-document monka es dann ok probieren was probieren was erst mal so also x-dokument pass x-dokument was kann man da jetzt so machen declaration node parent save right so da kann man jetzt link link verwenden also xml pass ich weiß was muss ich jetzt mal ob es was muss ich was muss ich jetzt machen xml noch jemanden dann elemenz oder sowas wahrscheinlich ja oder root elemenz ok leute ich muss mal x pass select elemenz wie funktioniert kann ich da sowas wie wie im browser selektor schreiben x pass select c-sharp wie funktioniert das habe ich noch nie gemacht noch legit noch nie also what geht das auch in einfach es geht das auch in normal dem lieber punkt elemenz ok for each mal gucken was da rauskommt ich habe keinen plan elemenz ups ok kommen aus irgendwelchen gründen habe ich das jetzt gleich pretty printed elemenz das war einfach nur ein element oder wie meine güte wie wie macht man das jetzt gescheit gibt es warum gibt es nicht sowas und dann response und dann ok also sehe ich das jetzt richtig mache jetzt mal root root elemenz ist ja das oberste in dem fall ich feife da xml bearbeitung so root so root elemenz sollte jetzt ja alles sein wenn das print gut gut so elemenz die elemenz fast fast fast node ok fast element mein gott wie macht man sowas elemenz element get the first elemenz specified x name x name ist der element name also quasi sowas da ich habe keine ahnung ob ich das richtig was ruht die sendens dps k ich glaube euch jetzt einfach mal chat tatsächlich das scheint was zu funktionieren da geht was habt ihr schon was von aus kommentierten kommentaren gehört gibt gibt es in dem tool mit dem ich gerade entwickel was habt ihr schon etwas von aus kommentierten kommentaren du mein sowas hier und dann und dann wieder an kommenten oder oder oder was ok jetzt feife check für den chat leute wenn das funktioniert gibt es einen neuen feife award für den chat ha es funktioniert excellent massive IQ die spaz granate wusste es ok so jetzt haben wir die elemenz davon und jetzt müssen wir da was raus bekommen kann ich jetzt kann ich das jetzt mit attribute attribute drauf zugreifen also quasi element attributes attribute und dann so was sagen wie meck so und dann dann präntet er mir die meck adresse poggers aber jetzt will ich nur nur den value haben guck mal da das funktioniert tatsächlich relativ gut relativ gut man kann sich jetzt darüber streiten ob wirklich gut funktioniert funktioniert relativ gut ok dann machen wir jetzt mal eine extra klasse public class ruckus user so und der user hat ein string was name also name haben die haben die dinge dann eine meck string meck dann haben wir die leine all die brauche eigentlich gar nicht meck created wäre natürlich noch cool klasse erstellen und rein serialisieren ja wenn du mir sagst wie man das mit xml document macht würde ich mache ich das dürfte ich am einfachsten sein also pass pass phrase brauchen wir noch gibt es auch was wie element 2 oder serialize keine ahnung wie das funktioniert also das bedeutet doch jetzt im endeffekt ich kann jetzt hier sagen user gleich ups das er so richtig macht user gibt schon ah xml serialize an you ist x hat get type was ist p so sehen aus kommentierte kommentare im konto meines stonks automatisieren zu warum gibt es einen status über aus kommentierte kommentare meck so kann ich mal auto komplizieren so kaputt ist das was ich hier baue so user alter der kann doch nicht mal meine ah jetzt kann das ok element wie ist der krempel jetzt chat hochskolle wie ist der kram jetzt user einfach nur user user und pass phrase ist das pass phrase pass phrase ok so und wenn das jetzt funktioniert dann sollte ich für jeden user kann man rekord draus machen übrigens dann kann es kann ich einfacher prinden ok funs was jetzt ha easy xml gepasst so einfach kann es gehen sehr gut keine ahnung was geht ja wir haben die user vom webinterface abgefragt mit merck mit pass phrase vielleicht sollten uns dann die wlan all die noch mal holen weil die wlan all die könnte tatsächlich relativ praktisch sein wobei jetzt müssen wir doch gucken wie man die wlan all die zugeordnet bekommt zum eigentlichen wlan name aktuell haben wir nur die wlan id max doch sich da wie soll ich mich bei sowas denn docksen gesetzt in exis point danach doch beziehungsweise mach mach das wlan und das passwort raus vor der online geht exis pointe engter mit gestoppten wlans überall dann so passphrase jetzt haben wir hier noch wlan und das ist was wlan wlan svd id wo jetzt müssen wir raus bekommen wo denn da jetzt drin äh achso ja dann ist dann ist die zahl halten stringen was soll es kannst ja noch den wenn du zu merck raussuchen ne ne bringt wobei die idee ist gar nicht ich meine mehr features schaden ich warum nicht wenn ich es nicht lustige sache nicht dass man das brauchen würde so jetzt haben wir den ganzen krempel wlan all die wie kriege ich zur wlan all die passend jetzt raus wie der name vom wlan ist das müsste doch ja auch irgendwo drinne stehen alter jess skip gucken wir mal service dps k generate ok hier requests response hier wlan wlan svc list guck mal wlan s aha und was ist die id id in die wlan des versandes enable type ja und woher weiß ich jetzt die id von dem ding dann müsst ihr was eins drinne stehen ob alle hört es noch mal auf btf id hier ist es id ok noch mehr xml shit also konf underscore requests das ist jetzt es ist ja so bescheuert alle diese abwärts das denn ausgedacht man ok so jetzt müssen sie mich noch die wlan abrufen da können wir den user printen und dann machen wir das in der eigenen klasse weil aktuell blicke ich schon gar nicht mehr durch was hier überhaupt wie wo passiert also das müssen wir irgendwo jeder vormachen also so also xml request das da xml also dcrypt x true caller das kann wahrscheinlich alles weg ich denke mal komp wlan svc das werden wir wahrscheinlich brauchen schauen wir mal ob da ist der ganze miss drinne steht das ist wirklich also diese api zu bedienen ist wirklich hochgradig spain stemme ich kann schon verstehen dass sie kann bock nope muss ich doch was andere schicken muss ich doch den kompletten schicken nope achso die falsche url null ich kann falsche url es muss ja auch nach konf konf ich sag dir gleich was das für einer ist prager aha id 1 sehr schön so xml format hier passport leak leute alles klar guckt mal da wlan svc brauchen wir jetzt und dann dort das attribut für id das ist ein so einer die sind ganz die sind frucht die sind sehr günstig diese access points haben wir die sich neu kauft aber iber regelt aber gucken ob ich das jetzt richtig gelernt habe wie man diesen krempel wie man diesen kram passt also so x document pass und jetzt sage ich x document die sendens so wie hier unten im prinzip kann ich mir das copy pasten die sendens bloß dass ich jetzt nicht dps k haben will sondern wlan svc wenn das jetzt funktioniert kriege ich meine meine wlan geprintet der kann der hat deutlich mehr features als das ganze unify zeug das sieht doch prinzipiell ganz gut aus so und da will ich jetzt l da will ich jetzt attribut attribut name und all die haben all die und name schauen wir mal so haben wir die ganzen wlan nice so dann brauchen wir noch da braucht man mal ein dictionary jetzt keine ahnung wlan dictionary auf wobei warum solche dick na doch weil die nicht weil die ids ja nicht bei null anfangen aus int und string und dann sagen wir wlan add so das hier ist die id alles natürlich als string und das hier ist der name so und da machen wir irgendwie hübsche kommandozeit anwendung draus du würdest einen counter begrüßen ja das müsste man höchstens mit haben wir nicht bei nightbot dann kann nightbot nicht kauen nightbot hat doch counter übrigens string id name gut und jetzt können wir sagen an der stelle hier unten wo wir die wo wir die ganzen wlan auflösen wlan so wir wollen nämlich haben wlan und dort an der stelle das wlan mit dieser id und wenn das jetzt funktioniert dann habe ich jetzt den namen da drin anstatt die id ok also wir haben user wir haben mac wir haben passphrase und wir haben das wlan damit kann man doch schon mal was anfangen gut und daraus machen wir zum kommandozeilen programm ich bin ja geneigt dazu das jetzt endlich immer auszulagern in irgendeine eigene api klasse weil so kann das doch niemand händeln auf dauer gerade wenn ich mir dieses abfuck xml zeug ansehen kriege ich ja anfälle ok wir machen eine eigene api klasse also das ding als ruckus api so das ding das ding kriegt kein konstruktor das ding kriegt eine factory metode oder wie man das genau nennt public static wenn wir das einfach mal login was load was achso log in ich habe montags immer frei allerdings was die ganzen leute hier machen das weiß ich nicht ich bin natürlich froh dass ihr da seid also login op monka es ja ich habe montags immer frei also login gut also wir machen das jetzt mal wir schmeißen mal die sachen hieraus also login funktioniert folgendermaßen das hier ist mein login ein login code kodra async task so ip die ip wird einfach hardcoded wobei die ip die sollten wir eigentlich bei login IP soll man ich bei login übergeben ok so weil jetzt kann ich nämlich sagen api login ip user passworten das kann man sich dann auch per kommando zeile ordentlich einlesen das sieht schon mal deutlich besser aus so jetzt bekomme ich das jetzt zurück wenn ich mich einlogge so private jup user brauchen wir nicht mehr passwort auch nicht mehr string die ip brauche eigentlich nur und dass token brauchen wir ansonsten eigentlich nix spektra die nehmen wir auch gleich die ist richtig pock mit der habe ich schon ein paar sachen gemacht die ist richtig gut da können wir da auch tabellen und spinner und so machen auf der spektra konsole ist richtig nice sowohl das die ip als auch das highlight für farbe und was das ist richtig nice das werden wir auch gleich verwenden ja ok wenn das ding wenn das ding exceptions mir das ist übrigens der grund warum ich das in eine mit static method zum klasse erstellen angelegt habe und nicht in dem konstruktor weil man sagt ja so aus pauschal man sollte in einem konstruktor keine exceptions vorkommen lassen ja und hier kann es natürlich jede menge exceptions geben also von von ding ist nicht erreichbar auf der ip bis return code stimmt nicht oder sonst was jetzt haben wir das hier drin stehen da brauchen wir als nächstes haben wir eine publik publik static async task i read only list jetzt aber hier so was von objekt oriented objekte orientiert mehr geht nicht nicht static was mache ich denn da also vielleicht soll ich das ding auch mal irgendwie nennen list user heißt das jetzt so list user list user funktioniert folgendermaßen und zwar so monkel ist ap lists user awaits so funktioniert list user plus ein bisschen schöner gemacht noch es ist underscore ip so das sieht auch jetzt schon ein bisschen schöner aus und jetzt ist das hier die user da machen wir eine liste list new list mit den usern und sagen ihm hier list add den user so so richtig schreibt und dann hier unten return list das kann man natürlich alles noch schöner machen weil das ist jetzt ein riesenlanger blob in in sowas hier drinnen aber das soll es jetzt erstmal tun beispielsweise das xml parsen das das würde ich das würde ich später das würde ich später noch auslagern ich meine ich mache hier immer das gleiche ich könnte sowas sagen wie keine ahnung get xml element und dann sowas wasser dankeschön für den zapp das sollte es aber erst mal so tun damit kann ich leben das ist jetzt natürlich in der handhabung deutlich deutlich schöner weil jetzt kann ich einfach so was hier machen user gleich achso tja ist halt blöd dass wir sehen das login user log in password so wenn da wenn ich jetzt alles richtig gemacht habe lässt es sich jetzt deutlich schöner handeln und hallo for each please als makro for each user in users user schauen wir mal müsste das gleiche rauskommen jetzt hey kommt das gleiche raus ok nice und jetzt war man da richtig poggers fai fertige konsolen ausgabe nämlich spektra console das ding ist wirklich nice also hatte auch gerade im chat einer geschrieben damit kann man wunderbares cli auf der auf der konsole machen ja command line interface und colors und gedöns das ist wirklich cool das ist ein bisschen wie ich habe das python gegenstück vergessen das gibt es quasi in nahezu jeder programmiersprache gibt es irgendwie so paar coole konsole anwendung libraries und für sie scharf ist es halt spektra konsole spektra konsole gut und jetzt können wir nämlich so was hier sagen anstatt das hier einfach nur so eklig zu printen können wir jetzt sagen table jetzt haltet euch mal fest was das ding für nice sachen auf der konsole machen kann table add column so wir wollen ausgeben user jetzt wird jetzt wird es auch optisch nicht schlecht user wollen wir ausgeben dann wollen wir noch haben wir denn hier mac passphrase wlan in welchem wlan die sind dann welche meck die haben und am ende welches passwort die haben weiß jemand was in iot so die gängigen sprache sind ja leider c++ also im hand im handelsübli so im heimbereich ist es viel arduino kompatibles zeug von esp 2866 bis esp 32 und das ist leider leider ausschließlich c hauptsächlich c++ was halt ziemlich sagt aber man kommt halt nicht drumherum so cable cable add row user bem also zuerst der user name dann user wlan dann user meck dann user passphrase so und jetzt table render nie vergessen cable kein schimmer cable ach so einfach so ok cable so und jetzt passt mal auf wie wie nice das auf der konsole jetzt aussieht bem ist das nicht eine huge feif händige optisch ansprechende ausgabe von den usern auf der kommando zeile das doch richtig nice oder richtig porc guck mal hier bem zack es war mal also am besten wäre es natürlich wenn man so was ausführen könnte später dann irgendwie was weiß ich irgendwie so list user oder sowas ja kommen die franzosen sogar an und jetzt können wir noch sagen table expand expand und jetzt ist die tabelle auch gleich guckt mal ist die tabelle auch gleich über den ganzen bildschirm massive das ist doch das war schon mal deutlich besser als übers web interface so gedönst zu machen das gefällt mir jetzt schon mal sehr gut dort haben wir rausbekommen also erste hürde ist genommen wir haben rausbekommen wie man user abruft die nächste hürde ist wie kann man user anlegen nach namen sortieren moment stand da expire irgendwo drin stand da irgendwo drin waren die expire ich muss mir mal kurz das xml muss nur mal kurz das xml ausgeben hier oder created kann man da drin stehen meck last next ist das hier quasi created macht er erzeugte daraus created das ist auch garantiert in den unix timestamp unix time alter was das für eine 15 der fünfte gestern 1535 ja ok das ist das brauchen wir noch da kann man das nämlich nach endungsdatum nach modified datum machen last rekey das brauchen wir unbedingt das ist das ist prog was bei dir hat sich jemand neulich beschwert das cli voll veraltet ist ja das sind die ganzen kacknubs die keine ahnung das sind auch die leute die unter windows dann so klicken wenn du denen sagst so nach dem motto machen wir den explorer auf und werft den usb stick aus so dann machen die leute so auswerfen das sind die gleichen leute die sagen dass die lei veraltet ist die zehn minuten die zehn minuten brauchen sowas sowas zu machen ja anstatt spam bam bam auswerfen gut ist das ging mir ein bisschen schnell ja das ist schon das ist grenzwertig gewesen ja modifia et oder ab dated et oder das so date time jetzt müssen wir den plus sagen dass der updated f last rekey und jetzt wie ging das noch mal unix time zu einem date time das war neu das geht noch nicht so lang sie schabt und unix unix time to date time das ist noch nicht so lange her dass sie dafür was geedet haben das ist müll was die hier schreiben das ist nicht mehr aktuell das da genau date time offset from unix time seconds kämpel offset from unix time seconds moment jetzt muss ich es noch als in passen jetzt wird es jetzt wird es abartig a long pass habe ich glück wenn sie nicht knallt dates und wie mache ich das jetzt zu einem date time tix utc date time local date time ja das ist gut so jetzt schauen wir mal ob das an sich funktioniert programm modified ist wahrscheinlich sogar ganz sinnvoll updated wenn man das als erstes macht user updated ach nee ach jetzt muss ich noch formatieren to string hätte ich auch das hätte ich gleich machen können an der stelle wie willst du etwas sagen man versteht hier nicht auf den ersten blick was da passiert ich finde ich finde es äußerst beruhigend also umso mehr die idee orange unter kringelt umso sicherer ist das ganze umso mehr ist das überprüft umso öfters ist das schon quasi während der entwicklungszeit überprüft kann ich nichts mehr schief gehen so short date ist ok das ist das ist kokona kokona schreib format das will ich haben das will ich haben ohne zz also in dem moment ich will ich will den tag ja noch dabei haben dd oder was ist das ja so war es im endeffekt Äh, äh, was? Ja, schon besser. Also ich will dd, ja genau, dd.mm.jaja, genau. Oder will ich vielleicht so? Ne, will ich nicht. Ja, das sieht, nein. Chat, das stimmt nicht, was ihr geschrieben habt. So, ich, ich, ich trau, ich, ich glaube euch das jetzt einfach. Nein, nein, fast, aber y, y ist richtig. So, so. Aha. So und jetzt Moment, wir wollen Monat, Monat, wir wollen das haben und das doppelt. Beistelle ich immer. So will ich das haben. 15.05.2092, 15.35. So ist das nice. Und jetzt sorten wir das danach. Und zwar. Users. Order by user. Updated ad. Manchmal macht die aus mit Autokomplete komisches Zeug. So und jetzt haben wir das Ganze aufsteigend sortiert. Kann man den Zeilenabstand vergrößern? Ja, du kannst das ziemlich genau konfigurieren. Aber wollen wir den Zeilenabstand vergrößern? Also du kannst relativ viele machen bei dem Kram hier. Weiß ich aber aus dem Kopf nicht, wie man das macht. Du kannst den Border ändern, kannst das Alignment ändern, den Titel, die Breite. Man kann bestimmt auch irgendwie noch extra Zeilen einfügen. Nee, den Zeilenabstand nicht. Du kannst extra Zeile anmachen, weil die Zeilenhöhe ist ja fix in deinem Terminal. Da kannst du nichts ändern. Aber du kannst die. Du kannst extra Zeilen rein machen. Du kannst so viele Gedöns hier einstellen, wüsste ich noch nicht mal, wie das überhaupt genau funktioniert. Aber so ehrlich gesagt reicht es mir so erstmal. Aber das ist doch sehr schick jetzt, oder? Und wie schnell das geht, besser als besser als mit einem ferngesteuerten Chrome ist es auf jeden Fall. Das war ja meine erste Idee. Wir könnten Chrome fernsteuern, anstatt das so zu machen. So ist das viel, viel besser. Damit kann man jetzt richtig was anfangen. Damit kann man tatsächlich... Jetzt müssen wir noch User anlegen. Das wird auch nochmal lustig. Also, jetzt kann man sich User anzeigen lassen und man kann User bald updaten, beziehungsweise User anlegen. Also sprich, wenn irgendjemand Sixheadiges kommt und sein Passwort vergisst und wisst ihr, was das Coole ist? Dadurch, dass wir jetzt hier das über Kommandozeile laufen haben, kann ich das dann auch direkt in Labelchamp pippen und ein Etikett drucken lassen mit der Zugangs... mit dem Zugang. Also sprich, theoretisch mal angenommen, es wird jemand zu Besuch. Dann gehe ich hier hin, tippe dann ein, was weiß ich hier, add, gebe den Usernamen ein, kegw-user und dann kann ich irgendwie noch sagen Output als PNG oder als QR-Code und das wird dann in den Labelchamp gepiped und der Labelchamp druckt es dann aus. Bei Chico alles fit? Ja, die liegt irgendwo im Hof draußen gerade und rollt sich da rum. Die Mac ist ja noch nicht ganz sauber, doch die Mac stimmt. Wenn keine Mac drinnen steht, heißt das nur, dass einmalig sich jede Mac Adresse anmelden kann und es erst dann gelockt wird. Also wenn Mac leer ist, heißt das, es hat sich einfach noch nie jemand mit diesem User angemeldet, was richtig ist, weil das hat sich noch keiner mit dem User angemeldet. Ich werde das jetzt auch nicht einschalten, das WLAN, weil ich habe schon alles geleakt von Passwörtern bis sonst was, also ich werde jetzt hier nichts einschalten. Ne, ne, das ist Access-Point-spezifisch, also die machen das so. Du kannst User anlegen im Access-Point und du kannst Mac-Adressen vergeben, dann kann nur dieses Gerät mit diesem Passwort und dieser Mac rein. Du kannst aber auch die Mac leer lassen, dann musst du das WLAN-Passwort eingeben und beim ersten Mal einloggen, merkt er sich dann die Mac dazu. Kann man noch eine Last-Logon-Zeile oder sowas hinzufügen? Ne, das haben die in der API nicht drin stehen. Guckt, wir können nur, wir können nur das machen, was die, also es sei dann, man kriegt das über das Web-Interface irgendwie raus. Also wir können bloß ID, Rollen-ID, Mac, WLAN-Name, WLAN-ID angelegt, Expire, die IP könnten wir noch uns auslesen für eingeloggte Geräte aktuell. Ja, mehr kriegen wir nicht raus. Aber die IP ist tatsächlich gar nicht so schlecht. Die IP sollten wir uns, das schreibe ich mal zumindest als To-Do noch auf. Irgendwo hier unten, wo ich das andere To-Do hin hab. Das war ja einfach nur just for fun, keck weh. Aber IP ausgeben für eingeloggte Devices. Das ist nicht verkehrt. Das könnte man tatsächlich machen an der Stelle, weil wenn es die API hergibt, warum nicht? So, jetzt legen wir User an. Da bin ich mal gespannt. Alles wieder dicht machen. User anlegen. Ok, also Leute, User anlegen ist ziemlich eklig. Wenn ihr User anlegen wollt, könnt ihr nicht einfach sagen add user. Ihr müsst eine CSV-Datei hochladen, die so aussieht. Und in dieser CSV-Datei kann man dann sagen, wie der User heißen soll, keck weh User. Und welche MAC-Adresse der hat. Wenn man die MAC-Adresse leer lässt, dann ist es halt einfach nur ein User, der sich einloggen kann mit dem Passwort ohne bestimmtem Gerät. Bis zum ersten Mal. Und das heißt, wir müssen jetzt eine CSV-Generate haben. Aber was nicht schlimm ist, weil unsere CSV wird so aussehen. Also unsere CSV heißt keck weh User, das ist unsere CSV. Wer braucht die nicht? CSV, XML. Stimmt, die haben wirklich jeden Bullshit drin, oder? Was fehlt noch, Leute? XML, CSV, JSP, Java Server Pages. Was gibt es noch für Bullshit, den wir vielleicht noch finden drin? Ok, wir müssen jetzt uns das Ganze aber mal in Ruhe anschauen. Und zwar, also, wenn man jetzt hier User hochlädt, Browse, Downloads, Batch DPSK-Example. So, dann macht er diese zwei Requests. Requests? Dock MD System Check Memory? Ah, das ist bevor er an Upload startet, ob er genug Speicherplatz hat. Ich denke mal, das ist ok. Und danach gibt es ein Upload. Upload. Requests. Ah, das ist jetzt eine Form, Form Encoded. PDF, na PDF ist ja kein Shit. Also, wohin geht denn der Request? Hier. Ok, boah, boah Leute, das wird, das wird ja abfuckt. Also, Create User, Create User machen wir jetzt. Public, Void, Create User. String, Name. Rest können wir dann machen. Also, da wollen wir hin. Das bedeutet, wir müssen einen Post machen. So, wenn wir gerade mal wieder kopieren. Create User. Äh, wir machen hier gerade mal an der Stelle Return. RP Create User. So, und wir legen jetzt den User Cute Chat an. Task. Ok, wie füllen wir das Ganze? Also, wir brauchen einen Postrequest dahin. IP ist richtig. Admin, Upload, Request, XHR. Ja, das sollten wir recht sein. So, dahin machen wir den Postrequest. Mit dem Header auf jeden Fall dran. Brauchen wir sonst noch irgendwelche Header, Request oder was. Content. Ah, das glaube ich nicht so wild. Hier. Alles klar. Ähm. Stopp, dass Admin in der UL fehlt. Oh, ihr habt recht. Tatsächlich, Pog. So, with Header, Post Async. Ok, Moment. Ich brauche keinen Post. Ich will einen Form. Kann das ein Formupload machen? Wie macht man einen Formupload? Leute, da bin ich überfragt. Form. Post Form. Form Post. Ah, da gibt es Form Post. Guck mal, da gibt es doch schon. Post World Encoded Async. Alles klar. Das ist doch mal was. Wenn diese Seiten ordentliche Hilfe Pages haben, dann weiß man, da weiß man ja nichts, was man macht. Ok, Post World Encoded Data. Was poste ich denn da jetzt eigentlich? Genau. Doc is King. Genau. Request. Ja, die XML poste ich doch. Theoretisch muss ich nur die XML posten. Content Type muss ich noch setzen. Nee, der Content Type ist der in der Form Data mit drinne. Oh, jetzt bin ich aber. Boah, kein Schimmer. Hoffen wir mal, dass das funktioniert. Ich bin jetzt etwas ratlos. Wie man das jetzt postet. Form Data. Request. Ach nein, das muss ich machen. Multipart Form Data, oder? Request. Multipart Form Data muss ich machen. Post Multipart Async. Ok, jetzt wird es aber noch Sixheadiger. Was? Multipart. Ich mach das mal wie bei denen, das in der Hilfe drin steht. Also. Post. Warum ist das nicht erlaubt zu awaiten? Ah, weil ich das Ding nicht Async genannt hab. Ach so. Na dann. Ok, der was? Deswegen kommentieren wir den ganzen Shit jetzt mal aus. Gucken, ob es tut. Also. Await API Create User. Gut. Post Multipart. Add String. Ah, das sind jetzt die Files, oder? Also sprich Request. Name. File Name. Ok, die zwei Sachen braucht man. Name. Name Action. Boah. Was ist das denn? Wie funkt? Ok, das krieg ich nicht so einfach nachgebaut. Also, nur. Also wie geht das jetzt? Add. Ok, Add String Content. So. Dort poste ich jetzt meine CSV rein. Also meine CSV wird ja im Endeffekt ganz einfach so aussehen. Name. Komma. Fertig. Das ist meine ganze CSV. Also meine CSV. Kein Encoding extra setzen. Aber Media Type will ich haben. Text CSV. Boah, das ist ja best auf Bullshit Dateiformate, was die hier machen. Name. Name. Oh Gott, ich check das nicht. Was seh ich denn hier überhaupt? Und was geht? Ich versuch meinen Access Point über die nicht offizielle API zu steuern. Gerade User anlegen. Alter, fuck man. Ich hab keine Ahnung, ob das so funktioniert. Wo würde ich denn jetzt Filename noch angeben? Wo würde ich denn jetzt hier das Filename angeben? Ich meine, ich würde jetzt davon ausgehen, dass da jetzt so was rauskommt wie, wir lassen es mit Filename einfach mal weg. Content Typ. So. Das ist der Content. So und jetzt brauch ich noch was anderes. Jetzt brauch ich noch was mit dem Add String. Aber ein Add File. Aha. Ich bin extrem verwirrt. Ich hab keine Ahnung, wie das funktioniert. Was das für ein Access Point ist. So einer hier. So einer. Ich hab keine Ahnung, was ich hier mache. Also wir probieren es jetzt einfach mal. Es wäre cool, wenn das Ding irgendwie eine ordentliche Debug Ausgabe hätte, weil ich kann halt nicht mitschneiden, wie hart der DPS ist. Okay, Add. So wir brauchen auf jeden Fall noch ein Action Name Action. Das ist einfach nur ein String. Add String Name Action. Und das ist jetzt Upload Batch DPSK. Und noch mal Add Callback. DPSK. So. Jetzt bin ich ja mal gespannt, ob das jetzt String. Jetzt bin ich ja mal gespannt, ob er das jetzt macht. Kostet das wirklich 1000 Euro? Ja, wenn du es neu kaufst, was ich nicht machen würde, weil der 710 ist die Vorgänger Generation. Also aktuell ist er 750. Der R750 ist Wi-Fi 6 und der hier ist Wi-Fi 5. Und das reicht der dicke. Und kriegst du, also ich hab ihn für 260, 270 Euro bei eBay gekriegt. So. Okay, Leute, ich hab keine Ahnung, ob das funktioniert. Ich führe das jetzt einfach aus. An error while sending the request. Ja, das ist jetzt busy nicht sagen, oder? Error while sending request. Das kann ja alles bedeuten. Busy, vielleicht in busy sinnvolleren Hilfe Exception Text. Irgendwas aussagekräftigeres? Ich würde das gerne. Kann man das irgendwie debacken? Was der jetzt eigentlich genau schickt? Before call, after call. Okay, das scheint äußerst sixheadig wieder zu sein. Ich würde halt gerne sehen, was ich, was ich poste. Schau doch noch mal eins drunter in die Docs. Cookies. Cookies macht er ja anscheinend automatisch. Ich will keinen Error Handling haben. Ich will einfach den Request, wie er ihn schickt, loggen. Before call, after call. Wire Shark geht nichts. Das ist HTTPS. Ich meine, ich könnte nette, hätte aufmachen, mir dahin schicken lassen. Quatsch, mach ich. Nein, nein, nein, ich könnte, ich könnte mir einfach nette aufmachen. So hier. Es bringt mir doch nichts, man wire. Shark HTTPS kann Bojashark kann nur, wenn das Zertifikat, also wenn ich irgendeinen Proxy hätte. So, Fort 8000, ich mach, ich schick mir das einfach an meinen eigenen, an die, meine eigene IP. 127.0.0.1 Fort 8000 Was hab ich jetzt gemacht? Was hab ich jetzt kaputt gemacht? Ach so. Ach so, weil HTTPS, lull, HTTPS. Aha, Leute, da haben wir es doch. Also. Das sieht doch von der Idee her gar nicht mal so falsch aus. Also so müsste es aussehen. So müsste es aussehen. Also die Nummer ist egal. So, das hier geht hier los im Endeffekt. Text, CSV. Das ist gut. Form, Data, Name, U. Ok. Das ist schon mal das Problem. Das müsste sein Filename gleich. Das ist eigentlich hauptsächlich der Unterschied, den ich jetzt sehe. Der Rest ist doch in Ordnung, oder? Chat, der Rest sieht wirklich ziemlich, ziemlich gut aus. Das ist richtig. Upload, Upload, Upload. Das ist richtig. Uploader, blablabla. Callback, Action. Es fehlt nur beim CSV. Ja, beim CSV fehlt der Filename. Da müssen wir uns mal überlegen, wie wir das hinbekommen. Wie kriegen wir da ein File? Also String Content ist es schon mal nett. Also ist es wahrscheinlich Add File oder Add String Parts? Ja, Moment, ich habe das als String. Ich will ja nicht wirklich ein File senden. Wie random String? Was? Das ist random hier, ja. Das ist ok. Das darf immer anders sein. Also wie kriege ich denn jetzt hier? Filename. String, Value, String Content Type. Add. Muss ich hier File Content machen? Vielleicht Add File Content? Sowas hier? Ja, der Path, das will ich ja nicht. Ok, HTTP, Client, Filename, Post. How to send File? Ja, zeige hier. Media. Das ist ja bescheuert. Multipart Form Content. Multipart Form. Multipart Form Data Content? Ok, was ist das? Ok, was zum? Hä? Alter, das ist ja High IQ Shit, Mann. Nee, das ist was anderes. Ich meine, ich will doch jetzt kein File schreiben, nur dass ich ein File da... Ich meine, ok, wir können ja den String zu einem Stream machen und dann String, Stream, nee. Wie geht das? String, String, nee, String Reader? So, ging das, ne? Jetzt wird es aber kompliziert. Äh, ja, da kann man nämlich so tun, als wäre das ein File, CSV, so. Was habe ich jetzt verkehrt gemacht? Ah, Using, wow. String Reader. Jetzt sagen wir nämlich Add File, Name you, Name u. Ok, also String, Path, Stream, SR. File, Name, jetzt können wir den File, Name nämlich mitgeben. So, File, Name ist in dem Fall Badge. Ich nenne es einfach mal so, irgendwas mit Punkt CSV, vielleicht checkt er nämlich am Ende auch die Endung. Man weiß ja nie. So, das ist der File, Name. String, Content, Type, Text, CSV. So, Buffer Size brauchen wir nicht. So, warum geht das jetzt nicht? Was ist das Problem? Ist das kein Stream oder was? Nein. C Sharp, String, S, Stream. Weißt du, das brauchen wir normalerweise nicht. Memory Stream. Gott, Memory Stream. Auch gut. Ah, Memory Stream. Und was jetzt? Wie kriegt man da jetzt den String rein, ohne irgendwie sich das Bein auszurenken? Encoding, UTF, Get, Bytes. Alles klar. So, CSV, Stream. So, gut. Jetzt kann man das Post mal gucken, was jetzt dabei rauskommt. Tommy, was? Wie? Verstehe ich? Jetzt verstehe ich es gerade nicht. Jetzt kommt gar nichts an. Error while copying content to stream? Was? Wie jetzt? Das ist... Wo ist denn das Problem? Das Using muss weg. Warum? Der soll den danach doch wieder aufräumen. Tatsächlich. Hä? Was macht denn das Using jetzt da? Warum? Warum macht das Probleme? Verstehe ich nicht. Also, das bekommen wir da jetzt als Antwort. Alles klar. Guck mal, Filename. Das sieht besser aus jetzt. Warum hat er hier Filename-Sternchen? Was ist das jetzt für ein Müll? Wo kommt denn das jetzt her? Warum? Nee, das Using sollte das eigentlich nicht sofort schließen. Das Using sollte das schließen am Ende des Blocks, wenn er nimmer gebraucht wird. Das ist ja der Unterschied, wenn du es so schreibst, zu der alten Schreibweise mit den Klammern. Egal. Was auch immer. Das sieht doch jetzt eigentlich alles gut aus. Warum hat er denn jetzt Filename-Sternchen UTF-8 noch mal da hinten dran stehen? Das ist das Encoding. Das Encoding will er aus irgendwelchen Gründen unbedingt da drin haben. Schauen wir mal, ob es funktioniert. Wir gucken einfach mal, ob es funktioniert jetzt. IP. Run. Please. Oh, das sieht gut aus. Es ist nicht abgekackt. Was ist das eigentlich für eine Response? Was ist das für eine Response schon wieder? Ach, Moment. Ich kack Noob. Ich muss HTTPS machen. Ah, ich mache es falsch, Leute. Ich mache irgendwas falsch. Was mache ich falsch? Okay, nochmal. Wir gucken uns das hier nochmal an. Nein, nervt mich jetzt nicht. Nein, ich will kein Admin Recoveren. Okay. Services. Upload. Example. Ja, so. Cookies. Ja, die Session setzt er ja hoffentlich von alleine, weil die anderen gehen ja auch so. Guck, der setzt überall das Cookie und das macht mein Client auch. Sonst könnte ich das ja gar nicht benutzen. Request. Hedder. Hab ich irgendwas vergessen? Request, Hedder. Wenn ihr Ideen habt, nur her. Also das Cookie setze ich ja auch das Cookie. Mist, ich dachte, ich hätte das Cookie vergessen. Dann wäre das ja relativ einfach gewesen. So, die Url stimmt auch. Es ist ein Post. So. Admin. Slash. Upload. Jsp. Äh, Moment. Ach, das ist, ähm. Soll ich das mal wegmachen? Was hat denn passiert? Ähm. So. Also das mit dem Accept und so wird, denke ich, keinen Einfluss haben. Content Length. Multipart Form Data. Das ist genau das, was meiner auch schickt. Multipart Form Data Boundary. Das ist überhaupt kein Unterschied. Soll ich mal das Uploaden? Soll ich mal Uploaden das, was ich hier auch Uploade? Also quasi, äh, Downloads und dann, äh, Batch. Das, das da? Was Upload, was Upload ich hier eigentlich immer? Ich Uploade das gleich immer. Was der Raspberry Pi tut? Was? Hä? Moment. Was, was? Was hab ich denn und was will er denn? So. Muss jetzt Fivehead Proggers Kram hier machen. Komm, wir haben immer mehr User. Der hat das ja mit dem Anlegen schon gecheckt anscheinend. Keine Ahnung. Nee, jetzt, jetzt kann ich nicht. So. Also. Guckt mal. Warum geht das nicht? Check das net. Also. Ok. Welche Datei lade ich denn, lade ich denn hier immer hoch? Sample 1. Genau das lade ich da jetzt auch hoch. Das da. Genau das da. Also. Stream, wir geben jetzt tatsächlich die Datei direkt an. Also. String, Pass, Home, Home, Max, Downloads. So. Was ist jetzt? Was hat er für Schmerzen? Hab ich doch genau richtig gemacht. Pass. Content Type. Ach, Buffer Size. Pass. Content Type muss dann da hin. Das ist natürlich, haben sie sich jetzt super, super fiveheadig überlegt. Content Type. Buffer Size. Ah, jetzt brauch ich Buffer Size. Meinetwegen. Ok. Alles klar. Alles klar. Dann machen wir nochmal Netcat auf und schauen, ob das funktioniert. Aber lokal. Das, das, das ist eklig jetzt. Weil es könnte sein, dass er sich an alle möglichen stört, weil die sich, die müssen sich ja, wenn sie ihr eigenes Frontend und ihr eigenes Backend passen. Ach so. Ja, doch. Das sollte man vielleicht schon. Ja, ist recht. Sollte man machen. Ach, das kann man doch weglassen hier, oder? Das kann man weglassen, weil das wahrscheinlich selbst einfügt, wenn du außer Datei öffnest. So. Also, schauen wir mal. Was? Ah ne, es ist ja nicht Port. Es ist Port 8000. 8000. Was? Was macht der denn da jetzt? Ich, ich blick nicht mal durch. Was ist denn jetzt wieder da? Warum sind da jetzt so komische, so komische Leerzeichen und Gedüllens dabei, ey man? Wegen dem Encoding vielleicht? Nicht. Kann man Encoding setzen? Nein, kann man nicht. Nee, das ist nicht HTTPS. Teilname. Das sieht nicht, nicht richtig aus. Warum hat der denn jetzt da so komische, so komische Dinger drum herum? Die hat er doch vorher auch nicht gehabt. Guck, vorher sah das noch gut aus. Alter, ich hasse diesen Krempel, ey. Das ist der Wahnsinn. Oh man, egal. Wir testen jetzt einfach, ob es funktioniert. Vielleicht geht es jetzt ja auf magische Art und Weise. Ach so, welches Encoding hat denn dieser Krempel hier? Vielleicht liegt es ja daran. Äh, wie kriege ich denn das raus? Stats? Port noch weg. Äh, wie kriege ich denn das File Encoding raus? How can I find Encoding? File minus E. Aha, aha. Es ist nicht UTF-8, aber das ist egal, weil US ASCII ist kompatibel mit UTF-8. Es ist bestimmt irgendein ekliches Encoding-Problem, ich sag's euch. Äh, ach HTTPS, fuck man. Boah, oh kreise. Ist irgendwas an der URL falsch, oder? Ich meine, ich mach Login und danach führ ich das aus. Also es ist ja nicht so, als würde ich in dem anderen mehr machen. Da ruf ich dann auch fertige Sachen auf, die Login brauchen. Tja, jetzt bin ich echt ein wenig überfragt, warum der Request sogar schon, warum der endet, prematurely endet. War ich irgendwas falsch? Okay, wir machen jetzt mal eine Sache, wir machen das mal weg. Header, sagen einfach get und einfach ganz normal ein get. Mal gucken, was passiert, wenn ich ein get mache. Äh. Hä? Warum ist die Methode überhaupt da? Internal Server Error. Gut, also das geht schonmal nicht. Post. Einfach leerer Post machen. 500. Internal Server. Gut, das ist doch schonmal, dass das vom Prinzip her gar nicht funktioniert, bis ich anfange. Bis ich prinzipiell das Richtige mache. Also kann man das im Prinzip wieder so lassen. Stream. Der hat keinen Platz mehr zu speichern. Doch, klar, da Platz zu speichern. Hab ich irgendwas übersehen? Werft er den Fehler, weil der User schon existiert? Nee, das glaube ich nicht. Der hat den User ja noch gar nicht, der hat den User ja noch gar nicht angelegt. Was, jetzt will er noch File name? Ah ja. Äh. Batch. Content-Type-Text-CSV. Ja, das ist gut so. Test-Port. 7.0.0.1. 1.8.000. Test-Port. So, jetzt gucken wir noch mal. Wir vergleichen den Kram jetzt noch mal. Ich bin jetzt nämlich echt ratlos, was der für Schmerzen hat. Ach, es ist immer noch HTTPS. Okay. Aber einfach, weiß ich nicht. Real. Weiß ich nicht. Es ist nur, dass ich es einfach austauschen kann. Ist nämlich HTTPS IP. Gut. Also. Dann wollen wir mal. Gut. Also. Das ist alles gut, was der hier macht. Ab hier geht es los. Das ist alles richtig. Post dahin. Guckt es euch an. Post. Was macht der denn da eigentlich vorher? Request. Vorher guckt er irgendwie, ob er noch genug Speicher hat oder sowas. Keine Ahnung. Das muss ich, das muss ich wahrscheinlich nicht machen. Das wäre ziemlich beknackt. So. Upload. Cookies. Ist das ist gesetzt. Filename. Ja, das ist. Es geht auf diese Uhr. Dann. Dann. Ja, das mit dem Filename ist anders. Das ist gut. Der Rest ist der Rest ist auch richtig. Content. Length. Er sagt Content Type Text CSV. Ich meine, hier hat das gequotet. Hier nicht. Aber ich gehe mal davon aus, dass das standardtechnisch alles okay ist, wenn das nicht gequotet ist. Und da hat er irgendwie so einen komischen Scheiß hier drinnen mit Filename Sternchen UTF 8. Das Check der Server bestimmt nicht hier. Wie kriege ich ihm das? Wie kriege ich ihm das abgewöhnt? Et. Kann man nicht einfach sagen, dass das von Hand etten String Parts oder so? Muss man das? Muss man das url encoden? Aber das sollte eigentlich auch für mich machen. Also et et file hängt irgendwie so ganz ekliges Zeug hier hinten dran an, was ich, was ich nicht haben will. Nee, da braucht keine Hedderow. Brauche nicht. Wisst ihr was? Wir machen mal. Können wir das mit einem Curl machen? Nein, da habe ich keine. Nee, brauche ich nicht. Guck mal, ich kann es euch zeigen, dass das prinzipiell funktioniert. Wir gehen jetzt mal in nach Downloads. Vim. Batch. Das da nehme ich glaube ich immer. Batch Sample. Das da. Guck mal. Ich nehme jetzt mal nur die Datei und versuche die hochzuladen. Ja, muss ich nochmal refreshen. Und das ist auch nervig mit diesem bitte, bitte lock dich mal als Admin ein und mach Password Recovery an und so. Ich will keine Password Recovery. Ich setze mein Access Point einfach zurück. So. Also Sample. Wisst ihr? Funst. Upload. Keqv-User. Bam. Der macht aber halt immer aus irgendwelchen Gründen da noch ein U-Line unten dran. Meiner nicht. Nicht, dass man das bräuchte. Und Content-Type Text und so ist vertauscht, aber ok. Der Rest ist ja alles gut. Ich meine, soll ich auch mal ein U-Line unten dran machen? Vielleicht kann man das einfach hier dran machen. Dann geht's. Ja, jetzt haben wir da auch ein U-Line dran. Http 1.1. Was ist das? Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Http Version steht nicht dabei. Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content Content", "segments": [{"id": 1, "start": 60.0, "end": 89.96, "text": "Fockchamp, moin, djsw77, und der Enrixl ist auch am Start, Massive, macht ihr um"}, {"id": 2, "start": 89.96, "end": 97.48, "text": "die Uhrzeit alle hier. Es ist 12.40 Uhr, müsste ich hier arbeiten? Ich muss nicht arbeiten,"}, {"id": 3, "start": 97.48, "end": 100.2, "text": "ich muss morgen wieder arbeiten, muss ich nach Frankfurt fahren, hab ich gar keinen Bock drauf."}, {"id": 4, "start": 100.2, "end": 106.08, "text": "Ach du hast auch am Montag Freitag, das ist natürlich 5-Hetter-Time. 6-Hetter,"}, {"id": 5, "start": 106.08, "end": 116.72, "text": "7, 8, 9, 10-Hetter ist das. Selbstständig, ja da würde ich auch noch den ganzen Tag stehen,"}, {"id": 6, "start": 116.72, "end": 126.12, "text": "wobei ich bin selbstständig zur Hälfte. Das Team wird heute wahrscheinlich ein bisschen länger"}, {"id": 7, "start": 126.12, "end": 129.84, "text": "dauern, mal gucken, ob ich das alles raus bekomme. Ich habe im Vorfeld schon ein bisschen geguckt,"}, {"id": 8, "start": 129.84, "end": 135.64, "text": "aber... Übrigens, wollte mal kecken, Microsoft hat mir gerade folgende Werbung geschaltet auf"}, {"id": 9, "start": 135.64, "end": 146.64, "text": "Twitter. Passt mal auf. Das habe ich gerade als Werbung bekommen auf Twitter. Microsoft möchte"}, {"id": 10, "start": 146.64, "end": 151.56, "text": "mir erklären, welche Riesingen es hat, wenn man sich Microsoft-Lizenzkeys irgendwo kauft,"}, {"id": 11, "start": 151.56, "end": 159.72, "text": "und den Hashtag finde ich geil. Bleibe echt. Was soll mir das denn sagen? Bleibe echt. Das"}, {"id": 12, "start": 159.72, "end": 165.88, "text": "ist irgendwie so schlecht ins Deutsch übersetzt, der Hashtag, Alter. Bleibe echt. Das ist mal richtig"}, {"id": 13, "start": 165.88, "end": 173.76, "text": "schlecht. Bleibe echt Talk. Das ist der Bleibech Talk Nummer 3. Den kann man sich sogar anschauen,"}, {"id": 14, "start": 173.76, "end": 178.36, "text": "wenn man will. Den wollen wir uns jetzt nicht anschauen. Aber Microsoft... Guck mal,"}, {"id": 15, "start": 178.36, "end": 185.0, "text": "mal sehen, ob der Link funktioniert. Oder ist mein Internet am abkacken? Ne. Der Microsoft-Link"}, {"id": 16, "start": 185.0, "end": 197.6, "text": "funktioniert nicht. Keck-WHD. Tja. Vor allem die Antworten da drauf auch wieder. By the way,"}, {"id": 17, "start": 197.6, "end": 204.6, "text": "es ist ja echt, ne? Also du kannst ohne Probleme einen echten Key kaufen für 20 Euro. Wenn der"}, {"id": 18, "start": 204.6, "end": 214.28, "text": "nicht echt wäre, würde Microsoft den Gramm ja gar nicht aktivieren. Ja, ich erinnere mich"}, {"id": 19, "start": 214.28, "end": 219.36, "text": "auch daran. Natürlich würde ich das auch... Damals hätte ich auch gesagt, sind Sie Opfer"}, {"id": 20, "start": 219.36, "end": 224.76, "text": "einer Softwarefelder? Ja, klar, das muss gefälscht gewesen sein. Ich wusste vor nichts. Aber wie gesagt,"}, {"id": 21, "start": 224.76, "end": 230.68, "text": "die letzten Jahre, ich kaufe eigentlich mittlerweile wirklich alles, nachdem man auch Streaming,"}, {"id": 22, "start": 230.68, "end": 237.0, "text": "Videos, Musik und sonstige Sachen heute halbwegs erschwinglich bekommt. Kein Ding. Einziges, wo"}, {"id": 23, "start": 237.0, "end": 241.16, "text": "ich ab und zu mal auf irgendwelche Streaming-Seiten gucke, ist, wenn es das nicht gibt. Weil das sehe"}, {"id": 24, "start": 241.16, "end": 246.76, "text": "ich nicht ein. Aber das sind dann meist irgendwelche Nischen-Dinger, die keinen interessieren. Oh,"}, {"id": 25, "start": 246.76, "end": 251.96, "text": "das ist Dings. Ich habe heute eine neue Playlist angemacht. Erkennt ihr das? Wobei man hört kaum"}, {"id": 26, "start": 251.96, "end": 261.16, "text": "was. Ich muss mal kurz ein bisschen lauter machen. Erkennt das hier, Mann? Ich erkenne das sofort."}, {"id": 27, "start": 261.16, "end": 275.24, "text": "Das ist Terranigma, muss das sein, wenn ich nicht ganz falsch liege. Ja, richtig Proc G-Game."}, {"id": 28, "start": 275.24, "end": 289.24, "text": "Ich war zu jung für das Game damals. Ich habe es nicht gecheckt, was die mir sagen wollten."}, {"id": 29, "start": 289.24, "end": 294.84, "text": "Die Story ist auch ein bisschen konfus, aber ja, Japan RPG halt."}, {"id": 30, "start": 294.84, "end": 321.32, "text": "Ja, also was wir heute machen, ist folgendes sein. Wir gucken uns nicht Microsoft an."}, {"id": 31, "start": 321.32, "end": 327.96, "text": "Und wir gucken uns auch nicht Vodafone an. Den ganzen Mist muss ich mal zumachen. Und wir gucken uns"}, {"id": 32, "start": 327.96, "end": 331.96, "text": "auch nicht den CCC-Talk an. Ich lasse jetzt einfach den Chat auf, hier an der Stelle, um gut ist."}, {"id": 33, "start": 331.96, "end": 337.48, "text": "So, ich mache mal die VM an. Also ich habe meinen Access-Point am Start und ich habe festgestellt,"}, {"id": 34, "start": 337.48, "end": 345.32, "text": "dass das CLI für den Access-Point richtiger Müll ist. Du kannst damit fast nichts machen."}, {"id": 35, "start": 345.32, "end": 353.8, "text": "Okay, restarten kannst du. Aber Sachen, die man machen will, kann man über das Web-Interface machen,"}, {"id": 36, "start": 353.8, "end": 360.56, "text": "aber nicht über das CLI. Also das CLI für den Access-Point ist wirklich pains-champ, richtiger"}, {"id": 37, "start": 360.56, "end": 367.44, "text": "pains-champ. Deswegen habe ich mir gedacht, wir gucken einfach mal, was das Web-Interface für"}, {"id": 38, "start": 367.44, "end": 376.04, "text": "Request schickt. Und dann gehen wir über die API vom Web-Interface und gucken uns das an. Wer"}, {"id": 39, "start": 376.04, "end": 382.0, "text": "entwickelt denn sowas? Ruggus macht das anscheinend. Ja, zum Beispiel, ich lock mich mal kurz ein."}, {"id": 40, "start": 382.0, "end": 393.36, "text": "Also, Admin. Pass auf, Passwort leak, Leute. Passwort ist aber nicht schlimm, weil der Access-Point"}, {"id": 41, "start": 393.36, "end": 396.88, "text": "ist nicht von außen erreichbar und ich werde nach dem Stream auch das Passwort ändern. Achtung,"}, {"id": 42, "start": 396.88, "end": 410.04, "text": "Leute. Passwort leak gleich. Moment, wo habe ich das Passwort? Hier, Passwort. Ihr werdet"}, {"id": 43, "start": 410.04, "end": 418.04, "text": "es gleich sehen, wir werden es gleich hardcoded in Code reinschreiben. Also, ich habe auch alles"}, {"id": 44, "start": 418.04, "end": 430.52, "text": "disabled. Zum Beispiel, was man, Services, DPSK. Also, wenn man WLAN-Passwörter generiert für"}, {"id": 45, "start": 430.52, "end": 436.96, "text": "User, kann man die sich zum Beispiel hier im Web-Interface anzeigen lassen. Inklusive Passwort"}, {"id": 46, "start": 436.96, "end": 441.32, "text": "mittlerweile. Man kann sogar sich einen passenden QR-Code dafür anzeigen lassen. Das geht alles"}, {"id": 47, "start": 441.32, "end": 451.24, "text": "über die Kommando-Zeile nicht. Und auch das Generaten, quasi das Batch-Generaten von"}, {"id": 48, "start": 451.24, "end": 455.16, "text": "Usern geht nur übers Web-Interface, nicht übers CLI. Das heißt, dadurch, dass es übers Web-Interface"}, {"id": 49, "start": 455.16, "end": 459.2, "text": "geht, du kannst den Mist nicht automatisieren. Das heißt, wenn ich jetzt ein Gäste-WLAN habe,"}, {"id": 50, "start": 459.2, "end": 465.04, "text": "ich habe hier testweise mal ein Gäste-WLAN angelegt, was wir jetzt benutzen werden. Also,"}, {"id": 51, "start": 465.04, "end": 469.48, "text": "ich habe ein Gäste-WLAN angelegt. Mal angenommen, es kommt jemand zu Gast. Ihr kennt mich, was eh"}, {"id": 52, "start": 469.48, "end": 474.04, "text": "nicht passiert, aber für den Fall der Fälle, ich bin ja nicht der Einzige, der sowas verwendet,"}, {"id": 53, "start": 474.04, "end": 480.96, "text": "ist mir aufgefallen, ich könnte gar nicht hergehen und sagen, bla, bla, bla, bla, bla,"}, {"id": 54, "start": 480.96, "end": 489.0, "text": "add User und dann was hinzufügen oder so. Es gibt keine Tools für, das musst du alles"}, {"id": 55, "start": 489.0, "end": 492.44, "text": "übers Web-Interface machen. Was natürlich auch ein bisschen blöd ist, wenn du die einfach mal"}, {"id": 56, "start": 492.44, "end": 499.48, "text": "einem User anzeigen lassen willst und sowas. Das klappt alles nicht so richtig gut übers CLI. Das"}, {"id": 57, "start": 499.48, "end": 509.24, "text": "ist alles ziemlicher Mist, was die programmiert haben. Übrigens, Leute, da steht zwar Java Server"}, {"id": 58, "start": 509.24, "end": 514.96, "text": "Pages, aber ich glaube, das sind gar keine Java Server Pages. Das sieht nur aus wie Java Server"}, {"id": 59, "start": 514.96, "end": 527.64, "text": "Pages, weil wer würde denn auf irgendeinem Low Performance Embedded-Ding wirklich Java laufen"}, {"id": 60, "start": 527.64, "end": 535.32, "text": "lassen? Wer macht denn sowas? Die Seiten heißen wahrscheinlich einfach nur aus Rückwärtskompatibilitätsgründen"}, {"id": 61, "start": 535.32, "end": 549.76, "text": "und unter der Haube ist es wahrscheinlich PHP oder Note oder so. Keine Ahnung. Zumindest habe"}, {"id": 62, "start": 549.76, "end": 557.92, "text": "ich mir gedacht, wir schauen einfach mal nach und bauen uns ein Kommando-Zeilen-Tool, wo wir User"}, {"id": 63, "start": 557.92, "end": 561.44, "text": "auflisten können, User adden können und sowas, aber wir müssen erst mal gucken, wie man sich da"}, {"id": 64, "start": 561.44, "end": 568.76, "text": "prinzipiell einloggt. So, und ich sehe da zwei Möglichkeiten zu, das zu machen. Entweder, das"}, {"id": 65, "start": 568.76, "end": 571.88, "text": "haben wir das letzte Mal gemacht, also entweder, das müssen wir jetzt mal rausbekommen, entweder"}, {"id": 66, "start": 571.88, "end": 579.68, "text": "nehmen wir einen Chrome, Fernsteuern, das ist die Möglichkeit, dass wir einen Chrome nehmen und den"}, {"id": 67, "start": 579.68, "end": 584.76, "text": "Fernsteuern und dann quasi sagen dem Chrome, er soll hier klicken oder er soll da klicken, er soll"}, {"id": 68, "start": 584.76, "end": 591.36, "text": "er soll da klicken, er soll da klicken, er soll dann da klicken und so. Das ist aber nicht so schön,"}, {"id": 69, "start": 591.36, "end": 600.64, "text": "vielleicht, und das hoffe ich eher drauf, ja, bekommen wir raus, wie die API funst. Also sprich,"}, {"id": 70, "start": 600.64, "end": 609.36, "text": "wir gucken entweder hier mit dem, wir gucken entweder hier mit dem mit dem Tool nach, was der,"}, {"id": 71, "start": 609.36, "end": 615.68, "text": "was der überträgt und oder wir probieren mit Postman ein bisschen. Bestimmt gibt es eine einfache"}, {"id": 72, "start": 615.68, "end": 621.0, "text": "JSON-API. Nein, Spoiler, Spoiler, es wird richtig eklig, ich habe nämlich im Vorfeld schon ein"}, {"id": 73, "start": 621.0, "end": 638.0, "text": "bisschen nachgeguckt, es ist keine JSON-API, es ist XML. Es ist XML, ja und richtig eklig ist"}, {"id": 74, "start": 638.0, "end": 646.28, "text": "XML, ihr werdet es gleich sehen. Es ist JavaScript in XML, ihr werdet euch denken, wer hat sich das"}, {"id": 75, "start": 646.28, "end": 650.4, "text": "denn ausgedacht. Ich habe im Vorfeld schon ein bisschen auf GitHub rumgeguckt, was andere Leute"}, {"id": 76, "start": 650.4, "end": 659.6, "text": "so rausbekommen haben. Es ist teilweise JavaScript in XML und das ist richtig, richtig abartig."}, {"id": 77, "start": 659.6, "end": 665.44, "text": "So und als erstes müssen wir mal rausbekommen, wie lockt man sich ein und sonst was. Ich habe"}, {"id": 78, "start": 665.44, "end": 672.36, "text": "was gefunden auf Shithub, da hat nämlich jemand schon ein bisschen was rausbekommen"}, {"id": 79, "start": 672.36, "end": 683.04, "text": "und zwar irgendjemand hat, was heißt irgendjemand, der MMMollinari hat das rausbekommen,"}, {"id": 80, "start": 683.04, "end": 690.36, "text": "der hat hier so ein Postman JSON gebaut, damit man mit Postman Request schicken kann. Da bin"}, {"id": 81, "start": 690.36, "end": 694.48, "text": "ich nicht so wirklich daran interessiert, wenn ich ehrlich bin. Mich interessiert, was er gemacht hat"}, {"id": 82, "start": 694.48, "end": 699.08, "text": "und es geht schon los. Ich zeige euch mal so ein bisschen, was ihr gleich seht, was auf uns"}, {"id": 83, "start": 699.08, "end": 706.44, "text": "zukommt. Also das geht schon mal mit dem Login los. Das Login ist kein Postrequest, sondern das"}, {"id": 84, "start": 706.44, "end": 712.96, "text": "Login ist ein Postrequest, der, nee ist gar kein Postrequest, ist ein Get, der das Ganze natürlich"}, {"id": 85, "start": 712.96, "end": 721.2, "text": "in irgendeiner Art und Weise in der Url encoded, weil, ja, muss so sein, weil macht man ja 2022"}, {"id": 86, "start": 721.2, "end": 728.16, "text": "noch so, inklusive Passwort und so alles in der Url encoded. Der Glück, was die haben, ist, dass"}, {"id": 87, "start": 728.16, "end": 734.52, "text": "das harte TPS ist. Wäre das nicht harte TPS, wäre das hochgradig unsicherer Krempel. Gut, aber man,"}, {"id": 88, "start": 734.52, "end": 743.24, "text": "wäre es im Postbody auch. So, und jetzt kommt der Hit. Um sich sein Session-Token zu besorgen,"}, {"id": 89, "start": 743.24, "end": 751.64, "text": "muss man Folgendes machen. Man muss eine JSON-Response, eine XML-Response umwandeln,"}, {"id": 90, "start": 751.64, "end": 756.8, "text": "zumindest macht der Typ das hier so, zu JSON und sich das dann rausparsen. Also man muss quasi"}, {"id": 91, "start": 756.8, "end": 762.84, "text": "JavaScript aus XML rausparsen, nachdem man das in JSON konvertiert hat. Wobei man das in JSON"}, {"id": 92, "start": 762.84, "end": 767.08, "text": "konvertieren nicht unbedingt braucht, das macht der Typ hier jetzt nur. So, und die API sieht dann"}, {"id": 93, "start": 767.08, "end": 778.44, "text": "ansonsten so aus ungefähr. Hier. XML mit vereinzelt JavaScript in XML. Das wird richtig,"}, {"id": 94, "start": 778.44, "end": 784.28, "text": "richtig abartiger Shit. Das kann ich euch jetzt schon sagen. Das wird ganz, ganz furchtbar eklig."}, {"id": 95, "start": 784.28, "end": 798.04, "text": "Ja. Schauen wir mal. Ich bin gespannt, ob wir das auf die Reihe kriegen. Kann man echt nur das zu"}, {"id": 96, "start": 798.04, "end": 813.72, "text": "sagen. Oh, ich sollte mal updaten. Sehe ich hier gerade updaten? Hallo? Wo ist die Toolbox?"}, {"id": 97, "start": 813.72, "end": 823.88, "text": "Warum ist die Toolbox aus? Was startest du? Wo sollst du die Toolbox geben? Toolbox sollst du"}, {"id": 98, "start": 823.88, "end": 834.24, "text": "starten. So. Open Toolbox. Update, Update. Service Tab. Got it. Juckt mich überhaupt nicht."}, {"id": 99, "start": 834.24, "end": 845.08, "text": "Wintime beste API. Was ist denn Wintime? Ist das irgendeine Test API wie die Star Wars API?"}, {"id": 100, "start": 845.08, "end": 852.2, "text": "Wintime, das finde ich viel besser zum Testen als die Star Wars API. Das ist für alle exquisite"}, {"id": 101, "start": 852.2, "end": 857.68, "text": "Fiveheader unter uns, die sich nur immer 5000 Euro teuren Wien beim Programmieren und beim"}, {"id": 102, "start": 857.68, "end": 876.2, "text": "High IQ Tätigkeit nachgehend reinhauen. So wie ich nicht. Wir haben das Emote auch. Too Smart ist"}, {"id": 103, "start": 876.2, "end": 897.76, "text": "das Emote bei mir. So hat er geupdatet. Kann man die Toolbox updaten? Check for updates. Ja,"}, {"id": 104, "start": 897.76, "end": 902.16, "text": "übrigens ist euch immer aufgefallen, wie kreativ ich meine. Ich mache den ganzen"}, {"id": 105, "start": 902.16, "end": 912.48, "text": "Krabbel hier mal kurz zu. Ist euch aufgefallen, wie ultra kreativ ich meine User benannt habe"}, {"id": 106, "start": 912.48, "end": 919.52, "text": "zum Testen? Also es geht von Keku, Kekus, Kekus, Batch User Omega Lul und Poggers haben wir zum"}, {"id": 107, "start": 919.52, "end": 928.56, "text": "Start. Habe ich gestern angelegt zum ausprobieren. Ja, Gäste, WLAN. Das Leute, ich sage es jetzt"}, {"id": 108, "start": 928.56, "end": 933.84, "text": "nochmal, bevor jetzt wieder irgendwie 20.000 Leute schreien. User Leak, WLAN Leak, Mac Leak,"}, {"id": 109, "start": 933.84, "end": 939.76, "text": "alles Leak. Das ist ein Test WLAN, was ich angelegt habe für den Stream beziehungsweise zum"}, {"id": 110, "start": 939.76, "end": 945.36, "text": "ausprobieren mit Usern, die ich niemals in echt verwenden werde und mit einem deaktivierten"}, {"id": 111, "start": 945.36, "end": 953.4, "text": "WLAN. Es ist kein WLAN auf dem Access Point aktuell auf. Es kann also noch so viel geleakt"}, {"id": 112, "start": 953.4, "end": 962.24, "text": "werden. Es passiert einfach gar nichts. Aber das wird natürlich trotzdem mich die Leute"}, {"id": 113, "start": 962.24, "end": 974.0, "text": "davon abhalten, was von Leak alle 5 Minuten zu schreiben. So, ihr seid quasi schon drin."}, {"id": 114, "start": 974.0, "end": 978.96, "text": "Ja, ich weiß, ich kenne euch ja, kenne euch ja. Gut, so, dann legen wir mal ein Projekt an."}, {"id": 115, "start": 978.96, "end": 987.04, "text": "Leute, sagt mir mal, wollen wir in Just Chatting bleiben oder wollen wir in Softwareentwicklung"}, {"id": 116, "start": 987.04, "end": 991.92, "text": "gehen? Das ist bei mir immer so ein Zwischending. Ich mache Softwareentwicklung mit irgendwie"}, {"id": 117, "start": 991.92, "end": 999.6, "text": "gefühlt 50% Just Chatting. Und wir brauchen guten Projekten haben. New Solution, weiß"}, {"id": 118, "start": 999.6, "end": 1011.04, "text": "hier, der Rokoschamp. In Beach und Pool. Moment, streamen da überhaupt noch Leute? Twitch,"}, {"id": 119, "start": 1011.04, "end": 1030.28, "text": "Beach, Pool. Whirlpool und Strände. Okay, okay. Man weiß Bescheid, was da läuft, ja."}, {"id": 120, "start": 1030.28, "end": 1041.72, "text": "Oh, ein KS, Alter. What the fuck? Aber das außer Amorant oder wie man die genau ausspricht,"}, {"id": 121, "start": 1041.72, "end": 1048.12, "text": "hat kaum noch Zuschauer. Was wäre ich aus Indie Fox geworden? Gibt es die noch? Lange"}, {"id": 122, "start": 1048.12, "end": 1054.44, "text": "nichts mehr gehört hier auf Twitch. Wurde die nicht sogar gebannt? Ach, keine Ahnung."}, {"id": 123, "start": 1054.44, "end": 1060.16, "text": "Ehrlich gesagt ist mir das auch ziemlich wurscht. Ist mir nur gerade so eingefallen. Wisst ihr,"}, {"id": 124, "start": 1060.16, "end": 1065.4, "text": "was Schlimmes? Wisst ihr was Schlimmes? Dass man sich sogar die Namen merkt. Ich hab das"}, {"id": 125, "start": 1065.4, "end": 1069.08, "text": "nie geguckt und ich weiß, jetzt sagt der Chat wieder, haha, null Max, ja, ja, nie geguckt,"}, {"id": 126, "start": 1069.08, "end": 1073.28, "text": "deswegen weiß ich die Namen nicht. Ich hab das nie geguckt, aber man hat genug mitbekommen,"}, {"id": 127, "start": 1073.28, "end": 1078.24, "text": "dass man sich die Namen merkt. Das ist so eigentlich Marketing-technisch alles richtig gemacht."}, {"id": 128, "start": 1078.24, "end": 1098.52, "text": "Die ist gebannt. Na gut. Dann hat sich das ja wohl erledigt. Okay, auf geht's. Also,"}, {"id": 129, "start": 1098.52, "end": 1102.68, "text": "probieren wir das mal aus, wie man sich einloggen kann. Hello World ist schon mal nicht das,"}, {"id": 130, "start": 1102.68, "end": 1107.12, "text": "was wir brauchen. War, hattet, ach nee, ich wollte mal was anderes ausprobieren und zwar"}, {"id": 131, "start": 1107.12, "end": 1115.92, "text": "der normale Poki-W-Virgin-Check-Chat. Auf geht's. Poki-W-Virgin-Check, I'm safe. Ich hab die Copypasta"}, {"id": 132, "start": 1115.92, "end": 1132.68, "text": "gerade nicht zur Hand. Aber alle einmal Poki-W-Check im Chat hier. Hier keine versteckten Poki-Subs"}, {"id": 133, "start": 1132.68, "end": 1139.52, "text": "am Start, alles klar. Nicht das ist schlimm, wer soll jeder Subscriber werden will. Gibt"}, {"id": 134, "start": 1139.52, "end": 1145.0, "text": "so viele Channels, die übelst gefeiert werden, die ich nicht gucke und umgedreht. I'm safe,"}, {"id": 135, "start": 1145.0, "end": 1155.64, "text": "jawoll. Nice. Nochmal Glück, ja, ganz knapp. So, okay, also, ich wollte nämlich was anderes"}, {"id": 136, "start": 1155.64, "end": 1161.18, "text": "finden und zwar, weil mir der Standard-HTTP-Kline in.NET so auf den Keks geht. Ich hab nämlich"}, {"id": 137, "start": 1161.18, "end": 1166.4, "text": "letztens was anderes gefunden, was ich mal ausprobieren wollte..NET-HTTP-Kline und zwar"}, {"id": 138, "start": 1166.4, "end": 1194.4, "text": "Flurl hieß das, glaube ich. Ja. Flurnd, H-T-T, Moment, wo kommt denn das? Wo kommt das R und"}, {"id": 139, "start": 1194.4, "end": 1200.94, "text": "ich hab keinen flassen Schimmer. Ach, URL. Okay, da hätte ich auch selbst drauf kommen"}, {"id": 140, "start": 1200.94, "end": 1205.82, "text": "können. Ja, das wollte ich mal ausprobieren. Keine Ahnung, ob das jemand von euch schon"}, {"id": 141, "start": 1205.82, "end": 1211.46, "text": "verwendet hat. Wenn ja, kann das ja mal in den Chat schreiben. Das sah mir deutlich angenehmer"}, {"id": 142, "start": 1211.46, "end": 1217.42, "text": "aus als den eingebauten H-T-T-P-Kline, weil der geht mir regelmäßig auf den Keks, der"}, {"id": 143, "start": 1217.42, "end": 1222.34, "text": "eingebaute H-T-T-P-Kline. Deswegen dachte ich, probieren wir das mal aus. Und das Coole"}, {"id": 144, "start": 1222.34, "end": 1226.7, "text": "daran ist, man kann zum Beispiel solche Sachen jetzt machen. Guck, also ich zeige mal. Normalerweise"}, {"id": 145, "start": 1226.7, "end": 1234.26, "text": "macht man sowas. H-T-T-P-Kline, gleich, new, H-T-T-P-Kline, H-T-T-P-Kline oder irgendwie"}, {"id": 146, "start": 1234.26, "end": 1237.98, "text": "keine Ahnung, get. Mittlerweile haben wir sowas wie get string und sowas, das gab es"}, {"id": 147, "start": 1237.98, "end": 1244.38, "text": "glaube ich am Anfang gar nicht. So, get string, google.de und dann kann ich das ausgeben."}, {"id": 148, "start": 1244.38, "end": 1252.42, "text": "So, das macht man normalerweise so, hallo. Und wenn ich das jetzt ausführe, haben wir"}, {"id": 149, "start": 1252.42, "end": 1257.38, "text": "ein Terminal hier unten auf,.net run, dann kommt jetzt gleich Google als Antwort. Dem"}, {"id": 150, "start": 1257.38, "end": 1268.1, "text": "Terminal. So, nee. Warum nicht? Ach so, weil H-T-T-P-S wahrscheinlich davor muss. Jetzt?"}, {"id": 151, "start": 1268.1, "end": 1280.86, "text": "Was zum? W-W-W? Was mache ich denn falsch? Ach so, ich habe 3 Slashes, null. So, jetzt"}, {"id": 152, "start": 1280.86, "end": 1286.38, "text": "kriegt man hier ganz viel Google-Gedöns zurück. So, das ist normal, so macht man Requests"}, {"id": 153, "start": 1286.38, "end": 1290.58, "text": "mit dem eingebauten H-T-T-P-Kline. Und mit Flurl, habe ich gesehen, kann man sowas hier"}, {"id": 154, "start": 1290.58, "end": 1294.62, "text": "machen. Guck mal, das finde ich mega nice. Man kann das alles weglassen. Man kann das"}, {"id": 155, "start": 1294.62, "end": 1304.58, "text": "alles weglassen. Und sagt einfach get string async. Fertig. Ich meine, spart jetzt an der"}, {"id": 156, "start": 1304.58, "end": 1309.18, "text": "Stelle nicht so viel, aber H-T-T-P-Handling ist in.net eh etwas painstampig. Da ist das"}, {"id": 157, "start": 1309.18, "end": 1315.78, "text": "auf jeden Fall die schönere Variante. Und man kann auch wohl noch mehr machen. Man kann"}, {"id": 158, "start": 1315.78, "end": 1322.18, "text": "nämlich auch einfach Header setzen und Basic Auth kann man. Wer schon mal Basic Auth gemacht"}, {"id": 159, "start": 1322.18, "end": 1328.38, "text": "hat mit dem Standard.net Client, wird wissen, das ist mega, mega eklig, weil du musst dich"}, {"id": 160, "start": 1328.38, "end": 1335.22, "text": "selbst darum kümmern, dass du die Sachen in Base64 encodest und sowas. Das ist richtig"}, {"id": 161, "start": 1335.22, "end": 1340.3, "text": "hängen geblieben. Ich weiß nicht warum. Ja, guck, Standard, man muss sowas machen hier."}, {"id": 162, "start": 1340.3, "end": 1347.22, "text": "Encoding, get bytes, authorization, header, convert to Base64. So viel boilerplate für"}, {"id": 163, "start": 1347.22, "end": 1350.94, "text": "einen Basic Auth Request. Das finde ich cool, dass man das hier alles eingebaut hat. So,"}, {"id": 164, "start": 1350.94, "end": 1354.58, "text": "aber wir wollen ja keinen Request auf Google machen. Wir wollen einen Request machen auf"}, {"id": 165, "start": 1354.58, "end": 1364.26, "text": "eh ja wohin eigentlich? Login. Login. Da wollen wir einen Request hin machen. So Leute, ich"}, {"id": 166, "start": 1364.26, "end": 1368.78, "text": "werde jetzt mein Passwort leaken. Achtung. Das wird jetzt nach dem Stream resettet, aber"}, {"id": 167, "start": 1368.78, "end": 1371.9, "text": "das ist der Moment, den Markter chat immer, wenn irgendwas geleakt wird. Also erstmal"}, {"id": 168, "start": 1371.9, "end": 1383.14, "text": "die IP von dem Ding 192.168.2.2.143. Das ist die IP da. Sieht man ja hier oben. War"}, {"id": 169, "start": 1383.14, "end": 1390.18, "text": "User gleich Admin. Wer hätte das gedacht? Und jetzt war Passwort Achtung Massive Passwort"}, {"id": 170, "start": 1390.18, "end": 1406.58, "text": "Leak. Das ist mein Passwort für den Access Point. Jetzt ist es raus. Wer sich fragt, wie"}, {"id": 171, "start": 1406.58, "end": 1411.5, "text": "ich das Passwort generiert habe, ganz einfach. Dazu gibt es das schöne Programm PV GAN."}, {"id": 172, "start": 1411.5, "end": 1422.62, "text": "Wenn man nicht gerade über den Passwort Manager macht, PV GAN und er generiert euch halbwegs"}, {"id": 173, "start": 1422.62, "end": 1427.46, "text": "gut merkbare Passwörter mit unterschiedlicher Länge. Ich glaube Minus D ist es oder so."}, {"id": 174, "start": 1427.46, "end": 1438.34, "text": "Ah ne einfach hinten dran. So 32. Dann bekommt man solche Orogeheinsheini. Das kriegt man"}, {"id": 175, "start": 1438.34, "end": 1443.5, "text": "dann da. First try erraten. Ja war klar der Chat ist so sick, der kann in Zukunft quasi"}, {"id": 176, "start": 1443.5, "end": 1449.82, "text": "meinen Randomizer auslesen und weiß schon, was ich für Passwörter erzeugen werde. Das"}, {"id": 177, "start": 1449.82, "end": 1456.02, "text": "war mir aber schon klar. Predicted alles. Also PV GAN ist da ganz praktisch und ich glaube,"}, {"id": 178, "start": 1456.02, "end": 1461.54, "text": "dass PV GAN auch human readable Passwörter machen kann. Obwohl macht standardmäßig"}, {"id": 179, "start": 1461.54, "end": 1471.54, "text": "schon human readable Passwörter. Ist ganz praktisch. Ist ganz praktisch ja. Was mit"}, {"id": 180, "start": 1471.54, "end": 1476.7, "text": "SY? Ja das ist, dass er alle Zeichen nimmt. Das will man dann wahrscheinlich nicht unbedingt"}, {"id": 181, "start": 1476.7, "end": 1481.9, "text": "haben. Das ist das irgendwie schöner. Wie gesagt jeder Passwort Manager kann sowas"}, {"id": 182, "start": 1481.9, "end": 1487.66, "text": "generieren aber auf die schnelle ist PV GAN eigentlich ganz nützlich. Also wir machen"}, {"id": 183, "start": 1487.66, "end": 1492.02, "text": "jetzt mal einen Request und zwar wir müssen jetzt gucken wohin der Request geht. Dahin"}, {"id": 184, "start": 1492.02, "end": 1502.46, "text": "geht der Request. Also. So dahin geht der Request. Mach mal den Krempel mal kurz hier"}, {"id": 185, "start": 1502.46, "end": 1522.66, "text": "dicht. Also Base URL ist die IP. User ist User und PV Passwort. Okay von der Theorie"}, {"id": 186, "start": 1522.66, "end": 1532.7, "text": "her wenn das jetzt alles funktioniert. Warum kann ich das nicht erwarten? Ach so weil ich"}, {"id": 187, "start": 1532.7, "end": 1536.98, "text": "noch sagen muss. Get. String. Async. So von der Idee her sollte ich jetzt einfach."}, {"id": 188, "start": 1536.98, "end": 1545.62, "text": "In den Login Bildschirm oder so als Antwort bekommen. Ist das auch ein Post. Ein Get."}, {"id": 189, "start": 1545.62, "end": 1552.62, "text": "Ist das ein Get. Ja das ist ein Get Request. Mal gucken. Leute ob ich alle. Ob ich alle"}, {"id": 190, "start": 1552.62, "end": 1560.62, "text": "gebräuchlichen HTTP Dinge aus dem Kopf hinkriege. Was haben wir denn. Get Post ist klar. Patch."}, {"id": 191, "start": 1560.62, "end": 1578.1, "text": "Delete. Ich hab keine Ahnung. Gibt noch mehr. Het genau. Options. Und da gibt es auch noch"}, {"id": 192, "start": 1578.1, "end": 1586.78, "text": "Zeug was web darf und so verwendet. Putt. Putt hab ich vergessen. Natürlich. Genau. Putt"}, {"id": 193, "start": 1586.78, "end": 1594.5, "text": "ist eigentlich das normale. Patch verwendet kaum noch irgendjemand. Hier. Header. Das"}, {"id": 194, "start": 1594.5, "end": 1601.3, "text": "ist ein quasi ein Zero Header. Der hat weder keine Zahl davor. Post. Putt. Delete. Connect."}, {"id": 195, "start": 1601.3, "end": 1609.18, "text": "Ja das ist für SSL Gedöns. Options. Patch. Trace. Da hab ich noch nie verwendet Trace."}, {"id": 196, "start": 1609.18, "end": 1618.26, "text": "So siehts aus. Wieder was gelernt. Genau. Gut. Also. Dotnet. Run. Hallo. Was ist denn mit"}, {"id": 197, "start": 1618.26, "end": 1622.58, "text": "meiner. Mit meiner Shell unten da. Ok Leute. Wisst ihr was. Wir brauchen eine ordentliche"}, {"id": 198, "start": 1622.58, "end": 1630.74, "text": "Shell. Machen wir mal so. Wobei wir brauchen doch nicht mal. Ryder. Pro. Prochanks. Rogoschamp."}, {"id": 199, "start": 1630.74, "end": 1646.78, "text": "Dotnet. Run. Ordentliche Shell. Oh. Was jetzt. Ach. Zertifikat. Zertifikat nicht gültig."}, {"id": 200, "start": 1646.78, "end": 1652.9, "text": "Ach so. Ja das war klar. Dass der sich dran stört. Mal gucken ob sie das auch einfacher"}, {"id": 201, "start": 1652.9, "end": 1663.02, "text": "gemacht haben. Ignore. Gibt's da sowas. Ignore. SSL. Nee. Oh nee. Haben die da nichts einfaches"}, {"id": 202, "start": 1663.02, "end": 1668.7, "text": "eingebaut. Weil Zertifikats Errors ignorieren ist auch was was mir richtig extrem auf den"}, {"id": 203, "start": 1668.7, "end": 1676.26, "text": "Sack geht. Bei dem Standard Dotnet HTTP Client. Da muss man immer einen extra Händler einfügen"}, {"id": 204, "start": 1676.26, "end": 1691.06, "text": "und haste nicht gesehen. Blurrl und untrusted Zertifikats. Fiveheader Time. Was. Untrusted"}, {"id": 205, "start": 1691.06, "end": 1701.26, "text": "Zert Client Factory. Na wenn das ja nicht mal OOP. Of Doom ist. Untrusted Zert Client"}, {"id": 206, "start": 1701.26, "end": 1707.42, "text": "Factory. Erb von Default HTTP Client Factory. Und macht im Prinzip das was man beim normalen"}, {"id": 207, "start": 1707.42, "end": 1713.58, "text": "HTTP Client auch machen muss. Man überschreibt das. Okay. Ich hab ne Idee. Wir machen mal"}, {"id": 208, "start": 1713.58, "end": 1718.58, "text": "was Fiveheader mäßiges. Ich sehe nämlich schon kommen dass wir jede Menge HTTP Helper"}, {"id": 209, "start": 1718.58, "end": 1724.1, "text": "Methoden hier brauchen. Deswegen machen wir einfach mal eine extra klasse HTTP Helper."}, {"id": 210, "start": 1724.1, "end": 1728.7, "text": "Nur nicht ganz sicher was da alles reinkommt. Aber da kommt auf jeden Fall JSON to XML"}, {"id": 211, "start": 1728.7, "end": 1737.34, "text": "und so gedönnt rein. Ne ne XML to JSON und sowas. Was jetzt? Ah Chrono Trigger Musik."}, {"id": 212, "start": 1737.34, "end": 1752.18, "text": "So also machen wir eben so viel Void. Global. Global. Ignore. Zert. Error. Ja. Jetzt müssen"}, {"id": 213, "start": 1752.18, "end": 1759.02, "text": "wir bloß auch schauen was man da reinschreibt. Abblick. Fertig. So also was braucht man"}, {"id": 214, "start": 1759.02, "end": 1773.3, "text": "da jetzt? Untrusted Client Factory. Bonkers Alter. So und jetzt? Alter was ist das für"}, {"id": 215, "start": 1773.3, "end": 1781.02, "text": "High IQ Shit wieder? Warum warum machen die es einem immer so schwer so simple Sachen"}, {"id": 216, "start": 1781.02, "end": 1793.42, "text": "wie Zertifikatswarnung zu deaktivieren? Oh Url kann man das nicht irgendwie global überschreiben?"}, {"id": 217, "start": 1793.42, "end": 1817.34, "text": "Also irgendwie. Also irgendwie keine Ahnung. Was macht der hier? Flurl. Wieso nicht einfach"}, {"id": 218, "start": 1817.34, "end": 1821.38, "text": "Curl ausführen und Insecure setzen? Na weil das ein bisschen nervig ist wenn du Kommando"}, {"id": 219, "start": 1821.38, "end": 1826.42, "text": "Teilen Tools aufrufst und dann zu checken. Keine Ahnung. Was ist der Return Code? Das"}, {"id": 220, "start": 1826.42, "end": 1831.54, "text": "musst du dir irgendwie aus der Response rausparsen. Du kriegst kein fertiges JSON als Response."}, {"id": 221, "start": 1831.54, "end": 1839.1, "text": "Das kannst du machen aber schöner ist es wenn man irgendeine integrierte HTTP Library verwendet."}, {"id": 222, "start": 1839.1, "end": 1846.3, "text": "Wenn gar nichts hilft kann man Curl aufrufen. Ja. So gibt es hier so Global Settings? Das"}, {"id": 223, "start": 1846.3, "end": 1855.14, "text": "ist doch schon mal gut. Du hast wie Händler oder so? Nee. Factory? Ah guck mal da. Flurl"}, {"id": 224, "start": 1855.14, "end": 1865.5, "text": "Client Factory. New Untrusted Client Factory. Leute warum fresst ihr den eigenen Kram nicht"}, {"id": 225, "start": 1865.5, "end": 1871.94, "text": "wenn es doch extra davon abgeleitet ist? Ah Moment das ist eine HTTP Client Factory. Alles"}, {"id": 226, "start": 1871.94, "end": 1888.7, "text": "klar. So. Moment jetzt mal gucken ob das jetzt funktioniert. Zack. Gotnet Run. Immer noch"}, {"id": 227, "start": 1888.7, "end": 1895.74, "text": "das. Moment ruft er diesen Krempel überhaupt auf? Dass man sich immer mit so einem Bullshit"}, {"id": 228, "start": 1895.74, "end": 1904.74, "text": "aufhalten muss man. Ich will was machen. Keck. Führt er das denn überhaupt aus? Er führte"}, {"id": 229, "start": 1904.74, "end": 1914.3, "text": "es aus. Ok. Ihr kennt mich Breakpoint setzen ist nicht meins. So. Das interessiert den"}, {"id": 230, "start": 1914.3, "end": 1924.38, "text": "nicht. Ist das vielleicht gar kein Problem mit dem Zertifikat? Weil da steht ja nichts"}, {"id": 231, "start": 1924.38, "end": 1937.66, "text": "von Zertifikat. Da steht einfach nur SSL Handshake failed. Also quasi hier. Ok. Google."}, {"id": 232, "start": 1937.66, "end": 1953.18, "text": "Google. Gotnet. Ne 6. Moment da ist doch schon was. Was? Wie? Wollt ihr mich verarschen"}, {"id": 233, "start": 1953.18, "end": 1957.7, "text": "kann man keine Zertifikatsmeldung mehr deaktivieren? Das macht es. Das kann nicht sein. Das wäre"}, {"id": 234, "start": 1957.7, "end": 1961.82, "text": "ja komplett unbenutzbar. Die Hälfte der Seiten die man automatisch auslesen will intern"}, {"id": 235, "start": 1961.82, "end": 1975.42, "text": "oder sonst. Die haben kein gültiges Zertifikat. Ok. Was machen die da für Dinger? Was? Soll"}, {"id": 236, "start": 1975.42, "end": 1981.7, "text": "eine eigene OpenSSL konft? Im Leben mache ich keine eigene OpenSSL konft dafür. Was"}, {"id": 237, "start": 1981.7, "end": 1988.9, "text": "kommt denn als nächstes? OpenSSL selbst kompilieren oder was? Oder wie? Ich glaube"}, {"id": 238, "start": 1988.9, "end": 1996.94, "text": "dass SSL V3 steht ist einfach nur in der Fehlermeldung. Das heißt einfach so. Ich bin mir gar nicht"}, {"id": 239, "start": 1996.94, "end": 2009.14, "text": "sicher ob das wirklich. Wobei TLS. SSL 3 ist doch im Endeffekt. TLS 1 2. Kann man"}, {"id": 240, "start": 2009.14, "end": 2018.18, "text": "das hier vielleicht einstellen? Kann man hier vielleicht einstellen? TLS oder SSL? SSL"}, {"id": 241, "start": 2018.18, "end": 2024.34, "text": "Protokolls kann man da einstellen. Guck mal da. Benutzst du Rider? Ja. Ok was muss man"}, {"id": 242, "start": 2024.34, "end": 2053.62, "text": "da angeben? SSL Protokolls? Eine Liste? Irgendwie sowas? SSL Protokolls? TLS? Ach das ist"}, {"id": 243, "start": 2053.62, "end": 2058.9, "text": "ein Enum. Den muss man wahrscheinlich mit und zusammen machen oder mit oder zusammen"}, {"id": 244, "start": 2058.9, "end": 2067.34, "text": "machen. So war es da. Ok was passiert jetzt? In Python wäre das nicht passiert. Du wirst"}, {"id": 245, "start": 2067.34, "end": 2075.74, "text": "immer was finden was in anderen Programmiersprachen nicht passiert wäre und umgedreht. No ciphers"}, {"id": 246, "start": 2075.74, "end": 2090.14, "text": "available. Aha. Max du machst das echt gut wollte ich dir sagen. Dankeschön. Schön"}, {"id": 247, "start": 2090.14, "end": 2095.22, "text": "dass es dir gefällt. Aktuell läuft es zwar nicht so aber kann ich ja nichts für. No ciphers"}, {"id": 248, "start": 2095.22, "end": 2104.7, "text": "available. Was zum Teufel will der Dude mir sagen? Was ist das? Ok wir müssen glaube"}, {"id": 249, "start": 2104.7, "end": 2116.78, "text": "ich die Runde google noch. Aha ok. Sobald man das aktiviert kommt das mit dem Handshake"}, {"id": 250, "start": 2116.78, "end": 2123.54, "text": "fail. Ich aktiviere jetzt einfach alles. Ich aktiviere jetzt alles inklusive none. Mal"}, {"id": 251, "start": 2123.54, "end": 2131.22, "text": "gucken was passiert. Beim SSL hatte ich auch Probleme ja. Weil RSA deaktiviert war aber"}, {"id": 252, "start": 2131.22, "end": 2137.94, "text": "das muss jetzt ja was anderes sein. Oder kann in die ähnliche Richtung gehen. Ok also"}, {"id": 253, "start": 2137.94, "end": 2143.98, "text": "das ist es schon mal nicht. Aber wir haben eine neue Fehlermeldung nach der wir suchen"}, {"id": 254, "start": 2143.98, "end": 2161.3, "text": "können. Dotnet. No ciphers available. Guck mal wir finden. My SQL connector. Nee. Onkar."}, {"id": 255, "start": 2161.3, "end": 2169.98, "text": "No ciphers available. Ich hatte sowas schon mal. Ich bin mir aber nicht mehr sicher wie"}, {"id": 256, "start": 2169.98, "end": 2182.46, "text": "man den krempelt. Nein das ist OpenSSL. GitHub. Oh Gott. Ich mach also was ich nicht machen"}, {"id": 257, "start": 2182.46, "end": 2190.94, "text": "werde ist das hier. Ich werde definitiv nicht. Hier. Das werde ich nicht machen. Das sage"}, {"id": 258, "start": 2190.94, "end": 2204.98, "text": "ich euch. Das sehe ich nicht ein. Ich werde mir definitiv keine. Eigene. Jetzt blicke"}, {"id": 259, "start": 2204.98, "end": 2209.06, "text": "ich dann mal durch. Wir hatten doch eben irgendwo was wo sie geschrieben hat man soll sich eine"}, {"id": 260, "start": 2209.06, "end": 2222.5, "text": "eigene ciphers policy. Man soll sich eine eigene OpenSSL konf machen. Das sehe ich"}, {"id": 261, "start": 2222.5, "end": 2229.66, "text": "nicht ein. Hier. OpenSSL konf. Das mache ich nicht. Das kann es doch jemand der vielleicht"}, {"id": 262, "start": 2229.66, "end": 2235.26, "text": "das tool verwendet doch nicht zumuten. Ich bin eh der einzige der es verwendet. Das sehe"}, {"id": 263, "start": 2235.26, "end": 2241.58, "text": "ich nicht ein. Ich mache mir garantiert keine eigene OpenSSL konf weil dort nicht irgendwelche"}, {"id": 264, "start": 2241.58, "end": 2248.14, "text": "komischen default settings hat. Ok was haben die gesagt alternativ kann man cipher suites"}, {"id": 265, "start": 2248.14, "end": 2262.38, "text": "policy verwenden. Ok. Cipher suites policy http client. Wie setzt man das da. Aha. Sockets"}, {"id": 266, "start": 2262.38, "end": 2266.7, "text": "http händler. Aha was haben wir da denn. Der Ghost hat gepostet. Also da sind User die"}, {"id": 267, "start": 2266.7, "end": 2278.42, "text": "es nicht mal auf github gibt. SSL Client Authentification Options. Alter. Dass man für so einfachen"}, {"id": 268, "start": 2278.42, "end": 2284.54, "text": "Kram in den Untiefen wieder rum suchen muss ist doch absolut für ein Bobbles man. Also"}, {"id": 269, "start": 2284.54, "end": 2301.3, "text": "was machen die Dudes hier. SSL Client. Ok. Das machen wir hier rein. SSL Authentification"}, {"id": 270, "start": 2301.3, "end": 2305.7, "text": "Options. New cipher suites. Jetzt müssen wir bloß noch die cipher suites raus bekommen"}, {"id": 271, "start": 2305.7, "end": 2314.9, "text": "die wir brauchen. Sockets http händler. New sockets http händler http client. Ne das brauchen"}, {"id": 272, "start": 2314.9, "end": 2322.38, "text": "wir an der Stelle gar nicht. Kann man diesen Kram hier returnen anstatt den da unten. Ok"}, {"id": 273, "start": 2322.38, "end": 2328.14, "text": "das funktioniert. Das ist schon mal gut. Jetzt müssen wir nur raus bekommen was der"}, {"id": 274, "start": 2328.14, "end": 2335.9, "text": "für ciphers haben will das es funktioniert. Äh gleiche Fehlermeldung. Ok wie viele ciphers"}, {"id": 275, "start": 2335.9, "end": 2349.78, "text": "gibt es denn. Vielleicht können wir einfach try and error machen. Oh. Ähm ich hab ne"}, {"id": 276, "start": 2349.78, "end": 2355.5, "text": "andere Idee wir aktivieren einfach alle. Wir aktivieren einfach alle. Oder im Browser"}, {"id": 277, "start": 2355.5, "end": 2362.62, "text": "nachschauen. Ok. Zwei Sachen wir aktivieren einfach mal alle. Wir aktivieren einfach mal"}, {"id": 278, "start": 2362.62, "end": 2366.98, "text": "alle. Richtig 5 hat wusste ich auch lange Zeit nicht das es das gibt. Guck mal. Das"}, {"id": 279, "start": 2366.98, "end": 2372.5, "text": "ist ja ein Enum hier. Dieses tsl cipher suites. Wenn ihr eine Liste erzeugen wollt mit allen"}, {"id": 280, "start": 2372.5, "end": 2380.3, "text": "möglichen values für einen Enum geht das folgendermaßen. Enum. Ähm. Get values."}, {"id": 281, "start": 2380.3, "end": 2387.34, "text": "Und jetzt bekommt ihr eine Liste mit allen Enums da drinnen. Also das was das Ding frisst"}, {"id": 282, "start": 2387.34, "end": 2401.46, "text": "schauen wir mal ob es jetzt funktioniert. Oh man. Ah. Guckt mal. Das ist jetzt ein anderes"}, {"id": 283, "start": 2401.46, "end": 2405.66, "text": "Fehlermeldung. Das ist jetzt die Fehlermeldung was das Zertifikat nicht gültig ist. Das"}, {"id": 284, "start": 2405.66, "end": 2411.1, "text": "heißt die Cipher Geschichte haben wir um shift. Jetzt müssen wir dem Ding nur noch beibringen."}, {"id": 285, "start": 2411.1, "end": 2427.22, "text": "Wie man das Zertifikat accepten kann. Also vielleicht irgendwas mit SSL. Ne. Cert. Richtiger"}, {"id": 286, "start": 2427.22, "end": 2439.26, "text": "5 hat stream ja. Local Zertifikat. Remote Zertifikat validation check. Ich hab. Also"}, {"id": 287, "start": 2439.26, "end": 2449.38, "text": "ich benutze selten Methoden mit. Wie viele Buchstaben hat das. 36 Buchstaben alles klar."}, {"id": 288, "start": 2449.38, "end": 2453.22, "text": "Importier das doch einfach in deinen lokalen Zert Store. Nö. Da könnte ich mir genauso"}, {"id": 289, "start": 2453.22, "end": 2461.06, "text": "gut auch. Custom Open SSL Konfig anlegen. Das will ich nicht. Ok. Wie geht der Krempel."}, {"id": 290, "start": 2461.06, "end": 2476.66, "text": "Wie funktioniert das. Aha aha. New Validations. Die Termen da einfach true und gut ist. True"}, {"id": 291, "start": 2476.66, "end": 2505.82, "text": "Lul Lul W. Ob's. Nicht so machen. Noch mehr. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha. Ha."}, {"id": 292, "start": 2505.82, "end": 2523.02, "text": "Ok. Sekundeauto. So mijn das jetzt. Jetzt wissen wir Bescheid. Was. Ein Krampf mercy"}, {"id": 293, "start": 2523.02, "end": 2530.94, "text": "Euch anfallen kann ok nann Dann wrap ich ich das mal hier rein. Jetzt sagen wir einfach."}, {"id": 294, "start": 2530.94, "end": 2533.94, "text": "dass es auch ein bisschen sprechend ist am anfang"}, {"id": 295, "start": 2533.94, "end": 2538.94, "text": "global ignore third error"}, {"id": 296, "start": 2538.94, "end": 2541.94, "text": "dann weiß man gleich was passiert"}, {"id": 297, "start": 2541.94, "end": 2544.94, "text": "fix me im response ja da weißt du bescheid"}, {"id": 298, "start": 2544.94, "end": 2549.94, "text": "fix me remove this one after using user legacy code refactor"}, {"id": 299, "start": 2549.94, "end": 2552.94, "text": "ich sag euch mal eins das wird nie passieren"}, {"id": 300, "start": 2552.94, "end": 2555.94, "text": "die werden nie den user legacy code refactor"}, {"id": 301, "start": 2555.94, "end": 2562.94, "text": "jquery wir haben hier mit einem absolute bleeding edge hook"}, {"id": 302, "start": 2562.94, "end": 2567.94, "text": "modernstem modernstem GUI zu tun überhaupt ja sehe ich schon"}, {"id": 303, "start": 2567.94, "end": 2574.94, "text": "ist aber egal wir sind ja auf die api scharf und nicht etwa so sehr danach"}, {"id": 304, "start": 2574.94, "end": 2578.94, "text": "was denn jetzt da in denen ihr frontend passiert ist mir ehrlich gesagt ziemlich egal"}, {"id": 305, "start": 2578.94, "end": 2588.94, "text": "also gut response das sehe ich das richtig wir konnten uns jetzt anmelden"}, {"id": 306, "start": 2588.94, "end": 2591.94, "text": "hat das mit dem anmelden jetzt funktioniert wahrscheinlich"}, {"id": 307, "start": 2591.94, "end": 2595.94, "text": "ok jetzt brauchen wir unser tauchen unser tauchen bekommen wir"}, {"id": 308, "start": 2595.94, "end": 2597.94, "text": "ich muss mal kurz husten ich muss ausmachen"}, {"id": 309, "start": 2597.94, "end": 2611.94, "text": "ok so und jetzt brauchen wir unser tauchen das da und das bekommen wir mit"}, {"id": 310, "start": 2611.94, "end": 2617.94, "text": "dieser url underscore wahrscheinlich ist sachen mit underscore private api aber"}, {"id": 311, "start": 2617.94, "end": 2621.94, "text": "es gibt eh keine publik api also können wir auch eine private private api verwenden"}, {"id": 312, "start": 2621.94, "end": 2631.94, "text": "müsste ich jetzt nicht irgendein session cookie oder session header"}, {"id": 313, "start": 2631.94, "end": 2635.94, "text": "oder irgendwas zurückbekommen eigentlich"}, {"id": 314, "start": 2635.94, "end": 2643.94, "text": "den muss ich mir bestimmt merken den header six hat header headers"}, {"id": 315, "start": 2643.94, "end": 2653.94, "text": "for each header header"}, {"id": 316, "start": 2653.94, "end": 2667.94, "text": "schauen wir mal"}, {"id": 317, "start": 2667.94, "end": 2673.94, "text": "weird champ"}, {"id": 318, "start": 2673.94, "end": 2682.94, "text": "es gibt keinen session header oder sonst was"}, {"id": 319, "start": 2682.94, "end": 2700.94, "text": "woher weiß der denn jetzt dass ich eingeloggt bin"}, {"id": 320, "start": 2700.94, "end": 2717.94, "text": "cookie cookies cookies cookie name cookie value"}, {"id": 321, "start": 2717.94, "end": 2726.94, "text": "dass ich weiß wo es aufhört"}, {"id": 322, "start": 2726.94, "end": 2730.94, "text": "gibt keine cookie ja moment wie merkt er sich denn dann dass ich mich überhaupt"}, {"id": 323, "start": 2730.94, "end": 2737.94, "text": "korrekt eingeloggt habe vielleicht habe ich mich auch nicht korrekt eingeloggt"}, {"id": 324, "start": 2737.94, "end": 2744.94, "text": "der access point ist kann hell sehen der ist richtig high IQ machine learning"}, {"id": 325, "start": 2744.94, "end": 2748.94, "text": "trainiert egal wir machen einfach mal weiter in der hoffnung das funktioniert"}, {"id": 326, "start": 2748.94, "end": 2753.94, "text": "jetzt also so also response das ignorieren wir mal ich weiß nicht was ich"}, {"id": 327, "start": 2753.94, "end": 2763.94, "text": "damit machen soll und jetzt brauchen wir einen weiteren get request auf auf"}, {"id": 328, "start": 2763.94, "end": 2772.94, "text": "jsp oder auf csrf token war"}, {"id": 329, "start": 2772.94, "end": 2783.94, "text": "string cv alter warum kann er mein makro für die konsole nicht"}, {"id": 330, "start": 2783.94, "end": 2790.94, "text": "so run mal gucken was wir zurück bekommen"}, {"id": 331, "start": 2790.94, "end": 2800.94, "text": "ich sagte wir bekommen javascript in xml zurück"}, {"id": 332, "start": 2800.94, "end": 2808.94, "text": "bzw in html aber html ist ja quasi xml so was zum geil was ist das für eine"}, {"id": 333, "start": 2808.94, "end": 2814.94, "text": "bescheuerte response was ist das für eine beschissene response alter den script"}, {"id": 334, "start": 2814.94, "end": 2820.94, "text": "hack return aber man normalerweise würde ich sagen was haben die china chinesen da"}, {"id": 335, "start": 2820.94, "end": 2827.94, "text": "programmiert aber das waren gar nicht die china chinesen"}, {"id": 336, "start": 2827.94, "end": 2832.94, "text": "kann man da irgendwie sagen content typ oder so"}, {"id": 337, "start": 2832.94, "end": 2843.94, "text": "content content media irgendwie"}, {"id": 338, "start": 2843.94, "end": 2849.94, "text": "dass ich dann sagen kann irgendwie content type"}, {"id": 339, "start": 2849.94, "end": 2862.94, "text": "application json gucken ob das funktioniert"}, {"id": 340, "start": 2862.94, "end": 2869.94, "text": "wobei nie das ist was ich sende oder wie gibt es einen header mit was was was"}, {"id": 341, "start": 2869.94, "end": 2874.94, "text": "die erlaubte response ist wer das programmiert"}, {"id": 342, "start": 2874.94, "end": 2880.94, "text": "except header except"}, {"id": 343, "start": 2880.94, "end": 2884.94, "text": "einfach so"}, {"id": 344, "start": 2884.94, "end": 2890.94, "text": "okay ist egal kommt kommt immer das gleiche zurück"}, {"id": 345, "start": 2890.94, "end": 2896.94, "text": "also da müssen wir das jetzt irgendwie hasen das ist an der stelle tatsächlich"}, {"id": 346, "start": 2896.94, "end": 2901.94, "text": "sogar noch relativ einfach guck mal wir bekommen hier zurück in den javascript"}, {"id": 347, "start": 2901.94, "end": 2912.94, "text": "hack das können wir alles ignorieren wir sagen einfach response split split am"}, {"id": 348, "start": 2912.94, "end": 2921.94, "text": "am gleichheitszeichen"}, {"id": 349, "start": 2921.94, "end": 2925.94, "text": "und dann"}, {"id": 350, "start": 2925.94, "end": 2929.94, "text": "das zweite weil also wenn wir am gleichheitszeichen splitten dann ist das"}, {"id": 351, "start": 2929.94, "end": 2935.94, "text": "hier das nullte element und das ist das erste element und dann einfach das"}, {"id": 352, "start": 2935.94, "end": 2940.94, "text": "1 2 3 4 5 6 in dem moment das muss man mit zählen"}, {"id": 353, "start": 2940.94, "end": 2947.94, "text": "1 2 2 ne 1 weil bei null"}, {"id": 354, "start": 2947.94, "end": 2954.94, "text": "ab dem zweiten zeich also ab dem dritten zeichen bis zum"}, {"id": 355, "start": 2954.94, "end": 2963.94, "text": "1 2 3 4 5 6 7 8 9 10"}, {"id": 356, "start": 2963.94, "end": 2971.94, "text": "hatte der nicht sowas hier drin stehen"}, {"id": 357, "start": 2971.94, "end": 2976.94, "text": "12 alles klar 12"}, {"id": 358, "start": 2976.94, "end": 2981.94, "text": "kannst auch gleich am quotes richtig wir können bei den quotes"}, {"id": 359, "start": 2981.94, "end": 2986.94, "text": "split da hast du vollkommen recht noch besser ja hast recht ist noch besser"}, {"id": 360, "start": 2986.94, "end": 2989.94, "text": "aber wir haben es auch so schon aber du hast recht wir können an den quotes"}, {"id": 361, "start": 2989.94, "end": 2994.94, "text": "das ist eigentlich noch viel viel sinnvoller wir splitten an den quotes"}, {"id": 362, "start": 2994.94, "end": 3007.94, "text": "kann man eigentlich sowas hier machen"}, {"id": 363, "start": 3007.94, "end": 3011.94, "text": "chat ist wieder richtig feifert so wenn wir splitten an den quotes dann ist es"}, {"id": 364, "start": 3011.94, "end": 3016.94, "text": "nämlich direkt 0 bis 8 oder so also anfangen bis"}, {"id": 365, "start": 3016.94, "end": 3034.94, "text": "nicht bis 12 dann bis 10 10 was"}, {"id": 366, "start": 3034.94, "end": 3044.94, "text": "so habe ich doch gerade weggemacht ok alles klar gut"}, {"id": 367, "start": 3044.94, "end": 3046.94, "text": "man könnte jetzt sogar noch so man könnte jetzt noch weitergehen an der"}, {"id": 368, "start": 3046.94, "end": 3051.94, "text": "stelle eins kann man noch sagen last"}, {"id": 369, "start": 3051.94, "end": 3056.94, "text": "weil das ist dann auch nicht schöner ne wobei last geht an der stelle nicht eins"}, {"id": 370, "start": 3056.94, "end": 3060.94, "text": "wir brauchen das in der mitte wobei leute das geht so ich lasse es jetzt so"}, {"id": 371, "start": 3060.94, "end": 3069.94, "text": "also das hier ist unser du kannst auch zwei von den auch noch besser noch noch"}, {"id": 372, "start": 3069.94, "end": 3074.94, "text": "sichs hättiger also das hier ist jetzt mein cross"}, {"id": 373, "start": 3074.94, "end": 3090.94, "text": "request und die wir um sind die wörter da drinne cross seit s cf er heißt es nicht"}, {"id": 374, "start": 3090.94, "end": 3101.94, "text": "ist doch richtig richtig so klappt token und jetzt so gut so kann er mal"}, {"id": 375, "start": 3101.94, "end": 3106.94, "text": "ordentlich meine sachen expanden hier anstatt mir das einzufügen der rüpel"}, {"id": 376, "start": 3106.94, "end": 3111.94, "text": "danke für den zapp"}, {"id": 377, "start": 3111.94, "end": 3117.94, "text": "oder ist es cf"}, {"id": 378, "start": 3117.94, "end": 3130.94, "text": "haben die sich da auch noch verschrieben drinne oder was"}, {"id": 379, "start": 3130.94, "end": 3135.94, "text": "die haben sich die haben sich die haben sich verschrieben oder also das lässt"}, {"id": 380, "start": 3135.94, "end": 3144.94, "text": "mir sehr viel mut macht mir das für diese tolle für diesen access point"}, {"id": 381, "start": 3144.94, "end": 3149.94, "text": "also korrekt korrekt heißt das ding"}, {"id": 382, "start": 3149.94, "end": 3164.94, "text": "c s f"}, {"id": 383, "start": 3164.94, "end": 3168.94, "text": "ist richtig geschrieben ja okay jetzt haben wir unser token was passiert denn"}, {"id": 384, "start": 3168.94, "end": 3172.94, "text": "jetzt wenn ich das tauchen anfordere ohne mich vorher eingeloggt zu haben ich"}, {"id": 385, "start": 3172.94, "end": 3179.94, "text": "würde sagen den error wahrscheinlich bei ich immer noch nicht ok wenn ich mich"}, {"id": 386, "start": 3179.94, "end": 3183.94, "text": "vorher nicht eingeloggt habe dann gibt es keine response aber was ich immer noch"}, {"id": 387, "start": 3183.94, "end": 3186.94, "text": "nicht gecheckt habe ist wie dass ich das merkt"}, {"id": 388, "start": 3186.94, "end": 3192.94, "text": "der muss hier irgendwelche cookies setzen aber er hat keine cookies"}, {"id": 389, "start": 3192.94, "end": 3206.94, "text": "was zwei von hinten noch besser katschi bass ne stimmt nicht eins von hinten"}, {"id": 390, "start": 3206.94, "end": 3213.94, "text": "ne moment ich brauch das gar nicht oder weil da nachher noch ein quote kommt"}, {"id": 391, "start": 3213.94, "end": 3218.94, "text": "dass so müsste es doch eigentlich reichen"}, {"id": 392, "start": 3218.94, "end": 3224.94, "text": "das ist unnötig obfuscated"}, {"id": 393, "start": 3224.94, "end": 3228.94, "text": "so jetzt haben wir unser token hier"}, {"id": 394, "start": 3228.94, "end": 3233.94, "text": "ja der chat hat es natürlich schon wieder fünf meter gegen fünf kilometer"}, {"id": 395, "start": 3233.94, "end": 3236.94, "text": "gegen den wind gesehen alles klar"}, {"id": 396, "start": 3236.94, "end": 3243.94, "text": "so alles klar gut schön wunderbar"}, {"id": 397, "start": 3243.94, "end": 3252.94, "text": "jetzt habe ich mein token und wie geht es weiter"}, {"id": 398, "start": 3252.94, "end": 3260.94, "text": "get system information"}, {"id": 399, "start": 3260.94, "end": 3274.94, "text": "aha dann muss man das hier setzen als als herdo"}, {"id": 400, "start": 3274.94, "end": 3278.94, "text": "kann ich nicht"}, {"id": 401, "start": 3278.94, "end": 3290.94, "text": "ne kann ich nicht dass man das kann das ding wie die folgt die folgt hätte hätte"}, {"id": 402, "start": 3290.94, "end": 3294.94, "text": "global settings hätte"}, {"id": 403, "start": 3294.94, "end": 3304.94, "text": "die folgt hätte müsste ich jetzt setzen können das wäre natürlich sehr praktisch"}, {"id": 404, "start": 3304.94, "end": 3319.94, "text": "wie heißt der krempel noch die folgt hätte"}, {"id": 405, "start": 3319.94, "end": 3322.94, "text": "also jetzt müssen wir das ja bei jedem request dabei schreiben na gut gibt"}, {"id": 406, "start": 3322.94, "end": 3325.94, "text": "schlimmeres"}, {"id": 407, "start": 3325.94, "end": 3329.94, "text": "so system settings wobei will ich system settings überhaupt abrufen nicht dass"}, {"id": 408, "start": 3329.94, "end": 3331.94, "text": "ich jetzt vielleicht wirklich irgendwelche sachen liege die ich nicht"}, {"id": 409, "start": 3331.94, "end": 3334.94, "text": "liegen will"}, {"id": 410, "start": 3334.94, "end": 3336.94, "text": "weil was soll ich nicht ich gesetzt in excess poinina im stream was soll"}, {"id": 411, "start": 3336.94, "end": 3346.94, "text": "passieren"}, {"id": 412, "start": 3346.94, "end": 3350.94, "text": "was soll passieren"}, {"id": 413, "start": 3350.94, "end": 3354.94, "text": "jetzt kommt xml leute xml in"}, {"id": 414, "start": 3354.94, "end": 3361.94, "text": "weißt ihr was scheiß drauf wir machen kein wir machen kein get stats wir gucken"}, {"id": 415, "start": 3361.94, "end": 3365.94, "text": "admin"}, {"id": 416, "start": 3365.94, "end": 3376.94, "text": "wir gucken was der was der schickt weil was ich eigentlich machen will ist"}, {"id": 417, "start": 3376.94, "end": 3383.94, "text": "aufgeploppte da geht mir auch auf dem fix was ich eigentlich machen will ist"}, {"id": 418, "start": 3383.94, "end": 3387.94, "text": "mit die user auflisten lassen nicht die nicht diese user hier sondern die dpsk"}, {"id": 419, "start": 3387.94, "end": 3390.94, "text": "user"}, {"id": 420, "start": 3390.94, "end": 3393.94, "text": "wenn ich hier drauf klicke sollte das ja eigentlich laden"}, {"id": 421, "start": 3393.94, "end": 3396.94, "text": "konf"}, {"id": 422, "start": 3396.94, "end": 3400.94, "text": "request get konf"}, {"id": 423, "start": 3400.94, "end": 3403.94, "text": "response"}, {"id": 424, "start": 3403.94, "end": 3413.94, "text": "möchte da unten drauf"}, {"id": 425, "start": 3413.94, "end": 3435.94, "text": "gott blieb"}, {"id": 426, "start": 3435.94, "end": 3440.94, "text": "das ist das pass das ist das die pass phrase von meinem wlan"}, {"id": 427, "start": 3440.94, "end": 3443.94, "text": "das wollte ich nicht haben"}, {"id": 428, "start": 3443.94, "end": 3446.94, "text": "ich will die pass phrase von den usern haben"}, {"id": 429, "start": 3446.94, "end": 3451.94, "text": "konf"}, {"id": 430, "start": 3451.94, "end": 3455.94, "text": "also ich will ich will eine liste mit usern haben"}, {"id": 431, "start": 3455.94, "end": 3462.94, "text": "alter warum geht das immer weg wenn ich da drauf klicke"}, {"id": 432, "start": 3462.94, "end": 3465.94, "text": "pains champ"}, {"id": 433, "start": 3465.94, "end": 3468.94, "text": "hier"}, {"id": 434, "start": 3468.94, "end": 3472.94, "text": "request"}, {"id": 435, "start": 3472.94, "end": 3476.94, "text": "so kann man sich das doch nicht angucken"}, {"id": 436, "start": 3476.94, "end": 3482.94, "text": "guck mal das ist verbackt"}, {"id": 437, "start": 3482.94, "end": 3489.94, "text": "ne das ist der access point"}, {"id": 438, "start": 3489.94, "end": 3492.94, "text": "ja"}, {"id": 439, "start": 3492.94, "end": 3495.94, "text": "wie soll man das jetzt bedienen man"}, {"id": 440, "start": 3495.94, "end": 3498.94, "text": "dpsk list das sieht gut aus"}, {"id": 441, "start": 3498.94, "end": 3500.94, "text": "dpsk list"}, {"id": 442, "start": 3500.94, "end": 3505.94, "text": "ja hier sind die user alles klar die user die brauche ich"}, {"id": 443, "start": 3505.94, "end": 3508.94, "text": "pass phrase"}, {"id": 444, "start": 3508.94, "end": 3510.94, "text": "ip address"}, {"id": 445, "start": 3510.94, "end": 3512.94, "text": "ip address"}, {"id": 446, "start": 3512.94, "end": 3516.94, "text": "man kann sogar die ip auslesen das ist ja nice"}, {"id": 447, "start": 3516.94, "end": 3520.94, "text": "das sehe ich dann aber nur wenn einer verbunden ist da drin da sehe ich auch gleich"}, {"id": 448, "start": 3520.94, "end": 3523.94, "text": "was der für eine ip hat"}, {"id": 449, "start": 3523.94, "end": 3531.94, "text": "das ist nur das ist gut"}, {"id": 450, "start": 3531.94, "end": 3535.94, "text": "wlan id wlan id"}, {"id": 451, "start": 3535.94, "end": 3539.94, "text": "aber die kann man dann auch direkt da drüber setzen ja das ist nice da kann"}, {"id": 452, "start": 3539.94, "end": 3542.94, "text": "sogar mein tool dann mehr als das web interface"}, {"id": 453, "start": 3542.94, "end": 3545.94, "text": "start point pass phrase"}, {"id": 454, "start": 3545.94, "end": 3550.94, "text": "ja du ich glaube aber sind gar keine java server pages weil das ist irgendwie"}, {"id": 455, "start": 3550.94, "end": 3553.94, "text": "ich glaube nicht dass sie da java drauf laufen haben ich glaube das ist jebait"}, {"id": 456, "start": 3553.94, "end": 3557.94, "text": "also request was müssen wir für den request machen dass wir das bekommen"}, {"id": 457, "start": 3557.94, "end": 3560.94, "text": "get stat updater"}, {"id": 458, "start": 3560.94, "end": 3565.94, "text": "und dann habe ich als response"}, {"id": 459, "start": 3565.94, "end": 3567.94, "text": "was"}, {"id": 460, "start": 3567.94, "end": 3568.94, "text": "alter"}, {"id": 461, "start": 3568.94, "end": 3575.94, "text": "wer hat sich das ausgedacht"}, {"id": 462, "start": 3575.94, "end": 3578.94, "text": "schon wie die wlan die wlan performance ist richtig gut"}, {"id": 463, "start": 3578.94, "end": 3581.94, "text": "ich habe gestern das ganze mal angeschaltet"}, {"id": 464, "start": 3581.94, "end": 3582.94, "text": "ich habe"}, {"id": 465, "start": 3582.94, "end": 3585.94, "text": "mein altes wlan auf vergessen geklickt beim handy"}, {"id": 466, "start": 3585.94, "end": 3588.94, "text": "und ich bin also aktuell ist es so"}, {"id": 467, "start": 3588.94, "end": 3591.94, "text": "ich komme mit dem wlan bis in garten"}, {"id": 468, "start": 3591.94, "end": 3593.94, "text": "mit vier access points"}, {"id": 469, "start": 3593.94, "end": 3597.94, "text": "access point im keller, access point im erster stock, access point im erdgeschoss"}, {"id": 470, "start": 3597.94, "end": 3600.94, "text": "access point neben mir auf die seite zur terrasse"}, {"id": 471, "start": 3600.94, "end": 3602.94, "text": "ich habe gestern eingeschaltet ich hatte"}, {"id": 472, "start": 3602.94, "end": 3607.94, "text": "überragenden speed ich meine das ist kein wifi 6 nur wifi 5 access point"}, {"id": 473, "start": 3607.94, "end": 3610.94, "text": "äh 3 400 mbit"}, {"id": 474, "start": 3610.94, "end": 3617.94, "text": "und das bis an eingang also bis die terrasse runter"}, {"id": 475, "start": 3617.94, "end": 3621.94, "text": "mit einem access point nicht mit vier"}, {"id": 476, "start": 3621.94, "end": 3625.94, "text": "also die wlan performance ist wirklich gut"}, {"id": 477, "start": 3625.94, "end": 3630.94, "text": "so also das müssen wir da jetzt schicken oder wie"}, {"id": 478, "start": 3630.94, "end": 3635.94, "text": "also leute wir müssen jetzt xml zeug schicken jetzt wirds"}, {"id": 479, "start": 3635.94, "end": 3638.94, "text": "jetzt wirds eklig"}, {"id": 480, "start": 3638.94, "end": 3641.94, "text": "so das können wir uns glaube ich wahrscheinlich sparen"}, {"id": 481, "start": 3641.94, "end": 3646.94, "text": "get stat dpsk list power"}, {"id": 482, "start": 3646.94, "end": 3656.94, "text": "ob irgendjemand diesen kram schon mal irgendwo gemapped hat im internet"}, {"id": 483, "start": 3656.94, "end": 3664.94, "text": "aha"}, {"id": 484, "start": 3664.94, "end": 3674.94, "text": "aha"}, {"id": 485, "start": 3674.94, "end": 3685.94, "text": "so so"}, {"id": 486, "start": 3685.94, "end": 3689.94, "text": "da haben auch schon ein paar andere leute dran geforscht"}, {"id": 487, "start": 3689.94, "end": 3693.94, "text": "wie heißt der access point das ist eine rugus"}, {"id": 488, "start": 3693.94, "end": 3696.94, "text": "r710"}, {"id": 489, "start": 3696.94, "end": 3698.94, "text": "lass dich nicht abschrecken von dem neupreis"}, {"id": 490, "start": 3698.94, "end": 3702.94, "text": "der neupreis würde so halt keiner mehr kaufen weil das ist die letzte generation nicht die aktuelle"}, {"id": 491, "start": 3702.94, "end": 3705.94, "text": "die aktuelle generation ist der r750"}, {"id": 492, "start": 3705.94, "end": 3710.94, "text": "der r750 gibt es für 1242 also ein schnapper"}, {"id": 493, "start": 3710.94, "end": 3712.94, "text": "du musst auf ebay gucken"}, {"id": 494, "start": 3712.94, "end": 3715.94, "text": "schauen wir mal ebay"}, {"id": 495, "start": 3715.94, "end": 3722.94, "text": "also ich habe irgendwie 260 270 euro für bezahlt"}, {"id": 496, "start": 3722.94, "end": 3724.94, "text": "aus vereinigte staaten"}, {"id": 497, "start": 3724.94, "end": 3726.94, "text": "nee"}, {"id": 498, "start": 3726.94, "end": 3729.94, "text": "ich mein kann man machen aber guckt euch mal den versand an"}, {"id": 499, "start": 3729.94, "end": 3732.94, "text": "das will man wahrscheinlich nicht haben"}, {"id": 500, "start": 3732.94, "end": 3737.94, "text": "ok neu eingestellt"}, {"id": 501, "start": 3737.94, "end": 3745.94, "text": "405 alter was ist denn mit euch los was ist denn mit euch jetzt verkehrt"}, {"id": 502, "start": 3745.94, "end": 3746.94, "text": "guck mal da"}, {"id": 503, "start": 3746.94, "end": 3751.94, "text": "aus großbritannien dran aber 376 also wie gesagt ich habe 270 euro bezahlt"}, {"id": 504, "start": 3751.94, "end": 3756.94, "text": "was kann er mehr als 61 euro access point einiges"}, {"id": 505, "start": 3756.94, "end": 3758.94, "text": "kann jetzt schlecht alles aufzählen"}, {"id": 506, "start": 3758.94, "end": 3761.94, "text": "haben wir uns gestern im stream alles angeguckt"}, {"id": 507, "start": 3761.94, "end": 3771.94, "text": "der kann zum beispiel eines der features die ich ja persönlich mega nice finde"}, {"id": 508, "start": 3771.94, "end": 3773.94, "text": "und musst du kurz was trinken"}, {"id": 509, "start": 3773.94, "end": 3776.94, "text": "eines der features die ich ja persönlich mega nice finde ist"}, {"id": 510, "start": 3776.94, "end": 3779.94, "text": "dass der passwörter kann für jedes pro gerät"}, {"id": 511, "start": 3779.94, "end": 3783.94, "text": "also kannst quasi ein wlan aufmachen"}, {"id": 512, "start": 3783.94, "end": 3786.94, "text": "und jedem gerät ein eigenes wlan passwort geben"}, {"id": 513, "start": 3786.94, "end": 3792.94, "text": "was du dann löscht wenn du das gerät weg schmeißt"}, {"id": 514, "start": 3792.94, "end": 3794.94, "text": "unify habe ich aktuell"}, {"id": 515, "start": 3794.94, "end": 3796.94, "text": "mal kurz darauf einzugehen"}, {"id": 516, "start": 3796.94, "end": 3800.94, "text": "also unify habe ich aktuell aber da bin ich an einigen stellen nicht so wirklich damit zufrieden"}, {"id": 517, "start": 3800.94, "end": 3805.94, "text": "vor allem dass sie sich dagegen sträuben schon seit jahren"}, {"id": 518, "start": 3805.94, "end": 3810.94, "text": "eben das zuletzt genannte feature einzubauen dass man unterschiedlichen geräten"}, {"id": 519, "start": 3810.94, "end": 3812.94, "text": "unterschiedliche passwörter geben kann"}, {"id": 520, "start": 3812.94, "end": 3814.94, "text": "und ich rede nicht von wpi enterprise"}, {"id": 521, "start": 3814.94, "end": 3819.94, "text": "sondern von iot geräten die kein wpi enterprise können"}, {"id": 522, "start": 3819.94, "end": 3824.94, "text": "dann das kann fast jeder mittlerweile"}, {"id": 523, "start": 3824.94, "end": 3826.94, "text": "mikrotik kanns"}, {"id": 524, "start": 3826.94, "end": 3828.94, "text": "rakus kanns"}, {"id": 525, "start": 3828.94, "end": 3830.94, "text": "cisco kanns"}, {"id": 526, "start": 3830.94, "end": 3833.94, "text": "aruba kanns aber die haben andere probleme"}, {"id": 527, "start": 3833.94, "end": 3835.94, "text": "und warum nicht von cisco"}, {"id": 528, "start": 3835.94, "end": 3839.94, "text": "weil cisco den krempel nur in zusammenhang mit irgendeiner komischen network appliance von ihnen kann"}, {"id": 529, "start": 3839.94, "end": 3843.94, "text": "und aruba ähnlich da brauchst du irgendeine cloud"}, {"id": 530, "start": 3843.94, "end": 3846.94, "text": "clearpass cloud lizenz oder sowas"}, {"id": 531, "start": 3846.94, "end": 3848.94, "text": "dass das funktioniert"}, {"id": 532, "start": 3848.94, "end": 3850.94, "text": "und sozige gesachen"}, {"id": 533, "start": 3850.94, "end": 3853.94, "text": "und preisleistungstechnisch und"}, {"id": 534, "start": 3853.94, "end": 3858.94, "text": "handlingstechnisch war das ding das beste was ich gefunden habe"}, {"id": 535, "start": 3858.94, "end": 3862.94, "text": "zumal man die ohne controller betreiben kann mit der unleashed firmware"}, {"id": 536, "start": 3862.94, "end": 3864.94, "text": "für alle anderen mann controller brauchen"}, {"id": 537, "start": 3864.94, "end": 3870.94, "text": "ich bin nicht so scharf drauf für einen access point noch einen controller daneben zu stellen"}, {"id": 538, "start": 3870.94, "end": 3874.94, "text": "ok also jetzt probieren wir das mal aus"}, {"id": 539, "start": 3874.94, "end": 3878.94, "text": "ja er kann vor allem mehr als 60 euro kosten das das stimmt"}, {"id": 540, "start": 3878.94, "end": 3881.94, "text": "wobei das unify auch kann ganz ehrlich"}, {"id": 541, "start": 3881.94, "end": 3887.94, "text": "ein neuer unify access point oder gebraucht hier ein für 260 270 würde ich sofort den nehmen"}, {"id": 542, "start": 3887.94, "end": 3892.94, "text": "ok aber also ihr könnt euch entweder ein r710 oder ein r610 kaufen"}, {"id": 543, "start": 3892.94, "end": 3897.94, "text": "ich würde keine wirklich aber nicht für den preis nicht für die preise leute"}, {"id": 544, "start": 3897.94, "end": 3901.94, "text": "wie gesagt ich habe 260 270 euro irgendwie dem dreh bezahlt"}, {"id": 545, "start": 3901.94, "end": 3907.94, "text": "da muss man muss man ein bisschen abwarten und gucken"}, {"id": 546, "start": 3907.94, "end": 3911.94, "text": "man kann auch mal gucken ob es r720 gibt aber es macht eh keinen großen unterschied"}, {"id": 547, "start": 3911.94, "end": 3918.94, "text": "ne das wird schon zu teuer das muss man einfach mal abwarten"}, {"id": 548, "start": 3918.94, "end": 3923.94, "text": "einfach abwarten bis es gute angebote gibt und dann zuschlagen"}, {"id": 549, "start": 3923.94, "end": 3932.94, "text": "also wie gesagt unter 300 euro ist ein guter preis dafür"}, {"id": 550, "start": 3932.94, "end": 3937.94, "text": "und die dinger sind obwohl sie quasi jetzt nicht mehr verkauft werden weil die schon ein nachfolgerprodukt haben"}, {"id": 551, "start": 3937.94, "end": 3942.94, "text": "trotzdem sehr sehr nice"}, {"id": 552, "start": 3942.94, "end": 3946.94, "text": "so wie schicken wir denn jetzt hier einen request"}, {"id": 553, "start": 3946.94, "end": 3951.94, "text": "get stats dpsk list"}, {"id": 554, "start": 3951.94, "end": 3954.94, "text": "was muss ich dann aufrufen leute das habe ich hier schon zugemacht"}, {"id": 555, "start": 3954.94, "end": 3961.94, "text": "wo waren wir denn hier cmd stat jsp muss ich aufrufen"}, {"id": 556, "start": 3961.94, "end": 3969.94, "text": "also ok jetzt wirds jetzt wirds spannend"}, {"id": 557, "start": 3969.94, "end": 3977.94, "text": "cmd cmd stat punkt stats stat jsp"}, {"id": 558, "start": 3977.94, "end": 3986.94, "text": "so und ich will nicht get string sondern post"}, {"id": 559, "start": 3986.94, "end": 3994.94, "text": "post will ich wahrscheinlich einfach nur machen und jetzt will ich ihm sagen http content"}, {"id": 560, "start": 3994.94, "end": 4002.94, "text": "also new string content und zwar will ich ihm habe ich das hier nicht eingestellt immer"}, {"id": 561, "start": 4002.94, "end": 4009.94, "text": "im rider das alt und moment das muss ich mal kurz einstellen"}, {"id": 562, "start": 4009.94, "end": 4019.94, "text": "shortcuts keyboard shortcuts"}, {"id": 563, "start": 4019.94, "end": 4029.94, "text": "ich möchte move line up line"}, {"id": 564, "start": 4029.94, "end": 4034.94, "text": "siehts irgendjemand move line"}, {"id": 565, "start": 4034.94, "end": 4046.94, "text": "wenns irgendjemand sieht sagt mir bescheid"}, {"id": 566, "start": 4046.94, "end": 4052.94, "text": "move line up"}, {"id": 567, "start": 4052.94, "end": 4058.94, "text": "move line up genau keyboard shortcut"}, {"id": 568, "start": 4058.94, "end": 4066.94, "text": "alt file up ist dafür schon ja das ist mir egal"}, {"id": 569, "start": 4066.94, "end": 4074.94, "text": "yes und jetzt edge down"}, {"id": 570, "start": 4074.94, "end": 4081.94, "text": "ja viel besser so also new string content wir wollen das xml posten"}, {"id": 571, "start": 4081.94, "end": 4085.94, "text": "kein encoding mit schicken soll er standardmäßig machen was auch immer er will"}, {"id": 572, "start": 4085.94, "end": 4091.94, "text": "und jetzt wollen wir ihm sagen das ist weiß jemand zufällig aus dem kopf den"}, {"id": 573, "start": 4091.94, "end": 4100.94, "text": "den mime type xml ist es application xml"}, {"id": 574, "start": 4100.94, "end": 4107.94, "text": "xml warum sie schab und nicht javascript warum nicht pisen warum nicht rust warum nicht go"}, {"id": 575, "start": 4107.94, "end": 4112.94, "text": "kannst du genauso gut fragen hat keinen tieferen grund außer dass ich gerne"}, {"id": 576, "start": 4112.94, "end": 4118.94, "text": "sich habe moment text xml und was war das andere application"}, {"id": 577, "start": 4118.94, "end": 4124.94, "text": "xml aha moment was nehmen die denn hier xml hier"}, {"id": 578, "start": 4124.94, "end": 4128.94, "text": "nehmen sie text xml was sagt denn mein browser was macht denn mein browser"}, {"id": 579, "start": 4128.94, "end": 4144.94, "text": "beim request header request header content type"}, {"id": 580, "start": 4144.94, "end": 4155.94, "text": "what er sagt es ist form es ist eine form aber es ist überhaupt keine form"}, {"id": 581, "start": 4155.94, "end": 4159.94, "text": "komm und hier hat er doch einen session cookie gesetzt warum hat er denn sonst"}, {"id": 582, "start": 4159.94, "end": 4164.94, "text": "kein cookie bei mir gehabt vorhin"}, {"id": 583, "start": 4164.94, "end": 4169.94, "text": "nur mal dass ich das richtig verstehe die halten sich selbst nicht dran es ist"}, {"id": 584, "start": 4169.94, "end": 4175.94, "text": "angeblich hier eine unencoded form und es ist offensichtlich keine unencoded"}, {"id": 585, "start": 4175.94, "end": 4182.94, "text": "form sondern xml string na geil alter da kann ich auch application xml"}, {"id": 586, "start": 4182.94, "end": 4187.94, "text": "setzen wird wahrscheinlich egal sein ok ich sechs ich setze text xml weil das"}, {"id": 587, "start": 4187.94, "end": 4195.94, "text": "beispiel auch text xml macht und wo ist jetzt das problem"}, {"id": 588, "start": 4195.94, "end": 4214.94, "text": "ok gut das heißt es hat nicht response und rasp headers get string einfach"}, {"id": 589, "start": 4214.94, "end": 4219.94, "text": "noch mal gucken ob das funktioniert run"}, {"id": 590, "start": 4219.94, "end": 4226.94, "text": "fack ich muss das tauchen ich muss ich muss das des dieses dieses tauchen ja"}, {"id": 591, "start": 4226.94, "end": 4228.94, "text": "dann auch irgendwie setzen sonst bin ich ja bin ich ja gar nicht"}, {"id": 592, "start": 4228.94, "end": 4234.94, "text": "authentifiziert oder identifiziert schon aber nicht so wie er das haben will"}, {"id": 593, "start": 4234.94, "end": 4240.94, "text": "wie heißt der header hier c ok also muss ich jetzt hier noch zusätzlich sagen"}, {"id": 594, "start": 4240.94, "end": 4252.94, "text": "ich möchte noch hätte etten ette header x cs f tauchen cs f tauchen und jetzt"}, {"id": 595, "start": 4252.94, "end": 4264.94, "text": "bäm please praege praege das immer nice massive xml response alter"}, {"id": 596, "start": 4264.94, "end": 4271.94, "text": "leute wir haben jetzt zwei sachen die wir machen können entweder"}, {"id": 597, "start": 4271.94, "end": 4282.94, "text": "wenn xml parser und passen aus dem xml den ganzen krempel raus oder wir machen"}, {"id": 598, "start": 4282.94, "end": 4293.94, "text": "das sowie der typ hier und konvertieren das xml zu jason und bearbeiten das"}, {"id": 599, "start": 4293.94, "end": 4298.94, "text": "dann somit reggex reggex ist auch noch eine möglichkeit vielleicht ist das mit"}, {"id": 600, "start": 4298.94, "end": 4307.94, "text": "reggex gar keine so schlechte idee leute kennt irgendjemand einen schönen einen"}, {"id": 601, "start": 4307.94, "end": 4314.94, "text": "schönen xml format für commander zeile oder xml format bestes geht auch"}, {"id": 602, "start": 4314.94, "end": 4325.94, "text": "bestimmt relativ von pretty pretty print xml lind xml lind das du mal hier"}, {"id": 603, "start": 4325.94, "end": 4328.94, "text": "habe ich das überhaupt installiert"}, {"id": 604, "start": 4332.94, "end": 4338.94, "text": "minus minus format habe ich witzigerweise installiert ich weiß ehrlich gesagt nicht"}, {"id": 605, "start": 4338.94, "end": 4340.94, "text": "warum aber ok"}, {"id": 606, "start": 4340.94, "end": 4345.94, "text": "es ist noch nicht mal gültiges xml"}, {"id": 607, "start": 4350.94, "end": 4356.94, "text": "es ist noch nicht mal gültiges xml meine güte was haben die da programmiert"}, {"id": 608, "start": 4356.94, "end": 4370.94, "text": "man was ist das ok ok ich habe ich habe nichts gesagt ist ok ich habe nichts"}, {"id": 609, "start": 4370.94, "end": 4373.94, "text": "gesagt es ist alles in ordnung nicht nichts schlimmes ich bin ich printe das"}, {"id": 610, "start": 4373.94, "end": 4389.94, "text": "ja selbst ok ok leute wir könnten wir könnten reggexen wir könnten reggexen"}, {"id": 611, "start": 4389.94, "end": 4404.94, "text": "massive da braucht aber den massive 5 hat reggex hier dafür ok reggex wir können es"}, {"id": 612, "start": 4404.94, "end": 4407.94, "text": "auch lassen ja was ist ich bin mir jetzt gar nicht sicher"}, {"id": 613, "start": 4407.94, "end": 4414.94, "text": "also wir haben wir haben drei varianten so wie ich das sehe xml parser benutzen in"}, {"id": 614, "start": 4414.94, "end": 4421.94, "text": "dotnet eingebaut xml in jason konvertieren oder reggex rauskrabben"}, {"id": 615, "start": 4421.94, "end": 4428.94, "text": "wir kommen wir machen mal test string so rum also also komm also reggex skills"}, {"id": 616, "start": 4428.94, "end": 4431.94, "text": "das ist doch gar nicht so schwierig das sieht doch gar nicht so schwierig aus"}, {"id": 617, "start": 4431.94, "end": 4442.94, "text": "also punktsternchen sollte alles matchen ok wir matchen mac mac gefolgt von"}, {"id": 618, "start": 4442.94, "end": 4454.94, "text": "quotes punktsternchen non creedy quote und eigentlich will ich das hier matchen"}, {"id": 619, "start": 4455.94, "end": 4463.34, "text": "das geht doch das geht doch das ist doch in ordnung das kann man sich doch so"}, {"id": 620, "start": 4463.34, "end": 4473.34, "text": "rausholen ok als nächstes wählen es sedings user user interessiert mich als"}, {"id": 621, "start": 4473.34, "end": 4495.78, "text": "nächstes user moment muss jetzt so machen reggex ok group 1 ok das das geht das"}, {"id": 622, "start": 4495.78, "end": 4505.26, "text": "klappt das klappt warum funktioniert das so mit dem leerzeichen dazwischen dass"}, {"id": 623, "start": 4505.26, "end": 4511.74, "text": "das ist kein guld das match überhaupt nicht weil hier nix dazwischen steht"}, {"id": 624, "start": 4511.74, "end": 4517.3, "text": "das müsstest du eigentlich schon so machen kann das sein dass das der reggex"}, {"id": 625, "start": 4517.3, "end": 4522.34, "text": "tester einfach für mich macht um um 5 hat zu sein"}, {"id": 626, "start": 4522.34, "end": 4532.82, "text": "egal so also wir brauchen den user wir brauchen last rekey next rekey expire"}, {"id": 627, "start": 4532.82, "end": 4545.94, "text": "start point pass phrase brauchen wir noch pass phrase ip vielleicht ja ist doch"}, {"id": 628, "start": 4545.94, "end": 4557.66, "text": "gut so und das jetzt reggexen leute die fall fertigste methode wäre dass du nach"}, {"id": 629, "start": 4557.66, "end": 4567.14, "text": "dass du nach space splittest dann jeden part nach dann hast du die wer was nach"}, {"id": 630, "start": 4567.14, "end": 4575.1, "text": "space splitten stimmt das würde tatsächlich funktionieren aber nur in"}, {"id": 631, "start": 4575.1, "end": 4578.94, "text": "dem fall aber nur in dem fall würde es funktionieren"}, {"id": 632, "start": 4578.94, "end": 4587.98, "text": "ich könnte ich könnte splitten ich könnte splitten am sp am space dann"}, {"id": 633, "start": 4587.98, "end": 4591.86, "text": "bekomme ich diesen ganzen müll hier einzeln und dann muss ich gucken"}, {"id": 634, "start": 4591.86, "end": 4596.98, "text": "contained das split ein gleichheitszeichen und dann splitten am"}, {"id": 635, "start": 4596.98, "end": 4602.54, "text": "gleichheit vor nie das ist aber das ist aber eklig"}, {"id": 636, "start": 4602.54, "end": 4609.5, "text": "ne ne ne ne aber wir machen jetzt wir machen jetzt reggex reggex stellt okay"}, {"id": 637, "start": 4609.5, "end": 4612.1, "text": "also"}, {"id": 638, "start": 4614.78, "end": 4619.46, "text": "was wie nennen wenn das denn jetzt hier das muss man nachher noch irgendwie"}, {"id": 639, "start": 4619.46, "end": 4627.14, "text": "reppen in der eigenen klasse wie nennen wir das ding jetzt hier xml response"}, {"id": 640, "start": 4627.14, "end": 4635.54, "text": "per line kann ich nicht machen weil das ist nur die line weil ich xml format"}, {"id": 641, "start": 4635.54, "end": 4642.66, "text": "hier in wirklichkeit in wirklichkeit sieht der output so aus keine lines oder"}, {"id": 642, "start": 4642.66, "end": 4646.82, "text": "ein bisschen x-part ja ja das ging auch aber ich habe ehrlich gesagt seit 15"}, {"id": 643, "start": 4646.82, "end": 4650.18, "text": "jahren kein xml mehr gepasst weiß gar nicht wie man das dort nicht gescheit"}, {"id": 644, "start": 4650.18, "end": 4654.58, "text": "machen dort nicht gescheit macht dokument xml document irgendwie was load"}, {"id": 645, "start": 4654.58, "end": 4658.42, "text": "und dann sonst wie"}, {"id": 646, "start": 4660.02, "end": 4664.06, "text": "zeigt mal vielleicht ist es noch vielleicht ist es einfach xml document"}, {"id": 647, "start": 4664.06, "end": 4668.98, "text": "pass c-sharp wie sehen das aus"}, {"id": 648, "start": 4675.98, "end": 4679.78, "text": "x-object x-node"}, {"id": 649, "start": 4679.78, "end": 4686.82, "text": "im x-document was ist das warum gibt es da schon wieder"}, {"id": 650, "start": 4686.82, "end": 4689.74, "text": "verschiedene sachen"}, {"id": 651, "start": 4697.34, "end": 4704.74, "text": "ok x x-document monka es dann ok probieren was probieren was erst mal so"}, {"id": 652, "start": 4704.74, "end": 4713.26, "text": "also x-dokument pass"}, {"id": 653, "start": 4715.74, "end": 4722.78, "text": "x-dokument was kann man da jetzt so machen declaration node parent save"}, {"id": 654, "start": 4722.78, "end": 4737.54, "text": "right so da kann man jetzt link link verwenden also xml pass ich weiß was"}, {"id": 655, "start": 4737.54, "end": 4740.9, "text": "muss ich jetzt mal ob es was muss ich was muss ich jetzt machen"}, {"id": 656, "start": 4740.9, "end": 4750.18, "text": "xml noch jemanden dann elemenz oder sowas wahrscheinlich ja oder root"}, {"id": 657, "start": 4750.18, "end": 4762.9, "text": "elemenz ok leute ich muss mal x pass select elemenz wie funktioniert kann ich"}, {"id": 658, "start": 4762.9, "end": 4768.66, "text": "da sowas wie wie im browser selektor schreiben x pass select c-sharp wie"}, {"id": 659, "start": 4768.66, "end": 4783.1, "text": "funktioniert das habe ich noch nie gemacht noch legit noch nie also"}, {"id": 660, "start": 4783.1, "end": 4801.78, "text": "what geht das auch in einfach es geht das auch in normal"}, {"id": 661, "start": 4801.78, "end": 4813.22, "text": "dem lieber punkt elemenz ok for each mal gucken was da rauskommt ich habe keinen plan"}, {"id": 662, "start": 4813.22, "end": 4819.06, "text": "elemenz ups"}, {"id": 663, "start": 4819.06, "end": 4833.62, "text": "ok kommen aus irgendwelchen gründen habe ich das jetzt gleich pretty printed"}, {"id": 664, "start": 4833.62, "end": 4848.34, "text": "elemenz das war einfach nur ein element oder wie meine güte wie wie macht man"}, {"id": 665, "start": 4848.34, "end": 4857.78, "text": "das jetzt gescheit gibt es warum gibt es nicht sowas und dann response und dann"}, {"id": 666, "start": 4857.78, "end": 4862.1, "text": "ok also sehe ich das jetzt richtig mache jetzt mal root root elemenz ist ja das"}, {"id": 667, "start": 4862.1, "end": 4871.42, "text": "oberste in dem fall ich feife da xml bearbeitung so root so root elemenz"}, {"id": 668, "start": 4871.42, "end": 4875.74, "text": "sollte jetzt ja alles sein wenn das print gut gut so elemenz"}, {"id": 669, "start": 4875.74, "end": 4888.06, "text": "die elemenz fast fast fast node ok"}, {"id": 670, "start": 4888.58, "end": 4903.66, "text": "fast element mein gott wie macht man sowas elemenz element get the first"}, {"id": 671, "start": 4903.66, "end": 4917.3, "text": "elemenz specified x name x name ist der element name also quasi sowas da ich"}, {"id": 672, "start": 4917.3, "end": 4922.34, "text": "habe keine ahnung ob ich das richtig"}, {"id": 673, "start": 4922.34, "end": 4934.94, "text": "was ruht die sendens dps k ich glaube euch jetzt einfach mal chat tatsächlich"}, {"id": 674, "start": 4934.94, "end": 4944.02, "text": "das scheint was zu funktionieren da geht was habt ihr schon was von aus"}, {"id": 675, "start": 4944.02, "end": 4948.06, "text": "kommentierten kommentaren gehört gibt gibt es in dem tool mit dem ich gerade"}, {"id": 676, "start": 4948.06, "end": 4953.58, "text": "entwickel was habt ihr schon etwas von aus kommentierten kommentaren du mein"}, {"id": 677, "start": 4953.58, "end": 4962.38, "text": "sowas hier und dann und dann wieder an kommenten oder oder oder was ok jetzt"}, {"id": 678, "start": 4962.38, "end": 4967.86, "text": "feife check für den chat leute wenn das funktioniert gibt es einen neuen feife"}, {"id": 679, "start": 4967.86, "end": 4980.1, "text": "award für den chat ha es funktioniert excellent massive IQ die spaz granate"}, {"id": 680, "start": 4980.1, "end": 4990.34, "text": "wusste es ok so jetzt haben wir die elemenz davon und jetzt müssen wir da"}, {"id": 681, "start": 4990.34, "end": 4995.18, "text": "was raus bekommen kann ich jetzt kann ich das jetzt mit attribute attribute"}, {"id": 682, "start": 4995.18, "end": 5003.1, "text": "drauf zugreifen also quasi element attributes attribute und dann so was"}, {"id": 683, "start": 5003.1, "end": 5011.34, "text": "sagen wie meck so und dann dann präntet er mir die meck adresse"}, {"id": 684, "start": 5011.34, "end": 5025.62, "text": "poggers aber jetzt will ich nur nur den value haben guck mal da das funktioniert"}, {"id": 685, "start": 5025.62, "end": 5032.62, "text": "tatsächlich relativ gut relativ gut man kann sich jetzt darüber streiten ob"}, {"id": 686, "start": 5032.62, "end": 5035.9, "text": "wirklich gut funktioniert funktioniert relativ gut ok dann machen wir jetzt mal"}, {"id": 687, "start": 5035.9, "end": 5047.14, "text": "eine extra klasse public class ruckus user so und der user hat ein string"}, {"id": 688, "start": 5047.14, "end": 5066.26, "text": "was name also name haben die haben die dinge dann eine meck string meck dann haben wir"}, {"id": 689, "start": 5066.26, "end": 5080.22, "text": "die leine all die brauche eigentlich gar nicht meck created wäre natürlich noch"}, {"id": 690, "start": 5080.22, "end": 5085.46, "text": "cool klasse erstellen und rein serialisieren ja wenn du mir sagst wie"}, {"id": 691, "start": 5085.46, "end": 5090.74, "text": "man das mit xml document macht würde ich mache ich das dürfte ich am"}, {"id": 692, "start": 5090.74, "end": 5098.42, "text": "einfachsten sein also pass pass phrase brauchen wir noch"}, {"id": 693, "start": 5098.42, "end": 5107.98, "text": "gibt es auch was wie element 2 oder serialize keine ahnung wie das"}, {"id": 694, "start": 5107.98, "end": 5110.38, "text": "funktioniert"}, {"id": 695, "start": 5112.7, "end": 5116.54, "text": "also das bedeutet doch jetzt im endeffekt ich kann jetzt hier sagen"}, {"id": 696, "start": 5116.54, "end": 5136.5, "text": "user gleich ups das er so richtig macht user gibt schon ah xml serialize an you"}, {"id": 697, "start": 5136.5, "end": 5147.98, "text": "ist x hat get type"}, {"id": 698, "start": 5154.22, "end": 5157.22, "text": "was ist p"}, {"id": 699, "start": 5157.22, "end": 5163.94, "text": "so sehen aus kommentierte kommentare im konto meines stonks automatisieren zu"}, {"id": 700, "start": 5163.94, "end": 5169.7, "text": "warum gibt es einen status über aus kommentierte kommentare"}, {"id": 701, "start": 5169.7, "end": 5189.58, "text": "meck so kann ich mal auto komplizieren so kaputt ist das was ich hier baue so"}, {"id": 702, "start": 5189.58, "end": 5205.9, "text": "user alter der kann doch nicht mal meine ah jetzt kann das ok element wie ist der"}, {"id": 703, "start": 5205.9, "end": 5217.18, "text": "krempel jetzt chat hochskolle wie ist der kram jetzt user einfach nur user user"}, {"id": 704, "start": 5217.18, "end": 5226.82, "text": "und pass phrase ist das pass phrase pass phrase ok"}, {"id": 705, "start": 5228.42, "end": 5233.9, "text": "so und wenn das jetzt funktioniert dann sollte ich für jeden user kann man"}, {"id": 706, "start": 5233.9, "end": 5240.62, "text": "rekord draus machen übrigens dann kann es kann ich einfacher prinden ok funs"}, {"id": 707, "start": 5240.62, "end": 5248.02, "text": "was jetzt ha easy xml gepasst"}, {"id": 708, "start": 5253.18, "end": 5256.62, "text": "so einfach kann es gehen"}, {"id": 709, "start": 5256.62, "end": 5270.58, "text": "sehr gut keine ahnung was geht ja wir haben die user vom webinterface abgefragt"}, {"id": 710, "start": 5270.58, "end": 5275.22, "text": "mit merck mit pass phrase vielleicht sollten uns dann die wlan all die"}, {"id": 711, "start": 5275.22, "end": 5281.9, "text": "noch mal holen weil die wlan all die könnte tatsächlich relativ praktisch"}, {"id": 712, "start": 5281.9, "end": 5285.7, "text": "sein wobei jetzt müssen wir doch gucken wie man die wlan all die zugeordnet"}, {"id": 713, "start": 5285.7, "end": 5289.7, "text": "bekommt zum eigentlichen wlan name"}, {"id": 714, "start": 5291.02, "end": 5294.78, "text": "aktuell haben wir nur die wlan id"}, {"id": 715, "start": 5295.74, "end": 5300.86, "text": "max doch sich da wie soll ich mich bei sowas denn docksen gesetzt in exis point"}, {"id": 716, "start": 5300.86, "end": 5307.14, "text": "danach doch beziehungsweise mach mach das wlan und das"}, {"id": 717, "start": 5307.14, "end": 5314.02, "text": "passwort raus vor der online geht exis pointe engter mit gestoppten wlans"}, {"id": 718, "start": 5314.02, "end": 5322.62, "text": "überall dann so passphrase jetzt haben wir hier noch wlan und das ist was"}, {"id": 719, "start": 5322.62, "end": 5325.14, "text": "wlan"}, {"id": 720, "start": 5326.7, "end": 5331.06, "text": "wlan svd id wo jetzt müssen wir raus bekommen"}, {"id": 721, "start": 5331.06, "end": 5334.42, "text": "wo denn da jetzt drin"}, {"id": 722, "start": 5334.42, "end": 5337.42, "text": "äh"}, {"id": 723, "start": 5341.82, "end": 5347.42, "text": "achso ja dann ist dann ist die zahl halten stringen was soll es"}, {"id": 724, "start": 5349.34, "end": 5351.82, "text": "kannst ja noch den wenn du zu merck raussuchen"}, {"id": 725, "start": 5351.82, "end": 5358.22, "text": "ne ne bringt wobei die idee ist gar nicht ich meine mehr features schaden ich"}, {"id": 726, "start": 5358.22, "end": 5364.22, "text": "warum nicht wenn ich es nicht lustige sache nicht dass man das brauchen würde"}, {"id": 727, "start": 5364.22, "end": 5369.14, "text": "so jetzt haben wir den ganzen krempel wlan all die wie kriege ich zur wlan"}, {"id": 728, "start": 5369.14, "end": 5373.22, "text": "all die passend jetzt raus wie der name vom wlan ist das müsste doch ja auch"}, {"id": 729, "start": 5373.22, "end": 5376.3, "text": "irgendwo drinne stehen"}, {"id": 730, "start": 5377.1, "end": 5380.74, "text": "alter jess skip"}, {"id": 731, "start": 5383.62, "end": 5389.18, "text": "gucken wir mal service dps k"}, {"id": 732, "start": 5389.18, "end": 5402.42, "text": "generate ok hier requests response hier wlan wlan svc list guck mal"}, {"id": 733, "start": 5402.42, "end": 5422.06, "text": "wlan s aha und was ist die id id in die wlan des versandes enable type"}, {"id": 734, "start": 5424.3, "end": 5430.3, "text": "ja und woher weiß ich jetzt die id von dem ding"}, {"id": 735, "start": 5430.3, "end": 5435.34, "text": "dann müsst ihr was eins drinne stehen"}, {"id": 736, "start": 5439.42, "end": 5443.02, "text": "ob alle hört es noch mal auf"}, {"id": 737, "start": 5446.3, "end": 5449.3, "text": "btf"}, {"id": 738, "start": 5449.3, "end": 5465.14, "text": "id hier ist es id ok noch mehr xml shit also konf underscore requests"}, {"id": 739, "start": 5465.14, "end": 5472.78, "text": "das ist jetzt es ist ja so bescheuert alle diese abwärts das denn ausgedacht"}, {"id": 740, "start": 5472.78, "end": 5478.1, "text": "man ok so jetzt müssen sie mich noch die wlan abrufen da können wir den user"}, {"id": 741, "start": 5478.1, "end": 5481.3, "text": "printen und dann machen wir das in der eigenen klasse weil aktuell blicke ich"}, {"id": 742, "start": 5481.3, "end": 5485.06, "text": "schon gar nicht mehr durch was hier überhaupt wie wo passiert also das"}, {"id": 743, "start": 5485.06, "end": 5489.7, "text": "müssen wir irgendwo jeder vormachen also"}, {"id": 744, "start": 5489.7, "end": 5512.58, "text": "so also xml request das da xml also dcrypt x true caller das kann"}, {"id": 745, "start": 5512.58, "end": 5519.82, "text": "wahrscheinlich alles weg ich denke mal komp wlan svc das werden wir wahrscheinlich"}, {"id": 746, "start": 5519.82, "end": 5522.7, "text": "brauchen schauen wir mal ob da ist der ganze miss"}, {"id": 747, "start": 5522.7, "end": 5525.42, "text": "drinne steht"}, {"id": 748, "start": 5527.14, "end": 5531.02, "text": "das ist wirklich also diese api zu bedienen ist wirklich hochgradig spain"}, {"id": 749, "start": 5531.02, "end": 5534.98, "text": "stemme ich kann schon verstehen dass sie kann bock"}, {"id": 750, "start": 5534.98, "end": 5545.18, "text": "nope muss ich doch was andere schicken muss ich doch den kompletten schicken"}, {"id": 751, "start": 5547.82, "end": 5550.42, "text": "nope"}, {"id": 752, "start": 5553.5, "end": 5560.86, "text": "achso die falsche url null ich kann falsche url es muss ja auch nach konf"}, {"id": 753, "start": 5560.86, "end": 5565.34, "text": "konf ich sag dir gleich was das für einer ist"}, {"id": 754, "start": 5566.06, "end": 5577.18, "text": "prager aha id 1 sehr schön so xml format"}, {"id": 755, "start": 5577.18, "end": 5594.7, "text": "hier passport leak leute alles klar guckt mal da wlan svc brauchen wir jetzt und"}, {"id": 756, "start": 5594.7, "end": 5607.7, "text": "dann dort das attribut für id das ist ein so einer die sind ganz die sind"}, {"id": 757, "start": 5607.7, "end": 5610.14, "text": "frucht die sind sehr günstig diese access points haben wir die sich neu"}, {"id": 758, "start": 5610.14, "end": 5619.98, "text": "kauft aber iber regelt aber gucken ob ich das jetzt richtig gelernt habe wie man"}, {"id": 759, "start": 5619.98, "end": 5630.62, "text": "diesen krempel wie man diesen kram passt also so"}, {"id": 760, "start": 5634.06, "end": 5642.54, "text": "x document pass und jetzt sage ich x document die sendens so wie hier unten"}, {"id": 761, "start": 5642.54, "end": 5650.3, "text": "im prinzip kann ich mir das copy pasten die sendens bloß dass ich jetzt nicht"}, {"id": 762, "start": 5650.3, "end": 5662.14, "text": "dps k haben will sondern wlan svc wenn das jetzt funktioniert kriege ich meine"}, {"id": 763, "start": 5662.14, "end": 5665.62, "text": "meine wlan geprintet"}, {"id": 764, "start": 5665.74, "end": 5671.34, "text": "der kann der hat deutlich mehr features als das ganze unify zeug das sieht doch"}, {"id": 765, "start": 5671.34, "end": 5675.98, "text": "prinzipiell ganz gut aus so und da will ich jetzt l da will ich jetzt"}, {"id": 766, "start": 5675.98, "end": 5683.18, "text": "attribut attribut name und all die haben"}, {"id": 767, "start": 5683.18, "end": 5697.06, "text": "all die und name schauen wir mal so haben wir die ganzen wlan nice so dann"}, {"id": 768, "start": 5697.06, "end": 5709.98, "text": "brauchen wir noch da braucht man mal ein dictionary jetzt keine ahnung wlan"}, {"id": 769, "start": 5709.98, "end": 5716.22, "text": "dictionary auf wobei warum solche dick na doch weil die nicht weil die ids ja"}, {"id": 770, "start": 5716.22, "end": 5728.1, "text": "nicht bei null anfangen aus int und string und dann sagen wir wlan add so"}, {"id": 771, "start": 5728.1, "end": 5737.54, "text": "das hier ist die id alles natürlich als string und das hier ist der name"}, {"id": 772, "start": 5737.54, "end": 5745.14, "text": "so und da machen wir irgendwie hübsche kommandozeit anwendung draus"}, {"id": 773, "start": 5745.14, "end": 5750.98, "text": "du würdest einen counter begrüßen ja das müsste man höchstens mit haben wir"}, {"id": 774, "start": 5750.98, "end": 5757.94, "text": "nicht bei nightbot dann kann nightbot nicht kauen nightbot hat doch counter"}, {"id": 775, "start": 5757.94, "end": 5776.38, "text": "übrigens string id name gut und jetzt können wir sagen an der stelle hier"}, {"id": 776, "start": 5776.38, "end": 5780.5, "text": "unten wo wir die wo wir die ganzen wlan auflösen"}, {"id": 777, "start": 5780.5, "end": 5788.26, "text": "wlan so wir wollen nämlich haben wlan und dort an der stelle das wlan mit"}, {"id": 778, "start": 5788.26, "end": 5792.18, "text": "dieser id und wenn das jetzt funktioniert dann habe ich jetzt den"}, {"id": 779, "start": 5792.18, "end": 5803.18, "text": "namen da drin anstatt die id ok also wir haben user wir haben mac wir haben"}, {"id": 780, "start": 5803.18, "end": 5807.02, "text": "passphrase und wir haben das wlan damit kann man doch schon mal was anfangen"}, {"id": 781, "start": 5807.02, "end": 5811.02, "text": "gut und daraus machen wir zum kommandozeilen programm ich bin ja geneigt"}, {"id": 782, "start": 5811.02, "end": 5815.78, "text": "dazu das jetzt endlich immer auszulagern in irgendeine eigene api klasse weil so"}, {"id": 783, "start": 5815.78, "end": 5821.66, "text": "kann das doch niemand händeln auf dauer gerade wenn ich mir dieses abfuck xml"}, {"id": 784, "start": 5821.66, "end": 5825.62, "text": "zeug ansehen kriege ich ja anfälle ok wir machen eine eigene api klasse also"}, {"id": 785, "start": 5825.62, "end": 5840.22, "text": "das ding als ruckus api so das ding"}, {"id": 786, "start": 5840.22, "end": 5845.02, "text": "das ding kriegt kein konstruktor das ding kriegt eine factory metode oder wie"}, {"id": 787, "start": 5845.02, "end": 5854.5, "text": "man das genau nennt public static wenn wir das einfach mal login was load was"}, {"id": 788, "start": 5854.5, "end": 5865.3, "text": "achso log in ich habe montags immer frei allerdings was die ganzen leute hier"}, {"id": 789, "start": 5865.3, "end": 5869.1, "text": "machen das weiß ich nicht ich bin natürlich froh dass ihr da seid also"}, {"id": 790, "start": 5869.1, "end": 5878.22, "text": "login op monka es ja ich habe montags immer frei also login gut also wir machen"}, {"id": 791, "start": 5878.22, "end": 5886.74, "text": "das jetzt mal wir schmeißen mal die sachen hieraus also login funktioniert"}, {"id": 792, "start": 5886.74, "end": 5890.34, "text": "folgendermaßen"}, {"id": 793, "start": 5891.14, "end": 5898.94, "text": "das hier ist mein login ein login code kodra"}, {"id": 794, "start": 5898.94, "end": 5910.7, "text": "async task so ip die ip wird einfach hardcoded"}, {"id": 795, "start": 5911.06, "end": 5916.1, "text": "wobei die ip die sollten wir eigentlich bei login IP soll man ich bei login"}, {"id": 796, "start": 5916.1, "end": 5925.34, "text": "übergeben ok so weil jetzt kann ich nämlich sagen api login ip user"}, {"id": 797, "start": 5925.34, "end": 5930.06, "text": "passworten das kann man sich dann auch per kommando zeile ordentlich einlesen"}, {"id": 798, "start": 5930.06, "end": 5934.66, "text": "das sieht schon mal deutlich besser aus so jetzt bekomme ich das jetzt zurück"}, {"id": 799, "start": 5934.66, "end": 5937.46, "text": "wenn ich mich einlogge"}, {"id": 800, "start": 5942.06, "end": 5945.86, "text": "so private"}, {"id": 801, "start": 5946.42, "end": 5951.66, "text": "jup user brauchen wir nicht mehr passwort"}, {"id": 802, "start": 5951.66, "end": 5957.18, "text": "auch nicht mehr string die ip brauche eigentlich nur und dass token brauchen"}, {"id": 803, "start": 5957.18, "end": 5964.7, "text": "wir ansonsten eigentlich nix"}, {"id": 804, "start": 5976.06, "end": 5980.1, "text": "spektra die nehmen wir auch gleich die ist richtig pock mit der habe ich schon"}, {"id": 805, "start": 5980.1, "end": 5983.3, "text": "ein paar sachen gemacht die ist richtig gut da können wir da auch tabellen und"}, {"id": 806, "start": 5983.3, "end": 5986.86, "text": "spinner und so machen auf der spektra konsole ist richtig nice"}, {"id": 807, "start": 5986.86, "end": 5992.9, "text": "sowohl das die ip als auch das highlight für farbe und was das ist richtig nice"}, {"id": 808, "start": 5992.9, "end": 5996.78, "text": "das werden wir auch gleich verwenden ja"}, {"id": 809, "start": 5998.14, "end": 6001.78, "text": "ok wenn das ding wenn das ding exceptions mir das ist übrigens der"}, {"id": 810, "start": 6001.78, "end": 6008.14, "text": "grund warum ich das in eine mit static method zum klasse erstellen angelegt"}, {"id": 811, "start": 6008.14, "end": 6012.02, "text": "habe und nicht in dem konstruktor weil man sagt ja so aus pauschal man sollte"}, {"id": 812, "start": 6012.02, "end": 6016.02, "text": "in einem konstruktor keine exceptions vorkommen lassen"}, {"id": 813, "start": 6016.02, "end": 6021.3, "text": "ja und hier kann es natürlich jede menge exceptions geben also von von ding ist"}, {"id": 814, "start": 6021.3, "end": 6027.62, "text": "nicht erreichbar auf der ip bis return code stimmt nicht oder sonst was"}, {"id": 815, "start": 6027.62, "end": 6035.5, "text": "jetzt haben wir das hier drin stehen da brauchen wir als nächstes"}, {"id": 816, "start": 6035.5, "end": 6044.06, "text": "haben wir eine publik publik static async task"}, {"id": 817, "start": 6044.06, "end": 6053.5, "text": "i read only list jetzt aber hier so was von objekt oriented objekte orientiert"}, {"id": 818, "start": 6053.5, "end": 6061.78, "text": "mehr geht nicht nicht static was mache ich denn da"}, {"id": 819, "start": 6064.74, "end": 6068.58, "text": "also vielleicht soll ich das ding auch mal irgendwie nennen list user heißt"}, {"id": 820, "start": 6068.58, "end": 6070.98, "text": "das jetzt"}, {"id": 821, "start": 6072.26, "end": 6081.58, "text": "so list user list user funktioniert folgendermaßen und zwar so"}, {"id": 822, "start": 6081.58, "end": 6085.1, "text": "monkel ist"}, {"id": 823, "start": 6087.62, "end": 6092.9, "text": "ap lists user awaits"}, {"id": 824, "start": 6093.38, "end": 6098.42, "text": "so funktioniert list user plus ein bisschen schöner gemacht noch"}, {"id": 825, "start": 6101.74, "end": 6105.74, "text": "es ist underscore ip"}, {"id": 826, "start": 6105.74, "end": 6110.78, "text": "so das sieht auch jetzt schon ein bisschen schöner aus"}, {"id": 827, "start": 6110.78, "end": 6117.86, "text": "und jetzt ist das hier die user da machen wir eine liste list new list mit den"}, {"id": 828, "start": 6117.86, "end": 6138.06, "text": "usern und sagen ihm hier list add den user so so richtig schreibt und dann hier"}, {"id": 829, "start": 6138.06, "end": 6142.86, "text": "unten return list das kann man natürlich alles noch schöner machen weil das ist"}, {"id": 830, "start": 6142.86, "end": 6147.86, "text": "jetzt ein riesenlanger blob in in sowas hier drinnen aber das soll es jetzt"}, {"id": 831, "start": 6147.86, "end": 6152.94, "text": "erstmal tun beispielsweise das xml parsen das das würde ich das würde ich"}, {"id": 832, "start": 6152.94, "end": 6157.74, "text": "später das würde ich später noch auslagern ich meine ich mache hier immer"}, {"id": 833, "start": 6157.74, "end": 6168.86, "text": "das gleiche ich könnte sowas sagen wie keine ahnung get xml element und dann"}, {"id": 834, "start": 6168.86, "end": 6176.18, "text": "sowas wasser dankeschön für den zapp das sollte es aber erst mal so tun damit"}, {"id": 835, "start": 6176.18, "end": 6179.86, "text": "kann ich leben das ist jetzt natürlich in der handhabung"}, {"id": 836, "start": 6179.86, "end": 6186.5, "text": "deutlich deutlich schöner weil jetzt kann ich einfach so was hier machen user"}, {"id": 837, "start": 6186.5, "end": 6191.02, "text": "gleich achso tja"}, {"id": 838, "start": 6191.02, "end": 6196.66, "text": "ist halt blöd dass"}, {"id": 839, "start": 6200.66, "end": 6207.98, "text": "wir sehen das login user log in password"}, {"id": 840, "start": 6207.98, "end": 6221.62, "text": "so wenn da wenn ich jetzt alles richtig gemacht habe lässt es sich jetzt"}, {"id": 841, "start": 6221.62, "end": 6233.66, "text": "deutlich schöner handeln und hallo for each please als makro for each user in"}, {"id": 842, "start": 6233.66, "end": 6242.3, "text": "users user schauen wir mal müsste das gleiche rauskommen jetzt hey kommt das"}, {"id": 843, "start": 6242.3, "end": 6246.5, "text": "gleiche raus ok nice und jetzt war man da richtig poggers"}, {"id": 844, "start": 6246.5, "end": 6250.46, "text": "fai fertige konsolen ausgabe nämlich spektra console das ding ist wirklich"}, {"id": 845, "start": 6250.46, "end": 6253.7, "text": "nice also hatte auch gerade im chat einer geschrieben damit kann man"}, {"id": 846, "start": 6253.7, "end": 6261.58, "text": "wunderbares cli auf der auf der konsole machen ja command line interface und"}, {"id": 847, "start": 6261.58, "end": 6268.9, "text": "colors und gedöns das ist wirklich cool das ist ein bisschen wie ich habe das"}, {"id": 848, "start": 6268.9, "end": 6273.1, "text": "python gegenstück vergessen das gibt es quasi in nahezu jeder"}, {"id": 849, "start": 6273.1, "end": 6277.3, "text": "programmiersprache gibt es irgendwie so paar coole konsole anwendung libraries"}, {"id": 850, "start": 6277.3, "end": 6286.26, "text": "und für sie scharf ist es halt spektra konsole spektra"}, {"id": 851, "start": 6286.26, "end": 6294.14, "text": "konsole gut und jetzt können wir nämlich so was hier sagen anstatt das hier"}, {"id": 852, "start": 6294.14, "end": 6298.02, "text": "einfach nur so eklig zu printen können wir jetzt sagen table jetzt haltet euch"}, {"id": 853, "start": 6298.02, "end": 6302.82, "text": "mal fest was das ding für nice sachen auf der konsole machen kann table add"}, {"id": 854, "start": 6302.82, "end": 6310.26, "text": "column so wir wollen ausgeben user jetzt wird jetzt wird es auch optisch nicht"}, {"id": 855, "start": 6310.26, "end": 6317.34, "text": "schlecht user wollen wir ausgeben dann wollen wir noch haben wir denn hier"}, {"id": 856, "start": 6317.34, "end": 6325.14, "text": "mac passphrase wlan in welchem wlan die sind dann"}, {"id": 857, "start": 6326.3, "end": 6334.22, "text": "welche meck die haben und am ende welches passwort die haben weiß jemand"}, {"id": 858, "start": 6334.22, "end": 6339.14, "text": "was in iot so die gängigen sprache sind ja leider c++ also im hand im handelsübli"}, {"id": 859, "start": 6339.14, "end": 6345.82, "text": "so im heimbereich ist es viel arduino kompatibles zeug von esp 2866 bis esp 32"}, {"id": 860, "start": 6345.82, "end": 6352.42, "text": "und das ist leider leider ausschließlich c hauptsächlich c++ was"}, {"id": 861, "start": 6352.42, "end": 6358.98, "text": "halt ziemlich sagt aber man kommt halt nicht drumherum so"}, {"id": 862, "start": 6358.98, "end": 6375.3, "text": "cable cable add row user bem also zuerst der user name dann user wlan dann user"}, {"id": 863, "start": 6375.3, "end": 6390.46, "text": "meck dann user passphrase so und jetzt table render nie vergessen cable"}, {"id": 864, "start": 6390.46, "end": 6405.18, "text": "kein schimmer cable ach so einfach so ok cable so und jetzt passt mal auf wie"}, {"id": 865, "start": 6405.18, "end": 6412.54, "text": "wie nice das auf der konsole jetzt aussieht bem ist das nicht eine huge"}, {"id": 866, "start": 6412.54, "end": 6421.02, "text": "feif händige optisch ansprechende ausgabe von den usern auf der kommando zeile das"}, {"id": 867, "start": 6421.02, "end": 6428.14, "text": "doch richtig nice oder richtig porc guck mal hier bem zack es war mal also am"}, {"id": 868, "start": 6428.14, "end": 6430.86, "text": "besten wäre es natürlich wenn man so was ausführen könnte später dann"}, {"id": 869, "start": 6430.86, "end": 6438.9, "text": "irgendwie was weiß ich irgendwie so list user oder sowas"}, {"id": 870, "start": 6438.9, "end": 6448.1, "text": "ja kommen die franzosen sogar an und jetzt können wir noch sagen table"}, {"id": 871, "start": 6448.1, "end": 6456.46, "text": "expand expand und jetzt ist die tabelle auch gleich guckt mal ist die tabelle"}, {"id": 872, "start": 6456.46, "end": 6463.02, "text": "auch gleich über den ganzen bildschirm massive das ist doch das war schon mal"}, {"id": 873, "start": 6463.02, "end": 6469.62, "text": "deutlich besser als übers web interface so gedönst zu machen das gefällt mir"}, {"id": 874, "start": 6469.62, "end": 6473.86, "text": "jetzt schon mal sehr gut dort haben wir rausbekommen also erste"}, {"id": 875, "start": 6473.86, "end": 6483.26, "text": "hürde ist genommen wir haben rausbekommen wie man user abruft die"}, {"id": 876, "start": 6483.26, "end": 6488.3, "text": "nächste hürde ist wie kann man user anlegen"}, {"id": 877, "start": 6488.3, "end": 6497.46, "text": "nach namen sortieren moment stand da expire irgendwo drin"}, {"id": 878, "start": 6497.46, "end": 6507.06, "text": "stand da irgendwo drin waren die expire ich muss mir mal kurz das xml muss"}, {"id": 879, "start": 6507.06, "end": 6520.98, "text": "nur mal kurz das xml ausgeben hier oder created kann man da drin stehen"}, {"id": 880, "start": 6520.98, "end": 6536.82, "text": "meck last next ist das hier quasi created macht er erzeugte daraus created"}, {"id": 881, "start": 6536.82, "end": 6544.58, "text": "das ist auch garantiert in den unix timestamp unix time alter was das für"}, {"id": 882, "start": 6544.58, "end": 6555.1, "text": "eine 15 der fünfte gestern 1535 ja ok das ist das brauchen wir noch da kann man"}, {"id": 883, "start": 6555.1, "end": 6560.5, "text": "das nämlich nach endungsdatum nach modified datum machen last rekey das"}, {"id": 884, "start": 6560.5, "end": 6571.38, "text": "brauchen wir unbedingt das ist das ist prog was bei dir hat sich jemand"}, {"id": 885, "start": 6571.38, "end": 6575.14, "text": "neulich beschwert das cli voll veraltet ist ja das sind die ganzen kacknubs die"}, {"id": 886, "start": 6575.14, "end": 6579.78, "text": "keine ahnung das sind auch die leute die unter windows dann so klicken wenn du"}, {"id": 887, "start": 6579.78, "end": 6585.26, "text": "denen sagst so nach dem motto machen wir den explorer auf und werft den usb"}, {"id": 888, "start": 6585.26, "end": 6610.94, "text": "stick aus so dann machen die leute so"}, {"id": 889, "start": 6610.94, "end": 6614.66, "text": "auswerfen das sind die gleichen leute die sagen dass die lei veraltet ist die"}, {"id": 890, "start": 6614.66, "end": 6620.1, "text": "zehn minuten die zehn minuten brauchen sowas sowas zu machen ja anstatt spam"}, {"id": 891, "start": 6620.1, "end": 6628.3, "text": "bam bam auswerfen gut ist das ging mir ein bisschen schnell ja das ist schon"}, {"id": 892, "start": 6628.3, "end": 6640.26, "text": "das ist grenzwertig gewesen ja modifia et oder ab dated et oder das so date"}, {"id": 893, "start": 6640.26, "end": 6653.9, "text": "time jetzt müssen wir den plus sagen dass der updated f last rekey und jetzt"}, {"id": 894, "start": 6653.9, "end": 6661.02, "text": "wie ging das noch mal unix time zu einem date time das war neu das geht noch"}, {"id": 895, "start": 6661.02, "end": 6673.58, "text": "nicht so lang sie schabt und unix unix time to date time das ist noch nicht so"}, {"id": 896, "start": 6673.58, "end": 6678.9, "text": "lange her dass sie dafür was geedet haben das ist müll was die hier schreiben"}, {"id": 897, "start": 6678.9, "end": 6687.18, "text": "das ist nicht mehr aktuell das da genau date time offset from unix time seconds"}, {"id": 898, "start": 6687.18, "end": 6696.94, "text": "kämpel offset from unix time seconds moment jetzt muss ich es noch als in"}, {"id": 899, "start": 6696.94, "end": 6702.26, "text": "passen jetzt wird es jetzt wird es abartig"}, {"id": 900, "start": 6702.26, "end": 6711.54, "text": "a long pass"}, {"id": 901, "start": 6715.1, "end": 6716.5, "text": "habe ich glück wenn sie nicht knallt"}, {"id": 902, "start": 6716.5, "end": 6738.42, "text": "dates und wie mache ich das jetzt zu einem date time tix utc date time local"}, {"id": 903, "start": 6738.42, "end": 6748.34, "text": "date time ja das ist gut so jetzt schauen wir mal ob das an sich funktioniert"}, {"id": 904, "start": 6748.34, "end": 6756.54, "text": "programm modified ist wahrscheinlich sogar ganz sinnvoll"}, {"id": 905, "start": 6756.54, "end": 6769.78, "text": "updated wenn man das als erstes macht user updated ach nee"}, {"id": 906, "start": 6769.78, "end": 6774.58, "text": "ach jetzt muss ich noch formatieren to string hätte ich auch das hätte ich"}, {"id": 907, "start": 6774.58, "end": 6782.94, "text": "gleich machen können an der stelle wie willst du etwas sagen man versteht hier"}, {"id": 908, "start": 6782.94, "end": 6789.58, "text": "nicht auf den ersten blick was da passiert ich finde ich finde es"}, {"id": 909, "start": 6789.58, "end": 6794.74, "text": "äußerst beruhigend also umso mehr die idee orange unter kringelt umso sicherer"}, {"id": 910, "start": 6794.74, "end": 6797.78, "text": "ist das ganze umso mehr ist das überprüft umso öfters ist das schon"}, {"id": 911, "start": 6797.78, "end": 6801.46, "text": "quasi während der entwicklungszeit überprüft kann ich nichts mehr schief"}, {"id": 912, "start": 6801.46, "end": 6817.82, "text": "gehen so short date ist ok"}, {"id": 913, "start": 6817.82, "end": 6837.02, "text": "das ist das ist kokona kokona schreib format"}, {"id": 914, "start": 6837.02, "end": 6849.82, "text": "das will ich haben das will ich haben ohne zz also in dem moment ich will ich"}, {"id": 915, "start": 6849.82, "end": 6859.46, "text": "will den tag ja noch dabei haben dd oder was ist das ja so war es im"}, {"id": 916, "start": 6859.46, "end": 6875.38, "text": "endeffekt"}, {"id": 917, "start": 6875.38, "end": 6877.38, "text": "Äh, äh, was?"}, {"id": 918, "start": 6877.38, "end": 6900.78, "text": "Ja, schon besser. Also ich will dd, ja genau, dd.mm.jaja, genau. Oder will ich vielleicht so?"}, {"id": 919, "start": 6900.78, "end": 6910.94, "text": "Ne, will ich nicht. Ja, das sieht, nein. Chat, das stimmt nicht, was ihr geschrieben habt."}, {"id": 920, "start": 6910.94, "end": 6922.38, "text": "So, ich, ich, ich trau, ich, ich glaube euch das jetzt einfach. Nein, nein, fast,"}, {"id": 921, "start": 6922.38, "end": 6931.38, "text": "aber y, y ist richtig. So, so. Aha. So und jetzt Moment, wir wollen Monat, Monat, wir"}, {"id": 922, "start": 6931.38, "end": 6939.82, "text": "wollen das haben und das doppelt. Beistelle ich immer. So will ich das haben. 15.05.2092,"}, {"id": 923, "start": 6939.82, "end": 6954.98, "text": "15.35. So ist das nice. Und jetzt sorten wir das danach. Und zwar. Users. Order by user."}, {"id": 924, "start": 6954.98, "end": 6970.46, "text": "Updated ad. Manchmal macht die aus mit Autokomplete komisches Zeug. So und jetzt haben wir das"}, {"id": 925, "start": 6970.46, "end": 6976.7, "text": "Ganze aufsteigend sortiert. Kann man den Zeilenabstand vergrößern? Ja, du kannst das ziemlich genau"}, {"id": 926, "start": 6976.7, "end": 6982.82, "text": "konfigurieren. Aber wollen wir den Zeilenabstand vergrößern? Also du kannst relativ viele machen"}, {"id": 927, "start": 6982.82, "end": 6987.9, "text": "bei dem Kram hier. Weiß ich aber aus dem Kopf nicht, wie man das macht. Du kannst den"}, {"id": 928, "start": 6987.9, "end": 7003.42, "text": "Border ändern, kannst das Alignment ändern, den Titel, die Breite. Man kann bestimmt auch"}, {"id": 929, "start": 7003.42, "end": 7009.34, "text": "irgendwie noch extra Zeilen einfügen. Nee, den Zeilenabstand nicht. Du kannst extra Zeile"}, {"id": 930, "start": 7009.34, "end": 7013.86, "text": "anmachen, weil die Zeilenhöhe ist ja fix in deinem Terminal. Da kannst du nichts ändern."}, {"id": 931, "start": 7013.86, "end": 7020.18, "text": "Aber du kannst die. Du kannst extra Zeilen rein machen. Du kannst so viele Gedöns hier"}, {"id": 932, "start": 7020.18, "end": 7027.5, "text": "einstellen, wüsste ich noch nicht mal, wie das überhaupt genau funktioniert. Aber so"}, {"id": 933, "start": 7027.5, "end": 7032.7, "text": "ehrlich gesagt reicht es mir so erstmal. Aber das ist doch sehr schick jetzt, oder? Und"}, {"id": 934, "start": 7032.7, "end": 7037.66, "text": "wie schnell das geht, besser als besser als mit einem ferngesteuerten Chrome ist es auf"}, {"id": 935, "start": 7037.66, "end": 7043.62, "text": "jeden Fall. Das war ja meine erste Idee. Wir könnten Chrome fernsteuern, anstatt das so"}, {"id": 936, "start": 7043.62, "end": 7050.58, "text": "zu machen. So ist das viel, viel besser. Damit kann man jetzt richtig was anfangen."}, {"id": 937, "start": 7050.58, "end": 7057.66, "text": "Damit kann man tatsächlich... Jetzt müssen wir noch User anlegen. Das wird auch nochmal"}, {"id": 938, "start": 7057.66, "end": 7064.06, "text": "lustig. Also, jetzt kann man sich User anzeigen lassen und man kann User bald updaten, beziehungsweise"}, {"id": 939, "start": 7064.06, "end": 7073.22, "text": "User anlegen. Also sprich, wenn irgendjemand Sixheadiges kommt und sein Passwort vergisst"}, {"id": 940, "start": 7073.22, "end": 7077.5, "text": "und wisst ihr, was das Coole ist? Dadurch, dass wir jetzt hier das über Kommandozeile"}, {"id": 941, "start": 7077.5, "end": 7082.22, "text": "laufen haben, kann ich das dann auch direkt in Labelchamp pippen und ein Etikett drucken"}, {"id": 942, "start": 7082.22, "end": 7088.26, "text": "lassen mit der Zugangs... mit dem Zugang. Also sprich, theoretisch mal angenommen, es"}, {"id": 943, "start": 7088.26, "end": 7100.18, "text": "wird jemand zu Besuch. Dann gehe ich hier hin, tippe dann ein, was weiß ich hier, add,"}, {"id": 944, "start": 7100.18, "end": 7106.34, "text": "gebe den Usernamen ein, kegw-user und dann kann ich irgendwie noch sagen Output als"}, {"id": 945, "start": 7106.34, "end": 7111.7, "text": "PNG oder als QR-Code und das wird dann in den Labelchamp gepiped und der Labelchamp"}, {"id": 946, "start": 7111.7, "end": 7122.22, "text": "druckt es dann aus. Bei Chico alles fit? Ja, die liegt irgendwo im Hof draußen gerade"}, {"id": 947, "start": 7122.22, "end": 7129.58, "text": "und rollt sich da rum. Die Mac ist ja noch nicht ganz sauber, doch die Mac stimmt. Wenn"}, {"id": 948, "start": 7129.58, "end": 7135.62, "text": "keine Mac drinnen steht, heißt das nur, dass einmalig sich jede Mac Adresse anmelden kann"}, {"id": 949, "start": 7135.62, "end": 7141.9, "text": "und es erst dann gelockt wird. Also wenn Mac leer ist, heißt das, es hat sich einfach"}, {"id": 950, "start": 7141.9, "end": 7145.38, "text": "noch nie jemand mit diesem User angemeldet, was richtig ist, weil das hat sich noch keiner"}, {"id": 951, "start": 7145.38, "end": 7153.3, "text": "mit dem User angemeldet. Ich werde das jetzt auch nicht einschalten, das WLAN, weil ich"}, {"id": 952, "start": 7153.3, "end": 7157.54, "text": "habe schon alles geleakt von Passwörtern bis sonst was, also ich werde jetzt hier nichts"}, {"id": 953, "start": 7157.54, "end": 7164.9, "text": "einschalten. Ne, ne, das ist Access-Point-spezifisch, also die machen das so. Du kannst User anlegen"}, {"id": 954, "start": 7164.9, "end": 7170.18, "text": "im Access-Point und du kannst Mac-Adressen vergeben, dann kann nur dieses Gerät mit"}, {"id": 955, "start": 7170.18, "end": 7174.3, "text": "diesem Passwort und dieser Mac rein. Du kannst aber auch die Mac leer lassen, dann musst"}, {"id": 956, "start": 7174.3, "end": 7178.02, "text": "du das WLAN-Passwort eingeben und beim ersten Mal einloggen, merkt er sich dann die Mac"}, {"id": 957, "start": 7178.02, "end": 7184.34, "text": "dazu. Kann man noch eine Last-Logon-Zeile oder sowas hinzufügen? Ne, das haben die"}, {"id": 958, "start": 7184.34, "end": 7190.26, "text": "in der API nicht drin stehen. Guckt, wir können nur, wir können nur das machen, was die, also"}, {"id": 959, "start": 7190.26, "end": 7199.66, "text": "es sei dann, man kriegt das über das Web-Interface irgendwie raus. Also wir können bloß ID, Rollen-ID,"}, {"id": 960, "start": 7199.66, "end": 7210.14, "text": "Mac, WLAN-Name, WLAN-ID angelegt, Expire, die IP könnten wir noch uns auslesen für"}, {"id": 961, "start": 7210.14, "end": 7216.74, "text": "eingeloggte Geräte aktuell. Ja, mehr kriegen wir nicht raus. Aber die IP ist tatsächlich"}, {"id": 962, "start": 7216.74, "end": 7221.54, "text": "gar nicht so schlecht. Die IP sollten wir uns, das schreibe ich mal zumindest als To-Do"}, {"id": 963, "start": 7221.54, "end": 7226.26, "text": "noch auf. Irgendwo hier unten, wo ich das andere To-Do hin hab. Das war ja einfach nur"}, {"id": 964, "start": 7226.26, "end": 7237.86, "text": "just for fun, keck weh. Aber IP ausgeben für eingeloggte Devices. Das ist nicht verkehrt."}, {"id": 965, "start": 7237.86, "end": 7243.38, "text": "Das könnte man tatsächlich machen an der Stelle, weil wenn es die API hergibt, warum"}, {"id": 966, "start": 7243.38, "end": 7252.34, "text": "nicht? So, jetzt legen wir User an. Da bin ich mal gespannt. Alles wieder dicht machen."}, {"id": 967, "start": 7252.34, "end": 7262.34, "text": "User anlegen. Ok, also Leute, User anlegen ist ziemlich eklig. Wenn ihr User anlegen"}, {"id": 968, "start": 7262.34, "end": 7267.38, "text": "wollt, könnt ihr nicht einfach sagen add user. Ihr müsst eine CSV-Datei hochladen,"}, {"id": 969, "start": 7267.38, "end": 7280.26, "text": "die so aussieht. Und in dieser CSV-Datei kann man dann sagen, wie der User heißen soll,"}, {"id": 970, "start": 7280.26, "end": 7286.98, "text": "keck weh User. Und welche MAC-Adresse der hat. Wenn man die MAC-Adresse leer lässt,"}, {"id": 971, "start": 7286.98, "end": 7293.1, "text": "dann ist es halt einfach nur ein User, der sich einloggen kann mit dem Passwort ohne"}, {"id": 972, "start": 7293.1, "end": 7298.1, "text": "bestimmtem Gerät. Bis zum ersten Mal. Und das heißt, wir müssen jetzt eine CSV-Generate"}, {"id": 973, "start": 7298.1, "end": 7306.34, "text": "haben. Aber was nicht schlimm ist, weil unsere CSV wird so aussehen. Also unsere CSV heißt"}, {"id": 974, "start": 7306.34, "end": 7317.22, "text": "keck weh User, das ist unsere CSV. Wer braucht die nicht? CSV, XML. Stimmt, die haben wirklich"}, {"id": 975, "start": 7317.22, "end": 7328.42, "text": "jeden Bullshit drin, oder? Was fehlt noch, Leute? XML, CSV, JSP, Java Server Pages. Was"}, {"id": 976, "start": 7328.42, "end": 7340.62, "text": "gibt es noch für Bullshit, den wir vielleicht noch finden drin? Ok, wir müssen jetzt uns"}, {"id": 977, "start": 7340.62, "end": 7348.5, "text": "das Ganze aber mal in Ruhe anschauen. Und zwar, also, wenn man jetzt hier User hochlädt,"}, {"id": 978, "start": 7348.5, "end": 7360.46, "text": "Browse, Downloads, Batch DPSK-Example. So, dann macht er diese zwei Requests. Requests?"}, {"id": 979, "start": 7360.46, "end": 7367.22, "text": "Dock MD System Check Memory? Ah, das ist bevor er an Upload startet, ob er genug Speicherplatz"}, {"id": 980, "start": 7367.22, "end": 7381.7, "text": "hat. Ich denke mal, das ist ok. Und danach gibt es ein Upload. Upload. Requests. Ah,"}, {"id": 981, "start": 7381.7, "end": 7388.62, "text": "das ist jetzt eine Form, Form Encoded. PDF, na PDF ist ja kein Shit. Also, wohin geht denn"}, {"id": 982, "start": 7388.62, "end": 7397.58, "text": "der Request? Hier. Ok, boah, boah Leute, das wird, das wird ja abfuckt. Also, Create User,"}, {"id": 983, "start": 7397.58, "end": 7409.02, "text": "Create User machen wir jetzt. Public, Void, Create User. String, Name. Rest können wir"}, {"id": 984, "start": 7409.02, "end": 7416.18, "text": "dann machen. Also, da wollen wir hin. Das bedeutet, wir müssen einen Post machen. So,"}, {"id": 985, "start": 7416.18, "end": 7427.66, "text": "wenn wir gerade mal wieder kopieren. Create User. Äh, wir machen hier gerade mal an der"}, {"id": 986, "start": 7427.66, "end": 7442.66, "text": "Stelle Return. RP Create User. So, und wir legen jetzt den User Cute Chat an. Task."}, {"id": 987, "start": 7442.66, "end": 7454.94, "text": "Ok, wie füllen wir das Ganze? Also, wir brauchen einen Postrequest dahin. IP ist richtig."}, {"id": 988, "start": 7454.94, "end": 7462.58, "text": "Admin, Upload, Request, XHR. Ja, das sollten wir recht sein. So, dahin machen wir den Postrequest."}, {"id": 989, "start": 7462.58, "end": 7468.22, "text": "Mit dem Header auf jeden Fall dran. Brauchen wir sonst noch irgendwelche Header, Request"}, {"id": 990, "start": 7468.22, "end": 7483.82, "text": "oder was. Content. Ah, das glaube ich nicht so wild. Hier. Alles klar. Ähm. Stopp, dass"}, {"id": 991, "start": 7483.82, "end": 7495.1, "text": "Admin in der UL fehlt. Oh, ihr habt recht. Tatsächlich, Pog. So, with Header, Post Async."}, {"id": 992, "start": 7495.1, "end": 7500.34, "text": "Ok, Moment. Ich brauche keinen Post. Ich will einen Form. Kann das ein Formupload machen?"}, {"id": 993, "start": 7500.34, "end": 7517.74, "text": "Wie macht man einen Formupload? Leute, da bin ich überfragt. Form. Post Form. Form Post."}, {"id": 994, "start": 7517.74, "end": 7525.42, "text": "Ah, da gibt es Form Post. Guck mal, da gibt es doch schon. Post World Encoded Async. Alles"}, {"id": 995, "start": 7525.42, "end": 7530.06, "text": "klar. Das ist doch mal was. Wenn diese Seiten ordentliche Hilfe Pages haben, dann weiß"}, {"id": 996, "start": 7530.06, "end": 7540.5, "text": "man, da weiß man ja nichts, was man macht. Ok, Post World Encoded Data. Was poste ich"}, {"id": 997, "start": 7540.5, "end": 7553.66, "text": "denn da jetzt eigentlich? Genau. Doc is King. Genau. Request. Ja, die XML poste ich doch."}, {"id": 998, "start": 7553.66, "end": 7559.82, "text": "Theoretisch muss ich nur die XML posten. Content Type muss ich noch setzen. Nee, der Content"}, {"id": 999, "start": 7559.82, "end": 7571.86, "text": "Type ist der in der Form Data mit drinne. Oh, jetzt bin ich aber. Boah, kein Schimmer."}, {"id": 1000, "start": 7571.86, "end": 7595.14, "text": "Hoffen wir mal, dass das funktioniert. Ich bin jetzt etwas ratlos. Wie man das jetzt"}, {"id": 1001, "start": 7595.14, "end": 7624.74, "text": "postet. Form Data. Request. Ach nein, das muss ich machen. Multipart Form Data, oder?"}, {"id": 1002, "start": 7624.74, "end": 7638.82, "text": "Request. Multipart Form Data muss ich machen. Post Multipart Async. Ok, jetzt wird es aber"}, {"id": 1003, "start": 7638.82, "end": 7647.7, "text": "noch Sixheadiger. Was? Multipart. Ich mach das mal wie bei denen, das in der Hilfe drin"}, {"id": 1004, "start": 7647.7, "end": 7660.34, "text": "steht. Also. Post. Warum ist das nicht erlaubt zu awaiten? Ah, weil ich das Ding nicht Async"}, {"id": 1005, "start": 7660.34, "end": 7676.54, "text": "genannt hab. Ach so. Na dann. Ok, der was? Deswegen kommentieren wir den ganzen Shit"}, {"id": 1006, "start": 7676.54, "end": 7688.62, "text": "jetzt mal aus. Gucken, ob es tut. Also. Await API Create User. Gut. Post Multipart. Add"}, {"id": 1007, "start": 7688.62, "end": 7703.54, "text": "String. Ah, das sind jetzt die Files, oder? Also sprich Request. Name. File Name. Ok,"}, {"id": 1008, "start": 7703.54, "end": 7717.26, "text": "die zwei Sachen braucht man. Name. Name Action. Boah. Was ist das denn? Wie funkt? Ok, das"}, {"id": 1009, "start": 7717.26, "end": 7742.1, "text": "krieg ich nicht so einfach nachgebaut. Also, nur. Also wie geht das jetzt? Add. Ok, Add"}, {"id": 1010, "start": 7742.1, "end": 7758.3, "text": "String Content. So. Dort poste ich jetzt meine CSV rein. Also meine CSV wird ja im Endeffekt"}, {"id": 1011, "start": 7758.3, "end": 7769.3, "text": "ganz einfach so aussehen. Name. Komma. Fertig. Das ist meine ganze CSV. Also meine CSV. Kein"}, {"id": 1012, "start": 7769.3, "end": 7777.38, "text": "Encoding extra setzen. Aber Media Type will ich haben. Text CSV. Boah, das ist ja best"}, {"id": 1013, "start": 7777.38, "end": 7803.78, "text": "auf Bullshit Dateiformate, was die hier machen. Name. Name. Oh Gott, ich check das nicht."}, {"id": 1014, "start": 7803.78, "end": 7812.1, "text": "Was seh ich denn hier überhaupt? Und was geht? Ich versuch meinen Access Point über die nicht"}, {"id": 1015, "start": 7812.1, "end": 7823.86, "text": "offizielle API zu steuern. Gerade User anlegen. Alter, fuck man. Ich hab keine Ahnung, ob"}, {"id": 1016, "start": 7823.86, "end": 7834.82, "text": "das so funktioniert. Wo würde ich denn jetzt Filename noch angeben? Wo würde ich denn"}, {"id": 1017, "start": 7834.82, "end": 7839.18, "text": "jetzt hier das Filename angeben? Ich meine, ich würde jetzt davon ausgehen, dass da jetzt"}, {"id": 1018, "start": 7839.18, "end": 7846.3, "text": "so was rauskommt wie, wir lassen es mit Filename einfach mal weg. Content Typ. So. Das ist"}, {"id": 1019, "start": 7846.3, "end": 7854.06, "text": "der Content. So und jetzt brauch ich noch was anderes. Jetzt brauch ich noch was mit dem"}, {"id": 1020, "start": 7854.06, "end": 7878.18, "text": "Add String. Aber ein Add File. Aha. Ich bin extrem verwirrt. Ich hab keine Ahnung, wie"}, {"id": 1021, "start": 7878.18, "end": 7893.34, "text": "das funktioniert. Was das für ein Access Point ist. So einer hier. So einer. Ich hab"}, {"id": 1022, "start": 7893.34, "end": 7897.58, "text": "keine Ahnung, was ich hier mache. Also wir probieren es jetzt einfach mal. Es wäre cool,"}, {"id": 1023, "start": 7897.58, "end": 7902.58, "text": "wenn das Ding irgendwie eine ordentliche Debug Ausgabe hätte, weil ich kann halt nicht mitschneiden,"}, {"id": 1024, "start": 7902.58, "end": 7911.66, "text": "wie hart der DPS ist. Okay, Add. So wir brauchen auf jeden Fall noch ein Action Name Action."}, {"id": 1025, "start": 7911.66, "end": 7922.1, "text": "Das ist einfach nur ein String. Add String Name Action. Und das ist jetzt Upload Batch"}, {"id": 1026, "start": 7922.1, "end": 7937.14, "text": "DPSK. Und noch mal Add Callback. DPSK. So. Jetzt bin ich ja mal gespannt, ob das jetzt"}, {"id": 1027, "start": 7937.14, "end": 7943.66, "text": "String. Jetzt bin ich ja mal gespannt, ob er das jetzt macht. Kostet das wirklich 1000"}, {"id": 1028, "start": 7943.66, "end": 7948.78, "text": "Euro? Ja, wenn du es neu kaufst, was ich nicht machen würde, weil der 710 ist die Vorgänger"}, {"id": 1029, "start": 7948.78, "end": 7960.3, "text": "Generation. Also aktuell ist er 750. Der R750 ist Wi-Fi 6 und der hier ist Wi-Fi 5. Und"}, {"id": 1030, "start": 7960.3, "end": 7966.02, "text": "das reicht der dicke. Und kriegst du, also ich hab ihn für 260, 270 Euro bei eBay gekriegt."}, {"id": 1031, "start": 7966.02, "end": 7982.98, "text": "So. Okay, Leute, ich hab keine Ahnung, ob das funktioniert. Ich führe das jetzt einfach"}, {"id": 1032, "start": 7982.98, "end": 7992.3, "text": "aus. An error while sending the request. Ja, das ist jetzt busy nicht sagen, oder? Error"}, {"id": 1033, "start": 7992.3, "end": 8001.38, "text": "while sending request. Das kann ja alles bedeuten. Busy, vielleicht in busy sinnvolleren Hilfe"}, {"id": 1034, "start": 8001.38, "end": 8027.66, "text": "Exception Text. Irgendwas aussagekräftigeres? Ich würde das gerne. Kann man das irgendwie"}, {"id": 1035, "start": 8027.66, "end": 8044.58, "text": "debacken? Was der jetzt eigentlich genau schickt?"}, {"id": 1036, "start": 8044.58, "end": 8069.02, "text": "Before call, after call. Okay, das scheint äußerst sixheadig wieder zu sein."}, {"id": 1037, "start": 8069.02, "end": 8092.98, "text": "Ich würde halt gerne sehen, was ich, was ich poste. Schau doch noch mal eins drunter in"}, {"id": 1038, "start": 8092.98, "end": 8114.1, "text": "die Docs. Cookies. Cookies macht er ja anscheinend automatisch. Ich will keinen Error Handling"}, {"id": 1039, "start": 8114.1, "end": 8133.38, "text": "haben. Ich will einfach den Request, wie er ihn schickt, loggen. Before call, after call."}, {"id": 1040, "start": 8133.38, "end": 8143.98, "text": "Wire Shark geht nichts. Das ist HTTPS. Ich meine, ich könnte nette, hätte aufmachen,"}, {"id": 1041, "start": 8143.98, "end": 8148.58, "text": "mir dahin schicken lassen. Quatsch, mach ich. Nein, nein, nein, ich könnte, ich könnte"}, {"id": 1042, "start": 8148.58, "end": 8159.86, "text": "mir einfach nette aufmachen. So hier. Es bringt mir doch nichts, man wire. Shark HTTPS kann"}, {"id": 1043, "start": 8159.86, "end": 8163.66, "text": "Bojashark kann nur, wenn das Zertifikat, also wenn ich irgendeinen Proxy hätte."}, {"id": 1044, "start": 8165.36, "end": 8168.46, "text": "So, Fort 8000, ich mach, ich schick mir das einfach an"}, {"id": 1045, "start": 8168.86, "end": 8171.26, "text": "meinen eigenen, an die, meine eigene IP."}, {"id": 1046, "start": 8171.86, "end": 8173.66, "text": "127.0.0.1"}, {"id": 1047, "start": 8174.36, "end": 8174.96, "text": "Fort"}, {"id": 1048, "start": 8176.56, "end": 8177.56, "text": "8000"}, {"id": 1049, "start": 8178.46, "end": 8179.36, "text": "Was hab ich jetzt gemacht?"}, {"id": 1050, "start": 8179.36, "end": 8194.86, "text": "Was hab ich jetzt kaputt gemacht? Ach so. Ach so, weil HTTPS, lull, HTTPS."}, {"id": 1051, "start": 8200.36, "end": 8203.86, "text": "Aha, Leute, da haben wir es doch."}, {"id": 1052, "start": 8203.86, "end": 8207.36, "text": "Also."}, {"id": 1053, "start": 8217.86, "end": 8222.36, "text": "Das sieht doch von der Idee her gar nicht mal so falsch aus."}, {"id": 1054, "start": 8223.36, "end": 8225.86, "text": "Also so müsste es aussehen."}, {"id": 1055, "start": 8225.86, "end": 8229.86, "text": "So müsste es aussehen. Also die Nummer ist egal."}, {"id": 1056, "start": 8235.86, "end": 8239.86, "text": "So, das hier geht hier los im Endeffekt."}, {"id": 1057, "start": 8240.86, "end": 8242.86, "text": "Text, CSV."}, {"id": 1058, "start": 8244.86, "end": 8246.86, "text": "Das ist gut."}, {"id": 1059, "start": 8247.36, "end": 8249.86, "text": "Form, Data, Name, U. Ok."}, {"id": 1060, "start": 8249.86, "end": 8254.86, "text": "Das ist schon mal das Problem. Das müsste sein Filename gleich."}, {"id": 1061, "start": 8258.36, "end": 8261.86, "text": "Das ist eigentlich hauptsächlich der Unterschied, den ich jetzt sehe."}, {"id": 1062, "start": 8262.86, "end": 8265.36, "text": "Der Rest ist doch in Ordnung, oder?"}, {"id": 1063, "start": 8265.86, "end": 8269.86, "text": "Chat, der Rest sieht wirklich ziemlich, ziemlich gut aus."}, {"id": 1064, "start": 8270.86, "end": 8272.36, "text": "Das ist richtig."}, {"id": 1065, "start": 8273.36, "end": 8275.86, "text": "Upload, Upload, Upload."}, {"id": 1066, "start": 8275.86, "end": 8280.86, "text": "Das ist richtig. Uploader, blablabla."}, {"id": 1067, "start": 8281.36, "end": 8283.86, "text": "Callback, Action."}, {"id": 1068, "start": 8287.86, "end": 8290.86, "text": "Es fehlt nur beim CSV."}, {"id": 1069, "start": 8297.86, "end": 8304.36, "text": "Ja, beim CSV fehlt der Filename."}, {"id": 1070, "start": 8304.36, "end": 8307.36, "text": "Da müssen wir uns mal überlegen, wie wir das hinbekommen."}, {"id": 1071, "start": 8307.86, "end": 8310.36, "text": "Wie kriegen wir da ein File? Also String Content ist es schon mal nett."}, {"id": 1072, "start": 8310.86, "end": 8315.36, "text": "Also ist es wahrscheinlich Add File oder Add String Parts?"}, {"id": 1073, "start": 8326.86, "end": 8331.36, "text": "Ja, Moment, ich habe das als String. Ich will ja nicht wirklich ein File senden."}, {"id": 1074, "start": 8331.36, "end": 8335.36, "text": "Wie random String? Was?"}, {"id": 1075, "start": 8335.86, "end": 8340.36, "text": "Das ist random hier, ja. Das ist ok. Das darf immer anders sein."}, {"id": 1076, "start": 8341.36, "end": 8344.36, "text": "Also wie kriege ich denn jetzt hier?"}, {"id": 1077, "start": 8345.36, "end": 8347.36, "text": "Filename."}, {"id": 1078, "start": 8351.36, "end": 8354.36, "text": "String, Value, String Content Type."}, {"id": 1079, "start": 8355.36, "end": 8357.36, "text": "Add."}, {"id": 1080, "start": 8357.36, "end": 8362.36, "text": "Muss ich hier File Content machen? Vielleicht Add File Content?"}, {"id": 1081, "start": 8363.36, "end": 8365.36, "text": "Sowas hier?"}, {"id": 1082, "start": 8365.86, "end": 8368.36, "text": "Ja, der Path, das will ich ja nicht."}, {"id": 1083, "start": 8368.86, "end": 8374.36, "text": "Ok, HTTP, Client, Filename, Post."}, {"id": 1084, "start": 8375.36, "end": 8378.36, "text": "How to send File? Ja, zeige hier."}, {"id": 1085, "start": 8378.86, "end": 8380.86, "text": "Media."}, {"id": 1086, "start": 8382.36, "end": 8384.36, "text": "Das ist ja bescheuert."}, {"id": 1087, "start": 8384.36, "end": 8386.86, "text": "Multipart Form Content."}, {"id": 1088, "start": 8397.36, "end": 8399.36, "text": "Multipart Form."}, {"id": 1089, "start": 8399.86, "end": 8404.86, "text": "Multipart Form Data Content?"}, {"id": 1090, "start": 8408.86, "end": 8411.86, "text": "Ok, was ist das?"}, {"id": 1091, "start": 8411.86, "end": 8415.36, "text": "Ok, was zum?"}, {"id": 1092, "start": 8416.36, "end": 8418.36, "text": "Hä?"}, {"id": 1093, "start": 8418.86, "end": 8422.36, "text": "Alter, das ist ja High IQ Shit, Mann."}, {"id": 1094, "start": 8425.36, "end": 8428.36, "text": "Nee, das ist was anderes."}, {"id": 1095, "start": 8431.36, "end": 8436.36, "text": "Ich meine, ich will doch jetzt kein File schreiben, nur dass ich ein File da..."}, {"id": 1096, "start": 8436.36, "end": 8444.36, "text": "Ich meine, ok, wir können ja den String zu einem Stream machen und dann String, Stream, nee."}, {"id": 1097, "start": 8445.36, "end": 8451.36, "text": "Wie geht das? String, String, nee, String Reader?"}, {"id": 1098, "start": 8451.86, "end": 8455.36, "text": "So, ging das, ne?"}, {"id": 1099, "start": 8456.36, "end": 8460.36, "text": "Jetzt wird es aber kompliziert."}, {"id": 1100, "start": 8460.36, "end": 8469.36, "text": "Äh, ja, da kann man nämlich so tun, als wäre das ein File, CSV, so."}, {"id": 1101, "start": 8470.36, "end": 8475.36, "text": "Was habe ich jetzt verkehrt gemacht? Ah, Using, wow."}, {"id": 1102, "start": 8476.36, "end": 8483.36, "text": "String Reader. Jetzt sagen wir nämlich Add File, Name you, Name u."}, {"id": 1103, "start": 8483.36, "end": 8491.36, "text": "Ok, also String, Path, Stream, SR."}, {"id": 1104, "start": 8492.36, "end": 8496.36, "text": "File, Name, jetzt können wir den File, Name nämlich mitgeben."}, {"id": 1105, "start": 8496.86, "end": 8502.36, "text": "So, File, Name ist in dem Fall Badge."}, {"id": 1106, "start": 8503.36, "end": 8510.36, "text": "Ich nenne es einfach mal so, irgendwas mit Punkt CSV, vielleicht checkt er nämlich am Ende auch die Endung."}, {"id": 1107, "start": 8510.36, "end": 8515.86, "text": "Man weiß ja nie. So, das ist der File, Name."}, {"id": 1108, "start": 8516.86, "end": 8523.86, "text": "String, Content, Type, Text, CSV. So, Buffer Size brauchen wir nicht."}, {"id": 1109, "start": 8524.36, "end": 8527.86, "text": "So, warum geht das jetzt nicht? Was ist das Problem?"}, {"id": 1110, "start": 8532.86, "end": 8536.86, "text": "Ist das kein Stream oder was?"}, {"id": 1111, "start": 8536.86, "end": 8542.86, "text": "Nein. C Sharp, String, S, Stream."}, {"id": 1112, "start": 8543.86, "end": 8547.86, "text": "Weißt du, das brauchen wir normalerweise nicht."}, {"id": 1113, "start": 8557.86, "end": 8559.86, "text": "Memory Stream."}, {"id": 1114, "start": 8560.86, "end": 8564.86, "text": "Gott, Memory Stream. Auch gut."}, {"id": 1115, "start": 8564.86, "end": 8567.86, "text": "Ah, Memory Stream."}, {"id": 1116, "start": 8569.86, "end": 8571.86, "text": "Und was jetzt?"}, {"id": 1117, "start": 8572.86, "end": 8577.86, "text": "Wie kriegt man da jetzt den String rein, ohne irgendwie sich das Bein auszurenken?"}, {"id": 1118, "start": 8577.86, "end": 8593.86, "text": "Encoding, UTF, Get, Bytes. Alles klar."}, {"id": 1119, "start": 8594.86, "end": 8598.86, "text": "So, CSV, Stream."}, {"id": 1120, "start": 8599.86, "end": 8604.86, "text": "So, gut. Jetzt kann man das Post mal gucken, was jetzt dabei rauskommt."}, {"id": 1121, "start": 8604.86, "end": 8616.86, "text": "Tommy, was? Wie? Verstehe ich? Jetzt verstehe ich es gerade nicht."}, {"id": 1122, "start": 8617.86, "end": 8622.86, "text": "Jetzt kommt gar nichts an."}, {"id": 1123, "start": 8622.86, "end": 8638.86, "text": "Error while copying content to stream? Was? Wie jetzt?"}, {"id": 1124, "start": 8638.86, "end": 8653.86, "text": "Das ist... Wo ist denn das Problem? Das Using muss weg."}, {"id": 1125, "start": 8653.86, "end": 8668.86, "text": "Warum? Der soll den danach doch wieder aufräumen."}, {"id": 1126, "start": 8669.86, "end": 8681.86, "text": "Tatsächlich. Hä? Was macht denn das Using jetzt da? Warum? Warum macht das Probleme? Verstehe ich nicht."}, {"id": 1127, "start": 8681.86, "end": 8685.86, "text": "Also, das bekommen wir da jetzt als Antwort. Alles klar."}, {"id": 1128, "start": 8690.86, "end": 8695.86, "text": "Guck mal, Filename. Das sieht besser aus jetzt."}, {"id": 1129, "start": 8696.86, "end": 8705.86, "text": "Warum hat er hier Filename-Sternchen? Was ist das jetzt für ein Müll? Wo kommt denn das jetzt her?"}, {"id": 1130, "start": 8705.86, "end": 8710.86, "text": "Warum? Nee, das Using sollte das eigentlich nicht sofort schließen."}, {"id": 1131, "start": 8711.86, "end": 8722.86, "text": "Das Using sollte das schließen am Ende des Blocks, wenn er nimmer gebraucht wird."}, {"id": 1132, "start": 8723.86, "end": 8730.86, "text": "Das ist ja der Unterschied, wenn du es so schreibst, zu der alten Schreibweise mit den Klammern."}, {"id": 1133, "start": 8730.86, "end": 8737.86, "text": "Egal. Was auch immer."}, {"id": 1134, "start": 8738.86, "end": 8745.86, "text": "Das sieht doch jetzt eigentlich alles gut aus. Warum hat er denn jetzt Filename-Sternchen UTF-8 noch mal da hinten dran stehen?"}, {"id": 1135, "start": 8746.86, "end": 8758.86, "text": "Das ist das Encoding. Das Encoding will er aus irgendwelchen Gründen unbedingt da drin haben. Schauen wir mal, ob es funktioniert."}, {"id": 1136, "start": 8758.86, "end": 8769.86, "text": "Wir gucken einfach mal, ob es funktioniert jetzt. IP. Run. Please. Oh, das sieht gut aus."}, {"id": 1137, "start": 8770.86, "end": 8781.86, "text": "Es ist nicht abgekackt. Was ist das eigentlich für eine Response? Was ist das für eine Response schon wieder?"}, {"id": 1138, "start": 8782.86, "end": 8786.86, "text": "Ach, Moment. Ich kack Noob. Ich muss HTTPS machen."}, {"id": 1139, "start": 8786.86, "end": 8792.86, "text": "Ah, ich mache es falsch, Leute. Ich mache irgendwas falsch."}, {"id": 1140, "start": 8793.86, "end": 8798.86, "text": "Was mache ich falsch?"}, {"id": 1141, "start": 8799.86, "end": 8809.86, "text": "Okay, nochmal. Wir gucken uns das hier nochmal an. Nein, nervt mich jetzt nicht. Nein, ich will kein Admin Recoveren."}, {"id": 1142, "start": 8809.86, "end": 8829.86, "text": "Okay. Services. Upload. Example. Ja, so."}, {"id": 1143, "start": 8829.86, "end": 8841.86, "text": "Cookies. Ja, die Session setzt er ja hoffentlich von alleine, weil die anderen gehen ja auch so."}, {"id": 1144, "start": 8842.86, "end": 8854.86, "text": "Guck, der setzt überall das Cookie und das macht mein Client auch. Sonst könnte ich das ja gar nicht benutzen."}, {"id": 1145, "start": 8854.86, "end": 8871.86, "text": "Request. Hedder. Hab ich irgendwas vergessen? Request, Hedder."}, {"id": 1146, "start": 8872.86, "end": 8882.86, "text": "Wenn ihr Ideen habt, nur her. Also das Cookie setze ich ja auch das Cookie. Mist, ich dachte, ich hätte das Cookie vergessen. Dann wäre das ja relativ einfach gewesen."}, {"id": 1147, "start": 8882.86, "end": 8898.86, "text": "So, die Url stimmt auch. Es ist ein Post. So. Admin. Slash. Upload. Jsp. Äh, Moment."}, {"id": 1148, "start": 8898.86, "end": 8918.86, "text": "Ach, das ist, ähm. Soll ich das mal wegmachen? Was hat denn passiert?"}, {"id": 1149, "start": 8918.86, "end": 8942.86, "text": "Ähm. So."}, {"id": 1150, "start": 8942.86, "end": 8959.86, "text": "Also das mit dem Accept und so wird, denke ich, keinen Einfluss haben. Content Length. Multipart Form Data. Das ist genau das, was meiner auch schickt. Multipart Form Data Boundary. Das ist überhaupt kein Unterschied."}, {"id": 1151, "start": 8959.86, "end": 8986.86, "text": "Soll ich mal das Uploaden? Soll ich mal Uploaden das, was ich hier auch Uploade? Also quasi, äh, Downloads und dann, äh, Batch. Das, das da? Was Upload, was Upload ich hier eigentlich immer?"}, {"id": 1152, "start": 8986.86, "end": 9007.86, "text": "Ich Uploade das gleich immer. Was der Raspberry Pi tut? Was? Hä? Moment. Was, was? Was hab ich denn und was will er denn?"}, {"id": 1153, "start": 9007.86, "end": 9026.86, "text": "So. Muss jetzt Fivehead Proggers Kram hier machen. Komm, wir haben immer mehr User. Der hat das ja mit dem Anlegen schon gecheckt anscheinend. Keine Ahnung. Nee, jetzt, jetzt kann ich nicht."}, {"id": 1154, "start": 9026.86, "end": 9054.86, "text": "So. Also. Guckt mal. Warum geht das nicht? Check das net. Also. Ok. Welche Datei lade ich denn, lade ich denn hier immer hoch? Sample 1. Genau das lade ich da jetzt auch hoch. Das da. Genau das da."}, {"id": 1155, "start": 9054.86, "end": 9081.86, "text": "Also. Stream, wir geben jetzt tatsächlich die Datei direkt an. Also. String, Pass, Home, Home, Max, Downloads. So. Was ist jetzt? Was hat er für Schmerzen? Hab ich doch genau richtig gemacht. Pass. Content Type. Ach, Buffer Size."}, {"id": 1156, "start": 9081.86, "end": 9106.86, "text": "Pass. Content Type muss dann da hin. Das ist natürlich, haben sie sich jetzt super, super fiveheadig überlegt. Content Type. Buffer Size. Ah, jetzt brauch ich Buffer Size. Meinetwegen. Ok. Alles klar."}, {"id": 1157, "start": 9106.86, "end": 9126.86, "text": "Alles klar. Dann machen wir nochmal Netcat auf und schauen, ob das funktioniert. Aber lokal. Das, das, das ist eklig jetzt. Weil es könnte sein, dass er sich an alle möglichen stört, weil die sich, die müssen sich ja, wenn sie ihr eigenes Frontend und ihr eigenes Backend passen."}, {"id": 1158, "start": 9126.86, "end": 9146.86, "text": "Ach so. Ja, doch. Das sollte man vielleicht schon. Ja, ist recht. Sollte man machen. Ach, das kann man doch weglassen hier, oder? Das kann man weglassen, weil das wahrscheinlich selbst einfügt, wenn du außer Datei öffnest. So."}, {"id": 1159, "start": 9146.86, "end": 9169.86, "text": "Also, schauen wir mal. Was? Ah ne, es ist ja nicht Port. Es ist Port 8000. 8000. Was? Was macht der denn da jetzt?"}, {"id": 1160, "start": 9176.86, "end": 9188.86, "text": "Ich, ich blick nicht mal durch. Was ist denn jetzt wieder da? Warum sind da jetzt so komische, so komische Leerzeichen und Gedüllens dabei, ey man? Wegen dem Encoding vielleicht?"}, {"id": 1161, "start": 9188.86, "end": 9210.86, "text": "Nicht. Kann man Encoding setzen? Nein, kann man nicht. Nee, das ist nicht HTTPS. Teilname. Das sieht nicht, nicht richtig aus."}, {"id": 1162, "start": 9218.86, "end": 9232.86, "text": "Warum hat der denn jetzt da so komische, so komische Dinger drum herum? Die hat er doch vorher auch nicht gehabt. Guck, vorher sah das noch gut aus. Alter, ich hasse diesen Krempel, ey. Das ist der Wahnsinn."}, {"id": 1163, "start": 9232.86, "end": 9248.86, "text": "Oh man, egal. Wir testen jetzt einfach, ob es funktioniert. Vielleicht geht es jetzt ja auf magische Art und Weise. Ach so, welches Encoding hat denn dieser Krempel hier? Vielleicht liegt es ja daran."}, {"id": 1164, "start": 9248.86, "end": 9264.86, "text": "Äh, wie kriege ich denn das raus? Stats? Port noch weg."}, {"id": 1165, "start": 9264.86, "end": 9280.86, "text": "Äh, wie kriege ich denn das File Encoding raus? How can I find Encoding? File minus E."}, {"id": 1166, "start": 9280.86, "end": 9299.86, "text": "Aha, aha. Es ist nicht UTF-8, aber das ist egal, weil US ASCII ist kompatibel mit UTF-8. Es ist bestimmt irgendein ekliches Encoding-Problem, ich sag's euch."}, {"id": 1167, "start": 9299.86, "end": 9321.86, "text": "Äh, ach HTTPS, fuck man. Boah, oh kreise. Ist irgendwas an der URL falsch, oder?"}, {"id": 1168, "start": 9321.86, "end": 9340.86, "text": "Ich meine, ich mach Login und danach führ ich das aus. Also es ist ja nicht so, als würde ich in dem anderen mehr machen. Da ruf ich dann auch fertige Sachen auf, die Login brauchen."}, {"id": 1169, "start": 9340.86, "end": 9364.86, "text": "Tja, jetzt bin ich echt ein wenig überfragt, warum der Request sogar schon, warum der endet, prematurely endet. War ich irgendwas falsch?"}, {"id": 1170, "start": 9364.86, "end": 9374.86, "text": "Okay, wir machen jetzt mal eine Sache, wir machen das mal weg. Header, sagen einfach get und einfach ganz normal ein get. Mal gucken, was passiert, wenn ich ein get mache."}, {"id": 1171, "start": 9374.86, "end": 9401.86, "text": "Äh. Hä? Warum ist die Methode überhaupt da? Internal Server Error. Gut, also das geht schonmal nicht. Post. Einfach leerer Post machen."}, {"id": 1172, "start": 9401.86, "end": 9418.86, "text": "500. Internal Server. Gut, das ist doch schonmal, dass das vom Prinzip her gar nicht funktioniert, bis ich anfange. Bis ich prinzipiell das Richtige mache."}, {"id": 1173, "start": 9418.86, "end": 9440.86, "text": "Also kann man das im Prinzip wieder so lassen. Stream."}, {"id": 1174, "start": 9440.86, "end": 9455.86, "text": "Der hat keinen Platz mehr zu speichern. Doch, klar, da Platz zu speichern. Hab ich irgendwas übersehen? Werft er den Fehler, weil der User schon existiert?"}, {"id": 1175, "start": 9455.86, "end": 9470.86, "text": "Nee, das glaube ich nicht. Der hat den User ja noch gar nicht, der hat den User ja noch gar nicht angelegt. Was, jetzt will er noch File name?"}, {"id": 1176, "start": 9470.86, "end": 9495.86, "text": "Ah ja. Äh. Batch. Content-Type-Text-CSV."}, {"id": 1177, "start": 9495.86, "end": 9517.86, "text": "Ja, das ist gut so. Test-Port. 7.0.0.1. 1.8.000. Test-Port."}, {"id": 1178, "start": 9517.86, "end": 9545.86, "text": "So, jetzt gucken wir noch mal. Wir vergleichen den Kram jetzt noch mal. Ich bin jetzt nämlich echt ratlos, was der für Schmerzen hat. Ach, es ist immer noch HTTPS. Okay."}, {"id": 1179, "start": 9545.86, "end": 9567.86, "text": "Aber einfach, weiß ich nicht. Real. Weiß ich nicht. Es ist nur, dass ich es einfach austauschen kann. Ist nämlich HTTPS IP. Gut. Also. Dann wollen wir mal."}, {"id": 1180, "start": 9567.86, "end": 9589.86, "text": "Gut. Also. Das ist alles gut, was der hier macht. Ab hier geht es los. Das ist alles richtig. Post dahin. Guckt es euch an. Post."}, {"id": 1181, "start": 9589.86, "end": 9605.86, "text": "Was macht der denn da eigentlich vorher? Request. Vorher guckt er irgendwie, ob er noch genug Speicher hat oder sowas. Keine Ahnung. Das muss ich, das muss ich wahrscheinlich nicht machen. Das wäre ziemlich beknackt."}, {"id": 1182, "start": 9605.86, "end": 9632.86, "text": "So. Upload. Cookies. Ist das ist gesetzt. Filename. Ja, das ist. Es geht auf diese Uhr. Dann."}, {"id": 1183, "start": 9632.86, "end": 9652.86, "text": "Dann. Ja, das mit dem Filename ist anders. Das ist gut. Der Rest ist der Rest ist auch richtig. Content. Length. Er sagt Content Type Text CSV."}, {"id": 1184, "start": 9652.86, "end": 9667.86, "text": "Ich meine, hier hat das gequotet. Hier nicht. Aber ich gehe mal davon aus, dass das standardtechnisch alles okay ist, wenn das nicht gequotet ist. Und da hat er irgendwie so einen komischen Scheiß hier drinnen mit Filename Sternchen UTF 8."}, {"id": 1185, "start": 9668.86, "end": 9673.86, "text": "Das Check der Server bestimmt nicht hier. Wie kriege ich ihm das? Wie kriege ich ihm das abgewöhnt?"}, {"id": 1186, "start": 9673.86, "end": 9681.86, "text": "Et. Kann man nicht einfach sagen, dass das von Hand etten String Parts oder so?"}, {"id": 1187, "start": 9692.86, "end": 9698.86, "text": "Muss man das? Muss man das url encoden? Aber das sollte eigentlich auch für mich machen."}, {"id": 1188, "start": 9698.86, "end": 9707.86, "text": "Also et et file hängt irgendwie so ganz ekliges Zeug hier hinten dran an, was ich, was ich nicht haben will."}, {"id": 1189, "start": 9711.86, "end": 9719.86, "text": "Nee, da braucht keine Hedderow. Brauche nicht. Wisst ihr was? Wir machen mal. Können wir das mit einem Curl machen?"}, {"id": 1190, "start": 9719.86, "end": 9730.86, "text": "Nein, da habe ich keine. Nee, brauche ich nicht. Guck mal, ich kann es euch zeigen, dass das prinzipiell funktioniert. Wir gehen jetzt mal in nach Downloads."}, {"id": 1191, "start": 9731.86, "end": 9734.86, "text": "Vim. Batch."}, {"id": 1192, "start": 9736.86, "end": 9741.86, "text": "Das da nehme ich glaube ich immer. Batch Sample. Das da. Guck mal."}, {"id": 1193, "start": 9743.86, "end": 9746.86, "text": "Ich nehme jetzt mal nur die Datei und versuche die hochzuladen."}, {"id": 1194, "start": 9746.86, "end": 9755.86, "text": "Ja, muss ich nochmal refreshen. Und das ist auch nervig mit diesem bitte, bitte lock dich mal als Admin ein und mach Password Recovery an und so."}, {"id": 1195, "start": 9755.86, "end": 9759.86, "text": "Ich will keine Password Recovery. Ich setze mein Access Point einfach zurück."}, {"id": 1196, "start": 9760.86, "end": 9766.86, "text": "So. Also Sample. Wisst ihr? Funst. Upload."}, {"id": 1197, "start": 9766.86, "end": 9776.86, "text": "Keqv-User. Bam. Der macht aber halt immer aus irgendwelchen Gründen da noch ein U-Line unten dran."}, {"id": 1198, "start": 9778.86, "end": 9793.86, "text": "Meiner nicht. Nicht, dass man das bräuchte. Und Content-Type Text und so ist vertauscht, aber ok. Der Rest ist ja alles gut."}, {"id": 1199, "start": 9793.86, "end": 9810.86, "text": "Ich meine, soll ich auch mal ein U-Line unten dran machen? Vielleicht kann man das einfach hier dran machen. Dann geht's."}, {"id": 1200, "start": 9811.86, "end": 9818.86, "text": "Ja, jetzt haben wir da auch ein U-Line dran."}, {"id": 1201, "start": 9818.86, "end": 9832.86, "text": "Http 1.1. Was ist das? Http Version steht nicht dabei."}, {"id": 1202, "start": 9832.86, "end": 9840.86, "text": "Http Version steht nicht dabei."}, {"id": 1203, "start": 9841.86, "end": 9847.86, "text": "Http Version steht nicht dabei."}, {"id": 1204, "start": 9847.86, "end": 9862.86, "text": "Http Version steht nicht dabei."}, {"id": 1205, "start": 9862.86, "end": 9877.86, "text": "Http Version steht nicht dabei."}, {"id": 1206, "start": 9877.86, "end": 9892.86, "text": "Http Version steht nicht dabei."}, {"id": 1207, "start": 9892.86, "end": 9907.86, "text": "Http Version steht nicht dabei."}, {"id": 1208, "start": 9907.86, "end": 9922.86, "text": "Http Version steht nicht dabei."}, {"id": 1209, "start": 9922.86, "end": 9937.86, "text": "Http Version steht nicht dabei."}, {"id": 1210, "start": 9937.86, "end": 9952.86, "text": "Http Version steht nicht dabei."}, {"id": 1211, "start": 9952.86, "end": 9967.86, "text": "Http Version steht nicht dabei."}, {"id": 1212, "start": 9967.86, "end": 9982.86, "text": "Http Version steht nicht dabei."}, {"id": 1213, "start": 9982.86, "end": 9997.86, "text": "Http Version steht nicht dabei."}, {"id": 1214, "start": 9997.86, "end": 10012.86, "text": "Http Version steht nicht dabei."}, {"id": 1215, "start": 10012.86, "end": 10027.86, "text": "Http Version steht nicht dabei."}, {"id": 1216, "start": 10027.86, "end": 10042.86, "text": "Http Version steht nicht dabei."}, {"id": 1217, "start": 10042.86, "end": 10057.86, "text": "Http Version steht nicht dabei."}, {"id": 1218, "start": 10057.86, "end": 10072.86, "text": "Http Version steht nicht dabei."}, {"id": 1219, "start": 10072.86, "end": 10087.86, "text": "Http Version steht nicht dabei."}, {"id": 1220, "start": 10087.86, "end": 10102.86, "text": "Http Version steht nicht dabei."}, {"id": 1221, "start": 10102.86, "end": 10117.86, "text": "Http Version steht nicht dabei."}, {"id": 1222, "start": 10117.86, "end": 10132.86, "text": "Http Version steht nicht dabei."}, {"id": 1223, "start": 10132.86, "end": 10147.86, "text": "Http Version steht nicht dabei."}, {"id": 1224, "start": 10147.86, "end": 10162.86, "text": "Http Version steht nicht dabei."}, {"id": 1225, "start": 10162.86, "end": 10177.86, "text": "Http Version steht nicht dabei."}, {"id": 1226, "start": 10177.86, "end": 10192.86, "text": "Http Version steht nicht dabei."}, {"id": 1227, "start": 10192.86, "end": 10207.86, "text": "Http Version steht nicht dabei."}, {"id": 1228, "start": 10207.86, "end": 10222.86, "text": "Http Version steht nicht dabei."}, {"id": 1229, "start": 10222.86, "end": 10237.86, "text": "Http Version steht nicht dabei."}, {"id": 1230, "start": 10237.86, "end": 10252.86, "text": "Http Version steht nicht dabei."}, {"id": 1231, "start": 10252.86, "end": 10267.86, "text": "Http Version steht nicht dabei."}, {"id": 1232, "start": 10267.86, "end": 10282.86, "text": "Http Version steht nicht dabei."}, {"id": 1233, "start": 10282.86, "end": 10297.86, "text": "Http Version steht nicht dabei."}, {"id": 1234, "start": 10297.86, "end": 10312.86, "text": "Http Version steht nicht dabei."}, {"id": 1235, "start": 10312.86, "end": 10327.86, "text": "Http Version steht nicht dabei."}, {"id": 1236, "start": 10327.86, "end": 10342.86, "text": "Http Version steht nicht dabei."}, {"id": 1237, "start": 10342.86, "end": 10357.86, "text": "Http Version steht nicht dabei."}, {"id": 1238, "start": 10357.86, "end": 10372.86, "text": "Http Version steht nicht dabei."}, {"id": 1239, "start": 10372.86, "end": 10387.86, "text": "Http Version steht nicht dabei."}, {"id": 1240, "start": 10387.86, "end": 10402.86, "text": "Http Version steht nicht dabei."}, {"id": 1241, "start": 10402.86, "end": 10417.86, "text": "Http Version steht nicht dabei."}, {"id": 1242, "start": 10417.86, "end": 10432.86, "text": "Http Version steht nicht dabei."}, {"id": 1243, "start": 10432.86, "end": 10447.86, "text": "Http Version steht nicht dabei."}, {"id": 1244, "start": 10447.86, "end": 10462.86, "text": "Http Version steht nicht dabei."}, {"id": 1245, "start": 10462.86, "end": 10477.86, "text": "Http Version steht nicht dabei."}, {"id": 1246, "start": 10477.86, "end": 10492.86, "text": "Http Version steht nicht dabei."}, {"id": 1247, "start": 10492.86, "end": 10507.86, "text": "Http Version steht nicht dabei."}, {"id": 1248, "start": 10507.86, "end": 10522.86, "text": "Http Version steht nicht dabei."}, {"id": 1249, "start": 10522.86, "end": 10537.86, "text": "Http Version steht nicht dabei."}, {"id": 1250, "start": 10537.86, "end": 10552.86, "text": "Http Version steht nicht dabei."}, {"id": 1251, "start": 10552.86, "end": 10567.86, "text": "Http Version steht nicht dabei."}, {"id": 1252, "start": 10567.86, "end": 10582.86, "text": "Http Version steht nicht dabei."}, {"id": 1253, "start": 10582.86, "end": 10597.86, "text": "Http Version steht nicht dabei."}, {"id": 1254, "start": 10597.86, "end": 10612.86, "text": "Http Version steht nicht dabei."}, {"id": 1255, "start": 10612.86, "end": 10627.86, "text": "Http Version steht nicht dabei."}, {"id": 1256, "start": 10627.86, "end": 10642.86, "text": "Http Version steht nicht dabei."}, {"id": 1257, "start": 10642.86, "end": 10657.86, "text": "Http Version steht nicht dabei."}, {"id": 1258, "start": 10657.86, "end": 10672.86, "text": "Http Version steht nicht dabei."}, {"id": 1259, "start": 10672.86, "end": 10687.86, "text": "Http Version steht nicht dabei."}, {"id": 1260, "start": 10687.86, "end": 10702.86, "text": "Http Version steht nicht dabei."}, {"id": 1261, "start": 10702.86, "end": 10717.86, "text": "Http Version steht nicht dabei."}, {"id": 1262, "start": 10717.86, "end": 10732.86, "text": "Http Version steht nicht dabei."}, {"id": 1263, "start": 10732.86, "end": 10747.86, "text": "Http Version steht nicht dabei."}, {"id": 1264, "start": 10747.86, "end": 10762.86, "text": "Http Version steht nicht dabei."}, {"id": 1265, "start": 10762.86, "end": 10777.86, "text": "Http Version steht nicht dabei."}, {"id": 1266, "start": 10777.86, "end": 10792.86, "text": "Http Version steht nicht dabei."}, {"id": 1267, "start": 10792.86, "end": 10807.86, "text": "Http Version steht nicht dabei."}, {"id": 1268, "start": 10807.86, "end": 10822.86, "text": "Http Version steht nicht dabei."}, {"id": 1269, "start": 10822.86, "end": 10837.86, "text": "Http Version steht nicht dabei."}, {"id": 1270, "start": 10837.86, "end": 10852.86, "text": "Http Version steht nicht dabei."}, {"id": 1271, "start": 10852.86, "end": 10867.86, "text": "Http Version steht nicht dabei."}, {"id": 1272, "start": 10867.86, "end": 10882.86, "text": "Http Version steht nicht dabei."}, {"id": 1273, "start": 10882.86, "end": 10897.86, "text": "Http Version steht nicht dabei."}, {"id": 1274, "start": 10897.86, "end": 10912.86, "text": "Http Version steht nicht dabei."}, {"id": 1275, "start": 10912.86, "end": 10927.86, "text": "Http Version steht nicht dabei."}, {"id": 1276, "start": 10927.86, "end": 10942.86, "text": "Http Version steht nicht dabei."}, {"id": 1277, "start": 10942.86, "end": 10957.86, "text": "Http Version steht nicht dabei."}, {"id": 1278, "start": 10957.86, "end": 10972.86, "text": "Http Version steht nicht dabei."}, {"id": 1279, "start": 10972.86, "end": 10987.86, "text": "Http Version steht nicht dabei."}, {"id": 1280, "start": 10987.86, "end": 11012.86, "text": "Http Version steht nicht dabei."}, {"id": 1281, "start": 11012.86, "end": 11027.86, "text": "Http Version steht nicht dabei."}, {"id": 1282, "start": 11027.86, "end": 11042.86, "text": "Http Version steht nicht dabei."}, {"id": 1283, "start": 11042.86, "end": 11057.86, "text": "Http Version steht nicht dabei."}, {"id": 1284, "start": 11057.86, "end": 11072.86, "text": "Http Version steht nicht dabei."}, {"id": 1285, "start": 11072.86, "end": 11087.86, "text": "Http Version steht nicht dabei."}, {"id": 1286, "start": 11087.86, "end": 11102.86, "text": "Http Version steht nicht dabei."}, {"id": 1287, "start": 11102.86, "end": 11117.86, "text": "Http Version steht nicht dabei."}, {"id": 1288, "start": 11117.86, "end": 11132.86, "text": "Http Version steht nicht dabei."}, {"id": 1289, "start": 11132.86, "end": 11147.86, "text": "Http Version steht nicht dabei."}, {"id": 1290, "start": 11147.86, "end": 11162.86, "text": "Http Version steht nicht dabei."}, {"id": 1291, "start": 11162.86, "end": 11177.86, "text": "Http Version steht nicht dabei."}, {"id": 1292, "start": 11177.86, "end": 11192.86, "text": "Http Version steht nicht dabei."}, {"id": 1293, "start": 11192.86, "end": 11207.86, "text": "Content"}, {"id": 1294, "start": 11208.86, "end": 11219.86, "text": "Content"}, {"id": 1295, "start": 11219.86, "end": 11234.86, "text": "Content"}, {"id": 1296, "start": 11234.86, "end": 11249.86, "text": "Content"}, {"id": 1297, "start": 11249.86, "end": 11264.86, "text": "Content"}, {"id": 1298, "start": 11264.86, "end": 11279.86, "text": "Content"}, {"id": 1299, "start": 11280.86, "end": 11291.86, "text": "Content"}, {"id": 1300, "start": 11291.86, "end": 11306.86, "text": "Content"}, {"id": 1301, "start": 11306.86, "end": 11321.86, "text": "Content"}, {"id": 1302, "start": 11321.86, "end": 11336.86, "text": "Content"}, {"id": 1303, "start": 11336.86, "end": 11351.86, "text": "Content"}, {"id": 1304, "start": 11351.86, "end": 11366.86, "text": "Content"}, {"id": 1305, "start": 11366.86, "end": 11381.86, "text": "Content"}, {"id": 1306, "start": 11381.86, "end": 11396.86, "text": "Content"}, {"id": 1307, "start": 11396.86, "end": 11421.86, "text": "Content"}, {"id": 1308, "start": 11421.86, "end": 11436.86, "text": "Content"}, {"id": 1309, "start": 11436.86, "end": 11461.86, "text": "Content"}, {"id": 1310, "start": 11461.86, "end": 11474.86, "text": "Content"}, {"id": 1311, "start": 11474.86, "end": 11501.86, "text": "Content"}, {"id": 1312, "start": 11501.86, "end": 11514.86, "text": "Content"}, {"id": 1313, "start": 11515.86, "end": 11528.86, "text": "Content"}, {"id": 1314, "start": 11528.86, "end": 11543.86, "text": "Content"}, {"id": 1315, "start": 11543.86, "end": 11558.86, "text": "Content"}, {"id": 1316, "start": 11558.86, "end": 11573.86, "text": "Content"}, {"id": 1317, "start": 11573.86, "end": 11588.86, "text": "Content"}, {"id": 1318, "start": 11588.86, "end": 11613.86, "text": "Content"}, {"id": 1319, "start": 11613.86, "end": 11628.86, "text": "Content"}, {"id": 1320, "start": 11629.86, "end": 11638.86, "text": "Content"}, {"id": 1321, "start": 11638.86, "end": 11653.86, "text": "Content"}, {"id": 1322, "start": 11654.86, "end": 11665.86, "text": "Content"}, {"id": 1323, "start": 11665.86, "end": 11680.86, "text": "Content"}, {"id": 1324, "start": 11681.86, "end": 11690.86, "text": "Content"}, {"id": 1325, "start": 11690.86, "end": 11705.86, "text": "Content"}, {"id": 1326, "start": 11705.86, "end": 11720.86, "text": "Content"}, {"id": 1327, "start": 11720.86, "end": 11745.86, "text": "Content"}, {"id": 1328, "start": 11745.86, "end": 11760.86, "text": "Content"}, {"id": 1329, "start": 11760.86, "end": 11785.86, "text": "Content"}, {"id": 1330, "start": 11785.86, "end": 11800.86, "text": "Content"}, {"id": 1331, "start": 11800.86, "end": 11815.86, "text": "Content"}, {"id": 1332, "start": 11815.86, "end": 11840.86, "text": "Content"}, {"id": 1333, "start": 11840.86, "end": 11865.86, "text": "Content"}, {"id": 1334, "start": 11865.86, "end": 11880.86, "text": "Content"}, {"id": 1335, "start": 11880.86, "end": 11895.86, "text": "Content"}, {"id": 1336, "start": 11895.86, "end": 11910.86, "text": "Content"}, {"id": 1337, "start": 11910.86, "end": 11925.86, "text": "Content"}, {"id": 1338, "start": 11925.86, "end": 11940.86, "text": "Content"}, {"id": 1339, "start": 11940.86, "end": 11955.86, "text": "Content"}, {"id": 1340, "start": 11955.86, "end": 11980.86, "text": "Content"}, {"id": 1341, "start": 11980.86, "end": 11995.86, "text": "Content"}, {"id": 1342, "start": 11995.86, "end": 12020.86, "text": "Content"}, {"id": 1343, "start": 12020.86, "end": 12035.86, "text": "Content"}, {"id": 1344, "start": 12035.86, "end": 12060.86, "text": "Content"}, {"id": 1345, "start": 12060.86, "end": 12075.86, "text": "Content"}, {"id": 1346, "start": 12075.86, "end": 12100.86, "text": "Content"}, {"id": 1347, "start": 12100.86, "end": 12115.86, "text": "Content"}, {"id": 1348, "start": 12115.86, "end": 12140.86, "text": "Content"}, {"id": 1349, "start": 12140.86, "end": 12155.86, "text": "Content"}, {"id": 1350, "start": 12155.86, "end": 12180.86, "text": "Content"}, {"id": 1351, "start": 12180.86, "end": 12195.86, "text": "Content"}, {"id": 1352, "start": 12195.86, "end": 12220.86, "text": "Content"}, {"id": 1353, "start": 12220.86, "end": 12235.86, "text": "Content"}, {"id": 1354, "start": 12235.86, "end": 12250.86, "text": "Content"}, {"id": 1355, "start": 12250.86, "end": 12275.86, "text": "Content"}, {"id": 1356, "start": 12275.86, "end": 12290.86, "text": "Content"}, {"id": 1357, "start": 12290.86, "end": 12315.86, "text": "Content"}, {"id": 1358, "start": 12315.86, "end": 12340.86, "text": "Content"}, {"id": 1359, "start": 12340.86, "end": 12355.86, "text": "Content"}, {"id": 1360, "start": 12355.86, "end": 12380.86, "text": "Content"}, {"id": 1361, "start": 12380.86, "end": 12395.86, "text": "Content"}, {"id": 1362, "start": 12395.86, "end": 12420.86, "text": "Content"}, {"id": 1363, "start": 12420.86, "end": 12435.86, "text": "Content"}, {"id": 1364, "start": 12435.86, "end": 12460.86, "text": "Content"}, {"id": 1365, "start": 12460.86, "end": 12475.86, "text": "Content"}, {"id": 1366, "start": 12475.86, "end": 12500.86, "text": "Content"}, {"id": 1367, "start": 12500.86, "end": 12515.86, "text": "Content"}, {"id": 1368, "start": 12515.86, "end": 12540.86, "text": "Content"}, {"id": 1369, "start": 12540.86, "end": 12555.86, "text": "Content"}, {"id": 1370, "start": 12555.86, "end": 12570.86, "text": "Content"}, {"id": 1371, "start": 12570.86, "end": 12595.86, "text": "Content"}, {"id": 1372, "start": 12595.86, "end": 12610.86, "text": "Content"}, {"id": 1373, "start": 12610.86, "end": 12635.86, "text": "Content"}, {"id": 1374, "start": 12635.86, "end": 12650.86, "text": "Content"}, {"id": 1375, "start": 12650.86, "end": 12665.86, "text": "Content"}, {"id": 1376, "start": 12665.86, "end": 12690.86, "text": "Content"}, {"id": 1377, "start": 12690.86, "end": 12702.86, "text": "Content"}]}