{"text": "Hallo Ach, ihr habt mich die ganze Zeit nicht gehörtoder was? Ihr habt mich null gehört oder was? Ich rede mit euch schon seit 5 minuten.Aber guckt mal, das ist doch wieder ein Beweis, wie beschissen Windows ist oder? Ich hab nichtsgeändert, ich hab nichts ausgesteckt, ich hab nichts eingesteckt, ich hab einfach nur,doch ich hab ein Update gemacht vorhin. Ich hab Windows Update gemacht. Warum stellt einWindows Update mein Default Audio um? Warum ist das so scheiße? Warum kann es sich Microsofterlauben, sich bei sowas absolut keine Mühe zu geben? Ok, dann werde ich nochmal alles erzählen,was ich jetzt die letzten 5 minuten erzählt hab. Als erstes hab ich gesagt, ich hab vorhin was beimir daheim gefunden in der Kiste. Neuer Audio Treiber. Ne, ich hab Windows Update gemacht.Also, blablabla. Ne, das hört sich an wie immer. Hat der vielleicht den Sound wieder umgestellt?Also, ich hab vorhin bei mir in der Kiste sowas gefunden. Ich dachte mir so kritisch,dass sie mir den Kram heutzutage so nennt. Das wär bestimmt heute anders benannt worden.Dann hab ich ein paar andere Sachen dazu erzählt, die weiß ich jetzt aber nicht mehr. Ja,dass man das wahrscheinlich heute noch braucht, weil heute auch immer noch VGA im Umlauf ist,so für Oldschool-Beamer und sowas. Dann hab ich noch irgendwas erzählt über dieAussprache von Amazon oder so, keine Ahnung. 108, Moment. Das hab ich gelesen. Das ist ja auchgut so. Breakthrough ist ja auch absoluter Dreck mit den Maps, wie es jetzt ist und dem Punkteplacement.128 Spieler ist halt noch viel, viel mehr Crap. Das Problem ist, dass dieser Spielmodus,so wie jetzt, auch mit 64 Spielern nicht funktioniert. Das ist halt lächerlich. Aber ganz ehrlich,das Spiel ist eh dead. Das wird auch nie alive sein wieder. Die haben vorhin eineneue Skin angekündigt. Da hab ich mir auch gedacht, endlich ein neuer Skin. Da hab ich aber ganz schönlange drauf gewartet. Jetzt werd ich wieder installieren. Und ich hab gesagt, heute kaufenwir endlich mal richtig den Kram ein, den ich das letzte Mal immer nur gesagt hab,dass ich den endlich mal einkaufen muss, weil es wird echt Zeit. Ich hab jetzt drei Streamsgemacht und wir haben nur geschwätzt oder zwei Streams und wir haben nur geschwätzt. Und ichbin nicht dazu gekommen. Übrigens, wo wir gerade dabei sind, ich habe vorhin gesehen,man bekommt aktuell, weil wir es ja letztens von meinen Access Points hatten, man bekommt aktuellaus England einen relativ günstig, wenn man schnell ist beim Beaten. Und zwar bald endend. Der ist esnicht. Der ist bisschen teuer. Man bekommt in drei Tagen einen aus England für 270 Euro ungefähr,wenn da sonst keiner drauf bietet. Könnt ihr ja mal gucken. Nee, nee, nee, nicht aus FreedomKocona. Der hier. Also wer auch so ein Access Point guckt, kann ja gucken aus England. Englandgeht über diese eBay, über dieses eBay Shipping. Das dauert meistens fünf, sechs Tage oder so eineWoche, dann ist es da. Und ihr bezahlt aktuell 150 Pfund und dann nochmal irgendwie, ja,sagen wir nochmal 70 Pfund obendrauf. Also sprich 230, nee, 220 Pfund, 220 Pfund in Euro sind 260,260 Euro. Das ist doch okay. Das ist in Ordnung. Natürlich nur, wenn das bei Mindestgebot rausgeht,was wahrscheinlich nicht so sein wird. Also mehr als 300 Euro würde ich nicht bezahlen. Aber ichhabe gesehen, was bald abläuft. Also falls einer auch noch Bock auf richtig schnell einen AccessPoint hat, gibt euch. Mal wegen dem Label-Champ und einem eigenen Projekt heran, das wäre diebeste Möglichkeit von einer Web-Anwendung einen Druck auf einen angeschlossenen Drucker zuinitiieren ohne irgendwelche Browser Druck zu haben. Nee, also mit JavaScript kannst dues insofern vergessen, weil du müsstest ja irgendwie diesen Drucker über, über,wie heißt dieses Netzwerk Druckprotokoll? Ehm, ehm, ehm, Epp. Das müsstest du über Epp machen,das kannst du nicht. Das geht nicht, weil da müsstest du TCP-Sockets haben und TCP-SocketsZugriff hast du mit JavaScript nicht, deswegen kannst du das knicken, das heißt du brauchstauf jeden Fall irgendein Backend was das macht und die einfachste Variante in dem Fall istnatürlich, also du willst ja nicht über Windows den Kram adden, über die Windows Druckersuche,aber du kannst irgendeinen Backend machen was IPP spricht, da gibt es für die meistenSprachen Libraries, sogar für.NET gibt es welche.IPP, also wenn das ein Netzwerkdrucker ist, ich gehe mal davon aus, ich gehe mal davonaus es ist ein Netzwerkdrucker, weil du willst die Daten zum Drucker bekommen, also wenndas ein Netzwerkdrucker ist dann IPP, da gibt es wie gesagt.NET, da gibt es für alles,da gibt es für Go Libraries, für Node, du kannst auch in Node.js, kannst du auch machen,Node.js hat sogar eine relativ gute, habe ich gesehen, IPP Library, keine Ahnung, du musstmal gucken welche, aber die scheint ganz gut zu porten, also die einfachste Variante wärein dem Fall denke ich irgendein mini Backend, sei es Go, sei es.NET, sei es Node und miteinem AP Endpunkt nämlich Upload von einem Bild oder so und dann kannst du es per IPPdahin schicken.Oh ja, ich habe es mitbekommen, die haben die Eintracht empfangen in Frankfurt auf irgendeinemPlatz, ich weiß nicht, Fußball juckt mich absolut gar nicht und jetzt ist Unwetter,es geht richtig ab, guckt euch das mal an, irgendwie brauchen wir eine Wetterkarte oderso, passt mal ab in Hanau, nicht in Hanau auch, aber in Frankfurt, in Frankfurt istgerade richtig MonkaS angesagt, Unwetterwarnung, ok es ist mehr oder weniger schon drüber,es ist mehr oder weniger schon drüber über Frankfurt, aber sag euch, da geht es ab gerade,ja auf dem Römer, stimmt, die werden eigentlich immer auf dem Römer empfangen, aber ichdenke hier geht es richtig ab, gerade, ich bin ja in Hanau, das wisst ihr, manche wahrscheinlichund in Hanau hat es gerade die letzte halbe Stunde so krass gewittert und gestürmt alsdie Katze ist auf dem Sofa, die hat Panik gekriegt, was ist hier los, nix sie weg, MonkaShake,ja, also hier unwettermäßig, wo wir gerade dabei sind, jetzt kann ich doch mal gucken,ob es mal eine Wetterstation gecheckt hat, Sekunde Leute, Wetter, Wetter Station, wassagt die Wetter Station, Wind, Regen, ok aktuell kein Regen mehr, aber zwischenzeitlich 2,3mm pro Stunde, was bedeutet mm pro Stunde, was steht das mm, Niederschlag, oh das ist5 Head Unit, wusste ich gar nicht, dass es das gibt, mm pro Stunde, das sind keine Millimeteroder, das ist irgendwas, da müsste es ja die Öffnung genormt sein, wenn das Millimetersind, mm, wie rechnet man das aus, ein mittelstarker Regenschauer, ein mittelstarker Regenschauermittelhoch war das von 5 mm, also ich hatte 7 oder 8, ich glaube 7 mm hatte ich geradeRegen mit meiner Wetterstation gemessen hier, 7,8, 8, sagen wir 8, 8 mm habe ich geradegemessen, 8 mm scheint mir ja relativ viel zu sein, also es ist zwischen, zwischen mittelstarker,also ein starker Regenschauer war das, es war kein Starkregen, aber die Wetterstationsteht ja auch nicht komplett irgendwie weit weg von allen Gebäuden oder auf den Baumoben drauf oder so, also das regnet wahrscheinlich auch ein bisschen aufs Dach nebenbei, obwohles eigentlich nicht unter dem Dach steht, ja, also jetzt wird es zusammen auch was geben,aber ich habe keine Ahnung, warum es mm pro Stunde ist, kann mir das, aha die Höhe,1 Liter pro Quadratmeter und Stunde ergibt 1 mm Regenhöhemenge in einer Stunde, achso, alter das ist ja die absolute Pfeiferteinheit, Big, Biggest Brain brauchste dafür, 1 Literpro Quadratmeter, also sind 8 dann 8 Liter pro Quadratmeter, keine Ahnung, Liter proQuadratmeter könnte ich irgendwie mehr anfangen, aber man kann das ja umrechnen, das ist tatsächlichinteressant, das wusste ich nicht, ja, also das mit dem Drucker, also das mit dem Druckerhaben wir ja beantwortet, also wenn du was wissen willst, schieß los, hast du den Wasserkocherschon gekauft, ne bestellen wir heute aber alles, Matheprüfung und wir sind gelaufen,ich habe heute meinen Chef geschockt auf der Arbeit, ich hoffe mal er guckt jetzt nichtzu gerade, man weiß ja nie, wir hatten monatliche Rücksprache und ich habe mich erst ein bisschenausgelassen, was mir auf den Keks geht und sonst wie was und dann habe ich zu ihm gesagt,ja wir müssen uns auch mal wieder über mehr Geld unterhalten und dann hat er gemeint,gut dass ich sitze, aber gut, da musste durch als Führungskraft, hauptsache eine Wetterstationund das nicht wissen, ja als kaufst du dir irgendwas und weißt alles im Detail, sobalddu es hast durch irgendwelche Eingebungen, ja ganz bestimmt, Inflation dies das, daslassen sie bestimmt nicht gelten, weil im Prinzip es ist egal wann du fragst, dein Arbeitgebersagt immer so, oh jetzt ist ganz schlecht, jetzt ist gerade eine ungünstige Gelegenheit,aber dann jedes Jahr erzählen nach dem Motto, wir haben ein neues Rekord ja, wir sind dieallergeilsten, ah aber jetzt ist schlecht, Corona ist schlecht, jetzt ist was anderesschlecht, ah man, also irgendwelche Tipps um an einen Raspberry Pi zu kommen, also ichhabe meine letzten Barberry Base gekauft, da hatten die noch kurzzeitig welche, ich habeRaspberry Pi 4s gekauft mit 8G für, ich weiß nicht mehr 120 Euro oder ne, 8G ne mit Netzteil120 Euro, ihr wisst wir haben es zusammen im Stream gekauft, die Sache ist bloß die,dass wahrscheinlich auch Barberry Base aktuell keine Raspberry Pi's hat, vermute ich jetzt,vermute ich jetzt einfach mal, derzeit nicht lieferbar ja, haben die sowas wie sofort lieferbar,das Netzteil ist lieferbar, nice, nice, das wichtig, wichtig, wichtig, ganz ganz wichtig,Leute ich muss mal nebenbei hören ob mein 3D Drucker fertig ist, dass ich den dann ausschaltenkann, ich druck nämlich gerade ein, ich druck kein Nanoleaf, dass ich schwachsinn, ich druckmir gerade ein Shell, Shelf Mount oder so, keine Ahnung wie das eigentlich genau heißt,ein Winkel für ein Regal oder für eine Holzplatte an der Wand, keine Ahnung nach was ich suchenmuss, what, nicht Self, Shelf, Shelf Alter, kein Planer, zumindest ich druck mir geradeso, naja nicht sowas aber so ein Winkel, sowas hier in der Richtung druck ich mir geradeaus und das braucht ungefähr eine Stunde pro, ja hier Winkel und ich will den dann ausmachenweil der 3D Drucker da ist immer so laut und der macht hier ganz viel Feinstaub, mein IkeaSensor ist schon wieder auf Mittel, Raspberry Pi 2GB, nee gibt nix, aber seriously daseinzige was lieferbar ist, ist wirklich, guck mal ich hab gesagt sofort lieferbar und waszeigt ihr mir an ein Raspberry Pi der nicht lieferbar ist, ja das ist ja richtig pfeifertdie Seite, welchen 3D Drucker hast du, ich hab ein I3 Mega S seit ein paar Jahren schon,würde ich jetzt nicht mehr kaufen, also nicht weil er schlecht ist, sondern weil es mittlerweilebessere gibt, noch bessere Einsteiger Drucker, aber der war ziemlich nice und ist auch nocheigentlich ganz nice, einzig was bei dem dumm ist und das ist heute glaube ich auch im EinsteigerBereich möglich, ist das der automatische Kalibrierung von der Platte und dem Druckkopfund sowas hat, oder wie heißt das, Extruder, nee das heißt ja nicht Druckkopf, Nozzle,die Nozzle ist es genau, nee nachdem ich es jetzt mal ordentlich eingestellt hab ist okay,aber so Auto Leveling und Messen und so finde ich wirklich cool, hat der halt nicht, werdeich auch nicht nachrüsten, so also die haben anscheinend wirklich keinerlei Raspberry Pies,keine Chance, das an PoE hat, aber das gute bei mir ist, ich hab noch 3 Raspberry Pie,äh stimmt nicht, zwei Raspberry Pie 4 im Fleer Case hier rumstehen, weil ich hab einen ausdem Wohnzimmer letztens abgebaut, den brauch ich nicht mehr, da ist jetzt temporär erstmalwieder der Odroid dran und dann kommt vielleicht bald was anderes, was wir heute kaufen unddann hab ich noch einen Raspberry Pie 3, das sollte reichen für nächste Zeit, RaspberryPie Needs, wer los man, nö, ich verlos doch in der aktuellen Keilzeit, kein RaspberryPie, warum soll ich das denn machen, also ich bin ja manchmal blöd, aber so blöd, dassich Raspberry Pie in der Zeit aus den Händen geb, bin ich nicht, ne okay die haben keinen,ja bei Berry Base hat man manchmal tatsächlich noch Glück, aber, schauen wir mal, ob irgendwoirgendein Laden was hat, das halte ich für ein Gerücht, lagern beim Händler für 48Euro, nutzt du ein Repetier Server, nö, ich hab da ein Octopie dran und der schickt dasdahin und dann die Onboard-Firmware, die das druckt, ah, der 3 habt ihr es gehört, Piep,der 3D Drucker ist fertig, muss ich kurz warten, bis er abgekühlt ist, der Raspberry Pie Locator,das ist quasi der Preis-Champ nur in nicht so hübsch oder wie, Berry Base, sag ich doch,aber in Last Stock, guck mal seht ihr das, Last in Stock, die hatten alle zuletzt einenim April, das ist ja krass, so und das hier ist Cheap Bait, angeblich, was ist denn dasjetzt schon wieder, angeblich 48 Euro, so und wo soll das sein, Cheap Baited, guckmal hier, ab 48 Euro, wo, wo ist es, angeblich lagern ab 48 Euro, wo, wo, wo ist es, ichseh hier nix, also, wo soll das sein, ja welche, welche Variante denn, alle Varianten anzeigen,Cheap Baited, einfach, ah hier, 1G, wusste ich gar nicht, dass es den 4er in 1G gibt,was ist denn da UVP von dem Ding, 30, ich mein 1GB reicht für 90% der Dinger, dieman machen will auf den Dingern aus, aber ganz ehrlich, ich find so der, der Sweet Spotnormalerweise ist bei 2 besser, besser bei 4GB, 8GB braucht man nicht, also mir fälltein, fällt euch was ein Chat, was, für was braucht man 8GB RAM auf dem Raspberry Pi,also mir fällt kein wirklich sinnvolles Anwendungsgebiet ein, außer so komische, ja fast schon esoterischeDinger, wie einen, einen Kubernetes Cluster daheim zu betreiben mit 3 Raspberry Pis undganz vielen Containern und so, aber das macht ja keiner, ok Minecraft, ja, ja gut, wer Minecraftauf dem Raspberry Pi hostet, vielleicht, also, fällt mir grad, äh, fällt mir nix zu ein,1G ist auch irgendwie, ist nicht auch blöd, aber der Kram ist wirklich extrem teuer, alsoich hatte Glück, ich hab bei Berry Base das Ding für, ihr erinnert euch vielleicht, 120Euro, wir haben das Flir Case, den Raspberry Pi und das Netzteil bekommt für 120 Euro,das war, das war ok, ja, da kannst du dir nicht beschweren, äh, haben wir gerade, ja,Reserif, da ist er wieder, oder eigentlich ist es wahrscheinlich Preserif, weil Schriftart,äh, danke für den Sub, ne, also keine Tipps, es gibt grad keine, keine Scheiße, äh, wasdas, keine, manchmal, wenn das, manchmal hab ich das Problem, ich rede schneller alsich nachdenke im Kopf, äh, keine Chance, nicht keine Scheiße, na Scheiße ist es, ja,aber, sehr, das ist ne, das ist ne gute Anwendung für, für den ESP32, ja, ja, kann man machen.Klopapier hab ich genug, ich hab mir zu Anfang von Corona eine Palette Klopapier bestelltund damals haben die Leute auf Twitter gesagt, ich such das jetzt nicht raus, damals habendie Leute auf Twitter gesagt, Max, du bist Teil des Problems, wie kannst du es nur wagendir Klopapier zu bestellen, da hab ich mir gedacht, wisst ihr was, mir vollkommen egalwas ihr da schreibt, ich hab wenigstens was, womit ich meine Arsch abputzen kann auchin Zukunft, aber, das ist Twitter, Twitter empornt, emporrt sich permanent über allesmögliche, mal ganz davon abgesehen, es war ja nie knapp das Klopapier, die haben einfachnicht das Klopapier schnell genug zum Sommermarkt bekommen, das war ja das Hauptproblem, alsowenn ich bei irgendeinem Großhandel Palette Klopapier bestell, war das damals sogar besser,weil ich hab den ganzen Supermarkt-Krams entlastet.Wieso nimmst du eigentlich immer die Eins am Ende der Uhr weg, das liegt daran, ichhab's erklärt, aber ich sag's noch mal ganz kurz, das liegt daran, weil ich mir irgendwannabangeböhnt hab, immer eine Eins zu Copypasten, damit ich weiß, was ich im Clipboard habe,ist das mein Tweet von damals, also Leute, wie findet ihr solche Tweets, ich find meineeigenen Tweets nicht, dann finden Leute Tweets von 2020, wo ich Klopapier bestellt hab,mit Ehre meets genommen, okay, der Typ hat wahrscheinlich rumgeflamet, egal, Twittervon dir und dann Klopapier, exzellent, ja und ich möchte immer im Clipboard das dazuerklären, also ich möchte immer wissen, was ich im Clipboard habe, das kommt aus Zeiten,wo ich noch viel ICQ und andere Instant-Messenger und Ingame-Chat und sowas verwendet hab undmir ist es dort manchmal passiert, dass ich Leuten ungeschickte Sachen geschrieben hab,weil ich falsch Copypastet hab und seitdem will ich immer wissen, was ich in meinem Clipboardhab, deswegen Copypaste ich die Eins.Das hab ich mir so angewöhnt, das passiert schon ganz automatisch.Warum trendet Armbrust auf Twitter, weil irgendein Typ, das hab ich vorhin in der Nachrichtgesehen, weil irgendein Typ mit der Armbrust an irgendeine Schule gegangen ist, ich glaubwar eine Schule und dort irgendeine Frau angeschossen oder sogar er schossen hat, bin mir jetztgar nicht sicher, irgendein Typ hat mit einer Armbrust auf Leute geschossen, deswegen trendetwahrscheinlich Armbrust auf Twitter gerade.Ich kenn Windows V, ich kenn das, man darf auch nicht abgeschaltet ab, weil ich sonstirgendwas leake hier im Stream, aber ich möchte im Clipboard die Eins haben, das hab ich mirso angewöhnt.So und jetzt gehen wir mal, wenn wir gerade dabei sind, nein den Profikok wollen wir nicht,den Profikok, so zu hier, weg, also was hab ich denn noch im Card drinnen, also Wetterstation,die kann ich eigentlich löschen, den nehm ich auch ja, die kann ich löschen, weil diehab ich mir schon bestellt, die hat mir übrigens der Chat empfohlen, was äußerst Fiveheaderwar, weil die funktioniert ganz gut, ich lass jetzt so mal drin, dass man sieht, was ichda alles bestellt hab, weil das ist ja öfters mal Thema, was man im Stream verwendet hatan Hardware und so, kann ich das zeigen, so, also Wasserkocher brauch ich und ich brauchnoch einen neuen elektrischen, äh nicht elektrischen, nur weil das Electronics steht, das ist derHersteller iElectronics, äh einen Rauchmelder fürs Wohnzimmer und zwar einen mit Funk, deswegenist der auch so teuer, das ist mit 10 Jahres Funkmodul und 10 Jahres Akku, deswegen so einenteuren und davon hab ich die anderen auch schon, die sind auch alle vernetzt und ichhab eine Basisstation, die mir dann sogar Notifikation schickt, wenn es klingelt, exzellent.Das ist der Fiveheadtime, ich bin nicht der Einziger, der das Problem hat, womit fängstdu die Signale auf, ich fange die Signale, das kann ich dir zeigen, archive, pass auf,archive.wupplos.tv, woz, rauch, feuer, feuer, rauch, melder, ach ich hab den Stream gelöscht,der Stream ist nicht mehr da, das war der Stream, wo ich so oft klacken musste zwischendurch,den wollte ich nicht oben haben, äh ich empfange das mit iElectronics 403 oder so heißt dasdenn, RF, RF, RF 603 oder so, nee, RF 602, ah man, wie heißt der Kram nochmal, Produkte,Rauchwarnmelder, ja genau, Funkstation, das da, IF413, RF ist das Funkmodul, das istdie Station mit der ich das empfange, so und das funktioniert folgendermaßen, nur mal ganzschnell angemerkt, weil die das auch bauen wollen, also da, das ist nicht das was ichbrauche, ich brauch die Anleitung, äh genau, wenn du das Ding aufschaltest, hast du daein ziemlich minimalistisch bestücktes Panel drinnen, also so Board, hier schließt duInput an, 11-30 Volt zur Stromversorgung, ähm und hier kannst du dann, an die Relayskannst du irgendwelche GPIOs anschließen, irgendwelche Kontakte von einem ESP32 zumBeispiel, ich hab einen ESP82, ich hab einen D1 Mini in der Box, passt, also da ist massigPlatz drinne hier, ne, also das Ding ist zum größten Teil leer, ich hab da einen ESP2866 reingemacht und hab die GPIOs mit den Relays verbunden, also sprich mit, äh wasist das, common, heißt das glaube ich, äh und dann normally open, hab ich das verbunden,also das da oben ist Blödsinn, ja, hab ich die GPIOs verbunden, einmal für Fehler undeinmal für Brandmelder, weil CO2 Relays hab ich, also CO2 hab ich nicht, CO2 Melder unddementsprechend bekomm ich jetzt den Input am GPIO, also das Ding, wenn Alarm ist, daskoppelst du halt auch mit den Funkrauchmeldern und wenn Alarm ist, dann schalt das Relayund dann bekommst du ein Signal an GPIO und dann weißt du, wenn es der eine GPIO ist,dann ist es ein Fehler, Fehler bedeutet in der Regel einfach die Batterie geht leerund Brand bekommst du GPIO Input, wenn das Ding den Alarm auslöst und du kannst theoretischauch noch einen GPIO benutzen, ich hab einen ESP 2866, ich hab so einen dran, das liegtaber auch daran, weil ich da von meiner, quasi meine Tüte gekauft hab, 5 Euro Aliexpress,TASMOTA geflasht, GPIOs, TASMOTA geflasht, GPIOs da drin konfiguriert, fertig, totaleasy gewesen, kriegst du hin, bin ich mir sicher, das ist nicht schwierig, du kannstauch, wenn man das will, ich wollte das nicht, du kannst auch den GPIO Output schalten andiesen Switch und dann kannst du quasi von deinem Raspberry Pi die Rauchmelder auslösen,manche Leute verwenden das als Alarmanlage, also wenn die erkennen, dass das Fenster geöffnetwird, obwohl keiner daheim ist oder sowas, dann machen die damit Alarm, aber das, dasfinde ich blödsinnig, also kann man machen, würde ich aber nicht unbedingt empfehlen,ist nicht, finde ich nicht so, finde ich nicht so, ja, also deswegen habe ich den Rauchmelderreingemacht, so und jetzt, ich habe euch ja letztens gefragt, chat, was ich mir kaufensollte und zwar, es geht mir immer noch um Fernsehempfang drüben fürs Wohnzimmer undich habe euch gefragt, ob ich mir eine, ob ich mir so eine Box kaufen soll, wie gesagt,Fernsehempfang, es geht nur um Empfang und streamen, Fernseh gucken werde ich weiterüber Kodi auf meinem Shield TV, das bleibt, es geht mir bloß um das Empfangen, das Recordenund das Streamen, so und ich habe den Chat gefragt, ob ich mir so ein Ding kaufen sollfür DVBC oder ob ich mir eine Kabel Fritzbox kaufen soll, Kabel, oder ob ich mir eine KabelFritzbox kaufen soll, also preislich nimmt sich das gar nicht mal so viel, die Fritzboxkann ich noch anderweitig gebrauchen, weil ich habe aktuell das Unity Media Modem fürdie Einwahl, ich nenne das mal Einwahl, auch wenn das bei Kabel nicht so ganz trifft, dasUnity Media Modem für die Einwahl und dahinter habe ich noch eine Fritzbox, die macht Deckund Voip und Sachen, wer guckt Fernseh, ich nicht, meine Mutter guckt Fernseh, deswegenmuss der Kram auch funktionieren, so dass ich nicht supporten muss, ich will das hinstellenund das soll einfach gehen, ich habe keinen Bock, dass es dann abends heißt Max guck malda Fernseh geht nicht oder so, das muss nicht sein, das soll einfach funktionieren, binfür die Fritzbox, ich weiß das nicht, die Dinger sollen an sich rein für DVBC empfangensein, echt nicht schlecht sein, also was ich, der Vorteil sag mal so, Vorteil hiervon wäre,ganz einfach, ich will nicht darüber gucken, also es ist egal ob es scheiß Upscaling hatoder sonst, ich will einfach nur empfangen und aufnehmen, Vorteil hiervon wäre, ich hätteeinfach nur eine Box mit einem Linux drauf, da kann ich eine Festplatte rein machen odereine SSD, das hat hinten so ein Tray und ich hätte eine Box, die komplett alles macht,Fernseh empfangen, Fernseh streamen, Fernseh aufnehmen, Aufnahmen planen, EPG übers Tabletund was die nicht alles machen will und gut wäre, wenn ich den Kram über die Fritzboxmache, bräuchte ich noch einen Raspberry Pi dabei, der die Aufnahmen macht, also da bräuchteich noch einen Raspberry Pi mit TV Headend, der dann die Tuner übers Netzwerk von der Fritzboxverwendet, ich vermute, dass das prinzipiell mit der Box wahrscheinlich ein Ticken besserfunktioniert, Octagon, ja ich weiß, es gibt zig Sachen, es gibt zig Sachen und mein,oder meinst du die Software, so und es gibt einen weiteren Vorteil Chat, wenn ich mirdiese Box kaufe, dann können wir die zusammen im Stream einrichten, was ich noch nicht soganz gecheckt habe ist, es gibt ja da auch irgendwie 30 verschiedene Firmwares, du hastOpen VT, nee, du hast Team VTI oder wie das heißt, das ist quasi die proprietäre Softwarevom Hersteller mit ein bisschen Community Addons oder sowas, dann hast du Open AVT oder sowasin der Richtung, das ist deutlich moderner vom Linux Unterbau, moderner Kernel, modernerLibraries, hat aber ein paar proprietäre Sachen für die Tuner nicht, weiß nicht,ob das schlimm ist und dann gibt es auch Open PLV und Black Hole Open und es gibt für diesesDing irgendwie 30 verschiedene Firmwares, ich habe keine Ahnung, was die Vorteile davonsind. Ob VTL beste Wahl ist, weiß ich nicht, ich habe beispielsweise gelesen, dass wennman dort versucht, was drauf laufen zu lassen auf dem Linux, also wenn man da sich per SSHdarauf verbindet und dort versucht, irgendwas auch nur annähernd modernes Linux technischdrauf laufen zu lassen, dann kannst du es vergessen, weil VTI uralt ist, also wenn ichbeispielsweise auf die Idee kommen sollte, irgendwas selbst zu programmieren, was darauflaufen soll, ich meine, das ist glaube ich in AVM V7 oder so da drin, das geht ja prinzipiell,aber die Libraries sind halt abfuck alt und du kannst nichts drauf laufen lassen und ichbezweifle, dass VTI Docker Support hat, ich weiß es nicht, das müsste man ausprobieren,deswegen bin ich geneigt, läuft auf dem Ding Go garantiert, ich weiß es nicht, aber ichbin mir ziemlich sicher, dass darauf Go läuft. Das ist ein vollwertiges Linux, wenn auchmit einer uralt Kernel, zumindest in VTI, mit Open AVT oder wie das heißt, ist das wohlbesser, nein, Open source, da Lico ist ja nicht open, sondern da ist open source und damitkannst du ziemlich sicher Go drauf laufen lassen, ich meine Go läuft rückwärts kompatibelbis zur Kernel 2.6.32 oder so und der ist von 2000, keine Ahnung, 5, Open ATV, ja, so,chat, dann probieren wir das mal aus, ich brauche aber die mit DVBC, Samstag ist esda, exellent, 5 header time, exquisite, macht euch nichts draus, ihr wisst, ich laber manchmalsinnloses Zeug vor mich hin, so, also BAM, add, ist das das Richtige, was ich habe, DVBC,was ist da ein FBC, FBC, die tun ihren Dienst schon ganz gut, hast du was, was den Dienstnoch besser tut oder meinst du, das ist halt, ist brauchbar, man braucht eigentlich nichtsanderes, was ist ein FBC Tuner, was ist das, dieser Tuner Typ ist erstmalig in einer VoS-Tipp, also das sind alles böhmische Dörfer für mich, was die hier schreiben, Full BandCapture, dass das komplette Frequenzband einer Ebene empfangen wird, ich muss es nochmalkurz betonen, ich hasse analoge oldschool Fernsehtechnik, da kommst du dir vor wieim letzten Jahrtausend, wenn ich sowas schon lese, dann habe ich schon wieder gar keinenBock auf den Kram, so, also, wir machen jetzt gar nicht, ja das wird digital übertragen,unter der Haube ist das immer noch wie analoges Fernseh, so, gut dann kaufen wir das jetzt,also 299 Euro, ist ordentliches Ding oder, ich mein, kannst du nix sagen für ne Box,die im Endeffekt einfach noch Fernseh aufnimmt, 40 Sender gleichzeitig rekorden, ja genau,das brauch ich, weil so viel geiles Zeug im Fernseh läuft, also, add, bam, ich hoffeich hab jetzt das Richtige, ach so, was ist dann eigentlich der Unterschied zwischeneiner VU plus Duo und einer VU plus, außer, dass sie 100 Euro mehr kostet, nochmal, Moment,VU plus Comparison, die Leute sitzen im C++ Gremium, Duo hat zwei Tuner, aber wozu braucheich zwei Tuner, wenn ich mit einem Tuner schon 40 Sender gleichzeitig empfangen kann, alsoeigentlich komplett umsonst oder, so, Uno, Duo, ah hier, ok, der hat mehr CPU, mehr RAM,nicht dass man es wirklich brauchen würde, oder, Zata, beide, Kartenleser brauch ichnicht, Common Interface brauch ich auch nicht, CI plus Zertifizienz davon garantiert garnix, Netzwerk, alles das gleiche, Wi-Fi, brauch ich, das Ding hat Wi-Fi, wer brauchtdenn Wi-Fi bei sowas, useless, braucht man nicht, CPU und RAM ist zum Streamen von HDTV,also ich kann mir nicht vorstellen, dass das Streamen jetzt top funktioniert mit 3GB RAMund mit 2GB RAM gar nicht, und dass du CPUs brauchst, das ist doch eh alles Hardware-Decode,obwohl du musst ja nicht mal was decoden, decoden macht ja letztendlich der Klein, das funktioniertauf jeden Fall auch so, würd mich ganz stark wundern, wenn das nicht geht.Also es ist eigentlich kein großer Unterschied, ah, guck mal hier, HD-Dual-Transcoding unddie Uno hat nur HD-Transcode, ich will nix transcoden, ne, reicht, also ich geb jetzt,ich mein 394 Euro, ich bitte euch, also für irgendein Streaming-Box, das muss so wirklichnicht sein, also, so, hab ich's jetzt schon geadded, ne, Mist, toll, das hab ich zugemacht,nice, GG Eats, ich will nix transcoden, gut, add Basket, und wisst ihr was, ich mach jetztden YOLO-Modus, weil, nicht einfach nur weil ich Geld ausgebe, Moment, ich seh Kundenleute,ich muss mal kurz nach meinen Stonks gucken, du schaust die ganze Zeit bei No Longer Available,was?Hä?Wo?Egal, ich muss mal kurz nach meinen Stonks gucken, die sind wahrscheinlich heute wiedergefallen, könnt ich mir vorstellen, ich hab ohne SE geschaut, ah ne, Moment, Moment,Moment, Moment, das muss weg, das muss weg, will schon das aktuelle haben, ne, ist dochrichtig, ach du meinst in der Vergleichstabelle, hier, ne, SE, HD-Transcoding, das ist gleiche,behindert sich nix, so, was machen die Stonks, heute, today, minus, 91 Euro, top, jetzt sagtmir der Chat wahrscheinlich gleich wieder, Max, wenn der so weit, dann kauf doch jetztnach, alles klar, alter, ich hab die letzten, ich hab den letzten Monat, halt euch mal fest,ich hab den letzten Monat minus 1639 Euro bei meinen Stonks, aber der Chat hat recht,richtig minus ist es ja erst, wenn ich's verkaufe, not Stonks aktuell, eindeutig not Stonks.Okay, weiter, in Wald investieren, ja, vielleicht in irgendwas investieren, was aktuell nichtfällt, Amazon ist auch richtig krass am abkacken, die letzter Zeit, Amazon ist jetzt auch von3000 Euro auf 2000, das ist halt echt, not Stonks alles aktuell, aber was willst du machen,ich denke, das geht wieder aufwärts und dann ist es irgendwann auch ein Plus, top, ichhätte eine Frage, die grad zusammenhanglos ist, ich wollte mal fragen, welche Unterschiededie Affinity-Foto-Version aus dem Amazon, ich habe keine Ahnung, wahrscheinlich istdie Shop-Version kacke und die Download-Version besser, das würde sich mit anderen Erfahrungengemacht haben aus dem Store decken, gut, ja, wo ich gerade dabei war, Leute, ich werdejetzt den Big Brain Move machen und mir auch noch eine Fritzbox kaufen, weil, nicht einfachnur weil ich Geld ausgeben will oder hier den aus dem Weg Geringverdiener Weirdflexstarten will im Stream, nein, das liegt daran, es gibt keine Kabel-Fritzbox ohne Tuner, oder?Ne, die haben alle Tuner, gehe ich mal von aus und ich will eigentlich das Unity-Media-Modemrausschmeißen und ich möchte meine Billig-Fritzbox, die hat nämlich nur 100 MBit Netzwerk, wasnicht schlimm ist für VoIP und IP, also kein, kein, Voice-Over-IP, eigentlich kein Problem,ich wollte eigentlich meine Billig-Fritzbox und die Unity-Media-Box durch ein Gerät ersetzenund da wäre eine Kabel-Fritzbox tatsächlich ganz praktisch, dann kannst du auch erstmalden Fritzbox-Tuner probieren, ne, ich kaufe beides, easy, die Frage ist nur, FritzboxComparison, was denn da jetzt sinniger ist zu kaufen, gab es sicher Kabel-Modem, waswirklich ein Modem ist, doch, gibt es ein paar, will ich aber nicht, weil dann habe ich janoch ein echt, also dann würde ich das Unity-Media-Gerät durch ein weiteres Gerät tauschen, aberda hätte ich ein weiteres Gerät dahinter, ja, und jetzt kommen wieder irgendwelche Leutean, die ganzen Low-IQ, ähm, ja, so, Halbwissen-Admins, die kommen dann um die Ecke und sagen,aber Max, doppeltes Nut, ganz, ganz schlimm, doppeltes Nut und da kann ich einfach nursagen, diese Leute lecken ganz massiv Critical-Information, aber ganz massiv, das erste ist, unter Triple-Nut,das ist so wie Julien-Spam, Dreifach-Faktor-Authentifizierung, ist es eh nicht sicher, und Spaß beiseite,also, erstens, Carrier-Create-Nut ist wieder was anderes, mit Carrier-Create-Nut ist esdann Triple-Nut, so, aber doppeltes Nut, erstens ist doppeltes Nut nicht wirklich schlimm,auch wenn alle so tun, das ist nur unglücklich, wenn du Ports weiterleiten willst, oder inseltenen Fällen, wenn du irgendwelche Traversal-Probleme hast, ja, mit, mit, ähm, VoIP-Geschichten,die Löcher ins Nut machen wollen und so, aber meistens das klappt, also, in der Regelist doppeltes Nut kein Problem, wenn einfaches Nut auch kein Problem ist, so, das nächsteist, nur, weil man eine Fritzbox hat und dahinter noch einen weiteren Router, muss man keindoppeltes Nut machen, es ist sogar relativ bescheuert, doppeltes Nut zu machen, ich zeigeeuch nochmal kurz das Bild von meinem Netzwerk, also, ich hab hier ein Mikrotik-Router, Sekunde,ich hab hier ein, haben wir denn eh was Grelleres, Pink oder so, ich hab hier ein Mikrotik-Router,ja, und dieser Mikrotik-Router ist hinter einer Unity-Media-Connectbox, die Unity-Media-Connectboxmacht Nut nach außen, was sie ja machen muss, weil, ich hab nur eine Public-IP-Adresse,ich hab glücklicherweise einen richtig echten Dual-Stack, aber, das Ding hier macht Nut,wie kommen die Leute drauf, dass dieses Gerät hier auch Nut machen muss, es gibt absolutkeinen Grund dafür, dass dieses Gerät auch Nut machen muss, warum sollte es, das istein Router, ein Router kann routen, der muss nicht zwangsläufig Nut machen, du musst haltgucken, dass seine Routen richtig gesetzt sind, ein Router, genau, aber du musst dakein Nut machen, das einzige, was du machen musst ist, wenn du eine Route, also wenn dueine Rückroute einrichten musst, dann musst du hier eine statische Route hinterlegen, dassdas hier dann der Gateway ist, für diese Route, aber das war's, könntest du den Mikrotikauch die Einwahl machen lassen, ne, der kann PPoE, aber der kann nicht Kabelgedöns-Gramm,das ist ein bisschen laut oder, besser, ja so sieht's aus, also es gibt keinen Grund,dass man an der Stelle hier nochmal Nut machen müsste, weil vom Desktop hier, das hier istalles ohne Nut erreichbar, überhaupt gar kein Problem, das einzige, wo man aufpassenmuss ist, wenn man hier nicht nuttet, dass wenn man beispielsweise von dem Desktop aufdie Fritzbox zugreifen möchte, dann brauchst du hier eine Route, dass der weiß, wie erzurückkommt, also dann reicht das hier nicht, dann muss es hier eine Rückroute geben, dereben sagt, das ist der Gateway für dieses Netz, aber ansonsten brauchst du nicht, nurweil du zwei Router hintereinander hast, doppeltes Nut, das ist nicht das gleiche, also deswegen,die Leute lacken da ganz massiv critical information, was doppeltes Nut und Netzwerk Setups angeht,ja gegen Carrier Create Nut kannst du eh nichts machen, da hast du eh keine Chance,weil es heißt nicht umsonst Carrier, jaja könnte ich auch machen, mit der neuen Fritzboxgeht das, hast du dir Bock irgendwann mal eine PS5 oder Xbox Series X zu holen, wennja, also ne hab ich nicht, weil ich hab mir zu Release die Xbox One und die PS4 gekauftund ich hatte beides die komplette Lebensdauer dieser Konsolengeneration quasi nicht benutzt,die waren insgesamt keine Ahnung 10 Stunden an oder so in ein paar Jahren, das war komplettuseless und ich sehe auch aktuell keinen Grund, warum ich mir eine PS5 oder Xbox Series Xholen soll, was ich mir holen werde ist, sollte es mal möglich sein demnächst eine neue NVIDIAGrafikkartengeneration käuflich zu erwerben und eine neue CPU Generation, dann werde ichdas machen, weil mein Rechner ist jetzt, ja keine Ahnung, viereinhalb Jahre oder so, vielzu alt, leider immer noch gut genug und deswegen wird es mal Zeit für neuen Rechner, 1080Ti870K beste, 8700K, nicht 870K, weißt du ob man WireGuard oder OpenVPN durch CarrierCrate Nut tunneln kann, ja du kannst prinzipiell alles durch alles tunneln, wenn du weißt wiees geht, was nicht geht, ist Portweiterleitungen machen, Portweiterleitungen gehen insofernnicht, weil beim Carrier Crate Nut ja auf der Seite quasi von Vodafone nochmal ein Nutdavor ist, da teilst du dir mit mehreren Leuten einen IPv4 Ausgang, so damit du dich quasidass du Port weiterleiten könntest, würde bedeuten Unity Media müsst ihr Zugriff aufihren Router geben, was sie bestimmt machen, chat gehe ich von aus, dass du dort eine PortweiterleitungEinsätze einrichten kannst, also das kannst du knicken, also das kannst du knicken, aberwas du machen kannst ist, du brauchst einen Public Endpunkt im Internet, zum Beispieleinen Hetzner Server, normalerweise würde ich jetzt sagen Ausrufezeichen, Hetzner für20€, Startkutschein, was auch immer, gibt es dieses Jahr bis jetzt noch nicht, du brauchsteinen Endpunkt im Internet und da tunnelt du dich drauf oder dahin machst du eine Verbindungvon innen nach außen und dann sagst du ihm, alles was dort reinkommt, leitest du weiterda drüber über diesen Tunnel, das geht, da brauchst du aber einen Endpunkt im Internet,es gibt noch viele andere Methoden, es gibt fertige Anbieter, die bieten dir irgendwelcheIPv4 in IPv6 Tunnel und sowas an, du brauchst keinen SSL Tunnel, das beste, also das einfachste,das mit Abstand einfachste, was du machen kannst ist ein SSH Tunnel mit globaler Portweiterleitung,SSH-G, das ist nicht das performanteste, weil SSH ist nicht dafür gedacht, keine Ahnung,20 MB die Sekunde oder so zu tunneln, das verbraucht ganz schön viel CPU-Last, aberman zum Prinzipiel testen, ob es geht, ist ein SSH Tunnel mit Minus-G am besten, alsosprich, Pfeifett-Time, jetzt lernen wir was, Chat, muss man mal kurz die VM anschmeißen,dass wir was lernen können, Lern-Champ, Prüfungsrelevant, Chat, morgen wird es abgefragt,SSL Tunnel ist verschlüsselt, SSH ist auch verschlüsselt, das einfachste ist SSH Tunnel,wenn man einfach nur ausprobieren will, ob es funktioniert, so, stellt euch mal vor,ich mach das jetzt auf Local-Host, aber das ist egal, wo ihr das macht, also stellt euchmal vor, ihr habt einen Server mit Public-IP im Internet, dieser Server hat die IP Local-Host,ich brauch was Lokales zum testen, das könnte genauso gut 1.5.4.3 oder so Public-IP sein,das ist egal, so, also, SSH sollte ich vielleicht mal starten, CMCTL, Start, SSHD, so, das istein, ach, das ist gar nicht Max, oder ist es Max? Okay, also, ihr habt einen Remote-Server,damit ihr euch das besser vorstellen könnt, ich trag das in die Hosts ein, so, also, ähm,Local-Host, ich hab noch einen Remote-Server, was weiß ich, Hetzner-Server, also, ihr habteinen Server im Internet, SSH, MaxEd, Hetzner-Server, Leak, oh nein, ich wollte einkaufen, das mussjetzt aber sein, das ist wichtig, also, ihr habt einen Hetzner-Server im Internet, darüberwollt ihr jetzt, sagen wir mal, Port 600 oder 6.000, ihr wollt Port 6.000 weiterleiten aneinen, oder was ist WireGuard, WireGuard-Port, was ist das für ein Port, man, oh, UDP istschlecht, kann man das auf TCP machen, oh, das ist schlecht, okay, das funktioniert nicht,ähm, UDP weiterleiten, klappt nicht gescheit, da geht VPN, ich hab auch immer OpenVPN gemacht,dann nehmen wir mal das Beispiel OpenVPN, Beispiel OpenVPN, OpenVPN-Port, was, 443, ich nehmjetzt das da, ist egal, also, wir gehen davon aus, Port 1194, also, ihr habt einen Public-Web-Serverund ihr wollt jetzt, dass euer VPN-Server aus dem Internet erreichbar ist, damit ihreine Verbindung aufbauen könnt zu eurem internen Netzwerk, also, das braucht man, weil manbeispielsweise nicht über das Carrier Create NAT von Vodafone von außen per Port-Weiterleitungan euren VPN-Server kommt, so, und ihr habt jetzt einen Public-Server im Internet, Hetzner-Server,und ihr wollt Port 1194 weiterleiten zu eurem VPN-Server, das heißt, ähm, also, ich hablange Zeit ein Open-Port-PN über TCP verwendet, das war kein Problem, ja, ich verstehe, ichgette den Point, dass es besser ist über UDP, aber mit SSH-Weiterleitung funktioniertes mit UDP nicht gescheit, also, ihr könnt jetzt einfach sagen, SSH, ich möchte diesenPort weiterleiten, und zwar, ihr müsst sagen, SSH, Remote, ähm, und dann den, oh, warte,warte mal, mal gucken, ob ich das jetzt aus dem Kopf, Sekunde-Chat, mal gucken, ob ichdas jetzt aus dem Kopf hinbekomme, äh, Remote-Port-Weiterleitung, Local-Port-Weiterleitung,Local-Port-Weiterleitung, ihr wollt Local-Port-Weiterleitung, ihr wollt Local-Port-Weiterleitung, 119,nee, nein, nein, ihr wollt Remote, Schwachsinn, ihr wollt Remote, Remote-Port, ihr wolltRemote-Port 1194-Weiterleitung auf interne IP von euer VPN, euer interner VPN-Server,also hier kommt die IP von eurem internen VPN-Server rein, so, und jetzt wollt ihr nochsagen, minus G, so, und was das jetzt macht, ist folgendes, das baut eine Verbindung aufzu eurem Hetzner-Server, öffnet dort Port 1194 global, also bindet es nicht nur an Localhost,sondern bildet es als Interface, sodass es dann quasi auch über die Public-IP vom Hetzner-Servererreichbar ist, alles was in Port 1194-TCP reingeht, wird über die VPN-Verbindung geschickt,äh, über die SSH-Verbindung, und wenn es aus eurer SSH-Verbindung auf eurer Seiterauskommt, dann schickt es euer SSH-Lokal weiter an die IP von eurem VPN-Server aufPort 1194, so, und damit habt ihr extern zu eurem VPN-Server getunnet, sofern das OpenVPNist und sofern das über TCP ist, UDP funktioniert nicht gescheit, ich kann euch das auch zeigen,netstat, ich hoffe ich hab die passenden Optionen dafür drinnen, ihr seht jetzt, wir habenglobal Port 1194, nee, haben wir nicht, wir haben es nur auf Localhost, warum, dann mussman es per SSH-Config, dann muss man es in der SSH-Config, ähm, aktivieren, dass manMinus G verwenden kann, das kann sein, dass so standardmäßig nicht aktiviert ist, aberMinus G ist das richtige Flag für Minus G, allow remote host to connect to local forwardedhost, bla, bla, bla, bla, also ihr müsst Minus G machen, dass er sich am kompletten Interfacebindet, das ist definitiv, das hab ich schon oft gemacht, das ist der richtige Befehl,äh ja, ByteStrike, glaubt ihr, das ergibt schon Sinn, was du gesagt hast, ja, aber SSH-Port,aber SSH-Tunnel ist das einfachste, was du machen kannst, und das geht nur gescheitüber TCP, zum testen ist das wunderbar, da kannst du nämlich ausprobieren, ob es überhauptfunktioniert, so, und wenn du es dann ein bisschen, ein bisschen advanceder machen willst,dass der Tunnel auch neu aufgebaut wird, wenn der mal abkackt, dann machst du noch Auto-SSHdavor, aber, äh, zum testen ist das wunderbar, wenn du einfach nur testen willst, geht dasdenn prinzipiell von außen zu meinem VPN-Server, ansonsten, danach kannst du dir andere Tunnel-Technikenüberlegen, aber das ist mit Abstand das einfachste, wenn du einen Public-Server hast, um den zudeinem, ähm, zu deinem VPN, internen VPN-Server zu bekommen, einfach zum ausprobieren, unddas ist prinzipiell was, was ich mir merken würde, weil man kann mit dieser SSH-Geschichteunglaublich viel Scheiße anstellen, unglaublich viel Zeug umgehen, ähm, was man, was stört,es gibt zigtausend Varianten, was du machen kannst, aber SSH-Tunnel ist in der Regeldas einfachste.Ähm, wie kann ein Netz-Encrypt-Zertifikat im lokalen Netzwerk nutzen, zum Beispiel füreinen internen Webserver, geht das, ja das geht, das ist überhaupt kein Problem, dazubrauchst du ein paar Sachen, eigentlich wollte ich einkaufen, aber wir haben ja noch, wirhaben ja noch 50 Minuten Zeit, also, dazu brauchst du ein paar Sachen, du brauchst einegültige Domain, das ist ganz wichtig, sonst funktioniert das nicht, du brauchst eineechte, richtig registrierte Domain, das ist aber nicht schlimm, weil sowas kostet nix,ja, suchen wir jetzt zum Beispiel mal nach QtChat und gucken uns mal, was die billigsteQtChat-Domain ist, QtChat.inc, guck mal, QtChat.yz, 95 Cent das Jahr, QtChat.inc ist lustigerweiserelativ teuer, QtChat.art ist auch nice, also es gibt sehr viele Domains, die sind sportbillig,du brauchst zwingend eine Public Domain dafür, anders geht das nicht, das heißt nicht, dassdu einen Public Server dahinterstehen brauchst, du brauchst eine Domain, die es gibt, dieregistriert ist und dann brauchst du einen DNS-Server, der dafür zuständig ist, den du per API steuernkannst.Ich empfehle dir Cloudflare, weil Cloudflare kostet nix und Cloudflare kann alles, wasman braucht und Cloudflare wird von so ziemlich jedem Let's Encrypt Client out of the boxunterstützt.So, dann registrierst du dir einen Domain, stellst bei deinem Domain-Registrer ein, dassCloudflare für den DNS zuständig ist und das war's und dann sagst du deinem Let's EncryptClient zum Beispiel Certbot, dass du Let's Encrypt über DNS-Challenge verwenden willstund zwar mit Cloudflare, dann musst du noch deinen Cloudflare API Key irgendwo hinterlegenund dann geht der Certbot zu Let's Encrypt und sagt, du möchtest QtChat.io dir ein Zertifikatausstellen und dann sagt Let's Encrypt, ja, mach ich, du musst aber beweisen, dass dirdie Domain gehört, dann geht Certbot über deine Cloudflare API an den Cloudflare DNS,hinterlegt dort ein Secret TXT-Rekord im DNS, ein Secret, was Certbot und Let's Encryptausgemacht hat, hinterlegt dort ein Secret und dadurch, dass dann quasi dem DNS vondeiner Domain das Secret drin steht, was du mit Let's Encrypt quasi ausgetauscht hast,beweist du Let's Encrypt damit, dass du der rechtmäßige Eigentümer der Domain bist unddu bekommst ein Zertifikat, das reicht, also du brauchst keine öffentlich auflösbareWebserver oder sowas dafür, dann kriegst du ein Zertifikat und dann musst du einfachnur lokal dafür sorgen, dass dein lokaler DNS eben einen A-Rekord hat für die Domain,für die du dir das Zertifikat ausgestellt hast und dort dann auch ein Webserver läuftmit diesem Zertifikat, ja, so sieht es aus.Es gibt zig Varianten das zu machen, ach guck mal, tatsächlich, wir haben das sogar, dukannst dir auch einfach das Wort angucken, da machen wir das irgendwann mal, aber mitganz viel komischem Docker Zeug dabei noch, ja, nice, das ist wieder was gelernt heute,danke für die ganzen Zaps, ich hab wieder die Hälfte überlesen, tut mir leid, overlay,extra für dich jetzt, Achtung, weeps in, Leute, weeps in, was wird eingekauft, endlich malden ganzen Krempel der noch aussteht, äh, was ist das, äh, nicht zwangsläufig, derDomain Registral ist dort wo du hingehst und sagst ich möchte, möchte diese Domain kaufen,er ist prinzipiell auch erstmal zuständig für den DNS, aber, du kannst sagen, dassdu, ähm, also, nee, der DNS Registral ist immer zuständig für deine Domain und auchder DNS vom Domain Registral, aber du kannst dort einstellen, dass der DNS, der letztendlichdie Records auflöst für deine Domain, dass das ein anderer DNS ist, also sprich, dannsagt dein, ähm, Domain Registral DNS, wenn einer nach dem Namen fragt, hey, ähm, ichbin zwar für diese Domain zuständig, aber auflösen kann die ein anderer DNS und danngeht der nach Cloudflare und macht deine Namensauflösung, oder besser gesagt, TXT Records für Let'sEncrypt.Wozu macht man das, wenn man nicht einfach sein eigenes Zertifikat erstellen kann, dasist eine gute Frage, erste mal, rein Security-technisch, so von Verschlüsselung oder Nicht-Verschlüsselung,macht es erstmal wenig Unterschied, ob man ein Self-Sign Zertifikat hat oder ein Let'sEncrypt Zertifikat, also die Verschlüsselung ist dadurch weder besser noch schlechter,der einzige und zwar riesengroße, nicht zu unterschätzende Unterschied ist, dass deinBrowser Let's Encrypt Zertifikaten vertraut und selbst ausgestellten Zertifikaten nicht,das heißt, wenn du sowas hier haben willst in deiner Browser-Leiste, dann musst du entwederdeine CA importieren im Browser und das auf jedem Rechner, der dann selbst sein Zertifikatverwenden soll, oder du verwendest Let's Encrypt, dem jeder Browser schon standardmäßig vertraut.Also, das ist halt deutlich praktischer.Übrigens, Fun-Fact von der Arbeit, mal was zum Kekken, wir haben es letztens geschafftan das Let's Encrypt Zertifikatslimit zu kommen und wisst ihr warum, weil irgendwelche LeuteKubernetes Sachen deployed haben und auf einmal haltet euch fest 88, nein ich will euch jetztauch nichts verstecktes mitteilen damit, weil bei dieser Zahl kommen immer irgendwelcheLeute an, ha ha, tut mir übrigens leid für alle die 88 geboren sind, weil irgendein komischesKubernetes Deployment bei uns dafür gesorgt hat, dass 88 Let's Encrypt Anfragen geschicktwurden für neue Zertifikate, die haben nicht etwa gesagt Renew Request oder Refresh, neindie wollten neue Zertifikate anfordern, warum auch immer und dann hat Let's Encrypt gesagtNope, für diese Woche gibt es keine neuen Zertifikate mehr und das fuckt die Leute beiuns gerade ziemlich ab, weil die auch legitime Anwendungsgründe haben sich Zertifikate auszustellen,aber Let's Encrypt, du kannst bei Let's Encrypt ein Formular ausfüllen, dass du deine Limitserhöht haben willst oder so, aber die Plösse will sich da keiner geben und das würden diewahrscheinlich auch nicht machen und jetzt können wir uns eine Woche lang keine Let'sEncrypt Zertifikate ausstellen, wie gesagt Renews sind nicht betroffen, deswegen istdas ganze halb so wild.Nö, nicht wirklich, YouTube Werbeeinnahmen ist genauso wie Twitch Werbeeinnahmen, alsoYouTube Werbeeinnahmen sind deutlich besser als Twitch Werbeeinnahmen, aber Lohnen kannman dazu nicht sagen, also wenn du normal guckst ist das auch vollkommen ausreichend,ich hab auch gegen niemanden was der Erdblocker anschaltet oder so, die Werbeeinnahmen sindganz ok, aber wenn ich, wenn ich, ich verdiene damit ja schon passiv bisschen Kohle nebenbei,also mit YouTube und auch mit den Twitch Subscriptions und sowas, aber wenn ich Stonks machen will,dann mach ich irgendwelche Promotion Geschichten, das gibt deutlich mehr, hab ich aber aktuellnix und ich bin eigentlich ganz glücklich so wie das ist, ich brauch nicht zwangsläufigjetzt mehr Geld einfach nur um Geld zu machen, also meine Stonks könnten bisschen besserlaufen.Doch, machen wir wahrscheinlich auch jetzt, wahrscheinlich kaufen sie sich jetzt auchein Zertifikat, aber das klappt an manchen Stellen nicht gescheit, weil sie eben daraufsetzen das Auto-Renew mit Let's Encrypt funktioniert und das mit Auto-Renew und Zertifizierungstellen, dann musst du das wieder umstellen, vielleicht warten sie auch ne Woche, so okweiter geht's, also wir haben meinen Receiver und ich wollt mir, ich wollt die Fritzboxkommen, boah, boah, Leute Sekunde, oh, meine Augen, warum geht das nicht, alter, geht eshier, oh, yes, ok, ich weiß nicht warum es mein Dark Reader da nicht kann, aber, so alsowas ist der Unterschied, also wir wollen Cable haben, Cable Fritzbox gibt's nur drei oderkommt da noch was, ne, Jibay, der sieht nur so aus, Leute, ich glaube hier hat's einerbei AVM das nicht so drauf mit First und Last CSS Elementen, man könnte das viel schickermachen mit diesen Strichen hier neben, dass es nicht so aussieht als käme da noch was,sag ich ja als absoluter Five Head CSS Frontend Full Stack bis Sek DevOps Engineer, ich mussdas wissen, so was ist denn jetzt der Unterschied zwischen diesen ganzen Dingern, Wi-Fi 6, 5plus 4, ja 5 plus 4 ist doch eindeutig besser als 6 oder, weiß gar nicht warum das diegünstigere ist, muss man nicht verstehen, Papa, nicht dass jetzt jemand um die Eckekommt und sagt, Bugs, 6 ist doch viel besser, außerdem sind wir Informatikos, die habenkein 6, ok, Wi-Fi 6 vielleicht, so, also da haben sie Multiuse, ich brauche ich nichtweil kein Wi-Fi, Dual Band Wi-Fi, brauche ich Honored, das interessiert mich alles überhauptnicht, ich weiß, ich weiß, die Witze sind heute äußerst Payne's Champ, ich geb's zu,ich geb's zu, Leute, ich muss euch mal was wirklich cool fand erzählen, und zwar ihrwisst ja, ich hab jetzt mittlerweile um die 9 Kilo abgenommen und ich war am Dienstagauf der Arbeit und da hab ich einen Kollege gesehen, den hab ich schon eine Weile nichtmehr gesehen und das erste was der gesagt hat ist, Max, du hast abgenommen, das fandich nicht schlecht, da sieht man, dass man's auch wirklich sieht, oh nee, das ist richtignice, ja, das motiviert natürlich, das hat mich so sehr motiviert, Leute, dass ich dasletzte Mal war, ich war noch, keine Ahnung, Dienstag war das, direkt nachdem ich, abendsnachdem ich, abends nachdem ich von der Arbeit gekommen bin, das hat mich so sehr motiviert,dass ich beim eineinhalb Stunden, zwei Stunden täglich durch die Wiese bergdings wandernmit einem Fahrradgrill, ich nenn's mal, geflirtet habe, stell euch das mal vor, Alter, da mussich schon hart motiviert sein, dass ich mich auf irgendwelche zwischenmenschliche Gesprächeeinlasse und das auch noch freiwillig, Sachen gibt's, hätt ich mir vor ein paar Jahrenauch noch nicht vorstellen können, dass ich freiwillig mit Leuten kommuniziere, ja, miteinem Fahrradgrill, genau, einem hocken Fahrradgrill mit Sonnenbrille auf, sehr motiviert, dassman erstmal ein fettes Eis essen geht, ja, ich geh tatsächlich ab und zu Eis essen, manchmalmuss das sein, so, weiter, ich wollt mir die Fritz-Boxens angucken, so, WiFi zu euch interessiertmir, also, wenn ich das jetzt richtig verstehe, macht es überhaupt keinen Sinn für mich,die teure Fritz-Box zu kaufen, ich kann einfach die günstigere Fritz-Box kaufen, 6660, warumgibt es überhaupt noch, was ist denn das für eine Benamung, 6690, 6591, MonkaS, Alter,diese Benamung wieder, man, haben die alle Quad-Tuner, sieht man das da, Tuner, da stehtüberhaupt nichts von Tuner, aber die haben alle Quad-Tuner, oder, XQC hat sich umbenannt,ja, der hieß ja XQC-OV, das würd mich nicht wundern, wenn der mal das OV bald aus demNamen streicht, wie heißt er denn jetzt, wahrscheinlich einfach nur XQC, oder, ja, ja, das wundertmich nicht, gute Sicht über die verbauten CPUs und RAM, ok, zeig ich her, fritzboxinfo.com,was es nicht alles gibt, boah, Alter, was ist das für eine Seite, man, Keg-Wade, wasist das, seriously, Webdesign aus den 2000ern, Alter, so, 6600 Cable, Tuner, Tuner, stehenda die Tuner drin, Anzahl, Tuner, hier, ne, das ist Fragezeichen, wie viele Tuner hatdie denn, das muss doch da drinne stehen irgendwo, Moment, Moment, Moment, Details, Details, Specs,Tuner, Tuner, Pull-Band-Capture-Tuner, das ist doch, das ist doch genau so ein Ding, ok,also kann ich auch ohne Probleme die billigere fritzbox kaufen, Specifications, Tuner, weil,warum nicht, ja, warum, ich mein, ich muss ja nicht zwangsläufig mehr Geld ausgebenals irgendwie notwendig, Amazon, was ist los, oh, Snap, ok, alles klar, ok, ok, ok, ok,alles klar, Moment, das nimmt sich doch jetzt preislich gar nicht so, ach, die sind outof stock, die ist gar nicht lieferbar, oder, ne, die ist nicht lieferbar, ne, die habenbeide vier Netzwerk-Ports, oder, die eine hat bloß ein 2,5G-Cable, die haben alle, ach,ne, tatsächlich, ach, ja, tatsächlich, die hat ein Port, ja, was ist das denn, warum hatdie denn weniger, das muss man alles nicht verstehen, ne, naja, gut, ich, wisst ihr,was ich nicht verstehe, warum hat Amazon nicht einfach was, wo man draufklicken kann, sagen,so Sachen, die lieferbar sind, was soll das denn, ja, ok, komm, scheiß drauf, dann kaufeich halt die, jetzt ist Euro da, hoher Staffel ist lieferbar, heftiger Scan bei AVM in denFritzboxen, warum ist das Scam, was gegen deine eigene Fritzbox spricht, ja, ich hab wenigProbleme in den letzten Jahren, aber das ist mir klar, dass die das sagen, das ist Standard-Bullshitvon Providern, das bin ich schon gewohnt, das ist normal, so, gut, jetzt haben wir das,jetzt muss ich mal in meine Einkaufsliste kurz schauen, Geizhals, können wir tatsächlichmachen, das ist eine gute Idee, lieferbar, ok, das lohnt sich tatsächlich, e-SystemsYour Online Shop, oh, die haben aber richtig gute Bewertungen, Vorsicht, unseriöser Händler,grauenhafter Kunde, gut, da werde ich wahrscheinlich nicht bestellen bei e-Systems Your OnlineStore, ok, das ist natürlich preislich schon mal ein großer Unterschied, ok, das ist natürlicheine gute Idee, ok, das lohnt sich tatsächlich, ok, das lohnt sich tatsächlich, ok, das isteine gute Idee, ok, das lohnt sich tatsächlich, ok, das lohnt sich tatsächlich, ok, das lohntUnd das hat richtig gesagtMassive gesagt hat dasOnly one left in stockAja, ist das refurbished? Ach das ist usedAch leck mir keinen bock, ich guck jetzt auf zu gucken. Wir schauen jetzt was anderes nach. Ah Amazon war wieder am abkacken alles klar niceOkayNext also was brauche ich denn sonst nochBei der usv bin ich immer wir können bei alt habe ich wirklich lange nicht mehr nix mehr gekauft jaUnd mit denen habe ich immer noch gute erfahrungen gemacht was alternate angehtUnd früher dachte ich die heißen alternateIch habealso als ich noch klein warAber ich mittags bei der obach immer mittags bei der oma mittagessen und die hat die ganzenZeitungen für mich gesammelt weil da immer werbeheftchen drinne warenWerbeheftchen von von alternate und und zeug und alles ich habe damals halt gerne diese die ganzen pc angebote und so mir angegucktUndDa kam da habe ich mir zwei sachengemerkt und zwar einmal dass es alternate heißt weil das meine oma auch gesagt hat unddass es nicht heißt sondern als erMeine oma hat immer gesagt als er zu als erSo auf lagen aber hier kostet die die garJa mittlerweile gibt es als das ist ein komischer router das ist ein komischer gaming router wo ich nicht verstehe warum man sich den kram kauftAber hat schon die pilling hat wo ich keine ahnung habe warum man sich sowas kauftDas kann ich dir empfehlen ich will kein kabel modem was soll ich mit dem kabel modemIch will ja zwei kisten durch eine ersetzen wenn ich mir einen kabel modem kauf und dann habe ich wiederEin wieder zwei kisten da kann ich auch das unity media den mir behalten mir mir stehen lassen egal so nächstes also nächste sacheZwar müssen wir ein bisschen vorwärts kommen okLass mal kurz überlegen ich brauche ein ja da bin ich mir nicht sicher alsoVielleicht wisst ihr nach was ich da suchen muss ich ich finde ich ich finde ich finde ich find nix und zwar was ich aktuell habeIch habe im flur untenIch zeige euch das mal kurz ich habe nicht uk europeAlso ich habe eine livex wlan lampe unten imIm flur die macht nicht nur rgb beleuchtung sondern die macht auch infrarot beleuchtung das ist die einzige wlan led von denen die das kannNightwish also ich die by the way der preis ist lächerlich bei denen ist es normalerweise deutlich günstigerAlter was ist mit euch los also das kostet normalerweise 50 euro oder so ist trotzdem trotzdem zu teuerSo was so was hierAlso so die ist kaputt und die will ich auch nicht erneuernErstens weil ich die zu teuer finden und zweitens weil ich über die lebensdauer enttäuscht bin die hat es ungefähr nuranderthalb jahre zwei jahre gemacht undgerade rgb led lampen sollten deutlich deutlich länger halten der kram ist ja auch nicht irgendwie den ganzen tach an oder soAlso so was ich mir überlegt habe was ich mir kaufen könnte irgendeine infrarot beleuchtungaberDa finde ich dinge die für mich keinen sinn ergebenIch habe keine ahnung wie nach was ich suchen muss dass ich mir eine keine ahnung zwölf so was in der richtung will ich aberhalt vielleicht nicht billiger chinesen krabAber so was in der richtung will ich haben nach was muss ich da suchen ich habe keine ahnung wenn ich nacheher beleuchtung eher lampe oder so suche da finde ich alles möglich also ich finde vielleichtheizungsdinger oder so aber ich finde nix was ich quasi an ein netzteil anschließe und mir dann den flur nachtsausleuchtet für nacht sichtUnd am besten hätte ich das ganze noch in einer wellenlängedienichtsichtbar istIch werde jetzt sagen infrarot ist nie ist nie sichtbar das kann man so nicht sagen je nach wellenlängeErkennst du zumindest die leds dass die an sindso was daJa also vielleicht vielleicht nicht zu so einem krassen preis oderDas ist zu teuer 250 euro ich will den flur ein bisschen erleuchtenWisst ihr was ich mir schon überlegt habe die led strahler okWisst ihr was ich mir schon überlegt habe ob ich nicht einfach meine packung china chinesen leds nehmeund die auf einenbreadboard stecke und das auf den schrank lege mit irgendwie acht leds drauf oder soUnd das auf den schrank lege mit irgendwie acht leds drauf oder soDanach habe ich auch schon gesucht da findet man nix gescheitesWas ottoAch neelondon das istDas tonter das ist auch irgendein china chinesen dingJa was ist es denn jetztJa moment moment momentWas ist es denn jetzt ist es ein infrarot licht für nacht sicht oder ist es ein infrared heaterIch meine mir ist klar dass alles in gewisser weise wärme verursacht in der richtung aber das primäre ziel soll seindass licht für nacht sicht in den flur kommt und nicht das heizen von irgendwasAlso das ist preislich was das würde ich mir gefallen lassenJa wenn die das finde ich halt auch blöd wenn die leds rot leuchten das heißt das bräuchte man auf irgendeiner wellenlängedie nichtTopics den du gesendet hast der kostet 250 euroAch nee das noch ein anderer90 euroAch nee das ist noch ein andererJa 90 euro ich meine das ist mir eigentlich ein bisschen viel für ein paar infrarot ledsDie frage ist welche wellenlänge sind die sieht man die nachts rot leuchten oder nichtUnd wo sind da überhaupt die leds dahinterUnd wo sind da überhaupt die leds dahinterEs kommt doch bestimmt direkt aus china oderdrop shippingChina von China chinesenDas speichert die leuchtenDas speichere ich mir mal vielleicht vielleicht hole ich das teilAber ich bin der sp echt bisschen planloser was ich suchen soll weiß nichtSo das nächste was ich brauche ist hat jetzt gar nichts mit technik zu tun ich brauche eine säge und zwar am liebsten so eine zum klappenSo das nächste was ich brauche ist hat jetzt gar nichts mit technik zu tun ich brauche eine sägeUnd zwar am liebsten so eine zum klappenKlappen, vielleicht nicht so was China-Chinesen billiges, sondern ich brauch ne Segel, irgendwaskleines zum klappen, sowas da in der Richtung, nur von irgendeinem Hersteller, der mir wassagt, denn sowas da zum Beispiel ja, was ich sägen will, Äste zum Beispiel, also ichbrauch, ich brauch, ich brauch ne Segel, sowas da, 28 Euro, Fein-Feed, Coarse-Feed, nichtFeed, Teeth, warum sag ich Feed, Akku-Kettensäge, ich brauch keine Akku-Kettensäge, ich brauchdas für abgeschnittenes Zeug, was ich mal durchteilen muss, das was vielleicht minimalzu dick für die Astschere ist, auch keine Akku-Kettensäge, außerdem hab ich ne Akku-Kettensäge,ich brauch ne ganz normale kleine Klapp-Säge, keine Akku-Kettensäge, 28 Euro, perfekt,will ich haben, Marken-Baumarkt 24, gib ihm, exzellent, Säge am Start, Leute wisst ihrwas ich letztens genannt hab, es gibt eine Amazon Basic USB, keine Sorge, ich will diemir nicht kaufen, meint ihr das taugt was, ich hab nicht vor mir das zu kaufen, meintihr eine Amazon Basic USB taugt was, oder kann was taugen, Amazon Basic ist dafür bekannt,Produkte die ganz gut sind zu kopieren, also quasi die legalen China-Chinesen, wenn dues so willst, ich will mir nichts kaufen, also keine, ihr müsst euch nicht Gedankenmachen, dass demnächst abbrennt bei mir, aber ob sich das, dann schauen wir mal kurzin die Bewertung, ich frag mich halt echt ob das irgendwas taugt, Eistings, Schrott sagter, wieder ein Teil aus China wahrscheinlich, das ist das was du brauchst Max, ok, Zack,taugt mal her, was ist das, ja genau, ganz wichtig, wenn man Äste zersägen will, dieDschungelmachete, wobei bei komischen Amazon-Dingern, da fällt mir immer nur dieses Meme-Taschenmesserein, Swiss Knife Meme, ich weiß nicht an was ich suchen soll, Taschenmesser für 900 Euro,ja, ne, ne, das ist noch zu klein Leute, das ist noch zu klein, der Victorino Swiss Champ,endlich mal einer der meine Benamung übernimmt, der Schweizer Champ ist das, gibt es diesesMeme-Taschenmesser gar nicht mehr, doch hier, da ist es doch, da ist es doch, das WengerSwiss Giant Knife with Box, das meine ich, das ist ein mega krasses Teil, ich weiß nichtwo das denn davon sein soll, sowas zu haben, mitnehmen kannst du es nicht wirklich, aberihr müsst euch mal die Kommentare durchgucken, im Prinzip sind, ist das alles, das gibt'sschon jahrelang dieses Produkt, im Prinzip machen sich die Kommentare alle darüberlustig, 1,4 Kilo, bestes Taschenmesser Produkt ever, so, ähm, hast du eine USB, nein, doch,doch, doch, das stimmt nicht, aber die geht nicht mehr, also ich hatte, früher hatteich so eine ganz normale APC Steckdosenleiste im Endeffekt, als ich meinen 19 Zoll Rackhier hingestellt habe, habe ich mir gedacht, ok, ich kaufe auch mal einen Hersteller, woich ein bisschen, den ich kenne und wo ich weiß, das taugt was, da habe ich mir eineCyber Power USB gekauft, aber die hat mich schwer enttäuscht, weil der das einzige Malein der ganzen Zeit, wo mein komplettes Rack abgekackt ist, war nicht als bei einem Stromausfall,sondern als die Power, Cyber Power USB verreckt ist, ja, das habe ich letztens mir auch wasangeguckt, aber ich bin immer noch hin und her gerissen, ob ich mir nicht die, die, die,die günstige hier von Ethon, Ethon, wie die ausspricht, kaufen soll, sowas da, oder einfachYOLO ohne USB, also wahrscheinlich YOLO ohne USB weiter, ja, Cyber Power ist kacke gewesenbei mir, Yatong USB, oh ja, China-Chinesen-USB, das brauche ich, laufen die Dinger weiter,wenn die Batterie abkackt, also wenn Strom da ist und die Batterie verreckt, geht esda noch weiter, das ist die, das ist die Sache, weil bisher hatte ich nur Probleme, wenn die,als die USB verreckt ist, nicht, dass da Strom ausgefallen ist, ne, keine Ref-Links, dasstimmt, muss nicht sein, ich meine, wisst ihr, was ich machen könnte, ohne Scheiß,das mache ich, ich mache, ich kaufe das, was wir uns letztens angeguckt haben, was sindeigentlich der Unterschied zwischen der Pro-Series und der Eco-Series, Comparison, wir Comparison,Comparisieren heute relativ viel, ja, Online-USB mag zwar cooler klingen, somit keine Last-Spitzenim Strom und sonst wie, also, ne, keine Spannungsspitzen und so, aber Online-USB ist halt der Sack,dass wenn die Batterie verreckt und der Strom noch geht, dann ist trotzdem der Strom wegfür alle Server, Modelle, die Pro hat eine Webschnittstelle, das ist cool, aber ich willhalt unbedingt eine, die weiterläuft, wenn die Batterie verreckt, was ist denn das hierfür ein Vergleich, komm wieder, ok, schauen wir mal, was hier der Unterschied ist, diegünstigen APCs können das wahrscheinlich, weil sie nicht den Strom permanent durch denAkku leiten, dann ist kein Ding, aber USBs, die ihren, was ist das, Chat, Chainlaw, washast du da neben dir für Dinger, was ist das, Batches, Watching without Video, wo ist derSinn davon, von Batches, ich mein, was interessiert es mich, ob der Chainlaw mit oder ohne, mitAudio oder ohne Audio guckt, ah, ja, das ergibt Sinn, ok, das verstehe ich, das versteheich, also sprich, jetzt fangen sie alle an, also sprich, wenn ich jetzt sehen würde,dass ganz viele Leute ohne Audio watchen, weil sie hörgeschädigt sind, könnte ichkeine Ahnung, Text to Speech einpländen oder so, äh nee, Speech to Text einpländen, naja,das macht aber wenigstens Sinn, verstehe, verstehe, ok, also, was war denn jetzt derUnterschied, ihr sagtet, die haben ein Interface übers Netzwerk, nee, haben sie nicht, habenauch USB, ja, dann weiß ich es nicht, versus Echo, hm, ist das eine Online-USB und dasandere Offline-USB, wahrscheinlich, ne, dann habe ich keine Ahnung, was der Unterschiedist, die würden gut dran tun, das etwas prominenter zu platzieren, was der Unterschied ist, dannkönnte man sich nämlich einfacher dafür entscheiden, die hat kein Display, ich brauchekein Display, Display juckt mich so gar nicht, das kommt auf die Art der USB an, also ja,die meisten machen das und die wo der Strom quasi permanent gefiltert zu den Systemenkommt, die machen das, aber wenn du was hast, der quasi nur umschaltet, wenn Stromausfallist, dann kommt es wahrscheinlich ein bisschen auf die Bauweise an, keine Ahnung, keine Ahnung,ich check nicht so genau, was sich das lohnt, ob es der Unterschied, ob sich das lohnt,also ich bin geneigt dazu tatsächlich, einfach mal die kleinste hiervon mit USB zu kaufen,Ö, Ö, Öko, was, Echo, komme ich auf Öko, so, mit USB, USB, so, ich bin geneigt dasDing einfach mal zu kaufen, zum ausprobieren und wenn das nicht gescheit funktioniert odernicht das macht, wie ich mir das vorstelle, dann ich werde einfach mal die Batterie abstöpselnund gucken, ob es weiter läuft und wenn das da nicht geht, dann schicke ich es zurück,dafür ist Amazon ja bekannt, ja, dass sie da keine, keinen Stress machen, Amazon hatbisher alles, Amazon hat sogar meine Reifen, die ich dort bestellt habe, wieder zurückgenommen,irgendjemand hat gefragt, eine USB mit Interface, wofür braucht man dann sowas, sind SchokoStecker oder, das glaube ich nicht schlecht, das passt, da kann ich meine Leiste anschließen,also wozu eine USB, ich finde es hier gar nicht, wozu braucht eine USB Interface, naja,es ist ganz praktisch mitzubekommen, wenn die USB leer geht, um die Server runterzufahren,ob das jetzt über Netzwerk geht oder über USB, ist eigentlich zweitrangig, über Netzwerkwäre irgendwie cool gewesen, aber über USB geht genauso, haben die auch rackmounted,oh, ok, die rackmounted Geschichten, da lecke ich critical information bisher, die willich nicht, die ist mir zu teuer, na gut, das ist aber auch ordentliches, heftiges Ding,373 ist eigentlich immer noch zu krass, aber wäre noch im Bereich, die langen aber gutzu, für die rackmounted Dinger, funktionieren die auch, wenn du den Akku abstöpselst imlaufenden Betrieb, hast du mal ausprobiert, Max, hol dir mal Kock, yep, dazu kann icheuch was erzählen, es hat gestern ein Kollege, das passt jetzt wie die Faust aufs Auge zudiesem Comment, gestern hat ein Kollege zufälligerweise sein Passwort geleakt auf der Arbeit und wisstihr, wie das Passwort war, Pimmelcock123, ich bin mir nicht ganz sicher, ob das wirklichgeleakt hat oder ob das quasi ein Jebait-Leak war, aber es würde gut passen zu ihm, dasser Pimmelcock123 als Passwort hat, insofern, ja, ich lache einfach mal, es war vielleichtecht sein echtes Passwort, ich meine, das ist gar kein so schlechtes Passwort, wie vieleStellen sind denn das, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, naja gut, es ist keinrichtig gutes Passwort, 13 Stellen sind eigentlich ticken zu wenig, aber immerhin, immerhin13 Stellen, so, ok, ich habe noch 2 Minuten Zeit, was brauche ich denn noch, ich brauchebesonders dünne Netzwerkkabel immer noch, ach ja, wenn ich mir dieses Dinge bestelle,wenn ich mir jetzt wirklich die Box zum Recorden bestelle, dann brauche ich noch eine SSD,ich habe keine freie 2TB SSD mehr, wobei doch, was labere ich denn, natürlich habe ich noch,ich habe nämlich hier, die habe ich doch noch da, da habe ich mir noch damals fürs Nass,weil ich dumm war, 2 Stücke gekauft, die ich jetzt gar nicht verwende, einer ist aberRaspberry Pi dran, ich meine die wird es ja auch per USB tun letztendlich, Fernsehaufnahmen,na wobei, die die du gegen die Wand geworfen hast, stimmt, ich habe letztens eine SSD gegendie Wand geworfen, welche war das denn, oh shit, das war eine 2TB SSD, die war aber imArsch, das war die BX, 500BX, BX, ja, das Teil habe ich letztens gegen die Wand gefeffert,na ja, ich probiere es mal aus, die geht bestimmt noch, ganz ehrlich, SSDs sind so robust, dieüberleben das, also da ist ja auch nichts abgebrochen oder rausgekriegt, die hat dasbestimmt überlebt, dass ich sie gegen die Wand gefeffert habe, die Cuvo wäre gar nichtso doof, weil für Fernsehaufnahmen reicht es dicke und wie heißt dieser Speicher inder Cuvo dieser, mit mehreren Zellen, der reicht ja eigentlich, PC, korrekt, so altist mein PC, guckt euch das mal an, 2017, cringe, cringe, wer den Rechner von 2017hat, kennst du das, ja das kenne ich, finde ich ist ein nice Gehäuse, falls das das ist,mit diesem Zusatz-Anstecker, mit diesem Zusatz-Dock, ja genau, also was heißt Dock, mit dieserzweiten Hälfte, die man so rein steckt, das hat sich jetzt falsch angehört, aber ja,wenn man das Gehäuse von innen sieht, weiß man was ich meine, die zweite Hälfte, dieman auch noch rein steckt, so und das finde ich eigentlich ganz cool, wobei ich sagenmuss, ein bisschen teuer, wenn man halt eine M2 anschließt, ist das das mit M2 oder, istdas das mit M2, ja, ist das halt cool, die Sache ist halt die, but why, also warum eineM2 SSD über USB an den Raspberry Pi, ich habe keine Ahnung wo das Sinn ist, aber esist cool, dass es geht, ich verstehe den Sinn nicht so genau ehrlich gesagt.Was für ein Recorder, der Chat hat gesagt, beste, VU plus beste, wir wissen der Chathat bei solchen Sachen noch nie unrecht gehabt, Chat erinnert ihr euch an einen, an auch nureine Voraussage, die ihr getroffen habt, die nicht eingetreten ist, also ich kann michnie dran erinnern, dass der Chat jemals falsch gelegen hat, gerade durch die vielen PrimeSubs und dieser wahnsinnige EQ Boost, die man bekommt dadurch, kann man eigentlichkollektiv nicht falsch liegen, ich meine, wir haben gerade 224 Zuschauer, das sind 224Zuschauer, wenn alle nur 150 EQ haben und was durch die Prime Subs mittlerweile überhauptkein Problem ist, da haben wir hier im Chat aktuell 33.600 EQ Punkte, also es ist eigentlichnicht möglich, dass der Chat falsch liegt, das ist 6-Head schon nicht mehr ausreichend,das ist eigentlich absolut 360-11-Head schon, bei dir soll ich 150 abziehen, das heißtdu hast Null?Das kann nicht sein, allein schon, dass du am Rechner bist und weißt, wie der Chat bedientwird, kannst du nicht Null haben, da hat der Chat tatsächlich Recht, aber nur weil derChat Recht hat, heißt es ja immer noch nicht, dass ich es am Ende auch mache, also ichkaufe mir neue CPU und einen komplett neuen Rechner, letztendlich wird es wahrscheinlichwieder ein Reboot von meinem alten Rechner, ich hör mir nämlich wieder an Fractal Design,ja was ist denn das aktuelle, R7, ich hatte die letzten paar Rechner Generationen, dieich hatte, hatten alle dieses Fractal Design R Dingsbums Define, immer wieder die neuesteVersion und ich finde das Gehäuse so nice, das werde ich mir wahrscheinlich einfach wiederholen,jetzt fragt vielleicht jemand, warum verwendest du denn nicht das alte Gehäuse wieder, wennich es doch schon mehrere Rechner Generationen hatte, das ist ganz einfach, weil ich zufaul bin, weil dann müsste ich den alten Rechner vom Dachboden holen, ausbauen oder den aktuellenRechner, der hier steht und dann zum nächsten Dachboden Rechner wird, ich schmeiße ja sowasdann weg, äh ausbauen, da habe ich keinen Dock drauf, da bin ich zu faul, da gebe ichlieber 120 Euro aus und kaufe ein neues Gehäuse, so aber sobald es wieder soweit ist, sobaldes wieder soweit ist, dass es eine neue Nvidia Grafikkarten Generation gibt, ey das ist doof,das will ich nicht, dann kaufe ich mir einen neuen Rechner, am besten natürlich in Kombinationmit neuer CPU Generation, ich hätte mir ja gerne letztes Jahr schon oder vorletztes Jahrschon immer endlich mal wieder ein AMD System gekauft, aber so wie es aktuell aussieht,scheint ja Intel halbwegs aufgeschlossen zu haben und mal gucken wie die nächste Generationaussieht, bin gespannt.Max heute schon eine Eins kopiert, ich glaube wir bräuchten einen Counter, ich habe heutewahrscheinlich schon 420 Einsen kopiert, wenn das mal reicht, warum ist der Airflow beschissen?Hä, warum ist der Airflow beschissen?Ich mein, der Airflow geht vorne rein mit Lüftern und direkt hinten über die CPU wiederraus, also Moment, wo ist denn vorne die Tür offen, also, ich brauchte es mal ohne Türvorne, so, es ist ja schön, dass ihr 30 Milliarden Bilder habt von eurem Gehäuse, aber wie wärees denn mal von vorne mit geöffneter Tür, gibt es nicht, hier, so, du hast vorne denLüfter drin, du hast vorne den Lüfter drin und hinten den Lüfter, das geht, ach so,du meinst, weil vorne zu ist, also du meinst, wenn es vorne offen wäre, wäre das besserals dass er das nebenan saugen muss, ja gut, das ist wohl wahr, ja, das ist oben zu undes hat vorne nur was zum ansaugen an der Seite, ja das schöne ist aber, dass das überallLuftfilter und sowas hat, das wird nullstaubig, ok, das verstehe ich, dass vorne nicht soviel reinkommt, aber ganz im Ernst, das ist komplett ausreichend, ich mein, wenn manseine CPU jetzt irgendwie so am Limit übertaktet mit mehr Spannung und allem, ok, dann versteheich es, aber mein Rechner läuft im Desktop-Pertrieb nahezu silent und ja, wenn ich Spiele anmache,dreht er halt ein bisschen hoch, aber, vielleicht sollte ich mir aber wirklich ein neues Gehäuseangucken für nächsten Build, Fractal, die sind Meshify 2, die Namen von Gehäusen werdenauch immer geiler, aber nix toppt, irgendwelche Mainboards, die KillerFatality, Headshot Prooder so heißen, ok, das sieht tatsächlich auch ganz schick aus, ist da, ist da das allerwichtigste,Staubfilter, Fragezeichen, meint ihr Nvidia stellt dieses Jahr ihre 4000er Serie vor,ich hoffe es, weil ansonsten kaufe ich mir keinen neuen Rechner, Moment, wir schauenmal kurz, ob die auch wieder so ein, wie nennt sich das so, dieses Explode View heißt dasglaube ich, Explode Ansicht, da ist, ok, gut, da ist ein Luftfilter dabei, sowohl obenals auch unten, ja, das ist cool, das gefällt mir, Cost, ja gut, das kostet ungefähr soviel wie das Fractal Design, Define, Blah, R, irgendetwas, gut, aber oben, also oben wärees mir tatsächlich lieber, wenn das zu wäre, ich will, ich will gar nicht, dass das obenauf ist, weil oben auf heißt auch mehr Krach kommt raus, hast du mitbekommen, dass Nvidiateilweise ihre Linux Treiber open sourced, ja, soweit ich weiß, open sourced Nvidiaihre Linux Treiber komplett, was sie nicht open sourcen ist ihre Compute Geschichte,also CUDA und, wahrscheinlich irgendwelche NVN Geschichten und sonst was, aber der eigentlicheGrafikkartentreiber wird angeblich komplett open sourced, ja, kauf mir keine Wasserkühlung,bin überhaupt kein Fan von Wasserkühlung, Wasserkühlung ist nicht, ist die Weis, abwartenist immer noch Nvidia, ja das stimmt wohl, also Gehäuse die oben zu sind finde ich persönlichnett, weil ich habe die Gehäuse ja quasi so schräg neben mir stehen und ich bin äußerstempfindlich was Rechnergeräuche angeht, also ich möchte, dass der im normalen DesktopBetrieb wirklich silent ist, was, also silent heißt für mich nicht lüfterlos, sondernhalt, dass ich es nicht höre und ich habe aktuell einen Noctua DH15, kann das sein,so ein Lüfter, wenn der hoch dreht, ich meine da geht es richtig ab, ja, ach guck mal mit6 Heatpipes, wusste ich gar nicht, dass er 6 Heatpipes hat, ne ich hab nur, ich hab dengleichen mit nur einem Lüfter anstatt 2, also wenn der richtig hoch dreht und überseine 6 Heatpipes den Kram abtransportiert, dann wird es auch laut, aber im Desktop Betriebdreht er leise und ist richtig, richtig leise, ja, es mir gerade aufgefallen, dass ich ausirgendwelchen Gründen mal ein sinnloses Text-to-Speech für Heatpipes eingebaut hab, ja, der ist topder Lüfter, weiß nicht ob der immer noch angesagt ist, Kopfhörer, ne Kopfhörer istkeine Alternative zu im Desktop Betrieb nicht hörbare Rechner, man hat zwar öfters Kopfhörerauf, sei es, dass man mietet oder dass man was spielt oder so, aber ich sitz oft genugvorm Rechner und hab absichtlich keine Kopfhörer auf, wenn man den ganzen Tag den Kopfhörerauf hat ist es auch nicht angenehm und mir reicht das schon, ich muss so viele Stundenmieten am Tag mittlerweile, wo ich Kopfhörer auf hab, da will ich auch so mal vorm Rechnersitzen ohne Kopfhörer und deswegen muss das im Desktop Betrieb silent sein oder halt silentbedeutet für mich ich hör ihn nicht und das ist aktuell so, ja das sind Österreicher,doch Doktora sind Österreicher, jeder Kopfhörer ist bei 12 Stunden am Tag irgendwann zu viel,außerdem kommt mir die Luft an die Ohren, sei denn man braucht das nicht, kannst dumir die neue Xbox bauen, easy, kein Problem, haben wir, mit einem ESP32 drin, vor allembei den warmen, ja das schöne ist gerade, ich hab meine Klimaanlage vorgestern angeschaltetund seitdem seh ich auf der Arbeit die Leute die ganze Zeit im Chat schreiben, boah heuteist aber, geht aber hier richtig, richtig warm, denk ich mir so, was, Kegweight, beimir ist angenehm, 23, 24 Grad, aber ich häng das nicht so sehr an die große Glocke, weiles 20 Meter weird flex, ja, so Leute, Bettke, ja 23, 24 Grad ist doch ok, was hast du füreine Klimaanlage, ja das ist ein Splitgerät, ich hab eine Außenstation an der Wand undmehrere Innendinger, das wusste ich mir auch von irgendeinem Kelte, Kelte, wie nennt sichdas, du brauchst eh ne gewisse Zertifizierung, dass du überhaupt Anlagen, Klimaanlagen einbauenlassen kannst, Kelte, irgendein Handwerker der zertifiziert ist Klimaanlagen einzubauen,bei denen hab ich das gemacht, Klimatechniker, Kältetechniker, das ist das was ich gemeinthab, ja, die sind dann angerückt, haben ein Loch in die Wand gebohrt, mit nem Schlauchdurch und haben dann da das draußen angeschlossen, haben sie draußen auf die Leiter gestelltund was mich damals überrascht hat ist, die hatten zwei Mädels dabei, also es waren zweiKerle und zwei Mädels, die die Klimaanlage eingebaut haben, hätt ich jetzt gar nichtim Handwerkerbereich so vermutet, so ungefähr ja, also das Haus hat mal der Opa, ne der Opahat es auch nicht gebaut, das stimmt gar nicht, der, ich glaub mein Opa oder so hates gebaut, der der irgendwann nach Südafrika abgehauen ist, Baujahr ist irgendwie 1900rum oder so, es ist also auch noch sehr massiv gebaut, zwei verschiedene Deckel, wenn esden geschlossenen Deckel hat bin ich sofort dabei, Pog, so Leute, Bethke, gibt es irgendjemandenden ich hausten kann, Semper Video hab ich das letzte Mal gehostet, Massive genau wieMax, so ist es, so siehts aus, ich hab was mit nix zuerst gemacht, ne, man könnte, binich jetzt quasi ein Achtel Afrikaner oder so, wobei das zählt ja nicht, mein Opa istja nur abgehauen nach Südafrika, was damals viele gemacht haben, damals haben viele Frauenund Kinder in Deutschland sitzen lassen und sind nach Südafrika, ich weiß ehrlich gesagtgar nicht warum, bin ich historisch nicht so bewandert, äh bewandt, ey ich mag keineWasserkühlung, egal Leute, Bett geht time, ich geh jetzt schlafen, wir sehen uns vielleichtmorgen im nächsten Stream, mal gucken, paar Sachen muss ich noch einkaufen, vielleichtmal morgen wirklich dann auch die ganzen Sachen komplett, weil alles, alles haben wirheute nicht hinbekommen, aber wir waren schon relativ effektiv im Vergleich zu sonst, wiekrieg ich denn das wieder weg, und ich geh jetzt pennen, wir sehen uns, bis dahin, machtsgut, see you.", "segments": [{"id": 1, "start": 270.0, "end": 296.04, "text": "Hallo Ach, ihr habt mich die ganze Zeit nicht gehört"}, {"id": 2, "start": 296.04, "end": 307.52, "text": "oder was? Ihr habt mich null gehört oder was? Ich rede mit euch schon seit 5 minuten."}, {"id": 3, "start": 307.52, "end": 323.84, "text": "Aber guckt mal, das ist doch wieder ein Beweis, wie beschissen Windows ist oder? Ich hab nichts"}, {"id": 4, "start": 323.84, "end": 328.56, "text": "geändert, ich hab nichts ausgesteckt, ich hab nichts eingesteckt, ich hab einfach nur,"}, {"id": 5, "start": 328.56, "end": 335.84, "text": "doch ich hab ein Update gemacht vorhin. Ich hab Windows Update gemacht. Warum stellt ein"}, {"id": 6, "start": 335.84, "end": 342.76, "text": "Windows Update mein Default Audio um? Warum ist das so scheiße? Warum kann es sich Microsoft"}, {"id": 7, "start": 342.76, "end": 349.04, "text": "erlauben, sich bei sowas absolut keine Mühe zu geben? Ok, dann werde ich nochmal alles erzählen,"}, {"id": 8, "start": 349.04, "end": 357.92, "text": "was ich jetzt die letzten 5 minuten erzählt hab. Als erstes hab ich gesagt, ich hab vorhin was bei"}, {"id": 9, "start": 357.92, "end": 366.4, "text": "mir daheim gefunden in der Kiste. Neuer Audio Treiber. Ne, ich hab Windows Update gemacht."}, {"id": 10, "start": 366.4, "end": 378.68, "text": "Also, blablabla. Ne, das hört sich an wie immer. Hat der vielleicht den Sound wieder umgestellt?"}, {"id": 11, "start": 378.68, "end": 383.88, "text": "Also, ich hab vorhin bei mir in der Kiste sowas gefunden. Ich dachte mir so kritisch,"}, {"id": 12, "start": 383.88, "end": 388.88, "text": "dass sie mir den Kram heutzutage so nennt. Das wär bestimmt heute anders benannt worden."}, {"id": 13, "start": 388.88, "end": 395.36, "text": "Dann hab ich ein paar andere Sachen dazu erzählt, die weiß ich jetzt aber nicht mehr. Ja,"}, {"id": 14, "start": 395.36, "end": 400.44, "text": "dass man das wahrscheinlich heute noch braucht, weil heute auch immer noch VGA im Umlauf ist,"}, {"id": 15, "start": 400.44, "end": 407.16, "text": "so für Oldschool-Beamer und sowas. Dann hab ich noch irgendwas erzählt über die"}, {"id": 16, "start": 407.16, "end": 417.68, "text": "Aussprache von Amazon oder so, keine Ahnung. 108, Moment. Das hab ich gelesen. Das ist ja auch"}, {"id": 17, "start": 417.68, "end": 425.96, "text": "gut so. Breakthrough ist ja auch absoluter Dreck mit den Maps, wie es jetzt ist und dem Punkteplacement."}, {"id": 18, "start": 425.96, "end": 430.88, "text": "128 Spieler ist halt noch viel, viel mehr Crap. Das Problem ist, dass dieser Spielmodus,"}, {"id": 19, "start": 430.88, "end": 437.88, "text": "so wie jetzt, auch mit 64 Spielern nicht funktioniert. Das ist halt lächerlich. Aber ganz ehrlich,"}, {"id": 20, "start": 437.88, "end": 442.44, "text": "das Spiel ist eh dead. Das wird auch nie alive sein wieder. Die haben vorhin eine"}, {"id": 21, "start": 442.44, "end": 450.32, "text": "neue Skin angekündigt. Da hab ich mir auch gedacht, endlich ein neuer Skin. Da hab ich aber ganz schön"}, {"id": 22, "start": 450.32, "end": 456.68, "text": "lange drauf gewartet. Jetzt werd ich wieder installieren. Und ich hab gesagt, heute kaufen"}, {"id": 23, "start": 456.68, "end": 461.2, "text": "wir endlich mal richtig den Kram ein, den ich das letzte Mal immer nur gesagt hab,"}, {"id": 24, "start": 461.2, "end": 468.16, "text": "dass ich den endlich mal einkaufen muss, weil es wird echt Zeit. Ich hab jetzt drei Streams"}, {"id": 25, "start": 468.16, "end": 474.04, "text": "gemacht und wir haben nur geschwätzt oder zwei Streams und wir haben nur geschwätzt. Und ich"}, {"id": 26, "start": 474.04, "end": 478.32, "text": "bin nicht dazu gekommen. Übrigens, wo wir gerade dabei sind, ich habe vorhin gesehen,"}, {"id": 27, "start": 478.32, "end": 485.4, "text": "man bekommt aktuell, weil wir es ja letztens von meinen Access Points hatten, man bekommt aktuell"}, {"id": 28, "start": 485.4, "end": 495.44, "text": "aus England einen relativ günstig, wenn man schnell ist beim Beaten. Und zwar bald endend. Der ist es"}, {"id": 29, "start": 495.44, "end": 504.76, "text": "nicht. Der ist bisschen teuer. Man bekommt in drei Tagen einen aus England für 270 Euro ungefähr,"}, {"id": 30, "start": 504.76, "end": 513.92, "text": "wenn da sonst keiner drauf bietet. Könnt ihr ja mal gucken. Nee, nee, nee, nicht aus Freedom"}, {"id": 31, "start": 513.92, "end": 521.08, "text": "Kocona. Der hier. Also wer auch so ein Access Point guckt, kann ja gucken aus England. England"}, {"id": 32, "start": 521.08, "end": 525.64, "text": "geht über diese eBay, über dieses eBay Shipping. Das dauert meistens fünf, sechs Tage oder so eine"}, {"id": 33, "start": 525.64, "end": 533.72, "text": "Woche, dann ist es da. Und ihr bezahlt aktuell 150 Pfund und dann nochmal irgendwie, ja,"}, {"id": 34, "start": 533.72, "end": 549.16, "text": "sagen wir nochmal 70 Pfund obendrauf. Also sprich 230, nee, 220 Pfund, 220 Pfund in Euro sind 260,"}, {"id": 35, "start": 549.16, "end": 560.84, "text": "260 Euro. Das ist doch okay. Das ist in Ordnung. Natürlich nur, wenn das bei Mindestgebot rausgeht,"}, {"id": 36, "start": 560.84, "end": 565.48, "text": "was wahrscheinlich nicht so sein wird. Also mehr als 300 Euro würde ich nicht bezahlen. Aber ich"}, {"id": 37, "start": 565.48, "end": 570.28, "text": "habe gesehen, was bald abläuft. Also falls einer auch noch Bock auf richtig schnell einen Access"}, {"id": 38, "start": 570.28, "end": 577.0, "text": "Point hat, gibt euch. Mal wegen dem Label-Champ und einem eigenen Projekt heran, das wäre die"}, {"id": 39, "start": 577.0, "end": 580.16, "text": "beste Möglichkeit von einer Web-Anwendung einen Druck auf einen angeschlossenen Drucker zu"}, {"id": 40, "start": 580.16, "end": 584.36, "text": "initiieren ohne irgendwelche Browser Druck zu haben. Nee, also mit JavaScript kannst du"}, {"id": 41, "start": 584.36, "end": 587.8, "text": "es insofern vergessen, weil du müsstest ja irgendwie diesen Drucker über, über,"}, {"id": 42, "start": 587.8, "end": 600.0, "text": "wie heißt dieses Netzwerk Druckprotokoll? Ehm, ehm, ehm, Epp. Das müsstest du über Epp machen,"}, {"id": 43, "start": 600.0, "end": 605.14, "text": "das kannst du nicht. Das geht nicht, weil da müsstest du TCP-Sockets haben und TCP-Sockets"}, {"id": 44, "start": 605.14, "end": 609.46, "text": "Zugriff hast du mit JavaScript nicht, deswegen kannst du das knicken, das heißt du brauchst"}, {"id": 45, "start": 609.46, "end": 615.3, "text": "auf jeden Fall irgendein Backend was das macht und die einfachste Variante in dem Fall ist"}, {"id": 46, "start": 615.3, "end": 620.38, "text": "natürlich, also du willst ja nicht über Windows den Kram adden, über die Windows Druckersuche,"}, {"id": 47, "start": 620.38, "end": 624.7, "text": "aber du kannst irgendeinen Backend machen was IPP spricht, da gibt es für die meisten"}, {"id": 48, "start": 624.7, "end": 628.58, "text": "Sprachen Libraries, sogar für.NET gibt es welche."}, {"id": 49, "start": 628.58, "end": 637.02, "text": "IPP, also wenn das ein Netzwerkdrucker ist, ich gehe mal davon aus, ich gehe mal davon"}, {"id": 50, "start": 637.02, "end": 641.06, "text": "aus es ist ein Netzwerkdrucker, weil du willst die Daten zum Drucker bekommen, also wenn"}, {"id": 51, "start": 641.06, "end": 648.86, "text": "das ein Netzwerkdrucker ist dann IPP, da gibt es wie gesagt.NET, da gibt es für alles,"}, {"id": 52, "start": 648.86, "end": 653.22, "text": "da gibt es für Go Libraries, für Node, du kannst auch in Node.js, kannst du auch machen,"}, {"id": 53, "start": 653.22, "end": 660.1, "text": "Node.js hat sogar eine relativ gute, habe ich gesehen, IPP Library, keine Ahnung, du musst"}, {"id": 54, "start": 660.1, "end": 666.14, "text": "mal gucken welche, aber die scheint ganz gut zu porten, also die einfachste Variante wäre"}, {"id": 55, "start": 666.14, "end": 675.58, "text": "in dem Fall denke ich irgendein mini Backend, sei es Go, sei es.NET, sei es Node und mit"}, {"id": 56, "start": 675.58, "end": 679.62, "text": "einem AP Endpunkt nämlich Upload von einem Bild oder so und dann kannst du es per IPP"}, {"id": 57, "start": 679.62, "end": 680.62, "text": "dahin schicken."}, {"id": 58, "start": 680.62, "end": 686.94, "text": "Oh ja, ich habe es mitbekommen, die haben die Eintracht empfangen in Frankfurt auf irgendeinem"}, {"id": 59, "start": 686.94, "end": 691.5, "text": "Platz, ich weiß nicht, Fußball juckt mich absolut gar nicht und jetzt ist Unwetter,"}, {"id": 60, "start": 691.5, "end": 697.06, "text": "es geht richtig ab, guckt euch das mal an, irgendwie brauchen wir eine Wetterkarte oder"}, {"id": 61, "start": 697.06, "end": 702.66, "text": "so, passt mal ab in Hanau, nicht in Hanau auch, aber in Frankfurt, in Frankfurt ist"}, {"id": 62, "start": 702.66, "end": 708.26, "text": "gerade richtig MonkaS angesagt, Unwetterwarnung, ok es ist mehr oder weniger schon drüber,"}, {"id": 63, "start": 708.26, "end": 714.1, "text": "es ist mehr oder weniger schon drüber über Frankfurt, aber sag euch, da geht es ab gerade,"}, {"id": 64, "start": 714.1, "end": 720.74, "text": "ja auf dem Römer, stimmt, die werden eigentlich immer auf dem Römer empfangen, aber ich"}, {"id": 65, "start": 720.74, "end": 726.78, "text": "denke hier geht es richtig ab, gerade, ich bin ja in Hanau, das wisst ihr, manche wahrscheinlich"}, {"id": 66, "start": 726.78, "end": 734.78, "text": "und in Hanau hat es gerade die letzte halbe Stunde so krass gewittert und gestürmt als"}, {"id": 67, "start": 734.78, "end": 742.14, "text": "die Katze ist auf dem Sofa, die hat Panik gekriegt, was ist hier los, nix sie weg, MonkaShake,"}, {"id": 68, "start": 742.14, "end": 748.02, "text": "ja, also hier unwettermäßig, wo wir gerade dabei sind, jetzt kann ich doch mal gucken,"}, {"id": 69, "start": 748.02, "end": 753.62, "text": "ob es mal eine Wetterstation gecheckt hat, Sekunde Leute, Wetter, Wetter Station, was"}, {"id": 70, "start": 753.62, "end": 769.22, "text": "sagt die Wetter Station, Wind, Regen, ok aktuell kein Regen mehr, aber zwischenzeitlich 2,3"}, {"id": 71, "start": 769.22, "end": 784.26, "text": "mm pro Stunde, was bedeutet mm pro Stunde, was steht das mm, Niederschlag, oh das ist"}, {"id": 72, "start": 784.26, "end": 790.66, "text": "5 Head Unit, wusste ich gar nicht, dass es das gibt, mm pro Stunde, das sind keine Millimeter"}, {"id": 73, "start": 790.66, "end": 795.26, "text": "oder, das ist irgendwas, da müsste es ja die Öffnung genormt sein, wenn das Millimeter"}, {"id": 74, "start": 795.26, "end": 814.5, "text": "sind, mm, wie rechnet man das aus, ein mittelstarker Regenschauer, ein mittelstarker Regenschauer"}, {"id": 75, "start": 814.5, "end": 821.5, "text": "mittelhoch war das von 5 mm, also ich hatte 7 oder 8, ich glaube 7 mm hatte ich gerade"}, {"id": 76, "start": 821.5, "end": 827.98, "text": "Regen mit meiner Wetterstation gemessen hier, 7,8, 8, sagen wir 8, 8 mm habe ich gerade"}, {"id": 77, "start": 827.98, "end": 836.02, "text": "gemessen, 8 mm scheint mir ja relativ viel zu sein, also es ist zwischen, zwischen mittelstarker,"}, {"id": 78, "start": 836.02, "end": 843.26, "text": "also ein starker Regenschauer war das, es war kein Starkregen, aber die Wetterstation"}, {"id": 79, "start": 843.26, "end": 849.26, "text": "steht ja auch nicht komplett irgendwie weit weg von allen Gebäuden oder auf den Baum"}, {"id": 80, "start": 849.26, "end": 854.18, "text": "oben drauf oder so, also das regnet wahrscheinlich auch ein bisschen aufs Dach nebenbei, obwohl"}, {"id": 81, "start": 854.18, "end": 859.98, "text": "es eigentlich nicht unter dem Dach steht, ja, also jetzt wird es zusammen auch was geben,"}, {"id": 82, "start": 859.98, "end": 873.06, "text": "aber ich habe keine Ahnung, warum es mm pro Stunde ist, kann mir das, aha die Höhe,"}, {"id": 83, "start": 873.06, "end": 879.82, "text": "1 Liter pro Quadratmeter und Stunde ergibt 1 mm Regenhöhemenge in einer Stunde, ach"}, {"id": 84, "start": 879.82, "end": 894.54, "text": "so, alter das ist ja die absolute Pfeiferteinheit, Big, Biggest Brain brauchste dafür, 1 Liter"}, {"id": 85, "start": 894.54, "end": 901.62, "text": "pro Quadratmeter, also sind 8 dann 8 Liter pro Quadratmeter, keine Ahnung, Liter pro"}, {"id": 86, "start": 901.62, "end": 909.1, "text": "Quadratmeter könnte ich irgendwie mehr anfangen, aber man kann das ja umrechnen, das ist tatsächlich"}, {"id": 87, "start": 909.1, "end": 917.34, "text": "interessant, das wusste ich nicht, ja, also das mit dem Drucker, also das mit dem Drucker"}, {"id": 88, "start": 917.34, "end": 922.22, "text": "haben wir ja beantwortet, also wenn du was wissen willst, schieß los, hast du den Wasserkocher"}, {"id": 89, "start": 922.22, "end": 926.22, "text": "schon gekauft, ne bestellen wir heute aber alles, Matheprüfung und wir sind gelaufen,"}, {"id": 90, "start": 926.22, "end": 933.42, "text": "ich habe heute meinen Chef geschockt auf der Arbeit, ich hoffe mal er guckt jetzt nicht"}, {"id": 91, "start": 933.42, "end": 940.06, "text": "zu gerade, man weiß ja nie, wir hatten monatliche Rücksprache und ich habe mich erst ein bisschen"}, {"id": 92, "start": 940.06, "end": 943.46, "text": "ausgelassen, was mir auf den Keks geht und sonst wie was und dann habe ich zu ihm gesagt,"}, {"id": 93, "start": 943.46, "end": 947.58, "text": "ja wir müssen uns auch mal wieder über mehr Geld unterhalten und dann hat er gemeint,"}, {"id": 94, "start": 947.58, "end": 965.9, "text": "gut dass ich sitze, aber gut, da musste durch als Führungskraft, hauptsache eine Wetterstation"}, {"id": 95, "start": 965.9, "end": 970.82, "text": "und das nicht wissen, ja als kaufst du dir irgendwas und weißt alles im Detail, sobald"}, {"id": 96, "start": 970.82, "end": 976.42, "text": "du es hast durch irgendwelche Eingebungen, ja ganz bestimmt, Inflation dies das, das"}, {"id": 97, "start": 976.42, "end": 982.34, "text": "lassen sie bestimmt nicht gelten, weil im Prinzip es ist egal wann du fragst, dein Arbeitgeber"}, {"id": 98, "start": 982.34, "end": 987.78, "text": "sagt immer so, oh jetzt ist ganz schlecht, jetzt ist gerade eine ungünstige Gelegenheit,"}, {"id": 99, "start": 987.78, "end": 991.82, "text": "aber dann jedes Jahr erzählen nach dem Motto, wir haben ein neues Rekord ja, wir sind die"}, {"id": 100, "start": 991.82, "end": 996.54, "text": "allergeilsten, ah aber jetzt ist schlecht, Corona ist schlecht, jetzt ist was anderes"}, {"id": 101, "start": 996.54, "end": 1009.1, "text": "schlecht, ah man, also irgendwelche Tipps um an einen Raspberry Pi zu kommen, also ich"}, {"id": 102, "start": 1009.1, "end": 1014.9, "text": "habe meine letzten Barberry Base gekauft, da hatten die noch kurzzeitig welche, ich habe"}, {"id": 103, "start": 1014.9, "end": 1024.38, "text": "Raspberry Pi 4s gekauft mit 8G für, ich weiß nicht mehr 120 Euro oder ne, 8G ne mit Netzteil"}, {"id": 104, "start": 1024.38, "end": 1029.26, "text": "120 Euro, ihr wisst wir haben es zusammen im Stream gekauft, die Sache ist bloß die,"}, {"id": 105, "start": 1029.26, "end": 1035.02, "text": "dass wahrscheinlich auch Barberry Base aktuell keine Raspberry Pi's hat, vermute ich jetzt,"}, {"id": 106, "start": 1035.02, "end": 1046.46, "text": "vermute ich jetzt einfach mal, derzeit nicht lieferbar ja, haben die sowas wie sofort lieferbar,"}, {"id": 107, "start": 1046.46, "end": 1055.14, "text": "das Netzteil ist lieferbar, nice, nice, das wichtig, wichtig, wichtig, ganz ganz wichtig,"}, {"id": 108, "start": 1055.14, "end": 1058.62, "text": "Leute ich muss mal nebenbei hören ob mein 3D Drucker fertig ist, dass ich den dann ausschalten"}, {"id": 109, "start": 1058.62, "end": 1064.78, "text": "kann, ich druck nämlich gerade ein, ich druck kein Nanoleaf, dass ich schwachsinn, ich druck"}, {"id": 110, "start": 1064.78, "end": 1077.18, "text": "mir gerade ein Shell, Shelf Mount oder so, keine Ahnung wie das eigentlich genau heißt,"}, {"id": 111, "start": 1077.18, "end": 1084.74, "text": "ein Winkel für ein Regal oder für eine Holzplatte an der Wand, keine Ahnung nach was ich suchen"}, {"id": 112, "start": 1084.74, "end": 1100.02, "text": "muss, what, nicht Self, Shelf, Shelf Alter, kein Planer, zumindest ich druck mir gerade"}, {"id": 113, "start": 1100.02, "end": 1105.74, "text": "so, naja nicht sowas aber so ein Winkel, sowas hier in der Richtung druck ich mir gerade"}, {"id": 114, "start": 1105.74, "end": 1113.9, "text": "aus und das braucht ungefähr eine Stunde pro, ja hier Winkel und ich will den dann ausmachen"}, {"id": 115, "start": 1113.9, "end": 1118.62, "text": "weil der 3D Drucker da ist immer so laut und der macht hier ganz viel Feinstaub, mein Ikea"}, {"id": 116, "start": 1118.62, "end": 1127.06, "text": "Sensor ist schon wieder auf Mittel, Raspberry Pi 2GB, nee gibt nix, aber seriously das"}, {"id": 117, "start": 1127.06, "end": 1133.94, "text": "einzige was lieferbar ist, ist wirklich, guck mal ich hab gesagt sofort lieferbar und was"}, {"id": 118, "start": 1133.94, "end": 1137.42, "text": "zeigt ihr mir an ein Raspberry Pi der nicht lieferbar ist, ja das ist ja richtig pfeifert"}, {"id": 119, "start": 1137.42, "end": 1144.22, "text": "die Seite, welchen 3D Drucker hast du, ich hab ein I3 Mega S seit ein paar Jahren schon,"}, {"id": 120, "start": 1144.22, "end": 1147.7, "text": "würde ich jetzt nicht mehr kaufen, also nicht weil er schlecht ist, sondern weil es mittlerweile"}, {"id": 121, "start": 1147.7, "end": 1153.66, "text": "bessere gibt, noch bessere Einsteiger Drucker, aber der war ziemlich nice und ist auch noch"}, {"id": 122, "start": 1153.66, "end": 1158.18, "text": "eigentlich ganz nice, einzig was bei dem dumm ist und das ist heute glaube ich auch im Einsteiger"}, {"id": 123, "start": 1158.18, "end": 1163.42, "text": "Bereich möglich, ist das der automatische Kalibrierung von der Platte und dem Druckkopf"}, {"id": 124, "start": 1163.42, "end": 1168.94, "text": "und sowas hat, oder wie heißt das, Extruder, nee das heißt ja nicht Druckkopf, Nozzle,"}, {"id": 125, "start": 1168.94, "end": 1176.06, "text": "die Nozzle ist es genau, nee nachdem ich es jetzt mal ordentlich eingestellt hab ist okay,"}, {"id": 126, "start": 1176.06, "end": 1181.26, "text": "aber so Auto Leveling und Messen und so finde ich wirklich cool, hat der halt nicht, werde"}, {"id": 127, "start": 1181.26, "end": 1187.26, "text": "ich auch nicht nachrüsten, so also die haben anscheinend wirklich keinerlei Raspberry Pies,"}, {"id": 128, "start": 1187.26, "end": 1197.7, "text": "keine Chance, das an PoE hat, aber das gute bei mir ist, ich hab noch 3 Raspberry Pie,"}, {"id": 129, "start": 1197.7, "end": 1205.86, "text": "äh stimmt nicht, zwei Raspberry Pie 4 im Fleer Case hier rumstehen, weil ich hab einen aus"}, {"id": 130, "start": 1205.86, "end": 1213.46, "text": "dem Wohnzimmer letztens abgebaut, den brauch ich nicht mehr, da ist jetzt temporär erstmal"}, {"id": 131, "start": 1213.46, "end": 1219.58, "text": "wieder der Odroid dran und dann kommt vielleicht bald was anderes, was wir heute kaufen und"}, {"id": 132, "start": 1219.58, "end": 1224.26, "text": "dann hab ich noch einen Raspberry Pie 3, das sollte reichen für nächste Zeit, Raspberry"}, {"id": 133, "start": 1224.26, "end": 1231.38, "text": "Pie Needs, wer los man, nö, ich verlos doch in der aktuellen Keilzeit, kein Raspberry"}, {"id": 134, "start": 1231.38, "end": 1238.66, "text": "Pie, warum soll ich das denn machen, also ich bin ja manchmal blöd, aber so blöd, dass"}, {"id": 135, "start": 1238.66, "end": 1243.58, "text": "ich Raspberry Pie in der Zeit aus den Händen geb, bin ich nicht, ne okay die haben keinen,"}, {"id": 136, "start": 1243.58, "end": 1251.3, "text": "ja bei Berry Base hat man manchmal tatsächlich noch Glück, aber, schauen wir mal, ob irgendwo"}, {"id": 137, "start": 1251.3, "end": 1266.7, "text": "irgendein Laden was hat, das halte ich für ein Gerücht, lagern beim Händler für 48"}, {"id": 138, "start": 1266.7, "end": 1277.1, "text": "Euro, nutzt du ein Repetier Server, nö, ich hab da ein Octopie dran und der schickt das"}, {"id": 139, "start": 1277.1, "end": 1286.42, "text": "dahin und dann die Onboard-Firmware, die das druckt, ah, der 3 habt ihr es gehört, Piep,"}, {"id": 140, "start": 1286.42, "end": 1293.54, "text": "der 3D Drucker ist fertig, muss ich kurz warten, bis er abgekühlt ist, der Raspberry Pie Locator,"}, {"id": 141, "start": 1293.54, "end": 1302.62, "text": "das ist quasi der Preis-Champ nur in nicht so hübsch oder wie, Berry Base, sag ich doch,"}, {"id": 142, "start": 1302.62, "end": 1313.9, "text": "aber in Last Stock, guck mal seht ihr das, Last in Stock, die hatten alle zuletzt einen"}, {"id": 143, "start": 1313.9, "end": 1328.78, "text": "im April, das ist ja krass, so und das hier ist Cheap Bait, angeblich, was ist denn das"}, {"id": 144, "start": 1328.78, "end": 1336.98, "text": "jetzt schon wieder, angeblich 48 Euro, so und wo soll das sein, Cheap Baited, guck"}, {"id": 145, "start": 1336.98, "end": 1352.38, "text": "mal hier, ab 48 Euro, wo, wo ist es, angeblich lagern ab 48 Euro, wo, wo, wo ist es, ich"}, {"id": 146, "start": 1352.38, "end": 1369.74, "text": "seh hier nix, also, wo soll das sein, ja welche, welche Variante denn, alle Varianten anzeigen,"}, {"id": 147, "start": 1369.74, "end": 1386.98, "text": "Cheap Baited, einfach, ah hier, 1G, wusste ich gar nicht, dass es den 4er in 1G gibt,"}, {"id": 148, "start": 1386.98, "end": 1395.9, "text": "was ist denn da UVP von dem Ding, 30, ich mein 1GB reicht für 90% der Dinger, die"}, {"id": 149, "start": 1395.9, "end": 1404.02, "text": "man machen will auf den Dingern aus, aber ganz ehrlich, ich find so der, der Sweet Spot"}, {"id": 150, "start": 1404.02, "end": 1409.98, "text": "normalerweise ist bei 2 besser, besser bei 4GB, 8GB braucht man nicht, also mir fällt"}, {"id": 151, "start": 1409.98, "end": 1416.14, "text": "ein, fällt euch was ein Chat, was, für was braucht man 8GB RAM auf dem Raspberry Pi,"}, {"id": 152, "start": 1416.14, "end": 1422.94, "text": "also mir fällt kein wirklich sinnvolles Anwendungsgebiet ein, außer so komische, ja fast schon esoterische"}, {"id": 153, "start": 1422.94, "end": 1428.5, "text": "Dinger, wie einen, einen Kubernetes Cluster daheim zu betreiben mit 3 Raspberry Pis und"}, {"id": 154, "start": 1428.5, "end": 1434.54, "text": "ganz vielen Containern und so, aber das macht ja keiner, ok Minecraft, ja, ja gut, wer Minecraft"}, {"id": 155, "start": 1434.54, "end": 1447.7, "text": "auf dem Raspberry Pi hostet, vielleicht, also, fällt mir grad, äh, fällt mir nix zu ein,"}, {"id": 156, "start": 1447.7, "end": 1453.98, "text": "1G ist auch irgendwie, ist nicht auch blöd, aber der Kram ist wirklich extrem teuer, also"}, {"id": 157, "start": 1453.98, "end": 1459.74, "text": "ich hatte Glück, ich hab bei Berry Base das Ding für, ihr erinnert euch vielleicht, 120"}, {"id": 158, "start": 1459.74, "end": 1466.18, "text": "Euro, wir haben das Flir Case, den Raspberry Pi und das Netzteil bekommt für 120 Euro,"}, {"id": 159, "start": 1466.18, "end": 1473.26, "text": "das war, das war ok, ja, da kannst du dir nicht beschweren, äh, haben wir gerade, ja,"}, {"id": 160, "start": 1473.26, "end": 1478.98, "text": "Reserif, da ist er wieder, oder eigentlich ist es wahrscheinlich Preserif, weil Schriftart,"}, {"id": 161, "start": 1478.98, "end": 1487.78, "text": "äh, danke für den Sub, ne, also keine Tipps, es gibt grad keine, keine Scheiße, äh, was"}, {"id": 162, "start": 1487.78, "end": 1491.3, "text": "das, keine, manchmal, wenn das, manchmal hab ich das Problem, ich rede schneller als"}, {"id": 163, "start": 1491.3, "end": 1500.18, "text": "ich nachdenke im Kopf, äh, keine Chance, nicht keine Scheiße, na Scheiße ist es, ja,"}, {"id": 164, "start": 1500.18, "end": 1519.42, "text": "aber, sehr, das ist ne, das ist ne gute Anwendung für, für den ESP32, ja, ja, kann man machen."}, {"id": 165, "start": 1519.42, "end": 1525.78, "text": "Klopapier hab ich genug, ich hab mir zu Anfang von Corona eine Palette Klopapier bestellt"}, {"id": 166, "start": 1525.78, "end": 1529.9, "text": "und damals haben die Leute auf Twitter gesagt, ich such das jetzt nicht raus, damals haben"}, {"id": 167, "start": 1529.9, "end": 1534.74, "text": "die Leute auf Twitter gesagt, Max, du bist Teil des Problems, wie kannst du es nur wagen"}, {"id": 168, "start": 1534.74, "end": 1540.02, "text": "dir Klopapier zu bestellen, da hab ich mir gedacht, wisst ihr was, mir vollkommen egal"}, {"id": 169, "start": 1540.02, "end": 1542.98, "text": "was ihr da schreibt, ich hab wenigstens was, womit ich meine Arsch abputzen kann auch"}, {"id": 170, "start": 1542.98, "end": 1548.9, "text": "in Zukunft, aber, das ist Twitter, Twitter empornt, emporrt sich permanent über alles"}, {"id": 171, "start": 1548.9, "end": 1553.46, "text": "mögliche, mal ganz davon abgesehen, es war ja nie knapp das Klopapier, die haben einfach"}, {"id": 172, "start": 1553.46, "end": 1559.74, "text": "nicht das Klopapier schnell genug zum Sommermarkt bekommen, das war ja das Hauptproblem, also"}, {"id": 173, "start": 1559.74, "end": 1563.7, "text": "wenn ich bei irgendeinem Großhandel Palette Klopapier bestell, war das damals sogar besser,"}, {"id": 174, "start": 1563.7, "end": 1566.5, "text": "weil ich hab den ganzen Supermarkt-Krams entlastet."}, {"id": 175, "start": 1566.5, "end": 1573.82, "text": "Wieso nimmst du eigentlich immer die Eins am Ende der Uhr weg, das liegt daran, ich"}, {"id": 176, "start": 1573.82, "end": 1577.06, "text": "hab's erklärt, aber ich sag's noch mal ganz kurz, das liegt daran, weil ich mir irgendwann"}, {"id": 177, "start": 1577.06, "end": 1585.42, "text": "abangeböhnt hab, immer eine Eins zu Copypasten, damit ich weiß, was ich im Clipboard habe,"}, {"id": 178, "start": 1585.42, "end": 1593.94, "text": "ist das mein Tweet von damals, also Leute, wie findet ihr solche Tweets, ich find meine"}, {"id": 179, "start": 1593.94, "end": 1608.18, "text": "eigenen Tweets nicht, dann finden Leute Tweets von 2020, wo ich Klopapier bestellt hab,"}, {"id": 180, "start": 1608.18, "end": 1631.14, "text": "mit Ehre meets genommen, okay, der Typ hat wahrscheinlich rumgeflamet, egal, Twitter"}, {"id": 181, "start": 1631.14, "end": 1637.66, "text": "von dir und dann Klopapier, exzellent, ja und ich möchte immer im Clipboard das dazu"}, {"id": 182, "start": 1637.66, "end": 1642.86, "text": "erklären, also ich möchte immer wissen, was ich im Clipboard habe, das kommt aus Zeiten,"}, {"id": 183, "start": 1642.86, "end": 1647.82, "text": "wo ich noch viel ICQ und andere Instant-Messenger und Ingame-Chat und sowas verwendet hab und"}, {"id": 184, "start": 1647.82, "end": 1655.7, "text": "mir ist es dort manchmal passiert, dass ich Leuten ungeschickte Sachen geschrieben hab,"}, {"id": 185, "start": 1655.7, "end": 1661.82, "text": "weil ich falsch Copypastet hab und seitdem will ich immer wissen, was ich in meinem Clipboard"}, {"id": 186, "start": 1661.82, "end": 1665.22, "text": "hab, deswegen Copypaste ich die Eins."}, {"id": 187, "start": 1665.22, "end": 1669.98, "text": "Das hab ich mir so angewöhnt, das passiert schon ganz automatisch."}, {"id": 188, "start": 1669.98, "end": 1682.58, "text": "Warum trendet Armbrust auf Twitter, weil irgendein Typ, das hab ich vorhin in der Nachricht"}, {"id": 189, "start": 1682.58, "end": 1686.1, "text": "gesehen, weil irgendein Typ mit der Armbrust an irgendeine Schule gegangen ist, ich glaub"}, {"id": 190, "start": 1686.1, "end": 1691.9, "text": "war eine Schule und dort irgendeine Frau angeschossen oder sogar er schossen hat, bin mir jetzt"}, {"id": 191, "start": 1691.9, "end": 1700.78, "text": "gar nicht sicher, irgendein Typ hat mit einer Armbrust auf Leute geschossen, deswegen trendet"}, {"id": 192, "start": 1700.78, "end": 1703.18, "text": "wahrscheinlich Armbrust auf Twitter gerade."}, {"id": 193, "start": 1703.18, "end": 1707.34, "text": "Ich kenn Windows V, ich kenn das, man darf auch nicht abgeschaltet ab, weil ich sonst"}, {"id": 194, "start": 1707.34, "end": 1712.66, "text": "irgendwas leake hier im Stream, aber ich möchte im Clipboard die Eins haben, das hab ich mir"}, {"id": 195, "start": 1712.66, "end": 1713.66, "text": "so angewöhnt."}, {"id": 196, "start": 1713.66, "end": 1723.18, "text": "So und jetzt gehen wir mal, wenn wir gerade dabei sind, nein den Profikok wollen wir nicht,"}, {"id": 197, "start": 1723.18, "end": 1735.42, "text": "den Profikok, so zu hier, weg, also was hab ich denn noch im Card drinnen, also Wetterstation,"}, {"id": 198, "start": 1735.42, "end": 1741.54, "text": "die kann ich eigentlich löschen, den nehm ich auch ja, die kann ich löschen, weil die"}, {"id": 199, "start": 1741.54, "end": 1745.62, "text": "hab ich mir schon bestellt, die hat mir übrigens der Chat empfohlen, was äußerst Fiveheader"}, {"id": 200, "start": 1745.62, "end": 1752.06, "text": "war, weil die funktioniert ganz gut, ich lass jetzt so mal drin, dass man sieht, was ich"}, {"id": 201, "start": 1752.06, "end": 1757.9, "text": "da alles bestellt hab, weil das ist ja öfters mal Thema, was man im Stream verwendet hat"}, {"id": 202, "start": 1757.9, "end": 1762.02, "text": "an Hardware und so, kann ich das zeigen, so, also Wasserkocher brauch ich und ich brauch"}, {"id": 203, "start": 1762.02, "end": 1768.74, "text": "noch einen neuen elektrischen, äh nicht elektrischen, nur weil das Electronics steht, das ist der"}, {"id": 204, "start": 1768.74, "end": 1777.94, "text": "Hersteller iElectronics, äh einen Rauchmelder fürs Wohnzimmer und zwar einen mit Funk, deswegen"}, {"id": 205, "start": 1777.94, "end": 1787.82, "text": "ist der auch so teuer, das ist mit 10 Jahres Funkmodul und 10 Jahres Akku, deswegen so einen"}, {"id": 206, "start": 1787.82, "end": 1791.82, "text": "teuren und davon hab ich die anderen auch schon, die sind auch alle vernetzt und ich"}, {"id": 207, "start": 1791.82, "end": 1796.7, "text": "hab eine Basisstation, die mir dann sogar Notifikation schickt, wenn es klingelt, exzellent."}, {"id": 208, "start": 1796.7, "end": 1805.18, "text": "Das ist der Fiveheadtime, ich bin nicht der Einziger, der das Problem hat, womit fängst"}, {"id": 209, "start": 1805.18, "end": 1811.18, "text": "du die Signale auf, ich fange die Signale, das kann ich dir zeigen, archive, pass auf,"}, {"id": 210, "start": 1811.18, "end": 1838.26, "text": "archive.wupplos.tv, woz, rauch, feuer, feuer, rauch, melder, ach ich hab den Stream gelöscht,"}, {"id": 211, "start": 1838.26, "end": 1844.86, "text": "der Stream ist nicht mehr da, das war der Stream, wo ich so oft klacken musste zwischendurch,"}, {"id": 212, "start": 1844.86, "end": 1853.14, "text": "den wollte ich nicht oben haben, äh ich empfange das mit iElectronics 403 oder so heißt das"}, {"id": 213, "start": 1853.14, "end": 1872.1, "text": "denn, RF, RF, RF 603 oder so, nee, RF 602, ah man, wie heißt der Kram nochmal, Produkte,"}, {"id": 214, "start": 1872.1, "end": 1891.94, "text": "Rauchwarnmelder, ja genau, Funkstation, das da, IF413, RF ist das Funkmodul, das ist"}, {"id": 215, "start": 1891.94, "end": 1896.42, "text": "die Station mit der ich das empfange, so und das funktioniert folgendermaßen, nur mal ganz"}, {"id": 216, "start": 1896.42, "end": 1902.94, "text": "schnell angemerkt, weil die das auch bauen wollen, also da, das ist nicht das was ich"}, {"id": 217, "start": 1902.94, "end": 1913.02, "text": "brauche, ich brauch die Anleitung, äh genau, wenn du das Ding aufschaltest, hast du da"}, {"id": 218, "start": 1913.02, "end": 1919.74, "text": "ein ziemlich minimalistisch bestücktes Panel drinnen, also so Board, hier schließt du"}, {"id": 219, "start": 1919.74, "end": 1927.62, "text": "Input an, 11-30 Volt zur Stromversorgung, ähm und hier kannst du dann, an die Relays"}, {"id": 220, "start": 1927.62, "end": 1932.74, "text": "kannst du irgendwelche GPIOs anschließen, irgendwelche Kontakte von einem ESP32 zum"}, {"id": 221, "start": 1932.74, "end": 1937.86, "text": "Beispiel, ich hab einen ESP82, ich hab einen D1 Mini in der Box, passt, also da ist massig"}, {"id": 222, "start": 1937.86, "end": 1942.98, "text": "Platz drinne hier, ne, also das Ding ist zum größten Teil leer, ich hab da einen ESP"}, {"id": 223, "start": 1942.98, "end": 1950.78, "text": "2866 reingemacht und hab die GPIOs mit den Relays verbunden, also sprich mit, äh was"}, {"id": 224, "start": 1950.78, "end": 1958.66, "text": "ist das, common, heißt das glaube ich, äh und dann normally open, hab ich das verbunden,"}, {"id": 225, "start": 1958.66, "end": 1963.02, "text": "also das da oben ist Blödsinn, ja, hab ich die GPIOs verbunden, einmal für Fehler und"}, {"id": 226, "start": 1963.02, "end": 1968.98, "text": "einmal für Brandmelder, weil CO2 Relays hab ich, also CO2 hab ich nicht, CO2 Melder und"}, {"id": 227, "start": 1968.98, "end": 1975.14, "text": "dementsprechend bekomm ich jetzt den Input am GPIO, also das Ding, wenn Alarm ist, das"}, {"id": 228, "start": 1975.14, "end": 1980.9, "text": "koppelst du halt auch mit den Funkrauchmeldern und wenn Alarm ist, dann schalt das Relay"}, {"id": 229, "start": 1980.9, "end": 1987.42, "text": "und dann bekommst du ein Signal an GPIO und dann weißt du, wenn es der eine GPIO ist,"}, {"id": 230, "start": 1987.42, "end": 1992.22, "text": "dann ist es ein Fehler, Fehler bedeutet in der Regel einfach die Batterie geht leer"}, {"id": 231, "start": 1992.22, "end": 2000.54, "text": "und Brand bekommst du GPIO Input, wenn das Ding den Alarm auslöst und du kannst theoretisch"}, {"id": 232, "start": 2000.54, "end": 2009.06, "text": "auch noch einen GPIO benutzen, ich hab einen ESP 2866, ich hab so einen dran, das liegt"}, {"id": 233, "start": 2009.06, "end": 2016.3, "text": "aber auch daran, weil ich da von meiner, quasi meine Tüte gekauft hab, 5 Euro Aliexpress,"}, {"id": 234, "start": 2016.3, "end": 2026.86, "text": "TASMOTA geflasht, GPIOs, TASMOTA geflasht, GPIOs da drin konfiguriert, fertig, total"}, {"id": 235, "start": 2026.86, "end": 2031.82, "text": "easy gewesen, kriegst du hin, bin ich mir sicher, das ist nicht schwierig, du kannst"}, {"id": 236, "start": 2031.82, "end": 2037.58, "text": "auch, wenn man das will, ich wollte das nicht, du kannst auch den GPIO Output schalten an"}, {"id": 237, "start": 2037.58, "end": 2045.26, "text": "diesen Switch und dann kannst du quasi von deinem Raspberry Pi die Rauchmelder auslösen,"}, {"id": 238, "start": 2045.26, "end": 2050.5, "text": "manche Leute verwenden das als Alarmanlage, also wenn die erkennen, dass das Fenster geöffnet"}, {"id": 239, "start": 2050.5, "end": 2056.54, "text": "wird, obwohl keiner daheim ist oder sowas, dann machen die damit Alarm, aber das, das"}, {"id": 240, "start": 2056.54, "end": 2061.18, "text": "finde ich blödsinnig, also kann man machen, würde ich aber nicht unbedingt empfehlen,"}, {"id": 241, "start": 2061.18, "end": 2067.86, "text": "ist nicht, finde ich nicht so, finde ich nicht so, ja, also deswegen habe ich den Rauchmelder"}, {"id": 242, "start": 2067.86, "end": 2072.38, "text": "reingemacht, so und jetzt, ich habe euch ja letztens gefragt, chat, was ich mir kaufen"}, {"id": 243, "start": 2072.38, "end": 2080.98, "text": "sollte und zwar, es geht mir immer noch um Fernsehempfang drüben fürs Wohnzimmer und"}, {"id": 244, "start": 2080.98, "end": 2088.26, "text": "ich habe euch gefragt, ob ich mir eine, ob ich mir so eine Box kaufen soll, wie gesagt,"}, {"id": 245, "start": 2088.26, "end": 2093.5, "text": "Fernsehempfang, es geht nur um Empfang und streamen, Fernseh gucken werde ich weiter"}, {"id": 246, "start": 2093.5, "end": 2102.32, "text": "über Kodi auf meinem Shield TV, das bleibt, es geht mir bloß um das Empfangen, das Recorden"}, {"id": 247, "start": 2102.32, "end": 2108.46, "text": "und das Streamen, so und ich habe den Chat gefragt, ob ich mir so ein Ding kaufen soll"}, {"id": 248, "start": 2108.46, "end": 2121.58, "text": "für DVBC oder ob ich mir eine Kabel Fritzbox kaufen soll, Kabel, oder ob ich mir eine Kabel"}, {"id": 249, "start": 2121.58, "end": 2132.3, "text": "Fritzbox kaufen soll, also preislich nimmt sich das gar nicht mal so viel, die Fritzbox"}, {"id": 250, "start": 2132.3, "end": 2138.9, "text": "kann ich noch anderweitig gebrauchen, weil ich habe aktuell das Unity Media Modem für"}, {"id": 251, "start": 2138.9, "end": 2143.58, "text": "die Einwahl, ich nenne das mal Einwahl, auch wenn das bei Kabel nicht so ganz trifft, das"}, {"id": 252, "start": 2143.58, "end": 2148.02, "text": "Unity Media Modem für die Einwahl und dahinter habe ich noch eine Fritzbox, die macht Deck"}, {"id": 253, "start": 2148.02, "end": 2158.5, "text": "und Voip und Sachen, wer guckt Fernseh, ich nicht, meine Mutter guckt Fernseh, deswegen"}, {"id": 254, "start": 2158.5, "end": 2164.82, "text": "muss der Kram auch funktionieren, so dass ich nicht supporten muss, ich will das hinstellen"}, {"id": 255, "start": 2164.82, "end": 2169.42, "text": "und das soll einfach gehen, ich habe keinen Bock, dass es dann abends heißt Max guck mal"}, {"id": 256, "start": 2169.42, "end": 2179.26, "text": "da Fernseh geht nicht oder so, das muss nicht sein, das soll einfach funktionieren, bin"}, {"id": 257, "start": 2179.26, "end": 2189.06, "text": "für die Fritzbox, ich weiß das nicht, die Dinger sollen an sich rein für DVBC empfangen"}, {"id": 258, "start": 2189.06, "end": 2200.7, "text": "sein, echt nicht schlecht sein, also was ich, der Vorteil sag mal so, Vorteil hiervon wäre,"}, {"id": 259, "start": 2200.7, "end": 2204.98, "text": "ganz einfach, ich will nicht darüber gucken, also es ist egal ob es scheiß Upscaling hat"}, {"id": 260, "start": 2204.98, "end": 2212.86, "text": "oder sonst, ich will einfach nur empfangen und aufnehmen, Vorteil hiervon wäre, ich hätte"}, {"id": 261, "start": 2212.86, "end": 2219.02, "text": "einfach nur eine Box mit einem Linux drauf, da kann ich eine Festplatte rein machen oder"}, {"id": 262, "start": 2219.02, "end": 2226.34, "text": "eine SSD, das hat hinten so ein Tray und ich hätte eine Box, die komplett alles macht,"}, {"id": 263, "start": 2226.34, "end": 2233.34, "text": "Fernseh empfangen, Fernseh streamen, Fernseh aufnehmen, Aufnahmen planen, EPG übers Tablet"}, {"id": 264, "start": 2233.34, "end": 2239.34, "text": "und was die nicht alles machen will und gut wäre, wenn ich den Kram über die Fritzbox"}, {"id": 265, "start": 2239.34, "end": 2246.18, "text": "mache, bräuchte ich noch einen Raspberry Pi dabei, der die Aufnahmen macht, also da bräuchte"}, {"id": 266, "start": 2246.18, "end": 2251.06, "text": "ich noch einen Raspberry Pi mit TV Headend, der dann die Tuner übers Netzwerk von der Fritzbox"}, {"id": 267, "start": 2251.06, "end": 2260.46, "text": "verwendet, ich vermute, dass das prinzipiell mit der Box wahrscheinlich ein Ticken besser"}, {"id": 268, "start": 2260.46, "end": 2269.22, "text": "funktioniert, Octagon, ja ich weiß, es gibt zig Sachen, es gibt zig Sachen und mein,"}, {"id": 269, "start": 2269.22, "end": 2278.18, "text": "oder meinst du die Software, so und es gibt einen weiteren Vorteil Chat, wenn ich mir"}, {"id": 270, "start": 2278.18, "end": 2286.34, "text": "diese Box kaufe, dann können wir die zusammen im Stream einrichten, was ich noch nicht so"}, {"id": 271, "start": 2286.34, "end": 2292.86, "text": "ganz gecheckt habe ist, es gibt ja da auch irgendwie 30 verschiedene Firmwares, du hast"}, {"id": 272, "start": 2292.86, "end": 2301.34, "text": "Open VT, nee, du hast Team VTI oder wie das heißt, das ist quasi die proprietäre Software"}, {"id": 273, "start": 2301.34, "end": 2309.74, "text": "vom Hersteller mit ein bisschen Community Addons oder sowas, dann hast du Open AVT oder sowas"}, {"id": 274, "start": 2309.74, "end": 2317.02, "text": "in der Richtung, das ist deutlich moderner vom Linux Unterbau, moderner Kernel, moderner"}, {"id": 275, "start": 2317.02, "end": 2320.94, "text": "Libraries, hat aber ein paar proprietäre Sachen für die Tuner nicht, weiß nicht,"}, {"id": 276, "start": 2320.94, "end": 2328.06, "text": "ob das schlimm ist und dann gibt es auch Open PLV und Black Hole Open und es gibt für dieses"}, {"id": 277, "start": 2328.06, "end": 2332.06, "text": "Ding irgendwie 30 verschiedene Firmwares, ich habe keine Ahnung, was die Vorteile davon"}, {"id": 278, "start": 2332.06, "end": 2343.78, "text": "sind. Ob VTL beste Wahl ist, weiß ich nicht, ich habe beispielsweise gelesen, dass wenn"}, {"id": 279, "start": 2343.78, "end": 2349.58, "text": "man dort versucht, was drauf laufen zu lassen auf dem Linux, also wenn man da sich per SSH"}, {"id": 280, "start": 2349.58, "end": 2354.18, "text": "darauf verbindet und dort versucht, irgendwas auch nur annähernd modernes Linux technisch"}, {"id": 281, "start": 2354.18, "end": 2362.46, "text": "drauf laufen zu lassen, dann kannst du es vergessen, weil VTI uralt ist, also wenn ich"}, {"id": 282, "start": 2362.46, "end": 2368.98, "text": "beispielsweise auf die Idee kommen sollte, irgendwas selbst zu programmieren, was darauf"}, {"id": 283, "start": 2368.98, "end": 2374.26, "text": "laufen soll, ich meine, das ist glaube ich in AVM V7 oder so da drin, das geht ja prinzipiell,"}, {"id": 284, "start": 2374.26, "end": 2377.62, "text": "aber die Libraries sind halt abfuck alt und du kannst nichts drauf laufen lassen und ich"}, {"id": 285, "start": 2377.62, "end": 2384.1, "text": "bezweifle, dass VTI Docker Support hat, ich weiß es nicht, das müsste man ausprobieren,"}, {"id": 286, "start": 2384.1, "end": 2392.26, "text": "deswegen bin ich geneigt, läuft auf dem Ding Go garantiert, ich weiß es nicht, aber ich"}, {"id": 287, "start": 2392.26, "end": 2398.18, "text": "bin mir ziemlich sicher, dass darauf Go läuft. Das ist ein vollwertiges Linux, wenn auch"}, {"id": 288, "start": 2398.18, "end": 2404.94, "text": "mit einer uralt Kernel, zumindest in VTI, mit Open AVT oder wie das heißt, ist das wohl"}, {"id": 289, "start": 2404.94, "end": 2415.66, "text": "besser, nein, Open source, da Lico ist ja nicht open, sondern da ist open source und damit"}, {"id": 290, "start": 2415.66, "end": 2421.42, "text": "kannst du ziemlich sicher Go drauf laufen lassen, ich meine Go läuft rückwärts kompatibel"}, {"id": 291, "start": 2421.42, "end": 2432.46, "text": "bis zur Kernel 2.6.32 oder so und der ist von 2000, keine Ahnung, 5, Open ATV, ja, so,"}, {"id": 292, "start": 2432.46, "end": 2439.9, "text": "chat, dann probieren wir das mal aus, ich brauche aber die mit DVBC, Samstag ist es"}, {"id": 293, "start": 2439.9, "end": 2454.14, "text": "da, exellent, 5 header time, exquisite, macht euch nichts draus, ihr wisst, ich laber manchmal"}, {"id": 294, "start": 2454.14, "end": 2461.34, "text": "sinnloses Zeug vor mich hin, so, also BAM, add, ist das das Richtige, was ich habe, DVBC,"}, {"id": 295, "start": 2461.34, "end": 2474.7, "text": "was ist da ein FBC, FBC, die tun ihren Dienst schon ganz gut, hast du was, was den Dienst"}, {"id": 296, "start": 2474.7, "end": 2480.46, "text": "noch besser tut oder meinst du, das ist halt, ist brauchbar, man braucht eigentlich nichts"}, {"id": 297, "start": 2480.46, "end": 2489.1, "text": "anderes, was ist ein FBC Tuner, was ist das, dieser Tuner Typ ist erstmalig in einer Vo"}, {"id": 298, "start": 2489.1, "end": 2494.42, "text": "S-Tipp, also das sind alles böhmische Dörfer für mich, was die hier schreiben, Full Band"}, {"id": 299, "start": 2494.42, "end": 2501.58, "text": "Capture, dass das komplette Frequenzband einer Ebene empfangen wird, ich muss es nochmal"}, {"id": 300, "start": 2501.58, "end": 2511.22, "text": "kurz betonen, ich hasse analoge oldschool Fernsehtechnik, da kommst du dir vor wie"}, {"id": 301, "start": 2511.22, "end": 2514.82, "text": "im letzten Jahrtausend, wenn ich sowas schon lese, dann habe ich schon wieder gar keinen"}, {"id": 302, "start": 2514.82, "end": 2522.02, "text": "Bock auf den Kram, so, also, wir machen jetzt gar nicht, ja das wird digital übertragen,"}, {"id": 303, "start": 2522.02, "end": 2530.34, "text": "unter der Haube ist das immer noch wie analoges Fernseh, so, gut dann kaufen wir das jetzt,"}, {"id": 304, "start": 2530.34, "end": 2541.26, "text": "also 299 Euro, ist ordentliches Ding oder, ich mein, kannst du nix sagen für ne Box,"}, {"id": 305, "start": 2541.26, "end": 2552.46, "text": "die im Endeffekt einfach noch Fernseh aufnimmt, 40 Sender gleichzeitig rekorden, ja genau,"}, {"id": 306, "start": 2552.46, "end": 2558.66, "text": "das brauch ich, weil so viel geiles Zeug im Fernseh läuft, also, add, bam, ich hoffe"}, {"id": 307, "start": 2558.66, "end": 2561.94, "text": "ich hab jetzt das Richtige, ach so, was ist dann eigentlich der Unterschied zwischen"}, {"id": 308, "start": 2561.94, "end": 2571.62, "text": "einer VU plus Duo und einer VU plus, außer, dass sie 100 Euro mehr kostet, nochmal, Moment,"}, {"id": 309, "start": 2571.62, "end": 2586.1, "text": "VU plus Comparison, die Leute sitzen im C++ Gremium, Duo hat zwei Tuner, aber wozu brauche"}, {"id": 310, "start": 2586.1, "end": 2592.7, "text": "ich zwei Tuner, wenn ich mit einem Tuner schon 40 Sender gleichzeitig empfangen kann, also"}, {"id": 311, "start": 2592.7, "end": 2607.02, "text": "eigentlich komplett umsonst oder, so, Uno, Duo, ah hier, ok, der hat mehr CPU, mehr RAM,"}, {"id": 312, "start": 2607.02, "end": 2623.7, "text": "nicht dass man es wirklich brauchen würde, oder, Zata, beide, Kartenleser brauch ich"}, {"id": 313, "start": 2623.7, "end": 2629.94, "text": "nicht, Common Interface brauch ich auch nicht, CI plus Zertifizienz davon garantiert gar"}, {"id": 314, "start": 2629.94, "end": 2638.78, "text": "nix, Netzwerk, alles das gleiche, Wi-Fi, brauch ich, das Ding hat Wi-Fi, wer braucht"}, {"id": 315, "start": 2638.78, "end": 2654.38, "text": "denn Wi-Fi bei sowas, useless, braucht man nicht, CPU und RAM ist zum Streamen von HDTV,"}, {"id": 316, "start": 2654.38, "end": 2663.9, "text": "also ich kann mir nicht vorstellen, dass das Streamen jetzt top funktioniert mit 3GB RAM"}, {"id": 317, "start": 2663.9, "end": 2671.9, "text": "und mit 2GB RAM gar nicht, und dass du CPUs brauchst, das ist doch eh alles Hardware-Decode,"}, {"id": 318, "start": 2671.9, "end": 2676.42, "text": "obwohl du musst ja nicht mal was decoden, decoden macht ja letztendlich der Klein, das funktioniert"}, {"id": 319, "start": 2676.42, "end": 2679.98, "text": "auf jeden Fall auch so, würd mich ganz stark wundern, wenn das nicht geht."}, {"id": 320, "start": 2679.98, "end": 2695.5, "text": "Also es ist eigentlich kein großer Unterschied, ah, guck mal hier, HD-Dual-Transcoding und"}, {"id": 321, "start": 2695.5, "end": 2703.42, "text": "die Uno hat nur HD-Transcode, ich will nix transcoden, ne, reicht, also ich geb jetzt,"}, {"id": 322, "start": 2703.42, "end": 2707.54, "text": "ich mein 394 Euro, ich bitte euch, also für irgendein Streaming-Box, das muss so wirklich"}, {"id": 323, "start": 2707.54, "end": 2714.1, "text": "nicht sein, also, so, hab ich's jetzt schon geadded, ne, Mist, toll, das hab ich zugemacht,"}, {"id": 324, "start": 2714.1, "end": 2725.22, "text": "nice, GG Eats, ich will nix transcoden, gut, add Basket, und wisst ihr was, ich mach jetzt"}, {"id": 325, "start": 2725.22, "end": 2730.02, "text": "den YOLO-Modus, weil, nicht einfach nur weil ich Geld ausgebe, Moment, ich seh Kundenleute,"}, {"id": 326, "start": 2730.02, "end": 2736.9, "text": "ich muss mal kurz nach meinen Stonks gucken, du schaust die ganze Zeit bei No Longer Available,"}, {"id": 327, "start": 2736.9, "end": 2737.9, "text": "was?"}, {"id": 328, "start": 2737.9, "end": 2738.9, "text": "Hä?"}, {"id": 329, "start": 2738.9, "end": 2739.9, "text": "Wo?"}, {"id": 330, "start": 2739.9, "end": 2753.34, "text": "Egal, ich muss mal kurz nach meinen Stonks gucken, die sind wahrscheinlich heute wieder"}, {"id": 331, "start": 2753.34, "end": 2761.86, "text": "gefallen, könnt ich mir vorstellen, ich hab ohne SE geschaut, ah ne, Moment, Moment,"}, {"id": 332, "start": 2761.86, "end": 2771.3, "text": "Moment, Moment, das muss weg, das muss weg, will schon das aktuelle haben, ne, ist doch"}, {"id": 333, "start": 2771.3, "end": 2788.7, "text": "richtig, ach du meinst in der Vergleichstabelle, hier, ne, SE, HD-Transcoding, das ist gleiche,"}, {"id": 334, "start": 2788.7, "end": 2804.14, "text": "behindert sich nix, so, was machen die Stonks, heute, today, minus, 91 Euro, top, jetzt sagt"}, {"id": 335, "start": 2804.14, "end": 2807.86, "text": "mir der Chat wahrscheinlich gleich wieder, Max, wenn der so weit, dann kauf doch jetzt"}, {"id": 336, "start": 2807.86, "end": 2832.38, "text": "nach, alles klar, alter, ich hab die letzten, ich hab den letzten Monat, halt euch mal fest,"}, {"id": 337, "start": 2832.38, "end": 2843.42, "text": "ich hab den letzten Monat minus 1639 Euro bei meinen Stonks, aber der Chat hat recht,"}, {"id": 338, "start": 2843.42, "end": 2856.74, "text": "richtig minus ist es ja erst, wenn ich's verkaufe, not Stonks aktuell, eindeutig not Stonks."}, {"id": 339, "start": 2856.74, "end": 2877.9, "text": "Okay, weiter, in Wald investieren, ja, vielleicht in irgendwas investieren, was aktuell nicht"}, {"id": 340, "start": 2877.9, "end": 2894.1, "text": "fällt, Amazon ist auch richtig krass am abkacken, die letzter Zeit, Amazon ist jetzt auch von"}, {"id": 341, "start": 2894.1, "end": 2903.62, "text": "3000 Euro auf 2000, das ist halt echt, not Stonks alles aktuell, aber was willst du machen,"}, {"id": 342, "start": 2903.62, "end": 2914.86, "text": "ich denke, das geht wieder aufwärts und dann ist es irgendwann auch ein Plus, top, ich"}, {"id": 343, "start": 2914.86, "end": 2918.78, "text": "hätte eine Frage, die grad zusammenhanglos ist, ich wollte mal fragen, welche Unterschiede"}, {"id": 344, "start": 2918.78, "end": 2924.1, "text": "die Affinity-Foto-Version aus dem Amazon, ich habe keine Ahnung, wahrscheinlich ist"}, {"id": 345, "start": 2924.1, "end": 2931.18, "text": "die Shop-Version kacke und die Download-Version besser, das würde sich mit anderen Erfahrungen"}, {"id": 346, "start": 2931.18, "end": 2940.7, "text": "gemacht haben aus dem Store decken, gut, ja, wo ich gerade dabei war, Leute, ich werde"}, {"id": 347, "start": 2940.7, "end": 2947.54, "text": "jetzt den Big Brain Move machen und mir auch noch eine Fritzbox kaufen, weil, nicht einfach"}, {"id": 348, "start": 2947.54, "end": 2952.26, "text": "nur weil ich Geld ausgeben will oder hier den aus dem Weg Geringverdiener Weirdflex"}, {"id": 349, "start": 2952.26, "end": 2958.22, "text": "starten will im Stream, nein, das liegt daran, es gibt keine Kabel-Fritzbox ohne Tuner, oder?"}, {"id": 350, "start": 2958.22, "end": 2964.54, "text": "Ne, die haben alle Tuner, gehe ich mal von aus und ich will eigentlich das Unity-Media-Modem"}, {"id": 351, "start": 2964.54, "end": 2970.14, "text": "rausschmeißen und ich möchte meine Billig-Fritzbox, die hat nämlich nur 100 MBit Netzwerk, was"}, {"id": 352, "start": 2970.14, "end": 2975.78, "text": "nicht schlimm ist für VoIP und IP, also kein, kein, Voice-Over-IP, eigentlich kein Problem,"}, {"id": 353, "start": 2975.78, "end": 2985.22, "text": "ich wollte eigentlich meine Billig-Fritzbox und die Unity-Media-Box durch ein Gerät ersetzen"}, {"id": 354, "start": 2985.22, "end": 2990.7, "text": "und da wäre eine Kabel-Fritzbox tatsächlich ganz praktisch, dann kannst du auch erstmal"}, {"id": 355, "start": 2990.7, "end": 2996.46, "text": "den Fritzbox-Tuner probieren, ne, ich kaufe beides, easy, die Frage ist nur, Fritzbox"}, {"id": 356, "start": 2996.46, "end": 3008.34, "text": "Comparison, was denn da jetzt sinniger ist zu kaufen, gab es sicher Kabel-Modem, was"}, {"id": 357, "start": 3008.34, "end": 3013.54, "text": "wirklich ein Modem ist, doch, gibt es ein paar, will ich aber nicht, weil dann habe ich ja"}, {"id": 358, "start": 3013.54, "end": 3018.02, "text": "noch ein echt, also dann würde ich das Unity-Media-Gerät durch ein weiteres Gerät tauschen, aber"}, {"id": 359, "start": 3018.02, "end": 3024.02, "text": "da hätte ich ein weiteres Gerät dahinter, ja, und jetzt kommen wieder irgendwelche Leute"}, {"id": 360, "start": 3024.02, "end": 3034.02, "text": "an, die ganzen Low-IQ, ähm, ja, so, Halbwissen-Admins, die kommen dann um die Ecke und sagen,"}, {"id": 361, "start": 3034.02, "end": 3041.98, "text": "aber Max, doppeltes Nut, ganz, ganz schlimm, doppeltes Nut und da kann ich einfach nur"}, {"id": 362, "start": 3041.98, "end": 3054.3, "text": "sagen, diese Leute lecken ganz massiv Critical-Information, aber ganz massiv, das erste ist, unter Triple-Nut,"}, {"id": 363, "start": 3054.3, "end": 3063.38, "text": "das ist so wie Julien-Spam, Dreifach-Faktor-Authentifizierung, ist es eh nicht sicher, und Spaß beiseite,"}, {"id": 364, "start": 3063.38, "end": 3072.14, "text": "also, erstens, Carrier-Create-Nut ist wieder was anderes, mit Carrier-Create-Nut ist es"}, {"id": 365, "start": 3072.14, "end": 3081.18, "text": "dann Triple-Nut, so, aber doppeltes Nut, erstens ist doppeltes Nut nicht wirklich schlimm,"}, {"id": 366, "start": 3081.18, "end": 3087.26, "text": "auch wenn alle so tun, das ist nur unglücklich, wenn du Ports weiterleiten willst, oder in"}, {"id": 367, "start": 3087.26, "end": 3094.3, "text": "seltenen Fällen, wenn du irgendwelche Traversal-Probleme hast, ja, mit, mit, ähm, VoIP-Geschichten,"}, {"id": 368, "start": 3094.3, "end": 3098.3, "text": "die Löcher ins Nut machen wollen und so, aber meistens das klappt, also, in der Regel"}, {"id": 369, "start": 3098.3, "end": 3103.82, "text": "ist doppeltes Nut kein Problem, wenn einfaches Nut auch kein Problem ist, so, das nächste"}, {"id": 370, "start": 3103.82, "end": 3113.54, "text": "ist, nur, weil man eine Fritzbox hat und dahinter noch einen weiteren Router, muss man kein"}, {"id": 371, "start": 3113.54, "end": 3118.86, "text": "doppeltes Nut machen, es ist sogar relativ bescheuert, doppeltes Nut zu machen, ich zeige"}, {"id": 372, "start": 3118.86, "end": 3129.42, "text": "euch nochmal kurz das Bild von meinem Netzwerk, also, ich hab hier ein Mikrotik-Router, Sekunde,"}, {"id": 373, "start": 3129.42, "end": 3137.1, "text": "ich hab hier ein, haben wir denn eh was Grelleres, Pink oder so, ich hab hier ein Mikrotik-Router,"}, {"id": 374, "start": 3137.1, "end": 3146.78, "text": "ja, und dieser Mikrotik-Router ist hinter einer Unity-Media-Connectbox, die Unity-Media-Connectbox"}, {"id": 375, "start": 3146.78, "end": 3153.02, "text": "macht Nut nach außen, was sie ja machen muss, weil, ich hab nur eine Public-IP-Adresse,"}, {"id": 376, "start": 3153.02, "end": 3159.42, "text": "ich hab glücklicherweise einen richtig echten Dual-Stack, aber, das Ding hier macht Nut,"}, {"id": 377, "start": 3159.42, "end": 3168.26, "text": "wie kommen die Leute drauf, dass dieses Gerät hier auch Nut machen muss, es gibt absolut"}, {"id": 378, "start": 3168.26, "end": 3173.26, "text": "keinen Grund dafür, dass dieses Gerät auch Nut machen muss, warum sollte es, das ist"}, {"id": 379, "start": 3173.26, "end": 3181.18, "text": "ein Router, ein Router kann routen, der muss nicht zwangsläufig Nut machen, du musst halt"}, {"id": 380, "start": 3181.18, "end": 3185.78, "text": "gucken, dass seine Routen richtig gesetzt sind, ein Router, genau, aber du musst da"}, {"id": 381, "start": 3185.78, "end": 3195.46, "text": "kein Nut machen, das einzige, was du machen musst ist, wenn du eine Route, also wenn du"}, {"id": 382, "start": 3195.46, "end": 3201.14, "text": "eine Rückroute einrichten musst, dann musst du hier eine statische Route hinterlegen, dass"}, {"id": 383, "start": 3201.14, "end": 3207.42, "text": "das hier dann der Gateway ist, für diese Route, aber das war's, könntest du den Mikrotik"}, {"id": 384, "start": 3207.42, "end": 3223.98, "text": "auch die Einwahl machen lassen, ne, der kann PPoE, aber der kann nicht Kabelgedöns-Gramm,"}, {"id": 385, "start": 3223.98, "end": 3246.58, "text": "das ist ein bisschen laut oder, besser, ja so sieht's aus, also es gibt keinen Grund,"}, {"id": 386, "start": 3246.58, "end": 3253.42, "text": "dass man an der Stelle hier nochmal Nut machen müsste, weil vom Desktop hier, das hier ist"}, {"id": 387, "start": 3253.42, "end": 3259.74, "text": "alles ohne Nut erreichbar, überhaupt gar kein Problem, das einzige, wo man aufpassen"}, {"id": 388, "start": 3259.74, "end": 3268.38, "text": "muss ist, wenn man hier nicht nuttet, dass wenn man beispielsweise von dem Desktop auf"}, {"id": 389, "start": 3268.38, "end": 3275.54, "text": "die Fritzbox zugreifen möchte, dann brauchst du hier eine Route, dass der weiß, wie er"}, {"id": 390, "start": 3275.54, "end": 3282.1, "text": "zurückkommt, also dann reicht das hier nicht, dann muss es hier eine Rückroute geben, der"}, {"id": 391, "start": 3282.1, "end": 3290.18, "text": "eben sagt, das ist der Gateway für dieses Netz, aber ansonsten brauchst du nicht, nur"}, {"id": 392, "start": 3290.18, "end": 3296.06, "text": "weil du zwei Router hintereinander hast, doppeltes Nut, das ist nicht das gleiche, also deswegen,"}, {"id": 393, "start": 3296.06, "end": 3302.14, "text": "die Leute lacken da ganz massiv critical information, was doppeltes Nut und Netzwerk Setups angeht,"}, {"id": 394, "start": 3302.14, "end": 3312.22, "text": "ja gegen Carrier Create Nut kannst du eh nichts machen, da hast du eh keine Chance,"}, {"id": 395, "start": 3312.22, "end": 3329.34, "text": "weil es heißt nicht umsonst Carrier, jaja könnte ich auch machen, mit der neuen Fritzbox"}, {"id": 396, "start": 3329.34, "end": 3335.26, "text": "geht das, hast du dir Bock irgendwann mal eine PS5 oder Xbox Series X zu holen, wenn"}, {"id": 397, "start": 3335.26, "end": 3343.1, "text": "ja, also ne hab ich nicht, weil ich hab mir zu Release die Xbox One und die PS4 gekauft"}, {"id": 398, "start": 3343.1, "end": 3351.62, "text": "und ich hatte beides die komplette Lebensdauer dieser Konsolengeneration quasi nicht benutzt,"}, {"id": 399, "start": 3351.62, "end": 3356.54, "text": "die waren insgesamt keine Ahnung 10 Stunden an oder so in ein paar Jahren, das war komplett"}, {"id": 400, "start": 3356.54, "end": 3361.18, "text": "useless und ich sehe auch aktuell keinen Grund, warum ich mir eine PS5 oder Xbox Series X"}, {"id": 401, "start": 3361.18, "end": 3367.9, "text": "holen soll, was ich mir holen werde ist, sollte es mal möglich sein demnächst eine neue NVIDIA"}, {"id": 402, "start": 3367.9, "end": 3373.98, "text": "Grafikkartengeneration käuflich zu erwerben und eine neue CPU Generation, dann werde ich"}, {"id": 403, "start": 3373.98, "end": 3379.3, "text": "das machen, weil mein Rechner ist jetzt, ja keine Ahnung, viereinhalb Jahre oder so, viel"}, {"id": 404, "start": 3379.3, "end": 3389.7, "text": "zu alt, leider immer noch gut genug und deswegen wird es mal Zeit für neuen Rechner, 1080Ti"}, {"id": 405, "start": 3389.7, "end": 3398.94, "text": "870K beste, 8700K, nicht 870K, weißt du ob man WireGuard oder OpenVPN durch Carrier"}, {"id": 406, "start": 3398.94, "end": 3403.22, "text": "Crate Nut tunneln kann, ja du kannst prinzipiell alles durch alles tunneln, wenn du weißt wie"}, {"id": 407, "start": 3403.22, "end": 3410.38, "text": "es geht, was nicht geht, ist Portweiterleitungen machen, Portweiterleitungen gehen insofern"}, {"id": 408, "start": 3410.38, "end": 3416.86, "text": "nicht, weil beim Carrier Crate Nut ja auf der Seite quasi von Vodafone nochmal ein Nut"}, {"id": 409, "start": 3416.86, "end": 3424.7, "text": "davor ist, da teilst du dir mit mehreren Leuten einen IPv4 Ausgang, so damit du dich quasi"}, {"id": 410, "start": 3424.7, "end": 3429.82, "text": "dass du Port weiterleiten könntest, würde bedeuten Unity Media müsst ihr Zugriff auf"}, {"id": 411, "start": 3429.82, "end": 3437.02, "text": "ihren Router geben, was sie bestimmt machen, chat gehe ich von aus, dass du dort eine Portweiterleitung"}, {"id": 412, "start": 3437.02, "end": 3442.42, "text": "Einsätze einrichten kannst, also das kannst du knicken, also das kannst du knicken, aber"}, {"id": 413, "start": 3442.42, "end": 3449.14, "text": "was du machen kannst ist, du brauchst einen Public Endpunkt im Internet, zum Beispiel"}, {"id": 414, "start": 3449.14, "end": 3452.82, "text": "einen Hetzner Server, normalerweise würde ich jetzt sagen Ausrufezeichen, Hetzner für"}, {"id": 415, "start": 3452.82, "end": 3458.7, "text": "20€, Startkutschein, was auch immer, gibt es dieses Jahr bis jetzt noch nicht, du brauchst"}, {"id": 416, "start": 3458.7, "end": 3465.3, "text": "einen Endpunkt im Internet und da tunnelt du dich drauf oder dahin machst du eine Verbindung"}, {"id": 417, "start": 3465.3, "end": 3472.06, "text": "von innen nach außen und dann sagst du ihm, alles was dort reinkommt, leitest du weiter"}, {"id": 418, "start": 3472.06, "end": 3476.12, "text": "da drüber über diesen Tunnel, das geht, da brauchst du aber einen Endpunkt im Internet,"}, {"id": 419, "start": 3476.12, "end": 3482.94, "text": "es gibt noch viele andere Methoden, es gibt fertige Anbieter, die bieten dir irgendwelche"}, {"id": 420, "start": 3482.94, "end": 3492.54, "text": "IPv4 in IPv6 Tunnel und sowas an, du brauchst keinen SSL Tunnel, das beste, also das einfachste,"}, {"id": 421, "start": 3492.54, "end": 3499.7, "text": "das mit Abstand einfachste, was du machen kannst ist ein SSH Tunnel mit globaler Portweiterleitung,"}, {"id": 422, "start": 3499.7, "end": 3511.66, "text": "SSH-G, das ist nicht das performanteste, weil SSH ist nicht dafür gedacht, keine Ahnung,"}, {"id": 423, "start": 3511.66, "end": 3516.42, "text": "20 MB die Sekunde oder so zu tunneln, das verbraucht ganz schön viel CPU-Last, aber"}, {"id": 424, "start": 3516.42, "end": 3521.66, "text": "man zum Prinzipiel testen, ob es geht, ist ein SSH Tunnel mit Minus-G am besten, also"}, {"id": 425, "start": 3521.66, "end": 3530.06, "text": "sprich, Pfeifett-Time, jetzt lernen wir was, Chat, muss man mal kurz die VM anschmeißen,"}, {"id": 426, "start": 3530.06, "end": 3539.26, "text": "dass wir was lernen können, Lern-Champ, Prüfungsrelevant, Chat, morgen wird es abgefragt,"}, {"id": 427, "start": 3539.26, "end": 3548.94, "text": "SSL Tunnel ist verschlüsselt, SSH ist auch verschlüsselt, das einfachste ist SSH Tunnel,"}, {"id": 428, "start": 3548.94, "end": 3557.9, "text": "wenn man einfach nur ausprobieren will, ob es funktioniert, so, stellt euch mal vor,"}, {"id": 429, "start": 3557.9, "end": 3563.7, "text": "ich mach das jetzt auf Local-Host, aber das ist egal, wo ihr das macht, also stellt euch"}, {"id": 430, "start": 3563.7, "end": 3572.1, "text": "mal vor, ihr habt einen Server mit Public-IP im Internet, dieser Server hat die IP Local-Host,"}, {"id": 431, "start": 3572.1, "end": 3579.94, "text": "ich brauch was Lokales zum testen, das könnte genauso gut 1.5.4.3 oder so Public-IP sein,"}, {"id": 432, "start": 3579.94, "end": 3592.34, "text": "das ist egal, so, also, SSH sollte ich vielleicht mal starten, CMCTL, Start, SSHD, so, das ist"}, {"id": 433, "start": 3592.34, "end": 3610.66, "text": "ein, ach, das ist gar nicht Max, oder ist es Max? Okay, also, ihr habt einen Remote-Server,"}, {"id": 434, "start": 3610.66, "end": 3622.26, "text": "damit ihr euch das besser vorstellen könnt, ich trag das in die Hosts ein, so, also, ähm,"}, {"id": 435, "start": 3622.26, "end": 3628.38, "text": "Local-Host, ich hab noch einen Remote-Server, was weiß ich, Hetzner-Server, also, ihr habt"}, {"id": 436, "start": 3628.38, "end": 3638.66, "text": "einen Server im Internet, SSH, MaxEd, Hetzner-Server, Leak, oh nein, ich wollte einkaufen, das muss"}, {"id": 437, "start": 3638.66, "end": 3642.9, "text": "jetzt aber sein, das ist wichtig, also, ihr habt einen Hetzner-Server im Internet, darüber"}, {"id": 438, "start": 3642.9, "end": 3652.42, "text": "wollt ihr jetzt, sagen wir mal, Port 600 oder 6.000, ihr wollt Port 6.000 weiterleiten an"}, {"id": 439, "start": 3652.42, "end": 3664.26, "text": "einen, oder was ist WireGuard, WireGuard-Port, was ist das für ein Port, man, oh, UDP ist"}, {"id": 440, "start": 3664.26, "end": 3682.66, "text": "schlecht, kann man das auf TCP machen, oh, das ist schlecht, okay, das funktioniert nicht,"}, {"id": 441, "start": 3682.66, "end": 3690.74, "text": "ähm, UDP weiterleiten, klappt nicht gescheit, da geht VPN, ich hab auch immer OpenVPN gemacht,"}, {"id": 442, "start": 3690.74, "end": 3703.46, "text": "dann nehmen wir mal das Beispiel OpenVPN, Beispiel OpenVPN, OpenVPN-Port, was, 443, ich nehm"}, {"id": 443, "start": 3703.46, "end": 3711.98, "text": "jetzt das da, ist egal, also, wir gehen davon aus, Port 1194, also, ihr habt einen Public-Web-Server"}, {"id": 444, "start": 3711.98, "end": 3718.02, "text": "und ihr wollt jetzt, dass euer VPN-Server aus dem Internet erreichbar ist, damit ihr"}, {"id": 445, "start": 3718.02, "end": 3724.62, "text": "eine Verbindung aufbauen könnt zu eurem internen Netzwerk, also, das braucht man, weil man"}, {"id": 446, "start": 3724.62, "end": 3730.42, "text": "beispielsweise nicht über das Carrier Create NAT von Vodafone von außen per Port-Weiterleitung"}, {"id": 447, "start": 3730.42, "end": 3736.62, "text": "an euren VPN-Server kommt, so, und ihr habt jetzt einen Public-Server im Internet, Hetzner-Server,"}, {"id": 448, "start": 3736.62, "end": 3745.5, "text": "und ihr wollt Port 1194 weiterleiten zu eurem VPN-Server, das heißt, ähm, also, ich hab"}, {"id": 449, "start": 3745.5, "end": 3749.54, "text": "lange Zeit ein Open-Port-PN über TCP verwendet, das war kein Problem, ja, ich verstehe, ich"}, {"id": 450, "start": 3749.54, "end": 3754.5, "text": "gette den Point, dass es besser ist über UDP, aber mit SSH-Weiterleitung funktioniert"}, {"id": 451, "start": 3754.5, "end": 3760.18, "text": "es mit UDP nicht gescheit, also, ihr könnt jetzt einfach sagen, SSH, ich möchte diesen"}, {"id": 452, "start": 3760.18, "end": 3768.98, "text": "Port weiterleiten, und zwar, ihr müsst sagen, SSH, Remote, ähm, und dann den, oh, warte,"}, {"id": 453, "start": 3768.98, "end": 3772.5, "text": "warte mal, mal gucken, ob ich das jetzt aus dem Kopf, Sekunde-Chat, mal gucken, ob ich"}, {"id": 454, "start": 3772.5, "end": 3781.86, "text": "das jetzt aus dem Kopf hinbekomme, äh, Remote-Port-Weiterleitung, Local-Port-Weiterleitung,"}, {"id": 455, "start": 3781.86, "end": 3787.94, "text": "Local-Port-Weiterleitung, ihr wollt Local-Port-Weiterleitung, ihr wollt Local-Port-Weiterleitung, 119,"}, {"id": 456, "start": 3787.94, "end": 3793.1, "text": "nee, nein, nein, ihr wollt Remote, Schwachsinn, ihr wollt Remote, Remote-Port, ihr wollt"}, {"id": 457, "start": 3793.1, "end": 3804.94, "text": "Remote-Port 1194-Weiterleitung auf interne IP von euer VPN, euer interner VPN-Server,"}, {"id": 458, "start": 3804.94, "end": 3810.78, "text": "also hier kommt die IP von eurem internen VPN-Server rein, so, und jetzt wollt ihr noch"}, {"id": 459, "start": 3810.78, "end": 3820.46, "text": "sagen, minus G, so, und was das jetzt macht, ist folgendes, das baut eine Verbindung auf"}, {"id": 460, "start": 3820.46, "end": 3830.26, "text": "zu eurem Hetzner-Server, öffnet dort Port 1194 global, also bindet es nicht nur an Localhost,"}, {"id": 461, "start": 3830.26, "end": 3834.3, "text": "sondern bildet es als Interface, sodass es dann quasi auch über die Public-IP vom Hetzner-Server"}, {"id": 462, "start": 3834.3, "end": 3841.94, "text": "erreichbar ist, alles was in Port 1194-TCP reingeht, wird über die VPN-Verbindung geschickt,"}, {"id": 463, "start": 3841.94, "end": 3846.58, "text": "äh, über die SSH-Verbindung, und wenn es aus eurer SSH-Verbindung auf eurer Seite"}, {"id": 464, "start": 3846.58, "end": 3855.34, "text": "rauskommt, dann schickt es euer SSH-Lokal weiter an die IP von eurem VPN-Server auf"}, {"id": 465, "start": 3855.34, "end": 3861.86, "text": "Port 1194, so, und damit habt ihr extern zu eurem VPN-Server getunnet, sofern das OpenVPN"}, {"id": 466, "start": 3861.86, "end": 3867.1, "text": "ist und sofern das über TCP ist, UDP funktioniert nicht gescheit, ich kann euch das auch zeigen,"}, {"id": 467, "start": 3867.1, "end": 3871.74, "text": "netstat, ich hoffe ich hab die passenden Optionen dafür drinnen, ihr seht jetzt, wir haben"}, {"id": 468, "start": 3871.74, "end": 3879.3, "text": "global Port 1194, nee, haben wir nicht, wir haben es nur auf Localhost, warum, dann muss"}, {"id": 469, "start": 3879.3, "end": 3884.18, "text": "man es per SSH-Config, dann muss man es in der SSH-Config, ähm, aktivieren, dass man"}, {"id": 470, "start": 3884.18, "end": 3888.34, "text": "Minus G verwenden kann, das kann sein, dass so standardmäßig nicht aktiviert ist, aber"}, {"id": 471, "start": 3888.34, "end": 3897.82, "text": "Minus G ist das richtige Flag für Minus G, allow remote host to connect to local forwarded"}, {"id": 472, "start": 3897.82, "end": 3901.94, "text": "host, bla, bla, bla, bla, also ihr müsst Minus G machen, dass er sich am kompletten Interface"}, {"id": 473, "start": 3901.94, "end": 3906.7, "text": "bindet, das ist definitiv, das hab ich schon oft gemacht, das ist der richtige Befehl,"}, {"id": 474, "start": 3906.7, "end": 3915.62, "text": "äh ja, ByteStrike, glaubt ihr, das ergibt schon Sinn, was du gesagt hast, ja, aber SSH-Port,"}, {"id": 475, "start": 3915.62, "end": 3919.02, "text": "aber SSH-Tunnel ist das einfachste, was du machen kannst, und das geht nur gescheit"}, {"id": 476, "start": 3919.02, "end": 3923.78, "text": "über TCP, zum testen ist das wunderbar, da kannst du nämlich ausprobieren, ob es überhaupt"}, {"id": 477, "start": 3923.78, "end": 3928.5, "text": "funktioniert, so, und wenn du es dann ein bisschen, ein bisschen advanceder machen willst,"}, {"id": 478, "start": 3928.5, "end": 3932.3, "text": "dass der Tunnel auch neu aufgebaut wird, wenn der mal abkackt, dann machst du noch Auto-SSH"}, {"id": 479, "start": 3932.3, "end": 3938.74, "text": "davor, aber, äh, zum testen ist das wunderbar, wenn du einfach nur testen willst, geht das"}, {"id": 480, "start": 3938.74, "end": 3943.74, "text": "denn prinzipiell von außen zu meinem VPN-Server, ansonsten, danach kannst du dir andere Tunnel-Techniken"}, {"id": 481, "start": 3943.74, "end": 3948.94, "text": "überlegen, aber das ist mit Abstand das einfachste, wenn du einen Public-Server hast, um den zu"}, {"id": 482, "start": 3948.94, "end": 3956.66, "text": "deinem, ähm, zu deinem VPN, internen VPN-Server zu bekommen, einfach zum ausprobieren, und"}, {"id": 483, "start": 3956.66, "end": 3961.5, "text": "das ist prinzipiell was, was ich mir merken würde, weil man kann mit dieser SSH-Geschichte"}, {"id": 484, "start": 3961.5, "end": 3972.34, "text": "unglaublich viel Scheiße anstellen, unglaublich viel Zeug umgehen, ähm, was man, was stört,"}, {"id": 485, "start": 3972.34, "end": 3975.14, "text": "es gibt zigtausend Varianten, was du machen kannst, aber SSH-Tunnel ist in der Regel"}, {"id": 486, "start": 3975.14, "end": 3982.14, "text": "das einfachste."}, {"id": 487, "start": 3982.14, "end": 4008.9, "text": "Ähm, wie kann ein Netz-Encrypt-Zertifikat im lokalen Netzwerk nutzen, zum Beispiel für"}, {"id": 488, "start": 4008.9, "end": 4013.78, "text": "einen internen Webserver, geht das, ja das geht, das ist überhaupt kein Problem, dazu"}, {"id": 489, "start": 4013.78, "end": 4017.5, "text": "brauchst du ein paar Sachen, eigentlich wollte ich einkaufen, aber wir haben ja noch, wir"}, {"id": 490, "start": 4017.5, "end": 4021.86, "text": "haben ja noch 50 Minuten Zeit, also, dazu brauchst du ein paar Sachen, du brauchst eine"}, {"id": 491, "start": 4021.86, "end": 4027.5, "text": "gültige Domain, das ist ganz wichtig, sonst funktioniert das nicht, du brauchst eine"}, {"id": 492, "start": 4027.5, "end": 4034.66, "text": "echte, richtig registrierte Domain, das ist aber nicht schlimm, weil sowas kostet nix,"}, {"id": 493, "start": 4034.66, "end": 4041.26, "text": "ja, suchen wir jetzt zum Beispiel mal nach QtChat und gucken uns mal, was die billigste"}, {"id": 494, "start": 4041.26, "end": 4055.22, "text": "QtChat-Domain ist, QtChat.inc, guck mal, QtChat.yz, 95 Cent das Jahr, QtChat.inc ist lustigerweise"}, {"id": 495, "start": 4055.22, "end": 4068.38, "text": "relativ teuer, QtChat.art ist auch nice, also es gibt sehr viele Domains, die sind sportbillig,"}, {"id": 496, "start": 4068.38, "end": 4073.1, "text": "du brauchst zwingend eine Public Domain dafür, anders geht das nicht, das heißt nicht, dass"}, {"id": 497, "start": 4073.1, "end": 4077.06, "text": "du einen Public Server dahinterstehen brauchst, du brauchst eine Domain, die es gibt, die"}, {"id": 498, "start": 4077.06, "end": 4085.86, "text": "registriert ist und dann brauchst du einen DNS-Server, der dafür zuständig ist, den du per API steuern"}, {"id": 499, "start": 4085.86, "end": 4086.86, "text": "kannst."}, {"id": 500, "start": 4086.86, "end": 4091.46, "text": "Ich empfehle dir Cloudflare, weil Cloudflare kostet nix und Cloudflare kann alles, was"}, {"id": 501, "start": 4091.46, "end": 4096.42, "text": "man braucht und Cloudflare wird von so ziemlich jedem Let's Encrypt Client out of the box"}, {"id": 502, "start": 4096.42, "end": 4097.42, "text": "unterstützt."}, {"id": 503, "start": 4097.42, "end": 4104.06, "text": "So, dann registrierst du dir einen Domain, stellst bei deinem Domain-Registrer ein, dass"}, {"id": 504, "start": 4104.06, "end": 4111.46, "text": "Cloudflare für den DNS zuständig ist und das war's und dann sagst du deinem Let's Encrypt"}, {"id": 505, "start": 4111.46, "end": 4118.18, "text": "Client zum Beispiel Certbot, dass du Let's Encrypt über DNS-Challenge verwenden willst"}, {"id": 506, "start": 4118.18, "end": 4124.62, "text": "und zwar mit Cloudflare, dann musst du noch deinen Cloudflare API Key irgendwo hinterlegen"}, {"id": 507, "start": 4124.62, "end": 4133.9, "text": "und dann geht der Certbot zu Let's Encrypt und sagt, du möchtest QtChat.io dir ein Zertifikat"}, {"id": 508, "start": 4133.9, "end": 4141.26, "text": "ausstellen und dann sagt Let's Encrypt, ja, mach ich, du musst aber beweisen, dass dir"}, {"id": 509, "start": 4141.26, "end": 4147.3, "text": "die Domain gehört, dann geht Certbot über deine Cloudflare API an den Cloudflare DNS,"}, {"id": 510, "start": 4147.3, "end": 4154.14, "text": "hinterlegt dort ein Secret TXT-Rekord im DNS, ein Secret, was Certbot und Let's Encrypt"}, {"id": 511, "start": 4154.14, "end": 4161.94, "text": "ausgemacht hat, hinterlegt dort ein Secret und dadurch, dass dann quasi dem DNS von"}, {"id": 512, "start": 4161.94, "end": 4167.86, "text": "deiner Domain das Secret drin steht, was du mit Let's Encrypt quasi ausgetauscht hast,"}, {"id": 513, "start": 4167.86, "end": 4173.06, "text": "beweist du Let's Encrypt damit, dass du der rechtmäßige Eigentümer der Domain bist und"}, {"id": 514, "start": 4173.06, "end": 4177.58, "text": "du bekommst ein Zertifikat, das reicht, also du brauchst keine öffentlich auflösbare"}, {"id": 515, "start": 4177.58, "end": 4182.22, "text": "Webserver oder sowas dafür, dann kriegst du ein Zertifikat und dann musst du einfach"}, {"id": 516, "start": 4182.22, "end": 4194.26, "text": "nur lokal dafür sorgen, dass dein lokaler DNS eben einen A-Rekord hat für die Domain,"}, {"id": 517, "start": 4194.26, "end": 4198.46, "text": "für die du dir das Zertifikat ausgestellt hast und dort dann auch ein Webserver läuft"}, {"id": 518, "start": 4198.46, "end": 4209.78, "text": "mit diesem Zertifikat, ja, so sieht es aus."}, {"id": 519, "start": 4209.78, "end": 4215.42, "text": "Es gibt zig Varianten das zu machen, ach guck mal, tatsächlich, wir haben das sogar, du"}, {"id": 520, "start": 4215.42, "end": 4221.66, "text": "kannst dir auch einfach das Wort angucken, da machen wir das irgendwann mal, aber mit"}, {"id": 521, "start": 4221.66, "end": 4234.1, "text": "ganz viel komischem Docker Zeug dabei noch, ja, nice, das ist wieder was gelernt heute,"}, {"id": 522, "start": 4234.1, "end": 4239.14, "text": "danke für die ganzen Zaps, ich hab wieder die Hälfte überlesen, tut mir leid, overlay,"}, {"id": 523, "start": 4239.14, "end": 4255.62, "text": "extra für dich jetzt, Achtung, weeps in, Leute, weeps in, was wird eingekauft, endlich mal"}, {"id": 524, "start": 4255.62, "end": 4263.14, "text": "den ganzen Krempel der noch aussteht, äh, was ist das, äh, nicht zwangsläufig, der"}, {"id": 525, "start": 4263.14, "end": 4267.26, "text": "Domain Registral ist dort wo du hingehst und sagst ich möchte, möchte diese Domain kaufen,"}, {"id": 526, "start": 4267.26, "end": 4272.94, "text": "er ist prinzipiell auch erstmal zuständig für den DNS, aber, du kannst sagen, dass"}, {"id": 527, "start": 4272.94, "end": 4282.54, "text": "du, ähm, also, nee, der DNS Registral ist immer zuständig für deine Domain und auch"}, {"id": 528, "start": 4282.54, "end": 4289.44, "text": "der DNS vom Domain Registral, aber du kannst dort einstellen, dass der DNS, der letztendlich"}, {"id": 529, "start": 4289.44, "end": 4297.14, "text": "die Records auflöst für deine Domain, dass das ein anderer DNS ist, also sprich, dann"}, {"id": 530, "start": 4297.14, "end": 4305.06, "text": "sagt dein, ähm, Domain Registral DNS, wenn einer nach dem Namen fragt, hey, ähm, ich"}, {"id": 531, "start": 4305.06, "end": 4315.26, "text": "bin zwar für diese Domain zuständig, aber auflösen kann die ein anderer DNS und dann"}, {"id": 532, "start": 4315.26, "end": 4320.9, "text": "geht der nach Cloudflare und macht deine Namensauflösung, oder besser gesagt, TXT Records für Let's"}, {"id": 533, "start": 4320.9, "end": 4321.9, "text": "Encrypt."}, {"id": 534, "start": 4321.9, "end": 4326.78, "text": "Wozu macht man das, wenn man nicht einfach sein eigenes Zertifikat erstellen kann, das"}, {"id": 535, "start": 4326.78, "end": 4336.02, "text": "ist eine gute Frage, erste mal, rein Security-technisch, so von Verschlüsselung oder Nicht-Verschlüsselung,"}, {"id": 536, "start": 4336.02, "end": 4340.54, "text": "macht es erstmal wenig Unterschied, ob man ein Self-Sign Zertifikat hat oder ein Let's"}, {"id": 537, "start": 4340.54, "end": 4344.38, "text": "Encrypt Zertifikat, also die Verschlüsselung ist dadurch weder besser noch schlechter,"}, {"id": 538, "start": 4344.38, "end": 4352.02, "text": "der einzige und zwar riesengroße, nicht zu unterschätzende Unterschied ist, dass dein"}, {"id": 539, "start": 4352.02, "end": 4358.98, "text": "Browser Let's Encrypt Zertifikaten vertraut und selbst ausgestellten Zertifikaten nicht,"}, {"id": 540, "start": 4358.98, "end": 4363.98, "text": "das heißt, wenn du sowas hier haben willst in deiner Browser-Leiste, dann musst du entweder"}, {"id": 541, "start": 4363.98, "end": 4369.42, "text": "deine CA importieren im Browser und das auf jedem Rechner, der dann selbst sein Zertifikat"}, {"id": 542, "start": 4369.42, "end": 4373.74, "text": "verwenden soll, oder du verwendest Let's Encrypt, dem jeder Browser schon standardmäßig vertraut."}, {"id": 543, "start": 4373.74, "end": 4381.42, "text": "Also, das ist halt deutlich praktischer."}, {"id": 544, "start": 4381.42, "end": 4387.26, "text": "Übrigens, Fun-Fact von der Arbeit, mal was zum Kekken, wir haben es letztens geschafft"}, {"id": 545, "start": 4387.26, "end": 4393.86, "text": "an das Let's Encrypt Zertifikatslimit zu kommen und wisst ihr warum, weil irgendwelche Leute"}, {"id": 546, "start": 4393.86, "end": 4399.5, "text": "Kubernetes Sachen deployed haben und auf einmal haltet euch fest 88, nein ich will euch jetzt"}, {"id": 547, "start": 4399.5, "end": 4402.54, "text": "auch nichts verstecktes mitteilen damit, weil bei dieser Zahl kommen immer irgendwelche"}, {"id": 548, "start": 4402.54, "end": 4407.5, "text": "Leute an, ha ha, tut mir übrigens leid für alle die 88 geboren sind, weil irgendein komisches"}, {"id": 549, "start": 4407.5, "end": 4413.58, "text": "Kubernetes Deployment bei uns dafür gesorgt hat, dass 88 Let's Encrypt Anfragen geschickt"}, {"id": 550, "start": 4413.58, "end": 4419.94, "text": "wurden für neue Zertifikate, die haben nicht etwa gesagt Renew Request oder Refresh, nein"}, {"id": 551, "start": 4419.94, "end": 4424.5, "text": "die wollten neue Zertifikate anfordern, warum auch immer und dann hat Let's Encrypt gesagt"}, {"id": 552, "start": 4424.5, "end": 4432.5, "text": "Nope, für diese Woche gibt es keine neuen Zertifikate mehr und das fuckt die Leute bei"}, {"id": 553, "start": 4432.5, "end": 4439.3, "text": "uns gerade ziemlich ab, weil die auch legitime Anwendungsgründe haben sich Zertifikate auszustellen,"}, {"id": 554, "start": 4439.3, "end": 4443.62, "text": "aber Let's Encrypt, du kannst bei Let's Encrypt ein Formular ausfüllen, dass du deine Limits"}, {"id": 555, "start": 4443.62, "end": 4446.58, "text": "erhöht haben willst oder so, aber die Plösse will sich da keiner geben und das würden die"}, {"id": 556, "start": 4446.58, "end": 4450.9, "text": "wahrscheinlich auch nicht machen und jetzt können wir uns eine Woche lang keine Let's"}, {"id": 557, "start": 4450.9, "end": 4456.02, "text": "Encrypt Zertifikate ausstellen, wie gesagt Renews sind nicht betroffen, deswegen ist"}, {"id": 558, "start": 4456.02, "end": 4457.02, "text": "das ganze halb so wild."}, {"id": 559, "start": 4457.02, "end": 4486.34, "text": "Nö, nicht wirklich, YouTube Werbeeinnahmen ist genauso wie Twitch Werbeeinnahmen, also"}, {"id": 560, "start": 4486.34, "end": 4491.66, "text": "YouTube Werbeeinnahmen sind deutlich besser als Twitch Werbeeinnahmen, aber Lohnen kann"}, {"id": 561, "start": 4491.66, "end": 4496.98, "text": "man dazu nicht sagen, also wenn du normal guckst ist das auch vollkommen ausreichend,"}, {"id": 562, "start": 4496.98, "end": 4500.86, "text": "ich hab auch gegen niemanden was der Erdblocker anschaltet oder so, die Werbeeinnahmen sind"}, {"id": 563, "start": 4500.86, "end": 4507.82, "text": "ganz ok, aber wenn ich, wenn ich, ich verdiene damit ja schon passiv bisschen Kohle nebenbei,"}, {"id": 564, "start": 4507.82, "end": 4514.82, "text": "also mit YouTube und auch mit den Twitch Subscriptions und sowas, aber wenn ich Stonks machen will,"}, {"id": 565, "start": 4514.82, "end": 4518.62, "text": "dann mach ich irgendwelche Promotion Geschichten, das gibt deutlich mehr, hab ich aber aktuell"}, {"id": 566, "start": 4518.62, "end": 4526.54, "text": "nix und ich bin eigentlich ganz glücklich so wie das ist, ich brauch nicht zwangsläufig"}, {"id": 567, "start": 4526.54, "end": 4530.5, "text": "jetzt mehr Geld einfach nur um Geld zu machen, also meine Stonks könnten bisschen besser"}, {"id": 568, "start": 4530.5, "end": 4531.5, "text": "laufen."}, {"id": 569, "start": 4531.5, "end": 4540.62, "text": "Doch, machen wir wahrscheinlich auch jetzt, wahrscheinlich kaufen sie sich jetzt auch"}, {"id": 570, "start": 4540.62, "end": 4544.38, "text": "ein Zertifikat, aber das klappt an manchen Stellen nicht gescheit, weil sie eben darauf"}, {"id": 571, "start": 4544.38, "end": 4550.5, "text": "setzen das Auto-Renew mit Let's Encrypt funktioniert und das mit Auto-Renew und Zertifizierung"}, {"id": 572, "start": 4550.5, "end": 4554.66, "text": "stellen, dann musst du das wieder umstellen, vielleicht warten sie auch ne Woche, so ok"}, {"id": 573, "start": 4554.66, "end": 4559.18, "text": "weiter geht's, also wir haben meinen Receiver und ich wollt mir, ich wollt die Fritzbox"}, {"id": 574, "start": 4559.18, "end": 4585.26, "text": "kommen, boah, boah, Leute Sekunde, oh, meine Augen, warum geht das nicht, alter, geht es"}, {"id": 575, "start": 4585.26, "end": 4596.7, "text": "hier, oh, yes, ok, ich weiß nicht warum es mein Dark Reader da nicht kann, aber, so also"}, {"id": 576, "start": 4596.7, "end": 4602.94, "text": "was ist der Unterschied, also wir wollen Cable haben, Cable Fritzbox gibt's nur drei oder"}, {"id": 577, "start": 4602.94, "end": 4617.02, "text": "kommt da noch was, ne, Jibay, der sieht nur so aus, Leute, ich glaube hier hat's einer"}, {"id": 578, "start": 4617.02, "end": 4622.54, "text": "bei AVM das nicht so drauf mit First und Last CSS Elementen, man könnte das viel schicker"}, {"id": 579, "start": 4622.54, "end": 4628.78, "text": "machen mit diesen Strichen hier neben, dass es nicht so aussieht als käme da noch was,"}, {"id": 580, "start": 4628.78, "end": 4635.9, "text": "sag ich ja als absoluter Five Head CSS Frontend Full Stack bis Sek DevOps Engineer, ich muss"}, {"id": 581, "start": 4635.9, "end": 4647.02, "text": "das wissen, so was ist denn jetzt der Unterschied zwischen diesen ganzen Dingern, Wi-Fi 6, 5"}, {"id": 582, "start": 4647.02, "end": 4652.9, "text": "plus 4, ja 5 plus 4 ist doch eindeutig besser als 6 oder, weiß gar nicht warum das die"}, {"id": 583, "start": 4652.9, "end": 4662.5, "text": "günstigere ist, muss man nicht verstehen, Papa, nicht dass jetzt jemand um die Ecke"}, {"id": 584, "start": 4662.5, "end": 4669.18, "text": "kommt und sagt, Bugs, 6 ist doch viel besser, außerdem sind wir Informatikos, die haben"}, {"id": 585, "start": 4669.18, "end": 4674.54, "text": "kein 6, ok, Wi-Fi 6 vielleicht, so, also da haben sie Multiuse, ich brauche ich nicht"}, {"id": 586, "start": 4674.54, "end": 4682.94, "text": "weil kein Wi-Fi, Dual Band Wi-Fi, brauche ich Honored, das interessiert mich alles überhaupt"}, {"id": 587, "start": 4682.94, "end": 4688.38, "text": "nicht, ich weiß, ich weiß, die Witze sind heute äußerst Payne's Champ, ich geb's zu,"}, {"id": 588, "start": 4688.38, "end": 4696.5, "text": "ich geb's zu, Leute, ich muss euch mal was wirklich cool fand erzählen, und zwar ihr"}, {"id": 589, "start": 4696.5, "end": 4703.02, "text": "wisst ja, ich hab jetzt mittlerweile um die 9 Kilo abgenommen und ich war am Dienstag"}, {"id": 590, "start": 4703.02, "end": 4706.78, "text": "auf der Arbeit und da hab ich einen Kollege gesehen, den hab ich schon eine Weile nicht"}, {"id": 591, "start": 4706.78, "end": 4716.54, "text": "mehr gesehen und das erste was der gesagt hat ist, Max, du hast abgenommen, das fand"}, {"id": 592, "start": 4716.54, "end": 4741.9, "text": "ich nicht schlecht, da sieht man, dass man's auch wirklich sieht, oh nee, das ist richtig"}, {"id": 593, "start": 4741.9, "end": 4748.54, "text": "nice, ja, das motiviert natürlich, das hat mich so sehr motiviert, Leute, dass ich das"}, {"id": 594, "start": 4748.54, "end": 4759.46, "text": "letzte Mal war, ich war noch, keine Ahnung, Dienstag war das, direkt nachdem ich, abends"}, {"id": 595, "start": 4759.46, "end": 4763.46, "text": "nachdem ich, abends nachdem ich von der Arbeit gekommen bin, das hat mich so sehr motiviert,"}, {"id": 596, "start": 4763.46, "end": 4769.62, "text": "dass ich beim eineinhalb Stunden, zwei Stunden täglich durch die Wiese bergdings wandern"}, {"id": 597, "start": 4769.62, "end": 4774.74, "text": "mit einem Fahrradgrill, ich nenn's mal, geflirtet habe, stell euch das mal vor, Alter, da muss"}, {"id": 598, "start": 4774.74, "end": 4778.62, "text": "ich schon hart motiviert sein, dass ich mich auf irgendwelche zwischenmenschliche Gespräche"}, {"id": 599, "start": 4778.62, "end": 4784.54, "text": "einlasse und das auch noch freiwillig, Sachen gibt's, hätt ich mir vor ein paar Jahren"}, {"id": 600, "start": 4784.54, "end": 4790.58, "text": "auch noch nicht vorstellen können, dass ich freiwillig mit Leuten kommuniziere, ja, mit"}, {"id": 601, "start": 4790.58, "end": 4806.74, "text": "einem Fahrradgrill, genau, einem hocken Fahrradgrill mit Sonnenbrille auf, sehr motiviert, dass"}, {"id": 602, "start": 4806.74, "end": 4810.18, "text": "man erstmal ein fettes Eis essen geht, ja, ich geh tatsächlich ab und zu Eis essen, manchmal"}, {"id": 603, "start": 4810.18, "end": 4831.82, "text": "muss das sein, so, weiter, ich wollt mir die Fritz-Boxens angucken, so, WiFi zu euch interessiert"}, {"id": 604, "start": 4831.82, "end": 4841.38, "text": "mir, also, wenn ich das jetzt richtig verstehe, macht es überhaupt keinen Sinn für mich,"}, {"id": 605, "start": 4841.38, "end": 4852.22, "text": "die teure Fritz-Box zu kaufen, ich kann einfach die günstigere Fritz-Box kaufen, 6660, warum"}, {"id": 606, "start": 4852.22, "end": 4860.82, "text": "gibt es überhaupt noch, was ist denn das für eine Benamung, 6690, 6591, MonkaS, Alter,"}, {"id": 607, "start": 4860.82, "end": 4876.46, "text": "diese Benamung wieder, man, haben die alle Quad-Tuner, sieht man das da, Tuner, da steht"}, {"id": 608, "start": 4876.46, "end": 4883.86, "text": "überhaupt nichts von Tuner, aber die haben alle Quad-Tuner, oder, XQC hat sich umbenannt,"}, {"id": 609, "start": 4883.86, "end": 4888.74, "text": "ja, der hieß ja XQC-OV, das würd mich nicht wundern, wenn der mal das OV bald aus dem"}, {"id": 610, "start": 4888.74, "end": 4909.38, "text": "Namen streicht, wie heißt er denn jetzt, wahrscheinlich einfach nur XQC, oder, ja, ja, das wundert"}, {"id": 611, "start": 4909.38, "end": 4918.38, "text": "mich nicht, gute Sicht über die verbauten CPUs und RAM, ok, zeig ich her, fritzboxinfo.com,"}, {"id": 612, "start": 4918.38, "end": 4925.46, "text": "was es nicht alles gibt, boah, Alter, was ist das für eine Seite, man, Keg-Wade, was"}, {"id": 613, "start": 4925.46, "end": 4947.58, "text": "ist das, seriously, Webdesign aus den 2000ern, Alter, so, 6600 Cable, Tuner, Tuner, stehen"}, {"id": 614, "start": 4947.58, "end": 4964.38, "text": "da die Tuner drin, Anzahl, Tuner, hier, ne, das ist Fragezeichen, wie viele Tuner hat"}, {"id": 615, "start": 4964.38, "end": 4978.02, "text": "die denn, das muss doch da drinne stehen irgendwo, Moment, Moment, Moment, Details, Details, Specs,"}, {"id": 616, "start": 4978.02, "end": 4982.74, "text": "Tuner, Tuner, Pull-Band-Capture-Tuner, das ist doch, das ist doch genau so ein Ding, ok,"}, {"id": 617, "start": 4982.74, "end": 4998.82, "text": "also kann ich auch ohne Probleme die billigere fritzbox kaufen, Specifications, Tuner, weil,"}, {"id": 618, "start": 4998.82, "end": 5002.26, "text": "warum nicht, ja, warum, ich mein, ich muss ja nicht zwangsläufig mehr Geld ausgeben"}, {"id": 619, "start": 5002.26, "end": 5030.78, "text": "als irgendwie notwendig, Amazon, was ist los, oh, Snap, ok, alles klar, ok, ok, ok, ok,"}, {"id": 620, "start": 5030.78, "end": 5043.5, "text": "alles klar, Moment, das nimmt sich doch jetzt preislich gar nicht so, ach, die sind out"}, {"id": 621, "start": 5043.5, "end": 5063.38, "text": "of stock, die ist gar nicht lieferbar, oder, ne, die ist nicht lieferbar, ne, die haben"}, {"id": 622, "start": 5063.38, "end": 5073.9, "text": "beide vier Netzwerk-Ports, oder, die eine hat bloß ein 2,5G-Cable, die haben alle, ach,"}, {"id": 623, "start": 5073.9, "end": 5080.18, "text": "ne, tatsächlich, ach, ja, tatsächlich, die hat ein Port, ja, was ist das denn, warum hat"}, {"id": 624, "start": 5080.18, "end": 5101.46, "text": "die denn weniger, das muss man alles nicht verstehen, ne, naja, gut, ich, wisst ihr,"}, {"id": 625, "start": 5101.46, "end": 5108.98, "text": "was ich nicht verstehe, warum hat Amazon nicht einfach was, wo man draufklicken kann, sagen,"}, {"id": 626, "start": 5108.98, "end": 5126.62, "text": "so Sachen, die lieferbar sind, was soll das denn, ja, ok, komm, scheiß drauf, dann kaufe"}, {"id": 627, "start": 5126.62, "end": 5136.78, "text": "ich halt die, jetzt ist Euro da, hoher Staffel ist lieferbar, heftiger Scan bei AVM in den"}, {"id": 628, "start": 5136.78, "end": 5149.3, "text": "Fritzboxen, warum ist das Scam, was gegen deine eigene Fritzbox spricht, ja, ich hab wenig"}, {"id": 629, "start": 5149.3, "end": 5157.3, "text": "Probleme in den letzten Jahren, aber das ist mir klar, dass die das sagen, das ist Standard-Bullshit"}, {"id": 630, "start": 5157.3, "end": 5164.3, "text": "von Providern, das bin ich schon gewohnt, das ist normal, so, gut, jetzt haben wir das,"}, {"id": 631, "start": 5164.3, "end": 5170.74, "text": "jetzt muss ich mal in meine Einkaufsliste kurz schauen, Geizhals, können wir tatsächlich"}, {"id": 632, "start": 5170.74, "end": 5185.98, "text": "machen, das ist eine gute Idee, lieferbar, ok, das lohnt sich tatsächlich, e-Systems"}, {"id": 633, "start": 5185.98, "end": 5195.34, "text": "Your Online Shop, oh, die haben aber richtig gute Bewertungen, Vorsicht, unseriöser Händler,"}, {"id": 634, "start": 5195.34, "end": 5199.02, "text": "grauenhafter Kunde, gut, da werde ich wahrscheinlich nicht bestellen bei e-Systems Your Online"}, {"id": 635, "start": 5199.02, "end": 5212.9, "text": "Store, ok, das ist natürlich preislich schon mal ein großer Unterschied, ok, das ist natürlich"}, {"id": 636, "start": 5212.9, "end": 5229.42, "text": "eine gute Idee, ok, das lohnt sich tatsächlich, ok, das lohnt sich tatsächlich, ok, das ist"}, {"id": 637, "start": 5229.42, "end": 5243.94, "text": "eine gute Idee, ok, das lohnt sich tatsächlich, ok, das lohnt sich tatsächlich, ok, das lohnt"}, {"id": 638, "start": 5243.94, "end": 5245.94, "text": "Und das hat richtig gesagt"}, {"id": 639, "start": 5247.36, "end": 5249.36, "text": "Massive gesagt hat das"}, {"id": 640, "start": 5251.7, "end": 5253.7, "text": "Only one left in stock"}, {"id": 641, "start": 5256.54, "end": 5261.26, "text": "Aja, ist das refurbished? Ach das ist used"}, {"id": 642, "start": 5264.46, "end": 5271.74, "text": "Ach leck mir keinen bock, ich guck jetzt auf zu gucken. Wir schauen jetzt was anderes nach. Ah Amazon war wieder am abkacken alles klar nice"}, {"id": 643, "start": 5271.74, "end": 5273.74, "text": "Okay"}, {"id": 644, "start": 5274.1, "end": 5276.38, "text": "Next also was brauche ich denn sonst noch"}, {"id": 645, "start": 5278.22, "end": 5283.54, "text": "Bei der usv bin ich immer wir können bei alt habe ich wirklich lange nicht mehr nix mehr gekauft ja"}, {"id": 646, "start": 5283.82, "end": 5287.26, "text": "Und mit denen habe ich immer noch gute erfahrungen gemacht was alternate angeht"}, {"id": 647, "start": 5287.26, "end": 5298.66, "text": "Und früher dachte ich die heißen alternate"}, {"id": 648, "start": 5303.1, "end": 5304.82, "text": "Ich habe"}, {"id": 649, "start": 5304.82, "end": 5306.82, "text": "also als ich noch klein war"}, {"id": 650, "start": 5307.06, "end": 5311.74, "text": "Aber ich mittags bei der obach immer mittags bei der oma mittagessen und die hat die ganzen"}, {"id": 651, "start": 5311.74, "end": 5317.1, "text": "Zeitungen für mich gesammelt weil da immer werbeheftchen drinne waren"}, {"id": 652, "start": 5317.7, "end": 5324.98, "text": "Werbeheftchen von von alternate und und zeug und alles ich habe damals halt gerne diese die ganzen pc angebote und so mir angeguckt"}, {"id": 653, "start": 5327.7, "end": 5329.26, "text": "Und"}, {"id": 654, "start": 5329.26, "end": 5331.26, "text": "Da kam da habe ich mir zwei sachen"}, {"id": 655, "start": 5332.1, "end": 5337.74, "text": "gemerkt und zwar einmal dass es alternate heißt weil das meine oma auch gesagt hat und"}, {"id": 656, "start": 5337.74, "end": 5341.3, "text": "dass es nicht heißt sondern als er"}, {"id": 657, "start": 5343.46, "end": 5346.5, "text": "Meine oma hat immer gesagt als er zu als er"}, {"id": 658, "start": 5350.7, "end": 5352.7, "text": "So auf lagen aber hier kostet die die gar"}, {"id": 659, "start": 5352.7, "end": 5366.54, "text": "Ja mittlerweile gibt es als das ist ein komischer router das ist ein komischer gaming router wo ich nicht verstehe warum man sich den kram kauft"}, {"id": 660, "start": 5366.54, "end": 5376.22, "text": "Aber hat schon die pilling hat wo ich keine ahnung habe warum man sich sowas kauft"}, {"id": 661, "start": 5383.94, "end": 5387.42, "text": "Das kann ich dir empfehlen ich will kein kabel modem was soll ich mit dem kabel modem"}, {"id": 662, "start": 5388.42, "end": 5393.14, "text": "Ich will ja zwei kisten durch eine ersetzen wenn ich mir einen kabel modem kauf und dann habe ich wieder"}, {"id": 663, "start": 5393.14, "end": 5400.46, "text": "Ein wieder zwei kisten da kann ich auch das unity media den mir behalten mir mir stehen lassen egal so nächstes also nächste sache"}, {"id": 664, "start": 5400.78, "end": 5403.42, "text": "Zwar müssen wir ein bisschen vorwärts kommen ok"}, {"id": 665, "start": 5404.18, "end": 5408.42, "text": "Lass mal kurz überlegen ich brauche ein ja da bin ich mir nicht sicher also"}, {"id": 666, "start": 5409.02, "end": 5415.42, "text": "Vielleicht wisst ihr nach was ich da suchen muss ich ich finde ich ich finde ich finde ich find nix und zwar was ich aktuell habe"}, {"id": 667, "start": 5415.42, "end": 5417.42, "text": "Ich habe im flur unten"}, {"id": 668, "start": 5417.42, "end": 5425.02, "text": "Ich zeige euch das mal kurz ich habe nicht uk europe"}, {"id": 669, "start": 5427.02, "end": 5433.7, "text": "Also ich habe eine livex wlan lampe unten im"}, {"id": 670, "start": 5435.02, "end": 5444.3, "text": "Im flur die macht nicht nur rgb beleuchtung sondern die macht auch infrarot beleuchtung das ist die einzige wlan led von denen die das kann"}, {"id": 671, "start": 5444.3, "end": 5449.58, "text": "Nightwish also ich die by the way der preis ist lächerlich bei denen ist es normalerweise deutlich günstiger"}, {"id": 672, "start": 5457.42, "end": 5462.46, "text": "Alter was ist mit euch los also das kostet normalerweise 50 euro oder so ist trotzdem trotzdem zu teuer"}, {"id": 673, "start": 5463.98, "end": 5465.98, "text": "So was so was hier"}, {"id": 674, "start": 5466.22, "end": 5470.62, "text": "Also so die ist kaputt und die will ich auch nicht erneuern"}, {"id": 675, "start": 5470.62, "end": 5475.62, "text": "Erstens weil ich die zu teuer finden und zweitens weil ich über die lebensdauer enttäuscht bin die hat es ungefähr nur"}, {"id": 676, "start": 5476.46, "end": 5479.02, "text": "anderthalb jahre zwei jahre gemacht und"}, {"id": 677, "start": 5479.74, "end": 5487.58, "text": "gerade rgb led lampen sollten deutlich deutlich länger halten der kram ist ja auch nicht irgendwie den ganzen tach an oder so"}, {"id": 678, "start": 5488.3, "end": 5493.5, "text": "Also so was ich mir überlegt habe was ich mir kaufen könnte irgendeine infrarot beleuchtung"}, {"id": 679, "start": 5494.78, "end": 5496.78, "text": "aber"}, {"id": 680, "start": 5496.78, "end": 5502.06, "text": "Da finde ich dinge die für mich keinen sinn ergeben"}, {"id": 681, "start": 5504.06, "end": 5510.78, "text": "Ich habe keine ahnung wie nach was ich suchen muss dass ich mir eine keine ahnung zwölf so was in der richtung will ich aber"}, {"id": 682, "start": 5510.78, "end": 5513.26, "text": "halt vielleicht nicht billiger chinesen krab"}, {"id": 683, "start": 5514.86, "end": 5520.86, "text": "Aber so was in der richtung will ich haben nach was muss ich da suchen ich habe keine ahnung wenn ich nach"}, {"id": 684, "start": 5520.86, "end": 5526.94, "text": "eher beleuchtung eher lampe oder so suche da finde ich alles möglich also ich finde vielleicht"}, {"id": 685, "start": 5527.66, "end": 5534.62, "text": "heizungsdinger oder so aber ich finde nix was ich quasi an ein netzteil anschließe und mir dann den flur nachts"}, {"id": 686, "start": 5535.1, "end": 5537.1, "text": "ausleuchtet für nacht sicht"}, {"id": 687, "start": 5538.14, "end": 5541.26, "text": "Und am besten hätte ich das ganze noch in einer wellenlänge"}, {"id": 688, "start": 5542.22, "end": 5543.42, "text": "die"}, {"id": 689, "start": 5543.42, "end": 5544.7, "text": "nicht"}, {"id": 690, "start": 5544.7, "end": 5546.7, "text": "sichtbar ist"}, {"id": 691, "start": 5546.7, "end": 5551.5, "text": "Ich werde jetzt sagen infrarot ist nie ist nie sichtbar das kann man so nicht sagen je nach wellenlänge"}, {"id": 692, "start": 5551.66, "end": 5554.38, "text": "Erkennst du zumindest die leds dass die an sind"}, {"id": 693, "start": 5555.5, "end": 5557.5, "text": "so was da"}, {"id": 694, "start": 5561.1, "end": 5566.46, "text": "Ja also vielleicht vielleicht nicht zu so einem krassen preis oder"}, {"id": 695, "start": 5569.02, "end": 5573.26, "text": "Das ist zu teuer 250 euro ich will den flur ein bisschen erleuchten"}, {"id": 696, "start": 5573.26, "end": 5576.78, "text": "Wisst ihr was ich mir schon überlegt habe die led strahler ok"}, {"id": 697, "start": 5577.58, "end": 5582.22, "text": "Wisst ihr was ich mir schon überlegt habe ob ich nicht einfach meine packung china chinesen leds nehme"}, {"id": 698, "start": 5583.02, "end": 5585.02, "text": "und die auf einen"}, {"id": 699, "start": 5586.22, "end": 5591.26, "text": "breadboard stecke und das auf den schrank lege mit irgendwie acht leds drauf oder so"}, {"id": 700, "start": 5591.26, "end": 5594.78, "text": "Und das auf den schrank lege mit irgendwie acht leds drauf oder so"}, {"id": 701, "start": 5606.46, "end": 5609.36, "text": "Danach habe ich auch schon gesucht da findet man nix gescheites"}, {"id": 702, "start": 5611.82, "end": 5613.82, "text": "Was otto"}, {"id": 703, "start": 5613.9, "end": 5615.82, "text": "Ach nee"}, {"id": 704, "start": 5615.82, "end": 5617.82, "text": "london das ist"}, {"id": 705, "start": 5617.82, "end": 5621.14, "text": "Das tonter das ist auch irgendein china chinesen ding"}, {"id": 706, "start": 5624.42, "end": 5626.42, "text": "Ja was ist es denn jetzt"}, {"id": 707, "start": 5626.42, "end": 5628.42, "text": "Ja moment moment moment"}, {"id": 708, "start": 5629.14, "end": 5635.14, "text": "Was ist es denn jetzt ist es ein infrarot licht für nacht sicht oder ist es ein infrared heater"}, {"id": 709, "start": 5637.34, "end": 5643.9, "text": "Ich meine mir ist klar dass alles in gewisser weise wärme verursacht in der richtung aber das primäre ziel soll sein"}, {"id": 710, "start": 5643.9, "end": 5650.02, "text": "dass licht für nacht sicht in den flur kommt und nicht das heizen von irgendwas"}, {"id": 711, "start": 5658.18, "end": 5662.62, "text": "Also das ist preislich was das würde ich mir gefallen lassen"}, {"id": 712, "start": 5662.62, "end": 5667.3, "text": "Ja wenn die das finde ich halt auch blöd wenn die leds rot leuchten das heißt das bräuchte man auf irgendeiner wellenlänge"}, {"id": 713, "start": 5667.98, "end": 5669.98, "text": "die nicht"}, {"id": 714, "start": 5670.38, "end": 5672.98, "text": "Topics den du gesendet hast der kostet 250 euro"}, {"id": 715, "start": 5677.26, "end": 5679.26, "text": "Ach nee das noch ein anderer"}, {"id": 716, "start": 5681.02, "end": 5683.02, "text": "90 euro"}, {"id": 717, "start": 5684.22, "end": 5686.22, "text": "Ach nee das ist noch ein anderer"}, {"id": 718, "start": 5686.22, "end": 5693.02, "text": "Ja 90 euro ich meine das ist mir eigentlich ein bisschen viel für ein paar infrarot leds"}, {"id": 719, "start": 5694.62, "end": 5700.1, "text": "Die frage ist welche wellenlänge sind die sieht man die nachts rot leuchten oder nicht"}, {"id": 720, "start": 5702.02, "end": 5704.26, "text": "Und wo sind da überhaupt die leds dahinter"}, {"id": 721, "start": 5704.26, "end": 5706.26, "text": "Und wo sind da überhaupt die leds dahinter"}, {"id": 722, "start": 5714.58, "end": 5717.06, "text": "Es kommt doch bestimmt direkt aus china oder"}, {"id": 723, "start": 5718.74, "end": 5720.74, "text": "drop shipping"}, {"id": 724, "start": 5721.22, "end": 5723.22, "text": "China von China chinesen"}, {"id": 725, "start": 5730.9, "end": 5732.66, "text": "Das speichert die leuchten"}, {"id": 726, "start": 5732.66, "end": 5736.34, "text": "Das speichere ich mir mal vielleicht vielleicht hole ich das teil"}, {"id": 727, "start": 5741.66, "end": 5745.18, "text": "Aber ich bin der sp echt bisschen planloser was ich suchen soll weiß nicht"}, {"id": 728, "start": 5745.18, "end": 5751.34, "text": "So das nächste was ich brauche ist hat jetzt gar nichts mit technik zu tun ich brauche eine säge und zwar am liebsten so eine zum klappen"}, {"id": 729, "start": 5757.58, "end": 5763.3, "text": "So das nächste was ich brauche ist hat jetzt gar nichts mit technik zu tun ich brauche eine säge"}, {"id": 730, "start": 5763.54, "end": 5765.54, "text": "Und zwar am liebsten so eine zum klappen"}, {"id": 731, "start": 5765.54, "end": 5782.96, "text": "Klappen, vielleicht nicht so was China-Chinesen billiges, sondern ich brauch ne Segel, irgendwas"}, {"id": 732, "start": 5782.96, "end": 5788.3, "text": "kleines zum klappen, sowas da in der Richtung, nur von irgendeinem Hersteller, der mir was"}, {"id": 733, "start": 5788.3, "end": 5800.78, "text": "sagt, denn sowas da zum Beispiel ja, was ich sägen will, Äste zum Beispiel, also ich"}, {"id": 734, "start": 5800.78, "end": 5813.06, "text": "brauch, ich brauch, ich brauch ne Segel, sowas da, 28 Euro, Fein-Feed, Coarse-Feed, nicht"}, {"id": 735, "start": 5813.06, "end": 5826.86, "text": "Feed, Teeth, warum sag ich Feed, Akku-Kettensäge, ich brauch keine Akku-Kettensäge, ich brauch"}, {"id": 736, "start": 5826.86, "end": 5832.5, "text": "das für abgeschnittenes Zeug, was ich mal durchteilen muss, das was vielleicht minimal"}, {"id": 737, "start": 5832.5, "end": 5839.54, "text": "zu dick für die Astschere ist, auch keine Akku-Kettensäge, außerdem hab ich ne Akku-Kettensäge,"}, {"id": 738, "start": 5839.54, "end": 5846.54, "text": "ich brauch ne ganz normale kleine Klapp-Säge, keine Akku-Kettensäge, 28 Euro, perfekt,"}, {"id": 739, "start": 5846.54, "end": 5862.42, "text": "will ich haben, Marken-Baumarkt 24, gib ihm, exzellent, Säge am Start, Leute wisst ihr"}, {"id": 740, "start": 5862.42, "end": 5872.02, "text": "was ich letztens genannt hab, es gibt eine Amazon Basic USB, keine Sorge, ich will die"}, {"id": 741, "start": 5872.02, "end": 5879.5, "text": "mir nicht kaufen, meint ihr das taugt was, ich hab nicht vor mir das zu kaufen, meint"}, {"id": 742, "start": 5879.5, "end": 5886.54, "text": "ihr eine Amazon Basic USB taugt was, oder kann was taugen, Amazon Basic ist dafür bekannt,"}, {"id": 743, "start": 5886.54, "end": 5891.98, "text": "Produkte die ganz gut sind zu kopieren, also quasi die legalen China-Chinesen, wenn du"}, {"id": 744, "start": 5891.98, "end": 5899.94, "text": "es so willst, ich will mir nichts kaufen, also keine, ihr müsst euch nicht Gedanken"}, {"id": 745, "start": 5899.94, "end": 5906.74, "text": "machen, dass demnächst abbrennt bei mir, aber ob sich das, dann schauen wir mal kurz"}, {"id": 746, "start": 5906.74, "end": 5918.34, "text": "in die Bewertung, ich frag mich halt echt ob das irgendwas taugt, Eistings, Schrott sagt"}, {"id": 747, "start": 5918.34, "end": 5937.14, "text": "er, wieder ein Teil aus China wahrscheinlich, das ist das was du brauchst Max, ok, Zack,"}, {"id": 748, "start": 5937.14, "end": 5956.06, "text": "taugt mal her, was ist das, ja genau, ganz wichtig, wenn man Äste zersägen will, die"}, {"id": 749, "start": 5956.06, "end": 5965.62, "text": "Dschungelmachete, wobei bei komischen Amazon-Dingern, da fällt mir immer nur dieses Meme-Taschenmesser"}, {"id": 750, "start": 5965.62, "end": 5984.94, "text": "ein, Swiss Knife Meme, ich weiß nicht an was ich suchen soll, Taschenmesser für 900 Euro,"}, {"id": 751, "start": 5984.94, "end": 5992.62, "text": "ja, ne, ne, das ist noch zu klein Leute, das ist noch zu klein, der Victorino Swiss Champ,"}, {"id": 752, "start": 5992.62, "end": 6002.06, "text": "endlich mal einer der meine Benamung übernimmt, der Schweizer Champ ist das, gibt es dieses"}, {"id": 753, "start": 6002.06, "end": 6019.66, "text": "Meme-Taschenmesser gar nicht mehr, doch hier, da ist es doch, da ist es doch, das Wenger"}, {"id": 754, "start": 6019.66, "end": 6031.34, "text": "Swiss Giant Knife with Box, das meine ich, das ist ein mega krasses Teil, ich weiß nicht"}, {"id": 755, "start": 6031.34, "end": 6037.62, "text": "wo das denn davon sein soll, sowas zu haben, mitnehmen kannst du es nicht wirklich, aber"}, {"id": 756, "start": 6037.62, "end": 6044.02, "text": "ihr müsst euch mal die Kommentare durchgucken, im Prinzip sind, ist das alles, das gibt's"}, {"id": 757, "start": 6044.02, "end": 6048.38, "text": "schon jahrelang dieses Produkt, im Prinzip machen sich die Kommentare alle darüber"}, {"id": 758, "start": 6048.38, "end": 6070.42, "text": "lustig, 1,4 Kilo, bestes Taschenmesser Produkt ever, so, ähm, hast du eine USB, nein, doch,"}, {"id": 759, "start": 6070.42, "end": 6075.02, "text": "doch, doch, das stimmt nicht, aber die geht nicht mehr, also ich hatte, früher hatte"}, {"id": 760, "start": 6075.02, "end": 6081.46, "text": "ich so eine ganz normale APC Steckdosenleiste im Endeffekt, als ich meinen 19 Zoll Rack"}, {"id": 761, "start": 6081.46, "end": 6084.26, "text": "hier hingestellt habe, habe ich mir gedacht, ok, ich kaufe auch mal einen Hersteller, wo"}, {"id": 762, "start": 6084.26, "end": 6088.66, "text": "ich ein bisschen, den ich kenne und wo ich weiß, das taugt was, da habe ich mir eine"}, {"id": 763, "start": 6088.66, "end": 6095.26, "text": "Cyber Power USB gekauft, aber die hat mich schwer enttäuscht, weil der das einzige Male"}, {"id": 764, "start": 6095.26, "end": 6101.74, "text": "in der ganzen Zeit, wo mein komplettes Rack abgekackt ist, war nicht als bei einem Stromausfall,"}, {"id": 765, "start": 6101.74, "end": 6111.5, "text": "sondern als die Power, Cyber Power USB verreckt ist, ja, das habe ich letztens mir auch was"}, {"id": 766, "start": 6111.5, "end": 6117.74, "text": "angeguckt, aber ich bin immer noch hin und her gerissen, ob ich mir nicht die, die, die,"}, {"id": 767, "start": 6117.74, "end": 6130.26, "text": "die günstige hier von Ethon, Ethon, wie die ausspricht, kaufen soll, sowas da, oder einfach"}, {"id": 768, "start": 6130.26, "end": 6150.34, "text": "YOLO ohne USB, also wahrscheinlich YOLO ohne USB weiter, ja, Cyber Power ist kacke gewesen"}, {"id": 769, "start": 6150.34, "end": 6159.82, "text": "bei mir, Yatong USB, oh ja, China-Chinesen-USB, das brauche ich, laufen die Dinger weiter,"}, {"id": 770, "start": 6159.82, "end": 6168.1, "text": "wenn die Batterie abkackt, also wenn Strom da ist und die Batterie verreckt, geht es"}, {"id": 771, "start": 6168.1, "end": 6178.18, "text": "da noch weiter, das ist die, das ist die Sache, weil bisher hatte ich nur Probleme, wenn die,"}, {"id": 772, "start": 6178.18, "end": 6191.98, "text": "als die USB verreckt ist, nicht, dass da Strom ausgefallen ist, ne, keine Ref-Links, das"}, {"id": 773, "start": 6191.98, "end": 6203.38, "text": "stimmt, muss nicht sein, ich meine, wisst ihr, was ich machen könnte, ohne Scheiß,"}, {"id": 774, "start": 6203.38, "end": 6208.46, "text": "das mache ich, ich mache, ich kaufe das, was wir uns letztens angeguckt haben, was sind"}, {"id": 775, "start": 6208.46, "end": 6223.42, "text": "eigentlich der Unterschied zwischen der Pro-Series und der Eco-Series, Comparison, wir Comparison,"}, {"id": 776, "start": 6223.42, "end": 6238.98, "text": "Comparisieren heute relativ viel, ja, Online-USB mag zwar cooler klingen, somit keine Last-Spitzen"}, {"id": 777, "start": 6238.98, "end": 6247.1, "text": "im Strom und sonst wie, also, ne, keine Spannungsspitzen und so, aber Online-USB ist halt der Sack,"}, {"id": 778, "start": 6247.1, "end": 6252.82, "text": "dass wenn die Batterie verreckt und der Strom noch geht, dann ist trotzdem der Strom weg"}, {"id": 779, "start": 6252.82, "end": 6267.22, "text": "für alle Server, Modelle, die Pro hat eine Webschnittstelle, das ist cool, aber ich will"}, {"id": 780, "start": 6267.22, "end": 6273.9, "text": "halt unbedingt eine, die weiterläuft, wenn die Batterie verreckt, was ist denn das hier"}, {"id": 781, "start": 6273.9, "end": 6282.34, "text": "für ein Vergleich, komm wieder, ok, schauen wir mal, was hier der Unterschied ist, die"}, {"id": 782, "start": 6282.34, "end": 6291.26, "text": "günstigen APCs können das wahrscheinlich, weil sie nicht den Strom permanent durch den"}, {"id": 783, "start": 6291.26, "end": 6313.86, "text": "Akku leiten, dann ist kein Ding, aber USBs, die ihren, was ist das, Chat, Chainlaw, was"}, {"id": 784, "start": 6313.86, "end": 6340.94, "text": "hast du da neben dir für Dinger, was ist das, Batches, Watching without Video, wo ist der"}, {"id": 785, "start": 6340.94, "end": 6350.7, "text": "Sinn davon, von Batches, ich mein, was interessiert es mich, ob der Chainlaw mit oder ohne, mit"}, {"id": 786, "start": 6350.7, "end": 6360.78, "text": "Audio oder ohne Audio guckt, ah, ja, das ergibt Sinn, ok, das verstehe ich, das verstehe"}, {"id": 787, "start": 6360.78, "end": 6368.06, "text": "ich, also sprich, jetzt fangen sie alle an, also sprich, wenn ich jetzt sehen würde,"}, {"id": 788, "start": 6368.06, "end": 6376.3, "text": "dass ganz viele Leute ohne Audio watchen, weil sie hörgeschädigt sind, könnte ich"}, {"id": 789, "start": 6376.3, "end": 6385.94, "text": "keine Ahnung, Text to Speech einpländen oder so, äh nee, Speech to Text einpländen, naja,"}, {"id": 790, "start": 6385.94, "end": 6400.94, "text": "das macht aber wenigstens Sinn, verstehe, verstehe, ok, also, was war denn jetzt der"}, {"id": 791, "start": 6400.94, "end": 6409.7, "text": "Unterschied, ihr sagtet, die haben ein Interface übers Netzwerk, nee, haben sie nicht, haben"}, {"id": 792, "start": 6409.7, "end": 6430.34, "text": "auch USB, ja, dann weiß ich es nicht, versus Echo, hm, ist das eine Online-USB und das"}, {"id": 793, "start": 6430.34, "end": 6438.14, "text": "andere Offline-USB, wahrscheinlich, ne, dann habe ich keine Ahnung, was der Unterschied"}, {"id": 794, "start": 6438.14, "end": 6445.82, "text": "ist, die würden gut dran tun, das etwas prominenter zu platzieren, was der Unterschied ist, dann"}, {"id": 795, "start": 6445.82, "end": 6458.98, "text": "könnte man sich nämlich einfacher dafür entscheiden, die hat kein Display, ich brauche"}, {"id": 796, "start": 6458.98, "end": 6468.06, "text": "kein Display, Display juckt mich so gar nicht, das kommt auf die Art der USB an, also ja,"}, {"id": 797, "start": 6468.06, "end": 6473.18, "text": "die meisten machen das und die wo der Strom quasi permanent gefiltert zu den Systemen"}, {"id": 798, "start": 6473.18, "end": 6483.62, "text": "kommt, die machen das, aber wenn du was hast, der quasi nur umschaltet, wenn Stromausfall"}, {"id": 799, "start": 6483.62, "end": 6489.86, "text": "ist, dann kommt es wahrscheinlich ein bisschen auf die Bauweise an, keine Ahnung, keine Ahnung,"}, {"id": 800, "start": 6489.86, "end": 6493.22, "text": "ich check nicht so genau, was sich das lohnt, ob es der Unterschied, ob sich das lohnt,"}, {"id": 801, "start": 6493.22, "end": 6500.02, "text": "also ich bin geneigt dazu tatsächlich, einfach mal die kleinste hiervon mit USB zu kaufen,"}, {"id": 802, "start": 6500.02, "end": 6519.82, "text": "Ö, Ö, Öko, was, Echo, komme ich auf Öko, so, mit USB, USB, so, ich bin geneigt das"}, {"id": 803, "start": 6519.82, "end": 6524.7, "text": "Ding einfach mal zu kaufen, zum ausprobieren und wenn das nicht gescheit funktioniert oder"}, {"id": 804, "start": 6524.7, "end": 6529.62, "text": "nicht das macht, wie ich mir das vorstelle, dann ich werde einfach mal die Batterie abstöpseln"}, {"id": 805, "start": 6529.62, "end": 6535.02, "text": "und gucken, ob es weiter läuft und wenn das da nicht geht, dann schicke ich es zurück,"}, {"id": 806, "start": 6535.02, "end": 6541.02, "text": "dafür ist Amazon ja bekannt, ja, dass sie da keine, keinen Stress machen, Amazon hat"}, {"id": 807, "start": 6541.02, "end": 6544.82, "text": "bisher alles, Amazon hat sogar meine Reifen, die ich dort bestellt habe, wieder zurückgenommen,"}, {"id": 808, "start": 6544.82, "end": 6554.58, "text": "irgendjemand hat gefragt, eine USB mit Interface, wofür braucht man dann sowas, sind Schoko"}, {"id": 809, "start": 6554.58, "end": 6558.42, "text": "Stecker oder, das glaube ich nicht schlecht, das passt, da kann ich meine Leiste anschließen,"}, {"id": 810, "start": 6558.42, "end": 6572.74, "text": "also wozu eine USB, ich finde es hier gar nicht, wozu braucht eine USB Interface, naja,"}, {"id": 811, "start": 6572.74, "end": 6577.58, "text": "es ist ganz praktisch mitzubekommen, wenn die USB leer geht, um die Server runterzufahren,"}, {"id": 812, "start": 6577.58, "end": 6583.38, "text": "ob das jetzt über Netzwerk geht oder über USB, ist eigentlich zweitrangig, über Netzwerk"}, {"id": 813, "start": 6583.38, "end": 6590.5, "text": "wäre irgendwie cool gewesen, aber über USB geht genauso, haben die auch rackmounted,"}, {"id": 814, "start": 6590.5, "end": 6602.7, "text": "oh, ok, die rackmounted Geschichten, da lecke ich critical information bisher, die will"}, {"id": 815, "start": 6602.7, "end": 6614.38, "text": "ich nicht, die ist mir zu teuer, na gut, das ist aber auch ordentliches, heftiges Ding,"}, {"id": 816, "start": 6614.38, "end": 6631.62, "text": "373 ist eigentlich immer noch zu krass, aber wäre noch im Bereich, die langen aber gut"}, {"id": 817, "start": 6631.62, "end": 6645.26, "text": "zu, für die rackmounted Dinger, funktionieren die auch, wenn du den Akku abstöpselst im"}, {"id": 818, "start": 6645.26, "end": 6653.98, "text": "laufenden Betrieb, hast du mal ausprobiert, Max, hol dir mal Kock, yep, dazu kann ich"}, {"id": 819, "start": 6653.98, "end": 6658.06, "text": "euch was erzählen, es hat gestern ein Kollege, das passt jetzt wie die Faust aufs Auge zu"}, {"id": 820, "start": 6658.06, "end": 6664.86, "text": "diesem Comment, gestern hat ein Kollege zufälligerweise sein Passwort geleakt auf der Arbeit und wisst"}, {"id": 821, "start": 6664.86, "end": 6675.82, "text": "ihr, wie das Passwort war, Pimmelcock123, ich bin mir nicht ganz sicher, ob das wirklich"}, {"id": 822, "start": 6675.82, "end": 6684.18, "text": "geleakt hat oder ob das quasi ein Jebait-Leak war, aber es würde gut passen zu ihm, dass"}, {"id": 823, "start": 6684.18, "end": 6691.22, "text": "er Pimmelcock123 als Passwort hat, insofern, ja, ich lache einfach mal, es war vielleicht"}, {"id": 824, "start": 6691.22, "end": 6695.82, "text": "echt sein echtes Passwort, ich meine, das ist gar kein so schlechtes Passwort, wie viele"}, {"id": 825, "start": 6695.82, "end": 6704.46, "text": "Stellen sind denn das, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, naja gut, es ist kein"}, {"id": 826, "start": 6704.46, "end": 6710.94, "text": "richtig gutes Passwort, 13 Stellen sind eigentlich ticken zu wenig, aber immerhin, immerhin"}, {"id": 827, "start": 6710.94, "end": 6723.58, "text": "13 Stellen, so, ok, ich habe noch 2 Minuten Zeit, was brauche ich denn noch, ich brauche"}, {"id": 828, "start": 6723.58, "end": 6733.34, "text": "besonders dünne Netzwerkkabel immer noch, ach ja, wenn ich mir dieses Dinge bestelle,"}, {"id": 829, "start": 6733.34, "end": 6742.58, "text": "wenn ich mir jetzt wirklich die Box zum Recorden bestelle, dann brauche ich noch eine SSD,"}, {"id": 830, "start": 6742.58, "end": 6749.26, "text": "ich habe keine freie 2TB SSD mehr, wobei doch, was labere ich denn, natürlich habe ich noch,"}, {"id": 831, "start": 6749.26, "end": 6754.5, "text": "ich habe nämlich hier, die habe ich doch noch da, da habe ich mir noch damals fürs Nass,"}, {"id": 832, "start": 6754.5, "end": 6760.22, "text": "weil ich dumm war, 2 Stücke gekauft, die ich jetzt gar nicht verwende, einer ist aber"}, {"id": 833, "start": 6760.22, "end": 6767.7, "text": "Raspberry Pi dran, ich meine die wird es ja auch per USB tun letztendlich, Fernsehaufnahmen,"}, {"id": 834, "start": 6767.7, "end": 6775.22, "text": "na wobei, die die du gegen die Wand geworfen hast, stimmt, ich habe letztens eine SSD gegen"}, {"id": 835, "start": 6775.22, "end": 6785.1, "text": "die Wand geworfen, welche war das denn, oh shit, das war eine 2TB SSD, die war aber im"}, {"id": 836, "start": 6785.1, "end": 6796.54, "text": "Arsch, das war die BX, 500BX, BX, ja, das Teil habe ich letztens gegen die Wand gefeffert,"}, {"id": 837, "start": 6796.54, "end": 6802.78, "text": "na ja, ich probiere es mal aus, die geht bestimmt noch, ganz ehrlich, SSDs sind so robust, die"}, {"id": 838, "start": 6802.78, "end": 6807.54, "text": "überleben das, also da ist ja auch nichts abgebrochen oder rausgekriegt, die hat das"}, {"id": 839, "start": 6807.54, "end": 6816.78, "text": "bestimmt überlebt, dass ich sie gegen die Wand gefeffert habe, die Cuvo wäre gar nicht"}, {"id": 840, "start": 6816.78, "end": 6822.82, "text": "so doof, weil für Fernsehaufnahmen reicht es dicke und wie heißt dieser Speicher in"}, {"id": 841, "start": 6822.82, "end": 6830.94, "text": "der Cuvo dieser, mit mehreren Zellen, der reicht ja eigentlich, PC, korrekt, so alt"}, {"id": 842, "start": 6830.94, "end": 6838.74, "text": "ist mein PC, guckt euch das mal an, 2017, cringe, cringe, wer den Rechner von 2017"}, {"id": 843, "start": 6838.74, "end": 6848.3, "text": "hat, kennst du das, ja das kenne ich, finde ich ist ein nice Gehäuse, falls das das ist,"}, {"id": 844, "start": 6848.3, "end": 6854.18, "text": "mit diesem Zusatz-Anstecker, mit diesem Zusatz-Dock, ja genau, also was heißt Dock, mit dieser"}, {"id": 845, "start": 6854.18, "end": 6863.58, "text": "zweiten Hälfte, die man so rein steckt, das hat sich jetzt falsch angehört, aber ja,"}, {"id": 846, "start": 6863.58, "end": 6867.42, "text": "wenn man das Gehäuse von innen sieht, weiß man was ich meine, die zweite Hälfte, die"}, {"id": 847, "start": 6867.42, "end": 6873.22, "text": "man auch noch rein steckt, so und das finde ich eigentlich ganz cool, wobei ich sagen"}, {"id": 848, "start": 6873.22, "end": 6879.86, "text": "muss, ein bisschen teuer, wenn man halt eine M2 anschließt, ist das das mit M2 oder, ist"}, {"id": 849, "start": 6879.86, "end": 6891.5, "text": "das das mit M2, ja, ist das halt cool, die Sache ist halt die, but why, also warum eine"}, {"id": 850, "start": 6891.5, "end": 6897.7, "text": "M2 SSD über USB an den Raspberry Pi, ich habe keine Ahnung wo das Sinn ist, aber es"}, {"id": 851, "start": 6897.7, "end": 6902.78, "text": "ist cool, dass es geht, ich verstehe den Sinn nicht so genau ehrlich gesagt."}, {"id": 852, "start": 6902.78, "end": 6920.38, "text": "Was für ein Recorder, der Chat hat gesagt, beste, VU plus beste, wir wissen der Chat"}, {"id": 853, "start": 6920.38, "end": 6928.74, "text": "hat bei solchen Sachen noch nie unrecht gehabt, Chat erinnert ihr euch an einen, an auch nur"}, {"id": 854, "start": 6928.74, "end": 6934.38, "text": "eine Voraussage, die ihr getroffen habt, die nicht eingetreten ist, also ich kann mich"}, {"id": 855, "start": 6934.38, "end": 6940.9, "text": "nie dran erinnern, dass der Chat jemals falsch gelegen hat, gerade durch die vielen Prime"}, {"id": 856, "start": 6940.9, "end": 6947.94, "text": "Subs und dieser wahnsinnige EQ Boost, die man bekommt dadurch, kann man eigentlich"}, {"id": 857, "start": 6947.94, "end": 6954.54, "text": "kollektiv nicht falsch liegen, ich meine, wir haben gerade 224 Zuschauer, das sind 224"}, {"id": 858, "start": 6954.54, "end": 6960.34, "text": "Zuschauer, wenn alle nur 150 EQ haben und was durch die Prime Subs mittlerweile überhaupt"}, {"id": 859, "start": 6960.34, "end": 6971.46, "text": "kein Problem ist, da haben wir hier im Chat aktuell 33.600 EQ Punkte, also es ist eigentlich"}, {"id": 860, "start": 6971.46, "end": 6976.9, "text": "nicht möglich, dass der Chat falsch liegt, das ist 6-Head schon nicht mehr ausreichend,"}, {"id": 861, "start": 6976.9, "end": 6985.9, "text": "das ist eigentlich absolut 360-11-Head schon, bei dir soll ich 150 abziehen, das heißt"}, {"id": 862, "start": 6985.9, "end": 6986.9, "text": "du hast Null?"}, {"id": 863, "start": 6986.9, "end": 6993.86, "text": "Das kann nicht sein, allein schon, dass du am Rechner bist und weißt, wie der Chat bedient"}, {"id": 864, "start": 6993.86, "end": 7000.62, "text": "wird, kannst du nicht Null haben, da hat der Chat tatsächlich Recht, aber nur weil der"}, {"id": 865, "start": 7000.62, "end": 7012.74, "text": "Chat Recht hat, heißt es ja immer noch nicht, dass ich es am Ende auch mache, also ich"}, {"id": 866, "start": 7012.74, "end": 7018.42, "text": "kaufe mir neue CPU und einen komplett neuen Rechner, letztendlich wird es wahrscheinlich"}, {"id": 867, "start": 7018.42, "end": 7022.34, "text": "wieder ein Reboot von meinem alten Rechner, ich hör mir nämlich wieder an Fractal Design,"}, {"id": 868, "start": 7022.34, "end": 7031.38, "text": "ja was ist denn das aktuelle, R7, ich hatte die letzten paar Rechner Generationen, die"}, {"id": 869, "start": 7031.38, "end": 7036.06, "text": "ich hatte, hatten alle dieses Fractal Design R Dingsbums Define, immer wieder die neueste"}, {"id": 870, "start": 7036.06, "end": 7039.94, "text": "Version und ich finde das Gehäuse so nice, das werde ich mir wahrscheinlich einfach wiederholen,"}, {"id": 871, "start": 7039.94, "end": 7046.18, "text": "jetzt fragt vielleicht jemand, warum verwendest du denn nicht das alte Gehäuse wieder, wenn"}, {"id": 872, "start": 7046.18, "end": 7052.62, "text": "ich es doch schon mehrere Rechner Generationen hatte, das ist ganz einfach, weil ich zu"}, {"id": 873, "start": 7052.62, "end": 7061.14, "text": "faul bin, weil dann müsste ich den alten Rechner vom Dachboden holen, ausbauen oder den aktuellen"}, {"id": 874, "start": 7061.14, "end": 7066.26, "text": "Rechner, der hier steht und dann zum nächsten Dachboden Rechner wird, ich schmeiße ja sowas"}, {"id": 875, "start": 7066.26, "end": 7069.86, "text": "dann weg, äh ausbauen, da habe ich keinen Dock drauf, da bin ich zu faul, da gebe ich"}, {"id": 876, "start": 7069.86, "end": 7079.38, "text": "lieber 120 Euro aus und kaufe ein neues Gehäuse, so aber sobald es wieder soweit ist, sobald"}, {"id": 877, "start": 7079.38, "end": 7084.26, "text": "es wieder soweit ist, dass es eine neue Nvidia Grafikkarten Generation gibt, ey das ist doof,"}, {"id": 878, "start": 7084.26, "end": 7088.9, "text": "das will ich nicht, dann kaufe ich mir einen neuen Rechner, am besten natürlich in Kombination"}, {"id": 879, "start": 7088.9, "end": 7094.46, "text": "mit neuer CPU Generation, ich hätte mir ja gerne letztes Jahr schon oder vorletztes Jahr"}, {"id": 880, "start": 7094.46, "end": 7101.9, "text": "schon immer endlich mal wieder ein AMD System gekauft, aber so wie es aktuell aussieht,"}, {"id": 881, "start": 7101.9, "end": 7109.26, "text": "scheint ja Intel halbwegs aufgeschlossen zu haben und mal gucken wie die nächste Generation"}, {"id": 882, "start": 7109.26, "end": 7114.42, "text": "aussieht, bin gespannt."}, {"id": 883, "start": 7114.42, "end": 7125.3, "text": "Max heute schon eine Eins kopiert, ich glaube wir bräuchten einen Counter, ich habe heute"}, {"id": 884, "start": 7125.3, "end": 7134.3, "text": "wahrscheinlich schon 420 Einsen kopiert, wenn das mal reicht, warum ist der Airflow beschissen?"}, {"id": 885, "start": 7134.3, "end": 7137.74, "text": "Hä, warum ist der Airflow beschissen?"}, {"id": 886, "start": 7137.74, "end": 7145.38, "text": "Ich mein, der Airflow geht vorne rein mit Lüftern und direkt hinten über die CPU wieder"}, {"id": 887, "start": 7145.38, "end": 7159.54, "text": "raus, also Moment, wo ist denn vorne die Tür offen, also, ich brauchte es mal ohne Tür"}, {"id": 888, "start": 7159.54, "end": 7171.18, "text": "vorne, so, es ist ja schön, dass ihr 30 Milliarden Bilder habt von eurem Gehäuse, aber wie wäre"}, {"id": 889, "start": 7171.18, "end": 7187.42, "text": "es denn mal von vorne mit geöffneter Tür, gibt es nicht, hier, so, du hast vorne den"}, {"id": 890, "start": 7187.42, "end": 7191.78, "text": "Lüfter drin, du hast vorne den Lüfter drin und hinten den Lüfter, das geht, ach so,"}, {"id": 891, "start": 7191.78, "end": 7198.18, "text": "du meinst, weil vorne zu ist, also du meinst, wenn es vorne offen wäre, wäre das besser"}, {"id": 892, "start": 7198.18, "end": 7208.62, "text": "als dass er das nebenan saugen muss, ja gut, das ist wohl wahr, ja, das ist oben zu und"}, {"id": 893, "start": 7208.62, "end": 7216.18, "text": "es hat vorne nur was zum ansaugen an der Seite, ja das schöne ist aber, dass das überall"}, {"id": 894, "start": 7216.18, "end": 7221.78, "text": "Luftfilter und sowas hat, das wird nullstaubig, ok, das verstehe ich, dass vorne nicht so"}, {"id": 895, "start": 7221.78, "end": 7229.58, "text": "viel reinkommt, aber ganz im Ernst, das ist komplett ausreichend, ich mein, wenn man"}, {"id": 896, "start": 7229.58, "end": 7237.22, "text": "seine CPU jetzt irgendwie so am Limit übertaktet mit mehr Spannung und allem, ok, dann verstehe"}, {"id": 897, "start": 7237.22, "end": 7248.5, "text": "ich es, aber mein Rechner läuft im Desktop-Pertrieb nahezu silent und ja, wenn ich Spiele anmache,"}, {"id": 898, "start": 7248.5, "end": 7255.14, "text": "dreht er halt ein bisschen hoch, aber, vielleicht sollte ich mir aber wirklich ein neues Gehäuse"}, {"id": 899, "start": 7255.14, "end": 7262.94, "text": "angucken für nächsten Build, Fractal, die sind Meshify 2, die Namen von Gehäusen werden"}, {"id": 900, "start": 7262.94, "end": 7268.82, "text": "auch immer geiler, aber nix toppt, irgendwelche Mainboards, die KillerFatality, Headshot Pro"}, {"id": 901, "start": 7268.82, "end": 7277.02, "text": "oder so heißen, ok, das sieht tatsächlich auch ganz schick aus, ist da, ist da das allerwichtigste,"}, {"id": 902, "start": 7277.02, "end": 7285.22, "text": "Staubfilter, Fragezeichen, meint ihr Nvidia stellt dieses Jahr ihre 4000er Serie vor,"}, {"id": 903, "start": 7285.22, "end": 7292.74, "text": "ich hoffe es, weil ansonsten kaufe ich mir keinen neuen Rechner, Moment, wir schauen"}, {"id": 904, "start": 7292.74, "end": 7299.1, "text": "mal kurz, ob die auch wieder so ein, wie nennt sich das so, dieses Explode View heißt das"}, {"id": 905, "start": 7299.1, "end": 7308.62, "text": "glaube ich, Explode Ansicht, da ist, ok, gut, da ist ein Luftfilter dabei, sowohl oben"}, {"id": 906, "start": 7308.62, "end": 7331.82, "text": "als auch unten, ja, das ist cool, das gefällt mir, Cost, ja gut, das kostet ungefähr so"}, {"id": 907, "start": 7331.82, "end": 7347.5, "text": "viel wie das Fractal Design, Define, Blah, R, irgendetwas, gut, aber oben, also oben wäre"}, {"id": 908, "start": 7347.5, "end": 7352.7, "text": "es mir tatsächlich lieber, wenn das zu wäre, ich will, ich will gar nicht, dass das oben"}, {"id": 909, "start": 7352.7, "end": 7359.7, "text": "auf ist, weil oben auf heißt auch mehr Krach kommt raus, hast du mitbekommen, dass Nvidia"}, {"id": 910, "start": 7359.7, "end": 7365.66, "text": "teilweise ihre Linux Treiber open sourced, ja, soweit ich weiß, open sourced Nvidia"}, {"id": 911, "start": 7365.66, "end": 7371.46, "text": "ihre Linux Treiber komplett, was sie nicht open sourcen ist ihre Compute Geschichte,"}, {"id": 912, "start": 7371.46, "end": 7379.26, "text": "also CUDA und, wahrscheinlich irgendwelche NVN Geschichten und sonst was, aber der eigentliche"}, {"id": 913, "start": 7379.26, "end": 7391.66, "text": "Grafikkartentreiber wird angeblich komplett open sourced, ja, kauf mir keine Wasserkühlung,"}, {"id": 914, "start": 7391.66, "end": 7402.98, "text": "bin überhaupt kein Fan von Wasserkühlung, Wasserkühlung ist nicht, ist die Weis, abwarten"}, {"id": 915, "start": 7402.98, "end": 7411.22, "text": "ist immer noch Nvidia, ja das stimmt wohl, also Gehäuse die oben zu sind finde ich persönlich"}, {"id": 916, "start": 7411.22, "end": 7416.94, "text": "nett, weil ich habe die Gehäuse ja quasi so schräg neben mir stehen und ich bin äußerst"}, {"id": 917, "start": 7416.94, "end": 7424.3, "text": "empfindlich was Rechnergeräuche angeht, also ich möchte, dass der im normalen Desktop"}, {"id": 918, "start": 7424.3, "end": 7431.82, "text": "Betrieb wirklich silent ist, was, also silent heißt für mich nicht lüfterlos, sondern"}, {"id": 919, "start": 7431.82, "end": 7440.38, "text": "halt, dass ich es nicht höre und ich habe aktuell einen Noctua DH15, kann das sein,"}, {"id": 920, "start": 7440.38, "end": 7447.22, "text": "so ein Lüfter, wenn der hoch dreht, ich meine da geht es richtig ab, ja, ach guck mal mit"}, {"id": 921, "start": 7447.22, "end": 7452.74, "text": "6 Heatpipes, wusste ich gar nicht, dass er 6 Heatpipes hat, ne ich hab nur, ich hab den"}, {"id": 922, "start": 7452.74, "end": 7458.5, "text": "gleichen mit nur einem Lüfter anstatt 2, also wenn der richtig hoch dreht und über"}, {"id": 923, "start": 7458.5, "end": 7465.58, "text": "seine 6 Heatpipes den Kram abtransportiert, dann wird es auch laut, aber im Desktop Betrieb"}, {"id": 924, "start": 7465.58, "end": 7476.82, "text": "dreht er leise und ist richtig, richtig leise, ja, es mir gerade aufgefallen, dass ich aus"}, {"id": 925, "start": 7476.82, "end": 7490.7, "text": "irgendwelchen Gründen mal ein sinnloses Text-to-Speech für Heatpipes eingebaut hab, ja, der ist top"}, {"id": 926, "start": 7490.7, "end": 7505.34, "text": "der Lüfter, weiß nicht ob der immer noch angesagt ist, Kopfhörer, ne Kopfhörer ist"}, {"id": 927, "start": 7505.34, "end": 7511.26, "text": "keine Alternative zu im Desktop Betrieb nicht hörbare Rechner, man hat zwar öfters Kopfhörer"}, {"id": 928, "start": 7511.26, "end": 7517.7, "text": "auf, sei es, dass man mietet oder dass man was spielt oder so, aber ich sitz oft genug"}, {"id": 929, "start": 7517.7, "end": 7522.9, "text": "vorm Rechner und hab absichtlich keine Kopfhörer auf, wenn man den ganzen Tag den Kopfhörer"}, {"id": 930, "start": 7522.9, "end": 7527.26, "text": "auf hat ist es auch nicht angenehm und mir reicht das schon, ich muss so viele Stunden"}, {"id": 931, "start": 7527.26, "end": 7532.98, "text": "mieten am Tag mittlerweile, wo ich Kopfhörer auf hab, da will ich auch so mal vorm Rechner"}, {"id": 932, "start": 7532.98, "end": 7537.62, "text": "sitzen ohne Kopfhörer und deswegen muss das im Desktop Betrieb silent sein oder halt silent"}, {"id": 933, "start": 7537.62, "end": 7545.5, "text": "bedeutet für mich ich hör ihn nicht und das ist aktuell so, ja das sind Österreicher,"}, {"id": 934, "start": 7545.5, "end": 7560.1, "text": "doch Doktora sind Österreicher, jeder Kopfhörer ist bei 12 Stunden am Tag irgendwann zu viel,"}, {"id": 935, "start": 7560.1, "end": 7572.86, "text": "außerdem kommt mir die Luft an die Ohren, sei denn man braucht das nicht, kannst du"}, {"id": 936, "start": 7572.86, "end": 7580.74, "text": "mir die neue Xbox bauen, easy, kein Problem, haben wir, mit einem ESP32 drin, vor allem"}, {"id": 937, "start": 7580.74, "end": 7586.14, "text": "bei den warmen, ja das schöne ist gerade, ich hab meine Klimaanlage vorgestern angeschaltet"}, {"id": 938, "start": 7586.14, "end": 7592.46, "text": "und seitdem seh ich auf der Arbeit die Leute die ganze Zeit im Chat schreiben, boah heute"}, {"id": 939, "start": 7592.46, "end": 7600.3, "text": "ist aber, geht aber hier richtig, richtig warm, denk ich mir so, was, Kegweight, bei"}, {"id": 940, "start": 7600.3, "end": 7607.18, "text": "mir ist angenehm, 23, 24 Grad, aber ich häng das nicht so sehr an die große Glocke, weil"}, {"id": 941, "start": 7607.18, "end": 7623.38, "text": "es 20 Meter weird flex, ja, so Leute, Bettke, ja 23, 24 Grad ist doch ok, was hast du für"}, {"id": 942, "start": 7623.38, "end": 7629.42, "text": "eine Klimaanlage, ja das ist ein Splitgerät, ich hab eine Außenstation an der Wand und"}, {"id": 943, "start": 7629.42, "end": 7638.14, "text": "mehrere Innendinger, das wusste ich mir auch von irgendeinem Kelte, Kelte, wie nennt sich"}, {"id": 944, "start": 7638.14, "end": 7644.5, "text": "das, du brauchst eh ne gewisse Zertifizierung, dass du überhaupt Anlagen, Klimaanlagen einbauen"}, {"id": 945, "start": 7644.5, "end": 7655.22, "text": "lassen kannst, Kelte, irgendein Handwerker der zertifiziert ist Klimaanlagen einzubauen,"}, {"id": 946, "start": 7655.22, "end": 7660.02, "text": "bei denen hab ich das gemacht, Klimatechniker, Kältetechniker, das ist das was ich gemeint"}, {"id": 947, "start": 7660.02, "end": 7669.06, "text": "hab, ja, die sind dann angerückt, haben ein Loch in die Wand gebohrt, mit nem Schlauch"}, {"id": 948, "start": 7669.06, "end": 7674.1, "text": "durch und haben dann da das draußen angeschlossen, haben sie draußen auf die Leiter gestellt"}, {"id": 949, "start": 7674.1, "end": 7681.54, "text": "und was mich damals überrascht hat ist, die hatten zwei Mädels dabei, also es waren zwei"}, {"id": 950, "start": 7681.54, "end": 7685.34, "text": "Kerle und zwei Mädels, die die Klimaanlage eingebaut haben, hätt ich jetzt gar nicht"}, {"id": 951, "start": 7685.34, "end": 7695.74, "text": "im Handwerkerbereich so vermutet, so ungefähr ja, also das Haus hat mal der Opa, ne der Opa"}, {"id": 952, "start": 7695.74, "end": 7701.02, "text": "hat es auch nicht gebaut, das stimmt gar nicht, der, ich glaub mein Opa oder so hat"}, {"id": 953, "start": 7701.02, "end": 7706.58, "text": "es gebaut, der der irgendwann nach Südafrika abgehauen ist, Baujahr ist irgendwie 1900"}, {"id": 954, "start": 7706.58, "end": 7714.78, "text": "rum oder so, es ist also auch noch sehr massiv gebaut, zwei verschiedene Deckel, wenn es"}, {"id": 955, "start": 7714.78, "end": 7719.9, "text": "den geschlossenen Deckel hat bin ich sofort dabei, Pog, so Leute, Bethke, gibt es irgendjemanden"}, {"id": 956, "start": 7719.9, "end": 7729.82, "text": "den ich hausten kann, Semper Video hab ich das letzte Mal gehostet, Massive genau wie"}, {"id": 957, "start": 7729.82, "end": 7746.86, "text": "Max, so ist es, so siehts aus, ich hab was mit nix zuerst gemacht, ne, man könnte, bin"}, {"id": 958, "start": 7746.86, "end": 7754.06, "text": "ich jetzt quasi ein Achtel Afrikaner oder so, wobei das zählt ja nicht, mein Opa ist"}, {"id": 959, "start": 7754.06, "end": 7759.46, "text": "ja nur abgehauen nach Südafrika, was damals viele gemacht haben, damals haben viele Frauen"}, {"id": 960, "start": 7759.46, "end": 7764.34, "text": "und Kinder in Deutschland sitzen lassen und sind nach Südafrika, ich weiß ehrlich gesagt"}, {"id": 961, "start": 7764.34, "end": 7776.98, "text": "gar nicht warum, bin ich historisch nicht so bewandert, äh bewandt, ey ich mag keine"}, {"id": 962, "start": 7776.98, "end": 7782.34, "text": "Wasserkühlung, egal Leute, Bett geht time, ich geh jetzt schlafen, wir sehen uns vielleicht"}, {"id": 963, "start": 7782.34, "end": 7785.38, "text": "morgen im nächsten Stream, mal gucken, paar Sachen muss ich noch einkaufen, vielleicht"}, {"id": 964, "start": 7785.38, "end": 7791.58, "text": "mal morgen wirklich dann auch die ganzen Sachen komplett, weil alles, alles haben wir"}, {"id": 965, "start": 7791.58, "end": 7796.06, "text": "heute nicht hinbekommen, aber wir waren schon relativ effektiv im Vergleich zu sonst, wie"}, {"id": 966, "start": 7796.06, "end": 7799.98, "text": "krieg ich denn das wieder weg, und ich geh jetzt pennen, wir sehen uns, bis dahin, machts"}, {"id": 967, "start": 7799.98, "end": 7815.62, "text": "gut, see you."}]}