{"text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss. Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss. Das war's für heute und wir sehen uns beim nächsten Mal wieder. So, da bin ich. Heute brauchen wir noch so 10 Minuten oder so, ich muss erst mal in Bastelstimmung kommen. So, da bin ich. Heute brauchen wir noch so 10 Minuten oder so, ich muss erst mal in Bastelstimmung kommen. Und war es auf der Arbeit wieder ein bisschen nervig. Und danach habe ich Sport gemacht, also ich bin noch nicht so wirklich komplett in Bastelstimmung. Aber das wird sich wahrscheinlich demnächst ergeben, hoffe ich mal. Habt ihr irgendwas Spannendes heute gemacht? Gibt es irgendwelche wichtigen, interessanten Neuigkeiten? Ich habe gesehen, Game Awards sind, es könnte mich kaum was weniger interessieren gerade. Game Awards haben mich ehrlich gesagt noch nie interessiert. Es gab mal eine Zeit, da habe ich total drauf gebrannt, neue Ankündigungen zu haben von Games, sei es irgendwelche Pressekonferenzen oder was vorgestellt wurde. Aber nachdem das alles mittlerweile so lame und overhyped ist, bis auf ein paar Sachen, mache ich die meisten. Gestern habe ich auch nicht geguckt. Ich lese mir einfach Zusammenfassungen durch und gut ist. Tja, siehste. Leute, was ist die beste Rust DDE, bevor wir loslegen? IntelliJ mit Rust Plugin, Wishlist Studio Code. Ich habe mir im Vorfeld nicht viel angeguckt. Ich habe nur ganz kurz mal so ein Hallo Welt Tutorial gelesen, das war es. NeoWim, ja mit was denn? NeoWim alleine wird es ja kaum sein, oder? Language Server, oder was? C-Line mit Rust, na gut, da kann ich auch IntelliJ mit, wobei C-Line habe ich schon installiert, da kann ich auch C-Line verwenden. Wobei ich weiß gar nicht, ob ich auf dieser vor allem installiert habe. Das ist genau das gleiche, das ist Wishlist Studio Code, nur glaube ich ohne proprietären Microsoft-Krempel. Was teilweise gar nicht so einfach ist, weil du beispielsweise für CodeShare und für die C++ Extensions und sowas... Ja, die Wishlist Studio Code C++ Extensions ist proprietär, die geht nicht. Ja, also ich habe Rust mal gemacht vor einer ganzen, ganzen Weile. Ich glaube, da war die Sprache noch nicht mal 1.0, als das neu war. So ganz grob habe ich ein bisschen Ahnung von, aber nicht wirklich viel. Ah, ich weiß, dass du bei den hinteren Printen ein Ausrufezeichen brauchst, weil es ein Makro ist. Ich weiß, dass du mit Cargo dein Zeug managst. Aber ich weiß, dass die Syntax teilweise ein bisschen Painschamp ist. Sehr viel NumSumOptional. Das Multithreading damals ziemlich Painschamp gewesen ist, wobei uns das für WebAssembly wahrscheinlich nicht weiter jucken muss. Ich, keine Ahnung, ich bin mal gespannt. Ownership, Borrow Checker, genau dieses ganze Zeug, da werden wir heute wahrscheinlich ein bisschen ausflippen. Aber wir machen simple Sachen. Ich habe keine Einladung zur Beta, ich habe mich noch nicht mal angemeldet zur Beta. Warum muss man sich da überhaupt anmelden zu einer Beta? Warum kann man nicht einfach den Editor in der Beta installieren? Und das gute, wie irgendwelche neuen Social Plattformen, die sind auch immer mit Einladung am Anfang. Gibt es eigentlich Clubhouse noch? Nein, Clubhouse interessiert doch keinen mehr, oder? Die haben doch mal irgendwelche Daten geleakt und seitdem will da keiner mehr hin. Nicht Assembler, WebAssembly, das hat wenig zu tun mit wirklich x86 Assembler oder sowas. Man kann WebAssembly sogar in einer Lisp-ähnlichen Sprache zusammenwursten von Hand. Habe ich letztes Video drüber gesehen. Ja, da wurde irgendwas geleakt, ich weiß aber nicht mal was. Irgendwas wurde geleakt und ach, kein Schimmer. Ich hatte die App nie installiert. Ja, Lisp, also Leute, wenn ihr auf Programmiersprachen steht, die im Endeffekt so aussehen, dann mögt ihr Lisp wahrscheinlich. Ich habe früher mal eine ganze Weile Emacs verwendet, so zu Zeiten noch als Wishful Studio Code noch nicht angesagt, und auch die ganzen Extensions und ich sage euch, Emacs Lisp ist wirklich das Schlimmste, was es gibt. Ich weiß gar nicht, warum das so viele abgefeiert haben immer. Ja, fast. Ich überlege gerade, wie man das jetzt am besten machen. Als erstes installiere ich mir mal IntelliJ oder gucken, ob ich Z-Line noch installiert habe. Erstmal installieren wir den ganzen Krempel und dann schauen wir mal. Ich muss mich ein bisschen an Rust rantasten, wobei so ein Hallo Welt kriegen wir wahrscheinlich relativ zackig zum Laufen. Ob wir heute was mit FFmpeg hinbekommen, da habe ich so meine Zweifel. Weil das ist ja eigentlich das, was ich ausprobieren will. Ob ich mit FFmpeg was im Browser quasi Transcoden kann. Und ich will wirklich Low-Level das machen, also AV-Frames rausholen und nicht irgendein fertiges FFmpeg zu WebAssembly-Commando-Zeilen-Tool verwenden. Ich bin mal gespannt. Aber ich glaube nicht, dass wir das heute so weit hinkriegen. So, also, was ist das heute für ein Hintergrund? Das ist das Bing Image of the Day. Das ist eine Wiese mit roten Flecken. Alles klar. Was ist dein Haupt-OS, Windows 10? Das ist Windows 10 und das ist eine Linux VM. Sind eigentlich deine Hardware-Komponenten bekannt? Ja, die sind gar nicht sonderlich gut mittlerweile. Damals waren die ziemlich gut. Das hier, oder? Ja. Hast du 32 GB? Ja, ich habe 32 GB Arbeitsspeicher. Hier stehen glaube ich nur 16 drin, aber es sind insgesamt 32. Guck hier, 32 GB. Aber das brauchst du nicht. Guck mal, also das ist jetzt nicht... Armour Reforged, nee. Reforger. Gesehen habe ich das schon, Armour, aber nicht gespielt, nee. Also guck, du brauchst also, um ein paar VMs ordentlich laufen zu lassen, brauchst du keine 32 GB. Ich habe es voll übertrieben. Ich meine, ich habe dieser VM... Äh, hallo? Ich habe dieser VM 16 GB RAM und 4 CPU-Kerne gegeben. Das braucht die im Leben nicht. Armour Reforged, nee, das war Warcraft 3 Reforged. Also der Rechner ist 4 Jahre alt und ist immer noch ziemlich gut. Hauptsächlich wegen der 1080T. Das wird sich gleich zeigen. Nein, nein, das ist nicht die neue VM. Die ist ja noch gar nicht fertig. Ich glaube bei RAM-Auslastung ist eigentlich weniger mehr. Madboy Mad Prime Subscriptions hier, Dankeschön. Massive Prime Subs. Ich habe übrigens vorher noch eine neue Version vom EPG-Champ gepostet. Der caches das ganze Zeug jetzt ordentlich, jetzt geht es ein bisschen schneller. Und die Aufnahme funktioniert auch wieder. Wie heißt noch mal die Terminal-Anwendung? Das da, CMDR. Aber mittlerweile, du kannst auch das neue Windows Terminal verwenden, das ist auch ganz okay. Allerdings, please nicht mit PowerShell. Na gut, doch mit PowerShell. PowerShell ist okay. Ich mag PowerShell als interaktive Shell nicht, aber PowerShell ist okay. Was halt Ober-Crap ist, also Hyper-Ultra-Crap ist das CMD-Fenster und dann da drin diese Batch-Shell. Ganz abartig. PowerShell gibt es übrigens mittlerweile sogar unter Linux. Ich weiß gar nicht, ob ich hier mal Just For Fun installiert habe. Seit es.NET Core gibt, gibt es den Kram. Auch für Linux. So, ich muss mal kurz ein bisschen Platz machen. Wartet mal, Leute, ich muss mal kurz, muss mal kurz was gucken, wo ich hier viel Platz verschwende. Dart. Ich hab immer noch Dart und Flutter drauf hier. Das könnte man tatsächlich mal löschen. Mach hinne. Ich muss ein paar Sachen löschen, dass ich genug Platz hab wieder. Ich glaub, ich hab da schon 160 geht ran. Oder 80 nur? Hat nicht denselben Umfang wie unter Windows. Ja, das wundert mich nicht. PowerShell war ja ursprünglich als Windows-Automatisierungs-Ding geplant. Da ist ja auch dieses Ganze. Wie heißt das unter Windows? Nicht WSL. Ich meine nicht WSL. Ich meine dieses Abfragezeug. WMI heißt das, glaube ich, unter Windows. Wo du so System-Infos abfragen kannst. Das hat ja eigentlich alles ganz gute PowerShell-Integrationen, aber das gibt es ja unter Linux gar nicht. So. Oldschooler hier. Guck dir schon lange. Kam nie dazu, im Steam zu sein. Ja, ursprünglich hatte ich eigentlich gedacht, wir könnten eine Runde Battlefield spielen, wenn jetzt die neue Season rauskommt. Aber ich hab heute absolut keinen Bock auf Battlefield 2042. Ich bin eh ziemlich im Arsch. Ich bin ehrlich gesagt auch nur angekommen, weil ich gestern gesagt hab oder gestern extra abstimmen lassen, was wir heute machen wollen. Zwar mit dem Hinweis vielleicht auch nix, aber ich wollte dann trotzdem jetzt auch nicht den Streamstreak abreißen lassen. Ich meine, das ist jetzt Premiere. Ich glaube, das hatte ich noch nie. Ich war sieben Tage oder acht Tage in Folge on. Das ist ja, das kommt ja normalerweise nie vor. So. Also, Home. Na, da haben wir nicht viel. War. Lip. Alter. Snap-Pains-Champ, Alter. Was hab ich denn überhaupt? Snap-List. Snap-List. WTF? Ah. Wie krieg ich, wie krieg ich, wie krieg ich das überhaupt weg? Snap-Remove. Okay, okay. Weg, weg damit. Braucht doch kein Mensch. Bare. Core. Core. Core. Dings. GTK Common Themes. Warum? LXD. Was hab ich denn hier alles für einen Müll drauf? Was laufen? Warum hast du, ich weiß es nicht. Ich hab noch, ich hab noch LXD, LXD. Was hab ich denn hier alles für Zeug? Delete. Remove. Ach. Uninstall. Ach, ich weiß gar nicht, was es ist. Ich hoffe, dass es Remove ist. Nein. Delete. Delete. Vielleicht. Okay. Delete. Da runnt sogar ein Container standardmäßig. Ich hab keinen platzen Schimmer, was es ist, aber. Ich lösch das jetzt einfach. Kann nix Wichtiges sein. Einfach weg damit. So, und dann werde ich, dann werde ich gleich wegschmeißen. Ich muss mal kurz ein bisschen Platz machen. Ja, auf. Ausgehen, please. Arch, by the way. Ja. Da kann es schonmal sein, dass man über, Arch ist so wahnsinnig advanced und geil. Da kann schonmal passieren, dass man die Übersicht verliert, was man so alles läuft. Sag mal. Kann sich das vielleicht mal beenden? Please. This operation can't be cancelled. Interrupt, ja was denn jetzt? Kann ichs jetzt, kann ichs jetzt canceln oder nicht? Boss. Weg. Okay. Alles klar. Delete. Ich weiß nicht, was es ist, aber das muss weg. Muss man bei LXC auch noch Images löschen? Lieber Docker oder ist das danach? Image. Image List. Ja 200 irgendwas. Image. Delete. Ubuntu 18. Das läuft schon eine Weile hier, würde ich sagen, oder? Weil wir hier in Ubuntu 1804 laufen haben. Okay, so und jetzt kann ich Snap remove. Und jetzt habe ich. Was? Warum ist Snap so ein Crap, Alter? Und jetzt? Snap ist being used. Okay, das kann ich nicht löschen. Das gehört zu Snap dazu. Alles klar. Nee, auch nicht. Okay. Coil, Coil auch nicht oder was? Alter, Mann. Okay, Snap List. Darf ich jetzt den Rest löschen? Ja, ja, okay, okay. Ja, Snap löscht, Snap wird auch gleich gelöscht. Ich weiß gar nicht, warum ich den Müll überhaupt installiert habe. Keine Ahnung, aber dadurch wird ja nicht alles entfernt. So und jetzt diesen ganzen anderen Mist. Okay, das geht nicht. Ah, jetzt, jetzt kann ich die Bare löschen. Okay, das Klo muss da bleiben, alles klar. Snap. Weg damit. Yep. Na, Gott sei Dank. So, jetzt habe ich ein bisschen mehr Platz. Gut. Snap. Alles klar, gelöscht. So und jetzt machen wir noch mal ganz kurz hier ein bisschen Platz. Max. Cash. Alter, was ist denn hier alles gecashed, Mann? Share. Jet Brands. Okay, ergibt Sinn. Okay, wie, wie klärt man? Cash. Clearing Cash. Ja, wie geht das? Okay. Do you want to remove all other packages from cash? Yes. Yes. Do you want to remove all other? Yes. Yes. So, ich hoffe, ich habe mir jetzt nichts kaputt gemacht, aber schauen wir mal. Sehr gut. So, jetzt haben wir jetzt 75, 45G wieder frei. Excellent. So muss das sein. Alles klar. Gut. Dann installiere ich mir mal irgendein Jet Brands Ding mit Rust Plugin. Kengi, Moin. Da ist er. Moment, ich wollte nicht weiter. Ich wollte die Toolbox öffnen. Soll wohl auch für Web-Anwendungen eine gute Alternative. Go ist jetzt, ganz im Ernst, ich glaube nicht, dass Go bei Web-Anwendungen wahnsinnig irgendwie jetzt den hohen Marktanteil hat. Ich meine, es gibt ein paar Web-Frameworks, es gibt Leute, die machen größere Web-Anwendungen mit Go-Backend. Aber Go ist vor allem im Cloud-Umfeld ziemlich beliebt und für Kommando-Zeilen-Tools und Static Binaries. Also Go ist eine wunderbare Geschichte. Ich habe so ein paar Kritikpunkte an der Syntax und ein paar Sachen, die ich nicht ganz nachvollziehen kann. Auf der einen Seite hast du zum Beispiel drei verschiedene Sorten, wie du Variablen anlegen kannst, aber sie wollen immer noch, dass du drei Nested Loops machst, um ordentlich durch Arrays durchzufräsen und dort was rauszufiltern. Wie gesagt, auf der einen Seite irgendwie ein bisschen viel, auf der anderen Seite ein bisschen wenig. Aber insgesamt ist Go immer noch ganz nice. Vor allem, wenn man das an C++-Standards misst, dann ist es hyper nice. Ja und Go hat jetzt auch Generics, wobei die Syntax wohl auch nicht so geil sein soll. Ja, Switchbot ist preislich nicht so super attraktiv. Ich habe allerdings noch zwei Stück hier auf Lager, weil man braucht immer mal was, ja auch Sachen zu checken, ob irgendein Key in einem Dictionary drin ist. Der Go-Way ist da auch jetzt nicht so geil. Das coole ist an den Switchbots, dass du damit alles irgendwie smart machen kannst, was ein Button hat, wo du nicht dran rumbasteln willst. Dafür habe ich auch noch ein paar auf der hohen Halde, also zwei Stück. So Leute, macht es einen Unterschied, ob ich C-Line installiere oder IntelliJ. Ich installiere wahrscheinlich C-Line, weil vielleicht machen wir ja mal wieder ein bisschen Arduino Zeug. Ich habe bei mir auf der normalen VM, die ich verwende, wenn wir nicht sind, habe ich im Prinzip auch Goland Rider C-Line drauf, weil ich das teilweise netter finde als Platform I.O. in Visual Studio Code. Tom, PC, Dankeschön für den Zap. So, C-Line, auf geht's. Nee, auf Vim habe ich jetzt keinen Bock. Wie gesagt, ich war früher der richtige Vim-Addikt. Ich habe 800 Zeilen Vim-AC oder noch mehr gehabt, keine Ahnung und irgendwie 40 Plugins und sonst was. Das kenne ich, das habe ich gesehen, aber das machen wir jetzt erstmal nicht. Ich brauche ja kein Web-Framework. Ich brauche ein paar Funktionen, die ich aufrufen kann im Browser von JavaScript aus. So, ich habe ein Tutorial gefunden für diese ganze Geschichte. Das war Rust WebAssembly. Das sah eigentlich ganz gut aus, das da. Das machen wir nicht durch, wir machen bloß das Hallo Welt da draus. Okay, also, Opening. Dann Open mal. Ich finde es immer geil, wenn Java ohne irgendwelche Settings geladen wird, wie schön das Frontrendering ist. Sagt doch mal, das ist doch eine wahre Augenweide. Plugins. So, Rust, guck mal da. Ist ziemlich beliebt. Erstes Plugin, was empfohlen wird. Rust. Ach so, bevor ich Rust installiere, sollte ich vielleicht mal Rust installieren, oder? Habe ich Rust 19? Ja, aber Rust alleine bringt mir nicht. Ich brauche Rust Up wahrscheinlich. Ich erinnere mich noch dunkel, dass man sowas... Oh. Are in Conflict. Ich glaube, ich brauche Rust Up, aber das werden wir gleich sehen. Weil wir brauchen ja zusätzliche Tool-Chains und Dinger. Vielleicht geht das auch mit Cargo. Ich weiß es nicht. Nee, Conflict sagt er jetzt bloß, weil beide das Rust-Kommando zur Verfügung stellen. Cargo, Cargo habe ich bestimmt. Ja, ja. Und ich habe auch ein aktuelles Rust. Guck mal hier, Repos, MK, wobei wir machen das irgendwie. Ja, mit Rust Up kannst du doch so... Also wenn ich mich doch richtig erinnere dran. Mit Rust Up kannst du dann auch zusätzliche Tool-Chains installieren, oder kannst du sagen, ja, ich hätte gern den Rust-Compiler für WebAssembly, ich hätte gern den Rust-Compiler für ARM, ich hätte gern auf Musel-Basis. Ja, das gibt es wirklich. Das ist so eine minimale C-Library. So, und nun? Wie geht es jetzt weiter? Ich habe jetzt Rust-Plugin installiert. Gibt es ein Plugin für HolySea? Nee. Nicht TempleOS Confirmed. Ok, neues Projekt, Rust. Ok. Language Standard C++14. Ich... Ist es Procken? Leute, ist das Plugin Procken? Wenn ich hier was anklicke, dann ändert sich was. Wenn ich Rust anklicke, passiert gar nichts. Restarten? Ok, wir Restarten. Im Zweifelsfall, Reboot tut gut, ne? Hast du schon mal was mit dir im... Nee, aber ich weiß, was es ist. Das ist so ein Stateless Overlay mal Ding für C und C++. So, und jetzt? Ah, tatsächlich. Ok, wir müssen doch kurz in das Tutorial reingucken, aber ganz wichtig. Ah, yes. Darkreader an. Setup. Erstmal Setup angucken. Rust-Toolchain. You will need Rust-Toolchain in Rust-Up, Rust-C und Cargo. Ok, Leute, ich brauche Rust-Up. Warum? NPM zum NPM installieren. MonkaS. Was ist der Unterschied von einer IDE und Vim zu Emacs? Es ist standardmäßig einfach mehr dabei. Bei Vim und Emacs musst du dir sehr viel selbst bauen. Und viele Sachen gehen da auch jetzt nicht so schön, wobei vieles mit externen Tools gelöst wurde. Also, zum Beispiel eine Sache, die in Vim nie so schön ging, war beispielsweise Auto-Completion-Pop-Ups. Vim hat zwar eingebaute Auto-Completion-Pop-Ups, aber wenn du beispielsweise ein Pop-Up... zeig dir, was ich meine. Ja, in Mineo-Vim funktioniert das gut. Vielleicht geht es mittlerweile auch, weil die ja vieles übernommen haben. So. Auf, starte mal. Das ist der Vorteil von Vim, der Startestelle. Also, wenn du sowas hier hast, zum Beispiel so ein Auto-Complete-Pop-Up, was du machen kannst, das ist halt richtig Pain's Jam gewesen, zum Beispiel Vim früher umzusetzen, weil Vim hat halt keine Möglichkeiten gehabt, außer ein Pop-Up zu machen. Also, wenn du sowas programmieren willst und du hast nur ein Pop-Up, wo du einfach nur Text reinschreiben kannst, ist es halt ein bisschen eklig. Also, du brauchst ja Zusatzinformation. In welchem Namespace ist das? Ist es eine Methode? Ist es ein sonst was anderes Icon? Mit so Sachen wie Language Server ist es ein bisschen besser geworden, aber sowas ist halt wirklich eklig in Vim. Aber in der Regel kann man sagen, Vim ist halt standardmäßig ein Out-of-the-Box-and-Text-Editor, der in irgendwie 5 Millisekunden gestartet ist. Wohingegen meine Ideen erst mal 30 Sekunden Booten richtig tun, dafür Out-of-the-Box deutlich mehr Funktionalität haben. Wie ist der aktuelle Stand bei der China-Chinesen-Wetterstation? Die funktioniert, die steht draußen und liefert Zeug. Ok. Hello World. Cargo Generate. Shit. Ich will kein Game of Life generaten, ich will Hello World generaten. Oui, Alok. Was für ein Ding. Ok, Leute, ich weiß noch nicht mal, was ich überhaupt installieren muss. Wasumpack. Get Wasumpack hier. Ja klar. Wie ich das mag. Erst mal schön reinpasten. Jaja, ganz bestimmt. Gibt's Wasumpack? Gibt's das hier? Wasumpack, da ist es doch, sehr schön. Wasumpack. Mach mal so ein Package Manager. Cargo Generate. Cargo Install, Cargo Generate. Ok, ich mach mal kurz ein neues Repo. Wobei, das installiert man wahrscheinlich einfach so, oder? Ach nee, jetzt mach ich's in meinem Heimatverzeichnis. Man hätte das, glaube ich, doch im Projekt machen sollen. Oder ist es jetzt global? Ich mach das einfach mal. NPM hab ich installiert. Ok, also Hello World. Was lädt er da eigentlich? Das ist ja fast schon schlimmer als bei NPM. Auf Cargo. Steht vor Schanghai rum. Kommt nicht rein. Warum soll ich? Was ist das eigentlich für ein bescheuertes Tutorial? Ich glaube, das machen wir doch nicht. Ich will doch kein Git Repo klonen von sonst wo. Ich will einfach mit einem simple Hallo Welt anfangen. Ok. Rust Web Assembly. Gibt's da ein besseres Tutorial? Introduction. Nee, das ist das gleiche. Gibt's ein Compiling from Rust? Ok, die Mozilla Dinger sind teilweise gar nicht schlecht. Was? Ach, das kann man auch über Cargo installieren. Warum schreiben die das nicht gleich? Oh, es kompiliert. Aho Korrasik wird kompiliert. Alles klar. Ich weiß sogar noch ungefähr, was das ist. Das war irgendeine String Match Library. Die gab es damals auch schon, wo ich mir Rust eingeschaut habe. Jetzt habe ich mir gemerkt, weil der Name so weird champ war. Es wird gerade wirklich das halbe Internet runtergeladen. Kann das sein? Ich weiß noch nicht, ob ich plötzlich Five Head bin. Das muss ich mal sehen. So, und dann macht man neues Cargo Projekt. Und dann macht man It Works. Ach du Scheiße, das ist ja richtiger Five Head Kram. Was für eine Leitung. 400 MBit drunter. Ich mache das einfach, wie Mozilla das sagt. Mozilla hat Ahnung. Auf, gib ihm. Ich kompiliere, ja, aber das soll man völlig schneller kompilieren. Single Threaded Compilation. Weird Champ. Okay, da brauchen wir anscheinend noch ein bisschen. Das ist. 33 Minuten. Das ist. Petalburg City aus Pokemon Omega Ruby und Alpha Sapphire. Alles klar. Jetzt weißt du Bescheid. Wie ist dein Workflow mit VMWare und der virtualen Maschine, die läuft? Hast du einfach ein extra Bildschirm? Nö. Mehrere Desktops. Oh, er ist fertig. Hab ich wahrscheinlich. Ne, hab ich nicht. Okay. Wo ist mein Path hier? Ich habe da schon ganz schön viel Müll drin. Okay, bin Cargo. Alles klar. Cargo. Generate. Alles klar, hat funktioniert. Sehr schön. Ups, jetzt habe ich meine Shell zugemacht. Also auf geht's. CD, Repos. Macht einen eigenen Ordner. Wenn ich Cargo New mache, macht er einen eigenen Ordner, der Hello Wasm heißt. Oder oder legt er das im aktuellen. Ach, in der Subdirector. Ja, steht doch da. Hello Wasm. Alles klar. So, dann öffnen wir das mal. Gucken, ob das Ding was taugt. Was ist denn die? Ich habe keine Ahnung. Das weiß ich auch jetzt nicht mehr. Ich habe wirklich keinen Schimmer mehr. Also, Repos. Hello Wasm. Nicht der Label-Champ. Cargo-Tommel. Auf geht's. Open Project. Trust. Wir trusten alles. Bei dem Hello World Project kann ich allzu viel falsch. Okay, was will der von mir jetzt? Genau. CMake? What the fuck? Oh no. Cargo fail. Warum? Warum? Cannot attach standard lip sources automatically. Okay, also muss ich doch Rust Up installieren. Meine Güte. Also, Rust Up. Ja, ist in Konflikt. Alles gut. Yes. Und wie stand das jetzt in der Anleitung? Setup Instruction. Okay. Der hier Rust Up. Und nu? Rust is managed by Rust Up to Rusta63. Blablabla. Rust Up. Und nu? Wie verwendet man das jetzt? Moment. Rust Up self uninstall? Das Ding kann sich selbst... Nee, Update lädt ja nichts Neues runter. Ich muss ihm wahrscheinlich sagen install oder sowas. Rust Up. Tool. Chain. Install. Stable. Wahrscheinlich wollen wir auch Stable haben. Vom 18.05. Ja, das ist ja noch nicht so lange her. Okay. Wunderbar. Stable x8664 unknown Linux GNU. Oh, allow me to interject for a moment. Es ist nicht Linux, es ist GNU Linux. Da ist es doch, Rust. Wunderbar. Auf geht's. Vielleicht geht's ja jetzt. Go installieren wir einfach? Das tatsächlich, ja. Das ist tatsächlich so. Go installieren ist easy. Wobei, ganz ehrlich, das Rumgefundene früher mit Go Pass war auch nicht schön. So, er hat's gecheckt. Code with me. Jetzt net. So, wie wär's mit Schrift ein bisschen größer machen? Und? Pack. Size 16. Immer noch zu klein. Hallo? 18. Es ist exellent. So, it works. Sehr schön. Da bin ich ja froh, dass es worked. Leute, was ist Standard? Was machen die ganzen Rust oder die ganzen Rust, wie Rust Crust Tachians? Alter, warum müssen sich die Leute bei jeder Programmiersprache irgendwie komische Namen geben? Vier spaces, acht spaces, zwei spaces, tabs, backspace only, reverse indentation, was machen die? Vier spaces, ist das Standard? Einrückung. So. Ja, was macht denn Cargo FMT standardmäßig? Format. So, okay. Also, auf geht's. It works. Wunderbarer Test. Bester. We won't use this test code at all, so go ahead and delete it. Gut, gut, dass wir das überhaupt haben. Ja. Let's write some Rust. Was im Bindgen? Was für ein Ding? Okay, das wird jetzt einfach, das wird knallhart copy pasted. Was im Bindgen? Was im das? Das bedeutet wahrscheinlich, was er, da kann man bestimmt auch Parameter übergeben oder so. Nee, kann man nicht. Das bedeutet wahrscheinlich, für was er JavaScript Bindings generieren soll. Sag mal, okay, okay, ich rate jetzt mal was. Das hier ist so was wie ein Import von JavaScript und das hier ist ein Export zu JavaScript. Vermute ich jetzt einfach mal. Muss ich irgendwelche Dependencies eintragen? Das steht hier aber gar nicht. Pifat. Using was im Bindgen to communicate. Okay. Calling external functions in JavaScript vom Rust. Okay. Das steht unten. Werden wir gleich sehen. Ich will jetzt wirklich mal ein minimales Hallo Welt produzieren. Ja, das hatten wir, das hatten wir doch hier gerade schon. Warum macht er dann eigentlich überhaupt eine Zeile draus und nicht zwei? Das interessiert ihn auch nicht. Compiling our code to WebAssembly. Okay. Cargo Tommel. Ja, Inni war gestern. Jason und Jaml ist auch out. Rust setzte von Anfang an auf Tommel. Das kann ich mir noch dran erinnern. Das ist quasi so Inni plus in etwas besser. So bla bla bla bla bla bla bla. Das brauchen wir alles nicht. Crate Type cdlib. Alles klar. Das weiß ich sofort Bescheid. Was im Bindgen Version 2? Muss es wirklich Version 2 sein oder kann es nicht einfach auch was neueres sein? Von wann ist denn das Tutorial? Was im Bindgen GitHub? Was sind die neueste Version davon? Okay. Installiert er wenn ich 2.0. Ja, der war so schlau. Cargo war nämlich ziemlich ziemlich nice. Da kann ich mich noch dunkel dran erinnern. Der installiert jetzt die letzte Zweier Version. Also 0 2 80 wahrscheinlich. Fill in your own repository GitHub bla bla bla bla bla. Okay. Was im Pack? Bild Target Web. Okay. Wenn das jetzt funktioniert, dann kacke ich aber eine Runde. Wie das funktioniert. Smiley face. Was im Package ist? Package ausschreiben war selbstverständlich kein Platz mehr. Das verstehe ich. Is ready to publish pkg. Hello wasm bg. Hello wasm bg. Guck mal sogar Typescript. Typescript support haben wir sogar. Okay. Was im Browser will ich das ausführen? Also im Endeffekt brauche ich wahrscheinlich jetzt irgendeine. Genau. Index HTML. Und dann muss man den Krempel hier machen. Alles klar. Dann machen wir das doch mal. Project. Okay. Ich glaube so ein bisschen HTML kannst du hier darin auch machen. So. Und. Das geht jetzt oder was? Das muss ich jetzt surfen. Gehe ich mal von außer ich brauche. Okay. Genau das. Ohne Scheiß. Genau das hätte ich auch gemacht. Genau das hatte ich auch gemacht. Make sure to use an up to date web server that supports application wasm. Alles klar. Application wasm. So und jetzt einfach starten da drin. Port 8000. Na dann. Schauen wir mal. Was da jetzt rauskommt bei. Localhost port 8000. Hello web. Das war einfach. Das war wirklich easy. So also wenn ich das jetzt richtig gesehen habe passiert jetzt folgendes. JavaScript. Also. Okay. Hier. Wir importieren unser WebAssembly Modul. Und rufen. Nachdem es geladen wurde. Mit. Ab artigster. Callback Syntax. Rufen wir jetzt hier unsere Funktion auf. In WebAssembly die dann wiederum eine JavaScript Funktion aufruft. Okay. Das ist ziemlich sinnloser durch die Brust ins Auge. Aber. Why not. Ja. Was ist der Vorteil davon. Dass du zum Beispiel C Libraries verwenden kannst und sowas. Im Browser. Das ist halt schon recht nice. Oder Rust Libraries. Hello wasm. Muss man. Da muss das nicht. Du kannst mit JavaScript mehr oder weniger alles machen was du brauchst. Aber zum Beispiel wenn du sowas wie FFM Pack im Browser haben willst dann kommste da dran nicht vorbei. Was es in Rust gibt was es in JavaScript nicht gibt. Zum Beispiel FFM Pack bindings. Im Browser funktionieren. Wenn du FFM Pack im Browser verwenden willst kannst du das mit JavaScript alleine ziemlich knicken. So. Jetzt versuchen wir mal es halbwegs sinnvolles zu machen. Schieben wir mal den Browser dahin. Ich meine es liefert immer das gleiche aus. Dann machen wir mal hier unten ein Terminal auf. Und. Was musste man nochmal machen. Wasm. Wasm. Build. Target. Web. Musste man machen. Okay. Also damit kompiliere ich den Krempel. Alles klar. So. Das heißt im Endeffekt ich mache jetzt mal dieses Alert daraus. Das braucht ja keiner. Print. Kann das auf die Konsole printen. Wahrscheinlich nicht oder. Kein Que. Das wird wahrscheinlich nicht funktionieren. Moment. Leute. Rust Semikolon oder kein Semikolon. Darf ich fragen was FFM Pack ist. FFM Pack. Wobei ich weiß gar nicht ob du das gefragt hast. Ja. FFM Pack. Es hat nichts mit Frankfurter Mind zu tun. Was ich meine ist FFM Pack. Das ist eine Multimedia Library. Die dir unter anderem erlaubt Streams zu empfangen. Anders zu encoden. Bilder zu extrahieren. Und nachdem das alles relativ low level ist kannst du da ganz abgedrehte Sachen machen. Du kannst zum Beispiel sagen. Ich empfange ein RTSP Stream von der Webcam. Und extrahiere mir jedes Bild. Also decode jedes Bild. Und dann mache ich alle 5 Sekunden ein Bild was ich beispielsweise als JPEG rendere und dann auch in der Webseite anzeige. Irgendwie sowas. Du kannst ganz wildes wildes Zeug machen mit FFM Pack. Ja vor allem. Vor allem als Decoder ist FFM Pack. Gut. Ich encode meine Videos übrigens auch mit FFM Pack. Aber gerade. Also was ich eigentlich hauptsächlich bisher verwendet hab immer. Und wo FFM Pack einfach best ever ist. Wenn du Videos decoden musst. Wir haben schon öfters in Streams mal H264 Streams decoded. Und da kannst du halt FFM Pack verwenden komplett. Vom empfangen über RTSP. Über das extrahieren von einzelnen Bildern und decoden. In normales. Nicht wirklich RGB. Aber ich sag jetzt mal RGB. Also FFM Pack ist extrem Pog G. Scheiße. Extrem Pog. Macht FFM Pack auch Audio. Macht auch Audio ja. Du kannst beispielsweise mit FFM Pack wenn du jetzt das nicht als Library verwenden willst. FFM Pack besteht ja auch aus einem ziemlich umfangreichen Command Line Tool. Kannst mit FFM Pack zum Beispiel sowas machen wie Videos kürzen ohne neu zu encoden oder Videos von TS in MP4 Container packen ohne neu zu encoden und sowas. Also FFM Pack ist wirklich nice. So. Jetzt wollen wir mal gucken ob Print. Ob Print geht. Ob es auf der Konsole dann rauskommt. Pfeilen und v. Ne. Ok. Also auf Konsole kann man nicht. Wie würde ich jetzt kon- Ok. Moment. Moment. Wenn ich den Kram doch importiere. Das wird nicht funktionieren oder? Rust. Import. Konsole. Log. Wasen. Ah. Beispiele. Konsole. Log. Pog. Der Chat weiß schon wieder Bescheid. Ok. Konsole. Konsole. Log. FN Log. Ach. So. Ah. Ok. Verstehe. Verstehe. Verstehe. Der Name Space. Was ist bloß das Problem jetzt? Ach. Extern. Extern muss ich machen. Ach. Hier haben sie es schon extern. Ah. Ok. Da kannst du dann so einen größeren Block dran machen. Aha. Ok. Ok. Verstehe. So. Das heißt ich kann jetzt von Representive Assembly auch was auf die Konsole loggen. Also Log. CacW. Bild. Und CacW kommt auf der Konsole raus. Ok. Das ist schon mal nice. Cute. Chat. Ah. Ja. Ja. Funktioniert. Sehr schön. Pog. Nice. Das ist gut. Bis jetzt habe ich alles verstanden. Das war zwar noch nicht viel, was wir gemacht haben, aber immerhin. Das spricht nicht für das. Kommentare sind eh overrated. Das sage ich ja auch immer. Guter Code dokumentiert sich selbst. Und wenn man dann auch fehlerfrei programmiert, braucht man auch keine Tests. Und spart sich Zeit und ist schneller fertig. Easy. Easy. Alles overrated, outdated, gebadet. Debugger und Breakpoints braucht auch keiner. Command Line. CLI. Konsole Log Debugging. Beste. So. Gut. So. Was können wir denn jetzt mal wirklich sinnvolles machen? Guck mal. Muss man diesen Krampel so Payneschampig aufrufen wie da? Ich möchte meinen. Eigentlich möchte ich das mit zwei Tabs Einrückung haben. Ich. Haltet. Haltet ihr mich für sehr. Cringe. Wenn ich mein HTML mit zwei Spaces Einrückung mag. Willst du jetzt Champ oder? Capsa ist zwei. Zwei. Hier. Da bin ich mir jetzt nicht sicher. Warum nicht auch zwei? Next. Format. Wie? Mich veräppeln. Alter, lüg halt nicht. Jetzt. Was ist das denn? Das scheint nicht zu funktionieren. Ach, das ist wahrscheinlich für JavaScript. Für JavaScript ist nochmal extra oder wie? Wahrscheinlich ist für JavaScript nochmal extra. So. Ja, genau. Wir wollen wir wollen auf jeden Fall das erwarten. Irgendwie wie auch immer genau. Also sprich. Gibt es eigentlich Top Level Await mittlerweile in JavaScript? Also. So was da. Wow, wow, wow. Ich will nichts kommenden. Ich will auskommen kommentieren. Geht Top Level Await wahrscheinlich nicht, oder? Quatsch, das ist ja hier. Oder doch? Oder doch? Wie ist denn standardmäßig in C-Line das? Ach Mensch, Shortcuts. Nee, wo geht das? Alter, warum ist das immer so versteckt? Short. Was muss ich noch mal gucken? Comment? Ich meine, so kann ich, ich meine, ich kann auch sagen Comment. Aber schön ist es nicht. So, jetzt muss ich mir am Kopf überlegen. JavaScript. Also das wäre dann quasi. Warte mal, nee. Ich würde einfach sagen Await in it. Und dann sage ich Creed. Das müsste doch funktionieren dann, wenn er ordentlich Awaited hat. Funktioniert auch. Ja, dann können wir uns dieses komische, dieses ekliche Callback Zeug sparen. Okay, nice. Also. So, jetzt lass mal in mich gehen. Was könnte man dann irgendwie Sinnvolles machen da jetzt? Was sagt denn das Mozilla Tutorial weiter? So ein bisschen üben. Ja, also Konsolok funktioniert Marco rules Konzo. Alter, das nimmt ja fast C++ Ausmaße an mittlerweile. Was ist denn das? Was bin ich sehend? Das erinnert mich ja wirklich fast schon ein bisschen an C++ Template, wenn ich sowas hier sehe. Was ist das? Was macht das? Was tut es? Es ist ein Template Argument, Funktionen und Lock. Ist das, dass man beliebig viele Argumente locken kann? Ist das, dass man möglichst viele? Next, let's define a Marco like this. Only it works for console lock. Okay, das brauche ich nicht. Das tut auch so. Let JS JS value 4 into. Alter, jetzt wird es aber. JS value. Wo kommt denn das her? Ist das standardmäßig hier einfach verfügbar? Let JS value. Okay, da kann ich quasi direkt JavaScript Variablen anlegen oder sowas. Okay, dann müssen wir mal probieren, wie man Return Werte von Konsolen macht. Also sprich, wie kriege ich einen Return Wert hier von zurück nach JavaScript? Ich glaube nämlich, wenn ich später mal tatsächlich es hinbekomme, FFmpeg zu verwenden und Bild decoded habe. So, und da kann man jetzt sagen Log. Wobei das das geht jetzt ja nicht, oder? Wenn ich sage JS. Das ist ja kein String. Das mag er ja nicht. Dann brauche ich dann brauche ich doch den Moment. Was macht er hier? Into into was? Boah, Alter, die die Rastzündung ist schon krasser Shit. Lock 2. Ach nee, Using Web Sus. Ach so. Warte, das gibt es schon. Ja, warum habe ich das denn dann überhaupt selbst gemacht? Ups. Muss das Krait noch installieren? Use of Undeclared Krait. Aha. Das heißt, das muss ich erst in meine. Tommelfile schreiben. Benutzt einfach was im Logger zum Logger. Was im Logger? Was im Logger Krait Github. Mach ich. Welches davon ist es denn? GitLab, MonkaS. Leute hosten wirklich jetzt auf GitLab. Zwei Jahre ago. Nee. Das will man wahrscheinlich nicht, oder? Zwei Jahre. Und das ist das ist noch älter. Will man das? Und was war das andere, was die hier hatten? Web Sus Console. Web Sus Console. Was ich noch nicht ganz gecheckt habe, ist, Leute, wie installiere ich was? Also da kann ich mich nicht mehr dran erinnern. Ja, man kann das hier in seine Cargo Datei schreiben. Aber woher weiß ich denn welche Versionen und so? Kann ich nicht einfach immer sagen? Gibt es nicht wie bei NPM beispielsweise ein Cargo install für die letzte Version? Krait's I.O. OK. Gratis Punkt. Da kann ich mich noch dran erinnern. Web Sus Console. Das heißt aber ganz anders, woher weiß ich denn jetzt, dass es das ist? Web Sus. Ach nee, das brauche ich wahrscheinlich. Das brauche ich wahrscheinlich. Web Sus brauche ich wohl. OK, also sprich, das muss ich in meinen Cargo schreiben. Am besten schreibe ich doch so, oder? Da mache ich immer die neueste 3er Version rein. Ah, jetzt ergibt es schon. No Console. OK. Klick auf die Kiste daneben. Was? Welche Kiste? Den C-Line? Ach hier. Ah, das ist ja cool. OK, nice. Console. Warum gibt es das jetzt angeblich nicht? Und warum kriege ich kein Autocomplete davon? Tja, so einfach ist das nicht. Ähm, ja und du? No Console in root. Was soll mir das jetzt sagen? Da steht es doch, dass es das gibt. Und vor allem, warum gibt es kein Autocomplete? Muss man das oben importieren vielleicht? Irgendwie da? OK, das triggert mich schon wieder. Warum funktioniert das nicht, obwohl das eindeutig so da steht? Und warum kriege ich kein Autocomplete dafür? Ich hab das bei mir drinne stehen. Features gleich Console. Wo steht das denn? Aha. Und woher weiß man das jetzt? Console. Wohin soll man das wissen? Also. Features. Console. OK. What? Alter, was will das von mir? Das muss in eine eigene Dependency. OK, ich copy paste das jetzt einfach aus dem Chat. Das ist sowas. OK, da wäre ich ohne euch nicht drauf gekommen. Keine Ahnung. Alter, wo ist denn das Problem, was will das von mir? Warum ist das angeklärt? Ach so, weil ich es rausgeschmissen habe. Ich habe nichts gesagt. Kriege ich denn jetzt? Kriege ich jetzt Autocomplete? Ach, jetzt kriege ich Console. OK. Ah, das ist doch schon besser. Jetzt funktioniert es. OK, jetzt können wir wirklich auch Zeug loggen. Das ist schon mal nicht verkehrt. OK, also, wie macht man Return Werte? Da muss ich jetzt mal schauen. Also, haben die das hier drinnen stehen? Nee, aber wie macht man Return Werte? Also quasi, das nennen wir jetzt nicht Creed. Das nennen wir jetzt irgendwie Pog. Return Pog. Heißt das? So, und wir machen mal was einfaches. Wenn ich das jetzt noch richtig in Erinnerung habe, musste man doch Return Code in Rust irgendwie so machen. Ibi32 oder so. Ja, so ging das. Hab ich noch im Hinterkopf, dass das irgendwie so funktioniert hat. OK, so, jetzt wird das hier abkacken, weil es gibt es nicht. Und wir rufen jetzt nicht Creed auf, sondern Return... Oh, guck mal, sogar Autokomplete im HTML. Das ist cool. Return Pog. So, Return Pog. Brauchen wir eigentlich gar kein String übergeben. Return Pog kriegt einfach nur Return Wert von 1. OK, und jetzt? Let E gleich? Nee, so einfach wird das nicht sein, oder? So einfach wird das doch nicht sein. Doch. Tatsächlich. Chat bisschen höher. Ja, ja, ja, hast recht. Ich mach den Chat oben rechts hin. Oben rechts ist ja sonst nichts Wichtiges. Hier oben, das muss man glaube ich nicht sehen. Wobei doch, da ist es über dem Browser. Oben links? Wo braucht man einen Chat gerade am wenigsten? Gar keinen Chat, nee. Nein, nein, wir plätten den Chat nicht aus. Der Chat ist Pog. Direkt über die Katze? Ich weiß, was ich mache. Der Chat bleibt hier unter Chico. Wie habe ich den Chat sonst immer so hier, glaube ich. Und wir machen was anderes. Wir machen was anderes. Ach, Quatsch. Moment, das muss ich so machen. Wir machen einfach so, guck mal. Nur kurz schauen, ob das jetzt hinhaut. Und da unten, zur Entspannung, kann Chico Fische fangen. Das reicht von der Quatsch. Kann Chico Fische fangen. Sehr gut. Alles klar. So, weiter im Text. Okay, Inns sind tatsächlich relativ einfach. Wie returnt man einen String? Ich erinnere mich, das war in Rust generell ein bisschen painstamp mit Returnwerten, weil du musstest immer sagen, returnst du eine Referenz, returnst du quasi das Ownership oder nur, nur, nur, wird das nur ausgeborgt oder sonst was. Das ist ganz kompliziert gewesen. Also einfach nur String geht wahrscheinlich nicht, weil String immer eine Referenz ist oder warum ist das so? Ich kann mich noch dran erinnern, in Rust gab es auch sowas. Da habe ich, da habe ich aber dann damals aus, bin ich damals ausgestiegen. Keine Ahnung, was das macht. Das ist irgendwas für Lifetime. Fail to execute. Jetzt geht's schon los. Jetzt geht's schon los. Und warum? Error. Ach, weil dann ein Warning an ist oder was? Das ist ja schon fast, das nimmt ja schon fast Go Ausmaße an. Ne, das will ich ausschalten. Wie macht man solche Flags aus? One unused defaults, bloß nicht. Das erinnert mich fast an Go-Generfe. Ja, wie macht man das? Ok, Agnus, disable Rust. Allow dead code klingt gut. Das ist das schönste. Ok, das geht schon mal nicht. Compiling your create to WebAssembly failed. Weil cannot return borrowed ref. Ok, das ist jetzt diese typische Rust Geschichte. Rust ist äußerst korrekt darin, wenn du Sachen machst, die out of scope gehen können. Weil es ist jetzt ja so, ich returne hier eine Referenz zu einem String. Aber sobald ich hier rausgehe, ist der String ja eigentlich schon wieder gelöscht. Das heißt, ich returne eigentlich was, was es gar nicht geben sollte. Kann man einfach String machen? Geht sowas? Ne, oder? Ok, jetzt hab ich keine Ahnung, wie ich den String returne. Ehrlich gesagt, sodass es funktioniert. Rust String. Ich hab wirklich keine Ahnung, wie es funktioniert. Ich erinnere mich dran, man musste glaube ich String new oder sowas machen, oder? String from? Sowas muss man glaube ich machen. Oder new? Irgendwie sowas war das doch, oder? Wie gesagt, ich hab Rust vor Jahren mal gemacht, oder? From? Oder into String? Ne. Und jetzt keine Referenz, sondern direkt in String, oder wie, oder was, oder wo? Aha, nein. Das geht auch nicht. Method not found in Static String. Das stimmt, Patrick, das ist wirklich so, true String. Ok, das hat jetzt funktioniert. Ich hab keine Ahnung, was der Unterschied ist zwischen... Ah, das eine ist bloß eine Referenz oder so? Ne. Hä? Ok, das eine gibt ein Box String und das andere gibt ein String. Alles klar. Ok, also Strings hin und her geht auch relativ einfach. So, jetzt, jetzt... Also, die Sache ist die, wenn wir irgendwie mal... Raw Daten returnen wollen, brauchen wir einen Byte Array. Ähm, wann war das? Let? Das war auch Let. Let Mut? Boah, mein Rust ist lange her. Und jetzt U8? Ne. U8? Ach du große Güte, was ist denn das? Hardware Instructions? Ne. Also, also. Byte Array Rust. Ich hab keine Ahnung. Ich mein, das heißt einfach Byte Array? Wirklich? Ne, das ist, das ist irgendein, das ist irgendein Create. How do I create an empty Byte Array? Genau das will ich wissen. Weg, weg war's. Ich erinnere mich wieder. Wobei, ne, ne. Byte Array, ach so war die, war die Array sonntags. Wie nimmst du Underscore Result? Ne. Okay, also das ist ein I32. Und konnte man das an U8 oder so hinten dran machen? Ja, genau. So, das ist jetzt ein Byte Array mit 24 Stellen. Das ist doch richtig so, ne? So, okay. Mutable muss es nicht sein. Und das kann ich jetzt aber höchstwahrscheinlich nicht einfach so return. Ist das hier der return Wert? Ne. Okay. How to return a Byte Array. Rust. How return Byte Array. Ach, muss man, muss man. Und U8 ist es. Ah. Aber Und U8 kann doch nicht funktionieren, weil sobald das hier aus dem Scope geht, und das geht hier aus dem Scope beim return, ist es doch undify, das erlauben die mir doch garantiert nicht. Das geht mit Vektors, geht das wahrscheinlich. Okay, das funktioniert. Okay. Und die Rust-Logik ist jetzt folgendes. Solange ich keine Referenz returne, ist das okay, weil dann returne ich ja Ownership zum Aufrufer von diesem Ding. Also quasi, dass der Aufrufer übernimmt das dann quasi. Ich, wie gesagt, ich hab Verurteil... Ach, fick dich, Alter. Was willst du denn? Oh. Das funktioniert nicht. Okay. Das kann man nicht returnen. Das muss man irgendwie anders machen. Kann man den Vektor returnen? Wahrscheinlich auch nicht. Äh. Moment, wie ging das nochmal? Weg. Einfach weg, Ausrufezeichen. Und jetzt ist er leer, oder? Leerer Vektor? Ne. Eins. Konnte man sowas machen? Eins. U8. Oh. So, und jetzt muss ich was returnen? Into? Rockslice. Alter, das ist so ein Fiveheader-Kram, diese Sprache, ist der Wahnsinn. Äh, und jetzt müssen wir wahrscheinlich einen Vektor returnen. Wobei, mit einem Vektor kann ja JavaScript nichts anfangen. Das kann ja, das kann ja eigentlich gar nicht funktionieren. Doch, das geht. Ah. Der macht da gleich einen kompatiblen JavaScript-Typ draus. Der macht ein U8-Array draus. Das ist, das ist sehr gut. Das ist sehr gut, dass der das macht. Weil so kriege ich mein Zeug von FFmpeg, die codet in Frames, auch zurück nach JavaScript. Okay, das ist Fiveheader-Time. Das ist cool, dass sie das unter der Haube machen. Ich stelle mir vor, wenn man das von Hand machen muss, ist eklig. Ich stelle mir vor, wenn man das von Hand machen muss, ist eklig. Das können wir jetzt theoretisch sogar auslesen. Kann man sagen, keine Ahnung. I, 0, das sollte 1 sein. Ja, ist 1, passt. Sehr cool, das ist nice. Dein Returnvent muss den Into Wasom Abitrade implementieren. Ich hoffe, dass alles, das schon standardmäßig, was ich brauche, drin ist. Okay, das ist tatsächlich äußerst spannend. Das finde ich cool. Ich will jetzt nicht gleich mit FFmpeg hier draufhauen, weil FFmpeg ist eigentlich das, was ich ausprobieren will. Weil ich gehe davon aus, wir werden noch ganz viele Probleme rennen, um überhaupt FFmpeg zum Laufen zu bekommen. Man kann es ja mal probieren. Direkt nach dem Hallo Welt und Print 1 gleich mal FFmpeg included und auf geht's. Ich meine, warum nicht? Scheiß drauf. Was soll FFmpeg überhaupt machen? Also, ich, wartet mal. Also ich habe mir folgendes überlegt, rein um sich mal ein bisschen mit Rust und WebAssembly zu beschäftigen. Wir haben noch den EPG-Champ programmiert. Allerdings, also ich will das nicht releasemäßig in den EPG-Champ einbauen. Wer den EPG-Champ nicht kann, ich zeige den EPG-Champ nochmal. Das ist ein Webfrontend für TV-Headend, dass man auch ordentlich auf dem Tablet und überall sein EPG angucken kann. So, und ich habe mir jetzt gedacht, und wie gesagt, nicht releasefertig einbauen. Man könnte doch beispielsweise einbauen, dass man sich ein Video streamen kann von TV-Headend. Das geht standardmäßig schon. FFmpeg kann das auf TV-Headend-Server-Seite transcoden für ein. Weil der Browser kann ja kein mpeg2h263, ist das glaube ich dann. Der Vorgänger von H264. Also das, was man heute so zum größten Teil des Videos hat. Das können Browser nicht. Und deswegen habe ich mir gedacht, warum Server-seitig machen, wenn ich mir das Video schicken lassen kann und on the fly mit FFmpeg im Browser transcoden kann. Nicht, dass das irgendwie produktionsreif mal werden würde. Aber mich interessiert einfach, ob das performanstechnisch möglich wäre. Also kann man mit FFmpeg im Browser ein SD-Video, also PAL hat ja nur 720x580 oder sowas. Ich brauche was im FFmpeg. Richtig. Und von der Idee her würde ich es dann so machen. Du lässt dir von einem Endpunkt, von einem Web-Server-Endpunkt streamen mir das Video-File runter. Übergebe das häppchenweise an FFmpeg in Wasm und krieg einen decodeten Frame zurück. Soweit die Idee. Das hört sich jetzt abstrakt gesehen relativ easy an. Aber ich glaube praktisch ist das durchaus ziemlicher Abfuck und gar nicht so easy, wenn man sich das vorstellt. Das heißt mein Ziel wäre jetzt erst mal zwischenzeitlich, ob ich überhaupt FFmpeg eingebunden kriege und ob ich vielleicht ein Test-Bild aus FFmpeg raus bekomme. FFmpeg kann ja Test-Bilder generieren, da brauche ich keinen Input. RGB, RGB, Test-Bilder. Also guckt, FFmpeg kann FFmpeg Generate, Test, Test-Pattern, Test-Pattern. Ja ne, ne, das ist besser. Oh fuck, das musst du mit Filter machen. Mit Filter ist schonmal eklig. Filter will man eigentlich nicht, nicht. Ja, da kommt so ein Test-Bild raus. Oder wir nehmen einfach, wir nehmen einfach einen PNG oder irgendwas. Irgendwie etwas. Aber wie kriegen wir denn jetzt überhaupt FFmpeg? Rust da rein. Safe FFmpeg Wrapper, das brauchen wir nicht. Simple and Safe Rust Interface, das brauchen wir schon eher. Rust AC FFmpeg. Also ich brauch was, wo ich wirklich Raw Zugriff auf FFmpeg habe. Und zwar Wasm. Nicht einfach nur Rust FFmpeg, Rust Wasm FFmpeg. Rust FFmpeg Wasi, das klingt doch schonmal gut. Letztes Jahr reicht mir immer noch. FFmpeg Libraries pre-compiled for WebAssembly Wasi als... Ach du Scheiße, ich hab keine Ahnung. Null? Ey, das klappt doch im Leben nicht. Das klappt doch im Leben nicht. MonkaS Ist das... Source AV Codec RS Geh auf. Okay, das sieht nach... Das sieht nach FFmpeg aus. Das sieht nach FFmpeg aus, ja. Alter, der hat sich aber einer Mühe gegeben. Ich mach das jetzt einfach rein, ich hab keine Ahnung, was ich da treibe. Weil mein Ziel ist eigentlich wirklich, ich will FFmpeg reinkriegen. Ne, so. Version 0, alles klar. Bild. Das kackt wahrscheinlich schon beim Bild ab gleich. Ne, ne, ne. Help. Convert identifier to snake case. Aha, okay. Also, Rust Style ist nicht Return Pog, sondern Return Pog. So macht man das, so machen das also die coolen Rust-Leute. Snake Case. Nicht Pascal, nicht Kebab Case, Snake Case. Return Pog. Noch funktioniert's, noch geht's, alles gut. Okay, und wie würd ich jetzt... Okay, ich hab keine Ahnung, wie ich FFmpeg verwenden würde. So, immer include und gucken, ob's immer noch kompiliert. Nein. Unknown Instruction Block. Na, geil. Ich glaub, das kann ich vergessen. Ich mein, ist ja auch geil. Die Fehlermeldung ist jetzt nicht so das geilste, oder? Rust Backtrace 1. What the fuck? Rust Begin Unwind. Okay, also... Das funktioniert nicht. AV Codec brauch ich, wenn überhaupt. Nee, Leute, also FFmpeg krieg ich da nicht so einfach rein, wie ich mir das gedacht hab. Hat irgendjemand einen Plan, was ich jetzt überhaupt gucken könnte, wo der Fehler ist? Ich glaub, man hat einfach gelitten, hör. Exited Status Code 101, super, da weiß man Bescheid. X Autist Prime, Dankeschön für den Sub. Nee, das kannst du vergessen, sobald ich diesen Krempel hier einbinde, dann ist... dann kackt der ab. Ohne geht's. Issues, Closed. Document Build Process. Ich hab legit keine Ahnung, was ich machen soll. Gibt auch FFmpeg was im Jahr, das bringt mir aber nichts. Das ist quasi der Kommandozahlen-Rapper. Ich brauch Low-Level-Access, oder hat FFmpeg was im wirklich Low-Level-Access, dass ich sagen kann, ich will AV-Packages haben und sowas? Ich glaube nicht, das ist das Kommandozahlen-Tool gerappt. Also das hab ich mir nämlich letztes Mal auf dem Handy angeguckt. Es gibt zwei Sachen, es gibt FFmpeg was im und es gibt noch ein anderes Projekt. Und die machen dann bloß so Sachen, wie zum Beispiel sowas hier, die quasi aufrufen von der FFmpeg Kommandozahlen-Dings und... Das will ich nicht. Okay, also dieser Krempel funktioniert, also schauen wir mal nicht. Rust FFmpeg war so... Da find ich bloß das. Das sagt. Okay, dann weiß ich nicht, was ich jetzt machen soll. Ich mein, das ist ja komplett nichts sagen, vor 15 Monaten irgendwann mal aktualisiert. Das geht wahrscheinlich einfach in der aktuellen Rust-Version schon gar nicht mehr. Sobald ich das einbinde, ist F angesagt. Kann er nicht, kann er nicht binden. Und ich mein, ich hab das gemacht, was der Typ geschrieben hat. Exakt das eingetragen. Geht nicht. Tja. Dann wird das mit irgendwelchen FFmpeg Sachen heute schon mal erst nichts. Unknown Instruction Block. Wirklich, keine Ahnung, keine Ahnung. Das wäre aber auch zu schön gewesen, wenn das einfach funktioniert hätte. Schau mal die Fehlermeldung näher. Es gibt keine wirkliche Fehlermeldung zu googlen. Das ist alles so Generic Zeugs, wo du nichts mit wirklich anfangen kannst. Ja. Ja gut, ich hab es halt rausgeschmissen. Naja. Aber von der Idee her wäre ja jeder Krempel drinnen gewesen, den ich haben will. AV Packet. Genau, diesen Krempel will ich haben. AV Packet zum Beispiel. AV Packet und dann will ich den Stream lesen und sonst was. Ja, keine Ahnung, wie das funktioniert. Es gibt ja auch, es gibt ja anscheinend auch keine ordentlichen Anleitungen dafür. Wir können mal suchen, ob wir dazu was finden. Docs, ES. Usage. Tja. Normalerweise muss man auch sowas wie FFM Pack. Load. Gibt es aber nicht. FFM Pack. Load. New AV Package. Ne, das geht ja nicht. Normalerweise machst du AV Packet, A-Log und so Dinger. Wobei das Rustbindings sind, wer weiß wie das funktioniert. Call unsafe function requires unsafe function. Alles klar, unsafe. Ne. Unsafe. Unsafe. Aha, einfach mal geraten, wo das unsafe hin muss. Ne. Aha, das geht nicht. Aha, aha. Das müsste ich dann rappen in irgendeine Rust Funktion oder so. Aber ganz ervernehmt, es kompiliert ja eh nicht. Also, kann ich jetzt sagen, quasi FM. Hat es kein Makro oder so für die IDE? FM. CACW. Eigentlich egal, weil es funktioniert nicht. Unsafe. Unsafe. Ok, wie gesagt, es funktioniert nicht. Wo ist das Problem? Warum könnte er das nicht mal aufrufen? Ah, call to unsafe. Ok, das ist nicht winzig sharp. Das einmal unsafe reicht und das zieht quasi unsafe mit. Ok, das würde funktionieren. Ne, also das funktioniert nicht. Funktioniert anscheinend, ja. Ja, aber du musst unsafe verwenden, wenn du raw ffmpeg verwenden willst. Aber ganz ervernehmt, es funktioniert ja eh nicht. Er ist der Meinung, äh, ja, panicked. Block. Und man findet dazu auch nichts. Wasm. Und ansonsten, es gibt da keine README dazu. Das ist halt sehr... Ok, Rust, ffmpeg, github. Ich will keinen safe wrapper haben. Wasm. Äh, ich... Es wird nichts großartig gebastelt. Ich versuche mir gerade Rust mit WebAssembly anzugucken. Also irgendwann mal will ich... Kann man Features hinzufügen vielleicht? Irgendwann mal will ich ffmpeg ausprobieren im Browser damit. Aber das ist nicht wirklich Ziel. Ich hab' bloß gedacht, es ist einfach. Package einbinden und es geht. Aber so einfach ist es nicht. Also ich hab' keine Ahnung, wie man das bildet. Kann man jetzt aber... Rates? Was ist, wenn man da jetzt mal nach Web... nach, ähm... ffmpeg sucht? ffmpeg. ffmpeg. Ja, die bräuchte ich, aber ich brauch das für die WebAssembly Version. Du hast dein Browser zugemacht. Nee, du hast irgendeine Electron Anwendung zugemacht. Wasm. Wasi. Wasi? Da gibt's nur eins. Ja, das sucked. Okay, das funktioniert nicht. Es war Java, war es. Okay. Ja, also wie der Shit funktioniert, weiß man nicht. Document Build Process closed. Okay. Was zum... Es ist einfach ein Link. Random auf irgendwas. Was ist... Was ist zig? Will der Typ uns irgendeinen Crypto-Miner-Dingsen, oder was? Geile Bild-Documentation. Ganz, ganz grandios, ja. Da weiß man Bescheid. Bild zig. Mhm. Super. Jetzt versteh ich alles. Was zum... Ich hab keine Ahnung, was der Typ will. Okay, das ist mir zu pfeifert. Ich glaub, das ist nicht so sinnvoll, damit anzufangen. Das ist mir zu hoch. Wir machen erst mal zum Üben ein bisschen was anderes. Kein Schimmer, wie das funktionieren soll. Ich mein, er schreibt ja explizit, ich muss es nicht kompilieren. Es ist schon fertig. Aber das ist anscheinend nicht so. Hat da nicht mal irgendeiner einen Blogpost oder so zugeschrieben? Alter, wir verwenden hier wieder ganz obskure Dinger. Dank Dennis weiß bestimmt Bescheid. Nee, also mit FFM Back wird das so und auf die andere Weise nix. Chat, jemand eine gute Idee, was wir ausprobieren könnten? Was könnte man in Rust laufen lassen und dann im Process... Wie ist das denn? Moment, ich hab eine Idee. Wie ist das denn mit Multithreading? Wie ist das denn mit Multithreading in Rust und in... Das wird doch nicht funktionieren, oder? Also ich werde doch nicht irgendwas Multithreading können und dann... Damit irgendwie JavaScript mit JavaScript interagieren. Oder geht das? Rust, Wasm, Multithreading. Multithreading, Rust und Wasm. Okay. MonkaS. Alter. Okay, das ist advanceder Shit. Das ist einfach alles so krasser Fiveheader Kram. Ja, alles klar, alles klar, easy. Kein Ding, ja. Raytracing Demo. Helps you create and execute webworkers based threads. Okay, ja, nice. Nee, Webworkers kann ich auch so machen. Okay, ich glaube Multithreading ist keine allzu gute Idee. Ja, ich dachte man könnte aber das... Also man hätte ja das Rendern im Hintergrund machen können. Also das Video rendern, also das Video transconen. Ja Leute, ich weiß jetzt gar nicht, was ich gescheit machen soll. Ich meine, das mit FFmpeg funktioniert nicht. Ich brauche irgendwie einen Mini-Anwendungscase so. Irgendwas kleines, wo man ein bisschen basteln könnte. Was gibt denn diese Mozilla Anleitung noch her? Einfach mal Raytracing selber machen, ja, easy. Gibt es vielleicht einen Rust-Decoder? Da brauche ich kein FFmpeg. Vier Jahre. Der To-Do-App ist da glaube ich nicht das Richtige. Oh nee, dann lieber FFmpeg. In FFmpeg weiß ich, wie der Kram funktioniert. Leute, ich habe keine Ahnung, was ich machen soll. Okay, gibt es? Wie gesagt, To-Do-App, Ich muss mal gucken, was die Mozilla Anleitung macht. Nee, das ist... Ach, das war so ein Pac-Da-Projekt. Ja, vielleicht steht da irgendwas interessantes drin, was man ausprobieren könnte. Wobei Examples Hello World... What? Ja, das haben wir schon gemacht. Flashbang sei der. Ja, die Anleitung haben wir schon durchgemacht. Google in Dark Mode, Pog. Leute, mir fällt gerade wirklich nichts ein, als Anwendung. Das war jetzt ausnahmsweise mal echt so. Ich habe mich absolut gar nicht darauf vorbereitet. Ich habe gedacht, wir basteln einfach ein bisschen. Aber ich weiß echt nicht, was ich basteln soll. Ich meine, wir haben Sachen returned. Das ist garantiert nur ein ganz kleiner Bruchteil von dem, was man machen muss. Aber es fehlt gerade so eine kreative Eingebung, was wir ausprobieren könnten. Ich meine, wir haben Bites returned. Und das funktioniert erstaunlich gut. Was kann Rust WebAssembly besser als JavaScript? Ich muss fragen, was WebAssembly besser kann. WebAssembly ist ja quasi das Target, in das du übersetzt. Also egal, ob das jetzt von C++ oder von Rust oder von sonst wo aus ist. Das ist quasi eine Zwei-Mobility-Runtime, kann man das nicht nennen. Das hat sich seit ein paar Jahren etabliert im Browser als JavaScript-Alternative. Allerdings weniger, um JavaScript abzulösen. Sondern eher als Compiled-Target für andere Programmiersprachen. Das heißt, du kannst C++ nehmen, nach WebAssembly übersetzen und im Browser laufen lassen. Dementsprechend kannst du auch C++-Libraries verwenden. Crypto-Minor zum Beispiel. Deswegen kannst du auch C++-Libraries verwenden oder Rust-Libraries verwenden. Ich will mir jetzt nicht WebAssembly in C++ noch angucken. Da dreh ich am Rat. Nur mal just for fun. Was im Tutorial. So, und nachdem du quasi jetzt eine eigene Low-Level-Sprache im Browser hast, von der du, also in die du kompilieren kannst, von anderen Sprachen aus, kannst du halt mehr oder weniger fast alles im Browser laufen lassen. Ich meine, du hast immer noch Beschränkungen, nämlich das, was Browsern nicht erlauben. Also zum Beispiel, du kannst es nicht einfach in TCP-Socket aufmachen und sagen, ich lausche da jetzt mal auf neue Requests und sowas. Das funktioniert nicht. Weil das geht alleine durch die Browser-Sandbox nicht. Zu Recht, weil ansonsten hättest du ganz andere Probleme. Oder aufs lokale Filesystem zugreifen oder so. Das funktioniert nicht. Was im Tutorial. Oh nee, nein Leute, ich mach garantiert kein C++ jetzt. Das fängt schon äußerst Paynes-Champi an. Wenn ich das schon sehe. Linux-Könnel in Wasm. Mich würd's nicht wundern, wenn einer irgendeinen Mini-Mini-Könnel in Wasm schon übersetzt hätte. Ich meine, das ist reines C, das sollte wahrscheinlich sogar irgendwie funktionieren. GC, Wasm und FFmpeg. Also du brauchst FFmpeg auf jeden Fall. Also mit meinen x86 FFmpeg Libraries kommt man hier glaube ich nicht weit. Ich glaube, man braucht wirklich dann eine Web-Assembly FFmpeg-Lib, dass ich die ansprechen kann und ich weiß nicht, ob es sowas gibt. Also Windows 98 könnte ich mir vorstellen, dass es das gibt. Die Grafik-Ausgabe kannst du halt nicht in Web-Assembly machen. Das ist Browser, das ist JavaScript. Es gibt FFmpeg Wasm, ich weiß, aber was genau soll mir das bringen? Das ist ein Command-Line, das ist das FFmpeg Command-Line-Tool. Es sei denn, es gab noch zwei. Es gibt FFmpeg Wasm und FFmpeg JS. Genau. Es sei denn, die erlauben einem irgendwie auf die internen Sachen zuzugreifen. Das glaube ich aber halt nicht. Das ist doch garantiert nicht der Source. Wo ist denn der Source? Äh, hier. Den Port? Wo ist denn der Source-Code für FFmpeg Wasm? Nein, das ist es ja nicht. Hier. Get Create FFmpeg Core. Patch? Ja, wo ist es denn? Also hier ist es nicht. Der FFmpeg Source-Code ist ein bisschen größer. FFmpeg Core JS Ist das ein eigenes Projekt vielleicht? Ach, kommt mal hier. Das ist eine gute Sache. Ach, hier. Aber das kann man nicht in WebAssembly direkt verwenden, oder? FFmpeg Wasm Core Where we transpiled C++-Code of FFmpeg to Java. Why? Specify Media-File. Wenn ich Bild-Files in C++ schon sehe, drehe ich am Rad wieder. Alter. Ich meine, vielleicht. Ich meine, das wird theoretisch mit Rust auch alles funktionieren, ne? Aber... Nee, das Übersetzen wird da nicht funktionieren. Okay Leute, ich habe legit keine Ahnung. Also das mit FFmpeg taugt wahrscheinlich erstmal so nicht. Ich muss mir irgendwas überlegen. Ich habe heute keine Idee, was wir machen können. Das müssen wir verschieben. Weil ja, so PASIC-Sachen gehen, aber der Teufel liegt da im Detail. Also man muss bestimmt vieles machen, wovon ich jetzt auch keine Ahnung habe. Aber auch dadurch, dass ich keine Ahnung habe und ich weiß, was es ist. Wasm Game of Life. Nee, ich weiß, das ist das Tutorial davon. Das muss ich mir mal überlegen. Fallback auf zweite Stream-Idee. Nee, Fallback auf, ich gehe jetzt aufs Klo. Müssen wir alle mal weitermachen, keine Ahnung. Fällt mir gerade nichts zu ein. Wir machen morgen weiter. Also wir machen morgen vielleicht was anderes. Also zu dieser WebAssembly-Geschichte muss ich mir erst ein Anwendungsbeispiel überlegen, dass wir was Gescheites machen können. Das kann ich jetzt nicht aus dem Ärmel schütteln. Nee, das hat nicht funktioniert, Leute. Kann ich immer klappen. Ich gehe jetzt auf. Wir gucken uns heute auch keine Videos an. Wir sehen uns im nächsten Stream. Macht's gut. CO.", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss."}, {"id": 3, "start": 60.0, "end": 65.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder."}, {"id": 4, "start": 90.0, "end": 95.0, "text": "So, da bin ich. Heute brauchen wir noch so 10 Minuten oder so, ich muss erst mal in Bastelstimmung kommen."}, {"id": 5, "start": 95.0, "end": 110.0, "text": "So, da bin ich. Heute brauchen wir noch so 10 Minuten oder so, ich muss erst mal in Bastelstimmung kommen."}, {"id": 6, "start": 110.0, "end": 123.0, "text": "Und war es auf der Arbeit wieder ein bisschen nervig. Und danach habe ich Sport gemacht, also ich bin noch nicht so wirklich komplett in Bastelstimmung."}, {"id": 7, "start": 123.0, "end": 131.0, "text": "Aber das wird sich wahrscheinlich demnächst ergeben, hoffe ich mal. Habt ihr irgendwas Spannendes heute gemacht?"}, {"id": 8, "start": 131.0, "end": 141.0, "text": "Gibt es irgendwelche wichtigen, interessanten Neuigkeiten? Ich habe gesehen, Game Awards sind, es könnte mich kaum was weniger interessieren gerade."}, {"id": 9, "start": 141.0, "end": 147.0, "text": "Game Awards haben mich ehrlich gesagt noch nie interessiert."}, {"id": 10, "start": 147.0, "end": 158.0, "text": "Es gab mal eine Zeit, da habe ich total drauf gebrannt, neue Ankündigungen zu haben von Games, sei es irgendwelche Pressekonferenzen oder was vorgestellt wurde."}, {"id": 11, "start": 158.0, "end": 164.0, "text": "Aber nachdem das alles mittlerweile so lame und overhyped ist, bis auf ein paar Sachen, mache ich die meisten."}, {"id": 12, "start": 164.0, "end": 172.0, "text": "Gestern habe ich auch nicht geguckt. Ich lese mir einfach Zusammenfassungen durch und gut ist."}, {"id": 13, "start": 172.0, "end": 175.0, "text": "Tja, siehste."}, {"id": 14, "start": 175.0, "end": 181.0, "text": "Leute, was ist die beste Rust DDE, bevor wir loslegen?"}, {"id": 15, "start": 181.0, "end": 189.0, "text": "IntelliJ mit Rust Plugin, Wishlist Studio Code."}, {"id": 16, "start": 189.0, "end": 196.0, "text": "Ich habe mir im Vorfeld nicht viel angeguckt. Ich habe nur ganz kurz mal so ein Hallo Welt Tutorial gelesen, das war es."}, {"id": 17, "start": 196.0, "end": 205.0, "text": "NeoWim, ja mit was denn? NeoWim alleine wird es ja kaum sein, oder?"}, {"id": 18, "start": 205.0, "end": 209.0, "text": "Language Server, oder was?"}, {"id": 19, "start": 209.0, "end": 215.0, "text": "C-Line mit Rust, na gut, da kann ich auch IntelliJ mit, wobei C-Line habe ich schon installiert, da kann ich auch C-Line verwenden."}, {"id": 20, "start": 215.0, "end": 225.0, "text": "Wobei ich weiß gar nicht, ob ich auf dieser vor allem installiert habe."}, {"id": 21, "start": 225.0, "end": 232.0, "text": "Das ist genau das gleiche, das ist Wishlist Studio Code, nur glaube ich ohne proprietären Microsoft-Krempel."}, {"id": 22, "start": 232.0, "end": 240.0, "text": "Was teilweise gar nicht so einfach ist, weil du beispielsweise für CodeShare und für die C++ Extensions und sowas..."}, {"id": 23, "start": 240.0, "end": 245.0, "text": "Ja, die Wishlist Studio Code C++ Extensions ist proprietär, die geht nicht."}, {"id": 24, "start": 245.0, "end": 253.0, "text": "Ja, also ich habe Rust mal gemacht vor einer ganzen, ganzen Weile. Ich glaube, da war die Sprache noch nicht mal 1.0, als das neu war."}, {"id": 25, "start": 253.0, "end": 258.0, "text": "So ganz grob habe ich ein bisschen Ahnung von, aber nicht wirklich viel."}, {"id": 26, "start": 258.0, "end": 263.0, "text": "Ah, ich weiß, dass du bei den hinteren Printen ein Ausrufezeichen brauchst, weil es ein Makro ist."}, {"id": 27, "start": 263.0, "end": 267.0, "text": "Ich weiß, dass du mit Cargo dein Zeug managst."}, {"id": 28, "start": 267.0, "end": 272.0, "text": "Aber ich weiß, dass die Syntax teilweise ein bisschen Painschamp ist."}, {"id": 29, "start": 272.0, "end": 277.0, "text": "Sehr viel NumSumOptional."}, {"id": 30, "start": 277.0, "end": 285.0, "text": "Das Multithreading damals ziemlich Painschamp gewesen ist, wobei uns das für WebAssembly wahrscheinlich nicht weiter jucken muss."}, {"id": 31, "start": 285.0, "end": 288.0, "text": "Ich, keine Ahnung, ich bin mal gespannt."}, {"id": 32, "start": 288.0, "end": 297.0, "text": "Ownership, Borrow Checker, genau dieses ganze Zeug, da werden wir heute wahrscheinlich ein bisschen ausflippen."}, {"id": 33, "start": 297.0, "end": 300.0, "text": "Aber wir machen simple Sachen."}, {"id": 34, "start": 300.0, "end": 305.0, "text": "Ich habe keine Einladung zur Beta, ich habe mich noch nicht mal angemeldet zur Beta."}, {"id": 35, "start": 305.0, "end": 308.0, "text": "Warum muss man sich da überhaupt anmelden zu einer Beta?"}, {"id": 36, "start": 308.0, "end": 311.0, "text": "Warum kann man nicht einfach den Editor in der Beta installieren?"}, {"id": 37, "start": 311.0, "end": 320.0, "text": "Und das gute, wie irgendwelche neuen Social Plattformen, die sind auch immer mit Einladung am Anfang."}, {"id": 38, "start": 320.0, "end": 322.0, "text": "Gibt es eigentlich Clubhouse noch?"}, {"id": 39, "start": 322.0, "end": 325.0, "text": "Nein, Clubhouse interessiert doch keinen mehr, oder?"}, {"id": 40, "start": 325.0, "end": 337.0, "text": "Die haben doch mal irgendwelche Daten geleakt und seitdem will da keiner mehr hin."}, {"id": 41, "start": 337.0, "end": 347.0, "text": "Nicht Assembler, WebAssembly, das hat wenig zu tun mit wirklich x86 Assembler oder sowas."}, {"id": 42, "start": 347.0, "end": 358.0, "text": "Man kann WebAssembly sogar in einer Lisp-ähnlichen Sprache zusammenwursten von Hand."}, {"id": 43, "start": 358.0, "end": 362.0, "text": "Habe ich letztes Video drüber gesehen."}, {"id": 44, "start": 362.0, "end": 365.0, "text": "Ja, da wurde irgendwas geleakt, ich weiß aber nicht mal was."}, {"id": 45, "start": 365.0, "end": 369.0, "text": "Irgendwas wurde geleakt und ach, kein Schimmer."}, {"id": 46, "start": 369.0, "end": 371.0, "text": "Ich hatte die App nie installiert."}, {"id": 47, "start": 371.0, "end": 382.0, "text": "Ja, Lisp, also Leute, wenn ihr auf Programmiersprachen steht, die im Endeffekt so aussehen, dann mögt ihr Lisp wahrscheinlich."}, {"id": 48, "start": 382.0, "end": 392.0, "text": "Ich habe früher mal eine ganze Weile Emacs verwendet, so zu Zeiten noch als Wishful Studio Code noch nicht angesagt,"}, {"id": 49, "start": 392.0, "end": 398.0, "text": "und auch die ganzen Extensions und ich sage euch, Emacs Lisp ist wirklich das Schlimmste, was es gibt."}, {"id": 50, "start": 398.0, "end": 408.0, "text": "Ich weiß gar nicht, warum das so viele abgefeiert haben immer."}, {"id": 51, "start": 408.0, "end": 416.0, "text": "Ja, fast."}, {"id": 52, "start": 416.0, "end": 425.0, "text": "Ich überlege gerade, wie man das jetzt am besten machen."}, {"id": 53, "start": 425.0, "end": 430.0, "text": "Als erstes installiere ich mir mal IntelliJ oder gucken, ob ich Z-Line noch installiert habe."}, {"id": 54, "start": 430.0, "end": 433.0, "text": "Erstmal installieren wir den ganzen Krempel und dann schauen wir mal."}, {"id": 55, "start": 433.0, "end": 440.0, "text": "Ich muss mich ein bisschen an Rust rantasten, wobei so ein Hallo Welt kriegen wir wahrscheinlich relativ zackig zum Laufen."}, {"id": 56, "start": 440.0, "end": 444.0, "text": "Ob wir heute was mit FFmpeg hinbekommen, da habe ich so meine Zweifel."}, {"id": 57, "start": 444.0, "end": 446.0, "text": "Weil das ist ja eigentlich das, was ich ausprobieren will."}, {"id": 58, "start": 446.0, "end": 455.0, "text": "Ob ich mit FFmpeg was im Browser quasi Transcoden kann."}, {"id": 59, "start": 455.0, "end": 464.0, "text": "Und ich will wirklich Low-Level das machen, also AV-Frames rausholen und nicht irgendein fertiges FFmpeg zu WebAssembly-Commando-Zeilen-Tool verwenden."}, {"id": 60, "start": 464.0, "end": 468.0, "text": "Ich bin mal gespannt."}, {"id": 61, "start": 468.0, "end": 471.0, "text": "Aber ich glaube nicht, dass wir das heute so weit hinkriegen."}, {"id": 62, "start": 471.0, "end": 477.0, "text": "So, also, was ist das heute für ein Hintergrund? Das ist das Bing Image of the Day."}, {"id": 63, "start": 477.0, "end": 484.0, "text": "Das ist eine Wiese mit roten Flecken."}, {"id": 64, "start": 484.0, "end": 489.0, "text": "Alles klar."}, {"id": 65, "start": 489.0, "end": 493.0, "text": "Was ist dein Haupt-OS, Windows 10?"}, {"id": 66, "start": 493.0, "end": 497.0, "text": "Das ist Windows 10 und das ist eine Linux VM."}, {"id": 67, "start": 497.0, "end": 502.0, "text": "Sind eigentlich deine Hardware-Komponenten bekannt? Ja, die sind gar nicht sonderlich gut mittlerweile."}, {"id": 68, "start": 502.0, "end": 510.0, "text": "Damals waren die ziemlich gut."}, {"id": 69, "start": 510.0, "end": 514.0, "text": "Das hier, oder?"}, {"id": 70, "start": 514.0, "end": 516.0, "text": "Ja."}, {"id": 71, "start": 516.0, "end": 520.0, "text": "Hast du 32 GB? Ja, ich habe 32 GB Arbeitsspeicher."}, {"id": 72, "start": 520.0, "end": 524.0, "text": "Hier stehen glaube ich nur 16 drin, aber es sind insgesamt 32."}, {"id": 73, "start": 524.0, "end": 526.0, "text": "Guck hier, 32 GB."}, {"id": 74, "start": 526.0, "end": 530.0, "text": "Aber das brauchst du nicht. Guck mal, also das ist jetzt nicht..."}, {"id": 75, "start": 530.0, "end": 534.0, "text": "Armour Reforged, nee. Reforger."}, {"id": 76, "start": 534.0, "end": 537.0, "text": "Gesehen habe ich das schon, Armour, aber nicht gespielt, nee."}, {"id": 77, "start": 537.0, "end": 542.0, "text": "Also guck, du brauchst also, um ein paar VMs ordentlich laufen zu lassen, brauchst du keine 32 GB."}, {"id": 78, "start": 542.0, "end": 546.0, "text": "Ich habe es voll übertrieben. Ich meine, ich habe dieser VM..."}, {"id": 79, "start": 546.0, "end": 548.0, "text": "Äh, hallo?"}, {"id": 80, "start": 548.0, "end": 554.0, "text": "Ich habe dieser VM 16 GB RAM und 4 CPU-Kerne gegeben. Das braucht die im Leben nicht."}, {"id": 81, "start": 554.0, "end": 559.0, "text": "Armour Reforged, nee, das war Warcraft 3 Reforged."}, {"id": 82, "start": 559.0, "end": 566.0, "text": "Also der Rechner ist 4 Jahre alt und ist immer noch ziemlich gut."}, {"id": 83, "start": 566.0, "end": 574.0, "text": "Hauptsächlich wegen der 1080T."}, {"id": 84, "start": 574.0, "end": 578.0, "text": "Das wird sich gleich zeigen."}, {"id": 85, "start": 578.0, "end": 588.0, "text": "Nein, nein, das ist nicht die neue VM. Die ist ja noch gar nicht fertig."}, {"id": 86, "start": 588.0, "end": 592.0, "text": "Ich glaube bei RAM-Auslastung ist eigentlich weniger mehr."}, {"id": 87, "start": 592.0, "end": 596.0, "text": "Madboy Mad Prime Subscriptions hier, Dankeschön."}, {"id": 88, "start": 596.0, "end": 601.0, "text": "Massive Prime Subs. Ich habe übrigens vorher noch eine neue Version vom EPG-Champ gepostet."}, {"id": 89, "start": 601.0, "end": 607.0, "text": "Der caches das ganze Zeug jetzt ordentlich, jetzt geht es ein bisschen schneller."}, {"id": 90, "start": 607.0, "end": 611.0, "text": "Und die Aufnahme funktioniert auch wieder."}, {"id": 91, "start": 611.0, "end": 613.0, "text": "Wie heißt noch mal die Terminal-Anwendung?"}, {"id": 92, "start": 613.0, "end": 617.0, "text": "Das da, CMDR."}, {"id": 93, "start": 617.0, "end": 622.0, "text": "Aber mittlerweile, du kannst auch das neue Windows Terminal verwenden, das ist auch ganz okay."}, {"id": 94, "start": 622.0, "end": 625.0, "text": "Allerdings, please nicht mit PowerShell."}, {"id": 95, "start": 625.0, "end": 631.0, "text": "Na gut, doch mit PowerShell. PowerShell ist okay. Ich mag PowerShell als interaktive Shell nicht, aber PowerShell ist okay."}, {"id": 96, "start": 631.0, "end": 644.0, "text": "Was halt Ober-Crap ist, also Hyper-Ultra-Crap ist das CMD-Fenster und dann da drin diese Batch-Shell. Ganz abartig."}, {"id": 97, "start": 644.0, "end": 649.0, "text": "PowerShell gibt es übrigens mittlerweile sogar unter Linux. Ich weiß gar nicht, ob ich hier mal Just For Fun installiert habe."}, {"id": 98, "start": 649.0, "end": 654.0, "text": "Seit es.NET Core gibt, gibt es den Kram."}, {"id": 99, "start": 654.0, "end": 657.0, "text": "Auch für Linux."}, {"id": 100, "start": 657.0, "end": 680.0, "text": "So, ich muss mal kurz ein bisschen Platz machen. Wartet mal, Leute, ich muss mal kurz, muss mal kurz was gucken, wo ich hier viel Platz verschwende."}, {"id": 101, "start": 680.0, "end": 687.0, "text": "Dart. Ich hab immer noch Dart und Flutter drauf hier. Das könnte man tatsächlich mal löschen."}, {"id": 102, "start": 687.0, "end": 690.0, "text": "Mach hinne."}, {"id": 103, "start": 690.0, "end": 696.0, "text": "Ich muss ein paar Sachen löschen, dass ich genug Platz hab wieder. Ich glaub, ich hab da schon 160 geht ran."}, {"id": 104, "start": 696.0, "end": 702.0, "text": "Oder 80 nur?"}, {"id": 105, "start": 702.0, "end": 710.0, "text": "Hat nicht denselben Umfang wie unter Windows. Ja, das wundert mich nicht. PowerShell war ja ursprünglich als Windows-Automatisierungs-Ding geplant. Da ist ja auch dieses Ganze."}, {"id": 106, "start": 710.0, "end": 718.0, "text": "Wie heißt das unter Windows? Nicht WSL. Ich meine nicht WSL. Ich meine dieses Abfragezeug. WMI heißt das, glaube ich, unter Windows."}, {"id": 107, "start": 718.0, "end": 727.0, "text": "Wo du so System-Infos abfragen kannst. Das hat ja eigentlich alles ganz gute PowerShell-Integrationen, aber das gibt es ja unter Linux gar nicht."}, {"id": 108, "start": 727.0, "end": 734.0, "text": "So. Oldschooler hier. Guck dir schon lange. Kam nie dazu, im Steam zu sein."}, {"id": 109, "start": 734.0, "end": 741.0, "text": "Ja, ursprünglich hatte ich eigentlich gedacht, wir könnten eine Runde Battlefield spielen, wenn jetzt die neue Season rauskommt."}, {"id": 110, "start": 741.0, "end": 750.0, "text": "Aber ich hab heute absolut keinen Bock auf Battlefield 2042. Ich bin eh ziemlich im Arsch."}, {"id": 111, "start": 750.0, "end": 756.0, "text": "Ich bin ehrlich gesagt auch nur angekommen, weil ich gestern gesagt hab oder gestern extra abstimmen lassen,"}, {"id": 112, "start": 756.0, "end": 764.0, "text": "was wir heute machen wollen. Zwar mit dem Hinweis vielleicht auch nix, aber ich wollte dann trotzdem jetzt auch nicht den Streamstreak abreißen lassen."}, {"id": 113, "start": 764.0, "end": 771.0, "text": "Ich meine, das ist jetzt Premiere. Ich glaube, das hatte ich noch nie. Ich war sieben Tage oder acht Tage in Folge on."}, {"id": 114, "start": 771.0, "end": 780.0, "text": "Das ist ja, das kommt ja normalerweise nie vor."}, {"id": 115, "start": 780.0, "end": 787.0, "text": "So. Also, Home. Na, da haben wir nicht viel. War. Lip."}, {"id": 116, "start": 787.0, "end": 797.0, "text": "Alter."}, {"id": 117, "start": 797.0, "end": 806.0, "text": "Snap-Pains-Champ, Alter. Was hab ich denn überhaupt? Snap-List. Snap-List."}, {"id": 118, "start": 806.0, "end": 817.0, "text": "WTF? Ah. Wie krieg ich, wie krieg ich, wie krieg ich das überhaupt weg? Snap-Remove."}, {"id": 119, "start": 817.0, "end": 824.0, "text": "Okay, okay. Weg, weg damit. Braucht doch kein Mensch."}, {"id": 120, "start": 824.0, "end": 836.0, "text": "Bare. Core. Core. Core. Dings. GTK Common Themes. Warum?"}, {"id": 121, "start": 836.0, "end": 846.0, "text": "LXD. Was hab ich denn hier alles für einen Müll drauf? Was laufen? Warum hast du, ich weiß es nicht."}, {"id": 122, "start": 846.0, "end": 856.0, "text": "Ich hab noch, ich hab noch LXD, LXD. Was hab ich denn hier alles für Zeug? Delete. Remove. Ach."}, {"id": 123, "start": 856.0, "end": 866.0, "text": "Uninstall. Ach, ich weiß gar nicht, was es ist. Ich hoffe, dass es Remove ist. Nein. Delete. Delete. Vielleicht. Okay."}, {"id": 124, "start": 866.0, "end": 879.0, "text": "Delete. Da runnt sogar ein Container standardmäßig. Ich hab keinen platzen Schimmer, was es ist, aber."}, {"id": 125, "start": 879.0, "end": 886.0, "text": "Ich lösch das jetzt einfach. Kann nix Wichtiges sein."}, {"id": 126, "start": 886.0, "end": 903.0, "text": "Einfach weg damit. So, und dann werde ich, dann werde ich gleich wegschmeißen. Ich muss mal kurz ein bisschen Platz machen. Ja, auf. Ausgehen, please."}, {"id": 127, "start": 903.0, "end": 910.0, "text": "Arch, by the way. Ja. Da kann es schonmal sein, dass man über, Arch ist so wahnsinnig advanced und geil."}, {"id": 128, "start": 910.0, "end": 924.0, "text": "Da kann schonmal passieren, dass man die Übersicht verliert, was man so alles läuft. Sag mal."}, {"id": 129, "start": 924.0, "end": 929.0, "text": "Kann sich das vielleicht mal beenden? Please."}, {"id": 130, "start": 929.0, "end": 945.0, "text": "This operation can't be cancelled. Interrupt, ja was denn jetzt? Kann ichs jetzt, kann ichs jetzt canceln oder nicht?"}, {"id": 131, "start": 945.0, "end": 955.0, "text": "Boss. Weg. Okay. Alles klar. Delete."}, {"id": 132, "start": 955.0, "end": 962.0, "text": "Ich weiß nicht, was es ist, aber das muss weg. Muss man bei LXC auch noch Images löschen? Lieber Docker oder ist das danach?"}, {"id": 133, "start": 962.0, "end": 973.0, "text": "Image. Image List. Ja 200 irgendwas. Image. Delete."}, {"id": 134, "start": 973.0, "end": 979.0, "text": "Ubuntu 18. Das läuft schon eine Weile hier, würde ich sagen, oder? Weil wir hier in Ubuntu 1804 laufen haben."}, {"id": 135, "start": 979.0, "end": 995.0, "text": "Okay, so und jetzt kann ich Snap remove. Und jetzt habe ich. Was?"}, {"id": 136, "start": 995.0, "end": 1006.0, "text": "Warum ist Snap so ein Crap, Alter? Und jetzt? Snap ist being used. Okay, das kann ich nicht löschen."}, {"id": 137, "start": 1006.0, "end": 1014.0, "text": "Das gehört zu Snap dazu. Alles klar. Nee, auch nicht. Okay."}, {"id": 138, "start": 1014.0, "end": 1036.0, "text": "Coil, Coil auch nicht oder was? Alter, Mann. Okay, Snap List. Darf ich jetzt den Rest löschen? Ja, ja, okay, okay."}, {"id": 139, "start": 1036.0, "end": 1041.0, "text": "Ja, Snap löscht, Snap wird auch gleich gelöscht. Ich weiß gar nicht, warum ich den Müll überhaupt installiert habe."}, {"id": 140, "start": 1041.0, "end": 1057.0, "text": "Keine Ahnung, aber dadurch wird ja nicht alles entfernt. So und jetzt diesen ganzen anderen Mist. Okay, das geht nicht."}, {"id": 141, "start": 1057.0, "end": 1073.0, "text": "Ah, jetzt, jetzt kann ich die Bare löschen. Okay, das Klo muss da bleiben, alles klar. Snap. Weg damit. Yep."}, {"id": 142, "start": 1073.0, "end": 1084.0, "text": "Na, Gott sei Dank. So, jetzt habe ich ein bisschen mehr Platz. Gut. Snap. Alles klar, gelöscht. So und jetzt machen wir noch mal ganz kurz hier ein bisschen Platz."}, {"id": 143, "start": 1084.0, "end": 1101.0, "text": "Max. Cash. Alter, was ist denn hier alles gecashed, Mann? Share. Jet Brands. Okay, ergibt Sinn. Okay, wie, wie klärt man?"}, {"id": 144, "start": 1101.0, "end": 1119.0, "text": "Cash. Clearing Cash. Ja, wie geht das? Okay."}, {"id": 145, "start": 1119.0, "end": 1140.0, "text": "Do you want to remove all other packages from cash? Yes. Yes. Do you want to remove all other? Yes. Yes."}, {"id": 146, "start": 1140.0, "end": 1153.0, "text": "So, ich hoffe, ich habe mir jetzt nichts kaputt gemacht, aber schauen wir mal. Sehr gut. So, jetzt haben wir jetzt 75, 45G wieder frei. Excellent. So muss das sein."}, {"id": 147, "start": 1153.0, "end": 1171.0, "text": "Alles klar. Gut. Dann installiere ich mir mal irgendein Jet Brands Ding mit Rust Plugin. Kengi, Moin. Da ist er. Moment, ich wollte nicht weiter. Ich wollte die Toolbox öffnen."}, {"id": 148, "start": 1171.0, "end": 1187.0, "text": "Soll wohl auch für Web-Anwendungen eine gute Alternative. Go ist jetzt, ganz im Ernst, ich glaube nicht, dass Go bei Web-Anwendungen wahnsinnig irgendwie jetzt den hohen Marktanteil hat. Ich meine, es gibt ein paar Web-Frameworks, es gibt Leute, die machen größere Web-Anwendungen mit Go-Backend."}, {"id": 149, "start": 1187.0, "end": 1207.0, "text": "Aber Go ist vor allem im Cloud-Umfeld ziemlich beliebt und für Kommando-Zeilen-Tools und Static Binaries. Also Go ist eine wunderbare Geschichte. Ich habe so ein paar Kritikpunkte an der Syntax und ein paar Sachen, die ich nicht ganz nachvollziehen kann."}, {"id": 150, "start": 1207.0, "end": 1222.0, "text": "Auf der einen Seite hast du zum Beispiel drei verschiedene Sorten, wie du Variablen anlegen kannst, aber sie wollen immer noch, dass du drei Nested Loops machst, um ordentlich durch Arrays durchzufräsen und dort was rauszufiltern."}, {"id": 151, "start": 1222.0, "end": 1237.0, "text": "Wie gesagt, auf der einen Seite irgendwie ein bisschen viel, auf der anderen Seite ein bisschen wenig. Aber insgesamt ist Go immer noch ganz nice. Vor allem, wenn man das an C++-Standards misst, dann ist es hyper nice."}, {"id": 152, "start": 1237.0, "end": 1246.0, "text": "Ja und Go hat jetzt auch Generics, wobei die Syntax wohl auch nicht so geil sein soll."}, {"id": 153, "start": 1246.0, "end": 1268.0, "text": "Ja, Switchbot ist preislich nicht so super attraktiv. Ich habe allerdings noch zwei Stück hier auf Lager, weil man braucht immer mal was, ja auch Sachen zu checken, ob irgendein Key in einem Dictionary drin ist. Der Go-Way ist da auch jetzt nicht so geil."}, {"id": 154, "start": 1268.0, "end": 1279.0, "text": "Das coole ist an den Switchbots, dass du damit alles irgendwie smart machen kannst, was ein Button hat, wo du nicht dran rumbasteln willst. Dafür habe ich auch noch ein paar auf der hohen Halde, also zwei Stück."}, {"id": 155, "start": 1279.0, "end": 1292.0, "text": "So Leute, macht es einen Unterschied, ob ich C-Line installiere oder IntelliJ. Ich installiere wahrscheinlich C-Line, weil vielleicht machen wir ja mal wieder ein bisschen Arduino Zeug."}, {"id": 156, "start": 1292.0, "end": 1309.0, "text": "Ich habe bei mir auf der normalen VM, die ich verwende, wenn wir nicht sind, habe ich im Prinzip auch Goland Rider C-Line drauf, weil ich das teilweise netter finde als Platform I.O. in Visual Studio Code."}, {"id": 157, "start": 1309.0, "end": 1323.0, "text": "Tom, PC, Dankeschön für den Zap. So, C-Line, auf geht's. Nee, auf Vim habe ich jetzt keinen Bock."}, {"id": 158, "start": 1323.0, "end": 1338.0, "text": "Wie gesagt, ich war früher der richtige Vim-Addikt. Ich habe 800 Zeilen Vim-AC oder noch mehr gehabt, keine Ahnung und irgendwie 40 Plugins und sonst was."}, {"id": 159, "start": 1338.0, "end": 1346.0, "text": "Das kenne ich, das habe ich gesehen, aber das machen wir jetzt erstmal nicht. Ich brauche ja kein Web-Framework."}, {"id": 160, "start": 1346.0, "end": 1353.0, "text": "Ich brauche ein paar Funktionen, die ich aufrufen kann im Browser von JavaScript aus. So, ich habe ein Tutorial gefunden für diese ganze Geschichte."}, {"id": 161, "start": 1353.0, "end": 1369.0, "text": "Das war Rust WebAssembly. Das sah eigentlich ganz gut aus, das da. Das machen wir nicht durch, wir machen bloß das Hallo Welt da draus."}, {"id": 162, "start": 1369.0, "end": 1385.0, "text": "Okay, also, Opening. Dann Open mal. Ich finde es immer geil, wenn Java ohne irgendwelche Settings geladen wird, wie schön das Frontrendering ist. Sagt doch mal, das ist doch eine wahre Augenweide."}, {"id": 163, "start": 1385.0, "end": 1409.0, "text": "Plugins. So, Rust, guck mal da. Ist ziemlich beliebt. Erstes Plugin, was empfohlen wird. Rust. Ach so, bevor ich Rust installiere, sollte ich vielleicht mal Rust installieren, oder?"}, {"id": 164, "start": 1409.0, "end": 1418.0, "text": "Habe ich Rust 19? Ja, aber Rust alleine bringt mir nicht. Ich brauche Rust Up wahrscheinlich. Ich erinnere mich noch dunkel, dass man sowas... Oh."}, {"id": 165, "start": 1418.0, "end": 1424.0, "text": "Are in Conflict. Ich glaube, ich brauche Rust Up, aber das werden wir gleich sehen."}, {"id": 166, "start": 1424.0, "end": 1440.0, "text": "Weil wir brauchen ja zusätzliche Tool-Chains und Dinger. Vielleicht geht das auch mit Cargo. Ich weiß es nicht. Nee, Conflict sagt er jetzt bloß, weil beide das Rust-Kommando zur Verfügung stellen."}, {"id": 167, "start": 1440.0, "end": 1455.0, "text": "Cargo, Cargo habe ich bestimmt. Ja, ja. Und ich habe auch ein aktuelles Rust. Guck mal hier, Repos, MK, wobei wir machen das irgendwie."}, {"id": 168, "start": 1455.0, "end": 1476.0, "text": "Ja, mit Rust Up kannst du doch so... Also wenn ich mich doch richtig erinnere dran. Mit Rust Up kannst du dann auch zusätzliche Tool-Chains installieren, oder kannst du sagen, ja, ich hätte gern den Rust-Compiler für WebAssembly, ich hätte gern den Rust-Compiler für ARM, ich hätte gern auf Musel-Basis. Ja, das gibt es wirklich. Das ist so eine minimale C-Library."}, {"id": 169, "start": 1476.0, "end": 1504.0, "text": "So, und nun? Wie geht es jetzt weiter? Ich habe jetzt Rust-Plugin installiert. Gibt es ein Plugin für HolySea? Nee. Nicht TempleOS Confirmed. Ok, neues Projekt, Rust. Ok. Language Standard C++14."}, {"id": 170, "start": 1504.0, "end": 1531.0, "text": "Ich... Ist es Procken? Leute, ist das Plugin Procken? Wenn ich hier was anklicke, dann ändert sich was. Wenn ich Rust anklicke, passiert gar nichts. Restarten? Ok, wir Restarten."}, {"id": 171, "start": 1531.0, "end": 1550.0, "text": "Im Zweifelsfall, Reboot tut gut, ne? Hast du schon mal was mit dir im... Nee, aber ich weiß, was es ist. Das ist so ein Stateless Overlay mal Ding für C und C++."}, {"id": 172, "start": 1550.0, "end": 1570.0, "text": "So, und jetzt? Ah, tatsächlich. Ok, wir müssen doch kurz in das Tutorial reingucken, aber ganz wichtig. Ah, yes. Darkreader an. Setup. Erstmal Setup angucken."}, {"id": 173, "start": 1570.0, "end": 1585.0, "text": "Rust-Toolchain. You will need Rust-Toolchain in Rust-Up, Rust-C und Cargo. Ok, Leute, ich brauche Rust-Up. Warum?"}, {"id": 174, "start": 1585.0, "end": 1607.0, "text": "NPM zum NPM installieren. MonkaS. Was ist der Unterschied von einer IDE und Vim zu Emacs? Es ist standardmäßig einfach mehr dabei. Bei Vim und Emacs musst du dir sehr viel selbst bauen."}, {"id": 175, "start": 1607.0, "end": 1622.0, "text": "Und viele Sachen gehen da auch jetzt nicht so schön, wobei vieles mit externen Tools gelöst wurde. Also, zum Beispiel eine Sache, die in Vim nie so schön ging, war beispielsweise Auto-Completion-Pop-Ups."}, {"id": 176, "start": 1622.0, "end": 1647.0, "text": "Vim hat zwar eingebaute Auto-Completion-Pop-Ups, aber wenn du beispielsweise ein Pop-Up... zeig dir, was ich meine. Ja, in Mineo-Vim funktioniert das gut. Vielleicht geht es mittlerweile auch, weil die ja vieles übernommen haben."}, {"id": 177, "start": 1647.0, "end": 1668.0, "text": "So. Auf, starte mal. Das ist der Vorteil von Vim, der Startestelle. Also, wenn du sowas hier hast, zum Beispiel so ein Auto-Complete-Pop-Up, was du machen kannst, das ist halt richtig Pain's Jam gewesen, zum Beispiel Vim früher umzusetzen, weil Vim hat halt keine Möglichkeiten gehabt, außer ein Pop-Up zu machen."}, {"id": 178, "start": 1668.0, "end": 1683.0, "text": "Also, wenn du sowas programmieren willst und du hast nur ein Pop-Up, wo du einfach nur Text reinschreiben kannst, ist es halt ein bisschen eklig. Also, du brauchst ja Zusatzinformation. In welchem Namespace ist das? Ist es eine Methode? Ist es ein sonst was anderes Icon?"}, {"id": 179, "start": 1683.0, "end": 1698.0, "text": "Mit so Sachen wie Language Server ist es ein bisschen besser geworden, aber sowas ist halt wirklich eklig in Vim. Aber in der Regel kann man sagen, Vim ist halt standardmäßig ein Out-of-the-Box-and-Text-Editor, der in irgendwie 5 Millisekunden gestartet ist."}, {"id": 180, "start": 1698.0, "end": 1714.0, "text": "Wohingegen meine Ideen erst mal 30 Sekunden Booten richtig tun, dafür Out-of-the-Box deutlich mehr Funktionalität haben. Wie ist der aktuelle Stand bei der China-Chinesen-Wetterstation? Die funktioniert, die steht draußen und liefert Zeug."}, {"id": 181, "start": 1714.0, "end": 1728.0, "text": "Ok. Hello World. Cargo Generate. Shit. Ich will kein Game of Life generaten, ich will Hello World generaten."}, {"id": 182, "start": 1728.0, "end": 1745.0, "text": "Oui, Alok. Was für ein Ding. Ok, Leute, ich weiß noch nicht mal, was ich überhaupt installieren muss. Wasumpack."}, {"id": 183, "start": 1745.0, "end": 1769.0, "text": "Get Wasumpack hier. Ja klar. Wie ich das mag. Erst mal schön reinpasten. Jaja, ganz bestimmt. Gibt's Wasumpack? Gibt's das hier? Wasumpack, da ist es doch, sehr schön. Wasumpack. Mach mal so ein Package Manager."}, {"id": 184, "start": 1769.0, "end": 1785.0, "text": "Cargo Generate. Cargo Install, Cargo Generate. Ok, ich mach mal kurz ein neues Repo. Wobei, das installiert man wahrscheinlich einfach so, oder?"}, {"id": 185, "start": 1785.0, "end": 1804.0, "text": "Ach nee, jetzt mach ich's in meinem Heimatverzeichnis. Man hätte das, glaube ich, doch im Projekt machen sollen. Oder ist es jetzt global? Ich mach das einfach mal. NPM hab ich installiert. Ok, also Hello World."}, {"id": 186, "start": 1804.0, "end": 1828.0, "text": "Was lädt er da eigentlich? Das ist ja fast schon schlimmer als bei NPM."}, {"id": 187, "start": 1828.0, "end": 1839.0, "text": "Auf Cargo. Steht vor Schanghai rum. Kommt nicht rein."}, {"id": 188, "start": 1839.0, "end": 1852.0, "text": "Warum soll ich? Was ist das eigentlich für ein bescheuertes Tutorial? Ich glaube, das machen wir doch nicht. Ich will doch kein Git Repo klonen von sonst wo. Ich will einfach mit einem simple Hallo Welt anfangen. Ok."}, {"id": 189, "start": 1852.0, "end": 1857.0, "text": "Rust Web Assembly. Gibt's da ein besseres Tutorial?"}, {"id": 190, "start": 1857.0, "end": 1865.0, "text": "Introduction. Nee, das ist das gleiche."}, {"id": 191, "start": 1865.0, "end": 1871.0, "text": "Gibt's ein Compiling from Rust? Ok, die Mozilla Dinger sind teilweise gar nicht schlecht."}, {"id": 192, "start": 1871.0, "end": 1881.0, "text": "Was? Ach, das kann man auch über Cargo installieren. Warum schreiben die das nicht gleich?"}, {"id": 193, "start": 1881.0, "end": 1889.0, "text": "Oh, es kompiliert. Aho Korrasik wird kompiliert. Alles klar."}, {"id": 194, "start": 1889.0, "end": 1897.0, "text": "Ich weiß sogar noch ungefähr, was das ist. Das war irgendeine String Match Library. Die gab es damals auch schon, wo ich mir Rust eingeschaut habe."}, {"id": 195, "start": 1897.0, "end": 1917.0, "text": "Jetzt habe ich mir gemerkt, weil der Name so weird champ war. Es wird gerade wirklich das halbe Internet runtergeladen. Kann das sein?"}, {"id": 196, "start": 1917.0, "end": 1933.0, "text": "Ich weiß noch nicht, ob ich plötzlich Five Head bin. Das muss ich mal sehen. So, und dann macht man neues Cargo Projekt. Und dann macht man It Works."}, {"id": 197, "start": 1933.0, "end": 1951.0, "text": "Ach du Scheiße, das ist ja richtiger Five Head Kram. Was für eine Leitung. 400 MBit drunter. Ich mache das einfach, wie Mozilla das sagt. Mozilla hat Ahnung."}, {"id": 198, "start": 1951.0, "end": 1969.0, "text": "Auf, gib ihm. Ich kompiliere, ja, aber das soll man völlig schneller kompilieren."}, {"id": 199, "start": 1969.0, "end": 1993.0, "text": "Single Threaded Compilation. Weird Champ."}, {"id": 200, "start": 1993.0, "end": 2001.0, "text": "Okay, da brauchen wir anscheinend noch ein bisschen."}, {"id": 201, "start": 2001.0, "end": 2010.0, "text": "Das ist. 33 Minuten. Das ist."}, {"id": 202, "start": 2010.0, "end": 2024.0, "text": "Petalburg City aus Pokemon Omega Ruby und Alpha Sapphire. Alles klar. Jetzt weißt du Bescheid."}, {"id": 203, "start": 2024.0, "end": 2031.0, "text": "Wie ist dein Workflow mit VMWare und der virtualen Maschine, die läuft? Hast du einfach ein extra Bildschirm? Nö."}, {"id": 204, "start": 2031.0, "end": 2041.0, "text": "Mehrere Desktops. Oh, er ist fertig. Hab ich wahrscheinlich."}, {"id": 205, "start": 2041.0, "end": 2047.0, "text": "Ne, hab ich nicht. Okay."}, {"id": 206, "start": 2047.0, "end": 2051.0, "text": "Wo ist mein Path hier?"}, {"id": 207, "start": 2051.0, "end": 2063.0, "text": "Ich habe da schon ganz schön viel Müll drin. Okay, bin Cargo. Alles klar."}, {"id": 208, "start": 2063.0, "end": 2077.0, "text": "Cargo. Generate. Alles klar, hat funktioniert. Sehr schön. Ups, jetzt habe ich meine Shell zugemacht. Also auf geht's. CD, Repos."}, {"id": 209, "start": 2077.0, "end": 2083.0, "text": "Macht einen eigenen Ordner. Wenn ich Cargo New mache, macht er einen eigenen Ordner, der Hello Wasm heißt."}, {"id": 210, "start": 2083.0, "end": 2093.0, "text": "Oder oder legt er das im aktuellen. Ach, in der Subdirector. Ja, steht doch da. Hello Wasm."}, {"id": 211, "start": 2093.0, "end": 2108.0, "text": "Alles klar. So, dann öffnen wir das mal. Gucken, ob das Ding was taugt. Was ist denn die? Ich habe keine Ahnung. Das weiß ich auch jetzt nicht mehr. Ich habe wirklich keinen Schimmer mehr."}, {"id": 212, "start": 2108.0, "end": 2123.0, "text": "Also, Repos. Hello Wasm. Nicht der Label-Champ. Cargo-Tommel. Auf geht's. Open Project. Trust. Wir trusten alles. Bei dem Hello World Project kann ich allzu viel falsch."}, {"id": 213, "start": 2123.0, "end": 2152.0, "text": "Okay, was will der von mir jetzt? Genau. CMake? What the fuck? Oh no. Cargo fail. Warum?"}, {"id": 214, "start": 2152.0, "end": 2168.0, "text": "Warum? Cannot attach standard lip sources automatically. Okay, also muss ich doch Rust Up installieren. Meine Güte."}, {"id": 215, "start": 2168.0, "end": 2188.0, "text": "Also, Rust Up. Ja, ist in Konflikt. Alles gut. Yes. Und wie stand das jetzt in der Anleitung? Setup Instruction. Okay."}, {"id": 216, "start": 2188.0, "end": 2215.0, "text": "Der hier Rust Up. Und nu? Rust is managed by Rust Up to Rusta63. Blablabla. Rust Up. Und nu? Wie verwendet man das jetzt?"}, {"id": 217, "start": 2215.0, "end": 2231.0, "text": "Moment. Rust Up self uninstall? Das Ding kann sich selbst... Nee, Update lädt ja nichts Neues runter. Ich muss ihm wahrscheinlich sagen install oder sowas."}, {"id": 218, "start": 2231.0, "end": 2248.0, "text": "Rust Up. Tool. Chain. Install. Stable. Wahrscheinlich wollen wir auch Stable haben. Vom 18.05. Ja, das ist ja noch nicht so lange her. Okay."}, {"id": 219, "start": 2248.0, "end": 2263.0, "text": "Wunderbar. Stable x8664 unknown Linux GNU. Oh, allow me to interject for a moment. Es ist nicht Linux, es ist GNU Linux."}, {"id": 220, "start": 2263.0, "end": 2282.0, "text": "Da ist es doch, Rust. Wunderbar. Auf geht's. Vielleicht geht's ja jetzt. Go installieren wir einfach? Das tatsächlich, ja. Das ist tatsächlich so."}, {"id": 221, "start": 2282.0, "end": 2295.0, "text": "Go installieren ist easy. Wobei, ganz ehrlich, das Rumgefundene früher mit Go Pass war auch nicht schön. So, er hat's gecheckt. Code with me. Jetzt net. So, wie wär's mit Schrift ein bisschen größer machen?"}, {"id": 222, "start": 2295.0, "end": 2322.0, "text": "Und? Pack. Size 16. Immer noch zu klein. Hallo?"}, {"id": 223, "start": 2322.0, "end": 2341.0, "text": "18. Es ist exellent. So, it works. Sehr schön. Da bin ich ja froh, dass es worked. Leute, was ist Standard? Was machen die ganzen Rust oder die ganzen Rust, wie Rust Crust Tachians?"}, {"id": 224, "start": 2341.0, "end": 2356.0, "text": "Alter, warum müssen sich die Leute bei jeder Programmiersprache irgendwie komische Namen geben? Vier spaces, acht spaces, zwei spaces, tabs, backspace only, reverse indentation, was machen die? Vier spaces, ist das Standard?"}, {"id": 225, "start": 2356.0, "end": 2375.0, "text": "Einrückung. So. Ja, was macht denn Cargo FMT standardmäßig?"}, {"id": 226, "start": 2375.0, "end": 2389.0, "text": "Format. So, okay. Also, auf geht's. It works. Wunderbarer Test. Bester."}, {"id": 227, "start": 2389.0, "end": 2407.0, "text": "We won't use this test code at all, so go ahead and delete it. Gut, gut, dass wir das überhaupt haben. Ja. Let's write some Rust. Was im Bindgen?"}, {"id": 228, "start": 2407.0, "end": 2424.0, "text": "Was für ein Ding? Okay, das wird jetzt einfach, das wird knallhart copy pasted. Was im Bindgen? Was im das? Das bedeutet wahrscheinlich, was er, da kann man bestimmt auch Parameter übergeben oder so. Nee, kann man nicht."}, {"id": 229, "start": 2424.0, "end": 2442.0, "text": "Das bedeutet wahrscheinlich, für was er JavaScript Bindings generieren soll. Sag mal, okay, okay, ich rate jetzt mal was. Das hier ist so was wie ein Import von JavaScript und das hier ist ein Export zu JavaScript."}, {"id": 230, "start": 2442.0, "end": 2457.0, "text": "Vermute ich jetzt einfach mal. Muss ich irgendwelche Dependencies eintragen? Das steht hier aber gar nicht."}, {"id": 231, "start": 2457.0, "end": 2472.0, "text": "Pifat. Using was im Bindgen to communicate. Okay. Calling external functions in JavaScript vom Rust. Okay."}, {"id": 232, "start": 2472.0, "end": 2497.0, "text": "Das steht unten. Werden wir gleich sehen. Ich will jetzt wirklich mal ein minimales Hallo Welt produzieren. Ja, das hatten wir, das hatten wir doch hier gerade schon. Warum macht er dann eigentlich überhaupt eine Zeile draus und nicht zwei?"}, {"id": 233, "start": 2497.0, "end": 2511.0, "text": "Das interessiert ihn auch nicht. Compiling our code to WebAssembly. Okay. Cargo Tommel. Ja, Inni war gestern. Jason und Jaml ist auch out."}, {"id": 234, "start": 2511.0, "end": 2528.0, "text": "Rust setzte von Anfang an auf Tommel. Das kann ich mir noch dran erinnern. Das ist quasi so Inni plus in etwas besser. So bla bla bla bla bla bla bla. Das brauchen wir alles nicht. Crate Type cdlib. Alles klar."}, {"id": 235, "start": 2528.0, "end": 2552.0, "text": "Das weiß ich sofort Bescheid. Was im Bindgen Version 2? Muss es wirklich Version 2 sein oder kann es nicht einfach auch was neueres sein? Von wann ist denn das Tutorial? Was im Bindgen GitHub? Was sind die neueste Version davon?"}, {"id": 236, "start": 2552.0, "end": 2567.0, "text": "Okay. Installiert er wenn ich 2.0. Ja, der war so schlau. Cargo war nämlich ziemlich ziemlich nice. Da kann ich mich noch dunkel dran erinnern. Der installiert jetzt die letzte Zweier Version. Also 0 2 80 wahrscheinlich."}, {"id": 237, "start": 2567.0, "end": 2585.0, "text": "Fill in your own repository GitHub bla bla bla bla bla. Okay. Was im Pack? Bild Target Web. Okay. Wenn das jetzt funktioniert, dann kacke ich aber eine Runde."}, {"id": 238, "start": 2585.0, "end": 2606.0, "text": "Wie das funktioniert. Smiley face. Was im Package ist? Package ausschreiben war selbstverständlich kein Platz mehr. Das verstehe ich."}, {"id": 239, "start": 2606.0, "end": 2624.0, "text": "Is ready to publish pkg. Hello wasm bg. Hello wasm bg. Guck mal sogar Typescript. Typescript support haben wir sogar."}, {"id": 240, "start": 2624.0, "end": 2648.0, "text": "Okay. Was im Browser will ich das ausführen? Also im Endeffekt brauche ich wahrscheinlich jetzt irgendeine. Genau. Index HTML. Und dann muss man den Krempel hier machen. Alles klar. Dann machen wir das doch mal."}, {"id": 241, "start": 2648.0, "end": 2672.0, "text": "Project. Okay. Ich glaube so ein bisschen HTML kannst du hier darin auch machen. So. Und. Das geht jetzt oder was? Das muss ich jetzt surfen. Gehe ich mal von außer ich brauche. Okay."}, {"id": 242, "start": 2672.0, "end": 2687.0, "text": "Genau das. Ohne Scheiß. Genau das hätte ich auch gemacht. Genau das hatte ich auch gemacht. Make sure to use an up to date web server that supports application wasm."}, {"id": 243, "start": 2687.0, "end": 2704.0, "text": "Alles klar. Application wasm. So und jetzt einfach starten da drin. Port 8000. Na dann. Schauen wir mal. Was da jetzt rauskommt bei. Localhost port 8000."}, {"id": 244, "start": 2704.0, "end": 2718.0, "text": "Hello web. Das war einfach. Das war wirklich easy. So also wenn ich das jetzt richtig gesehen habe passiert jetzt folgendes."}, {"id": 245, "start": 2718.0, "end": 2735.0, "text": "JavaScript. Also. Okay. Hier. Wir importieren unser WebAssembly Modul. Und rufen. Nachdem es geladen wurde. Mit. Ab artigster. Callback Syntax."}, {"id": 246, "start": 2735.0, "end": 2749.0, "text": "Rufen wir jetzt hier unsere Funktion auf. In WebAssembly die dann wiederum eine JavaScript Funktion aufruft. Okay. Das ist ziemlich sinnloser durch die Brust ins Auge. Aber. Why not. Ja."}, {"id": 247, "start": 2749.0, "end": 2760.0, "text": "Was ist der Vorteil davon. Dass du zum Beispiel C Libraries verwenden kannst und sowas. Im Browser. Das ist halt schon recht nice. Oder Rust Libraries."}, {"id": 248, "start": 2760.0, "end": 2775.0, "text": "Hello wasm. Muss man. Da muss das nicht. Du kannst mit JavaScript mehr oder weniger alles machen was du brauchst."}, {"id": 249, "start": 2775.0, "end": 2785.0, "text": "Aber zum Beispiel wenn du sowas wie FFM Pack im Browser haben willst dann kommste da dran nicht vorbei. Was es in Rust gibt was es in JavaScript nicht gibt."}, {"id": 250, "start": 2785.0, "end": 2800.0, "text": "Zum Beispiel FFM Pack bindings. Im Browser funktionieren. Wenn du FFM Pack im Browser verwenden willst kannst du das mit JavaScript alleine ziemlich knicken."}, {"id": 251, "start": 2800.0, "end": 2815.0, "text": "So. Jetzt versuchen wir mal es halbwegs sinnvolles zu machen. Schieben wir mal den Browser dahin. Ich meine es liefert immer das gleiche aus. Dann machen wir mal hier unten ein Terminal auf."}, {"id": 252, "start": 2815.0, "end": 2831.0, "text": "Und. Was musste man nochmal machen. Wasm. Wasm. Build. Target. Web. Musste man machen. Okay. Also damit kompiliere ich den Krempel. Alles klar. So. Das heißt im Endeffekt ich mache jetzt mal dieses Alert daraus."}, {"id": 253, "start": 2831.0, "end": 2846.0, "text": "Das braucht ja keiner. Print. Kann das auf die Konsole printen. Wahrscheinlich nicht oder. Kein Que. Das wird wahrscheinlich nicht funktionieren. Moment. Leute. Rust Semikolon oder kein Semikolon."}, {"id": 254, "start": 2846.0, "end": 2861.0, "text": "Darf ich fragen was FFM Pack ist. FFM Pack. Wobei ich weiß gar nicht ob du das gefragt hast. Ja. FFM Pack. Es hat nichts mit Frankfurter Mind zu tun. Was ich meine ist FFM Pack. Das ist eine Multimedia Library."}, {"id": 255, "start": 2861.0, "end": 2877.0, "text": "Die dir unter anderem erlaubt Streams zu empfangen. Anders zu encoden. Bilder zu extrahieren. Und nachdem das alles relativ low level ist kannst du da ganz abgedrehte Sachen machen. Du kannst zum Beispiel sagen. Ich empfange ein RTSP Stream von der Webcam."}, {"id": 256, "start": 2877.0, "end": 2896.0, "text": "Und extrahiere mir jedes Bild. Also decode jedes Bild. Und dann mache ich alle 5 Sekunden ein Bild was ich beispielsweise als JPEG rendere und dann auch in der Webseite anzeige. Irgendwie sowas. Du kannst ganz wildes wildes Zeug machen mit FFM Pack."}, {"id": 257, "start": 2896.0, "end": 2911.0, "text": "Ja vor allem. Vor allem als Decoder ist FFM Pack. Gut. Ich encode meine Videos übrigens auch mit FFM Pack. Aber gerade. Also was ich eigentlich hauptsächlich bisher verwendet hab immer. Und wo FFM Pack einfach best ever ist."}, {"id": 258, "start": 2911.0, "end": 2926.0, "text": "Wenn du Videos decoden musst. Wir haben schon öfters in Streams mal H264 Streams decoded. Und da kannst du halt FFM Pack verwenden komplett. Vom empfangen über RTSP. Über das extrahieren von einzelnen Bildern und decoden."}, {"id": 259, "start": 2926.0, "end": 2953.0, "text": "In normales. Nicht wirklich RGB. Aber ich sag jetzt mal RGB. Also FFM Pack ist extrem Pog G. Scheiße. Extrem Pog. Macht FFM Pack auch Audio. Macht auch Audio ja."}, {"id": 260, "start": 2953.0, "end": 2962.0, "text": "Du kannst beispielsweise mit FFM Pack wenn du jetzt das nicht als Library verwenden willst. FFM Pack besteht ja auch aus einem ziemlich umfangreichen Command Line Tool."}, {"id": 261, "start": 2962.0, "end": 2979.0, "text": "Kannst mit FFM Pack zum Beispiel sowas machen wie Videos kürzen ohne neu zu encoden oder Videos von TS in MP4 Container packen ohne neu zu encoden und sowas. Also FFM Pack ist wirklich nice."}, {"id": 262, "start": 2979.0, "end": 2985.0, "text": "So. Jetzt wollen wir mal gucken ob Print. Ob Print geht. Ob es auf der Konsole dann rauskommt."}, {"id": 263, "start": 2985.0, "end": 2999.0, "text": "Pfeilen und v. Ne. Ok. Also auf Konsole kann man nicht. Wie würde ich jetzt kon- Ok. Moment. Moment. Wenn ich den Kram doch importiere."}, {"id": 264, "start": 2999.0, "end": 3006.0, "text": "Das wird nicht funktionieren oder?"}, {"id": 265, "start": 3006.0, "end": 3011.0, "text": "Rust. Import. Konsole. Log. Wasen."}, {"id": 266, "start": 3011.0, "end": 3019.0, "text": "Ah. Beispiele. Konsole. Log. Pog. Der Chat weiß schon wieder Bescheid."}, {"id": 267, "start": 3019.0, "end": 3023.0, "text": "Ok. Konsole. Konsole. Log."}, {"id": 268, "start": 3023.0, "end": 3035.0, "text": "FN Log. Ach. So. Ah. Ok. Verstehe. Verstehe. Verstehe. Der Name Space. Was ist bloß das Problem jetzt?"}, {"id": 269, "start": 3035.0, "end": 3045.0, "text": "Ach. Extern. Extern muss ich machen. Ach. Hier haben sie es schon extern. Ah. Ok. Da kannst du dann so einen größeren Block dran machen."}, {"id": 270, "start": 3045.0, "end": 3057.0, "text": "Aha."}, {"id": 271, "start": 3057.0, "end": 3066.0, "text": "Ok. Ok. Verstehe. So. Das heißt ich kann jetzt von Representive Assembly auch was auf die Konsole loggen. Also Log."}, {"id": 272, "start": 3066.0, "end": 3070.0, "text": "CacW."}, {"id": 273, "start": 3070.0, "end": 3072.0, "text": "Bild."}, {"id": 274, "start": 3072.0, "end": 3076.0, "text": "Und CacW kommt auf der Konsole raus. Ok. Das ist schon mal nice."}, {"id": 275, "start": 3076.0, "end": 3082.0, "text": "Cute. Chat. Ah. Ja. Ja."}, {"id": 276, "start": 3082.0, "end": 3085.0, "text": "Funktioniert. Sehr schön. Pog. Nice. Das ist gut."}, {"id": 277, "start": 3085.0, "end": 3092.0, "text": "Bis jetzt habe ich alles verstanden. Das war zwar noch nicht viel, was wir gemacht haben, aber immerhin."}, {"id": 278, "start": 3092.0, "end": 3098.0, "text": "Das spricht nicht für das. Kommentare sind eh overrated. Das sage ich ja auch immer."}, {"id": 279, "start": 3098.0, "end": 3107.0, "text": "Guter Code dokumentiert sich selbst. Und wenn man dann auch fehlerfrei programmiert, braucht man auch keine Tests."}, {"id": 280, "start": 3107.0, "end": 3113.0, "text": "Und spart sich Zeit und ist schneller fertig. Easy."}, {"id": 281, "start": 3113.0, "end": 3117.0, "text": "Easy."}, {"id": 282, "start": 3117.0, "end": 3120.0, "text": "Alles overrated, outdated, gebadet."}, {"id": 283, "start": 3120.0, "end": 3124.0, "text": "Debugger und Breakpoints braucht auch keiner."}, {"id": 284, "start": 3124.0, "end": 3127.0, "text": "Command Line. CLI."}, {"id": 285, "start": 3127.0, "end": 3132.0, "text": "Konsole Log Debugging. Beste."}, {"id": 286, "start": 3132.0, "end": 3139.0, "text": "So. Gut. So. Was können wir denn jetzt mal wirklich sinnvolles machen?"}, {"id": 287, "start": 3139.0, "end": 3145.0, "text": "Guck mal. Muss man diesen Krampel so Payneschampig aufrufen wie da?"}, {"id": 288, "start": 3145.0, "end": 3152.0, "text": "Ich möchte meinen. Eigentlich möchte ich das mit zwei Tabs Einrückung haben."}, {"id": 289, "start": 3152.0, "end": 3154.0, "text": "Ich."}, {"id": 290, "start": 3154.0, "end": 3158.0, "text": "Haltet. Haltet ihr mich für sehr."}, {"id": 291, "start": 3158.0, "end": 3168.0, "text": "Cringe. Wenn ich mein HTML mit zwei Spaces Einrückung mag."}, {"id": 292, "start": 3168.0, "end": 3181.0, "text": "Willst du jetzt Champ oder?"}, {"id": 293, "start": 3181.0, "end": 3185.0, "text": "Capsa ist zwei. Zwei."}, {"id": 294, "start": 3185.0, "end": 3188.0, "text": "Hier."}, {"id": 295, "start": 3188.0, "end": 3193.0, "text": "Da bin ich mir jetzt nicht sicher. Warum nicht auch zwei?"}, {"id": 296, "start": 3193.0, "end": 3195.0, "text": "Next."}, {"id": 297, "start": 3195.0, "end": 3197.0, "text": "Format."}, {"id": 298, "start": 3197.0, "end": 3199.0, "text": "Wie?"}, {"id": 299, "start": 3199.0, "end": 3207.0, "text": "Mich veräppeln."}, {"id": 300, "start": 3207.0, "end": 3219.0, "text": "Alter, lüg halt nicht."}, {"id": 301, "start": 3219.0, "end": 3225.0, "text": "Jetzt. Was ist das denn?"}, {"id": 302, "start": 3225.0, "end": 3228.0, "text": "Das scheint nicht zu funktionieren. Ach, das ist wahrscheinlich für JavaScript."}, {"id": 303, "start": 3228.0, "end": 3232.0, "text": "Für JavaScript ist nochmal extra oder wie?"}, {"id": 304, "start": 3232.0, "end": 3240.0, "text": "Wahrscheinlich ist für JavaScript nochmal extra."}, {"id": 305, "start": 3240.0, "end": 3243.0, "text": "So. Ja, genau. Wir wollen wir wollen auf jeden Fall das erwarten."}, {"id": 306, "start": 3243.0, "end": 3249.0, "text": "Irgendwie wie auch immer genau. Also sprich."}, {"id": 307, "start": 3249.0, "end": 3255.0, "text": "Gibt es eigentlich Top Level Await mittlerweile in JavaScript? Also."}, {"id": 308, "start": 3255.0, "end": 3260.0, "text": "So was da."}, {"id": 309, "start": 3260.0, "end": 3263.0, "text": "Wow, wow, wow."}, {"id": 310, "start": 3263.0, "end": 3271.0, "text": "Ich will nichts kommenden. Ich will auskommen kommentieren."}, {"id": 311, "start": 3271.0, "end": 3276.0, "text": "Geht Top Level Await wahrscheinlich nicht, oder?"}, {"id": 312, "start": 3276.0, "end": 3278.0, "text": "Quatsch, das ist ja hier."}, {"id": 313, "start": 3278.0, "end": 3280.0, "text": "Oder doch?"}, {"id": 314, "start": 3280.0, "end": 3282.0, "text": "Oder doch?"}, {"id": 315, "start": 3282.0, "end": 3286.0, "text": "Wie ist denn standardmäßig in C-Line das?"}, {"id": 316, "start": 3286.0, "end": 3292.0, "text": "Ach Mensch, Shortcuts."}, {"id": 317, "start": 3292.0, "end": 3299.0, "text": "Nee, wo geht das? Alter, warum ist das immer so versteckt?"}, {"id": 318, "start": 3299.0, "end": 3304.0, "text": "Short."}, {"id": 319, "start": 3304.0, "end": 3306.0, "text": "Was muss ich noch mal gucken?"}, {"id": 320, "start": 3306.0, "end": 3311.0, "text": "Comment? Ich meine, so kann ich, ich meine, ich kann auch sagen Comment."}, {"id": 321, "start": 3311.0, "end": 3314.0, "text": "Aber schön ist es nicht."}, {"id": 322, "start": 3314.0, "end": 3317.0, "text": "So, jetzt muss ich mir am Kopf überlegen. JavaScript."}, {"id": 323, "start": 3317.0, "end": 3324.0, "text": "Also das wäre dann quasi."}, {"id": 324, "start": 3324.0, "end": 3326.0, "text": "Warte mal, nee."}, {"id": 325, "start": 3326.0, "end": 3329.0, "text": "Ich würde einfach sagen Await in it."}, {"id": 326, "start": 3329.0, "end": 3332.0, "text": "Und dann sage ich Creed."}, {"id": 327, "start": 3332.0, "end": 3336.0, "text": "Das müsste doch funktionieren dann, wenn er ordentlich Awaited hat."}, {"id": 328, "start": 3336.0, "end": 3337.0, "text": "Funktioniert auch."}, {"id": 329, "start": 3337.0, "end": 3344.0, "text": "Ja, dann können wir uns dieses komische, dieses ekliche Callback Zeug sparen."}, {"id": 330, "start": 3344.0, "end": 3345.0, "text": "Okay, nice. Also."}, {"id": 331, "start": 3345.0, "end": 3348.0, "text": "So, jetzt lass mal in mich gehen."}, {"id": 332, "start": 3348.0, "end": 3352.0, "text": "Was könnte man dann irgendwie Sinnvolles machen da jetzt?"}, {"id": 333, "start": 3352.0, "end": 3356.0, "text": "Was sagt denn das Mozilla Tutorial weiter?"}, {"id": 334, "start": 3356.0, "end": 3358.0, "text": "So ein bisschen üben."}, {"id": 335, "start": 3358.0, "end": 3362.0, "text": "Ja, also Konsolok funktioniert Marco rules Konzo."}, {"id": 336, "start": 3362.0, "end": 3368.0, "text": "Alter, das nimmt ja fast C++ Ausmaße an mittlerweile."}, {"id": 337, "start": 3368.0, "end": 3375.0, "text": "Was ist denn das?"}, {"id": 338, "start": 3375.0, "end": 3381.0, "text": "Was bin ich sehend?"}, {"id": 339, "start": 3381.0, "end": 3388.0, "text": "Das erinnert mich ja wirklich fast schon ein bisschen an C++ Template, wenn ich sowas hier sehe."}, {"id": 340, "start": 3388.0, "end": 3391.0, "text": "Was ist das? Was macht das? Was tut es?"}, {"id": 341, "start": 3391.0, "end": 3395.0, "text": "Es ist ein Template Argument, Funktionen und Lock."}, {"id": 342, "start": 3395.0, "end": 3400.0, "text": "Ist das, dass man beliebig viele Argumente locken kann?"}, {"id": 343, "start": 3400.0, "end": 3402.0, "text": "Ist das, dass man möglichst viele?"}, {"id": 344, "start": 3402.0, "end": 3404.0, "text": "Next, let's define a Marco like this."}, {"id": 345, "start": 3404.0, "end": 3414.0, "text": "Only it works for console lock."}, {"id": 346, "start": 3414.0, "end": 3418.0, "text": "Okay, das brauche ich nicht."}, {"id": 347, "start": 3418.0, "end": 3424.0, "text": "Das tut auch so."}, {"id": 348, "start": 3424.0, "end": 3428.0, "text": "Let JS JS value 4 into."}, {"id": 349, "start": 3428.0, "end": 3431.0, "text": "Alter, jetzt wird es aber."}, {"id": 350, "start": 3431.0, "end": 3434.0, "text": "JS value. Wo kommt denn das her?"}, {"id": 351, "start": 3434.0, "end": 3437.0, "text": "Ist das standardmäßig hier einfach verfügbar?"}, {"id": 352, "start": 3437.0, "end": 3440.0, "text": "Let JS value."}, {"id": 353, "start": 3440.0, "end": 3444.0, "text": "Okay, da kann ich quasi direkt JavaScript Variablen anlegen oder sowas."}, {"id": 354, "start": 3444.0, "end": 3451.0, "text": "Okay, dann müssen wir mal probieren, wie man Return Werte von Konsolen macht."}, {"id": 355, "start": 3451.0, "end": 3456.0, "text": "Also sprich, wie kriege ich einen Return Wert hier von zurück nach JavaScript?"}, {"id": 356, "start": 3456.0, "end": 3462.0, "text": "Ich glaube nämlich, wenn ich später mal tatsächlich es hinbekomme, FFmpeg zu verwenden und Bild decoded habe."}, {"id": 357, "start": 3462.0, "end": 3464.0, "text": "So, und da kann man jetzt sagen Log."}, {"id": 358, "start": 3464.0, "end": 3467.0, "text": "Wobei das das geht jetzt ja nicht, oder?"}, {"id": 359, "start": 3467.0, "end": 3469.0, "text": "Wenn ich sage JS."}, {"id": 360, "start": 3469.0, "end": 3473.0, "text": "Das ist ja kein String. Das mag er ja nicht."}, {"id": 361, "start": 3473.0, "end": 3480.0, "text": "Dann brauche ich dann brauche ich doch den Moment. Was macht er hier?"}, {"id": 362, "start": 3480.0, "end": 3483.0, "text": "Into into was?"}, {"id": 363, "start": 3483.0, "end": 3489.0, "text": "Boah, Alter, die die Rastzündung ist schon krasser Shit."}, {"id": 364, "start": 3489.0, "end": 3493.0, "text": "Lock 2."}, {"id": 365, "start": 3493.0, "end": 3502.0, "text": "Ach nee, Using Web Sus."}, {"id": 366, "start": 3502.0, "end": 3504.0, "text": "Ach so."}, {"id": 367, "start": 3504.0, "end": 3511.0, "text": "Warte, das gibt es schon."}, {"id": 368, "start": 3511.0, "end": 3514.0, "text": "Ja, warum habe ich das denn dann überhaupt selbst gemacht?"}, {"id": 369, "start": 3514.0, "end": 3522.0, "text": "Ups."}, {"id": 370, "start": 3522.0, "end": 3525.0, "text": "Muss das Krait noch installieren?"}, {"id": 371, "start": 3525.0, "end": 3528.0, "text": "Use of Undeclared Krait. Aha."}, {"id": 372, "start": 3528.0, "end": 3531.0, "text": "Das heißt, das muss ich erst in meine."}, {"id": 373, "start": 3531.0, "end": 3535.0, "text": "Tommelfile schreiben."}, {"id": 374, "start": 3535.0, "end": 3541.0, "text": "Benutzt einfach was im Logger zum Logger. Was im Logger?"}, {"id": 375, "start": 3541.0, "end": 3545.0, "text": "Was im Logger Krait Github."}, {"id": 376, "start": 3545.0, "end": 3547.0, "text": "Mach ich."}, {"id": 377, "start": 3547.0, "end": 3555.0, "text": "Welches davon ist es denn?"}, {"id": 378, "start": 3555.0, "end": 3557.0, "text": "GitLab, MonkaS."}, {"id": 379, "start": 3557.0, "end": 3561.0, "text": "Leute hosten wirklich jetzt auf GitLab."}, {"id": 380, "start": 3561.0, "end": 3563.0, "text": "Zwei Jahre ago. Nee."}, {"id": 381, "start": 3563.0, "end": 3571.0, "text": "Das will man wahrscheinlich nicht, oder?"}, {"id": 382, "start": 3571.0, "end": 3576.0, "text": "Zwei Jahre."}, {"id": 383, "start": 3576.0, "end": 3582.0, "text": "Und das ist das ist noch älter."}, {"id": 384, "start": 3582.0, "end": 3592.0, "text": "Will man das?"}, {"id": 385, "start": 3592.0, "end": 3595.0, "text": "Und was war das andere, was die hier hatten?"}, {"id": 386, "start": 3595.0, "end": 3600.0, "text": "Web Sus Console."}, {"id": 387, "start": 3600.0, "end": 3602.0, "text": "Web Sus Console."}, {"id": 388, "start": 3602.0, "end": 3606.0, "text": "Was ich noch nicht ganz gecheckt habe, ist, Leute, wie installiere ich was?"}, {"id": 389, "start": 3606.0, "end": 3609.0, "text": "Also da kann ich mich nicht mehr dran erinnern."}, {"id": 390, "start": 3609.0, "end": 3612.0, "text": "Ja, man kann das hier in seine Cargo Datei schreiben."}, {"id": 391, "start": 3612.0, "end": 3615.0, "text": "Aber woher weiß ich denn welche Versionen und so?"}, {"id": 392, "start": 3615.0, "end": 3617.0, "text": "Kann ich nicht einfach immer sagen?"}, {"id": 393, "start": 3617.0, "end": 3634.0, "text": "Gibt es nicht wie bei NPM beispielsweise ein Cargo install für die letzte Version?"}, {"id": 394, "start": 3634.0, "end": 3636.0, "text": "Krait's I.O. OK."}, {"id": 395, "start": 3636.0, "end": 3637.0, "text": "Gratis Punkt."}, {"id": 396, "start": 3637.0, "end": 3640.0, "text": "Da kann ich mich noch dran erinnern."}, {"id": 397, "start": 3640.0, "end": 3645.0, "text": "Web Sus Console."}, {"id": 398, "start": 3645.0, "end": 3648.0, "text": "Das heißt aber ganz anders, woher weiß ich denn jetzt, dass es das ist?"}, {"id": 399, "start": 3648.0, "end": 3649.0, "text": "Web Sus."}, {"id": 400, "start": 3649.0, "end": 3655.0, "text": "Ach nee, das brauche ich wahrscheinlich."}, {"id": 401, "start": 3655.0, "end": 3657.0, "text": "Das brauche ich wahrscheinlich."}, {"id": 402, "start": 3657.0, "end": 3660.0, "text": "Web Sus brauche ich wohl."}, {"id": 403, "start": 3660.0, "end": 3664.0, "text": "OK, also sprich, das muss ich in meinen Cargo schreiben."}, {"id": 404, "start": 3664.0, "end": 3666.0, "text": "Am besten schreibe ich doch so, oder?"}, {"id": 405, "start": 3666.0, "end": 3670.0, "text": "Da mache ich immer die neueste 3er Version rein."}, {"id": 406, "start": 3670.0, "end": 3679.0, "text": "Ah, jetzt ergibt es schon."}, {"id": 407, "start": 3679.0, "end": 3680.0, "text": "No Console."}, {"id": 408, "start": 3680.0, "end": 3685.0, "text": "OK."}, {"id": 409, "start": 3685.0, "end": 3688.0, "text": "Klick auf die Kiste daneben."}, {"id": 410, "start": 3688.0, "end": 3689.0, "text": "Was?"}, {"id": 411, "start": 3689.0, "end": 3696.0, "text": "Welche Kiste?"}, {"id": 412, "start": 3696.0, "end": 3700.0, "text": "Den C-Line?"}, {"id": 413, "start": 3700.0, "end": 3703.0, "text": "Ach hier."}, {"id": 414, "start": 3703.0, "end": 3705.0, "text": "Ah, das ist ja cool."}, {"id": 415, "start": 3705.0, "end": 3708.0, "text": "OK, nice."}, {"id": 416, "start": 3708.0, "end": 3713.0, "text": "Console."}, {"id": 417, "start": 3713.0, "end": 3718.0, "text": "Warum gibt es das jetzt angeblich nicht?"}, {"id": 418, "start": 3718.0, "end": 3725.0, "text": "Und warum kriege ich kein Autocomplete davon?"}, {"id": 419, "start": 3725.0, "end": 3738.0, "text": "Tja, so einfach ist das nicht."}, {"id": 420, "start": 3738.0, "end": 3744.0, "text": "Ähm, ja und du?"}, {"id": 421, "start": 3744.0, "end": 3746.0, "text": "No Console in root."}, {"id": 422, "start": 3746.0, "end": 3748.0, "text": "Was soll mir das jetzt sagen?"}, {"id": 423, "start": 3748.0, "end": 3752.0, "text": "Da steht es doch, dass es das gibt."}, {"id": 424, "start": 3752.0, "end": 3756.0, "text": "Und vor allem, warum gibt es kein Autocomplete?"}, {"id": 425, "start": 3756.0, "end": 3758.0, "text": "Muss man das oben importieren vielleicht?"}, {"id": 426, "start": 3758.0, "end": 3767.0, "text": "Irgendwie da?"}, {"id": 427, "start": 3767.0, "end": 3769.0, "text": "OK, das triggert mich schon wieder."}, {"id": 428, "start": 3769.0, "end": 3772.0, "text": "Warum funktioniert das nicht, obwohl das eindeutig so da steht?"}, {"id": 429, "start": 3772.0, "end": 3781.0, "text": "Und warum kriege ich kein Autocomplete dafür?"}, {"id": 430, "start": 3781.0, "end": 3787.0, "text": "Ich hab das bei mir drinne stehen."}, {"id": 431, "start": 3787.0, "end": 3788.0, "text": "Features gleich Console."}, {"id": 432, "start": 3788.0, "end": 3795.0, "text": "Wo steht das denn?"}, {"id": 433, "start": 3795.0, "end": 3796.0, "text": "Aha."}, {"id": 434, "start": 3796.0, "end": 3801.0, "text": "Und woher weiß man das jetzt?"}, {"id": 435, "start": 3801.0, "end": 3804.0, "text": "Console."}, {"id": 436, "start": 3804.0, "end": 3809.0, "text": "Wohin soll man das wissen?"}, {"id": 437, "start": 3809.0, "end": 3812.0, "text": "Also."}, {"id": 438, "start": 3812.0, "end": 3816.0, "text": "Features."}, {"id": 439, "start": 3816.0, "end": 3818.0, "text": "Console."}, {"id": 440, "start": 3818.0, "end": 3819.0, "text": "OK."}, {"id": 441, "start": 3819.0, "end": 3821.0, "text": "What?"}, {"id": 442, "start": 3821.0, "end": 3838.0, "text": "Alter, was will das von mir?"}, {"id": 443, "start": 3838.0, "end": 3841.0, "text": "Das muss in eine eigene Dependency."}, {"id": 444, "start": 3841.0, "end": 3847.0, "text": "OK, ich copy paste das jetzt einfach aus dem Chat."}, {"id": 445, "start": 3847.0, "end": 3850.0, "text": "Das ist sowas."}, {"id": 446, "start": 3850.0, "end": 3852.0, "text": "OK, da wäre ich ohne euch nicht drauf gekommen."}, {"id": 447, "start": 3852.0, "end": 3860.0, "text": "Keine Ahnung."}, {"id": 448, "start": 3860.0, "end": 3870.0, "text": "Alter, wo ist denn das Problem, was will das von mir?"}, {"id": 449, "start": 3870.0, "end": 3872.0, "text": "Warum ist das angeklärt?"}, {"id": 450, "start": 3872.0, "end": 3874.0, "text": "Ach so, weil ich es rausgeschmissen habe."}, {"id": 451, "start": 3874.0, "end": 3875.0, "text": "Ich habe nichts gesagt."}, {"id": 452, "start": 3875.0, "end": 3876.0, "text": "Kriege ich denn jetzt?"}, {"id": 453, "start": 3876.0, "end": 3877.0, "text": "Kriege ich jetzt Autocomplete?"}, {"id": 454, "start": 3877.0, "end": 3879.0, "text": "Ach, jetzt kriege ich Console."}, {"id": 455, "start": 3879.0, "end": 3881.0, "text": "OK."}, {"id": 456, "start": 3881.0, "end": 3884.0, "text": "Ah, das ist doch schon besser."}, {"id": 457, "start": 3884.0, "end": 3885.0, "text": "Jetzt funktioniert es."}, {"id": 458, "start": 3885.0, "end": 3887.0, "text": "OK, jetzt können wir wirklich auch Zeug loggen."}, {"id": 459, "start": 3887.0, "end": 3888.0, "text": "Das ist schon mal nicht verkehrt."}, {"id": 460, "start": 3888.0, "end": 3891.0, "text": "OK, also, wie macht man Return Werte?"}, {"id": 461, "start": 3891.0, "end": 3893.0, "text": "Da muss ich jetzt mal schauen."}, {"id": 462, "start": 3893.0, "end": 3898.0, "text": "Also, haben die das hier drinnen stehen?"}, {"id": 463, "start": 3898.0, "end": 3900.0, "text": "Nee, aber wie macht man Return Werte?"}, {"id": 464, "start": 3900.0, "end": 3902.0, "text": "Also quasi, das nennen wir jetzt nicht Creed."}, {"id": 465, "start": 3902.0, "end": 3908.0, "text": "Das nennen wir jetzt irgendwie Pog."}, {"id": 466, "start": 3908.0, "end": 3910.0, "text": "Return Pog."}, {"id": 467, "start": 3910.0, "end": 3911.0, "text": "Heißt das?"}, {"id": 468, "start": 3911.0, "end": 3914.0, "text": "So, und wir machen mal was einfaches."}, {"id": 469, "start": 3914.0, "end": 3918.0, "text": "Wenn ich das jetzt noch richtig in Erinnerung habe,"}, {"id": 470, "start": 3918.0, "end": 3921.0, "text": "musste man doch Return Code in Rust irgendwie so machen."}, {"id": 471, "start": 3921.0, "end": 3926.0, "text": "Ibi32 oder so."}, {"id": 472, "start": 3926.0, "end": 3928.0, "text": "Ja, so ging das."}, {"id": 473, "start": 3928.0, "end": 3933.0, "text": "Hab ich noch im Hinterkopf, dass das irgendwie so funktioniert hat."}, {"id": 474, "start": 3933.0, "end": 3939.0, "text": "OK, so, jetzt wird das hier abkacken, weil es gibt es nicht."}, {"id": 475, "start": 3939.0, "end": 3942.0, "text": "Und wir rufen jetzt nicht Creed auf,"}, {"id": 476, "start": 3942.0, "end": 3945.0, "text": "sondern Return..."}, {"id": 477, "start": 3945.0, "end": 3947.0, "text": "Oh, guck mal, sogar Autokomplete im HTML."}, {"id": 478, "start": 3947.0, "end": 3948.0, "text": "Das ist cool."}, {"id": 479, "start": 3948.0, "end": 3950.0, "text": "Return Pog."}, {"id": 480, "start": 3950.0, "end": 3951.0, "text": "So, Return Pog."}, {"id": 481, "start": 3951.0, "end": 3955.0, "text": "Brauchen wir eigentlich gar kein String übergeben."}, {"id": 482, "start": 3955.0, "end": 3964.0, "text": "Return Pog kriegt einfach nur Return Wert von 1."}, {"id": 483, "start": 3964.0, "end": 3967.0, "text": "OK, und jetzt?"}, {"id": 484, "start": 3967.0, "end": 3968.0, "text": "Let E gleich?"}, {"id": 485, "start": 3968.0, "end": 3973.0, "text": "Nee, so einfach wird das nicht sein, oder?"}, {"id": 486, "start": 3973.0, "end": 3976.0, "text": "So einfach wird das doch nicht sein."}, {"id": 487, "start": 3976.0, "end": 3979.0, "text": "Doch."}, {"id": 488, "start": 3979.0, "end": 3984.0, "text": "Tatsächlich."}, {"id": 489, "start": 3984.0, "end": 3985.0, "text": "Chat bisschen höher."}, {"id": 490, "start": 3985.0, "end": 3987.0, "text": "Ja, ja, ja, hast recht."}, {"id": 491, "start": 3987.0, "end": 3989.0, "text": "Ich mach den Chat oben rechts hin."}, {"id": 492, "start": 3989.0, "end": 3996.0, "text": "Oben rechts ist ja sonst nichts Wichtiges."}, {"id": 493, "start": 3996.0, "end": 4003.0, "text": "Hier oben, das muss man glaube ich nicht sehen."}, {"id": 494, "start": 4003.0, "end": 4012.0, "text": "Wobei doch, da ist es über dem Browser."}, {"id": 495, "start": 4012.0, "end": 4014.0, "text": "Oben links?"}, {"id": 496, "start": 4014.0, "end": 4024.0, "text": "Wo braucht man einen Chat gerade am wenigsten?"}, {"id": 497, "start": 4024.0, "end": 4026.0, "text": "Gar keinen Chat, nee."}, {"id": 498, "start": 4026.0, "end": 4028.0, "text": "Nein, nein, wir plätten den Chat nicht aus."}, {"id": 499, "start": 4028.0, "end": 4032.0, "text": "Der Chat ist Pog."}, {"id": 500, "start": 4032.0, "end": 4037.0, "text": "Direkt über die Katze?"}, {"id": 501, "start": 4037.0, "end": 4039.0, "text": "Ich weiß, was ich mache."}, {"id": 502, "start": 4039.0, "end": 4043.0, "text": "Der Chat bleibt hier unter Chico."}, {"id": 503, "start": 4043.0, "end": 4046.0, "text": "Wie habe ich den Chat sonst immer so hier, glaube ich."}, {"id": 504, "start": 4046.0, "end": 4047.0, "text": "Und wir machen was anderes."}, {"id": 505, "start": 4047.0, "end": 4052.0, "text": "Wir machen was anderes."}, {"id": 506, "start": 4052.0, "end": 4053.0, "text": "Ach, Quatsch."}, {"id": 507, "start": 4053.0, "end": 4059.0, "text": "Moment, das muss ich so machen."}, {"id": 508, "start": 4059.0, "end": 4063.0, "text": "Wir machen einfach so, guck mal."}, {"id": 509, "start": 4063.0, "end": 4073.0, "text": "Nur kurz schauen, ob das jetzt hinhaut."}, {"id": 510, "start": 4073.0, "end": 4077.0, "text": "Und da unten, zur Entspannung, kann Chico Fische fangen."}, {"id": 511, "start": 4077.0, "end": 4087.0, "text": "Das reicht von der Quatsch."}, {"id": 512, "start": 4087.0, "end": 4089.0, "text": "Kann Chico Fische fangen."}, {"id": 513, "start": 4089.0, "end": 4090.0, "text": "Sehr gut."}, {"id": 514, "start": 4090.0, "end": 4091.0, "text": "Alles klar."}, {"id": 515, "start": 4091.0, "end": 4092.0, "text": "So, weiter im Text."}, {"id": 516, "start": 4092.0, "end": 4095.0, "text": "Okay, Inns sind tatsächlich relativ einfach."}, {"id": 517, "start": 4095.0, "end": 4097.0, "text": "Wie returnt man einen String?"}, {"id": 518, "start": 4097.0, "end": 4101.0, "text": "Ich erinnere mich, das war in Rust generell ein bisschen painstamp mit Returnwerten, weil"}, {"id": 519, "start": 4101.0, "end": 4107.0, "text": "du musstest immer sagen, returnst du eine Referenz, returnst du quasi das Ownership"}, {"id": 520, "start": 4107.0, "end": 4113.0, "text": "oder nur, nur, nur, wird das nur ausgeborgt oder sonst was."}, {"id": 521, "start": 4113.0, "end": 4116.0, "text": "Das ist ganz kompliziert gewesen."}, {"id": 522, "start": 4116.0, "end": 4122.0, "text": "Also einfach nur String geht wahrscheinlich nicht, weil String immer eine Referenz ist"}, {"id": 523, "start": 4122.0, "end": 4124.0, "text": "oder warum ist das so?"}, {"id": 524, "start": 4124.0, "end": 4128.0, "text": "Ich kann mich noch dran erinnern, in Rust gab es auch sowas."}, {"id": 525, "start": 4128.0, "end": 4133.0, "text": "Da habe ich, da habe ich aber dann damals aus, bin ich damals ausgestiegen."}, {"id": 526, "start": 4133.0, "end": 4134.0, "text": "Keine Ahnung, was das macht."}, {"id": 527, "start": 4134.0, "end": 4140.0, "text": "Das ist irgendwas für Lifetime."}, {"id": 528, "start": 4140.0, "end": 4141.0, "text": "Fail to execute."}, {"id": 529, "start": 4141.0, "end": 4142.0, "text": "Jetzt geht's schon los."}, {"id": 530, "start": 4142.0, "end": 4152.0, "text": "Jetzt geht's schon los."}, {"id": 531, "start": 4152.0, "end": 4153.0, "text": "Und warum?"}, {"id": 532, "start": 4153.0, "end": 4158.0, "text": "Error."}, {"id": 533, "start": 4158.0, "end": 4164.0, "text": "Ach, weil dann ein Warning an ist oder was?"}, {"id": 534, "start": 4164.0, "end": 4169.0, "text": "Das ist ja schon fast, das nimmt ja schon fast Go Ausmaße an."}, {"id": 535, "start": 4169.0, "end": 4171.0, "text": "Ne, das will ich ausschalten."}, {"id": 536, "start": 4171.0, "end": 4174.0, "text": "Wie macht man solche Flags aus?"}, {"id": 537, "start": 4174.0, "end": 4178.0, "text": "One unused defaults, bloß nicht."}, {"id": 538, "start": 4178.0, "end": 4181.0, "text": "Das erinnert mich fast an Go-Generfe."}, {"id": 539, "start": 4181.0, "end": 4191.0, "text": "Ja, wie macht man das?"}, {"id": 540, "start": 4191.0, "end": 4195.0, "text": "Ok, Agnus, disable Rust."}, {"id": 541, "start": 4195.0, "end": 4198.0, "text": "Allow dead code klingt gut."}, {"id": 542, "start": 4198.0, "end": 4204.0, "text": "Das ist das schönste."}, {"id": 543, "start": 4204.0, "end": 4213.0, "text": "Ok, das geht schon mal nicht."}, {"id": 544, "start": 4213.0, "end": 4216.0, "text": "Compiling your create to WebAssembly failed."}, {"id": 545, "start": 4216.0, "end": 4220.0, "text": "Weil cannot return borrowed ref."}, {"id": 546, "start": 4220.0, "end": 4225.0, "text": "Ok, das ist jetzt diese typische Rust Geschichte."}, {"id": 547, "start": 4225.0, "end": 4230.0, "text": "Rust ist äußerst korrekt darin, wenn du Sachen machst, die out of scope gehen können."}, {"id": 548, "start": 4230.0, "end": 4236.0, "text": "Weil es ist jetzt ja so, ich returne hier eine Referenz zu einem String."}, {"id": 549, "start": 4236.0, "end": 4239.0, "text": "Aber sobald ich hier rausgehe, ist der String ja eigentlich schon wieder gelöscht."}, {"id": 550, "start": 4239.0, "end": 4245.0, "text": "Das heißt, ich returne eigentlich was, was es gar nicht geben sollte."}, {"id": 551, "start": 4245.0, "end": 4248.0, "text": "Kann man einfach String machen?"}, {"id": 552, "start": 4248.0, "end": 4249.0, "text": "Geht sowas?"}, {"id": 553, "start": 4249.0, "end": 4250.0, "text": "Ne, oder?"}, {"id": 554, "start": 4250.0, "end": 4253.0, "text": "Ok, jetzt hab ich keine Ahnung, wie ich den String returne."}, {"id": 555, "start": 4253.0, "end": 4257.0, "text": "Ehrlich gesagt, sodass es funktioniert."}, {"id": 556, "start": 4257.0, "end": 4260.0, "text": "Rust String."}, {"id": 557, "start": 4260.0, "end": 4263.0, "text": "Ich hab wirklich keine Ahnung, wie es funktioniert."}, {"id": 558, "start": 4263.0, "end": 4267.0, "text": "Ich erinnere mich dran, man musste glaube ich String new oder sowas machen, oder?"}, {"id": 559, "start": 4267.0, "end": 4269.0, "text": "String from?"}, {"id": 560, "start": 4269.0, "end": 4274.0, "text": "Sowas muss man glaube ich machen."}, {"id": 561, "start": 4274.0, "end": 4275.0, "text": "Oder new?"}, {"id": 562, "start": 4275.0, "end": 4277.0, "text": "Irgendwie sowas war das doch, oder?"}, {"id": 563, "start": 4277.0, "end": 4280.0, "text": "Wie gesagt, ich hab Rust vor Jahren mal gemacht, oder?"}, {"id": 564, "start": 4280.0, "end": 4284.0, "text": "From?"}, {"id": 565, "start": 4284.0, "end": 4291.0, "text": "Oder into String?"}, {"id": 566, "start": 4291.0, "end": 4296.0, "text": "Ne."}, {"id": 567, "start": 4296.0, "end": 4301.0, "text": "Und jetzt keine Referenz, sondern direkt in String, oder wie, oder was, oder wo?"}, {"id": 568, "start": 4301.0, "end": 4303.0, "text": "Aha, nein."}, {"id": 569, "start": 4303.0, "end": 4306.0, "text": "Das geht auch nicht."}, {"id": 570, "start": 4306.0, "end": 4317.0, "text": "Method not found in Static String."}, {"id": 571, "start": 4317.0, "end": 4321.0, "text": "Das stimmt, Patrick, das ist wirklich so, true String."}, {"id": 572, "start": 4321.0, "end": 4323.0, "text": "Ok, das hat jetzt funktioniert."}, {"id": 573, "start": 4323.0, "end": 4326.0, "text": "Ich hab keine Ahnung, was der Unterschied ist zwischen..."}, {"id": 574, "start": 4326.0, "end": 4329.0, "text": "Ah, das eine ist bloß eine Referenz oder so?"}, {"id": 575, "start": 4329.0, "end": 4330.0, "text": "Ne."}, {"id": 576, "start": 4330.0, "end": 4332.0, "text": "Hä?"}, {"id": 577, "start": 4332.0, "end": 4347.0, "text": "Ok, das eine gibt ein Box String und das andere gibt ein String."}, {"id": 578, "start": 4347.0, "end": 4355.0, "text": "Alles klar."}, {"id": 579, "start": 4355.0, "end": 4363.0, "text": "Ok, also Strings hin und her geht auch relativ einfach."}, {"id": 580, "start": 4363.0, "end": 4367.0, "text": "So, jetzt, jetzt..."}, {"id": 581, "start": 4367.0, "end": 4373.0, "text": "Also, die Sache ist die, wenn wir irgendwie mal..."}, {"id": 582, "start": 4373.0, "end": 4383.0, "text": "Raw Daten returnen wollen, brauchen wir einen Byte Array."}, {"id": 583, "start": 4383.0, "end": 4385.0, "text": "Ähm, wann war das?"}, {"id": 584, "start": 4385.0, "end": 4387.0, "text": "Let?"}, {"id": 585, "start": 4387.0, "end": 4389.0, "text": "Das war auch Let."}, {"id": 586, "start": 4389.0, "end": 4391.0, "text": "Let Mut?"}, {"id": 587, "start": 4391.0, "end": 4393.0, "text": "Boah, mein Rust ist lange her."}, {"id": 588, "start": 4393.0, "end": 4395.0, "text": "Und jetzt U8?"}, {"id": 589, "start": 4395.0, "end": 4397.0, "text": "Ne."}, {"id": 590, "start": 4397.0, "end": 4399.0, "text": "U8?"}, {"id": 591, "start": 4399.0, "end": 4403.0, "text": "Ach du große Güte, was ist denn das?"}, {"id": 592, "start": 4403.0, "end": 4405.0, "text": "Hardware Instructions?"}, {"id": 593, "start": 4405.0, "end": 4407.0, "text": "Ne."}, {"id": 594, "start": 4407.0, "end": 4409.0, "text": "Also, also."}, {"id": 595, "start": 4409.0, "end": 4411.0, "text": "Byte Array Rust."}, {"id": 596, "start": 4411.0, "end": 4414.0, "text": "Ich hab keine Ahnung."}, {"id": 597, "start": 4414.0, "end": 4416.0, "text": "Ich mein, das heißt einfach Byte Array?"}, {"id": 598, "start": 4416.0, "end": 4422.0, "text": "Wirklich?"}, {"id": 599, "start": 4422.0, "end": 4427.0, "text": "Ne, das ist, das ist irgendein, das ist irgendein Create."}, {"id": 600, "start": 4427.0, "end": 4429.0, "text": "How do I create an empty Byte Array?"}, {"id": 601, "start": 4429.0, "end": 4431.0, "text": "Genau das will ich wissen."}, {"id": 602, "start": 4431.0, "end": 4433.0, "text": "Weg, weg war's."}, {"id": 603, "start": 4433.0, "end": 4436.0, "text": "Ich erinnere mich wieder."}, {"id": 604, "start": 4436.0, "end": 4438.0, "text": "Wobei, ne, ne."}, {"id": 605, "start": 4438.0, "end": 4450.0, "text": "Byte Array, ach so war die, war die Array sonntags."}, {"id": 606, "start": 4450.0, "end": 4452.0, "text": "Wie nimmst du Underscore Result?"}, {"id": 607, "start": 4452.0, "end": 4454.0, "text": "Ne."}, {"id": 608, "start": 4454.0, "end": 4456.0, "text": "Okay, also das ist ein I32."}, {"id": 609, "start": 4456.0, "end": 4458.0, "text": "Und konnte man das an U8 oder so hinten dran machen?"}, {"id": 610, "start": 4458.0, "end": 4460.0, "text": "Ja, genau."}, {"id": 611, "start": 4460.0, "end": 4466.0, "text": "So, das ist jetzt ein Byte Array mit 24 Stellen."}, {"id": 612, "start": 4466.0, "end": 4474.0, "text": "Das ist doch richtig so, ne?"}, {"id": 613, "start": 4474.0, "end": 4476.0, "text": "So, okay."}, {"id": 614, "start": 4476.0, "end": 4478.0, "text": "Mutable muss es nicht sein."}, {"id": 615, "start": 4478.0, "end": 4486.0, "text": "Und das kann ich jetzt aber höchstwahrscheinlich nicht einfach so return."}, {"id": 616, "start": 4486.0, "end": 4488.0, "text": "Ist das hier der return Wert?"}, {"id": 617, "start": 4488.0, "end": 4490.0, "text": "Ne."}, {"id": 618, "start": 4490.0, "end": 4492.0, "text": "Okay."}, {"id": 619, "start": 4492.0, "end": 4494.0, "text": "How to return a Byte Array."}, {"id": 620, "start": 4494.0, "end": 4496.0, "text": "Rust."}, {"id": 621, "start": 4496.0, "end": 4498.0, "text": "How return Byte Array."}, {"id": 622, "start": 4498.0, "end": 4504.0, "text": "Ach, muss man, muss man."}, {"id": 623, "start": 4504.0, "end": 4508.0, "text": "Und U8 ist es."}, {"id": 624, "start": 4508.0, "end": 4510.0, "text": "Ah."}, {"id": 625, "start": 4510.0, "end": 4516.0, "text": "Aber Und U8 kann doch nicht funktionieren, weil sobald das hier aus dem Scope geht,"}, {"id": 626, "start": 4516.0, "end": 4524.0, "text": "und das geht hier aus dem Scope beim return, ist es doch undify, das erlauben die mir doch garantiert nicht."}, {"id": 627, "start": 4524.0, "end": 4530.0, "text": "Das geht mit Vektors, geht das wahrscheinlich."}, {"id": 628, "start": 4530.0, "end": 4538.0, "text": "Okay, das funktioniert."}, {"id": 629, "start": 4538.0, "end": 4540.0, "text": "Okay."}, {"id": 630, "start": 4540.0, "end": 4542.0, "text": "Und die Rust-Logik ist jetzt folgendes."}, {"id": 631, "start": 4542.0, "end": 4548.0, "text": "Solange ich keine Referenz returne, ist das okay, weil dann returne ich ja Ownership zum Aufrufer von diesem Ding."}, {"id": 632, "start": 4548.0, "end": 4552.0, "text": "Also quasi, dass der Aufrufer übernimmt das dann quasi."}, {"id": 633, "start": 4552.0, "end": 4554.0, "text": "Ich, wie gesagt, ich hab Verurteil..."}, {"id": 634, "start": 4554.0, "end": 4556.0, "text": "Ach, fick dich, Alter."}, {"id": 635, "start": 4556.0, "end": 4558.0, "text": "Was willst du denn?"}, {"id": 636, "start": 4558.0, "end": 4560.0, "text": "Oh."}, {"id": 637, "start": 4560.0, "end": 4562.0, "text": "Das funktioniert nicht."}, {"id": 638, "start": 4562.0, "end": 4564.0, "text": "Okay."}, {"id": 639, "start": 4564.0, "end": 4566.0, "text": "Das kann man nicht returnen."}, {"id": 640, "start": 4566.0, "end": 4570.0, "text": "Das muss man irgendwie anders machen."}, {"id": 641, "start": 4570.0, "end": 4572.0, "text": "Kann man den Vektor returnen?"}, {"id": 642, "start": 4572.0, "end": 4580.0, "text": "Wahrscheinlich auch nicht."}, {"id": 643, "start": 4580.0, "end": 4582.0, "text": "Äh."}, {"id": 644, "start": 4582.0, "end": 4584.0, "text": "Moment, wie ging das nochmal?"}, {"id": 645, "start": 4584.0, "end": 4586.0, "text": "Weg."}, {"id": 646, "start": 4586.0, "end": 4588.0, "text": "Einfach weg, Ausrufezeichen."}, {"id": 647, "start": 4588.0, "end": 4590.0, "text": "Und jetzt ist er leer, oder?"}, {"id": 648, "start": 4590.0, "end": 4592.0, "text": "Leerer Vektor?"}, {"id": 649, "start": 4592.0, "end": 4594.0, "text": "Ne."}, {"id": 650, "start": 4594.0, "end": 4596.0, "text": "Eins."}, {"id": 651, "start": 4596.0, "end": 4598.0, "text": "Konnte man sowas machen?"}, {"id": 652, "start": 4598.0, "end": 4600.0, "text": "Eins."}, {"id": 653, "start": 4600.0, "end": 4602.0, "text": "U8."}, {"id": 654, "start": 4602.0, "end": 4604.0, "text": "Oh."}, {"id": 655, "start": 4604.0, "end": 4606.0, "text": "So, und jetzt muss ich was returnen?"}, {"id": 656, "start": 4606.0, "end": 4608.0, "text": "Into?"}, {"id": 657, "start": 4608.0, "end": 4610.0, "text": "Rockslice."}, {"id": 658, "start": 4610.0, "end": 4614.0, "text": "Alter, das ist so ein Fiveheader-Kram, diese Sprache, ist der Wahnsinn."}, {"id": 659, "start": 4614.0, "end": 4618.0, "text": "Äh, und jetzt müssen wir wahrscheinlich einen Vektor returnen."}, {"id": 660, "start": 4618.0, "end": 4620.0, "text": "Wobei, mit einem Vektor kann ja JavaScript nichts anfangen."}, {"id": 661, "start": 4620.0, "end": 4624.0, "text": "Das kann ja, das kann ja eigentlich gar nicht funktionieren."}, {"id": 662, "start": 4624.0, "end": 4626.0, "text": "Doch, das geht."}, {"id": 663, "start": 4626.0, "end": 4628.0, "text": "Ah."}, {"id": 664, "start": 4628.0, "end": 4632.0, "text": "Der macht da gleich einen kompatiblen JavaScript-Typ draus."}, {"id": 665, "start": 4632.0, "end": 4634.0, "text": "Der macht ein U8-Array draus."}, {"id": 666, "start": 4634.0, "end": 4636.0, "text": "Das ist, das ist sehr gut."}, {"id": 667, "start": 4636.0, "end": 4638.0, "text": "Das ist sehr gut, dass der das macht."}, {"id": 668, "start": 4638.0, "end": 4644.0, "text": "Weil so kriege ich mein Zeug von FFmpeg, die codet in Frames, auch zurück nach JavaScript."}, {"id": 669, "start": 4644.0, "end": 4646.0, "text": "Okay, das ist Fiveheader-Time."}, {"id": 670, "start": 4646.0, "end": 4648.0, "text": "Das ist cool, dass sie das unter der Haube machen."}, {"id": 671, "start": 4648.0, "end": 4652.0, "text": "Ich stelle mir vor, wenn man das von Hand machen muss, ist eklig."}, {"id": 672, "start": 4652.0, "end": 4660.0, "text": "Ich stelle mir vor, wenn man das von Hand machen muss, ist eklig."}, {"id": 673, "start": 4660.0, "end": 4662.0, "text": "Das können wir jetzt theoretisch sogar auslesen."}, {"id": 674, "start": 4662.0, "end": 4664.0, "text": "Kann man sagen, keine Ahnung."}, {"id": 675, "start": 4664.0, "end": 4668.0, "text": "I, 0, das sollte 1 sein."}, {"id": 676, "start": 4668.0, "end": 4670.0, "text": "Ja, ist 1, passt."}, {"id": 677, "start": 4670.0, "end": 4672.0, "text": "Sehr cool, das ist nice."}, {"id": 678, "start": 4672.0, "end": 4678.0, "text": "Dein Returnvent muss den Into Wasom Abitrade implementieren."}, {"id": 679, "start": 4678.0, "end": 4681.0, "text": "Ich hoffe, dass alles, das schon standardmäßig, was ich brauche, drin ist."}, {"id": 680, "start": 4681.0, "end": 4686.0, "text": "Okay, das ist tatsächlich äußerst spannend."}, {"id": 681, "start": 4686.0, "end": 4689.0, "text": "Das finde ich cool."}, {"id": 682, "start": 4689.0, "end": 4694.0, "text": "Ich will jetzt nicht gleich mit FFmpeg hier draufhauen, weil FFmpeg ist eigentlich das, was ich ausprobieren will."}, {"id": 683, "start": 4694.0, "end": 4702.0, "text": "Weil ich gehe davon aus, wir werden noch ganz viele Probleme rennen, um überhaupt FFmpeg zum Laufen zu bekommen."}, {"id": 684, "start": 4702.0, "end": 4704.0, "text": "Man kann es ja mal probieren."}, {"id": 685, "start": 4704.0, "end": 4710.0, "text": "Direkt nach dem Hallo Welt und Print 1 gleich mal FFmpeg included und auf geht's."}, {"id": 686, "start": 4710.0, "end": 4712.0, "text": "Ich meine, warum nicht?"}, {"id": 687, "start": 4712.0, "end": 4715.0, "text": "Scheiß drauf."}, {"id": 688, "start": 4715.0, "end": 4717.0, "text": "Was soll FFmpeg überhaupt machen?"}, {"id": 689, "start": 4717.0, "end": 4723.0, "text": "Also, ich, wartet mal."}, {"id": 690, "start": 4723.0, "end": 4728.0, "text": "Also ich habe mir folgendes überlegt, rein um sich mal ein bisschen mit Rust und WebAssembly zu beschäftigen."}, {"id": 691, "start": 4728.0, "end": 4731.0, "text": "Wir haben noch den EPG-Champ programmiert."}, {"id": 692, "start": 4731.0, "end": 4737.0, "text": "Allerdings, also ich will das nicht releasemäßig in den EPG-Champ einbauen."}, {"id": 693, "start": 4737.0, "end": 4741.0, "text": "Wer den EPG-Champ nicht kann, ich zeige den EPG-Champ nochmal."}, {"id": 694, "start": 4741.0, "end": 4748.0, "text": "Das ist ein Webfrontend für TV-Headend, dass man auch ordentlich auf dem Tablet und überall sein EPG angucken kann."}, {"id": 695, "start": 4748.0, "end": 4754.0, "text": "So, und ich habe mir jetzt gedacht, und wie gesagt, nicht releasefertig einbauen."}, {"id": 696, "start": 4754.0, "end": 4761.0, "text": "Man könnte doch beispielsweise einbauen, dass man sich ein Video streamen kann von TV-Headend."}, {"id": 697, "start": 4761.0, "end": 4768.0, "text": "Das geht standardmäßig schon. FFmpeg kann das auf TV-Headend-Server-Seite transcoden für ein."}, {"id": 698, "start": 4768.0, "end": 4777.0, "text": "Weil der Browser kann ja kein mpeg2h263, ist das glaube ich dann."}, {"id": 699, "start": 4777.0, "end": 4780.0, "text": "Der Vorgänger von H264."}, {"id": 700, "start": 4780.0, "end": 4783.0, "text": "Also das, was man heute so zum größten Teil des Videos hat."}, {"id": 701, "start": 4783.0, "end": 4787.0, "text": "Das können Browser nicht. Und deswegen habe ich mir gedacht, warum Server-seitig machen,"}, {"id": 702, "start": 4787.0, "end": 4794.0, "text": "wenn ich mir das Video schicken lassen kann und on the fly mit FFmpeg im Browser transcoden kann."}, {"id": 703, "start": 4794.0, "end": 4799.0, "text": "Nicht, dass das irgendwie produktionsreif mal werden würde."}, {"id": 704, "start": 4799.0, "end": 4803.0, "text": "Aber mich interessiert einfach, ob das performanstechnisch möglich wäre."}, {"id": 705, "start": 4803.0, "end": 4815.0, "text": "Also kann man mit FFmpeg im Browser ein SD-Video, also PAL hat ja nur 720x580 oder sowas."}, {"id": 706, "start": 4815.0, "end": 4819.0, "text": "Ich brauche was im FFmpeg. Richtig."}, {"id": 707, "start": 4819.0, "end": 4827.0, "text": "Und von der Idee her würde ich es dann so machen."}, {"id": 708, "start": 4827.0, "end": 4844.0, "text": "Du lässt dir von einem Endpunkt, von einem Web-Server-Endpunkt streamen mir das Video-File runter."}, {"id": 709, "start": 4844.0, "end": 4856.0, "text": "Übergebe das häppchenweise an FFmpeg in Wasm und krieg einen decodeten Frame zurück."}, {"id": 710, "start": 4856.0, "end": 4858.0, "text": "Soweit die Idee."}, {"id": 711, "start": 4858.0, "end": 4861.0, "text": "Das hört sich jetzt abstrakt gesehen relativ easy an."}, {"id": 712, "start": 4861.0, "end": 4867.0, "text": "Aber ich glaube praktisch ist das durchaus ziemlicher Abfuck und gar nicht so easy, wenn man sich das vorstellt."}, {"id": 713, "start": 4867.0, "end": 4872.0, "text": "Das heißt mein Ziel wäre jetzt erst mal zwischenzeitlich, ob ich überhaupt FFmpeg eingebunden kriege"}, {"id": 714, "start": 4872.0, "end": 4876.0, "text": "und ob ich vielleicht ein Test-Bild aus FFmpeg raus bekomme."}, {"id": 715, "start": 4876.0, "end": 4880.0, "text": "FFmpeg kann ja Test-Bilder generieren, da brauche ich keinen Input."}, {"id": 716, "start": 4880.0, "end": 4884.0, "text": "RGB, RGB, Test-Bilder."}, {"id": 717, "start": 4884.0, "end": 4897.0, "text": "Also guckt, FFmpeg kann FFmpeg Generate, Test, Test-Pattern, Test-Pattern."}, {"id": 718, "start": 4897.0, "end": 4903.0, "text": "Ja ne, ne, das ist besser."}, {"id": 719, "start": 4903.0, "end": 4907.0, "text": "Oh fuck, das musst du mit Filter machen. Mit Filter ist schonmal eklig."}, {"id": 720, "start": 4907.0, "end": 4910.0, "text": "Filter will man eigentlich nicht, nicht."}, {"id": 721, "start": 4910.0, "end": 4913.0, "text": "Ja, da kommt so ein Test-Bild raus."}, {"id": 722, "start": 4913.0, "end": 4917.0, "text": "Oder wir nehmen einfach, wir nehmen einfach einen PNG oder irgendwas."}, {"id": 723, "start": 4917.0, "end": 4922.0, "text": "Irgendwie etwas. Aber wie kriegen wir denn jetzt überhaupt FFmpeg?"}, {"id": 724, "start": 4922.0, "end": 4925.0, "text": "Rust da rein."}, {"id": 725, "start": 4925.0, "end": 4929.0, "text": "Safe FFmpeg Wrapper, das brauchen wir nicht."}, {"id": 726, "start": 4929.0, "end": 4933.0, "text": "Simple and Safe Rust Interface, das brauchen wir schon eher."}, {"id": 727, "start": 4933.0, "end": 4935.0, "text": "Rust AC FFmpeg."}, {"id": 728, "start": 4935.0, "end": 4941.0, "text": "Also ich brauch was, wo ich wirklich Raw Zugriff auf FFmpeg habe."}, {"id": 729, "start": 4941.0, "end": 4944.0, "text": "Und zwar Wasm."}, {"id": 730, "start": 4944.0, "end": 4949.0, "text": "Nicht einfach nur Rust FFmpeg, Rust Wasm FFmpeg."}, {"id": 731, "start": 4949.0, "end": 4954.0, "text": "Rust FFmpeg Wasi, das klingt doch schonmal gut."}, {"id": 732, "start": 4954.0, "end": 4962.0, "text": "Letztes Jahr reicht mir immer noch."}, {"id": 733, "start": 4962.0, "end": 4967.0, "text": "FFmpeg Libraries pre-compiled for WebAssembly Wasi als..."}, {"id": 734, "start": 4967.0, "end": 4973.0, "text": "Ach du Scheiße, ich hab keine Ahnung."}, {"id": 735, "start": 4973.0, "end": 4975.0, "text": "Null?"}, {"id": 736, "start": 4975.0, "end": 4977.0, "text": "Ey, das klappt doch im Leben nicht."}, {"id": 737, "start": 4977.0, "end": 4981.0, "text": "Das klappt doch im Leben nicht."}, {"id": 738, "start": 4981.0, "end": 4984.0, "text": "MonkaS"}, {"id": 739, "start": 4984.0, "end": 4991.0, "text": "Ist das..."}, {"id": 740, "start": 4991.0, "end": 4993.0, "text": "Source"}, {"id": 741, "start": 4993.0, "end": 4995.0, "text": "AV Codec RS"}, {"id": 742, "start": 4995.0, "end": 4997.0, "text": "Geh auf."}, {"id": 743, "start": 4997.0, "end": 4999.0, "text": "Okay, das sieht nach..."}, {"id": 744, "start": 4999.0, "end": 5003.0, "text": "Das sieht nach FFmpeg aus."}, {"id": 745, "start": 5003.0, "end": 5005.0, "text": "Das sieht nach FFmpeg aus, ja."}, {"id": 746, "start": 5005.0, "end": 5009.0, "text": "Alter, der hat sich aber einer Mühe gegeben."}, {"id": 747, "start": 5009.0, "end": 5013.0, "text": "Ich mach das jetzt einfach rein, ich hab keine Ahnung, was ich da treibe."}, {"id": 748, "start": 5013.0, "end": 5017.0, "text": "Weil mein Ziel ist eigentlich wirklich, ich will FFmpeg reinkriegen."}, {"id": 749, "start": 5017.0, "end": 5018.0, "text": "Ne, so."}, {"id": 750, "start": 5018.0, "end": 5020.0, "text": "Version 0, alles klar."}, {"id": 751, "start": 5020.0, "end": 5021.0, "text": "Bild."}, {"id": 752, "start": 5021.0, "end": 5026.0, "text": "Das kackt wahrscheinlich schon beim Bild ab gleich."}, {"id": 753, "start": 5026.0, "end": 5028.0, "text": "Ne, ne, ne."}, {"id": 754, "start": 5028.0, "end": 5030.0, "text": "Help."}, {"id": 755, "start": 5030.0, "end": 5034.0, "text": "Convert identifier to snake case."}, {"id": 756, "start": 5034.0, "end": 5035.0, "text": "Aha, okay."}, {"id": 757, "start": 5035.0, "end": 5040.0, "text": "Also, Rust Style ist nicht Return Pog, sondern Return Pog."}, {"id": 758, "start": 5040.0, "end": 5044.0, "text": "So macht man das, so machen das also die coolen Rust-Leute."}, {"id": 759, "start": 5044.0, "end": 5046.0, "text": "Snake Case."}, {"id": 760, "start": 5046.0, "end": 5054.0, "text": "Nicht Pascal, nicht Kebab Case, Snake Case."}, {"id": 761, "start": 5054.0, "end": 5057.0, "text": "Return Pog."}, {"id": 762, "start": 5057.0, "end": 5064.0, "text": "Noch funktioniert's, noch geht's, alles gut."}, {"id": 763, "start": 5064.0, "end": 5066.0, "text": "Okay, und wie würd ich jetzt..."}, {"id": 764, "start": 5066.0, "end": 5071.0, "text": "Okay, ich hab keine Ahnung, wie ich FFmpeg verwenden würde."}, {"id": 765, "start": 5071.0, "end": 5079.0, "text": "So, immer include und gucken, ob's immer noch kompiliert."}, {"id": 766, "start": 5079.0, "end": 5082.0, "text": "Nein."}, {"id": 767, "start": 5082.0, "end": 5084.0, "text": "Unknown Instruction Block."}, {"id": 768, "start": 5084.0, "end": 5092.0, "text": "Na, geil."}, {"id": 769, "start": 5092.0, "end": 5104.0, "text": "Ich glaub, das kann ich vergessen."}, {"id": 770, "start": 5104.0, "end": 5106.0, "text": "Ich mein, ist ja auch geil."}, {"id": 771, "start": 5106.0, "end": 5120.0, "text": "Die Fehlermeldung ist jetzt nicht so das geilste, oder?"}, {"id": 772, "start": 5120.0, "end": 5128.0, "text": "Rust Backtrace 1."}, {"id": 773, "start": 5128.0, "end": 5131.0, "text": "What the fuck?"}, {"id": 774, "start": 5131.0, "end": 5136.0, "text": "Rust Begin Unwind."}, {"id": 775, "start": 5136.0, "end": 5139.0, "text": "Okay, also..."}, {"id": 776, "start": 5139.0, "end": 5144.0, "text": "Das funktioniert nicht."}, {"id": 777, "start": 5144.0, "end": 5149.0, "text": "AV Codec brauch ich, wenn überhaupt."}, {"id": 778, "start": 5149.0, "end": 5157.0, "text": "Nee, Leute, also FFmpeg krieg ich da nicht so einfach rein, wie ich mir das gedacht hab."}, {"id": 779, "start": 5157.0, "end": 5163.0, "text": "Hat irgendjemand einen Plan, was ich jetzt überhaupt gucken könnte, wo der Fehler ist?"}, {"id": 780, "start": 5163.0, "end": 5170.0, "text": "Ich glaub, man hat einfach gelitten, hör."}, {"id": 781, "start": 5170.0, "end": 5185.0, "text": "Exited Status Code 101, super, da weiß man Bescheid."}, {"id": 782, "start": 5185.0, "end": 5188.0, "text": "X Autist Prime, Dankeschön für den Sub."}, {"id": 783, "start": 5188.0, "end": 5195.0, "text": "Nee, das kannst du vergessen, sobald ich diesen Krempel hier einbinde, dann ist... dann kackt der ab."}, {"id": 784, "start": 5195.0, "end": 5198.0, "text": "Ohne geht's."}, {"id": 785, "start": 5198.0, "end": 5203.0, "text": "Issues, Closed."}, {"id": 786, "start": 5203.0, "end": 5208.0, "text": "Document Build Process."}, {"id": 787, "start": 5208.0, "end": 5215.0, "text": "Ich hab legit keine Ahnung, was ich machen soll."}, {"id": 788, "start": 5215.0, "end": 5218.0, "text": "Gibt auch FFmpeg was im Jahr, das bringt mir aber nichts."}, {"id": 789, "start": 5218.0, "end": 5223.0, "text": "Das ist quasi der Kommandozahlen-Rapper."}, {"id": 790, "start": 5223.0, "end": 5231.0, "text": "Ich brauch Low-Level-Access, oder hat FFmpeg was im wirklich Low-Level-Access, dass ich sagen kann, ich will AV-Packages haben und sowas?"}, {"id": 791, "start": 5231.0, "end": 5237.0, "text": "Ich glaube nicht, das ist das Kommandozahlen-Tool gerappt."}, {"id": 792, "start": 5237.0, "end": 5240.0, "text": "Also das hab ich mir nämlich letztes Mal auf dem Handy angeguckt."}, {"id": 793, "start": 5240.0, "end": 5247.0, "text": "Es gibt zwei Sachen, es gibt FFmpeg was im und es gibt noch ein anderes Projekt."}, {"id": 794, "start": 5247.0, "end": 5258.0, "text": "Und die machen dann bloß so Sachen, wie zum Beispiel sowas hier, die quasi aufrufen von der FFmpeg Kommandozahlen-Dings und..."}, {"id": 795, "start": 5258.0, "end": 5260.0, "text": "Das will ich nicht."}, {"id": 796, "start": 5260.0, "end": 5263.0, "text": "Okay, also dieser Krempel funktioniert, also schauen wir mal nicht."}, {"id": 797, "start": 5263.0, "end": 5266.0, "text": "Rust FFmpeg war so..."}, {"id": 798, "start": 5266.0, "end": 5271.0, "text": "Da find ich bloß das."}, {"id": 799, "start": 5271.0, "end": 5281.0, "text": "Das sagt."}, {"id": 800, "start": 5281.0, "end": 5284.0, "text": "Okay, dann weiß ich nicht, was ich jetzt machen soll."}, {"id": 801, "start": 5284.0, "end": 5290.0, "text": "Ich mein, das ist ja komplett nichts sagen, vor 15 Monaten irgendwann mal aktualisiert."}, {"id": 802, "start": 5290.0, "end": 5294.0, "text": "Das geht wahrscheinlich einfach in der aktuellen Rust-Version schon gar nicht mehr."}, {"id": 803, "start": 5294.0, "end": 5298.0, "text": "Sobald ich das einbinde, ist F angesagt."}, {"id": 804, "start": 5298.0, "end": 5301.0, "text": "Kann er nicht, kann er nicht binden."}, {"id": 805, "start": 5301.0, "end": 5305.0, "text": "Und ich mein, ich hab das gemacht, was der Typ geschrieben hat."}, {"id": 806, "start": 5305.0, "end": 5308.0, "text": "Exakt das eingetragen."}, {"id": 807, "start": 5308.0, "end": 5309.0, "text": "Geht nicht."}, {"id": 808, "start": 5309.0, "end": 5311.0, "text": "Tja."}, {"id": 809, "start": 5311.0, "end": 5320.0, "text": "Dann wird das mit irgendwelchen FFmpeg Sachen heute schon mal erst nichts."}, {"id": 810, "start": 5320.0, "end": 5325.0, "text": "Unknown Instruction Block."}, {"id": 811, "start": 5325.0, "end": 5327.0, "text": "Wirklich, keine Ahnung, keine Ahnung."}, {"id": 812, "start": 5327.0, "end": 5330.0, "text": "Das wäre aber auch zu schön gewesen, wenn das einfach funktioniert hätte."}, {"id": 813, "start": 5330.0, "end": 5332.0, "text": "Schau mal die Fehlermeldung näher."}, {"id": 814, "start": 5332.0, "end": 5337.0, "text": "Es gibt keine wirkliche Fehlermeldung zu googlen."}, {"id": 815, "start": 5337.0, "end": 5343.0, "text": "Das ist alles so Generic Zeugs, wo du nichts mit wirklich anfangen kannst."}, {"id": 816, "start": 5343.0, "end": 5349.0, "text": "Ja."}, {"id": 817, "start": 5349.0, "end": 5351.0, "text": "Ja gut, ich hab es halt rausgeschmissen."}, {"id": 818, "start": 5351.0, "end": 5352.0, "text": "Naja."}, {"id": 819, "start": 5352.0, "end": 5356.0, "text": "Aber von der Idee her wäre ja jeder Krempel drinnen gewesen, den ich haben will."}, {"id": 820, "start": 5356.0, "end": 5359.0, "text": "AV Packet."}, {"id": 821, "start": 5359.0, "end": 5362.0, "text": "Genau, diesen Krempel will ich haben."}, {"id": 822, "start": 5362.0, "end": 5365.0, "text": "AV Packet zum Beispiel."}, {"id": 823, "start": 5365.0, "end": 5372.0, "text": "AV Packet und dann will ich den Stream lesen und sonst was."}, {"id": 824, "start": 5372.0, "end": 5374.0, "text": "Ja, keine Ahnung, wie das funktioniert."}, {"id": 825, "start": 5374.0, "end": 5378.0, "text": "Es gibt ja auch, es gibt ja anscheinend auch keine ordentlichen Anleitungen dafür."}, {"id": 826, "start": 5378.0, "end": 5385.0, "text": "Wir können mal suchen, ob wir dazu was finden."}, {"id": 827, "start": 5385.0, "end": 5388.0, "text": "Docs, ES."}, {"id": 828, "start": 5388.0, "end": 5389.0, "text": "Usage."}, {"id": 829, "start": 5389.0, "end": 5394.0, "text": "Tja."}, {"id": 830, "start": 5394.0, "end": 5399.0, "text": "Normalerweise muss man auch sowas wie FFM Pack."}, {"id": 831, "start": 5399.0, "end": 5400.0, "text": "Load."}, {"id": 832, "start": 5400.0, "end": 5403.0, "text": "Gibt es aber nicht."}, {"id": 833, "start": 5403.0, "end": 5404.0, "text": "FFM Pack."}, {"id": 834, "start": 5404.0, "end": 5407.0, "text": "Load."}, {"id": 835, "start": 5407.0, "end": 5409.0, "text": "New AV Package."}, {"id": 836, "start": 5409.0, "end": 5411.0, "text": "Ne, das geht ja nicht."}, {"id": 837, "start": 5411.0, "end": 5421.0, "text": "Normalerweise machst du AV Packet, A-Log und so Dinger."}, {"id": 838, "start": 5421.0, "end": 5424.0, "text": "Wobei das Rustbindings sind, wer weiß wie das funktioniert."}, {"id": 839, "start": 5424.0, "end": 5428.0, "text": "Call unsafe function requires unsafe function."}, {"id": 840, "start": 5428.0, "end": 5430.0, "text": "Alles klar, unsafe."}, {"id": 841, "start": 5430.0, "end": 5431.0, "text": "Ne."}, {"id": 842, "start": 5431.0, "end": 5435.0, "text": "Unsafe."}, {"id": 843, "start": 5435.0, "end": 5436.0, "text": "Unsafe."}, {"id": 844, "start": 5436.0, "end": 5447.0, "text": "Aha, einfach mal geraten, wo das unsafe hin muss."}, {"id": 845, "start": 5447.0, "end": 5449.0, "text": "Ne."}, {"id": 846, "start": 5449.0, "end": 5451.0, "text": "Aha, das geht nicht."}, {"id": 847, "start": 5451.0, "end": 5452.0, "text": "Aha, aha."}, {"id": 848, "start": 5452.0, "end": 5455.0, "text": "Das müsste ich dann rappen in irgendeine Rust Funktion oder so."}, {"id": 849, "start": 5455.0, "end": 5459.0, "text": "Aber ganz ervernehmt, es kompiliert ja eh nicht."}, {"id": 850, "start": 5459.0, "end": 5462.0, "text": "Also, kann ich jetzt sagen, quasi FM."}, {"id": 851, "start": 5462.0, "end": 5466.0, "text": "Hat es kein Makro oder so für die IDE?"}, {"id": 852, "start": 5466.0, "end": 5467.0, "text": "FM."}, {"id": 853, "start": 5467.0, "end": 5468.0, "text": "CACW."}, {"id": 854, "start": 5468.0, "end": 5471.0, "text": "Eigentlich egal, weil es funktioniert nicht."}, {"id": 855, "start": 5471.0, "end": 5472.0, "text": "Unsafe."}, {"id": 856, "start": 5472.0, "end": 5473.0, "text": "Unsafe."}, {"id": 857, "start": 5473.0, "end": 5487.0, "text": "Ok, wie gesagt, es funktioniert nicht."}, {"id": 858, "start": 5487.0, "end": 5490.0, "text": "Wo ist das Problem?"}, {"id": 859, "start": 5490.0, "end": 5492.0, "text": "Warum könnte er das nicht mal aufrufen?"}, {"id": 860, "start": 5492.0, "end": 5495.0, "text": "Ah, call to unsafe."}, {"id": 861, "start": 5495.0, "end": 5497.0, "text": "Ok, das ist nicht winzig sharp."}, {"id": 862, "start": 5497.0, "end": 5502.0, "text": "Das einmal unsafe reicht und das zieht quasi unsafe mit."}, {"id": 863, "start": 5502.0, "end": 5508.0, "text": "Ok, das würde funktionieren."}, {"id": 864, "start": 5508.0, "end": 5511.0, "text": "Ne, also das funktioniert nicht."}, {"id": 865, "start": 5511.0, "end": 5514.0, "text": "Funktioniert anscheinend, ja."}, {"id": 866, "start": 5514.0, "end": 5521.0, "text": "Ja, aber du musst unsafe verwenden, wenn du raw ffmpeg verwenden willst."}, {"id": 867, "start": 5521.0, "end": 5523.0, "text": "Aber ganz ervernehmt, es funktioniert ja eh nicht."}, {"id": 868, "start": 5523.0, "end": 5529.0, "text": "Er ist der Meinung, äh, ja, panicked."}, {"id": 869, "start": 5529.0, "end": 5531.0, "text": "Block."}, {"id": 870, "start": 5531.0, "end": 5535.0, "text": "Und man findet dazu auch nichts."}, {"id": 871, "start": 5535.0, "end": 5543.0, "text": "Wasm."}, {"id": 872, "start": 5543.0, "end": 5545.0, "text": "Und ansonsten, es gibt da keine README dazu."}, {"id": 873, "start": 5545.0, "end": 5547.0, "text": "Das ist halt sehr..."}, {"id": 874, "start": 5547.0, "end": 5552.0, "text": "Ok, Rust, ffmpeg, github."}, {"id": 875, "start": 5552.0, "end": 5554.0, "text": "Ich will keinen safe wrapper haben."}, {"id": 876, "start": 5554.0, "end": 5556.0, "text": "Wasm."}, {"id": 877, "start": 5556.0, "end": 5558.0, "text": "Äh, ich..."}, {"id": 878, "start": 5558.0, "end": 5561.0, "text": "Es wird nichts großartig gebastelt."}, {"id": 879, "start": 5561.0, "end": 5565.0, "text": "Ich versuche mir gerade Rust mit WebAssembly anzugucken."}, {"id": 880, "start": 5565.0, "end": 5568.0, "text": "Also irgendwann mal will ich..."}, {"id": 881, "start": 5568.0, "end": 5570.0, "text": "Kann man Features hinzufügen vielleicht?"}, {"id": 882, "start": 5570.0, "end": 5574.0, "text": "Irgendwann mal will ich ffmpeg ausprobieren im Browser damit."}, {"id": 883, "start": 5574.0, "end": 5576.0, "text": "Aber das ist nicht wirklich Ziel."}, {"id": 884, "start": 5576.0, "end": 5577.0, "text": "Ich hab' bloß gedacht, es ist einfach."}, {"id": 885, "start": 5577.0, "end": 5578.0, "text": "Package einbinden und es geht."}, {"id": 886, "start": 5578.0, "end": 5584.0, "text": "Aber so einfach ist es nicht."}, {"id": 887, "start": 5584.0, "end": 5586.0, "text": "Also ich hab' keine Ahnung, wie man das bildet."}, {"id": 888, "start": 5586.0, "end": 5590.0, "text": "Kann man jetzt aber..."}, {"id": 889, "start": 5590.0, "end": 5592.0, "text": "Rates?"}, {"id": 890, "start": 5592.0, "end": 5595.0, "text": "Was ist, wenn man da jetzt mal nach Web... nach, ähm..."}, {"id": 891, "start": 5595.0, "end": 5598.0, "text": "ffmpeg sucht?"}, {"id": 892, "start": 5598.0, "end": 5601.0, "text": "ffmpeg."}, {"id": 893, "start": 5601.0, "end": 5603.0, "text": "ffmpeg."}, {"id": 894, "start": 5603.0, "end": 5608.0, "text": "Ja, die bräuchte ich, aber ich brauch das für die WebAssembly Version."}, {"id": 895, "start": 5608.0, "end": 5610.0, "text": "Du hast dein Browser zugemacht."}, {"id": 896, "start": 5610.0, "end": 5618.0, "text": "Nee, du hast irgendeine Electron Anwendung zugemacht."}, {"id": 897, "start": 5618.0, "end": 5623.0, "text": "Wasm."}, {"id": 898, "start": 5623.0, "end": 5624.0, "text": "Wasi."}, {"id": 899, "start": 5624.0, "end": 5626.0, "text": "Wasi?"}, {"id": 900, "start": 5626.0, "end": 5627.0, "text": "Da gibt's nur eins."}, {"id": 901, "start": 5627.0, "end": 5628.0, "text": "Ja, das sucked."}, {"id": 902, "start": 5628.0, "end": 5629.0, "text": "Okay, das funktioniert nicht."}, {"id": 903, "start": 5629.0, "end": 5630.0, "text": "Es war Java, war es."}, {"id": 904, "start": 5630.0, "end": 5633.0, "text": "Okay."}, {"id": 905, "start": 5633.0, "end": 5636.0, "text": "Ja, also wie der Shit funktioniert, weiß man nicht."}, {"id": 906, "start": 5636.0, "end": 5640.0, "text": "Document Build Process closed."}, {"id": 907, "start": 5640.0, "end": 5646.0, "text": "Okay."}, {"id": 908, "start": 5646.0, "end": 5647.0, "text": "Was zum..."}, {"id": 909, "start": 5647.0, "end": 5648.0, "text": "Es ist einfach ein Link."}, {"id": 910, "start": 5648.0, "end": 5649.0, "text": "Random auf irgendwas."}, {"id": 911, "start": 5649.0, "end": 5650.0, "text": "Was ist..."}, {"id": 912, "start": 5650.0, "end": 5652.0, "text": "Was ist zig?"}, {"id": 913, "start": 5652.0, "end": 5657.0, "text": "Will der Typ uns irgendeinen Crypto-Miner-Dingsen, oder was?"}, {"id": 914, "start": 5657.0, "end": 5660.0, "text": "Geile Bild-Documentation."}, {"id": 915, "start": 5660.0, "end": 5662.0, "text": "Ganz, ganz grandios, ja."}, {"id": 916, "start": 5662.0, "end": 5663.0, "text": "Da weiß man Bescheid."}, {"id": 917, "start": 5663.0, "end": 5666.0, "text": "Bild zig."}, {"id": 918, "start": 5666.0, "end": 5667.0, "text": "Mhm."}, {"id": 919, "start": 5667.0, "end": 5668.0, "text": "Super."}, {"id": 920, "start": 5668.0, "end": 5689.0, "text": "Jetzt versteh ich alles."}, {"id": 921, "start": 5689.0, "end": 5692.0, "text": "Was zum..."}, {"id": 922, "start": 5692.0, "end": 5698.0, "text": "Ich hab keine Ahnung, was der Typ will."}, {"id": 923, "start": 5698.0, "end": 5699.0, "text": "Okay, das ist mir zu pfeifert."}, {"id": 924, "start": 5699.0, "end": 5702.0, "text": "Ich glaub, das ist nicht so sinnvoll, damit anzufangen."}, {"id": 925, "start": 5702.0, "end": 5708.0, "text": "Das ist mir zu hoch."}, {"id": 926, "start": 5708.0, "end": 5715.0, "text": "Wir machen erst mal zum Üben ein bisschen was anderes."}, {"id": 927, "start": 5715.0, "end": 5717.0, "text": "Kein Schimmer, wie das funktionieren soll."}, {"id": 928, "start": 5717.0, "end": 5725.0, "text": "Ich mein, er schreibt ja explizit, ich muss es nicht kompilieren."}, {"id": 929, "start": 5725.0, "end": 5726.0, "text": "Es ist schon fertig."}, {"id": 930, "start": 5726.0, "end": 5728.0, "text": "Aber das ist anscheinend nicht so."}, {"id": 931, "start": 5728.0, "end": 5734.0, "text": "Hat da nicht mal irgendeiner einen Blogpost oder so zugeschrieben?"}, {"id": 932, "start": 5734.0, "end": 5738.0, "text": "Alter, wir verwenden hier wieder ganz obskure Dinger."}, {"id": 933, "start": 5738.0, "end": 5743.0, "text": "Dank Dennis weiß bestimmt Bescheid."}, {"id": 934, "start": 5743.0, "end": 5748.0, "text": "Nee, also mit FFM Back wird das so und auf die andere Weise nix."}, {"id": 935, "start": 5748.0, "end": 5757.0, "text": "Chat, jemand eine gute Idee, was wir ausprobieren könnten?"}, {"id": 936, "start": 5757.0, "end": 5763.0, "text": "Was könnte man in Rust laufen lassen und dann im Process..."}, {"id": 937, "start": 5763.0, "end": 5764.0, "text": "Wie ist das denn?"}, {"id": 938, "start": 5764.0, "end": 5765.0, "text": "Moment, ich hab eine Idee."}, {"id": 939, "start": 5765.0, "end": 5767.0, "text": "Wie ist das denn mit Multithreading?"}, {"id": 940, "start": 5767.0, "end": 5772.0, "text": "Wie ist das denn mit Multithreading in Rust und in..."}, {"id": 941, "start": 5772.0, "end": 5774.0, "text": "Das wird doch nicht funktionieren, oder?"}, {"id": 942, "start": 5774.0, "end": 5780.0, "text": "Also ich werde doch nicht irgendwas Multithreading können und dann..."}, {"id": 943, "start": 5780.0, "end": 5784.0, "text": "Damit irgendwie JavaScript mit JavaScript interagieren."}, {"id": 944, "start": 5784.0, "end": 5785.0, "text": "Oder geht das?"}, {"id": 945, "start": 5785.0, "end": 5794.0, "text": "Rust, Wasm, Multithreading."}, {"id": 946, "start": 5794.0, "end": 5796.0, "text": "Multithreading, Rust und Wasm."}, {"id": 947, "start": 5796.0, "end": 5802.0, "text": "Okay."}, {"id": 948, "start": 5802.0, "end": 5803.0, "text": "MonkaS."}, {"id": 949, "start": 5803.0, "end": 5806.0, "text": "Alter."}, {"id": 950, "start": 5806.0, "end": 5815.0, "text": "Okay, das ist advanceder Shit."}, {"id": 951, "start": 5815.0, "end": 5824.0, "text": "Das ist einfach alles so krasser Fiveheader Kram."}, {"id": 952, "start": 5824.0, "end": 5827.0, "text": "Ja, alles klar, alles klar, easy."}, {"id": 953, "start": 5827.0, "end": 5828.0, "text": "Kein Ding, ja."}, {"id": 954, "start": 5828.0, "end": 5835.0, "text": "Raytracing Demo."}, {"id": 955, "start": 5835.0, "end": 5838.0, "text": "Helps you create and execute webworkers based threads."}, {"id": 956, "start": 5838.0, "end": 5840.0, "text": "Okay, ja, nice."}, {"id": 957, "start": 5840.0, "end": 5843.0, "text": "Nee, Webworkers kann ich auch so machen."}, {"id": 958, "start": 5843.0, "end": 5855.0, "text": "Okay, ich glaube Multithreading ist keine allzu gute Idee."}, {"id": 959, "start": 5855.0, "end": 5857.0, "text": "Ja, ich dachte man könnte aber das..."}, {"id": 960, "start": 5857.0, "end": 5859.0, "text": "Also man hätte ja das Rendern im Hintergrund machen können."}, {"id": 961, "start": 5859.0, "end": 5865.0, "text": "Also das Video rendern, also das Video transconen."}, {"id": 962, "start": 5865.0, "end": 5868.0, "text": "Ja Leute, ich weiß jetzt gar nicht, was ich gescheit machen soll."}, {"id": 963, "start": 5868.0, "end": 5870.0, "text": "Ich meine, das mit FFmpeg funktioniert nicht."}, {"id": 964, "start": 5870.0, "end": 5874.0, "text": "Ich brauche irgendwie einen Mini-Anwendungscase so."}, {"id": 965, "start": 5874.0, "end": 5878.0, "text": "Irgendwas kleines, wo man ein bisschen basteln könnte."}, {"id": 966, "start": 5878.0, "end": 5881.0, "text": "Was gibt denn diese Mozilla Anleitung noch her?"}, {"id": 967, "start": 5881.0, "end": 5906.0, "text": "Einfach mal Raytracing selber machen, ja, easy."}, {"id": 968, "start": 5906.0, "end": 5913.0, "text": "Gibt es vielleicht einen Rust-Decoder?"}, {"id": 969, "start": 5913.0, "end": 5922.0, "text": "Da brauche ich kein FFmpeg."}, {"id": 970, "start": 5922.0, "end": 5925.0, "text": "Vier Jahre."}, {"id": 971, "start": 5925.0, "end": 5937.0, "text": "Der To-Do-App ist da glaube ich nicht das Richtige."}, {"id": 972, "start": 5937.0, "end": 5939.0, "text": "Oh nee, dann lieber FFmpeg."}, {"id": 973, "start": 5939.0, "end": 5946.0, "text": "In FFmpeg weiß ich, wie der Kram funktioniert."}, {"id": 974, "start": 5946.0, "end": 5949.0, "text": "Leute, ich habe keine Ahnung, was ich machen soll."}, {"id": 975, "start": 5949.0, "end": 5957.0, "text": "Okay, gibt es?"}, {"id": 976, "start": 5957.0, "end": 5976.0, "text": "Wie gesagt, To-Do-App, Ich muss mal gucken, was die Mozilla Anleitung macht."}, {"id": 977, "start": 5976.0, "end": 5982.0, "text": "Nee, das ist..."}, {"id": 978, "start": 5982.0, "end": 5986.0, "text": "Ach, das war so ein Pac-Da-Projekt."}, {"id": 979, "start": 5986.0, "end": 5990.0, "text": "Ja, vielleicht steht da irgendwas interessantes drin, was man ausprobieren könnte."}, {"id": 980, "start": 5990.0, "end": 5992.0, "text": "Wobei Examples Hello World..."}, {"id": 981, "start": 5992.0, "end": 5996.0, "text": "What?"}, {"id": 982, "start": 5996.0, "end": 6013.0, "text": "Ja, das haben wir schon gemacht."}, {"id": 983, "start": 6013.0, "end": 6018.0, "text": "Flashbang sei der."}, {"id": 984, "start": 6018.0, "end": 6021.0, "text": "Ja, die Anleitung haben wir schon durchgemacht."}, {"id": 985, "start": 6021.0, "end": 6025.0, "text": "Google in Dark Mode, Pog."}, {"id": 986, "start": 6025.0, "end": 6030.0, "text": "Leute, mir fällt gerade wirklich nichts ein, als Anwendung."}, {"id": 987, "start": 6030.0, "end": 6032.0, "text": "Das war jetzt ausnahmsweise mal echt so."}, {"id": 988, "start": 6032.0, "end": 6034.0, "text": "Ich habe mich absolut gar nicht darauf vorbereitet."}, {"id": 989, "start": 6034.0, "end": 6036.0, "text": "Ich habe gedacht, wir basteln einfach ein bisschen."}, {"id": 990, "start": 6036.0, "end": 6040.0, "text": "Aber ich weiß echt nicht, was ich basteln soll."}, {"id": 991, "start": 6040.0, "end": 6042.0, "text": "Ich meine, wir haben Sachen returned."}, {"id": 992, "start": 6042.0, "end": 6047.0, "text": "Das ist garantiert nur ein ganz kleiner Bruchteil von dem, was man machen muss."}, {"id": 993, "start": 6047.0, "end": 6055.0, "text": "Aber es fehlt gerade so eine kreative Eingebung, was wir ausprobieren könnten."}, {"id": 994, "start": 6055.0, "end": 6061.0, "text": "Ich meine, wir haben Bites returned."}, {"id": 995, "start": 6061.0, "end": 6065.0, "text": "Und das funktioniert erstaunlich gut."}, {"id": 996, "start": 6065.0, "end": 6067.0, "text": "Was kann Rust WebAssembly besser als JavaScript?"}, {"id": 997, "start": 6067.0, "end": 6069.0, "text": "Ich muss fragen, was WebAssembly besser kann."}, {"id": 998, "start": 6069.0, "end": 6077.0, "text": "WebAssembly ist ja quasi das Target, in das du übersetzt."}, {"id": 999, "start": 6077.0, "end": 6079.0, "text": "Also egal, ob das jetzt von C++ oder von Rust oder von sonst wo aus ist."}, {"id": 1000, "start": 6079.0, "end": 6085.0, "text": "Das ist quasi eine Zwei-Mobility-Runtime, kann man das nicht nennen."}, {"id": 1001, "start": 6085.0, "end": 6091.0, "text": "Das hat sich seit ein paar Jahren etabliert im Browser als JavaScript-Alternative."}, {"id": 1002, "start": 6091.0, "end": 6094.0, "text": "Allerdings weniger, um JavaScript abzulösen."}, {"id": 1003, "start": 6094.0, "end": 6100.0, "text": "Sondern eher als Compiled-Target für andere Programmiersprachen."}, {"id": 1004, "start": 6100.0, "end": 6106.0, "text": "Das heißt, du kannst C++ nehmen, nach WebAssembly übersetzen und im Browser laufen lassen."}, {"id": 1005, "start": 6106.0, "end": 6109.0, "text": "Dementsprechend kannst du auch C++-Libraries verwenden."}, {"id": 1006, "start": 6109.0, "end": 6110.0, "text": "Crypto-Minor zum Beispiel."}, {"id": 1007, "start": 6110.0, "end": 6115.0, "text": "Deswegen kannst du auch C++-Libraries verwenden oder Rust-Libraries verwenden."}, {"id": 1008, "start": 6115.0, "end": 6120.0, "text": "Ich will mir jetzt nicht WebAssembly in C++ noch angucken."}, {"id": 1009, "start": 6120.0, "end": 6122.0, "text": "Da dreh ich am Rat."}, {"id": 1010, "start": 6122.0, "end": 6126.0, "text": "Nur mal just for fun."}, {"id": 1011, "start": 6126.0, "end": 6128.0, "text": "Was im Tutorial."}, {"id": 1012, "start": 6128.0, "end": 6140.0, "text": "So, und nachdem du quasi jetzt eine eigene Low-Level-Sprache im Browser hast,"}, {"id": 1013, "start": 6140.0, "end": 6145.0, "text": "von der du, also in die du kompilieren kannst, von anderen Sprachen aus,"}, {"id": 1014, "start": 6145.0, "end": 6151.0, "text": "kannst du halt mehr oder weniger fast alles im Browser laufen lassen."}, {"id": 1015, "start": 6151.0, "end": 6155.0, "text": "Ich meine, du hast immer noch Beschränkungen, nämlich das, was Browsern nicht erlauben."}, {"id": 1016, "start": 6155.0, "end": 6158.0, "text": "Also zum Beispiel, du kannst es nicht einfach in TCP-Socket aufmachen und sagen,"}, {"id": 1017, "start": 6158.0, "end": 6161.0, "text": "ich lausche da jetzt mal auf neue Requests und sowas."}, {"id": 1018, "start": 6161.0, "end": 6163.0, "text": "Das funktioniert nicht."}, {"id": 1019, "start": 6163.0, "end": 6166.0, "text": "Weil das geht alleine durch die Browser-Sandbox nicht."}, {"id": 1020, "start": 6166.0, "end": 6170.0, "text": "Zu Recht, weil ansonsten hättest du ganz andere Probleme."}, {"id": 1021, "start": 6170.0, "end": 6172.0, "text": "Oder aufs lokale Filesystem zugreifen oder so."}, {"id": 1022, "start": 6172.0, "end": 6176.0, "text": "Das funktioniert nicht."}, {"id": 1023, "start": 6176.0, "end": 6180.0, "text": "Was im Tutorial."}, {"id": 1024, "start": 6180.0, "end": 6190.0, "text": "Oh nee, nein Leute, ich mach garantiert kein C++ jetzt."}, {"id": 1025, "start": 6190.0, "end": 6196.0, "text": "Das fängt schon äußerst Paynes-Champi an."}, {"id": 1026, "start": 6196.0, "end": 6200.0, "text": "Wenn ich das schon sehe."}, {"id": 1027, "start": 6200.0, "end": 6202.0, "text": "Linux-Könnel in Wasm."}, {"id": 1028, "start": 6202.0, "end": 6206.0, "text": "Mich würd's nicht wundern, wenn einer irgendeinen Mini-Mini-Könnel in Wasm schon übersetzt hätte."}, {"id": 1029, "start": 6206.0, "end": 6211.0, "text": "Ich meine, das ist reines C, das sollte wahrscheinlich sogar irgendwie funktionieren."}, {"id": 1030, "start": 6211.0, "end": 6214.0, "text": "GC, Wasm und FFmpeg."}, {"id": 1031, "start": 6214.0, "end": 6218.0, "text": "Also du brauchst FFmpeg auf jeden Fall."}, {"id": 1032, "start": 6218.0, "end": 6224.0, "text": "Also mit meinen x86 FFmpeg Libraries kommt man hier glaube ich nicht weit."}, {"id": 1033, "start": 6224.0, "end": 6229.0, "text": "Ich glaube, man braucht wirklich dann eine Web-Assembly FFmpeg-Lib,"}, {"id": 1034, "start": 6229.0, "end": 6233.0, "text": "dass ich die ansprechen kann und ich weiß nicht, ob es sowas gibt."}, {"id": 1035, "start": 6233.0, "end": 6236.0, "text": "Also Windows 98 könnte ich mir vorstellen, dass es das gibt."}, {"id": 1036, "start": 6236.0, "end": 6239.0, "text": "Die Grafik-Ausgabe kannst du halt nicht in Web-Assembly machen."}, {"id": 1037, "start": 6239.0, "end": 6244.0, "text": "Das ist Browser, das ist JavaScript."}, {"id": 1038, "start": 6244.0, "end": 6248.0, "text": "Es gibt FFmpeg Wasm, ich weiß, aber was genau soll mir das bringen?"}, {"id": 1039, "start": 6248.0, "end": 6254.0, "text": "Das ist ein Command-Line, das ist das FFmpeg Command-Line-Tool."}, {"id": 1040, "start": 6254.0, "end": 6258.0, "text": "Es sei denn, es gab noch zwei."}, {"id": 1041, "start": 6258.0, "end": 6262.0, "text": "Es gibt FFmpeg Wasm und FFmpeg JS."}, {"id": 1042, "start": 6262.0, "end": 6264.0, "text": "Genau."}, {"id": 1043, "start": 6264.0, "end": 6269.0, "text": "Es sei denn, die erlauben einem irgendwie auf die internen Sachen zuzugreifen."}, {"id": 1044, "start": 6269.0, "end": 6282.0, "text": "Das glaube ich aber halt nicht."}, {"id": 1045, "start": 6282.0, "end": 6291.0, "text": "Das ist doch garantiert nicht der Source."}, {"id": 1046, "start": 6291.0, "end": 6298.0, "text": "Wo ist denn der Source?"}, {"id": 1047, "start": 6298.0, "end": 6305.0, "text": "Äh, hier."}, {"id": 1048, "start": 6305.0, "end": 6311.0, "text": "Den Port?"}, {"id": 1049, "start": 6311.0, "end": 6318.0, "text": "Wo ist denn der Source-Code für FFmpeg Wasm?"}, {"id": 1050, "start": 6318.0, "end": 6321.0, "text": "Nein, das ist es ja nicht."}, {"id": 1051, "start": 6321.0, "end": 6322.0, "text": "Hier."}, {"id": 1052, "start": 6322.0, "end": 6329.0, "text": "Get Create FFmpeg Core."}, {"id": 1053, "start": 6329.0, "end": 6332.0, "text": "Patch?"}, {"id": 1054, "start": 6332.0, "end": 6338.0, "text": "Ja, wo ist es denn?"}, {"id": 1055, "start": 6338.0, "end": 6339.0, "text": "Also hier ist es nicht."}, {"id": 1056, "start": 6339.0, "end": 6350.0, "text": "Der FFmpeg Source-Code ist ein bisschen größer."}, {"id": 1057, "start": 6350.0, "end": 6357.0, "text": "FFmpeg Core JS"}, {"id": 1058, "start": 6357.0, "end": 6373.0, "text": "Ist das ein eigenes Projekt vielleicht?"}, {"id": 1059, "start": 6373.0, "end": 6374.0, "text": "Ach, kommt mal hier."}, {"id": 1060, "start": 6374.0, "end": 6378.0, "text": "Das ist eine gute Sache."}, {"id": 1061, "start": 6378.0, "end": 6380.0, "text": "Ach, hier."}, {"id": 1062, "start": 6380.0, "end": 6383.0, "text": "Aber das kann man nicht in WebAssembly direkt verwenden, oder?"}, {"id": 1063, "start": 6383.0, "end": 6390.0, "text": "FFmpeg Wasm Core"}, {"id": 1064, "start": 6390.0, "end": 6398.0, "text": "Where we transpiled C++-Code of FFmpeg to Java."}, {"id": 1065, "start": 6398.0, "end": 6404.0, "text": "Why?"}, {"id": 1066, "start": 6404.0, "end": 6414.0, "text": "Specify Media-File."}, {"id": 1067, "start": 6414.0, "end": 6419.0, "text": "Wenn ich Bild-Files in C++ schon sehe, drehe ich am Rad wieder."}, {"id": 1068, "start": 6419.0, "end": 6427.0, "text": "Alter."}, {"id": 1069, "start": 6427.0, "end": 6430.0, "text": "Ich meine, vielleicht."}, {"id": 1070, "start": 6430.0, "end": 6434.0, "text": "Ich meine, das wird theoretisch mit Rust auch alles funktionieren, ne?"}, {"id": 1071, "start": 6434.0, "end": 6439.0, "text": "Aber..."}, {"id": 1072, "start": 6439.0, "end": 6444.0, "text": "Nee, das Übersetzen wird da nicht funktionieren."}, {"id": 1073, "start": 6444.0, "end": 6446.0, "text": "Okay Leute, ich habe legit keine Ahnung."}, {"id": 1074, "start": 6446.0, "end": 6450.0, "text": "Also das mit FFmpeg taugt wahrscheinlich erstmal so nicht."}, {"id": 1075, "start": 6450.0, "end": 6452.0, "text": "Ich muss mir irgendwas überlegen."}, {"id": 1076, "start": 6452.0, "end": 6455.0, "text": "Ich habe heute keine Idee, was wir machen können."}, {"id": 1077, "start": 6455.0, "end": 6457.0, "text": "Das müssen wir verschieben."}, {"id": 1078, "start": 6457.0, "end": 6462.0, "text": "Weil ja, so PASIC-Sachen gehen, aber der Teufel liegt da im Detail."}, {"id": 1079, "start": 6462.0, "end": 6467.0, "text": "Also man muss bestimmt vieles machen, wovon ich jetzt auch keine Ahnung habe."}, {"id": 1080, "start": 6467.0, "end": 6476.0, "text": "Aber auch dadurch, dass ich keine Ahnung habe und ich weiß, was es ist."}, {"id": 1081, "start": 6476.0, "end": 6477.0, "text": "Wasm Game of Life."}, {"id": 1082, "start": 6477.0, "end": 6481.0, "text": "Nee, ich weiß, das ist das Tutorial davon."}, {"id": 1083, "start": 6481.0, "end": 6483.0, "text": "Das muss ich mir mal überlegen."}, {"id": 1084, "start": 6483.0, "end": 6485.0, "text": "Fallback auf zweite Stream-Idee."}, {"id": 1085, "start": 6485.0, "end": 6492.0, "text": "Nee, Fallback auf, ich gehe jetzt aufs Klo."}, {"id": 1086, "start": 6492.0, "end": 6495.0, "text": "Müssen wir alle mal weitermachen, keine Ahnung."}, {"id": 1087, "start": 6495.0, "end": 6497.0, "text": "Fällt mir gerade nichts zu ein."}, {"id": 1088, "start": 6497.0, "end": 6498.0, "text": "Wir machen morgen weiter."}, {"id": 1089, "start": 6498.0, "end": 6500.0, "text": "Also wir machen morgen vielleicht was anderes."}, {"id": 1090, "start": 6500.0, "end": 6504.0, "text": "Also zu dieser WebAssembly-Geschichte muss ich mir erst ein Anwendungsbeispiel überlegen,"}, {"id": 1091, "start": 6504.0, "end": 6506.0, "text": "dass wir was Gescheites machen können."}, {"id": 1092, "start": 6506.0, "end": 6512.0, "text": "Das kann ich jetzt nicht aus dem Ärmel schütteln."}, {"id": 1093, "start": 6512.0, "end": 6513.0, "text": "Nee, das hat nicht funktioniert, Leute."}, {"id": 1094, "start": 6513.0, "end": 6515.0, "text": "Kann ich immer klappen."}, {"id": 1095, "start": 6515.0, "end": 6516.0, "text": "Ich gehe jetzt auf."}, {"id": 1096, "start": 6516.0, "end": 6519.0, "text": "Wir gucken uns heute auch keine Videos an."}, {"id": 1097, "start": 6519.0, "end": 6520.0, "text": "Wir sehen uns im nächsten Stream."}, {"id": 1098, "start": 6520.0, "end": 6521.0, "text": "Macht's gut."}, {"id": 1099, "start": 6521.0, "end": 6546.0, "text": "CO."}]}