{"text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss. Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss. Das war's für heute und wir sehen uns beim nächsten Mal wieder. Das war's für heute und wir sehen uns beim nächsten Mal wieder. Das war's für heute und wir sehen uns beim nächsten Mal wieder. Das war's für heute und wir sehen uns beim nächsten Mal wieder. Dein Video ist wieder am Start. Was hier, sondern? Dein Video ist wieder am Start. Bester, bester Hintergrund. Ah, das funktioniert. Hat's YouTube doch noch eingesehen, dass das kein Hacking-Content war? Alter, YouTube ist auch so ein Kackladen, was das angeht. Die tun immer so unfehlbar, ja? Dabei haben die Leute die Videos-Reviews kein Plan. Und dadurch, dass unsere Gesetzgebung auch Overblocking entk... Nein, ich muss das auf Deutsch sagen, begünstigt, wird's natürlich jetzt auch nicht besser. Take Viagra, die hat Dankeschön für den Sub. Übrigens Leute, ich hab gerade noch eine neue Version gepusht vom... Soll ich euch mal zeigen? Eine neue Version gepusht vom EPG-Champ. Das werden wir heute nicht weitermachen. Aber ich hab vorhin was Neues gepusht und zwar... Guckt mal, das zeige ich euch jetzt mal schnell. Das Stream ist eh noch nicht richtig angelaufen. Ich starte mal kurz die VM. Das ist das, was wir die letzten zwei, drei Streams zusammenprogrammiert haben. Ach, hat er was gemacht? Stimmt, das würde mir glaube ich sogar empfohlen. Auf YouTube irgendwie. Jetzt sehe ich was. Ach komm, Heise hat doch bestimmt auch irgendwas, was gestern bei Apple gewesen ist. Zeig mal her. USB-C als Ladestandard kommt, das ist doch schon da. Mal ganz davon abziehen, das ist eh scheißegal, weil Apple machen kann, was sie wollen. Gut, Apple wird in Zukunft hoffentlich auch USB-C machen. Ich glaube, das ist sogar schon abgemachte Sache. Aber es hat im Prinzip doch auch keinen interessiert, dass sie trotz Standard mittlerweile die ganze Zeit Lightning verwendet haben. Apple enthüllt neues Betriebssystem, ja, das haben wir gestern schon gelesen. Na dann gucken wir uns vielleicht doch die Zusammenfassung hier im Wit an. War ganz okay. Das habe ich mir fast gedacht, dass da nichts wirklich, weiß ich, berauschendes jetzt wirklich dabei war. Das war die letzten Jahre bei den ganzen Apple Events. Im Prinzip kannst du das auf mehr oder weniger alle, allen diesen Events übertragen. Da wird immer ein riesen Hype gemacht, um wenig. Ich will nicht sagen um nichts, aber um wenig wird da riesen Hype gemacht. So, ich zeige euch mal schnell was. Die Zeit der großen Dinger ist rum. Ich glaube, das kommt einem deswegen so vor. Also es kommen ja immer mal wieder richtig coole Sachen. Fragt mich bitte jetzt nicht nach konkretem Beispiel, ich weiß gerade aus dem Kopf nichts. Aber wenn ich mir noch eine halbe Stunde Gedanken mache, fallen mir bestimmt noch 5 Dinge ein, die ich in den letzten Jahren gegeben habe, die richtig cool sind. Ich glaube, das liegt daran, das kommt einem hauptsächlich so vor, weil die kleinen Scheiß so ultra aufbauschen aktuell. Irgendjemand released einen neuen Skin, das ist ein noch nie dagewesenes Gameplay Experience. Irgendjemand macht einen zweiten Knopf an die Seite, noch nie dagewesenes Usability Experience. Und das ist so geil und wahnsinnig toll alles und sie sind immer so super excited und sind thrilled to announce. Und überschlagen sich für jeden Kack. Ich meine, die haben es sogar geschafft bei der Windows 11 Präsentation auf schaut her bestes Windows aller Zeiten zu machen. Das musste er erst mal schaffen. Ne. Ich zeige euch mal ganz schnell was, weil es wahrscheinlich ein paar interessiert die dabei waren. Ich habe vorhin eine neue Version gepusht noch vom EPG Champ. Ich habe die Konfig Datei rausgeschmissen. Guck mal die Konfig Datei und wie man das Ding jetzt ausführt ist folgendes. Ich, ich, ich bilde das mal kurz. Ähm. Nicht Linux ARM. Linux X äh ne. Mach mal X64. Was? Ach so Backend. Ich zeige euch mal was cooles. Ähm was ich vorhin noch eingebaut habe. Und zwar es gibt keine Konfig Datei. Oh KS alter. Sekunde. RM. Bild. Das war Busy. Busy viel. Busy viel des Guten. Äh Self-Contained-Bild müsste doch eigentlich alles passen. So Bild. Was? Hä? Ach ich habe Single äh Dingsbums. Single. Nicht Single. Oh wie geht das. Äh.NET Publish Single. File da kann ich mir immer die. Jaja genau. Minus P. Das da meine ich. Genau das habe ich vergessen. So und jetzt wenn man das jetzt baut. Danach machen wir was anderes. Aber das wollte ich euch jetzt zeigen wenn man das jetzt baut. Dann. Kommt man ein Ordner mit Dateien die man übrigens bei der Gelegenheit alle löschen kann. Und übrig bleibt. MV. Ein Binary was man ausführen kann. Und wenn man das ausführt. Gibt es eine Hilfe was man machen muss. Zum Beispiel Start. Das sollte nicht so sein. Doch. Das ist so. Weil ich habe ja nichts angegeben. Das ist ja das was ich euch zeigen wollte. Ich muss bloß Help machen. So. Und jetzt hat man ein Command Line Interface. Wie man das Ding startet. Dann kann man zum Beispiel jetzt sagen. EPG Champ Start. Minus T. Und dann sagt man die Uhr von seinem TV Headend. Dann kann man sagen Minus User. Und Minus Passwort. Man braucht keine Konfig Datei mehr. So ist es viel besser. Guckt. Und man kann übrigens sogar den Listen Port angeben. Sagen wir 4500. Listen Port 4500. Wenn ich das jetzt aufmache. Der Browser kann damit nichts anfangen. Local Host. Dann Funst. So. Und ihr seht der kann HTML surfen. Ohne dass irgendwelche Dateien rumliegen müssen. Ja wenn ihr jetzt zum Beispiel die Hessenschau aufnehmen wollt. Geht das ganz einfach. Also sprich es ist alles embedded in einem Single. 87 Megabyte. Ist ja fast schlimmer. Fast schlimmer als Electron. Binary. So. Das wollte ich jetzt bloß noch schnell zeigen. Jetzt kann man das nämlich auch ordentlich bilden. Für Linux Arm. Dann läuft es auf Raspberry Pi. Und auf meinem Linux Receiver. Und überall. Und das ist alles schön. Weil niemand will sich da ein Ordner mit Krempel hinkopieren. Single, Binary und gut ist. Ja. Ja. So richtige Innovationen kommen halt. Also so Sachen wie. Es gibt jetzt ein Smartphone was jeder verwenden will. Ja. Das ist selten. Oder es gibt eine neue Konsole. Die halt wirklich auch mal wieder Hype ist. Das dauert halt. Das kommt nicht so oft. Oder es gibt mal ein neues Game. Wo man drauf gewartet hat. Dann ist es auch richtig gut. Und sowas. Also das kommt selten. Das war aber auch früher so. Dass die Dinge auch nicht im Monatstakt gekommen sind. Nur dass es uns heute. So verkaufen wollen. Dass jeder Kleinscheiß quasi. Die Wahnsinns Innovation noch nie dagewesen Innovation ist. Und das ist so richtig gut. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. lustig, also ich hab selten so gelacht beim Video und das ist kein Video was funny sein soll, das ist einfach ein Typ der offensichtlich, da geht es nicht mehr planlos ist Genau und der erklärt große Entdeckung nicht nur falsch, sondern er weiß es besser und beweist uns das in dem Video auch nur das ist halt seine Beweise, ziemlicher Grinch sind Soll ich gleich noch was anderes erzählen, Leute vielleicht muss ich demnächst kündigen auf der Arbeit, ich bin mir noch unschlüssig Erzähl ich euch gleich Zusammenfassung bei Linus Tech Tips, ich gucke zwar wenig Linus Tech Tips aber Ich brauche mal wieder Werbung für Unterhosen von Linus Tech Store Apple just killed M1, ja was ist das für eine Überschrift, die haben M2 vorgestellt, genau, LUL, es war so klar She baited Was für eine Arschung, man muss sagen es wurde die letzten Jahre vieles halt als super krassen innovativen Shit verkauft Guckt euch mal an, die Metaverse Geschichte, die überall verkauft wird, vor ein paar Jahren 3D im Fernsehen, gibt es heute überhaupt noch Fernsehen die wirklich 3D können, da dann irgendwelche VR Sachen, das war alles die haben sich da alle immer aufgespielt, als hätten sie wirklich das Rad neu erfunden und im Endeffekt hat es Kassau interessiert Da gab es viele dinge die letzten Jahre über Oder oder erinnert sich noch einer dran, wo sie die Xbox One angekündigt haben, mit tollen TV Features für American Football, wo ich mir auch gedacht habe, also das ist ja sogar für Cokona Land zu überholt schon Wobei, wenn ich es mir so recht überlege, da könnte tatsächlich doch ein bisschen was dran sein, weil die Leute scheinen ja nach großen neuen Sachen zu gucken Anders kann ich mir diese ganzen Kickstarter Scams und Krypto Scams und Scams dieser Art, die es aktuell so gibt, nicht erklären Die Leute denken sie haben den neuen großen Shit entdeckt, werden aber gescampt Es gibt so viele Games, die beispielsweise virtuelles Land verkaufen für Spiele, die es nie geben wird Oder Leute, die sagen, wir entwickeln ein Spiel über Kickstarter, stellen dann fest, oh das ist doch aufwendiger als gedacht und verarschen dann 5 Jahre lang Die Leute, also der Scam ist in letzter Zeit tatsächlich ganz besonders strong überall Ich mein Bitconnect war wenigstens noch witzig Da kannst du dich heute noch drüber lustig machen, aber der Scam, den ich da in letzter Zeit so sehe, das ist einfach nur noch traurig, dass da so viele Leute reinfallen Keine Container, nee, warum soll ich das in einen Container packen, das soll auf dem Linux Receiver laufen mit 512 RAM und einem ARM 7 Gedinke, da gibt es nichts mit Container Und der Kubernetes Cluster bringt uns da auch nicht viel, es sei denn, ihr müsst weltweit skalieren, weil Leute euer Fernsehprogramm angucken wollen Als wäre gesagt, das ist von eurem Linux Receiver gecrapte Fernsehzeitungs-Kram Das war doch die Dev-Konferenz, ja, das war quasi das Gegenstück von der Microsoft Build, nur, dass die Build deutlich mehr Sessions hat und länger ist, aber ok, also die Keynote von der Build, so ungefähr, ist das gleiche Nur, dass die Build dieses Jahr auch richtig schlecht war, ja, richtig cringy Äh, ja, kann sein, kann sein, aber der weiß ja, um was es geht Ich bin am überlegen, aber ich werde nicht einfach jetzt blind kündigen, ich warte nochmal, was passiert, aber die Chance besteht auf jeden Fall, je nachdem, wie sich die Firma da entscheidet, was sie da als Marschrichtung geben, dass ich mich demnächst vom Acker mache Also, genau, ich weiß gar nicht mehr, irgendwie so in der Richtung fängt das an Und jeder, der das sieht, sagt, wie konnte man denen Geld geben, und doch haben ihnen Leute Geld gegeben, also was ich erzählen wollte, also ich hab nicht vor morgen zu kündigen oder so, aber nur mal so Ein paar Dinge, die gerade bei mir auf der Arbeit passieren, die mir ein bisschen auf den Keks gehen, und zwar, das Team, in dem ich bin, ergibt es wahrscheinlich bald nicht mehr, weil sich unser Oberes Management dazu entschieden hat, mal wieder zu umzustrukturieren Und umzustrukturieren, ohne dass die Sachen schon wirklich spruchreif wären, die haben quasi die Leute einfach massiv verwirrt, also stellt euch vor, der IT-Chef schickt eine Einladung zu einem virtuellen Teams-Meeting, wo dann gesagt wird, also in einem Monat strukturieren wir die IT neu Strukturieren wir die IT um, strukturieren wir die IT neu, zeigt euch irgendwie ein Organigramm mit dem Hinweis, ja, das ist noch temporär, es wird nichts gesagt, wer wozu gehört, es stehen keine Namen irgendwo, es stehen noch nicht mal Führungskräfte oben an dem Organigramm dran Und am Ende sind sie dann der Meinung, man hat jetzt die Leute voll geil informiert, also es hat wirklich nur alle Fragezeichen über dem Kopf, so nach dem Motto, was wollt ihr eigentlich und warum überhaupt, man wusste es nicht, man weiß es ehrlich gesagt bis heute nicht so genau Was ist ein Organigramm, so wie in Firmenstruktur, so was da, wie die Firma strukturiert ist, wie das Unternehmen strukturiert ist, da sieht man es dann, da steht dann zum Beispiel hier Vorstand, dann steht hier IT, blablabla und dann hört man es halt von der IT und so, Strukturgramm So und das hat natürlich alle ein bisschen verwirrt, dass man solche Ansagen gemacht hat, vor allem versteht keiner so genau warum, weil wir haben ja noch vor nicht all zu langer Zeit restrukturiert und die alte Restrukturierung ist noch gar nicht so richtig abgeschlossen Also das ist dann quasi die Restrukturierung während der Restrukturierung, also ganz merkwürdiges Zeug irgendwo, ja und da wird dann immer mit so Sachen um sich geworfen, wie ja wir möchten Synergieeffekte nutzen Die müssen wir jetzt mal eins erklären, wie krass und toll müssen die neuen Synergieeffekte sein, wenn man alle bisher gewonnenen Synergieeffekte in die Tonne schmeißt, also so krass können die Netze, das ist einfach irgendein Marketingblödsinn Wort So zumindest was jetzt rausgekommen ist, ich habe heute eine Einladung bekommen für nächste Woche, wo wir von unserem Abteilungschef, Abteilungsleiter vorgestellt bekommen, wie denn jetzt unser neues Team aussehen wird, weil wir haben daraus jetzt quasi erfahren, das hat uns ja vorher keiner gesagt, dass es wahrscheinlich unser Team nicht mehr geben wird Das lese ich jetzt aus den Teilnehmern dieser Informationsveranstaltung raus und mein Chef ist nicht eingeladen zu diesem Meeting, was bedeutet, er ist nicht mehr mein Chef höchstwahrscheinlich Das geile ist, man hat ihm bis jetzt noch nichts gesagt und in drei Wochen soll das passieren, das ist unter aller Sau, keine Ahnung was dieser Laden wieder treibt Und das kriege ich dann nächste Woche erzählt, da bin ich mal gespannt und ich bin auch mal gespannt, was mein dann neuer Chef, was ich übrigens nicht gut finde, ich mag mein aktuelles Team, ich bin der Meinung, wir haben das beste Team, was wir seit 2000, ja gut offiziell bin ich seit 2012 da, also seit 10 Jahren hatten Ich weiß nicht, warum man das jetzt in die Tonne kloppen will, nice, EQ-Steigerung ist immer gut, 5-Header, 6-Header, danke für den Sub So und da bin ich mal gespannt, was da rauskommt und ich gehe davon aus, ich gehe davon aus, dass sie mit dieser Führungsetagen-Wechselsache auch durchsetzen wollen, dass es kein Homeoffice mehr gibt Und ihr könnt euch nicht vorstellen, wie schnell ich weg bin, wenn es wirklich heißt, es gibt kein Homeoffice mehr Weil das ist einfach nur fernab jeglicher Realität 2022 und auch fernab dessen, was in vielen Konkurrenzunternehmen mittlerweile an der Tagesordnung ist Ich verstehe, wenn man sagt, man will nicht, dass die ganze Firma 100% nicht in jedem Bereich Homeoffice macht, verstehe ich, es mag gerade im Marketingbereich bestimmt was geben, wo das besser ist Meinetwegen mag alles sein, bei uns sehe ich den Vorteil nicht, zumal es mir besser geht und ich mehr schaffe, also es kann mir keiner wirklich Fakten basiert und konnte es dort noch keiner wirklich so stichhaltig begründen, warum das schlecht ist mit Homeoffice So, aber, nachdem das vielleicht unserem noch höheren Management vorschwebt, die Leute sollen einen Tag oder gar keinen Tag Homeoffice mehr machen, dann bin ich weg Siste, bei uns ist das genau umgedreht, ich erwische die Leute über Teams dreimal schneller, wie vor Hort im Büro Das können wir tatsächlich mal ausprobieren, ob wir Katzencam machen So, und, da bin ich gespannt, sollte das wirklich der Fall sein, ich will nicht weg, wie gesagt, auch mit den verbleibenden Leuten, ich verstehe mich mit denen gut, ich will nicht unbedingt weg, aber sollte man wirklich Homeoffice abschaffen, dann werde ich demnächst mal gucken, was es sonst noch so gibt Und der Witz ist ja, ich habe jetzt hier, während ich streame, also die letzten, wie lange streame ich schon, drei Jahre oder so, ich habe sogar ohne, und das weiß eigentlich jeder, dass ich gut unter bin und eigentlich nichts aktiv suche, ich habe trotzdem einige Angebote sogar per Mail bekommen, die sind auf YouTube, also sie haben was für sich streamen gesehen, YouTube geguckt Und sie dann auf YouTube haben eine Businessadresse rausgeschrieben und haben mich angeschrieben, so nach dem Motto, Max, wir suchen Leute, das fand ich ja cool, ja mit einem habe ich auch mal sogar telefoniert, das fand ich ja wirklich cool, aber zu dem Zeitpunkt habe ich keinen gesucht Also ich habe es ja auch nicht wirklich eilig, da ich dachte, Leute, ich brauche nächste Woche einen neuen Job, aber wenn es so weit ist, ich werde definitiv nicht mehr jeden Tag die Woche mit der Bahn nach Frankfurt pendeln, das halte ich geistig einfach nicht aus, das funktioniert nicht Und dann werde ich mir notgedrungen, was Neues suchen müssen, sollte das wirklich der Fall sein, ich will nicht, ich fände es eigentlich ganz gut da, aber da ist die Schmerzgrenze dann erreicht Elon Musk erzählt doch öfters mal komische Dinger Elon Musk ist so ein typischer Kandidat, der kann halt wunderbar Leute quasi von sich begeistern, was hauptsächlich daran liegt, weil er sich selbst mega geil findet, dass es ja immer so eine Sache kommt zum anderen Der hat durchaus coole Sachen gemacht schon, aber es ist auch viel Blödsinn dabei, ich bin beispielsweise überhaupt kein Fan von Starlink, habe ich ja schon ein paar mal erzählt, aber nicht dass zu trotz, es gibt coole Sachen von ihm Ja und ich bin auch der Meinung, gerade das was er mit SpaceX macht und auch was er mit Tess ist eigentlich eine coole Sache, auf der anderen Seite sind auch, wollte ich gerade sagen, auf der anderen Seite sind auch schon viele Dinge, die haben nicht funktioniert, sage ich gar nichts dagegen Aber dass man jetzt immer so tun muss, dass man alles direkt, immer 100%ig so ist es, nur weil Elon Musk das sagt, ich könnte mir aber vorstellen, dass gerade in der BWL Ecke oder zumindest in der Möchte gern Elon Musk Fanboy Ecke, also sprich das sind die Führungskräfte, die gerne wie Elon Musk sein möchten, aber es wahrscheinlich nie werden Davon gibt es unglaublich viel, habt ihr auch so welche? Habt ihr auch Führungskräfte, die gerne Elon Musk 2.0 sein wollen und sich auch so aufführen, aber es nicht sind? Ja, dass gerade in dieser Ecke diese Aussagen halt immer eins zu eins quasi ja parat so hingelegt werden, so als wäre das so, weil das Elon Musk mal gesagt hat Und ich meine, das kann ja durchaus sein, dass Elon Musk einen Punkt hat, ich meine, der kennt ja sein Unternehmen und vielleicht, wer weiß, wie das bei Tesla intern so ist, vielleicht ist das in manchen Bereichen auch so Wie gesagt, gerade im Marketing Bereich kann ich mir das tatsächlich sogar vorstellen, dass es da mit Homeoffice manchmal schwierig ist, aber es gibt halt Bereiche, da ist das nicht so Und unterm Strich ist es auch alles egal, wisst ihr, warum es egal ist? Weil es genug Unternehmen gibt, die es mittlerweile gecheckt haben und auch wissen, dass sie das anbieten müssen, wenn sie neue Leute bekommen wollen, dann gehen die Leute halt zu denen Die ganzen Boomer-Unternehmen, die es einfach nicht auf die Reihe bekommen, die werden es früher oder später lernen müssen oder aber sie lernen es nicht und bekommen halt nur suboptimal Leute Das heißt ja nicht, dass die dann automatisch pleite gehen, das nicht, aber die bekommen halt nicht unbedingt die Leute, die sie sich so wünschen, die können sich das halt nicht aussuchen Das ist genauso, wie wenn irgendwelche kleinen Programmierklitschen der Meinung sind, sie müssen jetzt irgendwelche super krassen Google Einstellungstest machen, von Brain Teaser bis Algorithmen an der Tafel Der Unterschied ist, dass zu Google ganz viele wollen auch die Big Brain der Big Brains und die sich die raussuchen können Bei der Programmierklitsche um die Ecke, da kommt vielleicht der ehemalige Mainframe-Entwickler Herbert, der sich bewerbt, weil er jetzt Java gelernt hat Das ist halt schon auch ein bisschen vom Anspruch her was anderes, aber das ist da glaube ich einigen nicht klar, die wären gerne Google Wisst ihr was, ich glaube, dass das tatsächlich die neue Masche der Headhunter ist und damit haben sie Recht meiner Einschätzung nach, die versuchen Leute anzuschreiben, von denen sie glauben, dass sie innerlich, innerlich gekündigt ist übertrieben gesagt Du bist ja eigentlich zufrieden, dass sie innerlich quasi nicht so fest verwachsen sind, drücken wir es mal so aus mit dem Laden, wo sie gerade sind Und das ist auch sinnvoll, weil ein ganz großer Anteil, da gibt es sogar Statistiken zu, habe ich letztens in einem Video geguckt, von Arbeitnehmern in Deutschland haben innerlich schon gekündigt, also sprich, die sind noch da, weil sie zu faul sind, keinen Bock haben, wie auch immer, machen einen Dienst nach Vorschrift, aber im Prinzip geht es ihnen am Arsch vorbei Und solche Leute kannst du natürlich auch wunderbar abwerben, aber solche Leute erreichst du halt nicht mit, wir schalten eine Stellenanzeige, weil die Leute sich nicht von sich aus bewerben Sprichst du die Leute allerdings an, wobei Xing schon ziemlich outdated ist, mittlerweile dachte ich, dass LinkedIn eigentlich das einzige, was noch verwendet wird Und wenn du so Leute halt anschreibst mit dem passenden Angebot, dann sind die bereit, sich das anzukommen und wenn dann die Vorteile da sind im Vergleich zum aktuellen Job, das muss nicht immer nur Bezahlung sein, dann denke ich, sind da viele auch gewillt, das zu machen Na ja, ein bisschen klar, wie gesagt, gerade was wir hier schon im Stream gemacht haben, Sachen, ich kenne mich ja relativ breit aus in vielen Bereichen, wir haben ja in fast jedem Bereich schon mal was gemacht im Stream Wir haben sogar schon mal Cobalt programmiert, wobei ich das nicht machen möchte hauptberuflich, Cobalt programmieren, wir haben alles mögliche, viele Bereiche schon gemacht, wir haben uns Cloud Sachen im Stream angeguckt, wir haben Embedded Sachen im Stream gemacht Wir haben bestimmt schon 10 verschiedene Programmiersprachen uns angeguckt, also ich kenne mich ja eigentlich relativ breit aus und gerade im.NET Bereich könnte ich mir tatsächlich vorstellen, da auch zu arbeiten Jetzt vielleicht nicht als hauptberuflicher.NET Entwickler, aber gerade im DevOps Bereich oder sei es bei irgendwelchen so Hybridgeschichten von Admin und Tools oder irgendwelche Cloud Provisioning Geschichten und so, gibt es ja jede Menge neue Sachen mittlerweile, wo Leute gesucht werden, das könnte ich mir schon vorstellen Ja, also ich würde mir das angucken, wenn es da was gibt, ja, also auch wenn ich irgendwas sehe, wo jetzt keine Ahnung, ich meine, es gibt schon ein paar Sachen, da habe ich keinen Bock drauf, also wenn jetzt irgendwie ein sagt, hier Max, wie sieht es mit Mainframe aus, dann würde ich auf, würde ich sagen nein Und PC++ würde ich auch sagen nein, das muss nicht sein oder wenn einer ankommt, mach Windows Active Directory, das würde ich auch nicht machen, aber irgendwas, am liebsten würde ich natürlich wieder irgendwas im Linux Umfeld machen Mit Windows will ich nichts zu tun haben und was das jetzt ist, ja, das hängt vom Job ab, also es muss auch nicht Linux sein vor Ort, aber Linux Umfeld ist ja auch relativ breit Selbstständig bin ich ja schon nebenbei, das will ich aber nicht hauptberuflich machen, obbei, selbstständig bin ich nicht nebenbei, das kann man so falsch gesagt, ich habe eine eigene Firma nebenbei, selbstständig bin ich nicht, weil dann müsste ich das ja hauptberuflich machen Ja, kann er, dann muss er sich aber nicht wundern oder müssen sich bei uns nicht wundern, also wenn du jetzt die Auswahl hast als IT Mensch und kannst zum Unternehmen gehen, das Homeoffice anbietet oder zu einem, das kein Homeoffice anbietet und der Rest ist, sag mal, ungefähr gleich, dann ist klar, wofür du dich entscheidest Und nachdem die eh, wenn man sich die Stellenanzeigen anguckt und auch wie überall geheult wird, dass es so viele offenen Stellen gibt, händeringendst neue Leute suchen, sollte man sich halt mal überlegen, ob man nicht vielleicht von seinem hohen Ross runterkommt und zu sagen, wir sind die geilste Firma der Welt, die Leute wollen doch schon zu uns Sondern der Realität ins Auge blickt und sagt, ja, anscheinend reicht das mittlerweile nicht mehr Excellent, kommt da am Ende plus plus raus Ja, das kann ich mir vorstellen, ich hab kein Xing-Profil, ich hab ein LinkedIn-Profil, wisst ihr das Das gibt's ja immer noch Das gibt's ja immer noch Das gibt's ja immer noch Cloud-Native-Agent GitHub-Solution Chief Engineer Officer Ebenfalls angesehen Nein, die hab ich mir nicht angesehen, ich weiß gar nicht, wer das alles ist Weitere Mitglieder, die Peter Agile, was Das stimmt doch überhaupt nicht, die heißen Peter Jankovic, die halte ich Peter Agile, was ist denn LinkedIn für eine Pepega-Seite Na ja, das ist irgendwie so ein Basswörtbegriff für Leute, die, keine Ahnung, was man sich da genau drunter forscht Aber ja, den Begriff, der wird manchmal mit um sich geworfen Ja, hab ich ja grad schon gesagt, müsste ich jetzt, ich hab so viele Sachen schon beantwortet, müsste ich mich jetzt wieder reindecken Nee, hab ich aber glaub ich grad alles zugesagt Na ja, nö, also sag mal so, so 7-8 Kilo könnte ich noch abnehmen, dann ist alles gut Nö, hab ich nicht, juckt mich auch nicht Wenn du was mit Blockchain machst, hab ich nicht vor, aber ganz ehrlich, wenn Irgendeiner, irgendwas in Frankfurt der Meinung ist, sie brauchen Leute, die sich mit Linux gut auskennen oder mit.NET gut auskennen Oder mit Cloud Sachen auskennen oder mit, wir haben 30.000 Sachen, ich müsste mal wirklich eine Skillliste machen Und die bezahlen gut und die bieten Homeoffice und am Ende stellt sich raus, die entwickeln eine Blockchain, ist mir das doch egal Sollen die Blockchain machen? Im Zweifelsfall richte ich denen ein paar Kisten ein, auf denen sie ihre geile Blockchain Software laufen lassen können, das juckt mich doch nicht Wann wurde das Scenery Statement erfunden, welche Sprache, ich würd mal sagen C, kann das sein? Also in C gab's das, gibt's das und C gibt es relativ lang, deswegen würd ich einfach mal sagen C Ja ich weiß auch nicht, warum es nicht gesperrt wurde Rambon, danke für den Sub Okay gut, wunderbar, also ich hab den Chat, den Chat aufgeholt, so was gucken wir uns den jetzt an, ähm, was ist das, oh nein Zero Hour, habt ihr die Ankündigung gesehen, gestern, Zero Hour triffts ja ganz gut, das ist wahrscheinlich die Spielzeit der meisten Leute Ich würd's eher sagen Zero Content, ihr habt nix verpasst, die Ankündigung ist komplett sinnlos gewesen Was, haben sie schon wieder irgendwie super Spezialisten am Start hier, wenn ich das schon im Forscher Bildschirm sehe Ähm, wollen wir zur Runde LevelCapture Bane, komm wir lassen uns zur Runde LevelCapture Bane Aber eine Runde LevelCapture Bane, aber ich werd's mir wahrscheinlich nicht komplett angucken sag ich mal Sag ich schon gleich zu, weil wahrscheinlich nix großes Substantielles bei rumkommt, aber mal kurz, ganz kurz reinhören Chat, was meint ihr, hat mich ihr ja auch eingeladen nochmal Okay, sag keiner was zu, nein, natürlich nicht, mein Video war wohl doch, ist auch wohl doch nicht so gut angekommen Und, dem bleibt ja auch nix anderes übrig, gerade im englischen Bereich, die großen Leute zu inviten, egal was sie dazu sagen Weil ansonsten covert eh keiner mehr das Game, aber nein ich wurde nicht mehr eingeladen, ich hab aber auch so krass über das Game hergezogen Ich würd mich auch nicht mehr einladen Und ja, da sind die selbst dran schuld, ich mein, ich hab nicht gehofft, dass das Game kacke wird Ich hätte das Sponsoring noch nicht mal angenommen, hätte ich auch nur erahnt, dass das Game so kacke wird, wie es letztendlich ist Aber im Endeffekt, sind sie selbst dran schuld Ich hab's verbockt, insofern, dass ich nicht rumgeschleimt hab, ja das mag sein, aber ganz ehrlich, ich kann damit leben Die ganzen Events sind eh für den Arsch zum größten Teil Also das bescheuertste Event war immer noch das Battlefield 1 Event in Berlin, ich glaub ich war noch nie auf so einem überflüssigen Event Jeder der den Twitch Livestream geguckt hat, war besser dran als wir vor Ort, war komplett unsinnig, das ganze Also, die haben es doch nicht mal geschafft, das was sie im Vorfeld angekündigt hatten, einzuhalten Es hieß, wir können uns auf dem Event, das schon ein paar Stunden vor dem offiziellen Livestream angucken, natürlich dürfen wir vor dem offiziellen Livestream nichts erzählen Wir können aber schon was aufnehmen, wir bekommen, wenn die Präsentation vor Ort fertig ist, nochmal die Möglichkeit, sogar die Entwickler was zu fragen Wir bekommen sogar ein bisschen extra Footage gezeigt und wir bekommen dann am Ende einen USB Stick mit den wichtigen Sachen drauf, dass wir im Hotel sogar die Videos schon vorbereiten können So, so war das ganze angekündigt und was gab's am Ende? Es gab 10 Sekunden extra Trailer, das war das extra Footage Und die Fragerunde mit den Entwicklern war keine Fragerunde, sondern es waren vorgefertigte Fragen, die von einer Moderatorin, dem Battlefield Typ auf der Bühne gestellt wurden Und wir haben am Ende kein USB Stick gekriegt, das heißt, jeder, der daheim war, hat den Livestream sich angeguckt, daraus Sachen gecaptured und dann ein Video erstellt dazu War besser dran als wir vor Ort, die dann im Zweifelsfall noch im Hotel gehockt haben und dann mit dem kack Laptop was machen mussten Unglaublicher Schrott, also das war wirklich das schlechteste Event überhaupt, wo ich gewesen bin Und es war nicht das schlechteste organisiert, war es tatsächlich nicht schlecht, also es hatte alles drumherum funktioniert, aber sinnhaftig war es halt gar nicht Auf Level Cap erzählen, sag mal, was ist das eigentlich für eine Map? Die Map sieht aus, wie als hätte sie den 5-jährigen im Level Editor gemacht Was ist denn das? Das sieht aus wie, wie, what the fuck? Was ist das für eine Map? Ist das Roblox oder was? Was ist das für eine Map? Wasserkiste und Container? Das ist das, was du als erstes im Level Editor baust, wenn du noch keine Ahnung hast, wie es funktioniert? Was ist denn das? Das sieht Battle Bits besser aus, tatsächlich. Ja, Helis hat das Spiel unbedingt mehr gebraucht. Ja, das sieht aus wie eine prozedural generierte Map von irgendeinem Bot Ich mein, okay, das sieht wenigstens noch nach einer Map aus, wenn auch nicht gerade nach einer sonderlich hübschen Map By the way, es ist nicht etwa so, dass es jetzt 8 neue Maps gibt oder so, das ist eine Map in 8 Monaten, also ne, nicht Season 1 und 8 Maps, nein, nein, nein, nach 8 Monaten eine Map Das ist Battle Pass, who cares? Wen juckt es? Da gibt es eh nix Sinnvolles drin in dem Battle Pass, weil es gibt halt nix in dem Spiel Ich hatte ja sogar ursprünglich Bedenken, dass sie vielleicht dort irgendwelche unfairen Dinge einbauen, so nach dem Motto, ja, wir wollen die Leute quasi dazu animieren, den Battle Pass bis zum Ende zu kaufen, falls man es nicht freigespielt hat Ich mein, das Game hat kein Content, für was will man da großartig was freispielen? Ja, geil, irgendwie ein zweiter, tja, ganz ehrlich, guckt euch mal dieses Hovercraft an, da erkennt man noch nicht mal, ob das Ding überhaupt einen Skin hat Das sieht aus wie das, die vollen Hovercraft Ja, Legendary Weapon Skin Ah, okay, die neuen Helis anlockt man über den Battle Pass, das ist natürlich auch toll Das ist bescheuert, eigentlich sollten die Dinger auf der Map spawnen und man steigt ein und dann ist man drin Übrigens auch was, was sie gesagt haben, dass das so sein wird in Battlefield 2042, also Vehikel einsteigen, was aber nicht so ist Ja, natürlich, du kannst den Kram danach kaufen Zwei, zwei Waffen, ui, also es gibt einen Specialist und eine Map, zwei neue Fahrzeuge und zwei Waffen, sehe ich das richtig Ich meine, das ist als Season Update an sich, das geht durchaus als Season Update durch, das ist in Ordnung, ja, wenn die Season halt nicht irgendwie ewig geht Danach zügig in eine neue Season kommt, neue Content und, und das ist die wichtigste Voraussetzung, wenn das Spiel bis zum jetzigen Zeitpunkt schon ordentlich Content hätte, hat es aber nicht Also diese Stelle, ich meine, was ist das für eine Map, wie sieht das aus man, das ist ok, hier siehst du, die hat sich einer mit ein bisschen, zumindest halbwegs Architektur Gedanken gemacht, aber was ist denn das andere wieder für eine Weißt du, wie das aussieht, ein bisschen, das sieht ein bisschen aus wie der Eingang auf dieser einen Battlefield 4 Map, ich hab vergessen, wie sie heißt, die eine DLC Map, wo du auch durch so eine Schneebasis reinfährst Warte mal, also quasi ein AT4, ein AT4 als, ja, ok, kann man machen, ich meine, die Sache ist halt die, es gibt Lock-On-Launcher, warum sollte ich die selbst schießen? Gut, du kannst sie nicht fleren, ja, ok, und auf der anderen Seite, Engineer-Bewaffnung ist eh pepega in dem Spiel, das machst du eh nur, wenn du, wenn du Helis runter geiern willst Hey, auf der Map ist schon auch wieder, ihr guckt euch das mal ohne, da habt ihr ja auch keine Ahnung, was das für eine Map ist, ihr habt ja auch keine Ahnung, was das für eine Map ist Auf der Map ist schon auch wieder, ihr guckt euch das mal ohne, da ist jetzt auch nicht gerade viel, oder? Da ist ganz viel, nichts, ich mein, ok, das hier ist wahrscheinlich noch nicht mal playable area, meint ihr, das hier oben ist playable area und hier was, ihr meint, das ist playable area, wobei, da hinten ist so eine Radar-Station, vielleicht ist das wirklich playable area Ich meine, das würde passen zu Battlefield 2042, die Maps sind ja im Prinzip einfach nur Gelände, zumindest hat man ein bisschen Infanterie-Action vielleicht hier innen drinnen, aber ehrlich gesagt, ja, auch wenn es morgen losgeht, ich werde es kürzlich nicht spielen Karte unten links sagt nein, das ist richtig, dann ist es keine playable area Wobei wir das nicht wissen, in was für einem Spielmodus die das spielen Das ist richtig Nein, das Spiel hat keine Quality, bis jetzt nicht, das ist halt das Problem Ich sag mal, mein Urteil zu der Map lasse ich mal außen vor, ich meine, vielleicht gucke ich es mir noch mal kurz an Ach, das ist ein explosiven Crossbow Das fühlt sich aber zumindest schon, hier in der Innenbereich, auch mit der reduzierten Spieleranzahl, das wirkt zumindest etwas mehr wie eine Battlefield Map schon Wie du rettest hier oben immer noch rum ohne was Sundance und McKay sind eh die besten Übrigens, die hatten ja bei Sundance auch noch nicht mal Bock, in irgendeiner Art und Weise zu versuchen zu erklären, warum Sundance einen Sturzflug aus 300m auf den Boden ohne Probleme aushält Ich meine, Sundance könnte wenigstens irgendwie einen Stoßdämpfer haben oder sowas, keine Ahnung, dass es zumindest so wirkt, als hat man sich was beigedacht Ich meine, du fliegst legit mit dem Kopf in den Boden und stehst dann wieder auf, ja? So, guckt euch das an Also, die hätten zumindest versuchen können, ich meine ernsthaft, es ist ja nicht so, als wäre sowas nicht möglich, warte mal, Apex Drop Off, ja, wie auch immer man das nennt, Apex, ich brauche einfach nur ein Apex Game, irgendein Apex Game Nicht Funny Moments, hier Apex, nein, ich brauche irgendeinen Apex Gameplay, irgendeins, vollkommen egal was, hier das da So, guckt mal, wenn die am Anfang aus dem Flieger springen, dann springen die aus dem Flieger, so wie Sundance mit ihrem Ding und wohlgemerkt, wobei Sundance und ihr Ding, so war es nicht gemeint, aber so kann man es schon falsch verstehen Dann hüpfen die runter, so wie Sundance mit dem Wingsuit, ja? Und jetzt kommts, und jetzt kommts, stellt euch mal vor, Battlefield hätte etwas Liebe zum Detail gehabt in Battlefield 2042, guckt mal, was jetzt passiert Was ist das? Was ist das, die haben eine Lander-Animation, wie, was ist da los, das ist, das kann ja nicht sein man, das ist unmöglich, so sieht eine Lander-Animation aus Leute, guckt, so, so guck Mit dem Kopf im Boden, guckt euch an, guckt euch an Ui, und weiter gehts, also bei Apex siehst du halt, ich mein okay, der Apex Chef ist jetzt ja auch der neue Battlefield Chef, der hat ja viel vor sich Die Sache ist halt die, es ist okay, wenn die Maps, die eingebaut sind, shit wären, wenn wir jetzt einfach acht neue gute Maps hätten, wäre das kein Problem, aber mit einer Map pro drei Monate oder so, was soll das denn geben, wenns fertig ist? Ich glaube es wird doch nochmal Zeit für ein letztes Battlefield 2042 Video Portal hat das Spiel nicht gerettet, ja das liegt aber auch daran, dass die Möglichkeiten in Portal immer noch zu beschränkt sind und auch der Content der drinnen ist zu beschränkt ist Hätte man die Möglichkeit in Portal wirklich Custom Content zu createn, also eigene, eigene, ich mein du kannst noch nicht mal, fangen wir mal bevor ich das sage, fangen wir mal, guck mal, da crashst sie wieder im Boden, fangen wir mal eine Stufe, du kannst doch nicht mal gescheit sowas wie Prop Hunt implementieren in Portal Ja Prop Hunt ist diese Geschichten wie, wo man sich dann in Garrys Mod oder in irgendeinem Call of Duty Mod oder was auch immer, zum Beispiel als Stuhl versteckt irgendwo oder sowas Prop Hunt ist meistens so einer der ersten Modi die eingebaut werden um zu testen was die Modding Tools taugen, sowas kannst du in Portal nicht machen Und es wäre halt cool, könnte man da ein paar eigene Sachen importieren, eigene Musik importieren, im Zweifelsfall eigene, eigene Sprays importieren, ich erwarte ja noch nicht mal, dass du gleich eigene, eigene 3D Models importieren kannst oder sowas Das wäre cool wenn das geht, aber dass man das nicht gleich hat oder dass man neue, simple Gegenstände entwerfen kann, vielleicht eben aus den Gegenständen die schon im Spiel sind, ich meine, du kannst aus den Sachen die es hier vorgefertigt gibt, sicherlich coole neue Sachen zusammen, kannst du alles knicken, du kannst die Maps auch nicht editieren gescheit, du kannst die Maps gar nicht editieren im Endeffekt, also es ist viel zu beschränkt Oder ein Server Browser zum Beispiel Ich habe es übrigens gesagt, ich muss es an der Stelle sagen, Leute, ich habe das über eineinhalb Jahre, also seit sie diesen Kram angekriegt, ich habe das prediktet mit dem Server Browser Ich habe ein Video gemacht damals, so, ich habe ein Video gemacht, Battlefield 6 wird getötet von Skill-Based Matchmaking, gut, wie Skill-Based Matchmaking das in Battlefield ist, kann ich abschließend nicht beurteilen, das ist auf jeden Fall nicht so krass wie in Call of Duty, aber ein Punkt in diesem Video war Dafür, dass Skill-Based Matchmaking funktioniert oder die Option besteht überhaupt, das einzuführen, jetzt können sie ja gar kein Skill-Based Matchmaking mehr machen und ich glaube, das ist auch der Grund, warum das nie so krass geworden ist wie in Call of Duty, es spielt ja keiner mehr Skill-Based Matchmaking mit 2000 Spielern, das funktioniert nicht, da kannst du schon froh sein, wenn du ein paar Server vollkriegst, aber ich habe es gesagt in dem Video Sie können kein Server Browser einbauen, wenn sie was in dieser Richtung versuchen, automatisch zusammengesetzte Lobbies und damals haben alle gesagt, nein, nein Max, Skill-Based Matchmaking, das kann gar nicht sein, weil es gibt doch den Server Browser Und darauf gehe ich ja auch im Video und sage, ja, das kann man machen, wenn es keinen Server Browser mehr gibt und es gibt keinen Server Browser, es war mir so klar schon im Vorfeld Und weil man das auch nie gesehen hat, ich habe damit gerechnet, dass es das nicht gibt, das gab es und alle haben gesagt, nein, nein, das kann überhaupt nicht sein, ich wusste es einfach Damals haben die Leute noch gedacht, so was bescheuert, das kann DICE doch nicht machen, aber doch Und wisst ihr was passiert beim nächsten Battlefield, wenn das angekündigt wird, da werden sie sagen, das ist so sicher wie das Abend in der Kirche, sie werden sagen, ja, das war ja Battlefield 2042 Jetzt haben wir gelernt aus unseren Fehlern, jetzt, wir haben euch gehört Community, jetzt hören wir auf euch, jetzt ist uns ganz klar, was wir falsch gemacht haben Die werden immer wieder den gleichen Shit erzählen, oh Leute, mein großer C ist eingeschlafen Ich muss gerade mal meinen Fuß kurz schütteln, dass der wieder ordentlich durchblutet wird Das fühlt sich ja kacke an So, ja, aber das ist so sicher wie das Abend oder der Gaben in der Kirche, ja, dies werden die wieder erzählen, exakt der gleiche Scheiß und die Sache ist die, die haben ja dieses Mal wirklich nicht nur übertrieben, die haben ja gelogen schon Ich mein, meint ihr wirklich, also bevor wir zu denen sagen kommen, wo sie gelogen haben, meint ihr wirklich, dass irgendjemand ernsthaft bei DICE, der wirklich Ahnung von dem Stand des Spiels hatte Wirklich davon überzeugt war, dass wenn er sagt, das ist ein Love Letter an die Community, was sie da fabrizieren, dass der das wirklich ernst gemacht hat Ich gehe davon aus, dass dort ziemlich unrealistisch das Spiel eingeschätzt wurde, ja, es hat ja schon seinen Grund, warum das Spiel so geworden ist Ja, das haben die gesagt, Portal, glaube ich, war der Love Letter an die Community So, ich glaube schon, dass DICE dieses Spiel sehr unrealistisch eingeschätzt hat, also ich bin echter Meinung, dass das Spiel quasi als viel höherwertiger und besser eingeschätzt haben als es letztendlich ist Und dann auch sehr überrascht davon waren, wie negativ das ankommt, aber das spricht ja auch nicht gerade für das Management bei DICE, ist ja klar Und die hatten sicherlich die ein oder anderen Leute, die da noch ein bisschen Hirn im Kopf hatten, die gesagt haben, Leute, das kann man so doch nicht spielen, aber da hat man nichts drauf gegeben Man hat wahrscheinlich sogar noch eher gesagt, halt die Klappe, sonst verlierst du deinen Job und man hat sich halt die ganze Zeit dann auch mit Leuten umgeben, die alles, was man macht, gut findet Und dann ist ja kein Wunder, dass man denkt, man hat hier das neueste, beste Spiel aller Zeiten, wirklich egal, wir gucken das Video jetzt fertig Das Spiel könnte man, Rembo, das Spiel könnte man theoretisch retten, aber man sagt das zwar, aber man hat ja offensichtlich, ich mein, es sind acht Monate seit Release rum Man hat ja offensichtlich kein Interesse dran, das Spiel zu retten, die haben so viele Blogposts gemacht, von wegen, ja wir stellen jetzt drei Kisten auf die Map, aber ne, ne, das haben wir doch nicht gemacht Wir befinden uns in der Planungsphase, wo wir jetzt am besten die drei Kisten hinstellen Und die haben so extrem viel heiße Luft produziert, da drum und nichts Substantielles gemacht Man hat kein Interesse dran, das Spiel zu retten, man könnte es wahrscheinlich mit den notwendigen, mit den passenden Leuten, aber man hat kein Interesse dran, aber es ist auch verständlich Das Spiel ist krasser gefloppt, als sie das sich wahrscheinlich in ihren größten Albträumen ausgedacht haben Und es gibt in dem Spiel ja auch nichts mehr zu holen, es gibt ja da auch kein Geld mehr, mit was wollen die Geld verdienen? Mit den 2000 Leuten, die übrig geblieben sind und da ab und zu mal irgendwie ne Runde spielen Mit was wollen die großartig Geld verdienen? Ist ja nichts mehr da Also, die werden das Mindeste, die werden das Mindeste liefern, was sie müssen, wozu sie sich auch für den Season Pass verpflichtet haben Und danach ist das Spiel direkt tot und das Spiel ist jetzt schon tot, das Spiel ist quasi ein Zombie Das Spiel ist eigentlich tot, aber es wird künstlich so getan, als lebt es noch Das ist eigentlich ein Zombie, das ist quasi der größte Zombie-Modus, den man es zu gibt Oh, wenn ich dieses Havocraft schon sehe Die Hit-Rack scheint auch wieder richtig gut zu funktionieren, oder? Schaut euch das mal an Ah ne, okay, der hat zum größten Teil PP geaimt, aber bei der Feuerrate von dem Ding musste da schon ein bisschen was reingehen Okay, also dass der nicht tot ist Die Waffe könnte mir gefallen Ich spiele gerne High-Fire-Rate Waffen, da kann man nämlich schön PP-Gar-Aim aus der Hüfte machen im Nachhinein Ich darf das mit 37 Aber ich habe es schon immer gerne High-Fire-Rate angeschaut Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine Intel und gerade AMD, die müssen ja auch gucken, dass die CPUs herstellen, die von der Größe her und von dem Aufwand her sich irgendwie verkaufen Die haben ja auch, wenn du dir die Epic-CPUs für Server anguckst, die sind ja auch irgendwie gefühlt 5 Meter groß Apple hat halt den Luxus, Apple baut diese Dinger in High-End-Hardware, die Schweine teuer ist In Hardware, die sie komplett selbst designen, also da sind die Voraussetzungen auch ein bisschen anders Wenn du quasi die Sachen einbaust in Hardware, die eh schon 4000 Euro plus kostet und die du komplett selbst designst, dann hast du ganz andere Möglichkeiten Als wenn du Apple bist und eine CPU-Generation designst, die quasi vom Low-End bis zum High-End laufen muss Und AMD macht es ja mittlerweile relativ clever, AMD nimmt einfach 4 CPUs und klebt sie, vereinfacht gesagt, und klebt sie zusammen und sagt, ja das ist jetzt ein Epic für den Server Das ist dann auch fetter, teurer, hat aber auch mehr Wumms Und die M1-CPU muss ja wohl schon auch ein halbes Fußballfeld gewesen sein Das ist eine gute Frage, das ist eine gute Frage Nein, gibt es nichts, ich spiele keine Mobile Games und ich mache um alle Mobile Games einen großen Bogen rum Und das was ich aktuell höre von Diablo Immortal macht meine Meinung über Mobile Gaming nicht unbedingt besser Okay, ich werde vermutet, NVNK macht das auch, macht NVNK 8K schon? Decoding, na Encoding juckt mich nicht, aber wenn sie Decoding haben, dann auch auf jeden Fall Aber sowas zu haben ist natürlich nice, weil da kannst du einfach Videos, da kannst du 8K Videos abspielen mit 5% CPU-Lust versus 80% CPU-Lust Prime, Erbofaller hat zugeschnappt, nice, Dankeschön Ja gut, da muss man mal warten was da rauskommt Ich meine Apple Event mit Apple Hardware mit Apple Benchmarks, mal gucken, das machen sie ja alle so Ich kann mich noch an die Intel Benchmarks früher erinnern, wo sie explizit Sachen rausgelassen haben Wo sie wussten, wo sie schlecht drin sind und noch schlimmer, wo sie Benchmarks hatten, die explizit darauf optimiert waren Rechnungen erst gar nicht auszuführen Also es gab ja wirklich Benchmarks, die haben übertrieben gesagt Hardcoded Ergebnisse drin gehabt, nur für den Show-Effekt Ob das legal ist sei mal dahingestellt, aber das hat man ja gemacht Man hat ja Benchmarks, die quasi gar nichts gebenchmarkt haben, sondern quasi nur so getan haben, um dazu zu sagen, haha, leading performance Ja gut, die APU-Dinger sind ja auch shit Die APUs sind ja zum größten Teil dafür gedacht, also die meisten APUs sind ja gedacht für irgendwelche Hybrid-Home-Rechner im mittleren bis unteren Preissegment Es ist schwer ein Zukunft zu sehen, in dem die Industrie nicht so gut wie Apple folgt Und was noch mehr, wenn wir sagen, dass M2 die gleiche Pattern wie M1 folgt, dann sollte M2 Pro 48GB Systemmemory, M2 Max 96GB und M2 Ultra eine große 192GB Systemmemory für beide CPU und GPU-Cores Die PC haben aber noch den hohen Werkstätten- und Servermarkt, diese theoretischen M2s sind noch nicht ganz Mac-Pro-Territory Und Apple ist immer noch wütend, wann die neue Mac Pro kommt Sie waren nicht schlau, um neue M2-Hardware zu vorstellen Interessant ist, dass keine Listungen, die zu früh auf B&H wurden, die Karte gemacht haben. Zuerst ein redesigniertes MacBook Air, das sich nach dem 14-Inch MacBook Pro befindet, mit der Wende, aber mit einem dünneren Profil, als die dünnsten Teile des alten Airs, und mit einer leichten Haare. Bei 1199 Euro ist es etwas mehr teurer, als wir möchten, aber der M1 Air ist noch für 999 Euro verfügbar. Amd CPU, also mit normalen Sachen, nicht mit Apple-Sachen Also nicht irgendwie den Final Cut Benchmark oder sowas Das muss ich tatsächlich mal gucken, wie das sich im normalen Preissegment dazu verhält Apple hat immer noch den Vorteil, dass sie die Hardware von Grund auf designen und überhaupt nicht darauf ausgelegt sind, dass es irgendwie modular wäre Aber es muss ja auch nicht wirklich ein Cross-Archiv, naja doch, muss es sein. Es muss ein Benchmark sein, die keine Ahnung, Scenebench oder irgendwas, Prime95 meinetwegen machen Und dann müsste man das mal vergleichen mit einem aktuellen Intel, und das wird mich mal interessieren Ja, das habe ich auch, das habe ich letztens schon gesehen bei irgendeinem Apple Event, ihr neues Audio-Ding Und da habe ich mir damals auch schon gedacht, hm, auf der einen Seite wird ja viel Kleinkram als super krasses Zeug angepriesen Aber Apple hat in der Vergangenheit schon gezeigt, dass sie solche Dinge wirklich gut können, wo man sich dann denkt, ah, Blödsinn braucht man nicht Und wenn man es dann hat, man sich denkt, eigentlich ist es doch ganz cool und ich frage mich, warum das bei anderen Sachen nicht eingebaut ist Also da kann ich mir durchaus vorstellen, dass das was taugt Jetzt nicht, dass ich das unbedingt bräuchte am Laptop mit den Lautsprechern, ich hätte wahrscheinlich jeden Kopfhörer auf, aber ja Ja, aber ich kann das nicht machen, weil ich habe keine M1 Laptop, da müssen wir mal gucken, wo es Benchmarks, also vertrauenswürdige Benchmarks gibt, nicht vom Apple Event Okay, das Video kommt aus der Sendung an, kurz Moment, was, das Ladekabel, oder habe ich das jetzt richtig verstanden? Okay, es ist wenigstens ein Ladekabel im 1200 Euro teuren Laptop drin, das ist ja schon mal was, das ist ja bei iPhones aktuell auch nicht so Aber für ordentlich schnell, zu laden muss man 20 Euro ausgeben, ja weil es geht wahrscheinlich Okay, also das hat mich jetzt ehrlich gesagt auch nicht so wirklich geschockt, ich habe das mal bei meinem Kollege auf der Arbeit gesehen, diese neue Tastatur, also ja Also es wäre jetzt kein Grund warum ich es mir kaufen würde Ach Moment, vielleicht meine ich auch das Ding, was ich beim Kollege gesehen habe, der hatte irgendwas farbiges, irgendeine komische Leiste an seiner Tastatur oben Das kann Apple unglaublich gut, diese Upselling Taktik, das können die wirklich gut, am Anfang sagst du, ich habe Budget 400 Euro für ein Smartphone, am Ende kaufst du ein 900 Euro Ding Wir haben die Link in der Beschreibung in der Beschreibung in der Beschreibung Ventura ist das auch irgendein Berg oder irgendein See oder irgendwas in der Nähe von ihrem Hauptquartier oder ist das diesmal was anderes? Also ehrlich, schickes GUI Zeug können die schon machen Da könnte sich Microsoft mit Windows 11 tatsächlich was abschneiden, ich meine ich schwöre immer noch auf mein Linux mit Tiling Window Manager Das ist ja das komplette Gegenteil von sowas hier, sowas ist hier flashy, blink blink, shiny as fuck und mein Terminal, also mein Tiling Window Manager mit einem Terminal und drei Fenster oder drei Fullscreen Dingern offen kann damit definitiv optisch nicht mithalten Ich finde es vom Workflow angenehm, aber von diesen Sachen könnte sich Microsoft tatsächlich was abschneiden und ich habe den Eindruck, sie haben es versucht mit Windows 11, ja gerade weil die auch die Optik immer so hervorgehoben haben sowas, aber sie können das nicht so gut Das ist cool, das finde ich gut Ja das ist gut, das ist gut, das ist cool, das finde ich gut Gibt es das nur mit neuen iPads für das Feature oder geht es auch mit alten? Ich könnte mir vorstellen es geht auch mit alten, zumindest dieses Windows-Dings, weil Apple ist ja was neue Betriebssystemversionen angeht immer recht großzügig wie lange alte Geräte supportet werden Finde ich gut Das können sie halt auch Das hier Mit einer API, mit einer, mit einer API, nicht acht verschiedenen Sachen wie unter Windows und dementsprechend wissen die Entwickler auch wie eine iOS App bzw. eine Mac OS App gefälligt auszusehen hat Erinnert sich noch irgendjemand an Ribbon Bars in Windows als die eingeführt wurden? Also was ich meine ist das da Ribbon Bars, weiß noch jemand wo die eingeführt wurden? Die Dinger wurden eingeführt und es gab keine, das muss man sich mal vorstellen, es gab keine Library von Microsoft für ihre verbreiteten GUI-Dinger Also die haben was eingeführt und als der neue Shit verkauft so sollen Windows-Programme aussehen, aber es gab keine Möglichkeit Windows-Programme in dieser Art zu machen Das einzige was ging ist, du konntest das irgendwie über ihre halboffizielle C++-Geschichte machen, die keiner machen möchte Oder du konntest das mit einem nie veröffentlichten WPF-Ding machen, also für'n Arsch Letztendlich hat's keiner gemacht, weil Ribbon Bars auch scheiße sind, das hat keiner vermisst, aber das kann nicht sein, du kannst nicht als Hersteller sowas einführen Zu sagen, so haben gefälligst unsere Anwendungen auszusehen und dann es nicht selbst supporten, dass man das machen kann Das kann Apple besser, eindeutig Das sieht fast da unten bisschen aus wie auf den Surface Hubs Das finde ich halt auch cool, ich hab so'n Display-Kalibrierungstool, das ist immer richtig Paint-Champ, das ist so'n Teil, das hängst du vor den Bildschirm und das misst das dann, da kriegst du so'n Farbprofil raus Das ist halt cool, dass die Apple-Dinger schon brauchbar ankommen Also ich mein, für dass das jetzt Metal 3 ist, so wirklich der massive Erfolg war jetzt ja Metal 1 und 2 nicht, oder? Also nicht, dass ich's mitbekommen hätte Die erste Titel, die mit Metal 3 angeboten wurde, ist Resident Evil Village, die später dieses Jahr ausgebildet wird Es ist schwer, einen Anruf zu machen, wie effektiv es über Stream ist, aber Upscaling macht viel Sinn auf kleinen Displays, wie die auf dem iPad und insbesondere auf dem iPhone Das ist jetzt die Geschichte, wo du dein iPad und dein iPhone wohl irgendwie als Alternifizierungsgerät verwenden kannst, anstelle von Passwörtern Also ich würde nie so weit gehen und meine iPhone-Kamera als einziges Authentifizierungsgerät verwenden, aber es hat einen Vorteil gegen den anderen gängigen Authentifizierungsvarianten, es ist halt ziemlich schnell Und das finde ich gut, ich mein, Face ID ist halt eine coole Sache, ich könnte mir Face ID auch wunderbar als zweiten oder dritten Faktor sogar vorstellen Weil's einfach schnell geht, du guckst in dein iPad oder besser gesagt, du guckst in dein iPhone und gut ist Und es wäre halt cool, wenn man zum Beispiel sein iPad als Zwei-Faktor-Authentifizierung verwenden könnte, jetzt halt auch, keine Ahnung, beim YouTube-Login oder so Das wäre schon cool, besser als SMS schicken oder irgendwelche Authenticator-Apps oder Gedulds Okay, da hätte ich schon mal keinen Bock drauf, dass irgendwelche Credentials und Secrets über Apple Sync in die Cloud gesynced werden, das will ich schon mal nicht haben Nett, warum nicht? Ehrlich gesagt, ich verwende mein Log-Screen genau für eine Sache, nämlich um zu gucken und es zu entlocken, aber ja, warum nicht? Ja, warum nicht? Spät, oh nein! Das sind halt so Sachen, die sind ganz cool, das ist jetzt aber nix super krass neues, also, sagen wir so, Freistell-Software gibt es ja schon jede Menge und das dann so ins Betriebssystem zu integrieren ist cool Das finde ich halt immer, gerade bei Events, sei es Microsoft, sei es Apple, sei es irgendwie Ubisoft EA, so kleine Dinger werden da halt aber auch immer mit den Superlativen der Superlativen angekündigt Wo ich immer denke, jetzt macht's halt doch mal ein bisschen unter Groundbreaking Also, unter Groundbreaking geht da eigentlich nix mehr, ja, und das ist so easy, so amazing, so hyped, so, so, sonst was, da haben wir uns ja schon dran gewöhnt Aber es darf doch auch noch coole normale Sachen geben, ohne dass es gleich immer noch nie da gewesen ist, Groundbreaking, weltverändernder Shit ist Oh, das ist ein normales cooles Feature, ja Diese Überleitung, die haben's drauf Erinnerst du dich noch an Force Touch? War Force Touch nicht das, wo der Homebutton abgeschafft wurde und so getan wird, als ist es ein Homebutton, obwohl es gar kein Homebutton mehr war? Weiß ich, hatte ich nie so ein Gerät Übrigens, ich verwende mein iPhone die ganze Zeit schon, wenn ich Technik-Gramme hier streame und euch das zeige von meinem iPhone Was sagst du, ich habe ein iPhone, was ist denn das, 11 glaube ich? Ich glaube ein iPhone 11 ist das Was? Was? Aber die Idee ist cool, es braucht wahrscheinlich ein bisschen Anpassung und Display-Kippgrad und so, dass das gut funktioniert, aber die Idee ist gut Ja, dumm nur, dass kaum einer Facetime verwendet Okay, jetzt muss ich, ups, also manch einem geht da bestimmt jetzt richtig eine Abbei, aber da muss ich mich mal als Boomer outen Ich bin skeptisch bei, mein Auto ist jetzt ein Computer versus es ist ein Auto Also vielleicht brauche ich erstmal so ein Ding, dass ich sage, es ist doch geil, das kann schon sein Ich hatte bisher nie ein Auto, was in diesen Ausmaßen da technologisiert war Also alles was ich da bisher von mitgekriegt habe schreckt mich eher ab, aber vielleicht ist es ja geil, keine Ahnung Aber ich finde die grundsätzliche Idee mit, ich fahre quasi ein Computer mit Rädern versus ich fahre ein Auto mit ein bisschen Technik drinne ist auch nicht unbedingt so beruhigend Und so Sachen, die man dann hört, du fährst nebenan und es startet ein Update und kannst dann erstmal nicht weiterfahren und solche Dinge Wie oft es passiert, keine Ahnung, aber es passiert ja wohl anscheinend, das beruhigt mich auch nicht weiter Und auch von vielen der Assistenzsysteme, die sich die letzten Jahre so etabliert haben Mein Opel Agila hat sowas alles nicht, da muss ich mir keine Gedanken drüber machen Aber auch von den Assistenzsystemen, wo ich die letzten Jahre so gehört habe, das ist teilweise auch fragwürdig Ich habe letztens erst gelesen, dass z.B. jemand gesagt hat, in irgendeinem Ford war, hat er gesagt, der hat jetzt so einen Spurhalteassistent drinne Der hat sich standardmäßig auch immer aktiviert, wenn er das Auto startet und sich auch gar nicht mehr richtig deaktivieren lässt Und er hätte ihm wohl das letzte Mal, obwohl es gar keine Spur war, sondern nur irgendeinen Streifen, der nichts mit Fahrbahnmarkierungen zu tun hat hätte der wohl richtig krass gegengelenkt und er wäre fast gegen LKW gefahren Wie viel an solchen Stories dran ist, keine Ahnung, aber sonderlich beruhigen tut es mich nicht Ja oder was ich auch letztens gelesen habe, am Eingang vom Tor hängt wohl, also irgendeiner wollte auf den Hof fahren von seiner Arbeit Und am Eingang vom Hoftor, da ist wohl irgendwie so ein Häuschen, wahrscheinlich für den Werther oder so, keine Ahnung Und da hängen zwei Warnwesten dran, dass wenn man das zu später Stunde betritt, dass man sich eine Warnweste anzieht Und da muss es wohl schon öfters so gewesen sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, da läuft ein Fußgänger wegen der Warnweste Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, da läuft ein Fußgänger wegen der Warnweste Und das ist immer so ein Ding, wo ich mir denke, muss es sein, ja Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und dann kannst du endlich Code-Snippets oder Rezepte bekommen, ohne dass du einen Screenshot machst Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss."}, {"id": 3, "start": 60.0, "end": 65.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder."}, {"id": 4, "start": 90.0, "end": 95.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder."}, {"id": 5, "start": 120.0, "end": 125.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder."}, {"id": 6, "start": 150.0, "end": 155.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder."}, {"id": 7, "start": 181.0, "end": 183.0, "text": "Dein Video ist wieder am Start."}, {"id": 8, "start": 187.0, "end": 189.0, "text": "Was hier, sondern?"}, {"id": 9, "start": 192.0, "end": 194.0, "text": "Dein Video ist wieder am Start."}, {"id": 10, "start": 195.0, "end": 197.0, "text": "Bester, bester Hintergrund."}, {"id": 11, "start": 199.0, "end": 201.0, "text": "Ah, das funktioniert."}, {"id": 12, "start": 201.0, "end": 204.0, "text": "Hat's YouTube doch noch eingesehen, dass das kein Hacking-Content war?"}, {"id": 13, "start": 204.0, "end": 207.0, "text": "Alter, YouTube ist auch so ein Kackladen, was das angeht."}, {"id": 14, "start": 207.0, "end": 209.0, "text": "Die tun immer so unfehlbar, ja?"}, {"id": 15, "start": 209.0, "end": 213.0, "text": "Dabei haben die Leute die Videos-Reviews kein Plan."}, {"id": 16, "start": 213.0, "end": 217.0, "text": "Und dadurch, dass unsere Gesetzgebung auch Overblocking entk..."}, {"id": 17, "start": 217.0, "end": 223.0, "text": "Nein, ich muss das auf Deutsch sagen, begünstigt, wird's natürlich jetzt auch nicht besser."}, {"id": 18, "start": 227.0, "end": 230.0, "text": "Take Viagra, die hat Dankeschön für den Sub."}, {"id": 19, "start": 230.0, "end": 233.0, "text": "Übrigens Leute, ich hab gerade noch eine neue Version gepusht vom..."}, {"id": 20, "start": 233.0, "end": 235.0, "text": "Soll ich euch mal zeigen?"}, {"id": 21, "start": 235.0, "end": 239.0, "text": "Eine neue Version gepusht vom EPG-Champ."}, {"id": 22, "start": 239.0, "end": 241.0, "text": "Das werden wir heute nicht weitermachen."}, {"id": 23, "start": 241.0, "end": 243.0, "text": "Aber ich hab vorhin was Neues gepusht und zwar..."}, {"id": 24, "start": 243.0, "end": 245.0, "text": "Guckt mal, das zeige ich euch jetzt mal schnell."}, {"id": 25, "start": 245.0, "end": 247.0, "text": "Das Stream ist eh noch nicht richtig angelaufen."}, {"id": 26, "start": 247.0, "end": 249.0, "text": "Ich starte mal kurz die VM."}, {"id": 27, "start": 249.0, "end": 253.0, "text": "Das ist das, was wir die letzten zwei, drei Streams zusammenprogrammiert haben."}, {"id": 28, "start": 259.0, "end": 262.0, "text": "Ach, hat er was gemacht? Stimmt, das würde mir glaube ich sogar empfohlen."}, {"id": 29, "start": 262.0, "end": 265.0, "text": "Auf YouTube irgendwie."}, {"id": 30, "start": 265.0, "end": 266.0, "text": "Jetzt sehe ich was."}, {"id": 31, "start": 266.0, "end": 269.0, "text": "Ach komm, Heise hat doch bestimmt auch irgendwas, was gestern bei Apple gewesen ist."}, {"id": 32, "start": 269.0, "end": 271.0, "text": "Zeig mal her."}, {"id": 33, "start": 271.0, "end": 276.0, "text": "USB-C als Ladestandard kommt, das ist doch schon da."}, {"id": 34, "start": 276.0, "end": 280.0, "text": "Mal ganz davon abziehen, das ist eh scheißegal, weil Apple machen kann, was sie wollen."}, {"id": 35, "start": 280.0, "end": 282.0, "text": "Gut, Apple wird in Zukunft hoffentlich auch USB-C machen."}, {"id": 36, "start": 282.0, "end": 284.0, "text": "Ich glaube, das ist sogar schon abgemachte Sache."}, {"id": 37, "start": 284.0, "end": 288.0, "text": "Aber es hat im Prinzip doch auch keinen interessiert, dass sie trotz Standard mittlerweile"}, {"id": 38, "start": 288.0, "end": 294.0, "text": "die ganze Zeit Lightning verwendet haben."}, {"id": 39, "start": 294.0, "end": 300.0, "text": "Apple enthüllt neues Betriebssystem, ja, das haben wir gestern schon gelesen."}, {"id": 40, "start": 300.0, "end": 311.0, "text": "Na dann gucken wir uns vielleicht doch die Zusammenfassung hier im Wit an."}, {"id": 41, "start": 311.0, "end": 312.0, "text": "War ganz okay."}, {"id": 42, "start": 312.0, "end": 318.0, "text": "Das habe ich mir fast gedacht, dass da nichts wirklich, weiß ich, berauschendes jetzt wirklich dabei war."}, {"id": 43, "start": 318.0, "end": 321.0, "text": "Das war die letzten Jahre bei den ganzen Apple Events."}, {"id": 44, "start": 321.0, "end": 326.0, "text": "Im Prinzip kannst du das auf mehr oder weniger alle, allen diesen Events übertragen."}, {"id": 45, "start": 326.0, "end": 330.0, "text": "Da wird immer ein riesen Hype gemacht, um wenig."}, {"id": 46, "start": 330.0, "end": 336.0, "text": "Ich will nicht sagen um nichts, aber um wenig wird da riesen Hype gemacht."}, {"id": 47, "start": 336.0, "end": 339.0, "text": "So, ich zeige euch mal schnell was."}, {"id": 48, "start": 339.0, "end": 342.0, "text": "Die Zeit der großen Dinger ist rum."}, {"id": 49, "start": 342.0, "end": 346.0, "text": "Ich glaube, das kommt einem deswegen so vor."}, {"id": 50, "start": 346.0, "end": 349.0, "text": "Also es kommen ja immer mal wieder richtig coole Sachen."}, {"id": 51, "start": 349.0, "end": 354.0, "text": "Fragt mich bitte jetzt nicht nach konkretem Beispiel, ich weiß gerade aus dem Kopf nichts."}, {"id": 52, "start": 354.0, "end": 358.0, "text": "Aber wenn ich mir noch eine halbe Stunde Gedanken mache, fallen mir bestimmt noch 5 Dinge ein,"}, {"id": 53, "start": 358.0, "end": 361.0, "text": "die ich in den letzten Jahren gegeben habe, die richtig cool sind."}, {"id": 54, "start": 361.0, "end": 370.0, "text": "Ich glaube, das liegt daran, das kommt einem hauptsächlich so vor, weil die kleinen Scheiß so ultra aufbauschen aktuell."}, {"id": 55, "start": 370.0, "end": 379.0, "text": "Irgendjemand released einen neuen Skin, das ist ein noch nie dagewesenes Gameplay Experience."}, {"id": 56, "start": 379.0, "end": 385.0, "text": "Irgendjemand macht einen zweiten Knopf an die Seite, noch nie dagewesenes Usability Experience."}, {"id": 57, "start": 385.0, "end": 394.0, "text": "Und das ist so geil und wahnsinnig toll alles und sie sind immer so super excited und sind thrilled to announce."}, {"id": 58, "start": 394.0, "end": 396.0, "text": "Und überschlagen sich für jeden Kack."}, {"id": 59, "start": 396.0, "end": 405.0, "text": "Ich meine, die haben es sogar geschafft bei der Windows 11 Präsentation auf schaut her bestes Windows aller Zeiten zu machen."}, {"id": 60, "start": 405.0, "end": 407.0, "text": "Das musste er erst mal schaffen."}, {"id": 61, "start": 407.0, "end": 408.0, "text": "Ne."}, {"id": 62, "start": 408.0, "end": 412.0, "text": "Ich zeige euch mal ganz schnell was, weil es wahrscheinlich ein paar interessiert die dabei waren."}, {"id": 63, "start": 412.0, "end": 416.0, "text": "Ich habe vorhin eine neue Version gepusht noch vom EPG Champ."}, {"id": 64, "start": 416.0, "end": 418.0, "text": "Ich habe die Konfig Datei rausgeschmissen."}, {"id": 65, "start": 418.0, "end": 422.0, "text": "Guck mal die Konfig Datei und wie man das Ding jetzt ausführt ist folgendes."}, {"id": 66, "start": 422.0, "end": 426.0, "text": "Ich, ich, ich bilde das mal kurz."}, {"id": 67, "start": 426.0, "end": 427.0, "text": "Ähm."}, {"id": 68, "start": 427.0, "end": 429.0, "text": "Nicht Linux ARM."}, {"id": 69, "start": 429.0, "end": 432.0, "text": "Linux X äh ne."}, {"id": 70, "start": 432.0, "end": 434.0, "text": "Mach mal X64."}, {"id": 71, "start": 434.0, "end": 435.0, "text": "Was?"}, {"id": 72, "start": 435.0, "end": 439.0, "text": "Ach so Backend."}, {"id": 73, "start": 439.0, "end": 443.0, "text": "Ich zeige euch mal was cooles."}, {"id": 74, "start": 443.0, "end": 447.0, "text": "Ähm was ich vorhin noch eingebaut habe."}, {"id": 75, "start": 447.0, "end": 450.0, "text": "Und zwar es gibt keine Konfig Datei."}, {"id": 76, "start": 450.0, "end": 451.0, "text": "Oh KS alter."}, {"id": 77, "start": 451.0, "end": 452.0, "text": "Sekunde."}, {"id": 78, "start": 452.0, "end": 453.0, "text": "RM."}, {"id": 79, "start": 453.0, "end": 454.0, "text": "Bild."}, {"id": 80, "start": 454.0, "end": 455.0, "text": "Das war Busy."}, {"id": 81, "start": 455.0, "end": 456.0, "text": "Busy viel."}, {"id": 82, "start": 456.0, "end": 457.0, "text": "Busy viel des Guten."}, {"id": 83, "start": 457.0, "end": 461.0, "text": "Äh Self-Contained-Bild müsste doch eigentlich alles passen."}, {"id": 84, "start": 461.0, "end": 462.0, "text": "So Bild."}, {"id": 85, "start": 462.0, "end": 465.0, "text": "Was?"}, {"id": 86, "start": 465.0, "end": 468.0, "text": "Hä?"}, {"id": 87, "start": 468.0, "end": 471.0, "text": "Ach ich habe Single äh Dingsbums."}, {"id": 88, "start": 471.0, "end": 472.0, "text": "Single."}, {"id": 89, "start": 472.0, "end": 473.0, "text": "Nicht Single."}, {"id": 90, "start": 473.0, "end": 476.0, "text": "Oh wie geht das."}, {"id": 91, "start": 476.0, "end": 479.0, "text": "Äh.NET Publish Single."}, {"id": 92, "start": 479.0, "end": 482.0, "text": "File da kann ich mir immer die."}, {"id": 93, "start": 482.0, "end": 484.0, "text": "Jaja genau."}, {"id": 94, "start": 484.0, "end": 485.0, "text": "Minus P."}, {"id": 95, "start": 485.0, "end": 487.0, "text": "Das da meine ich."}, {"id": 96, "start": 487.0, "end": 488.0, "text": "Genau das habe ich vergessen."}, {"id": 97, "start": 488.0, "end": 492.0, "text": "So und jetzt wenn man das jetzt baut."}, {"id": 98, "start": 492.0, "end": 494.0, "text": "Danach machen wir was anderes."}, {"id": 99, "start": 494.0, "end": 498.0, "text": "Aber das wollte ich euch jetzt zeigen wenn man das jetzt baut."}, {"id": 100, "start": 498.0, "end": 499.0, "text": "Dann."}, {"id": 101, "start": 499.0, "end": 503.0, "text": "Kommt man ein Ordner mit Dateien die man übrigens bei der Gelegenheit alle löschen kann."}, {"id": 102, "start": 503.0, "end": 505.0, "text": "Und übrig bleibt."}, {"id": 103, "start": 505.0, "end": 508.0, "text": "MV."}, {"id": 104, "start": 508.0, "end": 510.0, "text": "Ein Binary was man ausführen kann."}, {"id": 105, "start": 510.0, "end": 512.0, "text": "Und wenn man das ausführt."}, {"id": 106, "start": 512.0, "end": 514.0, "text": "Gibt es eine Hilfe was man machen muss."}, {"id": 107, "start": 514.0, "end": 523.0, "text": "Zum Beispiel Start."}, {"id": 108, "start": 523.0, "end": 528.0, "text": "Das sollte nicht so sein."}, {"id": 109, "start": 528.0, "end": 529.0, "text": "Doch."}, {"id": 110, "start": 529.0, "end": 530.0, "text": "Das ist so."}, {"id": 111, "start": 530.0, "end": 531.0, "text": "Weil ich habe ja nichts angegeben."}, {"id": 112, "start": 531.0, "end": 532.0, "text": "Das ist ja das was ich euch zeigen wollte."}, {"id": 113, "start": 532.0, "end": 534.0, "text": "Ich muss bloß Help machen."}, {"id": 114, "start": 534.0, "end": 535.0, "text": "So."}, {"id": 115, "start": 535.0, "end": 536.0, "text": "Und jetzt hat man ein Command Line Interface."}, {"id": 116, "start": 536.0, "end": 537.0, "text": "Wie man das Ding startet."}, {"id": 117, "start": 537.0, "end": 539.0, "text": "Dann kann man zum Beispiel jetzt sagen."}, {"id": 118, "start": 539.0, "end": 542.0, "text": "EPG Champ Start."}, {"id": 119, "start": 542.0, "end": 544.0, "text": "Minus T."}, {"id": 120, "start": 544.0, "end": 549.0, "text": "Und dann sagt man die Uhr von seinem TV Headend."}, {"id": 121, "start": 549.0, "end": 551.0, "text": "Dann kann man sagen Minus User."}, {"id": 122, "start": 551.0, "end": 553.0, "text": "Und Minus Passwort."}, {"id": 123, "start": 553.0, "end": 555.0, "text": "Man braucht keine Konfig Datei mehr."}, {"id": 124, "start": 555.0, "end": 556.0, "text": "So ist es viel besser."}, {"id": 125, "start": 556.0, "end": 557.0, "text": "Guckt."}, {"id": 126, "start": 557.0, "end": 560.0, "text": "Und man kann übrigens sogar den Listen Port angeben."}, {"id": 127, "start": 560.0, "end": 563.0, "text": "Sagen wir 4500."}, {"id": 128, "start": 563.0, "end": 565.0, "text": "Listen Port 4500."}, {"id": 129, "start": 565.0, "end": 569.0, "text": "Wenn ich das jetzt aufmache."}, {"id": 130, "start": 569.0, "end": 571.0, "text": "Der Browser kann damit nichts anfangen."}, {"id": 131, "start": 571.0, "end": 574.0, "text": "Local Host."}, {"id": 132, "start": 574.0, "end": 583.0, "text": "Dann Funst."}, {"id": 133, "start": 583.0, "end": 584.0, "text": "So."}, {"id": 134, "start": 584.0, "end": 587.0, "text": "Und ihr seht der kann HTML surfen."}, {"id": 135, "start": 587.0, "end": 590.0, "text": "Ohne dass irgendwelche Dateien rumliegen müssen."}, {"id": 136, "start": 590.0, "end": 593.0, "text": "Ja wenn ihr jetzt zum Beispiel die Hessenschau aufnehmen wollt."}, {"id": 137, "start": 593.0, "end": 596.0, "text": "Geht das ganz einfach."}, {"id": 138, "start": 596.0, "end": 599.0, "text": "Also sprich es ist alles embedded in einem Single."}, {"id": 139, "start": 599.0, "end": 600.0, "text": "87 Megabyte."}, {"id": 140, "start": 600.0, "end": 601.0, "text": "Ist ja fast schlimmer."}, {"id": 141, "start": 601.0, "end": 603.0, "text": "Fast schlimmer als Electron."}, {"id": 142, "start": 603.0, "end": 604.0, "text": "Binary."}, {"id": 143, "start": 604.0, "end": 605.0, "text": "So."}, {"id": 144, "start": 605.0, "end": 606.0, "text": "Das wollte ich jetzt bloß noch schnell zeigen."}, {"id": 145, "start": 606.0, "end": 608.0, "text": "Jetzt kann man das nämlich auch ordentlich bilden."}, {"id": 146, "start": 608.0, "end": 610.0, "text": "Für Linux Arm."}, {"id": 147, "start": 610.0, "end": 611.0, "text": "Dann läuft es auf Raspberry Pi."}, {"id": 148, "start": 611.0, "end": 612.0, "text": "Und auf meinem Linux Receiver."}, {"id": 149, "start": 612.0, "end": 613.0, "text": "Und überall."}, {"id": 150, "start": 613.0, "end": 614.0, "text": "Und das ist alles schön."}, {"id": 151, "start": 614.0, "end": 617.0, "text": "Weil niemand will sich da ein Ordner mit Krempel hinkopieren."}, {"id": 152, "start": 617.0, "end": 619.0, "text": "Single, Binary und gut ist."}, {"id": 153, "start": 619.0, "end": 620.0, "text": "Ja."}, {"id": 154, "start": 620.0, "end": 621.0, "text": "Ja."}, {"id": 155, "start": 621.0, "end": 626.0, "text": "So richtige Innovationen kommen halt."}, {"id": 156, "start": 626.0, "end": 627.0, "text": "Also so Sachen wie."}, {"id": 157, "start": 627.0, "end": 630.0, "text": "Es gibt jetzt ein Smartphone was jeder verwenden will."}, {"id": 158, "start": 630.0, "end": 631.0, "text": "Ja."}, {"id": 159, "start": 631.0, "end": 632.0, "text": "Das ist selten."}, {"id": 160, "start": 632.0, "end": 636.0, "text": "Oder es gibt eine neue Konsole."}, {"id": 161, "start": 636.0, "end": 638.0, "text": "Die halt wirklich auch mal wieder Hype ist."}, {"id": 162, "start": 638.0, "end": 639.0, "text": "Das dauert halt."}, {"id": 163, "start": 639.0, "end": 640.0, "text": "Das kommt nicht so oft."}, {"id": 164, "start": 640.0, "end": 643.0, "text": "Oder es gibt mal ein neues Game."}, {"id": 165, "start": 643.0, "end": 645.0, "text": "Wo man drauf gewartet hat."}, {"id": 166, "start": 645.0, "end": 646.0, "text": "Dann ist es auch richtig gut."}, {"id": 167, "start": 646.0, "end": 647.0, "text": "Und sowas."}, {"id": 168, "start": 647.0, "end": 648.0, "text": "Also das kommt selten."}, {"id": 169, "start": 648.0, "end": 649.0, "text": "Das war aber auch früher so."}, {"id": 170, "start": 649.0, "end": 653.0, "text": "Dass die Dinge auch nicht im Monatstakt gekommen sind."}, {"id": 171, "start": 653.0, "end": 654.0, "text": "Nur dass es uns heute."}, {"id": 172, "start": 654.0, "end": 655.0, "text": "So verkaufen wollen."}, {"id": 173, "start": 655.0, "end": 657.0, "text": "Dass jeder Kleinscheiß quasi."}, {"id": 174, "start": 657.0, "end": 660.0, "text": "Die Wahnsinns Innovation noch nie dagewesen Innovation ist."}, {"id": 175, "start": 660.0, "end": 663.0, "text": "Und das ist so richtig gut."}, {"id": 176, "start": 663.0, "end": 664.0, "text": "Ja."}, {"id": 177, "start": 664.0, "end": 665.0, "text": "Ja."}, {"id": 178, "start": 665.0, "end": 666.0, "text": "Ja."}, {"id": 179, "start": 666.0, "end": 667.0, "text": "Ja."}, {"id": 180, "start": 667.0, "end": 668.0, "text": "Ja."}, {"id": 181, "start": 668.0, "end": 669.0, "text": "Ja."}, {"id": 182, "start": 669.0, "end": 670.0, "text": "Ja."}, {"id": 183, "start": 670.0, "end": 671.0, "text": "Ja."}, {"id": 184, "start": 671.0, "end": 672.0, "text": "Ja."}, {"id": 185, "start": 672.0, "end": 673.0, "text": "Ja."}, {"id": 186, "start": 673.0, "end": 674.0, "text": "Ja."}, {"id": 187, "start": 674.0, "end": 675.0, "text": "Ja."}, {"id": 188, "start": 675.0, "end": 676.0, "text": "Ja."}, {"id": 189, "start": 676.0, "end": 677.0, "text": "Ja."}, {"id": 190, "start": 677.0, "end": 678.0, "text": "Ja."}, {"id": 191, "start": 678.0, "end": 679.0, "text": "Ja."}, {"id": 192, "start": 679.0, "end": 690.0, "text": "Ja."}, {"id": 193, "start": 690.0, "end": 691.0, "text": "Ja."}, {"id": 194, "start": 691.0, "end": 692.0, "text": "Ja."}, {"id": 195, "start": 692.0, "end": 693.0, "text": "Ja."}, {"id": 196, "start": 693.0, "end": 694.0, "text": "Ja."}, {"id": 197, "start": 694.0, "end": 719.0, "text": "Ja."}, {"id": 198, "start": 719.0, "end": 720.0, "text": "Ja."}, {"id": 199, "start": 720.0, "end": 721.0, "text": "Ja."}, {"id": 200, "start": 721.0, "end": 722.0, "text": "Ja."}, {"id": 201, "start": 722.0, "end": 723.0, "text": "Ja."}, {"id": 202, "start": 723.0, "end": 724.0, "text": "Ja."}, {"id": 203, "start": 724.0, "end": 725.0, "text": "Ja."}, {"id": 204, "start": 725.0, "end": 726.0, "text": "Ja."}, {"id": 205, "start": 726.0, "end": 727.0, "text": "Ja."}, {"id": 206, "start": 727.0, "end": 728.0, "text": "Ja."}, {"id": 207, "start": 728.0, "end": 729.0, "text": "Ja."}, {"id": 208, "start": 729.0, "end": 754.0, "text": "Ja."}, {"id": 209, "start": 754.0, "end": 759.0, "text": "Ja."}, {"id": 210, "start": 759.0, "end": 774.0, "text": "Ja."}, {"id": 211, "start": 774.0, "end": 775.0, "text": "Ja."}, {"id": 212, "start": 775.0, "end": 776.0, "text": "Ja."}, {"id": 213, "start": 776.0, "end": 777.0, "text": "Ja."}, {"id": 214, "start": 777.0, "end": 778.0, "text": "Ja."}, {"id": 215, "start": 778.0, "end": 779.0, "text": "Ja."}, {"id": 216, "start": 779.0, "end": 780.0, "text": "Ja."}, {"id": 217, "start": 780.0, "end": 781.0, "text": "Ja."}, {"id": 218, "start": 781.0, "end": 782.0, "text": "Ja."}, {"id": 219, "start": 782.0, "end": 783.0, "text": "Ja."}, {"id": 220, "start": 783.0, "end": 788.68, "text": "lustig, also ich hab selten so gelacht beim Video und das ist kein Video was funny sein soll, das ist einfach ein Typ der"}, {"id": 221, "start": 790.56, "end": 792.56, "text": "offensichtlich, da geht es nicht mehr planlos ist"}, {"id": 222, "start": 806.28, "end": 812.68, "text": "Genau und der erklärt große Entdeckung nicht nur falsch, sondern er weiß es"}, {"id": 223, "start": 812.68, "end": 819.08, "text": "besser und beweist uns das in dem Video auch nur das ist halt seine Beweise, ziemlicher Grinch sind"}, {"id": 224, "start": 824.68, "end": 829.96, "text": "Soll ich gleich noch was anderes erzählen, Leute vielleicht muss ich demnächst kündigen auf der Arbeit, ich bin mir noch unschlüssig"}, {"id": 225, "start": 831.08, "end": 833.08, "text": "Erzähl ich euch gleich"}, {"id": 226, "start": 834.4, "end": 839.12, "text": "Zusammenfassung bei Linus Tech Tips, ich gucke zwar wenig Linus Tech Tips"}, {"id": 227, "start": 839.8, "end": 841.28, "text": "aber"}, {"id": 228, "start": 841.28, "end": 845.8, "text": "Ich brauche mal wieder Werbung für Unterhosen von Linus Tech Store"}, {"id": 229, "start": 850.28, "end": 856.96, "text": "Apple just killed M1, ja was ist das für eine Überschrift, die haben M2 vorgestellt, genau, LUL, es war so klar"}, {"id": 230, "start": 857.6, "end": 859.6, "text": "She baited"}, {"id": 231, "start": 859.6, "end": 876.88, "text": "Was für eine Arschung, man muss sagen es wurde die letzten Jahre vieles halt als super krassen innovativen Shit verkauft"}, {"id": 232, "start": 876.88, "end": 880.92, "text": "Guckt euch mal an, die Metaverse Geschichte, die überall verkauft wird, vor ein paar Jahren"}, {"id": 233, "start": 880.92, "end": 890.4, "text": "3D im Fernsehen, gibt es heute überhaupt noch Fernsehen die wirklich 3D können, da dann irgendwelche VR Sachen, das war alles die haben sich da"}, {"id": 234, "start": 890.4, "end": 896.36, "text": "alle immer aufgespielt, als hätten sie wirklich das Rad neu erfunden und im Endeffekt hat es Kassau interessiert"}, {"id": 235, "start": 896.68, "end": 898.76, "text": "Da gab es viele dinge die letzten Jahre über"}, {"id": 236, "start": 899.48, "end": 904.96, "text": "Oder oder erinnert sich noch einer dran, wo sie die Xbox One angekündigt haben, mit tollen"}, {"id": 237, "start": 904.96, "end": 919.52, "text": "TV Features für American Football, wo ich mir auch gedacht habe, also das ist ja sogar für Cokona Land zu überholt schon"}, {"id": 238, "start": 919.52, "end": 940.72, "text": "Wobei, wenn ich es mir so recht überlege, da könnte tatsächlich doch ein bisschen was dran sein, weil die Leute scheinen ja nach großen neuen Sachen zu gucken"}, {"id": 239, "start": 940.72, "end": 954.48, "text": "Anders kann ich mir diese ganzen Kickstarter Scams und Krypto Scams und Scams dieser Art, die es aktuell so gibt, nicht erklären"}, {"id": 240, "start": 954.48, "end": 961.04, "text": "Die Leute denken sie haben den neuen großen Shit entdeckt, werden aber gescampt"}, {"id": 241, "start": 961.04, "end": 968.64, "text": "Es gibt so viele Games, die beispielsweise virtuelles Land verkaufen für Spiele, die es nie geben wird"}, {"id": 242, "start": 968.64, "end": 977.12, "text": "Oder Leute, die sagen, wir entwickeln ein Spiel über Kickstarter, stellen dann fest, oh das ist doch aufwendiger als gedacht und verarschen dann 5 Jahre lang"}, {"id": 243, "start": 977.12, "end": 982.72, "text": "Die Leute, also der Scam ist in letzter Zeit tatsächlich ganz besonders strong überall"}, {"id": 244, "start": 985.68, "end": 987.68, "text": "Ich mein Bitconnect war wenigstens noch witzig"}, {"id": 245, "start": 987.68, "end": 997.36, "text": "Da kannst du dich heute noch drüber lustig machen, aber der Scam, den ich da in letzter Zeit so sehe, das ist einfach nur noch traurig, dass da so viele Leute reinfallen"}, {"id": 246, "start": 997.36, "end": 1012.16, "text": "Keine Container, nee, warum soll ich das in einen Container packen, das soll auf dem Linux Receiver laufen mit 512 RAM und einem ARM 7 Gedinke, da gibt es nichts mit Container"}, {"id": 247, "start": 1012.16, "end": 1022.88, "text": "Und der Kubernetes Cluster bringt uns da auch nicht viel, es sei denn, ihr müsst weltweit skalieren, weil Leute euer Fernsehprogramm angucken wollen"}, {"id": 248, "start": 1022.88, "end": 1028.64, "text": "Als wäre gesagt, das ist von eurem Linux Receiver gecrapte Fernsehzeitungs-Kram"}, {"id": 249, "start": 1028.64, "end": 1057.76, "text": "Das war doch die Dev-Konferenz, ja, das war quasi das Gegenstück von der Microsoft Build, nur, dass die Build deutlich mehr Sessions hat und länger ist, aber ok, also die Keynote von der Build, so ungefähr, ist das gleiche"}, {"id": 250, "start": 1057.76, "end": 1064.08, "text": "Nur, dass die Build dieses Jahr auch richtig schlecht war, ja, richtig cringy"}, {"id": 251, "start": 1064.08, "end": 1080.4, "text": "Äh, ja, kann sein, kann sein, aber der weiß ja, um was es geht"}, {"id": 252, "start": 1080.4, "end": 1095.44, "text": "Ich bin am überlegen, aber ich werde nicht einfach jetzt blind kündigen, ich warte nochmal, was passiert, aber die Chance besteht auf jeden Fall, je nachdem, wie sich die Firma da entscheidet, was sie da als Marschrichtung geben, dass ich mich demnächst vom Acker mache"}, {"id": 253, "start": 1095.44, "end": 1111.36, "text": "Also, genau, ich weiß gar nicht mehr, irgendwie so in der Richtung fängt das an"}, {"id": 254, "start": 1111.36, "end": 1126.16, "text": "Und jeder, der das sieht, sagt, wie konnte man denen Geld geben, und doch haben ihnen Leute Geld gegeben, also was ich erzählen wollte, also ich hab nicht vor morgen zu kündigen oder so, aber nur mal so"}, {"id": 255, "start": 1126.16, "end": 1145.36, "text": "Ein paar Dinge, die gerade bei mir auf der Arbeit passieren, die mir ein bisschen auf den Keks gehen, und zwar, das Team, in dem ich bin, ergibt es wahrscheinlich bald nicht mehr, weil sich unser Oberes Management dazu entschieden hat, mal wieder zu umzustrukturieren"}, {"id": 256, "start": 1145.36, "end": 1174.8, "text": "Und umzustrukturieren, ohne dass die Sachen schon wirklich spruchreif wären, die haben quasi die Leute einfach massiv verwirrt, also stellt euch vor, der IT-Chef schickt eine Einladung zu einem virtuellen Teams-Meeting, wo dann gesagt wird, also in einem Monat strukturieren wir die IT neu"}, {"id": 257, "start": 1174.8, "end": 1194.24, "text": "Strukturieren wir die IT um, strukturieren wir die IT neu, zeigt euch irgendwie ein Organigramm mit dem Hinweis, ja, das ist noch temporär, es wird nichts gesagt, wer wozu gehört, es stehen keine Namen irgendwo, es stehen noch nicht mal Führungskräfte oben an dem Organigramm dran"}, {"id": 258, "start": 1194.24, "end": 1213.6, "text": "Und am Ende sind sie dann der Meinung, man hat jetzt die Leute voll geil informiert, also es hat wirklich nur alle Fragezeichen über dem Kopf, so nach dem Motto, was wollt ihr eigentlich und warum überhaupt, man wusste es nicht, man weiß es ehrlich gesagt bis heute nicht so genau"}, {"id": 259, "start": 1213.6, "end": 1237.04, "text": "Was ist ein Organigramm, so wie in Firmenstruktur, so was da, wie die Firma strukturiert ist, wie das Unternehmen strukturiert ist, da sieht man es dann, da steht dann zum Beispiel hier Vorstand, dann steht hier IT, blablabla und dann hört man es halt von der IT und so, Strukturgramm"}, {"id": 260, "start": 1237.04, "end": 1258.64, "text": "So und das hat natürlich alle ein bisschen verwirrt, dass man solche Ansagen gemacht hat, vor allem versteht keiner so genau warum, weil wir haben ja noch vor nicht all zu langer Zeit restrukturiert und die alte Restrukturierung ist noch gar nicht so richtig abgeschlossen"}, {"id": 261, "start": 1258.64, "end": 1274.32, "text": "Also das ist dann quasi die Restrukturierung während der Restrukturierung, also ganz merkwürdiges Zeug irgendwo, ja und da wird dann immer mit so Sachen um sich geworfen, wie ja wir möchten Synergieeffekte nutzen"}, {"id": 262, "start": 1274.32, "end": 1291.12, "text": "Die müssen wir jetzt mal eins erklären, wie krass und toll müssen die neuen Synergieeffekte sein, wenn man alle bisher gewonnenen Synergieeffekte in die Tonne schmeißt, also so krass können die Netze, das ist einfach irgendein Marketingblödsinn Wort"}, {"id": 263, "start": 1291.12, "end": 1313.76, "text": "So zumindest was jetzt rausgekommen ist, ich habe heute eine Einladung bekommen für nächste Woche, wo wir von unserem Abteilungschef, Abteilungsleiter vorgestellt bekommen, wie denn jetzt unser neues Team aussehen wird, weil wir haben daraus jetzt quasi erfahren, das hat uns ja vorher keiner gesagt, dass es wahrscheinlich unser Team nicht mehr geben wird"}, {"id": 264, "start": 1313.76, "end": 1328.0, "text": "Das lese ich jetzt aus den Teilnehmern dieser Informationsveranstaltung raus und mein Chef ist nicht eingeladen zu diesem Meeting, was bedeutet, er ist nicht mehr mein Chef höchstwahrscheinlich"}, {"id": 265, "start": 1328.0, "end": 1339.84, "text": "Das geile ist, man hat ihm bis jetzt noch nichts gesagt und in drei Wochen soll das passieren, das ist unter aller Sau, keine Ahnung was dieser Laden wieder treibt"}, {"id": 266, "start": 1339.84, "end": 1361.28, "text": "Und das kriege ich dann nächste Woche erzählt, da bin ich mal gespannt und ich bin auch mal gespannt, was mein dann neuer Chef, was ich übrigens nicht gut finde, ich mag mein aktuelles Team, ich bin der Meinung, wir haben das beste Team, was wir seit 2000, ja gut offiziell bin ich seit 2012 da, also seit 10 Jahren hatten"}, {"id": 267, "start": 1361.28, "end": 1373.44, "text": "Ich weiß nicht, warum man das jetzt in die Tonne kloppen will, nice, EQ-Steigerung ist immer gut, 5-Header, 6-Header, danke für den Sub"}, {"id": 268, "start": 1373.44, "end": 1397.76, "text": "So und da bin ich mal gespannt, was da rauskommt und ich gehe davon aus, ich gehe davon aus, dass sie mit dieser Führungsetagen-Wechselsache auch durchsetzen wollen, dass es kein Homeoffice mehr gibt"}, {"id": 269, "start": 1397.76, "end": 1406.0, "text": "Und ihr könnt euch nicht vorstellen, wie schnell ich weg bin, wenn es wirklich heißt, es gibt kein Homeoffice mehr"}, {"id": 270, "start": 1406.0, "end": 1422.24, "text": "Weil das ist einfach nur fernab jeglicher Realität 2022 und auch fernab dessen, was in vielen Konkurrenzunternehmen mittlerweile an der Tagesordnung ist"}, {"id": 271, "start": 1422.24, "end": 1432.96, "text": "Ich verstehe, wenn man sagt, man will nicht, dass die ganze Firma 100% nicht in jedem Bereich Homeoffice macht, verstehe ich, es mag gerade im Marketingbereich bestimmt was geben, wo das besser ist"}, {"id": 272, "start": 1432.96, "end": 1450.4, "text": "Meinetwegen mag alles sein, bei uns sehe ich den Vorteil nicht, zumal es mir besser geht und ich mehr schaffe, also es kann mir keiner wirklich Fakten basiert und konnte es dort noch keiner wirklich so stichhaltig begründen, warum das schlecht ist mit Homeoffice"}, {"id": 273, "start": 1450.4, "end": 1459.92, "text": "So, aber, nachdem das vielleicht unserem noch höheren Management vorschwebt, die Leute sollen einen Tag oder gar keinen Tag Homeoffice mehr machen, dann bin ich weg"}, {"id": 274, "start": 1463.92, "end": 1472.08, "text": "Siste, bei uns ist das genau umgedreht, ich erwische die Leute über Teams dreimal schneller, wie vor Hort im Büro"}, {"id": 275, "start": 1472.08, "end": 1479.76, "text": "Das können wir tatsächlich mal ausprobieren, ob wir Katzencam machen"}, {"id": 276, "start": 1479.76, "end": 1499.76, "text": "So, und, da bin ich gespannt, sollte das wirklich der Fall sein, ich will nicht weg, wie gesagt, auch mit den verbleibenden Leuten, ich verstehe mich mit denen gut, ich will nicht unbedingt weg, aber sollte man wirklich Homeoffice abschaffen, dann werde ich demnächst mal gucken, was es sonst noch so gibt"}, {"id": 277, "start": 1499.76, "end": 1523.92, "text": "Und der Witz ist ja, ich habe jetzt hier, während ich streame, also die letzten, wie lange streame ich schon, drei Jahre oder so, ich habe sogar ohne, und das weiß eigentlich jeder, dass ich gut unter bin und eigentlich nichts aktiv suche, ich habe trotzdem einige Angebote sogar per Mail bekommen, die sind auf YouTube, also sie haben was für sich streamen gesehen, YouTube geguckt"}, {"id": 278, "start": 1523.92, "end": 1537.84, "text": "Und sie dann auf YouTube haben eine Businessadresse rausgeschrieben und haben mich angeschrieben, so nach dem Motto, Max, wir suchen Leute, das fand ich ja cool, ja mit einem habe ich auch mal sogar telefoniert, das fand ich ja wirklich cool, aber zu dem Zeitpunkt habe ich keinen gesucht"}, {"id": 279, "start": 1537.84, "end": 1557.36, "text": "Also ich habe es ja auch nicht wirklich eilig, da ich dachte, Leute, ich brauche nächste Woche einen neuen Job, aber wenn es so weit ist, ich werde definitiv nicht mehr jeden Tag die Woche mit der Bahn nach Frankfurt pendeln, das halte ich geistig einfach nicht aus, das funktioniert nicht"}, {"id": 280, "start": 1557.36, "end": 1570.88, "text": "Und dann werde ich mir notgedrungen, was Neues suchen müssen, sollte das wirklich der Fall sein, ich will nicht, ich fände es eigentlich ganz gut da, aber da ist die Schmerzgrenze dann erreicht"}, {"id": 281, "start": 1578.4, "end": 1581.68, "text": "Elon Musk erzählt doch öfters mal komische Dinger"}, {"id": 282, "start": 1581.68, "end": 1603.44, "text": "Elon Musk ist so ein typischer Kandidat, der kann halt wunderbar Leute quasi von sich begeistern, was hauptsächlich daran liegt, weil er sich selbst mega geil findet, dass es ja immer so eine Sache kommt zum anderen"}, {"id": 283, "start": 1603.44, "end": 1618.32, "text": "Der hat durchaus coole Sachen gemacht schon, aber es ist auch viel Blödsinn dabei, ich bin beispielsweise überhaupt kein Fan von Starlink, habe ich ja schon ein paar mal erzählt, aber nicht dass zu trotz, es gibt coole Sachen von ihm"}, {"id": 284, "start": 1618.32, "end": 1633.2, "text": "Ja und ich bin auch der Meinung, gerade das was er mit SpaceX macht und auch was er mit Tess ist eigentlich eine coole Sache, auf der anderen Seite sind auch, wollte ich gerade sagen, auf der anderen Seite sind auch schon viele Dinge, die haben nicht funktioniert, sage ich gar nichts dagegen"}, {"id": 285, "start": 1633.2, "end": 1659.44, "text": "Aber dass man jetzt immer so tun muss, dass man alles direkt, immer 100%ig so ist es, nur weil Elon Musk das sagt, ich könnte mir aber vorstellen, dass gerade in der BWL Ecke oder zumindest in der Möchte gern Elon Musk Fanboy Ecke, also sprich das sind die Führungskräfte, die gerne wie Elon Musk sein möchten, aber es wahrscheinlich nie werden"}, {"id": 286, "start": 1659.44, "end": 1669.12, "text": "Davon gibt es unglaublich viel, habt ihr auch so welche? Habt ihr auch Führungskräfte, die gerne Elon Musk 2.0 sein wollen und sich auch so aufführen, aber es nicht sind?"}, {"id": 287, "start": 1669.12, "end": 1681.6, "text": "Ja, dass gerade in dieser Ecke diese Aussagen halt immer eins zu eins quasi ja parat so hingelegt werden, so als wäre das so, weil das Elon Musk mal gesagt hat"}, {"id": 288, "start": 1681.6, "end": 1695.28, "text": "Und ich meine, das kann ja durchaus sein, dass Elon Musk einen Punkt hat, ich meine, der kennt ja sein Unternehmen und vielleicht, wer weiß, wie das bei Tesla intern so ist, vielleicht ist das in manchen Bereichen auch so"}, {"id": 289, "start": 1695.28, "end": 1703.76, "text": "Wie gesagt, gerade im Marketing Bereich kann ich mir das tatsächlich sogar vorstellen, dass es da mit Homeoffice manchmal schwierig ist, aber es gibt halt Bereiche, da ist das nicht so"}, {"id": 290, "start": 1703.76, "end": 1721.68, "text": "Und unterm Strich ist es auch alles egal, wisst ihr, warum es egal ist? Weil es genug Unternehmen gibt, die es mittlerweile gecheckt haben und auch wissen, dass sie das anbieten müssen, wenn sie neue Leute bekommen wollen, dann gehen die Leute halt zu denen"}, {"id": 291, "start": 1721.68, "end": 1735.92, "text": "Die ganzen Boomer-Unternehmen, die es einfach nicht auf die Reihe bekommen, die werden es früher oder später lernen müssen oder aber sie lernen es nicht und bekommen halt nur suboptimal Leute"}, {"id": 292, "start": 1735.92, "end": 1747.6, "text": "Das heißt ja nicht, dass die dann automatisch pleite gehen, das nicht, aber die bekommen halt nicht unbedingt die Leute, die sie sich so wünschen, die können sich das halt nicht aussuchen"}, {"id": 293, "start": 1747.6, "end": 1763.04, "text": "Das ist genauso, wie wenn irgendwelche kleinen Programmierklitschen der Meinung sind, sie müssen jetzt irgendwelche super krassen Google Einstellungstest machen, von Brain Teaser bis Algorithmen an der Tafel"}, {"id": 294, "start": 1763.04, "end": 1772.56, "text": "Der Unterschied ist, dass zu Google ganz viele wollen auch die Big Brain der Big Brains und die sich die raussuchen können"}, {"id": 295, "start": 1772.56, "end": 1784.88, "text": "Bei der Programmierklitsche um die Ecke, da kommt vielleicht der ehemalige Mainframe-Entwickler Herbert, der sich bewerbt, weil er jetzt Java gelernt hat"}, {"id": 296, "start": 1784.88, "end": 1802.48, "text": "Das ist halt schon auch ein bisschen vom Anspruch her was anderes, aber das ist da glaube ich einigen nicht klar, die wären gerne Google"}, {"id": 297, "start": 1802.48, "end": 1820.08, "text": "Wisst ihr was, ich glaube, dass das tatsächlich die neue Masche der Headhunter ist und damit haben sie Recht meiner Einschätzung nach, die versuchen Leute anzuschreiben, von denen sie glauben, dass sie innerlich, innerlich gekündigt ist übertrieben gesagt"}, {"id": 298, "start": 1820.08, "end": 1833.68, "text": "Du bist ja eigentlich zufrieden, dass sie innerlich quasi nicht so fest verwachsen sind, drücken wir es mal so aus mit dem Laden, wo sie gerade sind"}, {"id": 299, "start": 1833.68, "end": 1854.32, "text": "Und das ist auch sinnvoll, weil ein ganz großer Anteil, da gibt es sogar Statistiken zu, habe ich letztens in einem Video geguckt, von Arbeitnehmern in Deutschland haben innerlich schon gekündigt, also sprich, die sind noch da, weil sie zu faul sind, keinen Bock haben, wie auch immer, machen einen Dienst nach Vorschrift, aber im Prinzip geht es ihnen am Arsch vorbei"}, {"id": 300, "start": 1854.32, "end": 1864.16, "text": "Und solche Leute kannst du natürlich auch wunderbar abwerben, aber solche Leute erreichst du halt nicht mit, wir schalten eine Stellenanzeige, weil die Leute sich nicht von sich aus bewerben"}, {"id": 301, "start": 1864.16, "end": 1872.4, "text": "Sprichst du die Leute allerdings an, wobei Xing schon ziemlich outdated ist, mittlerweile dachte ich, dass LinkedIn eigentlich das einzige, was noch verwendet wird"}, {"id": 302, "start": 1872.4, "end": 1891.44, "text": "Und wenn du so Leute halt anschreibst mit dem passenden Angebot, dann sind die bereit, sich das anzukommen und wenn dann die Vorteile da sind im Vergleich zum aktuellen Job, das muss nicht immer nur Bezahlung sein, dann denke ich, sind da viele auch gewillt, das zu machen"}, {"id": 303, "start": 1891.44, "end": 1909.04, "text": "Na ja, ein bisschen klar, wie gesagt, gerade was wir hier schon im Stream gemacht haben, Sachen, ich kenne mich ja relativ breit aus in vielen Bereichen, wir haben ja in fast jedem Bereich schon mal was gemacht im Stream"}, {"id": 304, "start": 1909.04, "end": 1922.96, "text": "Wir haben sogar schon mal Cobalt programmiert, wobei ich das nicht machen möchte hauptberuflich, Cobalt programmieren, wir haben alles mögliche, viele Bereiche schon gemacht, wir haben uns Cloud Sachen im Stream angeguckt, wir haben Embedded Sachen im Stream gemacht"}, {"id": 305, "start": 1922.96, "end": 1933.68, "text": "Wir haben bestimmt schon 10 verschiedene Programmiersprachen uns angeguckt, also ich kenne mich ja eigentlich relativ breit aus und gerade im.NET Bereich könnte ich mir tatsächlich vorstellen, da auch zu arbeiten"}, {"id": 306, "start": 1933.68, "end": 1957.6, "text": "Jetzt vielleicht nicht als hauptberuflicher.NET Entwickler, aber gerade im DevOps Bereich oder sei es bei irgendwelchen so Hybridgeschichten von Admin und Tools oder irgendwelche Cloud Provisioning Geschichten und so, gibt es ja jede Menge neue Sachen mittlerweile, wo Leute gesucht werden, das könnte ich mir schon vorstellen"}, {"id": 307, "start": 1963.68, "end": 1979.76, "text": "Ja, also ich würde mir das angucken, wenn es da was gibt, ja, also auch wenn ich irgendwas sehe, wo jetzt keine Ahnung, ich meine, es gibt schon ein paar Sachen, da habe ich keinen Bock drauf, also wenn jetzt irgendwie ein sagt, hier Max, wie sieht es mit Mainframe aus, dann würde ich auf, würde ich sagen nein"}, {"id": 308, "start": 1979.76, "end": 1993.68, "text": "Und PC++ würde ich auch sagen nein, das muss nicht sein oder wenn einer ankommt, mach Windows Active Directory, das würde ich auch nicht machen, aber irgendwas, am liebsten würde ich natürlich wieder irgendwas im Linux Umfeld machen"}, {"id": 309, "start": 1993.68, "end": 2010.56, "text": "Mit Windows will ich nichts zu tun haben und was das jetzt ist, ja, das hängt vom Job ab, also es muss auch nicht Linux sein vor Ort, aber Linux Umfeld ist ja auch relativ breit"}, {"id": 310, "start": 2010.56, "end": 2028.16, "text": "Selbstständig bin ich ja schon nebenbei, das will ich aber nicht hauptberuflich machen, obbei, selbstständig bin ich nicht nebenbei, das kann man so falsch gesagt, ich habe eine eigene Firma nebenbei, selbstständig bin ich nicht, weil dann müsste ich das ja hauptberuflich machen"}, {"id": 311, "start": 2040.56, "end": 2064.08, "text": "Ja, kann er, dann muss er sich aber nicht wundern oder müssen sich bei uns nicht wundern, also wenn du jetzt die Auswahl hast als IT Mensch und kannst zum Unternehmen gehen, das Homeoffice anbietet oder zu einem, das kein Homeoffice anbietet und der Rest ist, sag mal, ungefähr gleich, dann ist klar, wofür du dich entscheidest"}, {"id": 312, "start": 2064.08, "end": 2080.72, "text": "Und nachdem die eh, wenn man sich die Stellenanzeigen anguckt und auch wie überall geheult wird, dass es so viele offenen Stellen gibt, händeringendst neue Leute suchen, sollte man sich halt mal überlegen, ob man nicht vielleicht von seinem hohen Ross runterkommt und zu sagen, wir sind die geilste Firma der Welt, die Leute wollen doch schon zu uns"}, {"id": 313, "start": 2080.72, "end": 2087.12, "text": "Sondern der Realität ins Auge blickt und sagt, ja, anscheinend reicht das mittlerweile nicht mehr"}, {"id": 314, "start": 2087.12, "end": 2096.4, "text": "Excellent, kommt da am Ende plus plus raus"}, {"id": 315, "start": 2096.4, "end": 2107.92, "text": "Ja, das kann ich mir vorstellen, ich hab kein Xing-Profil, ich hab ein LinkedIn-Profil, wisst ihr das"}, {"id": 316, "start": 2107.92, "end": 2117.6, "text": "Das gibt's ja immer noch"}, {"id": 317, "start": 2117.6, "end": 2122.32, "text": "Das gibt's ja immer noch"}, {"id": 318, "start": 2122.32, "end": 2138.24, "text": "Das gibt's ja immer noch"}, {"id": 319, "start": 2138.24, "end": 2150.8, "text": "Cloud-Native-Agent GitHub-Solution Chief Engineer Officer"}, {"id": 320, "start": 2150.8, "end": 2152.8, "text": "Ebenfalls angesehen"}, {"id": 321, "start": 2152.8, "end": 2162.96, "text": "Nein, die hab ich mir nicht angesehen, ich weiß gar nicht, wer das alles ist"}, {"id": 322, "start": 2162.96, "end": 2170.88, "text": "Weitere Mitglieder, die Peter Agile, was"}, {"id": 323, "start": 2170.88, "end": 2181.36, "text": "Das stimmt doch überhaupt nicht, die heißen Peter Jankovic, die halte ich Peter Agile, was ist denn LinkedIn für eine Pepega-Seite"}, {"id": 324, "start": 2181.36, "end": 2191.52, "text": "Na ja, das ist irgendwie so ein Basswörtbegriff für Leute, die, keine Ahnung, was man sich da genau drunter forscht"}, {"id": 325, "start": 2191.52, "end": 2200.8, "text": "Aber ja, den Begriff, der wird manchmal mit um sich geworfen"}, {"id": 326, "start": 2200.8, "end": 2211.44, "text": "Ja, hab ich ja grad schon gesagt, müsste ich jetzt, ich hab so viele Sachen schon beantwortet, müsste ich mich jetzt wieder reindecken"}, {"id": 327, "start": 2211.44, "end": 2213.44, "text": "Nee, hab ich aber glaub ich grad alles zugesagt"}, {"id": 328, "start": 2213.44, "end": 2223.44, "text": "Na ja, nö, also sag mal so, so 7-8 Kilo könnte ich noch abnehmen, dann ist alles gut"}, {"id": 329, "start": 2223.44, "end": 2226.64, "text": "Nö, hab ich nicht, juckt mich auch nicht"}, {"id": 330, "start": 2226.64, "end": 2235.04, "text": "Wenn du was mit Blockchain machst, hab ich nicht vor, aber ganz ehrlich, wenn"}, {"id": 331, "start": 2235.04, "end": 2246.48, "text": "Irgendeiner, irgendwas in Frankfurt der Meinung ist, sie brauchen Leute, die sich mit Linux gut auskennen oder mit.NET gut auskennen"}, {"id": 332, "start": 2246.48, "end": 2253.6, "text": "Oder mit Cloud Sachen auskennen oder mit, wir haben 30.000 Sachen, ich müsste mal wirklich eine Skillliste machen"}, {"id": 333, "start": 2253.6, "end": 2261.12, "text": "Und die bezahlen gut und die bieten Homeoffice und am Ende stellt sich raus, die entwickeln eine Blockchain, ist mir das doch egal"}, {"id": 334, "start": 2261.12, "end": 2274.88, "text": "Sollen die Blockchain machen? Im Zweifelsfall richte ich denen ein paar Kisten ein, auf denen sie ihre geile Blockchain Software laufen lassen können, das juckt mich doch nicht"}, {"id": 335, "start": 2274.88, "end": 2287.84, "text": "Wann wurde das Scenery Statement erfunden, welche Sprache, ich würd mal sagen C, kann das sein?"}, {"id": 336, "start": 2287.84, "end": 2293.84, "text": "Also in C gab's das, gibt's das und C gibt es relativ lang, deswegen würd ich einfach mal sagen C"}, {"id": 337, "start": 2293.84, "end": 2304.8, "text": "Ja ich weiß auch nicht, warum es nicht gesperrt wurde"}, {"id": 338, "start": 2304.8, "end": 2320.88, "text": "Rambon, danke für den Sub"}, {"id": 339, "start": 2320.88, "end": 2330.96, "text": "Okay gut, wunderbar, also ich hab den Chat, den Chat aufgeholt, so was gucken wir uns den jetzt an, ähm, was ist das, oh nein"}, {"id": 340, "start": 2330.96, "end": 2342.48, "text": "Zero Hour, habt ihr die Ankündigung gesehen, gestern, Zero Hour triffts ja ganz gut, das ist wahrscheinlich die Spielzeit der meisten Leute"}, {"id": 341, "start": 2342.48, "end": 2351.12, "text": "Ich würd's eher sagen Zero Content, ihr habt nix verpasst, die Ankündigung ist komplett sinnlos gewesen"}, {"id": 342, "start": 2351.12, "end": 2361.92, "text": "Was, haben sie schon wieder irgendwie super Spezialisten am Start hier, wenn ich das schon im Forscher Bildschirm sehe"}, {"id": 343, "start": 2361.92, "end": 2369.36, "text": "Ähm, wollen wir zur Runde LevelCapture Bane, komm wir lassen uns zur Runde LevelCapture Bane"}, {"id": 344, "start": 2369.36, "end": 2377.52, "text": "Aber eine Runde LevelCapture Bane, aber ich werd's mir wahrscheinlich nicht komplett angucken sag ich mal"}, {"id": 345, "start": 2377.52, "end": 2382.48, "text": "Sag ich schon gleich zu, weil wahrscheinlich nix großes Substantielles bei rumkommt, aber mal kurz, ganz kurz reinhören"}, {"id": 346, "start": 2382.48, "end": 2403.12, "text": "Chat, was meint ihr, hat mich ihr ja auch eingeladen nochmal"}, {"id": 347, "start": 2412.48, "end": 2422.88, "text": "Okay, sag keiner was zu, nein, natürlich nicht, mein Video war wohl doch, ist auch wohl doch nicht so gut angekommen"}, {"id": 348, "start": 2422.88, "end": 2433.12, "text": "Und, dem bleibt ja auch nix anderes übrig, gerade im englischen Bereich, die großen Leute zu inviten, egal was sie dazu sagen"}, {"id": 349, "start": 2433.12, "end": 2440.0, "text": "Weil ansonsten covert eh keiner mehr das Game, aber nein ich wurde nicht mehr eingeladen, ich hab aber auch so krass über das Game hergezogen"}, {"id": 350, "start": 2440.0, "end": 2446.4, "text": "Ich würd mich auch nicht mehr einladen"}, {"id": 351, "start": 2446.4, "end": 2452.96, "text": "Und ja, da sind die selbst dran schuld, ich mein, ich hab nicht gehofft, dass das Game kacke wird"}, {"id": 352, "start": 2452.96, "end": 2459.2, "text": "Ich hätte das Sponsoring noch nicht mal angenommen, hätte ich auch nur erahnt, dass das Game so kacke wird, wie es letztendlich ist"}, {"id": 353, "start": 2459.2, "end": 2465.44, "text": "Aber im Endeffekt, sind sie selbst dran schuld"}, {"id": 354, "start": 2465.44, "end": 2473.12, "text": "Ich hab's verbockt, insofern, dass ich nicht rumgeschleimt hab, ja das mag sein, aber ganz ehrlich, ich kann damit leben"}, {"id": 355, "start": 2473.12, "end": 2478.08, "text": "Die ganzen Events sind eh für den Arsch zum größten Teil"}, {"id": 356, "start": 2478.08, "end": 2484.8, "text": "Also das bescheuertste Event war immer noch das Battlefield 1 Event in Berlin, ich glaub ich war noch nie auf so einem überflüssigen Event"}, {"id": 357, "start": 2484.8, "end": 2493.44, "text": "Jeder der den Twitch Livestream geguckt hat, war besser dran als wir vor Ort, war komplett unsinnig, das ganze"}, {"id": 358, "start": 2493.44, "end": 2502.08, "text": "Also, die haben es doch nicht mal geschafft, das was sie im Vorfeld angekündigt hatten, einzuhalten"}, {"id": 359, "start": 2502.08, "end": 2510.16, "text": "Es hieß, wir können uns auf dem Event, das schon ein paar Stunden vor dem offiziellen Livestream angucken, natürlich dürfen wir vor dem offiziellen Livestream nichts erzählen"}, {"id": 360, "start": 2510.16, "end": 2518.32, "text": "Wir können aber schon was aufnehmen, wir bekommen, wenn die Präsentation vor Ort fertig ist, nochmal die Möglichkeit, sogar die Entwickler was zu fragen"}, {"id": 361, "start": 2518.32, "end": 2526.72, "text": "Wir bekommen sogar ein bisschen extra Footage gezeigt und wir bekommen dann am Ende einen USB Stick mit den wichtigen Sachen drauf, dass wir im Hotel sogar die Videos schon vorbereiten können"}, {"id": 362, "start": 2526.72, "end": 2533.44, "text": "So, so war das ganze angekündigt und was gab's am Ende? Es gab 10 Sekunden extra Trailer, das war das extra Footage"}, {"id": 363, "start": 2533.44, "end": 2542.16, "text": "Und die Fragerunde mit den Entwicklern war keine Fragerunde, sondern es waren vorgefertigte Fragen, die von einer Moderatorin, dem Battlefield Typ auf der Bühne gestellt wurden"}, {"id": 364, "start": 2542.16, "end": 2554.8, "text": "Und wir haben am Ende kein USB Stick gekriegt, das heißt, jeder, der daheim war, hat den Livestream sich angeguckt, daraus Sachen gecaptured und dann ein Video erstellt dazu"}, {"id": 365, "start": 2554.8, "end": 2560.72, "text": "War besser dran als wir vor Ort, die dann im Zweifelsfall noch im Hotel gehockt haben und dann mit dem kack Laptop was machen mussten"}, {"id": 366, "start": 2560.72, "end": 2565.6, "text": "Unglaublicher Schrott, also das war wirklich das schlechteste Event überhaupt, wo ich gewesen bin"}, {"id": 367, "start": 2565.6, "end": 2574.72, "text": "Und es war nicht das schlechteste organisiert, war es tatsächlich nicht schlecht, also es hatte alles drumherum funktioniert, aber sinnhaftig war es halt gar nicht"}, {"id": 368, "start": 2582.72, "end": 2593.76, "text": "Auf Level Cap erzählen, sag mal, was ist das eigentlich für eine Map? Die Map sieht aus, wie als hätte sie den 5-jährigen im Level Editor gemacht"}, {"id": 369, "start": 2593.76, "end": 2602.32, "text": "Was ist denn das? Das sieht aus wie, wie, what the fuck? Was ist das für eine Map?"}, {"id": 370, "start": 2602.32, "end": 2621.2, "text": "Ist das Roblox oder was? Was ist das für eine Map? Wasserkiste und Container? Das ist das, was du als erstes im Level Editor baust, wenn du noch keine Ahnung hast, wie es funktioniert? Was ist denn das?"}, {"id": 371, "start": 2621.2, "end": 2641.52, "text": "Das sieht Battle Bits besser aus, tatsächlich. Ja, Helis hat das Spiel unbedingt mehr gebraucht. Ja, das sieht aus wie eine prozedural generierte Map von irgendeinem Bot"}, {"id": 372, "start": 2641.52, "end": 2660.0, "text": "Ich mein, okay, das sieht wenigstens noch nach einer Map aus, wenn auch nicht gerade nach einer sonderlich hübschen Map"}, {"id": 373, "start": 2660.0, "end": 2677.04, "text": "By the way, es ist nicht etwa so, dass es jetzt 8 neue Maps gibt oder so, das ist eine Map in 8 Monaten, also ne, nicht Season 1 und 8 Maps, nein, nein, nein, nach 8 Monaten eine Map"}, {"id": 374, "start": 2677.04, "end": 2692.08, "text": "Das ist Battle Pass, who cares? Wen juckt es? Da gibt es eh nix Sinnvolles drin in dem Battle Pass, weil es gibt halt nix in dem Spiel"}, {"id": 375, "start": 2692.08, "end": 2705.92, "text": "Ich hatte ja sogar ursprünglich Bedenken, dass sie vielleicht dort irgendwelche unfairen Dinge einbauen, so nach dem Motto, ja, wir wollen die Leute quasi dazu animieren, den Battle Pass bis zum Ende zu kaufen, falls man es nicht freigespielt hat"}, {"id": 376, "start": 2705.92, "end": 2719.52, "text": "Ich mein, das Game hat kein Content, für was will man da großartig was freispielen? Ja, geil, irgendwie ein zweiter, tja, ganz ehrlich, guckt euch mal dieses Hovercraft an, da erkennt man noch nicht mal, ob das Ding überhaupt einen Skin hat"}, {"id": 377, "start": 2719.52, "end": 2722.56, "text": "Das sieht aus wie das, die vollen Hovercraft"}, {"id": 378, "start": 2724.56, "end": 2726.56, "text": "Ja, Legendary Weapon Skin"}, {"id": 379, "start": 2738.56, "end": 2744.56, "text": "Ah, okay, die neuen Helis anlockt man über den Battle Pass, das ist natürlich auch toll"}, {"id": 380, "start": 2744.56, "end": 2752.56, "text": "Das ist bescheuert, eigentlich sollten die Dinger auf der Map spawnen und man steigt ein und dann ist man drin"}, {"id": 381, "start": 2752.56, "end": 2778.56, "text": "Übrigens auch was, was sie gesagt haben, dass das so sein wird in Battlefield 2042, also Vehikel einsteigen, was aber nicht so ist"}, {"id": 382, "start": 2778.56, "end": 2790.56, "text": "Ja, natürlich, du kannst den Kram danach kaufen"}, {"id": 383, "start": 2790.56, "end": 2808.56, "text": "Zwei, zwei Waffen, ui, also es gibt einen Specialist und eine Map, zwei neue Fahrzeuge und zwei Waffen, sehe ich das richtig"}, {"id": 384, "start": 2808.56, "end": 2824.56, "text": "Ich meine, das ist als Season Update an sich, das geht durchaus als Season Update durch, das ist in Ordnung, ja, wenn die Season halt nicht irgendwie ewig geht"}, {"id": 385, "start": 2824.56, "end": 2838.56, "text": "Danach zügig in eine neue Season kommt, neue Content und, und das ist die wichtigste Voraussetzung, wenn das Spiel bis zum jetzigen Zeitpunkt schon ordentlich Content hätte, hat es aber nicht"}, {"id": 386, "start": 2838.56, "end": 2867.56, "text": "Also diese Stelle, ich meine, was ist das für eine Map, wie sieht das aus man, das ist ok, hier siehst du, die hat sich einer mit ein bisschen, zumindest halbwegs Architektur Gedanken gemacht, aber was ist denn das andere wieder für eine"}, {"id": 387, "start": 2867.56, "end": 2877.56, "text": "Weißt du, wie das aussieht, ein bisschen, das sieht ein bisschen aus wie der Eingang auf dieser einen Battlefield 4 Map, ich hab vergessen, wie sie heißt, die eine DLC Map, wo du auch durch so eine Schneebasis reinfährst"}, {"id": 388, "start": 2877.56, "end": 2904.56, "text": "Warte mal, also quasi ein AT4, ein AT4 als, ja, ok, kann man machen, ich meine, die Sache ist halt die, es gibt Lock-On-Launcher, warum sollte ich die selbst schießen?"}, {"id": 389, "start": 2904.56, "end": 2925.56, "text": "Gut, du kannst sie nicht fleren, ja, ok, und auf der anderen Seite, Engineer-Bewaffnung ist eh pepega in dem Spiel, das machst du eh nur, wenn du, wenn du Helis runter geiern willst"}, {"id": 390, "start": 2934.56, "end": 2960.56, "text": "Hey, auf der Map ist schon auch wieder, ihr guckt euch das mal ohne, da habt ihr ja auch keine Ahnung, was das für eine Map ist, ihr habt ja auch keine Ahnung, was das für eine Map ist"}, {"id": 391, "start": 2960.56, "end": 2968.56, "text": "Auf der Map ist schon auch wieder, ihr guckt euch das mal ohne, da ist jetzt auch nicht gerade viel, oder?"}, {"id": 392, "start": 2968.56, "end": 2988.56, "text": "Da ist ganz viel, nichts, ich mein, ok, das hier ist wahrscheinlich noch nicht mal playable area, meint ihr, das hier oben ist playable area und hier was, ihr meint, das ist playable area, wobei, da hinten ist so eine Radar-Station, vielleicht ist das wirklich playable area"}, {"id": 393, "start": 2988.56, "end": 3004.56, "text": "Ich meine, das würde passen zu Battlefield 2042, die Maps sind ja im Prinzip einfach nur Gelände, zumindest hat man ein bisschen Infanterie-Action vielleicht hier innen drinnen, aber ehrlich gesagt, ja, auch wenn es morgen losgeht, ich werde es kürzlich nicht spielen"}, {"id": 394, "start": 3004.56, "end": 3013.56, "text": "Karte unten links sagt nein, das ist richtig, dann ist es keine playable area"}, {"id": 395, "start": 3013.56, "end": 3018.56, "text": "Wobei wir das nicht wissen, in was für einem Spielmodus die das spielen"}, {"id": 396, "start": 3035.56, "end": 3037.56, "text": "Das ist richtig"}, {"id": 397, "start": 3037.56, "end": 3054.56, "text": "Nein, das Spiel hat keine Quality, bis jetzt nicht, das ist halt das Problem"}, {"id": 398, "start": 3054.56, "end": 3068.56, "text": "Ich sag mal, mein Urteil zu der Map lasse ich mal außen vor, ich meine, vielleicht gucke ich es mir noch mal kurz an"}, {"id": 399, "start": 3068.56, "end": 3073.56, "text": "Ach, das ist ein explosiven Crossbow"}, {"id": 400, "start": 3073.56, "end": 3091.56, "text": "Das fühlt sich aber zumindest schon, hier in der Innenbereich, auch mit der reduzierten Spieleranzahl, das wirkt zumindest etwas mehr wie eine Battlefield Map schon"}, {"id": 401, "start": 3091.56, "end": 3103.56, "text": "Wie du rettest hier oben immer noch rum ohne was"}, {"id": 402, "start": 3103.56, "end": 3109.56, "text": "Sundance und McKay sind eh die besten"}, {"id": 403, "start": 3109.56, "end": 3123.56, "text": "Übrigens, die hatten ja bei Sundance auch noch nicht mal Bock, in irgendeiner Art und Weise zu versuchen zu erklären, warum Sundance einen Sturzflug aus 300m auf den Boden ohne Probleme aushält"}, {"id": 404, "start": 3123.56, "end": 3133.56, "text": "Ich meine, Sundance könnte wenigstens irgendwie einen Stoßdämpfer haben oder sowas, keine Ahnung, dass es zumindest so wirkt, als hat man sich was beigedacht"}, {"id": 405, "start": 3133.56, "end": 3141.56, "text": "Ich meine, du fliegst legit mit dem Kopf in den Boden und stehst dann wieder auf, ja? So, guckt euch das an"}, {"id": 406, "start": 3141.56, "end": 3163.56, "text": "Also, die hätten zumindest versuchen können, ich meine ernsthaft, es ist ja nicht so, als wäre sowas nicht möglich, warte mal, Apex Drop Off, ja, wie auch immer man das nennt, Apex, ich brauche einfach nur ein Apex Game, irgendein Apex Game"}, {"id": 407, "start": 3163.56, "end": 3173.56, "text": "Nicht Funny Moments, hier Apex, nein, ich brauche irgendeinen Apex Gameplay, irgendeins, vollkommen egal was, hier das da"}, {"id": 408, "start": 3173.56, "end": 3199.56, "text": "So, guckt mal, wenn die am Anfang aus dem Flieger springen, dann springen die aus dem Flieger, so wie Sundance mit ihrem Ding und wohlgemerkt, wobei Sundance und ihr Ding, so war es nicht gemeint, aber so kann man es schon falsch verstehen"}, {"id": 409, "start": 3199.56, "end": 3215.56, "text": "Dann hüpfen die runter, so wie Sundance mit dem Wingsuit, ja? Und jetzt kommts, und jetzt kommts, stellt euch mal vor, Battlefield hätte etwas Liebe zum Detail gehabt in Battlefield 2042, guckt mal, was jetzt passiert"}, {"id": 410, "start": 3215.56, "end": 3243.56, "text": "Was ist das? Was ist das, die haben eine Lander-Animation, wie, was ist da los, das ist, das kann ja nicht sein man, das ist unmöglich, so sieht eine Lander-Animation aus Leute, guckt, so, so guck"}, {"id": 411, "start": 3243.56, "end": 3258.56, "text": "Mit dem Kopf im Boden, guckt euch an, guckt euch an"}, {"id": 412, "start": 3258.56, "end": 3273.56, "text": "Ui, und weiter gehts, also bei Apex siehst du halt, ich mein okay, der Apex Chef ist jetzt ja auch der neue Battlefield Chef, der hat ja viel vor sich"}, {"id": 413, "start": 3288.56, "end": 3316.56, "text": "Die Sache ist halt die, es ist okay, wenn die Maps, die eingebaut sind, shit wären, wenn wir jetzt einfach acht neue gute Maps hätten, wäre das kein Problem, aber mit einer Map pro drei Monate oder so, was soll das denn geben, wenns fertig ist? Ich glaube es wird doch nochmal Zeit für ein letztes Battlefield 2042 Video"}, {"id": 414, "start": 3318.56, "end": 3333.56, "text": "Portal hat das Spiel nicht gerettet, ja das liegt aber auch daran, dass die Möglichkeiten in Portal immer noch zu beschränkt sind und auch der Content der drinnen ist zu beschränkt ist"}, {"id": 415, "start": 3333.56, "end": 3355.56, "text": "Hätte man die Möglichkeit in Portal wirklich Custom Content zu createn, also eigene, eigene, ich mein du kannst noch nicht mal, fangen wir mal bevor ich das sage, fangen wir mal, guck mal, da crashst sie wieder im Boden, fangen wir mal eine Stufe, du kannst doch nicht mal gescheit sowas wie Prop Hunt implementieren in Portal"}, {"id": 416, "start": 3355.56, "end": 3368.56, "text": "Ja Prop Hunt ist diese Geschichten wie, wo man sich dann in Garrys Mod oder in irgendeinem Call of Duty Mod oder was auch immer, zum Beispiel als Stuhl versteckt irgendwo oder sowas"}, {"id": 417, "start": 3368.56, "end": 3378.56, "text": "Prop Hunt ist meistens so einer der ersten Modi die eingebaut werden um zu testen was die Modding Tools taugen, sowas kannst du in Portal nicht machen"}, {"id": 418, "start": 3378.56, "end": 3397.56, "text": "Und es wäre halt cool, könnte man da ein paar eigene Sachen importieren, eigene Musik importieren, im Zweifelsfall eigene, eigene Sprays importieren, ich erwarte ja noch nicht mal, dass du gleich eigene, eigene 3D Models importieren kannst oder sowas"}, {"id": 419, "start": 3397.56, "end": 3424.56, "text": "Das wäre cool wenn das geht, aber dass man das nicht gleich hat oder dass man neue, simple Gegenstände entwerfen kann, vielleicht eben aus den Gegenständen die schon im Spiel sind, ich meine, du kannst aus den Sachen die es hier vorgefertigt gibt, sicherlich coole neue Sachen zusammen, kannst du alles knicken, du kannst die Maps auch nicht editieren gescheit, du kannst die Maps gar nicht editieren im Endeffekt, also es ist viel zu beschränkt"}, {"id": 420, "start": 3428.56, "end": 3437.56, "text": "Oder ein Server Browser zum Beispiel"}, {"id": 421, "start": 3437.56, "end": 3454.56, "text": "Ich habe es übrigens gesagt, ich muss es an der Stelle sagen, Leute, ich habe das über eineinhalb Jahre, also seit sie diesen Kram angekriegt, ich habe das prediktet mit dem Server Browser"}, {"id": 422, "start": 3454.56, "end": 3479.56, "text": "Ich habe ein Video gemacht damals, so, ich habe ein Video gemacht, Battlefield 6 wird getötet von Skill-Based Matchmaking, gut, wie Skill-Based Matchmaking das in Battlefield ist, kann ich abschließend nicht beurteilen, das ist auf jeden Fall nicht so krass wie in Call of Duty, aber ein Punkt in diesem Video war"}, {"id": 423, "start": 3479.56, "end": 3495.56, "text": "Dafür, dass Skill-Based Matchmaking funktioniert oder die Option besteht überhaupt, das einzuführen, jetzt können sie ja gar kein Skill-Based Matchmaking mehr machen und ich glaube, das ist auch der Grund, warum das nie so krass geworden ist wie in Call of Duty, es spielt ja keiner mehr"}, {"id": 424, "start": 3495.56, "end": 3505.56, "text": "Skill-Based Matchmaking mit 2000 Spielern, das funktioniert nicht, da kannst du schon froh sein, wenn du ein paar Server vollkriegst, aber ich habe es gesagt in dem Video"}, {"id": 425, "start": 3505.56, "end": 3526.56, "text": "Sie können kein Server Browser einbauen, wenn sie was in dieser Richtung versuchen, automatisch zusammengesetzte Lobbies und damals haben alle gesagt, nein, nein Max, Skill-Based Matchmaking, das kann gar nicht sein, weil es gibt doch den Server Browser"}, {"id": 426, "start": 3526.56, "end": 3537.56, "text": "Und darauf gehe ich ja auch im Video und sage, ja, das kann man machen, wenn es keinen Server Browser mehr gibt und es gibt keinen Server Browser, es war mir so klar schon im Vorfeld"}, {"id": 427, "start": 3538.56, "end": 3546.56, "text": "Und weil man das auch nie gesehen hat, ich habe damit gerechnet, dass es das nicht gibt, das gab es und alle haben gesagt, nein, nein, das kann überhaupt nicht sein, ich wusste es einfach"}, {"id": 428, "start": 3546.56, "end": 3557.56, "text": "Damals haben die Leute noch gedacht, so was bescheuert, das kann DICE doch nicht machen, aber doch"}, {"id": 429, "start": 3559.56, "end": 3572.56, "text": "Und wisst ihr was passiert beim nächsten Battlefield, wenn das angekündigt wird, da werden sie sagen, das ist so sicher wie das Abend in der Kirche, sie werden sagen, ja, das war ja Battlefield 2042"}, {"id": 430, "start": 3572.56, "end": 3583.56, "text": "Jetzt haben wir gelernt aus unseren Fehlern, jetzt, wir haben euch gehört Community, jetzt hören wir auf euch, jetzt ist uns ganz klar, was wir falsch gemacht haben"}, {"id": 431, "start": 3583.56, "end": 3589.56, "text": "Die werden immer wieder den gleichen Shit erzählen, oh Leute, mein großer C ist eingeschlafen"}, {"id": 432, "start": 3593.56, "end": 3598.56, "text": "Ich muss gerade mal meinen Fuß kurz schütteln, dass der wieder ordentlich durchblutet wird"}, {"id": 433, "start": 3598.56, "end": 3602.56, "text": "Das fühlt sich ja kacke an"}, {"id": 434, "start": 3602.56, "end": 3620.56, "text": "So, ja, aber das ist so sicher wie das Abend oder der Gaben in der Kirche, ja, dies werden die wieder erzählen, exakt der gleiche Scheiß und die Sache ist die, die haben ja dieses Mal wirklich nicht nur übertrieben, die haben ja gelogen schon"}, {"id": 435, "start": 3620.56, "end": 3633.56, "text": "Ich mein, meint ihr wirklich, also bevor wir zu denen sagen kommen, wo sie gelogen haben, meint ihr wirklich, dass irgendjemand ernsthaft bei DICE, der wirklich Ahnung von dem Stand des Spiels hatte"}, {"id": 436, "start": 3633.56, "end": 3649.56, "text": "Wirklich davon überzeugt war, dass wenn er sagt, das ist ein Love Letter an die Community, was sie da fabrizieren, dass der das wirklich ernst gemacht hat"}, {"id": 437, "start": 3649.56, "end": 3658.56, "text": "Ich gehe davon aus, dass dort ziemlich unrealistisch das Spiel eingeschätzt wurde, ja, es hat ja schon seinen Grund, warum das Spiel so geworden ist"}, {"id": 438, "start": 3658.56, "end": 3679.56, "text": "Ja, das haben die gesagt, Portal, glaube ich, war der Love Letter an die Community"}, {"id": 439, "start": 3679.56, "end": 3698.56, "text": "So, ich glaube schon, dass DICE dieses Spiel sehr unrealistisch eingeschätzt hat, also ich bin echter Meinung, dass das Spiel quasi als viel höherwertiger und besser eingeschätzt haben als es letztendlich ist"}, {"id": 440, "start": 3698.56, "end": 3710.56, "text": "Und dann auch sehr überrascht davon waren, wie negativ das ankommt, aber das spricht ja auch nicht gerade für das Management bei DICE, ist ja klar"}, {"id": 441, "start": 3711.56, "end": 3720.56, "text": "Und die hatten sicherlich die ein oder anderen Leute, die da noch ein bisschen Hirn im Kopf hatten, die gesagt haben, Leute, das kann man so doch nicht spielen, aber da hat man nichts drauf gegeben"}, {"id": 442, "start": 3720.56, "end": 3732.56, "text": "Man hat wahrscheinlich sogar noch eher gesagt, halt die Klappe, sonst verlierst du deinen Job und man hat sich halt die ganze Zeit dann auch mit Leuten umgeben, die alles, was man macht, gut findet"}, {"id": 443, "start": 3733.56, "end": 3740.56, "text": "Und dann ist ja kein Wunder, dass man denkt, man hat hier das neueste, beste Spiel aller Zeiten, wirklich egal, wir gucken das Video jetzt fertig"}, {"id": 444, "start": 3740.56, "end": 3756.56, "text": "Das Spiel könnte man, Rembo, das Spiel könnte man theoretisch retten, aber man sagt das zwar, aber man hat ja offensichtlich, ich mein, es sind acht Monate seit Release rum"}, {"id": 445, "start": 3757.56, "end": 3768.56, "text": "Man hat ja offensichtlich kein Interesse dran, das Spiel zu retten, die haben so viele Blogposts gemacht, von wegen, ja wir stellen jetzt drei Kisten auf die Map, aber ne, ne, das haben wir doch nicht gemacht"}, {"id": 446, "start": 3768.56, "end": 3774.56, "text": "Wir befinden uns in der Planungsphase, wo wir jetzt am besten die drei Kisten hinstellen"}, {"id": 447, "start": 3775.56, "end": 3788.56, "text": "Und die haben so extrem viel heiße Luft produziert, da drum und nichts Substantielles gemacht"}, {"id": 448, "start": 3788.56, "end": 3799.56, "text": "Man hat kein Interesse dran, das Spiel zu retten, man könnte es wahrscheinlich mit den notwendigen, mit den passenden Leuten, aber man hat kein Interesse dran, aber es ist auch verständlich"}, {"id": 449, "start": 3800.56, "end": 3806.56, "text": "Das Spiel ist krasser gefloppt, als sie das sich wahrscheinlich in ihren größten Albträumen ausgedacht haben"}, {"id": 450, "start": 3807.56, "end": 3814.56, "text": "Und es gibt in dem Spiel ja auch nichts mehr zu holen, es gibt ja da auch kein Geld mehr, mit was wollen die Geld verdienen?"}, {"id": 451, "start": 3814.56, "end": 3820.56, "text": "Mit den 2000 Leuten, die übrig geblieben sind und da ab und zu mal irgendwie ne Runde spielen"}, {"id": 452, "start": 3821.56, "end": 3825.56, "text": "Mit was wollen die großartig Geld verdienen? Ist ja nichts mehr da"}, {"id": 453, "start": 3827.56, "end": 3837.56, "text": "Also, die werden das Mindeste, die werden das Mindeste liefern, was sie müssen, wozu sie sich auch für den Season Pass verpflichtet haben"}, {"id": 454, "start": 3837.56, "end": 3844.56, "text": "Und danach ist das Spiel direkt tot und das Spiel ist jetzt schon tot, das Spiel ist quasi ein Zombie"}, {"id": 455, "start": 3845.56, "end": 3851.56, "text": "Das Spiel ist eigentlich tot, aber es wird künstlich so getan, als lebt es noch"}, {"id": 456, "start": 3851.56, "end": 3865.56, "text": "Das ist eigentlich ein Zombie, das ist quasi der größte Zombie-Modus, den man es zu gibt"}, {"id": 457, "start": 3881.56, "end": 3883.56, "text": "Oh, wenn ich dieses Havocraft schon sehe"}, {"id": 458, "start": 3887.56, "end": 3892.56, "text": "Die Hit-Rack scheint auch wieder richtig gut zu funktionieren, oder? Schaut euch das mal an"}, {"id": 459, "start": 3895.56, "end": 3904.56, "text": "Ah ne, okay, der hat zum größten Teil PP geaimt, aber bei der Feuerrate von dem Ding musste da schon ein bisschen was reingehen"}, {"id": 460, "start": 3904.56, "end": 3910.56, "text": "Okay, also dass der nicht tot ist"}, {"id": 461, "start": 3934.56, "end": 3936.56, "text": "Die Waffe könnte mir gefallen"}, {"id": 462, "start": 3940.56, "end": 3947.56, "text": "Ich spiele gerne High-Fire-Rate Waffen, da kann man nämlich schön PP-Gar-Aim aus der Hüfte machen im Nachhinein"}, {"id": 463, "start": 3948.56, "end": 3950.56, "text": "Ich darf das mit 37"}, {"id": 464, "start": 3950.56, "end": 3960.56, "text": "Aber ich habe es schon immer gerne High-Fire-Rate angeschaut"}, {"id": 465, "start": 3961.56, "end": 3967.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 466, "start": 3967.56, "end": 3979.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 467, "start": 3979.56, "end": 3989.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 468, "start": 3990.56, "end": 3999.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 469, "start": 3999.56, "end": 4008.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 470, "start": 4009.56, "end": 4019.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 471, "start": 4019.56, "end": 4029.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 472, "start": 4030.56, "end": 4040.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 473, "start": 4040.56, "end": 4050.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 474, "start": 4051.56, "end": 4061.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 475, "start": 4061.56, "end": 4071.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 476, "start": 4072.56, "end": 4082.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 477, "start": 4082.56, "end": 4092.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 478, "start": 4093.56, "end": 4103.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 479, "start": 4103.56, "end": 4113.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 480, "start": 4114.56, "end": 4124.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 481, "start": 4124.56, "end": 4134.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 482, "start": 4135.56, "end": 4145.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 483, "start": 4145.56, "end": 4155.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 484, "start": 4156.56, "end": 4166.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 485, "start": 4166.56, "end": 4176.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 486, "start": 4177.56, "end": 4187.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 487, "start": 4187.56, "end": 4197.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 488, "start": 4198.56, "end": 4208.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 489, "start": 4208.56, "end": 4218.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 490, "start": 4219.56, "end": 4229.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 491, "start": 4229.56, "end": 4239.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 492, "start": 4240.56, "end": 4250.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 493, "start": 4250.56, "end": 4259.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 494, "start": 4260.56, "end": 4270.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 495, "start": 4270.56, "end": 4280.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 496, "start": 4281.56, "end": 4291.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 497, "start": 4291.56, "end": 4301.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 498, "start": 4302.56, "end": 4312.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 499, "start": 4312.56, "end": 4322.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 500, "start": 4323.56, "end": 4333.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 501, "start": 4333.56, "end": 4343.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 502, "start": 4344.56, "end": 4354.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 503, "start": 4354.56, "end": 4364.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 504, "start": 4365.56, "end": 4375.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 505, "start": 4375.56, "end": 4385.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 506, "start": 4386.56, "end": 4396.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 507, "start": 4396.56, "end": 4406.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 508, "start": 4406.56, "end": 4426.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 509, "start": 4436.56, "end": 4446.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 510, "start": 4447.56, "end": 4457.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 511, "start": 4457.56, "end": 4467.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 512, "start": 4468.56, "end": 4478.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 513, "start": 4478.56, "end": 4488.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 514, "start": 4489.56, "end": 4499.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 515, "start": 4499.56, "end": 4509.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 516, "start": 4510.56, "end": 4520.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 517, "start": 4520.56, "end": 4530.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 518, "start": 4531.56, "end": 4541.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 519, "start": 4541.56, "end": 4551.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 520, "start": 4552.56, "end": 4562.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 521, "start": 4562.56, "end": 4572.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 522, "start": 4573.56, "end": 4583.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 523, "start": 4583.56, "end": 4593.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 524, "start": 4594.56, "end": 4604.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 525, "start": 4604.56, "end": 4614.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 526, "start": 4615.56, "end": 4625.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 527, "start": 4625.56, "end": 4635.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 528, "start": 4636.56, "end": 4646.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 529, "start": 4646.56, "end": 4656.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 530, "start": 4657.56, "end": 4667.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 531, "start": 4667.56, "end": 4677.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 532, "start": 4678.56, "end": 4688.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 533, "start": 4688.56, "end": 4698.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 534, "start": 4699.56, "end": 4709.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 535, "start": 4709.56, "end": 4719.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 536, "start": 4720.56, "end": 4730.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 537, "start": 4730.56, "end": 4740.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 538, "start": 4741.56, "end": 4751.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 539, "start": 4751.56, "end": 4761.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 540, "start": 4762.56, "end": 4772.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 541, "start": 4772.56, "end": 4782.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 542, "start": 4783.56, "end": 4793.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 543, "start": 4793.56, "end": 4803.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 544, "start": 4804.56, "end": 4814.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 545, "start": 4814.56, "end": 4824.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 546, "start": 4825.56, "end": 4835.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 547, "start": 4835.56, "end": 4845.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 548, "start": 4846.56, "end": 4856.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 549, "start": 4856.56, "end": 4866.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 550, "start": 4867.56, "end": 4877.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 551, "start": 4877.56, "end": 4887.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 552, "start": 4888.56, "end": 4898.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 553, "start": 4898.56, "end": 4908.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 554, "start": 4909.56, "end": 4919.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 555, "start": 4919.56, "end": 4929.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 556, "start": 4930.56, "end": 4940.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 557, "start": 4940.56, "end": 4950.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 558, "start": 4951.56, "end": 4961.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 559, "start": 4961.56, "end": 4971.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 560, "start": 4972.56, "end": 4982.56, "text": "Und ein bisschen AIM muss man damit auch, weil meistens haben High-Fire-Rate Waffen halt nicht große Magazine"}, {"id": 561, "start": 4982.56, "end": 4999.56, "text": "Intel und gerade AMD, die müssen ja auch gucken, dass die CPUs herstellen, die von der Größe her und von dem Aufwand her sich irgendwie verkaufen"}, {"id": 562, "start": 5000.56, "end": 5006.56, "text": "Die haben ja auch, wenn du dir die Epic-CPUs für Server anguckst, die sind ja auch irgendwie gefühlt 5 Meter groß"}, {"id": 563, "start": 5006.56, "end": 5013.56, "text": "Apple hat halt den Luxus, Apple baut diese Dinger in High-End-Hardware, die Schweine teuer ist"}, {"id": 564, "start": 5014.56, "end": 5019.56, "text": "In Hardware, die sie komplett selbst designen, also da sind die Voraussetzungen auch ein bisschen anders"}, {"id": 565, "start": 5020.56, "end": 5029.56, "text": "Wenn du quasi die Sachen einbaust in Hardware, die eh schon 4000 Euro plus kostet und die du komplett selbst designst, dann hast du ganz andere Möglichkeiten"}, {"id": 566, "start": 5029.56, "end": 5040.56, "text": "Als wenn du Apple bist und eine CPU-Generation designst, die quasi vom Low-End bis zum High-End laufen muss"}, {"id": 567, "start": 5041.56, "end": 5053.56, "text": "Und AMD macht es ja mittlerweile relativ clever, AMD nimmt einfach 4 CPUs und klebt sie, vereinfacht gesagt, und klebt sie zusammen und sagt, ja das ist jetzt ein Epic für den Server"}, {"id": 568, "start": 5054.56, "end": 5057.56, "text": "Das ist dann auch fetter, teurer, hat aber auch mehr Wumms"}, {"id": 569, "start": 5057.56, "end": 5070.56, "text": "Und die M1-CPU muss ja wohl schon auch ein halbes Fußballfeld gewesen sein"}, {"id": 570, "start": 5070.56, "end": 5086.56, "text": "Das ist eine gute Frage, das ist eine gute Frage"}, {"id": 571, "start": 5087.56, "end": 5093.56, "text": "Nein, gibt es nichts, ich spiele keine Mobile Games und ich mache um alle Mobile Games einen großen Bogen rum"}, {"id": 572, "start": 5093.56, "end": 5104.56, "text": "Und das was ich aktuell höre von Diablo Immortal macht meine Meinung über Mobile Gaming nicht unbedingt besser"}, {"id": 573, "start": 5123.56, "end": 5146.56, "text": "Okay, ich werde vermutet, NVNK macht das auch, macht NVNK 8K schon?"}, {"id": 574, "start": 5146.56, "end": 5158.56, "text": "Decoding, na Encoding juckt mich nicht, aber wenn sie Decoding haben, dann auch auf jeden Fall"}, {"id": 575, "start": 5159.56, "end": 5171.56, "text": "Aber sowas zu haben ist natürlich nice, weil da kannst du einfach Videos, da kannst du 8K Videos abspielen mit 5% CPU-Lust versus 80% CPU-Lust"}, {"id": 576, "start": 5171.56, "end": 5176.56, "text": "Prime, Erbofaller hat zugeschnappt, nice, Dankeschön"}, {"id": 577, "start": 5177.56, "end": 5197.56, "text": "Ja gut, da muss man mal warten was da rauskommt"}, {"id": 578, "start": 5197.56, "end": 5203.56, "text": "Ich meine Apple Event mit Apple Hardware mit Apple Benchmarks, mal gucken, das machen sie ja alle so"}, {"id": 579, "start": 5204.56, "end": 5210.56, "text": "Ich kann mich noch an die Intel Benchmarks früher erinnern, wo sie explizit Sachen rausgelassen haben"}, {"id": 580, "start": 5211.56, "end": 5219.56, "text": "Wo sie wussten, wo sie schlecht drin sind und noch schlimmer, wo sie Benchmarks hatten, die explizit darauf optimiert waren Rechnungen erst gar nicht auszuführen"}, {"id": 581, "start": 5219.56, "end": 5232.56, "text": "Also es gab ja wirklich Benchmarks, die haben übertrieben gesagt Hardcoded Ergebnisse drin gehabt, nur für den Show-Effekt"}, {"id": 582, "start": 5233.56, "end": 5238.56, "text": "Ob das legal ist sei mal dahingestellt, aber das hat man ja gemacht"}, {"id": 583, "start": 5238.56, "end": 5248.56, "text": "Man hat ja Benchmarks, die quasi gar nichts gebenchmarkt haben, sondern quasi nur so getan haben, um dazu zu sagen, haha, leading performance"}, {"id": 584, "start": 5268.56, "end": 5280.56, "text": "Ja gut, die APU-Dinger sind ja auch shit"}, {"id": 585, "start": 5281.56, "end": 5295.56, "text": "Die APUs sind ja zum größten Teil dafür gedacht, also die meisten APUs sind ja gedacht für irgendwelche Hybrid-Home-Rechner im mittleren bis unteren Preissegment"}, {"id": 586, "start": 5295.56, "end": 5301.56, "text": "Es ist schwer ein Zukunft zu sehen, in dem die Industrie nicht so gut wie Apple folgt"}, {"id": 587, "start": 5302.56, "end": 5319.56, "text": "Und was noch mehr, wenn wir sagen, dass M2 die gleiche Pattern wie M1 folgt, dann sollte M2 Pro 48GB Systemmemory, M2 Max 96GB und M2 Ultra eine große 192GB Systemmemory für beide CPU und GPU-Cores"}, {"id": 588, "start": 5319.56, "end": 5329.56, "text": "Die PC haben aber noch den hohen Werkstätten- und Servermarkt, diese theoretischen M2s sind noch nicht ganz Mac-Pro-Territory"}, {"id": 589, "start": 5330.56, "end": 5333.56, "text": "Und Apple ist immer noch wütend, wann die neue Mac Pro kommt"}, {"id": 590, "start": 5334.56, "end": 5336.56, "text": "Sie waren nicht schlau, um neue M2-Hardware zu vorstellen"}, {"id": 591, "start": 5336.56, "end": 5353.56, "text": "Interessant ist, dass keine Listungen, die zu früh auf B&H wurden, die Karte gemacht haben. Zuerst ein redesigniertes MacBook Air, das sich nach dem 14-Inch MacBook Pro befindet, mit der Wende, aber mit einem dünneren Profil, als die dünnsten Teile des alten Airs, und mit einer leichten Haare."}, {"id": 592, "start": 5353.56, "end": 5365.56, "text": "Bei 1199 Euro ist es etwas mehr teurer, als wir möchten, aber der M1 Air ist noch für 999 Euro verfügbar."}, {"id": 593, "start": 5383.56, "end": 5388.56, "text": "Amd CPU, also mit normalen Sachen, nicht mit Apple-Sachen"}, {"id": 594, "start": 5389.56, "end": 5400.56, "text": "Also nicht irgendwie den Final Cut Benchmark oder sowas"}, {"id": 595, "start": 5401.56, "end": 5407.56, "text": "Das muss ich tatsächlich mal gucken, wie das sich im normalen Preissegment dazu verhält"}, {"id": 596, "start": 5407.56, "end": 5418.56, "text": "Apple hat immer noch den Vorteil, dass sie die Hardware von Grund auf designen und überhaupt nicht darauf ausgelegt sind, dass es irgendwie modular wäre"}, {"id": 597, "start": 5418.56, "end": 5437.56, "text": "Aber es muss ja auch nicht wirklich ein Cross-Archiv, naja doch, muss es sein. Es muss ein Benchmark sein, die keine Ahnung, Scenebench oder irgendwas, Prime95 meinetwegen machen"}, {"id": 598, "start": 5437.56, "end": 5447.56, "text": "Und dann müsste man das mal vergleichen mit einem aktuellen Intel, und das wird mich mal interessieren"}, {"id": 599, "start": 5447.56, "end": 5470.56, "text": "Ja, das habe ich auch, das habe ich letztens schon gesehen bei irgendeinem Apple Event, ihr neues Audio-Ding"}, {"id": 600, "start": 5470.56, "end": 5482.56, "text": "Und da habe ich mir damals auch schon gedacht, hm, auf der einen Seite wird ja viel Kleinkram als super krasses Zeug angepriesen"}, {"id": 601, "start": 5483.56, "end": 5490.56, "text": "Aber Apple hat in der Vergangenheit schon gezeigt, dass sie solche Dinge wirklich gut können, wo man sich dann denkt, ah, Blödsinn braucht man nicht"}, {"id": 602, "start": 5490.56, "end": 5499.56, "text": "Und wenn man es dann hat, man sich denkt, eigentlich ist es doch ganz cool und ich frage mich, warum das bei anderen Sachen nicht eingebaut ist"}, {"id": 603, "start": 5500.56, "end": 5502.56, "text": "Also da kann ich mir durchaus vorstellen, dass das was taugt"}, {"id": 604, "start": 5503.56, "end": 5508.56, "text": "Jetzt nicht, dass ich das unbedingt bräuchte am Laptop mit den Lautsprechern, ich hätte wahrscheinlich jeden Kopfhörer auf, aber ja"}, {"id": 605, "start": 5508.56, "end": 5520.56, "text": "Ja, aber ich kann das nicht machen, weil ich habe keine M1 Laptop, da müssen wir mal gucken, wo es Benchmarks, also vertrauenswürdige Benchmarks gibt, nicht vom Apple Event"}, {"id": 606, "start": 5520.56, "end": 5537.56, "text": "Okay, das Video kommt aus der Sendung an, kurz"}, {"id": 607, "start": 5537.56, "end": 5552.56, "text": "Moment, was, das Ladekabel, oder habe ich das jetzt richtig verstanden?"}, {"id": 608, "start": 5552.56, "end": 5568.56, "text": "Okay, es ist wenigstens ein Ladekabel im 1200 Euro teuren Laptop drin, das ist ja schon mal was, das ist ja bei iPhones aktuell auch nicht so"}, {"id": 609, "start": 5568.56, "end": 5581.56, "text": "Aber für ordentlich schnell, zu laden muss man 20 Euro ausgeben, ja weil es geht wahrscheinlich"}, {"id": 610, "start": 5598.56, "end": 5624.56, "text": "Okay, also das hat mich jetzt ehrlich gesagt auch nicht so wirklich geschockt, ich habe das mal bei meinem Kollege auf der Arbeit gesehen, diese neue Tastatur, also ja"}, {"id": 611, "start": 5624.56, "end": 5648.56, "text": "Also es wäre jetzt kein Grund warum ich es mir kaufen würde"}, {"id": 612, "start": 5648.56, "end": 5657.56, "text": "Ach Moment, vielleicht meine ich auch das Ding, was ich beim Kollege gesehen habe, der hatte irgendwas farbiges, irgendeine komische Leiste an seiner Tastatur oben"}, {"id": 613, "start": 5657.56, "end": 5684.56, "text": "Das kann Apple unglaublich gut, diese Upselling Taktik, das können die wirklich gut, am Anfang sagst du, ich habe Budget 400 Euro für ein Smartphone, am Ende kaufst du ein 900 Euro Ding"}, {"id": 614, "start": 5687.56, "end": 5697.56, "text": "Wir haben die Link in der Beschreibung in der Beschreibung in der Beschreibung"}, {"id": 615, "start": 5697.56, "end": 5717.56, "text": "Ventura ist das auch irgendein Berg oder irgendein See oder irgendwas in der Nähe von ihrem Hauptquartier oder ist das diesmal was anderes?"}, {"id": 616, "start": 5727.56, "end": 5737.56, "text": "Also ehrlich, schickes GUI Zeug können die schon machen"}, {"id": 617, "start": 5738.56, "end": 5747.56, "text": "Da könnte sich Microsoft mit Windows 11 tatsächlich was abschneiden, ich meine ich schwöre immer noch auf mein Linux mit Tiling Window Manager"}, {"id": 618, "start": 5747.56, "end": 5765.56, "text": "Das ist ja das komplette Gegenteil von sowas hier, sowas ist hier flashy, blink blink, shiny as fuck und mein Terminal, also mein Tiling Window Manager mit einem Terminal und drei Fenster oder drei Fullscreen Dingern offen kann damit definitiv optisch nicht mithalten"}, {"id": 619, "start": 5765.56, "end": 5782.56, "text": "Ich finde es vom Workflow angenehm, aber von diesen Sachen könnte sich Microsoft tatsächlich was abschneiden und ich habe den Eindruck, sie haben es versucht mit Windows 11, ja gerade weil die auch die Optik immer so hervorgehoben haben sowas, aber sie können das nicht so gut"}, {"id": 620, "start": 5795.56, "end": 5805.56, "text": "Das ist cool, das finde ich gut"}, {"id": 621, "start": 5805.56, "end": 5831.56, "text": "Ja das ist gut, das ist gut, das ist cool, das finde ich gut"}, {"id": 622, "start": 5831.56, "end": 5848.56, "text": "Gibt es das nur mit neuen iPads für das Feature oder geht es auch mit alten? Ich könnte mir vorstellen es geht auch mit alten, zumindest dieses Windows-Dings, weil Apple ist ja was neue Betriebssystemversionen angeht immer recht großzügig wie lange alte Geräte supportet werden"}, {"id": 623, "start": 5849.56, "end": 5857.56, "text": "Finde ich gut"}, {"id": 624, "start": 5857.56, "end": 5880.56, "text": "Das können sie halt auch"}, {"id": 625, "start": 5881.56, "end": 5884.56, "text": "Das hier"}, {"id": 626, "start": 5884.56, "end": 5898.56, "text": "Mit einer API, mit einer, mit einer API, nicht acht verschiedenen Sachen wie unter Windows und dementsprechend wissen die Entwickler auch wie eine iOS App bzw. eine Mac OS App gefälligt auszusehen hat"}, {"id": 627, "start": 5899.56, "end": 5906.56, "text": "Erinnert sich noch irgendjemand an Ribbon Bars in Windows als die eingeführt wurden? Also was ich meine ist das da"}, {"id": 628, "start": 5906.56, "end": 5923.56, "text": "Ribbon Bars, weiß noch jemand wo die eingeführt wurden? Die Dinger wurden eingeführt und es gab keine, das muss man sich mal vorstellen, es gab keine Library von Microsoft für ihre verbreiteten GUI-Dinger"}, {"id": 629, "start": 5924.56, "end": 5932.56, "text": "Also die haben was eingeführt und als der neue Shit verkauft so sollen Windows-Programme aussehen, aber es gab keine Möglichkeit Windows-Programme in dieser Art zu machen"}, {"id": 630, "start": 5932.56, "end": 5942.56, "text": "Das einzige was ging ist, du konntest das irgendwie über ihre halboffizielle C++-Geschichte machen, die keiner machen möchte"}, {"id": 631, "start": 5943.56, "end": 5948.56, "text": "Oder du konntest das mit einem nie veröffentlichten WPF-Ding machen, also für'n Arsch"}, {"id": 632, "start": 5949.56, "end": 5956.56, "text": "Letztendlich hat's keiner gemacht, weil Ribbon Bars auch scheiße sind, das hat keiner vermisst, aber das kann nicht sein, du kannst nicht als Hersteller sowas einführen"}, {"id": 633, "start": 5956.56, "end": 5963.56, "text": "Zu sagen, so haben gefälligst unsere Anwendungen auszusehen und dann es nicht selbst supporten, dass man das machen kann"}, {"id": 634, "start": 5963.56, "end": 5989.56, "text": "Das kann Apple besser, eindeutig"}, {"id": 635, "start": 5993.56, "end": 6009.56, "text": "Das sieht fast da unten bisschen aus wie auf den Surface Hubs"}, {"id": 636, "start": 6023.56, "end": 6051.56, "text": "Das finde ich halt auch cool, ich hab so'n Display-Kalibrierungstool, das ist immer richtig Paint-Champ, das ist so'n Teil, das hängst du vor den Bildschirm und das misst das dann, da kriegst du so'n Farbprofil raus"}, {"id": 637, "start": 6051.56, "end": 6076.56, "text": "Das ist halt cool, dass die Apple-Dinger schon brauchbar ankommen"}, {"id": 638, "start": 6076.56, "end": 6090.56, "text": "Also ich mein, für dass das jetzt Metal 3 ist, so wirklich der massive Erfolg war jetzt ja Metal 1 und 2 nicht, oder? Also nicht, dass ich's mitbekommen hätte"}, {"id": 639, "start": 6106.56, "end": 6121.56, "text": "Die erste Titel, die mit Metal 3 angeboten wurde, ist Resident Evil Village, die später dieses Jahr ausgebildet wird"}, {"id": 640, "start": 6121.56, "end": 6135.56, "text": "Es ist schwer, einen Anruf zu machen, wie effektiv es über Stream ist, aber Upscaling macht viel Sinn auf kleinen Displays, wie die auf dem iPad und insbesondere auf dem iPhone"}, {"id": 641, "start": 6135.56, "end": 6163.56, "text": "Das ist jetzt die Geschichte, wo du dein iPad und dein iPhone wohl irgendwie als Alternifizierungsgerät verwenden kannst, anstelle von Passwörtern"}, {"id": 642, "start": 6163.56, "end": 6177.56, "text": "Also ich würde nie so weit gehen und meine iPhone-Kamera als einziges Authentifizierungsgerät verwenden, aber es hat einen Vorteil gegen den anderen gängigen Authentifizierungsvarianten, es ist halt ziemlich schnell"}, {"id": 643, "start": 6178.56, "end": 6188.56, "text": "Und das finde ich gut, ich mein, Face ID ist halt eine coole Sache, ich könnte mir Face ID auch wunderbar als zweiten oder dritten Faktor sogar vorstellen"}, {"id": 644, "start": 6188.56, "end": 6196.56, "text": "Weil's einfach schnell geht, du guckst in dein iPad oder besser gesagt, du guckst in dein iPhone und gut ist"}, {"id": 645, "start": 6204.56, "end": 6214.56, "text": "Und es wäre halt cool, wenn man zum Beispiel sein iPad als Zwei-Faktor-Authentifizierung verwenden könnte, jetzt halt auch, keine Ahnung, beim YouTube-Login oder so"}, {"id": 646, "start": 6214.56, "end": 6223.56, "text": "Das wäre schon cool, besser als SMS schicken oder irgendwelche Authenticator-Apps oder Gedulds"}, {"id": 647, "start": 6244.56, "end": 6258.56, "text": "Okay, da hätte ich schon mal keinen Bock drauf, dass irgendwelche Credentials und Secrets über Apple Sync in die Cloud gesynced werden, das will ich schon mal nicht haben"}, {"id": 648, "start": 6275.56, "end": 6289.56, "text": "Nett, warum nicht? Ehrlich gesagt, ich verwende mein Log-Screen genau für eine Sache, nämlich um zu gucken und es zu entlocken, aber ja, warum nicht?"}, {"id": 649, "start": 6289.56, "end": 6317.56, "text": "Ja, warum nicht? Spät, oh nein! Das sind halt so Sachen, die sind ganz cool, das ist jetzt aber nix super krass neues, also, sagen wir so, Freistell-Software gibt es ja schon jede Menge und das dann so ins Betriebssystem zu integrieren ist cool"}, {"id": 650, "start": 6317.56, "end": 6332.56, "text": "Das finde ich halt immer, gerade bei Events, sei es Microsoft, sei es Apple, sei es irgendwie Ubisoft EA, so kleine Dinger werden da halt aber auch immer mit den Superlativen der Superlativen angekündigt"}, {"id": 651, "start": 6333.56, "end": 6338.56, "text": "Wo ich immer denke, jetzt macht's halt doch mal ein bisschen unter Groundbreaking"}, {"id": 652, "start": 6338.56, "end": 6354.56, "text": "Also, unter Groundbreaking geht da eigentlich nix mehr, ja, und das ist so easy, so amazing, so hyped, so, so, sonst was, da haben wir uns ja schon dran gewöhnt"}, {"id": 653, "start": 6355.56, "end": 6364.56, "text": "Aber es darf doch auch noch coole normale Sachen geben, ohne dass es gleich immer noch nie da gewesen ist, Groundbreaking, weltverändernder Shit ist"}, {"id": 654, "start": 6364.56, "end": 6368.56, "text": "Oh, das ist ein normales cooles Feature, ja"}, {"id": 655, "start": 6368.56, "end": 6384.56, "text": "Diese Überleitung, die haben's drauf"}, {"id": 656, "start": 6384.56, "end": 6406.56, "text": "Erinnerst du dich noch an Force Touch? War Force Touch nicht das, wo der Homebutton abgeschafft wurde und so getan wird, als ist es ein Homebutton, obwohl es gar kein Homebutton mehr war? Weiß ich, hatte ich nie so ein Gerät"}, {"id": 657, "start": 6414.56, "end": 6435.56, "text": "Übrigens, ich verwende mein iPhone die ganze Zeit schon, wenn ich Technik-Gramme hier streame und euch das zeige von meinem iPhone"}, {"id": 658, "start": 6435.56, "end": 6443.56, "text": "Was sagst du, ich habe ein iPhone, was ist denn das, 11 glaube ich? Ich glaube ein iPhone 11 ist das"}, {"id": 659, "start": 6465.56, "end": 6486.56, "text": "Was? Was? Aber die Idee ist cool, es braucht wahrscheinlich ein bisschen Anpassung und Display-Kippgrad und so, dass das gut funktioniert, aber die Idee ist gut"}, {"id": 660, "start": 6486.56, "end": 6496.56, "text": "Ja, dumm nur, dass kaum einer Facetime verwendet"}, {"id": 661, "start": 6517.56, "end": 6528.56, "text": "Okay, jetzt muss ich, ups, also manch einem geht da bestimmt jetzt richtig eine Abbei, aber da muss ich mich mal als Boomer outen"}, {"id": 662, "start": 6529.56, "end": 6542.56, "text": "Ich bin skeptisch bei, mein Auto ist jetzt ein Computer versus es ist ein Auto"}, {"id": 663, "start": 6542.56, "end": 6552.56, "text": "Also vielleicht brauche ich erstmal so ein Ding, dass ich sage, es ist doch geil, das kann schon sein"}, {"id": 664, "start": 6553.56, "end": 6562.56, "text": "Ich hatte bisher nie ein Auto, was in diesen Ausmaßen da technologisiert war"}, {"id": 665, "start": 6562.56, "end": 6576.56, "text": "Also alles was ich da bisher von mitgekriegt habe schreckt mich eher ab, aber vielleicht ist es ja geil, keine Ahnung"}, {"id": 666, "start": 6577.56, "end": 6587.56, "text": "Aber ich finde die grundsätzliche Idee mit, ich fahre quasi ein Computer mit Rädern versus ich fahre ein Auto mit ein bisschen Technik drinne"}, {"id": 667, "start": 6587.56, "end": 6592.56, "text": "ist auch nicht unbedingt so beruhigend"}, {"id": 668, "start": 6593.56, "end": 6601.56, "text": "Und so Sachen, die man dann hört, du fährst nebenan und es startet ein Update und kannst dann erstmal nicht weiterfahren und solche Dinge"}, {"id": 669, "start": 6602.56, "end": 6608.56, "text": "Wie oft es passiert, keine Ahnung, aber es passiert ja wohl anscheinend, das beruhigt mich auch nicht weiter"}, {"id": 670, "start": 6608.56, "end": 6622.56, "text": "Und auch von vielen der Assistenzsysteme, die sich die letzten Jahre so etabliert haben"}, {"id": 671, "start": 6623.56, "end": 6629.56, "text": "Mein Opel Agila hat sowas alles nicht, da muss ich mir keine Gedanken drüber machen"}, {"id": 672, "start": 6630.56, "end": 6634.56, "text": "Aber auch von den Assistenzsystemen, wo ich die letzten Jahre so gehört habe, das ist teilweise auch fragwürdig"}, {"id": 673, "start": 6634.56, "end": 6642.56, "text": "Ich habe letztens erst gelesen, dass z.B. jemand gesagt hat, in irgendeinem Ford war, hat er gesagt, der hat jetzt so einen Spurhalteassistent drinne"}, {"id": 674, "start": 6643.56, "end": 6649.56, "text": "Der hat sich standardmäßig auch immer aktiviert, wenn er das Auto startet und sich auch gar nicht mehr richtig deaktivieren lässt"}, {"id": 675, "start": 6650.56, "end": 6661.56, "text": "Und er hätte ihm wohl das letzte Mal, obwohl es gar keine Spur war, sondern nur irgendeinen Streifen, der nichts mit Fahrbahnmarkierungen zu tun hat"}, {"id": 676, "start": 6661.56, "end": 6665.56, "text": "hätte der wohl richtig krass gegengelenkt und er wäre fast gegen LKW gefahren"}, {"id": 677, "start": 6666.56, "end": 6671.56, "text": "Wie viel an solchen Stories dran ist, keine Ahnung, aber sonderlich beruhigen tut es mich nicht"}, {"id": 678, "start": 6671.56, "end": 6686.56, "text": "Ja oder was ich auch letztens gelesen habe, am Eingang vom Tor hängt wohl, also irgendeiner wollte auf den Hof fahren von seiner Arbeit"}, {"id": 679, "start": 6686.56, "end": 6701.56, "text": "Und am Eingang vom Hoftor, da ist wohl irgendwie so ein Häuschen, wahrscheinlich für den Werther oder so, keine Ahnung"}, {"id": 680, "start": 6702.56, "end": 6711.56, "text": "Und da hängen zwei Warnwesten dran, dass wenn man das zu später Stunde betritt, dass man sich eine Warnweste anzieht"}, {"id": 681, "start": 6711.56, "end": 6722.56, "text": "Und da muss es wohl schon öfters so gewesen sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, da läuft ein Fußgänger wegen der Warnweste"}, {"id": 682, "start": 6723.56, "end": 6736.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, da läuft ein Fußgänger wegen der Warnweste"}, {"id": 683, "start": 6736.56, "end": 6740.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, ja"}, {"id": 684, "start": 6740.56, "end": 6752.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht, weil es der Meinung ist, das Auto voll in die Eisen geht"}, {"id": 685, "start": 6770.56, "end": 6778.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 686, "start": 6800.56, "end": 6805.56, "text": "Und dann kannst du endlich Code-Snippets oder Rezepte bekommen, ohne dass du einen Screenshot machst"}, {"id": 687, "start": 6831.56, "end": 6835.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 688, "start": 6835.56, "end": 6860.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 689, "start": 6865.56, "end": 6877.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 690, "start": 6882.56, "end": 6890.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 691, "start": 6890.56, "end": 6905.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 692, "start": 6905.56, "end": 6920.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 693, "start": 6935.56, "end": 6947.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 694, "start": 6965.56, "end": 6977.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 695, "start": 6995.56, "end": 7010.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, dass das Auto voll in die Eisen geht"}, {"id": 696, "start": 7025.56, "end": 7037.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 697, "start": 7055.56, "end": 7067.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 698, "start": 7085.56, "end": 7100.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 699, "start": 7115.56, "end": 7128.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 700, "start": 7145.56, "end": 7155.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 701, "start": 7175.56, "end": 7187.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 702, "start": 7205.56, "end": 7217.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 703, "start": 7235.56, "end": 7247.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}, {"id": 704, "start": 7265.56, "end": 7277.56, "text": "Und das ist immer so ein Ding, wo ich mir denke, muss es sein, dass das Auto voll in die Eisen geht"}]}