{"text": "So Leute da bin ich, ist noch früh aber ich bin schon ungefähr 1 Stunde auf aber ich bin nicht wach. Oder sag mal wach ist was anderes. Sagt mal hat irgendjemand diesen Overwatch 2 Reveal Stream gesehen der vor ein paar Tagen war? Das war aber nicht Stream, jedoch ja war mal ein Stream ich hab das als Wort geguckt. Das war wieder sehr viel gequatsche um nichts. Wirkte fast so als kämpft die Marketing Abteilung mit dem Entwicklungsteam was denn jetzt eigentlich da gemacht werden soll. Wann ist eigentlich Release Date? Also aktuell schockt es mich ok Oktober. Aktuell schockt es mich so überhaupt nicht. Ich weiß nicht es ist ja auch das hat sich auch nichts von dem verändert was mich genervt hat und ich glaube nicht dass Blizzard an den eigentlichen Problem die das Game hat. Vor allem der Support wie es jahrelang jetzt gelaufen ist dass sich da großartig was dran ändert nicht so viele Hoffnungen drin. Moin Leute also ich weiß nicht wie lange ich jetzt on bin ich bin übelst im Arsch noch kann euch gar nicht so genau sagen warum. Aber irgendwie bin ich im Arsch. Ich muss ich muss am Dienstag wisst ihr was ich was ich da tolles machen muss auf der Arbeit. Real Razor Chief danke für den Sub. Wisst ihr was ich da tolles machen muss ich muss mit einem Techniker aus den USA auf irgendeiner Cloud Linux VM mit dem zusammen was installieren. Bin ich mal gespannt was da rauskommt. Irgendwas was ich noch nie im Leben installiert habe der soll mir irgendwie sagen was ich machen muss. Das habe ich mir auch gedacht ich habe mir auch schon gedacht warum geben wir dem nicht einfach remote Zugkräfte kann er selbst machen. Aber man weiß ja nie. Tja gab es sonst was spannend das die letzten Tage über. Ich habe eine ich habe eine China-Chinesen Sponsoring Anfrage bekommen. Muss ich euch mal vorlesen. Da keckt ihr euch weg. Die fängt schon an mit die fängt schon an mit irgendeiner. Keine Ahnung. China-Chinesen Zeichen E-Mail und es fängt an. Hello my old friend. Hello my old friend. My dear. Das ist China-Chinesen Text übersetzt ins Englische. So fangen natürlich alle Sponsoring Anfragen immer an. Die Chinesen. Und was wollen sie mir. Was wollen sie mir aufschwätzen. Sie wollen mir ein ultra holdable und comfortable 48 Megapixel Main Kamera. Was wollen die mir überhaupt aufschwätzen. Ein Smartphone. Ob die wollen wir ein Smartphone aufschwätzen. Keine Ahnung. Ja oh man. Free Crap braucht auch keiner. Möll kriegt man eben auch sonst. Aber was gescheites. Die wollen dann ja auch was dafür haben und das sehe ich nicht ein. Ich bewerbe so ein Crap nicht. Ich mache eh relativ wenig Sellouts. Ich mache eigentlich nie großartig Sellouts. Ich habe die letzten Jahre über was habe ich gemacht. Hetzner habe ich gemacht. Das würde ich auch weiter machen. Weil ich den Crap eben benutze. Und das auch ohne Sponsoring teilweise schon hier im Stream gezeigt habe. Ja dann habe ich dieses Battlefield Sponsoring gemacht. Wo man gemerkt hat dass ich keinen Bock mehr auf die Sponsorings hatte nach zwei Videos. Aber ich habe mir den halt drei Videos ausgemacht. Ja gut was willst du machen. Ansonsten. Ich habe irgendeinen Sniper Elite Sponsoring habe ich mal gemacht die letzten Jahre über. Die sind bei mir auch laufend am Start. Und VPN Anbieter sind auch laufend am Start. Und wisst ihr was lustig ist. Ich habe das ja schon erzählt. Die waren doch neulich sogar im Chat. Echt jetzt. Im Stream. Wirklich habe ich keine mitbekommen. Oder vor oder nach dem Stream. Naja. Was gibt es eigentlich einen einfachen Weg. Wo ist die Frage. Gibt es eigentlich auch einen einfachen Weg. Ein C++. Ja klar. Es ist jetzt egal ob es GCC ist oder LLVM Clang. Wie auch immer man das ausspricht. Genau. Ja. Kannst du alles installieren. Aber was ich gerne mache ist ich verwende für diesen Krempel ein Pack. Ja super. Massive. Massive Größe. Ich verwende ein Package Manager für Windows. Ja da ist alles mögliche drinne. Search. GCC. Ich muss mal updaten wieder. Ich meine es ist Windows deswegen ist es nicht schnell. Aber ansonsten gibt es bestimmt komplett fertige C++ Entwicklungs Bundles für Windows. Achso. Wenn du den Microsoft Krempel verwenden willst dann kannst du auch einfach. Das stimmt da habe ich gar nicht dran gedacht. Ja klar. Du kannst doch den Visual Studio Kram installieren mit dem ganzen Microsoft Krempel. Das geht auch. Wahrscheinlich unter Windows sogar die beste Variante. RealRenax. Doch hatte ich. Aber das ist nichts geworden. Die haben sich das anders überlegt. Also ne. Die haben sich nicht anders überlegt. Die haben gesagt der Termin ändert sich. Und dann habe ich gesagt ne zu dem neuen Termin passt das bei mir nicht. Und seitdem habe ich nie wieder was gehört. Ne ne ne. Also Visual Studio ist die Community Community Edition ist free. Welchen Package Manager ich verwende. Scoop. Den da. Es gibt dann auch noch. Es gibt dann auch noch den da. Weiß gar nicht ob ich das installiert habe. Ne. Also der Scoop installiert rein lokal ins Heimatverzeichnis. Der andere System weit. Ich finde das ist mit den Heimat ins Heimatverzeichnis besser. Ja du kannst ohne. Absoluter Crap. Also ich meine mittlerweile mittlerweile ist es benutzbar. Mittlerweile ist es benutzbar. Weil mal gucken was auf GitHub da abgeht. Mittlerweile ist es benutzbar weil sie den Kram wenigstens so eingerichtet haben dass du mittlerweile Software deinstallieren kannst. Aber ganz ehrlich das. Also ich bin nicht sonderlich begeistert von von WinGit. Ich müsste mir es aber mal wieder angucken. Ich muss also das letzte Mal wo ich es mir angeguckt habe ging das deinstallieren von Software noch nicht mal. Mittlerweile geht das aber. Was ich ganz gut mag ist dass es ähnlich ist zu Pacman oder UpGit oder sonst was. Ich müsste ich müsste mir den Kram mal wieder angucken ob das mittlerweile taugt. Ich bin mir halt nicht sicher ob es dort überhaupt genug Packages gibt also sprich welche Sources verwendet das Ding. Müsste man mal ausprobieren. Ah ok. Als letztes Mal hat mich WinGit komplett kalt gelassen. Du könnt mal vielleicht jetzt mal im Stream angucken aber dafür ein extra Stream machen ist glaube ich unsinnig. Das dauert eine halbe Stunde sich das anzugucken mit allem drum und dran und dann ist gut. War gerade eine Chat guckt ihr mal zufällig die Orville Season 3. Ich fand ja Season 1 wirklich richtig gut also Massive Pork. Season 2 fand ich zum größten Teil auch ziemlich gut aber die ersten drei Folgen von Season 3 finde ich auch wieder richtig gut. Also besseres Star Trek als Star Trek. Also gefällt mir echt gut. Und ich feier wenige Serien so richtig. Ja gibt es aktuell nur auf Englisch kann man aber schon beispielsweise über Amazon oder irgendwelche anderen Stream. Mein Original sind die jetzt irgendwie auf Disney plus oder auf Hulu oder was auch immer. WTF. Wusste ich bis dann nicht mal dass es das überhaupt gibt. Aber man kann sich das auf Amazon angucken. Bezahle ich halt zwei Euro pro Folge oder so. Was mir ein bisschen auf den Keks geht ist dass die Folgen halt wieder einmal also jeden Freitag die Woche rauskommen und nicht einfach am Stück aber ja so ist das halt. Manche stehen also auf das Serien Feeling. The Boys habe ich aufgehört zu gucken nach Anfang Staffel 2. Also Staffel 1 fand ich zum größten Teil ziemlich nice. Vom Ende hinher war es ein bisschen langweilig aber der Rest also Staffel 2 hat mir dann schon gar nicht mehr großartig gefallen. Aber wie gesagt ich bin da eh. Also es gibt viele Serien die ich gut fand. Eins zwei Staffeln. Und dann kam irgendwas was mir nicht mehr gefallen hatte. Dann hör ich auf zu gucken. Also ich glaube ich hab ganz ganz wenige Sachen wirklich komplett geguckt. Achja. So. Gibt es sonst noch irgendwas Spannendes? Das können wir uns dann angucken. Was gibt's dann? Was haben wir denn? Was haben wir denn noch als Spannendes? Hat sich ein Jahr warten auf das Steam Deck gelohnt? Eher nicht. Which Battlefield Games are dead? Also wirklich dead? Komplett ohne Spieler? Dürfte wahrscheinlich nur die ganz alten sein. So Vietnam und sonst was. Selbst BC2 und so kannst du ab und zu noch ein bisschen spielen. Aber wenn man dead sagt weniger als fünf aktive Server oder so dann sind das ganz schön viele. Expans hab ich auch geguckt Staffel 1 bis eineinhalb. Wo sind die Entwickler hin? Ich bin immer noch da. Battlefield 2042 Geheimnis aufgeklärt. Was war das gerade? Leute ich hab da beim Refresh und habt ihr es auch gesehen? Ah da ist es. Wollte ich gerade sagen ich hab doch irgendwelchen Weep Kram gerade beim Screen Refresh gesehen. Die meinen unbedingt dass wir das gucken sollen. Aber ich will jetzt nicht den Ventilator Teaser gucken. Das hört sich schon länger ein bisschen geltzwertig an. Naja. So. Das schauen wir uns an. Es gibt nicht viel Gescheites. Ne. Und was? Was ich diese Woche gesehen hab? Die Doku über die Cyber Polizistin wurde die Woche über 10 Parts gesplitzt. Ja du meinst über die Cyber Polizistin wo es in dem ganzen Beitrag vielleicht eine Minute um Cyber ging? Ne. Neues Video zur E3. Juckt mich so gar nicht was auf der E3 passiert ist. War die überhaupt schon? Achja das war das wo sie dieses klar das war doch wo sie dieses Open World Sonic gezeigt haben. Wo sich alle weggekackt haben. Habt ihr das gesehen? Das sah richtig fail aus. Ach das war Summerfest. Ach keine Ahnung. Juckt mich nicht. Man hat seit Corona gesehen dass Messen eigentlich total overrated outdated she baited sind. Die Gamescom war noch nie sinnvoll. Nicht für Spiele. Die Gamescom ist vielleicht ein Event für viele wo man vor Ort sich mit Leuten trifft die man lange nicht gesehen hat. Also die Gamescom ist für viele eher so ein Real Life Event weniger Gaming Messe. Weil Spielen kannst du auf der Gamescom eh vergessen. Das heißt du willst 3 Stunden anstehen für irgendwas. Und selbst wenn man da im Vorfeld Termine macht. Und dass man dann auch Sachen gezeigt bekommt. Selbst dann ist es nicht sonderlich spannend oder sinnvoll. Also die Gamescom ist komplett umsonst gewesen. Also nicht preislich. Komplett unsinnig gewesen. Deswegen gehe ich da auch schon seit Jahren nicht mehr hin und ob die jemals wieder in der alten Form stattfinden wird keine Ahnung. Mal gucken wie es dieses Jahr wird. Es soll ja dieses Jahr genau das habe ich auch. Also es soll ja dieses Jahr ganz normal stattfinden. Ich bin mal gespannt in welchem Umfang und wie das ist. Ob das dann wieder wie vor Corona ist oder nicht. Da sind sie aber selbst dran schuld wenn sie so einen Müll vorstellen oder? Ich mein dann muss man sich ja nicht den Leuten überlassen sich das zusammen zu reimen. Sondern könnte einfach was ordentliches zeigen. Oder man lässt es halt bleiben und zeigt was ordentliches wenn man was ordentliches zeigen kann. Ich muss sagen es waren die letzten Jahre so wenige AAA Spiele dabei auf die ich mich A gefreut habe und B als sie dann rausgekommen sind auch wirklich was getaugt haben. Also das letzte negativ Beispiel was mir dazu einfällt ist einfach Battlefield 2042. Da habe ich mich nachdem nachdem es so die ersten Sachen gab habe ich mich mega drauf gefreut und habe gesagt endlich mal wieder was modernes Battlefield Technik. Ich habe ja auch Videos zugemacht. Das sieht auch gut aus was man gesehen hat. Aber es wurde halt komplett verschissen. Ich habe ja damals als sie den Trailer hatten hatte ich ja mit dem Lost. Da haben wir zwei drei Stunden uns darüber ausgelassen und haben das besprochen wie man beide übelst gehyped hat drauf. Und man muss sagen die einzige Abteilung die wirklich einen richtig guten Job gemacht hat bei Battlefield 2042 ist die Marketing Abteilung. Die haben es drauf gehabt. Also zumindest am Anfang. Mittlerweile ja auch nicht mehr. Was gibt es da gibt es ja auch ein wenig noch schön zu reden. Aber alles was dann aber was ich witzig fand. Wir haben es lustigerweise in dem Stream damals sogar schon damals sogar schon gesagt. So nach dem Motto Alter alles mega geil. Sonst wie kann sich am Ende trotzdem wie kurze spielen und wir hatten recht. Es spielt sich am Ende wie kurze. Es geht wahrscheinlich Waffen sind nicht mehr in mein Amis. Die stehen da immer noch drauf Waffen daheim zu haben. Aber in den letzten Jahren hat man gesehen dass viel mehr Games weggehen davon realistische Waffen im Spiel darzustellen. Also ich rede jetzt nicht von Schwertern und Äxten und sowas. Das letzte hast du auch gesehen. Das wieder dass sie dann angefangen haben jetzt in Battlefield 2042 die Waffen nachzubauen aber den anderen Namen zu geben und sowas. Okay wahrscheinlich ist es viel schneller. Eisfliegt. Danke. Danke für den Zap. Ich brauche übrigens unbedingt mal neue. Echt tatsächlich. Ich hätte gedacht das ist deutlich weniger. Ich brauche unbedingt wieder neue Subscriber Dinger. Ich meine du bekommst glaube ich den nach einem Jahr bekommst du den goldenen Keks mit mit Halskette. Habt ihr eine gute Idee was man noch machen kann. Ansonsten muss ich mal in mich gehen. Man könnte man könnte den sicherlich noch noch ausbauen. Den Gold Keks. Eine Knarre. Ein Hut in Hut. Das das Problem ist Hut kann man nicht machen. Also wisst ihr dass das tatsächlich ziemlich fai fertig ist solche Dinger zu designen. Weil dem kannst du beispielsweise kein Hut aufsetzen dem Keks warum. Weil wenn man einen Hut nimmt. Wenn man einen Hut nimmt. Dieses Bild ist immer das gleiche Seitenverhältnis wenn man einen Hut nimmt dann nimmt das hier oben die Ecke weg und der ganze Keks wird kleiner weil das Seitenverhältnis von dem Bild gleich bleibt und du erkennst den Keks nicht mehr. Also du kannst eigentlich nur was machen was du an diesem Keks selbst machst du kannst nichts um diesen Keks machen. Deswegen gibt es hier auch keinen mit Headset weil das weil das kacke aussieht in klein. Ja genau also es ist gar nicht so gar nicht so einfach sowas zu designen. Die Augenfarbe kann man zum Beispiel machen oder Keksfarbe oder was der um den Hals hat oder vielleicht was er was in der Hand hat oder vielleicht hier oben so ein Stirnband keine Ahnung irgendwie so aber du kannst ansonsten kannst du nichts machen das muss. Ghostface. Ja das könnte sowas so Dinger Sonnenbrille ja tatsächlich ja ja genau genau das das geht natürlich auch sowas es ist tatsächlich nicht so einfach. Klar am Mittag war es hoch. Ich habe jetzt jemand der mir Stream Highlights zusammenschneidet richtig gut finde ich. Es haben ja schon ein paar Leute Probe geguckt manche haben gesagt Cringe Humor wobei ich es gar nicht so schlimm finde ich finde es passt eigentlich ziemlich gut aber die meisten fanden es gut. Ich bin mal gespannt das ist nämlich eine super Alternative dass ich weil ich bin jetzt ja nicht gerade die krasse Contentmaschine was YouTube Videos angeht ich mache alle keine Ahnung 14 Tage in einem Video oder so aktuell oder wenn was ist und es gibt doch im Stream ab und an die ein oder anderen interessanten Dinger was wir uns mal angucken wo wir uns mal darüber auslassen und wenn das jemand zusammenschneidet von meinem 45 Minuten Stunden Gelaber zu unter 10 Minuten ist das finde ich recht unterhaltsam das können wir uns ja am Mittag angucken also was heißt wir wir nicht also ihr könnt euch das angucken wenn ich hochgeladen habe. Die meisten Leute die öfters im Stream dabei sind vielleicht sogar dabei wo ich es erzählt habe aber wir mal gucken. Das ist ja kein Ersatz für irgendwie Content ansonsten gäbe es einfach kein Content bis man wieder danach ist alle zwei bis drei Wochen ein Video aufzunehmen so gibt es vielleicht öfters mal was und ich finde das richtig gut geschnitten. So YouTube letzte Chance. Letzte Chance empfehlt mir was gescheites. Wo wollte es das so. Das schrecklichste Release der Playstation 3. Ach so die ja gut also eines der schlimmsten Sachen was Konsolen Ankündigungen angeht fand ich immer noch die Xbox One. Also die Xbox One das war so how to verkacken any percent also das war kompletter Schwachsinn. Erinnert ihr euch noch. Erinnert ihr euch noch dran als die war der Xbox One Präsentation ernsthaft irgendwelche Football Games oder Basketball ich glaube Football war es irgendwelche Football Games gezeigt haben und dann erzählt haben wie geil das ist dass man sich im Auferlei einblenden kann auf der Xbox One für die Football Games und da haben halt alle sich gedacht. Ja ok. Kikona Staff. TV TV. Ja genau. Wo ich immer noch nicht gecheckt habe was zum Teufel haben die da getrieben und sich gedacht was geht da. Wie schnell das Geld mit Fishing weg ist. Ok der NDR Ratgeber erklärt uns das. Aber 17 Minuten. Irgendwann. So da hinten so. Ich mein für irgendwas muss ich ja meine Gebühren bezahlen. So viel kriegen YouTuber. Ach gibt's mal wieder hier. Ich habe alle Placements angenommen. Das war gar nicht schlecht das Video. Das letzte fand ich eigentlich ganz gut. Cave Exploring Gone Wrong. Alles klar. Der Kerle ist immer noch am Tunnelgraben. Das haben wir doch vor einem Jahr zuletzt geguckt. Wir haben doch vor einem Jahr oder so mal ein Video von ihm geguckt. Wo er angefangen hat den Tunnel zu buddeln. Ok so ein Tunnel buddelt sich wahrscheinlich nicht so easy einfach mal so. Dauert wohl eine Weile. Na gut. Kauf zwei dann hast du eine. Wie man muss zwei Packages kaufen dass man eine Pyramide bekommt. Wirklich. Das ist ja Massive 5 Fett Geld machen. 5 Fett Money Makin. Windows Defender now available for all platforms. Das ist doch jetzt schon. Ok auf iOS. Also wir haben auf unsere Linux Server schon lange. Microsoft Advanced Threat Protection. Ich finde es mega beschissen und ich habe das an einigen Stellen auch schon gesagt. Aber alle sagen sich ja aber Security das muss sein. Wir brauchen Advanced Threat Protection auf allen Linux Systemen. Das Ding also wir hatten dadurch noch keinen Vorteil wir hatten bisher nur Nachteile. Wusstet ihr eigentlich das Microsoft die Advanced Threat Protection live patchen kann. Also damit hat quasi Microsoft ein Backdoor auf jedem deiner Server. Also der Windows Defender patcht sich live angeblich irgendwelche Updates allerdings können die nicht nur Updates patchen sondern auch wirklich Funktionen am Defender. Das heißt sobald du Windows Advanced Threat Protection auf deinem Linux Server drauf hast hast du effektiv ein Microsoft Backdoor auf deiner Kiste. Also was auch wer diesen Scheiß ernsthaft installiert und wer im Management diesen Schwachsinn entscheidet das kann ich nicht nachvollziehen. Passwörter mittlich zu dem Klartext speichern. Ja das hatten wir auch schon. Wie gesagt ich habe schon Passwörter im Klartext in irgendwelchen Defender Logs gefunden. Ok komm gucken wir gleich erstmal erstmal den Level Cap Gbait. Leute der tägliche, jährliche, monatliche, wöchentliche Level Cap Gbait. Das muss sein. Lass uns mal Level Cap Gbaiten. Hast du das Drama um Googles AI mitbekommen? Ne was war? Was war das Drama? Was war das Drama um Googles AI? Hab ich nicht mitbekommen. Ich kann mich noch an das Drama über Microsofts Nazi AI erinnern. Weiß das noch jemand? Microsoft hat mal ein Twitter Bot gemacht. Was ist das denn hier? Microsoft hat mal ein Twitter Bot rausgebracht der lernen sollte wie man auf Twitter eben mit Leuten kommuniziert. Genau genau dieses Ding meine ich. Also Microsoft hat mal einen Bot auf Twitter rausgebracht der aus Twitter lernen soll wie man auf Twitter kommuniziert. Das Problem war dass der nach ein paar Tagen nur noch Nazi Kommentare und rechtsextreme Sachen gepaustet hat. Also da denkt man sich auch Alter. Das hätten die sich auch denken können. Weil ganz im Ernst, dass die Leute wenn die das mitbekommen nicht normal diesen Bot antworten. Mich würd's nicht wundern wenn da 4chan wieder dran beteiligt war im Zweifelsfall. Hat Chatbot Lambda ein Bewusstsein entwickelt? Okay lass mal abkürzen. Wahrscheinlich nicht. Google Burlaub Angestellten. Aha. Weil bei Google niemand diese Überzeugung geteilt hat. Alter die haben alle Dachschaden man. Was zum Teufel hat es denn jetzt mit religiösen Überzeugungen zu tun? Also sprich er behauptet, nur dass ich das mal richtig verstehe. Er behauptet sein Chatbot hätte Self-Awareness entwickelt und bei Google sagen alle andere die das sehen, nee kann nicht sein du hast doch nicht mehr alle. Und dann sagt er ja das macht nix ich muss einfach nur dran glauben und hat sich jetzt darüber beschwert dass man ihn diskriminieren würde weil. Hä? Das ist auch wieder was was nur im Jahr 2022 passieren kann. Wahrscheinlich. Der Alkohol muss wohl mit aber. Okay. Stattdessen hätten sie wiederholen seine Gesundheit in Frage gestellt. Ja kann ich mir schon vorstellen dass da einige Dachschaden haben. Also ich tendiere ich tendiere in dem Fall auch ob ohne ohne diesen Chatbot zu kennen. Ich tendiere auch eher zu dass der Kerl im Dachschaden hat. Da bin ich mal gespannt was da noch raus kommt. Mittlerweile sind Bots eh schon an der an der Grenze das wo man sich fragt. Hat das nicht vielleicht doch irgendein Mensch gemacht? Also auch die wie heißt diese Übersetze wie heißt diese Übersetzungsseite? War das Dieb L? Ich weiß nicht. Das ist auch ziemlich gut mittlerweile. Ja das ist das ist auch das ist auch ziemlich gut mittlerweile und ich gehe auch davon aus dass man das in ein paar Jahren nur noch äußerst schwer auseinanderhalten kann. Aber gerade was Übersetzung angeht fände ich das POG. Wisst ihr was was ich finde man ist in manchen Bereichen sind wir deutlich besser in dem was man sich also zu dem was man sich in irgendwelchen Science Fiction Filmen vorgestellt hat für in 300 Jahren sind wir jetzt schon besser und in manchen Bereichen haben wir noch gar nichts auf die Reihe gekriegt. Ja zum Beispiel wenn man sich mal ältere Science Fiction Filme anguckt da hatten die ja auch immer irgendwelche Kommunikator Devices wo sie dann halt ich sage mal gefunkt haben und oder kommuniziert haben und diese Dinger sind alle um ein Vielfaches schlechter und und klobischer und größer und und ja in allen belangen schlechter als irgendwo modernes Smartphone. Also da sind wir deutlich besser als ich das noch Science Fiction Sendungen von vor 30 Jahren vorstellen konnten aber in anderen Bereichen gar nicht. Ja das wundert mich nicht. Bei uns ist es so wir haben eine Zeiterfassungs Software die hatte bis vor ein paar Versionen stand da immer noch drinnen wenn du die gestartet hast optimiert für Microsoft Internet Explorer. Wisst ihr was ich bei manchen Moment das muss ich euch mal zeigen Internet off shit. Internet off shit. Da gibt es teilweise Bilder von hier guckt mal Elektro. Manche modernen Autos musst du jetzt Updates machen also du kannst nicht einfach mit deinem Auto fahren du musst jetzt einfach 15 Minuten neben stehen bleiben und warten bis das Software Update durch ist. Also das ist was was mir persönlich ja irgendwie wieder strebt. Also wenn ich schon ein Auto habe dann möchte ich das mit dem Auto auch exakt dann benutzen können wann ich will und der das man Software Updates machen kann und sollte ist ja alles in Ordnung. Aber wenn schon wenn ich wenn schon wenn ich nicht drinnen bin oder aber dass ich sagen kann nein ich fahre jetzt erstmal. Das ist halt echt schon heftig wenn du dir überlegst so nach dem Motto ich will jetzt mit dem Auto losfahren und dann nein du fährst nicht los du machst jetzt erstmal ein Update. Ja sollte auch so sein das kann nicht sein dass du da warten musst aber trotzdem also was ist wirklich richtig hier hingeblieben. Toaster mit Homescreen ja warum nicht. Nicht jedes Gerät was man smart machen kann macht man smart damit indem man ein Display dran pappt das ist auch so ein Ding guck mal. Ich vermute mal dass es äußerst sinnlos ist dass dieser Toaster quasi ein Homescreen hat. Man könnte guckt euch ok bestes Beispiel Kühlschränke. Es gäbe so viele coole Möglichkeiten Kühlschränke smart zu machen. Die könnten verschiedene Fächer haben man könnte das automatisch wiegen dass du den Stand weißt. Man könnte Codes scannen man könnte Analyse machen AI technisch was da drinnen ist was man denn als nächstes wieder macht. Man könnte unglaublich viel machen an Kühlschränken um die zu verbessern aber was zum größten Teil gemacht wird ist man pappt ein Display vorne an den Kühlschrank und sagt das ist ein smarter Kühlschrank oder noch schlimmer man macht eine Kamera in den Kühlschrank und sagt ja das ist jetzt ein smarter Kühlschrank. Auf der anderen Seite gäbe es vieles und ich habe das in Kombination so noch nicht gesehen. Gerade was was Codes scannen kann und sowas. Der hat während der Fahrt ein Update gemacht ja nice. So was wobei ich denke dass es das teilweise sogar schon geben könnte aber wenn nicht ist das auch was. Wie gesagt was ich halt meine ist man macht den Kühlschrank nicht dadurch smart weil man einfach ein Display dran pappt oder eine Kamera rein packt oder sowas. Das ist unsinnig. Zumal ich auch der Meinung bin wenn du wirklich gute smarte Heim Elektronik Geräte bauen willst sei es ein Kühlschrank sei es meinetwegen auch ein Toaster oder eine Waschmaschine das wichtigste für mich ist nicht dass die irgendwie eine Hersteller App für Smartphone haben die geil aussieht und ist das nur damit funktioniert. Wichtig ist dass das die Möglichkeit hat in irgendeiner Art und Weise mit offenen Schnittstellen darauf zuzugreifen. Weil so ein Kühlschrank hast du 10-15 Jahre. Sag jetzt einfach mal warum sollst du den Kühlschrank austauschen wenn der Kühlschrank geht halt einfach und wenn er kaputt ist tauscht ihn aus ansonsten behältst ihn bis er verreckt. Und dass diese Smartphone App in 5 Jahren schon nicht mehr funktioniert ist relativ hoch beziehungsweise dass die keine Updates mehr bekommen ist relativ hoch und man möchte vielleicht die dann auch anderweitig integrieren also es ist wichtig dass man möglichst simpel auf diese smarten Geräte zugreifen kann. Sei es eine Web Schnittstelle sei es MQTT das einfachste dürfte tatsächlich sein man macht eine ganz normale Schnittstelle eine ganz normale Web Schnittstelle wo man sich Sachen abrufen kann. Weil eins ist sicher normale Getrequests Http Getrequests die sind auch in 30 Jahren noch angesagt. Aber da haben die Hersteller keinen Bock drauf besser eigene App. Ja dass es den Herstellern vorschreibt ist klar aber ich glaube deswegen ist eines der Gründe warum es jetzt nicht durchsetzt. Ok und warum haben wir sie nicht wenn wir sie jetzt schon haben könnten. Wenn es sich lohnen würde sowas jetzt herzustellen würde man das doch machen. Da muss jemand diese Robbe. Kennt ihr diese Robbe aus japanischen Altersheimen die man da streicheln kann diese weiße Robbe. Kannste ja jetzt schon machen. Machst eine Websocket Verbindung und da drüber dann dein Get. War da kein richtiges Get aber du kannst ja über Websockets denken. Theoretisch kannst du Http über Websockets machen wenn man das will. Wüsste nicht genau warum aber man kann das machen ja. Ja also können wir es doch nicht machen weil solang es die Technik nicht gibt. Gut das kannst du zu allem sagen dass es im Prinzip nur eine Geldfrage ist ja. Also das ist nahezu alles nur eine Geld und Zeitfrage. Wir könnten jetzt auch schon auf dem Mars sein hätten wir da vor 60 Jahren weiter gemacht mit sehr viel Geld und sehr viel Manpower und sehr viel Zeit. Es ist halt immer eine Frage der Sinnhaftigkeit. Eine Fress Schnittstelle. Selbst wenn der Kühlschrank mit Soap XML funktioniert ist auch ok. Hauptsache irgendwelche offenen Schnittstellen wo man drauf zugreifen kann. Also darauf wird es definitiv rauslaufen. Also eins kann ich euch sagen wenn neue Technologie sich in einem Bereich durchsetzt dann ist es bei Porn. So wie man das bei VHS gesehen hat wie man das bei Blu-Rays und vor allem bei VR gesehen hat. Es ist immer so. Und wenn es die Möglichkeit gibt Webroboter zu bauen dann gibt es die als erstes. Das erste was es geben wird sind irgendwelche Anime Weep Porn Roboter. Ich sage es euch. Man will es nicht wahr haben aber so wird es sein. So wird es sein wie bei vielen anderen Technologien auch. Gibt es Stauksauber Roboter und Meh Roboter. Das stimmt auch wieder. Ich weiß halt nicht ob humane Roboter überhaupt das Ding ist. Was wäre denn jetzt der Vorteil davon wenn du einen Roboter hast der mit dem Rasenmäher durch deinen Garten fährt anstatt ein Meh Roboter. Außer dass es Weird Champ aussieht. Fabestorm danke für den Sub. Na ja was gucken wir uns jetzt an zeig mal her. Ja das ist ein Gebiet da haben wir eh große Probleme in Zukunft. Hauptsächlich weil es wahrscheinlich außer Roboter keiner mehr machen will. Also komm wir lassen uns eine Runde Level Capture Baiten. Level Capture Bait ist real. Battle Feast finally adds Fanfavorite Mode. Oh finally. Finally gibt es irgendwas warum man das Spiel mal wieder länger als 2 Stunden spielen sollte. Inklusive Addon. Weil wisst ihr wie lange ich das Addon gespielt habe. Addon die Season 1. Ich habe es gespielt für mein Video 5 Runden oder so. Und ich habe es hier im Stream 5 Runden gespielt. Ich habe 10 Runden insgesamt gespielt und es wieder uninstalled. Fertig. Weil ich gar nicht weiß ob ich uninstalled habe aber ich werde es uninstallen. So bald wozu. Fertig. So. Achja. Big Changes. Big Changes bei DICE bedeutet sie sind in eine Textdatei gegangen und haben zeig mal die Spielerzahlen. Ja mach ich. Mach ich. Sie sind in eine Textdatei gegangen aber vorne mal schnell New World Lurken. Ah nice. Haha das ist auch geil. Ich habe am Anfang gesagt als das Spiel rausgekommen ist und gerade in Deutschland haben sie eine riesige Kampagne gefahren mit Let's Playern die das spielen und die ganzen Casual Noobs sind dann dahin gerannt weil ihr Lieblings Let's Player das spielt und haben sich aufgeregt über die Server Cues. Ich habe noch gesagt Leute wartet mal 2-3 Monate ab ihr werdet euch zurück wünschen dass es Zeiten gibt die Zeiten wieder mit den Server Cues weil 3 Monate später sind die Server leer. Ich habe es selten gesehen dass so schnell in diesem Umfang Spielerzahlen verloren wurden. Man muss sich das mal vorstellen. Sie sind innerhalb von 1. Stimmt nicht ganz. September, Oktober fehlt da. Innerhalb von 2-3 Monaten. Sag mal 3 Monaten. Innerhalb von 3 Monaten sind die um 850.000. Krasser Scheiß Alter. Also Battlefield. Battlefield Zahl. Zeig mal her. Oh guck mal da. Ist wieder hoch und jetzt am Wochenende ist es wieder ein bisschen hochgegangen. Guckt euch das mal an. Also ich denke das wird vielleicht noch 1-2 Wochen so gehen dann ist wieder Ruhe. Dann haben das alle ausprobiert und gut ist. Weil Content gibt es ja nach wie vor nicht und es gibt auch sonst nichts weiter sinnigerweise in dem Game. Tja. Lassen wir uns was debaten. Und was Levelcap hier sagt ist Dice ist in irgendeine Textdatei gegangen in irgendeine JSON Datei und hat die Map Rotation geändert. Hui. Den Bitcoin ja den können wir uns angucken. Der ist ein bisschen ja weiß ich ziemlich weit. Runter. Geflutscht. So egal. So vollkommen egal ob es die Zahlen von Origin. Was auf Epic. Epic gibt es auch Battlefield. Wirklich. Tatsächlich Kegway. Ist aber egal. Es ist vollkommen wurscht. Meine Trend ist doch überall der gleiche. Und ob es jetzt. Ich meine mal ernsthaft ob das jetzt im Endeffekt. Wenn man sich das hier mal anguckt. 2000 Spieler. Ob es jetzt 2000 Spieler sind auf Steam oder sagen wir mal noch mal 2000 dabei für die anderen Plattformen. Das macht es jetzt nicht fett. Also wichtig ist der Trend und der Trend ist überall gleich. Wir wissen ja die Spielerzahlen von den Konsolen auch nicht. Aber wir können davon ausgehen dass der Trend auf den Konsolen exakt genauso ist. Das wird es wahrscheinlich sogar bald gratis geben. Also die versuchen vielleicht auch ein bisschen mit Transactions was zu verdienen. Ja die Leute die sich damals eine Pizza gekauft haben. Ich finde das ist falsch darüber sich jetzt Gedanken zu machen weil man muss sich überlegen wie das war. Man hat damals gesagt okay die Pizzeria bietet für Bitcoins eine Pizza an und jetzt finde ich das angemessen damit zu kaufen. Da konnte auch niemand mit rechnen. Das ist acht Jahre später richtig krass viel wert ist. Es hätte genauso gut sein können dass er nie wieder was dafür bekommen hätte. Muss man immer zum jetzigen Zeitpunkt sehen. Weil es ist genauso wie wenn du dir irgendwelche Börsencrafts anguckst und sagst ah hätte ich damals Microsoft Apple sonst was gekauft. Das wusstest du ja nicht. Das kannst du im Nachhinein immer so einfach sagen. Ja aber du wusstest das ja nicht. Ja mal angenommen nächstes Jahr geht Bitcoin auf neues Rekordniveau. Da würden alle sagen oh fuck hätte ich heute mal was gekauft. Du weißt es nicht. Kann aber auch bei 1700 nächstes Jahr sein. So wir lassen uns jetzt weiter Level Cap Gbaiten. Auf Gbaiten uns. Ich finde es lustig dass Battlefield in letzter Zeit eigentlich nichts irgendwie spannendes rausbringt. Aber trotzdem diese Videos immer von significant und huge changes und sonst was reden. Und in Wirklichkeit ist nichts davon significant und huge. Ja gut das ist gut hoffentlich hoffentlich nur 24 Spieler. Leute ich sag euch was. Wie wärs mit einer Map Selection. Einfach eine Map Selection in der Spielersuche. Weil dann könnte man einfach drei Spielmodi anbieten und dann könnte man dort auswählen welche Map man spielen will und dann würde man nur diese Map spielen die man spielen will oder diese drei Maps die man spielen will. Ich hab gehört sowas soll möglich sein. Aber ich glaube bei DICE ist einfach die Technology noch nicht noch nicht da dafür. Stimmt dafür gibt es auch nicht genug Spieler. Hast du recht. Wenn ich sage es gibt kein Server Browser habe ich jetzt schon total oft Leute gesehen in meinen Videos die dann sagen doch doch Max guck mal in Portal da gibt es einen Server Browser. Die verstehen nicht dass das was komplett anderes ist. Also einen Server Browser in einem Nischenteil des Games versus der Hauptspiel Modus oder das Ding wofür man das eigentlich geholt hat oder naja wofür es beworben wurde. Wo die Leute drauf scharf sind und den Hauptspiel Modus oder die Hauptspiel Kategorie da gibt es keinen Server Browser. Und nur weil es da in Portal irgendwie sowas Nischen mäßiges gibt. So what? Also eins muss man sagen. DICE hat es in dem Fall ja echt perfektioniert. Die können viel reden über nichts nichts. Also die reden viel über sehr wenig Inhalt. Was möchte dann DICE bitteschön an Weekly Roadmaps raushauen. Das Spiel ist acht Monate alt und hat kaum neue Sachen oder hat im Endeffekt nichts wirklich bekommen. Ja Voice Chat hui ja ein Scoreboard aber das ist doch nichts an Inhalt. Das Spiel hat in acht Monaten nichts zu bekommen. Was wollen die denn in ihre Weekly Roadmap schreiben. 8.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich was futtern. 10.30 Uhr mache ich ein Video auf YouTube. A Day in DICE Developers Life. Oder was wollen die denn? Was soll auf dieser Roadmap draufstehen? Also Inhalt zum Game kann es ja schlecht sein. 8.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. zwischen Updates und dann sagt DICE, ja wir könnten uns überlegen ob wir nicht auf dieser Map drei neue Kisten platzieren. Also die Roadmap bei Warzone ist, wir tauschen zwischen Updates einfach mal die halbe Map aus und bringen eine neue Map mit rein und die Roadmap bei Battlefield ist, ja man könnte drei Kisten platzieren. Und der nächste Punkt in unserer Roadmap ist, dass wir die Roadmap für nächste Woche erstellen. Bei dem Typ kann ich nicht anders wie an was 16 times the detail oder ich weiß gar nicht mehr wie viel wie viel mal detail mehr hätte Fallout 76 haben sollen. Elder Scrolls 6, das haben sie auch vor vier Jahren oder so angekündigt und zwar wie, sie haben einen Schriftzug gezeigt und haben dabei das Elder Scrolls Main Theme für drei Tastendrücke angespielt. Fertig, nice und seitdem nie wieder was von gehört. Seriously, wenn die kein Spiel rausbringen mit Mod-Support, ist es ja, also das muss man ihnen ja tatsächlich lassen, Skyrim ist eines der besten Modding Plattformen allerzeit. Erinnert mich ein bisschen daran an Half-Life 1, was es da für tausende geile Mods gab, also von den Möglichkeiten her. Da gibt es so Sachen wie Enderal, wo sie quasi das komplette Spiel, wo sie quasi nur das Framework drumherum genommen haben, ein komplett eigenes Spiel gebaut haben, also das machen die schon richtig. Das sorgt ja letztendlich auch für Langlebigkeit in den Games und dass man sich da nicht darauf verlassen muss, dass sie das mit Inhalt füllen für die nächsten zehn Jahre ist ja auch gut. Zum Beispiel Games wie Mario Kart, sage ich jetzt nicht von ungefähr, weil es gab ja eine Custom Strecke für Mario Kart als Mod, die optisch noch nicht so hundertprozentig an die Originalstrecken rankommt, weil sie noch Probleme haben mit der Beleuchtung, aber überlegt euch mal, wie cool das wäre, könnte man einfach mit ordentlichen Mod-Tools Mario Kart Strecken erstellen. Das wäre eines der beliebtesten Games der Welt. Das wäre das Spiel auf Twitch. Das wäre einfach der riesen Hype, wenn es da für Möglichkeiten gäbe eigene Strecken zu erstellen. Aber was macht Nintendo? Nichts. Und bringen irgendwie die Mario Kart Tour Strecken leicht angepasst dafür raus, nice. Aber überlegt euch mal, wie das Spiel komplett durch die Decke gehen würde, könntest du in Mario Kart Custom Strecken erstellen. Und ich meine damit nicht, dass sie einen Mario Kart Maker machen sollen. Das meine ich damit gar nicht. Es ist nämlich ein Unterschied, ob du einen Mario Kart Maker, Dungeon Maker oder sonst was hast oder ob du einfach Zugriff auf die Entwicklungstools hast. Wenn du dir nämlich Skyrim anguckst oder auch davor, wenn man sich mal die... Wo sind die Baldur's Gate Leute? Black Isle Studios? Ich bin gar nicht mehr sicher. Wenn man sich die Neverwinter Nights Mod-Tools anguckt und sowas, da hast du gesehen, dass die Leute das Spiel zum großen Teil auch mit diesen Tools entwickelt haben. Und das ist ein Unterschied, ob du den Leuten einen casual freundlichen... Mario & Games waren die Divinity. Das sind wieder andere. Ich meine nicht die Baldur's Gate 3 machen, ich meine die alten Dinger. Oder guck dir Source Engine Sachen an. Genau. Das ist kein Level Editor für Casuals wie Mario Maker, sondern das sind halt die Tools, mit denen die Entwickler zum größten Teil auch die Inhalte dafür erstellt haben. Das ist ein Unterschied und da kannst du halt viel mehr machen. Das kann nicht jeder Kacknoob, aber es muss auch nicht jeder Kacknoob Strecken erstellen. Belegt euch mal, du hättest wirklich die Möglichkeit mit ordentlichen Tools, was ja Fan-Made mittlerweile halbwegs sogar geht für Mario Kart, Nintendo mag das halt nicht, du hättest wirklich offiziell die Möglichkeit, richtig neue Strecken mit ordentlichen Entwicklungstools für Mario Kart zu erstellen. Alter das Spiel würde auch auf Twitch, das würde überall komplett durch die Decke gehen, weil das ist einfach ein ultra spaßiges Game und wenn es da jetzt noch abgedrehten geilen Fan-Content gäbe und Nintendo kann sich das jetzt gar nicht ausdenken, was den Fans alles einfallen würde. Ja das erste was es gäbe, wäre Prop Hunt in Mario Kart, bin ich mir sicher, das ist immer einer der ersten Modi, die skippt. Ja da kannst du dann, ich bin auf der Map versteckt, ich bin irgendein Shy Guy, der da oben auf der Pyramide rumläuft oder so. Da gäbe es die krassesten Mods überhaupt und das würde das Spiel, das würde komplett durch die Decke gehen. Natürlich die Frage, ob Nintendo dann ein paar Jahre ein neues Mario Kart verkaufen könnte oder so viele Leute noch sich die StreckendLCs kaufen würden. Das ist richtig, das stimmt schon. Aber es würde das Spiel unglaublich langlebig und unglaublich gehyped machen. Egal, wir lassen uns weiter tschüben. Also Mod Support ist immer noch eines der geilsten, also gut gemachten Mod Support. Mod Support muss ja gar nicht, wisst ihr eigentlich warum so viele Spiele früher Mod Support hatten? Das war kein Mod Support im eigentlichen Sinn, die Entwickler haben einfach ihre Entwickler Tools dabei gelegt. Half Life 1 hattest du WorldCraft? Hieß das glaube ich noch? WorldCraft? Ja, WorldCraft hieß das Ding in Half Life 1. Heute heißt es Hammer, früher hieß es WorldCraft. Die haben einfach ihre Entwickler Tools dabei gelegt. Und fast jedes Echtzeitstrategie Spiel damals, guckt euch auch die alten Command & Conquer Teile an, die hatten einen Editor dabei und das war zu 90%, vielleicht nicht alle Features komplett, aber das war zu 90% eben der Editor, mit dem die Missionen für dieses Spiel erstellt wurden vom Hersteller. Also das war kein Mod Support in dem Sinn, dass man gesagt hätte, ja wir machen das jetzt extra, nein, die haben einfach ihre Entwickler Tools freigegeben. Sachen wie WorldCraft 3, also die ganzen WorldCraft 3 Mods wären ja gar nicht möglich gewesen mit einem minimalistischen Casual-freundlichen Editor. WPM, ja habe ich schon, ich bin nicht sonderlich schnell im Schreiben, vor allem nicht fehlerfrei. So und das war halt richtig geil, deswegen gab es da auch so viel geilen Content und deswegen konntest du damals quasi jahrelang Spiele spielen, weil es einfach Poggers Content am laufenden Band und von Leuten, die das Spiel kannten und wussten, wie man gute Sachen macht, gab. Es gab auch viel, es gab sehr viel Müll-Content, also 90% der Mods, würde ich sagen, waren Müll, aber es egal, es gab einfach saubermissig viele und auch richtig gute, ja. Ego CS ist ja im Prinzip ein Mod, war ursprünglich gewesen. Dota auch, genau. Also wie gesagt, das ist das beste, wie man Spiele langlebig machen kann und das war halt früher mehr oder weniger normal, weil die ihre Entwickler Tools mitgebracht haben. Und die haben halt dann gesagt, ja entweder ihr arbeitet euch da ein oder ihr habt Pech gehabt, aber du hattest halt die umfangreichen Möglichkeiten, was zu machen. Ohne Scheiß Overwatch wäre ein so viel geileres Game, jetzt mal ernsthaft, Overwatch könnte eines der besten Competitive, Casual, könnte eines der besten Spiele für alle sein, gäbe es die Entwickler Tool beziehungsweise gäbe es die Möglichkeit, ordentliche Custom Maps zu machen. Weil man muss halt sagen, die Overwatch Maps sind halt zur Hälfte ultra kacke, gerade die ganzen 2CP-Dinger, also gut, dass die rausfliegen und Blizzard kann keine Maps bauen. Also ich finde, die Overwatch Maps, die sind halt vom Detailgrad und vom Design her, sind die cool, also Art-Abteilung hat Blizzard, aber die Maps sind vom Gameplay her rotz, ganz ehrlich, ich sage euch, das ist meine Meinung von den Overwatch Maps, es gibt ein paar Maps, die sind okay, Kingsrow zum Beispiel finde ich ganz nice, aber ansonsten, die meisten Maps sind einfach langweilige Schlauchlevel ohne Finesse, also Overwatch Maps sind einfach total langweilig, zum größten Teil schlecht designte Shooter Maps, könnte man wirklich Maps entwerfen, für Overwatch wäre das eines der besten Spiele der letzten Jahre und wäre es immer noch, es wäre auch nicht so untergegangen, weil Blizzard nichts an Content rausbringt. Es ist doch nicht ohne Grund so, dass StarCraft, die Maps, die dort gespielt werden, die wechseln ja auch immer wieder, niemand spielt Blizzard Maps, das sind alles Custom Maps und der Map Pool wechselt da auch regelmäßig, das sind alles Custom Maps, die ganzen StarCraft sind alles Custom Maps. The same. This applies to modding as well. He stated that Starfield will be a dream for its modding community. The Resident Evil franchise had several exciting announcements this week, Resident Evil Village is getting a new expansion called Shadows of Rose. It'll be based around the protagonist's daughter from the base game. Capcom stated that the new DLC is much harder than the base game. Village is also getting a third-person mode that'll make it play like a combination of the original Resident Evil games and their modern remakes. All this new content is available as part of the Golden Edition bundle that will launch on October 28. Highly realistic tactical FPS Ready or Not has been temporarily delisted from Steam with that explanation. The game was removed a week after the developers added a nightclub level depicting a mass shooting event. The devs say Valve hasn't clarified why the game was removed, but they're working to resolve the situation. It's likely the game's dedication to realism has pushed... Wie ist denn das eigentlich? Meine blöde Frage, hatte schon jemand mal die Variante, er hat ein Steam-Game gekauft, runtergeladen und dann wurde es von Steam genommen. Was passiert dann? Kann man das dann noch spielen? Kann man das nun nicht mehr herunterladen? Wird das deinstalliert lokal bei einem? Kann man es anklicken, aber nicht mehr starten? Man kann es nun nicht neu kaufen, oder wie? Achso, also man kann es bloß nicht mehr kaufen. Okay. Hat das hier mal von euch gespielt? Ich stelle mir die Steuerung auf mobile oder cheatet jeder mit dem Controller? Spielt das einfach jeder mit dem Controller und fickt die ganzen PLEPS am Touchscreen weg? Oder wie ist das? Na gut, holen wir was aus, excuse me. Leaker Tom Henderson, der sagt, dass er das Prototyp dieses neuen Pro-Controllers gesehen hat. Er sagt, es beinhaltet removable analog sticks, removable stick units beneath the analog sticks, Trigger-Stops, Rear-Buttons und removable grips. Die removable analog sticks As it offends in a scav controller, oder? ...would last someone to actually replace them if they develop something like stick drift issues or just wear out. Ubisoft hat gesagt, es würde die Zukunft von Assassin's Creed irgendwann im September entdecken. Fans speculate, that that event would be used to reveal the rumored Assassin's Creed Infinity Game, a free-to-play, multi-era, live-service title. Oh nein, please, please! Das hört sich wieder nach Ultra, wir wollen ganz viel Geld machen, haben aber eigentlich keine gute Idee für das Game an. A remaster of the original Assassin's Creed Game is coming. In the new anniversary trailer of the series, particular attention was put on Assassin's Creed 1. Fans noticed minor lighting tweaks and color changes compared to the original game. It also sports a new logo. Of course, time will tell, as everything will hopefully be revealed in September. Newly released God of War merchandise has fans speculating about the game's release date. The highly anticipated sequel, God of War Ragnarok, was initially set to launch in 2021, but was pushed back to sometime this year. An online store has listed God of War Ragnarok merchandise with a release date of October 2022. According to developers on Twitter, the game won't be delayed again, meaning an October release date is looking more likely. District 9 and Elysium director Neil Blockamp is set to direct a Gran Turismo movie for Sony. It's supposedly going to be re-released in August of 2023. Reports indicate that isn't the usual video game adaptation. Instead, the film will follow a teenage Gran Turismo player whose gaming skills lead them to become an actual professional race car driver. Other than that, very few additional details are known, but production at Columbia Pictures is starting soon. It'll be led by the same producers that made the recent Uncharted movie. Oh yeah! During their Overwatch 2 live stream, Activision Blizzard confirmed that the sequel would be an always-on, constantly-evolving, free-to-play game. It'll drop the original's loot box model in favor of a battle pass and an in-game store. Each season will run for nine weeks and include either a new map or a new hero every time. Not to mention new weekly challenges... Moment, Moment, Moment! Die wollen alle neun Wochen eine neue Map und einen neuen Held releasen? Oder, oder ein neuer... Das geht nicht? Wir haben, also, wir haben bei DICE gesehen, das ist nicht möglich. Also, es ist wirklich, wörtlich genommen, unmöglich. Das geht, das geht gar nicht. Chico verdeckt die oberste Zeile. Was macht Chico denn für Dinger hier? So, jetzt verdeckt Chico nicht mal die oberste Zeile. Ja, aber das, was ist denn mit denen los? DICE sagt nein, genau, das geht gar nicht. Seriös, aber eben... Wie diese Damen. So, jetzt geht's einfach los. Ja, los mit dem minimize Setback. Desktop? Thinking! Deswegen, Some queen praised the menu! It's 68% action. The release date for Survival FPS Stalker 2 has recently been pushed back to 2023. This is because the development team GSC Gameworld was based in the Ukraine. The extended Xbox and Bethesda showcase this week included a short video about what the developers have been dealing with since the Russia invasion began. The video shows the bombed out offices of the developers as well as different devs in uniform. The community manager for the game also now uses a bathroom for an office. The studio is currently transitioning to a new office space in Prague. They have stated that once things are up and running, development on Stalker 2 will resume. And that wraps it up for this week in gaming. As always guys, thank you so much for watching and I'll catch you next time. This is Levelcap signing off. What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins? What happens if you cut off CPU Pins?", "segments": [{"id": 1, "start": 120.0, "end": 147.2, "text": "So Leute da bin ich, ist noch früh aber ich bin schon ungefähr 1 Stunde auf aber ich"}, {"id": 2, "start": 147.2, "end": 162.4, "text": "bin nicht wach. Oder sag mal wach ist was anderes. Sagt mal hat irgendjemand diesen"}, {"id": 3, "start": 162.4, "end": 169.56, "text": "Overwatch 2 Reveal Stream gesehen der vor ein paar Tagen war? Das war aber nicht Stream,"}, {"id": 4, "start": 169.56, "end": 175.52, "text": "jedoch ja war mal ein Stream ich hab das als Wort geguckt. Das war wieder sehr viel gequatsche um"}, {"id": 5, "start": 175.52, "end": 184.16, "text": "nichts. Wirkte fast so als kämpft die Marketing Abteilung mit dem Entwicklungsteam was denn"}, {"id": 6, "start": 184.16, "end": 194.4, "text": "jetzt eigentlich da gemacht werden soll. Wann ist eigentlich Release Date? Also aktuell schockt es"}, {"id": 7, "start": 194.4, "end": 199.12, "text": "mich ok Oktober. Aktuell schockt es mich so überhaupt nicht. Ich weiß nicht es ist ja auch"}, {"id": 8, "start": 199.12, "end": 204.48, "text": "das hat sich auch nichts von dem verändert was mich genervt hat und ich glaube nicht dass Blizzard"}, {"id": 9, "start": 204.48, "end": 216.32, "text": "an den eigentlichen Problem die das Game hat. Vor allem der Support wie es jahrelang jetzt"}, {"id": 10, "start": 216.32, "end": 222.92, "text": "gelaufen ist dass sich da großartig was dran ändert nicht so viele Hoffnungen drin. Moin Leute"}, {"id": 11, "start": 222.92, "end": 230.0, "text": "also ich weiß nicht wie lange ich jetzt on bin ich bin übelst im Arsch noch kann euch gar nicht"}, {"id": 12, "start": 230.0, "end": 239.92, "text": "so genau sagen warum. Aber irgendwie bin ich im Arsch. Ich muss ich muss am Dienstag wisst ihr was"}, {"id": 13, "start": 239.92, "end": 244.72, "text": "ich was ich da tolles machen muss auf der Arbeit. Real Razor Chief danke für den Sub. Wisst ihr was"}, {"id": 14, "start": 244.72, "end": 254.84, "text": "ich da tolles machen muss ich muss mit einem Techniker aus den USA auf irgendeiner Cloud"}, {"id": 15, "start": 254.84, "end": 267.08, "text": "Linux VM mit dem zusammen was installieren. Bin ich mal gespannt was da rauskommt. Irgendwas was"}, {"id": 16, "start": 267.08, "end": 285.32, "text": "ich noch nie im Leben installiert habe der soll mir irgendwie sagen was ich machen muss."}, {"id": 17, "start": 297.08, "end": 316.8, "text": "Das habe ich mir auch gedacht ich habe mir auch schon gedacht warum geben wir dem nicht"}, {"id": 18, "start": 316.8, "end": 342.76, "text": "einfach remote Zugkräfte kann er selbst machen. Aber man weiß ja nie. Tja gab es sonst was"}, {"id": 19, "start": 342.76, "end": 349.12, "text": "spannend das die letzten Tage über. Ich habe eine ich habe eine China-Chinesen Sponsoring Anfrage"}, {"id": 20, "start": 349.12, "end": 359.68, "text": "bekommen. Muss ich euch mal vorlesen. Da keckt ihr euch weg. Die fängt schon an mit die fängt"}, {"id": 21, "start": 359.68, "end": 379.76, "text": "schon an mit irgendeiner. Keine Ahnung. China-Chinesen Zeichen E-Mail und es fängt an. Hello my old friend."}, {"id": 22, "start": 379.76, "end": 394.72, "text": "Hello my old friend. My dear. Das ist China-Chinesen Text übersetzt ins Englische. So fangen"}, {"id": 23, "start": 394.72, "end": 400.96, "text": "natürlich alle Sponsoring Anfragen immer an. Die Chinesen. Und was wollen sie mir. Was wollen"}, {"id": 24, "start": 400.96, "end": 413.64, "text": "sie mir aufschwätzen. Sie wollen mir ein ultra holdable und comfortable 48 Megapixel"}, {"id": 25, "start": 413.64, "end": 431.92, "text": "Main Kamera. Was wollen die mir überhaupt aufschwätzen. Ein Smartphone. Ob die wollen"}, {"id": 26, "start": 431.92, "end": 456.64, "text": "wir ein Smartphone aufschwätzen. Keine Ahnung. Ja oh man. Free Crap braucht auch keiner."}, {"id": 27, "start": 456.64, "end": 471.96, "text": "Möll kriegt man eben auch sonst. Aber was gescheites. Die wollen dann ja auch was dafür"}, {"id": 28, "start": 471.96, "end": 479.2, "text": "haben und das sehe ich nicht ein. Ich bewerbe so ein Crap nicht. Ich mache eh relativ wenig"}, {"id": 29, "start": 479.2, "end": 483.76, "text": "Sellouts. Ich mache eigentlich nie großartig Sellouts. Ich habe die letzten Jahre über"}, {"id": 30, "start": 483.76, "end": 488.0, "text": "was habe ich gemacht. Hetzner habe ich gemacht. Das würde ich auch weiter machen. Weil ich"}, {"id": 31, "start": 488.0, "end": 495.36, "text": "den Crap eben benutze. Und das auch ohne Sponsoring teilweise schon hier im Stream gezeigt"}, {"id": 32, "start": 495.36, "end": 501.24, "text": "habe. Ja dann habe ich dieses Battlefield Sponsoring gemacht. Wo man gemerkt hat dass"}, {"id": 33, "start": 501.24, "end": 505.44, "text": "ich keinen Bock mehr auf die Sponsorings hatte nach zwei Videos. Aber ich habe mir den halt"}, {"id": 34, "start": 505.44, "end": 512.88, "text": "drei Videos ausgemacht. Ja gut was willst du machen. Ansonsten. Ich habe irgendeinen"}, {"id": 35, "start": 512.88, "end": 526.84, "text": "Sniper Elite Sponsoring habe ich mal gemacht die letzten Jahre über. Die sind bei mir"}, {"id": 36, "start": 526.84, "end": 531.2, "text": "auch laufend am Start. Und VPN Anbieter sind auch laufend am Start. Und wisst ihr was lustig"}, {"id": 37, "start": 531.2, "end": 541.48, "text": "ist. Ich habe das ja schon erzählt. Die waren doch neulich sogar im Chat. Echt jetzt. Im"}, {"id": 38, "start": 541.48, "end": 556.8, "text": "Stream. Wirklich habe ich keine mitbekommen. Oder vor oder nach dem Stream. Naja. Was gibt"}, {"id": 39, "start": 556.8, "end": 569.0, "text": "es eigentlich einen einfachen Weg. Wo ist die Frage. Gibt es eigentlich auch einen einfachen"}, {"id": 40, "start": 569.0, "end": 580.8, "text": "Weg. Ein C++. Ja klar. Es ist jetzt egal ob es GCC ist oder LLVM Clang. Wie auch immer"}, {"id": 41, "start": 580.8, "end": 587.44, "text": "man das ausspricht. Genau. Ja. Kannst du alles installieren. Aber was ich gerne mache ist"}, {"id": 42, "start": 587.44, "end": 595.4, "text": "ich verwende für diesen Krempel ein Pack. Ja super. Massive. Massive Größe. Ich verwende"}, {"id": 43, "start": 595.4, "end": 604.56, "text": "ein Package Manager für Windows. Ja da ist alles mögliche drinne. Search. GCC. Ich muss"}, {"id": 44, "start": 604.56, "end": 616.0, "text": "mal updaten wieder. Ich meine es ist Windows deswegen ist es nicht schnell. Aber ansonsten"}, {"id": 45, "start": 616.0, "end": 629.64, "text": "gibt es bestimmt komplett fertige C++ Entwicklungs Bundles für Windows. Achso. Wenn du den Microsoft"}, {"id": 46, "start": 629.64, "end": 633.4, "text": "Krempel verwenden willst dann kannst du auch einfach. Das stimmt da habe ich gar nicht"}, {"id": 47, "start": 633.4, "end": 637.2, "text": "dran gedacht. Ja klar. Du kannst doch den Visual Studio Kram installieren mit dem ganzen"}, {"id": 48, "start": 637.2, "end": 641.12, "text": "Microsoft Krempel. Das geht auch. Wahrscheinlich unter Windows sogar die beste Variante."}, {"id": 49, "start": 641.12, "end": 655.32, "text": "RealRenax. Doch hatte ich. Aber das ist nichts geworden. Die haben sich das anders überlegt."}, {"id": 50, "start": 655.32, "end": 658.48, "text": "Also ne. Die haben sich nicht anders überlegt. Die haben gesagt der Termin ändert sich."}, {"id": 51, "start": 658.48, "end": 663.76, "text": "Und dann habe ich gesagt ne zu dem neuen Termin passt das bei mir nicht. Und seitdem habe"}, {"id": 52, "start": 663.76, "end": 675.68, "text": "ich nie wieder was gehört. Ne ne ne. Also Visual Studio ist die Community Community Edition"}, {"id": 53, "start": 675.68, "end": 684.72, "text": "ist free. Welchen Package Manager ich verwende. Scoop. Den da. Es gibt dann auch noch. Es"}, {"id": 54, "start": 684.72, "end": 689.0, "text": "gibt dann auch noch den da. Weiß gar nicht ob ich das installiert habe. Ne. Also der"}, {"id": 55, "start": 689.0, "end": 695.2, "text": "Scoop installiert rein lokal ins Heimatverzeichnis. Der andere System weit. Ich finde das ist mit"}, {"id": 56, "start": 695.2, "end": 703.48, "text": "den Heimat ins Heimatverzeichnis besser. Ja du kannst ohne. Absoluter Crap. Also ich"}, {"id": 57, "start": 703.48, "end": 709.96, "text": "meine mittlerweile mittlerweile ist es benutzbar. Mittlerweile ist es benutzbar. Weil mal gucken"}, {"id": 58, "start": 709.96, "end": 713.52, "text": "was auf GitHub da abgeht. Mittlerweile ist es benutzbar weil sie den Kram wenigstens"}, {"id": 59, "start": 713.52, "end": 727.6, "text": "so eingerichtet haben dass du mittlerweile Software deinstallieren kannst. Aber ganz"}, {"id": 60, "start": 727.6, "end": 732.96, "text": "ehrlich das. Also ich bin nicht sonderlich begeistert von von WinGit. Ich müsste mir"}, {"id": 61, "start": 732.96, "end": 738.2, "text": "es aber mal wieder angucken. Ich muss also das letzte Mal wo ich es mir angeguckt habe"}, {"id": 62, "start": 738.2, "end": 767.04, "text": "ging das deinstallieren von Software noch nicht mal. Mittlerweile geht das aber. Was"}, {"id": 63, "start": 767.04, "end": 777.56, "text": "ich ganz gut mag ist dass es ähnlich ist zu Pacman oder UpGit oder sonst was. Ich müsste"}, {"id": 64, "start": 777.56, "end": 783.28, "text": "ich müsste mir den Kram mal wieder angucken ob das mittlerweile taugt. Ich bin mir halt"}, {"id": 65, "start": 783.28, "end": 789.24, "text": "nicht sicher ob es dort überhaupt genug Packages gibt also sprich welche Sources verwendet"}, {"id": 66, "start": 789.24, "end": 805.64, "text": "das Ding. Müsste man mal ausprobieren. Ah ok. Als letztes Mal hat mich WinGit komplett"}, {"id": 67, "start": 805.64, "end": 814.8, "text": "kalt gelassen. Du könnt mal vielleicht jetzt mal im Stream angucken aber dafür ein extra"}, {"id": 68, "start": 814.8, "end": 818.0, "text": "Stream machen ist glaube ich unsinnig. Das dauert eine halbe Stunde sich das anzugucken"}, {"id": 69, "start": 818.0, "end": 830.2, "text": "mit allem drum und dran und dann ist gut. War gerade eine Chat guckt ihr mal zufällig"}, {"id": 70, "start": 830.2, "end": 839.28, "text": "die Orville Season 3. Ich fand ja Season 1 wirklich richtig gut also Massive Pork. Season"}, {"id": 71, "start": 839.28, "end": 844.4, "text": "2 fand ich zum größten Teil auch ziemlich gut aber die ersten drei Folgen von Season"}, {"id": 72, "start": 844.4, "end": 855.96, "text": "3 finde ich auch wieder richtig gut. Also besseres Star Trek als Star Trek. Also gefällt"}, {"id": 73, "start": 855.96, "end": 865.04, "text": "mir echt gut. Und ich feier wenige Serien so richtig. Ja gibt es aktuell nur auf Englisch"}, {"id": 74, "start": 865.04, "end": 869.24, "text": "kann man aber schon beispielsweise über Amazon oder irgendwelche anderen Stream. Mein Original"}, {"id": 75, "start": 869.24, "end": 875.92, "text": "sind die jetzt irgendwie auf Disney plus oder auf Hulu oder was auch immer. WTF. Wusste"}, {"id": 76, "start": 875.92, "end": 881.76, "text": "ich bis dann nicht mal dass es das überhaupt gibt. Aber man kann sich das auf Amazon angucken."}, {"id": 77, "start": 881.76, "end": 887.52, "text": "Bezahle ich halt zwei Euro pro Folge oder so. Was mir ein bisschen auf den Keks geht ist"}, {"id": 78, "start": 887.52, "end": 892.88, "text": "dass die Folgen halt wieder einmal also jeden Freitag die Woche rauskommen und nicht einfach"}, {"id": 79, "start": 892.88, "end": 903.36, "text": "am Stück aber ja so ist das halt. Manche stehen also auf das Serien Feeling. The Boys habe"}, {"id": 80, "start": 903.36, "end": 909.24, "text": "ich aufgehört zu gucken nach Anfang Staffel 2. Also Staffel 1 fand ich zum größten Teil"}, {"id": 81, "start": 909.24, "end": 915.24, "text": "ziemlich nice. Vom Ende hinher war es ein bisschen langweilig aber der Rest also Staffel"}, {"id": 82, "start": 915.24, "end": 925.88, "text": "2 hat mir dann schon gar nicht mehr großartig gefallen. Aber wie gesagt ich bin da eh. Also"}, {"id": 83, "start": 925.88, "end": 932.84, "text": "es gibt viele Serien die ich gut fand. Eins zwei Staffeln. Und dann kam irgendwas was"}, {"id": 84, "start": 932.84, "end": 938.32, "text": "mir nicht mehr gefallen hatte. Dann hör ich auf zu gucken. Also ich glaube ich hab ganz"}, {"id": 85, "start": 938.32, "end": 962.28, "text": "ganz wenige Sachen wirklich komplett geguckt. Achja. So. Gibt es sonst noch irgendwas Spannendes?"}, {"id": 86, "start": 962.28, "end": 969.28, "text": "Das können wir uns dann angucken. Was gibt's dann? Was haben wir denn? Was haben wir denn"}, {"id": 87, "start": 969.28, "end": 977.52, "text": "noch als Spannendes? Hat sich ein Jahr warten auf das Steam Deck gelohnt? Eher nicht. Which"}, {"id": 88, "start": 977.52, "end": 985.2, "text": "Battlefield Games are dead? Also wirklich dead? Komplett ohne Spieler? Dürfte wahrscheinlich"}, {"id": 89, "start": 985.2, "end": 993.04, "text": "nur die ganz alten sein. So Vietnam und sonst was. Selbst BC2 und so kannst du ab und zu"}, {"id": 90, "start": 993.04, "end": 998.56, "text": "noch ein bisschen spielen. Aber wenn man dead sagt weniger als fünf aktive Server oder"}, {"id": 91, "start": 998.56, "end": 1005.92, "text": "so dann sind das ganz schön viele. Expans hab ich auch geguckt Staffel 1 bis eineinhalb."}, {"id": 92, "start": 1005.92, "end": 1017.68, "text": "Wo sind die Entwickler hin? Ich bin immer noch da."}, {"id": 93, "start": 1017.68, "end": 1041.36, "text": "Battlefield 2042 Geheimnis aufgeklärt."}, {"id": 94, "start": 1041.36, "end": 1052.24, "text": "Was war das gerade? Leute ich hab da beim Refresh und habt ihr es auch gesehen? Ah da"}, {"id": 95, "start": 1052.24, "end": 1059.08, "text": "ist es. Wollte ich gerade sagen ich hab doch irgendwelchen Weep Kram gerade beim Screen"}, {"id": 96, "start": 1059.08, "end": 1065.84, "text": "Refresh gesehen. Die meinen unbedingt dass wir das gucken sollen. Aber ich will jetzt"}, {"id": 97, "start": 1065.84, "end": 1072.8, "text": "nicht den Ventilator Teaser gucken. Das hört sich schon länger ein bisschen geltzwertig"}, {"id": 98, "start": 1072.8, "end": 1085.4, "text": "an. Naja. So. Das schauen wir uns an. Es gibt nicht viel Gescheites. Ne. Und was? Was"}, {"id": 99, "start": 1085.4, "end": 1089.0, "text": "ich diese Woche gesehen hab? Die Doku über die Cyber Polizistin wurde die Woche über"}, {"id": 100, "start": 1089.0, "end": 1093.84, "text": "10 Parts gesplitzt. Ja du meinst über die Cyber Polizistin wo es in dem ganzen Beitrag"}, {"id": 101, "start": 1093.84, "end": 1110.52, "text": "vielleicht eine Minute um Cyber ging? Ne. Neues Video zur E3. Juckt mich so gar nicht"}, {"id": 102, "start": 1110.52, "end": 1119.36, "text": "was auf der E3 passiert ist. War die überhaupt schon? Achja das war das wo sie dieses klar"}, {"id": 103, "start": 1119.36, "end": 1125.32, "text": "das war doch wo sie dieses Open World Sonic gezeigt haben. Wo sich alle weggekackt haben."}, {"id": 104, "start": 1125.32, "end": 1137.16, "text": "Habt ihr das gesehen? Das sah richtig fail aus. Ach das war Summerfest. Ach keine Ahnung."}, {"id": 105, "start": 1137.16, "end": 1141.84, "text": "Juckt mich nicht. Man hat seit Corona gesehen dass Messen eigentlich total overrated outdated"}, {"id": 106, "start": 1141.84, "end": 1147.4, "text": "she baited sind. Die Gamescom war noch nie sinnvoll. Nicht für Spiele. Die Gamescom"}, {"id": 107, "start": 1147.4, "end": 1151.84, "text": "ist vielleicht ein Event für viele wo man vor Ort sich mit Leuten trifft die man lange"}, {"id": 108, "start": 1151.84, "end": 1158.2, "text": "nicht gesehen hat. Also die Gamescom ist für viele eher so ein Real Life Event weniger"}, {"id": 109, "start": 1158.2, "end": 1161.84, "text": "Gaming Messe. Weil Spielen kannst du auf der Gamescom eh vergessen. Das heißt du willst"}, {"id": 110, "start": 1161.84, "end": 1173.44, "text": "3 Stunden anstehen für irgendwas. Und selbst wenn man da im Vorfeld Termine macht. Und"}, {"id": 111, "start": 1173.44, "end": 1178.72, "text": "dass man dann auch Sachen gezeigt bekommt. Selbst dann ist es nicht sonderlich spannend"}, {"id": 112, "start": 1178.72, "end": 1188.64, "text": "oder sinnvoll. Also die Gamescom ist komplett umsonst gewesen. Also nicht preislich. Komplett"}, {"id": 113, "start": 1188.64, "end": 1192.12, "text": "unsinnig gewesen. Deswegen gehe ich da auch schon seit Jahren nicht mehr hin und ob die"}, {"id": 114, "start": 1192.12, "end": 1197.12, "text": "jemals wieder in der alten Form stattfinden wird keine Ahnung. Mal gucken wie es dieses"}, {"id": 115, "start": 1197.12, "end": 1200.6, "text": "Jahr wird. Es soll ja dieses Jahr genau das habe ich auch. Also es soll ja dieses Jahr"}, {"id": 116, "start": 1200.6, "end": 1204.96, "text": "ganz normal stattfinden. Ich bin mal gespannt in welchem Umfang und wie das ist. Ob das"}, {"id": 117, "start": 1204.96, "end": 1213.76, "text": "dann wieder wie vor Corona ist oder nicht. Da sind sie aber selbst dran schuld wenn sie"}, {"id": 118, "start": 1213.76, "end": 1221.48, "text": "so einen Müll vorstellen oder? Ich mein dann muss man sich ja nicht den Leuten überlassen"}, {"id": 119, "start": 1221.48, "end": 1226.4, "text": "sich das zusammen zu reimen. Sondern könnte einfach was ordentliches zeigen. Oder man"}, {"id": 120, "start": 1226.4, "end": 1240.88, "text": "lässt es halt bleiben und zeigt was ordentliches wenn man was ordentliches zeigen kann. Ich"}, {"id": 121, "start": 1240.88, "end": 1247.72, "text": "muss sagen es waren die letzten Jahre so wenige AAA Spiele dabei auf die ich mich A gefreut"}, {"id": 122, "start": 1247.72, "end": 1252.48, "text": "habe und B als sie dann rausgekommen sind auch wirklich was getaugt haben. Also das"}, {"id": 123, "start": 1252.48, "end": 1259.2, "text": "letzte negativ Beispiel was mir dazu einfällt ist einfach Battlefield 2042. Da habe ich"}, {"id": 124, "start": 1259.2, "end": 1263.96, "text": "mich nachdem nachdem es so die ersten Sachen gab habe ich mich mega drauf gefreut und"}, {"id": 125, "start": 1263.96, "end": 1268.0, "text": "habe gesagt endlich mal wieder was modernes Battlefield Technik. Ich habe ja auch Videos"}, {"id": 126, "start": 1268.0, "end": 1277.36, "text": "zugemacht. Das sieht auch gut aus was man gesehen hat. Aber es wurde halt komplett verschissen."}, {"id": 127, "start": 1277.36, "end": 1286.84, "text": "Ich habe ja damals als sie den Trailer hatten hatte ich ja mit dem Lost. Da haben wir zwei"}, {"id": 128, "start": 1286.84, "end": 1292.36, "text": "drei Stunden uns darüber ausgelassen und haben das besprochen wie man beide übelst"}, {"id": 129, "start": 1292.36, "end": 1296.8, "text": "gehyped hat drauf. Und man muss sagen die einzige Abteilung die wirklich einen richtig"}, {"id": 130, "start": 1296.8, "end": 1302.76, "text": "guten Job gemacht hat bei Battlefield 2042 ist die Marketing Abteilung. Die haben es"}, {"id": 131, "start": 1302.76, "end": 1308.28, "text": "drauf gehabt. Also zumindest am Anfang. Mittlerweile ja auch nicht mehr. Was gibt es da gibt es"}, {"id": 132, "start": 1308.28, "end": 1312.96, "text": "ja auch ein wenig noch schön zu reden. Aber alles was dann aber was ich witzig fand."}, {"id": 133, "start": 1312.96, "end": 1319.4, "text": "Wir haben es lustigerweise in dem Stream damals sogar schon damals sogar schon gesagt. So"}, {"id": 134, "start": 1319.4, "end": 1324.08, "text": "nach dem Motto Alter alles mega geil. Sonst wie kann sich am Ende trotzdem wie kurze spielen"}, {"id": 135, "start": 1324.08, "end": 1345.92, "text": "und wir hatten recht. Es spielt sich am Ende wie kurze. Es geht wahrscheinlich Waffen sind"}, {"id": 136, "start": 1345.92, "end": 1351.28, "text": "nicht mehr in mein Amis. Die stehen da immer noch drauf Waffen daheim zu haben. Aber in"}, {"id": 137, "start": 1351.28, "end": 1356.2, "text": "den letzten Jahren hat man gesehen dass viel mehr Games weggehen davon realistische Waffen"}, {"id": 138, "start": 1356.2, "end": 1360.84, "text": "im Spiel darzustellen. Also ich rede jetzt nicht von Schwertern und Äxten und sowas."}, {"id": 139, "start": 1360.84, "end": 1366.28, "text": "Das letzte hast du auch gesehen. Das wieder dass sie dann angefangen haben jetzt in Battlefield"}, {"id": 140, "start": 1366.28, "end": 1374.2, "text": "2042 die Waffen nachzubauen aber den anderen Namen zu geben und sowas. Okay wahrscheinlich"}, {"id": 141, "start": 1374.2, "end": 1379.08, "text": "ist es viel schneller. Eisfliegt. Danke. Danke für den Zap. Ich brauche übrigens unbedingt"}, {"id": 142, "start": 1379.08, "end": 1388.68, "text": "mal neue. Echt tatsächlich. Ich hätte gedacht das ist deutlich weniger. Ich brauche unbedingt"}, {"id": 143, "start": 1388.68, "end": 1394.48, "text": "wieder neue Subscriber Dinger. Ich meine du bekommst glaube ich den nach einem Jahr bekommst"}, {"id": 144, "start": 1394.48, "end": 1399.6, "text": "du den goldenen Keks mit mit Halskette. Habt ihr eine gute Idee was man noch machen kann."}, {"id": 145, "start": 1399.6, "end": 1406.28, "text": "Ansonsten muss ich mal in mich gehen. Man könnte man könnte den sicherlich noch noch"}, {"id": 146, "start": 1406.28, "end": 1430.36, "text": "ausbauen. Den Gold Keks. Eine Knarre. Ein Hut in Hut. Das das Problem ist Hut kann man"}, {"id": 147, "start": 1430.36, "end": 1435.92, "text": "nicht machen. Also wisst ihr dass das tatsächlich ziemlich fai fertig ist solche Dinger zu"}, {"id": 148, "start": 1435.92, "end": 1442.08, "text": "designen. Weil dem kannst du beispielsweise kein Hut aufsetzen dem Keks warum. Weil wenn"}, {"id": 149, "start": 1442.08, "end": 1450.04, "text": "man einen Hut nimmt. Wenn man einen Hut nimmt. Dieses Bild ist immer das gleiche Seitenverhältnis"}, {"id": 150, "start": 1450.04, "end": 1454.36, "text": "wenn man einen Hut nimmt dann nimmt das hier oben die Ecke weg und der ganze Keks wird"}, {"id": 151, "start": 1454.36, "end": 1458.32, "text": "kleiner weil das Seitenverhältnis von dem Bild gleich bleibt und du erkennst den Keks"}, {"id": 152, "start": 1458.32, "end": 1462.68, "text": "nicht mehr. Also du kannst eigentlich nur was machen was du an diesem Keks selbst machst"}, {"id": 153, "start": 1462.68, "end": 1467.32, "text": "du kannst nichts um diesen Keks machen. Deswegen gibt es hier auch keinen mit Headset weil"}, {"id": 154, "start": 1467.32, "end": 1476.96, "text": "das weil das kacke aussieht in klein. Ja genau also es ist gar nicht so gar nicht so einfach"}, {"id": 155, "start": 1476.96, "end": 1485.64, "text": "sowas zu designen. Die Augenfarbe kann man zum Beispiel machen oder Keksfarbe oder was"}, {"id": 156, "start": 1485.64, "end": 1490.56, "text": "der um den Hals hat oder vielleicht was er was in der Hand hat oder vielleicht hier oben"}, {"id": 157, "start": 1490.56, "end": 1495.64, "text": "so ein Stirnband keine Ahnung irgendwie so aber du kannst ansonsten kannst du nichts"}, {"id": 158, "start": 1495.64, "end": 1506.48, "text": "machen das muss. Ghostface. Ja das könnte sowas so Dinger Sonnenbrille ja tatsächlich"}, {"id": 159, "start": 1506.48, "end": 1513.84, "text": "ja ja genau genau das das geht natürlich auch sowas es ist tatsächlich nicht so einfach."}, {"id": 160, "start": 1513.84, "end": 1543.44, "text": "Klar am Mittag war es hoch. Ich habe jetzt jemand der mir Stream Highlights zusammenschneidet"}, {"id": 161, "start": 1543.44, "end": 1549.36, "text": "richtig gut finde ich. Es haben ja schon ein paar Leute Probe geguckt manche haben gesagt"}, {"id": 162, "start": 1549.36, "end": 1553.4, "text": "Cringe Humor wobei ich es gar nicht so schlimm finde ich finde es passt eigentlich ziemlich"}, {"id": 163, "start": 1553.4, "end": 1559.28, "text": "gut aber die meisten fanden es gut. Ich bin mal gespannt das ist nämlich eine super Alternative"}, {"id": 164, "start": 1559.28, "end": 1563.2, "text": "dass ich weil ich bin jetzt ja nicht gerade die krasse Contentmaschine was YouTube Videos"}, {"id": 165, "start": 1563.2, "end": 1568.28, "text": "angeht ich mache alle keine Ahnung 14 Tage in einem Video oder so aktuell oder wenn was"}, {"id": 166, "start": 1568.28, "end": 1574.68, "text": "ist und es gibt doch im Stream ab und an die ein oder anderen interessanten Dinger was"}, {"id": 167, "start": 1574.68, "end": 1578.72, "text": "wir uns mal angucken wo wir uns mal darüber auslassen und wenn das jemand zusammenschneidet"}, {"id": 168, "start": 1578.72, "end": 1588.0, "text": "von meinem 45 Minuten Stunden Gelaber zu unter 10 Minuten ist das finde ich recht unterhaltsam"}, {"id": 169, "start": 1588.0, "end": 1594.44, "text": "das können wir uns ja am Mittag angucken also was heißt wir wir nicht also ihr könnt euch"}, {"id": 170, "start": 1594.44, "end": 1597.48, "text": "das angucken wenn ich hochgeladen habe. Die meisten Leute die öfters im Stream dabei"}, {"id": 171, "start": 1597.48, "end": 1603.24, "text": "sind vielleicht sogar dabei wo ich es erzählt habe aber wir mal gucken. Das ist ja kein"}, {"id": 172, "start": 1603.24, "end": 1607.28, "text": "Ersatz für irgendwie Content ansonsten gäbe es einfach kein Content bis man wieder danach"}, {"id": 173, "start": 1607.28, "end": 1612.52, "text": "ist alle zwei bis drei Wochen ein Video aufzunehmen so gibt es vielleicht öfters mal was und"}, {"id": 174, "start": 1612.52, "end": 1625.16, "text": "ich finde das richtig gut geschnitten. So YouTube letzte Chance. Letzte Chance empfehlt mir"}, {"id": 175, "start": 1625.16, "end": 1651.76, "text": "was gescheites. Wo wollte es das so. Das schrecklichste Release der Playstation 3. Ach so die ja gut"}, {"id": 176, "start": 1651.76, "end": 1660.92, "text": "also eines der schlimmsten Sachen was Konsolen Ankündigungen angeht fand ich immer noch"}, {"id": 177, "start": 1660.92, "end": 1667.64, "text": "die Xbox One. Also die Xbox One das war so how to verkacken any percent also das war"}, {"id": 178, "start": 1667.64, "end": 1678.04, "text": "kompletter Schwachsinn. Erinnert ihr euch noch. Erinnert ihr euch noch dran als die war"}, {"id": 179, "start": 1678.04, "end": 1683.32, "text": "der Xbox One Präsentation ernsthaft irgendwelche Football Games oder Basketball ich glaube"}, {"id": 180, "start": 1683.32, "end": 1688.52, "text": "Football war es irgendwelche Football Games gezeigt haben und dann erzählt haben wie geil"}, {"id": 181, "start": 1688.52, "end": 1694.4, "text": "das ist dass man sich im Auferlei einblenden kann auf der Xbox One für die Football Games"}, {"id": 182, "start": 1694.4, "end": 1713.76, "text": "und da haben halt alle sich gedacht. Ja ok. Kikona Staff. TV TV. Ja genau. Wo ich immer"}, {"id": 183, "start": 1713.76, "end": 1719.08, "text": "noch nicht gecheckt habe was zum Teufel haben die da getrieben und sich gedacht was geht"}, {"id": 184, "start": 1719.08, "end": 1727.44, "text": "da. Wie schnell das Geld mit Fishing weg ist. Ok der NDR Ratgeber erklärt uns das. Aber"}, {"id": 185, "start": 1727.44, "end": 1737.48, "text": "17 Minuten. Irgendwann. So da hinten so. Ich mein für irgendwas muss ich ja meine Gebühren"}, {"id": 186, "start": 1737.48, "end": 1752.52, "text": "bezahlen. So viel kriegen YouTuber. Ach gibt's mal wieder hier. Ich habe alle Placements"}, {"id": 187, "start": 1752.52, "end": 1769.92, "text": "angenommen. Das war gar nicht schlecht das Video. Das letzte fand ich eigentlich ganz"}, {"id": 188, "start": 1769.92, "end": 1789.68, "text": "gut. Cave Exploring Gone Wrong. Alles klar. Der Kerle ist immer noch am Tunnelgraben."}, {"id": 189, "start": 1789.68, "end": 1793.44, "text": "Das haben wir doch vor einem Jahr zuletzt geguckt. Wir haben doch vor einem Jahr oder"}, {"id": 190, "start": 1793.44, "end": 1799.0, "text": "so mal ein Video von ihm geguckt. Wo er angefangen hat den Tunnel zu buddeln. Ok so ein Tunnel"}, {"id": 191, "start": 1799.0, "end": 1818.64, "text": "buddelt sich wahrscheinlich nicht so easy einfach mal so. Dauert wohl eine Weile. Na gut."}, {"id": 192, "start": 1818.64, "end": 1828.24, "text": "Kauf zwei dann hast du eine. Wie man muss zwei Packages kaufen dass man eine Pyramide"}, {"id": 193, "start": 1828.24, "end": 1844.0, "text": "bekommt. Wirklich. Das ist ja Massive 5 Fett Geld machen. 5 Fett Money Makin. Windows Defender"}, {"id": 194, "start": 1844.0, "end": 1852.08, "text": "now available for all platforms. Das ist doch jetzt schon. Ok auf iOS. Also wir haben auf"}, {"id": 195, "start": 1852.08, "end": 1859.52, "text": "unsere Linux Server schon lange. Microsoft Advanced Threat Protection. Ich finde es mega"}, {"id": 196, "start": 1859.52, "end": 1862.92, "text": "beschissen und ich habe das an einigen Stellen auch schon gesagt. Aber alle sagen sich ja"}, {"id": 197, "start": 1862.92, "end": 1868.76, "text": "aber Security das muss sein. Wir brauchen Advanced Threat Protection auf allen Linux"}, {"id": 198, "start": 1868.76, "end": 1874.72, "text": "Systemen. Das Ding also wir hatten dadurch noch keinen Vorteil wir hatten bisher nur Nachteile."}, {"id": 199, "start": 1874.72, "end": 1880.96, "text": "Wusstet ihr eigentlich das Microsoft die Advanced Threat Protection live patchen kann. Also"}, {"id": 200, "start": 1880.96, "end": 1891.12, "text": "damit hat quasi Microsoft ein Backdoor auf jedem deiner Server. Also der Windows Defender"}, {"id": 201, "start": 1891.12, "end": 1897.04, "text": "patcht sich live angeblich irgendwelche Updates allerdings können die nicht nur Updates patchen"}, {"id": 202, "start": 1897.04, "end": 1901.56, "text": "sondern auch wirklich Funktionen am Defender. Das heißt sobald du Windows Advanced Threat"}, {"id": 203, "start": 1901.56, "end": 1906.08, "text": "Protection auf deinem Linux Server drauf hast hast du effektiv ein Microsoft Backdoor auf"}, {"id": 204, "start": 1906.08, "end": 1912.6, "text": "deiner Kiste. Also was auch wer diesen Scheiß ernsthaft installiert und wer im Management"}, {"id": 205, "start": 1912.6, "end": 1918.64, "text": "diesen Schwachsinn entscheidet das kann ich nicht nachvollziehen. Passwörter mittlich"}, {"id": 206, "start": 1918.64, "end": 1923.0, "text": "zu dem Klartext speichern. Ja das hatten wir auch schon. Wie gesagt ich habe schon Passwörter"}, {"id": 207, "start": 1923.0, "end": 1931.6, "text": "im Klartext in irgendwelchen Defender Logs gefunden. Ok komm gucken wir gleich erstmal"}, {"id": 208, "start": 1931.6, "end": 1940.12, "text": "erstmal den Level Cap Gbait. Leute der tägliche, jährliche, monatliche, wöchentliche Level"}, {"id": 209, "start": 1940.12, "end": 1947.52, "text": "Cap Gbait. Das muss sein. Lass uns mal Level Cap Gbaiten. Hast du das Drama um Googles"}, {"id": 210, "start": 1947.52, "end": 1956.0, "text": "AI mitbekommen? Ne was war? Was war das Drama? Was war das Drama um Googles AI? Hab ich"}, {"id": 211, "start": 1956.0, "end": 1962.92, "text": "nicht mitbekommen. Ich kann mich noch an das Drama über Microsofts Nazi AI erinnern."}, {"id": 212, "start": 1962.92, "end": 1977.12, "text": "Weiß das noch jemand? Microsoft hat mal ein Twitter Bot gemacht. Was ist das denn hier?"}, {"id": 213, "start": 1977.12, "end": 1982.0, "text": "Microsoft hat mal ein Twitter Bot rausgebracht der lernen sollte wie man auf Twitter eben"}, {"id": 214, "start": 1982.0, "end": 1987.92, "text": "mit Leuten kommuniziert. Genau genau dieses Ding meine ich. Also Microsoft hat mal einen"}, {"id": 215, "start": 1987.92, "end": 1992.08, "text": "Bot auf Twitter rausgebracht der aus Twitter lernen soll wie man auf Twitter kommuniziert."}, {"id": 216, "start": 1992.08, "end": 1997.52, "text": "Das Problem war dass der nach ein paar Tagen nur noch Nazi Kommentare und rechtsextreme"}, {"id": 217, "start": 1997.52, "end": 2007.36, "text": "Sachen gepaustet hat. Also da denkt man sich auch Alter. Das hätten die sich auch denken"}, {"id": 218, "start": 2007.36, "end": 2013.44, "text": "können. Weil ganz im Ernst, dass die Leute wenn die das mitbekommen nicht normal diesen"}, {"id": 219, "start": 2013.44, "end": 2020.64, "text": "Bot antworten. Mich würd's nicht wundern wenn da 4chan wieder dran beteiligt war im Zweifelsfall."}, {"id": 220, "start": 2020.64, "end": 2025.84, "text": "Hat Chatbot Lambda ein Bewusstsein entwickelt? Okay lass mal abkürzen. Wahrscheinlich nicht."}, {"id": 221, "start": 2025.84, "end": 2054.4, "text": "Google Burlaub Angestellten. Aha. Weil bei Google niemand diese Überzeugung geteilt"}, {"id": 222, "start": 2054.4, "end": 2071.84, "text": "hat. Alter die haben alle Dachschaden man. Was zum Teufel hat es denn jetzt mit religiösen"}, {"id": 223, "start": 2071.84, "end": 2076.0, "text": "Überzeugungen zu tun? Also sprich er behauptet, nur dass ich das mal richtig verstehe. Er"}, {"id": 224, "start": 2076.0, "end": 2086.0, "text": "behauptet sein Chatbot hätte Self-Awareness entwickelt und bei Google sagen alle andere"}, {"id": 225, "start": 2086.0, "end": 2090.52, "text": "die das sehen, nee kann nicht sein du hast doch nicht mehr alle. Und dann sagt er ja"}, {"id": 226, "start": 2090.52, "end": 2094.44, "text": "das macht nix ich muss einfach nur dran glauben und hat sich jetzt darüber beschwert dass"}, {"id": 227, "start": 2094.44, "end": 2103.12, "text": "man ihn diskriminieren würde weil. Hä? Das ist auch wieder was was nur im Jahr 2022 passieren"}, {"id": 228, "start": 2103.12, "end": 2112.64, "text": "kann. Wahrscheinlich. Der Alkohol muss wohl mit aber."}, {"id": 229, "start": 2133.12, "end": 2148.16, "text": "Okay. Stattdessen hätten sie wiederholen seine Gesundheit in Frage gestellt. Ja kann"}, {"id": 230, "start": 2148.16, "end": 2155.52, "text": "ich mir schon vorstellen dass da einige Dachschaden haben. Also ich tendiere ich tendiere in dem"}, {"id": 231, "start": 2155.52, "end": 2161.36, "text": "Fall auch ob ohne ohne diesen Chatbot zu kennen. Ich tendiere auch eher zu dass der Kerl im"}, {"id": 232, "start": 2161.36, "end": 2183.24, "text": "Dachschaden hat. Da bin ich mal gespannt was da noch raus kommt. Mittlerweile sind Bots"}, {"id": 233, "start": 2183.24, "end": 2189.24, "text": "eh schon an der an der Grenze das wo man sich fragt. Hat das nicht vielleicht doch"}, {"id": 234, "start": 2189.24, "end": 2194.56, "text": "irgendein Mensch gemacht? Also auch die wie heißt diese Übersetze wie heißt diese Übersetzungsseite?"}, {"id": 235, "start": 2194.56, "end": 2205.04, "text": "War das Dieb L? Ich weiß nicht. Das ist auch ziemlich gut mittlerweile. Ja das ist das ist"}, {"id": 236, "start": 2205.04, "end": 2209.16, "text": "auch das ist auch ziemlich gut mittlerweile und ich gehe auch davon aus dass man das"}, {"id": 237, "start": 2209.16, "end": 2220.28, "text": "in ein paar Jahren nur noch äußerst schwer auseinanderhalten kann. Aber gerade was Übersetzung"}, {"id": 238, "start": 2220.28, "end": 2232.32, "text": "angeht fände ich das POG. Wisst ihr was was ich finde man ist in manchen Bereichen sind"}, {"id": 239, "start": 2232.32, "end": 2237.6, "text": "wir deutlich besser in dem was man sich also zu dem was man sich in irgendwelchen Science"}, {"id": 240, "start": 2237.6, "end": 2241.76, "text": "Fiction Filmen vorgestellt hat für in 300 Jahren sind wir jetzt schon besser und in"}, {"id": 241, "start": 2241.76, "end": 2245.28, "text": "manchen Bereichen haben wir noch gar nichts auf die Reihe gekriegt. Ja zum Beispiel wenn"}, {"id": 242, "start": 2245.28, "end": 2249.68, "text": "man sich mal ältere Science Fiction Filme anguckt da hatten die ja auch immer irgendwelche"}, {"id": 243, "start": 2249.68, "end": 2255.8, "text": "Kommunikator Devices wo sie dann halt ich sage mal gefunkt haben und oder kommuniziert"}, {"id": 244, "start": 2255.8, "end": 2260.84, "text": "haben und diese Dinger sind alle um ein Vielfaches schlechter und und klobischer und größer"}, {"id": 245, "start": 2260.84, "end": 2268.96, "text": "und und ja in allen belangen schlechter als irgendwo modernes Smartphone. Also da sind"}, {"id": 246, "start": 2268.96, "end": 2273.24, "text": "wir deutlich besser als ich das noch Science Fiction Sendungen von vor 30 Jahren vorstellen"}, {"id": 247, "start": 2273.24, "end": 2291.84, "text": "konnten aber in anderen Bereichen gar nicht. Ja das wundert mich nicht. Bei uns ist es"}, {"id": 248, "start": 2291.84, "end": 2296.72, "text": "so wir haben eine Zeiterfassungs Software die hatte bis vor ein paar Versionen stand da"}, {"id": 249, "start": 2296.72, "end": 2310.04, "text": "immer noch drinnen wenn du die gestartet hast optimiert für Microsoft Internet Explorer."}, {"id": 250, "start": 2310.04, "end": 2323.32, "text": "Wisst ihr was ich bei manchen Moment das muss ich euch mal zeigen Internet off shit. Internet"}, {"id": 251, "start": 2323.32, "end": 2335.32, "text": "off shit. Da gibt es teilweise Bilder von hier guckt mal Elektro. Manche modernen Autos"}, {"id": 252, "start": 2335.32, "end": 2339.36, "text": "musst du jetzt Updates machen also du kannst nicht einfach mit deinem Auto fahren du musst"}, {"id": 253, "start": 2339.36, "end": 2343.2, "text": "jetzt einfach 15 Minuten neben stehen bleiben und warten bis das Software Update durch ist."}, {"id": 254, "start": 2343.2, "end": 2348.6, "text": "Also das ist was was mir persönlich ja irgendwie wieder strebt. Also wenn ich schon ein Auto"}, {"id": 255, "start": 2348.6, "end": 2353.32, "text": "habe dann möchte ich das mit dem Auto auch exakt dann benutzen können wann ich will und"}, {"id": 256, "start": 2353.32, "end": 2359.08, "text": "der das man Software Updates machen kann und sollte ist ja alles in Ordnung. Aber wenn"}, {"id": 257, "start": 2359.08, "end": 2365.08, "text": "schon wenn ich wenn schon wenn ich nicht drinnen bin oder aber dass ich sagen kann nein ich"}, {"id": 258, "start": 2365.08, "end": 2372.28, "text": "fahre jetzt erstmal. Das ist halt echt schon heftig wenn du dir überlegst so nach dem"}, {"id": 259, "start": 2372.28, "end": 2376.12, "text": "Motto ich will jetzt mit dem Auto losfahren und dann nein du fährst nicht los du machst"}, {"id": 260, "start": 2376.12, "end": 2391.8, "text": "jetzt erstmal ein Update. Ja sollte auch so sein das kann nicht sein dass du da warten"}, {"id": 261, "start": 2391.8, "end": 2397.68, "text": "musst aber trotzdem also was ist wirklich richtig hier hingeblieben. Toaster mit Homescreen"}, {"id": 262, "start": 2397.68, "end": 2404.4, "text": "ja warum nicht. Nicht jedes Gerät was man smart machen kann macht man smart damit indem"}, {"id": 263, "start": 2404.4, "end": 2409.32, "text": "man ein Display dran pappt das ist auch so ein Ding guck mal. Ich vermute mal dass es"}, {"id": 264, "start": 2409.32, "end": 2415.4, "text": "äußerst sinnlos ist dass dieser Toaster quasi ein Homescreen hat. Man könnte guckt euch"}, {"id": 265, "start": 2415.4, "end": 2422.4, "text": "ok bestes Beispiel Kühlschränke. Es gäbe so viele coole Möglichkeiten Kühlschränke"}, {"id": 266, "start": 2422.4, "end": 2430.92, "text": "smart zu machen. Die könnten verschiedene Fächer haben man könnte das automatisch wiegen"}, {"id": 267, "start": 2430.92, "end": 2438.04, "text": "dass du den Stand weißt. Man könnte Codes scannen man könnte Analyse machen AI technisch"}, {"id": 268, "start": 2438.04, "end": 2442.28, "text": "was da drinnen ist was man denn als nächstes wieder macht. Man könnte unglaublich viel"}, {"id": 269, "start": 2442.28, "end": 2450.12, "text": "machen an Kühlschränken um die zu verbessern aber was zum größten Teil gemacht wird ist"}, {"id": 270, "start": 2450.12, "end": 2457.68, "text": "man pappt ein Display vorne an den Kühlschrank und sagt das ist ein smarter Kühlschrank"}, {"id": 271, "start": 2457.68, "end": 2461.12, "text": "oder noch schlimmer man macht eine Kamera in den Kühlschrank und sagt ja das ist jetzt"}, {"id": 272, "start": 2461.12, "end": 2466.6, "text": "ein smarter Kühlschrank. Auf der anderen Seite gäbe es vieles und ich habe das in Kombination"}, {"id": 273, "start": 2466.6, "end": 2485.92, "text": "so noch nicht gesehen. Gerade was was Codes scannen kann und sowas. Der hat während der"}, {"id": 274, "start": 2485.92, "end": 2499.76, "text": "Fahrt ein Update gemacht ja nice. So was wobei ich denke dass es das teilweise sogar"}, {"id": 275, "start": 2499.76, "end": 2502.8, "text": "schon geben könnte aber wenn nicht ist das auch was. Wie gesagt was ich halt meine ist"}, {"id": 276, "start": 2502.8, "end": 2506.92, "text": "man macht den Kühlschrank nicht dadurch smart weil man einfach ein Display dran pappt oder"}, {"id": 277, "start": 2506.92, "end": 2514.12, "text": "eine Kamera rein packt oder sowas. Das ist unsinnig. Zumal ich auch der Meinung bin wenn"}, {"id": 278, "start": 2514.12, "end": 2526.92, "text": "du wirklich gute smarte Heim Elektronik Geräte bauen willst sei es ein Kühlschrank sei es"}, {"id": 279, "start": 2526.92, "end": 2535.08, "text": "meinetwegen auch ein Toaster oder eine Waschmaschine das wichtigste für mich ist nicht dass die"}, {"id": 280, "start": 2535.08, "end": 2542.0, "text": "irgendwie eine Hersteller App für Smartphone haben die geil aussieht und ist das nur damit"}, {"id": 281, "start": 2542.0, "end": 2547.92, "text": "funktioniert. Wichtig ist dass das die Möglichkeit hat in irgendeiner Art und Weise mit offenen"}, {"id": 282, "start": 2547.92, "end": 2554.68, "text": "Schnittstellen darauf zuzugreifen. Weil so ein Kühlschrank hast du 10-15 Jahre. Sag"}, {"id": 283, "start": 2554.68, "end": 2558.08, "text": "jetzt einfach mal warum sollst du den Kühlschrank austauschen wenn der Kühlschrank geht halt"}, {"id": 284, "start": 2558.08, "end": 2561.92, "text": "einfach und wenn er kaputt ist tauscht ihn aus ansonsten behältst ihn bis er verreckt."}, {"id": 285, "start": 2561.92, "end": 2568.88, "text": "Und dass diese Smartphone App in 5 Jahren schon nicht mehr funktioniert ist relativ"}, {"id": 286, "start": 2568.88, "end": 2575.6, "text": "hoch beziehungsweise dass die keine Updates mehr bekommen ist relativ hoch und man möchte"}, {"id": 287, "start": 2575.6, "end": 2581.48, "text": "vielleicht die dann auch anderweitig integrieren also es ist wichtig dass man möglichst simpel"}, {"id": 288, "start": 2581.48, "end": 2587.92, "text": "auf diese smarten Geräte zugreifen kann. Sei es eine Web Schnittstelle sei es MQTT das"}, {"id": 289, "start": 2587.92, "end": 2594.28, "text": "einfachste dürfte tatsächlich sein man macht eine ganz normale Schnittstelle eine ganz"}, {"id": 290, "start": 2594.28, "end": 2599.72, "text": "normale Web Schnittstelle wo man sich Sachen abrufen kann. Weil eins ist sicher normale"}, {"id": 291, "start": 2599.72, "end": 2610.32, "text": "Getrequests Http Getrequests die sind auch in 30 Jahren noch angesagt. Aber da haben"}, {"id": 292, "start": 2610.32, "end": 2616.96, "text": "die Hersteller keinen Bock drauf besser eigene App. Ja dass es den Herstellern vorschreibt"}, {"id": 293, "start": 2616.96, "end": 2619.96, "text": "ist klar aber ich glaube deswegen ist eines der Gründe warum es jetzt nicht durchsetzt."}, {"id": 294, "start": 2619.96, "end": 2630.2, "text": "Ok und warum haben wir sie nicht wenn wir sie jetzt schon haben könnten. Wenn es sich"}, {"id": 295, "start": 2630.2, "end": 2635.28, "text": "lohnen würde sowas jetzt herzustellen würde man das doch machen. Da muss jemand diese"}, {"id": 296, "start": 2635.28, "end": 2640.28, "text": "Robbe. Kennt ihr diese Robbe aus japanischen Altersheimen die man da streicheln kann diese"}, {"id": 297, "start": 2640.28, "end": 2646.8, "text": "weiße Robbe. Kannste ja jetzt schon machen. Machst eine Websocket Verbindung und da drüber"}, {"id": 298, "start": 2646.8, "end": 2651.84, "text": "dann dein Get. War da kein richtiges Get aber du kannst ja über Websockets denken. Theoretisch"}, {"id": 299, "start": 2651.84, "end": 2658.16, "text": "kannst du Http über Websockets machen wenn man das will. Wüsste nicht genau warum aber"}, {"id": 300, "start": 2658.16, "end": 2666.92, "text": "man kann das machen ja. Ja also können wir es doch nicht machen weil solang es die Technik"}, {"id": 301, "start": 2666.92, "end": 2672.08, "text": "nicht gibt. Gut das kannst du zu allem sagen dass es im Prinzip nur eine Geldfrage ist"}, {"id": 302, "start": 2672.08, "end": 2678.36, "text": "ja. Also das ist nahezu alles nur eine Geld und Zeitfrage. Wir könnten jetzt auch schon"}, {"id": 303, "start": 2678.36, "end": 2683.88, "text": "auf dem Mars sein hätten wir da vor 60 Jahren weiter gemacht mit sehr viel Geld und sehr"}, {"id": 304, "start": 2683.88, "end": 2693.4, "text": "viel Manpower und sehr viel Zeit. Es ist halt immer eine Frage der Sinnhaftigkeit. Eine"}, {"id": 305, "start": 2693.4, "end": 2703.92, "text": "Fress Schnittstelle. Selbst wenn der Kühlschrank mit Soap XML funktioniert ist auch ok. Hauptsache"}, {"id": 306, "start": 2703.92, "end": 2712.68, "text": "irgendwelche offenen Schnittstellen wo man drauf zugreifen kann. Also darauf wird es"}, {"id": 307, "start": 2712.68, "end": 2719.2, "text": "definitiv rauslaufen. Also eins kann ich euch sagen wenn neue Technologie sich in einem"}, {"id": 308, "start": 2719.2, "end": 2726.4, "text": "Bereich durchsetzt dann ist es bei Porn. So wie man das bei VHS gesehen hat wie man das"}, {"id": 309, "start": 2726.4, "end": 2736.0, "text": "bei Blu-Rays und vor allem bei VR gesehen hat. Es ist immer so. Und wenn es die Möglichkeit"}, {"id": 310, "start": 2736.0, "end": 2746.16, "text": "gibt Webroboter zu bauen dann gibt es die als erstes. Das erste was es geben wird sind"}, {"id": 311, "start": 2746.16, "end": 2755.28, "text": "irgendwelche Anime Weep Porn Roboter. Ich sage es euch. Man will es nicht wahr haben"}, {"id": 312, "start": 2755.28, "end": 2768.6, "text": "aber so wird es sein. So wird es sein wie bei vielen anderen Technologien auch. Gibt"}, {"id": 313, "start": 2768.6, "end": 2779.92, "text": "es Stauksauber Roboter und Meh Roboter. Das stimmt auch wieder. Ich weiß halt nicht ob"}, {"id": 314, "start": 2779.92, "end": 2787.6, "text": "humane Roboter überhaupt das Ding ist. Was wäre denn jetzt der Vorteil davon wenn du"}, {"id": 315, "start": 2787.6, "end": 2793.16, "text": "einen Roboter hast der mit dem Rasenmäher durch deinen Garten fährt anstatt ein Meh"}, {"id": 316, "start": 2793.16, "end": 2809.88, "text": "Roboter. Außer dass es Weird Champ aussieht. Fabestorm danke für den Sub. Na ja was gucken"}, {"id": 317, "start": 2809.88, "end": 2817.88, "text": "wir uns jetzt an zeig mal her. Ja das ist ein Gebiet da haben wir eh große Probleme"}, {"id": 318, "start": 2817.88, "end": 2824.84, "text": "in Zukunft. Hauptsächlich weil es wahrscheinlich außer Roboter keiner mehr machen will. Also"}, {"id": 319, "start": 2824.84, "end": 2829.64, "text": "komm wir lassen uns eine Runde Level Capture Baiten. Level Capture Bait ist real. Battle"}, {"id": 320, "start": 2829.64, "end": 2835.08, "text": "Feast finally adds Fanfavorite Mode. Oh finally. Finally gibt es irgendwas warum man das Spiel"}, {"id": 321, "start": 2835.08, "end": 2841.08, "text": "mal wieder länger als 2 Stunden spielen sollte. Inklusive Addon. Weil wisst ihr wie lange"}, {"id": 322, "start": 2841.08, "end": 2847.12, "text": "ich das Addon gespielt habe. Addon die Season 1. Ich habe es gespielt für mein Video 5"}, {"id": 323, "start": 2847.12, "end": 2850.96, "text": "Runden oder so. Und ich habe es hier im Stream 5 Runden gespielt. Ich habe 10 Runden insgesamt"}, {"id": 324, "start": 2850.96, "end": 2854.52, "text": "gespielt und es wieder uninstalled. Fertig. Weil ich gar nicht weiß ob ich uninstalled"}, {"id": 325, "start": 2854.52, "end": 2865.88, "text": "habe aber ich werde es uninstallen. So bald wozu. Fertig. So. Achja. Big Changes. Big Changes"}, {"id": 326, "start": 2865.88, "end": 2872.12, "text": "bei DICE bedeutet sie sind in eine Textdatei gegangen und haben zeig mal die Spielerzahlen."}, {"id": 327, "start": 2872.12, "end": 2876.92, "text": "Ja mach ich. Mach ich. Sie sind in eine Textdatei gegangen aber vorne mal schnell New World"}, {"id": 328, "start": 2876.92, "end": 2886.92, "text": "Lurken. Ah nice. Haha das ist auch geil. Ich habe am Anfang gesagt als das Spiel rausgekommen"}, {"id": 329, "start": 2886.92, "end": 2890.88, "text": "ist und gerade in Deutschland haben sie eine riesige Kampagne gefahren mit Let's Playern"}, {"id": 330, "start": 2890.88, "end": 2894.32, "text": "die das spielen und die ganzen Casual Noobs sind dann dahin gerannt weil ihr Lieblings"}, {"id": 331, "start": 2894.32, "end": 2898.16, "text": "Let's Player das spielt und haben sich aufgeregt über die Server Cues. Ich habe noch gesagt"}, {"id": 332, "start": 2898.16, "end": 2902.36, "text": "Leute wartet mal 2-3 Monate ab ihr werdet euch zurück wünschen dass es Zeiten gibt"}, {"id": 333, "start": 2902.36, "end": 2909.16, "text": "die Zeiten wieder mit den Server Cues weil 3 Monate später sind die Server leer. Ich"}, {"id": 334, "start": 2909.16, "end": 2917.64, "text": "habe es selten gesehen dass so schnell in diesem Umfang Spielerzahlen verloren wurden. Man"}, {"id": 335, "start": 2917.64, "end": 2924.52, "text": "muss sich das mal vorstellen. Sie sind innerhalb von 1. Stimmt nicht ganz. September, Oktober"}, {"id": 336, "start": 2924.52, "end": 2934.8, "text": "fehlt da. Innerhalb von 2-3 Monaten. Sag mal 3 Monaten. Innerhalb von 3 Monaten sind die"}, {"id": 337, "start": 2934.8, "end": 2951.92, "text": "um 850.000. Krasser Scheiß Alter. Also Battlefield. Battlefield Zahl. Zeig mal her. Oh guck mal"}, {"id": 338, "start": 2951.92, "end": 2957.24, "text": "da. Ist wieder hoch und jetzt am Wochenende ist es wieder ein bisschen hochgegangen. Guckt"}, {"id": 339, "start": 2957.24, "end": 2962.64, "text": "euch das mal an. Also ich denke das wird vielleicht noch 1-2 Wochen so gehen dann ist wieder Ruhe."}, {"id": 340, "start": 2962.64, "end": 2973.16, "text": "Dann haben das alle ausprobiert und gut ist. Weil Content gibt es ja nach wie vor nicht"}, {"id": 341, "start": 2973.16, "end": 2984.52, "text": "und es gibt auch sonst nichts weiter sinnigerweise in dem Game. Tja. Lassen wir uns was debaten."}, {"id": 342, "start": 2984.52, "end": 2989.4, "text": "Und was Levelcap hier sagt ist Dice ist in irgendeine Textdatei gegangen in irgendeine"}, {"id": 343, "start": 2989.4, "end": 2999.48, "text": "JSON Datei und hat die Map Rotation geändert. Hui. Den Bitcoin ja den können wir uns angucken."}, {"id": 344, "start": 2999.48, "end": 3022.16, "text": "Der ist ein bisschen ja weiß ich ziemlich weit. Runter. Geflutscht. So egal. So vollkommen"}, {"id": 345, "start": 3022.16, "end": 3035.08, "text": "egal ob es die Zahlen von Origin. Was auf Epic. Epic gibt es auch Battlefield. Wirklich."}, {"id": 346, "start": 3035.08, "end": 3041.04, "text": "Tatsächlich Kegway. Ist aber egal. Es ist vollkommen wurscht. Meine Trend ist doch überall"}, {"id": 347, "start": 3041.04, "end": 3049.84, "text": "der gleiche. Und ob es jetzt. Ich meine mal ernsthaft ob das jetzt im Endeffekt. Wenn"}, {"id": 348, "start": 3049.84, "end": 3056.56, "text": "man sich das hier mal anguckt. 2000 Spieler. Ob es jetzt 2000 Spieler sind auf Steam oder"}, {"id": 349, "start": 3056.56, "end": 3063.92, "text": "sagen wir mal noch mal 2000 dabei für die anderen Plattformen. Das macht es jetzt nicht"}, {"id": 350, "start": 3063.92, "end": 3068.68, "text": "fett. Also wichtig ist der Trend und der Trend ist überall gleich. Wir wissen ja die Spielerzahlen"}, {"id": 351, "start": 3068.68, "end": 3073.16, "text": "von den Konsolen auch nicht. Aber wir können davon ausgehen dass der Trend auf den Konsolen"}, {"id": 352, "start": 3073.16, "end": 3090.24, "text": "exakt genauso ist. Das wird es wahrscheinlich sogar bald gratis geben. Also die versuchen"}, {"id": 353, "start": 3090.24, "end": 3096.32, "text": "vielleicht auch ein bisschen mit Transactions was zu verdienen. Ja die Leute die sich damals"}, {"id": 354, "start": 3096.32, "end": 3100.28, "text": "eine Pizza gekauft haben. Ich finde das ist falsch darüber sich jetzt Gedanken zu machen"}, {"id": 355, "start": 3100.28, "end": 3104.84, "text": "weil man muss sich überlegen wie das war. Man hat damals gesagt okay die Pizzeria bietet"}, {"id": 356, "start": 3104.84, "end": 3110.0, "text": "für Bitcoins eine Pizza an und jetzt finde ich das angemessen damit zu kaufen. Da konnte"}, {"id": 357, "start": 3110.0, "end": 3115.08, "text": "auch niemand mit rechnen. Das ist acht Jahre später richtig krass viel wert ist. Es hätte"}, {"id": 358, "start": 3115.08, "end": 3121.0, "text": "genauso gut sein können dass er nie wieder was dafür bekommen hätte. Muss man immer"}, {"id": 359, "start": 3121.0, "end": 3125.32, "text": "zum jetzigen Zeitpunkt sehen. Weil es ist genauso wie wenn du dir irgendwelche Börsencrafts"}, {"id": 360, "start": 3125.32, "end": 3131.8, "text": "anguckst und sagst ah hätte ich damals Microsoft Apple sonst was gekauft. Das wusstest du"}, {"id": 361, "start": 3131.8, "end": 3136.36, "text": "ja nicht. Das kannst du im Nachhinein immer so einfach sagen. Ja aber du wusstest das"}, {"id": 362, "start": 3136.36, "end": 3148.76, "text": "ja nicht. Ja mal angenommen nächstes Jahr geht Bitcoin auf neues Rekordniveau. Da würden"}, {"id": 363, "start": 3148.76, "end": 3152.36, "text": "alle sagen oh fuck hätte ich heute mal was gekauft. Du weißt es nicht. Kann aber auch"}, {"id": 364, "start": 3152.36, "end": 3166.84, "text": "bei 1700 nächstes Jahr sein. So wir lassen uns jetzt weiter Level Cap Gbaiten. Auf Gbaiten"}, {"id": 365, "start": 3166.84, "end": 3177.76, "text": "uns. Ich finde es lustig dass Battlefield in letzter Zeit eigentlich nichts irgendwie"}, {"id": 366, "start": 3177.76, "end": 3186.48, "text": "spannendes rausbringt. Aber trotzdem diese Videos immer von significant und huge changes"}, {"id": 367, "start": 3186.48, "end": 3195.64, "text": "und sonst was reden. Und in Wirklichkeit ist nichts davon significant und huge. Ja gut"}, {"id": 368, "start": 3195.64, "end": 3211.76, "text": "das ist gut hoffentlich hoffentlich nur 24 Spieler. Leute ich sag euch was. Wie wärs"}, {"id": 369, "start": 3211.76, "end": 3220.56, "text": "mit einer Map Selection. Einfach eine Map Selection in der Spielersuche. Weil dann"}, {"id": 370, "start": 3220.56, "end": 3225.76, "text": "könnte man einfach drei Spielmodi anbieten und dann könnte man dort auswählen welche"}, {"id": 371, "start": 3225.76, "end": 3228.76, "text": "Map man spielen will und dann würde man nur diese Map spielen die man spielen will oder"}, {"id": 372, "start": 3228.76, "end": 3233.44, "text": "diese drei Maps die man spielen will. Ich hab gehört sowas soll möglich sein. Aber"}, {"id": 373, "start": 3233.44, "end": 3240.08, "text": "ich glaube bei DICE ist einfach die Technology noch nicht noch nicht da dafür. Stimmt dafür"}, {"id": 374, "start": 3240.08, "end": 3243.0, "text": "gibt es auch nicht genug Spieler. Hast du recht."}, {"id": 375, "start": 3243.0, "end": 3263.44, "text": "Wenn ich sage es gibt kein Server Browser habe ich jetzt schon total oft Leute gesehen"}, {"id": 376, "start": 3263.44, "end": 3267.4, "text": "in meinen Videos die dann sagen doch doch Max guck mal in Portal da gibt es einen Server"}, {"id": 377, "start": 3267.4, "end": 3272.2, "text": "Browser. Die verstehen nicht dass das was komplett anderes ist. Also einen Server Browser"}, {"id": 378, "start": 3272.2, "end": 3279.6, "text": "in einem Nischenteil des Games versus der Hauptspiel Modus oder das Ding wofür man das eigentlich"}, {"id": 379, "start": 3279.6, "end": 3285.84, "text": "geholt hat oder naja wofür es beworben wurde. Wo die Leute drauf scharf sind und den Hauptspiel"}, {"id": 380, "start": 3285.84, "end": 3290.24, "text": "Modus oder die Hauptspiel Kategorie da gibt es keinen Server Browser. Und nur weil es"}, {"id": 381, "start": 3290.24, "end": 3294.64, "text": "da in Portal irgendwie sowas Nischen mäßiges gibt. So what?"}, {"id": 382, "start": 3294.64, "end": 3310.6, "text": "Also eins muss man sagen. DICE hat es in dem Fall ja echt perfektioniert. Die können"}, {"id": 383, "start": 3310.6, "end": 3315.88, "text": "viel reden über nichts nichts. Also die reden viel über sehr wenig Inhalt. Was möchte"}, {"id": 384, "start": 3315.88, "end": 3325.0, "text": "dann DICE bitteschön an Weekly Roadmaps raushauen. Das Spiel ist acht Monate alt und hat kaum"}, {"id": 385, "start": 3325.0, "end": 3330.92, "text": "neue Sachen oder hat im Endeffekt nichts wirklich bekommen. Ja Voice Chat hui ja ein Scoreboard"}, {"id": 386, "start": 3330.92, "end": 3334.96, "text": "aber das ist doch nichts an Inhalt. Das Spiel hat in acht Monaten nichts zu bekommen. Was"}, {"id": 387, "start": 3334.96, "end": 3340.48, "text": "wollen die denn in ihre Weekly Roadmap schreiben. 8.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe"}, {"id": 388, "start": 3340.48, "end": 3348.32, "text": "ich was futtern. 10.30 Uhr mache ich ein Video auf YouTube. A Day in DICE Developers Life."}, {"id": 389, "start": 3348.32, "end": 3351.76, "text": "Oder was wollen die denn? Was soll auf dieser Roadmap draufstehen?"}, {"id": 390, "start": 3351.76, "end": 3356.72, "text": "Also Inhalt zum Game kann es ja schlecht sein."}, {"id": 391, "start": 3356.72, "end": 3374.48, "text": "8.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo."}, {"id": 392, "start": 3374.48, "end": 3392.16, "text": "9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo. 9.30 Uhr gehe ich aufs Klo."}, {"id": 393, "start": 3392.16, "end": 3397.88, "text": "zwischen Updates und dann sagt DICE, ja wir könnten uns überlegen ob wir nicht auf dieser"}, {"id": 394, "start": 3397.88, "end": 3403.02, "text": "Map drei neue Kisten platzieren. Also die Roadmap bei Warzone ist, wir tauschen zwischen"}, {"id": 395, "start": 3403.02, "end": 3407.48, "text": "Updates einfach mal die halbe Map aus und bringen eine neue Map mit rein und die Roadmap"}, {"id": 396, "start": 3407.48, "end": 3415.36, "text": "bei Battlefield ist, ja man könnte drei Kisten platzieren. Und der nächste Punkt in unserer"}, {"id": 397, "start": 3415.36, "end": 3435.28, "text": "Roadmap ist, dass wir die Roadmap für nächste Woche erstellen. Bei dem Typ kann ich nicht"}, {"id": 398, "start": 3435.28, "end": 3441.0, "text": "anders wie an was 16 times the detail oder ich weiß gar nicht mehr wie viel wie viel"}, {"id": 399, "start": 3441.0, "end": 3454.64, "text": "mal detail mehr hätte Fallout 76 haben sollen. Elder Scrolls 6, das haben sie auch vor vier"}, {"id": 400, "start": 3454.64, "end": 3458.96, "text": "Jahren oder so angekündigt und zwar wie, sie haben einen Schriftzug gezeigt und haben"}, {"id": 401, "start": 3458.96, "end": 3466.08, "text": "dabei das Elder Scrolls Main Theme für drei Tastendrücke angespielt. Fertig, nice und"}, {"id": 402, "start": 3466.08, "end": 3494.92, "text": "seitdem nie wieder was von gehört."}, {"id": 403, "start": 3494.92, "end": 3502.56, "text": "Seriously, wenn die kein Spiel rausbringen mit Mod-Support, ist es ja, also das muss"}, {"id": 404, "start": 3502.56, "end": 3508.52, "text": "man ihnen ja tatsächlich lassen, Skyrim ist eines der besten Modding Plattformen allerzeit."}, {"id": 405, "start": 3508.52, "end": 3516.08, "text": "Erinnert mich ein bisschen daran an Half-Life 1, was es da für tausende geile Mods gab,"}, {"id": 406, "start": 3516.08, "end": 3520.8, "text": "also von den Möglichkeiten her. Da gibt es so Sachen wie Enderal, wo sie quasi das komplette"}, {"id": 407, "start": 3520.8, "end": 3526.68, "text": "Spiel, wo sie quasi nur das Framework drumherum genommen haben, ein komplett eigenes Spiel"}, {"id": 408, "start": 3526.68, "end": 3536.0, "text": "gebaut haben, also das machen die schon richtig. Das sorgt ja letztendlich auch für Langlebigkeit"}, {"id": 409, "start": 3536.0, "end": 3543.44, "text": "in den Games und dass man sich da nicht darauf verlassen muss, dass sie das mit Inhalt füllen"}, {"id": 410, "start": 3543.44, "end": 3552.2, "text": "für die nächsten zehn Jahre ist ja auch gut. Zum Beispiel Games wie Mario Kart, sage ich"}, {"id": 411, "start": 3552.2, "end": 3559.04, "text": "jetzt nicht von ungefähr, weil es gab ja eine Custom Strecke für Mario Kart als Mod,"}, {"id": 412, "start": 3559.04, "end": 3563.36, "text": "die optisch noch nicht so hundertprozentig an die Originalstrecken rankommt, weil sie"}, {"id": 413, "start": 3563.36, "end": 3569.16, "text": "noch Probleme haben mit der Beleuchtung, aber überlegt euch mal, wie cool das wäre, könnte"}, {"id": 414, "start": 3569.16, "end": 3576.32, "text": "man einfach mit ordentlichen Mod-Tools Mario Kart Strecken erstellen. Das wäre eines der"}, {"id": 415, "start": 3576.32, "end": 3584.36, "text": "beliebtesten Games der Welt. Das wäre das Spiel auf Twitch. Das wäre einfach der riesen"}, {"id": 416, "start": 3584.36, "end": 3590.12, "text": "Hype, wenn es da für Möglichkeiten gäbe eigene Strecken zu erstellen. Aber was macht"}, {"id": 417, "start": 3590.12, "end": 3596.36, "text": "Nintendo? Nichts. Und bringen irgendwie die Mario Kart Tour Strecken leicht angepasst"}, {"id": 418, "start": 3596.36, "end": 3600.16, "text": "dafür raus, nice. Aber überlegt euch mal, wie das Spiel komplett durch die Decke gehen"}, {"id": 419, "start": 3600.16, "end": 3605.28, "text": "würde, könntest du in Mario Kart Custom Strecken erstellen. Und ich meine damit nicht, dass"}, {"id": 420, "start": 3605.28, "end": 3613.48, "text": "sie einen Mario Kart Maker machen sollen. Das meine ich damit gar nicht. Es ist nämlich"}, {"id": 421, "start": 3613.48, "end": 3621.4, "text": "ein Unterschied, ob du einen Mario Kart Maker, Dungeon Maker oder sonst was hast oder ob du"}, {"id": 422, "start": 3621.4, "end": 3627.44, "text": "einfach Zugriff auf die Entwicklungstools hast. Wenn du dir nämlich Skyrim anguckst"}, {"id": 423, "start": 3627.44, "end": 3638.92, "text": "oder auch davor, wenn man sich mal die... Wo sind die Baldur's Gate Leute? Black Isle"}, {"id": 424, "start": 3638.92, "end": 3644.24, "text": "Studios? Ich bin gar nicht mehr sicher. Wenn man sich die Neverwinter Nights Mod-Tools"}, {"id": 425, "start": 3644.24, "end": 3651.0, "text": "anguckt und sowas, da hast du gesehen, dass die Leute das Spiel zum großen Teil auch"}, {"id": 426, "start": 3651.0, "end": 3656.52, "text": "mit diesen Tools entwickelt haben. Und das ist ein Unterschied, ob du den Leuten einen"}, {"id": 427, "start": 3656.52, "end": 3664.72, "text": "casual freundlichen... Mario & Games waren die Divinity. Das sind wieder andere. Ich meine"}, {"id": 428, "start": 3664.72, "end": 3671.76, "text": "nicht die Baldur's Gate 3 machen, ich meine die alten Dinger. Oder guck dir Source Engine"}, {"id": 429, "start": 3671.76, "end": 3680.4, "text": "Sachen an. Genau. Das ist kein Level Editor für Casuals wie Mario Maker, sondern das"}, {"id": 430, "start": 3680.4, "end": 3683.64, "text": "sind halt die Tools, mit denen die Entwickler zum größten Teil auch die Inhalte dafür"}, {"id": 431, "start": 3683.64, "end": 3689.16, "text": "erstellt haben. Das ist ein Unterschied und da kannst du halt viel mehr machen. Das kann"}, {"id": 432, "start": 3689.16, "end": 3693.0, "text": "nicht jeder Kacknoob, aber es muss auch nicht jeder Kacknoob Strecken erstellen. Belegt"}, {"id": 433, "start": 3693.0, "end": 3699.44, "text": "euch mal, du hättest wirklich die Möglichkeit mit ordentlichen Tools, was ja Fan-Made mittlerweile"}, {"id": 434, "start": 3699.44, "end": 3705.32, "text": "halbwegs sogar geht für Mario Kart, Nintendo mag das halt nicht, du hättest wirklich offiziell"}, {"id": 435, "start": 3705.32, "end": 3710.72, "text": "die Möglichkeit, richtig neue Strecken mit ordentlichen Entwicklungstools für Mario"}, {"id": 436, "start": 3710.72, "end": 3714.2, "text": "Kart zu erstellen. Alter das Spiel würde auch auf Twitch, das würde überall komplett"}, {"id": 437, "start": 3714.2, "end": 3719.0, "text": "durch die Decke gehen, weil das ist einfach ein ultra spaßiges Game und wenn es da jetzt"}, {"id": 438, "start": 3719.0, "end": 3724.72, "text": "noch abgedrehten geilen Fan-Content gäbe und Nintendo kann sich das jetzt gar nicht"}, {"id": 439, "start": 3724.72, "end": 3729.84, "text": "ausdenken, was den Fans alles einfallen würde. Ja das erste was es gäbe, wäre Prop Hunt"}, {"id": 440, "start": 3729.84, "end": 3735.76, "text": "in Mario Kart, bin ich mir sicher, das ist immer einer der ersten Modi, die skippt. Ja"}, {"id": 441, "start": 3735.76, "end": 3739.44, "text": "da kannst du dann, ich bin auf der Map versteckt, ich bin irgendein Shy Guy, der da oben auf"}, {"id": 442, "start": 3739.44, "end": 3746.2, "text": "der Pyramide rumläuft oder so. Da gäbe es die krassesten Mods überhaupt und das würde"}, {"id": 443, "start": 3746.2, "end": 3749.32, "text": "das Spiel, das würde komplett durch die Decke gehen. Natürlich die Frage, ob Nintendo"}, {"id": 444, "start": 3749.32, "end": 3752.36, "text": "dann ein paar Jahre ein neues Mario Kart verkaufen könnte oder so viele Leute noch sich die"}, {"id": 445, "start": 3752.36, "end": 3761.12, "text": "StreckendLCs kaufen würden. Das ist richtig, das stimmt schon. Aber es würde das Spiel"}, {"id": 446, "start": 3761.12, "end": 3766.28, "text": "unglaublich langlebig und unglaublich gehyped machen. Egal, wir lassen uns weiter tschüben."}, {"id": 447, "start": 3766.28, "end": 3771.32, "text": "Also Mod Support ist immer noch eines der geilsten, also gut gemachten Mod Support."}, {"id": 448, "start": 3771.32, "end": 3777.28, "text": "Mod Support muss ja gar nicht, wisst ihr eigentlich warum so viele Spiele früher Mod Support"}, {"id": 449, "start": 3777.28, "end": 3782.32, "text": "hatten? Das war kein Mod Support im eigentlichen Sinn, die Entwickler haben einfach ihre Entwickler"}, {"id": 450, "start": 3782.32, "end": 3791.48, "text": "Tools dabei gelegt. Half Life 1 hattest du WorldCraft? Hieß das glaube ich noch? WorldCraft?"}, {"id": 451, "start": 3791.48, "end": 3801.04, "text": "Ja, WorldCraft hieß das Ding in Half Life 1. Heute heißt es Hammer, früher hieß es WorldCraft."}, {"id": 452, "start": 3801.04, "end": 3808.6, "text": "Die haben einfach ihre Entwickler Tools dabei gelegt. Und fast jedes Echtzeitstrategie Spiel"}, {"id": 453, "start": 3808.6, "end": 3813.84, "text": "damals, guckt euch auch die alten Command & Conquer Teile an, die hatten einen Editor"}, {"id": 454, "start": 3813.84, "end": 3821.0, "text": "dabei und das war zu 90%, vielleicht nicht alle Features komplett, aber das war zu 90%"}, {"id": 455, "start": 3821.0, "end": 3825.12, "text": "eben der Editor, mit dem die Missionen für dieses Spiel erstellt wurden vom Hersteller."}, {"id": 456, "start": 3825.12, "end": 3830.0, "text": "Also das war kein Mod Support in dem Sinn, dass man gesagt hätte, ja wir machen das"}, {"id": 457, "start": 3830.0, "end": 3835.2, "text": "jetzt extra, nein, die haben einfach ihre Entwickler Tools freigegeben. Sachen wie"}, {"id": 458, "start": 3835.2, "end": 3839.04, "text": "WorldCraft 3, also die ganzen WorldCraft 3 Mods wären ja gar nicht möglich gewesen"}, {"id": 459, "start": 3839.04, "end": 3848.84, "text": "mit einem minimalistischen Casual-freundlichen Editor. WPM, ja habe ich schon, ich bin nicht"}, {"id": 460, "start": 3848.84, "end": 3855.72, "text": "sonderlich schnell im Schreiben, vor allem nicht fehlerfrei. So und das war halt richtig"}, {"id": 461, "start": 3855.72, "end": 3861.48, "text": "geil, deswegen gab es da auch so viel geilen Content und deswegen konntest du damals quasi"}, {"id": 462, "start": 3861.48, "end": 3868.76, "text": "jahrelang Spiele spielen, weil es einfach Poggers Content am laufenden Band und von Leuten,"}, {"id": 463, "start": 3868.76, "end": 3874.2, "text": "die das Spiel kannten und wussten, wie man gute Sachen macht, gab. Es gab auch viel,"}, {"id": 464, "start": 3874.2, "end": 3880.16, "text": "es gab sehr viel Müll-Content, also 90% der Mods, würde ich sagen, waren Müll, aber es"}, {"id": 465, "start": 3880.16, "end": 3888.24, "text": "egal, es gab einfach saubermissig viele und auch richtig gute, ja. Ego CS ist ja im Prinzip"}, {"id": 466, "start": 3888.24, "end": 3902.64, "text": "ein Mod, war ursprünglich gewesen. Dota auch, genau. Also wie gesagt, das ist das beste,"}, {"id": 467, "start": 3902.64, "end": 3908.08, "text": "wie man Spiele langlebig machen kann und das war halt früher mehr oder weniger normal,"}, {"id": 468, "start": 3908.08, "end": 3912.48, "text": "weil die ihre Entwickler Tools mitgebracht haben. Und die haben halt dann gesagt, ja"}, {"id": 469, "start": 3912.48, "end": 3916.28, "text": "entweder ihr arbeitet euch da ein oder ihr habt Pech gehabt, aber du hattest halt die"}, {"id": 470, "start": 3916.28, "end": 3929.08, "text": "umfangreichen Möglichkeiten, was zu machen. Ohne Scheiß Overwatch wäre ein so viel geileres"}, {"id": 471, "start": 3929.08, "end": 3936.32, "text": "Game, jetzt mal ernsthaft, Overwatch könnte eines der besten Competitive, Casual, könnte"}, {"id": 472, "start": 3936.32, "end": 3941.56, "text": "eines der besten Spiele für alle sein, gäbe es die Entwickler Tool beziehungsweise gäbe"}, {"id": 473, "start": 3941.56, "end": 3947.04, "text": "es die Möglichkeit, ordentliche Custom Maps zu machen. Weil man muss halt sagen, die Overwatch"}, {"id": 474, "start": 3947.04, "end": 3951.44, "text": "Maps sind halt zur Hälfte ultra kacke, gerade die ganzen 2CP-Dinger, also gut, dass die"}, {"id": 475, "start": 3951.44, "end": 3958.88, "text": "rausfliegen und Blizzard kann keine Maps bauen. Also ich finde, die Overwatch Maps, die sind"}, {"id": 476, "start": 3958.88, "end": 3964.48, "text": "halt vom Detailgrad und vom Design her, sind die cool, also Art-Abteilung hat Blizzard,"}, {"id": 477, "start": 3964.48, "end": 3969.48, "text": "aber die Maps sind vom Gameplay her rotz, ganz ehrlich, ich sage euch, das ist meine"}, {"id": 478, "start": 3969.48, "end": 3975.4, "text": "Meinung von den Overwatch Maps, es gibt ein paar Maps, die sind okay, Kingsrow zum Beispiel"}, {"id": 479, "start": 3975.4, "end": 3987.08, "text": "finde ich ganz nice, aber ansonsten, die meisten Maps sind einfach langweilige Schlauchlevel"}, {"id": 480, "start": 3987.08, "end": 3996.64, "text": "ohne Finesse, also Overwatch Maps sind einfach total langweilig, zum größten Teil schlecht"}, {"id": 481, "start": 3996.64, "end": 4006.72, "text": "designte Shooter Maps, könnte man wirklich Maps entwerfen, für Overwatch wäre das eines"}, {"id": 482, "start": 4006.72, "end": 4011.88, "text": "der besten Spiele der letzten Jahre und wäre es immer noch, es wäre auch nicht so untergegangen,"}, {"id": 483, "start": 4011.88, "end": 4020.2, "text": "weil Blizzard nichts an Content rausbringt. Es ist doch nicht ohne Grund so, dass StarCraft,"}, {"id": 484, "start": 4020.2, "end": 4025.16, "text": "die Maps, die dort gespielt werden, die wechseln ja auch immer wieder, niemand spielt Blizzard"}, {"id": 485, "start": 4025.16, "end": 4030.12, "text": "Maps, das sind alles Custom Maps und der Map Pool wechselt da auch regelmäßig, das sind"}, {"id": 486, "start": 4030.12, "end": 4041.96, "text": "alles Custom Maps, die ganzen StarCraft sind alles Custom Maps."}, {"id": 487, "start": 4041.96, "end": 4046.4, "text": "The same. This applies to modding as well. He stated that Starfield will be a dream for"}, {"id": 488, "start": 4046.4, "end": 4051.88, "text": "its modding community. The Resident Evil franchise had several exciting announcements this week,"}, {"id": 489, "start": 4051.88, "end": 4057.68, "text": "Resident Evil Village is getting a new expansion called Shadows of Rose. It'll be based around"}, {"id": 490, "start": 4057.68, "end": 4062.34, "text": "the protagonist's daughter from the base game. Capcom stated that the new DLC is much harder"}, {"id": 491, "start": 4062.34, "end": 4066.36, "text": "than the base game. Village is also getting a third-person mode that'll make it play"}, {"id": 492, "start": 4066.36, "end": 4071.08, "text": "like a combination of the original Resident Evil games and their modern remakes. All"}, {"id": 493, "start": 4071.08, "end": 4075.36, "text": "this new content is available as part of the Golden Edition bundle that will launch on"}, {"id": 494, "start": 4075.36, "end": 4081.48, "text": "October 28. Highly realistic tactical FPS Ready or Not has been temporarily delisted"}, {"id": 495, "start": 4081.48, "end": 4086.48, "text": "from Steam with that explanation. The game was removed a week after the developers added"}, {"id": 496, "start": 4086.48, "end": 4091.36, "text": "a nightclub level depicting a mass shooting event. The devs say Valve hasn't clarified"}, {"id": 497, "start": 4091.36, "end": 4095.8, "text": "why the game was removed, but they're working to resolve the situation. It's likely the"}, {"id": 498, "start": 4095.8, "end": 4099.4, "text": "game's dedication to realism has pushed... Wie ist denn das eigentlich? Meine blöde Frage,"}, {"id": 499, "start": 4099.4, "end": 4105.72, "text": "hatte schon jemand mal die Variante, er hat ein Steam-Game gekauft, runtergeladen und dann"}, {"id": 500, "start": 4105.72, "end": 4110.28, "text": "wurde es von Steam genommen. Was passiert dann? Kann man das dann noch spielen? Kann"}, {"id": 501, "start": 4110.28, "end": 4113.68, "text": "man das nun nicht mehr herunterladen? Wird das deinstalliert lokal bei einem? Kann man"}, {"id": 502, "start": 4113.68, "end": 4131.72, "text": "es anklicken, aber nicht mehr starten? Man kann es nun nicht neu kaufen, oder wie? Achso,"}, {"id": 503, "start": 4131.72, "end": 4155.28, "text": "also man kann es bloß nicht mehr kaufen. Okay."}, {"id": 504, "start": 4155.28, "end": 4168.0, "text": "Hat das hier mal von euch gespielt? Ich stelle mir die Steuerung auf mobile oder cheatet"}, {"id": 505, "start": 4168.0, "end": 4173.72, "text": "jeder mit dem Controller? Spielt das einfach jeder mit dem Controller und fickt die ganzen"}, {"id": 506, "start": 4173.72, "end": 4186.96, "text": "PLEPS am Touchscreen weg? Oder wie ist das?"}, {"id": 507, "start": 4186.96, "end": 4209.38, "text": "Na gut, holen wir was aus, excuse me."}, {"id": 508, "start": 4209.38, "end": 4213.82, "text": "Leaker Tom Henderson, der sagt, dass er das Prototyp dieses neuen Pro-Controllers gesehen hat."}, {"id": 509, "start": 4213.82, "end": 4215.66, "text": "Er sagt, es beinhaltet"}, {"id": 510, "start": 4215.66, "end": 4220.02, "text": "removable analog sticks, removable stick units beneath the analog sticks,"}, {"id": 511, "start": 4220.02, "end": 4223.06, "text": "Trigger-Stops, Rear-Buttons und removable grips."}, {"id": 512, "start": 4223.06, "end": 4224.22, "text": "Die removable analog sticks"}, {"id": 513, "start": 4224.22, "end": 4226.22, "text": "As it offends in a scav controller, oder?"}, {"id": 514, "start": 4226.22, "end": 4230.74, "text": "...would last someone to actually replace them if they develop something like stick drift issues or just wear out."}, {"id": 515, "start": 4231.34, "end": 4236.42, "text": "Ubisoft hat gesagt, es würde die Zukunft von Assassin's Creed irgendwann im September entdecken."}, {"id": 516, "start": 4236.42, "end": 4241.86, "text": "Fans speculate, that that event would be used to reveal the rumored Assassin's Creed Infinity Game,"}, {"id": 517, "start": 4241.86, "end": 4244.66, "text": "a free-to-play, multi-era, live-service title."}, {"id": 518, "start": 4244.66, "end": 4246.66, "text": "Oh nein, please, please!"}, {"id": 519, "start": 4248.66, "end": 4255.22, "text": "Das hört sich wieder nach Ultra, wir wollen ganz viel Geld machen, haben aber eigentlich keine gute Idee für das Game an."}, {"id": 520, "start": 4255.22, "end": 4258.66, "text": "A remaster of the original Assassin's Creed Game is coming."}, {"id": 521, "start": 4258.66, "end": 4263.74, "text": "In the new anniversary trailer of the series, particular attention was put on Assassin's Creed 1."}, {"id": 522, "start": 4263.74, "end": 4268.02, "text": "Fans noticed minor lighting tweaks and color changes compared to the original game."}, {"id": 523, "start": 4268.02, "end": 4269.74, "text": "It also sports a new logo."}, {"id": 524, "start": 4269.74, "end": 4273.74, "text": "Of course, time will tell, as everything will hopefully be revealed in September."}, {"id": 525, "start": 4274.5, "end": 4279.54, "text": "Newly released God of War merchandise has fans speculating about the game's release date."}, {"id": 526, "start": 4279.54, "end": 4285.02, "text": "The highly anticipated sequel, God of War Ragnarok, was initially set to launch in 2021,"}, {"id": 527, "start": 4285.02, "end": 4287.38, "text": "but was pushed back to sometime this year."}, {"id": 528, "start": 4287.38, "end": 4293.7, "text": "An online store has listed God of War Ragnarok merchandise with a release date of October 2022."}, {"id": 529, "start": 4293.7, "end": 4297.26, "text": "According to developers on Twitter, the game won't be delayed again,"}, {"id": 530, "start": 4297.26, "end": 4300.58, "text": "meaning an October release date is looking more likely."}, {"id": 531, "start": 4301.38, "end": 4307.86, "text": "District 9 and Elysium director Neil Blockamp is set to direct a Gran Turismo movie for Sony."}, {"id": 532, "start": 4307.86, "end": 4311.82, "text": "It's supposedly going to be re-released in August of 2023."}, {"id": 533, "start": 4311.82, "end": 4315.26, "text": "Reports indicate that isn't the usual video game adaptation."}, {"id": 534, "start": 4315.26, "end": 4322.46, "text": "Instead, the film will follow a teenage Gran Turismo player whose gaming skills lead them to become an actual professional race car driver."}, {"id": 535, "start": 4322.46, "end": 4328.02, "text": "Other than that, very few additional details are known, but production at Columbia Pictures is starting soon."}, {"id": 536, "start": 4328.02, "end": 4332.1, "text": "It'll be led by the same producers that made the recent Uncharted movie."}, {"id": 537, "start": 4332.1, "end": 4333.1, "text": "Oh yeah!"}, {"id": 538, "start": 4333.1, "end": 4347.9, "text": "During their Overwatch 2 live stream, Activision Blizzard confirmed that the sequel would be an always-on, constantly-evolving, free-to-play game."}, {"id": 539, "start": 4347.9, "end": 4353.26, "text": "It'll drop the original's loot box model in favor of a battle pass and an in-game store."}, {"id": 540, "start": 4353.26, "end": 4359.18, "text": "Each season will run for nine weeks and include either a new map or a new hero every time."}, {"id": 541, "start": 4359.18, "end": 4360.38, "text": "Not to mention new weekly challenges..."}, {"id": 542, "start": 4360.38, "end": 4361.98, "text": "Moment, Moment, Moment!"}, {"id": 543, "start": 4363.98, "end": 4367.5, "text": "Die wollen alle neun Wochen eine neue Map und einen neuen Held releasen?"}, {"id": 544, "start": 4367.5, "end": 4369.06, "text": "Oder, oder ein neuer..."}, {"id": 545, "start": 4369.06, "end": 4370.06, "text": "Das geht nicht?"}, {"id": 546, "start": 4371.22, "end": 4375.9, "text": "Wir haben, also, wir haben bei DICE gesehen, das ist nicht möglich."}, {"id": 547, "start": 4375.9, "end": 4380.74, "text": "Also, es ist wirklich, wörtlich genommen, unmöglich."}, {"id": 548, "start": 4380.74, "end": 4382.74, "text": "Das geht, das geht gar nicht."}, {"id": 549, "start": 4384.74, "end": 4386.74, "text": "Chico verdeckt die oberste Zeile."}, {"id": 550, "start": 4386.74, "end": 4388.74, "text": "Was macht Chico denn für Dinger hier?"}, {"id": 551, "start": 4393.74, "end": 4395.74, "text": "So, jetzt verdeckt Chico nicht mal die oberste Zeile."}, {"id": 552, "start": 4398.74, "end": 4400.74, "text": "Ja, aber das, was ist denn mit denen los?"}, {"id": 553, "start": 4400.74, "end": 4402.74, "text": "DICE sagt nein, genau, das geht gar nicht."}, {"id": 554, "start": 4402.74, "end": 4406.74, "text": "Seriös, aber eben..."}, {"id": 555, "start": 4406.74, "end": 4407.74, "text": "Wie diese Damen."}, {"id": 556, "start": 4407.74, "end": 4410.74, "text": "So, jetzt geht's einfach los."}, {"id": 557, "start": 4410.74, "end": 4412.74, "text": "Ja, los mit dem minimize Setback."}, {"id": 558, "start": 4412.74, "end": 4415.74, "text": "Desktop?"}, {"id": 559, "start": 4418.74, "end": 4419.74, "text": "Thinking!"}, {"id": 560, "start": 4419.74, "end": 4423.74, "text": "Deswegen, Some queen praised the menu!"}, {"id": 561, "start": 4423.74, "end": 4426.74, "text": "It's 68% action."}, {"id": 562, "start": 4426.74, "end": 4432.58, "text": "The release date for Survival FPS Stalker 2 has recently been pushed back to 2023."}, {"id": 563, "start": 4432.58, "end": 4437.14, "text": "This is because the development team GSC Gameworld was based in the Ukraine."}, {"id": 564, "start": 4437.14, "end": 4441.94, "text": "The extended Xbox and Bethesda showcase this week included a short video about what the"}, {"id": 565, "start": 4441.94, "end": 4445.86, "text": "developers have been dealing with since the Russia invasion began."}, {"id": 566, "start": 4445.86, "end": 4450.86, "text": "The video shows the bombed out offices of the developers as well as different devs in uniform."}, {"id": 567, "start": 4450.86, "end": 4474.42, "text": "The community manager for the game also now uses a bathroom for an office."}, {"id": 568, "start": 4474.42, "end": 4477.78, "text": "The studio is currently transitioning to a new office space in Prague."}, {"id": 569, "start": 4477.78, "end": 4482.54, "text": "They have stated that once things are up and running, development on Stalker 2 will resume."}, {"id": 570, "start": 4482.54, "end": 4485.18, "text": "And that wraps it up for this week in gaming."}, {"id": 571, "start": 4485.18, "end": 4488.14, "text": "As always guys, thank you so much for watching and I'll catch you next time."}, {"id": 572, "start": 4488.14, "end": 4512.34, "text": "This is Levelcap signing off."}, {"id": 573, "start": 4512.34, "end": 4529.98, "text": "What happens if you cut off CPU Pins?"}, {"id": 574, "start": 4529.98, "end": 4547.86, "text": "What happens if you cut off CPU Pins?"}, {"id": 575, "start": 4547.86, "end": 4572.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 576, "start": 4572.34, "end": 4584.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 577, "start": 4584.94, "end": 4603.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 578, "start": 4603.54, "end": 4616.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 579, "start": 4616.14, "end": 4634.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 580, "start": 4634.74, "end": 4657.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 581, "start": 4657.34, "end": 4673.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 582, "start": 4673.94, "end": 4688.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 583, "start": 4688.54, "end": 4706.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 584, "start": 4706.14, "end": 4722.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 585, "start": 4722.74, "end": 4737.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 586, "start": 4737.34, "end": 4753.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 587, "start": 4753.94, "end": 4778.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 588, "start": 4778.54, "end": 4801.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 589, "start": 4801.14, "end": 4828.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 590, "start": 4828.74, "end": 4845.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 591, "start": 4845.34, "end": 4872.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 592, "start": 4872.94, "end": 4890.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 593, "start": 4890.54, "end": 4905.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 594, "start": 4905.14, "end": 4921.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 595, "start": 4921.74, "end": 4936.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 596, "start": 4936.34, "end": 4952.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 597, "start": 4952.94, "end": 4970.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 598, "start": 4970.54, "end": 4988.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 599, "start": 4988.14, "end": 5004.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 600, "start": 5004.74, "end": 5019.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 601, "start": 5019.34, "end": 5035.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 602, "start": 5035.94, "end": 5051.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 603, "start": 5051.34, "end": 5076.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 604, "start": 5076.94, "end": 5104.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 605, "start": 5104.94, "end": 5132.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 606, "start": 5132.54, "end": 5149.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 607, "start": 5149.14, "end": 5163.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 608, "start": 5163.74, "end": 5180.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 609, "start": 5180.34, "end": 5194.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 610, "start": 5194.94, "end": 5211.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 611, "start": 5211.54, "end": 5226.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 612, "start": 5226.14, "end": 5242.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 613, "start": 5242.74, "end": 5257.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 614, "start": 5272.74, "end": 5294.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 615, "start": 5294.34, "end": 5310.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 616, "start": 5310.94, "end": 5325.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 617, "start": 5325.54, "end": 5354.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 618, "start": 5354.14, "end": 5368.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 619, "start": 5368.74, "end": 5385.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 620, "start": 5385.34, "end": 5399.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 621, "start": 5399.94, "end": 5416.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 622, "start": 5416.54, "end": 5431.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 623, "start": 5431.14, "end": 5447.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 624, "start": 5447.74, "end": 5462.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 625, "start": 5462.34, "end": 5486.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 626, "start": 5486.94, "end": 5499.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 627, "start": 5499.54, "end": 5517.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 628, "start": 5517.14, "end": 5533.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 629, "start": 5533.74, "end": 5555.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 630, "start": 5555.14, "end": 5571.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 631, "start": 5571.74, "end": 5589.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 632, "start": 5589.34, "end": 5606.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 633, "start": 5606.94, "end": 5633.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 634, "start": 5633.54, "end": 5658.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 635, "start": 5658.14, "end": 5682.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 636, "start": 5682.74, "end": 5703.34, "text": "What happens if you cut off CPU Pins?"}, {"id": 637, "start": 5703.34, "end": 5725.94, "text": "What happens if you cut off CPU Pins?"}, {"id": 638, "start": 5725.94, "end": 5755.54, "text": "What happens if you cut off CPU Pins?"}, {"id": 639, "start": 5755.54, "end": 5783.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 640, "start": 5783.14, "end": 5807.14, "text": "What happens if you cut off CPU Pins?"}, {"id": 641, "start": 5807.14, "end": 5835.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 642, "start": 5835.74, "end": 5856.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 643, "start": 5856.74, "end": 5877.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 644, "start": 5877.74, "end": 5900.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 645, "start": 5900.74, "end": 5921.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 646, "start": 5921.74, "end": 5949.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 647, "start": 5949.74, "end": 5974.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 648, "start": 5974.74, "end": 6002.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 649, "start": 6002.74, "end": 6029.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 650, "start": 6029.74, "end": 6056.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 651, "start": 6059.74, "end": 6086.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 652, "start": 6086.74, "end": 6113.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 653, "start": 6113.74, "end": 6140.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 654, "start": 6140.74, "end": 6167.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 655, "start": 6167.74, "end": 6194.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 656, "start": 6194.74, "end": 6221.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 657, "start": 6221.74, "end": 6248.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 658, "start": 6248.74, "end": 6268.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 659, "start": 6268.74, "end": 6290.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 660, "start": 6290.74, "end": 6317.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 661, "start": 6317.74, "end": 6337.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 662, "start": 6337.74, "end": 6353.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 663, "start": 6353.74, "end": 6377.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 664, "start": 6377.74, "end": 6397.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 665, "start": 6397.74, "end": 6417.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 666, "start": 6417.74, "end": 6437.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 667, "start": 6437.74, "end": 6457.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 668, "start": 6457.74, "end": 6483.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 669, "start": 6483.74, "end": 6498.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 670, "start": 6498.74, "end": 6518.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 671, "start": 6518.74, "end": 6538.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 672, "start": 6538.74, "end": 6551.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 673, "start": 6551.74, "end": 6568.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 674, "start": 6568.74, "end": 6584.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 675, "start": 6584.74, "end": 6599.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 676, "start": 6599.74, "end": 6614.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 677, "start": 6614.74, "end": 6629.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 678, "start": 6629.74, "end": 6644.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 679, "start": 6644.74, "end": 6659.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 680, "start": 6659.74, "end": 6674.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 681, "start": 6674.74, "end": 6689.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 682, "start": 6689.74, "end": 6704.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 683, "start": 6704.74, "end": 6719.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 684, "start": 6719.74, "end": 6734.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 685, "start": 6734.74, "end": 6749.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 686, "start": 6749.74, "end": 6764.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 687, "start": 6764.74, "end": 6779.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 688, "start": 6779.74, "end": 6794.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 689, "start": 6794.74, "end": 6809.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 690, "start": 6809.74, "end": 6824.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 691, "start": 6824.74, "end": 6839.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 692, "start": 6839.74, "end": 6854.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 693, "start": 6854.74, "end": 6869.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 694, "start": 6869.74, "end": 6884.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 695, "start": 6884.74, "end": 6899.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 696, "start": 6899.74, "end": 6914.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 697, "start": 6914.74, "end": 6929.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 698, "start": 6929.74, "end": 6944.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 699, "start": 6944.74, "end": 6959.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 700, "start": 6959.74, "end": 6974.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 701, "start": 6974.74, "end": 6989.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 702, "start": 6989.74, "end": 7004.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 703, "start": 7004.74, "end": 7019.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 704, "start": 7019.74, "end": 7034.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 705, "start": 7034.74, "end": 7049.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 706, "start": 7049.74, "end": 7064.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 707, "start": 7064.74, "end": 7079.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 708, "start": 7079.74, "end": 7094.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 709, "start": 7094.74, "end": 7109.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 710, "start": 7109.74, "end": 7124.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 711, "start": 7124.74, "end": 7139.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 712, "start": 7139.74, "end": 7154.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 713, "start": 7154.74, "end": 7169.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 714, "start": 7169.74, "end": 7184.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 715, "start": 7184.74, "end": 7199.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 716, "start": 7199.74, "end": 7214.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 717, "start": 7214.74, "end": 7229.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 718, "start": 7229.74, "end": 7244.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 719, "start": 7244.74, "end": 7259.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 720, "start": 7259.74, "end": 7274.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 721, "start": 7274.74, "end": 7289.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 722, "start": 7289.74, "end": 7304.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 723, "start": 7304.74, "end": 7319.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 724, "start": 7319.74, "end": 7334.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 725, "start": 7334.74, "end": 7349.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 726, "start": 7349.74, "end": 7364.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 727, "start": 7364.74, "end": 7379.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 728, "start": 7379.74, "end": 7394.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 729, "start": 7394.74, "end": 7409.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 730, "start": 7409.74, "end": 7424.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 731, "start": 7424.74, "end": 7439.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 732, "start": 7439.74, "end": 7454.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 733, "start": 7454.74, "end": 7469.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 734, "start": 7469.74, "end": 7484.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 735, "start": 7484.74, "end": 7499.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 736, "start": 7499.74, "end": 7514.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 737, "start": 7514.74, "end": 7529.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 738, "start": 7529.74, "end": 7544.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 739, "start": 7544.74, "end": 7559.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 740, "start": 7559.74, "end": 7574.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 741, "start": 7574.74, "end": 7589.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 742, "start": 7589.74, "end": 7604.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 743, "start": 7604.74, "end": 7619.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 744, "start": 7619.74, "end": 7634.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 745, "start": 7634.74, "end": 7649.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 746, "start": 7649.74, "end": 7664.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 747, "start": 7664.74, "end": 7679.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 748, "start": 7679.74, "end": 7694.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 749, "start": 7694.74, "end": 7709.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 750, "start": 7709.74, "end": 7724.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 751, "start": 7724.74, "end": 7739.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 752, "start": 7739.74, "end": 7754.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 753, "start": 7754.74, "end": 7769.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 754, "start": 7769.74, "end": 7784.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 755, "start": 7784.74, "end": 7799.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 756, "start": 7799.74, "end": 7814.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 757, "start": 7814.74, "end": 7830.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 758, "start": 7830.74, "end": 7845.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 759, "start": 7845.74, "end": 7860.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 760, "start": 7860.74, "end": 7875.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 761, "start": 7875.74, "end": 7890.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 762, "start": 7890.74, "end": 7905.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 763, "start": 7905.74, "end": 7920.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 764, "start": 7920.74, "end": 7935.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 765, "start": 7935.74, "end": 7950.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 766, "start": 7950.74, "end": 7965.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 767, "start": 7965.74, "end": 7980.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 768, "start": 7980.74, "end": 7995.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 769, "start": 7995.74, "end": 8010.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 770, "start": 8010.74, "end": 8025.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 771, "start": 8025.74, "end": 8040.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 772, "start": 8040.74, "end": 8055.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 773, "start": 8055.74, "end": 8070.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 774, "start": 8070.74, "end": 8085.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 775, "start": 8085.74, "end": 8100.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 776, "start": 8100.74, "end": 8115.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 777, "start": 8115.74, "end": 8130.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 778, "start": 8130.74, "end": 8145.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 779, "start": 8145.74, "end": 8160.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 780, "start": 8160.74, "end": 8175.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 781, "start": 8175.74, "end": 8190.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 782, "start": 8190.74, "end": 8205.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 783, "start": 8205.74, "end": 8220.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 784, "start": 8220.74, "end": 8235.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 785, "start": 8235.74, "end": 8250.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 786, "start": 8250.74, "end": 8265.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 787, "start": 8265.74, "end": 8280.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 788, "start": 8280.74, "end": 8295.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 789, "start": 8295.74, "end": 8310.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 790, "start": 8310.74, "end": 8325.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 791, "start": 8325.74, "end": 8340.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 792, "start": 8340.74, "end": 8355.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 793, "start": 8355.74, "end": 8370.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 794, "start": 8370.74, "end": 8385.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 795, "start": 8385.74, "end": 8400.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 796, "start": 8400.74, "end": 8415.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 797, "start": 8415.74, "end": 8430.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 798, "start": 8430.74, "end": 8445.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 799, "start": 8445.74, "end": 8460.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 800, "start": 8460.74, "end": 8475.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 801, "start": 8475.74, "end": 8490.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 802, "start": 8490.74, "end": 8505.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 803, "start": 8505.74, "end": 8520.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 804, "start": 8520.74, "end": 8535.74, "text": "What happens if you cut off CPU Pins?"}, {"id": 805, "start": 8535.74, "end": 8550.74, "text": "What happens if you cut off CPU Pins?"}]}