{"text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss, tschüss. So, da bin ich Leute, sag mal, braucht jemand von euch UniFi Exit Points? Ich habe einen UAP Pro, einen UniFi 6 Lite und einen UAC Lite. Das sind die, die ich ausgebaut habe. Nee, Moment, das müssten vier sein. Ich sehe den vierten gerade nicht, es müssten vier sein, ich hatte vier. Ich hatte einen im Keller, ich hatte einen im Erdgeschoss und ich hatte zwei im ersten Stock. Wo ist denn der vierte hin? Keine Ahnung. Ja, gut, was auch immer, ist egal. Ansonsten bleiben die Dinger hier einfach liegen, vielleicht kann man die irgendwann mal flashen mit Custom-Firmware und was Cooles mitmachen, irgendwie Open-WRT drauf oder so. Es geht ja aktuell nicht richtig, also man kann Open-WRT drauf machen, aber nur mit Gelöte oder so ganz komisches Zeug, da habe ich keinen Bock drauf. Ja, ich werde es wahrscheinlich aufheben, ganz ehrlich, ich habe so viel Mist schon aufgehoben. Ich müsste langsam mal echt ein bisschen was wegschmeißen. Ich habe noch, oder ihr wisst ja, was ich teilweise noch für alte Hardware habe, ich schmeiße irgendwie kaum was weg. Ja, aber ich Kackknub, meine Wii und mein N64, außer zum Glück die Games, habe ich weggeschmissen damals beim Umzug. Ansonsten schmeiße ich nichts weg, das weiß ich nicht, hätte ich wegschmeißen sollen, schmeiße ich weg. Naja, was wollte ich jetzt sagen? Keine Ahnung, ich bin müde wie Sau. Ich weiß nicht, was ich sagen wollte. Achso, ja wisst ihr, was ich noch habe? Ich habe noch im Schrank liegen eine Nvidia GTO, wie hieß dieses Ding? 7900 GTO, Alter, habe ich noch im Schrank liegen. Also, 15 Jahre alte Grafikkarten, ganz toll, das ist das, was die Welt gebraucht hat, ja. Ich mache heute übrigens nichts Großartiges, ich sage es euch gleich. Wir können ein bisschen schwätzen, können uns ein paar Sachen angucken, ich werde heute nichts Großartiges machen. Ich bin ziemlich im Arsch, ich war heute übrigens beim Zahnarzt. Zahnarzt ist immer richtig Sack. Du hast heute Prüfungsnoten bekommen. Ach ne, du hast gute Prüfungsnoten, was heißt für dich gute Prüfungsnoten und in welcher Prüfung? Alter, da hat man doch nichts, was soll es da großartig geben? Was ich tatsächlich überraschend fand, hätte ich gar nicht mit gerechnet. Es hat sich auf Twitter tatsächlich jemand gemeldet, ob ich nicht zu ihnen will und ich habe 5 Mails bekommen. Ne, 6, ich habe es hier gerade auf 6 Mails bekommen. Das hätte ich gar nicht gedacht, ich habe gedacht, was ist hier los? Einfach stream gemacht das letzte Mal, bin ich ein bisschen darüber ausgekotzt und nach dem Motto glaube ich muss mir einen neuen Job suchen und zack, 6 E-Mails. Gut, das meiste sind keine Angebote, das meiste sind, guck mal, bei uns gibt es was cooles. Ein paar davon sind wirklich Angebote, hätte ich gar nicht gedacht. Vielleicht muss ich mich ja gar nicht großartig bewerben, vielleicht ergibt sich ja aus diesen Sachen jetzt irgendwas. Mal gucken. Ne, aber ansonsten nichts. Kommunikationstechnik und Funktechnik. Funktechnik klingt richtig oldschool, wobei das wahrscheinlich nicht auf WLAN oder sowas bezieht. Ja, die würde ich auch aufheben. War nicht die Voodoo 3 das, die so berühmt war für das beste Anti-Alasing, was es hier gab oder so? Oder bringe ich das jetzt durcheinander? Mal ganz einfach abgesehen, es ist egal, ob es das beste Anti-Alasing war, was es hier gab, die gerade ist zu langsam und damit nichts sinnvolles zu machen. Außer für irgendwelche Retro, gut. Ey, wisst ihr was mich ja persönlich etwas schmerzt? Dass Spiele, die für mich mal richtig krass High-End waren heute Retro sind. Es gab Zeiten, da war Half-Life 1 mega State of the Art oder irgendwann Half-Life 2 oder 4, falls das noch jemand kennt oder Unreal. Also Unreal war damals. Heute, Unreal hatte eine Palme im ersten Level mit drei Pixel und alle haben gesagt, boah, das sieht da super realistisch aus, dieser Außenlevel. Und das ist heute Retro alles. Ich dachte, 5G ist gut, um Corona zu kriegen. Ja, das kann ich mir auch kaum vorstellen. Das kann ich mir auch nicht vorstellen, ich weiß noch, als das neu war. Das war noch zu Zeiten, wo Leute, wo es noch Emos gab. Kennt noch jemand Emos? Jetzt nicht, weil ich unbedingt Linkin Park gehört habe, aber das war so die Zeit, in der ich immer noch Emos hatte. Die sind alle weg. Zwei Jahre Massive Subscription, dazu kann ich bloß sagen, wenn ich das Emos finde, dazu kann ich bloß sagen. Danke für den Prime-Sub. Silberner Keks, drei Monate, vier Monate, bald gibt es den Diamant-Keks und ich brauche unbedingt neue Subscriber-Batches. Echt? Aber die richtigen Emos, die kommen nicht mehr. Die richtigen Emos, das waren die mit diesem schräg übers Auge hängenden Haarschnitt. Ich habe keine Ahnung, wie da wer heute bezeichnet wird. S-M-U-N-F-R. Bin mir nicht sicher, wie man das ausspricht, aber danke für den Prime-Sub. Ja, das waren die Zeiten, wo Twilight im Kino voll angesagt war. Wo die ganzen Mädels damals Twilight geguckt haben. Wobei ich sagen muss, das war nicht exakt meine Generation, das war eher eins danach. Meine Generation haben die Mädels Titanic geguckt im Kino. Siebenmal oder so. Im Kino. Und ich muss ehrlich sagen, der Film wird ja oft irgendwie gebashed, irgendwie, keine Ahnung, öls banales, langweiliges Zeug. Aber es gibt echt schlimmere Filme als Titanic. Also ich habe so deutlich mehr Shit gesehen. Ich würde jetzt nicht sagen, dass es der beste Film an der Zeit ist, aber man kann den sich durchaus angucken. Das ist schon okay. Bester Film an der Zeit ist eben Matrix 1. Kann mir keiner was sagen. Den Rest kannst du knicken. Ich bin heute nicht Bahn gefahren, ich war aber am Zahnplatz. Ich war morgen Bahn. Hat Max eigentlich ein Hals-Tattoo wie der Frisur? Nein, habe ich nicht. Wie kommst du darauf? Ne, habe ich nicht. Der Frasier hat ja mittlerweile nicht nur ein Hals-Tattoo, der Frasier hat ja mittlerweile ganz Körper-Tattoo, wenn du so willst. Der besteht ja fast nur noch aus Tattoos. Zumindest das letzte Mal, was ich gesehen habe. Und das wird ja eher mehr als weniger. Er arbeitet glaube ich sogar in einem Tattoo-Studio jetzt. Ja, Bahn fahren morgen. Ich bin wahrscheinlich wieder richtig ätzend. Mal schauen. Leute, ich bin übelst kaputt. Ich weiß gar nicht warum. Wahrscheinlich wegen der Betäubung vom Zahnarzt oder so. Ich bin voll im Arsch. Und es ist nicht, als hätte ich heute großartig was gemacht. Ich bin heute mal in 9 Kilometer ungefähr wieder. Ich sage jetzt mal wandern, weil ich die Leute immer verwirre, wenn ich sage, ich war laufen. Die denken immer, ich war joggen. Ich war nicht joggen, ich war laufen. Ich will ja nicht wieder Pepofett werden. Ich will ja, mich vereint Pepofetten weiter. Zahnarztschlauch. Wisst ihr, was ich beim Zahnarzt immer ganz toll finde? Die pumpen dir literweise Wasser in den Hals. Und dann sagen sie zu dir, einfach durch die Nase atmen. Dann ist das gar nicht schlimm. Alter, ich versuche es durch die Nase zu atmen. Das ist nicht so einfach, wenn man massig Wasser in den Hals gespritzt kriegt. Tja, die müssen sich nicht wundern, wenn immer mehr Leute sagen, Scheiß auf Bahn. Ich fahre wieder mit dem Auto. Dabei, in der aktuellen Zeit wäre es sogar besser denn je. Habt ihr auch mitgekriegt, dass uns unser Bundeskanzler auf sparen oder auf entbehrungsreiche Jahre eingeschworen hat oder versucht hat. Der Kerl kann mich mal. Ich entbehre hier gar nichts. Meine Stonks sind leider, laufen leider nicht gut. Aber welche Stonks laufen dieses Jahr schon gut. Ob das dann im Endeffekt so viel Unterschied macht. Leberwurst mit saure Gurken. Tier 1 Sub, Dankeschön. Du meinst, ich soll jetzt noch die restliche Kohle, die ich noch auf den Konten liegen habe, einfach noch mehr in Stonks hauen? Reinmetall lief gut ab der Ankündigung, als sie gesagt haben, es gibt neues Geld für die Bundeswehr, dann ging das ab. Und Heckler und Koch gingen auch übelst ab. Tja, ich mein, wenn für eine Sache der Krieg gut ist, dann für die Stonks der Rüstungsindustrie. Wie gesagt, ich habe insgesamt sechs Nachrichten bekommen. Das wenigste davon waren Angebote, sondern eher so guck mal, hier bei uns gibt es was. Aber es waren auch zwei, drei Angebote dabei. Hätte ich nicht gedacht, ja. Mittlerweile muss man sich anscheinend gar nicht mal bewerben. Sondern es reicht, wenn man in einem random Stream sagt, Leute, ich suche einen Job. Da kommen schon welche. Was ich ja persönlich sehr cool finde. Zumal es ja auch alles wirklich passende Sachen waren. Du bist dabei, so komplett random, Max, willst du nicht was mit Holz machen oder so? Ja, so ungefähr ist es bei meinen Stonks auch. Meine Stonks kannst du vergessen. Ein Angebot war von einer Stonks-Firma, die Trading-Zeug herstellt. Weiß nicht, wie zukunftssicher das ist. Aber der Job klingt gar nicht so schlecht. Ich habe keinen Bock mehr auf, weder auf die blaue Bank, noch auf das, wo ich gerade bin. Noch nicht so lange. Ich habe die ganze Geschichte jetzt mit Corona und Krise und so zum Anlass genommen, mich endlich mal ein bisschen mit der ETF-Thematik und vor allem mit, ich will mein Geld nicht die ganze Zeit auf dem Konto schimmeln lassen zu beschäftigen. Hab ich doch. Hab ich doch, guck mal in die Worts hier. Hab ich doch. Guck hier. Dein Bart, nice. Mein Bart auch. Leute, wenn ich jetzt auf halb acht hier im Stuhl hänge, penne ich gleich ein. Ich bin eh schon halb eingepennt vor dem Stream, weil ich so im Arsch war. Ich weiß nicht, es scheint eins schon an einem Zahnarzt heute zu liegen. Anders kann ich mir das nicht erklären. Und ich habe gedacht, ich muss jetzt den Stream anmachen, sonst wird das nix die nächsten Tage mit Streamen. Und wenn ich jetzt nicht irgendwas mache, dann penne ich ein. Meine Kopfstütze ist gerade runtergefallen, Zack. Ihr könnt euch überlegen, wie sehr ich hier gerade halb gelegen habe im Stuhl. So und gibt es irgendwas spannendes Neues Leute? Ich habe mir nichts vorgenommen. Ich habe einfach den Stream Titel geändert und den Stream angemacht. Ich habe mir. Visionelle Zahnreinigung. Das ist auch anstrengend, weil es spritzt ja auch literweise Wasser in den Hals. Der Pico V. Ach ja, stimmt hier Leute Pico V ASMR. Hört man das? Du schreibst die Archive AP in Go in. Was hattest du es denn bisher? War das Django? War das Django, was du bisher hattest? Ach ja, ja, gute Idee. Standard Library oder irgendwelche Go Frameworks interessiert mich. Go Web Anwendung wollte ich auch ein bisschen mal rumspielen. Also was ist am Pico V neu? Dass er zwei Wi-Fi eingebaut hat, Bluetooth und Wi-Fi. Allerdings haben sich die Jungs bei dem Firmware entwickeln gedacht, wir lassen die Bluetooth Funktionalität raus. Warum auch immer. Der Chip kann Bluetooth. Man muss aber dazu sagen. Richtig sehe ich genauso. Ich verstehe ihn um. Also ich verstehe die Existenzberechtigung des Raspberry Pi Picos generell beziehungsweise W auch nur beschränkt, weil so wie es für mich jetzt aktuell aussieht, ist jeder ESP32 besser. Aber das muss ich zeigen. Ich weiß noch nicht so genau. Vielleicht ist der Stromverbrauch besser oder so. Ich keine Ahnung. Wir werden uns das aber angucken. Ja, und man darf den Raspberry Pi Pico generell nicht mit einem normalen, weil hier so viele Fragen kommen, mit einem normalen Raspberry Pi verwechseln. Der normale Raspberry Pi ist ja ein Single Board, ein Platinen Computer mit Linux drauf. Der Pico beziehungsweise Pico V ist ja wirklich ein Micro Controller. Da läuft kein Linux, kein richtiges Betriebssystem drauf. Da läuft dein Sketch beziehungsweise deine Firmware drauf und fertig. Du musst dich da auch um Sachen wie Multithreading und so selbst kümmern oder Prozess Handling. Prozess gibt es ja gar nicht. Task Handling und sowas. Wenn du denn mehrere Tasks zu baut laufen lassen willst. Ja, der ESP hat auch mehr Leistung. Also ich verstehe es nicht so genau, wo der Sinn ist. Ja, naja, was das Real Time ist, das ist Free Erdos. Aber im Prinzip ist das ja kein richtiges Betriebssystem, was man sich da so, wenn man Linux kennt, drunter vorstellt. Also da lockst du dich nicht per SSH drauf ein und machst dann auf der Kommandozeile was oder so. Ja, das ist halt... Du machst dein Sketch, uploadest den, dann läuft der drauf und sonst nichts. Und um alle Sachen musst du dich selbst kümmern. Von WLAN bis Input lesen bis LEDs blinken, das musst du alles selbst machen. Ja, das ist das... das würde ich nicht in die gleiche Kategorie packen wie in Linux. Das was dir Free Erdos abnimmt ist quasi eine bessere Standard Library oder besseres Handling für Tasks und sowas. Ja, ich verstehe den Sinn auch nicht so genau, weil ganz im Ernst, man kann sich, man kann sich bei der Arduino-Geschichte ja teilweise schon ein bisschen über die Library-Qualität beschweren oder ja, es ist halt leider auch C++, aber trotzdem. Arduino ist quasi schon vorhanden, es gibt für alles mögliche irgendwelche Libraries. Meine Lieblingskombination ist E. ESP32 mit dem ESP32-China-Chinesen-Framework plus Arduino obendrauf für das wo man es braucht. Da kannst du unten an den Innereien rumdrehen und die benutzen und noch Arduino Libraries obendrauf wo man es braucht. Ja, die Original-Aduinos sind auch ziemlich der Sack. Die sind langsam, aber die Dinger sind halt ultra robust. Ja, also wenn ich ein U-Boot bauen würde, dann mit Arduino. Also was wusste wirklich drauf ankommt, dass der Kram funktioniert. Nicht, dass ich ein U-Boot bauen könnte oder so. Der ESP32 hat sogar drei Kerne. Der hat einen 8MHz Low-Power-Prozessor und zwei 240MHz... Boah, was sind das für Cores beim ESP32? Extensa oder sowas? Komische, komische CPUs hat das Ding. Aber die haben, leistungsmäßig sind die gar nicht übel. Ja, das stimmt. Da hast du nicht unrecht. Auf dem ESP32 musst du ein bisschen aufpassen. Wenn du deine Tasks so programmierst, dass sie quasi nicht geschallt CPU-Zeit abgeben. Oder wenn man WLAN und Bluetooth gleichzeitig verwenden will und auf dem Kern auch was berechnen, da muss man ein bisschen aufpassen. Aber man sollte, solange man den Kern nicht komplett auslastet, ist es eigentlich kein Problem. Was machen eigentlich? Nur mal schnell reingucken. Was gibt es denn aktuell eigentlich für GitHub Trends? Leute, wenn ihr irgendwas wissen wollt, wenn ihr irgendwas loswerden wollt oder mich zu irgendwas fragen wollt, so haut's raus. Ich hab heute nix geplant für den Stream. Ich hab einfach komplett ohne Vorbereitung eingeschaltet. Arshina Chinesen zeugt SMS-Boom Trended. Was ist der Sinn des Lebens, so viel zu machen, auf was du Bock hast, bis du irgendwann den Löffel abgibst? Was bin ich sehend? Was? Was seh ich hier? Chat, versteht irgendjemand was hier passiert? Also es ist ein China-Chinesen-Repo mit knapp 3000 Sternen. Ich könnte ein gutes PDF-Parser-Programm brauchen. Kannst du eins empfehlen? Du meinst Library? Nee, nee, kenn ich nix. Cringe, Max kann kein Chinesisch. Aber gut, Bitestrike, du kannst mir das bestimmt easy übersetzen. Du kannst das ja. Meta-Search-Engine. Gamecube-Modchip auf Raspberry Pi Basis, alles klar. So wirklich spannend ist ja da nicht dabei heute was Trended. YOLOX ist wieder am Start. Das ist irgendeine Image Recognition Software. Da blick ich aber auch nicht durch. Da gibt es YOLO 3, 4, 5, X. Keine Ahnung was da der Unterschied ist. Linux Trended. Ähnlich mal was Gescheites. Catch-2, ein C++-Framework. Oh nein. Please. China, Chinesen, solche, was einfach Web heißt, alles klar. Ok, die GitHub Trends sind tatsächlich ziemlich... Weakly Trend ist das gleiche. Nee, Fresh. Alter, warum hat Fresh einfach 6700 Sterne? Das ist ein neues Deno-Web-Framework. Das habe ich jetzt letztens in einem Video gesehen. Kannst du den Aufbau von Hypervisern erklären? Nicht so wirklich, jetzt aus dem Stegreif, wenn ich ehrlich bin. Ach so, ja dann. Dann wird es Zeit. Lest einfach den Wikipedia-Artikel, dann weißt du Bescheid. Schön, dass du es gefallen hast, dass du deinen Weg gefunden hast. Du hast heute mit einem Heim-Server auf einem Nuke angefangen. Ich bin ein kompletter Nuke, manche sind echt verzweifelt. Dies läuft jetzt der Pion. Was hast du für ein Betriebssystem drauf? Also wahrscheinlich Linux, aber welches? Ich denke nicht, dass es Arch, by the way, ist, weil Arch auf dem Server, auch wenn wir alle wissen, dass Arch die beste Linux-Restribution überhaupt ist, die es gibt und jemals geben wird und jemals gab und sonst was, auf dem Server ist Arch jetzt eher nicht so das. Rotsfett hat Subscribed, Dankeschön. Ja das ist wichtig, immer wenn das fällt, muss man Arch, by the way, erwähnen, vor allem wenn man das selbst benutzt. Windows-Server, gibt es wirklich Leute, die Windows-Server im Einsatz haben und dann darauf Docker laufen lassen und darauf dann irgendwie ihren Piehole oder so? Bikoima und ein Topfi haben Subscribed, Dankeschön. Massive Subs, Leute. Hyper-Subscription hier, eins nach dem anderen. Gibt es mit Sicherheit, ich fürchte auch, ich fürchte auch. Ja ich muss dazu sagen, ich kann es ja durchaus nachvollziehen, dass es Leute gibt, die Windows-Server verwenden. Es mag die ein oder anderen, auch wenn es für mich schwer vorstellbar ist. Er hat hier geantwortet, by the way. Was? Ach Ubuntu-Server, ja wunderbar, da hast du es richtig genommen. Also es mag hier den einen oder anderen Sinn geben, warum man Windows verwendet. Zum Beispiel, wenn man Active Directory Zeug machen will, bin ich froh, dass ich mich damit nicht beschäftigen muss. Und ja, vielleicht auch, wenn man, ne Moment, ISS ist die internationale Raumstation, IES ist der Internet Information Service und IS sind die Terroristen. Das ist aber auch schwierig, das ist ganz schön kompliziert, das klingt alles so ähnlich. Ich meine IES, also wenn man vielleicht IES-Anwendungen laufen lassen will, dann, aber es gibt, also mir fällt nichts ein, warum ich freiwillig IES-Anwendungen laufen lassen will. Weiß ich nicht, es gibt Leute, die machen das. Das ist der Internet Information Service, allein schon der Name kriegst du eigentlich für den Zapp. Ich persönlich bin auch kein Apache-Fan. Was ich mag ist, ja tatsächlich, also so als Feldwald und Wiesenwebserver, wenn man nicht so genau weiß, was man will, ist Nginx, finde ich immer eine gute Wahl. Aber ich persönlich, ich mag den hier, das ist ein Web-Server in Go und du kannst dir im Zweifelsfall, also entweder installierst du das über den Package Manager oder du kopierst dir das Binary irgendwo hin. Und das Schöne an dem ist halt, dass die ganze Let's Encrypt Hand, Traffic mag ich nicht als normalen Web-Server, Traffic ist ganz cool, wenn man beispielsweise mit irgendwelchen Containern oder irgendwelchen kontinuerisierten Umgebungen oder ja, irgendwelches Zeug, was skalierbar sein soll, wenn du dafür einen Eingangs-Load-Balancer oder sowas brauchst, dann finde ich Traffic ganz nice, der unterstützt ja zig Sachen, ja. Der unterstützt Docker direkt, der unterstützt, ich glaube, etcd mittlerweile, der unterstützt, da bin ich mir gar nicht so sicher, der kann Kubernetes-Cluster-Zeug auslesen. Also als Load-Balancer für irgendwelche skalierbaren Sachen ist Traffic wunderbar, aber als einfache Reverse-Proxy, Load-Balancer und Web-Server finde ich Cardi deutlich besser, zumal die Traffic-Konfiguration richtig abfuck ist. Also in Traffic alles, was du nicht, also ich rede hier von, also alles, was du nicht automatisch machen kannst in Traffic ist die Konfig abartig. Schau ich mal sowas hier an, es wird noch schlimmer, das finde ich Traffic deutlich angenehmer, aber ansonsten, wenn man nicht weiß, was genau Engine X tut auch immer, aber gerade wenn man Let's Encrypt braucht und Zertifikatsverwaltung, die automatisch passieren soll, dann ist es äußerst sinnig uns zu empfehlen, sich mal das hier anzugucken. Da würde ich ihr nichts drauf geben, auf diese ganzen, ähm, das ist eine gute Frage. Was ist denn für dich reines, reines Layer 4 Load-Balancing? Load-Balancing ist in der Regel immer Layer 4. Oder, Fiber, das, ja, das, das habe ich auch, das habe ich auch mir angeguckt, also nein, das habe ich mir ausgeguckt, dass ich mir das mal angucken will. Kaji TCP Load-Balancer, ja, okay, der Load-Balancer, der HTTPS terminiert, das ist dann ja auch kein reiner Load-Balancer mehr. Das ist dann eher so ein Anwendungsproxy oder so, keine Ahnung. Ich habe ehrlich gesagt, keine Ahnung. Ich verwende Kaji zu 99% als Reverse-Proxy. Kaji ist glaube ich auch in Go. Ich meine, Load-Balancing ist in der Regel immer eine Mischung aus Layer 3 und 4, logischerweise. Du hast dann beispielsweise eine Public-IP und ein Port, den du halt weiterleitest auf, keine Ahnung, drei Abserver hinten dran. Vielleicht auf einem anderen Port. Oder ansonsten bin ich mir nicht sicher, was du meinst. Kann Kaji PHP sagen? Ja, ich glaube schon, dass du damit auch ganz normal PHP Zeug aufrufen kannst, habe ich aber noch nicht gemacht. Wie gesagt, es ging ja auch weniger um Load-Balancer, mehr um Webserver. Ich verwende Kaji zu 99% als Reverse-Proxy für Let's Encrypt bzw. für statische Content zum Ausliefern. Und dafür ist Kaji einfach unschlagbar gut. Statisches Go-Binary, falls es das nicht gibt, in der aktuellen Version. Im Package Manager. Und ab geht's. Die Config, drei Zeilen, fertig geht. Let's Encrypt eingebaut. Für das meiste, was man braucht. Leider keine Azure-Unterstützung standardmäßig, aber es gibt Azure-Module für Kaji. Kevo, Dankeschön für den Sub. Nee, noch nicht. Morgen. Wie gesagt, ich glaube Go. Ja, das funktioniert ja auch alles, wenn du IP. Das ist ja alles, was oben drüber ist, funktioniert ja dann auch. Wie darf ich mir reines, jetzt sehr ernsthaft, wie darf ich mir reines Layer 7 Load Balancing vorstellen? Ich mein, du musst ja irgendwie den Traffic annehmen und dann auf die einzelnen Server verteilen. Das kannst du ja nicht rein auf Layer 7 machen. Oder ist Layer 7 Load Balancing, du rotierst die Stühle vom Bildschirm durch. Du hast quasi einen Bildschirm und du hast quasi so drei Anwender, die dann im Kreis immer rotiert werden vom Schreibtisch. Oder ist das Layer 7 Load Balancing? Osilayer ist eh so ein Ding, das ist fast für die Berufsschule. Ich weiß da auch einiges nicht mehr, aber es gibt ein paar Sachen, die einen verwirren. Zum Beispiel, welcher Layer ist jetzt eigentlich ein Abrequest? Es kann man so nicht direkt sagen. Das ist eher so Layer 2 und 3 und so gemischt. Ja, aber die müssen trotzdem irgendwie den Traffic weiter schicken und rein mit Layer 7 geht das halt nicht. F, keine Ahnung. Ja, das triffts, das triffts denke ich ganz gut, ja. Leute, ich bin übelst im Arsch heute, das ist mir zu großer Five Head Talk im Chat gerade. Was ist nochmal Layer, Layer Schicht, das hier, das was man in jeder Berufsschule lernt, das Osimodel. Guck ja, das da. Ach so heißt der Kram in Deutsch, Bit Übertragungsschicht. Das habe ich, wie der Krempl auf Deutsch heißt, habe ich schon komplett verdrängt. Bit Übertragungsschicht, Sicherungsschicht, Vermittlungsschicht, Transportschicht, was? Kommunikationssteuer, das hätte ich nicht gewusst. Das habe ich noch nie gehört. Habt ihr schon mal Kommunikationssteuerschicht gehört? Vielleicht Leute, die in der letzten Zeit irgendwie mal. Ja, das kenne ich, Sitzung, Session, ich sage auch immer Session. Datendarstellungsschicht, meine Güte. Warum der Layer 6 existiert, ich habe keine Ahnung. In der Regel hört es mich auf, ab Layer 5 oder ab Layer 4 zu interessieren. Warum ist das ein WLAN Symbol? Ach so, weil Übertragung und so. Wobei das WLAN Symbol ist hier eigentlich falsch. Das WLAN Symbol musste eigentlich auf der gleichen Ebene sein. Wobei, die wissen auch nicht so genau, was sie hier für Icons verwendet haben, oder? Hör mal auf, ich habe da. Das kann ich noch nicht als Merksatz. Ja, WLAN wäre genau. Also nicht WLAN, sondern das reine Übertragen. Das wäre Schicht 1, deswegen verstehe ich es auch nicht genau, warum wir hier so ein WLAN Symbol haben. Da hätten sie hier irgendwie Netzwerkgeräte, aber egal. Komm, das, who cares, OSI Zeug. WLAN ist keine Bridge. Eine Bridge ist ja das, was ein Switch macht, nur mit zwei Ports. Deswegen ist ein Switch auch eine Multiport Bridge. Eine Bridge kann zum Beispiel gucken, welche Mac-Adressen hinter welchen Ports sind. Und segmentiert das Netz und sorgt, jetzt Leute, jetzt müsst ihr mir helfen, ob das stimmt, was ich erzähle. Das ist bei mir schon 15 Jahre her. Und limitiert die Broadcast-Domäne. Stimmt das? Ich weiß es nicht mehr genau. Stimmt das, ja? Ich kuck das nicht mal genau zusammen. Kollisionsgedöns und so. Nee, ich rede von Bridges, nicht von Routern. Ach, keine Ahnung, das ist zu lange her. Und WLAN ist im Prinzip das reine Übertragen durch die Luft. Der Router ist keine Bridge, nein. Ein Switch ist eine Bridge. Ein Switch ist eine Bridge mit mehreren Ports. Ach nein, ihr habt recht. Die Kollision, die Kollisions-Domäne wird... Nee. Ach, keine Ahnung, das ist zu lange her. Keine Ahnung. Ja, siehste. Was soll ich sagen da, bei mir ist das 15 Jahre her. Wer braucht diesen Shit? Ja, wenn du was mit Netzwerktechnik machst, brauchst du den Shit immer mal wieder. Ja, das ist okay. Aber das reine Übertragen bei WLAN, das ist Layer 1. Bei WLAN ist ja quasi, man kann nicht sagen die Luft Layer 1. So, die Wellen durch die Luft ist quasi Layer 1. Ja, cringe, wer noch nicht sein eigenes TCP implementiert hat. Chat, habt ihr auch schon alle gemacht, oder? Also ansonsten würde ich mich fragen, was ihr hier macht. Also ich glaube, so die Mindestvoraussetzung hier sollte eigentlich sein, dass man mal sein eigenes TCP implementiert hat. Also, wenn du die Frage stellen musst, liegt das an C++? Dann kann man in der Regel sagen, ja, es liegt immer an C++. Aber in dem Fall können die nichts dafür, weil das ESP2, also das ESP, das Espressive Framework, das ist reines C, hat nichts mit C++ zu tun. Das was kacke ist, ist wahrscheinlich das Arduino Zeug oben drüber, was nicht richtig tut. Du hast IPv7 schon fertig, ja, das ist gut. Das kommt, nachdem sich IPv6 flächendeckend durchgesetzt hat. Also nie wahrscheinlich. Leute, ich habe euch ja schon gesagt, was meine persönliche Vermutung ist. Und zwar, ich glaube, dass sich IPv6 nie durchsetzen wird. Ich persönlich gehe ja davon aus, und ja, es kann sein, dass es technisch gar nicht möglich ist, was ich jetzt sage, so ohne weiteres. Aber ich persönlich gehe davon aus, dass es folgendermaßen kommt. Man müht sich jetzt noch ein paar Jahre mit IPv6 ab und irgendwann kommt dann Google, Facebook, Microsoft und die üblichen Verdächtigen in Bedrängnis. Amazon in Bedrängnis und hat irgendwann Angst, dass ihr jetzt wirklich die knappen IPv4-Adressen ihr Geschäft schädigt. Und aus irgendwelchen Gründen IPv6 bei ihnen nicht so einfach das Problem löst. Und dann wird folgendes passieren, dann wird Microsoft, Amazon, Google und Konsorten sich zusammen sowas wie IPv4,5 überlegen. Und es wird der abartigste Hack aller Zeiten rausgeholt, um sowas wie IPv4,5 zu machen. Und es wird wahrscheinlich nicht doppelt das Nutt sein. Es wird irgendwas anderes sein. Und nachdem es Microsoft, Google und Hasse nicht gesehen ist, ist das ratzfatz in allen Betriebssystemen und Mobile-Geräten integriert. Deutlich schneller als sich je IPv6 durchsetzen wird, selbst dann. Und ja, Netzwerkgeräte und die ganze Internetinfrastruktur muss es trotzdem unterstützen. Allerdings könnte ich mir vorstellen, dass das wirklich ein mega krasser Hack wird. Dass es quasi etwas Abwärtskompatibles zu IPv4 wird. Dass man sagt, man macht IPv4 Extended. Dass man dann zum Beispiel, also ich denke mir jetzt nur mal was total Abartiges aus, was so ähnlich vielleicht man machen könnte. Ich weiß nicht, ob es technisch möglich ist. Man könnte sich zum Beispiel reservierte IPv4 Adressen angucken. Und dann sagt man zum Beispiel, oder man guckt, ob es gewisse Bitkombinationen gibt, die nur bei reservierten Adressen vorkommen. Und dann könnte man quasi, wenn diese Bits gesetzt sind, noch was hinten dran hängen oder so. So ein bisschen wie es UTF-8 macht. Bei UTF-8 ist es ja so, wenn das letzte Byte gesetzt ist, dann geht das Zeichen weiter oder sowas. Irgendwie sowas in der Richtung. Ich traue denen sehr viel zu, was komische Hacks angeht. Nee, heute wird nicht die Schlange gebändigt. Also ich könnte mir tatsächlich vorstellen, sowas kommt. Das kommt bevor sich IPv6 Flashstriken durchsetzen kann. Kann Amazon mittlerweile? Ist Amazon eigentlich mittlerweile über IPv6 erreichbar? Oder was, Twitter wusste ich nicht? Nee, Twitter geht schon lange, gell? Theoretisch müsstest du in IPv4 Adressen investieren, ja. Ich weiß aber nicht, ob man das so einfach geht, weil Handel mit IPv4 Adressen ist ja eigentlich verboten. Es passiert trotzdem, ja. Aber ein Kollege von mir auf der Arbeit, der hat früher mal beim Dezix gearbeitet. Der hatte einen persönlichen Flash, ich weiß nicht, Flash 24 Block oder sowas aus der Zeit noch. Und wisst ihr was der gemacht hat mit seinem persönlichen IPv4 Flash 24 Block? Und ich weiß nicht, ob es ein Flash 24, ich sag jetzt einfach Flash 24 Block. Weißt was, wisst ihr was der damit gemacht hat? Der hat das einfach zurückgegeben. Einfach im Interesse des Allgemeinwohls hat er seinen eigenen Block zurückgegeben, den er sich irgendwann mal gesichert hat vor 20 Jahren oder so. Hat nichts dafür bekommen und hat es zurückgegeben. Aber muss man sagen, Hut ab. Vielleicht, aber ich kann mir das bei ihm gut vorstellen, dass er das von sich aus gesagt und gemacht hat. Und sonst Leute, hab ich irgendwas wichtiges verpasst? War heute irgendwas? Was sagt dann Halse? Halse sagt, Big Brain, wir sollten nicht immer noch Javascript nutzen, warum nicht? Naja komm, wenn der Javascript Experte Grogford das sagt, dann ist ja alles gut. Yep, Grogford. Ja was da beschlossen wird, hab ich mittlerweile eh keinerlei Vertrauen mehr, dass da irgendwas Sinnvolles beschlossen wird. Zero Day Lücke in Chrome, ach deswegen gab es heute ein Update wahrscheinlich. Verstehe. Oh, britische voll Hickwischen und Dahua. Warum? China-Chinesen Kameras, beste, vor allem mit geflashter Firmware. Warum? Warum soll ich keine Hickwischen und Dahua mehr? Außer, dass die menschenrechtlich fragwürdige Sachen gemacht haben. Also ich hab keine Hickwischen Kamera im Einsatz, ich hab Reolink, das ist aber auch so ein billiges China-Chinesen Ding. Dafür funktioniert es komplett offline. Zumal ich es eh in meinem IoT-Netz stehen habe, also ich hab ja von denen ein paar Kameras, das nirgends wohin darf. In meinem IoT-Netz darf noch nicht mal ein DNS oder sonst was raus, gar nichts. Das finde ich jetzt aber ein bisschen cringe, dass die irgendwie Kinder damit beobachten wollen. Warum sollte man sowas machen wollen? Guck mal, die haben sogar Lichter, beste. Aber gut, die China-Chinesen Produktfoto sind eh immer ein bisschen fragwürdig. Fahrradmusik, genau, ist gerade. Das Ding sieht ja mal hässlich aus. Ja, von denen habe ich ein paar Kameras, die funktionieren ganz gut. Und weil ich gerade Flash-Player gelesen habe, wisst ihr, dass sie den Flash-Player erst mit dem letzten größeren Firmware-Update rausgeschmissen haben und HTML5 reingemacht haben? Bis dahin liefen diese ganzen Kameras immer noch über Flash-Player. Eine NFT-Spielekonsole, ernsthaft? Machen das eigentlich, also machen das irgendwie Leute, die da ernsthaft ein Produkt rausbringen wollen? Oder ist das einfach nur NFT-Stonks? Also ist das was, was irgendwann jemals erscheint oder Roadmap? Ja, okay, das kommt nie raus, das Ding. Das, das kommt nie raus. Das oder, naja, vielleicht kommt es raus. Ich meine, diese Ouya-Konsole ist auch rausgekommen, falls sich da noch irgendjemand dran erinnert. Das hat ihnen aber auch nichts gebracht. Da ist die Sache schon mal gelaufen für mich. HTML5? Also JavaScript verstehe ich, aber HTML5? Fingerprint-Sensor für mehr NFT. Naja, ich bin ja skeptisch, was solche Produkte angeht. Ich meine, immerhin haben sie schon geschafft, ein 3D-Renderbild zu haben. Das ist ja schon mal mehr, als viele NFT-Spiele überhaupt bis jetzt jemals geschafft haben. Mehr Infos hier, kommt jetzt, never gonna give you up. Ach so, äh, 18 Minuten Video will ich jetzt nicht gucken. Ja, mit IP-Buns musste bei IPv6 wirklich nicht mehr kommen. Ich muss beim Zahnarzt jetzt 60 Euro bezahlen. Ich war heute beim Zahnarzt. Wisst ihr, was ich, wisst ihr, was ich sehr nice finden würde? Warum kann man seinen Zahnarzt nicht per PayPal bezahlen? Warum muss es immer Überweisung oder Bankkarte direkt sein? Warum akzeptieren die eigentlich keinen PayPal? Das wäre viel einfacher, dann hätte ich einfach vom Handy schnell PayPal überwiesen. Davon, ja, 60 Euro, ja. Weil Spezialfüllung. Ich nehme immer die bessere Füllung, weil ich will, dass meine Füllung länger hält. Und, und natürlicher aussieht. Man kann im Internet fast überall PayPal nutzen, aber offline halt kaum. Ja, anscheinend nicht genug, ja. Wird hier irgendwas, ok, YouTube. Ich weiß nicht, was mit dem Algorithmus los ist, aber das macht YouTube in letzter Zeit gerne 10 Jahre alte Videos auf einmal in den Algorithmus befördern. Da hast du ordentlich was zu schaukeln. Yep, Glock. Das ist quasi der abschließende Klingeltest, oder wie? Alles klar. YouTube, Dankeschön Algorithmus, dass du mir das empfohlen hast. Jetzt bin ich um ein Vielfaches schlauer. Du hattest schon wieder mein Schneestellvideo, ja. Ich weiß, der YouTube-Algorithmus mag das und ich weiß nicht, warum der das mag. Das ist wirklich eines der großen Rätsel von YouTube, warum mein Video im Garten 2,5 Millionen Views hat. Ich habe keine Ahnung. Wollen wir mal gucken, welche Bewertung das mittlerweile hat? Wie viele Bewertungen das hat? Hier im Garten. Ok, sorry, nicht 2,5, nur 2 Millionen Views. Nur 2 Millionen Views auf einem Gartenvideo. Nur 2 Millionen. 2 Millionen Views. Muss man sich mal auf der Zunge zergehen lassen. Ein Video, wo ich durch den Garten laufe bei mir. Die Bewertungen sind auch eigentlich verhältnismäßig gut für das, dass dieses Video komplett uninteressant für 99,99999% der Zuschauer war. Fick real life hinten dran? Naja. Das fragen sich alle Pratsator. Man weiß es nicht. Man weiß es nicht. Wir werden es wirklich nie verstehen. Lass mal den Barnrage schauen. Nee, nee, nee, nee, wir schauen jetzt keinen Barnrage. Was haben wir noch für Videos offen zum gucken? Should you build your, was, nee, should you buy or build a NAS? Trifestore? Nee, das will ich mir jetzt nicht angucken. Specs. Ganz ehrlich, ich würde ein NAS kaufen und bilden. Also ich würde irgendwas kaufen und damit dann ein NAS bauen. So ein eigenes, so ein eigenes Gehäuse mit Dings. Also wenn schon überhaupt, dann hätte ich Wechsel, Festplats, also Wechselrahmen für die Festplatten, weil das eigentlich, finde ich, wird das wichtigste ist. Aha, ein Unraid User. Was ist das? Meine Vorschau funktioniert nicht, Leute. Ach, auf meinem zweiten Monitor funktioniert sie aber. Max, hast du schon mal was mit OpenFlow gemacht? Nein. Sagt mir überhaupt gar nichts. Aha, nee, das kenne ich nicht. Das sagt mir wirklich gar nichts. Ja, keine Ahnung. Im Geschäft? Nö. Das haben da doch kaum jemand mitgekriegt. Ist nicht so, als würde die halbe Firma meine Streams gucken oder so, zum Glück nicht. Das benutzt Google fürs interne Routing. Ja, dann wird es ja genau das Richtige fürs Home Lab. Nee, ich habe mir die Stellenanzeige angeguckt. Ich bin da nicht big brain genug für, um als.NET Entwickler zu arbeiten. Nico sagt war heute im Termin mit der Digital Ministerin unseres Bundeslandes. Sie hat uns gefragt, wie sie die Saas Anwendung auf ihren PC speichert und starten kann. Also ich weiß jetzt nicht, was ich besser oder schlechter finde, dass diese Frage so gestellt wird. Nico sag mir, was ich davon halten soll. Ich meine, dass sie das nicht genau weiß, dass die Anwendung jetzt halt nicht lokal läuft. Ich meine, ein Digital Minister muss sich mit Cloud Technik nicht auskennen. Sie hat die Software für mehrere Millionen entwickeln. Ja gut, das heißt auch noch nicht, dass sie weiß, was da eigentlich passiert ist. Ich meine, guckt ihr mal beispielsweise an, was es für IT Projekte die letzten Jahre über gab und wie viele davon was geworden sind. Kann sich doch jemand an die an die elektronische Gesundheitskarte erinnern? Oder benutzt irgendjemand vom neuen Personalausweis diese Sachen mit Dokumente freigeben und was? Da gibt es so viele Sachen. Ja, theoretisch geht das. Das verwendet nur keiner. Also ich cringe immer, wenn irgendwelche IT Projekte angekündigt werden. Und ich denke mir immer, das klappt doch eh nicht. Und wisst ihr eigentlich, dass das schlimm ist, dass man standardmäßig mittlerweile davon ausgehen muss, dass es nicht klappt? Ich meine, wir haben eigentlich das Knowhow und die Leute, dass sowas klappen kann. Es ist jetzt ja nicht so, als wären wir komplette Noobs, was das angeht. Wir haben durchaus Leute mit Ahnung, aber ich weiß nicht, was es ist. Diese Projekte, die dort geplant werden, ich glaube, die haben komplett falsche Anreize. Da geht es gar nicht darum, ein gutes Produkt zu entwickeln, da geht es darum, möglichst langsam zu sein und möglichst viel Geld abzugreifen. Ich glaube, das ist einfach nicht gut gemanagt. Also jeder Manager würde dafür wahrscheinlich hochkantig rausfliegen. Der neue Personalausweis sackt, dafür muss man Fingerabdrücke abgeben. Ja, komm, die haben viel gesagt, wenn der Tag lang ist. Kennt ihr noch diese Aussage, Leute? Aber ich habe sie auf Twitter gepostet. 50 MBit. Kennt ihr das noch? Von 2017. Ich bin mir nicht sicher, ob bei jedem mittlerweile 2017 ist oder 2018 ist. Aber ich gehe stark davon aus, wenn wir jetzt auf den Breitbandatlas gucken, werden wir feststellen, es ist noch nicht bei allen Haushalten 2018. G-Stairs, danke schön für den Sub. Und dann? Und dann? Geht er kaputt oder? Aber deine Fingerabdrücke kriegst du auch nicht wieder. Und ist das gut oder schlecht, wenn der Chip kaputt geht? Wahrscheinlich ist es gut, dass keiner heimlich Sachen auslesen kann oder? Rfid Hülle. Ja, so eine Rfid Hülle wäre mittlerweile bei den ganzen Karten tatsächlich gar nicht mal verkehrt. Taugen die Dinger was? Also hilft das wirklich? Ich hab keinen Portemonnaie, ich will auch keins mitnehmen. Also ich hab, wenn ich aus dem Haus gehe, eigentlich nichts dabei, außer meine Fahrkarte, meine Eintrittskarte für die Arbeit und 10 Euro. Also an Karten und Geld und sowas. Kein Person, nö nix. Steiner, danke schön für den Sub. Doch! Ich hab seit einer Weile, ne ne, das ist noch, das ist ne, das ist ne Chipkarte. Das ist nicht Tost, keinen Personalausweis mitzunehmen, das ist vollkommen in Ordnung. Ich hab seit einer Weile noch ein, oh wie heißt diese Hersteller, so eine Karte dabei. Sowas hier, allerdings nicht, wobei das könnte es tatsächlich sein, so eine Karte hab ich seit einer Weile noch dabei. Hat sich tatsächlich schon ein paar Mal als nützlich herausgestellt, ja, z.B. wenn man sich irgendwie meine Augenbraue abschneiden muss oder sowas. Gar nicht schlecht so ein Teil dabei zu haben. Das ist quasi ein Taschenmesser, nur nicht in Taschenmesserform, wenn man es so will. Das ist echt praktisch so ein Teil. Aber sonst hab ich nix dabei. Also das ist ein Stift, das ist ein Stift, das sind Pinzette, das ist ne Feile, die Feile hab ich eigentlich selber nicht gebraucht. Das ist ein Nagel, ich wusste gar nicht, dass das Ding ein Nagel hat, aber ok. Pinzette, Zahnstocher, wenn du in die USA fliegst, kannst du das nicht mitnehmen, du darfst ins Flugzeug kein Messer mitnehmen. Es gibt aber auch ein Nailcare Kit, da ist das eine Feile anstatt ein Messer, das darfst du mit ins Flugzeug nehmen. Ja ohne Schere. Leatherman Tools sind vor allem größer und mehr dran und schwerer. Für einfach ab und zu mal oder wenn man sich Augenbrau abschneiden muss, dann ist das wunderbar. Ja gut, wenn du in die USA fliegst, kannst du natürlich gleich ein M16 mitnehmen. Dann schon richtig. Warte mal, ist das das AR15, ist das das M16? Die Zivile M16 oder das Zivile M4? Das ist ja alles mehr oder weniger die gleichen Bauteile, das ist ja irgendwie alles ziemlich austauschbar. Freedom, ja alles, das ist halt Ami-Logik. Freedom, brauchst erstmal 20 Assault Rifles daheim für mehr Freiheit. Ja ist es auch und ich glaube das AR15 ist quasi die Zivile Variante davon. Aber juckt mich auch nicht weiter. Das ist ein M16, aha. Leute, ich bin so im Arsch heute, das ist der Wahnsinn. Gibt es noch irgendwelche spannenden Themen oder muss ich einschlafen? Also heute ist wirklich der schlimmste bzw. größte in den Seilen hängen Stream aller Zeiten. Eigentlich ist Bedge, Bedge ist erst in 30 Minuten. Was ist das? Was? If you support free software, you should support gun rights. What? Was hat das, ich will mir das jetzt nicht anhören ehrlich gesagt, aber nur mal so vom Überschrift. Was hat das eine jetzt so genau mit dem anderen zu tun? Das ist Chibate, oder? Kein Chibate? Naja vielleicht hat er ja da irgendwie eine sinnvolle Begründung für, keine Ahnung. Ich sehe den Zusammenhang jetzt nicht so wirklich ab. Man kann ja seine Meinung haben. Ja ich weiß bei den Amis ist es halt viel so, die sagen, also eines der Hauptargumente bei den Amis ist ja, ich brauche eine Waffe, weil wenn jemand mit einer Waffe vor mir steht, muss ich mich ja mit meiner Waffe gegen seine Waffe verteidigen können. Das ist für die halt Freedom, dass du mit dem Assault Rifle draußen rumlaufen kannst. Ich glaube wir können das schlecht nachvollziehen ehrlich gesagt hier. Bei uns ist es halt schon, ja ich weiß gar nicht seit wann, schon immer, dass du keine Assault Rifle daheim haben darfst. Die Amis sehen das halt irgendwie anders. Freedom. Kokona. Mehr Freedom einfach nur. Und wo wir gerade bei Freedom sind. Das ist aber kein original, kein richtig gutes BBQ Pitball Video. Ich brauche das mit dem richtig echten Kokona Intro. Genau. Also mehr Kokona geht nicht als dieser Channel. Ich glaube der Vergleich ist gar nicht so verkehrt. Wenn bei uns einer sagt Tempolimits sind alle am schreien und wenn bei den Amos, bei den Amos ja, wenn bei den Amis einer sagt keine Ammo mehr und keine Guns, dann sind auch viele am schreien. Ich guckte nicht regelmäßig, keine Ahnung. Ich dachte erst als ich die Überschrift gesehen habe, das Video ist debate, aber mein Video ist debate. Man sieht das in den USA halt anders. Control your Windows PC with Home Assistant. Braucht mein Windows PC nicht mit Home Assistant Kontrollen. Ich habe Maus und Tastatur an meinem Windows PC. Das Kontrollt sich mit Maus und Tastatur besser. Ich wusste halt beim Zahnarzt so eine komische Chlorlösung oder was das war zum Desinfizieren. Eine Minute im Mund hin und her machen wegen Corona. Das schmeckt immer noch richtig nach wie Schwimmbad. Ich habe immer noch diesen Schwimmbad Geschmack im Mund. Schwimmbad Wasser Geschmack. Das weiß ich, dass er 6 Euro ist, ich habe doch zwei Stück bestellt. Ich refresche YouTube jetzt so lange bis etwas interessantes kommt. Mal gucken wie lange das dauert. Scheinlich zu klappen. Funktioniert nicht. Okay jetzt ist vorbei. Ich kriege meine eigenen Videos jetzt vorgeschlagen. Da weiß ich, ich bin am Ende vom Internet angekommen. Hier ist das Internet vorbei. Ich bin wieder bei mir gelandet. Norddeutsch. Ja das kenne ich schon. Das haben wir sogar mal im Stream. Ja das haben wir schon mal zusammen geguckt. Kann diese Waffe mich schützen? Ja wahrscheinlich nicht wirklich. Hi Leute wir müssen noch eine halbe Stunde schwätzen. Sagt mal gibt es irgendwas spannendes noch? Wie sieht es eigentlich aus? Abschlussprüfung ist durch alles schon oder? Physi technisch. Wobei nee. Ich hatte meine im August glaube ich. Das kommt jetzt noch. Physi Abschlussprüfung oder? Die kommen doch jetzt noch. C++. Wait a minute. What the fuck? Was hat das mit C++ zu tun? Irgendwelche komischen Meme Videos, die gucken wir jetzt nicht an. War das nicht letzten Monat? Also ich bilde mir ein, ich hatte meine Abschlussprüfung im August. Nee da bin ich wahrscheinlich zu boomer für. Dann erklärts mir mal. Was gibt es da? Was gibt es da dran zu verstehen? Okay ich verstehe. Leute ich verstehe. Ich muss die Zoomer Generation besser verstehen. Okay es ist ein 1 Minute 33 Video mit Memes und Bildschirmtext und Giga Chat. Das ist für alle mit keiner Aufmerksamkeitsspanne oder? Weil es wird äußerst schnell geschnitten und es passiert laufend irgendwas. Es kann mir doch keiner erzählen, dass das jemand gelesen hat in dieser Zeit oder? Das hat doch im Leben keiner gelesen. Okay ich gebe zu. Dafür bin ich zu boomer. Aber ich finde das gar nicht schlimm in dem Fall. Das ist quasi eine Meme Collection wenn ich das richtig verstehe. Das ist quasi eine Meme Collection im vorgespult quasi. Also es gibt Dinge die verstehe ich. Wahrscheinlich werde ich die nie verstehen. Aber gut. Ich benutze auch kein TikTok was wahrscheinlich der Grund ist warum ich es nicht verstehe. Es ist wieder Zeit sich boober zu fühlen stimmts? Denken sich jetzt alle hier. Memereviews wann? Moment man kann Memes reviewen? Na gut ich mein man kann auch was weiß ich Unge reactet auf Inscope 21. Wo Nico reactet auf den und dann reactet er auf den und den kann man zugucken wie sie reacten. Also mittlerweile ist ja Reaction Videos komplettes Inception. Du hast mittlerweile in Reaction Videos teilweise 4 Webcams von 4 unterschiedliche Leuten die sich überlagern. Und dann zum Abschluss guckt nochmal der Ursprungs Reactor sich die Reactions der anderen Leute auf seine Reaction an. Der ist dann mit seiner Webcam so über seiner eigenen Webcam und dann drunter nochmal 5 andere Webcams. Also ganz ehrlich Reaction Videos sind komplett aus der Kontrolle geraten mittlerweile. Ich müsste auch mal wieder reacten. Das ist auch jemand ich hör diesen Namen in letzter Zeit öfters und ich habe keinen Plastenschimmer wer das ist. Ich will aber auch nicht danach suchen. Wie viel Subscriber hat Pewdiepie eigentlich? Mittlerweile. Es ist ja glaube ich nicht mehr der größte Channel oder? 111 Millionen näher der hat mehr als mein Gartenstells Videos views hat. Ritter Ross Danke für den Sub. Der größte Channel also ich kann mich ja noch dran erinnern dass ihn irgendeinen irgendein indischer Musik Channel überholt hat mal vor 2 Jahren oder so. Ich weiß nicht ob MrBeast schon größer ist. Was hat denn MrBeast mittlerweile für Subs? He serious war das genau. Der hat ihn noch nicht überholt aber der wird ihn wahrscheinlich bald überholen. Leute ihr könnt übrigens ist mir letztens wieder bei jemand auf der Arbeit aufgefallen. Ihr könnt froh sein dass ich überhaupt Zoomer genug bin dass ich weiß wie man Memes richtig ausspricht. Letztens auf der Arbeit wieder jemand was von Memes erzählt. Noch schlimmer ist Memes. Memes von Memes hat letztens einer was erzählt. Memes Memes Das ist aber schon richtig richtig boomer mit Bart. Also ich bin tatsächlich muss ich jetzt mal ehrlich was was Internet Trends angeht und YouTube und Livestreams und sowas. Bin ich wahrscheinlich der größte Zoomer bei uns auf der Arbeit. Obwohl ich nicht der jüngste auf der Arbeit bin. Die haben alle gar keine Ahnung von. Ist nicht so was man von großartig Ahnung haben muss ja. Ich habe heute aus Versehen POC gesagt auf unserer Weekly Wartungsarbeiten Runde. Gab keinerlei Reaktion. Ich habe was vorgestellt auf der Runde also Wartungsarbeiten von uns. Und danach mute ich mich normalerweise immer. Und ich habe mich auch gemuted aber ich wusste es kommt in zwei Punkten noch mal Wartungsarbeiten von uns dran zu denen ich was sagen muss. Und da habe ich mich aus irgendwelchen Gründen schon etwas früher entmuted. Bevor ich dran war weil unser Ober Change Manager noch irgendwelche anderen Themen besprechen musste. Und da habe ich doch allen Ernstes bei nebenbei im Teams was geschrieben. Und irgendwie überkam es mich dann so und ich habe gesagt POC. Wobei ich nicht POC gesagt habe ich habe eher gesagt POG. Es gab keine Reaktion die haben einfach weiter geredet. Es hat keiner richtig realisiert und ich glaube es gibt nicht befremdliches Schweigen. Es gab keine Reaktion drauf die haben ja sich über andere Sachen unterhalten ja. Und ich habe da ganz normal den Change vorgestellt. Bist du auch immer so schockiert dass die Jugend keine Disketten mehr kennen? Das glaube ich nicht die Jugend kennt Disketten. Die kennen Disketten aus irgendwelchen Meme Videos oder diesem komischen YouTube Channel. Der die Star Wars Musik auf Floppies gespielt hat. Die wissen aber nicht mehr wie man Disketten richtig verwendet wahrscheinlich. So nach dem Motto mit diesem Read-Write Schalter oben links. Was oben links? Die haben immer drauf geguckt weil man es oben rechts rumgedreht hat. Diesen Read-Write Schalter. Wahrscheinlich wissen die auch nicht wie rum eine Diskette reinsteckt. Auf der anderen Seite glaube ich Disketten gehen nur in eine Richtung rein wenn ich mich recht erinnere. Ansonsten gut für die Jugend von heute eigentlich dass die mit Disketten das alles gar nicht mehr mitbekommen haben. Weil ganz ehrlich Disketten war ein richtiges kack Speichermedium. Das waren quasi wenn du so willst Videotapes in rund. Also in eckig mit rund drinnen. Nee Disketten ist wirklich rotz gewesen. 104 1,44 MB ja davor die waren ja nur 720 Kilo Byte. Es gab ja doch diese Schwabbel Disketten. Ihr kennt ja vielleicht teilweise auch diese 5,25 Zoll Disketten. Diese richtig großen Schwabbel Dinger. Hier die Pepo Fat Disks. Die Schwabbel Disketten. Mach alles mit Loch Kardia ist richtig so. Ich hoffe die bohrst du auch selbst. Ich hab es auf der Arbeit schon mal geschafft wo wir gerade bei Internetsprache sind. Ich hab es auf der Arbeit schon mal geschafft in einer Umfrage das Wort Poggers zu platzieren. Als Antwort. Und es wurde sogar darauf reagiert. Also es gab es gibt vielleicht kennt ihr das manche Leute machen das wenn die Präsentationen halten. Dann machen die mit so Umfragetools manchmal so kleine Umfragen. Man kennt das so nach dem Motto ja mal Frage in die Menge. Wer hat Produkt xy oder Sache xy schon gemacht. Und dann können die Leute dann ihre Hand heben oder halt wenn es eine Präsentation ist über Teams. Können die Leute dann halt in irgendeinem Abstimmungsding klicken. Und da war bei uns irgendwie die Frage ja was denkt ihr zum Thema Cloud. Und da habe ich als Antwort halt reingeschrieben Poggers. Und das hat er sogar vorgelesen so aha ich sehe hier steht Poggers. Also ich etabliere ich etabliere langsam schleichend Twitch und Zoomer Sprache auf der Arbeit. Obwohl ich ja selber absolut kein Zoomer mehr bin. Da warte ich noch drauf mit dem Meeting Gatschi was. Stell euch mal vor irgendjemand erzählt ja ich habe euch jetzt die neue Hardware eingebaut. Und ich würde einfach nur antworten Gatschi Bass nice. Hast du die auch so richtig ins Rack rein gedonnert Gatschi Bass Gatschi Roll. Und dann ist die Antwort drauf ja Hyper Gatschi. Ob es noch jemand gibt der das verwendet. Ich habe gar keine Disketten mehr im Keller. Das älteste Leute wisst ihr was der älteste Datenträger ist den ich hier habe. Vermutlich vermutlich eine Game Star CD von 1997. Keine Ahnung ob die noch geht aber wahrscheinlich warum sollte die nicht mehr gehen. Die habe ich alle nicht mehr. Ich habe mein Game Boy Cloud Boy beim Umzug verloren. Weiß nicht wo der ist. Die sieht das letzte Mal die sieht eigentlich noch ganz okay aus. Ist ja keine selbstgebrannte CD. Hast du früher auch Computer Bild. Nein Computer Bild Spiele habe ich nie geholt. Ich kann ich ich kannte jemand ich habe mit jemandem gespielt damals täglich der bei Computer Bild Spiel. Ach nee sorry falsch nicht Computer Bild Spiele. Der hat bei der Bravo Screen Fun gearbeitet. Kennt dieses Ding überhaupt noch jemand. Und ja mit dem habe ich damals MMO gespielt. Und irgendwie hat man sich dann aus den Augen verloren. Keine Ahnung was er heute treibt. Aber nee ich dachte es wäre Computer Bild Spiele gewesen. Es war Bravo Screen Fun. Nein mache ich auch nicht. Ich habe doch gesagt ihr könnt so viel Umfrage machen wie ihr wollt. Auch wenn ich glaube die Umfrage zur Bahn hat 96% gewonnen. Also dass Max sich bei der Bahn bewerben soll. Aber wie gesagt ich werde das nicht machen. Ich bin nicht verpflichtet Umfragen zu folgen. Ich habe es euch auch von Anfang an gesagt dass ich das nicht machen werde. Du musst keine Umfrage vorschlagen. Wir haben doch gestern die Umfrage oder vorgestern die Umfrage gemacht. Wie viele Milchschnitten. Wie groß musste die Milchschnitten Packung sein. Dass da eine CD reingepasst hat. Das muss doch mindestens ein 10er Pack gewesen sein. Oder ein großer Packung dass da eine CD reinpasst. Also in eine einzelne Milchschnitte passt ja offensichtlich keine rein. Doch Go haben wir auch schon mal gemacht. Aber das ist eine gute Idee. Wir haben schon mal ein bisschen Go gemacht. I will enjoy. Doch wir haben schon mal ein bisschen Go gemacht. Und zwar ich weiß nicht ob das Go im Titel hatte. Aber das hier war in Go. Dieser Stream ist nicht immer schief deswegen passt das nicht. Guck Go siehst du es hier oben. Wir haben da mal was in Go gemacht. Hier ist der Beweis. Aber nichts großartiges. Bewerbung bei der Telekom. Ja zur Telekom würde ich sogar theoretisch gehen wenn es ein guter Job ist. Aber zur Bahn würde ich nicht gehen. Wenn ich die bei der Bahn anschreibe. Das Archiv das musst du den Sirius Max fragen. Das habe ich nicht gemacht. Das hat er gemacht. Aber das beste im Archiv ist eindeutig die Farbselection. Und vor allem das Ayaya-Theme ist natürlich das was eigentlich jeder. Das müsste eigentlich Default sein. Nee mach nicht Default das schreckt die Leute ab. Aber eigentlich müsste es Default sein. Ja ich habe die teilweise schon heftig angegangen auf Twitter. Aber ich bin wenigstens immer so nett und schreibe dabei. Dass ich nicht die Leute persönlich meine die hier hinter dem Twitter-Account sitzen. Sondern die Bahn als Ganzes. Nee wir haben in Frankfurt keinen Autohersteller. Wie gesagt Fiber soll sehr Pock sein. Hast du immer bei der Bank gearbeitet oder auch mal woanders? Nein davor habe ich bei einem Provider gearbeitet. Und ich bin dann 2012 zur Bank gewechselt. Da bin ich jetzt. Das ist ja mal ein 10-jähriges Jubiläum. Aber wenn die so weitermachen würde ich das wahrscheinlich nicht mehr erleben. Ja stimmt es gab Mini-CDs. Du hast recht. Ja du hast recht es gab kleine CDs. Habe ich ganz vergessen. Die CD-Laufwerke von damals hatten für diese Mini-CDs sogar einen extra Einschub. Also wer sich immer schon mal gefragt hat warum CD-Laufwerke in der Mitte noch mal so eine kleinere Vertiefung haben. Das ist genau dafür für so Mini-CDs. Weiß nicht was auf so Mini-CDs draufgepasst hat 100 MB oder so. Da gibt es ja immer einen regelrechten Glaubenskrieg was Go Frameworks angeht. Und das viele sagen Standard Lip Only. Der Gamecube hatte kleine CDs aber die waren glaube ich einen Ticken größer als diese Mini-CDs. Oder Mini-DVDs. Ja Nintendo musste da wieder extra Wurst machen. Habt ihr denn alle schon mal ein Video von heute gesehen? Und nein wir machen jetzt kein Max guckt sein eigenes Video und recycelt Content. Also ich gehe jetzt gleich auf falls ihr noch mein aktuelles Video nicht geschaut habt. Ich habe heute eins hochgeladen. Man weiß ja nie ob man das bei YouTube mitbekommt wenn jemand was hochlädt. Wie findet ihr eigentlich das Thumbnail? Ich finde das ist echt ganz gut geworden. Der Sweaty Gamer. Link in den Chat. Ok hier. Beauty of Unix Porn. Unix Porn ist ein Subreddit wo die Leute ihren Tiling Window Manager posten. Ansonsten postet da keiner was. 90% Unix Porn ist E3. Und nein es hat nichts mit Porn zu tun. Es geht um visuellen Porn wie Leute ihren Linux Desktop tunen. Ich dachte erst das ist ein Game. Das ist kein Game das ist irgendwie Yoshi Achterbahn. Das ist einfach nur es fährt da rum. Es hat eine LXDE Konfig gepostet. Was ist denn da los da stimmt was nicht. Ja weil ich auch gerade nach Japan fahre oder wo das ist. Um mich dann in die Yoshi Achterbahn zu setzen. Wahrscheinlich passe ich in die Yoshi Achterbahn gar nicht rein. Weil das für japanische Größen optimiert ist. Aber ja. Gut. Das sind immer so Videos, die sind irgendwie so meditativ, wenn man die sich anguckt. Das hat irgendwie was Beruhigendes, kann das nicht beschreiben, so was kann ich mir auch wunderbar zum Einschlafen angucken. Das ist quasi ASMR ohne ASMR zu sein. So Zeitraffer-Videos. Oh nein, wir gucken uns das jetzt nicht 13 Minuten an. Ich mach gleich aus. Aber ich fände das super einschläfernd meditativ so was zu gucken. Was hat er sonst noch? Pineapple. Der Boomer ist schon müde, es ist 22 Uhr. Oh, gleich fällt es um. Tiltet. Und wie das fällt doch jetzt, bam. Okay Leute, ich gebe zu, das war heute der Pepo-Bedge-Stream schlechthin. Ich bin einfach nur angekommen, ohne irgendwas überlegt zu haben im Vorfeld. Aber ich dachte mir, ich mache mal besser streamen an, sonst penne ich gleich ein. Kann ich mit euch noch eine Runde schwätzen vorher. Schön, dass ihr trotzdem da gewesen seid. Und ich gehe jetzt erstmal mal umloggen auf meinen anderen Account und gucke, wie die View-Statistiken aussehen für das aktuelle Video, weil die waren relativ gut vorhin. Du willst morgen deinem 56-jährigen Kollegen beibringen, Bedge zu sagen? Ja, ich finde, Bedge ist auch besser als mit Pock oder sowas anzufangen. Ich finde, Bedge ist etwas, das sollte jeder in seinen Standard-Wortschatz aufnehmen. Ja, unbedingt. Alles klar Leute, wir sehen uns bis denn. See you!", "segments": [{"id": 1, "start": 30.0, "end": 37.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 60.0, "end": 85.0, "text": "So, da bin ich Leute, sag mal, braucht jemand von euch UniFi Exit Points?"}, {"id": 3, "start": 85.0, "end": 94.0, "text": "Ich habe einen UAP Pro, einen UniFi 6 Lite und einen UAC Lite."}, {"id": 4, "start": 94.0, "end": 103.0, "text": "Das sind die, die ich ausgebaut habe. Nee, Moment, das müssten vier sein."}, {"id": 5, "start": 103.0, "end": 115.0, "text": "Ich sehe den vierten gerade nicht, es müssten vier sein, ich hatte vier. Ich hatte einen im Keller, ich hatte einen im Erdgeschoss und ich hatte zwei im ersten Stock."}, {"id": 6, "start": 115.0, "end": 122.0, "text": "Wo ist denn der vierte hin? Keine Ahnung. Ja, gut, was auch immer, ist egal."}, {"id": 7, "start": 122.0, "end": 131.0, "text": "Ansonsten bleiben die Dinger hier einfach liegen, vielleicht kann man die irgendwann mal flashen mit Custom-Firmware und was Cooles mitmachen, irgendwie Open-WRT drauf oder so."}, {"id": 8, "start": 131.0, "end": 140.0, "text": "Es geht ja aktuell nicht richtig, also man kann Open-WRT drauf machen, aber nur mit Gelöte oder so ganz komisches Zeug, da habe ich keinen Bock drauf."}, {"id": 9, "start": 140.0, "end": 145.0, "text": "Ja, ich werde es wahrscheinlich aufheben, ganz ehrlich, ich habe so viel Mist schon aufgehoben."}, {"id": 10, "start": 145.0, "end": 154.0, "text": "Ich müsste langsam mal echt ein bisschen was wegschmeißen. Ich habe noch, oder ihr wisst ja, was ich teilweise noch für alte Hardware habe, ich schmeiße irgendwie kaum was weg."}, {"id": 11, "start": 154.0, "end": 161.0, "text": "Ja, aber ich Kackknub, meine Wii und mein N64, außer zum Glück die Games, habe ich weggeschmissen damals beim Umzug."}, {"id": 12, "start": 161.0, "end": 165.0, "text": "Ansonsten schmeiße ich nichts weg, das weiß ich nicht, hätte ich wegschmeißen sollen, schmeiße ich weg."}, {"id": 13, "start": 165.0, "end": 172.0, "text": "Naja, was wollte ich jetzt sagen? Keine Ahnung, ich bin müde wie Sau. Ich weiß nicht, was ich sagen wollte."}, {"id": 14, "start": 172.0, "end": 189.0, "text": "Achso, ja wisst ihr, was ich noch habe? Ich habe noch im Schrank liegen eine Nvidia GTO, wie hieß dieses Ding? 7900 GTO, Alter, habe ich noch im Schrank liegen."}, {"id": 15, "start": 189.0, "end": 198.0, "text": "Also, 15 Jahre alte Grafikkarten, ganz toll, das ist das, was die Welt gebraucht hat, ja."}, {"id": 16, "start": 205.0, "end": 213.0, "text": "Ich mache heute übrigens nichts Großartiges, ich sage es euch gleich. Wir können ein bisschen schwätzen, können uns ein paar Sachen angucken, ich werde heute nichts Großartiges machen."}, {"id": 17, "start": 213.0, "end": 221.0, "text": "Ich bin ziemlich im Arsch, ich war heute übrigens beim Zahnarzt. Zahnarzt ist immer richtig Sack."}, {"id": 18, "start": 226.0, "end": 229.0, "text": "Du hast heute Prüfungsnoten bekommen."}, {"id": 19, "start": 229.0, "end": 239.0, "text": "Ach ne, du hast gute Prüfungsnoten, was heißt für dich gute Prüfungsnoten und in welcher Prüfung?"}, {"id": 20, "start": 243.0, "end": 251.0, "text": "Alter, da hat man doch nichts, was soll es da großartig geben? Was ich tatsächlich überraschend fand, hätte ich gar nicht mit gerechnet."}, {"id": 21, "start": 251.0, "end": 268.0, "text": "Es hat sich auf Twitter tatsächlich jemand gemeldet, ob ich nicht zu ihnen will und ich habe 5 Mails bekommen."}, {"id": 22, "start": 268.0, "end": 281.0, "text": "Ne, 6, ich habe es hier gerade auf 6 Mails bekommen. Das hätte ich gar nicht gedacht, ich habe gedacht, was ist hier los? Einfach stream gemacht das letzte Mal,"}, {"id": 23, "start": 281.0, "end": 289.0, "text": "bin ich ein bisschen darüber ausgekotzt und nach dem Motto glaube ich muss mir einen neuen Job suchen und zack, 6 E-Mails."}, {"id": 24, "start": 289.0, "end": 299.0, "text": "Gut, das meiste sind keine Angebote, das meiste sind, guck mal, bei uns gibt es was cooles. Ein paar davon sind wirklich Angebote, hätte ich gar nicht gedacht."}, {"id": 25, "start": 299.0, "end": 310.0, "text": "Vielleicht muss ich mich ja gar nicht großartig bewerben, vielleicht ergibt sich ja aus diesen Sachen jetzt irgendwas. Mal gucken. Ne, aber ansonsten nichts."}, {"id": 26, "start": 310.0, "end": 321.0, "text": "Kommunikationstechnik und Funktechnik. Funktechnik klingt richtig oldschool, wobei das wahrscheinlich nicht auf WLAN oder sowas bezieht."}, {"id": 27, "start": 321.0, "end": 337.0, "text": "Ja, die würde ich auch aufheben. War nicht die Voodoo 3 das, die so berühmt war für das beste Anti-Alasing, was es hier gab oder so? Oder bringe ich das jetzt durcheinander?"}, {"id": 28, "start": 337.0, "end": 349.0, "text": "Mal ganz einfach abgesehen, es ist egal, ob es das beste Anti-Alasing war, was es hier gab, die gerade ist zu langsam und damit nichts sinnvolles zu machen."}, {"id": 29, "start": 349.0, "end": 362.0, "text": "Außer für irgendwelche Retro, gut. Ey, wisst ihr was mich ja persönlich etwas schmerzt? Dass Spiele, die für mich mal richtig krass High-End waren heute Retro sind."}, {"id": 30, "start": 362.0, "end": 373.0, "text": "Es gab Zeiten, da war Half-Life 1 mega State of the Art oder irgendwann Half-Life 2 oder 4, falls das noch jemand kennt oder Unreal."}, {"id": 31, "start": 373.0, "end": 384.0, "text": "Also Unreal war damals. Heute, Unreal hatte eine Palme im ersten Level mit drei Pixel und alle haben gesagt, boah, das sieht da super realistisch aus, dieser Außenlevel. Und das ist heute Retro alles."}, {"id": 32, "start": 384.0, "end": 398.0, "text": "Ich dachte, 5G ist gut, um Corona zu kriegen. Ja, das kann ich mir auch kaum vorstellen. Das kann ich mir auch nicht vorstellen, ich weiß noch, als das neu war."}, {"id": 33, "start": 398.0, "end": 411.0, "text": "Das war noch zu Zeiten, wo Leute, wo es noch Emos gab. Kennt noch jemand Emos? Jetzt nicht, weil ich unbedingt Linkin Park gehört habe, aber das war so die Zeit, in der ich immer noch Emos hatte."}, {"id": 34, "start": 411.0, "end": 423.0, "text": "Die sind alle weg. Zwei Jahre Massive Subscription, dazu kann ich bloß sagen, wenn ich das Emos finde, dazu kann ich bloß sagen."}, {"id": 35, "start": 423.0, "end": 435.0, "text": "Danke für den Prime-Sub. Silberner Keks, drei Monate, vier Monate, bald gibt es den Diamant-Keks und ich brauche unbedingt neue Subscriber-Batches."}, {"id": 36, "start": 435.0, "end": 449.0, "text": "Echt? Aber die richtigen Emos, die kommen nicht mehr. Die richtigen Emos, das waren die mit diesem schräg übers Auge hängenden Haarschnitt."}, {"id": 37, "start": 449.0, "end": 469.0, "text": "Ich habe keine Ahnung, wie da wer heute bezeichnet wird. S-M-U-N-F-R. Bin mir nicht sicher, wie man das ausspricht, aber danke für den Prime-Sub."}, {"id": 38, "start": 469.0, "end": 486.0, "text": "Ja, das waren die Zeiten, wo Twilight im Kino voll angesagt war. Wo die ganzen Mädels damals Twilight geguckt haben."}, {"id": 39, "start": 486.0, "end": 494.0, "text": "Wobei ich sagen muss, das war nicht exakt meine Generation, das war eher eins danach. Meine Generation haben die Mädels Titanic geguckt im Kino."}, {"id": 40, "start": 494.0, "end": 508.0, "text": "Siebenmal oder so. Im Kino. Und ich muss ehrlich sagen, der Film wird ja oft irgendwie gebashed, irgendwie, keine Ahnung, öls banales, langweiliges Zeug."}, {"id": 41, "start": 508.0, "end": 521.0, "text": "Aber es gibt echt schlimmere Filme als Titanic. Also ich habe so deutlich mehr Shit gesehen. Ich würde jetzt nicht sagen, dass es der beste Film an der Zeit ist, aber man kann den sich durchaus angucken."}, {"id": 42, "start": 521.0, "end": 534.0, "text": "Das ist schon okay. Bester Film an der Zeit ist eben Matrix 1. Kann mir keiner was sagen. Den Rest kannst du knicken. Ich bin heute nicht Bahn gefahren, ich war aber am Zahnplatz."}, {"id": 43, "start": 534.0, "end": 542.0, "text": "Ich war morgen Bahn. Hat Max eigentlich ein Hals-Tattoo wie der Frisur? Nein, habe ich nicht. Wie kommst du darauf?"}, {"id": 44, "start": 542.0, "end": 552.0, "text": "Ne, habe ich nicht. Der Frasier hat ja mittlerweile nicht nur ein Hals-Tattoo, der Frasier hat ja mittlerweile ganz Körper-Tattoo, wenn du so willst."}, {"id": 45, "start": 552.0, "end": 559.0, "text": "Der besteht ja fast nur noch aus Tattoos. Zumindest das letzte Mal, was ich gesehen habe. Und das wird ja eher mehr als weniger."}, {"id": 46, "start": 559.0, "end": 568.0, "text": "Er arbeitet glaube ich sogar in einem Tattoo-Studio jetzt."}, {"id": 47, "start": 574.0, "end": 581.0, "text": "Ja, Bahn fahren morgen. Ich bin wahrscheinlich wieder richtig ätzend. Mal schauen."}, {"id": 48, "start": 581.0, "end": 590.0, "text": "Leute, ich bin übelst kaputt. Ich weiß gar nicht warum. Wahrscheinlich wegen der Betäubung vom Zahnarzt oder so. Ich bin voll im Arsch."}, {"id": 49, "start": 590.0, "end": 597.0, "text": "Und es ist nicht, als hätte ich heute großartig was gemacht. Ich bin heute mal in 9 Kilometer ungefähr wieder."}, {"id": 50, "start": 597.0, "end": 606.0, "text": "Ich sage jetzt mal wandern, weil ich die Leute immer verwirre, wenn ich sage, ich war laufen. Die denken immer, ich war joggen. Ich war nicht joggen, ich war laufen."}, {"id": 51, "start": 606.0, "end": 616.0, "text": "Ich will ja nicht wieder Pepofett werden. Ich will ja, mich vereint Pepofetten weiter."}, {"id": 52, "start": 616.0, "end": 625.0, "text": "Zahnarztschlauch. Wisst ihr, was ich beim Zahnarzt immer ganz toll finde? Die pumpen dir literweise Wasser in den Hals."}, {"id": 53, "start": 625.0, "end": 631.0, "text": "Und dann sagen sie zu dir, einfach durch die Nase atmen. Dann ist das gar nicht schlimm."}, {"id": 54, "start": 631.0, "end": 638.0, "text": "Alter, ich versuche es durch die Nase zu atmen. Das ist nicht so einfach, wenn man massig Wasser in den Hals gespritzt kriegt."}, {"id": 55, "start": 646.0, "end": 652.0, "text": "Tja, die müssen sich nicht wundern, wenn immer mehr Leute sagen, Scheiß auf Bahn. Ich fahre wieder mit dem Auto."}, {"id": 56, "start": 652.0, "end": 656.0, "text": "Dabei, in der aktuellen Zeit wäre es sogar besser denn je."}, {"id": 57, "start": 656.0, "end": 668.0, "text": "Habt ihr auch mitgekriegt, dass uns unser Bundeskanzler auf sparen oder auf entbehrungsreiche Jahre eingeschworen hat oder versucht hat."}, {"id": 58, "start": 668.0, "end": 674.0, "text": "Der Kerl kann mich mal. Ich entbehre hier gar nichts."}, {"id": 59, "start": 674.0, "end": 683.0, "text": "Meine Stonks sind leider, laufen leider nicht gut."}, {"id": 60, "start": 683.0, "end": 690.0, "text": "Aber welche Stonks laufen dieses Jahr schon gut."}, {"id": 61, "start": 690.0, "end": 701.0, "text": "Ob das dann im Endeffekt so viel Unterschied macht."}, {"id": 62, "start": 701.0, "end": 707.0, "text": "Leberwurst mit saure Gurken."}, {"id": 63, "start": 707.0, "end": 721.0, "text": "Tier 1 Sub, Dankeschön."}, {"id": 64, "start": 721.0, "end": 730.0, "text": "Du meinst, ich soll jetzt noch die restliche Kohle, die ich noch auf den Konten liegen habe, einfach noch mehr in Stonks hauen?"}, {"id": 65, "start": 730.0, "end": 738.0, "text": "Reinmetall lief gut ab der Ankündigung, als sie gesagt haben, es gibt neues Geld für die Bundeswehr, dann ging das ab."}, {"id": 66, "start": 738.0, "end": 742.0, "text": "Und Heckler und Koch gingen auch übelst ab."}, {"id": 67, "start": 742.0, "end": 750.0, "text": "Tja, ich mein, wenn für eine Sache der Krieg gut ist, dann für die Stonks der Rüstungsindustrie."}, {"id": 68, "start": 750.0, "end": 755.0, "text": "Wie gesagt, ich habe insgesamt sechs Nachrichten bekommen."}, {"id": 69, "start": 755.0, "end": 760.0, "text": "Das wenigste davon waren Angebote, sondern eher so guck mal, hier bei uns gibt es was."}, {"id": 70, "start": 760.0, "end": 763.0, "text": "Aber es waren auch zwei, drei Angebote dabei."}, {"id": 71, "start": 763.0, "end": 765.0, "text": "Hätte ich nicht gedacht, ja."}, {"id": 72, "start": 765.0, "end": 768.0, "text": "Mittlerweile muss man sich anscheinend gar nicht mal bewerben."}, {"id": 73, "start": 768.0, "end": 772.0, "text": "Sondern es reicht, wenn man in einem random Stream sagt, Leute, ich suche einen Job."}, {"id": 74, "start": 772.0, "end": 774.0, "text": "Da kommen schon welche."}, {"id": 75, "start": 774.0, "end": 776.0, "text": "Was ich ja persönlich sehr cool finde."}, {"id": 76, "start": 776.0, "end": 782.0, "text": "Zumal es ja auch alles wirklich passende Sachen waren."}, {"id": 77, "start": 782.0, "end": 786.0, "text": "Du bist dabei, so komplett random, Max, willst du nicht was mit Holz machen oder so?"}, {"id": 78, "start": 786.0, "end": 789.0, "text": "Ja, so ungefähr ist es bei meinen Stonks auch."}, {"id": 79, "start": 789.0, "end": 792.0, "text": "Meine Stonks kannst du vergessen."}, {"id": 80, "start": 792.0, "end": 801.0, "text": "Ein Angebot war von einer Stonks-Firma, die Trading-Zeug herstellt."}, {"id": 81, "start": 801.0, "end": 806.0, "text": "Weiß nicht, wie zukunftssicher das ist."}, {"id": 82, "start": 806.0, "end": 811.0, "text": "Aber der Job klingt gar nicht so schlecht."}, {"id": 83, "start": 811.0, "end": 821.0, "text": "Ich habe keinen Bock mehr auf, weder auf die blaue Bank, noch auf das, wo ich gerade bin."}, {"id": 84, "start": 821.0, "end": 825.0, "text": "Noch nicht so lange."}, {"id": 85, "start": 825.0, "end": 833.0, "text": "Ich habe die ganze Geschichte jetzt mit Corona und Krise und so zum Anlass genommen,"}, {"id": 86, "start": 833.0, "end": 851.0, "text": "mich endlich mal ein bisschen mit der ETF-Thematik und vor allem mit, ich will mein Geld nicht die ganze Zeit auf dem Konto schimmeln lassen zu beschäftigen."}, {"id": 87, "start": 851.0, "end": 853.0, "text": "Hab ich doch."}, {"id": 88, "start": 853.0, "end": 857.0, "text": "Hab ich doch, guck mal in die Worts hier."}, {"id": 89, "start": 857.0, "end": 860.0, "text": "Hab ich doch."}, {"id": 90, "start": 860.0, "end": 872.0, "text": "Guck hier."}, {"id": 91, "start": 872.0, "end": 875.0, "text": "Dein Bart, nice."}, {"id": 92, "start": 875.0, "end": 878.0, "text": "Mein Bart auch."}, {"id": 93, "start": 878.0, "end": 883.0, "text": "Leute, wenn ich jetzt auf halb acht hier im Stuhl hänge, penne ich gleich ein."}, {"id": 94, "start": 883.0, "end": 887.0, "text": "Ich bin eh schon halb eingepennt vor dem Stream, weil ich so im Arsch war."}, {"id": 95, "start": 887.0, "end": 890.0, "text": "Ich weiß nicht, es scheint eins schon an einem Zahnarzt heute zu liegen."}, {"id": 96, "start": 890.0, "end": 893.0, "text": "Anders kann ich mir das nicht erklären."}, {"id": 97, "start": 893.0, "end": 899.0, "text": "Und ich habe gedacht, ich muss jetzt den Stream anmachen, sonst wird das nix die nächsten Tage mit Streamen."}, {"id": 98, "start": 899.0, "end": 904.0, "text": "Und wenn ich jetzt nicht irgendwas mache, dann penne ich ein."}, {"id": 99, "start": 904.0, "end": 908.0, "text": "Meine Kopfstütze ist gerade runtergefallen, Zack."}, {"id": 100, "start": 908.0, "end": 915.0, "text": "Ihr könnt euch überlegen, wie sehr ich hier gerade halb gelegen habe im Stuhl."}, {"id": 101, "start": 915.0, "end": 918.0, "text": "So und gibt es irgendwas spannendes Neues Leute?"}, {"id": 102, "start": 918.0, "end": 920.0, "text": "Ich habe mir nichts vorgenommen."}, {"id": 103, "start": 920.0, "end": 923.0, "text": "Ich habe einfach den Stream Titel geändert und den Stream angemacht."}, {"id": 104, "start": 923.0, "end": 929.0, "text": "Ich habe mir."}, {"id": 105, "start": 929.0, "end": 933.0, "text": "Visionelle Zahnreinigung."}, {"id": 106, "start": 933.0, "end": 940.0, "text": "Das ist auch anstrengend, weil es spritzt ja auch literweise Wasser in den Hals."}, {"id": 107, "start": 940.0, "end": 941.0, "text": "Der Pico V."}, {"id": 108, "start": 941.0, "end": 946.0, "text": "Ach ja, stimmt hier Leute Pico V ASMR."}, {"id": 109, "start": 946.0, "end": 957.0, "text": "Hört man das?"}, {"id": 110, "start": 957.0, "end": 959.0, "text": "Du schreibst die Archive AP in Go in."}, {"id": 111, "start": 959.0, "end": 967.0, "text": "Was hattest du es denn bisher?"}, {"id": 112, "start": 967.0, "end": 968.0, "text": "War das Django?"}, {"id": 113, "start": 968.0, "end": 975.0, "text": "War das Django, was du bisher hattest?"}, {"id": 114, "start": 975.0, "end": 979.0, "text": "Ach ja, ja, gute Idee."}, {"id": 115, "start": 979.0, "end": 983.0, "text": "Standard Library oder irgendwelche Go Frameworks interessiert mich."}, {"id": 116, "start": 983.0, "end": 986.0, "text": "Go Web Anwendung wollte ich auch ein bisschen mal rumspielen."}, {"id": 117, "start": 986.0, "end": 988.0, "text": "Also was ist am Pico V neu?"}, {"id": 118, "start": 988.0, "end": 992.0, "text": "Dass er zwei Wi-Fi eingebaut hat, Bluetooth und Wi-Fi."}, {"id": 119, "start": 992.0, "end": 999.0, "text": "Allerdings haben sich die Jungs bei dem Firmware entwickeln gedacht, wir lassen die Bluetooth Funktionalität raus."}, {"id": 120, "start": 999.0, "end": 1000.0, "text": "Warum auch immer."}, {"id": 121, "start": 1000.0, "end": 1003.0, "text": "Der Chip kann Bluetooth."}, {"id": 122, "start": 1003.0, "end": 1005.0, "text": "Man muss aber dazu sagen."}, {"id": 123, "start": 1005.0, "end": 1008.0, "text": "Richtig sehe ich genauso."}, {"id": 124, "start": 1008.0, "end": 1009.0, "text": "Ich verstehe ihn um."}, {"id": 125, "start": 1009.0, "end": 1018.0, "text": "Also ich verstehe die Existenzberechtigung des Raspberry Pi Picos generell beziehungsweise W auch nur beschränkt,"}, {"id": 126, "start": 1018.0, "end": 1025.0, "text": "weil so wie es für mich jetzt aktuell aussieht, ist jeder ESP32 besser."}, {"id": 127, "start": 1025.0, "end": 1030.0, "text": "Aber das muss ich zeigen."}, {"id": 128, "start": 1030.0, "end": 1031.0, "text": "Ich weiß noch nicht so genau."}, {"id": 129, "start": 1031.0, "end": 1033.0, "text": "Vielleicht ist der Stromverbrauch besser oder so."}, {"id": 130, "start": 1033.0, "end": 1034.0, "text": "Ich keine Ahnung."}, {"id": 131, "start": 1034.0, "end": 1036.0, "text": "Wir werden uns das aber angucken."}, {"id": 132, "start": 1036.0, "end": 1044.0, "text": "Ja, und man darf den Raspberry Pi Pico generell nicht mit einem normalen, weil hier so viele Fragen kommen,"}, {"id": 133, "start": 1044.0, "end": 1046.0, "text": "mit einem normalen Raspberry Pi verwechseln."}, {"id": 134, "start": 1046.0, "end": 1054.0, "text": "Der normale Raspberry Pi ist ja ein Single Board, ein Platinen Computer mit Linux drauf."}, {"id": 135, "start": 1054.0, "end": 1058.0, "text": "Der Pico beziehungsweise Pico V ist ja wirklich ein Micro Controller."}, {"id": 136, "start": 1058.0, "end": 1060.0, "text": "Da läuft kein Linux, kein richtiges Betriebssystem drauf."}, {"id": 137, "start": 1060.0, "end": 1065.0, "text": "Da läuft dein Sketch beziehungsweise deine Firmware drauf und fertig."}, {"id": 138, "start": 1065.0, "end": 1070.0, "text": "Du musst dich da auch um Sachen wie Multithreading und so selbst kümmern oder Prozess Handling."}, {"id": 139, "start": 1070.0, "end": 1072.0, "text": "Prozess gibt es ja gar nicht."}, {"id": 140, "start": 1072.0, "end": 1074.0, "text": "Task Handling und sowas."}, {"id": 141, "start": 1074.0, "end": 1077.0, "text": "Wenn du denn mehrere Tasks zu baut laufen lassen willst."}, {"id": 142, "start": 1077.0, "end": 1080.0, "text": "Ja, der ESP hat auch mehr Leistung."}, {"id": 143, "start": 1080.0, "end": 1084.0, "text": "Also ich verstehe es nicht so genau, wo der Sinn ist."}, {"id": 144, "start": 1084.0, "end": 1090.0, "text": "Ja, naja, was das Real Time ist, das ist Free Erdos."}, {"id": 145, "start": 1090.0, "end": 1096.0, "text": "Aber im Prinzip ist das ja kein richtiges Betriebssystem, was man sich da so, wenn man Linux kennt, drunter vorstellt."}, {"id": 146, "start": 1096.0, "end": 1100.0, "text": "Also da lockst du dich nicht per SSH drauf ein und machst dann auf der Kommandozeile was oder so."}, {"id": 147, "start": 1100.0, "end": 1104.0, "text": "Ja, das ist halt..."}, {"id": 148, "start": 1104.0, "end": 1112.0, "text": "Du machst dein Sketch, uploadest den, dann läuft der drauf und sonst nichts."}, {"id": 149, "start": 1112.0, "end": 1115.0, "text": "Und um alle Sachen musst du dich selbst kümmern."}, {"id": 150, "start": 1115.0, "end": 1120.0, "text": "Von WLAN bis Input lesen bis LEDs blinken, das musst du alles selbst machen."}, {"id": 151, "start": 1120.0, "end": 1132.0, "text": "Ja, das ist das... das würde ich nicht in die gleiche Kategorie packen wie in Linux."}, {"id": 152, "start": 1132.0, "end": 1142.0, "text": "Das was dir Free Erdos abnimmt ist quasi eine bessere Standard Library oder besseres Handling für Tasks und sowas."}, {"id": 153, "start": 1142.0, "end": 1168.0, "text": "Ja, ich verstehe den Sinn auch nicht so genau, weil ganz im Ernst, man kann sich, man kann sich bei der Arduino-Geschichte ja teilweise schon ein bisschen über die Library-Qualität beschweren oder ja, es ist halt leider auch C++, aber trotzdem."}, {"id": 154, "start": 1168.0, "end": 1177.0, "text": "Arduino ist quasi schon vorhanden, es gibt für alles mögliche irgendwelche Libraries."}, {"id": 155, "start": 1177.0, "end": 1180.0, "text": "Meine Lieblingskombination ist E."}, {"id": 156, "start": 1180.0, "end": 1190.0, "text": "ESP32 mit dem ESP32-China-Chinesen-Framework plus Arduino obendrauf für das wo man es braucht."}, {"id": 157, "start": 1190.0, "end": 1196.0, "text": "Da kannst du unten an den Innereien rumdrehen und die benutzen und noch Arduino Libraries obendrauf wo man es braucht."}, {"id": 158, "start": 1196.0, "end": 1202.0, "text": "Ja, die Original-Aduinos sind auch ziemlich der Sack. Die sind langsam, aber die Dinger sind halt ultra robust."}, {"id": 159, "start": 1202.0, "end": 1210.0, "text": "Ja, also wenn ich ein U-Boot bauen würde, dann mit Arduino. Also was wusste wirklich drauf ankommt, dass der Kram funktioniert."}, {"id": 160, "start": 1210.0, "end": 1215.0, "text": "Nicht, dass ich ein U-Boot bauen könnte oder so."}, {"id": 161, "start": 1215.0, "end": 1226.0, "text": "Der ESP32 hat sogar drei Kerne. Der hat einen 8MHz Low-Power-Prozessor und zwei 240MHz..."}, {"id": 162, "start": 1226.0, "end": 1235.0, "text": "Boah, was sind das für Cores beim ESP32? Extensa oder sowas?"}, {"id": 163, "start": 1235.0, "end": 1239.0, "text": "Komische, komische CPUs hat das Ding."}, {"id": 164, "start": 1239.0, "end": 1251.0, "text": "Aber die haben, leistungsmäßig sind die gar nicht übel."}, {"id": 165, "start": 1251.0, "end": 1257.0, "text": "Ja, das stimmt. Da hast du nicht unrecht. Auf dem ESP32 musst du ein bisschen aufpassen."}, {"id": 166, "start": 1257.0, "end": 1273.0, "text": "Wenn du deine Tasks so programmierst, dass sie quasi nicht geschallt CPU-Zeit abgeben."}, {"id": 167, "start": 1273.0, "end": 1282.0, "text": "Oder wenn man WLAN und Bluetooth gleichzeitig verwenden will und auf dem Kern auch was berechnen, da muss man ein bisschen aufpassen."}, {"id": 168, "start": 1282.0, "end": 1296.0, "text": "Aber man sollte, solange man den Kern nicht komplett auslastet, ist es eigentlich kein Problem."}, {"id": 169, "start": 1296.0, "end": 1302.0, "text": "Was machen eigentlich? Nur mal schnell reingucken. Was gibt es denn aktuell eigentlich für GitHub Trends?"}, {"id": 170, "start": 1302.0, "end": 1310.0, "text": "Leute, wenn ihr irgendwas wissen wollt, wenn ihr irgendwas loswerden wollt oder mich zu irgendwas fragen wollt, so haut's raus."}, {"id": 171, "start": 1310.0, "end": 1317.0, "text": "Ich hab heute nix geplant für den Stream. Ich hab einfach komplett ohne Vorbereitung eingeschaltet."}, {"id": 172, "start": 1317.0, "end": 1324.0, "text": "Arshina Chinesen zeugt SMS-Boom Trended."}, {"id": 173, "start": 1324.0, "end": 1337.0, "text": "Was ist der Sinn des Lebens, so viel zu machen, auf was du Bock hast, bis du irgendwann den Löffel abgibst?"}, {"id": 174, "start": 1337.0, "end": 1344.0, "text": "Was bin ich sehend?"}, {"id": 175, "start": 1344.0, "end": 1349.0, "text": "Was?"}, {"id": 176, "start": 1349.0, "end": 1355.0, "text": "Was seh ich hier?"}, {"id": 177, "start": 1355.0, "end": 1362.0, "text": "Chat, versteht irgendjemand was hier passiert?"}, {"id": 178, "start": 1362.0, "end": 1372.0, "text": "Also es ist ein China-Chinesen-Repo mit knapp 3000 Sternen."}, {"id": 179, "start": 1372.0, "end": 1378.0, "text": "Ich könnte ein gutes PDF-Parser-Programm brauchen. Kannst du eins empfehlen? Du meinst Library?"}, {"id": 180, "start": 1378.0, "end": 1382.0, "text": "Nee, nee, kenn ich nix."}, {"id": 181, "start": 1382.0, "end": 1386.0, "text": "Cringe, Max kann kein Chinesisch."}, {"id": 182, "start": 1386.0, "end": 1393.0, "text": "Aber gut, Bitestrike, du kannst mir das bestimmt easy übersetzen. Du kannst das ja."}, {"id": 183, "start": 1393.0, "end": 1405.0, "text": "Meta-Search-Engine."}, {"id": 184, "start": 1405.0, "end": 1420.0, "text": "Gamecube-Modchip auf Raspberry Pi Basis, alles klar."}, {"id": 185, "start": 1420.0, "end": 1425.0, "text": "So wirklich spannend ist ja da nicht dabei heute was Trended."}, {"id": 186, "start": 1425.0, "end": 1433.0, "text": "YOLOX ist wieder am Start. Das ist irgendeine Image Recognition Software."}, {"id": 187, "start": 1433.0, "end": 1445.0, "text": "Da blick ich aber auch nicht durch. Da gibt es YOLO 3, 4, 5, X. Keine Ahnung was da der Unterschied ist."}, {"id": 188, "start": 1445.0, "end": 1449.0, "text": "Linux Trended."}, {"id": 189, "start": 1449.0, "end": 1453.0, "text": "Ähnlich mal was Gescheites."}, {"id": 190, "start": 1453.0, "end": 1462.0, "text": "Catch-2, ein C++-Framework. Oh nein. Please."}, {"id": 191, "start": 1462.0, "end": 1468.0, "text": "China, Chinesen, solche, was einfach Web heißt, alles klar."}, {"id": 192, "start": 1468.0, "end": 1474.0, "text": "Ok, die GitHub Trends sind tatsächlich ziemlich..."}, {"id": 193, "start": 1474.0, "end": 1483.0, "text": "Weakly Trend ist das gleiche. Nee, Fresh. Alter, warum hat Fresh einfach 6700 Sterne?"}, {"id": 194, "start": 1483.0, "end": 1492.0, "text": "Das ist ein neues Deno-Web-Framework. Das habe ich jetzt letztens in einem Video gesehen."}, {"id": 195, "start": 1492.0, "end": 1496.0, "text": "Kannst du den Aufbau von Hypervisern erklären?"}, {"id": 196, "start": 1496.0, "end": 1501.0, "text": "Nicht so wirklich, jetzt aus dem Stegreif, wenn ich ehrlich bin."}, {"id": 197, "start": 1501.0, "end": 1505.0, "text": "Ach so, ja dann. Dann wird es Zeit."}, {"id": 198, "start": 1505.0, "end": 1519.0, "text": "Lest einfach den Wikipedia-Artikel, dann weißt du Bescheid."}, {"id": 199, "start": 1519.0, "end": 1530.0, "text": "Schön, dass du es gefallen hast, dass du deinen Weg gefunden hast."}, {"id": 200, "start": 1530.0, "end": 1535.0, "text": "Du hast heute mit einem Heim-Server auf einem Nuke angefangen. Ich bin ein kompletter Nuke, manche sind echt verzweifelt."}, {"id": 201, "start": 1535.0, "end": 1538.0, "text": "Dies läuft jetzt der Pion."}, {"id": 202, "start": 1538.0, "end": 1541.0, "text": "Was hast du für ein Betriebssystem drauf?"}, {"id": 203, "start": 1541.0, "end": 1546.0, "text": "Also wahrscheinlich Linux, aber welches?"}, {"id": 204, "start": 1546.0, "end": 1557.0, "text": "Ich denke nicht, dass es Arch, by the way, ist, weil Arch auf dem Server, auch wenn wir alle wissen, dass Arch die beste Linux-Restribution überhaupt ist, die es gibt und jemals geben wird und jemals gab und sonst was,"}, {"id": 205, "start": 1557.0, "end": 1561.0, "text": "auf dem Server ist Arch jetzt eher nicht so das."}, {"id": 206, "start": 1561.0, "end": 1565.0, "text": "Rotsfett hat Subscribed, Dankeschön."}, {"id": 207, "start": 1565.0, "end": 1572.0, "text": "Ja das ist wichtig, immer wenn das fällt, muss man Arch, by the way, erwähnen, vor allem wenn man das selbst benutzt."}, {"id": 208, "start": 1572.0, "end": 1599.0, "text": "Windows-Server, gibt es wirklich Leute, die Windows-Server im Einsatz haben und dann darauf Docker laufen lassen und darauf dann irgendwie ihren Piehole oder so?"}, {"id": 209, "start": 1599.0, "end": 1606.0, "text": "Bikoima und ein Topfi haben Subscribed, Dankeschön."}, {"id": 210, "start": 1606.0, "end": 1608.0, "text": "Massive Subs, Leute."}, {"id": 211, "start": 1608.0, "end": 1614.0, "text": "Hyper-Subscription hier, eins nach dem anderen."}, {"id": 212, "start": 1614.0, "end": 1620.0, "text": "Gibt es mit Sicherheit, ich fürchte auch, ich fürchte auch."}, {"id": 213, "start": 1620.0, "end": 1627.0, "text": "Ja ich muss dazu sagen, ich kann es ja durchaus nachvollziehen, dass es Leute gibt, die Windows-Server verwenden."}, {"id": 214, "start": 1627.0, "end": 1634.0, "text": "Es mag die ein oder anderen, auch wenn es für mich schwer vorstellbar ist."}, {"id": 215, "start": 1634.0, "end": 1637.0, "text": "Er hat hier geantwortet, by the way."}, {"id": 216, "start": 1637.0, "end": 1639.0, "text": "Was?"}, {"id": 217, "start": 1639.0, "end": 1647.0, "text": "Ach Ubuntu-Server, ja wunderbar, da hast du es richtig genommen."}, {"id": 218, "start": 1647.0, "end": 1652.0, "text": "Also es mag hier den einen oder anderen Sinn geben, warum man Windows verwendet."}, {"id": 219, "start": 1652.0, "end": 1659.0, "text": "Zum Beispiel, wenn man Active Directory Zeug machen will, bin ich froh, dass ich mich damit nicht beschäftigen muss."}, {"id": 220, "start": 1659.0, "end": 1682.0, "text": "Und ja, vielleicht auch, wenn man, ne Moment, ISS ist die internationale Raumstation, IES ist der Internet Information Service und IS sind die Terroristen."}, {"id": 221, "start": 1682.0, "end": 1686.0, "text": "Das ist aber auch schwierig, das ist ganz schön kompliziert, das klingt alles so ähnlich."}, {"id": 222, "start": 1686.0, "end": 1703.0, "text": "Ich meine IES, also wenn man vielleicht IES-Anwendungen laufen lassen will, dann, aber es gibt, also mir fällt nichts ein, warum ich freiwillig IES-Anwendungen laufen lassen will."}, {"id": 223, "start": 1703.0, "end": 1712.0, "text": "Weiß ich nicht, es gibt Leute, die machen das."}, {"id": 224, "start": 1712.0, "end": 1721.0, "text": "Das ist der Internet Information Service, allein schon der Name kriegst du eigentlich für den Zapp."}, {"id": 225, "start": 1721.0, "end": 1725.0, "text": "Ich persönlich bin auch kein Apache-Fan."}, {"id": 226, "start": 1725.0, "end": 1735.0, "text": "Was ich mag ist, ja tatsächlich, also so als Feldwald und Wiesenwebserver, wenn man nicht so genau weiß, was man will, ist Nginx, finde ich immer eine gute Wahl."}, {"id": 227, "start": 1735.0, "end": 1750.0, "text": "Aber ich persönlich, ich mag den hier, das ist ein Web-Server in Go und du kannst dir im Zweifelsfall, also entweder installierst du das über den Package Manager oder du kopierst dir das Binary irgendwo hin."}, {"id": 228, "start": 1750.0, "end": 1770.0, "text": "Und das Schöne an dem ist halt, dass die ganze Let's Encrypt Hand, Traffic mag ich nicht als normalen Web-Server, Traffic ist ganz cool, wenn man beispielsweise mit irgendwelchen Containern oder irgendwelchen kontinuerisierten Umgebungen oder ja,"}, {"id": 229, "start": 1770.0, "end": 1783.0, "text": "irgendwelches Zeug, was skalierbar sein soll, wenn du dafür einen Eingangs-Load-Balancer oder sowas brauchst, dann finde ich Traffic ganz nice, der unterstützt ja zig Sachen, ja."}, {"id": 230, "start": 1783.0, "end": 1794.0, "text": "Der unterstützt Docker direkt, der unterstützt, ich glaube, etcd mittlerweile, der unterstützt, da bin ich mir gar nicht so sicher, der kann Kubernetes-Cluster-Zeug auslesen."}, {"id": 231, "start": 1794.0, "end": 1811.0, "text": "Also als Load-Balancer für irgendwelche skalierbaren Sachen ist Traffic wunderbar, aber als einfache Reverse-Proxy, Load-Balancer und Web-Server finde ich Cardi deutlich besser, zumal die Traffic-Konfiguration richtig abfuck ist."}, {"id": 232, "start": 1811.0, "end": 1825.0, "text": "Also in Traffic alles, was du nicht, also ich rede hier von, also alles, was du nicht automatisch machen kannst in Traffic ist die Konfig abartig."}, {"id": 233, "start": 1825.0, "end": 1834.0, "text": "Schau ich mal sowas hier an, es wird noch schlimmer, das finde ich Traffic deutlich angenehmer, aber ansonsten, wenn man nicht weiß, was genau Engine X tut auch immer,"}, {"id": 234, "start": 1834.0, "end": 1846.0, "text": "aber gerade wenn man Let's Encrypt braucht und Zertifikatsverwaltung, die automatisch passieren soll, dann ist es äußerst sinnig uns zu empfehlen, sich mal das hier anzugucken."}, {"id": 235, "start": 1846.0, "end": 1872.0, "text": "Da würde ich ihr nichts drauf geben, auf diese ganzen, ähm, das ist eine gute Frage."}, {"id": 236, "start": 1872.0, "end": 1887.0, "text": "Was ist denn für dich reines, reines Layer 4 Load-Balancing? Load-Balancing ist in der Regel immer Layer 4."}, {"id": 237, "start": 1887.0, "end": 1902.0, "text": "Oder, Fiber, das, ja, das, das habe ich auch, das habe ich auch mir angeguckt, also nein, das habe ich mir ausgeguckt, dass ich mir das mal angucken will."}, {"id": 238, "start": 1902.0, "end": 1924.0, "text": "Kaji TCP Load-Balancer, ja, okay, der Load-Balancer, der HTTPS terminiert, das ist dann ja auch kein reiner Load-Balancer mehr."}, {"id": 239, "start": 1924.0, "end": 1939.0, "text": "Das ist dann eher so ein Anwendungsproxy oder so, keine Ahnung. Ich habe ehrlich gesagt, keine Ahnung."}, {"id": 240, "start": 1939.0, "end": 1965.0, "text": "Ich verwende Kaji zu 99% als Reverse-Proxy. Kaji ist glaube ich auch in Go."}, {"id": 241, "start": 1965.0, "end": 1971.0, "text": "Ich meine, Load-Balancing ist in der Regel immer eine Mischung aus Layer 3 und 4, logischerweise."}, {"id": 242, "start": 1971.0, "end": 1981.0, "text": "Du hast dann beispielsweise eine Public-IP und ein Port, den du halt weiterleitest auf, keine Ahnung, drei Abserver hinten dran."}, {"id": 243, "start": 1981.0, "end": 1991.0, "text": "Vielleicht auf einem anderen Port. Oder ansonsten bin ich mir nicht sicher, was du meinst."}, {"id": 244, "start": 1991.0, "end": 1999.0, "text": "Kann Kaji PHP sagen? Ja, ich glaube schon, dass du damit auch ganz normal PHP Zeug aufrufen kannst, habe ich aber noch nicht gemacht."}, {"id": 245, "start": 1999.0, "end": 2004.0, "text": "Wie gesagt, es ging ja auch weniger um Load-Balancer, mehr um Webserver."}, {"id": 246, "start": 2004.0, "end": 2014.0, "text": "Ich verwende Kaji zu 99% als Reverse-Proxy für Let's Encrypt bzw. für statische Content zum Ausliefern."}, {"id": 247, "start": 2014.0, "end": 2022.0, "text": "Und dafür ist Kaji einfach unschlagbar gut. Statisches Go-Binary, falls es das nicht gibt, in der aktuellen Version."}, {"id": 248, "start": 2022.0, "end": 2029.0, "text": "Im Package Manager. Und ab geht's. Die Config, drei Zeilen, fertig geht. Let's Encrypt eingebaut."}, {"id": 249, "start": 2029.0, "end": 2039.0, "text": "Für das meiste, was man braucht. Leider keine Azure-Unterstützung standardmäßig, aber es gibt Azure-Module für Kaji."}, {"id": 250, "start": 2039.0, "end": 2047.0, "text": "Kevo, Dankeschön für den Sub. Nee, noch nicht. Morgen."}, {"id": 251, "start": 2047.0, "end": 2055.0, "text": "Wie gesagt, ich glaube Go. Ja, das funktioniert ja auch alles, wenn du IP."}, {"id": 252, "start": 2055.0, "end": 2068.0, "text": "Das ist ja alles, was oben drüber ist, funktioniert ja dann auch."}, {"id": 253, "start": 2068.0, "end": 2075.0, "text": "Wie darf ich mir reines, jetzt sehr ernsthaft, wie darf ich mir reines Layer 7 Load Balancing vorstellen?"}, {"id": 254, "start": 2075.0, "end": 2083.0, "text": "Ich mein, du musst ja irgendwie den Traffic annehmen und dann auf die einzelnen Server verteilen."}, {"id": 255, "start": 2083.0, "end": 2088.0, "text": "Das kannst du ja nicht rein auf Layer 7 machen."}, {"id": 256, "start": 2088.0, "end": 2095.0, "text": "Oder ist Layer 7 Load Balancing, du rotierst die Stühle vom Bildschirm durch."}, {"id": 257, "start": 2095.0, "end": 2103.0, "text": "Du hast quasi einen Bildschirm und du hast quasi so drei Anwender, die dann im Kreis immer rotiert werden vom Schreibtisch."}, {"id": 258, "start": 2103.0, "end": 2113.0, "text": "Oder ist das Layer 7 Load Balancing?"}, {"id": 259, "start": 2113.0, "end": 2120.0, "text": "Osilayer ist eh so ein Ding, das ist fast für die Berufsschule."}, {"id": 260, "start": 2120.0, "end": 2126.0, "text": "Ich weiß da auch einiges nicht mehr, aber es gibt ein paar Sachen, die einen verwirren."}, {"id": 261, "start": 2126.0, "end": 2132.0, "text": "Zum Beispiel, welcher Layer ist jetzt eigentlich ein Abrequest?"}, {"id": 262, "start": 2132.0, "end": 2136.0, "text": "Es kann man so nicht direkt sagen."}, {"id": 263, "start": 2136.0, "end": 2156.0, "text": "Das ist eher so Layer 2 und 3 und so gemischt."}, {"id": 264, "start": 2156.0, "end": 2163.0, "text": "Ja, aber die müssen trotzdem irgendwie den Traffic weiter schicken und rein mit Layer 7 geht das halt nicht."}, {"id": 265, "start": 2163.0, "end": 2168.0, "text": "F, keine Ahnung."}, {"id": 266, "start": 2168.0, "end": 2179.0, "text": "Ja, das triffts, das triffts denke ich ganz gut, ja."}, {"id": 267, "start": 2179.0, "end": 2186.0, "text": "Leute, ich bin übelst im Arsch heute, das ist mir zu großer Five Head Talk im Chat gerade."}, {"id": 268, "start": 2186.0, "end": 2201.0, "text": "Was ist nochmal Layer, Layer Schicht, das hier, das was man in jeder Berufsschule lernt, das Osimodel."}, {"id": 269, "start": 2201.0, "end": 2204.0, "text": "Guck ja, das da."}, {"id": 270, "start": 2204.0, "end": 2209.0, "text": "Ach so heißt der Kram in Deutsch, Bit Übertragungsschicht."}, {"id": 271, "start": 2209.0, "end": 2217.0, "text": "Das habe ich, wie der Krempl auf Deutsch heißt, habe ich schon komplett verdrängt."}, {"id": 272, "start": 2217.0, "end": 2223.0, "text": "Bit Übertragungsschicht, Sicherungsschicht, Vermittlungsschicht, Transportschicht, was?"}, {"id": 273, "start": 2223.0, "end": 2228.0, "text": "Kommunikationssteuer, das hätte ich nicht gewusst."}, {"id": 274, "start": 2228.0, "end": 2229.0, "text": "Das habe ich noch nie gehört."}, {"id": 275, "start": 2229.0, "end": 2235.0, "text": "Habt ihr schon mal Kommunikationssteuerschicht gehört?"}, {"id": 276, "start": 2235.0, "end": 2242.0, "text": "Vielleicht Leute, die in der letzten Zeit irgendwie mal."}, {"id": 277, "start": 2242.0, "end": 2249.0, "text": "Ja, das kenne ich, Sitzung, Session, ich sage auch immer Session."}, {"id": 278, "start": 2249.0, "end": 2258.0, "text": "Datendarstellungsschicht, meine Güte."}, {"id": 279, "start": 2258.0, "end": 2262.0, "text": "Warum der Layer 6 existiert, ich habe keine Ahnung."}, {"id": 280, "start": 2262.0, "end": 2279.0, "text": "In der Regel hört es mich auf, ab Layer 5 oder ab Layer 4 zu interessieren."}, {"id": 281, "start": 2279.0, "end": 2281.0, "text": "Warum ist das ein WLAN Symbol?"}, {"id": 282, "start": 2281.0, "end": 2284.0, "text": "Ach so, weil Übertragung und so."}, {"id": 283, "start": 2284.0, "end": 2288.0, "text": "Wobei das WLAN Symbol ist hier eigentlich falsch."}, {"id": 284, "start": 2288.0, "end": 2291.0, "text": "Das WLAN Symbol musste eigentlich auf der gleichen Ebene sein."}, {"id": 285, "start": 2291.0, "end": 2297.0, "text": "Wobei, die wissen auch nicht so genau, was sie hier für Icons verwendet haben, oder?"}, {"id": 286, "start": 2297.0, "end": 2305.0, "text": "Hör mal auf, ich habe da."}, {"id": 287, "start": 2305.0, "end": 2313.0, "text": "Das kann ich noch nicht als Merksatz."}, {"id": 288, "start": 2313.0, "end": 2315.0, "text": "Ja, WLAN wäre genau."}, {"id": 289, "start": 2315.0, "end": 2318.0, "text": "Also nicht WLAN, sondern das reine Übertragen."}, {"id": 290, "start": 2318.0, "end": 2324.0, "text": "Das wäre Schicht 1, deswegen verstehe ich es auch nicht genau, warum wir hier so ein WLAN Symbol haben."}, {"id": 291, "start": 2324.0, "end": 2328.0, "text": "Da hätten sie hier irgendwie Netzwerkgeräte, aber egal."}, {"id": 292, "start": 2328.0, "end": 2347.0, "text": "Komm, das, who cares, OSI Zeug."}, {"id": 293, "start": 2347.0, "end": 2350.0, "text": "WLAN ist keine Bridge."}, {"id": 294, "start": 2350.0, "end": 2353.0, "text": "Eine Bridge ist ja das, was ein Switch macht, nur mit zwei Ports."}, {"id": 295, "start": 2353.0, "end": 2356.0, "text": "Deswegen ist ein Switch auch eine Multiport Bridge."}, {"id": 296, "start": 2356.0, "end": 2360.0, "text": "Eine Bridge kann zum Beispiel gucken, welche Mac-Adressen hinter welchen Ports sind."}, {"id": 297, "start": 2360.0, "end": 2365.0, "text": "Und segmentiert das Netz und sorgt, jetzt Leute, jetzt müsst ihr mir helfen, ob das stimmt, was ich erzähle."}, {"id": 298, "start": 2365.0, "end": 2367.0, "text": "Das ist bei mir schon 15 Jahre her."}, {"id": 299, "start": 2367.0, "end": 2371.0, "text": "Und limitiert die Broadcast-Domäne."}, {"id": 300, "start": 2371.0, "end": 2372.0, "text": "Stimmt das?"}, {"id": 301, "start": 2372.0, "end": 2377.0, "text": "Ich weiß es nicht mehr genau."}, {"id": 302, "start": 2377.0, "end": 2381.0, "text": "Stimmt das, ja?"}, {"id": 303, "start": 2381.0, "end": 2385.0, "text": "Ich kuck das nicht mal genau zusammen."}, {"id": 304, "start": 2385.0, "end": 2388.0, "text": "Kollisionsgedöns und so."}, {"id": 305, "start": 2388.0, "end": 2391.0, "text": "Nee, ich rede von Bridges, nicht von Routern."}, {"id": 306, "start": 2391.0, "end": 2394.0, "text": "Ach, keine Ahnung, das ist zu lange her."}, {"id": 307, "start": 2394.0, "end": 2400.0, "text": "Und WLAN ist im Prinzip das reine Übertragen durch die Luft."}, {"id": 308, "start": 2400.0, "end": 2402.0, "text": "Der Router ist keine Bridge, nein."}, {"id": 309, "start": 2402.0, "end": 2404.0, "text": "Ein Switch ist eine Bridge."}, {"id": 310, "start": 2404.0, "end": 2413.0, "text": "Ein Switch ist eine Bridge mit mehreren Ports."}, {"id": 311, "start": 2413.0, "end": 2415.0, "text": "Ach nein, ihr habt recht."}, {"id": 312, "start": 2415.0, "end": 2419.0, "text": "Die Kollision, die Kollisions-Domäne wird..."}, {"id": 313, "start": 2419.0, "end": 2422.0, "text": "Nee."}, {"id": 314, "start": 2422.0, "end": 2424.0, "text": "Ach, keine Ahnung, das ist zu lange her."}, {"id": 315, "start": 2424.0, "end": 2428.0, "text": "Keine Ahnung."}, {"id": 316, "start": 2428.0, "end": 2430.0, "text": "Ja, siehste."}, {"id": 317, "start": 2430.0, "end": 2438.0, "text": "Was soll ich sagen da, bei mir ist das 15 Jahre her."}, {"id": 318, "start": 2438.0, "end": 2440.0, "text": "Wer braucht diesen Shit?"}, {"id": 319, "start": 2440.0, "end": 2457.0, "text": "Ja, wenn du was mit Netzwerktechnik machst, brauchst du den Shit immer mal wieder."}, {"id": 320, "start": 2457.0, "end": 2459.0, "text": "Ja, das ist okay."}, {"id": 321, "start": 2459.0, "end": 2463.0, "text": "Aber das reine Übertragen bei WLAN, das ist Layer 1."}, {"id": 322, "start": 2463.0, "end": 2471.0, "text": "Bei WLAN ist ja quasi, man kann nicht sagen die Luft Layer 1."}, {"id": 323, "start": 2471.0, "end": 2487.0, "text": "So, die Wellen durch die Luft ist quasi Layer 1."}, {"id": 324, "start": 2487.0, "end": 2491.0, "text": "Ja, cringe, wer noch nicht sein eigenes TCP implementiert hat."}, {"id": 325, "start": 2491.0, "end": 2494.0, "text": "Chat, habt ihr auch schon alle gemacht, oder?"}, {"id": 326, "start": 2494.0, "end": 2496.0, "text": "Also ansonsten würde ich mich fragen, was ihr hier macht."}, {"id": 327, "start": 2496.0, "end": 2511.0, "text": "Also ich glaube, so die Mindestvoraussetzung hier sollte eigentlich sein, dass man mal sein eigenes TCP implementiert hat."}, {"id": 328, "start": 2511.0, "end": 2516.0, "text": "Also, wenn du die Frage stellen musst, liegt das an C++?"}, {"id": 329, "start": 2516.0, "end": 2519.0, "text": "Dann kann man in der Regel sagen, ja, es liegt immer an C++."}, {"id": 330, "start": 2519.0, "end": 2538.0, "text": "Aber in dem Fall können die nichts dafür, weil das ESP2, also das ESP, das Espressive Framework, das ist reines C, hat nichts mit C++ zu tun."}, {"id": 331, "start": 2538.0, "end": 2549.0, "text": "Das was kacke ist, ist wahrscheinlich das Arduino Zeug oben drüber, was nicht richtig tut."}, {"id": 332, "start": 2549.0, "end": 2553.0, "text": "Du hast IPv7 schon fertig, ja, das ist gut."}, {"id": 333, "start": 2553.0, "end": 2558.0, "text": "Das kommt, nachdem sich IPv6 flächendeckend durchgesetzt hat."}, {"id": 334, "start": 2558.0, "end": 2560.0, "text": "Also nie wahrscheinlich."}, {"id": 335, "start": 2560.0, "end": 2566.0, "text": "Leute, ich habe euch ja schon gesagt, was meine persönliche Vermutung ist."}, {"id": 336, "start": 2566.0, "end": 2571.0, "text": "Und zwar, ich glaube, dass sich IPv6 nie durchsetzen wird."}, {"id": 337, "start": 2571.0, "end": 2578.0, "text": "Ich persönlich gehe ja davon aus, und ja, es kann sein, dass es technisch gar nicht möglich ist, was ich jetzt sage, so ohne weiteres."}, {"id": 338, "start": 2578.0, "end": 2586.0, "text": "Aber ich persönlich gehe davon aus, dass es folgendermaßen kommt."}, {"id": 339, "start": 2586.0, "end": 2604.0, "text": "Man müht sich jetzt noch ein paar Jahre mit IPv6 ab und irgendwann kommt dann Google, Facebook, Microsoft und die üblichen Verdächtigen in Bedrängnis."}, {"id": 340, "start": 2604.0, "end": 2619.0, "text": "Amazon in Bedrängnis und hat irgendwann Angst, dass ihr jetzt wirklich die knappen IPv4-Adressen ihr Geschäft schädigt."}, {"id": 341, "start": 2619.0, "end": 2626.0, "text": "Und aus irgendwelchen Gründen IPv6 bei ihnen nicht so einfach das Problem löst."}, {"id": 342, "start": 2626.0, "end": 2637.0, "text": "Und dann wird folgendes passieren, dann wird Microsoft, Amazon, Google und Konsorten sich zusammen sowas wie IPv4,5 überlegen."}, {"id": 343, "start": 2637.0, "end": 2648.0, "text": "Und es wird der abartigste Hack aller Zeiten rausgeholt, um sowas wie IPv4,5 zu machen."}, {"id": 344, "start": 2648.0, "end": 2653.0, "text": "Und es wird wahrscheinlich nicht doppelt das Nutt sein."}, {"id": 345, "start": 2653.0, "end": 2657.0, "text": "Es wird irgendwas anderes sein."}, {"id": 346, "start": 2657.0, "end": 2669.0, "text": "Und nachdem es Microsoft, Google und Hasse nicht gesehen ist, ist das ratzfatz in allen Betriebssystemen und Mobile-Geräten integriert."}, {"id": 347, "start": 2669.0, "end": 2674.0, "text": "Deutlich schneller als sich je IPv6 durchsetzen wird, selbst dann."}, {"id": 348, "start": 2674.0, "end": 2680.0, "text": "Und ja, Netzwerkgeräte und die ganze Internetinfrastruktur muss es trotzdem unterstützen."}, {"id": 349, "start": 2680.0, "end": 2685.0, "text": "Allerdings könnte ich mir vorstellen, dass das wirklich ein mega krasser Hack wird."}, {"id": 350, "start": 2685.0, "end": 2690.0, "text": "Dass es quasi etwas Abwärtskompatibles zu IPv4 wird."}, {"id": 351, "start": 2690.0, "end": 2694.0, "text": "Dass man sagt, man macht IPv4 Extended."}, {"id": 352, "start": 2694.0, "end": 2706.0, "text": "Dass man dann zum Beispiel, also ich denke mir jetzt nur mal was total Abartiges aus, was so ähnlich vielleicht man machen könnte."}, {"id": 353, "start": 2706.0, "end": 2708.0, "text": "Ich weiß nicht, ob es technisch möglich ist."}, {"id": 354, "start": 2708.0, "end": 2717.0, "text": "Man könnte sich zum Beispiel reservierte IPv4 Adressen angucken."}, {"id": 355, "start": 2717.0, "end": 2728.0, "text": "Und dann sagt man zum Beispiel, oder man guckt, ob es gewisse Bitkombinationen gibt, die nur bei reservierten Adressen vorkommen."}, {"id": 356, "start": 2728.0, "end": 2738.0, "text": "Und dann könnte man quasi, wenn diese Bits gesetzt sind, noch was hinten dran hängen oder so. So ein bisschen wie es UTF-8 macht."}, {"id": 357, "start": 2738.0, "end": 2750.0, "text": "Bei UTF-8 ist es ja so, wenn das letzte Byte gesetzt ist, dann geht das Zeichen weiter oder sowas. Irgendwie sowas in der Richtung."}, {"id": 358, "start": 2750.0, "end": 2761.0, "text": "Ich traue denen sehr viel zu, was komische Hacks angeht."}, {"id": 359, "start": 2761.0, "end": 2766.0, "text": "Nee, heute wird nicht die Schlange gebändigt."}, {"id": 360, "start": 2766.0, "end": 2772.0, "text": "Also ich könnte mir tatsächlich vorstellen, sowas kommt."}, {"id": 361, "start": 2772.0, "end": 2778.0, "text": "Das kommt bevor sich IPv6 Flashstriken durchsetzen kann."}, {"id": 362, "start": 2778.0, "end": 2785.0, "text": "Kann Amazon mittlerweile? Ist Amazon eigentlich mittlerweile über IPv6 erreichbar?"}, {"id": 363, "start": 2785.0, "end": 2801.0, "text": "Oder was, Twitter wusste ich nicht? Nee, Twitter geht schon lange, gell?"}, {"id": 364, "start": 2801.0, "end": 2806.0, "text": "Theoretisch müsstest du in IPv4 Adressen investieren, ja."}, {"id": 365, "start": 2806.0, "end": 2812.0, "text": "Ich weiß aber nicht, ob man das so einfach geht, weil Handel mit IPv4 Adressen ist ja eigentlich verboten."}, {"id": 366, "start": 2812.0, "end": 2820.0, "text": "Es passiert trotzdem, ja. Aber ein Kollege von mir auf der Arbeit, der hat früher mal beim Dezix gearbeitet."}, {"id": 367, "start": 2820.0, "end": 2829.0, "text": "Der hatte einen persönlichen Flash, ich weiß nicht, Flash 24 Block oder sowas aus der Zeit noch."}, {"id": 368, "start": 2829.0, "end": 2835.0, "text": "Und wisst ihr was der gemacht hat mit seinem persönlichen IPv4 Flash 24 Block?"}, {"id": 369, "start": 2835.0, "end": 2839.0, "text": "Und ich weiß nicht, ob es ein Flash 24, ich sag jetzt einfach Flash 24 Block."}, {"id": 370, "start": 2839.0, "end": 2845.0, "text": "Weißt was, wisst ihr was der damit gemacht hat? Der hat das einfach zurückgegeben."}, {"id": 371, "start": 2845.0, "end": 2851.0, "text": "Einfach im Interesse des Allgemeinwohls hat er seinen eigenen Block zurückgegeben,"}, {"id": 372, "start": 2851.0, "end": 2858.0, "text": "den er sich irgendwann mal gesichert hat vor 20 Jahren oder so."}, {"id": 373, "start": 2858.0, "end": 2863.0, "text": "Hat nichts dafür bekommen und hat es zurückgegeben."}, {"id": 374, "start": 2863.0, "end": 2879.0, "text": "Aber muss man sagen, Hut ab."}, {"id": 375, "start": 2879.0, "end": 2899.0, "text": "Vielleicht, aber ich kann mir das bei ihm gut vorstellen, dass er das von sich aus gesagt und gemacht hat."}, {"id": 376, "start": 2899.0, "end": 2909.0, "text": "Und sonst Leute, hab ich irgendwas wichtiges verpasst? War heute irgendwas? Was sagt dann Halse? Halse sagt, Big Brain,"}, {"id": 377, "start": 2909.0, "end": 2913.0, "text": "wir sollten nicht immer noch Javascript nutzen, warum nicht?"}, {"id": 378, "start": 2913.0, "end": 2924.0, "text": "Naja komm, wenn der Javascript Experte Grogford das sagt, dann ist ja alles gut."}, {"id": 379, "start": 2924.0, "end": 2930.0, "text": "Yep, Grogford."}, {"id": 380, "start": 2930.0, "end": 2944.0, "text": "Ja was da beschlossen wird, hab ich mittlerweile eh keinerlei Vertrauen mehr, dass da irgendwas Sinnvolles beschlossen wird."}, {"id": 381, "start": 2944.0, "end": 2950.0, "text": "Zero Day Lücke in Chrome, ach deswegen gab es heute ein Update wahrscheinlich. Verstehe."}, {"id": 382, "start": 2950.0, "end": 2957.0, "text": "Oh, britische voll Hickwischen und Dahua."}, {"id": 383, "start": 2957.0, "end": 2959.0, "text": "Warum?"}, {"id": 384, "start": 2959.0, "end": 2964.0, "text": "China-Chinesen Kameras, beste, vor allem mit geflashter Firmware."}, {"id": 385, "start": 2964.0, "end": 2979.0, "text": "Warum? Warum soll ich keine Hickwischen und Dahua mehr?"}, {"id": 386, "start": 2979.0, "end": 2992.0, "text": "Außer, dass die menschenrechtlich fragwürdige Sachen gemacht haben."}, {"id": 387, "start": 2992.0, "end": 2999.0, "text": "Also ich hab keine Hickwischen Kamera im Einsatz, ich hab Reolink, das ist aber auch so ein billiges China-Chinesen Ding."}, {"id": 388, "start": 2999.0, "end": 3002.0, "text": "Dafür funktioniert es komplett offline."}, {"id": 389, "start": 3002.0, "end": 3011.0, "text": "Zumal ich es eh in meinem IoT-Netz stehen habe, also ich hab ja von denen ein paar Kameras, das nirgends wohin darf."}, {"id": 390, "start": 3011.0, "end": 3018.0, "text": "In meinem IoT-Netz darf noch nicht mal ein DNS oder sonst was raus, gar nichts."}, {"id": 391, "start": 3018.0, "end": 3027.0, "text": "Das finde ich jetzt aber ein bisschen cringe, dass die irgendwie Kinder damit beobachten wollen. Warum sollte man sowas machen wollen?"}, {"id": 392, "start": 3027.0, "end": 3032.0, "text": "Guck mal, die haben sogar Lichter, beste."}, {"id": 393, "start": 3032.0, "end": 3037.0, "text": "Aber gut, die China-Chinesen Produktfoto sind eh immer ein bisschen fragwürdig."}, {"id": 394, "start": 3037.0, "end": 3042.0, "text": "Fahrradmusik, genau, ist gerade."}, {"id": 395, "start": 3042.0, "end": 3047.0, "text": "Das Ding sieht ja mal hässlich aus."}, {"id": 396, "start": 3047.0, "end": 3050.0, "text": "Ja, von denen habe ich ein paar Kameras, die funktionieren ganz gut."}, {"id": 397, "start": 3050.0, "end": 3059.0, "text": "Und weil ich gerade Flash-Player gelesen habe, wisst ihr, dass sie den Flash-Player erst mit dem letzten größeren Firmware-Update rausgeschmissen haben und HTML5 reingemacht haben?"}, {"id": 398, "start": 3059.0, "end": 3065.0, "text": "Bis dahin liefen diese ganzen Kameras immer noch über Flash-Player."}, {"id": 399, "start": 3065.0, "end": 3072.0, "text": "Eine NFT-Spielekonsole, ernsthaft?"}, {"id": 400, "start": 3072.0, "end": 3082.0, "text": "Machen das eigentlich, also machen das irgendwie Leute, die da ernsthaft ein Produkt rausbringen wollen?"}, {"id": 401, "start": 3082.0, "end": 3087.0, "text": "Oder ist das einfach nur NFT-Stonks?"}, {"id": 402, "start": 3087.0, "end": 3097.0, "text": "Also ist das was, was irgendwann jemals erscheint oder Roadmap?"}, {"id": 403, "start": 3097.0, "end": 3101.0, "text": "Ja, okay, das kommt nie raus, das Ding."}, {"id": 404, "start": 3101.0, "end": 3106.0, "text": "Das, das kommt nie raus."}, {"id": 405, "start": 3106.0, "end": 3109.0, "text": "Das oder, naja, vielleicht kommt es raus."}, {"id": 406, "start": 3109.0, "end": 3117.0, "text": "Ich meine, diese Ouya-Konsole ist auch rausgekommen, falls sich da noch irgendjemand dran erinnert."}, {"id": 407, "start": 3117.0, "end": 3128.0, "text": "Das hat ihnen aber auch nichts gebracht."}, {"id": 408, "start": 3128.0, "end": 3134.0, "text": "Da ist die Sache schon mal gelaufen für mich."}, {"id": 409, "start": 3134.0, "end": 3137.0, "text": "HTML5?"}, {"id": 410, "start": 3137.0, "end": 3148.0, "text": "Also JavaScript verstehe ich, aber HTML5?"}, {"id": 411, "start": 3148.0, "end": 3152.0, "text": "Fingerprint-Sensor für mehr NFT."}, {"id": 412, "start": 3152.0, "end": 3160.0, "text": "Naja, ich bin ja skeptisch, was solche Produkte angeht."}, {"id": 413, "start": 3160.0, "end": 3163.0, "text": "Ich meine, immerhin haben sie schon geschafft, ein 3D-Renderbild zu haben."}, {"id": 414, "start": 3163.0, "end": 3178.0, "text": "Das ist ja schon mal mehr, als viele NFT-Spiele überhaupt bis jetzt jemals geschafft haben."}, {"id": 415, "start": 3178.0, "end": 3184.0, "text": "Mehr Infos hier, kommt jetzt, never gonna give you up."}, {"id": 416, "start": 3184.0, "end": 3191.0, "text": "Ach so, äh, 18 Minuten Video will ich jetzt nicht gucken."}, {"id": 417, "start": 3191.0, "end": 3209.0, "text": "Ja, mit IP-Buns musste bei IPv6 wirklich nicht mehr kommen."}, {"id": 418, "start": 3209.0, "end": 3212.0, "text": "Ich muss beim Zahnarzt jetzt 60 Euro bezahlen."}, {"id": 419, "start": 3212.0, "end": 3213.0, "text": "Ich war heute beim Zahnarzt."}, {"id": 420, "start": 3213.0, "end": 3216.0, "text": "Wisst ihr, was ich, wisst ihr, was ich sehr nice finden würde?"}, {"id": 421, "start": 3216.0, "end": 3220.0, "text": "Warum kann man seinen Zahnarzt nicht per PayPal bezahlen?"}, {"id": 422, "start": 3220.0, "end": 3225.0, "text": "Warum muss es immer Überweisung oder Bankkarte direkt sein?"}, {"id": 423, "start": 3225.0, "end": 3228.0, "text": "Warum akzeptieren die eigentlich keinen PayPal?"}, {"id": 424, "start": 3228.0, "end": 3235.0, "text": "Das wäre viel einfacher, dann hätte ich einfach vom Handy schnell PayPal überwiesen."}, {"id": 425, "start": 3235.0, "end": 3240.0, "text": "Davon, ja, 60 Euro, ja."}, {"id": 426, "start": 3240.0, "end": 3242.0, "text": "Weil Spezialfüllung."}, {"id": 427, "start": 3242.0, "end": 3248.0, "text": "Ich nehme immer die bessere Füllung, weil ich will, dass meine Füllung länger hält."}, {"id": 428, "start": 3248.0, "end": 3256.0, "text": "Und, und natürlicher aussieht."}, {"id": 429, "start": 3256.0, "end": 3271.0, "text": "Man kann im Internet fast überall PayPal nutzen, aber offline halt kaum."}, {"id": 430, "start": 3271.0, "end": 3283.0, "text": "Ja, anscheinend nicht genug, ja."}, {"id": 431, "start": 3283.0, "end": 3287.0, "text": "Wird hier irgendwas, ok, YouTube."}, {"id": 432, "start": 3287.0, "end": 3292.0, "text": "Ich weiß nicht, was mit dem Algorithmus los ist, aber das macht YouTube in letzter Zeit"}, {"id": 433, "start": 3292.0, "end": 3302.0, "text": "gerne 10 Jahre alte Videos auf einmal in den Algorithmus befördern."}, {"id": 434, "start": 3302.0, "end": 3314.0, "text": "Da hast du ordentlich was zu schaukeln."}, {"id": 435, "start": 3314.0, "end": 3330.0, "text": "Yep, Glock."}, {"id": 436, "start": 3330.0, "end": 3334.0, "text": "Das ist quasi der abschließende Klingeltest, oder wie?"}, {"id": 437, "start": 3334.0, "end": 3335.0, "text": "Alles klar."}, {"id": 438, "start": 3335.0, "end": 3339.0, "text": "YouTube, Dankeschön Algorithmus, dass du mir das empfohlen hast."}, {"id": 439, "start": 3339.0, "end": 3349.0, "text": "Jetzt bin ich um ein Vielfaches schlauer."}, {"id": 440, "start": 3349.0, "end": 3353.0, "text": "Du hattest schon wieder mein Schneestellvideo, ja."}, {"id": 441, "start": 3353.0, "end": 3358.0, "text": "Ich weiß, der YouTube-Algorithmus mag das und ich weiß nicht, warum der das mag."}, {"id": 442, "start": 3358.0, "end": 3365.0, "text": "Das ist wirklich eines der großen Rätsel von YouTube, warum mein Video im Garten 2,5 Millionen"}, {"id": 443, "start": 3365.0, "end": 3366.0, "text": "Views hat."}, {"id": 444, "start": 3366.0, "end": 3370.0, "text": "Ich habe keine Ahnung."}, {"id": 445, "start": 3370.0, "end": 3374.0, "text": "Wollen wir mal gucken, welche Bewertung das mittlerweile hat?"}, {"id": 446, "start": 3374.0, "end": 3377.0, "text": "Wie viele Bewertungen das hat?"}, {"id": 447, "start": 3377.0, "end": 3380.0, "text": "Hier im Garten."}, {"id": 448, "start": 3380.0, "end": 3383.0, "text": "Ok, sorry, nicht 2,5, nur 2 Millionen Views."}, {"id": 449, "start": 3383.0, "end": 3390.0, "text": "Nur 2 Millionen Views auf einem Gartenvideo."}, {"id": 450, "start": 3390.0, "end": 3392.0, "text": "Nur 2 Millionen."}, {"id": 451, "start": 3392.0, "end": 3394.0, "text": "2 Millionen Views."}, {"id": 452, "start": 3394.0, "end": 3397.0, "text": "Muss man sich mal auf der Zunge zergehen lassen."}, {"id": 453, "start": 3397.0, "end": 3413.0, "text": "Ein Video, wo ich durch den Garten laufe bei mir."}, {"id": 454, "start": 3413.0, "end": 3418.0, "text": "Die Bewertungen sind auch eigentlich verhältnismäßig gut für das, dass dieses Video komplett"}, {"id": 455, "start": 3418.0, "end": 3424.0, "text": "uninteressant für 99,99999% der Zuschauer war."}, {"id": 456, "start": 3424.0, "end": 3427.0, "text": "Fick real life hinten dran?"}, {"id": 457, "start": 3427.0, "end": 3432.0, "text": "Naja."}, {"id": 458, "start": 3432.0, "end": 3447.0, "text": "Das fragen sich alle Pratsator."}, {"id": 459, "start": 3447.0, "end": 3448.0, "text": "Man weiß es nicht."}, {"id": 460, "start": 3448.0, "end": 3449.0, "text": "Man weiß es nicht."}, {"id": 461, "start": 3449.0, "end": 3456.0, "text": "Wir werden es wirklich nie verstehen."}, {"id": 462, "start": 3456.0, "end": 3462.0, "text": "Lass mal den Barnrage schauen."}, {"id": 463, "start": 3462.0, "end": 3467.0, "text": "Nee, nee, nee, nee, wir schauen jetzt keinen Barnrage."}, {"id": 464, "start": 3467.0, "end": 3471.0, "text": "Was haben wir noch für Videos offen zum gucken?"}, {"id": 465, "start": 3471.0, "end": 3479.0, "text": "Should you build your, was, nee, should you buy or build a NAS?"}, {"id": 466, "start": 3479.0, "end": 3480.0, "text": "Trifestore?"}, {"id": 467, "start": 3480.0, "end": 3484.0, "text": "Nee, das will ich mir jetzt nicht angucken."}, {"id": 468, "start": 3484.0, "end": 3485.0, "text": "Specs."}, {"id": 469, "start": 3485.0, "end": 3494.0, "text": "Ganz ehrlich, ich würde ein NAS kaufen und bilden."}, {"id": 470, "start": 3494.0, "end": 3499.0, "text": "Also ich würde irgendwas kaufen und damit dann ein NAS bauen."}, {"id": 471, "start": 3499.0, "end": 3502.0, "text": "So ein eigenes, so ein eigenes Gehäuse mit Dings."}, {"id": 472, "start": 3502.0, "end": 3506.0, "text": "Also wenn schon überhaupt, dann hätte ich Wechsel, Festplats, also Wechselrahmen für"}, {"id": 473, "start": 3506.0, "end": 3509.0, "text": "die Festplatten, weil das eigentlich, finde ich, wird das wichtigste ist."}, {"id": 474, "start": 3509.0, "end": 3514.0, "text": "Aha, ein Unraid User."}, {"id": 475, "start": 3514.0, "end": 3519.0, "text": "Was ist das?"}, {"id": 476, "start": 3519.0, "end": 3522.0, "text": "Meine Vorschau funktioniert nicht, Leute."}, {"id": 477, "start": 3522.0, "end": 3534.0, "text": "Ach, auf meinem zweiten Monitor funktioniert sie aber."}, {"id": 478, "start": 3534.0, "end": 3537.0, "text": "Max, hast du schon mal was mit OpenFlow gemacht?"}, {"id": 479, "start": 3537.0, "end": 3538.0, "text": "Nein."}, {"id": 480, "start": 3538.0, "end": 3541.0, "text": "Sagt mir überhaupt gar nichts."}, {"id": 481, "start": 3541.0, "end": 3550.0, "text": "Aha, nee, das kenne ich nicht."}, {"id": 482, "start": 3550.0, "end": 3557.0, "text": "Das sagt mir wirklich gar nichts."}, {"id": 483, "start": 3557.0, "end": 3563.0, "text": "Ja, keine Ahnung."}, {"id": 484, "start": 3563.0, "end": 3566.0, "text": "Im Geschäft?"}, {"id": 485, "start": 3566.0, "end": 3567.0, "text": "Nö."}, {"id": 486, "start": 3567.0, "end": 3572.0, "text": "Das haben da doch kaum jemand mitgekriegt."}, {"id": 487, "start": 3572.0, "end": 3578.0, "text": "Ist nicht so, als würde die halbe Firma meine Streams gucken oder so, zum Glück nicht."}, {"id": 488, "start": 3578.0, "end": 3580.0, "text": "Das benutzt Google fürs interne Routing."}, {"id": 489, "start": 3580.0, "end": 3588.0, "text": "Ja, dann wird es ja genau das Richtige fürs Home Lab."}, {"id": 490, "start": 3588.0, "end": 3591.0, "text": "Nee, ich habe mir die Stellenanzeige angeguckt."}, {"id": 491, "start": 3591.0, "end": 3603.0, "text": "Ich bin da nicht big brain genug für, um als.NET Entwickler zu arbeiten."}, {"id": 492, "start": 3603.0, "end": 3608.0, "text": "Nico sagt war heute im Termin mit der Digital Ministerin unseres Bundeslandes."}, {"id": 493, "start": 3608.0, "end": 3617.0, "text": "Sie hat uns gefragt, wie sie die Saas Anwendung auf ihren PC speichert und starten kann."}, {"id": 494, "start": 3617.0, "end": 3624.0, "text": "Also ich weiß jetzt nicht, was ich besser oder schlechter finde, dass diese Frage so"}, {"id": 495, "start": 3624.0, "end": 3634.0, "text": "gestellt wird."}, {"id": 496, "start": 3634.0, "end": 3636.0, "text": "Nico sag mir, was ich davon halten soll."}, {"id": 497, "start": 3636.0, "end": 3649.0, "text": "Ich meine, dass sie das nicht genau weiß, dass die Anwendung jetzt halt nicht lokal"}, {"id": 498, "start": 3649.0, "end": 3650.0, "text": "läuft."}, {"id": 499, "start": 3650.0, "end": 3655.0, "text": "Ich meine, ein Digital Minister muss sich mit Cloud Technik nicht auskennen."}, {"id": 500, "start": 3655.0, "end": 3671.0, "text": "Sie hat die Software für mehrere Millionen entwickeln."}, {"id": 501, "start": 3671.0, "end": 3676.0, "text": "Ja gut, das heißt auch noch nicht, dass sie weiß, was da eigentlich passiert ist."}, {"id": 502, "start": 3676.0, "end": 3681.0, "text": "Ich meine, guckt ihr mal beispielsweise an, was es für IT Projekte die letzten Jahre"}, {"id": 503, "start": 3681.0, "end": 3686.0, "text": "über gab und wie viele davon was geworden sind."}, {"id": 504, "start": 3686.0, "end": 3693.0, "text": "Kann sich doch jemand an die an die elektronische Gesundheitskarte erinnern?"}, {"id": 505, "start": 3693.0, "end": 3703.0, "text": "Oder benutzt irgendjemand vom neuen Personalausweis diese Sachen mit Dokumente freigeben und"}, {"id": 506, "start": 3703.0, "end": 3706.0, "text": "was?"}, {"id": 507, "start": 3706.0, "end": 3711.0, "text": "Da gibt es so viele Sachen."}, {"id": 508, "start": 3711.0, "end": 3717.0, "text": "Ja, theoretisch geht das."}, {"id": 509, "start": 3717.0, "end": 3720.0, "text": "Das verwendet nur keiner."}, {"id": 510, "start": 3720.0, "end": 3728.0, "text": "Also ich cringe immer, wenn irgendwelche IT Projekte angekündigt werden."}, {"id": 511, "start": 3728.0, "end": 3732.0, "text": "Und ich denke mir immer, das klappt doch eh nicht."}, {"id": 512, "start": 3732.0, "end": 3735.0, "text": "Und wisst ihr eigentlich, dass das schlimm ist, dass man standardmäßig mittlerweile"}, {"id": 513, "start": 3735.0, "end": 3738.0, "text": "davon ausgehen muss, dass es nicht klappt?"}, {"id": 514, "start": 3738.0, "end": 3745.0, "text": "Ich meine, wir haben eigentlich das Knowhow und die Leute, dass sowas klappen kann."}, {"id": 515, "start": 3745.0, "end": 3749.0, "text": "Es ist jetzt ja nicht so, als wären wir komplette Noobs, was das angeht."}, {"id": 516, "start": 3749.0, "end": 3755.0, "text": "Wir haben durchaus Leute mit Ahnung, aber ich weiß nicht, was es ist."}, {"id": 517, "start": 3755.0, "end": 3760.0, "text": "Diese Projekte, die dort geplant werden, ich glaube, die haben komplett falsche Anreize."}, {"id": 518, "start": 3760.0, "end": 3763.0, "text": "Da geht es gar nicht darum, ein gutes Produkt zu entwickeln, da geht es darum, möglichst"}, {"id": 519, "start": 3763.0, "end": 3766.0, "text": "langsam zu sein und möglichst viel Geld abzugreifen."}, {"id": 520, "start": 3766.0, "end": 3768.0, "text": "Ich glaube, das ist einfach nicht gut gemanagt."}, {"id": 521, "start": 3768.0, "end": 3776.0, "text": "Also jeder Manager würde dafür wahrscheinlich hochkantig rausfliegen."}, {"id": 522, "start": 3776.0, "end": 3781.0, "text": "Der neue Personalausweis sackt, dafür muss man Fingerabdrücke abgeben."}, {"id": 523, "start": 3781.0, "end": 3784.0, "text": "Ja, komm, die haben viel gesagt, wenn der Tag lang ist."}, {"id": 524, "start": 3784.0, "end": 3788.0, "text": "Kennt ihr noch diese Aussage, Leute?"}, {"id": 525, "start": 3788.0, "end": 3790.0, "text": "Aber ich habe sie auf Twitter gepostet."}, {"id": 526, "start": 3790.0, "end": 3796.0, "text": "50 MBit."}, {"id": 527, "start": 3796.0, "end": 3798.0, "text": "Kennt ihr das noch?"}, {"id": 528, "start": 3798.0, "end": 3806.0, "text": "Von 2017."}, {"id": 529, "start": 3806.0, "end": 3816.0, "text": "Ich bin mir nicht sicher, ob bei jedem mittlerweile 2017 ist oder 2018 ist."}, {"id": 530, "start": 3816.0, "end": 3823.0, "text": "Aber ich gehe stark davon aus, wenn wir jetzt auf den Breitbandatlas gucken, werden wir"}, {"id": 531, "start": 3823.0, "end": 3831.0, "text": "feststellen, es ist noch nicht bei allen Haushalten 2018."}, {"id": 532, "start": 3831.0, "end": 3839.0, "text": "G-Stairs, danke schön für den Sub."}, {"id": 533, "start": 3839.0, "end": 3841.0, "text": "Und dann?"}, {"id": 534, "start": 3841.0, "end": 3843.0, "text": "Und dann?"}, {"id": 535, "start": 3843.0, "end": 3847.0, "text": "Geht er kaputt oder?"}, {"id": 536, "start": 3847.0, "end": 3853.0, "text": "Aber deine Fingerabdrücke kriegst du auch nicht wieder."}, {"id": 537, "start": 3853.0, "end": 3861.0, "text": "Und ist das gut oder schlecht, wenn der Chip kaputt geht?"}, {"id": 538, "start": 3861.0, "end": 3874.0, "text": "Wahrscheinlich ist es gut, dass keiner heimlich Sachen auslesen kann oder?"}, {"id": 539, "start": 3874.0, "end": 3899.0, "text": "Rfid Hülle."}, {"id": 540, "start": 3899.0, "end": 3914.0, "text": "Ja, so eine Rfid Hülle wäre mittlerweile bei den ganzen Karten tatsächlich gar nicht"}, {"id": 541, "start": 3914.0, "end": 3915.0, "text": "mal verkehrt."}, {"id": 542, "start": 3915.0, "end": 3924.0, "text": "Taugen die Dinger was?"}, {"id": 543, "start": 3924.0, "end": 3933.0, "text": "Also hilft das wirklich?"}, {"id": 544, "start": 3933.0, "end": 3942.0, "text": "Ich hab keinen Portemonnaie, ich will auch keins mitnehmen."}, {"id": 545, "start": 3942.0, "end": 3953.0, "text": "Also ich hab, wenn ich aus dem Haus gehe, eigentlich nichts dabei, außer meine Fahrkarte,"}, {"id": 546, "start": 3953.0, "end": 3959.0, "text": "meine Eintrittskarte für die Arbeit und 10 Euro."}, {"id": 547, "start": 3959.0, "end": 3967.0, "text": "Also an Karten und Geld und sowas."}, {"id": 548, "start": 3967.0, "end": 3972.0, "text": "Kein Person, nö nix."}, {"id": 549, "start": 3972.0, "end": 3975.0, "text": "Steiner, danke schön für den Sub."}, {"id": 550, "start": 3975.0, "end": 3977.0, "text": "Doch!"}, {"id": 551, "start": 3977.0, "end": 3987.0, "text": "Ich hab seit einer Weile, ne ne, das ist noch, das ist ne, das ist ne Chipkarte."}, {"id": 552, "start": 3987.0, "end": 3994.0, "text": "Das ist nicht Tost, keinen Personalausweis mitzunehmen, das ist vollkommen in Ordnung."}, {"id": 553, "start": 3994.0, "end": 4006.0, "text": "Ich hab seit einer Weile noch ein, oh wie heißt diese Hersteller, so eine Karte dabei."}, {"id": 554, "start": 4006.0, "end": 4013.0, "text": "Sowas hier, allerdings nicht, wobei das könnte es tatsächlich sein, so eine Karte hab ich"}, {"id": 555, "start": 4013.0, "end": 4015.0, "text": "seit einer Weile noch dabei."}, {"id": 556, "start": 4015.0, "end": 4020.0, "text": "Hat sich tatsächlich schon ein paar Mal als nützlich herausgestellt, ja, z.B. wenn man"}, {"id": 557, "start": 4020.0, "end": 4023.0, "text": "sich irgendwie meine Augenbraue abschneiden muss oder sowas."}, {"id": 558, "start": 4023.0, "end": 4025.0, "text": "Gar nicht schlecht so ein Teil dabei zu haben."}, {"id": 559, "start": 4025.0, "end": 4035.0, "text": "Das ist quasi ein Taschenmesser, nur nicht in Taschenmesserform, wenn man es so will."}, {"id": 560, "start": 4035.0, "end": 4042.0, "text": "Das ist echt praktisch so ein Teil."}, {"id": 561, "start": 4042.0, "end": 4044.0, "text": "Aber sonst hab ich nix dabei."}, {"id": 562, "start": 4044.0, "end": 4052.0, "text": "Also das ist ein Stift, das ist ein Stift, das sind Pinzette, das ist ne Feile, die Feile"}, {"id": 563, "start": 4052.0, "end": 4055.0, "text": "hab ich eigentlich selber nicht gebraucht."}, {"id": 564, "start": 4055.0, "end": 4064.0, "text": "Das ist ein Nagel, ich wusste gar nicht, dass das Ding ein Nagel hat, aber ok."}, {"id": 565, "start": 4064.0, "end": 4074.0, "text": "Pinzette, Zahnstocher, wenn du in die USA fliegst, kannst du das nicht mitnehmen, du"}, {"id": 566, "start": 4074.0, "end": 4076.0, "text": "darfst ins Flugzeug kein Messer mitnehmen."}, {"id": 567, "start": 4076.0, "end": 4083.0, "text": "Es gibt aber auch ein Nailcare Kit, da ist das eine Feile anstatt ein Messer, das darfst"}, {"id": 568, "start": 4083.0, "end": 4086.0, "text": "du mit ins Flugzeug nehmen."}, {"id": 569, "start": 4086.0, "end": 4091.0, "text": "Ja ohne Schere."}, {"id": 570, "start": 4091.0, "end": 4096.0, "text": "Leatherman Tools sind vor allem größer und mehr dran und schwerer."}, {"id": 571, "start": 4096.0, "end": 4102.0, "text": "Für einfach ab und zu mal oder wenn man sich Augenbrau abschneiden muss, dann ist das"}, {"id": 572, "start": 4102.0, "end": 4103.0, "text": "wunderbar."}, {"id": 573, "start": 4103.0, "end": 4108.0, "text": "Ja gut, wenn du in die USA fliegst, kannst du natürlich gleich ein M16 mitnehmen."}, {"id": 574, "start": 4108.0, "end": 4112.0, "text": "Dann schon richtig."}, {"id": 575, "start": 4112.0, "end": 4119.0, "text": "Warte mal, ist das das AR15, ist das das M16?"}, {"id": 576, "start": 4119.0, "end": 4123.0, "text": "Die Zivile M16 oder das Zivile M4?"}, {"id": 577, "start": 4123.0, "end": 4128.0, "text": "Das ist ja alles mehr oder weniger die gleichen Bauteile, das ist ja irgendwie alles ziemlich"}, {"id": 578, "start": 4128.0, "end": 4129.0, "text": "austauschbar."}, {"id": 579, "start": 4129.0, "end": 4136.0, "text": "Freedom, ja alles, das ist halt Ami-Logik."}, {"id": 580, "start": 4136.0, "end": 4144.0, "text": "Freedom, brauchst erstmal 20 Assault Rifles daheim für mehr Freiheit."}, {"id": 581, "start": 4144.0, "end": 4152.0, "text": "Ja ist es auch und ich glaube das AR15 ist quasi die Zivile Variante davon."}, {"id": 582, "start": 4152.0, "end": 4163.0, "text": "Aber juckt mich auch nicht weiter."}, {"id": 583, "start": 4163.0, "end": 4178.0, "text": "Das ist ein M16, aha."}, {"id": 584, "start": 4178.0, "end": 4191.0, "text": "Leute, ich bin so im Arsch heute, das ist der Wahnsinn."}, {"id": 585, "start": 4191.0, "end": 4195.0, "text": "Gibt es noch irgendwelche spannenden Themen oder muss ich einschlafen?"}, {"id": 586, "start": 4195.0, "end": 4204.0, "text": "Also heute ist wirklich der schlimmste bzw. größte in den Seilen hängen Stream aller"}, {"id": 587, "start": 4204.0, "end": 4205.0, "text": "Zeiten."}, {"id": 588, "start": 4205.0, "end": 4211.0, "text": "Eigentlich ist Bedge, Bedge ist erst in 30 Minuten."}, {"id": 589, "start": 4211.0, "end": 4215.0, "text": "Was ist das?"}, {"id": 590, "start": 4215.0, "end": 4216.0, "text": "Was?"}, {"id": 591, "start": 4216.0, "end": 4222.0, "text": "If you support free software, you should support gun rights."}, {"id": 592, "start": 4222.0, "end": 4223.0, "text": "What?"}, {"id": 593, "start": 4223.0, "end": 4233.0, "text": "Was hat das, ich will mir das jetzt nicht anhören ehrlich gesagt, aber nur mal so vom Überschrift."}, {"id": 594, "start": 4233.0, "end": 4239.0, "text": "Was hat das eine jetzt so genau mit dem anderen zu tun?"}, {"id": 595, "start": 4239.0, "end": 4249.0, "text": "Das ist Chibate, oder?"}, {"id": 596, "start": 4249.0, "end": 4254.0, "text": "Kein Chibate?"}, {"id": 597, "start": 4254.0, "end": 4260.0, "text": "Naja vielleicht hat er ja da irgendwie eine sinnvolle Begründung für, keine Ahnung."}, {"id": 598, "start": 4260.0, "end": 4264.0, "text": "Ich sehe den Zusammenhang jetzt nicht so wirklich ab."}, {"id": 599, "start": 4264.0, "end": 4275.0, "text": "Man kann ja seine Meinung haben."}, {"id": 600, "start": 4275.0, "end": 4281.0, "text": "Ja ich weiß bei den Amis ist es halt viel so, die sagen, also eines der Hauptargumente"}, {"id": 601, "start": 4281.0, "end": 4289.0, "text": "bei den Amis ist ja, ich brauche eine Waffe, weil wenn jemand mit einer Waffe vor mir steht,"}, {"id": 602, "start": 4289.0, "end": 4294.0, "text": "muss ich mich ja mit meiner Waffe gegen seine Waffe verteidigen können."}, {"id": 603, "start": 4294.0, "end": 4301.0, "text": "Das ist für die halt Freedom, dass du mit dem Assault Rifle draußen rumlaufen kannst."}, {"id": 604, "start": 4301.0, "end": 4305.0, "text": "Ich glaube wir können das schlecht nachvollziehen ehrlich gesagt hier."}, {"id": 605, "start": 4305.0, "end": 4311.0, "text": "Bei uns ist es halt schon, ja ich weiß gar nicht seit wann, schon immer, dass du keine"}, {"id": 606, "start": 4311.0, "end": 4313.0, "text": "Assault Rifle daheim haben darfst."}, {"id": 607, "start": 4313.0, "end": 4325.0, "text": "Die Amis sehen das halt irgendwie anders."}, {"id": 608, "start": 4325.0, "end": 4327.0, "text": "Freedom."}, {"id": 609, "start": 4327.0, "end": 4331.0, "text": "Kokona."}, {"id": 610, "start": 4331.0, "end": 4337.0, "text": "Mehr Freedom einfach nur."}, {"id": 611, "start": 4337.0, "end": 4350.0, "text": "Und wo wir gerade bei Freedom sind."}, {"id": 612, "start": 4350.0, "end": 4354.0, "text": "Das ist aber kein original, kein richtig gutes BBQ Pitball Video."}, {"id": 613, "start": 4354.0, "end": 4362.0, "text": "Ich brauche das mit dem richtig echten Kokona Intro."}, {"id": 614, "start": 4362.0, "end": 4370.0, "text": "Genau."}, {"id": 615, "start": 4370.0, "end": 4383.0, "text": "Also mehr Kokona geht nicht als dieser Channel."}, {"id": 616, "start": 4383.0, "end": 4389.0, "text": "Ich glaube der Vergleich ist gar nicht so verkehrt."}, {"id": 617, "start": 4389.0, "end": 4394.0, "text": "Wenn bei uns einer sagt Tempolimits sind alle am schreien und wenn bei den Amos, bei den"}, {"id": 618, "start": 4394.0, "end": 4400.0, "text": "Amos ja, wenn bei den Amis einer sagt keine Ammo mehr und keine Guns, dann sind auch viele"}, {"id": 619, "start": 4400.0, "end": 4410.0, "text": "am schreien."}, {"id": 620, "start": 4410.0, "end": 4413.0, "text": "Ich guckte nicht regelmäßig, keine Ahnung."}, {"id": 621, "start": 4413.0, "end": 4418.0, "text": "Ich dachte erst als ich die Überschrift gesehen habe, das Video ist debate, aber mein"}, {"id": 622, "start": 4418.0, "end": 4419.0, "text": "Video ist debate."}, {"id": 623, "start": 4419.0, "end": 4422.0, "text": "Man sieht das in den USA halt anders."}, {"id": 624, "start": 4422.0, "end": 4427.0, "text": "Control your Windows PC with Home Assistant."}, {"id": 625, "start": 4427.0, "end": 4431.0, "text": "Braucht mein Windows PC nicht mit Home Assistant Kontrollen."}, {"id": 626, "start": 4431.0, "end": 4434.0, "text": "Ich habe Maus und Tastatur an meinem Windows PC."}, {"id": 627, "start": 4434.0, "end": 4436.0, "text": "Das Kontrollt sich mit Maus und Tastatur besser."}, {"id": 628, "start": 4436.0, "end": 4452.0, "text": "Ich wusste halt beim Zahnarzt so eine komische Chlorlösung oder was das war zum Desinfizieren."}, {"id": 629, "start": 4452.0, "end": 4456.0, "text": "Eine Minute im Mund hin und her machen wegen Corona."}, {"id": 630, "start": 4456.0, "end": 4461.0, "text": "Das schmeckt immer noch richtig nach wie Schwimmbad."}, {"id": 631, "start": 4461.0, "end": 4466.0, "text": "Ich habe immer noch diesen Schwimmbad Geschmack im Mund."}, {"id": 632, "start": 4466.0, "end": 4484.0, "text": "Schwimmbad Wasser Geschmack."}, {"id": 633, "start": 4484.0, "end": 4493.0, "text": "Das weiß ich, dass er 6 Euro ist, ich habe doch zwei Stück bestellt."}, {"id": 634, "start": 4493.0, "end": 4497.0, "text": "Ich refresche YouTube jetzt so lange bis etwas interessantes kommt."}, {"id": 635, "start": 4497.0, "end": 4498.0, "text": "Mal gucken wie lange das dauert."}, {"id": 636, "start": 4498.0, "end": 4519.0, "text": "Scheinlich zu klappen."}, {"id": 637, "start": 4519.0, "end": 4533.0, "text": "Funktioniert nicht."}, {"id": 638, "start": 4533.0, "end": 4541.0, "text": "Okay jetzt ist vorbei."}, {"id": 639, "start": 4541.0, "end": 4544.0, "text": "Ich kriege meine eigenen Videos jetzt vorgeschlagen."}, {"id": 640, "start": 4544.0, "end": 4549.0, "text": "Da weiß ich, ich bin am Ende vom Internet angekommen."}, {"id": 641, "start": 4549.0, "end": 4550.0, "text": "Hier ist das Internet vorbei."}, {"id": 642, "start": 4550.0, "end": 4553.0, "text": "Ich bin wieder bei mir gelandet."}, {"id": 643, "start": 4553.0, "end": 4554.0, "text": "Norddeutsch."}, {"id": 644, "start": 4554.0, "end": 4555.0, "text": "Ja das kenne ich schon."}, {"id": 645, "start": 4555.0, "end": 4557.0, "text": "Das haben wir sogar mal im Stream."}, {"id": 646, "start": 4557.0, "end": 4569.0, "text": "Ja das haben wir schon mal zusammen geguckt."}, {"id": 647, "start": 4569.0, "end": 4571.0, "text": "Kann diese Waffe mich schützen?"}, {"id": 648, "start": 4571.0, "end": 4580.0, "text": "Ja wahrscheinlich nicht wirklich."}, {"id": 649, "start": 4580.0, "end": 4583.0, "text": "Hi Leute wir müssen noch eine halbe Stunde schwätzen."}, {"id": 650, "start": 4583.0, "end": 4587.0, "text": "Sagt mal gibt es irgendwas spannendes noch?"}, {"id": 651, "start": 4587.0, "end": 4591.0, "text": "Wie sieht es eigentlich aus?"}, {"id": 652, "start": 4591.0, "end": 4594.0, "text": "Abschlussprüfung ist durch alles schon oder?"}, {"id": 653, "start": 4594.0, "end": 4596.0, "text": "Physi technisch."}, {"id": 654, "start": 4596.0, "end": 4597.0, "text": "Wobei nee."}, {"id": 655, "start": 4597.0, "end": 4599.0, "text": "Ich hatte meine im August glaube ich."}, {"id": 656, "start": 4599.0, "end": 4601.0, "text": "Das kommt jetzt noch."}, {"id": 657, "start": 4601.0, "end": 4602.0, "text": "Physi Abschlussprüfung oder?"}, {"id": 658, "start": 4602.0, "end": 4605.0, "text": "Die kommen doch jetzt noch."}, {"id": 659, "start": 4605.0, "end": 4612.0, "text": "C++."}, {"id": 660, "start": 4612.0, "end": 4623.0, "text": "Wait a minute."}, {"id": 661, "start": 4623.0, "end": 4626.0, "text": "What the fuck?"}, {"id": 662, "start": 4626.0, "end": 4631.0, "text": "Was hat das mit C++ zu tun?"}, {"id": 663, "start": 4631.0, "end": 4634.0, "text": "Irgendwelche komischen Meme Videos, die gucken wir jetzt nicht an."}, {"id": 664, "start": 4634.0, "end": 4636.0, "text": "War das nicht letzten Monat?"}, {"id": 665, "start": 4636.0, "end": 4643.0, "text": "Also ich bilde mir ein, ich hatte meine Abschlussprüfung im August."}, {"id": 666, "start": 4643.0, "end": 4645.0, "text": "Nee da bin ich wahrscheinlich zu boomer für."}, {"id": 667, "start": 4645.0, "end": 4646.0, "text": "Dann erklärts mir mal."}, {"id": 668, "start": 4646.0, "end": 4647.0, "text": "Was gibt es da?"}, {"id": 669, "start": 4647.0, "end": 4649.0, "text": "Was gibt es da dran zu verstehen?"}, {"id": 670, "start": 4649.0, "end": 4658.0, "text": "Okay ich verstehe."}, {"id": 671, "start": 4658.0, "end": 4659.0, "text": "Leute ich verstehe."}, {"id": 672, "start": 4659.0, "end": 4665.0, "text": "Ich muss die Zoomer Generation besser verstehen."}, {"id": 673, "start": 4665.0, "end": 4675.0, "text": "Okay es ist ein 1 Minute 33 Video mit Memes und Bildschirmtext und Giga Chat."}, {"id": 674, "start": 4675.0, "end": 4682.0, "text": "Das ist für alle mit keiner Aufmerksamkeitsspanne oder?"}, {"id": 675, "start": 4682.0, "end": 4689.0, "text": "Weil es wird äußerst schnell geschnitten und es passiert laufend irgendwas."}, {"id": 676, "start": 4689.0, "end": 4695.0, "text": "Es kann mir doch keiner erzählen, dass das jemand gelesen hat in dieser Zeit oder?"}, {"id": 677, "start": 4695.0, "end": 4697.0, "text": "Das hat doch im Leben keiner gelesen."}, {"id": 678, "start": 4697.0, "end": 4713.0, "text": "Okay ich gebe zu."}, {"id": 679, "start": 4713.0, "end": 4716.0, "text": "Dafür bin ich zu boomer."}, {"id": 680, "start": 4716.0, "end": 4728.0, "text": "Aber ich finde das gar nicht schlimm in dem Fall."}, {"id": 681, "start": 4728.0, "end": 4733.0, "text": "Das ist quasi eine Meme Collection wenn ich das richtig verstehe."}, {"id": 682, "start": 4733.0, "end": 4746.0, "text": "Das ist quasi eine Meme Collection im vorgespult quasi."}, {"id": 683, "start": 4746.0, "end": 4748.0, "text": "Also es gibt Dinge die verstehe ich."}, {"id": 684, "start": 4748.0, "end": 4750.0, "text": "Wahrscheinlich werde ich die nie verstehen."}, {"id": 685, "start": 4750.0, "end": 4751.0, "text": "Aber gut."}, {"id": 686, "start": 4751.0, "end": 4759.0, "text": "Ich benutze auch kein TikTok was wahrscheinlich der Grund ist warum ich es nicht verstehe."}, {"id": 687, "start": 4759.0, "end": 4765.0, "text": "Es ist wieder Zeit sich boober zu fühlen stimmts?"}, {"id": 688, "start": 4765.0, "end": 4773.0, "text": "Denken sich jetzt alle hier."}, {"id": 689, "start": 4773.0, "end": 4777.0, "text": "Memereviews wann?"}, {"id": 690, "start": 4777.0, "end": 4782.0, "text": "Moment man kann Memes reviewen?"}, {"id": 691, "start": 4782.0, "end": 4791.0, "text": "Na gut ich mein man kann auch was weiß ich Unge reactet auf Inscope 21."}, {"id": 692, "start": 4791.0, "end": 4799.0, "text": "Wo Nico reactet auf den und dann reactet er auf den und den kann man zugucken wie sie reacten."}, {"id": 693, "start": 4799.0, "end": 4803.0, "text": "Also mittlerweile ist ja Reaction Videos komplettes Inception."}, {"id": 694, "start": 4803.0, "end": 4811.0, "text": "Du hast mittlerweile in Reaction Videos teilweise 4 Webcams von 4 unterschiedliche Leuten die sich überlagern."}, {"id": 695, "start": 4811.0, "end": 4820.0, "text": "Und dann zum Abschluss guckt nochmal der Ursprungs Reactor sich die Reactions der anderen Leute auf seine Reaction an."}, {"id": 696, "start": 4820.0, "end": 4826.0, "text": "Der ist dann mit seiner Webcam so über seiner eigenen Webcam und dann drunter nochmal 5 andere Webcams."}, {"id": 697, "start": 4826.0, "end": 4832.0, "text": "Also ganz ehrlich Reaction Videos sind komplett aus der Kontrolle geraten mittlerweile."}, {"id": 698, "start": 4832.0, "end": 4847.0, "text": "Ich müsste auch mal wieder reacten."}, {"id": 699, "start": 4847.0, "end": 4854.0, "text": "Das ist auch jemand ich hör diesen Namen in letzter Zeit öfters und ich habe keinen Plastenschimmer wer das ist."}, {"id": 700, "start": 4854.0, "end": 4862.0, "text": "Ich will aber auch nicht danach suchen."}, {"id": 701, "start": 4862.0, "end": 4866.0, "text": "Wie viel Subscriber hat Pewdiepie eigentlich?"}, {"id": 702, "start": 4866.0, "end": 4869.0, "text": "Mittlerweile."}, {"id": 703, "start": 4869.0, "end": 4876.0, "text": "Es ist ja glaube ich nicht mehr der größte Channel oder?"}, {"id": 704, "start": 4876.0, "end": 4884.0, "text": "111 Millionen näher der hat mehr als mein Gartenstells Videos views hat."}, {"id": 705, "start": 4884.0, "end": 4890.0, "text": "Ritter Ross Danke für den Sub."}, {"id": 706, "start": 4890.0, "end": 4901.0, "text": "Der größte Channel also ich kann mich ja noch dran erinnern dass ihn irgendeinen irgendein indischer Musik Channel überholt hat mal vor 2 Jahren oder so."}, {"id": 707, "start": 4901.0, "end": 4907.0, "text": "Ich weiß nicht ob MrBeast schon größer ist. Was hat denn MrBeast mittlerweile für Subs?"}, {"id": 708, "start": 4907.0, "end": 4910.0, "text": "He serious war das genau."}, {"id": 709, "start": 4910.0, "end": 4921.0, "text": "Der hat ihn noch nicht überholt aber der wird ihn wahrscheinlich bald überholen."}, {"id": 710, "start": 4921.0, "end": 4926.0, "text": "Leute ihr könnt übrigens ist mir letztens wieder bei jemand auf der Arbeit aufgefallen."}, {"id": 711, "start": 4926.0, "end": 4934.0, "text": "Ihr könnt froh sein dass ich überhaupt Zoomer genug bin dass ich weiß wie man Memes richtig ausspricht."}, {"id": 712, "start": 4934.0, "end": 4938.0, "text": "Letztens auf der Arbeit wieder jemand was von Memes erzählt."}, {"id": 713, "start": 4938.0, "end": 4941.0, "text": "Noch schlimmer ist Memes."}, {"id": 714, "start": 4941.0, "end": 4950.0, "text": "Memes von Memes hat letztens einer was erzählt."}, {"id": 715, "start": 4950.0, "end": 4960.0, "text": "Memes Memes"}, {"id": 716, "start": 4960.0, "end": 4968.0, "text": "Das ist aber schon richtig richtig boomer mit Bart."}, {"id": 717, "start": 4968.0, "end": 4979.0, "text": "Also ich bin tatsächlich muss ich jetzt mal ehrlich was was Internet Trends angeht und YouTube und Livestreams und sowas."}, {"id": 718, "start": 4979.0, "end": 4983.0, "text": "Bin ich wahrscheinlich der größte Zoomer bei uns auf der Arbeit."}, {"id": 719, "start": 4983.0, "end": 4991.0, "text": "Obwohl ich nicht der jüngste auf der Arbeit bin."}, {"id": 720, "start": 4991.0, "end": 4994.0, "text": "Die haben alle gar keine Ahnung von."}, {"id": 721, "start": 4994.0, "end": 5000.0, "text": "Ist nicht so was man von großartig Ahnung haben muss ja."}, {"id": 722, "start": 5000.0, "end": 5007.0, "text": "Ich habe heute aus Versehen POC gesagt auf unserer Weekly Wartungsarbeiten Runde."}, {"id": 723, "start": 5007.0, "end": 5011.0, "text": "Gab keinerlei Reaktion."}, {"id": 724, "start": 5011.0, "end": 5017.0, "text": "Ich habe was vorgestellt auf der Runde also Wartungsarbeiten von uns."}, {"id": 725, "start": 5017.0, "end": 5021.0, "text": "Und danach mute ich mich normalerweise immer."}, {"id": 726, "start": 5021.0, "end": 5030.0, "text": "Und ich habe mich auch gemuted aber ich wusste es kommt in zwei Punkten noch mal Wartungsarbeiten von uns dran zu denen ich was sagen muss."}, {"id": 727, "start": 5030.0, "end": 5035.0, "text": "Und da habe ich mich aus irgendwelchen Gründen schon etwas früher entmuted."}, {"id": 728, "start": 5035.0, "end": 5043.0, "text": "Bevor ich dran war weil unser Ober Change Manager noch irgendwelche anderen Themen besprechen musste."}, {"id": 729, "start": 5043.0, "end": 5049.0, "text": "Und da habe ich doch allen Ernstes bei nebenbei im Teams was geschrieben."}, {"id": 730, "start": 5049.0, "end": 5054.0, "text": "Und irgendwie überkam es mich dann so und ich habe gesagt POC."}, {"id": 731, "start": 5054.0, "end": 5059.0, "text": "Wobei ich nicht POC gesagt habe ich habe eher gesagt POG."}, {"id": 732, "start": 5059.0, "end": 5062.0, "text": "Es gab keine Reaktion die haben einfach weiter geredet."}, {"id": 733, "start": 5062.0, "end": 5068.0, "text": "Es hat keiner richtig realisiert und ich glaube es gibt nicht befremdliches Schweigen."}, {"id": 734, "start": 5068.0, "end": 5075.0, "text": "Es gab keine Reaktion drauf die haben ja sich über andere Sachen unterhalten ja."}, {"id": 735, "start": 5075.0, "end": 5082.0, "text": "Und ich habe da ganz normal den Change vorgestellt."}, {"id": 736, "start": 5082.0, "end": 5085.0, "text": "Bist du auch immer so schockiert dass die Jugend keine Disketten mehr kennen?"}, {"id": 737, "start": 5085.0, "end": 5088.0, "text": "Das glaube ich nicht die Jugend kennt Disketten."}, {"id": 738, "start": 5088.0, "end": 5095.0, "text": "Die kennen Disketten aus irgendwelchen Meme Videos oder diesem komischen YouTube Channel."}, {"id": 739, "start": 5095.0, "end": 5098.0, "text": "Der die Star Wars Musik auf Floppies gespielt hat."}, {"id": 740, "start": 5098.0, "end": 5106.0, "text": "Die wissen aber nicht mehr wie man Disketten richtig verwendet wahrscheinlich."}, {"id": 741, "start": 5106.0, "end": 5110.0, "text": "So nach dem Motto mit diesem Read-Write Schalter oben links."}, {"id": 742, "start": 5110.0, "end": 5113.0, "text": "Was oben links?"}, {"id": 743, "start": 5113.0, "end": 5119.0, "text": "Die haben immer drauf geguckt weil man es oben rechts rumgedreht hat."}, {"id": 744, "start": 5119.0, "end": 5122.0, "text": "Diesen Read-Write Schalter."}, {"id": 745, "start": 5122.0, "end": 5125.0, "text": "Wahrscheinlich wissen die auch nicht wie rum eine Diskette reinsteckt."}, {"id": 746, "start": 5125.0, "end": 5131.0, "text": "Auf der anderen Seite glaube ich Disketten gehen nur in eine Richtung rein wenn ich mich recht erinnere."}, {"id": 747, "start": 5131.0, "end": 5137.0, "text": "Ansonsten gut für die Jugend von heute eigentlich dass die mit Disketten das alles gar nicht mehr mitbekommen haben."}, {"id": 748, "start": 5137.0, "end": 5144.0, "text": "Weil ganz ehrlich Disketten war ein richtiges kack Speichermedium."}, {"id": 749, "start": 5144.0, "end": 5152.0, "text": "Das waren quasi wenn du so willst Videotapes in rund."}, {"id": 750, "start": 5152.0, "end": 5157.0, "text": "Also in eckig mit rund drinnen."}, {"id": 751, "start": 5157.0, "end": 5162.0, "text": "Nee Disketten ist wirklich rotz gewesen."}, {"id": 752, "start": 5162.0, "end": 5169.0, "text": "104 1,44 MB ja davor die waren ja nur 720 Kilo Byte."}, {"id": 753, "start": 5169.0, "end": 5172.0, "text": "Es gab ja doch diese Schwabbel Disketten."}, {"id": 754, "start": 5172.0, "end": 5176.0, "text": "Ihr kennt ja vielleicht teilweise auch diese 5,25 Zoll Disketten."}, {"id": 755, "start": 5176.0, "end": 5179.0, "text": "Diese richtig großen Schwabbel Dinger."}, {"id": 756, "start": 5179.0, "end": 5191.0, "text": "Hier die Pepo Fat Disks."}, {"id": 757, "start": 5191.0, "end": 5200.0, "text": "Die Schwabbel Disketten."}, {"id": 758, "start": 5200.0, "end": 5204.0, "text": "Mach alles mit Loch Kardia ist richtig so."}, {"id": 759, "start": 5204.0, "end": 5211.0, "text": "Ich hoffe die bohrst du auch selbst."}, {"id": 760, "start": 5211.0, "end": 5214.0, "text": "Ich hab es auf der Arbeit schon mal geschafft wo wir gerade bei Internetsprache sind."}, {"id": 761, "start": 5214.0, "end": 5222.0, "text": "Ich hab es auf der Arbeit schon mal geschafft in einer Umfrage das Wort Poggers zu platzieren."}, {"id": 762, "start": 5222.0, "end": 5225.0, "text": "Als Antwort."}, {"id": 763, "start": 5225.0, "end": 5228.0, "text": "Und es wurde sogar darauf reagiert."}, {"id": 764, "start": 5228.0, "end": 5235.0, "text": "Also es gab es gibt vielleicht kennt ihr das manche Leute machen das wenn die Präsentationen halten."}, {"id": 765, "start": 5235.0, "end": 5239.0, "text": "Dann machen die mit so Umfragetools manchmal so kleine Umfragen."}, {"id": 766, "start": 5239.0, "end": 5247.0, "text": "Man kennt das so nach dem Motto ja mal Frage in die Menge."}, {"id": 767, "start": 5247.0, "end": 5251.0, "text": "Wer hat Produkt xy oder Sache xy schon gemacht."}, {"id": 768, "start": 5251.0, "end": 5256.0, "text": "Und dann können die Leute dann ihre Hand heben oder halt wenn es eine Präsentation ist über Teams."}, {"id": 769, "start": 5256.0, "end": 5259.0, "text": "Können die Leute dann halt in irgendeinem Abstimmungsding klicken."}, {"id": 770, "start": 5259.0, "end": 5264.0, "text": "Und da war bei uns irgendwie die Frage ja was denkt ihr zum Thema Cloud."}, {"id": 771, "start": 5264.0, "end": 5267.0, "text": "Und da habe ich als Antwort halt reingeschrieben Poggers."}, {"id": 772, "start": 5267.0, "end": 5274.0, "text": "Und das hat er sogar vorgelesen so aha ich sehe hier steht Poggers."}, {"id": 773, "start": 5274.0, "end": 5283.0, "text": "Also ich etabliere ich etabliere langsam schleichend Twitch und Zoomer Sprache auf der Arbeit."}, {"id": 774, "start": 5283.0, "end": 5290.0, "text": "Obwohl ich ja selber absolut kein Zoomer mehr bin."}, {"id": 775, "start": 5290.0, "end": 5295.0, "text": "Da warte ich noch drauf mit dem Meeting Gatschi was."}, {"id": 776, "start": 5295.0, "end": 5301.0, "text": "Stell euch mal vor irgendjemand erzählt ja ich habe euch jetzt die neue Hardware eingebaut."}, {"id": 777, "start": 5301.0, "end": 5307.0, "text": "Und ich würde einfach nur antworten Gatschi Bass nice."}, {"id": 778, "start": 5307.0, "end": 5314.0, "text": "Hast du die auch so richtig ins Rack rein gedonnert Gatschi Bass Gatschi Roll."}, {"id": 779, "start": 5314.0, "end": 5326.0, "text": "Und dann ist die Antwort drauf ja Hyper Gatschi."}, {"id": 780, "start": 5326.0, "end": 5339.0, "text": "Ob es noch jemand gibt der das verwendet."}, {"id": 781, "start": 5339.0, "end": 5341.0, "text": "Ich habe gar keine Disketten mehr im Keller."}, {"id": 782, "start": 5341.0, "end": 5347.0, "text": "Das älteste Leute wisst ihr was der älteste Datenträger ist den ich hier habe."}, {"id": 783, "start": 5347.0, "end": 5359.0, "text": "Vermutlich vermutlich eine Game Star CD von 1997."}, {"id": 784, "start": 5359.0, "end": 5371.0, "text": "Keine Ahnung ob die noch geht aber wahrscheinlich warum sollte die nicht mehr gehen."}, {"id": 785, "start": 5371.0, "end": 5373.0, "text": "Die habe ich alle nicht mehr."}, {"id": 786, "start": 5373.0, "end": 5377.0, "text": "Ich habe mein Game Boy Cloud Boy beim Umzug verloren."}, {"id": 787, "start": 5377.0, "end": 5383.0, "text": "Weiß nicht wo der ist."}, {"id": 788, "start": 5383.0, "end": 5386.0, "text": "Die sieht das letzte Mal die sieht eigentlich noch ganz okay aus."}, {"id": 789, "start": 5386.0, "end": 5390.0, "text": "Ist ja keine selbstgebrannte CD."}, {"id": 790, "start": 5390.0, "end": 5392.0, "text": "Hast du früher auch Computer Bild."}, {"id": 791, "start": 5392.0, "end": 5397.0, "text": "Nein Computer Bild Spiele habe ich nie geholt."}, {"id": 792, "start": 5397.0, "end": 5403.0, "text": "Ich kann ich ich kannte jemand ich habe mit jemandem gespielt damals täglich der bei Computer Bild Spiel."}, {"id": 793, "start": 5403.0, "end": 5407.0, "text": "Ach nee sorry falsch nicht Computer Bild Spiele."}, {"id": 794, "start": 5407.0, "end": 5410.0, "text": "Der hat bei der Bravo Screen Fun gearbeitet."}, {"id": 795, "start": 5410.0, "end": 5415.0, "text": "Kennt dieses Ding überhaupt noch jemand."}, {"id": 796, "start": 5415.0, "end": 5420.0, "text": "Und ja mit dem habe ich damals MMO gespielt."}, {"id": 797, "start": 5420.0, "end": 5424.0, "text": "Und irgendwie hat man sich dann aus den Augen verloren."}, {"id": 798, "start": 5424.0, "end": 5427.0, "text": "Keine Ahnung was er heute treibt."}, {"id": 799, "start": 5427.0, "end": 5430.0, "text": "Aber nee ich dachte es wäre Computer Bild Spiele gewesen."}, {"id": 800, "start": 5430.0, "end": 5440.0, "text": "Es war Bravo Screen Fun."}, {"id": 801, "start": 5440.0, "end": 5442.0, "text": "Nein mache ich auch nicht."}, {"id": 802, "start": 5442.0, "end": 5447.0, "text": "Ich habe doch gesagt ihr könnt so viel Umfrage machen wie ihr wollt."}, {"id": 803, "start": 5447.0, "end": 5452.0, "text": "Auch wenn ich glaube die Umfrage zur Bahn hat 96% gewonnen."}, {"id": 804, "start": 5452.0, "end": 5455.0, "text": "Also dass Max sich bei der Bahn bewerben soll."}, {"id": 805, "start": 5455.0, "end": 5457.0, "text": "Aber wie gesagt ich werde das nicht machen."}, {"id": 806, "start": 5457.0, "end": 5460.0, "text": "Ich bin nicht verpflichtet Umfragen zu folgen."}, {"id": 807, "start": 5460.0, "end": 5470.0, "text": "Ich habe es euch auch von Anfang an gesagt dass ich das nicht machen werde."}, {"id": 808, "start": 5470.0, "end": 5471.0, "text": "Du musst keine Umfrage vorschlagen."}, {"id": 809, "start": 5471.0, "end": 5482.0, "text": "Wir haben doch gestern die Umfrage oder vorgestern die Umfrage gemacht."}, {"id": 810, "start": 5482.0, "end": 5483.0, "text": "Wie viele Milchschnitten."}, {"id": 811, "start": 5483.0, "end": 5485.0, "text": "Wie groß musste die Milchschnitten Packung sein."}, {"id": 812, "start": 5485.0, "end": 5487.0, "text": "Dass da eine CD reingepasst hat."}, {"id": 813, "start": 5487.0, "end": 5490.0, "text": "Das muss doch mindestens ein 10er Pack gewesen sein."}, {"id": 814, "start": 5490.0, "end": 5493.0, "text": "Oder ein großer Packung dass da eine CD reinpasst."}, {"id": 815, "start": 5493.0, "end": 5502.0, "text": "Also in eine einzelne Milchschnitte passt ja offensichtlich keine rein."}, {"id": 816, "start": 5502.0, "end": 5504.0, "text": "Doch Go haben wir auch schon mal gemacht."}, {"id": 817, "start": 5504.0, "end": 5513.0, "text": "Aber das ist eine gute Idee."}, {"id": 818, "start": 5513.0, "end": 5519.0, "text": "Wir haben schon mal ein bisschen Go gemacht."}, {"id": 819, "start": 5519.0, "end": 5522.0, "text": "I will enjoy."}, {"id": 820, "start": 5522.0, "end": 5524.0, "text": "Doch wir haben schon mal ein bisschen Go gemacht."}, {"id": 821, "start": 5524.0, "end": 5533.0, "text": "Und zwar ich weiß nicht ob das Go im Titel hatte."}, {"id": 822, "start": 5533.0, "end": 5553.0, "text": "Aber das hier war in Go."}, {"id": 823, "start": 5553.0, "end": 5570.0, "text": "Dieser Stream ist nicht immer schief deswegen passt das nicht."}, {"id": 824, "start": 5570.0, "end": 5572.0, "text": "Guck Go siehst du es hier oben."}, {"id": 825, "start": 5572.0, "end": 5576.0, "text": "Wir haben da mal was in Go gemacht."}, {"id": 826, "start": 5576.0, "end": 5580.0, "text": "Hier ist der Beweis."}, {"id": 827, "start": 5580.0, "end": 5588.0, "text": "Aber nichts großartiges."}, {"id": 828, "start": 5588.0, "end": 5589.0, "text": "Bewerbung bei der Telekom."}, {"id": 829, "start": 5589.0, "end": 5593.0, "text": "Ja zur Telekom würde ich sogar theoretisch gehen wenn es ein guter Job ist."}, {"id": 830, "start": 5593.0, "end": 5600.0, "text": "Aber zur Bahn würde ich nicht gehen."}, {"id": 831, "start": 5600.0, "end": 5604.0, "text": "Wenn ich die bei der Bahn anschreibe."}, {"id": 832, "start": 5604.0, "end": 5606.0, "text": "Das Archiv das musst du den Sirius Max fragen."}, {"id": 833, "start": 5606.0, "end": 5607.0, "text": "Das habe ich nicht gemacht."}, {"id": 834, "start": 5607.0, "end": 5609.0, "text": "Das hat er gemacht."}, {"id": 835, "start": 5609.0, "end": 5616.0, "text": "Aber das beste im Archiv ist eindeutig die Farbselection."}, {"id": 836, "start": 5616.0, "end": 5620.0, "text": "Und vor allem das Ayaya-Theme ist natürlich das was eigentlich jeder."}, {"id": 837, "start": 5620.0, "end": 5622.0, "text": "Das müsste eigentlich Default sein."}, {"id": 838, "start": 5622.0, "end": 5626.0, "text": "Nee mach nicht Default das schreckt die Leute ab."}, {"id": 839, "start": 5626.0, "end": 5642.0, "text": "Aber eigentlich müsste es Default sein."}, {"id": 840, "start": 5642.0, "end": 5644.0, "text": "Ja ich habe die teilweise schon heftig angegangen auf Twitter."}, {"id": 841, "start": 5644.0, "end": 5648.0, "text": "Aber ich bin wenigstens immer so nett und schreibe dabei."}, {"id": 842, "start": 5648.0, "end": 5653.0, "text": "Dass ich nicht die Leute persönlich meine die hier hinter dem Twitter-Account sitzen."}, {"id": 843, "start": 5653.0, "end": 5656.0, "text": "Sondern die Bahn als Ganzes."}, {"id": 844, "start": 5656.0, "end": 5660.0, "text": "Nee wir haben in Frankfurt keinen Autohersteller."}, {"id": 845, "start": 5660.0, "end": 5665.0, "text": "Wie gesagt Fiber soll sehr Pock sein."}, {"id": 846, "start": 5665.0, "end": 5668.0, "text": "Hast du immer bei der Bank gearbeitet oder auch mal woanders?"}, {"id": 847, "start": 5668.0, "end": 5672.0, "text": "Nein davor habe ich bei einem Provider gearbeitet."}, {"id": 848, "start": 5672.0, "end": 5680.0, "text": "Und ich bin dann 2012 zur Bank gewechselt."}, {"id": 849, "start": 5680.0, "end": 5681.0, "text": "Da bin ich jetzt."}, {"id": 850, "start": 5681.0, "end": 5683.0, "text": "Das ist ja mal ein 10-jähriges Jubiläum."}, {"id": 851, "start": 5683.0, "end": 5689.0, "text": "Aber wenn die so weitermachen würde ich das wahrscheinlich nicht mehr erleben."}, {"id": 852, "start": 5689.0, "end": 5691.0, "text": "Ja stimmt es gab Mini-CDs."}, {"id": 853, "start": 5691.0, "end": 5692.0, "text": "Du hast recht."}, {"id": 854, "start": 5692.0, "end": 5693.0, "text": "Ja du hast recht es gab kleine CDs."}, {"id": 855, "start": 5693.0, "end": 5695.0, "text": "Habe ich ganz vergessen."}, {"id": 856, "start": 5695.0, "end": 5701.0, "text": "Die CD-Laufwerke von damals hatten für diese Mini-CDs sogar einen extra Einschub."}, {"id": 857, "start": 5701.0, "end": 5707.0, "text": "Also wer sich immer schon mal gefragt hat warum CD-Laufwerke in der Mitte noch mal so eine kleinere Vertiefung haben."}, {"id": 858, "start": 5707.0, "end": 5712.0, "text": "Das ist genau dafür für so Mini-CDs."}, {"id": 859, "start": 5712.0, "end": 5725.0, "text": "Weiß nicht was auf so Mini-CDs draufgepasst hat 100 MB oder so."}, {"id": 860, "start": 5725.0, "end": 5731.0, "text": "Da gibt es ja immer einen regelrechten Glaubenskrieg was Go Frameworks angeht."}, {"id": 861, "start": 5731.0, "end": 5735.0, "text": "Und das viele sagen Standard Lip Only."}, {"id": 862, "start": 5735.0, "end": 5748.0, "text": "Der Gamecube hatte kleine CDs aber die waren glaube ich einen Ticken größer als diese Mini-CDs."}, {"id": 863, "start": 5748.0, "end": 5750.0, "text": "Oder Mini-DVDs."}, {"id": 864, "start": 5750.0, "end": 5756.0, "text": "Ja Nintendo musste da wieder extra Wurst machen."}, {"id": 865, "start": 5756.0, "end": 5759.0, "text": "Habt ihr denn alle schon mal ein Video von heute gesehen?"}, {"id": 866, "start": 5759.0, "end": 5765.0, "text": "Und nein wir machen jetzt kein Max guckt sein eigenes Video und recycelt Content."}, {"id": 867, "start": 5765.0, "end": 5771.0, "text": "Also ich gehe jetzt gleich auf falls ihr noch mein aktuelles Video nicht geschaut habt."}, {"id": 868, "start": 5771.0, "end": 5772.0, "text": "Ich habe heute eins hochgeladen."}, {"id": 869, "start": 5772.0, "end": 5776.0, "text": "Man weiß ja nie ob man das bei YouTube mitbekommt wenn jemand was hochlädt."}, {"id": 870, "start": 5776.0, "end": 5778.0, "text": "Wie findet ihr eigentlich das Thumbnail?"}, {"id": 871, "start": 5778.0, "end": 5781.0, "text": "Ich finde das ist echt ganz gut geworden."}, {"id": 872, "start": 5781.0, "end": 5786.0, "text": "Der Sweaty Gamer."}, {"id": 873, "start": 5786.0, "end": 5789.0, "text": "Link in den Chat."}, {"id": 874, "start": 5789.0, "end": 5795.0, "text": "Ok hier."}, {"id": 875, "start": 5795.0, "end": 5798.0, "text": "Beauty of Unix Porn."}, {"id": 876, "start": 5798.0, "end": 5802.0, "text": "Unix Porn ist ein Subreddit wo die Leute ihren Tiling Window Manager posten."}, {"id": 877, "start": 5802.0, "end": 5804.0, "text": "Ansonsten postet da keiner was."}, {"id": 878, "start": 5804.0, "end": 5808.0, "text": "90% Unix Porn ist E3."}, {"id": 879, "start": 5808.0, "end": 5811.0, "text": "Und nein es hat nichts mit Porn zu tun."}, {"id": 880, "start": 5811.0, "end": 5824.0, "text": "Es geht um visuellen Porn wie Leute ihren Linux Desktop tunen."}, {"id": 881, "start": 5824.0, "end": 5828.0, "text": "Ich dachte erst das ist ein Game."}, {"id": 882, "start": 5828.0, "end": 5836.0, "text": "Das ist kein Game das ist irgendwie Yoshi Achterbahn."}, {"id": 883, "start": 5836.0, "end": 5850.0, "text": "Das ist einfach nur es fährt da rum."}, {"id": 884, "start": 5850.0, "end": 5865.0, "text": "Es hat eine LXDE Konfig gepostet."}, {"id": 885, "start": 5865.0, "end": 5876.0, "text": "Was ist denn da los da stimmt was nicht."}, {"id": 886, "start": 5876.0, "end": 5879.0, "text": "Ja weil ich auch gerade nach Japan fahre oder wo das ist."}, {"id": 887, "start": 5879.0, "end": 5882.0, "text": "Um mich dann in die Yoshi Achterbahn zu setzen."}, {"id": 888, "start": 5882.0, "end": 5886.0, "text": "Wahrscheinlich passe ich in die Yoshi Achterbahn gar nicht rein."}, {"id": 889, "start": 5886.0, "end": 5892.0, "text": "Weil das für japanische Größen optimiert ist."}, {"id": 890, "start": 5892.0, "end": 5900.0, "text": "Aber ja."}, {"id": 891, "start": 5900.0, "end": 5902.0, "text": "Gut."}, {"id": 892, "start": 5932.0, "end": 5955.2, "text": "Das sind immer so Videos, die sind irgendwie so meditativ, wenn man die sich anguckt."}, {"id": 893, "start": 5955.2, "end": 5965.0, "text": "Das hat irgendwie was Beruhigendes, kann das nicht beschreiben, so was kann ich mir auch wunderbar zum Einschlafen angucken."}, {"id": 894, "start": 5965.0, "end": 5973.2, "text": "Das ist quasi ASMR ohne ASMR zu sein. So Zeitraffer-Videos."}, {"id": 895, "start": 5973.2, "end": 5988.6, "text": "Oh nein, wir gucken uns das jetzt nicht 13 Minuten an. Ich mach gleich aus. Aber ich fände das super einschläfernd meditativ so was zu gucken."}, {"id": 896, "start": 6003.8, "end": 6010.4, "text": "Was hat er sonst noch? Pineapple. Der Boomer ist schon müde, es ist 22 Uhr."}, {"id": 897, "start": 6010.4, "end": 6036.8, "text": "Oh, gleich fällt es um. Tiltet. Und wie das fällt doch jetzt, bam."}, {"id": 898, "start": 6036.8, "end": 6046.8, "text": "Okay Leute, ich gebe zu, das war heute der Pepo-Bedge-Stream schlechthin."}, {"id": 899, "start": 6046.8, "end": 6052.4, "text": "Ich bin einfach nur angekommen, ohne irgendwas überlegt zu haben im Vorfeld."}, {"id": 900, "start": 6052.4, "end": 6058.4, "text": "Aber ich dachte mir, ich mache mal besser streamen an, sonst penne ich gleich ein. Kann ich mit euch noch eine Runde schwätzen vorher."}, {"id": 901, "start": 6058.4, "end": 6076.0, "text": "Schön, dass ihr trotzdem da gewesen seid. Und ich gehe jetzt erstmal mal umloggen auf meinen anderen Account und gucke, wie die View-Statistiken aussehen für das aktuelle Video, weil die waren relativ gut vorhin."}, {"id": 902, "start": 6076.0, "end": 6089.6, "text": "Du willst morgen deinem 56-jährigen Kollegen beibringen, Bedge zu sagen? Ja, ich finde, Bedge ist auch besser als mit Pock oder sowas anzufangen."}, {"id": 903, "start": 6089.6, "end": 6108.8, "text": "Ich finde, Bedge ist etwas, das sollte jeder in seinen Standard-Wortschatz aufnehmen. Ja, unbedingt."}, {"id": 904, "start": 6108.8, "end": 6122.8, "text": "Alles klar Leute, wir sehen uns bis denn. See you!"}]}