{"text": "Moin Leute, oh moin ist gut, ist egal es geht immer. Hat jemand von euch schon mal einen Raspberry Pi mit QEMO auf dem Desktop emuliert? Oder es muss doch nicht mal ein Raspberry Pi sein in irgendeiner Armkiste. Ich wollte nur wissen, ob das normal ist, dass das so extremst abfahrklangsam ist. Das ist nicht einfach nur langsam, also das ist wirklich unnutzbar langsam, selbst wenn man Zeit hat. Das kann man komplett vergessen. Ich hab mir überlegt, ob ich nicht mit QEMO irgendwas cross-compile für Arm, aber das ist ja unendlich langsam. Der Small Access Point ist auch da Moin, da sind sie alle, Pogu, HiIQ Chat wieder am Start oder der Giga-Chat, der Giga-Chat ist am Start, der Giga-Chat-Chat. So Leute, wir gucken uns heute mal Amazon Prime an, aber ich wette mit euch, es gibt nur Müll. Das war die letzte Prime-Day, die letzten Cyber-Week-Mondays-Special-Sales und so war alles Müll. Ganz viel billig China-Chinesen-Kram und Zeug, was kein Mensch braucht und einfach nur sinnlos. Ich denke mal, so ist es jetzt auch, Leute ich hab ein Problem, ich weiß ich bin jetzt gerade im Stream-On gekommen, aber ich muss nochmal aufs Klo, das hab ich vergessen vorher. Ich hab angemacht, bevor ich noch aufs Klo komme, Leute ich muss mal kurz aufs Klo. Ich hab angemacht, bevor ich noch aufs Klo komme, Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute Das war's für heute. Vielen Dank für's Zuschauen. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Die служte die Magde Hand auf für ein bisschen. Das war's für heute. Vielen Dank für's Zuschauen. Das war's für heute. Okay Leute, das war nötig. Oh, jetzt kann's losgehen. Komm mal hier, what the fuck, ich bin auf dem Klo und es gibt hier die mega Subscrip- a-Subscrip-kri-bierungs-Aktion. Äh, Betai Golds hat 10 Subs gegiftet. Dankeschön. Wer hat denn Glück gehabt? Zeigt mal her. Äh, Dankudrix kriegt was. ShockOps Gaming. Mochi Xp- Den hab ich letztens schon öfters mal gesehen. Der Name, der kommt mir irgendwie bekannt vor. Der hat letztens ziemlich viel im Stream rumgespammt. Mochi hab ich auch schon mal gesehen. Jesu- Jesutz- Chris- Christutz hat was gekriegt. Nora Love Pancakes, die hab ich auch schon mal gesehen. Ähm, Matt Weil sagt mir auch was. Den anderen bin ich- Phippsen könnt ich auch mal gesehen haben, schon. Ich bin jetzt nicht so sicher. Was sagst du zum Amazon Firetap? Ja, ich find's nicht schlecht. Also es ist für ein ultra, ultra, ultra low-end Tablet ganz okay. Naja, wenn du kein Gerät mit Google Play willst, dann willst du wahrscheinlich auch kein Gerät mit Google App Store, äh, mit Amazon App Store drauf. Das beste, was du machen kannst mit den Firetablets ist, die Dinger, ich weiß nicht, ob man die aktuell noch flashen kann. Da bin ich mir nicht so sicher. Aber du kannst sie auf jeden Fall deploaten mit der Amazon Fire Toolbox. Und dann kannst du dann auch APK sideloaden und so was. Also, ganz im Ernst, ich finde das Firetablet ist zwar ein richtig preisleistungsmäßig gutes Tablet für low, low, low-end, aber zum täglichen Arbeiten, oder was heißt Arbeiten, zum täglichen Benutzen. Ich weiß nicht, zumal das Display jetzt zum Video schauen auch nicht so wahnsinnig geiles. Also ich hab hier selbst mehrere Firetablets, aber die hab ich nicht interaktiv im Einsatz. Die hab ich oben und unten im Flur hängen als Home Automation Dashboards. Dafür sind sie gut. Die machen aber auch nichts anderes, als ein Firefox offen haben den ganzen Tag. Und mit der Kamera erkenne ich, ob einer da vorsteht. Da gibt es glücklicherweise für Android bessere Automatisierungsmöglichkeiten als iPads. Hol dir doch ein neues iPad, so teuer sind die Dinger doch gar nicht. Was kostet ein neues iPad, 400 Euro? Ich mein, dafür hast du wenigstens auch was mit Wumms. Oder 300? Ich würd mir einfach ein neues iPad, ganz normales holen. Kein eher, kein sonst was, einfach ganz normales iPad. Guck mal hier, zeig mal was kostender Kram. Nee, nee, die sind nicht teuer. Die iPads sind, finde ich generell, Tablets kann Android nicht mithalten. Smartphones kann man sich drüber streiten, aber bei Tablets, ja hier 379 oder so, war ich doch mit 400 Euro gar nicht. Gut, die Minis gibt's doch, wobei die sind noch billiger, äh, noch teurer. Nee, kostet gerade 79, also ich finde ganz ehrlich, und dann hast du wenigstens auch was mit Wumms, das hast du die nächsten Jahre über und das die nächsten Jahre auch noch schnell. Ja, die zeigen Firefox an. Also ich sehe nur Firefox, die zeigen mein Home Automation Dashboard, also mein Home Assistant Dashboard an. Im Fullscreen, die gehen aus nach ein paar Minuten und ich hab, ich kann euch alleine nicht sagen, wie das heißt. Ähm, ich hab da so eine App drauf, die erkennt, wenn man davor steht, über die Kamera. Ich bin mir, ich bin mir nicht mehr sicher, wie das Ding hieß. Es kann auch sein, dass das in diesem Kiosk-Browser, den ich mal installiert hab, dabei war, wobei ich, wie gesagt, Firefox jetzt, im Fullscreen hab. Ähm, ich weiß nicht mehr, wie das Ding hieß. Zumindest ist das eine App, die checkt halt den Kamerainput und wenn man davor steht, schaltet das Tablet, macht das Display an und entsperrt sich. Das geht aber alles nur in der Android. Also generell, das ist der Vorteil von Android, wenn du so Automatisierungs-Sachen machen willst, ist es einfach viel, viel besser als unter iOS. Apple erlaubt halt vieles nicht. Dafür, ja, ist es halt auch für jeden eine Hinz- und Kunst zu benutzen. Ja, die sind mit Sicherheit günstiger. Die ganzen, also, das ist eh eines der wenigen Sachen, die sich je, bei jedem... Guck mal. Was sich bei jedem Prime day lohnt, ist... Wait a minute. Muss man sich dafür einloggen? Nee, oder? Angucken kann man sich's auch so. Weil ich hab meinen Login jetzt nicht hier. Für Amazon. Okay, angucken kann man sich auch... Es wäre ja auch blöd, wenn du dir das nicht angucken kannst. Wenn du... Weil die wollen den Leuten ja irgendwie dazu verleihen. Guck mal, hier hast du die Dinger. Das sind doch die ganzen Tablets. Fire HD 10. Das ist teurer geworden. Warte mal, ich muss mal kurz bei mir aufs Handy... Wo ist mein Handy? Hä, wo ist mein Handy? Oh, das hab ich aufm Klo vergessen. Ich bin gleich wieder da. Okay, cool. So, klassisch Handy-Klovergel. Klar, kennt ihr das nicht. Ich vergess öfters mein Handy aufm Klo. So, ich guck jetzt nämlich mal kurz bei Amazon, für wie viel ich das mir vor ein paar Jahren gekauft hab. Das ist natürlich andere Generation. Aber macht ja nichts. Mal kurz gucken, wie sich da die Preise entwickelt haben. Fire. Fire HD 8, Fire HD 10 hab ich gekauft. Zwei Stück. Order Details. Damals haben die gekostet... Oh, das ist günstiger geworden. Damals hab ich... Ach, Moment. Zwei Stück für 99. Ach nee, jeweils. 99 Euro haben die damals noch gekostet. Und jetzt kostet es mal Prime 79. Das ist tatsächlich ganz okay. Also, wenn man sowas haben möchte, wie gesagt, als Tablet zum täglichen Benutzen, finde ich es jetzt persönlich nicht so, dass man so ein Tablet zum täglichen Benutzen finde ich es jetzt persönlich nicht so geil. Aber wenn man beispielsweise ein Dashboard braucht oder man sich ein... Ich-Bilder-Rahmen-Wünscht in der Richtung zum Sachen anzeigen oder so. Also, für so... nicht... viel mit dem Finger drauf rumgetatschte interaktive Sachen sind die Dinger gut. Weil das ist eben Android drunter. Und Android kannst du einfach deutlich besser automatisieren und Dinger mitmachen als iOS. Ja, deswegen. Dafür kann man es empfehlen. Ansonsten... Ich weiß nicht. Nee, ansonsten nicht. Externe Platten. Ja, ich könnte tatsächlich... Jetzt gucken wir. Gucken wir gleich mal. Ich könnte auch wirklich noch eine externe Platte gebrauchen. Richtig fette externe Platte könnte ich gebrauchen. Pepo. Fett. Platte. Ja, aber da will ich mal ein bisschen Smart Home gucken. Und ich brauche auf jeden Fall noch... Da muss ich nämlich gleich... Das müssen wir gleich mal hier. Prime Day. Vielleicht gibt es da einen. Kützig. Ich meine, wer weiß, wie knapp das Gas wird im Winter. Na, so zwei Radiatoren schaden da nicht, wenn man mal welche hat. Aber das ist alles Crap. Die will man nicht haben. Ich will so einen klassischen Öl-Radiator haben. Nur falls es wirklich im Winter mit Gas nichts wird. Ich muss euch jetzt mal ehrlich sagen. Dieses Rumgemache mit Hilfe im Winter wird es kalt und so. Also, es gibt da zwei Sachen, die sich so... Ich weiß, die widersprechen sich. Die widersprechen sich. Aber zwei Sachen, die mir da so durch den Kopf rumschweren. Das erste ist, es wurde ja noch von nicht allzu langer Zeit öfters demonstriert. So nach dem Motto, Energie sparen und auch beim Kalten daheim sitzen. Ich meine, okay, so haben sich die Leute wahrscheinlich nicht vorgestellt. Und das zweite ist, ich finde es ein absolutes... Also, wenn das wirklich dazu kommt, dass Leute ihre Häuser nicht heizen können in Deutschland, dann... Es wird wahrscheinlich keine Konsequenzen haben. Aber das ist ein komplettes Versagen auf ganzer Ebene. Ich meine, überlegt euch mal. Es gibt außer drei weitere Länder auf der ganzen Welt. Drei weitere Länder auf der ganzen Welt haben mehr Geld als wir. Wie kann es sein, dass wir ernsthaft Probleme bekommen, dass wir als viertreichtes Land der Welt im Winter eventuell frieren müssen? The fuck? Da stimmt doch irgendwas nicht. Also, das ist echt auf ganzer Linie verschissen, Alter. Das kann nicht sein. Einfach Winterjacke anziehen. Ja, aber ich habe eh keine Probleme im Winter mit Temperaturen. Weil ich habe die Klimaanlage hier im Arbeitszimmer. Die kann auch heizen, drüben im Schlafzimmer. Die Klimaanlage, ich habe genug Heizlüfter. Ich habe mir letztens noch einen Heizlüfter gekauft. Also, ich habe da keine Probleme mit. Aber ich weiß ja auch nicht, da kenne ich mich tatsächlich zu wenig aus. Wenn wir wirklich Probleme kriegen, was Gas und sowas angeht. Ob wir da nicht vielleicht auch Probleme mit Stromversorgung bekommen? Keine Ahnung. Prime Sub, Prime Day, excellent. Das dürfte wahrscheinlich das Beste am ganzen Prime Days sein. Aber das kann echt nicht sein. Es kann wirklich nicht sein, dass wir als viertreiches Land uns ernsthaft Gedanken machen sollen, ob wir frieren. Und ich denke sogar, dass man das gar nicht so sehr auf eine Sache zeigen kann. Ich gehe einfach davon aus, dass die letzten 16 oder 20 Jahre über ganz viele Dinge verkackt wurden, dass es jetzt am Ende unterm Strich zu sowas kommt. Sicherlich hat vielleicht die aktuelle Regierung auch was zu beigetragen, aber ich denke mal, dass die da gar nicht mal so viel Einfluss drauf hatten. Aber trotzdem, es ist mir ehrlich gesagt scheißegal, wer dran schuld ist. Es ist mir vollkommen egal. Ich will, dass es im Winter warm ist. Aber da hat wahrscheinlich jeder andere Ansicht, woran das jetzt liegt. Letztendlich, ich sage euch ganz ehrlich, mir ist es scheißegal, ich will, dass es im Winter warm ist. Und es kann nicht sein, dass wir als viertreiches Land der Welt uns wirklich Gedanken machen müssen, ob Leute frieren im Winter. Das ist genau das, was ich mir auch denke. Mir ist es scheißegal, macht euren Job, wofür ihr da seid. Das, was ich auch jeden Tag mache, wo ich 40 plus Prozent davon abgeben muss. Also macht halt was Gescheites damit. Das Video mit den letzten Encrypt-Zertifikaten hat super geholfen. DNS-Rebindschutz und DNS-Rewrite waren noch zwei Dinge, die notwendig waren. Warst du der mit dem Power-DNS? Nee, du warst jemand anderes, oder? Ich komme manchmal ein bisschen durcheinander bei den ganzen Fragen in den Streams. Du warst nicht der mit dem Power-DNS, oder? Nee, du hast nach dem Let's Encrypt-Wort gefragt. Das schon gesehen. Ich muss das mal am zweiten Bildschirm aufmachen, weil ich immer nicht weiß, was dahinter steckt. Ja, das verfolge ich schon ganz lange. Die hatten letztens einen Playtest. Haben die das jetzt wirklich released? Ich verfolge das schon seit Jahren im Discord, den BF3-Reality-Mod. Haben die das jetzt released? Dann muss ich mir das tatsächlich mal anschauen. Das letzte Mal habe ich nämlich gesehen, dass die für Influencers einen internen Playtest hatten. Ich habe mir schon überlegt, ob ich mich anmelden soll. Das müssen wir uns tatsächlich mal angucken. Was ist deine Meinung zu Red Hat Enterprise Linux? Meinst du jetzt zur Distribution? Oder ob man sich das kaufen sollte? Weil die Distribution ist im Enterprise-Umfeld eigentlich das mit das beliebteste. Aber kaufen, nein, weil viel zu teuer. Du kannst aber Nachbauten verwenden. Früher war CentOS, jetzt ist es Rocky Linux. Aber das ist leider nicht mehr das, was es mal vor ein paar Jahren war, weil Red Hat da keinen Bock mehr drauf hat. Es war eine super Alternative. Ansonsten, ganz ehrlich, ich persönlich würde es nicht verwenden. Wenn ich eines der größeren Enterprise-Distributionen verwenden will, dann würde ich Ubuntu. Da ist ja meistens wichtig, dass es Support gibt und Updates und LTS-Garantien. Dann würde ich irgendeinen Ubuntu-LTS nehmen. Ja, Red Hat hat, glaube ich, längeren Support. Ich glaube, Red Hat hat 10 Jahre oder so ab Release. Ubuntu hat LTS plus 5 Jahre. Aber ganz im Ernst, du willst kein 10 Jahre als Linux verwenden, auch wenn es 10 Jahre supportet wird. By the way, ratet mal, was wir auf der Arbeit intern auf ganz viele Linux-Server verwenden, so auf ca. 2000 Stück. Da kommt ihr nie drauf, weil ich gerade gesagt habe, man sollte ein Linux keine 10 Jahre verwenden. Aber wir verwenden CentOS 7 an vielen Stellen noch. Ein CentOS 7, das aktuelle CentOS. Ein CentOS 4 haben wir tatsächlich auch noch, habe ich letztens gefunden. Das ist irgendein so uralt wahren Wirtschaftssystem, was ausgeschaltet ist und nur 2-mal im Jahr eingeschaltet werden muss. Das ist ein CentOS 4 von 2008 oder so. CentOS 8 ist nicht verfügbar, ja, das haben sie abgeblasen. Aber CentOS 7 wird bis zum End of Life supported. Wobei ich sagen muss, das System, was wir haben mit CentOS 4, ist eigentlich ein CentOS 5, was sich als CentOS 4 ausgibt. Wer das nicht versteht, macht nichts. Ich verstehe das auch nicht so genau, aber es ist so. Ja, stimmt, ich erinnere mich wieder. FEDORA Ne, Fedora, ganz ehrlich ich mag eigentlich so gut wie keine RPM basierte Distributionen. Ja ey, wir fahren auf der Arbeit CentOS. Ich kenne mich damit gut, das macht eigentlich keinen Unterschied. Linux ist Linux. Ob du da jetzt ein Ab drauf hast, ein Pacman drauf hast oder ein Yam-DNF drauf hast, das ist eigentlich ziemlich egal. Richtig, so ist es, historisch gewachsen. So, also, wir gucken jetzt mal ein bisschen bei Amazon rein. Also Radiatoren gibt es nicht, habe ich schon gesehen. Es gibt Ventile, die, warum auch immer, Ventile sind und da verkauft werden. Wir schauen mal und zwar, also, wir gucken mal nach externen Festplatten, das wird mich tatsächlich interessieren und jetzt wo wir gerade dabei sind, BF3 Reality Mod, haben die das jetzt released? Ach tatsächlich, haben sie es jetzt geschafft? Ich verfolge die seit Jahren schon im Discord. Das hat übrigens nichts mit Battlefield 2 Reality Mod zu tun, das sind andere Leute. Ja, ich werde es mir auf jeden Fall angucken. Ich kann mir nicht vorstellen, dass Battlefield 3 so auf Superrealismus richtig gut funktioniert, aber ich gucke es mir an. Du hast heute einen Ausbildungsvertrag unterschrieben. Ach nee, das mit dem Heute war eins unten drunter. Ausbildungsvertrag unterschrieben, 1057 Euro erstes Ausbildungsjahr ist wild, ich kann es überhaupt nicht beurteilen, ob das wild ist. Das stimmt aber auf jeden Fall nicht schlecht. Ich überlege nämlich gerade, was ich im ersten Ausbildungsjahr bekommen habe, es war auf jeden Fall nicht so viel, das kann ich dir sagen, aber bei mir ist das ja auch schon etwas länger her. Ich glaube, ich habe 600 Euro oder irgendwie sowas gekriegt im ersten Ausbildungsjahr. Du kannst nur hoffen, dass du nach der Ausbildung dann, also, dass es dann nicht nur minimal steigt nach der Ausbildung, dann freust du dich jetzt und nach der Ausbildung kommen sie an, ja, also Frau Kali, sie sind doch bestimmt mit 1300 Euro im Monat zufrieden und dann sagst du dann, naja, gut, nee, dann gehe ich woanders hin, sind was sind eigentlich drei? Ehe woanders hin, ja, dann ist egal. Ganz viele Leute haben sich anscheinend ein Tablet bestellt, war schon Thema hier gerade vor ein paar Minuten. Gibt es eine Playlist, ja? Relaxing and calming music from Super Mario Series, die lauter können wir schon noch machen, weil ist eigentlich laut genug, das ist bloß der eine Track, der so langsam ist, also ich habe mir überlegt, ob ich verkürze, stand ja bei mir damals auch zur Diskussion, ich habe absichtlich gesagt, ich verkürze meine Ausbildung nicht und wisst ihr warum? Weil ich einfach nur ultra faul bin und ich wollte noch ein bisschen Däumchen drehen in der Berufsschule und nichts machen. Geld hat mir damals schon gereicht, wie gesagt, ihr kennt mich, ich gebe ja nichts aus, deswegen ist gut, dass ich trotz beschissener Stonks Kurse dieses Jahr endlich mal angefangen habe, mein Geld sinnvoll zu investieren, weil es liegt einfach nur rum und das ist ja noch schlechter. Ich wollte einfach noch ein Jahr länger faul sein, deswegen habe ich meine Ausbildung nicht verkürzt. Du hast eine zweite Grafikkarte, das kriegst du mit deinem Ausbildungsgeld hin, da musst du ja auch nicht verkürzen, aber ehrlich gesagt, das mit dem verkürzen oder nicht, ist Geschmackssache und hängt auch, finde ich, ganz entscheidend dran, wie der Ausbildungsbetrieb so ist, also ob man da wirklich was lernt, wenn man da nämlich wirklich was lernt, ist es vielleicht gar nicht so schlecht, das dritte Jahr zu machen, wenn man da aber nur seine Zeit absitzt, ist eh egal. Alles in Bitcoin, klar, hudel, macht da bup, Kekkel, Alter, ok, es ist aber nicht mal ultra viel weiter runter gegangen, seitdem ich das letzte Mal geguckt habe, da war das schon so hier. Serverzentrum ist unter der Erde, dass das Rechenzentrum im Keller ist, ist relativ häufig so. Hab ich euch eigentlich schon mal, bevor wir jetzt Amazon gucken, hab ich euch eigentlich schon die Story erzählt, warum wir in der alten Firma das Rechenzentrum im, äh, ich das jetzt misst erzählen, im siebten Stock, nee, nee, nee, nicht in der Wohnung, nein, nein, nein, nicht in der Wohnung, nein, das meine ich nicht, das weiß ich nicht, äh, warum wir in der alten Firma das Rechenzentrum im siebten Stock hatten, vom, äh, ich rede nicht von der Wohnung, das war, also normalerweise würde man ja sagen, ja was macht denn das Rechenzentrum im siebten Stock, das ist ja total unsinnig, und das hat auch immer wieder Probleme gemacht, weil jedes Mal, wenn dort neue Storage-Systeme reingestellt werden sollten, mussten sie irgendein Architektenbüro finden, was die Statik schön rechnet, dass man das noch reinstellen darf, zwischenzeitlich haben sie sogar den Boden verstärkt, dort wo Storage-Systeme standen, ganz im Ernst, wenn das Storage-System durch die Decke bricht, und da sitzt einer drunter, ich glaube, also platt ist gar nicht mehr der richtige Ausdruck für, ich glaube der pulverisiert, komplett, stellt euch mal vor, es fällt euch ein mehrere Tonnen schweres desintegriert, ja, es stellt euch mal vor, es fällt euch ein mehrere Tonnen schweres Storage-System von zweieinhalb oder von drei Meter Höhe auf den Kopf, also du bist wahrscheinlich noch nicht mal Matsch, du bist so in Teile, dass man dich überhaupt nicht mehr zuordnen kann, was du mal gewesen bist, Helm, der rätte dich bestimmt, so zumindest auf dem kleinen C, ja, wir hatten mal bei einem Rechenzentrum Umzug, einem, dem ist ein fetter Server auf dem Fuß gefallen, so richtig schön mit der Kante vom Metallgehäuse, MonkaS, alter, zumindest, das hat richtig Probleme gemacht mit dem Storage, und jetzt ist natürlich die Frage, warum war das Rechenzentrum nicht im Keller, und im Keller war Platz, im Keller war nämlich ein Mini-Mini-Mini-Rechenzentrum, in der Abstellkammer mit einem Rack drin, das war letztendlich für die Hausverkabelung, aber warum war das nicht im Keller, man hätte es super im Keller machen können, und die Antwort ist, es war nicht im Keller, weil, es kann sein, dass ich euch das schon erzählt habe, es war nicht im Keller, weil Leute vom Vorstand ihren Parkplatz nicht räumen wollten, die haben gesagt, ich bin im Vorstand, ich bin wichtig und ich brauche in der Garage einen Parkplatz, und das Rechenzentrum kann da nicht hin, und dann haben die lieber das Rechenzentrum im siebten Stock immer wieder architektenmäßig schön rechnen lassen, anstatt sich woanders hinzustellen mit ihrem Auto, relatable, jaja, und deswegen war das Rechenzentrum im siebten Stock, das ist auch eines der größten PP-Ger-Entscheidungen, die ich da managmenttechnisch je gesehen habe, ja, das wäre wahrscheinlich weniger aufwendig gewesen, man hätte einen Lift gebaut, das im siebten Stock das Parkhaus wäre, so, aber jetzt kommen wir zur Runde Amazon an, also, schauen wir mal, wie es aussieht mit externen Festplatten, wo der Unterschied ist, ähm, wait a minute, nee, ich hab grad gedacht, du spammst Reflink, aber das ist nicht so, äh, wo ist der Unterschied, bleibt mal her, äh, ich seh keinen Unterschied, fühlt mir alles gleich aus, ach nee, Fire HD 10 Tablet, ja, das ist, das ist general überholt, das ist gebraucht, das ist gebraucht, das ist achter, das eine ist mit Amazon, und das eine ist ohne Amazon-Krempel, ach nee, das ist ein Plus, und das andere ist ein, nee, das ist auch general überholt, steht auch da, nee, das da, das ist mit Spezialangeboten, und das ist ohne Spezialangebote, das eine ist, bei mir steht da nix mit 39 und 37, ach, das hier, Special Offers, mit Spezial, dann hab ich keine Ahnung, was der Unterschied ist, ähm, wahrscheinlich gar nix, wahrscheinlich ist gar kein Unterschied, weil es wieder Amazon Pepega Time angesagt, nee, das ist general überholt, das ist general überholt, und das hier ist neu, das eine ist general überholt und das andere neu, ich mein, warum man für zwei Euro sich general überholtes holen soll, keine Ahnung, weiß wahrscheinlich nur Amazon, dann würd ich mir immer Neues holen, Omega Lul, ja, aber richtig, Hyper Omega Poggers Lul, oder kappalul.com, wie meine neue Domain, so sagt. Also gucken wir mal externe Festpläne, also Prime Day, okay, obligatorisch, obligatorisch gucken, ob's günstige SSDs gibt, ich brauch keine SSDs, aber SSDs lohnen sich beim Prime Day eigentlich fast immer, wobei man sich natürlich vom Prime Day nicht gebaten lassen darf, nehmen wir mal zum Beispiel die hier, das dürfte so eines der, also diese Crucial MX500 und BX500, das ist ja sau beliebte SSDs, Amazon gebated gerne, ich könnte wetten, Evo, Moment, müssen wir mal gucken, Prime Day, Evo 870, sind die nicht schon bei 970, kostet 2TB, 455, so, jetzt schauen wir mal, begeits halt, weil Amazon gebated ja gerne, Evo 2TB, okay, das ist tatsächlich ganz gut, das ist nicht schlecht, das ist, das würde ich sagen, kann man sich dann tatsächlich mal geben, das finde ich okay, ja, da sage ich jetzt gar nichts gegen, 155 Euro versus hier 193, okay, das ist doch in Ordnung, ja, was kostet denn die 970, okay, ne, die ist ein bisschen teurer, ein bisschen ist gut 100 Euro teurer, so, also Prime Day, die obligatorische Sache nach SSDs, wie gesagt, ich brauche keine SSDs, ich habe genug SSDs aktuell da, aber SSDs ist ja eine Sache, die man normalerweise nie genug haben kann, die Dinge habe ich ausprobiert, da habe ich zwei Stück schon, von diesen Sandisk Extreme Portables, die finde ich fragwürdig, weil die verbrauchen mehr Strom als USB laut Spezifikation liefern kann, was dazu führt, dass die an manchen Systemen unstabil an Stable sind, das sollte nicht der Fall sein, ist es aber leider, und wer die Dinge an einem Raspberry Pi betreiben will, kann es komplett vergessen, weil der Raspberry Pi noch nicht mal maximale USB Spannung liefern kann, ich glaube der Raspberry Pi kann maximal 1,5 Ampere, ne 0,7, ich kann es nicht, ne, warte mal, was kannst du über USB machen, 1,5 und der Raspberry Pi kann plus 0,7, ich bin mir jetzt ehrlich gesagt aus dem Kopf nicht ganz sicher, zumindest liefert der Raspberry Pi nicht das, was maximal möglich wäre und dementsprechend kannst du es knicken, vor allem, wenn du zusätzlich am USB Port noch was anderes betreiben wolltest, ich hatte ja mal einen Raspberry Pi im Einsatz, mit USB TV Tuner und USB SSD, kannst du komplett, aber wirklich komplett vergessen, das System fliegt dir laufend um die Ohren, weil die Platten weg, weg fliegen und read only gehen und alles, weil zu wenig Strom, ja mit einem extra Hub das geht, mit dem aktiven Hub funktioniert das, doch aktiver Hub funktioniert, warum soll das nicht funktionieren, ich hab selbst einen aktiven Hub dran gehabt, das funktioniert besser, aber auch nicht wirklich gut, zumal du dann massig Kabelsalat hast, wozu du eigentlich gerade einen Raspberry Pi holst, dass du das nicht hast, doch ich hab das mit dem Hub, Hub war gar kein Problem, ich hatte so einen billig Anker USB Hub, so einen China-Chinesen, kann man hier USB Hub mal gucken, ob es hier gerade fürs Ding gibt, ja das ist er, das ist er, wobei ob das der ist, weiß ich nicht, die sehen alle so aus, so einen in der Richtung hab ich als USB Hub, aber ne das kann ja nicht sein, weil das nicht mit Stromanschluss ist, dann weiß ichs auch nicht, kann man mit dem aktiven Hub auch den Raspberry Pi betreiben, ja, du kannst theoretisch den Raspberry Pi an den Hub stecken und dann dort den Raspberry Pi noch an USB, das funktioniert, also kannst du machen, ja, aber dann hast du das Problem, dass der Hub auch irgendwann zu wenig Strom liefert, weil der Hub hat ja auch bloß maximal irgendwie, was ist das, 5V, 2A und der Raspberry Pi braucht ja standardmäßig schon wirklich Limit was USB hergibt, also deswegen, als offizielle Raspberry Pi Netzteile hat glaube ich 5,1V mit 3A und das machen die meisten USB Dinger gar nicht, du brauchst das nicht, du brauchst das wirklich in absoluten Spitzenlastzeiten, die 15 Watt, die der Raspberry Pi 4 verbraucht, aber trotzdem, es hat schon seinen Sinn, dass die ein eigenes Netzteil dabei haben, also USB Geräte am Pi und den Pi selber über den aktiven USB Hub betreiben, also wenn du willst, dass dein System öfters mal abkackt und die Festplatte read-only geht, weil es Probleme gibt, dann kannst du das machen, ich würde es aber auf jeden Fall nicht empfehlen, kaputt gehen kann da nichts, weil du kannst Daten verlieren, ja, aber hardware-technisch kann da nichts kaputt gehen, aber es ist halt unstabil, es, fuck, das will man nicht machen. Warum ist diese Platte eigentlich noch so wahnsinnig beliebt, da gibt es auch mittlerweile bessere Alternativen, oder? Das Ding ist so der Evergreen seit den letzten 5 Jahren, diese MX500-Series, ist Lexa, China-Chinesen-Zeug? Also, SSDs, weiß nicht, ich hab genug SSDs, wir gucken gerade mal, externe Festplatte, oder externe SSD, externe SSD ist bescheuert, ich brauch Speicherplatz, ich brauch Pepofet-Speicherplatz, 5TB zu wenig, 12TB könnte man vielleicht nochmal drüber reden, das ist aber teurer als eine 12TB normale Platte, oder? Das ist eigentlich nicht so, nicht so nice, gucken wir mal, gucken wir mal, HDD im Zweifels kann sie noch, 2TB, wisst ihr, warum kann man den Kram, also die Suche bei Amazon ist wirklich sehr pepega, oder, warum kann ich die Festplatten jetzt bitte schön nicht nach Größe sortieren? Manchmal geht das, manchmal geht das nicht, also manchmal kannst du sortieren, manchmal Computer und Electronics, warum kann ich die Festplatten nicht sortieren, nach Größe mann Amazon, was ist das denn schon wieder? Aber das sieht alles nicht so aus, als würde sich das groß, also das ist ganz schön, ich glaube 8TB für 190 ist glaube ich echt nicht günstig, schauen wir mal kurz Geizhals, aber ich glaube das ist nicht, nicht, oben rechts sort by, die Sachen mit Größe filtern wir meistens über das linke, aber das funktioniert dann auch nicht so, ganz ehrlich Amazon Suche ist einfach abfack, der einzige Grund warum der Amazon so viel verkauft ist, weil ihre Empfehlungen ganz gut sind, so Festplatten, HDD, TB3, ah Thunderbolt, Harddisk, SATA, 3 pro Terabyte, guck mal hier, also du kriegst hier, gucken wir mal, gucken wir mal die 8er, ne nicht bis 8, ab 8, ja ok, das geht tatsächlich, wobei ich mir keine 8er mehr reinhauen würde, ach Moment ich muss nach preis, nicht nach preis pro, na gut in dem Fall ist es eigentlich, wait a minute, das ist teurer bei Amazon, wie das, ja dann ist ppega, dann lohnt sich das überhaupt nicht, ne, gibt es 18TB, wenn es 18TB gibt günstig, dann wird das gekauft, no pass, wie groß, wie groß, 18TB, das ist doch bestimmt so, warum keine 8TB mehr, weil preisleistungsmäßig, ok das stimmt nicht, ich glaube preisleistungsmäßig sind 8TB relativ gut aktuell, aber du bekommst halt für etwas, sag mal vielleicht nicht ganz so gut preisleistungsmäßig, bekommst du aber halt schon 12, 14TB plus, mit nicht so viel mehr preis pro Terabyte und ich finde es einfach besser, anstatt 2 Platten reinzustecken, lieber eine große reinzustecken, generell großes reinstecken, gachi bass ist immer nicht verkehrt. Du hast dir ein paar, ja also wenn das preisleistungsmäßig für dich das beste ist, kannst du machen, also ich persönlich würde mir keine 8TB Platten mehr reinschieben, so, also da ist glaube ich nichts dabei, wir lassen uns mal kurz inspirieren von den Amazon Empfehlungen, ja das Problem ist, du kannst das alles machen und das ist vielleicht performanstechnisch auch gar nicht schlecht, falls du da irgendwie drauf auf Magnetplatten Performance schielst, aber du musst dich dann halt um den ZFS kümmern, du musst dir dann überlegen, ok, was mache ich denn jetzt am besten für den Raid Level, dann musst du dir da Zeug zurechtlegen, gucken dass du 10% Platz reservierst, weil es ZFS ist und bei einer Platte ist es halt überhaupt kein Problem, du machst eine Platte, spiegelst die einmal nachts und wenn was davon verreckt ist egal, holst dir eine neue Platte und Ruhe, nachdem ich eh SSD Cache dazwischen hab, juckt mich gar nicht mehr, ob die Platte irgendwie jetzt lahm ist, 2TB SSD Cache, ich könnte nochmal ein zweites, 2TB dazustecken und fertig, ist gut, dass ich mir diese Erweiterungskarte gekauft hab für den SSD Cache, 18TB sind SMR oder CMR, ich weiß es nicht, aber es muss ja immer dabei stehen, mein Cache ist nur Read, nö, das ist der SSD, die ist Read und Write, naja, du brauchst eine SSD und du brauchst eine Platte wo du es letztendlich drauf schreibst, weil ansonsten würdest du direkt auf die SSD schreiben, das bleibt drauf, dann wäre es ja kein SSD Cache, wenn ich übers Netzwerklaufwerk irgendwas hinschiebe, dann geht das mit 10G auf die SSD drauf, ich meine außer die SSD ist voll, dann natürlich nicht und dann wird das langsam aber sicher runtergemoved auf die Magnetplatte, äh das ist Write, das ist Write Cache, nicht Read Cache, Write Cache, weil Read Cache, ja dann bräuchte man, nee, Write Cache, ja mach da, wenn Stromausfall ist, sind die Sachen ja noch auf der SSD drauf und wenn ich die Kiste wieder einfahre, werden die Sachen halt weitergemoved auf die Magnetplatten, das funktioniert, also Amazon, was möchtest du uns heute verkaufen, billige Werkzeugkisten, die werde ich mir schon mal definitiv nicht kaufen, TP Link and More, ok zeig mal her, von Amazon Basics können wir safen, das ist gut, von Samsung können wir safen, von Netgear können wir safen, wir safen ja so viel, dass wir am Ende fast mehr Geld haben als vorher, zumindest wollen sie einem das weis machen, so noch mehr von Basics safen, ok wir safen ja hier komplett unser Konto voll, so fertig gesaved, also zeig mal her, TP Link Steckdosen, Nopers, Nope, was ist denn das, Access Point, warum sieht der so ppeger aus der Access Point, brauchen wir nicht, brauchen wir nicht, brauchen wir nicht, da fällt mir was ein, vor ein paar Jahren, ich überleg grad was es war, ob es Netgear oder Asus war, ein Routerhersteller, also irgendein Gaming Routerhersteller angeschrieben, ist schon 3-4 Jahre her, ob ich das Gerät nicht vorstellen möchte, ich bekomm das auch alles kostenlos, überlassen und so, da hab ich ihn zurückgeschrieben so nach dem Motto, ja ich kann das Gerät gerne in einem Video erwähnen, aber ich will das Gerät nicht benutzen, muss ich das benutzen um da drüber ein Video zu machen, und dann hab ich gemeint, warum willst du das nicht benutzen, voll geiler Gaming Router, ich hab hier mein Setup und das will ich nicht umschrauben, und irgendwie waren die scharf darauf, dass ich es benutze, und dann ist da nix draus geworden, vorgestellt hätte ich das ganze gar kein Problem, ganz ehrlich gibt es immer weniger und ist ein Glücksfall noch welche zu bekommen, weil die China-Chinesen leider angefangen haben, also hat 2 Gründe, die haben angefangen Geräte rauszugeben die gepatcht sind, ja wie gesagt du musst erstmal welche kriegen, die noch flashbar sind, also es gibt 2 Sachen, die haben ihre Geräte gepatcht, sodass dieses standardmäßige over the air flaschen nicht funktioniert, dazu musste man die letzten paar Geräte schon aufschrauben um sie flaschen zu können, und das nächste ist, die Geräte haben kein ESP866 oder ESP32 mehr und dementsprechend ist mit TASMOTA flaschen eh nix, weil TASMOTA ist eine Firmware für den ESP866 und ESP32, also sprich wenn da ein anderer Chip drin ist, geht TASMOTA logischerweise nicht mehr. Du hast die Gosund bestellter Flashbar direkt von ihrer Webseite, zeig mal, schick mal einen Link, Gosund, die haben sich immer noch nicht in Gesund umbenannt, Corona ist doch fast vorbei, ist das die mit USB unten dran, ja die hier, die sind tatsächlich nicht schlecht, falls die das sind, die ich auch mal bestellt hab, Gosund, ich glaub da sind die mit, naja Pima Daumen Strommessung, also was das verbraucht, was dran hängt und zwei USB Anschlüssen und halt eine normale Steckdose, die waren ganz okay, falls die das sind, die ich auch habe, allerdings wie gesagt, keine Ahnung ob die noch flashbar sind, Shelley kannst du auch mit TASMOTA flaschen, der Unterschied ist nur, dass du hier 4 China-Chinesen Steckdosen bekommst, manchmal, wenn die im Angebot sind, für den Preis von einer Shelley Steckdose, Gosund-Deutschland.de, die gibt's ja, 34,60 Euro, SP1 Zwischenstecker, bewerben die hiermit, dass man die flashen kann oder, oder war das Zufall, bewerben die das irgendwo, dass die flashbar sind, ahja guck mal, Shelley Smartplug gibt's, das hört sich übrigens aus, Shelley Smartplug hört sich sehr Gatchibas-mäßig an, ja guck da bekommst du zwei Shelley Plugs, hier bekommst du 4 Steckdosen für und die Shelley-Dinger sind in letzter Zeit ziemlich teuer geworden, guck mal, Products, Shop, Shop, die haben mittlerweile auch Gott und die Welt an Zeug, 17 Euro, also du bekommst, du bekommst genau zwei für den Preis von China-Chinesen, 4 und Feature-technisch ist das hier auch besser, weil, Moment wo sind die, guck mal, du bekommst die USB, sind die das mit USB, also die mit USB sind die, die sind folgsten, ja, die Steckdose steckt jetzt nicht von unten, das ist blöd, haben die USB, ne oder, ja dann die hier, dann die hier, mit Strommessung und USB und die am besten da noch im 4er-Pack, die hab ich mir nämlich damals im Angebot gekauft, ich hab mir glaube ich 3x4 gekauft und die konnten man alle noch flashen, naja nach oben und unten ist doch nicht das Problem, nach vorne, nach vorne sind die ungefähr genauso groß, ja du hast recht die sind größer aber dafür kannst du 2xUSB-Geräte anschließend kannst den Verbrauch messen und hast einen ordentlichen Schalter dran, was du beim Shelly nicht hast, also ich finde das sind die besten von denen die ich gekauft hab, China-Chinesen Zeug, ja, Gosund, 22 Euro, Leute das ist, aber wartet mal jetzt, ne, wartet mal ab, das ist ein echt guter Preis, man müsste halt wissen ob die flashbar sind, wenn die flashbar sind dann geb ihm rein damit, ist das überhaupt noch gültig, warum ist meine Playlist vorbei, Moment, wo ist meine Playlist, doch Relaxing Music, ach bei de Gosund, das ist Aliexpress, Moment, das sieht ein bisschen aus wie das Sale von Aliexpress, ne die Gosund Seite hat sich einfach vom China-Chinesen Webseiten Design Ministerium diesen Counter machen lassen, endet in 8.445, Leute jetzt wirds aber knapp, nur noch 8.445 Stunden left, mir juckt schon im Finger, ich kanns das wird knapp, ganz ganz knapp, ok aber man hat natürlich hier, Gosund, ja kann man die flashen oder nicht, das ist halt das Ding, wenn die flashbar sind Leute ist es ein wirklich echt gutes Angebot, ship das aus China oder ship das aus Germany, Leute Anzeige ist raus, die haben kein Impressum, haben die ein Impressum, aha clever, die Gosund Deutschland hat eins, aber Gosund Deutschland hat nicht die Angebote, Pepega Kram, das gibt nur den 2er Pack für den gleichen Preis, also hier Free Shipping, Fast Shipping, 3-5 Days, Leute kauf ich mir nachher einen Pack, Gosund und dann gucken wir mal ob wir die flashen können und wenn wir die nicht flashen können dann hab ich genitten, vielleicht bekommen wir raus ob das die ESP32 Steckdosen sind, vielleicht sehen wir hier irgendwie ein, gibt es hier ein Datenblatt oder sowas oder ein Manual oder irgendwas, nee gibt es nicht, also man kann jetzt echt nicht erkennen ob es die ESP Steckdosen sind und noch weniger ob die flashbar sind, das bringt dir ja nichts, du hast Templates für die, du hast Templates für die, aber du weißt nicht ob die Hardware Revision oder generell die Hardware überhaupt noch flashbar ist, also es gibt Templates für TASmo dafür aber das ist halt die Frage ob du es überhaupt drauf bekommst, der Tuya App sagt ja nichts, Tuya Apps sind die alle, was man sieht Versteckdosen gekauft hat, vermutlich nicht mehr auf TASMOTA flashbar, die Antwort ist nein, man kann inzwischen weder OTA noch, ja gut der weiß ist halt auch nicht genau, was, 2020 bringt ja nichts, echt, das ist bei uns auch, ja das ist Pepega, das stimmt doch, das ist doch bestimmt alles Fake, das ist doch bestimmt alles Fake was da unten steht Leute, das ist so diese typische China-Chinesen Chebat, das ist doch alles Chebat, das ist doch alles Chebat, es gibt kein Thomas Mark der das gekauft hat, wisst ihr was die machen, die machen Random Name Generator und Random Art Generator und tun so als kaufen die Leute gerade wie verrückt, das ist Schwachsinn, das glaube ich nicht, das wird bestimmt Fake sein, auf der anderen Seite das ist ein China-Chinesen Hersteller, da weißt du nie was die so abziehen, die sind ja auch nicht mehr flashbar, also der Chat sagt, der hat meistens Recht, sagt er hätte was bestellt, boop, ich kann ja mal reden, das ist vorbei, was ich sagen wollte ist, der Chat hat eben gesagt, er hätte was bestellt und die sind noch flashbar, aber nicht, was bringt ihr das Flashen, er hat mehrere Vorteile, du musst die offizielle App nicht dafür verwenden um das zu steuern, du brauchst keine dauerhafte Internetverbindung, du brauchst keine China-Chinesen Cloud um das zu betreiben, du kannst das integrieren in deiner Heimautomatisierungslösung gescheit mit lokaler Firmware, du kannst es steuern über ein Web-Interface, du kannst es steuern über deine Heimautomatisierung, du kannst es steuern von jedem X-Blogging Browser aus, auch vom Handy aus, du hast Funktionen drin die die original Firmware gar nicht kann, also es hat eigentlich nur Vorteile den Kram zu flashen, für mich die größten Vorteile sind keine China-Chinesen Firmware und App-Zwang. Ja, kann dir sein, dass du Glück hast, vielleicht sind die auch wieder flashbar, ich verstehe die Hersteller eh nicht warum sie das raushauen mit dem Flashen, ganz ehrlich die Leute kaufen sich doch jetzt nicht diese China-Steckdose, weil die denken, oh alter ich wollte schon immer mal eine China-Steckdose haben, viele Leute sind auch in dem Bereich, gerade was Heimautomatisierung angeht, relativ technikinteressiert und die wissen, dass man das Flashen kann und die wollen das Flashen und wenn die das kaufen, dann wollen sie es auch flashen, was sagst du dazu? Aber ich sag euch übrigens gleich bevor ihr hier rumspammt, ich meine jetzt nicht dich ja so allgemein, bevor ihr irgendwelche Ref-Links rumspammt, dann Time-Out ich euch, ich will nicht dass ihr Ref-Links, ihr könnt Links posten und sonst was, ok, aber keine Ref-Links und vielleicht die Session-IDs raus machen, so also was ist das, Mini PC Intel Core i5, welcher Core i5, ist das so ein Fake-Nook oder was ist das, Ref-Link ist ein Link an den man verdient ja, mit Ref-ID, ich sehe das gleich ob da eine drin ist, ich hab da den Blick für, was ist das für ein i3, äh i5, ach da, lull, hab ich nicht gesehen, was dreck, Switch-Chat, was ist hier los, was, was ist hier los, der Chat ist Massive, high IQ, was ist das, ach das ist, ja das kenn ich, das ist, ähm, das ist der der versucht ein TAS Motor für die neuen Chips zu programmieren, aber das ist ja noch komplett in den Anfangsschuhen, ich nix, aber ich weiß nicht wie sinnvoll es ist Session-IDs in der UL mitzuschicken, ja keine Ahnung was ich davon herhalte, ich kenn mich mit aktuellen Rechner-Sachen zu wenig aus, also für 200€ würde ich sagen klingt das eigentlich durchaus brauchbar, definitiv schneller, viel viel schneller als Raspberry Pi, unter halt x86 wenn man das haben will, würdest du auf einem Intel-Nook ein Homelab oder ein Proxmox oder Android verwenden, klar warum nicht, wenn es dir von der Hardware reicht, was du anschließen kannst, warum nicht, ich für meinen Teil würde es wahrscheinlich nicht machen, ist Scam, warum ist Scam, erklären Blitz-Chat, ähm, ich würd's nicht machen, weil Intel-Nooks haben keine PC-Express-Slots und auch keine M2-Slots glaube ich oder zumindest keine M2-Slots mit PC-Express, also falls du 10G reinmachen willst oder falls du irgendwie erweitern willst, kannst du den Nook vergessen, ansonsten ja warum nicht, ehrlich gesagt, wenn es für dich von der Hardware taugt, hau drauf, Android wirst du halt vergessen können, weil was willst du da dran anschließen, eine interne Festplatte, fertig, mehr kriegst du ja den Nook nicht erweitern außer über USB, man kanns doch machen, kanns doch USB Platten anschließen und sonst geht alles, kann man alles machen, so also was kriegen wir sonst noch empfohlen, Gosund bei Prime Day, für eine 5 Jahre alte CPU, nee 200 Euro soll man bezahlen hat der Chat gesagt, nicht 400, 400 find ich auch zu teuer, aber für 200 scheint mir das ganz ok zu sein, Gosund, so viel Gosund hier, was denn das, Alexa-Sternenhimmel-Projektor, die haben aber auch alles oder, auch Dinger von denen ich von der Existenz bis jetzt noch nix wusste, ein Alexa-Sternenhimmel-Projektor, was macht man mit einem, also ich mein mir ist klar damit projiziert man einen Sternenhimmel, aber will man sowas haben, schau mal was es für Raspberry Pis gibt, wahrscheinlich keine und wenn zu teuer, oder meinst du jetzt irgendwie Addons oder so, Sensoren, die Sensoren sind doch eh so billig, da musst du nicht im Prime Day kaufen, die meisten Sensoren kosten 2, 3 Euro und dann schon im 5er Pack, Montana Black findet sowas krass wegen Ambiente, ja aber Montana Black hat sicherlich kein 37 Euro, eh, Gosund-Sternenhimmel-Projektor, sondern irgendwie sowas total übertrieben teures für 85.000 Euro, der irgendwie den gesamten Sternen-Katalog von sonst was mit eingebaut hat, gibt es eine gescheite, smarte Steckdose für Homo-System im Angebot, bin ich gerade am gucken, also das Gosund Zeug kann man halt wahrscheinlich nicht mehr flashen und dementsprechend sackt es, next, brau man alles nicht, brau man nicht, brau man nicht, brau man nicht, brau man nicht, was das, USB, ah ok, Adapter, Netzwerk, brau man nicht, brau man nicht, brau man nicht, brau man nicht, brau man nicht, so nächste Seite, brau man nicht, guck mal die Seite lädt schon gar nicht mehr, brau man nicht, brau man nicht, brau man nicht, ok, crap, next, Amazon Basics, hast du ein Link zum Sorge im Hintergrund, ja, nein nicht der Lindner, was macht der Lindner da, das ist die Mario 64 Musik, wenn die Piranha Pflanze schläft, ok die machen alle Werbung, das sollte ich jetzt auch mal machen, brau, brau, brau, muss ich auch irgendwie sowas reinhauen, Epic New Battlefield 3 Mod, Leute, richtig Clickbait Titel brauchen wir dafür, dieser Mod, also dieser Mod wird dein Leben verändern ist langweilig, weil die Leute haben mittlerweile gecheckt, dass diese Videotitel nicht funktionieren, heute musste die Leute anders baiten, Amazon Basics Kleiner Bügel, Pog, Amazon Basics Handtücher, Amazon Basics hat auch wirklich alles, vom Pflaster bis zum Kondom bis zum Wäschetrockner, alles Amazon Basics, oh das, Alter, das ist ein Massive Titel, das ist gut, der Titel hat zwar mit der Realität nichts zu tun, aber der Titel, den finde ich wirklich gut, dieser Mod wird von Dice verboten, weil er so gut ist oder so, was überhaupt nicht stimmt, aber das ist ja bei Clickbait nebensächlich, ob es stimmt, solange es in Funke Wahrheit hat, dass man sich irgendwie rausreden kann, ist das alles in Ordnung, ist das eine Hängematte, es gibt eine Amazon Basics Hängematte, Besen, Schirme, Vakuum Verpackungen, Vox, Safes, Kissen, Schraubenschlüssel, Dinger, wo ich keine Ahnung habe, was ist, Muffin, Förmchen oder sowas, Plastikdosen, es gibt, Alter, das ist ein Safe, Schüssel, Betten, Töpfe, Handtücher, Matratzen, Alter, 11 Seiten Amazon Basics, ernsthaft, ne, das wäre jetzt zu viel Amazon Basics, Dice möchte nicht, dass du diesen Mod kennst, ja, das ist auch, Leute, ich sehe, ich sehe, ich muss euch öfters fragen, was Titel angeht, ich muss euch öfters fragen, der Chat weiß Bescheid, okay genug Amazon Basics geguckt, Safe on Samsung, Sekunde Leute, ich muss mal kurz Licht einschalten hier und das Gute ist, wisst ihr, ich muss zum Licht einschalten, nicht mal mehr aufstehen, ich gehe jetzt auf den zweiten Bildschirm in mein Home Assistant rein und mache jetzt einen Klick und zack, ist mein Licht an der Decke an, so muss das sein, das hat Hauptsatz und Nebensatz, das ist schon wieder zu high IQ für YouTube Titel, stimmt auch wieder, weiss hast diesen Trick, ne, das ist ausgelutscht, das kennen die Leute schon, also M2 SSDs, SSDs, cool, das ist Samsung SSDs, interessiert mich jetzt nicht, Fritz, Moment, Netgear, was genau, sag mal, Sekunde, mein Rechner ist übelst ausgelastet, was ist hier denn los, ich muss mal kurz, muss mal kurz schauen, was hier mein Rechner so auslastet, der ist laggy, was lastet mein Rechner so aus, nix, Chet, lasst mal euer Hackerman Kram sein hier, wer von euch ist es, wer ist schon wieder drin hier, ich, ja, fünf Leute gleichzeitig, streiten sich gerade, wer zuerst den Keylogger deploit, dieses vier Fenstersymbol unten links könnte das Problem sein, das da, ja, das stimmt, das ist wahrscheinlich das Problem, das ist ja eigentlich auch das falsche Logo, das richtige Logo ist ja das hier, also Microsoft weiß selber nicht, wie ihr Windows Logo aussieht, das ist in Wirklichkeit das richtige Windows Logo, Continuous Integration für den Keylogger läuft schon, so mag ich das, der agile DevOps Ansatz hat sich durchgesetzt, also Netgear und Co. und da gibt es erstmal nur Fritzbox Stinger, ok, nice, GG Ease, Ease, Netgear, Fritzbox, was, was ist das, ah, ein WLAN, WLAN Mobile, WLAN LTE Router, alter den Crap braucht doch echt niemand. Also Tender hört sich irgendwie an, wie eine Damenbinde weniger als nach einem Accesspoint, und was benutzt du so, hm, meine Tender, aber es hört sich nicht so nicht technisch an, Orbi kommt jetzt als nächstes, der Orbi, der Orbi, war das nicht in Black Ops, der Blackboard im nächsten Black Ops, war das nicht der Orbi, Black Ops 2, ja, der Orbi ist am Start, next, alter warum ist, das liegt am Darkreader, warum der Scheiß so langsam ist, ich sags euch, guckt euch das mal an, Flashbang, die Dinger sehen auch immer abgedrehter aus, das Teil, alter, oh man, so USB, ist ja alles Müll, braucht doch keiner, was genau hat es mit den restlichen Sachen zu tun, ach das ist ein WiFi, ein WiFi Bilderrahmen, 690 Euro, warum kann ich mir den nicht einfach in Amazon Tablet an die Wand hängen und da ein Bild drauf anzeigen lassen, also dann doch lieber für 50 Euro sich ein Amazon Tablet kaufen, das ist wahrscheinlich, na ok, das ist nicht 41 mal 61, das ist schon ein bisschen größer, das ist Bilderrahmen SSService, ja wahrscheinlich, wenn du die Cloud App von denen nicht verwendest, gehts nicht, und nach einem halben Jahr stellen sie den Service ein und du kannst deinen Bilderrahmen nicht mehr benutzen, ich wette mit euch, du musst, das gucken wir uns jetzt an, ich wette mit euch, du musst die offizielle App dafür verwenden, anders geht es gar nicht, ihre Kunstsammlung ist jetzt endlos, ja die Leute sammeln die Dinger ja nicht, weil sie die auf dem digitalen Bilderrahmen anzeigen lassen wollen, das bestimmt eine proprietäre App, App, mit einer App bei Netgear, ich weiß nicht, ob das so das Qualitätsmerkmal ist, Moral App, die Moral App, da müssen wir jetzt gucken, ok, schau mal beschissene Bewertung, alles klar, nee, Moment, ganz gute Bewertung, das ist die richtige, Moral, oh es supporte NFT Items, ho, da bin ich aber beruhigt, hab schon gedacht, ich kann da meine NFTs nicht drauf anzeigen, bin ich aber froh, dass mein Bilderrahmen NFT Support hat, nochmal saved, saved, ich weiß, wenn man den Leuten jetzt erzählt, dass man die NFT Bilder darauf auch anzeigen kann, ohne dass man die NFTs besitzt, was machen sie dann? Noch mehr Amazon Basics, diesmal ist es ein Taker und ein Dokumentenvernichter, eine Laptoptasche und Batterien und Marker und Bleistift und Batterien und Noise Canceling Headphones von S-Rhythm, ach nee, S-Rhythm, ok, man muss das auch richtig, richtig lesen, Crap, Crap, ich hab keinen Bock, ok, what the fuck, Exit Page, oh, ach so, das Ding, das hatten wir doch schon, ok, weiter, glaub der Dark Reader, der Dark Reader macht wirklich gerade den Abgang, oh, oh, Chet, warum geht man Virenscanner so hoch, was macht ihr da wieder, was, was ist da wieder los, so was haben wir denn sonst noch, also gucken wir mal, Mobile-Dings-Probleme, so ein Device, das haben wir ja schon geguckt, Computer, Electronics, ok, auf geht's, ist jetzt beim Deploy-Step angekommen, ach deswegen, ja, dann versteh ich's, richtig, richtig agiles Mindset-Chat, habt ihr gut gemacht, aus Indien, die die sonst auch für den Microsoft-Gold-Support arbeiten, wir sind bestimmt die gleichen, ok, Müll, Müll, Müll, hatten die nicht mal eine Smart-Home-Kategorie, die hatten wir eine Smart-Home-Kategorie, die es aber irgendwie nicht mehr gibt, ok, schnell durchgegangen, Müll, Müll, Müll, Müll, Müll, alles Müll, Artefake, Artefake, ok, er war ja schon ganz ganz sehr gut, nonprofit. zauerei was ein krasser chibate oder erstes was mich interessiert gibt es nicht tp link du hast jetzt zwei fire tv sticks geholt sonstig was machst du damit mit den fire ich finde den fire tv stick laggy schau pass auf was kommt was kommt jetzt was für ein ding ovo malteine crunchy cream brotaufstrich ohne palmöl ja dafür mit zeug ist das ist das pock ist das pock ich kenne das nicht das zeug ist pock oder not pock pock ja was sagt ihr versus versus nutella kennst du youtube werbung nicht nö ist es ist es pock ok crunchy wenn es aus das war aus der schweiz kommt dann taugt es die ich will kein abo guck mal amazon wieder die wollen mir ein ernsthaft ein brotaufstrich aber verkaufen ein one time purchase kein abo uu habe ich noch nie gehört chat bin ich nicht auf dem aktuellen stand aber jetzt kenne ich es auch brotaufstrich aber ja aber gucken wir jetzt nicht moment wo sind wir stehen geblieben ah hier so müll müll müll brauchen wir nicht müll next rasenmeer die rasenmeer brauche ich auch nicht unsinnig unsinnig unsinnig es gibt es gibt echt es ist wieder es ist für soviel so viel müll ich weiß auch nicht irgendwie wer kauft rasenmeer bei amazon ich würde rasenmeer bei amazon kaufen was jetzt passiert ich habe health und beauty angeklickt wollte ich ja gar nicht ich würde rasenmeer bei amazon kaufen gar kein problem ich habe leute ich habe sogar autoreifen bei amazon gekauft der witz hat jetzt auch schon es war auch gab auch schon lustigere comments was ist denn technisat irgendein uraltes label für fernseher mal mein opa hatte früher was von technisat das weiß ich noch also mir ist unklar also ich wusste bis jetzt nicht mehr dass es das überhaupt noch gibt technisat das ist sowas wie was es früher sonst noch gab so grundig und und und sonstige dinger was jetzt ich ist es nicht so grundig gehört in irgendeinem türkischen laden und und technisat was weiß ich 1987 gekündigt ja sag ich doch ich sag mein opa hatte auch so dinger technisat telefunken gab es auch noch stimmt nee sorry leute telefunken hatte der telefunken nicht technisat das habe ich durcheinander geschmissen oder nee der hatte doch der hatte ein dvbt empfänger von technisat das ist auch sowas alter mein opa ja da hat es teilweise auch ganz schön verkackt der hat mich gefragt was soll ich mir kaufen ja also der wollte fernseh gucken der hat fernseh geguckt analog über antenne und irgendwie haben die dann analog über antenne abgeschaltet und dann wollte er weiter fernseh gucken und er hat gesagt aha was soll ich also was soll ich jetzt kaufen und ich habe gesagt opa entweder du lässt endlich mal einen kabelanschluss ins haus legen was der damals nicht wollte was uns jetzt saumäßig viel geld gekostet hat oder du holst die satellitenschüssel lass dvbt sein krab gerade am anfang was hat er gemacht er hat nicht auf mich gehört er ist in einen lokalen elektronikladen gegangen hat sich einen technisat receiver gekauft und hatte über dvbt geguckt und das hat permanent rumgeruckelt und dann hat er mich immer gefragt so nach dem motto ha der fernseh geht nicht kannst du mal gucken ja oma kauft ihr eine satellitenschüssel den weißen hintergrund ist ganz einfach wie ich mir das mit dem weißen hintergrund geben kann weil der dark reader auf amazon einfach den kompletten browser den kompletten rechner load ne blink ist müll würde ich mir nie kaufen an kameras genauso wie ich mir auch nie eins von diesen komischen türklingeln kaufen würde die nur mit abgehen das muss alles über rtsp oder irgendwie zumindest mal emotion jpeg oder sonst was über irgendwas normales abrufbar sein natürlich rtsp mit einem h264 stream am besten und dann ist gut alles andere ist dreck ring ist genauso müll kommt mir in ihm lebe nicht ins haus habe ich heute werbung gesehen auf twitter da hat irgendeine firma ihren blog post beworben so nach dem motto wie können wir das internet of things sicherer machen mal gucken ob ich das noch finde tweets and replies steht das da ja guck mal hier haben irgendwie werbung gemacht hier wie können wir das internet of things sicherer machen vor der bedrohung schützen leute die einfachste variante ist ein smart home shit nicht ins internet stellen aber das wollen die hersteller nicht die hersteller wollen wenn du log in bei der smartphone app die hersteller wollen irgendwelche komischen proprietären cloud geschichten die wollen dass du das ding nicht autonomen dass du das ding vor ort ansprechen kannst die wollen auch nicht dass du sind irgendwelche smart home lösungen integriert die nicht ihre sind die wollen dass du ihren scheiß benutzt mit always on und china chinesen cloud also es ist jetzt nicht so als wüsste man nicht was man dagegen machen kann die wollen da bloß nichts dagegen machen deswegen flashe ich ja auch alles was flaschbar ist und was nicht flaschbar ist kommt in meinen china chinesen wlan was nirgends wohin darf weder ins internet das einzige was man china chinesen wlan da fürs ntp machen auf meinen router das aber auch das auch komplett alles und geräte die gar nicht lokal kommunizieren die kaufe ich mir gar nicht es ist so viel überflüssiger müll dabei mama ruft an save und wo davon ohje ich ahne schlimmes kann man diese show me waage flaschen nein nicht direkt aber die musst du auch nicht flaschen also meinst du die ich habe also meinst hier die da du meinst diese waage also warum ist das da kann die seite mal funktionieren please du meinst diese war die seite ist total überlastet da geht nichts seite müde seite schlafen du meinst diese waage hier also die kannst du nicht flaschen aber die musst du auch nicht flaschen weil die waage kann ihre wie grugen per bluetooth also kann man die abfragen die waage schickt die sachen e per bluetooth raus und die kannst du mit jedem x beliebigen esp 32 abgreifen die musst du nicht flaschen ich glaube du kannst die noch nicht mal ins internet packen die waage du kannst die höchsten sparen mit der offiziellen app und das dann auslesen musst du aber nicht die geht auch so per bluetooth ja die kann auch körperfettanteil warum machst du das immer mit der 1 weil ich mir das angewöhnt habe total unsinnig nicht nachmachen oder sich nicht angewöhnen so also was kann ich denn auch ein vodafone saufen die vodafone smartwatch ich weiß ja nicht ich will eh keine smartwatch aber eine smartwatch von vodafone glaubt noch weniger oppo ist billiger hammer ist billiger bontech ist billiger kabel direkt ist billiger na dann vielleicht sind das echt paar ganz praktische verlängerungs sachen dabei perl smith habe ich noch nie gehört ist aber auch billiger amazon hat echt alles mittlerweile pumpen billiger bayern münchen fanartikel billiger meine güte ist aber nix dabei was ich habe apc ok gucken wir mal gibt es vielleicht paar sinnvolle us v vielleicht hole ich mir dann doch mal wieder eine batterien billiger doando günstiger ob das was taugt das ist bestimmt irgend so ein china chinesen hersteller von perreferie die versuchen krass auszusehen aber von der hardware her halt sachen ja barbie bei ich habs gesehen ich gette den witz nicht so ganz wassapp sim weil die haben simkarten ich war heute in einer eis stile eis essen und die hatten allen ernstes wassapp eis kein spaß ich habe ja auch noch mal habe ich jetzt richtig gesehen daneben gab es barbie eis und bine maya eis und alles mögliche und irgendwo zwischendrin wassapp eis ja weird champ weiß ich nicht was das schmeckt ich habe mir das nicht geholt zwar grün wassapp eis kurz gucken ob ich wassapp eis ob man das findet da findest der jetzt natürlich sonst was ja wassapp eis gabs ich verstehe nicht warum wir gigabit verträge haben sollten nicht alles unlimited sein tja wir sind in deutschland also nicht so easy mit internet sachen ich mein unlimited muss ja nicht sein aber wenn sich das in regionen abspielt wo du eigentlich bedenkenlos surfen kannst ist alles ok es gibt ja mittlerweile verträge die ganz ok sind und das ist tatsächlich die letzten jahre über sehr viel besser geworden ich habe ja noch vor drei vier jahren das übelste oder vier fünf jahre schon bisschen übelste rent video gemacht über kak handy verträge mittlerweile ist es besser ne das ist nicht die eisdiele in der ich heute war bei der eisdiele wo ich heute war war vorne das schild whatsapp und es hatte sogar ein selbstgemaltes whatsapp logo auf dem schild drauf und stand whatsapp eis brauche man nicht brauche man auch alles nicht acer notebooks könnte man vielleicht gebrauchen brauche ich nicht ryzen brauche ich jetzt auch nicht mehr hp ok da steht hp ja aber auf dem bild sieht man rocket logitech und kosa was auch immer das mit hp zu tun hat razor nicht rocket richtig ihr habt recht chat chat halt wieder richtig high iq messig drauf einfach giga chat der chat heute wieder auch unsinnig unsinnig unsinnig unsinnig unsinnig fahrradhelm ok nicht unsinnig aber brauche ich nicht das kommt mir was war denn minis das sagt mir irgendwas minis forum da klingelt irgendwas im hinterkopf ich kann es nicht mehr genau zuordnen sagt euch minis forum was irgendwie kommt mir der name bekannt vor der bauer das was mit dem bauer zu tun 13 monate kann sein dass ich von denen was gesehen habe auf youtube aber irgendwie sagt mir das was für ein handy vertrag ich habe kann ich dir nicht sagen ich habe ein iphone von der firma wo ich arbeite mit einem vertrag von der firma wo ich arbeite also ich hab gibt es irgendwo eine webseite von der telekom wo man irgendwas von der telekom ist es wo man nachgucken kann die telekom vertrag und wenn ich auf die seite gehe aus dem telekom netz dann sehe ich was ich habe wenn ihr mir sagt wo das wo das mit der magent in die stelle mir keine magenta ab jetzt pass punkt telekom punkt e alles klar pass punkt telekom punkt de informationen für den aufruf dieser seite ist ein internetverbindung über das mobilfunknetz bla bla bla achso moment muss ich wählen ausschalten also ich habe your telekom data plan 20 gigabyte im monat habe ich das steht aber nicht dabei wie der vertrag heißt kann ich euch jetzt auch nicht sagen 20 gigabyte ja also nicht 20 gigabyte verbraucht sondern 20 gigabyte ist darf ich monatlich verbrauchen schon wieder obi dokumenten ordner was ist das ist das ein lüfter erkennt ihr das ist das ein lüfter ein ventilator mit ab er ist ganz wichtig für den ventilator dass der eine app hat wie könnte man nur einen ventilator ohne app bedienen unglaublich wie geht das nur hexenwerk der zoomer der zoomer ventilator das braucht eine app sonst geht das nicht lgb ram wichtig mehr frames lgb ram ist tatsächlich an dem moment nicht lgb ne doch lgb ram und lgb m2 ssd habt ihr led strips ja relativ ne und eine unterboden belichtung habe ich nicht ich habe led strips eben hier im fenster ich habe led strips wo habe ich denn überhaupt alles welche überlegen wo habe ich led ich habe alles mit wled selbst gebaut also an der treppe für die beleuchtung habe ich hier am fenster habe ich unten in der kirche am fenster habe ich für den weihnachtsbaum habe ich aber das kein led strip das ist so eine so eine kette aber halt auch mit wled zum ansteuern ich glaube das war es ich habe das anders gemacht ich habe die strips in so einen diffusor gemacht und den dann ans fenster geklebt welche led strips nutzt du da das kann ich dir aus dem kopf nicht sagen ich glaube sk6 ok warte led sk so was da glaube die könnten das sein bin ich mir jetzt ehrlich gesagt nicht ganz sicher es sind auf jeden fall welche mit weiß dabei und ich steuere das ja das ist überhaupt was ist ein steuerbar ich mache das ich steuere das alles mit wled wled ist ziemlich hog ich kann euch zeigen wie das aussieht sag muss man nur die ip raussuchen von dem teil einstellungen integrationen wled so sieht das aus bei mir die wled version ist übrigens auch uralt gehe ich mal von aus hier da kannst du hier oben einstellen welche farbe du haben willst da kannst du noch einstellen sättigung und und helligkeit und gedöns da kannst du einstellen ob du effekte haben willst ich habe zum beispiel den multi candle effekt dann flackert das so leicht aber halt jede jede led ein bisschen anders das ist das ist das ist das was ich an der treppe hab oh nein ip leak schon wieder ah jetzt ist jetzt ist erst hacker man meinen browser alarm gelegt und jetzt auch bald noch mein led strip sieht das dann so aus wie bei ich weiß nicht wer das ist ja also das ist nice turbo dead end danke schön für den sub danke leute für die ganzen subs heute ich hab bestimmt wieder die hälfte übersehen ja das mein led strip let's go das kann passieren das passiert folgendermaßen wenn du led strips kaufst die nur rgb haben und nicht rgbw wenn du led strips hast die also es gibt bei led strips eigentlich zwei grundsätzliche unterschiede es gibt welche mit drei farben und welche mit vier farben vier farben ist ganz normal rgb er drei farben ist ganz normal rgb und vier farben ist rgb plus weiß hat den vorteil und dann kann man meistens dieses strips noch in unterschiedlichen weiß tönen kaufen der vorteil ist dass weiß bei diesen leds auch wirklich weiß ist und ansonsten wenn die blau sind gibt es verschiedene varianten entweder hast du rgb vertauscht also dass es dann vielleicht gar nicht rgb ist sondern bg ra oder gbr oder sowas oder aber das mischen von allen farben kommt halt auf den bläulichen ton raus und dann musst du es halt so so justieren dass es dass es die passende farbe gibt ja was es gibt auch rgb y was ist denn y ich mein rot grün blau ok weiß und was ist y yellow ah das ist dass du den weiß ton selbst einstellen kannst oder wie das ist natürlich ganz clever ich habe schon gesehen kann ich kann ich mich trauen nee achja naja gesehen nicht können wir uns gucken wir uns gucken wir uns gleich noch an zusammen ich verfolge die schon seit jahren auf discord das projekt ja keine benutzen ich hatte auch eine lange zeit habe ich sogar mal im stream gezeigt aber ich muss ehrlich sagen ich verstehe den sinn nicht für start pages keine benutzen browser bookmarks machen fertig wozu brauchst du start pages ich habe mir auch eine gemacht einfach weil es cool aussieht für das video wo ich es mal gezeigt habe aber ansonsten ich verstehe den sinn von start pages nicht bookmarks im browser fertig geht schneller brauchst du keine extra seite ja ok wenn es für mehrere leute sind ja homer habe ich auch verwendet gibt es aber massig verschiedene dashboard sachen ja ok wenn du es mit für mehrere verwendest dann verstehe ich das ja aber intern weiß nicht ok wenn man von ja verstehe ich auch leuchte mir ein wenn man von außen drauf zugreift ok ja sind alles anwendungsszenarien die habe ich nicht aber das verstehe ich ja ein portable fan i wish an e wish oh ja das klingt ja definitiv nach einer maus die ich haben möchte i wish ane wish noiseless klick ach das ist fürs tablet ein fernklaas ich wollte mir wirklich letztens in fernklaas fernklaas kaufen aber ich gehe davon aus dass dieses fernklaas was hier bei amazon ist wahrscheinlich sacken wird das ist doch china bea bang be bang das ist china kram wobei ich meine das ist ja im prinzip nur ein klaas also vielleicht können die china chinesen das warum kann ich dir erklären nicht was die leute jetzt wieder sagen so nach dem motto null max du willst irgendwo reingucken oder sonst was zum beispiel wenn ich wandern gehe frage ich mich öfters mal was ist das denn da was ich da in der entfernung sehe zum beispiel in irgendwelche gebäude wenn ich für die nachdenklich kann es nicht genau erkennen und da habe ich mir schon öfters überlegt ich sollte mir vielleicht mal fernklaas mitnehmen ein wandern korrekt ich war fenster oma fenster boomer also wenn ihr demnächst in hanau einen am fenster stehen seht mit fernklaas der so aussieht dann bin ich das oma face usfaus stimmt usfaus wollte ich gucken haben wir noch ein paar aufgemacht hier es gibt usfaus der hersteller soll er laut chat ganz gut sein qnap juckt mich nett wo habe ich denn die eher oma usfaus also ok das ist alles keine rekbauweise das wäre aber auch nicht schlimm ja die in rek rek form gibt es natürlich nicht aber trotzdem haben die ein usb anschluss oder sind die unmanaged oder wie nennt man das bei usfaus die sind komplett an nee die haben usb die haben einen kleinen webserver mit drinne das stelle ich mir merkwürdig das stelle ich mir komisch vor wenn die was internet mode wollte gerade sagen die haben doch gar kein netzwerkanschluss aber doch die haben wir netzwerkanschluss leute chat taugen die ich meine jetzt nicht von der ich nicht von der leistung her das reicht für meinen schrank locker aus und viel wichtiger wenn der strom an ist und die batterie kaputt geht bleibt es dann an ich weiß nicht ich glaube ich bleib weiter ohne usf ich hab bisher nur negative erfahrungen im heimbereich mit usfaus bei mir ist mehr durch die usf kaputt gegangen als ohne usf kaputt gegangen wäre anker es gibt ja wirklich nix ne es gibt einfach nix also nix was irgendwie sich für mich lohnen würde hallo möchtest schließen please schließen schließen ok na guck ich doch mal schnell smart home durch du hättest eine smarte klingel ich würde aber nicht die smarten klingeln kaufen mit app zwang und vendor log in was willst du als smarte klingel haben willst du nur eine klingel wo du auf dem handy mitbekommst wenn es geklingelt hat das ließe sich ziemlich easy nachrüsten oder willst du eine klingel die wirklich bild streamt und du mit dem typ sprechen kannst übers handy dann wird es schwieriger dann brauchst du wahrscheinlich was neues ja benachrichtigung aufs handy ist einfach dass das da gibt es sehr viele möglichkeiten das zu machen also die einfachste variante ohne dass du an der dass du da ohne dass du an die verkabelung dran muss ist du machst den sp 32 sp 82 66 controller an die an an die klingel oder an das telefon wo es klingelt mit einem sensor der eben checkt wenn es besonders laut ist daneben das funktioniert eigentlich ganz gut wenn man wirklich gar nicht eingreifen darf in die verkabelung das geht relativ einfach und falls du die 5 volt für den sp anzapfen kann es natürlich noch besser wenn du wenn du an die verkabelung dran kannst dann kann man vielleicht noch mehr machen aber das einfachste ist tatsächlich microcontroller dran mit so einem mikrofon sensor der dich dann benachrichtigt wenn es geklingelt hat das ist relativ einfach zu machen und ich habe gar keinen bock weiter zu weiter zu scrollen weil es eh nichts gibt ein senioren telefon sowas hatte ich meinem opa mal gekauft vor langer zeit raspberry pi starter kit aha es gibt ein raspberry pi nee es gibt kein raspberry pi es gibt eine überteuerte teile sammlung für ein raspberry pi ja gut das braucht keiner ja würde ich auch näher abrennen wird davon nichts aber das kannst du machen ja also dann ist das beste was ich gesagt habe du machst einen microcontroller mit einem mikrofon sensor hin da musst du halt nur gucken wo du den strom anschließt wenn du es nicht von der anlage abzapfen kannst und der kann dich benachrichtigen so musst du nicht in die verkabelung eingreifen wozu benutzt ihr eure raspberry pies also ich habe aktuell im einsatz einen raspberry pi 4 unten im wohnzimmer mit ssd dran da lief früher der unify controller drauf aber ich habe kein unify mehr deswegen brauche ich den controller nicht aktuell läuft da bloß was für die für das streaming von den überwachungs kameras drauf das kommt aber weg der ist überhaupt nicht ausgelassen ziemlich unsinnig da habe ich ein raspberry pie im keller stehen der ließ daten von der also da hatte ich früher den pico w dran hängen aber den habe ich abgelöst durch den richtig echten raspberry pie und der ließ die daten von der heizung aus und kann auch die heizung den heizungsstatus ändern der guckt ob es geklingelt hat mit einem analog digital konverter ließ da aus eben die spanung von der klingel ob es geklingelt hat ja und sende das an die heim automatisierung und dann habe ich noch ein raspberry pie am 3d drucker zum sketches uploaden und druck anstoßen und sowas alle anderen habe ich mittlerweile wieder abgebaut im wohnzimmer den raspberry pie für fernsehaufnahmen habe ich ersetzt durch so eine linux box aber auch mit tv headend ja und hier neben mir habe ich noch zwei raspberry pies vier liegen zwei raspberry pies vier liegen im flea case gibt es vielleicht in flea case günstig das wäre natürlich cool aber das gibt es naftos also ganz ehrlich für 10 euro scheint mir das in ordnung zu gehen der label champ nöder ist immer noch nicht fertig lull ganz schön teuer champ moment das ist ein touch screen im gehäuse das ist eigentlich eine ganz praktische sache wenn man dafür ein anwendungsszenario hat so was trug man sich ich bin gespannt wie du dir ein alu gehäuse drucken willst long runa das ist die gleiche kamera die schon seit jetzt gefühlt zehn jahren für raspberry pie gibt nur jetzt mit zum komischen objektiv drauf fischermanns freund raspberry ich wollte gerade sagen warum zum teufel findet er fischermanns freund wenn ich da raspberry sucht aber weil raspberry raspberry geschmack was heißt raspberry auf deutsch eigentlich noch mal himbeere ist das himbeere ich bin gerade auf dem schlauch raspberry pie zero case ja himbeere ok ja besser wäre es wenn es ein raspberry pie wäre und nicht nur das case i unicare an dem namen steht einfach schon china chinesen zeug dran netac mikro sd hat irgendjemand von euch schon mal von netac was gehört ich noch nie bestimmt ein äußerst renommierter hersteller für mikro sd karten pinheader auf pinheader habe ich angst mittlerweile ich hatte jetzt schon zweimal pinheader im fuß stecken was kann der mikro pie eigentlich leisten du meinst du den pico den pico oder was denn ja gar nichts das ist kein raspberry pie das ja ein microcontroller der ist ganz ehrlich ich verstehe nicht warum irgendjemand raspberry pie pico verwenden will esp 32 der normale ist einfach in allen belangen besser verstehe ich nicht auch das entwickeln ich habe es letztens ausprobiert leute ich habe ich habe ich habe mir zwei pico picos pico wege gekauft du hast die auswahl zwischen c only mit ihrem komischen sdk was nix unterstützt oder platform i o arduino der aber auch nix unterstützt weil so die minimalst basic arduino implementierung ist also komplett sinnlos ich würde nur esp 32 verwenden was ist das an kühlen passivkühler ja das verkauft sich auch nur weil es raspberry pie heißt ansonsten verstehe ich den anwendungszweck für den pico echt nicht crunchy protein bar auf geht's ein guter tag ja ist leider kein raspberry pie dabei hast du schon was gefunden nee nur müll doch ich habe mir zwei picos gekauft wie gesagt ich habe es ausprobiert auf dem einen und ich verstehe nicht warum man die verwenden sollte wenn man noch einfach ganz normale esp 32 verwenden kann die als d1 mini ausführung ähnlich klein sind und sogar noch ein ticken günstiger andere frage warum arbeiten wir alle und tun so schlau ich weiß nicht wir sind schlau chat wir tun doch nicht nur schlau oder ich dachte immer durch die ganzen subs sind wir mittlerweile wirklich schlau und und müssen das nicht mal faken wie high iq chat ja also tun so schlau obwohl wir schon die technik hätten das robot und der eis alles für uns machen können also ich bezweifle dass wir die technik hätten das robot und eis alles machen können du siehst es aber in bereichen wo man das machen kann ja also das was früher fließbandarbeit war irgendwelche autostraßen und sonst was da wird ja vermehrt was von robot und eis gemacht und wenn du nach japan guckst da sind ja auch deutlich weiter was solche techniken angeht deutscher sind wir noch ein bisschen hinten dran aber das wird jetzt kommen man sieht es jetzt schon und es ist davon auszugehen dass viele berufe die es jetzt noch gibt also bin ich mir ziemlich sicher viele berufe die es jetzt noch gibt ist jetzt die letzte generation die die jemals ausüben wird und dann werden zwar nicht robot und eis alles machen aber das was sich eben lohnt zu automatisieren wird gemacht werden und es wird in anderen bereichen arbeitsplätze schaffen und insgesamt aber mehr verlieren als dass es neue schafft ich meine ist ja ganz einfach ja wenn du sagen wir mal zehn fließbandarbeiter durch eine robot greifarm ersetzt dann brauchst du vielleicht zwei programmierer zu zehn fließbandarbeiter also ja die brauchst du mehr du hast quasi ein arbeits du hast quasi zwei arbeitsplätze geschaffen für zwei programmierer oder techniker aber zehn sind weg quickmaps also es werden insgesamt auf jeden fall weniger und da bin ich immer gespannt wie wir das handeln wollen wenn die dann alle in renter gehen und unser rentensystem jetzt schon nicht richtig funktioniert und wenn die auf einmal alle in renter gehen in was weiß ich 10 15 jahren da bin ich echt mal gespannt das kann hinten das wird wahrscheinlich hinten vorne nix aber gut dass ich meine stonks habe ai zum programmieren nutzen wir verlieren ja das wird nicht passieren zumindest nicht in absehbarer zeit natürlich kann man sich jetzt das scenario ausmalen was passiert wenn dann auch irgendwann mal programmierer durch ai ersetzt werden und die ai selbst ai programmiert ob wir uns dann nicht in richtung terminator oder so entwickeln also das halte ich jetzt zum aktuellen zeitpunkt irgendwie noch für ziemlich zusammen konstruiert aber dass man in zukunft ai verwenden wird um ai sachen zu verbessern das kann ich mir gut vorstellen und wir haben die letzten jahre wirklich richtig krasse fortschritte gemacht guckt euch mal an was wir für tools haben die man früher gar nicht für möglich gehalten hat ja du hast ai ist die aus musikstücken die instrumente extrahieren können du hast ai ist die bilder freistellen können für dich du hast ai ist die elemente in bildern entfernen kann du hast ai ist die ich sag es jetzt weil das das ist wo ihr alle dran denkt wo du leute drin naggisch machen kannst du hast du hast ai ist wo du bilder beschreibungen dir holen kannst in textform also sprich du gibst ja ein bild die ai sagt dir was auf dem bild zu sehen ist was relativ gut funktioniert und wenn es halt nicht funktioniert ist es komplett falsch ja aber meistens ist es relativ gut also wir haben sehr viele sachen in dieser richtung und da ist in die letzten zehn jahren fünf jahren ist da also die letzten fünf jahre reicht da schon wenn ihr das anguckt enorm viel passiert ja sollen sie mal machen personalabteilung braucht eh keiner das ist der vorteil von ai ist den ist es egal ob sie cobalt programmieren oder nicht ja ich weiß nutzt jemand copilot ja ich weiß dass viele im chat sogar copilot nutzen zumindest immer wenn es um das thema geht haben wir hier leute die was dazu schreiben ich verwende kein copilot was mich abschreckt ist dass es jetzt auch was kostet ja es gibt laufend auf aufrufe github zu verlassen die haben auch github schon verlassen als es microsoft gekauft hat das hat glaube ich kein projekt was es getan und was es gemacht hat wirklich gut getan was ist copilot copilot ist ein eine ai die dir beim programmieren hilft ihr macht vorschläge was du als nächstes schreiben möchtest also wenn du zum beispiel schreibst in deinem text editor class und dann drückst du autocomplete für copilot dann schlägt dir dann beispielsweise vor a kontextbasiert du willst jetzt eine klasse anlegen person mit vor und nachname drin und sowas richtig richtig genau ist es ist fast das gleiche wobei ich halt sagen muss whatsapp gibt es halt wirklich dinger die ich richtig kacke finde warum ich auch nicht verwende aber bei github ist es eigentlich immer noch eine gute plattform ja microsoft hat den kram übernommen und microsoft baut immer noch viel scheiße und wird auch immer viel scheiße bauen aber microsoft hat die letzten jahre über auch paar gute sachen gemacht angefangen von mischel studio code und auch github haben sie nicht komplett verkackt wsl ist auch ok wobei das natürlich bei microsoft alles nicht aus selbstlosigkeit passiert sondern letztendlich rein wegen stonks und geld aber github ist immer noch eine gute plattform in der seite microsoft übernommen finde ich eigentlich eher besser geworden ja sie schabt dort nett sind wunderbare technologien von microsoft also man kann ja microsoft nicht mögen ist ja in ordnung aber die machen durchaus gescheite sachen windows kommt mir auch nicht in die tüte also zu administrieren ich würde im leben nicht winnows administrieren winnows ist der größte scheiß den es gibt der einzige grund warum ich winnows verwende ist weil ich halt manche sachen am besten unter winnows machen kann was aber an den programm liegt und nicht weil winnows so geil wäre ich installiere mir kein winnows 11 ich installiere winnows 11 erst wenn winnows 10 end of life ist oder es driftige gründe für gibt vielleicht mit dem nächsten rechner wenn die nächste grafikkarten generation rauskommt und ich mir vielleicht endlich mal dann wirklich einen neuen rechner baue dann dann mache ich vielleicht winnows 11 transformation zum fitness influencer ja und face reveal alles in einem leute was hat man wenn man winnows 11 holt nee du hast winnows 11 was sollst du sonst haben es näher es gibt schon ein paar ansätze zum beispiel diese direct storage geschichten neuere direct x version die wahrscheinlich so wie ich microsoft kenne dann nur für winnows 11 raus äh winnows 11 rauskommen du hast aber auch viele nervigen sachen und ich verstehe halt nicht wie es microsoft immer wieder schafft upgrades zu releasen die von den funktionen her weniger bieten als die sachen davor das leuchtet mir halt nicht ein du ich würde auch nicht upgraden einfach so wenn es da nicht irgendwie driftige gründe für gibt würde ich auch nicht upgraden mache ich ja auch aktuell nicht ich upgrade ja nicht habe ich auch nicht vor erstmal ja accountpflicht ist auch so ein abfuck ding weshalb ich das nicht machen würde sobald es accountpflicht gibt gucke ich dass sie sich einen crack dafür gibt was kostet co-pilot eine gute frage bisher war es kostenlos mittlerweile pricing mittlerweile kostet das was wo steht denn hier pricing wir hatten diese seite wieder gemacht mann was kostet es denn ich ich check wieder nicht wo ich den wo ich einfach ganz normal die preise sehen kann wo war das hier ist nix nein das ist für github teams das ist nicht für co-pilot das ist das ist für github nicht für co-pilot keine ahnung wieder so eine seite wo du nicht durchblickst oder ich nicht durchblicke ja das hatte ich gerade auf so ganz oben hier also 10 dollar im monat 100 dollar im jahr das weiß ich nicht ob es mir wert ist keine ahnung wie sieht es bei euch aus chat kauft ihr es oder lasst es bleiben oder aber habt ihr keine ahnung was github co-pilot überhaupt ist also ich weiß nicht ich werde es nicht kaufen geht das mit allen idees oder nur wie es kaut das geht für alle idees und sachen wo es plugins für co-pilot gibt jetbrains bundle beste habe ich auch die haben den preis erhöht letztens um paar euro fürs jetbrains bundle ja schanken da kann ich dir jetzt so spontan auch nicht helfen doch bin ich bin ich bin ich keck wer ist das service ja startup startup ist schon fast gegründet der control enter ist jetzt aber das ist das ist die meistens so code refactoring oder vorschläge wie man fehler ausbessern kann aber github co-pilot macht ja schon mehr als dieses auto zeugs von jetbrains könnte ich mir einfach eine edu domain registrieren und darüber darüber einfach das bundle kostenlos bekommen kann man sich punkt edu registrieren omega keckel punkt edu das geht nicht unsupporte top level wir müssen bloß ein domain registrar finden der da mitmacht ah leute genug geschwätzt parmesan gibt es auch nichts ich bin müde wie sauber man vielleicht ich bin ja schon halb am einpennen ich gehe schlafen leute bettgetheim boomer müde boomer schlafen leute dit dit dit ja ich glaube gibt's sonst nix mehr oder ich will was wichtiges was wir noch besprechen müssten ich glaube nicht alles klar dann sehen wir uns morgen bis denn dann macht's gut, see you!", "segments": [{"id": 1, "start": 90.0, "end": 101.32, "text": "Moin Leute, oh moin ist gut, ist egal es geht immer."}, {"id": 2, "start": 101.32, "end": 112.72, "text": "Hat jemand von euch schon mal einen Raspberry Pi mit QEMO auf dem Desktop emuliert?"}, {"id": 3, "start": 112.72, "end": 120.44, "text": "Oder es muss doch nicht mal ein Raspberry Pi sein in irgendeiner Armkiste."}, {"id": 4, "start": 120.44, "end": 133.48, "text": "Ich wollte nur wissen, ob das normal ist, dass das so extremst abfahrklangsam ist."}, {"id": 5, "start": 133.48, "end": 139.72, "text": "Das ist nicht einfach nur langsam, also das ist wirklich unnutzbar langsam, selbst wenn"}, {"id": 6, "start": 139.72, "end": 140.72, "text": "man Zeit hat."}, {"id": 7, "start": 140.72, "end": 142.6, "text": "Das kann man komplett vergessen."}, {"id": 8, "start": 142.6, "end": 155.88, "text": "Ich hab mir überlegt, ob ich nicht mit QEMO irgendwas cross-compile für Arm, aber das"}, {"id": 9, "start": 155.88, "end": 158.0, "text": "ist ja unendlich langsam."}, {"id": 10, "start": 158.0, "end": 184.44, "text": "Der Small Access Point ist auch da Moin, da sind sie alle, Pogu, HiIQ Chat wieder am Start"}, {"id": 11, "start": 184.44, "end": 190.48, "text": "oder der Giga-Chat, der Giga-Chat ist am Start, der Giga-Chat-Chat."}, {"id": 12, "start": 190.48, "end": 210.32, "text": "So Leute, wir gucken uns heute mal Amazon Prime an, aber ich wette mit euch, es gibt nur Müll."}, {"id": 13, "start": 210.32, "end": 220.28, "text": "Das war die letzte Prime-Day, die letzten Cyber-Week-Mondays-Special-Sales und so war"}, {"id": 14, "start": 220.28, "end": 223.28, "text": "alles Müll."}, {"id": 15, "start": 223.28, "end": 229.24, "text": "Ganz viel billig China-Chinesen-Kram und Zeug, was kein Mensch braucht und einfach"}, {"id": 16, "start": 229.24, "end": 230.24, "text": "nur sinnlos."}, {"id": 17, "start": 230.24, "end": 247.24, "text": "Ich denke mal, so ist es jetzt auch, Leute ich hab ein Problem, ich weiß ich bin jetzt"}, {"id": 18, "start": 247.24, "end": 253.44, "text": "gerade im Stream-On gekommen, aber ich muss nochmal aufs Klo, das hab ich vergessen vorher."}, {"id": 19, "start": 253.44, "end": 260.8, "text": "Ich hab angemacht, bevor ich noch aufs Klo komme, Leute ich muss mal kurz aufs Klo."}, {"id": 20, "start": 283.44, "end": 301.12, "text": "Ich hab angemacht, bevor ich noch aufs Klo komme, Leute ich muss mal kurz aufs Klo kommen,"}, {"id": 21, "start": 301.12, "end": 311.44, "text": "Leute ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute"}, {"id": 22, "start": 311.44, "end": 318.46, "text": "ich muss mal kurz aufs Klo kommen Leute ich muss mal kurz aufs Klo kommen, Leute"}, {"id": 23, "start": 318.46, "end": 327.04, "text": "ich muss mal kurz aufs Klo kommen, Leute ich muss mal kurz aufs Klo kommen, Leute"}, {"id": 24, "start": 387.04, "end": 389.04, "text": "Das war's für heute."}, {"id": 25, "start": 389.04, "end": 391.04, "text": "Vielen Dank für's Zuschauen."}, {"id": 26, "start": 391.04, "end": 418.04, "text": "Das war's für heute."}, {"id": 27, "start": 418.04, "end": 422.04, "text": "Das war's für heute."}, {"id": 28, "start": 422.04, "end": 430.04, "text": "Das war's für heute."}, {"id": 29, "start": 430.04, "end": 439.04, "text": "Das war's für heute."}, {"id": 30, "start": 439.04, "end": 444.04, "text": "Die служte die Magde Hand auf für ein bisschen."}, {"id": 31, "start": 474.04, "end": 476.04, "text": "Das war's für heute."}, {"id": 32, "start": 476.04, "end": 478.04, "text": "Vielen Dank für's Zuschauen."}, {"id": 33, "start": 478.04, "end": 505.04, "text": "Das war's für heute."}, {"id": 34, "start": 508.04, "end": 522.04, "text": "Okay Leute, das war nötig."}, {"id": 35, "start": 522.04, "end": 527.04, "text": "Oh, jetzt kann's losgehen."}, {"id": 36, "start": 527.04, "end": 535.04, "text": "Komm mal hier, what the fuck, ich bin auf dem Klo und es gibt hier die mega Subscrip-"}, {"id": 37, "start": 535.04, "end": 539.04, "text": "a-Subscrip-kri-bierungs-Aktion."}, {"id": 38, "start": 539.04, "end": 541.04, "text": "Äh, Betai Golds hat 10 Subs gegiftet."}, {"id": 39, "start": 541.04, "end": 542.04, "text": "Dankeschön."}, {"id": 40, "start": 542.04, "end": 543.04, "text": "Wer hat denn Glück gehabt?"}, {"id": 41, "start": 543.04, "end": 544.04, "text": "Zeigt mal her."}, {"id": 42, "start": 544.04, "end": 547.04, "text": "Äh, Dankudrix kriegt was."}, {"id": 43, "start": 547.04, "end": 549.04, "text": "ShockOps Gaming."}, {"id": 44, "start": 549.04, "end": 550.04, "text": "Mochi Xp-"}, {"id": 45, "start": 550.04, "end": 552.04, "text": "Den hab ich letztens schon öfters mal gesehen."}, {"id": 46, "start": 552.04, "end": 554.04, "text": "Der Name, der kommt mir irgendwie bekannt vor."}, {"id": 47, "start": 554.04, "end": 556.04, "text": "Der hat letztens ziemlich viel im Stream rumgespammt."}, {"id": 48, "start": 556.04, "end": 558.04, "text": "Mochi hab ich auch schon mal gesehen."}, {"id": 49, "start": 558.04, "end": 559.04, "text": "Jesu-"}, {"id": 50, "start": 559.04, "end": 560.04, "text": "Jesutz-"}, {"id": 51, "start": 560.04, "end": 561.04, "text": "Chris-"}, {"id": 52, "start": 561.04, "end": 563.04, "text": "Christutz hat was gekriegt."}, {"id": 53, "start": 563.04, "end": 566.04, "text": "Nora Love Pancakes, die hab ich auch schon mal gesehen."}, {"id": 54, "start": 566.04, "end": 570.04, "text": "Ähm, Matt Weil sagt mir auch was."}, {"id": 55, "start": 570.04, "end": 571.04, "text": "Den anderen bin ich-"}, {"id": 56, "start": 571.04, "end": 573.04, "text": "Phippsen könnt ich auch mal gesehen haben, schon."}, {"id": 57, "start": 573.04, "end": 576.04, "text": "Ich bin jetzt nicht so sicher."}, {"id": 58, "start": 576.04, "end": 578.04, "text": "Was sagst du zum Amazon Firetap?"}, {"id": 59, "start": 578.04, "end": 579.04, "text": "Ja, ich find's nicht schlecht."}, {"id": 60, "start": 579.04, "end": 587.04, "text": "Also es ist für ein ultra, ultra, ultra low-end Tablet ganz okay."}, {"id": 61, "start": 587.04, "end": 591.04, "text": "Naja, wenn du kein Gerät mit Google Play willst, dann willst du wahrscheinlich auch"}, {"id": 62, "start": 591.04, "end": 594.04, "text": "kein Gerät mit Google App Store, äh, mit Amazon App Store drauf."}, {"id": 63, "start": 594.04, "end": 597.04, "text": "Das beste, was du machen kannst mit den Firetablets ist,"}, {"id": 64, "start": 597.04, "end": 601.04, "text": "die Dinger, ich weiß nicht, ob man die aktuell noch flashen kann."}, {"id": 65, "start": 601.04, "end": 605.04, "text": "Da bin ich mir nicht so sicher."}, {"id": 66, "start": 605.04, "end": 615.04, "text": "Aber du kannst sie auf jeden Fall deploaten mit der Amazon Fire Toolbox."}, {"id": 67, "start": 615.04, "end": 618.04, "text": "Und dann kannst du dann auch APK sideloaden und so was."}, {"id": 68, "start": 618.04, "end": 620.04, "text": "Also, ganz im Ernst,"}, {"id": 69, "start": 620.04, "end": 625.04, "text": "ich finde das Firetablet ist zwar ein richtig preisleistungsmäßig gutes Tablet"}, {"id": 70, "start": 625.04, "end": 629.04, "text": "für low, low, low-end, aber zum täglichen Arbeiten,"}, {"id": 71, "start": 629.04, "end": 632.04, "text": "oder was heißt Arbeiten, zum täglichen Benutzen."}, {"id": 72, "start": 632.04, "end": 638.04, "text": "Ich weiß nicht, zumal das Display jetzt zum Video schauen auch nicht so wahnsinnig geiles."}, {"id": 73, "start": 638.04, "end": 642.04, "text": "Also ich hab hier selbst mehrere Firetablets,"}, {"id": 74, "start": 642.04, "end": 644.04, "text": "aber die hab ich nicht interaktiv im Einsatz."}, {"id": 75, "start": 644.04, "end": 649.04, "text": "Die hab ich oben und unten im Flur hängen als Home Automation Dashboards."}, {"id": 76, "start": 649.04, "end": 650.04, "text": "Dafür sind sie gut."}, {"id": 77, "start": 650.04, "end": 655.04, "text": "Die machen aber auch nichts anderes, als ein Firefox offen haben den ganzen Tag."}, {"id": 78, "start": 655.04, "end": 658.04, "text": "Und mit der Kamera erkenne ich, ob einer da vorsteht."}, {"id": 79, "start": 658.04, "end": 663.04, "text": "Da gibt es glücklicherweise für Android bessere Automatisierungsmöglichkeiten als iPads."}, {"id": 80, "start": 663.04, "end": 667.04, "text": "Hol dir doch ein neues iPad, so teuer sind die Dinger doch gar nicht."}, {"id": 81, "start": 667.04, "end": 672.04, "text": "Was kostet ein neues iPad, 400 Euro?"}, {"id": 82, "start": 672.04, "end": 677.04, "text": "Ich mein, dafür hast du wenigstens auch was mit Wumms."}, {"id": 83, "start": 677.04, "end": 679.04, "text": "Oder 300?"}, {"id": 84, "start": 679.04, "end": 682.04, "text": "Ich würd mir einfach ein neues iPad, ganz normales holen."}, {"id": 85, "start": 682.04, "end": 686.04, "text": "Kein eher, kein sonst was, einfach ganz normales iPad."}, {"id": 86, "start": 686.04, "end": 689.04, "text": "Guck mal hier, zeig mal was kostender Kram."}, {"id": 87, "start": 689.04, "end": 691.04, "text": "Nee, nee, die sind nicht teuer."}, {"id": 88, "start": 691.04, "end": 695.04, "text": "Die iPads sind, finde ich generell, Tablets kann Android nicht mithalten."}, {"id": 89, "start": 695.04, "end": 697.04, "text": "Smartphones kann man sich drüber streiten,"}, {"id": 90, "start": 697.04, "end": 702.04, "text": "aber bei Tablets, ja hier 379 oder so, war ich doch mit 400 Euro gar nicht."}, {"id": 91, "start": 702.04, "end": 706.04, "text": "Gut, die Minis gibt's doch, wobei die sind noch billiger, äh, noch teurer."}, {"id": 92, "start": 706.04, "end": 709.04, "text": "Nee, kostet gerade 79, also ich finde ganz ehrlich,"}, {"id": 93, "start": 709.04, "end": 712.04, "text": "und dann hast du wenigstens auch was mit Wumms, das hast du die nächsten Jahre über"}, {"id": 94, "start": 712.04, "end": 714.04, "text": "und das die nächsten Jahre auch noch schnell."}, {"id": 95, "start": 721.04, "end": 722.04, "text": "Ja, die zeigen Firefox an."}, {"id": 96, "start": 722.04, "end": 725.04, "text": "Also ich sehe nur Firefox, die zeigen mein Home Automation Dashboard,"}, {"id": 97, "start": 725.04, "end": 727.04, "text": "also mein Home Assistant Dashboard an."}, {"id": 98, "start": 727.04, "end": 730.04, "text": "Im Fullscreen, die gehen aus nach ein paar Minuten"}, {"id": 99, "start": 730.04, "end": 734.04, "text": "und ich hab, ich kann euch alleine nicht sagen, wie das heißt."}, {"id": 100, "start": 734.04, "end": 740.04, "text": "Ähm, ich hab da so eine App drauf, die erkennt, wenn man davor steht, über die Kamera."}, {"id": 101, "start": 740.04, "end": 744.04, "text": "Ich bin mir, ich bin mir nicht mehr sicher, wie das Ding hieß."}, {"id": 102, "start": 744.04, "end": 750.04, "text": "Es kann auch sein, dass das in diesem Kiosk-Browser, den ich mal installiert hab,"}, {"id": 103, "start": 750.04, "end": 754.04, "text": "dabei war, wobei ich, wie gesagt, Firefox jetzt,"}, {"id": 104, "start": 754.04, "end": 756.04, "text": "im Fullscreen hab."}, {"id": 105, "start": 756.04, "end": 758.04, "text": "Ähm, ich weiß nicht mehr, wie das Ding hieß."}, {"id": 106, "start": 758.04, "end": 761.04, "text": "Zumindest ist das eine App, die checkt halt den Kamerainput"}, {"id": 107, "start": 761.04, "end": 765.04, "text": "und wenn man davor steht, schaltet das Tablet, macht das Display an und entsperrt sich."}, {"id": 108, "start": 765.04, "end": 767.04, "text": "Das geht aber alles nur in der Android."}, {"id": 109, "start": 767.04, "end": 769.04, "text": "Also generell, das ist der Vorteil von Android,"}, {"id": 110, "start": 769.04, "end": 774.04, "text": "wenn du so Automatisierungs-Sachen machen willst, ist es einfach viel, viel besser als unter iOS."}, {"id": 111, "start": 774.04, "end": 776.04, "text": "Apple erlaubt halt vieles nicht."}, {"id": 112, "start": 776.04, "end": 781.04, "text": "Dafür, ja, ist es halt auch für jeden eine Hinz- und Kunst zu benutzen."}, {"id": 113, "start": 786.04, "end": 787.04, "text": "Ja, die sind mit Sicherheit günstiger."}, {"id": 114, "start": 787.04, "end": 791.04, "text": "Die ganzen, also, das ist eh eines der wenigen Sachen, die sich je, bei jedem..."}, {"id": 115, "start": 793.04, "end": 794.04, "text": "Guck mal."}, {"id": 116, "start": 794.04, "end": 796.04, "text": "Was sich bei jedem Prime day lohnt, ist..."}, {"id": 117, "start": 798.04, "end": 799.04, "text": "Wait a minute."}, {"id": 118, "start": 808.04, "end": 810.04, "text": "Muss man sich dafür einloggen?"}, {"id": 119, "start": 810.04, "end": 811.04, "text": "Nee, oder?"}, {"id": 120, "start": 811.04, "end": 813.04, "text": "Angucken kann man sich's auch so."}, {"id": 121, "start": 813.04, "end": 815.04, "text": "Weil ich hab meinen Login jetzt nicht hier."}, {"id": 122, "start": 815.04, "end": 817.04, "text": "Für Amazon."}, {"id": 123, "start": 819.04, "end": 820.04, "text": "Okay, angucken kann man sich auch..."}, {"id": 124, "start": 820.04, "end": 823.04, "text": "Es wäre ja auch blöd, wenn du dir das nicht angucken kannst."}, {"id": 125, "start": 823.04, "end": 824.04, "text": "Wenn du..."}, {"id": 126, "start": 824.04, "end": 828.04, "text": "Weil die wollen den Leuten ja irgendwie dazu verleihen."}, {"id": 127, "start": 828.04, "end": 830.04, "text": "Guck mal, hier hast du die Dinger."}, {"id": 128, "start": 830.04, "end": 831.04, "text": "Das sind doch die ganzen Tablets."}, {"id": 129, "start": 832.04, "end": 833.04, "text": "Fire HD 10."}, {"id": 130, "start": 833.04, "end": 835.04, "text": "Das ist teurer geworden."}, {"id": 131, "start": 835.04, "end": 837.04, "text": "Warte mal, ich muss mal kurz bei mir aufs Handy..."}, {"id": 132, "start": 837.04, "end": 838.04, "text": "Wo ist mein Handy?"}, {"id": 133, "start": 839.04, "end": 840.04, "text": "Hä, wo ist mein Handy?"}, {"id": 134, "start": 840.04, "end": 842.04, "text": "Oh, das hab ich aufm Klo vergessen."}, {"id": 135, "start": 842.04, "end": 843.04, "text": "Ich bin gleich wieder da."}, {"id": 136, "start": 863.04, "end": 864.04, "text": "Okay, cool."}, {"id": 137, "start": 866.04, "end": 868.04, "text": "So, klassisch Handy-Klovergel."}, {"id": 138, "start": 868.04, "end": 869.04, "text": "Klar, kennt ihr das nicht."}, {"id": 139, "start": 869.04, "end": 871.04, "text": "Ich vergess öfters mein Handy aufm Klo."}, {"id": 140, "start": 873.04, "end": 875.04, "text": "So, ich guck jetzt nämlich mal kurz bei Amazon,"}, {"id": 141, "start": 875.04, "end": 878.04, "text": "für wie viel ich das mir vor ein paar Jahren gekauft hab."}, {"id": 142, "start": 878.04, "end": 880.04, "text": "Das ist natürlich andere Generation."}, {"id": 143, "start": 881.04, "end": 882.04, "text": "Aber macht ja nichts."}, {"id": 144, "start": 882.04, "end": 884.04, "text": "Mal kurz gucken, wie sich da die Preise entwickelt haben."}, {"id": 145, "start": 885.04, "end": 886.04, "text": "Fire."}, {"id": 146, "start": 891.04, "end": 894.04, "text": "Fire HD 8, Fire HD 10 hab ich gekauft."}, {"id": 147, "start": 894.04, "end": 895.04, "text": "Zwei Stück."}, {"id": 148, "start": 895.04, "end": 897.04, "text": "Order Details."}, {"id": 149, "start": 897.04, "end": 899.04, "text": "Damals haben die gekostet..."}, {"id": 150, "start": 899.04, "end": 900.04, "text": "Oh, das ist günstiger geworden."}, {"id": 151, "start": 900.04, "end": 901.04, "text": "Damals hab ich..."}, {"id": 152, "start": 901.04, "end": 902.04, "text": "Ach, Moment."}, {"id": 153, "start": 902.04, "end": 905.04, "text": "Zwei Stück für 99."}, {"id": 154, "start": 905.04, "end": 906.04, "text": "Ach nee, jeweils."}, {"id": 155, "start": 906.04, "end": 909.04, "text": "99 Euro haben die damals noch gekostet."}, {"id": 156, "start": 909.04, "end": 911.04, "text": "Und jetzt kostet es mal Prime 79."}, {"id": 157, "start": 911.04, "end": 913.04, "text": "Das ist tatsächlich ganz okay."}, {"id": 158, "start": 913.04, "end": 915.04, "text": "Also, wenn man sowas haben möchte, wie gesagt,"}, {"id": 159, "start": 915.04, "end": 919.04, "text": "als Tablet zum täglichen Benutzen,"}, {"id": 160, "start": 919.04, "end": 921.04, "text": "finde ich es jetzt persönlich nicht so,"}, {"id": 161, "start": 921.04, "end": 924.04, "text": "dass man so ein Tablet zum täglichen Benutzen"}, {"id": 162, "start": 924.04, "end": 926.04, "text": "finde ich es jetzt persönlich nicht so geil."}, {"id": 163, "start": 926.04, "end": 929.04, "text": "Aber wenn man beispielsweise ein Dashboard braucht"}, {"id": 164, "start": 929.04, "end": 931.04, "text": "oder man sich ein..."}, {"id": 165, "start": 931.04, "end": 933.04, "text": "Ich-Bilder-Rahmen-Wünscht in der Richtung"}, {"id": 166, "start": 933.04, "end": 935.04, "text": "zum Sachen anzeigen oder so."}, {"id": 167, "start": 935.04, "end": 937.04, "text": "Also, für so..."}, {"id": 168, "start": 938.04, "end": 939.04, "text": "nicht..."}, {"id": 169, "start": 940.04, "end": 943.04, "text": "viel mit dem Finger drauf rumgetatschte interaktive Sachen"}, {"id": 170, "start": 943.04, "end": 944.04, "text": "sind die Dinger gut."}, {"id": 171, "start": 944.04, "end": 946.04, "text": "Weil das ist eben Android drunter."}, {"id": 172, "start": 946.04, "end": 949.04, "text": "Und Android kannst du einfach deutlich besser automatisieren"}, {"id": 173, "start": 949.04, "end": 954.04, "text": "und Dinger mitmachen als iOS."}, {"id": 174, "start": 954.04, "end": 955.04, "text": "Ja, deswegen."}, {"id": 175, "start": 955.04, "end": 956.04, "text": "Dafür kann man es empfehlen."}, {"id": 176, "start": 956.04, "end": 957.04, "text": "Ansonsten..."}, {"id": 177, "start": 957.04, "end": 958.04, "text": "Ich weiß nicht."}, {"id": 178, "start": 958.04, "end": 962.04, "text": "Nee, ansonsten nicht."}, {"id": 179, "start": 962.04, "end": 963.04, "text": "Externe Platten."}, {"id": 180, "start": 963.04, "end": 964.04, "text": "Ja, ich könnte tatsächlich..."}, {"id": 181, "start": 964.04, "end": 965.04, "text": "Jetzt gucken wir."}, {"id": 182, "start": 965.04, "end": 966.04, "text": "Gucken wir gleich mal."}, {"id": 183, "start": 966.04, "end": 969.04, "text": "Ich könnte auch wirklich noch eine externe Platte gebrauchen."}, {"id": 184, "start": 969.04, "end": 973.04, "text": "Richtig fette externe Platte könnte ich gebrauchen."}, {"id": 185, "start": 973.04, "end": 975.04, "text": "Pepo."}, {"id": 186, "start": 975.04, "end": 976.04, "text": "Fett."}, {"id": 187, "start": 976.04, "end": 980.04, "text": "Platte."}, {"id": 188, "start": 980.04, "end": 983.04, "text": "Ja, aber da will ich mal ein bisschen Smart Home gucken."}, {"id": 189, "start": 983.04, "end": 985.04, "text": "Und ich brauche auf jeden Fall noch..."}, {"id": 190, "start": 985.04, "end": 986.04, "text": "Da muss ich nämlich gleich..."}, {"id": 191, "start": 986.04, "end": 987.04, "text": "Das müssen wir gleich mal hier."}, {"id": 192, "start": 987.04, "end": 990.04, "text": "Prime Day."}, {"id": 193, "start": 990.04, "end": 992.04, "text": "Vielleicht gibt es da einen."}, {"id": 194, "start": 992.04, "end": 993.04, "text": "Kützig."}, {"id": 195, "start": 993.04, "end": 998.04, "text": "Ich meine, wer weiß, wie knapp das Gas wird im Winter."}, {"id": 196, "start": 998.04, "end": 1003.04, "text": "Na, so zwei Radiatoren schaden da nicht, wenn man mal welche hat."}, {"id": 197, "start": 1003.04, "end": 1005.04, "text": "Aber das ist alles Crap."}, {"id": 198, "start": 1005.04, "end": 1006.04, "text": "Die will man nicht haben."}, {"id": 199, "start": 1006.04, "end": 1013.04, "text": "Ich will so einen klassischen Öl-Radiator haben."}, {"id": 200, "start": 1013.04, "end": 1019.04, "text": "Nur falls es wirklich im Winter mit Gas nichts wird."}, {"id": 201, "start": 1019.04, "end": 1021.04, "text": "Ich muss euch jetzt mal ehrlich sagen."}, {"id": 202, "start": 1021.04, "end": 1025.04, "text": "Dieses Rumgemache mit Hilfe im Winter wird es kalt und so."}, {"id": 203, "start": 1025.04, "end": 1032.04, "text": "Also, es gibt da zwei Sachen, die sich so..."}, {"id": 204, "start": 1032.04, "end": 1033.04, "text": "Ich weiß, die widersprechen sich."}, {"id": 205, "start": 1033.04, "end": 1035.04, "text": "Die widersprechen sich."}, {"id": 206, "start": 1035.04, "end": 1040.04, "text": "Aber zwei Sachen, die mir da so durch den Kopf rumschweren."}, {"id": 207, "start": 1040.04, "end": 1046.04, "text": "Das erste ist, es wurde ja noch von nicht allzu langer Zeit öfters demonstriert."}, {"id": 208, "start": 1046.04, "end": 1050.04, "text": "So nach dem Motto, Energie sparen und auch beim Kalten daheim sitzen."}, {"id": 209, "start": 1050.04, "end": 1054.04, "text": "Ich meine, okay, so haben sich die Leute wahrscheinlich nicht vorgestellt."}, {"id": 210, "start": 1054.04, "end": 1059.04, "text": "Und das zweite ist, ich finde es ein absolutes..."}, {"id": 211, "start": 1059.04, "end": 1066.04, "text": "Also, wenn das wirklich dazu kommt, dass Leute ihre Häuser nicht heizen können in Deutschland,"}, {"id": 212, "start": 1066.04, "end": 1068.04, "text": "dann..."}, {"id": 213, "start": 1068.04, "end": 1070.04, "text": "Es wird wahrscheinlich keine Konsequenzen haben."}, {"id": 214, "start": 1070.04, "end": 1074.04, "text": "Aber das ist ein komplettes Versagen auf ganzer Ebene."}, {"id": 215, "start": 1074.04, "end": 1075.04, "text": "Ich meine, überlegt euch mal."}, {"id": 216, "start": 1075.04, "end": 1082.04, "text": "Es gibt außer drei weitere Länder auf der ganzen Welt."}, {"id": 217, "start": 1082.04, "end": 1087.04, "text": "Drei weitere Länder auf der ganzen Welt haben mehr Geld als wir."}, {"id": 218, "start": 1087.04, "end": 1094.04, "text": "Wie kann es sein, dass wir ernsthaft Probleme bekommen,"}, {"id": 219, "start": 1094.04, "end": 1099.04, "text": "dass wir als viertreichtes Land der Welt im Winter eventuell frieren müssen?"}, {"id": 220, "start": 1099.04, "end": 1103.04, "text": "The fuck?"}, {"id": 221, "start": 1103.04, "end": 1107.04, "text": "Da stimmt doch irgendwas nicht."}, {"id": 222, "start": 1107.04, "end": 1110.04, "text": "Also, das ist echt auf ganzer Linie verschissen, Alter."}, {"id": 223, "start": 1110.04, "end": 1114.04, "text": "Das kann nicht sein."}, {"id": 224, "start": 1114.04, "end": 1119.04, "text": "Einfach Winterjacke anziehen."}, {"id": 225, "start": 1119.04, "end": 1126.04, "text": "Ja, aber ich habe eh keine Probleme im Winter mit Temperaturen."}, {"id": 226, "start": 1126.04, "end": 1129.04, "text": "Weil ich habe die Klimaanlage hier im Arbeitszimmer."}, {"id": 227, "start": 1129.04, "end": 1131.04, "text": "Die kann auch heizen, drüben im Schlafzimmer."}, {"id": 228, "start": 1131.04, "end": 1134.04, "text": "Die Klimaanlage, ich habe genug Heizlüfter."}, {"id": 229, "start": 1134.04, "end": 1139.04, "text": "Ich habe mir letztens noch einen Heizlüfter gekauft."}, {"id": 230, "start": 1139.04, "end": 1141.04, "text": "Also, ich habe da keine Probleme mit."}, {"id": 231, "start": 1141.04, "end": 1146.04, "text": "Aber ich weiß ja auch nicht, da kenne ich mich tatsächlich zu wenig aus."}, {"id": 232, "start": 1146.04, "end": 1149.04, "text": "Wenn wir wirklich Probleme kriegen, was Gas und sowas angeht."}, {"id": 233, "start": 1149.04, "end": 1152.04, "text": "Ob wir da nicht vielleicht auch Probleme mit Stromversorgung bekommen?"}, {"id": 234, "start": 1152.04, "end": 1154.04, "text": "Keine Ahnung."}, {"id": 235, "start": 1154.04, "end": 1156.04, "text": "Prime Sub, Prime Day, excellent."}, {"id": 236, "start": 1156.04, "end": 1159.04, "text": "Das dürfte wahrscheinlich das Beste am ganzen Prime Days sein."}, {"id": 237, "start": 1159.04, "end": 1160.04, "text": "Aber das kann echt nicht sein."}, {"id": 238, "start": 1160.04, "end": 1163.04, "text": "Es kann wirklich nicht sein, dass wir als viertreiches Land"}, {"id": 239, "start": 1163.04, "end": 1175.04, "text": "uns ernsthaft Gedanken machen sollen, ob wir frieren."}, {"id": 240, "start": 1175.04, "end": 1186.04, "text": "Und ich denke sogar, dass man das gar nicht so sehr auf eine Sache zeigen kann."}, {"id": 241, "start": 1186.04, "end": 1190.04, "text": "Ich gehe einfach davon aus, dass die letzten 16 oder 20 Jahre"}, {"id": 242, "start": 1190.04, "end": 1194.04, "text": "über ganz viele Dinge verkackt wurden,"}, {"id": 243, "start": 1194.04, "end": 1198.04, "text": "dass es jetzt am Ende unterm Strich zu sowas kommt."}, {"id": 244, "start": 1198.04, "end": 1201.04, "text": "Sicherlich hat vielleicht die aktuelle Regierung auch was zu beigetragen,"}, {"id": 245, "start": 1201.04, "end": 1207.04, "text": "aber ich denke mal, dass die da gar nicht mal so viel Einfluss drauf hatten."}, {"id": 246, "start": 1207.04, "end": 1211.04, "text": "Aber trotzdem, es ist mir ehrlich gesagt scheißegal, wer dran schuld ist."}, {"id": 247, "start": 1211.04, "end": 1215.04, "text": "Es ist mir vollkommen egal."}, {"id": 248, "start": 1215.04, "end": 1222.04, "text": "Ich will, dass es im Winter warm ist."}, {"id": 249, "start": 1222.04, "end": 1226.04, "text": "Aber da hat wahrscheinlich jeder andere Ansicht, woran das jetzt liegt."}, {"id": 250, "start": 1226.04, "end": 1228.04, "text": "Letztendlich, ich sage euch ganz ehrlich, mir ist es scheißegal,"}, {"id": 251, "start": 1228.04, "end": 1232.04, "text": "ich will, dass es im Winter warm ist."}, {"id": 252, "start": 1232.04, "end": 1234.04, "text": "Und es kann nicht sein, dass wir als viertreiches Land der Welt"}, {"id": 253, "start": 1234.04, "end": 1240.04, "text": "uns wirklich Gedanken machen müssen, ob Leute frieren im Winter."}, {"id": 254, "start": 1240.04, "end": 1241.04, "text": "Das ist genau das, was ich mir auch denke."}, {"id": 255, "start": 1241.04, "end": 1245.04, "text": "Mir ist es scheißegal, macht euren Job, wofür ihr da seid."}, {"id": 256, "start": 1245.04, "end": 1257.04, "text": "Das, was ich auch jeden Tag mache, wo ich 40 plus Prozent davon abgeben muss."}, {"id": 257, "start": 1257.04, "end": 1261.04, "text": "Also macht halt was Gescheites damit."}, {"id": 258, "start": 1261.04, "end": 1264.04, "text": "Das Video mit den letzten Encrypt-Zertifikaten hat super geholfen."}, {"id": 259, "start": 1264.04, "end": 1272.04, "text": "DNS-Rebindschutz und DNS-Rewrite waren noch zwei Dinge, die notwendig waren."}, {"id": 260, "start": 1272.04, "end": 1278.04, "text": "Warst du der mit dem Power-DNS?"}, {"id": 261, "start": 1278.04, "end": 1280.04, "text": "Nee, du warst jemand anderes, oder?"}, {"id": 262, "start": 1280.04, "end": 1285.04, "text": "Ich komme manchmal ein bisschen durcheinander bei den ganzen Fragen in den Streams."}, {"id": 263, "start": 1285.04, "end": 1293.04, "text": "Du warst nicht der mit dem Power-DNS, oder?"}, {"id": 264, "start": 1293.04, "end": 1300.04, "text": "Nee, du hast nach dem Let's Encrypt-Wort gefragt."}, {"id": 265, "start": 1300.04, "end": 1302.04, "text": "Das schon gesehen."}, {"id": 266, "start": 1302.04, "end": 1304.04, "text": "Ich muss das mal am zweiten Bildschirm aufmachen,"}, {"id": 267, "start": 1304.04, "end": 1311.04, "text": "weil ich immer nicht weiß, was dahinter steckt."}, {"id": 268, "start": 1311.04, "end": 1315.04, "text": "Ja, das verfolge ich schon ganz lange."}, {"id": 269, "start": 1315.04, "end": 1320.04, "text": "Die hatten letztens einen Playtest."}, {"id": 270, "start": 1320.04, "end": 1326.04, "text": "Haben die das jetzt wirklich released?"}, {"id": 271, "start": 1326.04, "end": 1334.04, "text": "Ich verfolge das schon seit Jahren im Discord, den BF3-Reality-Mod."}, {"id": 272, "start": 1334.04, "end": 1337.04, "text": "Haben die das jetzt released?"}, {"id": 273, "start": 1337.04, "end": 1342.04, "text": "Dann muss ich mir das tatsächlich mal anschauen."}, {"id": 274, "start": 1342.04, "end": 1347.04, "text": "Das letzte Mal habe ich nämlich gesehen, dass die für Influencers"}, {"id": 275, "start": 1347.04, "end": 1350.04, "text": "einen internen Playtest hatten."}, {"id": 276, "start": 1350.04, "end": 1358.04, "text": "Ich habe mir schon überlegt, ob ich mich anmelden soll."}, {"id": 277, "start": 1358.04, "end": 1367.04, "text": "Das müssen wir uns tatsächlich mal angucken."}, {"id": 278, "start": 1367.04, "end": 1372.04, "text": "Was ist deine Meinung zu Red Hat Enterprise Linux?"}, {"id": 279, "start": 1372.04, "end": 1374.04, "text": "Meinst du jetzt zur Distribution?"}, {"id": 280, "start": 1374.04, "end": 1377.04, "text": "Oder ob man sich das kaufen sollte?"}, {"id": 281, "start": 1377.04, "end": 1380.04, "text": "Weil die Distribution ist im Enterprise-Umfeld"}, {"id": 282, "start": 1380.04, "end": 1384.04, "text": "eigentlich das mit das beliebteste."}, {"id": 283, "start": 1384.04, "end": 1388.04, "text": "Aber kaufen, nein, weil viel zu teuer."}, {"id": 284, "start": 1388.04, "end": 1390.04, "text": "Du kannst aber Nachbauten verwenden."}, {"id": 285, "start": 1390.04, "end": 1395.04, "text": "Früher war CentOS, jetzt ist es Rocky Linux."}, {"id": 286, "start": 1395.04, "end": 1399.04, "text": "Aber das ist leider nicht mehr das, was es mal vor ein paar Jahren war,"}, {"id": 287, "start": 1399.04, "end": 1401.04, "text": "weil Red Hat da keinen Bock mehr drauf hat."}, {"id": 288, "start": 1401.04, "end": 1404.04, "text": "Es war eine super Alternative."}, {"id": 289, "start": 1404.04, "end": 1408.04, "text": "Ansonsten, ganz ehrlich, ich persönlich würde es nicht verwenden."}, {"id": 290, "start": 1408.04, "end": 1413.04, "text": "Wenn ich eines der größeren Enterprise-Distributionen verwenden will,"}, {"id": 291, "start": 1413.04, "end": 1414.04, "text": "dann würde ich Ubuntu."}, {"id": 292, "start": 1414.04, "end": 1419.04, "text": "Da ist ja meistens wichtig, dass es Support gibt und Updates und LTS-Garantien."}, {"id": 293, "start": 1419.04, "end": 1421.04, "text": "Dann würde ich irgendeinen Ubuntu-LTS nehmen."}, {"id": 294, "start": 1421.04, "end": 1424.04, "text": "Ja, Red Hat hat, glaube ich, längeren Support."}, {"id": 295, "start": 1424.04, "end": 1427.04, "text": "Ich glaube, Red Hat hat 10 Jahre oder so ab Release."}, {"id": 296, "start": 1427.04, "end": 1429.04, "text": "Ubuntu hat LTS plus 5 Jahre."}, {"id": 297, "start": 1429.04, "end": 1433.04, "text": "Aber ganz im Ernst, du willst kein 10 Jahre als Linux verwenden,"}, {"id": 298, "start": 1433.04, "end": 1435.04, "text": "auch wenn es 10 Jahre supportet wird."}, {"id": 299, "start": 1435.04, "end": 1438.04, "text": "By the way, ratet mal, was wir auf der Arbeit intern"}, {"id": 300, "start": 1438.04, "end": 1442.04, "text": "auf ganz viele Linux-Server verwenden, so auf ca. 2000 Stück."}, {"id": 301, "start": 1442.04, "end": 1446.04, "text": "Da kommt ihr nie drauf, weil ich gerade gesagt habe,"}, {"id": 302, "start": 1446.04, "end": 1449.04, "text": "man sollte ein Linux keine 10 Jahre verwenden."}, {"id": 303, "start": 1449.04, "end": 1455.04, "text": "Aber wir verwenden CentOS 7 an vielen Stellen noch."}, {"id": 304, "start": 1455.04, "end": 1458.04, "text": "Ein CentOS 7, das aktuelle CentOS."}, {"id": 305, "start": 1458.04, "end": 1460.04, "text": "Ein CentOS 4 haben wir tatsächlich auch noch,"}, {"id": 306, "start": 1460.04, "end": 1461.04, "text": "habe ich letztens gefunden."}, {"id": 307, "start": 1461.04, "end": 1464.04, "text": "Das ist irgendein so uralt wahren Wirtschaftssystem,"}, {"id": 308, "start": 1464.04, "end": 1467.04, "text": "was ausgeschaltet ist und nur 2-mal im Jahr eingeschaltet werden muss."}, {"id": 309, "start": 1467.04, "end": 1472.04, "text": "Das ist ein CentOS 4 von 2008 oder so."}, {"id": 310, "start": 1472.04, "end": 1475.04, "text": "CentOS 8 ist nicht verfügbar, ja, das haben sie abgeblasen."}, {"id": 311, "start": 1475.04, "end": 1479.04, "text": "Aber CentOS 7 wird bis zum End of Life supported."}, {"id": 312, "start": 1479.04, "end": 1484.04, "text": "Wobei ich sagen muss, das System, was wir haben mit CentOS 4,"}, {"id": 313, "start": 1484.04, "end": 1488.04, "text": "ist eigentlich ein CentOS 5, was sich als CentOS 4 ausgibt."}, {"id": 314, "start": 1491.04, "end": 1493.04, "text": "Wer das nicht versteht, macht nichts."}, {"id": 315, "start": 1493.04, "end": 1496.04, "text": "Ich verstehe das auch nicht so genau, aber es ist so."}, {"id": 316, "start": 1496.04, "end": 1499.04, "text": "Ja, stimmt, ich erinnere mich wieder."}, {"id": 317, "start": 1499.04, "end": 1504.04, "text": "FEDORA"}, {"id": 318, "start": 1510.04, "end": 1514.04, "text": "Ne, Fedora, ganz ehrlich ich mag"}, {"id": 319, "start": 1516.04, "end": 1520.04, "text": "eigentlich so gut wie keine RPM basierte Distributionen."}, {"id": 320, "start": 1520.04, "end": 1521.04, "text": "Ja ey, wir fahren auf der Arbeit CentOS."}, {"id": 321, "start": 1521.04, "end": 1524.04, "text": "Ich kenne mich damit gut, das macht eigentlich keinen Unterschied."}, {"id": 322, "start": 1524.04, "end": 1525.04, "text": "Linux ist Linux."}, {"id": 323, "start": 1525.04, "end": 1532.66, "text": "Ob du da jetzt ein Ab drauf hast, ein Pacman drauf hast oder ein Yam-DNF drauf hast, das"}, {"id": 324, "start": 1532.66, "end": 1533.82, "text": "ist eigentlich ziemlich egal."}, {"id": 325, "start": 1533.82, "end": 1538.82, "text": "Richtig, so ist es, historisch gewachsen."}, {"id": 326, "start": 1538.82, "end": 1542.86, "text": "So, also, wir gucken jetzt mal ein bisschen bei Amazon rein."}, {"id": 327, "start": 1542.86, "end": 1545.62, "text": "Also Radiatoren gibt es nicht, habe ich schon gesehen."}, {"id": 328, "start": 1545.62, "end": 1552.26, "text": "Es gibt Ventile, die, warum auch immer, Ventile sind und da verkauft werden."}, {"id": 329, "start": 1552.26, "end": 1559.16, "text": "Wir schauen mal und zwar, also, wir gucken mal nach externen Festplatten, das wird mich"}, {"id": 330, "start": 1559.16, "end": 1564.22, "text": "tatsächlich interessieren und jetzt wo wir gerade dabei sind, BF3 Reality Mod, haben"}, {"id": 331, "start": 1564.22, "end": 1565.22, "text": "die das jetzt released?"}, {"id": 332, "start": 1565.22, "end": 1572.14, "text": "Ach tatsächlich, haben sie es jetzt geschafft?"}, {"id": 333, "start": 1572.14, "end": 1577.86, "text": "Ich verfolge die seit Jahren schon im Discord."}, {"id": 334, "start": 1577.86, "end": 1582.62, "text": "Das hat übrigens nichts mit Battlefield 2 Reality Mod zu tun, das sind andere Leute."}, {"id": 335, "start": 1582.62, "end": 1603.06, "text": "Ja, ich werde es mir auf jeden Fall angucken."}, {"id": 336, "start": 1603.06, "end": 1613.3, "text": "Ich kann mir nicht vorstellen, dass Battlefield 3 so auf Superrealismus richtig gut funktioniert,"}, {"id": 337, "start": 1613.3, "end": 1615.9, "text": "aber ich gucke es mir an."}, {"id": 338, "start": 1615.9, "end": 1621.18, "text": "Du hast heute einen Ausbildungsvertrag unterschrieben."}, {"id": 339, "start": 1621.18, "end": 1623.7, "text": "Ach nee, das mit dem Heute war eins unten drunter."}, {"id": 340, "start": 1623.7, "end": 1630.98, "text": "Ausbildungsvertrag unterschrieben, 1057 Euro erstes Ausbildungsjahr ist wild, ich kann"}, {"id": 341, "start": 1630.98, "end": 1632.98, "text": "es überhaupt nicht beurteilen, ob das wild ist."}, {"id": 342, "start": 1632.98, "end": 1634.3, "text": "Das stimmt aber auf jeden Fall nicht schlecht."}, {"id": 343, "start": 1634.3, "end": 1640.34, "text": "Ich überlege nämlich gerade, was ich im ersten Ausbildungsjahr bekommen habe, es war auf"}, {"id": 344, "start": 1640.34, "end": 1644.18, "text": "jeden Fall nicht so viel, das kann ich dir sagen, aber bei mir ist das ja auch schon"}, {"id": 345, "start": 1644.18, "end": 1645.38, "text": "etwas länger her."}, {"id": 346, "start": 1645.38, "end": 1651.14, "text": "Ich glaube, ich habe 600 Euro oder irgendwie sowas gekriegt im ersten Ausbildungsjahr."}, {"id": 347, "start": 1651.14, "end": 1662.02, "text": "Du kannst nur hoffen, dass du nach der Ausbildung dann, also, dass es dann nicht nur minimal"}, {"id": 348, "start": 1662.02, "end": 1666.26, "text": "steigt nach der Ausbildung, dann freust du dich jetzt und nach der Ausbildung kommen"}, {"id": 349, "start": 1666.26, "end": 1672.54, "text": "sie an, ja, also Frau Kali, sie sind doch bestimmt mit 1300 Euro im Monat zufrieden"}, {"id": 350, "start": 1672.54, "end": 1678.94, "text": "und dann sagst du dann, naja, gut, nee, dann gehe ich woanders hin, sind was sind eigentlich"}, {"id": 351, "start": 1678.94, "end": 1679.94, "text": "drei?"}, {"id": 352, "start": 1679.94, "end": 1696.66, "text": "Ehe woanders hin, ja, dann ist egal."}, {"id": 353, "start": 1696.66, "end": 1699.9, "text": "Ganz viele Leute haben sich anscheinend ein Tablet bestellt, war schon Thema hier gerade"}, {"id": 354, "start": 1699.9, "end": 1700.9, "text": "vor ein paar Minuten."}, {"id": 355, "start": 1700.9, "end": 1704.14, "text": "Gibt es eine Playlist, ja?"}, {"id": 356, "start": 1704.14, "end": 1713.38, "text": "Relaxing and calming music from Super Mario Series, die lauter können wir schon noch"}, {"id": 357, "start": 1713.38, "end": 1727.98, "text": "machen, weil ist eigentlich laut genug, das ist bloß der eine Track, der so langsam ist,"}, {"id": 358, "start": 1727.98, "end": 1733.7, "text": "also ich habe mir überlegt, ob ich verkürze, stand ja bei mir damals auch zur Diskussion,"}, {"id": 359, "start": 1733.7, "end": 1738.5, "text": "ich habe absichtlich gesagt, ich verkürze meine Ausbildung nicht und wisst ihr warum?"}, {"id": 360, "start": 1738.5, "end": 1742.58, "text": "Weil ich einfach nur ultra faul bin und ich wollte noch ein bisschen Däumchen drehen"}, {"id": 361, "start": 1742.58, "end": 1744.34, "text": "in der Berufsschule und nichts machen."}, {"id": 362, "start": 1744.34, "end": 1751.62, "text": "Geld hat mir damals schon gereicht, wie gesagt, ihr kennt mich, ich gebe ja nichts aus, deswegen"}, {"id": 363, "start": 1751.62, "end": 1755.82, "text": "ist gut, dass ich trotz beschissener Stonks Kurse dieses Jahr endlich mal angefangen"}, {"id": 364, "start": 1755.82, "end": 1761.02, "text": "habe, mein Geld sinnvoll zu investieren, weil es liegt einfach nur rum und das ist ja noch"}, {"id": 365, "start": 1761.02, "end": 1762.02, "text": "schlechter."}, {"id": 366, "start": 1762.02, "end": 1767.14, "text": "Ich wollte einfach noch ein Jahr länger faul sein, deswegen habe ich meine Ausbildung nicht"}, {"id": 367, "start": 1767.14, "end": 1768.14, "text": "verkürzt."}, {"id": 368, "start": 1768.14, "end": 1773.46, "text": "Du hast eine zweite Grafikkarte, das kriegst du mit deinem Ausbildungsgeld hin, da musst"}, {"id": 369, "start": 1773.46, "end": 1778.74, "text": "du ja auch nicht verkürzen, aber ehrlich gesagt, das mit dem verkürzen oder nicht, ist Geschmackssache"}, {"id": 370, "start": 1778.74, "end": 1782.86, "text": "und hängt auch, finde ich, ganz entscheidend dran, wie der Ausbildungsbetrieb so ist, also"}, {"id": 371, "start": 1782.86, "end": 1786.42, "text": "ob man da wirklich was lernt, wenn man da nämlich wirklich was lernt, ist es vielleicht gar"}, {"id": 372, "start": 1786.42, "end": 1790.54, "text": "nicht so schlecht, das dritte Jahr zu machen, wenn man da aber nur seine Zeit absitzt, ist"}, {"id": 373, "start": 1790.54, "end": 1791.54, "text": "eh egal."}, {"id": 374, "start": 1791.54, "end": 1803.58, "text": "Alles in Bitcoin, klar, hudel, macht da bup, Kekkel, Alter, ok, es ist aber nicht mal ultra"}, {"id": 375, "start": 1803.58, "end": 1807.98, "text": "viel weiter runter gegangen, seitdem ich das letzte Mal geguckt habe, da war das schon"}, {"id": 376, "start": 1807.98, "end": 1808.98, "text": "so hier."}, {"id": 377, "start": 1808.98, "end": 1821.5, "text": "Serverzentrum ist unter der Erde, dass das Rechenzentrum im Keller ist, ist relativ"}, {"id": 378, "start": 1821.5, "end": 1822.5, "text": "häufig so."}, {"id": 379, "start": 1822.5, "end": 1826.78, "text": "Hab ich euch eigentlich schon mal, bevor wir jetzt Amazon gucken, hab ich euch eigentlich"}, {"id": 380, "start": 1826.78, "end": 1836.14, "text": "schon die Story erzählt, warum wir in der alten Firma das Rechenzentrum im, äh, ich"}, {"id": 381, "start": 1836.14, "end": 1844.46, "text": "das jetzt misst erzählen, im siebten Stock, nee, nee, nee, nicht in der Wohnung, nein,"}, {"id": 382, "start": 1844.46, "end": 1848.22, "text": "nein, nein, nicht in der Wohnung, nein, das meine ich nicht, das weiß ich nicht, äh,"}, {"id": 383, "start": 1848.22, "end": 1853.5, "text": "warum wir in der alten Firma das Rechenzentrum im siebten Stock hatten, vom, äh, ich rede"}, {"id": 384, "start": 1853.5, "end": 1860.5, "text": "nicht von der Wohnung, das war, also normalerweise würde man ja sagen, ja was macht denn das"}, {"id": 385, "start": 1860.5, "end": 1865.38, "text": "Rechenzentrum im siebten Stock, das ist ja total unsinnig, und das hat auch immer wieder"}, {"id": 386, "start": 1865.38, "end": 1870.46, "text": "Probleme gemacht, weil jedes Mal, wenn dort neue Storage-Systeme reingestellt werden sollten,"}, {"id": 387, "start": 1870.46, "end": 1874.62, "text": "mussten sie irgendein Architektenbüro finden, was die Statik schön rechnet, dass man das"}, {"id": 388, "start": 1874.62, "end": 1879.78, "text": "noch reinstellen darf, zwischenzeitlich haben sie sogar den Boden verstärkt, dort wo Storage-Systeme"}, {"id": 389, "start": 1879.78, "end": 1884.42, "text": "standen, ganz im Ernst, wenn das Storage-System durch die Decke bricht, und da sitzt einer"}, {"id": 390, "start": 1884.42, "end": 1890.78, "text": "drunter, ich glaube, also platt ist gar nicht mehr der richtige Ausdruck für, ich glaube"}, {"id": 391, "start": 1890.78, "end": 1898.3, "text": "der pulverisiert, komplett, stellt euch mal vor, es fällt euch ein mehrere Tonnen schweres"}, {"id": 392, "start": 1898.3, "end": 1902.66, "text": "desintegriert, ja, es stellt euch mal vor, es fällt euch ein mehrere Tonnen schweres"}, {"id": 393, "start": 1902.66, "end": 1913.62, "text": "Storage-System von zweieinhalb oder von drei Meter Höhe auf den Kopf, also du bist wahrscheinlich"}, {"id": 394, "start": 1913.62, "end": 1918.54, "text": "noch nicht mal Matsch, du bist so in Teile, dass man dich überhaupt nicht mehr zuordnen"}, {"id": 395, "start": 1918.54, "end": 1929.7, "text": "kann, was du mal gewesen bist, Helm, der rätte dich bestimmt, so zumindest auf dem kleinen"}, {"id": 396, "start": 1929.7, "end": 1934.94, "text": "C, ja, wir hatten mal bei einem Rechenzentrum Umzug, einem, dem ist ein fetter Server auf"}, {"id": 397, "start": 1934.94, "end": 1944.38, "text": "dem Fuß gefallen, so richtig schön mit der Kante vom Metallgehäuse, MonkaS, alter, zumindest,"}, {"id": 398, "start": 1944.38, "end": 1949.38, "text": "das hat richtig Probleme gemacht mit dem Storage, und jetzt ist natürlich die Frage, warum"}, {"id": 399, "start": 1949.38, "end": 1955.06, "text": "war das Rechenzentrum nicht im Keller, und im Keller war Platz, im Keller war nämlich"}, {"id": 400, "start": 1955.06, "end": 1959.5, "text": "ein Mini-Mini-Mini-Rechenzentrum, in der Abstellkammer mit einem Rack drin, das war letztendlich für"}, {"id": 401, "start": 1959.5, "end": 1965.54, "text": "die Hausverkabelung, aber warum war das nicht im Keller, man hätte es super im Keller machen"}, {"id": 402, "start": 1965.54, "end": 1971.82, "text": "können, und die Antwort ist, es war nicht im Keller, weil, es kann sein, dass ich euch"}, {"id": 403, "start": 1971.82, "end": 1980.38, "text": "das schon erzählt habe, es war nicht im Keller, weil Leute vom Vorstand ihren Parkplatz nicht"}, {"id": 404, "start": 1980.38, "end": 1984.78, "text": "räumen wollten, die haben gesagt, ich bin im Vorstand, ich bin wichtig und ich brauche"}, {"id": 405, "start": 1984.78, "end": 1991.62, "text": "in der Garage einen Parkplatz, und das Rechenzentrum kann da nicht hin, und dann haben die lieber"}, {"id": 406, "start": 1991.62, "end": 1996.74, "text": "das Rechenzentrum im siebten Stock immer wieder architektenmäßig schön rechnen lassen,"}, {"id": 407, "start": 1996.74, "end": 2002.3, "text": "anstatt sich woanders hinzustellen mit ihrem Auto, relatable, jaja, und deswegen war das"}, {"id": 408, "start": 2002.3, "end": 2012.42, "text": "Rechenzentrum im siebten Stock, das ist auch eines der größten PP-Ger-Entscheidungen,"}, {"id": 409, "start": 2012.42, "end": 2031.14, "text": "die ich da managmenttechnisch je gesehen habe, ja, das wäre wahrscheinlich weniger aufwendig"}, {"id": 410, "start": 2031.14, "end": 2037.78, "text": "gewesen, man hätte einen Lift gebaut, das im siebten Stock das Parkhaus wäre, so, aber"}, {"id": 411, "start": 2037.78, "end": 2042.9, "text": "jetzt kommen wir zur Runde Amazon an, also, schauen wir mal, wie es aussieht mit externen"}, {"id": 412, "start": 2042.9, "end": 2065.18, "text": "Festplatten, wo der Unterschied ist, ähm, wait a minute,"}, {"id": 413, "start": 2065.18, "end": 2080.66, "text": "nee, ich hab grad gedacht, du spammst Reflink, aber das ist nicht so, äh, wo ist der Unterschied,"}, {"id": 414, "start": 2080.66, "end": 2095.5, "text": "bleibt mal her, äh, ich seh keinen Unterschied, fühlt mir alles gleich aus, ach nee, Fire"}, {"id": 415, "start": 2095.5, "end": 2101.18, "text": "HD 10 Tablet, ja, das ist, das ist general überholt, das ist gebraucht, das ist gebraucht,"}, {"id": 416, "start": 2101.18, "end": 2115.1, "text": "das ist achter, das eine ist mit Amazon, und das eine ist ohne Amazon-Krempel, ach nee,"}, {"id": 417, "start": 2115.1, "end": 2119.42, "text": "das ist ein Plus, und das andere ist ein, nee, das ist auch general überholt, steht"}, {"id": 418, "start": 2119.42, "end": 2130.46, "text": "auch da, nee, das da, das ist mit Spezialangeboten, und das ist ohne Spezialangebote, das eine"}, {"id": 419, "start": 2130.46, "end": 2144.06, "text": "ist, bei mir steht da nix mit 39 und 37, ach, das hier, Special Offers, mit Spezial, dann"}, {"id": 420, "start": 2144.06, "end": 2155.54, "text": "hab ich keine Ahnung, was der Unterschied ist, ähm, wahrscheinlich gar nix, wahrscheinlich"}, {"id": 421, "start": 2155.54, "end": 2162.06, "text": "ist gar kein Unterschied, weil es wieder Amazon Pepega Time angesagt, nee, das ist general"}, {"id": 422, "start": 2162.06, "end": 2174.46, "text": "überholt, das ist general überholt, und das hier ist neu, das eine ist general überholt"}, {"id": 423, "start": 2174.46, "end": 2178.42, "text": "und das andere neu, ich mein, warum man für zwei Euro sich general überholtes holen"}, {"id": 424, "start": 2178.42, "end": 2183.66, "text": "soll, keine Ahnung, weiß wahrscheinlich nur Amazon, dann würd ich mir immer Neues holen,"}, {"id": 425, "start": 2183.66, "end": 2196.38, "text": "Omega Lul, ja, aber richtig, Hyper Omega Poggers Lul, oder kappalul.com, wie meine neue Domain,"}, {"id": 426, "start": 2196.38, "end": 2197.38, "text": "so sagt."}, {"id": 427, "start": 2197.38, "end": 2211.06, "text": "Also gucken wir mal externe Festpläne, also Prime Day, okay, obligatorisch, obligatorisch"}, {"id": 428, "start": 2211.06, "end": 2217.1, "text": "gucken, ob's günstige SSDs gibt, ich brauch keine SSDs, aber SSDs lohnen sich beim Prime"}, {"id": 429, "start": 2217.1, "end": 2222.58, "text": "Day eigentlich fast immer, wobei man sich natürlich vom Prime Day nicht gebaten lassen"}, {"id": 430, "start": 2222.58, "end": 2226.82, "text": "darf, nehmen wir mal zum Beispiel die hier, das dürfte so eines der, also diese Crucial"}, {"id": 431, "start": 2226.82, "end": 2234.66, "text": "MX500 und BX500, das ist ja sau beliebte SSDs, Amazon gebated gerne, ich könnte wetten,"}, {"id": 432, "start": 2234.66, "end": 2252.46, "text": "Evo, Moment, müssen wir mal gucken, Prime Day, Evo 870, sind die nicht schon bei 970,"}, {"id": 433, "start": 2252.46, "end": 2263.86, "text": "kostet 2TB, 455, so, jetzt schauen wir mal, begeits halt, weil Amazon gebated ja gerne,"}, {"id": 434, "start": 2263.86, "end": 2274.82, "text": "Evo 2TB, okay, das ist tatsächlich ganz gut, das ist nicht schlecht, das ist, das würde"}, {"id": 435, "start": 2274.82, "end": 2286.74, "text": "ich sagen, kann man sich dann tatsächlich mal geben, das finde ich okay, ja, da sage"}, {"id": 436, "start": 2286.74, "end": 2306.06, "text": "ich jetzt gar nichts gegen, 155 Euro versus hier 193, okay, das ist doch in Ordnung, ja,"}, {"id": 437, "start": 2306.06, "end": 2321.58, "text": "was kostet denn die 970, okay, ne, die ist ein bisschen teurer, ein bisschen ist gut"}, {"id": 438, "start": 2321.58, "end": 2328.3, "text": "100 Euro teurer, so, also Prime Day, die obligatorische Sache nach SSDs, wie gesagt, ich brauche keine"}, {"id": 439, "start": 2328.3, "end": 2333.86, "text": "SSDs, ich habe genug SSDs aktuell da, aber SSDs ist ja eine Sache, die man normalerweise"}, {"id": 440, "start": 2333.86, "end": 2339.58, "text": "nie genug haben kann, die Dinge habe ich ausprobiert, da habe ich zwei Stück schon, von diesen Sandisk"}, {"id": 441, "start": 2339.58, "end": 2348.42, "text": "Extreme Portables, die finde ich fragwürdig, weil die verbrauchen mehr Strom als USB laut"}, {"id": 442, "start": 2348.42, "end": 2354.9, "text": "Spezifikation liefern kann, was dazu führt, dass die an manchen Systemen unstabil an Stable"}, {"id": 443, "start": 2354.9, "end": 2360.7, "text": "sind, das sollte nicht der Fall sein, ist es aber leider, und wer die Dinge an einem Raspberry"}, {"id": 444, "start": 2360.7, "end": 2365.5, "text": "Pi betreiben will, kann es komplett vergessen, weil der Raspberry Pi noch nicht mal maximale"}, {"id": 445, "start": 2365.5, "end": 2372.5, "text": "USB Spannung liefern kann, ich glaube der Raspberry Pi kann maximal 1,5 Ampere, ne 0,7, ich kann"}, {"id": 446, "start": 2372.5, "end": 2377.9, "text": "es nicht, ne, warte mal, was kannst du über USB machen, 1,5 und der Raspberry Pi kann"}, {"id": 447, "start": 2377.9, "end": 2385.82, "text": "plus 0,7, ich bin mir jetzt ehrlich gesagt aus dem Kopf nicht ganz sicher, zumindest"}, {"id": 448, "start": 2385.82, "end": 2389.82, "text": "liefert der Raspberry Pi nicht das, was maximal möglich wäre und dementsprechend kannst du"}, {"id": 449, "start": 2389.82, "end": 2395.02, "text": "es knicken, vor allem, wenn du zusätzlich am USB Port noch was anderes betreiben wolltest,"}, {"id": 450, "start": 2395.02, "end": 2402.46, "text": "ich hatte ja mal einen Raspberry Pi im Einsatz, mit USB TV Tuner und USB SSD, kannst du komplett,"}, {"id": 451, "start": 2402.46, "end": 2406.42, "text": "aber wirklich komplett vergessen, das System fliegt dir laufend um die Ohren, weil die"}, {"id": 452, "start": 2406.42, "end": 2415.74, "text": "Platten weg, weg fliegen und read only gehen und alles, weil zu wenig Strom, ja mit einem"}, {"id": 453, "start": 2415.74, "end": 2425.42, "text": "extra Hub das geht, mit dem aktiven Hub funktioniert das, doch aktiver Hub funktioniert, warum soll"}, {"id": 454, "start": 2425.42, "end": 2428.94, "text": "das nicht funktionieren, ich hab selbst einen aktiven Hub dran gehabt, das funktioniert"}, {"id": 455, "start": 2428.94, "end": 2434.26, "text": "besser, aber auch nicht wirklich gut, zumal du dann massig Kabelsalat hast, wozu du eigentlich"}, {"id": 456, "start": 2434.26, "end": 2439.14, "text": "gerade einen Raspberry Pi holst, dass du das nicht hast, doch ich hab das mit dem Hub,"}, {"id": 457, "start": 2439.14, "end": 2443.3, "text": "Hub war gar kein Problem, ich hatte so einen billig Anker USB Hub, so einen China-Chinesen,"}, {"id": 458, "start": 2443.3, "end": 2449.54, "text": "kann man hier USB Hub mal gucken, ob es hier gerade fürs Ding gibt, ja das ist er, das"}, {"id": 459, "start": 2449.54, "end": 2454.62, "text": "ist er, wobei ob das der ist, weiß ich nicht, die sehen alle so aus, so einen in der Richtung"}, {"id": 460, "start": 2454.62, "end": 2470.42, "text": "hab ich als USB Hub, aber ne das kann ja nicht sein, weil das nicht mit Stromanschluss ist,"}, {"id": 461, "start": 2470.42, "end": 2479.38, "text": "dann weiß ichs auch nicht, kann man mit dem aktiven Hub auch den Raspberry Pi betreiben,"}, {"id": 462, "start": 2479.38, "end": 2492.06, "text": "ja, du kannst theoretisch den Raspberry Pi an den Hub stecken und dann dort den Raspberry"}, {"id": 463, "start": 2492.06, "end": 2497.1, "text": "Pi noch an USB, das funktioniert, also kannst du machen, ja, aber dann hast du das Problem,"}, {"id": 464, "start": 2497.1, "end": 2504.7, "text": "dass der Hub auch irgendwann zu wenig Strom liefert, weil der Hub hat ja auch bloß maximal"}, {"id": 465, "start": 2504.7, "end": 2511.58, "text": "irgendwie, was ist das, 5V, 2A und der Raspberry Pi braucht ja standardmäßig schon wirklich"}, {"id": 466, "start": 2511.58, "end": 2517.98, "text": "Limit was USB hergibt, also deswegen, als offizielle Raspberry Pi Netzteile hat glaube"}, {"id": 467, "start": 2517.98, "end": 2524.78, "text": "ich 5,1V mit 3A und das machen die meisten USB Dinger gar nicht, du brauchst das nicht,"}, {"id": 468, "start": 2524.78, "end": 2530.42, "text": "du brauchst das wirklich in absoluten Spitzenlastzeiten, die 15 Watt, die der Raspberry Pi 4 verbraucht,"}, {"id": 469, "start": 2530.42, "end": 2533.74, "text": "aber trotzdem, es hat schon seinen Sinn, dass die ein eigenes Netzteil dabei haben,"}, {"id": 470, "start": 2533.74, "end": 2540.9, "text": "also USB Geräte am Pi und den Pi selber über den aktiven USB Hub betreiben, also wenn du"}, {"id": 471, "start": 2540.9, "end": 2545.06, "text": "willst, dass dein System öfters mal abkackt und die Festplatte read-only geht, weil es"}, {"id": 472, "start": 2545.06, "end": 2548.7, "text": "Probleme gibt, dann kannst du das machen, ich würde es aber auf jeden Fall nicht empfehlen,"}, {"id": 473, "start": 2548.7, "end": 2552.5, "text": "kaputt gehen kann da nichts, weil du kannst Daten verlieren, ja, aber hardware-technisch"}, {"id": 474, "start": 2552.5, "end": 2558.42, "text": "kann da nichts kaputt gehen, aber es ist halt unstabil, es, fuck, das will man nicht machen."}, {"id": 475, "start": 2558.42, "end": 2564.46, "text": "Warum ist diese Platte eigentlich noch so wahnsinnig beliebt, da gibt es auch mittlerweile bessere"}, {"id": 476, "start": 2564.46, "end": 2565.46, "text": "Alternativen, oder?"}, {"id": 477, "start": 2565.46, "end": 2581.38, "text": "Das Ding ist so der Evergreen seit den letzten 5 Jahren, diese MX500-Series, ist Lexa, China-Chinesen-Zeug?"}, {"id": 478, "start": 2581.38, "end": 2592.02, "text": "Also, SSDs, weiß nicht, ich hab genug SSDs, wir gucken gerade mal, externe Festplatte,"}, {"id": 479, "start": 2592.02, "end": 2600.54, "text": "oder externe SSD, externe SSD ist bescheuert, ich brauch Speicherplatz, ich brauch Pepofet-Speicherplatz,"}, {"id": 480, "start": 2600.54, "end": 2608.14, "text": "5TB zu wenig, 12TB könnte man vielleicht nochmal drüber reden, das ist aber teurer"}, {"id": 481, "start": 2608.14, "end": 2616.62, "text": "als eine 12TB normale Platte, oder?"}, {"id": 482, "start": 2616.62, "end": 2625.78, "text": "Das ist eigentlich nicht so, nicht so nice, gucken wir mal, gucken wir mal, HDD im Zweifels"}, {"id": 483, "start": 2625.78, "end": 2635.98, "text": "kann sie noch, 2TB, wisst ihr, warum kann man den Kram, also die Suche bei Amazon ist"}, {"id": 484, "start": 2635.98, "end": 2639.66, "text": "wirklich sehr pepega, oder, warum kann ich die Festplatten jetzt bitte schön nicht nach"}, {"id": 485, "start": 2639.66, "end": 2640.66, "text": "Größe sortieren?"}, {"id": 486, "start": 2640.66, "end": 2649.9, "text": "Manchmal geht das, manchmal geht das nicht, also manchmal kannst du sortieren, manchmal"}, {"id": 487, "start": 2649.9, "end": 2659.02, "text": "Computer und Electronics, warum kann ich die Festplatten nicht sortieren, nach Größe"}, {"id": 488, "start": 2659.02, "end": 2660.94, "text": "mann Amazon, was ist das denn schon wieder?"}, {"id": 489, "start": 2660.94, "end": 2667.26, "text": "Aber das sieht alles nicht so aus, als würde sich das groß, also das ist ganz schön, ich"}, {"id": 490, "start": 2667.26, "end": 2674.38, "text": "glaube 8TB für 190 ist glaube ich echt nicht günstig, schauen wir mal kurz Geizhals, aber"}, {"id": 491, "start": 2674.38, "end": 2686.22, "text": "ich glaube das ist nicht, nicht, oben rechts sort by, die Sachen mit Größe filtern wir"}, {"id": 492, "start": 2686.22, "end": 2690.9, "text": "meistens über das linke, aber das funktioniert dann auch nicht so, ganz ehrlich Amazon Suche"}, {"id": 493, "start": 2690.9, "end": 2694.74, "text": "ist einfach abfack, der einzige Grund warum der Amazon so viel verkauft ist, weil ihre"}, {"id": 494, "start": 2694.74, "end": 2709.06, "text": "Empfehlungen ganz gut sind, so Festplatten, HDD, TB3, ah Thunderbolt, Harddisk, SATA,"}, {"id": 495, "start": 2709.06, "end": 2729.02, "text": "3 pro Terabyte, guck mal hier, also du kriegst hier, gucken wir mal, gucken wir mal die 8er,"}, {"id": 496, "start": 2729.02, "end": 2748.02, "text": "ne nicht bis 8, ab 8, ja ok, das geht tatsächlich, wobei ich mir keine 8er mehr reinhauen würde,"}, {"id": 497, "start": 2748.02, "end": 2759.62, "text": "ach Moment ich muss nach preis, nicht nach preis pro, na gut in dem Fall ist es eigentlich,"}, {"id": 498, "start": 2759.62, "end": 2766.58, "text": "wait a minute, das ist teurer bei Amazon, wie das, ja dann ist ppega, dann lohnt sich das"}, {"id": 499, "start": 2766.58, "end": 2775.14, "text": "überhaupt nicht, ne, gibt es 18TB, wenn es 18TB gibt günstig, dann wird das gekauft,"}, {"id": 500, "start": 2775.14, "end": 2793.18, "text": "no pass, wie groß, wie groß, 18TB, das ist doch bestimmt so, warum keine 8TB mehr, weil"}, {"id": 501, "start": 2793.18, "end": 2797.46, "text": "preisleistungsmäßig, ok das stimmt nicht, ich glaube preisleistungsmäßig sind 8TB"}, {"id": 502, "start": 2797.46, "end": 2804.06, "text": "relativ gut aktuell, aber du bekommst halt für etwas, sag mal vielleicht nicht ganz"}, {"id": 503, "start": 2804.06, "end": 2811.78, "text": "so gut preisleistungsmäßig, bekommst du aber halt schon 12, 14TB plus, mit nicht so viel"}, {"id": 504, "start": 2811.78, "end": 2816.9, "text": "mehr preis pro Terabyte und ich finde es einfach besser, anstatt 2 Platten reinzustecken, lieber"}, {"id": 505, "start": 2816.9, "end": 2823.06, "text": "eine große reinzustecken, generell großes reinstecken, gachi bass ist immer nicht verkehrt."}, {"id": 506, "start": 2823.06, "end": 2829.98, "text": "Du hast dir ein paar, ja also wenn das preisleistungsmäßig für dich das beste ist, kannst du machen,"}, {"id": 507, "start": 2829.98, "end": 2839.38, "text": "also ich persönlich würde mir keine 8TB Platten mehr reinschieben, so, also da ist glaube"}, {"id": 508, "start": 2839.38, "end": 2846.7, "text": "ich nichts dabei, wir lassen uns mal kurz inspirieren von den Amazon Empfehlungen, ja"}, {"id": 509, "start": 2846.7, "end": 2850.66, "text": "das Problem ist, du kannst das alles machen und das ist vielleicht performanstechnisch"}, {"id": 510, "start": 2850.66, "end": 2856.54, "text": "auch gar nicht schlecht, falls du da irgendwie drauf auf Magnetplatten Performance schielst,"}, {"id": 511, "start": 2856.54, "end": 2863.22, "text": "aber du musst dich dann halt um den ZFS kümmern, du musst dir dann überlegen, ok, was mache"}, {"id": 512, "start": 2863.22, "end": 2868.42, "text": "ich denn jetzt am besten für den Raid Level, dann musst du dir da Zeug zurechtlegen, gucken"}, {"id": 513, "start": 2868.42, "end": 2873.54, "text": "dass du 10% Platz reservierst, weil es ZFS ist und bei einer Platte ist es halt überhaupt"}, {"id": 514, "start": 2873.54, "end": 2878.1, "text": "kein Problem, du machst eine Platte, spiegelst die einmal nachts und wenn was davon verreckt"}, {"id": 515, "start": 2878.1, "end": 2885.18, "text": "ist egal, holst dir eine neue Platte und Ruhe, nachdem ich eh SSD Cache dazwischen hab, juckt"}, {"id": 516, "start": 2885.18, "end": 2892.7, "text": "mich gar nicht mehr, ob die Platte irgendwie jetzt lahm ist, 2TB SSD Cache, ich könnte"}, {"id": 517, "start": 2892.7, "end": 2899.98, "text": "nochmal ein zweites, 2TB dazustecken und fertig, ist gut, dass ich mir diese Erweiterungskarte"}, {"id": 518, "start": 2899.98, "end": 2907.42, "text": "gekauft hab für den SSD Cache, 18TB sind SMR oder CMR, ich weiß es nicht, aber es muss"}, {"id": 519, "start": 2907.42, "end": 2916.58, "text": "ja immer dabei stehen, mein Cache ist nur Read, nö, das ist der SSD, die ist Read und"}, {"id": 520, "start": 2916.58, "end": 2921.5, "text": "Write, naja, du brauchst eine SSD und du brauchst eine Platte wo du es letztendlich drauf schreibst,"}, {"id": 521, "start": 2921.5, "end": 2924.5, "text": "weil ansonsten würdest du direkt auf die SSD schreiben, das bleibt drauf, dann wäre es"}, {"id": 522, "start": 2924.5, "end": 2932.78, "text": "ja kein SSD Cache, wenn ich übers Netzwerklaufwerk irgendwas hinschiebe, dann geht das mit 10G"}, {"id": 523, "start": 2932.78, "end": 2937.78, "text": "auf die SSD drauf, ich meine außer die SSD ist voll, dann natürlich nicht und dann wird"}, {"id": 524, "start": 2937.78, "end": 2949.9, "text": "das langsam aber sicher runtergemoved auf die Magnetplatte, äh das ist Write, das ist"}, {"id": 525, "start": 2949.9, "end": 2962.78, "text": "Write Cache, nicht Read Cache, Write Cache, weil Read Cache, ja dann bräuchte man, nee,"}, {"id": 526, "start": 2962.78, "end": 2973.42, "text": "Write Cache, ja mach da, wenn Stromausfall ist, sind die Sachen ja noch auf der SSD drauf"}, {"id": 527, "start": 2973.42, "end": 2977.06, "text": "und wenn ich die Kiste wieder einfahre, werden die Sachen halt weitergemoved auf die Magnetplatten,"}, {"id": 528, "start": 2977.06, "end": 2989.78, "text": "das funktioniert, also Amazon, was möchtest du uns heute verkaufen, billige Werkzeugkisten,"}, {"id": 529, "start": 2989.78, "end": 2998.78, "text": "die werde ich mir schon mal definitiv nicht kaufen, TP Link and More, ok zeig mal her,"}, {"id": 530, "start": 2998.78, "end": 3009.18, "text": "von Amazon Basics können wir safen, das ist gut, von Samsung können wir safen, von Netgear"}, {"id": 531, "start": 3009.18, "end": 3015.3, "text": "können wir safen, wir safen ja so viel, dass wir am Ende fast mehr Geld haben als vorher,"}, {"id": 532, "start": 3015.3, "end": 3020.94, "text": "zumindest wollen sie einem das weis machen, so noch mehr von Basics safen, ok wir safen"}, {"id": 533, "start": 3020.94, "end": 3027.94, "text": "ja hier komplett unser Konto voll, so fertig gesaved, also zeig mal her, TP Link Steckdosen,"}, {"id": 534, "start": 3027.94, "end": 3045.66, "text": "Nopers, Nope, was ist denn das, Access Point, warum sieht der so ppeger aus der Access Point,"}, {"id": 535, "start": 3045.66, "end": 3058.82, "text": "brauchen wir nicht, brauchen wir nicht, brauchen wir nicht, da fällt mir was ein, vor ein paar"}, {"id": 536, "start": 3058.82, "end": 3067.42, "text": "Jahren, ich überleg grad was es war, ob es Netgear oder Asus war, ein Routerhersteller,"}, {"id": 537, "start": 3067.42, "end": 3071.82, "text": "also irgendein Gaming Routerhersteller angeschrieben, ist schon 3-4 Jahre her, ob ich das Gerät"}, {"id": 538, "start": 3071.82, "end": 3077.66, "text": "nicht vorstellen möchte, ich bekomm das auch alles kostenlos, überlassen und so, da hab"}, {"id": 539, "start": 3077.66, "end": 3081.42, "text": "ich ihn zurückgeschrieben so nach dem Motto, ja ich kann das Gerät gerne in einem Video"}, {"id": 540, "start": 3081.42, "end": 3086.94, "text": "erwähnen, aber ich will das Gerät nicht benutzen, muss ich das benutzen um da drüber ein Video"}, {"id": 541, "start": 3086.94, "end": 3092.02, "text": "zu machen, und dann hab ich gemeint, warum willst du das nicht benutzen, voll geiler"}, {"id": 542, "start": 3092.02, "end": 3099.66, "text": "Gaming Router, ich hab hier mein Setup und das will ich nicht umschrauben, und irgendwie"}, {"id": 543, "start": 3099.66, "end": 3107.46, "text": "waren die scharf darauf, dass ich es benutze, und dann ist da nix draus geworden, vorgestellt"}, {"id": 544, "start": 3107.46, "end": 3113.5, "text": "hätte ich das ganze gar kein Problem, ganz ehrlich gibt es immer weniger und ist ein"}, {"id": 545, "start": 3113.5, "end": 3119.38, "text": "Glücksfall noch welche zu bekommen, weil die China-Chinesen leider angefangen haben, also"}, {"id": 546, "start": 3119.38, "end": 3126.02, "text": "hat 2 Gründe, die haben angefangen Geräte rauszugeben die gepatcht sind, ja wie gesagt"}, {"id": 547, "start": 3126.02, "end": 3133.74, "text": "du musst erstmal welche kriegen, die noch flashbar sind, also es gibt 2 Sachen, die"}, {"id": 548, "start": 3133.74, "end": 3138.42, "text": "haben ihre Geräte gepatcht, sodass dieses standardmäßige over the air flaschen nicht"}, {"id": 549, "start": 3138.42, "end": 3143.5, "text": "funktioniert, dazu musste man die letzten paar Geräte schon aufschrauben um sie flaschen"}, {"id": 550, "start": 3143.5, "end": 3149.34, "text": "zu können, und das nächste ist, die Geräte haben kein ESP866 oder ESP32 mehr und dementsprechend"}, {"id": 551, "start": 3149.34, "end": 3156.86, "text": "ist mit TASMOTA flaschen eh nix, weil TASMOTA ist eine Firmware für den ESP866 und ESP32,"}, {"id": 552, "start": 3156.86, "end": 3161.5, "text": "also sprich wenn da ein anderer Chip drin ist, geht TASMOTA logischerweise nicht mehr."}, {"id": 553, "start": 3161.5, "end": 3168.34, "text": "Du hast die Gosund bestellter Flashbar direkt von ihrer Webseite, zeig mal, schick mal einen"}, {"id": 554, "start": 3168.34, "end": 3173.9, "text": "Link, Gosund, die haben sich immer noch nicht in Gesund umbenannt, Corona ist doch fast"}, {"id": 555, "start": 3173.9, "end": 3190.14, "text": "vorbei, ist das die mit USB unten dran, ja die hier, die sind tatsächlich nicht schlecht,"}, {"id": 556, "start": 3190.14, "end": 3198.5, "text": "falls die das sind, die ich auch mal bestellt hab, Gosund, ich glaub da sind die mit, naja"}, {"id": 557, "start": 3198.5, "end": 3206.58, "text": "Pima Daumen Strommessung, also was das verbraucht, was dran hängt und zwei USB Anschlüssen"}, {"id": 558, "start": 3206.58, "end": 3215.66, "text": "und halt eine normale Steckdose, die waren ganz okay, falls die das sind, die ich auch"}, {"id": 559, "start": 3215.66, "end": 3231.98, "text": "habe, allerdings wie gesagt, keine Ahnung ob die noch flashbar sind, Shelley kannst du"}, {"id": 560, "start": 3231.98, "end": 3242.74, "text": "auch mit TASMOTA flaschen, der Unterschied ist nur, dass du hier 4 China-Chinesen Steckdosen"}, {"id": 561, "start": 3242.74, "end": 3248.86, "text": "bekommst, manchmal, wenn die im Angebot sind, für den Preis von einer Shelley Steckdose,"}, {"id": 562, "start": 3248.86, "end": 3259.58, "text": "Gosund-Deutschland.de, die gibt's ja, 34,60 Euro, SP1 Zwischenstecker, bewerben die hiermit,"}, {"id": 563, "start": 3259.58, "end": 3268.98, "text": "dass man die flashen kann oder, oder war das Zufall, bewerben die das irgendwo, dass die"}, {"id": 564, "start": 3268.98, "end": 3277.5, "text": "flashbar sind, ahja guck mal, Shelley Smartplug gibt's, das hört sich übrigens aus, Shelley"}, {"id": 565, "start": 3277.5, "end": 3284.22, "text": "Smartplug hört sich sehr Gatchibas-mäßig an, ja guck da bekommst du zwei Shelley Plugs,"}, {"id": 566, "start": 3284.22, "end": 3288.5, "text": "hier bekommst du 4 Steckdosen für und die Shelley-Dinger sind in letzter Zeit ziemlich"}, {"id": 567, "start": 3288.5, "end": 3301.1, "text": "teuer geworden, guck mal, Products, Shop, Shop, die haben mittlerweile auch Gott und"}, {"id": 568, "start": 3301.1, "end": 3310.18, "text": "die Welt an Zeug, 17 Euro, also du bekommst, du bekommst genau zwei für den Preis von"}, {"id": 569, "start": 3310.18, "end": 3320.22, "text": "China-Chinesen, 4 und Feature-technisch ist das hier auch besser, weil, Moment wo sind"}, {"id": 570, "start": 3320.22, "end": 3326.02, "text": "die, guck mal, du bekommst die USB, sind die das mit USB, also die mit USB sind die, die"}, {"id": 571, "start": 3326.02, "end": 3332.42, "text": "sind folgsten, ja, die Steckdose steckt jetzt nicht von unten, das ist blöd, haben die"}, {"id": 572, "start": 3332.42, "end": 3348.3, "text": "USB, ne oder, ja dann die hier, dann die hier, mit Strommessung und USB und die am besten"}, {"id": 573, "start": 3348.3, "end": 3353.18, "text": "da noch im 4er-Pack, die hab ich mir nämlich damals im Angebot gekauft, ich hab mir glaube"}, {"id": 574, "start": 3353.18, "end": 3360.26, "text": "ich 3x4 gekauft und die konnten man alle noch flashen, naja nach oben und unten ist doch"}, {"id": 575, "start": 3360.26, "end": 3365.3, "text": "nicht das Problem, nach vorne, nach vorne sind die ungefähr genauso groß, ja du hast"}, {"id": 576, "start": 3365.3, "end": 3368.9, "text": "recht die sind größer aber dafür kannst du 2xUSB-Geräte anschließend kannst den Verbrauch"}, {"id": 577, "start": 3368.9, "end": 3374.9, "text": "messen und hast einen ordentlichen Schalter dran, was du beim Shelly nicht hast, also ich"}, {"id": 578, "start": 3374.9, "end": 3386.14, "text": "finde das sind die besten von denen die ich gekauft hab, China-Chinesen Zeug, ja, Gosund,"}, {"id": 579, "start": 3386.14, "end": 3394.74, "text": "22 Euro, Leute das ist, aber wartet mal jetzt, ne, wartet mal ab, das ist ein echt guter"}, {"id": 580, "start": 3394.74, "end": 3407.9, "text": "Preis, man müsste halt wissen ob die flashbar sind, wenn die flashbar sind dann geb ihm"}, {"id": 581, "start": 3407.9, "end": 3422.22, "text": "rein damit, ist das überhaupt noch gültig, warum ist meine Playlist vorbei, Moment, wo"}, {"id": 582, "start": 3422.22, "end": 3436.78, "text": "ist meine Playlist, doch Relaxing Music, ach bei de Gosund, das ist Aliexpress, Moment,"}, {"id": 583, "start": 3436.78, "end": 3442.66, "text": "das sieht ein bisschen aus wie das Sale von Aliexpress, ne die Gosund Seite hat sich einfach"}, {"id": 584, "start": 3442.66, "end": 3451.62, "text": "vom China-Chinesen Webseiten Design Ministerium diesen Counter machen lassen, endet in 8.445,"}, {"id": 585, "start": 3451.62, "end": 3461.5, "text": "Leute jetzt wirds aber knapp, nur noch 8.445 Stunden left, mir juckt schon im Finger, ich"}, {"id": 586, "start": 3461.5, "end": 3476.02, "text": "kanns das wird knapp, ganz ganz knapp, ok aber man hat natürlich hier, Gosund, ja kann"}, {"id": 587, "start": 3476.02, "end": 3484.78, "text": "man die flashen oder nicht, das ist halt das Ding, wenn die flashbar sind Leute ist es"}, {"id": 588, "start": 3484.78, "end": 3503.26, "text": "ein wirklich echt gutes Angebot, ship das aus China oder ship das aus Germany, Leute"}, {"id": 589, "start": 3503.26, "end": 3510.5, "text": "Anzeige ist raus, die haben kein Impressum, haben die ein Impressum, aha clever, die Gosund"}, {"id": 590, "start": 3510.5, "end": 3527.9, "text": "Deutschland hat eins, aber Gosund Deutschland hat nicht die Angebote, Pepega Kram, das gibt"}, {"id": 591, "start": 3527.9, "end": 3540.78, "text": "nur den 2er Pack für den gleichen Preis, also hier Free Shipping, Fast Shipping, 3-5 Days,"}, {"id": 592, "start": 3540.78, "end": 3545.9, "text": "Leute kauf ich mir nachher einen Pack, Gosund und dann gucken wir mal ob wir die flashen"}, {"id": 593, "start": 3545.9, "end": 3551.06, "text": "können und wenn wir die nicht flashen können dann hab ich genitten, vielleicht bekommen"}, {"id": 594, "start": 3551.06, "end": 3556.26, "text": "wir raus ob das die ESP32 Steckdosen sind, vielleicht sehen wir hier irgendwie ein, gibt"}, {"id": 595, "start": 3556.26, "end": 3577.58, "text": "es hier ein Datenblatt oder sowas oder ein Manual oder irgendwas, nee gibt es nicht,"}, {"id": 596, "start": 3577.58, "end": 3585.06, "text": "also man kann jetzt echt nicht erkennen ob es die ESP Steckdosen sind und noch weniger"}, {"id": 597, "start": 3585.06, "end": 3593.38, "text": "ob die flashbar sind, das bringt dir ja nichts, du hast Templates für die, du hast Templates"}, {"id": 598, "start": 3593.38, "end": 3598.22, "text": "für die, aber du weißt nicht ob die Hardware Revision oder generell die Hardware überhaupt"}, {"id": 599, "start": 3598.22, "end": 3602.34, "text": "noch flashbar ist, also es gibt Templates für TASmo dafür aber das ist halt die Frage"}, {"id": 600, "start": 3602.34, "end": 3612.9, "text": "ob du es überhaupt drauf bekommst, der Tuya App sagt ja nichts, Tuya Apps sind die alle,"}, {"id": 601, "start": 3612.9, "end": 3638.46, "text": "was man sieht Versteckdosen gekauft hat, vermutlich nicht mehr auf TASMOTA flashbar, die Antwort"}, {"id": 602, "start": 3638.46, "end": 3650.1, "text": "ist nein, man kann inzwischen weder OTA noch, ja gut der weiß ist halt auch nicht genau,"}, {"id": 603, "start": 3650.1, "end": 3678.1, "text": "was, 2020 bringt ja nichts, echt, das ist bei uns auch, ja das ist Pepega, das stimmt"}, {"id": 604, "start": 3678.1, "end": 3682.72, "text": "doch, das ist doch bestimmt alles Fake, das ist doch bestimmt alles Fake was da unten"}, {"id": 605, "start": 3682.72, "end": 3690.26, "text": "steht Leute, das ist so diese typische China-Chinesen Chebat, das ist doch alles Chebat, das ist"}, {"id": 606, "start": 3690.26, "end": 3695.7, "text": "doch alles Chebat, es gibt kein Thomas Mark der das gekauft hat, wisst ihr was die machen,"}, {"id": 607, "start": 3695.7, "end": 3701.3, "text": "die machen Random Name Generator und Random Art Generator und tun so als kaufen die Leute"}, {"id": 608, "start": 3701.3, "end": 3712.62, "text": "gerade wie verrückt, das ist Schwachsinn, das glaube ich nicht, das wird bestimmt Fake"}, {"id": 609, "start": 3712.62, "end": 3717.66, "text": "sein, auf der anderen Seite das ist ein China-Chinesen Hersteller, da weißt du nie was die so abziehen,"}, {"id": 610, "start": 3717.66, "end": 3733.1, "text": "die sind ja auch nicht mehr flashbar, also der Chat sagt, der hat meistens Recht, sagt"}, {"id": 611, "start": 3733.1, "end": 3738.38, "text": "er hätte was bestellt, boop, ich kann ja mal reden, das ist vorbei, was ich sagen wollte"}, {"id": 612, "start": 3738.38, "end": 3743.82, "text": "ist, der Chat hat eben gesagt, er hätte was bestellt und die sind noch flashbar, aber"}, {"id": 613, "start": 3743.82, "end": 3758.86, "text": "nicht, was bringt ihr das Flashen, er hat mehrere Vorteile, du musst die offizielle"}, {"id": 614, "start": 3758.86, "end": 3764.42, "text": "App nicht dafür verwenden um das zu steuern, du brauchst keine dauerhafte Internetverbindung,"}, {"id": 615, "start": 3764.42, "end": 3770.62, "text": "du brauchst keine China-Chinesen Cloud um das zu betreiben, du kannst das integrieren"}, {"id": 616, "start": 3770.62, "end": 3774.94, "text": "in deiner Heimautomatisierungslösung gescheit mit lokaler Firmware, du kannst es steuern"}, {"id": 617, "start": 3774.94, "end": 3778.7, "text": "über ein Web-Interface, du kannst es steuern über deine Heimautomatisierung, du kannst"}, {"id": 618, "start": 3778.7, "end": 3783.38, "text": "es steuern von jedem X-Blogging Browser aus, auch vom Handy aus, du hast Funktionen drin"}, {"id": 619, "start": 3783.38, "end": 3787.74, "text": "die die original Firmware gar nicht kann, also es hat eigentlich nur Vorteile den Kram"}, {"id": 620, "start": 3787.74, "end": 3792.34, "text": "zu flashen, für mich die größten Vorteile sind keine China-Chinesen Firmware und App-Zwang."}, {"id": 621, "start": 3792.34, "end": 3801.86, "text": "Ja, kann dir sein, dass du Glück hast, vielleicht sind die auch wieder flashbar, ich verstehe"}, {"id": 622, "start": 3801.86, "end": 3806.46, "text": "die Hersteller eh nicht warum sie das raushauen mit dem Flashen, ganz ehrlich die Leute kaufen"}, {"id": 623, "start": 3806.46, "end": 3809.26, "text": "sich doch jetzt nicht diese China-Steckdose, weil die denken, oh alter ich wollte schon"}, {"id": 624, "start": 3809.26, "end": 3813.94, "text": "immer mal eine China-Steckdose haben, viele Leute sind auch in dem Bereich, gerade was"}, {"id": 625, "start": 3813.94, "end": 3819.3, "text": "Heimautomatisierung angeht, relativ technikinteressiert und die wissen, dass man das Flashen kann"}, {"id": 626, "start": 3819.3, "end": 3826.3, "text": "und die wollen das Flashen und wenn die das kaufen, dann wollen sie es auch flashen, was"}, {"id": 627, "start": 3826.3, "end": 3827.3, "text": "sagst du dazu?"}, {"id": 628, "start": 3827.3, "end": 3831.26, "text": "Aber ich sag euch übrigens gleich bevor ihr hier rumspammt, ich meine jetzt nicht dich"}, {"id": 629, "start": 3831.26, "end": 3838.9, "text": "ja so allgemein, bevor ihr irgendwelche Ref-Links rumspammt, dann Time-Out ich euch, ich will"}, {"id": 630, "start": 3838.9, "end": 3846.38, "text": "nicht dass ihr Ref-Links, ihr könnt Links posten und sonst was, ok, aber keine Ref-Links"}, {"id": 631, "start": 3846.38, "end": 3854.98, "text": "und vielleicht die Session-IDs raus machen, so also was ist das, Mini PC Intel Core i5,"}, {"id": 632, "start": 3854.98, "end": 3869.82, "text": "welcher Core i5, ist das so ein Fake-Nook oder was ist das, Ref-Link ist ein Link an den"}, {"id": 633, "start": 3869.82, "end": 3873.54, "text": "man verdient ja, mit Ref-ID, ich sehe das gleich ob da eine drin ist, ich hab da den"}, {"id": 634, "start": 3873.54, "end": 3896.82, "text": "Blick für, was ist das für ein i3, äh i5, ach da, lull, hab ich nicht gesehen, was dreck,"}, {"id": 635, "start": 3896.82, "end": 3914.66, "text": "Switch-Chat, was ist hier los, was, was ist hier los, der Chat ist Massive, high IQ, was"}, {"id": 636, "start": 3914.66, "end": 3921.94, "text": "ist das, ach das ist, ja das kenn ich, das ist, ähm, das ist der der versucht ein TAS"}, {"id": 637, "start": 3921.94, "end": 3932.58, "text": "Motor für die neuen Chips zu programmieren, aber das ist ja noch komplett in den Anfangsschuhen,"}, {"id": 638, "start": 3932.58, "end": 3946.58, "text": "ich nix, aber ich weiß nicht wie sinnvoll es ist Session-IDs in der UL mitzuschicken,"}, {"id": 639, "start": 3946.58, "end": 3952.46, "text": "ja keine Ahnung was ich davon herhalte, ich kenn mich mit aktuellen Rechner-Sachen zu"}, {"id": 640, "start": 3952.46, "end": 3960.62, "text": "wenig aus, also für 200€ würde ich sagen klingt das eigentlich durchaus brauchbar,"}, {"id": 641, "start": 3960.62, "end": 3965.14, "text": "definitiv schneller, viel viel schneller als Raspberry Pi, unter halt x86 wenn man das"}, {"id": 642, "start": 3965.14, "end": 3969.18, "text": "haben will, würdest du auf einem Intel-Nook ein Homelab oder ein Proxmox oder Android"}, {"id": 643, "start": 3969.18, "end": 3976.06, "text": "verwenden, klar warum nicht, wenn es dir von der Hardware reicht, was du anschließen"}, {"id": 644, "start": 3976.06, "end": 3983.9, "text": "kannst, warum nicht, ich für meinen Teil würde es wahrscheinlich nicht machen, ist"}, {"id": 645, "start": 3983.9, "end": 3998.94, "text": "Scam, warum ist Scam, erklären Blitz-Chat, ähm, ich würd's nicht machen, weil Intel-Nooks"}, {"id": 646, "start": 3998.94, "end": 4006.86, "text": "haben keine PC-Express-Slots und auch keine M2-Slots glaube ich oder zumindest keine M2-Slots"}, {"id": 647, "start": 4006.86, "end": 4015.26, "text": "mit PC-Express, also falls du 10G reinmachen willst oder falls du irgendwie erweitern willst,"}, {"id": 648, "start": 4015.26, "end": 4021.62, "text": "kannst du den Nook vergessen, ansonsten ja warum nicht, ehrlich gesagt, wenn es für"}, {"id": 649, "start": 4021.62, "end": 4026.3, "text": "dich von der Hardware taugt, hau drauf, Android wirst du halt vergessen können, weil was"}, {"id": 650, "start": 4026.3, "end": 4029.86, "text": "willst du da dran anschließen, eine interne Festplatte, fertig, mehr kriegst du ja den"}, {"id": 651, "start": 4029.86, "end": 4038.34, "text": "Nook nicht erweitern außer über USB, man kanns doch machen, kanns doch USB Platten anschließen"}, {"id": 652, "start": 4038.34, "end": 4048.66, "text": "und sonst geht alles, kann man alles machen, so also was kriegen wir sonst noch empfohlen,"}, {"id": 653, "start": 4048.66, "end": 4060.98, "text": "Gosund bei Prime Day, für eine 5 Jahre alte CPU, nee 200 Euro soll man bezahlen hat der"}, {"id": 654, "start": 4060.98, "end": 4066.18, "text": "Chat gesagt, nicht 400, 400 find ich auch zu teuer, aber für 200 scheint mir das ganz"}, {"id": 655, "start": 4066.18, "end": 4084.94, "text": "ok zu sein, Gosund, so viel Gosund hier, was denn das, Alexa-Sternenhimmel-Projektor,"}, {"id": 656, "start": 4084.94, "end": 4089.7, "text": "die haben aber auch alles oder, auch Dinger von denen ich von der Existenz bis jetzt noch"}, {"id": 657, "start": 4089.7, "end": 4099.74, "text": "nix wusste, ein Alexa-Sternenhimmel-Projektor, was macht man mit einem, also ich mein mir"}, {"id": 658, "start": 4099.74, "end": 4108.82, "text": "ist klar damit projiziert man einen Sternenhimmel, aber will man sowas haben, schau mal was"}, {"id": 659, "start": 4108.82, "end": 4115.22, "text": "es für Raspberry Pis gibt, wahrscheinlich keine und wenn zu teuer, oder meinst du jetzt"}, {"id": 660, "start": 4115.22, "end": 4121.34, "text": "irgendwie Addons oder so, Sensoren, die Sensoren sind doch eh so billig, da musst du nicht"}, {"id": 661, "start": 4121.34, "end": 4136.34, "text": "im Prime Day kaufen, die meisten Sensoren kosten 2, 3 Euro und dann schon im 5er Pack, Montana"}, {"id": 662, "start": 4136.34, "end": 4141.66, "text": "Black findet sowas krass wegen Ambiente, ja aber Montana Black hat sicherlich kein 37"}, {"id": 663, "start": 4141.66, "end": 4148.26, "text": "Euro, eh, Gosund-Sternenhimmel-Projektor, sondern irgendwie sowas total übertrieben"}, {"id": 664, "start": 4148.26, "end": 4154.58, "text": "teures für 85.000 Euro, der irgendwie den gesamten Sternen-Katalog von sonst was mit"}, {"id": 665, "start": 4154.58, "end": 4161.14, "text": "eingebaut hat, gibt es eine gescheite, smarte Steckdose für Homo-System im Angebot, bin"}, {"id": 666, "start": 4161.14, "end": 4164.82, "text": "ich gerade am gucken, also das Gosund Zeug kann man halt wahrscheinlich nicht mehr flashen"}, {"id": 667, "start": 4164.82, "end": 4182.06, "text": "und dementsprechend sackt es, next, brau man alles nicht, brau man nicht, brau man nicht,"}, {"id": 668, "start": 4182.06, "end": 4189.46, "text": "brau man nicht, brau man nicht, was das, USB, ah ok, Adapter, Netzwerk, brau man nicht,"}, {"id": 669, "start": 4189.46, "end": 4193.9, "text": "brau man nicht, brau man nicht, brau man nicht, brau man nicht, so nächste Seite, brau"}, {"id": 670, "start": 4193.9, "end": 4198.3, "text": "man nicht, guck mal die Seite lädt schon gar nicht mehr, brau man nicht, brau man nicht,"}, {"id": 671, "start": 4198.3, "end": 4207.02, "text": "brau man nicht, ok, crap, next, Amazon Basics, hast du ein Link zum Sorge im Hintergrund,"}, {"id": 672, "start": 4207.02, "end": 4218.18, "text": "ja, nein nicht der Lindner, was macht der Lindner da, das ist die Mario 64 Musik, wenn"}, {"id": 673, "start": 4218.18, "end": 4234.7, "text": "die Piranha Pflanze schläft, ok die machen alle Werbung, das sollte ich jetzt auch mal"}, {"id": 674, "start": 4234.7, "end": 4246.1, "text": "machen, brau, brau, brau, muss ich auch irgendwie sowas reinhauen, Epic New Battlefield 3 Mod,"}, {"id": 675, "start": 4246.1, "end": 4255.18, "text": "Leute, richtig Clickbait Titel brauchen wir dafür, dieser Mod, also dieser Mod wird dein"}, {"id": 676, "start": 4255.18, "end": 4258.74, "text": "Leben verändern ist langweilig, weil die Leute haben mittlerweile gecheckt, dass diese"}, {"id": 677, "start": 4258.74, "end": 4274.74, "text": "Videotitel nicht funktionieren, heute musste die Leute anders baiten, Amazon Basics Kleiner"}, {"id": 678, "start": 4274.74, "end": 4289.3, "text": "Bügel, Pog, Amazon Basics Handtücher, Amazon Basics hat auch wirklich alles, vom Pflaster"}, {"id": 679, "start": 4289.3, "end": 4301.82, "text": "bis zum Kondom bis zum Wäschetrockner, alles Amazon Basics, oh das, Alter, das ist ein"}, {"id": 680, "start": 4301.82, "end": 4310.58, "text": "Massive Titel, das ist gut, der Titel hat zwar mit der Realität nichts zu tun, aber"}, {"id": 681, "start": 4310.58, "end": 4328.98, "text": "der Titel, den finde ich wirklich gut, dieser Mod wird von Dice verboten, weil er so gut"}, {"id": 682, "start": 4328.98, "end": 4334.54, "text": "ist oder so, was überhaupt nicht stimmt, aber das ist ja bei Clickbait nebensächlich, ob"}, {"id": 683, "start": 4334.54, "end": 4338.58, "text": "es stimmt, solange es in Funke Wahrheit hat, dass man sich irgendwie rausreden kann, ist"}, {"id": 684, "start": 4338.58, "end": 4352.94, "text": "das alles in Ordnung, ist das eine Hängematte, es gibt eine Amazon Basics Hängematte, Besen,"}, {"id": 685, "start": 4352.94, "end": 4364.42, "text": "Schirme, Vakuum Verpackungen, Vox, Safes, Kissen, Schraubenschlüssel, Dinger, wo ich"}, {"id": 686, "start": 4364.42, "end": 4374.38, "text": "keine Ahnung habe, was ist, Muffin, Förmchen oder sowas, Plastikdosen, es gibt, Alter,"}, {"id": 687, "start": 4374.38, "end": 4383.38, "text": "das ist ein Safe, Schüssel, Betten, Töpfe, Handtücher, Matratzen, Alter, 11 Seiten Amazon"}, {"id": 688, "start": 4383.38, "end": 4394.86, "text": "Basics, ernsthaft, ne, das wäre jetzt zu viel Amazon Basics, Dice möchte nicht, dass"}, {"id": 689, "start": 4394.86, "end": 4399.62, "text": "du diesen Mod kennst, ja, das ist auch, Leute, ich sehe, ich sehe, ich muss euch öfters"}, {"id": 690, "start": 4399.62, "end": 4411.74, "text": "fragen, was Titel angeht, ich muss euch öfters fragen, der Chat weiß Bescheid, okay genug"}, {"id": 691, "start": 4411.74, "end": 4418.58, "text": "Amazon Basics geguckt, Safe on Samsung, Sekunde Leute, ich muss mal kurz Licht einschalten"}, {"id": 692, "start": 4418.58, "end": 4423.54, "text": "hier und das Gute ist, wisst ihr, ich muss zum Licht einschalten, nicht mal mehr aufstehen,"}, {"id": 693, "start": 4423.54, "end": 4427.22, "text": "ich gehe jetzt auf den zweiten Bildschirm in mein Home Assistant rein und mache jetzt"}, {"id": 694, "start": 4427.22, "end": 4440.34, "text": "einen Klick und zack, ist mein Licht an der Decke an, so muss das sein, das hat Hauptsatz"}, {"id": 695, "start": 4440.34, "end": 4448.06, "text": "und Nebensatz, das ist schon wieder zu high IQ für YouTube Titel, stimmt auch wieder,"}, {"id": 696, "start": 4448.06, "end": 4463.06, "text": "weiss hast diesen Trick, ne, das ist ausgelutscht, das kennen die Leute schon, also M2 SSDs, SSDs,"}, {"id": 697, "start": 4463.06, "end": 4477.7, "text": "cool, das ist Samsung SSDs, interessiert mich jetzt nicht, Fritz, Moment, Netgear, was genau,"}, {"id": 698, "start": 4477.7, "end": 4482.3, "text": "sag mal, Sekunde, mein Rechner ist übelst ausgelastet, was ist hier denn los, ich muss"}, {"id": 699, "start": 4482.3, "end": 4492.34, "text": "mal kurz, muss mal kurz schauen, was hier mein Rechner so auslastet, der ist laggy,"}, {"id": 700, "start": 4492.34, "end": 4504.38, "text": "was lastet mein Rechner so aus, nix, Chet, lasst mal euer Hackerman Kram sein hier, wer"}, {"id": 701, "start": 4504.38, "end": 4517.34, "text": "von euch ist es, wer ist schon wieder drin hier, ich, ja, fünf Leute gleichzeitig, streiten"}, {"id": 702, "start": 4517.34, "end": 4525.46, "text": "sich gerade, wer zuerst den Keylogger deploit, dieses vier Fenstersymbol unten links könnte"}, {"id": 703, "start": 4525.46, "end": 4533.46, "text": "das Problem sein, das da, ja, das stimmt, das ist wahrscheinlich das Problem, das ist"}, {"id": 704, "start": 4533.46, "end": 4541.38, "text": "ja eigentlich auch das falsche Logo, das richtige Logo ist ja das hier, also Microsoft"}, {"id": 705, "start": 4541.38, "end": 4544.94, "text": "weiß selber nicht, wie ihr Windows Logo aussieht, das ist in Wirklichkeit das richtige Windows"}, {"id": 706, "start": 4544.94, "end": 4556.7, "text": "Logo, Continuous Integration für den Keylogger läuft schon, so mag ich das, der agile DevOps"}, {"id": 707, "start": 4556.7, "end": 4564.94, "text": "Ansatz hat sich durchgesetzt, also Netgear und Co. und da gibt es erstmal nur Fritzbox"}, {"id": 708, "start": 4564.94, "end": 4575.54, "text": "Stinger, ok, nice, GG Ease, Ease, Netgear, Fritzbox, was, was ist das, ah, ein WLAN,"}, {"id": 709, "start": 4575.54, "end": 4589.5, "text": "WLAN Mobile, WLAN LTE Router, alter den Crap braucht doch echt niemand."}, {"id": 710, "start": 4589.5, "end": 4605.5, "text": "Also Tender hört sich irgendwie an, wie eine Damenbinde weniger als nach einem Accesspoint,"}, {"id": 711, "start": 4605.5, "end": 4611.74, "text": "und was benutzt du so, hm, meine Tender, aber es hört sich nicht so nicht technisch"}, {"id": 712, "start": 4611.74, "end": 4626.26, "text": "an, Orbi kommt jetzt als nächstes, der Orbi, der Orbi, war das nicht in Black Ops, der"}, {"id": 713, "start": 4626.26, "end": 4636.9, "text": "Blackboard im nächsten Black Ops, war das nicht der Orbi, Black Ops 2, ja, der Orbi"}, {"id": 714, "start": 4636.9, "end": 4645.3, "text": "ist am Start, next, alter warum ist, das liegt am Darkreader, warum der Scheiß so langsam"}, {"id": 715, "start": 4645.3, "end": 4653.3, "text": "ist, ich sags euch, guckt euch das mal an, Flashbang, die Dinger sehen auch immer abgedrehter"}, {"id": 716, "start": 4653.3, "end": 4674.42, "text": "aus, das Teil, alter, oh man, so USB, ist ja alles Müll, braucht doch keiner, was genau"}, {"id": 717, "start": 4674.42, "end": 4683.22, "text": "hat es mit den restlichen Sachen zu tun, ach das ist ein WiFi, ein WiFi Bilderrahmen,"}, {"id": 718, "start": 4683.22, "end": 4693.14, "text": "690 Euro, warum kann ich mir den nicht einfach in Amazon Tablet an die Wand hängen und da"}, {"id": 719, "start": 4693.14, "end": 4700.46, "text": "ein Bild drauf anzeigen lassen, also dann doch lieber für 50 Euro sich ein Amazon Tablet"}, {"id": 720, "start": 4700.46, "end": 4705.54, "text": "kaufen, das ist wahrscheinlich, na ok, das ist nicht 41 mal 61, das ist schon ein bisschen"}, {"id": 721, "start": 4705.54, "end": 4712.1, "text": "größer, das ist Bilderrahmen SSService, ja wahrscheinlich, wenn du die Cloud App von"}, {"id": 722, "start": 4712.1, "end": 4716.42, "text": "denen nicht verwendest, gehts nicht, und nach einem halben Jahr stellen sie den Service ein"}, {"id": 723, "start": 4716.42, "end": 4720.54, "text": "und du kannst deinen Bilderrahmen nicht mehr benutzen, ich wette mit euch, du musst, das"}, {"id": 724, "start": 4720.54, "end": 4724.54, "text": "gucken wir uns jetzt an, ich wette mit euch, du musst die offizielle App dafür verwenden,"}, {"id": 725, "start": 4724.54, "end": 4732.66, "text": "anders geht es gar nicht, ihre Kunstsammlung ist jetzt endlos, ja die Leute sammeln die"}, {"id": 726, "start": 4732.66, "end": 4741.86, "text": "Dinger ja nicht, weil sie die auf dem digitalen Bilderrahmen anzeigen lassen wollen, das bestimmt"}, {"id": 727, "start": 4741.86, "end": 4751.58, "text": "eine proprietäre App, App, mit einer App bei Netgear, ich weiß nicht, ob das so das Qualitätsmerkmal"}, {"id": 728, "start": 4751.58, "end": 4764.86, "text": "ist, Moral App, die Moral App, da müssen wir jetzt gucken, ok, schau mal beschissene"}, {"id": 729, "start": 4764.86, "end": 4779.82, "text": "Bewertung, alles klar, nee, Moment, ganz gute Bewertung, das ist die richtige, Moral, oh"}, {"id": 730, "start": 4779.82, "end": 4787.94, "text": "es supporte NFT Items, ho, da bin ich aber beruhigt, hab schon gedacht, ich kann da meine"}, {"id": 731, "start": 4787.94, "end": 4796.66, "text": "NFTs nicht drauf anzeigen, bin ich aber froh, dass mein Bilderrahmen NFT Support hat, nochmal"}, {"id": 732, "start": 4796.66, "end": 4805.38, "text": "saved, saved, ich weiß, wenn man den Leuten jetzt erzählt, dass man die NFT Bilder darauf"}, {"id": 733, "start": 4805.38, "end": 4819.1, "text": "auch anzeigen kann, ohne dass man die NFTs besitzt, was machen sie dann?"}, {"id": 734, "start": 4819.1, "end": 4829.46, "text": "Noch mehr Amazon Basics, diesmal ist es ein Taker und ein Dokumentenvernichter, eine Laptoptasche"}, {"id": 735, "start": 4829.46, "end": 4836.14, "text": "und Batterien und Marker und Bleistift und Batterien und Noise Canceling Headphones von"}, {"id": 736, "start": 4836.14, "end": 4862.62, "text": "S-Rhythm, ach nee, S-Rhythm, ok, man muss das auch richtig, richtig lesen, Crap, Crap,"}, {"id": 737, "start": 4862.62, "end": 4873.02, "text": "ich hab keinen Bock, ok, what the fuck, Exit Page, oh, ach so, das Ding, das hatten wir"}, {"id": 738, "start": 4873.02, "end": 4879.94, "text": "doch schon, ok, weiter, glaub der Dark Reader, der Dark Reader macht wirklich gerade den Abgang,"}, {"id": 739, "start": 4879.94, "end": 4897.78, "text": "oh, oh, Chet, warum geht man Virenscanner so hoch, was macht ihr da wieder, was, was"}, {"id": 740, "start": 4897.78, "end": 4920.74, "text": "ist da wieder los, so was haben wir denn sonst noch, also gucken wir mal, Mobile-Dings-Probleme,"}, {"id": 741, "start": 4920.74, "end": 4938.7, "text": "so ein Device, das haben wir ja schon geguckt, Computer, Electronics, ok, auf geht's, ist"}, {"id": 742, "start": 4938.7, "end": 4944.44, "text": "jetzt beim Deploy-Step angekommen, ach deswegen, ja, dann versteh ich's, richtig, richtig"}, {"id": 743, "start": 4944.44, "end": 4958.46, "text": "agiles Mindset-Chat, habt ihr gut gemacht, aus Indien, die die sonst auch für den Microsoft-Gold-Support"}, {"id": 744, "start": 4958.46, "end": 4972.58, "text": "arbeiten, wir sind bestimmt die gleichen, ok, Müll, Müll, Müll, hatten die nicht mal"}, {"id": 745, "start": 4972.58, "end": 4978.54, "text": "eine Smart-Home-Kategorie, die hatten wir eine Smart-Home-Kategorie, die es aber irgendwie"}, {"id": 746, "start": 4978.54, "end": 5003.18, "text": "nicht mehr gibt, ok, schnell durchgegangen, Müll, Müll, Müll, Müll, Müll, alles Müll,"}, {"id": 747, "start": 5003.18, "end": 5022.14, "text": "Artefake, Artefake, ok, er war ja schon ganz ganz sehr gut, nonprofit."}, {"id": 748, "start": 5022.14, "end": 5036.46, "text": "zauerei was ein krasser chibate oder erstes was mich interessiert gibt es nicht tp link"}, {"id": 749, "start": 5036.46, "end": 5044.7, "text": "du hast jetzt zwei fire tv sticks geholt sonstig was machst du damit mit den fire ich finde"}, {"id": 750, "start": 5044.7, "end": 5061.54, "text": "den fire tv stick laggy schau pass auf was kommt was kommt jetzt was für ein ding ovo"}, {"id": 751, "start": 5061.54, "end": 5077.26, "text": "malteine crunchy cream brotaufstrich ohne palmöl ja dafür mit zeug ist das ist das pock"}, {"id": 752, "start": 5077.26, "end": 5092.14, "text": "ist das pock ich kenne das nicht das zeug ist pock oder not pock pock ja was sagt ihr"}, {"id": 753, "start": 5092.14, "end": 5104.3, "text": "versus versus nutella kennst du youtube werbung nicht nö ist es ist es pock ok"}, {"id": 754, "start": 5112.3, "end": 5112.8, "text": "crunchy"}, {"id": 755, "start": 5112.8, "end": 5127.48, "text": "wenn es aus das war aus der schweiz kommt dann taugt es die ich will kein abo guck mal"}, {"id": 756, "start": 5127.48, "end": 5133.88, "text": "amazon wieder die wollen mir ein ernsthaft ein brotaufstrich aber verkaufen ein one time"}, {"id": 757, "start": 5133.88, "end": 5147.8, "text": "purchase kein abo uu habe ich noch nie gehört chat bin ich nicht auf dem aktuellen stand aber"}, {"id": 758, "start": 5147.8, "end": 5171.92, "text": "jetzt kenne ich es auch brotaufstrich aber ja aber gucken wir jetzt nicht moment wo"}, {"id": 759, "start": 5171.92, "end": 5182.88, "text": "sind wir stehen geblieben ah hier so müll müll müll brauchen wir nicht müll next rasenmeer"}, {"id": 760, "start": 5182.88, "end": 5196.16, "text": "die rasenmeer brauche ich auch nicht unsinnig unsinnig unsinnig es gibt es gibt echt es ist"}, {"id": 761, "start": 5196.16, "end": 5203.44, "text": "wieder es ist für soviel so viel müll ich weiß auch nicht irgendwie"}, {"id": 762, "start": 5203.44, "end": 5226.8, "text": "wer kauft rasenmeer bei amazon ich würde rasenmeer bei amazon kaufen was jetzt passiert"}, {"id": 763, "start": 5226.8, "end": 5233.36, "text": "ich habe health und beauty angeklickt wollte ich ja gar nicht ich würde rasenmeer bei amazon kaufen"}, {"id": 764, "start": 5233.36, "end": 5239.4, "text": "gar kein problem ich habe leute ich habe sogar autoreifen bei amazon gekauft"}, {"id": 765, "start": 5239.4, "end": 5254.96, "text": "der witz hat jetzt auch schon es war auch gab auch schon lustigere comments was ist denn"}, {"id": 766, "start": 5254.96, "end": 5268.68, "text": "technisat irgendein uraltes label für fernseher mal mein opa hatte früher was von technisat"}, {"id": 767, "start": 5268.68, "end": 5273.44, "text": "das weiß ich noch also mir ist unklar also ich wusste bis jetzt nicht mehr dass es das"}, {"id": 768, "start": 5273.44, "end": 5288.4, "text": "überhaupt noch gibt technisat das ist sowas wie was es früher sonst noch gab so grundig"}, {"id": 769, "start": 5288.4, "end": 5293.6, "text": "und und und sonstige dinger was jetzt ich ist es nicht so grundig gehört in irgendeinem"}, {"id": 770, "start": 5293.6, "end": 5299.08, "text": "türkischen laden und und technisat was weiß ich 1987 gekündigt ja sag ich doch ich sag"}, {"id": 771, "start": 5299.08, "end": 5312.0, "text": "mein opa hatte auch so dinger technisat telefunken gab es auch noch stimmt nee sorry leute telefunken"}, {"id": 772, "start": 5312.0, "end": 5318.0, "text": "hatte der telefunken nicht technisat das habe ich durcheinander geschmissen oder nee der"}, {"id": 773, "start": 5318.0, "end": 5323.76, "text": "hatte doch der hatte ein dvbt empfänger von technisat das ist auch sowas alter mein opa"}, {"id": 774, "start": 5323.76, "end": 5328.76, "text": "ja da hat es teilweise auch ganz schön verkackt der hat mich gefragt was soll ich mir kaufen"}, {"id": 775, "start": 5328.76, "end": 5336.32, "text": "ja also der wollte fernseh gucken der hat fernseh geguckt analog über antenne und irgendwie"}, {"id": 776, "start": 5336.32, "end": 5340.52, "text": "haben die dann analog über antenne abgeschaltet und dann wollte er weiter fernseh gucken und"}, {"id": 777, "start": 5340.52, "end": 5350.0, "text": "er hat gesagt aha was soll ich also was soll ich jetzt kaufen und ich habe gesagt opa entweder"}, {"id": 778, "start": 5350.0, "end": 5353.52, "text": "du lässt endlich mal einen kabelanschluss ins haus legen was der damals nicht wollte"}, {"id": 779, "start": 5353.52, "end": 5358.88, "text": "was uns jetzt saumäßig viel geld gekostet hat oder du holst die satellitenschüssel lass"}, {"id": 780, "start": 5358.88, "end": 5369.12, "text": "dvbt sein krab gerade am anfang was hat er gemacht er hat nicht auf mich gehört er ist"}, {"id": 781, "start": 5369.12, "end": 5374.12, "text": "in einen lokalen elektronikladen gegangen hat sich einen technisat receiver gekauft"}, {"id": 782, "start": 5374.12, "end": 5384.48, "text": "und hatte über dvbt geguckt und das hat permanent rumgeruckelt und dann hat er mich immer gefragt"}, {"id": 783, "start": 5384.48, "end": 5388.0, "text": "so nach dem motto ha der fernseh geht nicht kannst du mal gucken"}, {"id": 784, "start": 5388.0, "end": 5397.2, "text": "ja oma kauft ihr eine satellitenschüssel den weißen hintergrund ist ganz einfach wie"}, {"id": 785, "start": 5397.2, "end": 5401.12, "text": "ich mir das mit dem weißen hintergrund geben kann weil der dark reader auf amazon einfach"}, {"id": 786, "start": 5401.12, "end": 5404.12, "text": "den kompletten browser den kompletten rechner load"}, {"id": 787, "start": 5404.12, "end": 5419.16, "text": "ne blink ist müll würde ich mir nie kaufen an kameras genauso wie ich mir auch nie eins"}, {"id": 788, "start": 5419.16, "end": 5426.2, "text": "von diesen komischen türklingeln kaufen würde die nur mit abgehen das muss alles über rtsp"}, {"id": 789, "start": 5426.2, "end": 5432.6, "text": "oder irgendwie zumindest mal emotion jpeg oder sonst was über irgendwas normales abrufbar"}, {"id": 790, "start": 5432.6, "end": 5439.92, "text": "sein natürlich rtsp mit einem h264 stream am besten und dann ist gut alles andere ist"}, {"id": 791, "start": 5439.92, "end": 5446.6, "text": "dreck ring ist genauso müll kommt mir in ihm lebe nicht ins haus"}, {"id": 792, "start": 5446.6, "end": 5454.24, "text": "habe ich heute werbung gesehen auf twitter da hat irgendeine firma ihren blog post beworben"}, {"id": 793, "start": 5454.24, "end": 5459.36, "text": "so nach dem motto wie können wir das internet of things sicherer machen mal gucken ob ich"}, {"id": 794, "start": 5459.36, "end": 5460.36, "text": "das noch finde"}, {"id": 795, "start": 5460.36, "end": 5466.92, "text": "tweets and replies steht das da"}, {"id": 796, "start": 5466.92, "end": 5473.36, "text": "ja guck mal hier haben irgendwie werbung gemacht hier wie können wir das internet of things"}, {"id": 797, "start": 5473.36, "end": 5479.2, "text": "sicherer machen vor der bedrohung schützen leute die einfachste variante ist ein smart"}, {"id": 798, "start": 5479.2, "end": 5484.52, "text": "home shit nicht ins internet stellen aber das wollen die hersteller nicht die hersteller"}, {"id": 799, "start": 5484.52, "end": 5489.84, "text": "wollen wenn du log in bei der smartphone app die hersteller wollen irgendwelche komischen"}, {"id": 800, "start": 5489.84, "end": 5494.04, "text": "proprietären cloud geschichten die wollen dass du das ding nicht autonomen dass du das"}, {"id": 801, "start": 5494.04, "end": 5498.86, "text": "ding vor ort ansprechen kannst die wollen auch nicht dass du sind irgendwelche smart"}, {"id": 802, "start": 5498.86, "end": 5502.92, "text": "home lösungen integriert die nicht ihre sind die wollen dass du ihren scheiß benutzt mit"}, {"id": 803, "start": 5502.92, "end": 5507.52, "text": "always on und china chinesen cloud also es ist jetzt nicht so als wüsste man nicht was"}, {"id": 804, "start": 5507.52, "end": 5525.6, "text": "man dagegen machen kann die wollen da bloß nichts dagegen machen"}, {"id": 805, "start": 5525.6, "end": 5530.88, "text": "deswegen flashe ich ja auch alles was flaschbar ist und was nicht flaschbar ist kommt in meinen"}, {"id": 806, "start": 5530.88, "end": 5536.04, "text": "china chinesen wlan was nirgends wohin darf weder ins internet das einzige was man china"}, {"id": 807, "start": 5536.04, "end": 5542.04, "text": "chinesen wlan da fürs ntp machen auf meinen router das aber auch das auch komplett alles"}, {"id": 808, "start": 5542.04, "end": 5559.24, "text": "und geräte die gar nicht lokal kommunizieren die kaufe ich mir gar nicht"}, {"id": 809, "start": 5559.24, "end": 5566.2, "text": "es ist so viel überflüssiger müll dabei mama ruft an save und wo davon ohje ich ahne"}, {"id": 810, "start": 5566.2, "end": 5577.36, "text": "schlimmes kann man diese show me waage flaschen nein nicht direkt aber die musst du auch nicht"}, {"id": 811, "start": 5577.36, "end": 5587.72, "text": "flaschen also meinst du die ich habe also meinst hier die da du meinst diese waage"}, {"id": 812, "start": 5587.72, "end": 5593.8, "text": "also warum ist das"}, {"id": 813, "start": 5593.8, "end": 5598.52, "text": "da kann die seite mal funktionieren please"}, {"id": 814, "start": 5598.52, "end": 5615.48, "text": "du meinst diese war die seite ist total überlastet da geht nichts"}, {"id": 815, "start": 5615.48, "end": 5633.0, "text": "seite müde seite schlafen du meinst diese waage hier also die kannst du nicht flaschen"}, {"id": 816, "start": 5633.0, "end": 5643.92, "text": "aber die musst du auch nicht flaschen weil die waage kann ihre wie grugen per bluetooth"}, {"id": 817, "start": 5643.92, "end": 5651.04, "text": "also kann man die abfragen die waage schickt die sachen e per bluetooth raus und die kannst"}, {"id": 818, "start": 5651.04, "end": 5657.08, "text": "du mit jedem x beliebigen esp 32 abgreifen die musst du nicht flaschen ich glaube du"}, {"id": 819, "start": 5657.08, "end": 5663.12, "text": "kannst die noch nicht mal ins internet packen die waage du kannst die höchsten sparen mit"}, {"id": 820, "start": 5663.12, "end": 5671.96, "text": "der offiziellen app und das dann auslesen musst du aber nicht die geht auch so per bluetooth"}, {"id": 821, "start": 5671.96, "end": 5681.24, "text": "ja die kann auch körperfettanteil warum machst du das immer mit der 1 weil ich mir das angewöhnt"}, {"id": 822, "start": 5681.24, "end": 5689.04, "text": "habe total unsinnig nicht nachmachen oder sich nicht angewöhnen so also was kann ich"}, {"id": 823, "start": 5689.04, "end": 5704.4, "text": "denn auch ein vodafone saufen die vodafone smartwatch ich weiß ja nicht ich will eh keine"}, {"id": 824, "start": 5704.4, "end": 5717.24, "text": "smartwatch aber eine smartwatch von vodafone glaubt noch weniger oppo ist billiger hammer"}, {"id": 825, "start": 5717.24, "end": 5727.36, "text": "ist billiger bontech ist billiger kabel direkt ist billiger na dann vielleicht sind das echt"}, {"id": 826, "start": 5727.36, "end": 5733.6, "text": "paar ganz praktische verlängerungs sachen dabei perl smith habe ich noch nie gehört"}, {"id": 827, "start": 5733.6, "end": 5750.72, "text": "ist aber auch billiger amazon hat echt alles mittlerweile pumpen billiger bayern münchen"}, {"id": 828, "start": 5750.72, "end": 5758.48, "text": "fanartikel billiger meine güte ist aber nix dabei was ich habe apc ok gucken wir mal"}, {"id": 829, "start": 5758.48, "end": 5764.12, "text": "gibt es vielleicht paar sinnvolle us v vielleicht hole ich mir dann doch mal wieder eine batterien"}, {"id": 830, "start": 5764.12, "end": 5777.36, "text": "billiger doando günstiger ob das was taugt das ist bestimmt irgend so ein china chinesen"}, {"id": 831, "start": 5777.36, "end": 5784.52, "text": "hersteller von perreferie die versuchen krass auszusehen aber von der hardware her halt"}, {"id": 832, "start": 5784.52, "end": 5796.36, "text": "sachen"}, {"id": 833, "start": 5796.36, "end": 5805.68, "text": "ja barbie bei ich habs gesehen ich gette den witz nicht so ganz"}, {"id": 834, "start": 5805.68, "end": 5816.96, "text": "wassapp sim weil die haben simkarten ich war heute in einer eis stile eis essen und"}, {"id": 835, "start": 5816.96, "end": 5826.48, "text": "die hatten allen ernstes wassapp eis kein spaß ich habe ja auch noch mal habe ich jetzt"}, {"id": 836, "start": 5826.48, "end": 5832.72, "text": "richtig gesehen daneben gab es barbie eis und bine maya eis und alles mögliche und irgendwo"}, {"id": 837, "start": 5832.72, "end": 5843.12, "text": "zwischendrin wassapp eis ja weird champ weiß ich nicht was das schmeckt ich habe mir das"}, {"id": 838, "start": 5843.12, "end": 5859.56, "text": "nicht geholt zwar grün wassapp eis kurz gucken ob ich wassapp eis ob man das findet da findest"}, {"id": 839, "start": 5859.56, "end": 5865.2, "text": "der jetzt natürlich sonst was"}, {"id": 840, "start": 5865.2, "end": 5873.8, "text": "ja wassapp eis gabs ich verstehe nicht warum wir gigabit verträge haben sollten nicht"}, {"id": 841, "start": 5873.8, "end": 5878.92, "text": "alles unlimited sein tja wir sind in deutschland also nicht so easy mit internet sachen ich"}, {"id": 842, "start": 5878.92, "end": 5885.08, "text": "mein unlimited muss ja nicht sein aber wenn sich das in regionen abspielt wo du eigentlich"}, {"id": 843, "start": 5885.08, "end": 5890.0, "text": "bedenkenlos surfen kannst ist alles ok es gibt ja mittlerweile verträge die ganz ok"}, {"id": 844, "start": 5890.0, "end": 5894.88, "text": "sind und das ist tatsächlich die letzten jahre über sehr viel besser geworden ich habe ja"}, {"id": 845, "start": 5894.88, "end": 5898.92, "text": "noch vor drei vier jahren das übelste oder vier fünf jahre schon bisschen übelste rent"}, {"id": 846, "start": 5898.92, "end": 5915.52, "text": "video gemacht über kak handy verträge mittlerweile ist es besser"}, {"id": 847, "start": 5915.52, "end": 5920.64, "text": "ne das ist nicht die eisdiele in der ich heute war bei der eisdiele wo ich heute war war"}, {"id": 848, "start": 5920.64, "end": 5925.12, "text": "vorne das schild whatsapp und es hatte sogar ein selbstgemaltes whatsapp logo auf dem schild"}, {"id": 849, "start": 5925.12, "end": 5937.36, "text": "drauf und stand whatsapp eis"}, {"id": 850, "start": 5937.36, "end": 5941.12, "text": "brauche man nicht brauche man auch alles nicht"}, {"id": 851, "start": 5941.12, "end": 5946.24, "text": "acer notebooks könnte man vielleicht gebrauchen brauche ich nicht"}, {"id": 852, "start": 5946.24, "end": 5948.12, "text": "ryzen brauche ich jetzt auch nicht mehr"}, {"id": 853, "start": 5948.12, "end": 5959.6, "text": "hp ok da steht hp ja aber auf dem bild sieht man rocket logitech und kosa was auch immer"}, {"id": 854, "start": 5959.6, "end": 5960.6, "text": "das mit hp zu tun hat"}, {"id": 855, "start": 5960.6, "end": 5978.08, "text": "razor nicht rocket richtig ihr habt recht chat chat halt wieder richtig high iq messig"}, {"id": 856, "start": 5978.08, "end": 5994.52, "text": "drauf einfach giga chat der chat heute wieder auch unsinnig unsinnig unsinnig unsinnig unsinnig"}, {"id": 857, "start": 5994.52, "end": 6011.72, "text": "fahrradhelm ok nicht unsinnig aber brauche ich nicht"}, {"id": 858, "start": 6011.72, "end": 6019.2, "text": "das kommt mir was war denn minis das sagt mir irgendwas minis forum da klingelt irgendwas"}, {"id": 859, "start": 6019.2, "end": 6024.76, "text": "im hinterkopf ich kann es nicht mehr genau zuordnen sagt euch minis forum was irgendwie"}, {"id": 860, "start": 6024.76, "end": 6029.36, "text": "kommt mir der name bekannt vor"}, {"id": 861, "start": 6029.36, "end": 6032.44, "text": "der bauer das was mit dem bauer zu tun"}, {"id": 862, "start": 6032.44, "end": 6050.2, "text": "13 monate kann sein dass ich von denen was gesehen habe auf youtube aber irgendwie sagt"}, {"id": 863, "start": 6050.2, "end": 6055.52, "text": "mir das was für ein handy vertrag ich habe kann ich dir nicht sagen ich habe ein iphone"}, {"id": 864, "start": 6055.52, "end": 6060.62, "text": "von der firma wo ich arbeite mit einem vertrag von der firma wo ich arbeite also ich hab"}, {"id": 865, "start": 6060.62, "end": 6065.0, "text": "gibt es irgendwo eine webseite von der telekom wo man irgendwas von der telekom ist es wo"}, {"id": 866, "start": 6065.0, "end": 6067.0, "text": "man nachgucken kann"}, {"id": 867, "start": 6067.0, "end": 6071.56, "text": "die telekom vertrag und wenn ich auf die seite gehe aus dem telekom netz dann sehe ich was"}, {"id": 868, "start": 6071.56, "end": 6074.56, "text": "ich habe"}, {"id": 869, "start": 6074.56, "end": 6082.56, "text": "wenn ihr mir sagt wo das wo das"}, {"id": 870, "start": 6082.56, "end": 6088.36, "text": "mit der magent in die stelle mir keine magenta ab jetzt pass punkt telekom punkt e alles"}, {"id": 871, "start": 6088.36, "end": 6095.88, "text": "klar pass punkt telekom punkt de"}, {"id": 872, "start": 6095.88, "end": 6100.4, "text": "informationen für den aufruf dieser seite ist ein internetverbindung über das mobilfunknetz"}, {"id": 873, "start": 6100.4, "end": 6101.4, "text": "bla bla bla"}, {"id": 874, "start": 6101.4, "end": 6106.76, "text": "achso moment muss ich wählen ausschalten"}, {"id": 875, "start": 6106.76, "end": 6120.08, "text": "also ich habe your telekom data plan 20 gigabyte im monat"}, {"id": 876, "start": 6120.08, "end": 6121.08, "text": "habe ich"}, {"id": 877, "start": 6121.08, "end": 6149.0, "text": "das steht aber nicht dabei wie der vertrag heißt"}, {"id": 878, "start": 6149.0, "end": 6159.64, "text": "kann ich euch jetzt auch nicht sagen 20 gigabyte ja also nicht 20 gigabyte verbraucht sondern"}, {"id": 879, "start": 6159.64, "end": 6164.04, "text": "20 gigabyte ist darf ich monatlich verbrauchen"}, {"id": 880, "start": 6164.04, "end": 6184.32, "text": "schon wieder obi dokumenten ordner"}, {"id": 881, "start": 6184.32, "end": 6200.16, "text": "was ist das"}, {"id": 882, "start": 6200.16, "end": 6201.16, "text": "ist das ein lüfter"}, {"id": 883, "start": 6201.16, "end": 6215.36, "text": "erkennt ihr das ist das ein lüfter"}, {"id": 884, "start": 6215.36, "end": 6217.36, "text": "ein ventilator mit ab"}, {"id": 885, "start": 6217.36, "end": 6220.32, "text": "er ist ganz wichtig für den ventilator dass der eine app hat"}, {"id": 886, "start": 6220.32, "end": 6222.84, "text": "wie könnte man nur einen ventilator ohne app bedienen"}, {"id": 887, "start": 6222.84, "end": 6234.0, "text": "unglaublich wie geht das nur hexenwerk"}, {"id": 888, "start": 6234.0, "end": 6237.44, "text": "der zoomer der zoomer ventilator das braucht eine app sonst geht das nicht"}, {"id": 889, "start": 6237.44, "end": 6249.28, "text": "lgb ram wichtig"}, {"id": 890, "start": 6249.28, "end": 6252.16, "text": "mehr frames lgb ram ist tatsächlich an dem moment"}, {"id": 891, "start": 6252.16, "end": 6262.6, "text": "nicht lgb ne doch lgb ram und lgb m2 ssd"}, {"id": 892, "start": 6262.6, "end": 6265.04, "text": "habt ihr led strips ja"}, {"id": 893, "start": 6265.04, "end": 6266.04, "text": "relativ"}, {"id": 894, "start": 6266.04, "end": 6270.04, "text": "ne und eine unterboden belichtung habe ich nicht"}, {"id": 895, "start": 6270.04, "end": 6274.32, "text": "ich habe led strips eben hier im fenster"}, {"id": 896, "start": 6274.32, "end": 6283.2, "text": "ich habe led strips wo habe ich denn überhaupt alles welche"}, {"id": 897, "start": 6283.2, "end": 6288.64, "text": "überlegen wo habe ich led ich habe alles mit wled selbst gebaut"}, {"id": 898, "start": 6288.64, "end": 6290.96, "text": "also an der treppe für die beleuchtung habe ich"}, {"id": 899, "start": 6290.96, "end": 6294.8, "text": "hier am fenster habe ich"}, {"id": 900, "start": 6294.8, "end": 6304.76, "text": "unten in der kirche am fenster habe ich für den weihnachtsbaum habe ich aber das kein"}, {"id": 901, "start": 6304.76, "end": 6311.56, "text": "led strip das ist so eine so eine kette aber halt auch mit wled zum ansteuern"}, {"id": 902, "start": 6311.56, "end": 6312.84, "text": "ich glaube das war es"}, {"id": 903, "start": 6312.84, "end": 6334.24, "text": "ich habe das anders gemacht ich habe die strips in so einen diffusor gemacht"}, {"id": 904, "start": 6334.24, "end": 6336.08, "text": "und den dann ans fenster geklebt"}, {"id": 905, "start": 6336.08, "end": 6343.64, "text": "welche led strips nutzt du da das kann ich dir aus dem kopf nicht sagen ich glaube sk6"}, {"id": 906, "start": 6343.64, "end": 6346.32, "text": "ok warte led sk so was da"}, {"id": 907, "start": 6346.32, "end": 6347.32, "text": "glaube"}, {"id": 908, "start": 6347.32, "end": 6356.44, "text": "die könnten das sein bin ich mir jetzt ehrlich gesagt nicht ganz sicher"}, {"id": 909, "start": 6356.44, "end": 6358.72, "text": "es sind auf jeden fall welche mit weiß dabei"}, {"id": 910, "start": 6358.72, "end": 6367.6, "text": "und ich steuere das ja das ist überhaupt was ist ein steuerbar ich mache das ich steuere"}, {"id": 911, "start": 6367.6, "end": 6369.0, "text": "das alles mit wled"}, {"id": 912, "start": 6369.0, "end": 6386.28, "text": "wled ist ziemlich hog ich kann euch zeigen wie das aussieht"}, {"id": 913, "start": 6386.28, "end": 6393.72, "text": "sag muss man nur die ip raussuchen von dem teil"}, {"id": 914, "start": 6393.72, "end": 6398.32, "text": "einstellungen integrationen wled"}, {"id": 915, "start": 6398.32, "end": 6410.0, "text": "so sieht das aus bei mir"}, {"id": 916, "start": 6410.0, "end": 6416.88, "text": "die wled version ist übrigens auch uralt gehe ich mal von aus hier"}, {"id": 917, "start": 6416.88, "end": 6421.6, "text": "da kannst du hier oben einstellen welche farbe du haben willst"}, {"id": 918, "start": 6421.6, "end": 6426.44, "text": "da kannst du noch einstellen sättigung und und helligkeit und gedöns"}, {"id": 919, "start": 6426.44, "end": 6429.28, "text": "da kannst du einstellen ob du effekte haben willst"}, {"id": 920, "start": 6429.28, "end": 6435.16, "text": "ich habe zum beispiel den multi candle effekt dann flackert das so leicht aber halt jede"}, {"id": 921, "start": 6435.16, "end": 6436.52, "text": "jede led ein bisschen anders"}, {"id": 922, "start": 6436.52, "end": 6443.88, "text": "das ist das ist das ist das was ich an der treppe hab"}, {"id": 923, "start": 6443.88, "end": 6447.64, "text": "oh nein ip leak schon wieder"}, {"id": 924, "start": 6447.64, "end": 6452.12, "text": "ah jetzt ist jetzt ist"}, {"id": 925, "start": 6452.12, "end": 6456.48, "text": "erst hacker man meinen browser alarm gelegt und jetzt auch bald noch mein led strip"}, {"id": 926, "start": 6456.48, "end": 6470.12, "text": "sieht das dann so aus wie bei ich weiß nicht wer das ist"}, {"id": 927, "start": 6470.12, "end": 6471.28, "text": "ja also das ist nice"}, {"id": 928, "start": 6471.28, "end": 6478.72, "text": "turbo dead end danke schön für den sub danke leute für die ganzen subs heute ich hab bestimmt"}, {"id": 929, "start": 6478.72, "end": 6479.72, "text": "wieder die hälfte übersehen"}, {"id": 930, "start": 6479.72, "end": 6495.36, "text": "ja das mein led strip let's go"}, {"id": 931, "start": 6495.36, "end": 6501.32, "text": "das kann passieren das passiert folgendermaßen wenn du led strips kaufst die nur rgb haben"}, {"id": 932, "start": 6501.32, "end": 6507.88, "text": "und nicht rgbw wenn du led strips hast die also es gibt bei led strips eigentlich zwei"}, {"id": 933, "start": 6507.88, "end": 6513.08, "text": "grundsätzliche unterschiede es gibt welche mit drei farben und welche mit vier farben"}, {"id": 934, "start": 6513.08, "end": 6515.04, "text": "vier farben ist ganz normal rgb"}, {"id": 935, "start": 6515.04, "end": 6520.28, "text": "er drei farben ist ganz normal rgb und vier farben ist rgb plus weiß hat den vorteil und"}, {"id": 936, "start": 6520.28, "end": 6525.12, "text": "dann kann man meistens dieses strips noch in unterschiedlichen weiß tönen kaufen der"}, {"id": 937, "start": 6525.12, "end": 6528.68, "text": "vorteil ist dass weiß bei diesen leds auch wirklich weiß ist"}, {"id": 938, "start": 6528.68, "end": 6538.8, "text": "und ansonsten wenn die blau sind gibt es verschiedene varianten entweder hast du rgb vertauscht also"}, {"id": 939, "start": 6538.8, "end": 6547.36, "text": "dass es dann vielleicht gar nicht rgb ist sondern bg ra oder gbr oder sowas oder aber"}, {"id": 940, "start": 6547.36, "end": 6551.84, "text": "das mischen von allen farben kommt halt auf den bläulichen ton raus und dann musst du"}, {"id": 941, "start": 6551.84, "end": 6556.6, "text": "es halt so so justieren dass es dass es die passende farbe gibt"}, {"id": 942, "start": 6556.6, "end": 6569.2, "text": "ja was es gibt auch rgb y was ist denn y ich mein rot grün blau ok weiß und was ist y"}, {"id": 943, "start": 6569.2, "end": 6577.68, "text": "yellow ah das ist dass du den weiß ton selbst einstellen kannst oder wie das ist natürlich"}, {"id": 944, "start": 6577.68, "end": 6582.48, "text": "ganz clever"}, {"id": 945, "start": 6582.48, "end": 6591.0, "text": "ich habe schon gesehen kann ich kann ich mich trauen nee achja naja gesehen nicht können"}, {"id": 946, "start": 6591.0, "end": 6595.28, "text": "wir uns gucken wir uns gucken wir uns gleich noch an zusammen ich verfolge die schon seit"}, {"id": 947, "start": 6595.28, "end": 6606.04, "text": "jahren auf discord das projekt ja keine benutzen ich hatte auch eine lange zeit habe ich sogar"}, {"id": 948, "start": 6606.04, "end": 6609.32, "text": "mal im stream gezeigt aber ich muss ehrlich sagen ich verstehe den sinn nicht für start"}, {"id": 949, "start": 6609.32, "end": 6617.64, "text": "pages keine benutzen browser bookmarks machen fertig wozu brauchst du start pages ich habe"}, {"id": 950, "start": 6617.64, "end": 6621.08, "text": "mir auch eine gemacht einfach weil es cool aussieht für das video wo ich es mal gezeigt"}, {"id": 951, "start": 6621.08, "end": 6626.24, "text": "habe aber ansonsten ich verstehe den sinn von start pages nicht bookmarks im browser"}, {"id": 952, "start": 6626.24, "end": 6645.04, "text": "fertig geht schneller brauchst du keine extra seite ja ok wenn es für mehrere leute sind"}, {"id": 953, "start": 6645.04, "end": 6652.08, "text": "ja homer habe ich auch verwendet gibt es aber massig verschiedene dashboard sachen ja ok"}, {"id": 954, "start": 6652.08, "end": 6658.52, "text": "wenn du es mit für mehrere verwendest dann verstehe ich das ja aber intern weiß nicht"}, {"id": 955, "start": 6658.52, "end": 6669.52, "text": "ok wenn man von ja verstehe ich auch leuchte mir ein wenn man von außen drauf zugreift"}, {"id": 956, "start": 6669.52, "end": 6679.48, "text": "ok ja sind alles anwendungsszenarien die habe ich nicht aber das verstehe ich ja ein portable"}, {"id": 957, "start": 6679.48, "end": 6692.92, "text": "fan i wish an e wish oh ja das klingt ja definitiv nach einer maus die ich haben möchte i wish"}, {"id": 958, "start": 6692.92, "end": 6713.68, "text": "ane wish noiseless klick ach das ist fürs tablet ein fernklaas ich wollte mir wirklich"}, {"id": 959, "start": 6713.68, "end": 6720.08, "text": "letztens in fernklaas fernklaas kaufen aber ich gehe davon aus dass dieses fernklaas"}, {"id": 960, "start": 6720.08, "end": 6726.84, "text": "was hier bei amazon ist wahrscheinlich sacken wird das ist doch china bea bang be bang das"}, {"id": 961, "start": 6726.84, "end": 6733.08, "text": "ist china kram wobei ich meine das ist ja im prinzip nur ein klaas also vielleicht können"}, {"id": 962, "start": 6733.08, "end": 6738.04, "text": "die china chinesen das warum kann ich dir erklären nicht was die leute jetzt wieder"}, {"id": 963, "start": 6738.04, "end": 6742.52, "text": "sagen so nach dem motto null max du willst irgendwo reingucken oder sonst was zum beispiel"}, {"id": 964, "start": 6742.52, "end": 6747.28, "text": "wenn ich wandern gehe frage ich mich öfters mal was ist das denn da was ich da in der"}, {"id": 965, "start": 6747.28, "end": 6751.32, "text": "entfernung sehe zum beispiel in irgendwelche gebäude wenn ich für die nachdenklich kann"}, {"id": 966, "start": 6751.32, "end": 6755.04, "text": "es nicht genau erkennen und da habe ich mir schon öfters überlegt ich sollte mir vielleicht"}, {"id": 967, "start": 6755.04, "end": 6773.92, "text": "mal fernklaas mitnehmen ein wandern korrekt ich war fenster oma fenster boomer also wenn"}, {"id": 968, "start": 6773.92, "end": 6777.72, "text": "ihr demnächst in hanau einen am fenster stehen seht mit fernklaas der so aussieht dann bin"}, {"id": 969, "start": 6777.72, "end": 6797.04, "text": "ich das"}, {"id": 970, "start": 6797.04, "end": 6807.52, "text": "oma face usfaus stimmt usfaus wollte ich gucken haben wir noch ein paar aufgemacht hier es"}, {"id": 971, "start": 6807.52, "end": 6814.84, "text": "gibt usfaus der hersteller soll er laut chat ganz gut sein qnap juckt mich nett wo habe"}, {"id": 972, "start": 6814.84, "end": 6819.96, "text": "ich denn die eher oma usfaus also ok das ist alles keine rekbauweise das wäre aber auch"}, {"id": 973, "start": 6819.96, "end": 6831.36, "text": "nicht schlimm"}, {"id": 974, "start": 6831.36, "end": 6844.56, "text": "ja die in rek rek form gibt es natürlich nicht aber trotzdem haben die ein usb anschluss"}, {"id": 975, "start": 6844.56, "end": 6851.24, "text": "oder sind die unmanaged oder wie nennt man das bei usfaus die sind komplett an nee die"}, {"id": 976, "start": 6851.24, "end": 6879.6, "text": "haben usb die haben einen kleinen webserver mit drinne das stelle ich mir merkwürdig"}, {"id": 977, "start": 6879.6, "end": 6886.8, "text": "das stelle ich mir komisch vor wenn die was internet mode wollte gerade sagen die haben"}, {"id": 978, "start": 6886.8, "end": 6891.44, "text": "doch gar kein netzwerkanschluss aber doch die haben wir netzwerkanschluss leute chat"}, {"id": 979, "start": 6891.44, "end": 6898.24, "text": "taugen die ich meine jetzt nicht von der ich nicht von der leistung her das reicht für"}, {"id": 980, "start": 6898.24, "end": 6909.8, "text": "meinen schrank locker aus und viel wichtiger wenn der strom an ist und die batterie kaputt"}, {"id": 981, "start": 6909.8, "end": 6919.88, "text": "geht bleibt es dann an ich weiß nicht ich glaube ich bleib weiter ohne usf ich hab bisher"}, {"id": 982, "start": 6919.88, "end": 6924.52, "text": "nur negative erfahrungen im heimbereich mit usfaus bei mir ist mehr durch die usf kaputt"}, {"id": 983, "start": 6924.52, "end": 6936.64, "text": "gegangen als ohne usf kaputt gegangen wäre"}, {"id": 984, "start": 6936.64, "end": 6946.52, "text": "anker es gibt ja wirklich nix ne es gibt einfach nix also nix was irgendwie sich für mich"}, {"id": 985, "start": 6946.52, "end": 6958.0, "text": "lohnen würde hallo möchtest schließen please schließen schließen ok na guck ich doch mal"}, {"id": 986, "start": 6958.0, "end": 6966.56, "text": "schnell smart home durch du hättest eine smarte klingel ich würde aber nicht die smarten"}, {"id": 987, "start": 6966.56, "end": 6973.48, "text": "klingeln kaufen mit app zwang und vendor log in was willst du als smarte klingel haben"}, {"id": 988, "start": 6973.48, "end": 6979.32, "text": "willst du nur eine klingel wo du auf dem handy mitbekommst wenn es geklingelt hat das ließe"}, {"id": 989, "start": 6979.32, "end": 6985.14, "text": "sich ziemlich easy nachrüsten oder willst du eine klingel die wirklich bild streamt"}, {"id": 990, "start": 6985.14, "end": 6991.72, "text": "und du mit dem typ sprechen kannst übers handy dann wird es schwieriger dann brauchst"}, {"id": 991, "start": 6991.72, "end": 7002.32, "text": "du wahrscheinlich was neues ja benachrichtigung aufs handy ist einfach dass das da gibt es"}, {"id": 992, "start": 7002.32, "end": 7008.32, "text": "sehr viele möglichkeiten das zu machen also die einfachste variante ohne dass du an der"}, {"id": 993, "start": 7008.32, "end": 7015.64, "text": "dass du da ohne dass du an die verkabelung dran muss ist du machst den sp 32 sp 82 66"}, {"id": 994, "start": 7015.64, "end": 7024.36, "text": "controller an die an an die klingel oder an das telefon wo es klingelt mit einem sensor"}, {"id": 995, "start": 7024.36, "end": 7031.12, "text": "der eben checkt wenn es besonders laut ist daneben das funktioniert eigentlich ganz"}, {"id": 996, "start": 7031.12, "end": 7037.96, "text": "gut wenn man wirklich gar nicht eingreifen darf in die verkabelung das geht relativ einfach"}, {"id": 997, "start": 7037.96, "end": 7044.08, "text": "und falls du die 5 volt für den sp anzapfen kann es natürlich noch besser wenn du wenn"}, {"id": 998, "start": 7044.08, "end": 7050.0, "text": "du an die verkabelung dran kannst dann kann man vielleicht noch mehr machen aber das einfachste"}, {"id": 999, "start": 7050.0, "end": 7056.0, "text": "ist tatsächlich microcontroller dran mit so einem mikrofon sensor der dich dann benachrichtigt"}, {"id": 1000, "start": 7056.0, "end": 7067.84, "text": "wenn es geklingelt hat das ist relativ einfach zu machen"}, {"id": 1001, "start": 7067.84, "end": 7074.32, "text": "und ich habe gar keinen bock weiter zu weiter zu scrollen weil es eh nichts gibt ein senioren"}, {"id": 1002, "start": 7074.32, "end": 7090.76, "text": "telefon sowas hatte ich meinem opa mal gekauft vor langer zeit"}, {"id": 1003, "start": 7090.76, "end": 7098.16, "text": "raspberry pi starter kit aha es gibt ein raspberry pi nee es gibt kein raspberry pi"}, {"id": 1004, "start": 7098.16, "end": 7116.2, "text": "es gibt eine überteuerte teile sammlung für ein raspberry pi ja gut das braucht keiner"}, {"id": 1005, "start": 7116.2, "end": 7125.36, "text": "ja würde ich auch näher abrennen wird davon nichts aber das kannst du machen ja also dann"}, {"id": 1006, "start": 7125.36, "end": 7130.44, "text": "ist das beste was ich gesagt habe du machst einen microcontroller mit einem mikrofon"}, {"id": 1007, "start": 7130.44, "end": 7134.0, "text": "sensor hin da musst du halt nur gucken wo du den strom anschließt wenn du es nicht"}, {"id": 1008, "start": 7134.0, "end": 7138.12, "text": "von der anlage abzapfen kannst und der kann dich benachrichtigen so musst du nicht in"}, {"id": 1009, "start": 7138.12, "end": 7145.08, "text": "die verkabelung eingreifen wozu benutzt ihr eure raspberry pies also ich habe aktuell"}, {"id": 1010, "start": 7145.08, "end": 7156.96, "text": "im einsatz einen raspberry pi 4 unten im wohnzimmer mit ssd dran da lief früher der unify controller"}, {"id": 1011, "start": 7156.96, "end": 7161.12, "text": "drauf aber ich habe kein unify mehr deswegen brauche ich den controller nicht aktuell"}, {"id": 1012, "start": 7161.12, "end": 7166.28, "text": "läuft da bloß was für die für das streaming von den überwachungs kameras drauf das kommt"}, {"id": 1013, "start": 7166.28, "end": 7171.12, "text": "aber weg der ist überhaupt nicht ausgelassen ziemlich unsinnig da habe ich ein raspberry"}, {"id": 1014, "start": 7171.12, "end": 7176.8, "text": "pie im keller stehen der ließ daten von der also da hatte ich früher den pico w dran"}, {"id": 1015, "start": 7176.8, "end": 7181.6, "text": "hängen aber den habe ich abgelöst durch den richtig echten raspberry pie und der ließ"}, {"id": 1016, "start": 7181.6, "end": 7186.4, "text": "die daten von der heizung aus und kann auch die heizung den heizungsstatus ändern der"}, {"id": 1017, "start": 7186.4, "end": 7190.92, "text": "guckt ob es geklingelt hat mit einem analog digital konverter ließ da aus eben die spanung"}, {"id": 1018, "start": 7190.92, "end": 7197.92, "text": "von der klingel ob es geklingelt hat ja und sende das an die heim automatisierung und"}, {"id": 1019, "start": 7197.92, "end": 7204.08, "text": "dann habe ich noch ein raspberry pie am 3d drucker zum sketches uploaden und druck anstoßen"}, {"id": 1020, "start": 7204.08, "end": 7211.64, "text": "und sowas alle anderen habe ich mittlerweile wieder abgebaut im wohnzimmer den raspberry"}, {"id": 1021, "start": 7211.64, "end": 7217.76, "text": "pie für fernsehaufnahmen habe ich ersetzt durch so eine linux box aber auch mit tv"}, {"id": 1022, "start": 7217.76, "end": 7225.72, "text": "headend ja und hier neben mir habe ich noch zwei raspberry pies vier liegen zwei raspberry"}, {"id": 1023, "start": 7225.72, "end": 7232.28, "text": "pies vier liegen im flea case gibt es vielleicht in flea case günstig das wäre natürlich"}, {"id": 1024, "start": 7232.28, "end": 7256.72, "text": "cool aber das gibt es naftos also ganz ehrlich für 10 euro scheint mir das in ordnung zu"}, {"id": 1025, "start": 7256.72, "end": 7272.36, "text": "gehen der label champ nöder ist immer noch nicht fertig lull ganz schön teuer"}, {"id": 1026, "start": 7272.36, "end": 7292.04, "text": "champ moment das ist ein touch screen im gehäuse das ist eigentlich eine ganz praktische sache"}, {"id": 1027, "start": 7292.04, "end": 7300.32, "text": "wenn man dafür ein anwendungsszenario hat so was trug man sich ich bin gespannt wie"}, {"id": 1028, "start": 7300.32, "end": 7316.72, "text": "du dir ein alu gehäuse drucken willst long runa das ist die gleiche kamera die schon"}, {"id": 1029, "start": 7316.72, "end": 7321.24, "text": "seit jetzt gefühlt zehn jahren für raspberry pie gibt nur jetzt mit zum komischen objektiv"}, {"id": 1030, "start": 7321.24, "end": 7331.6, "text": "drauf fischermanns freund raspberry ich wollte gerade sagen warum zum teufel findet er fischermanns"}, {"id": 1031, "start": 7331.6, "end": 7340.36, "text": "freund wenn ich da raspberry sucht aber weil raspberry raspberry geschmack was heißt"}, {"id": 1032, "start": 7340.36, "end": 7345.88, "text": "raspberry auf deutsch eigentlich noch mal himbeere ist das himbeere ich bin gerade auf"}, {"id": 1033, "start": 7345.88, "end": 7357.0, "text": "dem schlauch raspberry pie zero case ja himbeere ok ja besser wäre es wenn es ein raspberry"}, {"id": 1034, "start": 7357.0, "end": 7371.52, "text": "pie wäre und nicht nur das case i unicare an dem namen steht einfach schon china chinesen"}, {"id": 1035, "start": 7371.52, "end": 7380.44, "text": "zeug dran netac mikro sd hat irgendjemand von euch schon mal von netac was gehört ich"}, {"id": 1036, "start": 7380.44, "end": 7390.32, "text": "noch nie bestimmt ein äußerst renommierter hersteller für mikro sd karten pinheader"}, {"id": 1037, "start": 7390.32, "end": 7394.68, "text": "auf pinheader habe ich angst mittlerweile ich hatte jetzt schon zweimal pinheader im fuß"}, {"id": 1038, "start": 7394.68, "end": 7401.48, "text": "stecken was kann der mikro pie eigentlich leisten du meinst du den pico den pico oder"}, {"id": 1039, "start": 7401.48, "end": 7408.44, "text": "was denn ja gar nichts das ist kein raspberry pie das ja ein microcontroller der ist ganz"}, {"id": 1040, "start": 7408.44, "end": 7413.56, "text": "ehrlich ich verstehe nicht warum irgendjemand raspberry pie pico verwenden will esp 32"}, {"id": 1041, "start": 7413.56, "end": 7420.24, "text": "der normale ist einfach in allen belangen besser verstehe ich nicht auch das entwickeln"}, {"id": 1042, "start": 7420.24, "end": 7425.12, "text": "ich habe es letztens ausprobiert leute ich habe ich habe ich habe mir zwei pico picos"}, {"id": 1043, "start": 7425.12, "end": 7434.32, "text": "pico wege gekauft du hast die auswahl zwischen c only mit ihrem komischen sdk was nix unterstützt"}, {"id": 1044, "start": 7434.32, "end": 7441.72, "text": "oder platform i o arduino der aber auch nix unterstützt weil so die minimalst basic arduino"}, {"id": 1045, "start": 7441.72, "end": 7453.0, "text": "implementierung ist also komplett sinnlos ich würde nur esp 32 verwenden was ist das"}, {"id": 1046, "start": 7453.0, "end": 7460.92, "text": "an kühlen passivkühler ja das verkauft sich auch nur weil es raspberry pie heißt ansonsten"}, {"id": 1047, "start": 7460.92, "end": 7470.92, "text": "verstehe ich den anwendungszweck für den pico echt nicht crunchy protein bar auf geht's"}, {"id": 1048, "start": 7470.92, "end": 7484.68, "text": "ein guter tag ja ist leider kein raspberry pie dabei hast du schon was gefunden nee"}, {"id": 1049, "start": 7484.68, "end": 7492.2, "text": "nur müll doch ich habe mir zwei picos gekauft wie gesagt ich habe es ausprobiert auf dem"}, {"id": 1050, "start": 7492.2, "end": 7496.32, "text": "einen und ich verstehe nicht warum man die verwenden sollte wenn man noch einfach ganz"}, {"id": 1051, "start": 7496.32, "end": 7502.88, "text": "normale esp 32 verwenden kann die als d1 mini ausführung ähnlich klein sind und sogar"}, {"id": 1052, "start": 7502.88, "end": 7514.4, "text": "noch ein ticken günstiger andere frage warum arbeiten wir alle und tun so schlau ich weiß"}, {"id": 1053, "start": 7514.4, "end": 7520.88, "text": "nicht wir sind schlau chat wir tun doch nicht nur schlau oder ich dachte immer durch die"}, {"id": 1054, "start": 7520.88, "end": 7528.32, "text": "ganzen subs sind wir mittlerweile wirklich schlau und und müssen das nicht mal faken"}, {"id": 1055, "start": 7528.32, "end": 7532.96, "text": "wie high iq chat ja also tun so schlau obwohl wir schon die technik hätten das robot und"}, {"id": 1056, "start": 7532.96, "end": 7536.44, "text": "der eis alles für uns machen können also ich bezweifle dass wir die technik hätten"}, {"id": 1057, "start": 7536.44, "end": 7542.84, "text": "das robot und eis alles machen können du siehst es aber in bereichen wo man das machen"}, {"id": 1058, "start": 7542.84, "end": 7548.48, "text": "kann ja also das was früher fließbandarbeit war irgendwelche autostraßen und sonst was"}, {"id": 1059, "start": 7548.48, "end": 7552.8, "text": "da wird ja vermehrt was von robot und eis gemacht und wenn du nach japan guckst da sind"}, {"id": 1060, "start": 7552.8, "end": 7557.6, "text": "ja auch deutlich weiter was solche techniken angeht deutscher sind wir noch ein bisschen"}, {"id": 1061, "start": 7557.6, "end": 7563.4, "text": "hinten dran aber das wird jetzt kommen man sieht es jetzt schon und es ist davon auszugehen"}, {"id": 1062, "start": 7563.4, "end": 7567.6, "text": "dass viele berufe die es jetzt noch gibt also bin ich mir ziemlich sicher viele berufe"}, {"id": 1063, "start": 7567.6, "end": 7575.28, "text": "die es jetzt noch gibt ist jetzt die letzte generation die die jemals ausüben wird und"}, {"id": 1064, "start": 7575.28, "end": 7581.28, "text": "dann werden zwar nicht robot und eis alles machen aber das was sich eben lohnt zu automatisieren"}, {"id": 1065, "start": 7581.28, "end": 7590.12, "text": "wird gemacht werden und es wird in anderen bereichen arbeitsplätze schaffen und insgesamt"}, {"id": 1066, "start": 7590.12, "end": 7596.0, "text": "aber mehr verlieren als dass es neue schafft ich meine ist ja ganz einfach ja wenn du sagen"}, {"id": 1067, "start": 7596.0, "end": 7601.2, "text": "wir mal zehn fließbandarbeiter durch eine robot greifarm ersetzt dann brauchst du"}, {"id": 1068, "start": 7601.2, "end": 7609.6, "text": "vielleicht zwei programmierer zu zehn fließbandarbeiter also ja die brauchst du mehr du hast quasi"}, {"id": 1069, "start": 7609.6, "end": 7614.96, "text": "ein arbeits du hast quasi zwei arbeitsplätze geschaffen für zwei programmierer oder techniker"}, {"id": 1070, "start": 7614.96, "end": 7620.76, "text": "aber zehn sind weg quickmaps also es werden insgesamt auf jeden fall weniger und da bin"}, {"id": 1071, "start": 7620.76, "end": 7625.8, "text": "ich immer gespannt wie wir das handeln wollen wenn die dann alle in renter gehen und unser"}, {"id": 1072, "start": 7625.8, "end": 7631.24, "text": "rentensystem jetzt schon nicht richtig funktioniert und wenn die auf einmal alle in renter gehen"}, {"id": 1073, "start": 7631.24, "end": 7636.72, "text": "in was weiß ich 10 15 jahren da bin ich echt mal gespannt das kann hinten das wird wahrscheinlich"}, {"id": 1074, "start": 7636.72, "end": 7646.32, "text": "hinten vorne nix aber gut dass ich meine stonks habe ai zum programmieren nutzen wir"}, {"id": 1075, "start": 7646.32, "end": 7651.64, "text": "verlieren ja das wird nicht passieren zumindest nicht in absehbarer zeit natürlich kann man"}, {"id": 1076, "start": 7651.64, "end": 7657.32, "text": "sich jetzt das scenario ausmalen was passiert wenn dann auch irgendwann mal programmierer"}, {"id": 1077, "start": 7657.32, "end": 7662.8, "text": "durch ai ersetzt werden und die ai selbst ai programmiert ob wir uns dann nicht in"}, {"id": 1078, "start": 7662.8, "end": 7669.44, "text": "richtung terminator oder so entwickeln also das halte ich jetzt zum aktuellen zeitpunkt"}, {"id": 1079, "start": 7669.44, "end": 7681.32, "text": "irgendwie noch für ziemlich zusammen konstruiert aber dass man in zukunft ai verwenden wird"}, {"id": 1080, "start": 7681.32, "end": 7696.68, "text": "um ai sachen zu verbessern das kann ich mir gut vorstellen und wir haben die letzten jahre"}, {"id": 1081, "start": 7696.68, "end": 7700.72, "text": "wirklich richtig krasse fortschritte gemacht guckt euch mal an was wir für tools haben"}, {"id": 1082, "start": 7700.72, "end": 7705.92, "text": "die man früher gar nicht für möglich gehalten hat ja du hast ai ist die aus musikstücken"}, {"id": 1083, "start": 7705.92, "end": 7713.16, "text": "die instrumente extrahieren können du hast ai ist die bilder freistellen können für"}, {"id": 1084, "start": 7713.16, "end": 7719.36, "text": "dich du hast ai ist die elemente in bildern entfernen kann du hast ai ist die ich sag"}, {"id": 1085, "start": 7719.36, "end": 7723.56, "text": "es jetzt weil das das ist wo ihr alle dran denkt wo du leute drin naggisch machen kannst"}, {"id": 1086, "start": 7723.56, "end": 7729.8, "text": "du hast du hast ai ist wo du bilder beschreibungen dir holen kannst in textform also sprich"}, {"id": 1087, "start": 7729.8, "end": 7735.44, "text": "du gibst ja ein bild die ai sagt dir was auf dem bild zu sehen ist was relativ gut funktioniert"}, {"id": 1088, "start": 7735.44, "end": 7742.12, "text": "und wenn es halt nicht funktioniert ist es komplett falsch ja aber meistens ist es relativ"}, {"id": 1089, "start": 7742.12, "end": 7746.08, "text": "gut also wir haben sehr viele sachen in dieser richtung und da ist in die letzten zehn jahren"}, {"id": 1090, "start": 7746.08, "end": 7750.4, "text": "fünf jahren ist da also die letzten fünf jahre reicht da schon wenn ihr das anguckt"}, {"id": 1091, "start": 7750.4, "end": 7766.84, "text": "enorm viel passiert ja sollen sie mal machen personalabteilung braucht eh keiner"}, {"id": 1092, "start": 7766.84, "end": 7789.2, "text": "das ist der vorteil von ai ist den ist es egal ob sie cobalt programmieren oder nicht"}, {"id": 1093, "start": 7789.2, "end": 7805.44, "text": "ja ich weiß nutzt jemand copilot ja ich weiß dass viele im chat sogar copilot nutzen zumindest"}, {"id": 1094, "start": 7805.44, "end": 7812.52, "text": "immer wenn es um das thema geht haben wir hier leute die was dazu schreiben ich verwende"}, {"id": 1095, "start": 7812.52, "end": 7822.4, "text": "kein copilot was mich abschreckt ist dass es jetzt auch was kostet ja es gibt laufend"}, {"id": 1096, "start": 7822.4, "end": 7827.84, "text": "auf aufrufe github zu verlassen die haben auch github schon verlassen als es microsoft"}, {"id": 1097, "start": 7827.84, "end": 7832.08, "text": "gekauft hat das hat glaube ich kein projekt was es getan und was es gemacht hat wirklich"}, {"id": 1098, "start": 7832.08, "end": 7841.2, "text": "gut getan was ist copilot copilot ist ein eine ai die dir beim programmieren hilft ihr"}, {"id": 1099, "start": 7841.2, "end": 7846.28, "text": "macht vorschläge was du als nächstes schreiben möchtest also wenn du zum beispiel schreibst"}, {"id": 1100, "start": 7846.28, "end": 7852.2, "text": "in deinem text editor class und dann drückst du autocomplete für copilot dann schlägt"}, {"id": 1101, "start": 7852.2, "end": 7858.12, "text": "dir dann beispielsweise vor a kontextbasiert du willst jetzt eine klasse anlegen person"}, {"id": 1102, "start": 7858.12, "end": 7865.32, "text": "mit vor und nachname drin und sowas richtig richtig genau ist es ist fast das gleiche"}, {"id": 1103, "start": 7865.32, "end": 7869.6, "text": "wobei ich halt sagen muss whatsapp gibt es halt wirklich dinger die ich richtig kacke"}, {"id": 1104, "start": 7869.6, "end": 7874.68, "text": "finde warum ich auch nicht verwende aber bei github ist es eigentlich immer noch eine"}, {"id": 1105, "start": 7874.68, "end": 7880.44, "text": "gute plattform ja microsoft hat den kram übernommen und microsoft baut immer noch"}, {"id": 1106, "start": 7880.44, "end": 7885.76, "text": "viel scheiße und wird auch immer viel scheiße bauen aber microsoft hat die letzten jahre"}, {"id": 1107, "start": 7885.76, "end": 7890.56, "text": "über auch paar gute sachen gemacht angefangen von mischel studio code und auch github haben"}, {"id": 1108, "start": 7890.56, "end": 7894.64, "text": "sie nicht komplett verkackt wsl ist auch ok wobei das natürlich bei microsoft alles"}, {"id": 1109, "start": 7894.64, "end": 7902.04, "text": "nicht aus selbstlosigkeit passiert sondern letztendlich rein wegen stonks und geld aber"}, {"id": 1110, "start": 7902.04, "end": 7905.6, "text": "github ist immer noch eine gute plattform in der seite microsoft übernommen finde"}, {"id": 1111, "start": 7905.6, "end": 7910.0, "text": "ich eigentlich eher besser geworden ja sie schabt dort nett sind wunderbare technologien"}, {"id": 1112, "start": 7910.0, "end": 7915.4, "text": "von microsoft also man kann ja microsoft nicht mögen ist ja in ordnung aber die machen durchaus"}, {"id": 1113, "start": 7915.4, "end": 7921.04, "text": "gescheite sachen windows kommt mir auch nicht in die tüte also zu administrieren ich würde"}, {"id": 1114, "start": 7921.04, "end": 7924.92, "text": "im leben nicht winnows administrieren winnows ist der größte scheiß den es gibt der einzige"}, {"id": 1115, "start": 7924.92, "end": 7928.44, "text": "grund warum ich winnows verwende ist weil ich halt manche sachen am besten unter winnows"}, {"id": 1116, "start": 7928.44, "end": 7932.24, "text": "machen kann was aber an den programm liegt und nicht weil winnows so geil wäre"}, {"id": 1117, "start": 7932.24, "end": 7947.04, "text": "ich installiere mir kein winnows 11 ich installiere winnows 11 erst wenn winnows 10 end of life"}, {"id": 1118, "start": 7947.04, "end": 7952.08, "text": "ist oder es driftige gründe für gibt vielleicht mit dem nächsten rechner wenn die nächste"}, {"id": 1119, "start": 7952.08, "end": 7956.24, "text": "grafikkarten generation rauskommt und ich mir vielleicht endlich mal dann wirklich einen"}, {"id": 1120, "start": 7956.24, "end": 7966.48, "text": "neuen rechner baue dann dann mache ich vielleicht winnows 11 transformation zum fitness influencer"}, {"id": 1121, "start": 7966.48, "end": 7975.32, "text": "ja und face reveal alles in einem leute was hat man wenn man winnows 11 holt nee du hast"}, {"id": 1122, "start": 7975.32, "end": 7987.92, "text": "winnows 11 was sollst du sonst haben es näher es gibt schon ein paar ansätze zum"}, {"id": 1123, "start": 7987.92, "end": 7994.08, "text": "beispiel diese direct storage geschichten neuere direct x version die wahrscheinlich"}, {"id": 1124, "start": 7994.08, "end": 7999.96, "text": "so wie ich microsoft kenne dann nur für winnows 11 raus äh winnows 11 rauskommen du hast aber"}, {"id": 1125, "start": 7999.96, "end": 8005.96, "text": "auch viele nervigen sachen und ich verstehe halt nicht wie es microsoft immer wieder schafft"}, {"id": 1126, "start": 8005.96, "end": 8017.88, "text": "upgrades zu releasen die von den funktionen her weniger bieten als die sachen davor das"}, {"id": 1127, "start": 8017.88, "end": 8032.76, "text": "leuchtet mir halt nicht ein du ich würde auch nicht upgraden einfach so wenn es da nicht"}, {"id": 1128, "start": 8032.76, "end": 8036.16, "text": "irgendwie driftige gründe für gibt würde ich auch nicht upgraden mache ich ja auch"}, {"id": 1129, "start": 8036.16, "end": 8041.4, "text": "aktuell nicht ich upgrade ja nicht habe ich auch nicht vor erstmal ja accountpflicht"}, {"id": 1130, "start": 8041.4, "end": 8045.28, "text": "ist auch so ein abfuck ding weshalb ich das nicht machen würde sobald es accountpflicht"}, {"id": 1131, "start": 8045.28, "end": 8052.96, "text": "gibt gucke ich dass sie sich einen crack dafür gibt was kostet co-pilot eine gute frage bisher"}, {"id": 1132, "start": 8052.96, "end": 8074.6, "text": "war es kostenlos mittlerweile pricing mittlerweile kostet das was wo steht denn hier pricing"}, {"id": 1133, "start": 8074.6, "end": 8100.24, "text": "wir hatten diese seite wieder gemacht mann was kostet es denn"}, {"id": 1134, "start": 8100.24, "end": 8109.24, "text": "ich ich check wieder nicht wo ich den wo ich einfach ganz normal die preise sehen kann"}, {"id": 1135, "start": 8109.24, "end": 8122.08, "text": "wo war das hier ist nix nein das ist für github teams das ist nicht für co-pilot das ist"}, {"id": 1136, "start": 8122.08, "end": 8136.2, "text": "das ist für github nicht für co-pilot keine ahnung wieder so eine seite wo du nicht durchblickst"}, {"id": 1137, "start": 8136.2, "end": 8149.88, "text": "oder ich nicht durchblicke ja das hatte ich gerade auf so ganz oben hier also 10 dollar"}, {"id": 1138, "start": 8149.88, "end": 8169.36, "text": "im monat 100 dollar im jahr das weiß ich nicht ob es mir wert ist keine ahnung wie sieht"}, {"id": 1139, "start": 8169.36, "end": 8178.52, "text": "es bei euch aus chat kauft ihr es oder lasst es bleiben oder aber habt ihr keine ahnung"}, {"id": 1140, "start": 8178.52, "end": 8196.0, "text": "was github co-pilot überhaupt ist also ich weiß nicht ich werde es nicht kaufen geht"}, {"id": 1141, "start": 8196.0, "end": 8202.08, "text": "das mit allen idees oder nur wie es kaut das geht für alle idees und sachen wo es plugins"}, {"id": 1142, "start": 8202.08, "end": 8209.52, "text": "für co-pilot gibt jetbrains bundle beste habe ich auch die haben den preis erhöht"}, {"id": 1143, "start": 8209.52, "end": 8221.0, "text": "letztens um paar euro fürs jetbrains bundle ja schanken da kann ich dir jetzt so spontan"}, {"id": 1144, "start": 8221.0, "end": 8238.44, "text": "auch nicht helfen doch bin ich bin ich bin ich keck wer ist das service ja startup startup"}, {"id": 1145, "start": 8238.44, "end": 8254.28, "text": "ist schon fast gegründet der control enter ist jetzt aber das ist das ist die meistens"}, {"id": 1146, "start": 8254.28, "end": 8259.16, "text": "so code refactoring oder vorschläge wie man fehler ausbessern kann aber github co-pilot"}, {"id": 1147, "start": 8259.16, "end": 8273.96, "text": "macht ja schon mehr als dieses auto zeugs von jetbrains könnte ich mir einfach eine"}, {"id": 1148, "start": 8273.96, "end": 8290.56, "text": "edu domain registrieren und darüber darüber einfach das bundle kostenlos bekommen kann"}, {"id": 1149, "start": 8290.56, "end": 8304.76, "text": "man sich punkt edu registrieren omega keckel punkt edu das geht nicht unsupporte top level"}, {"id": 1150, "start": 8304.76, "end": 8326.16, "text": "wir müssen bloß ein domain registrar finden der da mitmacht ah leute genug geschwätzt"}, {"id": 1151, "start": 8326.16, "end": 8331.68, "text": "parmesan gibt es auch nichts ich bin müde wie sauber man vielleicht ich bin ja schon"}, {"id": 1152, "start": 8331.68, "end": 8356.76, "text": "halb am einpennen ich gehe schlafen leute bettgetheim boomer müde boomer schlafen"}, {"id": 1153, "start": 8356.76, "end": 8369.0, "text": "leute dit dit dit ja ich glaube gibt's sonst nix mehr oder ich will was wichtiges was wir"}, {"id": 1154, "start": 8369.0, "end": 8381.24, "text": "noch besprechen müssten ich glaube nicht alles klar dann sehen wir uns morgen bis denn"}, {"id": 1155, "start": 8381.24, "end": 8382.84, "text": "dann macht's gut, see you!"}]}