{"text": "Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das wollte nicht für Vote Hartdorff bemutzen. Das wollte nicht für Vote Hartdorff bemutzen. Das war's für heute. Das war's für heute. So, ich bin am Start Leute. Ja, vielleicht, ich erzähl euch auch gleich, was Sache ist. Also Husten ist sogar schon ein bisschen am Start, es kann auch ganz normale Erkältung sein. Aber Corona ist gar nicht so unwahrscheinlich. Ich erzähl euch auch warum Ich habe kein test gemacht noch zu kurz Warte mal Bisschen leiser machen Also Ich erzähl euch jetzt mal was. Ich kann heute nicht so wahnsinnig rumschreien. Ich habe auch ein paar Bonbons am Start Ja und abends muss ich ein bisschen husten. Ich hoffe halt wie gesagt, ich hoffe dass es eine normale Erkältung ist und nicht Corona Aber also ich erzähl euch mal was und zwar ich war Dienstag Beim super spreader event schlechthin in Frankfurt Legacy of the beast 50.000 Leute in der Commerzbank Arena, ne nicht Commerzbank Arena im Dorf heißt nicht mehr so Deutsche Bank Park heißt es jetzt ja Und Mittwoch ging ja 5000 Leute waren es ungefähr Ist glaube ich passen maximal 66.000 oder so rein aber die hintere aber dieses hintere Viertel hinter der Bühne hat man natürlich nicht besetzt. So zumindest Mittwoch ging Also vorgestern vorgestern ging und Seit heute nacht Er muss sich husten und mir hat auch der Hals weh getan. Okay, vielleicht Klimaanlage sonst wie Und das ist heute schlechter geworden Tag über ich ich werde jetzt ein paar Bonbons bonbons lutschen Und ich fühle mich auch irgendwie warm an Ich habe noch kein Fieber gemessen und ich will mir jetzt auch nicht live im stream auch wenn der chat jetzt sagt ja auf geht's Mach mache ich nicht. Ich will mir jetzt auch nicht live im stream das Thermometer in Pobo schieben Live live Fieber messig Das war aber nicht so ein test Test habe ich auch noch nicht gemacht und ich sage euch auch warum ich noch kein test gemacht habe nicht unter den Achseln Thermometer kommt in Pobo dann funktioniert das stimmt das wenigstens auch was draufsteht Mit richtig mit richtig Gatschi bass reingerollt bis zum Anschlag Ich gehts Das tut ja weh Nein, aber nicht unter nicht unter die Achseln ja Thermometer muss muss schon in Pobo und es funktioniert das nicht Das muss ihn hinteren Vielleicht geht das ja vielleicht würde dieser content auch unter unter pools durchgehen ich mache ein bisschen wasser im Hintergrund haben dann alles gut Also was wollte ich jetzt sagen also ich habe noch kein test gemacht weil ich habe im Internet geguckt und die sagen eigentlich Wenn du willst dass dieser test halbwegs aussagekräftig ist da musste vier bis fünf Tage warten und meistens dauert es auch Bis man von Corona richtig viel merkt auch vier bis fünf tage Oder Fünf bis sechs sogar eher Weißt du im Endeffekt Es spricht eher Nicht für Corona dass ich jetzt schon was im Hals merke aber Dass ich husten muss ist natürlich schon mal schlecht Zumal ich halt wie gesagt Auf dem Event schlechthin war um mir Corona einzufangen also wenn man sich wenn man sich Irgendwie War bei dir auch so na toll Ist doch ist doch wie bei mir dann ist doch dann ist doch ähnlich wie bei mir dienstag eingefangen Ab heute nach beziehungsweise heute tagsüber hals und husten und tja mal schauen So ne vor vier fünf bis sechs tagen nicht daheim kriegste kein Corona zumindest also Du hast sogar das leichte rauschen pock Kollege hat sich auf dem Ironmanen Konzert angesteckt. Ach da wo ich auch war na toll Ich sag doch zu super super spreader event Also Wie gesagt ich das fühlt sich auch ein bisschen warm an wenn ich mich angreife so hier gesicht und So auch ein bisschen warm an Wenn ich mich angreife so hier gesicht und so auch an der seite und so Muss ich mal gucken ich werde nach dem stream eine runde Thermometer in pobs schieben ja wenn es nur das wäre wäre ja ok hatte ich keine schmerzen mit Aber ich fürchte fast ich meine ich habe es bis jetzt mehr Aber ich ob es falsches falsches emote aber ich Aber ich Aber ich hat es bis jetzt um schiff mit corona also ich habe Die dumme vermutung dass mich jetzt erwischt hat Das wäre ziemlich kacke Aber früher oder später Kommst du da wahrscheinlich nicht drumherum mal gucken wie es morgen ist Gucken wie es morgen ist ich trinke viel zeug ach ja und das beste ist habe ich euch auch gar nicht erzählt warum das warum das noch mal extra kacke ist mir geht es dann nämlich ohne corona schon nicht so gut weil Ich habe euch ja schon vor ein paar wochen erzählt dass ich zahn wehr hatte Und ich war ja ein paar mal beim zahnarzt der wusste nicht so wirklich was sache ist und man sieht irgendwie nichts hat röntgenbild gemacht alles und er hat jetzt ein paar sachen probiert und dann hatte ich letzte woche freitag einmal wurzelbehandlung und Jetzt tut mir der zahnweber im drauf beißen und drumherum alles also ich habe quasi bald zahnschmerzen und corona obwohl man eigentlich also ich hoffe dass nicht dass es corona ist aber Obwohl man ja eigentlich davon ausgehen müsste dass nach der wurzelbehandlung man nichts mehr spürt Und ja am zahn spüre ich auch nichts mehr also weder noch heiß noch kalt Aber drumherum und es wird eher schlechter als besser ich hoffe es legt sich dieses wochenende wieder Ja und sollte ich jetzt irgendwie Erkältung oder corona haben kann ich auch nicht zum zahnarzt gehen Jetzt muss ich ein paar pillen einschmeißen mein aktuell geht's aber gerade ist wirklich gerade ist wirklich alles alles zusammen kacke ja Deswegen habe ich mir gedacht ich mache jetzt mal stream an So ich habe salbei bonbons hier Rikola Salbei bonbons muss ich ab und zu mal ab und zu mal ein futtern Ne der zahn ist ja noch drin das ist ja der sinn von wurzelbehandlung Naja mal gucken Also gucken wir das mit dem wie war denn das bei dir wir hatten das eben geschrieben Wir hatten das eben geschrieben Was war denn in deinem halt also wie war das bei dir mit corona und dem hals der das eben mit dem hals geschrieben hat hier N3 og oder besser gesagt wahrscheinlich neo g Salbei salbei es ist salbei ist an sich gut salbei ist gut wenn man probleme mit dem zahnfleisch hat und gegen hals Ach ja Also stimmt jetzt habe ich erst mal erzählen dass ich mir wahrscheinlich corona eingefangen habe beim konzert jetzt kann ich euch was erzählen wie das konzert war also Schauen wir doch mal Schauen wir doch mal kurz schnell ob leute bilder gepostet haben ich habe ein paar bilder gepostet die sind jetzt aber nicht so wahnsinnig Spannend also das konzert war tatsächlich ziemlich nice es waren drei bands also insgesamt war es halt wirklich doch gar nicht schlecht was man fürs Ne iron maiden oder es heißt eigentlich nicht iron es heißt iron maiden Weil irgendwie außer den englern dann keiner check dass man das ehrlich ausspricht und jeder sagt iron und ich auch Aber ich weiß es eigentlich alter twitter hör doch mal auf mich abzufacken hier geh mal fort Und ich will muss ich wieder zu nitter ja weil sonst hätte funktioniert Gut Ja also also bei mir ist es eher so Ich habe so ein bisschen das gefühl was man hat hat normalerweise wenn man wenn man eine normale erkältung kriegt aber halt nicht so nicht so an einer stelle Er kratzen kratzen habe ich auch genau es ist halt nicht an einer stelle sondern es ist so komplett von links nach rechts durch den hals was bei normaler erkältung Bei mir nicht so ist na gut zumindest also mal gucken ob leute ein paar ordentliche bilder gepostet haben an nitter kackt wieder ab na wunderbar Also man hat man hat tatsächlich relativ viel fürs geld bekommen also das ticket hat glaube 95 euro oder so gekostet so plus minus ich weiß nicht genau 95 euro Also ich habe mir ein paar bilder gepostet, also ich habe mir ein paar bilder gepostet So plus minus weiß nicht genau 95 euro man konnte 5 45 das ist aber total sinnlos 15 45 viel zu früh das ist für die ganzen hardcore fans die vorne der ersten reihe stehen wollen das muss nicht sein Also du konntest 15 45 rein wir waren irgendwie 16 uhr 30 oder so da Dann gab es erst airborne und dann gab es power wolf power wolf war richtig nice Ja und als es dann dunkel wurde hat ein maiden angefangen man muss halt sagen schau technisch war wirklich extrem nice Ich meine ich meine man erkennt sie ein bisschen ja man ich habe jetzt das ist nur ein iphone foto das ist nicht die krasseste auflösung oder so Aber ich glaube man erkennt man erkennt es halbwegs also die haben was Bühnentechnik angeht schon da alles an register gezogen ja also sie hatten zig Das war nicht aufgeblasen es waren wirklich irgendwelche gebauten Dinger von flugzeugen bis hier so so köpfe oder alles mögliche hatten die am start auf der bühne Von feuerwerk bis feuer alles dabei ja Man muss sagen für das dass das richtig alte säcke sind ich meine im endes im durchschnitt glaube ich 65 oder so also wenn einer zu mir noch mal boomer sagt da stehen die richtigen boomer auf der aus auf der auf der bühne ja Ja der ist noch am start ist glaube ich der älteste der ist glaube ich schon 70 also im durchschnitt sind die glaube ich 65 66 oder so Also sie sind richtig alt man muss sagen also für den irgendwie 65 jährigen hat er ganz schön kilometer gemacht auf der bühne ja beim rumrennen So zumindest die soundqualität war halt naja Ich hab gehofft hat noch in dem ein anderes paar bilder gepostet also die soundqualität war richtig mies Nicht ganz so beschissen wie in der festhalle vor ein paar jahren da waren ja auch schon mal Aber total übersteuert und hättest du die texte nicht gekannt hättest du eigentlich nix mitbekommen Also der sound war wirklich kacke ich Ich weiß nicht ich weiß nicht was die in frankfurt machen Aber ich würde eigentlich von ausgehen dass das konzertechnisch in einem stadion doch mehr her machen sollte Als also naja ansonsten war wirklich sehr nice Sound war nicht so schlecht Aber wirklich sehr nice sound war naja also Die haben sich wirklich mühe gegeben die show an sich war auch gut Preis leistungsmäßig kannst du mit drei bands auch nicht weckern Powerwolf war richtig lang da und die würde ich mir auch so angucken also allein im konzert 90 euro paar 90 euro das geht jetzt ging schon in ordnung ich mein du hattest von 17 uhr 17 uhr 45 bis 22 uhr 45 da entertainment ja das passt schon ne ne nix Das war ja auch kein festival Tja So sieht es aus und wie gesagt wahrscheinlich komme ich jetzt um corona nicht rum Ich hoffe ja immer noch dass es normale erkältung und gut ist Das ist richtig ja Aber ansonsten Ich habe wie gesagt ich hoffe es ist eine normale erkältung aber ich ich fürchte ich bin jetzt auch mal dran mit corona Hast du das schon mit archen massenhaft fehlerhaften gpg näher mich nicht mitbekommen was war denn da Arsch Ne das heißt nicht gpg pgp heißt das oder soll ich wirklich nach gpg suchen Was ist da was ist da passiert Arsch linux da ist der fehler Arsch linux da ist der fehler Was ist das Nö Ich habe doch erst gestern oder so Update gemacht Ach moment ich habe ja man jaro by the way ich darf ja gar nicht arch by the way by the way in by the way weil es ist ja nur arch und kein Ist ja nur arch und kein Arsch linux Ich habe doch erst gestern oder so Ich habe ja gar nicht arch by the way by the way in by the way Weil es ist ja nur arch und kein ist ja nur man jaro und kein arch dann habe ich den fehler wahrscheinlich nicht Dann habe ich den fehler wahrscheinlich nicht Ich habe dann arch linux hier installiert das probieren wir probieren das jetzt mal aus ich habe ja sonst nichts großartiges geplant Also leute das ist der titel ist programm wir schwätzen ein bisschen was gucken uns ein paar videos an Dass das machen kann wie gesagt mir tut der hals weh und Nachher noch mal fieber messen morgen mache ich also ich weiß nicht morgen ist ja freitag Wahrscheinlich mache ich den koron ich habe nämlich nur noch zwei koronatests hier Wahrscheinlich mache ich den Test samstag dann ist lang genug zeit und dann sollte das anschlagen wenn was ist Eigentlich habe ich ja gesagt ich komme morgen auf die arbeit aber ich glaube das lasse ich besser sein was mir Natürlich als homeoffice fern entgegenkommt Aber ich glaube in dem fall sind alle anderen auch der meinung es ist keine so gute idee mit coronasymptomen auf die arbeit zu fahren Nö also wenn das so bleibt templo ist das habe ich schon auf das gucken wir uns gleich an Nö, also wenn das so bleibt templo ist das habe ich schon auf das gucken wir uns gleich an also wenn das so bleibt mit dem hals und so Also solange es wirklich nur mal ein bisschen husten hals und und bisschen bisschen hot man's not hot bleibt Tja mal gucken mal gucken wie es heute nacht ist ja mal gespannt So zeit lasst mal kurz checken was was machen die updates hier pacman also besser Pacman also bestes ab beste update befähle übrigens wer der meinung ist dass ein system nicht updater soll es mal damit probieren Ok man jaro updated alles klar Ja dann machen wir mal arch by the way an und gucken ob das updatert jetzt werden wir jetzt ja gleich sehen Jetzt werden wir jetzt ja gleich sehen Das werden wir jetzt ja gleich sehen ob das funktioniert so pacman alter ich kann ja mal tippen Pacman, alter ich kann ja nicht mehr tippen, äh, ne, einfach nur so ne, ja, so, funktioniert auch alles, Arch by the way, by the way funktioniert by the way, nicht? Ah, das kommt, wenn er die Keys überprüft, danach erst oder was, der downloadet, der downloadet, ok, Sekunde, das Downloaden dauert ein bisschen zu langsam, äh, dauert ein bisschen zu lang, äh, wo schaltet man, wo schaltet man parallele Downloads nochmal ein, das ist doch hier irgendwo, hier, bam, jetzt, alter, ich hoffe der Stream kackt nicht ab dabei, ok, Leute, schauen, schauen ob es laggt, ah ne, laggt nix, dann schauen wir mal, einfach mit Reflector den schnellsten Server suchen, was ist denn Reflector, stell dir vor du hast bei der Bahn Vorstellungsgespräche und musst mit der Bahn fahren, da stell ich mir, hab ich ne gute Ausrede, so, und jetzt, yes, und jetzt kackt er wahrscheinlich ab, vermute ich mal, ah, Signature von David Runge ist Marginal Trust, oh oh, oh oh, Kacke, ok, ich brech mal ab, ja, na dann, Arch, by the way, das ist das erste Mal, das so richtig, richtig Update kaputt ist, was ich mitbekommen hab, zeig doch mal kurz her, was schreiben, was schreiben denn die, die Arch, by the way, Leute, außer dass sie Arch verwenden, es gibt ein Fix, das werden wir jetzt gleich sehen, ich wollte das zwar, oh, Moment, Moment, Sekunde, Zack, Zack, Dark Reader, wobei, hatte Github nicht selber nen Dark Mode, wo macht man den Github an, geht das auch ohne, dass man eingeloggt ist, Leute, kann man in Dark Mode den Github anmachen, ohne dass man eingeloggt ist, ne, ne, das ist der richtige Dark Reader, ne, Dark Reader, Dark, Dark Reader, das ist das richtige, excellent, ok, ok, gut, also, warum geht das nicht, was, GPG, müsste das nicht PGP heilen, Kno, PG löschen, ok, ok, ok, ok, ok, ok, ok, ok, probieren wir mal aus, ob das funktioniert, muss man das alles gut machen, wahrscheinlich, Jawoll, jawoll, jawoll, jawoll. Ach, not to be confused with pretty good privacy. Aha, okay. Aber ich hab's, ich hab's gerade confused damit. So, und jetzt, und jetzt geht's, oder wie? Yes. Fastchamp. Nope. Funktioniert nicht. Sprocken. Kacke. Also, das war auf jeden Fall nicht der Flick. Was soll ich machen, was ihr da gepostet habt? Okay. Okay. Okay. Chat, wenn ihr das sagt. Chat ist high IQ, der weiß sowas. Ich truste, ich truste dem Chat, Leute. Massive Chat-Trust. Funktioniert nicht. Nee, nee, man, Jaro funktioniert, gar kein Problem. Okay, Leute. Was wie nur Keering. Wo hab ich nicht mehr reingeschaut? Ach so, beim, bei... Nee, doch, man, Jaro hat funktioniert, du hab kein Problem. Ach so, hab ich alles geupgraded? Ach so, yes. Und jetzt, und jetzt darf ich alles machen. Aha, aha, aha. Das funktioniert jetzt, easy. Wieder was gelernt, Chat. Easy, easy, easy, easy as fuck, nice, nice, nice. Chat ist richtig high IQ heute wieder. Gut, hätten wir das auch geregelt, wollte ich jetzt zwar gar nicht machen, aber gut zu wissen. Welche Version von Forever Workstation hast du? Forever Workstation. Ach so. Forever Workstation, ich weiß nicht, ob ich die Lizenz zeigen kann, ob, lieber nicht. Wer weiß. Das ist, ja, aber es ist nicht Player, es ist, es ist das normale. Weiß nicht, warum man sich Player kaufen sollte. Kriegste aber auch beim Keyshop für ein Apple und ein i. Ja, ich glaub, dass ich Corona hab. Nee, also noch, noch ist mit Nase laufen nicht so viel. Welche Text-to-Speech-Engine ich verwende? Gar keine, ich verwende einen, du meinst für solche Sachen wie das hier, oder, oder auch. Das ist ein koreanischer Text-to-Speech-Service, wo ich mir irgendwann mal ein API-Key generiert hab. Und über die API ich den was sagen lasse und dann als MP3 runterlade. Ja, der kann zum, der kann auch noch mehr, also man kann den als Text-to-Speech ein bisschen zweckempfremden. Ich kann jetzt zum Beispiel hier was reinschreiben, zum Beispiel Kekke, Weep und jetzt sollte er eigentlich was vorlesen. Achso, Moment, was? Nein, das, das funktioniert nicht so wirklich. Okay, das funktioniert so schon mal nicht anscheinend. Ja, also man kann den auch was anderes sagen lassen. Das ist sogar richtig gut, das finde ich gut, das muss ich hinzufügen, Alter. Nice, ja, entdeckt man immer neue Sachen. Was ist denn das längste deutsche Wort? Du kannst im Deutschen theoretisch nahezu beliebig lange Wörter generieren. Ja, du kannst hier, du kannst so viele, du kannst total viele Wörter im Deutsch machen, die noch länger sind. Okay, weil, weil, weil ihr seid, Chat. Okay, logisch, obviously. Das hört sich tatsächlich an, als wäre es irgendein, aus irgendeinem, irgendwas koreanischem, ja. Nee, ja. Nee, koreanisch. Koreanisch war das glaube ich sogar. Oder war das? Nee, ich glaube, das war sogar ein koreanischer. Ja, ich glaube, das war ein koreanischer, ja, ich glaube, das war ein koreanischer, ja. Ja, ich glaube, das war ein koreanischer, ja, ich glaube, das war ein koreanischer, ja. Ja. sie ist sie funktioniert gut genug für mich ja der der etiketten champ muss auch mal fertig werden der label champ nee ich habe das absichtlich nicht mit dem stream deck gemacht weil ich will sie beim browser bedienen vom zweiten rechner und ich will ja die bilder selbst sehen bei mir ist es ja so das ist nicht eine obs geschichte sondern wirklich ich sehe die bilder selbst noch ist es ja nicht raus ob es wirklich korona ist ich hoffe ja nicht ja ihr müsst euch jetzt auch alle testen lassen kommt drauf an für was pauschal kann man das überhaupt nicht sagen dazu kann ich bloß sagen ja war er plötzlich ist klar habe ich monka w überhaupt aktiviert leute monka wie habe ich glaube ich gar nicht hauptsache hauptsache wir haben monka w als als text to speech weil ich habe monka w nicht aktiviert weil wir haben schon total viele monka emotes und ich mag monka w eigentlich gar nicht ich habe das jetzt bloß reingemacht weil sich lustig anhört was mir gerade einfällt ich habe auf der arbeit einen aus versehen voll verwirrt der ist zu mir ein rechner ich weiß ich weiß nicht wie ich drauf komme leute jetzt der ist zu mir ein rechner gekommen hinter also ein platz und meinte irgendwie lasst mal das und das gucken ist auch egal es geht überhaupt nicht darum und aber sind ja moment ich muss mal ein paar sachen zumachen ich hatte irgendwie 1000 tabs auf dann habe ich meine tabs zugeklickt und auf einmal hat man ganz kurz bevor jetzt einer was sagt ihr müsst warten bis ich fertig erzählt habe und in einem der tabs hat man ganz kurz erkannt porn und ich habe die tabs ganz schnell zugemacht und da meint er max max was war das was war das porn porn was was ist da oder habe ich dann die tabs wieder aufgemacht irgendwie 50 tabs oder so habe ich wieder aufgemacht um den zu zeigen um ihm zu zeigen dass es unix porn war ein sub reddit wo die leute ihre gestalten linux desktops zeigen und der kerl hat halt nur ja reddit reddit please high speed reddit ist reddit down er scheint jetzt zu gehen so und jetzt stellt euch mal vor es macht jemand ganz schnell ganz schnell die sachen zu und ihr habt ihr bloß kurz gesehen die überschrift dann kann es schon ein bisschen verwirren ja gebe ich zu nicht dass er das so schnell da oben adressleiste erkannt hat sind das hier wiebdiskussion im chat sehe ich das richtig chat in oder out heute in oder out die lemmas sind am start ja tja ok arch by the way hat funktioniert update alles klar nice kann man da dazu kann man bloß sagen easy und was mache ich denn j darf sich selber update wunderbar was ist das für ein arch arch ganz normales klassisches arch by the way mehr arch geht nicht marie buten na gut pc speaker ist an by the way arch by the way muss ich by the way mal ausschalten weil ich brauche es gerade überhaupt nicht alles klar doch das wird aber die neue stream vm wenn wir die irgendwann mal fertig eingerichtet haben solange bleibt die alte noch da ja weil ich original by the way arch haben will mach gar nix das gibt halt gar kein stream nee irgendjemand im chat hat geschrieben dass angeblich arch repo updates nicht mehr funktionieren das mussten gerade ausprobieren ansonsten habe ich nix habe ich nix geplant muss ich aber doch noch was sagen wisst ihr was mich auf diesem konzert übelst genervt hat nee ich habe schon längst entsorgt achso nee die die ich angefangen habe das ist die hier die ich die ganze zeit verwende die ist die progress vm also eine sache also eine sache sag ich gleich was zu dem anderen also eine sache die mir wirklich auf den keks gegangen ist bei dem konzert ist also mit dem sound habe ich mich ja schon drüber aufgeregt nee über händis auch nicht über händis gar nicht so sehr über diese völkerwanderung die bei manchen leuten abging ich muss mich teilweise fünf mal in der minute sind das leute an mir vorbeigelaufen die sind permanent rein raus hochgelaufen runtergelaufen während die bands gespielt haben obwohl ich mir so denke warum seid ihr eigentlich hier also was macht ihr eigentlich hier die sind die sind die hyper agile ja aber was cool war es war wirklich komplettes so treffen der generation nee du musst nicht zum dixie klo das ist mitten im waldsteb deutscher bankpark früher ist immer waldstadion da ist der klo ist alles da und das war wirklich cool das war wirklich treffen treffen der generation du hattest da welche keine ahnung die waren 12 eltern da großeltern da von 12 bis an die 80 war da alles da die meisten waren so in meinem alter würde ich sagen ja mir sind das normalerweise auch zu viele menschen aber ab und zu geht das mal das nächste mal ist dann wieder im november ich glaube am 25 november in der jahrhunderthalle gibt es jetztlichen powermette die sind aber wirklich nice und was ich leider wo ich leider verpasst habe ist moment ich dachte das dachte das war schon okay nice bin ich auch am start was war das für ein desktop environment das war doch nicht die drei doch das ist die drei das hier ist die drei und das andere was du gesehen hast hier war auch e3 alles e3 also warum ich windows verwende und warum nicht linux also ich weiß nicht ob du mein letztes video gesehen hast da geht es ja um dieses thema unter anderem und ich brauche halt einige sachen die man am besten unter windows macht und ich mache aber auch viele sachen lieber unter linux so und nachdem ich die sachen die ich unter windows mache besser unter einem native windows machen kann nämlich zum beispiel spiele spielen alles unter einem virtualisierten windows habe ich so rum vm ist für mich performance technisch top überhaupt kein problem aber performance technisch spiele in der vm wäre nicht gut und jetzt kommt mir keiner mit gpu pass zu dann hast du wieder ganz andere probleme kann man alles machen schön in der benutzung ist es nicht so und ich mache es also ich mache streaming spiele videos video editieren und das zeug mache ich unter windows den rest mache ich unter linux in der vm das ist für mich die beste kombination vor allem ist es kein dual boot weil dual boot würde mich nerven zwischendurch ich werde beide systeme gleichzeitig haben die haben wenig gefilmt die waren einfach nur da und sind die ganze zeit rein und raus gelaufen was ist das besondere an i3 dass du keine fenster hast guck mal hier habe ich ein browser auf wenn ich jetzt ein terminal aufmache nimmt es die hälfte des platzes und wenn ich jetzt noch ein terminal aufmache nimmt es ein drittel des platzes ich kann es natürlich auch umschieben aber das soweit alles mit tastatur und du musst dich nicht mehr um fenster management kümmern es war am anfang ich gebe das zu das war am anfang schon gewöhnungsbedürftig sich an i3 zu gewöhnen vor allem mit mehreren desktops und sowas ja normalerweise habe ich es ja so ich habe hier eine idee auf hier habe ich ein terminal hier habe ich ein browser ich habe nur noch ich habe nur noch fullscreen man kann wenn man will wenn man will kann man fenster modus machen das habe ich dafür schiener chinesen den im hintergrund wallpaper jawohl beste ja da kann du kannst fenster machen und fenster hin und her schieben aber als kannst du machen ist aber reichlich sinnlos macht man eigentlich kaum besser alles den window manager teilen lassen so und du hast noch ein paar mehr funktionen du kannst zum beispiel was ich halt auch wirklich praktisch finde du kannst zum beispiel stelle mir vor du hast hier oben irgendwas wichtiges laufen ja du hast hier oben irgendwie deine deinen aktuellen stonksticker aber nur verkaufen muss oder was weiß ich also was hier oben irgendwas wichtiges laufen dann kannst du so sachen machen wie du drückst winstaste s und dann hast du über alle desktops selbst wenn du die desktops durchswitched hast du das sticky dieses eine fenster da oben also man kann schon coole sachen machen mit die drei ja oder zum beispiel stelle euch mal vor ihr guckt ein stream ihr guckt wo bloß oder was anders der chat chat ist ein besseres der chat ist ein besseres beispiel guckt mal also ihr habt den ihr habt den den den chat auf und dann könnt ihr theoretisch den chat irgendwo da oben hinschieben und dann sticky machen auf jedem desktop könnte man da hätte man dann den chat also man kann damit schon coole sachen machen du kannst auch einen tab layout machen oder einen stack layout aber ganz ehrlich ich brauche browser terminal editor ja manchmal 23 editor fenster fertig ja man kann wie gesagt das cool unter i3 ist halt dass man floating windows machen kann aber zum größten teil man sich damit gar nicht beschäftigen muss ja und was jetzt der bessere tiling window manager ist da gibt es ja immer große diskussionen manche sagen gar nicht mehr x sondern direkt wayland und sway andere sagen awesome wm andere sagen herbst luft wm was es wirklich gibt das hat wirklich ziemlich beknackten namen aber ok manche sagen dwm manche sagen bspwm wie man bspwm du fandest tutorial gut das von zwar von 2015 aber von den basics her passt das ohne probleme noch da hat sich nicht so viel dran getan ich meine das ist sehr minimalistisch was soll sich am windows teilen ändern in sieben jahren ascii aquarium ist selbstverständlich wichtig windows hast du die nix das geht ja ja das funktioniert ja man sieht man sieht es es kämpfte es kämpfte gar nicht ok ja also es funktioniert guckt also du kannst ich ich mache windows taster 123 um die des tops durch zu switchen reicht eine grafik gerade für alles noch naja ja aber ich würde jetzt schon eine neuere kaufen und ich will also weil irgendjemand mein pc gerade angezeigt hat ja den pc würde ich heute so nicht kaufen werden weil es irgendeiner auf die glorreiche idee kommt sagt ich will den pc kaufen wieder max den hat ne ne das würde ich auf gar keinen fall mehr so machen ich meine das ist schon ziemlich outdated das ist ein pc von 2017 aber immer noch ziemlich gut das ist wisst ihr das ist ja also das was mich was mich total fertig macht dass ich irgendwie den fünfjahre PC verwenden kann so wie ein high end gerät und alles spielen kann also wie so wie ein high end gerät von damals 2005 oder so ist wahnsinn also das tut sich nicht mehr so viel rap stimmt das gab es auch noch ja gut das ist ja nicht exklusiv ich verwende das ja auch ja ich weiß ich verwende ja auch t-max im terminal und entheilen window manager drum herum ja für die splits in dem fall beugt es nicht unbedingt aber gerade dass du kommandos im hintergrund laufen lassen kannst dass sie den copy buffer ordentlich durchsuchen kannst und so ähnlich den copy buffer den den scrollback buffer ordentlich durchsuchen kannst ist schon nicht verkehrt das fenster über mehrere desktops floaten geht das wirklich nicht sekunde ne das geht tatsächlich nicht warum ist in windows alles so halbherzig kacke gemacht das fenster ist nicht auf dem zweiten desktop das ging unter linux damals mit als als ubuntu noch mit kompets gerne benutzt wurde das ging 2008 ohne probleme wieso sollte es denn da sein naja wenn man war von den wenn man wenn man der logik folgt und sagt mehrere desktops sind quasi ja wie die seiten von einem würfel nebeneinander dann müsste dann müsste der kram das fenster hier so um die ecke rappen und halt dann auf dem desktop halbe halbe sein ich mein es geht auf desktop eins raus und dann würde man eigentlich erwarten dass es links auf desktop zwei wieder rein kommt wobei man das unter kompets auch unterschiedlich einstellen konnte ich glaube man konnte es unter kompets auch so machen dass es nicht der fall war ja habe ich ich habe damals irgendwie eine wim konfig mit 5000 zeilen oder so gehabt richtig hängen geblieben ich hatte fuzzy finder plugins autocomplete plugins wahrscheinlich alles sachen die mir heute gar nicht verwendet sondern es neuere versionen davon gibt alles mögliche ja ich habe wirklich aufgebohrt bis zum geht nicht mehr fand ich aber im nachhinein betrachtet nicht sonderlich schlau und ich bin froh dass ich das nicht mehr mache weil man gewöhnt sich dran dass wim so komisch konfiguriert ist und dann erwartest du auf dem server dass es auch so ist man vergisst die basic editier sachen wenn man solche sachen hat wie sneak wo man in der zeile rumspringen kann und man hat es auf dem server halt nicht wo man eigentlich wim braucht zum editieren und ganz im ernst so toll das ist sachen auf der kommando zeile zu machen muss aber gucken halt sachen dort machen wo es irgendwie sinnvoll ist ich muss sagen als text editor wim auf dem terminal für kleine editieraufgaben und auf dem server um remote was zu editieren wunderbar aber ich möchte beispielsweise keinen terminal editor mehr verwenden als hauptsächliches tool allein schon so sachen wie minimaps parameter highlights und sowas das ist ein krampf im wim ja die 1080 ti ist ziemlich gut jaja die 1080 ti war richtig gut danke nochmal an nvidia das war glaube ich eines der nachhaltigsten sponsorings die ich je gemacht habe die 1080 ti poc echt poc karte kann man nicht anders sagen ja das war ein feder ja gut ssd habe ich mittlerweile ich habe immer noch die ssd drin aber noch was größeres cpu ist die gleiche ram ist mittlerweile mehr drinne guck ram habe ich mittlerweile 32 g aber ansonsten ist es exakt der gleiche rechner noch nur ein bisschen mehr ram und ein bisschen mehr ssd weird flex welcher flex war weird ram ist nicht weird flex ram ist beste man kann nie genug ram haben was ich mir für den pc heute holen würde das ist eine gute frage ich kann es dir nicht sagen weil ich immer nur auf dem aktuellen stand bin was desktop hardware angeht wenn ich mir einen kaufe opens vor einem jahr oder wann kam die aktuelle ryzen raus vor eineinhalb zwei jahren also als die neue ryzen generation angekündigt wurde ja da wollte ich in 5900x kaufen aber nachdem sich das dann alles nicht so ergeben hat ja erstmal hast du nichts bekommen dann hast du was bekommen aber grafikkarten waren unendlich teuer und sowas habe ich meinen rechner einfach immer weiter verwendet und wenn ich mir jetzt einen neuen kaufen müsste müsste ich selbst erstmal nachgucken was sich aktuell anbietet es kann durchaus sein dass es wieder ein intel system wird kann aber auch sein dass ein amd system wird das kann ich das also das könnte ich so gar nicht sagen mal gucken wann habe ich denn den wann ja oktober 2017 5 jahre alt ist der rechner keckel man ich warte auch ab ich kann ja aktuell alles spielen was ich spielen will ach ja es war die frage was ich was ich aktuell spiele also ich habe stray gespielt aber noch nicht ganz durch ich spiele gerade wieder ein bisschen crimdon weil ich sonst nichts besseres zu tun habe an spielen und dann vielleicht mal wieder die neue poe liga die irgendwie nächsten monat rauskommt im august ansonsten habe ich letzten sind strategie also ein ihr werdet lachen ein anime strategie game durchgespielt jetzt richtig gehört bei mir auf dem stream ja ich habe tatsächlich so richtig eher so was wie feier emblem war das nur nicht feier emblem so was halt auf dem pc feier emblem ist ja nicht wirklich so krasses wieb game oder irgendwo schon also was ist so was in der richtung wie feier emblem war das habe ich letztens gespielt und ansonsten gibt es aktuell leider nicht so viel was mich an games so richtig abholt ja anime strategie gibt es na klar guck dir feier emblem an das game war aber wie hieß das denn steam symphony of war oder sowas das da ja genau das da das ist das ist ein bisschen wie feier emblem ja also so mit maps und einheiten rum und so war eigentlich ganz nice ich mein hat auf overwhelming positive ach ja und für alle anime fans der wie nennt man das wie nennt man das der waifu alarm war sehr hoch da war für jeden was dabei aber gameplay technisch fand ich wirklich nicht schlecht ich mein overwhelming positive bei bei 2500 bewertungen nicht verkehrt das habe ich letztens gespielt ja und ansonsten gibt es leider nicht so viel was mich so catcht an games gerade leider wisst ihr ich hätte richtig bock drauf mal wieder nen mmo zu spielen am besten wenn es halt neu rauskommt und kein asia pay to win ein shit mmo sondern ein gutes mmo das problem ist halt es gibt kaum noch gute mmos beziehungsweise es kommen ja eigentlich keine mmos mehr raus und wenn sie rauskommen sind das irgendwelche asia pay to win dinger wisst ihr damals dachte ich als zu zeiten von dark edge of camelot und später world of warcraft sowas da dachte ich mir man wie geil müssen mmos erst sein 2020 tja hast du falsch gedacht die besten mmos kamen damals raus das neue riot mmo ja vielleicht vielleicht vielleicht also ich würde gern wieder ein mmo spielen wo ich von anfang an dabei bin und was mir was mir irgendwie auch direkt zusagt ja es gibt so spiele die gucke ich da sehe ich schon die ersten screenshots und denke mir so na nicht ja genauso wenn sie anfangen immer dann gleich mit survival elementen in dem mmo und sowas ich meine nur weil die ganzen zombie survival dinger so extrem angesagt man heißt es nicht dass man mmos mit survival elementen machen muss oder ich bin auch überhaupt kein freund von perma das system hast den mmos weniger aber es gibt ziemlich viele spiele die letzten jahre die das halt mit mit survival kombinieren und ich mag perma deshalb in keinem game das einzige game wo perma das halbwegs halbwegs gut war war darkest dungeon moment da gibt es den zweiten teil von moment was davon gibt es den zweiten teil was war denn das käckel also da war perma das ok wobei es halt nicht perma das im eigentlichen sinne war also du bist ja nicht gestorben es konnten halt deine helden konnten sterben und wenn ich sterben dann halt zumindest irgendwelche die permanente debuffs davon tragen und so das war das einzige game was mir bock gemacht hat mit sowas wie perma das ach das ist ein epic store exclusive verstehe deswegen habe ich das nicht mitgekriegt ja maus beschleunigung ist ja auch wirklich menschenverachtend ja was spielt ihr denn aktuell so chat wo wir gerade beim thema sind ja elton ring habe ich mir zu release gekauft ich habe es bis jetzt noch nicht gespielt wobei ich es mir fest vorgenommen habe das wirklich der sache mal eine chance zu geben ich bin kein riesiger dark souls fan aber elton ring soll ja auch für leute erträglich sein die dark souls jetzt nicht so geil fanden cringe wer unter drei terabyte rammer dir hyper cringe was ist jetzt los achso das ist ja fünf minuten her ich bin im chat einfach zu langsam übrigens so meine eine eine frage wo ihr raten könnt leute im chat was meint ihr was im also beim iron maiden konzert in frankfurt in der im deutsche bankpark also im stadion drinne was meint ihr was die portion pomfrit gekostet hat so eine tüte pommes ratet mal was hat eine tüte pommes gekostet 650 650 ihr seid ihr seid alle falsch chat alle falsch alle falsch wir kommen die ok ich sags euch 9 euro 9 euro 9 euro tüte pommes ratet das brötchen mit ner wurst drauf also bröt das war ein popliches brötchen ja brötchen wurst und bisschen senf drauf hat fünf euro gekostet und 0,5 0,5 trinken im iron maiden bächer hat glaube ich 4 80 gekostet oder so wobei das einmalig ok war weil den bächer habe ich mit heim genommen ja das ist das ist ok gewesen aber 9 euro für die pommes alter null also habe ich nicht gekauft sie ist ja beim vorbeilaufen du konntest ja auch ein kreppes holen für 450 oder so also es war also es war wirklich teuer genau ich habe zweimal gekauft twitch twitch money regelt und jetzt bin ich pleite jetzt brauche ich auch den ganzen prime subs sonst kann ich mir morgen expert zu essen kaufen ok hell let loose ja ich wollte schon lange mal ausprobieren aber ich glaube da kommt man nicht mehr richtig rein jetzt was nutt nutze linux portiert auf dem usb weil eine vm die performance auseinander nimmt was der satz ergibt für mich jetzt wenig sinn du willst ein persistentes system haben was du überall mit hinnehmen kannst oder wie chain war war das nee möb war der erste der halbwegs richtig liegt lag was ist denn web application elf in der taskleiste das hier ist das das ist die anwendung mit der ich bilder overlayen kann oder oder zum beispiel oder zum beispiel sagen lassen kann oder um die leute zu verwirren ich kann damit beispielsweise auch solche solche solche sounds mitmachen oder das was jeder mag was ist web application elf windows to go auf einem usb mit vm war wo tails läuft way to smart pfeifen genau selbst entwickelte bettel viel 2042 hex ja sollte ich vielleicht mal ausprobieren ja kann ich mir vorstellen leute ich muss trinken ich muss hydrated stain du bist unten im chat jepp jepp chat jepp harm den habe ich gebannt den hydrated bot da ging mir auf den keks des des geblockt der kann er nicht mehr hydraten ja schon ewig den habe ich bestimmt schon drei jahre gebannt oder so kauft ihr jetzt kein neuen pc solang deiner noch läuft ist es immer das beste abzuwarten außer du hast jetzt einen konkreten anwendungsfall wo du sagst dafür reicht es nicht mehr mache ich auch mache ich ich warte auf die 4900 ich warte auf neue cpu generation und 4900 und dann hole ich mir vielleicht einen neuen pc nach die intel karten das wird eben die oh leute ich glaube ich muss echt mal fiber messen ich active zeit ich hab mich gerade so ein kopf es fühlt sich schon warm an also wärmer wärmer als sonst auf jeden Fall Naja, also ich hoffe nicht, also ich hoffe immer noch nicht, dass es Corona ist und selbst wenn es Corona ist, ich mein, ich bin, wie oft geimpft bin ich, was ist normal, dreifach ist, wenn man alles gemacht hat, was es so gab oder, ich guck mal kurz in meine Corona App, das steht doch da irgendwie, ja ich hab den Kram immer noch drauf, ich würde es jetzt nicht mehr neu installieren, aber, schauen wir mal kurz, oh ich glaube, ich hab Bluetooth aus, deswegen funktioniert das nicht, nee ich hab noch keinen Schnelltest gemacht und ich glaube es ist einfach auch noch zu früh für den Schnelltest, weil das Konzert war am Dienstag, das ist ja gerade mal zwei Tage her, wenn du es so willst und die Schnelltests so richtig hinhauen tun die ja frühestens eigentlich nach vier Tagen, bestimmt, gleich, was ist da eigentlich raus geworden, lange nichts mehr gehört, tja, ich würde mich nicht darauf verlassen, ehrlich gesagt, ich denke auch, ich hab ja heute morgen im Internet geguckt, normale Inkubationszeit bei Corona sind irgendwie zwischen vier und sechs Tagen, aber ich mein okay, wir hatten jetzt auch jemand vorhin im Chat, der gesagt hat, bei ihm war es genauso, es ist ja noch nicht krass, mir tut ein bisschen der Hals weh und ich muss ein bisschen husten, also es könnte durch, also ich glaube Leute, die da nicht so genau drauf achten, die würden wahrscheinlich noch sagen, das ist doch alles normal, ja, das ist wahrscheinlich normal, dass es so anfängt, ja, ich wollte morgen tatsächlich ins Büro fahren, aber ich glaube, das lass ich, das lass ich, also, das ist ein Link, ich weiß nicht, was sich dahinter verbirgt, aber das mach ich nicht auf bei diesem Titel, ja, ich hoffe, ich hoffe, es ist nicht so wild, also, würde gerne deine Meinung zu folgender Situationen wissen angenommen, du bist Fullstack Webentwickler mit TypeScript, okay, und hast du ein Jobangebot als Cloud Architekt Azure mit C Sharp als Backender Fullstack Webentwickler, also das erste, was ich mich fragen würde ist, kannst du das, also ich mein, ich würde jetzt davon ausgehen, ja, du kannst das, weil ansonsten hätten sie dir kein Angebot gemacht, es ist ja schon ein bisschen was anderes, also hast du Ahnung von Cloud Architektur und von Azure, ansonsten ist es halt ziemlich ins kalte Wasser gesprungen, ja, man kann das sicherlich alles lernen, aber wenn du irgendwo anfängst, wo aus Gründen der Jobbezeichnung von dir erwartet wird, dass du das kannst, und du kannst es dann nicht, ist vielleicht auch nicht so die beste Voraussetzung, was ist denn ein Web3 Entwickler, willst du irgendwelche NFT Geschichten machen oder dezentrales Blockchain Pfeifer Zeug, ansonsten, ganz ehrlich, kann ich dir das nicht beantworten, ne, wir sind bei Web3, Web3 ist doch das Blockchain Zeug, ich kann es dir nicht beantworten, also ich persönlich würde auf jeden Fall das hier machen, anstatt das andere, aber das kann ich so nicht wissen bei dir, keine Ahnung, du musst nicht zwangsläubig was mit Terraform machen, aber es ist auf jeden Fall nicht verkehrt, von genau solchen Sachen Ahnung zu haben, bevor man Cloud-Architekt wird, übrigens bisschen komische Kombination, Cloud-Architekt mit C-Sharp als, also du bastelst da nicht am Backend rum, oder, oder bist du quasi, quasi fulles Stack-Entwickler, dann Frontend, Backend und Cloud-Infrastruktur, Bleeds Stack, ja also meine Gedanken sind, ich persönlich würde das hier deutlich lieber machen als das hier, erstens, weil ich mir bei der ganzen Web3-Geschichte mich fragen würde, welcher Laden ist das, wo bin ich da gelandet und weil ich keinen Bock hätte auf JavaScript-Frontend den ganzen Tag, ich mich aber zumindest mit Cloud-Architektur schon ein bisschen auskenne und C-Sharp jetzt auch nicht das schlechteste ist bei mir, also für mich persönlich, das heißt ja für dich nichts, aber für mich persönlich wäre das hier die bessere Variante, aber vielleicht ist es bei dir genau umgedreht, vielleicht sagst du, ja hiervon habe ich Ahnung, davon eigentlich eher nicht, dann ist bei dir genau umgedreht, Gigas Stack, ja du kannst mal in der Berufsschule gucken, ob sie den Lehrplan irgendwo haben, oder den Ausbildungsplan oder wie das genau heißt und du kannst dich schlau machen, mit was sich deine Firma, also der Betrieb, wo du die Ausbildung machst, mit was die sich sonst so beschäftigen, was die so machen und dann gucken, ob man sich da irgendwie darauf vorbereiten kann, aber ansonsten muss man auch ganz klar sagen, Ausbildung ist ja dafür da, dass man was lernt, nicht dass man schon alles kann. Welche Sprache für Anfänger JavaScript? JavaScripts, allein schon aus zwei Gründen, der Einstieg ist einfach nix Java zum Einstieg, JavaScript, der Einstieg ist mit Abstand am einfachsten, du brauchst nur einen Editor und einen Browser und das zweite ist an Frontend Technologien, also in dem Fall JavaScript, HTML, CSS, kommt niemand vorbei und sei es nur ein bisschen. Und dann wird das abgeschrieben und ein paar Fax verschickt, oder wie? Programmieren WDR Maus, ich rede mit was? Programmieren mit der Maus. Blockly mit der Maus, hey das ist ne richtig gute Idee Leute, warum ist das alles so ausgekraut? Das ist ne richtig gute Idee. Warum kann man das hier nicht anklicken? Blöde Frage, warum ist das alles ausgekraut? Ach wegen meinem Dark Mode? Nö. Aber das finde ich ist ne gute Idee sowas zu machen, aber wenn ich das, ach so hier kann ich jetzt, ne das ist ne gute Idee. Nice Idee, finde ich gut. Ja, Battlefield Portal ist ja auch auf Blockly Basis, sieht man ja auch im Browser, wenn man sich die Worlds anguckt, was da so nachgeladen wird und so. Ganz im Ernst, mir ist es lieber, die geben Geld von meinen Gebühren für sowas, also jetzt mal ernsthaft, guck mal, mir ist es lieber, die geben Geld für sowas aus mit meinen Gebühren, als für Rosamunde Pilcher oder dicke Backenmusik oder Florian Silbereisen, der Musikantendampfer und was es da nicht alles gibt. Also dann ist mir das deutlich lieber. Eigentlich ne coole Idee. So, the end. Also, wenn du technische Assistent gemacht hast, das ist das, was dann irgendwie staatlich geprüft hat, Informationstechnische Assistent, oder? Oder meinst du das, was in der Schweiz Assistent heißt? Das ist diese Ausbildung, wo man nichts mitfindet, was eigentlich useless ist zu machen, also wenn das dieser staatlich geprüfte Informationstechnische Assistent ist. Das ist useless, das kannst du vergessen. Du wirst aber dadurch wahrscheinlich in der Berufsschule nicht viel Neues lernen in der Ausbildung. Was du in der Ausbildung lernst, ist halt, was im Businessumfeld so abgeht. Nee, ich glaube dann ist es was anderes. Aber ob du studieren willst oder eine Ausbildung machen willst, das kann ich dir jetzt ja schlecht beantworten. Also, wenn du studieren gehen willst, dann geh gleich studieren. Also, erst das machen, dann das machen, dann studieren gehen ist unsinnig. Also, die Physi-Ausbildung bringt dir jetzt fürs Studium nicht wahnsinnig viel. Umgedreht würde ich sagen, wahrscheinlich auch nicht so wirklich, weil in der Ausbildung geht es halt eher um die Praxis und im Studium kannst du halt den Binary Tree inverten. Also, das kann ich dir jetzt nicht sagen. Du musst ja im Klaren sein, dass ein Informatikstudium jetzt nicht easy as fuck ist, also nicht so nach dem Motto, ahja, ich setze mich jetzt mal ein paar Stunden in die Uni und dann mache ich easy Mathe und Informatik. Nee, nee, so einfach ist das nicht. Wohingegen die Physi-Ausbildung, was Berufsschule angeht, als schlechter Witz ist, also das schafft jeder, selbst ohne aufpassen. Also, die Physi-Ausbildung ist, was Schule angeht und Lernen angeht, definitiv entspannter, also am Theorie-Anteil definitiv entspannter als zu studieren. Denkst du, dass man bessere Karrierechancen hat mit Studium? Ja, prinzipiell würde ich sagen schon. Ich denke mal, wenn wir uns irgendwelche Gehalts-Tabellen angucken würden, dann ist es bestimmt auch so, dass im Durchschnitt, wie gesagt nur im Durchschnitt, das heißt nicht, dass es unbedingt jetzt für dich gelten muss, aber im Durchschnitt, wahrscheinlich Leute, die studiert haben auch einen Ticken mehr verdienen, unterm Strich hängt es am Ende halt trotzdem davon ab, was du kannst. Wir haben beispielsweise bei uns im Support einige Leute sitzen, die haben Informatik studiert. Zwar kein Master, sondern nur das davor, aber die machen jetzt Support und haben eigentlich voller Technik, nicht so viel mit zu tun und teilweise auch nicht so wirklich viel Ahnung. Wie, du kannst kein binary tree invert nach dem Informatikstudium, dann würde ich sagen, da haben die aber gefällt. Doch hats, Informatikstudium hat was mit Mathe und Programmieren zu tun. Also jemand, der was anderes, ich meine Leute, ich habe nicht studiert, aber ein bisschen schlau gemacht und auch mit Leuten drüber gesprochen, die studiert haben, habe ich selbstverständlich ein Informatikstudium, was mit Programmieren und Mathe zu tun. Ich glaube die meisten, die Wirtschaftsinformatik studieren, ich weiß nicht, wie es bei dir ist, die wollen einfach, dass der Matheanteil einfacher wird. Ist so meine persönliche Vermutung, keine Ahnung, ob das stimmt. Also im Durchschnitt, im Durchschnitt ist es bestimmt so, im Durchschnitt werden wahrscheinlich Leute, die studiert haben, mehr verdienen, als Leute, die eine Ausbildung gemacht haben. Ich gehe aber davon aus, dass sich das mit Berufsjahren ein bisschen angleicht und dass man es dann irgendwann gar nicht mehr so genau erkennt. Weil wo es einen riesen Unterschied macht, ist wohl wahrscheinlich, wenn du bei irgendwelchen Behörden arbeitest, die haben da halt sehr starre Vorgaben. Ja, das kann ich jetzt nicht sagen, aber es hört sich schon ein bisschen so an, weil ich meine dein Chef weiß doch, was du kannst. Ich kann mir ehrlich gesagt nicht vorstellen, dass du nach deiner Ausbildung neben dem Beruf ein Studium da noch machst, um mehr Geld zu verdienen, weil du lernst in dem Studium höchstwahrscheinlich nichts, was für deine Arbeit jetzt erstmal so relevant ist, unmittelbar und nicht so viel besser machen würde, als wenn du Fachinformatik und Anführungsentwicklung gelernt hast. Du hast in dem Betrieb gelernt, du weißt, was die machen, das ist mehr, als jeder, der Informatik studiert hat, weiß. Du weißt, wie die Projekte laufen, du weißt, auf was die basieren, du kennst die Codebase, also das Informatikstudieren würde in dem Fall jetzt rein arbeitstechnisch wahrscheinlich gar nicht so viel bringen. Wenn es dein Chef erzählt, kann es durchaus ein Grund sein, dass er sagt, ja hättest du studiert, würdest du mehr verdienen. Keine Ahnung, das kann man jetzt schlecht einschätzen, ich mein vielleicht ist er auch letztendlich gar nicht der, der das entscheidet, sondern irgendeine Instanz oben drüber und ihr seid eine Behörde und da muss das so sein. Ja Support würde ich auch nicht machen. Ja so seh ich denke ich auch, genau. Also ich würde nicht sagen, dass du pauschal sagen kannst, welcher der beiden jetzt am Ende mehr Verantwortung übernimmt. Vor allem Verantwortung für was? Personal, Projekte, irgendwelche Verfügbarkeits-SLRs, von was? Ja das ist natürlich was anderes, dann hat es ja auch einen anderen Anreiz das zu machen. Da wird viel Blödsinn gelabert, wenn der Tag lang ist, man kann es davon abgesehen, gibt es wirklich jemand, der ernsthaft CTO werden möchte? Also ich sage nicht, dass es keine Leute gibt, die CTO werden möchten, aber die meisten Techniker haben doch auf solche hohen Positionen gar keinen Bock. Mein Ausnahmen bestätigen die Regel. Also ich kann ja nur von mir ausgehen, ich habe zum Beispiel keinen Bock irgendwelche höheren Management-Geschichten zu machen. Nö habe ich nicht, aber letztendlich musst du sowas als Informatiker eben wissen. Das ist halt der große Unterschied zwischen Ausbildung und Studium, im Studium hast du halt die theoretischen Hintergründe, dass du weißt warum das auch maximal in linearer Zeit durchläuft. Da sagst du nicht einfach nur Array.sort, sondern du kannst im Zweifelsfall auch erklären, warum an dieser Stelle dieser Sortier-Algorithmus die bessere Wahl ist, wenn die Daten so und so da reinkommen. Das ist vielleicht das, was du nach einem Studium machen kannst, was du aber nicht unbedingt jetzt rein mit dem Wissen aus der Ausbildung machen kannst. Natürlich, ganz ehrlich, meistens ist es gar nicht notwendig, dass man das selber weiß, man gibt das in Google ein und hat dann ok, ich habe zur Auswahl Quick-Sort, Merge-Sort, Bubble-Sort, meine Daten haben maximal 20 Elemente im Array, also nehme ich das, so fertig. Aber wenn du es dann wirklich mathematisch auch belegen willst oder das fundiert beantworten können musst, dann bringt dir das schon was, wenn du das weißt. Wie oft es jetzt vorkommt, hängt sicherlich auch von der Stelle ab. Vielleicht, also seit dem Konzert habe ich Halsweh, ich muss husten und irgendwie fühle ich mich auch, man's not hot, fühle ich mich auch warm. Ich muss mir nachher, wie gesagt, nachher Thermometer in Bubble mal gucken. Kann mir einer einen Tipp geben, wie man lokale IP-Adressen in einem Domain zuweisen kann, dass diese auch, naja, du mal gehst in dein DNS auf deinem Router und trägst dort den Name ein und fertig. Also, ich verstehe das Problem gerade nicht, oder ist das eine Domain, die extern und intern verwendet wird? Also, für den Fall der Fälle gibt es zwei Varianten, du machst Split-DNS, also sprich, du hast intern Sachen, die aufgelöst werden, aber extern nicht, kann man machen, zum Beispiel überschreibst du halt in deinem Router-DNS oder in deinem lokalen DNS manche Adressen mit lokalen IPv4-Adressen oder IPv6-Adressen und alles, was du nicht kennst, formatest du weiter an die öffentlichen DNS-Server oder du kannst theoretisch auch in deinem Public-DNS Private-IPs eintragen, das geht auch, da kommt ja dann auch keiner hin, das sind ja Private-IPs. Also, du kannst ohne Probleme keqw.services, also hier keine Ahnung, 0.keqw.services kann ohne Probleme auflösen auf 122.168.0.1, auch Public, das funktioniert, man kommt halt nirgends wo an, nutze Linux für die Entwicklung, ja mittlerweile ausschließlich, wenn es nicht gerade irgendwelche Windows-Sachen sind, die ich mache, aber ansonsten 95% exklusiv nur unter Linux, geht das auf der Fritzbox, keine Ahnung, Leute kann man in der Fritzbox DNS-Geschichten setzen, wahrscheinlich, kannst du statische DNS-Einträge machen in der Fritzbox, wahrscheinlich ja, ja geht wahrscheinlich, ja, was ist das, kannst du es aufmachen, 15 sorting algorithms in 6 minutes, harte Kost, wir gucken uns jetzt gleich noch das TempleOS-Video an, I remain 2 und, nee, 26. in Frankfurt im Stadion, was hast du für Disko, welche Tools nutzt du bezogen auf Linux, ich benutze Manjaro, das ist so ein Arch Linux Abkömmling, ja und als Tools eigentlich zum größten Teil die IDE's von JetBrains, hauptsächlich Rider für.NET und halt ansonsten alles mögliche was es halt unter Linux so gibt, was man so braucht, also der Sound war nicht gut, die Band und die Show war nice, Preis-Leistungstechnik war auch okay, außer das Essen und Trinken, ja und ich hab mir irgendwas eingefangen, das wichtigste Tool-ASCII-Iquarium, ja eindeutig, eindeutig, ja, das muss sein, Leute mir tut der Hals weh, ich geh jetzt off, ging länger als ich das gedacht habe, ich hoffe mal, dass es kein Corona ist, aber drauf ankommen lassen will ich es nicht, also ich will nicht unbedingt alle anstecken jetzt, die Minimalinstallation war das und alles selbst gemacht, das war original, ja ja, das waren die alten Säcke, ab zum Arzt, das ist jetzt gerade ein bisschen schwierig, es hat 90€ gekostet und es ging mit zwei Bands davor und Iron Maiden ging's von 17.50 Uhr in dem Dreh bis 22.45 Uhr, also davon waren, Iron Maiden waren auch 100 Minuten ungefähr, es war aber richtig geil, also Liederauswahl war wirklich okay, viel altes Zeug, wo ich die Texte konnte und mitsingen konnte, man die 4-5 neuen Songs hätte man sich sparen können, weil die kenne ich nicht, aber ich will mich jetzt ja nicht beschweren, dass sie aktuelles Zeug spielen, danke für den Sub, danke für die ganzen Subs heute auch, by the way, fällt mir gerade ein, ich hab nämlich überhaupt nicht reingeguckt, überhaupt nicht drauf geachtet, Tribolon hat auch noch gesubbt und das war's, gut, hab ich ja nicht viel übersehen, danke schön Leute, also macht's gut, wir sehen uns, WOTCS, POG Subscription, danke, bis dann Leute, wir sehen uns, macht's gut, see you.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Das war's für heute."}, {"id": 2, "start": 2.0, "end": 30.0, "text": "Das war's für heute."}, {"id": 3, "start": 30.0, "end": 32.0, "text": "Das war's für heute."}, {"id": 4, "start": 32.0, "end": 34.0, "text": "Das war's für heute."}, {"id": 5, "start": 34.0, "end": 36.0, "text": "Das war's für heute."}, {"id": 6, "start": 36.0, "end": 38.0, "text": "Das war's für heute."}, {"id": 7, "start": 38.0, "end": 40.0, "text": "Das war's für heute."}, {"id": 8, "start": 40.0, "end": 42.0, "text": "Das war's für heute."}, {"id": 9, "start": 42.0, "end": 44.0, "text": "Das war's für heute."}, {"id": 10, "start": 44.0, "end": 46.0, "text": "Das war's für heute."}, {"id": 11, "start": 46.0, "end": 48.0, "text": "Das war's für heute."}, {"id": 12, "start": 48.0, "end": 50.0, "text": "Das war's für heute."}, {"id": 13, "start": 50.0, "end": 52.0, "text": "Das war's für heute."}, {"id": 14, "start": 52.0, "end": 54.0, "text": "Das war's für heute."}, {"id": 15, "start": 54.0, "end": 56.0, "text": "Das wollte nicht für Vote Hartdorff bemutzen."}, {"id": 16, "start": 56.0, "end": 58.0, "text": "Das wollte nicht für Vote Hartdorff bemutzen."}, {"id": 17, "start": 88.0, "end": 90.0, "text": "Das war's für heute."}, {"id": 18, "start": 90.0, "end": 118.0, "text": "Das war's für heute."}, {"id": 19, "start": 118.0, "end": 133.0, "text": "So, ich bin am Start Leute."}, {"id": 20, "start": 133.0, "end": 141.0, "text": "Ja, vielleicht, ich erzähl euch auch gleich, was Sache ist."}, {"id": 21, "start": 141.0, "end": 147.0, "text": "Also Husten ist sogar schon ein bisschen am Start, es kann auch ganz normale Erkältung sein."}, {"id": 22, "start": 147.0, "end": 149.0, "text": "Aber"}, {"id": 23, "start": 150.68, "end": 154.4, "text": "Corona ist gar nicht so unwahrscheinlich. Ich erzähl euch auch warum"}, {"id": 24, "start": 156.32, "end": 158.32, "text": "Ich habe kein test gemacht noch zu kurz"}, {"id": 25, "start": 160.44, "end": 162.44, "text": "Warte mal"}, {"id": 26, "start": 162.72, "end": 164.72, "text": "Bisschen leiser machen"}, {"id": 27, "start": 165.72, "end": 167.2, "text": "Also"}, {"id": 28, "start": 167.2, "end": 172.92, "text": "Ich erzähl euch jetzt mal was. Ich kann heute nicht so wahnsinnig rumschreien. Ich habe auch ein paar Bonbons am Start"}, {"id": 29, "start": 172.92, "end": 180.24, "text": "Ja und abends muss ich ein bisschen husten. Ich hoffe halt wie gesagt, ich hoffe dass es eine normale Erkältung ist und nicht Corona"}, {"id": 30, "start": 180.24, "end": 183.88, "text": "Aber also ich erzähl euch mal was und zwar ich war"}, {"id": 31, "start": 185.4, "end": 187.4, "text": "Dienstag"}, {"id": 32, "start": 189.24, "end": 192.52, "text": "Beim super spreader event schlechthin in Frankfurt"}, {"id": 33, "start": 194.4, "end": 196.4, "text": "Legacy of the beast"}, {"id": 34, "start": 196.4, "end": 203.36, "text": "50.000 Leute in der Commerzbank Arena, ne nicht Commerzbank Arena im Dorf"}, {"id": 35, "start": 204.48, "end": 206.0, "text": "heißt nicht mehr so"}, {"id": 36, "start": 206.0, "end": 208.2, "text": "Deutsche Bank Park heißt es jetzt ja"}, {"id": 37, "start": 210.56, "end": 212.56, "text": "Und"}, {"id": 38, "start": 215.48, "end": 220.0, "text": "Mittwoch ging ja 5000 Leute waren es ungefähr"}, {"id": 39, "start": 222.12, "end": 224.12, "text": "Ist glaube ich passen maximal"}, {"id": 40, "start": 224.12, "end": 231.68, "text": "66.000 oder so rein aber die hintere aber dieses hintere Viertel hinter der Bühne hat man natürlich nicht besetzt. So"}, {"id": 41, "start": 232.96, "end": 234.96, "text": "zumindest"}, {"id": 42, "start": 236.6, "end": 238.6, "text": "Mittwoch ging"}, {"id": 43, "start": 239.76, "end": 244.84, "text": "Also vorgestern vorgestern ging und"}, {"id": 44, "start": 246.28, "end": 248.28, "text": "Seit heute nacht"}, {"id": 45, "start": 248.28, "end": 254.36, "text": "Er muss sich husten und mir hat auch der Hals weh getan. Okay, vielleicht Klimaanlage sonst wie"}, {"id": 46, "start": 257.16, "end": 259.16, "text": "Und das ist heute schlechter geworden"}, {"id": 47, "start": 259.72, "end": 263.48, "text": "Tag über ich ich werde jetzt ein paar Bonbons bonbons lutschen"}, {"id": 48, "start": 264.32, "end": 266.56, "text": "Und ich fühle mich auch irgendwie warm an"}, {"id": 49, "start": 267.56, "end": 273.32, "text": "Ich habe noch kein Fieber gemessen und ich will mir jetzt auch nicht live im stream auch wenn der chat jetzt sagt ja auf geht's"}, {"id": 50, "start": 273.32, "end": 276.08, "text": "Mach mache ich nicht. Ich will mir jetzt auch nicht live im stream"}, {"id": 51, "start": 276.08, "end": 278.92, "text": "das Thermometer in Pobo schieben"}, {"id": 52, "start": 280.92, "end": 283.64, "text": "Live live Fieber messig"}, {"id": 53, "start": 288.24, "end": 289.84, "text": "Das war aber nicht"}, {"id": 54, "start": 289.84, "end": 291.36, "text": "so ein test"}, {"id": 55, "start": 291.36, "end": 295.24, "text": "Test habe ich auch noch nicht gemacht und ich sage euch auch warum ich noch kein test gemacht habe"}, {"id": 56, "start": 296.16, "end": 298.0, "text": "nicht unter den Achseln"}, {"id": 57, "start": 298.0, "end": 302.08, "text": "Thermometer kommt in Pobo dann funktioniert das stimmt das wenigstens auch was draufsteht"}, {"id": 58, "start": 302.08, "end": 306.72, "text": "Mit richtig mit richtig Gatschi bass reingerollt bis zum Anschlag"}, {"id": 59, "start": 307.84, "end": 309.44, "text": "Ich gehts"}, {"id": 60, "start": 309.44, "end": 311.44, "text": "Das tut ja weh"}, {"id": 61, "start": 312.44, "end": 318.84, "text": "Nein, aber nicht unter nicht unter die Achseln ja Thermometer muss muss schon in Pobo und es funktioniert das nicht"}, {"id": 62, "start": 320.2, "end": 322.2, "text": "Das muss ihn hinteren"}, {"id": 63, "start": 323.96, "end": 329.4, "text": "Vielleicht geht das ja vielleicht würde dieser content auch unter unter pools durchgehen ich mache ein bisschen wasser im Hintergrund"}, {"id": 64, "start": 329.4, "end": 332.44, "text": "haben dann alles gut"}, {"id": 65, "start": 334.12, "end": 335.12, "text": "Also"}, {"id": 66, "start": 335.12, "end": 337.12, "text": "was wollte ich jetzt sagen"}, {"id": 67, "start": 337.12, "end": 343.28, "text": "also ich habe noch kein test gemacht weil ich habe im Internet geguckt und die sagen eigentlich"}, {"id": 68, "start": 344.64, "end": 353.2, "text": "Wenn du willst dass dieser test halbwegs aussagekräftig ist da musste vier bis fünf Tage warten und meistens"}, {"id": 69, "start": 354.32, "end": 356.12, "text": "dauert es auch"}, {"id": 70, "start": 356.12, "end": 361.6, "text": "Bis man von Corona richtig viel merkt auch vier bis fünf tage"}, {"id": 71, "start": 363.32, "end": 364.56, "text": "Oder"}, {"id": 72, "start": 364.56, "end": 366.56, "text": "Fünf bis sechs sogar eher"}, {"id": 73, "start": 366.56, "end": 368.56, "text": "Weißt du im Endeffekt"}, {"id": 74, "start": 370.0, "end": 372.0, "text": "Es spricht eher"}, {"id": 75, "start": 372.0, "end": 375.44, "text": "Nicht für Corona dass ich jetzt schon was im Hals merke aber"}, {"id": 76, "start": 376.48, "end": 378.48, "text": "Dass ich husten muss ist natürlich"}, {"id": 77, "start": 379.48, "end": 381.48, "text": "schon mal schlecht"}, {"id": 78, "start": 381.48, "end": 383.48, "text": "Zumal ich halt wie gesagt"}, {"id": 79, "start": 383.48, "end": 389.64, "text": "Auf dem Event schlechthin war um mir Corona einzufangen also wenn man sich wenn man sich Irgendwie"}, {"id": 80, "start": 393.04, "end": 396.04, "text": "War bei dir auch so na toll"}, {"id": 81, "start": 400.04, "end": 405.96, "text": "Ist doch ist doch wie bei mir dann ist doch dann ist doch ähnlich wie bei mir dienstag eingefangen"}, {"id": 82, "start": 407.16, "end": 410.32, "text": "Ab heute nach beziehungsweise heute tagsüber hals"}, {"id": 83, "start": 410.32, "end": 412.64, "text": "und husten"}, {"id": 84, "start": 412.64, "end": 414.64, "text": "und tja"}, {"id": 85, "start": 414.64, "end": 416.64, "text": "mal schauen"}, {"id": 86, "start": 423.2, "end": 429.6, "text": "So ne vor vier fünf bis sechs tagen nicht daheim kriegste kein Corona zumindest also"}, {"id": 87, "start": 432.4, "end": 434.4, "text": "Du hast sogar das leichte rauschen pock"}, {"id": 88, "start": 434.4, "end": 439.12, "text": "Kollege hat sich auf dem Ironmanen Konzert angesteckt. Ach da wo ich auch war na toll"}, {"id": 89, "start": 440.08, "end": 443.84, "text": "Ich sag doch zu super super spreader event"}, {"id": 90, "start": 446.56, "end": 448.56, "text": "Also"}, {"id": 91, "start": 450.48, "end": 456.2, "text": "Wie gesagt ich das fühlt sich auch ein bisschen warm an wenn ich mich angreife so hier gesicht und"}, {"id": 92, "start": 457.0, "end": 459.0, "text": "So auch ein bisschen warm an"}, {"id": 93, "start": 459.0, "end": 463.96, "text": "Wenn ich mich angreife so hier gesicht und so auch an der seite und so"}, {"id": 94, "start": 465.24, "end": 467.56, "text": "Muss ich mal gucken ich werde nach dem stream eine runde"}, {"id": 95, "start": 468.2, "end": 473.4, "text": "Thermometer in pobs schieben ja wenn es nur das wäre wäre ja ok hatte ich keine schmerzen mit"}, {"id": 96, "start": 475.0, "end": 478.04, "text": "Aber ich fürchte fast ich meine ich habe es bis jetzt"}, {"id": 97, "start": 478.84, "end": 480.84, "text": "mehr"}, {"id": 98, "start": 483.48, "end": 487.16, "text": "Aber ich ob es falsches falsches emote aber ich"}, {"id": 99, "start": 487.16, "end": 489.16, "text": "Aber ich"}, {"id": 100, "start": 490.28, "end": 494.04, "text": "Aber ich hat es bis jetzt um schiff mit corona also ich habe"}, {"id": 101, "start": 496.28, "end": 499.8, "text": "Die dumme vermutung dass mich jetzt erwischt hat"}, {"id": 102, "start": 503.0, "end": 505.0, "text": "Das wäre ziemlich kacke"}, {"id": 103, "start": 506.44, "end": 508.44, "text": "Aber früher oder später"}, {"id": 104, "start": 508.44, "end": 515.32, "text": "Kommst du da wahrscheinlich nicht drumherum mal gucken wie es morgen ist"}, {"id": 105, "start": 517.32, "end": 522.84, "text": "Gucken wie es morgen ist ich trinke viel zeug ach ja und das beste ist habe ich euch auch gar nicht erzählt"}, {"id": 106, "start": 523.32, "end": 528.12, "text": "warum das warum das noch mal extra kacke ist mir geht es dann nämlich ohne corona schon nicht so gut weil"}, {"id": 107, "start": 528.52, "end": 530.84, "text": "Ich habe euch ja schon vor ein paar wochen erzählt dass ich zahn wehr hatte"}, {"id": 108, "start": 531.32, "end": 535.72, "text": "Und ich war ja ein paar mal beim zahnarzt der wusste nicht so wirklich was sache ist und man sieht irgendwie nichts"}, {"id": 109, "start": 535.72, "end": 539.88, "text": "hat röntgenbild gemacht alles und er hat jetzt ein paar sachen probiert"}, {"id": 110, "start": 540.6, "end": 542.04, "text": "und dann hatte ich"}, {"id": 111, "start": 542.04, "end": 544.52, "text": "letzte woche freitag einmal wurzelbehandlung"}, {"id": 112, "start": 545.8, "end": 547.0, "text": "und"}, {"id": 113, "start": 547.0, "end": 552.68, "text": "Jetzt tut mir der zahnweber im drauf beißen und drumherum alles also ich habe quasi"}, {"id": 114, "start": 554.04, "end": 560.04, "text": "bald zahnschmerzen und corona obwohl man eigentlich also ich hoffe dass nicht dass es corona ist aber"}, {"id": 115, "start": 560.04, "end": 565.08, "text": "Obwohl man ja eigentlich davon ausgehen müsste dass nach der wurzelbehandlung man nichts mehr spürt"}, {"id": 116, "start": 566.84, "end": 570.76, "text": "Und ja am zahn spüre ich auch nichts mehr also weder noch heiß noch kalt"}, {"id": 117, "start": 571.96, "end": 577.24, "text": "Aber drumherum und es wird eher schlechter als besser ich hoffe es legt sich dieses wochenende wieder"}, {"id": 118, "start": 577.72, "end": 579.72, "text": "Ja und sollte ich jetzt irgendwie"}, {"id": 119, "start": 580.36, "end": 582.92, "text": "Erkältung oder corona haben kann ich auch nicht zum zahnarzt gehen"}, {"id": 120, "start": 582.92, "end": 588.6, "text": "Jetzt muss ich ein paar pillen einschmeißen mein aktuell geht's aber gerade ist wirklich gerade ist wirklich alles alles"}, {"id": 121, "start": 589.72, "end": 591.72, "text": "zusammen kacke ja"}, {"id": 122, "start": 591.72, "end": 594.76, "text": "Deswegen habe ich mir gedacht ich mache jetzt mal stream an"}, {"id": 123, "start": 595.8, "end": 597.8, "text": "So ich habe salbei bonbons hier"}, {"id": 124, "start": 599.56, "end": 601.56, "text": "Rikola"}, {"id": 125, "start": 603.4, "end": 607.24, "text": "Salbei bonbons muss ich ab und zu mal ab und zu mal ein futtern"}, {"id": 126, "start": 607.24, "end": 611.56, "text": "Ne der zahn ist ja noch drin das ist ja der sinn von wurzelbehandlung"}, {"id": 127, "start": 620.84, "end": 622.84, "text": "Naja mal gucken"}, {"id": 128, "start": 623.56, "end": 628.68, "text": "Also gucken wir das mit dem wie war denn das bei dir wir hatten das eben geschrieben"}, {"id": 129, "start": 629.4, "end": 631.4, "text": "Wir hatten das eben geschrieben"}, {"id": 130, "start": 631.4, "end": 638.68, "text": "Was war denn in deinem halt also wie war das bei dir mit corona und dem hals der das eben mit dem hals geschrieben hat hier"}, {"id": 131, "start": 639.8, "end": 644.04, "text": "N3 og oder besser gesagt wahrscheinlich neo g"}, {"id": 132, "start": 645.64, "end": 652.84, "text": "Salbei salbei es ist salbei ist an sich gut salbei ist gut wenn man probleme mit dem zahnfleisch hat und gegen hals"}, {"id": 133, "start": 654.04, "end": 655.08, "text": "Ach ja"}, {"id": 134, "start": 655.08, "end": 663.8, "text": "Also stimmt jetzt habe ich erst mal erzählen dass ich mir wahrscheinlich corona eingefangen habe beim konzert jetzt kann ich euch was erzählen wie das konzert war also"}, {"id": 135, "start": 664.84, "end": 666.84, "text": "Schauen wir doch mal"}, {"id": 136, "start": 668.68, "end": 675.72, "text": "Schauen wir doch mal kurz schnell ob leute bilder gepostet haben ich habe ein paar bilder gepostet die sind jetzt aber nicht so wahnsinnig"}, {"id": 137, "start": 675.72, "end": 684.04, "text": "Spannend also das konzert war tatsächlich ziemlich nice es waren drei bands also insgesamt war es halt wirklich"}, {"id": 138, "start": 684.6, "end": 686.6, "text": "doch gar nicht schlecht was man fürs"}, {"id": 139, "start": 686.92, "end": 691.24, "text": "Ne iron maiden oder es heißt eigentlich nicht iron es heißt iron maiden"}, {"id": 140, "start": 692.04, "end": 698.76, "text": "Weil irgendwie außer den englern dann keiner check dass man das ehrlich ausspricht und jeder sagt iron und ich auch"}, {"id": 141, "start": 698.76, "end": 705.64, "text": "Aber ich weiß es eigentlich alter twitter hör doch mal auf mich abzufacken hier geh mal fort"}, {"id": 142, "start": 706.52, "end": 710.2, "text": "Und ich will muss ich wieder zu nitter ja weil sonst hätte funktioniert"}, {"id": 143, "start": 711.72, "end": 713.72, "text": "Gut"}, {"id": 144, "start": 718.6, "end": 721.72, "text": "Ja also also bei mir ist es eher so"}, {"id": 145, "start": 721.72, "end": 728.84, "text": "Ich habe so ein bisschen das gefühl was man hat hat normalerweise wenn man wenn man eine normale erkältung kriegt aber halt"}, {"id": 146, "start": 729.32, "end": 731.8, "text": "nicht so nicht so an einer stelle"}, {"id": 147, "start": 736.76, "end": 743.88, "text": "Er kratzen kratzen habe ich auch genau es ist halt nicht an einer stelle sondern es ist so komplett von links nach rechts durch den hals was bei normaler erkältung"}, {"id": 148, "start": 743.88, "end": 753.64, "text": "Bei mir nicht so ist na gut zumindest also mal gucken ob leute ein paar ordentliche bilder gepostet haben an nitter kackt wieder ab na wunderbar"}, {"id": 149, "start": 754.6, "end": 762.84, "text": "Also man hat man hat tatsächlich relativ viel fürs geld bekommen also das ticket hat glaube 95 euro oder so gekostet so plus minus ich weiß nicht genau"}, {"id": 150, "start": 763.56, "end": 765.56, "text": "95 euro"}, {"id": 151, "start": 766.04, "end": 769.32, "text": "Also ich habe mir ein paar bilder gepostet, also ich habe mir ein paar bilder gepostet"}, {"id": 152, "start": 769.32, "end": 778.2, "text": "So plus minus weiß nicht genau 95 euro man konnte 5 45 das ist aber total sinnlos"}, {"id": 153, "start": 782.6, "end": 788.44, "text": "15 45 viel zu früh das ist für die ganzen hardcore fans die vorne der ersten reihe stehen wollen das muss nicht sein"}, {"id": 154, "start": 789.08, "end": 794.2, "text": "Also du konntest 15 45 rein wir waren irgendwie 16 uhr 30 oder so da"}, {"id": 155, "start": 794.2, "end": 798.92, "text": "Dann gab es erst airborne und dann gab es power wolf power wolf war richtig nice"}, {"id": 156, "start": 801.4, "end": 805.48, "text": "Ja und als es dann dunkel wurde hat ein maiden angefangen man muss halt sagen"}, {"id": 157, "start": 806.12, "end": 808.6, "text": "schau technisch war wirklich extrem nice"}, {"id": 158, "start": 809.24, "end": 815.24, "text": "Ich meine ich meine man erkennt sie ein bisschen ja man ich habe jetzt das ist nur ein iphone foto das ist nicht die krasseste auflösung oder so"}, {"id": 159, "start": 815.8, "end": 819.08, "text": "Aber ich glaube man erkennt man erkennt es halbwegs also die haben was"}, {"id": 160, "start": 819.08, "end": 824.68, "text": "Bühnentechnik angeht schon da alles an register gezogen ja also sie hatten zig"}, {"id": 161, "start": 825.4, "end": 828.28, "text": "Das war nicht aufgeblasen es waren wirklich irgendwelche gebauten"}, {"id": 162, "start": 829.56, "end": 835.88, "text": "Dinger von flugzeugen bis hier so so köpfe oder alles mögliche hatten die am start auf der bühne"}, {"id": 163, "start": 836.84, "end": 839.88, "text": "Von feuerwerk bis feuer alles dabei ja"}, {"id": 164, "start": 841.0, "end": 845.96, "text": "Man muss sagen für das dass das richtig alte säcke sind ich meine im endes im durchschnitt glaube ich"}, {"id": 165, "start": 845.96, "end": 852.92, "text": "65 oder so also wenn einer zu mir noch mal boomer sagt da stehen die richtigen boomer auf der aus auf der auf der bühne ja"}, {"id": 166, "start": 855.4, "end": 861.72, "text": "Ja der ist noch am start ist glaube ich der älteste der ist glaube ich schon 70 also im durchschnitt sind die glaube ich 65 66 oder so"}, {"id": 167, "start": 862.04, "end": 867.96, "text": "Also sie sind richtig alt man muss sagen also für den irgendwie 65 jährigen hat er ganz schön"}, {"id": 168, "start": 868.52, "end": 870.52, "text": "kilometer gemacht auf der bühne ja"}, {"id": 169, "start": 871.08, "end": 873.08, "text": "beim rumrennen"}, {"id": 170, "start": 873.08, "end": 876.76, "text": "So zumindest die soundqualität war halt naja"}, {"id": 171, "start": 878.36, "end": 883.24, "text": "Ich hab gehofft hat noch in dem ein anderes paar bilder gepostet also die soundqualität war richtig mies"}, {"id": 172, "start": 883.8, "end": 888.36, "text": "Nicht ganz so beschissen wie in der festhalle vor ein paar jahren da waren ja auch schon mal"}, {"id": 173, "start": 889.56, "end": 895.64, "text": "Aber total übersteuert und hättest du die texte nicht gekannt hättest du eigentlich nix"}, {"id": 174, "start": 896.44, "end": 898.44, "text": "mitbekommen"}, {"id": 175, "start": 898.44, "end": 902.68, "text": "Also der sound war wirklich kacke ich"}, {"id": 176, "start": 903.0, "end": 907.0, "text": "Ich weiß nicht ich weiß nicht was die in frankfurt machen"}, {"id": 177, "start": 907.56, "end": 913.64, "text": "Aber ich würde eigentlich von ausgehen dass das konzertechnisch in einem stadion doch mehr her machen sollte"}, {"id": 178, "start": 915.16, "end": 920.28, "text": "Als also naja ansonsten war wirklich sehr nice"}, {"id": 179, "start": 922.6, "end": 924.6, "text": "Sound war nicht so schlecht"}, {"id": 180, "start": 924.6, "end": 929.0, "text": "Aber wirklich sehr nice sound war naja also"}, {"id": 181, "start": 929.96, "end": 933.16, "text": "Die haben sich wirklich mühe gegeben die show an sich war auch gut"}, {"id": 182, "start": 933.8, "end": 937.4, "text": "Preis leistungsmäßig kannst du mit drei bands auch nicht weckern"}, {"id": 183, "start": 937.8, "end": 943.16, "text": "Powerwolf war richtig lang da und die würde ich mir auch so angucken also allein im konzert"}, {"id": 184, "start": 945.08, "end": 949.4, "text": "90 euro paar 90 euro das geht jetzt ging schon in ordnung ich mein du hattest"}, {"id": 185, "start": 950.12, "end": 952.84, "text": "von 17 uhr 17 uhr 45 bis"}, {"id": 186, "start": 952.84, "end": 954.84, "text": "22 uhr 45"}, {"id": 187, "start": 955.24, "end": 957.56, "text": "da entertainment ja das passt schon"}, {"id": 188, "start": 959.16, "end": 961.16, "text": "ne ne"}, {"id": 189, "start": 961.16, "end": 963.16, "text": "nix"}, {"id": 190, "start": 964.36, "end": 966.36, "text": "Das war ja auch kein festival"}, {"id": 191, "start": 968.68, "end": 970.68, "text": "Tja"}, {"id": 192, "start": 971.32, "end": 977.0, "text": "So sieht es aus und wie gesagt wahrscheinlich komme ich jetzt um corona nicht rum"}, {"id": 193, "start": 977.64, "end": 980.76, "text": "Ich hoffe ja immer noch dass es normale erkältung und gut ist"}, {"id": 194, "start": 980.76, "end": 982.76, "text": "Das ist richtig ja"}, {"id": 195, "start": 985.48, "end": 987.48, "text": "Aber ansonsten"}, {"id": 196, "start": 988.52, "end": 994.6, "text": "Ich habe wie gesagt ich hoffe es ist eine normale erkältung aber ich ich fürchte ich bin jetzt auch mal dran mit corona"}, {"id": 197, "start": 996.04, "end": 1000.76, "text": "Hast du das schon mit archen massenhaft fehlerhaften gpg näher mich nicht mitbekommen was war denn da"}, {"id": 198, "start": 1002.04, "end": 1004.04, "text": "Arsch"}, {"id": 199, "start": 1004.6, "end": 1006.6, "text": "Ne das heißt"}, {"id": 200, "start": 1006.6, "end": 1012.92, "text": "nicht gpg pgp heißt das oder soll ich wirklich nach gpg suchen"}, {"id": 201, "start": 1015.72, "end": 1017.72, "text": "Was ist da was ist da passiert"}, {"id": 202, "start": 1024.52, "end": 1027.08, "text": "Arsch linux da ist der fehler"}, {"id": 203, "start": 1027.08, "end": 1032.44, "text": "Arsch linux da ist der fehler"}, {"id": 204, "start": 1039.0, "end": 1041.0, "text": "Was ist das"}, {"id": 205, "start": 1046.28, "end": 1048.28, "text": "Nö"}, {"id": 206, "start": 1048.28, "end": 1051.64, "text": "Ich habe doch erst gestern oder so"}, {"id": 207, "start": 1052.28, "end": 1054.28, "text": "Update gemacht"}, {"id": 208, "start": 1054.28, "end": 1059.88, "text": "Ach moment ich habe ja man jaro by the way ich darf ja gar nicht arch by the way by the way in by the way"}, {"id": 209, "start": 1061.08, "end": 1063.08, "text": "weil es ist ja nur arch und kein"}, {"id": 210, "start": 1063.16, "end": 1065.16, "text": "Ist ja nur arch und kein"}, {"id": 211, "start": 1065.88, "end": 1067.88, "text": "Arsch linux"}, {"id": 212, "start": 1069.08, "end": 1071.08, "text": "Ich habe doch erst gestern oder so"}, {"id": 213, "start": 1071.08, "end": 1077.16, "text": "Ich habe ja gar nicht arch by the way by the way in by the way"}, {"id": 214, "start": 1077.88, "end": 1083.56, "text": "Weil es ist ja nur arch und kein ist ja nur man jaro und kein arch dann habe ich den fehler wahrscheinlich nicht"}, {"id": 215, "start": 1085.08, "end": 1087.08, "text": "Dann habe ich den fehler wahrscheinlich nicht"}, {"id": 216, "start": 1087.4, "end": 1093.24, "text": "Ich habe dann arch linux hier installiert das probieren wir probieren das jetzt mal aus ich habe ja sonst nichts großartiges geplant"}, {"id": 217, "start": 1093.4, "end": 1097.64, "text": "Also leute das ist der titel ist programm wir schwätzen ein bisschen was gucken uns ein paar videos an"}, {"id": 218, "start": 1097.64, "end": 1100.92, "text": "Dass das machen kann wie gesagt mir tut der hals weh und"}, {"id": 219, "start": 1102.28, "end": 1106.04, "text": "Nachher noch mal fieber messen morgen mache ich also ich weiß nicht morgen ist ja freitag"}, {"id": 220, "start": 1106.92, "end": 1110.2, "text": "Wahrscheinlich mache ich den koron ich habe nämlich nur noch zwei koronatests hier"}, {"id": 221, "start": 1112.52, "end": 1114.52, "text": "Wahrscheinlich mache ich den"}, {"id": 222, "start": 1115.96, "end": 1122.12, "text": "Test samstag dann ist lang genug zeit und dann sollte das anschlagen wenn was ist"}, {"id": 223, "start": 1122.12, "end": 1127.32, "text": "Eigentlich habe ich ja gesagt ich komme morgen auf die arbeit aber ich glaube das lasse ich besser sein was mir"}, {"id": 224, "start": 1127.72, "end": 1130.12, "text": "Natürlich als homeoffice fern entgegenkommt"}, {"id": 225, "start": 1131.88, "end": 1138.44, "text": "Aber ich glaube in dem fall sind alle anderen auch der meinung es ist keine so gute idee mit coronasymptomen auf die arbeit zu fahren"}, {"id": 226, "start": 1141.8, "end": 1146.2, "text": "Nö also wenn das so bleibt templo ist das habe ich schon auf das gucken wir uns gleich an"}, {"id": 227, "start": 1146.2, "end": 1153.0, "text": "Nö, also wenn das so bleibt templo ist das habe ich schon auf das gucken wir uns gleich an also wenn das so bleibt mit dem hals und so"}, {"id": 228, "start": 1153.56, "end": 1157.56, "text": "Also solange es wirklich nur mal ein bisschen husten hals und und bisschen bisschen"}, {"id": 229, "start": 1158.36, "end": 1160.36, "text": "hot"}, {"id": 230, "start": 1160.36, "end": 1162.36, "text": "man's not hot bleibt"}, {"id": 231, "start": 1163.96, "end": 1167.16, "text": "Tja mal gucken mal gucken wie es heute nacht ist ja mal gespannt"}, {"id": 232, "start": 1170.04, "end": 1174.92, "text": "So zeit lasst mal kurz checken was was machen die updates hier pacman also besser"}, {"id": 233, "start": 1174.92, "end": 1181.72, "text": "Pacman also bestes ab beste update befähle übrigens wer der meinung ist dass ein system nicht updater soll es mal damit probieren"}, {"id": 234, "start": 1185.48, "end": 1187.48, "text": "Ok man jaro updated alles klar"}, {"id": 235, "start": 1187.48, "end": 1200.2, "text": "Ja dann machen wir mal arch by the way an und gucken ob das updatert jetzt werden wir jetzt ja gleich sehen"}, {"id": 236, "start": 1205.4, "end": 1207.4, "text": "Jetzt werden wir jetzt ja gleich sehen"}, {"id": 237, "start": 1207.4, "end": 1221.4, "text": "Das werden wir jetzt ja gleich sehen ob das funktioniert so pacman alter ich kann ja mal tippen"}, {"id": 238, "start": 1221.4, "end": 1240.2, "text": "Pacman, alter ich kann ja nicht mehr tippen, äh, ne, einfach nur so ne, ja, so, funktioniert"}, {"id": 239, "start": 1240.2, "end": 1249.88, "text": "auch alles, Arch by the way, by the way funktioniert by the way, nicht?"}, {"id": 240, "start": 1249.88, "end": 1256.0, "text": "Ah, das kommt, wenn er die Keys überprüft, danach erst oder was, der downloadet, der"}, {"id": 241, "start": 1256.0, "end": 1260.0, "text": "downloadet, ok, Sekunde, das Downloaden dauert ein bisschen zu langsam, äh, dauert ein bisschen"}, {"id": 242, "start": 1260.0, "end": 1267.64, "text": "zu lang, äh, wo schaltet man, wo schaltet man parallele Downloads nochmal ein, das ist"}, {"id": 243, "start": 1267.64, "end": 1280.68, "text": "doch hier irgendwo, hier, bam, jetzt, alter, ich hoffe der Stream kackt nicht ab dabei,"}, {"id": 244, "start": 1280.68, "end": 1308.16, "text": "ok, Leute, schauen, schauen ob es laggt, ah ne, laggt nix, dann schauen wir mal, einfach"}, {"id": 245, "start": 1308.16, "end": 1316.52, "text": "mit Reflector den schnellsten Server suchen, was ist denn Reflector, stell dir vor du hast"}, {"id": 246, "start": 1316.52, "end": 1320.96, "text": "bei der Bahn Vorstellungsgespräche und musst mit der Bahn fahren, da stell ich mir, hab"}, {"id": 247, "start": 1320.96, "end": 1327.6, "text": "ich ne gute Ausrede, so, und jetzt, yes, und jetzt kackt er wahrscheinlich ab, vermute"}, {"id": 248, "start": 1327.6, "end": 1347.72, "text": "ich mal, ah, Signature von David Runge ist Marginal Trust, oh oh, oh oh, Kacke, ok, ich"}, {"id": 249, "start": 1347.72, "end": 1356.12, "text": "brech mal ab, ja, na dann, Arch, by the way, das ist das erste Mal, das so richtig, richtig"}, {"id": 250, "start": 1356.12, "end": 1361.0, "text": "Update kaputt ist, was ich mitbekommen hab, zeig doch mal kurz her, was schreiben, was"}, {"id": 251, "start": 1361.0, "end": 1368.48, "text": "schreiben denn die, die Arch, by the way, Leute, außer dass sie Arch verwenden, es gibt"}, {"id": 252, "start": 1368.48, "end": 1373.84, "text": "ein Fix, das werden wir jetzt gleich sehen, ich wollte das zwar, oh, Moment, Moment, Sekunde,"}, {"id": 253, "start": 1373.84, "end": 1381.0, "text": "Zack, Zack, Dark Reader, wobei, hatte Github nicht selber nen Dark Mode, wo macht man den"}, {"id": 254, "start": 1381.0, "end": 1386.44, "text": "Github an, geht das auch ohne, dass man eingeloggt ist, Leute, kann man in Dark Mode den Github"}, {"id": 255, "start": 1386.44, "end": 1405.56, "text": "anmachen, ohne dass man eingeloggt ist, ne, ne, das ist der richtige Dark Reader, ne, Dark"}, {"id": 256, "start": 1405.56, "end": 1420.64, "text": "Reader, Dark, Dark Reader, das ist das richtige, excellent, ok, ok, gut, also, warum geht das"}, {"id": 257, "start": 1420.64, "end": 1446.48, "text": "nicht, was, GPG, müsste das nicht PGP heilen, Kno, PG löschen, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 258, "start": 1446.48, "end": 1461.48, "text": "ok, probieren wir mal aus, ob das funktioniert, muss man das alles gut machen, wahrscheinlich,"}, {"id": 259, "start": 1461.48, "end": 1468.64, "text": "Jawoll, jawoll, jawoll, jawoll."}, {"id": 260, "start": 1468.64, "end": 1478.8, "text": "Ach, not to be confused with pretty good privacy."}, {"id": 261, "start": 1478.8, "end": 1479.8, "text": "Aha, okay."}, {"id": 262, "start": 1479.8, "end": 1483.16, "text": "Aber ich hab's, ich hab's gerade confused damit."}, {"id": 263, "start": 1483.16, "end": 1496.96, "text": "So, und jetzt, und jetzt geht's, oder wie?"}, {"id": 264, "start": 1496.96, "end": 1497.96, "text": "Yes."}, {"id": 265, "start": 1497.96, "end": 1498.96, "text": "Fastchamp."}, {"id": 266, "start": 1498.96, "end": 1499.96, "text": "Nope."}, {"id": 267, "start": 1499.96, "end": 1516.92, "text": "Funktioniert nicht."}, {"id": 268, "start": 1516.92, "end": 1517.92, "text": "Sprocken."}, {"id": 269, "start": 1517.92, "end": 1518.92, "text": "Kacke."}, {"id": 270, "start": 1518.92, "end": 1527.6, "text": "Also, das war auf jeden Fall nicht der Flick."}, {"id": 271, "start": 1527.6, "end": 1531.6, "text": "Was soll ich machen, was ihr da gepostet habt?"}, {"id": 272, "start": 1531.6, "end": 1532.6, "text": "Okay."}, {"id": 273, "start": 1532.6, "end": 1533.6, "text": "Okay."}, {"id": 274, "start": 1533.6, "end": 1534.6, "text": "Okay."}, {"id": 275, "start": 1534.6, "end": 1536.0, "text": "Chat, wenn ihr das sagt."}, {"id": 276, "start": 1536.0, "end": 1541.48, "text": "Chat ist high IQ, der weiß sowas."}, {"id": 277, "start": 1541.48, "end": 1545.04, "text": "Ich truste, ich truste dem Chat, Leute."}, {"id": 278, "start": 1545.04, "end": 1546.04, "text": "Massive Chat-Trust."}, {"id": 279, "start": 1546.04, "end": 1547.04, "text": "Funktioniert nicht."}, {"id": 280, "start": 1547.04, "end": 1553.44, "text": "Nee, nee, man, Jaro funktioniert, gar kein Problem."}, {"id": 281, "start": 1553.44, "end": 1568.64, "text": "Okay, Leute."}, {"id": 282, "start": 1568.64, "end": 1569.64, "text": "Was wie nur Keering."}, {"id": 283, "start": 1569.64, "end": 1578.92, "text": "Wo hab ich nicht mehr reingeschaut?"}, {"id": 284, "start": 1578.92, "end": 1581.68, "text": "Ach so, beim, bei..."}, {"id": 285, "start": 1581.68, "end": 1585.04, "text": "Nee, doch, man, Jaro hat funktioniert, du hab kein Problem."}, {"id": 286, "start": 1585.04, "end": 1590.92, "text": "Ach so, hab ich alles geupgraded?"}, {"id": 287, "start": 1590.92, "end": 1596.72, "text": "Ach so, yes."}, {"id": 288, "start": 1596.72, "end": 1602.28, "text": "Und jetzt, und jetzt darf ich alles machen."}, {"id": 289, "start": 1602.28, "end": 1617.64, "text": "Aha, aha, aha."}, {"id": 290, "start": 1617.64, "end": 1621.16, "text": "Das funktioniert jetzt, easy."}, {"id": 291, "start": 1621.16, "end": 1626.16, "text": "Wieder was gelernt, Chat."}, {"id": 292, "start": 1626.16, "end": 1634.04, "text": "Easy, easy, easy, easy as fuck, nice, nice, nice."}, {"id": 293, "start": 1634.04, "end": 1637.0, "text": "Chat ist richtig high IQ heute wieder."}, {"id": 294, "start": 1637.0, "end": 1640.92, "text": "Gut, hätten wir das auch geregelt, wollte ich jetzt zwar gar nicht machen, aber gut"}, {"id": 295, "start": 1640.92, "end": 1645.92, "text": "zu wissen."}, {"id": 296, "start": 1645.92, "end": 1649.92, "text": "Welche Version von Forever Workstation hast du?"}, {"id": 297, "start": 1649.92, "end": 1650.92, "text": "Forever Workstation."}, {"id": 298, "start": 1650.92, "end": 1653.92, "text": "Ach so."}, {"id": 299, "start": 1653.92, "end": 1662.48, "text": "Forever Workstation, ich weiß nicht, ob ich die Lizenz zeigen kann, ob, lieber nicht."}, {"id": 300, "start": 1662.48, "end": 1665.48, "text": "Wer weiß."}, {"id": 301, "start": 1665.48, "end": 1670.28, "text": "Das ist, ja, aber es ist nicht Player, es ist, es ist das normale."}, {"id": 302, "start": 1670.28, "end": 1673.48, "text": "Weiß nicht, warum man sich Player kaufen sollte."}, {"id": 303, "start": 1673.48, "end": 1681.92, "text": "Kriegste aber auch beim Keyshop für ein Apple und ein i."}, {"id": 304, "start": 1681.92, "end": 1694.36, "text": "Ja, ich glaub, dass ich Corona hab."}, {"id": 305, "start": 1694.36, "end": 1707.96, "text": "Nee, also noch, noch ist mit Nase laufen nicht so viel."}, {"id": 306, "start": 1707.96, "end": 1720.24, "text": "Welche Text-to-Speech-Engine ich verwende?"}, {"id": 307, "start": 1720.24, "end": 1732.84, "text": "Gar keine, ich verwende einen, du meinst für solche Sachen wie das hier, oder, oder"}, {"id": 308, "start": 1732.84, "end": 1733.84, "text": "auch."}, {"id": 309, "start": 1733.84, "end": 1741.12, "text": "Das ist ein koreanischer Text-to-Speech-Service, wo ich mir irgendwann mal ein API-Key generiert"}, {"id": 310, "start": 1741.12, "end": 1742.12, "text": "hab."}, {"id": 311, "start": 1742.12, "end": 1749.44, "text": "Und über die API ich den was sagen lasse und dann als MP3 runterlade."}, {"id": 312, "start": 1749.44, "end": 1757.88, "text": "Ja, der kann zum, der kann auch noch mehr, also man kann den als Text-to-Speech ein bisschen"}, {"id": 313, "start": 1757.88, "end": 1758.88, "text": "zweckempfremden."}, {"id": 314, "start": 1758.88, "end": 1770.2, "text": "Ich kann jetzt zum Beispiel hier was reinschreiben, zum Beispiel Kekke, Weep und jetzt sollte er"}, {"id": 315, "start": 1770.2, "end": 1771.56, "text": "eigentlich was vorlesen."}, {"id": 316, "start": 1771.56, "end": 1791.04, "text": "Achso, Moment, was?"}, {"id": 317, "start": 1791.04, "end": 1809.76, "text": "Nein, das, das funktioniert nicht so wirklich."}, {"id": 318, "start": 1809.76, "end": 1821.68, "text": "Okay, das funktioniert so schon mal nicht anscheinend."}, {"id": 319, "start": 1821.68, "end": 1825.56, "text": "Ja, also man kann den auch was anderes sagen lassen."}, {"id": 320, "start": 1825.56, "end": 1851.28, "text": "Das ist sogar richtig gut, das finde ich gut, das muss ich hinzufügen, Alter."}, {"id": 321, "start": 1851.28, "end": 1866.16, "text": "Nice, ja, entdeckt man immer neue Sachen."}, {"id": 322, "start": 1866.16, "end": 1874.72, "text": "Was ist denn das längste deutsche Wort?"}, {"id": 323, "start": 1874.72, "end": 1879.52, "text": "Du kannst im Deutschen theoretisch nahezu beliebig lange Wörter generieren."}, {"id": 324, "start": 1879.52, "end": 1886.84, "text": "Ja, du kannst hier, du kannst so viele, du kannst total viele Wörter im Deutsch machen,"}, {"id": 325, "start": 1886.84, "end": 1887.84, "text": "die noch länger sind."}, {"id": 326, "start": 1887.84, "end": 1903.24, "text": "Okay, weil, weil, weil ihr seid, Chat."}, {"id": 327, "start": 1903.24, "end": 1925.88, "text": "Okay, logisch, obviously."}, {"id": 328, "start": 1925.88, "end": 1945.68, "text": "Das hört sich tatsächlich an, als wäre es irgendein, aus irgendeinem, irgendwas koreanischem,"}, {"id": 329, "start": 1945.68, "end": 1946.68, "text": "ja."}, {"id": 330, "start": 1946.68, "end": 1947.68, "text": "Nee, ja."}, {"id": 331, "start": 1947.68, "end": 1948.68, "text": "Nee, koreanisch."}, {"id": 332, "start": 1948.68, "end": 1949.68, "text": "Koreanisch war das glaube ich sogar."}, {"id": 333, "start": 1949.68, "end": 1950.68, "text": "Oder war das?"}, {"id": 334, "start": 1950.68, "end": 1955.68, "text": "Nee, ich glaube, das war sogar ein koreanischer."}, {"id": 335, "start": 1955.68, "end": 1972.52, "text": "Ja, ich glaube, das war ein koreanischer, ja, ich glaube, das war ein koreanischer,"}, {"id": 336, "start": 1972.52, "end": 1973.52, "text": "ja."}, {"id": 337, "start": 1973.52, "end": 1995.98, "text": "Ja, ich glaube, das war ein koreanischer, ja, ich glaube, das war ein koreanischer,"}, {"id": 338, "start": 1995.98, "end": 1996.98, "text": "ja."}, {"id": 339, "start": 1996.98, "end": 1997.98, "text": "Ja."}, {"id": 340, "start": 1997.98, "end": 2023.92, "text": "sie ist sie funktioniert gut genug für mich ja der"}, {"id": 341, "start": 2023.92, "end": 2031.62, "text": "der etiketten champ muss auch mal fertig werden der label champ"}, {"id": 342, "start": 2031.62, "end": 2044.1, "text": "nee ich habe das absichtlich nicht mit dem stream deck gemacht weil ich will sie beim browser"}, {"id": 343, "start": 2044.1, "end": 2049.58, "text": "bedienen vom zweiten rechner und ich will ja die bilder selbst sehen bei mir ist es ja so das ist"}, {"id": 344, "start": 2049.58, "end": 2059.02, "text": "nicht eine obs geschichte sondern wirklich ich sehe die bilder selbst noch ist es ja nicht raus"}, {"id": 345, "start": 2059.02, "end": 2065.62, "text": "ob es wirklich korona ist ich hoffe ja nicht ja ihr müsst euch jetzt auch alle testen lassen"}, {"id": 346, "start": 2065.62, "end": 2071.38, "text": "kommt drauf an für was pauschal kann man das überhaupt nicht sagen"}, {"id": 347, "start": 2071.38, "end": 2092.34, "text": "dazu kann ich bloß sagen ja war er plötzlich ist klar habe ich monka w überhaupt aktiviert"}, {"id": 348, "start": 2092.34, "end": 2099.3, "text": "leute monka wie habe ich glaube ich gar nicht hauptsache hauptsache wir haben monka w als als"}, {"id": 349, "start": 2099.3, "end": 2106.1, "text": "text to speech weil ich habe monka w nicht aktiviert weil wir haben schon total viele"}, {"id": 350, "start": 2106.1, "end": 2112.7, "text": "monka emotes und ich mag monka w eigentlich gar nicht ich habe das jetzt bloß reingemacht"}, {"id": 351, "start": 2112.7, "end": 2130.18, "text": "weil sich lustig anhört was mir gerade einfällt ich habe auf der arbeit einen aus versehen voll"}, {"id": 352, "start": 2130.18, "end": 2134.94, "text": "verwirrt der ist zu mir ein rechner ich weiß ich weiß nicht wie ich drauf komme leute jetzt"}, {"id": 353, "start": 2134.94, "end": 2147.02, "text": "der ist zu mir ein rechner gekommen hinter also ein platz und meinte irgendwie lasst mal das und das gucken ist auch egal es geht überhaupt nicht darum und"}, {"id": 354, "start": 2147.02, "end": 2153.46, "text": "aber sind ja moment ich muss mal ein paar sachen zumachen ich hatte irgendwie 1000 tabs auf dann"}, {"id": 355, "start": 2153.46, "end": 2159.9, "text": "habe ich meine tabs zugeklickt und auf einmal hat man ganz kurz bevor jetzt einer was sagt"}, {"id": 356, "start": 2159.9, "end": 2165.9, "text": "ihr müsst warten bis ich fertig erzählt habe und in einem der tabs hat man ganz kurz erkannt"}, {"id": 357, "start": 2165.9, "end": 2172.78, "text": "porn und ich habe die tabs ganz schnell zugemacht und da meint er max max was war das was war das"}, {"id": 358, "start": 2172.78, "end": 2179.18, "text": "porn porn was was ist da oder habe ich dann die tabs wieder aufgemacht irgendwie 50 tabs oder so"}, {"id": 359, "start": 2179.18, "end": 2189.42, "text": "habe ich wieder aufgemacht um den zu zeigen um ihm zu zeigen dass es unix porn war ein"}, {"id": 360, "start": 2189.42, "end": 2200.58, "text": "sub reddit wo die leute ihre gestalten linux desktops zeigen und der kerl hat halt nur ja reddit reddit"}, {"id": 361, "start": 2200.58, "end": 2223.1, "text": "please high speed reddit ist reddit down er scheint jetzt zu gehen so und jetzt stellt"}, {"id": 362, "start": 2223.1, "end": 2228.22, "text": "euch mal vor es macht jemand ganz schnell ganz schnell die sachen zu und ihr habt ihr"}, {"id": 363, "start": 2228.22, "end": 2233.46, "text": "bloß kurz gesehen die überschrift dann kann es schon ein bisschen verwirren ja gebe ich zu"}, {"id": 364, "start": 2233.46, "end": 2251.1, "text": "nicht dass er das so schnell da oben adressleiste erkannt hat sind das hier"}, {"id": 365, "start": 2251.1, "end": 2267.38, "text": "wiebdiskussion im chat sehe ich das richtig chat in oder out heute in oder out"}, {"id": 366, "start": 2267.38, "end": 2289.7, "text": "die lemmas sind am start ja tja ok arch by the way hat funktioniert update alles klar nice"}, {"id": 367, "start": 2289.7, "end": 2307.1, "text": "kann man da dazu kann man bloß sagen easy und was mache ich denn j darf sich selber"}, {"id": 368, "start": 2307.1, "end": 2324.94, "text": "update wunderbar was ist das für ein arch arch ganz normales klassisches arch by the way mehr"}, {"id": 369, "start": 2324.94, "end": 2349.1, "text": "arch geht nicht marie buten na gut pc speaker ist an by the way arch by the way muss ich"}, {"id": 370, "start": 2349.1, "end": 2358.46, "text": "by the way mal ausschalten weil ich brauche es gerade überhaupt nicht alles klar doch"}, {"id": 371, "start": 2358.46, "end": 2363.42, "text": "das wird aber die neue stream vm wenn wir die irgendwann mal fertig eingerichtet haben"}, {"id": 372, "start": 2363.42, "end": 2374.86, "text": "solange bleibt die alte noch da ja weil ich original by the way arch haben will mach gar"}, {"id": 373, "start": 2374.86, "end": 2381.26, "text": "nix das gibt halt gar kein stream nee irgendjemand im chat hat geschrieben dass angeblich arch"}, {"id": 374, "start": 2381.26, "end": 2390.3, "text": "repo updates nicht mehr funktionieren das mussten gerade ausprobieren ansonsten habe"}, {"id": 375, "start": 2390.3, "end": 2395.14, "text": "ich nix habe ich nix geplant muss ich aber doch noch was sagen wisst ihr was mich auf"}, {"id": 376, "start": 2395.14, "end": 2403.7, "text": "diesem konzert übelst genervt hat nee ich habe schon längst entsorgt achso nee die"}, {"id": 377, "start": 2403.7, "end": 2407.42, "text": "die ich angefangen habe das ist die hier die ich die ganze zeit verwende die ist die"}, {"id": 378, "start": 2407.42, "end": 2418.1, "text": "progress vm also eine sache also eine sache sag ich gleich was zu dem anderen also eine"}, {"id": 379, "start": 2418.1, "end": 2423.58, "text": "sache die mir wirklich auf den keks gegangen ist bei dem konzert ist also mit dem sound"}, {"id": 380, "start": 2423.58, "end": 2431.14, "text": "habe ich mich ja schon drüber aufgeregt nee über händis auch nicht über händis gar"}, {"id": 381, "start": 2431.14, "end": 2441.58, "text": "nicht so sehr über diese völkerwanderung die bei manchen leuten abging ich muss mich"}, {"id": 382, "start": 2441.58, "end": 2450.66, "text": "teilweise fünf mal in der minute sind das leute an mir vorbeigelaufen die sind permanent"}, {"id": 383, "start": 2450.66, "end": 2456.74, "text": "rein raus hochgelaufen runtergelaufen während die bands gespielt haben obwohl ich mir so"}, {"id": 384, "start": 2456.74, "end": 2466.38, "text": "denke warum seid ihr eigentlich hier also was macht ihr eigentlich hier die sind die"}, {"id": 385, "start": 2466.38, "end": 2477.34, "text": "sind die hyper agile ja aber was cool war es war wirklich komplettes so treffen der generation"}, {"id": 386, "start": 2477.34, "end": 2482.22, "text": "nee du musst nicht zum dixie klo das ist mitten im waldsteb deutscher bankpark früher ist"}, {"id": 387, "start": 2482.22, "end": 2491.22, "text": "immer waldstadion da ist der klo ist alles da und das war wirklich cool das war wirklich"}, {"id": 388, "start": 2491.22, "end": 2496.74, "text": "treffen treffen der generation du hattest da welche keine ahnung die waren 12 eltern"}, {"id": 389, "start": 2496.74, "end": 2506.66, "text": "da großeltern da von 12 bis an die 80 war da alles da die meisten waren so in meinem"}, {"id": 390, "start": 2506.66, "end": 2512.62, "text": "alter würde ich sagen ja mir sind das normalerweise auch zu viele menschen aber ab und zu geht"}, {"id": 391, "start": 2512.62, "end": 2523.74, "text": "das mal das nächste mal ist dann wieder im november ich glaube am 25 november in der"}, {"id": 392, "start": 2523.74, "end": 2536.02, "text": "jahrhunderthalle gibt es jetztlichen powermette die sind aber wirklich nice und was ich leider"}, {"id": 393, "start": 2536.02, "end": 2565.86, "text": "wo ich leider verpasst habe ist moment ich dachte das dachte das war schon"}, {"id": 394, "start": 2565.86, "end": 2573.54, "text": "okay nice bin ich auch am start was war das für ein desktop environment das war doch"}, {"id": 395, "start": 2573.54, "end": 2578.54, "text": "nicht die drei doch das ist die drei das hier ist die drei und das andere was du gesehen"}, {"id": 396, "start": 2578.54, "end": 2603.3, "text": "hast hier war auch e3 alles e3 also warum ich windows verwende und warum nicht linux"}, {"id": 397, "start": 2603.3, "end": 2611.94, "text": "also ich weiß nicht ob du mein letztes video gesehen hast da geht es ja um dieses thema"}, {"id": 398, "start": 2611.94, "end": 2619.58, "text": "unter anderem und ich brauche halt einige sachen die man am besten unter windows macht"}, {"id": 399, "start": 2619.58, "end": 2623.58, "text": "und ich mache aber auch viele sachen lieber unter linux so und nachdem ich die sachen"}, {"id": 400, "start": 2623.58, "end": 2628.58, "text": "die ich unter windows mache besser unter einem native windows machen kann nämlich zum beispiel"}, {"id": 401, "start": 2628.58, "end": 2640.46, "text": "spiele spielen alles unter einem virtualisierten windows habe ich so rum vm ist für mich performance"}, {"id": 402, "start": 2640.46, "end": 2647.34, "text": "technisch top überhaupt kein problem aber performance technisch spiele in der vm wäre"}, {"id": 403, "start": 2647.34, "end": 2653.34, "text": "nicht gut und jetzt kommt mir keiner mit gpu pass zu dann hast du wieder ganz andere probleme"}, {"id": 404, "start": 2653.34, "end": 2658.86, "text": "kann man alles machen schön in der benutzung ist es nicht so und ich mache es also ich"}, {"id": 405, "start": 2658.86, "end": 2663.38, "text": "mache streaming spiele videos video editieren und das zeug mache ich unter windows den rest"}, {"id": 406, "start": 2663.38, "end": 2668.22, "text": "mache ich unter linux in der vm das ist für mich die beste kombination vor allem ist es"}, {"id": 407, "start": 2668.22, "end": 2674.5, "text": "kein dual boot weil dual boot würde mich nerven zwischendurch ich werde beide systeme gleichzeitig"}, {"id": 408, "start": 2674.5, "end": 2687.18, "text": "haben die haben wenig gefilmt die waren einfach nur da und sind die ganze zeit rein und raus"}, {"id": 409, "start": 2687.18, "end": 2701.86, "text": "gelaufen was ist das besondere an i3 dass du keine fenster hast guck mal hier habe ich"}, {"id": 410, "start": 2701.86, "end": 2708.78, "text": "ein browser auf wenn ich jetzt ein terminal aufmache nimmt es die hälfte des platzes und"}, {"id": 411, "start": 2708.78, "end": 2713.38, "text": "wenn ich jetzt noch ein terminal aufmache nimmt es ein drittel des platzes ich kann"}, {"id": 412, "start": 2713.38, "end": 2718.54, "text": "es natürlich auch umschieben aber das soweit alles mit tastatur und du musst dich nicht"}, {"id": 413, "start": 2718.54, "end": 2723.86, "text": "mehr um fenster management kümmern es war am anfang ich gebe das zu das war am anfang"}, {"id": 414, "start": 2723.86, "end": 2729.26, "text": "schon gewöhnungsbedürftig sich an i3 zu gewöhnen vor allem mit mehreren desktops und sowas"}, {"id": 415, "start": 2729.26, "end": 2737.42, "text": "ja normalerweise habe ich es ja so ich habe hier eine idee auf hier habe ich ein terminal"}, {"id": 416, "start": 2737.42, "end": 2742.1, "text": "hier habe ich ein browser ich habe nur noch ich habe nur noch fullscreen man kann wenn"}, {"id": 417, "start": 2742.1, "end": 2752.3, "text": "man will wenn man will kann man fenster modus machen das habe ich dafür schiener chinesen"}, {"id": 418, "start": 2752.3, "end": 2760.46, "text": "den im hintergrund wallpaper jawohl beste ja da kann du kannst fenster machen und fenster"}, {"id": 419, "start": 2760.46, "end": 2768.18, "text": "hin und her schieben aber als kannst du machen ist aber reichlich sinnlos macht man eigentlich"}, {"id": 420, "start": 2768.18, "end": 2780.1, "text": "kaum besser alles den window manager teilen lassen so und du hast noch ein paar mehr funktionen"}, {"id": 421, "start": 2780.1, "end": 2784.5, "text": "du kannst zum beispiel was ich halt auch wirklich praktisch finde du kannst zum beispiel stelle"}, {"id": 422, "start": 2784.5, "end": 2790.54, "text": "mir vor du hast hier oben irgendwas wichtiges laufen ja du hast hier oben irgendwie deine"}, {"id": 423, "start": 2790.54, "end": 2795.7, "text": "deinen aktuellen stonksticker aber nur verkaufen muss oder was weiß ich also was hier oben"}, {"id": 424, "start": 2795.7, "end": 2801.54, "text": "irgendwas wichtiges laufen dann kannst du so sachen machen wie du drückst winstaste s"}, {"id": 425, "start": 2801.54, "end": 2805.94, "text": "und dann hast du über alle desktops selbst wenn du die desktops durchswitched hast du"}, {"id": 426, "start": 2805.94, "end": 2812.26, "text": "das sticky dieses eine fenster da oben also man kann schon coole sachen machen mit die"}, {"id": 427, "start": 2812.26, "end": 2822.38, "text": "drei ja oder zum beispiel stelle euch mal vor ihr guckt ein stream ihr guckt wo bloß"}, {"id": 428, "start": 2822.38, "end": 2838.38, "text": "oder was anders der chat chat ist ein besseres der chat ist ein besseres beispiel guckt mal"}, {"id": 429, "start": 2838.38, "end": 2861.9, "text": "also ihr habt den ihr habt den den den chat auf und dann könnt ihr theoretisch den chat"}, {"id": 430, "start": 2861.9, "end": 2867.18, "text": "irgendwo da oben hinschieben und dann sticky machen auf jedem desktop könnte man da hätte"}, {"id": 431, "start": 2867.18, "end": 2877.86, "text": "man dann den chat also man kann damit schon coole sachen machen du kannst auch einen"}, {"id": 432, "start": 2877.86, "end": 2884.54, "text": "tab layout machen oder einen stack layout aber ganz ehrlich ich brauche browser terminal"}, {"id": 433, "start": 2884.54, "end": 2893.86, "text": "editor ja manchmal 23 editor fenster fertig ja man kann wie gesagt das cool unter i3 ist"}, {"id": 434, "start": 2893.86, "end": 2903.06, "text": "halt dass man floating windows machen kann aber zum größten teil man sich damit gar"}, {"id": 435, "start": 2903.06, "end": 2909.82, "text": "nicht beschäftigen muss ja und was jetzt der bessere tiling window manager ist da gibt"}, {"id": 436, "start": 2909.82, "end": 2918.42, "text": "es ja immer große diskussionen manche sagen gar nicht mehr x sondern direkt wayland und"}, {"id": 437, "start": 2918.42, "end": 2925.26, "text": "sway andere sagen awesome wm andere sagen herbst luft wm was es wirklich gibt das hat"}, {"id": 438, "start": 2925.26, "end": 2933.02, "text": "wirklich ziemlich beknackten namen aber ok manche sagen dwm manche sagen bspwm wie man"}, {"id": 439, "start": 2933.02, "end": 2952.86, "text": "bspwm du fandest tutorial gut das von zwar von 2015 aber von den basics her passt das"}, {"id": 440, "start": 2952.86, "end": 2957.42, "text": "ohne probleme noch da hat sich nicht so viel dran getan ich meine das ist sehr minimalistisch"}, {"id": 441, "start": 2957.42, "end": 2964.98, "text": "was soll sich am windows teilen ändern in sieben jahren"}, {"id": 442, "start": 2964.98, "end": 2970.52, "text": "ascii aquarium ist selbstverständlich wichtig windows hast du die nix das geht ja ja das"}, {"id": 443, "start": 2970.52, "end": 2991.18, "text": "funktioniert ja man sieht man sieht es es kämpfte es kämpfte gar nicht ok ja also"}, {"id": 444, "start": 2991.18, "end": 2995.94, "text": "es funktioniert guckt also du kannst ich ich mache windows taster 123 um die des tops"}, {"id": 445, "start": 2995.94, "end": 3005.06, "text": "durch zu switchen reicht eine grafik gerade für alles noch naja ja aber ich würde jetzt"}, {"id": 446, "start": 3005.06, "end": 3010.74, "text": "schon eine neuere kaufen und ich will also weil irgendjemand mein pc gerade angezeigt"}, {"id": 447, "start": 3010.74, "end": 3015.9, "text": "hat ja den pc würde ich heute so nicht kaufen werden weil es irgendeiner auf die glorreiche"}, {"id": 448, "start": 3015.9, "end": 3021.14, "text": "idee kommt sagt ich will den pc kaufen wieder max den hat ne ne das würde ich auf gar keinen"}, {"id": 449, "start": 3021.14, "end": 3028.06, "text": "fall mehr so machen ich meine das ist schon ziemlich outdated das ist ein pc von 2017"}, {"id": 450, "start": 3028.06, "end": 3032.1, "text": "aber immer noch ziemlich gut das ist wisst ihr das ist ja also das was mich was mich"}, {"id": 451, "start": 3032.1, "end": 3037.42, "text": "total fertig macht dass ich irgendwie den fünfjahre PC verwenden kann so wie ein high"}, {"id": 452, "start": 3037.42, "end": 3044.78, "text": "end gerät und alles spielen kann also wie so wie ein high end gerät von damals 2005"}, {"id": 453, "start": 3044.78, "end": 3056.02, "text": "oder so ist wahnsinn also das tut sich nicht mehr so viel rap stimmt das gab es auch noch"}, {"id": 454, "start": 3056.02, "end": 3063.34, "text": "ja gut das ist ja nicht exklusiv ich verwende das ja auch ja ich weiß ich verwende ja auch"}, {"id": 455, "start": 3063.34, "end": 3070.86, "text": "t-max im terminal und entheilen window manager drum herum ja für die splits in dem fall"}, {"id": 456, "start": 3070.86, "end": 3075.82, "text": "beugt es nicht unbedingt aber gerade dass du kommandos im hintergrund laufen lassen"}, {"id": 457, "start": 3075.82, "end": 3080.58, "text": "kannst dass sie den copy buffer ordentlich durchsuchen kannst und so ähnlich den copy"}, {"id": 458, "start": 3080.58, "end": 3090.3, "text": "buffer den den scrollback buffer ordentlich durchsuchen kannst ist schon nicht verkehrt"}, {"id": 459, "start": 3090.3, "end": 3102.06, "text": "das fenster über mehrere desktops floaten geht das wirklich nicht sekunde ne das geht"}, {"id": 460, "start": 3102.06, "end": 3111.78, "text": "tatsächlich nicht warum ist in windows alles so halbherzig kacke gemacht das fenster ist"}, {"id": 461, "start": 3111.78, "end": 3124.26, "text": "nicht auf dem zweiten desktop das ging unter linux damals mit als als ubuntu noch mit kompets"}, {"id": 462, "start": 3124.26, "end": 3138.2, "text": "gerne benutzt wurde das ging 2008 ohne probleme wieso sollte es denn da sein naja wenn man"}, {"id": 463, "start": 3138.2, "end": 3147.06, "text": "war von den wenn man wenn man der logik folgt und sagt mehrere desktops sind quasi ja wie"}, {"id": 464, "start": 3147.06, "end": 3152.5, "text": "die seiten von einem würfel nebeneinander dann müsste dann müsste der kram das fenster"}, {"id": 465, "start": 3152.5, "end": 3158.66, "text": "hier so um die ecke rappen und halt dann auf dem desktop halbe halbe sein ich mein es geht"}, {"id": 466, "start": 3158.66, "end": 3163.58, "text": "auf desktop eins raus und dann würde man eigentlich erwarten dass es links auf desktop zwei wieder"}, {"id": 467, "start": 3163.58, "end": 3171.3, "text": "rein kommt wobei man das unter kompets auch unterschiedlich einstellen konnte ich glaube"}, {"id": 468, "start": 3171.3, "end": 3190.02, "text": "man konnte es unter kompets auch so machen dass es nicht der fall war ja habe ich ich"}, {"id": 469, "start": 3190.02, "end": 3194.78, "text": "habe damals irgendwie eine wim konfig mit 5000 zeilen oder so gehabt richtig hängen"}, {"id": 470, "start": 3194.78, "end": 3200.3, "text": "geblieben ich hatte fuzzy finder plugins autocomplete plugins wahrscheinlich alles sachen die mir"}, {"id": 471, "start": 3200.3, "end": 3204.98, "text": "heute gar nicht verwendet sondern es neuere versionen davon gibt alles mögliche ja ich"}, {"id": 472, "start": 3204.98, "end": 3211.3, "text": "habe wirklich aufgebohrt bis zum geht nicht mehr fand ich aber im nachhinein betrachtet"}, {"id": 473, "start": 3211.3, "end": 3217.94, "text": "nicht sonderlich schlau und ich bin froh dass ich das nicht mehr mache weil man gewöhnt"}, {"id": 474, "start": 3217.94, "end": 3223.66, "text": "sich dran dass wim so komisch konfiguriert ist und dann erwartest du auf dem server dass"}, {"id": 475, "start": 3223.66, "end": 3231.26, "text": "es auch so ist man vergisst die basic editier sachen wenn man solche sachen hat wie sneak"}, {"id": 476, "start": 3231.26, "end": 3237.54, "text": "wo man in der zeile rumspringen kann und man hat es auf dem server halt nicht wo man eigentlich"}, {"id": 477, "start": 3237.54, "end": 3243.72, "text": "wim braucht zum editieren und ganz im ernst so toll das ist sachen auf der kommando zeile"}, {"id": 478, "start": 3243.72, "end": 3251.34, "text": "zu machen muss aber gucken halt sachen dort machen wo es irgendwie sinnvoll ist ich muss"}, {"id": 479, "start": 3251.34, "end": 3256.82, "text": "sagen als text editor wim auf dem terminal für kleine editieraufgaben und auf dem server"}, {"id": 480, "start": 3256.82, "end": 3261.66, "text": "um remote was zu editieren wunderbar aber ich möchte beispielsweise keinen terminal"}, {"id": 481, "start": 3261.66, "end": 3270.26, "text": "editor mehr verwenden als hauptsächliches tool allein schon so sachen wie minimaps parameter"}, {"id": 482, "start": 3270.26, "end": 3293.34, "text": "highlights und sowas das ist ein krampf im wim ja die 1080 ti ist ziemlich gut jaja die"}, {"id": 483, "start": 3293.34, "end": 3303.86, "text": "1080 ti war richtig gut danke nochmal an nvidia das war glaube ich eines der nachhaltigsten"}, {"id": 484, "start": 3303.86, "end": 3313.22, "text": "sponsorings die ich je gemacht habe die 1080 ti poc echt poc karte kann man nicht anders"}, {"id": 485, "start": 3313.22, "end": 3326.06, "text": "sagen ja das war ein feder ja gut ssd habe ich mittlerweile ich habe immer noch die ssd"}, {"id": 486, "start": 3326.06, "end": 3333.98, "text": "drin aber noch was größeres cpu ist die gleiche ram ist mittlerweile mehr drinne guck"}, {"id": 487, "start": 3333.98, "end": 3343.34, "text": "ram habe ich mittlerweile 32 g aber ansonsten ist es exakt der gleiche rechner noch nur"}, {"id": 488, "start": 3343.34, "end": 3361.42, "text": "ein bisschen mehr ram und ein bisschen mehr ssd weird flex welcher flex war weird ram"}, {"id": 489, "start": 3361.42, "end": 3371.42, "text": "ist nicht weird flex ram ist beste man kann nie genug ram haben was ich mir für den pc"}, {"id": 490, "start": 3371.42, "end": 3376.94, "text": "heute holen würde das ist eine gute frage ich kann es dir nicht sagen weil ich immer"}, {"id": 491, "start": 3376.94, "end": 3386.86, "text": "nur auf dem aktuellen stand bin was desktop hardware angeht wenn ich mir einen kaufe"}, {"id": 492, "start": 3386.86, "end": 3395.22, "text": "opens vor einem jahr oder wann kam die aktuelle ryzen raus vor eineinhalb zwei jahren also"}, {"id": 493, "start": 3395.22, "end": 3402.7, "text": "als die neue ryzen generation angekündigt wurde ja da wollte ich in 5900x kaufen aber"}, {"id": 494, "start": 3402.7, "end": 3408.2, "text": "nachdem sich das dann alles nicht so ergeben hat ja erstmal hast du nichts bekommen dann"}, {"id": 495, "start": 3408.2, "end": 3412.7, "text": "hast du was bekommen aber grafikkarten waren unendlich teuer und sowas habe ich meinen"}, {"id": 496, "start": 3412.7, "end": 3420.1, "text": "rechner einfach immer weiter verwendet und wenn ich mir jetzt einen neuen kaufen müsste"}, {"id": 497, "start": 3420.1, "end": 3424.78, "text": "müsste ich selbst erstmal nachgucken was sich aktuell anbietet es kann durchaus sein"}, {"id": 498, "start": 3424.78, "end": 3433.5, "text": "dass es wieder ein intel system wird kann aber auch sein dass ein amd system wird das"}, {"id": 499, "start": 3433.5, "end": 3451.42, "text": "kann ich das also das könnte ich so gar nicht sagen mal gucken wann habe ich denn den wann"}, {"id": 500, "start": 3451.42, "end": 3462.22, "text": "ja oktober 2017 5 jahre alt ist der rechner keckel man ich warte auch ab ich kann ja aktuell"}, {"id": 501, "start": 3462.22, "end": 3468.38, "text": "alles spielen was ich spielen will ach ja es war die frage was ich was ich aktuell spiele"}, {"id": 502, "start": 3468.38, "end": 3473.42, "text": "also ich habe stray gespielt aber noch nicht ganz durch ich spiele gerade wieder ein bisschen"}, {"id": 503, "start": 3473.42, "end": 3478.98, "text": "crimdon weil ich sonst nichts besseres zu tun habe an spielen und dann vielleicht mal"}, {"id": 504, "start": 3478.98, "end": 3495.18, "text": "wieder die neue poe liga die irgendwie nächsten monat rauskommt im august ansonsten habe ich"}, {"id": 505, "start": 3495.18, "end": 3501.82, "text": "letzten sind strategie also ein ihr werdet lachen ein anime strategie game durchgespielt"}, {"id": 506, "start": 3501.82, "end": 3508.98, "text": "jetzt richtig gehört bei mir auf dem stream ja ich habe tatsächlich so richtig eher so"}, {"id": 507, "start": 3508.98, "end": 3519.26, "text": "was wie feier emblem war das nur nicht feier emblem so was halt auf dem pc feier emblem"}, {"id": 508, "start": 3519.26, "end": 3524.9, "text": "ist ja nicht wirklich so krasses wieb game oder irgendwo schon also was ist so was in"}, {"id": 509, "start": 3524.9, "end": 3532.38, "text": "der richtung wie feier emblem war das habe ich letztens gespielt und ansonsten gibt es"}, {"id": 510, "start": 3532.38, "end": 3541.5, "text": "aktuell leider nicht so viel was mich an games so richtig abholt ja anime strategie gibt"}, {"id": 511, "start": 3541.5, "end": 3548.1, "text": "es na klar guck dir feier emblem an das game war aber wie hieß das denn steam symphony"}, {"id": 512, "start": 3548.1, "end": 3560.54, "text": "of war oder sowas das da ja genau das da das ist das ist ein bisschen wie feier emblem"}, {"id": 513, "start": 3560.54, "end": 3567.14, "text": "ja also so mit maps und einheiten rum und so war eigentlich ganz nice ich mein hat auf"}, {"id": 514, "start": 3567.14, "end": 3575.9, "text": "overwhelming positive ach ja und für alle anime fans der wie nennt man das wie nennt"}, {"id": 515, "start": 3575.9, "end": 3591.66, "text": "man das der waifu alarm war sehr hoch da war für jeden was dabei aber gameplay technisch"}, {"id": 516, "start": 3591.66, "end": 3600.98, "text": "fand ich wirklich nicht schlecht ich mein overwhelming positive bei bei 2500 bewertungen"}, {"id": 517, "start": 3600.98, "end": 3612.22, "text": "nicht verkehrt das habe ich letztens gespielt ja und ansonsten gibt es leider nicht so viel"}, {"id": 518, "start": 3612.22, "end": 3619.86, "text": "was mich so catcht an games gerade leider wisst ihr ich hätte richtig bock drauf mal"}, {"id": 519, "start": 3619.86, "end": 3629.3, "text": "wieder nen mmo zu spielen am besten wenn es halt neu rauskommt und kein asia pay to win"}, {"id": 520, "start": 3629.3, "end": 3636.98, "text": "ein shit mmo sondern ein gutes mmo das problem ist halt es gibt kaum noch gute mmos beziehungsweise"}, {"id": 521, "start": 3636.98, "end": 3640.82, "text": "es kommen ja eigentlich keine mmos mehr raus und wenn sie rauskommen sind das irgendwelche"}, {"id": 522, "start": 3640.82, "end": 3649.34, "text": "asia pay to win dinger wisst ihr damals dachte ich als zu zeiten von dark edge of camelot"}, {"id": 523, "start": 3649.34, "end": 3654.86, "text": "und später world of warcraft sowas da dachte ich mir man wie geil müssen mmos erst sein"}, {"id": 524, "start": 3654.86, "end": 3668.5, "text": "2020 tja hast du falsch gedacht die besten mmos kamen damals raus das neue riot mmo ja"}, {"id": 525, "start": 3668.5, "end": 3674.18, "text": "vielleicht vielleicht vielleicht also ich würde gern wieder ein mmo spielen wo ich"}, {"id": 526, "start": 3674.18, "end": 3684.9, "text": "von anfang an dabei bin und was mir was mir irgendwie auch direkt zusagt ja es gibt so"}, {"id": 527, "start": 3684.9, "end": 3689.7, "text": "spiele die gucke ich da sehe ich schon die ersten screenshots und denke mir so na nicht"}, {"id": 528, "start": 3689.7, "end": 3699.78, "text": "ja genauso wenn sie anfangen immer dann gleich mit survival elementen in dem mmo und sowas"}, {"id": 529, "start": 3699.78, "end": 3705.14, "text": "ich meine nur weil die ganzen zombie survival dinger so extrem angesagt man heißt es nicht"}, {"id": 530, "start": 3705.14, "end": 3710.42, "text": "dass man mmos mit survival elementen machen muss oder ich bin auch überhaupt kein freund"}, {"id": 531, "start": 3710.42, "end": 3718.98, "text": "von perma das system hast den mmos weniger aber es gibt ziemlich viele spiele die letzten"}, {"id": 532, "start": 3718.98, "end": 3726.5, "text": "jahre die das halt mit mit survival kombinieren und ich mag perma deshalb in keinem game das"}, {"id": 533, "start": 3726.5, "end": 3739.34, "text": "einzige game wo perma das halbwegs halbwegs gut war war darkest dungeon moment da gibt"}, {"id": 534, "start": 3739.34, "end": 3753.54, "text": "es den zweiten teil von moment was davon gibt es den zweiten teil was war denn das"}, {"id": 535, "start": 3753.54, "end": 3765.38, "text": "käckel also da war perma das ok wobei es halt nicht perma das im eigentlichen sinne"}, {"id": 536, "start": 3765.38, "end": 3771.1, "text": "war also du bist ja nicht gestorben es konnten halt deine helden konnten sterben und wenn"}, {"id": 537, "start": 3771.1, "end": 3779.06, "text": "ich sterben dann halt zumindest irgendwelche die permanente debuffs davon tragen und so"}, {"id": 538, "start": 3779.06, "end": 3793.62, "text": "das war das einzige game was mir bock gemacht hat mit sowas wie perma das ach das ist ein"}, {"id": 539, "start": 3793.62, "end": 3807.46, "text": "epic store exclusive verstehe deswegen habe ich das nicht mitgekriegt"}, {"id": 540, "start": 3807.46, "end": 3814.66, "text": "ja maus beschleunigung ist ja auch wirklich menschenverachtend ja was spielt ihr denn"}, {"id": 541, "start": 3814.66, "end": 3822.78, "text": "aktuell so chat wo wir gerade beim thema sind ja elton ring habe ich mir zu release gekauft"}, {"id": 542, "start": 3822.78, "end": 3826.26, "text": "ich habe es bis jetzt noch nicht gespielt wobei ich es mir fest vorgenommen habe das"}, {"id": 543, "start": 3826.26, "end": 3832.06, "text": "wirklich der sache mal eine chance zu geben ich bin kein riesiger dark souls fan"}, {"id": 544, "start": 3832.06, "end": 3857.06, "text": "aber elton ring soll ja auch für leute erträglich sein die dark souls jetzt nicht so geil fanden"}, {"id": 545, "start": 3857.06, "end": 3875.74, "text": "cringe wer unter drei terabyte rammer dir hyper cringe was ist jetzt los achso das ist"}, {"id": 546, "start": 3875.74, "end": 3882.78, "text": "ja fünf minuten her ich bin im chat einfach zu langsam übrigens so meine eine eine frage"}, {"id": 547, "start": 3882.78, "end": 3889.66, "text": "wo ihr raten könnt leute im chat was meint ihr was im also beim iron maiden konzert in"}, {"id": 548, "start": 3889.66, "end": 3895.46, "text": "frankfurt in der im deutsche bankpark also im stadion drinne was meint ihr was die portion"}, {"id": 549, "start": 3895.46, "end": 3901.82, "text": "pomfrit gekostet hat so eine tüte pommes ratet mal was hat eine tüte pommes gekostet"}, {"id": 550, "start": 3901.82, "end": 3915.3, "text": "650 650 ihr seid ihr seid alle falsch chat alle falsch alle falsch wir kommen die ok"}, {"id": 551, "start": 3915.3, "end": 3931.7, "text": "ich sags euch 9 euro 9 euro 9 euro"}, {"id": 552, "start": 3931.7, "end": 3938.5, "text": "tüte pommes ratet das brötchen mit ner wurst drauf also bröt das war ein popliches brötchen"}, {"id": 553, "start": 3938.5, "end": 3948.7, "text": "ja brötchen wurst und bisschen senf drauf hat fünf euro gekostet und 0,5 0,5 trinken"}, {"id": 554, "start": 3948.7, "end": 3956.86, "text": "im iron maiden bächer hat glaube ich 4 80 gekostet oder so wobei das einmalig ok war"}, {"id": 555, "start": 3956.86, "end": 3965.18, "text": "weil den bächer habe ich mit heim genommen ja das ist das ist ok gewesen aber 9 euro"}, {"id": 556, "start": 3965.18, "end": 3985.42, "text": "für die pommes alter null also habe ich nicht gekauft sie ist ja beim vorbeilaufen du konntest"}, {"id": 557, "start": 3985.42, "end": 3993.66, "text": "ja auch ein kreppes holen für 450 oder so also es war also es war wirklich teuer genau"}, {"id": 558, "start": 3993.66, "end": 3998.5, "text": "ich habe zweimal gekauft twitch twitch money regelt und jetzt bin ich pleite jetzt brauche"}, {"id": 559, "start": 3998.5, "end": 4011.18, "text": "ich auch den ganzen prime subs sonst kann ich mir morgen expert zu essen kaufen ok hell"}, {"id": 560, "start": 4011.18, "end": 4014.66, "text": "let loose ja ich wollte schon lange mal ausprobieren aber ich glaube da kommt man nicht mehr richtig"}, {"id": 561, "start": 4014.66, "end": 4032.38, "text": "rein jetzt was nutt nutze linux portiert auf dem usb weil eine vm die performance auseinander"}, {"id": 562, "start": 4032.38, "end": 4048.22, "text": "nimmt was der satz ergibt für mich jetzt wenig sinn du willst ein persistentes system haben"}, {"id": 563, "start": 4048.22, "end": 4058.74, "text": "was du überall mit hinnehmen kannst oder wie chain war war das nee möb war der erste"}, {"id": 564, "start": 4058.74, "end": 4076.06, "text": "der halbwegs richtig liegt lag"}, {"id": 565, "start": 4076.06, "end": 4082.22, "text": "was ist denn web application elf in der taskleiste das hier ist das das ist die anwendung mit"}, {"id": 566, "start": 4082.22, "end": 4090.78, "text": "der ich bilder overlayen kann oder oder zum beispiel oder zum beispiel sagen lassen kann"}, {"id": 567, "start": 4090.78, "end": 4098.98, "text": "oder um die leute zu verwirren ich kann damit beispielsweise auch solche solche solche sounds"}, {"id": 568, "start": 4098.98, "end": 4119.66, "text": "mitmachen oder das was jeder mag"}, {"id": 569, "start": 4119.66, "end": 4132.14, "text": "was ist web application elf windows to go auf einem usb mit vm war wo tails läuft way"}, {"id": 570, "start": 4132.14, "end": 4156.54, "text": "to smart pfeifen genau selbst entwickelte bettel viel 2042 hex ja sollte ich vielleicht"}, {"id": 571, "start": 4156.54, "end": 4169.5, "text": "mal ausprobieren ja kann ich mir vorstellen leute ich muss trinken ich muss hydrated stain"}, {"id": 572, "start": 4169.5, "end": 4188.34, "text": "du bist unten im chat jepp jepp chat jepp harm den habe ich gebannt den hydrated bot"}, {"id": 573, "start": 4188.34, "end": 4203.7, "text": "da ging mir auf den keks des des geblockt der kann er nicht mehr hydraten ja schon ewig"}, {"id": 574, "start": 4203.7, "end": 4218.62, "text": "den habe ich bestimmt schon drei jahre gebannt oder so kauft ihr jetzt kein neuen pc solang"}, {"id": 575, "start": 4218.62, "end": 4225.9, "text": "deiner noch läuft ist es immer das beste abzuwarten außer du hast jetzt einen konkreten"}, {"id": 576, "start": 4225.9, "end": 4235.7, "text": "anwendungsfall wo du sagst dafür reicht es nicht mehr"}, {"id": 577, "start": 4235.7, "end": 4242.06, "text": "mache ich auch mache ich ich warte auf die 4900 ich warte auf neue cpu generation und"}, {"id": 578, "start": 4242.06, "end": 4256.82, "text": "4900 und dann hole ich mir vielleicht einen neuen pc nach die intel karten das wird eben"}, {"id": 579, "start": 4256.82, "end": 4260.12, "text": "die"}, {"id": 580, "start": 4260.12, "end": 4279.36, "text": "oh leute ich glaube ich muss echt mal fiber messen ich active zeit ich hab mich gerade"}, {"id": 581, "start": 4279.36, "end": 4286.04, "text": "so ein kopf es fühlt sich schon warm an also wärmer wärmer als sonst auf jeden Fall"}, {"id": 582, "start": 4286.04, "end": 4313.68, "text": "Naja, also ich hoffe nicht, also ich hoffe immer noch nicht, dass es Corona ist und selbst"}, {"id": 583, "start": 4313.68, "end": 4322.44, "text": "wenn es Corona ist, ich mein, ich bin, wie oft geimpft bin ich, was ist normal, dreifach"}, {"id": 584, "start": 4322.44, "end": 4328.68, "text": "ist, wenn man alles gemacht hat, was es so gab oder, ich guck mal kurz in meine Corona"}, {"id": 585, "start": 4328.68, "end": 4333.68, "text": "App, das steht doch da irgendwie, ja ich hab den Kram immer noch drauf, ich würde es"}, {"id": 586, "start": 4333.68, "end": 4363.64, "text": "jetzt nicht mehr neu installieren, aber, schauen wir mal kurz, oh ich glaube, ich hab"}, {"id": 587, "start": 4363.64, "end": 4370.88, "text": "Bluetooth aus, deswegen funktioniert das nicht, nee ich hab noch keinen Schnelltest gemacht"}, {"id": 588, "start": 4370.88, "end": 4376.64, "text": "und ich glaube es ist einfach auch noch zu früh für den Schnelltest, weil das Konzert"}, {"id": 589, "start": 4376.64, "end": 4383.84, "text": "war am Dienstag, das ist ja gerade mal zwei Tage her, wenn du es so willst und die Schnelltests"}, {"id": 590, "start": 4383.84, "end": 4395.52, "text": "so richtig hinhauen tun die ja frühestens eigentlich nach vier Tagen, bestimmt, gleich,"}, {"id": 591, "start": 4395.52, "end": 4419.84, "text": "was ist da eigentlich raus geworden, lange nichts mehr gehört, tja, ich würde mich nicht"}, {"id": 592, "start": 4419.84, "end": 4426.36, "text": "darauf verlassen, ehrlich gesagt, ich denke auch, ich hab ja heute morgen im Internet geguckt,"}, {"id": 593, "start": 4426.36, "end": 4437.48, "text": "normale Inkubationszeit bei Corona sind irgendwie zwischen vier und sechs Tagen, aber ich mein"}, {"id": 594, "start": 4437.48, "end": 4445.32, "text": "okay, wir hatten jetzt auch jemand vorhin im Chat, der gesagt hat, bei ihm war es genauso,"}, {"id": 595, "start": 4445.32, "end": 4449.76, "text": "es ist ja noch nicht krass, mir tut ein bisschen der Hals weh und ich muss ein bisschen husten,"}, {"id": 596, "start": 4449.76, "end": 4453.56, "text": "also es könnte durch, also ich glaube Leute, die da nicht so genau drauf achten, die würden"}, {"id": 597, "start": 4453.56, "end": 4476.8, "text": "wahrscheinlich noch sagen, das ist doch alles normal, ja, das ist wahrscheinlich normal,"}, {"id": 598, "start": 4476.8, "end": 4482.88, "text": "dass es so anfängt, ja, ich wollte morgen tatsächlich ins Büro fahren, aber ich glaube,"}, {"id": 599, "start": 4482.88, "end": 4491.56, "text": "das lass ich, das lass ich, also, das ist ein Link, ich weiß nicht, was sich dahinter"}, {"id": 600, "start": 4491.56, "end": 4509.6, "text": "verbirgt, aber das mach ich nicht auf bei diesem Titel, ja, ich hoffe, ich hoffe, es ist nicht"}, {"id": 601, "start": 4509.6, "end": 4515.0, "text": "so wild, also, würde gerne deine Meinung zu folgender Situationen wissen angenommen,"}, {"id": 602, "start": 4515.0, "end": 4520.24, "text": "du bist Fullstack Webentwickler mit TypeScript, okay, und hast du ein Jobangebot als Cloud"}, {"id": 603, "start": 4520.24, "end": 4527.72, "text": "Architekt Azure mit C Sharp als Backender Fullstack Webentwickler, also das erste, was ich mich"}, {"id": 604, "start": 4527.72, "end": 4538.56, "text": "fragen würde ist, kannst du das, also ich mein, ich würde jetzt davon ausgehen, ja,"}, {"id": 605, "start": 4538.56, "end": 4544.88, "text": "du kannst das, weil ansonsten hätten sie dir kein Angebot gemacht, es ist ja schon"}, {"id": 606, "start": 4544.88, "end": 4563.76, "text": "ein bisschen was anderes, also hast du Ahnung von Cloud Architektur und von Azure, ansonsten"}, {"id": 607, "start": 4563.76, "end": 4570.68, "text": "ist es halt ziemlich ins kalte Wasser gesprungen, ja, man kann das sicherlich alles lernen,"}, {"id": 608, "start": 4570.68, "end": 4576.48, "text": "aber wenn du irgendwo anfängst, wo aus Gründen der Jobbezeichnung von dir erwartet wird,"}, {"id": 609, "start": 4576.48, "end": 4581.92, "text": "dass du das kannst, und du kannst es dann nicht, ist vielleicht auch nicht so die beste"}, {"id": 610, "start": 4581.92, "end": 4588.64, "text": "Voraussetzung, was ist denn ein Web3 Entwickler, willst du irgendwelche NFT Geschichten machen"}, {"id": 611, "start": 4588.64, "end": 4601.08, "text": "oder dezentrales Blockchain Pfeifer Zeug, ansonsten, ganz ehrlich, kann ich dir das"}, {"id": 612, "start": 4601.08, "end": 4610.32, "text": "nicht beantworten, ne, wir sind bei Web3, Web3 ist doch das Blockchain Zeug, ich kann"}, {"id": 613, "start": 4610.32, "end": 4618.96, "text": "es dir nicht beantworten, also ich persönlich würde auf jeden Fall das hier machen, anstatt"}, {"id": 614, "start": 4618.96, "end": 4634.68, "text": "das andere, aber das kann ich so nicht wissen bei dir, keine Ahnung, du musst nicht zwangsläubig"}, {"id": 615, "start": 4634.68, "end": 4638.96, "text": "was mit Terraform machen, aber es ist auf jeden Fall nicht verkehrt, von genau solchen"}, {"id": 616, "start": 4638.96, "end": 4651.44, "text": "Sachen Ahnung zu haben, bevor man Cloud-Architekt wird, übrigens bisschen komische Kombination,"}, {"id": 617, "start": 4651.44, "end": 4656.48, "text": "Cloud-Architekt mit C-Sharp als, also du bastelst da nicht am Backend rum, oder, oder bist"}, {"id": 618, "start": 4656.48, "end": 4665.16, "text": "du quasi, quasi fulles Stack-Entwickler, dann Frontend, Backend und Cloud-Infrastruktur,"}, {"id": 619, "start": 4665.16, "end": 4671.68, "text": "Bleeds Stack, ja also meine Gedanken sind, ich persönlich würde das hier deutlich lieber"}, {"id": 620, "start": 4671.68, "end": 4676.28, "text": "machen als das hier, erstens, weil ich mir bei der ganzen Web3-Geschichte mich fragen"}, {"id": 621, "start": 4676.28, "end": 4681.36, "text": "würde, welcher Laden ist das, wo bin ich da gelandet und weil ich keinen Bock hätte"}, {"id": 622, "start": 4681.36, "end": 4689.28, "text": "auf JavaScript-Frontend den ganzen Tag, ich mich aber zumindest mit Cloud-Architektur"}, {"id": 623, "start": 4689.28, "end": 4696.28, "text": "schon ein bisschen auskenne und C-Sharp jetzt auch nicht das schlechteste ist bei mir, also"}, {"id": 624, "start": 4696.28, "end": 4700.56, "text": "für mich persönlich, das heißt ja für dich nichts, aber für mich persönlich wäre das"}, {"id": 625, "start": 4700.56, "end": 4705.32, "text": "hier die bessere Variante, aber vielleicht ist es bei dir genau umgedreht, vielleicht"}, {"id": 626, "start": 4705.32, "end": 4709.68, "text": "sagst du, ja hiervon habe ich Ahnung, davon eigentlich eher nicht, dann ist bei dir genau"}, {"id": 627, "start": 4709.68, "end": 4720.84, "text": "umgedreht, Gigas Stack, ja du kannst mal in der Berufsschule gucken, ob sie den Lehrplan"}, {"id": 628, "start": 4720.84, "end": 4728.2, "text": "irgendwo haben, oder den Ausbildungsplan oder wie das genau heißt und du kannst dich schlau"}, {"id": 629, "start": 4728.2, "end": 4734.76, "text": "machen, mit was sich deine Firma, also der Betrieb, wo du die Ausbildung machst, mit"}, {"id": 630, "start": 4734.76, "end": 4742.6, "text": "was die sich sonst so beschäftigen, was die so machen und dann gucken, ob man sich da"}, {"id": 631, "start": 4742.6, "end": 4747.48, "text": "irgendwie darauf vorbereiten kann, aber ansonsten muss man auch ganz klar sagen, Ausbildung"}, {"id": 632, "start": 4747.48, "end": 4750.76, "text": "ist ja dafür da, dass man was lernt, nicht dass man schon alles kann."}, {"id": 633, "start": 4750.76, "end": 4774.08, "text": "Welche Sprache für Anfänger JavaScript? JavaScripts, allein schon aus zwei Gründen,"}, {"id": 634, "start": 4774.08, "end": 4780.76, "text": "der Einstieg ist einfach nix Java zum Einstieg, JavaScript, der Einstieg ist mit Abstand am"}, {"id": 635, "start": 4780.76, "end": 4788.64, "text": "einfachsten, du brauchst nur einen Editor und einen Browser und das zweite ist an Frontend"}, {"id": 636, "start": 4788.64, "end": 4795.92, "text": "Technologien, also in dem Fall JavaScript, HTML, CSS, kommt niemand vorbei und sei es"}, {"id": 637, "start": 4795.92, "end": 4817.72, "text": "nur ein bisschen. Und dann wird das abgeschrieben und ein paar Fax verschickt, oder wie? Programmieren"}, {"id": 638, "start": 4817.72, "end": 4830.12, "text": "WDR Maus, ich rede mit was? Programmieren mit der Maus. Blockly mit der Maus, hey das"}, {"id": 639, "start": 4830.12, "end": 4843.08, "text": "ist ne richtig gute Idee Leute, warum ist das alles so ausgekraut? Das ist ne richtig"}, {"id": 640, "start": 4843.08, "end": 4859.8, "text": "gute Idee. Warum kann man das hier nicht anklicken? Blöde Frage, warum ist das alles ausgekraut?"}, {"id": 641, "start": 4859.8, "end": 4876.52, "text": "Ach wegen meinem Dark Mode? Nö. Aber das finde ich ist ne gute Idee sowas zu machen, aber"}, {"id": 642, "start": 4876.52, "end": 4895.8, "text": "wenn ich das, ach so hier kann ich jetzt, ne das ist ne gute Idee. Nice Idee, finde ich"}, {"id": 643, "start": 4895.8, "end": 4907.36, "text": "gut. Ja, Battlefield Portal ist ja auch auf Blockly Basis, sieht man ja auch im Browser,"}, {"id": 644, "start": 4907.36, "end": 4917.8, "text": "wenn man sich die Worlds anguckt, was da so nachgeladen wird und so. Ganz im Ernst, mir"}, {"id": 645, "start": 4917.8, "end": 4924.0, "text": "ist es lieber, die geben Geld von meinen Gebühren für sowas, also jetzt mal ernsthaft, guck"}, {"id": 646, "start": 4924.0, "end": 4930.44, "text": "mal, mir ist es lieber, die geben Geld für sowas aus mit meinen Gebühren, als für Rosamunde"}, {"id": 647, "start": 4930.44, "end": 4940.76, "text": "Pilcher oder dicke Backenmusik oder Florian Silbereisen, der Musikantendampfer und was"}, {"id": 648, "start": 4940.76, "end": 4956.96, "text": "es da nicht alles gibt. Also dann ist mir das deutlich lieber. Eigentlich ne coole Idee."}, {"id": 649, "start": 4956.96, "end": 4976.36, "text": "So, the end."}, {"id": 650, "start": 4976.36, "end": 4998.68, "text": "Also, wenn du technische Assistent gemacht hast, das ist das, was dann irgendwie staatlich"}, {"id": 651, "start": 4998.68, "end": 5002.08, "text": "geprüft hat, Informationstechnische Assistent, oder?"}, {"id": 652, "start": 5002.08, "end": 5004.84, "text": "Oder meinst du das, was in der Schweiz Assistent heißt?"}, {"id": 653, "start": 5004.84, "end": 5011.64, "text": "Das ist diese Ausbildung, wo man nichts mitfindet, was eigentlich useless ist zu machen, also"}, {"id": 654, "start": 5011.64, "end": 5015.64, "text": "wenn das dieser staatlich geprüfte Informationstechnische Assistent ist."}, {"id": 655, "start": 5015.64, "end": 5017.48, "text": "Das ist useless, das kannst du vergessen."}, {"id": 656, "start": 5017.48, "end": 5025.32, "text": "Du wirst aber dadurch wahrscheinlich in der Berufsschule nicht viel Neues lernen in der"}, {"id": 657, "start": 5025.32, "end": 5026.32, "text": "Ausbildung."}, {"id": 658, "start": 5026.32, "end": 5029.28, "text": "Was du in der Ausbildung lernst, ist halt, was im Businessumfeld so abgeht."}, {"id": 659, "start": 5029.28, "end": 5037.24, "text": "Nee, ich glaube dann ist es was anderes."}, {"id": 660, "start": 5037.24, "end": 5047.28, "text": "Aber ob du studieren willst oder eine Ausbildung machen willst, das kann ich dir jetzt ja schlecht"}, {"id": 661, "start": 5047.28, "end": 5048.28, "text": "beantworten."}, {"id": 662, "start": 5048.28, "end": 5051.92, "text": "Also, wenn du studieren gehen willst, dann geh gleich studieren."}, {"id": 663, "start": 5051.92, "end": 5056.28, "text": "Also, erst das machen, dann das machen, dann studieren gehen ist unsinnig."}, {"id": 664, "start": 5056.28, "end": 5060.2, "text": "Also, die Physi-Ausbildung bringt dir jetzt fürs Studium nicht wahnsinnig viel."}, {"id": 665, "start": 5060.2, "end": 5071.2, "text": "Umgedreht würde ich sagen, wahrscheinlich auch nicht so wirklich, weil in der Ausbildung"}, {"id": 666, "start": 5071.2, "end": 5078.72, "text": "geht es halt eher um die Praxis und im Studium kannst du halt den Binary Tree inverten."}, {"id": 667, "start": 5078.72, "end": 5089.84, "text": "Also, das kann ich dir jetzt nicht sagen."}, {"id": 668, "start": 5089.84, "end": 5099.12, "text": "Du musst ja im Klaren sein, dass ein Informatikstudium jetzt nicht easy as fuck ist, also nicht so"}, {"id": 669, "start": 5099.12, "end": 5102.96, "text": "nach dem Motto, ahja, ich setze mich jetzt mal ein paar Stunden in die Uni und dann mache"}, {"id": 670, "start": 5102.96, "end": 5104.72, "text": "ich easy Mathe und Informatik."}, {"id": 671, "start": 5104.72, "end": 5106.64, "text": "Nee, nee, so einfach ist das nicht."}, {"id": 672, "start": 5106.64, "end": 5117.16, "text": "Wohingegen die Physi-Ausbildung, was Berufsschule angeht, als schlechter Witz ist, also das"}, {"id": 673, "start": 5117.16, "end": 5120.08, "text": "schafft jeder, selbst ohne aufpassen."}, {"id": 674, "start": 5120.08, "end": 5127.16, "text": "Also, die Physi-Ausbildung ist, was Schule angeht und Lernen angeht, definitiv entspannter,"}, {"id": 675, "start": 5127.16, "end": 5138.64, "text": "also am Theorie-Anteil definitiv entspannter als zu studieren."}, {"id": 676, "start": 5138.64, "end": 5141.04, "text": "Denkst du, dass man bessere Karrierechancen hat mit Studium?"}, {"id": 677, "start": 5141.04, "end": 5143.36, "text": "Ja, prinzipiell würde ich sagen schon."}, {"id": 678, "start": 5143.36, "end": 5150.24, "text": "Ich denke mal, wenn wir uns irgendwelche Gehalts-Tabellen angucken würden, dann ist es bestimmt auch"}, {"id": 679, "start": 5150.24, "end": 5154.04, "text": "so, dass im Durchschnitt, wie gesagt nur im Durchschnitt, das heißt nicht, dass es unbedingt"}, {"id": 680, "start": 5154.04, "end": 5158.0, "text": "jetzt für dich gelten muss, aber im Durchschnitt, wahrscheinlich Leute, die studiert haben auch"}, {"id": 681, "start": 5158.0, "end": 5164.64, "text": "einen Ticken mehr verdienen, unterm Strich hängt es am Ende halt trotzdem davon ab,"}, {"id": 682, "start": 5164.64, "end": 5165.64, "text": "was du kannst."}, {"id": 683, "start": 5165.64, "end": 5170.6, "text": "Wir haben beispielsweise bei uns im Support einige Leute sitzen, die haben Informatik"}, {"id": 684, "start": 5170.6, "end": 5171.6, "text": "studiert."}, {"id": 685, "start": 5171.6, "end": 5177.84, "text": "Zwar kein Master, sondern nur das davor, aber die machen jetzt Support und haben eigentlich"}, {"id": 686, "start": 5177.84, "end": 5184.72, "text": "voller Technik, nicht so viel mit zu tun und teilweise auch nicht so wirklich viel Ahnung."}, {"id": 687, "start": 5184.72, "end": 5201.4, "text": "Wie, du kannst kein binary tree invert nach dem Informatikstudium, dann würde ich sagen,"}, {"id": 688, "start": 5201.4, "end": 5210.08, "text": "da haben die aber gefällt."}, {"id": 689, "start": 5210.08, "end": 5215.24, "text": "Doch hats, Informatikstudium hat was mit Mathe und Programmieren zu tun."}, {"id": 690, "start": 5215.24, "end": 5220.48, "text": "Also jemand, der was anderes, ich meine Leute, ich habe nicht studiert, aber ein bisschen"}, {"id": 691, "start": 5220.48, "end": 5225.28, "text": "schlau gemacht und auch mit Leuten drüber gesprochen, die studiert haben, habe ich selbstverständlich"}, {"id": 692, "start": 5225.28, "end": 5244.88, "text": "ein Informatikstudium, was mit Programmieren und Mathe zu tun."}, {"id": 693, "start": 5244.88, "end": 5248.76, "text": "Ich glaube die meisten, die Wirtschaftsinformatik studieren, ich weiß nicht, wie es bei dir"}, {"id": 694, "start": 5248.76, "end": 5254.04, "text": "ist, die wollen einfach, dass der Matheanteil einfacher wird."}, {"id": 695, "start": 5254.04, "end": 5271.4, "text": "Ist so meine persönliche Vermutung, keine Ahnung, ob das stimmt."}, {"id": 696, "start": 5271.4, "end": 5275.64, "text": "Also im Durchschnitt, im Durchschnitt ist es bestimmt so, im Durchschnitt werden wahrscheinlich"}, {"id": 697, "start": 5275.64, "end": 5278.76, "text": "Leute, die studiert haben, mehr verdienen, als Leute, die eine Ausbildung gemacht haben."}, {"id": 698, "start": 5278.76, "end": 5287.68, "text": "Ich gehe aber davon aus, dass sich das mit Berufsjahren ein bisschen angleicht und dass"}, {"id": 699, "start": 5287.68, "end": 5289.84, "text": "man es dann irgendwann gar nicht mehr so genau erkennt."}, {"id": 700, "start": 5289.84, "end": 5293.04, "text": "Weil wo es einen riesen Unterschied macht, ist wohl wahrscheinlich, wenn du bei irgendwelchen"}, {"id": 701, "start": 5293.04, "end": 5296.6, "text": "Behörden arbeitest, die haben da halt sehr starre Vorgaben."}, {"id": 702, "start": 5296.6, "end": 5316.84, "text": "Ja, das kann ich jetzt nicht sagen, aber es hört sich schon ein bisschen so an, weil"}, {"id": 703, "start": 5316.84, "end": 5319.16, "text": "ich meine dein Chef weiß doch, was du kannst."}, {"id": 704, "start": 5319.16, "end": 5329.48, "text": "Ich kann mir ehrlich gesagt nicht vorstellen, dass du nach deiner Ausbildung neben dem Beruf"}, {"id": 705, "start": 5329.48, "end": 5335.24, "text": "ein Studium da noch machst, um mehr Geld zu verdienen, weil du lernst in dem Studium"}, {"id": 706, "start": 5335.24, "end": 5341.56, "text": "höchstwahrscheinlich nichts, was für deine Arbeit jetzt erstmal so relevant ist, unmittelbar"}, {"id": 707, "start": 5341.56, "end": 5346.0, "text": "und nicht so viel besser machen würde, als wenn du Fachinformatik und Anführungsentwicklung"}, {"id": 708, "start": 5346.0, "end": 5347.0, "text": "gelernt hast."}, {"id": 709, "start": 5347.0, "end": 5353.48, "text": "Du hast in dem Betrieb gelernt, du weißt, was die machen, das ist mehr, als jeder, der"}, {"id": 710, "start": 5353.48, "end": 5355.4, "text": "Informatik studiert hat, weiß."}, {"id": 711, "start": 5355.4, "end": 5363.12, "text": "Du weißt, wie die Projekte laufen, du weißt, auf was die basieren, du kennst die Codebase,"}, {"id": 712, "start": 5363.12, "end": 5367.2, "text": "also das Informatikstudieren würde in dem Fall jetzt rein arbeitstechnisch wahrscheinlich"}, {"id": 713, "start": 5367.2, "end": 5368.2, "text": "gar nicht so viel bringen."}, {"id": 714, "start": 5368.2, "end": 5374.88, "text": "Wenn es dein Chef erzählt, kann es durchaus ein Grund sein, dass er sagt, ja hättest"}, {"id": 715, "start": 5374.88, "end": 5376.56, "text": "du studiert, würdest du mehr verdienen."}, {"id": 716, "start": 5376.56, "end": 5380.6, "text": "Keine Ahnung, das kann man jetzt schlecht einschätzen, ich mein vielleicht ist er auch"}, {"id": 717, "start": 5380.6, "end": 5385.32, "text": "letztendlich gar nicht der, der das entscheidet, sondern irgendeine Instanz oben drüber und"}, {"id": 718, "start": 5385.32, "end": 5387.28, "text": "ihr seid eine Behörde und da muss das so sein."}, {"id": 719, "start": 5387.28, "end": 5393.16, "text": "Ja Support würde ich auch nicht machen."}, {"id": 720, "start": 5393.16, "end": 5416.08, "text": "Ja so seh ich denke ich auch, genau."}, {"id": 721, "start": 5416.08, "end": 5422.16, "text": "Also ich würde nicht sagen, dass du pauschal sagen kannst, welcher der beiden jetzt am"}, {"id": 722, "start": 5422.16, "end": 5423.88, "text": "Ende mehr Verantwortung übernimmt."}, {"id": 723, "start": 5423.88, "end": 5426.44, "text": "Vor allem Verantwortung für was?"}, {"id": 724, "start": 5426.44, "end": 5434.68, "text": "Personal, Projekte, irgendwelche Verfügbarkeits-SLRs, von was?"}, {"id": 725, "start": 5434.68, "end": 5447.96, "text": "Ja das ist natürlich was anderes, dann hat es ja auch einen anderen Anreiz das zu machen."}, {"id": 726, "start": 5447.96, "end": 5476.52, "text": "Da wird viel Blödsinn gelabert, wenn der Tag lang ist, man kann es davon abgesehen,"}, {"id": 727, "start": 5476.52, "end": 5480.68, "text": "gibt es wirklich jemand, der ernsthaft CTO werden möchte?"}, {"id": 728, "start": 5480.68, "end": 5490.08, "text": "Also ich sage nicht, dass es keine Leute gibt, die CTO werden möchten, aber die meisten"}, {"id": 729, "start": 5490.08, "end": 5494.6, "text": "Techniker haben doch auf solche hohen Positionen gar keinen Bock."}, {"id": 730, "start": 5494.6, "end": 5499.48, "text": "Mein Ausnahmen bestätigen die Regel."}, {"id": 731, "start": 5499.48, "end": 5511.12, "text": "Also ich kann ja nur von mir ausgehen, ich habe zum Beispiel keinen Bock irgendwelche"}, {"id": 732, "start": 5511.12, "end": 5513.16, "text": "höheren Management-Geschichten zu machen."}, {"id": 733, "start": 5513.16, "end": 5522.08, "text": "Nö habe ich nicht, aber letztendlich musst du sowas als Informatiker eben wissen."}, {"id": 734, "start": 5522.08, "end": 5527.52, "text": "Das ist halt der große Unterschied zwischen Ausbildung und Studium, im Studium hast du"}, {"id": 735, "start": 5527.52, "end": 5533.88, "text": "halt die theoretischen Hintergründe, dass du weißt warum das auch maximal in linearer"}, {"id": 736, "start": 5533.88, "end": 5535.88, "text": "Zeit durchläuft."}, {"id": 737, "start": 5535.88, "end": 5542.52, "text": "Da sagst du nicht einfach nur Array.sort, sondern du kannst im Zweifelsfall auch erklären,"}, {"id": 738, "start": 5542.52, "end": 5547.24, "text": "warum an dieser Stelle dieser Sortier-Algorithmus die bessere Wahl ist, wenn die Daten so und"}, {"id": 739, "start": 5547.24, "end": 5548.24, "text": "so da reinkommen."}, {"id": 740, "start": 5548.24, "end": 5552.4, "text": "Das ist vielleicht das, was du nach einem Studium machen kannst, was du aber nicht"}, {"id": 741, "start": 5552.4, "end": 5556.0, "text": "unbedingt jetzt rein mit dem Wissen aus der Ausbildung machen kannst."}, {"id": 742, "start": 5556.0, "end": 5562.32, "text": "Natürlich, ganz ehrlich, meistens ist es gar nicht notwendig, dass man das selber weiß,"}, {"id": 743, "start": 5562.32, "end": 5570.08, "text": "man gibt das in Google ein und hat dann ok, ich habe zur Auswahl Quick-Sort, Merge-Sort,"}, {"id": 744, "start": 5570.08, "end": 5576.16, "text": "Bubble-Sort, meine Daten haben maximal 20 Elemente im Array, also nehme ich das, so fertig."}, {"id": 745, "start": 5576.16, "end": 5581.4, "text": "Aber wenn du es dann wirklich mathematisch auch belegen willst oder das fundiert beantworten"}, {"id": 746, "start": 5581.4, "end": 5585.92, "text": "können musst, dann bringt dir das schon was, wenn du das weißt."}, {"id": 747, "start": 5585.92, "end": 5589.4, "text": "Wie oft es jetzt vorkommt, hängt sicherlich auch von der Stelle ab."}, {"id": 748, "start": 5589.4, "end": 5606.88, "text": "Vielleicht, also seit dem Konzert habe ich Halsweh, ich muss husten und irgendwie fühle"}, {"id": 749, "start": 5606.88, "end": 5610.96, "text": "ich mich auch, man's not hot, fühle ich mich auch warm."}, {"id": 750, "start": 5610.96, "end": 5615.28, "text": "Ich muss mir nachher, wie gesagt, nachher Thermometer in Bubble mal gucken."}, {"id": 751, "start": 5615.28, "end": 5622.72, "text": "Kann mir einer einen Tipp geben, wie man lokale IP-Adressen in einem Domain zuweisen"}, {"id": 752, "start": 5622.72, "end": 5632.8, "text": "kann, dass diese auch, naja, du mal gehst in dein DNS auf deinem Router und trägst"}, {"id": 753, "start": 5632.8, "end": 5636.72, "text": "dort den Name ein und fertig."}, {"id": 754, "start": 5636.72, "end": 5653.56, "text": "Also, ich verstehe das Problem gerade nicht, oder ist das eine Domain, die extern und intern"}, {"id": 755, "start": 5653.56, "end": 5654.56, "text": "verwendet wird?"}, {"id": 756, "start": 5654.56, "end": 5662.32, "text": "Also, für den Fall der Fälle gibt es zwei Varianten, du machst Split-DNS, also sprich,"}, {"id": 757, "start": 5662.32, "end": 5668.36, "text": "du hast intern Sachen, die aufgelöst werden, aber extern nicht, kann man machen, zum Beispiel"}, {"id": 758, "start": 5668.36, "end": 5674.4, "text": "überschreibst du halt in deinem Router-DNS oder in deinem lokalen DNS manche Adressen"}, {"id": 759, "start": 5674.4, "end": 5680.8, "text": "mit lokalen IPv4-Adressen oder IPv6-Adressen und alles, was du nicht kennst, formatest"}, {"id": 760, "start": 5680.8, "end": 5687.4, "text": "du weiter an die öffentlichen DNS-Server oder du kannst theoretisch auch in deinem"}, {"id": 761, "start": 5687.4, "end": 5693.8, "text": "Public-DNS Private-IPs eintragen, das geht auch, da kommt ja dann auch keiner hin, das"}, {"id": 762, "start": 5693.8, "end": 5694.8, "text": "sind ja Private-IPs."}, {"id": 763, "start": 5694.8, "end": 5705.52, "text": "Also, du kannst ohne Probleme keqw.services, also hier keine Ahnung, 0.keqw.services kann"}, {"id": 764, "start": 5705.52, "end": 5713.44, "text": "ohne Probleme auflösen auf 122.168.0.1, auch Public, das funktioniert, man kommt halt nirgends"}, {"id": 765, "start": 5713.44, "end": 5730.2, "text": "wo an, nutze Linux für die Entwicklung, ja mittlerweile ausschließlich, wenn es nicht"}, {"id": 766, "start": 5730.2, "end": 5736.56, "text": "gerade irgendwelche Windows-Sachen sind, die ich mache, aber ansonsten 95% exklusiv nur"}, {"id": 767, "start": 5736.56, "end": 5745.48, "text": "unter Linux, geht das auf der Fritzbox, keine Ahnung, Leute kann man in der Fritzbox DNS-Geschichten"}, {"id": 768, "start": 5745.48, "end": 5752.28, "text": "setzen, wahrscheinlich, kannst du statische DNS-Einträge machen in der Fritzbox, wahrscheinlich"}, {"id": 769, "start": 5752.28, "end": 5771.2, "text": "ja, ja geht wahrscheinlich, ja, was ist das, kannst du es aufmachen, 15 sorting algorithms"}, {"id": 770, "start": 5771.2, "end": 5781.4, "text": "in 6 minutes, harte Kost, wir gucken uns jetzt gleich noch das TempleOS-Video an, I remain"}, {"id": 771, "start": 5781.4, "end": 5807.4, "text": "2 und, nee, 26. in Frankfurt im Stadion, was hast du für Disko, welche Tools nutzt du"}, {"id": 772, "start": 5807.4, "end": 5826.72, "text": "bezogen auf Linux, ich benutze Manjaro, das ist so ein Arch Linux Abkömmling, ja und"}, {"id": 773, "start": 5826.72, "end": 5834.8, "text": "als Tools eigentlich zum größten Teil die IDE's von JetBrains, hauptsächlich Rider"}, {"id": 774, "start": 5834.8, "end": 5841.56, "text": "für.NET und halt ansonsten alles mögliche was es halt unter Linux so gibt, was man so"}, {"id": 775, "start": 5841.56, "end": 5856.56, "text": "braucht, also der Sound war nicht gut, die Band und die Show war nice, Preis-Leistungstechnik"}, {"id": 776, "start": 5856.56, "end": 5870.56, "text": "war auch okay, außer das Essen und Trinken, ja und ich hab mir irgendwas eingefangen,"}, {"id": 777, "start": 5870.56, "end": 5876.84, "text": "das wichtigste Tool-ASCII-Iquarium, ja eindeutig, eindeutig, ja, das muss sein, Leute mir tut"}, {"id": 778, "start": 5876.84, "end": 5885.68, "text": "der Hals weh, ich geh jetzt off, ging länger als ich das gedacht habe, ich hoffe mal, dass"}, {"id": 779, "start": 5885.68, "end": 5889.52, "text": "es kein Corona ist, aber drauf ankommen lassen will ich es nicht, also ich will nicht unbedingt"}, {"id": 780, "start": 5889.52, "end": 5901.36, "text": "alle anstecken jetzt, die Minimalinstallation war das und alles selbst gemacht, das war"}, {"id": 781, "start": 5901.36, "end": 5916.16, "text": "original, ja ja, das waren die alten Säcke, ab zum Arzt, das ist jetzt gerade ein bisschen"}, {"id": 782, "start": 5916.16, "end": 5924.76, "text": "schwierig, es hat 90€ gekostet und es ging mit zwei Bands davor und Iron Maiden ging's"}, {"id": 783, "start": 5924.76, "end": 5942.24, "text": "von 17.50 Uhr in dem Dreh bis 22.45 Uhr, also davon waren, Iron Maiden waren auch 100 Minuten"}, {"id": 784, "start": 5942.24, "end": 5949.64, "text": "ungefähr, es war aber richtig geil, also Liederauswahl war wirklich okay, viel altes Zeug, wo ich"}, {"id": 785, "start": 5949.64, "end": 5954.32, "text": "die Texte konnte und mitsingen konnte, man die 4-5 neuen Songs hätte man sich sparen"}, {"id": 786, "start": 5954.32, "end": 5958.68, "text": "können, weil die kenne ich nicht, aber ich will mich jetzt ja nicht beschweren, dass"}, {"id": 787, "start": 5958.68, "end": 5971.24, "text": "sie aktuelles Zeug spielen, danke für den Sub, danke für die ganzen Subs heute auch,"}, {"id": 788, "start": 5971.24, "end": 5975.84, "text": "by the way, fällt mir gerade ein, ich hab nämlich überhaupt nicht reingeguckt, überhaupt"}, {"id": 789, "start": 5975.84, "end": 5987.64, "text": "nicht drauf geachtet, Tribolon hat auch noch gesubbt und das war's, gut, hab ich ja nicht"}, {"id": 790, "start": 5987.64, "end": 5996.44, "text": "viel übersehen, danke schön Leute, also macht's gut, wir sehen uns, WOTCS, POG Subscription,"}, {"id": 791, "start": 5996.44, "end": 6020.44, "text": "danke, bis dann Leute, wir sehen uns, macht's gut, see you."}]}