{"text": "Keck Ich hab Dreck in meinem Wasserschwimmen, was ist das? Irgendeine Mücke oder so, Monarch S, Dance Game, ah ja, so Leute es wird heut mal wieder Zeit, die letzten China Chinesen Reserven müssen geflasht werden, moin Leute, ich komm nicht vor die Kamera, Sekunde, hier, ja, hallo, hallo, hallo, weiß gar nicht wie ich gescheit winken soll, so vielleicht, so, keine Ahnung, lull, so ich muss mal kurz die Kabel, das Kabel an der Kamera weg machen, das ist da ziemlich störend im Weg, so, so, so, so, und KS, kann der sich hier irgendwie hinsetzen oder so, so, ok, der ist schepp, so, hallo, hallo, hallo, hallo, hallo, hallo, hallo, hallo, habe ich unexpected zur Garage geguckt, habe ich gerade schon doch mal das 什ellawine gesch germsft, die zum Beispiel habe ich dieseा Teilzahnshür gelernt, monde hat immer eine constant, also, ja, ich dann bin aber dann flaschen bis dann endgültig Schluss ist mit China flaschen weil die neuen China-Chinesen-Geräte sind nicht mehr flashbar oder halt nur mit größeren Umbauarbeiten oder gar nicht mehr weil komplett anderer Chip. Keine Chance machst du nix. Moin Twitter, wat? Du hast die von Hammer noch da. Hast die auch geflasht oder nicht? Kleiner, mal kurz anderen Sound. So was. Hast du schon mal was von Yeelight geflasht? Nee. Yeelight. Kenn ich vom Namen her, sagt mir das irgendwas. Ich vermute mal die machen RGB, WLAN-Lampen und LED-Strips. Würde ich jetzt mal so vermuten vom Namen her, oder? Aber sagt mir jetzt, also der Name sagt mir was, aber so noch nix mitgemacht. Was war? Ich kann mich nicht erinnern. Habe ich heute irgendwas auf Twitter? Twitter geschrieben? Habe ich heute auf Twitter geschrieben? Nix, oder? Irgendwas auf Twitter geschrieben heute? Ach so, ja die Sache mit der 1&1 Rechnung. Die haben ja sogar darauf geantwortet, was ich besonders witzig fand. Das war ja nix Schlimmes. Aber es ist schon ein bisschen merkwürdig. Sie schreiben die erst vor einer Woche oder vor drei Tagen schreiben sie, ja Achtung, also Rechnungen kommen jetzt nicht mehr per Mail und heute kriege ich die Rechnung per Mail. Schon irgendwie ein bisschen widersprüchlich. Weißt du noch was du für letzte Weihnachten sin via LEDs genommen hast? Ja, da müsste ich nachgucken. Das Problem ist, ich bin jetzt aktuell Amazon nur eingeloggt auf meinem Handy und mein Handy ist gerade da. Da kann ich nicht draufgucken. Das Wetter eskaliert. Ja, deswegen habe ich Themenanlage an. Ich überlege gerade, was war das denn? Das waren irgendwelche irgendwas mit Fairylight oder so hießen die Dinger. Irgendwie Fairylight, LED, RGB oder so. Sowas da in der Richtung war das. Ich kann jetzt leider nicht nachgucken, aber sowas war was ganz billiges. Es waren auf jeden Fall nur 50 LEDs, glaube ich, 50 LEDs für einen Meter. Also die waren relativ dünn bestückt, was halt den Vorteil hatte. Du konntest die ganz gut wo lang legen, ja zum Beispiel auch in Weihnachtsbaum. Also damit den Weihnachtsbaum so voll zu machen, musstest dir irgendwie 30 solcher Ketten kaufen. Für den Weihnachtsbaum und wie gesagt Treppenbeleuchtung habe ich damit gemacht. Ja, ich glaube sowas hier in der Richtung war das. Allerdings halt nicht einfarbig, sondern RGB. Wie das die coolen Leute sagen. Müssen wir mal gucken, weil die sind ja auch nicht alle richtig steuerbar. Ich muss nachgucken. Keine Ahnung, kann ich nicht machen gerade. RGB, Weihnachtsbaum, ja klar. Meine LED-Ketten für den Weihnachtsbaum sind seit Jahren schon wie LED gesteuert mit RGB. Mein Weihnachtsbaum ist 2022. Razor Templates, na ja, ich persönlich mag es nicht sonderlich, muss ich ehrlich sagen. Und Blazer ist ja quasi Razor Templates. Halt im Browser, also ich mag ich persönlich mag es nicht sonderlich. Wenn man aber.NET Server-Site-Rendern machen will. Nicht Strips, sowas hier habe ich für Weihnachtsbaum. Guck mal, das sind keine Strips. Das sind, die sind nur an so dünnen Drähten dran. Ich weiß nicht ob man das hier irgendwie erkennt. Das sieht man hier gar nicht richtig. Guck mal, das sind keine Strips, die sind die LEDs, sind an so dünnen Drähten dran und dann ist einfach so ein, ja was ist denn das? Wahrscheinlich Billig-China-Chinesen-Heißkleber oder so, der da drum gemacht ist. Nee, nee, das sind keine Strips. Ja, also wenn du.NET Server-Site-Rendern machen willst, dann kommst du ja um Razor Templates nicht wirklich rum. In beschränkter Maße zu benutzen, warum nicht? Aber ich mache eigentlich immer nur die Kombination reines RP-Backend und dann irgendeine reine Klein-Site-Anwendung. Wenn du jetzt natürlich irgendwas hast, was auch von der Suchmaschine gefunden werden soll, dann ist es wieder was anderes. Wobei selbst dann würde ich wahrscheinlich keine Razor Templates nehmen, sondern irgendwas anderes Server-Site-Rendering-mäßiges, was zu meinem Frontend-Framework passt. Ja, Blazer ist immer noch der heiße Scheiß bei Microsoft. Die ganzen neuen Sachen, die bei ASP.NET reinkommen, sind irgendwie 80% Blazer-Kram. Ich persönlich, wie gesagt, habe ich keine Ahnung. Was ist denn das für eine komische, was ist denn das für eine komische Url? Piped. Das ist definitiv nicht meine YouTube Domain. Das replacet diese Seite, oder? Keine Ahnung. Also die haben total viel neues. Ich bin aber kein Fan von Blazer. Ich finde für WebAssembly eignet sich das so in der Art und Weise nicht richtig. Die laden ja auch die komplette Runtime runter, anstatt das zu kompilieren und dann jittert das nicht mal richtig. Das ist ganz, ganz komisch. Die letzten Reserven, ich habe nicht mal viel. Ich habe von den Dingern hier, habe ich noch, also hier da, die da, habe ich noch keine Ahnung. Also ich habe insgesamt vier Stück. Jetzt noch zum Flaschen. Drei im Schrank, eins da. Eines ist hier abgeraucht, eine liegt noch da hinten. Danach ist weg. Aber das reicht ja auch an Steckdosenleisten. Wir brauchen nicht jeden Tag neue Steckdosenleisten. Aber ich habe mir gedacht, solange wir die jetzt rumliegen, es wird mal Zeit, die langsam aber sicher zu flaschen. Übrigens, Leute, jetzt wollen wir gerade dabei sein. Ich muss euch mal was zeigen. Warte mal, ich mach mal kurz, mach mal kurz. Big Gatschi-Buzz. Schaut mal. Schaut mal, guckt mal. Ich mach mal kurz, ich mach mal kurz den Keks weg und den Shelley weg und das Ding weg. So, schaut mal, ich bin, glaube ich, der Einzige gerade auf der Welt, der noch zwei Raspberry Pi 4s rumliegen hat. Danach noch im gescheiten Gehäuse. Ich habe noch zwei Picos und noch zwei Zero Ws, äh Zero 2 Ws. Also ich bin da noch gut ausgestattet. Ansonsten ist es ja gerade schwierig, was zu kriegen. Der muss irgendwie hier hinten in der Ecke, in die Ecke, sodass man sieht. Sieht man den? Jawoll, sehr gut. Lenkt nur minimal ab. Aber irgendwie so, so kommt der in die Ecke. Der muss irgendwie zugucken. Was liegt denn hier eigentlich alles für einen Crap rum? Weg. So, hier guckt ihr jetzt. Ein Dreier habe ich auch noch irgendwo. Keine, weil man nicht weiß, ob die flashbar sind, es sei denn du findest die User Bewertung, die sagen, dass die explizit flashbar sind innerhalb der letzten paar Wochen noch. Prinzipiell kann man da aktuell nichts empfehlen. Die hier habe ich mir auch schon gekauft vor, ähm, man sieht doch auch schon ein bisschen staubig. Die habe ich mir auch schon gekauft vor fast einem Jahr oder so. Und nicht verwirren lassen, weil da Hammer drauf steht. Das hat mit Hammer so gut wie nichts zu tun. Das sind China-Leisten. Exakt die gleichen, die früher Gosund verkauft und die dann sonst wer verkauft. Das ist alles China-OEM-Krempel, den die weiter verschachert haben. Wenn die Sachen schon direkt mit TASMOTA verkaufen, ist nicht schlecht. Das war der Vorteil, die war günstiger. Und es sind auch nur 3 Stecker. Ich finde 4 Stecker ist so, 4 Stecker und 4xUSB ist so der, wie sagt man so, der sweet spot. 3 Stecker sind ein bisschen wenig, aber auf jeden Fall besser als China-Chinesen Cloud Crap. Die andere Alternative wäre irgendwelche Lidl Zigbee Steckdosen leisten. Ja, ne November habe ich die. Woher weißt du, wann ich die gekauft habe? Kein Quatsch. Storm of Nemesis, danke für den Sub. Wofür schlecht man Steckdosen leisten? Dass man sowas hier machen kann. Dass man ein Webinterface hat, wo man dann Sachen an und ausschalten kann. Ok, das ist jetzt mein Luftqualitätssensor, der war jetzt ein schlechtes Beispiel. Der da vielleicht. Ja guckt, dann hat man zum Beispiel sowas hier. Da hat man ein Webinterface, wo man die Sache an und ausschalten kann. Ich schalte es jetzt nicht an und aus, weil ich nicht weiß, welche Steckdose das ist. Ich glaube, das ist der Heizlüfter bzw. Ventilator im Bad vermute ich mal. TASMOTA Version uralt. Nee, das ist die für 3D-Drucker glaube ich. Guck mal, TASMOTA Version uralt. IP-League, oh nein. Leute, hackt mich nicht. Hackt mich nicht. Trotz IP-League. Seid nett, Chat. Ich meine, ihr seid wahrscheinlich eh schon drin. Ja, die TASMOTA Version ist uralt, so der Vorteil ist folgendes. Ich werde es jetzt nochmal kurz erzählen. Wer hat den gefragt? Wo ist es denn? Hier, also es hat mehrere Vorteile. Normalerweise, guck mal hier, zum Beispiel dieses Teil. Das ist ein bisschen mitgenommen, ich habe es hier gerade liegen, deswegen zeige ich es jetzt nochmal. Zum Beispiel dieses Teil hier. Ja, das ist eine Steckdoseleiste oder, warte mal, ich habe hier glaube ich noch ein besseres Beispiel, irgendwo rumfliegen. Nee, egal. Also sprich, guck mal, das ist eine Steckdoseleiste mit, kann den Strom messen, so in beschränkter Maße sagen wir mal, wenn China Zeug so genau ist, das nennt. Kann es Strom messen, hast zwei Mal einen ausgenommen, hast zwei Stecker, leider hier kein USB. Warum ist die so mitgenommen? Moment, ich mache mal kurz das Bild ein bisschen größer. Ach so, ich muss ja noch das Licht anmachen, ich habe gar nicht das Licht an, wartet mal hier. Ja, Chet, was sagt ihr? Mit Ringlight oder ohne Ringlight? Mit, oder? Mit ist auf jeden Fall besser, dann erkennt man besser was. Ich denke mal, obwohl es aktuell halt auch noch schön hell ist. So, also guckt mal, die sieht halt noch ein bisschen mitgenommen aus hier, ihr seht es innen drin und ihr seht es auch hier noch. Vielleicht erinnert sich der ein oder andere, guckt euch mal das hier an, vielleicht erinnert sich der ein oder andere, das war das Ding, was wir im Stream mal aufgebrochen haben mit dem Schraubendreher, um an den Chip zu kommen, was gar nicht notwendig gewesen wäre, weil ich festgestellt habe, hier unten drunter ist eine Schraube, um das Ganze aufzumachen. So, und der Vorteil, wenn du so ein Ding hier hast, geflasht, oder wenn du so eine Steckdosenleiste hast, geflasht, versus Stock mit China-Firmware ist, du brauchst keine China-Chinesen-App auf deinem Smartphone, um das Ganze zu benutzen. Du kannst es einfacher in deine Heimautomatisierung integrieren, weil das normale Standards unterstützt, das hat HTTP-Schnittstelle, das hat MQTT-Schnittstelle, du kannst es generell über ein Webinterface steuern, was du normalerweise auch nicht machen kannst. Und im Zweifelfall hast du sogar neue Funktionen, du kannst die Automatisierung hinterlegen, wenn du es direkt da drauf machen willst. So, keine Ahnung, morgens um fünf einen ausschalten, das Motor lässt sich ja auch beschränkt scripten. Also es ist eigentlich nur von Vorteil im Vergleich zu... Achso, ja und das wichtigste habe ich ganz vergessen, keine China-Chinesen-Firmware, die nach Hause funkt, falls sie das macht. Wahrscheinlich macht sie das. Das beste was man machen kann ist, WLAN-Geräte zu flashen. Bisschen Asynchro in die Kamera, guck mal hier. Na ja, passt halbwegs. Weiß nicht warum, vielleicht falscher Codec eingestellt oder so. Weiß nicht. So und deswegen flasht man Steckdosen, weil man ja kein Noob sein will, der den Chinesen Zeug heim schickt. Ne? So siehts aus. Deswegen wird der Kram heute geflashed, wir müssen jetzt erstmal den Raspberry Pi Blatt machen. Ich glaube wir nehmen den hier, weil, Achtung, da ist glaube ich unser Zappix drauf, an dem wir irgendwann mal weiter bauen wollten. Und wenn ich den lösche, dann ist... Moment, der Zappix ist da drauf. Ich könnte einfach, könnte einfach die SSD nehmen per USB und dann die flashen. Wobei scheiß drauf, ich nehme den Raspberry Pi. Ich nehme den hier, da ist eine SD-Karte drin und dann ist gut. So machen wir das. Die WLAN-Sachen sind gar nicht schlecht. ZigBee-Sachen sind in der Regel, je nachdem was es ist, bisschen teurer, aber nicht so krass wie Z-Wave. Und haben bei weitem nicht die Funktion, wie das geflashte WLAN-Gerät mit Tasmota hat. Kann man machen. Aber ich habe zum Beispiel noch keine gute ZigBee-Steckdosenleiste gefunden mit 4x USB und 4 Steckern. Oder am besten, wenn es an mir geht, dürfte es theoretisch auch noch ein 5. Stecker sein. Hätte ich auch keine Schmerz mit. Platz wäre ja gewesen, aber die Chinesen haben sich gedacht, ne, das wollten wir nicht. Ja, kann man auch machen. Ja, NFC-Tax bzw. RFID-Tax sind extrem underrated. Sind das normale Werte für PC mit zwei Monitoren? Chandler, ich klick von dir keine Links im Stream an, wenn ich nicht weiß, was es ist. Warte mal. Sind das normale Werte für zwei Monitoren? Ok, das ist tatsächlich country bait. Das ist ein richtig echter, normaler Link. Ok. Ähm, also. Sind das normale Werte? Na gut, Energie total. Das ist ganz schön viel. Was? Das glaube ich nicht, dass du... Das ist ein bisschen viel? Was hast du da dran hängen? Na gut, Moment. Today. Na, knapp, knapp ein Ampere, ok, aber. Na, das passt doch. 193 Watt. Das kann doch sein, je nachdem was du für Monitor hast, aber für normale Monitore ein bisschen viel, aber ja, möglich, ja. Echt? Wirklich? Gar keine Absicht? Habe ich gar nicht geplant. Hat sich einfach so ergeben. Patrick, du hast den Chat verwirrt. Guck mal. Hier bist du hellgrün, da bist du dunkelgrün. Und es ist nicht, weil ich es irgendwie markiert hätte oder so. Das ist, weil Twitch der Meinung war, hier musst du einmal hellgrün sein, einmal dunkelgrün. Oder sagen wir normalgrün und hellgrün. Weiß, war wie gesagt überhaupt nicht geplant. Bei mir auf dem zweiten Monitor sind die Farben auch normal, aber hier in meinem Chat nicht. Was auch immer. Ja, also, wie gesagt, also ich habe diese Steckdosen, ach nicht die da. Diese Steckdosenleiste war ungefähr in einem Jahr gekauft. Kann man die noch finden bei Amazon? Ja. Dieses Teil hatte ich mir damals irgendwie im 5er Pack oder so gekauft. Und jetzt bin ich mal gespannt, ob die noch flashbar sind. Die müsste noch flashbar sein, weil ich habe aus diesem 5er Pack ja schon welche geflashed und die gingen. Die Frage ist halt eher, ob das aktuell noch geht. Und da würde ich mich nicht drauf verlassen. Sprich, wenn ihr das jetzt seht im Stream. Neueste. Wenn ihr das seht im Stream, nicht unbedingt kaufen, einfach weil man sieht, dass es im Stream flashbar ist. Also ich weiß nicht, ob die aktuell noch flashbar sind. Die sind schon fast ein Jahr alt. Alternative Firm war flashbar, 30. Juni. Ja neun, die Steckdosenleiste bekommen gibt immer noch mit Tuya Convert. Ja wir machen das jetzt auch mit Tuya Convert, weil ich habe keinen Bock den Kram aufzuschrauben oder sowas in der Richtung. Und siehst du, das ist was, was mich standardmäßig schon etwas, wie soll ich sagen, misstrauisch machen würde. Wenn ich standardmäßig von überall auf der Welt meine Steckdosenleiste daheim schalten könnte. Das bedeutet nämlich, die China-Chinesen haben quasi jetzt einen VPN bei euch ins Netzwerk daheim. Ich weiß nicht, ob man das haben will. Und es ist kein richtiges VPN, aber naja, also man könnte es als Zwischenhop verwenden. Also sprich, allein schon dadurch, dass man mit der App die Steckdosenleiste schalten kann, ist schon mal irgendwas, irgendwas bisschen schäpp. Ich mein, in Wirklichkeit wird es wahrscheinlich so gehen, hoffe ich mal, dass die Steckdosenleiste sich zum Server verbindet und auf dem Server geschaltet wird bei den China-Chinesen und dann die Steckdosenleiste das quasi subscribt hat über Websocket oder sowas. Ich gehe nicht davon aus, dass es sich wirklich verbindet auf eure Steckdosenleiste, aber man weiß es nicht. Und die Möglichkeiten sind auf jeden Fall da und das ist ein weiterer Grund, warum ich den Kram immer flashen würde. Du bist direkt im China-Botnetz, ja klar. Tasmota möglich, ok. Das finde ich schon mal gut, dass so viele Leute schreiben. Anscheinend kann man das Ding immer noch Tasmota flashen. Was ja auch so gut wie der einzige Verkaufsargument ist. Ohne das Tasmota-Flashen würde ich den Kram im Leben nicht kaufen. Die Gose und App exposed auch deine Public-IP. Ist wirklich so? Ja gut, bei dem China-Kram würde ich mich echt nicht wundern. Achja, wo wir gerade dabei sind, dem China-Zeug nicht trauen. Ich zeige euch mal was. Zeige euch mal was. So viel zu dem China-Kram Misstrauen. Seht ihr das da? Verleuchtet euch da was auf. Außer dass es dreckig ist. So und die lag im Keller. Man sieht das ja auch, die ist etwas mitgenommen. Die lag im Keller irgendwie zwei Jahre oder so. Aber der Chat ist der Meinung, ist alles gut, die Steckdosenleiste war es nicht. Das lag am Netzteil, was da drinnen gesteckt hat. Also wenn ich dem Chat vertraue, weiß ich noch nicht so genau ob ich das machen sollte in dieser Frage. Wenn ich dem Chat traue, dann ist mit der Steckdosenleiste alles in Ordnung und die geht immer noch. Das war angeblich das Netzteil sagt der Chat. Und der Chat hat ja bekanntlichermaßen bei sowas recht. So ich mache das Ding mal wieder weg. Eigentlich liegt das Ding schon auf dem Müll, aber ich habe es jetzt rausgeholt wieder. Gut also ich würde sagen wir schnappen uns mal den Raspberry Pi, wir machen mal kurz die Leiste hier weg, schnappen uns den Raspberry Pi, ziehen die Micro SD Karte raus und flashen die mal. Und dann machen wir den ab und schließen das Ding da an. Habe ich noch den aktuellen Raspberry Pi Image da drauf? Neues YouTube wie der Twitch Chat fackelt meine Bude ab. Das müsste schon ein bisschen clickbaitier sein dieser Titel. Ähm ich habe ein Problem. Ah ne habe ich nicht. Ich habe noch einen gefunden guck mal. Gibot Cardreader mit der Krone. Normalerweise verwende ich einen anderen, aber ich weiß nicht wo der gerade steckt. Der müsste auch hier liegen aber macht er nicht. Machs gut Stripes. Orchester ruft. Pippo Jam. So flashen wir das Ding mal. Blllllllllllllllllll Windows Sound. Alter warum steckt man USB? Prinzipiell falsch rum rein. Was ist es mit dem USB? Nein nicht boot. Das soll an die VM durchgereicht werden. Nein. Äh nein. Ja. Schon besser. Schon besser. Ja weil es USB C ist wahrscheinlich. Die Steckdose fängt doch kein Feuer nur weil sie flasht. Die Steckdose fängt vielleicht Feuer weil China Chinesen Zeug ist. Aber ich muss euch ehrlich sagen ich hatte bis jetzt noch nix was abgeraucht ist. Wenn wir mal davon ausgehen dass die Steckdoseleiste in Ordnung ist weil der Chat das sagt und wenn der Chat das sagt muss das ja so sein. Also mir fällt jetzt so spontan nix an was mehr abgeraucht ist. So flashen wir den Karma. Also auf gehts. Raspberry Pi Imager. Nee Pi Imager. Imager. Pi Imager. Meine Güte. Kurz gucken ob es Updates gibt. Schnell schnell checken. Zeig mal her. Updates. Updates. Updates. Nein nicht ok. Hier auch nicht oder ich kann grad nicht tippen. Es ging nicht ums flashen. Es ging halt darum dass ich dem China Zeug nicht traue. Ja da hast du recht dem China Zeug kann man auch nicht wirklich trauen. Es ist halt so. In dem Fall ist es halt ein deutscher Resale. Ja es ist aber immer noch China Chinesen Zeug. Und da können noch so viele CE Zeichen und sonst was drauf sein. Das interessiert die Chinesen ja nicht. Die drucken das halt drauf und gut ist. Ich hab keine Ahnung ehrlich gesagt was davon geprüft werden muss und was nicht. Aber wenn man bei express kauft ist wahrscheinlich eh verloren. Wenn man bei Amazon.de kauft sollte das eigentlich alles den Vorgaben entsprechen aber ob das jemand kontrolliert glaube ich nicht. Nee das geht nicht mit Arduino und Co. Das ist es ja gerade. Wenn es mit Arduino und Co gehen würde würde ich es mir mal angucken aber so verstehe ich den Sinn von Carbo nicht. Longboard ist doch nicht mehr Hipster. Longboard war 2011 oder so Hipster wo Dana und Unge Longboard Tour gemacht haben. Wie hieß der dritte Typ im Bunde damals? Ich hab das nie wirklich ausführlich geguckt aber ich war noch zu dritt oder? War das Julien Bam? Nee oder? Cheng das kann sein. Ich weiß zwar nicht wer Cheng ist aber doch was sah asiatisch aus der dabei war. Ich kann mich noch dunkel dran erinnern. So also dann flashen wir den Raspberry Pi jetzt mal. Imager. Gib ihm. So Choose OS. War das so? An den kann ich mich da gar nicht dran erinnern. Wie gesagt ich hab das aber auch nie sonderlich ausführlich geguckt. So Choose OS was wollen wir haben? Äh ehrlich gesagt ich nehm ein 32bit Leute wisst ihr warum ich ein 32bit nehm ich bin mir nicht sicher ob Tuya Convert komplett mit 64bit klarkommt. Sollte theoretisch aber es gibt ja keinen wirklichen Grund es zu machen mit 64bit in dem Fall. Also Raspberry Pi OS Lite 32bit 32G SSD Riot was? Ach Moment Moment Edit Settings jaja. Enable SSH. Bestes Passwort Leute. 1 2 1 2 3 4 5 6 Best Practice Passwort da kommt ihr nie drauf. Ok Riot. Yes. Gib ihm. Du benutzt seit 3 Jahren Arch als Main OS einzig wahre. Die komischen Flex in Commands aus deiner History machen mir Angst. Welche Flex denn? Was denn wo denn? Hier oder was? Das da? Oder das da? Wieso? Ganz normal. Achso ihr Devil ist weil ich Git Repos habe. Das muss man machen. Ja aber Pacman kann man sich glaube ich einen Y sparen. Ok die Micro SD Karte ist High Speed wie es aussieht. Warum 2x Y hat glaube ich keinen tieferen Sinn. Ich glaube du kannst sogar 3x Y machen und es passiert nichts. Einfach 69xY. Mal mal ausprobieren ob das funktioniert während er gerade verified. Funktioniert guckt. 669xY. So muss das sein. So wir können es removeen vom Card Reader. Da bin ich froh dass er mir das sagt. Alles klar. So dann machen wir mal den Raspberry Pi an und installieren den ganzen Flashing Rahmen drauf. So ich mach mal groß dass ihr was seht. Erste Mal Micro SD Karte. Wem passiert das auch immer? Ich mach die eigentlich immer erst mal verkehrt. Nein. Also wir brauchen auf jeden Fall einmal Netzwerk. Netzwerk und wir brauchen Strom für den Raspberry Pi. Also das da. Hab ich da noch Platz für die Steckdosenleiste? Ich hoffe mal weil es wird ein bisschen eng. So und er ist an. Er funktioniert. Jetzt muss ich nur mal kurz auf meinen Router schauen. Was das Ding für eine IP kriegt. Router muss ich gucken. Router. Um die Cisco Fans glücklich zu machen. So schauen wir mal. Was für Chinesen will Max flaschen? Du meinst warum ich LS AERT mache oder so? Äh das kann ich dir sagen. Das ist all reverse Time und human readable size. Das hat schon seinen Sinn. So Raspberry Pi 6049. SSH, Pi, yes. Ich hoffe das ist der richtige. Uptime. Ne das ist nicht der richtige. 141 Tagen Uptime. Das kann nicht der richtige sein. Außerdem ist das Netz komplett falsch. Wo ist er denn? Wo ist er denn? Kein Raspberry Pi zu sehen. Switch ist an. Switch hat Link. Äh. So. Ich glaube der ist. Ich glaube der hat ein Problem. Guck mal. Kackel. Ich glaube der hat ein kleines Problem. Der leuchtet nicht mehr. Der geht immer an zwischendurch und dann geht der wieder aus. Ist die SD Karte im Arsch? Normalerweise müsste der jetzt blinken aber der blinkt nicht. Das ist definitiv irgendwas nicht richtig. Der müsste jetzt eigentlich booten. Sollte ich vielleicht nochmal flashen? Ist das nicht geklappt? Zieh mal Strom ab und wieder dran. Nein das kann ich mir nicht vorstellen. Strom ist ja dran. So Strom ab. Strom dran. So. Dass er am Anfang grün ist ist ja normal. Und jetzt müsste er eigentlich anfangen zu blinken gleich. Vielleicht muss man den Nintendo Trick machen Leute. Rausziehen und mal pusten. Der blinkt nicht. Das ist äußerst verdächtig. Das ist äußerst verdächtig dass der nicht blinkt. Moment hä? Was ist das jetzt? Nee der kann sich nicht entscheiden was das ist. Ich guck mal ob man jetzt irgendwas DHCP-mäßiges sieht. Nö. Nix, nix DHCP-mäßiges. Ich schließe da doch kein Monitor an. Das hat gefällig zu booten. Ok ne Leute ich glaube mit der SD-Karte scheint irgendwas. Guck jetzt ist er wieder. Ich mein dass der das erste mal Boot ein bisschen braucht ist klar. Der resized ja die SSD. Das ist normal. Aber er holt sich keine DHCP-Adresse. Das stimmt schon mal. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. In dem Moment wo ich sag funktioniert's, na soll mir recht sein, so Uptime, eine Minute das ist auf jeden fall der richtige. So also, sudo, wir machen erstmal ein paar Updates, ja WiFi ist nicht an das ist mir auch klar, WiFi brauchen wir gleich noch für was anderes. Also Ziel ist es diese Steckdosenleiste zu flashen und danach die drei andere die ich noch hab. Upgrade. Das smarte Wasserkocher, du meinst das Ding was wir uns mal angeguckt haben, das war total unsinnig. Im besten Fall mach ich irgendeine Steckdosenleiste die ich schalten kann an Wasserkocher, Wasserkocher. Du hast es für 20 Euro im Sale bekommen, was ist das? Ein smart Kettel, also ein smarter Wasserkocher für 43 Euro und was genau machst du damit mit den Smart Funktionen dass sich das lohnt? Und noch viel wichtiger, geht das auch ohne China-Chinesen-Firmware bzw. geht das ohne China-Chinesen-App? Geht das irgendwie über Bluetooth oder Zigbee oder sonst was oder wie pairt man das ganze? Mit genau 80 Grad wäre ich vorsichtig bei dem China Zeug, bei China die nehmen es mit den Werten nicht so genau, also 80 Grad könnte auch 85 oder 72 sein. Ist Bluetooth, ok dann müssen wir mal gucken, dann müssen wir mal gucken, Github, Smart Kettel, da gibt es doch bestimmt schon. Smart Kettel BLE-Protokoll Reverse Engineering, aha, warum ist das archivet? Der hüpft schon wieder, der ist umtriebig, muss man sagen, der ist echt umtriebig was sowas angeht. Was hat er denn da schon wieder gestrickt hier? Guck mal, der unterstützt den Kram hier, was kann man damit jetzt machen? MQ hat das Home Assistant Integration, Patrick den Chinesen traue ich alles zu, boah da könnte ich mal eine Zahnbürste, das Ding brauche ich Leute, nächstes, das probiere ich mal aus, das ist doch bestimmt ein Arduino-Sketch oder sowas, was er hier am Start hat oder? Was, wait a minute, was ist das? Ah, da brauchen wir eine Kiste mit einem Bluetooth-Stick oder so, es ist schon mal interessant, weil, das Ding kann meine Waage und das Ding könnte auch meine Zahnbürste per MQTT auslesen. Why not? GitHub Oral-B Bluetooth, da gibt es doch bestimmt noch mehr, Toothbrushes Library, was nicht alles gibt. Get very useful and interesting information about your Toothbrush. Toothbrush CLI, na endlich. Toothbrush Oral-B AP, ja Leute, soweit sind wir, soweit sind wir schon, die Zahnbürste per Bluetooth, so Update ist gelaufen, Instagram haben wir noch ein paar Standard-Dinger, die wir bestimmt eh brauchen oder B-Top, wie die coolen Leute jetzt verwenden, Leute B-Top gibt es beim Raspberry Pi nicht, Sachen gibt es, B-Top ist für die richtigen Hacker-Mans, Leute. Cool, Leute verwenden B-Top, H-Top, aber ganz ehrlich, ich verwende eh zu 90% immer noch H-Top, gerade weil das auf den meisten Server-Kisten sogar mittlerweile drauf ist. Gatschi-Top, Moment, also T-MAX geht, brauchen wir auf jeden Fall für irgendwelche Auslastung oder so, aber ich glaube das passt schon. So, und dann werden wir den Raspberry Pi gleich rebooten, achso, Moment, ich hab das allerwichtigste Programm vergessen. Der Chainlaw mag den Windows-Taskmanager, hat hier jeder seine Vorlieben, also mir ist H-Top lieber, was wirklich cool ist beim Windows-Taskmanager, was ich unter Leidung auch gerne hätte, ist GPU-Auslastung von Prozessen, das wäre echt nicht verkehrt. KQS-Service, was hat das damit zu tun? Was wollte ich jetzt machen, Leute, jetzt hab ich Chat gelesen, das hab ich vergessen, ich wollte rebooten, nee, wollte ich machen. Im Zweifelsfall rebooten, keine Ahnung, aber ein wichtiges Programm fehlt noch, stimmt, stimmt, ihr habt recht, ASCII-Quarium fehlt noch, das muss drauf. Ja, aber ich mein, integriert in irgendeinen standardmäßig vorhandenen Taskmanager, ja, also wenn H-Top beispielsweise GPU-Sachen auch anzeigen könnte, das wäre schon cool. Jep Hahn, auf Raspberry Pi Reboot, gib ihm. Leute, morgen Frankfurt, Frankfurt, Iron Maiden Legacy of the Beast, morgen Abend 18 Uhr, Bankbang, da, bin ich morgen Abend, im Waldstadion, wobei, das heißt ja nicht mehr Waldstadion, das heißt ja jetzt Deutsche Bank Arena, da bin ich mal wirklich gespannt drauf, ob die Alen Säge das noch hinkriegen, ich war vor zwei Jahren, nee, vor Corona war das, muss dann schon vor drei Jahren oder vier Jahren gewesen sein, da war ich schon mal in Frankfurt, das war in der Messerhalle, da war der Sound aber richtig kacke, du hast nix verstanden und da bin ich mal morgen gespannt, Banger, sehr gut, geadded, Caelor hat zumindest guten Emote-Geschmack, das steht glaube ich außer Frage gerade, schon viele gute Emotes vorgeschlagen, was ist denn jetzt schon für ein Problem, warum, Raspberry Pi, warum kommst du nicht drauf, was ist denn das, was hat der, was hat der für Probleme, was hat der für Schmerzen, ich mein normalerweise, wenn ein Raspberry, der ist einfach komplett aus wieder, sag mal, ok Leute, ich nehm mal ein anderes Netzteil, eigentlich reicht das Ding für den Raspberry Pi, ich nehm mal das offizielle Raspberry Pi Netzteil, wenn ich das da irgendwie rauskrieg so und wenn ich hier noch, jetzt hab ich halt keinen Platz mehr hier dafür, ich hab da keinen Platz für, ich muss das hier nehmen, geht nicht anders, aber ganz davon abgesehen, einfach zum starten reicht das, ich mein das ist kein 3 Ampere Netzteil, das ist nur ein 2 Ampere Netzteil, aber das reicht normalerweise, dicke, auch für den 4er, ich mein das geht ja nur ums booten und sonst nix, ok jetzt leuchtet er wieder, schauen wir mal, ja ich hab keinen Platz hier, ich brauch die da, die Steckdose hier, die einzig freie Steckdose brauche ich für die Steckdosenleiste, außen ist hier oben das Licht dran, deswegen ich könnt durchaus mal ne Steckdosenleiste gebrauchen mit, der schaut wieder aus, fuck, ich glaub es reicht doch nicht, was machen wir denn da jetzt, wenn es nicht bootet gescheit, ja dann muss ich das doch rausziehen, man soll ich mal mit den USB Stecker hier unten vielleicht probieren, geht das ja besser, schauen wir mal ob es jetzt geht, der Kram bootet einfach nicht, da ist doch irgendwas im Arsch, ne jetzt bootet er, ok, er blinkt wie verrückt, weiß nicht ob ihr das seht, hier müsste es, was ist denn das für ein, alter was ist denn mit dem los, vielleicht hat er sich jetzt die SD Karte verabschiedet bzw. vielleicht hat er jetzt Probleme gehabt weil er ein paar mal abgekackt ist beim booten, das verkraften die nicht so gut, ok Leute ich warte jetzt mal, noch mal, ich warte jetzt noch mal kurz und wenn es nicht geht, flash ich den nochmal neu, weiß nicht was das für ein Crap ist, mal gucken was er jetzt macht, du bist wieder hellgrün ja, das switcht, ich mach das, ich setze das im flashen, ich setze das in diesem Flash Menü, kennst du eine gute Smart Steckdose mit der ich mal einen Stromverbraucher machen kann, naja die China Chinesen Dinger, die ich hab, die meisten können das, also die hier kann das zum Beispiel auch, die Gosund Steckdosenleiste, aber die Sache ist halt, du musst welche finden die noch flashbar sind, ansonsten, ansonsten, nee, nee vergiss das, ich wollte dir ein Z-Wave Gerät vorschlagen, das bringt dir aber nix, weil du hast ja kein Z-Wave, ok, das Ding ist im Arsch, der bootet nicht, ich ziehe jetzt noch einmal den Stecker raus und mach den Stecker nochmal rein und dann schauen wir ob es jetzt funktioniert, weil nicht flash ich nochmal neu, weil wir haben nichts großartig gemacht, nee, der macht einfach gar nichts mehr, der hat einfach keinen Bock zu booten, der ist RIP komplett, F, ok jetzt blinkt er mal kurz, jetzt blinkt er, ok, der sieht aus als würde er booten gerade, WTF, was ist denn mit dem Teil los, vielleicht ist die SD-Karte auch im Arsch, ich weiß es nicht, keine Ahnung, ich fasse es jetzt nicht an, ich lasse es einfach so drauf, es funktioniert weiter, so, also SSH drauf verbinden, 123456 Massive Passwort, meine Stream Vorschau ist gerade abgekackt, nee, scheint noch alles zu funktionieren, es lebt, genau, ja also ich hab das allerwichtigste vergessen zu installieren, Ascii-Quarium, falls das gibt, gibt's gar nicht, gibt, gibt kein Ascii-Quarium, aber wenigstens C-Matrix hoffe ich mal, C-Matrix, C-Matrix installiert, gut, gut, ah yes, jetzt haben wir schon mal, gut, das ist gerettet, wenigstens ein ordentliches Programm drauf und auch ganz wichtig Hollywood, falls das gibt, Hollywood, Hollywood-Pommer auch, Hollywood ist auch Pog, wenn ihr mal wieder, also wenn mal euer Chef ins Büro kommt und ihr wollt wieder richtig oberkrasse Hacker-Man aussehen, dann müsst ihr Hollywood starten, passt mal auf, ich zeig euch das gleich mal, auf dem Raspberry Pi zu erzählen ist reichlich sinnlos, das würde ich eher lokal installieren, aber ok, aber wenn wir schon dabei sind, unsinnige Sachen zu interessieren, braucht es dann für Pakete vieles, weil es vieles unter der Haube aufruft, guck mal wie lahm die SSD ist, nicht die SD, die Micro-SD, Pearl alles drauf, Python, Pearl, Ruby, Beemon, das für die Bandbreite, so passt mal auf Hollywood, richtiger Hacker-Man Kram, yes, so, also wenn ihr mal wirklich wie im Film aussehen wollt, dann einfach Hollywood starten, heißt nicht umsonst so, no more secrets, das habe ich glaube ich auch auf dem Host drauf, das habe ich auch drauf, no more secrets, ne habe ich nicht installiert, so, so muss das sein, so jetzt haben wir genug uns wie die krassen Hacker-Mans gefühlt, jetzt brechen wir mal ab, alles klar, so jetzt machen wir was sinnvolles, das was wir nämlich eigentlich machen wollten, nehme ich den ganzen Krempel flaschen, also brauchen wir dieses Tulia, ne nicht vom Hüpfer, das da, Tulia Convert, wenn ich das richtig in Erinnerung habe, muss man das erstmal klonen, shit, clone, ah ich weiß was ich vergessen habe, Bash Completions habe ich vergessen, falls es nicht schon drauf ist, ist schon drauf, cool, git clone, Tulia Convert, so und dann müssen wir uns die Anleitung angucken wie das funktioniert, install prerequisites, second device, oh da brauche ich gleich, muss ich gleich rüber nochmal ein iPad holen, sonst funktioniert es nämlich nicht, so Tulia Convert, install prerequisites.sh, so während das installiert, Leute ich hole mal kurz mein iPad, er muss, als man die Geräte flaschen kann, muss man ein zweites Gerät im Netzwerk hängen, also ich bin back, so, was wir machen, hier steht doch im Titel, ich flasche meine restlichen China Chinesen Steckdosen Reserven die ich habe, danach gibt es nichts mehr, doch, doch klar, Bash Completions unter root an, so, da haben wir es, warum ist da ein Dockerfile drin, das brauchen wir nicht, wir installieren jetzt alles auf dem Raspberry Pi, also start flash, erstmal kurz überlegen, mache ich das jetzt gerade richtig, start flash, also da steht ja auch da, achso, Moment, bevor ich flasche sollte ich vielleicht mal das Ding auspacken und anschließen, also das Teil flaschen wir jetzt von Hammer, aber es ist nicht wirklich von Hammer, es ist ein ganz normaler China Chinesen Resale Ding, erstmal aufgerissen, elegantes auspacken, so, da ist es, exellent, warum gibt es danach nichts mehr, weil die meisten nicht mehr flashbar sind, die man heute kaufen kann, oder komplett einen anderen Chip drin haben, der gar nicht mehr Tasmota flashbar ist, ich meine Tasmota ist eine ESP-6860 ESP-32 Firmware, das heißt das läuft auf einem anderen Chip auch nicht, so, also das Ding werden wir jetzt flashen, ich bin mir nicht mehr ganz sicher wie es geht, wie man das Ding in den Flash Modus versetzt, aber ich glaube einfach anschließen reicht, also, was ich bei diesen Steckdosenleisten ganz cool finde ist folgendes, man hat vier normale Steckdosen, die man alle getrennt schalten kann, das ist schon mal nice, nicht wie diese billige Steckdosen, die es teilweise gibt, wo du alles nur auf einmal schalten kannst, der Schalter hier vorne kann mit Tasmota beliebig umprogrammiert werden, Tasmota kann ja bis zu, frag mich nicht, 25 verschiedene Funktionen für so Schalter, du kannst den Schalter programmieren auf Schalten einer der Liste, du kannst sagen Doppelklick schaltet, also einfacher Klick schaltet ein, Doppelklick schaltet zwei, Dreifachklick schaltet drei, Vierfachklick schaltet vier, habe ich noch nie gemacht, geht aber glaube ich, und dann kannst du USB schalten, allerdings USB kannst du nicht einfach schalten, USB kannst du nur alle vier auf einmal anmachen oder aus, was aber in der Regel reicht, also jeder von den 230 Volt Steckdosen kannst du einzeln schalten, aber USB kannst du alle vier nur auf einmal schalten, das wäre natürlich besonders hyper geil, wenn das irgendwie gehen würde, mit die hier auch noch einzeln anstrengen, aber ja, wir wollen es jetzt mal nicht übertreiben, so, ob das jetzt geht mit dem Knopf, ist mir eigentlich egal, also ich weiß es geht mit dem Knopf, man kann das einstellen, ist mir aber eigentlich egal, weil ich schalte das Ding eh nur über meine Home Automation, wo ich ein bisschen unschlüssig bin, ist was das da ist, das hat, guck mal, das hat da einen Knopf, den kann man drücken, und ich habe keine Ahnung, vielleicht ist das Wasser ablaufen oder so, keine Ahnung was das ist, eine Sicherung ist es auf jeden Fall eher nicht, so, dann wollen wir mal probieren das zu flashen, also von der Idee her sollte das jetzt folgendermaßen funktionieren, wir starten das Flaschen jetzt hier auf dem Raspberry Pi, schalten das Ding in den Flash Modus, dann sollte das hier blinken, unterschiedlich, und dann sollten wir auf dem Raspberry Pi sehen, ob er flasht oder nicht, das Ding ist, naja, was heißt, übelst groß, ja, übermäßig groß ist das nicht, man hier oben brauchst du alles, da unten brauchst du alles, hier könntest du fly eine extra Steckdose hin machen, aber ansonsten, ich meine, guck, du hast doch die größten Vergleich zum Raspberry Pi, so riesengroß ist das Ding, nett, was ist denn das, 30 Zentimeter oder so, also irgendwie so, das ist nicht größer als normale Steckdosenleisten auch, so, mal so machen, dass man das parallel zugucken kann, also, do you wish to terminate den S-Mask, yes, yes, mach, starting access point, so, jetzt muss ich mich mit meinem Tablet, jetzt muss ich mich mit meinem Tablet connecten, das mach ich jetzt, da lass ich euch nicht zugucken, connect any other device, mach ich jetzt, we trust flash, so, ich bin mit meinem Tablet connected, und jetzt, put your IOT device, ja, machen wir, also, einfach anschließen und hoffen, dass es flasht, noch machts nix, achso, press enter, ich presse mal enter, ich muss es wahrscheinlich lang gedrückt halten, ich halte mal lang gedrückt, jetzt blinkt es schnell, seht ihr das, jetzt blinkt es schnell, ich weiß nicht, ob man das erkennt, jetzt blinkt es schnell, und jetzt sollte es eigentlich, ne, ne, das hat nicht funktioniert, ok Leute, nochmal von vorne, raus machen, äh, der ist nicht im flash Modus, ok, nochmal länger gedrückt halten, jetzt blinkt es schnell, ah, ne, was, yes, yes, hat sich mein Tablet wieder ausgelockt, ah, jetzt hat es sich resettet, ok, jetzt hat es sich resettet, Mist, das hat nicht funktioniert, ich will abbrechen, please abbrechen, yes, yes, was jetzt, das funktioniert nicht, das funktioniert nicht, ok, ich erinnere mich, ich hatte es letztes mal auch Probleme mit den Dinger, die zu flashen, ich hatte es letztes mal auch Probleme, das zu flashen, das muss ich auch ein paarmal machen, ich bin mir nicht mehr ganz sicher, was das Problem war, ja, weil da auf Amazon was steht, heißt es nicht, dass jede Steckdosenleiste funktioniert, funktioniert nicht, normalerweise sollte der, ich reboote das Ding jetzt nochmal, ich reboote den Raspberry Pi nochmal, ich hoffe, dass der jetzt rebooted und mache die Leiste nochmal raus und wir schauen mal kurz, wie man das Ding, wir gucken mal, wir gucken mal kurz bei, ähm, dieser, das Motor Template Seite, Motor Template, Supported Devices, Kogeek, das da ist das im Original, glaube, na dazu steht nichts da, haben die vielleicht sinnvolle Sachen auf Amazon stehen, das Motor, was ist das für eine Antwort, jemand probiert, ob sich aktuell noch das Motor flashen lässt, die ist richtig gut, hält lange warm, alles klar, so pepega diese Amazon Rezession teilweise, also nicht Rezession, User, User, wie nennt sich das, FAQ Sachen, das Motor, ok, der hat aufgeschraubt, ok, der hat aufgeschraubt, das ist schonmal eher doof, das ist eher doof, sag mal, ein Raspberry Pi startet schon wieder nicht, was ist denn das, Alter, dieses Crap Teil, ich fass es nicht, warum buggt das so rum, was soll das hier, ich glaube, die SD hat irgendeinen Schaden, das ist auf jeden Fall nicht normal, der war schon im Flash Modus, hast ja auch gesehen, dann hat es hier umgeschaltet, aber nicht mal gebootet, also nicht mehr richtig gebootet danach, ey, der Raspberry Pi ist mega im Arsch, also nicht nur, dass aus irgendwelchen unsinnigen Gründen brutales heiß wird, obwohl nichts ist, aber jetzt bootet er, ok, die Logik verstehe ich echt nicht, jetzt bootet er anscheinend, soll mir recht sein, was war man da jetzt, also ich fürchte, die werden wir nicht geflasht kriegen, OTA, die letzte konnte man lustigerweise OTA noch flaschen, Raspberry Pi ist wieder da, also anscheinend ist nicht alles flashbar per OTA, selbst letztes Jahr nicht, ok, das start Flash, yes, yes, alles klar, so Tablet verbinden, ja connect any device, put your IOT device in auto config, LED will blink fast, jaja, das habe ich schon gemacht, das bringt nichts beim Restart, beim Restart geht es da nicht weiter, das ist an, ich weiß nicht ob ihr das seht, ich weiß nicht ob man das sieht, das ist grün, das ist grün, ne das grüne Licht erkennt man nicht genau, zumindest wenn ich das jetzt eine Weile gedrückt halte, dann blinkt das schnell, man sieht das, man sieht das echt nicht, das ist ziemlich, ziemlicher Müll, hier guckt mal, ne man sieht nicht das es blinkt, aber Leute glaubt mir es blinkt, das grün erkennt man nicht richtig, es blinkt schnell, also der ist auf jeden Fall im Flash Modus und das merke ich auch, weil jetzt restartet der und dann sagt er auch auto config is complete, was allerdings dazu führt, dass er sich nur rebootet und es da nicht weiter geht, das ist ziemlich blöd, man kann das Ding wahrscheinlich nicht flashen per OTA, ich habe die alle zeitgleich gekauft, eine ließ sich flashen und die andere die ich im Schrank habe habe ich bis jetzt nicht ausprobiert, aber anscheinend lässt er sich nicht flashen, ich höre es auch es rebootet und die Relays gehen an und aus und dann geht er in normalen Modus, also das sollte so nicht funktionieren, was genau bringt es eine Steckdosenleiste zu flashen, zum Beispiel dass du keine Smartphone App vom China Hersteller mehr brauchst oder die Chinesen sich auf deine Steckdosenleiste einloggen können und es hat auch weitere praktische Vorteile, du kannst es über ein Webinterface steuern anstatt mit der App, du kannst es per MQTT in dein Smart Home integrieren und allgemein lässt sich das viel besser steuern und ansprechen, Moment es hat was gemacht, hat es funktioniert, es geht einfach, man muss es einfach 10 mal probieren und dann gehts, easy, easy, flash Tazmota, yes, manchmal hilft es alles zu rebooten, alles zu rebooten und dann nochmal zu probieren und dann, do you want to flash another device, gerade nicht, no, gut, jetzt muss ich das Tazmota verbinden, das zeige ich euch nicht, weil dann würde ich mein WLAN Passwort leaken und das habe ich nicht vor, ich möchte mein WLAN Passwort nicht leaken, ich hoffe ihr versteht mich ja, Chat, please no disabo, jetzt muss ich mein Passwort eingeben, das ist ewig lang, das enthält Kekkel, das kann ich euch verraten, ja aber nicht, Kekkel und Koggers, aber anders geschrieben, so ich hoffe ich habe mich nicht vertippt, safe, jetzt gucke ich in meinen Router, ob ich die Tazmota Sachen sehe, IP DHCP Server, leases, aha, ich habe da 2 Sachen die in Frage kommen aber ich weiß nicht welche es ist, das da vielleicht, das da vielleicht, postchamp, also von der Adresse könnte es das durchaus sein, aber es antwortet nicht, ah easy, das ist das richtige, so gerade mein DHCP richtig benennen, passt, so also, gut so, Tazmota ist halt uralt, das müssen wir jetzt erstmal upgraden, aber das wichtigste, ich bin mir nicht sicher ob ich auf die Konsole gehen kann, doch ich kann auf die Konsole gehen, ist nicht Schlimmes, weil, wobei keine Ahnung, bin mir nicht sicher, nee ich habe extra WLAN gemacht, nur für den Stream, dann passiert nichts, schlimmste was ich leaken kann ist MAC Adresse vom Device und sowas und das ist egal, muss NTP Server setzen, NTP Server 1 1 2 2 1 6 8 60.1, weil ansonsten wenn, Leute falls jemand Probleme von euch hat, so mal als Tipp, wenn euer Tazmota richtig langsam reagiert, so wie meins jetzt, dann müsst ihr NTP Server setzen, guckt euch das mal an, wenn ihr nämlich kein NTP Server setzt, ich zeige ich dir gleich Major Laser, ich kann alles einzeln steuern, legen wir schon mal so hin, dass man es gleich sieht, irgendwie so, kann man mal kurz schauen, dass man es vielleicht ein bisschen, dass man das ordentlich sieht, aber erstmal muss mein Tazmota aufgehen, was es gerade nicht macht, solange kein NTP gesetzt ist, ist es richtig langsam, man muss NTP Server setzen, also wenn ihr auch das Problem habt, dass euer Tazmota mega langsam ist, dann NTP Server setzen, easy, das kann jetzt mal 1-2 Minuten dauern bis es aufgeht, alternativ Stecker raus, Stecker rein, wieso braucht der NTP, das ist eine gute Frage, keine Ahnung, Console, guck hier falsche Zeit, falsche Zeit, ich hoffe ich habe jetzt kein WLAN Passwort geleakt, sieht nicht so aus, also NTP Server, ein bisschen größer, dass ihr was seht, NTP Server setzen, NTP Server 1, NTP Server 2, NTP Server 3, ihr seht schon es lag drum, so und wenn jetzt der NTP Server gesetzt ist, Tazmota System Time, ich weiß nicht mal wieder, Tazmota Time, Tazmota Time, wie konnte man sich das nochmal anzeigen lassen, Show System Time, hast du Public NTPs geblockt, ja genau, genau das will ich haben, zeigt mir die Zeit an, alles klar NTP Server und jetzt haben wir 19.22.2022, 25.07., ja, vielleicht müsst ihr auch noch save machen, aber ne, warte mal, Tazmota save, aber normalerweise müsst ihr das nicht machen, weil ihr jede Sekunde automatisch, automatisch speichert die Fall mäßig, weiß gar nicht was der richtige Befehl zum speichern ist ehrlich gesagt gerade, na egal, müsst ihr nicht machen, so, jetzt Restart und dann soll es zumindest schneller sein, auch nach dem Reboot jetzt, guck das ist sind wieder da, Console, jetzt gehts, jetzt gehts sofort wieder, guck, jetzt gehts, jetzt gehts direkt, ja, direkt, ohne was, so, jetzt hat er nämlich auch gleich den ganzen Krempel, ja wunderbar, so und jetzt gehen wir in Configuration, gute Frage, das da, glaub ich, noch mal schauen, jetzt muss uns die richtige Gerätekonfig heraussuchen, ich probiers mal mit der hier, weil das die baugleiche Steckdosenleiste ist, testen wir mal ob das funktioniert, wir sollten dem Ding noch einen gescheiten Namen geben, nämlich, die heißt jetzt einfach Hammer, Hammer, äh, keine Ahnung, was sagen die dann offiziell wie das Ding heißt, was, was, was sagen die, die Hammer Leute denn, Hammer Power Strip, na geil, da weiß man Bescheid, Freifall, ich mach einfach Hammer, Vierer, Device Name, ja das ist ziemlich egal, aber ich nenns trotzdem mal, ähm, kommt wahrscheinlich in Keller, sodass ich noch weiß wie es heißt, so Restarten und jetzt sollten wir vier Stecker sehen, ich bin mir nicht sicher ob mal, ob ihr das hört, aber ihr sollte das, ihr sollte das zumindest sehen, seht ihr das, ok, die Anzeige ist richtig pepega, ihr seht das wahrscheinlich nicht, ich mach mal kurz das Licht aus, ich mach kurz, ich mach kurz mein Ringlight aus, weil sonst erkennt ihr einfach gar nix, naja, gut erkennen ist was anderes, aber ihr müsstet es hier oben rechts sehen, guckt mal, seht ihr das, ja so ein bisschen, so ein bisschen sieht man das, gell, guckt, jetzt ist an, ja besser, besser gehts grad nicht, so nächster an, da musst du aber ganz genau hingucken dass du das erkennst, so und jetzt alles an inklusive USB, guckt hier oben, also ich seh es gut, aber in der Kamera erkennt man es überhaupt nicht gescheit, ja hier oben, hier oben sieht man jetzt ein bisschen, also man kann jetzt tatsächlich alles einzeln, alles einzeln schalten und der Knopf funktioniert auch, der Knopf schaltet aktuell nur die erste Steckdose, aber das juckt mich nicht, man könnte jetzt verschiedene Funktionen vergeben für den Knopf, da müssen wir mal nachgucken, also man kann hinter das Motor so Sachen machen wie Button, Button ummappen, das ist aber, das ist ein bisschen Fivehead, ja man sieht es nicht schlecht, aber zumindest das der Power Knopf angeht, sieht wahrscheinlich jeder, guckt jetzt der Power Knopf aus, wenn man sich ein bisschen einfacher machen will, jetzt machen wir erstmal ein Tasmota Update, Tasmota OTA Update, Tasmota Bin, ich bin mir nicht ganz sicher ob wir Bin oder Minimal brauchen, gucken wir mal, Firmware Upgrade, das geht nicht, Internet Zugang ist komplett geblockt, keine Chance, Download, wir machen mal ein normales Update, es kann sein, ist es schon standardmäßig so was du sagst, ich dachte das muss man alles von Hand vergeben, von Hand machen, so, jetzt geht erste an, Doppelklick, nö, ach doch tatsächlich, dann ist es standardmäßig schon so wie ich sage, guck mal, Tripleklick, geht die dritte gleich aus, eins, zwei, drei, dritte aus, zwei, drei, vier, vierte an, dann ist das sogar standardmäßig schon so wie ich gesagt hab, ja, auch wenn man es nicht richtig erkennt, aber was will ich machen, ja und schaut mal, man sieht das ja auch im Menü, guck mal, wenn ich hier drücke, erkennt er sofort eins ist an und aus, so aber jetzt machen wir erstmal Update, also wenn ihr Tasmota verwendet kann es sein, dass ihr Probleme beim Update bekommt, nämlich je nachdem, wie viel Speicher euer Gerät hat, probieren wir das mal aus, also standardmäßig würde ich immer probieren auf die volle Tasmota Version zu upgraden, wenn es nicht funktioniert, ich zeige euch mal was man macht, wenn es nicht funktioniert, wenn das nicht funktioniert und wenn er sagt, zu wenig Speicher, dann müsst ihr einen Zwischenschritt machen, dann müsst ihr erst auf die Minimal Version updaten und dann auf die größere, also machen wir das mal, Tasmota Minimal Upgrade, also wenn die Geräte zu wenig Speicher haben, dann hat er nicht genug Platz, die aktuelle Firmware plus die neue Firmware in Flash zu kriegen und da musst du erst noch eine kleinere Firmware Flashen, die im Prinzip nichts kann, außer Updates machen und dann kannst du drüber Flashen, kommt Minimal Firmware und jetzt sag mal nochmal Upgrade und jetzt kann man die standardmäßig, die fette Tasmota hochladen, fette Tasmota Firmware hochladen, so und jetzt wenn er Restart hat, sag mal auch schon 1202, was schonmal deutlich besser ist, weil das was aktuell ist es und jetzt sollte er irgendwann Restartet haben, in der Hoffnung, dass er die NTP Settings nicht vergessen hat, was durchaus sein kann, weil ich glaube ein Tasmota 9 auf 12 Upgrade, bin ich mir gar nicht sicher, ob das supported ist, überhaupt in einem Rutsch, schauen wir mal, doch hat alles funktioniert, so wunderbar, so und jetzt kann man die Dinger noch ein bisschen ordentlich benennen, dass man später im Webinterfell in seiner Heimautomatisierung auch checkt, was was ist, ich glaube das ist unter Template, oh ne wie benennt man die Knöppe, ConfigModule, Template hier, Moment wie benennt man Tasmota nochmal die Knöppe, hätte eigentlich gedacht hier drüber, Friendly Name 1-4, ja aber wo ist das, wo war denn das nochmal, da, ach hier, genau hier, genau und die kann man jetzt benennen, also ich persönlich benenne die Dinger endgültig eigentlich in meiner Heimautomatisierung, also in meinem Home Assistant steht dann zum Beispiel drin, Keller Raspberry Pi, das würde ich hier nicht unbedingt, unbedingt so nennen, weil vielleicht steckt ihr die Steckdosenleiste mal woanders hin, ich würde sie aber auch nicht Tasmota 1-2-3-4 nennen, weil ihr habt am Ende sonst ganz ganz viele Geräte die Tasmota 1-2-3-4 heißen, also irgendwie nen gewissen Identifier für die Steckdosenleiste ist schon nicht verkehrt, wenn die Dinger offensichtlich irgendeine Nummer oder so drauf stehen haben, dann kann man das machen, also das Ding hat hinten als Nummer, ja hier guckt mal, das ist natürlich optimal, wenn da irgendeine Seriennummer oder sowas drauf steht, dann kann man die verwenden, ja also zum Beispiel steht hier was 0017674 drauf, dann erfindet man die Leiste im Zweifelsfall auch wieder, aber wir wollen es jetzt mal nicht übertreiben, man könnte natürlich auch den Labelchamp nehmen, wenn ich den mal irgendwann fertig programmiert hätte und ein Label drucken, nachdem ich den Labelchamp aber noch nicht fertig programmiert habe, werden wir jetzt was anderes machen, das habe ich tatsächlich bei den Geräten die ich im Haus verteilt habe, öfters schon gemacht, allerdings nicht bei allen, aber bei allen von denen ich mir dachte ich muss die mal wieder finden. Ja und zwar, dass man sowas hier nimmt, das ist ein Labelprinter und da zum Beispiel jetzt drauf schreibt, wir schreiben jetzt auf den Labelprinter auf cute, chat, chat und dann drucken wir das aus, dann kommt hier neben irgendwie so ein Ding raus, 40 Euro das Ding, das da, ja das ist ein ganz billiger, so und dann kommt dann so ein Label raus, das ist relativ relativ beständig und das ist auch selbst klebend, man muss bloß das Papier da hinten abmachen und das ist jetzt der Inventartack, wie man es will, für diese Steckdoseleiste und dann kann man hingehen und sagen aha das hier ist nicht Hammer, sondern das ist Hammer cute chat, so und dann kann man die Dinger durch benennen, was für ein Gerät dann am Ende drauf kommt, das würde ich hier nicht machen, den würde ich nicht viel, sondern USB nennen, save und jetzt hat man auch ordentliche, ordentliche Benahmung, hier steht immer noch 1, 2, 3 dran, ich bin mir relativ sicher, man kann diese Knöppe hier auch umbenennen, das weiß ich auch nicht warum es keine Querztastatur ist, wahrscheinlich weil das nicht passen würde von der Höhe, nach Querz hat ihr normalerweise nur 3 Reihen und die hier hat 5 Reihen, keine Ahnung, zumindest wenn ihr das jetzt in eure Heimautomatisierung einbindet, dann ist es ordentlich benannt, ich weiß nicht wie man diesen Scheiß hier setzt, es geht, ich weiß dass es geht, ja, pass motor, button name, web button, der Chat weiß Bescheid, web button ja, schauen wir mal, etwas groß ja, aber es funktioniert, gut, alternativ, ja das hier zu benennen ist natürlich relativ, relativ sinnlos, also ich würde es ehrlich gesagt einfach so lassen wie es standardmäßig ist, was dieser Analogsensor ist, habe ich übrigens keine Ahnung, der taucht bei jedem dieser Leisten auf, hat keinen sinnvollen Wert und macht nichts was irgendwie sinnvoll wäre, also keine Ahnung, für was dieser Analogsensor ist, so und jetzt haben wir eine Steckdoseleiste, die man schalten kann, das hier sollte USB sein, yep, yep, Hahn und das passt, eigentlich alles gut, so soll es sein, so, nachdem ich den Kram jetzt nicht neu machen will, copy paste ich mir das mal, das soll ich es nicht Hammer Vierer nennen, Hammer Vierer ist irgendwie doof, Hammer Cute Chat soll das heißen, weil das ist ja der Typ im Endeffekt, Hammer, was ist jetzt Hammer Vierer, ist mir doch wurscht, so, ich weiß gar nicht ob man das Motorgescheit-Config exportieren kann oder so, ah Backup-Config kann man machen, aber dann ist es doppelt, zumindest, jetzt könnte man die nächste Steckdoseleiste nehmen und Flashen, ich würde sagen eine machen wir noch Chat, weil ich glaube bei vier Stück wollte er mir jetzt nicht zugucken, so spannend ist das nicht, oder doch, tja gibt es sonst noch irgendwas was ich euch zeigen kann, was man einstellen kann, also wie gesagt, man kann mit Tasmota schon jede Menge Zeug machen, also ihr könnt beispielsweise hier An-Aus-Schalt-Schedules angeben und sowas, Konfig Timer, also ihr könnt hier beispielsweise einstellen wann das automatisch angehen soll, wann das automatisch ausgehen soll, aber ganz im Ernst, man kann das zwar machen in Tasmota, ich würde es aber über meine Heim-Automatisierung machen und nicht da drüber, kommt mal jetzt, jetzt wisst ihr auch wozu das Ding Zeitzone und NTP braucht, dass es Sunrise und Sunset und so weiß, weil das kriegst du nicht hin ohne Infos über Timezones und sowas, ja also ehrlich gesagt ich habe Timers, Timers in Tasmota noch nie verwendet, ich würde es über meine Heim-Automatisierung machen, Tasmota ist mega komplex, Tasmota hat sogar eine eigene Scripting Language wo du das dann automatisieren kannst, aber naja, das kannst du super easy in Home Assistant integrieren, das kann ich jetzt gerade nicht zeigen, weil ich das im WLAN hängen habe und ich nur hier in den Heim-Home Assistant bei mir im Internet hochfahren könnte, das ist super easy zu integrieren, du musst eigentlich ja so gut wie nichts machen, du installierst die Tasmota Integration und dann gehst du in die Konsole und sagst ein Kommando und dann, also du machst die MQTT Settings, die stellst du ein von deinem MQTT Broker, die vom Home Assistant und dann machst du ein Kommando in der Konsole und er meldet sich am Home Assistant an mit allem was er für Geräte hat, also mit dem Fall fünf Switches. Ja Leute, den Label-Champ, den müssten wir echt fertig machen. Ja, so was kann man machen, ja, also wie gesagt, Tasmota, Tasmota hat eine eigene Scripting Language. Ja, ach ist das nur auf dem ESP32, ne da könntest du darauf nicht machen. Ahja, na das ist sie, wusste ich gar nicht, aber wie gesagt würde ich eh nicht darüber machen, ich würde das über meine Smart Home Lösung machen und nicht hier irgendwie auf der Steckdosenleiste großartig Logik laufen lassen, ich mein, wir reden hier allen Ernstes über Customs-Scripter auf Steckdosenleisten, wir müssen es mal nicht übertreiben. Ja, ich habe Label-Champ auch nicht weiter gemacht. Was fertiges kenne ich auch nicht, vielleicht irgendwelche ZigBee-Dinger, also falls du Z-Wave hast, Z-Wave kann ich dir eine empfehlen, die das kann, aber ZigBee weiß ich nicht und vielleicht ein Shelly, vielleicht die Shelly-Kiste, also wenn du was fix und fertiges suchst, musst du mal gucken, ob das Shelly, ob das Shelly Smart Plug das kann, die sind fix und fertig, die musst du nicht flashen. Kann das Shelly Smart Plug das, Power Measure, Power Metering, ja, ja, also wenn du ein bisschen mehr ausgeben willst als die China-Chinesen-Steckdosenleiste, dann kannst du hier ein Shelly Smart, Shelly Plug S kaufen, die kommen fix und fertig mit ziemlich guter Firmware, die muss man nicht flashen und die kannst du flashen, weil es halt nicht abgeschottet ist irgendwie, also die Shelly-Dinger sind für alle, die nicht selbst flashen wollen, natürlich immer eine sinnvolle Alternative. Guck mal, was kostet der Kram aktuell auf Amazon, ja, ihrer Packung, ja du kannst easy das Motor flashen drauf, aber die Standard-Firmware ist auch okay, ja, die Standard-Firmware braucht keine Cloud, also nicht zwingend und kann MQTT und HTTP und sowas, ja, also so sieht es aus, gut, dann würde ich sagen, FUNST und NEXT, NEXT, auf geht's, raus mit dir und in die Ecke gefäffert, ich hab da ein Kissen liegen, also ich hab die nicht wirklich in die Ecke gefäffert, also die lebt noch, die ist nicht kaputt, ich hol mal die nächste Steckdosenleiste und jetzt mach ich mal wieder das Licht an, weil, so sieht man einfach besser, so, also dann packen, den machen wir mal weg, dann packen wir mal aus, alter was ist, wie ist es denn überhaupt gedacht, Moment, ich muss es mal kurz analysieren, wie ist es gedacht aufzumachen, da ist ja Plastik, ich müsste das gar nicht aufreißen, ich könnte das einfach am Plastik aufmachen, guckt mal, easy, ist ja für Loops, das geht dann einfach auf, guckt euch das mal an, was soll denn das, ohne kaputt zu reißen geht das dann auf, LUL, LUL HD, ok, so gleich nochmal von vorne, Start, nee Moment, langsam, langsam, so, anstöpseln und in Flashing Modus packen, so, Plinkt ist im Flashing Modus, Start, Flash, so jetzt mit dem Tablet connecten, Tablet is connected, put your IOT device things, press enter, müsste es eigentlich klicken, es hat geklickt, ok, ok, es hat geklickt, so hoffen wir mal, dass es jetzt einfach funktioniert wenn ich es nicht wieder 5 mal neu machen muss wie beim letzten Mal, ok, eins hab ich schon gemerkt, wenn das dieses config package senden eine Weile dauert, dann klappt das meistens, das dauert aber schon ganz schön lang jetzt, warum fischst du eine Steckdosenleiste, so, ja hat funktioniert wunderbar, easy, warum fischst du eine Steckdosenleiste, dass ich sie ohne China Chinesen Cloud betreiben kann, ist eines der Punkte und dass ich es besser in mein Smart Home integrieren kann ist ein weiterer Punkt, so also was wir haben, Flash Tasmota, yes, do you want to Flash Tasmota, yes, billig, so und dann muss ich den ganzen Müll nochmal übers Tablet an WLAN Passwörtern eingeben wieder, no, gut, hat funktioniert mit dem Flaschen, jetzt müssen wir Tasmota uns connecten auf die Steckdosenleiste, genau und die gute Frage ist eh warum nicht, das ist die richtige Frage, ja eine Steckdosenleiste braucht eine Cloud, jaja natürlich, wenn du dir China Chinesen Zeug kaufst, das braucht alles eine Cloud heutzutage, so Home, also Access Point Passwort, Kekl, mehr verrate ich nicht. ich hoffe ich habe es nochmal gesaved, sonst muss ich gleich nochmal alles eintippen, ich glaube ich habe mich verschrieben Leute, schauen wir mal, schauen wir mal ob es funktioniert, ich glaube es hat funktioniert, wait a minute, einfach so, vielleicht habe ich es doch nicht verschrieben, also von der Idee her müsste die IP von der Steckdosenleiste jetzt die hier sein, musst du nochmal überprüfen, tatsächlich, easy, null, ich dachte ich habe mich verschrieben, ich habe mich gar nicht verschrieben, ich will mich jetzt ja nicht beschweren, die leitet Strom weiter, jaja natürlich dafür ist sie da, aber du kannst sie halt auch remote schalten, du kannst remote schalten über Webinterface MQTT oder wie du willst, diese Steckdosen einzeln und USB alle 4 auf einmal an und aus, IP Leak schon wieder, oh nein, ok, Console, NTP Server, müssen wir jetzt setzen, ihr seht wie lahm das ist, wie lief das Bewerbungsgespräch letzten Monat richtig gut, fand ich gut, also ich fand den Laden nicht schlecht, ich habe mich mit dem Interviewer verstanden, der hat bei mir auch schon abends zu dem Stream eingeguckt, das fand ich witzig, ich werde demnächst irgendwann mal einen Probearbeitstag machen, so, ok das Motor ist am rumspacken, weil ich kein NTP Server gesetzt habe, das ist PainsChamp, so NTP Server 1, NTP Server 2, NTP Server 3, ich hoffe der frisst die Commands jetzt und es funktioniert und dann machen wir ein Update, wie läuft sowas eigentlich, nimmt man sich dann einfach einen Tag Urlaub, nö, ich mache das montags, montags habe ich eh frei, montags arbeite ich eh nicht, es ist ja kein Probearbeitstag in dem Sinn, dass ich dafür groß Geld bekommen würde oder da wirklich was arbeite großartig, das ist, dass man sich das mal anguckt, dass man das Team kennenlernt und die ein oder anderen Sachen vielleicht auch mal so tut, als würde man was machen und besprechen und gucken, ob das passt beidseitig, ich glaube nicht, dass ich denen in einem Tag eine neue Konfigmanagement für ihre Cloud aus dem Boden stampfe oder sowas und dann sage easy, ja, mache ich in einem Tag. Sagen wir mal, könnte das vielleicht jetzt mal laden hier so, lade, lade das verdammte Spiel, ich will nicht, dass es lädt, einfach langsam, einfach langsam as fuck, ohne, also ihr seht jetzt, was es ausmacht, wenn NTP Server geblockt ist bei TAS Motor, das ist von superschnell bedienbar zu unbenutzbar langsam ohne NTP Server, wow, nice Hackerman Content, ok, Konsole, hat das jetzt gefressen, ja, guck jetzt ist er schnell, weil er den NTP Server gefressen hat, ja, alles klar, Zeit ist richtig, Timestone plus eins ist falsch, also Timestone plus eins ist falsch, wir haben nicht 19.54, sondern 20.54, aber ganz im Ernst, damit kann ich leben, wenn meine Steckdosenleiste ein bisschen falsch geht, ist in Ordnung, was ist ein NTP Server, das ist ein Netzwerkservice zum Uhrzeit synchronisieren, hast du auch, hat jeder daheim, wissen die meisten vielleicht nix von, aber hat jeder, jeder 0815 Router macht NTP mit, also, ich will jetzt nicht über die Details sprechen, ob das ein Router ist oder ein Multifunktionsgerät oder so, aber, ja, also jeder 0815 Telekom Router, Fritzbox, sonst was hat ein NTP dabei, genauso wie DNS, also, Config, Activate, Safe, so, jetzt gucken wir mal, ob das funktioniert, mit Schalten gleich, jawoll, Kunst, klick, klick, klick, klick, alles klar, Firmware Upgrade, mal gucken, ob das Ding genug Speicherplatz hat, um direkt das Firmware Upgrade zu machen, werden wir gleich sehen, dass ich nicht den Zwischenschritt machen muss, wie das letzte Mal, ja, hat funktioniert, nice, ich weiß, wie ich das Ding nennen werde, ich nenne das Hammer 4 Plus USB, dann weiß ich auch, was es ist, unreachable, oh no, da ist er wieder, nicht HTTPS, Firefox, was machst du da, Config, das Ding soll heißen 4 Plus USB, dann weiß ich auch, was es ist, ja, so ist guter Name, Hammer 4 Head Plus USB, der Router, der synchronisiert sich übers Internet, und mit dem gleichen Protokoll, wie sich deine Rechnerlokale mit dem Router synchronisieren, eigenes, eigenen Time Server hat keiner, kann man machen, ja, sogar, sag mal so, in der Anflugschritte, relativ günstig, du brauchst einen GPS Empfänger, die sind billig, und mit dem GPS Empfänger hast du ziemlich akkurater Time, und da kannst du das theoretisch selbst machen, aber ganz im Ernst, but why, es macht keinen Sinn, das selbst zu machen, ist komplett unsinnig, warum sollte man das selbst machen, also es geht, es geht relativ günstig, aber es macht keinen Sinn, also wenn du einen GPS Empfänger hast, hast du automatisch auch genaue Zeit. So, was muss man jetzt noch setzen, Config Template, so das Ding heißt nicht TAS Motor, sondern wie habe ich das genannt, Hammer, jetzt müsste ich es eigentlich anders benennen, weil das ja die Inventar Nummer war, von dem anderen, das ist eine ziemlich bescheuerte Nummer, so, USB, save, du kannst übrigens deinen Rechner auch mit NTP Server im Internet synchronisieren, also es ist nicht so, als müsstest du das über deinen Router machen, aber die meisten Router werden sich wahrscheinlich als NTP per DHCP verteilen, vermute ich mal, ja das ist Schwachsinn, man muss das nicht selber machen, so, easy, also wenn man weiß, wie es funktioniert, ist es doch wirklich nicht schwer gewesen, oder Leute, wir haben jetzt 5 Minuten gebraucht, das Ding zu flashen, zu aktualisieren auf die aktuelle TAS Motor Version, es ordentlich zu beschriften und fertig, jetzt könnte man das mit zwei Befehlen ins Home Automation System einbinden, was ich euch nicht zeigen kann, weil ich da zu viel private Sachen drin stehen hab, ich könnte jetzt hier irgendein Home Assistant oder so hochfahren, aber das lohnt sich nicht, wobei wir hätten eine Home Assistant VM, machen wir mal, man schadet ja nichts, können wir uns ja noch schnell machen, ich weiß halt nicht, wie aktuell das ist, es kann sein, dass ich das mal updaten muss, können wir machen, ist wie gesagt easy, dann zeige ich euch auch mal, wie einfach das ist, die Steckdosen leistet jetzt in sein Smart Home einzubinden, ich muss aber vorher erstmal ein Update vom Home Assistant, von der Home Assistant VM machen, weil die ist, die hatte ich 3 Monate nicht an, die hat wahrscheinlich uralt Versionen auch drauf, machen wir das, machen wir das einfach gerade mal, schadet doch nichts, so, und ansonsten, also flashtechnisch passt das, ich hab jetzt noch 2 weitere im Schrank liegen, wie gesagt, ich glaube das wollt ihr euch nicht noch angucken, dass ich das ganze 2 mal mach, dass ich das ganze noch 2 mal mache, also ich hab den Home Assistant nicht auf Raspberry Pi, ich hab das auf ne x86 Kiste. Was ist an dem Ding anders, dass es nicht mal mit der China Cloud verbunden ist, ja, das ist fast der wichtigste Punkt, aber es läuft ne komplett andere Firmware drauf als original, also dieses Web Interface, was du hier jetzt siehst, das gibt es normalerweise gar nicht, normalerweise gibt es nur die offizielle App und die China Cloud, und die offizielle App steuert über die China Cloud seine Steckdose, sowas hier, Web Interface, MQTT Integration und sowas, vergiss es, gibt es nicht, hat es standardmäßig nicht, entweder bist du glücklich mit der China Cloud oder nicht und gescheit in deine Heimautomatisierung einbinden kannst du es natürlich auch nicht, was hat das Ding für ne IP gekriegt, 2.132 ok, Home Assistant hat 8, 123 ok, Admin 123 hoffe ich mal, wenigstens bin ich mir treu, wenigstens bin ich mir treu, was meine super Five Head Benamung angeht von Passwörtern, so Configuration, wir haben mal kurz ein Update, boah das ist ja uralt, Alter dieser Home Assistant ist ja uralt, was ist denn das für ne Version, das ist ja antik, November 2029, das ist ja uralt, ok das muss man mal schnell updaten, wir brauchen kein Backup, entweder es geht kaputt oder es funktioniert, warum connecte die App nicht direkt mit der Steckdose, das musste die China Chinesen fragen, wahrscheinlich hat es zwei Gründe, erstens wollen sie deine Daten haben und vielleicht möchte die chinesische Regierung irgendwie mal nen Botnetz haben mit paar Millionen Leuten, aber der offensichtliche Grund ist, ich gehe davon aus, also der nicht so verschwörungsmäßige Grund ist, das ist, dass du deine Steckdosenleister aus dem Internet steuern kannst, weil bestimmt viele Leute sagen, ah dann kann ich aus dem Urlaub ja keine Ahnung den Kaffeekocher ein und ausschalten oder so, ich weiß nicht ob das wirklich ein oft benutzter Anwendungsfall ist, aber ich glaube das ist ein Anwendungsfall den die Hersteller gerne verkaufen als tolle Möglichkeit, ja und damit hast du quasi direkt, genau Alexa Integration und so ein Crap, damit hast du halt direkt die Möglichkeit ohne irgendwas selbst zu konfigurieren aus dem Internet drauf zuzugreifen, aber ganz ehrlich ich möchte nicht aus dem Internet auf meine Steckdosenleister zugreifen, wobei es wie gesagt wahrscheinlich umgedreht ist, die Steckdosenleiste ist subscribed zu irgendeinem Websocket und kriegt es dann geschickt, also ich glaube nicht, dass man direkt aus dem Internet zugreifen kann, aber trotzdem will ich das, wahrscheinlich nicht, hat das Update jetzt funktioniert, ja Update hat funktioniert, nice, yes alles updaten, alles updaten und dann zeige ich euch wie man die Steckdosenleiste super easy integrated in Home Assistant, um nicht zu sagen easy as fuck integriert, wir warten aber erstmal bis das Ding rebooted ist, dass ich die aktuellste Version habe. Du kannst es ja auch selbst machen, wenn du Zugriff von außen brauchst, du brauchst dir da keine China App für, hat das jetzt den Install gemacht oder nicht? Ah der rebooted noch ok, alles klar, so da sind wir wieder, wir haben aktuelle Version drauf, refreshen das ganze mal, stellen fest, dass Home Assistant noch nicht gebootet ist, Home Assistant ist nicht so schnell beim booten was das angeht und jetzt irgendwann Home Assistant ist starting, dismiss, ja dann starte mal alter, mach hin, kein Backup, neuesten MQTT Broker draufhauen, gut ist, so jetzt zeige ich euch wie man die Steckdosenleiste super easy noch in Home Assistant integriert, weil was hat man davon, wenn die Steckdosenleiste jetzt schön über das Webinterface steuerbar ist, dann möchte er das ja über seine Smart Home Lösung machen. Wir haben im Stream auch schon ESP-866, ESP-32 Firmware selbst gemacht, aber in dem Fall benutze ich TASMOTA, TASMOTA ist mit so das bekannteste an Custom Firmwares, guck mal, 18.000 Sterne auf GitHub und super aktives Projekt, also was besseres kannst du eigentlich nicht installieren, ach guck mal, der musste, Leute, von wegen gar nicht so alt, der muss jetzt nochmal, der muss nochmal upgraden auf 7.6, das war bloß so ein Zwischenschritt, lull, also muss er nochmal rebooten bis es aktuell ist, ja das ist Ende 2021, bei Home Assistant tut sich richtig viel, die sind immer BÄM BÄM BÄM neue Versionen am rausprügeln, oh nochmal installen machen, mittlerweile haben die sogar einen Progress Balken, der mit der, wahrscheinlich mit der Realität nicht all zu viel zu tun hat, die sind relativ stable und die haben richtig gute Changelogs vor allem, also du erfährst meistens in einem Changelog sogar, ob es realistisch ist, dass du noch was machen musst oder nicht, Sachen gibts, also ich kann echt nicht meckern, Home Assistant ist wirklich das Richtige gewesen, was ich damals mir ausgesucht hab und ich glaube ich hab Home Assistant, ich wollte ursprünglich Open Hub verwenden, Java Zeug, MonkaS, da kannte ich mich in dem Bereich noch nicht so aus und ich glaube damals hat mir auf Twitter, und es könnte der Sebaro sogar gewesen sein, der CuteMod höchstpersönlich hat geschrieben, warum der nicht Home Assistant ist, da hab ich mir das angeguckt und wo der steckt, wird mich auch mal interessieren und seitdem benutze ich das seit 4 Jahren oder so, also nicht diese VM, diese VM hat ja offensichtlich keine Konfig drinne, aber Home Assistant ist ein bisschen problematisch, wenn du da ewig nicht aktualisierst, kanns sein, dass du auf einen Schlag halt total viele Breaking Changes hast aus den letzten 16 Releases, die du nicht gemacht hast, so hat er jetzt rebooted, dann binden wir jetzt die Steckdosenleiste ein, ne er rebooted noch, ok, alles gut, rebooted mal ein bisschen schneller, Heimatassistent, Heimatunterstützer, Heimunterstützer, Heimhelfer, wie kann man das am besten übersetzen, Home Assistant, Zuhause, Zuhausehelfer oder so, was hast du alles so in deinem Smart Home integriert, boah, da müsste ich jetzt lange, einiges, ich hab euch ja schonmal so grob paar Sachen gezeigt, aber alles mögliche von Fensterkontakten bis Steckdosen bis Licht, paar Automatisierungen wie Zugverspätungen, dass er automatisch den Lüfter im Bad ausschaltet, LED Beleuchtung an der Treppe, bis zum Weihnachtsbaum, sogar der Weihnachtsbaum ist drinne, so, also, jetzt aber. Aktuelle Home Assistant, gut, wir haben es geschafft, so, damit man seine Steckdosenleiste ordentlich in Home Assistant einbinden kann, muss man folgendes machen, man braucht auf jeden Fall, warte mal, was ist das, Steuerung P, ne, Control P, ne, die hatten doch jetzt so ein cooles Menü bei Home Assistant, ich hab aber vergessen, Control C, hmm, Control A, Home Assistant hatten jetzt so ein Schnell-Finde-Menü neuerdings eingebaut, Shift P, ne, Home Assistant Quick Menu, ne, das mein ich nicht, Control K, nein, Command Menu, ne, Control S, Menu, vielleicht was mit M, Control M, ne, unmuted hab ich's jetzt, sehr gut, ja, man braucht das nicht, man kann das auch übers Menü machen, ach, einfach nur C, ach, da hab ich gesucht, einfach nur C, es ist nicht Control C, einfach nur C, also man kann das alles auch über die Menüs machen, also, ihr müsst jetzt erst mal zu Integrations und ihr braucht einen konfigurierten MQTT Service, so, ohne funktioniert's nicht, dann geht ihr auf das Tasmota von der Steckdosenleiste und tragt hier unter MQTT Settings euren Home Assistant ein, also, die IP Port ist der Standard MQTT Port, so, save, so, Start, dann guckt ihr in die Konsole, ob er sich mit MQTT verbinden kann, ob alles gut ist, wenn er dann mal neu gestartet ist, Failed Connect, das ist schon mal schlecht, können wir mal gucken, ob das denn überhaupt läuft, Tailed Net, eins, eins, acht, acht, drei, siehste, funktioniert, da liegt es an der Firewall-Freischaltung, nicht funktioniert, eins, acht, acht, drei, wir können auch Mosquito Sub oder so machen, hm, also, meine Steckdose kommt zumindest nicht zu meinem MQTT Server, was wahrscheinlich an Firewall-Regeln liegt, würde ich jetzt mal vermuten, MQTT, also, ich habs erlaubt, dass das freigeschaltet ist, ja, das war's, das muss man nur einmal machen, aber, komisch, warum geht das nicht, ist alles Default, ist alles richtig, mit der Leiste, Tuya Convert, hiermit, mit dem Raspberry Pi, ich weiß nicht, warum eine Leiste da gerade nicht hinkommt, wenn ich ehrlich bin, achso, vielleicht, ach, ich bin ja blöd, ich hab keine User eingestellt, ich glaube, ich muss User einstellen, wartet mal, ich hab keine User eingestellt, ja, Addons, Mosquito MQTT Broker Configuration, ja, ich glaube, ich hab keine User eingestellt, ruhig mal aus, Host, Topic, ah, ich darf nicht, ok, User, Admin, Passwort, geht das, ok, das funktioniert, alles klar. Ich will nicht anonyme Listener erlauben, ich will schon User haben, das muss man nur einmal machen, User, wo konnte man nochmal Accounts anlegen, hier, Add Person, nee, wartet mal, wo macht man das nochmal, war das hier in den Settings, Documentation, User, Configuration, User, User, User, Users, ah ja, genau, also, MQTT, Username, Passwort, kann man sich jetzt irgendwas ausdenken, ja, Create, alles klar, so, das will ich haben, jetzt geht man in die Connectos, jetzt müssen wir nämlich noch einstellen, den User für den MQTT Server, User, MQTT, Passwort, High IQ, 123456, save, so, und jetzt gehen wir in die Konsole und jetzt sollte die Connection auch funktionieren, Konsole, ja, das sieht gut aus, so, und jetzt ist das einzige, was wir machen müssen, also das muss man ja nur einmalig einstellen, das ist ja nicht pro Leiste, sondern einmalig für alle MQTT User, so, und jetzt ist das einzige, was man machen muss, wenn man eine Tasmota-Leiste hinzufügen will, ihr geht in Integrations, Add Integration, Tasmota, zack, achso, hab ich schon mal gemacht, hier, haben wir sogar schon konfiguriert, easy, haben wir sogar schon ein paar Mal angelegt, lull, so, und jetzt können wir mal gucken, ob es schon auftaucht, da ist sie, easy, ihr müsst nichts machen, ihr müsst, wenn ihr ab jetzt eine neue Steckdosen-Leiste mit Tasmota habt oder irgendein Tasmota-Gerät, ihr müsst einfach den MQTT Server eintragen und fertig, mehr müsst ihr nicht machen und schon habt ihr das gesamte Gerät im Home Assistant drin, guck, ihr könnt jetzt hier drüber die Leiste schalten, weiß nicht, ob man das sieht, also das war's, also ihr müsst jetzt bei einer neuen Leiste eigentlich gar nichts mehr machen, das ist super easy mittlerweile, früher war es ein bisschen komplizierter, ja guckt, ich kann jetzt über meinen Home Assistant den ganzen Kremplchon schalten, wie ich lustig bin, so, und dementsprechend kann ich auch einfach in mein Dashboard gehen und diesen ganzen Crap hier mal rausschmeißen, den keiner braucht, oder besser gesagt wir gehen hier hin, Wohnzimmer, so, Edit, schmeißen wir mal raus, Edit, Wohnzimmer USB, nein, Qt, Qtchat 1, wollen wir da jetzt haben, so, Name ist, was weiß ich, Keller, Pie, oh, und das ist hier keine Ahnung, USB, Ups, jetzt nehm ich eigentlich nur USB, USB, so, und das ist keine Ahnung, dann, was weiß ich, Keller, Kekl, so, und jetzt habt ihr die Knöppe, save, jetzt passt mal auf, zack, jetzt könnt ihr sie übers Dashboard steuern, und ihr müsst nix machen außer den MQTT Server ein, kann man die USB Ports einzeln ansteuern, nein, das funktioniert nicht, du kannst nur, guck jetzt hab ich USB ausgeschaltet, also das hier ist USB, du kannst nur USB auf einmal einschalten oder USB auf einmal ausschalten, das Schalten geht übrigens schnell, USB hat die Lampe leuchtet einfach nur danach, so, und jetzt könnt ihr euch euer Dashboard zusammen klicken wie ihr wollt mit euren Steckdosen leisten, und das funktioniert einfach, easy, und man hat die weitere Möglichkeit, wenn man das mal braucht, vielleicht weil die Heumautomatisierung nicht geht oder irgendwas ist, man kann immer noch übers Webinterface drauf und direkt im Webinterface das ganze machen, oder wenn gar nix hilft, man kann hingehen und den Schalter drücken, das geht natürlich auch noch, guck, Schalter einmal gedrückt, erstes, Schalter zweimal gedrückt, zweites, Schalter dreimal gedrückt, drittes, Schalter viermal gedrückt, viertes, äh, äh, fünfmal gedrückt, USB, eins, zwei, drei, vier, eins, zwei, drei, vier, vierter an, erster an, zweiter aus, dritter aus, geht auch, also kannst du übers Webinterface machen, kannst du über den Knopf machen und kannst jetzt auch über deine Heumautomatisierung machen und guck, dass ihr auch seht, wie schnell sich das überträgt, ich schalte jetzt mal hier an, ihr sehts hier oben, zack, und ist direkt an, habt ihr gesehen, guck, also das ist instant, paar Millisekunden, funktioniert, so, machen wir mal die VM wieder aus, weil brauchen wir ja nicht, war jetzt ja nur zum zeigen, shutdown, jawoll, shutdown, gibt es solche Steckdosenleisten noch zu kaufen, ja, und angeblich, angeblich gibt es die auch noch zu kaufen und die sind noch flashbar, 29 Euro für eine ist jetzt nicht billig, aber von den Features her, gerade geflasht, gibt es da eigentlich nicht so viel, was da rankommt, es ist aber halt nix, was in Deutschland hergestellt wird, es ist halt China Ding, und angeblich sind die hier noch flashbar, normalerweise hätte ich ja gesagt, ich kaufe mir den Kram über AliExpress, dann kriege ich für den Preis vielleicht zwei oder drei, aber da weiß man nicht, ob die flashbar sind, weil aktuell sind die ganzen Trio Geräte meistens nicht mehr over the air flashbar, oder aber gar nicht mehr flashbar, weil komplett anderer Chip drin ist, das ist WLAN, richtig, du hast die Alternative, es gibt noch ein paar ZigBee Leisten, beim Lidl zum Beispiel, da brauchst du das Flaschen gar nicht, weil ZigBee ist ja schon darauf ausgelegt sinnvoll angesteuert zu werden, allerdings können die da natürlich auch nicht so viel wie TAS Motor mit der ganzen jahrelangen Entwicklung, aber das meiste macht man eh über seinen Smart Home und nicht direkt über die Steckdosenleiste, übrigens wisst ihr warum die jetzt blinkt, weil sie die Verbindung verloren hat zum MQTT Server, naja, weil ich die VM mit dem MQTT Server gerade ausgeschaltet habe, aber von Handschalten, seht ihr, funktioniert immer noch, yep, so siehts aus Leute, Flashchamp am Start gewesen heute wieder, ich meine, es wäre natürlich, guck mal, du hast unterschiedliche Farben, den Sinn habe, verstehe ich nicht so genau ehrlich gesagt, was da der Twitch Chat mir damit sagen will, aber ok, was wollte ich gerade sagen, keine Ahnung, Boomer Hirn habe ich vergessen, ne, nicht verbunden, du brauchst Tuya Convert und das Flash die Steckdosenleiste übers W-Lan, deswegen geht das auch nur mit welchen, die noch alt genug Factory Firmware drauf haben, weil die neueren haben das gepatcht oder haben eben einen anderen Chip, funktioniert, ja, alles funktioniert, auch Einbindung in Home Assistant funktioniert, alles gut, kann man den Raspberry Pi ausmachen, den Switch ausmachen, den Pi ausmachen, alles gut, exellent, so Chat, gibt es noch irgendwelche Questions, weil nochmal zwei Flaschen will ich jetzt nicht, das ist auch irgendwie nicht so spannend, nochmal den gleichen Krempel zweimal, es halt die Sache, man kann sich nicht darauf verlassen, dass die Flashbar sind, aber ganz im Ernst, ihr könnt es probieren und wenn es nicht geht, dann schickt ihr die einfach zurück, macht ihr einfach den Insie Modus, aktiviert ihr bei Amazon und sagt, ich schick das zurück, da merken die ja nichts von, dass ihr die versucht habt zu Flashen, das ist ja komplett nicht feststellbar, vor allem halt auch wenn es nicht funktioniert hat, behaltet ihr sie und wenn es nicht funktioniert hat, schickt ihr sie halt zurück, ich meine, ich will es jetzt nicht promoten, wir dürfen den immer nicht vergessen, wir sind auf einer Amazon Plattform unterwegs, ja, also sollte ihr natürlich nicht machen, Chat, ganz böse, also kaputt würde ich die Dinger nicht zurückschicken, also wenn ihr die kaputt macht, Amazon ist meistens sehr kulant und nimmt die Dinger sogar in teilweise echt fragwürdigem Zustand entgegen, aber ja, das würde ich da nicht machen, ich meine, wenn man das Ding wirklich zerstört hat oder selbst kaputt gemacht hat, natürlich könnte man dann immer erzählen so nach dem Motto, es ging kaputt beim ersten Anschließen und wenn euer Amazon Konto nicht oft Reklamationen hat, dann machen die das dann wahrscheinlich auch, aber irgendwie ist es trotzdem ein bisschen fragwürdig, wat, dann das hier, ich hab gerade eine Mail von OnlyFans bekommen, das ist bestimmt Scam, China-Chinesen, Indischer Scam wahrscheinlich, OnlyFans, Gachibas, Gachirole, genau, ne, nicht aber abgelaufen, irgendwelche Empfehlungen oder so, keine Ahnung, wahrscheinlich diesen Camgirls musst du folgen hier, gib Geld aus bei uns, ich hab keine OnlyFans Abos, sexy Devops Content, Abos, ne ne ne ne, wenn schon dann Indie Fox, wobei gibt's die überhaupt noch, ich will jetzt nicht nachgucken, ich will jetzt nicht nachgucken im Stream, ne ganz ehrlich, OnlyFans ist Geldverschwendung, wenn man sich diesen Content wirklich angucken will, dann gibt es genug alternative Möglichkeiten da dran zu kommen, jetzt könnte natürlich jemand sagen, ja aber ich möchte die Creators unterstützen, kann ich nix dagegen sagen, ich leb ja letztendlich zum Teil auch davon, dann macht, ja, Twitch, Mason, Dankeschön für den Sub, das klick ich jetzt nicht an, das werd ich definitiv nicht anklicken, selbst wenn du sagst save for work, ich seh, ich seh, da gehts um Lüfter, ich hab's gesehen, da gehts um Lüfter, um Ventilatoren gehts da, das ist natürlich gut, dass sie das Subreddit so gesnackt haben, so einkassiert haben und dass das jetzt nicht wirklich OnlyFans ist, sondern wirklich OnlyFans, also Fans so, Lüfter halt, huge Fan, ja gibt es auch irgendwas spannendes, ansonsten würd ich jetzt aufgehen und mir noch irgendwie, keine Ahnung, Amazon irgendwie ne Serienfolge oder so angucken, oh ein Sarix, kennst du das, ne, sagt mir nix, ach doch, das ist Müll, das hab ich mir angeschaut, das ist Müll, das ist diese Linux-Distro für, diese Linux-Distro für Bitcoin Miner, die in den Remotes, ungefragten in Remote-VPN aufhacken auf deine Linux-Maschine, ja, ja, ne, ne, das ist so komisch, kommt mir nicht ins Haus, ja, such mal danach, wenn ich glaubst, ja, Remotely Access, das ist standardmäßig offen, ja, zwar mit ner random generated-Ul, die keiner erraten kann, aber ich will sowas nicht standardmäßig haben, ich würde sagen C-Sharp und ist immer noch meine Lieblingsprogrammiersprache, tja, würd ich mir mal Gedanken machen, ich hab dich nicht gesehen, du hast überhaupt nix geschrieben weiter oben, wie gesagt, ich hab nicht groß jetzt die wahnsinns Bewerbungsschreibaktion gemacht, ich hatte ein Vorstellungsgespräch, eins hab ich noch und ein Probearbeitstag demnächst, ansonsten erstmal nix, mal gucken, 2023 wird das Jahr des Linux-Desktops, ja vielleicht in WSL, alles klar Leute, gut, also, wenn es dann sonst nix mehr gibt, dann, nein, kennste, muss ich das nochmal anmachen, das hab ich schon ausgemacht, jetzt muss ich es nochmal anmachen, ist mein VM jetzt abgekackt oder was, mach meine VM hier, VM, VM, was ist, ah, ok, alles klar, VM macht Betge, ja, so siehts aus, VM hat sich wohl auf SSD geschrieben, gerade 16GB, du bist drin, ok, wie hast du das gemacht, beim ausgeschaltet drin zu sein, aber, gut, ich mein, der Chat da kann das, er kann auch ausgeschaltete Rechner hacken, das ist überhaupt kein Ding, der Chat macht das easy. Easy, macht er das, easy, gut, dann sehen wir uns im nächsten Stream, Leute, ich hoffe, euch hat's gefallen, bis denn, macht's gut, see you.", "segments": [{"id": 1, "start": 0.0, "end": 24.14, "text": "Keck Ich hab Dreck in meinem Wasserschwimmen, was ist das?"}, {"id": 2, "start": 24.14, "end": 36.4, "text": "Irgendeine Mücke oder so, Monarch S, Dance Game, ah ja, so Leute es wird heut mal wieder"}, {"id": 3, "start": 36.4, "end": 47.08, "text": "Zeit, die letzten China Chinesen Reserven müssen geflasht werden, moin Leute, ich komm"}, {"id": 4, "start": 47.08, "end": 55.2, "text": "nicht vor die Kamera, Sekunde, hier, ja, hallo, hallo, hallo, weiß gar nicht wie ich gescheit"}, {"id": 5, "start": 55.2, "end": 64.44, "text": "winken soll, so vielleicht, so, keine Ahnung, lull, so ich muss mal kurz die Kabel, das"}, {"id": 6, "start": 64.44, "end": 88.32, "text": "Kabel an der Kamera weg machen, das ist da ziemlich störend im Weg, so, so, so, so,"}, {"id": 7, "start": 88.32, "end": 116.68, "text": "und KS, kann der sich hier irgendwie hinsetzen oder so, so, ok, der ist schepp, so, hallo,"}, {"id": 8, "start": 116.68, "end": 127.72, "text": "hallo, hallo, hallo, hallo, hallo, hallo, hallo, habe ich unexpected zur Garage geguckt,"}, {"id": 9, "start": 127.72, "end": 134.16, "text": "habe ich gerade schon doch mal das"}, {"id": 10, "start": 134.16, "end": 139.04, "text": "什ellawine gesch germsft, die zum Beispiel habe ich dieseा"}, {"id": 11, "start": 139.04, "end": 144.96, "text": "Teilzahnshür gelernt, monde hat immer eine constant, also, ja, ich dann bin aber dann"}, {"id": 12, "start": 144.96, "end": 149.2, "text": "flaschen bis dann endgültig Schluss ist mit China flaschen weil die neuen"}, {"id": 13, "start": 149.2, "end": 153.36, "text": "China-Chinesen-Geräte sind nicht mehr flashbar oder halt nur mit größeren"}, {"id": 14, "start": 153.36, "end": 158.6, "text": "Umbauarbeiten oder gar nicht mehr weil komplett anderer Chip. Keine Chance"}, {"id": 15, "start": 158.6, "end": 165.92, "text": "machst du nix. Moin Twitter, wat?"}, {"id": 16, "start": 165.92, "end": 177.68, "text": "Du hast die von Hammer noch da. Hast die auch geflasht oder nicht?"}, {"id": 17, "start": 177.68, "end": 187.28, "text": "Kleiner, mal kurz anderen Sound."}, {"id": 18, "start": 187.28, "end": 199.24, "text": "So was. Hast du schon mal was von Yeelight geflasht?"}, {"id": 19, "start": 199.24, "end": 205.44, "text": "Nee. Yeelight. Kenn ich vom Namen her, sagt mir das irgendwas."}, {"id": 20, "start": 205.44, "end": 215.24, "text": "Ich vermute mal die machen RGB, WLAN-Lampen und LED-Strips. Würde ich jetzt mal so vermuten"}, {"id": 21, "start": 215.24, "end": 218.04, "text": "vom Namen her, oder?"}, {"id": 22, "start": 219.96, "end": 230.4, "text": "Aber sagt mir jetzt, also der Name sagt mir was, aber so noch nix mitgemacht."}, {"id": 23, "start": 230.4, "end": 247.72, "text": "Was war? Ich kann mich nicht erinnern. Habe ich heute irgendwas auf Twitter?"}, {"id": 24, "start": 247.72, "end": 249.88, "text": "Twitter geschrieben?"}, {"id": 25, "start": 249.88, "end": 255.24, "text": "Habe ich heute auf Twitter geschrieben? Nix, oder?"}, {"id": 26, "start": 255.24, "end": 262.36, "text": "Irgendwas auf Twitter geschrieben heute? Ach so, ja die Sache mit der 1&1 Rechnung."}, {"id": 27, "start": 262.36, "end": 265.84, "text": "Die haben ja sogar darauf geantwortet, was ich besonders witzig fand. Das war ja"}, {"id": 28, "start": 265.84, "end": 270.76, "text": "nix Schlimmes. Aber es ist schon ein bisschen merkwürdig. Sie schreiben die erst vor"}, {"id": 29, "start": 270.76, "end": 274.76, "text": "einer Woche oder vor drei Tagen schreiben sie, ja Achtung, also Rechnungen kommen"}, {"id": 30, "start": 274.76, "end": 279.24, "text": "jetzt nicht mehr per Mail und heute kriege ich die Rechnung per Mail. Schon"}, {"id": 31, "start": 279.24, "end": 285.76, "text": "irgendwie ein bisschen widersprüchlich."}, {"id": 32, "start": 285.76, "end": 290.56, "text": "Weißt du noch was du für letzte Weihnachten sin via LEDs genommen hast?"}, {"id": 33, "start": 290.56, "end": 298.4, "text": "Ja, da müsste ich nachgucken. Das Problem ist, ich bin jetzt aktuell Amazon nur"}, {"id": 34, "start": 298.4, "end": 306.48, "text": "eingeloggt auf meinem Handy und mein Handy ist gerade da. Da kann ich nicht draufgucken."}, {"id": 35, "start": 306.48, "end": 311.68, "text": "Das Wetter eskaliert. Ja, deswegen habe ich"}, {"id": 36, "start": 312.16, "end": 318.96, "text": "Themenanlage an. Ich überlege gerade, was war das denn? Das waren irgendwelche"}, {"id": 37, "start": 318.96, "end": 326.92, "text": "irgendwas mit Fairylight oder so hießen die Dinger. Irgendwie Fairylight, LED, RGB"}, {"id": 38, "start": 326.92, "end": 332.68, "text": "oder so. Sowas da in der Richtung war das. Ich kann jetzt leider nicht nachgucken,"}, {"id": 39, "start": 332.68, "end": 338.16, "text": "aber sowas war was ganz billiges. Es waren auf jeden Fall nur 50 LEDs, glaube"}, {"id": 40, "start": 338.16, "end": 346.92, "text": "ich, 50 LEDs für einen Meter. Also die waren relativ dünn bestückt, was halt den"}, {"id": 41, "start": 346.92, "end": 352.92, "text": "Vorteil hatte. Du konntest die ganz gut wo lang legen, ja zum Beispiel auch in"}, {"id": 42, "start": 352.92, "end": 357.2, "text": "Weihnachtsbaum. Also damit den Weihnachtsbaum so voll zu machen, musstest"}, {"id": 43, "start": 357.2, "end": 361.52, "text": "dir irgendwie 30 solcher Ketten kaufen. Für den Weihnachtsbaum und wie gesagt"}, {"id": 44, "start": 361.52, "end": 366.6, "text": "Treppenbeleuchtung habe ich damit gemacht. Ja, ich glaube sowas hier in der"}, {"id": 45, "start": 366.6, "end": 376.04, "text": "Richtung war das. Allerdings halt nicht einfarbig, sondern RGB. Wie das die coolen Leute sagen."}, {"id": 46, "start": 376.04, "end": 381.56, "text": "Müssen wir mal gucken, weil die sind ja auch nicht alle richtig steuerbar. Ich muss"}, {"id": 47, "start": 381.56, "end": 385.64, "text": "nachgucken. Keine Ahnung, kann ich nicht machen gerade. RGB, Weihnachtsbaum, ja klar."}, {"id": 48, "start": 385.64, "end": 390.28, "text": "Meine LED-Ketten für den Weihnachtsbaum sind seit Jahren schon wie LED"}, {"id": 49, "start": 390.28, "end": 403.0, "text": "gesteuert mit RGB. Mein Weihnachtsbaum ist 2022. Razor Templates, na ja, ich"}, {"id": 50, "start": 403.0, "end": 407.16, "text": "persönlich mag es nicht sonderlich, muss ich ehrlich sagen. Und Blazer ist ja"}, {"id": 51, "start": 407.16, "end": 415.8, "text": "quasi Razor Templates. Halt im Browser, also ich mag ich persönlich mag es nicht"}, {"id": 52, "start": 415.8, "end": 422.12, "text": "sonderlich. Wenn man aber.NET Server-Site-Rendern machen will. Nicht Strips,"}, {"id": 53, "start": 422.12, "end": 425.8, "text": "sowas hier habe ich für Weihnachtsbaum. Guck mal, das sind keine Strips. Das sind,"}, {"id": 54, "start": 425.8, "end": 430.72, "text": "die sind nur an so dünnen Drähten dran. Ich weiß nicht ob man das hier irgendwie erkennt."}, {"id": 55, "start": 430.72, "end": 436.8, "text": "Das sieht man hier gar nicht richtig. Guck mal, das sind keine Strips,"}, {"id": 56, "start": 436.8, "end": 441.36, "text": "die sind die LEDs, sind an so dünnen Drähten dran und dann ist einfach so ein,"}, {"id": 57, "start": 441.36, "end": 446.68, "text": "ja was ist denn das? Wahrscheinlich Billig-China-Chinesen-Heißkleber oder so,"}, {"id": 58, "start": 446.68, "end": 450.36, "text": "der da drum gemacht ist. Nee, nee, das sind keine Strips."}, {"id": 59, "start": 450.36, "end": 459.32, "text": "Ja, also wenn du.NET Server-Site-Rendern machen willst, dann kommst du ja um Razor"}, {"id": 60, "start": 459.32, "end": 464.56, "text": "Templates nicht wirklich rum. In beschränkter Maße zu benutzen, warum nicht?"}, {"id": 61, "start": 464.56, "end": 469.6, "text": "Aber ich mache eigentlich immer nur die Kombination reines RP-Backend und dann"}, {"id": 62, "start": 469.6, "end": 472.92, "text": "irgendeine reine Klein-Site-Anwendung. Wenn du jetzt natürlich irgendwas hast,"}, {"id": 63, "start": 472.92, "end": 475.92, "text": "was auch von der Suchmaschine gefunden werden soll, dann ist es wieder was anderes."}, {"id": 64, "start": 475.92, "end": 479.88, "text": "Wobei selbst dann würde ich wahrscheinlich keine Razor Templates nehmen, sondern"}, {"id": 65, "start": 479.88, "end": 485.36, "text": "irgendwas anderes Server-Site-Rendering-mäßiges, was zu meinem Frontend-Framework passt."}, {"id": 66, "start": 485.36, "end": 493.32, "text": "Ja, Blazer ist immer noch der heiße Scheiß bei Microsoft. Die ganzen neuen Sachen,"}, {"id": 67, "start": 493.32, "end": 499.32, "text": "die bei ASP.NET reinkommen, sind irgendwie 80% Blazer-Kram. Ich persönlich, wie gesagt,"}, {"id": 68, "start": 499.32, "end": 510.44, "text": "habe ich keine Ahnung. Was ist denn das für eine komische, was ist denn das für eine komische"}, {"id": 69, "start": 510.44, "end": 521.56, "text": "Url? Piped. Das ist definitiv nicht meine YouTube Domain. Das replacet diese Seite,"}, {"id": 70, "start": 521.56, "end": 540.2, "text": "oder? Keine Ahnung. Also die haben total viel neues. Ich bin aber kein Fan von Blazer. Ich"}, {"id": 71, "start": 540.2, "end": 545.92, "text": "finde für WebAssembly eignet sich das so in der Art und Weise nicht richtig. Die laden ja auch"}, {"id": 72, "start": 545.92, "end": 550.84, "text": "die komplette Runtime runter, anstatt das zu kompilieren und dann jittert das nicht mal"}, {"id": 73, "start": 550.84, "end": 557.32, "text": "richtig. Das ist ganz, ganz komisch. Die letzten Reserven, ich habe nicht mal viel. Ich habe von"}, {"id": 74, "start": 557.32, "end": 565.8, "text": "den Dingern hier, habe ich noch, also hier da, die da, habe ich noch keine Ahnung. Also ich habe"}, {"id": 75, "start": 565.8, "end": 571.12, "text": "insgesamt vier Stück. Jetzt noch zum Flaschen. Drei im Schrank, eins da. Eines ist hier abgeraucht,"}, {"id": 76, "start": 571.12, "end": 575.24, "text": "eine liegt noch da hinten. Danach ist weg. Aber das reicht ja auch an Steckdosenleisten. Wir"}, {"id": 77, "start": 575.24, "end": 579.12, "text": "brauchen nicht jeden Tag neue Steckdosenleisten. Aber ich habe mir gedacht, solange wir die jetzt"}, {"id": 78, "start": 579.12, "end": 583.52, "text": "rumliegen, es wird mal Zeit, die langsam aber sicher zu flaschen. Übrigens, Leute, jetzt"}, {"id": 79, "start": 583.52, "end": 586.32, "text": "wollen wir gerade dabei sein. Ich muss euch mal was zeigen. Warte mal, ich mach mal kurz,"}, {"id": 80, "start": 586.32, "end": 594.36, "text": "mach mal kurz. Big Gatschi-Buzz. Schaut mal. Schaut mal, guckt mal. Ich mach mal kurz,"}, {"id": 81, "start": 594.36, "end": 602.68, "text": "ich mach mal kurz den Keks weg und den Shelley weg und das Ding weg. So, schaut mal, ich bin,"}, {"id": 82, "start": 602.68, "end": 608.16, "text": "glaube ich, der Einzige gerade auf der Welt, der noch zwei Raspberry Pi 4s rumliegen hat."}, {"id": 83, "start": 608.16, "end": 614.48, "text": "Danach noch im gescheiten Gehäuse. Ich habe noch zwei Picos und noch zwei Zero Ws, äh"}, {"id": 84, "start": 614.48, "end": 626.2, "text": "Zero 2 Ws. Also ich bin da noch gut ausgestattet. Ansonsten ist es ja gerade schwierig, was"}, {"id": 85, "start": 626.2, "end": 632.4, "text": "zu kriegen. Der muss irgendwie hier hinten in der Ecke, in die Ecke, sodass man sieht."}, {"id": 86, "start": 632.4, "end": 642.2, "text": "Sieht man den? Jawoll, sehr gut. Lenkt nur minimal ab. Aber irgendwie so, so kommt der"}, {"id": 87, "start": 642.2, "end": 649.68, "text": "in die Ecke. Der muss irgendwie zugucken. Was liegt denn hier eigentlich alles für"}, {"id": 88, "start": 649.68, "end": 668.52, "text": "einen Crap rum? Weg. So, hier guckt ihr jetzt. Ein Dreier habe ich auch noch irgendwo. Keine,"}, {"id": 89, "start": 668.52, "end": 672.72, "text": "weil man nicht weiß, ob die flashbar sind, es sei denn du findest die User Bewertung,"}, {"id": 90, "start": 672.72, "end": 677.6, "text": "die sagen, dass die explizit flashbar sind innerhalb der letzten paar Wochen noch. Prinzipiell"}, {"id": 91, "start": 677.6, "end": 682.28, "text": "kann man da aktuell nichts empfehlen. Die hier habe ich mir auch schon gekauft vor, ähm,"}, {"id": 92, "start": 682.28, "end": 685.68, "text": "man sieht doch auch schon ein bisschen staubig. Die habe ich mir auch schon gekauft vor fast"}, {"id": 93, "start": 685.68, "end": 691.04, "text": "einem Jahr oder so. Und nicht verwirren lassen, weil da Hammer drauf steht. Das hat mit Hammer"}, {"id": 94, "start": 691.04, "end": 700.32, "text": "so gut wie nichts zu tun. Das sind China-Leisten. Exakt die gleichen, die früher Gosund verkauft"}, {"id": 95, "start": 700.32, "end": 708.24, "text": "und die dann sonst wer verkauft. Das ist alles China-OEM-Krempel, den die weiter verschachert"}, {"id": 96, "start": 708.24, "end": 719.0, "text": "haben. Wenn die Sachen schon direkt mit TASMOTA verkaufen, ist nicht schlecht. Das war der"}, {"id": 97, "start": 719.0, "end": 724.76, "text": "Vorteil, die war günstiger. Und es sind auch nur 3 Stecker. Ich finde 4 Stecker ist so,"}, {"id": 98, "start": 724.76, "end": 731.32, "text": "4 Stecker und 4xUSB ist so der, wie sagt man so, der sweet spot. 3 Stecker sind ein bisschen"}, {"id": 99, "start": 731.32, "end": 738.8, "text": "wenig, aber auf jeden Fall besser als China-Chinesen Cloud Crap. Die andere Alternative wäre irgendwelche"}, {"id": 100, "start": 738.8, "end": 747.28, "text": "Lidl Zigbee Steckdosen leisten. Ja, ne November habe ich die. Woher weißt du, wann ich die"}, {"id": 101, "start": 747.28, "end": 761.0, "text": "gekauft habe? Kein Quatsch. Storm of Nemesis, danke für den Sub. Wofür schlecht man Steckdosen"}, {"id": 102, "start": 761.0, "end": 768.76, "text": "leisten? Dass man sowas hier machen kann. Dass man ein Webinterface hat, wo man dann"}, {"id": 103, "start": 768.76, "end": 776.84, "text": "Sachen an und ausschalten kann. Ok, das ist jetzt mein Luftqualitätssensor, der war jetzt"}, {"id": 104, "start": 776.84, "end": 784.52, "text": "ein schlechtes Beispiel. Der da vielleicht. Ja guckt, dann hat man zum Beispiel sowas"}, {"id": 105, "start": 784.52, "end": 789.0, "text": "hier. Da hat man ein Webinterface, wo man die Sache an und ausschalten kann. Ich schalte"}, {"id": 106, "start": 789.0, "end": 792.6, "text": "es jetzt nicht an und aus, weil ich nicht weiß, welche Steckdose das ist. Ich glaube,"}, {"id": 107, "start": 792.6, "end": 801.52, "text": "das ist der Heizlüfter bzw. Ventilator im Bad vermute ich mal. TASMOTA Version uralt."}, {"id": 108, "start": 801.52, "end": 807.28, "text": "Nee, das ist die für 3D-Drucker glaube ich. Guck mal, TASMOTA Version uralt. IP-League,"}, {"id": 109, "start": 807.28, "end": 816.96, "text": "oh nein. Leute, hackt mich nicht. Hackt mich nicht. Trotz IP-League. Seid nett, Chat."}, {"id": 110, "start": 816.96, "end": 838.72, "text": "Ich meine, ihr seid wahrscheinlich eh schon drin. Ja, die TASMOTA Version ist uralt,"}, {"id": 111, "start": 838.72, "end": 850.32, "text": "so der Vorteil ist folgendes. Ich werde es jetzt nochmal kurz erzählen. Wer hat den gefragt?"}, {"id": 112, "start": 850.32, "end": 861.88, "text": "Wo ist es denn? Hier, also es hat mehrere Vorteile. Normalerweise, guck mal hier, zum Beispiel"}, {"id": 113, "start": 861.88, "end": 867.08, "text": "dieses Teil. Das ist ein bisschen mitgenommen, ich habe es hier gerade liegen, deswegen zeige"}, {"id": 114, "start": 867.08, "end": 870.56, "text": "ich es jetzt nochmal. Zum Beispiel dieses Teil hier. Ja, das ist eine Steckdoseleiste"}, {"id": 115, "start": 870.56, "end": 875.6, "text": "oder, warte mal, ich habe hier glaube ich noch ein besseres Beispiel, irgendwo rumfliegen."}, {"id": 116, "start": 875.6, "end": 884.44, "text": "Nee, egal. Also sprich, guck mal, das ist eine Steckdoseleiste mit, kann den Strom messen,"}, {"id": 117, "start": 884.44, "end": 888.76, "text": "so in beschränkter Maße sagen wir mal, wenn China Zeug so genau ist, das nennt. Kann"}, {"id": 118, "start": 888.76, "end": 893.88, "text": "es Strom messen, hast zwei Mal einen ausgenommen, hast zwei Stecker, leider hier kein USB. Warum"}, {"id": 119, "start": 893.88, "end": 898.92, "text": "ist die so mitgenommen? Moment, ich mache mal kurz das Bild ein bisschen größer. Ach"}, {"id": 120, "start": 898.92, "end": 905.36, "text": "so, ich muss ja noch das Licht anmachen, ich habe gar nicht das Licht an, wartet mal hier."}, {"id": 121, "start": 905.36, "end": 913.84, "text": "Ja, Chet, was sagt ihr? Mit Ringlight oder ohne Ringlight? Mit, oder? Mit ist auf jeden"}, {"id": 122, "start": 913.84, "end": 923.56, "text": "Fall besser, dann erkennt man besser was. Ich denke mal, obwohl es aktuell halt auch"}, {"id": 123, "start": 923.56, "end": 928.92, "text": "noch schön hell ist. So, also guckt mal, die sieht halt noch ein bisschen mitgenommen"}, {"id": 124, "start": 928.92, "end": 932.56, "text": "aus hier, ihr seht es innen drin und ihr seht es auch hier noch. Vielleicht erinnert sich"}, {"id": 125, "start": 932.56, "end": 935.92, "text": "der ein oder andere, guckt euch mal das hier an, vielleicht erinnert sich der ein oder"}, {"id": 126, "start": 935.92, "end": 941.0, "text": "andere, das war das Ding, was wir im Stream mal aufgebrochen haben mit dem Schraubendreher,"}, {"id": 127, "start": 941.0, "end": 947.12, "text": "um an den Chip zu kommen, was gar nicht notwendig gewesen wäre, weil ich festgestellt habe,"}, {"id": 128, "start": 947.12, "end": 954.24, "text": "hier unten drunter ist eine Schraube, um das Ganze aufzumachen. So, und der Vorteil, wenn"}, {"id": 129, "start": 954.24, "end": 959.04, "text": "du so ein Ding hier hast, geflasht, oder wenn du so eine Steckdosenleiste hast, geflasht,"}, {"id": 130, "start": 959.04, "end": 966.04, "text": "versus Stock mit China-Firmware ist, du brauchst keine China-Chinesen-App auf deinem Smartphone,"}, {"id": 131, "start": 966.04, "end": 973.36, "text": "um das Ganze zu benutzen. Du kannst es einfacher in deine Heimautomatisierung integrieren,"}, {"id": 132, "start": 973.36, "end": 979.96, "text": "weil das normale Standards unterstützt, das hat HTTP-Schnittstelle, das hat MQTT-Schnittstelle,"}, {"id": 133, "start": 979.96, "end": 983.44, "text": "du kannst es generell über ein Webinterface steuern, was du normalerweise auch nicht machen"}, {"id": 134, "start": 983.44, "end": 989.52, "text": "kannst. Und im Zweifelfall hast du sogar neue Funktionen, du kannst die Automatisierung"}, {"id": 135, "start": 989.52, "end": 993.12, "text": "hinterlegen, wenn du es direkt da drauf machen willst. So, keine Ahnung, morgens um fünf"}, {"id": 136, "start": 993.12, "end": 997.68, "text": "einen ausschalten, das Motor lässt sich ja auch beschränkt scripten. Also es ist eigentlich"}, {"id": 137, "start": 997.68, "end": 1004.12, "text": "nur von Vorteil im Vergleich zu... Achso, ja und das wichtigste habe ich ganz vergessen,"}, {"id": 138, "start": 1004.12, "end": 1008.36, "text": "keine China-Chinesen-Firmware, die nach Hause funkt, falls sie das macht. Wahrscheinlich"}, {"id": 139, "start": 1008.36, "end": 1016.08, "text": "macht sie das. Das beste was man machen kann ist, WLAN-Geräte zu flashen. Bisschen Asynchro"}, {"id": 140, "start": 1016.08, "end": 1026.48, "text": "in die Kamera, guck mal hier. Na ja, passt halbwegs. Weiß nicht warum, vielleicht falscher"}, {"id": 141, "start": 1026.48, "end": 1032.04, "text": "Codec eingestellt oder so. Weiß nicht. So und deswegen flasht man Steckdosen, weil man"}, {"id": 142, "start": 1032.04, "end": 1046.32, "text": "ja kein Noob sein will, der den Chinesen Zeug heim schickt. Ne? So siehts aus. Deswegen"}, {"id": 143, "start": 1046.32, "end": 1049.72, "text": "wird der Kram heute geflashed, wir müssen jetzt erstmal den Raspberry Pi Blatt machen."}, {"id": 144, "start": 1049.72, "end": 1055.92, "text": "Ich glaube wir nehmen den hier, weil, Achtung, da ist glaube ich unser Zappix drauf, an dem"}, {"id": 145, "start": 1055.92, "end": 1063.88, "text": "wir irgendwann mal weiter bauen wollten. Und wenn ich den lösche, dann ist... Moment,"}, {"id": 146, "start": 1063.88, "end": 1071.32, "text": "der Zappix ist da drauf. Ich könnte einfach, könnte einfach die SSD nehmen per USB und"}, {"id": 147, "start": 1071.32, "end": 1078.76, "text": "dann die flashen. Wobei scheiß drauf, ich nehme den Raspberry Pi. Ich nehme den hier,"}, {"id": 148, "start": 1078.76, "end": 1090.52, "text": "da ist eine SD-Karte drin und dann ist gut. So machen wir das. Die WLAN-Sachen sind gar"}, {"id": 149, "start": 1090.52, "end": 1097.0, "text": "nicht schlecht. ZigBee-Sachen sind in der Regel, je nachdem was es ist, bisschen teurer, aber"}, {"id": 150, "start": 1097.0, "end": 1102.8, "text": "nicht so krass wie Z-Wave. Und haben bei weitem nicht die Funktion, wie das geflashte WLAN-Gerät"}, {"id": 151, "start": 1102.8, "end": 1111.28, "text": "mit Tasmota hat. Kann man machen. Aber ich habe zum Beispiel noch keine gute ZigBee-Steckdosenleiste"}, {"id": 152, "start": 1111.28, "end": 1116.28, "text": "gefunden mit 4x USB und 4 Steckern. Oder am besten, wenn es an mir geht, dürfte es"}, {"id": 153, "start": 1116.28, "end": 1119.56, "text": "theoretisch auch noch ein 5. Stecker sein. Hätte ich auch keine Schmerz mit. Platz wäre"}, {"id": 154, "start": 1119.56, "end": 1129.32, "text": "ja gewesen, aber die Chinesen haben sich gedacht, ne, das wollten wir nicht. Ja, kann man auch"}, {"id": 155, "start": 1129.32, "end": 1141.76, "text": "machen. Ja, NFC-Tax bzw. RFID-Tax sind extrem underrated. Sind das normale Werte für PC"}, {"id": 156, "start": 1141.76, "end": 1146.0, "text": "mit zwei Monitoren? Chandler, ich klick von dir keine Links im Stream an, wenn ich nicht"}, {"id": 157, "start": 1146.0, "end": 1163.28, "text": "weiß, was es ist. Warte mal. Sind das normale Werte für zwei Monitoren? Ok, das ist tatsächlich"}, {"id": 158, "start": 1163.28, "end": 1176.44, "text": "country bait. Das ist ein richtig echter, normaler Link. Ok. Ähm, also. Sind das normale"}, {"id": 159, "start": 1176.44, "end": 1189.36, "text": "Werte? Na gut, Energie total. Das ist ganz schön viel. Was? Das glaube ich nicht, dass"}, {"id": 160, "start": 1189.36, "end": 1208.48, "text": "du... Das ist ein bisschen viel? Was hast du da dran hängen? Na gut, Moment. Today."}, {"id": 161, "start": 1208.48, "end": 1221.8, "text": "Na, knapp, knapp ein Ampere, ok, aber. Na, das passt doch. 193 Watt. Das kann doch sein,"}, {"id": 162, "start": 1221.8, "end": 1226.16, "text": "je nachdem was du für Monitor hast, aber für normale Monitore ein bisschen viel, aber"}, {"id": 163, "start": 1226.16, "end": 1238.4, "text": "ja, möglich, ja. Echt? Wirklich? Gar keine Absicht? Habe ich gar nicht geplant."}, {"id": 164, "start": 1238.4, "end": 1262.56, "text": "Hat sich einfach so ergeben. Patrick, du hast den Chat verwirrt. Guck mal. Hier bist du"}, {"id": 165, "start": 1262.56, "end": 1268.48, "text": "hellgrün, da bist du dunkelgrün. Und es ist nicht, weil ich es irgendwie markiert hätte"}, {"id": 166, "start": 1268.48, "end": 1273.28, "text": "oder so. Das ist, weil Twitch der Meinung war, hier musst du einmal hellgrün sein, einmal"}, {"id": 167, "start": 1273.28, "end": 1282.0, "text": "dunkelgrün. Oder sagen wir normalgrün und hellgrün. Weiß, war wie gesagt überhaupt"}, {"id": 168, "start": 1282.0, "end": 1288.16, "text": "nicht geplant. Bei mir auf dem zweiten Monitor sind die Farben auch normal, aber hier in"}, {"id": 169, "start": 1288.16, "end": 1299.48, "text": "meinem Chat nicht. Was auch immer. Ja, also, wie gesagt, also ich habe diese Steckdosen,"}, {"id": 170, "start": 1299.48, "end": 1306.72, "text": "ach nicht die da. Diese Steckdosenleiste war ungefähr in einem Jahr gekauft. Kann man"}, {"id": 171, "start": 1306.72, "end": 1313.44, "text": "die noch finden bei Amazon? Ja. Dieses Teil hatte ich mir damals irgendwie im 5er Pack"}, {"id": 172, "start": 1313.44, "end": 1320.08, "text": "oder so gekauft. Und jetzt bin ich mal gespannt, ob die noch flashbar sind. Die müsste noch"}, {"id": 173, "start": 1320.08, "end": 1327.4, "text": "flashbar sein, weil ich habe aus diesem 5er Pack ja schon welche geflashed und die gingen."}, {"id": 174, "start": 1327.4, "end": 1335.0, "text": "Die Frage ist halt eher, ob das aktuell noch geht. Und da würde ich mich nicht drauf verlassen."}, {"id": 175, "start": 1335.0, "end": 1343.96, "text": "Sprich, wenn ihr das jetzt seht im Stream. Neueste. Wenn ihr das seht im Stream, nicht"}, {"id": 176, "start": 1343.96, "end": 1348.28, "text": "unbedingt kaufen, einfach weil man sieht, dass es im Stream flashbar ist. Also ich weiß"}, {"id": 177, "start": 1348.28, "end": 1356.6, "text": "nicht, ob die aktuell noch flashbar sind. Die sind schon fast ein Jahr alt. Alternative"}, {"id": 178, "start": 1356.6, "end": 1361.68, "text": "Firm war flashbar, 30. Juni. Ja neun, die Steckdosenleiste bekommen gibt immer noch"}, {"id": 179, "start": 1361.68, "end": 1365.24, "text": "mit Tuya Convert. Ja wir machen das jetzt auch mit Tuya Convert, weil ich habe keinen"}, {"id": 180, "start": 1365.24, "end": 1374.08, "text": "Bock den Kram aufzuschrauben oder sowas in der Richtung. Und siehst du, das ist was,"}, {"id": 181, "start": 1374.08, "end": 1379.6, "text": "was mich standardmäßig schon etwas, wie soll ich sagen, misstrauisch machen würde. Wenn"}, {"id": 182, "start": 1379.6, "end": 1385.52, "text": "ich standardmäßig von überall auf der Welt meine Steckdosenleiste daheim schalten könnte."}, {"id": 183, "start": 1385.52, "end": 1394.16, "text": "Das bedeutet nämlich, die China-Chinesen haben quasi jetzt einen VPN bei euch ins Netzwerk"}, {"id": 184, "start": 1394.16, "end": 1400.88, "text": "daheim. Ich weiß nicht, ob man das haben will. Und es ist kein richtiges VPN, aber naja,"}, {"id": 185, "start": 1400.88, "end": 1405.68, "text": "also man könnte es als Zwischenhop verwenden. Also sprich, allein schon dadurch, dass man"}, {"id": 186, "start": 1405.68, "end": 1410.32, "text": "mit der App die Steckdosenleiste schalten kann, ist schon mal irgendwas, irgendwas bisschen"}, {"id": 187, "start": 1410.32, "end": 1416.92, "text": "schäpp. Ich mein, in Wirklichkeit wird es wahrscheinlich so gehen, hoffe ich mal, dass"}, {"id": 188, "start": 1416.92, "end": 1421.56, "text": "die Steckdosenleiste sich zum Server verbindet und auf dem Server geschaltet wird bei den"}, {"id": 189, "start": 1421.56, "end": 1426.16, "text": "China-Chinesen und dann die Steckdosenleiste das quasi subscribt hat über Websocket oder"}, {"id": 190, "start": 1426.16, "end": 1431.36, "text": "sowas. Ich gehe nicht davon aus, dass es sich wirklich verbindet auf eure Steckdosenleiste,"}, {"id": 191, "start": 1431.36, "end": 1436.48, "text": "aber man weiß es nicht. Und die Möglichkeiten sind auf jeden Fall da und das ist ein weiterer"}, {"id": 192, "start": 1436.48, "end": 1450.08, "text": "Grund, warum ich den Kram immer flashen würde. Du bist direkt im China-Botnetz, ja klar."}, {"id": 193, "start": 1450.08, "end": 1455.2, "text": "Tasmota möglich, ok. Das finde ich schon mal gut, dass so viele Leute schreiben. Anscheinend"}, {"id": 194, "start": 1455.2, "end": 1462.68, "text": "kann man das Ding immer noch Tasmota flashen. Was ja auch so gut wie der einzige Verkaufsargument"}, {"id": 195, "start": 1462.68, "end": 1472.04, "text": "ist. Ohne das Tasmota-Flashen würde ich den Kram im Leben nicht kaufen. Die Gose und App"}, {"id": 196, "start": 1472.04, "end": 1477.8, "text": "exposed auch deine Public-IP. Ist wirklich so? Ja gut, bei dem China-Kram würde ich mich"}, {"id": 197, "start": 1477.8, "end": 1486.52, "text": "echt nicht wundern. Achja, wo wir gerade dabei sind, dem China-Zeug nicht trauen. Ich zeige"}, {"id": 198, "start": 1486.52, "end": 1506.16, "text": "euch mal was. Zeige euch mal was. So viel zu dem China-Kram Misstrauen. Seht ihr das"}, {"id": 199, "start": 1506.16, "end": 1524.28, "text": "da? Verleuchtet euch da was auf. Außer dass es dreckig ist. So und die lag im Keller."}, {"id": 200, "start": 1524.28, "end": 1529.72, "text": "Man sieht das ja auch, die ist etwas mitgenommen. Die lag im Keller irgendwie zwei Jahre oder"}, {"id": 201, "start": 1529.72, "end": 1538.0, "text": "so. Aber der Chat ist der Meinung, ist alles gut, die Steckdosenleiste war es nicht. Das"}, {"id": 202, "start": 1538.0, "end": 1544.92, "text": "lag am Netzteil, was da drinnen gesteckt hat. Also wenn ich dem Chat vertraue, weiß"}, {"id": 203, "start": 1544.92, "end": 1550.08, "text": "ich noch nicht so genau ob ich das machen sollte in dieser Frage. Wenn ich dem Chat traue,"}, {"id": 204, "start": 1550.08, "end": 1558.04, "text": "dann ist mit der Steckdosenleiste alles in Ordnung und die geht immer noch. Das war"}, {"id": 205, "start": 1558.04, "end": 1563.2, "text": "angeblich das Netzteil sagt der Chat. Und der Chat hat ja bekanntlichermaßen bei sowas"}, {"id": 206, "start": 1563.2, "end": 1581.12, "text": "recht. So ich mache das Ding mal wieder weg. Eigentlich liegt das Ding schon auf dem Müll,"}, {"id": 207, "start": 1581.12, "end": 1588.2, "text": "aber ich habe es jetzt rausgeholt wieder. Gut also ich würde sagen wir schnappen uns"}, {"id": 208, "start": 1588.2, "end": 1591.4, "text": "mal den Raspberry Pi, wir machen mal kurz die Leiste hier weg, schnappen uns den Raspberry"}, {"id": 209, "start": 1591.4, "end": 1599.96, "text": "Pi, ziehen die Micro SD Karte raus und flashen die mal. Und dann machen wir den ab und schließen"}, {"id": 210, "start": 1599.96, "end": 1608.12, "text": "das Ding da an. Habe ich noch den aktuellen Raspberry Pi Image da drauf? Neues YouTube"}, {"id": 211, "start": 1608.12, "end": 1613.0, "text": "wie der Twitch Chat fackelt meine Bude ab. Das müsste schon ein bisschen clickbaitier"}, {"id": 212, "start": 1613.0, "end": 1624.92, "text": "sein dieser Titel. Ähm ich habe ein Problem. Ah ne habe ich nicht. Ich habe noch einen"}, {"id": 213, "start": 1624.92, "end": 1642.64, "text": "gefunden guck mal. Gibot Cardreader mit der Krone. Normalerweise verwende ich einen anderen,"}, {"id": 214, "start": 1642.64, "end": 1647.04, "text": "aber ich weiß nicht wo der gerade steckt. Der müsste auch hier liegen aber macht er"}, {"id": 215, "start": 1647.04, "end": 1666.48, "text": "nicht. Machs gut Stripes. Orchester ruft. Pippo Jam. So flashen wir das Ding mal. Blllllllllllllllllll"}, {"id": 216, "start": 1666.48, "end": 1677.52, "text": "Windows Sound. Alter warum steckt man USB? Prinzipiell falsch rum rein. Was ist es mit"}, {"id": 217, "start": 1677.52, "end": 1697.32, "text": "dem USB? Nein nicht boot. Das soll an die VM durchgereicht werden. Nein. Äh nein. Ja."}, {"id": 218, "start": 1697.32, "end": 1716.72, "text": "Schon besser. Schon besser. Ja weil es USB C ist wahrscheinlich. Die Steckdose fängt"}, {"id": 219, "start": 1716.72, "end": 1721.84, "text": "doch kein Feuer nur weil sie flasht. Die Steckdose fängt vielleicht Feuer weil China Chinesen"}, {"id": 220, "start": 1721.84, "end": 1727.68, "text": "Zeug ist. Aber ich muss euch ehrlich sagen ich hatte bis jetzt noch nix was abgeraucht"}, {"id": 221, "start": 1727.68, "end": 1732.4, "text": "ist. Wenn wir mal davon ausgehen dass die Steckdoseleiste in Ordnung ist weil der Chat das sagt und"}, {"id": 222, "start": 1732.4, "end": 1740.16, "text": "wenn der Chat das sagt muss das ja so sein. Also mir fällt jetzt so spontan nix an was"}, {"id": 223, "start": 1740.16, "end": 1753.28, "text": "mehr abgeraucht ist. So flashen wir den Karma. Also auf gehts. Raspberry Pi Imager. Nee"}, {"id": 224, "start": 1753.28, "end": 1760.12, "text": "Pi Imager. Imager. Pi Imager. Meine Güte. Kurz gucken ob es Updates gibt. Schnell schnell"}, {"id": 225, "start": 1760.12, "end": 1772.64, "text": "checken. Zeig mal her. Updates. Updates. Updates. Nein nicht ok. Hier auch nicht oder ich kann"}, {"id": 226, "start": 1772.64, "end": 1778.92, "text": "grad nicht tippen. Es ging nicht ums flashen. Es ging halt darum dass ich dem China Zeug"}, {"id": 227, "start": 1778.92, "end": 1782.44, "text": "nicht traue. Ja da hast du recht dem China Zeug kann man auch nicht wirklich trauen."}, {"id": 228, "start": 1782.44, "end": 1790.68, "text": "Es ist halt so. In dem Fall ist es halt ein deutscher Resale. Ja es ist aber immer noch"}, {"id": 229, "start": 1790.68, "end": 1798.12, "text": "China Chinesen Zeug. Und da können noch so viele CE Zeichen und sonst was drauf sein."}, {"id": 230, "start": 1798.12, "end": 1806.0, "text": "Das interessiert die Chinesen ja nicht. Die drucken das halt drauf und gut ist. Ich hab"}, {"id": 231, "start": 1806.0, "end": 1812.16, "text": "keine Ahnung ehrlich gesagt was davon geprüft werden muss und was nicht. Aber wenn man bei"}, {"id": 232, "start": 1812.16, "end": 1819.04, "text": "express kauft ist wahrscheinlich eh verloren. Wenn man bei Amazon.de kauft sollte das eigentlich"}, {"id": 233, "start": 1819.04, "end": 1833.0, "text": "alles den Vorgaben entsprechen aber ob das jemand kontrolliert glaube ich nicht. Nee"}, {"id": 234, "start": 1833.0, "end": 1838.8, "text": "das geht nicht mit Arduino und Co. Das ist es ja gerade. Wenn es mit Arduino und Co gehen"}, {"id": 235, "start": 1838.8, "end": 1847.92, "text": "würde würde ich es mir mal angucken aber so verstehe ich den Sinn von Carbo nicht. Longboard"}, {"id": 236, "start": 1847.92, "end": 1855.84, "text": "ist doch nicht mehr Hipster. Longboard war 2011 oder so Hipster wo Dana und Unge Longboard"}, {"id": 237, "start": 1855.84, "end": 1861.28, "text": "Tour gemacht haben. Wie hieß der dritte Typ im Bunde damals? Ich hab das nie wirklich"}, {"id": 238, "start": 1861.28, "end": 1874.0, "text": "ausführlich geguckt aber ich war noch zu dritt oder? War das Julien Bam? Nee oder? Cheng"}, {"id": 239, "start": 1874.0, "end": 1880.52, "text": "das kann sein. Ich weiß zwar nicht wer Cheng ist aber doch was sah asiatisch aus der dabei"}, {"id": 240, "start": 1880.52, "end": 1887.44, "text": "war. Ich kann mich noch dunkel dran erinnern. So also dann flashen wir den Raspberry Pi"}, {"id": 241, "start": 1887.44, "end": 1903.72, "text": "jetzt mal. Imager. Gib ihm. So Choose OS. War das so? An den kann ich mich da gar nicht"}, {"id": 242, "start": 1903.72, "end": 1908.68, "text": "dran erinnern. Wie gesagt ich hab das aber auch nie sonderlich ausführlich geguckt."}, {"id": 243, "start": 1908.68, "end": 1915.8, "text": "So Choose OS was wollen wir haben? Äh ehrlich gesagt ich nehm ein 32bit Leute wisst ihr"}, {"id": 244, "start": 1915.8, "end": 1921.36, "text": "warum ich ein 32bit nehm ich bin mir nicht sicher ob Tuya Convert komplett mit 64bit"}, {"id": 245, "start": 1921.36, "end": 1928.8, "text": "klarkommt. Sollte theoretisch aber es gibt ja keinen wirklichen Grund es zu machen mit"}, {"id": 246, "start": 1928.8, "end": 1940.0, "text": "64bit in dem Fall. Also Raspberry Pi OS Lite 32bit 32G SSD Riot was? Ach Moment Moment"}, {"id": 247, "start": 1940.0, "end": 1954.08, "text": "Edit Settings jaja. Enable SSH. Bestes Passwort Leute. 1 2 1 2 3 4 5 6 Best Practice Passwort"}, {"id": 248, "start": 1954.08, "end": 1972.64, "text": "da kommt ihr nie drauf. Ok Riot. Yes. Gib ihm. Du benutzt seit 3 Jahren Arch als Main OS"}, {"id": 249, "start": 1972.64, "end": 1980.12, "text": "einzig wahre. Die komischen Flex in Commands aus deiner History machen mir Angst. Welche"}, {"id": 250, "start": 1980.12, "end": 1992.76, "text": "Flex denn? Was denn wo denn? Hier oder was? Das da? Oder das da? Wieso? Ganz normal."}, {"id": 251, "start": 1992.76, "end": 2012.08, "text": "Achso ihr Devil ist weil ich Git Repos habe. Das muss man machen. Ja aber Pacman kann man"}, {"id": 252, "start": 2012.08, "end": 2018.64, "text": "sich glaube ich einen Y sparen. Ok die Micro SD Karte ist High Speed wie es aussieht. Warum"}, {"id": 253, "start": 2018.64, "end": 2024.2, "text": "2x Y hat glaube ich keinen tieferen Sinn. Ich glaube du kannst sogar 3x Y machen und"}, {"id": 254, "start": 2024.2, "end": 2034.44, "text": "es passiert nichts. Einfach 69xY. Mal mal ausprobieren ob das funktioniert während er"}, {"id": 255, "start": 2034.44, "end": 2055.28, "text": "gerade verified. Funktioniert guckt. 669xY. So muss das sein."}, {"id": 256, "start": 2055.28, "end": 2069.16, "text": "So wir können es removeen vom Card Reader. Da bin ich froh dass er mir das sagt. Alles"}, {"id": 257, "start": 2069.16, "end": 2074.24, "text": "klar. So dann machen wir mal den Raspberry Pi an und installieren den ganzen Flashing"}, {"id": 258, "start": 2074.24, "end": 2093.24, "text": "Rahmen drauf. So ich mach mal groß dass ihr was seht. Erste Mal Micro SD Karte. Wem passiert"}, {"id": 259, "start": 2093.24, "end": 2106.92, "text": "das auch immer? Ich mach die eigentlich immer erst mal verkehrt. Nein. Also wir brauchen"}, {"id": 260, "start": 2106.92, "end": 2117.24, "text": "auf jeden Fall einmal Netzwerk. Netzwerk und wir brauchen Strom für den Raspberry Pi."}, {"id": 261, "start": 2117.24, "end": 2125.2, "text": "Also das da. Hab ich da noch Platz für die Steckdosenleiste? Ich hoffe mal weil es wird"}, {"id": 262, "start": 2125.2, "end": 2134.12, "text": "ein bisschen eng. So und er ist an. Er funktioniert. Jetzt muss ich nur mal kurz auf meinen Router"}, {"id": 263, "start": 2134.12, "end": 2151.64, "text": "schauen. Was das Ding für eine IP kriegt. Router muss ich gucken. Router. Um die Cisco"}, {"id": 264, "start": 2151.64, "end": 2164.96, "text": "Fans glücklich zu machen. So schauen wir mal. Was für Chinesen will Max flaschen?"}, {"id": 265, "start": 2164.96, "end": 2191.08, "text": "Du meinst warum ich LS AERT mache oder so? Äh das kann ich dir sagen. Das ist all reverse"}, {"id": 266, "start": 2191.08, "end": 2204.04, "text": "Time und human readable size. Das hat schon seinen Sinn. So Raspberry Pi 6049. SSH, Pi,"}, {"id": 267, "start": 2204.04, "end": 2221.44, "text": "yes. Ich hoffe das ist der richtige. Uptime. Ne das ist nicht der richtige. 141 Tagen Uptime."}, {"id": 268, "start": 2221.44, "end": 2247.96, "text": "Das kann nicht der richtige sein. Außerdem ist das Netz komplett falsch. Wo ist er denn?"}, {"id": 269, "start": 2247.96, "end": 2276.48, "text": "Wo ist er denn? Kein Raspberry Pi zu sehen. Switch ist an. Switch hat Link. Äh. So."}, {"id": 270, "start": 2276.48, "end": 2293.72, "text": "Ich glaube der ist. Ich glaube der hat ein Problem. Guck mal. Kackel. Ich glaube der"}, {"id": 271, "start": 2293.72, "end": 2302.92, "text": "hat ein kleines Problem. Der leuchtet nicht mehr. Der geht immer an zwischendurch und"}, {"id": 272, "start": 2302.92, "end": 2311.32, "text": "dann geht der wieder aus. Ist die SD Karte im Arsch? Normalerweise müsste der jetzt blinken"}, {"id": 273, "start": 2311.32, "end": 2325.2, "text": "aber der blinkt nicht. Das ist definitiv irgendwas nicht richtig. Der müsste jetzt eigentlich"}, {"id": 274, "start": 2325.2, "end": 2350.0, "text": "booten. Sollte ich vielleicht nochmal flashen? Ist das nicht geklappt? Zieh mal Strom ab"}, {"id": 275, "start": 2350.0, "end": 2355.72, "text": "und wieder dran. Nein das kann ich mir nicht vorstellen. Strom ist ja dran. So Strom ab."}, {"id": 276, "start": 2355.72, "end": 2366.04, "text": "Strom dran. So. Dass er am Anfang grün ist ist ja normal. Und jetzt müsste er eigentlich"}, {"id": 277, "start": 2366.04, "end": 2371.88, "text": "anfangen zu blinken gleich. Vielleicht muss man den Nintendo Trick machen Leute. Rausziehen"}, {"id": 278, "start": 2371.88, "end": 2389.0, "text": "und mal pusten. Der blinkt nicht. Das ist äußerst verdächtig. Das ist äußerst verdächtig"}, {"id": 279, "start": 2389.0, "end": 2402.64, "text": "dass der nicht blinkt. Moment hä? Was ist das jetzt? Nee der kann sich nicht entscheiden"}, {"id": 280, "start": 2402.64, "end": 2431.76, "text": "was das ist. Ich guck mal ob man jetzt irgendwas DHCP-mäßiges sieht. Nö. Nix, nix DHCP-mäßiges."}, {"id": 281, "start": 2431.76, "end": 2438.64, "text": "Ich schließe da doch kein Monitor an. Das hat gefällig zu booten. Ok ne Leute ich glaube"}, {"id": 282, "start": 2438.64, "end": 2446.24, "text": "mit der SD-Karte scheint irgendwas. Guck jetzt ist er wieder. Ich mein dass der das erste"}, {"id": 283, "start": 2446.24, "end": 2469.44, "text": "mal Boot ein bisschen braucht ist klar. Der resized ja die SSD. Das ist normal. Aber"}, {"id": 284, "start": 2469.44, "end": 2498.0, "text": "er holt sich keine DHCP-Adresse. Das stimmt schon mal. Nö. Nö. Nö. Nö. Nö. Nö. Nö."}, {"id": 285, "start": 2498.0, "end": 2515.96, "text": "Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö."}, {"id": 286, "start": 2515.96, "end": 2527.16, "text": "Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö. Nö."}, {"id": 287, "start": 2527.16, "end": 2542.04, "text": "In dem Moment wo ich sag funktioniert's, na soll mir recht sein, so Uptime, eine Minute"}, {"id": 288, "start": 2542.04, "end": 2543.36, "text": "das ist auf jeden fall der richtige."}, {"id": 289, "start": 2543.36, "end": 2553.58, "text": "So also, sudo, wir machen erstmal ein paar Updates, ja WiFi ist nicht an das ist mir"}, {"id": 290, "start": 2553.58, "end": 2556.0, "text": "auch klar, WiFi brauchen wir gleich noch für was anderes."}, {"id": 291, "start": 2556.0, "end": 2564.92, "text": "Also Ziel ist es diese Steckdosenleiste zu flashen und danach die drei andere die ich"}, {"id": 292, "start": 2564.92, "end": 2565.92, "text": "noch hab."}, {"id": 293, "start": 2565.92, "end": 2566.92, "text": "Upgrade."}, {"id": 294, "start": 2566.92, "end": 2577.84, "text": "Das smarte Wasserkocher, du meinst das Ding was wir uns mal angeguckt haben, das war total"}, {"id": 295, "start": 2577.84, "end": 2578.84, "text": "unsinnig."}, {"id": 296, "start": 2578.84, "end": 2584.48, "text": "Im besten Fall mach ich irgendeine Steckdosenleiste die ich schalten kann an Wasserkocher, Wasserkocher."}, {"id": 297, "start": 2584.48, "end": 2595.44, "text": "Du hast es für 20 Euro im Sale bekommen, was ist das?"}, {"id": 298, "start": 2595.44, "end": 2607.16, "text": "Ein smart Kettel, also ein smarter Wasserkocher für 43 Euro und was genau machst du damit"}, {"id": 299, "start": 2607.16, "end": 2609.6, "text": "mit den Smart Funktionen dass sich das lohnt?"}, {"id": 300, "start": 2609.6, "end": 2619.16, "text": "Und noch viel wichtiger, geht das auch ohne China-Chinesen-Firmware bzw. geht das ohne"}, {"id": 301, "start": 2619.16, "end": 2620.16, "text": "China-Chinesen-App?"}, {"id": 302, "start": 2620.16, "end": 2626.32, "text": "Geht das irgendwie über Bluetooth oder Zigbee oder sonst was oder wie pairt man das ganze?"}, {"id": 303, "start": 2626.32, "end": 2640.32, "text": "Mit genau 80 Grad wäre ich vorsichtig bei dem China Zeug, bei China die nehmen es mit"}, {"id": 304, "start": 2640.32, "end": 2644.68, "text": "den Werten nicht so genau, also 80 Grad könnte auch 85 oder 72 sein."}, {"id": 305, "start": 2644.68, "end": 2652.04, "text": "Ist Bluetooth, ok dann müssen wir mal gucken, dann müssen wir mal gucken, Github, Smart"}, {"id": 306, "start": 2652.04, "end": 2654.28, "text": "Kettel, da gibt es doch bestimmt schon."}, {"id": 307, "start": 2654.28, "end": 2679.92, "text": "Smart Kettel BLE-Protokoll Reverse Engineering, aha, warum ist das archivet?"}, {"id": 308, "start": 2679.92, "end": 2700.84, "text": "Der hüpft schon wieder, der ist umtriebig, muss man sagen, der ist echt umtriebig was"}, {"id": 309, "start": 2700.84, "end": 2701.84, "text": "sowas angeht."}, {"id": 310, "start": 2701.84, "end": 2709.28, "text": "Was hat er denn da schon wieder gestrickt hier?"}, {"id": 311, "start": 2709.28, "end": 2723.96, "text": "Guck mal, der unterstützt den Kram hier, was kann man damit jetzt machen?"}, {"id": 312, "start": 2723.96, "end": 2740.0, "text": "MQ hat das Home Assistant Integration, Patrick den Chinesen traue ich alles zu, boah da könnte"}, {"id": 313, "start": 2740.0, "end": 2745.0, "text": "ich mal eine Zahnbürste, das Ding brauche ich Leute, nächstes, das probiere ich mal"}, {"id": 314, "start": 2745.0, "end": 2749.16, "text": "aus, das ist doch bestimmt ein Arduino-Sketch oder sowas, was er hier am Start hat oder?"}, {"id": 315, "start": 2749.16, "end": 2757.8, "text": "Was, wait a minute, was ist das?"}, {"id": 316, "start": 2757.8, "end": 2772.04, "text": "Ah, da brauchen wir eine Kiste mit einem Bluetooth-Stick oder so, es ist schon mal interessant,"}, {"id": 317, "start": 2772.04, "end": 2779.92, "text": "weil, das Ding kann meine Waage und das Ding könnte auch meine Zahnbürste per MQTT auslesen."}, {"id": 318, "start": 2779.92, "end": 2787.48, "text": "Why not?"}, {"id": 319, "start": 2787.48, "end": 2798.96, "text": "GitHub Oral-B Bluetooth, da gibt es doch bestimmt noch mehr, Toothbrushes Library, was nicht"}, {"id": 320, "start": 2798.96, "end": 2799.96, "text": "alles gibt."}, {"id": 321, "start": 2799.96, "end": 2810.28, "text": "Get very useful and interesting information about your Toothbrush."}, {"id": 322, "start": 2810.28, "end": 2826.04, "text": "Toothbrush CLI, na endlich."}, {"id": 323, "start": 2826.04, "end": 2840.44, "text": "Toothbrush Oral-B AP, ja Leute, soweit sind wir, soweit sind wir schon, die Zahnbürste"}, {"id": 324, "start": 2840.44, "end": 2848.36, "text": "per Bluetooth, so Update ist gelaufen, Instagram haben wir noch ein paar Standard-Dinger, die"}, {"id": 325, "start": 2848.36, "end": 2854.92, "text": "wir bestimmt eh brauchen oder B-Top, wie die coolen Leute jetzt verwenden, Leute B-Top"}, {"id": 326, "start": 2854.92, "end": 2859.64, "text": "gibt es beim Raspberry Pi nicht, Sachen gibt es, B-Top ist für die richtigen Hacker-Mans,"}, {"id": 327, "start": 2859.64, "end": 2860.64, "text": "Leute."}, {"id": 328, "start": 2860.64, "end": 2869.32, "text": "Cool, Leute verwenden B-Top, H-Top, aber ganz ehrlich, ich verwende eh zu 90% immer"}, {"id": 329, "start": 2869.32, "end": 2874.84, "text": "noch H-Top, gerade weil das auf den meisten Server-Kisten sogar mittlerweile drauf ist."}, {"id": 330, "start": 2874.84, "end": 2893.76, "text": "Gatschi-Top, Moment, also T-MAX geht, brauchen wir auf jeden Fall für irgendwelche Auslastung"}, {"id": 331, "start": 2893.76, "end": 2895.44, "text": "oder so, aber ich glaube das passt schon."}, {"id": 332, "start": 2895.44, "end": 2904.48, "text": "So, und dann werden wir den Raspberry Pi gleich rebooten, achso, Moment, ich hab das allerwichtigste"}, {"id": 333, "start": 2904.48, "end": 2905.48, "text": "Programm vergessen."}, {"id": 334, "start": 2905.48, "end": 2916.76, "text": "Der Chainlaw mag den Windows-Taskmanager, hat hier jeder seine Vorlieben, also mir ist"}, {"id": 335, "start": 2916.76, "end": 2922.92, "text": "H-Top lieber, was wirklich cool ist beim Windows-Taskmanager, was ich unter Leidung auch gerne hätte,"}, {"id": 336, "start": 2922.92, "end": 2929.96, "text": "ist GPU-Auslastung von Prozessen, das wäre echt nicht verkehrt."}, {"id": 337, "start": 2929.96, "end": 2937.88, "text": "KQS-Service, was hat das damit zu tun?"}, {"id": 338, "start": 2937.88, "end": 2947.64, "text": "Was wollte ich jetzt machen, Leute, jetzt hab ich Chat gelesen, das hab ich vergessen,"}, {"id": 339, "start": 2947.64, "end": 2949.92, "text": "ich wollte rebooten, nee, wollte ich machen."}, {"id": 340, "start": 2949.92, "end": 2966.36, "text": "Im Zweifelsfall rebooten, keine Ahnung, aber ein wichtiges Programm fehlt noch, stimmt,"}, {"id": 341, "start": 2966.36, "end": 2969.84, "text": "stimmt, ihr habt recht, ASCII-Quarium fehlt noch, das muss drauf."}, {"id": 342, "start": 2969.84, "end": 2977.68, "text": "Ja, aber ich mein, integriert in irgendeinen standardmäßig vorhandenen Taskmanager, ja,"}, {"id": 343, "start": 2977.68, "end": 2983.48, "text": "also wenn H-Top beispielsweise GPU-Sachen auch anzeigen könnte, das wäre schon cool."}, {"id": 344, "start": 2983.48, "end": 2999.44, "text": "Jep Hahn, auf Raspberry Pi Reboot, gib ihm."}, {"id": 345, "start": 2999.44, "end": 3015.44, "text": "Leute, morgen Frankfurt, Frankfurt, Iron Maiden Legacy of the Beast, morgen Abend 18 Uhr,"}, {"id": 346, "start": 3015.44, "end": 3036.8, "text": "Bankbang, da, bin ich morgen Abend, im Waldstadion, wobei, das heißt ja nicht mehr Waldstadion,"}, {"id": 347, "start": 3036.8, "end": 3052.56, "text": "das heißt ja jetzt Deutsche Bank Arena, da bin ich mal wirklich gespannt drauf, ob die"}, {"id": 348, "start": 3052.56, "end": 3057.24, "text": "Alen Säge das noch hinkriegen, ich war vor zwei Jahren, nee, vor Corona war das, muss"}, {"id": 349, "start": 3057.24, "end": 3060.84, "text": "dann schon vor drei Jahren oder vier Jahren gewesen sein, da war ich schon mal in Frankfurt,"}, {"id": 350, "start": 3060.84, "end": 3068.28, "text": "das war in der Messerhalle, da war der Sound aber richtig kacke, du hast nix verstanden"}, {"id": 351, "start": 3068.28, "end": 3075.72, "text": "und da bin ich mal morgen gespannt, Banger, sehr gut, geadded, Caelor hat zumindest guten"}, {"id": 352, "start": 3075.72, "end": 3081.08, "text": "Emote-Geschmack, das steht glaube ich außer Frage gerade, schon viele gute Emotes vorgeschlagen,"}, {"id": 353, "start": 3081.08, "end": 3085.72, "text": "was ist denn jetzt schon für ein Problem, warum, Raspberry Pi, warum kommst du nicht"}, {"id": 354, "start": 3085.72, "end": 3101.36, "text": "drauf, was ist denn das, was hat der, was hat der für Probleme, was hat der für Schmerzen,"}, {"id": 355, "start": 3101.36, "end": 3111.16, "text": "ich mein normalerweise, wenn ein Raspberry, der ist einfach komplett aus wieder, sag mal,"}, {"id": 356, "start": 3111.16, "end": 3116.64, "text": "ok Leute, ich nehm mal ein anderes Netzteil, eigentlich reicht das Ding für den Raspberry"}, {"id": 357, "start": 3116.64, "end": 3123.52, "text": "Pi, ich nehm mal das offizielle Raspberry Pi Netzteil, wenn ich das da irgendwie rauskrieg"}, {"id": 358, "start": 3123.52, "end": 3131.4, "text": "so und wenn ich hier noch, jetzt hab ich halt keinen Platz mehr hier dafür, ich hab da"}, {"id": 359, "start": 3131.4, "end": 3138.6, "text": "keinen Platz für, ich muss das hier nehmen, geht nicht anders, aber ganz davon abgesehen,"}, {"id": 360, "start": 3138.6, "end": 3144.56, "text": "einfach zum starten reicht das, ich mein das ist kein 3 Ampere Netzteil, das ist nur"}, {"id": 361, "start": 3144.56, "end": 3150.6, "text": "ein 2 Ampere Netzteil, aber das reicht normalerweise, dicke, auch für den 4er, ich mein das geht"}, {"id": 362, "start": 3150.6, "end": 3163.6, "text": "ja nur ums booten und sonst nix, ok jetzt leuchtet er wieder, schauen wir mal, ja ich hab keinen"}, {"id": 363, "start": 3163.6, "end": 3168.6, "text": "Platz hier, ich brauch die da, die Steckdose hier, die einzig freie Steckdose brauche ich"}, {"id": 364, "start": 3168.6, "end": 3177.52, "text": "für die Steckdosenleiste, außen ist hier oben das Licht dran, deswegen ich könnt durchaus"}, {"id": 365, "start": 3177.52, "end": 3186.28, "text": "mal ne Steckdosenleiste gebrauchen mit, der schaut wieder aus, fuck, ich glaub es reicht"}, {"id": 366, "start": 3186.28, "end": 3201.52, "text": "doch nicht, was machen wir denn da jetzt, wenn es nicht bootet gescheit, ja dann muss"}, {"id": 367, "start": 3201.52, "end": 3208.24, "text": "ich das doch rausziehen, man soll ich mal mit den USB Stecker hier unten vielleicht"}, {"id": 368, "start": 3208.24, "end": 3237.04, "text": "probieren, geht das ja besser, schauen wir mal ob es jetzt geht, der Kram bootet einfach"}, {"id": 369, "start": 3237.04, "end": 3250.84, "text": "nicht, da ist doch irgendwas im Arsch, ne jetzt bootet er, ok, er blinkt wie verrückt,"}, {"id": 370, "start": 3250.84, "end": 3273.84, "text": "weiß nicht ob ihr das seht, hier müsste es, was ist denn das für ein, alter was ist denn"}, {"id": 371, "start": 3273.84, "end": 3280.64, "text": "mit dem los, vielleicht hat er sich jetzt die SD Karte verabschiedet bzw. vielleicht"}, {"id": 372, "start": 3280.64, "end": 3284.56, "text": "hat er jetzt Probleme gehabt weil er ein paar mal abgekackt ist beim booten, das verkraften"}, {"id": 373, "start": 3284.56, "end": 3297.28, "text": "die nicht so gut, ok Leute ich warte jetzt mal, noch mal, ich warte jetzt noch mal kurz"}, {"id": 374, "start": 3297.28, "end": 3318.92, "text": "und wenn es nicht geht, flash ich den nochmal neu, weiß nicht was das für ein Crap ist,"}, {"id": 375, "start": 3318.92, "end": 3336.16, "text": "mal gucken was er jetzt macht, du bist wieder hellgrün ja, das switcht, ich mach das, ich"}, {"id": 376, "start": 3336.16, "end": 3347.52, "text": "setze das im flashen, ich setze das in diesem Flash Menü, kennst du eine gute Smart Steckdose"}, {"id": 377, "start": 3347.52, "end": 3354.4, "text": "mit der ich mal einen Stromverbraucher machen kann, naja die China Chinesen Dinger, die"}, {"id": 378, "start": 3354.4, "end": 3360.16, "text": "ich hab, die meisten können das, also die hier kann das zum Beispiel auch, die Gosund"}, {"id": 379, "start": 3360.16, "end": 3367.72, "text": "Steckdosenleiste, aber die Sache ist halt, du musst welche finden die noch flashbar sind,"}, {"id": 380, "start": 3367.72, "end": 3374.68, "text": "ansonsten, ansonsten, nee, nee vergiss das, ich wollte dir ein Z-Wave Gerät vorschlagen,"}, {"id": 381, "start": 3374.68, "end": 3380.28, "text": "das bringt dir aber nix, weil du hast ja kein Z-Wave, ok, das Ding ist im Arsch, der bootet"}, {"id": 382, "start": 3380.28, "end": 3388.52, "text": "nicht, ich ziehe jetzt noch einmal den Stecker raus und mach den Stecker nochmal rein und"}, {"id": 383, "start": 3388.52, "end": 3392.08, "text": "dann schauen wir ob es jetzt funktioniert, weil nicht flash ich nochmal neu, weil wir"}, {"id": 384, "start": 3392.08, "end": 3409.08, "text": "haben nichts großartig gemacht, nee, der macht einfach gar nichts mehr, der hat einfach"}, {"id": 385, "start": 3409.08, "end": 3427.64, "text": "keinen Bock zu booten, der ist RIP komplett, F, ok jetzt blinkt er mal kurz, jetzt blinkt"}, {"id": 386, "start": 3427.64, "end": 3449.28, "text": "er, ok, der sieht aus als würde er booten gerade, WTF, was ist denn mit dem Teil los,"}, {"id": 387, "start": 3449.28, "end": 3453.52, "text": "vielleicht ist die SD-Karte auch im Arsch, ich weiß es nicht, keine Ahnung, ich fasse"}, {"id": 388, "start": 3453.52, "end": 3459.48, "text": "es jetzt nicht an, ich lasse es einfach so drauf, es funktioniert weiter, so, also SSH"}, {"id": 389, "start": 3459.48, "end": 3466.48, "text": "drauf verbinden, 123456 Massive Passwort, meine Stream Vorschau ist gerade abgekackt,"}, {"id": 390, "start": 3466.48, "end": 3473.68, "text": "nee, scheint noch alles zu funktionieren, es lebt, genau, ja also ich hab das allerwichtigste"}, {"id": 391, "start": 3473.68, "end": 3480.28, "text": "vergessen zu installieren, Ascii-Quarium, falls das gibt, gibt's gar nicht, gibt, gibt"}, {"id": 392, "start": 3480.28, "end": 3491.56, "text": "kein Ascii-Quarium, aber wenigstens C-Matrix hoffe ich mal, C-Matrix, C-Matrix installiert,"}, {"id": 393, "start": 3491.56, "end": 3497.6, "text": "gut, gut, ah yes, jetzt haben wir schon mal, gut, das ist gerettet, wenigstens ein ordentliches"}, {"id": 394, "start": 3497.6, "end": 3503.48, "text": "Programm drauf und auch ganz wichtig Hollywood, falls das gibt, Hollywood, Hollywood-Pommer"}, {"id": 395, "start": 3503.48, "end": 3508.24, "text": "auch, Hollywood ist auch Pog, wenn ihr mal wieder, also wenn mal euer Chef ins Büro"}, {"id": 396, "start": 3508.24, "end": 3514.28, "text": "kommt und ihr wollt wieder richtig oberkrasse Hacker-Man aussehen, dann müsst ihr Hollywood"}, {"id": 397, "start": 3514.28, "end": 3518.88, "text": "starten, passt mal auf, ich zeig euch das gleich mal, auf dem Raspberry Pi zu erzählen"}, {"id": 398, "start": 3518.88, "end": 3525.04, "text": "ist reichlich sinnlos, das würde ich eher lokal installieren, aber ok, aber wenn wir"}, {"id": 399, "start": 3525.04, "end": 3531.08, "text": "schon dabei sind, unsinnige Sachen zu interessieren, braucht es dann für Pakete vieles, weil es"}, {"id": 400, "start": 3531.08, "end": 3538.16, "text": "vieles unter der Haube aufruft, guck mal wie lahm die SSD ist, nicht die SD, die Micro-SD,"}, {"id": 401, "start": 3538.16, "end": 3550.72, "text": "Pearl alles drauf, Python, Pearl, Ruby, Beemon, das für die Bandbreite, so passt mal auf Hollywood,"}, {"id": 402, "start": 3550.72, "end": 3560.2, "text": "richtiger Hacker-Man Kram, yes, so, also wenn ihr mal wirklich wie im Film aussehen wollt,"}, {"id": 403, "start": 3560.2, "end": 3575.2, "text": "dann einfach Hollywood starten, heißt nicht umsonst so, no more secrets, das habe ich"}, {"id": 404, "start": 3575.2, "end": 3595.88, "text": "glaube ich auch auf dem Host drauf, das habe ich auch drauf, no more secrets, ne habe ich"}, {"id": 405, "start": 3595.88, "end": 3616.12, "text": "nicht installiert, so, so muss das sein, so jetzt haben wir genug uns wie die krassen"}, {"id": 406, "start": 3616.12, "end": 3626.0, "text": "Hacker-Mans gefühlt, jetzt brechen wir mal ab, alles klar, so jetzt machen wir was sinnvolles,"}, {"id": 407, "start": 3626.0, "end": 3629.84, "text": "das was wir nämlich eigentlich machen wollten, nehme ich den ganzen Krempel flaschen, also"}, {"id": 408, "start": 3629.84, "end": 3635.16, "text": "brauchen wir dieses Tulia, ne nicht vom Hüpfer, das da, Tulia Convert, wenn ich das richtig"}, {"id": 409, "start": 3635.16, "end": 3643.12, "text": "in Erinnerung habe, muss man das erstmal klonen, shit, clone, ah ich weiß was ich vergessen"}, {"id": 410, "start": 3643.12, "end": 3651.08, "text": "habe, Bash Completions habe ich vergessen, falls es nicht schon drauf ist, ist schon drauf,"}, {"id": 411, "start": 3651.08, "end": 3656.52, "text": "cool, git clone, Tulia Convert, so und dann müssen wir uns die Anleitung angucken wie"}, {"id": 412, "start": 3656.52, "end": 3665.96, "text": "das funktioniert, install prerequisites, second device, oh da brauche ich gleich, muss ich"}, {"id": 413, "start": 3665.96, "end": 3680.28, "text": "gleich rüber nochmal ein iPad holen, sonst funktioniert es nämlich nicht, so Tulia Convert,"}, {"id": 414, "start": 3680.28, "end": 3692.36, "text": "install prerequisites.sh, so während das installiert, Leute ich hole mal kurz mein iPad, er muss,"}, {"id": 415, "start": 3692.36, "end": 3721.84, "text": "als man die Geräte flaschen kann, muss man ein zweites Gerät im Netzwerk hängen, also"}, {"id": 416, "start": 3721.84, "end": 3735.12, "text": "ich bin back, so, was wir machen, hier steht doch im Titel, ich flasche meine restlichen"}, {"id": 417, "start": 3735.12, "end": 3745.2, "text": "China Chinesen Steckdosen Reserven die ich habe, danach gibt es nichts mehr, doch, doch"}, {"id": 418, "start": 3745.2, "end": 3752.4, "text": "klar, Bash Completions unter root an, so, da haben wir es, warum ist da ein Dockerfile"}, {"id": 419, "start": 3752.4, "end": 3758.12, "text": "drin, das brauchen wir nicht, wir installieren jetzt alles auf dem Raspberry Pi, also start"}, {"id": 420, "start": 3758.12, "end": 3765.8, "text": "flash, erstmal kurz überlegen, mache ich das jetzt gerade richtig, start flash, also"}, {"id": 421, "start": 3765.8, "end": 3771.0, "text": "da steht ja auch da, achso, Moment, bevor ich flasche sollte ich vielleicht mal das"}, {"id": 422, "start": 3771.0, "end": 3781.04, "text": "Ding auspacken und anschließen, also das Teil flaschen wir jetzt von Hammer, aber es ist"}, {"id": 423, "start": 3781.04, "end": 3798.0, "text": "nicht wirklich von Hammer, es ist ein ganz normaler China Chinesen Resale Ding, erstmal"}, {"id": 424, "start": 3798.0, "end": 3823.96, "text": "aufgerissen, elegantes auspacken, so, da ist es, exellent, warum gibt es danach nichts"}, {"id": 425, "start": 3823.96, "end": 3829.92, "text": "mehr, weil die meisten nicht mehr flashbar sind, die man heute kaufen kann, oder komplett"}, {"id": 426, "start": 3829.92, "end": 3834.68, "text": "einen anderen Chip drin haben, der gar nicht mehr Tasmota flashbar ist, ich meine Tasmota"}, {"id": 427, "start": 3834.68, "end": 3840.48, "text": "ist eine ESP-6860 ESP-32 Firmware, das heißt das läuft auf einem anderen Chip auch nicht,"}, {"id": 428, "start": 3840.48, "end": 3845.12, "text": "so, also das Ding werden wir jetzt flashen, ich bin mir nicht mehr ganz sicher wie es"}, {"id": 429, "start": 3845.12, "end": 3849.56, "text": "geht, wie man das Ding in den Flash Modus versetzt, aber ich glaube einfach anschließen reicht,"}, {"id": 430, "start": 3849.56, "end": 3858.16, "text": "also, was ich bei diesen Steckdosenleisten ganz cool finde ist folgendes, man hat vier"}, {"id": 431, "start": 3858.16, "end": 3862.08, "text": "normale Steckdosen, die man alle getrennt schalten kann, das ist schon mal nice, nicht"}, {"id": 432, "start": 3862.08, "end": 3866.08, "text": "wie diese billige Steckdosen, die es teilweise gibt, wo du alles nur auf einmal schalten kannst,"}, {"id": 433, "start": 3866.08, "end": 3871.92, "text": "der Schalter hier vorne kann mit Tasmota beliebig umprogrammiert werden, Tasmota kann ja bis"}, {"id": 434, "start": 3871.92, "end": 3877.8, "text": "zu, frag mich nicht, 25 verschiedene Funktionen für so Schalter, du kannst den Schalter programmieren"}, {"id": 435, "start": 3877.8, "end": 3881.84, "text": "auf Schalten einer der Liste, du kannst sagen Doppelklick schaltet, also einfacher Klick"}, {"id": 436, "start": 3881.84, "end": 3885.68, "text": "schaltet ein, Doppelklick schaltet zwei, Dreifachklick schaltet drei, Vierfachklick"}, {"id": 437, "start": 3885.68, "end": 3890.44, "text": "schaltet vier, habe ich noch nie gemacht, geht aber glaube ich, und dann kannst du USB"}, {"id": 438, "start": 3890.44, "end": 3894.64, "text": "schalten, allerdings USB kannst du nicht einfach schalten, USB kannst du nur alle vier auf"}, {"id": 439, "start": 3894.64, "end": 3900.84, "text": "einmal anmachen oder aus, was aber in der Regel reicht, also jeder von den 230 Volt Steckdosen"}, {"id": 440, "start": 3900.84, "end": 3904.12, "text": "kannst du einzeln schalten, aber USB kannst du alle vier nur auf einmal schalten, das"}, {"id": 441, "start": 3904.12, "end": 3908.12, "text": "wäre natürlich besonders hyper geil, wenn das irgendwie gehen würde, mit die hier auch"}, {"id": 442, "start": 3908.12, "end": 3913.52, "text": "noch einzeln anstrengen, aber ja, wir wollen es jetzt mal nicht übertreiben, so, ob das"}, {"id": 443, "start": 3913.52, "end": 3920.72, "text": "jetzt geht mit dem Knopf, ist mir eigentlich egal, also ich weiß es geht mit dem Knopf,"}, {"id": 444, "start": 3920.72, "end": 3925.44, "text": "man kann das einstellen, ist mir aber eigentlich egal, weil ich schalte das Ding eh nur über"}, {"id": 445, "start": 3925.44, "end": 3931.96, "text": "meine Home Automation, wo ich ein bisschen unschlüssig bin, ist was das da ist, das"}, {"id": 446, "start": 3931.96, "end": 3936.68, "text": "hat, guck mal, das hat da einen Knopf, den kann man drücken, und ich habe keine Ahnung,"}, {"id": 447, "start": 3936.68, "end": 3941.08, "text": "vielleicht ist das Wasser ablaufen oder so, keine Ahnung was das ist, eine Sicherung ist"}, {"id": 448, "start": 3941.08, "end": 3950.0, "text": "es auf jeden Fall eher nicht, so, dann wollen wir mal probieren das zu flashen, also von"}, {"id": 449, "start": 3950.0, "end": 3956.28, "text": "der Idee her sollte das jetzt folgendermaßen funktionieren, wir starten das Flaschen jetzt"}, {"id": 450, "start": 3956.28, "end": 3962.92, "text": "hier auf dem Raspberry Pi, schalten das Ding in den Flash Modus, dann sollte das hier"}, {"id": 451, "start": 3962.92, "end": 3967.88, "text": "blinken, unterschiedlich, und dann sollten wir auf dem Raspberry Pi sehen, ob er flasht"}, {"id": 452, "start": 3967.88, "end": 3983.12, "text": "oder nicht, das Ding ist, naja, was heißt, übelst groß, ja, übermäßig groß ist das"}, {"id": 453, "start": 3983.12, "end": 3987.96, "text": "nicht, man hier oben brauchst du alles, da unten brauchst du alles, hier könntest du"}, {"id": 454, "start": 3987.96, "end": 3991.92, "text": "fly eine extra Steckdose hin machen, aber ansonsten, ich meine, guck, du hast doch die"}, {"id": 455, "start": 3991.92, "end": 4003.92, "text": "größten Vergleich zum Raspberry Pi, so riesengroß ist das Ding, nett, was ist denn das, 30"}, {"id": 456, "start": 4003.92, "end": 4012.44, "text": "Zentimeter oder so, also irgendwie so, das ist nicht größer als normale Steckdosenleisten"}, {"id": 457, "start": 4012.44, "end": 4024.4, "text": "auch, so, mal so machen, dass man das parallel zugucken kann, also, do you wish to terminate"}, {"id": 458, "start": 4024.4, "end": 4034.44, "text": "den S-Mask, yes, yes, mach, starting access point, so, jetzt muss ich mich mit meinem"}, {"id": 459, "start": 4034.44, "end": 4039.28, "text": "Tablet, jetzt muss ich mich mit meinem Tablet connecten, das mach ich jetzt, da lass ich"}, {"id": 460, "start": 4039.28, "end": 4051.04, "text": "euch nicht zugucken, connect any other device, mach ich jetzt, we trust flash, so, ich bin"}, {"id": 461, "start": 4051.04, "end": 4062.36, "text": "mit meinem Tablet connected, und jetzt, put your IOT device, ja, machen wir, also, einfach"}, {"id": 462, "start": 4062.36, "end": 4076.4, "text": "anschließen und hoffen, dass es flasht, noch machts nix, achso, press enter, ich presse"}, {"id": 463, "start": 4076.4, "end": 4087.84, "text": "mal enter, ich muss es wahrscheinlich lang gedrückt halten, ich halte mal lang gedrückt,"}, {"id": 464, "start": 4087.84, "end": 4096.64, "text": "jetzt blinkt es schnell, seht ihr das, jetzt blinkt es schnell, ich weiß nicht, ob man"}, {"id": 465, "start": 4096.64, "end": 4125.44, "text": "das erkennt, jetzt blinkt es schnell, und jetzt sollte es eigentlich, ne, ne, das hat"}, {"id": 466, "start": 4125.44, "end": 4150.68, "text": "nicht funktioniert, ok Leute, nochmal von vorne, raus machen, äh, der ist nicht im"}, {"id": 467, "start": 4150.68, "end": 4174.04, "text": "flash Modus, ok, nochmal länger gedrückt halten, jetzt blinkt es schnell, ah, ne, was,"}, {"id": 468, "start": 4174.04, "end": 4200.8, "text": "yes, yes, hat sich mein Tablet wieder ausgelockt, ah, jetzt hat es sich resettet, ok, jetzt"}, {"id": 469, "start": 4200.8, "end": 4226.32, "text": "hat es sich resettet, Mist, das hat nicht funktioniert, ich will abbrechen, please abbrechen, yes, yes,"}, {"id": 470, "start": 4226.32, "end": 4250.28, "text": "was jetzt, das funktioniert nicht,"}, {"id": 471, "start": 4250.28, "end": 4265.72, "text": "das funktioniert nicht, ok, ich erinnere mich, ich hatte es letztes mal auch Probleme mit"}, {"id": 472, "start": 4265.72, "end": 4295.08, "text": "den Dinger, die zu flashen, ich hatte es letztes mal auch Probleme, das zu flashen, das muss"}, {"id": 473, "start": 4295.08, "end": 4315.64, "text": "ich auch ein paarmal machen, ich bin mir nicht mehr ganz sicher, was das Problem war, ja,"}, {"id": 474, "start": 4315.64, "end": 4345.44, "text": "weil da auf Amazon was steht, heißt es nicht, dass jede Steckdosenleiste funktioniert, funktioniert"}, {"id": 475, "start": 4345.44, "end": 4357.16, "text": "nicht, normalerweise sollte der, ich reboote das Ding jetzt nochmal, ich reboote den Raspberry"}, {"id": 476, "start": 4357.16, "end": 4361.12, "text": "Pi nochmal, ich hoffe, dass der jetzt rebooted und mache die Leiste nochmal raus und wir"}, {"id": 477, "start": 4361.12, "end": 4370.52, "text": "schauen mal kurz, wie man das Ding, wir gucken mal, wir gucken mal kurz bei, ähm, dieser,"}, {"id": 478, "start": 4370.52, "end": 4385.52, "text": "das Motor Template Seite, Motor Template, Supported Devices, Kogeek, das da ist das im Original,"}, {"id": 479, "start": 4385.52, "end": 4406.36, "text": "glaube, na dazu steht nichts da, haben die vielleicht sinnvolle Sachen auf Amazon stehen,"}, {"id": 480, "start": 4406.36, "end": 4421.08, "text": "das Motor, was ist das für eine Antwort, jemand probiert, ob sich aktuell noch das"}, {"id": 481, "start": 4421.08, "end": 4428.28, "text": "Motor flashen lässt, die ist richtig gut, hält lange warm, alles klar, so pepega diese"}, {"id": 482, "start": 4428.28, "end": 4451.64, "text": "Amazon Rezession teilweise, also nicht Rezession, User, User, wie nennt sich das, FAQ Sachen,"}, {"id": 483, "start": 4451.64, "end": 4471.52, "text": "das Motor, ok, der hat aufgeschraubt,"}, {"id": 484, "start": 4471.52, "end": 4492.92, "text": "ok, der hat aufgeschraubt, das ist schonmal eher doof,"}, {"id": 485, "start": 4492.92, "end": 4516.8, "text": "das ist eher doof, sag mal, ein Raspberry Pi startet schon wieder nicht, was ist denn"}, {"id": 486, "start": 4516.8, "end": 4526.88, "text": "das, Alter, dieses Crap Teil, ich fass es nicht, warum buggt das so rum, was soll das"}, {"id": 487, "start": 4526.88, "end": 4544.36, "text": "hier, ich glaube, die SD hat irgendeinen Schaden, das ist auf jeden Fall nicht normal, der war"}, {"id": 488, "start": 4544.36, "end": 4547.6, "text": "schon im Flash Modus, hast ja auch gesehen, dann hat es hier umgeschaltet, aber nicht"}, {"id": 489, "start": 4547.6, "end": 4555.68, "text": "mal gebootet, also nicht mehr richtig gebootet danach, ey, der Raspberry Pi ist mega im Arsch,"}, {"id": 490, "start": 4555.68, "end": 4559.76, "text": "also nicht nur, dass aus irgendwelchen unsinnigen Gründen brutales heiß wird, obwohl nichts"}, {"id": 491, "start": 4559.76, "end": 4571.2, "text": "ist, aber jetzt bootet er, ok, die Logik verstehe ich echt nicht, jetzt bootet er anscheinend,"}, {"id": 492, "start": 4571.2, "end": 4582.96, "text": "soll mir recht sein, was war man da jetzt, also ich fürchte, die werden wir nicht geflasht"}, {"id": 493, "start": 4582.96, "end": 4588.76, "text": "kriegen, OTA, die letzte konnte man lustigerweise OTA noch flaschen, Raspberry Pi ist wieder"}, {"id": 494, "start": 4588.76, "end": 4601.16, "text": "da, also anscheinend ist nicht alles flashbar per OTA, selbst letztes Jahr nicht, ok, das"}, {"id": 495, "start": 4601.16, "end": 4617.96, "text": "start Flash, yes, yes, alles klar, so Tablet verbinden, ja connect any device, put your"}, {"id": 496, "start": 4617.96, "end": 4628.24, "text": "IOT device in auto config, LED will blink fast, jaja, das habe ich schon gemacht, das"}, {"id": 497, "start": 4628.24, "end": 4641.6, "text": "bringt nichts beim Restart, beim Restart geht es da nicht weiter, das ist an, ich weiß nicht"}, {"id": 498, "start": 4641.6, "end": 4649.08, "text": "ob ihr das seht, ich weiß nicht ob man das sieht, das ist grün, das ist grün, ne das"}, {"id": 499, "start": 4649.08, "end": 4654.88, "text": "grüne Licht erkennt man nicht genau, zumindest wenn ich das jetzt eine Weile gedrückt halte,"}, {"id": 500, "start": 4654.88, "end": 4663.76, "text": "dann blinkt das schnell, man sieht das, man sieht das echt nicht, das ist ziemlich, ziemlicher"}, {"id": 501, "start": 4663.76, "end": 4681.08, "text": "Müll, hier guckt mal, ne man sieht nicht das es blinkt, aber Leute glaubt mir es blinkt,"}, {"id": 502, "start": 4681.08, "end": 4685.24, "text": "das grün erkennt man nicht richtig, es blinkt schnell, also der ist auf jeden Fall im Flash"}, {"id": 503, "start": 4685.24, "end": 4695.48, "text": "Modus und das merke ich auch, weil jetzt restartet der und dann sagt er auch auto config is complete,"}, {"id": 504, "start": 4695.48, "end": 4702.08, "text": "was allerdings dazu führt, dass er sich nur rebootet und es da nicht weiter geht, das"}, {"id": 505, "start": 4702.08, "end": 4717.0, "text": "ist ziemlich blöd, man kann das Ding wahrscheinlich nicht flashen per OTA, ich habe die alle zeitgleich"}, {"id": 506, "start": 4717.0, "end": 4721.08, "text": "gekauft, eine ließ sich flashen und die andere die ich im Schrank habe habe ich bis jetzt"}, {"id": 507, "start": 4721.08, "end": 4730.6, "text": "nicht ausprobiert, aber anscheinend lässt er sich nicht flashen, ich höre es auch es"}, {"id": 508, "start": 4730.6, "end": 4737.56, "text": "rebootet und die Relays gehen an und aus und dann geht er in normalen Modus, also das sollte"}, {"id": 509, "start": 4737.56, "end": 4743.48, "text": "so nicht funktionieren, was genau bringt es eine Steckdosenleiste zu flashen, zum Beispiel"}, {"id": 510, "start": 4743.48, "end": 4747.96, "text": "dass du keine Smartphone App vom China Hersteller mehr brauchst oder die Chinesen sich auf deine"}, {"id": 511, "start": 4747.96, "end": 4752.6, "text": "Steckdosenleiste einloggen können und es hat auch weitere praktische Vorteile, du kannst"}, {"id": 512, "start": 4752.6, "end": 4757.76, "text": "es über ein Webinterface steuern anstatt mit der App, du kannst es per MQTT in dein Smart"}, {"id": 513, "start": 4757.76, "end": 4763.44, "text": "Home integrieren und allgemein lässt sich das viel besser steuern und ansprechen, Moment"}, {"id": 514, "start": 4763.44, "end": 4771.36, "text": "es hat was gemacht, hat es funktioniert, es geht einfach, man muss es einfach 10 mal probieren"}, {"id": 515, "start": 4771.36, "end": 4799.6, "text": "und dann gehts, easy, easy, flash Tazmota, yes, manchmal hilft es alles zu rebooten,"}, {"id": 516, "start": 4799.6, "end": 4806.64, "text": "alles zu rebooten und dann nochmal zu probieren und dann, do you want to flash another device,"}, {"id": 517, "start": 4806.64, "end": 4813.24, "text": "gerade nicht, no, gut, jetzt muss ich das Tazmota verbinden, das zeige ich euch nicht,"}, {"id": 518, "start": 4813.24, "end": 4822.4, "text": "weil dann würde ich mein WLAN Passwort leaken und das habe ich nicht vor, ich möchte mein"}, {"id": 519, "start": 4822.4, "end": 4836.16, "text": "WLAN Passwort nicht leaken, ich hoffe ihr versteht mich ja, Chat, please no disabo, jetzt muss"}, {"id": 520, "start": 4836.16, "end": 4842.28, "text": "ich mein Passwort eingeben, das ist ewig lang, das enthält Kekkel, das kann ich euch verraten,"}, {"id": 521, "start": 4842.28, "end": 4862.48, "text": "ja aber nicht, Kekkel und Koggers, aber anders geschrieben,"}, {"id": 522, "start": 4862.48, "end": 4880.32, "text": "so ich hoffe ich habe mich nicht vertippt, safe, jetzt gucke ich in meinen Router, ob"}, {"id": 523, "start": 4880.32, "end": 4908.72, "text": "ich die Tazmota Sachen sehe, IP DHCP Server, leases, aha, ich habe da 2 Sachen die in Frage"}, {"id": 524, "start": 4908.72, "end": 4934.8, "text": "kommen aber ich weiß nicht welche es ist, das da vielleicht, das da vielleicht, postchamp,"}, {"id": 525, "start": 4934.8, "end": 4951.36, "text": "also von der Adresse könnte es das durchaus sein, aber es antwortet nicht, ah easy, das"}, {"id": 526, "start": 4951.36, "end": 4978.68, "text": "ist das richtige, so gerade mein DHCP richtig benennen, passt, so also, gut so, Tazmota ist"}, {"id": 527, "start": 4978.68, "end": 4983.68, "text": "halt uralt, das müssen wir jetzt erstmal upgraden, aber das wichtigste, ich bin mir nicht sicher"}, {"id": 528, "start": 4983.68, "end": 4989.04, "text": "ob ich auf die Konsole gehen kann, doch ich kann auf die Konsole gehen, ist nicht Schlimmes,"}, {"id": 529, "start": 4989.04, "end": 4995.24, "text": "weil, wobei keine Ahnung, bin mir nicht sicher, nee ich habe extra WLAN gemacht, nur für"}, {"id": 530, "start": 4995.24, "end": 4999.04, "text": "den Stream, dann passiert nichts, schlimmste was ich leaken kann ist MAC Adresse vom Device"}, {"id": 531, "start": 4999.04, "end": 5012.28, "text": "und sowas und das ist egal, muss NTP Server setzen, NTP Server 1 1 2 2 1 6 8 60.1, weil"}, {"id": 532, "start": 5012.28, "end": 5017.04, "text": "ansonsten wenn, Leute falls jemand Probleme von euch hat, so mal als Tipp, wenn euer Tazmota"}, {"id": 533, "start": 5017.04, "end": 5024.88, "text": "richtig langsam reagiert, so wie meins jetzt, dann müsst ihr NTP Server setzen, guckt euch"}, {"id": 534, "start": 5024.88, "end": 5030.96, "text": "das mal an, wenn ihr nämlich kein NTP Server setzt, ich zeige ich dir gleich Major Laser,"}, {"id": 535, "start": 5030.96, "end": 5035.04, "text": "ich kann alles einzeln steuern, legen wir schon mal so hin, dass man es gleich sieht,"}, {"id": 536, "start": 5035.04, "end": 5042.6, "text": "irgendwie so, kann man mal kurz schauen, dass man es vielleicht ein bisschen, dass man das"}, {"id": 537, "start": 5042.6, "end": 5053.84, "text": "ordentlich sieht, aber erstmal muss mein Tazmota aufgehen, was es gerade nicht macht, solange"}, {"id": 538, "start": 5053.84, "end": 5063.0, "text": "kein NTP gesetzt ist, ist es richtig langsam, man muss NTP Server setzen, also wenn ihr auch"}, {"id": 539, "start": 5063.0, "end": 5071.0, "text": "das Problem habt, dass euer Tazmota mega langsam ist, dann NTP Server setzen, easy, das kann"}, {"id": 540, "start": 5071.0, "end": 5076.72, "text": "jetzt mal 1-2 Minuten dauern bis es aufgeht, alternativ Stecker raus, Stecker rein, wieso"}, {"id": 541, "start": 5076.72, "end": 5099.16, "text": "braucht der NTP, das ist eine gute Frage, keine Ahnung, Console, guck hier falsche Zeit, falsche"}, {"id": 542, "start": 5099.16, "end": 5110.68, "text": "Zeit, ich hoffe ich habe jetzt kein WLAN Passwort geleakt, sieht nicht so aus, also NTP Server,"}, {"id": 543, "start": 5110.68, "end": 5118.72, "text": "ein bisschen größer, dass ihr was seht, NTP Server setzen, NTP Server 1, NTP Server 2,"}, {"id": 544, "start": 5118.72, "end": 5133.28, "text": "NTP Server 3, ihr seht schon es lag drum, so und wenn jetzt der NTP Server gesetzt ist,"}, {"id": 545, "start": 5133.28, "end": 5149.36, "text": "Tazmota System Time, ich weiß nicht mal wieder, Tazmota Time, Tazmota Time, wie konnte man"}, {"id": 546, "start": 5149.36, "end": 5165.72, "text": "sich das nochmal anzeigen lassen, Show System Time, hast du Public NTPs geblockt, ja genau,"}, {"id": 547, "start": 5165.72, "end": 5175.12, "text": "genau das will ich haben, zeigt mir die Zeit an, alles klar NTP Server und jetzt haben"}, {"id": 548, "start": 5175.12, "end": 5187.28, "text": "wir 19.22.2022, 25.07., ja, vielleicht müsst ihr auch noch save machen, aber ne, warte"}, {"id": 549, "start": 5187.28, "end": 5192.24, "text": "mal, Tazmota save, aber normalerweise müsst ihr das nicht machen, weil ihr jede Sekunde"}, {"id": 550, "start": 5192.24, "end": 5200.04, "text": "automatisch, automatisch speichert die Fall mäßig, weiß gar nicht was der richtige Befehl"}, {"id": 551, "start": 5200.04, "end": 5209.88, "text": "zum speichern ist ehrlich gesagt gerade, na egal, müsst ihr nicht machen, so, jetzt Restart"}, {"id": 552, "start": 5209.88, "end": 5221.96, "text": "und dann soll es zumindest schneller sein, auch nach dem Reboot jetzt, guck das ist sind"}, {"id": 553, "start": 5221.96, "end": 5230.24, "text": "wieder da, Console, jetzt gehts, jetzt gehts sofort wieder, guck, jetzt gehts, jetzt gehts"}, {"id": 554, "start": 5230.24, "end": 5237.52, "text": "direkt, ja, direkt, ohne was, so, jetzt hat er nämlich auch gleich den ganzen Krempel,"}, {"id": 555, "start": 5237.52, "end": 5256.72, "text": "ja wunderbar, so und jetzt gehen wir in Configuration, gute Frage, das da, glaub ich, noch mal schauen,"}, {"id": 556, "start": 5256.72, "end": 5262.6, "text": "jetzt muss uns die richtige Gerätekonfig heraussuchen, ich probiers mal mit der hier, weil das die"}, {"id": 557, "start": 5262.6, "end": 5270.56, "text": "baugleiche Steckdosenleiste ist, testen wir mal ob das funktioniert, wir sollten dem Ding"}, {"id": 558, "start": 5270.56, "end": 5277.36, "text": "noch einen gescheiten Namen geben, nämlich, die heißt jetzt einfach Hammer, Hammer, äh,"}, {"id": 559, "start": 5277.36, "end": 5285.76, "text": "keine Ahnung, was sagen die dann offiziell wie das Ding heißt, was, was, was sagen die,"}, {"id": 560, "start": 5285.76, "end": 5296.88, "text": "die Hammer Leute denn, Hammer Power Strip, na geil, da weiß man Bescheid, Freifall, ich"}, {"id": 561, "start": 5296.88, "end": 5308.44, "text": "mach einfach Hammer, Vierer, Device Name, ja das ist ziemlich egal, aber ich nenns trotzdem"}, {"id": 562, "start": 5308.44, "end": 5316.24, "text": "mal, ähm, kommt wahrscheinlich in Keller, sodass ich noch weiß wie es heißt, so Restarten"}, {"id": 563, "start": 5316.24, "end": 5324.48, "text": "und jetzt sollten wir vier Stecker sehen, ich bin mir nicht sicher ob mal, ob ihr das"}, {"id": 564, "start": 5324.48, "end": 5340.16, "text": "hört, aber ihr sollte das, ihr sollte das zumindest sehen, seht ihr das, ok, die Anzeige"}, {"id": 565, "start": 5340.16, "end": 5347.4, "text": "ist richtig pepega, ihr seht das wahrscheinlich nicht, ich mach mal kurz das Licht aus, ich"}, {"id": 566, "start": 5347.4, "end": 5361.6, "text": "mach kurz, ich mach kurz mein Ringlight aus, weil sonst erkennt ihr einfach gar nix, naja,"}, {"id": 567, "start": 5361.6, "end": 5368.76, "text": "gut erkennen ist was anderes, aber ihr müsstet es hier oben rechts sehen, guckt mal, seht"}, {"id": 568, "start": 5368.76, "end": 5386.48, "text": "ihr das, ja so ein bisschen, so ein bisschen sieht man das, gell, guckt, jetzt ist an,"}, {"id": 569, "start": 5386.48, "end": 5392.76, "text": "ja besser, besser gehts grad nicht, so nächster an, da musst du aber ganz genau hingucken"}, {"id": 570, "start": 5392.76, "end": 5401.88, "text": "dass du das erkennst, so und jetzt alles an inklusive USB, guckt hier oben, also ich seh"}, {"id": 571, "start": 5401.88, "end": 5409.76, "text": "es gut, aber in der Kamera erkennt man es überhaupt nicht gescheit, ja hier oben, hier oben sieht"}, {"id": 572, "start": 5409.76, "end": 5415.52, "text": "man jetzt ein bisschen, also man kann jetzt tatsächlich alles einzeln, alles einzeln"}, {"id": 573, "start": 5415.52, "end": 5426.24, "text": "schalten und der Knopf funktioniert auch, der Knopf schaltet aktuell nur die erste"}, {"id": 574, "start": 5426.24, "end": 5430.6, "text": "Steckdose, aber das juckt mich nicht, man könnte jetzt verschiedene Funktionen vergeben"}, {"id": 575, "start": 5430.6, "end": 5435.32, "text": "für den Knopf, da müssen wir mal nachgucken, also man kann hinter das Motor so Sachen machen"}, {"id": 576, "start": 5435.32, "end": 5444.6, "text": "wie Button, Button ummappen, das ist aber, das ist ein bisschen Fivehead, ja man sieht"}, {"id": 577, "start": 5444.6, "end": 5447.44, "text": "es nicht schlecht, aber zumindest das der Power Knopf angeht, sieht wahrscheinlich"}, {"id": 578, "start": 5447.44, "end": 5456.88, "text": "jeder, guckt jetzt der Power Knopf aus, wenn man sich ein bisschen einfacher machen will,"}, {"id": 579, "start": 5456.88, "end": 5469.28, "text": "jetzt machen wir erstmal ein Tasmota Update, Tasmota OTA Update, Tasmota Bin, ich bin mir"}, {"id": 580, "start": 5469.28, "end": 5481.28, "text": "nicht ganz sicher ob wir Bin oder Minimal brauchen, gucken wir mal, Firmware Upgrade,"}, {"id": 581, "start": 5481.28, "end": 5486.68, "text": "das geht nicht, Internet Zugang ist komplett geblockt, keine Chance, Download, wir machen"}, {"id": 582, "start": 5486.68, "end": 5493.36, "text": "mal ein normales Update, es kann sein, ist es schon standardmäßig so was du sagst, ich"}, {"id": 583, "start": 5493.36, "end": 5500.52, "text": "dachte das muss man alles von Hand vergeben, von Hand machen, so, jetzt geht erste an,"}, {"id": 584, "start": 5500.52, "end": 5509.64, "text": "Doppelklick, nö, ach doch tatsächlich, dann ist es standardmäßig schon so wie ich sage,"}, {"id": 585, "start": 5509.64, "end": 5515.04, "text": "guck mal, Tripleklick, geht die dritte gleich aus, eins, zwei, drei, dritte aus, zwei,"}, {"id": 586, "start": 5515.04, "end": 5520.2, "text": "drei, vier, vierte an, dann ist das sogar standardmäßig schon so wie ich gesagt hab,"}, {"id": 587, "start": 5520.2, "end": 5533.52, "text": "ja, auch wenn man es nicht richtig erkennt, aber was will ich machen, ja und schaut mal,"}, {"id": 588, "start": 5533.52, "end": 5539.76, "text": "man sieht das ja auch im Menü, guck mal, wenn ich hier drücke, erkennt er sofort eins"}, {"id": 589, "start": 5539.76, "end": 5546.96, "text": "ist an und aus, so aber jetzt machen wir erstmal Update, also wenn ihr Tasmota verwendet kann"}, {"id": 590, "start": 5546.96, "end": 5552.64, "text": "es sein, dass ihr Probleme beim Update bekommt, nämlich je nachdem, wie viel Speicher euer"}, {"id": 591, "start": 5552.64, "end": 5556.28, "text": "Gerät hat, probieren wir das mal aus, also standardmäßig würde ich immer probieren"}, {"id": 592, "start": 5556.28, "end": 5561.08, "text": "auf die volle Tasmota Version zu upgraden, wenn es nicht funktioniert, ich zeige euch"}, {"id": 593, "start": 5561.08, "end": 5565.4, "text": "mal was man macht, wenn es nicht funktioniert, wenn das nicht funktioniert und wenn er sagt,"}, {"id": 594, "start": 5565.4, "end": 5569.44, "text": "zu wenig Speicher, dann müsst ihr einen Zwischenschritt machen, dann müsst ihr erst auf die Minimal"}, {"id": 595, "start": 5569.44, "end": 5576.64, "text": "Version updaten und dann auf die größere, also machen wir das mal, Tasmota Minimal Upgrade,"}, {"id": 596, "start": 5576.64, "end": 5580.48, "text": "also wenn die Geräte zu wenig Speicher haben, dann hat er nicht genug Platz, die aktuelle"}, {"id": 597, "start": 5580.48, "end": 5587.08, "text": "Firmware plus die neue Firmware in Flash zu kriegen und da musst du erst noch eine kleinere"}, {"id": 598, "start": 5587.08, "end": 5592.2, "text": "Firmware Flashen, die im Prinzip nichts kann, außer Updates machen und dann kannst du drüber"}, {"id": 599, "start": 5592.2, "end": 5600.36, "text": "Flashen, kommt Minimal Firmware und jetzt sag mal nochmal Upgrade und jetzt kann man"}, {"id": 600, "start": 5600.36, "end": 5617.92, "text": "die standardmäßig, die fette Tasmota hochladen, fette Tasmota Firmware hochladen, so und jetzt"}, {"id": 601, "start": 5617.92, "end": 5622.6, "text": "wenn er Restart hat, sag mal auch schon 1202, was schonmal deutlich besser ist, weil das"}, {"id": 602, "start": 5622.6, "end": 5630.56, "text": "was aktuell ist es und jetzt sollte er irgendwann Restartet haben, in der Hoffnung, dass er"}, {"id": 603, "start": 5630.56, "end": 5642.68, "text": "die NTP Settings nicht vergessen hat, was durchaus sein kann, weil ich glaube ein Tasmota"}, {"id": 604, "start": 5642.68, "end": 5653.72, "text": "9 auf 12 Upgrade, bin ich mir gar nicht sicher, ob das supported ist, überhaupt in einem"}, {"id": 605, "start": 5653.72, "end": 5664.12, "text": "Rutsch, schauen wir mal, doch hat alles funktioniert, so wunderbar, so und jetzt kann man die Dinger"}, {"id": 606, "start": 5664.12, "end": 5668.48, "text": "noch ein bisschen ordentlich benennen, dass man später im Webinterfell in seiner Heimautomatisierung"}, {"id": 607, "start": 5668.48, "end": 5685.2, "text": "auch checkt, was was ist, ich glaube das ist unter Template, oh ne wie benennt man die Knöppe,"}, {"id": 608, "start": 5685.2, "end": 5709.8, "text": "ConfigModule, Template hier, Moment wie benennt man Tasmota nochmal die Knöppe, hätte eigentlich"}, {"id": 609, "start": 5709.8, "end": 5721.28, "text": "gedacht hier drüber, Friendly Name 1-4, ja aber wo ist das, wo war denn das nochmal,"}, {"id": 610, "start": 5721.28, "end": 5730.96, "text": "da, ach hier, genau hier, genau und die kann man jetzt benennen, also ich persönlich benenne"}, {"id": 611, "start": 5730.96, "end": 5736.12, "text": "die Dinger endgültig eigentlich in meiner Heimautomatisierung, also in meinem Home Assistant"}, {"id": 612, "start": 5736.12, "end": 5744.76, "text": "steht dann zum Beispiel drin, Keller Raspberry Pi, das würde ich hier nicht unbedingt, unbedingt"}, {"id": 613, "start": 5744.76, "end": 5751.28, "text": "so nennen, weil vielleicht steckt ihr die Steckdosenleiste mal woanders hin, ich würde"}, {"id": 614, "start": 5751.28, "end": 5756.08, "text": "sie aber auch nicht Tasmota 1-2-3-4 nennen, weil ihr habt am Ende sonst ganz ganz viele"}, {"id": 615, "start": 5756.08, "end": 5768.64, "text": "Geräte die Tasmota 1-2-3-4 heißen, also irgendwie nen gewissen Identifier für die Steckdosenleiste"}, {"id": 616, "start": 5768.64, "end": 5773.18, "text": "ist schon nicht verkehrt, wenn die Dinger offensichtlich irgendeine Nummer oder so drauf"}, {"id": 617, "start": 5773.18, "end": 5783.64, "text": "stehen haben, dann kann man das machen, also das Ding hat hinten als Nummer, ja hier guckt"}, {"id": 618, "start": 5783.64, "end": 5795.4, "text": "mal, das ist natürlich optimal, wenn da irgendeine Seriennummer oder sowas drauf steht, dann"}, {"id": 619, "start": 5795.4, "end": 5800.92, "text": "kann man die verwenden, ja also zum Beispiel steht hier was 0017674 drauf, dann erfindet"}, {"id": 620, "start": 5800.92, "end": 5805.68, "text": "man die Leiste im Zweifelsfall auch wieder, aber wir wollen es jetzt mal nicht übertreiben,"}, {"id": 621, "start": 5805.68, "end": 5811.44, "text": "man könnte natürlich auch den Labelchamp nehmen, wenn ich den mal irgendwann fertig"}, {"id": 622, "start": 5811.44, "end": 5820.16, "text": "programmiert hätte und ein Label drucken, nachdem ich den Labelchamp aber noch nicht"}, {"id": 623, "start": 5820.16, "end": 5825.0, "text": "fertig programmiert habe, werden wir jetzt was anderes machen, das habe ich tatsächlich"}, {"id": 624, "start": 5825.0, "end": 5829.36, "text": "bei den Geräten die ich im Haus verteilt habe, öfters schon gemacht, allerdings nicht"}, {"id": 625, "start": 5829.36, "end": 5832.96, "text": "bei allen, aber bei allen von denen ich mir dachte ich muss die mal wieder finden."}, {"id": 626, "start": 5832.96, "end": 5862.92, "text": "Ja und zwar, dass man sowas hier nimmt, das ist ein Labelprinter und da zum Beispiel jetzt"}, {"id": 627, "start": 5862.92, "end": 5884.96, "text": "drauf schreibt, wir schreiben jetzt auf den Labelprinter auf cute, chat, chat und dann"}, {"id": 628, "start": 5884.96, "end": 5898.96, "text": "drucken wir das aus, dann kommt hier neben irgendwie so ein Ding raus, 40 Euro das Ding,"}, {"id": 629, "start": 5898.96, "end": 5904.68, "text": "das da, ja das ist ein ganz billiger, so und dann kommt dann so ein Label raus, das ist"}, {"id": 630, "start": 5904.68, "end": 5912.2, "text": "relativ relativ beständig und das ist auch selbst klebend, man muss bloß das Papier"}, {"id": 631, "start": 5912.2, "end": 5926.48, "text": "da hinten abmachen und das ist jetzt der Inventartack, wie man es will, für diese Steckdoseleiste"}, {"id": 632, "start": 5926.48, "end": 5931.24, "text": "und dann kann man hingehen und sagen aha das hier ist nicht Hammer, sondern das ist Hammer"}, {"id": 633, "start": 5931.24, "end": 5940.16, "text": "cute chat, so und dann kann man die Dinger durch benennen, was für ein Gerät dann am"}, {"id": 634, "start": 5940.16, "end": 5944.16, "text": "Ende drauf kommt, das würde ich hier nicht machen, den würde ich nicht viel, sondern"}, {"id": 635, "start": 5944.16, "end": 5953.52, "text": "USB nennen, save und jetzt hat man auch ordentliche, ordentliche Benahmung, hier steht immer noch"}, {"id": 636, "start": 5953.52, "end": 5962.76, "text": "1, 2, 3 dran, ich bin mir relativ sicher, man kann diese Knöppe hier auch umbenennen,"}, {"id": 637, "start": 5962.76, "end": 5966.46, "text": "das weiß ich auch nicht warum es keine Querztastatur ist, wahrscheinlich weil das nicht passen"}, {"id": 638, "start": 5966.46, "end": 5971.6, "text": "würde von der Höhe, nach Querz hat ihr normalerweise nur 3 Reihen und die hier hat 5 Reihen, keine"}, {"id": 639, "start": 5971.6, "end": 5978.32, "text": "Ahnung, zumindest wenn ihr das jetzt in eure Heimautomatisierung einbindet, dann ist es"}, {"id": 640, "start": 5978.32, "end": 5981.88, "text": "ordentlich benannt, ich weiß nicht wie man diesen Scheiß hier setzt, es geht, ich weiß"}, {"id": 641, "start": 5981.88, "end": 5997.52, "text": "dass es geht, ja, pass motor, button name, web button, der Chat weiß Bescheid, web button"}, {"id": 642, "start": 5997.52, "end": 6020.72, "text": "ja, schauen wir mal, etwas groß ja, aber es funktioniert, gut, alternativ, ja das hier"}, {"id": 643, "start": 6020.72, "end": 6028.68, "text": "zu benennen ist natürlich relativ, relativ sinnlos, also ich würde es ehrlich gesagt"}, {"id": 644, "start": 6028.68, "end": 6034.88, "text": "einfach so lassen wie es standardmäßig ist, was dieser Analogsensor ist, habe ich übrigens"}, {"id": 645, "start": 6034.88, "end": 6040.24, "text": "keine Ahnung, der taucht bei jedem dieser Leisten auf, hat keinen sinnvollen Wert und"}, {"id": 646, "start": 6040.24, "end": 6046.0, "text": "macht nichts was irgendwie sinnvoll wäre, also keine Ahnung, für was dieser Analogsensor"}, {"id": 647, "start": 6046.0, "end": 6056.36, "text": "ist, so und jetzt haben wir eine Steckdoseleiste, die man schalten kann, das hier sollte USB"}, {"id": 648, "start": 6056.36, "end": 6068.08, "text": "sein, yep, yep, Hahn und das passt, eigentlich alles gut, so soll es sein, so, nachdem ich"}, {"id": 649, "start": 6068.08, "end": 6072.92, "text": "den Kram jetzt nicht neu machen will, copy paste ich mir das mal, das soll ich es nicht"}, {"id": 650, "start": 6072.92, "end": 6084.84, "text": "Hammer Vierer nennen, Hammer Vierer ist irgendwie doof, Hammer Cute Chat soll das heißen, weil"}, {"id": 651, "start": 6084.84, "end": 6091.96, "text": "das ist ja der Typ im Endeffekt, Hammer, was ist jetzt Hammer Vierer, ist mir doch wurscht,"}, {"id": 652, "start": 6091.96, "end": 6101.76, "text": "so, ich weiß gar nicht ob man das Motorgescheit-Config exportieren kann oder so, ah Backup-Config"}, {"id": 653, "start": 6101.76, "end": 6108.32, "text": "kann man machen, aber dann ist es doppelt, zumindest, jetzt könnte man die nächste Steckdoseleiste"}, {"id": 654, "start": 6108.32, "end": 6117.56, "text": "nehmen und Flashen, ich würde sagen eine machen wir noch Chat, weil ich glaube bei"}, {"id": 655, "start": 6117.56, "end": 6125.2, "text": "vier Stück wollte er mir jetzt nicht zugucken, so spannend ist das nicht, oder doch, tja"}, {"id": 656, "start": 6125.2, "end": 6128.56, "text": "gibt es sonst noch irgendwas was ich euch zeigen kann, was man einstellen kann, also"}, {"id": 657, "start": 6128.56, "end": 6132.92, "text": "wie gesagt, man kann mit Tasmota schon jede Menge Zeug machen, also ihr könnt beispielsweise"}, {"id": 658, "start": 6132.92, "end": 6142.6, "text": "hier An-Aus-Schalt-Schedules angeben und sowas, Konfig Timer, also ihr könnt hier"}, {"id": 659, "start": 6142.6, "end": 6146.72, "text": "beispielsweise einstellen wann das automatisch angehen soll, wann das automatisch ausgehen"}, {"id": 660, "start": 6146.72, "end": 6152.68, "text": "soll, aber ganz im Ernst, man kann das zwar machen in Tasmota, ich würde es aber über"}, {"id": 661, "start": 6152.68, "end": 6168.52, "text": "meine Heim-Automatisierung machen und nicht da drüber, kommt mal jetzt, jetzt wisst ihr"}, {"id": 662, "start": 6168.52, "end": 6177.56, "text": "auch wozu das Ding Zeitzone und NTP braucht, dass es Sunrise und Sunset und so weiß, weil"}, {"id": 663, "start": 6177.56, "end": 6187.04, "text": "das kriegst du nicht hin ohne Infos über Timezones und sowas, ja also ehrlich gesagt"}, {"id": 664, "start": 6187.04, "end": 6193.0, "text": "ich habe Timers, Timers in Tasmota noch nie verwendet, ich würde es über meine Heim-Automatisierung"}, {"id": 665, "start": 6193.0, "end": 6197.72, "text": "machen, Tasmota ist mega komplex, Tasmota hat sogar eine eigene Scripting Language wo"}, {"id": 666, "start": 6197.72, "end": 6203.24, "text": "du das dann automatisieren kannst, aber naja, das kannst du super easy in Home Assistant"}, {"id": 667, "start": 6203.24, "end": 6208.08, "text": "integrieren, das kann ich jetzt gerade nicht zeigen, weil ich das im WLAN hängen habe"}, {"id": 668, "start": 6208.08, "end": 6214.8, "text": "und ich nur hier in den Heim-Home Assistant bei mir im Internet hochfahren könnte, das"}, {"id": 669, "start": 6214.8, "end": 6224.16, "text": "ist super easy zu integrieren, du musst eigentlich ja so gut wie nichts machen, du installierst"}, {"id": 670, "start": 6224.16, "end": 6229.08, "text": "die Tasmota Integration und dann gehst du in die Konsole und sagst ein Kommando und"}, {"id": 671, "start": 6229.08, "end": 6235.2, "text": "dann, also du machst die MQTT Settings, die stellst du ein von deinem MQTT Broker, die"}, {"id": 672, "start": 6235.2, "end": 6239.32, "text": "vom Home Assistant und dann machst du ein Kommando in der Konsole und er meldet sich"}, {"id": 673, "start": 6239.32, "end": 6244.72, "text": "am Home Assistant an mit allem was er für Geräte hat, also mit dem Fall fünf Switches."}, {"id": 674, "start": 6244.72, "end": 6260.16, "text": "Ja Leute, den Label-Champ, den müssten wir echt fertig machen."}, {"id": 675, "start": 6260.16, "end": 6282.04, "text": "Ja, so was kann man machen, ja, also wie gesagt, Tasmota, Tasmota hat eine eigene Scripting"}, {"id": 676, "start": 6282.04, "end": 6283.04, "text": "Language."}, {"id": 677, "start": 6283.04, "end": 6290.92, "text": "Ja, ach ist das nur auf dem ESP32, ne da könntest du darauf nicht machen."}, {"id": 678, "start": 6290.92, "end": 6319.08, "text": "Ahja, na das ist sie, wusste ich gar nicht, aber wie gesagt würde ich eh nicht darüber"}, {"id": 679, "start": 6319.08, "end": 6322.88, "text": "machen, ich würde das über meine Smart Home Lösung machen und nicht hier irgendwie auf"}, {"id": 680, "start": 6322.88, "end": 6327.84, "text": "der Steckdosenleiste großartig Logik laufen lassen, ich mein, wir reden hier allen Ernstes"}, {"id": 681, "start": 6327.84, "end": 6332.48, "text": "über Customs-Scripter auf Steckdosenleisten, wir müssen es mal nicht übertreiben."}, {"id": 682, "start": 6332.48, "end": 6336.6, "text": "Ja, ich habe Label-Champ auch nicht weiter gemacht."}, {"id": 683, "start": 6336.6, "end": 6346.36, "text": "Was fertiges kenne ich auch nicht, vielleicht irgendwelche ZigBee-Dinger, also falls du"}, {"id": 684, "start": 6346.36, "end": 6351.76, "text": "Z-Wave hast, Z-Wave kann ich dir eine empfehlen, die das kann, aber ZigBee weiß ich nicht"}, {"id": 685, "start": 6351.76, "end": 6363.36, "text": "und vielleicht ein Shelly, vielleicht die Shelly-Kiste, also wenn du was fix und fertiges"}, {"id": 686, "start": 6363.36, "end": 6368.76, "text": "suchst, musst du mal gucken, ob das Shelly, ob das Shelly Smart Plug das kann, die sind"}, {"id": 687, "start": 6368.76, "end": 6370.64, "text": "fix und fertig, die musst du nicht flashen."}, {"id": 688, "start": 6370.64, "end": 6386.96, "text": "Kann das Shelly Smart Plug das, Power Measure, Power Metering, ja, ja, also wenn du ein bisschen"}, {"id": 689, "start": 6386.96, "end": 6393.64, "text": "mehr ausgeben willst als die China-Chinesen-Steckdosenleiste, dann kannst du hier ein Shelly Smart, Shelly"}, {"id": 690, "start": 6393.64, "end": 6400.12, "text": "Plug S kaufen, die kommen fix und fertig mit ziemlich guter Firmware, die muss man nicht"}, {"id": 691, "start": 6400.12, "end": 6407.48, "text": "flashen und die kannst du flashen, weil es halt nicht abgeschottet ist irgendwie, also"}, {"id": 692, "start": 6407.48, "end": 6410.8, "text": "die Shelly-Dinger sind für alle, die nicht selbst flashen wollen, natürlich immer eine"}, {"id": 693, "start": 6410.8, "end": 6412.04, "text": "sinnvolle Alternative."}, {"id": 694, "start": 6412.04, "end": 6426.88, "text": "Guck mal, was kostet der Kram aktuell auf Amazon, ja, ihrer Packung, ja du kannst easy"}, {"id": 695, "start": 6426.88, "end": 6431.64, "text": "das Motor flashen drauf, aber die Standard-Firmware ist auch okay, ja, die Standard-Firmware braucht"}, {"id": 696, "start": 6431.64, "end": 6455.0, "text": "keine Cloud, also nicht zwingend und kann MQTT und HTTP und sowas, ja, also so sieht"}, {"id": 697, "start": 6455.0, "end": 6480.8, "text": "es aus, gut, dann würde ich sagen, FUNST und NEXT, NEXT, auf geht's, raus mit dir und"}, {"id": 698, "start": 6480.8, "end": 6484.36, "text": "in die Ecke gefäffert, ich hab da ein Kissen liegen, also ich hab die nicht wirklich in"}, {"id": 699, "start": 6484.36, "end": 6488.0, "text": "die Ecke gefäffert, also die lebt noch, die ist nicht kaputt, ich hol mal die nächste"}, {"id": 700, "start": 6488.0, "end": 6506.04, "text": "Steckdosenleiste"}, {"id": 701, "start": 6506.04, "end": 6518.8, "text": "und jetzt mach ich mal wieder das Licht an, weil, so sieht man einfach besser, so, also"}, {"id": 702, "start": 6518.8, "end": 6529.36, "text": "dann packen, den machen wir mal weg, dann packen wir mal aus, alter was ist, wie ist es denn"}, {"id": 703, "start": 6529.36, "end": 6534.28, "text": "überhaupt gedacht, Moment, ich muss es mal kurz analysieren, wie ist es gedacht aufzumachen,"}, {"id": 704, "start": 6534.28, "end": 6539.8, "text": "da ist ja Plastik, ich müsste das gar nicht aufreißen, ich könnte das einfach am Plastik"}, {"id": 705, "start": 6539.8, "end": 6549.6, "text": "aufmachen, guckt mal, easy, ist ja für Loops, das geht dann einfach auf, guckt euch das"}, {"id": 706, "start": 6549.6, "end": 6572.56, "text": "mal an, was soll denn das, ohne kaputt zu reißen geht das dann auf, LUL, LUL HD, ok,"}, {"id": 707, "start": 6572.56, "end": 6590.8, "text": "so gleich nochmal von vorne, Start, nee Moment, langsam, langsam, so, anstöpseln und in Flashing"}, {"id": 708, "start": 6590.8, "end": 6610.56, "text": "Modus packen, so, Plinkt ist im Flashing Modus, Start, Flash, so jetzt mit dem Tablet connecten,"}, {"id": 709, "start": 6610.56, "end": 6624.36, "text": "Tablet is connected, put your IOT device things, press enter, müsste es eigentlich klicken,"}, {"id": 710, "start": 6624.36, "end": 6643.36, "text": "es hat geklickt, ok, ok, es hat geklickt, so hoffen wir mal, dass es jetzt einfach funktioniert"}, {"id": 711, "start": 6643.36, "end": 6657.96, "text": "wenn ich es nicht wieder 5 mal neu machen muss wie beim letzten Mal, ok, eins hab ich"}, {"id": 712, "start": 6657.96, "end": 6663.76, "text": "schon gemerkt, wenn das dieses config package senden eine Weile dauert, dann klappt das"}, {"id": 713, "start": 6663.76, "end": 6689.16, "text": "meistens, das"}, {"id": 714, "start": 6689.16, "end": 6704.08, "text": "dauert aber schon ganz schön lang jetzt, warum fischst du eine Steckdosenleiste, so, ja hat"}, {"id": 715, "start": 6704.08, "end": 6709.4, "text": "funktioniert wunderbar, easy, warum fischst du eine Steckdosenleiste, dass ich sie ohne"}, {"id": 716, "start": 6709.4, "end": 6716.88, "text": "China Chinesen Cloud betreiben kann, ist eines der Punkte und dass ich es besser in"}, {"id": 717, "start": 6716.88, "end": 6721.96, "text": "mein Smart Home integrieren kann ist ein weiterer Punkt, so also was wir haben, Flash Tasmota,"}, {"id": 718, "start": 6721.96, "end": 6727.8, "text": "yes, do you want to Flash Tasmota, yes, billig, so und dann muss ich den ganzen Müll nochmal"}, {"id": 719, "start": 6727.8, "end": 6742.72, "text": "übers Tablet an WLAN Passwörtern eingeben wieder, no, gut, hat funktioniert mit dem Flaschen,"}, {"id": 720, "start": 6742.72, "end": 6753.24, "text": "jetzt müssen wir Tasmota uns connecten auf die Steckdosenleiste, genau und die gute Frage"}, {"id": 721, "start": 6753.24, "end": 6760.08, "text": "ist eh warum nicht, das ist die richtige Frage, ja eine Steckdosenleiste braucht eine Cloud,"}, {"id": 722, "start": 6760.08, "end": 6764.16, "text": "jaja natürlich, wenn du dir China Chinesen Zeug kaufst, das braucht alles eine Cloud"}, {"id": 723, "start": 6764.16, "end": 6777.48, "text": "heutzutage, so Home, also Access Point Passwort, Kekl, mehr verrate ich nicht."}, {"id": 724, "start": 5787.1, "end": 6822.8, "text": "ich hoffe ich habe es nochmal gesaved, sonst muss ich gleich nochmal alles eintippen,"}, {"id": 725, "start": 6822.8, "end": 6833.4, "text": "ich glaube ich habe mich verschrieben Leute, schauen wir mal, schauen wir mal ob es funktioniert,"}, {"id": 726, "start": 6833.4, "end": 6842.32, "text": "ich glaube es hat funktioniert, wait a minute, einfach so, vielleicht habe ich es doch nicht"}, {"id": 727, "start": 6842.32, "end": 6848.08, "text": "verschrieben, also von der Idee her müsste die IP von der Steckdosenleiste jetzt die"}, {"id": 728, "start": 6848.08, "end": 6857.4, "text": "hier sein, musst du nochmal überprüfen, tatsächlich, easy, null, ich dachte ich habe"}, {"id": 729, "start": 6857.4, "end": 6862.4, "text": "mich verschrieben, ich habe mich gar nicht verschrieben, ich will mich jetzt ja nicht"}, {"id": 730, "start": 6862.4, "end": 6870.72, "text": "beschweren, die leitet Strom weiter, jaja natürlich dafür ist sie da, aber du kannst"}, {"id": 731, "start": 6870.72, "end": 6875.8, "text": "sie halt auch remote schalten, du kannst remote schalten über Webinterface MQTT oder wie"}, {"id": 732, "start": 6875.8, "end": 6882.24, "text": "du willst, diese Steckdosen einzeln und USB alle 4 auf einmal an und aus, IP Leak schon"}, {"id": 733, "start": 6882.24, "end": 6892.2, "text": "wieder, oh nein, ok, Console, NTP Server, müssen wir jetzt setzen, ihr seht wie lahm"}, {"id": 734, "start": 6892.2, "end": 6900.8, "text": "das ist, wie lief das Bewerbungsgespräch letzten Monat richtig gut, fand ich gut, also"}, {"id": 735, "start": 6900.8, "end": 6905.8, "text": "ich fand den Laden nicht schlecht, ich habe mich mit dem Interviewer verstanden, der hat"}, {"id": 736, "start": 6905.8, "end": 6910.6, "text": "bei mir auch schon abends zu dem Stream eingeguckt, das fand ich witzig, ich werde demnächst"}, {"id": 737, "start": 6910.6, "end": 6927.96, "text": "irgendwann mal einen Probearbeitstag machen, so, ok das Motor ist am rumspacken, weil ich"}, {"id": 738, "start": 6927.96, "end": 6940.76, "text": "kein NTP Server gesetzt habe, das ist PainsChamp, so NTP Server 1, NTP Server 2, NTP Server 3,"}, {"id": 739, "start": 6940.76, "end": 6949.52, "text": "ich hoffe der frisst die Commands jetzt und es funktioniert und dann machen wir ein Update,"}, {"id": 740, "start": 6949.52, "end": 6953.72, "text": "wie läuft sowas eigentlich, nimmt man sich dann einfach einen Tag Urlaub, nö, ich mache"}, {"id": 741, "start": 6953.72, "end": 6961.28, "text": "das montags, montags habe ich eh frei, montags arbeite ich eh nicht, es ist ja kein Probearbeitstag"}, {"id": 742, "start": 6961.28, "end": 6966.44, "text": "in dem Sinn, dass ich dafür groß Geld bekommen würde oder da wirklich was arbeite großartig,"}, {"id": 743, "start": 6966.44, "end": 6969.8, "text": "das ist, dass man sich das mal anguckt, dass man das Team kennenlernt und die ein oder"}, {"id": 744, "start": 6969.8, "end": 6974.68, "text": "anderen Sachen vielleicht auch mal so tut, als würde man was machen und besprechen"}, {"id": 745, "start": 6974.68, "end": 6983.64, "text": "und gucken, ob das passt beidseitig, ich glaube nicht, dass ich denen in einem Tag eine neue"}, {"id": 746, "start": 6983.64, "end": 6988.04, "text": "Konfigmanagement für ihre Cloud aus dem Boden stampfe oder sowas und dann sage easy,"}, {"id": 747, "start": 6988.04, "end": 7017.28, "text": "ja, mache ich in einem Tag. Sagen wir mal, könnte das vielleicht jetzt mal laden hier"}, {"id": 748, "start": 7017.28, "end": 7027.36, "text": "so, lade, lade das verdammte Spiel, ich will nicht, dass es lädt, einfach langsam, einfach"}, {"id": 749, "start": 7027.36, "end": 7034.72, "text": "langsam as fuck, ohne, also ihr seht jetzt, was es ausmacht, wenn NTP Server geblockt"}, {"id": 750, "start": 7034.72, "end": 7041.12, "text": "ist bei TAS Motor, das ist von superschnell bedienbar zu unbenutzbar langsam ohne NTP"}, {"id": 751, "start": 7041.12, "end": 7057.84, "text": "Server, wow, nice Hackerman Content, ok, Konsole, hat das jetzt gefressen, ja, guck jetzt ist"}, {"id": 752, "start": 7057.84, "end": 7067.8, "text": "er schnell, weil er den NTP Server gefressen hat, ja, alles klar, Zeit ist richtig, Timestone"}, {"id": 753, "start": 7067.8, "end": 7087.76, "text": "plus eins ist falsch, also Timestone plus eins ist falsch, wir haben nicht 19.54, sondern"}, {"id": 754, "start": 7087.76, "end": 7093.24, "text": "20.54, aber ganz im Ernst, damit kann ich leben, wenn meine Steckdosenleiste ein bisschen"}, {"id": 755, "start": 7093.24, "end": 7101.44, "text": "falsch geht, ist in Ordnung, was ist ein NTP Server, das ist ein Netzwerkservice zum Uhrzeit"}, {"id": 756, "start": 7101.44, "end": 7108.2, "text": "synchronisieren, hast du auch, hat jeder daheim, wissen die meisten vielleicht nix von, aber"}, {"id": 757, "start": 7108.2, "end": 7115.52, "text": "hat jeder, jeder 0815 Router macht NTP mit, also, ich will jetzt nicht über die Details"}, {"id": 758, "start": 7115.52, "end": 7121.6, "text": "sprechen, ob das ein Router ist oder ein Multifunktionsgerät oder so, aber, ja, also jeder 0815 Telekom"}, {"id": 759, "start": 7121.6, "end": 7132.0, "text": "Router, Fritzbox, sonst was hat ein NTP dabei, genauso wie DNS, also, Config, Activate, Safe,"}, {"id": 760, "start": 7132.0, "end": 7141.0, "text": "so, jetzt gucken wir mal, ob das funktioniert, mit Schalten gleich, jawoll, Kunst, klick,"}, {"id": 761, "start": 7141.0, "end": 7145.96, "text": "klick, klick, klick, alles klar, Firmware Upgrade, mal gucken, ob das Ding genug Speicherplatz"}, {"id": 762, "start": 7145.96, "end": 7150.16, "text": "hat, um direkt das Firmware Upgrade zu machen, werden wir gleich sehen, dass ich nicht den"}, {"id": 763, "start": 7150.16, "end": 7167.48, "text": "Zwischenschritt machen muss, wie das letzte Mal, ja, hat funktioniert, nice, ich weiß,"}, {"id": 764, "start": 7167.48, "end": 7172.0, "text": "wie ich das Ding nennen werde, ich nenne das Hammer 4 Plus USB, dann weiß ich auch, was"}, {"id": 765, "start": 7172.0, "end": 7186.2, "text": "es ist, unreachable, oh no, da ist er wieder, nicht HTTPS, Firefox, was machst du da, Config,"}, {"id": 766, "start": 7186.2, "end": 7198.32, "text": "das Ding soll heißen 4 Plus USB, dann weiß ich auch, was es ist, ja, so ist guter Name,"}, {"id": 767, "start": 7198.32, "end": 7214.72, "text": "Hammer 4 Head Plus USB, der Router, der synchronisiert sich übers Internet, und mit dem gleichen"}, {"id": 768, "start": 7214.72, "end": 7221.04, "text": "Protokoll, wie sich deine Rechnerlokale mit dem Router synchronisieren, eigenes, eigenen"}, {"id": 769, "start": 7221.04, "end": 7226.08, "text": "Time Server hat keiner, kann man machen, ja, sogar, sag mal so, in der Anflugschritte,"}, {"id": 770, "start": 7226.08, "end": 7233.04, "text": "relativ günstig, du brauchst einen GPS Empfänger, die sind billig, und mit dem GPS Empfänger"}, {"id": 771, "start": 7233.04, "end": 7238.04, "text": "hast du ziemlich akkurater Time, und da kannst du das theoretisch selbst machen, aber ganz"}, {"id": 772, "start": 7238.04, "end": 7247.12, "text": "im Ernst, but why, es macht keinen Sinn, das selbst zu machen, ist komplett unsinnig,"}, {"id": 773, "start": 7247.12, "end": 7251.56, "text": "warum sollte man das selbst machen, also es geht, es geht relativ günstig, aber es macht"}, {"id": 774, "start": 7251.56, "end": 7258.6, "text": "keinen Sinn, also wenn du einen GPS Empfänger hast, hast du automatisch auch genaue Zeit."}, {"id": 775, "start": 7258.6, "end": 7269.44, "text": "So, was muss man jetzt noch setzen, Config Template, so das Ding heißt nicht TAS Motor,"}, {"id": 776, "start": 7269.44, "end": 7276.16, "text": "sondern wie habe ich das genannt, Hammer, jetzt müsste ich es eigentlich anders benennen,"}, {"id": 777, "start": 7276.16, "end": 7281.6, "text": "weil das ja die Inventar Nummer war, von dem anderen, das ist eine ziemlich bescheuerte"}, {"id": 778, "start": 7281.6, "end": 7294.72, "text": "Nummer, so, USB, save, du kannst übrigens deinen Rechner auch mit NTP Server im Internet"}, {"id": 779, "start": 7294.72, "end": 7298.56, "text": "synchronisieren, also es ist nicht so, als müsstest du das über deinen Router machen,"}, {"id": 780, "start": 7298.56, "end": 7303.28, "text": "aber die meisten Router werden sich wahrscheinlich als NTP per DHCP verteilen, vermute ich mal,"}, {"id": 781, "start": 7303.28, "end": 7313.08, "text": "ja das ist Schwachsinn, man muss das nicht selber machen, so, easy, also wenn man weiß,"}, {"id": 782, "start": 7313.08, "end": 7315.96, "text": "wie es funktioniert, ist es doch wirklich nicht schwer gewesen, oder Leute, wir haben"}, {"id": 783, "start": 7315.96, "end": 7320.48, "text": "jetzt 5 Minuten gebraucht, das Ding zu flashen, zu aktualisieren auf die aktuelle TAS Motor"}, {"id": 784, "start": 7320.48, "end": 7327.28, "text": "Version, es ordentlich zu beschriften und fertig, jetzt könnte man das mit zwei Befehlen"}, {"id": 785, "start": 7327.28, "end": 7332.88, "text": "ins Home Automation System einbinden, was ich euch nicht zeigen kann, weil ich da zu viel"}, {"id": 786, "start": 7332.88, "end": 7340.2, "text": "private Sachen drin stehen hab, ich könnte jetzt hier irgendein Home Assistant oder so"}, {"id": 787, "start": 7340.2, "end": 7348.12, "text": "hochfahren, aber das lohnt sich nicht, wobei wir hätten eine Home Assistant VM, machen"}, {"id": 788, "start": 7348.12, "end": 7351.84, "text": "wir mal, man schadet ja nichts, können wir uns ja noch schnell machen, ich weiß halt"}, {"id": 789, "start": 7351.84, "end": 7356.44, "text": "nicht, wie aktuell das ist, es kann sein, dass ich das mal updaten muss, können wir"}, {"id": 790, "start": 7356.44, "end": 7360.36, "text": "machen, ist wie gesagt easy, dann zeige ich euch auch mal, wie einfach das ist, die Steckdosen"}, {"id": 791, "start": 7360.36, "end": 7364.56, "text": "leistet jetzt in sein Smart Home einzubinden, ich muss aber vorher erstmal ein Update vom"}, {"id": 792, "start": 7364.56, "end": 7369.56, "text": "Home Assistant, von der Home Assistant VM machen, weil die ist, die hatte ich 3 Monate"}, {"id": 793, "start": 7369.56, "end": 7373.28, "text": "nicht an, die hat wahrscheinlich uralt Versionen auch drauf, machen wir das, machen wir das"}, {"id": 794, "start": 7373.28, "end": 7380.36, "text": "einfach gerade mal, schadet doch nichts, so, und ansonsten, also flashtechnisch passt"}, {"id": 795, "start": 7380.36, "end": 7385.24, "text": "das, ich hab jetzt noch 2 weitere im Schrank liegen, wie gesagt, ich glaube das wollt ihr"}, {"id": 796, "start": 7385.24, "end": 7389.12, "text": "euch nicht noch angucken, dass ich das ganze 2 mal mach, dass ich das ganze noch 2 mal"}, {"id": 797, "start": 7389.12, "end": 7393.84, "text": "mache, also ich hab den Home Assistant nicht auf Raspberry Pi, ich hab das auf ne x86"}, {"id": 798, "start": 7393.84, "end": 7394.84, "text": "Kiste."}, {"id": 799, "start": 7394.84, "end": 7401.32, "text": "Was ist an dem Ding anders, dass es nicht mal mit der China Cloud verbunden ist, ja,"}, {"id": 800, "start": 7401.32, "end": 7407.72, "text": "das ist fast der wichtigste Punkt, aber es läuft ne komplett andere Firmware drauf als"}, {"id": 801, "start": 7407.72, "end": 7412.92, "text": "original, also dieses Web Interface, was du hier jetzt siehst, das gibt es normalerweise"}, {"id": 802, "start": 7412.92, "end": 7420.08, "text": "gar nicht, normalerweise gibt es nur die offizielle App und die China Cloud, und die offizielle"}, {"id": 803, "start": 7420.08, "end": 7426.24, "text": "App steuert über die China Cloud seine Steckdose, sowas hier, Web Interface, MQTT Integration"}, {"id": 804, "start": 7426.24, "end": 7431.52, "text": "und sowas, vergiss es, gibt es nicht, hat es standardmäßig nicht, entweder bist du"}, {"id": 805, "start": 7431.52, "end": 7436.76, "text": "glücklich mit der China Cloud oder nicht und gescheit in deine Heimautomatisierung einbinden"}, {"id": 806, "start": 7436.76, "end": 7450.2, "text": "kannst du es natürlich auch nicht, was hat das Ding für ne IP gekriegt, 2.132 ok, Home"}, {"id": 807, "start": 7450.2, "end": 7461.92, "text": "Assistant hat 8, 123 ok, Admin 123 hoffe ich mal, wenigstens bin ich mir treu, wenigstens"}, {"id": 808, "start": 7461.92, "end": 7471.84, "text": "bin ich mir treu, was meine super Five Head Benamung angeht von Passwörtern, so Configuration,"}, {"id": 809, "start": 7471.84, "end": 7479.92, "text": "wir haben mal kurz ein Update, boah das ist ja uralt, Alter dieser Home Assistant ist"}, {"id": 810, "start": 7479.92, "end": 7499.72, "text": "ja uralt, was ist denn das für ne Version, das ist ja antik, November 2029, das ist ja"}, {"id": 811, "start": 7499.72, "end": 7513.4, "text": "uralt, ok das muss man mal schnell updaten, wir brauchen kein Backup, entweder es geht"}, {"id": 812, "start": 7513.4, "end": 7522.16, "text": "kaputt oder es funktioniert, warum connecte die App nicht direkt mit der Steckdose, das"}, {"id": 813, "start": 7522.16, "end": 7527.72, "text": "musste die China Chinesen fragen, wahrscheinlich hat es zwei Gründe, erstens wollen sie deine"}, {"id": 814, "start": 7527.72, "end": 7533.24, "text": "Daten haben und vielleicht möchte die chinesische Regierung irgendwie mal nen Botnetz haben"}, {"id": 815, "start": 7533.24, "end": 7543.04, "text": "mit paar Millionen Leuten, aber der offensichtliche Grund ist, ich gehe davon aus, also der nicht"}, {"id": 816, "start": 7543.04, "end": 7548.12, "text": "so verschwörungsmäßige Grund ist, das ist, dass du deine Steckdosenleister aus dem Internet"}, {"id": 817, "start": 7548.12, "end": 7555.2, "text": "steuern kannst, weil bestimmt viele Leute sagen, ah dann kann ich aus dem Urlaub ja"}, {"id": 818, "start": 7555.2, "end": 7564.56, "text": "keine Ahnung den Kaffeekocher ein und ausschalten oder so, ich weiß nicht ob das wirklich ein"}, {"id": 819, "start": 7564.56, "end": 7570.4, "text": "oft benutzter Anwendungsfall ist, aber ich glaube das ist ein Anwendungsfall den die"}, {"id": 820, "start": 7570.4, "end": 7577.72, "text": "Hersteller gerne verkaufen als tolle Möglichkeit, ja und damit hast du quasi direkt, genau Alexa"}, {"id": 821, "start": 7577.72, "end": 7584.12, "text": "Integration und so ein Crap, damit hast du halt direkt die Möglichkeit ohne irgendwas"}, {"id": 822, "start": 7584.12, "end": 7588.64, "text": "selbst zu konfigurieren aus dem Internet drauf zuzugreifen, aber ganz ehrlich ich möchte"}, {"id": 823, "start": 7588.64, "end": 7595.4, "text": "nicht aus dem Internet auf meine Steckdosenleister zugreifen, wobei es wie gesagt wahrscheinlich"}, {"id": 824, "start": 7595.4, "end": 7599.88, "text": "umgedreht ist, die Steckdosenleiste ist subscribed zu irgendeinem Websocket und kriegt es dann"}, {"id": 825, "start": 7599.88, "end": 7603.16, "text": "geschickt, also ich glaube nicht, dass man direkt aus dem Internet zugreifen kann, aber"}, {"id": 826, "start": 7603.16, "end": 7610.2, "text": "trotzdem will ich das, wahrscheinlich nicht, hat das Update jetzt funktioniert, ja Update"}, {"id": 827, "start": 7610.2, "end": 7620.92, "text": "hat funktioniert, nice, yes alles updaten, alles updaten und dann zeige ich euch wie"}, {"id": 828, "start": 7620.92, "end": 7630.16, "text": "man die Steckdosenleiste super easy integrated in Home Assistant, um nicht zu sagen easy"}, {"id": 829, "start": 7630.16, "end": 7642.48, "text": "as fuck integriert, wir warten aber erstmal bis das Ding rebooted ist, dass ich die aktuellste"}, {"id": 830, "start": 7642.48, "end": 7665.48, "text": "Version habe."}, {"id": 831, "start": 7665.48, "end": 7677.96, "text": "Du kannst es ja auch selbst machen, wenn du Zugriff von außen brauchst, du brauchst"}, {"id": 832, "start": 7677.96, "end": 7682.76, "text": "dir da keine China App für, hat das jetzt den Install gemacht oder nicht?"}, {"id": 833, "start": 7682.76, "end": 7703.56, "text": "Ah der rebooted noch ok, alles klar, so da sind wir wieder, wir haben aktuelle Version"}, {"id": 834, "start": 7703.56, "end": 7709.8, "text": "drauf, refreshen das ganze mal, stellen fest, dass Home Assistant noch nicht gebootet ist,"}, {"id": 835, "start": 7709.8, "end": 7717.16, "text": "Home Assistant ist nicht so schnell beim booten was das angeht und jetzt irgendwann Home Assistant"}, {"id": 836, "start": 7717.16, "end": 7726.0, "text": "ist starting, dismiss, ja dann starte mal alter, mach hin, kein Backup, neuesten MQTT Broker"}, {"id": 837, "start": 7726.0, "end": 7731.56, "text": "draufhauen, gut ist, so jetzt zeige ich euch wie man die Steckdosenleiste super easy noch"}, {"id": 838, "start": 7731.56, "end": 7737.16, "text": "in Home Assistant integriert, weil was hat man davon, wenn die Steckdosenleiste jetzt"}, {"id": 839, "start": 7737.16, "end": 7740.52, "text": "schön über das Webinterface steuerbar ist, dann möchte er das ja über seine Smart Home"}, {"id": 840, "start": 7740.52, "end": 7741.52, "text": "Lösung machen."}, {"id": 841, "start": 7741.52, "end": 7750.16, "text": "Wir haben im Stream auch schon ESP-866, ESP-32 Firmware selbst gemacht, aber in dem Fall"}, {"id": 842, "start": 7750.16, "end": 7758.92, "text": "benutze ich TASMOTA, TASMOTA ist mit so das bekannteste an Custom Firmwares, guck mal,"}, {"id": 843, "start": 7758.92, "end": 7765.04, "text": "18.000 Sterne auf GitHub und super aktives Projekt, also was besseres kannst du eigentlich"}, {"id": 844, "start": 7765.04, "end": 7773.0, "text": "nicht installieren, ach guck mal, der musste, Leute, von wegen gar nicht so alt, der muss"}, {"id": 845, "start": 7773.0, "end": 7779.0, "text": "jetzt nochmal, der muss nochmal upgraden auf 7.6, das war bloß so ein Zwischenschritt,"}, {"id": 846, "start": 7779.0, "end": 7791.2, "text": "lull, also muss er nochmal rebooten bis es aktuell ist, ja das ist Ende 2021, bei Home"}, {"id": 847, "start": 7791.2, "end": 7797.24, "text": "Assistant tut sich richtig viel, die sind immer BÄM BÄM BÄM neue Versionen am rausprügeln,"}, {"id": 848, "start": 7797.24, "end": 7803.52, "text": "oh nochmal installen machen, mittlerweile haben die sogar einen Progress Balken, der"}, {"id": 849, "start": 7803.52, "end": 7809.84, "text": "mit der, wahrscheinlich mit der Realität nicht all zu viel zu tun hat, die sind relativ"}, {"id": 850, "start": 7809.84, "end": 7814.2, "text": "stable und die haben richtig gute Changelogs vor allem, also du erfährst meistens in"}, {"id": 851, "start": 7814.2, "end": 7820.92, "text": "einem Changelog sogar, ob es realistisch ist, dass du noch was machen musst oder nicht,"}, {"id": 852, "start": 7820.92, "end": 7827.04, "text": "Sachen gibts, also ich kann echt nicht meckern, Home Assistant ist wirklich das Richtige gewesen,"}, {"id": 853, "start": 7827.04, "end": 7832.04, "text": "was ich damals mir ausgesucht hab und ich glaube ich hab Home Assistant, ich wollte"}, {"id": 854, "start": 7832.04, "end": 7836.24, "text": "ursprünglich Open Hub verwenden, Java Zeug, MonkaS, da kannte ich mich in dem Bereich"}, {"id": 855, "start": 7836.24, "end": 7841.84, "text": "noch nicht so aus und ich glaube damals hat mir auf Twitter, und es könnte der Sebaro"}, {"id": 856, "start": 7841.84, "end": 7849.52, "text": "sogar gewesen sein, der CuteMod höchstpersönlich hat geschrieben, warum der nicht Home Assistant"}, {"id": 857, "start": 7849.52, "end": 7855.96, "text": "ist, da hab ich mir das angeguckt und wo der steckt, wird mich auch mal interessieren"}, {"id": 858, "start": 7855.96, "end": 7862.88, "text": "und seitdem benutze ich das seit 4 Jahren oder so, also nicht diese VM, diese VM hat"}, {"id": 859, "start": 7862.88, "end": 7872.68, "text": "ja offensichtlich keine Konfig drinne, aber Home Assistant ist ein bisschen problematisch,"}, {"id": 860, "start": 7872.68, "end": 7876.68, "text": "wenn du da ewig nicht aktualisierst, kanns sein, dass du auf einen Schlag halt total"}, {"id": 861, "start": 7876.68, "end": 7881.76, "text": "viele Breaking Changes hast aus den letzten 16 Releases, die du nicht gemacht hast, so"}, {"id": 862, "start": 7881.76, "end": 7885.84, "text": "hat er jetzt rebooted, dann binden wir jetzt die Steckdosenleiste ein, ne er rebooted noch,"}, {"id": 863, "start": 7885.84, "end": 7898.44, "text": "ok, alles gut, rebooted mal ein bisschen schneller, Heimatassistent, Heimatunterstützer, Heimunterstützer,"}, {"id": 864, "start": 7898.44, "end": 7905.72, "text": "Heimhelfer, wie kann man das am besten übersetzen, Home Assistant, Zuhause, Zuhausehelfer oder"}, {"id": 865, "start": 7905.72, "end": 7920.2, "text": "so, was hast du alles so in deinem Smart Home integriert, boah, da müsste ich jetzt"}, {"id": 866, "start": 7920.2, "end": 7930.56, "text": "lange, einiges, ich hab euch ja schonmal so grob paar Sachen gezeigt, aber alles mögliche"}, {"id": 867, "start": 7930.56, "end": 7938.52, "text": "von Fensterkontakten bis Steckdosen bis Licht, paar Automatisierungen wie Zugverspätungen,"}, {"id": 868, "start": 7938.52, "end": 7946.96, "text": "dass er automatisch den Lüfter im Bad ausschaltet, LED Beleuchtung an der Treppe, bis zum Weihnachtsbaum,"}, {"id": 869, "start": 7946.96, "end": 7959.2, "text": "sogar der Weihnachtsbaum ist drinne, so, also, jetzt aber."}, {"id": 870, "start": 7959.2, "end": 7966.24, "text": "Aktuelle Home Assistant, gut, wir haben es geschafft, so, damit man seine Steckdosenleiste"}, {"id": 871, "start": 7966.24, "end": 7972.02, "text": "ordentlich in Home Assistant einbinden kann, muss man folgendes machen, man braucht auf"}, {"id": 872, "start": 7972.02, "end": 7980.72, "text": "jeden Fall, warte mal, was ist das, Steuerung P, ne, Control P, ne, die hatten doch jetzt"}, {"id": 873, "start": 7980.72, "end": 7985.52, "text": "so ein cooles Menü bei Home Assistant, ich hab aber vergessen, Control C, hmm, Control"}, {"id": 874, "start": 7985.52, "end": 7994.4, "text": "A, Home Assistant hatten jetzt so ein Schnell-Finde-Menü neuerdings eingebaut, Shift P, ne, Home"}, {"id": 875, "start": 7994.4, "end": 8013.88, "text": "Assistant Quick Menu, ne, das mein ich nicht, Control K, nein, Command Menu, ne, Control"}, {"id": 876, "start": 8013.88, "end": 8036.44, "text": "S, Menu, vielleicht was mit M, Control M, ne, unmuted hab ich's jetzt, sehr gut, ja,"}, {"id": 877, "start": 8036.44, "end": 8043.84, "text": "man braucht das nicht, man kann das auch übers Menü machen, ach, einfach nur C, ach, da"}, {"id": 878, "start": 8043.84, "end": 8048.4, "text": "hab ich gesucht, einfach nur C, es ist nicht Control C, einfach nur C, also man kann das"}, {"id": 879, "start": 8048.4, "end": 8056.32, "text": "alles auch über die Menüs machen, also, ihr müsst jetzt erst mal zu Integrations und"}, {"id": 880, "start": 8056.32, "end": 8067.6, "text": "ihr braucht einen konfigurierten MQTT Service, so, ohne funktioniert's nicht, dann geht ihr"}, {"id": 881, "start": 8067.6, "end": 8073.08, "text": "auf das Tasmota von der Steckdosenleiste und tragt hier unter MQTT Settings euren Home"}, {"id": 882, "start": 8073.08, "end": 8082.24, "text": "Assistant ein, also, die IP Port ist der Standard MQTT Port, so, save, so, Start, dann guckt"}, {"id": 883, "start": 8082.24, "end": 8087.08, "text": "ihr in die Konsole, ob er sich mit MQTT verbinden kann, ob alles gut ist, wenn er dann mal neu"}, {"id": 884, "start": 8087.08, "end": 8095.88, "text": "gestartet ist, Failed Connect, das ist schon mal schlecht, können wir mal gucken, ob das"}, {"id": 885, "start": 8095.88, "end": 8106.12, "text": "denn überhaupt läuft, Tailed Net, eins, eins, acht, acht, drei, siehste, funktioniert, da"}, {"id": 886, "start": 8106.12, "end": 8114.68, "text": "liegt es an der Firewall-Freischaltung, nicht funktioniert, eins, acht, acht, drei, wir"}, {"id": 887, "start": 8114.68, "end": 8127.28, "text": "können auch Mosquito Sub oder so machen, hm, also, meine Steckdose kommt zumindest nicht"}, {"id": 888, "start": 8127.28, "end": 8132.68, "text": "zu meinem MQTT Server, was wahrscheinlich an Firewall-Regeln liegt, würde ich jetzt mal"}, {"id": 889, "start": 8132.68, "end": 8162.64, "text": "vermuten, MQTT, also, ich habs erlaubt, dass das freigeschaltet ist, ja, das war's, das"}, {"id": 890, "start": 8162.64, "end": 8170.88, "text": "muss man nur einmal machen, aber, komisch, warum geht das nicht, ist alles Default, ist"}, {"id": 891, "start": 8170.88, "end": 8189.44, "text": "alles richtig, mit der Leiste, Tuya Convert, hiermit, mit dem Raspberry Pi, ich weiß nicht,"}, {"id": 892, "start": 8189.44, "end": 8198.76, "text": "warum eine Leiste da gerade nicht hinkommt, wenn ich ehrlich bin, achso, vielleicht, ach,"}, {"id": 893, "start": 8198.76, "end": 8205.0, "text": "ich bin ja blöd, ich hab keine User eingestellt, ich glaube, ich muss User einstellen, wartet"}, {"id": 894, "start": 8205.0, "end": 8223.04, "text": "mal, ich hab keine User eingestellt, ja, Addons, Mosquito MQTT Broker Configuration, ja, ich"}, {"id": 895, "start": 8223.04, "end": 8237.6, "text": "glaube, ich hab keine User eingestellt, ruhig mal aus, Host, Topic, ah, ich darf nicht, ok,"}, {"id": 896, "start": 8237.6, "end": 8243.56, "text": "User, Admin, Passwort, geht das, ok, das funktioniert, alles klar."}, {"id": 897, "start": 8243.56, "end": 8264.36, "text": "Ich will nicht anonyme Listener erlauben, ich will schon User haben, das muss man nur"}, {"id": 898, "start": 8264.36, "end": 8276.52, "text": "einmal machen, User, wo konnte man nochmal Accounts anlegen, hier, Add Person, nee, wartet"}, {"id": 899, "start": 8276.52, "end": 8288.36, "text": "mal, wo macht man das nochmal, war das hier in den Settings, Documentation, User, Configuration,"}, {"id": 900, "start": 8288.36, "end": 8304.36, "text": "User, User, User, Users, ah ja, genau, also, MQTT, Username, Passwort, kann man sich jetzt"}, {"id": 901, "start": 8304.36, "end": 8312.36, "text": "irgendwas ausdenken, ja, Create, alles klar, so, das will ich haben, jetzt geht man in die"}, {"id": 902, "start": 8312.36, "end": 8318.76, "text": "Connectos, jetzt müssen wir nämlich noch einstellen, den User für den MQTT Server,"}, {"id": 903, "start": 8318.76, "end": 8326.84, "text": "User, MQTT, Passwort, High IQ, 123456, save, so, und jetzt gehen wir in die Konsole und"}, {"id": 904, "start": 8326.84, "end": 8338.32, "text": "jetzt sollte die Connection auch funktionieren, Konsole, ja, das sieht gut aus, so, und jetzt"}, {"id": 905, "start": 8338.32, "end": 8341.8, "text": "ist das einzige, was wir machen müssen, also das muss man ja nur einmalig einstellen, das"}, {"id": 906, "start": 8341.8, "end": 8346.8, "text": "ist ja nicht pro Leiste, sondern einmalig für alle MQTT User, so, und jetzt ist das einzige,"}, {"id": 907, "start": 8346.8, "end": 8358.88, "text": "was man machen muss, wenn man eine Tasmota-Leiste hinzufügen will, ihr geht in Integrations,"}, {"id": 908, "start": 8358.88, "end": 8366.92, "text": "Add Integration, Tasmota, zack, achso, hab ich schon mal gemacht, hier, haben wir sogar"}, {"id": 909, "start": 8366.92, "end": 8373.56, "text": "schon konfiguriert, easy, haben wir sogar schon ein paar Mal angelegt, lull, so, und jetzt"}, {"id": 910, "start": 8373.56, "end": 8377.96, "text": "können wir mal gucken, ob es schon auftaucht, da ist sie, easy, ihr müsst nichts machen,"}, {"id": 911, "start": 8377.96, "end": 8383.2, "text": "ihr müsst, wenn ihr ab jetzt eine neue Steckdosen-Leiste mit Tasmota habt oder irgendein Tasmota-Gerät,"}, {"id": 912, "start": 8383.2, "end": 8388.4, "text": "ihr müsst einfach den MQTT Server eintragen und fertig, mehr müsst ihr nicht machen und"}, {"id": 913, "start": 8388.4, "end": 8392.28, "text": "schon habt ihr das gesamte Gerät im Home Assistant drin, guck, ihr könnt jetzt hier"}, {"id": 914, "start": 8392.28, "end": 8404.76, "text": "drüber die Leiste schalten, weiß nicht, ob man das sieht, also das war's, also ihr müsst"}, {"id": 915, "start": 8404.76, "end": 8408.8, "text": "jetzt bei einer neuen Leiste eigentlich gar nichts mehr machen, das ist super easy mittlerweile,"}, {"id": 916, "start": 8408.8, "end": 8412.6, "text": "früher war es ein bisschen komplizierter, ja guckt, ich kann jetzt über meinen Home"}, {"id": 917, "start": 8412.6, "end": 8418.76, "text": "Assistant den ganzen Kremplchon schalten, wie ich lustig bin, so, und dementsprechend"}, {"id": 918, "start": 8418.76, "end": 8423.44, "text": "kann ich auch einfach in mein Dashboard gehen und diesen ganzen Crap hier mal rausschmeißen,"}, {"id": 919, "start": 8423.44, "end": 8430.24, "text": "den keiner braucht, oder besser gesagt wir gehen hier hin, Wohnzimmer, so, Edit, schmeißen"}, {"id": 920, "start": 8430.24, "end": 8443.4, "text": "wir mal raus, Edit, Wohnzimmer USB, nein, Qt, Qtchat 1, wollen wir da jetzt haben, so,"}, {"id": 921, "start": 8443.4, "end": 8469.12, "text": "Name ist, was weiß ich, Keller, Pie, oh, und das ist hier keine Ahnung, USB, Ups, jetzt"}, {"id": 922, "start": 8469.12, "end": 8477.48, "text": "nehm ich eigentlich nur USB, USB, so, und das ist keine Ahnung, dann, was weiß ich,"}, {"id": 923, "start": 8477.48, "end": 8488.08, "text": "Keller, Kekl, so, und jetzt habt ihr die Knöppe, save, jetzt passt mal auf, zack, jetzt könnt"}, {"id": 924, "start": 8488.08, "end": 8496.08, "text": "ihr sie übers Dashboard steuern, und ihr müsst nix machen außer den MQTT Server ein, kann"}, {"id": 925, "start": 8496.08, "end": 8500.2, "text": "man die USB Ports einzeln ansteuern, nein, das funktioniert nicht, du kannst nur, guck"}, {"id": 926, "start": 8500.2, "end": 8506.32, "text": "jetzt hab ich USB ausgeschaltet, also das hier ist USB, du kannst nur USB auf einmal"}, {"id": 927, "start": 8506.32, "end": 8512.52, "text": "einschalten oder USB auf einmal ausschalten, das Schalten geht übrigens schnell, USB hat"}, {"id": 928, "start": 8512.52, "end": 8518.28, "text": "die Lampe leuchtet einfach nur danach, so, und jetzt könnt ihr euch euer Dashboard zusammen"}, {"id": 929, "start": 8518.28, "end": 8523.28, "text": "klicken wie ihr wollt mit euren Steckdosen leisten, und das funktioniert einfach, easy,"}, {"id": 930, "start": 8523.28, "end": 8530.16, "text": "und man hat die weitere Möglichkeit, wenn man das mal braucht, vielleicht weil die Heumautomatisierung"}, {"id": 931, "start": 8530.16, "end": 8534.52, "text": "nicht geht oder irgendwas ist, man kann immer noch übers Webinterface drauf und direkt im"}, {"id": 932, "start": 8534.52, "end": 8540.52, "text": "Webinterface das ganze machen, oder wenn gar nix hilft, man kann hingehen und den Schalter"}, {"id": 933, "start": 8540.52, "end": 8547.36, "text": "drücken, das geht natürlich auch noch, guck, Schalter einmal gedrückt, erstes, Schalter"}, {"id": 934, "start": 8547.36, "end": 8553.96, "text": "zweimal gedrückt, zweites, Schalter dreimal gedrückt, drittes, Schalter viermal gedrückt,"}, {"id": 935, "start": 8553.96, "end": 8562.4, "text": "viertes, äh, äh, fünfmal gedrückt, USB, eins, zwei, drei, vier, eins, zwei, drei,"}, {"id": 936, "start": 8562.4, "end": 8571.64, "text": "vier, vierter an, erster an, zweiter aus, dritter aus, geht auch, also kannst du übers"}, {"id": 937, "start": 8571.64, "end": 8576.96, "text": "Webinterface machen, kannst du über den Knopf machen und kannst jetzt auch über deine Heumautomatisierung"}, {"id": 938, "start": 8576.96, "end": 8581.12, "text": "machen und guck, dass ihr auch seht, wie schnell sich das überträgt, ich schalte jetzt mal"}, {"id": 939, "start": 8581.12, "end": 8589.08, "text": "hier an, ihr sehts hier oben, zack, und ist direkt an, habt ihr gesehen, guck, also das"}, {"id": 940, "start": 8589.08, "end": 8610.72, "text": "ist instant, paar Millisekunden, funktioniert, so, machen wir mal die VM wieder aus, weil"}, {"id": 941, "start": 8610.72, "end": 8620.96, "text": "brauchen wir ja nicht, war jetzt ja nur zum zeigen, shutdown, jawoll, shutdown, gibt es"}, {"id": 942, "start": 8620.96, "end": 8628.96, "text": "solche Steckdosenleisten noch zu kaufen, ja, und angeblich, angeblich gibt es die auch"}, {"id": 943, "start": 8628.96, "end": 8637.52, "text": "noch zu kaufen und die sind noch flashbar, 29 Euro für eine ist jetzt nicht billig,"}, {"id": 944, "start": 8637.52, "end": 8641.96, "text": "aber von den Features her, gerade geflasht, gibt es da eigentlich nicht so viel, was da"}, {"id": 945, "start": 8641.96, "end": 8650.84, "text": "rankommt, es ist aber halt nix, was in Deutschland hergestellt wird, es ist halt China Ding, und"}, {"id": 946, "start": 8650.84, "end": 8656.92, "text": "angeblich sind die hier noch flashbar, normalerweise hätte ich ja gesagt, ich kaufe mir den Kram"}, {"id": 947, "start": 8656.92, "end": 8665.24, "text": "über AliExpress, dann kriege ich für den Preis vielleicht zwei oder drei, aber da weiß"}, {"id": 948, "start": 8665.24, "end": 8669.8, "text": "man nicht, ob die flashbar sind, weil aktuell sind die ganzen Trio Geräte meistens nicht"}, {"id": 949, "start": 8669.8, "end": 8674.36, "text": "mehr over the air flashbar, oder aber gar nicht mehr flashbar, weil komplett anderer"}, {"id": 950, "start": 8674.36, "end": 8680.96, "text": "Chip drin ist, das ist WLAN, richtig, du hast die Alternative, es gibt noch ein paar ZigBee"}, {"id": 951, "start": 8680.96, "end": 8688.6, "text": "Leisten, beim Lidl zum Beispiel, da brauchst du das Flaschen gar nicht, weil ZigBee ist"}, {"id": 952, "start": 8688.6, "end": 8692.64, "text": "ja schon darauf ausgelegt sinnvoll angesteuert zu werden, allerdings können die da natürlich"}, {"id": 953, "start": 8692.64, "end": 8700.76, "text": "auch nicht so viel wie TAS Motor mit der ganzen jahrelangen Entwicklung, aber das meiste macht"}, {"id": 954, "start": 8700.76, "end": 8706.68, "text": "man eh über seinen Smart Home und nicht direkt über die Steckdosenleiste, übrigens wisst"}, {"id": 955, "start": 8706.68, "end": 8715.68, "text": "ihr warum die jetzt blinkt, weil sie die Verbindung verloren hat zum MQTT Server, naja, weil"}, {"id": 956, "start": 8715.68, "end": 8724.48, "text": "ich die VM mit dem MQTT Server gerade ausgeschaltet habe, aber von Handschalten, seht ihr, funktioniert"}, {"id": 957, "start": 8724.48, "end": 8743.32, "text": "immer noch, yep, so siehts aus Leute, Flashchamp am Start gewesen heute wieder,"}, {"id": 958, "start": 8743.32, "end": 8753.92, "text": "ich meine, es wäre natürlich, guck mal, du hast unterschiedliche Farben, den Sinn"}, {"id": 959, "start": 8753.92, "end": 8759.56, "text": "habe, verstehe ich nicht so genau ehrlich gesagt, was da der Twitch Chat mir damit sagen"}, {"id": 960, "start": 8759.56, "end": 8773.6, "text": "will, aber ok, was wollte ich gerade sagen, keine Ahnung, Boomer Hirn habe ich vergessen,"}, {"id": 961, "start": 8773.6, "end": 8785.28, "text": "ne, nicht verbunden, du brauchst Tuya Convert und das Flash die Steckdosenleiste übers W-Lan,"}, {"id": 962, "start": 8785.28, "end": 8793.04, "text": "deswegen geht das auch nur mit welchen, die noch alt genug Factory Firmware drauf haben,"}, {"id": 963, "start": 8793.04, "end": 8804.72, "text": "weil die neueren haben das gepatcht oder haben eben einen anderen Chip, funktioniert, ja,"}, {"id": 964, "start": 8804.72, "end": 8811.88, "text": "alles funktioniert, auch Einbindung in Home Assistant funktioniert, alles gut, kann man"}, {"id": 965, "start": 8811.88, "end": 8827.16, "text": "den Raspberry Pi ausmachen, den Switch ausmachen, den Pi ausmachen, alles gut, exellent, so"}, {"id": 966, "start": 8827.16, "end": 8835.2, "text": "Chat, gibt es noch irgendwelche Questions, weil nochmal zwei Flaschen will ich jetzt"}, {"id": 967, "start": 8835.2, "end": 8847.52, "text": "nicht, das ist auch irgendwie nicht so spannend, nochmal den gleichen Krempel zweimal, es"}, {"id": 968, "start": 8847.52, "end": 8853.72, "text": "halt die Sache, man kann sich nicht darauf verlassen, dass die Flashbar sind, aber ganz"}, {"id": 969, "start": 8853.72, "end": 8859.44, "text": "im Ernst, ihr könnt es probieren und wenn es nicht geht, dann schickt ihr die einfach"}, {"id": 970, "start": 8859.44, "end": 8868.96, "text": "zurück, macht ihr einfach den Insie Modus, aktiviert ihr bei Amazon und sagt, ich schick"}, {"id": 971, "start": 8868.96, "end": 8879.4, "text": "das zurück, da merken die ja nichts von, dass ihr die versucht habt zu Flashen, das"}, {"id": 972, "start": 8879.4, "end": 8886.4, "text": "ist ja komplett nicht feststellbar, vor allem halt auch wenn es nicht funktioniert hat,"}, {"id": 973, "start": 8886.4, "end": 8892.36, "text": "behaltet ihr sie und wenn es nicht funktioniert hat, schickt ihr sie halt zurück, ich meine,"}, {"id": 974, "start": 8892.36, "end": 8895.36, "text": "ich will es jetzt nicht promoten, wir dürfen den immer nicht vergessen, wir sind auf einer"}, {"id": 975, "start": 8895.36, "end": 8908.08, "text": "Amazon Plattform unterwegs, ja, also sollte ihr natürlich nicht machen, Chat, ganz böse,"}, {"id": 976, "start": 8908.08, "end": 8912.76, "text": "also kaputt würde ich die Dinger nicht zurückschicken, also wenn ihr die kaputt macht, Amazon ist"}, {"id": 977, "start": 8912.76, "end": 8917.76, "text": "meistens sehr kulant und nimmt die Dinger sogar in teilweise echt fragwürdigem Zustand"}, {"id": 978, "start": 8917.76, "end": 8922.76, "text": "entgegen, aber ja, das würde ich da nicht machen, ich meine, wenn man das Ding wirklich"}, {"id": 979, "start": 8922.76, "end": 8928.16, "text": "zerstört hat oder selbst kaputt gemacht hat, natürlich könnte man dann immer erzählen"}, {"id": 980, "start": 8928.16, "end": 8933.92, "text": "so nach dem Motto, es ging kaputt beim ersten Anschließen und wenn euer Amazon Konto nicht"}, {"id": 981, "start": 8933.92, "end": 8943.12, "text": "oft Reklamationen hat, dann machen die das dann wahrscheinlich auch, aber irgendwie ist"}, {"id": 982, "start": 8943.12, "end": 8956.12, "text": "es trotzdem ein bisschen fragwürdig, wat, dann das hier, ich hab gerade eine Mail von"}, {"id": 983, "start": 8956.12, "end": 8967.2, "text": "OnlyFans bekommen, das ist bestimmt Scam, China-Chinesen, Indischer Scam wahrscheinlich,"}, {"id": 984, "start": 8967.2, "end": 8981.44, "text": "OnlyFans, Gachibas, Gachirole, genau, ne, nicht aber abgelaufen, irgendwelche Empfehlungen"}, {"id": 985, "start": 8981.44, "end": 8987.48, "text": "oder so, keine Ahnung, wahrscheinlich diesen Camgirls musst du folgen hier, gib Geld aus"}, {"id": 986, "start": 8987.48, "end": 9000.56, "text": "bei uns, ich hab keine OnlyFans Abos, sexy Devops Content, Abos, ne ne ne ne, wenn schon"}, {"id": 987, "start": 9000.56, "end": 9006.72, "text": "dann Indie Fox, wobei gibt's die überhaupt noch, ich will jetzt nicht nachgucken, ich"}, {"id": 988, "start": 9006.72, "end": 9020.6, "text": "will jetzt nicht nachgucken im Stream, ne ganz ehrlich, OnlyFans ist Geldverschwendung,"}, {"id": 989, "start": 9020.6, "end": 9026.36, "text": "wenn man sich diesen Content wirklich angucken will, dann gibt es genug alternative Möglichkeiten"}, {"id": 990, "start": 9026.36, "end": 9033.24, "text": "da dran zu kommen, jetzt könnte natürlich jemand sagen, ja aber ich möchte die Creators"}, {"id": 991, "start": 9033.24, "end": 9039.04, "text": "unterstützen, kann ich nix dagegen sagen, ich leb ja letztendlich zum Teil auch davon,"}, {"id": 992, "start": 9039.04, "end": 9068.64, "text": "dann macht, ja, Twitch, Mason, Dankeschön für den Sub, das klick ich jetzt nicht an,"}, {"id": 993, "start": 9068.64, "end": 9091.48, "text": "das werd ich definitiv nicht anklicken, selbst wenn du sagst save for work, ich seh, ich"}, {"id": 994, "start": 9091.48, "end": 9099.12, "text": "seh, da gehts um Lüfter, ich hab's gesehen, da gehts um Lüfter, um Ventilatoren gehts"}, {"id": 995, "start": 9099.12, "end": 9107.16, "text": "da, das ist natürlich gut, dass sie das Subreddit so gesnackt haben, so einkassiert haben und"}, {"id": 996, "start": 9107.16, "end": 9115.88, "text": "dass das jetzt nicht wirklich OnlyFans ist, sondern wirklich OnlyFans, also Fans so, Lüfter"}, {"id": 997, "start": 9115.88, "end": 9126.72, "text": "halt, huge Fan, ja gibt es auch irgendwas spannendes, ansonsten würd ich jetzt aufgehen"}, {"id": 998, "start": 9126.72, "end": 9131.4, "text": "und mir noch irgendwie, keine Ahnung, Amazon irgendwie ne Serienfolge oder so angucken,"}, {"id": 999, "start": 9131.4, "end": 9161.2, "text": "oh ein Sarix, kennst du das, ne, sagt mir nix, ach doch, das ist Müll, das hab ich"}, {"id": 1000, "start": 9161.2, "end": 9169.16, "text": "mir angeschaut, das ist Müll, das ist diese Linux-Distro für, diese Linux-Distro für"}, {"id": 1001, "start": 9169.16, "end": 9179.08, "text": "Bitcoin Miner, die in den Remotes, ungefragten in Remote-VPN aufhacken auf deine Linux-Maschine,"}, {"id": 1002, "start": 9179.08, "end": 9192.4, "text": "ja, ja, ne, ne, das ist so komisch, kommt mir nicht ins Haus, ja, such mal danach, wenn"}, {"id": 1003, "start": 9192.4, "end": 9217.4, "text": "ich glaubst, ja, Remotely Access, das ist standardmäßig offen, ja, zwar mit ner random"}, {"id": 1004, "start": 9217.4, "end": 9232.12, "text": "generated-Ul, die keiner erraten kann, aber ich will sowas nicht standardmäßig haben,"}, {"id": 1005, "start": 9232.12, "end": 9246.16, "text": "ich würde sagen C-Sharp und ist immer noch meine Lieblingsprogrammiersprache, tja, würd"}, {"id": 1006, "start": 9246.16, "end": 9253.04, "text": "ich mir mal Gedanken machen, ich hab dich nicht gesehen, du hast überhaupt nix geschrieben"}, {"id": 1007, "start": 9253.04, "end": 9264.4, "text": "weiter oben, wie gesagt, ich hab nicht groß jetzt die wahnsinns Bewerbungsschreibaktion"}, {"id": 1008, "start": 9264.4, "end": 9270.92, "text": "gemacht, ich hatte ein Vorstellungsgespräch, eins hab ich noch und ein Probearbeitstag"}, {"id": 1009, "start": 9270.92, "end": 9278.6, "text": "demnächst, ansonsten erstmal nix, mal gucken, 2023 wird das Jahr des Linux-Desktops, ja"}, {"id": 1010, "start": 9278.6, "end": 9293.6, "text": "vielleicht in WSL, alles klar Leute, gut, also, wenn es dann sonst nix mehr gibt, dann,"}, {"id": 1011, "start": 9293.6, "end": 9302.6, "text": "nein, kennste, muss ich das nochmal anmachen, das hab ich schon ausgemacht, jetzt muss ich"}, {"id": 1012, "start": 9302.6, "end": 9321.84, "text": "es nochmal anmachen, ist mein VM jetzt abgekackt oder was, mach meine VM hier, VM, VM, was"}, {"id": 1013, "start": 9321.84, "end": 9331.04, "text": "ist, ah, ok, alles klar, VM macht Betge, ja, so siehts aus, VM hat sich wohl auf SSD"}, {"id": 1014, "start": 9331.04, "end": 9341.64, "text": "geschrieben, gerade 16GB, du bist drin, ok, wie hast du das gemacht, beim ausgeschaltet"}, {"id": 1015, "start": 9341.64, "end": 9346.32, "text": "drin zu sein, aber, gut, ich mein, der Chat da kann das, er kann auch ausgeschaltete Rechner"}, {"id": 1016, "start": 9346.32, "end": 9348.56, "text": "hacken, das ist überhaupt kein Ding, der Chat macht das easy."}, {"id": 1017, "start": 9348.56, "end": 9371.52, "text": "Easy, macht er das, easy, gut, dann sehen wir uns im nächsten Stream, Leute, ich hoffe,"}, {"id": 1018, "start": 9371.52, "end": 9380.54, "text": "euch hat's gefallen, bis denn, macht's gut, see you."}]}