{"text": "Das war's für heute. Ich hoffe, es hat euch gefallen. Wenn ihr mehr von uns sehen wollt, dann abonniert unsere Kanal und lasst ein Like da. Dann sehen wir uns in der nächsten Folge. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch herkes gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen. Dass ich plus anstatt semine zum konto habe das liegt im prinzip daran weil ich mehr rein bekomme als ausgebe Kackel kackel ist das beste Wobei das allerbeste das muss ich vielleicht noch noch mal in titel schreiben Wobei näh lasse ich der titel ist einfach nur enden weil man nichts anderes eingefallen ist 0w ist immer noch das allerbeste nein nein nein 0w ist das einzig wahre sehe ich auch so also 0w größer kackel größer kacke 0w ist eindeutig das beste Normales lull ist auch ok aber 0w oder lull w wie das die amis sagen Ist das ist das beste nach emote und das beste video dazu ist ja immer noch Noch wir gucken uns das jetzt nicht an wir gucken uns jetzt nicht an wir gucken uns so ich lasse Kurze nur mal kurz das intro laufen als erstes intro ist pock Doch was habe ich den noch auf So leicht Ne aber ich habe es auf guck hier das gucken wir uns gleich zusammen an Gucken wir uns gucken wir uns gleich an ich habe es noch nicht gesehen Ich habe es aber schon aufgemacht weil ich mir gedacht habe so wie ich euch kenne Also ich habe den post gesehen von denen eine minute nachdem er raus war habe ich mir dazu mich euch kenne Wollt ihr wahrscheinlich das für uns das heute zusammen angucken bäm auf geht's was das es leckt Wo da vorn was da los? Wow Wo da vorn Probe fahrt ja ich bin heute probe gefahren ich habe es hat mir wirklich gut gefallen Sowohl die die ausstattung wobei das jetzt gar kein maximal ausgestatteter fiat war sondern Ist aber so relativ normal plus ein bisschen schnick schnack einfach wahrscheinlich dass es mehr her macht jetzt ist jetzt ist gut Also für alle die nicht dabei waren ich kann es euch ja noch mal zeigen ich habe ihn glaube ich irgendwie noch also Falls ich frage von was von was ich laber Also aktuell habe ich folgendes auto. Nee kein tesla Soll ich mir ein tesla kauen alter ich meine die dinger sind schon teuer genug und so wenig wie ich fahre bräuchte ich normalerweise gar kein elektroauto, aber ich dachte mir so ja irgendwie spricht mich das an aber auf der anderen seite also 50 60 k und noch mehr will ich dafür ganz bestimmt nicht ausgeben So also aktuell habe ich ja dieses wahnsinnsauto hier in grün also exakt so wie ihr ihn hier seht Was kostet so was eigentlich gebraucht aktuell? und kurz gucken was Nein ach das ist der neue dass es meinen gibt es überhaupt nicht mehr gebraucht doch hier Style paket ich wusste gar nicht dass dieses auto jemals ein style paket hat Weil wir nicht bekannt dass das ein style paket haben kann was hat das irgendwie style schon fällt oder was Also immerhin immerhin könnte ich hey vielleicht könnte ich vielleicht könnte ich meinen agila das jetzt fast genauso aus wie der Vielleicht könnte ich dir noch für 1000 euro raushauen oder so ich meine aktuell verkauft sich ja alles anscheinend Sieht aus wie das auto von mr. Bean nähe mr. Bean hatte in mini glaube ich So wenn es aktuell habe ich dieses teil hier, aber er hat ein bisschen war es aktuell dieses teil und Probe gefahren bin ich heute Den konfigurator aufmachen der ist kaputt Und ich habe hier ein bisschen was zu tun, aber ich habe hier ein bisschen was zu tun An den konfigurator aufmachen der ist kaputt aktuell war fiat auf der homepage mal gucken ob er hier geht Konfigurator ist immer noch kaputt Kekkel ich habe übrigens raus gemacht ich weiß übrigens über den fiat konfigurator fixt Man muss einfach hinten das weg machen und das nur konfigurator da steht und dann kriegt man die auto auswahl und dann funktioniert es Und es liegt auch nicht am dark reader So proben gefahren bin ich heute das Das ding la prima Muss halt sagen Ich meine das kostet im ende nicht ja aber Billig ist was anderes Dafür kriegst du schon ein ziemlich geiles nicht elektroauto wenn ich das dieses jahr noch bekomme Und die förderung runter geht es gibt ja 9.000 euro 9.350 oder so Förderung Dann Ich habe auch nichts dazu ja farbe farbe ist das einzige farbe würde ich vielleicht wieder wieder wieder Grau oder oder grün oder so so was vielleicht vielleicht vielleicht ja So aber Ne das das das ist mir ich habe ja nichts gegen weibliche autos ich meine viele sagen ja das ist ein frauenauto ja aber Die farbe ist mir dann doch irgendwie nix So zumindest ne das ist das falsche hier Warte mal habe ich das richtige Ja ja ich habe das ich habe das richtige Weil ich jetzt ist hier ist das technikpaket schon drin das ist das war ich meine so also den bin ich heute den bin ich heute probe gefahren ganz im ernst also so viel gebe ich dafür nicht aus aber Du kannst ja wenn du den dieses jahr noch bekommst kannst du mal 9.000 euro abziehen Dann ist so und das ist immer noch verdammt viel geld also wenn ihr das mal vergleicht was ihr für Einen nicht elektroauto für ein richtig geiles nicht elektroauto bekommt für 32.000 euro das ist schon was wobei die ausstattung von dem ding wirklich ganz okay ist Gut und in der form ich bräuchte den eigentlich ganz ehrlich ich brauche keine special coolen felgen oder so Und ich brauche garantiert auch keine getönten heckscheiben und solch die geschichten also in das ist vollkommen in ordnung So und ich muss jetzt mit denen mal muss jetzt mit denen noch mal irgendwie reden Was man da was man da noch machen kann Weil was jetzt los Jetzt kaputt gegangen oder wie weil ganz ehrlich selbst wenn ich da selbst wenn ich da 9.000 euro abziehe also unter 30.000 euro also ich wollte nicht über 30.000 euro ausgeben Warum überhaupt in vier an der honda e ist auch nice da bin ich auch um überlegen ob ich also ich habe noch ein paar andere Autos in der aus in der auswahl also honda e finde ich würde ich auch noch mal gerne ausprobieren bevor ich den kauf Einen reno soy wollte ich noch mal ausprobieren und einen vw ii ab Und es gab noch ein viertes Und fünftes Wann das das hab ich Die sind alle die sind alle nicht lieferbar die sind die sind alle nicht lieferbar Die sind alle die sind alle nicht lieferbar die sind die sind alle nicht lieferbar Die kann das ja das problem die sind alle nicht lieferbar So warum den fiat na ja weil ich ein kleines auto für die stadt haben will Und der fiat hat mehr oder weniger Passt eins zu eins die gleichen abmaße wie mein aktueller Tja und ich bin mal gespannt ob das klappt Also in dem auto haus haben sie mir heute erzählt die haben wohl eine ganze menge bestellt halt Nicht exakt in der config die ich haben will Also klar wäre auch da habe ich denen gesagt also farbe ist mir jetzt nicht so wichtig Außer vielleicht rosé muss nicht sein Mal gucken mal gucken ob das klappt also ich ich werde so machen ich ich werde so machen also Es muss auch nicht die la prima variante sein ja es könnte auch die die kleinere sein also ich werde so machen Sollte es dieses jahr noch die möglichkeit geben Ein zu bekommen mit der vollen prämie Und wenn man vielleicht irgendwie noch ein bisschen was rabattechnisch ausmachen kann so dass ich unter 30.000 euro komme das ist eigentlich so dass Das limit was ich mir gesetzt habe wo ich nicht mehr ausgeben will Grad für meinen rum gefahrer was ich ja war ja so gut wie nie und Dann mache ich das Sollte das nicht hinhauen dann lasse ich es bleiben Sollte das nicht hinhauen dann lasse ich es bleiben Machst du ein mein neues auto videos soll ich chat was sagt ihr und wenn wir machen um frage um frage Das ist das ist wenn du dir überlegst was für 30.000 euro schon für poc autos kriegst gerade auch gebrauchte warum nicht also Ja ich habe den gefragt wie es denn aus mit vorführe autos mal gucken was da rauskommt Soll ich ein mein neues auto video machen Wir waren jetzt mal um frage Zusätzliche abstimmungen zulassen mit keksen einfach weil es geht Da wusste ich kann die leute mal ihre ihre ihre keksen loswerden Moin danke für die subs leute hier Ploggi massive subscription hier nice Ich habe hier die leute Ich habe hier die leute Ich habe hier die leute Ich habe hier die leute Ich habe die leute Ich habe die leute Also ganz im ernst ich mache mir nicht die illusion dass ich er wahnsinnig geld sparen würde erstens ich fahre nicht viel Aber irgendwie ich Ich meine ich lache ich lache ja dann normalerweise immer drüber ja wenn die leute anfangen ja auto hat ja auch ein bisschen was mit Gefühl und sonst was zu tun was mit gefühl und sonst was zu tun letztendlich ich bin kein autofan ja also ist nicht so dass ich mich weder weder gut auskenne mit autos noch dass irgendwie autos jetzt so mein herz höher schlagen lassen oder wenn ich wie es gibt kein denn es nicht will na gut und das wollte ich jetzt sagen aber ja genau zwar ich will was ich sagen wollte aber insofern kann ich nachvollziehen mir spricht halt einfach ein elektroauto gerade halt auch mit so einer modernen ausstattung ich meine das ist wirklich cool das ding hat hat eine erkennung drinne von wenn vielleicht ist das schon alt aber für mich ist das neue das hat eine erkennung drinne was für straßenschilder sind und zeigt dir das an wie schnell du fahren darfst das hat eine kamera wenn du wenn du einparken willst dass du gucken kannst wie weit du vom gehweg weg bist und so was das gibt es wahrscheinlich alle schon ja ist halt ist halt vielleicht schon seit zehn jahren drinne ja aber für mich ist es neu ich meine meiner hat es halt nicht meiner hat nix ja ich bin mal gespannt ich bin gespannt ob es dieses jahr noch was wird wenn es dieses jahr noch was wird dann mache ich also dieses jahr und unter 30.000 euro dann mache ich das ansonsten lasse ich bleiben ich habe mir noch gar nichts geholt ich war probefahren ein ich war das hier probefahren das hier war ich probefahren das hier die sind auch richtig da ist es war wirklich cool aber halt der preis ist krass selbst mit prämie prämie kann es halt noch mal 9.000 euro abziehen aber trotzdem ich will unter 30.000 euro also wenn es über 30.000 euro kostet am ende mache ich das nicht gucken wir noch mal was ein prämie kann man auch mal abziehen günstig günstiger gibt es gibt es ein paar aber im prinzip nehmen sich die in diesem segment alle nicht so viel nicht so viel also ich ich fand es gut auch das mit der tür ich weiß die meisten sagen das ist nur was für die medals aber ich finde auch diese diese hintertür zum einladen wirklich praktisch was wenn du das hier holt holt ihr auch das hier ab was ist das die fahrende netto ab was soll das sein sieht aus wie eine scam seite ist es gern sieht aus wie scam ich habe keine ahnung was es ist prämie sichern keck weit was was wollen die von mir was ist das überhaupt ok ich habe kein ich schreibe chat ich schreibe sie mal auf ich habe keine ahnung was die eigentlich genau vor mir wollen ok da sind die china chinesen hinter ja genau also wisst ihr ich sage jetzt noch mal eine sache dazu also wie gesagt ich bin ich bin absoluter autonoob und wie gesagt mein aktuelles auto ich zeige euch das war von innen oder wie nennt man das cockpit wie nennt man das eigentlich vorne ja so ziemlich genau das bei mir aus also das ist halt mal zum fall das ist für mich komplett neue welt ja boss cockpit ja also so so das aktuell aus also hier ist nichts digital wirklich gar nichts was witzig ist ich habe auch noch grüne sitze das ist könnte ja fast mein auto sein wahrscheinlich sind die grünen agila doch grüne sitze gut also ich habe gesagt es ist wirklich exakt genauso aus bei mir bei mir geht der tacho aber nicht bis 200 so weit geht meiner definitiv nicht 200 in dem ding alter bei 120 denkst du das ding fällt gleich um von alleine 200 ich stelle die sich das vor gut wahrscheinlich ist das der standard tacho in allen möglichen autos von den gewesen ist das kann ich euch aus erster hand mit dem ding wird zu keine 200 fahr ich ich bin selten im hinteren drittel hier überhaupt so zumindest so sieht aktuell mein auto aus wenn ich drinne setze und so sieht dann das neue aus wenn ich drinne setze aber muss halt sagen für mich war das wirklich komplett neue welt erstens das zum klima anlage im auto hast klima anlage im auto ist für mich so ein ding was ich im hinterkopf habe noch das haben nur so angeber fette riesen angeber autokisten oder so ist aber gar nicht mehr so anscheinend ist das mittlerweile relativ normal also klimaanlage heizung logisch klimaanlage durch ja unten hast du so eine ladeschale fürs smartphone wie so ein neues auto geht das alte kaputt ja ja das hatte die das hatte die letzten als dieses jahr hat es jede menge probleme schon letztens ist das komplette kühlmittel ausgelaufen alles weil der schlauch kaputt war und das war auch der anlass dass ich gesagt habe ok max ich glaube es wird so langsam aber sicherzeit ich kann es jetzt noch mit dem aktuellen überbrücken aber lange macht das nicht mehr welcher motor wie von dem da da gibt es nur ein ich habe ein auto ohne klima alter mein auto ist das immer an mein auto ist von von 2001 baujahr quattrix mit klimaanlage das weiß ich nicht keine ahnung es ist auf jeden fall also eins kann ich dir sagen den agila gab es wohl mal ursprünglich mit zwei verschiedenen motoren und das der hat den kleineren der hat den kleineren also der also mein agila braucht von 0 auf 100 keine ahnung 15 sekunden oder so das ist wirklich nicht schnell das teil ja 2000 gab es aber noch nicht in 0815 autos in so kleinen autos klimaanlagen also 2000 also als ich mir das auto gekauft hat war klima alle klima das da unten was das das habe ich nicht das habe ich nichts gibt es bei mir nicht das so ein spezial radio ich habe nur billig ich habe nur so ganz ganz billig radio und auch kein cd play also habe ich alles nicht so also was sowas ist für mich super luxus gewesen zumindest das ding hat klimaanlage und also was ich was ich persönlich ganz cool finde ist du hast usb anschlüsse du hast ladeschale und habe ich heute konnte ich heute auch gleich mal ausprobieren du hast smartphone unterstützung wobei ich gucken muss wie gut das wie gut das funktioniert ja da kannst du auf smartphone reifendruck gucken und und schauen anrufe an dem freisprecheranlage habe ich heute mal alles ausprobiert muss ich sagen hat ganz gut funktioniert die app bin ich mir unschlüssig wie geil die ist wenn du kannst mit der app dein auto auf und zu machen und gucken wie voll die batterie ist und sowas wobei ich mir ehrlich gesagt ich weiß nicht vom handy das auto auf und zu machen das ist irgendwas das wieder strebt mir noch ein bisschen dass das geht ja du kannst das auto vorheizen im winter oder die klimaanlage anmachen vom handy aus ja was ich nicht ganz verstehe ist wie die verbindung mit dem auto funktioniert das wusste der händler lustigerweise auch nicht zumindest es kann kein bluetooth sein weil die verbindung also die reichweite ist viel zu groß da ist eine sim karte da ist so eine da ist so eine iot sim karte drin oder sowas achso das auto hat eine permanente internet verbindung achso macht mein auto dann auch macht mein auto dann auch einfach einfach firmware updates und ich muss nicht im ran fahren so nach dem motto falls jetzt können sie 15 minuten nicht fahren firmen update in gange das wäre jetzt nämlich naja gut das ist ja wahrscheinlich optional dass man diese sachen mit verbindung und so macht das werde ich wahrscheinlich keine ahnung ob ich das mache auf jeden fall custom firmen flaschen ja das auf jeden fall die klimatisierung wird mit einer dezentralen blockchain gelacht so ist das ja die reife werden geht committed gibt es jetzt muss ich jetzt muss ich gerade mal gucken fiat home assistant gibt seine integration aha guckte mal da was da los anscheinend nicht gibt es anscheinend keine leute keine kein home keine home assistant integration dies bettmann github keine home assistant uconnect yeses uconnect home assistant anscheinend gibt so was nicht aber ganz ehrlich ganz ehrlich geht das geht das mit home bridge oder man kann das vielleicht um um tricks mit trick 17 machen mit irgendwie über home bridge oder so scheiß drauf wurscht ich will mich jetzt auch nicht weiter über meinen autokauf auslassen zumindest wenn es dieses jahr klappt und ich das unter 30.000 euro bekomme mit prämie was ja durchaus im bereich des möglichen ist denke ich mal das bekommen ist eher das problem dann mache ich das ansonsten lasse ich bleiben so aber wie gesagt hier also es ich fand es halt mega nice für jemand der so ein altes billigauto hat mal in was modernem zu setzen es hat mir auch wirklich gefallen navigationsgerät habe ich nur kurz ausprobiert ja gut ist halt auch gut dass das alles im handy verbinden kannst rein digitale anzeige über display finde ich auch gut nicht mehr irgendwelche komischen was ich hier gut finde ist dass sie auch die meisten sachen noch per knöpfe haben ja also hier kann so umschalten zwischen parken und fahren und rückwärts und so was hier kannst du handbremse machen was was ich persönlich auch cool fand was ich persönlich auch cool fand was ich halt auch so noch nicht kannte du kannst den betriebsmodus hier neben umstellen und da kannst du nur mit dem gaspedal fahren also wenn du vom gaspedal gehst dann bremst er automatisch womit er ein bisschen die batterie auflädt was jetzt nicht so der wahnsinn ist aber das cool ist du kannst theoretisch mit nur einem fuß fahren das finde ich ganz nice ob man es am endeffekt verwendet keine ahnung aber ich finde es ich fand es ich fand es nicht schlecht dass du dann quasi mit nur mit einem fuß und einem pedal das war ganz ja carplay android gedöns ist da auch mit am start ja hier hast du freisprech ein anleit die habe ich heute auch mal ausprobiert und ansonsten ja mal gucken alles klar also den tripmode ausprobiert ja ganz bestimmt da bin ich der richtige für seito dankeschön für den sub 20 jahre ja 50 billionen jahre ich habe ein auto tatsächlich schon 20 jahre ich weiß es meinst du nicht mit 20 jahren aber also ich habe das auto nicht das auto ist 20 jahre alt was ich habe die hat also ich weiß nicht ob er k play hat ich kann dir das nicht sagen er hat zumindest das zeug wo man sein sein ich weiß es k-play das von ios wenn k-play das von ios ist dann hat er das weil das geht man kann sein iphone verbinden ja der preis ist ist finde ich tatsächlich ganz okay halt nur wenn es komplette prämie gibt und wenn man vielleicht noch ein bisschen noch ein paar sachen aushandeln kann ich brauche in den satz neuer reifen wobei das können die mir eigentlich wahrscheinlich gleich drauf machen weil ich habe so als weg wie heißt das jetzt das als weg reifen allwetter reifen so rum nicht als weg reifen also ich wechsel so ich wechsel keine also was heißt ich selbst ähnlich nicht ich habe auch kein bock das wechseln zu lassen alle halbes jahr ja und wenn ich allwetter reifen drauf hat muss ich gar keine wartung machen dann kann ich das einfach verwenden also mein außerhalb ist was kaputt ja dann kann dann ist einfach da nächste wird sein wenn das mit dem kauf vom elektroauto klappt also wenn das hier wirklich funst dann muss ich noch beim elektriker gucken dass ich mir in hof so ist so eine auflade box wall box setzen lasse mitte sommer und winter reifen die reifen sind so wichtig warum warum warum denke also ich bin faul warum soll warum sollte ich zweimal im jahr in die werkstatt fahren mit dem kram drauf machen lassen warum nicht also habe ich aktuell auch wo ist das problem warum ich mein außer dass sie sagt dass ich rott warum ist das schrott ich wechsle doch nicht meine reifen selbst sichere soll er sicherer sein jetzt nicht nur dass ich bei uns hier irgendwie durch den schnee fahren würde oder so ja denke ich auch ich glaube also ich habe aktuell allwetter reifen ja und mein agila hat genug kripp korrekt so sieht es aus so gut aber genug genug zum thema auto ich werde euch schon erzählen wenn ich den kram bestellt habe beziehungsweise wenn ich dann hab wir gucken uns jetzt mal an was die jungs und medels bei dais rausgebracht haben oder rausbringen werden wahrscheinlich jetzt mit season 3 und was da noch so kommt ich habe keine ahnung wir gucken uns das an das video ist 6 ok kann nicht so viel sein 6 20 also wenn ihr wirklich was zu zeigen hätten wir das video bestimmt eine viertel stunde lang schauen wir mal also ich ich ich predikte ich ich predikte mal ein paar sachen und zwar sie werden sich wahrscheinlich sie werden wahrscheinlich sie sind drei zeigen oder bis sie ein bisschen sie sind drei teasern weil ich mein sie sind drei soll ja immerhin schon naja in zwei wochen oder so starten sie werden wahrscheinlich ein bisschen sie sind drei teasern sie werden wahrscheinlich map reworks zeigen gehe ich mal von aus weil map reworks haben sie angekündigt da können sie jetzt nicht einfach sagen ja ist nix vielleicht schaffen wir es ja leute vielleicht schaffen wir es ja dass bis zum ende des jahres die hälfte der release maps release status hat wo ist das chat overlay stimmt wo ist das chat overlay wo ist die katze wait a minute warum ist die weg warum war die weg ach weil ich noch leute ich kann euch sagen warum die weg war ich bin weil ich das video hier aufgenommen habe ich habe doch nach dem stream gestern für youtube hier noch aufgenommen und da habe ich das ganze auf alle zeug ausgeschaltet ich habe vergessen wieder einzuschalten so was aber jetzt haben wir die kats jetzt alles gut schieben wir immer noch hast auf bettel viel fünf ich muss sagen ich bin mit bettel viel fünf nie großartig warm geworden aber ja manche sachen weiß man vielleicht erst zu schätzen wenn man sieht wie schlimm es in zukunft wird und nachdem wir mittlerweile wissen wie eklig bettel viel 20 42 geworden ist wahrscheinlich ist bettel viel fünf dann ja gar nicht mal so schlimm so auf geht's leise oder ja ja ja tatsächlich ich habe season 1 0 hour enjoyed für ja so 2 bis 3 tage und vodafone vodafone mein mensch was ist jetzt schon wieder los chat is lack ne vodafone mach machst du faxen was ist hier los droppt frames monka es monka w es kann nicht alles ok sein das ist jetzt nur ok weil standbild ist mein gott vodafone kriegt mal euren scheiß auf die reihe alter das kann doch nicht sein was ist hier 25 28 prozent frame drops wir müssen kurz warten leute wir müssen kurz warten bis das vorbei ist sonst kann ich das sonst kann ich das sonst kann ich das gar nicht ja dann müssen wir das ganze kurz überbrücken bis es wieder funktioniert gibt es irgendwelche anderen spannenden themen die wir noch schnell besprechen können bis der camp wieder funktioniert monka w ok also chat sagt was das schlimmste was man am anfang mit einem elektroauto was das schlimmste was am anfang hat das schlimmste was man am anfang hat mit einem elektro ist die reichweitenangst aber die geht nö habe ich nicht habe ich nicht ich weiß dass ich nicht weit fahr ich bin mir da ziemlich sicher dass ich überall ankomme wo ich hin will wenn ich mal 100 kilometer fahre das kommt eins zweimal im jahr vielleicht vor alter vodafone komm an was ist denn hier los guckt euch an bestem beste programmier sprache für micro service ist das tatsächlich eine gute frage der sache können wir uns kurz widmen bis vodafone ich hoffe ihr hört mich noch leckfrei ja ich sehe es schon mein mauszeiger ist nicht ganz leckfrei ich hoffe ihr hört mich noch leckfrei wenn es ein bisschen baffert und bis die frames alle wieder in ordnung sind ok ich sag noch was zu also beste programmier sprache für micro service ist natürlich ist das wie in vielen fällen dass die einzig beste sprache gibt es natürlich nett logisch das hängt davon ab was du machen willst und was du kannst also wenn du jetzt sagen wir mal ok was du kannst vielleicht nicht weil kannst du nur cobalt ist cobalt vielleicht keine so gute idee aber es ist eine kombination aus was kannst du gut beziehungsweise wenn du es mit mehreren leuten machst was kann das team gut und was wollt ihr machen das was wollt ihr machen kann tatsächlich ja schon ein bisschen ausschlag geben ja wenn ihr irgendwelche machine learning dinger machen wollt und fest stellt die besten frameworks gibt es für python oder die besten frameworks gibt es da und dafür oder ihr wollt irgendwelche java libraries verwenden keine ahnung dann ist vielleicht sinnvoll sind java zu machen was ist was sind also also wenn es jetzt wenn es jetzt egal ist ja also ich kann dir sagen was ich machen würde ganz ehrlich ich würde meine micro services genauso in dort net programmieren wie das meiste andere auch wenn ich sachen nicht in dort net programmieren dann zum größten teil nur weil es wirklich trifftige gründe gibt so war ich jetzt gemütet oder musste musste ihr hören wie ich lesen musste weiß ich ob man gehört hat manchmal ist man muten ja nicht so hundertprozentig gemutet also ich würde wahrscheinlich die meisten microservice internet machen wenn ich was nicht in dort net machen ist es halt weil sich was anderes besser eignet zum beispiel wenn es halt irgendwas frontend mäßig ist es dann javascript ich bin kein großer fan von blazer du könntest da theoretisch auch blazer sachen mit c-sharp und dort net fürs frontend machen aber im endeffekt muss ich ehrlich sagen ich bin kein großer blazer fan gerade wenn die leute anfangen so was mit maui zu kombinieren oder so da ist bei mir komplett vorbei ich bin maui kacke und ich bin blazer auch nicht so geil also da würde ich immer frontend immer javascript oder ansonsten je nachdem was man machen will letztens habe ich beispielsweise mal geguckt nach einer kleinen search engine für volltext suche da habe ich was in rust gefunden da wird sich vielleicht anbieten zumindest eine kleine schnittstelle zu machen mit inner c api in rust oder wo wir mal was mit web rtc gemacht haben da haben wir beispielsweise diesen web rtc teil in gau gemacht also manchmal macht schon sinn sich halt anzugucken was ist denn so der kern von dem was man brauchen wo gibt es die besten libraries oder den besten support aber normalerweise standardmäßig ich würde mein zeug immer in dort net machen und gerade wenn du äscher verwendet ist dort net natürlich noch mal doppelt gut weil wenn du functions oder halt cloud native wie man so schönen sachen sag mal wo davon meine güte also wenn du halt sachen verwendet nicht so die klassische sache mit ich mache eine vm und da installe ich mir linux drin und lass man zeug drauf laufen sondern du willst dann vielleicht tatsächlich äscher functions oder so verwenden da ist dort net auch noch mal cool weil dort net sehr gut unterstützt wird in äscher dort net ist tatsächlich dort net unterstützung ist tatsächlich ein paar anderen cloud plattformen nicht so verbreitet ich muss sagen ich habe noch nie aws lambda und ich habe auch noch nicht gcp function weiß gar nicht wie der krempel heißt wir heißen der kram bei google wer ist das gegenstück von land von von ähm von äscher functions und und amazon lambda functions zeug wie heißt denn das bei bei google cloud functions ich weiß gar nicht wer davon dort net unterstützt aber wahrscheinlich die wenigsten so das ist meine antwort dazu mehr kann ich dir nicht sagen weil ich nicht weiß was du machen willst c++ ist für das meiste nicht richtig gut auch ich weiß das ist tibet ja es gibt sachen da glänzt c++ aber hauptsächlich weil es keine sinnige alternative zu gibt alter mensch wo davon es kann doch jetzt nicht sein kriegt euch mal ein naja es gibt schon ein schlechter oder besser jetzt hängt halt entscheidend davon ab was man kann und was man nicht kann im jutes bin ich gemutet achso du meinst hier wo ich nie so musste also ja das ist problem wenn man so weit mit dem chat hinten dran ist kannst du nicht leitung switchen ich habe nur noch eine internetverbindung ich habe die zweite internetverbindung abgestellt schon vor drei vier jahren oder so ist schon vielleicht zwei drei jahren schon eine weile her weil sie einfach sinnlos war viel zu teuer an sich hätte ich lust nächstes jahr eine ausbildung zum physik zu machen jedoch klingen viele stellenanzeigen in meiner gegen nur nach a first level support was gibt es also für job aussicht first level support will man nicht machen first level support ist einfach rots meiner einsicht nach für mich ja sagen nicht allgemein also ich würde kein first level support machen und für first level support brauchst du beim besten willen auch keine physis für first level support kannst du einfach irgendwelche zwar beispielsweise wo ich damals noch beim provider gearbeitet habe unser first level waren ein team aus drei medels die alle super wie so social telekommunikations skills hatten aber halt von technik keine ahnung und die waren halt immer super beliebt auch bei den leuten die angerufen haben als zwei medels und die konnten gut telefonieren aber die haben nur die netten sachen gemacht und wenn es dann nicht ging haben sie die leute durchgestellt oder weitergeleitet und irgendwas weiter geschickt dann haben die den anschluss gekriegt alter so kann ich doch nicht stremen wo davon was ist denn los mit euch ich war mal kurz ein speedtest vom zweiten speedtest mal kurz ein speedtest vom zweiten browser aus schauen wir mal los auf speedtest gib gas 400 mb download speedtest super mal upload checken Upload ist ja, Upload ist ja das eigentliche Problem. 406 MBit Upload sollte eigentlich reichen, oder? Äh, 406 MBit Download sollte eigentlich reichen für das bisschen, so Upload, 40 MBit, auch gut. Also, es scheint ein Problem zu sein auf der Route zu den Twitch-Servern. Also was ich probieren könnte, chat, also ihr wisst ja was wir machen, ich starte jetzt mal das Battlefield-Video und wir gucken, ob es laggt. Wenn es laggt, mache ich den Stream kurz aus und wechsle den Twitch-Server, dann gehe ich auf den Twitch-Server in Barcelona oder so und hoffe dann, also Amsterdam oder wo auch immer und hoffe, dass es funktioniert, ok? Aber Leute, es wird ruckeln, 30%, 30% Drop Frames. Hat das erst angefangen zu laggen, als ich hier was ein, Leute, wir testen mal kurz was. Jetzt habe ich keine Frame-Drops, aber jetzt sieht man ja auch nichts. Doch, ich habe immer noch Frame-Drops, Keckel, Leute, ich habe immer noch Frame-Drops mit einem komplett schwarzen Bildschirm, also daran kann es jetzt ja schon mal nicht liegen. Ja, man merkt es bei den Maus-Bewegungen, sag ich, ja, ja, ja, Mensch, Vodafone, was ein Crap, Alter, was ist das hier? Ne, das stimmt nicht, das stimmt nicht, nur weil, nur weil Docker in Go programmiert ist, hat es doch absolut keinen Einfluss drauf auf das, was du in deinem Container laufen lässt. Ne, ne, das, Sven, lass dir da nichts erzählen, du kannst in Containern laufen lassen, was du willst, dort Net-Anwendungen laufen auch wunderbar in Containern, alles läuft wunderbar in Containern, solange es keine Kernel-Treiber braucht. Wo ich tatsächlich immer ein bisschen Angst habe, ist, wie Docker die Leistung regelt, warum? Docker frisst keine Performance, du machst das beruflich, ich auch, und jetzt, und nun, also da musst du dir keine Gedanken machen, Docker frisst keine Performance, ich weiß jetzt kommen die Leute und sagen, ja, theoretisch gesehen schon, nein, Docker ist, also, rechnerisch, vielleicht, wenn du dann irgendwie super krasse Benchmarks machst für fünf Stunden und das vergleicht, vielleicht, ja, vielleicht siehst du dann was, keine Ahnung, aber Docker macht in der Regel keine Performance-Probleme, weil ein Docker-Container, bzw. die Anwendung, die du in einem Container laufen lässt, ein ganz normaler, 50% Packetless, weil dein Docker-Container, die Leute stellen sich das immer so ein bisschen als VM vor, das ist es nicht, ein Prozess, den du startest in einem Docker-Container ist ein ganz normaler Prozess, also wenn du jetzt deine Anwendung auf dem Linux-System startest, oder die Anwendung in einem Docker-Container startest, das macht quasi keinen Unterschied, das ist ein ganz normaler Prozess, wie jeder andere Prozess auch, der einzige Unterschied ist, dass noch ein paar zusätzliche Kernel-Funktionen benutzt werden, nämlich sowas wie Cgroups und Namespaces, dass du beispielsweise der Anwendung, die im Container läuft, andere IPs vorgaukeln kannst, oder andere Hausnamen vorgaukeln kannst, ein anderes File-System vorgaukeln kannst und solche Geschichten, die Performance, also wir reden hier von CPU und sowas, nicht zwangsläufig von Netzwerk und IOU, macht keinen Unterschied in Docker und auch in der VM, weil die Leute ja da immer ein bisschen Bedenken vor haben, ah, VM, Docker, also eine VM hat, was CPU-Leistung angeht, nahezu keinen Overhead, ihr könnt einen Benchmark laufen lassen, lasst ein Prime95 Benchmark laufen in der VM, versus auf eurem Host, ihr werdet feststellen, die Werte sind nahezu identisch, was bei der VM das Problem ist, bzw. warum man sagt, VMs brauchen mehr Ressourcen, ist, VMs brauchen deutlich mehr RAM, warum? Naja, weil ein komplett eigenes System gestartet wird im Hintergrund, also VMs brauchen mehr RAM und mehr Disk im Endeffekt, weil Disk, glaube ich, zu vernachlässigen ist, aber RAM. VMs brauchen einfach mehr RAM, weil ein komplett eigenes System mit eigenem Kernel, mit eigenen Livesports, alles hochgefahren werden, du kannst natürlich ein Minimalsystem nehmen, dann kommst du vielleicht, äh, tja, mit minimalstem Overhead aus, aber eine VM hat immer, was RAM angeht, einen gewissen Overhead, um den du nicht drumherum kommst, den hat ein Container, nicht CPU-technisch Performance, CPU-Performance-technisch ist es überhaupt kein Unterschied. Also, das stimmt, er hat schon Recht, Docker hat im Prinzip deutlich weniger Overhead als eine VM, allerdings nicht bei der CPU, also nicht unbedingt zwangsläufig bei dem, wo man an Performance denkt, also die CPU-Performance zwischen der VM, zwischen dem Host und zwischen dem gleichen Ding im Docker-Container ist nahezu identisch, also die CPU-Leistung ist mehr oder weniger das gleiche überall, RAM-Auslastung ist ein bisschen das Problem, und wenn es dann um IO geht und Netzwerk, da sieht das noch mal anders aus, da muss man eh gucken, gerade wie man die Sachen in der VM anbindet, gerade IO-Performance ist in der VM nicht ohne, das kann schon eine ganze Ecke langsamer sein, je nachdem, was man da als Virtualisierung nimmt und was man für Anforderungen hat, aber bei Docker-Container musst du dir eigentlich keine Gedanken machen, also wenn du ein Prozess in einem Docker-Container startest, der hat die gleiche Performance wie auf dem Host, es ist ja auch ein ganz normaler Prozess auf deinem normalen Host, deswegen kannst du dein Docker-Container beispielsweise auch keine Kernel-Module nachladen oder Kernel-Module verwenden die dein Host nicht verwendet oder sowas, es ist der gleiche Kernel wie dein Host, das ist keine VM in dem Sinn, also da hast du performanstechnisch keine Unterschiede, es ist sogar besser, du kannst deine Docker-Container deutlich einfacher, wenn du es denn bräuchtest, wie nennen wir es mal, nicht Rate-Limiten, na, Resource Groups, wie heißt denn das, also Ressourcen besser managen, du kannst zum Beispiel relativ einfach sagen, deinem Container benutzt maximal zwei CPU-Kerne oder sowas, ok, ich glaube, Leute, ich glaube, ich muss wirklich, ich muss den Twitch-Server wechseln, das klappt hier nicht, Vodafone, wie war die Probe-Fahrt, also ich war heute Probe-Fahrt, ich bin begeistert, ich finde das Auto wirklich nice, ich muss jetzt bloß gucken, ob das dieses Jahr noch klappt, möglich ist es, ich habe heute auch mal gefragt, wie es mit Vorführautos aussieht und wie gesagt, wenn es irgendwie hinhaut, dass ich es unter 30.000 Euro bekomme noch dieses Jahr, dann kaufe ich es ansonsten nicht. Was es außer First-Level-Support gibt als Physi, alles andere außer First-Level-Support, du kannst alles machen als Physi, wenn du dich damit auskennst, wohlgemerkt, alles, wirklich, ich kann dir nicht sagen, was alles ist, weil alles ist alles und alles ist sehr viel, du kannst alles mögliche machen, du musst dich halt in den Bereichen ein bisschen auskennen, es bringt dir nichts, wenn du eine Physi-Ausbildung gemacht hast und am Ende dich bewirbst als Cloud-Architekt und keine Ahnung davon hast, das funktioniert natürlich auch nicht. Mario, danke für den Sub, ok, wenn wir von Windows-Containern reden, ist das nochmal was anderes, Windows-Container sind ja auch keine Container, sondern Hyper-V4Ms, zumindest ist das mein letzter Stand, korrigiert mich, wenn ich falsch liege, aber ich glaube, Windows-Container sind Hyper-V4Ms, Windows-Container ist also quasi eigentlich kompletter Gebate, der wahrscheinlich einfach nur da ist, dass Leute Docker und Windows ausfüllen können, also Docker und Windows ist wahrscheinlich eins der bescheuerten Sachen, die man machen kann, da bin ich ja mal gespannt, ja, nein, muss nicht, muss gar nicht, es muss im Prozess nichts übersetzt werden, wenn du in den Prozess startest, im Container oder nicht im Container, ist exakt das gleiche, es macht keinen Unterschied, also wenn du auf die Konsole gehst unter Linux, ja, und du sagst hier ausführen, keckel.bin, dann ist es egal, ob du keckel.bin so startest oder ob du sagst docker-run-keckel-container, das macht erstmal keinen Unterschied, es ist ein bisschen, es ist die Möglichkeit vorhanden, das ein bisschen besser zu sandboxen, aber es ist nicht so, als wäre da irgendwie großartig was drum herum, das ist ein ganz normaler Prozess, so wie jeder andere auch, ich will es jetzt nicht ausschließen, dass es nicht doch irgendwie, wenn man es drauf anlegt, messbar ist, ich meine, theoretisch hast du natürlich so die Möglichkeit mit Cgroups und sowas, Ressourcen-Limitierungen vorzunehmen, das heißt, da gibt es irgendwelche API-Funktionen, um das machen zu können, das heißt, wenn man das machen kann, hat es vielleicht, auch wenn man das nicht macht, irgendwie rein theoretische Performance einbußen, aber ganz im Ernst, mich würde es wirklich wundern, wenn einer das benchmarkt, und wir reden, der müsste das wirklich benchmarken, da müsste irgendjemand, keine Ahnung, Prime95 auf den 24 Kerne laufen lassen in docker und ohne docker, mal für 24 Stunden und dann am Ende gucken, was kommt raus, oder was man heutzutage nimmt, ich weiß nicht, ob Prime95 schon angesagt ist, und ja, vielleicht ist es in irgendeiner Art und Weise dann messbar, aber nicht, dass es irgendeine Relevanz hätte. Ja, gut, du hast ein Overhead, was Libraries und Images angeht, ja, das ist okay, das ist was anderes, aber nicht performanstechnisch, und ihm ging es ja hier hauptsächlich, dass er bedenkt, allwegen Performance im Container, und mir geht es hier rein um Leistung, und das ist wurscht, und ja, und ganz ehrlich, ja, das ganze Container Zeug, und gerade auch was Kubernetes angeht, und docker angeht, und viele Cloud Sachen sind in Go programmiert, aber das heißt bei weitem nicht, dass man Software in Containern am besten in Go programmiert, überhaupt nicht, genau das Gegenteil, mach dir überhaupt keine Gedanken darüber, dass das im Container läuft, sondern programmier das mit dem, was du am besten kannst, was dein Team am besten kann, und dann packst du es am Ende in Container rein, ich mein gut, wenn man weiß, dass man das in der Cloud laufen lassen will, wenn man weiß, dass man das vielleicht mit irgendeinem Orchestrator oder was auch immer laufen will, oder als Microservices, im Hinblick auf dessen sollte man das schon entwickeln, aber nicht die Programmiersprachen Ausfall davon abhängig machen, du kannst containerisierte Microservices in jeder Programmiersprache entwickeln, wahrscheinlich sogar Cobol, so hat sich das jetzt mal beruhigt, Alter 65% Package Loss, Mann, ja, das stimmt, so, habe ich große Einbußen, wenn ich jetzt mal ein Web Server nativ im Container laufen lassen, tja, das kommt drauf an, also, wenn du rein die Performance meinst, was das Ding, was weiß ich, CPU, Performance, sonst was, nein hast du nicht, du hast quasi keine Einbußen, netzwerktechnisch musst du dir aber Gedanken machen, also wenn du wirklich, wenn du einen Web Server im Container laufen lässt, wo es wirklich richtig brummt, also wir reden hier von, keine Ahnung, Gigabitweise, also wenn es da richtig abgeht, dann würde ich mir überlegen, wie ich das Netzwerk mache, und zwar, kurz ein bisschen leiser machen, und zwar würde ich dann mal überlegen, ob ich das wirklich mit diesem Standard Docker Proxy mache, also Docker Proxy, Proxy, das ist ja standardmäßig, es gibt aber verschiedene Möglichkeiten, wie man Docker Netzwerk machen kann, ja, du kannst auch direkt eine Netzwerkkarte verwenden, oder direkt das Bridge in ein Haus, das würde ich mir dann überlegen, also wenn du so eine, wenn du eine Netzwerkanwendung hast, die wirklich mega krass Traffic hat, dann würde ich es vielleicht nicht über das Standard Docker Networking mit dem Proxy machen, aber ansonsten, was Performance angeht, hast du da keine, du hast, du hast nicht nur keine großen Einbußen, du hast im Prinzip keine Einbußen. So, was sieht es denn jetzt aus, ok Leute, ich wechsle jetzt den Twitch Server, dass wir uns heute noch das Battlefield Video angucken können, und dann hoffen wir, dass es funktioniert, weil ich kann auch nichts machen, wenn Vodafone mir das sagt, sagt Vodafone halt, ja, und das ist natürlich auch ein großer Vorteil, da hat er schon recht, da hat Sarix in dem Fall schon recht, wenn du die Sachen so baust, dass sie unabhängig voneinander sind, und unabhängig voneinander, wenn du sie gut kontinuerisieren kannst, spricht das meistens dafür, dass sie nicht so, wie sagt man, nicht so tightly coupled, koppelt, wie sagt man das, also dass sie nicht so eng miteinander verbunden sind, dass das eine quasi zwangsläufig darauf laufen muss, wo das andere läuft, also wenn du deine Anwendung ein bisschen entkoppelt konstruiert hast, und diese gut kontinuerisieren kannst, dann ist das hier natürlich ein Wahnsinns-Vorteil, weil wenn du wirklich mal in die blöde Situation kommst, dass du jetzt anstatt, wie man früher gemacht hat, ich habe 3 Applikationsserver vms, und wenn wir mehr Last brauchen, muss ich erst nochmal ein paar neue aufbauen, richtig, genau, und das ist halt wirklich ein Vorteil, da kannst du einfach sagen, wie auf dem Load Balancer ist die Last über 80%, meistens machst du das ja schon vorher, oder Load Balancer ist die Last über 50% oder die Connections über so diesem Limit, wir machen einfach 3 neue Container, und lassen die verteilen auf die Cluster, das ist natürlich wahnsinnig geil, wenn das funktioniert, in dem Fall, so, okay moin, Leute, ich bin in 2 Minuten wieder da, also ihr könnt gleich nach einer Minute F5 drücken, ich werde jetzt den Stream ausmachen, ich mache den Stream wieder an, suche meinen anderen Twitch-Server aus, und wir hoffen, dass es funktioniert, wenn es nicht funktioniert, haben wir wahrscheinlich gelitten, und wir müssen mit lag leben noch für eine Stunde, aber gucken wir mal, ich bin gleich wieder da.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Das war's für heute."}, {"id": 2, "start": 2.0, "end": 4.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 3, "start": 4.0, "end": 6.0, "text": "Wenn ihr mehr von uns sehen wollt,"}, {"id": 4, "start": 6.0, "end": 8.0, "text": "dann abonniert unsere Kanal und lasst ein Like da."}, {"id": 5, "start": 8.0, "end": 10.0, "text": "Dann sehen wir uns in der nächsten Folge."}, {"id": 6, "start": 10.0, "end": 32.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 7, "start": 32.0, "end": 60.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 8, "start": 60.0, "end": 82.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 9, "start": 82.0, "end": 110.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 10, "start": 110.0, "end": 120.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 11, "start": 140.0, "end": 160.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 12, "start": 160.0, "end": 166.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 13, "start": 166.0, "end": 190.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 14, "start": 190.0, "end": 192.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 15, "start": 192.0, "end": 194.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 16, "start": 194.0, "end": 196.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 17, "start": 224.0, "end": 226.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 18, "start": 226.0, "end": 228.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 19, "start": 228.0, "end": 230.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 20, "start": 230.0, "end": 232.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 21, "start": 232.0, "end": 234.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 22, "start": 234.0, "end": 236.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 23, "start": 236.0, "end": 238.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 24, "start": 238.0, "end": 240.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 25, "start": 240.0, "end": 242.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 26, "start": 242.0, "end": 244.0, "text": "Ich hoffe, es hat euch herkes gefallen."}, {"id": 27, "start": 244.0, "end": 246.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 28, "start": 246.0, "end": 248.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 29, "start": 248.0, "end": 250.0, "text": "Ich hoffe, es hat euch gefallen."}, {"id": 30, "start": 250.0, "end": 256.08, "text": "Dass ich plus anstatt semine zum konto habe das liegt im prinzip daran weil ich mehr rein bekomme als ausgebe"}, {"id": 31, "start": 257.64, "end": 259.64, "text": "Kackel kackel ist das beste"}, {"id": 32, "start": 261.28, "end": 264.84, "text": "Wobei das allerbeste das muss ich vielleicht noch noch mal in titel schreiben"}, {"id": 33, "start": 265.28, "end": 269.12, "text": "Wobei näh lasse ich der titel ist einfach nur enden weil man nichts anderes eingefallen ist"}, {"id": 34, "start": 270.64, "end": 273.44, "text": "0w ist immer noch das allerbeste nein nein nein"}, {"id": 35, "start": 273.44, "end": 280.32, "text": "0w ist das einzig wahre sehe ich auch so also 0w größer kackel größer kacke"}, {"id": 36, "start": 281.72, "end": 283.72, "text": "0w ist eindeutig das beste"}, {"id": 37, "start": 285.08, "end": 290.68, "text": "Normales lull ist auch ok aber 0w oder lull w wie das die amis sagen"}, {"id": 38, "start": 292.32, "end": 298.0, "text": "Ist das ist das beste nach emote und das beste video dazu ist ja immer noch"}, {"id": 39, "start": 298.0, "end": 305.96, "text": "Noch wir gucken uns das jetzt nicht an wir gucken uns jetzt nicht an wir gucken uns so ich lasse"}, {"id": 40, "start": 305.96, "end": 308.92, "text": "Kurze nur mal kurz das intro laufen als erstes intro ist pock"}, {"id": 41, "start": 318.52, "end": 320.52, "text": "Doch was habe ich den noch auf"}, {"id": 42, "start": 320.52, "end": 324.64, "text": "So leicht"}, {"id": 43, "start": 332.2, "end": 335.48, "text": "Ne aber ich habe es auf guck hier das gucken wir uns gleich zusammen an"}, {"id": 44, "start": 338.6, "end": 341.92, "text": "Gucken wir uns gucken wir uns gleich an ich habe es noch nicht gesehen"}, {"id": 45, "start": 342.32, "end": 346.76, "text": "Ich habe es aber schon aufgemacht weil ich mir gedacht habe so wie ich euch kenne"}, {"id": 46, "start": 346.76, "end": 351.8, "text": "Also ich habe den post gesehen von denen eine minute nachdem er raus war habe ich mir dazu mich euch kenne"}, {"id": 47, "start": 352.28, "end": 358.0, "text": "Wollt ihr wahrscheinlich das für uns das heute zusammen angucken bäm auf geht's was das es leckt"}, {"id": 48, "start": 359.24, "end": 361.8, "text": "Wo da vorn was da los?"}, {"id": 49, "start": 364.44, "end": 366.44, "text": "Wow"}, {"id": 50, "start": 366.44, "end": 374.44, "text": "Wo da vorn"}, {"id": 51, "start": 377.24, "end": 380.76, "text": "Probe fahrt ja ich bin heute probe gefahren ich habe es hat mir wirklich gut gefallen"}, {"id": 52, "start": 382.6, "end": 389.08, "text": "Sowohl die die ausstattung wobei das jetzt gar kein maximal ausgestatteter fiat war sondern"}, {"id": 53, "start": 389.08, "end": 396.04, "text": "Ist aber so relativ normal plus ein bisschen schnick schnack einfach wahrscheinlich dass es mehr her macht jetzt ist jetzt ist gut"}, {"id": 54, "start": 397.08, "end": 401.2, "text": "Also für alle die nicht dabei waren ich kann es euch ja noch mal zeigen ich habe ihn glaube ich irgendwie noch"}, {"id": 55, "start": 401.92, "end": 403.84, "text": "also"}, {"id": 56, "start": 403.84, "end": 406.32, "text": "Falls ich frage von was von was ich laber"}, {"id": 57, "start": 406.92, "end": 409.92, "text": "Also aktuell habe ich folgendes auto. Nee kein tesla"}, {"id": 58, "start": 410.2, "end": 415.32, "text": "Soll ich mir ein tesla kauen alter ich meine die dinger sind schon teuer genug und so wenig wie ich fahre"}, {"id": 59, "start": 415.32, "end": 421.36, "text": "bräuchte ich normalerweise gar kein elektroauto, aber ich dachte mir so ja irgendwie spricht mich das an"}, {"id": 60, "start": 422.16, "end": 424.16, "text": "aber auf der anderen seite"}, {"id": 61, "start": 425.08, "end": 426.44, "text": "also"}, {"id": 62, "start": 426.44, "end": 430.36, "text": "50 60 k und noch mehr will ich dafür ganz bestimmt nicht ausgeben"}, {"id": 63, "start": 432.2, "end": 437.6, "text": "So also aktuell habe ich ja dieses wahnsinnsauto hier in grün also exakt so wie ihr ihn hier seht"}, {"id": 64, "start": 438.44, "end": 440.72, "text": "Was kostet so was eigentlich gebraucht aktuell?"}, {"id": 65, "start": 440.72, "end": 444.24, "text": "und kurz gucken was"}, {"id": 66, "start": 446.0, "end": 451.48, "text": "Nein ach das ist der neue dass es meinen gibt es überhaupt nicht mehr gebraucht doch hier"}, {"id": 67, "start": 453.4, "end": 457.64, "text": "Style paket ich wusste gar nicht dass dieses auto jemals ein style paket hat"}, {"id": 68, "start": 459.52, "end": 465.04, "text": "Weil wir nicht bekannt dass das ein style paket haben kann was hat das irgendwie style schon fällt oder was"}, {"id": 69, "start": 465.04, "end": 473.72, "text": "Also immerhin immerhin könnte ich hey vielleicht könnte ich vielleicht könnte ich meinen agila das jetzt fast genauso aus wie der"}, {"id": 70, "start": 473.96, "end": 479.4, "text": "Vielleicht könnte ich dir noch für 1000 euro raushauen oder so ich meine aktuell verkauft sich ja alles anscheinend"}, {"id": 71, "start": 479.4, "end": 484.52, "text": "Sieht aus wie das auto von mr. Bean nähe mr. Bean hatte in mini glaube ich"}, {"id": 72, "start": 485.2, "end": 490.12, "text": "So wenn es aktuell habe ich dieses teil hier, aber er hat ein bisschen war es aktuell dieses teil und"}, {"id": 73, "start": 491.88, "end": 493.88, "text": "Probe gefahren bin ich heute"}, {"id": 74, "start": 496.0, "end": 498.88, "text": "Den konfigurator aufmachen der ist kaputt"}, {"id": 75, "start": 500.4, "end": 504.88, "text": "Und ich habe hier ein bisschen was zu tun, aber ich habe hier ein bisschen was zu tun"}, {"id": 76, "start": 504.88, "end": 511.96, "text": "An den konfigurator aufmachen der ist kaputt aktuell war fiat auf der homepage mal gucken ob er hier geht"}, {"id": 77, "start": 512.56, "end": 514.32, "text": "Konfigurator ist immer noch kaputt"}, {"id": 78, "start": 514.32, "end": 519.08, "text": "Kekkel ich habe übrigens raus gemacht ich weiß übrigens über den fiat konfigurator fixt"}, {"id": 79, "start": 520.4, "end": 527.48, "text": "Man muss einfach hinten das weg machen und das nur konfigurator da steht und dann kriegt man die auto auswahl und dann funktioniert es"}, {"id": 80, "start": 527.48, "end": 529.48, "text": "Und es liegt auch nicht am dark reader"}, {"id": 81, "start": 529.48, "end": 533.64, "text": "So proben gefahren bin ich heute das"}, {"id": 82, "start": 538.92, "end": 541.36, "text": "Das ding la prima"}, {"id": 83, "start": 545.0, "end": 547.0, "text": "Muss halt sagen"}, {"id": 84, "start": 549.12, "end": 551.32, "text": "Ich meine das kostet im ende nicht ja aber"}, {"id": 85, "start": 553.04, "end": 555.04, "text": "Billig ist was anderes"}, {"id": 86, "start": 555.04, "end": 561.36, "text": "Dafür kriegst du schon ein ziemlich geiles nicht elektroauto wenn ich das dieses jahr noch bekomme"}, {"id": 87, "start": 562.52, "end": 568.84, "text": "Und die förderung runter geht es gibt ja 9.000 euro 9.350 oder so"}, {"id": 88, "start": 571.04, "end": 573.04, "text": "Förderung"}, {"id": 89, "start": 574.0, "end": 575.44, "text": "Dann"}, {"id": 90, "start": 575.44, "end": 581.84, "text": "Ich habe auch nichts dazu ja farbe farbe ist das einzige farbe würde ich vielleicht wieder wieder wieder"}, {"id": 91, "start": 581.84, "end": 588.0, "text": "Grau oder oder grün oder so so was vielleicht vielleicht vielleicht ja"}, {"id": 92, "start": 590.4, "end": 592.04, "text": "So aber"}, {"id": 93, "start": 592.04, "end": 599.0, "text": "Ne das das das ist mir ich habe ja nichts gegen weibliche autos ich meine viele sagen ja das ist ein frauenauto ja aber"}, {"id": 94, "start": 600.44, "end": 603.08, "text": "Die farbe ist mir dann doch irgendwie nix"}, {"id": 95, "start": 603.08, "end": 609.2, "text": "So zumindest ne das ist das falsche hier"}, {"id": 96, "start": 611.68, "end": 613.68, "text": "Warte mal habe ich das richtige"}, {"id": 97, "start": 616.88, "end": 618.88, "text": "Ja ja ich habe das ich habe das richtige"}, {"id": 98, "start": 619.68, "end": 625.0, "text": "Weil ich jetzt ist hier ist das technikpaket schon drin das ist das war ich meine so also den bin ich heute den bin ich heute probe"}, {"id": 99, "start": 625.0, "end": 628.6, "text": "gefahren ganz im ernst also so viel gebe ich dafür nicht aus aber"}, {"id": 100, "start": 628.6, "end": 633.32, "text": "Du kannst ja wenn du den dieses jahr noch bekommst kannst du mal 9.000 euro abziehen"}, {"id": 101, "start": 633.64, "end": 638.24, "text": "Dann ist so und das ist immer noch verdammt viel geld also wenn ihr das mal vergleicht was ihr für"}, {"id": 102, "start": 638.24, "end": 646.76, "text": "Einen nicht elektroauto für ein richtig geiles nicht elektroauto bekommt für 32.000 euro das ist schon was wobei die ausstattung von dem ding wirklich ganz okay ist"}, {"id": 103, "start": 648.32, "end": 655.04, "text": "Gut und in der form ich bräuchte den eigentlich ganz ehrlich ich brauche keine special coolen felgen oder so"}, {"id": 104, "start": 655.04, "end": 661.72, "text": "Und ich brauche garantiert auch keine getönten heckscheiben und solch die geschichten also in das ist vollkommen in ordnung"}, {"id": 105, "start": 662.44, "end": 666.52, "text": "So und ich muss jetzt mit denen mal muss jetzt mit denen noch mal irgendwie reden"}, {"id": 106, "start": 667.36, "end": 669.84, "text": "Was man da was man da noch machen kann"}, {"id": 107, "start": 672.4, "end": 674.72, "text": "Weil was jetzt los"}, {"id": 108, "start": 674.72, "end": 683.2, "text": "Jetzt kaputt gegangen oder wie weil ganz ehrlich selbst wenn ich da selbst wenn ich da 9.000 euro abziehe also unter"}, {"id": 109, "start": 683.84, "end": 687.28, "text": "30.000 euro also ich wollte nicht über 30.000 euro ausgeben"}, {"id": 110, "start": 687.84, "end": 693.6, "text": "Warum überhaupt in vier an der honda e ist auch nice da bin ich auch um überlegen ob ich also ich habe noch ein paar andere"}, {"id": 111, "start": 693.6, "end": 699.52, "text": "Autos in der aus in der auswahl also honda e finde ich würde ich auch noch mal gerne ausprobieren bevor ich den kauf"}, {"id": 112, "start": 699.52, "end": 705.36, "text": "Einen reno soy wollte ich noch mal ausprobieren und einen vw ii ab"}, {"id": 113, "start": 706.56, "end": 708.56, "text": "Und es gab noch ein viertes"}, {"id": 114, "start": 710.24, "end": 712.24, "text": "Und fünftes"}, {"id": 115, "start": 714.4, "end": 716.4, "text": "Wann das das hab ich"}, {"id": 116, "start": 718.08, "end": 722.88, "text": "Die sind alle die sind alle nicht lieferbar die sind die sind alle nicht lieferbar"}, {"id": 117, "start": 722.88, "end": 727.6, "text": "Die sind alle die sind alle nicht lieferbar die sind die sind alle nicht lieferbar"}, {"id": 118, "start": 730.4, "end": 733.84, "text": "Die kann das ja das problem die sind alle nicht lieferbar"}, {"id": 119, "start": 736.0, "end": 740.4, "text": "So warum den fiat na ja weil ich ein kleines auto für die stadt haben will"}, {"id": 120, "start": 744.0, "end": 746.68, "text": "Und der fiat hat mehr oder weniger"}, {"id": 121, "start": 746.68, "end": 750.44, "text": "Passt eins zu eins die gleichen abmaße wie mein aktueller"}, {"id": 122, "start": 752.68, "end": 755.0, "text": "Tja und ich bin mal gespannt ob das klappt"}, {"id": 123, "start": 756.44, "end": 761.08, "text": "Also in dem auto haus haben sie mir heute erzählt die haben wohl eine ganze menge bestellt"}, {"id": 124, "start": 761.96, "end": 763.96, "text": "halt"}, {"id": 125, "start": 765.56, "end": 768.12, "text": "Nicht exakt in der config die ich haben will"}, {"id": 126, "start": 768.84, "end": 773.56, "text": "Also klar wäre auch da habe ich denen gesagt also farbe ist mir jetzt nicht so wichtig"}, {"id": 127, "start": 773.56, "end": 775.56, "text": "Außer vielleicht rosé muss nicht sein"}, {"id": 128, "start": 777.08, "end": 783.88, "text": "Mal gucken mal gucken ob das klappt also ich ich werde so machen ich ich werde so machen also"}, {"id": 129, "start": 785.88, "end": 791.24, "text": "Es muss auch nicht die la prima variante sein ja es könnte auch die die kleinere sein also ich werde so machen"}, {"id": 130, "start": 791.8, "end": 794.36, "text": "Sollte es dieses jahr noch die möglichkeit geben"}, {"id": 131, "start": 795.16, "end": 797.72, "text": "Ein zu bekommen mit der vollen prämie"}, {"id": 132, "start": 797.72, "end": 803.64, "text": "Und wenn man vielleicht irgendwie noch ein bisschen was rabattechnisch ausmachen kann so dass ich unter 30.000 euro komme"}, {"id": 133, "start": 804.68, "end": 806.44, "text": "das ist eigentlich so dass"}, {"id": 134, "start": 806.44, "end": 809.32, "text": "Das limit was ich mir gesetzt habe wo ich nicht mehr ausgeben will"}, {"id": 135, "start": 810.04, "end": 813.56, "text": "Grad für meinen rum gefahrer was ich ja war ja so gut wie nie"}, {"id": 136, "start": 814.36, "end": 815.8, "text": "und"}, {"id": 137, "start": 815.8, "end": 817.8, "text": "Dann mache ich das"}, {"id": 138, "start": 818.12, "end": 821.56, "text": "Sollte das nicht hinhauen dann lasse ich es bleiben"}, {"id": 139, "start": 821.56, "end": 825.56, "text": "Sollte das nicht hinhauen dann lasse ich es bleiben"}, {"id": 140, "start": 827.4, "end": 833.32, "text": "Machst du ein mein neues auto videos soll ich chat was sagt ihr und wenn wir machen um frage um frage"}, {"id": 141, "start": 835.88, "end": 844.6, "text": "Das ist das ist wenn du dir überlegst was für 30.000 euro schon für poc autos kriegst gerade auch gebrauchte warum nicht also"}, {"id": 142, "start": 844.6, "end": 850.12, "text": "Ja ich habe den gefragt wie es denn aus mit vorführe autos mal gucken was da rauskommt"}, {"id": 143, "start": 852.92, "end": 859.16, "text": "Soll ich ein mein neues auto video machen"}, {"id": 144, "start": 860.6, "end": 862.6, "text": "Wir waren jetzt mal um frage"}, {"id": 145, "start": 862.6, "end": 867.16, "text": "Zusätzliche abstimmungen zulassen mit keksen einfach weil es geht"}, {"id": 146, "start": 868.36, "end": 872.52, "text": "Da wusste ich kann die leute mal ihre ihre ihre keksen loswerden"}, {"id": 147, "start": 875.56, "end": 877.56, "text": "Moin danke für die subs leute hier"}, {"id": 148, "start": 878.2, "end": 881.16, "text": "Ploggi massive subscription hier nice"}, {"id": 149, "start": 882.44, "end": 883.24, "text": "Ich habe hier die leute"}, {"id": 150, "start": 883.24, "end": 884.44, "text": "Ich habe hier die leute"}, {"id": 151, "start": 884.44, "end": 886.44, "text": "Ich habe hier die leute"}, {"id": 152, "start": 886.44, "end": 888.44, "text": "Ich habe hier die leute"}, {"id": 153, "start": 888.44, "end": 890.44, "text": "Ich habe die leute"}, {"id": 154, "start": 890.44, "end": 892.68, "text": "Ich habe die leute"}, {"id": 155, "start": 895.88, "end": 902.76, "text": "Also ganz im ernst ich mache mir nicht die illusion dass ich er wahnsinnig geld sparen würde erstens ich fahre nicht viel"}, {"id": 156, "start": 903.56, "end": 905.56, "text": "Aber irgendwie ich"}, {"id": 157, "start": 906.28, "end": 913.72, "text": "Ich meine ich lache ich lache ja dann normalerweise immer drüber ja wenn die leute anfangen ja auto hat ja auch ein bisschen was mit"}, {"id": 158, "start": 914.36, "end": 916.36, "text": "Gefühl und sonst was zu tun"}, {"id": 159, "start": 916.36, "end": 922.0, "text": "was mit gefühl und sonst was zu tun letztendlich ich bin kein autofan ja also"}, {"id": 160, "start": 922.0, "end": 924.88, "text": "ist nicht so dass ich mich weder weder gut auskenne mit autos noch dass"}, {"id": 161, "start": 924.88, "end": 927.96, "text": "irgendwie autos jetzt so mein herz höher schlagen lassen oder wenn ich"}, {"id": 162, "start": 927.96, "end": 936.76, "text": "wie es gibt kein denn es nicht will na gut und das wollte ich jetzt sagen aber"}, {"id": 163, "start": 936.76, "end": 942.12, "text": "ja genau zwar ich will was ich sagen wollte aber insofern kann ich nachvollziehen"}, {"id": 164, "start": 942.12, "end": 946.72, "text": "mir spricht halt einfach ein elektroauto gerade halt auch mit so einer"}, {"id": 165, "start": 946.72, "end": 950.92, "text": "modernen ausstattung ich meine das ist wirklich cool das ding hat hat eine"}, {"id": 166, "start": 950.92, "end": 957.48, "text": "erkennung drinne von wenn vielleicht ist das schon alt aber für mich ist das"}, {"id": 167, "start": 957.48, "end": 961.2, "text": "neue das hat eine erkennung drinne was für straßenschilder sind und zeigt dir"}, {"id": 168, "start": 961.2, "end": 968.4, "text": "das an wie schnell du fahren darfst das hat eine kamera wenn du wenn du einparken"}, {"id": 169, "start": 968.4, "end": 972.24, "text": "willst dass du gucken kannst wie weit du vom gehweg weg bist und so was das"}, {"id": 170, "start": 972.24, "end": 975.24, "text": "gibt es wahrscheinlich alle schon"}, {"id": 171, "start": 976.96, "end": 979.96, "text": "ja"}, {"id": 172, "start": 980.08, "end": 986.48, "text": "ist halt ist halt vielleicht schon seit zehn jahren drinne ja aber für mich ist"}, {"id": 173, "start": 986.48, "end": 999.84, "text": "es neu ich meine meiner hat es halt nicht meiner hat nix ja ich bin mal"}, {"id": 174, "start": 999.84, "end": 1004.44, "text": "gespannt ich bin gespannt ob es dieses jahr noch was wird wenn es dieses jahr"}, {"id": 175, "start": 1004.44, "end": 1010.44, "text": "noch was wird dann mache ich also dieses jahr und unter 30.000 euro dann mache ich"}, {"id": 176, "start": 1010.44, "end": 1017.6, "text": "das ansonsten lasse ich bleiben ich habe mir noch gar nichts geholt ich war"}, {"id": 177, "start": 1017.6, "end": 1022.4, "text": "probefahren ein ich war das hier probefahren"}, {"id": 178, "start": 1022.4, "end": 1043.44, "text": "das hier war ich probefahren das hier die sind auch richtig da ist es war"}, {"id": 179, "start": 1043.44, "end": 1048.68, "text": "wirklich cool aber halt der preis ist krass selbst mit prämie prämie kann es"}, {"id": 180, "start": 1048.68, "end": 1052.88, "text": "halt noch mal 9.000 euro abziehen aber trotzdem ich will unter 30.000 euro also"}, {"id": 181, "start": 1052.88, "end": 1056.48, "text": "wenn es über 30.000 euro kostet am ende mache ich das nicht gucken wir noch mal"}, {"id": 182, "start": 1056.48, "end": 1059.08, "text": "was ein prämie"}, {"id": 183, "start": 1062.56, "end": 1066.04, "text": "kann man auch mal abziehen"}, {"id": 184, "start": 1068.12, "end": 1073.24, "text": "günstig günstiger gibt es gibt es ein paar aber im prinzip nehmen sich die in"}, {"id": 185, "start": 1073.24, "end": 1083.0, "text": "diesem segment alle nicht so viel nicht so viel also ich ich fand es gut auch"}, {"id": 186, "start": 1083.0, "end": 1086.44, "text": "das mit der tür ich weiß die meisten sagen das ist nur was für die medals aber"}, {"id": 187, "start": 1086.44, "end": 1093.88, "text": "ich finde auch diese diese hintertür zum einladen wirklich praktisch was wenn du"}, {"id": 188, "start": 1093.88, "end": 1105.96, "text": "das hier holt holt ihr auch das hier ab was ist das die fahrende netto ab was"}, {"id": 189, "start": 1105.96, "end": 1110.72, "text": "soll das sein sieht aus wie eine scam seite"}, {"id": 190, "start": 1110.72, "end": 1124.36, "text": "ist es gern sieht aus wie scam ich habe keine ahnung was es ist prämie sichern"}, {"id": 191, "start": 1124.36, "end": 1132.88, "text": "keck weit was was wollen die von mir was ist das überhaupt"}, {"id": 192, "start": 1132.88, "end": 1142.64, "text": "ok ich habe kein ich schreibe chat ich schreibe sie mal auf ich habe keine"}, {"id": 193, "start": 1142.64, "end": 1146.64, "text": "ahnung was die eigentlich genau vor mir wollen ok"}, {"id": 194, "start": 1149.24, "end": 1155.08, "text": "da sind die china chinesen hinter ja genau also wisst ihr ich sage jetzt noch"}, {"id": 195, "start": 1155.08, "end": 1159.76, "text": "mal eine sache dazu also wie gesagt ich bin ich bin absoluter autonoob und wie"}, {"id": 196, "start": 1159.76, "end": 1165.88, "text": "gesagt mein aktuelles auto ich zeige euch das war von innen oder wie nennt man das"}, {"id": 197, "start": 1165.88, "end": 1176.68, "text": "cockpit wie nennt man das eigentlich vorne ja so ziemlich genau das bei mir"}, {"id": 198, "start": 1176.68, "end": 1184.36, "text": "aus also das ist halt mal zum fall das ist für mich komplett neue welt ja boss"}, {"id": 199, "start": 1184.36, "end": 1197.64, "text": "cockpit ja also so so das aktuell aus also hier ist nichts digital wirklich gar"}, {"id": 200, "start": 1197.64, "end": 1202.16, "text": "nichts was witzig ist ich habe auch noch grüne sitze das ist könnte ja fast mein"}, {"id": 201, "start": 1202.16, "end": 1208.44, "text": "auto sein wahrscheinlich sind die grünen agila doch grüne sitze gut also ich habe"}, {"id": 202, "start": 1208.44, "end": 1214.76, "text": "gesagt es ist wirklich exakt genauso aus bei mir bei mir geht der tacho aber nicht"}, {"id": 203, "start": 1214.76, "end": 1224.92, "text": "bis 200 so weit geht meiner definitiv nicht 200 in dem ding alter bei 120"}, {"id": 204, "start": 1224.92, "end": 1231.52, "text": "denkst du das ding fällt gleich um von alleine 200 ich stelle die sich das vor"}, {"id": 205, "start": 1231.52, "end": 1235.24, "text": "gut wahrscheinlich ist das der standard tacho in allen möglichen autos von"}, {"id": 206, "start": 1235.24, "end": 1239.08, "text": "den gewesen ist das kann ich euch aus erster hand mit dem ding wird zu keine"}, {"id": 207, "start": 1239.08, "end": 1249.64, "text": "200 fahr ich ich bin selten im hinteren drittel hier überhaupt so zumindest so"}, {"id": 208, "start": 1249.64, "end": 1253.56, "text": "sieht aktuell mein auto aus wenn ich drinne setze und so sieht dann das neue"}, {"id": 209, "start": 1253.56, "end": 1257.92, "text": "aus wenn ich drinne setze aber muss halt sagen für mich war das wirklich"}, {"id": 210, "start": 1257.92, "end": 1265.76, "text": "komplett neue welt erstens das zum klima anlage im auto hast klima anlage im"}, {"id": 211, "start": 1265.76, "end": 1270.68, "text": "auto ist für mich so ein ding was ich im hinterkopf habe noch das haben nur so"}, {"id": 212, "start": 1270.68, "end": 1277.88, "text": "angeber fette riesen angeber autokisten oder so ist aber gar nicht mehr so"}, {"id": 213, "start": 1277.88, "end": 1284.2, "text": "anscheinend ist das mittlerweile relativ normal also klimaanlage heizung logisch"}, {"id": 214, "start": 1284.2, "end": 1290.6, "text": "klimaanlage durch ja unten hast du so eine ladeschale fürs smartphone wie so"}, {"id": 215, "start": 1290.6, "end": 1297.64, "text": "ein neues auto geht das alte kaputt ja ja das hatte die das hatte die letzten"}, {"id": 216, "start": 1297.64, "end": 1300.64, "text": "als dieses jahr hat es jede menge probleme schon letztens ist das"}, {"id": 217, "start": 1300.64, "end": 1305.36, "text": "komplette kühlmittel ausgelaufen alles weil der schlauch kaputt war und das war"}, {"id": 218, "start": 1305.36, "end": 1308.76, "text": "auch der anlass dass ich gesagt habe ok max ich glaube es wird so langsam aber"}, {"id": 219, "start": 1308.76, "end": 1318.08, "text": "sicherzeit ich kann es jetzt noch mit dem aktuellen überbrücken aber lange"}, {"id": 220, "start": 1318.08, "end": 1320.88, "text": "macht das nicht mehr"}, {"id": 221, "start": 1322.68, "end": 1329.08, "text": "welcher motor wie von dem da da gibt es nur ein ich habe ein auto ohne klima"}, {"id": 222, "start": 1329.08, "end": 1335.6, "text": "alter mein auto ist das immer an mein auto ist von von 2001 baujahr"}, {"id": 223, "start": 1335.6, "end": 1343.48, "text": "quattrix mit klimaanlage das weiß ich nicht keine ahnung es ist auf"}, {"id": 224, "start": 1343.48, "end": 1348.6, "text": "jeden fall also eins kann ich dir sagen den agila gab es wohl mal ursprünglich"}, {"id": 225, "start": 1348.6, "end": 1354.84, "text": "mit zwei verschiedenen motoren und das der hat den kleineren der hat den"}, {"id": 226, "start": 1354.84, "end": 1358.6, "text": "kleineren also der also mein agila braucht von 0 auf 100 keine ahnung 15"}, {"id": 227, "start": 1358.6, "end": 1366.52, "text": "sekunden oder so das ist wirklich nicht schnell das teil ja 2000 gab es aber"}, {"id": 228, "start": 1366.52, "end": 1372.04, "text": "noch nicht in 0815 autos in so kleinen autos klimaanlagen also 2000 also als ich"}, {"id": 229, "start": 1372.04, "end": 1376.24, "text": "mir das auto gekauft hat war klima alle klima das da unten was das das habe ich"}, {"id": 230, "start": 1376.24, "end": 1379.48, "text": "nicht das habe ich nichts gibt es bei mir nicht das so ein spezial radio ich"}, {"id": 231, "start": 1379.48, "end": 1382.52, "text": "habe nur billig ich habe nur so ganz ganz billig radio und auch kein cd play"}, {"id": 232, "start": 1382.52, "end": 1390.12, "text": "also habe ich alles nicht so also was sowas ist für mich super luxus gewesen"}, {"id": 233, "start": 1390.12, "end": 1394.48, "text": "zumindest das ding hat klimaanlage und also was ich was ich persönlich ganz"}, {"id": 234, "start": 1394.48, "end": 1399.72, "text": "cool finde ist du hast usb anschlüsse du hast ladeschale und habe ich heute"}, {"id": 235, "start": 1399.72, "end": 1405.12, "text": "konnte ich heute auch gleich mal ausprobieren du hast smartphone"}, {"id": 236, "start": 1405.12, "end": 1408.36, "text": "unterstützung wobei ich gucken muss wie gut das wie gut das funktioniert ja da"}, {"id": 237, "start": 1408.36, "end": 1412.92, "text": "kannst du auf smartphone reifendruck gucken und und schauen anrufe an dem"}, {"id": 238, "start": 1412.92, "end": 1415.84, "text": "freisprecheranlage habe ich heute mal alles ausprobiert muss ich sagen hat"}, {"id": 239, "start": 1415.84, "end": 1422.44, "text": "ganz gut funktioniert die app bin ich mir unschlüssig wie geil die ist wenn du"}, {"id": 240, "start": 1422.44, "end": 1429.52, "text": "kannst mit der app dein auto auf und zu machen und gucken wie voll die"}, {"id": 241, "start": 1429.52, "end": 1434.56, "text": "batterie ist und sowas wobei ich mir ehrlich gesagt ich weiß nicht vom handy"}, {"id": 242, "start": 1434.56, "end": 1439.32, "text": "das auto auf und zu machen das ist irgendwas das wieder strebt mir noch ein"}, {"id": 243, "start": 1439.32, "end": 1444.48, "text": "bisschen dass das geht ja du kannst das auto vorheizen im winter oder die"}, {"id": 244, "start": 1444.48, "end": 1448.28, "text": "klimaanlage anmachen vom handy aus ja was ich nicht ganz verstehe ist wie die"}, {"id": 245, "start": 1448.28, "end": 1452.28, "text": "verbindung mit dem auto funktioniert das wusste der händler lustigerweise auch"}, {"id": 246, "start": 1452.28, "end": 1459.0, "text": "nicht zumindest es kann kein bluetooth sein weil die verbindung also die"}, {"id": 247, "start": 1459.0, "end": 1475.4, "text": "reichweite ist viel zu groß da ist eine sim karte da ist so eine da ist so eine"}, {"id": 248, "start": 1475.4, "end": 1483.04, "text": "iot sim karte drin oder sowas achso das auto hat eine permanente internet"}, {"id": 249, "start": 1483.04, "end": 1487.8, "text": "verbindung achso macht mein auto dann auch macht mein auto dann auch einfach"}, {"id": 250, "start": 1487.8, "end": 1491.64, "text": "einfach firmware updates und ich muss nicht im ran fahren so nach dem motto"}, {"id": 251, "start": 1491.64, "end": 1496.56, "text": "falls jetzt können sie 15 minuten nicht fahren firmen update in gange"}, {"id": 252, "start": 1501.68, "end": 1507.04, "text": "das wäre jetzt nämlich naja gut das ist ja wahrscheinlich optional dass man"}, {"id": 253, "start": 1507.04, "end": 1511.92, "text": "diese sachen mit verbindung und so macht das werde ich wahrscheinlich keine"}, {"id": 254, "start": 1511.92, "end": 1522.84, "text": "ahnung ob ich das mache auf jeden fall custom firmen flaschen ja das auf jeden"}, {"id": 255, "start": 1522.84, "end": 1532.56, "text": "fall die klimatisierung wird mit einer dezentralen blockchain gelacht so ist"}, {"id": 256, "start": 1532.56, "end": 1544.4, "text": "das ja die reife werden geht committed gibt es jetzt muss ich jetzt muss ich"}, {"id": 257, "start": 1544.4, "end": 1547.88, "text": "gerade mal gucken fiat home assistant gibt seine integration"}, {"id": 258, "start": 1547.88, "end": 1567.4, "text": "aha guckte mal da was da los anscheinend nicht gibt es anscheinend keine leute"}, {"id": 259, "start": 1567.4, "end": 1586.76, "text": "keine kein home keine home assistant integration dies bettmann github keine"}, {"id": 260, "start": 1586.76, "end": 1595.72, "text": "home assistant uconnect yeses uconnect home assistant anscheinend gibt so was"}, {"id": 261, "start": 1595.72, "end": 1605.32, "text": "nicht aber ganz ehrlich ganz ehrlich geht das geht das mit home bridge oder"}, {"id": 262, "start": 1605.32, "end": 1619.8, "text": "man kann das vielleicht um um tricks mit trick 17 machen mit irgendwie über"}, {"id": 263, "start": 1619.8, "end": 1623.24, "text": "home bridge oder so scheiß drauf wurscht ich will mich jetzt auch nicht"}, {"id": 264, "start": 1623.24, "end": 1628.76, "text": "weiter über meinen autokauf auslassen zumindest wenn es dieses jahr klappt und"}, {"id": 265, "start": 1628.76, "end": 1633.64, "text": "ich das unter 30.000 euro bekomme mit prämie was ja durchaus im bereich des"}, {"id": 266, "start": 1633.64, "end": 1640.12, "text": "möglichen ist denke ich mal das bekommen ist eher das problem dann mache ich das"}, {"id": 267, "start": 1640.12, "end": 1646.52, "text": "ansonsten lasse ich bleiben so aber wie gesagt hier also es ich fand es halt"}, {"id": 268, "start": 1646.52, "end": 1651.52, "text": "mega nice für jemand der so ein altes billigauto hat mal in was modernem zu"}, {"id": 269, "start": 1651.52, "end": 1654.8, "text": "setzen es hat mir auch wirklich gefallen navigationsgerät habe ich nur kurz"}, {"id": 270, "start": 1654.8, "end": 1659.92, "text": "ausprobiert ja gut ist halt auch gut dass das alles im handy verbinden kannst"}, {"id": 271, "start": 1659.92, "end": 1664.48, "text": "rein digitale anzeige über display finde ich auch gut nicht mehr irgendwelche"}, {"id": 272, "start": 1664.48, "end": 1668.16, "text": "komischen was ich hier gut finde ist dass sie auch die meisten sachen noch per"}, {"id": 273, "start": 1668.16, "end": 1672.0, "text": "knöpfe haben ja also hier kann so umschalten zwischen parken und fahren"}, {"id": 274, "start": 1672.0, "end": 1676.56, "text": "und rückwärts und so was hier kannst du handbremse machen was was ich"}, {"id": 275, "start": 1676.56, "end": 1680.36, "text": "persönlich auch cool fand was ich persönlich auch cool fand was ich halt"}, {"id": 276, "start": 1680.36, "end": 1685.44, "text": "auch so noch nicht kannte du kannst den betriebsmodus hier neben umstellen und"}, {"id": 277, "start": 1685.44, "end": 1689.16, "text": "da kannst du nur mit dem gaspedal fahren also wenn du vom gaspedal gehst"}, {"id": 278, "start": 1689.16, "end": 1694.32, "text": "dann bremst er automatisch womit er ein bisschen die batterie auflädt was jetzt"}, {"id": 279, "start": 1694.32, "end": 1697.2, "text": "nicht so der wahnsinn ist aber das cool ist du kannst theoretisch mit nur einem"}, {"id": 280, "start": 1697.2, "end": 1706.24, "text": "fuß fahren das finde ich ganz nice ob man es am endeffekt verwendet keine"}, {"id": 281, "start": 1706.24, "end": 1712.84, "text": "ahnung aber ich finde es ich fand es ich fand es nicht schlecht dass du dann"}, {"id": 282, "start": 1712.84, "end": 1718.96, "text": "quasi mit nur mit einem fuß und einem pedal das war ganz ja carplay android"}, {"id": 283, "start": 1718.96, "end": 1725.12, "text": "gedöns ist da auch mit am start ja hier hast du freisprech ein anleit die habe"}, {"id": 284, "start": 1725.12, "end": 1730.04, "text": "ich heute auch mal ausprobiert und ansonsten"}, {"id": 285, "start": 1730.04, "end": 1744.56, "text": "ja mal gucken alles klar also den tripmode ausprobiert ja ganz bestimmt"}, {"id": 286, "start": 1744.56, "end": 1751.28, "text": "da bin ich der richtige für seito dankeschön für den sub 20 jahre ja 50"}, {"id": 287, "start": 1751.28, "end": 1755.36, "text": "billionen jahre ich habe ein auto tatsächlich schon 20 jahre ich weiß es"}, {"id": 288, "start": 1755.36, "end": 1759.64, "text": "meinst du nicht mit 20 jahren aber also ich habe das auto nicht das auto ist 20"}, {"id": 289, "start": 1759.64, "end": 1765.4, "text": "jahre alt was ich habe die hat also ich weiß nicht ob er k play hat ich kann"}, {"id": 290, "start": 1765.4, "end": 1769.48, "text": "dir das nicht sagen er hat zumindest das zeug wo man sein sein ich weiß es"}, {"id": 291, "start": 1769.48, "end": 1774.68, "text": "k-play das von ios wenn k-play das von ios ist dann hat er das weil das geht"}, {"id": 292, "start": 1774.68, "end": 1782.2, "text": "man kann sein iphone verbinden ja der preis ist ist finde ich tatsächlich"}, {"id": 293, "start": 1782.2, "end": 1788.04, "text": "ganz okay halt nur wenn es komplette prämie gibt und wenn man vielleicht noch"}, {"id": 294, "start": 1788.04, "end": 1792.16, "text": "ein bisschen noch ein paar sachen aushandeln kann"}, {"id": 295, "start": 1792.92, "end": 1796.92, "text": "ich brauche in den satz neuer reifen wobei das können die mir eigentlich"}, {"id": 296, "start": 1796.92, "end": 1804.64, "text": "wahrscheinlich gleich drauf machen weil ich habe so als weg wie heißt das"}, {"id": 297, "start": 1804.64, "end": 1808.76, "text": "jetzt das als weg reifen"}, {"id": 298, "start": 1809.48, "end": 1814.76, "text": "allwetter reifen so rum nicht als weg reifen also ich wechsel so ich wechsel"}, {"id": 299, "start": 1814.76, "end": 1819.48, "text": "keine also was heißt ich selbst ähnlich nicht ich habe auch kein bock das"}, {"id": 300, "start": 1819.48, "end": 1825.28, "text": "wechseln zu lassen alle halbes jahr"}, {"id": 301, "start": 1825.88, "end": 1829.8, "text": "ja und wenn ich allwetter reifen drauf hat muss ich gar keine wartung machen"}, {"id": 302, "start": 1829.8, "end": 1834.96, "text": "dann kann ich das einfach verwenden also mein außerhalb ist was kaputt ja dann"}, {"id": 303, "start": 1834.96, "end": 1840.04, "text": "kann dann ist einfach da nächste wird sein wenn das mit dem kauf vom"}, {"id": 304, "start": 1840.04, "end": 1846.88, "text": "elektroauto klappt also wenn das hier wirklich funst dann muss ich noch beim"}, {"id": 305, "start": 1846.88, "end": 1853.32, "text": "elektriker gucken dass ich mir in hof so ist so eine auflade box wall box"}, {"id": 306, "start": 1853.32, "end": 1858.52, "text": "setzen lasse mitte sommer und winter reifen die reifen sind so wichtig"}, {"id": 307, "start": 1858.52, "end": 1865.68, "text": "warum warum warum denke also ich bin faul warum soll warum sollte ich zweimal im"}, {"id": 308, "start": 1865.68, "end": 1874.76, "text": "jahr in die werkstatt fahren mit dem kram drauf machen lassen"}, {"id": 309, "start": 1874.76, "end": 1881.22, "text": "warum nicht also habe ich aktuell auch wo ist das problem warum ich mein außer"}, {"id": 310, "start": 1881.22, "end": 1884.76, "text": "dass sie sagt dass ich rott warum ist das schrott"}, {"id": 311, "start": 1884.76, "end": 1891.12, "text": "ich wechsle doch nicht meine reifen selbst sichere"}, {"id": 312, "start": 1891.12, "end": 1902.6, "text": "soll er sicherer sein jetzt nicht nur dass ich bei uns hier irgendwie durch"}, {"id": 313, "start": 1902.6, "end": 1912.6, "text": "den schnee fahren würde oder so ja denke ich auch ich glaube also ich habe"}, {"id": 314, "start": 1912.6, "end": 1922.0, "text": "aktuell allwetter reifen ja und mein agila hat genug kripp"}, {"id": 315, "start": 1922.0, "end": 1925.72, "text": "korrekt so sieht es aus"}, {"id": 316, "start": 1925.72, "end": 1945.76, "text": "so gut aber genug genug zum thema auto ich werde euch schon erzählen wenn ich"}, {"id": 317, "start": 1945.76, "end": 1948.44, "text": "den kram bestellt habe beziehungsweise wenn ich dann hab"}, {"id": 318, "start": 1948.44, "end": 1958.64, "text": "wir gucken uns jetzt mal an was die jungs und medels bei dais rausgebracht"}, {"id": 319, "start": 1958.64, "end": 1962.44, "text": "haben oder rausbringen werden wahrscheinlich jetzt mit season 3"}, {"id": 320, "start": 1962.44, "end": 1972.6, "text": "und was da noch so kommt ich habe keine ahnung wir gucken uns das an das video ist 6 ok kann"}, {"id": 321, "start": 1972.6, "end": 1975.56, "text": "nicht so viel sein 6 20 also wenn ihr wirklich was zu zeigen hätten wir das"}, {"id": 322, "start": 1975.56, "end": 1980.8, "text": "video bestimmt eine viertel stunde lang schauen wir mal also ich ich ich"}, {"id": 323, "start": 1980.8, "end": 1987.16, "text": "predikte ich ich predikte mal ein paar sachen und zwar sie werden sich"}, {"id": 324, "start": 1987.16, "end": 1989.88, "text": "wahrscheinlich sie werden wahrscheinlich sie sind drei zeigen oder bis sie ein"}, {"id": 325, "start": 1989.88, "end": 1994.04, "text": "bisschen sie sind drei teasern weil ich mein sie sind drei soll ja immerhin schon"}, {"id": 326, "start": 1994.04, "end": 1998.12, "text": "naja in zwei wochen oder so starten sie werden wahrscheinlich ein bisschen"}, {"id": 327, "start": 1998.12, "end": 2004.16, "text": "sie sind drei teasern sie werden wahrscheinlich map reworks zeigen gehe ich"}, {"id": 328, "start": 2004.16, "end": 2007.8, "text": "mal von aus weil map reworks haben sie angekündigt da können sie jetzt nicht"}, {"id": 329, "start": 2007.8, "end": 2011.64, "text": "einfach sagen ja ist nix vielleicht schaffen wir es ja leute vielleicht"}, {"id": 330, "start": 2011.64, "end": 2017.4, "text": "schaffen wir es ja dass bis zum ende des jahres die hälfte der release maps"}, {"id": 331, "start": 2017.4, "end": 2022.84, "text": "release status hat wo ist das chat overlay stimmt wo ist das chat overlay"}, {"id": 332, "start": 2022.84, "end": 2039.04, "text": "wo ist die katze wait a minute"}, {"id": 333, "start": 2039.04, "end": 2042.08, "text": "warum ist die weg"}, {"id": 334, "start": 2042.96, "end": 2047.36, "text": "warum war die weg ach weil ich noch leute ich kann euch sagen warum die weg"}, {"id": 335, "start": 2047.36, "end": 2050.2, "text": "war ich bin weil ich das video hier aufgenommen"}, {"id": 336, "start": 2050.2, "end": 2053.8, "text": "habe ich habe doch nach dem stream gestern für youtube hier noch aufgenommen"}, {"id": 337, "start": 2053.8, "end": 2057.4, "text": "und da habe ich das ganze auf alle zeug ausgeschaltet ich habe vergessen wieder"}, {"id": 338, "start": 2057.4, "end": 2060.0, "text": "einzuschalten"}, {"id": 339, "start": 2064.6, "end": 2068.84, "text": "so was aber jetzt haben wir die kats jetzt alles gut schieben wir immer noch"}, {"id": 340, "start": 2068.84, "end": 2071.28, "text": "hast auf bettel viel fünf ich muss sagen ich bin mit bettel viel fünf nie"}, {"id": 341, "start": 2071.28, "end": 2074.88, "text": "großartig warm geworden aber ja manche sachen weiß man vielleicht erst zu"}, {"id": 342, "start": 2074.88, "end": 2078.52, "text": "schätzen wenn man sieht wie schlimm es in zukunft wird und nachdem wir"}, {"id": 343, "start": 2078.52, "end": 2084.32, "text": "mittlerweile wissen wie eklig bettel viel 20 42 geworden ist wahrscheinlich ist"}, {"id": 344, "start": 2084.32, "end": 2089.44, "text": "bettel viel fünf dann ja gar nicht mal so schlimm"}, {"id": 345, "start": 2092.96, "end": 2107.0, "text": "so auf geht's leise oder ja ja ja tatsächlich ich habe season 1 0 hour"}, {"id": 346, "start": 2107.0, "end": 2119.52, "text": "enjoyed für ja so 2 bis 3 tage und vodafone vodafone mein mensch was ist"}, {"id": 347, "start": 2119.52, "end": 2131.56, "text": "jetzt schon wieder los chat is lack ne vodafone mach machst du faxen"}, {"id": 348, "start": 2131.56, "end": 2139.52, "text": "was ist hier los droppt frames monka es"}, {"id": 349, "start": 2139.52, "end": 2142.96, "text": "monka w"}, {"id": 350, "start": 2146.44, "end": 2152.24, "text": "es kann nicht alles ok sein das ist jetzt nur ok weil standbild ist"}, {"id": 351, "start": 2153.2, "end": 2158.8, "text": "mein gott vodafone kriegt mal euren scheiß auf die reihe alter das kann doch"}, {"id": 352, "start": 2158.8, "end": 2166.6, "text": "nicht sein was ist hier 25 28 prozent frame drops"}, {"id": 353, "start": 2172.6, "end": 2178.68, "text": "wir müssen kurz warten leute wir müssen kurz warten bis das vorbei ist"}, {"id": 354, "start": 2178.68, "end": 2183.64, "text": "sonst kann ich das sonst kann ich das sonst kann ich das gar nicht"}, {"id": 355, "start": 2183.64, "end": 2189.44, "text": "ja dann müssen wir das ganze kurz überbrücken bis es wieder funktioniert"}, {"id": 356, "start": 2189.44, "end": 2199.28, "text": "gibt es irgendwelche anderen spannenden themen die wir noch schnell besprechen"}, {"id": 357, "start": 2199.28, "end": 2209.36, "text": "können bis der camp wieder funktioniert monka w ok also chat sagt was das"}, {"id": 358, "start": 2209.36, "end": 2214.68, "text": "schlimmste was man am anfang mit einem elektroauto was das schlimmste was am"}, {"id": 359, "start": 2214.68, "end": 2218.2, "text": "anfang hat das schlimmste was man am anfang hat mit einem elektro ist die"}, {"id": 360, "start": 2218.2, "end": 2222.72, "text": "reichweitenangst aber die geht nö habe ich nicht habe ich nicht ich weiß dass"}, {"id": 361, "start": 2222.72, "end": 2226.16, "text": "ich nicht weit fahr ich bin mir da ziemlich sicher dass ich überall"}, {"id": 362, "start": 2226.16, "end": 2230.28, "text": "ankomme wo ich hin will wenn ich mal 100 kilometer fahre das"}, {"id": 363, "start": 2230.28, "end": 2237.08, "text": "kommt eins zweimal im jahr vielleicht vor alter vodafone komm an was ist denn"}, {"id": 364, "start": 2237.08, "end": 2239.48, "text": "hier los"}, {"id": 365, "start": 2246.44, "end": 2249.8, "text": "guckt euch an"}, {"id": 366, "start": 2256.0, "end": 2260.84, "text": "bestem beste programmier sprache für micro service ist das tatsächlich eine"}, {"id": 367, "start": 2260.84, "end": 2266.72, "text": "gute frage der sache können wir uns kurz widmen bis vodafone ich hoffe ihr"}, {"id": 368, "start": 2266.72, "end": 2269.72, "text": "hört mich noch leckfrei ja ich sehe es schon mein mauszeiger ist nicht ganz"}, {"id": 369, "start": 2269.72, "end": 2273.28, "text": "leckfrei ich hoffe ihr hört mich noch leckfrei wenn es ein bisschen baffert"}, {"id": 370, "start": 2273.28, "end": 2279.44, "text": "und bis die frames alle wieder in ordnung sind ok ich sag noch was zu also"}, {"id": 371, "start": 2279.44, "end": 2282.72, "text": "beste programmier sprache für micro service ist natürlich ist das wie in"}, {"id": 372, "start": 2282.72, "end": 2288.88, "text": "vielen fällen dass die einzig beste sprache gibt es natürlich nett logisch"}, {"id": 373, "start": 2288.88, "end": 2294.64, "text": "das hängt davon ab was du machen willst und was du kannst"}, {"id": 374, "start": 2294.64, "end": 2300.96, "text": "also wenn du jetzt sagen wir mal ok was du kannst vielleicht nicht weil kannst"}, {"id": 375, "start": 2300.96, "end": 2304.56, "text": "du nur cobalt ist cobalt vielleicht keine so gute idee aber es ist eine"}, {"id": 376, "start": 2304.56, "end": 2308.12, "text": "kombination aus was kannst du gut beziehungsweise wenn du es mit mehreren"}, {"id": 377, "start": 2308.12, "end": 2313.44, "text": "leuten machst was kann das team gut und was wollt ihr machen"}, {"id": 378, "start": 2313.76, "end": 2318.96, "text": "das was wollt ihr machen kann tatsächlich ja schon ein bisschen"}, {"id": 379, "start": 2318.96, "end": 2323.8, "text": "ausschlag geben ja wenn ihr irgendwelche machine learning dinger machen wollt und"}, {"id": 380, "start": 2323.8, "end": 2327.76, "text": "fest stellt die besten frameworks gibt es für python oder die besten frameworks"}, {"id": 381, "start": 2327.76, "end": 2332.4, "text": "gibt es da und dafür oder ihr wollt irgendwelche java libraries verwenden"}, {"id": 382, "start": 2332.4, "end": 2335.6, "text": "keine ahnung dann ist vielleicht sinnvoll sind java zu machen was ist was"}, {"id": 383, "start": 2335.6, "end": 2340.2, "text": "sind also also wenn es jetzt wenn es jetzt egal ist ja also ich kann dir sagen"}, {"id": 384, "start": 2340.2, "end": 2343.84, "text": "was ich machen würde ganz ehrlich ich würde meine micro services genauso in"}, {"id": 385, "start": 2343.84, "end": 2347.24, "text": "dort net programmieren wie das meiste andere auch wenn ich sachen nicht in"}, {"id": 386, "start": 2347.24, "end": 2350.36, "text": "dort net programmieren dann zum größten teil nur weil es wirklich trifftige"}, {"id": 387, "start": 2350.36, "end": 2356.8, "text": "gründe gibt so war ich jetzt gemütet oder musste musste ihr hören wie ich"}, {"id": 388, "start": 2356.8, "end": 2362.52, "text": "lesen musste weiß ich ob man gehört hat manchmal ist man muten ja nicht so"}, {"id": 389, "start": 2362.52, "end": 2368.64, "text": "hundertprozentig gemutet also ich würde wahrscheinlich die meisten"}, {"id": 390, "start": 2368.64, "end": 2371.92, "text": "microservice internet machen wenn ich was nicht in dort net machen ist es halt"}, {"id": 391, "start": 2371.92, "end": 2376.68, "text": "weil sich was anderes besser eignet zum beispiel wenn es halt irgendwas"}, {"id": 392, "start": 2376.68, "end": 2380.88, "text": "frontend mäßig ist es dann javascript ich bin kein großer fan von blazer du"}, {"id": 393, "start": 2380.88, "end": 2386.48, "text": "könntest da theoretisch auch blazer sachen mit c-sharp und dort net fürs"}, {"id": 394, "start": 2386.48, "end": 2390.2, "text": "frontend machen aber im endeffekt muss ich ehrlich sagen ich bin kein großer"}, {"id": 395, "start": 2390.2, "end": 2394.88, "text": "blazer fan gerade wenn die leute anfangen so was mit maui zu kombinieren"}, {"id": 396, "start": 2394.88, "end": 2397.72, "text": "oder so da ist bei mir komplett vorbei ich bin maui kacke und ich bin blazer"}, {"id": 397, "start": 2397.72, "end": 2404.08, "text": "auch nicht so geil also da würde ich immer frontend immer javascript oder"}, {"id": 398, "start": 2404.08, "end": 2408.0, "text": "ansonsten je nachdem was man machen will letztens habe ich beispielsweise mal"}, {"id": 399, "start": 2408.0, "end": 2414.92, "text": "geguckt nach einer kleinen search engine für volltext suche da habe ich was in"}, {"id": 400, "start": 2414.92, "end": 2417.52, "text": "rust gefunden da wird sich vielleicht anbieten zumindest eine kleine"}, {"id": 401, "start": 2417.52, "end": 2424.08, "text": "schnittstelle zu machen mit inner c api in rust oder wo wir mal was mit web"}, {"id": 402, "start": 2424.08, "end": 2428.04, "text": "rtc gemacht haben da haben wir beispielsweise diesen web rtc teil in"}, {"id": 403, "start": 2428.04, "end": 2434.04, "text": "gau gemacht also manchmal macht schon sinn sich halt anzugucken was ist denn so"}, {"id": 404, "start": 2434.04, "end": 2437.16, "text": "der kern von dem was man brauchen wo gibt es die besten libraries oder den"}, {"id": 405, "start": 2437.16, "end": 2440.96, "text": "besten support aber normalerweise standardmäßig ich würde mein zeug"}, {"id": 406, "start": 2440.96, "end": 2444.8, "text": "immer in dort net machen und gerade wenn du äscher verwendet ist dort net"}, {"id": 407, "start": 2444.8, "end": 2452.48, "text": "natürlich noch mal doppelt gut weil wenn du functions oder halt cloud native"}, {"id": 408, "start": 2452.48, "end": 2456.76, "text": "wie man so schönen sachen sag mal wo davon meine güte also wenn du halt"}, {"id": 409, "start": 2456.76, "end": 2460.56, "text": "sachen verwendet nicht so die klassische sache mit ich mache eine vm und da"}, {"id": 410, "start": 2460.56, "end": 2464.0, "text": "installe ich mir linux drin und lass man zeug drauf laufen sondern du willst"}, {"id": 411, "start": 2464.0, "end": 2467.76, "text": "dann vielleicht tatsächlich äscher functions oder so verwenden da ist dort"}, {"id": 412, "start": 2467.76, "end": 2473.08, "text": "net auch noch mal cool weil dort net sehr gut unterstützt wird in äscher dort"}, {"id": 413, "start": 2473.08, "end": 2475.92, "text": "net ist tatsächlich dort net unterstützung ist tatsächlich ein paar"}, {"id": 414, "start": 2475.92, "end": 2479.28, "text": "anderen cloud plattformen nicht so verbreitet ich muss sagen ich habe noch"}, {"id": 415, "start": 2479.28, "end": 2484.4, "text": "nie aws lambda und ich habe auch noch nicht gcp function weiß gar nicht wie"}, {"id": 416, "start": 2484.4, "end": 2488.32, "text": "der krempel heißt wir heißen der kram bei google wer ist das gegenstück von"}, {"id": 417, "start": 2488.32, "end": 2495.6, "text": "land von von ähm von äscher functions und und amazon lambda functions zeug wie"}, {"id": 418, "start": 2495.6, "end": 2498.76, "text": "heißt denn das bei bei google"}, {"id": 419, "start": 2504.72, "end": 2509.44, "text": "cloud functions ich weiß gar nicht wer davon dort net unterstützt aber"}, {"id": 420, "start": 2509.44, "end": 2512.52, "text": "wahrscheinlich die wenigsten"}, {"id": 421, "start": 2512.52, "end": 2518.6, "text": "so das ist meine antwort dazu mehr kann ich dir nicht sagen weil ich nicht weiß"}, {"id": 422, "start": 2518.6, "end": 2521.28, "text": "was du machen willst"}, {"id": 423, "start": 2529.08, "end": 2536.44, "text": "c++ ist für das meiste nicht richtig gut auch ich weiß das ist tibet ja es gibt"}, {"id": 424, "start": 2536.44, "end": 2540.52, "text": "sachen da glänzt c++ aber hauptsächlich weil es keine sinnige"}, {"id": 425, "start": 2540.52, "end": 2544.68, "text": "alternative zu gibt alter mensch wo davon es kann doch jetzt nicht sein kriegt"}, {"id": 426, "start": 2544.68, "end": 2547.28, "text": "euch mal ein"}, {"id": 427, "start": 2550.36, "end": 2553.96, "text": "naja es gibt schon ein schlechter oder besser jetzt hängt halt entscheidend"}, {"id": 428, "start": 2553.96, "end": 2560.08, "text": "davon ab was man kann und was man nicht kann im jutes bin ich gemutet achso du"}, {"id": 429, "start": 2560.08, "end": 2564.04, "text": "meinst hier wo ich nie so musste also ja das ist problem wenn man so weit mit dem"}, {"id": 430, "start": 2564.04, "end": 2568.04, "text": "chat hinten dran ist kannst du nicht leitung switchen ich habe nur noch eine"}, {"id": 431, "start": 2568.04, "end": 2571.24, "text": "internetverbindung ich habe die zweite internetverbindung abgestellt schon vor"}, {"id": 432, "start": 2571.24, "end": 2574.44, "text": "drei vier jahren oder so ist schon vielleicht zwei drei jahren schon eine"}, {"id": 433, "start": 2574.44, "end": 2578.76, "text": "weile her weil sie einfach sinnlos war viel zu teuer an sich hätte ich lust"}, {"id": 434, "start": 2578.76, "end": 2580.88, "text": "nächstes jahr eine ausbildung zum physik zu machen"}, {"id": 435, "start": 2580.88, "end": 2584.56, "text": "jedoch klingen viele stellenanzeigen in meiner gegen nur nach a first level"}, {"id": 436, "start": 2584.56, "end": 2588.12, "text": "support was gibt es also für job aussicht first level support will man"}, {"id": 437, "start": 2588.12, "end": 2593.64, "text": "nicht machen first level support ist einfach rots meiner einsicht nach für mich"}, {"id": 438, "start": 2593.64, "end": 2599.36, "text": "ja sagen nicht allgemein also ich würde kein first level support machen und für"}, {"id": 439, "start": 2599.36, "end": 2602.8, "text": "first level support brauchst du beim besten willen auch keine physis für"}, {"id": 440, "start": 2602.8, "end": 2606.44, "text": "first level support kannst du einfach irgendwelche zwar beispielsweise wo ich"}, {"id": 441, "start": 2606.44, "end": 2610.88, "text": "damals noch beim provider gearbeitet habe unser first level waren ein team aus"}, {"id": 442, "start": 2610.88, "end": 2616.64, "text": "drei medels die alle super wie so social telekommunikations skills hatten aber"}, {"id": 443, "start": 2616.64, "end": 2621.2, "text": "halt von technik keine ahnung und die waren halt immer super beliebt auch bei"}, {"id": 444, "start": 2621.2, "end": 2625.04, "text": "den leuten die angerufen haben als zwei medels und die konnten gut telefonieren"}, {"id": 445, "start": 2625.04, "end": 2631.56, "text": "aber die haben nur die netten sachen gemacht und wenn es dann nicht ging haben"}, {"id": 446, "start": 2631.56, "end": 2634.36, "text": "sie die leute durchgestellt oder weitergeleitet und irgendwas weiter"}, {"id": 447, "start": 2634.36, "end": 2637.84, "text": "geschickt dann haben die den anschluss gekriegt"}, {"id": 448, "start": 2638.6, "end": 2648.64, "text": "alter so kann ich doch nicht stremen wo davon was ist denn los mit euch ich war"}, {"id": 449, "start": 2648.64, "end": 2652.96, "text": "mal kurz ein speedtest vom zweiten speedtest mal kurz ein speedtest vom"}, {"id": 450, "start": 2652.96, "end": 2660.68, "text": "zweiten browser aus schauen wir mal los"}, {"id": 451, "start": 2665.76, "end": 2674.22, "text": "auf speedtest gib gas 400 mb download speedtest super mal upload checken"}, {"id": 452, "start": 2674.22, "end": 2676.82, "text": "Upload ist ja, Upload ist ja das eigentliche Problem."}, {"id": 453, "start": 2676.82, "end": 2681.58, "text": "406 MBit Upload sollte eigentlich reichen, oder?"}, {"id": 454, "start": 2681.58, "end": 2687.38, "text": "Äh, 406 MBit Download sollte eigentlich reichen für das bisschen, so Upload, 40 MBit, auch"}, {"id": 455, "start": 2687.38, "end": 2688.38, "text": "gut."}, {"id": 456, "start": 2688.38, "end": 2693.9, "text": "Also, es scheint ein Problem zu sein auf der Route zu den Twitch-Servern."}, {"id": 457, "start": 2693.9, "end": 2698.18, "text": "Also was ich probieren könnte, chat, also ihr wisst ja was wir machen, ich starte jetzt"}, {"id": 458, "start": 2698.18, "end": 2700.62, "text": "mal das Battlefield-Video und wir gucken, ob es laggt."}, {"id": 459, "start": 2700.62, "end": 2708.54, "text": "Wenn es laggt, mache ich den Stream kurz aus und wechsle den Twitch-Server, dann gehe"}, {"id": 460, "start": 2708.54, "end": 2713.02, "text": "ich auf den Twitch-Server in Barcelona oder so und hoffe dann, also Amsterdam oder wo auch"}, {"id": 461, "start": 2713.02, "end": 2715.7, "text": "immer und hoffe, dass es funktioniert, ok?"}, {"id": 462, "start": 2715.7, "end": 2719.78, "text": "Aber Leute, es wird ruckeln, 30%, 30% Drop Frames."}, {"id": 463, "start": 2719.78, "end": 2727.58, "text": "Hat das erst angefangen zu laggen, als ich hier was ein, Leute, wir testen mal kurz was."}, {"id": 464, "start": 2727.58, "end": 2739.78, "text": "Jetzt habe ich keine Frame-Drops, aber jetzt sieht man ja auch nichts."}, {"id": 465, "start": 2739.78, "end": 2745.18, "text": "Doch, ich habe immer noch Frame-Drops, Keckel, Leute, ich habe immer noch Frame-Drops mit"}, {"id": 466, "start": 2745.18, "end": 2750.18, "text": "einem komplett schwarzen Bildschirm, also daran kann es jetzt ja schon mal nicht liegen."}, {"id": 467, "start": 2750.18, "end": 2760.86, "text": "Ja, man merkt es bei den Maus-Bewegungen, sag ich, ja, ja, ja, Mensch, Vodafone, was"}, {"id": 468, "start": 2760.86, "end": 2762.62, "text": "ein Crap, Alter, was ist das hier?"}, {"id": 469, "start": 2762.62, "end": 2784.62, "text": "Ne, das stimmt nicht, das stimmt nicht, nur weil, nur weil Docker in Go programmiert ist,"}, {"id": 470, "start": 2784.62, "end": 2788.42, "text": "hat es doch absolut keinen Einfluss drauf auf das, was du in deinem Container laufen"}, {"id": 471, "start": 2788.42, "end": 2789.42, "text": "lässt."}, {"id": 472, "start": 2789.42, "end": 2797.14, "text": "Ne, ne, das, Sven, lass dir da nichts erzählen, du kannst in Containern laufen lassen, was"}, {"id": 473, "start": 2797.14, "end": 2802.62, "text": "du willst, dort Net-Anwendungen laufen auch wunderbar in Containern, alles läuft wunderbar"}, {"id": 474, "start": 2802.62, "end": 2806.14, "text": "in Containern, solange es keine Kernel-Treiber braucht."}, {"id": 475, "start": 2806.14, "end": 2814.58, "text": "Wo ich tatsächlich immer ein bisschen Angst habe, ist, wie Docker die Leistung regelt,"}, {"id": 476, "start": 2814.58, "end": 2815.58, "text": "warum?"}, {"id": 477, "start": 2815.58, "end": 2835.38, "text": "Docker frisst keine Performance, du machst das beruflich, ich auch, und jetzt, und nun,"}, {"id": 478, "start": 2835.38, "end": 2840.78, "text": "also da musst du dir keine Gedanken machen, Docker frisst keine Performance, ich weiß"}, {"id": 479, "start": 2840.78, "end": 2849.38, "text": "jetzt kommen die Leute und sagen, ja, theoretisch gesehen schon, nein, Docker ist, also, rechnerisch,"}, {"id": 480, "start": 2849.38, "end": 2855.5, "text": "vielleicht, wenn du dann irgendwie super krasse Benchmarks machst für fünf Stunden und das"}, {"id": 481, "start": 2855.5, "end": 2861.94, "text": "vergleicht, vielleicht, ja, vielleicht siehst du dann was, keine Ahnung, aber Docker macht"}, {"id": 482, "start": 2861.94, "end": 2869.18, "text": "in der Regel keine Performance-Probleme, weil ein Docker-Container, bzw. die Anwendung,"}, {"id": 483, "start": 2869.18, "end": 2877.78, "text": "die du in einem Container laufen lässt, ein ganz normaler, 50% Packetless, weil dein Docker-Container,"}, {"id": 484, "start": 2877.78, "end": 2882.78, "text": "die Leute stellen sich das immer so ein bisschen als VM vor, das ist es nicht, ein Prozess,"}, {"id": 485, "start": 2882.78, "end": 2887.1, "text": "den du startest in einem Docker-Container ist ein ganz normaler Prozess, also wenn du jetzt"}, {"id": 486, "start": 2887.1, "end": 2891.5, "text": "deine Anwendung auf dem Linux-System startest, oder die Anwendung in einem Docker-Container"}, {"id": 487, "start": 2891.5, "end": 2899.38, "text": "startest, das macht quasi keinen Unterschied, das ist ein ganz normaler Prozess, wie jeder"}, {"id": 488, "start": 2899.38, "end": 2903.82, "text": "andere Prozess auch, der einzige Unterschied ist, dass noch ein paar zusätzliche Kernel-Funktionen"}, {"id": 489, "start": 2903.82, "end": 2908.18, "text": "benutzt werden, nämlich sowas wie Cgroups und Namespaces, dass du beispielsweise der"}, {"id": 490, "start": 2908.18, "end": 2913.46, "text": "Anwendung, die im Container läuft, andere IPs vorgaukeln kannst, oder andere Hausnamen"}, {"id": 491, "start": 2913.46, "end": 2919.3, "text": "vorgaukeln kannst, ein anderes File-System vorgaukeln kannst und solche Geschichten,"}, {"id": 492, "start": 2919.3, "end": 2926.22, "text": "die Performance, also wir reden hier von CPU und sowas, nicht zwangsläufig von Netzwerk"}, {"id": 493, "start": 2926.22, "end": 2934.22, "text": "und IOU, macht keinen Unterschied in Docker und auch in der VM, weil die Leute ja da immer"}, {"id": 494, "start": 2934.22, "end": 2939.7, "text": "ein bisschen Bedenken vor haben, ah, VM, Docker, also eine VM hat, was CPU-Leistung angeht,"}, {"id": 495, "start": 2939.7, "end": 2945.14, "text": "nahezu keinen Overhead, ihr könnt einen Benchmark laufen lassen, lasst ein Prime95 Benchmark"}, {"id": 496, "start": 2945.14, "end": 2950.28, "text": "laufen in der VM, versus auf eurem Host, ihr werdet feststellen, die Werte sind nahezu"}, {"id": 497, "start": 2950.28, "end": 2956.78, "text": "identisch, was bei der VM das Problem ist, bzw. warum man sagt, VMs brauchen mehr Ressourcen,"}, {"id": 498, "start": 2956.78, "end": 2964.14, "text": "ist, VMs brauchen deutlich mehr RAM, warum? Naja, weil ein komplett eigenes System gestartet"}, {"id": 499, "start": 2964.14, "end": 2971.42, "text": "wird im Hintergrund, also VMs brauchen mehr RAM und mehr Disk im Endeffekt, weil Disk,"}, {"id": 500, "start": 2971.42, "end": 2978.06, "text": "glaube ich, zu vernachlässigen ist, aber RAM. VMs brauchen einfach mehr RAM, weil ein komplett"}, {"id": 501, "start": 2978.06, "end": 2982.9, "text": "eigenes System mit eigenem Kernel, mit eigenen Livesports, alles hochgefahren werden, du"}, {"id": 502, "start": 2982.9, "end": 2989.98, "text": "kannst natürlich ein Minimalsystem nehmen, dann kommst du vielleicht, äh, tja, mit minimalstem"}, {"id": 503, "start": 2989.98, "end": 2995.66, "text": "Overhead aus, aber eine VM hat immer, was RAM angeht, einen gewissen Overhead, um den"}, {"id": 504, "start": 2995.66, "end": 3002.34, "text": "du nicht drumherum kommst, den hat ein Container, nicht CPU-technisch Performance, CPU-Performance-technisch"}, {"id": 505, "start": 3002.34, "end": 3017.66, "text": "ist es überhaupt kein Unterschied. Also, das stimmt, er hat schon Recht, Docker hat im"}, {"id": 506, "start": 3017.66, "end": 3022.14, "text": "Prinzip deutlich weniger Overhead als eine VM, allerdings nicht bei der CPU, also nicht"}, {"id": 507, "start": 3022.14, "end": 3027.7, "text": "unbedingt zwangsläufig bei dem, wo man an Performance denkt, also die CPU-Performance"}, {"id": 508, "start": 3027.7, "end": 3034.34, "text": "zwischen der VM, zwischen dem Host und zwischen dem gleichen Ding im Docker-Container ist"}, {"id": 509, "start": 3034.34, "end": 3040.9, "text": "nahezu identisch, also die CPU-Leistung ist mehr oder weniger das gleiche überall, RAM-Auslastung"}, {"id": 510, "start": 3040.9, "end": 3046.66, "text": "ist ein bisschen das Problem, und wenn es dann um IO geht und Netzwerk, da sieht das"}, {"id": 511, "start": 3046.66, "end": 3051.9, "text": "noch mal anders aus, da muss man eh gucken, gerade wie man die Sachen in der VM anbindet,"}, {"id": 512, "start": 3051.9, "end": 3059.14, "text": "gerade IO-Performance ist in der VM nicht ohne, das kann schon eine ganze Ecke langsamer"}, {"id": 513, "start": 3059.14, "end": 3064.26, "text": "sein, je nachdem, was man da als Virtualisierung nimmt und was man für Anforderungen hat,"}, {"id": 514, "start": 3064.26, "end": 3068.7, "text": "aber bei Docker-Container musst du dir eigentlich keine Gedanken machen, also wenn du ein Prozess"}, {"id": 515, "start": 3068.7, "end": 3074.78, "text": "in einem Docker-Container startest, der hat die gleiche Performance wie auf dem Host,"}, {"id": 516, "start": 3074.78, "end": 3079.5, "text": "es ist ja auch ein ganz normaler Prozess auf deinem normalen Host, deswegen kannst du"}, {"id": 517, "start": 3079.5, "end": 3083.1, "text": "dein Docker-Container beispielsweise auch keine Kernel-Module nachladen oder Kernel-Module"}, {"id": 518, "start": 3083.1, "end": 3086.94, "text": "verwenden die dein Host nicht verwendet oder sowas, es ist der gleiche Kernel wie dein"}, {"id": 519, "start": 3086.94, "end": 3092.7, "text": "Host, das ist keine VM in dem Sinn, also da hast du performanstechnisch keine Unterschiede,"}, {"id": 520, "start": 3092.7, "end": 3098.5, "text": "es ist sogar besser, du kannst deine Docker-Container deutlich einfacher, wenn du es denn bräuchtest,"}, {"id": 521, "start": 3098.5, "end": 3109.7, "text": "wie nennen wir es mal, nicht Rate-Limiten, na, Resource Groups, wie heißt denn das, also"}, {"id": 522, "start": 3109.7, "end": 3115.3, "text": "Ressourcen besser managen, du kannst zum Beispiel relativ einfach sagen, deinem Container benutzt"}, {"id": 523, "start": 3115.3, "end": 3128.42, "text": "maximal zwei CPU-Kerne oder sowas, ok, ich glaube, Leute, ich glaube, ich muss wirklich,"}, {"id": 524, "start": 3128.42, "end": 3138.86, "text": "ich muss den Twitch-Server wechseln, das klappt hier nicht, Vodafone, wie war die Probe-Fahrt,"}, {"id": 525, "start": 3138.86, "end": 3142.42, "text": "also ich war heute Probe-Fahrt, ich bin begeistert, ich finde das Auto wirklich nice, ich muss"}, {"id": 526, "start": 3142.42, "end": 3145.98, "text": "jetzt bloß gucken, ob das dieses Jahr noch klappt, möglich ist es, ich habe heute auch"}, {"id": 527, "start": 3145.98, "end": 3151.74, "text": "mal gefragt, wie es mit Vorführautos aussieht und wie gesagt, wenn es irgendwie hinhaut,"}, {"id": 528, "start": 3151.74, "end": 3155.94, "text": "dass ich es unter 30.000 Euro bekomme noch dieses Jahr, dann kaufe ich es ansonsten nicht."}, {"id": 529, "start": 3155.94, "end": 3171.38, "text": "Was es außer First-Level-Support gibt als Physi, alles andere außer First-Level-Support,"}, {"id": 530, "start": 3171.38, "end": 3179.9, "text": "du kannst alles machen als Physi, wenn du dich damit auskennst, wohlgemerkt, alles, wirklich,"}, {"id": 531, "start": 3179.9, "end": 3185.86, "text": "ich kann dir nicht sagen, was alles ist, weil alles ist alles und alles ist sehr viel, du"}, {"id": 532, "start": 3185.86, "end": 3189.22, "text": "kannst alles mögliche machen, du musst dich halt in den Bereichen ein bisschen auskennen,"}, {"id": 533, "start": 3189.22, "end": 3193.18, "text": "es bringt dir nichts, wenn du eine Physi-Ausbildung gemacht hast und am Ende dich bewirbst als"}, {"id": 534, "start": 3193.18, "end": 3196.86, "text": "Cloud-Architekt und keine Ahnung davon hast, das funktioniert natürlich auch nicht."}, {"id": 535, "start": 3196.86, "end": 3217.54, "text": "Mario, danke für den Sub, ok, wenn wir von Windows-Containern reden, ist das nochmal"}, {"id": 536, "start": 3217.54, "end": 3222.62, "text": "was anderes, Windows-Container sind ja auch keine Container, sondern Hyper-V4Ms, zumindest"}, {"id": 537, "start": 3222.62, "end": 3226.82, "text": "ist das mein letzter Stand, korrigiert mich, wenn ich falsch liege, aber ich glaube, Windows-Container"}, {"id": 538, "start": 3226.82, "end": 3234.74, "text": "sind Hyper-V4Ms, Windows-Container ist also quasi eigentlich kompletter Gebate, der wahrscheinlich"}, {"id": 539, "start": 3234.74, "end": 3240.58, "text": "einfach nur da ist, dass Leute Docker und Windows ausfüllen können, also Docker und"}, {"id": 540, "start": 3240.58, "end": 3247.78, "text": "Windows ist wahrscheinlich eins der bescheuerten Sachen, die man machen kann, da bin ich ja"}, {"id": 541, "start": 3247.78, "end": 3256.86, "text": "mal gespannt, ja, nein, muss nicht, muss gar nicht, es muss im Prozess nichts übersetzt"}, {"id": 542, "start": 3256.86, "end": 3260.58, "text": "werden, wenn du in den Prozess startest, im Container oder nicht im Container, ist exakt"}, {"id": 543, "start": 3260.58, "end": 3265.94, "text": "das gleiche, es macht keinen Unterschied, also wenn du auf die Konsole gehst unter Linux,"}, {"id": 544, "start": 3265.94, "end": 3276.42, "text": "ja, und du sagst hier ausführen, keckel.bin, dann ist es egal, ob du keckel.bin so startest"}, {"id": 545, "start": 3276.42, "end": 3285.38, "text": "oder ob du sagst docker-run-keckel-container, das macht erstmal keinen Unterschied, es ist"}, {"id": 546, "start": 3285.38, "end": 3291.9, "text": "ein bisschen, es ist die Möglichkeit vorhanden, das ein bisschen besser zu sandboxen, aber"}, {"id": 547, "start": 3291.9, "end": 3298.7, "text": "es ist nicht so, als wäre da irgendwie großartig was drum herum, das ist ein ganz normaler"}, {"id": 548, "start": 3298.7, "end": 3307.22, "text": "Prozess, so wie jeder andere auch, ich will es jetzt nicht ausschließen, dass es nicht"}, {"id": 549, "start": 3307.22, "end": 3313.02, "text": "doch irgendwie, wenn man es drauf anlegt, messbar ist, ich meine, theoretisch hast du"}, {"id": 550, "start": 3313.02, "end": 3320.1, "text": "natürlich so die Möglichkeit mit Cgroups und sowas, Ressourcen-Limitierungen vorzunehmen,"}, {"id": 551, "start": 3320.1, "end": 3324.54, "text": "das heißt, da gibt es irgendwelche API-Funktionen, um das machen zu können, das heißt, wenn"}, {"id": 552, "start": 3324.54, "end": 3328.98, "text": "man das machen kann, hat es vielleicht, auch wenn man das nicht macht, irgendwie rein theoretische"}, {"id": 553, "start": 3328.98, "end": 3334.54, "text": "Performance einbußen, aber ganz im Ernst, mich würde es wirklich wundern, wenn einer"}, {"id": 554, "start": 3334.54, "end": 3338.5, "text": "das benchmarkt, und wir reden, der müsste das wirklich benchmarken, da müsste irgendjemand,"}, {"id": 555, "start": 3338.5, "end": 3343.5, "text": "keine Ahnung, Prime95 auf den 24 Kerne laufen lassen in docker und ohne docker, mal für"}, {"id": 556, "start": 3343.5, "end": 3348.78, "text": "24 Stunden und dann am Ende gucken, was kommt raus, oder was man heutzutage nimmt, ich weiß"}, {"id": 557, "start": 3348.78, "end": 3353.02, "text": "nicht, ob Prime95 schon angesagt ist, und ja, vielleicht ist es in irgendeiner Art und"}, {"id": 558, "start": 3353.02, "end": 3356.46, "text": "Weise dann messbar, aber nicht, dass es irgendeine Relevanz hätte."}, {"id": 559, "start": 3356.46, "end": 3370.98, "text": "Ja, gut, du hast ein Overhead, was Libraries und Images angeht, ja, das ist okay, das ist"}, {"id": 560, "start": 3370.98, "end": 3375.58, "text": "was anderes, aber nicht performanstechnisch, und ihm ging es ja hier hauptsächlich, dass"}, {"id": 561, "start": 3375.58, "end": 3380.54, "text": "er bedenkt, allwegen Performance im Container, und mir geht es hier rein um Leistung, und"}, {"id": 562, "start": 3380.54, "end": 3391.42, "text": "das ist wurscht, und ja, und ganz ehrlich, ja, das ganze Container Zeug, und gerade auch"}, {"id": 563, "start": 3391.42, "end": 3395.62, "text": "was Kubernetes angeht, und docker angeht, und viele Cloud Sachen sind in Go programmiert,"}, {"id": 564, "start": 3395.62, "end": 3401.54, "text": "aber das heißt bei weitem nicht, dass man Software in Containern am besten in Go programmiert,"}, {"id": 565, "start": 3401.54, "end": 3405.54, "text": "überhaupt nicht, genau das Gegenteil, mach dir überhaupt keine Gedanken darüber, dass"}, {"id": 566, "start": 3405.54, "end": 3408.78, "text": "das im Container läuft, sondern programmier das mit dem, was du am besten kannst, was"}, {"id": 567, "start": 3408.78, "end": 3414.02, "text": "dein Team am besten kann, und dann packst du es am Ende in Container rein, ich mein gut,"}, {"id": 568, "start": 3414.02, "end": 3417.14, "text": "wenn man weiß, dass man das in der Cloud laufen lassen will, wenn man weiß, dass man das"}, {"id": 569, "start": 3417.14, "end": 3421.94, "text": "vielleicht mit irgendeinem Orchestrator oder was auch immer laufen will, oder als Microservices,"}, {"id": 570, "start": 3421.94, "end": 3426.98, "text": "im Hinblick auf dessen sollte man das schon entwickeln, aber nicht die Programmiersprachen"}, {"id": 571, "start": 3426.98, "end": 3432.38, "text": "Ausfall davon abhängig machen, du kannst containerisierte Microservices in jeder Programmiersprache"}, {"id": 572, "start": 3432.38, "end": 3440.26, "text": "entwickeln, wahrscheinlich sogar Cobol, so hat sich das jetzt mal beruhigt, Alter 65%"}, {"id": 573, "start": 3440.26, "end": 3462.34, "text": "Package Loss, Mann, ja, das stimmt, so, habe ich große Einbußen, wenn ich jetzt mal ein"}, {"id": 574, "start": 3462.34, "end": 3467.42, "text": "Web Server nativ im Container laufen lassen, tja, das kommt drauf an, also, wenn du rein"}, {"id": 575, "start": 3467.42, "end": 3473.06, "text": "die Performance meinst, was das Ding, was weiß ich, CPU, Performance, sonst was, nein"}, {"id": 576, "start": 3473.06, "end": 3478.14, "text": "hast du nicht, du hast quasi keine Einbußen, netzwerktechnisch musst du dir aber Gedanken"}, {"id": 577, "start": 3478.14, "end": 3482.58, "text": "machen, also wenn du wirklich, wenn du einen Web Server im Container laufen lässt, wo es"}, {"id": 578, "start": 3482.58, "end": 3488.18, "text": "wirklich richtig brummt, also wir reden hier von, keine Ahnung, Gigabitweise, also wenn"}, {"id": 579, "start": 3488.18, "end": 3494.78, "text": "es da richtig abgeht, dann würde ich mir überlegen, wie ich das Netzwerk mache, und"}, {"id": 580, "start": 3494.78, "end": 3504.9, "text": "zwar, kurz ein bisschen leiser machen, und zwar würde ich dann mal überlegen, ob ich"}, {"id": 581, "start": 3504.9, "end": 3509.1, "text": "das wirklich mit diesem Standard Docker Proxy mache, also Docker Proxy, Proxy, das ist ja"}, {"id": 582, "start": 3509.1, "end": 3514.9, "text": "standardmäßig, es gibt aber verschiedene Möglichkeiten, wie man Docker Netzwerk machen"}, {"id": 583, "start": 3514.9, "end": 3519.1, "text": "kann, ja, du kannst auch direkt eine Netzwerkkarte verwenden, oder direkt das Bridge in ein Haus,"}, {"id": 584, "start": 3519.1, "end": 3522.38, "text": "das würde ich mir dann überlegen, also wenn du so eine, wenn du eine Netzwerkanwendung"}, {"id": 585, "start": 3522.38, "end": 3526.58, "text": "hast, die wirklich mega krass Traffic hat, dann würde ich es vielleicht nicht über"}, {"id": 586, "start": 3526.58, "end": 3533.58, "text": "das Standard Docker Networking mit dem Proxy machen, aber ansonsten, was Performance angeht,"}, {"id": 587, "start": 3533.58, "end": 3537.58, "text": "hast du da keine, du hast, du hast nicht nur keine großen Einbußen, du hast im Prinzip"}, {"id": 588, "start": 3537.58, "end": 3538.58, "text": "keine Einbußen."}, {"id": 589, "start": 3538.58, "end": 3545.3, "text": "So, was sieht es denn jetzt aus, ok Leute, ich wechsle jetzt den Twitch Server, dass"}, {"id": 590, "start": 3545.3, "end": 3549.34, "text": "wir uns heute noch das Battlefield Video angucken können, und dann hoffen wir, dass es funktioniert,"}, {"id": 591, "start": 3549.34, "end": 3555.1, "text": "weil ich kann auch nichts machen, wenn Vodafone mir das sagt, sagt Vodafone halt, ja, und"}, {"id": 592, "start": 3555.1, "end": 3559.18, "text": "das ist natürlich auch ein großer Vorteil, da hat er schon recht, da hat Sarix in dem"}, {"id": 593, "start": 3559.18, "end": 3564.54, "text": "Fall schon recht, wenn du die Sachen so baust, dass sie unabhängig voneinander sind, und"}, {"id": 594, "start": 3564.54, "end": 3569.3, "text": "unabhängig voneinander, wenn du sie gut kontinuerisieren kannst, spricht das meistens dafür, dass"}, {"id": 595, "start": 3569.3, "end": 3575.98, "text": "sie nicht so, wie sagt man, nicht so tightly coupled, koppelt, wie sagt man das, also dass"}, {"id": 596, "start": 3575.98, "end": 3580.46, "text": "sie nicht so eng miteinander verbunden sind, dass das eine quasi zwangsläufig darauf laufen"}, {"id": 597, "start": 3580.46, "end": 3585.42, "text": "muss, wo das andere läuft, also wenn du deine Anwendung ein bisschen entkoppelt konstruiert"}, {"id": 598, "start": 3585.42, "end": 3591.14, "text": "hast, und diese gut kontinuerisieren kannst, dann ist das hier natürlich ein Wahnsinns-Vorteil,"}, {"id": 599, "start": 3591.14, "end": 3597.06, "text": "weil wenn du wirklich mal in die blöde Situation kommst, dass du jetzt anstatt, wie man früher"}, {"id": 600, "start": 3597.06, "end": 3601.54, "text": "gemacht hat, ich habe 3 Applikationsserver vms, und wenn wir mehr Last brauchen, muss"}, {"id": 601, "start": 3601.54, "end": 3609.06, "text": "ich erst nochmal ein paar neue aufbauen, richtig, genau, und das ist halt wirklich ein Vorteil,"}, {"id": 602, "start": 3609.06, "end": 3614.38, "text": "da kannst du einfach sagen, wie auf dem Load Balancer ist die Last über 80%, meistens"}, {"id": 603, "start": 3614.38, "end": 3619.82, "text": "machst du das ja schon vorher, oder Load Balancer ist die Last über 50% oder die Connections"}, {"id": 604, "start": 3619.82, "end": 3624.58, "text": "über so diesem Limit, wir machen einfach 3 neue Container, und lassen die verteilen"}, {"id": 605, "start": 3624.58, "end": 3630.26, "text": "auf die Cluster, das ist natürlich wahnsinnig geil, wenn das funktioniert, in dem Fall,"}, {"id": 606, "start": 3630.26, "end": 3634.82, "text": "so, okay moin, Leute, ich bin in 2 Minuten wieder da, also ihr könnt gleich nach einer"}, {"id": 607, "start": 3634.82, "end": 3639.06, "text": "Minute F5 drücken, ich werde jetzt den Stream ausmachen, ich mache den Stream wieder an,"}, {"id": 608, "start": 3639.06, "end": 3641.82, "text": "suche meinen anderen Twitch-Server aus, und wir hoffen, dass es funktioniert, wenn es"}, {"id": 609, "start": 3641.82, "end": 3645.14, "text": "nicht funktioniert, haben wir wahrscheinlich gelitten, und wir müssen mit lag leben noch"}, {"id": 610, "start": 3645.14, "end": 3650.22, "text": "für eine Stunde, aber gucken wir mal, ich bin gleich wieder da."}]}