{"text": "wie es jetzt läuft. Aha das sieht besser aus. Guck dir mal da es funktioniert. Easy. Easy.Bisschen lauter Sound oder? Alter der Sound ist mega lauter. Twitch Routing Outplayed. Okfunktioniert. Nice. Ich benutze übrigens jetzt den Service in Amsterdam. Was? Was ist jetzt los?Was ist jetzt los? Ok ich glaube es funktioniert. Also danke Rede. Kurzer Sinn wir gucken uns jetztdas neueste Battlefield Video an. Nochmal von vorne. Und wir machen das Video mal kurz mal hier den.Auf gehts. Das Video ist total leise. Ok. Ja ich hab tatsächlich Zero Hour Enjoyed für zwei bisdrei Tage. Danach war die Luft raus. MonkaW. By the way wir reden hier davon. Die tut so alswäre das wahnsinnig viel Content und sonst was. Das ist alles die gleiche Map. Ja also es ist jetztnicht so als wären das drei verschiedene Maps oder das erste war eine Portal Map. Ok das istalles die eine gleiche Map. Das ist auch die gleiche Map. Das ist die Portal Map. Das ist diezwei Map. Und das alles in sechs Minuten zwanzig. Da bin ich mal gespannt. Also entweder gibt's danix oder da gehts jetzt wirklich Schlag auf Schlag. Da bin ich gespannt drauf. Ok Leute die schmeißendie Specialists nicht raus. Ich sag euch wie es ist. Die schmeißen die nicht raus. Die Leutehoffen das aber die schmeißen die nicht raus. Die zeigen es auch schon viel zu viel. Sind siedoch schon? Hä? Moment. Sind sie doch schon? Die Specialists haben doch alle eine klassischeBattlefield Klasse associated. Haben sie doch schon? Ok mal angucken. Wie gesagt das sind siedoch schon. Ich glaube es steht doch schon mittlerweile dran dass es ein Assault Specialist ist. Ah okdas ist neu. Ok es gibt Traits die man aus... Ja gut aber das Gadget ist doch immer noch dasgleiche. Ich mein Webstar ist der Typ mit dem Grappling Hook. Sunnets ist die mit dem Wingsuit.Die haben doch bestimmt nicht das neu modelliert und animiert das Webstar jetzt mit dem Wingsuitrumfliegen kann. Das heißt diese Specialist Traits sind jetzt das was du sharen kannst.Open Gadgets sind jetzt auch schon open. Ok ich mein ich finde das gut dass sie das mehrsichtbar machen dass die jetzt schon wohlgemerkt jetzt schon eingeteilt sind in genau dieseKategorien. Das ist ja nichts neues also diese die Specialist haben jetzt schon genau dieseEinteilung. Wobei ich mir bei den zwei gar nicht sicher bin ob die da überhaupt... Also wie gesagtdie haben jetzt also das hier sind Assaults. Das waren schon immer Assault Specialist. MariaFalk war schon immer Support, Medic ja das ist nichts neues. Was jetzt anscheinend neu ist sindTraits also sprich du kannst die Traits zwischen diesen drei Specialist dann sharen. Ok aber sagman mal so das primäre von also diese die die also diese primären Sachen die Specialist ausmachenalso sprich dass er einen Grappling Hook hat und das jetzt muss ich aufpassen dass ich nichtsfalsches sage ich glaube sie einen Wingsuit hat bzw. Fragmentation Granaten und sowas und dassdas er ein Schild hat hier das wird ja weiterhin so bleiben also eigentlich hat sich bis auf dieTraits nichts geändert oder sehe ich das falsch also im Prinzip ist es immer noch das gleiche.Ich bin mal gespannt ich meine die die Season startet bald irgendwie in 14 Tagen oder so könnenwir es ausprobieren aber wie gesagt ich also im Prinzip ist das mehr oder weniger das gleichebis auf die Traits. Die sind jetzt auch schon also diese Einteilung hier unten gibt es dochjetzt auch schon das ist nichts neues ich bin mir nicht sicher ob es so dran steht aktuell schonich habe das Game auch nicht mehr installiert aber die Einteilung ist jetzt auch schon so okNächstes Jahr! Nächstes Jahr! Nächstes Jahr! Keckl! Ich dachte das kommt jetzt mit Season 2 man! NächstesJahr ok alles klar nice top! Season 3 man! Ok nicht nächstes Jahr vielleicht zu Weihnachtenoder so. Ich weiß nicht wann war Season 1 Release? Sekunde das muss ich mir jetzt gerade mal angucken.Was ging das los? Ah ok vor drei Monaten. Das ist Ende des Jahres nächstes Jahr! Meine GüteAlter was machen die den ganzen Tag? Ich finde das prinzipiell gut aber das ist jetzt keineriesen Änderung ja weil wie gesagt die Specialist sind schon so gruppiert das ist rein eine optischeSache jetzt kommen halt noch die Traits dazu die geshared werden können das finde ich prinzipiellnice aber das macht aus dem Specialist System jetzt kein Klassen System wie es die Leute wollenja das stimmt ich finde die dinge die die Specialist sehen halt jetzt halt nicht ausals passen in das Game wisst ihr aber was das größte Problem ist die Models sind schlichtoder greif nicht fertig die haben ja kaum Details guckt euch das mal an die sehen alle aus die habenalle falsche Beleuchtung irgendwie im Gesicht es sieht überhaupt nicht fertig fertig gemodeltaus diese Dinger das ist das eigentliche Problem was ich mit den Specialist habe die sehen so auswie irgendwelche nicht ok Plays Halter Models ist jetzt zu hart du siehst schon dass da Leutedran gesessen haben die wissen was sie machen ja aber die sehen halt einfach nicht fertig ausAlter Boris mann Boris weint gleich was ist denn mit Boris los Alter Boris mann wisst ihr wisst ihrwie Boris aussieht Boris sieht ein bisschen aus in diesem wenn er so als wieder Windows 11 Präsentatorkennt kennt kennt ihr noch die Windows 11ich finde der neue Boris hat gewisse Ähnlichkeiten zu dem Windows 11 Präsentator oder ein bisschenein bisschen ähnlich sehen die sich schon ok guck mal fertig meine Maus legt chat wer von euch ist eswer wer lässt meine Maus legen gibt zu gibt euch zu erkennender Schreiker ist es bestimmt der ist Kubernetes Admin die machen sowasden aus Mauszeiger ja ok guck mal weiterok wer wirklich besser aussieht muss man sagen ist jetzt die die Radar Radar Specialist hin weildas Modell von der fand ich dieser vorher dieser übrigens in game auch nicht so aus ne die hat ingame viel mehr Pausebäckchen Pausbäckchen gehabt als hier weil dieser wirklich unfertig aus dassieht tatsächlich das hat irgendwie auch ein paar Kanten so und ansonsten haben sie den einfach einbisschen bisschen Dreck ins Gesicht geschmiert und das ist jetzt halt viel besser und dunkler und sodas war es mit den Prime Abos MonkaSalso wenn in dem Tempo weitermachen kriegen wir tatsächlich alle vierdinger man muss halt mal sagen mit Gameplay hatte das bis jetzt noch relativ wenig zu tun es gibtjetzt halt im Prinzip genau das gleiche wie vorher nur noch zusätzlich Specialist Trades dieman in der gleichen Klassen Kategorie scheren kann ok ja das ist schon core Gameplay das passtwann kommen Klaasers zurück gar nicht hat sie gerade gesagt dass die Battlefield 3 M16 auchmit dem Ding hinten dran zwei zwei Waffen plus noch mal zwei aus dem Season Update das heißtvier Waffen und zwei davon sind alt ich mein gut dass es mehr Waffen gibt das Spiel hat prinzipielldeutlich zu wenig Waffen wir dürfen nicht vergessen das ist aber Sachen Portal Content die seitRelease im Prinzip drinne ist also dafür müssen die gar nichts machen das ist alles schon dajetzt bin ich tatsächlich mal gespannt weil wenn sie in dem Tempo weitermachen habe ichausgerechnet was ich was ich nicht mit eingerechnet habe ist die DLC Maps aber von denen gehen wirein oder die Season Maps von denen gehen wir einfach mal von aus dass die gescheit sind ichhabe das mal vorhin ausgerechnet also wenn die in dem Tempo weitermachen wie sie jetzt weitermachendann haben wir in eineinhalb Jahren nach Release ungefähr die Launch Maps in einem brauchbarenZustand es ist jetzt nicht so dass diese Anpassung wahnsinnig große Ressourcenfresser sind ichmeine diese diese Container sind die gleichen Container die sie seit Battlefield 2 haben oderso und hier die haben sie hier wahnsinnig viele tolle neue Assets für bauen müssen dass dasfunktioniert aber wisst ihr was man finde ich an diesem Ausschnitt wirklich gut erkennt guckteuch das mal an was man hieran sieht ist die mehr die Maps die waren schlicht und ergreifend nichtfertig zu Release meine das ist glaube ich mittlerweile jedem klar dass das Game zu Releasenicht fertig die Maps waren schlicht und ergreifend nicht nicht fertig so sieht das deutlich mehr nacheiner Battlefield Map aus ich finde es halt ein bisschen schade dass man jetzt den einfachstenWeg gewählt hat und dort irgendwelche Gerüste Kisten und Sandsäcke hinstellt aber nicht dassdu trotz ich meine es passt zum Szenario aber ansonsten es ist einfach es fehlt einfach allesan Details auf dieser Map an Deckung an guter Spielbarkeit eben dadurch dass du über so vieleoffene Flächen liefst ja und auch guckt euch den Boden an der Boden sah halt einfach immer viel zuviel zu sauber und unfertig aus also du siehst einfach die Dinger waren nie fertig zu nie undimmer fertig zu release alle Maps brauchen den Overhaulorbital orbital ist die Map mit der Rakete die sie am Anfang so ausführlich gezeigt haben weiles die einzige Map war die irgendwie ein cooles Feature hatte so mit der Rakete jetzt siehst duhalt mal richtig diese Maps waren nie fertig das könnte jetzt eins zu eins irgendwie so eine Basein Firestorm oder so sein die Maps waren nicht fertig die waren mitten in der die wurden mittenaus der Entwicklung gerissen und released es ist jetzt bestimmt nicht der super geilste Weg daüberall Kisten hinzustellen wie gesagt es passt ja wahrscheinlich haben sie die sich gerade nochim Unreal Asset Store gekauft und importiert weil Kisten und Salzsäcke findest du bestimmt zugenüge aber ich meine jetzt sieht das jetzt jetzt sieht das irgendwie nach einer normalenBattlefield Map aus ja es ist das jetzt ist das ok jetzt jetzt hat es auch geblieben guck mal duhast jetzt auch zum ersten mal so ein bisschen Details teilweise auf der Straße also das istschon in Ordnung ja so das sieht ich meine es ist die billigste Variante überhaupt ja mitmit diesen Kisten und Containern und Planken und Warnhütchen und so aber so stelle ich mireher eine Battlefield Map vor aber was halt was halt da auch immer mich ein bisschen verwirrtist ich mein warum braucht man da acht Monate füres ist jetzt ja kein großer Akt da Kisten hinzustellen oder so das machst du jetzt malin zwei Wochenenden Container machen keinen Sinn das ist korrekt deswegen ist ja das ist diebilligste Variante das erinnert mich an Half-Life Maps falls jemand Half-Life Maps von früher nochkennt ganz viele Half-Life Maps hatten Container und Kisten und Blöcke und sowas und das lagdaran weil Half-Life halt selbst saumäßig viele Kisten Blöcke und Absperrungen und Containermitgebracht hat weil eben das Half-Life Szenario vieles hatte dass ganz viele Maps die die Leuteerstellt haben bestanden zu 80 prozent aus Containern weil halt die Asset schon drin waren undes sieht tatsächlich ein bisschen aus wie eine Half-Life Map die Container an der Stelle machenüberhaupt keinen Sinn man hätte wenn man sich wirklich also das hier unten finde ich okay dasist quasi so eine Befestigung für diesen Punkt das ist in Ordnung was ist eigentlich mit derStraßenaufschrift war die ja die war vorher da das ist okay was ich halt hier die Container ergebentatsächlich relativ wenig Sinn hätte man die Map vielleicht ein bisschen anders gebaut anders hätteman da auch was anderes machen können aber den ist halt den drei Leuten die da noch dran arbeitenist halt nichts eingefallen aber mir ist es so immer noch lieber als im Standardzustanddie haben die haben eine Konzeptzeichnung gebraucht wie jeden Container wahrscheinlichja sonst deswegen hat es so lange gedauert. Hey das sieht jetzt mal irgendwie nach einemUntergrund aus den irgendjemand nicht aus einem Random Generator raus hat sondern sich auch malbisschen was überlegt hat bei ja man könnte Klohäuschen hinstellen zum Beispiel was halthier von Klohäuschen Klohäuschen sind eh wahnsinnig unterrepräsentiert auf diesen Maps finde ichKlohäuschen und natürlich bitte schön auch drei weil MWD das muss schon alles korrekt seinist überall die selbe Nummer auf den Containern wirklich tatsächlich ist mir gar nicht aufgefallen171 gut man kann halt sagen das ist der Hersteller oder so aber ja es ist das ist schon billig ichbin mal gespannt was sie uns zu neuem Content zeigen. By the way die haben noch nichts vonSeason 2 gezeigt das hier ist jetzt quasi der Rework der mit Season 2 kommt aber wir haben nochnichts gesehen von Season 2 zumal Season 2 noch glaube ich in 14 Tagen oder so fast schon startetoder drei Wochen ich meine das hätte man schon da hätte man schon ein bisschen kreativer seinkönnen ich meine das ist ja irgendein Bürogebäude ja dann hätte man was weiß ich Schränkeirgendwelche alten Computersachen oder was auch immer dafür sind Map Designer da. Mein Kistenist halt wirklich das einfachste was du machen kannst. Ich meine es ist Battlefield deswegenpasst es halbwegs noch dass man so befestigte Stellung macht. Ist okay. Ja ich mein man hätteja durchaus man hätte also wenn man sich Mühe gegeben hätte es gibt ja wenn ich mir jetzt malrecht wenn ich mir mal wirklich recht Gedanken mache man hätte da schon machen können ja manhätte zum Beispiel hier einen Fahrstuhl hin machen können der Fahrstuhl ist aber hier durchdie Decke gebrochen oder irgendwie sowas ja man hätte beispielsweise dann Deckung machen könnenkeine Ahnung hier ist was durchs Fenster gecrasht und liegt jetzt hier oder wisst ihr sowas derhätte man halt ein bisschen bisschen mehr Aufwand gebraucht und ein bisschen mehr sich Gedanken machenmüssen oder es wäre dann halt auch nicht mit mit Copy Paste bestehender Sachen getan gewesen manhätte guckt mal zum Beispiel so ein Ding hier ja so ein Ding hier hätte man hier hinstellen könnenauf der einen Seite kaputt machen und hier rein brechen lassen können durchs Dach zum Beispielsowas also oder oder ein paar irgendwas da gäbe es durchaus Möglichkeiten wenn man gewollt hätteok hier sieht man eine Sache gut dran was mich schon immer gestört hat seit Release auf denBattlefield Maps auf den Battlefield 2042 Maps diese Maps sahen viel zu clean aus für BattlefieldMaps guckt euch das mal an die sahen deutlich zu clean aus so ist das tatsächlich finde ichdeutlich besser wobei man halt sagen muss das sind dann auch wieder nur Kisten und Sandsäckeim Endeffekt aber ok es sieht schon besser also sieht naja besser ich weiß nicht ob wir besserdenken besser aber ich meine dass man zumindest mal Spuren und ein bisschen Details auf den Straßenhat ist schon ist schon die Sandsäcke sind hier passt aus alles dadass sie das ist besser das ist besser ich weiß macht zwar keinen Sinn dass die Sandsäcke undkonnte ok das sieht jetzt wenigstens mal aus nach irgendwas wo was gearbeitet wurde ja wo waspassiert ist und nicht einfach nur nach einer ungefährte unfertigen Map der Sinn dieses Tunnelshier hat sich immer noch entschlossen da diese Halo Tunnel wo man mit dem Auto durchfährtdie haben so viele Container auf ihren Maps die haben sogar schon Kubernetes hast rechtcloud native Battlefield warum schaut man sich das noch an du meinst warum ich mir das Videoanschaue oder warum es immer noch leute gibt die das spielen also ich denke mal das liegt darandass leute das noch spielen weil es viele leute gibt wie ich die gerne Battlefield spielen undhoffen dass da mal was gescheites kommt Video anschauen da weil ich wissen will was ich datut wir haben den Kram alle gekauft und ich finde es tatsächlich immer noch spannend was darauskommt ich habe die Hoffnung zwar aufgegeben dass da am Ende wirklich was gutes spielbaresrauskommt aber es interessiert mich trotzdem was rauskommt und sei es nur dass ich drüberlästern kann dass nichts gescheites rauskommt. Moment die Türme sind wegman hat einfach alles man hat einfach steht da auch überall 71 auf den Containern daswürde ich jetzt gerne sehen ob da überall 71 drauf steht wie auf den anderen Containernich mein das ist halt wirklich sehr billig muss man sagen das ist wirklich billigguck dir das ist wirklich billig ich meine die haben einfach ganz viele Dinger genommen undwild hier drüber copypasted man muss sagen ja man sieht sie haben sich ein bisschen Gedankengemacht es hat schon mal zumindest einer kurz fünf Minuten überlegt wie hier Sachen platziert sindman gescheite Deckung von hier nach hier hast immer noch nicht aber vielleicht will man das auch nichtdu siehst es hat sich schon eine Gedanken gemacht hier kannst du eindeutig drübergucken vermuteich mal bin mir gar nicht so sicher aber wenn gehe ich mal was rübergucken ein und seit abhier drüben auch hier kannst du rausgucken hier kannst du zumindest relativ schnell ja also hates mal zumindest einer sich ein bisschen Gedanken drüber gemacht aber die Umsetzung ist halt wirklichbillig die Umsetzung ist wirklich billig da wurde einfach nur krass copypasted as fuckwas hältst du von clash auf ernsthaft nix mobile crap alterne nix mit mobile games kannst du mich nicht schockenthe removal of those two as capture points we've added a new capture point on 128 layer hast dukein handy ich habe sogar drei handys aber da kommt kein mobile game drauf stimmt gar nichtvier sind ja mittlerweile hier sind ja sogar weird flex ja sind ja sogar vier mittlerweile128 layout aber ich benutze davon nur eins on the hills giving more to fight over between the crawlaway and refinery on the refinery side was passiert da unten mit dem gras leute was passiertguckt euch mal das gras an was passiert hier gerade mit dem gras und refinery ist das level of detailsachen die rein ploppen oder man sieht man sieht so in der animation gescheit in the crawl awayand refinery an die settings hätte man ja für die videoaufnahme mal wenigstens umstellen könnenseit wann ist kein das ist so weil es weil ich das jetzt so entschieden habe allerdingslull weh ist immer noch das unangefochten beste lach emotewas benutzt als main handy an iphone 11 warum warum kann ich dir ganz einfach sagen weilich das von der firma gestellt bekommen und ich selbst kaufen musslull e zwar ein lull was hat lull e lull e ffz nee das ist ein forsen emotelull p ist zu krassgucken wir mal gibt es gar nichtwas soll das seindoch gibt esok komm moment jetzt bin ich mal gespannt was machen sie denn hier jetzt hier stehennoch schon so viele container lasst mich raten sandsäcke und und beton blöckesandsäcke und beton blöcke wer hätte das machen können und mehr container wird aber langsam engfür neue neuen content den sonst zeigen wollen die area changing up the sightlines to improvethe infantry experience and adding tighter barriers to slow down vehicles kisten und beton blöckehey mal wirklich strukturelle änderungen an der map prog dafür musste der entwickler voneinem anderen game abgezogen werden dafür wahrscheinlich das hat der praktikant alleinnicht alleine hinbekommen es gibt tatsächlich neue laufwege das finde ich gut die beleuchtungsieht auch deutlich besser aus guckt euch das immer an hier so und jetzt mit dem hier findeich sieht deutlich stimmiger aus ja das ist das ist gut guckt guckt euch diese map an es kann mirdoch keiner sagen diese map war fertig zu release die sind so steril und unfertig aus und jetztpasst auf jetzt kommen jede menge container dazu aber ok man immerhin besser als als nix ja momentes kam noch ein loch in der straße dazu nicht nur container es kam container in mengen dazu aber eskaum auch ein loch in der straße dazu das konnten sie aber wahrscheinlich auch copy pasten vonirgendwo anders kriegst helping to keep guck mal hier auf dem runway sind jetzt jede menge kaputtepanzer und löcher Leute das sind doch alles die gleichen löcher das sind exakt die gleichenlöcher das sind alles die klein oder oder dass die gleichen löcher alles oder haben sie dieleicht variiert intensity high that these two infantry heavy flags with adjustments to the nearbyterrain helping to make sure ok ich sag nix das sind nicht alles die gleichen löcher die copypasted werden oder you can attack these flags from more angles than before but our main focus forthe map has been helping to improve cover and combat across the crawl away with a lotja das sieht jetzt schon sehr sehr gezwungen aus hier also sehr so fack wir mussten was machen wirwissen nicht was wir machen sollen also das ist einfach ja ich meine es sieht besser aus wiees sieht jetzt mehr nach einer battlefield map aus ja aber da hätte man doch so viel mehr machenkönnen wenn man wenn man sich mühe gegeben hätte man hätte vielleicht teile vom hauseinstürzen lassen können also schon im vorfeld die da drüber liegen oder vielleicht irgendwelchelk man könnte ja beispielsweise wunderbar ein lkw hin machen der eine der eine raketenstufebeispielsweise zum launchpad zieht oder so und kaputt ist belegt euch das mal nehmt ihr irgendwieso eine so eine so eine raketenstufe legt ihr auf ein lkw sowas hier legt ihr auf ein lkw transporterund lasst den mal mit so einem doppelten transporter legt die launchstufe ist ja nach hier vorne daslaunchpad ist ja nach hier vorne und da hätte man den hier platzieren können in der mitte dashätte irgendwie gepasst dann hätte man sich vielleicht hier überlegen können vielleichtmacht mir nicht einfach einen hügel hin sondern man setzt das haus ein bisschen vor ja solchesachen also ich denke mit ein bisschen mehr engagement hätte man da das deutlich schönermachen können als das rein copy paste ich sehe schon komm ich muss glaube ich morgen neues videodazu machen und da werde ich mir den hasse der paar verbliebenen battlefield fans wieder zuziehenaber ok was sei es drum ich meine es ist ja wahr es ist es ist ja wahr kann ja keiner gibt's janichts groß weg zu diskutieren kann ja keiner wirklich behaupten das wäre hier peak peak mapdesign das mag für die spielbarkeit auf jeden fall gut sein aber bei gutes map design heißtspielbarkeit und optik geht hand in hand das ist ein bisschen was was beispielsweise dievalorant maps die die ich kenne die ich gesehen habe nicht gut hinbekommen die mögen spielbarsein aber die gehen nicht gut hand in hand mit der umgebung so was ist twitter post von wasso ein work in progress changesja das haben wir gerade schon gesehenist das eigentlich so schwer in der engine was umzubauen also ich kann dir nur meinennoob eindruck da jetzt sagen weil keiner von uns hat hier mit frostbite gearbeitet aber ganzim ernst wenn es so schwer wäre da was drinne zu platzieren dann könnten sie darin keine gamesentwickeln ich meine vielleicht sind die tools nicht so geil wie man das aus aus unreal oderso kennt aber ich aber mal ein vergleich ein vergleich ich habe früher gerne half life mapsgemacht ich war nie wirklich so krass gut dass meine maps irgendwo gespielt wurden oder so jaaber ich habe gerne half life maps gemacht einfach weil ich es cool fand zu sehen wasman selbst bauen kann und das hättest du damals in worldcraft nannte sich das in half life annichts mehr mit minecraft zu tun worldcraft das hast du damals in worldcraft in paar minutengemacht sowas gar nicht ob es da gescheite gescheite bild davon gibt ja guck hier kistenluftung schächte also was hast du auch ein paar hast du auch in paar minuten gemacht damals imhalf life editor hier solche dinge platziert und wenn du sowas damals schon easy as fuck gemachthast natürlich nicht auf solchen riesen riesen das ist der eins zu eins cscone zwischenteilighatten ihren hammer editor nicht weiß gar nicht wie das jetzt heißt tatsächlich das sieht immernoch so aus ja damals ist das worldcraft und da wie gesagt ich hab ich hab gerne half lifemaps gemacht damals und dort fertige assets zu platzieren war easy copy paste blub blub blubmoment ich muss die musik ausmachen sonst äußerst verwirrend wenn mario musik im hintergrund läuftdie können keine mod tools freigeben die haben keine mod tools die haben nur ihre eigenen toolsund die sind glaube ich so scheiße da drin will keiner mods entwickeln spiele wo das gut funktioniertsind so sachen wie beispielsweise half life 1 und 2 weil die die tools die sie verwendet haben umdas spiel zu entwickeln auch als mod tools released haben bzw wahrscheinlich schon inder entwicklung auch ein bisschen darauf geachtet haben dass die tools später freigegeben werdensoll ich glaube mit den frostbite tools will von uns keiner was entwickeln was hältst du von einerportfolio webseite das ist jetzt so ziemlich aus dem nichts aber für was für dienstleistung diedu anbietest oder wie oder was oder dann mach also verstehe ich nicht was soll ich dazu sagen wenndu was verkaufen willst oder werbung für dich machen will sicher dass mit sicherheit sinnvollwas aber sinnvoller ist falls du jobs suchst oder so mit sicherheit ist ein ordentliches link inprofil ansonsten weiß nicht keine ahnungkaja finde ich schon sinnvoll finde ich also wenn man was zum wenn man was vorzeigbares hat und vielleicht das auch mal sagen wir für im weiteren sinn gefasst fürseine karriere einsetzungen klar warum nicht das finde ich schon sinnig ja die renn oh leute eshat sich an der map struktur was fährt random fragen ist kein ding random fragen ich mag randomfragen manchmal verstehe ich den zusammenhang nicht was die leute genau wissen was guck maltatsächlich tatsächlich änderung an der map struktur da liegt jetzt irgendwie so eine soeine geöffnete dose oder so weiß ich genau was hat immer ein plan was das sein soll bestimmtcopy pasted von einer anderen map ok um diese rege um dieses areal mit container ist es sicherlichnicht schade abgestürzte kapsel vielleicht javielleicht oder abgestürzte kapsel die vorne auf der rakete drauf ist es könnte tatsächlichso in so ein mcdonalds deckel sein von der cola es ist nachts kälter als draußen boah das ist jadas ist ja die oldschooligste tschübait frage die ist ja die hat ja schon hätte schon kindergekriegt die tschüb diese frage die ist die ist ja schon so altaber das finde ich so musst du es machen so hätten sie es überall machen müssendass die map struktur halt sinnvoll irgendwie geändert so ist das ok ja man hat jetzt hierso einen kleinen so eine kleine schlucht und hier so das ist das ist eine gute map änderung dahat mal der map designer beziehungsweise der mapper wie man das sonst so genannt hat maltatsächlich bock gehabt jetzt bin ich aber mal gespannt wie sie in eineinhalb stunden unsexperiences und new modes und new content zeigen wollen da kommt wahrscheinlich jetzt gar nichtsda kommt wahrscheinlich einfach nur wir arbeiten an neuem content keckel und tschüsseineinhalb minuten das ist jetzt kommt season 2 aber container haben sie da auch ordentlichdrin oder ich meine irgendwann ist es mal gut mit container eine container base istfeifett aber immerhin ein paar nette particle effekte wo auch beide wei leute blöde fragewarum wo kommen die her warum kommen da irgendwelche partikel runter ist da obenirgendwie stahl was gegossen wird oder warum fallen hier so partikel runter mehr containeralter leute jetzt über leute warum warum sind auf den container pflanzen drauf was ist das füreine map was sehe ich da das ist doch keine map jetzt mal ernsthaft ich mein manifest bestehtzur hälfte schon aus container am anfang ja aber warum sind es noch mehr container alter und warumstehen da einfach random kleine palmen und bäume auf den container man habe ich gesehen alsosekunde das haben wir jetzt gesehen das haben wir gesehen und das ist jetzt noch mal so eintypischer gang der eins zu eins aus moment ist das überhaupt die neue map oder ist das manifestrework leute habt ihr das mitbekommen ist das die neue map oder ist das vielleicht manifest imreworkdas ist die neue map oder das ist die neue map guckt euch mal die die fässer da wo sindwir ist das das ikea waren lager oder wo sind wir hier ich meine schwedische entwickler würdejetzt ja kann ja kann ja sein und da sieht es bestimmt so ausund was ist hier hinter den container noch mehr container sehe ich das richtig das istein k.i. map generator der das gemacht hat bestimmt wer würde container so stapeln vorallem dinger die da rausgucken das ist eine wirklich gut berechtigte frage was ist das daim hintergrund so und das ist irgendwie so was wie von die rail oder wie die map heißt niewie heißt die map die rail war eine mw2 map das ist also so ein schiffskorridor wo maltatsächlich andere formen von containern rumstehen und half life kisten oder ist das jetzt imcontainer sind jetzt im container drin es gibt es sieht aus wie auf kaleidoskop hier ein bisschenja moment ja jetzt habt ihr noch eine minuten zeit für experiences und new content jetzt kommtdas war es mit experiences und new content das wurde jetzt mal kurz so ja übrigens leute hiergibt es ein paar neue container auf der neuen map das ist jetzt experiences und new contentbam auf geht's next experiences und mode ok new content achtung eine minuten zeit noch wir sehenhier alle da ist mit arbeiter die nicht an battlefield 2042 arbeiten ist ja was ist jadas spielt bestimmt gerade battlefield 4 und deswegen haben sie es geblatt oder bf1das war jetzt new content oder was zu sagen wir machen gerade ganz vielneuer content wir können euch zwar nach acht monaten noch keinen richtigen neuen contentzeigen aber wir machen gerade ganz vielen neuen content skorpi danke für den sup ja ja ja washalte ich davon ich mein gut dass sie überhaupt was machen ansonsten halt wirklich minimalstleistung was man erbringt dort ja ja weiß gar nicht was ich da groß zu sagen soll alsoist jetzt nicht dass ich wirklich dass ich übelst ausrasten würde über das update ich gucke mirseason 2 und die neue map auf jeden fall an leute wir gucken uns das auch auf jeden fallim stream zusammen an wenn es denn dann soweit ist ob das dadurch in irgendeiner art und weisewirklich größeren also widerspielwert bekommt ich weiß nicht aber ich sag euch wie es daswar sich schon seit monaten quasi schon seit ein paar wochen nach wie ich sage die liefernhalt das absolut mindeste mindeste ab gerade mit den seasons dass sie nicht verklagt werdenkönnen im zweifelsfall und dann kommt irgendwann das nächste battlefield und dann können wirnur hoffen dass das nächste battlefield besser wird vielleicht vielleicht ich meine die hoffnungstirbt ja zuletzt ja vielleicht musste battlefield 2042 einfach mal so richtig ins klo greifen dassdas nächste battlefield die chance hat besser zu werden wie gesagt kopium hoch 3 aber vielleichtist es ja so wann kommt es raus ich glaube in zwei oder drei wochen kommt die nächste seasonübrigens das was du in dem video gesehen hast die helfe davon kommt ja erst mit season 3level cap stellt das vor new huge game changing massive neugigkeiten oder soja portal juckt ja anscheinend auch nicht mehr genau was ist denn season 2 bf releaseupdate ich glaube irgendwann anfangen september haben die gesagt oder nicht am erstengenau die am anfang september gesagt deswegen sage ich ja die nächsten zwei wochen vielleichtoder die nächsten zwei drei wochen hat es wenigstens einem gefallen das ergibt jetztauch sinn warum die warum die container so komisch angeordnet waren der orchestrator hatnicht so richtig orchestrated wisst ihr was dem spiel wirklich gut tun würde was aber zuwenig ja wie soll ich sagen zu wenig bringt unterm strich und und sicherlich auch zu vielauffangen ist ein ordentlicher soundtrack würde dem spiel wirklich gut tun ich meine hört euchmal an nur mal so wir machen mal kurz den vergleich nicht bfbf eins er hört euch zumbeispiel das hier an es geht jetzt erst los ja wartet mal bis das richtig los geht das istrichtig gut das soundtrack bf eins jetzt ja das dauert kurz bis es halt ist halt menü isthalt menü sound aber hört sich wirklich ein bisschen nach hans zimmer an aber istwahrscheinlich nicht die partys können das ja auch das hat richtig gut das soundtrackjetzt jetzt das finde ich das hat was das hat wirklich was also oder auch später danndas hat richtig melodie und passt atmosphärisch zum gameso jetzt haltet euch fest haltet euch fest jetzt haltet euch fest achtungdas ist richtig gut das soundtrack ja von bf einsund jetzt achtung achtung ordn zu halten ordn zu haltenso was würde ich mir vorstellen wenn irgendwie einer versucht meine übertragung zu meinefunk übertragung zu jam dann würde er zu zu stören dann würde er sowas spielen jakaige kaige generated soundtrack also ich gehe davon aus dass es hildur günners dort hierund sam slater sicherlich besser können hört euch das an mann was ist das das tut weh was istdas also ich mein wer hat das partys gehört hat sich gedacht das ist es das ist der soundtrackfür unser game und und verdankt und und verdankt dass es besser wird guckt es immer mehr wer denktdass es besser wird monkels alter alterwas ist das ich mein wir dürfen nicht vergessen passt mal auf wir dürfen nicht vergessen die habenmal soundtracks geschrieben wieso was hierdie können das ja die können das ja aber in 2042 können die das nichtich weiß nicht ich weiß nicht leute keine ahnung was mit den schweden abgeht in dem fall unverständlichja es hört sich wirklich so an als haben die den soundtrack in einem der container aufgenommendie da so rum steht genau so hört sich das an und im hintergrund sind noch ein paar sachenruntergefallen genauso hört sich an leute gebt euch mal ein ruck noch vier follows bis 21.000follower noch zwei follows bis keine subscriber follows follows also follows follows kostenja nur wirklich nix hier wer noch nicht gefollowed hat haut rein wahrscheinlich kommt jetzt gleichwahrscheinlich sind es gleich wieder fünf oder so der erste hat wirklich an follow followdanach hat er gleich wieder folgst du hättest das noch nicht mal sagen müssen ich wahrscheinlichwarst du es noch nicht mal wahrscheinlich warst du es noch nicht mal und sagst jetzt einfach dirtraue ich das direkt zu das passt einfach alter jetzt haben wirklich fünf leute entfollowedmacht was ihr wollt alter ich gehe jetzt auf habt ihr jetzt davon ich gehe jetzt wirklichauf weil bettgetheim boomer müde gleich 22 uhr flow dankeschön für den sub bettgetheimwegen jemand hosten ja ich muss tatsächlich morgen arbeiten den den sprecher haben wirglaube ich letztes mal schon gehostet na gut alles klar leute wir sehen uns macht es gutbis denn bis zum nächsten mal zu und dann nächstes mal ist progas angesagt wieder bisdenn zu", "segments": [{"id": 1, "start": 0.0, "end": 13.88, "text": "wie es jetzt läuft. Aha das sieht besser aus. Guck dir mal da es funktioniert. Easy. Easy."}, {"id": 2, "start": 13.88, "end": 29.4, "text": "Bisschen lauter Sound oder? Alter der Sound ist mega lauter. Twitch Routing Outplayed. Ok"}, {"id": 3, "start": 29.4, "end": 36.56, "text": "funktioniert. Nice. Ich benutze übrigens jetzt den Service in Amsterdam. Was? Was ist jetzt los?"}, {"id": 4, "start": 36.56, "end": 59.88, "text": "Was ist jetzt los? Ok ich glaube es funktioniert. Also danke Rede. Kurzer Sinn wir gucken uns jetzt"}, {"id": 5, "start": 59.88, "end": 64.48, "text": "das neueste Battlefield Video an. Nochmal von vorne. Und wir machen das Video mal kurz mal hier den."}, {"id": 6, "start": 64.48, "end": 79.28, "text": "Auf gehts. Das Video ist total leise. Ok. Ja ich hab tatsächlich Zero Hour Enjoyed für zwei bis"}, {"id": 7, "start": 79.28, "end": 92.76, "text": "drei Tage. Danach war die Luft raus. MonkaW. By the way wir reden hier davon. Die tut so als"}, {"id": 8, "start": 92.76, "end": 97.4, "text": "wäre das wahnsinnig viel Content und sonst was. Das ist alles die gleiche Map. Ja also es ist jetzt"}, {"id": 9, "start": 97.4, "end": 101.52, "text": "nicht so als wären das drei verschiedene Maps oder das erste war eine Portal Map. Ok das ist"}, {"id": 10, "start": 101.52, "end": 112.48, "text": "alles die eine gleiche Map. Das ist auch die gleiche Map. Das ist die Portal Map. Das ist die"}, {"id": 11, "start": 112.48, "end": 137.36, "text": "zwei Map. Und das alles in sechs Minuten zwanzig. Da bin ich mal gespannt. Also entweder gibt's da"}, {"id": 12, "start": 137.36, "end": 162.6, "text": "nix oder da gehts jetzt wirklich Schlag auf Schlag. Da bin ich gespannt drauf. Ok Leute die schmeißen"}, {"id": 13, "start": 162.6, "end": 169.0, "text": "die Specialists nicht raus. Ich sag euch wie es ist. Die schmeißen die nicht raus. Die Leute"}, {"id": 14, "start": 169.0, "end": 183.76, "text": "hoffen das aber die schmeißen die nicht raus. Die zeigen es auch schon viel zu viel. Sind sie"}, {"id": 15, "start": 183.76, "end": 193.44, "text": "doch schon? Hä? Moment. Sind sie doch schon? Die Specialists haben doch alle eine klassische"}, {"id": 16, "start": 193.44, "end": 211.68, "text": "Battlefield Klasse associated. Haben sie doch schon? Ok mal angucken. Wie gesagt das sind sie"}, {"id": 17, "start": 211.68, "end": 223.44, "text": "doch schon. Ich glaube es steht doch schon mittlerweile dran dass es ein Assault Specialist ist. Ah ok"}, {"id": 18, "start": 223.44, "end": 230.56, "text": "das ist neu. Ok es gibt Traits die man aus... Ja gut aber das Gadget ist doch immer noch das"}, {"id": 19, "start": 230.56, "end": 235.12, "text": "gleiche. Ich mein Webstar ist der Typ mit dem Grappling Hook. Sunnets ist die mit dem Wingsuit."}, {"id": 20, "start": 235.12, "end": 241.4, "text": "Die haben doch bestimmt nicht das neu modelliert und animiert das Webstar jetzt mit dem Wingsuit"}, {"id": 21, "start": 241.4, "end": 248.76, "text": "rumfliegen kann. Das heißt diese Specialist Traits sind jetzt das was du sharen kannst."}, {"id": 22, "start": 248.76, "end": 264.92, "text": "Open Gadgets sind jetzt auch schon open. Ok ich mein ich finde das gut dass sie das mehr"}, {"id": 23, "start": 264.92, "end": 270.72, "text": "sichtbar machen dass die jetzt schon wohlgemerkt jetzt schon eingeteilt sind in genau diese"}, {"id": 24, "start": 270.72, "end": 277.44, "text": "Kategorien. Das ist ja nichts neues also diese die Specialist haben jetzt schon genau diese"}, {"id": 25, "start": 277.44, "end": 285.2, "text": "Einteilung. Wobei ich mir bei den zwei gar nicht sicher bin ob die da überhaupt... Also wie gesagt"}, {"id": 26, "start": 285.2, "end": 292.56, "text": "die haben jetzt also das hier sind Assaults. Das waren schon immer Assault Specialist. Maria"}, {"id": 27, "start": 292.56, "end": 299.16, "text": "Falk war schon immer Support, Medic ja das ist nichts neues. Was jetzt anscheinend neu ist sind"}, {"id": 28, "start": 299.16, "end": 308.32, "text": "Traits also sprich du kannst die Traits zwischen diesen drei Specialist dann sharen. Ok aber sag"}, {"id": 29, "start": 308.32, "end": 316.76, "text": "man mal so das primäre von also diese die die also diese primären Sachen die Specialist ausmachen"}, {"id": 30, "start": 316.76, "end": 323.2, "text": "also sprich dass er einen Grappling Hook hat und das jetzt muss ich aufpassen dass ich nichts"}, {"id": 31, "start": 323.2, "end": 331.72, "text": "falsches sage ich glaube sie einen Wingsuit hat bzw. Fragmentation Granaten und sowas und dass"}, {"id": 32, "start": 331.72, "end": 337.8, "text": "das er ein Schild hat hier das wird ja weiterhin so bleiben also eigentlich hat sich bis auf die"}, {"id": 33, "start": 337.8, "end": 345.88, "text": "Traits nichts geändert oder sehe ich das falsch also im Prinzip ist es immer noch das gleiche."}, {"id": 34, "start": 345.88, "end": 360.04, "text": "Ich bin mal gespannt ich meine die die Season startet bald irgendwie in 14 Tagen oder so können"}, {"id": 35, "start": 360.04, "end": 365.56, "text": "wir es ausprobieren aber wie gesagt ich also im Prinzip ist das mehr oder weniger das gleiche"}, {"id": 36, "start": 365.56, "end": 380.08, "text": "bis auf die Traits. Die sind jetzt auch schon also diese Einteilung hier unten gibt es doch"}, {"id": 37, "start": 380.08, "end": 388.6, "text": "jetzt auch schon das ist nichts neues ich bin mir nicht sicher ob es so dran steht aktuell schon"}, {"id": 38, "start": 388.6, "end": 397.36, "text": "ich habe das Game auch nicht mehr installiert aber die Einteilung ist jetzt auch schon so ok"}, {"id": 39, "start": 397.36, "end": 419.08, "text": "Nächstes Jahr! Nächstes Jahr! Nächstes Jahr! Keckl! Ich dachte das kommt jetzt mit Season 2 man! Nächstes"}, {"id": 40, "start": 419.08, "end": 430.04, "text": "Jahr ok alles klar nice top! Season 3 man! Ok nicht nächstes Jahr vielleicht zu Weihnachten"}, {"id": 41, "start": 430.04, "end": 434.64, "text": "oder so. Ich weiß nicht wann war Season 1 Release? Sekunde das muss ich mir jetzt gerade mal angucken."}, {"id": 42, "start": 434.64, "end": 454.96, "text": "Was ging das los? Ah ok vor drei Monaten. Das ist Ende des Jahres nächstes Jahr! Meine Güte"}, {"id": 43, "start": 454.96, "end": 462.92, "text": "Alter was machen die den ganzen Tag? Ich finde das prinzipiell gut aber das ist jetzt keine"}, {"id": 44, "start": 462.92, "end": 469.2, "text": "riesen Änderung ja weil wie gesagt die Specialist sind schon so gruppiert das ist rein eine optische"}, {"id": 45, "start": 469.2, "end": 473.4, "text": "Sache jetzt kommen halt noch die Traits dazu die geshared werden können das finde ich prinzipiell"}, {"id": 46, "start": 473.4, "end": 479.84, "text": "nice aber das macht aus dem Specialist System jetzt kein Klassen System wie es die Leute wollen"}, {"id": 47, "start": 479.84, "end": 490.76, "text": "ja das stimmt ich finde die dinge die die Specialist sehen halt jetzt halt nicht aus"}, {"id": 48, "start": 490.76, "end": 495.0, "text": "als passen in das Game wisst ihr aber was das größte Problem ist die Models sind schlicht"}, {"id": 49, "start": 495.0, "end": 501.32, "text": "oder greif nicht fertig die haben ja kaum Details guckt euch das mal an die sehen alle aus die haben"}, {"id": 50, "start": 501.32, "end": 510.04, "text": "alle falsche Beleuchtung irgendwie im Gesicht es sieht überhaupt nicht fertig fertig gemodelt"}, {"id": 51, "start": 510.04, "end": 516.92, "text": "aus diese Dinger das ist das eigentliche Problem was ich mit den Specialist habe die sehen so aus"}, {"id": 52, "start": 516.92, "end": 523.88, "text": "wie irgendwelche nicht ok Plays Halter Models ist jetzt zu hart du siehst schon dass da Leute"}, {"id": 53, "start": 523.88, "end": 532.04, "text": "dran gesessen haben die wissen was sie machen ja aber die sehen halt einfach nicht fertig aus"}, {"id": 54, "start": 532.04, "end": 552.76, "text": "Alter Boris mann Boris weint gleich was ist denn mit Boris los Alter Boris mann wisst ihr wisst ihr"}, {"id": 55, "start": 552.76, "end": 559.64, "text": "wie Boris aussieht Boris sieht ein bisschen aus in diesem wenn er so als wieder Windows 11 Präsentator"}, {"id": 56, "start": 559.64, "end": 562.04, "text": "kennt kennt kennt ihr noch die Windows 11"}, {"id": 57, "start": 573.72, "end": 580.96, "text": "ich finde der neue Boris hat gewisse Ähnlichkeiten zu dem Windows 11 Präsentator oder ein bisschen"}, {"id": 58, "start": 580.96, "end": 591.36, "text": "ein bisschen ähnlich sehen die sich schon ok guck mal fertig meine Maus legt chat wer von euch ist es"}, {"id": 59, "start": 591.36, "end": 597.84, "text": "wer wer lässt meine Maus legen gibt zu gibt euch zu erkennen"}, {"id": 60, "start": 604.0, "end": 607.28, "text": "der Schreiker ist es bestimmt der ist Kubernetes Admin die machen sowas"}, {"id": 61, "start": 607.28, "end": 611.88, "text": "den aus Mauszeiger ja ok guck mal weiter"}, {"id": 62, "start": 623.4, "end": 631.76, "text": "ok wer wirklich besser aussieht muss man sagen ist jetzt die die Radar Radar Specialist hin weil"}, {"id": 63, "start": 631.76, "end": 638.08, "text": "das Modell von der fand ich dieser vorher dieser übrigens in game auch nicht so aus ne die hat in"}, {"id": 64, "start": 638.08, "end": 643.68, "text": "game viel mehr Pausebäckchen Pausbäckchen gehabt als hier weil dieser wirklich unfertig aus das"}, {"id": 65, "start": 643.68, "end": 649.96, "text": "sieht tatsächlich das hat irgendwie auch ein paar Kanten so und ansonsten haben sie den einfach ein"}, {"id": 66, "start": 649.96, "end": 662.72, "text": "bisschen bisschen Dreck ins Gesicht geschmiert und das ist jetzt halt viel besser und dunkler und so"}, {"id": 67, "start": 662.72, "end": 666.04, "text": "das war es mit den Prime Abos MonkaS"}, {"id": 68, "start": 676.04, "end": 678.64, "text": "also wenn in dem Tempo weitermachen kriegen wir tatsächlich alle vier"}, {"id": 69, "start": 678.64, "end": 688.76, "text": "dinger man muss halt mal sagen mit Gameplay hatte das bis jetzt noch relativ wenig zu tun es gibt"}, {"id": 70, "start": 688.76, "end": 694.2, "text": "jetzt halt im Prinzip genau das gleiche wie vorher nur noch zusätzlich Specialist Trades die"}, {"id": 71, "start": 694.2, "end": 700.72, "text": "man in der gleichen Klassen Kategorie scheren kann ok ja das ist schon core Gameplay das passt"}, {"id": 72, "start": 700.72, "end": 722.12, "text": "wann kommen Klaasers zurück gar nicht hat sie gerade gesagt dass die Battlefield 3 M16 auch"}, {"id": 73, "start": 722.12, "end": 744.8, "text": "mit dem Ding hinten dran zwei zwei Waffen plus noch mal zwei aus dem Season Update das heißt"}, {"id": 74, "start": 744.8, "end": 753.8, "text": "vier Waffen und zwei davon sind alt ich mein gut dass es mehr Waffen gibt das Spiel hat prinzipiell"}, {"id": 75, "start": 753.8, "end": 760.68, "text": "deutlich zu wenig Waffen wir dürfen nicht vergessen das ist aber Sachen Portal Content die seit"}, {"id": 76, "start": 760.68, "end": 775.44, "text": "Release im Prinzip drinne ist also dafür müssen die gar nichts machen das ist alles schon da"}, {"id": 77, "start": 775.44, "end": 799.76, "text": "jetzt bin ich tatsächlich mal gespannt weil wenn sie in dem Tempo weitermachen habe ich"}, {"id": 78, "start": 799.76, "end": 810.0, "text": "ausgerechnet was ich was ich nicht mit eingerechnet habe ist die DLC Maps aber von denen gehen wir"}, {"id": 79, "start": 810.0, "end": 814.28, "text": "ein oder die Season Maps von denen gehen wir einfach mal von aus dass die gescheit sind ich"}, {"id": 80, "start": 814.28, "end": 817.88, "text": "habe das mal vorhin ausgerechnet also wenn die in dem Tempo weitermachen wie sie jetzt weitermachen"}, {"id": 81, "start": 817.88, "end": 826.84, "text": "dann haben wir in eineinhalb Jahren nach Release ungefähr die Launch Maps in einem brauchbaren"}, {"id": 82, "start": 826.84, "end": 838.48, "text": "Zustand es ist jetzt nicht so dass diese Anpassung wahnsinnig große Ressourcenfresser sind ich"}, {"id": 83, "start": 838.48, "end": 843.8, "text": "meine diese diese Container sind die gleichen Container die sie seit Battlefield 2 haben oder"}, {"id": 84, "start": 843.8, "end": 849.56, "text": "so und hier die haben sie hier wahnsinnig viele tolle neue Assets für bauen müssen dass das"}, {"id": 85, "start": 849.56, "end": 855.8, "text": "funktioniert aber wisst ihr was man finde ich an diesem Ausschnitt wirklich gut erkennt guckt"}, {"id": 86, "start": 855.8, "end": 863.84, "text": "euch das mal an was man hieran sieht ist die mehr die Maps die waren schlicht und ergreifend nicht"}, {"id": 87, "start": 863.84, "end": 868.32, "text": "fertig zu Release meine das ist glaube ich mittlerweile jedem klar dass das Game zu Release"}, {"id": 88, "start": 868.32, "end": 875.12, "text": "nicht fertig die Maps waren schlicht und ergreifend nicht nicht fertig so sieht das deutlich mehr nach"}, {"id": 89, "start": 875.12, "end": 879.28, "text": "einer Battlefield Map aus ich finde es halt ein bisschen schade dass man jetzt den einfachsten"}, {"id": 90, "start": 879.28, "end": 884.16, "text": "Weg gewählt hat und dort irgendwelche Gerüste Kisten und Sandsäcke hinstellt aber nicht dass"}, {"id": 91, "start": 884.16, "end": 893.12, "text": "du trotz ich meine es passt zum Szenario aber ansonsten es ist einfach es fehlt einfach alles"}, {"id": 92, "start": 893.12, "end": 899.24, "text": "an Details auf dieser Map an Deckung an guter Spielbarkeit eben dadurch dass du über so viele"}, {"id": 93, "start": 899.24, "end": 905.52, "text": "offene Flächen liefst ja und auch guckt euch den Boden an der Boden sah halt einfach immer viel zu"}, {"id": 94, "start": 905.52, "end": 911.2, "text": "viel zu sauber und unfertig aus also du siehst einfach die Dinger waren nie fertig zu nie und"}, {"id": 95, "start": 911.2, "end": 922.96, "text": "immer fertig zu release alle Maps brauchen den Overhaul"}, {"id": 96, "start": 922.96, "end": 940.64, "text": "orbital orbital ist die Map mit der Rakete die sie am Anfang so ausführlich gezeigt haben weil"}, {"id": 97, "start": 940.64, "end": 956.4, "text": "es die einzige Map war die irgendwie ein cooles Feature hatte so mit der Rakete jetzt siehst du"}, {"id": 98, "start": 956.4, "end": 962.16, "text": "halt mal richtig diese Maps waren nie fertig das könnte jetzt eins zu eins irgendwie so eine Base"}, {"id": 99, "start": 962.16, "end": 971.28, "text": "in Firestorm oder so sein die Maps waren nicht fertig die waren mitten in der die wurden mitten"}, {"id": 100, "start": 971.28, "end": 983.4, "text": "aus der Entwicklung gerissen und released es ist jetzt bestimmt nicht der super geilste Weg da"}, {"id": 101, "start": 983.4, "end": 989.28, "text": "überall Kisten hinzustellen wie gesagt es passt ja wahrscheinlich haben sie die sich gerade noch"}, {"id": 102, "start": 989.28, "end": 995.28, "text": "im Unreal Asset Store gekauft und importiert weil Kisten und Salzsäcke findest du bestimmt zu"}, {"id": 103, "start": 995.28, "end": 1000.6, "text": "genüge aber ich meine jetzt sieht das jetzt jetzt sieht das irgendwie nach einer normalen"}, {"id": 104, "start": 1000.6, "end": 1009.24, "text": "Battlefield Map aus ja es ist das jetzt ist das ok jetzt jetzt hat es auch geblieben guck mal du"}, {"id": 105, "start": 1009.24, "end": 1017.08, "text": "hast jetzt auch zum ersten mal so ein bisschen Details teilweise auf der Straße also das ist"}, {"id": 106, "start": 1017.08, "end": 1033.08, "text": "schon in Ordnung ja so das sieht ich meine es ist die billigste Variante überhaupt ja mit"}, {"id": 107, "start": 1033.08, "end": 1042.28, "text": "mit diesen Kisten und Containern und Planken und Warnhütchen und so aber so stelle ich mir"}, {"id": 108, "start": 1042.28, "end": 1048.56, "text": "eher eine Battlefield Map vor aber was halt was halt da auch immer mich ein bisschen verwirrt"}, {"id": 109, "start": 1048.56, "end": 1052.68, "text": "ist ich mein warum braucht man da acht Monate für"}, {"id": 110, "start": 1057.56, "end": 1063.04, "text": "es ist jetzt ja kein großer Akt da Kisten hinzustellen oder so das machst du jetzt mal"}, {"id": 111, "start": 1063.04, "end": 1070.68, "text": "in zwei Wochenenden Container machen keinen Sinn das ist korrekt deswegen ist ja das ist die"}, {"id": 112, "start": 1070.68, "end": 1075.16, "text": "billigste Variante das erinnert mich an Half-Life Maps falls jemand Half-Life Maps von früher noch"}, {"id": 113, "start": 1075.16, "end": 1083.52, "text": "kennt ganz viele Half-Life Maps hatten Container und Kisten und Blöcke und sowas und das lag"}, {"id": 114, "start": 1083.52, "end": 1091.36, "text": "daran weil Half-Life halt selbst saumäßig viele Kisten Blöcke und Absperrungen und Container"}, {"id": 115, "start": 1091.36, "end": 1095.68, "text": "mitgebracht hat weil eben das Half-Life Szenario vieles hatte dass ganz viele Maps die die Leute"}, {"id": 116, "start": 1095.68, "end": 1100.92, "text": "erstellt haben bestanden zu 80 prozent aus Containern weil halt die Asset schon drin waren und"}, {"id": 117, "start": 1100.92, "end": 1105.12, "text": "es sieht tatsächlich ein bisschen aus wie eine Half-Life Map die Container an der Stelle machen"}, {"id": 118, "start": 1105.12, "end": 1112.16, "text": "überhaupt keinen Sinn man hätte wenn man sich wirklich also das hier unten finde ich okay das"}, {"id": 119, "start": 1112.16, "end": 1116.32, "text": "ist quasi so eine Befestigung für diesen Punkt das ist in Ordnung was ist eigentlich mit der"}, {"id": 120, "start": 1116.32, "end": 1123.24, "text": "Straßenaufschrift war die ja die war vorher da das ist okay was ich halt hier die Container ergeben"}, {"id": 121, "start": 1123.24, "end": 1128.28, "text": "tatsächlich relativ wenig Sinn hätte man die Map vielleicht ein bisschen anders gebaut anders hätte"}, {"id": 122, "start": 1128.28, "end": 1134.16, "text": "man da auch was anderes machen können aber den ist halt den drei Leuten die da noch dran arbeiten"}, {"id": 123, "start": 1134.16, "end": 1140.8, "text": "ist halt nichts eingefallen aber mir ist es so immer noch lieber als im Standardzustand"}, {"id": 124, "start": 1142.8, "end": 1146.16, "text": "die haben die haben eine Konzeptzeichnung gebraucht wie jeden Container wahrscheinlich"}, {"id": 125, "start": 1146.16, "end": 1164.92, "text": "ja sonst deswegen hat es so lange gedauert. Hey das sieht jetzt mal irgendwie nach einem"}, {"id": 126, "start": 1164.92, "end": 1169.88, "text": "Untergrund aus den irgendjemand nicht aus einem Random Generator raus hat sondern sich auch mal"}, {"id": 127, "start": 1169.88, "end": 1177.0, "text": "bisschen was überlegt hat bei ja man könnte Klohäuschen hinstellen zum Beispiel was halt"}, {"id": 128, "start": 1177.0, "end": 1181.68, "text": "hier von Klohäuschen Klohäuschen sind eh wahnsinnig unterrepräsentiert auf diesen Maps finde ich"}, {"id": 129, "start": 1181.68, "end": 1189.8, "text": "Klohäuschen und natürlich bitte schön auch drei weil MWD das muss schon alles korrekt sein"}, {"id": 130, "start": 1189.8, "end": 1202.12, "text": "ist überall die selbe Nummer auf den Containern wirklich tatsächlich ist mir gar nicht aufgefallen"}, {"id": 131, "start": 1202.12, "end": 1225.28, "text": "171 gut man kann halt sagen das ist der Hersteller oder so aber ja es ist das ist schon billig ich"}, {"id": 132, "start": 1225.28, "end": 1235.92, "text": "bin mal gespannt was sie uns zu neuem Content zeigen. By the way die haben noch nichts von"}, {"id": 133, "start": 1235.92, "end": 1241.28, "text": "Season 2 gezeigt das hier ist jetzt quasi der Rework der mit Season 2 kommt aber wir haben noch"}, {"id": 134, "start": 1241.28, "end": 1245.76, "text": "nichts gesehen von Season 2 zumal Season 2 noch glaube ich in 14 Tagen oder so fast schon startet"}, {"id": 135, "start": 1245.76, "end": 1257.6, "text": "oder drei Wochen ich meine das hätte man schon da hätte man schon ein bisschen kreativer sein"}, {"id": 136, "start": 1257.6, "end": 1263.96, "text": "können ich meine das ist ja irgendein Bürogebäude ja dann hätte man was weiß ich Schränke"}, {"id": 137, "start": 1263.96, "end": 1280.32, "text": "irgendwelche alten Computersachen oder was auch immer dafür sind Map Designer da. Mein Kisten"}, {"id": 138, "start": 1280.32, "end": 1285.48, "text": "ist halt wirklich das einfachste was du machen kannst. Ich meine es ist Battlefield deswegen"}, {"id": 139, "start": 1285.48, "end": 1307.08, "text": "passt es halbwegs noch dass man so befestigte Stellung macht. Ist okay. Ja ich mein man hätte"}, {"id": 140, "start": 1307.08, "end": 1311.08, "text": "ja durchaus man hätte also wenn man sich Mühe gegeben hätte es gibt ja wenn ich mir jetzt mal"}, {"id": 141, "start": 1311.08, "end": 1319.16, "text": "recht wenn ich mir mal wirklich recht Gedanken mache man hätte da schon machen können ja man"}, {"id": 142, "start": 1319.16, "end": 1322.84, "text": "hätte zum Beispiel hier einen Fahrstuhl hin machen können der Fahrstuhl ist aber hier durch"}, {"id": 143, "start": 1322.84, "end": 1329.12, "text": "die Decke gebrochen oder irgendwie sowas ja man hätte beispielsweise dann Deckung machen können"}, {"id": 144, "start": 1329.12, "end": 1335.4, "text": "keine Ahnung hier ist was durchs Fenster gecrasht und liegt jetzt hier oder wisst ihr sowas der"}, {"id": 145, "start": 1335.4, "end": 1340.92, "text": "hätte man halt ein bisschen bisschen mehr Aufwand gebraucht und ein bisschen mehr sich Gedanken machen"}, {"id": 146, "start": 1340.92, "end": 1347.84, "text": "müssen oder es wäre dann halt auch nicht mit mit Copy Paste bestehender Sachen getan gewesen man"}, {"id": 147, "start": 1347.84, "end": 1353.2, "text": "hätte guckt mal zum Beispiel so ein Ding hier ja so ein Ding hier hätte man hier hinstellen können"}, {"id": 148, "start": 1353.2, "end": 1359.2, "text": "auf der einen Seite kaputt machen und hier rein brechen lassen können durchs Dach zum Beispiel"}, {"id": 149, "start": 1359.2, "end": 1369.88, "text": "sowas also oder oder ein paar irgendwas da gäbe es durchaus Möglichkeiten wenn man gewollt hätte"}, {"id": 150, "start": 1369.88, "end": 1388.4, "text": "ok hier sieht man eine Sache gut dran was mich schon immer gestört hat seit Release auf den"}, {"id": 151, "start": 1388.4, "end": 1394.48, "text": "Battlefield Maps auf den Battlefield 2042 Maps diese Maps sahen viel zu clean aus für Battlefield"}, {"id": 152, "start": 1394.48, "end": 1400.96, "text": "Maps guckt euch das mal an die sahen deutlich zu clean aus so ist das tatsächlich finde ich"}, {"id": 153, "start": 1400.96, "end": 1406.68, "text": "deutlich besser wobei man halt sagen muss das sind dann auch wieder nur Kisten und Sandsäcke"}, {"id": 154, "start": 1406.68, "end": 1412.88, "text": "im Endeffekt aber ok es sieht schon besser also sieht naja besser ich weiß nicht ob wir besser"}, {"id": 155, "start": 1412.88, "end": 1418.36, "text": "denken besser aber ich meine dass man zumindest mal Spuren und ein bisschen Details auf den Straßen"}, {"id": 156, "start": 1418.36, "end": 1421.56, "text": "hat ist schon ist schon die Sandsäcke sind hier passt aus alles da"}, {"id": 157, "start": 1429.56, "end": 1434.16, "text": "dass sie das ist besser das ist besser ich weiß macht zwar keinen Sinn dass die Sandsäcke und"}, {"id": 158, "start": 1434.16, "end": 1439.64, "text": "konnte ok das sieht jetzt wenigstens mal aus nach irgendwas wo was gearbeitet wurde ja wo was"}, {"id": 159, "start": 1439.64, "end": 1447.16, "text": "passiert ist und nicht einfach nur nach einer ungefährte unfertigen Map der Sinn dieses Tunnels"}, {"id": 160, "start": 1447.16, "end": 1450.52, "text": "hier hat sich immer noch entschlossen da diese Halo Tunnel wo man mit dem Auto durchfährt"}, {"id": 161, "start": 1450.52, "end": 1459.0, "text": "die haben so viele Container auf ihren Maps die haben sogar schon Kubernetes hast recht"}, {"id": 162, "start": 1459.0, "end": 1476.0, "text": "cloud native Battlefield warum schaut man sich das noch an du meinst warum ich mir das Video"}, {"id": 163, "start": 1476.0, "end": 1482.04, "text": "anschaue oder warum es immer noch leute gibt die das spielen also ich denke mal das liegt daran"}, {"id": 164, "start": 1482.04, "end": 1487.8, "text": "dass leute das noch spielen weil es viele leute gibt wie ich die gerne Battlefield spielen und"}, {"id": 165, "start": 1487.8, "end": 1494.08, "text": "hoffen dass da mal was gescheites kommt Video anschauen da weil ich wissen will was ich da"}, {"id": 166, "start": 1494.08, "end": 1498.6, "text": "tut wir haben den Kram alle gekauft und ich finde es tatsächlich immer noch spannend was da"}, {"id": 167, "start": 1498.6, "end": 1503.24, "text": "rauskommt ich habe die Hoffnung zwar aufgegeben dass da am Ende wirklich was gutes spielbares"}, {"id": 168, "start": 1503.24, "end": 1507.6, "text": "rauskommt aber es interessiert mich trotzdem was rauskommt und sei es nur dass ich drüber"}, {"id": 169, "start": 1507.6, "end": 1514.76, "text": "lästern kann dass nichts gescheites rauskommt. Moment die Türme sind weg"}, {"id": 170, "start": 1514.76, "end": 1523.04, "text": "man hat einfach alles man hat einfach steht da auch überall 71 auf den Containern das"}, {"id": 171, "start": 1523.04, "end": 1527.32, "text": "würde ich jetzt gerne sehen ob da überall 71 drauf steht wie auf den anderen Containern"}, {"id": 172, "start": 1527.32, "end": 1535.24, "text": "ich mein das ist halt wirklich sehr billig muss man sagen das ist wirklich billig"}, {"id": 173, "start": 1535.24, "end": 1544.96, "text": "guck dir das ist wirklich billig ich meine die haben einfach ganz viele Dinger genommen und"}, {"id": 174, "start": 1544.96, "end": 1550.12, "text": "wild hier drüber copypasted man muss sagen ja man sieht sie haben sich ein bisschen Gedanken"}, {"id": 175, "start": 1550.12, "end": 1557.24, "text": "gemacht es hat schon mal zumindest einer kurz fünf Minuten überlegt wie hier Sachen platziert sind"}, {"id": 176, "start": 1557.24, "end": 1561.4, "text": "man gescheite Deckung von hier nach hier hast immer noch nicht aber vielleicht will man das auch nicht"}, {"id": 177, "start": 1561.4, "end": 1567.48, "text": "du siehst es hat sich schon eine Gedanken gemacht hier kannst du eindeutig drübergucken vermute"}, {"id": 178, "start": 1567.48, "end": 1571.04, "text": "ich mal bin mir gar nicht so sicher aber wenn gehe ich mal was rübergucken ein und seit ab"}, {"id": 179, "start": 1571.04, "end": 1576.52, "text": "hier drüben auch hier kannst du rausgucken hier kannst du zumindest relativ schnell ja also hat"}, {"id": 180, "start": 1576.52, "end": 1582.52, "text": "es mal zumindest einer sich ein bisschen Gedanken drüber gemacht aber die Umsetzung ist halt wirklich"}, {"id": 181, "start": 1582.52, "end": 1588.8, "text": "billig die Umsetzung ist wirklich billig da wurde einfach nur krass copypasted as fuck"}, {"id": 182, "start": 1588.8, "end": 1598.36, "text": "was hältst du von clash auf ernsthaft nix mobile crap alter"}, {"id": 183, "start": 1598.36, "end": 1602.8, "text": "ne nix mit mobile games kannst du mich nicht schocken"}, {"id": 184, "start": 1608.04, "end": 1613.84, "text": "the removal of those two as capture points we've added a new capture point on 128 layer hast du"}, {"id": 185, "start": 1613.84, "end": 1621.96, "text": "kein handy ich habe sogar drei handys aber da kommt kein mobile game drauf stimmt gar nicht"}, {"id": 186, "start": 1621.96, "end": 1630.52, "text": "vier sind ja mittlerweile hier sind ja sogar weird flex ja sind ja sogar vier mittlerweile"}, {"id": 187, "start": 1630.52, "end": 1638.72, "text": "128 layout aber ich benutze davon nur eins on the hills giving more to fight over between the crawl"}, {"id": 188, "start": 1638.72, "end": 1644.08, "text": "away and refinery on the refinery side was passiert da unten mit dem gras leute was passiert"}, {"id": 189, "start": 1644.08, "end": 1652.16, "text": "guckt euch mal das gras an was passiert hier gerade mit dem gras und refinery ist das level of detail"}, {"id": 190, "start": 1652.16, "end": 1660.96, "text": "sachen die rein ploppen oder man sieht man sieht so in der animation gescheit in the crawl away"}, {"id": 191, "start": 1660.96, "end": 1669.36, "text": "and refinery an die settings hätte man ja für die videoaufnahme mal wenigstens umstellen können"}, {"id": 192, "start": 1669.36, "end": 1674.36, "text": "seit wann ist kein das ist so weil es weil ich das jetzt so entschieden habe allerdings"}, {"id": 193, "start": 1674.36, "end": 1678.24, "text": "lull weh ist immer noch das unangefochten beste lach emote"}, {"id": 194, "start": 1678.24, "end": 1691.32, "text": "was benutzt als main handy an iphone 11 warum warum kann ich dir ganz einfach sagen weil"}, {"id": 195, "start": 1691.32, "end": 1694.24, "text": "ich das von der firma gestellt bekommen und ich selbst kaufen muss"}, {"id": 196, "start": 1694.24, "end": 1710.2, "text": "lull e zwar ein lull was hat lull e lull e ffz nee das ist ein forsen emote"}, {"id": 197, "start": 1710.2, "end": 1719.48, "text": "lull p ist zu krass"}, {"id": 198, "start": 1719.48, "end": 1725.44, "text": "gucken wir mal gibt es gar nicht"}, {"id": 199, "start": 1730.28, "end": 1731.08, "text": "was soll das sein"}, {"id": 200, "start": 1734.52, "end": 1735.28, "text": "doch gibt es"}, {"id": 201, "start": 1735.28, "end": 1746.28, "text": "ok komm moment jetzt bin ich mal gespannt was machen sie denn hier jetzt hier stehen"}, {"id": 202, "start": 1746.28, "end": 1751.44, "text": "noch schon so viele container lasst mich raten sandsäcke und und beton blöcke"}, {"id": 203, "start": 1751.44, "end": 1765.52, "text": "sandsäcke und beton blöcke wer hätte das machen können und mehr container wird aber langsam eng"}, {"id": 204, "start": 1765.52, "end": 1772.76, "text": "für neue neuen content den sonst zeigen wollen die area changing up the sightlines to improve"}, {"id": 205, "start": 1772.76, "end": 1783.24, "text": "the infantry experience and adding tighter barriers to slow down vehicles kisten und beton blöcke"}, {"id": 206, "start": 1783.24, "end": 1791.0, "text": "hey mal wirklich strukturelle änderungen an der map prog dafür musste der entwickler von"}, {"id": 207, "start": 1791.0, "end": 1795.44, "text": "einem anderen game abgezogen werden dafür wahrscheinlich das hat der praktikant allein"}, {"id": 208, "start": 1795.44, "end": 1806.04, "text": "nicht alleine hinbekommen es gibt tatsächlich neue laufwege das finde ich gut die beleuchtung"}, {"id": 209, "start": 1806.04, "end": 1810.56, "text": "sieht auch deutlich besser aus guckt euch das immer an hier so und jetzt mit dem hier finde"}, {"id": 210, "start": 1810.56, "end": 1821.0, "text": "ich sieht deutlich stimmiger aus ja das ist das ist gut guckt guckt euch diese map an es kann mir"}, {"id": 211, "start": 1821.0, "end": 1827.56, "text": "doch keiner sagen diese map war fertig zu release die sind so steril und unfertig aus und jetzt"}, {"id": 212, "start": 1827.56, "end": 1837.8, "text": "passt auf jetzt kommen jede menge container dazu aber ok man immerhin besser als als nix ja moment"}, {"id": 213, "start": 1837.8, "end": 1845.68, "text": "es kam noch ein loch in der straße dazu nicht nur container es kam container in mengen dazu aber es"}, {"id": 214, "start": 1845.68, "end": 1850.84, "text": "kaum auch ein loch in der straße dazu das konnten sie aber wahrscheinlich auch copy pasten von"}, {"id": 215, "start": 1850.84, "end": 1857.68, "text": "irgendwo anders kriegst helping to keep guck mal hier auf dem runway sind jetzt jede menge kaputte"}, {"id": 216, "start": 1857.68, "end": 1862.68, "text": "panzer und löcher Leute das sind doch alles die gleichen löcher das sind exakt die gleichen"}, {"id": 217, "start": 1862.68, "end": 1873.64, "text": "löcher das sind alles die klein oder oder dass die gleichen löcher alles oder haben sie die"}, {"id": 218, "start": 1873.64, "end": 1879.36, "text": "leicht variiert intensity high that these two infantry heavy flags with adjustments to the nearby"}, {"id": 219, "start": 1879.36, "end": 1884.64, "text": "terrain helping to make sure ok ich sag nix das sind nicht alles die gleichen löcher die copy"}, {"id": 220, "start": 1884.64, "end": 1891.84, "text": "pasted werden oder you can attack these flags from more angles than before but our main focus for"}, {"id": 221, "start": 1891.84, "end": 1896.44, "text": "the map has been helping to improve cover and combat across the crawl away with a lot"}, {"id": 222, "start": 1896.44, "end": 1904.72, "text": "ja das sieht jetzt schon sehr sehr gezwungen aus hier also sehr so fack wir mussten was machen wir"}, {"id": 223, "start": 1904.72, "end": 1910.16, "text": "wissen nicht was wir machen sollen also das ist einfach ja ich meine es sieht besser aus wie"}, {"id": 224, "start": 1910.16, "end": 1915.42, "text": "es sieht jetzt mehr nach einer battlefield map aus ja aber da hätte man doch so viel mehr machen"}, {"id": 225, "start": 1915.42, "end": 1924.08, "text": "können wenn man wenn man sich mühe gegeben hätte man hätte vielleicht teile vom haus"}, {"id": 226, "start": 1924.08, "end": 1930.68, "text": "einstürzen lassen können also schon im vorfeld die da drüber liegen oder vielleicht irgendwelche"}, {"id": 227, "start": 1930.68, "end": 1937.92, "text": "lk man könnte ja beispielsweise wunderbar ein lkw hin machen der eine der eine raketenstufe"}, {"id": 228, "start": 1937.92, "end": 1943.6, "text": "beispielsweise zum launchpad zieht oder so und kaputt ist belegt euch das mal nehmt ihr irgendwie"}, {"id": 229, "start": 1943.6, "end": 1949.64, "text": "so eine so eine so eine raketenstufe legt ihr auf ein lkw sowas hier legt ihr auf ein lkw transporter"}, {"id": 230, "start": 1949.64, "end": 1956.04, "text": "und lasst den mal mit so einem doppelten transporter legt die launchstufe ist ja nach hier vorne das"}, {"id": 231, "start": 1956.04, "end": 1962.24, "text": "launchpad ist ja nach hier vorne und da hätte man den hier platzieren können in der mitte das"}, {"id": 232, "start": 1962.24, "end": 1968.0, "text": "hätte irgendwie gepasst dann hätte man sich vielleicht hier überlegen können vielleicht"}, {"id": 233, "start": 1968.0, "end": 1973.96, "text": "macht mir nicht einfach einen hügel hin sondern man setzt das haus ein bisschen vor ja solche"}, {"id": 234, "start": 1973.96, "end": 1981.12, "text": "sachen also ich denke mit ein bisschen mehr engagement hätte man da das deutlich schöner"}, {"id": 235, "start": 1981.12, "end": 1987.44, "text": "machen können als das rein copy paste ich sehe schon komm ich muss glaube ich morgen neues video"}, {"id": 236, "start": 1987.44, "end": 1994.56, "text": "dazu machen und da werde ich mir den hasse der paar verbliebenen battlefield fans wieder zuziehen"}, {"id": 237, "start": 1994.56, "end": 2005.88, "text": "aber ok was sei es drum ich meine es ist ja wahr es ist es ist ja wahr kann ja keiner gibt's ja"}, {"id": 238, "start": 2005.88, "end": 2010.2, "text": "nichts groß weg zu diskutieren kann ja keiner wirklich behaupten das wäre hier peak peak map"}, {"id": 239, "start": 2010.2, "end": 2018.64, "text": "design das mag für die spielbarkeit auf jeden fall gut sein aber bei gutes map design heißt"}, {"id": 240, "start": 2018.64, "end": 2029.0, "text": "spielbarkeit und optik geht hand in hand das ist ein bisschen was was beispielsweise die"}, {"id": 241, "start": 2029.0, "end": 2033.88, "text": "valorant maps die die ich kenne die ich gesehen habe nicht gut hinbekommen die mögen spielbar"}, {"id": 242, "start": 2033.88, "end": 2047.12, "text": "sein aber die gehen nicht gut hand in hand mit der umgebung so was ist twitter post von was"}, {"id": 243, "start": 2047.12, "end": 2053.56, "text": "so ein work in progress changes"}, {"id": 244, "start": 2053.56, "end": 2058.04, "text": "ja das haben wir gerade schon gesehen"}, {"id": 245, "start": 2061.76, "end": 2066.64, "text": "ist das eigentlich so schwer in der engine was umzubauen also ich kann dir nur meinen"}, {"id": 246, "start": 2066.64, "end": 2074.8, "text": "noob eindruck da jetzt sagen weil keiner von uns hat hier mit frostbite gearbeitet aber ganz"}, {"id": 247, "start": 2074.8, "end": 2082.84, "text": "im ernst wenn es so schwer wäre da was drinne zu platzieren dann könnten sie darin keine games"}, {"id": 248, "start": 2082.84, "end": 2089.0, "text": "entwickeln ich meine vielleicht sind die tools nicht so geil wie man das aus aus unreal oder"}, {"id": 249, "start": 2089.0, "end": 2096.68, "text": "so kennt aber ich aber mal ein vergleich ein vergleich ich habe früher gerne half life maps"}, {"id": 250, "start": 2096.68, "end": 2100.96, "text": "gemacht ich war nie wirklich so krass gut dass meine maps irgendwo gespielt wurden oder so ja"}, {"id": 251, "start": 2100.96, "end": 2106.04, "text": "aber ich habe gerne half life maps gemacht einfach weil ich es cool fand zu sehen was"}, {"id": 252, "start": 2106.04, "end": 2112.8, "text": "man selbst bauen kann und das hättest du damals in worldcraft nannte sich das in half life an"}, {"id": 253, "start": 2112.8, "end": 2123.4, "text": "nichts mehr mit minecraft zu tun worldcraft das hast du damals in worldcraft in paar minuten"}, {"id": 254, "start": 2123.4, "end": 2132.64, "text": "gemacht sowas gar nicht ob es da gescheite gescheite bild davon gibt ja guck hier kisten"}, {"id": 255, "start": 2132.64, "end": 2137.44, "text": "luftung schächte also was hast du auch ein paar hast du auch in paar minuten gemacht damals im"}, {"id": 256, "start": 2137.44, "end": 2143.56, "text": "half life editor hier solche dinge platziert und wenn du sowas damals schon easy as fuck gemacht"}, {"id": 257, "start": 2143.56, "end": 2153.68, "text": "hast natürlich nicht auf solchen riesen riesen das ist der eins zu eins cscone zwischenteilig"}, {"id": 258, "start": 2153.68, "end": 2161.72, "text": "hatten ihren hammer editor nicht weiß gar nicht wie das jetzt heißt tatsächlich das sieht immer"}, {"id": 259, "start": 2161.72, "end": 2178.48, "text": "noch so aus ja damals ist das worldcraft und da wie gesagt ich hab ich hab gerne half life"}, {"id": 260, "start": 2178.48, "end": 2186.72, "text": "maps gemacht damals und dort fertige assets zu platzieren war easy copy paste blub blub blub"}, {"id": 261, "start": 2186.72, "end": 2202.28, "text": "moment ich muss die musik ausmachen sonst äußerst verwirrend wenn mario musik im hintergrund läuft"}, {"id": 262, "start": 2206.12, "end": 2210.16, "text": "die können keine mod tools freigeben die haben keine mod tools die haben nur ihre eigenen tools"}, {"id": 263, "start": 2210.16, "end": 2215.72, "text": "und die sind glaube ich so scheiße da drin will keiner mods entwickeln spiele wo das gut funktioniert"}, {"id": 264, "start": 2215.72, "end": 2220.36, "text": "sind so sachen wie beispielsweise half life 1 und 2 weil die die tools die sie verwendet haben um"}, {"id": 265, "start": 2220.36, "end": 2225.36, "text": "das spiel zu entwickeln auch als mod tools released haben bzw wahrscheinlich schon in"}, {"id": 266, "start": 2225.36, "end": 2229.84, "text": "der entwicklung auch ein bisschen darauf geachtet haben dass die tools später freigegeben werden"}, {"id": 267, "start": 2229.84, "end": 2236.24, "text": "soll ich glaube mit den frostbite tools will von uns keiner was entwickeln was hältst du von einer"}, {"id": 268, "start": 2236.24, "end": 2246.12, "text": "portfolio webseite das ist jetzt so ziemlich aus dem nichts aber für was für dienstleistung die"}, {"id": 269, "start": 2246.12, "end": 2254.08, "text": "du anbietest oder wie oder was oder dann mach also verstehe ich nicht was soll ich dazu sagen wenn"}, {"id": 270, "start": 2254.08, "end": 2258.56, "text": "du was verkaufen willst oder werbung für dich machen will sicher dass mit sicherheit sinnvoll"}, {"id": 271, "start": 2258.56, "end": 2263.12, "text": "was aber sinnvoller ist falls du jobs suchst oder so mit sicherheit ist ein ordentliches link in"}, {"id": 272, "start": 2263.12, "end": 2266.36, "text": "profil ansonsten weiß nicht keine ahnung"}, {"id": 273, "start": 2273.28, "end": 2273.78, "text": "ka"}, {"id": 274, "start": 2277.12, "end": 2281.08, "text": "ja finde ich schon sinnvoll finde ich also wenn man was zum wenn man was vor"}, {"id": 275, "start": 2281.08, "end": 2286.12, "text": "zeigbares hat und vielleicht das auch mal sagen wir für im weiteren sinn gefasst für"}, {"id": 276, "start": 2286.12, "end": 2296.64, "text": "seine karriere einsetzungen klar warum nicht das finde ich schon sinnig ja die renn oh leute es"}, {"id": 277, "start": 2296.64, "end": 2300.64, "text": "hat sich an der map struktur was fährt random fragen ist kein ding random fragen ich mag random"}, {"id": 278, "start": 2300.64, "end": 2304.6, "text": "fragen manchmal verstehe ich den zusammenhang nicht was die leute genau wissen was guck mal"}, {"id": 279, "start": 2304.6, "end": 2312.52, "text": "tatsächlich tatsächlich änderung an der map struktur da liegt jetzt irgendwie so eine so"}, {"id": 280, "start": 2312.52, "end": 2319.08, "text": "eine geöffnete dose oder so weiß ich genau was hat immer ein plan was das sein soll bestimmt"}, {"id": 281, "start": 2319.08, "end": 2324.44, "text": "copy pasted von einer anderen map ok um diese rege um dieses areal mit container ist es sicherlich"}, {"id": 282, "start": 2324.44, "end": 2329.56, "text": "nicht schade abgestürzte kapsel vielleicht ja"}, {"id": 283, "start": 2334.76, "end": 2340.88, "text": "vielleicht oder abgestürzte kapsel die vorne auf der rakete drauf ist es könnte tatsächlich"}, {"id": 284, "start": 2340.88, "end": 2348.4, "text": "so in so ein mcdonalds deckel sein von der cola es ist nachts kälter als draußen boah das ist ja"}, {"id": 285, "start": 2348.4, "end": 2355.44, "text": "das ist ja die oldschooligste tschübait frage die ist ja die hat ja schon hätte schon kinder"}, {"id": 286, "start": 2355.44, "end": 2359.64, "text": "gekriegt die tschüb diese frage die ist die ist ja schon so alt"}, {"id": 287, "start": 2363.48, "end": 2370.72, "text": "aber das finde ich so musst du es machen so hätten sie es überall machen müssen"}, {"id": 288, "start": 2370.72, "end": 2376.08, "text": "dass die map struktur halt sinnvoll irgendwie geändert so ist das ok ja man hat jetzt hier"}, {"id": 289, "start": 2376.08, "end": 2381.6, "text": "so einen kleinen so eine kleine schlucht und hier so das ist das ist eine gute map änderung da"}, {"id": 290, "start": 2381.6, "end": 2387.76, "text": "hat mal der map designer beziehungsweise der mapper wie man das sonst so genannt hat mal"}, {"id": 291, "start": 2387.76, "end": 2397.48, "text": "tatsächlich bock gehabt jetzt bin ich aber mal gespannt wie sie in eineinhalb stunden uns"}, {"id": 292, "start": 2397.48, "end": 2404.0, "text": "experiences und new modes und new content zeigen wollen da kommt wahrscheinlich jetzt gar nichts"}, {"id": 293, "start": 2404.0, "end": 2408.6, "text": "da kommt wahrscheinlich einfach nur wir arbeiten an neuem content keckel und tschüss"}, {"id": 294, "start": 2408.6, "end": 2425.84, "text": "eineinhalb minuten das ist jetzt kommt season 2 aber container haben sie da auch ordentlich"}, {"id": 295, "start": 2425.84, "end": 2438.04, "text": "drin oder ich meine irgendwann ist es mal gut mit container eine container base ist"}, {"id": 296, "start": 2438.04, "end": 2448.56, "text": "feifett aber immerhin ein paar nette particle effekte wo auch beide wei leute blöde frage"}, {"id": 297, "start": 2448.56, "end": 2462.64, "text": "warum wo kommen die her warum kommen da irgendwelche partikel runter ist da oben"}, {"id": 298, "start": 2462.64, "end": 2471.96, "text": "irgendwie stahl was gegossen wird oder warum fallen hier so partikel runter mehr container"}, {"id": 299, "start": 2471.96, "end": 2486.16, "text": "alter leute jetzt über leute warum warum sind auf den container pflanzen drauf was ist das für"}, {"id": 300, "start": 2486.16, "end": 2500.56, "text": "eine map was sehe ich da das ist doch keine map jetzt mal ernsthaft ich mein manifest besteht"}, {"id": 301, "start": 2500.56, "end": 2507.04, "text": "zur hälfte schon aus container am anfang ja aber warum sind es noch mehr container alter und warum"}, {"id": 302, "start": 2507.04, "end": 2520.44, "text": "stehen da einfach random kleine palmen und bäume auf den container man habe ich gesehen also"}, {"id": 303, "start": 2520.44, "end": 2527.84, "text": "sekunde das haben wir jetzt gesehen das haben wir gesehen und das ist jetzt noch mal so ein"}, {"id": 304, "start": 2527.84, "end": 2534.88, "text": "typischer gang der eins zu eins aus moment ist das überhaupt die neue map oder ist das manifest"}, {"id": 305, "start": 2534.88, "end": 2540.16, "text": "rework leute habt ihr das mitbekommen ist das die neue map oder ist das vielleicht manifest im"}, {"id": 306, "start": 2540.16, "end": 2540.68, "text": "rework"}, {"id": 307, "start": 2540.68, "end": 2557.68, "text": "das ist die neue map oder das ist die neue map guckt euch mal die die fässer da wo sind"}, {"id": 308, "start": 2557.68, "end": 2562.4, "text": "wir ist das das ikea waren lager oder wo sind wir hier ich meine schwedische entwickler würde"}, {"id": 309, "start": 2562.4, "end": 2572.96, "text": "jetzt ja kann ja kann ja sein und da sieht es bestimmt so aus"}, {"id": 310, "start": 2582.08, "end": 2588.72, "text": "und was ist hier hinter den container noch mehr container sehe ich das richtig das ist"}, {"id": 311, "start": 2588.72, "end": 2595.52, "text": "ein k.i. map generator der das gemacht hat bestimmt wer würde container so stapeln vor"}, {"id": 312, "start": 2595.52, "end": 2602.68, "text": "allem dinger die da rausgucken das ist eine wirklich gut berechtigte frage was ist das da"}, {"id": 313, "start": 2602.68, "end": 2609.96, "text": "im hintergrund so und das ist irgendwie so was wie von die rail oder wie die map heißt nie"}, {"id": 314, "start": 2609.96, "end": 2619.84, "text": "wie heißt die map die rail war eine mw2 map das ist also so ein schiffskorridor wo mal"}, {"id": 315, "start": 2619.84, "end": 2627.2, "text": "tatsächlich andere formen von containern rumstehen und half life kisten oder ist das jetzt im"}, {"id": 316, "start": 2627.2, "end": 2640.28, "text": "container sind jetzt im container drin es gibt es sieht aus wie auf kaleidoskop hier ein bisschen"}, {"id": 317, "start": 2640.28, "end": 2651.48, "text": "ja moment ja jetzt habt ihr noch eine minuten zeit für experiences und new content jetzt kommt"}, {"id": 318, "start": 2651.48, "end": 2657.24, "text": "das war es mit experiences und new content das wurde jetzt mal kurz so ja übrigens leute hier"}, {"id": 319, "start": 2657.24, "end": 2660.88, "text": "gibt es ein paar neue container auf der neuen map das ist jetzt experiences und new content"}, {"id": 320, "start": 2660.88, "end": 2675.24, "text": "bam auf geht's next experiences und mode ok new content achtung eine minuten zeit noch wir sehen"}, {"id": 321, "start": 2675.24, "end": 2693.92, "text": "hier alle da ist mit arbeiter die nicht an battlefield 2042 arbeiten ist ja was ist ja"}, {"id": 322, "start": 2693.92, "end": 2710.04, "text": "das spielt bestimmt gerade battlefield 4 und deswegen haben sie es geblatt oder bf1"}, {"id": 323, "start": 2723.92, "end": 2734.04, "text": "das war jetzt new content oder was zu sagen wir machen gerade ganz viel"}, {"id": 324, "start": 2734.04, "end": 2738.68, "text": "neuer content wir können euch zwar nach acht monaten noch keinen richtigen neuen content"}, {"id": 325, "start": 2738.68, "end": 2766.44, "text": "zeigen aber wir machen gerade ganz vielen neuen content skorpi danke für den sup ja ja ja was"}, {"id": 326, "start": 2766.44, "end": 2778.16, "text": "halte ich davon ich mein gut dass sie überhaupt was machen ansonsten halt wirklich minimalst"}, {"id": 327, "start": 2778.16, "end": 2802.32, "text": "leistung was man erbringt dort ja ja weiß gar nicht was ich da groß zu sagen soll also"}, {"id": 328, "start": 2802.32, "end": 2813.0, "text": "ist jetzt nicht dass ich wirklich dass ich übelst ausrasten würde über das update ich gucke mir"}, {"id": 329, "start": 2813.0, "end": 2816.72, "text": "season 2 und die neue map auf jeden fall an leute wir gucken uns das auch auf jeden fall"}, {"id": 330, "start": 2816.72, "end": 2826.4, "text": "im stream zusammen an wenn es denn dann soweit ist ob das dadurch in irgendeiner art und weise"}, {"id": 331, "start": 2826.4, "end": 2836.28, "text": "wirklich größeren also widerspielwert bekommt ich weiß nicht aber ich sag euch wie es das"}, {"id": 332, "start": 2836.28, "end": 2839.6, "text": "war sich schon seit monaten quasi schon seit ein paar wochen nach wie ich sage die liefern"}, {"id": 333, "start": 2839.6, "end": 2845.2, "text": "halt das absolut mindeste mindeste ab gerade mit den seasons dass sie nicht verklagt werden"}, {"id": 334, "start": 2845.2, "end": 2848.76, "text": "können im zweifelsfall und dann kommt irgendwann das nächste battlefield und dann können wir"}, {"id": 335, "start": 2848.76, "end": 2853.92, "text": "nur hoffen dass das nächste battlefield besser wird vielleicht vielleicht ich meine die hoffnung"}, {"id": 336, "start": 2853.92, "end": 2861.32, "text": "stirbt ja zuletzt ja vielleicht musste battlefield 2042 einfach mal so richtig ins klo greifen dass"}, {"id": 337, "start": 2861.32, "end": 2870.2, "text": "das nächste battlefield die chance hat besser zu werden wie gesagt kopium hoch 3 aber vielleicht"}, {"id": 338, "start": 2870.2, "end": 2877.76, "text": "ist es ja so wann kommt es raus ich glaube in zwei oder drei wochen kommt die nächste season"}, {"id": 339, "start": 2877.76, "end": 2881.44, "text": "übrigens das was du in dem video gesehen hast die helfe davon kommt ja erst mit season 3"}, {"id": 340, "start": 2881.44, "end": 2891.92, "text": "level cap stellt das vor new huge game changing massive neugigkeiten oder so"}, {"id": 341, "start": 2891.92, "end": 2903.28, "text": "ja portal juckt ja anscheinend auch nicht mehr genau was ist denn season 2 bf release"}, {"id": 342, "start": 2903.28, "end": 2915.68, "text": "update ich glaube irgendwann anfangen september haben die gesagt oder nicht am ersten"}, {"id": 343, "start": 2915.68, "end": 2922.36, "text": "genau die am anfang september gesagt deswegen sage ich ja die nächsten zwei wochen vielleicht"}, {"id": 344, "start": 2922.36, "end": 2942.96, "text": "oder die nächsten zwei drei wochen hat es wenigstens einem gefallen das ergibt jetzt"}, {"id": 345, "start": 2942.96, "end": 2947.36, "text": "auch sinn warum die warum die container so komisch angeordnet waren der orchestrator hat"}, {"id": 346, "start": 2947.36, "end": 2956.24, "text": "nicht so richtig orchestrated wisst ihr was dem spiel wirklich gut tun würde was aber zu"}, {"id": 347, "start": 2956.24, "end": 2962.08, "text": "wenig ja wie soll ich sagen zu wenig bringt unterm strich und und sicherlich auch zu viel"}, {"id": 348, "start": 2962.08, "end": 2967.24, "text": "auffangen ist ein ordentlicher soundtrack würde dem spiel wirklich gut tun ich meine hört euch"}, {"id": 349, "start": 2967.24, "end": 2978.12, "text": "mal an nur mal so wir machen mal kurz den vergleich nicht bfbf eins er hört euch zum"}, {"id": 350, "start": 2978.12, "end": 3005.32, "text": "beispiel das hier an es geht jetzt erst los ja wartet mal bis das richtig los geht das ist"}, {"id": 351, "start": 3005.32, "end": 3020.92, "text": "richtig gut das soundtrack bf eins jetzt ja das dauert kurz bis es halt ist halt menü ist"}, {"id": 352, "start": 3020.92, "end": 3039.76, "text": "halt menü sound aber hört sich wirklich ein bisschen nach hans zimmer an aber ist"}, {"id": 353, "start": 3039.76, "end": 3053.2, "text": "wahrscheinlich nicht die partys können das ja auch das hat richtig gut das soundtrack"}, {"id": 354, "start": 3053.2, "end": 3072.88, "text": "jetzt jetzt das finde ich das hat was das hat wirklich was also oder auch später dann"}, {"id": 355, "start": 3072.88, "end": 3080.28, "text": "das hat richtig melodie und passt atmosphärisch zum game"}, {"id": 356, "start": 3086.28, "end": 3091.68, "text": "so jetzt haltet euch fest haltet euch fest jetzt haltet euch fest achtung"}, {"id": 357, "start": 3093.6, "end": 3096.76, "text": "das ist richtig gut das soundtrack ja von bf eins"}, {"id": 358, "start": 3096.76, "end": 3103.04, "text": "und jetzt achtung achtung ordn zu halten ordn zu halten"}, {"id": 359, "start": 3103.04, "end": 3130.68, "text": "so was würde ich mir vorstellen wenn irgendwie einer versucht meine übertragung zu meine"}, {"id": 360, "start": 3130.68, "end": 3135.64, "text": "funk übertragung zu jam dann würde er zu zu stören dann würde er sowas spielen ja"}, {"id": 361, "start": 3135.64, "end": 3149.16, "text": "kaige kaige generated soundtrack also ich gehe davon aus dass es hildur günners dort hier"}, {"id": 362, "start": 3149.16, "end": 3161.84, "text": "und sam slater sicherlich besser können hört euch das an mann was ist das das tut weh was ist"}, {"id": 363, "start": 3161.84, "end": 3172.08, "text": "das also ich mein wer hat das partys gehört hat sich gedacht das ist es das ist der soundtrack"}, {"id": 364, "start": 3172.08, "end": 3182.0, "text": "für unser game und und verdankt und und verdankt dass es besser wird guckt es immer mehr wer denkt"}, {"id": 365, "start": 3182.0, "end": 3211.28, "text": "dass es besser wird monkels alter alter"}, {"id": 366, "start": 3212.0, "end": 3226.48, "text": "was ist das ich mein wir dürfen nicht vergessen passt mal auf wir dürfen nicht vergessen die haben"}, {"id": 367, "start": 3226.48, "end": 3244.44, "text": "mal soundtracks geschrieben wieso was hier"}, {"id": 368, "start": 3256.48, "end": 3275.04, "text": "die können das ja die können das ja aber in 2042 können die das nicht"}, {"id": 369, "start": 3275.04, "end": 3286.96, "text": "ich weiß nicht ich weiß nicht leute keine ahnung was mit den schweden abgeht in dem fall unverständlich"}, {"id": 370, "start": 3286.96, "end": 3299.96, "text": "ja es hört sich wirklich so an als haben die den soundtrack in einem der container aufgenommen"}, {"id": 371, "start": 3299.96, "end": 3305.36, "text": "die da so rum steht genau so hört sich das an und im hintergrund sind noch ein paar sachen"}, {"id": 372, "start": 3305.36, "end": 3314.68, "text": "runtergefallen genauso hört sich an leute gebt euch mal ein ruck noch vier follows bis 21.000"}, {"id": 373, "start": 3314.68, "end": 3333.64, "text": "follower noch zwei follows bis keine subscriber follows follows also follows follows kosten"}, {"id": 374, "start": 3333.64, "end": 3343.76, "text": "ja nur wirklich nix hier wer noch nicht gefollowed hat haut rein wahrscheinlich kommt jetzt gleich"}, {"id": 375, "start": 3343.76, "end": 3357.16, "text": "wahrscheinlich sind es gleich wieder fünf oder so der erste hat wirklich an follow follow"}, {"id": 376, "start": 3357.16, "end": 3362.16, "text": "danach hat er gleich wieder folgst du hättest das noch nicht mal sagen müssen ich wahrscheinlich"}, {"id": 377, "start": 3362.16, "end": 3366.56, "text": "warst du es noch nicht mal wahrscheinlich warst du es noch nicht mal und sagst jetzt einfach dir"}, {"id": 378, "start": 3366.56, "end": 3379.52, "text": "traue ich das direkt zu das passt einfach alter jetzt haben wirklich fünf leute entfollowed"}, {"id": 379, "start": 3379.52, "end": 3384.24, "text": "macht was ihr wollt alter ich gehe jetzt auf habt ihr jetzt davon ich gehe jetzt wirklich"}, {"id": 380, "start": 3384.24, "end": 3403.8, "text": "auf weil bettgetheim boomer müde gleich 22 uhr flow dankeschön für den sub bettgetheim"}, {"id": 381, "start": 3403.8, "end": 3423.92, "text": "wegen jemand hosten ja ich muss tatsächlich morgen arbeiten den den sprecher haben wir"}, {"id": 382, "start": 3423.92, "end": 3443.88, "text": "glaube ich letztes mal schon gehostet na gut alles klar leute wir sehen uns macht es gut"}, {"id": 383, "start": 3443.88, "end": 3453.44, "text": "bis denn bis zum nächsten mal zu und dann nächstes mal ist progas angesagt wieder bis"}, {"id": 384, "start": 3453.44, "end": 3477.64, "text": "denn zu"}]}