{"text": "K. E. K. W. Moin Leute, da bin ich. Genauso pepo fett wie das letzte Mal. Ne das stimmt nicht, ich hab weiter abgenommen. Leute es geht immer weiter abwärts. Was natürlich sehr pogge ist, weil ich war vorher einfach zu dick. Aber jetzt, jetzt ist alles gut. Ich kann nicht reden und tippen gleichzeitig, da erzähl ich einfach nur Blödsinn. Nicht zusammenhängenden Kram. Denkt euch nichts dabei. Steinadler 5. 7 Monate Massive Subscription. Dankeschön. Ich hab heute mal was lustiges von der Arbeit mitgebracht. Wir werden heute natürlich anonymisiert. Ihr wisst ja, wir werden heute was bauen, was ich auf der Arbeit brauche. Wir haben ja schon das ein oder andere Mal Sachen programmiert, die da ganz interessant waren und die ich dann im Endeffekt für die Arbeit verwenden kann. Rechnest du das ab? Ehrlich gesagt, keine Ahnung, ob ich das abrechnen kann. Ich kanns mal probieren. Wahrscheinlich könnte ichs auch abrechnen, aber ganz ehrlich, ich hab keinen Bock dazu zu sagen, guck mal hier, hier hab ich live gestreamt. Ne. Letztendlich unterm Strich kommt aber was sinnvolles für die Arbeit bei raus. Ich erzähl euch auch gleich was. Ist tatsächlich zum Teil etwas, aber nur zum Teil. Es ist eine Mischung, es ist eine Mischung aus und so ungefähr. Weil warum wir das machen, ist ziemlich monkaW bzw. eigentlich ist es lustig. Muss mal kurz was gucken. Ich glaub Teams hat am Sounds wieder rumgestellt. Yep. Yep. Yep, Han hat am Sounds rumgestellt. Während der Stream anläuft, ich mach mal die VM an und ich mach mal Update und dann erzähl ich euch, ist die Wallbox schon montiert? Leute, ich sag's euch. Ich wollt beim Elektriker einen Termin vereinbaren. Also ich hab mir vor, ich muss, ok. Leute, ich mach mal ein paar Tabs zu, es ist einfach zu viel auf. Dann sag ich, dann sag ich gleich was zu. Meine Güte, ist viel zu viel. Guckt euch das mal an. MonkaS. Leiter gar nicht mehr auf. Wie sieht eigentlich, ok New World, New World, aha aha aha. Äh. Was macht Battlefield? Na gut, die gehen jetzt wieder hoch, weil die haben hier Season 2 gelauncht. Season 2 hab ich tatsächlich noch nicht ausprobiert. Weiß jemand, wann Season 2 gelauncht ist? Hat das jemand von euch im Kopf? Gestern oder so? Wer ist denn vorgestern? Wieso nicht lang her? Ja, aber um mal was zum Thema Wallbox zu sagen. Save. Was haben wir denn hier? Ah, hier haben wir noch den Hetzer Kram auf. Das brauchen wir ja gar nicht mehr. Oh, Moment Leute, ich mach mal nebenbei Update, dann erzähl ich euch was. Nichts zum Updaten, das ist auch gut. Aber ich starte mal neu. Dann erzähl ich euch was. Also. Mach mal Update. Cody? Was? Warum hab ich hier? Ok. Was auch immer. Installieren wir jetzt einfach? Yes. Also, ja, zu diesem Thema. Ist die Wallbox schon montiert? Dazu kann ich was erzählen. Also, für alle die sich mitgekriegt haben, jetzt nochmal ganz kurz in Kürze, ich hab mir ein Elektroauto gekauft, nehm ich den hier. Und ich hab versucht, mir bei einem Elektriker einen Termin zu machen. Der Konfigurator ist irgendwie kaputt. Von Fiat. Also das Ding hat einen 42 Kilowattstunden-Agu. Und. Dementsprechend ist es natürlich ziemlich mühselig, das aus dem. Ziemlich mühselig, das aus dem normalen Stecker zu laden. Ich habe mir bei Amazon einen Stecker bestellt mit 10 Meter Kabel, dass ich das machen kann, bis ich ein Ladegerät ins Zähne hab. Zumindest. Also. Ich hab mir dieses Ding gekauft als Elektroauto. Und jetzt geht es darum, wie kann ich das möglichst schnell laden. Also hab ich mich mal umgeguckt, was Ladeboxen angeht. Und ich hab mich entschieden für dieses Ding hier. Aus mehreren Gründen. Also das hab ich auch schon bestellt bei Amazon, das liegt bei mir daheim. Die Seite ist wahnsinnig geschwind, gerade aktuell. Das liegt bestimmt am Dark Reader. Dark Reader macht hier bestimmt Probleme. Mach mal kurz. Wer von euch macht hier schon wieder Hacker, man? Gibt es 2Chat, ihr seid das. Dass es so langsam ist hier. Twitch Chat Ddos. Nee, ist absolut null ausgelastet, der Rechner. Guck mal, dieser Idle Prozess ist ganz schön aktiv. Niedu, Dankeschön für den Sub. Ackermans. Genau, ich hab mich für dieses Ding hier entschieden. Und das liegt daran, weil. Guck mal, ob die das hier in dieser Broschüre schreiben. Also. Es ist so, wenn man ein 22 Kilowatt Ladegerät bei sich daheim installieren will, dann muss der Netzbetreiber zustimmen und der Netzbetreiber will dann auch irgendeine Notabschaltung und sowas da installiert haben. Da hab ich keinen Bock drauf gehabt, deswegen hab ich die 11 Kilowatt Variante. So. Und warum hab ich mich dafür entschieden? Weil dieses Ding wirklich selten ist es ja heutzutage. Offene Apis hat. Das Ding hat die Möglichkeit sich ins heimliche WLAN zu hängen, per HTTP angesprochen zu werden und per MQTT angesprochen zu werden und es gibt auch schon fertige. Es gibt auch schon fertige Integrations. Es gibt auch schon komplett fix und fertige Integrations für Homosystem für das Ding. Mal gucken, ob die was taucht, wenn ich. Oh ja, sehr große Schrift. Wenn nicht, mach ich. Hat Github irgendwas geändert? Github sieht heute irgendwie ein bisschen anders aus. Ja, und wie gesagt, es gibt fertige Integrations und dann kann man in seiner Heimautomatisierung das ganze Ladegerät sinnvoll fernsteuern. Man hat dann zum Beispiel so Sachen wie automatischer Stop, mit wie viel Ampere das Ding laden soll, man kann das ganze Limit, man kann sagen laden an, aus und sonst was und in Kombination mit dann sein Auto quasi noch abfragen, wie voll es ist, dann kann man richtig, richtig coole Sachen machen bzw. kann dann beispielsweise auch sagen, ich lade plus bis 90 oder ich lade jetzt mal volle Pulle voll oder ich lade vielleicht erst heute Nacht oder was weiß ich, ich lade jetzt gar nicht, ich fange dann erst mal mit, was auch immer. Egal, man hat die Werte. Das ist einer der Hauptgründe, warum ich gesagt habe, ich nehme die, weil die offene Apis hat. Du kannst HTTP und MQTT machen. So, jetzt natürlich die Sache, ich habe das schon bei mir daheim liegen und jetzt wollte ich beim Elektriker einen Termin machen und dann erzähle ich euch, was wir heute mit Prometheus machen, was auf der Arbeit war. Also ich wollte einen Termin beim Elektriker machen und ich habe ungelungen oder bei sechs, sieben verschiedenen Elektriker angerufen und habe die gefragt, ich habe ein Ladegerät bei mir daheim und ich will das angeschlossen haben. Ich habe mit dem Netzbetreiber schon alles geklärt und wisst ihr, was die allesamt gemacht haben? Die haben allesamt das hier gemacht, als ich die angerufen habe. Alle, die haben alle gesagt, es dauert Wochen bis Monate. Die haben wirklich, die haben sich wirklich, die haben nicht das gemacht, die haben nicht das gemacht, die haben allen Ernstes schon das gemacht. So, also die haben sich, die haben sich weggekackt und haben gesagt, es dauert ein paar Monate bis ich dran komme. Also habe ich mal weiter, also ich habe, wie gesagt, ich habe sechs, sieben Elektriker angerufen und der eine war geil, der eine war geil, ähm, da habe ich angerufen und da war irgendwie, war irgendwie, klang irgendwie russisch oder so, habe ich gedacht, hä, wo bin ich denn hier gelandet? Wo, wo, wo bin ich, wo bin ich denn hier gelandet? Wie, wie, wie komme ich auf einmal bei den Gekommodats raus? Und habe ich gedacht, ja, bin ich hier richtig bei, äh, ja, Elektriker Name, blablabla und dann meint der, ja, sie richtig, aber ich probleme mit Deutsch. Da habe ich gemeint, ach, das ist kein Problem, ich kann später auch anrufen, wenn irgendwie jemand da ist, wo das, wo das besser funktioniert, müsste ich jetzt nicht anstrengen. Ähm, aber nein, nein, nicht später anrufen, kann das auch machen. Äh, okay, ähm, dann, dann erzähle ich ihnen jetzt mal, was ich will, habe ich gesagt, ich habe eine Ladestation gekauft, will das bei mir, will das bei mir im Hof angeschlossen haben und dann das erste, bevor der irgendwie gefragt hat, was ist das für eine Ladestation oder wo sind sie oder, oder irgendwas, hat er zu mir gesagt, das, das, ne, was hat er gesagt, das wird kosten, hat er gesagt, das wird kosten und da habe ich mir schon gedacht, hm, das klingt, klingt jetzt erstmal nicht so vertrauenserweckend und dann meinte er weiter, das wird kosten, 900 Euro und da habe ich mir gedacht, hm, das ist vielleicht ein bisschen teuer, wenn ich mir überlege, dass es einfach nur angeschlossen werden muss und die Station selber billiger war, also nein, ich, ich schaue, ich schaue mich nochmal um, das wird kosten, naja, zudem bin ich nicht und dann habe ich tatsächlich noch einen gefunden, der gesagt hat, nächste Woche Mittwoch kann er sich das mal angucken, hast du schon eine Leitung zur Garage, ne, die kommt bei mir nicht in die Garage, die kommt bei mir im Hof, dort wo nicht so viel Sonneneinstrahlung ist und ein bisschen unterm Dach, im Hof, man kann direkt vom Keller, man muss ein bisschen Verlängerungskabel machen, so, so, so eine Zwischenbox wahrscheinlich an die Wand machen, aber das ist ja für einen Elektriker nichts, nichts wildes und dann kann man vom Keller direkt durch, durch ein Fenster bzw. durch, durch ein Holzding im Fenster in, in Hof und direkt an die Wand machen, ja, ich denke mal, wenn der so eine Zwischenbox setzt und so, sagen wir mal, der ist eine Stunde beschäftigt, wenn das am Ende 200 Euro kostet, meinetwegen, aber 900 Euro, also, das wird kosten, 900, 900 Euro, also, ne, ne, wirklich nicht, zumindest, entweder monatelang warten oder 900 Euro, ich hab da noch einen gefunden, ich hab da noch einen gefunden, der gesagt hat, er kann sich das nächste Woche Mittwoch oder irgendwie dann die Tage mal angucken, wenigstens, aber ich sag, nice, sehr gut, jetzt machen wir, auf gehts, Musik ist mir zu anstrengend, ich brauch was entspannenderes, Leute, was, was hab ich da, oft hat der Chat irgendwann mal gepostet, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, wo ist, wo ist meine Relaxing, nein, auch nicht Kirby Go Mirrors, wo ist meine Relaxing Mario Musik, wo ist es, Relaxing Mario, hier, das, die will ich haben, ah, yes, exellent, Entspannungsmusik vom Anfang zu basteln, ah, ok, also, dann erzähl ich euch mal was, und zwar, also, was wir heute machen ist folgendes, mal gucken, ob ich 5 hätte, das ist falsch, das wollte ich gar nicht, wo bin ich, ah, wo bin ich, ich hab zu viele Tabs, Leute, Monka, hier, das ist die Lautstärke, ah, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, Fertig sind mein toolbox updates checken kurz und dann mache ich alles ab den guck mal da Check vor updates also ich erzähle euch jetzt mal kurz was wir heute machen Während der hier alles updatet also es gab was zu kecken bei mir auf der arbeit Also richtig und zwar also ihr seht es ja schon im titel titel heute des streams ist ja mail Monitoring mit prometo ist für die arbeit Programme also was wir machen ist wir richten nicht wirklich ein komplettes mail monitoring ein wir programmieren einen check für mail Monitoring und zwar wir programmieren einen check ob wir Gepleckliste sind bei gmx und bei web.de Und wer sich jetzt fragt warum Ich werde jetzt mal ich werde das jetzt mal versuchen kurz zu erklären und zwar Das sieht bei uns ich muss das versuchen ein bisschen abstrakt zu erklären also das sieht bei uns auf der arbeit folgendermaßen aus also Wir haben jede menge außendienstmitarbeiter Fast aber die details natürlich nicht also wir haben jede menge außendienstmitarbeiter und die haben zum größten teil die haben natürlich email accounts bei bei der bank wo ich arbeite und Die haben halt private private email accounts also die schicken auch mal Kollegen was an ihre private adresse oder sich selbst an die private adresse oder schicken sie irgendwelche verträge an die private adresse ob es Es dürfen oder nicht sei mal da ist einmal dahingestellt sie machen es aber so Und jetzt ist folgendes folgendes passiert Und genau also und jetzt ist folgendes passiert irgendeiner oder wahrscheinlich mehrere oder was auch immer von unseren außendienstleuten haben gespammt Ist meine vermutung wir wissen es nicht genau zumindest sind wir bei united internet auf der blacklist gelandet mit emails und Das hat dazu geführt Die machen das trickreich die sagen dir das nicht direkt wenn du dort versuchst per smtp deine email abzugeben da kriegst du dann irgendeine meldung Ich habe die meldung vergessen es könnte sogar irgendwas mit rate limit sein oder so also kriegst irgendeine meldung wo du nicht genau drauf schließen kannst Dass sie dich geblacklistet haben oder rate limiten so um die sache noch ein bisschen komplizierter zu machen wir machen unsere externe mail Kommunikation nicht direkt selbst wir haben einen anbieter der für uns Eingehen spam filter macht und ausgehend quasi mit seinen mail server mit dem guten namen da steht dass man nicht geblacklistet wird weil Sowas willst du in der regel nicht selbst betreiben wenn du das über den anbieter machst der größer ist fest bekannt ist mails verschickt Da wirst du eigentlich seltener geblacklistet so was jetzt passiert ist Irgendjemand bei uns hat gespammt Die spam mail sind über unseren spam filter anbieter rausgegangen der filter natürlich nur eingehenden spam Die haben das verschickt an gmx und web.de und was noch was gehört dann freenet und so Was gehört noch ein was gehört alles zu united internet Was sind da alles dabei? Gmx web.de mail.com strato Also da der ganze das ganze geht durchs Und Die emails sind halt nie bei den empfängern angekommen Und unser spam anbieter der dazwischen ist hat allerdings auch die fehler meldung von gmx und von united internet Nie an uns weitergeleitet das heißt united internet hat uns gesperrt in kombination mit unserem absender also mit unserer domain und von den email servern und dann war halt Nix mehr möglich da konnten die typen quasi sich untereinander keine mails mehr schicken und das hat wohl Richtig stress gemacht weil die wollten sich teilweise noch mal verträge heim schicken per mail oder irgendwelche kollegen zum geburtstag einladen so was leute ich sag euch riesen paar riesen panik und im endeffekt Ja so was in der richtung und im endeffekt Ja könnte man jetzt natürlich sagen wir haben gespammt die haben uns zu recht gebannt also Also ich schon okay Aber das kannst du jemanden vom außendienst der von der technik halt keine Ahnung hat nicht erklären und das problem ist halt derjenige der geblockt ist der hat ja auch nicht zwangsläufig gespammt Also irgendwelche leute haben ein bisschen rum gespammt und dafür sind quasi alle dann alle unsere außendienst mitarbeiter betroffen die halt Ein email account bei uns haben was halt alle sind und das ist halt doof so und wie das ganze dann Kurz kurzfassung kurzfassung der ganzen geschichte das ganze ist dann folgendermaßen ausgegangen Unser unser experte für mail Wollte an den support schreiben von gmx Oder ist sein chef zu ihm gekommen noch das wollte er schreiben an einem tag wo das ganze noch gar nicht so schlimm war Ja wo es erst noch seit kurzem kaputt war wollte er an den support von gmx schreiben und sagen jungs Wir scheinen uns geblackliste zu haben und da ist sein chef zu ihm gekommen und hat ihm gesagt nein das machst du jetzt nicht Dafür haben wir quasi extra service manager stellen die sollen das machen so Am nächsten tag also sein chef hat es ihm verboten bei gmx nachzufragen und am nächsten tag Kommt da rein hat er mir erzählt steht der abteilungsleiter bei ihm am platz Und meint das muss man sich jetzt mal auf der zuge zergehen lassen und meint ja er ist da in einer Facebook gruppe wo viele Außendienstmitarbeiter sind und in dieser facebook gruppe wird gerade darüber diskutiert dass unsere emails nicht gehen Das heißt da erstmal über facebook erfahren und dann meinte da meinte mein kollege irgendwie ja klar Ich weiß dass die emails zu gmx und web de nicht gehen wir sind da wahrscheinlich geblacklisted aber ich darf da nix machen Also ich durfte da nix machen ich das sollte der service manager machen und da ist dann muss das Und dann und dann als er das erzählen da ging dann halt richtig Geht es dann halt richtig los zumindest was dann gelaufen ist und jetzt kommt jetzt kommt man wieder der bus des stonks der bus des stonks hammer Wir haben ja keinerlei verbindlichen support weder natürlich bei internet war warum auch wir haben mit denen nichts zu tun noch haben wir verbindlichen support bei unserem spam anbieter wir haben quasi Mach mal support ticket und innerhalb von 48 stunden reagieren wir also unser spam anbieter war da nicht sonderlich hilfreich Jetzt passt mal auf Führungskräfte trick 17 der abteilungsleiter ist dazu seinem chef gegangen und sein chef ist zu unserem it chef gegangen Und unser it chef dem ist aufgefallen er geht immer ich vermute mal squash tennis oder golf mit einem von eins und eins spielen Zumindest zumindest hat er seine kontakte walten lassen oder hat man nach einem halben tag den kommt den kontakt von einem Senior boar irgendeinem irgendeinem typ von gmx einem einem senior Hätte keine hau hette auf spam management ich weiß es nicht ich weiß es nicht was das war Zumindest zumindest hatten wir dann den kontakt von dem typ weil unser it IT vorstandstyp irgendwie golf spielen geht mit dem eins und eins eins vorstandstyp und der kennt irgendeinen typ bei gmx Na ja zumindest Hat er den angeschrieben Und der hat das halt bestätigt dass wir das wir geplacklistet sind Und dann haben sie uns wieder entplacklisten lassen und dann war wieder alles ok Ja und zwischenzeitlich haben sie die ganze zeit in die facebook gruppe geguckt ob es da jetzt nicht der shitstorm zusammenbraut und so was also ganz abgedrehtes zeug So zumindest was ich mir jetzt überlegt habe beziehungsweise was der kollege bei mir auf der arbeit der sich um unsere mail Sachen zum höchsten und größten halt kümmert und ich was wir uns heute überlegt haben Wozu übrigens sein chef auch gesagt hat weiß nicht ob das so eine gute idee ist aber das war alles bevor dieser Bevor dieser große große stress da war also was wir uns jetzt überlegt haben und das was wir heute auch zum teil im stream bauen Frage an euch chat was ist die beste möglichkeit zu checken ob man geplacklistet ist Die euch so einfällt wenn ihr nicht die möglichkeit habt irgendwelche smtp messages oder sonst was auszuwerten oder einfach nur wirklich blackbox auf nummer sicher gehen wollt dass ihr dass eure mails ankommen Ne nicht auf email protokollebene so ganz ganz brain dead Ne ne ganz nein ganz ganz brain dead ganz nicht irgendwelche wir reden nicht von dass man weiß was was wie das unter der haube funktioniert Zumindest auf was auf welche idee wir heute gekommen ist ist folgendes richtig wir machen uns einfach fake accounts richtig wir machen uns fake accounts Wir machen uns fake accounts bei gmx web de strato eins und eins gmail und sowas Und dann schicken wir uns mails und wir schicken uns einfach Haben wir uns überlegt dass wir nicht durch diesen mist noch mal geblockt werden wir schicken uns einfach über eine stunde lang zehn mails als wir schicken uns quasi oder sagen wir so wir schicken uns alle Wir schicken uns alle keine ahnung alle zehn minuten alle zehn minuten schicken wir uns eine mail eine mail an gmx eine mail an eins und eins eine mail an Gmx an web de so und wenn eine stunde rum ist beziehungsweise wenn zehn mails verschickt wurden Gehen wir einfach per imap an die ganzen fake accounts dran und gucken ob dort zehn mails in der inbox liegen Wenn nicht zehn mails in der inbox liegen dann kann man schon mal ein warning raushauen dass man einer nachguckt ob wir nicht wieder geblacklistet worden sind Sven supreme dankeschön für den sub Da habe ich mir so gedacht das müsste ich doch relativ einfach als prometoise exporter programmieren lassen wir brauchen dafür eigentlich von der idee her ein dotnet programm oder in irgendeinem programm was smtp sprechen kann was imap sprechen kann imap sprechen kann und was Prometoise exporter ja eins ist immer so blöd Eins ist eins ist immer blöd also zehn zehn ist schon besser Du bekommst näher nicht zwangsläufig also vom smtp vom smtp schon mal nicht du kannst das anhaken dass wenn du die E-mail liest dass du eine bestätigung kriegst das macht nix leute ganz So blöd bin ich auch nicht Ich schreibe einfach einen geheimen string in die email in das email subject Und nur wenn der geheime string in dem email subject drinne steht nur dann zählt die email als von uns Super so da muss dann sowas drinne stehen wie super geheimer header string oder so Wir haben die gespammt wir wissen es nicht genau wir sind uns nur relativ sicher dass es wohl Zurecht ist der bann was genau weiß ich nicht Okay, was ich würde nicht auf die anstatt ein bau da eine challenge in die mail die du dann überprüfen kannst zum beispiel Ja aber Nee, aber warum ich mache einen geheime string in die email in das email subject dann zähle ich die mails und dann sind zehn E-mails da und gut ist Doch, okay, und wenn nur neun da sind ist es schlecht man könnte vielleicht noch Man könnte vielleicht noch abfangen ob es beim senden ein fehler gegeben hat weil netzwerkprobleme oder so und dann dann zieht man das wo es Sendefehler gegeben hat ab Oder ist es nur ein warning oder so müssen wir mal gucken Ich das weiß ich nicht keine ahnung ich kenne mich mit email ehrlich gesagt auch nicht so gut aus Na moment zehn mal der gleiche text nicht auf einmal wir schicken zehn mal den gleichen zehn mal die gleiche email an Fünf und das stimmt nicht wir schicken fünf mal die gleiche email an An fünf unterschiedliche anbieter also eine email an jedes postfach und das auch nur alle zehn minuten also das ist kein spam Du kannst die message id setzen ja Ja aber wozu das man kann es auch unnötig kompliziert machen es müssen einfach zehn emails da sein und wenn und wenn email Und wenn emails wenn ich zehn emails da sind dann Ja ist klar das lese ich jetzt schnell nebenbei easy So und wenn nicht dann passt das Das bringt mir alles nichts wo soll ich da wissen ob beispielsweise grad webde entschieden hat unsere mails mal Zwei stunden irgendwie liegen zu lassen weil zu viel ist oder so Wo soll das wo sollen die wissen was die intern machen bei bei united internet Was ich mache wenn die email länger in der queue hängt naja der check geht alle zehn minuten das heißt nach der letzten email Dauert es zehn minuten bis sie zeit hat da zu da zu sein dann gibt es gibt es halt einen warning dann gibt es halt eine warning Das dürfen dann die leute die diese am ende verwenden im monitoring einstellen wie sie das haben wollen Ne das ist nicht problematisch Da steht nichts dabei was man irgendwie Zurück da zuordnen könnte Ja also wie gesagt wenn die email zehn minuten in der queue hängt da gibt es halt einen warning pech gehabt Und das müsste ganz gut funktionieren also das heißt als erstes leute müssen uns fake emails machen Wir sind mal komm wir machen uns eine fake email adresse komm wir machen uns eine buggymx, okay Zum testen zum testen reicht eine fake email adresse würde ich sagen Was Alter wie sieht denn die seite aus monka es also registrieren Nein ich bau das nicht in java wir bauen das in dotnet Sieben weil java habe ich keinen bock drauf ich lasse doch mal da wieder an also okay wir brauchen was brauche eine gute Kackel Kackel fake mail alles klar neutra moment moment moment Jetzt fühle ich mich aber schon gleich wieder ausgegrenzt hier So neutral vorname null nachname kackel posterzahl 6 0 3 2 9 frankfurt Jano die kannst du aber nicht per ein map abfragen Und du kannst auch per smtp nix hinschicken Na doch per smtp hinschicken kannst du schon wahrscheinlich was aber du kannst es aber nicht Per ein map abfragen du kannst den dotnet ohne probleme sachen programmieren jetzt schon das kommt im november raus das funktioniert Straße kackel street 5 Geburtstag 1.1. 1990 Passwort okay da dürfte jetzt nicht zu kommen Aber ich habe jetzt schon mal eine fake email adresse und ich habe jetzt schon mal eine fake email adresse 1990 passwort okay da dürfte jetzt nicht zugucken leute Ich muss auch kurz mal mein password mein password manager Passwort manager weg machen okay moment passport und ich muss es ja nachher noch schreiben können okay Okay Okay sehr gut sehr gutes passwort alles klar password wählen password wählen Ist es was ist das jetzt sagt er mir dass das password gut ist oder nicht Ist das password gut oder nicht ich kann es euch zeigen dann wisst ihr ob es gut ist oder nicht Mobilfunknummer Muss man das eingeben Das ist mal lehr zeichen fack null nein 0151 null Exzellent Alles klar das funktioniert schon mal V6 z1 ey Wir schützen ihre daten okay email adresse kackel kackel fake mail Endliche fix punkte alles klar password weiß nur ich sage ich euch nicht Kann ich nicht entziffern Alter Ach muss man das ohne null machen oder wie Ehm muss die kürzer sein vielleicht Okay Fake mail ist ein E-mail E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein E-mail ist ein mobile vorwahl was gibt es denn da alles aha siehst du deswegen 0 1 5 1 1 1 2 3 1 2 2 dings blub blub ok perfekt dvrd jetzt geht's leute ich sags euch bärm was warum alter ach so muss man da auch wieder ohne null nee aber das das checkt er schon weil die mich ver ok die sind so schlau und checken das ok ich guck mal wie lang meine handynummer ist vielleicht vielleicht ist es vielleicht ist es die was ist das temp phone number view kann man die seite aufmachen oder wird man da folgespammt mit mit keck spam shit ok alles klar keine ahnung ich nehme jetzt einfach was von dieser seite da soll mir recht sein wunderbar bkj mp jetzt aber please alter gmx man ok ich guck mal wie lang meine handynummer ist weil die können das doch nicht live überprüfen oder das kann das ist nicht meine telefonnummer leute alles klar excellent ok wie ist die email adresse die keckel fakemail at gimmicks.de aha aha aha nice zum postfach so da sind wir null keck ist am start leute null keck sehr schön sehr schön sehr gut das war tatsächlich schwerer als gedacht ok wir haben es geschafft eine fake email adresse ist am start jetzt können wir unser projekt anlegen und loslegen hätte ich nicht gedacht dass es so schwierig ist eine fake handynummer da einzutragen du du du du du du du du du du du du du du du du ok wunderbar alles klar dann legen wir mal los würde ich sagen äh was nutzt man bei dotnet heutzutage was was nutzt man bei dotnet eigentlich für die gui heute wp mp also mauri auf gar keinen fall mach also mauri ist das neue xamarin forms und das war schon kurze und mauri ist auch müll wpf oder windows forms ja ganz ganz im ernst es ist eigentlich beides ziemlicher müll ich persönlich würde sagen für ganz kleine quick and dirty sachen oder wenn man interop mit anderen plattformen haben will ist windows forms noch am besten weil es einfach windows 32 ist mit ein bisschen mit ein bisschen zucker wpf ist ok windows only zumindest allerdings ist wpf zwar ein bisschen neuer als windows forms allerdings auch nicht wirklich moderner von dem was es kann was ich empfehlen würde ist tatsächlich dass hier was jukjuk schreibt avalonia avalonia ist wirklich nicht schlecht ich habe mit avalonia selbst noch nichts größeres gemacht das wollte ich demnächst im stream ausprobieren aber wenn wenn ich gui machen würde heutzutage in dotnet dann avalonia ich brauche keine wegwerf e-mails ich brauche mails wo ich per imap und smtp draufkomme und uwp kann man halt auch einfach vergessen wenn es microsoft ja mal irgendwie schaffen würde winui 3 rauszubringen und dann halt auch so dass man es benutzen kann für normale anwendung dann wäre das auch eine alternative aber gui frameworks und microsoft das zusammen das funktioniert einfach nicht das können die nicht ich weiß auch nicht warum aber das können die einfach nicht so wir haben es geschafft sondern legen wir mal das projekt für heute an wenn er sich dazu entscheiden kann also mk dir wie heißt das ding mail check champ erstmal dort net7 updaten alles klar repos mail check champ new console ja dann wollen wir mal so neues projekt ist angelegt können wir öffnen weiter starten da toolbox kann zu ach fuck ich habe ja heute mein password geändert für den jetbrains account wahrscheinlich fliege ich gleich wieder raus leute aus meiner ide da muss ich das password gleich nachgucken sollte das so weit sein ok open repos mail mail check champ alles klar ok trust wir trusten alles klar da sind wir so hello world sollte eigentlich machen ja also ok wir können anfangen übrigens das ist ja auch seit dort net hat mich nicht fünf oder so seit sie ist sie schaab neun glaube ich so dass man keine main methode mehr braucht dass er das unter der haufe für ein macht früher musste man hier immer noch machen name space program static main program bla bla bla jetzt kann man jetzt kann man das alles hier hier direkt reinschreiben also sprich das hier ist jetzt ein gültiges dort net program was eigentlich ziemlich ziemlich nice ist so also wir brauchen paar libraries dass das ganze funktioniert das ganze mit eine konsolen anwendung also brauchen wir wahrscheinlich ein bisschen kommandozeilen argumenten und sonst was wir brauchen vielleicht farbische farbische kommandozeilen ausgabe wir brauchen mail kit mail kit ist für smtp und ein map es gibt gefühlt fast jedes jahr ein neues dort net es gibt jedes jahr neues dort net ja die haben releasezyklus von einem jahr also es gibt jedes jahr jedes jahr im november erneut dort net version es ist preview sieben glaube ich aktuell aber das kommt im november raus weiß ich nicht vielleicht dass es beim verschicken was weiß ich warum die das waren vielleicht dass du nicht spammen kannst ja cute ist tatsächlich sehr nice problem ist halt c++ und auch die anderen bindings letztendlich musste irgendwann immer c++ machen ja es gibt jedes jahr neues dort net letztes jahr 6 davor 5 und jetzt 7 das heißt nächstes jahr 8 das ist finde ich aber auch gut weil dann tut sich immer was weil es gibt bestimmt welche mögen sich das nicht wenn an den sprachen und frameworks nicht so viel tut oder wenn man wie bei go 15 jahre auf generics warten muss aber ich ich ich finde es gut dass sich dort net technisch immer was ändert so was jetzt habe ich was vergessen also wo sind wir stehen geblieben wir brauchen wir brauchen mit sicherheit wir brauchen mit sicherheit jason net weil jason braucht man immer jetzt kommt natürlich der erste und fragt warum ich nicht system text jason serializer verwende ganz einfach weil ich keinen bock habe und weil das mir bei manchen sachen immer noch zu kompliziert ist ach ja und in prometheus agent braumer den prometheus exporter library ok so mit was fangen wir dann an wie wie wie legen wir denn jetzt los ich muss jetzt erstmal kurz in mich gehen fangen wir mit den email sachen an oder fangen wir mit den fangen wir mit den mit den prometheus sachen an oder vielleicht müsste ich erst mal ausprobieren der krempel funktioniert ich glaube ich probiere erstmal aus wie das ganze email zeug funktioniert also wir brauchen also grob weiß ja wir brauchen den smtp client ops smtp client was will der haben als option host und port ja gmx imap smtp wie schickt man an gmx was ok mail.gmx.net alles klar auf port 587 und irgendwie tls oder so ok mail.gmx.net port 587 muss man das überhaupt so machen oder musste man nicht irgendwas mit connect machen ne send habe ich das richtige installiert ich muss kurz mein password eingeben für mein jetbrains account dann haben wir es ihr dürft gerade nicht zugucken so jetbrains account wo habe ich denn das password für dieses ding hier das ist auch noch so lang da brauchen wir jetzt wieder 3 stunden das abzutippen und hoffen dass ich mich nicht vertippe habe ich mich jetzt vertippt nein ich habe mich nicht vertippt ok nice alles klar activate exit warum warum schmeißt er mich jetzt raus ok ich kann euch aber wieder anmachen das sollte jetzt funktionieren ne ne ich kann es nicht copy pasten wenn ich copy paste ist es hier in meiner in meiner history und da soll es nicht drinne sein ne ich habe zwei monitore sonst könnte ich das ja gar nicht gescheit machen habe ich wieder eingeschaltet ich habe es falsche eingeschaltet sollte eigentlich längst wieder was sehen ok passt also github mailkit ich brauche paar examples für mailkit mailkit documentation examples smtp so smtp client sag doch connect was so was hat er jetzt wieder für schmerz ne was was moment das ist nicht der smtp client das ist nicht der smtp client von von mailkit das ist der smtp client von von microsoft shit ich will melkit smtp client nicht das microsoft ding da ich wusste gar nicht das system netmail den smtp client hat so smtp client connect so und da wollen wir jetzt mail.gmx.net war es doch oder genau port 587 war es glaube ich secure socket options ja auto auto wunderbar alles klar ich bin so was von ok so using und wie geht es jetzt weiter authentic ach mist jetzt muss ich jetzt muss ich da mal ein password reinschreiben und ihr solltet das password nicht sehen also muss ich irgendwie mal credentials oder so abrufen über ne ja das kriegen wir hin was macht man mit prometheuse sehe ich das richtig das ist eine datenbank zum datensammeln gut also ich würde sagen die meisten datenbanken sind in der regel zum datensammeln prometheuse ist eine time series database für metrigen klingt jetzt natürlich besonders ab dankeschön game shock findet ab versteht natürlich kein mensch was wofür das da ist wenn ich das so sage da kannst du beispielsweise wenn du wenn du eigene anwendung programmierst oder wenn du server überwachen willst kannst du mit musik lautstärke kannst du werte hinschicken wie es aktuell ist zum beispiel wie viel ram verbrauch deine anwendung hat wie auf der garbage collector gelaufen ist oder plattenauslastung von einem system solche sachen also das sind alles metriken und die schickst du dahin die werden zusammen mit einem timestamp gespeichert deswegen ist eine time series database und die kannst du dann relativ effizient querien also da kannst du quasi millionen daten rein machen und hast dann keine 15 minuten bis die grafen aufbauen wie im zabbix damit du das ganze gut verwenden kannst brauchst du aber ein ordentliches frontend weil prometheuse selbst sammelt nur ein da brauchst du sowas wie grafana zum beispiel davor oder ja so zabbix kann diesen prometheuse temple ja auch verarbeiten ja aber wie gesagt wir machen ja heute kein prometheuse server wir machen den noten wir machen den prometheuse exporter also sprich ein check wir lesen daten aus und stellen die auf einer webseite zur verfügung dass prometheuse die abrufen kann prometheuse pullt nämlich immer nur die ganzen infos also sprich du sagst prometheuse ruft mal von diesen drei haus die daten ab und dann geht prometheuse in fünf minuten takt oder wie du es eingestellt hast dahin ruft die daten ab also prometheuse pullt die daten immer kennst du metabase nee ok und am ende smtp client disconnect ich hätte jetzt eigentlich gedacht das macht er beim dispose automatisch aber ok so wie kriege ich denn da jetzt mal meine credentials rein dass ihr die netz sieht leute wir könnten dort net user credentials verwenden da weiß ich aber ehrlich gesagt gar nicht wie das funktioniert dort net secrets hatte schon mal jemand verwendet zum dieses dort net tool zum secret speichern also dass das eingebaute dort net user secrets set doch doch doch du kannst du kannst environment variablen machen das geht aber das will ich eigentlich gar nicht mal wisst ihr was ich habe kein bock jetzt irgendwelche super super komplizierten sachen zu machen wir machen das einfach so glas secrets static string mx schreibt es einfach hier rein und gut das lull so mal gucken ob ihr das jetzt seht wie gesagt kann man schöner machen aber für jetzt gmx passwort ok mal es wird nicht angezeigt was es ist wunderbar dann schreibe ich jetzt einfach kurz das passwort rein einfach vererben von was vererben von wo also verstehe ich das richtig dass die auswertungs protokolle per email schicken lassen nee wo habe ich denn sowas gesagt gar nicht ich will email schicken und gucken ob die emails ankommen ich schicke mir selbst emails ich meine der test von gmx zu gmx ist ziemlich blöd also ich bräuchte um genau zu sein eigentlich noch einen zweiten account von dem ich schicken kann an gmx aber letztendlich ist es für die logik darunter egal und ich kann es von einem account besser testen also das ziel ist mir selbst emails zu schicken und zu gucken ob alle ankommen wie gesagt normalerweise würde ich natürlich auch nicht von einem gmx account an den gleichen account schicken sondern von bei uns auf der arbeit über unseren spam anbieter an gmx an gmail an webde und dann gucken ob nach einer stunde zehn emails angekommen sind aber so zum test muss das reichen so leute ihr müsst jetzt noch mal kurz ihr dürft jetzt mal kurz nicht gucken weil ich jetzt das password hier reinschreiben muss das password ist übrigens wenn ich liel wenn ich es liegen sollte finde das bestimmt der chain law besonders lustig aber ich liege es ja nicht so ich hoffe ihr habt genau ich hoffe ihr habt euch alle die augen zugehalten und ich darf jetzt die secrets zartei heute nicht mehr öffnen lull ich meine selbst wenn ich es liege ist nicht ist nicht wild dann lösche ich halt einfach ich lösche heute die email adresse wieder am ende am ende des streams ok also smtp client connect mail.gmx.net smtp client jetzt wahrscheinlich send und wie sendet meine email adresse wie sendet meine email darüber das ist natürlich jetzt spannend wie macht man habe ich keine ahnung wie das funktioniert smtp examples send message message send message ja ja jetzt wird nirgendswo aufgerufen ok keine ahnung wie man das macht also send message too sharp das ist eine gute idee das ist eine wirklich gute idee ja da hast du recht das ist eine gute idee ja ja massive fivehead nur mein chat ist so fiveheadig auf so ideen zu kommen so also das heißt im endeffekt wir brauchen erstmal eine message die wir senden können also war message gleich knew my message und was muss man dann da reinschreiben chat hat extrem hohen eq aber das ist ja mittlerweile auch schon bekannt das wissen wir ja der chat ist richtig massive brain so empfänger to gleich new mailbox address nee das ging mit pass irgendwie das kenne ich schon mailbox address pass moment gmx wie heißt unser excellent die leute sind schon wieder ab spam hier so guckt euch an alter tja was willst du machen so ist halt so ist es halt ich werde jetzt einfach diesen account nie wieder öffnen sondern ein map abfragen so also to mailbox address pass was wollen wir sonst noch haben subject aber das ist gut dass ihr spamt weil da kann ich testen ob mein magic string funktioniert wobei wenn ihr den magic string seht dann funktioniert es ja nicht weil dann weiß ich dass die leute auch schon anfangen mit so komischen dingern deswegen jebaiter ich euch einfach und mein magic string mit random und ihr wisst ihn gar nicht easy war random gleich new nee wir machen es ein war gut ich bin mir nicht sicher ob das dann mit nullen initialisiert ist oder nicht ich kann mir das immer nicht merken dass jetzt ist es jetzt mit nullen initialisiert wenn ich so mache oder muss ich new machen das kann ich mir nie merken ist alles gut also subject subject ist kackel mail und dann immer immer ordentlich und dann all die so und die wisst ihr nicht deswegen könnt ihr auch nicht spam damit outplayed chat also send subject haben wir ja feifert subject haben wir tu was brauchen wir denn sonst noch from oder muss man oder war das sender email email krempel ich habe keine ahnung was der unterschied zwischen from und sender ist aber wir schreiben einfach mal das gleiche rein wahrscheinlich wahrscheinlich wahrscheinlich geht es so auch oder so und jetzt müssen dann muss da eben den text rein body gleich text text part test ok beste beste email überhaupt ok also ich muss from verwenden ok so jetzt haben wir unsere mail und die senden wir jetzt message alles klar ich muss mich noch authentifizieren smtp client authenticate string username kackel fakemail gmx.de und password secrets password ok dann schauen wir mal ob das senden jetzt funktioniert ran also wenn es ohne fehlermeldung durchläuft sollte das senden funktioniert haben und ich habe die ich habe die ad ausgegeben natürlich sehr sehr schlau gewesen leute so credentials invalid auch sitz hier invalid alter nerv nicht gmx was fehlgeschrei langer zugriff hallo lull kackel sie haben kürzlich versucht ihr gmx postfach in ein email programm wie zum beispiel autokolle die vorenstehende meld moment was es ist mtp und ein map ist deaktiviert sehe ich das richtig aha die für diese postvereinstellung ok was kbbcdk excellent ok sehr schön also sehr nice jetzt gucken wir mal ob es noch mal funkt ob es jetzt funktioniert jetzt hat es funktioniert und ist die email angekommen kackel fakemail net gmx nice attachment ist nicht bewusst dass ich dann attachment dran gehauen habe aber ok da lasse ich das mit dem lasse ich das mit dem test einfach weg das sollte auch so funktionieren moin drachenflieger ok email adresse kommt an alles klar warum muss jetzt so ich muss nicht rein rein freiwillige sache weil ich mir gedacht habe das eignet sich wunderbar für den stream ok also jetzt weiß ich schon mal wie man emails versendet und jetzt muss ich noch gucken wie man emails abruft ok wahrscheinlich ein map kleint wie kriegt man das hier dann raus ein map example ein map kleint ein map kleint gleich new ein map kleint vermute ich mal ja sehr schön ein map kleint connect ja ok das kann ich mir copy pasten ich kann mir beides copy pasten eigentlich ein map kleint so und das ist ein map punkt gmx allerdings in den anderen port 993 ok ist klar gmx so wie ruft man jetzt ein map was ab ein map kleint in box in box klingt schon mal gut daco xdv lang ist schon verhindert ab so in box klingt schon mal gut recent alter wie viel watte wie viel hatten das monkeys das hat 100 metoden alter ist ja mal gut hier was to immutable array kommt da am ende raus ach da kriegt man die einzelnen messages hier das ist ja auch nicht schlecht was bedeutet mail monitor ich will überprüfen und melde sich sende ankommen ok wie muss ich wie sagen ok also klein in box open search und dann eine schleife drüber also das vermute ich mal muss ich auf jeden fall machen weil sonst nicht funktionieren wird in box open folder access read only ja meinetwegen ok subject machen wir mal mein bahn hier weg gucken wir mal ob das ein map zeug funktioniert also ein map oder kann ich hier gleich select machen ach so das brauche ich gar nicht lull einfach so machen ja mails ok for each mail in mails was innumerables subject quatsch ich will die message komplett haben subject ja doch ist ok er gibt zwar von der benahmung her keinen sinn aber ich will mal überprüfen so jetzt sollte ich die ganzen dummen emails von euch auch bekommen wenn alles funktioniert tatsächlich hier guck mal die leute haben ich ihr habt mich zwar zu sonst was angemeldet aber es funktioniert kackel mail und uid ist hinten dran wieso machst du die leerzeichen vor die klammer wo habe ich leerzeichen vor der klammer das im github archiv was 38 und 34 ach da ja ne das soll nicht das soll tatsächlich nicht sein das da weiß ich nicht warum die das machen kann ich nicht sagen das ist nicht von mir das ist die die die hilfe seite für die library warum die das machen keine ahnung es scheint das scheint system zu haben bei denen vielleicht gefällt ihm das kann jeder machen wie er will also ich finde es jetzt auch nicht gerade toll so also das funktioniert schon einmal wir können emails abrufen ich bin begeistert elite partner sehr gut weiß ja bescheid chat wie ist das alle zehn minuten verliebt sich ein single wenn man das mal ausrechnet wie viele leute bei elite partner wahrscheinlich sind es alle zehn minuten ganz schön wenig da wartest du wahrscheinlich rein rechnerisch 800 jahre drauf bis ihr das was bringt also zumindest das funktioniert schon mal und jetzt kann man natürlich noch filtern subject wir machen das einfach anders wehr message subject starts with was haben wir hier kackel mail select ja wobei brauche ich eigentlich gar nicht alles gut mails mail subject tweet von golang schon gesehen ne haben die denn getweetet programming language ja und weiter wurde wurde der account gehackt oder was möchten sie uns sagen max spielst du schon da auf ihnen ne es ist ja kann auch alpha test und alles fliegt weg ich hatte kein bock die also ich habe mir den char erstellt zwei charts als die aufgemacht haben alpha test aber ich weiß wie sieht die pop wie sieht denn aktuell überhaupt noch die spielerzahlen aus bringt das was da was los guck mal was der kanzler getweetet hat ok ne ja was hat er getweetet ok chat er hat getweetet gar nix hat er getweetet der 25 august zuletzt was getweetet wieviel spielen denn abends immer so amorphium wieviel sind immer so aktiv also eigentlich also dass da gut ist müssen es eigentlich um die mindestens tausend sein was aber auch frisch als halt immer so ein ding ist so also wo sind wir stehen geblieben das funktioniert wunderbar was jetzt oh internal server error what the fuck intern haben haben die meine email gesperrt alter leute zu was meldet ihr mich da alles an monka es darum internal server error ach jetzt gehts wieder ich glaube ich habe einfach zu oft ich glaube ich habe das ganze zu oft ausgeführt so am ende bin ich wahrscheinlich mit dieser email adresse wirklich angemeldet den den afd infobrief haben wir schon die beate den beate use newsletter alles alles alles dabei hier frankfurter zeitung newsletter wer liest noch zeitung zu porno wurde wahrscheinlich mit der email adresse auch schon angemeldet aber macht euch nix draus ich werde die email adresse eh löschen am ende des streams also machen wir mal weiter so also ich weiß jetzt wie ich emails sende und ich weiß jetzt wie ich emails empfange dann checken wir doch mal ob ich eine email senden kann und dann warte ich mal 15 sekunden und dann müsste ich die email ja eigentlich finden so das probieren wir mal aus soweit soweit von der theorie wenn das funktioniert können wir mit der eigentlichen sache weitermachen wait task was das task delay keine ahnung 15 sekunden geben wir immer zeit dass die email ankommt und danach löschen wir alle mails leute ich werde es gleich alle mails löschen von euch immer automatisch nach dem ausführen 15 sekunden warten jetzt wenn ich richtig gezählt habe oder wahrscheinlich habe ich nicht richtig gezählt ja hat funktioniert guckt kackel mail mit der uid also email senden email checken funktioniert das heißt was wir jetzt machen werden ist folgendes zum schluss wir werden sagen alle mails also for each war mail in imap client inbox wie löscht man mails mail kit delete mail weiß nicht wie das funktioniert make it delete single mail message single mails jawohl erzählt mir wie es geht klein in box et flex message deleted ok also hoffentlich passt das hier imap in box et flex gibt es auch nur et flac et flex aber wie funktioniert das jetzt mail id uid wie kriege ich denn die id von der mail gar nicht oder oder ist message id ist die ne ne das was anderes wie krieg ich denn die id ach hier search query all ok das jetzt schon massiv umständlich aber ok ich copy paste mir einfach mal den graben von ihm hier imap client search warum macht er da immer so ein lehrzeichen ich verstehe es denn weil wir können das wir können das einfacher machen hier so ok imap ist halt mal wieder umständlich hoch 10 uid uid und jetzt message flex deleted silent ja meinetwegen alles silent wunderbar und jetzt was muss man machen zum mail löschen in box was expungi expunge hat jemand dieses wort schon mal gehört ich das also was heißt das überhaupt löschen was expunge wie spricht man das überhaupt aus achso ux ux pung delete is to three hat das kann ich jeder ja das geht nicht so einfach imap client in box ex alter was kram gut dafür muss ich das ding allerdings nicht read öffnen sondern read write öffnen gehe ich mal von aus also ein bisschen status meldung reinschreiben send mail waiting delete all mails so auf gehts mail senden gucken ob es da ist und dann alles löschen danach ist nicht das ungewöhnliche wort habe ich schon nie gehört das hört sich an wie eine attacke aus einem anime ja tatsächlich hat was aber da muss noch ein bisschen was dazu ein paar deutsche worter noch dabei die mögen aus irgendwelchen gründen deutsche namen allein sei möglichst lang ok die liet all mails gucken wir mal ob er alle mails deleted hat dass ich mir nicht mal angucken muss was er mir sonst noch hier alles schickt alles weg hat funktioniert und ihm gelöscht im spam verdacht ist ganz viel was ok ich weiß nicht zu was er mich da angemeldet hat aber es egal c++ meeting sehr schön aber jeder twitch dein twitch bestätigungscode ah das ist gut das ist gut dass man das in der email sieht das heißt es kann sich jetzt irgendjemanden twitch account erstellen mit der email adresse weil weil und so macht es mir egal die email adresse ist eh weg nach der nach dem stream ja so könnte das tatsächlich heißen ultrahass expansions wobei wobei die aussprache moment wir müssen was testen leute wie ist die wie ist die anime aussprache von diesem wort dass das testen wir jetzt mal ich habe hier mein text text to speech der dann so sachen aussprechen kann wie zum beispiel ok schauen wir mal ich habe vergessen was ich machen muss dass man text to speech nicht nicht krascht das seht sie so wie hoffentlich krascht es nicht nicht kraschen please also guck mal wie sprich wie würde das anime technisch ausgesprochen werden ziemlich ziemlich genauso stelle ich mir vor wird es da ausgesprochen das klingt also das klingt ziemlich ok ok ich übernehme mal was von euch genau so würde das klingt also das ist tatsächlich sehr original ja genau so stelle ich mir das tatsächlich vor würde sich das anhören du verstehst da ja nix sehr schön gut also so viel so viel flash bang also das tut das tut schon mal wir können schon mal emails abfragen emails löschen und emails checken ob die id drinne ist das ist schon mal nice nachdem die basics funktionieren können wir das ganze jetzt ja auch ein bisschen schöner machen also das funktioniert alles wieder alle mails gelöscht wenn du geh mal auf github trend was github trend soll discontinued werden was anscheinend nicht nichts discontinued hätte mich auch sehr gewundert warum sollte github trend discontinued werden was da gucke ich total oft rein alter warum streichen die immer irgendwelche sinnvollen features warum streichen die immer sinnvolle features ganz ehrlich ich persönlich benutze echt gerne das trending tab weil ich habe ich habe über das trend ich mache das mal in einem anonymen tab auch vielleicht gibt vielleicht muss ich eingeloggt sein vielleicht muss ich vielleicht muss ich eingeloggt sein aber ich habe schon total viel zeug gefunden über über das trending vor allem weil du hier auf language stellen kannst das findet ihr mal besonders spannend na du stellst auf language und kannst gucken was denn was denn für deine ja bevor zu was denn so aktuelles trend ich finde dass ich finde das wirklich eine super sache mit dem trending tab warum löscht man so was was ist denn das für ein schwachsinn schon wieder ich guck mal jetzt haben wir zum beispiel was gelernt dass es einen standard gibt ich weiß nicht mal was das sein soll hier oft hier fast health care interoperability resources er ja ok alles klar ja warum maui trendet kann ich nicht verstehen also mit den krebs verwendet dem ist echt nicht mehr zu helfen guck china chinesen zeug trendet benchmark dotnet super library ja kommunikations ok gehts da gehts da um trending tab i got the message ja also jeden tag ist vielleicht jeden tag ist vielleicht ein bisschen übertrieben aber ich gucke da mehrfach die woche rein was trendet oh nein jetzt sind die kpop spammer auch hier schon am start ja die haben recht also es also wenn man das trending tab abschafft wäre wirklich richtig dumm maui nicht die erhoffte erlösung für dotnet xamarin war nicht die erhoffte lösung und maui hat glaube ich nicht niemand als erlösung als ui framework erhofft ja ich habe dankeschön für den rate field ich habe auch schon einige sachen darüber gefunden die ich sehr spannend finde also es ist total hängen geblieben wenn die sagen würden wir discontinuen github trends das wäre einfach nur mega bescheuert also ich gucke immer hier explore trending und alles mögliche von daily bis sonst wie ich gucke die sprachen durch ich finde es interessant zu sehen was allgemein trendet weil ich habe keine ahnung was das ist habe ich ja nie gehört ja gerade sowas nach sowas suchst du doch normalerweise nicht das das findest du jetzt hier in sponsors guckst dir an und denkst dir ach so eigentlich ganz cool ich verstehe das nicht das ist ein bisschen wie mit dem dislike button also mittlerweile werden die funktionen teilweise also für mich essenzielle core funktionalität eingeschränkt aus aus ja weiß ich besseren monetarisierungsgründen was anderes ist es ja übrigens bei github wahrscheinlich auch nicht bessere monetarisierungsgründe unterm strich das hat die welt gebraucht wir brauchen nicht wpf 2 wir brauchen ein ordentliches avalonia wenn schon ich meine ich bin kein samuel fan muss ich sagen samuel samuel wie immer das ausspricht aber alles ist besser als samuel und maui so ich habe gesagt wir können das ganz jetzt noch ein bisschen ordentlich machen also lasst mal überlegen wie würde man das dann machen also die basis funktionalität wissen wir dass sie funktioniert email schicken emails emails empfangen also wir machen mal sowas hier public static class das irgendwie sowas wie keine mon mail sender da gibt es nur eine methode drin public static cool tricent so da brauchen wir string ne provokant zwing da brauchen wir mail box address zu der die email adresse sind ja immer gleich die ups die die messages sind ja immer gleich also tricent so da machen wir dann tricatch block drumherum und return falls wenn der kram kann man das diskern wenn der kram aus irgendwelchen gründen nicht klappt mit dem senden und wir return true und senden die mail wenn alles funktioniert solltest du den klein nicht noch disconnecten mache ich das nicht ja du hast recht also ich vermute aber mal dass ich das nicht machen muss weil wir gucken mal nach ob ich das machen muss oder ob das überflüssig ist weil der wahrscheinlich disposable implementiert hätte ich hätte ich gedacht ja das post dispose alter wo ist es denn jetzt bescheuert muss doch irgendwo sein wo ist es aber irgendwie kann man irgendwie suchen nach groß und kleinschreiber ist es doch versuchst du eigentlich nach so was wie solle zu programmieren ja die sachen davon die sinnvoll sind schon in dem kontext warum nicht ja zum beispiel dass eine sache als eine klasse nichts von der anderen wissen soll dass eine klasse nur eine sache machen soll das hat schon durchaus aus seinen sinn ich kann dir aber gerne ich kann dir aber aus dem kopf nicht sagen was die einzelnen punkte von soll es sind also single single responsibility open close oder sowas ich habe keine ahnung was die letzten drei was sie noch heißen ja ja ja da also da wo es sinnvoll ist schon dass das hat das hat ja seinen sinn muss man sagen also der macht kein disconnect guck mal der macht kein disconnect also ich muss tatsächlich von hand disconnecten ich hätte gedacht der disconnected sich das natürlich bescheuert disconnect unten drunter disconnect nach ex ex punch muss ich disconnecten die try send mail 2 dann können wir uns diesen camp von hier oben schnappen dass wir das ein bisschen aufräumen bevor das nächste mal also wir kriegen heute das garantiert nicht alles hin aber die basis sachen haben wir schon mal ausprobiert dass das nächste mal halbwegs ordentlich ist weil so blick ich da blick ich da nicht mehr durch ja mal aus kommentieren also im endeffekt machen wir dann so was wie mail sender send try send an mailbox address pass sowas hier das ist natürlich ein bisschen schöner als dieser ganze rotz auf einmal hast du eine ahnung wie lange du streben wirst ja eine stunde noch ungefähr juck das schreibt ich muss mich mal bedanken ich habe dich ja gefragt mit welcher sprache ich anfangen soll hab dann angefangen jetzt bin ich richtig trinne heckermans ja so muss das sein dazu kann ich sagen macht mir mittlerweile mehr spaß als hartware zu ich bin gerade schon ob ich mir mit mit einer c spa oder so und da go weiter machen soll dank auf jeden was habe ich dir denn geraten mit was zu anfangen sonst habe ich gesagt mach javascript also das ist ja so meine standardsache wenn man nicht weiß was man machen will mach javascript habe ich dir auch gesagt mach javascript ja genau das ist gut ja also wenn du eine c styles sprache lernst dann mach auf jeden fall sie scharp und fang auf gar keinen fall mit c++ an und c selbst ist halt ja gut wenn du hardware zeugs machen willst ist c sicherlich nicht verkehrt gerade für arduino in esp ist das halt immer noch das mittel der wahl aber wenn du ordentliche anwendung entwickeln willst auch für desktop und so was dann auf jeden fall dort netz die scharp damit wird gar nicht mehr c++ anfangen und go ja gut das kannst du das kannst du dir im endeffekt aussuchen ich persönlich würde mir als nächstes tatsächlich wenn du was anderes machen willst dort net angucken beziehungsweise ist die scharp weil ich finde von der sprache her vom umfang her und von den einsatzmöglichkeiten her mit der beste kombination die es gibt allerdings go ist auch nicht verkehrt go ist auch eine gute sprache zum einsteigen beziehungsweise zum weitermachen gibt es noch ein hetzer stream ich habe noch nicht gesprochen mit hetzer beziehungsweise ich weiß gar nicht ob mein managers was geschrieben hat oder ob es da schon was neues gibt keine ahnung wahrscheinlich hoffe ich mal weil wir müssen es ja noch mal ordentlich bauen von dem was wir das letzte mal gemacht haben ich wohne an der grenze zur schweiz denkst du dass ich lieber eine fachinformatik ausbilden deutschland drei jahre oder in der schweiz vier also ganz ehrlich wenn du nähe von der schweiz wohnst dann gehen die schweiz und kriegt mehr geld das ist ja dann das ja premium schweizer gehalt und und deutsche kosten ja ich werde im zuge vom informatik im abi java lernen unabhängig davon dass ich es mir auch sonst vorgenommen habe nachdem ich arduino in der elfen gehabt habe ja ich persönlich bin ja kein großer java fan aber ganz im ernst es ist auch absolut in ordnung kann man machen immer muss nicht alles mögen aber ich ich ich mag ja war nicht sonderlich so super super geheime string schreiben wir jetzt als rein hier super geheim das kennen nur ich danach kann ich greppen später da weiß ich dass ich die mail selbst geschickt habe ja das wundert mich auch dass man arduino in der schule lernt das kommt aber wahrscheinlich ganz entscheidend auf den lehrer an wenn du da irgendwelche planlose leute hast wie ich die quasi alles feiern nur weil die eindrückung stimmt nicht doch stimmt die alles feiern nur weil du in wird die schrift an lila machst so ein hat ich in weiß gar nicht wie man das genannt hat bei uns in der schule ich glaube it hieß das damals von leuten die keine ahnung haben wahnsinn also das war wirklich komplett komplett unsinnig ja du musstest du musstest bei diesem typ einfach nur dein powerpoint und wird text lila machen dann hat er gesagt leila leila leila leila mag ich oder hast du eine eins gekriegt der war ein bisschen über der spur der kerl und ich mein it bestand in der schule bei mir aus powerpoint und wird was was ist da los was ist da los chain law warum geht das nicht das ist das ist schlecht wenn es nicht geht weil ich gucke beispielsweise auch gerne zum pennen streams und wenn dann auf einmal werbung kommt das ist dann richtig oder oder man könnte eigentlich fast schon sagen es ist wo habe ich eigentlich mein monka es easy Leute ich kann mich nicht mehr konzentrieren ich weiß wir haben nicht viel gemacht aber sie schon spät ich kann mich nicht mehr konzentrieren ich muss das andere mal weitermachen wir haben nur wir haben eigentlich nur gecheckt wie man e-mails abruf das war was wir morgen irgendwann weiter gucken ich kann mich nicht konzentrieren weil es zu spät ich habe den ganzen tag schon zeug gebastelt für twitch gibt es einen blokker ne ich muss noch nicht ich muss auch nicht gleich oft aber wir können ein bisschen können ein bisschen schwätzen noch ne ne es gibt es gibt uplog origin uplog origin macht für die meisten seiten mein twitch ist so on of twitch geht mal mal geht es nicht ok wie löst man den account wieder hat irgendjemand eine ahnung wie man sein gmx konto löscht e-mails schreiben gmx delete my account deleting an account my account ok wo home home mein account account löschen account löschen ihr password ok leute ich copy ich copy paste jetzt das password und löscht dann jetzt löschen ok kann ich euch auch zeigen wie das password war moment ich zeige euch das nicht da kann ich das nächste mal wieder verwenden ich habe tabs offen ja ich weiß ich habe gerne ich habe gerne viele tabs offen excellent leute wir machen ein andermal weiter ne das password das password enthielt das password und dann kam noch was blödes hinten dran weil er hat zufälligerweise grad was im chat geschrieben wo ich das password eingegeben habe und das password ist gewesen ist ein aber jetzt sage ich nicht was ich weiter geschrieben habe aber nix schlimmes nix ja sowas in der richtung steht da ja sowas in der richtung ich kann so ich ok ich copy pastes euch hier das das das war das password chain law ist ein three head spammer das ist mir grad so eingefallen als ich die e-mail adresse angelegt habe weil er was im chat geschrieben hat das ist ein gutes password leute das ist ein wirklich gutes password das ist lang 123456 wobei warum zähle ich das eigentlich selbst lul lul Sachen selber zählen ich glaube es geht los keine sonderzeichen keine zahlen das ist bei der länge doch auch vollkommen egal ja echo bam wc 28 zeichen leute da kannst du nur klein buchstaben oder kannst du sogar nur zahlen machen das reicht 28 28 stellen 28 stellen kannst du im prinzip dein password nur so zusammensetzen kriegt schon keiner raus kannst du vergessen 28 stellen ist heilig die secure was hier die weeps sind am start ich seh schon chat gibts noch irgendwas spannendes murkser ah ist sicher konfirm du ich ganz im ernst ich glaube bei den meisten seiten würde es relativ lange dauern bis einer damit in den account reinkommt ja du kannst bei den meisten sachen nicht allzu viele requests pro sekunde machen bevor die dich blocken und selbst wenn du eine datenbank verwendest mit bekannten password dann wird das wahrscheinlich drin stehen wird brauchst du trotzdem eine weile also ja wahrscheinlich bist du damit sicherer als die meisten leute die wir wissen noch wir wissen noch als 123456 das verbreiteste password ist und wahrscheinlich gefolgt von querz also bei passwörtern ist best practice einfach das zu nehmen was alle nehmen meistens nicht so gut ja genau das werden die wenigst noch machen 123 wird kaum noch akzeptiert das ist richtig die meisten wollen dass man macht 123456 und noch score a oder sowas weil du brauchst sonderzeichnung groß und kleinschreibung manchmal muss doch so machen aber ganz ehrlich seitdem ich den password manager verwende also jahrelang ja schon immer der gleiche habe ich das problem nicht mehr da lasse ich mir dort ein password generieren es kommt höchstens manchmal vor dass mein password manager ein password generiert und die seite dann sagt oh nee das password ist zu lang oder irgendwie was oder das password enthält kein sonderzeichen wobei das ja absicht ist dafür sind die langen aber das ist auch nicht schlecht das sieht aus wie ein beispiel beispiel installation wo man aus dem tutorial das password raus kopiert hat ich benutze key pass seit ewigkeiten das da ja last pass wurde gehackerment allerdings haben sie gesagt es hatte keinen einfluss auf die passwörter das finde ich gut das kommt rein keck keck alu add to channel bem ist drinnen leute ich habe es hinzugefügt ich aktualisieren mal kurz keck alu wie geht nicht ach nee man schreibt es alles groß man schreibt also keck alu ne hat noch nicht aktualisiert leute aber ich habe es hin ich habe es hinzugefügt keck alu geht noch nicht jetzt bei euch bei mir jetzt nicht ich habe es hinzugefügt bald bald gibt es keck alu eine minuten cdn update aber ich finde keck alu so nice das nehme ich das nehme ich mit auf nicht hat was ich bin der einzige der das hinzugefügt hat dieses bild ist es von dir ich finde das mega keck alu anscheinend funktioniert es doch nicht ja mobile hast du keine ffz emotes das ist normal wir haben wirklich bei wir haben alle alle keck emotes durch ja ich mein guckt mal keck also wir haben also eine wir haben eine wirklich sehr breite auswahl an keck emotes und und lull lull emotes haben wir gar nicht so viel aber monka haben wir monka haben wir auch einige monka steer ist sehr underused aber gut wozu auch ja meistens passt ja nicht zum kontext keck weep im anime style ne wir haben genug weep emotes um nicht zu vergessen für alle für die weeps out fraktion guck mal allein schon vier davon kann man sich nicht alle emotes anzeigen lassen warum nicht ist nicht aktiviert oder was oder muss man dafür eingeloggt sein weil die autover vollständigung geht ja das ist gibt ich werde übrigens nicht ich werde mir rings of power nicht geben habe ich mir vorgenommen weil näher ich wollte ich habe mir erst überlegt man könnte der ganzen sache ja mal eine chance geben aber mir hat das alles das ganze hin und her darum wirklich nicht grad bock auf die sendung gemacht keine ahnung ich juckt mich juckt mich nicht ich ich glaube auch nicht dass amazon das sinnvoll hinbekommt also ich bin bei sowas eh schon immer sehr sehr kritisch ja und habe was rum zu meckern ich glaube es werde ich mir nicht gucken ich sage einfach nur ich bin ich angucken werde weil ich nicht glaube dass das die zeit wert ist was eigentlich auf dieser blackout serie gewonnen keine ahnung ich weiß es nicht nein tatsächlich war ich noch nicht weil ich korona hatte ich könnte mich da aber eigentlich mal wieder melden weil das ist jetzt ja schon eine weile vorbei war kurz in die e-mails gucken was haben wir denn da neu ist drinne youtube sponsorship ok hört mal genau zu leute jetzt jetzt kommen die massive youtube sponsorship sachen youtube sponsorship mit world class vpn client this is paras vom creator db so und ich soll ich soll werbung machen für wie die sagen mir noch nicht mal für welchen vpn anbieter ich werbung machen soll die sagen ich soll werbung machen für one of the best vpn companies in the industry 60 60 bis 90 sekündige video integration ja aber der sagt nicht mal für welchen ok was haben wir sonst noch schönes attention youtubers sponsorship opportunity da ist so viel crap dabei immer please contact us please contact us hong kong whatsapp alles klar hong kong whatsapp da habe ich ja direkt bock drauf mit ihnen was zu machen die haben echt probleme oder sowas in der richtung kooperationsanfrage das ist gut übersetzt leute das ist gut übersetzt hallo wir haben mit vielen twitch ankern zusammengearbeitet gradios übersetzt das ist ja geil also das muss ich euch vorlesen also das ok moment moment chat mal refreshen gucken wir mal ob keck alu funktioniert kann jetzt noch mal ausprobieren geht keck alu jetzt keck alu nein geht immer nicht also hört euch hört euch das mal an also jentung zung zung stehts in der stehts in der email und da steht hallo ich bin jenny von dumm dumm dumm advertising wir haben mit vielen twitch ankern zusammengearbeitet derzeit haben wir ein deutsches latex kissen das beworben werden muss sie können dieses produkt den fans zeigen und sie während der live übertragung anleiten besorgen wenn sie an diesem kooperationsmodell und produkt interessiert sind können sie unter meine kontaktdaten hinzufügen produkt link deutschlands kopfkissen nummer eins in vollkommenheit das ist ja war so schlecht ein latex kissen was ich bin mir da auch nicht so sicher nein nein das da das da die meint die mein tatsächlich nicht nicht ich frage wenn müsste sie eigentlich man müsste eigentlich ganz doof zurückfragen was sie davon meint und dann warten wie verwirrend die antwort ist weil ich mein wenn die wenn die ursprüngliche anfrage schon wir ist dann ist die antwort noch wirer wurde der art eigentlich auch von krabb geprägt nö warum sollte warum sollte es also ich habe gar keinen prog krabb ich habe buch buch d oder irgendwie sowas ich habe kein grub gibt kein grub bei mir warum warum was was was war da krabb probt mein art stillungsinstallation ok warum ok was ist passiert nee mach ich nicht ach nee fuck ist das gefixt mittlerweile ok gucken wir mal hat er hat er das verlinkt hier unten irgendwie archback report krabb closed haben sie gefixt ach guck mal manjaro ist mal wieder betroffen alles klar Ok, Banjaro Crabb, Zeus, ja ist das, ist das denn jetzt prinzipiell gefixt? Da muss ich mal kurz danach gucken. Ok anscheinend interessiert das kein Banjaro, wo werden Banjaro Bugs reportet? Haben die sowas überhaupt? Ne? Ja, ich habe kein Bock mein Notebook irgendwie kaputt zu machen auf der Arbeit mit einem Update. Okay also das soll man machen danach noch mal okay. Interessant. Einfach nicht Upgraden, Pfeifert. Was? Okay ich weiß nicht mal wovon er spricht, aber okay. Ja das wissen wir jetzt. Also ich hoffe die fixen das so, dass man keine Zusatzbefehle mehr ausfüllen muss, weil wenn ich mal mein Notebook update denke ich doch nicht dran den Kram da irgendwie noch zu updaten oder das noch zu machen. Ja, kein Schimmer. Was das Problem war das habe ich nicht so genau gecheckt wenn ich ehrlich bin. Irgendwas das Manjaro irgendeinen Crab install macht nach dem Crab update und das macht irgendwie kaputt. Man kann auch einfach den kernel per evi shell starten, das kriege ich aber aus dem Kopf nicht hin wenn mein Notebook morgens kaputt ist. Müsste ich dann erst mal im Handy gucken wie man das macht. Und ich bin mir gar nicht sicher ob ich überhaupt einen Crab auf der Arbeit drauf habe. Aber ich glaube schon das ist ja die default bootloader. Also würde ich jetzt einfach mal von ausgehen. Ne, will ich nicht. So ist das gut. Das haben wir doch schon mal schon geguckt vor ewig kann. Ja Leute, wenn sonst nichts mehr gibt soll ich mal refreshen. Geht das jetzt mittlerweile? Wenn sonst nichts mehr ist wie gesagt ich kann mich nicht weiter konzentrieren. Ach hier guck mal image funktioniert. Pog hat eine weile gedauert bis es refreshed ist. Alles klar dann sehen wir uns morgen chat. Morgen geht's weiter. Bis denn macht's gut. CU.", "segments": [{"id": 1, "start": 60.0, "end": 86.16, "text": "K. E. K. W. Moin Leute, da bin ich. Genauso pepo fett wie das letzte Mal. Ne das stimmt"}, {"id": 2, "start": 86.16, "end": 92.28, "text": "nicht, ich hab weiter abgenommen. Leute es geht immer weiter abwärts. Was natürlich"}, {"id": 3, "start": 92.28, "end": 100.92, "text": "sehr pogge ist, weil ich war vorher einfach zu dick. Aber jetzt, jetzt ist alles gut."}, {"id": 4, "start": 100.92, "end": 110.16, "text": "Ich kann nicht reden und tippen gleichzeitig, da erzähl ich einfach nur Blödsinn. Nicht"}, {"id": 5, "start": 110.16, "end": 117.68, "text": "zusammenhängenden Kram. Denkt euch nichts dabei. Steinadler 5. 7 Monate Massive Subscription."}, {"id": 6, "start": 117.68, "end": 124.92, "text": "Dankeschön. Ich hab heute mal was lustiges von der Arbeit mitgebracht. Wir werden heute"}, {"id": 7, "start": 124.92, "end": 129.64, "text": "natürlich anonymisiert. Ihr wisst ja, wir werden heute was bauen, was ich auf der Arbeit"}, {"id": 8, "start": 129.64, "end": 136.96, "text": "brauche. Wir haben ja schon das ein oder andere Mal Sachen programmiert, die da ganz interessant"}, {"id": 9, "start": 136.96, "end": 143.08, "text": "waren und die ich dann im Endeffekt für die Arbeit verwenden kann. Rechnest du das ab?"}, {"id": 10, "start": 143.08, "end": 150.84, "text": "Ehrlich gesagt, keine Ahnung, ob ich das abrechnen kann. Ich kanns mal probieren. Wahrscheinlich"}, {"id": 11, "start": 150.84, "end": 154.44, "text": "könnte ichs auch abrechnen, aber ganz ehrlich, ich hab keinen Bock dazu zu sagen, guck mal"}, {"id": 12, "start": 154.44, "end": 162.36, "text": "hier, hier hab ich live gestreamt. Ne. Letztendlich unterm Strich kommt aber was sinnvolles für"}, {"id": 13, "start": 162.36, "end": 173.0, "text": "die Arbeit bei raus. Ich erzähl euch auch gleich was. Ist tatsächlich zum Teil etwas,"}, {"id": 14, "start": 173.0, "end": 185.16, "text": "aber nur zum Teil. Es ist eine Mischung, es ist eine Mischung aus und so ungefähr. Weil"}, {"id": 15, "start": 185.16, "end": 192.76, "text": "warum wir das machen, ist ziemlich monkaW bzw. eigentlich ist es lustig. Muss mal kurz"}, {"id": 16, "start": 192.76, "end": 202.84, "text": "was gucken. Ich glaub Teams hat am Sounds wieder rumgestellt. Yep. Yep. Yep, Han hat"}, {"id": 17, "start": 202.84, "end": 208.16, "text": "am Sounds rumgestellt. Während der Stream anläuft, ich mach mal die VM an und ich mach"}, {"id": 18, "start": 208.16, "end": 213.04, "text": "mal Update und dann erzähl ich euch, ist die Wallbox schon montiert? Leute, ich sag's"}, {"id": 19, "start": 213.04, "end": 219.08, "text": "euch. Ich wollt beim Elektriker einen Termin vereinbaren. Also ich hab mir vor, ich muss,"}, {"id": 20, "start": 219.08, "end": 223.76, "text": "ok. Leute, ich mach mal ein paar Tabs zu, es ist einfach zu viel auf. Dann sag ich,"}, {"id": 21, "start": 223.76, "end": 229.08, "text": "dann sag ich gleich was zu. Meine Güte, ist viel zu viel. Guckt euch das mal an. MonkaS."}, {"id": 22, "start": 229.08, "end": 237.6, "text": "Leiter gar nicht mehr auf. Wie sieht eigentlich, ok New World, New World, aha aha aha. Äh."}, {"id": 23, "start": 237.6, "end": 244.84, "text": "Was macht Battlefield? Na gut, die gehen jetzt wieder hoch, weil die haben hier Season 2"}, {"id": 24, "start": 244.84, "end": 248.64, "text": "gelauncht. Season 2 hab ich tatsächlich noch nicht ausprobiert. Weiß jemand, wann Season"}, {"id": 25, "start": 248.64, "end": 253.56, "text": "2 gelauncht ist? Hat das jemand von euch im Kopf? Gestern oder so? Wer ist denn vorgestern?"}, {"id": 26, "start": 253.56, "end": 265.0, "text": "Wieso nicht lang her? Ja, aber um mal was zum Thema Wallbox zu sagen. Save. Was haben"}, {"id": 27, "start": 265.0, "end": 268.92, "text": "wir denn hier? Ah, hier haben wir noch den Hetzer Kram auf. Das brauchen wir ja gar nicht"}, {"id": 28, "start": 268.92, "end": 275.24, "text": "mehr. Oh, Moment Leute, ich mach mal nebenbei Update, dann erzähl ich euch was. Nichts"}, {"id": 29, "start": 275.24, "end": 281.84, "text": "zum Updaten, das ist auch gut. Aber ich starte mal neu. Dann erzähl ich euch was. Also. Mach"}, {"id": 30, "start": 281.84, "end": 290.88, "text": "mal Update. Cody? Was? Warum hab ich hier? Ok. Was auch immer. Installieren wir jetzt"}, {"id": 31, "start": 290.88, "end": 296.96, "text": "einfach? Yes. Also, ja, zu diesem Thema. Ist die Wallbox schon montiert? Dazu kann ich"}, {"id": 32, "start": 296.96, "end": 300.48, "text": "was erzählen. Also, für alle die sich mitgekriegt haben, jetzt nochmal ganz kurz in Kürze, ich"}, {"id": 33, "start": 300.48, "end": 307.68, "text": "hab mir ein Elektroauto gekauft, nehm ich den hier. Und ich hab versucht, mir bei einem"}, {"id": 34, "start": 307.68, "end": 319.52, "text": "Elektriker einen Termin zu machen. Der Konfigurator ist irgendwie kaputt. Von Fiat. Also das Ding"}, {"id": 35, "start": 319.52, "end": 332.2, "text": "hat einen 42 Kilowattstunden-Agu. Und. Dementsprechend ist es natürlich ziemlich mühselig, das aus"}, {"id": 36, "start": 332.2, "end": 338.4, "text": "dem. Ziemlich mühselig, das aus dem normalen Stecker zu laden. Ich habe mir bei Amazon"}, {"id": 37, "start": 338.4, "end": 342.56, "text": "einen Stecker bestellt mit 10 Meter Kabel, dass ich das machen kann, bis ich ein Ladegerät"}, {"id": 38, "start": 342.56, "end": 349.44, "text": "ins Zähne hab. Zumindest. Also. Ich hab mir dieses Ding gekauft als Elektroauto. Und jetzt"}, {"id": 39, "start": 349.44, "end": 353.44, "text": "geht es darum, wie kann ich das möglichst schnell laden. Also hab ich mich mal umgeguckt,"}, {"id": 40, "start": 353.44, "end": 360.88, "text": "was Ladeboxen angeht. Und ich hab mich entschieden für dieses Ding hier. Aus mehreren Gründen."}, {"id": 41, "start": 360.88, "end": 366.6, "text": "Also das hab ich auch schon bestellt bei Amazon, das liegt bei mir daheim. Die Seite ist wahnsinnig"}, {"id": 42, "start": 366.6, "end": 372.84, "text": "geschwind, gerade aktuell. Das liegt bestimmt am Dark Reader. Dark Reader macht hier bestimmt"}, {"id": 43, "start": 372.84, "end": 378.6, "text": "Probleme. Mach mal kurz. Wer von euch macht hier schon wieder Hacker, man? Gibt es 2Chat,"}, {"id": 44, "start": 378.6, "end": 391.2, "text": "ihr seid das. Dass es so langsam ist hier. Twitch Chat Ddos. Nee, ist absolut null ausgelastet,"}, {"id": 45, "start": 391.2, "end": 401.28, "text": "der Rechner. Guck mal, dieser Idle Prozess ist ganz schön aktiv. Niedu, Dankeschön für"}, {"id": 46, "start": 401.28, "end": 411.32, "text": "den Sub. Ackermans. Genau, ich hab mich für dieses Ding hier entschieden. Und das liegt"}, {"id": 47, "start": 411.32, "end": 417.92, "text": "daran, weil. Guck mal, ob die das hier in dieser Broschüre schreiben. Also. Es ist so,"}, {"id": 48, "start": 417.92, "end": 424.08, "text": "wenn man ein 22 Kilowatt Ladegerät bei sich daheim installieren will, dann muss der Netzbetreiber"}, {"id": 49, "start": 424.08, "end": 427.56, "text": "zustimmen und der Netzbetreiber will dann auch irgendeine Notabschaltung und sowas"}, {"id": 50, "start": 427.56, "end": 431.84, "text": "da installiert haben. Da hab ich keinen Bock drauf gehabt, deswegen hab ich die 11 Kilowatt"}, {"id": 51, "start": 431.84, "end": 438.92, "text": "Variante. So. Und warum hab ich mich dafür entschieden? Weil dieses Ding wirklich selten"}, {"id": 52, "start": 438.92, "end": 445.48, "text": "ist es ja heutzutage. Offene Apis hat. Das Ding hat die Möglichkeit sich ins heimliche"}, {"id": 53, "start": 445.48, "end": 450.56, "text": "WLAN zu hängen, per HTTP angesprochen zu werden und per MQTT angesprochen zu werden"}, {"id": 54, "start": 450.56, "end": 460.76, "text": "und es gibt auch schon fertige. Es gibt auch schon fertige Integrations. Es gibt auch schon"}, {"id": 55, "start": 460.76, "end": 465.44, "text": "komplett fix und fertige Integrations für Homosystem für das Ding. Mal gucken, ob die"}, {"id": 56, "start": 465.44, "end": 472.76, "text": "was taucht, wenn ich. Oh ja, sehr große Schrift. Wenn nicht, mach ich. Hat Github irgendwas"}, {"id": 57, "start": 472.76, "end": 481.96, "text": "geändert? Github sieht heute irgendwie ein bisschen anders aus. Ja, und wie gesagt, es"}, {"id": 58, "start": 481.96, "end": 490.2, "text": "gibt fertige Integrations und dann kann man in seiner Heimautomatisierung das ganze Ladegerät"}, {"id": 59, "start": 490.2, "end": 496.96, "text": "sinnvoll fernsteuern. Man hat dann zum Beispiel so Sachen wie automatischer Stop, mit wie"}, {"id": 60, "start": 496.96, "end": 501.08, "text": "viel Ampere das Ding laden soll, man kann das ganze Limit, man kann sagen laden an,"}, {"id": 61, "start": 501.08, "end": 506.6, "text": "aus und sonst was und in Kombination mit dann sein Auto quasi noch abfragen, wie voll"}, {"id": 62, "start": 506.6, "end": 510.52, "text": "es ist, dann kann man richtig, richtig coole Sachen machen bzw. kann dann beispielsweise"}, {"id": 63, "start": 510.52, "end": 513.92, "text": "auch sagen, ich lade plus bis 90 oder ich lade jetzt mal volle Pulle voll oder ich"}, {"id": 64, "start": 513.92, "end": 518.0, "text": "lade vielleicht erst heute Nacht oder was weiß ich, ich lade jetzt gar nicht, ich fange"}, {"id": 65, "start": 518.0, "end": 522.72, "text": "dann erst mal mit, was auch immer. Egal, man hat die Werte. Das ist einer der Hauptgründe,"}, {"id": 66, "start": 522.72, "end": 527.8, "text": "warum ich gesagt habe, ich nehme die, weil die offene Apis hat. Du kannst HTTP und MQTT"}, {"id": 67, "start": 527.8, "end": 531.4, "text": "machen. So, jetzt natürlich die Sache, ich habe das schon bei mir daheim liegen und jetzt"}, {"id": 68, "start": 531.4, "end": 535.8, "text": "wollte ich beim Elektriker einen Termin machen und dann erzähle ich euch, was wir heute mit"}, {"id": 69, "start": 535.8, "end": 540.4, "text": "Prometheus machen, was auf der Arbeit war. Also ich wollte einen Termin beim Elektriker"}, {"id": 70, "start": 540.4, "end": 545.68, "text": "machen und ich habe ungelungen oder bei sechs, sieben verschiedenen Elektriker angerufen"}, {"id": 71, "start": 545.68, "end": 553.44, "text": "und habe die gefragt, ich habe ein Ladegerät bei mir daheim und ich will das angeschlossen"}, {"id": 72, "start": 553.44, "end": 557.76, "text": "haben. Ich habe mit dem Netzbetreiber schon alles geklärt und wisst ihr, was die allesamt"}, {"id": 73, "start": 557.76, "end": 568.04, "text": "gemacht haben? Die haben allesamt das hier gemacht, als ich die angerufen habe. Alle,"}, {"id": 74, "start": 568.04, "end": 573.44, "text": "die haben alle gesagt, es dauert Wochen bis Monate. Die haben wirklich, die haben sich"}, {"id": 75, "start": 573.44, "end": 577.44, "text": "wirklich, die haben nicht das gemacht, die haben nicht das gemacht, die haben allen Ernstes"}, {"id": 76, "start": 577.44, "end": 586.04, "text": "schon das gemacht. So, also die haben sich, die haben sich weggekackt und haben gesagt,"}, {"id": 77, "start": 586.04, "end": 591.04, "text": "es dauert ein paar Monate bis ich dran komme. Also habe ich mal weiter, also ich habe, wie"}, {"id": 78, "start": 591.04, "end": 596.12, "text": "gesagt, ich habe sechs, sieben Elektriker angerufen und der eine war geil, der eine war geil,"}, {"id": 79, "start": 596.12, "end": 603.4, "text": "ähm, da habe ich angerufen und da war irgendwie, war irgendwie, klang irgendwie russisch oder"}, {"id": 80, "start": 603.4, "end": 608.88, "text": "so, habe ich gedacht, hä, wo bin ich denn hier gelandet? Wo, wo, wo bin ich, wo bin"}, {"id": 81, "start": 608.88, "end": 614.48, "text": "ich denn hier gelandet? Wie, wie, wie komme ich auf einmal bei den Gekommodats raus? Und"}, {"id": 82, "start": 614.48, "end": 619.76, "text": "habe ich gedacht, ja, bin ich hier richtig bei, äh, ja, Elektriker Name, blablabla und"}, {"id": 83, "start": 619.76, "end": 625.36, "text": "dann meint der, ja, sie richtig, aber ich probleme mit Deutsch. Da habe ich gemeint,"}, {"id": 84, "start": 625.36, "end": 628.68, "text": "ach, das ist kein Problem, ich kann später auch anrufen, wenn irgendwie jemand da ist,"}, {"id": 85, "start": 628.68, "end": 632.68, "text": "wo das, wo das besser funktioniert, müsste ich jetzt nicht anstrengen. Ähm, aber nein,"}, {"id": 86, "start": 632.68, "end": 639.36, "text": "nein, nicht später anrufen, kann das auch machen. Äh, okay, ähm, dann, dann erzähle"}, {"id": 87, "start": 639.36, "end": 642.52, "text": "ich ihnen jetzt mal, was ich will, habe ich gesagt, ich habe eine Ladestation gekauft,"}, {"id": 88, "start": 642.52, "end": 646.68, "text": "will das bei mir, will das bei mir im Hof angeschlossen haben und dann das erste, bevor"}, {"id": 89, "start": 646.68, "end": 652.28, "text": "der irgendwie gefragt hat, was ist das für eine Ladestation oder wo sind sie oder, oder"}, {"id": 90, "start": 652.28, "end": 657.56, "text": "irgendwas, hat er zu mir gesagt, das, das, ne, was hat er gesagt, das wird kosten, hat"}, {"id": 91, "start": 657.56, "end": 665.68, "text": "er gesagt, das wird kosten und da habe ich mir schon gedacht, hm, das klingt, klingt"}, {"id": 92, "start": 665.68, "end": 670.72, "text": "jetzt erstmal nicht so vertrauenserweckend und dann meinte er weiter, das wird kosten,"}, {"id": 93, "start": 670.72, "end": 679.32, "text": "900 Euro und da habe ich mir gedacht, hm, das ist vielleicht ein bisschen teuer, wenn"}, {"id": 94, "start": 679.32, "end": 684.32, "text": "ich mir überlege, dass es einfach nur angeschlossen werden muss und die Station selber billiger"}, {"id": 95, "start": 684.32, "end": 693.84, "text": "war, also nein, ich, ich schaue, ich schaue mich nochmal um, das wird kosten, naja, zudem"}, {"id": 96, "start": 693.84, "end": 698.92, "text": "bin ich nicht und dann habe ich tatsächlich noch einen gefunden, der gesagt hat, nächste"}, {"id": 97, "start": 698.92, "end": 705.92, "text": "Woche Mittwoch kann er sich das mal angucken, hast du schon eine Leitung zur Garage, ne,"}, {"id": 98, "start": 705.92, "end": 709.32, "text": "die kommt bei mir nicht in die Garage, die kommt bei mir im Hof, dort wo nicht so viel"}, {"id": 99, "start": 709.32, "end": 714.68, "text": "Sonneneinstrahlung ist und ein bisschen unterm Dach, im Hof, man kann direkt vom Keller,"}, {"id": 100, "start": 714.68, "end": 718.88, "text": "man muss ein bisschen Verlängerungskabel machen, so, so, so eine Zwischenbox wahrscheinlich"}, {"id": 101, "start": 718.88, "end": 722.88, "text": "an die Wand machen, aber das ist ja für einen Elektriker nichts, nichts wildes und dann"}, {"id": 102, "start": 722.88, "end": 727.72, "text": "kann man vom Keller direkt durch, durch ein Fenster bzw. durch, durch ein Holzding im"}, {"id": 103, "start": 727.72, "end": 733.44, "text": "Fenster in, in Hof und direkt an die Wand machen, ja, ich denke mal, wenn der so eine"}, {"id": 104, "start": 733.44, "end": 737.44, "text": "Zwischenbox setzt und so, sagen wir mal, der ist eine Stunde beschäftigt, wenn das am"}, {"id": 105, "start": 737.44, "end": 744.2, "text": "Ende 200 Euro kostet, meinetwegen, aber 900 Euro, also, das wird kosten, 900, 900 Euro,"}, {"id": 106, "start": 744.2, "end": 754.92, "text": "also, ne, ne, wirklich nicht, zumindest, entweder monatelang warten oder 900 Euro, ich hab da"}, {"id": 107, "start": 754.92, "end": 758.8, "text": "noch einen gefunden, ich hab da noch einen gefunden, der gesagt hat, er kann sich das"}, {"id": 108, "start": 758.8, "end": 763.84, "text": "nächste Woche Mittwoch oder irgendwie dann die Tage mal angucken, wenigstens, aber ich"}, {"id": 109, "start": 763.84, "end": 767.96, "text": "sag, nice, sehr gut, jetzt machen wir, auf gehts, Musik ist mir zu anstrengend, ich brauch"}, {"id": 110, "start": 767.96, "end": 774.96, "text": "was entspannenderes, Leute, was, was hab ich da, oft hat der Chat irgendwann mal gepostet,"}, {"id": 111, "start": 774.96, "end": 781.28, "text": "nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein,"}, {"id": 112, "start": 781.28, "end": 785.84, "text": "wo ist, wo ist meine Relaxing, nein, auch nicht Kirby Go Mirrors, wo ist meine Relaxing Mario"}, {"id": 113, "start": 785.84, "end": 801.92, "text": "Musik, wo ist es, Relaxing Mario, hier, das, die will ich haben, ah, yes, exellent, Entspannungsmusik"}, {"id": 114, "start": 801.92, "end": 817.24, "text": "vom Anfang zu basteln, ah, ok, also, dann erzähl ich euch mal was, und zwar, also, was"}, {"id": 115, "start": 817.24, "end": 822.64, "text": "wir heute machen ist folgendes, mal gucken, ob ich 5 hätte, das ist falsch, das wollte"}, {"id": 116, "start": 822.64, "end": 832.84, "text": "ich gar nicht, wo bin ich, ah, wo bin ich, ich hab zu viele Tabs, Leute, Monka, hier,"}, {"id": 117, "start": 832.84, "end": 856.36, "text": "das ist die Lautstärke, ah, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du,"}, {"id": 118, "start": 856.36, "end": 880.28, "text": "du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du, du,"}, {"id": 119, "start": 880.28, "end": 886.36, "text": "Fertig sind mein toolbox updates checken kurz und dann mache ich alles ab den guck mal da"}, {"id": 120, "start": 887.12, "end": 890.08, "text": "Check vor updates also ich erzähle euch jetzt mal kurz was wir heute machen"}, {"id": 121, "start": 890.96, "end": 895.44, "text": "Während der hier alles updatet also es gab was zu kecken bei mir auf der arbeit"}, {"id": 122, "start": 895.96, "end": 901.8, "text": "Also richtig und zwar also ihr seht es ja schon im titel titel heute des streams ist ja mail"}, {"id": 123, "start": 902.04, "end": 904.04, "text": "Monitoring mit prometo ist für die arbeit"}, {"id": 124, "start": 904.04, "end": 911.4, "text": "Programme also was wir machen ist wir richten nicht wirklich ein komplettes mail monitoring ein wir programmieren einen check für mail"}, {"id": 125, "start": 911.56, "end": 915.32, "text": "Monitoring und zwar wir programmieren einen check ob wir"}, {"id": 126, "start": 916.96, "end": 919.36, "text": "Gepleckliste sind bei gmx und bei web.de"}, {"id": 127, "start": 922.56, "end": 924.56, "text": "Und wer sich jetzt fragt warum"}, {"id": 128, "start": 924.56, "end": 932.32, "text": "Ich werde jetzt mal ich werde das jetzt mal versuchen kurz zu erklären und zwar"}, {"id": 129, "start": 934.08, "end": 939.64, "text": "Das sieht bei uns ich muss das versuchen ein bisschen abstrakt zu erklären also das sieht bei uns auf der arbeit folgendermaßen aus also"}, {"id": 130, "start": 940.08, "end": 942.4, "text": "Wir haben jede menge außendienstmitarbeiter"}, {"id": 131, "start": 946.92, "end": 951.16, "text": "Fast aber die details natürlich nicht also wir haben jede menge außendienstmitarbeiter"}, {"id": 132, "start": 951.16, "end": 957.16, "text": "und die haben zum größten teil die haben natürlich email accounts bei bei der bank wo ich arbeite und"}, {"id": 133, "start": 957.52, "end": 961.52, "text": "Die haben halt private private email accounts also die schicken auch mal"}, {"id": 134, "start": 962.08, "end": 968.16, "text": "Kollegen was an ihre private adresse oder sich selbst an die private adresse oder schicken sie irgendwelche verträge an die private adresse ob es"}, {"id": 135, "start": 968.16, "end": 971.2, "text": "Es dürfen oder nicht sei mal da ist einmal dahingestellt sie machen es aber so"}, {"id": 136, "start": 971.2, "end": 981.0, "text": "Und jetzt ist folgendes folgendes passiert"}, {"id": 137, "start": 981.64, "end": 984.48, "text": "Und genau also und jetzt ist folgendes passiert"}, {"id": 138, "start": 985.4, "end": 991.52, "text": "irgendeiner oder wahrscheinlich mehrere oder was auch immer von unseren außendienstleuten haben gespammt"}, {"id": 139, "start": 991.52, "end": 1000.76, "text": "Ist meine vermutung wir wissen es nicht genau zumindest sind wir bei united internet auf der blacklist gelandet mit emails und"}, {"id": 140, "start": 1003.52, "end": 1005.2, "text": "Das hat dazu geführt"}, {"id": 141, "start": 1005.2, "end": 1012.44, "text": "Die machen das trickreich die sagen dir das nicht direkt wenn du dort versuchst per smtp deine email abzugeben da kriegst du dann"}, {"id": 142, "start": 1012.44, "end": 1014.44, "text": "irgendeine meldung"}, {"id": 143, "start": 1014.44, "end": 1022.04, "text": "Ich habe die meldung vergessen es könnte sogar irgendwas mit rate limit sein oder so also kriegst irgendeine meldung wo du nicht genau drauf schließen kannst"}, {"id": 144, "start": 1022.2, "end": 1029.72, "text": "Dass sie dich geblacklistet haben oder rate limiten so um die sache noch ein bisschen komplizierter zu machen wir machen unsere externe mail"}, {"id": 145, "start": 1030.2, "end": 1033.68, "text": "Kommunikation nicht direkt selbst wir haben einen anbieter der für uns"}, {"id": 146, "start": 1034.12, "end": 1039.4, "text": "Eingehen spam filter macht und ausgehend quasi mit seinen mail server"}, {"id": 147, "start": 1039.4, "end": 1044.28, "text": "mit dem guten namen da steht dass man nicht geblacklistet wird weil"}, {"id": 148, "start": 1044.68, "end": 1050.68, "text": "Sowas willst du in der regel nicht selbst betreiben wenn du das über den anbieter machst der größer ist fest bekannt ist mails verschickt"}, {"id": 149, "start": 1050.68, "end": 1053.84, "text": "Da wirst du eigentlich seltener geblacklistet so was jetzt passiert ist"}, {"id": 150, "start": 1056.72, "end": 1058.72, "text": "Irgendjemand bei uns hat gespammt"}, {"id": 151, "start": 1059.92, "end": 1065.64, "text": "Die spam mail sind über unseren spam filter anbieter rausgegangen der filter natürlich nur eingehenden spam"}, {"id": 152, "start": 1065.64, "end": 1070.4, "text": "Die haben das verschickt an gmx und web.de und was noch was gehört dann freenet und so"}, {"id": 153, "start": 1071.4, "end": 1074.4, "text": "Was gehört noch ein was gehört alles zu united internet"}, {"id": 154, "start": 1075.12, "end": 1077.12, "text": "Was sind da alles dabei?"}, {"id": 155, "start": 1079.24, "end": 1082.04, "text": "Gmx web.de mail.com strato"}, {"id": 156, "start": 1083.48, "end": 1086.84, "text": "Also da der ganze das ganze geht durchs"}, {"id": 157, "start": 1088.44, "end": 1090.28, "text": "Und"}, {"id": 158, "start": 1090.28, "end": 1094.48, "text": "Die emails sind halt nie bei den empfängern angekommen"}, {"id": 159, "start": 1094.48, "end": 1101.6, "text": "Und unser spam anbieter der dazwischen ist hat allerdings auch die fehler meldung von gmx und von united internet"}, {"id": 160, "start": 1101.92, "end": 1106.84, "text": "Nie an uns weitergeleitet das heißt united internet hat uns gesperrt in kombination mit"}, {"id": 161, "start": 1107.36, "end": 1112.04, "text": "unserem absender also mit unserer domain und von den email servern"}, {"id": 162, "start": 1112.76, "end": 1114.76, "text": "und dann war halt"}, {"id": 163, "start": 1115.52, "end": 1120.44, "text": "Nix mehr möglich da konnten die typen quasi sich untereinander keine mails mehr schicken und das hat wohl"}, {"id": 164, "start": 1120.44, "end": 1127.12, "text": "Richtig stress gemacht weil die wollten sich teilweise noch mal verträge heim schicken per mail oder irgendwelche kollegen zum"}, {"id": 165, "start": 1127.32, "end": 1129.84, "text": "geburtstag einladen so was leute ich sag euch riesen paar"}, {"id": 166, "start": 1130.36, "end": 1131.84, "text": "riesen panik"}, {"id": 167, "start": 1131.84, "end": 1133.84, "text": "und im endeffekt"}, {"id": 168, "start": 1134.28, "end": 1137.04, "text": "Ja so was in der richtung und im endeffekt"}, {"id": 169, "start": 1138.0, "end": 1143.28, "text": "Ja könnte man jetzt natürlich sagen wir haben gespammt die haben uns zu recht gebannt also"}, {"id": 170, "start": 1144.88, "end": 1146.72, "text": "Also ich schon okay"}, {"id": 171, "start": 1146.72, "end": 1150.56, "text": "Aber das kannst du jemanden vom außendienst der von der technik halt keine"}, {"id": 172, "start": 1151.24, "end": 1157.44, "text": "Ahnung hat nicht erklären und das problem ist halt derjenige der geblockt ist der hat ja auch nicht zwangsläufig gespammt"}, {"id": 173, "start": 1157.44, "end": 1164.36, "text": "Also irgendwelche leute haben ein bisschen rum gespammt und dafür sind quasi alle dann alle unsere außendienst mitarbeiter betroffen die halt"}, {"id": 174, "start": 1164.36, "end": 1170.68, "text": "Ein email account bei uns haben was halt alle sind und das ist halt doof so und wie das ganze dann"}, {"id": 175, "start": 1170.68, "end": 1176.28, "text": "Kurz kurzfassung kurzfassung der ganzen geschichte das ganze ist dann folgendermaßen ausgegangen"}, {"id": 176, "start": 1178.28, "end": 1179.88, "text": "Unser"}, {"id": 177, "start": 1179.88, "end": 1181.88, "text": "unser experte für mail"}, {"id": 178, "start": 1182.76, "end": 1185.08, "text": "Wollte an den support schreiben von gmx"}, {"id": 179, "start": 1185.92, "end": 1191.64, "text": "Oder ist sein chef zu ihm gekommen noch das wollte er schreiben an einem tag wo das ganze noch gar nicht so schlimm war"}, {"id": 180, "start": 1191.64, "end": 1198.24, "text": "Ja wo es erst noch seit kurzem kaputt war wollte er an den support von gmx schreiben und sagen jungs"}, {"id": 181, "start": 1198.24, "end": 1204.76, "text": "Wir scheinen uns geblackliste zu haben und da ist sein chef zu ihm gekommen und hat ihm gesagt nein das machst du jetzt nicht"}, {"id": 182, "start": 1205.32, "end": 1210.28, "text": "Dafür haben wir quasi extra service manager stellen die sollen das machen so"}, {"id": 183, "start": 1210.92, "end": 1215.28, "text": "Am nächsten tag also sein chef hat es ihm verboten bei gmx nachzufragen"}, {"id": 184, "start": 1216.44, "end": 1218.44, "text": "und am nächsten tag"}, {"id": 185, "start": 1218.44, "end": 1222.4, "text": "Kommt da rein hat er mir erzählt steht der abteilungsleiter bei ihm am platz"}, {"id": 186, "start": 1222.4, "end": 1230.04, "text": "Und meint das muss man sich jetzt mal auf der zuge zergehen lassen und meint ja er ist da in einer"}, {"id": 187, "start": 1230.48, "end": 1232.48, "text": "Facebook gruppe wo viele"}, {"id": 188, "start": 1232.76, "end": 1240.56, "text": "Außendienstmitarbeiter sind und in dieser facebook gruppe wird gerade darüber diskutiert dass unsere emails nicht gehen"}, {"id": 189, "start": 1241.6, "end": 1246.76, "text": "Das heißt da erstmal über facebook erfahren und dann meinte da meinte mein kollege irgendwie ja klar"}, {"id": 190, "start": 1246.76, "end": 1253.56, "text": "Ich weiß dass die emails zu gmx und web de nicht gehen wir sind da wahrscheinlich geblacklisted aber ich darf da nix machen"}, {"id": 191, "start": 1254.0, "end": 1258.48, "text": "Also ich durfte da nix machen ich das sollte der service manager machen und da ist dann muss das"}, {"id": 192, "start": 1259.76, "end": 1262.36, "text": "Und dann und dann als er das erzählen da ging dann halt richtig"}, {"id": 193, "start": 1263.48, "end": 1271.2, "text": "Geht es dann halt richtig los zumindest was dann gelaufen ist und jetzt kommt jetzt kommt man wieder der bus des stonks der bus des stonks hammer"}, {"id": 194, "start": 1272.08, "end": 1274.08, "text": "Wir haben ja keinerlei"}, {"id": 195, "start": 1274.08, "end": 1276.92, "text": "verbindlichen support weder natürlich bei"}, {"id": 196, "start": 1277.52, "end": 1284.28, "text": "internet war warum auch wir haben mit denen nichts zu tun noch haben wir verbindlichen support bei unserem spam anbieter wir haben quasi"}, {"id": 197, "start": 1285.04, "end": 1291.52, "text": "Mach mal support ticket und innerhalb von 48 stunden reagieren wir also unser spam anbieter war da nicht sonderlich hilfreich"}, {"id": 198, "start": 1291.92, "end": 1293.92, "text": "Jetzt passt mal auf"}, {"id": 199, "start": 1294.2, "end": 1301.04, "text": "Führungskräfte trick 17 der abteilungsleiter ist dazu seinem chef gegangen und sein chef ist zu unserem it chef gegangen"}, {"id": 200, "start": 1301.04, "end": 1307.36, "text": "Und unser it chef dem ist aufgefallen er geht immer ich vermute mal squash tennis oder golf"}, {"id": 201, "start": 1307.8, "end": 1310.08, "text": "mit einem von eins und eins spielen"}, {"id": 202, "start": 1317.24, "end": 1322.16, "text": "Zumindest zumindest hat er seine kontakte walten lassen oder hat man nach einem halben tag"}, {"id": 203, "start": 1323.16, "end": 1325.48, "text": "den kommt den kontakt von einem"}, {"id": 204, "start": 1325.48, "end": 1333.0, "text": "Senior boar irgendeinem irgendeinem typ von gmx einem einem senior"}, {"id": 205, "start": 1336.04, "end": 1340.8, "text": "Hätte keine hau hette auf spam management ich weiß es nicht ich weiß es nicht was das war"}, {"id": 206, "start": 1342.36, "end": 1347.32, "text": "Zumindest zumindest hatten wir dann den kontakt von dem typ weil unser it"}, {"id": 207, "start": 1348.0, "end": 1352.44, "text": "IT vorstandstyp irgendwie golf spielen geht mit dem eins und eins"}, {"id": 208, "start": 1352.44, "end": 1356.72, "text": "eins vorstandstyp und der kennt irgendeinen typ bei gmx"}, {"id": 209, "start": 1360.84, "end": 1362.84, "text": "Na ja zumindest"}, {"id": 210, "start": 1363.4, "end": 1365.4, "text": "Hat er den angeschrieben"}, {"id": 211, "start": 1365.6, "end": 1369.56, "text": "Und der hat das halt bestätigt dass wir das wir geplacklistet sind"}, {"id": 212, "start": 1370.36, "end": 1374.78, "text": "Und dann haben sie uns wieder entplacklisten lassen und dann war wieder alles ok"}, {"id": 213, "start": 1374.78, "end": 1382.26, "text": "Ja und zwischenzeitlich haben sie die ganze zeit in die facebook gruppe geguckt ob es da jetzt nicht der shitstorm zusammenbraut und so was also"}, {"id": 214, "start": 1382.34, "end": 1384.34, "text": "ganz abgedrehtes zeug"}, {"id": 215, "start": 1384.86, "end": 1391.22, "text": "So zumindest was ich mir jetzt überlegt habe beziehungsweise was der kollege bei mir auf der arbeit der sich um unsere mail"}, {"id": 216, "start": 1391.54, "end": 1394.82, "text": "Sachen zum höchsten und größten halt kümmert und ich was wir uns heute überlegt haben"}, {"id": 217, "start": 1395.38, "end": 1401.12, "text": "Wozu übrigens sein chef auch gesagt hat weiß nicht ob das so eine gute idee ist aber das war alles bevor dieser"}, {"id": 218, "start": 1401.12, "end": 1407.68, "text": "Bevor dieser große große stress da war also was wir uns jetzt überlegt haben und das was wir heute auch zum teil im stream bauen"}, {"id": 219, "start": 1409.64, "end": 1415.28, "text": "Frage an euch chat was ist die beste möglichkeit zu checken ob man geplacklistet ist"}, {"id": 220, "start": 1416.4, "end": 1423.6, "text": "Die euch so einfällt wenn ihr nicht die möglichkeit habt irgendwelche smtp messages oder sonst was auszuwerten oder einfach nur wirklich"}, {"id": 221, "start": 1424.12, "end": 1426.12, "text": "blackbox auf nummer sicher gehen wollt"}, {"id": 222, "start": 1427.12, "end": 1429.12, "text": "dass ihr"}, {"id": 223, "start": 1429.12, "end": 1431.12, "text": "dass eure mails ankommen"}, {"id": 224, "start": 1432.24, "end": 1436.36, "text": "Ne nicht auf email protokollebene so ganz ganz brain dead"}, {"id": 225, "start": 1437.96, "end": 1445.6, "text": "Ne ne ganz nein ganz ganz brain dead ganz nicht irgendwelche wir reden nicht von dass man weiß was was wie das unter der haube funktioniert"}, {"id": 226, "start": 1447.6, "end": 1454.22, "text": "Zumindest auf was auf welche idee wir heute gekommen ist ist folgendes richtig wir machen uns einfach fake accounts"}, {"id": 227, "start": 1454.8, "end": 1456.8, "text": "richtig wir machen uns fake accounts"}, {"id": 228, "start": 1456.8, "end": 1459.08, "text": "Wir machen uns fake accounts bei"}, {"id": 229, "start": 1459.8, "end": 1462.2, "text": "gmx web de strato"}, {"id": 230, "start": 1463.0, "end": 1465.64, "text": "eins und eins gmail und sowas"}, {"id": 231, "start": 1466.88, "end": 1470.8, "text": "Und dann schicken wir uns mails und wir schicken uns einfach"}, {"id": 232, "start": 1471.52, "end": 1478.32, "text": "Haben wir uns überlegt dass wir nicht durch diesen mist noch mal geblockt werden wir schicken uns einfach über eine stunde lang"}, {"id": 233, "start": 1479.12, "end": 1483.52, "text": "zehn mails als wir schicken uns quasi oder sagen wir so wir schicken uns alle"}, {"id": 234, "start": 1483.52, "end": 1489.04, "text": "Wir schicken uns alle keine ahnung alle zehn minuten alle zehn minuten schicken wir uns eine mail"}, {"id": 235, "start": 1490.08, "end": 1493.92, "text": "eine mail an gmx eine mail an eins und eins eine mail an"}, {"id": 236, "start": 1495.76, "end": 1501.92, "text": "Gmx an web de so und wenn eine stunde rum ist beziehungsweise wenn zehn mails verschickt wurden"}, {"id": 237, "start": 1502.28, "end": 1508.84, "text": "Gehen wir einfach per imap an die ganzen fake accounts dran und gucken ob dort zehn mails in der inbox liegen"}, {"id": 238, "start": 1508.84, "end": 1515.68, "text": "Wenn nicht zehn mails in der inbox liegen dann kann man schon mal ein warning raushauen dass man einer nachguckt ob wir nicht wieder"}, {"id": 239, "start": 1515.68, "end": 1517.68, "text": "geblacklistet worden sind"}, {"id": 240, "start": 1519.88, "end": 1521.88, "text": "Sven supreme dankeschön für den sub"}, {"id": 241, "start": 1522.2, "end": 1529.32, "text": "Da habe ich mir so gedacht das müsste ich doch relativ einfach als prometoise exporter programmieren lassen wir brauchen dafür"}, {"id": 242, "start": 1529.32, "end": 1533.16, "text": "eigentlich von der idee her ein dotnet programm oder in irgendeinem programm"}, {"id": 243, "start": 1533.8, "end": 1537.48, "text": "was smtp sprechen kann was imap sprechen kann"}, {"id": 244, "start": 1537.48, "end": 1539.08, "text": "imap sprechen kann"}, {"id": 245, "start": 1539.08, "end": 1540.52, "text": "und"}, {"id": 246, "start": 1540.52, "end": 1542.52, "text": "was"}, {"id": 247, "start": 1543.52, "end": 1546.2, "text": "Prometoise exporter ja eins ist immer so blöd"}, {"id": 248, "start": 1548.08, "end": 1551.64, "text": "Eins ist eins ist immer blöd also zehn zehn ist schon besser"}, {"id": 249, "start": 1555.92, "end": 1562.68, "text": "Du bekommst näher nicht zwangsläufig also vom smtp vom smtp schon mal nicht du kannst das anhaken dass wenn du die"}, {"id": 250, "start": 1562.68, "end": 1571.2, "text": "E-mail liest dass du eine bestätigung kriegst das macht nix leute ganz"}, {"id": 251, "start": 1571.84, "end": 1573.84, "text": "So blöd bin ich auch nicht"}, {"id": 252, "start": 1574.08, "end": 1579.26, "text": "Ich schreibe einfach einen geheimen string in die email in das email subject"}, {"id": 253, "start": 1579.48, "end": 1586.08, "text": "Und nur wenn der geheime string in dem email subject drinne steht nur dann zählt die email als von uns"}, {"id": 254, "start": 1586.08, "end": 1591.96, "text": "Super so da muss dann sowas drinne stehen wie super geheimer header string oder so"}, {"id": 255, "start": 1597.0, "end": 1601.08, "text": "Wir haben die gespammt wir wissen es nicht genau wir sind uns nur relativ sicher dass es wohl"}, {"id": 256, "start": 1601.44, "end": 1604.6, "text": "Zurecht ist der bann was genau weiß ich nicht"}, {"id": 257, "start": 1604.6, "end": 1611.52, "text": "Okay, was ich würde nicht auf die anstatt ein bau da eine challenge in die mail die du dann überprüfen kannst zum beispiel"}, {"id": 258, "start": 1620.32, "end": 1621.8, "text": "Ja aber"}, {"id": 259, "start": 1621.8, "end": 1629.16, "text": "Nee, aber warum ich mache einen geheime string in die email in das email subject dann zähle ich die mails und dann sind zehn"}, {"id": 260, "start": 1629.16, "end": 1631.16, "text": "E-mails da und gut ist"}, {"id": 261, "start": 1631.16, "end": 1636.32, "text": "Doch, okay, und wenn nur neun da sind ist es schlecht man könnte vielleicht noch"}, {"id": 262, "start": 1637.16, "end": 1644.92, "text": "Man könnte vielleicht noch abfangen ob es beim senden ein fehler gegeben hat weil netzwerkprobleme oder so und dann dann zieht man das wo es"}, {"id": 263, "start": 1645.16, "end": 1647.16, "text": "Sendefehler gegeben hat ab"}, {"id": 264, "start": 1649.64, "end": 1652.88, "text": "Oder ist es nur ein warning oder so müssen wir mal gucken"}, {"id": 265, "start": 1652.88, "end": 1659.64, "text": "Ich das weiß ich nicht keine ahnung ich kenne mich mit email ehrlich gesagt auch nicht so gut aus"}, {"id": 266, "start": 1662.36, "end": 1668.48, "text": "Na moment zehn mal der gleiche text nicht auf einmal wir schicken zehn mal den gleichen zehn mal die gleiche email an"}, {"id": 267, "start": 1669.0, "end": 1672.8, "text": "Fünf und das stimmt nicht wir schicken fünf mal die gleiche email an"}, {"id": 268, "start": 1672.8, "end": 1681.64, "text": "An fünf unterschiedliche anbieter also eine email an jedes postfach und das auch nur alle zehn minuten also das ist kein spam"}, {"id": 269, "start": 1687.2, "end": 1689.28, "text": "Du kannst die message id setzen ja"}, {"id": 270, "start": 1692.6, "end": 1698.56, "text": "Ja aber wozu das man kann es auch unnötig kompliziert machen es müssen einfach zehn emails da sein und wenn und wenn email"}, {"id": 271, "start": 1698.56, "end": 1703.04, "text": "Und wenn emails wenn ich zehn emails da sind dann"}, {"id": 272, "start": 1703.64, "end": 1706.72, "text": "Ja ist klar das lese ich jetzt schnell nebenbei easy"}, {"id": 273, "start": 1707.56, "end": 1710.4, "text": "So und wenn nicht dann passt das"}, {"id": 274, "start": 1719.36, "end": 1723.64, "text": "Das bringt mir alles nichts wo soll ich da wissen ob beispielsweise grad"}, {"id": 275, "start": 1724.8, "end": 1727.2, "text": "webde entschieden hat unsere mails mal"}, {"id": 276, "start": 1727.2, "end": 1730.64, "text": "Zwei stunden irgendwie liegen zu lassen weil zu viel ist oder so"}, {"id": 277, "start": 1731.36, "end": 1735.76, "text": "Wo soll das wo sollen die wissen was die intern machen bei bei united internet"}, {"id": 278, "start": 1741.2, "end": 1747.76, "text": "Was ich mache wenn die email länger in der queue hängt naja der check geht alle zehn minuten das heißt nach der letzten email"}, {"id": 279, "start": 1747.76, "end": 1757.92, "text": "Dauert es zehn minuten bis sie zeit hat da zu da zu sein dann gibt es gibt es halt einen warning dann gibt es halt eine warning"}, {"id": 280, "start": 1759.76, "end": 1765.92, "text": "Das dürfen dann die leute die diese am ende verwenden im monitoring einstellen wie sie das haben wollen"}, {"id": 281, "start": 1767.6, "end": 1769.6, "text": "Ne das ist nicht problematisch"}, {"id": 282, "start": 1770.56, "end": 1773.52, "text": "Da steht nichts dabei was man irgendwie"}, {"id": 283, "start": 1773.52, "end": 1775.52, "text": "Zurück da zuordnen könnte"}, {"id": 284, "start": 1780.32, "end": 1784.08, "text": "Ja also wie gesagt wenn die email zehn minuten in der queue hängt da gibt es halt einen warning pech gehabt"}, {"id": 285, "start": 1792.96, "end": 1798.88, "text": "Und das müsste ganz gut funktionieren also das heißt als erstes leute müssen uns fake emails machen"}, {"id": 286, "start": 1798.88, "end": 1804.8, "text": "Wir sind mal komm wir machen uns eine fake email adresse komm wir machen uns eine buggymx, okay"}, {"id": 287, "start": 1805.84, "end": 1809.84, "text": "Zum testen zum testen reicht eine fake email adresse würde ich sagen"}, {"id": 288, "start": 1811.84, "end": 1813.04, "text": "Was"}, {"id": 289, "start": 1813.04, "end": 1817.04, "text": "Alter wie sieht denn die seite aus monka es also registrieren"}, {"id": 290, "start": 1818.88, "end": 1821.44, "text": "Nein ich bau das nicht in java wir bauen das in dotnet"}, {"id": 291, "start": 1821.44, "end": 1831.68, "text": "Sieben weil java habe ich keinen bock drauf ich lasse doch mal da wieder an also okay wir brauchen was brauche eine gute"}, {"id": 292, "start": 1832.48, "end": 1834.48, "text": "Kackel"}, {"id": 293, "start": 1834.96, "end": 1839.2, "text": "Kackel fake mail alles klar neutra moment moment moment"}, {"id": 294, "start": 1841.12, "end": 1844.08, "text": "Jetzt fühle ich mich aber schon gleich wieder ausgegrenzt hier"}, {"id": 295, "start": 1844.08, "end": 1852.56, "text": "So neutral vorname null nachname kackel posterzahl 6 0 3 2 9 frankfurt"}, {"id": 296, "start": 1854.8, "end": 1857.2, "text": "Jano die kannst du aber nicht per ein map abfragen"}, {"id": 297, "start": 1859.36, "end": 1861.36, "text": "Und du kannst auch per smtp nix hinschicken"}, {"id": 298, "start": 1862.0, "end": 1865.84, "text": "Na doch per smtp hinschicken kannst du schon wahrscheinlich was aber du kannst es aber nicht"}, {"id": 299, "start": 1865.84, "end": 1873.2, "text": "Per ein map abfragen du kannst den dotnet ohne probleme sachen programmieren jetzt schon das kommt im november raus das funktioniert"}, {"id": 300, "start": 1874.16, "end": 1877.2, "text": "Straße kackel street 5"}, {"id": 301, "start": 1878.0, "end": 1880.88, "text": "Geburtstag 1.1. 1990"}, {"id": 302, "start": 1882.0, "end": 1884.0, "text": "Passwort okay da dürfte jetzt nicht zu kommen"}, {"id": 303, "start": 1884.88, "end": 1891.92, "text": "Aber ich habe jetzt schon mal eine fake email adresse und ich habe jetzt schon mal eine fake email adresse"}, {"id": 304, "start": 1891.92, "end": 1896.32, "text": "1990 passwort okay da dürfte jetzt nicht zugucken leute"}, {"id": 305, "start": 1897.76, "end": 1900.64, "text": "Ich muss auch kurz mal mein password mein password manager"}, {"id": 306, "start": 1906.32, "end": 1913.44, "text": "Passwort manager weg machen okay moment passport und ich muss es ja nachher noch schreiben können okay"}, {"id": 307, "start": 1913.44, "end": 1915.44, "text": "Okay"}, {"id": 308, "start": 1921.12, "end": 1929.12, "text": "Okay sehr gut sehr gutes passwort alles klar password wählen password wählen"}, {"id": 309, "start": 1932.96, "end": 1936.36, "text": "Ist es was ist das jetzt sagt er mir dass das password gut ist oder nicht"}, {"id": 310, "start": 1937.44, "end": 1941.76, "text": "Ist das password gut oder nicht ich kann es euch zeigen dann wisst ihr ob es gut ist oder nicht"}, {"id": 311, "start": 1941.76, "end": 1943.76, "text": "Mobilfunknummer"}, {"id": 312, "start": 1944.08, "end": 1946.08, "text": "Muss man das eingeben"}, {"id": 313, "start": 1949.0, "end": 1951.44, "text": "Das ist mal lehr zeichen fack"}, {"id": 314, "start": 1952.44, "end": 1955.8, "text": "null nein 0151 null"}, {"id": 315, "start": 1958.92, "end": 1960.92, "text": "Exzellent"}, {"id": 316, "start": 1961.04, "end": 1963.04, "text": "Alles klar das funktioniert schon mal"}, {"id": 317, "start": 1965.04, "end": 1968.76, "text": "V6 z1 ey"}, {"id": 318, "start": 1968.76, "end": 1974.16, "text": "Wir schützen ihre daten okay email adresse kackel kackel fake mail"}, {"id": 319, "start": 1974.16, "end": 1996.92, "text": "Endliche fix punkte alles klar password weiß nur ich sage ich euch nicht"}, {"id": 320, "start": 2004.96, "end": 2006.96, "text": "Kann ich nicht entziffern"}, {"id": 321, "start": 2011.52, "end": 2013.52, "text": "Alter"}, {"id": 322, "start": 2016.08, "end": 2018.08, "text": "Ach muss man das ohne null machen oder wie"}, {"id": 323, "start": 2018.08, "end": 2027.88, "text": "Ehm muss die kürzer sein vielleicht"}, {"id": 324, "start": 2033.28, "end": 2034.68, "text": "Okay"}, {"id": 325, "start": 2034.68, "end": 2036.04, "text": "Fake mail ist ein"}, {"id": 326, "start": 2036.04, "end": 2038.04, "text": "E-mail"}, {"id": 327, "start": 2038.04, "end": 2040.04, "text": "E-mail ist ein"}, {"id": 328, "start": 2040.04, "end": 2042.04, "text": "E-mail ist ein"}, {"id": 329, "start": 2042.04, "end": 2044.04, "text": "E-mail ist ein"}, {"id": 330, "start": 2044.04, "end": 2046.04, "text": "E-mail ist ein"}, {"id": 331, "start": 2046.04, "end": 2048.04, "text": "E-mail ist ein"}, {"id": 332, "start": 2048.04, "end": 2050.36, "text": "E-mail ist ein"}, {"id": 333, "start": 2050.36, "end": 2052.36, "text": "E-mail ist ein"}, {"id": 334, "start": 2052.36, "end": 2054.36, "text": "E-mail ist ein"}, {"id": 335, "start": 2054.72, "end": 2056.72, "text": "E-mail ist ein"}, {"id": 336, "start": 2056.72, "end": 2059.2, "text": "E-mail ist ein"}, {"id": 337, "start": 2059.2, "end": 2061.2, "text": "E-mail ist ein"}, {"id": 338, "start": 2064.08, "end": 2066.08, "text": "E-mail ist ein"}, {"id": 339, "start": 2071.6, "end": 2073.68, "text": "E-mail ist ein"}, {"id": 340, "start": 2074.72, "end": 2076.52, "text": "E-mail ist ein"}, {"id": 341, "start": 2076.52, "end": 2082.52, "text": "mobile vorwahl was gibt es denn da alles"}, {"id": 342, "start": 2082.52, "end": 2091.28, "text": "aha siehst du deswegen 0 1 5 1 1 1 2 3 1 2"}, {"id": 343, "start": 2091.28, "end": 2099.76, "text": "2 dings blub blub ok perfekt dvrd jetzt geht's leute ich sags euch bärm was warum alter"}, {"id": 344, "start": 2099.76, "end": 2105.36, "text": "ach so muss man da auch wieder ohne null nee aber das das checkt er schon"}, {"id": 345, "start": 2105.36, "end": 2130.62, "text": "weil die mich ver ok die sind so schlau und checken das ok ich guck mal wie lang meine"}, {"id": 346, "start": 2130.62, "end": 2136.96, "text": "handynummer ist vielleicht vielleicht ist es vielleicht ist es die was ist das temp"}, {"id": 347, "start": 2136.96, "end": 2143.68, "text": "phone number view kann man die seite aufmachen oder wird man da folgespammt mit mit keck"}, {"id": 348, "start": 2143.68, "end": 2160.96, "text": "spam shit ok alles klar keine ahnung ich nehme jetzt einfach was von dieser seite da soll"}, {"id": 349, "start": 2160.96, "end": 2187.36, "text": "mir recht sein wunderbar bkj mp jetzt aber please alter gmx man ok ich guck mal wie lang"}, {"id": 350, "start": 2187.36, "end": 2192.28, "text": "meine handynummer ist weil die können das doch nicht live überprüfen oder das kann"}, {"id": 351, "start": 2217.36, "end": 2241.76, "text": "das ist nicht meine telefonnummer leute alles klar excellent ok wie ist die email adresse"}, {"id": 352, "start": 2241.76, "end": 2254.24, "text": "die keckel fakemail at gimmicks.de aha aha aha nice zum postfach so da sind wir null"}, {"id": 353, "start": 2254.24, "end": 2264.76, "text": "keck ist am start leute null keck sehr schön sehr schön sehr gut das war tatsächlich"}, {"id": 354, "start": 2264.76, "end": 2268.96, "text": "schwerer als gedacht ok wir haben es geschafft eine fake email adresse ist am start jetzt"}, {"id": 355, "start": 2268.96, "end": 2277.2, "text": "können wir unser projekt anlegen und loslegen hätte ich nicht gedacht dass es so schwierig"}, {"id": 356, "start": 2277.2, "end": 2302.88, "text": "ist eine fake handynummer da einzutragen du du du du du du du du du du du du du du du"}, {"id": 357, "start": 2302.88, "end": 2317.92, "text": "du ok wunderbar alles klar dann legen wir mal los würde ich sagen äh was nutzt man"}, {"id": 358, "start": 2317.92, "end": 2322.88, "text": "bei dotnet heutzutage was was nutzt man bei dotnet eigentlich für die gui heute wp mp"}, {"id": 359, "start": 2322.88, "end": 2330.8, "text": "also mauri auf gar keinen fall mach also mauri ist das neue xamarin forms und das war schon"}, {"id": 360, "start": 2330.8, "end": 2338.52, "text": "kurze und mauri ist auch müll wpf oder windows forms ja ganz ganz im ernst es ist eigentlich"}, {"id": 361, "start": 2338.52, "end": 2343.32, "text": "beides ziemlicher müll ich persönlich würde sagen für ganz kleine quick and dirty sachen"}, {"id": 362, "start": 2343.32, "end": 2346.96, "text": "oder wenn man interop mit anderen plattformen haben will ist windows forms noch am besten"}, {"id": 363, "start": 2346.96, "end": 2356.96, "text": "weil es einfach windows 32 ist mit ein bisschen mit ein bisschen zucker wpf ist ok windows"}, {"id": 364, "start": 2356.96, "end": 2361.32, "text": "only zumindest allerdings ist wpf zwar ein bisschen neuer als windows forms allerdings"}, {"id": 365, "start": 2361.32, "end": 2366.4, "text": "auch nicht wirklich moderner von dem was es kann was ich empfehlen würde ist tatsächlich"}, {"id": 366, "start": 2366.4, "end": 2371.68, "text": "dass hier was jukjuk schreibt avalonia avalonia ist wirklich nicht schlecht ich habe mit avalonia"}, {"id": 367, "start": 2371.68, "end": 2376.72, "text": "selbst noch nichts größeres gemacht das wollte ich demnächst im stream ausprobieren"}, {"id": 368, "start": 2376.72, "end": 2383.8, "text": "aber wenn wenn ich gui machen würde heutzutage in dotnet dann avalonia ich brauche keine"}, {"id": 369, "start": 2383.8, "end": 2389.52, "text": "wegwerf e-mails ich brauche mails wo ich per imap und smtp draufkomme und uwp kann man"}, {"id": 370, "start": 2389.52, "end": 2396.68, "text": "halt auch einfach vergessen wenn es microsoft ja mal irgendwie schaffen würde winui 3 rauszubringen"}, {"id": 371, "start": 2396.68, "end": 2401.28, "text": "und dann halt auch so dass man es benutzen kann für normale anwendung dann wäre das"}, {"id": 372, "start": 2401.28, "end": 2405.36, "text": "auch eine alternative aber gui frameworks und microsoft das zusammen das funktioniert"}, {"id": 373, "start": 2405.36, "end": 2410.56, "text": "einfach nicht das können die nicht ich weiß auch nicht warum aber das können die einfach"}, {"id": 374, "start": 2410.56, "end": 2417.8, "text": "nicht so wir haben es geschafft sondern legen wir mal das projekt für heute an wenn er"}, {"id": 375, "start": 2417.8, "end": 2441.04, "text": "sich dazu entscheiden kann also mk dir wie heißt das ding mail check champ erstmal dort"}, {"id": 376, "start": 2441.04, "end": 2453.4, "text": "net7 updaten alles klar repos mail check champ new console ja dann wollen wir mal so"}, {"id": 377, "start": 2453.4, "end": 2463.6, "text": "neues projekt ist angelegt können wir öffnen weiter starten da toolbox kann zu ach fuck"}, {"id": 378, "start": 2463.6, "end": 2472.8, "text": "ich habe ja heute mein password geändert für den jetbrains account wahrscheinlich"}, {"id": 379, "start": 2472.8, "end": 2479.76, "text": "fliege ich gleich wieder raus leute aus meiner ide da muss ich das password gleich nachgucken"}, {"id": 380, "start": 2479.76, "end": 2500.8, "text": "sollte das so weit sein ok open repos mail mail check champ alles klar ok trust wir trusten"}, {"id": 381, "start": 2500.8, "end": 2515.32, "text": "alles klar da sind wir so hello world sollte eigentlich machen ja also ok wir können anfangen"}, {"id": 382, "start": 2515.32, "end": 2520.6, "text": "übrigens das ist ja auch seit dort net hat mich nicht fünf oder so seit sie ist sie"}, {"id": 383, "start": 2520.6, "end": 2526.6, "text": "schaab neun glaube ich so dass man keine main methode mehr braucht dass er das unter der"}, {"id": 384, "start": 2526.6, "end": 2532.4, "text": "haufe für ein macht früher musste man hier immer noch machen name space program static"}, {"id": 385, "start": 2532.4, "end": 2537.32, "text": "main program bla bla bla jetzt kann man jetzt kann man das alles hier hier direkt reinschreiben"}, {"id": 386, "start": 2537.32, "end": 2544.0, "text": "also sprich das hier ist jetzt ein gültiges dort net program was eigentlich ziemlich"}, {"id": 387, "start": 2544.0, "end": 2550.24, "text": "ziemlich nice ist so also wir brauchen paar libraries dass das ganze funktioniert das"}, {"id": 388, "start": 2550.24, "end": 2556.64, "text": "ganze mit eine konsolen anwendung also brauchen wir wahrscheinlich ein bisschen kommandozeilen"}, {"id": 389, "start": 2556.64, "end": 2564.84, "text": "argumenten und sonst was wir brauchen vielleicht farbische farbische kommandozeilen ausgabe"}, {"id": 390, "start": 2564.84, "end": 2572.08, "text": "wir brauchen mail kit mail kit ist für smtp und ein map es gibt gefühlt fast jedes jahr"}, {"id": 391, "start": 2572.08, "end": 2576.04, "text": "ein neues dort net es gibt jedes jahr neues dort net ja die haben releasezyklus von einem"}, {"id": 392, "start": 2576.04, "end": 2581.08, "text": "jahr also es gibt jedes jahr jedes jahr im november erneut dort net version es ist preview"}, {"id": 393, "start": 2581.08, "end": 2589.48, "text": "sieben glaube ich aktuell aber das kommt im november raus weiß ich nicht vielleicht"}, {"id": 394, "start": 2589.48, "end": 2597.16, "text": "dass es beim verschicken was weiß ich warum die das waren vielleicht dass du nicht spammen"}, {"id": 395, "start": 2597.16, "end": 2605.76, "text": "kannst ja cute ist tatsächlich sehr nice problem ist halt c++ und auch die anderen bindings"}, {"id": 396, "start": 2605.76, "end": 2610.2, "text": "letztendlich musste irgendwann immer c++ machen ja es gibt jedes jahr neues dort net letztes"}, {"id": 397, "start": 2610.2, "end": 2616.76, "text": "jahr 6 davor 5 und jetzt 7 das heißt nächstes jahr 8 das ist finde ich aber auch gut weil"}, {"id": 398, "start": 2616.76, "end": 2622.12, "text": "dann tut sich immer was weil es gibt bestimmt welche mögen sich das nicht wenn an den sprachen"}, {"id": 399, "start": 2622.12, "end": 2627.56, "text": "und frameworks nicht so viel tut oder wenn man wie bei go 15 jahre auf generics warten"}, {"id": 400, "start": 2627.56, "end": 2636.08, "text": "muss aber ich ich ich finde es gut dass sich dort net technisch immer was ändert so was"}, {"id": 401, "start": 2636.08, "end": 2639.36, "text": "jetzt habe ich was vergessen also wo sind wir stehen geblieben wir brauchen wir brauchen"}, {"id": 402, "start": 2639.36, "end": 2645.76, "text": "mit sicherheit wir brauchen mit sicherheit jason net weil jason braucht man immer jetzt"}, {"id": 403, "start": 2645.76, "end": 2650.36, "text": "kommt natürlich der erste und fragt warum ich nicht system text jason serializer verwende"}, {"id": 404, "start": 2650.36, "end": 2655.2, "text": "ganz einfach weil ich keinen bock habe und weil das mir bei manchen sachen immer noch"}, {"id": 405, "start": 2655.2, "end": 2663.84, "text": "zu kompliziert ist ach ja und in prometheus agent braumer den prometheus exporter library"}, {"id": 406, "start": 2663.84, "end": 2672.64, "text": "ok so mit was fangen wir dann an wie wie wie legen wir denn jetzt los ich muss jetzt erstmal"}, {"id": 407, "start": 2672.64, "end": 2676.8, "text": "kurz in mich gehen fangen wir mit den email sachen an oder fangen wir mit den fangen"}, {"id": 408, "start": 2676.8, "end": 2682.2, "text": "wir mit den mit den prometheus sachen an oder vielleicht müsste ich erst mal ausprobieren"}, {"id": 409, "start": 2682.2, "end": 2690.04, "text": "der krempel funktioniert ich glaube ich probiere erstmal aus wie das ganze email zeug funktioniert"}, {"id": 410, "start": 2690.04, "end": 2702.28, "text": "also wir brauchen also grob weiß ja wir brauchen den smtp client ops smtp client was will der"}, {"id": 411, "start": 2702.28, "end": 2722.96, "text": "haben als option host und port ja gmx imap smtp wie schickt man an gmx was ok mail.gmx.net"}, {"id": 412, "start": 2722.96, "end": 2744.32, "text": "alles klar auf port 587 und irgendwie tls oder so ok mail.gmx.net port 587 muss man das überhaupt"}, {"id": 413, "start": 2744.32, "end": 2760.48, "text": "so machen oder musste man nicht irgendwas mit connect machen ne send habe ich das richtige"}, {"id": 414, "start": 2760.48, "end": 2781.84, "text": "installiert"}, {"id": 415, "start": 2781.84, "end": 2791.92, "text": "ich muss kurz mein password eingeben für mein jetbrains account dann haben wir es ihr"}, {"id": 416, "start": 2791.92, "end": 2798.36, "text": "dürft gerade nicht zugucken so jetbrains account wo habe ich denn das password für dieses"}, {"id": 417, "start": 2798.36, "end": 2810.8, "text": "ding hier das ist auch noch so lang da brauchen wir jetzt wieder 3 stunden das abzutippen und"}, {"id": 418, "start": 2810.8, "end": 2819.2, "text": "hoffen dass ich mich nicht vertippe habe ich mich jetzt vertippt nein ich habe mich nicht"}, {"id": 419, "start": 2819.2, "end": 2847.36, "text": "vertippt ok nice alles klar activate exit warum warum schmeißt er mich jetzt raus ok ich kann"}, {"id": 420, "start": 2847.36, "end": 2858.64, "text": "euch aber wieder anmachen das sollte jetzt funktionieren ne ne ich kann es nicht copy"}, {"id": 421, "start": 2858.64, "end": 2863.44, "text": "pasten wenn ich copy paste ist es hier in meiner in meiner history und da soll es nicht drinne"}, {"id": 422, "start": 2863.44, "end": 2871.8, "text": "sein ne ich habe zwei monitore sonst könnte ich das ja gar nicht gescheit machen habe"}, {"id": 423, "start": 2871.8, "end": 2875.72, "text": "ich wieder eingeschaltet ich habe es falsche eingeschaltet sollte eigentlich längst wieder"}, {"id": 424, "start": 2875.72, "end": 2890.48, "text": "was sehen ok passt also github mailkit ich brauche paar examples für mailkit mailkit"}, {"id": 425, "start": 2890.48, "end": 2910.08, "text": "documentation examples smtp so smtp client sag doch connect was so was hat er jetzt wieder"}, {"id": 426, "start": 2910.08, "end": 2923.6, "text": "für schmerz ne was was moment das ist nicht der smtp client das ist nicht der smtp client"}, {"id": 427, "start": 2923.6, "end": 2930.28, "text": "von von mailkit das ist der smtp client von von microsoft shit ich will melkit smtp client"}, {"id": 428, "start": 2930.28, "end": 2936.2, "text": "nicht das microsoft ding da ich wusste gar nicht das system netmail den smtp client hat"}, {"id": 429, "start": 2936.2, "end": 2947.4, "text": "so smtp client connect so und da wollen wir jetzt mail.gmx.net war es doch oder genau"}, {"id": 430, "start": 2947.4, "end": 2957.52, "text": "port 587 war es glaube ich secure socket options ja auto auto wunderbar alles klar ich bin so"}, {"id": 431, "start": 2957.52, "end": 2967.04, "text": "was von ok so using und wie geht es jetzt weiter authentic ach mist jetzt muss ich jetzt muss"}, {"id": 432, "start": 2967.04, "end": 2970.2, "text": "ich da mal ein password reinschreiben und ihr solltet das password nicht sehen also"}, {"id": 433, "start": 2970.2, "end": 2976.52, "text": "muss ich irgendwie mal credentials oder so abrufen über ne ja das kriegen wir hin was"}, {"id": 434, "start": 2976.52, "end": 2980.96, "text": "macht man mit prometheuse sehe ich das richtig das ist eine datenbank zum datensammeln gut"}, {"id": 435, "start": 2980.96, "end": 2985.32, "text": "also ich würde sagen die meisten datenbanken sind in der regel zum datensammeln prometheuse"}, {"id": 436, "start": 2985.32, "end": 2990.84, "text": "ist eine time series database für metrigen klingt jetzt natürlich besonders ab dankeschön"}, {"id": 437, "start": 2990.84, "end": 2994.48, "text": "game shock findet ab versteht natürlich kein mensch was wofür das da ist wenn ich das"}, {"id": 438, "start": 2994.48, "end": 2998.52, "text": "so sage da kannst du beispielsweise wenn du wenn du eigene anwendung programmierst oder"}, {"id": 439, "start": 2998.52, "end": 3009.0, "text": "wenn du server überwachen willst kannst du mit musik lautstärke kannst du werte hinschicken"}, {"id": 440, "start": 3009.0, "end": 3012.96, "text": "wie es aktuell ist zum beispiel wie viel ram verbrauch deine anwendung hat wie auf der"}, {"id": 441, "start": 3012.96, "end": 3017.84, "text": "garbage collector gelaufen ist oder plattenauslastung von einem system solche sachen also das sind"}, {"id": 442, "start": 3017.84, "end": 3022.32, "text": "alles metriken und die schickst du dahin die werden zusammen mit einem timestamp gespeichert"}, {"id": 443, "start": 3022.32, "end": 3026.16, "text": "deswegen ist eine time series database und die kannst du dann relativ effizient querien"}, {"id": 444, "start": 3026.16, "end": 3032.88, "text": "also da kannst du quasi millionen daten rein machen und hast dann keine 15 minuten bis"}, {"id": 445, "start": 3032.88, "end": 3037.24, "text": "die grafen aufbauen wie im zabbix damit du das ganze gut verwenden kannst brauchst du"}, {"id": 446, "start": 3037.24, "end": 3042.2, "text": "aber ein ordentliches frontend weil prometheuse selbst sammelt nur ein da brauchst du sowas"}, {"id": 447, "start": 3042.2, "end": 3049.28, "text": "wie grafana zum beispiel davor oder ja so zabbix kann diesen prometheuse temple ja auch verarbeiten"}, {"id": 448, "start": 3049.28, "end": 3052.68, "text": "ja aber wie gesagt wir machen ja heute kein prometheuse server wir machen den noten wir"}, {"id": 449, "start": 3052.68, "end": 3060.32, "text": "machen den prometheuse exporter also sprich ein check wir lesen daten aus und stellen"}, {"id": 450, "start": 3060.32, "end": 3065.8, "text": "die auf einer webseite zur verfügung dass prometheuse die abrufen kann prometheuse pullt"}, {"id": 451, "start": 3065.8, "end": 3071.48, "text": "nämlich immer nur die ganzen infos also sprich du sagst prometheuse ruft mal von diesen drei"}, {"id": 452, "start": 3071.48, "end": 3075.52, "text": "haus die daten ab und dann geht prometheuse in fünf minuten takt oder wie du es eingestellt"}, {"id": 453, "start": 3075.52, "end": 3085.72, "text": "hast dahin ruft die daten ab also prometheuse pullt die daten immer kennst du metabase nee"}, {"id": 454, "start": 3085.72, "end": 3093.36, "text": "ok und am ende smtp client disconnect ich hätte jetzt eigentlich gedacht das macht er beim"}, {"id": 455, "start": 3093.36, "end": 3098.12, "text": "dispose automatisch aber ok so wie kriege ich denn da jetzt mal meine credentials rein"}, {"id": 456, "start": 3098.12, "end": 3102.44, "text": "dass ihr die netz sieht leute wir könnten dort net user credentials verwenden da weiß"}, {"id": 457, "start": 3102.44, "end": 3107.6, "text": "ich aber ehrlich gesagt gar nicht wie das funktioniert dort net secrets hatte schon mal"}, {"id": 458, "start": 3107.6, "end": 3114.28, "text": "jemand verwendet zum dieses dort net tool zum secret speichern also dass das eingebaute"}, {"id": 459, "start": 3114.28, "end": 3129.88, "text": "dort net user secrets set doch doch doch du kannst du kannst environment variablen machen"}, {"id": 460, "start": 3129.88, "end": 3134.32, "text": "das geht aber das will ich eigentlich gar nicht mal wisst ihr was ich habe kein bock"}, {"id": 461, "start": 3134.32, "end": 3138.04, "text": "jetzt irgendwelche super super komplizierten sachen zu machen wir machen das einfach so"}, {"id": 462, "start": 3138.04, "end": 3165.08, "text": "glas secrets static string mx schreibt es einfach hier rein und gut das lull so mal gucken"}, {"id": 463, "start": 3165.08, "end": 3170.04, "text": "ob ihr das jetzt seht wie gesagt kann man schöner machen aber für jetzt gmx passwort"}, {"id": 464, "start": 3170.04, "end": 3174.16, "text": "ok mal es wird nicht angezeigt was es ist wunderbar dann schreibe ich jetzt einfach kurz das"}, {"id": 465, "start": 3174.16, "end": 3182.36, "text": "passwort rein einfach vererben von was vererben von wo also verstehe ich das richtig dass"}, {"id": 466, "start": 3182.36, "end": 3186.96, "text": "die auswertungs protokolle per email schicken lassen nee wo habe ich denn sowas gesagt"}, {"id": 467, "start": 3186.96, "end": 3193.0, "text": "gar nicht ich will email schicken und gucken ob die emails ankommen ich schicke mir selbst"}, {"id": 468, "start": 3193.0, "end": 3199.62, "text": "emails ich meine der test von gmx zu gmx ist ziemlich blöd also ich bräuchte um genau"}, {"id": 469, "start": 3199.62, "end": 3205.84, "text": "zu sein eigentlich noch einen zweiten account von dem ich schicken kann an gmx aber letztendlich"}, {"id": 470, "start": 3205.84, "end": 3210.4, "text": "ist es für die logik darunter egal und ich kann es von einem account besser testen also"}, {"id": 471, "start": 3210.4, "end": 3218.64, "text": "das ziel ist mir selbst emails zu schicken und zu gucken ob alle ankommen wie gesagt"}, {"id": 472, "start": 3218.64, "end": 3223.28, "text": "normalerweise würde ich natürlich auch nicht von einem gmx account an den gleichen account"}, {"id": 473, "start": 3223.28, "end": 3230.24, "text": "schicken sondern von bei uns auf der arbeit über unseren spam anbieter an gmx an gmail"}, {"id": 474, "start": 3230.24, "end": 3236.24, "text": "an webde und dann gucken ob nach einer stunde zehn emails angekommen sind aber so zum test"}, {"id": 475, "start": 3236.24, "end": 3242.52, "text": "muss das reichen so leute ihr müsst jetzt noch mal kurz ihr dürft jetzt mal kurz nicht"}, {"id": 476, "start": 3242.52, "end": 3248.68, "text": "gucken weil ich jetzt das password hier reinschreiben muss das password ist übrigens wenn"}, {"id": 477, "start": 3248.68, "end": 3257.36, "text": "ich liel wenn ich es liegen sollte finde das bestimmt der chain law besonders lustig aber"}, {"id": 478, "start": 3257.36, "end": 3276.0, "text": "ich liege es ja nicht so ich hoffe ihr habt genau ich hoffe ihr habt euch alle die augen"}, {"id": 479, "start": 3276.0, "end": 3283.88, "text": "zugehalten und ich darf jetzt die secrets zartei heute nicht mehr öffnen lull ich meine"}, {"id": 480, "start": 3283.88, "end": 3288.44, "text": "selbst wenn ich es liege ist nicht ist nicht wild dann lösche ich halt einfach ich lösche"}, {"id": 481, "start": 3288.44, "end": 3295.76, "text": "heute die email adresse wieder am ende am ende des streams ok also smtp client connect"}, {"id": 482, "start": 3295.76, "end": 3302.4, "text": "mail.gmx.net smtp client jetzt wahrscheinlich send und wie sendet meine email adresse wie"}, {"id": 483, "start": 3302.4, "end": 3307.24, "text": "sendet meine email darüber das ist natürlich jetzt spannend wie macht man habe ich keine"}, {"id": 484, "start": 3307.24, "end": 3325.44, "text": "ahnung wie das funktioniert smtp examples send message message send message ja ja jetzt"}, {"id": 485, "start": 3325.44, "end": 3340.08, "text": "wird nirgendswo aufgerufen ok keine ahnung wie man das macht also send message too sharp"}, {"id": 486, "start": 3340.08, "end": 3349.28, "text": "das ist eine gute idee das ist eine wirklich gute idee ja da hast du recht das ist eine"}, {"id": 487, "start": 3349.28, "end": 3357.0, "text": "gute idee ja ja massive fivehead nur mein chat ist so fiveheadig auf so ideen zu kommen"}, {"id": 488, "start": 3357.0, "end": 3365.44, "text": "so also das heißt im endeffekt wir brauchen erstmal eine message die wir senden können"}, {"id": 489, "start": 3365.44, "end": 3374.48, "text": "also war message gleich knew my message und was muss man dann da reinschreiben chat hat"}, {"id": 490, "start": 3374.48, "end": 3379.16, "text": "extrem hohen eq aber das ist ja mittlerweile auch schon bekannt das wissen wir ja der chat"}, {"id": 491, "start": 3379.16, "end": 3391.48, "text": "ist richtig massive brain so empfänger to gleich new mailbox address nee das ging mit"}, {"id": 492, "start": 3391.48, "end": 3401.52, "text": "pass irgendwie das kenne ich schon mailbox address pass moment gmx wie heißt unser"}, {"id": 493, "start": 3401.52, "end": 3419.0, "text": "excellent die leute sind schon wieder ab spam hier so guckt euch an alter tja was willst"}, {"id": 494, "start": 3419.0, "end": 3424.68, "text": "du machen so ist halt so ist es halt ich werde jetzt einfach diesen account nie wieder öffnen"}, {"id": 495, "start": 3424.68, "end": 3439.4, "text": "sondern ein map abfragen so also to mailbox address pass was wollen wir sonst noch haben"}, {"id": 496, "start": 3439.4, "end": 3446.12, "text": "subject aber das ist gut dass ihr spamt weil da kann ich testen ob mein magic string funktioniert"}, {"id": 497, "start": 3446.12, "end": 3451.08, "text": "wobei wenn ihr den magic string seht dann funktioniert es ja nicht weil dann weiß ich"}, {"id": 498, "start": 3451.08, "end": 3455.68, "text": "dass die leute auch schon anfangen mit so komischen dingern deswegen jebaiter ich euch"}, {"id": 499, "start": 3455.68, "end": 3463.84, "text": "einfach und mein magic string mit random und ihr wisst ihn gar nicht easy war random gleich"}, {"id": 500, "start": 3463.84, "end": 3475.84, "text": "new nee wir machen es ein war gut ich bin mir nicht sicher ob das dann mit nullen initialisiert"}, {"id": 501, "start": 3475.84, "end": 3481.12, "text": "ist oder nicht ich kann mir das immer nicht merken dass jetzt ist es jetzt mit nullen initialisiert"}, {"id": 502, "start": 3481.12, "end": 3491.12, "text": "wenn ich so mache oder muss ich new machen das kann ich mir nie merken ist alles gut"}, {"id": 503, "start": 3491.12, "end": 3510.88, "text": "also subject subject ist kackel mail und dann immer immer ordentlich und dann all die so"}, {"id": 504, "start": 3510.88, "end": 3515.84, "text": "und die wisst ihr nicht deswegen könnt ihr auch nicht spam damit outplayed chat"}, {"id": 505, "start": 3515.84, "end": 3533.92, "text": "also send subject haben wir ja feifert subject haben wir tu was brauchen wir denn sonst noch"}, {"id": 506, "start": 3533.92, "end": 3550.68, "text": "from oder muss man oder war das sender"}, {"id": 507, "start": 3550.68, "end": 3554.6, "text": "email email krempel ich habe keine ahnung was der unterschied zwischen from und sender"}, {"id": 508, "start": 3554.6, "end": 3559.52, "text": "ist aber wir schreiben einfach mal das gleiche rein wahrscheinlich wahrscheinlich wahrscheinlich"}, {"id": 509, "start": 3559.52, "end": 3567.68, "text": "geht es so auch oder so und jetzt müssen dann muss da eben den text rein body gleich"}, {"id": 510, "start": 3567.68, "end": 3586.28, "text": "text text part test ok beste beste email überhaupt ok also ich muss from verwenden ok so jetzt"}, {"id": 511, "start": 3586.28, "end": 3594.88, "text": "haben wir unsere mail und die senden wir jetzt message alles klar ich muss mich noch authentifizieren"}, {"id": 512, "start": 3594.88, "end": 3609.88, "text": "smtp client authenticate string username kackel fakemail gmx.de und password secrets password"}, {"id": 513, "start": 3609.88, "end": 3617.4, "text": "ok dann schauen wir mal ob das senden jetzt funktioniert ran also wenn es ohne fehlermeldung"}, {"id": 514, "start": 3617.4, "end": 3624.64, "text": "durchläuft sollte das senden funktioniert haben und ich habe die ich habe die ad ausgegeben"}, {"id": 515, "start": 3624.64, "end": 3650.4, "text": "natürlich sehr sehr schlau gewesen leute so credentials invalid"}, {"id": 516, "start": 3650.4, "end": 3668.2, "text": "auch sitz hier invalid alter nerv nicht gmx was fehlgeschrei langer zugriff hallo lull"}, {"id": 517, "start": 3668.2, "end": 3673.08, "text": "kackel sie haben kürzlich versucht ihr gmx postfach in ein email programm wie zum beispiel"}, {"id": 518, "start": 3673.08, "end": 3680.16, "text": "autokolle die vorenstehende meld moment was es ist mtp und ein map ist deaktiviert sehe"}, {"id": 519, "start": 3680.16, "end": 3706.16, "text": "ich das richtig aha die für diese postvereinstellung ok was kbbcdk excellent"}, {"id": 520, "start": 3706.16, "end": 3724.12, "text": "ok sehr schön also sehr nice jetzt gucken wir mal ob es noch mal funkt ob es jetzt funktioniert"}, {"id": 521, "start": 3724.12, "end": 3748.8, "text": "jetzt hat es funktioniert und ist die email angekommen kackel fakemail net gmx nice attachment"}, {"id": 522, "start": 3748.8, "end": 3754.12, "text": "ist nicht bewusst dass ich dann attachment dran gehauen habe aber ok da lasse ich das"}, {"id": 523, "start": 3754.12, "end": 3759.72, "text": "mit dem lasse ich das mit dem test einfach weg das sollte auch so funktionieren moin"}, {"id": 524, "start": 3759.72, "end": 3768.56, "text": "drachenflieger ok email adresse kommt an alles klar warum muss jetzt so ich muss nicht rein"}, {"id": 525, "start": 3768.56, "end": 3772.24, "text": "rein freiwillige sache weil ich mir gedacht habe das eignet sich wunderbar für den stream"}, {"id": 526, "start": 3772.24, "end": 3778.52, "text": "ok also jetzt weiß ich schon mal wie man emails versendet und jetzt muss ich noch gucken wie"}, {"id": 527, "start": 3778.52, "end": 3787.8, "text": "man emails abruft ok wahrscheinlich ein map kleint wie kriegt man das hier dann raus"}, {"id": 528, "start": 3787.8, "end": 3803.08, "text": "ein map example ein map kleint ein map kleint gleich new ein map kleint vermute ich mal"}, {"id": 529, "start": 3803.08, "end": 3814.88, "text": "ja sehr schön ein map kleint connect ja ok das kann ich mir copy pasten ich kann mir"}, {"id": 530, "start": 3814.88, "end": 3821.84, "text": "beides copy pasten eigentlich ein map kleint so und das ist ein map punkt gmx allerdings"}, {"id": 531, "start": 3821.84, "end": 3835.12, "text": "in den anderen port 993 ok ist klar gmx so wie ruft man jetzt ein map was ab ein map kleint"}, {"id": 532, "start": 3835.12, "end": 3842.88, "text": "in box in box klingt schon mal gut daco xdv lang ist schon verhindert ab so in box klingt"}, {"id": 533, "start": 3842.88, "end": 3859.16, "text": "schon mal gut recent alter wie viel watte wie viel hatten das"}, {"id": 534, "start": 3859.16, "end": 3877.36, "text": "monkeys das hat 100 metoden alter ist ja mal gut hier was to immutable array kommt da am"}, {"id": 535, "start": 3877.36, "end": 3899.24, "text": "ende raus ach da kriegt man die einzelnen messages hier das ist ja auch nicht schlecht"}, {"id": 536, "start": 3899.24, "end": 3905.36, "text": "was bedeutet mail monitor ich will überprüfen und melde sich sende ankommen ok wie muss"}, {"id": 537, "start": 3905.36, "end": 3915.52, "text": "ich wie sagen ok also klein in box open search und dann eine schleife drüber also das vermute"}, {"id": 538, "start": 3915.52, "end": 3921.12, "text": "ich mal muss ich auf jeden fall machen weil sonst nicht funktionieren wird in box open"}, {"id": 539, "start": 3921.12, "end": 3940.16, "text": "folder access read only ja meinetwegen ok subject machen wir mal mein bahn hier weg"}, {"id": 540, "start": 3940.16, "end": 3945.8, "text": "gucken wir mal ob das ein map zeug funktioniert also ein map oder kann ich hier gleich select"}, {"id": 541, "start": 3945.8, "end": 3959.6, "text": "machen ach so das brauche ich gar nicht lull einfach so machen ja mails ok for each mail"}, {"id": 542, "start": 3959.6, "end": 3967.64, "text": "in mails was innumerables subject quatsch ich will die message komplett haben subject"}, {"id": 543, "start": 3967.64, "end": 3976.4, "text": "ja doch ist ok er gibt zwar von der benahmung her keinen sinn aber ich will mal überprüfen"}, {"id": 544, "start": 3976.4, "end": 3981.0, "text": "so jetzt sollte ich die ganzen dummen emails von euch auch bekommen wenn alles funktioniert"}, {"id": 545, "start": 3981.0, "end": 3986.76, "text": "tatsächlich hier guck mal die leute haben ich ihr habt mich zwar zu sonst was angemeldet"}, {"id": 546, "start": 3986.76, "end": 4000.16, "text": "aber es funktioniert kackel mail und uid ist hinten dran wieso machst du die leerzeichen"}, {"id": 547, "start": 4000.16, "end": 4017.88, "text": "vor die klammer wo habe ich leerzeichen vor der klammer"}, {"id": 548, "start": 4017.88, "end": 4034.56, "text": "das im github archiv was 38 und 34 ach da ja ne das soll nicht das soll tatsächlich"}, {"id": 549, "start": 4034.56, "end": 4047.44, "text": "nicht sein das da weiß ich nicht warum die das machen kann ich nicht sagen das ist nicht"}, {"id": 550, "start": 4047.44, "end": 4057.4, "text": "von mir das ist die die die hilfe seite für die library warum die das machen keine ahnung"}, {"id": 551, "start": 4057.4, "end": 4062.76, "text": "es scheint das scheint system zu haben bei denen vielleicht gefällt ihm das kann jeder"}, {"id": 552, "start": 4062.76, "end": 4067.04, "text": "machen wie er will also ich finde es jetzt auch nicht gerade toll so also das funktioniert"}, {"id": 553, "start": 4067.04, "end": 4075.24, "text": "schon einmal wir können emails abrufen ich bin begeistert elite partner sehr gut weiß"}, {"id": 554, "start": 4075.24, "end": 4081.4, "text": "ja bescheid chat wie ist das alle zehn minuten verliebt sich ein single wenn man das mal"}, {"id": 555, "start": 4081.4, "end": 4085.44, "text": "ausrechnet wie viele leute bei elite partner wahrscheinlich sind es alle zehn minuten"}, {"id": 556, "start": 4085.44, "end": 4092.76, "text": "ganz schön wenig da wartest du wahrscheinlich rein rechnerisch 800 jahre drauf bis ihr das"}, {"id": 557, "start": 4092.76, "end": 4102.2, "text": "was bringt also zumindest das funktioniert schon mal und jetzt kann man natürlich noch"}, {"id": 558, "start": 4102.2, "end": 4120.4, "text": "filtern subject wir machen das einfach anders wehr message subject starts with was haben"}, {"id": 559, "start": 4120.4, "end": 4137.24, "text": "wir hier kackel mail select ja wobei brauche ich eigentlich gar nicht alles gut mails mail"}, {"id": 560, "start": 4137.24, "end": 4152.76, "text": "subject tweet von golang schon gesehen ne haben die denn getweetet programming language"}, {"id": 561, "start": 4152.76, "end": 4171.76, "text": "ja und weiter wurde wurde der account gehackt oder was möchten sie uns sagen"}, {"id": 562, "start": 4171.76, "end": 4190.52, "text": "max spielst du schon da auf ihnen ne es ist ja kann auch alpha test und alles fliegt weg"}, {"id": 563, "start": 4190.52, "end": 4195.68, "text": "ich hatte kein bock die also ich habe mir den char erstellt zwei charts als die aufgemacht"}, {"id": 564, "start": 4195.68, "end": 4201.72, "text": "haben alpha test aber ich weiß wie sieht die pop wie sieht denn aktuell überhaupt noch"}, {"id": 565, "start": 4201.72, "end": 4214.84, "text": "die spielerzahlen aus bringt das was da was los guck mal was der kanzler getweetet hat"}, {"id": 566, "start": 4214.84, "end": 4233.32, "text": "ok ne ja was hat er getweetet ok chat er hat getweetet gar nix hat er getweetet der 25 august"}, {"id": 567, "start": 4233.32, "end": 4242.0, "text": "zuletzt was getweetet wieviel spielen denn abends immer so amorphium wieviel sind immer"}, {"id": 568, "start": 4242.0, "end": 4251.64, "text": "so aktiv also eigentlich also dass da gut ist müssen es eigentlich um die mindestens"}, {"id": 569, "start": 4251.64, "end": 4269.72, "text": "tausend sein was aber auch frisch als halt immer so ein ding ist so also wo sind wir"}, {"id": 570, "start": 4269.72, "end": 4280.96, "text": "stehen geblieben das funktioniert wunderbar was jetzt oh internal server error what the"}, {"id": 571, "start": 4280.96, "end": 4300.08, "text": "fuck intern haben haben die meine email gesperrt alter leute zu was meldet ihr mich da alles"}, {"id": 572, "start": 4300.08, "end": 4320.48, "text": "an monka es"}, {"id": 573, "start": 4320.48, "end": 4332.92, "text": "darum internal server error ach jetzt gehts wieder ich glaube ich habe einfach zu oft"}, {"id": 574, "start": 4332.92, "end": 4349.6, "text": "ich glaube ich habe das ganze zu oft ausgeführt so am ende bin ich wahrscheinlich mit dieser"}, {"id": 575, "start": 4349.6, "end": 4354.76, "text": "email adresse wirklich angemeldet den den afd infobrief haben wir schon die beate den"}, {"id": 576, "start": 4354.76, "end": 4365.68, "text": "beate use newsletter alles alles alles dabei hier frankfurter zeitung newsletter wer liest"}, {"id": 577, "start": 4365.68, "end": 4375.04, "text": "noch zeitung zu porno wurde wahrscheinlich mit der email adresse auch schon angemeldet"}, {"id": 578, "start": 4375.04, "end": 4386.8, "text": "aber macht euch nix draus ich werde die email adresse eh löschen am ende des streams also"}, {"id": 579, "start": 4386.8, "end": 4391.36, "text": "machen wir mal weiter so also ich weiß jetzt wie ich emails sende und ich weiß jetzt wie"}, {"id": 580, "start": 4391.36, "end": 4398.64, "text": "ich emails empfange dann checken wir doch mal ob ich eine email senden kann und dann"}, {"id": 581, "start": 4398.64, "end": 4409.88, "text": "warte ich mal 15 sekunden und dann müsste ich die email ja eigentlich finden so das"}, {"id": 582, "start": 4409.88, "end": 4415.84, "text": "probieren wir mal aus soweit soweit von der theorie wenn das funktioniert können wir"}, {"id": 583, "start": 4415.84, "end": 4423.84, "text": "mit der eigentlichen sache weitermachen wait task was das task delay keine ahnung 15 sekunden"}, {"id": 584, "start": 4423.84, "end": 4428.32, "text": "geben wir immer zeit dass die email ankommt und danach löschen wir alle mails leute ich"}, {"id": 585, "start": 4428.32, "end": 4435.68, "text": "werde es gleich alle mails löschen von euch immer automatisch nach dem ausführen 15 sekunden"}, {"id": 586, "start": 4435.68, "end": 4449.12, "text": "warten jetzt wenn ich richtig gezählt habe oder wahrscheinlich habe ich nicht richtig"}, {"id": 587, "start": 4449.12, "end": 4456.24, "text": "gezählt ja hat funktioniert guckt kackel mail mit der uid also email senden email checken"}, {"id": 588, "start": 4456.24, "end": 4461.8, "text": "funktioniert das heißt was wir jetzt machen werden ist folgendes zum schluss wir werden"}, {"id": 589, "start": 4461.8, "end": 4485.68, "text": "sagen alle mails also for each war mail in imap client inbox wie löscht man mails mail"}, {"id": 590, "start": 4485.68, "end": 4491.64, "text": "kit delete mail weiß nicht wie das funktioniert make it delete single mail message single"}, {"id": 591, "start": 4491.64, "end": 4508.28, "text": "mails jawohl erzählt mir wie es geht klein in box et flex message deleted ok also hoffentlich"}, {"id": 592, "start": 4508.28, "end": 4519.96, "text": "passt das hier imap in box et flex gibt es auch nur et flac et flex aber wie funktioniert"}, {"id": 593, "start": 4519.96, "end": 4539.96, "text": "das jetzt mail id uid wie kriege ich denn die id von der mail gar nicht oder oder"}, {"id": 594, "start": 4539.96, "end": 4554.2, "text": "ist message id ist die ne ne das was anderes wie krieg ich denn die id ach hier search query"}, {"id": 595, "start": 4554.2, "end": 4561.04, "text": "all ok das jetzt schon massiv umständlich aber ok ich copy paste mir einfach mal den"}, {"id": 596, "start": 4561.04, "end": 4574.04, "text": "graben von ihm hier imap client search warum macht er da immer so ein lehrzeichen ich verstehe"}, {"id": 597, "start": 4574.04, "end": 4580.36, "text": "es denn weil wir können das wir können das einfacher machen hier so ok imap ist halt"}, {"id": 598, "start": 4580.36, "end": 4596.64, "text": "mal wieder umständlich hoch 10 uid uid und jetzt message flex deleted silent ja meinetwegen"}, {"id": 599, "start": 4596.64, "end": 4607.16, "text": "alles silent wunderbar und jetzt was muss man machen zum mail löschen in box was expungi"}, {"id": 600, "start": 4607.16, "end": 4617.8, "text": "expunge hat jemand dieses wort schon mal gehört ich das also was heißt das überhaupt löschen"}, {"id": 601, "start": 4617.8, "end": 4639.44, "text": "was expunge wie spricht man das überhaupt aus achso ux ux pung delete is to three hat"}, {"id": 602, "start": 4639.44, "end": 4654.04, "text": "das kann ich jeder ja das geht nicht so einfach imap client in box ex alter was kram gut dafür"}, {"id": 603, "start": 4654.04, "end": 4657.96, "text": "muss ich das ding allerdings nicht read öffnen sondern read write öffnen gehe ich mal von"}, {"id": 604, "start": 4657.96, "end": 4676.92, "text": "aus also ein bisschen status meldung reinschreiben send mail waiting delete all mails so auf gehts"}, {"id": 605, "start": 4676.92, "end": 4684.12, "text": "mail senden gucken ob es da ist und dann alles löschen danach ist nicht das ungewöhnliche"}, {"id": 606, "start": 4684.12, "end": 4689.44, "text": "wort habe ich schon nie gehört das hört sich an wie eine attacke aus einem anime ja tatsächlich"}, {"id": 607, "start": 4689.44, "end": 4694.6, "text": "hat was aber da muss noch ein bisschen was dazu ein paar deutsche worter noch dabei die"}, {"id": 608, "start": 4694.6, "end": 4699.08, "text": "mögen aus irgendwelchen gründen deutsche namen allein sei möglichst lang ok die liet"}, {"id": 609, "start": 4699.08, "end": 4704.04, "text": "all mails gucken wir mal ob er alle mails deleted hat dass ich mir nicht mal angucken"}, {"id": 610, "start": 4704.04, "end": 4710.12, "text": "muss was er mir sonst noch hier alles schickt alles weg hat funktioniert und ihm gelöscht"}, {"id": 611, "start": 4710.12, "end": 4718.8, "text": "im spam verdacht ist ganz viel was ok ich weiß nicht zu was er mich da angemeldet hat"}, {"id": 612, "start": 4718.8, "end": 4730.72, "text": "aber es egal c++ meeting sehr schön aber jeder twitch dein twitch bestätigungscode"}, {"id": 613, "start": 4730.72, "end": 4734.32, "text": "ah das ist gut das ist gut dass man das in der email sieht das heißt es kann sich jetzt"}, {"id": 614, "start": 4734.32, "end": 4740.44, "text": "irgendjemanden twitch account erstellen mit der email adresse weil weil und so macht es"}, {"id": 615, "start": 4740.44, "end": 4758.76, "text": "mir egal die email adresse ist eh weg nach der nach dem stream"}, {"id": 616, "start": 4758.76, "end": 4765.8, "text": "ja so könnte das tatsächlich heißen ultrahass expansions wobei wobei die aussprache moment"}, {"id": 617, "start": 4765.8, "end": 4771.2, "text": "wir müssen was testen leute wie ist die wie ist die anime aussprache von diesem wort"}, {"id": 618, "start": 4771.2, "end": 4776.2, "text": "dass das testen wir jetzt mal ich habe hier mein text text to speech der dann so sachen"}, {"id": 619, "start": 4776.2, "end": 4783.68, "text": "aussprechen kann wie zum beispiel ok schauen wir mal ich habe vergessen was ich machen"}, {"id": 620, "start": 4783.68, "end": 4792.44, "text": "muss dass man text to speech nicht nicht krascht das seht sie so wie hoffentlich krascht es"}, {"id": 621, "start": 4792.44, "end": 4802.36, "text": "nicht nicht kraschen please also guck mal wie sprich wie würde das anime technisch"}, {"id": 622, "start": 4802.36, "end": 4811.52, "text": "ausgesprochen werden ziemlich ziemlich genauso stelle ich mir vor wird es da ausgesprochen"}, {"id": 623, "start": 4811.52, "end": 4836.44, "text": "das klingt also das klingt ziemlich ok ok ich übernehme mal was von euch genau so würde"}, {"id": 624, "start": 4836.44, "end": 4845.96, "text": "das klingt also das ist tatsächlich sehr original ja genau so stelle ich mir das tatsächlich"}, {"id": 625, "start": 4845.96, "end": 4856.24, "text": "vor würde sich das anhören du verstehst da ja nix sehr schön gut also so viel so viel"}, {"id": 626, "start": 4856.24, "end": 4862.36, "text": "flash bang also das tut das tut schon mal wir können schon mal emails abfragen emails"}, {"id": 627, "start": 4862.36, "end": 4868.84, "text": "löschen und emails checken ob die id drinne ist das ist schon mal nice nachdem die basics"}, {"id": 628, "start": 4868.84, "end": 4878.28, "text": "funktionieren können wir das ganze jetzt ja auch ein bisschen schöner machen"}, {"id": 629, "start": 4878.28, "end": 4892.76, "text": "also das funktioniert alles wieder alle mails gelöscht wenn du geh mal auf github trend"}, {"id": 630, "start": 4892.76, "end": 4904.4, "text": "was github trend soll discontinued werden was anscheinend nicht nichts discontinued"}, {"id": 631, "start": 4904.4, "end": 4914.84, "text": "hätte mich auch sehr gewundert warum sollte github trend discontinued werden was da gucke"}, {"id": 632, "start": 4914.84, "end": 4925.52, "text": "ich total oft rein alter warum streichen die immer irgendwelche sinnvollen features"}, {"id": 633, "start": 4925.52, "end": 4930.2, "text": "warum streichen die immer sinnvolle features ganz ehrlich ich persönlich benutze echt gerne"}, {"id": 634, "start": 4930.2, "end": 4937.48, "text": "das trending tab weil ich habe ich habe über das trend ich mache das mal in einem anonymen"}, {"id": 635, "start": 4937.48, "end": 4941.64, "text": "tab auch vielleicht gibt vielleicht muss ich eingeloggt sein vielleicht muss ich vielleicht"}, {"id": 636, "start": 4941.64, "end": 4949.28, "text": "muss ich eingeloggt sein aber ich habe schon total viel zeug gefunden über über das"}, {"id": 637, "start": 4949.28, "end": 4953.12, "text": "trending vor allem weil du hier auf language stellen kannst das findet ihr mal besonders"}, {"id": 638, "start": 4953.12, "end": 4959.48, "text": "spannend na du stellst auf language und kannst gucken was denn was denn für deine ja bevor"}, {"id": 639, "start": 4959.48, "end": 4964.16, "text": "zu was denn so aktuelles trend ich finde dass ich finde das wirklich eine super sache mit"}, {"id": 640, "start": 4964.16, "end": 4967.52, "text": "dem trending tab warum löscht man so was was ist denn das für ein schwachsinn schon"}, {"id": 641, "start": 4967.52, "end": 4977.44, "text": "wieder ich guck mal jetzt haben wir zum beispiel was gelernt dass es einen standard gibt ich"}, {"id": 642, "start": 4977.44, "end": 4990.28, "text": "weiß nicht mal was das sein soll hier oft hier fast health care interoperability resources"}, {"id": 643, "start": 4990.28, "end": 4996.72, "text": "er ja ok alles klar ja warum maui trendet kann ich nicht verstehen also mit den krebs"}, {"id": 644, "start": 4996.72, "end": 5006.24, "text": "verwendet dem ist echt nicht mehr zu helfen guck china chinesen zeug trendet benchmark"}, {"id": 645, "start": 5006.24, "end": 5014.64, "text": "dotnet super library ja kommunikations ok gehts da gehts da um trending tab i got the"}, {"id": 646, "start": 5014.64, "end": 5026.84, "text": "message ja also jeden tag ist vielleicht jeden tag ist vielleicht ein bisschen übertrieben"}, {"id": 647, "start": 5026.84, "end": 5046.12, "text": "aber ich gucke da mehrfach die woche rein was trendet oh nein jetzt sind die kpop spammer"}, {"id": 648, "start": 5046.12, "end": 5073.76, "text": "auch hier schon am start ja die haben recht also es also wenn man das trending tab abschafft"}, {"id": 649, "start": 5073.76, "end": 5081.0, "text": "wäre wirklich richtig dumm maui nicht die erhoffte erlösung für dotnet xamarin war"}, {"id": 650, "start": 5081.0, "end": 5085.28, "text": "nicht die erhoffte lösung und maui hat glaube ich nicht niemand als erlösung als ui framework"}, {"id": 651, "start": 5085.28, "end": 5093.68, "text": "erhofft ja ich habe dankeschön für den rate field ich habe auch schon einige sachen darüber"}, {"id": 652, "start": 5093.68, "end": 5097.92, "text": "gefunden die ich sehr spannend finde also es ist total hängen geblieben wenn die sagen"}, {"id": 653, "start": 5097.92, "end": 5106.76, "text": "würden wir discontinuen github trends das wäre einfach nur mega bescheuert also ich"}, {"id": 654, "start": 5106.76, "end": 5114.0, "text": "gucke immer hier explore trending und alles mögliche von daily bis sonst wie ich gucke"}, {"id": 655, "start": 5114.0, "end": 5118.2, "text": "die sprachen durch ich finde es interessant zu sehen was allgemein trendet weil ich habe"}, {"id": 656, "start": 5118.2, "end": 5126.32, "text": "keine ahnung was das ist habe ich ja nie gehört ja gerade sowas nach sowas suchst du doch normalerweise"}, {"id": 657, "start": 5126.32, "end": 5130.36, "text": "nicht das das findest du jetzt hier in sponsors guckst dir an und denkst dir ach so eigentlich"}, {"id": 658, "start": 5130.36, "end": 5141.52, "text": "ganz cool ich verstehe das nicht das ist ein bisschen wie mit dem dislike button also mittlerweile"}, {"id": 659, "start": 5141.52, "end": 5146.2, "text": "werden die funktionen teilweise also für mich essenzielle core funktionalität eingeschränkt"}, {"id": 660, "start": 5146.2, "end": 5151.32, "text": "aus aus ja weiß ich besseren monetarisierungsgründen was anderes ist es ja übrigens bei github"}, {"id": 661, "start": 5151.32, "end": 5161.8, "text": "wahrscheinlich auch nicht bessere monetarisierungsgründe unterm strich das hat die welt gebraucht wir"}, {"id": 662, "start": 5161.8, "end": 5166.04, "text": "brauchen nicht wpf 2 wir brauchen ein ordentliches avalonia wenn schon ich meine ich bin kein"}, {"id": 663, "start": 5166.04, "end": 5173.32, "text": "samuel fan muss ich sagen samuel samuel wie immer das ausspricht aber alles ist besser als"}, {"id": 664, "start": 5173.32, "end": 5182.2, "text": "samuel und maui so ich habe gesagt wir können das ganz jetzt noch ein bisschen ordentlich machen also"}, {"id": 665, "start": 5182.2, "end": 5186.92, "text": "lasst mal überlegen wie würde man das dann machen also die basis funktionalität wissen wir"}, {"id": 666, "start": 5186.92, "end": 5192.64, "text": "dass sie funktioniert email schicken emails emails empfangen also wir machen mal sowas hier public"}, {"id": 667, "start": 5192.64, "end": 5204.04, "text": "static class das irgendwie sowas wie keine mon mail sender da gibt es nur eine methode drin public"}, {"id": 668, "start": 5204.04, "end": 5216.6, "text": "static cool tricent so da brauchen wir string ne provokant zwing da brauchen wir mail box"}, {"id": 669, "start": 5216.6, "end": 5227.76, "text": "address zu der die email adresse sind ja immer gleich die ups die die messages sind ja immer"}, {"id": 670, "start": 5227.76, "end": 5237.72, "text": "gleich also tricent so da machen wir dann tricatch block drumherum und return falls wenn der kram"}, {"id": 671, "start": 5237.72, "end": 5245.56, "text": "kann man das diskern wenn der kram aus irgendwelchen gründen nicht klappt mit dem senden und wir"}, {"id": 672, "start": 5245.56, "end": 5255.16, "text": "return true und senden die mail wenn alles funktioniert solltest du den klein nicht noch"}, {"id": 673, "start": 5255.16, "end": 5260.28, "text": "disconnecten mache ich das nicht ja du hast recht also ich vermute aber mal dass ich das nicht"}, {"id": 674, "start": 5260.28, "end": 5265.92, "text": "machen muss weil wir gucken mal nach ob ich das machen muss oder ob das überflüssig ist weil"}, {"id": 675, "start": 5265.92, "end": 5279.48, "text": "der wahrscheinlich disposable implementiert hätte ich hätte ich gedacht ja das post"}, {"id": 676, "start": 5279.48, "end": 5295.92, "text": "dispose alter wo ist es denn jetzt bescheuert muss doch irgendwo sein"}, {"id": 677, "start": 5295.92, "end": 5318.4, "text": "wo ist es aber irgendwie kann man irgendwie suchen nach groß und kleinschreiber"}, {"id": 678, "start": 5325.92, "end": 5328.64, "text": "ist es doch"}, {"id": 679, "start": 5328.64, "end": 5340.16, "text": "versuchst du eigentlich nach so was wie solle zu programmieren ja die sachen davon die sinnvoll"}, {"id": 680, "start": 5340.16, "end": 5346.16, "text": "sind schon in dem kontext warum nicht ja zum beispiel dass eine sache als eine klasse nichts"}, {"id": 681, "start": 5346.16, "end": 5350.88, "text": "von der anderen wissen soll dass eine klasse nur eine sache machen soll das hat schon durchaus"}, {"id": 682, "start": 5350.88, "end": 5356.72, "text": "aus seinen sinn ich kann dir aber gerne ich kann dir aber aus dem kopf nicht sagen was die einzelnen"}, {"id": 683, "start": 5356.72, "end": 5370.08, "text": "punkte von soll es sind also single single responsibility open close oder sowas ich habe"}, {"id": 684, "start": 5370.08, "end": 5376.4, "text": "keine ahnung was die letzten drei was sie noch heißen ja ja ja da also da wo es sinnvoll ist"}, {"id": 685, "start": 5376.4, "end": 5385.28, "text": "schon dass das hat das hat ja seinen sinn muss man sagen also der macht kein disconnect"}, {"id": 686, "start": 5385.28, "end": 5390.12, "text": "guck mal der macht kein disconnect also ich muss tatsächlich von hand disconnecten ich"}, {"id": 687, "start": 5390.12, "end": 5401.24, "text": "hätte gedacht der disconnected sich das natürlich bescheuert disconnect unten drunter"}, {"id": 688, "start": 5401.24, "end": 5415.12, "text": "disconnect nach ex ex punch muss ich disconnecten die try send mail 2 dann können wir uns diesen"}, {"id": 689, "start": 5415.12, "end": 5422.84, "text": "camp von hier oben schnappen dass wir das ein bisschen aufräumen bevor das nächste mal also"}, {"id": 690, "start": 5422.84, "end": 5426.76, "text": "wir kriegen heute das garantiert nicht alles hin aber die basis sachen haben wir schon mal"}, {"id": 691, "start": 5426.76, "end": 5430.16, "text": "ausprobiert dass das nächste mal halbwegs ordentlich ist weil so blick ich da blick"}, {"id": 692, "start": 5430.16, "end": 5439.24, "text": "ich da nicht mehr durch ja mal aus kommentieren also im endeffekt machen wir dann so was wie"}, {"id": 693, "start": 5439.24, "end": 5454.72, "text": "mail sender send try send an mailbox address pass sowas hier das ist natürlich ein bisschen"}, {"id": 694, "start": 5454.72, "end": 5459.52, "text": "schöner als dieser ganze rotz auf einmal hast du eine ahnung wie lange du streben wirst ja eine"}, {"id": 695, "start": 5459.52, "end": 5467.04, "text": "stunde noch ungefähr juck das schreibt ich muss mich mal bedanken ich habe dich ja gefragt mit"}, {"id": 696, "start": 5467.04, "end": 5471.16, "text": "welcher sprache ich anfangen soll hab dann angefangen jetzt bin ich richtig trinne heckermans ja so"}, {"id": 697, "start": 5471.16, "end": 5480.04, "text": "muss das sein dazu kann ich sagen macht mir mittlerweile mehr spaß als hartware zu ich bin"}, {"id": 698, "start": 5480.04, "end": 5485.12, "text": "gerade schon ob ich mir mit mit einer c spa oder so und da go weiter machen soll dank auf jeden was"}, {"id": 699, "start": 5485.12, "end": 5491.04, "text": "habe ich dir denn geraten mit was zu anfangen sonst habe ich gesagt mach javascript also das"}, {"id": 700, "start": 5491.04, "end": 5496.32, "text": "ist ja so meine standardsache wenn man nicht weiß was man machen will mach javascript habe"}, {"id": 701, "start": 5496.32, "end": 5507.8, "text": "ich dir auch gesagt mach javascript ja genau das ist gut ja also wenn du eine c styles sprache"}, {"id": 702, "start": 5507.8, "end": 5514.8, "text": "lernst dann mach auf jeden fall sie scharp und fang auf gar keinen fall mit c++ an und c"}, {"id": 703, "start": 5514.8, "end": 5520.4, "text": "selbst ist halt ja gut wenn du hardware zeugs machen willst ist c sicherlich nicht verkehrt"}, {"id": 704, "start": 5520.4, "end": 5525.84, "text": "gerade für arduino in esp ist das halt immer noch das mittel der wahl aber wenn du ordentliche"}, {"id": 705, "start": 5525.84, "end": 5529.24, "text": "anwendung entwickeln willst auch für desktop und so was dann auf jeden fall dort netz die"}, {"id": 706, "start": 5529.24, "end": 5552.88, "text": "scharp damit wird gar nicht mehr c++ anfangen und go ja gut das kannst du das kannst du"}, {"id": 707, "start": 5552.88, "end": 5557.08, "text": "dir im endeffekt aussuchen ich persönlich würde mir als nächstes tatsächlich wenn"}, {"id": 708, "start": 5557.08, "end": 5561.28, "text": "du was anderes machen willst dort net angucken beziehungsweise ist die scharp weil ich finde"}, {"id": 709, "start": 5561.28, "end": 5566.52, "text": "von der sprache her vom umfang her und von den einsatzmöglichkeiten her mit der beste"}, {"id": 710, "start": 5566.52, "end": 5570.16, "text": "kombination die es gibt allerdings go ist auch nicht verkehrt go ist auch eine gute"}, {"id": 711, "start": 5570.16, "end": 5577.16, "text": "sprache zum einsteigen beziehungsweise zum weitermachen gibt es noch ein hetzer stream"}, {"id": 712, "start": 5577.16, "end": 5581.28, "text": "ich habe noch nicht gesprochen mit hetzer beziehungsweise ich weiß gar nicht ob mein"}, {"id": 713, "start": 5581.28, "end": 5588.2, "text": "managers was geschrieben hat oder ob es da schon was neues gibt keine ahnung wahrscheinlich"}, {"id": 714, "start": 5588.2, "end": 5591.76, "text": "hoffe ich mal weil wir müssen es ja noch mal ordentlich bauen von dem was wir das letzte"}, {"id": 715, "start": 5591.76, "end": 5596.32, "text": "mal gemacht haben ich wohne an der grenze zur schweiz denkst du dass ich lieber eine"}, {"id": 716, "start": 5596.32, "end": 5601.68, "text": "fachinformatik ausbilden deutschland drei jahre oder in der schweiz vier also ganz"}, {"id": 717, "start": 5601.68, "end": 5606.44, "text": "ehrlich wenn du nähe von der schweiz wohnst dann gehen die schweiz und kriegt mehr geld"}, {"id": 718, "start": 5606.44, "end": 5623.08, "text": "das ist ja dann das ja premium schweizer gehalt und und deutsche kosten ja ich werde im zuge"}, {"id": 719, "start": 5623.08, "end": 5629.96, "text": "vom informatik im abi java lernen unabhängig davon dass ich es mir auch sonst vorgenommen"}, {"id": 720, "start": 5629.96, "end": 5636.48, "text": "habe nachdem ich arduino in der elfen gehabt habe ja ich persönlich bin ja kein großer"}, {"id": 721, "start": 5636.48, "end": 5648.12, "text": "java fan aber ganz im ernst es ist auch absolut in ordnung kann man machen immer muss nicht"}, {"id": 722, "start": 5648.12, "end": 5666.16, "text": "alles mögen aber ich ich ich mag ja war nicht sonderlich so super super geheime string"}, {"id": 723, "start": 5666.16, "end": 5681.08, "text": "schreiben wir jetzt als rein hier super geheim das kennen nur ich danach kann ich greppen"}, {"id": 724, "start": 5681.08, "end": 5691.8, "text": "später da weiß ich dass ich die mail selbst geschickt habe ja das wundert mich auch dass"}, {"id": 725, "start": 5691.8, "end": 5696.88, "text": "man arduino in der schule lernt das kommt aber wahrscheinlich ganz entscheidend auf"}, {"id": 726, "start": 5696.88, "end": 5703.76, "text": "den lehrer an wenn du da irgendwelche planlose leute hast wie ich die quasi alles feiern"}, {"id": 727, "start": 5703.76, "end": 5714.52, "text": "nur weil die eindrückung stimmt nicht doch stimmt die alles feiern nur weil du in wird"}, {"id": 728, "start": 5714.52, "end": 5722.12, "text": "die schrift an lila machst so ein hat ich in weiß gar nicht wie man das genannt hat"}, {"id": 729, "start": 5722.12, "end": 5727.28, "text": "bei uns in der schule ich glaube it hieß das damals von leuten die keine ahnung haben"}, {"id": 730, "start": 5727.28, "end": 5735.4, "text": "wahnsinn also das war wirklich komplett komplett unsinnig ja du musstest du musstest bei"}, {"id": 731, "start": 5735.4, "end": 5743.28, "text": "diesem typ einfach nur dein powerpoint und wird text lila machen dann hat er gesagt leila"}, {"id": 732, "start": 5743.28, "end": 5749.24, "text": "leila leila leila mag ich oder hast du eine eins gekriegt der war ein bisschen über der"}, {"id": 733, "start": 5749.24, "end": 5761.6, "text": "spur der kerl und ich mein it bestand in der schule bei mir aus powerpoint und wird was"}, {"id": 734, "start": 5761.6, "end": 5772.08, "text": "was ist da los was ist da los chain law warum geht das nicht das ist das ist schlecht wenn"}, {"id": 735, "start": 5772.08, "end": 5778.08, "text": "es nicht geht weil ich gucke beispielsweise auch gerne zum pennen streams und wenn dann"}, {"id": 736, "start": 5778.08, "end": 5793.32, "text": "auf einmal werbung kommt das ist dann richtig oder oder man könnte eigentlich fast schon"}, {"id": 737, "start": 5793.32, "end": 5813.88, "text": "sagen es ist wo habe ich eigentlich mein monka es easy Leute ich kann mich nicht mehr konzentrieren"}, {"id": 738, "start": 5813.88, "end": 5819.96, "text": "ich weiß wir haben nicht viel gemacht aber sie schon spät ich kann mich nicht mehr konzentrieren"}, {"id": 739, "start": 5819.96, "end": 5824.52, "text": "ich muss das andere mal weitermachen wir haben nur wir haben eigentlich nur gecheckt wie"}, {"id": 740, "start": 5824.52, "end": 5833.0, "text": "man e-mails abruf"}, {"id": 741, "start": 5833.0, "end": 5836.6, "text": "das war was wir morgen irgendwann weiter gucken ich kann mich nicht konzentrieren weil es"}, {"id": 742, "start": 5836.6, "end": 5841.92, "text": "zu spät ich habe den ganzen tag schon zeug gebastelt für twitch gibt es einen blokker"}, {"id": 743, "start": 5841.92, "end": 5845.16, "text": "ne ich muss noch nicht ich muss auch nicht gleich oft aber wir können ein bisschen können"}, {"id": 744, "start": 5845.16, "end": 5850.2, "text": "ein bisschen schwätzen noch ne ne es gibt es gibt uplog origin uplog origin macht für"}, {"id": 745, "start": 5850.2, "end": 5861.6, "text": "die meisten seiten mein twitch ist so on of twitch geht mal mal geht es nicht"}, {"id": 746, "start": 5861.6, "end": 5869.24, "text": "ok wie löst man den account wieder hat irgendjemand eine ahnung wie man sein gmx konto löscht"}, {"id": 747, "start": 5869.24, "end": 5883.4, "text": "e-mails schreiben gmx delete my account deleting an account"}, {"id": 748, "start": 5883.4, "end": 5901.88, "text": "my account ok"}, {"id": 749, "start": 5901.88, "end": 5914.2, "text": "wo home home"}, {"id": 750, "start": 5914.2, "end": 5926.0, "text": "mein account account löschen account löschen ihr password"}, {"id": 751, "start": 5926.0, "end": 5933.28, "text": "ok leute ich copy ich copy paste jetzt das password und löscht dann jetzt löschen"}, {"id": 752, "start": 5933.28, "end": 5946.56, "text": "ok kann ich euch auch zeigen wie das password war moment"}, {"id": 753, "start": 5946.56, "end": 5955.64, "text": "ich zeige euch das nicht da kann ich das nächste mal wieder verwenden ich habe tabs offen ja"}, {"id": 754, "start": 5955.64, "end": 5961.2, "text": "ich weiß ich habe gerne ich habe gerne viele tabs offen"}, {"id": 755, "start": 5961.2, "end": 5988.12, "text": "excellent leute wir machen ein andermal weiter ne das password das password enthielt das"}, {"id": 756, "start": 5988.12, "end": 5994.64, "text": "password und dann kam noch was blödes hinten dran weil er hat zufälligerweise grad was"}, {"id": 757, "start": 5994.64, "end": 6002.36, "text": "im chat geschrieben wo ich das password eingegeben habe und das password ist gewesen ist ein"}, {"id": 758, "start": 6002.36, "end": 6018.44, "text": "aber jetzt sage ich nicht was ich weiter geschrieben habe aber nix schlimmes nix ja sowas in der"}, {"id": 759, "start": 6018.44, "end": 6033.48, "text": "richtung steht da ja sowas in der richtung ich kann so ich ok ich copy pastes euch hier"}, {"id": 760, "start": 6033.48, "end": 6041.36, "text": "das das das war das password chain law ist ein three head spammer das ist mir grad so"}, {"id": 761, "start": 6041.36, "end": 6044.96, "text": "eingefallen als ich die e-mail adresse angelegt habe weil er was im chat geschrieben hat"}, {"id": 762, "start": 6044.96, "end": 6058.28, "text": "das ist ein gutes password leute das ist ein wirklich gutes password das ist lang 123456"}, {"id": 763, "start": 6058.28, "end": 6066.72, "text": "wobei warum zähle ich das eigentlich selbst lul lul Sachen selber zählen ich glaube es"}, {"id": 764, "start": 6066.72, "end": 6072.28, "text": "geht los keine sonderzeichen keine zahlen das ist bei der länge doch auch vollkommen"}, {"id": 765, "start": 6072.28, "end": 6083.48, "text": "egal ja echo bam wc 28 zeichen leute da kannst du nur klein buchstaben oder kannst du sogar"}, {"id": 766, "start": 6083.48, "end": 6092.52, "text": "nur zahlen machen das reicht 28 28 stellen 28 stellen kannst du im prinzip dein password"}, {"id": 767, "start": 6092.52, "end": 6099.08, "text": "nur so zusammensetzen kriegt schon keiner raus kannst du vergessen 28 stellen ist heilig"}, {"id": 768, "start": 6099.08, "end": 6112.04, "text": "die secure was hier die weeps sind am start ich seh schon chat gibts noch irgendwas spannendes"}, {"id": 769, "start": 6112.04, "end": 6124.84, "text": "murkser ah ist sicher konfirm du ich ganz im ernst ich glaube bei den meisten seiten würde"}, {"id": 770, "start": 6124.84, "end": 6134.64, "text": "es relativ lange dauern bis einer damit in den account reinkommt ja du kannst bei den"}, {"id": 771, "start": 6134.64, "end": 6141.2, "text": "meisten sachen nicht allzu viele requests pro sekunde machen bevor die dich blocken"}, {"id": 772, "start": 6141.2, "end": 6147.28, "text": "und selbst wenn du eine datenbank verwendest mit bekannten password dann wird das wahrscheinlich"}, {"id": 773, "start": 6147.28, "end": 6156.32, "text": "drin stehen wird brauchst du trotzdem eine weile also ja wahrscheinlich bist du damit"}, {"id": 774, "start": 6156.32, "end": 6162.12, "text": "sicherer als die meisten leute die wir wissen noch wir wissen noch als 123456 das verbreiteste"}, {"id": 775, "start": 6162.12, "end": 6174.6, "text": "password ist und wahrscheinlich gefolgt von querz also bei passwörtern ist best practice"}, {"id": 776, "start": 6174.6, "end": 6184.4, "text": "einfach das zu nehmen was alle nehmen meistens nicht so gut ja genau das werden die wenigst"}, {"id": 777, "start": 6184.4, "end": 6190.8, "text": "noch machen 123 wird kaum noch akzeptiert das ist richtig die meisten wollen dass man"}, {"id": 778, "start": 6190.8, "end": 6200.0, "text": "macht 123456 und noch score a oder sowas weil du brauchst sonderzeichnung groß und kleinschreibung"}, {"id": 779, "start": 6200.0, "end": 6206.56, "text": "manchmal muss doch so machen aber ganz ehrlich seitdem ich den password manager verwende"}, {"id": 780, "start": 6206.56, "end": 6212.2, "text": "also jahrelang ja schon immer der gleiche habe ich das problem nicht mehr da lasse ich"}, {"id": 781, "start": 6212.2, "end": 6216.8, "text": "mir dort ein password generieren es kommt höchstens manchmal vor dass mein password"}, {"id": 782, "start": 6216.8, "end": 6222.0, "text": "manager ein password generiert und die seite dann sagt oh nee das password ist zu lang"}, {"id": 783, "start": 6222.0, "end": 6227.44, "text": "oder irgendwie was oder das password enthält kein sonderzeichen wobei das ja absicht ist"}, {"id": 784, "start": 6227.44, "end": 6234.04, "text": "dafür sind die langen aber das ist auch nicht schlecht das sieht aus wie ein beispiel beispiel"}, {"id": 785, "start": 6234.04, "end": 6240.12, "text": "installation wo man aus dem tutorial das password raus kopiert hat ich benutze key pass seit"}, {"id": 786, "start": 6240.12, "end": 6250.4, "text": "ewigkeiten das da ja last pass wurde gehackerment allerdings haben sie gesagt es hatte keinen"}, {"id": 787, "start": 6250.4, "end": 6260.4, "text": "einfluss auf die passwörter das finde ich gut das kommt rein keck keck alu add to channel"}, {"id": 788, "start": 6260.4, "end": 6270.16, "text": "bem ist drinnen leute ich habe es hinzugefügt ich aktualisieren mal kurz keck alu wie geht"}, {"id": 789, "start": 6270.16, "end": 6278.72, "text": "nicht ach nee man schreibt es alles groß man schreibt also keck alu ne hat noch nicht"}, {"id": 790, "start": 6278.72, "end": 6283.44, "text": "aktualisiert leute aber ich habe es hin ich habe es hinzugefügt keck alu geht noch nicht"}, {"id": 791, "start": 6283.44, "end": 6289.56, "text": "jetzt bei euch bei mir jetzt nicht ich habe es hinzugefügt bald bald gibt es keck alu"}, {"id": 792, "start": 6289.56, "end": 6297.92, "text": "eine minuten cdn update aber ich finde keck alu so nice das nehme ich das nehme ich mit"}, {"id": 793, "start": 6297.92, "end": 6309.32, "text": "auf nicht hat was ich bin der einzige der das hinzugefügt hat dieses bild ist es von"}, {"id": 794, "start": 6309.32, "end": 6333.92, "text": "dir ich finde das mega keck alu anscheinend funktioniert es doch nicht ja mobile hast du"}, {"id": 795, "start": 6333.92, "end": 6339.76, "text": "keine ffz emotes das ist normal wir haben wirklich bei wir haben alle alle keck emotes"}, {"id": 796, "start": 6339.76, "end": 6347.64, "text": "durch ja ich mein guckt mal keck also wir haben also eine wir haben eine wirklich sehr"}, {"id": 797, "start": 6347.64, "end": 6356.96, "text": "breite auswahl an keck emotes und und lull lull emotes haben wir gar nicht so viel aber"}, {"id": 798, "start": 6356.96, "end": 6368.4, "text": "monka haben wir monka haben wir auch einige monka steer ist sehr underused aber gut wozu"}, {"id": 799, "start": 6368.4, "end": 6381.92, "text": "auch ja meistens passt ja nicht zum kontext keck weep im anime style ne wir haben genug"}, {"id": 800, "start": 6381.92, "end": 6400.0, "text": "weep emotes"}, {"id": 801, "start": 6400.0, "end": 6416.76, "text": "um nicht zu vergessen für alle für die weeps out fraktion guck mal allein schon vier davon"}, {"id": 802, "start": 6416.76, "end": 6429.32, "text": "kann man sich nicht alle emotes anzeigen lassen warum nicht ist nicht aktiviert oder was"}, {"id": 803, "start": 6429.32, "end": 6448.16, "text": "oder muss man dafür eingeloggt sein weil die autover vollständigung geht ja das"}, {"id": 804, "start": 6448.16, "end": 6465.06, "text": "ist"}, {"id": 805, "start": 6465.06, "end": 6471.46, "text": "gibt ich werde übrigens nicht ich werde mir rings of power nicht geben habe ich mir vorgenommen"}, {"id": 806, "start": 6471.46, "end": 6481.62, "text": "weil näher ich wollte ich habe mir erst überlegt man könnte der ganzen sache ja mal eine chance"}, {"id": 807, "start": 6481.62, "end": 6491.94, "text": "geben aber mir hat das alles das ganze hin und her darum wirklich nicht grad bock auf die sendung"}, {"id": 808, "start": 6491.94, "end": 6497.22, "text": "gemacht keine ahnung ich juckt mich juckt mich nicht ich ich glaube auch nicht dass amazon das"}, {"id": 809, "start": 6497.22, "end": 6511.58, "text": "sinnvoll hinbekommt also ich bin bei sowas eh schon immer sehr sehr kritisch ja und habe"}, {"id": 810, "start": 6511.58, "end": 6520.18, "text": "was rum zu meckern ich glaube es werde ich mir nicht gucken ich sage einfach nur ich bin ich"}, {"id": 811, "start": 6520.18, "end": 6525.18, "text": "angucken werde weil ich nicht glaube dass das die zeit wert ist was eigentlich auf dieser"}, {"id": 812, "start": 6525.18, "end": 6535.26, "text": "blackout serie gewonnen keine ahnung ich weiß es nicht nein tatsächlich war ich noch nicht weil"}, {"id": 813, "start": 6535.26, "end": 6541.1, "text": "ich korona hatte ich könnte mich da aber eigentlich mal wieder melden weil das ist jetzt ja schon"}, {"id": 814, "start": 6541.1, "end": 6553.1, "text": "eine weile vorbei war kurz in die e-mails gucken was haben wir denn da neu ist drinne"}, {"id": 815, "start": 6557.1, "end": 6563.66, "text": "youtube sponsorship ok hört mal genau zu leute jetzt jetzt kommen die massive youtube sponsorship"}, {"id": 816, "start": 6563.66, "end": 6579.66, "text": "sachen youtube sponsorship mit world class vpn client this is paras vom creator db so und ich"}, {"id": 817, "start": 6579.66, "end": 6589.9, "text": "soll ich soll werbung machen für wie die sagen mir noch nicht mal für welchen vpn anbieter ich"}, {"id": 818, "start": 6589.9, "end": 6596.86, "text": "werbung machen soll die sagen ich soll werbung machen für one of the best vpn companies in"}, {"id": 819, "start": 6596.86, "end": 6624.38, "text": "the industry 60 60 bis 90 sekündige video integration ja aber der sagt nicht mal für welchen"}, {"id": 820, "start": 6624.38, "end": 6632.78, "text": "ok was haben wir sonst noch schönes attention youtubers sponsorship opportunity da ist so"}, {"id": 821, "start": 6632.78, "end": 6643.12, "text": "viel crap dabei immer please contact us please contact us hong kong whatsapp alles klar hong"}, {"id": 822, "start": 6643.12, "end": 6650.66, "text": "kong whatsapp da habe ich ja direkt bock drauf mit ihnen was zu machen die haben echt probleme"}, {"id": 823, "start": 6650.66, "end": 6669.46, "text": "oder sowas in der richtung kooperationsanfrage das ist gut übersetzt leute das ist gut übersetzt"}, {"id": 824, "start": 6669.46, "end": 6684.86, "text": "hallo wir haben mit vielen twitch ankern zusammengearbeitet gradios übersetzt das"}, {"id": 825, "start": 6684.86, "end": 6691.46, "text": "ist ja geil also das muss ich euch vorlesen also das ok moment moment chat mal refreshen"}, {"id": 826, "start": 6691.46, "end": 6695.74, "text": "gucken wir mal ob keck alu funktioniert kann jetzt noch mal ausprobieren geht keck alu jetzt"}, {"id": 827, "start": 6695.74, "end": 6707.5, "text": "keck alu nein geht immer nicht also hört euch hört euch das mal an also jentung zung"}, {"id": 828, "start": 6707.5, "end": 6714.18, "text": "zung stehts in der stehts in der email und da steht hallo ich bin jenny von dumm dumm"}, {"id": 829, "start": 6714.18, "end": 6720.94, "text": "dumm advertising wir haben mit vielen twitch ankern zusammengearbeitet derzeit haben wir"}, {"id": 830, "start": 6720.94, "end": 6728.94, "text": "ein deutsches latex kissen das beworben werden muss sie können dieses produkt den fans zeigen"}, {"id": 831, "start": 6728.94, "end": 6740.42, "text": "und sie während der live übertragung anleiten besorgen wenn sie an diesem kooperationsmodell"}, {"id": 832, "start": 6740.42, "end": 6749.82, "text": "und produkt interessiert sind können sie unter meine kontaktdaten hinzufügen produkt link"}, {"id": 833, "start": 6749.82, "end": 6773.02, "text": "deutschlands kopfkissen nummer eins in vollkommenheit das ist ja war so schlecht ein latex kissen"}, {"id": 834, "start": 6773.02, "end": 6784.54, "text": "was"}, {"id": 835, "start": 6784.54, "end": 6792.46, "text": "ich bin mir da auch nicht so sicher nein nein das da das da die meint die mein tatsächlich"}, {"id": 836, "start": 6792.46, "end": 6797.42, "text": "nicht nicht ich frage wenn müsste sie eigentlich man müsste eigentlich ganz doof zurückfragen"}, {"id": 837, "start": 6797.42, "end": 6803.02, "text": "was sie davon meint und dann warten wie verwirrend die antwort ist weil ich mein wenn die wenn"}, {"id": 838, "start": 6803.02, "end": 6807.98, "text": "die ursprüngliche anfrage schon wir ist dann ist die antwort noch wirer wurde der art eigentlich"}, {"id": 839, "start": 6807.98, "end": 6816.1, "text": "auch von krabb geprägt nö warum sollte warum sollte es also ich habe gar keinen prog krabb"}, {"id": 840, "start": 6816.1, "end": 6829.62, "text": "ich habe buch buch d oder irgendwie sowas ich habe kein grub gibt kein grub bei mir warum"}, {"id": 841, "start": 6829.62, "end": 6846.22, "text": "warum was was was war da krabb probt mein art stillungsinstallation ok warum"}, {"id": 842, "start": 6846.22, "end": 6861.58, "text": "ok was ist passiert"}, {"id": 843, "start": 6861.58, "end": 6876.62, "text": "nee mach ich nicht ach nee fuck"}, {"id": 844, "start": 6891.58, "end": 6910.02, "text": "ist das gefixt mittlerweile"}, {"id": 845, "start": 6910.02, "end": 6938.06, "text": "ok gucken wir mal hat er hat er das verlinkt hier unten irgendwie archback report krabb"}, {"id": 846, "start": 6938.06, "end": 6945.78, "text": "closed haben sie gefixt"}, {"id": 847, "start": 6968.06, "end": 6980.54, "text": "ach guck mal manjaro ist mal wieder betroffen alles klar"}, {"id": 848, "start": 6980.54, "end": 7006.7, "text": "Ok, Banjaro Crabb, Zeus, ja ist das, ist das denn jetzt prinzipiell gefixt?"}, {"id": 849, "start": 7006.7, "end": 7025.98, "text": "Da muss ich mal kurz danach gucken."}, {"id": 850, "start": 7025.98, "end": 7041.54, "text": "Ok anscheinend interessiert das kein Banjaro, wo werden Banjaro Bugs reportet?"}, {"id": 851, "start": 7041.54, "end": 7046.94, "text": "Haben die sowas überhaupt?"}, {"id": 852, "start": 7046.94, "end": 7069.68, "text": "Ne?"}, {"id": 853, "start": 7069.68, "end": 7088.68, "text": "Ja, ich habe kein Bock mein Notebook irgendwie kaputt zu machen auf der Arbeit mit einem"}, {"id": 854, "start": 7088.68, "end": 7111.0, "text": "Update. Okay also das soll man machen danach noch mal okay. Interessant. Einfach nicht"}, {"id": 855, "start": 7111.0, "end": 7129.76, "text": "Upgraden, Pfeifert. Was? Okay ich weiß nicht mal wovon er spricht, aber okay."}, {"id": 856, "start": 7141.0, "end": 7168.32, "text": "Ja das wissen wir jetzt."}, {"id": 857, "start": 7168.32, "end": 7176.4, "text": "Also ich hoffe die fixen das so, dass man keine Zusatzbefehle mehr ausfüllen muss,"}, {"id": 858, "start": 7176.4, "end": 7182.12, "text": "weil wenn ich mal mein Notebook update denke ich doch nicht dran den Kram da irgendwie noch zu"}, {"id": 859, "start": 7182.12, "end": 7200.04, "text": "updaten oder das noch zu machen."}, {"id": 860, "start": 7212.12, "end": 7225.4, "text": "Ja, kein Schimmer. Was das Problem war das habe ich nicht so genau gecheckt wenn ich ehrlich bin."}, {"id": 861, "start": 7225.4, "end": 7236.52, "text": "Irgendwas das Manjaro irgendeinen Crab install macht nach dem Crab update und das macht irgendwie"}, {"id": 862, "start": 7236.52, "end": 7245.44, "text": "kaputt. Man kann auch einfach den kernel per evi shell starten, das kriege ich aber aus dem"}, {"id": 863, "start": 7245.44, "end": 7253.76, "text": "Kopf nicht hin wenn mein Notebook morgens kaputt ist. Müsste ich dann erst mal im Handy gucken wie"}, {"id": 864, "start": 7253.76, "end": 7267.92, "text": "man das macht. Und ich bin mir gar nicht sicher ob ich überhaupt einen Crab auf der Arbeit drauf"}, {"id": 865, "start": 7267.92, "end": 7275.92, "text": "habe. Aber ich glaube schon das ist ja die default bootloader. Also würde ich jetzt einfach mal von"}, {"id": 866, "start": 7275.92, "end": 7292.36, "text": "ausgehen. Ne, will ich nicht. So ist das gut. Das haben wir doch schon mal schon geguckt vor ewig"}, {"id": 867, "start": 7292.36, "end": 7321.56, "text": "kann. Ja Leute, wenn sonst nichts mehr gibt soll ich mal refreshen. Geht das jetzt mittlerweile?"}, {"id": 868, "start": 7321.56, "end": 7329.72, "text": "Wenn sonst nichts mehr ist wie gesagt ich kann mich nicht weiter konzentrieren. Ach hier guck mal"}, {"id": 869, "start": 7329.72, "end": 7342.32, "text": "image funktioniert. Pog hat eine weile gedauert bis es refreshed ist. Alles klar dann sehen wir"}, {"id": 870, "start": 7342.32, "end": 7351.44, "text": "uns morgen chat. Morgen geht's weiter. Bis denn macht's gut. CU."}]}