{"text": "So Leute moin, was ist denn jetzt für eine Keynote, ist Apple oder was? Wann ist denn das? Wann ist denn das? Vielleicht gucken wir uns das auch zusammen an. Jetzt? Also 19 Uhr oder was? Los geht das Event, 19 Uhr. Leute, wir können das nicht zusammen gucken. Also ich kann das Bild nicht einblenden. Wenn ich das Bild einblende, dann ist G-Bade. Es funktioniert nicht. Nee, es funktioniert nicht. Ich kann das nicht einblenden. Dann gibt es, dann gibt es Streik. Dann müsst ihr, müsst ihr mir nebenbei erzählen, was es gerade spannendes gibt. Wie lange geht denn das? Moment. Apple Event. Nee, nee, nee, nee. Ich kann das nicht zeigen. Das geht nicht. Finanzen.net, null, alter. 19 Uhr, was? Gut, es geht wahrscheinlich eineinhalb, zwei Stunden oder so. Ja, wie immer, wie immer. Nee, kann ich nicht gucken. Ich habe gerade überlegt, ob ich, ob ich es mir angucken soll und ein bisschen schwätzen dabei. Da können wir, könnten wir es zusammen gucken. Aber ich kann es nicht zeigen, ja. Zeigt den Stream von jemand anderes. Der ist direkt streamt. Das streamt keiner direkt. Guck, zeig es euch. Das, das, das kannst du nicht streamen. Guck, die, die streamen alle nur sich. Also die, die labern dabei und gucken das auf dem zweiten Bildschirm. Man, das könnte ich auch machen, aber das ist ja pepega. Guck, die streamen alle nur sich. Die re-streamen das Event alle nicht. Aber das ist, das ist doof. Erzählt mir mal nebenbei, was passiert. Da muss man wahrscheinlich eh nicht wirklich zugucken. Das ist, das ist wahrscheinlich jetzt im größten Teil. Was? Das kann ich mir nicht vorstellen, dass der das schaut. Der, der kann den Stream genauso wenig zeigen oder hat irgendeine Spezialgenehmigung. Ist das, ist das das Intro vom Apple Event? Weil, weil dann ist das, dann ist das mega, mega tost. Mal gucken, was mit den Leuten abgeht. Ich mein, vielleicht darf der das auch. Guck, weil die streamen sich alle nicht. Also die streamen alle nicht, event, nicht, nicht das Event, die streamen alle sich. Und ich kann mir auch nicht vorstellen, dass Lyric das streamt. Ich mein, der kann vielleicht das Intro zeigen oder so. Oder ist das wirklich das Intro? Die zeigen doch kein, die zeigen doch kein, ach das ist Werbung, Keckl, das ist Ikea. Ich wollte grad sagen, was ist, was ist mit dem, was ist mit Apple los? Lull. Also ich kann das nicht zeigen, ich, ich, ich sehe es nicht ein. Also ich, ich werde das auch, ich werde ja auch nichts riskieren. Bei Apple weißt du nie. Guckt, dann hat er vielleicht irgendeine, irgendeine Spezialabmachung. Ja, können wir uns Steve Apple angucken? Ne, Tim Apple. Ne, Steve Apple ist ja vorbei. Tim Apple. Können wir uns angucken? Aber gut, manche restreamen anscheinend wirklich. Ich hab keine Ahnung, wie das ist. Apple Event Restream. Also in den vergangenen Jahren waren die sehr, sehr pingelig, was Restreaming angeht. Das werden wir nicht machen. Ne, ich mach das nicht, hat Apple Pech. Die haben es einmal, haben sie es mir gegeben hier mit Strike im Stream. Ich mach das nicht mehr. Ansonsten hätten wir uns wirklich zusammen angucken können jetzt. Ich wusste gar nicht, dass das ist. Ich hab das überhaupt nicht mitgekriegt. Das war wahrscheinlich schon wieder zwei Monate bekannt, oder? Ich wusste es wahrscheinlich wieder als Einziger nicht. Der Eichler, danke schön für den Sub. Okay, Chat, kommen wir mal zum heutigen Stream. Ihr könnt ja nebenbei mir, wer Apple Zeug guckt, kann mir nebenbei erzählen, was es spannendes gibt. Wie finden wir Apple im Stream? Das kann jede Apple finden, wie ihr ihr wollt. Ich war mal kurz Home Assistant Upgrade in der Zwischenzeit, wo ich euch was erzähle. Also ihr wisst ja, ich habe mir ein Fiat Elektroauto gekauft und es gibt keine Home Assistant Integration dafür. Die haben ein paar andere Sachen. Mein Desktop, der ist POG. POG G. Also die haben so Sachen wie BMW zum Beispiel oder Audi haben die glaube ich auch. Ne, Puls Audi. Also die haben ein paar, die guckt hier, die haben ein paar Audio Integrations hier. Reno haben sie. Also wenn ich hier irgendwie so ein Baguette Auto hätte, dann würde das funktionieren. Oder China-Chinesen-Autos oder so Zeug. Also nicht so viele. Aber ein paar offizielle Integrations haben die. Mach mal kurz die Dark-Dings raus. Flashbang. Also ein paar offizielle Integrations haben die für Autos, aber kein Fiat dabei. Wobei Fiat ja auch nicht wirklich Fiat ist, sondern das ist Fiat G Giddens. Das sind mehr, das ist nicht nur Fiat. So, deswegen habe ich mich mal schlau gemacht. Wie gesagt, ich mach mal kurz Home Assistant Upgrade in der Zwischenzeit. Ich habe mich mal schlau gemacht und zwar, wie macht das die App? Also sprich, es gibt von Fiat, da müssen wir uns gleich einen Fake Account anlegen, um das ganze mal auszuprobieren. Login. Also Fiat hat einen Web Service und eine App. Und ich habe heute Mittag mal ein bisschen mitgeschnitten, was die so machen. Und ich muss sagen, es sieht machbar aus, dass sich den ihre API quasi zu zweck empfremden. Wir machen uns jetzt einen Fake Account ohne Auto drinne, weil ich log mich hier bestimmt nicht mit meinen echten Credentials ein und ihr könnt dann mein Auto fernsteuern oder sowas. Das werden wir hier nicht machen. Also ich habe aber eine Response mitgeschnitten bei mir im Browser. Die habe ich anonymisiert. Die habe ich mir hier schon als JSON Datei hinkopiert. Das heißt, wir können die Home Assistant Integration testen. Aber erstmal gucken wir, wie man den Kram Batterie auslesen. Also was du machen kannst, ist, nur mal so zum erklären, warum man das dann machen will. Also, du kannst, Moment, ich mache mal kurz die JSON Datei auf, dann kann ich es euch zeigen. Die Datei heißt keckel.json, da wissen wir schon Bescheid. Also, du kannst so Sachen auslesen, wie zum Beispiel Kilometerzähler. Kilometerstand kannst du auslesen. Du kannst, bisschen laut, oder? Passt eigentlich. Du kannst den Kilometerstand auslesen. Du kannst auslesen, wie viel Reichweite noch in der Batterie drinne ist, wie viel du noch aktuell fahren kannst. Du kannst Reifendruck auslesen, für jeden Reifen einzeln. Da kannst du dann quasi in deinem Dashboard, kannst du dann quasi sowas hier machen, mit einem Auto in der Mitte. Und dann kannst du dann quasi anzeigen, hier, der ist kaputt und die hier sind alle grün und sowas. Also Reifendruck kannst du auslesen, für jedes Rad einzeln. Batterieinfo kannst du auslesen und zwar, nee, Moment, das kommt später. Du kannst die, du kannst die letzten, den letzten Trip, also das letzte, was du gefahren bist, auslesen. Dann hast du quasi Automation History, an welchem Tag du wie viel gefahren bist. Dann kannst du auslesen, weil ich, warum, ich copypaste einfach das Jason rüber und zeig's euch, dann seht ihr's. Moment, Original Format hier. Gehen wir mal hier rüber, Visual Studio Code auf. Müssen wir jetzt eh einen Fake Account machen. Wir müssen, ich erzähl euch gleich, was wir machen. Verschiedene, verschiedene Sachen. Also hier, so, hier haben wir mal das, anonymisiert Jason von meinem Auto aus dem Browser. Also, du siehst zum Beispiel, wie gesagt, Kilometerzähler, das sind nicht 35.000, wie gesagt, anonymisiert, was ich im Browser mitgeschnitten hab von meinem Auto. So, dann siehst du, wie lange du noch fahren kannst, bis die Batterie leer ist. Äh, gut, Ölstand gibt's da natürlich nicht drin. Dann hast du Reifendruck, da siehst du vorne links, vorne rechts. Äh, nee. Rear, Rear ist das, oder? Rear Right, Rear Left, Front, Front Right, Front Left. Also, vorne links, vorne rechts, hinten links, hinten rechts. Also, siehst du den Reifendruck, beziehungsweise du siehst, ob der Reifendruck okay ist. Das ist ja eigentlich das, was sich in der Regel interessiert. Äh, Spannung von der Batterie. Dann kannst du dir den letzten Trip anzeigen lassen, der hat zwei Zähler drinne, der sich immer resetet. Also, du kannst zum Beispiel automatische Statistik erstellen, an welchem Tag du wie viel gefahren bist. Beispielsweise heute, 45 Kilometer. Also, hier um die Ecke. Dann siehst du, wie lange du brauchst, bis du wieder in die Werkstatt fahren musst. Dann siehst du, wie viele Räder du dran hast. Für den Fall der Fälle, dass du das nicht weißt. Ich frag mich allen Ernstes, ob diese Api was... Die haben doch bestimmt Hardcoded 4, oder? Das ist doch Return 4. Die haben doch nicht wirklich einen Sensor, der ausliest, wie viele Räder da dran sind. Das ist Return 4, Hardcoded bei denen auf der Seite. Um an diese Api zu kommen, ist das Problem. Das ist keine offizielle Api. Da musste erst 50 Authentifizierungs- sachen durchmachen. Ich habe es nicht so hundertprozentig gecheckt. Das probieren wir jetzt mal aus. Dann kannst du irgendwie Klimaanlage, Power Usage, blablabla, was sonst noch alles, keine Ahnung. So, jetzt kommen ein paar interessante Sachen für Leute, die ein Elektroauto haben. Der Rest ist ja mehr oder weniger auch für andere verfügbar. Du kannst Charging Schedules einstellen, was wahrscheinlich kein Mensch benutzt. Aber hier siehst du zum Beispiel, der Batterie ist aktuell bei 98%. Er ist angeschlossen... Also es gibt Level 1 Charging und Level 2 Charging. Level 1 Charging ist Kona Charging. 120 Volt. Hell yeah. Also bei uns in Deutschland wirst du eigentlich nur Level 2 Charging an der Stelle sehen. Also er ist angeschlossen an 230 Volt. Plugin Status True, also sprich der Stecker ist drin. Minuten sind das hier. Minuten bis voll geladen. Also irgendwie, keine Ahnung, das ergibt keinen Sinn wie gesagt. Ich habe die Werte ein bisschen anonymisiert. Also sprich der braucht irgendwie noch 10 Stunden oder so bis er voll geladen ist. Er ist aktuell am Laden. Total Range mit dieser Ladung 290 Kilometer und insgesamt 320 Kilometer. Gut, das hier braucht kein Mensch. Das war's. Also sowas kann man da abfragen. Excellent. So, die Sache ist bloß ein bisschen problematischer, erstmal an die Infos zu kommen. Also ich habe mir einmal diese Sachen aus dem Browser gezogen, dass wir heute Home Assistant Integration machen kann. Aber ich muss erstmal das Login auf die Reihe kriegen. Und das Login sieht wirklich extremst pepega aus. Da müssen wir uns gleich mal einen Fiat Fake Account erstellen und versuchen, ob ich das Login hin bekomme. Wie gesagt, das ist richtig pepega. Also ich habe mir das angeguckt. Ich habe einen IO Broker Projekt gefunden, wo man abgucken kann und ich habe EVCC oder so heißt das glaube ich gefunden. Das ist für Leute, die Solarpanels haben. Da kann man auch mal spicken in der API, wie die das gemacht haben. Ich weiß gar nicht mehr, wie der Teil hier ist. Fiat, irgendwas Fiat. Ja. AP. Ja, hier. Ja, so Sachen stehen da drin. Die AP Keys, die haben die irgendwie aus der, aus der, ich wette mit euch die AP Keys haben sie aus der Android App. Die haben die Android App sich, die haben sich das APK geholt von der Android App, haben das dekompiliert und haben sich die AP Keys rausgeholt. Könnte ich wetten, dass es daher kommt. Ist die Musik zu laut oder passt das so? So und das Einloggen müssen wir halt ausprobieren. Also es gibt, es gibt quasi zwei Sachen. Warum habe ich hier so viel Zeug drauf? Also es gibt, es gibt zwei, mehrere Sachen, die wir machen. Erstes, wie geht das Login? Geil. Wie geht das Login auf, auf der Fiat Seite? Per API natürlich, nicht per Browser. Also was ich sehr ungern machen würde, ist einen Browser fernsteuern. Also irgendwie Puppetier oder so und einen Browser oder Selenium oder so was und einen Browser fernsteuern. Da bin ich nicht scharf drauf. Das muss schon irgendwie über diese API von denen gehen und man kann sich das hier auch abgucken, dass das, das funktioniert halbwegs. Ich zeige euch gleich mal grob, wie das funktioniert. Ich habe mir das vorhin schon angeguckt. Richtig pepeger Authentifizierungsprozess, aber hardcore. So und danach brauchen wir MQTT, HA-Integration und ja 1.5 ist dann vier Zeug zu JSON umwandeln für Home Assistant. So in der Richtung. Wir probieren jetzt erstmal das Login hinzukriegen und wenn das Login funktioniert, weil wie gesagt, ich kann es halt nicht mit meinen echten Daten machen, sonst liege ich hier irgendwelche Session Talks und ihr schließt mein Auto auf oder so. Serious Max, das ist ziemlich kacke. Also nicht von dir, aber dass es geht. So alles klar. Na ja, wie gesagt, ich glaube viele machen es halt auch, weil machen das ja nicht absichtlich, die merken es einfach nicht. Auf YouTube lade ich das nicht, das kann man sich als Wort angucken. Ich habe doch hier ein Archiv, da kann man noch alles nachgucken. Ich lade das eh auf GitHub hoch, wenn es denn dann wirklich funktionieren sollte. LTE, beides, beides. Kannst beides machen. Der hat LTE drinne, das ist aber nur für drei Jahre inklusive, aber du kannst auch WLAN machen. Aber ich habe das ehrlich gesagt mit WLAN noch nicht ausprobiert. Also ich habe den Dialog schon gesehen, um ihn mit WLAN zu verbinden, aber ich mache das bisher alles über LTE. Wenn das drei Jahre inklusive ist, werde ich das erstmal ausnutzen. Ach die, ach ich habe sie übrigens letztens installiert noch auf Stream. Guck mal hier vorbildlich wieder, vorbildlich unser Mod. Wollte ich gar nicht machen, das hier. Vorbildlich. Die Musik ist mir zu anstrengend gerade. Leute, ich brauche, ich brauche Massive, ja Relaxing. Exzellent. Ulz sind zu. Was? Ulz sind zu übersichtlich und kurz. Exzellent Ulz. Du kannst aber auch Emoji Ulz machen. Gleich Massive Relaxing mehr jetzt die Musik hier. So alles klar. Nein ich will nicht den Mailcheck Champ aufmachen. Ich will erstmal ein neues Projekt anlegen, weil wir gerade schon dabei sind. Repos, New, ne MK Dear, wie nennen wir das Ding? Pia Champ. So New, Console. Okay, also achso ja ich habe noch eine Sache vergessen, die ich noch nie gemacht habe. Wir machen daraus eine Docker Home Assistant Addon. Habe ich noch nie gemacht, dann kann man das direkt über den Home Assistant App Store installieren. Das wollen wir nicht alles heute machen, das kann ich euch gleich schon sagen. Wahrscheinlich wird mich der Login schon übelst abfacken, aber irgendwann muss man mal anfangen. Und in dem Fall habe ich tatsächlich auch ein gewisses eigenes Interesse daran das fertigzustellen, weil ich brauche das selbst für mein Auto. Für Haxe, ne nicht für Haxe. Haxe sind ja nur Python Integrations, Docker, die Docker Integrations, also sprich ich wollte Home Assistant Update machen, fällt mir nicht gerade auf. Muss ich mal machen, 2, 1, was? 1, 3, 2. Das ist Zappix. 8, 1, 2, 3. Qta, alles klar. Also so war es hier, guck. Addons. So einen Addon gibt das dann. Kannst du dafür dann Fiat installieren. Was hast du alles in meinem Smartphone drin? Du kannst mal bei mir auf... Du kannst mal bei mir auf... Ist es schlimm, dass Safe Search deaktiviert ist? Die Ergebnisse können nackt, teigt, sexuell, inhalt und anstößige Safe Search Einstellungen verwalten. 1, ok. Wir wollen hier keinen Gatschi-Buzz haben. Hier, du kannst mal bei mir auf YouTube gucken im Video. Ich zeige ein bisschen was, wobei, wie gesagt, ich zeige nicht alles und mittlerweile ist natürlich wie immer noch ein bisschen mehr drin, ein paar Sachen sind weggekommen, aber du kannst hier so mal grob gucken, so ein paar Sachen zeige ich hier im Video. Wobei, so viel zeige ich gar nicht. So und dann gibt es noch das Video. Dann gibt es noch das da. Was ist auf meinem Home Server? Da zeige ich auch... Guck, hier zeige ich meinen Home Assistant. Da, das kannst du gucken. Aber wie gesagt auch nicht alles. Nur so ein paar Sachen. Genau, wir müssen mal kurz nebenbei updaten Home Assistant Core installen. Jawoll, gib ihm. Ok, also wir machen uns jetzt mal ein Fiat-Fake-Account. 10-Minute-Mail. Mal gucken, ob die 10-Minute-Mail überhaupt zulassen. Perfekt. Fiat-Uconnect-Login. Einmal Fake-Account-Blitz. Das muss ich wegmachen, die Seite ist zu langsam mit Dark Reader. Äh, registrieren. Ich mach den Account danach auch wieder weg. So, Deutschland. Vorname, Keck. L. E-Mail. Wie? Der Nachname darf nur Buchstaben enthalten, muss mindestens zwei Zeichen lang sein. So, perfekt. So heißen, so glaub normale Leute können schon mal so heißen. So, Passwort. Passwort, muss ich mal kurz eins ausdenken. Ok. Nein, nein, das da nicht. Oh man, ich hab zu viel... Alter, jetzt sind auch noch die Zeichen zu lang. Ich fass es nicht. 1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11. Das ist ja nix. Ok, dann machen wir jetzt nochmal neu. Oh man, geht man nicht auf den Sack. Wo ist denn das Problem? Mein Passwort ist zu lang. Ok, jetzt aber. Ich hoffe jetzt passt das. Ich finde die Längenbegrenzung ist so unsinnig. Ich mein, ok, man könnte sagen 60 Stellen sind vielleicht ein bisschen lang, aber ansonsten, ich mein, warum nicht? Nein, nein, nein, nein, wir lehnen alles ab, alles ab. Alter. Ok, zum Dashboard wechseln. Jetzt kriege ich... Ja, speichern wir mal, vergesse ich eh. Äh, gucken wir uns mal die Bestätigungs-E-Mail an. Konto verifizieren. Excellent. Ihr Konto aktivieren. Accept. Konto ist activated. Leute, Konto activated. Oder auch nicht. Keine Ahnung. Vielleicht braucht das einfach ein bisschen, bis das Konto activated ist. So, und jetzt passt mal auf. Diese Login-Geschichten sind wirklich extrem... Ich dachte schon, ich bin gerade mit meinem Account drin, weil da der 500 da drin steht. So, also dieses Login müssen wir jetzt nachbauen. Und ich sage euch, Leute, das wird abartig. Ähm, kurz nochmal öffnen. Was ist denn mit meinem Rider los? Sag mal, was fehlt? Ich wollte gerade sagen, da fehlt doch was. Wir müssen das nachbauen. Naja, wie willst du dich sonst einloggen, wenn du das Login nicht nachbaust? Kannst du dich nicht einloggen? Das Einzige, was du machen kannst, ist Browser fernsteuern und hoffen, dass alles funktioniert. Aber das will ich nicht. Ich will kein Browser fernsteuern. Nee, hab ich keinen Bock drauf. Machen wir das jetzt so. Okay, und zwar wir können uns das hier abgucken. Leute, es ist richtig, es ist hardcore eklig, diese Authentifizierung barfiert. Also ich zeige euch mal, ich hab's mir im Vorfeld ja schon angeguckt. Also guckt mal was, also erst mal, haben die zig verschiedene Wurls? Also, okay, ich versuch's euch mal so grob zu erklären, wie ich das verstanden hab. Also, es gibt die Fiat API, es gibt das Fiat Authentifizierungsportal, es gibt AWS Authentifizierung und es gibt dann am Ende ein Fiat Access Token, mit dem man die API benutzen kann. Also das ist wirklich ganz, ganz grausam. So, ich versuch euch das mal kurz hier zu zeigen in diesem Beispiel. Oder wir können es auch in dem JavaScript Beispiel, ich zeig's euch mal in dem Go Beispiel, ich finde das ist ein bisschen schöner zu sehen. Also, wo ist hier der Login? Login, okay, also es fängt schon mal folgendermaßen an. Als erstes muss man einen Request machen hier auf die fiat url slash accounts web sdk bootstrap. Allein schon das sollte irgendwie einen kleinen Hinweis darauf geben, dass das nicht die offizielle API ist, die dafür gedacht ist, dass die jeder verwendet. So, dann muss man hier einen Webrequest machen und diese komischen magic Parameter angeben, dass es funktioniert. Mit dem API Key, den sie wahrscheinlich aus der Android App extrahiert haben oder so, keine Ahnung, ich klau mir den hier einfach. So, dann muss man hier noch Zeug angeben, dann bekommt man hier als Antwort von dem Request irgendwelche JSON Objekte. Wenn man dann die Antwort hiervon hat, kann man einen weiteren Request machen auf Accounts login, da muss man dann noch mehr Zeug übergeben, da muss man dann unter anderem auch, also der erste Request ist nur dazu da, soweit ich das verstanden hab, die Cookies zu holen. Also man muss diesen ersten Request nur machen, dass die Cookies initial gefüllt werden, dass man initial paar Cookies bekommt, dass es dann weiter geht danach. Danach macht man den nächsten Request und diesmal mit Login ID, Passwort, API Key, Java, Gedöns, irgendwelche Include, Profile, Data, E-Mails, keine Ahnung, User Info, brauchen wir alles nicht, Login Mode, Standard, Language, DE0DE, Mindblown, kein Schimmer. So und wenn das dann durch ist, dann bekommt man eine ID und diese ID braucht man, das ist die Unique ID für deinen User, mit dem du dich eingeloggt hast, weiterhin ist wichtig, dass du alle Cookies in deinem Cookie Top speicherst, dass es weiter geht danach. Wenn du diesen Request gemacht hast, also das ist in der Theorie, ich hab's ja noch nicht ausprobiert, theoretisch funktioniert das so, so wenn du das gemacht hast, dann machst du einen weiteren Request, das ist wirklich die komplizierteste Authentifizierung, die ich je gesehen hab im Leben. Danach machst du einen weiteren Request um einen JSON Web Token zu erhalten und dann brauchst du deine angeforderten Credentials eingeben, einstellen die du haben willst, wieder den API Key übergeben und immer schön die Cookies verwenden, immer schön die Cookies verwenden vom letzten Request, so und dann bekommt man hier irgendwann ein Objekt zurück, in diesem Objekt ist ein Token und eine Identity ID und dieses Token, wenn ihr, Moment, chat, wenn ihr denkt, wir sind jetzt fertig, jetzt geht's erst richtig los, jetzt geht's erst richtig los mit dem Logging, weil jetzt kommt noch, jetzt kommt noch AWS, jetzt kommt noch AWS Request zu Amazon gleich, also danach bekommt man ein Token und eine Identity ID und die braucht man dann wiederum, um einen Request zu machen zu Amazon, nämlich, das ist ein Amazon AWS Cognito Identity Service Request, den wir jetzt machen muss, dazu braucht man das Token und die Ident ID, die man bekommen hat und dann kann man zu AWS gehen und sich dort dann ein Token abholen, mit dem man, wenn man das dann hat, in Verbindung mit der ID von ganz hier oben auf die rechtlichen APIs zugreifen kann, ich weiß nicht genau, wer sich das ausgetacht hat, bei Fiat, aber so ist es anscheinend und das müssen wir jetzt versuchen, irgendwie nachzubauen, ach ja, zwischendurch müssen wir auch irgendwelche AWS Request, jetzt ist mir die Musik doch ein bisschen zu Relaxing, haben wir nicht noch, haben wir noch irgendwie Top Mario Songs haben wir doch hier immer, ja genau, exzellent, wir müssen nicht C und C Sharp Go Interop machen, wir bauen das, wir bauen das in C Sharp nach, ich habe AWS in.NET noch nie verwendet, wobei das stimmt nicht, doch habe ich, aber nie wirklich um was damit zu bauen und wie das hier funktioniert, hat schon jemand mal AWS Request gesigned mit.NET, ich weiß noch nicht mal, was das überhaupt bedeutet, also ich bin gespannt, ob wir dieses Login hinbekommen, wir können sowohl hier abgucken, wie das funktioniert, wir können aber auch hier abgucken, wie das funktioniert, also wir haben hier zwei Alternativen, wenn es nicht funktioniert, können wir es uns abgucken, einmal in dem IO Broker Plugin oder einmal hier drinnen, ok auf geht's, also wir Copy Paste uns erstmal die ganzen AP Keys, weil die brauchen wir auf jeden Fall, erstmal AP Keys abrippen und die Connect World brauchen wir garantiert auch, so War AP Key, Login AP Key, ok den gibt es anscheinend auch, ja 4 Uhr, also Leute ich habe keine Ahnung, ob das was wird, ich bin wirklich schon happy, wenn ich das hier schaffe nach dieser Schatzsuche mich einzuloggen, LEAKED, OMFG Alter, OMFG, LEAKED, ich bin gerade am überlegen, wie wir das am besten machen, wir machen das mal, wir machen das schonmal richtig 6 Head Object Orientated, jetzt hier, Class, Fiat, Client oder so, bisschen laut, die Musik passt wieder exzellent dazu, ok Fiat Client, also was brauchen wir, wir brauchen auf jeden Fall, ich kann ja mal schreiben, wir brauchen ein String, User, String, Passwort, das ist schon mal relativ klar, User Name und Passwort, so und dann brauchen wir so wie Public, Public Key, Alter, ich kann heute nicht schreiben, Public, was ist, sag mal Public, was genau möchtest du in deinem Home Assistant integrieren, integriert mein Auto, ich will beispielsweise meinen Kilometerzähler sehen, meinen Reifendruck sehen, wie voll die Batterie geladen ist und sowas und es gibt für Fiat keine Integration, deswegen baue ich jetzt für Fiat eine Integration, beziehungsweise für Fiat, das geht Fiat und Jeep und alles was Uconnect verwendet, geht dann hoffentlich, ich kann es halt nur mit meinem Auto ausprobieren, ok Login, sag mal, ok, Void, Login, wir brauchen ein HTTP Client, also auf jeden Fall SYNC, und auch Task, so, also wie machen wir jetzt das Login, jetzt wirds, jetzt wirds spannend, also New Fiat Client, ja Passwort und User, muss ich mal gucken wo ich das verstecke gleich, dass ihr das nicht seht, weil auch wenn das ein Fake Ding ist, ich will es trotzdem nicht im Klartext reinschreiben, kann man, kann man eigentlich den Fiat Account wieder löschen, so doof gefragt, kann man in meinem Profil, meint ihr, meint ihr man kann den Account wieder löschen, wahrscheinlich nicht oder, das ist nicht im Scope, dass man den Account wieder löscht, ne, den Account kann man nicht wieder löschen, man kann sich bei 3000 Social Media Sachen anmelden, aber den Account löschen ist nicht, ist nicht vorgesehen, Account löschen gibt es nicht, sonst hätte ich den Account halt direkt danach wieder gelöscht, aber vielleicht löschen ist ja automatisch wenn man die E-Mail nicht, war der Account deaktivieren echt, wo, ne, ne, deaktivieren, ach hier unten, Alter ist das versteckt, MonkaS, das ist echt, ich mein ernsthaft, what the fuck, Alter wie versteckt ist das, ne kann ich doch nicht, vielleicht, vielleicht nach dem Stream, so, also schauen wir uns mal, wie können wir uns jetzt einloggen, also fangen wir mal an, das erste was wir machen müssen für den Login ist ein Request hier rauf, ich copy paste mir das jetzt einfach mal, ich copy paste mir das jetzt mal hier hin und dann gucken wir mal wie wir das hier nachgebaut bekommen, das da will ich copy paste, so, wie wir das hier nachgebaut bekommen, ich will es nicht eins zu eins nachbauen, ich will bloß wissen wie es funktioniert, also, dann installieren wir mal einen ordentlichen Webclient, ok, fiatclient login, await, tackle, das ist erstmal egal, weil noch, ich will auch mal die Fehlermeldung sehen, ach ne, Moment, da oben, muss ich das hier eingeben, Username, Passwort, so, also, fiatclient login, alles klar, so, wie funktioniert das jetzt, wir brauchen wahrscheinlich, welche URL brauchen wir denn jetzt zum Login, login-URL-URI, login-URI ist das da, ok, login-URL, ok, aber das weg, das brauchen wir wahrscheinlich nicht und das muss auch in die Klasse rein, einfach eine böse DSGVO-Mail schreiben, ja, auf italienisch, wenn schon dann richtig, private, dring, api-key, also, ok, also, login-URL, append, nee, path, nee, add, nee, wie ging das nochmal, was mit pass, append-path-segment ist es genau, accounts-bootstrap, dann brauchen wir cookies, cookies, cookies, nochmal müssen wir uns speichern, es gibt jetzt eine Apple Watch Ultra, na geil, use cookies, cookies, irgendwas mit cookies, und was ist an der so viel geiler, die ist jetzt mega fett oder wie, das ist gut, chat, das ist doch optimal, guck mal, wir können hier ein bisschen basteln und nebenbei kriegen wir sogar noch die News aus dem Apple Stream mit, ok, also, sehe ich das soweit richtig, also, account, dahin müssen wir ein Request machen mit, dass wir uns die Cookies speichern, dann müssen wir glaube ich den api-key noch setzen, ok, set, parameters, api-key, nee, wie wird da geschrieben, ich traue diesem Go Zeug immer nicht, weil Go serialisiert das Chasen und unter der Haube sieht es dann anders aus, wo ist denn hier das login, login, ach du scheiße, javascript please, login, api-key, guck so muss man es nämlich schreiben, api-key, wir brauchen auch nicht diesen api-key, wir brauchen den login api-key, ok, api-key, login api-key, na mal gucken ob das was wird, jetzt bin ich echt gespannt, so, haben wir das jetzt alles, ok, da muss man diesen Crap da unten dran schreiben, wir probieren mal ob es ohne geht, wir gucken mal ob es ohne geht, mal schauen was da jetzt als Request zurückkommt, ich bin mal, ich bin gespannt, was da jetzt raus kommt, ok, machen wir eben keine Ahnung, login-response, get-string, so, schauen wir mal was da als Antwort kommt, bin mal gespannt, run, schauen wir mal, ja auf, ah, ich hab es nicht erwartet, mal gucken was da als Antwort jetzt kommt, ey guck mal, da kommt sogar was, status ok, wie das jetzt einfach funktioniert oder was, da hätt ich jetzt ehrlich gesagt nicht mit gerechnet, aber wir machen jetzt sixhead-time, guck mal, quicktype, io, wir lassen uns daraus jetzt in.net-typ generieren, fivehead, bam, so, da bis jetzt funktioniert es, so machen wir mal hier eine neue Klasse für dieses Fiat, Fiat-Gedöns, Fiat-RP-Response, nennen wir das einfach mal als Base oder so, ja wunderbar, also dann können wir jetzt auch sagen get, Jason Async, Fiat-RP-Response und dann kann ich hier auch drauf zugreifen, ja, nice, wie gut ist der Browser Vivaldi, ich finde ihn eigentlich ganz nice, aber ich verwende ihn selten, klingt jetzt zwar merkwürdig, aber tja, so ist es halt, so und was ist mit diesem ganzen Krämpel hier, SDK, GS Latest und sowas, braucht man das, ich habe einen Fiat 500e gekauft, der steht bei mir im Hof gerade und jetzt will ich ihn meinem Home Assistant einbieten, dass ich dann so Sachen sehe wie Reifendruck, wie viel es geladen ist, ist er gerade eingesteckt, ist er gerade am laden, mach mal lieber Format gleich Jason, sonst kommt noch XML zurück, du hast recht, ja, Set, Query-Parameter, Params, kann man glaube ich noch mehr machen, New, SDK, GS Latest, ich setze diesen ganzen Krämpel hier mal, man weiß ja nie, vielleicht, nicht dass es da nachher nicht geht, man weiß ja, es hat bestimmt seinen Grund warum die das mitgeben, nur das mit dieser Page, ich glaube das mit dieser Page kann man sich echt sparen, so, wo ist denn meine Dump Methode, die brauche ich hier, ich kann mir die auch aus einem anderen Projekt kopieren, wichtigste, wichtigstes Ding was ich überall brauche, wo ist meine Helper, Helper Class, wo ist es, ich muss gerade auf den zweiten Bildschirm gucken, hier, exellent, komisch, ja, man hat immer noch solche Dinge, wie Hedda, tja, musste Fiat fragen, Public, was will der immer mit Public Key, Public, Static, Pipehead Helper Class, die brauche ich, die brauche ich immer, so, wisst ihr was man mit der machen kann, da kann ich jetzt einfach sagen, Login Response, Dump, und dann gibt es mit dem Debug Modus aus, Bäm, zack, und wenn der Reifentuch nicht stimmt, kann man sich dann da mit einem 3D Drucker eine Sirene ausdrucken, naja, du kannst zumindest das in deinem Dashboard anzeigen lassen, dass du siehst, dass der Reifentruck nicht stimmt, du kannst theoretisch sogar Hupen über die API glaube ich, ich glaube man kann Hupen über die API, also falls irgendjemand seine Nachbarn wirklich abfacken will, kann er Hupen automatisieren über sein Home Assistant, was ich nicht empfehlen würde, weil ich könnte mir vorstellen, dass er sogar illegal ist, zu sehr Lärmbelästigung durch Hupen, durch unsinniges, also Hupen verwenden ohne dass man Hupen braucht. Ja, so ungefähr, so also, das erste hat ja schonmal funktioniert, ich hab ne Idee, Leute, ich hab ne Idee, ich bin mir nicht ganz sicher, ob das ne gute Idee ist, wir könnten sowas machen wie hier, war, default, paar rams oder sowas, new, dictionary, string, irgendwie sowas, und, oh nee, wie ist die, wie ist die Syntax dafür, so oder, die ist ein bisschen gewöhnungsbedürftig, so, nee, äh, Moment, wie ist denn die richtige Syntax dafür jetzt, ich, doch, ist doch richtig, oder, nee, da ist ne Klammer zu viel, nee, oh nee, wie funktioniert das nochmal, ähm, ach, da fehlt, da fehlt ein Quote, deswegen geht das nicht, ja, na, okay, jetzt ergibt das, ergibt das tatsächlich, so, ähm, ja, genau, das da, so, SDK, Format, so, dann können wir nämlich den Campbell wahrscheinlich einfach defaultmäßig übergeben, hier plus, also quasi das da, und dann einfach plus die defaultparameter, wenn wir die mal wieder brauchen, ich gehe davon aus, wir brauchen die noch öfters gleich, alles klar, okay, geht noch alles, check check, okay, gut, irgendwo musste man auch Session Timeout angeben, wo gibt man denn Session Timeout an, wo war das denn, Session Timeout, hier, beim nächsten, beim nächsten, Session Expiration, weil da, da geben wir nur ne Minute an oder so, selbst wenn ich Session Tokens liege, so schnell hat das keiner abgetippt, also, hier, so, den ersten Schritt haben wir hinbekommen, wunderbar, der nächste, der nächste Request, also, Cookies, Cookies setzen haben wir hinbekommen, wir können, wir können, nee, wobei ich gebe die Cookies nicht aus, wer weiß was man damit anstellen kann, also ich mein, mehr als den Account hier übernehmen kann man eh nicht, und den Account lösche ich danach, aber man muss es ja nicht übertreiben, so, nächster Request, was braucht man als nächstes, hier bekommen wir jetzt unsere UID, okay, also, ach du Scheiße, das ist jetzt schon ein bisschen mehr, was man hier setzen muss, ah, wir können gucken, und ich hab ne Idee, wir können gucken, ob die, ob die Response okay ist, also quasi, if Login Response Status Code und gleich 200, ähm, keine Ahnung, Login failed oder so, irgendwie, oder wir können, oder wir können richtig, richtig Sixhead ob Object Oriented tuttet sein, und, und machen so was wie, äh, Public Void Throw on Error, String Message, if, wahrscheinlich ist das, der einzige, das einzige Mal, wo ich diese Klasse hier brauche, und danach sind es immer andere Antworten, if und gleich 200, New Network Exception oder sowas, ach, keine Ahnung, einfach, Base Exception, fällt grad nicht ein, welche Message, irgendwie so, und dann können wir noch hinten dran die Status Codes hängen, Error, Error, Error ist übrigens richtig cringe, ja, HiSJohi, Dankeschön für den Sub, man könnte, man könnte tatsächlich noch jetzt sowas hinten dran hängen wie Status, Status Code oder so, aber scheiß drauf, komm Error Handling, Kackel Alter, wer braucht denn sowas, geh, geh, gehste, gehste fort hier, weg, weg damit, weg, zwar zumindest können wir jetzt eine Sache machen, was es ein bisschen, ein bisschen hübscher, ein bisschen hübscher macht, Login, Response, ja, ich mein, das sieht, das sieht ein bisschen schicker aus, ja, dann ist das hier abgehakt, es ist auch so, guter Code hat keine Errors, ja, das ist richtig, allerdings ist die Fiat API wahrscheinlich kein guter Code, deswegen hat die manchmal Errors, gerade was Connection angeht, und Vodafone auch, aber jetzt machen wir mal weiter, also wir haben jetzt unsere Cookies gesetzt, alles gut, jetzt brauchen wir wieder ein Request, wahrscheinlich auf die Login-Uhr, ja, Login, Login-Uhr, so und diesmal, diesmal brauchen wir aber Accounts Login, und dann testen wir jetzt auch gleich mal, ob das Login nicht funktioniert, neuer Job, ne, warum, war immer noch das gleiche wie vorher, so Accounts Login, so was brauchen, ist das jetzt ein Postrequest oder was machen, was machen die denn, hier ist das ein Post, ah, das ist jetzt ein Postrequest, aha, das ist jetzt ein Postrequest, wo das da alles in den Body rein muss, ne, die können sich auch nicht entscheiden, oder, bei Fiat, was das jetzt werden soll, also Login, ok, wir müssen jetzt ein Request machen auf Accounts Login, und dann wird das, also mit unseren Cookies natürlich, ohne Cookies geht hier nichts, Query-Parameters und sowas brauchen wir alles nicht, ne, Post, Post, Jason Essink, also wir wollen ein Jason-Objekt schicken, und zwar, aber jetzt muss ich wirklich diesen ganzen Crap da rein schreiben, wait, was ist das jetzt, Aus-Response, ok, Receive, Receive-String, und dann gucken wir mal, ob da was Sinnvolles rauskommt, was passiert denn, wenn ich ein Post mache, einfach so, da sollte jetzt irgendein Error zurückkommen, ja, guck mal, Missing, Missing Required-Parameter, AP-Key, ja gut, ist doch in Ordnung, also was brauchen wir da jetzt, brauchen wir, Moment, diesen Krempel von da oben geben die hier wieder an, also will ich jetzt wahrscheinlich sowas machen wie Default, Params, Concat oder so, gibt es sowas, oh je, das wird jetzt aber eklig, sicher, dass man das so machen will, ne, oder, ne, ne, ich glaube nicht, dass wir das so machen wollen, ne, ne, das funktioniert so, glaubt eher nicht, dann muss ich mir mit den Default-Parametern doch irgendwas überlegen, ach, Moment, ich mache es ja auch falsch, das kommt ja auch nicht da rein, das muss ja auch direkt hier hin, guck mal, das funktioniert, ok, das sieht zwar nicht hübsch aus, aber, ich meine, könnte, könnte schlimmer sein, so, also, was brauchen wir da jetzt für Parameter, Login-ID brauchen wir, wir brauchen einiges, wir brauchen, wir brauchen einiges, Dankeschön Quatsch mit Sauce für den Sub, so, wir brauchen einiges an Parametern hier, so, Login-ID, Passwort, gerade mal ein bisschen kleiner, Login-ID, Passwort, Session Expiration, das kommt auf, wir wollen übrigens Object an der Stelle haben, ach, das geht nicht, er ist drauf, so, Timespan from Seconds, also, sagen wir mal, 10 Sekunden darf die Session gültig sein, Total Seconds, ja, man könnte jetzt einfach 10 reinschreiben, aber vielleicht will ich ja noch Minuten später machen, so, Session Parameter, Api-Key, welchen Api-Key brauchen wir jetzt, jetzt brauchen wir den richtig, echten Api-Key oder den Login Api-Key, welchen brauchen wir da jetzt, da muss ich hier nachgucken, äh, Alter, ist das unübersichtlich, hier, was, Risk Context, was, ne, den Login Api-Key braucht man hier wieder, ok, äh, also, Api-, ich glaube, ich guck, ich glaube, ich guck in der JavaScript-Implementierung davon, guck ich mir das ab, also, Api-Key brauchen wir mal wieder, Login Api-Key, ok, so, dann braucht man SDK, Bild, das haben wir schon, Format, Target Enf, Leute, Target Enf, das packen wir in die Defaults rein, ich geh davon aus, das brauchen wir noch öfters, Target Enf, wahrscheinlich können wir den Api-Key auch in die Defaults reinpacken, so, SDK, also, Include, so, Include, was ist das hier, Profile Data, E-Mails, ok, ich bin mir zwar nicht ganz, ganz sicher, aber wahrscheinlich was er returnt, oder, von, von meinen Sachen, die da gespeichert sind, so, Target Enf, Hammer, Include, Hammer, Include, User Info, User Info, Login Mode, Standard, was machen die hier, Login Mode, haben die hier überhaupt Login Mode drinne stehen, Login Mode, Standard, ok, das muss anscheinend sein, Login Mode, Standard, Language, juckt mich nicht, Source, Show Screen Set, Alter, was auch immer, was auch immer, Auth Mode, Cookie, brauchen wir noch, das ist wohl wichtig, ahja, das haben die da auch drinne, Auth Mode, Cookie, ok, das war's, jetzt bin ich ja mal gespannt, Kekwade, Alter, also, das Login kann jetzt noch nicht funktionieren, ja, weil ich falsche, falsche Usernamen, Passwort eingebe, einmal mal gucken, was der mir als Antwort, was der mir als Antwort, ähm, rausschmeißt, das ist Ryder, das ist Ryder, Missing Required Parameter, APK, warum, der ist doch da, Missing Required Parameter, erzähl, lüg nicht rum, der ist da, ich sehs genau, ihr sehts auch oder, da steht eindeutig APK, nee, nee, muss APK nicht groß, das ist richtig so, äh, ich hab's richtig, ach, Moment, wait a minute, da oben war's noch klein, und jetzt ist es groß, Alter, das ist ja mal die geilste API aller Zeiten, die sie hier gebaut haben, Missing Required Parameter, API Key, ok, soll ich jetzt exakt so schreiben, wie die das wollen, ja, nee, nee, der sagt Missing Parameter, ok, ja, mach ich irgendwas falsch, Leute, ok. POST Invalid API Key Parameter, ah Joo Also Login API Key, das ist doch der, den sie hier verwenden. Ja, oder es ist wirklich so, weil mein Login nicht stimmt. Geben wir mal irgendwie was ein, was nach E-Mail Adresse aussieht. Nee, Missing Request, Invalid API Key Parameter, stimmt dir irgendwas nicht, was ich hier zu ist? Bin ich zu pepega, das hier zusammenzubauen? Vielleicht mache ich das ja einfach falsch mit dem, mit dem Dictionary. Wartet mal, wir testen das mal kurz, was da rauskommt. Wir gucken mal, was da rauskommt. Alter, was serialisiert der mir denn hier für ein Shit zusammen? Das ist gar kein Wunder, dass das nicht funktioniert. Okay, so funktioniert das nicht, das muss ich anders machen. Das klappt so nicht, ich dachte, ich könnte das elegant machen mit den Default Parametern, aber das scheint so weniger zu klappen. Was kommt denn da überhaupt zurück, wenn ich zwei Dictionaries zusammen? Ach, da kommt gar kein Dictionary zurück, oder wie? Leute, warum kommt, wenn ich zwei Dictionaries zusammenschmeiße, warum kommt da kein Dictionary zurück? Das Chase zonifiziert das Dictionary, aber nicht so, wie ich mir das gedacht habe. Okay, wir machen das anders. Ich brauche diese Default Parameter garantiert noch öfters. Das geht bestimmt schöner, nennen wir irgendwie, keine Ahnung, Default Parameters oder Union, aber sowas gibt es glaube ich, das gibt es, ach doch, Moment, nee, da kommt es gleich raus. Ne, da machen wir das anders, so, wie gesagt, das geht bestimmt schöner, aber wir machen das jetzt immer schnell so, also Default, Default Dictionary ist das da, wir schmeißen das hier mal weg, Default Dictionary ist das hier, so, was hat er jetzt verschm- Alter, das hab ich übersehen, wat, ach, da ist noch ein New drinne, so, Default Parameter, als irgendwie, keine Ahnung, For Each, Default and, warum geht das nicht, ah, okay Leute, das geht garantiert deutlich schöner, aber mir fällt grad nix ein, so, und jetzt kann ich hier oben sagen, so, oh Shit, Alter, wenn das jetzt leer, das ist ja mega hässlich, egal, wir ignorieren das jetzt einfach, okay, so, ja, du kannst zu Dictionary machen, da musst du aber explizit nochmal die Keys angeben, was auch blöd ist, so, geht das jetzt, Moment, hier Default Parameters, so, geht das jetzt, kommt jetzt was Sinnvolles bei raus, ah, Moment, ich muss den, ja, ja, Ausgabe machen, Auth Response, was, Alter! Was macht der denn da draus, das sieht doch gut aus, das sieht doch jetzt richtig gut aus, APK, alles gut, wie hat der hier APK geschrieben, ist alles richtig, jetzt ist, das ist gut so, das ist, so muss das sein, so ist das korrekt, so ist das eigentlich richtig, warum funktioniert das nicht, eigentlich müsste das so jetzt gehen, Missing Required Parameter APK, bin ich jetzt total hängen geblieben, der ist doch da, okay, okay, wir machen jetzt, ich hab ne Idee, ich hab ne Idee, ist das gar kein, ist das gar kein Jason, was man da postet, vielleicht, das ist das vielleicht gar kein Jason, was man da postet, ist das irgendeine, ist das irgendwelche Forms, oder so, vielleicht, oh Leute, ich hab grad auswendig den Chat zugemacht, cool, muss man Chat hin, muss den Chat refreshen, so, jetzt, jetzt ist er wieder da, ich seh euch wieder, ist das vielleicht irgendwas, also das ist das erste Get, das will ich net haben, das da interessiert mich, Response, was macht der denn hier, Method Post, Join und Moment, das ist irgendeine Form, irgendeine Form, hier guckt mal, Alter, das ist kein Jason Response, das ist irgendeine Form, ja gut, wahrscheinlich weil er das gleiche aus dem Loginfeld zusammenbaut auf der Webseite, Post Full Encoded Async, ok, schauen wir mal, ob es jetzt funktioniert, ah, Invalid Login or Password, das sieht schon deutlich besser aus, ok, meine E-Mail Adresse, die ist ja bekannt, hier, wir sind, E-Mail Adresse, die da, ganz furchtbar, Fiat, please, so, nur mit dem Passwort muss ich mir jetzt irgendwas überlegen, wir machen wieder eine Datei in die ihr nicht rein, Secret, in die ihr nicht reingucken dürft, ihr dürft hier nicht reingucken, ihr müsst ja alle die Augen zumachen, Leute, wenn ich das reinschreibe jetzt, Fiat, nee, Secrets, jpw, ok, da zeigt das auch nicht an, ok, Augen zu Chat, Augen zu, keiner guckt, Konfig, null, ich glaube es geht los, nee, kein Konfig, ok, so, passt, ihr dürft wieder, ihr dürft wieder gucken, mache ich wieder an, Bildschirmhelligkeit hochlegen, oh nee, jetzt hat er es gesehen, er hat mich durchschaut, so, Passwort, Secrets, Fiat Passwort, so, mal schauen, ob es funktioniert, ich bin gespannt, easy, Login Token liegt, aber es sind 10 Sekunden expired, Chat, Chat, viel Spaß das in 10 Sekunden abzutippen, wer schafft es, easy, bin drin, oh nein, Chat, wusste doch, euch kann man nichts zeigen hier, man kann es ja verdammt zeigen, du weißt ja noch gar nicht, was du mit dem Login Token überhaupt machen sollst, ok, was bekommen wir denn hier für eine Response überhaupt, ok, Call ID, Error Code, API Version, Status Code, Status Reason, ok, das klingt schon mal nicht schlecht, UID, die brauchen wir auf jeden Fall, das weiß ich noch, die UID brauchen wir, sag mal, diesen ganzen Schmodder brauch ich doch nicht, Profile, E-Mail, Data, ich mein, who cares, oder, nein, wen juckt es, die UID brauche ich, sonst nix, so, dann würde ich vorschlagen, wir schnappen uns das hier nochmal, wobei, nein, eigentlich, wir brauchen nix davon, oder, wir brauchen nix davon, wir brauchen nur die UID, nur das da, sonst, sonst brauchen wir nix, so, das ist doch, das ist doch easy, guck mal, äh, wir haben unsere Fiat Response, wir machen jetzt, oh, wir sind heute Hyper Object Oriented, machen jetzt Public Class, so, das ist Fiat Api Response Base, ne, Base, Base, das ist, äh, Auth Api Response, so, und das Ding hat da nur ein extra Feld, was UID heißt, String, UID, so, äh, da bin ich mir jetzt nicht sicher, JSON Property, ob man da angeben muss, wie das genau heißt, weil, hier heißt es ja UID, da weiß ich, ob er, ob er es checkt, so, ähm, gucken wir mal, ob das funktioniert, jetzt machen wir zu, so, und wir wollen jetzt nicht, wir wollen ein, ein JSON Response kriegen, irgendwie Auth Response, schauen wir mal, Auth Response UID, gucken wir mal, ob wir jetzt nur die UID rauskriegen, easy, funktioniert, so, UID haben wir, und die anderen Sachen haben wir natürlich, Moment, ich wollte das natürlich erben, so, dass der andere Krempel da auch drinne ist, genau, so, äh, was weiß ich, Auth, failed, so, gut, also, jetzt sind wir zumindest schon mal einen Schritt weiter, wir haben jetzt, wenn ich jetzt richtig sehe, Session Cookies und, und ein Token, nee, und die User ID, und die User ID, ok, wie geht es jetzt weiter, wie geht es jetzt weiter mit dem, mit dem ganzen Shit hier, also, das haben wir jetzt, passt hier, ganzen Krempel von Go, können wir mal ignorieren, jetzt müssen wir ein Request auf Account get JSON Web Token machen, mit diesem ganzen Krempel hier drinne, ok, na gut, guck mal, gut, dass wir unsere Base Sachen gespeichert haben, Pog, Leute, wir brauchen den API Key doch bei jeder Anfrage, habe ich das jetzt bis jetzt richtig gesehen, da können wir doch den API Key auch einfach, ach, Moment, hier ist der API Key groß geschrieben, hier ist der API Key klein geschrieben, das ist bestimmt, nicht so, das, das geht wahrscheinlich nicht, lassen wir das jetzt mal, also weiter gehts, das da müssen wir jetzt machen, also wir brauchen ein Request, Copy Paste mir den Krempel hier mal, so, das hier ist ein JSON Web Token Request Response, Login Uhr, jetzt auf Accounts, also wer sich das bei Fiat ausgedacht hat, ne, Chat, bis jetzt bei Apple irgendwas spannendes dabei, irgendwas, irgendwas bahnbrechendes, was man wissen müsste, außer das alles so easy, so awesome, so, so grandios ist, so Cookies, der ganze andere Krempel hier ist wieder drinnen, das hier brauchen wir jetzt Fields, Fields brauchen wir auf jeden Fall, den ganzen anderen, und das Token muss da jetzt auch rein, ok, Auth Mode Cookie, ok, das muss man hier drinnen stehen lassen anscheinend, also, ok, wir brauchen folgendes, wenn ich das jetzt richtig sehe, wir brauchen Fields, Fields ist dieser ganze Schmodder da, was auch immer man mir das sagen soll, Fields, was denn hier, was denn hier, Rider denkt mit, Rider hör auf mitzudenken, lass mich das tippen, so, Login Token brauchen wir jetzt noch, Login Token, woher kommen eigentlich die ganzen Extension Methods, das kommt von, zeige ich dir, das hier, das kommt von Flurl, das ist ein, ein HTTP Client URL Builder, finde ich viel angenehmer als den eingebauten HTTP Client, guck, das ist das hier, ist auch recht beliebt, ja, Login URL ist ein String und das sind alles, ist alles Extention, was ein 1 Hertz Display, boah krass, was die alles machen bei Apple und was brauchen wir jetzt hier noch, Login Token und ins Login Token müssen wir jetzt was packen, die UID, nee, Login Token, Moment, ich bin glaube ich eins zu weit oder, wo, wo, wo hat er denn das hierher, wo, wo hat der, wo hat er die Session Info her, kommt die irgendwo hierher, ah, Session Info steht da drinnen, ist das, ist das so, habe ich, habe ich noch irgendwie hier oben sowas, Session Info, guck mal da, stand da Session Info, ach guck mal da, Session Info, Login Token, wir brauchen gar nicht nur die UID, wir brauchen auch noch das da, Session Info, ja gut auf geht's, Session Info, also brauchen wir jetzt noch sowas hier, Session Info, so und das bekommt ein Login Token, Login Token und ein Expires In, Expires In, weil man das wahrscheinlich gar nicht braucht, so und das kriegt ein Property Session Info und dann sollte er diesen Kram eigentlich ordentlich deserialisieren, hoffe ich mal, das heißt wir bekommen jetzt ein Session Token, guck mal nochmal ob wir jetzt ein Session Token bekommen, schauen wir mal, ja, ja, UID Session Token, alles klar, so, weil jetzt brauchen wir nämlich das Session Token an dieser Stelle, so wie es aussieht, Login Token, also sprich von vorher brauchen wir jetzt die Session Info und das Login Token und jetzt sollten wir einen ordentlichen Response kriegen, Moment, ist das jetzt überhaupt wieder URL encoded oder ist das jetzt wieder was anderes, oh Gott, also die Fiat API macht mich fertig, ist es jetzt, ja das ist wieder ein Post, ne Moment, ist das jetzt überhaupt, ne, ne das ist jetzt wieder ein Get, das ist jetzt wieder ein Get mit URL Parametern, also was die sich da ausgedacht haben, Get, Moment, also dann brauchen wir nicht das hier, sondern Set Query Parameters, Get String Assign, so schauen wir mal was da jetzt zurück kommt, ob da jetzt was sinnvolles als Antwort zurück kommt, General Server Error, ok was habe ich nicht gecheckt, was ist hier verkehrt, General Server Error, was habe ich hier verkehrt gemacht, Fiat Server geschrottet, Accounts, Get, so passt, wir gucken uns die JavaScript Variante an, das haben wir jetzt ja schon, so hier sind wir jetzt, also Login Talken haben wir, haben wir, haben wir, haben wir, haben wir alles, was, was könnte ihn denn, was könnte ihn jetzt, der API Key fehlt doch bestimmt wieder oder, der API Key fehlt garantiert, Chat, der API Key fehlt, sagts euch, der API Key fehlt, hat der hier den API Key drinne, Login API Key, API Key, der API Key, der API Key hab ich vergessen, aha, schon funktioniert's, schon funktioniert's, exellent, alles klar, so den API Key, den machen wir jetzt hier wirklich mal raus und packen den in die Defaults rein, der API Key und Auth Mode Cookie kommt auch in die Defaults rein, weil anscheinend braucht man das immer, Auth Mode Cookie können wir wegmachen und API Key können wir auch wegmachen, API Key, hoffentlich kann ich den API Key hier auch wegmachen, dann nicht, dass es case sensitive ist, hey es funktioniert, die haben ihre API nicht case sensitive gemacht, ich bin begeistert, es funktioniert mit API klein geschrieben und API groß geschrieben, Pog, ich mein Login Mode Standard könnte ich da auch reinmachen, Login Mode Standard machen wir auch da rein, das hier, das lassen wir mal, das sieht so aus als muss das da nicht hin, ok, ok, ok, also wir haben jetzt ein Token, wir haben jetzt ein Token, hier Idee, Idee Token, ist da sonst noch irgendwas spannendes drinne, nee nur Idee Token, ok, objektorientiert sein ist anstrengend, das heißt wir brauchen jetzt eine Fiat Response und die da haben da drinne bloß ein ID Token, Token ID, ah, get Jason Essink, Fiat Dings Response, jawoll, schauen wir mal ob da was sinnvolles bei rumkommt jetzt, exellent, also das hat übrigens alles keine Gimmick, ok hier ist unser Token, ok, jetzt, es wird ja noch viel wilder, es wird ja noch viel wilder jetzt, also jetzt haben wir unser Web Token, jetzt müssen wir zu Amazon, jetzt wird es erst richtig kriminell, kriminell, kriminell wird es nicht bevor jetzt hier irgendwie wieder die Twitch und YouTube Polizei am Start ist, nein nein, es wird kompliziert, mein Opa hat immer gesagt wenn es kompliziert wird jetzt wird es kriminell, so was haben wir, oh jetzt müssen wir zu Amazon, jetzt müssen wir zu Amazon, oder sowas in der Richtung, nee wir müssen nicht zu Amazon, wir müssen nochmal zu Fiat und ok anscheinend müssen wir jetzt zu dieser URL, alles klar, obviusly müssen wir dahin, also Token URL, so und jetzt bin ich mal gespannt, wie geht es jetzt, also Token URL und jetzt muss ich was für ein Request machen, jetzt muss ich Header setzen Leute, ich gebe dir Header, x client API Version, was so, jetzt mal ernsthaft, das ist doch abartig was die sich hier ausgedacht haben, sag mal das ist ja ein Login Vorgang, der ist ja komplizierter, wie alles wirklich ohne Scheiß, ich habe noch nie einen komplizierteren Login Vorgang gesehen, also was, ich habe keine Ahnung was die sich dabei gedacht haben die Italiener, normalerweise würde ich jetzt sagen was die China Chinesen dabei gedacht haben, es sind doch nicht mal die Chinesen diesmal, also muss ich Header setzen Leute, Header, also erstmal unsere Cookies wieder anhängen, Cookies, ohne unsere Cookies geht wahrscheinlich nichts, der Punkt muss eins runter, Cookies, so Header, also wir brauchen eine x client API Version, ok, 1.0, dann brauchen wir eine, Moment, wir brauchen eine Client Request ID, die aus einem random Stream mit 16 zei, also, also was, was bin ich sehend hier Fiat, was ist das, was gibt das wenn es fertig ist, x API Key, oh wir brauchen einen anderen API Key Leute, habe ich den schon, den habe ich noch gar nicht, wir brauchen jetzt einen anderen API Key, wir brauchen jetzt den, den, den x API Key, was ist denn der x API Key, ah hier, der da, natürlich, natürlich, einer, einer reicht dann als selbstverständlich nett, Private String API Key, kann man den, kann man den als API Key irgendwie Token API Key oder so nennen, dass ich deswegen halbwegs unterscheiden kann, API Key, ok, Token API Key, alles klar, x Originator Type, Web, natürlich, wir sind in Browser, habe ich nie was anderes behauptet, ok Client Request ID, meine Güte, Client Request ID, also ein random, also ich soll jetzt einen random String generieren, das ist der gleiche Key wie da rüber, echt, ne, zwei komplett unterschiedliche paar, zwei komplett unterschiedliche paar Keys, this random String, ok Leute, wisst ihr was, ich, ich mache es mir jetzt einfach, wobei ich muss mal gucken, was der da eigentlich macht, random String, ah, der random String generiert sich aus nur kleinen Buchstaben und Null bis neun, natürlich, was sonst, was sonst, du meinst den Auskommand, achso, hab ich gar nicht gesehen, dass der oben schon hat, also nur kleinen Buchstaben und Null bis neun, ok das ist relativ einfach Leute, wir machen, wir machen uns jetzt, wir machen uns jetzt wirklich, wir machen uns jetzt wirklich einfach, ich hoffe der frisst das jetzt, Client Request, wir sagen jetzt einfach, Gut, New, String, ohne was, 16, fertig, das ist random genug oder, das, das müsste, müsste random, es müsste random genug sein für die glaube ich, so, müssen wir sonst noch was machen, aha, das ist jetzt ein, ach, das ist jetzt ein Post Request, ach, das ist jetzt ein Jason Post Request, ok, Post Jason Async, und da muss jetzt was rein, Gigia Talken, was für ein Ding, Gigia Talken API, das hab ich ehrlich gesagt noch nie gehört, warum heißt das nicht Gigia Chat Talken oder sowas, aber Gigia, das bestimmt irgendwas von Amazon, oder ist das Chat, sagt euch das was, ich mein scheint ja, scheint ja irgendwie verbreitet zu sein, aber ich hab das noch nie gehört, ok wo sind wir stehen geblieben, hier, random String, was ist das, Moment, da bin ich ja noch gar nicht, da bin ich noch gar nicht, hier, hier, login, login, header, ne Moment, da bin ich auch noch nicht, wo muss ich denn hin, na, da bin ich, Gigia Talken, ok, Gigia Talken, und das ist jetzt, ich lösche das hier mal, weil wir haben ja alles drinne, und das ist jetzt quasi von der Response vorher, hallo, ah ne, Moment, gleich, wir sind hier nicht in die Ava-Screen, äh, Talken ID, ok, es ist nicht die Talken ID, es ist tatsächlich ein ID-Talken, das muss ich umbenennen, ok, und jetzt, äh, Receive String, jetzt bin ich ja mal gespannt, ob da was Sinnvolles zurückkommt, Alter, Identity Response, ob das jetzt funktioniert, Schatz, ich bin skeptisch, so, ich würde sagen, es hat funktioniert, und jetzt bekommen wir eine Identity ID mit irgendeinem Amazon Rechenzentrum, beziehungsweise Amazon Region, und nochmal ein Talken, sag mal, das wie viele Talken ist das jetzt, das fünfte, der Identity Aid Identifier, also wenn du Sachen schon so benennen musst, da weißt du, da stimmt irgendwas nicht so ganz, der Identity Identifier, alles klar, aber, aber Leute, es hat funktioniert, lasst mal was testen, was passiert denn, wenn ich hier 16, wenn ich hier einfach ein 17, 17-stelliges Random String mitschicke, geht es dann immer noch, ja, funktioniert einfach trotzdem, müssen wahrscheinlich überhaupt nicht 16 sein, ist wahrscheinlich vollkommen egal, der erste Typ hat 16 genommen und jeder hat von ihm abgeschrieben und seitdem waren es 16, ok, weiter, weiter, ok, also, was, Moment, was bekommen wir da jetzt überhaupt als Antwort, Identity ID und Talken, ok, also, gehen wir mal hier wieder runter, das können wir nicht von unserer Fiat Response ableiten, sondern einfach nur, was ist denn das jetzt für eine Url hier, zeig mal, wie heißt die Url, Alter, das ist, 0101 FCA Gizuf, FCA, das ist dieser Fiat Konzern, nenn es jetzt einfach, nenn es jetzt einfach, keine Ahnung, FCA, Identity Response, irgendwie muss ich den Krempel nehmen, so, Property, Identity ID, jawoll, ganz toll, String und noch ein Talken, noch ein Talken, wir haben noch nicht genug Talkens, da sind auch immer andere Talken, wie man hier sieht, guck, die sehen nur ähnlich aus, aber sind immer andere, also, Receive FCA Identity, schauen wir mal, ob es funktioniert hat und bam, funktioniert, ok, jetzt haben wir noch ein Talken und jetzt, wenn ich es richtig gesehen habe, müssen wir zu Amazon oder was kommt jetzt für abgedrehter Shit, ich, Leute, ich spar mir, ohne Mist, ich spar mir einfach, ich spar mir das Error Handling, Kacke, so, und hier mache ich gar kein Error Handling mehr, so, wie geht es denn, wie geht es denn weiter, Talken, ID, Logins, jetzt muss ich irgendwelche AWS Requests machen, was zum, gibt es da nicht irgendeine fertige AWS Library für die ich nehmen kann, warum sollte ich diesen Krempel selbst zusammenbauen, Marfinius, Dankeschön für den Host, das ist doch blödsinnig, ich brauche doch keine eigenen Amazon Requests, gibt es doch irgendeine Amazon Library, die das für mich macht, wie machen das die Jungs in golden hier drüben, die verwenden irgendeine Amazon Library, guckt mal, get credentials for identity, genau das will ich haben, get credentials for identity,.net, AWS, ich suche jetzt einfach mal nach ingnet.net, guck mal da, AWS SDK for.net, nach was muss ich da suchen jetzt, AWS SDK, kennt sich irgendjemand damit aus, Cognito Identity, danach suche ich mal, ich habe keine Ahnung von dem AWS Krempel, ok wir haben Cognito Identity Provider und Cognito Identity, ok, ich habe absolut keinen Plan, wie verwendet man das jetzt, gibt es ja irgendein Example oder so, Docs, Docs ist immer gut, Example, haha das ist gut, das ist gut, das mache ich rein, das ist gut, das gefällt mir, ich habe es hinzugefügt, das ist gut, was ist der Ziel des heutigen Projekts, das wird nicht nur heute sein, ich will mein Elektroauto in Home Assistant drinne haben, also so Sachen wie Reifendruck, Batteriestatus und Lade Dauer und sowas, ich brauche mal ein Beispiel dafür, Hot Examples, jawoll, die Hot Examples, wo sind sie, was, gibt es da nicht irgendein Beispiel für Stack Overflow, bin da jetzt echt ein bisschen aufgeschmissen, hat nicht einer von euch irgendwie Plan von, ok was, was gibt es denn, was gibt es denn hier, Cognito Identity, schreibt man das überhaupt so, Cognito Identity Provider Info, Cognito Identity Client, sowas da, ja, ja, ja, ja, jetzt, boah wie viel Zeug, wie heißt das denn Get, so hieß das doch oder, ok das war jetzt echt Luck, das war einfach nur pures Glück, ich habe random irgendwas genommen und das ist, wobei das stand doch glaube ich sogar auch hier, keine Ahnung was ich mache hier, E-Auto Review Incoming, bekommst du Geld oder Ladekarte, nö, war damit aber auch nicht auf die Arbeit, so was muss man da jetzt reinschreiben, vielleicht wenn ich danach suche finde ich vielleicht was, Issues, das ist gut, zeig mal Beispiel Code please, Request, OKS, was, ok das ist die verwirrendste API die ich je gesehen habe, ich habe keine Ahnung wie dieser Amazon Shit funktioniert, ok was machen die denn in der Go, was machen die in der Go, also die sagen Get Credentials for Identity Input, wo kommt denn das jetzt schon wieder her, wisst ihr was cool wäre, wenn die Go API und die.NET API von diesem Amazon Zeug ungefähr gleich wären, ich habe keine Ahnung wie das funktioniert, also die übergeben hier irgendwie Logins, ok also, ja GitHub ohne Scheiß, GitHub Copilot wäre für sowas wirklich gut, ok Identity ID, ich habe hier eine Identity ID, Identity ID, ok und jetzt, ein Dictionary, ah das machen die in Go auch, guck mal, die machen ein Dictionary was Logins heißt, das einfach auch mal machen, Logins, ach das heißt schon, ok New Dictionary, was ist denn das schon wieder für eine API Mann, was ist denn das hier, Await, das funktioniert im Leben nicht, und dann das da und dann das Token rein, MonkaS Alter, Ident, nee, nee und gleich, gleich, Identity Response, Token, ha, funktioniert nicht, nee, komm mal, exellent, wie bist du auf die Fiat API von GitHub gekommen, gar nicht, ich habe Projekte gesucht die Fiat zu porten und habe mir dann den Songscore angeguckt, du kannst dir EVCC angucken oder IO Broker angucken, die haben beide Fiat Module, ok, jetzt schicken wir mal den Request ab Leute, keine Ahnung was dabei rauskommt, was kriegen wir dann hier als Antwort eigentlich dann, was, ja was bekommt man hier eigentlich für eine Antwort, was ist denn das hier, was kommt da raus, Get Credentials for Identity Response, Identity Response habe ich schon, Credentials for, exakt so muss das heißen, Credentials for Identity Response, das muss einfach immer noch länger werden, ok Credentials, HTTP Status Code, ok auf gehts Leute, Bäm, komm mal ob das jetzt funktioniert, äh, hallo, hallo, ist AWS immer so langsam, hallo, hallo, was machen die, ah die muss, guck mal die geben noch die Region an, die geben noch die Region an, alles klar, sendet er, oh er ist abgekackt, no region endpoint, aha, siehste, region endpoint, west, oh jetzt aber, hängt wieder, ja, ich hab das noch nie verwendet, ich weiß nicht wie man das jetzt richtig benutzt, example, ja zeig her, doch die Region stand drinne, da stand EU West drinne, ok guck mal wir gucken uns mal das von Amazon an, guck mal die setzen auch nur die Region, ok er ist wieder abgekackt, ich hab ja auch kein Login für Amazon von Fiat, brauch ich ja auch nicht, ich will da drauf zugreifen mit einem ganz normalen Request, ok was gibt's denn hier noch für Credentials, ok zeig mal her, New Credentials, da muss ich jetzt AWS Keys und sowas eingeben, das hab ich net, ich hab kein Secret Key, ich hab kein Session Tongue, ich hab kein Access Key, geil, oh guck mal es gibt Anonymous AWS Credentials, sag mal wie viele Credentials gibt's denn hier eigentlich, Anonymous Credentials, easy, Leute ich hab echt kein Plan, es hängt wahrscheinlich wieder, alles klar, das kann doch nicht so ernsthaft so benutzt werden oder, und hat das jetzt das gemacht was ich machen will, schauen wir mal, ich hab jetzt übrigens, by the way, Credentials, ich bekomme jetzt übrigens, das ist jetzt das sechste Tongue, das sechste und siebte Tongue, ich bekomme jetzt noch ein Session Tongue, ein Secret Key und ein Access Key ID, das ist quasi dann das sechste, siebte und achte Tongue was ich jetzt bekomme, also das ist ja so secure, das ist schon hyper secure, da kannst du keine Chance mehr, wie viele, wie viele Tokens sind das jetzt, habt ihr mal mitgezählt, ich glaube es sind wirklich, damit sind wir 9 Tokens, hoffentlich brauchen wir die nicht alle später noch, Tokencounter, ok Credentials, die muss ich mir wahrscheinlich speichern denke ich mal hier, Credentials, na komm, wir nennen es, wir nennen es mal nicht einfach nur C sondern als Credentials, ok und damit mache ich jetzt genau was, bin ich jetzt damit fertig mit dem Login, bin ich jetzt mit der Login Prozedur durch, bald brauchen wir einen Token Manager zum verwalten, oh the Factory, Token Manager Factory brauchen wir da, so, Response Data Token, Data ID, ja das haben wir alles gespeichert, was macht der denn jetzt damit, Amtsfeld, der wusste auch nicht mehr was er hier reinschreiben soll, Seba, Suchan, 95 Dankeschön für den Sub, ok und weiter, hey wir sind fertig mit dem Login, wait a minute, jetzt können wir unsere Autos auflisten lassen, die nicht vorhanden sind aber ok, zumindest der Request zum auflisten der Autos sollte funktionieren, exellent, Leute wir haben es geschafft, wir sind eingeloggt, wir haben es geschafft in nur, in nur, na so viel Zeilen sind es gar nicht, 32, also 60 Zeilen haben wir gebraucht für das Login, ich mein es ist, das ist wirklich kompliziertes Login Verfahren was ich hier gesehen habe, ok also Private Credentials, Moment ist das überhaupt das richtige, das sind die richtigen Credentials hier, zack, jetzt lasse ich einfach die IDE machen, einfach hier zack, gibt es nicht, Create Field Credentials, fertig, ok die ID brauche ich auf jeden Fall später noch, UID, wo gab es, in welchem Response war die ID hier, Auth Response war die UID, die UID brauche ich auf jeden Fall noch, Private String, User ID, User ID, die gab es nämlich hier, User ID gleich, ok jetzt können wir den Request machen und die ganzen Autos auflisten lassen wenn ich das hier richtig sehe, dazu brauchen wir das, mein Gott ist das abartig Alter zu bedienen, ok also das Login hat ja anscheinend funktioniert so wie es aussieht, boah wie viel kostet das neue iPhone, 1450 Euro, das ist ja, ich wollte es gerade sagen richtiger Schnapper, aber die Leute werden es garantiert bezahlen, ich meine Leute, denkt an die Inflation, Apple muss auch überleben irgendwie, Apple ist bestimmt ja schon kurz vor der Pleite, die können sich das nicht leisten, da ein bisschen weniger fürzunehmen, das geht nicht, mittlerweile bekommt man dafür sogar eine Grafikkarte plus einen CPU schon, seit die ganzen Miner ihre Grafikkarten loswerden wollen bzw. sich das Minen nicht mehr lohnt, also Login hat funktioniert, jetzt geht es weiter, Public, Task, Public Async, Task, ich nenne es einfach nur Patch, so und da rufen wir jetzt die Auto Infos ab, die wir nicht abrufen können, weil der Account keine Autos hat, aber der Request muss funktionieren, ja ich lege überhaupt keinen Useragent fest, das interessiert die auch überhaupt nicht, so was ist das hier jetzt eigentlich, das kann ich mir doch bestimmt auch wieder alles sparen, ok wir gucken uns das mal in Go an, da muss ich glaube ich in die andere Datei, Vehicle, also das muss ich jetzt aufrufen, Api-Uri, ok welche ist das jetzt, Ah das ist wieder was anderes, ok, also wir brauchen noch eine weitere Url, die wir abrufen können, na dann, also das ist jetzt die richtig echte Api-Url, ok, nicht irgendwie die Login-Url oder die, das ist jetzt die richtig echte Api-Url, die wir jetzt brauchen für die weiteren Requests, na dann hoffen wir mal, Api, den nicht net so, ups, so heißt das, Api-Url, so get, was machen die hier jetzt, Stage, Moment was, wait, Seg, Seg, die Domains sind extrem PP'er von den, also, Append-Segment, V2, nee, V4, V2 war bei dem anderen, V4, Accounts, äh, jetzt brauchen wir die ID, User ID, FCA, GCV, das ist irgendwas für Fiat, Chrysler, sonst was, nicht der FCA, Fiat, Fiat Chrysler Automobiles, was GCV ist habe ich keine Ahnung, Growth Capital Venture, alles klar, Big Stonks, äh, warum geht das jetzt nicht, ah Segments muss es sein, Pass Segments, User ID, ok, Vehicles und jetzt Query-Parameter, wenn wir da gar nicht ganz sicher sind, doch, ne, Set Query-Parameter, genau, hier steht ja auch da oben Stage, all, da kommt doch im Leben nix Gescheites raus, hier Api-Url, so, also, V4 Accounts, was, was muss man da jetzt noch alles angeben, nix oder wie, ne, das kann ja so schon mal nicht funktionieren, Cookies wahrscheinlich, bestimmt, bestimmt Cookies, garantiert Cookies, garantiert Cookies, ah ne, das Cookie habe ich ja, ja dann keine Cookies, ähm, woher muss ich denn jetzt was ich da angehe, die geben mir gar nix an in dem Request, was macht denn V-Request, V-Request, V-Request, was ist denn V, also Beschissene hätten wir ja nicht benennen können, was ist V, V-Api, ah Moment, hä, was ist V, Request New, kommt das, kommt das hier her, ne, das hatte ich gerade auf, ach ne, hier ist es doch, da ist es doch, aha, ok, diesen ganzen, diesen ganzen Crap muss ich da wieder anhängen, dass es funktioniert, alles klar, ok, das wäre ja auch zu einfach gewesen, wenn das nicht, wenn das einfach nur abgeschickt werden kann, also, ähm, Append Path Segment, Set Query Parameter, Header Braumer, with Header, äh, x, x, komm wir schreiben es, wir schreiben es klein, machen das wie dem, wie in dem JavaScript Beispiel, x, Client App Version, 1.0, so, Client Header, Client Request ID, Moment, das ist der gleichen Krämpel wie da oben, oder? Lul, Ease, so, was braucht man da sonst noch, x-Api Key, x-Api Key, haben wir das da oben auch gebraucht, x-Api Key, jawoll, zack, Copy Paste, beste, Originator Type, Web, haben wir oben auch gebraucht, ok, wunderbar, haben wir jetzt alles, Pin Auth, das haben wir eh nicht, also, das haben wir, das haben wir, das haben wir, das haben wir, das haben wir, except, äh, except, können wir vielleicht noch machen, with Header, except, ob wir das brauchen, das Ding wird wahrscheinlich standardmäßig immer, Application, JSON, äh, Antworten, Content Type, ähm, Leute, mal ne doofe Frage, aber, die machen doch, die senden doch hier überhaupt keine Daten, warum setzen die in Content Type, ich mein, wenn ich keine Daten sende, muss ich eigentlich auch kein Content Type setzen, aber wir machen, ich mein, wer weiß, was die Fiat API da haben will, wir machen das jetzt einfach so, ok, also, jetzt haben wir alles gesetzt, wo setze ich meine Credentials überhaupt, ich mein, die habe ich abgerufen, irgendwo müssen die doch jetzt mal, was, was Sinnvolles machen, mal gucken was die API sagt, mal gucken, mal gucken was passiert, äh, Get, String, so, mal gucken was da jetzt zurückkommt, gleich mal her, flup, flup, flup, flup, flup, äh, forbidden, forbidden, ja gut, ich hab ja auch nirgendswo meine Credentials angegeben, forbidden, ähm, wir können das mal in einem zwei Catchplot machen, weil ich glaube, man kriegt aus der Exception noch ein bisschen, noch ein bisschen mehr raus, Message vielleicht, äh, äh, vielleicht kann man da was rauslesen, Response, Get, String, Async, Missing Authentification Token, ja genau, wie gebe ich denn das jetzt an, das Authentification Token, Identity Sign, jetzt muss ich irgendwelche AWS Signaturen oder, was ist das, jetzt schon wieder, mein Gott, was haben die sich da ausgedacht, Alter, ok, AWS 4 Sign, jetzt hört es aber auf, jetzt hört es aber auf, was ist denn das jetzt schon wieder, AWS 4 Sign, der Signed irgendwie die Header und dann, und dann kopiert er sich den Authorization Header, ey, wer hat sich das ausgedacht, Mann, wer hat sich das ausgedacht, ok, was machen die in Go, Identity Sign, ok, ich guck mal kurz, was da passiert, vielleicht gibt es ja auch schon eine fertige Amazon Library, dann nehmen wir die, Identity Sign, ok, Sign, noch ein Fett, New Signer, alles klar, wir signen mit dem Signer, mit welchem Signer, Stack Overflow, Leute,.net, AWS Sign V4, Stack Overflow, was denn das, AWS Signer V4.net, das klingt gut, ich hab keine Ahnung, was das ist, was man braucht, aber der Name klingt vielversprechend, müsst ihr zugeben, oder, klingt genau nach sowas, was ich brauch, AWS Signer V4.net, Sign HTTP Request Messages Using AWS Signature Version 4, bitte schön, also nicht irgendwie outdated V2 oder sowas, Version 4, ne, wenn die V2 war die, war die Client Version, also nicht V3, oder was, Using Request Information and Credentials, ich weiß doch nicht mal, was ich überhaupt vor mir hab, ich weiß gar nicht, was ich hier sehe, ich weiß nicht, was ich hier machen soll, ok, Stack Overflow, is there a.net Library, was kann das sein, Request mit, ist immer, ganz, ganz bescheuerte Frage, aber warum brauche ich eine extra.net Library, um Request für AWS zu signen, wenn Amazon noch 30 Milliarden .net AWS Libraries hat, also warum kann das die nicht einfach, ja, Python interessiert mich, ne, wirklich, was sind das wieder für Ppega Leute bei Stack Overflow, ja, der erste verlinkte eine Python Library und der zweite verlinkte eine Javascript Geschichte, was ist da schon wieder los, ok, Python Time, aktivieren, here is designer from SDK, ok, er ist schön, wenn das designer da drin ist, I'm the co-author of this Library, welche von, von was sprechen die da schon wieder, Nougat Packages, Amazon, AWS Signer.net, das hatten wir doch gerade schon mal, oh es gibt auch noch ein AWS, AWS 4 Request Signer für.net und es gibt ein AWS Signature Version, was zum Teufel, was bin ich sehen, was ist das überhaupt, chat blickt irgendjemand durch, was das ist, hat irgendjemand schon was mit AWS gemacht, AWS Signature Version 4, HTTP Client, ok, Credentials, ok gut, ok gut, das kriege ich hin, das kriege ich hin zu benutzen, so und dann muss ich, dann muss ich was machen, please execute AP, Region EU West, ok, also was brauche ich jetzt, welches Nougat Package ist das hier, der AWS Signature, AWS Signature Signer, der AWS Signature Signer V4, ich installiere das jetzt einfach mal als Package, ich weiß weder wozu ich das brauche, noch was es macht, aber das wird schon irgendwie gehen, so, copy paste, ja gut, die benutzen HTTP Client, HTTP Client will ich nicht verwenden, ich will Fluchel verwenden, das wird jetzt natürlich ein bisschen komplizierter, ich könnte einen Hook registren, ja, before requests, call, war mal ein Vorschlag, IDE, call, perfekt, so wunderbar, ne jetzt haben wir doppelt, was call zu nennen ist ziemlich, ziemlich, naja da heißt es halt call, so und ich brauche hier nämlich einen, ach nee, ah das ist ein Overload, das ist ein Overload von GetAsync, ok wir müssen mal kurz das, die compile lassen, gucken was die da machen, oh guys, alter was ein Gefurl man, GetAsync, GetAsync, hier, nee, was, nee, credentials, ja, wo macht der hier was, immutable credentials, GetAsync, send self, ok, wir nähern uns, wir nähern uns der Sache, hier, signer, sign async, also was, signer, Moment den signer gibt es jetzt in Amazon und in AWS Signage, ok wir wollen AWS Signage, signer, sign, und jetzt, Leute ich hab selten so wenig verstanden, was ich mache, was als hier gerade, signer, sign, und was signiere ich überhaupt, versteht irgendjemand was ich überhaupt signen muss, ich hab überhaupt keine Ahnung, ok was muss ich da, requests, ok das weiß ich zumindest schon mal was wir brauchen, wir brauchen, request message, ja das ist ok, das hab ich verstanden, request message, a base, base url, gar keine, darf die null, nein, nein, darf die null sein, ich hoffe mal, dass die null sein darf, ich hab, ich hab kein Plan alter, default headers, was für default headers, ok, einfach leere Liste, einfach ja perfekt, leere Liste, alles gut, date, time, now, ich brech mal kurz die Zeilen um, jetzt, jetzt github co-pilot Leute, vielleicht wüsste der besser Bescheid was ich machen muss als ich selbst, und jetzt string region name, region, end point, west, und jetzt credentials, ok, was hat er für schmerzen, was, oh, ich hab zu wenig übergeben, du hast vergessen, ah service name hab ich vergessen, ah service name, execute ap war das service name, aha, guckte mal da, scheint so funktionieren, außer das da, eu west geht nicht, eu west system name, wahrscheinlich, oder display name, wahrscheinlich system name, a credentials marker, ok, ok, das marker nicht, warum nicht, weil es müssen immutable credentials sein, na meinetwegen immutable credentials, excess key, credentials, secret key, hocken mehr gibt es da net, ok, und das soll jetzt gehen, ich glaub nicht, dass das funktioniert, wir wollen mal run, invalid request, ah moment, das ist aber schon mal was anderes, request parameter is missing or invalid, aha, das ist schon mal was anderes, vorher hat er nämlich gesagt, passt mal auf, wenn ich das nämlich weglasse hier, dann sagt er, verbinden, missing token sagt er dann, also das ist schon mal richtig was ich hier mache, aber irgendwas ist missing, request parameter is missing, welcher request parameter könnte missing sein, setz mal base uri auf, meinste, wo krieg ich den überhaupt raus, ich bin auch richtig lost, ich hab keine Ahnung was da passiert, vielleicht gehts jetzt ja, invalid request parameter, was, der sagt mir ja auch nicht, welcher, welcher request parameter könnte denn da missing sein, weil wenn ich mir das hier mal zum Vergleich angucke, was die go dudes machen, na gut das erkennt man nicht richtig, was macht der IO Broker Typ, hab ich, hab ich nicht, moment, das hab ich da nicht drinne, vielleicht, vielleicht brauche man das, vielleicht brauche man hier, weil es sonst nicht geht, keine Ahnung, nein, fuck, ok, ich hab alles, xapkey hab ich, hätte gesagt wenns nicht geht, client app hab ich, originator hab ich, ah, moment, das setzt aber diese signing library ziemlich sicher, welcher request parameter könnte denn da missing sein, mach ich ein get oder mach ich ein post, welcher request, der nimmt ne andere url, das können wir ausprobieren, ich kann mir die url einfach ausgeben lassen, url, also der ändert die ja ab hoffe ich mal, ne das ist ok, was in go, ne der nimmt doch keine andere url, der sagt hier execute ap, das ist die, diese funktionsname, die hab ich ja auch, dem java script, ja der hat die url unterteilt in host und pass, das dürfte eigentlich das gleiche sein, wo ist das problem, wir geben uns mal die header aus, for each, rttp, message request header, header, header, key, was die keys sind vertauscht, echt wo, wo, ne, ne ist doch nix vertauscht, wo hab ich was vertauscht, also header accept bla bla, wo ist denn, wo ist mein content type hin, chat mein content type ist weg, guck mal da, kein content type header mehr, der hat sich einfach ausm staub gemacht, also wo ist denn jetzt mein, warum ist da kein content type header mehr, wo ist der denn hin, ich setze den hier und unten ist er weg, keck bei, ahja gut, call, rttp, message, header, add, da füge ich ihn halt wieder hinzu, da kenne ich jetzt nix, so, ah moment, die schleife hätte ich mir mal da lassen sollen, so, ah, jetzt ist er wieder da, vielleicht lag es ja da dran, oh, oh, misused header name, content type, jetzt möchte mich dotnet wieder davor beschützen irgendwas komisches zu machen, aber dotnet du musst mich nicht beschützen, ich will absicht, ich will content type reinschreiben, die ist unter anderem auch für den 500e ja, aber die geht wahrscheinlich auch dann für die anderen modelle, die uconnect verwenden, make sure request headers are used with rttp request message, response header with rttp response message, and content headers, rttp content, soll ich hier irgendwie sowas setzen oder wie, ich mein, ich kann den content setzen, die sache ist nur die, ich weiß überhaupt nicht, was, ich brauch gar kein content, ok, wisst ihr was, bitchy band jetzt einfach, new string content, leerer string, encoding utf8 und media type, was, media type header value, also ich will einfach nur, dass da application json drin steht, so, bitchy banden den jetzt einfach, wir tun einfach so, als ist ein content dran, der ist leer, so bam, aber wahrscheinlich liegt es nicht an dem, wait a minute, es hat keinen fehler gegeben, moment, guck dir mal, warte, aber content type ist immer noch nicht da, ich hab jetzt in leeren content angehängt, das geht jetzt oder was, hä, muss man das in irgendeiner art und weise verstehen, ok, gucken wir uns mal den response an, easy, funktioniert, ok, ich hab keine autos registriert, bei 4 mit dem neuen account, ja, aber das funktioniert, guckt euch das mal an, also man muss ernsthaft einen leeren content setzen, dass das funktioniert, ja, ok, das hätte ich nicht gedacht, wenn ich ehrlich bin, aber ich muss das ja auch nicht denken, es reicht ja, wenn es funktioniert, broken api, also die api ist wirklich richtig pepega, wir können jetzt noch mal hier was schickes draus machen und zwar, wir können hier sowas machen wie aws sign, sowas, overload, generate, äh, kann man da irgendwie extension methods generaten, anscheinend, dann mach ich das von hand in meinem helper file, public static void, aws sign, credentials, so, ähm, this, was ist denn das, plural request oder sowas, request, ah, ah, ah, credentials, was, reach an endpoint provider v2, was will das ding von mir, ah, ich hab den falschen signer importiert, ah, ich, ich muss es nochmal löschen, amazon, ja, ja, geh weg, signer, ich will den da haben und hier will ich, wahrscheinlich das da haben und hier will ich wahrscheinlich das da haben, meine güde, äh, ok, jetzt hab ich immer noch credentials, immer noch da, jawoll, perfekt, excellent, so, ah ne, jetzt muss ich das noch return, return, return request, so und jetzt, ja, ist ja gut, hier, ja, guck, jetzt, jetzt gehts, exellent, guck mal, jetzt ist das sogar richtig lesbar, oder, wo erstmal gleich was abgeht, zack, funktioniert, das ist gar nicht mal so übel, muss ich sagen, muss ich sagen, das ist gar nicht mal so schlecht, oh, das try catch kommt wieder weg, ups, äh, schön sie schaben, ja, beste, beste sprache, das ist jetzt sogar relativ lesbar, muss ich sagen, dadurch, dass ich den kram hier ausgelagert hab, ist das wirklich ganz ok, man könnte sich jetzt vielleicht noch überlegen, ob man hier x client version, x apk, x originator und so, ob man noch so nen, sowas hier macht, nur für das, nur für diesen krempel da, beides sind header, ne, with, kann man da auch mehrere anhängen, mit headers, headers, object headers, ja, ja, kann man, dann machen wir doch mal sowas hier, Leute, das ist eklig, da musst du irgendwas schöneres geben, das anzuhängen, oder, copy paste, default, AWS oder so, yes, ne, wie haben wir es genannt, default, header, ah, man, ok, header, so, dann nehmen wir den krempel mal um, ah, header, ja, ja, ah, gut, ich will es nicht sehen, das ist hässlich, aber das ist auf jeden fall besser, als jedes mal den gleichen kram hinzuschreiben, du findest das problematisch, dass die Sachen in der cloud sind, ja, ich finde es auch nicht schön, aber was willst du machen, ne, in dem Fall ist es halt so, entweder greife ich die Sachen über die cloud ab, oder gar nicht, vielleicht hat man mal später die Chance, das über den bluetooth debug interface vom auto abzugreifen, aber aktuell gibt es quasi noch nichts, was den aktuellen fiat 500e ordentlich unterstützt, das heißt, ich muss das über die cloud abgreifen, in zwei, drei jahren, wenn dieses cloud abo ausläuft, was dabei ist, wo ich mir dann, je nachdem was es kostet, wirklich auch hart überlege, das zu verlängern, also nicht zu verlängern, dann gibt es vielleicht irgendwelche debug interfaces, die man dranstecken kann und per bluetooth auslesen oder so, das wäre mir natürlich auch deutlich lieber, als hier irgendwas über die cloud zu machen, keine frage, also wir brauchen das da, das da, das da, das ist alles das default zeug, was man immer braucht, also, zack, zack, zack, x header, guck mal hier, wer das nicht checkt, was ich vor habe, wäre nämlich, hatte ich gescheit einrücken, direkt hier, und da geht´s wirklich alles Alter kannst du das mal gescheit einrücken Format jawoll so und jetzt können wir nämlich an der stelle sagen with headers und dann AWS default headers ach nee das ist heim default ist null oder ja das geht nicht da muss mir etwas schöneres ausdenken als hier ein leeres objekt zu übergeben das ist hässlich rust des das habe ich gesehen auf github ja das ist eher team viewer alternative glaube wenn ich das wenn ich das richtig erkannt habe du du du du du du du du du du du du du du du das kann ich eigentlich kann ich mir das alles sparen fertig das kommt weg aber noch nicht reich doch und das und das bräuchte ich dann auch nicht extra sondern ja und es einfach so machen so wo brauchen die die default headers noch da so mal gucken ob du alles funst ich habe jetzt ich habe jetzt 500 e gekauft vor zwei wochen ja funst noch alles exzellent du du du du du du du du ich bin begeistert ich meine das war jetzt sehr abartig wie viel reichweite also ich habe es noch nie leer gefahren also irgendwas so um 270 280 kilometer was das für ein wartungsintervall hat also wenn du vier fragst dann alle sieben bis achttausend kilometer ob ich das mache weiß ich nicht ich meine ich brauche dafür jeden jahr bis ich die gefahren bin oder so und muss nicht sein ich meine aber für firmware updates und so vielleicht weil du kannst nicht alles OTA updaten nee ich glaube es sind 7000 ich glaube es ist so was wie ein Jahr oder 7000 oder oder irgendwie so oder oder 7000 oder in den jahr irgendwie so ja du musst das auto die firmen wir mussten firmen wir updaten lassen in der werkstatt jetzt mal ernsthaft ich finde das ist halbwegs gut lesbar hier sogar guck mal ich mein man man versteht direkt was passiert es ist halt die api von fiat ist halt eklig es fack aber man versteht es und es funktioniert alles so wir können jetzt natürlich mit meinen credentials hier im stream nicht weitermachen also normalerweise müsste ich jetzt um weiter zu machen hier das austauschen durch meinen echten account und nicht durch diesen fake account weil naja der fake account hat ja keine autos registriert wie ihr hier seht aber es ist alles nicht schlimm denn ich habe schon eine ein anonymisierten response von meinem auto hier als jason feil die würde man jetzt also normalerweise läuft es jetzt so hier würde mir als antwort also habe ich im browser so gesehen also man kann ja browser network tab machen und im netzwerk tab von der seite kann man sich die die requests angucken also man bekommt hier eine fahrzeug id zurück und mit der fahrzeug id kann ich dann den weiteren request machen wo ich dann hier die ganzen vehikel infos bekomme wo dann unter anderem so sachen drinne stehen wie kilometerzähler wie weit muss ich fahren dass die batterie leer ist reifendruck öllevel was es nicht gibt driestatus und so ja und man kann über die api wohl auch klimaanlage und sowas einschalten was natürlich auch ganz nützlich ist was du machen kannst du kannst danach in deine heim automatisierung dein auto einbinden du kannst dann zum beispiel in deine heim automatisierung also einmal anzeigen lassen sachen wie ladet zustand von einer batterie bei wieviel prozent die ist wieviel kilometer du damit fahren kannst ob dein reifendruck ok ist und sowas kannst du dir alles anzeigen lassen und du kannst auch buttons machen zum beispiel zum vorklimatisieren vom auto also wenn du sagst ich fahre in fünf minuten los ist es 38 grad draußen ich würde schon mal die klimaanlage anmachen kannst hier einen button rein machen kannst du kannst du kannst total viel abfragen das weiß ich aus dem kopf gar nicht alles du kannst ab du kannst aufschließen abschließen das will ich würde ich jetzt aber nicht unbedingt empfehlen du kannst licht anmachen du kannst hupen das würde ich auch nicht unbedingt empfehlen du kannst du kannst ein paar sachen machen ich weiß aus dem kopf du kannst relativ viel machen ja du kannst zum beispiel gucken ob der stecker angesteckt ist also sprich ist der lade stecker angesteckt das siehst du hier dran an dem plug plug in status wenn das auf true steht kannst du sehen ok das ist angeschlossen dann kannst du halt gucken du kannst es dann beispielsweise sagen hey wenn es angeschlossen ist dann refresh mir alle viertel stunde mal und sagt mir dann alle viertel stunde wie voll jetzt der akku ist und dann kannst du gucken und wenn der akku voll ist und dann beispielsweise sagt hier charging status ist nicht mehr charging lässt du dir zum beispiel eine push notification schicken auto ist voll oder keine ahnung oder wie auch immer man darauf reagieren will oder du kannst dir ok sagen wir mal was realistischeres mal was realistischeres ja der liest aus wie voll die batterie ist und dann machst du eine automatisierung das wenn es keine ahnung ist es abends 21 uhr 22 uhr 23 du gehst ins bett das kriegt der home assistant mit je nachdem wenn es gescheit gemacht hast du gehst ins bett und sagen wir du hast vergessen das auto zu laden und laden und die batterie ist nur noch bei 30 prozent dann könnte die push notification schicken und sagen ey alter du bist grad ins bett aber dein auto ist noch bei 30 prozent batterie und es ist auch nicht eingesteckt und dann kannst du noch mal in hof flitzen und schnell anschließen über nacht aufladen alternativ kannst du dein auto auch morgen nicht wach hupen lassen ja das kannst du allerdings nur machen wenn nicht so viele leute drum herum wohnen wie bekommst du die daten später in home assistant rein über home assistant mqtt discovery bekomme ich die rein kannst du mit der api auch das laden pluppieren somit bis zu maximal 85 prozent laden aero zati weiß ich wie man es richtig ausspricht aber dankeschön für den zapp da bin ich mir gar nicht sicher was der unterstützt alles das einfachste dürfte sein du hast ein ladegerät was du ausschalten kannst remote dann würdest du es nämlich so machen das müsste man mal gucken also zum beispiel wir gucken mal beim iow broker rein was der hier unterstützt an ihr deep refresh zene charge anscheinend kann man das ein und ausschalten würde ich jetzt mal vermuten ok command update location warum über mqtt und nicht über die home assistant api weil es über mqtt viel viel einfacher ist finde ich kannst auch über die home assistant api machen wobei standardmäßig ist die htp api glaube ich sogar aus nicht standardmäßig die htp api sogar aus doch die ist standardmäßig aus doch die ist aus du kannst ihnen den rest denn so anlegen in der config zumindest über mqtt ist viel viel einfacher gerade auch wenn du zwei wenn du bidirektionale kommunikation brauchst weil ich mir gar nicht sicher bin ob ich das brauche in dem fall über mqtt ist wirklich simpel du kannst über mqtt auch die ich mach mal aus wir machen heute kein home assistant ok du kannst über mqtt das auch gruppieren lassen zu zu die weißes die dann sensoren drunter haben das ist viel wenn ich gehe noch nicht ins bett leute ich habe home assistant ausgemacht also es ist viel einfacher als über die api mit mqtt was natürlich noch einfacher wäre ist achso darksone machst gut was natürlich noch viel einfacher wäre ist wenn man eine direkte home assistant integration macht was gegen eine direkte home assistant integration für mich spricht ist erstens habe ich noch nie gemacht zweitens ich muss den kram in python programmieren mit sachen die ich noch nie verwendet habe hält sich mein spaß in grenzen und man kann container wenn es mal probleme gibt auch einfacher neu starten und wenn die fiat integration langsam ist aus irgendwelchen gründen macht es nicht meinen ganzen home assistant langsamer gut ich mein man muss man sollte die integration also die home assistant integrations e asynch laufen lassen aber trotzdem ist mir lieber zumal in home assistant addon auch easy ist du klickst den web interface addon installieren wählst das fiat addon aus und gut ist musst du noch deine muss nur noch user namen password hinzufügen also guck das sind die kommandos die man senden kann also man kann sagen unlock lock das weiß ich nicht ob ich das wirklich als button einbauen will ich will eigentlich mein auto nicht anlocken remote aber ok geht das über es geht immer übers internet der fiat hat ein lte sim karte mit lte drinne und darüber wird kommuniziert du kannst aber auch live die position abfragen also wenn irgendjemand mit deinem auto rum fährt dann kannst du gucken wo das gerade ist und sowas alles stalken also du kannst du kannst abschließen du kannst aufmachen du kannst die position abfragen du kannst das licht einschalten du kannst den kofferraum zumachen du kannst den kofferraum aufmachen du kannst strom anschalten strom ausschalten da steht zwar engine aber im prinzip ist strom an strom aus für die systeme innen drinne du kannst blinken lassen dass man sehen kann wo das auto gerade steht du kannst die alarmanlage ausschalten du kannst ihn laden lassen wenn er grad noch nicht lädt wie auch immer das funktionieren soll weil er lädt ja eigentlich immer wenn man einstöpselt das gibt es nicht du kannst die klimaanlage einschalten ich hoffe man kann damit die klimaanlage auch wieder ausschalten weil weil stellt euch mal vor ihr schaltet die klimaanlage ein weil ihr in fünf minuten los wollt dann ruft jemand an und sagt ach hier es fällt aus und dann bleibt die für immer an oder wie das kann das kann es ja nicht sein vielleicht vielleicht muss ich dann engine off senden wenn ich es ausschalten will die lade steckdose ist noch nicht in der garage aktuell lade ich noch aus der steckdose weil ich noch kein elektriker gefunden habe der mir das ding an die wand schraubt beziehungsweise das schrauben ist ja nicht das problem an die wand dass das kabel im keller anschließen hast du schon geschaut wie man das auto flaschen kann ja ich habe zumindest geschaut wie man man mit irgendwelchen debugger entran kommt um sachen auszulesen aber es gibt noch keine guten debugger für den neuen 500 e und was geht es gerade ich will mein neues auto in die heim automatisierung einbinden wir haben es zumindest schon geschafft heute das war tatsächlich erfolgreicher als ich gedacht habe wir haben es tatsächlich geschafft dass ich mich einloggen kann bei fiat über die api und dort meine autos abfragen kann mit einem fake account der keine autos hat aber ich logg mich hier im stream nicht mit meinem echtem echtem account ein doch die handwerks plattform gibt es schon aber das hat ja keiner hat er keine zeit ich meine ich habe ich habe bei sieben oder acht elektriker mittlerweile angerufen die haben alle wartezeiten von wochen eher monaten und bei einem habe ich angerufen und er meinte schon ganz am anfang deutsche deutsches kollege nicht da was was ich wollen habe ich schon was ist da los gut ist ja nicht schlimm erzählste mal habe ich ihm erzählt ja ich will mir ladegerät im hof installieren lassen und also ein elf kilowatt ladegerät bla bla bla und ob die das machen und dann meinten sie ja das machen sie und dann war die antwort nur noch da war die antwort darauf von ihm das wird das wird kosten das wird kosten 900 euro da habe ich mir gedacht okay dass er jetzt ein bisschen scam wenn er die sache noch nicht gesehen hat und keine ahnung hat was er machen muss dass er gleich sagen wird das wird kosten 900 euro da habe ich mir gedacht zu denen gehe ich nicht also das hat mir das war mir zu zu zu scam wenn das erste ist was die eine erzählt das wird kosten das weiß ich also das war wahrscheinlich der einzige der zeit hatte aber den will ich nicht und die anderen haben alle keine zeit ja natürlich 900 euro sind viel zu viel also ich meine realistisch betrachtet muss der muss dann verlängerungskabel legen und so ein kleine so eine kleine schalt wasserdichte schalt wasserdichte box an die wand machen und dort dann halt das verlängerungskabel anschließen mit dem mit mit der ladestation also das ist nicht schwer ich gehe davon aus es macht jeder elektriker easy in einer stunde oder so die box habe ich ja auch die habe ich ja schon da die muss sie muss ja nicht kaufen oder so die kabel kannst du noch selbst anschließen naja woran denn woran woran soll ich dir anschließen ich also es muss irgendjemand im keller an den kasten gehen ein kabel legen von dem kasten an das fenster dann am fenster vorbei in hof das geht aber das ist alles offen also da kommt man durch im hof muss er so eine kleine wasserdichte box hinsetzen und in der box muss er dann anschließen die die fünf kabel von der von der sobald die box da ist kann ich da selbst anschließen ja aber unten am schaltschrank irgendwelche verlängerungs dinger legen und eventuell noch eine sicherung einbauen und so das kann ich nicht oder sagen wir mal so ich könnte das wahrscheinlich schon aber erstens traue ich mich das nicht und zweitens muss das ja eh jemand machen der ahnung davon hat ich brauche keinen eigenen zähler ich habe doch in der in meiner ladestation steht doch drinne in meiner wallbox steht doch drinne wie viel er verbraucht ach es gibt extra strom tarife zum auto aufladen oder was oder wie schickt mal link blitz zeig mal zeig mal schickt mal nach was muss ich gucken also das heißt man braucht einen eigenen zähler ja aber wie eigener zähler das muss doch dann irgendeiner sein der von von dem von dem netzbetreiber wieder geeicht und und autorisiert und was auch immer ist okay zeig mal ja eh auto zu hause ökologisch laden gut ich meine das funktioniert mit jeder wallbox das muss ja keine spezielle sein das ist ja die wollen wahrscheinlich ihre eigenen sachen kaufen aber das ist natürlich blödsinn das geht natürlich mit jedem der muss nicht buddeln der kann einfach das durch durch durch leere rohr schieben ich habe ein leerrohr vom keller durch die wand in hof also der muss eigentlich nur das kabel anschließen ok ok das wäre natürlich wirklich sehr nice so was da muss ich mal schlaum machen ja und wie wo muss der zähler dann hin ich meine der muss ja wahrscheinlich hinter nee ok ich habe echt keine ahnung wie das wie das wie das funken soll ja ein verteiler dürfte die zähler sind jetzt nicht mehr so groß ich habe aber keine ahnung wie das dann funktioniert also das ist dann ein zweiter zähler der kommt dann quasi parallel zum jetzigen zähler von den stadtwerken oder wie das dann quasi auf dem stadtwerke zähler das drauf ist was ich im haus verbrauchen auf dem anderen das drauf ist was ich im auto verbrauche oder wie oder was oder wo ich habe keine ahnung wie das funktionieren soll aber ok muss ich mal muss ich mal gucken doch das wäre besser aber ich habe keine solar panels auf dem dach zur zeit also das werde ich mir nächstes jahr erst angucken so lange irgendwie muss ich gerade aufladen ja super ja da muss ich mal gucken was es da was es da gibt ja ja leute alles klar ich glaube das reicht für heute wir machen das nächste mal weiter aber schon mal pock dass das mit dem login funktioniert hat muss ich sagen sehr nice jetzt ist betke angesagt bis denn macht es gut zu ich hoffe euch hat es gefallen bis denn", "segments": [{"id": 1, "start": 60.0, "end": 84.76, "text": "So Leute moin, was ist denn jetzt für eine Keynote, ist Apple oder was?"}, {"id": 2, "start": 84.76, "end": 93.72, "text": "Wann ist denn das? Wann ist denn das?"}, {"id": 3, "start": 93.72, "end": 101.48, "text": "Vielleicht gucken wir uns das auch zusammen an. Jetzt? Also 19 Uhr oder was?"}, {"id": 4, "start": 101.48, "end": 108.32, "text": "Los geht das Event, 19 Uhr. Leute, wir können das nicht zusammen gucken."}, {"id": 5, "start": 108.32, "end": 114.04, "text": "Also ich kann das Bild nicht einblenden. Wenn ich das Bild einblende, dann ist G-Bade."}, {"id": 6, "start": 114.04, "end": 117.48, "text": "Es funktioniert nicht."}, {"id": 7, "start": 125.48, "end": 129.72, "text": "Nee, es funktioniert nicht. Ich kann das nicht einblenden. Dann gibt es, dann gibt es"}, {"id": 8, "start": 129.72, "end": 137.48, "text": "Streik. Dann müsst ihr, müsst ihr mir nebenbei erzählen, was es gerade spannendes gibt."}, {"id": 9, "start": 137.48, "end": 144.44, "text": "Wie lange geht denn das? Moment. Apple Event."}, {"id": 10, "start": 150.24, "end": 155.36, "text": "Nee, nee, nee, nee. Ich kann das nicht zeigen. Das geht nicht."}, {"id": 11, "start": 155.36, "end": 163.12, "text": "Finanzen.net, null, alter. 19 Uhr, was? Gut, es geht wahrscheinlich eineinhalb,"}, {"id": 12, "start": 163.12, "end": 169.4, "text": "zwei Stunden oder so. Ja, wie immer, wie immer. Nee, kann ich nicht gucken. Ich habe"}, {"id": 13, "start": 169.4, "end": 174.16, "text": "gerade überlegt, ob ich, ob ich es mir angucken soll und ein bisschen schwätzen"}, {"id": 14, "start": 174.16, "end": 178.12, "text": "dabei. Da können wir, könnten wir es zusammen gucken. Aber ich kann es nicht zeigen, ja."}, {"id": 15, "start": 178.12, "end": 183.76, "text": "Zeigt den Stream von jemand anderes. Der ist direkt streamt. Das streamt keiner"}, {"id": 16, "start": 183.76, "end": 190.4, "text": "direkt. Guck, zeig es euch. Das, das, das kannst du nicht streamen. Guck, die, die"}, {"id": 17, "start": 190.4, "end": 195.96, "text": "streamen alle nur sich. Also die, die labern dabei und gucken das auf dem zweiten"}, {"id": 18, "start": 195.96, "end": 202.64, "text": "Bildschirm. Man, das könnte ich auch machen, aber das ist ja pepega. Guck, die"}, {"id": 19, "start": 202.64, "end": 209.64, "text": "streamen alle nur sich. Die re-streamen das Event alle nicht. Aber das ist, das"}, {"id": 20, "start": 209.64, "end": 216.2, "text": "ist doof. Erzählt mir mal nebenbei, was passiert."}, {"id": 21, "start": 216.2, "end": 220.64, "text": "Da muss man wahrscheinlich eh nicht wirklich zugucken. Das ist, das ist"}, {"id": 22, "start": 220.64, "end": 227.28, "text": "wahrscheinlich jetzt im größten Teil. Was? Das kann ich mir nicht vorstellen, dass"}, {"id": 23, "start": 227.28, "end": 232.16, "text": "der das schaut. Der, der kann den Stream genauso wenig zeigen oder hat"}, {"id": 24, "start": 232.16, "end": 242.6, "text": "irgendeine Spezialgenehmigung. Ist das, ist das das Intro vom Apple Event?"}, {"id": 25, "start": 242.6, "end": 249.72, "text": "Weil, weil dann ist das, dann ist das mega, mega tost. Mal gucken, was mit den"}, {"id": 26, "start": 249.72, "end": 255.48, "text": "Leuten abgeht. Ich mein, vielleicht darf der das auch."}, {"id": 27, "start": 258.64, "end": 263.8, "text": "Guck, weil die streamen sich alle nicht. Also die streamen alle nicht, event, nicht,"}, {"id": 28, "start": 263.8, "end": 267.44, "text": "nicht das Event, die streamen alle sich."}, {"id": 29, "start": 267.44, "end": 274.56, "text": "Und ich kann mir auch nicht vorstellen, dass Lyric das streamt. Ich mein, der kann"}, {"id": 30, "start": 274.56, "end": 278.16, "text": "vielleicht das Intro zeigen oder so."}, {"id": 31, "start": 283.36, "end": 287.48, "text": "Oder ist das wirklich das Intro?"}, {"id": 32, "start": 289.96, "end": 294.4, "text": "Die zeigen doch kein, die zeigen doch kein, ach das ist Werbung, Keckl, das ist Ikea."}, {"id": 33, "start": 294.4, "end": 299.12, "text": "Ich wollte grad sagen, was ist, was ist mit dem, was ist mit Apple los?"}, {"id": 34, "start": 302.16, "end": 310.16, "text": "Lull. Also ich kann das nicht zeigen, ich, ich, ich sehe es nicht ein. Also ich, ich"}, {"id": 35, "start": 310.16, "end": 313.88, "text": "werde das auch, ich werde ja auch nichts riskieren. Bei Apple weißt du nie. Guckt,"}, {"id": 36, "start": 313.88, "end": 318.12, "text": "dann hat er vielleicht irgendeine, irgendeine Spezialabmachung. Ja, können wir"}, {"id": 37, "start": 318.12, "end": 323.2, "text": "uns Steve Apple angucken? Ne, Tim Apple. Ne, Steve Apple ist ja vorbei. Tim Apple. Können wir"}, {"id": 38, "start": 323.2, "end": 327.88, "text": "uns angucken? Aber gut, manche restreamen anscheinend wirklich. Ich hab keine Ahnung,"}, {"id": 39, "start": 327.88, "end": 335.12, "text": "wie das ist. Apple Event Restream. Also in den vergangenen Jahren waren die sehr, sehr"}, {"id": 40, "start": 335.12, "end": 339.72, "text": "pingelig, was Restreaming angeht."}, {"id": 41, "start": 343.2, "end": 347.04, "text": "Das werden wir nicht machen."}, {"id": 42, "start": 347.04, "end": 354.92, "text": "Ne, ich mach das nicht, hat Apple Pech. Die haben es einmal, haben sie es mir gegeben hier"}, {"id": 43, "start": 354.92, "end": 360.04, "text": "mit Strike im Stream. Ich mach das nicht mehr. Ansonsten hätten wir uns wirklich"}, {"id": 44, "start": 360.04, "end": 362.8, "text": "zusammen angucken können jetzt. Ich wusste gar nicht, dass das ist. Ich hab das"}, {"id": 45, "start": 362.8, "end": 365.88, "text": "überhaupt nicht mitgekriegt. Das war wahrscheinlich schon wieder zwei Monate"}, {"id": 46, "start": 365.88, "end": 370.36, "text": "bekannt, oder? Ich wusste es wahrscheinlich wieder als Einziger nicht."}, {"id": 47, "start": 370.36, "end": 381.32, "text": "Der Eichler, danke schön für den Sub. Okay, Chat, kommen wir mal zum heutigen Stream. Ihr"}, {"id": 48, "start": 381.32, "end": 385.28, "text": "könnt ja nebenbei mir, wer Apple Zeug guckt, kann mir nebenbei erzählen, was es"}, {"id": 49, "start": 385.28, "end": 390.04, "text": "spannendes gibt. Wie finden wir Apple im Stream? Das kann jede Apple finden, wie"}, {"id": 50, "start": 390.04, "end": 393.4, "text": "ihr ihr wollt. Ich war mal kurz Home Assistant Upgrade in der Zwischenzeit,"}, {"id": 51, "start": 393.4, "end": 399.08, "text": "wo ich euch was erzähle. Also ihr wisst ja, ich habe mir ein Fiat Elektroauto"}, {"id": 52, "start": 399.08, "end": 407.16, "text": "gekauft und es gibt keine Home Assistant Integration dafür. Die haben ein"}, {"id": 53, "start": 407.16, "end": 413.96, "text": "paar andere Sachen. Mein Desktop, der ist POG. POG G. Also die haben so Sachen wie"}, {"id": 54, "start": 413.96, "end": 421.56, "text": "BMW zum Beispiel oder Audi haben die glaube ich auch. Ne, Puls Audi. Also die"}, {"id": 55, "start": 421.56, "end": 429.24, "text": "haben ein paar, die guckt hier, die haben ein paar Audio Integrations hier. Reno haben sie. Also wenn"}, {"id": 56, "start": 429.24, "end": 436.04, "text": "ich hier irgendwie so ein Baguette Auto hätte, dann würde das funktionieren. Oder"}, {"id": 57, "start": 436.04, "end": 445.72, "text": "China-Chinesen-Autos oder so Zeug. Also nicht so viele. Aber ein paar offizielle"}, {"id": 58, "start": 445.72, "end": 452.96, "text": "Integrations haben die. Mach mal kurz die Dark-Dings raus. Flashbang. Also ein paar offizielle"}, {"id": 59, "start": 452.96, "end": 456.96, "text": "Integrations haben die für Autos, aber kein Fiat dabei. Wobei Fiat ja auch nicht"}, {"id": 60, "start": 456.96, "end": 466.48, "text": "wirklich Fiat ist, sondern das ist Fiat G Giddens. Das sind mehr, das ist nicht nur"}, {"id": 61, "start": 466.48, "end": 473.64, "text": "Fiat. So, deswegen habe ich mich mal schlau gemacht. Wie gesagt, ich mach mal kurz Home Assistant Upgrade in der Zwischenzeit."}, {"id": 62, "start": 473.64, "end": 483.72, "text": "Ich habe mich mal schlau gemacht und zwar, wie macht das die App? Also sprich, es gibt von Fiat,"}, {"id": 63, "start": 483.72, "end": 490.56, "text": "da müssen wir uns gleich einen Fake Account anlegen, um das ganze mal auszuprobieren. Login. Also Fiat hat"}, {"id": 64, "start": 490.56, "end": 496.56, "text": "einen Web Service und eine App. Und ich habe heute Mittag mal ein bisschen mitgeschnitten, was die so"}, {"id": 65, "start": 496.56, "end": 507.56, "text": "machen. Und ich muss sagen, es sieht machbar aus, dass sich den ihre API quasi zu zweck empfremden."}, {"id": 66, "start": 507.56, "end": 512.88, "text": "Wir machen uns jetzt einen Fake Account ohne Auto drinne, weil ich log mich hier bestimmt nicht mit"}, {"id": 67, "start": 512.88, "end": 517.08, "text": "meinen echten Credentials ein und ihr könnt dann mein Auto fernsteuern oder sowas. Das werden wir"}, {"id": 68, "start": 517.08, "end": 523.6, "text": "hier nicht machen. Also ich habe aber eine Response mitgeschnitten bei mir im Browser. Die habe ich"}, {"id": 69, "start": 523.6, "end": 527.56, "text": "anonymisiert. Die habe ich mir hier schon als JSON Datei hinkopiert. Das heißt, wir können die"}, {"id": 70, "start": 527.56, "end": 532.96, "text": "Home Assistant Integration testen. Aber erstmal gucken wir, wie man den Kram Batterie auslesen."}, {"id": 71, "start": 532.96, "end": 538.84, "text": "Also was du machen kannst, ist, nur mal so zum erklären, warum man das dann machen will. Also,"}, {"id": 72, "start": 538.84, "end": 545.56, "text": "du kannst, Moment, ich mache mal kurz die JSON Datei auf, dann kann ich es euch zeigen. Die Datei"}, {"id": 73, "start": 545.56, "end": 551.32, "text": "heißt keckel.json, da wissen wir schon Bescheid. Also, du kannst so Sachen auslesen, wie zum"}, {"id": 74, "start": 551.32, "end": 561.88, "text": "Beispiel Kilometerzähler. Kilometerstand kannst du auslesen. Du kannst, bisschen laut, oder? Passt"}, {"id": 75, "start": 561.88, "end": 568.2, "text": "eigentlich. Du kannst den Kilometerstand auslesen. Du kannst auslesen, wie viel Reichweite noch in"}, {"id": 76, "start": 568.2, "end": 573.6, "text": "der Batterie drinne ist, wie viel du noch aktuell fahren kannst. Du kannst Reifendruck auslesen,"}, {"id": 77, "start": 573.6, "end": 578.84, "text": "für jeden Reifen einzeln. Da kannst du dann quasi in deinem Dashboard, kannst du dann quasi sowas"}, {"id": 78, "start": 578.84, "end": 582.8, "text": "hier machen, mit einem Auto in der Mitte. Und dann kannst du dann quasi anzeigen, hier, der ist"}, {"id": 79, "start": 582.8, "end": 589.72, "text": "kaputt und die hier sind alle grün und sowas. Also Reifendruck kannst du auslesen, für jedes"}, {"id": 80, "start": 589.72, "end": 596.52, "text": "Rad einzeln. Batterieinfo kannst du auslesen und zwar, nee, Moment, das kommt später. Du kannst"}, {"id": 81, "start": 596.52, "end": 601.0, "text": "die, du kannst die letzten, den letzten Trip, also das letzte, was du gefahren bist, auslesen. Dann"}, {"id": 82, "start": 601.0, "end": 608.0, "text": "hast du quasi Automation History, an welchem Tag du wie viel gefahren bist. Dann kannst du auslesen,"}, {"id": 83, "start": 608.0, "end": 615.72, "text": "weil ich, warum, ich copypaste einfach das Jason rüber und zeig's euch, dann seht ihr's. Moment,"}, {"id": 84, "start": 615.72, "end": 625.04, "text": "Original Format hier. Gehen wir mal hier rüber, Visual Studio Code auf. Müssen wir jetzt eh"}, {"id": 85, "start": 625.04, "end": 629.28, "text": "einen Fake Account machen. Wir müssen, ich erzähl euch gleich, was wir machen. Verschiedene,"}, {"id": 86, "start": 629.28, "end": 634.2, "text": "verschiedene Sachen. Also hier, so, hier haben wir mal das, anonymisiert Jason von meinem Auto"}, {"id": 87, "start": 634.2, "end": 640.24, "text": "aus dem Browser. Also, du siehst zum Beispiel, wie gesagt, Kilometerzähler, das sind nicht 35.000,"}, {"id": 88, "start": 640.24, "end": 644.76, "text": "wie gesagt, anonymisiert, was ich im Browser mitgeschnitten hab von meinem Auto. So, dann"}, {"id": 89, "start": 644.76, "end": 651.24, "text": "siehst du, wie lange du noch fahren kannst, bis die Batterie leer ist. Äh, gut, Ölstand gibt's da"}, {"id": 90, "start": 651.24, "end": 657.36, "text": "natürlich nicht drin. Dann hast du Reifendruck, da siehst du vorne links, vorne rechts. Äh, nee."}, {"id": 91, "start": 657.36, "end": 668.8, "text": "Rear, Rear ist das, oder? Rear Right, Rear Left, Front, Front Right, Front Left. Also,"}, {"id": 92, "start": 668.8, "end": 675.2, "text": "vorne links, vorne rechts, hinten links, hinten rechts. Also, siehst du den Reifendruck,"}, {"id": 93, "start": 675.2, "end": 679.2, "text": "beziehungsweise du siehst, ob der Reifendruck okay ist. Das ist ja eigentlich das, was sich in der"}, {"id": 94, "start": 679.2, "end": 686.76, "text": "Regel interessiert. Äh, Spannung von der Batterie. Dann kannst du dir den letzten Trip anzeigen lassen,"}, {"id": 95, "start": 686.76, "end": 693.08, "text": "der hat zwei Zähler drinne, der sich immer resetet. Also, du kannst zum Beispiel automatische Statistik"}, {"id": 96, "start": 693.08, "end": 697.8, "text": "erstellen, an welchem Tag du wie viel gefahren bist. Beispielsweise heute, 45 Kilometer. Also,"}, {"id": 97, "start": 697.8, "end": 702.16, "text": "hier um die Ecke. Dann siehst du, wie lange du brauchst, bis du wieder in die Werkstatt fahren"}, {"id": 98, "start": 702.16, "end": 714.8, "text": "musst. Dann siehst du, wie viele Räder du dran hast. Für den Fall der Fälle, dass du das nicht"}, {"id": 99, "start": 714.8, "end": 723.76, "text": "weißt. Ich frag mich allen Ernstes, ob diese Api was... Die haben doch bestimmt Hardcoded 4,"}, {"id": 100, "start": 723.76, "end": 728.56, "text": "oder? Das ist doch Return 4. Die haben doch nicht wirklich einen Sensor, der ausliest,"}, {"id": 101, "start": 728.56, "end": 735.44, "text": "wie viele Räder da dran sind. Das ist Return 4, Hardcoded bei denen auf der Seite. Um an diese"}, {"id": 102, "start": 735.44, "end": 743.04, "text": "Api zu kommen, ist das Problem. Das ist keine offizielle Api. Da musste erst 50 Authentifizierungs-"}, {"id": 103, "start": 743.04, "end": 747.96, "text": "sachen durchmachen. Ich habe es nicht so hundertprozentig gecheckt. Das probieren wir jetzt mal aus."}, {"id": 104, "start": 747.96, "end": 755.2, "text": "Dann kannst du irgendwie Klimaanlage, Power Usage, blablabla, was sonst noch alles, keine Ahnung."}, {"id": 105, "start": 755.2, "end": 759.24, "text": "So, jetzt kommen ein paar interessante Sachen für Leute, die ein Elektroauto haben. Der Rest ist"}, {"id": 106, "start": 759.24, "end": 765.64, "text": "ja mehr oder weniger auch für andere verfügbar. Du kannst Charging Schedules einstellen, was"}, {"id": 107, "start": 765.64, "end": 769.36, "text": "wahrscheinlich kein Mensch benutzt. Aber hier siehst du zum Beispiel, der Batterie ist aktuell bei"}, {"id": 108, "start": 769.36, "end": 779.08, "text": "98%. Er ist angeschlossen... Also es gibt Level 1 Charging und Level 2 Charging. Level 1 Charging"}, {"id": 109, "start": 779.08, "end": 786.24, "text": "ist Kona Charging. 120 Volt. Hell yeah. Also bei uns in Deutschland wirst du eigentlich nur Level"}, {"id": 110, "start": 786.24, "end": 793.4, "text": "2 Charging an der Stelle sehen. Also er ist angeschlossen an 230 Volt. Plugin Status True,"}, {"id": 111, "start": 793.4, "end": 801.72, "text": "also sprich der Stecker ist drin. Minuten sind das hier. Minuten bis voll geladen. Also irgendwie,"}, {"id": 112, "start": 801.72, "end": 806.84, "text": "keine Ahnung, das ergibt keinen Sinn wie gesagt. Ich habe die Werte ein bisschen anonymisiert. Also"}, {"id": 113, "start": 806.84, "end": 812.48, "text": "sprich der braucht irgendwie noch 10 Stunden oder so bis er voll geladen ist. Er ist aktuell am"}, {"id": 114, "start": 812.48, "end": 819.8, "text": "Laden. Total Range mit dieser Ladung 290 Kilometer und insgesamt 320 Kilometer."}, {"id": 115, "start": 819.8, "end": 829.72, "text": "Gut, das hier braucht kein Mensch. Das war's. Also sowas kann man da abfragen. Excellent. So,"}, {"id": 116, "start": 829.72, "end": 834.24, "text": "die Sache ist bloß ein bisschen problematischer, erstmal an die Infos zu kommen. Also ich habe mir"}, {"id": 117, "start": 834.24, "end": 837.92, "text": "einmal diese Sachen aus dem Browser gezogen, dass wir heute Home Assistant Integration machen"}, {"id": 118, "start": 837.92, "end": 843.28, "text": "kann. Aber ich muss erstmal das Login auf die Reihe kriegen. Und das Login sieht wirklich"}, {"id": 119, "start": 843.28, "end": 849.0, "text": "extremst pepega aus. Da müssen wir uns gleich mal einen Fiat Fake Account erstellen und versuchen,"}, {"id": 120, "start": 849.0, "end": 854.88, "text": "ob ich das Login hin bekomme. Wie gesagt, das ist richtig pepega. Also ich habe mir das angeguckt."}, {"id": 121, "start": 854.88, "end": 866.68, "text": "Ich habe einen IO Broker Projekt gefunden, wo man abgucken kann und ich habe EVCC oder so heißt das"}, {"id": 122, "start": 866.68, "end": 870.96, "text": "glaube ich gefunden. Das ist für Leute, die Solarpanels haben. Da kann man auch mal spicken"}, {"id": 123, "start": 870.96, "end": 880.72, "text": "in der API, wie die das gemacht haben. Ich weiß gar nicht mehr, wie der Teil hier ist. Fiat,"}, {"id": 124, "start": 880.72, "end": 901.48, "text": "irgendwas Fiat. Ja. AP. Ja, hier. Ja, so Sachen stehen da drin. Die AP Keys, die haben die irgendwie"}, {"id": 125, "start": 901.48, "end": 907.32, "text": "aus der, aus der, ich wette mit euch die AP Keys haben sie aus der Android App. Die haben die Android"}, {"id": 126, "start": 907.32, "end": 911.24, "text": "App sich, die haben sich das APK geholt von der Android App, haben das dekompiliert und haben"}, {"id": 127, "start": 911.24, "end": 919.36, "text": "sich die AP Keys rausgeholt. Könnte ich wetten, dass es daher kommt. Ist die Musik zu laut oder"}, {"id": 128, "start": 919.36, "end": 925.32, "text": "passt das so? So und das Einloggen müssen wir halt ausprobieren. Also es gibt, es gibt quasi zwei"}, {"id": 129, "start": 925.32, "end": 930.4, "text": "Sachen. Warum habe ich hier so viel Zeug drauf? Also es gibt, es gibt zwei, mehrere Sachen, die"}, {"id": 130, "start": 930.4, "end": 937.48, "text": "wir machen. Erstes, wie geht das Login? Geil. Wie geht das Login auf, auf der Fiat Seite? Per API"}, {"id": 131, "start": 937.48, "end": 942.12, "text": "natürlich, nicht per Browser. Also was ich sehr ungern machen würde, ist einen Browser"}, {"id": 132, "start": 942.12, "end": 947.0, "text": "fernsteuern. Also irgendwie Puppetier oder so und einen Browser oder Selenium oder so was und einen"}, {"id": 133, "start": 947.0, "end": 951.0, "text": "Browser fernsteuern. Da bin ich nicht scharf drauf. Das muss schon irgendwie über diese API von denen"}, {"id": 134, "start": 951.0, "end": 956.68, "text": "gehen und man kann sich das hier auch abgucken, dass das, das funktioniert halbwegs. Ich zeige"}, {"id": 135, "start": 956.68, "end": 960.52, "text": "euch gleich mal grob, wie das funktioniert. Ich habe mir das vorhin schon angeguckt. Richtig pepeger"}, {"id": 136, "start": 960.52, "end": 970.24, "text": "Authentifizierungsprozess, aber hardcore. So und danach brauchen wir MQTT, HA-Integration und ja"}, {"id": 137, "start": 970.24, "end": 979.72, "text": "1.5 ist dann vier Zeug zu JSON umwandeln für Home Assistant. So in der Richtung. Wir probieren"}, {"id": 138, "start": 979.72, "end": 983.88, "text": "jetzt erstmal das Login hinzukriegen und wenn das Login funktioniert, weil wie gesagt, ich kann es"}, {"id": 139, "start": 983.88, "end": 987.36, "text": "halt nicht mit meinen echten Daten machen, sonst liege ich hier irgendwelche Session Talks und"}, {"id": 140, "start": 987.36, "end": 1001.6, "text": "ihr schließt mein Auto auf oder so. Serious Max, das ist ziemlich kacke. Also nicht von dir,"}, {"id": 141, "start": 1001.6, "end": 1025.36, "text": "aber dass es geht. So alles klar. Na ja, wie gesagt, ich glaube viele machen es halt auch,"}, {"id": 142, "start": 1025.36, "end": 1032.32, "text": "weil machen das ja nicht absichtlich, die merken es einfach nicht. Auf YouTube lade ich das nicht,"}, {"id": 143, "start": 1032.32, "end": 1036.32, "text": "das kann man sich als Wort angucken. Ich habe doch hier ein Archiv, da kann man noch alles nachgucken."}, {"id": 144, "start": 1036.32, "end": 1042.64, "text": "Ich lade das eh auf GitHub hoch, wenn es denn dann wirklich funktionieren sollte. LTE, beides,"}, {"id": 145, "start": 1042.64, "end": 1050.08, "text": "beides. Kannst beides machen. Der hat LTE drinne, das ist aber nur für drei Jahre inklusive,"}, {"id": 146, "start": 1050.08, "end": 1055.96, "text": "aber du kannst auch WLAN machen. Aber ich habe das ehrlich gesagt mit WLAN noch nicht ausprobiert."}, {"id": 147, "start": 1055.96, "end": 1061.72, "text": "Also ich habe den Dialog schon gesehen, um ihn mit WLAN zu verbinden, aber ich mache das bisher"}, {"id": 148, "start": 1061.72, "end": 1070.12, "text": "alles über LTE. Wenn das drei Jahre inklusive ist, werde ich das erstmal ausnutzen. Ach die,"}, {"id": 149, "start": 1070.12, "end": 1082.52, "text": "ach ich habe sie übrigens letztens installiert noch auf Stream. Guck mal hier vorbildlich wieder,"}, {"id": 150, "start": 1082.52, "end": 1111.72, "text": "vorbildlich unser Mod. Wollte ich gar nicht machen, das hier. Vorbildlich. Die Musik ist"}, {"id": 151, "start": 1111.72, "end": 1118.28, "text": "mir zu anstrengend gerade. Leute, ich brauche, ich brauche Massive, ja Relaxing. Exzellent."}, {"id": 152, "start": 1118.28, "end": 1145.72, "text": "Ulz sind zu. Was? Ulz sind zu übersichtlich und kurz. Exzellent Ulz. Du kannst aber auch"}, {"id": 153, "start": 1145.72, "end": 1157.0, "text": "Emoji Ulz machen. Gleich Massive Relaxing mehr jetzt die Musik hier. So alles klar."}, {"id": 154, "start": 1157.0, "end": 1168.24, "text": "Nein ich will nicht den Mailcheck Champ aufmachen. Ich will erstmal ein neues Projekt anlegen,"}, {"id": 155, "start": 1168.24, "end": 1179.84, "text": "weil wir gerade schon dabei sind. Repos, New, ne MK Dear, wie nennen wir das Ding? Pia Champ."}, {"id": 156, "start": 1179.84, "end": 1191.6, "text": "So New, Console. Okay, also achso ja ich habe noch eine Sache vergessen, die ich noch nie"}, {"id": 157, "start": 1191.6, "end": 1198.68, "text": "gemacht habe. Wir machen daraus eine Docker Home Assistant Addon. Habe ich noch nie gemacht,"}, {"id": 158, "start": 1198.68, "end": 1203.6, "text": "dann kann man das direkt über den Home Assistant App Store installieren. Das wollen wir nicht"}, {"id": 159, "start": 1203.6, "end": 1206.92, "text": "alles heute machen, das kann ich euch gleich schon sagen. Wahrscheinlich wird mich der Login schon"}, {"id": 160, "start": 1206.92, "end": 1211.92, "text": "übelst abfacken, aber irgendwann muss man mal anfangen. Und in dem Fall habe ich tatsächlich"}, {"id": 161, "start": 1211.92, "end": 1216.8, "text": "auch ein gewisses eigenes Interesse daran das fertigzustellen, weil ich brauche das selbst"}, {"id": 162, "start": 1216.8, "end": 1223.96, "text": "für mein Auto. Für Haxe, ne nicht für Haxe. Haxe sind ja nur Python Integrations, Docker,"}, {"id": 163, "start": 1223.96, "end": 1229.76, "text": "die Docker Integrations, also sprich ich wollte Home Assistant Update machen, fällt mir nicht"}, {"id": 164, "start": 1229.76, "end": 1250.84, "text": "gerade auf. Muss ich mal machen, 2, 1, was? 1, 3, 2. Das ist Zappix. 8, 1, 2, 3. Qta, alles klar. Also so war es hier, guck. Addons. So einen Addon gibt"}, {"id": 165, "start": 1250.84, "end": 1257.16, "text": "das dann. Kannst du dafür dann Fiat installieren. Was hast du alles in meinem Smartphone drin?"}, {"id": 166, "start": 1257.16, "end": 1268.6, "text": "Du kannst mal bei mir auf... Du kannst mal bei mir auf... Ist es schlimm, dass Safe Search"}, {"id": 167, "start": 1268.6, "end": 1275.4, "text": "deaktiviert ist? Die Ergebnisse können nackt, teigt, sexuell, inhalt und anstößige Safe"}, {"id": 168, "start": 1275.4, "end": 1285.12, "text": "Search Einstellungen verwalten. 1, ok. Wir wollen hier keinen Gatschi-Buzz haben. Hier,"}, {"id": 169, "start": 1285.12, "end": 1292.2, "text": "du kannst mal bei mir auf YouTube gucken im Video. Ich zeige ein bisschen was, wobei,"}, {"id": 170, "start": 1292.2, "end": 1295.76, "text": "wie gesagt, ich zeige nicht alles und mittlerweile ist natürlich wie immer noch ein bisschen"}, {"id": 171, "start": 1295.76, "end": 1299.88, "text": "mehr drin, ein paar Sachen sind weggekommen, aber du kannst hier so mal grob gucken, so"}, {"id": 172, "start": 1299.88, "end": 1308.0, "text": "ein paar Sachen zeige ich hier im Video. Wobei, so viel zeige ich gar nicht. So und dann gibt"}, {"id": 173, "start": 1308.0, "end": 1315.04, "text": "es noch das Video. Dann gibt es noch das da. Was ist auf meinem Home Server? Da zeige"}, {"id": 174, "start": 1315.04, "end": 1320.36, "text": "ich auch... Guck, hier zeige ich meinen Home Assistant. Da, das kannst du gucken. Aber"}, {"id": 175, "start": 1320.36, "end": 1329.88, "text": "wie gesagt auch nicht alles. Nur so ein paar Sachen. Genau, wir müssen mal kurz nebenbei"}, {"id": 176, "start": 1329.88, "end": 1336.68, "text": "updaten Home Assistant Core installen. Jawoll, gib ihm. Ok, also wir machen uns jetzt mal"}, {"id": 177, "start": 1336.68, "end": 1345.4, "text": "ein Fiat-Fake-Account. 10-Minute-Mail. Mal gucken, ob die 10-Minute-Mail überhaupt zulassen."}, {"id": 178, "start": 1345.4, "end": 1360.76, "text": "Perfekt. Fiat-Uconnect-Login. Einmal Fake-Account-Blitz. Das muss ich wegmachen, die Seite ist zu"}, {"id": 179, "start": 1360.76, "end": 1367.72, "text": "langsam mit Dark Reader. Äh, registrieren. Ich mach den Account danach auch wieder weg."}, {"id": 180, "start": 1367.72, "end": 1377.6, "text": "So, Deutschland. Vorname, Keck. L. E-Mail. Wie? Der Nachname darf nur Buchstaben enthalten,"}, {"id": 181, "start": 1377.6, "end": 1388.8, "text": "muss mindestens zwei Zeichen lang sein. So, perfekt. So heißen, so glaub normale Leute"}, {"id": 182, "start": 1388.8, "end": 1395.44, "text": "können schon mal so heißen. So, Passwort. Passwort, muss ich mal kurz eins ausdenken."}, {"id": 183, "start": 1395.44, "end": 1416.64, "text": "Ok. Nein, nein, das da nicht. Oh man, ich hab zu viel... Alter, jetzt sind auch noch"}, {"id": 184, "start": 1416.64, "end": 1428.6, "text": "die Zeichen zu lang. Ich fass es nicht. 1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11. Das ist"}, {"id": 185, "start": 1428.6, "end": 1444.08, "text": "ja nix. Ok, dann machen wir jetzt nochmal neu. Oh man, geht man nicht auf den Sack. Wo ist"}, {"id": 186, "start": 1444.08, "end": 1472.8, "text": "denn das Problem? Mein Passwort ist zu lang. Ok, jetzt aber. Ich hoffe jetzt passt das."}, {"id": 187, "start": 1472.8, "end": 1479.92, "text": "Ich finde die Längenbegrenzung ist so unsinnig. Ich mein, ok, man könnte sagen 60 Stellen"}, {"id": 188, "start": 1479.92, "end": 1484.0, "text": "sind vielleicht ein bisschen lang, aber ansonsten, ich mein, warum nicht? Nein, nein, nein, nein,"}, {"id": 189, "start": 1484.0, "end": 1493.08, "text": "wir lehnen alles ab, alles ab. Alter. Ok, zum Dashboard wechseln. Jetzt kriege ich..."}, {"id": 190, "start": 1493.08, "end": 1498.2, "text": "Ja, speichern wir mal, vergesse ich eh. Äh, gucken wir uns mal die Bestätigungs-E-Mail"}, {"id": 191, "start": 1498.2, "end": 1510.48, "text": "an. Konto verifizieren. Excellent. Ihr Konto aktivieren. Accept. Konto ist activated. Leute,"}, {"id": 192, "start": 1510.48, "end": 1518.48, "text": "Konto activated. Oder auch nicht. Keine Ahnung. Vielleicht braucht das einfach ein bisschen,"}, {"id": 193, "start": 1518.48, "end": 1526.96, "text": "bis das Konto activated ist. So, und jetzt passt mal auf. Diese Login-Geschichten sind"}, {"id": 194, "start": 1526.96, "end": 1532.4, "text": "wirklich extrem... Ich dachte schon, ich bin gerade mit meinem Account drin, weil da der"}, {"id": 195, "start": 1532.4, "end": 1540.88, "text": "500 da drin steht. So, also dieses Login müssen wir jetzt nachbauen. Und ich sage euch, Leute,"}, {"id": 196, "start": 1540.88, "end": 1550.44, "text": "das wird abartig. Ähm, kurz nochmal öffnen. Was ist denn mit meinem Rider los? Sag mal,"}, {"id": 197, "start": 1550.44, "end": 1557.48, "text": "was fehlt? Ich wollte gerade sagen, da fehlt doch was. Wir müssen das nachbauen. Naja,"}, {"id": 198, "start": 1557.48, "end": 1564.24, "text": "wie willst du dich sonst einloggen, wenn du das Login nicht nachbaust? Kannst du dich"}, {"id": 199, "start": 1564.24, "end": 1569.84, "text": "nicht einloggen? Das Einzige, was du machen kannst, ist Browser fernsteuern und hoffen,"}, {"id": 200, "start": 1569.84, "end": 1573.64, "text": "dass alles funktioniert. Aber das will ich nicht. Ich will kein Browser fernsteuern."}, {"id": 201, "start": 1573.64, "end": 1583.2, "text": "Nee, hab ich keinen Bock drauf. Machen wir das jetzt so. Okay, und zwar wir können uns"}, {"id": 202, "start": 1583.2, "end": 1590.64, "text": "das hier abgucken. Leute, es ist richtig, es ist hardcore eklig, diese Authentifizierung"}, {"id": 203, "start": 1590.64, "end": 1595.6, "text": "barfiert. Also ich zeige euch mal, ich hab's mir im Vorfeld ja schon angeguckt. Also guckt"}, {"id": 204, "start": 1595.6, "end": 1601.76, "text": "mal was, also erst mal, haben die zig verschiedene Wurls? Also, okay, ich versuch's euch mal"}, {"id": 205, "start": 1601.76, "end": 1607.48, "text": "so grob zu erklären, wie ich das verstanden hab. Also, es gibt die Fiat API, es gibt das"}, {"id": 206, "start": 1607.48, "end": 1614.0, "text": "Fiat Authentifizierungsportal, es gibt AWS Authentifizierung und es gibt dann am Ende"}, {"id": 207, "start": 1614.0, "end": 1623.8, "text": "ein Fiat Access Token, mit dem man die API benutzen kann. Also das ist wirklich ganz,"}, {"id": 208, "start": 1623.8, "end": 1629.56, "text": "ganz grausam. So, ich versuch euch das mal kurz hier zu zeigen in diesem Beispiel. Oder"}, {"id": 209, "start": 1629.56, "end": 1638.08, "text": "wir können es auch in dem JavaScript Beispiel, ich zeig's euch mal in dem Go Beispiel, ich"}, {"id": 210, "start": 1638.08, "end": 1642.32, "text": "finde das ist ein bisschen schöner zu sehen. Also, wo ist hier der Login? Login, okay,"}, {"id": 211, "start": 1642.32, "end": 1648.52, "text": "also es fängt schon mal folgendermaßen an. Als erstes muss man einen Request machen hier"}, {"id": 212, "start": 1648.52, "end": 1655.64, "text": "auf die fiat url slash accounts web sdk bootstrap. Allein schon das sollte irgendwie einen kleinen"}, {"id": 213, "start": 1655.64, "end": 1663.56, "text": "Hinweis darauf geben, dass das nicht die offizielle API ist, die dafür gedacht ist, dass die jeder"}, {"id": 214, "start": 1663.56, "end": 1671.88, "text": "verwendet. So, dann muss man hier einen Webrequest machen und diese komischen magic Parameter"}, {"id": 215, "start": 1671.88, "end": 1676.4, "text": "angeben, dass es funktioniert. Mit dem API Key, den sie wahrscheinlich aus der Android"}, {"id": 216, "start": 1676.4, "end": 1682.68, "text": "App extrahiert haben oder so, keine Ahnung, ich klau mir den hier einfach. So, dann muss"}, {"id": 217, "start": 1682.68, "end": 1689.48, "text": "man hier noch Zeug angeben, dann bekommt man hier als Antwort von dem Request irgendwelche"}, {"id": 218, "start": 1689.48, "end": 1698.68, "text": "JSON Objekte. Wenn man dann die Antwort hiervon hat, kann man einen weiteren Request machen"}, {"id": 219, "start": 1698.68, "end": 1704.44, "text": "auf Accounts login, da muss man dann noch mehr Zeug übergeben, da muss man dann unter anderem"}, {"id": 220, "start": 1704.44, "end": 1710.08, "text": "auch, also der erste Request ist nur dazu da, soweit ich das verstanden hab, die Cookies"}, {"id": 221, "start": 1710.08, "end": 1715.72, "text": "zu holen. Also man muss diesen ersten Request nur machen, dass die Cookies initial gefüllt"}, {"id": 222, "start": 1715.72, "end": 1720.92, "text": "werden, dass man initial paar Cookies bekommt, dass es dann weiter geht danach. Danach macht"}, {"id": 223, "start": 1720.92, "end": 1730.4, "text": "man den nächsten Request und diesmal mit Login ID, Passwort, API Key, Java, Gedöns, irgendwelche"}, {"id": 224, "start": 1730.4, "end": 1740.56, "text": "Include, Profile, Data, E-Mails, keine Ahnung, User Info, brauchen wir alles nicht, Login"}, {"id": 225, "start": 1740.56, "end": 1747.08, "text": "Mode, Standard, Language, DE0DE, Mindblown, kein Schimmer. So und wenn das dann durch"}, {"id": 226, "start": 1747.08, "end": 1755.52, "text": "ist, dann bekommt man eine ID und diese ID braucht man, das ist die Unique ID für deinen"}, {"id": 227, "start": 1755.52, "end": 1761.28, "text": "User, mit dem du dich eingeloggt hast, weiterhin ist wichtig, dass du alle Cookies in deinem"}, {"id": 228, "start": 1761.28, "end": 1766.88, "text": "Cookie Top speicherst, dass es weiter geht danach. Wenn du diesen Request gemacht hast,"}, {"id": 229, "start": 1766.88, "end": 1770.52, "text": "also das ist in der Theorie, ich hab's ja noch nicht ausprobiert, theoretisch funktioniert"}, {"id": 230, "start": 1770.52, "end": 1778.8, "text": "das so, so wenn du das gemacht hast, dann machst du einen weiteren Request, das ist wirklich"}, {"id": 231, "start": 1778.8, "end": 1785.12, "text": "die komplizierteste Authentifizierung, die ich je gesehen hab im Leben. Danach machst"}, {"id": 232, "start": 1785.12, "end": 1790.12, "text": "du einen weiteren Request um einen JSON Web Token zu erhalten und dann brauchst du deine"}, {"id": 233, "start": 1790.12, "end": 1795.56, "text": "angeforderten Credentials eingeben, einstellen die du haben willst, wieder den API Key übergeben"}, {"id": 234, "start": 1795.56, "end": 1800.64, "text": "und immer schön die Cookies verwenden, immer schön die Cookies verwenden vom letzten Request,"}, {"id": 235, "start": 1800.64, "end": 1806.08, "text": "so und dann bekommt man hier irgendwann ein Objekt zurück, in diesem Objekt ist ein Token"}, {"id": 236, "start": 1806.08, "end": 1813.16, "text": "und eine Identity ID und dieses Token, wenn ihr, Moment, chat, wenn ihr denkt, wir sind"}, {"id": 237, "start": 1813.16, "end": 1819.8, "text": "jetzt fertig, jetzt geht's erst richtig los, jetzt geht's erst richtig los mit dem Logging,"}, {"id": 238, "start": 1819.8, "end": 1829.48, "text": "weil jetzt kommt noch, jetzt kommt noch AWS, jetzt kommt noch AWS Request zu Amazon gleich,"}, {"id": 239, "start": 1829.48, "end": 1837.04, "text": "also danach bekommt man ein Token und eine Identity ID und die braucht man dann wiederum,"}, {"id": 240, "start": 1837.04, "end": 1846.8, "text": "um einen Request zu machen zu Amazon, nämlich, das ist ein Amazon AWS Cognito Identity Service"}, {"id": 241, "start": 1846.8, "end": 1852.48, "text": "Request, den wir jetzt machen muss, dazu braucht man das Token und die Ident ID, die man bekommen"}, {"id": 242, "start": 1852.48, "end": 1861.04, "text": "hat und dann kann man zu AWS gehen und sich dort dann ein Token abholen, mit dem man,"}, {"id": 243, "start": 1861.04, "end": 1868.96, "text": "wenn man das dann hat, in Verbindung mit der ID von ganz hier oben auf die rechtlichen APIs"}, {"id": 244, "start": 1868.96, "end": 1874.44, "text": "zugreifen kann, ich weiß nicht genau, wer sich das ausgetacht hat, bei Fiat, aber so"}, {"id": 245, "start": 1874.44, "end": 1882.84, "text": "ist es anscheinend und das müssen wir jetzt versuchen, irgendwie nachzubauen, ach ja,"}, {"id": 246, "start": 1882.84, "end": 1886.68, "text": "zwischendurch müssen wir auch irgendwelche AWS Request, jetzt ist mir die Musik doch"}, {"id": 247, "start": 1886.68, "end": 1895.2, "text": "ein bisschen zu Relaxing, haben wir nicht noch, haben wir noch irgendwie Top Mario Songs haben"}, {"id": 248, "start": 1895.2, "end": 1907.28, "text": "wir doch hier immer, ja genau, exzellent, wir müssen nicht C und C Sharp Go Interop machen,"}, {"id": 249, "start": 1907.28, "end": 1914.12, "text": "wir bauen das, wir bauen das in C Sharp nach, ich habe AWS in.NET noch nie verwendet,"}, {"id": 250, "start": 1914.12, "end": 1921.16, "text": "wobei das stimmt nicht, doch habe ich, aber nie wirklich um was damit zu bauen und wie"}, {"id": 251, "start": 1921.16, "end": 1927.32, "text": "das hier funktioniert, hat schon jemand mal AWS Request gesigned mit.NET, ich weiß noch"}, {"id": 252, "start": 1927.32, "end": 1931.72, "text": "nicht mal, was das überhaupt bedeutet, also ich bin gespannt, ob wir dieses Login hinbekommen,"}, {"id": 253, "start": 1931.72, "end": 1937.0, "text": "wir können sowohl hier abgucken, wie das funktioniert, wir können aber auch hier abgucken,"}, {"id": 254, "start": 1937.0, "end": 1940.96, "text": "wie das funktioniert, also wir haben hier zwei Alternativen, wenn es nicht funktioniert,"}, {"id": 255, "start": 1940.96, "end": 1946.96, "text": "können wir es uns abgucken, einmal in dem IO Broker Plugin oder einmal hier drinnen,"}, {"id": 256, "start": 1946.96, "end": 1952.04, "text": "ok auf geht's, also wir Copy Paste uns erstmal die ganzen AP Keys, weil die brauchen wir"}, {"id": 257, "start": 1952.04, "end": 1959.96, "text": "auf jeden Fall, erstmal AP Keys abrippen und die Connect World brauchen wir garantiert"}, {"id": 258, "start": 1959.96, "end": 1975.72, "text": "auch, so War AP Key, Login AP Key, ok den gibt es anscheinend auch, ja 4 Uhr, also Leute"}, {"id": 259, "start": 1975.72, "end": 1980.16, "text": "ich habe keine Ahnung, ob das was wird, ich bin wirklich schon happy, wenn ich das hier"}, {"id": 260, "start": 1980.16, "end": 2010.12, "text": "schaffe nach dieser Schatzsuche mich einzuloggen, LEAKED, OMFG Alter, OMFG, LEAKED,"}, {"id": 261, "start": 2010.12, "end": 2015.2, "text": "ich bin gerade am überlegen, wie wir das am besten machen, wir machen das mal, wir machen"}, {"id": 262, "start": 2015.2, "end": 2029.36, "text": "das schonmal richtig 6 Head Object Orientated, jetzt hier, Class, Fiat, Client oder so, bisschen"}, {"id": 263, "start": 2029.36, "end": 2045.6, "text": "laut, die Musik passt wieder exzellent dazu, ok Fiat Client, also was brauchen wir, wir"}, {"id": 264, "start": 2045.6, "end": 2056.96, "text": "brauchen auf jeden Fall, ich kann ja mal schreiben, wir brauchen ein String, User, String, Passwort,"}, {"id": 265, "start": 2056.96, "end": 2061.08, "text": "das ist schon mal relativ klar, User Name und Passwort, so und dann brauchen wir so"}, {"id": 266, "start": 2061.08, "end": 2071.92, "text": "wie Public, Public Key, Alter, ich kann heute nicht schreiben, Public, was ist, sag mal Public,"}, {"id": 267, "start": 2071.92, "end": 2076.12, "text": "was genau möchtest du in deinem Home Assistant integrieren, integriert mein Auto, ich will"}, {"id": 268, "start": 2076.12, "end": 2081.96, "text": "beispielsweise meinen Kilometerzähler sehen, meinen Reifendruck sehen, wie voll die Batterie"}, {"id": 269, "start": 2081.96, "end": 2085.64, "text": "geladen ist und sowas und es gibt für Fiat keine Integration, deswegen baue ich jetzt"}, {"id": 270, "start": 2085.64, "end": 2091.88, "text": "für Fiat eine Integration, beziehungsweise für Fiat, das geht Fiat und Jeep und alles"}, {"id": 271, "start": 2091.88, "end": 2097.2, "text": "was Uconnect verwendet, geht dann hoffentlich, ich kann es halt nur mit meinem Auto ausprobieren,"}, {"id": 272, "start": 2097.2, "end": 2111.88, "text": "ok Login, sag mal, ok, Void, Login, wir brauchen ein HTTP Client, also auf jeden Fall SYNC,"}, {"id": 273, "start": 2111.88, "end": 2118.64, "text": "und auch Task, so, also wie machen wir jetzt das Login, jetzt wirds, jetzt wirds spannend,"}, {"id": 274, "start": 2118.64, "end": 2129.68, "text": "also New Fiat Client, ja Passwort und User, muss ich mal gucken wo ich das verstecke gleich,"}, {"id": 275, "start": 2129.68, "end": 2134.48, "text": "dass ihr das nicht seht, weil auch wenn das ein Fake Ding ist, ich will es trotzdem nicht"}, {"id": 276, "start": 2134.48, "end": 2139.92, "text": "im Klartext reinschreiben, kann man, kann man eigentlich den Fiat Account wieder löschen,"}, {"id": 277, "start": 2139.92, "end": 2153.56, "text": "so doof gefragt, kann man in meinem Profil, meint ihr, meint ihr man kann den Account"}, {"id": 278, "start": 2153.56, "end": 2164.48, "text": "wieder löschen, wahrscheinlich nicht oder, das ist nicht im Scope, dass man den Account"}, {"id": 279, "start": 2164.48, "end": 2184.96, "text": "wieder löscht, ne, den Account kann man nicht wieder löschen, man kann sich bei 3000 Social"}, {"id": 280, "start": 2184.96, "end": 2195.8, "text": "Media Sachen anmelden, aber den Account löschen ist nicht, ist nicht vorgesehen, Account löschen"}, {"id": 281, "start": 2195.8, "end": 2200.72, "text": "gibt es nicht, sonst hätte ich den Account halt direkt danach wieder gelöscht, aber"}, {"id": 282, "start": 2200.72, "end": 2208.12, "text": "vielleicht löschen ist ja automatisch wenn man die E-Mail nicht, war der Account deaktivieren"}, {"id": 283, "start": 2208.12, "end": 2232.6, "text": "echt, wo, ne, ne, deaktivieren, ach hier unten, Alter ist das versteckt, MonkaS, das"}, {"id": 284, "start": 2232.6, "end": 2246.68, "text": "ist echt, ich mein ernsthaft, what the fuck, Alter wie versteckt ist das, ne kann ich"}, {"id": 285, "start": 2246.68, "end": 2251.92, "text": "doch nicht, vielleicht, vielleicht nach dem Stream, so, also schauen wir uns mal, wie"}, {"id": 286, "start": 2251.92, "end": 2257.16, "text": "können wir uns jetzt einloggen, also fangen wir mal an, das erste was wir machen müssen"}, {"id": 287, "start": 2257.16, "end": 2263.0, "text": "für den Login ist ein Request hier rauf, ich copy paste mir das jetzt einfach mal,"}, {"id": 288, "start": 2263.0, "end": 2268.48, "text": "ich copy paste mir das jetzt mal hier hin und dann gucken wir mal wie wir das hier nachgebaut"}, {"id": 289, "start": 2268.48, "end": 2276.84, "text": "bekommen, das da will ich copy paste, so, wie wir das hier nachgebaut bekommen, ich"}, {"id": 290, "start": 2276.84, "end": 2282.28, "text": "will es nicht eins zu eins nachbauen, ich will bloß wissen wie es funktioniert, also,"}, {"id": 291, "start": 2282.28, "end": 2296.68, "text": "dann installieren wir mal einen ordentlichen Webclient, ok, fiatclient login, await, tackle,"}, {"id": 292, "start": 2296.68, "end": 2303.04, "text": "das ist erstmal egal, weil noch, ich will auch mal die Fehlermeldung sehen, ach ne, Moment,"}, {"id": 293, "start": 2303.04, "end": 2310.04, "text": "da oben, muss ich das hier eingeben, Username, Passwort, so, also, fiatclient login, alles"}, {"id": 294, "start": 2310.04, "end": 2315.68, "text": "klar, so, wie funktioniert das jetzt, wir brauchen wahrscheinlich, welche URL brauchen"}, {"id": 295, "start": 2315.68, "end": 2338.48, "text": "wir denn jetzt zum Login, login-URL-URI, login-URI ist das da, ok, login-URL, ok, aber"}, {"id": 296, "start": 2338.48, "end": 2345.76, "text": "das weg, das brauchen wir wahrscheinlich nicht und das muss auch in die Klasse rein, einfach"}, {"id": 297, "start": 2345.76, "end": 2362.36, "text": "eine böse DSGVO-Mail schreiben, ja, auf italienisch, wenn schon dann richtig, private, dring, api-key,"}, {"id": 298, "start": 2362.36, "end": 2383.0, "text": "also, ok, also, login-URL, append, nee, path, nee, add, nee, wie ging das nochmal, was mit"}, {"id": 299, "start": 2383.0, "end": 2405.84, "text": "pass, append-path-segment ist es genau, accounts-bootstrap, dann brauchen wir cookies, cookies, cookies,"}, {"id": 300, "start": 2405.84, "end": 2415.04, "text": "nochmal müssen wir uns speichern, es gibt jetzt eine Apple Watch Ultra, na geil, use cookies,"}, {"id": 301, "start": 2415.04, "end": 2423.6, "text": "cookies, irgendwas mit cookies, und was ist an der so viel geiler, die ist jetzt mega"}, {"id": 302, "start": 2423.6, "end": 2431.88, "text": "fett oder wie, das ist gut, chat, das ist doch optimal, guck mal, wir können hier ein"}, {"id": 303, "start": 2431.88, "end": 2436.76, "text": "bisschen basteln und nebenbei kriegen wir sogar noch die News aus dem Apple Stream mit,"}, {"id": 304, "start": 2436.76, "end": 2446.8, "text": "ok, also, sehe ich das soweit richtig, also, account, dahin müssen wir ein Request machen"}, {"id": 305, "start": 2446.8, "end": 2453.64, "text": "mit, dass wir uns die Cookies speichern, dann müssen wir glaube ich den api-key noch setzen,"}, {"id": 306, "start": 2453.64, "end": 2472.16, "text": "ok, set, parameters, api-key, nee, wie wird da geschrieben, ich traue diesem Go Zeug immer"}, {"id": 307, "start": 2472.16, "end": 2476.12, "text": "nicht, weil Go serialisiert das Chasen und unter der Haube sieht es dann anders aus,"}, {"id": 308, "start": 2476.12, "end": 2490.76, "text": "wo ist denn hier das login, login, ach du scheiße, javascript please, login, api-key,"}, {"id": 309, "start": 2490.76, "end": 2498.48, "text": "guck so muss man es nämlich schreiben, api-key, wir brauchen auch nicht diesen api-key, wir"}, {"id": 310, "start": 2498.48, "end": 2507.88, "text": "brauchen den login api-key, ok, api-key, login api-key, na mal gucken ob das was wird, jetzt"}, {"id": 311, "start": 2507.88, "end": 2514.28, "text": "bin ich echt gespannt, so, haben wir das jetzt alles, ok, da muss man diesen Crap da unten"}, {"id": 312, "start": 2514.28, "end": 2522.28, "text": "dran schreiben, wir probieren mal ob es ohne geht, wir gucken mal ob es ohne geht, mal schauen"}, {"id": 313, "start": 2522.28, "end": 2527.04, "text": "was da jetzt als Request zurückkommt, ich bin mal, ich bin gespannt, was da jetzt raus"}, {"id": 314, "start": 2527.04, "end": 2543.04, "text": "kommt, ok, machen wir eben keine Ahnung, login-response, get-string, so, schauen wir mal was da als Antwort"}, {"id": 315, "start": 2543.04, "end": 2561.16, "text": "kommt, bin mal gespannt, run, schauen wir mal, ja auf, ah, ich hab es nicht erwartet, mal"}, {"id": 316, "start": 2561.16, "end": 2568.32, "text": "gucken was da als Antwort jetzt kommt, ey guck mal, da kommt sogar was, status ok, wie"}, {"id": 317, "start": 2568.32, "end": 2578.2, "text": "das jetzt einfach funktioniert oder was, da hätt ich jetzt ehrlich gesagt nicht mit gerechnet,"}, {"id": 318, "start": 2578.2, "end": 2585.84, "text": "aber wir machen jetzt sixhead-time, guck mal, quicktype, io, wir lassen uns daraus jetzt"}, {"id": 319, "start": 2585.84, "end": 2595.88, "text": "in.net-typ generieren, fivehead, bam, so, da bis jetzt funktioniert es, so machen wir"}, {"id": 320, "start": 2595.88, "end": 2603.84, "text": "mal hier eine neue Klasse für dieses Fiat, Fiat-Gedöns, Fiat-RP-Response, nennen wir"}, {"id": 321, "start": 2603.84, "end": 2623.04, "text": "das einfach mal als Base oder so, ja wunderbar, also dann können wir jetzt auch sagen get,"}, {"id": 322, "start": 2623.04, "end": 2641.32, "text": "Jason Async, Fiat-RP-Response und dann kann ich hier auch drauf zugreifen, ja, nice, wie"}, {"id": 323, "start": 2641.32, "end": 2645.44, "text": "gut ist der Browser Vivaldi, ich finde ihn eigentlich ganz nice, aber ich verwende ihn"}, {"id": 324, "start": 2645.44, "end": 2652.04, "text": "selten, klingt jetzt zwar merkwürdig, aber tja, so ist es halt, so und was ist mit diesem"}, {"id": 325, "start": 2652.04, "end": 2671.32, "text": "ganzen Krämpel hier, SDK, GS Latest und sowas, braucht man das, ich habe einen Fiat 500e gekauft,"}, {"id": 326, "start": 2671.32, "end": 2680.04, "text": "der steht bei mir im Hof gerade und jetzt will ich ihn meinem Home Assistant einbieten,"}, {"id": 327, "start": 2680.04, "end": 2684.92, "text": "dass ich dann so Sachen sehe wie Reifendruck, wie viel es geladen ist, ist er gerade eingesteckt,"}, {"id": 328, "start": 2684.92, "end": 2692.36, "text": "ist er gerade am laden, mach mal lieber Format gleich Jason, sonst kommt noch XML zurück,"}, {"id": 329, "start": 2692.36, "end": 2711.76, "text": "du hast recht, ja, Set, Query-Parameter, Params, kann man glaube ich noch mehr machen, New,"}, {"id": 330, "start": 2711.76, "end": 2722.2, "text": "SDK, GS Latest, ich setze diesen ganzen Krämpel hier mal, man weiß ja nie, vielleicht, nicht"}, {"id": 331, "start": 2722.2, "end": 2726.6, "text": "dass es da nachher nicht geht, man weiß ja, es hat bestimmt seinen Grund warum die das"}, {"id": 332, "start": 2726.6, "end": 2731.0, "text": "mitgeben, nur das mit dieser Page, ich glaube das mit dieser Page kann man sich echt sparen,"}, {"id": 333, "start": 2731.0, "end": 2739.84, "text": "so, wo ist denn meine Dump Methode, die brauche ich hier, ich kann mir die auch aus einem"}, {"id": 334, "start": 2739.84, "end": 2750.64, "text": "anderen Projekt kopieren, wichtigste, wichtigstes Ding was ich überall brauche, wo ist meine"}, {"id": 335, "start": 2750.64, "end": 2758.84, "text": "Helper, Helper Class, wo ist es, ich muss gerade auf den zweiten Bildschirm gucken,"}, {"id": 336, "start": 2758.84, "end": 2783.04, "text": "hier, exellent, komisch, ja, man hat immer noch solche Dinge, wie Hedda, tja, musste"}, {"id": 337, "start": 2783.04, "end": 2804.44, "text": "Fiat fragen, Public, was will der immer mit Public Key, Public, Static, Pipehead Helper"}, {"id": 338, "start": 2804.44, "end": 2813.24, "text": "Class, die brauche ich, die brauche ich immer, so, wisst ihr was man mit der machen kann,"}, {"id": 339, "start": 2813.24, "end": 2821.96, "text": "da kann ich jetzt einfach sagen, Login Response, Dump, und dann gibt es mit dem Debug Modus"}, {"id": 340, "start": 2821.96, "end": 2832.24, "text": "aus, Bäm, zack, und wenn der Reifentuch nicht stimmt, kann man sich dann da mit einem 3D"}, {"id": 341, "start": 2832.24, "end": 2837.12, "text": "Drucker eine Sirene ausdrucken, naja, du kannst zumindest das in deinem Dashboard anzeigen"}, {"id": 342, "start": 2837.12, "end": 2843.2, "text": "lassen, dass du siehst, dass der Reifentruck nicht stimmt, du kannst theoretisch sogar"}, {"id": 343, "start": 2843.2, "end": 2852.32, "text": "Hupen über die API glaube ich, ich glaube man kann Hupen über die API, also falls irgendjemand"}, {"id": 344, "start": 2852.32, "end": 2859.04, "text": "seine Nachbarn wirklich abfacken will, kann er Hupen automatisieren über sein Home Assistant,"}, {"id": 345, "start": 2859.04, "end": 2862.68, "text": "was ich nicht empfehlen würde, weil ich könnte mir vorstellen, dass er sogar illegal ist,"}, {"id": 346, "start": 2862.68, "end": 2867.48, "text": "zu sehr Lärmbelästigung durch Hupen, durch unsinniges, also Hupen verwenden ohne dass"}, {"id": 347, "start": 2867.48, "end": 2868.48, "text": "man Hupen braucht."}, {"id": 348, "start": 2868.48, "end": 2895.08, "text": "Ja, so ungefähr, so also, das erste hat ja schonmal funktioniert, ich hab ne Idee, Leute,"}, {"id": 349, "start": 2895.08, "end": 2901.12, "text": "ich hab ne Idee, ich bin mir nicht ganz sicher, ob das ne gute Idee ist, wir könnten sowas"}, {"id": 350, "start": 2901.12, "end": 2911.48, "text": "machen wie hier, war, default, paar rams oder sowas, new, dictionary, string, irgendwie"}, {"id": 351, "start": 2911.48, "end": 2921.32, "text": "sowas, und, oh nee, wie ist die, wie ist die Syntax dafür, so oder, die ist ein bisschen"}, {"id": 352, "start": 2921.32, "end": 2941.44, "text": "gewöhnungsbedürftig, so, nee, äh, Moment, wie ist denn die richtige Syntax dafür jetzt,"}, {"id": 353, "start": 2941.44, "end": 2957.84, "text": "ich, doch, ist doch richtig, oder, nee, da ist ne Klammer zu viel, nee, oh nee, wie funktioniert"}, {"id": 354, "start": 2957.84, "end": 2969.48, "text": "das nochmal, ähm, ach, da fehlt, da fehlt ein Quote, deswegen geht das nicht, ja, na,"}, {"id": 355, "start": 2969.48, "end": 2981.92, "text": "okay, jetzt ergibt das, ergibt das tatsächlich, so, ähm, ja, genau, das da, so, SDK, Format,"}, {"id": 356, "start": 2981.92, "end": 2990.92, "text": "so, dann können wir nämlich den Campbell wahrscheinlich einfach defaultmäßig übergeben, hier plus,"}, {"id": 357, "start": 2990.92, "end": 2995.08, "text": "also quasi das da, und dann einfach plus die defaultparameter, wenn wir die mal wieder"}, {"id": 358, "start": 2995.08, "end": 3000.88, "text": "brauchen, ich gehe davon aus, wir brauchen die noch öfters gleich, alles klar, okay,"}, {"id": 359, "start": 3000.88, "end": 3010.92, "text": "geht noch alles, check check, okay, gut, irgendwo musste man auch Session Timeout angeben, wo"}, {"id": 360, "start": 3010.92, "end": 3019.72, "text": "gibt man denn Session Timeout an, wo war das denn, Session Timeout, hier, beim nächsten,"}, {"id": 361, "start": 3019.72, "end": 3024.52, "text": "beim nächsten, Session Expiration, weil da, da geben wir nur ne Minute an oder so, selbst"}, {"id": 362, "start": 3024.52, "end": 3031.32, "text": "wenn ich Session Tokens liege, so schnell hat das keiner abgetippt, also, hier, so, den"}, {"id": 363, "start": 3031.32, "end": 3038.92, "text": "ersten Schritt haben wir hinbekommen, wunderbar, der nächste, der nächste Request, also, Cookies,"}, {"id": 364, "start": 3038.92, "end": 3041.68, "text": "Cookies setzen haben wir hinbekommen, wir können, wir können, nee, wobei ich gebe"}, {"id": 365, "start": 3041.68, "end": 3048.56, "text": "die Cookies nicht aus, wer weiß was man damit anstellen kann, also ich mein, mehr als den"}, {"id": 366, "start": 3048.56, "end": 3051.68, "text": "Account hier übernehmen kann man eh nicht, und den Account lösche ich danach, aber man"}, {"id": 367, "start": 3051.68, "end": 3055.6, "text": "muss es ja nicht übertreiben, so, nächster Request, was braucht man als nächstes, hier"}, {"id": 368, "start": 3055.6, "end": 3063.52, "text": "bekommen wir jetzt unsere UID, okay, also, ach du Scheiße, das ist jetzt schon ein bisschen"}, {"id": 369, "start": 3063.52, "end": 3068.52, "text": "mehr, was man hier setzen muss, ah, wir können gucken, und ich hab ne Idee, wir können gucken,"}, {"id": 370, "start": 3068.52, "end": 3076.84, "text": "ob die, ob die Response okay ist, also quasi, if Login Response Status Code und gleich"}, {"id": 371, "start": 3076.84, "end": 3086.44, "text": "200, ähm, keine Ahnung, Login failed oder so, irgendwie, oder wir können, oder wir können"}, {"id": 372, "start": 3086.44, "end": 3096.84, "text": "richtig, richtig Sixhead ob Object Oriented tuttet sein, und, und machen so was wie, äh,"}, {"id": 373, "start": 3096.84, "end": 3112.2, "text": "Public Void Throw on Error, String Message, if, wahrscheinlich ist das, der einzige, das"}, {"id": 374, "start": 3112.2, "end": 3117.52, "text": "einzige Mal, wo ich diese Klasse hier brauche, und danach sind es immer andere Antworten,"}, {"id": 375, "start": 3117.52, "end": 3127.44, "text": "if und gleich 200, New Network Exception oder sowas, ach, keine Ahnung, einfach, Base Exception,"}, {"id": 376, "start": 3127.44, "end": 3132.4, "text": "fällt grad nicht ein, welche Message, irgendwie so, und dann können wir noch hinten dran"}, {"id": 377, "start": 3132.4, "end": 3139.96, "text": "die Status Codes hängen, Error, Error, Error ist übrigens richtig cringe, ja, HiSJohi,"}, {"id": 378, "start": 3139.96, "end": 3145.8, "text": "Dankeschön für den Sub, man könnte, man könnte tatsächlich noch jetzt sowas hinten"}, {"id": 379, "start": 3145.8, "end": 3155.56, "text": "dran hängen wie Status, Status Code oder so, aber scheiß drauf, komm Error Handling, Kackel"}, {"id": 380, "start": 3155.56, "end": 3163.44, "text": "Alter, wer braucht denn sowas, geh, geh, gehste, gehste fort hier, weg, weg damit, weg, zwar"}, {"id": 381, "start": 3163.44, "end": 3167.16, "text": "zumindest können wir jetzt eine Sache machen, was es ein bisschen, ein bisschen hübscher,"}, {"id": 382, "start": 3167.16, "end": 3177.88, "text": "ein bisschen hübscher macht, Login, Response, ja, ich mein, das sieht, das sieht ein bisschen"}, {"id": 383, "start": 3177.88, "end": 3185.32, "text": "schicker aus, ja, dann ist das hier abgehakt, es ist auch so, guter Code hat keine Errors,"}, {"id": 384, "start": 3185.32, "end": 3189.28, "text": "ja, das ist richtig, allerdings ist die Fiat API wahrscheinlich kein guter Code, deswegen"}, {"id": 385, "start": 3189.28, "end": 3194.44, "text": "hat die manchmal Errors, gerade was Connection angeht, und Vodafone auch, aber jetzt machen"}, {"id": 386, "start": 3194.44, "end": 3198.48, "text": "wir mal weiter, also wir haben jetzt unsere Cookies gesetzt, alles gut, jetzt brauchen"}, {"id": 387, "start": 3198.48, "end": 3206.52, "text": "wir wieder ein Request, wahrscheinlich auf die Login-Uhr, ja, Login, Login-Uhr, so und"}, {"id": 388, "start": 3206.52, "end": 3216.32, "text": "diesmal, diesmal brauchen wir aber Accounts Login, und dann testen wir jetzt auch gleich"}, {"id": 389, "start": 3216.32, "end": 3227.04, "text": "mal, ob das Login nicht funktioniert, neuer Job, ne, warum, war immer noch das gleiche"}, {"id": 390, "start": 3227.04, "end": 3237.08, "text": "wie vorher, so Accounts Login, so was brauchen, ist das jetzt ein Postrequest oder was machen,"}, {"id": 391, "start": 3237.08, "end": 3248.12, "text": "was machen die denn, hier ist das ein Post, ah, das ist jetzt ein Postrequest, aha, das"}, {"id": 392, "start": 3248.12, "end": 3256.2, "text": "ist jetzt ein Postrequest, wo das da alles in den Body rein muss, ne, die können sich"}, {"id": 393, "start": 3256.2, "end": 3262.56, "text": "auch nicht entscheiden, oder, bei Fiat, was das jetzt werden soll, also Login, ok, wir"}, {"id": 394, "start": 3262.56, "end": 3270.84, "text": "müssen jetzt ein Request machen auf Accounts Login, und dann wird das, also mit unseren"}, {"id": 395, "start": 3270.84, "end": 3280.08, "text": "Cookies natürlich, ohne Cookies geht hier nichts, Query-Parameters und sowas brauchen"}, {"id": 396, "start": 3280.08, "end": 3292.76, "text": "wir alles nicht, ne, Post, Post, Jason Essink, also wir wollen ein Jason-Objekt schicken,"}, {"id": 397, "start": 3292.76, "end": 3302.4, "text": "und zwar, aber jetzt muss ich wirklich diesen ganzen Crap da rein schreiben, wait, was ist"}, {"id": 398, "start": 3302.4, "end": 3317.2, "text": "das jetzt, Aus-Response, ok, Receive, Receive-String, und dann gucken wir mal, ob da was Sinnvolles"}, {"id": 399, "start": 3317.2, "end": 3321.04, "text": "rauskommt, was passiert denn, wenn ich ein Post mache, einfach so, da sollte jetzt irgendein"}, {"id": 400, "start": 3321.04, "end": 3331.92, "text": "Error zurückkommen, ja, guck mal, Missing, Missing Required-Parameter, AP-Key, ja gut,"}, {"id": 401, "start": 3331.92, "end": 3345.68, "text": "ist doch in Ordnung, also was brauchen wir da jetzt, brauchen wir, Moment, diesen Krempel"}, {"id": 402, "start": 3345.68, "end": 3349.8, "text": "von da oben geben die hier wieder an, also will ich jetzt wahrscheinlich sowas machen"}, {"id": 403, "start": 3349.8, "end": 3366.28, "text": "wie Default, Params, Concat oder so, gibt es sowas, oh je, das wird jetzt aber eklig,"}, {"id": 404, "start": 3366.28, "end": 3379.56, "text": "sicher, dass man das so machen will, ne, oder, ne, ne, ich glaube nicht, dass wir das so machen"}, {"id": 405, "start": 3379.56, "end": 3392.12, "text": "wollen, ne, ne, das funktioniert so, glaubt eher nicht, dann muss ich mir mit den Default-Parametern"}, {"id": 406, "start": 3392.12, "end": 3396.8, "text": "doch irgendwas überlegen, ach, Moment, ich mache es ja auch falsch, das kommt ja auch"}, {"id": 407, "start": 3396.8, "end": 3403.96, "text": "nicht da rein, das muss ja auch direkt hier hin, guck mal, das funktioniert, ok, das sieht"}, {"id": 408, "start": 3403.96, "end": 3417.0, "text": "zwar nicht hübsch aus, aber, ich meine, könnte, könnte schlimmer sein, so, also, was brauchen"}, {"id": 409, "start": 3417.0, "end": 3424.28, "text": "wir da jetzt für Parameter, Login-ID brauchen wir, wir brauchen einiges, wir brauchen, wir"}, {"id": 410, "start": 3424.28, "end": 3430.48, "text": "brauchen einiges, Dankeschön Quatsch mit Sauce für den Sub, so, wir brauchen einiges"}, {"id": 411, "start": 3430.48, "end": 3440.4, "text": "an Parametern hier, so, Login-ID, Passwort, gerade mal ein bisschen kleiner, Login-ID,"}, {"id": 412, "start": 3440.4, "end": 3448.48, "text": "Passwort, Session Expiration, das kommt auf, wir wollen übrigens Object an der Stelle"}, {"id": 413, "start": 3448.48, "end": 3461.2, "text": "haben, ach, das geht nicht, er ist drauf, so, Timespan from Seconds, also, sagen wir mal,"}, {"id": 414, "start": 3461.2, "end": 3468.24, "text": "10 Sekunden darf die Session gültig sein, Total Seconds, ja, man könnte jetzt einfach"}, {"id": 415, "start": 3468.24, "end": 3474.0, "text": "10 reinschreiben, aber vielleicht will ich ja noch Minuten später machen, so, Session"}, {"id": 416, "start": 3474.0, "end": 3480.56, "text": "Parameter, Api-Key, welchen Api-Key brauchen wir jetzt, jetzt brauchen wir den richtig,"}, {"id": 417, "start": 3480.56, "end": 3493.04, "text": "echten Api-Key oder den Login Api-Key, welchen brauchen wir da jetzt, da muss ich hier nachgucken,"}, {"id": 418, "start": 3493.04, "end": 3502.72, "text": "äh, Alter, ist das unübersichtlich, hier, was, Risk Context, was, ne, den Login Api-Key"}, {"id": 419, "start": 3502.72, "end": 3509.2, "text": "braucht man hier wieder, ok, äh, also, Api-, ich glaube, ich guck, ich glaube, ich guck"}, {"id": 420, "start": 3509.2, "end": 3515.44, "text": "in der JavaScript-Implementierung davon, guck ich mir das ab, also, Api-Key brauchen wir"}, {"id": 421, "start": 3515.44, "end": 3526.16, "text": "mal wieder, Login Api-Key, ok, so, dann braucht man SDK, Bild, das haben wir schon, Format,"}, {"id": 422, "start": 3526.16, "end": 3533.12, "text": "Target Enf, Leute, Target Enf, das packen wir in die Defaults rein, ich geh davon aus,"}, {"id": 423, "start": 3533.12, "end": 3540.64, "text": "das brauchen wir noch öfters, Target Enf, wahrscheinlich können wir den Api-Key auch"}, {"id": 424, "start": 3540.64, "end": 3551.64, "text": "in die Defaults reinpacken, so, SDK, also, Include, so, Include, was ist das hier, Profile"}, {"id": 425, "start": 3551.64, "end": 3559.16, "text": "Data, E-Mails, ok, ich bin mir zwar nicht ganz, ganz sicher, aber wahrscheinlich was"}, {"id": 426, "start": 3559.16, "end": 3565.12, "text": "er returnt, oder, von, von meinen Sachen, die da gespeichert sind, so, Target Enf, Hammer,"}, {"id": 427, "start": 3565.12, "end": 3569.52, "text": "Include, Hammer, Include, User Info, User Info, Login Mode, Standard, was machen die"}, {"id": 428, "start": 3569.52, "end": 3575.8, "text": "hier, Login Mode, haben die hier überhaupt Login Mode drinne stehen, Login Mode, Standard,"}, {"id": 429, "start": 3575.8, "end": 3591.24, "text": "ok, das muss anscheinend sein, Login Mode, Standard, Language, juckt mich nicht, Source,"}, {"id": 430, "start": 3591.24, "end": 3603.6, "text": "Show Screen Set, Alter, was auch immer, was auch immer, Auth Mode, Cookie, brauchen wir"}, {"id": 431, "start": 3603.6, "end": 3613.32, "text": "noch, das ist wohl wichtig, ahja, das haben die da auch drinne, Auth Mode, Cookie, ok,"}, {"id": 432, "start": 3613.32, "end": 3619.16, "text": "das war's, jetzt bin ich ja mal gespannt, Kekwade, Alter, also, das Login kann jetzt"}, {"id": 433, "start": 3619.16, "end": 3623.48, "text": "noch nicht funktionieren, ja, weil ich falsche, falsche Usernamen, Passwort eingebe, einmal"}, {"id": 434, "start": 3623.48, "end": 3629.64, "text": "mal gucken, was der mir als Antwort, was der mir als Antwort, ähm, rausschmeißt, das"}, {"id": 435, "start": 3629.64, "end": 3645.8, "text": "ist Ryder, das ist Ryder, Missing Required Parameter, APK, warum, der ist doch da, Missing"}, {"id": 436, "start": 3645.8, "end": 3655.88, "text": "Required Parameter, erzähl, lüg nicht rum, der ist da, ich sehs genau, ihr sehts auch"}, {"id": 437, "start": 3655.88, "end": 3676.52, "text": "oder, da steht eindeutig APK, nee, nee, muss APK nicht groß, das ist richtig so, äh,"}, {"id": 438, "start": 3676.52, "end": 3691.48, "text": "ich hab's richtig, ach, Moment, wait a minute, da oben war's noch klein, und jetzt ist es"}, {"id": 439, "start": 3691.48, "end": 3698.64, "text": "groß, Alter, das ist ja mal die geilste API aller Zeiten, die sie hier gebaut haben,"}, {"id": 440, "start": 3698.64, "end": 3704.32, "text": "Missing Required Parameter, API Key, ok, soll ich jetzt exakt so schreiben, wie die das wollen,"}, {"id": 441, "start": 3704.32, "end": 3734.24, "text": "ja, nee, nee, der sagt Missing Parameter, ok, ja, mach ich irgendwas falsch, Leute,"}, {"id": 442, "start": 3734.24, "end": 3736.66, "text": "ok."}, {"id": 443, "start": 3736.66, "end": 3751.74, "text": "POST Invalid API Key Parameter, ah Joo"}, {"id": 444, "start": 3751.74, "end": 3777.9, "text": "Also Login API Key, das ist doch der, den sie hier verwenden."}, {"id": 445, "start": 3777.9, "end": 3801.18, "text": "Ja, oder es ist wirklich so, weil mein Login nicht stimmt."}, {"id": 446, "start": 3801.18, "end": 3805.9, "text": "Geben wir mal irgendwie was ein, was nach E-Mail Adresse aussieht."}, {"id": 447, "start": 3805.9, "end": 3822.02, "text": "Nee, Missing Request, Invalid API Key Parameter, stimmt dir irgendwas nicht, was ich hier zu"}, {"id": 448, "start": 3822.02, "end": 3823.02, "text": "ist?"}, {"id": 449, "start": 3823.02, "end": 3825.74, "text": "Bin ich zu pepega, das hier zusammenzubauen?"}, {"id": 450, "start": 3825.74, "end": 3829.42, "text": "Vielleicht mache ich das ja einfach falsch mit dem, mit dem Dictionary."}, {"id": 451, "start": 3829.42, "end": 3834.1, "text": "Wartet mal, wir testen das mal kurz, was da rauskommt."}, {"id": 452, "start": 3834.1, "end": 3849.46, "text": "Wir gucken mal, was da rauskommt."}, {"id": 453, "start": 3849.46, "end": 3860.5, "text": "Alter, was serialisiert der mir denn hier für ein Shit zusammen?"}, {"id": 454, "start": 3860.5, "end": 3864.26, "text": "Das ist gar kein Wunder, dass das nicht funktioniert."}, {"id": 455, "start": 3864.26, "end": 3870.58, "text": "Okay, so funktioniert das nicht, das muss ich anders machen."}, {"id": 456, "start": 3870.58, "end": 3880.9, "text": "Das klappt so nicht, ich dachte, ich könnte das elegant machen mit den Default Parametern,"}, {"id": 457, "start": 3880.9, "end": 3900.58, "text": "aber das scheint so weniger zu klappen."}, {"id": 458, "start": 3900.58, "end": 3904.66, "text": "Was kommt denn da überhaupt zurück, wenn ich zwei Dictionaries zusammen?"}, {"id": 459, "start": 3904.66, "end": 3908.42, "text": "Ach, da kommt gar kein Dictionary zurück, oder wie?"}, {"id": 460, "start": 3908.42, "end": 3917.06, "text": "Leute, warum kommt, wenn ich zwei Dictionaries zusammenschmeiße, warum kommt da kein Dictionary"}, {"id": 461, "start": 3917.06, "end": 3918.06, "text": "zurück?"}, {"id": 462, "start": 3918.06, "end": 3925.58, "text": "Das Chase zonifiziert das Dictionary, aber nicht so, wie ich mir das gedacht habe."}, {"id": 463, "start": 3925.58, "end": 3930.82, "text": "Okay, wir machen das anders."}, {"id": 464, "start": 3930.82, "end": 3934.02, "text": "Ich brauche diese Default Parameter garantiert noch öfters."}, {"id": 465, "start": 3934.02, "end": 3953.86, "text": "Das geht bestimmt schöner, nennen wir irgendwie, keine Ahnung, Default Parameters oder Union,"}, {"id": 466, "start": 3953.86, "end": 3958.82, "text": "aber sowas gibt es glaube ich, das gibt es, ach doch, Moment, nee, da kommt es gleich"}, {"id": 467, "start": 3958.82, "end": 3959.82, "text": "raus."}, {"id": 468, "start": 3959.82, "end": 3969.26, "text": "Ne, da machen wir das anders, so, wie gesagt, das geht bestimmt schöner, aber wir machen"}, {"id": 469, "start": 3969.26, "end": 3975.9, "text": "das jetzt immer schnell so, also Default, Default Dictionary ist das da, wir schmeißen"}, {"id": 470, "start": 3975.9, "end": 3985.38, "text": "das hier mal weg, Default Dictionary ist das hier, so, was hat er jetzt verschm- Alter,"}, {"id": 471, "start": 3985.38, "end": 4009.1, "text": "das hab ich übersehen, wat, ach, da ist noch ein New drinne, so, Default Parameter,"}, {"id": 472, "start": 4009.1, "end": 4031.4, "text": "als irgendwie, keine Ahnung, For Each, Default and, warum geht das nicht, ah, okay Leute,"}, {"id": 473, "start": 4031.4, "end": 4041.06, "text": "das geht garantiert deutlich schöner, aber mir fällt grad nix ein, so, und jetzt kann"}, {"id": 474, "start": 4041.06, "end": 4052.66, "text": "ich hier oben sagen, so, oh Shit, Alter, wenn das jetzt leer, das ist ja mega hässlich,"}, {"id": 475, "start": 4052.66, "end": 4066.18, "text": "egal, wir ignorieren das jetzt einfach, okay, so, ja, du kannst zu Dictionary machen, da"}, {"id": 476, "start": 4066.18, "end": 4075.46, "text": "musst du aber explizit nochmal die Keys angeben, was auch blöd ist, so, geht das jetzt, Moment,"}, {"id": 477, "start": 4075.46, "end": 4082.38, "text": "hier Default Parameters, so, geht das jetzt, kommt jetzt was Sinnvolles bei raus, ah, Moment,"}, {"id": 478, "start": 4082.38, "end": 4093.82, "text": "ich muss den, ja, ja, Ausgabe machen, Auth Response, was, Alter!"}, {"id": 479, "start": 4112.38, "end": 4119.92, "text": "Was macht der denn da draus, das sieht doch gut aus, das sieht doch jetzt richtig gut"}, {"id": 480, "start": 4119.92, "end": 4130.98, "text": "aus, APK, alles gut, wie hat der hier APK geschrieben, ist alles richtig, jetzt ist,"}, {"id": 481, "start": 4130.98, "end": 4146.66, "text": "das ist gut so, das ist, so muss das sein, so ist das korrekt, so ist das eigentlich"}, {"id": 482, "start": 4146.66, "end": 4164.26, "text": "richtig, warum funktioniert das nicht, eigentlich müsste das so jetzt gehen, Missing Required"}, {"id": 483, "start": 4164.26, "end": 4172.42, "text": "Parameter APK, bin ich jetzt total hängen geblieben, der ist doch da, okay, okay, wir"}, {"id": 484, "start": 4172.42, "end": 4185.94, "text": "machen jetzt, ich hab ne Idee, ich hab ne Idee, ist das gar kein, ist das gar kein Jason,"}, {"id": 485, "start": 4185.94, "end": 4193.98, "text": "was man da postet, vielleicht, das ist das vielleicht gar kein Jason, was man da postet,"}, {"id": 486, "start": 4193.98, "end": 4204.5, "text": "ist das irgendeine, ist das irgendwelche Forms, oder so, vielleicht, oh Leute, ich hab grad"}, {"id": 487, "start": 4204.5, "end": 4218.02, "text": "auswendig den Chat zugemacht, cool, muss man Chat hin, muss den Chat refreshen, so, jetzt,"}, {"id": 488, "start": 4218.02, "end": 4232.62, "text": "jetzt ist er wieder da, ich seh euch wieder, ist das vielleicht irgendwas, also das ist"}, {"id": 489, "start": 4232.62, "end": 4237.14, "text": "das erste Get, das will ich net haben, das da interessiert mich, Response, was macht"}, {"id": 490, "start": 4237.14, "end": 4248.66, "text": "der denn hier, Method Post, Join und Moment, das ist irgendeine Form, irgendeine Form,"}, {"id": 491, "start": 4248.66, "end": 4255.1, "text": "hier guckt mal, Alter, das ist kein Jason Response, das ist irgendeine Form, ja gut,"}, {"id": 492, "start": 4255.1, "end": 4261.66, "text": "wahrscheinlich weil er das gleiche aus dem Loginfeld zusammenbaut auf der Webseite, Post"}, {"id": 493, "start": 4261.66, "end": 4270.3, "text": "Full Encoded Async, ok, schauen wir mal, ob es jetzt funktioniert, ah, Invalid Login"}, {"id": 494, "start": 4270.3, "end": 4278.54, "text": "or Password, das sieht schon deutlich besser aus, ok, meine E-Mail Adresse, die ist ja"}, {"id": 495, "start": 4278.54, "end": 4294.34, "text": "bekannt, hier, wir sind, E-Mail Adresse, die da, ganz furchtbar, Fiat, please, so, nur"}, {"id": 496, "start": 4294.34, "end": 4300.42, "text": "mit dem Passwort muss ich mir jetzt irgendwas überlegen, wir machen wieder eine Datei in"}, {"id": 497, "start": 4300.42, "end": 4319.22, "text": "die ihr nicht rein, Secret, in die ihr nicht reingucken dürft, ihr dürft hier nicht reingucken,"}, {"id": 498, "start": 4319.22, "end": 4327.02, "text": "ihr müsst ja alle die Augen zumachen, Leute, wenn ich das reinschreibe jetzt, Fiat, nee,"}, {"id": 499, "start": 4327.02, "end": 4336.7, "text": "Secrets, jpw, ok, da zeigt das auch nicht an, ok, Augen zu Chat, Augen zu, keiner guckt,"}, {"id": 500, "start": 4336.7, "end": 4357.54, "text": "Konfig, null, ich glaube es geht los, nee, kein Konfig, ok, so, passt, ihr dürft wieder,"}, {"id": 501, "start": 4357.54, "end": 4367.34, "text": "ihr dürft wieder gucken, mache ich wieder an, Bildschirmhelligkeit hochlegen, oh nee,"}, {"id": 502, "start": 4367.34, "end": 4381.78, "text": "jetzt hat er es gesehen, er hat mich durchschaut, so, Passwort, Secrets, Fiat Passwort, so, mal"}, {"id": 503, "start": 4381.78, "end": 4391.74, "text": "schauen, ob es funktioniert, ich bin gespannt, easy, Login Token liegt, aber es sind 10 Sekunden"}, {"id": 504, "start": 4391.74, "end": 4412.78, "text": "expired, Chat, Chat, viel Spaß das in 10 Sekunden abzutippen, wer schafft es, easy, bin drin,"}, {"id": 505, "start": 4412.78, "end": 4418.62, "text": "oh nein, Chat, wusste doch, euch kann man nichts zeigen hier, man kann es ja verdammt"}, {"id": 506, "start": 4418.62, "end": 4422.42, "text": "zeigen, du weißt ja noch gar nicht, was du mit dem Login Token überhaupt machen sollst,"}, {"id": 507, "start": 4422.42, "end": 4432.82, "text": "ok, was bekommen wir denn hier für eine Response überhaupt, ok, Call ID, Error Code, API Version,"}, {"id": 508, "start": 4432.82, "end": 4438.9, "text": "Status Code, Status Reason, ok, das klingt schon mal nicht schlecht, UID, die brauchen"}, {"id": 509, "start": 4438.9, "end": 4445.66, "text": "wir auf jeden Fall, das weiß ich noch, die UID brauchen wir, sag mal, diesen ganzen Schmodder"}, {"id": 510, "start": 4445.66, "end": 4461.42, "text": "brauch ich doch nicht, Profile, E-Mail, Data, ich mein, who cares, oder, nein, wen juckt"}, {"id": 511, "start": 4461.42, "end": 4476.5, "text": "es, die UID brauche ich, sonst nix, so, dann würde ich vorschlagen, wir schnappen uns"}, {"id": 512, "start": 4476.5, "end": 4480.3, "text": "das hier nochmal, wobei, nein, eigentlich, wir brauchen nix davon, oder, wir brauchen"}, {"id": 513, "start": 4480.3, "end": 4488.14, "text": "nix davon, wir brauchen nur die UID, nur das da, sonst, sonst brauchen wir nix, so, das"}, {"id": 514, "start": 4488.14, "end": 4494.1, "text": "ist doch, das ist doch easy, guck mal, äh, wir haben unsere Fiat Response, wir machen"}, {"id": 515, "start": 4494.1, "end": 4504.66, "text": "jetzt, oh, wir sind heute Hyper Object Oriented, machen jetzt Public Class, so, das ist Fiat"}, {"id": 516, "start": 4504.66, "end": 4526.34, "text": "Api Response Base, ne, Base, Base, das ist, äh, Auth Api Response, so, und das Ding hat"}, {"id": 517, "start": 4526.34, "end": 4543.3, "text": "da nur ein extra Feld, was UID heißt, String, UID, so, äh, da bin ich mir jetzt nicht sicher,"}, {"id": 518, "start": 4543.3, "end": 4550.22, "text": "JSON Property, ob man da angeben muss, wie das genau heißt, weil, hier heißt es ja UID,"}, {"id": 519, "start": 4550.22, "end": 4558.82, "text": "da weiß ich, ob er, ob er es checkt, so, ähm, gucken wir mal, ob das funktioniert,"}, {"id": 520, "start": 4558.82, "end": 4570.62, "text": "jetzt machen wir zu, so, und wir wollen jetzt nicht, wir wollen ein, ein JSON Response kriegen,"}, {"id": 521, "start": 4570.62, "end": 4580.98, "text": "irgendwie Auth Response, schauen wir mal, Auth Response UID, gucken wir mal, ob wir jetzt"}, {"id": 522, "start": 4580.98, "end": 4590.94, "text": "nur die UID rauskriegen, easy, funktioniert, so, UID haben wir, und die anderen Sachen"}, {"id": 523, "start": 4590.94, "end": 4599.38, "text": "haben wir natürlich, Moment, ich wollte das natürlich erben, so, dass der andere Krempel"}, {"id": 524, "start": 4599.38, "end": 4621.34, "text": "da auch drinne ist, genau, so, äh, was weiß ich, Auth, failed, so, gut, also, jetzt sind"}, {"id": 525, "start": 4621.34, "end": 4626.82, "text": "wir zumindest schon mal einen Schritt weiter, wir haben jetzt, wenn ich jetzt richtig sehe,"}, {"id": 526, "start": 4626.82, "end": 4639.58, "text": "Session Cookies und, und ein Token, nee, und die User ID, und die User ID, ok, wie geht"}, {"id": 527, "start": 4639.58, "end": 4644.66, "text": "es jetzt weiter, wie geht es jetzt weiter mit dem, mit dem ganzen Shit hier, also, das"}, {"id": 528, "start": 4644.66, "end": 4650.26, "text": "haben wir jetzt, passt hier, ganzen Krempel von Go, können wir mal ignorieren, jetzt müssen"}, {"id": 529, "start": 4650.26, "end": 4658.74, "text": "wir ein Request auf Account get JSON Web Token machen, mit diesem ganzen Krempel hier drinne,"}, {"id": 530, "start": 4658.74, "end": 4668.06, "text": "ok, na gut, guck mal, gut, dass wir unsere Base Sachen gespeichert haben, Pog, Leute,"}, {"id": 531, "start": 4668.06, "end": 4672.62, "text": "wir brauchen den API Key doch bei jeder Anfrage, habe ich das jetzt bis jetzt richtig gesehen,"}, {"id": 532, "start": 4672.62, "end": 4678.18, "text": "da können wir doch den API Key auch einfach, ach, Moment, hier ist der API Key groß geschrieben,"}, {"id": 533, "start": 4678.18, "end": 4696.54, "text": "hier ist der API Key klein geschrieben, das ist bestimmt, nicht so, das, das geht wahrscheinlich"}, {"id": 534, "start": 4696.54, "end": 4702.9, "text": "nicht, lassen wir das jetzt mal, also weiter gehts, das da müssen wir jetzt machen, also"}, {"id": 535, "start": 4702.9, "end": 4712.98, "text": "wir brauchen ein Request, Copy Paste mir den Krempel hier mal, so, das hier ist ein JSON"}, {"id": 536, "start": 4712.98, "end": 4723.9, "text": "Web Token Request Response, Login Uhr, jetzt auf Accounts, also wer sich das bei Fiat ausgedacht"}, {"id": 537, "start": 4723.9, "end": 4735.78, "text": "hat, ne, Chat, bis jetzt bei Apple irgendwas spannendes dabei, irgendwas, irgendwas bahnbrechendes,"}, {"id": 538, "start": 4735.78, "end": 4752.38, "text": "was man wissen müsste, außer das alles so easy, so awesome, so, so grandios ist, so"}, {"id": 539, "start": 4752.38, "end": 4759.06, "text": "Cookies, der ganze andere Krempel hier ist wieder drinnen, das hier brauchen wir jetzt"}, {"id": 540, "start": 4759.06, "end": 4766.74, "text": "Fields, Fields brauchen wir auf jeden Fall, den ganzen anderen, und das Token muss da"}, {"id": 541, "start": 4766.74, "end": 4775.9, "text": "jetzt auch rein, ok, Auth Mode Cookie, ok, das muss man hier drinnen stehen lassen anscheinend,"}, {"id": 542, "start": 4775.9, "end": 4782.78, "text": "also, ok, wir brauchen folgendes, wenn ich das jetzt richtig sehe, wir brauchen Fields,"}, {"id": 543, "start": 4782.78, "end": 4788.78, "text": "Fields ist dieser ganze Schmodder da, was auch immer man mir das sagen soll, Fields,"}, {"id": 544, "start": 4788.78, "end": 4795.5, "text": "was denn hier, was denn hier, Rider denkt mit, Rider hör auf mitzudenken, lass mich"}, {"id": 545, "start": 4795.5, "end": 4801.94, "text": "das tippen, so, Login Token brauchen wir jetzt noch, Login Token, woher kommen eigentlich"}, {"id": 546, "start": 4801.94, "end": 4809.66, "text": "die ganzen Extension Methods, das kommt von, zeige ich dir, das hier, das kommt von Flurl,"}, {"id": 547, "start": 4809.66, "end": 4820.3, "text": "das ist ein, ein HTTP Client URL Builder, finde ich viel angenehmer als den eingebauten"}, {"id": 548, "start": 4820.3, "end": 4832.3, "text": "HTTP Client, guck, das ist das hier, ist auch recht beliebt, ja, Login URL ist ein String"}, {"id": 549, "start": 4832.3, "end": 4839.5, "text": "und das sind alles, ist alles Extention, was ein 1 Hertz Display, boah krass, was die alles"}, {"id": 550, "start": 4839.5, "end": 4852.5, "text": "machen bei Apple und was brauchen wir jetzt hier noch, Login Token und ins Login Token"}, {"id": 551, "start": 4852.5, "end": 4861.94, "text": "müssen wir jetzt was packen, die UID, nee, Login Token, Moment, ich bin glaube ich eins"}, {"id": 552, "start": 4861.94, "end": 4874.38, "text": "zu weit oder, wo, wo, wo hat er denn das hierher, wo, wo hat der, wo hat er die Session Info"}, {"id": 553, "start": 4874.38, "end": 4895.9, "text": "her, kommt die irgendwo hierher, ah, Session Info steht da drinnen, ist das, ist das so,"}, {"id": 554, "start": 4895.9, "end": 4899.5, "text": "habe ich, habe ich noch irgendwie hier oben sowas, Session Info, guck mal da, stand da"}, {"id": 555, "start": 4899.5, "end": 4905.22, "text": "Session Info, ach guck mal da, Session Info, Login Token, wir brauchen gar nicht nur die"}, {"id": 556, "start": 4905.22, "end": 4917.9, "text": "UID, wir brauchen auch noch das da, Session Info, ja gut auf geht's, Session Info, also"}, {"id": 557, "start": 4917.9, "end": 4932.22, "text": "brauchen wir jetzt noch sowas hier, Session Info, so und das bekommt ein Login Token,"}, {"id": 558, "start": 4932.22, "end": 4943.7, "text": "Login Token und ein Expires In, Expires In, weil man das wahrscheinlich gar nicht braucht,"}, {"id": 559, "start": 4943.7, "end": 4952.18, "text": "so und das kriegt ein Property Session Info und dann sollte er diesen Kram eigentlich"}, {"id": 560, "start": 4952.18, "end": 4962.82, "text": "ordentlich deserialisieren, hoffe ich mal, das heißt wir bekommen jetzt ein Session"}, {"id": 561, "start": 4962.82, "end": 4971.3, "text": "Token, guck mal nochmal ob wir jetzt ein Session Token bekommen, schauen wir mal, ja, ja, UID"}, {"id": 562, "start": 4971.3, "end": 4975.54, "text": "Session Token, alles klar, so, weil jetzt brauchen wir nämlich das Session Token an"}, {"id": 563, "start": 4975.54, "end": 4983.74, "text": "dieser Stelle, so wie es aussieht, Login Token, also sprich von vorher brauchen wir jetzt"}, {"id": 564, "start": 4983.74, "end": 4990.26, "text": "die Session Info und das Login Token und jetzt sollten wir einen ordentlichen Response kriegen,"}, {"id": 565, "start": 4990.26, "end": 4996.98, "text": "Moment, ist das jetzt überhaupt wieder URL encoded oder ist das jetzt wieder was anderes,"}, {"id": 566, "start": 4996.98, "end": 5006.5, "text": "oh Gott, also die Fiat API macht mich fertig, ist es jetzt, ja das ist wieder ein Post,"}, {"id": 567, "start": 5006.5, "end": 5012.62, "text": "ne Moment, ist das jetzt überhaupt, ne, ne das ist jetzt wieder ein Get, das ist jetzt"}, {"id": 568, "start": 5012.62, "end": 5030.5, "text": "wieder ein Get mit URL Parametern, also was die sich da ausgedacht haben, Get, Moment,"}, {"id": 569, "start": 5030.5, "end": 5040.86, "text": "also dann brauchen wir nicht das hier, sondern Set Query Parameters, Get String Assign, so"}, {"id": 570, "start": 5040.86, "end": 5046.62, "text": "schauen wir mal was da jetzt zurück kommt, ob da jetzt was sinnvolles als Antwort zurück"}, {"id": 571, "start": 5046.62, "end": 5069.5, "text": "kommt, General Server Error, ok was habe ich nicht gecheckt, was ist hier verkehrt, General"}, {"id": 572, "start": 5069.5, "end": 5078.94, "text": "Server Error, was habe ich hier verkehrt gemacht, Fiat Server geschrottet, Accounts, Get, so"}, {"id": 573, "start": 5078.94, "end": 5091.3, "text": "passt, wir gucken uns die JavaScript Variante an, das haben wir jetzt ja schon, so hier"}, {"id": 574, "start": 5091.3, "end": 5100.02, "text": "sind wir jetzt, also Login Talken haben wir, haben wir, haben wir, haben wir, haben wir"}, {"id": 575, "start": 5100.02, "end": 5122.42, "text": "alles, was, was könnte ihn denn, was könnte ihn jetzt, der API Key fehlt doch bestimmt"}, {"id": 576, "start": 5122.42, "end": 5131.5, "text": "wieder oder, der API Key fehlt garantiert, Chat, der API Key fehlt, sagts euch, der API"}, {"id": 577, "start": 5131.5, "end": 5138.18, "text": "Key fehlt, hat der hier den API Key drinne, Login API Key, API Key, der API Key, der API"}, {"id": 578, "start": 5138.18, "end": 5152.38, "text": "Key hab ich vergessen, aha, schon funktioniert's, schon funktioniert's, exellent, alles klar,"}, {"id": 579, "start": 5152.38, "end": 5159.42, "text": "so den API Key, den machen wir jetzt hier wirklich mal raus und packen den in die Defaults"}, {"id": 580, "start": 5159.42, "end": 5169.34, "text": "rein, der API Key und Auth Mode Cookie kommt auch in die Defaults rein, weil anscheinend"}, {"id": 581, "start": 5169.34, "end": 5176.38, "text": "braucht man das immer, Auth Mode Cookie können wir wegmachen und API Key können wir auch"}, {"id": 582, "start": 5176.38, "end": 5182.38, "text": "wegmachen, API Key, hoffentlich kann ich den API Key hier auch wegmachen, dann nicht, dass"}, {"id": 583, "start": 5182.38, "end": 5187.54, "text": "es case sensitive ist, hey es funktioniert, die haben ihre API nicht case sensitive gemacht,"}, {"id": 584, "start": 5187.54, "end": 5191.82, "text": "ich bin begeistert, es funktioniert mit API klein geschrieben und API groß geschrieben,"}, {"id": 585, "start": 5191.82, "end": 5207.7, "text": "Pog, ich mein Login Mode Standard könnte ich da auch reinmachen, Login Mode Standard"}, {"id": 586, "start": 5207.7, "end": 5212.3, "text": "machen wir auch da rein, das hier, das lassen wir mal, das sieht so aus als muss das da"}, {"id": 587, "start": 5212.3, "end": 5220.18, "text": "nicht hin, ok, ok, ok, also wir haben jetzt ein Token, wir haben jetzt ein Token, hier"}, {"id": 588, "start": 5220.18, "end": 5227.26, "text": "Idee, Idee Token, ist da sonst noch irgendwas spannendes drinne, nee nur Idee Token, ok,"}, {"id": 589, "start": 5227.26, "end": 5234.86, "text": "objektorientiert sein ist anstrengend, das heißt wir brauchen jetzt eine Fiat Response"}, {"id": 590, "start": 5234.86, "end": 5251.22, "text": "und die da haben da drinne bloß ein ID Token, Token ID, ah, get Jason Essink, Fiat Dings"}, {"id": 591, "start": 5251.22, "end": 5261.46, "text": "Response, jawoll, schauen wir mal ob da was sinnvolles bei rumkommt jetzt, exellent, also"}, {"id": 592, "start": 5261.46, "end": 5275.42, "text": "das hat übrigens alles keine Gimmick, ok hier ist unser Token, ok, jetzt, es wird ja"}, {"id": 593, "start": 5275.42, "end": 5285.14, "text": "noch viel wilder, es wird ja noch viel wilder jetzt, also jetzt haben wir unser Web Token,"}, {"id": 594, "start": 5285.14, "end": 5291.22, "text": "jetzt müssen wir zu Amazon, jetzt wird es erst richtig kriminell, kriminell, kriminell"}, {"id": 595, "start": 5291.22, "end": 5296.5, "text": "wird es nicht bevor jetzt hier irgendwie wieder die Twitch und YouTube Polizei am Start ist,"}, {"id": 596, "start": 5296.5, "end": 5302.82, "text": "nein nein, es wird kompliziert, mein Opa hat immer gesagt wenn es kompliziert wird"}, {"id": 597, "start": 5302.82, "end": 5308.26, "text": "jetzt wird es kriminell, so was haben wir, oh jetzt müssen wir zu Amazon, jetzt müssen"}, {"id": 598, "start": 5308.26, "end": 5318.82, "text": "wir zu Amazon, oder sowas in der Richtung, nee wir müssen nicht zu Amazon, wir müssen"}, {"id": 599, "start": 5318.82, "end": 5332.78, "text": "nochmal zu Fiat und ok anscheinend müssen wir jetzt zu dieser"}, {"id": 600, "start": 5332.78, "end": 5355.86, "text": "URL, alles klar, obviusly müssen wir dahin, also Token URL, so und jetzt bin ich mal gespannt,"}, {"id": 601, "start": 5355.86, "end": 5364.42, "text": "wie geht es jetzt, also Token URL und jetzt muss ich was für ein Request machen, jetzt"}, {"id": 602, "start": 5364.42, "end": 5383.3, "text": "muss ich Header setzen Leute, ich gebe dir Header, x client API Version, was so, jetzt"}, {"id": 603, "start": 5383.3, "end": 5387.98, "text": "mal ernsthaft, das ist doch abartig was die sich hier ausgedacht haben, sag mal das ist"}, {"id": 604, "start": 5387.98, "end": 5392.7, "text": "ja ein Login Vorgang, der ist ja komplizierter, wie alles wirklich ohne Scheiß, ich habe"}, {"id": 605, "start": 5392.7, "end": 5399.46, "text": "noch nie einen komplizierteren Login Vorgang gesehen, also was, ich habe keine Ahnung was"}, {"id": 606, "start": 5399.46, "end": 5403.34, "text": "die sich dabei gedacht haben die Italiener, normalerweise würde ich jetzt sagen was die"}, {"id": 607, "start": 5403.34, "end": 5407.14, "text": "China Chinesen dabei gedacht haben, es sind doch nicht mal die Chinesen diesmal, also"}, {"id": 608, "start": 5407.14, "end": 5417.66, "text": "muss ich Header setzen Leute, Header, also erstmal unsere Cookies wieder anhängen, Cookies,"}, {"id": 609, "start": 5417.66, "end": 5429.58, "text": "ohne unsere Cookies geht wahrscheinlich nichts, der Punkt muss eins runter, Cookies, so Header,"}, {"id": 610, "start": 5429.58, "end": 5441.06, "text": "also wir brauchen eine x client API Version, ok, 1.0, dann brauchen wir eine, Moment, wir"}, {"id": 611, "start": 5441.06, "end": 5466.7, "text": "brauchen eine Client Request ID, die aus einem random Stream mit 16 zei, also, also"}, {"id": 612, "start": 5466.7, "end": 5481.26, "text": "was, was bin ich sehend hier Fiat, was ist das, was gibt das wenn es fertig ist, x API"}, {"id": 613, "start": 5481.26, "end": 5485.26, "text": "Key, oh wir brauchen einen anderen API Key Leute, habe ich den schon, den habe ich noch"}, {"id": 614, "start": 5485.26, "end": 5491.14, "text": "gar nicht, wir brauchen jetzt einen anderen API Key, wir brauchen jetzt den, den, den"}, {"id": 615, "start": 5491.14, "end": 5499.34, "text": "x API Key, was ist denn der x API Key, ah hier, der da, natürlich, natürlich, einer,"}, {"id": 616, "start": 5499.34, "end": 5507.74, "text": "einer reicht dann als selbstverständlich nett, Private String API Key, kann man den, kann"}, {"id": 617, "start": 5507.74, "end": 5512.82, "text": "man den als API Key irgendwie Token API Key oder so nennen, dass ich deswegen halbwegs"}, {"id": 618, "start": 5512.82, "end": 5533.34, "text": "unterscheiden kann, API Key, ok, Token API Key, alles klar, x Originator Type, Web, natürlich,"}, {"id": 619, "start": 5533.34, "end": 5539.5, "text": "wir sind in Browser, habe ich nie was anderes behauptet, ok Client Request ID, meine Güte,"}, {"id": 620, "start": 5539.5, "end": 5548.58, "text": "Client Request ID, also ein random, also ich soll jetzt einen random String generieren,"}, {"id": 621, "start": 5548.58, "end": 5556.46, "text": "das ist der gleiche Key wie da rüber, echt, ne, zwei komplett unterschiedliche paar, zwei"}, {"id": 622, "start": 5556.46, "end": 5569.14, "text": "komplett unterschiedliche paar Keys, this random String, ok Leute, wisst ihr was, ich,"}, {"id": 623, "start": 5569.14, "end": 5576.18, "text": "ich mache es mir jetzt einfach, wobei ich muss mal gucken, was der da eigentlich macht,"}, {"id": 624, "start": 5576.18, "end": 5585.74, "text": "random String, ah, der random String generiert sich aus nur kleinen Buchstaben und Null bis"}, {"id": 625, "start": 5585.74, "end": 5593.54, "text": "neun, natürlich, was sonst, was sonst, du meinst den Auskommand, achso, hab ich gar"}, {"id": 626, "start": 5593.54, "end": 5599.38, "text": "nicht gesehen, dass der oben schon hat, also nur kleinen Buchstaben und Null bis neun,"}, {"id": 627, "start": 5599.38, "end": 5602.7, "text": "ok das ist relativ einfach Leute, wir machen, wir machen uns jetzt, wir machen uns jetzt"}, {"id": 628, "start": 5602.7, "end": 5612.58, "text": "wirklich, wir machen uns jetzt wirklich einfach, ich hoffe der frisst das jetzt, Client Request,"}, {"id": 629, "start": 5612.58, "end": 5632.74, "text": "wir sagen jetzt einfach, Gut, New, String, ohne was, 16, fertig, das ist random genug"}, {"id": 630, "start": 5632.74, "end": 5643.78, "text": "oder, das, das müsste, müsste random, es müsste random genug sein für die glaube ich,"}, {"id": 631, "start": 5643.78, "end": 5654.7, "text": "so, müssen wir sonst noch was machen, aha, das ist jetzt ein, ach, das ist jetzt ein"}, {"id": 632, "start": 5654.7, "end": 5663.42, "text": "Post Request, ach, das ist jetzt ein Jason Post Request, ok, Post Jason Async, und da"}, {"id": 633, "start": 5663.42, "end": 5681.7, "text": "muss jetzt was rein, Gigia Talken, was für ein Ding, Gigia Talken API, das hab ich ehrlich"}, {"id": 634, "start": 5681.7, "end": 5688.26, "text": "gesagt noch nie gehört, warum heißt das nicht Gigia Chat Talken oder sowas, aber Gigia,"}, {"id": 635, "start": 5688.26, "end": 5693.78, "text": "das bestimmt irgendwas von Amazon, oder ist das Chat, sagt euch das was, ich mein scheint"}, {"id": 636, "start": 5693.78, "end": 5703.22, "text": "ja, scheint ja irgendwie verbreitet zu sein, aber ich hab das noch nie gehört, ok wo sind"}, {"id": 637, "start": 5703.22, "end": 5712.18, "text": "wir stehen geblieben, hier, random String, was ist das, Moment, da bin ich ja noch gar"}, {"id": 638, "start": 5712.18, "end": 5719.46, "text": "nicht, da bin ich noch gar nicht, hier, hier, login, login, header, ne Moment, da bin ich"}, {"id": 639, "start": 5719.46, "end": 5745.38, "text": "auch noch nicht, wo muss ich denn hin, na, da bin ich, Gigia Talken, ok, Gigia Talken,"}, {"id": 640, "start": 5745.38, "end": 5748.54, "text": "und das ist jetzt, ich lösche das hier mal, weil wir haben ja alles drinne, und das ist"}, {"id": 641, "start": 5748.54, "end": 5755.1, "text": "jetzt quasi von der Response vorher, hallo, ah ne, Moment, gleich, wir sind hier nicht"}, {"id": 642, "start": 5755.1, "end": 5767.34, "text": "in die Ava-Screen, äh, Talken ID, ok, es ist nicht die Talken ID, es ist tatsächlich"}, {"id": 643, "start": 5767.34, "end": 5780.1, "text": "ein ID-Talken, das muss ich umbenennen, ok, und jetzt, äh, Receive String, jetzt bin"}, {"id": 644, "start": 5780.1, "end": 5796.26, "text": "ich ja mal gespannt, ob da was Sinnvolles zurückkommt, Alter, Identity Response, ob"}, {"id": 645, "start": 5796.26, "end": 5808.94, "text": "das jetzt funktioniert, Schatz, ich bin skeptisch, so, ich würde sagen, es hat funktioniert,"}, {"id": 646, "start": 5808.94, "end": 5816.18, "text": "und jetzt bekommen wir eine Identity ID mit irgendeinem Amazon Rechenzentrum, beziehungsweise"}, {"id": 647, "start": 5816.18, "end": 5824.02, "text": "Amazon Region, und nochmal ein Talken, sag mal, das wie viele Talken ist das jetzt, das"}, {"id": 648, "start": 5824.02, "end": 5839.46, "text": "fünfte, der Identity Aid Identifier, also wenn du Sachen schon so benennen musst, da weißt"}, {"id": 649, "start": 5839.46, "end": 5847.94, "text": "du, da stimmt irgendwas nicht so ganz, der Identity Identifier, alles klar, aber, aber"}, {"id": 650, "start": 5847.94, "end": 5852.98, "text": "Leute, es hat funktioniert, lasst mal was testen, was passiert denn, wenn ich hier 16,"}, {"id": 651, "start": 5852.98, "end": 5858.02, "text": "wenn ich hier einfach ein 17, 17-stelliges Random String mitschicke, geht es dann immer"}, {"id": 652, "start": 5858.02, "end": 5865.18, "text": "noch, ja, funktioniert einfach trotzdem, müssen wahrscheinlich überhaupt nicht 16 sein, ist"}, {"id": 653, "start": 5865.18, "end": 5869.06, "text": "wahrscheinlich vollkommen egal, der erste Typ hat 16 genommen und jeder hat von ihm"}, {"id": 654, "start": 5869.06, "end": 5877.78, "text": "abgeschrieben und seitdem waren es 16, ok, weiter, weiter, ok, also, was, Moment, was"}, {"id": 655, "start": 5877.78, "end": 5888.46, "text": "bekommen wir da jetzt überhaupt als Antwort, Identity ID und Talken, ok, also, gehen wir"}, {"id": 656, "start": 5888.46, "end": 5893.34, "text": "mal hier wieder runter, das können wir nicht von unserer Fiat Response ableiten, sondern"}, {"id": 657, "start": 5893.34, "end": 5899.94, "text": "einfach nur, was ist denn das jetzt für eine Url hier, zeig mal, wie heißt die Url, Alter,"}, {"id": 658, "start": 5899.94, "end": 5910.38, "text": "das ist, 0101 FCA Gizuf, FCA, das ist dieser Fiat Konzern, nenn es jetzt einfach, nenn"}, {"id": 659, "start": 5910.38, "end": 5923.82, "text": "es jetzt einfach, keine Ahnung, FCA, Identity Response, irgendwie muss ich den Krempel nehmen,"}, {"id": 660, "start": 5923.82, "end": 5933.1, "text": "so, Property, Identity ID, jawoll, ganz toll, String und noch ein Talken, noch ein Talken,"}, {"id": 661, "start": 5933.1, "end": 5937.46, "text": "wir haben noch nicht genug Talkens, da sind auch immer andere Talken, wie man hier sieht,"}, {"id": 662, "start": 5937.46, "end": 5952.3, "text": "guck, die sehen nur ähnlich aus, aber sind immer andere, also, Receive FCA Identity,"}, {"id": 663, "start": 5952.3, "end": 5958.94, "text": "schauen wir mal, ob es funktioniert hat und bam, funktioniert, ok, jetzt haben wir noch"}, {"id": 664, "start": 5958.94, "end": 5965.42, "text": "ein Talken und jetzt, wenn ich es richtig gesehen habe, müssen wir zu Amazon oder was"}, {"id": 665, "start": 5965.42, "end": 5978.34, "text": "kommt jetzt für abgedrehter Shit, ich, Leute, ich spar mir, ohne Mist, ich spar mir einfach,"}, {"id": 666, "start": 5978.34, "end": 5987.82, "text": "ich spar mir das Error Handling, Kacke, so, und hier mache ich gar kein Error Handling"}, {"id": 667, "start": 5987.82, "end": 6001.14, "text": "mehr, so, wie geht es denn, wie geht es denn weiter, Talken, ID, Logins, jetzt muss ich"}, {"id": 668, "start": 6001.14, "end": 6008.62, "text": "irgendwelche AWS Requests machen, was zum, gibt es da nicht irgendeine fertige AWS Library"}, {"id": 669, "start": 6008.62, "end": 6014.02, "text": "für die ich nehmen kann, warum sollte ich diesen Krempel selbst zusammenbauen, Marfinius,"}, {"id": 670, "start": 6014.02, "end": 6019.78, "text": "Dankeschön für den Host, das ist doch blödsinnig, ich brauche doch keine eigenen Amazon Requests,"}, {"id": 671, "start": 6019.78, "end": 6024.7, "text": "gibt es doch irgendeine Amazon Library, die das für mich macht, wie machen das die Jungs"}, {"id": 672, "start": 6024.7, "end": 6044.54, "text": "in golden hier drüben, die verwenden irgendeine Amazon Library, guckt mal, get credentials"}, {"id": 673, "start": 6044.54, "end": 6054.5, "text": "for identity, genau das will ich haben, get credentials for identity,.net, AWS, ich suche"}, {"id": 674, "start": 6054.5, "end": 6064.58, "text": "jetzt einfach mal nach ingnet.net, guck mal da, AWS SDK for.net, nach was muss ich da"}, {"id": 675, "start": 6064.58, "end": 6087.42, "text": "suchen jetzt, AWS SDK, kennt sich irgendjemand damit aus, Cognito Identity, danach suche ich"}, {"id": 676, "start": 6087.42, "end": 6096.46, "text": "mal, ich habe keine Ahnung von dem AWS Krempel, ok wir haben Cognito Identity Provider und"}, {"id": 677, "start": 6096.46, "end": 6116.58, "text": "Cognito Identity, ok, ich habe absolut keinen Plan, wie verwendet man das jetzt, gibt es"}, {"id": 678, "start": 6116.58, "end": 6145.82, "text": "ja irgendein Example oder so, Docs, Docs ist immer gut, Example, haha das ist gut, das"}, {"id": 679, "start": 6145.82, "end": 6154.54, "text": "ist gut, das mache ich rein, das ist gut, das gefällt mir, ich habe es hinzugefügt,"}, {"id": 680, "start": 6154.54, "end": 6160.58, "text": "das ist gut, was ist der Ziel des heutigen Projekts, das wird nicht nur heute sein, ich"}, {"id": 681, "start": 6160.58, "end": 6167.86, "text": "will mein Elektroauto in Home Assistant drinne haben, also so Sachen wie Reifendruck, Batteriestatus"}, {"id": 682, "start": 6167.86, "end": 6179.34, "text": "und Lade Dauer und sowas, ich brauche mal ein Beispiel dafür, Hot Examples, jawoll,"}, {"id": 683, "start": 6179.34, "end": 6200.1, "text": "die Hot Examples, wo sind sie, was, gibt es da nicht irgendein Beispiel für Stack Overflow,"}, {"id": 684, "start": 6200.1, "end": 6217.94, "text": "bin da jetzt echt ein bisschen aufgeschmissen, hat nicht einer von euch irgendwie Plan von,"}, {"id": 685, "start": 6217.94, "end": 6227.3, "text": "ok was, was gibt es denn, was gibt es denn hier, Cognito Identity, schreibt man das überhaupt"}, {"id": 686, "start": 6227.3, "end": 6257.22, "text": "so, Cognito Identity Provider Info, Cognito Identity Client, sowas da, ja, ja, ja, ja,"}, {"id": 687, "start": 6257.22, "end": 6271.1, "text": "jetzt, boah wie viel Zeug, wie heißt das denn Get, so hieß das doch oder, ok das war"}, {"id": 688, "start": 6271.1, "end": 6275.54, "text": "jetzt echt Luck, das war einfach nur pures Glück, ich habe random irgendwas genommen"}, {"id": 689, "start": 6275.54, "end": 6288.54, "text": "und das ist, wobei das stand doch glaube ich sogar auch hier, keine Ahnung was ich mache"}, {"id": 690, "start": 6288.54, "end": 6299.02, "text": "hier, E-Auto Review Incoming, bekommst du Geld oder Ladekarte, nö, war damit aber auch"}, {"id": 691, "start": 6299.02, "end": 6309.46, "text": "nicht auf die Arbeit, so was muss man da jetzt reinschreiben, vielleicht wenn ich danach"}, {"id": 692, "start": 6309.46, "end": 6331.62, "text": "suche finde ich vielleicht was, Issues, das ist gut, zeig mal Beispiel Code please, Request,"}, {"id": 693, "start": 6331.62, "end": 6351.86, "text": "OKS, was, ok das ist die verwirrendste API die ich je gesehen habe, ich habe keine Ahnung"}, {"id": 694, "start": 6351.86, "end": 6356.5, "text": "wie dieser Amazon Shit funktioniert, ok was machen die denn in der Go, was machen die"}, {"id": 695, "start": 6356.5, "end": 6367.98, "text": "in der Go, also die sagen Get Credentials for Identity Input, wo kommt denn das jetzt"}, {"id": 696, "start": 6367.98, "end": 6375.74, "text": "schon wieder her, wisst ihr was cool wäre, wenn die Go API und die.NET API von diesem"}, {"id": 697, "start": 6375.74, "end": 6391.22, "text": "Amazon Zeug ungefähr gleich wären, ich habe keine Ahnung wie das funktioniert, also die"}, {"id": 698, "start": 6391.22, "end": 6403.98, "text": "übergeben hier irgendwie Logins, ok also, ja GitHub ohne Scheiß, GitHub Copilot wäre"}, {"id": 699, "start": 6403.98, "end": 6411.18, "text": "für sowas wirklich gut, ok Identity ID, ich habe hier eine Identity ID, Identity ID, ok"}, {"id": 700, "start": 6411.18, "end": 6418.62, "text": "und jetzt, ein Dictionary, ah das machen die in Go auch, guck mal, die machen ein Dictionary"}, {"id": 701, "start": 6418.62, "end": 6430.38, "text": "was Logins heißt, das einfach auch mal machen, Logins, ach das heißt schon, ok New Dictionary,"}, {"id": 702, "start": 6430.38, "end": 6438.98, "text": "was ist denn das schon wieder für eine API Mann, was ist denn das hier, Await, das funktioniert"}, {"id": 703, "start": 6438.98, "end": 6449.54, "text": "im Leben nicht, und dann das da und dann das Token rein, MonkaS Alter, Ident, nee, nee"}, {"id": 704, "start": 6449.54, "end": 6461.74, "text": "und gleich, gleich, Identity Response, Token, ha, funktioniert nicht, nee, komm mal, exellent,"}, {"id": 705, "start": 6461.74, "end": 6468.46, "text": "wie bist du auf die Fiat API von GitHub gekommen, gar nicht, ich habe Projekte gesucht die Fiat"}, {"id": 706, "start": 6468.46, "end": 6475.02, "text": "zu porten und habe mir dann den Songscore angeguckt, du kannst dir EVCC angucken oder IO Broker"}, {"id": 707, "start": 6475.02, "end": 6480.22, "text": "angucken, die haben beide Fiat Module, ok, jetzt schicken wir mal den Request ab Leute,"}, {"id": 708, "start": 6480.22, "end": 6485.14, "text": "keine Ahnung was dabei rauskommt, was kriegen wir dann hier als Antwort eigentlich dann,"}, {"id": 709, "start": 6485.14, "end": 6491.02, "text": "was, ja was bekommt man hier eigentlich für eine Antwort, was ist denn das hier, was kommt"}, {"id": 710, "start": 6491.02, "end": 6502.3, "text": "da raus, Get Credentials for Identity Response, Identity Response habe ich schon, Credentials"}, {"id": 711, "start": 6502.3, "end": 6508.98, "text": "for, exakt so muss das heißen, Credentials for Identity Response, das muss einfach immer"}, {"id": 712, "start": 6508.98, "end": 6523.82, "text": "noch länger werden, ok Credentials, HTTP Status Code, ok auf gehts Leute, Bäm, komm"}, {"id": 713, "start": 6523.82, "end": 6550.58, "text": "mal ob das jetzt funktioniert, äh, hallo, hallo, ist AWS immer so langsam, hallo, hallo,"}, {"id": 714, "start": 6550.58, "end": 6566.86, "text": "was machen die, ah die muss, guck mal die geben noch die Region an, die geben noch die"}, {"id": 715, "start": 6566.86, "end": 6581.66, "text": "Region an, alles klar, sendet er, oh er ist abgekackt, no region endpoint, aha, siehste,"}, {"id": 716, "start": 6581.66, "end": 6604.58, "text": "region endpoint, west, oh jetzt aber, hängt wieder, ja, ich hab das noch nie verwendet,"}, {"id": 717, "start": 6604.58, "end": 6617.3, "text": "ich weiß nicht wie man das jetzt richtig benutzt, example, ja zeig her, doch die Region stand"}, {"id": 718, "start": 6617.3, "end": 6625.34, "text": "drinne, da stand EU West drinne, ok guck mal wir gucken uns mal das von Amazon an, guck"}, {"id": 719, "start": 6625.34, "end": 6639.82, "text": "mal die setzen auch nur die Region, ok er ist wieder abgekackt, ich hab ja auch kein"}, {"id": 720, "start": 6639.82, "end": 6645.34, "text": "Login für Amazon von Fiat, brauch ich ja auch nicht, ich will da drauf zugreifen mit"}, {"id": 721, "start": 6645.34, "end": 6651.62, "text": "einem ganz normalen Request, ok was gibt's denn hier noch für Credentials, ok zeig mal"}, {"id": 722, "start": 6651.62, "end": 6659.86, "text": "her, New Credentials, da muss ich jetzt AWS Keys und sowas eingeben, das hab ich net,"}, {"id": 723, "start": 6659.86, "end": 6667.46, "text": "ich hab kein Secret Key, ich hab kein Session Tongue, ich hab kein Access Key, geil, oh"}, {"id": 724, "start": 6667.46, "end": 6674.82, "text": "guck mal es gibt Anonymous AWS Credentials, sag mal wie viele Credentials gibt's denn"}, {"id": 725, "start": 6674.82, "end": 6682.98, "text": "hier eigentlich, Anonymous Credentials, easy, Leute ich hab echt kein Plan, es hängt wahrscheinlich"}, {"id": 726, "start": 6682.98, "end": 6701.34, "text": "wieder, alles klar, das kann doch nicht so ernsthaft so benutzt werden oder, und hat"}, {"id": 727, "start": 6701.34, "end": 6706.58, "text": "das jetzt das gemacht was ich machen will, schauen wir mal, ich hab jetzt übrigens,"}, {"id": 728, "start": 6706.58, "end": 6715.18, "text": "by the way, Credentials, ich bekomme jetzt übrigens, das ist jetzt das sechste Tongue,"}, {"id": 729, "start": 6715.18, "end": 6718.58, "text": "das sechste und siebte Tongue, ich bekomme jetzt noch ein Session Tongue, ein Secret"}, {"id": 730, "start": 6718.58, "end": 6723.5, "text": "Key und ein Access Key ID, das ist quasi dann das sechste, siebte und achte Tongue was ich"}, {"id": 731, "start": 6723.5, "end": 6730.18, "text": "jetzt bekomme, also das ist ja so secure, das ist schon hyper secure, da kannst du keine"}, {"id": 732, "start": 6730.18, "end": 6736.34, "text": "Chance mehr, wie viele, wie viele Tokens sind das jetzt, habt ihr mal mitgezählt, ich glaube"}, {"id": 733, "start": 6736.34, "end": 6740.54, "text": "es sind wirklich, damit sind wir 9 Tokens, hoffentlich brauchen wir die nicht alle später"}, {"id": 734, "start": 6740.54, "end": 6752.66, "text": "noch, Tokencounter, ok Credentials, die muss ich mir wahrscheinlich speichern denke ich"}, {"id": 735, "start": 6752.66, "end": 6761.26, "text": "mal hier, Credentials, na komm, wir nennen es, wir nennen es mal nicht einfach nur C sondern"}, {"id": 736, "start": 6761.26, "end": 6767.54, "text": "als Credentials, ok und damit mache ich jetzt genau was, bin ich jetzt damit fertig mit"}, {"id": 737, "start": 6767.54, "end": 6784.9, "text": "dem Login, bin ich jetzt mit der Login Prozedur durch, bald brauchen wir einen Token Manager"}, {"id": 738, "start": 6784.9, "end": 6792.62, "text": "zum verwalten, oh the Factory, Token Manager Factory brauchen wir da, so, Response Data"}, {"id": 739, "start": 6792.62, "end": 6802.82, "text": "Token, Data ID, ja das haben wir alles gespeichert, was macht der denn jetzt damit, Amtsfeld,"}, {"id": 740, "start": 6802.82, "end": 6809.58, "text": "der wusste auch nicht mehr was er hier reinschreiben soll, Seba, Suchan, 95 Dankeschön"}, {"id": 741, "start": 6809.58, "end": 6829.62, "text": "für den Sub, ok und weiter, hey wir sind fertig mit dem Login, wait a minute, jetzt"}, {"id": 742, "start": 6829.62, "end": 6834.82, "text": "können wir unsere Autos auflisten lassen, die nicht vorhanden sind aber ok, zumindest"}, {"id": 743, "start": 6834.82, "end": 6841.66, "text": "der Request zum auflisten der Autos sollte funktionieren, exellent, Leute wir haben es"}, {"id": 744, "start": 6841.66, "end": 6855.3, "text": "geschafft, wir sind eingeloggt, wir haben es geschafft in nur, in nur, na so viel Zeilen"}, {"id": 745, "start": 6855.3, "end": 6865.22, "text": "sind es gar nicht, 32, also 60 Zeilen haben wir gebraucht für das Login, ich mein es"}, {"id": 746, "start": 6865.22, "end": 6871.5, "text": "ist, das ist wirklich kompliziertes Login Verfahren was ich hier gesehen habe, ok also"}, {"id": 747, "start": 6871.5, "end": 6879.7, "text": "Private Credentials, Moment ist das überhaupt das richtige, das sind die richtigen Credentials"}, {"id": 748, "start": 6879.7, "end": 6890.94, "text": "hier, zack, jetzt lasse ich einfach die IDE machen, einfach hier zack, gibt es nicht,"}, {"id": 749, "start": 6890.94, "end": 6901.42, "text": "Create Field Credentials, fertig, ok die ID brauche ich auf jeden Fall später noch, UID,"}, {"id": 750, "start": 6901.42, "end": 6910.3, "text": "wo gab es, in welchem Response war die ID hier, Auth Response war die UID, die UID brauche"}, {"id": 751, "start": 6910.3, "end": 6931.22, "text": "ich auf jeden Fall noch, Private String, User ID, User ID, die gab es nämlich hier, User"}, {"id": 752, "start": 6931.22, "end": 6938.42, "text": "ID gleich, ok jetzt können wir den Request machen und die ganzen Autos auflisten lassen"}, {"id": 753, "start": 6938.42, "end": 6944.58, "text": "wenn ich das hier richtig sehe, dazu brauchen wir das, mein Gott ist das abartig Alter zu"}, {"id": 754, "start": 6944.58, "end": 6959.86, "text": "bedienen, ok also das Login hat ja anscheinend funktioniert so wie es aussieht, boah wie"}, {"id": 755, "start": 6959.86, "end": 6969.06, "text": "viel kostet das neue iPhone, 1450 Euro, das ist ja, ich wollte es gerade sagen richtiger"}, {"id": 756, "start": 6969.06, "end": 6978.9, "text": "Schnapper, aber die Leute werden es garantiert bezahlen, ich meine Leute, denkt an die Inflation,"}, {"id": 757, "start": 6978.9, "end": 6983.9, "text": "Apple muss auch überleben irgendwie, Apple ist bestimmt ja schon kurz vor der Pleite,"}, {"id": 758, "start": 6983.9, "end": 6999.18, "text": "die können sich das nicht leisten, da ein bisschen weniger fürzunehmen, das geht nicht,"}, {"id": 759, "start": 6999.18, "end": 7003.9, "text": "mittlerweile bekommt man dafür sogar eine Grafikkarte plus einen CPU schon, seit die"}, {"id": 760, "start": 7003.9, "end": 7010.7, "text": "ganzen Miner ihre Grafikkarten loswerden wollen bzw. sich das Minen nicht mehr lohnt, also"}, {"id": 761, "start": 7010.7, "end": 7020.54, "text": "Login hat funktioniert, jetzt geht es weiter, Public, Task, Public Async, Task, ich nenne"}, {"id": 762, "start": 7020.54, "end": 7031.7, "text": "es einfach nur Patch, so und da rufen wir jetzt die Auto Infos ab, die wir nicht abrufen"}, {"id": 763, "start": 7031.7, "end": 7041.46, "text": "können, weil der Account keine Autos hat, aber der Request muss funktionieren, ja ich"}, {"id": 764, "start": 7041.46, "end": 7045.3, "text": "lege überhaupt keinen Useragent fest, das interessiert die auch überhaupt nicht, so"}, {"id": 765, "start": 7045.3, "end": 7052.14, "text": "was ist das hier jetzt eigentlich, das kann ich mir doch bestimmt auch wieder alles sparen,"}, {"id": 766, "start": 7052.14, "end": 7076.74, "text": "ok wir gucken uns das mal in Go an, da muss ich glaube ich in die andere Datei, Vehicle,"}, {"id": 767, "start": 7076.74, "end": 7085.54, "text": "also das muss ich jetzt aufrufen, Api-Uri, ok welche ist das jetzt, Ah das ist wieder"}, {"id": 768, "start": 7085.54, "end": 7092.62, "text": "was anderes, ok, also wir brauchen noch eine weitere Url, die wir abrufen können, na dann,"}, {"id": 769, "start": 7092.62, "end": 7099.94, "text": "also das ist jetzt die richtig echte Api-Url, ok, nicht irgendwie die Login-Url oder die,"}, {"id": 770, "start": 7099.94, "end": 7104.74, "text": "das ist jetzt die richtig echte Api-Url, die wir jetzt brauchen für die weiteren Requests,"}, {"id": 771, "start": 7104.74, "end": 7132.02, "text": "na dann hoffen wir mal, Api, den nicht net so, ups, so heißt das, Api-Url, so get, was"}, {"id": 772, "start": 7132.02, "end": 7148.1, "text": "machen die hier jetzt, Stage, Moment was, wait, Seg, Seg, die Domains sind extrem PP'er"}, {"id": 773, "start": 7148.1, "end": 7175.46, "text": "von den, also, Append-Segment, V2, nee, V4, V2 war bei dem anderen, V4, Accounts, äh,"}, {"id": 774, "start": 7175.46, "end": 7188.06, "text": "jetzt brauchen wir die ID, User ID, FCA, GCV, das ist irgendwas für Fiat, Chrysler, sonst"}, {"id": 775, "start": 7188.06, "end": 7201.34, "text": "was, nicht der FCA, Fiat, Fiat Chrysler Automobiles, was GCV ist habe ich keine Ahnung, Growth"}, {"id": 776, "start": 7201.34, "end": 7214.7, "text": "Capital Venture, alles klar, Big Stonks, äh, warum geht das jetzt nicht, ah Segments muss"}, {"id": 777, "start": 7214.7, "end": 7238.34, "text": "es sein, Pass Segments, User ID, ok, Vehicles und jetzt Query-Parameter, wenn wir da gar"}, {"id": 778, "start": 7238.34, "end": 7251.94, "text": "nicht ganz sicher sind, doch, ne, Set Query-Parameter, genau, hier steht ja auch da oben Stage, all,"}, {"id": 779, "start": 7251.94, "end": 7257.98, "text": "da kommt doch im Leben nix Gescheites raus, hier Api-Url, so, also, V4 Accounts, was,"}, {"id": 780, "start": 7257.98, "end": 7265.18, "text": "was muss man da jetzt noch alles angeben, nix oder wie, ne, das kann ja so schon mal"}, {"id": 781, "start": 7265.18, "end": 7275.18, "text": "nicht funktionieren, Cookies wahrscheinlich, bestimmt, bestimmt Cookies, garantiert Cookies,"}, {"id": 782, "start": 7275.18, "end": 7289.06, "text": "garantiert Cookies, ah ne, das Cookie habe ich ja, ja dann keine Cookies, ähm, woher"}, {"id": 783, "start": 7289.06, "end": 7295.78, "text": "muss ich denn jetzt was ich da angehe, die geben mir gar nix an in dem Request, was macht"}, {"id": 784, "start": 7295.78, "end": 7304.9, "text": "denn V-Request, V-Request, V-Request, was ist denn V, also Beschissene hätten wir"}, {"id": 785, "start": 7304.9, "end": 7329.62, "text": "ja nicht benennen können, was ist V, V-Api, ah Moment, hä, was ist V, Request New, kommt"}, {"id": 786, "start": 7329.62, "end": 7342.94, "text": "das, kommt das hier her, ne, das hatte ich gerade auf, ach ne, hier ist es doch, da ist"}, {"id": 787, "start": 7342.94, "end": 7347.26, "text": "es doch, aha, ok, diesen ganzen, diesen ganzen Crap muss ich da wieder anhängen, dass es"}, {"id": 788, "start": 7347.26, "end": 7353.38, "text": "funktioniert, alles klar, ok, das wäre ja auch zu einfach gewesen, wenn das nicht,"}, {"id": 789, "start": 7353.38, "end": 7360.14, "text": "wenn das einfach nur abgeschickt werden kann, also, ähm, Append Path Segment, Set Query"}, {"id": 790, "start": 7360.14, "end": 7369.54, "text": "Parameter, Header Braumer, with Header, äh, x, x, komm wir schreiben es, wir schreiben"}, {"id": 791, "start": 7369.54, "end": 7380.9, "text": "es klein, machen das wie dem, wie in dem JavaScript Beispiel, x, Client App Version, 1.0, so,"}, {"id": 792, "start": 7380.9, "end": 7388.14, "text": "Client Header, Client Request ID, Moment, das ist der gleichen Krämpel wie da oben,"}, {"id": 793, "start": 7388.14, "end": 7389.14, "text": "oder?"}, {"id": 794, "start": 7389.14, "end": 7404.42, "text": "Lul, Ease, so, was braucht man da sonst noch, x-Api Key, x-Api Key, haben wir das da oben"}, {"id": 795, "start": 7404.42, "end": 7414.3, "text": "auch gebraucht, x-Api Key, jawoll, zack, Copy Paste, beste, Originator Type, Web, haben wir"}, {"id": 796, "start": 7414.3, "end": 7423.66, "text": "oben auch gebraucht, ok, wunderbar, haben wir jetzt alles, Pin Auth, das haben wir eh"}, {"id": 797, "start": 7423.66, "end": 7427.78, "text": "nicht, also, das haben wir, das haben wir, das haben wir, das haben wir, das haben wir,"}, {"id": 798, "start": 7427.78, "end": 7442.42, "text": "except, äh, except, können wir vielleicht noch machen, with Header, except, ob wir das"}, {"id": 799, "start": 7442.42, "end": 7450.38, "text": "brauchen, das Ding wird wahrscheinlich standardmäßig immer, Application, JSON, äh, Antworten, Content"}, {"id": 800, "start": 7450.38, "end": 7461.06, "text": "Type, ähm, Leute, mal ne doofe Frage, aber, die machen doch, die senden doch hier überhaupt"}, {"id": 801, "start": 7461.06, "end": 7466.78, "text": "keine Daten, warum setzen die in Content Type, ich mein, wenn ich keine Daten sende, muss"}, {"id": 802, "start": 7466.78, "end": 7471.54, "text": "ich eigentlich auch kein Content Type setzen, aber wir machen, ich mein, wer weiß, was die"}, {"id": 803, "start": 7471.54, "end": 7477.46, "text": "Fiat API da haben will, wir machen das jetzt einfach so, ok, also, jetzt haben wir alles"}, {"id": 804, "start": 7477.46, "end": 7483.1, "text": "gesetzt, wo setze ich meine Credentials überhaupt, ich mein, die habe ich abgerufen, irgendwo"}, {"id": 805, "start": 7483.1, "end": 7494.14, "text": "müssen die doch jetzt mal, was, was Sinnvolles machen, mal gucken was die API sagt, mal gucken,"}, {"id": 806, "start": 7494.14, "end": 7501.46, "text": "mal gucken was passiert, äh, Get, String, so, mal gucken was da jetzt zurückkommt,"}, {"id": 807, "start": 7501.46, "end": 7518.7, "text": "gleich mal her, flup, flup, flup, flup, flup, äh, forbidden, forbidden, ja gut, ich hab"}, {"id": 808, "start": 7518.7, "end": 7527.02, "text": "ja auch nirgendswo meine Credentials angegeben, forbidden, ähm, wir können das mal in einem"}, {"id": 809, "start": 7527.02, "end": 7535.5, "text": "zwei Catchplot machen, weil ich glaube, man kriegt aus der Exception noch ein bisschen,"}, {"id": 810, "start": 7535.5, "end": 7556.06, "text": "noch ein bisschen mehr raus, Message vielleicht, äh, äh, vielleicht kann man da was rauslesen,"}, {"id": 811, "start": 7556.06, "end": 7576.9, "text": "Response, Get, String, Async, Missing Authentification Token, ja genau, wie gebe ich denn das jetzt"}, {"id": 812, "start": 7576.9, "end": 7587.1, "text": "an, das Authentification Token, Identity Sign, jetzt muss ich irgendwelche AWS Signaturen"}, {"id": 813, "start": 7587.1, "end": 7598.78, "text": "oder, was ist das, jetzt schon wieder, mein Gott, was haben die sich da ausgedacht, Alter,"}, {"id": 814, "start": 7598.78, "end": 7610.7, "text": "ok, AWS 4 Sign, jetzt hört es aber auf, jetzt hört es aber auf, was ist denn das jetzt"}, {"id": 815, "start": 7610.7, "end": 7640.18, "text": "schon wieder, AWS 4 Sign, der Signed irgendwie die Header und dann, und dann kopiert er sich"}, {"id": 816, "start": 7640.18, "end": 7656.26, "text": "den Authorization Header, ey, wer hat sich das ausgedacht, Mann, wer hat sich das ausgedacht,"}, {"id": 817, "start": 7656.26, "end": 7664.1, "text": "ok, was machen die in Go, Identity Sign, ok, ich guck mal kurz, was da passiert, vielleicht"}, {"id": 818, "start": 7664.1, "end": 7674.58, "text": "gibt es ja auch schon eine fertige Amazon Library, dann nehmen wir die, Identity Sign, ok, Sign,"}, {"id": 819, "start": 7674.58, "end": 7690.18, "text": "noch ein Fett, New Signer, alles klar, wir signen mit dem Signer, mit welchem Signer,"}, {"id": 820, "start": 7690.18, "end": 7706.1, "text": "Stack Overflow, Leute,.net, AWS Sign V4, Stack Overflow, was denn das, AWS Signer V4.net,"}, {"id": 821, "start": 7706.1, "end": 7710.42, "text": "das klingt gut, ich hab keine Ahnung, was das ist, was man braucht, aber der Name klingt"}, {"id": 822, "start": 7710.42, "end": 7715.38, "text": "vielversprechend, müsst ihr zugeben, oder, klingt genau nach sowas, was ich brauch, AWS"}, {"id": 823, "start": 7715.38, "end": 7723.94, "text": "Signer V4.net, Sign HTTP Request Messages Using AWS Signature Version 4, bitte schön,"}, {"id": 824, "start": 7723.94, "end": 7730.46, "text": "also nicht irgendwie outdated V2 oder sowas, Version 4, ne, wenn die V2 war die, war die"}, {"id": 825, "start": 7730.46, "end": 7749.5, "text": "Client Version, also nicht V3, oder was, Using Request Information and Credentials, ich weiß"}, {"id": 826, "start": 7749.5, "end": 7752.14, "text": "doch nicht mal, was ich überhaupt vor mir hab, ich weiß gar nicht, was ich hier sehe,"}, {"id": 827, "start": 7752.14, "end": 7756.7, "text": "ich weiß nicht, was ich hier machen soll, ok, Stack Overflow, is there a.net Library,"}, {"id": 828, "start": 7756.7, "end": 7764.3, "text": "was kann das sein, Request mit, ist immer, ganz, ganz bescheuerte Frage, aber warum brauche"}, {"id": 829, "start": 7764.3, "end": 7771.58, "text": "ich eine extra.net Library, um Request für AWS zu signen, wenn Amazon noch 30 Milliarden"}, {"id": 830, "start": 7771.58, "end": 7781.38, "text": ".net AWS Libraries hat, also warum kann das die nicht einfach, ja, Python interessiert"}, {"id": 831, "start": 7781.38, "end": 7788.46, "text": "mich, ne, wirklich, was sind das wieder für Ppega Leute bei Stack Overflow, ja, der erste"}, {"id": 832, "start": 7788.46, "end": 7797.22, "text": "verlinkte eine Python Library und der zweite verlinkte eine Javascript Geschichte, was"}, {"id": 833, "start": 7797.22, "end": 7822.42, "text": "ist da schon wieder los, ok, Python Time, aktivieren, here is designer from SDK, ok,"}, {"id": 834, "start": 7822.42, "end": 7843.7, "text": "er ist schön, wenn das designer da drin ist, I'm the co-author of this Library, welche"}, {"id": 835, "start": 7843.7, "end": 7856.62, "text": "von, von was sprechen die da schon wieder, Nougat Packages, Amazon, AWS Signer.net,"}, {"id": 836, "start": 7856.62, "end": 7874.14, "text": "das hatten wir doch gerade schon mal, oh es gibt auch noch ein AWS, AWS 4 Request Signer"}, {"id": 837, "start": 7874.14, "end": 7880.98, "text": "für.net und es gibt ein AWS Signature Version, was zum Teufel, was bin ich sehen, was ist"}, {"id": 838, "start": 7880.98, "end": 7886.62, "text": "das überhaupt, chat blickt irgendjemand durch, was das ist, hat irgendjemand schon was mit"}, {"id": 839, "start": 7886.62, "end": 7900.22, "text": "AWS gemacht, AWS Signature Version 4, HTTP Client, ok, Credentials, ok gut, ok gut, das"}, {"id": 840, "start": 7900.22, "end": 7908.02, "text": "kriege ich hin, das kriege ich hin zu benutzen, so und dann muss ich, dann muss ich was machen,"}, {"id": 841, "start": 7908.02, "end": 7924.38, "text": "please execute AP, Region EU West, ok, also was brauche ich jetzt, welches Nougat Package"}, {"id": 842, "start": 7924.38, "end": 7938.46, "text": "ist das hier, der AWS Signature, AWS Signature Signer, der AWS Signature Signer V4, ich"}, {"id": 843, "start": 7938.46, "end": 7942.18, "text": "installiere das jetzt einfach mal als Package, ich weiß weder wozu ich das brauche, noch"}, {"id": 844, "start": 7942.18, "end": 7955.18, "text": "was es macht, aber das wird schon irgendwie gehen, so, copy paste, ja gut, die benutzen"}, {"id": 845, "start": 7955.18, "end": 7961.94, "text": "HTTP Client, HTTP Client will ich nicht verwenden, ich will Fluchel verwenden, das wird jetzt"}, {"id": 846, "start": 7961.94, "end": 7976.54, "text": "natürlich ein bisschen komplizierter, ich könnte einen Hook registren, ja, before requests,"}, {"id": 847, "start": 7976.54, "end": 7989.82, "text": "call, war mal ein Vorschlag, IDE, call, perfekt, so wunderbar, ne jetzt haben wir doppelt,"}, {"id": 848, "start": 7989.82, "end": 7998.54, "text": "was call zu nennen ist ziemlich, ziemlich, naja da heißt es halt call, so und ich brauche"}, {"id": 849, "start": 7998.54, "end": 8015.3, "text": "hier nämlich einen, ach nee, ah das ist ein Overload, das ist ein Overload von GetAsync,"}, {"id": 850, "start": 8015.3, "end": 8024.58, "text": "ok wir müssen mal kurz das, die compile lassen, gucken was die da machen, oh guys, alter was"}, {"id": 851, "start": 8024.58, "end": 8052.74, "text": "ein Gefurl man, GetAsync, GetAsync, hier, nee, was, nee, credentials, ja, wo macht der"}, {"id": 852, "start": 8052.74, "end": 8065.94, "text": "hier was, immutable credentials, GetAsync, send self, ok, wir nähern uns, wir nähern"}, {"id": 853, "start": 8065.94, "end": 8087.7, "text": "uns der Sache, hier, signer, sign async, also was, signer, Moment den signer gibt es jetzt"}, {"id": 854, "start": 8087.7, "end": 8100.66, "text": "in Amazon und in AWS Signage, ok wir wollen AWS Signage, signer, sign, und jetzt, Leute"}, {"id": 855, "start": 8100.66, "end": 8106.78, "text": "ich hab selten so wenig verstanden, was ich mache, was als hier gerade, signer, sign,"}, {"id": 856, "start": 8106.78, "end": 8112.02, "text": "und was signiere ich überhaupt, versteht irgendjemand was ich überhaupt signen muss,"}, {"id": 857, "start": 8112.02, "end": 8130.94, "text": "ich hab überhaupt keine Ahnung, ok was muss ich da, requests, ok das weiß ich zumindest"}, {"id": 858, "start": 8130.94, "end": 8138.78, "text": "schon mal was wir brauchen, wir brauchen, request message, ja das ist ok, das hab ich"}, {"id": 859, "start": 8138.78, "end": 8154.7, "text": "verstanden, request message, a base, base url, gar keine, darf die null, nein, nein,"}, {"id": 860, "start": 8154.7, "end": 8171.74, "text": "darf die null sein, ich hoffe mal, dass die null sein darf, ich hab, ich hab kein Plan"}, {"id": 861, "start": 8171.74, "end": 8184.86, "text": "alter, default headers, was für default headers, ok, einfach leere Liste, einfach ja perfekt,"}, {"id": 862, "start": 8184.86, "end": 8198.9, "text": "leere Liste, alles gut, date, time, now, ich brech mal kurz die Zeilen um, jetzt, jetzt"}, {"id": 863, "start": 8198.9, "end": 8206.02, "text": "github co-pilot Leute, vielleicht wüsste der besser Bescheid was ich machen muss als"}, {"id": 864, "start": 8206.02, "end": 8229.66, "text": "ich selbst, und jetzt string region name, region, end point, west, und jetzt credentials, ok,"}, {"id": 865, "start": 8229.66, "end": 8239.06, "text": "was hat er für schmerzen, was, oh, ich hab zu wenig übergeben, du hast vergessen, ah"}, {"id": 866, "start": 8239.06, "end": 8246.1, "text": "service name hab ich vergessen, ah service name, execute ap war das service name, aha,"}, {"id": 867, "start": 8246.1, "end": 8251.94, "text": "guckte mal da, scheint so funktionieren, außer das da, eu west geht nicht, eu west system"}, {"id": 868, "start": 8251.94, "end": 8259.3, "text": "name, wahrscheinlich, oder display name, wahrscheinlich system name, a credentials marker, ok, ok,"}, {"id": 869, "start": 8259.3, "end": 8267.94, "text": "das marker nicht, warum nicht, weil es müssen immutable credentials sein, na meinetwegen"}, {"id": 870, "start": 8267.94, "end": 8296.62, "text": "immutable credentials, excess key, credentials, secret key, hocken mehr gibt es da net, ok,"}, {"id": 871, "start": 8296.62, "end": 8314.26, "text": "und das soll jetzt gehen, ich glaub nicht, dass das funktioniert, wir wollen mal run,"}, {"id": 872, "start": 8314.26, "end": 8320.86, "text": "invalid request, ah moment, das ist aber schon mal was anderes, request parameter is missing"}, {"id": 873, "start": 8320.86, "end": 8335.82, "text": "or invalid, aha, das ist schon mal was anderes, vorher hat er nämlich gesagt, passt mal auf,"}, {"id": 874, "start": 8335.82, "end": 8344.78, "text": "wenn ich das nämlich weglasse hier, dann sagt er, verbinden, missing token sagt er"}, {"id": 875, "start": 8344.78, "end": 8356.62, "text": "dann, also das ist schon mal richtig was ich hier mache, aber irgendwas ist missing, request"}, {"id": 876, "start": 8356.62, "end": 8373.3, "text": "parameter is missing, welcher request parameter könnte missing sein, setz mal base uri auf,"}, {"id": 877, "start": 8373.3, "end": 8392.18, "text": "meinste, wo krieg ich den überhaupt raus, ich bin auch richtig lost, ich hab keine Ahnung"}, {"id": 878, "start": 8392.18, "end": 8399.66, "text": "was da passiert, vielleicht gehts jetzt ja, invalid request parameter, was, der sagt mir"}, {"id": 879, "start": 8399.66, "end": 8407.1, "text": "ja auch nicht, welcher, welcher request parameter könnte denn da missing sein, weil wenn ich"}, {"id": 880, "start": 8407.1, "end": 8415.1, "text": "mir das hier mal zum Vergleich angucke, was die go dudes machen, na gut das erkennt man"}, {"id": 881, "start": 8415.1, "end": 8423.98, "text": "nicht richtig, was macht der IO Broker Typ, hab ich, hab ich nicht, moment, das hab ich"}, {"id": 882, "start": 8423.98, "end": 8432.7, "text": "da nicht drinne, vielleicht, vielleicht brauche man das, vielleicht brauche man hier, weil"}, {"id": 883, "start": 8432.7, "end": 8445.9, "text": "es sonst nicht geht, keine Ahnung, nein, fuck, ok, ich hab alles, xapkey hab ich, hätte"}, {"id": 884, "start": 8445.9, "end": 8454.9, "text": "gesagt wenns nicht geht, client app hab ich, originator hab ich, ah, moment, das setzt"}, {"id": 885, "start": 8454.9, "end": 8470.34, "text": "aber diese signing library ziemlich sicher, welcher request parameter könnte denn da missing"}, {"id": 886, "start": 8470.34, "end": 8485.38, "text": "sein, mach ich ein get oder mach ich ein post, welcher request, der nimmt ne andere url, das"}, {"id": 887, "start": 8485.38, "end": 8494.42, "text": "können wir ausprobieren, ich kann mir die url einfach ausgeben lassen, url, also der"}, {"id": 888, "start": 8494.42, "end": 8511.14, "text": "ändert die ja ab hoffe ich mal, ne das ist ok, was in go, ne der nimmt doch keine andere"}, {"id": 889, "start": 8511.14, "end": 8525.18, "text": "url, der sagt hier execute ap, das ist die, diese funktionsname, die hab ich ja auch,"}, {"id": 890, "start": 8525.18, "end": 8534.66, "text": "dem java script, ja der hat die url unterteilt in host und pass, das dürfte eigentlich das"}, {"id": 891, "start": 8534.66, "end": 8556.5, "text": "gleiche sein, wo ist das problem, wir geben uns mal die header aus, for each, rttp, message"}, {"id": 892, "start": 8556.5, "end": 8575.34, "text": "request header, header, header, key, was die keys sind vertauscht, echt wo, wo, ne, ne"}, {"id": 893, "start": 8575.34, "end": 8591.3, "text": "ist doch nix vertauscht, wo hab ich was vertauscht, also header accept bla bla, wo ist denn, wo"}, {"id": 894, "start": 8591.3, "end": 8599.74, "text": "ist mein content type hin, chat mein content type ist weg, guck mal da, kein content type"}, {"id": 895, "start": 8599.74, "end": 8613.38, "text": "header mehr, der hat sich einfach ausm staub gemacht, also wo ist denn jetzt mein, warum"}, {"id": 896, "start": 8613.38, "end": 8619.7, "text": "ist da kein content type header mehr, wo ist der denn hin, ich setze den hier und unten"}, {"id": 897, "start": 8619.7, "end": 8638.82, "text": "ist er weg, keck bei, ahja gut, call, rttp, message, header, add, da füge ich ihn halt"}, {"id": 898, "start": 8638.82, "end": 8646.42, "text": "wieder hinzu, da kenne ich jetzt nix, so, ah moment, die schleife hätte ich mir mal"}, {"id": 899, "start": 8646.42, "end": 8657.38, "text": "da lassen sollen, so, ah, jetzt ist er wieder da, vielleicht lag es ja da dran, oh, oh,"}, {"id": 900, "start": 8657.38, "end": 8663.62, "text": "misused header name, content type, jetzt möchte mich dotnet wieder davor beschützen"}, {"id": 901, "start": 8663.62, "end": 8668.66, "text": "irgendwas komisches zu machen, aber dotnet du musst mich nicht beschützen, ich will"}, {"id": 902, "start": 8668.66, "end": 8681.3, "text": "absicht, ich will content type reinschreiben, die ist unter anderem auch für den 500e ja,"}, {"id": 903, "start": 8681.3, "end": 8686.42, "text": "aber die geht wahrscheinlich auch dann für die anderen modelle, die uconnect verwenden,"}, {"id": 904, "start": 8686.42, "end": 8699.74, "text": "make sure request headers are used with rttp request message, response header with rttp"}, {"id": 905, "start": 8699.74, "end": 8709.54, "text": "response message, and content headers, rttp content, soll ich hier irgendwie sowas setzen"}, {"id": 906, "start": 8709.54, "end": 8715.34, "text": "oder wie, ich mein, ich kann den content setzen, die sache ist nur die, ich weiß überhaupt"}, {"id": 907, "start": 8715.34, "end": 8720.78, "text": "nicht, was, ich brauch gar kein content, ok, wisst ihr was, bitchy band jetzt einfach,"}, {"id": 908, "start": 8720.78, "end": 8739.74, "text": "new string content, leerer string, encoding utf8 und media type, was, media type header"}, {"id": 909, "start": 8739.74, "end": 8750.3, "text": "value, also ich will einfach nur, dass da application json drin steht, so, bitchy banden"}, {"id": 910, "start": 8750.3, "end": 8757.46, "text": "den jetzt einfach, wir tun einfach so, als ist ein content dran, der ist leer, so bam,"}, {"id": 911, "start": 8757.46, "end": 8764.46, "text": "aber wahrscheinlich liegt es nicht an dem, wait a minute, es hat keinen fehler gegeben,"}, {"id": 912, "start": 8764.46, "end": 8792.46, "text": "moment, guck dir mal, warte, aber content type ist immer noch nicht da, ich hab jetzt"}, {"id": 913, "start": 8792.46, "end": 8805.22, "text": "in leeren content angehängt, das geht jetzt oder was, hä, muss man das in irgendeiner"}, {"id": 914, "start": 8805.22, "end": 8815.1, "text": "art und weise verstehen, ok, gucken wir uns mal den response an, easy, funktioniert, ok,"}, {"id": 915, "start": 8815.1, "end": 8823.1, "text": "ich hab keine autos registriert, bei 4 mit dem neuen account, ja, aber das funktioniert,"}, {"id": 916, "start": 8823.1, "end": 8839.1, "text": "guckt euch das mal an, also man muss ernsthaft einen leeren content setzen, dass das funktioniert,"}, {"id": 917, "start": 8839.1, "end": 8845.1, "text": "ja, ok, das hätte ich nicht gedacht, wenn ich ehrlich bin, aber ich muss das ja auch"}, {"id": 918, "start": 8845.1, "end": 8850.34, "text": "nicht denken, es reicht ja, wenn es funktioniert, broken api, also die api ist wirklich richtig"}, {"id": 919, "start": 8850.34, "end": 8857.14, "text": "pepega, wir können jetzt noch mal hier was schickes draus machen und zwar, wir können"}, {"id": 920, "start": 8857.14, "end": 8874.7, "text": "hier sowas machen wie aws sign, sowas, overload, generate, äh, kann man da irgendwie extension"}, {"id": 921, "start": 8874.7, "end": 8894.94, "text": "methods generaten, anscheinend, dann mach ich das von hand in meinem helper file, public"}, {"id": 922, "start": 8894.94, "end": 8917.66, "text": "static void, aws sign, credentials, so, ähm, this, was ist denn das, plural request oder"}, {"id": 923, "start": 8917.66, "end": 8945.82, "text": "sowas, request, ah, ah, ah, credentials, was, reach an endpoint provider v2, was will"}, {"id": 924, "start": 8945.82, "end": 8962.94, "text": "das ding von mir, ah, ich hab den falschen signer importiert, ah, ich, ich muss es nochmal"}, {"id": 925, "start": 8962.94, "end": 8973.74, "text": "löschen, amazon, ja, ja, geh weg, signer, ich will den da haben und hier will ich, wahrscheinlich"}, {"id": 926, "start": 8973.74, "end": 8978.86, "text": "das da haben und hier will ich wahrscheinlich das da haben, meine güde, äh, ok, jetzt"}, {"id": 927, "start": 8978.86, "end": 8986.46, "text": "hab ich immer noch credentials, immer noch da, jawoll, perfekt, excellent, so, ah ne,"}, {"id": 928, "start": 8986.46, "end": 8997.62, "text": "jetzt muss ich das noch return, return, return request, so und jetzt, ja, ist ja gut, hier,"}, {"id": 929, "start": 8997.62, "end": 9004.5, "text": "ja, guck, jetzt, jetzt gehts, exellent, guck mal, jetzt ist das sogar richtig lesbar, oder,"}, {"id": 930, "start": 9004.5, "end": 9014.18, "text": "wo erstmal gleich was abgeht, zack, funktioniert, das ist gar nicht mal so übel, muss ich sagen,"}, {"id": 931, "start": 9014.18, "end": 9033.38, "text": "muss ich sagen, das ist gar nicht mal so schlecht, oh, das try catch kommt wieder weg, ups, äh,"}, {"id": 932, "start": 9033.38, "end": 9037.7, "text": "schön sie schaben, ja, beste, beste sprache, das ist jetzt sogar relativ lesbar, muss ich"}, {"id": 933, "start": 9037.7, "end": 9044.86, "text": "sagen, dadurch, dass ich den kram hier ausgelagert hab, ist das wirklich ganz ok, man könnte"}, {"id": 934, "start": 9044.86, "end": 9050.3, "text": "sich jetzt vielleicht noch überlegen, ob man hier x client version, x apk, x originator"}, {"id": 935, "start": 9050.3, "end": 9065.06, "text": "und so, ob man noch so nen, sowas hier macht, nur für das, nur für diesen krempel da,"}, {"id": 936, "start": 9065.06, "end": 9073.14, "text": "beides sind header, ne, with, kann man da auch mehrere anhängen, mit headers, headers, object"}, {"id": 937, "start": 9073.14, "end": 9084.58, "text": "headers, ja, ja, kann man, dann machen wir doch mal sowas hier, Leute, das ist eklig,"}, {"id": 938, "start": 9084.58, "end": 9097.18, "text": "da musst du irgendwas schöneres geben, das anzuhängen, oder, copy paste, default, AWS"}, {"id": 939, "start": 9097.18, "end": 9123.42, "text": "oder so, yes, ne, wie haben wir es genannt, default, header, ah, man, ok, header, so,"}, {"id": 940, "start": 9123.42, "end": 9134.58, "text": "dann nehmen wir den krempel mal um, ah, header, ja, ja, ah, gut, ich will es nicht sehen,"}, {"id": 941, "start": 9134.58, "end": 9141.78, "text": "das ist hässlich, aber das ist auf jeden fall besser, als jedes mal den gleichen kram hinzuschreiben,"}, {"id": 942, "start": 9141.78, "end": 9145.18, "text": "du findest das problematisch, dass die Sachen in der cloud sind, ja, ich finde es auch nicht"}, {"id": 943, "start": 9145.18, "end": 9148.94, "text": "schön, aber was willst du machen, ne, in dem Fall ist es halt so, entweder greife ich"}, {"id": 944, "start": 9148.94, "end": 9153.5, "text": "die Sachen über die cloud ab, oder gar nicht, vielleicht hat man mal später die Chance,"}, {"id": 945, "start": 9153.5, "end": 9158.18, "text": "das über den bluetooth debug interface vom auto abzugreifen, aber aktuell gibt es quasi"}, {"id": 946, "start": 9158.18, "end": 9163.26, "text": "noch nichts, was den aktuellen fiat 500e ordentlich unterstützt, das heißt, ich muss"}, {"id": 947, "start": 9163.26, "end": 9168.46, "text": "das über die cloud abgreifen, in zwei, drei jahren, wenn dieses cloud abo ausläuft, was"}, {"id": 948, "start": 9168.46, "end": 9173.42, "text": "dabei ist, wo ich mir dann, je nachdem was es kostet, wirklich auch hart überlege, das"}, {"id": 949, "start": 9173.42, "end": 9179.94, "text": "zu verlängern, also nicht zu verlängern, dann gibt es vielleicht irgendwelche debug"}, {"id": 950, "start": 9179.94, "end": 9184.86, "text": "interfaces, die man dranstecken kann und per bluetooth auslesen oder so, das wäre mir natürlich"}, {"id": 951, "start": 9184.86, "end": 9190.74, "text": "auch deutlich lieber, als hier irgendwas über die cloud zu machen, keine frage, also wir"}, {"id": 952, "start": 9190.74, "end": 9197.7, "text": "brauchen das da, das da, das da, das ist alles das default zeug, was man immer braucht,"}, {"id": 953, "start": 9197.7, "end": 9221.22, "text": "also, zack, zack, zack, x header, guck mal hier, wer das nicht checkt, was ich vor habe,"}, {"id": 954, "start": 9221.22, "end": 9241.9, "text": "wäre nämlich, hatte ich gescheit einrücken, direkt hier, und da geht´s wirklich alles"}, {"id": 955, "start": 9241.9, "end": 9250.3, "text": "Alter kannst du das mal gescheit einrücken Format jawoll so und jetzt können wir nämlich"}, {"id": 956, "start": 9250.3, "end": 9270.66, "text": "an der stelle sagen with headers und dann AWS default headers ach nee das ist heim"}, {"id": 957, "start": 9270.66, "end": 9280.82, "text": "default ist null oder ja das geht nicht da muss mir etwas schöneres ausdenken als hier"}, {"id": 958, "start": 9280.82, "end": 9290.58, "text": "ein leeres objekt zu übergeben das ist hässlich rust des das habe ich gesehen auf github ja"}, {"id": 959, "start": 9290.58, "end": 9296.18, "text": "das ist eher team viewer alternative glaube wenn ich das wenn ich das richtig erkannt"}, {"id": 960, "start": 9296.18, "end": 9312.62, "text": "habe du du du du du du du du du du du du du du du das kann ich eigentlich kann ich mir"}, {"id": 961, "start": 9312.62, "end": 9328.34, "text": "das alles sparen fertig das kommt weg aber noch nicht reich doch und das und das bräuchte"}, {"id": 962, "start": 9328.34, "end": 9336.38, "text": "ich dann auch nicht extra sondern ja und es einfach so machen so wo brauchen die die default"}, {"id": 963, "start": 9336.38, "end": 9345.34, "text": "headers noch da so mal gucken ob du alles funst ich habe jetzt ich habe jetzt 500 e gekauft"}, {"id": 964, "start": 9345.34, "end": 9356.58, "text": "vor zwei wochen ja funst noch alles exzellent du du du du du du du du ich bin begeistert"}, {"id": 965, "start": 9356.58, "end": 9368.82, "text": "ich meine das war jetzt sehr abartig wie viel reichweite also ich habe es noch nie leer"}, {"id": 966, "start": 9368.82, "end": 9381.7, "text": "gefahren also irgendwas so um 270 280 kilometer was das für ein wartungsintervall hat also"}, {"id": 967, "start": 9381.7, "end": 9389.5, "text": "wenn du vier fragst dann alle sieben bis achttausend kilometer ob ich das mache weiß ich nicht"}, {"id": 968, "start": 9389.5, "end": 9399.86, "text": "ich meine ich brauche dafür jeden jahr bis ich die gefahren bin oder so und muss nicht"}, {"id": 969, "start": 9399.86, "end": 9403.78, "text": "sein ich meine aber für firmware updates und so vielleicht weil du kannst nicht alles"}, {"id": 970, "start": 9403.78, "end": 9422.74, "text": "OTA updaten nee ich glaube es sind 7000 ich glaube es ist so was wie ein Jahr oder 7000"}, {"id": 971, "start": 9422.74, "end": 9435.06, "text": "oder oder irgendwie so oder oder 7000 oder in den jahr irgendwie so ja du musst das auto"}, {"id": 972, "start": 9435.06, "end": 9439.82, "text": "die firmen wir mussten firmen wir updaten lassen in der werkstatt jetzt mal ernsthaft"}, {"id": 973, "start": 9439.82, "end": 9446.74, "text": "ich finde das ist halbwegs gut lesbar hier sogar guck mal ich mein man man versteht direkt"}, {"id": 974, "start": 9446.74, "end": 9464.46, "text": "was passiert es ist halt die api von fiat ist halt eklig es fack aber man versteht es"}, {"id": 975, "start": 9464.46, "end": 9471.5, "text": "und es funktioniert alles so wir können jetzt natürlich mit meinen credentials hier im stream"}, {"id": 976, "start": 9471.5, "end": 9478.94, "text": "nicht weitermachen also normalerweise müsste ich jetzt um weiter zu machen hier das austauschen"}, {"id": 977, "start": 9478.94, "end": 9488.34, "text": "durch meinen echten account und nicht durch diesen fake account weil naja der fake account"}, {"id": 978, "start": 9488.34, "end": 9496.58, "text": "hat ja keine autos registriert wie ihr hier seht aber es ist alles nicht schlimm denn"}, {"id": 979, "start": 9496.58, "end": 9506.78, "text": "ich habe schon eine ein anonymisierten response von meinem auto hier als jason feil die würde"}, {"id": 980, "start": 9506.78, "end": 9511.42, "text": "man jetzt also normalerweise läuft es jetzt so hier würde mir als antwort also habe ich"}, {"id": 981, "start": 9511.42, "end": 9519.1, "text": "im browser so gesehen also man kann ja browser network tab machen und im netzwerk tab von"}, {"id": 982, "start": 9519.1, "end": 9524.74, "text": "der seite kann man sich die die requests angucken also man bekommt hier eine fahrzeug id zurück"}, {"id": 983, "start": 9524.74, "end": 9529.58, "text": "und mit der fahrzeug id kann ich dann den weiteren request machen wo ich dann hier die"}, {"id": 984, "start": 9529.58, "end": 9537.7, "text": "ganzen vehikel infos bekomme wo dann unter anderem so sachen drinne stehen wie kilometerzähler"}, {"id": 985, "start": 9537.7, "end": 9545.7, "text": "wie weit muss ich fahren dass die batterie leer ist reifendruck öllevel was es nicht"}, {"id": 986, "start": 9545.7, "end": 9557.66, "text": "gibt driestatus und so ja und man kann über die api wohl auch klimaanlage und sowas einschalten"}, {"id": 987, "start": 9557.66, "end": 9564.5, "text": "was natürlich auch ganz nützlich ist was du machen kannst du kannst danach in deine"}, {"id": 988, "start": 9564.5, "end": 9569.22, "text": "heim automatisierung dein auto einbinden du kannst dann zum beispiel in deine heim automatisierung"}, {"id": 989, "start": 9569.22, "end": 9576.3, "text": "also einmal anzeigen lassen sachen wie ladet zustand von einer batterie bei wieviel prozent"}, {"id": 990, "start": 9576.3, "end": 9582.66, "text": "die ist wieviel kilometer du damit fahren kannst ob dein reifendruck ok ist und sowas"}, {"id": 991, "start": 9582.66, "end": 9586.38, "text": "kannst du dir alles anzeigen lassen und du kannst auch buttons machen zum beispiel zum"}, {"id": 992, "start": 9586.38, "end": 9591.94, "text": "vorklimatisieren vom auto also wenn du sagst ich fahre in fünf minuten los ist es 38 grad"}, {"id": 993, "start": 9591.94, "end": 9598.46, "text": "draußen ich würde schon mal die klimaanlage anmachen kannst hier einen button rein machen"}, {"id": 994, "start": 9598.46, "end": 9603.06, "text": "kannst du kannst du kannst total viel abfragen das weiß ich aus dem kopf gar nicht alles"}, {"id": 995, "start": 9603.06, "end": 9608.38, "text": "du kannst ab du kannst aufschließen abschließen das will ich würde ich jetzt aber nicht unbedingt"}, {"id": 996, "start": 9608.38, "end": 9614.74, "text": "empfehlen du kannst licht anmachen du kannst hupen das würde ich auch nicht unbedingt"}, {"id": 997, "start": 9614.74, "end": 9625.86, "text": "empfehlen du kannst du kannst ein paar sachen machen ich weiß aus dem kopf du kannst relativ"}, {"id": 998, "start": 9625.86, "end": 9644.34, "text": "viel machen ja du kannst zum beispiel gucken ob der stecker angesteckt ist also sprich ist"}, {"id": 999, "start": 9644.34, "end": 9651.82, "text": "der lade stecker angesteckt das siehst du hier dran an dem plug plug in status wenn"}, {"id": 1000, "start": 9651.82, "end": 9656.94, "text": "das auf true steht kannst du sehen ok das ist angeschlossen dann kannst du halt gucken"}, {"id": 1001, "start": 9656.94, "end": 9660.78, "text": "du kannst es dann beispielsweise sagen hey wenn es angeschlossen ist dann refresh mir"}, {"id": 1002, "start": 9660.78, "end": 9664.98, "text": "alle viertel stunde mal und sagt mir dann alle viertel stunde wie voll jetzt der akku"}, {"id": 1003, "start": 9664.98, "end": 9672.66, "text": "ist und dann kannst du gucken und wenn der akku voll ist und dann beispielsweise sagt"}, {"id": 1004, "start": 9672.66, "end": 9677.98, "text": "hier charging status ist nicht mehr charging lässt du dir zum beispiel eine push notification"}, {"id": 1005, "start": 9677.98, "end": 9687.54, "text": "schicken auto ist voll oder keine ahnung oder wie auch immer man darauf reagieren will"}, {"id": 1006, "start": 9687.54, "end": 9694.98, "text": "oder du kannst dir ok sagen wir mal was realistischeres mal was realistischeres ja der liest aus wie"}, {"id": 1007, "start": 9694.98, "end": 9700.7, "text": "voll die batterie ist und dann machst du eine automatisierung das wenn es keine ahnung"}, {"id": 1008, "start": 9700.7, "end": 9707.3, "text": "ist es abends 21 uhr 22 uhr 23 du gehst ins bett das kriegt der home assistant mit je"}, {"id": 1009, "start": 9707.3, "end": 9713.22, "text": "nachdem wenn es gescheit gemacht hast du gehst ins bett und sagen wir du hast vergessen das"}, {"id": 1010, "start": 9713.22, "end": 9718.34, "text": "auto zu laden und laden und die batterie ist nur noch bei 30 prozent dann könnte die push"}, {"id": 1011, "start": 9718.34, "end": 9724.62, "text": "notification schicken und sagen ey alter du bist grad ins bett aber dein auto ist noch"}, {"id": 1012, "start": 9724.62, "end": 9730.42, "text": "bei 30 prozent batterie und es ist auch nicht eingesteckt und dann kannst du noch mal in"}, {"id": 1013, "start": 9730.42, "end": 9737.1, "text": "hof flitzen und schnell anschließen über nacht aufladen alternativ kannst du dein auto"}, {"id": 1014, "start": 9737.1, "end": 9744.06, "text": "auch morgen nicht wach hupen lassen ja das kannst du allerdings nur machen wenn nicht"}, {"id": 1015, "start": 9744.06, "end": 9759.26, "text": "so viele leute drum herum wohnen wie bekommst du die daten später in home assistant rein"}, {"id": 1016, "start": 9759.26, "end": 9768.02, "text": "über home assistant mqtt discovery bekomme ich die rein kannst du mit der api auch das"}, {"id": 1017, "start": 9768.02, "end": 9778.62, "text": "laden pluppieren somit bis zu maximal 85 prozent laden aero zati weiß ich wie man es richtig"}, {"id": 1018, "start": 9778.62, "end": 9785.7, "text": "ausspricht aber dankeschön für den zapp da bin ich mir gar nicht sicher was der unterstützt"}, {"id": 1019, "start": 9785.7, "end": 9794.02, "text": "alles das einfachste dürfte sein du hast ein ladegerät was du ausschalten kannst remote"}, {"id": 1020, "start": 9794.02, "end": 9800.98, "text": "dann würdest du es nämlich so machen das müsste man mal gucken also zum beispiel wir"}, {"id": 1021, "start": 9800.98, "end": 9809.9, "text": "gucken mal beim iow broker rein was der hier unterstützt an ihr deep refresh zene charge"}, {"id": 1022, "start": 9809.9, "end": 9827.14, "text": "anscheinend kann man das ein und ausschalten würde ich jetzt mal vermuten ok command update"}, {"id": 1023, "start": 9827.14, "end": 9836.38, "text": "location warum über mqtt und nicht über die home assistant api weil es über mqtt"}, {"id": 1024, "start": 9836.38, "end": 9843.86, "text": "viel viel einfacher ist finde ich kannst auch über die home assistant api machen wobei"}, {"id": 1025, "start": 9843.86, "end": 9849.66, "text": "standardmäßig ist die htp api glaube ich sogar aus nicht standardmäßig die htp api"}, {"id": 1026, "start": 9849.66, "end": 9864.58, "text": "sogar aus doch die ist standardmäßig aus doch die ist aus du kannst ihnen den rest"}, {"id": 1027, "start": 9864.58, "end": 9874.42, "text": "denn so anlegen in der config zumindest über mqtt ist viel viel einfacher gerade auch wenn"}, {"id": 1028, "start": 9874.42, "end": 9879.18, "text": "du zwei wenn du bidirektionale kommunikation brauchst weil ich mir gar nicht sicher bin"}, {"id": 1029, "start": 9879.18, "end": 9885.86, "text": "ob ich das brauche in dem fall über mqtt ist wirklich simpel du kannst über mqtt auch"}, {"id": 1030, "start": 9885.86, "end": 9905.82, "text": "die ich mach mal aus wir machen heute kein home assistant ok du kannst über mqtt das"}, {"id": 1031, "start": 9905.82, "end": 9911.54, "text": "auch gruppieren lassen zu zu die weißes die dann sensoren drunter haben das ist viel wenn"}, {"id": 1032, "start": 9911.54, "end": 9917.94, "text": "ich gehe noch nicht ins bett leute ich habe home assistant ausgemacht also es ist viel"}, {"id": 1033, "start": 9917.94, "end": 9923.02, "text": "einfacher als über die api mit mqtt was natürlich noch einfacher wäre ist achso darksone"}, {"id": 1034, "start": 9923.02, "end": 9929.22, "text": "machst gut was natürlich noch viel einfacher wäre ist wenn man eine direkte home assistant"}, {"id": 1035, "start": 9929.22, "end": 9935.94, "text": "integration macht was gegen eine direkte home assistant integration für mich spricht ist"}, {"id": 1036, "start": 9935.94, "end": 9942.02, "text": "erstens habe ich noch nie gemacht zweitens ich muss den kram in python programmieren mit sachen"}, {"id": 1037, "start": 9942.02, "end": 9949.18, "text": "die ich noch nie verwendet habe hält sich mein spaß in grenzen und man kann container wenn es"}, {"id": 1038, "start": 9949.18, "end": 9957.9, "text": "mal probleme gibt auch einfacher neu starten und wenn die fiat integration langsam ist aus"}, {"id": 1039, "start": 9957.9, "end": 9963.62, "text": "irgendwelchen gründen macht es nicht meinen ganzen home assistant langsamer gut ich mein man muss"}, {"id": 1040, "start": 9963.62, "end": 9968.74, "text": "man sollte die integration also die home assistant integrations e asynch laufen lassen aber trotzdem"}, {"id": 1041, "start": 9968.74, "end": 9976.82, "text": "ist mir lieber zumal in home assistant addon auch easy ist du klickst den web interface addon"}, {"id": 1042, "start": 9976.82, "end": 9983.1, "text": "installieren wählst das fiat addon aus und gut ist musst du noch deine muss nur noch user namen"}, {"id": 1043, "start": 9983.1, "end": 9999.86, "text": "password hinzufügen also guck das sind die kommandos die man senden kann also man kann sagen"}, {"id": 1044, "start": 9999.86, "end": 10007.94, "text": "unlock lock das weiß ich nicht ob ich das wirklich als button einbauen will ich will"}, {"id": 1045, "start": 10007.94, "end": 10018.22, "text": "eigentlich mein auto nicht anlocken remote aber ok geht das über es geht immer übers"}, {"id": 1046, "start": 10018.22, "end": 10026.82, "text": "internet der fiat hat ein lte sim karte mit lte drinne und darüber wird kommuniziert du kannst"}, {"id": 1047, "start": 10026.82, "end": 10032.38, "text": "aber auch live die position abfragen also wenn irgendjemand mit deinem auto rum fährt dann"}, {"id": 1048, "start": 10032.38, "end": 10041.38, "text": "kannst du gucken wo das gerade ist und sowas alles stalken also du kannst du kannst abschließen"}, {"id": 1049, "start": 10041.38, "end": 10050.54, "text": "du kannst aufmachen du kannst die position abfragen du kannst das licht einschalten du kannst den"}, {"id": 1050, "start": 10050.54, "end": 10059.58, "text": "kofferraum zumachen du kannst den kofferraum aufmachen du kannst strom anschalten strom"}, {"id": 1051, "start": 10059.58, "end": 10065.58, "text": "ausschalten da steht zwar engine aber im prinzip ist strom an strom aus für die systeme innen"}, {"id": 1052, "start": 10065.58, "end": 10075.94, "text": "drinne du kannst blinken lassen dass man sehen kann wo das auto gerade steht du kannst die"}, {"id": 1053, "start": 10075.94, "end": 10085.42, "text": "alarmanlage ausschalten du kannst ihn laden lassen wenn er grad noch nicht lädt wie auch"}, {"id": 1054, "start": 10085.42, "end": 10091.42, "text": "immer das funktionieren soll weil er lädt ja eigentlich immer wenn man einstöpselt"}, {"id": 1055, "start": 10091.42, "end": 10101.78, "text": "das gibt es nicht du kannst die klimaanlage einschalten ich hoffe man kann damit die"}, {"id": 1056, "start": 10101.78, "end": 10107.78, "text": "klimaanlage auch wieder ausschalten weil weil stellt euch mal vor ihr schaltet die"}, {"id": 1057, "start": 10107.78, "end": 10114.7, "text": "klimaanlage ein weil ihr in fünf minuten los wollt dann ruft jemand an und sagt ach"}, {"id": 1058, "start": 10114.7, "end": 10124.14, "text": "hier es fällt aus und dann bleibt die für immer an oder wie das kann das kann es ja"}, {"id": 1059, "start": 10124.14, "end": 10128.38, "text": "nicht sein vielleicht vielleicht muss ich dann engine off senden wenn ich es ausschalten"}, {"id": 1060, "start": 10128.38, "end": 10141.82, "text": "will die lade steckdose ist noch nicht in der garage aktuell lade ich noch aus der steckdose"}, {"id": 1061, "start": 10141.82, "end": 10148.34, "text": "weil ich noch kein elektriker gefunden habe der mir das ding an die wand schraubt beziehungsweise"}, {"id": 1062, "start": 10148.34, "end": 10152.5, "text": "das schrauben ist ja nicht das problem an die wand dass das kabel im keller anschließen"}, {"id": 1063, "start": 10152.5, "end": 10168.74, "text": "hast du schon geschaut wie man das auto flaschen kann ja ich habe zumindest geschaut wie man"}, {"id": 1064, "start": 10168.74, "end": 10174.02, "text": "man mit irgendwelchen debugger entran kommt um sachen auszulesen aber es gibt noch keine"}, {"id": 1065, "start": 10174.02, "end": 10180.34, "text": "guten debugger für den neuen 500 e und was geht es gerade ich will mein neues auto in"}, {"id": 1066, "start": 10180.34, "end": 10185.62, "text": "die heim automatisierung einbinden wir haben es zumindest schon geschafft heute das war"}, {"id": 1067, "start": 10185.62, "end": 10189.78, "text": "tatsächlich erfolgreicher als ich gedacht habe wir haben es tatsächlich geschafft dass"}, {"id": 1068, "start": 10189.78, "end": 10196.26, "text": "ich mich einloggen kann bei fiat über die api und dort meine autos abfragen kann mit"}, {"id": 1069, "start": 10196.26, "end": 10200.18, "text": "einem fake account der keine autos hat aber ich logg mich hier im stream nicht mit meinem"}, {"id": 1070, "start": 10200.18, "end": 10211.3, "text": "echtem echtem account ein doch die handwerks plattform gibt es schon aber das hat ja keiner"}, {"id": 1071, "start": 10211.3, "end": 10215.78, "text": "hat er keine zeit ich meine ich habe ich habe bei sieben oder acht elektriker mittlerweile"}, {"id": 1072, "start": 10215.78, "end": 10221.58, "text": "angerufen die haben alle wartezeiten von wochen eher monaten und bei einem habe ich angerufen"}, {"id": 1073, "start": 10221.58, "end": 10229.5, "text": "und er meinte schon ganz am anfang deutsche deutsches kollege nicht da was was ich wollen"}, {"id": 1074, "start": 10229.5, "end": 10236.54, "text": "habe ich schon was ist da los gut ist ja nicht schlimm erzählste mal habe ich ihm erzählt"}, {"id": 1075, "start": 10236.54, "end": 10246.02, "text": "ja ich will mir ladegerät im hof installieren lassen und also ein elf kilowatt ladegerät"}, {"id": 1076, "start": 10246.02, "end": 10252.3, "text": "bla bla bla und ob die das machen und dann meinten sie ja das machen sie und dann war"}, {"id": 1077, "start": 10252.3, "end": 10260.3, "text": "die antwort nur noch da war die antwort darauf von ihm das wird das wird kosten das wird"}, {"id": 1078, "start": 10260.3, "end": 10267.5, "text": "kosten 900 euro da habe ich mir gedacht okay dass er jetzt ein bisschen scam wenn er die"}, {"id": 1079, "start": 10267.5, "end": 10271.06, "text": "sache noch nicht gesehen hat und keine ahnung hat was er machen muss dass er gleich sagen"}, {"id": 1080, "start": 10271.06, "end": 10281.86, "text": "wird das wird kosten 900 euro da habe ich mir gedacht zu denen gehe ich nicht also das"}, {"id": 1081, "start": 10281.86, "end": 10289.46, "text": "hat mir das war mir zu zu zu scam wenn das erste ist was die eine erzählt das wird kosten"}, {"id": 1082, "start": 10289.46, "end": 10298.22, "text": "das weiß ich also das war wahrscheinlich der einzige der zeit hatte aber den will ich nicht"}, {"id": 1083, "start": 10298.22, "end": 10309.58, "text": "und die anderen haben alle keine zeit ja natürlich 900 euro sind viel zu viel also ich meine"}, {"id": 1084, "start": 10309.58, "end": 10317.1, "text": "realistisch betrachtet muss der muss dann verlängerungskabel legen und so ein kleine so eine kleine schalt"}, {"id": 1085, "start": 10317.1, "end": 10322.38, "text": "wasserdichte schalt wasserdichte box an die wand machen und dort dann halt das verlängerungskabel"}, {"id": 1086, "start": 10322.38, "end": 10327.46, "text": "anschließen mit dem mit mit der ladestation also das ist nicht schwer ich gehe davon aus"}, {"id": 1087, "start": 10327.46, "end": 10337.02, "text": "es macht jeder elektriker easy in einer stunde oder so die box habe ich ja auch die habe"}, {"id": 1088, "start": 10337.02, "end": 10345.26, "text": "ich ja schon da die muss sie muss ja nicht kaufen oder so die kabel kannst du noch selbst"}, {"id": 1089, "start": 10345.26, "end": 10358.34, "text": "anschließen naja woran denn woran woran soll ich dir anschließen ich also es muss irgendjemand"}, {"id": 1090, "start": 10358.34, "end": 10370.38, "text": "im keller an den kasten gehen ein kabel legen von dem kasten an das fenster dann am fenster"}, {"id": 1091, "start": 10370.38, "end": 10378.34, "text": "vorbei in hof das geht aber das ist alles offen also da kommt man durch im hof muss"}, {"id": 1092, "start": 10378.34, "end": 10384.86, "text": "er so eine kleine wasserdichte box hinsetzen und in der box muss er dann anschließen die"}, {"id": 1093, "start": 10384.86, "end": 10393.38, "text": "die fünf kabel von der von der sobald die box da ist kann ich da selbst anschließen"}, {"id": 1094, "start": 10393.38, "end": 10398.1, "text": "ja aber unten am schaltschrank irgendwelche verlängerungs dinger legen und eventuell"}, {"id": 1095, "start": 10398.1, "end": 10402.54, "text": "noch eine sicherung einbauen und so das kann ich nicht oder sagen wir mal so ich könnte"}, {"id": 1096, "start": 10402.54, "end": 10407.06, "text": "das wahrscheinlich schon aber erstens traue ich mich das nicht und zweitens muss das ja"}, {"id": 1097, "start": 10407.06, "end": 10414.7, "text": "eh jemand machen der ahnung davon hat ich brauche keinen eigenen zähler ich habe doch"}, {"id": 1098, "start": 10414.7, "end": 10418.7, "text": "in der in meiner ladestation steht doch drinne in meiner wallbox steht doch drinne wie viel"}, {"id": 1099, "start": 10418.7, "end": 10439.34, "text": "er verbraucht ach es gibt extra strom tarife zum auto aufladen oder was oder wie schickt"}, {"id": 1100, "start": 10439.34, "end": 10462.42, "text": "mal link blitz zeig mal zeig mal schickt mal nach was muss ich gucken also das heißt man"}, {"id": 1101, "start": 10462.42, "end": 10466.78, "text": "braucht einen eigenen zähler ja aber wie eigener zähler das muss doch dann irgendeiner sein"}, {"id": 1102, "start": 10466.78, "end": 10474.18, "text": "der von von dem von dem netzbetreiber wieder geeicht und und autorisiert und was auch immer"}, {"id": 1103, "start": 10474.18, "end": 10493.62, "text": "ist okay zeig mal ja eh auto zu hause ökologisch laden gut ich meine das funktioniert mit jeder"}, {"id": 1104, "start": 10493.62, "end": 10498.06, "text": "wallbox das muss ja keine spezielle sein das ist ja die wollen wahrscheinlich ihre eigenen"}, {"id": 1105, "start": 10498.06, "end": 10514.5, "text": "sachen kaufen aber das ist natürlich blödsinn das geht natürlich mit jedem"}, {"id": 1106, "start": 10514.5, "end": 10519.5, "text": "der muss nicht buddeln der kann einfach das durch durch durch leere rohr schieben ich"}, {"id": 1107, "start": 10519.5, "end": 10525.1, "text": "habe ein leerrohr vom keller durch die wand in hof also der muss eigentlich nur das kabel"}, {"id": 1108, "start": 10525.1, "end": 10551.54, "text": "anschließen ok ok das wäre natürlich wirklich sehr nice so was da muss ich mal schlaum machen"}, {"id": 1109, "start": 10551.54, "end": 10563.82, "text": "ja und wie wo muss der zähler dann hin ich meine der muss ja wahrscheinlich hinter nee"}, {"id": 1110, "start": 10563.82, "end": 10582.22, "text": "ok ich habe echt keine ahnung wie das wie das wie das funken soll ja ein verteiler dürfte"}, {"id": 1111, "start": 10582.22, "end": 10593.74, "text": "die zähler sind jetzt nicht mehr so groß ich habe aber keine ahnung wie das dann funktioniert"}, {"id": 1112, "start": 10593.74, "end": 10601.18, "text": "also das ist dann ein zweiter zähler der kommt dann quasi parallel zum jetzigen zähler von"}, {"id": 1113, "start": 10601.18, "end": 10606.26, "text": "den stadtwerken oder wie das dann quasi auf dem stadtwerke zähler das drauf ist was ich"}, {"id": 1114, "start": 10606.26, "end": 10609.66, "text": "im haus verbrauchen auf dem anderen das drauf ist was ich im auto verbrauche oder wie oder"}, {"id": 1115, "start": 10609.66, "end": 10616.42, "text": "was oder wo ich habe keine ahnung wie das funktionieren soll aber ok muss ich mal muss"}, {"id": 1116, "start": 10616.42, "end": 10623.82, "text": "ich mal gucken doch das wäre besser aber ich habe keine solar panels auf dem dach zur"}, {"id": 1117, "start": 10623.82, "end": 10628.06, "text": "zeit also das werde ich mir nächstes jahr erst angucken so lange irgendwie muss ich"}, {"id": 1118, "start": 10628.06, "end": 10649.38, "text": "gerade aufladen ja super"}, {"id": 1119, "start": 10649.38, "end": 10668.66, "text": "ja da muss ich mal gucken was es da was es da gibt ja"}, {"id": 1120, "start": 10668.66, "end": 10694.5, "text": "ja leute alles klar ich glaube das reicht für heute wir machen das nächste mal weiter"}, {"id": 1121, "start": 10694.5, "end": 10700.82, "text": "aber schon mal pock dass das mit dem login funktioniert hat muss ich sagen sehr nice"}, {"id": 1122, "start": 10700.82, "end": 10712.18, "text": "jetzt ist betke angesagt bis denn macht es gut zu ich hoffe euch hat es gefallen bis"}, {"id": 1123, "start": 10712.18, "end": 10726.3, "text": "denn"}]}