{"text": "Proc, moin! Kann man vom zweiten Bildschirm kurz was nachgucken. Hätte ich nicht gedacht, dass Twitch heute so schnell checkt, dass der Stream on ist. Ich bin ziemlich im Arsch heute, ich habe gedacht, ich mache trotzdem noch mal Stream an. Ich muss euch mal was fragen. Geht euch das auch manchmal so, dass ihr manche Leute einfach nicht versteht, was die sagen? Ich meine nicht akustisch, weil auch geschrieben im Moin Michael 5 Spieljahr, und wie ist es mit Lisa gelaufen? Sowohl geschrieben als auch gesprochen, ihr versteht sie einfach nicht. Ich habe mit einem Kollegen auf der Arbeit und ich verstehe ihn einfach nicht. Ich denke mir jetzt mal was aus, ich frage ihn nach dem Motto, kannst du dich per SSH einloggen und neu starten? Und dann kommt als Antwort von ihm, ok danke. Was will er mir sagen, der antwortet immer so, ich verstehe ihn einfach nicht. Der antwortet immer so, dass ich es nicht verstehe. Nein das ist kein Autoresponder, der schreibt das wirklich. Es kann auch sein, dass er mich nicht versteht, es kann auch sein, man soll er halt was sagen, Max was meinst du? Keine Ahnung, der müsste es eigentlich, ich verstehe ihn nicht. Oder ein anderes Beispiel, dabei hat er wirklich Plan von dem was er macht, ich verstehe ihn einfach nicht. Auch was, ich habe ihn gefragt, kannst du die zwei Merchrequests aus dem Bitbucket jetzt in GitHub aufmachen? Hab ich ihn gefragt, ist doch eigentlich relativ klar oder? Und dann meint er, ich pushe erst heute Abend was, war die Antwort da drauf. Da muss nichts gepusht werden, ist alles da? Ich verstehe es nicht, ich habe wirklich Probleme ihn zu verstehen. Nein, nein, nein, nein, das meint er schon ernst, ich verstehe ihn bloß nicht. Richtig Ayaya, aber Massive Ayaya. Ach der Cutebot hat es jetzt gecheckt, das ist nice. Rüpel, Dankeschön für den Sub, Mr. Moogame, 203 IQ, aber Massive IQ. Nein, nein, der hat auch nicht so viel zu tun, ich kann das ausschließen, ich glaube der will das eins zu eins so schreiben, nur verstehe ich die Antwort nicht. Ich habe mit keinem Problem ihn zu verstehen, aber ihn verstehe ich einfach nicht. Vielleicht sagt der X und meint eigentlich Y, das kann natürlich sein, das wäre möglich, aber ich verstehe ihn trotzdem nicht. Die Benachrichtigung ist nicht jebait, die ist real. Wenn ich jetzt Battlefield 2042 spiele, da kriege ich gar nichts auf die Reihe und wahrscheinlich reg ich mich nur auf. Na gut, ich meine ich reg mich wahrscheinlich sonst auch auf, aber noch mehr. Ja dann, dann ist ja gut, da konntest du ja punkten. Ja das gibt es auch, wir haben da auch so einen Spezialist, das ist ganz schlimm. Wenn bei uns Wartungsarbeiten, ne wie heißt das offiziell? Chat hilft mir auf die Reihe, ITIL, ITIL Style, ich sage immer Wartungsarbeiten Runde, wie heißt das nochmal? Change Advisory Board, genau jetzt habe ich es wieder, das ist so ITIL Begriff und alle die ITIL Begriffe verwenden sind. Fivehead irgendwie, kommen sich zumindest so vor. Change Advisory Board, da haben wir auch jemand. Der stellt immer Nachfragen, um aus Prinzip nachzufragen und genau so, genau so nach diesem Schema. Man sagt zum Beispiel, ja dann müssen wir das Zertifikat austauschen, aber das haben wir schon so oft gemacht. Da macht man einen Server, danach den zweiten und da kriegt keiner was mit. Gerade irgendwie um 1 Uhr nachts passiert da nichts, es sei denn es kommt wirklich gerade irgendwie zu dieser millisekundenen Request. Ich würde sagen es ist Standard Change und dann kommt dann irgend so ein Typ dann an und meint, also das ist immer der gleiche, kommt dann an und meint, da hätte ich noch eine Frage dazu. Gibt es denn da auch ein Rollback Szenario, weil ich habe ja gerade gehört ihr tauscht die Zertifikate aus. Was willst du denn da rollbacken, das Zertifikat läuft aus, entweder du tauscht es nicht aus, dann läuft es ab oder du tauscht es aus. Was willst du denn da rollbacken? Was willst du denn da rollbacken? Und dann fragt er, ja aber du sagtest doch die Zertifikate werden ausgetauscht. Also beim Austausch der Zertifikate sollte auf ein ordnungsgemäßes Rollback Szenario geachtet werden. Das ist so einer der wiederholt auch die Sachen immer wieder uns komplett am Thema vorbei eigentlich. Genau was willst du rollbacken bei Zertifikaten, gerade bei Zertifikaten die dringend getauscht werden müssen, weil sie ablaufen. Das war eh noch das geilste, ich weiß es ist Recycled Story, aber ich muss es einfach noch mal ganz kurz sagen. Am geilsten war immer noch in irgendeiner, irgendeiner Rücksprache war ein Entwickler und der hat einfach nicht verstanden, dass das Zertifikat ausgelaufen ist. Ich habe ihm erzählt, also wir müssen das Zertifikat tauschen. Das läuft hier ab, also es gibt gar keine Möglichkeit das nicht zu tauschen. Oder man möchte quasi der gesamte Außendienst kann sich nicht mehr connecten. Und dann meinte der Entwickler zu mir, also ich habe gerade nachgeguckt, das Zertifikat läuft noch bis 2035. Und dann denke ich mir auch immer, ich habe verstanden wovon ich rede, ja nein. Und er hat dann halt bei der CA nachgeguckt, ja die CA läuft bis 2035, wen juckt die CA? Das sind dann immer so Leute, die sagen das so furchtbar selbstsicher und denken alle, die keine Ahnung haben, der hat voll den Plan. Da erzählen die immer einen totalen Blödsinn. Und am besten sind dann irgendwelche Manager Leute, das war ja auch geil. Da ging es darum Zertifikat austauschen hin und da und Rollback und sonst wie. Und ich habe dann halt am Ende gesagt, also nur mal so, dass das alle Beteiligten jetzt mitbekommen haben. Wenn das Zertifikat bis in zwei Tagen nicht getauscht ist, dann kommt der gesamte Außendienst nicht mehr auf die Systeme drauf. Also ich hoffe, ich möchte das jetzt nur nochmal betonen. Und dann kam dann irgendein Manager Dude um die Ecke und meinte, ja was ist in zwei Tagen, wir haben doch jetzt Probleme. Und ja macht was ihr wollt, macht so viel ihr wollt, egal, ich habe es gesagt. Alter, das ist teilweise so Wahnsinn, man hat echt das Gefühl, in der IT sind 90% Leute, die keine Ahnung haben von dem, wofür sie eigentlich da sind bzw. über was sie sich gerade unterhalten. Unglaublich, kann ja nicht sein, weil sonst wird es wahrscheinlich gar nicht funktionieren. Aber es muss schon ein echt hoher Anteil sein. Doomsfab, danke schön für den Sub, also sehr merkwürdig alles. Mit welchem Zeugnis-Shit hast du in deinem Berufsschulzeugnis abgeschnitten? Keine Ahnung. Keine Ahnung, 1,2 oder so, ich hatte fast nur einser, weil Berufsschule absolut Easy Mode war. Ich habe nichts gemacht heute, ich habe sogar DS gespielt im Unterricht, und einmal ist der Lehrer über das Ladegerät gefallen, hat eigentlich keinen interessiert. Also Berufsschule ist wirklich easy as fuck gewesen. Oder 1,3, also ich hatte, lass mal überlegen, ich hatte sogar in Sport eine 1, lol. In Sport, Alter, ich muss unbedingt eher überlegen, wo hatte ich denn keine 1? Es könnte sein, dass ich in der ganzen BWL-Geschichte, ich glaube ich hatte in Englisch eine 2 und in BWL eine 2 oder so, und der Rest war ein 1. Also wirklich Berufsschule war wirklich easy. Kann sich das ja in seinem Abschluss-Pattel, wie auch immer das heißt, dieses Abschluss-Ding, was du von der IHK bekommst, da kann man sich ja, wenn man das beantragt, seinen Notendurchschnitt eintragen lassen, habe ich nicht gemacht. Juckt keinen, wirklich, juckt niemand. Mich hat nie jemals, also nicht nur ansatzweise mal nach Berufsschule, du bist glaube ich der Erste, der mich nach Berufsschulnoten fragt jetzt seit 20 Jahren oder so. Na gut, nicht so lange, so lange mache ich das, seit 15 Jahren. Übrigens, was auch Fun-Fact, der gleiche Typ, der immer so komische Nachfragen stellt bei uns auf der Arbeit, der hat auch manchmal so ganz komische Einwände, sowas nicht nur wie Rollback, sondern wir wollten uns mal einloggen, nachts auf einer Kiste und dort, ich glaube, irgendwelche Log-Dateien zippen oder so. Also was total Banales, ja, war halt irgendwie die Festplatte voll, ein paar Logs zippen und alles war wieder gut gewesen. Und dann kam der Typ mit irgendeiner Gefahren- und Risikomatrix an und dann wollte er ernsthaft, dass man anhand der Gefahren- und Risikomatrix das Zippen der Log-Dateien bewertet. Und in der Risikomatrix stand dann so Dinger drin, wie Rollback-Verfahren vorhanden, Zwei-Augen-Prinzip, bewährtes Verfahren, blablabla. Und wir haben das mal wirklich just for fun, wir haben das just for fun mal bewertet nach diesen Fragen. Und da kam raus am Ende, dass das Zipp von Log-Dateien also schon wirklich ein ganz kritischer Change ist. Also manchmal erscheint mir das Verhältnis von Leuten, die irgendwelche Organisationssachen machen und es nicht hinbekommen, zu Leuten, die Technik machen, irgendwie unausgewogen. So als hast du 80% irgendwelche Dummeschwerzer am Start und 20% die noch irgendwie ein bisschen Ahnung von Technik haben. Und von den 20% ist ja der Schlimme und die meisten auch keine Ahnung. Wenn ich mir angucke, Entwickler, die nicht wissen, dass ein Zertifikat, also wie ein Zertifikat und wann ein Zertifikat abläuft. Letztens sind Change, da wollte einer, dass wir neue Unit-Files auf manche Linux-Server packen. Und die Unit-Files sollten dann, also das Unit-Files ist quasi sowas wie der Autostart unter Windows. Also simpel, naja, nicht wirklich, aber ich glaube die meisten Leute können sich das am besten vorstellen. Das ist quasi sowas wie Service-Auto-Start unter Windows. Da legt man ein Text-File hin, wo im Prinzip drin steht, was gestartet werden soll. Und in diesem Start-File musste man halt dann den eigentlichen Service starten. Und man hat dann ein weiteres Start-Script aufgerufen von ihm und ein weiteres Stoppscript aufgerufen von ihm. Und das erste was passiert ist, ich leg ein Unit-File hin, starte die Unit, failed, geht nicht. Ich stoppe die Unit, Endlosschleife, im Stoppscript. Der hat irgendwie hardcoded da ein Pit-File drin, was nicht existiert hat und er nichts gefunden hat, keine Fehler abgefangen hat. Und dann hing dann das Stopps, das muss man erstmal schaffen, ein Stoppscript, das in einer Endlosschleife hängen kann. Ich frage mich allen Ernstes, wie die Leute da teilweise in ihre Jobs gekommen sind. Ernsthaft? Kein Timeout und nix. Ich meine, die Unit geht glaube ich nach 45 Sekunden in failed oder so. Aber trotzdem, Alter, das ist teilweise echt die planke Unfähigkeit, die einer jeden Tag entgegenspringt. Aus allen Ecken. Weder noch. Ich habe noch nicht gewechselt, aber ich habe das Vorhaben auch noch nicht gestoppt. Aber ich habe es nicht so eilig. Also ich kam nicht vom Gymnasium und ich habe trotzdem die Berufsschule gemacht. Ihr wisst ja, ich habe mal in grauer Vorzeit was BWL-mäßiges gemacht. Aber das möchte ich nicht weiter ausführen. Ich habe festgestellt, das ist nichts für mich. Aber das Berufsschulzeug ist doch eh nicht richtig wichtig, oder? Ach so, das Berufsschulzeug, ich habe das Berufsschulzeug gelesen. Das Berufsschulzeug, nein, das Berufsschulzeugnis ist nicht wichtig. Das Berufsschulzeugnis interessiert wirklich kein Mensch. Also gar kein. Was bei einer Mitarbeiter funktioniert das Office-Tran vom Sechskonto nicht? Welches bei ihr? Ja, so Leute sind auch geil. Ja, wie gesagt, Unfähigkeitenpersonen überall. Ich werde auch manchmal zu irgendwelchen Besprechungen eingeladen. Das sind dann die geilsten Dinge. Ihr kriegt einfach random einen Anruf. Kennt ihr das, wenn ihr random einen Anruf kriegt von irgendeinem Besprechungsraum in Teams und ihr seid nicht eingeladen und ihr fragt euch, was geht? Was wollen die? Dann geht ihr dran und das erste, was ihr hört, ist sowas. Ja, es geht irgendwas nicht. Habt ihr nicht gestern Abend Wartungsarbeiten gemacht? Kann das daran liegen? So nach dem Motto. Und was sprecht ihr überhaupt? Das liegt wahrscheinlich daran, weil ihr da viele Szenarien aus der echten Welt verarbeitet habt. Oh, du hattest die erste Berufsschulwoche an der Werder von Siemens Schule. Ja, die Schule ist aber richtig kacke. Es ist halt insofern ganz gut. Du kannst halt AFK sein und trotzdem Einsatz schreiben. Die Schule ist halt mega hässlich. Dreckig, die Kantine kriegst du Dünnsches von. Und zumindest war das früher so. Wahrscheinlich ist das heute immer noch so. Und es sieht generell aus wie im Knast. Das ist dir wahrscheinlich auch aufgefallen, oder? Dass es wie im Knast aussieht da drin und aufgeteilt ist. Das stimmt, das stimmt. Also wenn du drei Monate durchgehend für die Prüfung lernst, ist die Berufsschule komplett unsinnig. Nichtsdestotrotz, finde ich, ist Berufsschule nicht ganz unsinnig. Aber zum größten Teil schon. Aber manchmal macht man durchaus sinnvolle Sachen. Und manchmal kann man tatsächlich noch was fragen, was man nicht verstanden hat. Und dann hat vielleicht auch mal einer Plan. Ganz vereinzelt. Aber im Großen und Ganzen bringt das nichts. Dani Lull, 39 Monate. Du bist ja wirklich schon von ganz Anfang an mit dabei. Dankeschön für den Sub. Massive Hyper Subscription. Du bist Systemintegrator am zweiten Lehrjahr. Was soll man dafür machen im neuen Lehrplan? Cyberphysische Systeme. Was soll das überhaupt sein? Das ist doch wieder so ein Wort, was sich irgendwie ein superschlauer IHK-PyFat-Mensch ausgedacht hat, oder? Was sind Cyberphysis? Das habe ich noch nie gehört. Ist ein Computer, der etwas in der physischen Welt steuert? Ah! Was für eine ultrabeknackte Bezeichnung. Das ist ja absolut hängen geblieben. Also im Prinzip der Microcontroller in meinem Klo, der dafür sorgt, dass die Wasserdüse Wasser rausspritzt. Das ist ein cyberphysisches System. Aber das ist... Okay. Aber warum nennt man das nicht IoT? Ganz ehrlich, cyberphysisches System ist so ein beknacktes Wort. Habe ich noch nie gehört. Passt das gut rein zum Systemintegrator? IoT-Kram auf jeden Fall. Da musst du dich ja auch ein bisschen mit Netzwerkgedöns beschäftigen. Du musst dich vielleicht mit den ein oder anderen Microcontroller-Sachen beschäftigen. Aber sag mal, was macht ihr denn da eigentlich dann so? Was macht man denn in diesem Fach so? Was kann man sich... Ich meine, nur was ich mir darunter vorstelle, heißt ja nicht, was die Berufsschule auch darunter vorstellt. Die... Hier. Werner von Siemens Schule Frankfurt. Das Ding sieht aus wie im Knast. Ich habe es euch doch schon mal gezeigt. Gibt es da überhaupt Bilder von innen? Gibt es da Bilder von innen? Wahrscheinlich nicht. Da trauen die sich nicht, Bilder von innen zu machen. Gibt keine Bilder von innen. Gibt nur Bilder von außen. Die wissen auch genau, warum. Ganz oben rechts, das ist aber nicht die Werner von Siemens Schule in Frankfurt. Die Bewertungen sind immer noch zu geil, Alter. Religion hatten wir auch irgendwie zwei Stunden und dann war die krank für die nächsten fünf Jahre. Fünf Jahre, drei Jahre. Gab es da nicht... Gab es nicht in Google Maps? Wie kommt man denn jetzt zu den Fotos von Google Maps? Google Rezensionen? Wegbeschreibung vielleicht? Von Hanau, na alles klar. Gut, ähm... Fotos. Nee, nee, auf die Fotos kommst du woanders raus. Ah, Sporthalle. Ein Busch. Der Knast von außen, der Knast von innen. Penna-Matratzen. Ein dunkler Weg. Ein Klassenraum. Man sieht leider das Ganze nicht von innen. Was aber auch gut ist, weil von innen sieht das Ding wirklich aus wie im Knast. Nee, hab ich noch nicht, hab ich noch nicht gesehen. Tja, da fragt man sich warum das so einfach geht. Sind halt nur besonders fähige Leute da. Hast du denn wieder Urlaub im Dezember? Ja, ganz Dezember. Ich wollte gerade sagen, das mit der File Struktur hab ich schon gesehen. 1, 2, 3, 4, 5, 6. Bestimmt fast so sicheres Passwort wie bei Uber. Was weiß ich, keine Ahnung. Irgendjemand hat mich gefragt, ob ich irgendwie ein Studio mal nachholen will oder so. Nee. Will ich nicht. Also erstens hab ich mit 38 wenig Bock drauf nochmal zu studieren. Und vor allem, wozu? Warum sollte ich das machen? Das würde ich nur machen, wenn ich sag, ja okay. Mich würden da irgendwie die theoretischen Inhalte brennend interessieren. So nach dem Motto, ich will mal ein bisschen Mathe lernen oder sowas. Okay, ja. Dann könnte ich mir das... Ja, aber aktuell, also es gibt für mich eigentlich gesagt wenig... Es ergibt für mich wenig Sinn, das zu machen. Das wären 2 oder 3 Jahre, weiß gar nicht, 3 Jahre eher, weiß gar nicht, wie lange das geht. In denen ich kein Kohle verdienen würde, in denen ich meinen Job nicht weitermachen könnte. Und am Ende verdiene ich auch nicht mehr. Also warum sollte ich das machen? Alter, was ist mit den Leuten los? Warum hat er irgendwelche Gewehre bei sich im Studentenwohnheim? Lull, ist klar, ist klar. Macht das mal nebenberuflich, alles klar. Es gibt Leute, die machen... Ich mein, guck mal, wenn du arbeiten gehst, dann machst du ja schon fast den ganzen Tag nichts anderes wie arbeiten gehen. Aber wenn du arbeiten gehst und nebenberuflich studierst, dann machst du ja in der Zeit, wo du nicht arbeiten gehst, auch nichts anderes als zu lernen. Nee, ja, aber ganz nachher, es ergibt für mich überhaupt keinen Sinn, warum ich das machen sollte. Es ist ja noch nicht mal so, als hätte ich großartig bessere Gehaltsaussichten danach. Das Einzige, wofür es gut wäre, ist, wenn ich mal zu einem Amt will, für irgendeine Laufbahn, wo sie sagen, du musst studiert haben. Also es macht überhaupt gar keinen Sinn für mich. Wie ist aktuell Homeoffice-Regel bei dir in der Tage? Drei Tage Homeoffice, zwei Tage Homeoffice, äh, zwei Tage, äh, drei Tage Homeoffice, zwei Tage Anwesen ist bei uns die Regel. Dadurch, dass ich nur vier Tage die Woche arbeite, ist das immer ein bisschen fließend, ja? Mal auch vielleicht einen Tag. Ich kann dazu nichts sagen, ich hab nicht studiert. Keine Ahnung. Also, aus meiner Sicht beziehungsweise aus dem, wie es bei mir gelaufen ist, nee, wozu? Ähm, das kann man aber so pauschal nicht sagen. Ich mein, im Durchschnitt ist es ja tatsächlich so, dass Leute, die studiert haben, mehr verdient, also im Durchschnitt, ja? Als Leute, die nicht studiert haben, auch in IT-Berufen. Das muss jetzt eben nicht zwangsläufig auf euch zutreffen, also, natürlich habt ihr prinzipiell dann bessere Chancen. Sonst kommt der Durchschnitt, kommt er nicht von ungefähr. Aber wenn ihr Plan habt und in irgendeinem Bereich landet, wo man Leute sucht, was ja quasi mehr oder weniger jeder aktuell ist, also, es sei denn, es interessiert einen halt, ja? Du kannst da schon theoretisch, du hast dann theoretisch schon viele Sachen gelernt, die du jetzt als Fachinformatiker nicht wirklich lernst. Also, beweis mal irgendwie die Laufzeit von einem Algorithmus oder sowas. Das machst du halt als Fachinformatiker Systemintegration nicht. Wenn du Mathe studiert hast, kannst du das schon eh. Es ist halt die Frage, bringt dir das irgendwas in deinem Job, den du machst? Und ist dein Arbeitgeber dafür bereit, mir auszugeben, dass du das kannst? Ja, wenn es ein Job ist, wo man das braucht, bestimmt, vielleicht, weiß man nicht. Aber ansonsten, wozu? Würde ich nicht generell empfehlen. Ausbildung ist vollkommen in Ordnung. Guck mal, es suchen aktuell, vor allem wozu, ja? Wenn du, es sei denn, es sei denn, es interessiert halt dieser Aspekt besonders, ja? Und du willst vielleicht auch wirklich spät in die Arbeit gehen. Wo das Voraussetzung ist, meinetwegen, dann macht das alles Sinn. Aber pauschal zu sagen, studieren gehen nach der Ausbildung, wozu? Ich meine, Fachinformatiker werden eh händeringend überall gesucht. Und du kannst dies ja aktuell, wenn du ein bisschen Ahnung hast, nahezu aussuchen, wo du hingehst. Also, insofern. Warum? Ich hab nicht studiert. Ich hab nichts gewählt in der Uni. Vier Tage, ja, ich mach seit 2000. Ich sag mal so seit 2012, ungefähr. Aber ich hab nicht studiert. 2012, ungefähr, arbeite ich Teilzeit nur noch vier Tage die Woche. Ungefähr neun oder zehn Jahre mach ich das, ganz schön lang, oder? Und es gibt zwei Punkte, die ich mir nicht erklären kann, so wirklich. Wie ich es früher geschafft habe, fünf Tage die Woche. 30 Stunden, sonst glaube ich. Könnten auch 32 Stunden sein. Es sind 7,4 Stunden am Tag. 7,4 x 4. 30. So, was wollte ich denn jetzt sagen? So, was wollte ich denn jetzt sagen? Genau, es gibt zwei Punkte, die ich mir nicht erklären kann, wie ich das geschafft hab. Und zwar, wie habe ich es früher geschafft, fünf Tage die Woche, sieben und halb, bzw. ich nenne es jetzt einfach, acht Stunden am Tag zu arbeiten, in Frankfurt jeden Tag dorthin zu fahren, mit dem Zug hin und zurück. Wie habe ich das ausgehalten? Unbegreiflich, verstehe ich heute nicht mehr. Und das nächste ist, wie habe ich es ausgehalten, vier Stunden am Tag hinzufahren mit dem Zug, jeden Tag hin und zurück. Ich verstehe es überhaupt nicht. Ich weiß gar nicht, wie man das aushält. Allein schon die Probleme, die man mit der Bahn hat, sind quasi schon Kündigungsgrund genug. Und alles andere, man muss sich das mal vorstellen, ich habe das nie realisiert früher. Ich bin um 5.45 Uhr aufgestanden, bin dann zum Südbahnhof gefahren, bin nach Frankfurt gelaufen. Ich habe mir da überhaupt nichts bei gedacht, aber ich war morgens müde. Ich war mittags, ich war auf der Arbeit, ich war morgens müde, mittags müde, abends müde. Und als ich daheim war, war ich so müde, dass ich eigentlich schon fast vom Rechner eingepennt bin. Ich habe eigentlich nichts gemacht, außer so vier Tage die Woche so ein bisschen vor mich hin vegetiert. Und dann bin ich schlafen gegangen und das dann wieder. Und dann hatte ich halt drei Tage, konnte ich halt Action machen. Aber ich sage euch, das ist das Beste für alle Seiten, was passieren konnte, für Leute, die Homeoffice machen können, ist Corona gewesen die letzten Jahre. Weil es hat sich dadurch bei vielen Unternehmen etabliert, bei vielen auch bewährt und viele Unternehmen hätten es gar nicht ausprobiert ohne Corona und ohne die Pflicht dazu, dass sie es machen müssen, wahrscheinlich hätten es auch ein paar nicht gemacht. Und dadurch, dass diese ganze Homeoffice-Thematik jetzt in vielen Bereichen Einzug gehalten hat, ist es ja mittlerweile auch so, dass die Leute quasi ihre Jobwahlen zumindest zum Teil mit davon abhängig machen. Das finde ich gut. Weil ganz im Ernst, es haben wirklich alle nur, also in meinem Fall, ich kann ja immer nur von mir reden, es haben alle Seiten nur Pluspunkte davon. Ja, also mir, einfach ganz unabstrich, mir geht es besser und ich schaffe am Endeffekt sogar mehr. Also es ist eigentlich für alle beteiligt nur besser. Leider gibt es noch viele Unternehmen, die gar so viele Boomer-Managements sitzen haben, die sie überhaupt nicht gebacken kriegen und meinen, wenn du den Leuten nicht 24-7 auf dem Monitor gucken kannst, dann wird das nichts. Aber vielleicht, und das ist ja glaube ich eines der Sachen, die bei Corona festgestellt wurden, ich weiß nicht, wie das bei euch ist, aber ich hatte in Corona-Zeiten den Eindruck, dass die Leute, die eigentlich nichts können und nur schwätzen den ganzen Tag, besonders stark gelitten haben unter Homeoffice. Also die haben besonders stark gejammert über Homeoffice. Also du konntest in der Regel sagen, wenn du von irgendeinem gehört hast, oh Homeoffice und soziale Kontakte und oh Homeoffice. Also du konntest zu 90% sicher sein, wenn einer über Homeoffice gejammert hat, dann war das irgendeiner, der eigentlich nichts kann und nur schwätzt. Alle anderen waren happy. Die haben zwar nicht zwangsläufig das alles in Anspruch genommen, manche haben gesagt, naja so ein Tag die Woche, zwei Tage die Woche und so will ich schon, aber es gibt ja welche, die haben komplett immer rumgeheult den ganzen Tag über Homeoffice. Und das sind in der Regel die, die eigentlich nur schwätzen und nichts machen, bzw. wahrscheinlich nichts machen, die machen schon was, aber die können nichts, außer schwätzen. Wahrscheinlich hatten die das Problem, dass sie quasi ihren gesamten Arbeitsinhalt durch dummes Zeug schwätzen, definieren und das halt nicht ging. Und dass man eben festgestellt hat, gerade dank Homeoffice, dass man eigentlich ein Viertel der Leute gar nicht braucht, weil ob die da sind oder nicht, macht überhaupt keinen Unterschied. Deswegen waren glaube ich auch so viele gegen Homeoffice. Klar, du hattest auch Leute, die haben da wirklich Gründe, die ich nachvollziehen kann. Also zum Beispiel einer bei uns auf der Arbeit meint, seine Familie, seine Frau, seine Kinder gehen ihm daheim zu sehr auf den Keks, weil er will auf die Arbeit fahren. Okay, kann ich irgendwie nachvollziehen, wenn du da eine Ruhe haben willst? Also wir hatten schon öfters mal irgendwelche Kollegen, die sind lieber auf die Arbeit gefahren, weil sie Ruhe hatten vor der Familie. Ganz schlimm war mal einer, da hat immer das Telefon geklingelt und er hat abgenommen und du hast die Frau schreien gehört. Das kann ich mir dran erinnern, hat es geklingelt bei ihm und du musstest eigentlich bloß zwei Sekunden warten und du hast irgendwie gehört, Papa, du hast die Kinder im Hintergrund gehört, dann hat die Frau im Hintergrund rumgeschrien und eins muss man ihm echt zugute halten, der hatte wirklich bei diesen Sachen die Ruhe weg. Also ihr müsst euch vorstellen, euch brüllen die Kinder im Telefon an, die Frau brüllt euch im Telefon an und der Typ hat den Telefonhörer auf halb acht gehangen auf seinem Sitz und hat dann den Telefonhörer am Ohr gehabt und wird ihm voll ins Ohr geschrien und dann so, aha, ja, wie sieht das aus mit der Hello Kitty Decke? Jetzt gib mir doch mal bitte die Hello Kitty Decke wieder. Aha, verstehe. Da war so mega ruhig, ja. War total entspannt, der hat sich wahrscheinlich gefreut, dass er jetzt auf der Arbeitssitzung nicht daheim ist. Ich weiß das nur noch, die Kinder haben sich damals um die Hello Kitty Decke gekloppt und solche Dinge und die haben dann, musst du dir mal vorstellen, ja, wie bescheuert das eigentlich ist. Die rufen den Vater auf der Arbeit an, weil sie sich um die Hello Kitty Decke kloppt. Aber der Typ, der ist geil, der ist super entspannt und irgendwann hat er sich eine Kamera installiert, dass er dann daheim spyen konnte, was da gerade abgeht und dann hat er dann von der Kamera zugeguckt, der ging eh ab und dann hat er den Temperatursensor ins Wohnzimmer gesetzt, weil er gesagt hat, die vergessen immer die Tür zuzumachen und dann hat er den ganzen Tag teilweise sich seinen Graf angeguckt von dem Temperatursensor daheim und hat dann festgestellt, wenn es wieder ein halbes Grad runtergegangen ist, dass die wieder vergessen haben, die Tür aufzumachen und das hat er dann denen, wenn die angerufen haben, immer erzählt, dass sie wieder vergessen haben, die Tür zuzumachen Der hat Home Automation gemacht, bevor es Home Automation gab, Alter Oh Mann Der sparende Boss, ja Oh Mann Okay, also, lass mal kurz lesen Heute war auch wieder gut, haben in der Nacht heute sofort Firewall Updates entstehen Oh, um sowas sind wir glücklicherweise ein bisschen rumgekommen Dafür haben wir Wie heißen diese Dinger? Ich überleg gerade Palo Alto? Gibt's sowas? Palo Alto Firewall? Ja, sowas gibt's, Palo Alto Firewalls, haben wir Hab ich zumindest öfters mal vernommen, diesen Namen Mach ich aber nichts mit, ist nicht mein, ist nicht mein, ist nicht mein Gebiet Okay, heute hatte der eine Kunde VPN-Probleme Wir 30 Minuten Probleme suchen, festgestellt, dass der dann eben das Modem aktualisiert, einfach die Firewall und Ja wie, ausgehend, Firewall, what? Was ist das denn? Übrigens, wusste ihr, was ich gestern wieder machen musste? Ich musste wieder mit dem rein englischsprachigen Telekom Techniker Ihre komische Telekom Appliance aktualisieren Ich bin ja immer ein bisschen shy am Anfang, wenn man Englisch only reden muss, aber das funktioniert tatsächlich, muss ich sagen Mittlerweile brauchbar Also ich kann mit dem zusammen Update machen und ein bisschen nebenbei schwätzen und es funktioniert alles Nein, nicht die Polen, nicht die Polen, nicht die Polen, nein nein Das war, wobei, vom Namen her könnte es vielleicht sogar einer gewesen sein Ich würde ihn eher so in Tschechien oder so verorten, so vom Namen her Aber die Telekom ist da wirklich sehr international aufgestellt Also die haben dann einen aus Tschechien, dann haben sie irgendwie einen aus München, dann haben sie einen aus Was, Singapur oder Japan irgendwie, der da dort remote arbeitet Da muss man sagen, die sind da sehr international Bist du Anwendungsentwickler? Nee Gelernt habe ich Fachinformatiker System Integration 2007, ist schon ein bisschen her Das kann sein, dass es das gewesen ist Ja Also aktuell ist das Beste, was man machen kann, mehr Gehalt verlangen Weil die Leute werden wie verrückt gesucht Haut da ruhig mal richtig, richtig rein und sagt denen, dass ihr mehr Geld haben wollt Ich meine, das Leben wird nicht billiger Das erste, was dann kommt immer ist so nach dem Motto, ah, Inflation und der Firma geht es ja gerade nicht gut Das ist ein schlechter Zeitpunkt Leute, ich glaube, ihr werdet nie hören, wenn ihr nach Gehaltserhöhung fragt, das ist ein guter Zeitpunkt Die Standardantwort ist immer, ah, ganz schlechter Zeitpunkt Aber Pech gehabt, für euch ist der Zeitpunkt auch vielleicht schlecht Weil ihr jetzt auf einmal 200% mehr Heizrechnungen bezahlen müsst Das ist immer, das ist immer, das ist immer gleiche, gleiche Geschwätze Darf man sich nicht so sehr davon beirren lassen und muss regelmäßig denen auf den Keks gehen Das kann auch sein Aber ich hab ja eh schon vor ein paar Jahren aufgehört Also spätestens seit ich nur Teilzeit arbeite, aufgehört, ähm, quasi So zu denken, als ist die Arbeit quasi mein Hauptlebensinhalt Weil ganz ehrlich, das beste, was man machen kann ist Möglichst viel Zeit mit dem verbringen, worauf man Bock hat Beziehungsweise, das ist vielleicht jetzt blöd ausgedrückt Möglichst viel Zeit damit verbringen, was einem wichtig ist Es muss ja nicht sein, worauf man Bock hat Es kann ja auch zum Beispiel sein, dass man Nicht Zeit mit Familie und sonst was verbringt Da muss man vielleicht nicht sagen, so unbedingt so nach dem Wort Boah, da hab ich jetzt richtig Bock drauf, Zeit mit der Familie zu verbringen Aber das ist auch was, wo man sich später vielleicht dran zurückerinnert und sagt Ah, war ja gut, dass ich mit dem Opa noch ein bisschen immer im Garten Zeug gemacht hab oder so, auch wenn man keinen Bock drauf hat Weil niemand, das kann man nicht oft genug sagen Niemand, ja gut, außer vielleicht es war die eigene Firma Aber ich sag's jetzt trotzdem mal, niemand wird sich denken Bevor er den Löffel abgibt, so nach dem Motto, keine Ahnung Ihr lauft gerade über den Zebra-Streifen, guckt nach links Und der LKW kommt Und das letzte, was ihr denkt ist, oh Scheiße, hätte ich mal mehr gearbeitet in meinem Leben Ich glaub, das ist das letzte, was ihr denkt Also ich glaub, die meisten werden sich denken, oh Scheiße Manche werden sich denken, keck bei Oder was auch immer, ja Aber es wird sich keiner denken, oh hätte ich mal mehr gearbeitet Nicht genug gehasselt, genau Diesen Dienstag ging's, da war die Bahn halbwegs pünktlich Die Ficker waren halbwegs pünktlich, genau Das hat mich auch überrascht, ja Ich kann euch zum Studium wirklich nichts empfehlen Ich habe nicht studiert und ich hab keine Ahnung Aber Doktor ist zumindest schon mal cool, weil jeder was mit dem Doktor anfangen kann Aber Doktor ist wahrscheinlich auch mit Abstand das Schwierigste Kann man Doktor in Informatik werden? Bestimmt, oder? Ich glaube, ich hab noch nie einen Doktor in Informatik gesehen Bei euch war die Mehrheit gegen Homeoffice Das soll die Mehrheit halt kein Homeoffice machen Haben sie halt Pech Aber es sollen die Leute, die das machen wollen, das trotzdem ermöglichen Wen juckts Die Mehrheit entscheidet sich auch oftmals für dumme Sachen Das heißt ja nicht, dass du das mitmachen musst Ich hoffe nicht, dass sie dann sowas sagen wie Ich meine, die Mehrheit guckt auch Big Brother oder Deutschland sucht den Superstar oder Let's Dance oder so ein Shit Oder was gibt es da sonst noch in letzter Zeit, was richtig dumm ist und viele gucken Dschungelcamp und so Müll Trotzdem ist es nicht gut, auch wenn die Mehrheit das guckt Deswegen, ich hoffe, die ermöglichen es trotzdem Was für eine Art Büro-Arbeitsplatz hast du eigentlich auf der Arbeit Also, ok, das kann ich kurz erzählen Also, ich hab den gleichen Stuhl wie daheim Ein Sedus Mr.24, Bilder, zack, so ein Ding Allerdings, hier daheim hab ich mit dieser Kopfstütze Und auf der Arbeit ist es mit dieser Kopfstütze Macht jetzt nicht so viel Unterschied Also, den Stuhl, einen höhenverstellbaren Schreibtisch Ein Curved, frag mich nicht, 32 Zoll, 28 Zoll, was auch immer 4K-Monitor Und ein Notebook, da dran Das war's Ach ja, und eine eigene Tastatur, eine eigene Maus, die ich mir mitgebracht hab Ein Single-Monitor, ja, aber einen Wide-Screen-Curved, 4K-Ding Damit komm ich auch klar Das ist ja quasi wie zwei kleinere Monitore nebeneinander Früher hatte ich zwei, mittlerweile hab ich noch einen Auf der Arbeit hab ich eine Logitech, wie heißt das Ding? Logitech G Otoys Core Also, ich hab eine G502 Als Maus auf der Arbeit und eine Ducky One Skyline Tastatur Mit Numblock, so ein Teil hier Mit Numblock, der ist nicht da, nicht das, mit Numblock Also, so eine Tastatur und die Maus auf der Arbeit Die hab ich mir aber selbst mitgebracht Aus dem einfachen Grund, weil ich wahrscheinlich durch jahrelanges Gaming Einfach zu verwöhnt bin, was gescheite Input-Geräte angeht Und ich mir diesen billigen Tastatur nicht klar gekommen bin Das ist wirklich richtig billiger Müll Also, ich mag beispielsweise auch keine Low-Profile-Tastaturen So was, die kaum Tastenhub haben Kann ich nicht haben Das Einzige, was ich mit meiner Tastatur gemacht hab, ist Also mit dieser Ducky One Also, das Einzige, was ich gemacht hab mit der Tastatur Ich hab mir Silikonringe gekauft für manche Tasten Weil ihr kennt das aus dem Stream und ich weiß nicht, wie gut die... Ich hab ja hier RTX Voice quasi für Hintergrundgeräusche noch Und ich weiß nicht, wie sehr ihr das tippen Und ihr irgendwelche Geräusche überhaupt hört Aber ich hab den Hang dazu, manchmal auf gewisse Tasten zu hauen Beispielsweise die Enter-Taste auf dem Numblock gehört dazu Ich mach das gerne, ich schreib irgendwas im Terminal Lese mir das nochmal kurz durch Und dann klopp ich wie verrückt auf die Enter-Taste auf dem Numblock Fragt mich nicht, warum es die Numblock-Enter-Taste ist Und nicht die normale Enter-Taste, die ist viel größer Aber ich hau irgendwie gern auf die Numblock-Enter-Taste Und ich wollt den Leuten, die um mich drumherum sitzen, auf der Arbeit nicht zu sehr auf den Sack gehen Deswegen hab ich da so einen kleinen Silikonring unter der Numblock-Taste, dass die grad so schlimm ist Hey Max, kannst du etwas zu einem Job in einem Rechenzentrum sagen? Klar, warum nicht? Ich hab ja früher selbst zwar keinen Only-Rechenzentrums-Job gehabt Aber als ich noch beim Provider gearbeitet hab, früher Ich war jeden Tag mehrere Stunden im Rechenzentrum Also bitte eine Ahnung davon hab ich auch Dauert bei mir zwar noch bis nächstes Jahr, bis ich mit der Schule fertig bin Ich habe gesehen, in Frankfurt gibt es auch Rechenzentrums-Unternehmen, die ausbilden Nein, in Frankfurt gibt es quasi, wo du hin spuckst, ein Rechenzentrum Man sieht es der Sache nicht unbedingt an Aber es gibt sehr viele Würde ganz gerne was mit der Hardware machen Da wäre ich da doch richtig Aber es kommt drauf an, ganz ehrlich So viel machst du im Rechenzentrum mit Hardware, was du dir vielleicht vorstellst, auch nicht Also es ist nicht so, dass du da Rechner zusammen baust Du wechselst dort vielleicht mal Festplatten oder sowas Oder tauschst mal einen Netzteil aus Aber das kann man sich nicht vorstellen wie bei einem Desktop-Rechner Sondern du ziehst das raus, klappst es auf Und tauschst den RAM-Riegel, machst es wieder zu oder ziehst hinten das Netzteil raus Das hat mit Hardware nicht wirklich viel zu tun Natürlich macht man was mit Hardware, aber das, was man sich darunter vorstellt, wahrscheinlich eher nicht Du wirst relativ viele Kabel patchen Also nicht selber krimpen oder sowas, das macht eigentlich kaum noch einer Du wirst jede Menge Kabel patchen Du wirst das Ganze überwachen Und dich wahrscheinlich auch um Sachen kümmern, die auf den Servern laufen Weil so reines Rechenzentrum ist langweilig Was willst du da großartig machen? Kannst du nicht den ganzen Tag Server einbauen Oder Kabel patchen Ah, ich bin nicht eingeloggt Und hat Spaß gemacht Ja, das war geil Das war geil, wo der Typ seinen USB-Stick in den Fahrstuhl geschmissen hat Und nicht nur, der hat nicht nur seinen USB-Stick in den Fahrstuhl geschmissen Der ist in den Fahrstuhlschacht gefallen und unten in diese Ölwanne rein Nein, nein, du sollst sie nicht bannen, Quatsch Das ist alles blödes Gelaber Das ist die Taktik Also das ist alles Taktik Das ist alles Taktik, dass du nicht mehr fragst Man gibt sich ja mit sowas zufrieden und du hörst nie wieder was von Das ist okay, das kann dein Chef wahrscheinlich wirklich nicht entscheiden Aber dein Chef kann eine Empfehlung aussprechen Die dann, je nachdem wie gut er das macht Meistens auch abgelickt wird Und dieses mit ich gebe das weiter und ich kann das nicht entscheiden Er kann das nicht entscheiden Aber da musst du das nach oben hin verkaufen, so wie du das ihm verkauft hast Das ist sein Job, dafür ist er da Das kann man ja nicht oft genug sagen Man muss sich ein bisschen von diesem Gedanken davon verabschieden So nach dem Motto Wie sag ich das jetzt Der Chef ist irgendwie so ein höheres Wesen Der hat einen Job zu machen an dieser Position Es gibt einen Grund, wozu die da sind Das ist unter anderem Planung, Koordination, vielleicht Aufgabenverteilung Es ist aber auch ein ganz wichtiger Punkt Das jeweilige Team nach außen hin gut darzustellen Dafür ist der Teamleiter bzw. der Chef da Und die Interessen des Teams auch vertreten zu seinen Chefs und weiter Wenn er das nicht macht, ist er ein scheiß Chef, ganz einfach Das muss man sich immer mal überlegen Diese Position ist nicht dafür da, nur um zu nehmen Diese Position muss auch was bieten Zumindest wenn die wollen, dass man dahinter steht Und der muss das ordentlich verkaufen Dafür ist er da Und gute Führungskräfte machen das auch Es gibt leider viele schlechte Führungskräfte Die das wahrscheinlich nur aus Prestig-Gründen anstreben, dass sie das auf den Lebenslauf schreiben können Aber das klappt dann meistens nicht Das läuft dann auch meistens nicht Und man muss auch sehen, gerade so unteres Management ist eine wirklich kacke Aufgabe Die ich im Leben nicht machen möchte Wenn du Teamleiter bist oder Gruppenleiter und untere Management-Ebene Du kriegst permanent von deinen Leuten vorgejammert, wie schlimm alles ist Und du kriegst Anschiss von den Leuten über dir Wie schlecht es doch läuft Und du kriegst quasi Anschiss von beiden Seiten permanent Also das ist wirklich eine Position, die möchte ich nicht machen Sie müssten mir sehr viel Geld bezahlen, dass ich auch nur daran denken würde, das zu machen Und mit sehr viel Geld meine ich wirklich so viel Geld, dass ich das 1-2 Jahre machen müsste und danach kündigen könnte Für immer Und so viel werde ich mir dafür nicht bezahlen Ich würde das im Leben nicht machen Das ist genauso wie ich nie im Leben Lehrer werden würde oder sowas freiwillig Und das ist halt eine kacke Position Das unterscheidet sich natürlich auch ein bisschen nach Firma und Kultur Bei uns in der Bank ist das halt komplettes Boomer-Management von oben bis Mitte Kannst du komplett knicken Ein paar mittlerweile sind jetzt schon ein bisschen jünger Und machen auch durchaus Sachen, wo ich sagen würde, da hat sich ja mal einer Gedanken gemacht Aber das meiste kannst du da nicht nachvollziehen Ja, da muss ich sagen, also meine Chefs, die ich bisher hatte Sagen wir mal, mein letzter Chef, der hat sich da Mühe gegeben, der konnte an vielen Stellen glaube ich auch nicht so viel bewirken, wie er wollte Aber er hat es wenigstens probiert Hat ja auch mit mehr Geld ein paar Mal geklappt Mein aktueller Chef, den schätze ich auch in dieser Richtung ein, wobei den habe ich noch nicht so lange Den davor konntest du komplett knicken Den davor konntest du auch komplett knicken Und den beim Provider konntest du auch komplett knicken Also ich hatte jetzt keine Ahnung, die Jahre über 7-8 verschiedene Chefs und 2 davon haben was getaugt Gar nicht so einfach da was zu finden Das ZDF hat Quiet Quitting total falsch verstanden Haben sie? Da geht es ja im Prinzip darum, dass man sich nicht kaputt schafft Was eines der besten Trends der letzten Jahre ist, dass die Leute mal erkannt haben, dass der Arbeitsvertrag nicht nur für die andere Seite quasi gilt Sondern für die andere Seite auch Und wenn da drinnen steht, du machst das und das oder bist da und dafür eingestellt, dann kommen die mit was anderem und wollen, dass du nachts was machst, da steht nix von Nachtarbeit drin Dann machst du keine Nachtarbeit Man kann das übrigens alles machen Ich würde abraten davon zu sagen prinzipiell direkt von Anfang an, ach hört mir auf mit dem Scheiß, mach ich nicht Das muss ein bisschen beidseitig sein, also sagen wir mal so Wenn ihr gefragt werdet so nach dem Motto hier wir müssen Wartungsarbeiten machen und wir hätten gerne ein Techniker dabei, kann das 23 Uhr einer von euch machen Da würde ich prinzipiell auch schon ab und zu mal sagen, ja klar, warum nicht Wenn dann im Gegenzug aber, wenn ich das nächste Mal sag, Mist Leute, ich hab vergessen, dass, was weiß ich, meine Oma Geburtstag hat Und ich muss hier mal ein bisschen früher weg oder an dem Tag kann ich nicht oder was auch immer, ist egal was Oder ach ich hab zwar Urlaub beantragt erst ab 2. aber ich will schon im ersten losfliegen Und wenn man dann da auch sagt, ist ok, machen wir, tragen wir ein, passt schon, dann ist das ok Wenn es natürlich immer nur andersrum läuft so nach dem Motto, wir wollen was von euch und man suggeriert den Leuten dann auch immer unterschwellig So nach dem Motto, da kannst du doch nicht nein sagen, boah das ging mir bei meinem vorvorletzten Chef mega auf den Sack Das ist so einer und das probiert er heute immer noch Der hat ja immer erzählt so nach dem Motto, da kann man doch jetzt nicht absagen oder kann man doch nicht nein sagen, doch kann man, warum nicht Wenn das nicht im Gleichgewicht ist, dass das was man quasi mehr macht über das hinaus quasi nicht ja entsprechend gewürdigt wird Mit dass einem beispielsweise mal in anderen Situationen entgegengekommen wird Wie auch immer geartet ja, man muss halt selbst das Gefühl auch haben, ja ok, das ist ausgeglichen Ich mach mal hier was mehr, aber dafür wird an anderer Stelle auch mal ein Auge zugedrückt, dann ist das vollkommen ok Ansonsten klar kann man das sagen Wir hatten auch mal einen Doktor in der IT bei uns Allerdings war da kein Doktor in IT, sondern Archäologe Kein Witz, ich weiß bis heute nicht wie der Typ dahin gekommen ist Das wusste er erstmal schaffen von Archäologie zu irgendwelchen IT Geschichten Das war aber wirklich nicht das Richtige für ihn, der ist da halb verzweifelt Klar, wer macht das heute nicht So ein richtiges Grindr Game fehlt mir allerdings zur Zeit Ich finde Meetings über Teams auch viel angenehmer als in echt Gerade mit Screen Sharing, so nach dem Motto ach warte mal ich zeige euch nochmal schnell was Bald, bald, aber nicht im Arbeitsrechner, in meinem neuen Rechner Chat was sagt ihr, NumBlock ja oder ne Ich persönlich will keine Tastatur ohne NumBlock NumBlock muss, 60% beste Also ich würde jetzt sagen die meisten stehen auf NumBlock, aber ein paar nicht Zum Spielen braucht man das nicht, aber nachdem ich die gleiche Tastatur zum Spielen wie zum Arbeiten verwende hier NumBlock Hast du deine Vice Campan draußen hängen oder ist die diese in der Wohnung Ich hatte eine draußen und ich habe mir so ein Silikon Gehäuse damals gekauft dafür Aber die ist immer wieder kaputt gegangen, mittlerweile ist die so kaputt, dass der Micro SD Karten Slot gar nicht mehr funktioniert Die ist für außen nicht zu gebrauchen So muss das sein, so muss das sein Hups jetzt bin ich gerade mit den Stuhlen übers Kabel gefahren, fuck Warum, warum erschreibt man irgendwas in C++ für seine Abschlussarbeit, will man sich da irgendwie quälen oder was ist da dahinter Kunde Chizipo, Massive Subscriptions Dankeschön NumBlock Ist schon ein bisschen was dran ja Na gut, also es gibt einen Punkt wo ich finde wo man universell Naja, wo man aber schon ganz gut abschätzen kann ob man eine gescheite Führungskraft hat oder nicht Ich meine das ist nicht ein Bewerbungsgespräch wenn man schon da ist Und zwar sind die daran interessiert das was man macht gut zu verkaufen Also sprich geht es nicht nur darum ist das rechtzeitig fertig und wenn nicht dann wird sich beschwert oder was ist hier los oder kannst du nicht noch zusätzlich machen oder sonst was Sondern wirklich was man macht dass man merkt dass quasi das Interesse besteht dass die Arbeit die das eigene Team macht Dass man versucht das gut zu verkaufen und wenn das passiert ist schon mal ein ziemlich großer Hinweis für dass die Führungskraft sich zumindest Mühe gibt und sie wahrscheinlich was taugt Natürlich gibt es noch viele andere Punkte aber wenn das probiert wird und nicht nur so nach dem Motto das alles quasi verkaufen dass man jetzt selbst das verantwortet hat So nach dem Motto haha ohne mich wäre dieses Team kacke und nur wegen mir läuft es so gut und alles ist nur geil Das mag der vielleicht für seine eigene nächste Gehaltsforderung gut sein wobei ihm das sein Chef wahrscheinlich auch nicht abkauft Aber wenn du einen Chef hast der beispielsweise wenn du dem erzählt hast gibt es ja meistens monatliche wöchentliche was auch immer Gibt es mal irgendwelche Termine wo man sich dann drüber ein bisschen auskotzen kann was gut läuft was nicht gut läuft Und wenn er dann Interesse dran hat so nach dem Motto kannst du mir die und die Punkte noch mal erklären dann erzähle ich da was zu in der nächsten übergreifenden Bereichsrunde oder sowas Wenn man sowas hört ist das meistens schon mal ein gutes Zeichen für das der was taugt weil dann will der nicht erzählen so nach dem Motto Ich bin der geilste und mein Team sind die geilsten weil ich der geilste bin sondern dann erzählt er so nach dem Motto Ja wir haben jetzt die und die Themen bearbeitet und dann erwähnt er auch eure Namen ab und zu machen ist einfach daran interessiert das was das Team macht gut zu verkaufen Und das ist schon mal echt ein Pluspunkt wenn man jemand hat der das macht weil letztendlich weil ganz im Ernst wenn ihr zu eurem Chef geht und sagt ihr wollt mehr Geld haben Dann ist es sein Job das ordentlich zu verkaufen und das geht natürlich besonders gut wenn derjenige der mehr Geld haben will irgendwie im Vorfeld schon mal öfters gut positiv aufgefallen ist Und das einfachste positive aufzufallen ist wenn euer Chef ab und zu mal euer Namen einwirft bei Sachen die gut laufen Beziehungsweise da auch ab und zu mal Sachen vorstellt dann auch was da wieder cooles gemacht wurde Man kann sich da bis zu einem gewissen Grad natürlich selbst darum kümmern es gibt Leute die machen nichts anderes als den ganzen Tag den Karriere grind Und gammeln auf irgendwelchen Meetings rum und erzählen und loben sich aber das ist auch irgendwie bescheuert Weil dafür ist euer Chef unter anderem da oder sollte er da sein Was ich manchmal ganz gerne mache ist ich lasse uns zu irgendwelchen übergreifenden Runden einladen wo wir dann mal irgendwas erzählen Zum Beispiel wir haben demnächst jetzt Jubiläum Versionsnummer Jubiläum Version 100 von einer Sache kann ich jetzt nicht so im Detail erzählen Und da werden wir im November auch ein bisschen was größeres zu erzählen einfach dass das mal alle mitkriegen Also es ist so doof sich anhört wenn ihr die Chance habt 80% gute Arbeit zu machen und 20% das der Welt mitzuteilen ist das besser als 100% gute Arbeit zu machen Also von der Zeit her ja wenn ihr 80% gute Arbeit macht und 20% da noch Nutzt darüber zu erzählen Ist besser als quasi alles geil zu machen und nie erfährt jemand was von euch Es gibt aber so Leute und deswegen ist es halt wichtig dass man eine Führungskraft hat die das auch mit übernimmt Am besten ist natürlich wenn man das zusammen macht und dann ab und zu selbst auch noch mal ein bisschen was zum besten gibt Wie groß ist dein Team? Ich glaube 14 Leute Keiner will Lehrer sein Also mein BWL Lehrer in der Berufsschule der hat World of Warcraft Forum gelesen damals Während wir was gemacht haben Kennst du den und wenn ja was Moment kann ich chat kann ich das anklicken ohne dass da jetzt sonst was kommt Ich habe keine Ahnung wer das ist kenne ich nicht Aber das sieht mir auf den ersten Blick vielleicht tue ich ihm jetzt auch unrecht nach Konsultant im Anzug der gut erzählen kann aus Aber ich kenne ihn nicht keine Ahnung also ich weiß nicht Also es ist jetzt nichts was ich mir regelmäßig angucken würde wahrscheinlich Sieht nach Scam aus echt warum ich habe sie jetzt nicht so genau angeguckt Du musst dich verkaufen können da hat er recht Zweites vorstellen Job Angebot Na ja wieso warum sollte das Scam sein Das sieht doch Also von den Themen her sieht das doch okay aus Schneeball Ich kann da weder Scam noch ein Schneeball System erkennen Erzählt über irgendwelche Bewerbungsverfahren und Vorstellungsgespräche und sonst was Was hat das jetzt mit Schneeball System und mit Sonst wie zu tun Ach vom Style her einfach keine Ahnung kann ich nichts zu sagen Mich hatte das Bild im Anzug schon abgeschreckt weil ich habe halt genug so Typen äh ähnliche Typen vom Von der Optik her schon gesehen und das war halt meistens immer ganz viel ganz viel heiße Luft Zu ihm persönlich kann ich nichts sagen ich kenne die Videos nicht und es kann auch sein Dass der erste Eindruck täuscht und der Content tatsächlich was taugt Ich weiß es nicht Ok das ZDF sagt Das Quiet quitting ist wenn du zu wenig Überstunden machst und nur das Mindeste erfüllst Wie zu wenig Überstunden Es gibt nicht zu wenig Überstunden Was soll Was zum Teufel soll zu wenig Überstunden sein Also diese Wort Kombination ergibt da schon keinen Sinn Der Normalfall sollte eigentlich sein dass du keine Überstunden machen musst Dann hast du innerlich aufgegeben Naja also man es ist die Frage wie man das Wie man das das klingt jetzt sehr negativ formuliert vom ZDF wenn die das so geschrieben haben Man muss aber mal Es nüchterner betrachten du machst das was du unterschrieben hast Und du machst das wofür du bezahlt wirst Die eigentliche Frage die man sich stellen sollte ist Warum sollte man dann eigentlich mehr machen als das was man unterschrieben hat Und das wofür man bezahlt wird Eine der Hauptgründe warum das so ist Ist bei Leuten die halt den Karrieregrind machen wollen Die halt Ambitionen haben sich da irgendwie hoch zu arbeiten In welcher Form auch immer Gut die können das ja machen Aber das heißt ja noch lang nicht dass das Für jeden der Normalzustand sein sollte Doch doch damit ist definitiv welchen geholfen Nämlich allen die keine Überstunden mehr machen und das machen wofür sie bezahlt werden Alternativ wenn sie mehr machen sollen kann man ihnen ja auch mehr bezahlen beziehungsweise weitere Aufgabengebiete geben Was dann neue Aufgabengebiete was natürlich auch Perspektivisch dann mit mehr Gehalt einhergehen sollte logischerweise Damit ist dann beiden geholfen ja Aber damit ist selbstverständlich wenn jemand sagt ey Leute ich mach das wofür ich bezahlt werde das ist doch nicht negativ das sollte eigentlich der Normalzustand sein Ich weiß viel ist das im Kopf nicht so Aber da bin ich tatsächlich muss ich eine Sache mal sagen Ich habe mich ja letzten Streams öfters mal darüber beschwert dass ich immer noch echt erstaunt bin Wie viel wenig Ahnung auch gerade die junge Generation von Technica die eigentlich damit aufgewachsen ist Was ich mir früher komplett anders vorgestellt habe Dass es nie so sein wird mehr wie quasi bei mir und davor Aber ja eigentlich ist es noch genauso Aber da ist glaube ich die jüngere Generation einigen wirklich voraus Viele der Leute die heute anfangen zu arbeiten beziehungsweise angefangen haben zu arbeiten Gehen damit diesem Mindset auch ran Die wollen nicht für die Arbeit leben Die wollen und durchaus ordentliche Arbeit machen das ist nicht das Ding Aber die haben keinen Bock eine 40 Stunden Arbeitswoche zu machen Die regelmäßig eine 50 Stunden Arbeitswoche ist Und da noch zweieinhalb Stunden am Tag im Zug verbringen hin und zurück Und im Endeffekt 6 Uhr morgens rausgehen und 20 Uhr abends heimkommen Da haben die keinen Bock mehr drauf und das kann ich verstehen und das ist gut so Quelle Instagram Okay wir müssen uns mal kurz an und was sagt denn das ZDF dazu Also es geht meiner Ansicht nach dabei nicht drum quasi wie sagt man so dienst nach vorschriften Also es geht jetzt darum nicht schlechte Arbeit zu machen oder dass einem alles am Arsch vorbeigeht Das ist finde ich gar nicht der Punkt Was das für mich beschreibt ist eben dass man einfach nicht mehr macht als das wofür man bezahlt wird Und das finde ich okay Okay was sagt das ZDF Hä Hat es keinen Was Facebook und Instagram so ein Rotz mann So ein Schund alter Guckt euch diesen Rotz an mann Was ein Scheiß warum soll ich mich dazu einlocken Kann das das Hä Oder muss ich mal wieder updaten Muss ich mal wieder updaten kann auch sein Schlimm alter Instagram so ein Crap Ja komm updaten halt mal Ach jetzt funktioniert es Pog easy download Wo ist es denn Video bei ZDF heute ja okay Okay Was sagt denn das ZDF Alles klar was sagt denn das ZDF dazu Im Netz wird aktuell viel über Quiet quitting diskutiert mache Quiet quitting seit Tag eins Also ich mache auch nicht mehr als das was ich muss Also ich mache auch nicht mehr als das was ich muss Also ich mache auch nicht mehr als das was ich muss Also ich mache auch nicht mehr als das was ich muss Wie gesagt das ist recht negativ dargestellt Wenn er gesagt hat ich mache auch nicht mehr für das was ich bezahlt werde so okay In der Wirtschafts-Disziplin gibt es einen Begriff der das Phänomen ganz gut beschreibt Ja Moment das sind für mich zwei unterschiedliche Paar Schuhe Ja Moment, das sind für mich zwei unterschiedliche Paar Schuhe. Das sind für mich zwei unterschiedliche Paar Schuhe. Man könnte das vielleicht zu übersetzen, aber ich finde vom, vom, vom Sinn her trifft es das nicht so ganz. Innere Kündigung ist tatsächlich, wenn ich, also so würde ich das jetzt sehen, ist tatsächlich so nach dem Motto, Alter, ähm, ich mache wirklich nur das Mindeste und das dann auch noch schlecht. Aha. Das, jetzt, das sind doch zwei, ah. Das sind aber doch zwei unterschiedliche Paar Schuhe. Ich mein, keine Überstunden, kein Stress, das ist doch vollkommen in Ordnung. Das eine hat doch mit dem anderen nichts zu tun, ja. Also wenn du quasi wirklich nur das Minimalste machst, so kurz, dass du immer kurz bevor, kurz vor dem rausgekickt werden bist oder dass du quasi das, was du machst, quasi auch noch schlecht machst, das ist ja was anderes, wie wenn du keine Überstunden machst und dich nicht unnötig verrückt machst. Dass da jemand mit geholfen, nein, also weder Organisation noch Mitarbeitenden, innere Kündigung ist auf Seiten der Mitarbeiter assoziiert mit... Ja gut, das ist wahr, aber das sind für mich zwei unterschiedliche Paar Schuhe. ... reduziertem Wohlbefinden, mit psychosomatischen Beschwerden und mit niedriger Arbeitszufriedenheit. Ja. Ja gut, da ist durchaus was dran, ja. Also ich würde sagen, ja, für die meisten Leute, die arbeiten gehen, ist das Gehalt ein wichtiger Faktor für die Motivation. Ich meine, was denn sonst? Warum gehen die Leute dann arbeiten? Fürs Geld zum größten Teil. Das ist dann ein Resultat eines Entscheidungsprozesses, wo ich dann sage, okay, ich bin sehr unzufrieden, ich habe das Gefühl, ich habe mehr in die Organisation investiert, als ich herausbekomme. Was mache ich jetzt? Okay, meine äußeren Umstände zwingen mich so ein bisschen dazu, in der Organisation zu bleiben, also reduziere ich halt mein psychologisches Investment und ziehe mich innerlich zurück. Okay, ähm, also... Naja. Also eine positive Emots... What the... Alter, was habe ich jetzt gemacht? Five-Hat Ratio. Also eine positive emotionale Verbindung zur Organisation... verspüre ich nicht, ich... Ich verspüre aber eine positive emotionale Verbindung zu meinen Kollegen und Leuten, die ich dort schon jahrelang kenne. Nicht zu allen, aber zu Leuten, die ich mag und die ich schon lange kenne und mit denen ich gerne zusammenarbeite. Aber positive emotionale Verbindung, dass ich jetzt sagen würde, Alter, ich stehe voll dahinter, was die Firma macht, das ist die geilste Firma auf der Welt. Nö, muss ich aber auch nicht, oder? Nein. Warum muss ich das geil finden, was unsere Firma macht? Ein hohes Pflichtgefühl aufweisen. Den Eindruck haben, dass sie berufliche Alternativen haben. Okay. Aha, wie gesagt... Für mich sind es zwei Paar Schuhe. Ob du innerlich gekündigt hast und quasi nur noch, sagen wir mal so, nur noch Müll ablieferst, was halt irgendwie gerade so durchgeht, oder ob du einfach nicht über Gebühren viel machst über das hinaus, was dir quasi vergütet wird. Das sind noch zwei unterschiedliche Paar Schuhe. Du kannst auch trotzdem ordentliche Arbeit machen, allerdings bist du dann halt nicht dazu bereit, mehr zu machen, als das, was dir quasi... Man kann nicht unbedingt sagen, bezahlt wird, mehr zu machen, als das, was mir dir eben zugesteht. Das kann ja auch sein, es muss ja nicht rein Gehalt sein, es kann ja auch sein, dass man sagt, hey, machst du mal nachts Wartungsarbeiten, drücken wir das nächste Mal ein Auge zu, wenn du einen halben Tag früher Urlaube antragen willst, was auch immer. Aber dass die Leute nicht mehr machen wollen, dass das, was sie zurückbekommen, auf Dauer, ist doch vollkommen in Ordnung. Das heißt ja nicht, dass das, was sie machen, zwangsläufig schlecht sein muss. Man kann trotzdem ordentliche Arbeit abliefern und man sogar Spaß an der Arbeit haben, ohne zu sagen, jawoll, nächste Wartungsarbeiten nachts, und nächster Software-Release nachts, mach ich auch, und den danach mach ich auch, hier bin ich auch, und dann fahre ich zum nächsten Außendienstseminar und schiebe das an, hoho. Warum? Das machen vielleicht irgendwelche krassen Karrieregrinder, die in ein, zwei Jahren vielleicht mal irgendwie eine andere Position haben wollen. Aber das kann doch nicht, das sollte doch nicht der normale Zustand sein. Na ja, gut. Ich finde, das hat das ZDF hier ein bisschen durcheinandergeschmissen, mehrere Sachen. Ja, aber nicht mal so lang. Wie gesagt, ich glaube, 14 Leute. Ist der Typ wieder am Start? Der Fernseher stromgeneriert. Also, den Fernseher, den stromgeneriert, das kenne ich nicht. Ich kenne diese ganzen Videos in die Richtung free energy. Weiß nicht, ob ihr das auch kennt. Es gibt ja auf YouTube ein paar Leute, die einem erzählen wollen, dass man an irgendwelchen, ja, bei irgendwelchen Systemen, free energy abgreifen kann. Das ist eigentlich alles Scam. Beziehungsweise, wenn sie es nachmessen würden, bringt es, geht es nicht. Also, ganz ehrlich, wenn Überstunden bei mir mit dem Gehalt abgegolten werden, dann würde ich eher gar keine Überstunden machen. Weil, das heißt ja im Endeffekt, ich arbeite mehr, als ich arbeiten müsste, ohne Projekte. Und das ist das, was ich hier in diesem Video gemacht habe. Und das ist das, was ich hier in diesem Video gemacht habe. Und das ist das, was ich hier in diesem Video gemacht habe. Und das ist das, was ich hier in diesem Video gemacht habe. Und ich arbeite mehr, als ich arbeiten müsste. Und bekomm noch nicht mal was für. Na dann ist ja... Dann könntet ihr mal komplett abschminken. Könnten sich komplett abschminken Ich weiß nicht was da wieder abgeht Kein Winners Terminal? Doch tatsächlich Aber warum? Du hast schon recht, man kann es so oder so rum interpretieren. Letztendlich ist doch wichtig, dass jeder weiß wer wann gemeint ist, oder? Was sagen die Amis denn ständig? Sagen die das? Hab ich doch nicht mitgekriegt Aber gut, bei den Amis wird viel erzählt Leider ist einiges was bei den Amis angesagt ist bei uns dann ein halbes Jahr später auch am Start Zum Beispiel eine Sache, die man ja bei den Amis schon länger beobachten kann, sind diese endlosen Gender-Diskussionen Ich meine jetzt nicht sprachlich, sondern nach dem Motto Frauengehalt und Männer benachteilen und Frauen benachteile ich dann wieder hier Männer und so Dieses ganze ewig rumdiskutieren um dieses Thema, das konnte man schon 2-3 Jahre vorher in den USA beobachten Und jetzt ist bei uns auch angesagt Was Erfinder aus dem Bapfe? Was? Oh Leute, ich bin heute extra nur angekommen, weil ich jetzt die letzten 2 Tage gestreamt habe Ich habe gedacht wir müssen nochmal irgendwie hinkriegen Aber so ein 3-4 Tage am Stück Streaming Streak Auch wenn ich heute wirklich zu kaputt war irgendwas sinnvolles zu machen Ich bin jetzt noch eine Viertelstunde da, also chat wenn es noch irgendwas spannendes gibt schießt los Großartig Videos gucken können wir jetzt nicht mehr Und irgendwas machen bin ich heute eh gehirnmäßig nicht mehr in der Lage zu Boomer müde, ja korrekt, ups falsches Emote, wo habe ich denn mein Bett ge Chat ihr müsst mir helfen, ich finde meine Emotes nicht mehr Wo habe ich mein, da Wir implementieren kurz einen Mikrokernel in Rust genau Ich hatte ja mal eigentlich gedacht ich könnte da oben so eine Suche machen guck Das Problem ist nur, ich zeige euch mal was das Problem ist Die Suche ist kaputt und ich habe keinen Bock dieses Projekt nochmal anzufassen Das ist, ich habe dieses Board und dieses Overlay Ding hier Ich habe das vor 4 Jahren oder so programmiert Und das ist noch mit Vue.js, wäre wahrscheinlich schon Vue 2 aber Uralt ich habe keinen Bock dort irgendwas noch drin zu machen Doch das ist so lange her Das war eines der ersten Sachen die ich gemacht habe für den Stream Komplett neu machen das ist schon ein bisschen das war schon ein bisschen was aufwändigeres Kann er nichts Open Source Ich kann das schon aber das ist so hässlich da schäme ich mich für das kann ich nicht hochladen Stadia ist auch irgendwo am Start Stadia benutze ich eigentlich nur in Kombination mit sowas hier oder Ich finde mich hier nicht zurecht weil bei mir ist das anders eingeteilt auf dem zweiten Bildschirm oder sowas hier Wenn ich das im Stream neu baue da brauche ich ewig für das ist wie gesagt das ist nicht so easy gewesen Du brauchst mehrere Komponenten du brauchst die Sache die das rendert auf dem Desktop Das kann ja sogar Keymappings Leute guck mal das kann Keymappings also egal ich kann sogar Ich habe sogar Shortcuts für die E-Mouse die ich nie verwende Ne mit UWP mache ich das auch nicht Muss man da Sachen hochladen können ich kann ja hier die Dinger track und droppen und hochladen und sowas Da ist ja auch Text to Speech dabei guckt mal ihr habt ja hier Kannst du hier Text to Speech eingeben? Kannst du dann hier auswählen? Oder kannst du die Weeb Texts zu Speech machen? Oh ich glaube es ist gecrashed Perfekte Software Leute Ganz toll Also kannst du echt vergessen ich will da nicht mehr dran Ich habe auch kein Rollbackverfahren dafür Bin gebannt? Ne das ist ein bekannter Bug den habe ich öfters Das ist wenn ich nicht die richtige Reihenfolge von Buttons an klicke für Texts zu Speech dann geht es kaputt Guck wenn ich jetzt wenn ich ich glaube Wenn ich hier KW und KW reinschreibe dann rüber switche und ein und aus mache dann ist wieder kaputt Ne das geht schon das das das geht Das habe ich öfter schon gehabt dass es kaputt geht Muss man es vielleicht so machen? Ne Man braucht die richtige Reihenfolge Ke KW Muss man es vielleicht ausschalten? Ke KW Ach keine Ahnung Was jetzt? Kein Plan mehr was ich da gebaut habe In Rust? Dann wäre es Placingly Fast das geht nicht 2035 Na gut Leute Wollen wir heute mal zur Abwechslung wieder irgendjemand hosten? Du folgst mal gucken ob irgendjemand da ist den ich hosten kann von den Leuten Den ich folge die es auch brauchen weil irgendwelche 8000 oder 1000 plus Leute brauchen es wahrscheinlich nicht Dash Bunny? Ne ich bin zu shy grills zu hosten auf Twitch Das geht nicht Da bin ich zu pepo shy für Ich will aber jemand hosten dem ich folge und der das gebrauchen kann Der Sprecher ist online Frage geht zweimal unter Wollte fragen wie du Rust von der Komplexität her einstufen würdest Boah das ist eines der komplexesten Sprachen die ich kenne zu lernen Selbst wenn du schon andere Sprachen gut kannst Wow Dann hausten wir ihn wieder. Raid, was macht er denn heute? Switch. Alter Werbung ey, ich fasse es nicht. Wahnsinn. Okay, ich hab keine Ahnung was er so treibt, irgendwas 3D drucken oder so? Egal. Wir raiden. Wir raiden hin und her. Passt zumindest thematisch meistens. Halbwegs hier zum streamen. Okay Leute wir sehen uns. Ich hau ab. Nächster stream. Mal gucken vielleicht bin ich morgen ein bisschen fitter. Bis denn, machts gut.", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Proc, moin!"}, {"id": 2, "start": 66.0, "end": 70.0, "text": "Kann man vom zweiten Bildschirm kurz was nachgucken."}, {"id": 3, "start": 70.0, "end": 98.0, "text": "Hätte ich nicht gedacht, dass Twitch heute so schnell checkt, dass der Stream on ist."}, {"id": 4, "start": 100.0, "end": 126.0, "text": "Ich bin ziemlich im Arsch heute, ich habe gedacht, ich mache trotzdem noch mal Stream an."}, {"id": 5, "start": 126.0, "end": 136.0, "text": "Ich muss euch mal was fragen."}, {"id": 6, "start": 136.0, "end": 146.0, "text": "Geht euch das auch manchmal so, dass ihr manche Leute einfach nicht versteht, was die sagen?"}, {"id": 7, "start": 146.0, "end": 160.0, "text": "Ich meine nicht akustisch, weil auch geschrieben im Moin Michael 5 Spieljahr, und wie ist es mit Lisa gelaufen?"}, {"id": 8, "start": 160.0, "end": 168.0, "text": "Sowohl geschrieben als auch gesprochen, ihr versteht sie einfach nicht."}, {"id": 9, "start": 168.0, "end": 182.0, "text": "Ich habe mit einem Kollegen auf der Arbeit und ich verstehe ihn einfach nicht."}, {"id": 10, "start": 182.0, "end": 198.0, "text": "Ich denke mir jetzt mal was aus, ich frage ihn nach dem Motto, kannst du dich per SSH einloggen und neu starten?"}, {"id": 11, "start": 198.0, "end": 202.0, "text": "Und dann kommt als Antwort von ihm, ok danke."}, {"id": 12, "start": 202.0, "end": 212.0, "text": "Was will er mir sagen, der antwortet immer so, ich verstehe ihn einfach nicht."}, {"id": 13, "start": 212.0, "end": 218.0, "text": "Der antwortet immer so, dass ich es nicht verstehe."}, {"id": 14, "start": 218.0, "end": 226.0, "text": "Nein das ist kein Autoresponder, der schreibt das wirklich."}, {"id": 15, "start": 226.0, "end": 232.0, "text": "Es kann auch sein, dass er mich nicht versteht, es kann auch sein, man soll er halt was sagen, Max was meinst du?"}, {"id": 16, "start": 232.0, "end": 248.0, "text": "Keine Ahnung, der müsste es eigentlich, ich verstehe ihn nicht."}, {"id": 17, "start": 248.0, "end": 258.0, "text": "Oder ein anderes Beispiel, dabei hat er wirklich Plan von dem was er macht, ich verstehe ihn einfach nicht."}, {"id": 18, "start": 258.0, "end": 268.0, "text": "Auch was, ich habe ihn gefragt, kannst du die zwei Merchrequests aus dem Bitbucket jetzt in GitHub aufmachen?"}, {"id": 19, "start": 268.0, "end": 280.0, "text": "Hab ich ihn gefragt, ist doch eigentlich relativ klar oder? Und dann meint er, ich pushe erst heute Abend was, war die Antwort da drauf."}, {"id": 20, "start": 280.0, "end": 294.0, "text": "Da muss nichts gepusht werden, ist alles da? Ich verstehe es nicht, ich habe wirklich Probleme ihn zu verstehen."}, {"id": 21, "start": 294.0, "end": 304.0, "text": "Nein, nein, nein, nein, das meint er schon ernst, ich verstehe ihn bloß nicht."}, {"id": 22, "start": 304.0, "end": 310.0, "text": "Richtig Ayaya, aber Massive Ayaya."}, {"id": 23, "start": 310.0, "end": 314.0, "text": "Ach der Cutebot hat es jetzt gecheckt, das ist nice."}, {"id": 24, "start": 314.0, "end": 324.0, "text": "Rüpel, Dankeschön für den Sub, Mr. Moogame, 203 IQ, aber Massive IQ."}, {"id": 25, "start": 324.0, "end": 334.0, "text": "Nein, nein, der hat auch nicht so viel zu tun, ich kann das ausschließen, ich glaube der will das eins zu eins so schreiben, nur verstehe ich die Antwort nicht."}, {"id": 26, "start": 334.0, "end": 344.0, "text": "Ich habe mit keinem Problem ihn zu verstehen, aber ihn verstehe ich einfach nicht."}, {"id": 27, "start": 344.0, "end": 354.0, "text": "Vielleicht sagt der X und meint eigentlich Y, das kann natürlich sein, das wäre möglich, aber ich verstehe ihn trotzdem nicht."}, {"id": 28, "start": 354.0, "end": 364.0, "text": "Die Benachrichtigung ist nicht jebait, die ist real."}, {"id": 29, "start": 364.0, "end": 370.0, "text": "Wenn ich jetzt Battlefield 2042 spiele, da kriege ich gar nichts auf die Reihe und wahrscheinlich reg ich mich nur auf."}, {"id": 30, "start": 370.0, "end": 378.0, "text": "Na gut, ich meine ich reg mich wahrscheinlich sonst auch auf, aber noch mehr."}, {"id": 31, "start": 378.0, "end": 386.0, "text": "Ja dann, dann ist ja gut, da konntest du ja punkten."}, {"id": 32, "start": 386.0, "end": 392.0, "text": "Ja das gibt es auch, wir haben da auch so einen Spezialist, das ist ganz schlimm."}, {"id": 33, "start": 392.0, "end": 398.0, "text": "Wenn bei uns Wartungsarbeiten, ne wie heißt das offiziell?"}, {"id": 34, "start": 398.0, "end": 408.0, "text": "Chat hilft mir auf die Reihe, ITIL, ITIL Style, ich sage immer Wartungsarbeiten Runde, wie heißt das nochmal?"}, {"id": 35, "start": 408.0, "end": 416.0, "text": "Change Advisory Board, genau jetzt habe ich es wieder, das ist so ITIL Begriff und alle die ITIL Begriffe verwenden sind."}, {"id": 36, "start": 416.0, "end": 424.0, "text": "Fivehead irgendwie, kommen sich zumindest so vor. Change Advisory Board, da haben wir auch jemand."}, {"id": 37, "start": 424.0, "end": 432.0, "text": "Der stellt immer Nachfragen, um aus Prinzip nachzufragen und genau so, genau so nach diesem Schema."}, {"id": 38, "start": 432.0, "end": 438.0, "text": "Man sagt zum Beispiel, ja dann müssen wir das Zertifikat austauschen, aber das haben wir schon so oft gemacht."}, {"id": 39, "start": 438.0, "end": 442.0, "text": "Da macht man einen Server, danach den zweiten und da kriegt keiner was mit."}, {"id": 40, "start": 442.0, "end": 450.0, "text": "Gerade irgendwie um 1 Uhr nachts passiert da nichts, es sei denn es kommt wirklich gerade irgendwie zu dieser millisekundenen Request."}, {"id": 41, "start": 450.0, "end": 460.0, "text": "Ich würde sagen es ist Standard Change und dann kommt dann irgend so ein Typ dann an und meint,"}, {"id": 42, "start": 460.0, "end": 468.0, "text": "also das ist immer der gleiche, kommt dann an und meint, da hätte ich noch eine Frage dazu."}, {"id": 43, "start": 468.0, "end": 476.0, "text": "Gibt es denn da auch ein Rollback Szenario, weil ich habe ja gerade gehört ihr tauscht die Zertifikate aus."}, {"id": 44, "start": 476.0, "end": 485.0, "text": "Was willst du denn da rollbacken, das Zertifikat läuft aus, entweder du tauscht es nicht aus, dann läuft es ab oder du tauscht es aus."}, {"id": 45, "start": 485.0, "end": 490.0, "text": "Was willst du denn da rollbacken? Was willst du denn da rollbacken?"}, {"id": 46, "start": 490.0, "end": 495.0, "text": "Und dann fragt er, ja aber du sagtest doch die Zertifikate werden ausgetauscht."}, {"id": 47, "start": 495.0, "end": 501.0, "text": "Also beim Austausch der Zertifikate sollte auf ein ordnungsgemäßes Rollback Szenario geachtet werden."}, {"id": 48, "start": 501.0, "end": 507.0, "text": "Das ist so einer der wiederholt auch die Sachen immer wieder uns komplett am Thema vorbei eigentlich."}, {"id": 49, "start": 507.0, "end": 515.0, "text": "Genau was willst du rollbacken bei Zertifikaten, gerade bei Zertifikaten die dringend getauscht werden müssen, weil sie ablaufen."}, {"id": 50, "start": 515.0, "end": 520.0, "text": "Das war eh noch das geilste, ich weiß es ist Recycled Story, aber ich muss es einfach noch mal ganz kurz sagen."}, {"id": 51, "start": 520.0, "end": 528.0, "text": "Am geilsten war immer noch in irgendeiner, irgendeiner Rücksprache war ein Entwickler"}, {"id": 52, "start": 528.0, "end": 533.0, "text": "und der hat einfach nicht verstanden, dass das Zertifikat ausgelaufen ist."}, {"id": 53, "start": 533.0, "end": 538.0, "text": "Ich habe ihm erzählt, also wir müssen das Zertifikat tauschen."}, {"id": 54, "start": 538.0, "end": 545.0, "text": "Das läuft hier ab, also es gibt gar keine Möglichkeit das nicht zu tauschen."}, {"id": 55, "start": 545.0, "end": 550.0, "text": "Oder man möchte quasi der gesamte Außendienst kann sich nicht mehr connecten."}, {"id": 56, "start": 550.0, "end": 557.0, "text": "Und dann meinte der Entwickler zu mir, also ich habe gerade nachgeguckt, das Zertifikat läuft noch bis 2035."}, {"id": 57, "start": 557.0, "end": 575.0, "text": "Und dann denke ich mir auch immer, ich habe verstanden wovon ich rede, ja nein."}, {"id": 58, "start": 575.0, "end": 582.0, "text": "Und er hat dann halt bei der CA nachgeguckt, ja die CA läuft bis 2035, wen juckt die CA?"}, {"id": 59, "start": 582.0, "end": 590.0, "text": "Das sind dann immer so Leute, die sagen das so furchtbar selbstsicher und denken alle, die keine Ahnung haben, der hat voll den Plan."}, {"id": 60, "start": 590.0, "end": 594.0, "text": "Da erzählen die immer einen totalen Blödsinn."}, {"id": 61, "start": 594.0, "end": 599.0, "text": "Und am besten sind dann irgendwelche Manager Leute, das war ja auch geil."}, {"id": 62, "start": 599.0, "end": 603.0, "text": "Da ging es darum Zertifikat austauschen hin und da und Rollback und sonst wie."}, {"id": 63, "start": 603.0, "end": 609.0, "text": "Und ich habe dann halt am Ende gesagt, also nur mal so, dass das alle Beteiligten jetzt mitbekommen haben."}, {"id": 64, "start": 609.0, "end": 617.0, "text": "Wenn das Zertifikat bis in zwei Tagen nicht getauscht ist, dann kommt der gesamte Außendienst nicht mehr auf die Systeme drauf."}, {"id": 65, "start": 617.0, "end": 621.0, "text": "Also ich hoffe, ich möchte das jetzt nur nochmal betonen."}, {"id": 66, "start": 621.0, "end": 627.0, "text": "Und dann kam dann irgendein Manager Dude um die Ecke und meinte, ja was ist in zwei Tagen, wir haben doch jetzt Probleme."}, {"id": 67, "start": 627.0, "end": 633.0, "text": "Und ja macht was ihr wollt, macht so viel ihr wollt, egal, ich habe es gesagt."}, {"id": 68, "start": 633.0, "end": 641.0, "text": "Alter, das ist teilweise so Wahnsinn, man hat echt das Gefühl, in der IT sind 90% Leute,"}, {"id": 69, "start": 641.0, "end": 647.0, "text": "die keine Ahnung haben von dem, wofür sie eigentlich da sind bzw. über was sie sich gerade unterhalten."}, {"id": 70, "start": 647.0, "end": 654.0, "text": "Unglaublich, kann ja nicht sein, weil sonst wird es wahrscheinlich gar nicht funktionieren."}, {"id": 71, "start": 654.0, "end": 659.0, "text": "Aber es muss schon ein echt hoher Anteil sein."}, {"id": 72, "start": 659.0, "end": 669.0, "text": "Doomsfab, danke schön für den Sub, also sehr merkwürdig alles."}, {"id": 73, "start": 669.0, "end": 675.0, "text": "Mit welchem Zeugnis-Shit hast du in deinem Berufsschulzeugnis abgeschnitten?"}, {"id": 74, "start": 675.0, "end": 680.0, "text": "Keine Ahnung."}, {"id": 75, "start": 680.0, "end": 688.0, "text": "Keine Ahnung, 1,2 oder so, ich hatte fast nur einser, weil Berufsschule absolut Easy Mode war."}, {"id": 76, "start": 688.0, "end": 691.0, "text": "Ich habe nichts gemacht heute, ich habe sogar DS gespielt im Unterricht,"}, {"id": 77, "start": 691.0, "end": 697.0, "text": "und einmal ist der Lehrer über das Ladegerät gefallen, hat eigentlich keinen interessiert."}, {"id": 78, "start": 697.0, "end": 702.0, "text": "Also Berufsschule ist wirklich easy as fuck gewesen."}, {"id": 79, "start": 702.0, "end": 711.0, "text": "Oder 1,3, also ich hatte, lass mal überlegen, ich hatte sogar in Sport eine 1, lol."}, {"id": 80, "start": 711.0, "end": 719.0, "text": "In Sport, Alter, ich muss unbedingt eher überlegen, wo hatte ich denn keine 1?"}, {"id": 81, "start": 719.0, "end": 725.0, "text": "Es könnte sein, dass ich in der ganzen BWL-Geschichte,"}, {"id": 82, "start": 725.0, "end": 731.0, "text": "ich glaube ich hatte in Englisch eine 2 und in BWL eine 2 oder so, und der Rest war ein 1."}, {"id": 83, "start": 731.0, "end": 734.0, "text": "Also wirklich Berufsschule war wirklich easy."}, {"id": 84, "start": 734.0, "end": 742.0, "text": "Kann sich das ja in seinem Abschluss-Pattel, wie auch immer das heißt,"}, {"id": 85, "start": 742.0, "end": 746.0, "text": "dieses Abschluss-Ding, was du von der IHK bekommst, da kann man sich ja, wenn man das beantragt,"}, {"id": 86, "start": 746.0, "end": 752.0, "text": "seinen Notendurchschnitt eintragen lassen, habe ich nicht gemacht."}, {"id": 87, "start": 752.0, "end": 754.0, "text": "Juckt keinen, wirklich, juckt niemand."}, {"id": 88, "start": 754.0, "end": 759.0, "text": "Mich hat nie jemals, also nicht nur ansatzweise mal nach Berufsschule,"}, {"id": 89, "start": 759.0, "end": 764.0, "text": "du bist glaube ich der Erste, der mich nach Berufsschulnoten fragt jetzt seit 20 Jahren oder so."}, {"id": 90, "start": 764.0, "end": 767.0, "text": "Na gut, nicht so lange, so lange mache ich das, seit 15 Jahren."}, {"id": 91, "start": 771.0, "end": 781.0, "text": "Übrigens, was auch Fun-Fact, der gleiche Typ, der immer so komische Nachfragen stellt bei uns auf der Arbeit,"}, {"id": 92, "start": 781.0, "end": 788.0, "text": "der hat auch manchmal so ganz komische Einwände, sowas nicht nur wie Rollback,"}, {"id": 93, "start": 788.0, "end": 796.0, "text": "sondern wir wollten uns mal einloggen, nachts auf einer Kiste und dort,"}, {"id": 94, "start": 796.0, "end": 801.0, "text": "ich glaube, irgendwelche Log-Dateien zippen oder so."}, {"id": 95, "start": 801.0, "end": 806.0, "text": "Also was total Banales, ja, war halt irgendwie die Festplatte voll,"}, {"id": 96, "start": 806.0, "end": 809.0, "text": "ein paar Logs zippen und alles war wieder gut gewesen."}, {"id": 97, "start": 809.0, "end": 814.0, "text": "Und dann kam der Typ mit irgendeiner Gefahren- und Risikomatrix an"}, {"id": 98, "start": 814.0, "end": 821.0, "text": "und dann wollte er ernsthaft, dass man anhand der Gefahren- und Risikomatrix das Zippen der Log-Dateien bewertet."}, {"id": 99, "start": 821.0, "end": 827.0, "text": "Und in der Risikomatrix stand dann so Dinger drin, wie Rollback-Verfahren vorhanden,"}, {"id": 100, "start": 827.0, "end": 835.0, "text": "Zwei-Augen-Prinzip, bewährtes Verfahren, blablabla."}, {"id": 101, "start": 835.0, "end": 845.0, "text": "Und wir haben das mal wirklich just for fun, wir haben das just for fun mal bewertet nach diesen Fragen."}, {"id": 102, "start": 845.0, "end": 854.0, "text": "Und da kam raus am Ende, dass das Zipp von Log-Dateien also schon wirklich ein ganz kritischer Change ist."}, {"id": 103, "start": 854.0, "end": 863.0, "text": "Also manchmal erscheint mir das Verhältnis von Leuten,"}, {"id": 104, "start": 863.0, "end": 868.0, "text": "die irgendwelche Organisationssachen machen und es nicht hinbekommen,"}, {"id": 105, "start": 868.0, "end": 874.0, "text": "zu Leuten, die Technik machen, irgendwie unausgewogen."}, {"id": 106, "start": 874.0, "end": 885.0, "text": "So als hast du 80% irgendwelche Dummeschwerzer am Start und 20% die noch irgendwie ein bisschen Ahnung von Technik haben."}, {"id": 107, "start": 885.0, "end": 890.0, "text": "Und von den 20% ist ja der Schlimme und die meisten auch keine Ahnung."}, {"id": 108, "start": 890.0, "end": 895.0, "text": "Wenn ich mir angucke, Entwickler, die nicht wissen, dass ein Zertifikat,"}, {"id": 109, "start": 895.0, "end": 899.0, "text": "also wie ein Zertifikat und wann ein Zertifikat abläuft."}, {"id": 110, "start": 899.0, "end": 914.0, "text": "Letztens sind Change, da wollte einer, dass wir neue Unit-Files auf manche Linux-Server packen."}, {"id": 111, "start": 914.0, "end": 920.0, "text": "Und die Unit-Files sollten dann, also das Unit-Files ist quasi sowas wie der Autostart unter Windows."}, {"id": 112, "start": 920.0, "end": 926.0, "text": "Also simpel, naja, nicht wirklich, aber ich glaube die meisten Leute können sich das am besten vorstellen."}, {"id": 113, "start": 926.0, "end": 930.0, "text": "Das ist quasi sowas wie Service-Auto-Start unter Windows."}, {"id": 114, "start": 930.0, "end": 935.0, "text": "Da legt man ein Text-File hin, wo im Prinzip drin steht, was gestartet werden soll."}, {"id": 115, "start": 935.0, "end": 943.0, "text": "Und in diesem Start-File musste man halt dann den eigentlichen Service starten."}, {"id": 116, "start": 943.0, "end": 949.0, "text": "Und man hat dann ein weiteres Start-Script aufgerufen von ihm und ein weiteres Stoppscript aufgerufen von ihm."}, {"id": 117, "start": 949.0, "end": 957.0, "text": "Und das erste was passiert ist, ich leg ein Unit-File hin, starte die Unit, failed, geht nicht."}, {"id": 118, "start": 957.0, "end": 963.0, "text": "Ich stoppe die Unit, Endlosschleife, im Stoppscript."}, {"id": 119, "start": 963.0, "end": 971.0, "text": "Der hat irgendwie hardcoded da ein Pit-File drin, was nicht existiert hat und er nichts gefunden hat, keine Fehler abgefangen hat."}, {"id": 120, "start": 971.0, "end": 977.0, "text": "Und dann hing dann das Stopps, das muss man erstmal schaffen, ein Stoppscript, das in einer Endlosschleife hängen kann."}, {"id": 121, "start": 977.0, "end": 981.0, "text": "Ich frage mich allen Ernstes, wie die Leute da teilweise in ihre Jobs gekommen sind."}, {"id": 122, "start": 981.0, "end": 982.0, "text": "Ernsthaft?"}, {"id": 123, "start": 987.0, "end": 989.0, "text": "Kein Timeout und nix."}, {"id": 124, "start": 993.0, "end": 996.0, "text": "Ich meine, die Unit geht glaube ich nach 45 Sekunden in failed oder so."}, {"id": 125, "start": 996.0, "end": 1002.0, "text": "Aber trotzdem, Alter, das ist teilweise echt die planke Unfähigkeit, die einer jeden Tag entgegenspringt."}, {"id": 126, "start": 1002.0, "end": 1007.0, "text": "Aus allen Ecken."}, {"id": 127, "start": 1009.0, "end": 1011.0, "text": "Weder noch."}, {"id": 128, "start": 1011.0, "end": 1015.0, "text": "Ich habe noch nicht gewechselt, aber ich habe das Vorhaben auch noch nicht gestoppt."}, {"id": 129, "start": 1015.0, "end": 1017.0, "text": "Aber ich habe es nicht so eilig."}, {"id": 130, "start": 1017.0, "end": 1035.0, "text": "Also ich kam nicht vom Gymnasium und ich habe trotzdem die Berufsschule gemacht."}, {"id": 131, "start": 1035.0, "end": 1040.0, "text": "Ihr wisst ja, ich habe mal in grauer Vorzeit was BWL-mäßiges gemacht."}, {"id": 132, "start": 1040.0, "end": 1048.0, "text": "Aber das möchte ich nicht weiter ausführen."}, {"id": 133, "start": 1048.0, "end": 1054.0, "text": "Ich habe festgestellt, das ist nichts für mich."}, {"id": 134, "start": 1054.0, "end": 1058.0, "text": "Aber das Berufsschulzeug ist doch eh nicht richtig wichtig, oder?"}, {"id": 135, "start": 1064.0, "end": 1068.0, "text": "Ach so, das Berufsschulzeug, ich habe das Berufsschulzeug gelesen."}, {"id": 136, "start": 1068.0, "end": 1071.0, "text": "Das Berufsschulzeug, nein, das Berufsschulzeugnis ist nicht wichtig."}, {"id": 137, "start": 1071.0, "end": 1074.0, "text": "Das Berufsschulzeugnis interessiert wirklich kein Mensch."}, {"id": 138, "start": 1074.0, "end": 1076.0, "text": "Also gar kein."}, {"id": 139, "start": 1086.0, "end": 1090.0, "text": "Was bei einer Mitarbeiter funktioniert das Office-Tran vom Sechskonto nicht?"}, {"id": 140, "start": 1090.0, "end": 1098.0, "text": "Welches bei ihr?"}, {"id": 141, "start": 1098.0, "end": 1100.0, "text": "Ja, so Leute sind auch geil."}, {"id": 142, "start": 1110.0, "end": 1113.0, "text": "Ja, wie gesagt, Unfähigkeitenpersonen überall."}, {"id": 143, "start": 1113.0, "end": 1116.0, "text": "Ich werde auch manchmal zu irgendwelchen Besprechungen eingeladen."}, {"id": 144, "start": 1116.0, "end": 1118.0, "text": "Das sind dann die geilsten Dinge."}, {"id": 145, "start": 1118.0, "end": 1120.0, "text": "Ihr kriegt einfach random einen Anruf."}, {"id": 146, "start": 1120.0, "end": 1122.0, "text": "Kennt ihr das, wenn ihr random einen Anruf kriegt"}, {"id": 147, "start": 1122.0, "end": 1124.0, "text": "von irgendeinem Besprechungsraum in Teams"}, {"id": 148, "start": 1124.0, "end": 1128.0, "text": "und ihr seid nicht eingeladen und ihr fragt euch, was geht?"}, {"id": 149, "start": 1128.0, "end": 1130.0, "text": "Was wollen die?"}, {"id": 150, "start": 1130.0, "end": 1133.0, "text": "Dann geht ihr dran und das erste, was ihr hört, ist sowas."}, {"id": 151, "start": 1133.0, "end": 1135.0, "text": "Ja, es geht irgendwas nicht."}, {"id": 152, "start": 1135.0, "end": 1139.0, "text": "Habt ihr nicht gestern Abend Wartungsarbeiten gemacht?"}, {"id": 153, "start": 1139.0, "end": 1141.0, "text": "Kann das daran liegen?"}, {"id": 154, "start": 1141.0, "end": 1143.0, "text": "So nach dem Motto."}, {"id": 155, "start": 1143.0, "end": 1156.0, "text": "Und was sprecht ihr überhaupt?"}, {"id": 156, "start": 1156.0, "end": 1159.0, "text": "Das liegt wahrscheinlich daran, weil ihr da viele Szenarien"}, {"id": 157, "start": 1159.0, "end": 1167.0, "text": "aus der echten Welt verarbeitet habt."}, {"id": 158, "start": 1167.0, "end": 1173.0, "text": "Oh, du hattest die erste Berufsschulwoche an der Werder von Siemens Schule."}, {"id": 159, "start": 1173.0, "end": 1176.0, "text": "Ja, die Schule ist aber richtig kacke."}, {"id": 160, "start": 1176.0, "end": 1178.0, "text": "Es ist halt insofern ganz gut."}, {"id": 161, "start": 1178.0, "end": 1182.0, "text": "Du kannst halt AFK sein und trotzdem Einsatz schreiben."}, {"id": 162, "start": 1182.0, "end": 1184.0, "text": "Die Schule ist halt mega hässlich."}, {"id": 163, "start": 1184.0, "end": 1187.0, "text": "Dreckig, die Kantine kriegst du Dünnsches von."}, {"id": 164, "start": 1187.0, "end": 1189.0, "text": "Und zumindest war das früher so."}, {"id": 165, "start": 1189.0, "end": 1191.0, "text": "Wahrscheinlich ist das heute immer noch so."}, {"id": 166, "start": 1191.0, "end": 1194.0, "text": "Und es sieht generell aus wie im Knast."}, {"id": 167, "start": 1194.0, "end": 1197.0, "text": "Das ist dir wahrscheinlich auch aufgefallen, oder?"}, {"id": 168, "start": 1197.0, "end": 1206.0, "text": "Dass es wie im Knast aussieht da drin und aufgeteilt ist."}, {"id": 169, "start": 1206.0, "end": 1208.0, "text": "Das stimmt, das stimmt."}, {"id": 170, "start": 1208.0, "end": 1211.0, "text": "Also wenn du drei Monate durchgehend für die Prüfung lernst,"}, {"id": 171, "start": 1211.0, "end": 1213.0, "text": "ist die Berufsschule komplett unsinnig."}, {"id": 172, "start": 1213.0, "end": 1220.0, "text": "Nichtsdestotrotz, finde ich, ist Berufsschule nicht ganz unsinnig."}, {"id": 173, "start": 1220.0, "end": 1222.0, "text": "Aber zum größten Teil schon."}, {"id": 174, "start": 1222.0, "end": 1225.0, "text": "Aber manchmal macht man durchaus sinnvolle Sachen."}, {"id": 175, "start": 1225.0, "end": 1227.0, "text": "Und manchmal kann man tatsächlich noch was fragen,"}, {"id": 176, "start": 1227.0, "end": 1229.0, "text": "was man nicht verstanden hat."}, {"id": 177, "start": 1229.0, "end": 1231.0, "text": "Und dann hat vielleicht auch mal einer Plan."}, {"id": 178, "start": 1231.0, "end": 1232.0, "text": "Ganz vereinzelt."}, {"id": 179, "start": 1232.0, "end": 1234.0, "text": "Aber im Großen und Ganzen bringt das nichts."}, {"id": 180, "start": 1234.0, "end": 1237.0, "text": "Dani Lull, 39 Monate."}, {"id": 181, "start": 1237.0, "end": 1239.0, "text": "Du bist ja wirklich schon von ganz Anfang an mit dabei."}, {"id": 182, "start": 1239.0, "end": 1241.0, "text": "Dankeschön für den Sub."}, {"id": 183, "start": 1241.0, "end": 1243.0, "text": "Massive Hyper Subscription."}, {"id": 184, "start": 1247.0, "end": 1251.0, "text": "Du bist Systemintegrator am zweiten Lehrjahr."}, {"id": 185, "start": 1251.0, "end": 1254.0, "text": "Was soll man dafür machen im neuen Lehrplan?"}, {"id": 186, "start": 1254.0, "end": 1258.0, "text": "Cyberphysische Systeme."}, {"id": 187, "start": 1258.0, "end": 1260.0, "text": "Was soll das überhaupt sein?"}, {"id": 188, "start": 1260.0, "end": 1262.0, "text": "Das ist doch wieder so ein Wort,"}, {"id": 189, "start": 1262.0, "end": 1269.0, "text": "was sich irgendwie ein superschlauer IHK-PyFat-Mensch ausgedacht hat, oder?"}, {"id": 190, "start": 1269.0, "end": 1271.0, "text": "Was sind Cyberphysis?"}, {"id": 191, "start": 1271.0, "end": 1275.0, "text": "Das habe ich noch nie gehört."}, {"id": 192, "start": 1275.0, "end": 1280.0, "text": "Ist ein Computer, der etwas in der physischen Welt steuert?"}, {"id": 193, "start": 1280.0, "end": 1282.0, "text": "Ah!"}, {"id": 194, "start": 1282.0, "end": 1286.0, "text": "Was für eine ultrabeknackte Bezeichnung."}, {"id": 195, "start": 1293.0, "end": 1297.0, "text": "Das ist ja absolut hängen geblieben."}, {"id": 196, "start": 1300.0, "end": 1305.0, "text": "Also im Prinzip der Microcontroller in meinem Klo,"}, {"id": 197, "start": 1305.0, "end": 1314.0, "text": "der dafür sorgt, dass die Wasserdüse Wasser rausspritzt."}, {"id": 198, "start": 1316.0, "end": 1320.0, "text": "Das ist ein cyberphysisches System."}, {"id": 199, "start": 1324.0, "end": 1326.0, "text": "Aber das ist..."}, {"id": 200, "start": 1326.0, "end": 1327.0, "text": "Okay."}, {"id": 201, "start": 1327.0, "end": 1330.0, "text": "Aber warum nennt man das nicht IoT?"}, {"id": 202, "start": 1330.0, "end": 1334.0, "text": "Ganz ehrlich, cyberphysisches System ist so ein beknacktes Wort."}, {"id": 203, "start": 1334.0, "end": 1337.0, "text": "Habe ich noch nie gehört."}, {"id": 204, "start": 1337.0, "end": 1340.0, "text": "Passt das gut rein zum Systemintegrator?"}, {"id": 205, "start": 1340.0, "end": 1342.0, "text": "IoT-Kram auf jeden Fall."}, {"id": 206, "start": 1342.0, "end": 1345.0, "text": "Da musst du dich ja auch ein bisschen mit Netzwerkgedöns beschäftigen."}, {"id": 207, "start": 1345.0, "end": 1349.0, "text": "Du musst dich vielleicht mit den ein oder anderen Microcontroller-Sachen beschäftigen."}, {"id": 208, "start": 1349.0, "end": 1353.0, "text": "Aber sag mal, was macht ihr denn da eigentlich dann so?"}, {"id": 209, "start": 1353.0, "end": 1356.0, "text": "Was macht man denn in diesem Fach so?"}, {"id": 210, "start": 1356.0, "end": 1357.0, "text": "Was kann man sich..."}, {"id": 211, "start": 1357.0, "end": 1360.0, "text": "Ich meine, nur was ich mir darunter vorstelle, heißt ja nicht,"}, {"id": 212, "start": 1360.0, "end": 1364.0, "text": "was die Berufsschule auch darunter vorstellt."}, {"id": 213, "start": 1367.0, "end": 1368.0, "text": "Die..."}, {"id": 214, "start": 1368.0, "end": 1370.0, "text": "Hier."}, {"id": 215, "start": 1371.0, "end": 1373.0, "text": "Werner von Siemens Schule Frankfurt."}, {"id": 216, "start": 1373.0, "end": 1376.0, "text": "Das Ding sieht aus wie im Knast."}, {"id": 217, "start": 1376.0, "end": 1378.0, "text": "Ich habe es euch doch schon mal gezeigt."}, {"id": 218, "start": 1378.0, "end": 1380.0, "text": "Gibt es da überhaupt Bilder von innen?"}, {"id": 219, "start": 1380.0, "end": 1382.0, "text": "Gibt es da Bilder von innen?"}, {"id": 220, "start": 1382.0, "end": 1383.0, "text": "Wahrscheinlich nicht."}, {"id": 221, "start": 1383.0, "end": 1393.0, "text": "Da trauen die sich nicht, Bilder von innen zu machen."}, {"id": 222, "start": 1393.0, "end": 1397.0, "text": "Gibt keine Bilder von innen."}, {"id": 223, "start": 1397.0, "end": 1399.0, "text": "Gibt nur Bilder von außen."}, {"id": 224, "start": 1399.0, "end": 1402.0, "text": "Die wissen auch genau, warum."}, {"id": 225, "start": 1402.0, "end": 1411.0, "text": "Ganz oben rechts, das ist aber nicht die Werner von Siemens Schule in Frankfurt."}, {"id": 226, "start": 1411.0, "end": 1415.0, "text": "Die Bewertungen sind immer noch zu geil, Alter."}, {"id": 227, "start": 1423.0, "end": 1425.0, "text": "Religion hatten wir auch irgendwie zwei Stunden"}, {"id": 228, "start": 1425.0, "end": 1429.0, "text": "und dann war die krank für die nächsten fünf Jahre."}, {"id": 229, "start": 1429.0, "end": 1432.0, "text": "Fünf Jahre, drei Jahre."}, {"id": 230, "start": 1437.0, "end": 1438.0, "text": "Gab es da nicht..."}, {"id": 231, "start": 1438.0, "end": 1440.0, "text": "Gab es nicht in Google Maps?"}, {"id": 232, "start": 1440.0, "end": 1443.0, "text": "Wie kommt man denn jetzt zu den Fotos von Google Maps?"}, {"id": 233, "start": 1443.0, "end": 1445.0, "text": "Google Rezensionen?"}, {"id": 234, "start": 1446.0, "end": 1449.0, "text": "Wegbeschreibung vielleicht?"}, {"id": 235, "start": 1450.0, "end": 1453.0, "text": "Von Hanau, na alles klar."}, {"id": 236, "start": 1453.0, "end": 1455.0, "text": "Gut, ähm..."}, {"id": 237, "start": 1463.0, "end": 1465.0, "text": "Fotos."}, {"id": 238, "start": 1465.0, "end": 1469.0, "text": "Nee, nee, auf die Fotos kommst du woanders raus."}, {"id": 239, "start": 1470.0, "end": 1472.0, "text": "Ah, Sporthalle."}, {"id": 240, "start": 1472.0, "end": 1473.0, "text": "Ein Busch."}, {"id": 241, "start": 1473.0, "end": 1476.0, "text": "Der Knast von außen, der Knast von innen."}, {"id": 242, "start": 1476.0, "end": 1478.0, "text": "Penna-Matratzen."}, {"id": 243, "start": 1478.0, "end": 1482.0, "text": "Ein dunkler Weg."}, {"id": 244, "start": 1485.0, "end": 1487.0, "text": "Ein Klassenraum."}, {"id": 245, "start": 1489.0, "end": 1492.0, "text": "Man sieht leider das Ganze nicht von innen."}, {"id": 246, "start": 1492.0, "end": 1497.0, "text": "Was aber auch gut ist, weil von innen sieht das Ding wirklich aus wie im Knast."}, {"id": 247, "start": 1501.0, "end": 1505.0, "text": "Nee, hab ich noch nicht, hab ich noch nicht gesehen."}, {"id": 248, "start": 1516.0, "end": 1520.0, "text": "Tja, da fragt man sich warum das so einfach geht."}, {"id": 249, "start": 1520.0, "end": 1524.0, "text": "Sind halt nur besonders fähige Leute da."}, {"id": 250, "start": 1524.0, "end": 1526.0, "text": "Hast du denn wieder Urlaub im Dezember?"}, {"id": 251, "start": 1526.0, "end": 1528.0, "text": "Ja, ganz Dezember."}, {"id": 252, "start": 1530.0, "end": 1534.0, "text": "Ich wollte gerade sagen, das mit der File Struktur hab ich schon gesehen."}, {"id": 253, "start": 1544.0, "end": 1546.0, "text": "1, 2, 3, 4, 5, 6."}, {"id": 254, "start": 1546.0, "end": 1550.0, "text": "Bestimmt fast so sicheres Passwort wie bei Uber."}, {"id": 255, "start": 1572.0, "end": 1574.0, "text": "Was weiß ich, keine Ahnung."}, {"id": 256, "start": 1574.0, "end": 1580.0, "text": "Irgendjemand hat mich gefragt, ob ich irgendwie ein Studio mal nachholen will oder so."}, {"id": 257, "start": 1580.0, "end": 1582.0, "text": "Nee."}, {"id": 258, "start": 1582.0, "end": 1583.0, "text": "Will ich nicht."}, {"id": 259, "start": 1583.0, "end": 1586.0, "text": "Also erstens hab ich mit 38 wenig Bock drauf nochmal zu studieren."}, {"id": 260, "start": 1586.0, "end": 1588.0, "text": "Und vor allem, wozu?"}, {"id": 261, "start": 1588.0, "end": 1590.0, "text": "Warum sollte ich das machen?"}, {"id": 262, "start": 1590.0, "end": 1593.0, "text": "Das würde ich nur machen, wenn ich sag, ja okay."}, {"id": 263, "start": 1593.0, "end": 1598.0, "text": "Mich würden da irgendwie die theoretischen Inhalte brennend interessieren."}, {"id": 264, "start": 1598.0, "end": 1602.0, "text": "So nach dem Motto, ich will mal ein bisschen Mathe lernen oder sowas."}, {"id": 265, "start": 1602.0, "end": 1603.0, "text": "Okay, ja."}, {"id": 266, "start": 1603.0, "end": 1605.0, "text": "Dann könnte ich mir das..."}, {"id": 267, "start": 1605.0, "end": 1609.0, "text": "Ja, aber aktuell, also es gibt für mich eigentlich gesagt wenig..."}, {"id": 268, "start": 1609.0, "end": 1611.0, "text": "Es ergibt für mich wenig Sinn, das zu machen."}, {"id": 269, "start": 1611.0, "end": 1615.0, "text": "Das wären 2 oder 3 Jahre, weiß gar nicht, 3 Jahre eher, weiß gar nicht, wie lange das geht."}, {"id": 270, "start": 1615.0, "end": 1619.0, "text": "In denen ich kein Kohle verdienen würde, in denen ich meinen Job nicht weitermachen könnte."}, {"id": 271, "start": 1619.0, "end": 1621.0, "text": "Und am Ende verdiene ich auch nicht mehr."}, {"id": 272, "start": 1621.0, "end": 1623.0, "text": "Also warum sollte ich das machen?"}, {"id": 273, "start": 1629.0, "end": 1630.0, "text": "Alter, was ist mit den Leuten los?"}, {"id": 274, "start": 1630.0, "end": 1635.0, "text": "Warum hat er irgendwelche Gewehre bei sich im Studentenwohnheim?"}, {"id": 275, "start": 1638.0, "end": 1641.0, "text": "Lull, ist klar, ist klar."}, {"id": 276, "start": 1641.0, "end": 1644.0, "text": "Macht das mal nebenberuflich, alles klar."}, {"id": 277, "start": 1644.0, "end": 1645.0, "text": "Es gibt Leute, die machen..."}, {"id": 278, "start": 1645.0, "end": 1651.0, "text": "Ich mein, guck mal, wenn du arbeiten gehst, dann machst du ja schon fast den ganzen Tag nichts anderes wie arbeiten gehen."}, {"id": 279, "start": 1651.0, "end": 1658.0, "text": "Aber wenn du arbeiten gehst und nebenberuflich studierst, dann machst du ja in der Zeit, wo du nicht arbeiten gehst, auch nichts anderes als zu lernen."}, {"id": 280, "start": 1658.0, "end": 1664.0, "text": "Nee, ja, aber ganz nachher, es ergibt für mich überhaupt keinen Sinn, warum ich das machen sollte."}, {"id": 281, "start": 1665.0, "end": 1670.0, "text": "Es ist ja noch nicht mal so, als hätte ich großartig bessere Gehaltsaussichten danach."}, {"id": 282, "start": 1670.0, "end": 1676.0, "text": "Das Einzige, wofür es gut wäre, ist, wenn ich mal zu einem Amt will, für irgendeine Laufbahn, wo sie sagen, du musst studiert haben."}, {"id": 283, "start": 1676.0, "end": 1682.0, "text": "Also es macht überhaupt gar keinen Sinn für mich."}, {"id": 284, "start": 1682.0, "end": 1685.0, "text": "Wie ist aktuell Homeoffice-Regel bei dir in der Tage?"}, {"id": 285, "start": 1685.0, "end": 1694.0, "text": "Drei Tage Homeoffice, zwei Tage Homeoffice, äh, zwei Tage, äh, drei Tage Homeoffice, zwei Tage Anwesen ist bei uns die Regel."}, {"id": 286, "start": 1694.0, "end": 1699.0, "text": "Dadurch, dass ich nur vier Tage die Woche arbeite, ist das immer ein bisschen fließend, ja?"}, {"id": 287, "start": 1699.0, "end": 1701.0, "text": "Mal auch vielleicht einen Tag."}, {"id": 288, "start": 1704.0, "end": 1707.0, "text": "Ich kann dazu nichts sagen, ich hab nicht studiert."}, {"id": 289, "start": 1707.0, "end": 1708.0, "text": "Keine Ahnung."}, {"id": 290, "start": 1708.0, "end": 1718.0, "text": "Also, aus meiner Sicht beziehungsweise aus dem, wie es bei mir gelaufen ist, nee, wozu?"}, {"id": 291, "start": 1719.0, "end": 1722.0, "text": "Ähm, das kann man aber so pauschal nicht sagen."}, {"id": 292, "start": 1722.0, "end": 1730.0, "text": "Ich mein, im Durchschnitt ist es ja tatsächlich so, dass Leute, die studiert haben, mehr verdient, also im Durchschnitt, ja?"}, {"id": 293, "start": 1730.0, "end": 1733.0, "text": "Als Leute, die nicht studiert haben, auch in IT-Berufen."}, {"id": 294, "start": 1733.0, "end": 1740.0, "text": "Das muss jetzt eben nicht zwangsläufig auf euch zutreffen, also, natürlich habt ihr prinzipiell dann bessere Chancen."}, {"id": 295, "start": 1740.0, "end": 1743.0, "text": "Sonst kommt der Durchschnitt, kommt er nicht von ungefähr."}, {"id": 296, "start": 1743.0, "end": 1750.0, "text": "Aber wenn ihr Plan habt und in irgendeinem Bereich landet, wo man Leute sucht, was ja quasi mehr oder weniger jeder aktuell ist,"}, {"id": 297, "start": 1750.0, "end": 1754.0, "text": "also, es sei denn, es interessiert einen halt, ja?"}, {"id": 298, "start": 1754.0, "end": 1763.0, "text": "Du kannst da schon theoretisch, du hast dann theoretisch schon viele Sachen gelernt, die du jetzt als Fachinformatiker nicht wirklich lernst."}, {"id": 299, "start": 1763.0, "end": 1768.0, "text": "Also, beweis mal irgendwie die Laufzeit von einem Algorithmus oder sowas."}, {"id": 300, "start": 1768.0, "end": 1771.0, "text": "Das machst du halt als Fachinformatiker Systemintegration nicht."}, {"id": 301, "start": 1773.0, "end": 1775.0, "text": "Wenn du Mathe studiert hast, kannst du das schon eh."}, {"id": 302, "start": 1775.0, "end": 1780.0, "text": "Es ist halt die Frage, bringt dir das irgendwas in deinem Job, den du machst?"}, {"id": 303, "start": 1780.0, "end": 1784.0, "text": "Und ist dein Arbeitgeber dafür bereit, mir auszugeben, dass du das kannst?"}, {"id": 304, "start": 1784.0, "end": 1788.0, "text": "Ja, wenn es ein Job ist, wo man das braucht, bestimmt, vielleicht, weiß man nicht."}, {"id": 305, "start": 1788.0, "end": 1792.0, "text": "Aber ansonsten, wozu?"}, {"id": 306, "start": 1792.0, "end": 1795.0, "text": "Würde ich nicht generell empfehlen."}, {"id": 307, "start": 1795.0, "end": 1797.0, "text": "Ausbildung ist vollkommen in Ordnung."}, {"id": 308, "start": 1797.0, "end": 1799.0, "text": "Guck mal, es suchen aktuell, vor allem wozu, ja?"}, {"id": 309, "start": 1799.0, "end": 1803.0, "text": "Wenn du, es sei denn, es sei denn, es interessiert halt dieser Aspekt besonders, ja?"}, {"id": 310, "start": 1803.0, "end": 1806.0, "text": "Und du willst vielleicht auch wirklich spät in die Arbeit gehen."}, {"id": 311, "start": 1806.0, "end": 1810.0, "text": "Wo das Voraussetzung ist, meinetwegen, dann macht das alles Sinn."}, {"id": 312, "start": 1810.0, "end": 1814.0, "text": "Aber pauschal zu sagen, studieren gehen nach der Ausbildung, wozu?"}, {"id": 313, "start": 1814.0, "end": 1819.0, "text": "Ich meine, Fachinformatiker werden eh händeringend überall gesucht."}, {"id": 314, "start": 1821.0, "end": 1827.0, "text": "Und du kannst dies ja aktuell, wenn du ein bisschen Ahnung hast,"}, {"id": 315, "start": 1827.0, "end": 1829.0, "text": "nahezu aussuchen, wo du hingehst."}, {"id": 316, "start": 1831.0, "end": 1833.0, "text": "Also, insofern."}, {"id": 317, "start": 1833.0, "end": 1836.0, "text": "Warum?"}, {"id": 318, "start": 1836.0, "end": 1838.0, "text": "Ich hab nicht studiert."}, {"id": 319, "start": 1838.0, "end": 1840.0, "text": "Ich hab nichts gewählt in der Uni."}, {"id": 320, "start": 1842.0, "end": 1846.0, "text": "Vier Tage, ja, ich mach seit 2000."}, {"id": 321, "start": 1852.0, "end": 1856.0, "text": "Ich sag mal so seit 2012, ungefähr."}, {"id": 322, "start": 1857.0, "end": 1859.0, "text": "Aber ich hab nicht studiert."}, {"id": 323, "start": 1859.0, "end": 1866.0, "text": "2012, ungefähr, arbeite ich Teilzeit nur noch vier Tage die Woche."}, {"id": 324, "start": 1866.0, "end": 1871.0, "text": "Ungefähr neun oder zehn Jahre mach ich das, ganz schön lang, oder?"}, {"id": 325, "start": 1878.0, "end": 1882.0, "text": "Und es gibt zwei Punkte, die ich mir nicht erklären kann, so wirklich."}, {"id": 326, "start": 1882.0, "end": 1886.0, "text": "Wie ich es früher geschafft habe, fünf Tage die Woche."}, {"id": 327, "start": 1886.0, "end": 1890.0, "text": "30 Stunden, sonst glaube ich."}, {"id": 328, "start": 1892.0, "end": 1894.0, "text": "Könnten auch 32 Stunden sein."}, {"id": 329, "start": 1894.0, "end": 1897.0, "text": "Es sind 7,4 Stunden am Tag."}, {"id": 330, "start": 1903.0, "end": 1907.0, "text": "7,4 x 4."}, {"id": 331, "start": 1907.0, "end": 1909.0, "text": "30."}, {"id": 332, "start": 1912.0, "end": 1914.0, "text": "So, was wollte ich denn jetzt sagen?"}, {"id": 333, "start": 1914.0, "end": 1916.0, "text": "So, was wollte ich denn jetzt sagen?"}, {"id": 334, "start": 1921.0, "end": 1926.0, "text": "Genau, es gibt zwei Punkte, die ich mir nicht erklären kann, wie ich das geschafft hab."}, {"id": 335, "start": 1926.0, "end": 1930.0, "text": "Und zwar, wie habe ich es früher geschafft, fünf Tage die Woche,"}, {"id": 336, "start": 1930.0, "end": 1934.0, "text": "sieben und halb, bzw. ich nenne es jetzt einfach, acht Stunden am Tag zu arbeiten,"}, {"id": 337, "start": 1934.0, "end": 1938.0, "text": "in Frankfurt jeden Tag dorthin zu fahren,"}, {"id": 338, "start": 1938.0, "end": 1942.0, "text": "mit dem Zug hin und zurück."}, {"id": 339, "start": 1942.0, "end": 1946.0, "text": "Wie habe ich das ausgehalten? Unbegreiflich, verstehe ich heute nicht mehr."}, {"id": 340, "start": 1946.0, "end": 1950.0, "text": "Und das nächste ist, wie habe ich es ausgehalten,"}, {"id": 341, "start": 1950.0, "end": 1955.0, "text": "vier Stunden am Tag hinzufahren mit dem Zug,"}, {"id": 342, "start": 1956.0, "end": 1958.0, "text": "jeden Tag hin und zurück."}, {"id": 343, "start": 1959.0, "end": 1963.0, "text": "Ich verstehe es überhaupt nicht. Ich weiß gar nicht, wie man das aushält."}, {"id": 344, "start": 1963.0, "end": 1970.0, "text": "Allein schon die Probleme, die man mit der Bahn hat, sind quasi schon Kündigungsgrund genug."}, {"id": 345, "start": 1970.0, "end": 1975.0, "text": "Und alles andere, man muss sich das mal vorstellen, ich habe das nie realisiert früher."}, {"id": 346, "start": 1975.0, "end": 1981.0, "text": "Ich bin um 5.45 Uhr aufgestanden, bin dann zum Südbahnhof gefahren, bin nach Frankfurt gelaufen."}, {"id": 347, "start": 1981.0, "end": 1985.0, "text": "Ich habe mir da überhaupt nichts bei gedacht, aber ich war morgens müde."}, {"id": 348, "start": 1987.0, "end": 1992.0, "text": "Ich war mittags, ich war auf der Arbeit, ich war morgens müde, mittags müde, abends müde."}, {"id": 349, "start": 1992.0, "end": 1996.0, "text": "Und als ich daheim war, war ich so müde, dass ich eigentlich schon fast vom Rechner eingepennt bin."}, {"id": 350, "start": 1996.0, "end": 2005.0, "text": "Ich habe eigentlich nichts gemacht, außer so vier Tage die Woche so ein bisschen vor mich hin vegetiert."}, {"id": 351, "start": 2005.0, "end": 2008.0, "text": "Und dann bin ich schlafen gegangen und das dann wieder."}, {"id": 352, "start": 2008.0, "end": 2011.0, "text": "Und dann hatte ich halt drei Tage, konnte ich halt Action machen."}, {"id": 353, "start": 2011.0, "end": 2017.0, "text": "Aber ich sage euch, das ist das Beste für alle Seiten, was passieren konnte,"}, {"id": 354, "start": 2017.0, "end": 2021.0, "text": "für Leute, die Homeoffice machen können, ist Corona gewesen die letzten Jahre."}, {"id": 355, "start": 2021.0, "end": 2027.0, "text": "Weil es hat sich dadurch bei vielen Unternehmen etabliert, bei vielen auch bewährt"}, {"id": 356, "start": 2027.0, "end": 2030.0, "text": "und viele Unternehmen hätten es gar nicht ausprobiert ohne Corona"}, {"id": 357, "start": 2030.0, "end": 2037.0, "text": "und ohne die Pflicht dazu, dass sie es machen müssen, wahrscheinlich hätten es auch ein paar nicht gemacht."}, {"id": 358, "start": 2037.0, "end": 2043.0, "text": "Und dadurch, dass diese ganze Homeoffice-Thematik jetzt in vielen Bereichen Einzug gehalten hat,"}, {"id": 359, "start": 2043.0, "end": 2051.0, "text": "ist es ja mittlerweile auch so, dass die Leute quasi ihre Jobwahlen zumindest zum Teil mit davon abhängig machen."}, {"id": 360, "start": 2051.0, "end": 2052.0, "text": "Das finde ich gut."}, {"id": 361, "start": 2052.0, "end": 2058.0, "text": "Weil ganz im Ernst, es haben wirklich alle nur, also in meinem Fall, ich kann ja immer nur von mir reden,"}, {"id": 362, "start": 2058.0, "end": 2061.0, "text": "es haben alle Seiten nur Pluspunkte davon."}, {"id": 363, "start": 2061.0, "end": 2068.0, "text": "Ja, also mir, einfach ganz unabstrich, mir geht es besser und ich schaffe am Endeffekt sogar mehr."}, {"id": 364, "start": 2068.0, "end": 2072.0, "text": "Also es ist eigentlich für alle beteiligt nur besser."}, {"id": 365, "start": 2072.0, "end": 2079.0, "text": "Leider gibt es noch viele Unternehmen, die gar so viele Boomer-Managements sitzen haben,"}, {"id": 366, "start": 2079.0, "end": 2085.0, "text": "die sie überhaupt nicht gebacken kriegen und meinen, wenn du den Leuten nicht 24-7 auf dem Monitor gucken kannst,"}, {"id": 367, "start": 2085.0, "end": 2086.0, "text": "dann wird das nichts."}, {"id": 368, "start": 2086.0, "end": 2093.0, "text": "Aber vielleicht, und das ist ja glaube ich eines der Sachen, die bei Corona festgestellt wurden,"}, {"id": 369, "start": 2093.0, "end": 2100.0, "text": "ich weiß nicht, wie das bei euch ist, aber ich hatte in Corona-Zeiten den Eindruck,"}, {"id": 370, "start": 2100.0, "end": 2107.0, "text": "dass die Leute, die eigentlich nichts können und nur schwätzen den ganzen Tag,"}, {"id": 371, "start": 2107.0, "end": 2112.0, "text": "besonders stark gelitten haben unter Homeoffice."}, {"id": 372, "start": 2112.0, "end": 2115.0, "text": "Also die haben besonders stark gejammert über Homeoffice."}, {"id": 373, "start": 2115.0, "end": 2119.0, "text": "Also du konntest in der Regel sagen, wenn du von irgendeinem gehört hast,"}, {"id": 374, "start": 2119.0, "end": 2123.0, "text": "oh Homeoffice und soziale Kontakte und oh Homeoffice."}, {"id": 375, "start": 2123.0, "end": 2127.0, "text": "Also du konntest zu 90% sicher sein, wenn einer über Homeoffice gejammert hat,"}, {"id": 376, "start": 2127.0, "end": 2134.0, "text": "dann war das irgendeiner, der eigentlich nichts kann und nur schwätzt."}, {"id": 377, "start": 2134.0, "end": 2136.0, "text": "Alle anderen waren happy."}, {"id": 378, "start": 2136.0, "end": 2139.0, "text": "Die haben zwar nicht zwangsläufig das alles in Anspruch genommen,"}, {"id": 379, "start": 2139.0, "end": 2143.0, "text": "manche haben gesagt, naja so ein Tag die Woche, zwei Tage die Woche und so will ich schon,"}, {"id": 380, "start": 2143.0, "end": 2148.0, "text": "aber es gibt ja welche, die haben komplett immer rumgeheult den ganzen Tag über Homeoffice."}, {"id": 381, "start": 2148.0, "end": 2151.0, "text": "Und das sind in der Regel die, die eigentlich nur schwätzen und nichts machen,"}, {"id": 382, "start": 2151.0, "end": 2155.0, "text": "bzw. wahrscheinlich nichts machen, die machen schon was, aber die können nichts, außer schwätzen."}, {"id": 383, "start": 2155.0, "end": 2161.0, "text": "Wahrscheinlich hatten die das Problem, dass sie quasi ihren gesamten Arbeitsinhalt"}, {"id": 384, "start": 2161.0, "end": 2167.0, "text": "durch dummes Zeug schwätzen, definieren und das halt nicht ging."}, {"id": 385, "start": 2167.0, "end": 2173.0, "text": "Und dass man eben festgestellt hat, gerade dank Homeoffice,"}, {"id": 386, "start": 2173.0, "end": 2177.0, "text": "dass man eigentlich ein Viertel der Leute gar nicht braucht,"}, {"id": 387, "start": 2177.0, "end": 2189.0, "text": "weil ob die da sind oder nicht, macht überhaupt keinen Unterschied."}, {"id": 388, "start": 2189.0, "end": 2192.0, "text": "Deswegen waren glaube ich auch so viele gegen Homeoffice."}, {"id": 389, "start": 2192.0, "end": 2200.0, "text": "Klar, du hattest auch Leute, die haben da wirklich Gründe, die ich nachvollziehen kann."}, {"id": 390, "start": 2200.0, "end": 2205.0, "text": "Also zum Beispiel einer bei uns auf der Arbeit meint, seine Familie, seine Frau, seine Kinder gehen ihm daheim zu sehr auf den Keks,"}, {"id": 391, "start": 2205.0, "end": 2207.0, "text": "weil er will auf die Arbeit fahren."}, {"id": 392, "start": 2207.0, "end": 2210.0, "text": "Okay, kann ich irgendwie nachvollziehen, wenn du da eine Ruhe haben willst?"}, {"id": 393, "start": 2210.0, "end": 2213.0, "text": "Also wir hatten schon öfters mal irgendwelche Kollegen,"}, {"id": 394, "start": 2213.0, "end": 2218.0, "text": "die sind lieber auf die Arbeit gefahren, weil sie Ruhe hatten vor der Familie."}, {"id": 395, "start": 2218.0, "end": 2223.0, "text": "Ganz schlimm war mal einer, da hat immer das Telefon geklingelt und er hat abgenommen"}, {"id": 396, "start": 2223.0, "end": 2226.0, "text": "und du hast die Frau schreien gehört."}, {"id": 397, "start": 2226.0, "end": 2233.0, "text": "Das kann ich mir dran erinnern, hat es geklingelt bei ihm und du musstest eigentlich bloß zwei Sekunden warten"}, {"id": 398, "start": 2233.0, "end": 2238.0, "text": "und du hast irgendwie gehört, Papa, du hast die Kinder im Hintergrund gehört,"}, {"id": 399, "start": 2238.0, "end": 2243.0, "text": "dann hat die Frau im Hintergrund rumgeschrien und eins muss man ihm echt zugute halten,"}, {"id": 400, "start": 2243.0, "end": 2246.0, "text": "der hatte wirklich bei diesen Sachen die Ruhe weg."}, {"id": 401, "start": 2246.0, "end": 2252.0, "text": "Also ihr müsst euch vorstellen, euch brüllen die Kinder im Telefon an, die Frau brüllt euch im Telefon an"}, {"id": 402, "start": 2252.0, "end": 2262.0, "text": "und der Typ hat den Telefonhörer auf halb acht gehangen auf seinem Sitz und hat dann den Telefonhörer am Ohr gehabt"}, {"id": 403, "start": 2262.0, "end": 2272.0, "text": "und wird ihm voll ins Ohr geschrien und dann so, aha, ja, wie sieht das aus mit der Hello Kitty Decke?"}, {"id": 404, "start": 2272.0, "end": 2277.0, "text": "Jetzt gib mir doch mal bitte die Hello Kitty Decke wieder."}, {"id": 405, "start": 2277.0, "end": 2279.0, "text": "Aha, verstehe."}, {"id": 406, "start": 2279.0, "end": 2283.0, "text": "Da war so mega ruhig, ja."}, {"id": 407, "start": 2283.0, "end": 2290.0, "text": "War total entspannt, der hat sich wahrscheinlich gefreut, dass er jetzt auf der Arbeitssitzung nicht daheim ist."}, {"id": 408, "start": 2290.0, "end": 2295.0, "text": "Ich weiß das nur noch, die Kinder haben sich damals um die Hello Kitty Decke gekloppt und solche Dinge"}, {"id": 409, "start": 2295.0, "end": 2299.0, "text": "und die haben dann, musst du dir mal vorstellen, ja, wie bescheuert das eigentlich ist."}, {"id": 410, "start": 2299.0, "end": 2305.0, "text": "Die rufen den Vater auf der Arbeit an, weil sie sich um die Hello Kitty Decke kloppt."}, {"id": 411, "start": 2305.0, "end": 2309.0, "text": "Aber der Typ, der ist geil, der ist super entspannt"}, {"id": 412, "start": 2309.0, "end": 2318.0, "text": "und irgendwann hat er sich eine Kamera installiert, dass er dann daheim spyen konnte, was da gerade abgeht"}, {"id": 413, "start": 2318.0, "end": 2324.0, "text": "und dann hat er dann von der Kamera zugeguckt, der ging eh ab"}, {"id": 414, "start": 2324.0, "end": 2333.0, "text": "und dann hat er den Temperatursensor ins Wohnzimmer gesetzt, weil er gesagt hat, die vergessen immer die Tür zuzumachen"}, {"id": 415, "start": 2333.0, "end": 2340.0, "text": "und dann hat er den ganzen Tag teilweise sich seinen Graf angeguckt von dem Temperatursensor daheim"}, {"id": 416, "start": 2340.0, "end": 2346.0, "text": "und hat dann festgestellt, wenn es wieder ein halbes Grad runtergegangen ist, dass die wieder vergessen haben, die Tür aufzumachen"}, {"id": 417, "start": 2346.0, "end": 2352.0, "text": "und das hat er dann denen, wenn die angerufen haben, immer erzählt, dass sie wieder vergessen haben, die Tür zuzumachen"}, {"id": 418, "start": 2352.0, "end": 2359.0, "text": "Der hat Home Automation gemacht, bevor es Home Automation gab, Alter"}, {"id": 419, "start": 2359.0, "end": 2362.0, "text": "Oh Mann"}, {"id": 420, "start": 2362.0, "end": 2366.0, "text": "Der sparende Boss, ja"}, {"id": 421, "start": 2366.0, "end": 2371.0, "text": "Oh Mann"}, {"id": 422, "start": 2371.0, "end": 2374.0, "text": "Okay, also, lass mal kurz lesen"}, {"id": 423, "start": 2374.0, "end": 2378.0, "text": "Heute war auch wieder gut, haben in der Nacht heute sofort Firewall Updates entstehen"}, {"id": 424, "start": 2378.0, "end": 2381.0, "text": "Oh, um sowas sind wir glücklicherweise ein bisschen rumgekommen"}, {"id": 425, "start": 2381.0, "end": 2384.0, "text": "Dafür haben wir"}, {"id": 426, "start": 2384.0, "end": 2387.0, "text": "Wie heißen diese Dinger?"}, {"id": 427, "start": 2387.0, "end": 2390.0, "text": "Ich überleg gerade"}, {"id": 428, "start": 2390.0, "end": 2395.0, "text": "Palo Alto? Gibt's sowas? Palo Alto Firewall?"}, {"id": 429, "start": 2395.0, "end": 2401.0, "text": "Ja, sowas gibt's, Palo Alto Firewalls, haben wir"}, {"id": 430, "start": 2401.0, "end": 2408.0, "text": "Hab ich zumindest öfters mal vernommen, diesen Namen"}, {"id": 431, "start": 2408.0, "end": 2412.0, "text": "Mach ich aber nichts mit, ist nicht mein, ist nicht mein, ist nicht mein Gebiet"}, {"id": 432, "start": 2412.0, "end": 2416.0, "text": "Okay, heute hatte der eine Kunde VPN-Probleme"}, {"id": 433, "start": 2416.0, "end": 2423.0, "text": "Wir 30 Minuten Probleme suchen, festgestellt, dass der dann eben das Modem aktualisiert, einfach die Firewall und"}, {"id": 434, "start": 2423.0, "end": 2430.0, "text": "Ja wie, ausgehend, Firewall, what? Was ist das denn?"}, {"id": 435, "start": 2430.0, "end": 2433.0, "text": "Übrigens, wusste ihr, was ich gestern wieder machen musste?"}, {"id": 436, "start": 2433.0, "end": 2437.0, "text": "Ich musste wieder mit dem rein englischsprachigen Telekom Techniker"}, {"id": 437, "start": 2437.0, "end": 2444.0, "text": "Ihre komische Telekom Appliance aktualisieren"}, {"id": 438, "start": 2444.0, "end": 2451.0, "text": "Ich bin ja immer ein bisschen shy am Anfang, wenn man Englisch only reden muss, aber das funktioniert tatsächlich, muss ich sagen"}, {"id": 439, "start": 2451.0, "end": 2454.0, "text": "Mittlerweile brauchbar"}, {"id": 440, "start": 2454.0, "end": 2459.0, "text": "Also ich kann mit dem zusammen Update machen und ein bisschen nebenbei schwätzen und es funktioniert alles"}, {"id": 441, "start": 2459.0, "end": 2462.0, "text": "Nein, nicht die Polen, nicht die Polen, nicht die Polen, nein nein"}, {"id": 442, "start": 2462.0, "end": 2466.0, "text": "Das war, wobei, vom Namen her könnte es vielleicht sogar einer gewesen sein"}, {"id": 443, "start": 2466.0, "end": 2471.0, "text": "Ich würde ihn eher so in Tschechien oder so verorten, so vom Namen her"}, {"id": 444, "start": 2471.0, "end": 2474.0, "text": "Aber die Telekom ist da wirklich sehr international aufgestellt"}, {"id": 445, "start": 2474.0, "end": 2479.0, "text": "Also die haben dann einen aus Tschechien, dann haben sie irgendwie einen aus München, dann haben sie einen aus"}, {"id": 446, "start": 2479.0, "end": 2484.0, "text": "Was, Singapur oder Japan irgendwie, der da dort remote arbeitet"}, {"id": 447, "start": 2484.0, "end": 2488.0, "text": "Da muss man sagen, die sind da sehr international"}, {"id": 448, "start": 2488.0, "end": 2494.0, "text": "Bist du Anwendungsentwickler? Nee"}, {"id": 449, "start": 2494.0, "end": 2501.0, "text": "Gelernt habe ich Fachinformatiker System Integration 2007, ist schon ein bisschen her"}, {"id": 450, "start": 2501.0, "end": 2513.0, "text": "Das kann sein, dass es das gewesen ist"}, {"id": 451, "start": 2513.0, "end": 2520.0, "text": "Ja"}, {"id": 452, "start": 2520.0, "end": 2524.0, "text": "Also aktuell ist das Beste, was man machen kann, mehr Gehalt verlangen"}, {"id": 453, "start": 2524.0, "end": 2529.0, "text": "Weil die Leute werden wie verrückt gesucht"}, {"id": 454, "start": 2529.0, "end": 2533.0, "text": "Haut da ruhig mal richtig, richtig rein und sagt denen, dass ihr mehr Geld haben wollt"}, {"id": 455, "start": 2533.0, "end": 2536.0, "text": "Ich meine, das Leben wird nicht billiger"}, {"id": 456, "start": 2536.0, "end": 2542.0, "text": "Das erste, was dann kommt immer ist so nach dem Motto, ah, Inflation und der Firma geht es ja gerade nicht gut"}, {"id": 457, "start": 2542.0, "end": 2543.0, "text": "Das ist ein schlechter Zeitpunkt"}, {"id": 458, "start": 2543.0, "end": 2549.0, "text": "Leute, ich glaube, ihr werdet nie hören, wenn ihr nach Gehaltserhöhung fragt, das ist ein guter Zeitpunkt"}, {"id": 459, "start": 2549.0, "end": 2554.0, "text": "Die Standardantwort ist immer, ah, ganz schlechter Zeitpunkt"}, {"id": 460, "start": 2554.0, "end": 2557.0, "text": "Aber Pech gehabt, für euch ist der Zeitpunkt auch vielleicht schlecht"}, {"id": 461, "start": 2557.0, "end": 2563.0, "text": "Weil ihr jetzt auf einmal 200% mehr Heizrechnungen bezahlen müsst"}, {"id": 462, "start": 2563.0, "end": 2566.0, "text": "Das ist immer, das ist immer, das ist immer gleiche, gleiche Geschwätze"}, {"id": 463, "start": 2566.0, "end": 2591.0, "text": "Darf man sich nicht so sehr davon beirren lassen und muss regelmäßig denen auf den Keks gehen"}, {"id": 464, "start": 2591.0, "end": 2597.0, "text": "Das kann auch sein"}, {"id": 465, "start": 2597.0, "end": 2600.0, "text": "Aber ich hab ja eh schon vor ein paar Jahren aufgehört"}, {"id": 466, "start": 2600.0, "end": 2608.0, "text": "Also spätestens seit ich nur Teilzeit arbeite, aufgehört, ähm, quasi"}, {"id": 467, "start": 2608.0, "end": 2614.0, "text": "So zu denken, als ist die Arbeit quasi mein Hauptlebensinhalt"}, {"id": 468, "start": 2614.0, "end": 2618.0, "text": "Weil ganz ehrlich, das beste, was man machen kann ist"}, {"id": 469, "start": 2618.0, "end": 2621.0, "text": "Möglichst viel Zeit mit dem verbringen, worauf man Bock hat"}, {"id": 470, "start": 2621.0, "end": 2623.0, "text": "Beziehungsweise, das ist vielleicht jetzt blöd ausgedrückt"}, {"id": 471, "start": 2623.0, "end": 2628.0, "text": "Möglichst viel Zeit damit verbringen, was einem wichtig ist"}, {"id": 472, "start": 2628.0, "end": 2630.0, "text": "Es muss ja nicht sein, worauf man Bock hat"}, {"id": 473, "start": 2630.0, "end": 2634.0, "text": "Es kann ja auch zum Beispiel sein, dass man"}, {"id": 474, "start": 2634.0, "end": 2638.0, "text": "Nicht Zeit mit Familie und sonst was verbringt"}, {"id": 475, "start": 2638.0, "end": 2640.0, "text": "Da muss man vielleicht nicht sagen, so unbedingt so nach dem Wort"}, {"id": 476, "start": 2640.0, "end": 2642.0, "text": "Boah, da hab ich jetzt richtig Bock drauf, Zeit mit der Familie zu verbringen"}, {"id": 477, "start": 2642.0, "end": 2646.0, "text": "Aber das ist auch was, wo man sich später vielleicht dran zurückerinnert und sagt"}, {"id": 478, "start": 2646.0, "end": 2651.0, "text": "Ah, war ja gut, dass ich mit dem Opa noch ein bisschen immer im Garten"}, {"id": 479, "start": 2651.0, "end": 2654.0, "text": "Zeug gemacht hab oder so, auch wenn man keinen Bock drauf hat"}, {"id": 480, "start": 2654.0, "end": 2657.0, "text": "Weil niemand, das kann man nicht oft genug sagen"}, {"id": 481, "start": 2657.0, "end": 2663.0, "text": "Niemand, ja gut, außer vielleicht es war die eigene Firma"}, {"id": 482, "start": 2663.0, "end": 2666.0, "text": "Aber ich sag's jetzt trotzdem mal, niemand wird sich denken"}, {"id": 483, "start": 2666.0, "end": 2669.0, "text": "Bevor er den Löffel abgibt, so nach dem Motto, keine Ahnung"}, {"id": 484, "start": 2669.0, "end": 2672.0, "text": "Ihr lauft gerade über den Zebra-Streifen, guckt nach links"}, {"id": 485, "start": 2672.0, "end": 2673.0, "text": "Und der LKW kommt"}, {"id": 486, "start": 2673.0, "end": 2678.0, "text": "Und das letzte, was ihr denkt ist, oh Scheiße, hätte ich mal mehr gearbeitet in meinem Leben"}, {"id": 487, "start": 2678.0, "end": 2681.0, "text": "Ich glaub, das ist das letzte, was ihr denkt"}, {"id": 488, "start": 2681.0, "end": 2684.0, "text": "Also ich glaub, die meisten werden sich denken, oh Scheiße"}, {"id": 489, "start": 2684.0, "end": 2687.0, "text": "Manche werden sich denken, keck bei"}, {"id": 490, "start": 2687.0, "end": 2690.0, "text": "Oder was auch immer, ja"}, {"id": 491, "start": 2690.0, "end": 2704.0, "text": "Aber es wird sich keiner denken, oh hätte ich mal mehr gearbeitet"}, {"id": 492, "start": 2704.0, "end": 2708.0, "text": "Nicht genug gehasselt, genau"}, {"id": 493, "start": 2708.0, "end": 2713.0, "text": "Diesen Dienstag ging's, da war die Bahn halbwegs pünktlich"}, {"id": 494, "start": 2713.0, "end": 2718.0, "text": "Die Ficker waren halbwegs pünktlich, genau"}, {"id": 495, "start": 2718.0, "end": 2722.0, "text": "Das hat mich auch überrascht, ja"}, {"id": 496, "start": 2722.0, "end": 2727.0, "text": "Ich kann euch zum Studium wirklich nichts empfehlen"}, {"id": 497, "start": 2727.0, "end": 2731.0, "text": "Ich habe nicht studiert und ich hab keine Ahnung"}, {"id": 498, "start": 2731.0, "end": 2736.0, "text": "Aber Doktor ist zumindest schon mal cool, weil jeder was mit dem Doktor anfangen kann"}, {"id": 499, "start": 2736.0, "end": 2739.0, "text": "Aber Doktor ist wahrscheinlich auch mit Abstand das Schwierigste"}, {"id": 500, "start": 2739.0, "end": 2748.0, "text": "Kann man Doktor in Informatik werden? Bestimmt, oder?"}, {"id": 501, "start": 2748.0, "end": 2769.0, "text": "Ich glaube, ich hab noch nie einen Doktor in Informatik gesehen"}, {"id": 502, "start": 2769.0, "end": 2776.0, "text": "Bei euch war die Mehrheit gegen Homeoffice"}, {"id": 503, "start": 2776.0, "end": 2778.0, "text": "Das soll die Mehrheit halt kein Homeoffice machen"}, {"id": 504, "start": 2778.0, "end": 2786.0, "text": "Haben sie halt Pech"}, {"id": 505, "start": 2786.0, "end": 2789.0, "text": "Aber es sollen die Leute, die das machen wollen, das trotzdem ermöglichen"}, {"id": 506, "start": 2789.0, "end": 2791.0, "text": "Wen juckts"}, {"id": 507, "start": 2791.0, "end": 2794.0, "text": "Die Mehrheit entscheidet sich auch oftmals für dumme Sachen"}, {"id": 508, "start": 2794.0, "end": 2797.0, "text": "Das heißt ja nicht, dass du das mitmachen musst"}, {"id": 509, "start": 2797.0, "end": 2800.0, "text": "Ich hoffe nicht, dass sie dann sowas sagen wie"}, {"id": 510, "start": 2800.0, "end": 2811.0, "text": "Ich meine, die Mehrheit guckt auch Big Brother oder Deutschland sucht den Superstar oder Let's Dance oder so ein Shit"}, {"id": 511, "start": 2811.0, "end": 2817.0, "text": "Oder was gibt es da sonst noch in letzter Zeit, was richtig dumm ist und viele gucken"}, {"id": 512, "start": 2817.0, "end": 2820.0, "text": "Dschungelcamp und so"}, {"id": 513, "start": 2820.0, "end": 2823.0, "text": "Müll"}, {"id": 514, "start": 2823.0, "end": 2827.0, "text": "Trotzdem ist es nicht gut, auch wenn die Mehrheit das guckt"}, {"id": 515, "start": 2827.0, "end": 2841.0, "text": "Deswegen, ich hoffe, die ermöglichen es trotzdem"}, {"id": 516, "start": 2841.0, "end": 2844.0, "text": "Was für eine Art Büro-Arbeitsplatz hast du eigentlich auf der Arbeit"}, {"id": 517, "start": 2844.0, "end": 2847.0, "text": "Also, ok, das kann ich kurz erzählen"}, {"id": 518, "start": 2847.0, "end": 2852.0, "text": "Also, ich hab den gleichen Stuhl wie daheim"}, {"id": 519, "start": 2852.0, "end": 2859.0, "text": "Ein Sedus Mr.24, Bilder, zack, so ein Ding"}, {"id": 520, "start": 2859.0, "end": 2864.0, "text": "Allerdings, hier daheim hab ich mit dieser Kopfstütze"}, {"id": 521, "start": 2864.0, "end": 2867.0, "text": "Und auf der Arbeit ist es mit dieser Kopfstütze"}, {"id": 522, "start": 2867.0, "end": 2869.0, "text": "Macht jetzt nicht so viel Unterschied"}, {"id": 523, "start": 2869.0, "end": 2875.0, "text": "Also, den Stuhl, einen höhenverstellbaren Schreibtisch"}, {"id": 524, "start": 2875.0, "end": 2883.0, "text": "Ein Curved, frag mich nicht, 32 Zoll, 28 Zoll, was auch immer"}, {"id": 525, "start": 2883.0, "end": 2888.0, "text": "4K-Monitor"}, {"id": 526, "start": 2888.0, "end": 2893.0, "text": "Und ein Notebook, da dran"}, {"id": 527, "start": 2893.0, "end": 2897.0, "text": "Das war's"}, {"id": 528, "start": 2897.0, "end": 2902.0, "text": "Ach ja, und eine eigene Tastatur, eine eigene Maus, die ich mir mitgebracht hab"}, {"id": 529, "start": 2902.0, "end": 2906.0, "text": "Ein Single-Monitor, ja, aber einen Wide-Screen-Curved, 4K-Ding"}, {"id": 530, "start": 2906.0, "end": 2907.0, "text": "Damit komm ich auch klar"}, {"id": 531, "start": 2907.0, "end": 2910.0, "text": "Das ist ja quasi wie zwei kleinere Monitore nebeneinander"}, {"id": 532, "start": 2910.0, "end": 2912.0, "text": "Früher hatte ich zwei, mittlerweile hab ich noch einen"}, {"id": 533, "start": 2912.0, "end": 2915.0, "text": "Auf der Arbeit hab ich eine Logitech, wie heißt das Ding?"}, {"id": 534, "start": 2915.0, "end": 2920.0, "text": "Logitech G Otoys Core"}, {"id": 535, "start": 2920.0, "end": 2923.0, "text": "Also, ich hab eine G502"}, {"id": 536, "start": 2923.0, "end": 2928.0, "text": "Als Maus auf der Arbeit und eine Ducky One Skyline Tastatur"}, {"id": 537, "start": 2928.0, "end": 2931.0, "text": "Mit Numblock, so ein Teil hier"}, {"id": 538, "start": 2931.0, "end": 2936.0, "text": "Mit Numblock, der ist nicht da, nicht das, mit Numblock"}, {"id": 539, "start": 2936.0, "end": 2940.0, "text": "Also, so eine Tastatur und die Maus auf der Arbeit"}, {"id": 540, "start": 2940.0, "end": 2942.0, "text": "Die hab ich mir aber selbst mitgebracht"}, {"id": 541, "start": 2942.0, "end": 2951.0, "text": "Aus dem einfachen Grund, weil ich wahrscheinlich durch jahrelanges Gaming"}, {"id": 542, "start": 2951.0, "end": 2954.0, "text": "Einfach zu verwöhnt bin, was gescheite Input-Geräte angeht"}, {"id": 543, "start": 2954.0, "end": 2957.0, "text": "Und ich mir diesen billigen Tastatur nicht klar gekommen bin"}, {"id": 544, "start": 2957.0, "end": 2962.0, "text": "Das ist wirklich richtig billiger Müll"}, {"id": 545, "start": 2962.0, "end": 2966.0, "text": "Also, ich mag beispielsweise auch keine Low-Profile-Tastaturen"}, {"id": 546, "start": 2966.0, "end": 2968.0, "text": "So was, die kaum Tastenhub haben"}, {"id": 547, "start": 2968.0, "end": 2970.0, "text": "Kann ich nicht haben"}, {"id": 548, "start": 2970.0, "end": 2972.0, "text": "Das Einzige, was ich mit meiner Tastatur gemacht hab, ist"}, {"id": 549, "start": 2972.0, "end": 2977.0, "text": "Also mit dieser Ducky One"}, {"id": 550, "start": 2977.0, "end": 2979.0, "text": "Also, das Einzige, was ich gemacht hab mit der Tastatur"}, {"id": 551, "start": 2979.0, "end": 2982.0, "text": "Ich hab mir Silikonringe gekauft für manche Tasten"}, {"id": 552, "start": 2982.0, "end": 2985.0, "text": "Weil ihr kennt das aus dem Stream und ich weiß nicht, wie gut die..."}, {"id": 553, "start": 2985.0, "end": 2992.0, "text": "Ich hab ja hier RTX Voice quasi für Hintergrundgeräusche noch"}, {"id": 554, "start": 2992.0, "end": 2995.0, "text": "Und ich weiß nicht, wie sehr ihr das tippen"}, {"id": 555, "start": 2995.0, "end": 2999.0, "text": "Und ihr irgendwelche Geräusche überhaupt hört"}, {"id": 556, "start": 2999.0, "end": 3004.0, "text": "Aber ich hab den Hang dazu, manchmal auf gewisse Tasten zu hauen"}, {"id": 557, "start": 3004.0, "end": 3008.0, "text": "Beispielsweise die Enter-Taste auf dem Numblock gehört dazu"}, {"id": 558, "start": 3008.0, "end": 3010.0, "text": "Ich mach das gerne, ich schreib irgendwas im Terminal"}, {"id": 559, "start": 3010.0, "end": 3012.0, "text": "Lese mir das nochmal kurz durch"}, {"id": 560, "start": 3012.0, "end": 3016.0, "text": "Und dann klopp ich wie verrückt auf die Enter-Taste auf dem Numblock"}, {"id": 561, "start": 3016.0, "end": 3019.0, "text": "Fragt mich nicht, warum es die Numblock-Enter-Taste ist"}, {"id": 562, "start": 3019.0, "end": 3023.0, "text": "Und nicht die normale Enter-Taste, die ist viel größer"}, {"id": 563, "start": 3023.0, "end": 3025.0, "text": "Aber ich hau irgendwie gern auf die Numblock-Enter-Taste"}, {"id": 564, "start": 3025.0, "end": 3030.0, "text": "Und ich wollt den Leuten, die um mich drumherum sitzen, auf der Arbeit nicht zu sehr auf den Sack gehen"}, {"id": 565, "start": 3030.0, "end": 3045.0, "text": "Deswegen hab ich da so einen kleinen Silikonring unter der Numblock-Taste, dass die grad so schlimm ist"}, {"id": 566, "start": 3045.0, "end": 3048.0, "text": "Hey Max, kannst du etwas zu einem Job in einem Rechenzentrum sagen?"}, {"id": 567, "start": 3048.0, "end": 3050.0, "text": "Klar, warum nicht?"}, {"id": 568, "start": 3050.0, "end": 3055.0, "text": "Ich hab ja früher selbst zwar keinen Only-Rechenzentrums-Job gehabt"}, {"id": 569, "start": 3055.0, "end": 3057.0, "text": "Aber als ich noch beim Provider gearbeitet hab, früher"}, {"id": 570, "start": 3057.0, "end": 3059.0, "text": "Ich war jeden Tag mehrere Stunden im Rechenzentrum"}, {"id": 571, "start": 3059.0, "end": 3061.0, "text": "Also bitte eine Ahnung davon hab ich auch"}, {"id": 572, "start": 3061.0, "end": 3064.0, "text": "Dauert bei mir zwar noch bis nächstes Jahr, bis ich mit der Schule fertig bin"}, {"id": 573, "start": 3064.0, "end": 3068.0, "text": "Ich habe gesehen, in Frankfurt gibt es auch Rechenzentrums-Unternehmen, die ausbilden"}, {"id": 574, "start": 3068.0, "end": 3073.0, "text": "Nein, in Frankfurt gibt es quasi, wo du hin spuckst, ein Rechenzentrum"}, {"id": 575, "start": 3073.0, "end": 3075.0, "text": "Man sieht es der Sache nicht unbedingt an"}, {"id": 576, "start": 3075.0, "end": 3079.0, "text": "Aber es gibt sehr viele"}, {"id": 577, "start": 3079.0, "end": 3081.0, "text": "Würde ganz gerne was mit der Hardware machen"}, {"id": 578, "start": 3081.0, "end": 3083.0, "text": "Da wäre ich da doch richtig"}, {"id": 579, "start": 3083.0, "end": 3086.0, "text": "Aber es kommt drauf an, ganz ehrlich"}, {"id": 580, "start": 3086.0, "end": 3090.0, "text": "So viel machst du im Rechenzentrum mit Hardware, was du dir vielleicht vorstellst, auch nicht"}, {"id": 581, "start": 3090.0, "end": 3094.0, "text": "Also es ist nicht so, dass du da Rechner zusammen baust"}, {"id": 582, "start": 3094.0, "end": 3098.0, "text": "Du wechselst dort vielleicht mal Festplatten oder sowas"}, {"id": 583, "start": 3098.0, "end": 3101.0, "text": "Oder tauschst mal einen Netzteil aus"}, {"id": 584, "start": 3101.0, "end": 3105.0, "text": "Aber das kann man sich nicht vorstellen wie bei einem Desktop-Rechner"}, {"id": 585, "start": 3105.0, "end": 3112.0, "text": "Sondern du ziehst das raus, klappst es auf"}, {"id": 586, "start": 3112.0, "end": 3117.0, "text": "Und tauschst den RAM-Riegel, machst es wieder zu oder ziehst hinten das Netzteil raus"}, {"id": 587, "start": 3117.0, "end": 3122.0, "text": "Das hat mit Hardware nicht wirklich viel zu tun"}, {"id": 588, "start": 3122.0, "end": 3126.0, "text": "Natürlich macht man was mit Hardware, aber das, was man sich darunter vorstellt, wahrscheinlich eher nicht"}, {"id": 589, "start": 3126.0, "end": 3130.0, "text": "Du wirst relativ viele Kabel patchen"}, {"id": 590, "start": 3130.0, "end": 3134.0, "text": "Also nicht selber krimpen oder sowas, das macht eigentlich kaum noch einer"}, {"id": 591, "start": 3134.0, "end": 3136.0, "text": "Du wirst jede Menge Kabel patchen"}, {"id": 592, "start": 3136.0, "end": 3139.0, "text": "Du wirst das Ganze überwachen"}, {"id": 593, "start": 3139.0, "end": 3147.0, "text": "Und dich wahrscheinlich auch um Sachen kümmern, die auf den Servern laufen"}, {"id": 594, "start": 3147.0, "end": 3149.0, "text": "Weil so reines Rechenzentrum ist langweilig"}, {"id": 595, "start": 3149.0, "end": 3151.0, "text": "Was willst du da großartig machen?"}, {"id": 596, "start": 3151.0, "end": 3154.0, "text": "Kannst du nicht den ganzen Tag Server einbauen"}, {"id": 597, "start": 3154.0, "end": 3169.0, "text": "Oder Kabel patchen"}, {"id": 598, "start": 3184.0, "end": 3189.0, "text": "Ah, ich bin nicht eingeloggt"}, {"id": 599, "start": 3189.0, "end": 3193.0, "text": "Und hat Spaß gemacht"}, {"id": 600, "start": 3193.0, "end": 3200.0, "text": "Ja, das war geil"}, {"id": 601, "start": 3200.0, "end": 3204.0, "text": "Das war geil, wo der Typ seinen USB-Stick in den Fahrstuhl geschmissen hat"}, {"id": 602, "start": 3204.0, "end": 3207.0, "text": "Und nicht nur, der hat nicht nur seinen USB-Stick in den Fahrstuhl geschmissen"}, {"id": 603, "start": 3207.0, "end": 3212.0, "text": "Der ist in den Fahrstuhlschacht gefallen und unten in diese Ölwanne rein"}, {"id": 604, "start": 3212.0, "end": 3216.0, "text": "Nein, nein, du sollst sie nicht bannen, Quatsch"}, {"id": 605, "start": 3216.0, "end": 3226.0, "text": "Das ist alles blödes Gelaber"}, {"id": 606, "start": 3226.0, "end": 3228.0, "text": "Das ist die Taktik"}, {"id": 607, "start": 3228.0, "end": 3232.0, "text": "Also das ist alles Taktik"}, {"id": 608, "start": 3232.0, "end": 3237.0, "text": "Das ist alles Taktik, dass du nicht mehr fragst"}, {"id": 609, "start": 3237.0, "end": 3244.0, "text": "Man gibt sich ja mit sowas zufrieden und du hörst nie wieder was von"}, {"id": 610, "start": 3244.0, "end": 3249.0, "text": "Das ist okay, das kann dein Chef wahrscheinlich wirklich nicht entscheiden"}, {"id": 611, "start": 3249.0, "end": 3252.0, "text": "Aber dein Chef kann eine Empfehlung aussprechen"}, {"id": 612, "start": 3252.0, "end": 3257.0, "text": "Die dann, je nachdem wie gut er das macht"}, {"id": 613, "start": 3257.0, "end": 3262.0, "text": "Meistens auch abgelickt wird"}, {"id": 614, "start": 3262.0, "end": 3265.0, "text": "Und dieses mit ich gebe das weiter und ich kann das nicht entscheiden"}, {"id": 615, "start": 3265.0, "end": 3267.0, "text": "Er kann das nicht entscheiden"}, {"id": 616, "start": 3267.0, "end": 3270.0, "text": "Aber da musst du das nach oben hin verkaufen, so wie du das ihm verkauft hast"}, {"id": 617, "start": 3270.0, "end": 3273.0, "text": "Das ist sein Job, dafür ist er da"}, {"id": 618, "start": 3273.0, "end": 3275.0, "text": "Das kann man ja nicht oft genug sagen"}, {"id": 619, "start": 3275.0, "end": 3279.0, "text": "Man muss sich ein bisschen von diesem Gedanken davon verabschieden"}, {"id": 620, "start": 3279.0, "end": 3283.0, "text": "So nach dem Motto"}, {"id": 621, "start": 3283.0, "end": 3285.0, "text": "Wie sag ich das jetzt"}, {"id": 622, "start": 3285.0, "end": 3291.0, "text": "Der Chef ist irgendwie so ein höheres Wesen"}, {"id": 623, "start": 3291.0, "end": 3297.0, "text": "Der hat einen Job zu machen an dieser Position"}, {"id": 624, "start": 3297.0, "end": 3300.0, "text": "Es gibt einen Grund, wozu die da sind"}, {"id": 625, "start": 3300.0, "end": 3306.0, "text": "Das ist unter anderem Planung, Koordination, vielleicht Aufgabenverteilung"}, {"id": 626, "start": 3306.0, "end": 3309.0, "text": "Es ist aber auch ein ganz wichtiger Punkt"}, {"id": 627, "start": 3309.0, "end": 3313.0, "text": "Das jeweilige Team nach außen hin gut darzustellen"}, {"id": 628, "start": 3313.0, "end": 3316.0, "text": "Dafür ist der Teamleiter bzw. der Chef da"}, {"id": 629, "start": 3316.0, "end": 3321.0, "text": "Und die Interessen des Teams auch vertreten zu seinen Chefs und weiter"}, {"id": 630, "start": 3321.0, "end": 3325.0, "text": "Wenn er das nicht macht, ist er ein scheiß Chef, ganz einfach"}, {"id": 631, "start": 3325.0, "end": 3329.0, "text": "Das muss man sich immer mal überlegen"}, {"id": 632, "start": 3329.0, "end": 3336.0, "text": "Diese Position ist nicht dafür da, nur um zu nehmen"}, {"id": 633, "start": 3336.0, "end": 3339.0, "text": "Diese Position muss auch was bieten"}, {"id": 634, "start": 3339.0, "end": 3346.0, "text": "Zumindest wenn die wollen, dass man dahinter steht"}, {"id": 635, "start": 3346.0, "end": 3353.0, "text": "Und der muss das ordentlich verkaufen"}, {"id": 636, "start": 3353.0, "end": 3355.0, "text": "Dafür ist er da"}, {"id": 637, "start": 3355.0, "end": 3359.0, "text": "Und gute Führungskräfte machen das auch"}, {"id": 638, "start": 3359.0, "end": 3362.0, "text": "Es gibt leider viele schlechte Führungskräfte"}, {"id": 639, "start": 3362.0, "end": 3371.0, "text": "Die das wahrscheinlich nur aus Prestig-Gründen anstreben, dass sie das auf den Lebenslauf schreiben können"}, {"id": 640, "start": 3371.0, "end": 3376.0, "text": "Aber das klappt dann meistens nicht"}, {"id": 641, "start": 3376.0, "end": 3379.0, "text": "Das läuft dann auch meistens nicht"}, {"id": 642, "start": 3379.0, "end": 3385.0, "text": "Und man muss auch sehen, gerade so unteres Management ist eine wirklich kacke Aufgabe"}, {"id": 643, "start": 3385.0, "end": 3387.0, "text": "Die ich im Leben nicht machen möchte"}, {"id": 644, "start": 3387.0, "end": 3393.0, "text": "Wenn du Teamleiter bist oder Gruppenleiter und untere Management-Ebene"}, {"id": 645, "start": 3393.0, "end": 3400.0, "text": "Du kriegst permanent von deinen Leuten vorgejammert, wie schlimm alles ist"}, {"id": 646, "start": 3400.0, "end": 3406.0, "text": "Und du kriegst Anschiss von den Leuten über dir"}, {"id": 647, "start": 3406.0, "end": 3409.0, "text": "Wie schlecht es doch läuft"}, {"id": 648, "start": 3409.0, "end": 3416.0, "text": "Und du kriegst quasi Anschiss von beiden Seiten permanent"}, {"id": 649, "start": 3416.0, "end": 3420.0, "text": "Also das ist wirklich eine Position, die möchte ich nicht machen"}, {"id": 650, "start": 3420.0, "end": 3424.0, "text": "Sie müssten mir sehr viel Geld bezahlen, dass ich auch nur daran denken würde, das zu machen"}, {"id": 651, "start": 3424.0, "end": 3431.0, "text": "Und mit sehr viel Geld meine ich wirklich so viel Geld, dass ich das 1-2 Jahre machen müsste und danach kündigen könnte"}, {"id": 652, "start": 3431.0, "end": 3432.0, "text": "Für immer"}, {"id": 653, "start": 3432.0, "end": 3434.0, "text": "Und so viel werde ich mir dafür nicht bezahlen"}, {"id": 654, "start": 3434.0, "end": 3436.0, "text": "Ich würde das im Leben nicht machen"}, {"id": 655, "start": 3436.0, "end": 3439.0, "text": "Das ist genauso wie ich nie im Leben Lehrer werden würde oder sowas freiwillig"}, {"id": 656, "start": 3439.0, "end": 3444.0, "text": "Und das ist halt eine kacke Position"}, {"id": 657, "start": 3444.0, "end": 3450.0, "text": "Das unterscheidet sich natürlich auch ein bisschen nach Firma und Kultur"}, {"id": 658, "start": 3450.0, "end": 3457.0, "text": "Bei uns in der Bank ist das halt komplettes Boomer-Management von oben bis Mitte"}, {"id": 659, "start": 3457.0, "end": 3458.0, "text": "Kannst du komplett knicken"}, {"id": 660, "start": 3458.0, "end": 3460.0, "text": "Ein paar mittlerweile sind jetzt schon ein bisschen jünger"}, {"id": 661, "start": 3460.0, "end": 3464.0, "text": "Und machen auch durchaus Sachen, wo ich sagen würde, da hat sich ja mal einer Gedanken gemacht"}, {"id": 662, "start": 3464.0, "end": 3482.0, "text": "Aber das meiste kannst du da nicht nachvollziehen"}, {"id": 663, "start": 3482.0, "end": 3486.0, "text": "Ja, da muss ich sagen, also meine Chefs, die ich bisher hatte"}, {"id": 664, "start": 3486.0, "end": 3495.0, "text": "Sagen wir mal, mein letzter Chef, der hat sich da Mühe gegeben, der konnte an vielen Stellen glaube ich auch nicht so viel bewirken, wie er wollte"}, {"id": 665, "start": 3495.0, "end": 3497.0, "text": "Aber er hat es wenigstens probiert"}, {"id": 666, "start": 3497.0, "end": 3500.0, "text": "Hat ja auch mit mehr Geld ein paar Mal geklappt"}, {"id": 667, "start": 3500.0, "end": 3506.0, "text": "Mein aktueller Chef, den schätze ich auch in dieser Richtung ein, wobei den habe ich noch nicht so lange"}, {"id": 668, "start": 3506.0, "end": 3509.0, "text": "Den davor konntest du komplett knicken"}, {"id": 669, "start": 3509.0, "end": 3511.0, "text": "Den davor konntest du auch komplett knicken"}, {"id": 670, "start": 3511.0, "end": 3515.0, "text": "Und den beim Provider konntest du auch komplett knicken"}, {"id": 671, "start": 3515.0, "end": 3524.0, "text": "Also ich hatte jetzt keine Ahnung, die Jahre über 7-8 verschiedene Chefs und 2 davon haben was getaugt"}, {"id": 672, "start": 3524.0, "end": 3535.0, "text": "Gar nicht so einfach da was zu finden"}, {"id": 673, "start": 3535.0, "end": 3546.0, "text": "Das ZDF hat Quiet Quitting total falsch verstanden"}, {"id": 674, "start": 3546.0, "end": 3549.0, "text": "Haben sie?"}, {"id": 675, "start": 3549.0, "end": 3554.0, "text": "Da geht es ja im Prinzip darum, dass man sich nicht kaputt schafft"}, {"id": 676, "start": 3554.0, "end": 3575.0, "text": "Was eines der besten Trends der letzten Jahre ist, dass die Leute mal erkannt haben, dass der Arbeitsvertrag nicht nur für die andere Seite quasi gilt"}, {"id": 677, "start": 3575.0, "end": 3577.0, "text": "Sondern für die andere Seite auch"}, {"id": 678, "start": 3577.0, "end": 3586.0, "text": "Und wenn da drinnen steht, du machst das und das oder bist da und dafür eingestellt, dann kommen die mit was anderem und wollen, dass du nachts was machst, da steht nix von Nachtarbeit drin"}, {"id": 679, "start": 3586.0, "end": 3588.0, "text": "Dann machst du keine Nachtarbeit"}, {"id": 680, "start": 3588.0, "end": 3590.0, "text": "Man kann das übrigens alles machen"}, {"id": 681, "start": 3590.0, "end": 3596.0, "text": "Ich würde abraten davon zu sagen prinzipiell direkt von Anfang an, ach hört mir auf mit dem Scheiß, mach ich nicht"}, {"id": 682, "start": 3596.0, "end": 3600.0, "text": "Das muss ein bisschen beidseitig sein, also sagen wir mal so"}, {"id": 683, "start": 3600.0, "end": 3610.0, "text": "Wenn ihr gefragt werdet so nach dem Motto hier wir müssen Wartungsarbeiten machen und wir hätten gerne ein Techniker dabei, kann das 23 Uhr einer von euch machen"}, {"id": 684, "start": 3610.0, "end": 3615.0, "text": "Da würde ich prinzipiell auch schon ab und zu mal sagen, ja klar, warum nicht"}, {"id": 685, "start": 3615.0, "end": 3625.0, "text": "Wenn dann im Gegenzug aber, wenn ich das nächste Mal sag, Mist Leute, ich hab vergessen, dass, was weiß ich, meine Oma Geburtstag hat"}, {"id": 686, "start": 3625.0, "end": 3632.0, "text": "Und ich muss hier mal ein bisschen früher weg oder an dem Tag kann ich nicht oder was auch immer, ist egal was"}, {"id": 687, "start": 3632.0, "end": 3637.0, "text": "Oder ach ich hab zwar Urlaub beantragt erst ab 2. aber ich will schon im ersten losfliegen"}, {"id": 688, "start": 3637.0, "end": 3644.0, "text": "Und wenn man dann da auch sagt, ist ok, machen wir, tragen wir ein, passt schon, dann ist das ok"}, {"id": 689, "start": 3644.0, "end": 3654.0, "text": "Wenn es natürlich immer nur andersrum läuft so nach dem Motto, wir wollen was von euch und man suggeriert den Leuten dann auch immer unterschwellig"}, {"id": 690, "start": 3654.0, "end": 3660.0, "text": "So nach dem Motto, da kannst du doch nicht nein sagen, boah das ging mir bei meinem vorvorletzten Chef mega auf den Sack"}, {"id": 691, "start": 3660.0, "end": 3662.0, "text": "Das ist so einer und das probiert er heute immer noch"}, {"id": 692, "start": 3662.0, "end": 3669.0, "text": "Der hat ja immer erzählt so nach dem Motto, da kann man doch jetzt nicht absagen oder kann man doch nicht nein sagen, doch kann man, warum nicht"}, {"id": 693, "start": 3669.0, "end": 3684.0, "text": "Wenn das nicht im Gleichgewicht ist, dass das was man quasi mehr macht über das hinaus quasi nicht ja entsprechend gewürdigt wird"}, {"id": 694, "start": 3684.0, "end": 3690.0, "text": "Mit dass einem beispielsweise mal in anderen Situationen entgegengekommen wird"}, {"id": 695, "start": 3690.0, "end": 3698.0, "text": "Wie auch immer geartet ja, man muss halt selbst das Gefühl auch haben, ja ok, das ist ausgeglichen"}, {"id": 696, "start": 3698.0, "end": 3704.0, "text": "Ich mach mal hier was mehr, aber dafür wird an anderer Stelle auch mal ein Auge zugedrückt, dann ist das vollkommen ok"}, {"id": 697, "start": 3704.0, "end": 3732.0, "text": "Ansonsten klar kann man das sagen"}, {"id": 698, "start": 3732.0, "end": 3740.0, "text": "Wir hatten auch mal einen Doktor in der IT bei uns"}, {"id": 699, "start": 3740.0, "end": 3746.0, "text": "Allerdings war da kein Doktor in IT, sondern Archäologe"}, {"id": 700, "start": 3746.0, "end": 3751.0, "text": "Kein Witz, ich weiß bis heute nicht wie der Typ dahin gekommen ist"}, {"id": 701, "start": 3751.0, "end": 3764.0, "text": "Das wusste er erstmal schaffen von Archäologie zu irgendwelchen IT Geschichten"}, {"id": 702, "start": 3764.0, "end": 3773.0, "text": "Das war aber wirklich nicht das Richtige für ihn, der ist da halb verzweifelt"}, {"id": 703, "start": 3773.0, "end": 3779.0, "text": "Klar, wer macht das heute nicht"}, {"id": 704, "start": 3779.0, "end": 3799.0, "text": "So ein richtiges Grindr Game fehlt mir allerdings zur Zeit"}, {"id": 705, "start": 3799.0, "end": 3804.0, "text": "Ich finde Meetings über Teams auch viel angenehmer als in echt"}, {"id": 706, "start": 3804.0, "end": 3814.0, "text": "Gerade mit Screen Sharing, so nach dem Motto ach warte mal ich zeige euch nochmal schnell was"}, {"id": 707, "start": 3814.0, "end": 3819.0, "text": "Bald, bald, aber nicht im Arbeitsrechner, in meinem neuen Rechner"}, {"id": 708, "start": 3819.0, "end": 3823.0, "text": "Chat was sagt ihr, NumBlock ja oder ne"}, {"id": 709, "start": 3823.0, "end": 3832.0, "text": "Ich persönlich will keine Tastatur ohne NumBlock"}, {"id": 710, "start": 3832.0, "end": 3837.0, "text": "NumBlock muss, 60% beste"}, {"id": 711, "start": 3837.0, "end": 3844.0, "text": "Also ich würde jetzt sagen die meisten stehen auf NumBlock, aber ein paar nicht"}, {"id": 712, "start": 3844.0, "end": 3849.0, "text": "Zum Spielen braucht man das nicht, aber nachdem ich die gleiche Tastatur zum Spielen wie zum Arbeiten verwende hier"}, {"id": 713, "start": 3849.0, "end": 3860.0, "text": "NumBlock"}, {"id": 714, "start": 3860.0, "end": 3864.0, "text": "Hast du deine Vice Campan draußen hängen oder ist die diese in der Wohnung"}, {"id": 715, "start": 3864.0, "end": 3871.0, "text": "Ich hatte eine draußen und ich habe mir so ein Silikon Gehäuse damals gekauft dafür"}, {"id": 716, "start": 3871.0, "end": 3879.0, "text": "Aber die ist immer wieder kaputt gegangen, mittlerweile ist die so kaputt, dass der Micro SD Karten Slot gar nicht mehr funktioniert"}, {"id": 717, "start": 3879.0, "end": 3886.0, "text": "Die ist für außen nicht zu gebrauchen"}, {"id": 718, "start": 3886.0, "end": 3890.0, "text": "So muss das sein, so muss das sein"}, {"id": 719, "start": 3890.0, "end": 3901.0, "text": "Hups jetzt bin ich gerade mit den Stuhlen übers Kabel gefahren, fuck"}, {"id": 720, "start": 3901.0, "end": 3910.0, "text": "Warum, warum erschreibt man irgendwas in C++ für seine Abschlussarbeit, will man sich da irgendwie quälen oder was ist da dahinter Kunde"}, {"id": 721, "start": 3910.0, "end": 3923.0, "text": "Chizipo, Massive Subscriptions Dankeschön"}, {"id": 722, "start": 3923.0, "end": 3941.0, "text": "NumBlock"}, {"id": 723, "start": 3941.0, "end": 3949.0, "text": "Ist schon ein bisschen was dran ja"}, {"id": 724, "start": 3949.0, "end": 3956.0, "text": "Na gut, also es gibt einen Punkt wo ich finde wo man universell"}, {"id": 725, "start": 3956.0, "end": 3965.0, "text": "Naja, wo man aber schon ganz gut abschätzen kann ob man eine gescheite Führungskraft hat oder nicht"}, {"id": 726, "start": 3965.0, "end": 3968.0, "text": "Ich meine das ist nicht ein Bewerbungsgespräch wenn man schon da ist"}, {"id": 727, "start": 3968.0, "end": 3979.0, "text": "Und zwar sind die daran interessiert das was man macht gut zu verkaufen"}, {"id": 728, "start": 3979.0, "end": 3991.0, "text": "Also sprich geht es nicht nur darum ist das rechtzeitig fertig und wenn nicht dann wird sich beschwert oder was ist hier los oder kannst du nicht noch zusätzlich machen oder sonst was"}, {"id": 729, "start": 3991.0, "end": 4001.0, "text": "Sondern wirklich was man macht dass man merkt dass quasi das Interesse besteht dass die Arbeit die das eigene Team macht"}, {"id": 730, "start": 4001.0, "end": 4013.0, "text": "Dass man versucht das gut zu verkaufen und wenn das passiert ist schon mal ein ziemlich großer Hinweis für dass die Führungskraft sich zumindest Mühe gibt und sie wahrscheinlich was taugt"}, {"id": 731, "start": 4013.0, "end": 4023.0, "text": "Natürlich gibt es noch viele andere Punkte aber wenn das probiert wird und nicht nur so nach dem Motto das alles quasi verkaufen dass man jetzt selbst das verantwortet hat"}, {"id": 732, "start": 4023.0, "end": 4029.0, "text": "So nach dem Motto haha ohne mich wäre dieses Team kacke und nur wegen mir läuft es so gut und alles ist nur geil"}, {"id": 733, "start": 4029.0, "end": 4036.0, "text": "Das mag der vielleicht für seine eigene nächste Gehaltsforderung gut sein wobei ihm das sein Chef wahrscheinlich auch nicht abkauft"}, {"id": 734, "start": 4036.0, "end": 4045.0, "text": "Aber wenn du einen Chef hast der beispielsweise wenn du dem erzählt hast gibt es ja meistens monatliche wöchentliche was auch immer"}, {"id": 735, "start": 4045.0, "end": 4049.0, "text": "Gibt es mal irgendwelche Termine wo man sich dann drüber ein bisschen auskotzen kann was gut läuft was nicht gut läuft"}, {"id": 736, "start": 4049.0, "end": 4061.0, "text": "Und wenn er dann Interesse dran hat so nach dem Motto kannst du mir die und die Punkte noch mal erklären dann erzähle ich da was zu in der nächsten übergreifenden Bereichsrunde oder sowas"}, {"id": 737, "start": 4061.0, "end": 4068.0, "text": "Wenn man sowas hört ist das meistens schon mal ein gutes Zeichen für das der was taugt weil dann will der nicht erzählen so nach dem Motto"}, {"id": 738, "start": 4068.0, "end": 4074.0, "text": "Ich bin der geilste und mein Team sind die geilsten weil ich der geilste bin sondern dann erzählt er so nach dem Motto"}, {"id": 739, "start": 4074.0, "end": 4083.0, "text": "Ja wir haben jetzt die und die Themen bearbeitet und dann erwähnt er auch eure Namen ab und zu machen ist einfach daran interessiert das was das Team macht gut zu verkaufen"}, {"id": 740, "start": 4083.0, "end": 4093.0, "text": "Und das ist schon mal echt ein Pluspunkt wenn man jemand hat der das macht weil letztendlich weil ganz im Ernst wenn ihr zu eurem Chef geht und sagt ihr wollt mehr Geld haben"}, {"id": 741, "start": 4093.0, "end": 4111.0, "text": "Dann ist es sein Job das ordentlich zu verkaufen und das geht natürlich besonders gut wenn derjenige der mehr Geld haben will irgendwie im Vorfeld schon mal öfters gut positiv aufgefallen ist"}, {"id": 742, "start": 4111.0, "end": 4120.0, "text": "Und das einfachste positive aufzufallen ist wenn euer Chef ab und zu mal euer Namen einwirft bei Sachen die gut laufen"}, {"id": 743, "start": 4120.0, "end": 4126.0, "text": "Beziehungsweise da auch ab und zu mal Sachen vorstellt dann auch was da wieder cooles gemacht wurde"}, {"id": 744, "start": 4126.0, "end": 4136.0, "text": "Man kann sich da bis zu einem gewissen Grad natürlich selbst darum kümmern es gibt Leute die machen nichts anderes als den ganzen Tag den Karriere grind"}, {"id": 745, "start": 4136.0, "end": 4142.0, "text": "Und gammeln auf irgendwelchen Meetings rum und erzählen und loben sich aber das ist auch irgendwie bescheuert"}, {"id": 746, "start": 4142.0, "end": 4145.0, "text": "Weil dafür ist euer Chef unter anderem da oder sollte er da sein"}, {"id": 747, "start": 4145.0, "end": 4153.0, "text": "Was ich manchmal ganz gerne mache ist ich lasse uns zu irgendwelchen übergreifenden Runden einladen wo wir dann mal irgendwas erzählen"}, {"id": 748, "start": 4153.0, "end": 4167.0, "text": "Zum Beispiel wir haben demnächst jetzt Jubiläum Versionsnummer Jubiläum Version 100 von einer Sache kann ich jetzt nicht so im Detail erzählen"}, {"id": 749, "start": 4167.0, "end": 4173.0, "text": "Und da werden wir im November auch ein bisschen was größeres zu erzählen einfach dass das mal alle mitkriegen"}, {"id": 750, "start": 4173.0, "end": 4187.0, "text": "Also es ist so doof sich anhört wenn ihr die Chance habt 80% gute Arbeit zu machen und 20% das der Welt mitzuteilen ist das besser als 100% gute Arbeit zu machen"}, {"id": 751, "start": 4187.0, "end": 4196.0, "text": "Also von der Zeit her ja wenn ihr 80% gute Arbeit macht und 20% da noch Nutzt darüber zu erzählen"}, {"id": 752, "start": 4196.0, "end": 4203.0, "text": "Ist besser als quasi alles geil zu machen und nie erfährt jemand was von euch"}, {"id": 753, "start": 4203.0, "end": 4209.0, "text": "Es gibt aber so Leute und deswegen ist es halt wichtig dass man eine Führungskraft hat die das auch mit übernimmt"}, {"id": 754, "start": 4209.0, "end": 4216.0, "text": "Am besten ist natürlich wenn man das zusammen macht und dann ab und zu selbst auch noch mal ein bisschen was zum besten gibt"}, {"id": 755, "start": 4216.0, "end": 4224.0, "text": "Wie groß ist dein Team? Ich glaube 14 Leute"}, {"id": 756, "start": 4224.0, "end": 4237.0, "text": "Keiner will Lehrer sein"}, {"id": 757, "start": 4237.0, "end": 4244.0, "text": "Also mein BWL Lehrer in der Berufsschule der hat World of Warcraft Forum gelesen damals"}, {"id": 758, "start": 4244.0, "end": 4257.0, "text": "Während wir was gemacht haben"}, {"id": 759, "start": 4257.0, "end": 4270.0, "text": "Kennst du den und wenn ja was Moment kann ich chat kann ich das anklicken ohne dass da jetzt sonst was kommt"}, {"id": 760, "start": 4270.0, "end": 4276.0, "text": "Ich habe keine Ahnung wer das ist kenne ich nicht"}, {"id": 761, "start": 4276.0, "end": 4283.0, "text": "Aber das sieht mir auf den ersten Blick vielleicht tue ich ihm jetzt auch unrecht nach"}, {"id": 762, "start": 4283.0, "end": 4290.0, "text": "Konsultant im Anzug der gut erzählen kann aus"}, {"id": 763, "start": 4290.0, "end": 4300.0, "text": "Aber ich kenne ihn nicht keine Ahnung also ich weiß nicht"}, {"id": 764, "start": 4300.0, "end": 4307.0, "text": "Also es ist jetzt nichts was ich mir regelmäßig angucken würde wahrscheinlich"}, {"id": 765, "start": 4307.0, "end": 4314.0, "text": "Sieht nach Scam aus echt warum ich habe sie jetzt nicht so genau angeguckt"}, {"id": 766, "start": 4314.0, "end": 4318.0, "text": "Du musst dich verkaufen können da hat er recht"}, {"id": 767, "start": 4318.0, "end": 4326.0, "text": "Zweites vorstellen Job Angebot"}, {"id": 768, "start": 4326.0, "end": 4332.0, "text": "Na ja wieso warum sollte das Scam sein"}, {"id": 769, "start": 4332.0, "end": 4335.0, "text": "Das sieht doch"}, {"id": 770, "start": 4335.0, "end": 4339.0, "text": "Also von den Themen her sieht das doch okay aus"}, {"id": 771, "start": 4339.0, "end": 4342.0, "text": "Schneeball"}, {"id": 772, "start": 4342.0, "end": 4347.0, "text": "Ich kann da weder Scam noch ein Schneeball System erkennen"}, {"id": 773, "start": 4347.0, "end": 4353.0, "text": "Erzählt über irgendwelche Bewerbungsverfahren und Vorstellungsgespräche und sonst was"}, {"id": 774, "start": 4353.0, "end": 4356.0, "text": "Was hat das jetzt mit Schneeball System und mit"}, {"id": 775, "start": 4356.0, "end": 4361.0, "text": "Sonst wie zu tun"}, {"id": 776, "start": 4361.0, "end": 4365.0, "text": "Ach vom Style her einfach keine Ahnung kann ich nichts zu sagen"}, {"id": 777, "start": 4365.0, "end": 4371.0, "text": "Mich hatte das Bild im Anzug schon abgeschreckt weil ich habe halt genug so Typen äh ähnliche Typen vom"}, {"id": 778, "start": 4371.0, "end": 4376.0, "text": "Von der Optik her schon gesehen und das war halt meistens immer ganz viel ganz viel heiße Luft"}, {"id": 779, "start": 4376.0, "end": 4380.0, "text": "Zu ihm persönlich kann ich nichts sagen ich kenne die Videos nicht und es kann auch sein"}, {"id": 780, "start": 4380.0, "end": 4383.0, "text": "Dass der erste Eindruck täuscht und der Content tatsächlich was taugt"}, {"id": 781, "start": 4383.0, "end": 4398.0, "text": "Ich weiß es nicht"}, {"id": 782, "start": 4398.0, "end": 4400.0, "text": "Ok das ZDF sagt"}, {"id": 783, "start": 4400.0, "end": 4405.0, "text": "Das Quiet quitting ist wenn du zu wenig Überstunden machst und nur das Mindeste erfüllst"}, {"id": 784, "start": 4405.0, "end": 4407.0, "text": "Wie zu wenig Überstunden"}, {"id": 785, "start": 4407.0, "end": 4410.0, "text": "Es gibt nicht zu wenig Überstunden"}, {"id": 786, "start": 4410.0, "end": 4411.0, "text": "Was soll"}, {"id": 787, "start": 4411.0, "end": 4421.0, "text": "Was zum Teufel soll zu wenig Überstunden sein"}, {"id": 788, "start": 4421.0, "end": 4429.0, "text": "Also diese Wort Kombination ergibt da schon keinen Sinn"}, {"id": 789, "start": 4429.0, "end": 4438.0, "text": "Der Normalfall sollte eigentlich sein dass du keine Überstunden machen musst"}, {"id": 790, "start": 4438.0, "end": 4441.0, "text": "Dann hast du innerlich aufgegeben"}, {"id": 791, "start": 4441.0, "end": 4445.0, "text": "Naja also man es ist die Frage wie man das"}, {"id": 792, "start": 4445.0, "end": 4453.0, "text": "Wie man das das klingt jetzt sehr negativ formuliert vom ZDF wenn die das so geschrieben haben"}, {"id": 793, "start": 4453.0, "end": 4455.0, "text": "Man muss aber mal"}, {"id": 794, "start": 4455.0, "end": 4461.0, "text": "Es nüchterner betrachten du machst das was du unterschrieben hast"}, {"id": 795, "start": 4461.0, "end": 4466.0, "text": "Und du machst das wofür du bezahlt wirst"}, {"id": 796, "start": 4466.0, "end": 4469.0, "text": "Die eigentliche Frage die man sich stellen sollte ist"}, {"id": 797, "start": 4469.0, "end": 4474.0, "text": "Warum sollte man dann eigentlich mehr machen als das was man unterschrieben hat"}, {"id": 798, "start": 4474.0, "end": 4476.0, "text": "Und das wofür man bezahlt wird"}, {"id": 799, "start": 4476.0, "end": 4485.0, "text": "Eine der Hauptgründe warum das so ist"}, {"id": 800, "start": 4485.0, "end": 4488.0, "text": "Ist bei Leuten die halt den Karrieregrind machen wollen"}, {"id": 801, "start": 4488.0, "end": 4494.0, "text": "Die halt Ambitionen haben sich da irgendwie hoch zu arbeiten"}, {"id": 802, "start": 4494.0, "end": 4497.0, "text": "In welcher Form auch immer"}, {"id": 803, "start": 4497.0, "end": 4500.0, "text": "Gut die können das ja machen"}, {"id": 804, "start": 4500.0, "end": 4503.0, "text": "Aber das heißt ja noch lang nicht dass das"}, {"id": 805, "start": 4503.0, "end": 4510.0, "text": "Für jeden der Normalzustand sein sollte"}, {"id": 806, "start": 4510.0, "end": 4515.0, "text": "Doch doch damit ist definitiv welchen geholfen"}, {"id": 807, "start": 4515.0, "end": 4519.0, "text": "Nämlich allen die keine Überstunden mehr machen und das machen wofür sie bezahlt werden"}, {"id": 808, "start": 4519.0, "end": 4530.0, "text": "Alternativ wenn sie mehr machen sollen kann man ihnen ja auch mehr bezahlen beziehungsweise weitere Aufgabengebiete geben"}, {"id": 809, "start": 4530.0, "end": 4534.0, "text": "Was dann neue Aufgabengebiete was natürlich auch"}, {"id": 810, "start": 4534.0, "end": 4539.0, "text": "Perspektivisch dann mit mehr Gehalt einhergehen sollte logischerweise"}, {"id": 811, "start": 4539.0, "end": 4541.0, "text": "Damit ist dann beiden geholfen ja"}, {"id": 812, "start": 4541.0, "end": 4545.0, "text": "Aber damit ist selbstverständlich wenn jemand sagt ey"}, {"id": 813, "start": 4545.0, "end": 4553.0, "text": "Leute ich mach das wofür ich bezahlt werde das ist doch nicht negativ das sollte eigentlich der Normalzustand sein"}, {"id": 814, "start": 4553.0, "end": 4556.0, "text": "Ich weiß viel ist das im Kopf nicht so"}, {"id": 815, "start": 4556.0, "end": 4559.0, "text": "Aber da bin ich tatsächlich muss ich eine Sache mal sagen"}, {"id": 816, "start": 4559.0, "end": 4565.0, "text": "Ich habe mich ja letzten Streams öfters mal darüber beschwert dass ich immer noch echt erstaunt bin"}, {"id": 817, "start": 4565.0, "end": 4570.0, "text": "Wie viel wenig Ahnung auch gerade die junge Generation von Technica die eigentlich damit aufgewachsen ist"}, {"id": 818, "start": 4570.0, "end": 4573.0, "text": "Was ich mir früher komplett anders vorgestellt habe"}, {"id": 819, "start": 4573.0, "end": 4578.0, "text": "Dass es nie so sein wird mehr wie quasi bei mir und davor"}, {"id": 820, "start": 4578.0, "end": 4580.0, "text": "Aber ja eigentlich ist es noch genauso"}, {"id": 821, "start": 4580.0, "end": 4586.0, "text": "Aber da ist glaube ich die jüngere Generation einigen wirklich voraus"}, {"id": 822, "start": 4586.0, "end": 4591.0, "text": "Viele der Leute die heute anfangen zu arbeiten beziehungsweise angefangen haben zu arbeiten"}, {"id": 823, "start": 4591.0, "end": 4595.0, "text": "Gehen damit diesem Mindset auch ran"}, {"id": 824, "start": 4595.0, "end": 4598.0, "text": "Die wollen nicht für die Arbeit leben"}, {"id": 825, "start": 4598.0, "end": 4602.0, "text": "Die wollen und durchaus ordentliche Arbeit machen das ist nicht das Ding"}, {"id": 826, "start": 4602.0, "end": 4608.0, "text": "Aber die haben keinen Bock eine 40 Stunden Arbeitswoche zu machen"}, {"id": 827, "start": 4608.0, "end": 4611.0, "text": "Die regelmäßig eine 50 Stunden Arbeitswoche ist"}, {"id": 828, "start": 4611.0, "end": 4615.0, "text": "Und da noch zweieinhalb Stunden am Tag im Zug verbringen hin und zurück"}, {"id": 829, "start": 4615.0, "end": 4620.0, "text": "Und im Endeffekt 6 Uhr morgens rausgehen und 20 Uhr abends heimkommen"}, {"id": 830, "start": 4620.0, "end": 4624.0, "text": "Da haben die keinen Bock mehr drauf und das kann ich verstehen und das ist gut so"}, {"id": 831, "start": 4630.0, "end": 4632.0, "text": "Quelle Instagram"}, {"id": 832, "start": 4632.0, "end": 4642.0, "text": "Okay wir müssen uns mal kurz an und was sagt denn das ZDF dazu"}, {"id": 833, "start": 4642.0, "end": 4652.0, "text": "Also es geht meiner Ansicht nach dabei nicht drum quasi wie sagt man so dienst nach vorschriften"}, {"id": 834, "start": 4652.0, "end": 4657.0, "text": "Also es geht jetzt darum nicht schlechte Arbeit zu machen oder dass einem alles am Arsch vorbeigeht"}, {"id": 835, "start": 4657.0, "end": 4659.0, "text": "Das ist finde ich gar nicht der Punkt"}, {"id": 836, "start": 4659.0, "end": 4667.0, "text": "Was das für mich beschreibt ist eben dass man einfach nicht mehr macht als das wofür man bezahlt wird"}, {"id": 837, "start": 4667.0, "end": 4669.0, "text": "Und das finde ich okay"}, {"id": 838, "start": 4669.0, "end": 4671.0, "text": "Okay was sagt das ZDF"}, {"id": 839, "start": 4676.0, "end": 4678.0, "text": "Hä"}, {"id": 840, "start": 4678.0, "end": 4680.0, "text": "Hat es keinen"}, {"id": 841, "start": 4680.0, "end": 4683.0, "text": "Was"}, {"id": 842, "start": 4693.0, "end": 4697.0, "text": "Facebook und Instagram so ein Rotz mann"}, {"id": 843, "start": 4697.0, "end": 4700.0, "text": "So ein Schund alter"}, {"id": 844, "start": 4705.0, "end": 4708.0, "text": "Guckt euch diesen Rotz an mann"}, {"id": 845, "start": 4708.0, "end": 4712.0, "text": "Was ein Scheiß warum soll ich mich dazu einlocken"}, {"id": 846, "start": 4717.0, "end": 4719.0, "text": "Kann das das"}, {"id": 847, "start": 4727.0, "end": 4729.0, "text": "Hä"}, {"id": 848, "start": 4729.0, "end": 4736.0, "text": "Oder muss ich mal wieder updaten"}, {"id": 849, "start": 4743.0, "end": 4746.0, "text": "Muss ich mal wieder updaten kann auch sein"}, {"id": 850, "start": 4746.0, "end": 4755.0, "text": "Schlimm alter Instagram so ein Crap"}, {"id": 851, "start": 4755.0, "end": 4771.0, "text": "Ja komm updaten halt mal"}, {"id": 852, "start": 4776.0, "end": 4778.0, "text": "Ach jetzt funktioniert es"}, {"id": 853, "start": 4778.0, "end": 4786.0, "text": "Pog easy download"}, {"id": 854, "start": 4794.0, "end": 4800.0, "text": "Wo ist es denn Video bei ZDF heute ja okay"}, {"id": 855, "start": 4800.0, "end": 4802.0, "text": "Okay"}, {"id": 856, "start": 4802.0, "end": 4804.0, "text": "Was sagt denn das ZDF"}, {"id": 857, "start": 4804.0, "end": 4810.0, "text": "Alles klar was sagt denn das ZDF dazu"}, {"id": 858, "start": 4810.0, "end": 4816.0, "text": "Im Netz wird aktuell viel über Quiet quitting diskutiert mache Quiet quitting seit Tag eins"}, {"id": 859, "start": 4816.0, "end": 4819.0, "text": "Also ich mache auch nicht mehr als das was ich muss"}, {"id": 860, "start": 4819.0, "end": 4821.0, "text": "Also ich mache auch nicht mehr als das was ich muss"}, {"id": 861, "start": 4821.0, "end": 4823.0, "text": "Also ich mache auch nicht mehr als das was ich muss"}, {"id": 862, "start": 4823.0, "end": 4830.0, "text": "Also ich mache auch nicht mehr als das was ich muss"}, {"id": 863, "start": 4830.0, "end": 4833.0, "text": "Wie gesagt das ist recht negativ dargestellt"}, {"id": 864, "start": 4833.0, "end": 4838.0, "text": "Wenn er gesagt hat ich mache auch nicht mehr für das was ich bezahlt werde so okay"}, {"id": 865, "start": 4838.0, "end": 4843.0, "text": "In der Wirtschafts-Disziplin gibt es einen Begriff der das Phänomen ganz gut beschreibt"}, {"id": 866, "start": 4843.0, "end": 4849.0, "text": "Ja Moment das sind für mich zwei unterschiedliche Paar Schuhe"}, {"id": 867, "start": 4849.0, "end": 4852.28, "text": "Ja Moment, das sind für mich zwei unterschiedliche Paar Schuhe."}, {"id": 868, "start": 4853.8, "end": 4855.96, "text": "Das sind für mich zwei unterschiedliche Paar Schuhe."}, {"id": 869, "start": 4856.44, "end": 4859.16, "text": "Man könnte das vielleicht zu übersetzen, aber ich finde vom, vom,"}, {"id": 870, "start": 4860.84, "end": 4862.76, "text": "vom Sinn her trifft es das nicht so ganz."}, {"id": 871, "start": 4866.08, "end": 4869.96, "text": "Innere Kündigung ist tatsächlich, wenn ich, also so würde ich das jetzt sehen,"}, {"id": 872, "start": 4870.2, "end": 4872.8, "text": "ist tatsächlich so nach dem Motto, Alter, ähm,"}, {"id": 873, "start": 4873.84, "end": 4875.76, "text": "ich mache wirklich nur das Mindeste"}, {"id": 874, "start": 4875.76, "end": 4878.24, "text": "und das dann auch noch schlecht."}, {"id": 875, "start": 4887.2, "end": 4888.2, "text": "Aha."}, {"id": 876, "start": 4892.48, "end": 4895.96, "text": "Das, jetzt, das sind doch zwei, ah."}, {"id": 877, "start": 4899.84, "end": 4902.04, "text": "Das sind aber doch zwei unterschiedliche Paar Schuhe."}, {"id": 878, "start": 4902.2, "end": 4903.2, "text": "Ich mein,"}, {"id": 879, "start": 4903.2, "end": 4907.0, "text": "keine Überstunden, kein Stress, das ist doch vollkommen in Ordnung."}, {"id": 880, "start": 4907.16, "end": 4909.36, "text": "Das eine hat doch mit dem anderen nichts zu tun, ja."}, {"id": 881, "start": 4909.52, "end": 4911.8, "text": "Also wenn du quasi wirklich nur das Minimalste machst,"}, {"id": 882, "start": 4911.96, "end": 4917.24, "text": "so kurz, dass du immer kurz bevor, kurz vor dem rausgekickt werden bist"}, {"id": 883, "start": 4917.4, "end": 4921.0, "text": "oder dass du quasi das, was du machst, quasi auch noch schlecht machst,"}, {"id": 884, "start": 4921.16, "end": 4924.04, "text": "das ist ja was anderes, wie wenn du keine Überstunden machst"}, {"id": 885, "start": 4924.04, "end": 4933.28, "text": "und dich nicht unnötig verrückt machst."}, {"id": 886, "start": 4933.44, "end": 4938.08, "text": "Dass da jemand mit geholfen, nein, also weder Organisation noch Mitarbeitenden,"}, {"id": 887, "start": 4938.24, "end": 4942.48, "text": "innere Kündigung ist auf Seiten der Mitarbeiter assoziiert mit..."}, {"id": 888, "start": 4942.64, "end": 4948.04, "text": "Ja gut, das ist wahr, aber das sind für mich zwei unterschiedliche Paar Schuhe."}, {"id": 889, "start": 4948.2, "end": 4952.56, "text": "... reduziertem Wohlbefinden, mit psychosomatischen Beschwerden"}, {"id": 890, "start": 4952.56, "end": 4954.56, "text": "und mit niedriger Arbeitszufriedenheit."}, {"id": 891, "start": 4954.72, "end": 4955.72, "text": "Ja."}, {"id": 892, "start": 4968.52, "end": 4971.56, "text": "Ja gut, da ist durchaus was dran, ja."}, {"id": 893, "start": 4974.52, "end": 4979.28, "text": "Also ich würde sagen, ja, für die meisten Leute, die arbeiten gehen,"}, {"id": 894, "start": 4979.28, "end": 4984.2, "text": "ist das Gehalt ein wichtiger Faktor für die Motivation."}, {"id": 895, "start": 4984.36, "end": 4987.2, "text": "Ich meine, was denn sonst? Warum gehen die Leute dann arbeiten?"}, {"id": 896, "start": 4988.68, "end": 4990.68, "text": "Fürs Geld zum größten Teil."}, {"id": 897, "start": 4992.24, "end": 4994.68, "text": "Das ist dann ein Resultat eines Entscheidungsprozesses,"}, {"id": 898, "start": 4994.84, "end": 4997.16, "text": "wo ich dann sage, okay, ich bin sehr unzufrieden,"}, {"id": 899, "start": 4997.32, "end": 4999.76, "text": "ich habe das Gefühl, ich habe mehr in die Organisation investiert,"}, {"id": 900, "start": 4999.92, "end": 5002.32, "text": "als ich herausbekomme. Was mache ich jetzt?"}, {"id": 901, "start": 5002.48, "end": 5005.72, "text": "Okay, meine äußeren Umstände zwingen mich so ein bisschen dazu,"}, {"id": 902, "start": 5005.72, "end": 5009.24, "text": "in der Organisation zu bleiben, also reduziere ich halt"}, {"id": 903, "start": 5009.4, "end": 5012.52, "text": "mein psychologisches Investment und ziehe mich innerlich zurück."}, {"id": 904, "start": 5024.08, "end": 5026.76, "text": "Okay, ähm, also..."}, {"id": 905, "start": 5029.36, "end": 5030.36, "text": "Naja."}, {"id": 906, "start": 5030.36, "end": 5035.52, "text": "Also eine positive Emots... What the..."}, {"id": 907, "start": 5035.68, "end": 5037.68, "text": "Alter, was habe ich jetzt gemacht?"}, {"id": 908, "start": 5038.48, "end": 5041.48, "text": "Five-Hat Ratio."}, {"id": 909, "start": 5042.96, "end": 5046.96, "text": "Also eine positive emotionale Verbindung zur Organisation..."}, {"id": 910, "start": 5049.28, "end": 5053.28, "text": "verspüre ich nicht, ich..."}, {"id": 911, "start": 5055.48, "end": 5059.76, "text": "Ich verspüre aber eine positive emotionale Verbindung"}, {"id": 912, "start": 5059.76, "end": 5063.28, "text": "zu meinen Kollegen und Leuten, die ich dort schon jahrelang kenne."}, {"id": 913, "start": 5069.24, "end": 5072.64, "text": "Nicht zu allen, aber zu Leuten, die ich mag und die ich schon lange kenne"}, {"id": 914, "start": 5072.8, "end": 5074.8, "text": "und mit denen ich gerne zusammenarbeite."}, {"id": 915, "start": 5076.48, "end": 5080.88, "text": "Aber positive emotionale Verbindung, dass ich jetzt sagen würde,"}, {"id": 916, "start": 5081.04, "end": 5083.92, "text": "Alter, ich stehe voll dahinter, was die Firma macht,"}, {"id": 917, "start": 5084.08, "end": 5086.08, "text": "das ist die geilste Firma auf der Welt."}, {"id": 918, "start": 5086.24, "end": 5088.4, "text": "Nö, muss ich aber auch nicht, oder?"}, {"id": 919, "start": 5088.4, "end": 5090.4, "text": "Nein."}, {"id": 920, "start": 5091.28, "end": 5094.56, "text": "Warum muss ich das geil finden, was unsere Firma macht?"}, {"id": 921, "start": 5098.04, "end": 5101.04, "text": "Ein hohes Pflichtgefühl aufweisen."}, {"id": 922, "start": 5105.04, "end": 5108.04, "text": "Den Eindruck haben, dass sie berufliche Alternativen haben."}, {"id": 923, "start": 5113.4, "end": 5115.4, "text": "Okay."}, {"id": 924, "start": 5115.56, "end": 5117.56, "text": "Aha, wie gesagt..."}, {"id": 925, "start": 5117.56, "end": 5119.56, "text": "Für mich sind es zwei Paar Schuhe."}, {"id": 926, "start": 5119.72, "end": 5121.72, "text": "Ob du innerlich gekündigt hast"}, {"id": 927, "start": 5121.88, "end": 5125.88, "text": "und quasi nur noch, sagen wir mal so, nur noch Müll ablieferst,"}, {"id": 928, "start": 5126.04, "end": 5129.04, "text": "was halt irgendwie gerade so durchgeht,"}, {"id": 929, "start": 5129.2, "end": 5134.2, "text": "oder ob du einfach nicht über Gebühren viel machst"}, {"id": 930, "start": 5134.36, "end": 5136.36, "text": "über das hinaus, was dir quasi vergütet wird."}, {"id": 931, "start": 5136.52, "end": 5138.52, "text": "Das sind noch zwei unterschiedliche Paar Schuhe."}, {"id": 932, "start": 5138.68, "end": 5140.68, "text": "Du kannst auch trotzdem ordentliche Arbeit machen,"}, {"id": 933, "start": 5140.84, "end": 5143.84, "text": "allerdings bist du dann halt nicht dazu bereit,"}, {"id": 934, "start": 5143.84, "end": 5148.84, "text": "mehr zu machen, als das, was dir quasi..."}, {"id": 935, "start": 5149.0, "end": 5152.0, "text": "Man kann nicht unbedingt sagen, bezahlt wird,"}, {"id": 936, "start": 5152.16, "end": 5155.16, "text": "mehr zu machen, als das, was mir dir eben zugesteht."}, {"id": 937, "start": 5155.32, "end": 5158.32, "text": "Das kann ja auch sein, es muss ja nicht rein Gehalt sein,"}, {"id": 938, "start": 5158.48, "end": 5160.48, "text": "es kann ja auch sein, dass man sagt,"}, {"id": 939, "start": 5160.64, "end": 5162.64, "text": "hey, machst du mal nachts Wartungsarbeiten,"}, {"id": 940, "start": 5162.8, "end": 5164.8, "text": "drücken wir das nächste Mal ein Auge zu,"}, {"id": 941, "start": 5164.96, "end": 5167.96, "text": "wenn du einen halben Tag früher Urlaube antragen willst,"}, {"id": 942, "start": 5168.12, "end": 5170.12, "text": "was auch immer."}, {"id": 943, "start": 5170.28, "end": 5172.28, "text": "Aber dass die Leute nicht mehr machen wollen,"}, {"id": 944, "start": 5172.28, "end": 5175.28, "text": "dass das, was sie zurückbekommen, auf Dauer,"}, {"id": 945, "start": 5175.44, "end": 5177.44, "text": "ist doch vollkommen in Ordnung."}, {"id": 946, "start": 5177.6, "end": 5179.6, "text": "Das heißt ja nicht, dass das, was sie machen,"}, {"id": 947, "start": 5179.76, "end": 5181.76, "text": "zwangsläufig schlecht sein muss."}, {"id": 948, "start": 5181.92, "end": 5185.92, "text": "Man kann trotzdem ordentliche Arbeit abliefern"}, {"id": 949, "start": 5186.08, "end": 5189.08, "text": "und man sogar Spaß an der Arbeit haben, ohne zu sagen,"}, {"id": 950, "start": 5189.24, "end": 5192.24, "text": "jawoll, nächste Wartungsarbeiten nachts,"}, {"id": 951, "start": 5192.4, "end": 5195.4, "text": "und nächster Software-Release nachts, mach ich auch,"}, {"id": 952, "start": 5195.56, "end": 5198.56, "text": "und den danach mach ich auch, hier bin ich auch,"}, {"id": 953, "start": 5198.72, "end": 5200.72, "text": "und dann fahre ich zum nächsten Außendienstseminar"}, {"id": 954, "start": 5200.72, "end": 5202.72, "text": "und schiebe das an, hoho."}, {"id": 955, "start": 5202.88, "end": 5204.88, "text": "Warum?"}, {"id": 956, "start": 5205.04, "end": 5208.04, "text": "Das machen vielleicht irgendwelche krassen Karrieregrinder,"}, {"id": 957, "start": 5208.2, "end": 5210.2, "text": "die in ein, zwei Jahren vielleicht mal"}, {"id": 958, "start": 5210.36, "end": 5212.36, "text": "irgendwie eine andere Position haben wollen."}, {"id": 959, "start": 5212.52, "end": 5214.52, "text": "Aber das kann doch nicht,"}, {"id": 960, "start": 5214.68, "end": 5217.68, "text": "das sollte doch nicht der normale Zustand sein."}, {"id": 961, "start": 5217.84, "end": 5219.84, "text": "Na ja, gut."}, {"id": 962, "start": 5220.0, "end": 5223.0, "text": "Ich finde, das hat das ZDF hier ein bisschen durcheinandergeschmissen,"}, {"id": 963, "start": 5223.0, "end": 5231.0, "text": "mehrere Sachen."}, {"id": 964, "start": 5253.0, "end": 5257.0, "text": "Ja, aber nicht mal so lang."}, {"id": 965, "start": 5257.16, "end": 5259.16, "text": "Wie gesagt, ich glaube, 14 Leute."}, {"id": 966, "start": 5259.16, "end": 5283.16, "text": "Ist der Typ wieder am Start?"}, {"id": 967, "start": 5290.16, "end": 5293.16, "text": "Der Fernseher stromgeneriert."}, {"id": 968, "start": 5293.32, "end": 5297.32, "text": "Also, den Fernseher, den stromgeneriert, das kenne ich nicht."}, {"id": 969, "start": 5297.48, "end": 5302.48, "text": "Ich kenne diese ganzen Videos in die Richtung free energy."}, {"id": 970, "start": 5302.64, "end": 5304.64, "text": "Weiß nicht, ob ihr das auch kennt."}, {"id": 971, "start": 5304.8, "end": 5307.8, "text": "Es gibt ja auf YouTube ein paar Leute, die einem erzählen wollen,"}, {"id": 972, "start": 5307.96, "end": 5311.96, "text": "dass man an irgendwelchen, ja, bei irgendwelchen Systemen,"}, {"id": 973, "start": 5312.12, "end": 5315.12, "text": "free energy abgreifen kann."}, {"id": 974, "start": 5315.12, "end": 5320.12, "text": "Das ist eigentlich alles Scam."}, {"id": 975, "start": 5320.28, "end": 5326.28, "text": "Beziehungsweise, wenn sie es nachmessen würden, bringt es, geht es nicht."}, {"id": 976, "start": 5326.28, "end": 5329.28, "text": "Also, ganz ehrlich, wenn Überstunden bei mir"}, {"id": 977, "start": 5329.44, "end": 5331.44, "text": "mit dem Gehalt abgegolten werden,"}, {"id": 978, "start": 5331.6, "end": 5334.6, "text": "dann würde ich eher gar keine Überstunden machen."}, {"id": 979, "start": 5334.76, "end": 5336.76, "text": "Weil, das heißt ja im Endeffekt,"}, {"id": 980, "start": 5336.92, "end": 5340.92, "text": "ich arbeite mehr, als ich arbeiten müsste, ohne Projekte."}, {"id": 981, "start": 5341.08, "end": 5344.08, "text": "Und das ist das, was ich hier in diesem Video gemacht habe."}, {"id": 982, "start": 5344.24, "end": 5347.24, "text": "Und das ist das, was ich hier in diesem Video gemacht habe."}, {"id": 983, "start": 5347.4, "end": 5350.4, "text": "Und das ist das, was ich hier in diesem Video gemacht habe."}, {"id": 984, "start": 5350.56, "end": 5353.56, "text": "Und das ist das, was ich hier in diesem Video gemacht habe."}, {"id": 985, "start": 5353.56, "end": 5356.4, "text": "Und ich arbeite mehr, als ich arbeiten müsste."}, {"id": 986, "start": 5356.56, "end": 5359.56, "text": "Und bekomm noch nicht mal was für. Na dann ist ja..."}, {"id": 987, "start": 5359.72, "end": 5362.12, "text": "Dann könntet ihr mal komplett abschminken."}, {"id": 988, "start": 5363.12, "end": 5365.12, "text": "Könnten sich komplett abschminken"}, {"id": 989, "start": 5365.12, "end": 5390.12, "text": "Ich weiß nicht was da wieder abgeht"}, {"id": 990, "start": 5395.12, "end": 5417.12, "text": "Kein Winners Terminal?"}, {"id": 991, "start": 5417.12, "end": 5418.12, "text": "Doch tatsächlich"}, {"id": 992, "start": 5418.12, "end": 5443.12, "text": "Aber warum?"}, {"id": 993, "start": 5443.12, "end": 5451.12, "text": "Du hast schon recht, man kann es so oder so rum interpretieren. Letztendlich ist doch wichtig, dass jeder weiß wer wann gemeint ist, oder?"}, {"id": 994, "start": 5473.12, "end": 5489.12, "text": "Was sagen die Amis denn ständig?"}, {"id": 995, "start": 5489.12, "end": 5491.12, "text": "Sagen die das?"}, {"id": 996, "start": 5491.12, "end": 5499.12, "text": "Hab ich doch nicht mitgekriegt"}, {"id": 997, "start": 5499.12, "end": 5503.12, "text": "Aber gut, bei den Amis wird viel erzählt"}, {"id": 998, "start": 5503.12, "end": 5511.12, "text": "Leider ist einiges was bei den Amis angesagt ist bei uns dann ein halbes Jahr später auch am Start"}, {"id": 999, "start": 5511.12, "end": 5519.12, "text": "Zum Beispiel eine Sache, die man ja bei den Amis schon länger beobachten kann, sind diese endlosen Gender-Diskussionen"}, {"id": 1000, "start": 5519.12, "end": 5529.12, "text": "Ich meine jetzt nicht sprachlich, sondern nach dem Motto Frauengehalt und Männer benachteilen und Frauen benachteile ich dann wieder hier Männer und so"}, {"id": 1001, "start": 5529.12, "end": 5536.12, "text": "Dieses ganze ewig rumdiskutieren um dieses Thema, das konnte man schon 2-3 Jahre vorher in den USA beobachten"}, {"id": 1002, "start": 5536.12, "end": 5550.12, "text": "Und jetzt ist bei uns auch angesagt"}, {"id": 1003, "start": 5550.12, "end": 5563.12, "text": "Was Erfinder aus dem Bapfe? Was?"}, {"id": 1004, "start": 5563.12, "end": 5571.12, "text": "Oh Leute, ich bin heute extra nur angekommen, weil ich jetzt die letzten 2 Tage gestreamt habe"}, {"id": 1005, "start": 5571.12, "end": 5573.12, "text": "Ich habe gedacht wir müssen nochmal irgendwie hinkriegen"}, {"id": 1006, "start": 5573.12, "end": 5579.12, "text": "Aber so ein 3-4 Tage am Stück Streaming Streak"}, {"id": 1007, "start": 5579.12, "end": 5583.12, "text": "Auch wenn ich heute wirklich zu kaputt war irgendwas sinnvolles zu machen"}, {"id": 1008, "start": 5583.12, "end": 5587.12, "text": "Ich bin jetzt noch eine Viertelstunde da, also chat wenn es noch irgendwas spannendes gibt schießt los"}, {"id": 1009, "start": 5587.12, "end": 5590.12, "text": "Großartig Videos gucken können wir jetzt nicht mehr"}, {"id": 1010, "start": 5590.12, "end": 5595.12, "text": "Und irgendwas machen bin ich heute eh gehirnmäßig nicht mehr in der Lage zu"}, {"id": 1011, "start": 5595.12, "end": 5602.12, "text": "Boomer müde, ja korrekt, ups falsches Emote, wo habe ich denn mein Bett ge"}, {"id": 1012, "start": 5602.12, "end": 5614.12, "text": "Chat ihr müsst mir helfen, ich finde meine Emotes nicht mehr"}, {"id": 1013, "start": 5614.12, "end": 5622.12, "text": "Wo habe ich mein, da"}, {"id": 1014, "start": 5622.12, "end": 5625.12, "text": "Wir implementieren kurz einen Mikrokernel in Rust genau"}, {"id": 1015, "start": 5625.12, "end": 5629.12, "text": "Ich hatte ja mal eigentlich gedacht ich könnte da oben so eine Suche machen guck"}, {"id": 1016, "start": 5629.12, "end": 5640.12, "text": "Das Problem ist nur, ich zeige euch mal was das Problem ist"}, {"id": 1017, "start": 5640.12, "end": 5648.12, "text": "Die Suche ist kaputt und ich habe keinen Bock dieses Projekt nochmal anzufassen"}, {"id": 1018, "start": 5648.12, "end": 5653.12, "text": "Das ist, ich habe dieses Board und dieses Overlay Ding hier"}, {"id": 1019, "start": 5653.12, "end": 5657.12, "text": "Ich habe das vor 4 Jahren oder so programmiert"}, {"id": 1020, "start": 5657.12, "end": 5665.12, "text": "Und das ist noch mit Vue.js, wäre wahrscheinlich schon Vue 2 aber"}, {"id": 1021, "start": 5665.12, "end": 5673.12, "text": "Uralt ich habe keinen Bock dort irgendwas noch drin zu machen"}, {"id": 1022, "start": 5673.12, "end": 5675.12, "text": "Doch das ist so lange her"}, {"id": 1023, "start": 5675.12, "end": 5679.12, "text": "Das war eines der ersten Sachen die ich gemacht habe für den Stream"}, {"id": 1024, "start": 5679.12, "end": 5694.12, "text": "Komplett neu machen das ist schon ein bisschen das war schon ein bisschen was aufwändigeres"}, {"id": 1025, "start": 5694.12, "end": 5697.12, "text": "Kann er nichts Open Source"}, {"id": 1026, "start": 5697.12, "end": 5707.12, "text": "Ich kann das schon aber das ist so hässlich da schäme ich mich für das kann ich nicht hochladen"}, {"id": 1027, "start": 5707.12, "end": 5712.12, "text": "Stadia ist auch irgendwo am Start"}, {"id": 1028, "start": 5712.12, "end": 5721.12, "text": "Stadia benutze ich eigentlich nur in Kombination mit sowas hier oder"}, {"id": 1029, "start": 5721.12, "end": 5738.12, "text": "Ich finde mich hier nicht zurecht weil bei mir ist das anders eingeteilt auf dem zweiten Bildschirm oder sowas hier"}, {"id": 1030, "start": 5738.12, "end": 5744.12, "text": "Wenn ich das im Stream neu baue da brauche ich ewig für das ist wie gesagt das ist nicht so easy gewesen"}, {"id": 1031, "start": 5744.12, "end": 5749.12, "text": "Du brauchst mehrere Komponenten du brauchst die Sache die das rendert auf dem Desktop"}, {"id": 1032, "start": 5749.12, "end": 5754.12, "text": "Das kann ja sogar Keymappings Leute guck mal das kann Keymappings also egal ich kann sogar"}, {"id": 1033, "start": 5754.12, "end": 5759.12, "text": "Ich habe sogar Shortcuts für die E-Mouse die ich nie verwende"}, {"id": 1034, "start": 5759.12, "end": 5762.12, "text": "Ne mit UWP mache ich das auch nicht"}, {"id": 1035, "start": 5762.12, "end": 5767.12, "text": "Muss man da Sachen hochladen können ich kann ja hier die Dinger track und droppen und hochladen und sowas"}, {"id": 1036, "start": 5767.12, "end": 5771.12, "text": "Da ist ja auch Text to Speech dabei guckt mal ihr habt ja hier"}, {"id": 1037, "start": 5771.12, "end": 5773.12, "text": "Kannst du hier Text to Speech eingeben?"}, {"id": 1038, "start": 5773.12, "end": 5781.12, "text": "Kannst du dann hier auswählen?"}, {"id": 1039, "start": 5781.12, "end": 5784.12, "text": "Oder kannst du die Weeb Texts zu Speech machen?"}, {"id": 1040, "start": 5784.12, "end": 5788.12, "text": "Oh ich glaube es ist gecrashed"}, {"id": 1041, "start": 5788.12, "end": 5795.12, "text": "Perfekte Software Leute"}, {"id": 1042, "start": 5795.12, "end": 5809.12, "text": "Ganz toll"}, {"id": 1043, "start": 5809.12, "end": 5814.12, "text": "Also kannst du echt vergessen ich will da nicht mehr dran"}, {"id": 1044, "start": 5814.12, "end": 5823.12, "text": "Ich habe auch kein Rollbackverfahren dafür"}, {"id": 1045, "start": 5823.12, "end": 5828.12, "text": "Bin gebannt? Ne das ist ein bekannter Bug den habe ich öfters"}, {"id": 1046, "start": 5828.12, "end": 5837.12, "text": "Das ist wenn ich nicht die richtige Reihenfolge von Buttons an klicke für Texts zu Speech dann geht es kaputt"}, {"id": 1047, "start": 5837.12, "end": 5841.12, "text": "Guck wenn ich jetzt wenn ich ich glaube"}, {"id": 1048, "start": 5841.12, "end": 5850.12, "text": "Wenn ich hier KW und KW reinschreibe dann rüber switche und ein und aus mache dann ist wieder kaputt"}, {"id": 1049, "start": 5850.12, "end": 5853.12, "text": "Ne das geht schon das das das geht"}, {"id": 1050, "start": 5853.12, "end": 5858.12, "text": "Das habe ich öfter schon gehabt dass es kaputt geht"}, {"id": 1051, "start": 5858.12, "end": 5864.12, "text": "Muss man es vielleicht so machen?"}, {"id": 1052, "start": 5864.12, "end": 5869.12, "text": "Ne"}, {"id": 1053, "start": 5869.12, "end": 5877.12, "text": "Man braucht die richtige Reihenfolge"}, {"id": 1054, "start": 5877.12, "end": 5881.12, "text": "Ke KW"}, {"id": 1055, "start": 5881.12, "end": 5884.12, "text": "Muss man es vielleicht ausschalten?"}, {"id": 1056, "start": 5884.12, "end": 5887.12, "text": "Ke KW"}, {"id": 1057, "start": 5887.12, "end": 5890.12, "text": "Ach keine Ahnung"}, {"id": 1058, "start": 5890.12, "end": 5905.12, "text": "Was jetzt? Kein Plan mehr was ich da gebaut habe"}, {"id": 1059, "start": 5905.12, "end": 5916.12, "text": "In Rust? Dann wäre es Placingly Fast das geht nicht"}, {"id": 1060, "start": 5916.12, "end": 5931.12, "text": "2035"}, {"id": 1061, "start": 5931.12, "end": 5933.12, "text": "Na gut Leute"}, {"id": 1062, "start": 5933.12, "end": 5938.12, "text": "Wollen wir heute mal zur Abwechslung wieder irgendjemand hosten?"}, {"id": 1063, "start": 5938.12, "end": 5944.12, "text": "Du folgst mal gucken ob irgendjemand da ist den ich hosten kann von den Leuten"}, {"id": 1064, "start": 5944.12, "end": 5962.12, "text": "Den ich folge die es auch brauchen weil irgendwelche 8000 oder 1000 plus Leute brauchen es wahrscheinlich nicht"}, {"id": 1065, "start": 5962.12, "end": 5970.12, "text": "Dash Bunny? Ne ich bin zu shy grills zu hosten auf Twitch"}, {"id": 1066, "start": 5970.12, "end": 5976.12, "text": "Das geht nicht"}, {"id": 1067, "start": 5976.12, "end": 5984.12, "text": "Da bin ich zu pepo shy für"}, {"id": 1068, "start": 5984.12, "end": 5990.12, "text": "Ich will aber jemand hosten dem ich folge und der das gebrauchen kann"}, {"id": 1069, "start": 5990.12, "end": 5994.12, "text": "Der Sprecher ist online"}, {"id": 1070, "start": 5994.12, "end": 5998.12, "text": "Frage geht zweimal unter"}, {"id": 1071, "start": 5998.12, "end": 6003.12, "text": "Wollte fragen wie du Rust von der Komplexität her einstufen würdest"}, {"id": 1072, "start": 6003.12, "end": 6006.12, "text": "Boah das ist eines der komplexesten Sprachen die ich kenne zu lernen"}, {"id": 1073, "start": 6006.12, "end": 6010.12, "text": "Selbst wenn du schon andere Sprachen gut kannst"}, {"id": 1074, "start": 6010.12, "end": 6028.12, "text": "Wow"}, {"id": 1075, "start": 6028.12, "end": 6048.64, "text": "Dann hausten wir ihn wieder."}, {"id": 1076, "start": 6048.64, "end": 6054.68, "text": "Raid, was macht er denn heute?"}, {"id": 1077, "start": 6054.68, "end": 6055.68, "text": "Switch."}, {"id": 1078, "start": 6055.68, "end": 6062.44, "text": "Alter Werbung ey, ich fasse es nicht."}, {"id": 1079, "start": 6062.44, "end": 6063.44, "text": "Wahnsinn."}, {"id": 1080, "start": 6063.44, "end": 6076.92, "text": "Okay, ich hab keine Ahnung was er so treibt, irgendwas 3D drucken oder so?"}, {"id": 1081, "start": 6076.92, "end": 6077.92, "text": "Egal."}, {"id": 1082, "start": 6077.92, "end": 6078.92, "text": "Wir raiden."}, {"id": 1083, "start": 6078.92, "end": 6083.92, "text": "Wir raiden hin und her."}, {"id": 1084, "start": 6083.92, "end": 6089.76, "text": "Passt zumindest thematisch meistens."}, {"id": 1085, "start": 6089.76, "end": 6093.16, "text": "Halbwegs hier zum streamen."}, {"id": 1086, "start": 6093.16, "end": 6097.8, "text": "Okay Leute wir sehen uns."}, {"id": 1087, "start": 6097.8, "end": 6099.68, "text": "Ich hau ab."}, {"id": 1088, "start": 6099.68, "end": 6102.2, "text": "Nächster stream."}, {"id": 1089, "start": 6102.2, "end": 6104.64, "text": "Mal gucken vielleicht bin ich morgen ein bisschen fitter."}, {"id": 1090, "start": 6104.64, "end": 6122.6, "text": "Bis denn, machts gut."}]}