{"text": "So jetzt aber, achja, ich hab gerade mein Unraid geupgraded, ich bin ja immer noch nicht100% nicht schlüssig, ob das eine gute Idee war, den Kram zu verwenden. Ich hab's jahrelangignoriert, weil ich mir immer dachte, sowas was ich nehme hat nicht richtiges Linux und machdie Sachen selbst. An sich finde ich es eigentlich ganz gut, wenn man weniger selbst machen muss,weil ich hab keinen Bock mich die ganze Zeit 24-7 um meine Infrastruktur daheim zu kümmern,aber irgendwie wirkt das sehr gebastelt alles. Und auch als interessiert die das nicht wirklich,was da mit gemacht wird. Also so ganz happy bin ich damit nicht. Auf der anderen Seiteweiß man nicht, was es für sinnige Alternativen gibt für daheim, wenn man ein Webinterface habenwill. Es gibt Cockpit, es gibt theoretisch noch Proxmox, wobei Proxmox für meinen Falleher nichts ist. Will er nichts großartig virtualisieren. Ansonsten... Gibt's heuteNachhilfestunde in Internetmemes? Ne, weiß noch nicht, vielleicht. Kann ich noch nichtsagen, mal gucken, was passiert. Also ihr wisst ja, ich hab bloß eineinhalb Stunden Zeit, wirschwätzen jetzt ein bisschen, gucken uns ein bisschen Zeug an und dann ist gut für heute.Den Content habe ich letzten Tage über gemacht. PlaneLib wird... Wie gesagt, das habe ich frühergemacht. Ich hatte früher einfach mit Ubuntu auf die Kiste hier oder Debian hier auf die Kistegeklatscht und gut ist. Und ich hatte ja vor einer Weile schon gesagt, ok ich probiere malAndroid aus, weil alle immer gesagt haben, Android wäre irgendwie so nice und ich fandes an sich vom Ansatz her nicht verkehrt. Aber so wirklich durchdacht ist es auch nicht.Ja zum Beispiel, ich hab jetzt geupgraded, passt mal auf, ich hab geupgraded und jetzthat auf einmal der USB-Passthrough nicht mehr richtig funktioniert an die VMs. So sah dannso aus. Warum denn ich kosse, gut es ist noch davor. Guck mal, Unraid RC4. Das ist der Threadheißt so. USB. So, hier guck mal. Leute die, Leute die ein Upgrade gemacht haben berichtendarüber, dass nach dem Upgrade, by the way Upgrade auf 6.11, was ich gemacht habe, genaudas gleiche, dass ihr USB nicht mehr richtig funktioniert. So, man sollte eigentlich davonausgehen, USB-Passthrough, der nicht mehr ordentlich funktioniert in VMs ist wirklichein High Priority Thema. Aber anscheinend nicht. Das gab es bei 6.10 schon das Problem undbei 6.11 gibt es das weiter und es juckt keine Sau dort anscheinend. Ich mein USB-Passthroughist ja so eines der essentiellsten Sachen, dass du VMs überhaupt gescheit verwenden kannst.So, und die Aussage von den Typen jetzt bei Unraid ist, ja, dann. Zumindest die Aussagevon Unraid irgendwo ist, ja, dann benutzt doch, hier guck, guckt euch das an. Hier.Es gibt einen Addon, wo man USB-Passthrough umstellen kann, dass er wenn es geht, dasals Serial-Passthrough tut. Warum ist ein fucking Community Addon die Erklärung fürein beschissen, verbuggtes System? Wafa, was ist das? Also, wie kann ein Community Addondie Antwort sein darauf, dass ihr scheiß Körnern verbuggt ist bis zum Abkotzen? Dasregt mich mega auf. Das ist die Antwort darauf. Nehm einen Community Addon und schalt USBauf Serial um. Da kann ich mich aufregen. Alter, alles unfähige Kackspasten, man. Wiekann man so ein System, da wollt ihr auch noch Geld für haben? Das regt mich ultraauf, ja. Was eine Antwort, man. Haha, das stimmt, Q-Stream. Haha, Q-Stream und gleichwird übelst rumgeflamet, Leute. Haha, so sieht's aus. Okay, danke übrigens für die Subs,Leute hier. Pingo, Pingo und Schlechtes Wähler. Besser Titel, ja. Top. Deutschlandhast ja nicht nur schlechtes Wähler, schlechtes Mobilfunk und schlechtes Internet. Das kannstdu quasi, man müsste mal, man müsste mal das irgendwie zusammenfassen, Leute. Hatirgendwie einer gute Idee für so einen Sammelbegriff. Schlechtes WLAN, schlechtes Internet, schlechtesMobilfunk. Was ist das? Schlechte, wasletzte Funk. Alles schlecht ist ja hier auch nicht.Schlecht Kommunikation, schlechte Infrastruktur, ja. Hast du schon was über die ARK-CPUs gelesen?Ja, das sind die neuen Intel-GPUs, aber das war's auch. Für AV1 ist, wenn du encodenwillst, will ich AV1 encoden, ich encode H264, drei Stücke. Mit der nötigen Auflösungund Bandbreite, die man aber mittlerweile ja glücklicherweise auf YouTube hat. Ja, alsodie Sache ist halt die, es hat schon seine Vorteile, Unraid, versus ein nackiger Ubuntu-Server,für daheim wohlgemerkt, für daheim, ja. Manche Addons sind tatsächlich ganz nice,ja, zum Beispiel, dass du so eine Art Shop-Schedule-Frontend hast mit Web-Interface, anstatt irgendwelcheCron-Jobs von Hand zu machen. Das Read-Only-System ist, dass dein USB-Stick nicht kaputt geht,dass du ein Web-Interface zum VM anlegen hast, zum Container anlegen, zum Samba-Shares einrichten.An sich ist das schon ganz cool, aber es wirkt sehr, also, als ist es denen, die das entwickeln,egal. Na, TrueNAS an sich weiß ich nicht, ich glaube nicht, dass das richtig ist. Ichhatte mal eine Weile FreeNAS, und FreeNAS war ja ganz gut, wenn man ZFS verwenden will,und man, das Schlimmste an FreeNAS ist, Leute, das FreeNAS-Forum. Also es gibt zwei Foren,die, wo ich jedem nur empfehlen kann, Abstand zu halten, der vielleicht nicht so ganz gutklarkommt mit seinem Technik-Krams und möchte um Hilfe fragen. So, das ist einmal das deutscheFreeNAS-Forum und das Microcontroller-Forum. Nein, ich rede nicht von Reddit oder so. DasHeise-Forum ist auch kacke. Das Microcontroller-Forum, das FreeNAS-Forum und das deutschsprachigeArduino-Forum ist auch so ein Ding, wo ich mir immer denke, Alter, was für Vollspassda rum rennt, das ist echt der Wahnsinn. Erheise ist auch ätzend, ja, das stimmt, aber esgibt so ein paar Sachen. Und das Schlimme ist ja, wenn ja wenigstens die Antworten irgendwie,wenn es irgendwie eine gute, ja, wie soll ich sagen, so Wissens-Base wäre, diese Foren,ist es nicht. In der Regel sind die Seiten, die Threads, 20 Seiten lang, weil irgendjemandden Code-Block nicht richtig als Code formatiert hat oder irgendwie einer das nicht so geschriebenhat oder benannt hat, wie es einer gerne hätte. Also im Prinzip ist das eigentlich nur 20Seiten lang, wie sagen sie da auf Englisch drum, Circle Jerk oder so, Circle Jerk, alsoKreis Wichsen auf Deutsch quasi, 20 Seiten lang unproduktives Rumgelaber in den Foren,das ist krass. Da ist Reddit tatsächlich zum größten Teil relativ gut. Das beste Subreddit,wenn man ein bisschen, ähm, das beste Subreddit, wenn man ein bisschen Gerante lesen willüber Programmiersachen, müsst ihr auf dieses Subreddit gehen, da ist auch, also jetzt,das letzte Lack, ist Reddit kaputt? Oder ist die Google Weiterleitung auf Reddit kaputt?Ne, Reddit ist kaputt. Reddit ist beim Wiederbrauten. Reddit ist F.Guck. Guck mal, Hui! Massive Speed, Alter! Massive Speed!Ja, Leute, guckt mal, YouTube geht instant auf, das muss an Reddit liegen. Old Reddit,das ist eine gute Idee, da kann man immer mal gucken. Das ist das beste, das ist, ohnezu denken, das ist das beste Subreddit, wenn man sich ein bisschen über Programmierkramaufregen will. Das ist quasi nur abgeflamen den ganzen Tag. Ja. So, wo sind wir denn stehengeblieben?Ne, hab ich, hab wie gesagt, ich hab was zugelesen, aber ansonsten nichts weiter, ja. Was hältstdu von KMM? Ich überleg gerade, hab ich da schonmal was von gehört? Sagt mir jetzt nix.KMM. Mobile. Oder was? Ach, Kotlin Multiplattform for cross platform mobile development. Ja,das ist wahrscheinlich so ein Müll wie Maui. Bloß für Java. Quasi das Maui der Java-Welt,das kein Mensch braucht. Ja, ja, das ist halt dumm. Das ist Maui. Oder? Die wollen mirdoch damit sagen, die benutzen native Steuerelemente, oder? Dann ist das schon wieder, dann siehtes wieder kacke aus, überall. Also, was heißt kacke aus? Dann sieht es auf einer Plattformgut aus und aus, gut aus. Nicht Schwachsinn, dann sieht es nicht auf beiden Plattformengleich aus. UI ist so 100% native. Ja, das ist ja auch das Problem, was Maui hat, dassdann die Apps unterschiedlich aussehen und du beim Programmieren quasi auf den kleinstengemeinsamen Nennern zwischen Controls zwischen Android und IOS angewiesen bist. Da geht waskaputt. Down Detector. Zeig mal. Oh. Oh ja. Da ist wirklich was am abcutten. Reddit. Bam.Reddit. Am verrecken. Also, das sagt mir nichts. Das sagt mir nichts. Aber das sieht auf denersten Blick ein bisschen so aus wie Maui und von Maui bin ich, also von.NET Maui,da bin ich auch kein, ich bin riesiger.NET Fan, das wisst ihr aber von Maui überhauptnicht. Da hat Alphalonia den besten Ansatz. Oder halt, ganz im Ernst, wisst ihr was ichmachen würde, wenn ich eine Mobile App entwickeln müsste? Ganz im Ernst? Auch wenn ich michvielleicht ein bisschen quälen müsste, aber ich glaube, ich müsste mich damit wenigerquälen, wie mit was anderem. Okay, Flutter, Flutter vielleicht. Nee, ich würde den Javascriptgedürnt machen. Nicht unbedingt React Native, sondern ähm, äh, Dings hier. Wie heißtIonic oder sowas? Würde ich wahrscheinlich machen. Einfach Javascript gedürnt, fertig.Javascript Islamas, fuck, was interessiert es? Für 99% der Apps ist es absolut schnellgenug eine Webseite. Jetzt machen die schon großartig. Die meisten Apps sind übrigensauch einfach nur Webseiten. Wahrscheinlich sind 90% der Apps, die ja außer Mark Gamesoder sowas, ähm, sind wahrscheinlich bei euch von den Apps einfach nur in Apps verpackteWebseiten. Du meinst eine Progressive Web App? Nee. Ich meine eine App im App Store, dieunter der Haube eigentlich nur Browser bzw. Web Technologie ist. So wie 90% der Apps heutzutage.Ich werde wohl ab Mai Tesla fahren. Nice, ich freu mich jetzt schon. Ja, mit Tesla gehtes noch besser als mit meinem Fiat. Ja, Discord ist ein gutes Beispiel für, wobei Discord,an Discord sieht man ja, dass es auch schnell funktioniert. Discord macht es allerdingsziemlich high IQ. Discord macht, wenn du Discord auf dem Desktop installiert hast, wenn duDiscord den Browser verwendet, dann nur zur Hälfte, äh, nicht zur Hälfte, dann weniger,die haben Native C-Module dabei, die sie da irgendwie reingehuckt haben in ihr Node.jsgedürnt. Aber Discord war wirklich clever. Das muss ich jetzt mal sagen. Also, die Discord-Leutewaren wirklich schlau. Und die waren aus einem Grund schlau, dass die gesagt haben, wir macheneine Web Anwendung. Das hat nämlich gerade, also ich meine jetzt nicht allgemein, sondernwirklich genau im Bezug auf Discord. Das hat wirklich für die riesige Vorteile gebracht.Überlegt euch mal, das Ziel von Discord war, gut ich weiß nicht, was sie hinter in ihrenMeetings gesagt haben, aber ich rate das jetzt einfach mal. Das Ziel von Discord war ja prinzipiellerstmal eine Cross-Platform-Messaging-Voice-Chat-App-Kombination zu entwickeln. Cross-Platform war wichtig.Die wollten, dass das läuft im Browser, auf Mobile, auf iOS, auf Android, auf Flinux,Windows, alles. So. Und wisst ihr warum die schlau waren, dass sie einen Browser genommenhaben? Überlegt euch mal, wie abartig das gewesen wäre, das ganze Audio-Video-Zeug aufjeder Plattform neu zu implementieren bzw. über die Native-ARPies zu machen. Die hättenhier allen Ernstes dann für Linux, mal ganz davon abgesehen, sie müssten eh dafür sorgen,dass es im Browser läuft. Weil der Einstieg heutzutage ist zu 90% im Browser. Es gibtbestimmt Leute, die verwenden heute noch ausschließlich Discord im Browser.So. Und überlegt euch mal, die hätten eine Web-Anwendung programmieren müssen, was mitNative-IOS-ARPies, was mit... und da kommen sie nicht drum herum. Also, ich habe ja gesagt,ich würde irgendwie sowas wie Ionic oder sowas nehmen, wenn ich eine Mobile-App machenwill. Wenn du sowas, Audio-Video und relativ tief ins System integriert und Sonderfälleabfangen willst wie Discord, ich glaube, dann wird es schwierig mit so einem Gedöns. Diehätten ja irgendwelche Native-Apps entwickeln müssen. Aber nein, die haben gesagt, wirnehmen einfach was Chrome-basiertes und benutzen alles das, was Chrome schon fertig gebauthat, was Audio-Video angeht. Und das ist eine Menge. Überlegt euch mal, die hätten fürX, die hätten X11-Zeug programmieren müssen unter Linux, Alter. PULS-Audio unter Linux,Kacke. Alter. Discord hätte dicht gemacht nach der zweiten Woche, als sie angefangenhätten, das zu programmieren. Wer zum Teufel will was für X programmieren oder was fürPULS-Audio freiwillig? Wer ist so gestört? So. Und die waren wirklich clever, dass siedas im Browser gemacht haben. Die hätten ewig gebraucht, das wäre nicht rausgekommen.Und so haben sie eine Fliege mit einer Klappe erschlagen, sie haben eine Web-Anwendung,sie haben Native, iOS, Android, Linux, Windows und Mac und alles auf Chrome-Basis. Die warenwirklich clever, was das angeht. Mit einem HBA? Nö. Warum? Warum soll ich? Ich hattein der alten Kiste, in dieser 4HE-Kiste, die man hier unten auf dem Boden legen sieht inmeinem Track, da unten hier, die hatten einen HBA. Hier, da, guck. Einen SAS-Controllermit 12 Ports oder sowas dran gehabt. Ne. 5, 10, 10 Ports? Glaube 10 Ports. Einen SAS-Controller.Ja. Aber das habe ich ja mittlerweile abgeschafft, das Ding. Du hast sogar vor, einen kleinen2-Achsen-Motor zu bauen? Automatisches Laden. Ok, ich habe keine Ahnung, wie, was das,wie, was du bauen willst. Kann ich mir nicht vorstellen. Willst du den Stecker automatischrein und rausfahren oder was? Den Lade-Stecker willst du den ins Auto reinstecken lassenvon der Seite automatisch mit Motor oder hä? Ok, Moment, das muss ich mir mal angucken.Oh, das sieht abenteuerlich aus, Leute. Was ist denn das? Sekunde, das sieht abenteuerlichaus. Das muss ich mir jetzt angucken. Warte mal. Warte mal, ich war ein bisschen lauter,dass ich was verstehe. Was zum? Ok, was sehe ich da? Lass mal kurz gucken, bevor, ich mussjetzt mal versuchen zu verstehen, bevor er mir das zeigt. So, der Typ hat Windows 11,das ist mir schon mal unsympathisch. So, das ist eine Lampe, wahrscheinlich, das ist eineLampe. So, das hier ist ein Motor, der, das hier nach vorne klappt gleich. Das ist soein Ding, womit man auch Türen aufmachen kann. Das zieht hier zusammen und dann klappt dashier, dann klappt das hier nach zur Seite. Zumindest würde ich das so einschätzen. Undhinten ist Steuerungskram. Ok. Oh, ist da eine Lampe? Ist das überhaupt eine Lampe? Da hättestdu Angst um den Lack? Ne, glaube ich, musste nicht. Der schiebt ja den Charger rüber undder Charger ist ja Plastik und vorne Gummi. Na gut, mit genug Wumms. Das da vorne istdas Charger-Kabel. Alter, Six Hand. Mit TensorFlow! Das heißt auch noch Machine Learning-Kramdabei. Und für was ist das Machine Learning jetzt genau? Das hab ich nicht gecheckt.Ok. Ok, der nimmt Bilder von seinem Auto auf und lässt damit Machine Learning trainieren.Aber, aber warum? Ah, das ist, dass er automatisch lernt, wie er, na gut, man könnte, das isteigentlich ziemlich Six Head. Wisst ihr warum? Das ist ziemlich clever. Das ist wirklichclever. Weil ansonsten müsste der ja immer an der gleichen Stelle parken. Und so hatsein Raspberry Pi gelernt, wie der Charging-Port aussieht vom Auto und egal wie er parkt, kanndas Ding sich automatisch andocken, weil er immer den Charging-Port findet. Das ist schlau.Six Head. Quatsch schon. Quatsch schon. Fourteen Head. Automatische Meditation, genau. Btw.Es ist meistens eine blöde Idee, mit dem Finger GPIO-Pins kurz zu schließen. Meistensmacht das nichts, meistens passiert da nichts. Meistens erwischst du auch nicht gerade irgendwieden 5-Volt-Pin und gehst auf ein GPIO-Input oder irgendwas. Aber es ist in der Regel einedoofe Idee, mit dem Finger GPIO-Pins kurz zu schließen. Das kann schon mal in die Hosegehen. Aber bringt das so viel? Steckereien ist jetzt nicht so auffällig. Naja, der Steckereien,der muss ja an der richtigen Stelle angesetzt werden, je nachdem wie tiefer in die Garagegefahren ist. Also sprich, wenn er ein bisschen weiter vorne ist, dann wird es ja nicht passen.Da muss jetzt quasi automatisch erkennen, wo der Lade-Port ist und dann mit diesem Klappmechanismusdas einfädeln. Bin mal gespannt, wie das funktioniert. Warum er das nicht händischmacht? Ja gut. Das verstehe ich auch nicht. Weil es geht wahrscheinlich. Weil es coolist, wenn du reinfährst in die Garage und auf einmal kommt so ein Greifarm und schiebtein Auto. Ich höre was moveen. Ne, der Greifarm zertratzt nicht ein Auto. Er hat doch einUltraschall-Sensor dran, der den Abstand zum Auto misst. Das ist das Auto nicht beschädigt.Okay, das Ding macht ein Foto und dann guckt er, wo ist der, das heißt nicht Spiegel, wieheißt denn das auf Deutsch? Ich glaube, das heißt auch Reflektor, oder? Als so ein Ding,wo man im dunklen halt was besser sieht. So was, was man am Fahrrad hat. So, der sucht,wo der Reflektor ist. Das ist das Schlau. Sixhead.Aber wie geht denn der Charger auf? Ist da nicht eine Klappe? Oder klappt die automatischauf? Mit über die API, ja. Schlau.Wie er das trainiert hat, ich denke mal, der hat einfach ganz viele Fotos von seinem Autodurchlaufen lassen. Gleich geht's rein, genau.Sieht ja schon ein bisschen unanständig aus.Ich mein, es dauert ein bisschen, aber das ist ja nicht wild.Geh mir den Deck rein.Das ist mal wirklich nächstes Level hier.Das ist ja geil. So, und der Tommy hat das geschehen. So was willst du dir selbst bauen?Das stelle ich mir sehr aufwendig vor. Also da bist du bestimmt ein paar Wochenbeschäftigt, bis das funktioniert. Aber es ist auf jeden Fall ein schönes Bastelprojekt.Ja, ja, das musst du uns zeigen, unbedingt, wenn es fertig ist.Die Frage ist halt auch, wie kannst du das überprüfen? Mega beispielsweise hat er früher auch gesagt, sie können gar nicht sehen, was da eigentlich drauf ist. Keine Ahnung.Ich würde Cloud Storage nur verwenden, wenn ich selbst verschlüssel. Und nicht die das verschlüsseln.Was spricht denn dagegen, irgendeinen x-beliebigen Cloud Service zu nehmen und selbst zu verschlüsseln?Ach so, weil du sünden willst, das heißt, du bräuchtest dort irgendwas, was wieder decrypten kann, dann geht es auf Mobile schon mal nicht richtig.Ja, okay. Wahrscheinlich ist das das Problem.Wahrscheinlich, weil die Bilder irgendwie zwischengespeichert werden bei irgendeinem CDN und da ist es halt langsam gerade.Na, es ist jetzt für die Heim, für die Heim doch nichts. Ich will hauptsächlich ein paar Container laufen lassen, eine VM, ich will Samba Shares über das Webinterface einrichten, es ist was, wenn du hauptsächlich VMs erstellen willst, will ich doch gar nicht.Ein Kotlin Stream.Irgendwann Leute, irgendwann machen wir auch mal Java im Stream.MonkaSMeine Frage, wie wechselst du immer zwischen deinen Desktops, wenn du in einer VM arbeitest und dann auf Windows wechseln willst? Ganz einfach, zeige ich dir schnell.Guck mal da, da ist die VM, hier ist das, was wir gestern gemacht haben, also ich drücke, wir fangen anders an, wir sind auf Windows, die VM habe ich auf dem 2. Desktop, der 3. Desktop ist leer, die VM ist auf dem 2. Desktop und es gibt in Windows ein eingebautes Shortcut,das ist Ctrl, Windows Taste und dann mit den Pfeiltasten links und rechts die Desktops durchswitchen, wahrscheinlich kann man das irgendwie in den Untiefen der Registry umstellen, keine Ahnung, das ist aber Default, das kannst du auch machen, DrZombie, das funktioniert bei dir auf jeden Fall, weil das ist Windows Default.So, ich habe einfach mehrere Desktops und auf dem habe ich Linux, so und jetzt ist die Sache folgendermaßen, wenn ich dorthin switche, auf den Desktop, dann ist easy, dann klicke ich rein und mache hier was und dann geht das, wenn ich raus will, dann geht ja die Windows Taste nicht, guck, wenn ich Ctrl, Windows, Pfeiltaste drücke, dann kommen irgendwelche Escape Dinger in der Shell.Also, was muss ich vorher machen, ich muss vorher drücken, Ctrl, Alt, Ctrl, Alt, nimmt den Fokus aus der VM und dann kann ich direkt nacheinander wieder die Windows Taste verwenden und nachdem die Taste direkt nebeneinander sind, geht das schnell, guck, Ctrl, Alt, Ctrl, Windows und Pfeiltaste rein, easy.Das kannst du auch machen, das muss übrigens nicht VMWare sein, du kannst ja auch genauso gut VMWare Player oder Virtual Box oder irgendwas nehmen, du musst bloß dir die Tastenkombination merken für, wie release ich den Fokus von der VM und dann machst du die Windows-Standard-Taste.Ja, wenn du in der VM drinne bist, die Desktops durchswitchen halt, so wie das der jeweilige Desktop-Manager in der VM gerade mag, oder Ctrl, Windows, um die VM zu eskämen, ich glaub nicht, dass du das beides binden kannst, dann geht wahrscheinlich das andere nicht mehr.Also was ich früher gemacht hab ist, ich hab meine Mouse verwendet, beziehungsweise die Scripting-Software von der Mouse, dann hab ich quasi die Knopfbuttonpresses simuliert, aber ganz ehrlich, ich hab mich jetzt einfach dran gewöhnt, ich druck jetzt ganz schnell nebeneinander, Ctrl, Alt, Ctrl, Windows, zack.Ja, aber ich glaube, du kannst es nicht auf was legen, was schon benutzt ist, weil das kommt doch garantiert in die Quere.Ach, das geht ja, ja, dann ist Geschmackssache, wenn das geht, guck mal, der Chat sagt, das geht, der Chat hat ja immer sowas prinzipiell immer recht und leckt nie critical information.Warum unterschiedlich UI schlecht ist? Okay, das ist jetzt, das ist so ein bisschen was, wie man das aus einem Vorlieben hat, also, da muss ich jetzt mal versuchen, das zu erklären, also, du kannst ja, wenn du UI-Frameworks entwickelst, du kannst dir ja prinzipiell zwei verschiedene Ansätze fahren, entweder, du machst so ein Meta-Framework, was die ganzen Steuerelemente der jeweiligen Plattform quasi abstrahiert, also zum Beispiel,ähm, keine Ahnung, das Fenster, ja, und der Windows sieht das, und der Windows muss man das so machen, und der Mac sieht das anders aus, und der Linux siehts nochmal anders aus, oder so ne Input-Box hier zum Beispiel, ja, oder der File-Dialog oder sowas in der Richtung, ja.Das sind ja quasi so Native-Steuerelemente, oder hier, die, die, die, die Winno, die, wie nennt man das überhaupt hier, diese, diese Settings-Leiste da oben. So, das sieht unter Windows anders aus, als unter Mac aussieht, anders als unter Android aussieht, anders als unter iOS aussieht.So, da gibt's den Ansatz, du machst so ein Meta-Framework, in dem du quasi sagst, ich mach das so, dass unter der Haube immer noch die Native-Steuerelemente verwendet werden, also die Sachen aus Windows und Mac und die Sachen aus Android und iOS, und mach das aber so, dass man's über eine Schnittstelle ansteuern kann.Unter der Haube verteilt das mein Framework so, dass die jeweilige Plattform richtig funktioniert, aber derjenige, der's programmiert, der muss halt nur eine Textbox machen, anstatt eine Textbox für jede Plattform zu programmieren.So, das ist insofern ganz nice, weil die Anwendung dann überall aussieht, wie als gehört sie eben auf die Plattform, ja, das sind Steuerelemente von Windows unter Windows und Steuerelemente von Mac unter Mac und so weiter, und trotzdem ist die Codebase relativ kompakt, weil du's ja nur einmal programmieren musst und ja, dein Framework macht das dann für die ganzen Plattformen.So, das ist, an sich könnte man denken, ganz cool, aber das hat natürlich auch seine Nachteile, nämlich, du bist auf dem kleinsten gemeinsamen Nenner, also sprich, wenn du jetzt zum Beispiel, machen wir irgendwie mal Control Panel oder irgendwas auf, ja, wenn jetzt diese komische Textbox unter Windows die Möglichkeit bietet, was zu kopieren und die unter Mac nicht, ja, was machst du dann?Baust du dann ne Funktion ein, machst du dann wieder ne Abfrage, ist es Windows, verzichtest du auf die Funktion, weil es der kleinste gemeinsame Nenner eben nicht kann, ich weiß nicht, ob KMM das nicht so macht, hat sich zumindest so gelesen, also was machst du dann, das ist insofern ganz nice, aber da fangen die Probleme dann schon an.Und du hast auch das Problem, dass die Anwendung nicht überall gleich aussieht, das heißt, du musst dann trotzdem wieder, an manchen Stellen, so Betriebssystem-abhängige Optimierungen machen, weil zum Beispiel, ist halt unter Windows eventuell Hardcoded um diese Textbox ein blauer Rand, aber du willst keinen blauen Rand, weil dann dein Button nicht stimmt.Und da unter Android ist dann beispielsweise kein blauer Rand, deswegen musst du die ganze Sache wieder zwei Pixel nach links schieben, also du musst dann im Endeffekt doch wieder, je nachdem wie gut das Framework gemacht ist, paar Optimierungen machen, zumindest eins ist klar, die App sieht dann nicht überall gleich aus, was dann wieder zu Problemen führen kann, weil die unterschiedlichen Betriebssysteme haben ja auch unterschiedliche Bedien-Guidelines, ja, beispielsweise unter Android ist es ganz beliebt, dass du hier unten diesen komischen, äh,Enden-Knopf hast und hier oben irgendwie so ein Sidebar-Menü, das hast du ja unter Windows standardmäßig gar nicht.Also das sind so die Probleme, die du hast, wenn du so ein Meta-Framework verwendest, sowas wie MAUI zum Beispiel,.NET MAUI, die versuchen sowas zu machen, das ist meiner Meinung nach eine blöde Idee.Ja, du hast den Vorteil, es sieht alles native aus, aber halt mit den Nachteilen der ganzen Plattform und dass du eben, dass es nie so aussieht, wie du es wirklich aussehen möchtest.So, der bessere Ansatz meiner Ansicht nach ist, man malt seine Controls selbst, das sieht dann zwar nicht so richtig krass native aus, aber die Leute sind heutzutage eh an Webseiten gewöhnt.Also, du schockst heute keinen mehr, wenn eine Anwendung aussieht wie eine Webseite und wenn du was hast, was die Steuerelemente selbst malt, dann sieht die Anwendung halt unter allen Betriebssystemen eben so aus, wie sie ja aussehen soll.Und du bist auch nicht darauf festgelegt, dass die einen können rechtsklick, copy, paste, die anderen nicht, es ist dann halt einfach so.Deswegen finde ich es ganz gut, wie das beispielsweise Avalonia macht, oder Flutter macht, oder jedes gescheite UI Framework macht.So, ja, also eins von beiden muss es ja sein letztendlich, was KMM macht. Nee, naja gut, ich scroll mal kurz runter, dass ich noch finde wo wir stehen geblieben sind.Also wenn die das nicht so machen, Alter habe ich viel Text, wenn die das nicht so machen, dann musst du für jede Plattform einzeln das UI machen. Und dann hast du ja wieder von so einem einheitlichen UI Framework nichts, wenn du für jede Plattform das UI selbst machen musst.Da kannst du die gemeinsame Funktionalität vielleicht in irgendeine Library packen, aber musst jede Plattform wieder native das UI basteln und dann mit deiner Library irgendwie verknüpfen.Ja, das sieht dann vielleicht cool aus, aber du musst dir Gedanken dazu machen, dass die App auf jeder Plattform ständig so quasi nach den aktuellen Plattform Richtlinien ist und dass alles auch richtig funktioniert.Das heißt, du hast dann eine native Android App, eine native iOS App, eine native Windows App, eine native Mac App und tja, native Linux App in der Form, schwer zu sagen, was da eigentlich native ist und da hast du jetzt auch nicht so wirklich viel Arbeitserleichterung von, oder?Ja, das ist dann zu native Code Kombi, das leuchtet mir ein, aber das ist halt ein ganz schöner Aufwand und genau aus diesem Grund würde ich irgendwie sowas wie Flutter oder eben Ionic React Native oder irgendwie sowas verwenden heutzutage für übergreifende Mobile Apps.Sieht überall gleich aus, funktioniert überall gleich und du kannst mehr oder weniger alles mitmachen, was du für die meisten Apps brauchst, aber das ist keine native UI, ist doch egal, Hauptsache, die lässt sich gescheit bedienen und die User benutzen das und geben Geld aus, da drin.Ja, du kannst in Flutter verschiedene Views machen, das ist richtig, aber Flutter zeichnet soweit, ich weiß immer, die Steuerelemente selbst, das einzige, was die haben, ist verschiedene Skins für die Steuerelemente.Das ist eine Verfeinerung von dem einen dieser zwei Fälle, die ich gesagt habe. Du kannst ja auch die selbstgezeichneten Steuerelemente etwas so skinnen, dass sie ähnlich der native Platform aussehen.Ja, natürlich, dann gibt es immer so ein paar Dinge, die nicht so ganz passen, aber das geht und du hast trotzdem die Probleme nicht mit ein paar Pixel falsch und sowas.Da musst du immer aufstehen, also ich stehe 7 oder 7 bis 7.30 Uhr auf, wenn ich Home Office mache und wenn ich auf die Arbeit gehe, auch in dem Dreh.Also immer so, früher bin ich 5 vor 45 Uhr aufgestanden, Alter.Weiß gar nicht, wie ich das ausgehalten habe.Ach ja, PWAs, zum Thema PWAs, wenn ich jetzt gerade schon ein bisschen am Ranten über Apple und sowas bin, bzw. nee, fange ich jetzt mal an zu ranten über Apple.PWAs unter iOS sind einfach übelste Abfall. Die sind nicht cute, auch wenn das heute Cute Stream ist.PWAs unter iOS funktioniert die Hälfte nicht, wo man eigentlich davon ausgehen würde, dass die im Jahr 2022 funktionieren sollten, aber das gibt es nicht.Wer es genau wissen will, geht auf Can I Use und lässt sich mal ein paar Sachen, ein paar PWAs auflisten, wobei ich nicht weiß, wie das ist.Und da werdet ihr feststellen, tja, es geht einiges halt einfach unter Safari nicht.Und nachdem es unter iOS keinen anderen Browser gibt, außer Safari, ist es halt mit PWAs unter iOS nichts.Hier, Safari iOS. Safari iOS hat halt bei vielem so ein paar Probleme.Und manches geht in Safari, allerdings nur in Safari. Im Safari Safari und nicht im Safari Webview. Manches geht nur im Safari, wenn du den Safari aufmachst.Aber ganz ehrlich, Apple hat keinerlei Interesse an PWAs. Die haben wirklich das Mindeste nur implementiert.Natürlich ist das gewollt. Was heißt gewollt? Ja, es ist gewollt, aber ein bisschen unfähig sind sie wahrscheinlich auch.Du hoffst, dass eine EU-Regulierung kommt, dass Apple andere Browser zulassen muss.Ich glaube, bis die EU überhaupt verstanden hat, dass es unter iOS nur einen Browser gibt, dafür gehen noch 20 Jahre.Weil dann kommt dann irgend so ein komischer Typ aus dem EU-Parlament und sagt, wie ich hab doch Firefox bei mir auf dem iPhone.Es gibt doch Firefox auf dem iPhone, wo ist denn das Problem? Da gibt's schon Entwürfe, wirklich?Das wäre auf jeden Fall nice, wenn es einen richtigen Firefox unter iOS gibt. Oder auch vielleicht einen, eigentlich nur einen Firefox, was anderes gibt es ja nicht.Es gibt ja außer Firefox nichts mehr. Es gibt im Endeffekt Chrome und auch noch ein neues Alpha 4 Games Video, das können wir uns nachher angucken.Es gibt Chrome bzw. Plink, Plink heißt es ja korrekterweise, Plink. Ist es unter Mac OS ein richtiger Firefox? Ja, ist es.Es gibt Plink, das ist quasi die Browser Engine von Chrome. Es gibt Firefox, Gecko oder wie das heißt. Und es gibt WebKit, das ist Safari.Also eigentlich, ja gut, es wäre cool, wenn es Chrome und Firefox da unter iOS gäbe, einen richtig echten Chrome und Firefox. Das wäre nice.Opera Gaming Browser ist Chrome. Oder unter iOS halt ist Safari.Ich finde Teams ist tatsächlich ganz brauchbar irgendwie.Das stimmt, da hast du komplett recht. Wenn du es mit Teamspeak vergleichst, ist Discord lahm as fuck. Man muss aber mal Teamspeak vergleichen, ich meine ernsthaft.Vergleicht mal das, also rein von der UI her und den Möglichkeiten mit dem da.Also ich mein, da sind schon so 20 Jahre dazwischen oder? Aber ja natürlich, Teamspeak ist immer ein vielfaches, ja TS5 ist mit Sicherheit auch langsamer, wenn ich mir das UI angucke.Garantiert. Das ist wahrscheinlich auch langsamer, das ist unter der Haube wahrscheinlich auch nur ein Browser.Irgend ein Webview oder so. Aber solange sie ihre Audiosachen native lassen, ist ja alles gut.Aber das stimmt schon, Discord ist ein bisschen langsamer, man darf aber nicht vergessen, erstens Discord ist wie gesagt ein Browser und zweitens, Discord macht halt auch ganz schön viel im Hintergrund.Also beziehungsweise, was heißt im Hintergrund, im Hintergrund auch, wenn du da in 200 Channels bist, aber Discord kann halt auch ganz schön viele Funktionen.Und ich finde dafür, dass es eine Browser Anwendung ist, die so viel kann, ist Discord tatsächlich wirklich erträglich. Discord ist wenn es geöffnet ist eigentlich relativ gut zu benutzen.Nee Discord kannst du nicht selbst hosten.Das einzig doofe an Discord ist halt, dass die Startzeit relativ lahm ist, aber das geht auch, wenn du es mal gestartet hast und das alles schön gecached ist.Und ansonsten, dass es halt mal die üblichen Verdächtigen wieder gibt, von Channels nicht verfügbar, Server nicht verfügbar, Message kann gerade nicht verarbeitet werden und sonst was.Ja, aber im Großen und Ganzen funktioniert Discord erstaunlich gut, was wahrscheinlich auch der Grund ist, dass Discord so diese Dominanz hat.Was ist eigentlich aus dem Discord Game Store oder so gewesen, was es mal gab?What happened to the Discord Store?Ah, Nitro Games ist wieder weg. Okay alles klar, hab ich gar nicht mitgekriegt.Ja tschüss.Vielleicht gucken wir uns das wirklich irgendwann mal an. Teams auf Linux, ich verwende Teams nur im Browser.Das funktioniert unter Linux genauso gut wie unter Windows. Native Klein kann ich nichts zu sagen.Wobei der Native Klein ja eigentlich auch nur ein verpackter Browser ist. Moin Sirius Max.Muss man, ich muss mal. Tauri ist dieses Elektron, was den Native Webview verwendet.Oder nie angeguckt weiter.PortAudi, ist das irgendwas Apple-mäßiges?Na doch, gibt es ja.Naja, nee, gibt es eigentlich nicht wirklich.Eigentlich nicht wirklich.Es gibt eigentlich kein gescheites Plattform-Übergreifungs-UI-Framework, es gibt Flutter, das ist super für Mobile.Allerdings auf dem Desktop, naja, naja.Es gibt Qt, das ist auf dem Desktop ganz okay.Aber Mobile, naja.Es gibt Maui, das ist immer crap.Und es gibt halt tatsächlich browserbasierter Kram.Das ist das Beste, was es aktuell gibt für wirklich echtes Cross-Plattform.Deswegen habe ich ja vorhin gesagt, deswegen war Discord ja auch so clever zu sagen, wir fangen erst gar nicht an damit,sondern nehmen einfach einen Chrome und packen den als eigene Anwendung ein.Matrix, Dankeschön für den Sub. 20 Monate Massive Subscription hier.Im Backend ist Discord blazingly fast. Wie ist Discord etwa written in Rust?Ist das denn möglich überhaupt?Blazingly fast kann ja nur written in Rust sein.Aber ich habe noch nie gelesen, dass Discord back-end-technisch written in Rust wäre.Vor allem warum?Wollen die fünfmal länger brauchen für alle Features jetzt, weil sie es in Rust programmieren?Gut, ich meine, man kann ja kritische Parts durchaus in Rust programmieren.Hast du an deinem Server eigentlich ein Monitor angeschlossen oder ein IPME-Modul?Aha, weder noch.Meine alte Kiste hatte IPME bzw. Management-Interface.Ich habe einen.Nee, nicht Spider.Nee, Spider? So?So einen Teil habe ich mir gekauft.Bei Ebay für irgendwie 35€ mal.Das ist quasi ein Remote-KVM, sprich du schließt am Server USB und VGA oder Display anund hier machst du das Netzwerk-Kabel reinund dann kannst du über den Browser das aufmachen und mittlerweileNee, Pika, vor allem wozu? Man kann sich so ein Ding von Apple und Apple bei Ebay kaufen.Und mittlerweile, das ist so geil, könnt ihr euch noch daran erinnern, wir haben daszusammen im Stream geupdatet, dass dieses Produkt ist, ohne Scheiß, ich glaube von 2003oder so.Das Produkt ist ue, ue, ue alt. PC Pro Recommendation, das ist ue alt. Und es gab letztens erst nochein Firmware-Update mit einem HTML5-Interface, muss man sich mal vorstellen.Die supporten das ding einfach seit irgendwie 18 Jahren oder so.Und es gibt ja immer noch vier mehr Updates. Da können sich manche Android-Handys mal was dran abschneiden.Schauen wir mal kurz, wann kam das denn raus?Wann wurde das released, das Ding? Ich meine, guckt euch mal die Webseite an, da siehst du schon. Steht da irgendein Datum drinnen? Date oder so?Ja, ne, ne, ne, ne, ne. Da habe ich den ja schon länger. Das ist ein neues Handbuch.Also ich hatte eine, ich hatte eine Firmware von sonst wann, 2008 oder so.Hier, 2000Release Notes, Firmware, Firmware Release Notes, Leute.20132008, das ist, das ist wirklich uralt und letztens, ne, die sind, die kosten nicht viel auf Ebay.Spider-ManOh, ohMonkeys, aktuell kosten die aber wirklich einiges.Okay, dann ist es keine gute Idee, die aktuell zu kaufen.Leute, ich habe die mega billig auf Ebay bekommen.Ich meine, ich gebe 800 Euro dafür aus.Ha, das ist ja ein Schnapper, das ist ja ein Schnapper. 843 Euro plus 271 Versand.Beendete Angebote, wo macht man das?Ich, ich kenne mich, ich kenne mich bei Ebay nicht aus. Die haben mich nicht umsonst gebannt, bei Ebay kleiner zeigen, nicht bei Ebay.Wo, wo macht man das?Links?Links?Beendet? Aha, beendete Angebote, exzellent.109,40, es istJa, da kommen wir schon eher, da kommen wir schon eher in die, in die Richtung.Naja, kann doch sein. Ich habe das für paar, ich habe das für paarunddreißig Euro gekauft vor ein paar Jahren und jetzt kostet es halt 75.Ist haltalles teurer.Ja, so ein Teil habe ich da, wenn ich da mal wirklich dran muss, bei Maus und Tastatur und Bildschirm, dann mache ich es über dieses Teil.Ansonsten, ich kann auch einfach, das ist ja hinter mir, sonst kann ich auch einfach an meine Capture-Card in HDMI-Kabel stöpseln.Sag mal, wie, wie, wie, wie, wie weit hinterher bin ich eigentlich mit dem Chat?Okay.So, das ist, da ging es um das Video.Ist es schwer, KI zu entwickeln? Kommt drauf an, was man als KI definiert, aber wenn du sowas wie TensorFlow meinst, das zu benutzen geht, aber sowas auf die Beine zu stellen, ja.Ja, da bist du auf jeden Fall ein bisschen beschäftigt mit.Was ist denn mit meinem Android? Ich habe geupgraded auf 6.11 und seitdem kann ich USB-Geräte nicht mehr richtig durchreichen.Das ist ein unfähiger Haufen dort, ey.Ja, das kenne ich, das kenne ich.Das ist so ein Unfall, das ist so ein Unfall.Also, ich habe da, ich habe da, ich habe da, das ist so ein Unfall, wieso?Ich habe da, ich habe da, das ist so ein Unfall, das ist so ein Unfall.Also, ich habe da, ich habe da, das ist so ein Unfall, das ist so ein Unfall, das ist so ein Unfall.ich das kenne ich es gibt es gibt manche aber das gab es für ios nichtirgendwo irgendwas hatte ich irgendwas war ein problem ich habe mir das auchmal angeguckt hast du mal die neue light red thread api von java gesehen ist dasirgendwas schickt man ein link ist das was zum keckenwie speicher ich 200.000 characters text in postgres einfach als blob fertig oderals jason kannst du speichern speichern als speichert als jason objekt wenn dunoch ein bisschen mehr dazu speichern willst ansonsten kannst du einfach alsals als text speichern war ich das nie gemacht habe ehrlich gesagtda bin ich nicht der richtige für was datenmarken angeht total angenehm nicees ist ja heute auch gut streben haben hast du zugriff auf feil vielleicht jadas ist natürlich die bessere variante ja das feil speichern und nur den fadin die datenbank schreiben aber du kannst auch den was halt was halt in den blobund gut istoder eben wenn du noch ein bisschen mehr informationen speichern also wenn esein wenn es wirklich ein jason objekt ist dann guckt ihr mal den jason supportin postgres anders ist ziemlich gut mittlerweile prine dankeschön für dentimeout keck aber bei 2,5 punkte rausgehauen okübrigens du kannst mit postgres text indizieren ohne den text selbst in derdatenbank zu speichern das geht du kannst den index aufbauen mit dem textaber den text muss nicht in der datenbank speichern ist es frech wennwo davon nur 480 m mit schatz 1000 liefert heute frisch getestet vom kabelhinter den wehren vom wlanvom wlan kannst du das net testen du hast doch keinen wlan was das schafftoder hast du es auch mal mit einem kabel angeschlossen getestetweil wlan kannst du das nicht ausprobierenso ich muss mal mit den chat ein bisschen aufholen wie gesagt zu sieben uhr rumwenn man schon mal seltsam ui geht und hat schon mal web swingernsthaft so was gibt es swing an sich ist ja schon richtig richtig 5 gigahertzdu meinst nee nur weil dein wlan 5 gigahertz ist heißt es nicht dass dugigabit drüber kriegst du kannst in der theorie über wi-fi 6 und sogar schonüber wi-fi was ist es i triple i 802.11 ax und i triple i 802 11 punkt ac wardas davor also ich glaube du kannst es schon seittheoretisch gigabit übertragen aber in der praxis funktioniert das natürlichnicht niestandards standards gucken wir mal so i was das für eine seite ich habe esgedacht china aber es ist in der schweizalso hier seit ac kannst du theoretisch gigabit übertragen und seitwi-fi 6 bzw ax kannst du bis zu 10 aber leute vergesst das ist alles schönezahlen aber in der praxis können es einfach mal vergessen und wirklich denspeedtest zu machen über wlan ist immer fragwürdig speedtest immer über kabelund bei einem gigabit anschluss muss man sich auch mal überlegen wie aussagekräftig ist der speedtest findet man überhaupt einen server der mal nebenbeigigabit zu einem überträgt da müsste man eher ein download test mal machenper kabel und mehrere verbindungen aufmachen am besten noch zu mehrerenzielen und das dann zusammen rechnen also web swing klingt ganz ähnlich ja warich meine wenn man äpplitz monka ist ich dachte über java äpplitz sind wirhinaus oh nee oh nee please please no no please no nee nee nee das schrecklichaber plus auf ich sagte auch selbst mit wi-fi 6 kannst du komplett knicken alsowlan testen ist ist nichts internet speedtest mit wlan wenn man wirklichwissen wir das maximal drüber geht ist nichts also ich würde empfehlen kabelanschließen und dann am besten auch mehrere downloads starten zuunterschiedlichen zielen das am ende zusammen rechnen dann hat man noch sodie realität den realistischsten eindruck ja ich möchte mich mal alsknub auch was bedeutet eigentlich native in der regel ist damit gemeint dass manalso in dem fall wo wir über über ui elemente geredet haben ist gemeint dassman die sachen verwendet die jeweilige plattform eben mit liefert also zumbeispiel ein native steuerelement unter windows ist zum beispiel der datei öffnendialog das ist ein das ist der windows native datei öffnen dialog und derlinux sieht anders aus und der mac sieht anders aus und der android siehtanders aus und der ios sieht anders aus aber jede plattform hat eine art dateiöffnen dialog und das hier ist der native windows datei öffnen dialog dasist der den windows mitbringt es hält keinen davon ab eine anwendung zubauen die einen datei öffnen dialog selbst mitbringt ja aber das ist dernative windows datei öffnen dialog und wenn man den verwendet dann verwendenwir den den windows mitbringen oder das hier ist eine native windows menüleisteund und und und und das hier ist höchstwahrscheinlich kein nativewindows button sondern irgendwas selbstgemaltes von firefox ob das hierüberhaupt das hier überhaupt mit native windows fenster ist wäre ich mir schongar nicht mal so sicherhast du bei klein anzeigen eine dsg vo anfrage gemacht schon antworten ach neehabe ich gar nicht mehr dran gedacht tatsächlich ja das wollte ich machendas müsste ich wirklich mal machen allein schon um die abzufackenund was bedeutet cloud native password bingowo jeder was anderes darunter verstehtmit dem kvm müsste es doch auch über den rest of the pie gehen oder waswas das kann man das aufmachenatem fang ja ja momenten in den verbindet ihren kvm switch mit dengrafiken du brauchst noch ein kvm switch von denen das ding hat kein webinterface wo du drauf gehen kannst du brauchst wahrscheinlich auch in 800euro kvm switch von denen wo du es damit verbindest das wird nicht funktionierenso ich habe den chat geschafft nice so jetzt können wir uns mal videosangucken da steht vga und hat aber usb mit dranwhy naja für tastatur und maus zu simulierendu willst ja nicht in den bild über tragen du willst ja auch inputs machenkönnen ich meine ist schön wenn du ins biosreinkommst aber im bios was einstellen können wir noch besseraber dann ist es nicht nur fauke ja ja das ist halt anzeige an an so wir guckenwas haben wir denn 7 things no programmer ever wants to hear das istgutes gucken wir uns jetzt an habe ich doch bestimmt schon auf hierfeier schipp beste beste witz software engineer socks i was told i would beworking in a fast-paced exakt aber es macht trotzdem bock das ist auch so einding ja es sagt aber es macht trotzdem bockgibt es gibt es noch mehr in a software engineer socks i was told i would beworking in a fast-paced exciting environmentalso in reality i'm stuck in this cubicle building super komplex stuffdenn ob wir es den chat meine frage ist das bei euch habt ihr großraumbüros undwenn ihr großraumbüros habt habt ihr da wirklich komplett offen oder habt ihrdann auch angefangen trennwände reinzustellen vncaber vnc geht ja nicht mit vnc ins bios kommen mit mit festen trennwänden okalso bei uns ist es so wir haben früher mittelgroße büros gehabt da saßen einpaar leute drin aber die war nicht wirklich so voll da saßen dann fünfleute oder so drinnen in dem büro jetzt haben wir relativ große büros ja alsogroßraumbüros nur dass ich schon nach den ersten ein zwei wochen die leute soabgefuckt haben gegenseitig weil die leute telefoniert haben und der einesteht rum und labert und so dass wir jetzt trennwände haben also wir habenjetzt trennwände zwischen den einzelnen sitzreihenes sind keine cubicles bei uns aber es sind trennwände zwischen den sitzreihenalso man ist ins großraumbüro gegangen nur um festzustellen großraumbüro sagtum dann wieder fake trennwände einzuziehen richtig nice geil undtrotzdem ist es teilweise noch richtig nervigzumal großraumbüros ja mittlerweile bei vielen schon wieder nicht mehr im trennsind da fangen wir jetzt mit an ok also feier schipp erzähl uns wasappreciates if i had a time machine i would do two things one i would tellrambe to get away from that kid ja alter dicks outvor herr ramby das ist auch schon wieder fünf jahr her oder sothe time machine i would do two things one i would tell rambe to get away fromthat kid and two i would go back to school to become a civil engineer so icould work outside building stuff everyone admires like bridges andskyscrapers unfortunately i haven't figured out how to build a time machineand javascript yet now i would never recommend anybody choose softwareengineering as a career but if you do make bad life choices like me you shouldbe prepared for some really bad things to happen like every doctor eventuallyloses a patient and every pilot eventually crashes a plane likewiseevery software engineer will eventually face a merge conflict and that's noteven there das stimmt aber das ist nicht wirklich schlimm also meistens nicht95 prozent der mörsch mörsch konflikte sind nicht weiter wildbad in today's video we'll look at seven different devastated text messagesthat no developer ever wants to hear speaking of which i finally started adiscord so feel free to chat with me over there after this video we've gotsome t-shirts and licenses to jetbrain software to get away over there one ofthe biggest problems with software engineering is that mittlerweile gibt esauf feier schippsel art that you don't want your friends and family to find outwhat you do the reason is you'll get messages like this from your uncle orold roommate asking if you want to build an app together it will consist of avery dumb idea that's impossibly complex to execute like uber but for horses ortiktok without the chinese with a five hundred dollar budget messages like thisare so painful because software engineers are usually introverts whohave a hard time saying no what you want to do is respond and say hey that's anawesome idea i would love to build it for you but my rate is three hundreddollars an hour what they'll likely get back with a counter offer of zerodollars per hour but ten percent equity also ganz ehrlich anfragen ich habirgendwie geile app idee kannst du was für programmieren krieg ich von meinenbekannten und die kennt mich ich habe nicht viele bekannte aber selbst dakrieg ich selten das einzige was ich habe ist leute die ich von der arbeitkenne oder die ich auf der arbeit irgendwann mal vielleicht kennengelernthabt ihr jetzt nicht mehr bei uns arbeiten aus dem umfeld ja da tauschtman sich manchmal über irgendwelche coolen neuen ideen aus und manchmal habenwir auch schon so paar kleine sachen gebastelt aber es ist jetzt nicht so dassirgendwie mich einer anruft und sagt übrigens max ich komme jetzt gleichvorbei dann fixen wir die die pumpe im garten und danach programmierst du mirmal bitte irgendwie die neueste neueste neueste app das kommt eigentlich nichtvor also was bei mir öfters der fall ist ist so nach dem motto hast du eine ideewenn ich auf meinem tablet irgendwie den den store aufmache dann sieht es ganzanders aus und solche dinger und meine standard antwort mittlerweile ist immerhabe ich keine ahnung von gerade auch wenn einer mit windows ankommt alsowindows sachen supporte ich prinzipiell nicht da habe ich ja schon bei meineneigenen sachen keine ahnung davon und irgendwelche tablet sachen ist esmittlerweile zunehmend tablet dinger was die leute nicht checken weil die leutehalt kein windows desktop rechner haben sondern tablet und das sage ich auchhabe ich keine ahnung von ganz im ernst ich was weiß ich warum bei der der storejetzt anders aussieht vielleicht wurde ihr account gesperrt oder so kein schimmerich sag mittlerweile habe ich keine ahnung von das ist übrigens auch diebeste antwort die man geben kann weil dann ist ruhe was sollen die dagroßartig erzählen wenn du sagst alter gehen wir weg mit dem scheiß habe ichkeinen bock drauf erzählen sie dir weiter wie schlimm das ist und das jetztgucken muss wenn du sagst ane habe ich keine ahnung von kenne ich nicht wassollen sie sagen soll sie sagen doch du hast bestimmt ahnung davonerdrucker und scanner kriege ich ja nicht mal mehr daheim gescheitencompany which will eventually be worth billions that's pretty much checkmateich würde just recommend accepting the offer and building the app to get themto go away now when you're not building apps for friends and family you should beworking on your own side projects and in doing that you'll likely use the cloudlike aws one of the worst messages you can receive is a cloud billing alertlike hey it's aws your 25 dollar budget has been exceeded by 2.3 milliondollars maybe you click the wrong button or accidently ja das kann ja das kannja in der cloud tatsächlich passieren gerade wenn du functions verwendest diesich vielleicht untereinander aufrufen da gibt es einige reports dass leuteüber nacht aus versehen 50.000 euro und mehr oder 500.000 euro rechnungproduziert haben man muss aber sagen dass die cloud anbieter da meistensrelativ coolant sind das wurde schon öfters als nicht tatsächlich erlassenwenn du das glaubhaft erzählen kannst dass du nicht wirklich vorhattest 500euro 500.000 euro rechnung zu fabrizieren aber trotzdem da muss manwirklich aufpassen also ich glaube es ist nirgends wie so einfach wie in dercloud einfach mal eine halbe million auszugeben die man nicht hattja dann könnte man fragen ihr habt ihr denn kein backup gemachtbackups ist klardeswegen macht es ja auch keiner von hand der noch irgendwie bei verstand istmacht wirklich jemand irgend noch was von hand an der da an der in der livedatenbank mit wir machen irgendwie den in dem in der shell auf und setzen davon hand sql befehle drin ab das macht doch keiner mehrgut vielleicht irgendwelche mayer sql p.a.p. dingerja vielleicht den dampf für den backup oder so okja das ist egalok das sind ganz viele schlimme dinge auf einmal das erste ist angular js unddas andere ist angular js v1 wobei ja viele sagen angular js v1 war das besteangular js ich kann da nicht viel dazu sagen weil ich nie angular js verwendethabe aber was sagt ihr ist das so oder ist das nicht so war angular v1 dasbeste angular also was ich jetzt gehört habe an argumenten ist dass angular v1genau das richtige für die damalige zeit war und irgendwie noch jaübersichtlich zu benutzen war und danach ist angular quasi komplett neugeschrieben worden und total ausgeufert zu irgendeinem riesen business enterpriseframeworkgenau da war es noch angular js heute ist es ja nur nur nur angular noch ja jaangular js gibt es ja dann gar nicht mehr die haben das die haben das jairgendwie um um gewusst es wurde dann irgendwie eingestellt dann ist esangular geworden1.3 1.3 ist ja quasi 1 2 angular 14sable the previous developer died of old age and was the only one who had anyidea how ich glaube ein entwickler bei uns gestorben weil er alt war und wirbrauchen was von ihm gab es noch nicht aber ich habe es euch letztens erzähltdie haben entwickler in der renter angerufen der cobalt zeug programmierthat vor fragt mich nicht sieben jahren oder so code base worked he knew exactlyhow to keep his job by creating an overly complex code base without any commentsor documentation and now it's your turn to update it fuck my life this job willtake more skill and ingenuity than building a nuclear submarine and whenyou finally finish the job in a few years no one will even notice or carebecause by that time it'll be time to migrate your legacy code base into thehot new javascript framework of 2025 speaking of which something a webdeveloper never wants naja dass das aktuell was ist denn das aktuelle trendyjavascript framework ich würde sagen quick oder zumindest was ziemlich vielhype aktuell hat chat was ist das aktuell trendigste javascript frameworkalso ich würde sagen astro oder quick wobei astro ist ja eher ein meta frameworkdas welt schon out du kannst den javascript von ausgehen wenn es älterist als ein zwei monate ist es out blames war es ja das ist dieses das istdas fire ship framework view ne few ist nicht mehr angesagt ich würde heuteimmer noch apps in view machen und ins welt machen also keine frage aber ichrede ja von der von der aktuellen saudi die durch dorf getrieben wirdund denn ist irrelevant so so na gut dass wir keinen frontend für youtubebrauchen um es zu guckenastro ja ist kein frontend bann ist in javascript in typeskript javascriptruntime für den server bann ist nicht also ich würde sagen quick oder astro istdas aktuelle frontend saudi durch dorf getrieben wirdhere is that a new better javascript framework has been invented when youlearn a javascript framework you join a tribe and that means everything outsidethat tribe is dangerous and terrible now normally you can create an echochamber to convince yourself that you're okay wir gucken mal wir gucken malaus javascript entwickler fragen warum die das oft machen quick leute quick istes sagt doch quick trendet quickunser real db leute neustes neustas deck quick mit so real db das ist dann derquesure quesure stack oder alternativ der zur zur zur wick zur wick der zur wickstack dass das hört sich gar nicht so schlecht an so wick so wick das hörtsich an wie irgendwie soll wie so eine salbe die du mit der ich ein kremenwenn du husten hast und was ich habe zur wick eingeklemmt fünf jahre joberfahrung das ist das ist da könnte man richtig zur wick stackframework is absolutely 100 percent the best in every use case however at somepoint you may be convinced that a better framework does in fact existdas hat sich wirklich fast an wie dieser typ aus norwegen japeter agilis gibt es nicht mehr ich habe das password vergessen für den oderverloren für den link in account leute jetzt habe ich in link in account den dienicht gesperrt haben ja und ich habe das password nicht mehr fürzurücksetzen ich habe das mit einer fake handynummer gen registriert keinechance und der google account den ich als mail verwendet hat wurde wahrscheinlichauch gesperrt mittlerweilea gelater zweite roller yeahachingcoachich kann hier dort aber eine derordre um auf brukung ab und zu wenn wirnicht especiallyyou it ist kann doch meist Smoke an TweetUnd was man nicht vergessen darf, wisst ihr was ich am allerliebsten habe, wenn die dannsagen, das kann doch nicht so schwer sein, das ist doch nur so was ganz kleines, daskann doch jetzt nicht so ein großer Akt sein, das kann doch nicht so schwer sein, die habenkeine Ahnung was da teilweise hinten dran hängt, aber das kann doch nicht so schwersein.Ja das, genau das, genau das, kann doch nicht so schwierig sein, kann doch nicht so schwierigsein.Google.Google, korrekt.Ja, ich predicte mal, ich predicte mal was jetzt kommt, der Typ hat gesagt, ah ok ichhab das Problem gelöst, aber er schreibt nicht die Lösung drunter, ja ich wusste, genaudas, das geht mir auch mega auf den Keks, das geht mir auch richtig auf den Sack, sonach dem Motto, never mind, it works now.Und dann ist er, ja was hast du denn gemacht.Ja, genau das, das kennt jeder.Oder aber, wenn du in einem deutschen Forum landest, ist jetzt erstmal 20 Seiten, diedu postest, keine Ahnung, der hat die Code-Formatierung nicht richtig gemacht, ohne Lösung, ja, daist tatsächlich was dran, äh, da können wir uns doch sonst noch angucken, wir habennicht so viel Zeit, wir haben bloß eine Viertelstunde Zeit, komm Viertelstunde Zeit, da könntenwir uns das Alpha 4 Games Halo Video angucken, oder das hier, was wollen wir uns angucken,diese Titanfall auf der Xbox 360 zum Laufen gebracht haben, oder Halo Battle Royale Verrisswahrscheinlich von Alpha 4 Games, ok, schau mal, ich hab schon lange kein alter 4 GameVideo geguckt, ich bestimmt schon, ja gut, macht der auch nicht so oft Videos, zeig malher, was war denn das davor, ja, kein Wunder, es gibt ja auch kaum welche und es interessierenmich auch nicht alle, also insofern kann es schon sein, ok, ja, ok, also ich muss sagen,ich hab's mittlerweile aufgegeben, was Halo Infinite angeht, den Singleplayer hab ich nochnicht reingeguckt, ich bin mir gar nicht sicher, ob ich den überhaupt gekauft habe, war derMultiplayer nicht free to play, vielleicht hab ich den nämlich gar nicht gekauft, ichfand Halo Infinite am Anfang wirklich nice, gerade weil ich schon relativ lang kein Halomehr gespielt hab, aber was mich wirklich genervt hat, ist erstens, dass die super langsamwaren, was Patches und Content angeht, also richtig richtig langsam, so nach dem Motto,ja eigentlich sollten schon irgendwie diese 3000 Sachen zu Release kommen, aber ach nee,eine Map reicht doch für ein halbes Jahr, also das ist wirklich, das ist ja noch fastnoch weniger Content als Battlefield 2042, das musste er erst mal schaffen, fast, fast,fast, und eine Sache, die mich persönlich wirklich richtig genervt hat, ist nicht, dasses Crossplay gibt, das sag ich gar nichts dagegen, Crossplay wird bleiben und Crossplay ist irgendwoauch die Zukunft, weil durch Crossplay kannst du einfach sicherstellen, dass alle weiterspielen können, auch wenn irgendeine Plattform mal nicht mehr so angesagt ist, ja, aber eswar halt in Halo extrem, normalerweise ist AimAssist da und AimAssist ist auch wichtig,weil sonst kannst du ja halt im Leben nicht mit Controller vs. PC spielen, das funktioniertnicht, das ist alles in Ordnung, auch dass es AimAssist gibt, aber der AimAssist in Halofür Controller ist auf einem komplett anderen Level, also sprich, du kannst selbst, wenndu der absolute Giga AimChat bist, nicht dieses permanent am Kopf stickige Tracke machen,was du mit einem Controller machen kannst, das führt so weit, dass die ganzen Top-Ranked-Spielerin Halo Infinite alle mit dem Controller spielen, die spielen alle mit dem Controller und dahab ich mir gedacht, nee, da hab ich keinen Bock drauf.Eine Modus schon lustig genug.Ich bin kein Fan von Halo Infinite, weder war ich das beim Gameplay Reveal damals, alsich mein Pre-Release Video kurz nach der Beta machte, noch bin ich das jetzt.Womit ich die längste Zeit aber eindeutig in der Minderheit war, denn der Launch vonHalo Infinite schmelzte sich als ein massiver Erfolg heraus.Ja, das ist am Anfang auch richtig gut gestanden, mir hat's auch wirklich Bock gemacht, derMultiplayer beim Start, muss ich sagen, bis dann halt die ganzen anderen Dinger nichtpassiert sind, die ich dir eben erzählt hab, ansonsten ist das, also man merkt eben schonimmer noch an, dass es schon noch die Stärken hat, zumindest, naja, ich war nie großer Halo-Spieler,aber ich kann schon verstehen, dass die Leute beispielsweise Halo 3 so gefeiert haben unddanach keinen Teil mehr richtig gut fanden.Kann ich schon verstehen, wobei ich sagen muss, im Kern fühlt sich das im Multiplayer immernoch an wie ein Halo Multiplayer, ja, diese, auf der einen Seite träge Geschichte, aberauf der anderen Seite halt einfach, dass die, wenn du die Abläufe gut geplant hast, ja,dann passt das einfach, was weiß ich, dreimal BR-Headshot da, dann machst du irgendwie einenNahkampfangriff, dann hebst du irgendwie das Objective-Ding auf, haust den nächsten um,drops irgendwie das runter, also das fühlt sich in Halo schon cool an, also es gibt wirklichwenig aktuelle so Multiplayer-Spiele, wo ich sage, das fühlt sich vom Gegner-Killen sorewarding an und so impactvoll irgendwie, wie man das sagen kann, wie in Halo Infinite,leider haben sie halt drum herum viel verkackt.Spielten es, alle liebten es, alle lobten es und dann nicht mehr.Plötzlich war ich nicht mehr in der Minderheit, die Spielerzahlen fielen schon innerhalbweniger Wochen stark heran, und wir dürfen nicht vergessen, Halo Infinite wurde von Battlefield2042 angeführt, als einer der Gründe, warum ihr Spiel so gefällt ist, da ist eher dieFrage, was der größere Fail ist, die YouTuber, die es am Anfang noch in den Himmel loben,zogen ihr Lob langsam zurück, es kam und kam kein neuer Content, keine Bug-Fixes, mancheFeatures sind nun schon seit Release vollständig broken und später sind es halt noch Leute,aber man darf nicht vergessen, dass sie sau viel angekündigt haben, wie beispielsweise,dass du einen Map-Editor bekommst und sowas, was es bis heute glaub ich noch nicht gibt.Es ist still geworden, das stimmt.Man kann es davon abgesehen, hätte ich das Video jetzt nicht zufällig entdeckt, ichhätte gar nicht mitbekommen, dass Halo Infinite einen Battle-Royale-Modus hatte, hat, hatte?Hat wahrscheinlich, aber also, habt ihr das mitbekommen?Ich wusste es gar nicht, hatte, okay, also ist mir, ist mir neu.Doch statt eines großen Updates, das die meisten Probleme behält und Spieler in neuenInhalten ertrinken lässt, bekam man ganze zwei Maps plus einer Reihe an neuer Spielmodi,die dann auch keiner spielen wollte.Doch war das natürlich nicht der einzige Versuch, mit dem man die Spieler zahlen und den gutenRuf von Infinite wiederherstellen wollte, nee nee, man hatte noch den Lars-Spartan-Standing-Modusin der Hinterhand.Er hat die halbe Laufzeit des Trailers eingenommen, der Blogpost zum Update stellt ihn in denMittelpunkt, das erste Event der Season bestand daraus, in Kombination mit der neuen Big-Team-Kartewieder und wieder spielen zu müssen.Man könnte sagen, er stellte das Herzstück von Season 2 dar.Das ist ja auch mal eine Sixhead-Taktik, so nach dem Motto, ja wir können das jetztnicht so offensichtlich schreiben, aber du kannst mir ja so tun, also ich schreibedie Fragen und dann, dann beantworte ich die Fragen selbst in so ne Blogpost, das ist natürlichSixhead-Teilwahl.Nach 20 Jahren und so vielen Modi in der Halo-Reihe, Alter, warum, wie sie sich abfeiern.Is it a challenge to come up with new experiences like this?Das ist so, wie wenn ich irgendwie ein Video machen würde und mich selbst fragen würde,Alex, warum sind deine Videos eigentlich so geil?Ha, das kann ich dir erklären, kein Problem.Das ist ja mal ne Taktik, Alter.Übrigens, ich hab wieder Werbeanfragen bekommen heute für irgendwelche komischen Mobile-Games.Ich glaube, demnächst muss ich mal wieder nicht in einer Wüste, noch nie in einer Wüstegewesen sein, mal gucken was es dann ist.Die Angebote aktuell, die sind wirklich, äh, da kann man fast nicht nein sagen, die schmeißenmit Geld förmlich um sich.Also, das muss ich jetzt mal kurz erzählen, die Games sind ja meistens gar nicht so, äh,so meins, ja, aber sofern ich mich mit denen drauf einigen kann, dass ich einfach nur wasvorlesen muss und es klar in Video ersichtlich ist, dass das nichts ist, was ich persönlichempfehle, hab ich damit auch kein Problem.Und, ich hab mir bei Genshin richtig Mühe gegeben, oder, müsst ihr schon zugeben?Du hattest einem Arbeitskollegen das, was hast du dem zugeschickt?Das Kirchen-SAP-Video, äh, ah, du meinst, ähm, das Stellenangebote-Video oder was,mit dem Christ, mit dem Christlichen, ähm, was war das, Christ, Christliches Javascriptoder sowas?Jaja, ja, ja, meine Güte, Alter, so, wir müssen das Video mal fertig gucken, das warnichts.Was ist so gutes Genshin-Placement wie bei Apo, was, Apo rettet auch ein Genshin-Placement,er wundert mich, nicht jeder macht aktuell ein Genshin-Placement.Äh, die Zone sieht schon übelst billig aus, auch, ja.Und das ist irrsinnig witzig.Naja, ich würde sagen, es ist ein ganz normaler Battle Royale, du spawnst irgendwo auf derMap, du lootest irgendwelche Dinge und wer am Ende überlebt hat, gewonnen.Würde ich jetzt mal so raten, aber wahrscheinlich ist es nicht so einfach.Moment, ok, also es ist, ok, es ist ein Battle Royale mit Respawn, ich glaub, das gibt'sin der Art und Weise, glaub, auch nicht so oft, quasi so eine Art Battle Royale-Gun-Game.Das sieht es also klar, du willst Kills machen, um am besseren Waffenrand zu kommen, um dadurchdeutlich bessere Chancen im Kampf zu haben, gleichzeitig willst du aber auch nur so seltenwie möglich sterben, um am Ende mit mehr als nur einem einzigen Leben dazustehen bzw.dann überhaupt noch zu stehen und beide diese Interessen muss man nun irgendwie unter einenHut bringen.Es spawnen Equipments auf der Map, gelegentlich kommen diese Drop-Pots runter und nach einpaar Minuten kommt ein roter Kreis, der sich immer weiter schließt.Ahja, Battle Royale halt.Die Spieler werden weniger, das Schlachtfeld kleiner und der Druck immer größer bis irgendwannnur noch ein paar Spieler übrig sind, die dann aber immer noch nachspawnen können undnachdem ich mein letztes Leben durch einen Nahkampf-Trade verloren habe...Ist das da unten der Ort, der Map, dass da Aussichtspunkte, das ist der Call-Out quasiauf der Map, so groß sieht die Map jetzt gar nicht aus, als dass man da super krasseCall-Out-Bezeichnung braucht, na doch, wobei die Map sieht überall gleich kacke aus....die dann aber immer noch nachspawnen können und nachdem ich mein letztes Leben durch einenNahkampf-Trade verloren habe, endet das spannende Finale der letzten beiden Überlebenden ebenfallsmit einem Nahkampf-Trade.Das ist halt ein typischer Halo-Fight, was aber für Battle Royale ziemlich pepega ist,wenn du dich selbst killst zu einem großen Anteil der Fights.In Halo ist das relativ normal, also der Standard-Fight ist ja fast schon aufeinander zurennen,Schilde weghauen und einen Nahkampf-Angriff machen und dann, tja, sterben.Und wer hat jetzt gewonnen?Hast du das Video letztens nicht schon geguckt?Ich kann mich nicht dran erinnern.Haben wir da schon geguckt?Nee.Oder?Oder ist, Leute, ist mein Gehirn, ist mein Gehirn jetzt komplett Boomer-Modus?Bäh.Gut, dass es Modi mit Permadeath hat.Das ist es im Grunde auch schon, eine bekannte Formel, die man aber irgendwie auf die Karten,die man schon hatte, mit nur zwölf Spielern anpassen musste.Ach, das ist auch gar keine neue Map.Ach, doch, das ist eine neue Map, oder?Aber auf der auch alles andere gespielt wird, weil die Map sieht wirklich nicht so großaus.Vielleicht haben wir es auch schon geguckt, ich kann mich nicht dran erinnern.Das ist schon die viel unterhaltsamere Frage, finde ich.Denn ja, in der Tat geht es darum, zum Finale eine möglichst gute Waffe und möglichstviele Leben zu haben.Ich persönlich finde aber viele Leben deutlich sinnvoller als eine gute Waffe.Naja, klar, am Ende gewinnt ja der, der der Leben übrig hat.Hättest du stattdessen aber fünf Leben, so hättest du auf fünf Chancen deinen Siegnoch irgendwie zu brute-forcen.Und so habe ich schon in meiner ersten oder zweiten Runde einen Spot gefunden, bei demich in aller Ruhe abhängen kann, während sich der Rest der Lobby gegenseitig umbringt.Diese war zugegebener Maßnahme nicht sonderlich gut, weil zu weit außen und damit auch sofortaußerhalb des Kreises.Das war blöd und außerdem sollte man solche Eulenexploiter, wie ich einer bin, sowiesonicht mit so einfachen Positionen belohnen.Also habe ich ganz schön eine bessere gefunden.Du springst hier in der Mitte der Map runter und hast gewonnen.Und man stirbt nicht, okay.Interessant, dass man da nicht stirbt.Da hat doch auch irgendeiner verschissen beim Mapbauen, oder?Ja, das ist wichtig und zusätzlich kann niemand im Zuschauermodus erkennen, wo du stehst,weil, ja, natürlich kannst du in diesem Battle-Royale-Modus Leute vom Respawn beobachten, um zu sehen,wo sie sind.Alles andere wäre ja unfair.Was?Okay, da fällt mir kein anderer Battle-Royale ein, der das hat.Warum?Ja gut, ich kann mir vorstellen, warum, weil wahrscheinlich das in Halo Hardcoded so drinist.Genau.Und die hatten keinen Bock, das anzupassen, genau das wäre meine Vermutung gewesen.Ja, aber ich kann mir sogar denken, also irgendwann existiert hier unten bestimmt ein Dev-Trigger,weil halt Lava-Becken, dann dachte sich aber irgendjemand anders, dass es doch den Greifhakengibt und man sich mit diesem noch retten könnte, also wurde der Dev-Trigger etwas weiter runtergesetztund die Ecke blieb übrig und dann hat niemand nachgeguckt, ob dieser kleine Vorsprung hiereine Kollision hat und nein, bevor irgendjemand fragt, es wurde bis heute nicht gefixt.Aber hey, ich hab noch 5 Leben übrig, der letzte andere hat nur 0, er hat 11 Kills,ich nur einen und okay, der Kreis kostet mir irgendwann auch ein Leben, ja, aber dannhab ich immer noch 4 und er nicht.Selbst wenn ich also waffentechnisch unterlegen bin, irgendwie beiße ich mich da schon durch.Alles was ich brauche ist ja nur ein Nahkampftrade und wie wir gesehen haben, sind Traits nichtgerade selten in diesem Spiel.Und mit diesen Gedanken werfe ich ihm eine Stugnail an den Hinterkopf und tadaa, VictorySoja!Natürlich hab ich auch mal auf legitime Art und Weise gewinnen können, hier, ich greifejemanden an, dann rennt er aus dem Kreis raus und stirbt, seht ihr, ich bin gut, aber hierunten...Alter, das wirkt alles sehr mit heißer Nadel und unüberlegt gestrickt, oder?Es ist einfach so viel entspannter.Ich kann Chips essen, oder Stargate gucken, oder mich mit einem Freund darüber unterhalten,dass wir beide mittlerweile wieder angefangen haben Bücher zu lesen.Nein, ich würde es ja funktionieren, wenn ich sage, ey, liefert das Buch mal zu euchund dann bezahle ich bei der Abholung, aber den zahl ich halt mit meinem Einkaufszentral-Gutschein,wo ich das noch in 40 Euro Gutschein esse.Wow!Nein!Diese Scheiße!Ich hab nix gemacht, ihr Liebes!Wie man sieht, es läuft prima.Und ja, wie man gerade sehr schön erkennen konnte, stirbst du gegen Ende des Matches,hast aber noch Leben übrig, dann spawnst du einfach irgendwo und nirgendwo und nimmstsofort Sharp.Moment, Moment!Man respawnt dann in der Zone, oder was?Alter, wie unüberlegt ist, was haben die denn da zusammengestrickt?Wie ist eigentlich die Halo-Serie?Wohl richtiger Bodensatz angeblich, die Halo-Serie, was ich gelesen hab.Ja, dann sieht man halt, dass es keine so clevere Idee ist, nen respawn Battle Royale zu machen.In Windeseile, so schnell wie ich nur irgendwie konnte, zu dem letzten Safe-Spot-Rennen, denes gab.Geil, in dem Turtel!Toll!Super!Und jetzt kommst du nirgendswo hin.Dieses fitzige Land, meine letzte Hoffnung, mein sicherer Hafen und, wie ich noch lernensollte, meine neue Heimat.Na toll.Alter, wer hat sich das denn wieder ausgedacht?Haben die irgendwie Mitarbeiter geshared mit Dice, oder was ist da los?Und saß hier, und saß hier, aus Sekunden wurden Minuten, selbst die treuesten zufolge...... und erwarten, dass die Zone weiter schrumpft, oder aber sich halt bewegt oder so.... und verließen nach und nach die Lobby, und es ging nur noch um uns beide, und, wieman hört, ich hockte hier unten und er dort oben.Nur ein paar Meter schlecht texturierter Metallschichten trennten mich von meinem Todfeind.Seh ich das richtig?Die Zone wird nicht mal kleiner und bewegt sich auch sonst nicht mehr?Also die haben quasi das Mindeste, was du einbauen musst am Ende von einem Battle Royale,gar nicht eingebaut, oder was?Alter, sind die unfähig, äh, Wahnsinn.Ah, und doch, so, fair.Warte, und die Zone wird hier noch mal kleiner?Wahrscheinlich.Haha.Weil das...Haha, so, geil.Das ist da reingerannt und wurde gefestet, äh.Dieses kack Spiel.Mensch, was für ein spannendes Schicken-Dinner.Natürlich könnte man jetzt auch einfach denken, dass es nur ein blöder Zufall war, und derKreis ganz sicher nur ganz versehentlich so gefallen ist oder irgendwie sowas, aber,ähm, was das dann geht, der Ring kann auf genau drei Positionen fallen.Moment, was?Die Zone ist nicht mal zufällig?Oder zumindest, zumindest irgendwie ein bisschen randomized?Mein, drei ist, äh, drei ist bei mir nicht random, das sind 33%.Drei Zonen?Äh, äh, drei, drei.Okay, also, die Zone ist nicht richtig randomized, und die Zone am Ende bewegt sich nicht undwird nicht mal kleiner.Also, das ist ja, offenem Niveau, ungefähr so, wie als ich meine erste Half-Life-1-Mapmit drei Containern gebaut habe.Eine, bei der ich meinen regulären Sieg hatte, okay, eine genau in der Mitte der Map mitzwei Ebenen, bei der ein Typ unter mir hockt und nicht mehr wegkommt, ich hier oben hockeund hier unendlich Plasma-Granaten nachspawn, das ist auch eine tolle Pose, tolle Pose,und halt, ey, guck mal hier, wow, der Tunnel, der Tunnel wieder, ja, das heißt, irgendjemandhat sich bewusst dazu entschieden, den Kreis genau so zu platzieren, dass diese Kleinenenden würden.Ach, du Kacke.Ja, ja, Chat, es ist wirklich, mach mal Battle Royale, heute Mittag muss er fertig sein.... übrig bleibt und ich jedes Mal wirklich Runde für Runde hier unten hock...Mr.Moogam, sag das nicht so laut.Sonst muss ich demnächst auch Battlefield-Container platzieren.... vollkommen verdienter Sieg vom Himmelfiel.Jedes andere Spiel hätte einen Ring, der noch mal ein wenig enger wird, dass nur nocheiner reinpasst oder ein Zeitlimit oder irgendeine andere Mechanik, um einen Sieger zu erzwingen.Nur Infinite hat sowas nicht nötig.Bei Lava hocken, warten, Sieg, hoffen, dass du nicht gekickt wirst, weil du auf K warst.Da hat irgendein Typ gesagt, Leute, Battle Royale ist der Shit, was machen wir denn jetzt?Wie lautet unsere Battle Royale Strategie?Und da haben sich irgendwie so ein paar arme Würstchen, die quasi nicht schnell genugflüchten konnten, hinsetzen müssen und ein Halo Battle Royale programmieren und genausowirkt das auch. Irgendwas, was nicht ins Game passt, von Leuten, die keinen Bock drauf hatten,es zu entwickeln, irgendwie rausgekackt.Ecke hocken, warten, Sieg, es ist unglaublich.Dagegen sieht der Battlefield 2042 Battle Royale-Modus richtig pock aus, ja das ist richtig.Nicht vorhanden ist besser als das.Am meisten mochte ich ja den Typen, der hier irgendwann runtergehobst ist, wie jeder andereauch, aber einfach weiterliefern würde ich gar nicht hier gewesen.Ich war echt so ein bisschen perplex, was da gerade passiert ist, also habe ich mal ganzkurz in der Kinolobby nachgeguckt und wisst ihr was?Er konnte mich in der Panik gar nicht sehen, weil 343 auf die Idee kam, rote Outlines hintereinem roten Vorhang verstecken zu müssen.Okay, da siehst du wirklich nichts.Da siehst du wirklich nichts.Ja, das ist mein Fazit, glaube ich.Stimmt, da ist wahrscheinlich sogar Hazard Zone besser, Leute.Das heißt schon was, also wenn irgendwas besser ist als, wenn Hazard Zone besser istals irgendwas, das ist wirklich, das lässt tief blicken.Und das war es dann auch eigentlich schon.Das war das große Season 2 Update, mit dem man die Wartezeit überbrücken wollte, bisall der angekündigte Content, der ja eigentlich schon zur Release da sein sollte, endlichmal nachgeliefert wird, sobald man jemand dran arbeiten möchte.Nichts, aber auch gar nichts, passt hier zueinander.Sollte Infinite nicht auch ein Service-Game werden?Was ist denn mit den ganzen Service-Games eigentlich los?Da fehlt alles unter Service.Out of Service, ja.Es ist so ein Fall vom Problem, die so tiefgreifend sind, dass keine mögliche Lösung funktionierthätte, weil der Modus niemals funktioniert hätte.Nicht so, nicht in diesem Spiel und schon gar nicht auf dieser Map.Später konnte man das Ganze dann auch endlich auf den anderen Victim-Karten spielen, wassicher besser war als das hier, aber auch nur knapp und seit dem neuesten Update ister sogar tot.Er ist tot, der Modus ist tot, nicht du findest keine Spieler mehr tot, das war nämlichvorher schon, sondern weg, vollständig aus dem Spiel entfernt.Ok, sie haben festgestellt, es ist einfach Crap gewesen.343 Community-Guru-Sketch erklärte, es war bei Vitem der am wenigsten gespielte Modusin Halo Infinite.Ja ach, warum wohl?Warum wohl?Weil er so gut war, oder wie?Ich frag mich ja wieso, aber ganz ehrlich, was hatte man auch anderes erwartet?Apex oder PUBG zahlen ja sicher nicht, aber überhaupt zahlen hätte man ja wohl gernegesehen.Ist doch schön, wie man so viel Mühe, so ein bisschen Mühe und so viel Arbeit kaumArbeit investierte, nur damit der große neue Modus so hart floppte und man nicht...Es ist wahrscheinlich einfach gewesen, dass man was im Trailer zum Zeigen hatte, dasses nicht so erbärmlich ist, dass man nur eine Map irgendwie in vier Monaten hinkriegt undalles andere verschieben muss.Wie vier Monate reicht das noch gar nicht, das kam von einem Jahr raus oder so.Oh, ich erkenne da Parallelen zu Battlefield 2042, die posten auch ganz viele Roadmapsund neue Stellen, wo sie Kisten platzieren wollen auf Maps.Aber passieren tut nix.Istdas 2023?Reden die von 2023?Ich meine, wer glaubt dort, dass dann überhaupt noch irgendjemand das auch nur mitbekommt,das ist ja fast noch schlimmer als Battlefield 2042.Ja, der Map-Editor, aber Coop war aber auch wirklich...Wie billig aussieht.Die mega billig aussieht.Seht ihr wieder richtige Experten am Start bei 343?Ach du Scheiße, das ist ja noch...Also, das kratzt ja fast schon an Battlefield 2042 Fehler.Früher gab es eine Sache, wisst ihr was der Unterschied zwischen diesen Games und Gamesguten Spielen von früher?Der Unterschied ist, dass die Leute früher Games gemacht haben, die sie selber spielenwollten.So, dass sie die selber gerne gespielt hätten, oder sie haben sie ja auch gespielt.Also, Spieleentwickler haben ihre eigenen Games gespielt und das nicht zu knapp.Ich meine, jetzt kann mir keiner erzählen, dass die Badais wirklich den Battlefield 2042grind gemacht haben, während der Entwicklung, im Leben nicht.Und die Halo-Entwickler wahrscheinlich auch nicht, die meisten Entwickler nicht.Früher wurden Games entwickelt von Entwicklern, die das was sie entwickelt haben so gebauthaben, dass es was ist, was sie selbst gerne spielen würden... oder spielen.Ja, das gleiche Problem habe ich auch.Es gibt immer mal wieder ein paar Sachen, aber es gibt halt nicht so diese krassen GrindGames für mich, wo ich dann quasi schon auf der Arbeit überlege, Alter, wenn ich heimkomme,mache ich das an und dann wird eine Runde gebashed und so, das habe ich nicht mehr.Das neue Monkey Island habe ich nicht gespielt, nee.Das soll an sich tatsächlich ganz gut sein, es gab ja wieder riesen Hickhack um die Grafik,dass die ja doch irgendwie und nicht so doll und hier und da und die Fans haben sich betrogengefühlt und was auch immer, das kann man so schwer sagen, wenn man das nicht in Bewegungsieht, soll tatsächlich nicht schlecht sein.In Diablo 4 habe ich keine Hoffnung, ich habe generell in Blizzard Games auch keineHoffnung mehr.Die haben doch die letzten Jahre über nichts hingekriegt, das letzte wirklich was sie hingekriegthaben ist Overwatch 1, was sie jetzt wieder auch kolossal gegen die Wand gefahren haben.Und davor 2013 oder so StarCraft 2, das Originale von den Erweiterungen, ja.Ansonsten Blizzard hat nicht wirklich was großartig auf die Reihe gekriegt.Die haben mehr gegen die Wand gefahren und verkackt die letzten Jahre über, als dassda was gutes rauskam.Diablo 2 Resurrected, ja gut, das stimmt, das ist tatsächlich ganz okay geworden.Aber das ist jetzt ja nichts großes Neues irgendwo.Warcraft 3 Deforged, ja, also die World of Warcraft Erweiterung verfolge ich nur am Rande.Ich glaube die Erweiterung, die die Leute gut fanden, war eigentlich nur Legion, oder,die letzten Jahre über.Battle for Azeroth fanden die alle kacke.Die Warlords of Draenor fanden sie alle kacke.Was kam da sonst noch?Ich kenne mich mit WoW Addons nicht aus.Shadowlands fanden die meisten kacke, vor allem am Ende hin.Ich glaube das war es, mehr gab es die letzten Jahre nicht.Leute, ich muss pennen, wir sehen uns morgen, machts gut, bis dann, see you.", "segments": [{"id": 1, "start": 90.0, "end": 119.98, "text": "So jetzt aber, achja, ich hab gerade mein Unraid geupgraded, ich bin ja immer noch nicht"}, {"id": 2, "start": 119.98, "end": 127.3, "text": "100% nicht schlüssig, ob das eine gute Idee war, den Kram zu verwenden. Ich hab's jahrelang"}, {"id": 3, "start": 127.3, "end": 135.04, "text": "ignoriert, weil ich mir immer dachte, sowas was ich nehme hat nicht richtiges Linux und mach"}, {"id": 4, "start": 135.04, "end": 139.96, "text": "die Sachen selbst. An sich finde ich es eigentlich ganz gut, wenn man weniger selbst machen muss,"}, {"id": 5, "start": 139.96, "end": 145.26, "text": "weil ich hab keinen Bock mich die ganze Zeit 24-7 um meine Infrastruktur daheim zu kümmern,"}, {"id": 6, "start": 145.26, "end": 156.12, "text": "aber irgendwie wirkt das sehr gebastelt alles. Und auch als interessiert die das nicht wirklich,"}, {"id": 7, "start": 156.12, "end": 162.6, "text": "was da mit gemacht wird. Also so ganz happy bin ich damit nicht. Auf der anderen Seite"}, {"id": 8, "start": 162.6, "end": 171.06, "text": "weiß man nicht, was es für sinnige Alternativen gibt für daheim, wenn man ein Webinterface haben"}, {"id": 9, "start": 171.06, "end": 176.16, "text": "will. Es gibt Cockpit, es gibt theoretisch noch Proxmox, wobei Proxmox für meinen Fall"}, {"id": 10, "start": 176.16, "end": 189.48, "text": "eher nichts ist. Will er nichts großartig virtualisieren. Ansonsten... Gibt's heute"}, {"id": 11, "start": 189.48, "end": 195.68, "text": "Nachhilfestunde in Internetmemes? Ne, weiß noch nicht, vielleicht. Kann ich noch nicht"}, {"id": 12, "start": 195.68, "end": 201.72, "text": "sagen, mal gucken, was passiert. Also ihr wisst ja, ich hab bloß eineinhalb Stunden Zeit, wir"}, {"id": 13, "start": 201.72, "end": 204.8, "text": "schwätzen jetzt ein bisschen, gucken uns ein bisschen Zeug an und dann ist gut für heute."}, {"id": 14, "start": 204.8, "end": 213.56, "text": "Den Content habe ich letzten Tage über gemacht. PlaneLib wird... Wie gesagt, das habe ich früher"}, {"id": 15, "start": 213.56, "end": 217.84, "text": "gemacht. Ich hatte früher einfach mit Ubuntu auf die Kiste hier oder Debian hier auf die Kiste"}, {"id": 16, "start": 217.84, "end": 222.52, "text": "geklatscht und gut ist. Und ich hatte ja vor einer Weile schon gesagt, ok ich probiere mal"}, {"id": 17, "start": 222.52, "end": 228.08, "text": "Android aus, weil alle immer gesagt haben, Android wäre irgendwie so nice und ich fand"}, {"id": 18, "start": 228.08, "end": 235.28, "text": "es an sich vom Ansatz her nicht verkehrt. Aber so wirklich durchdacht ist es auch nicht."}, {"id": 19, "start": 235.28, "end": 246.76, "text": "Ja zum Beispiel, ich hab jetzt geupgraded, passt mal auf, ich hab geupgraded und jetzt"}, {"id": 20, "start": 246.76, "end": 252.76, "text": "hat auf einmal der USB-Passthrough nicht mehr richtig funktioniert an die VMs. So sah dann"}, {"id": 21, "start": 252.76, "end": 264.68, "text": "so aus. Warum denn ich kosse, gut es ist noch davor. Guck mal, Unraid RC4. Das ist der Thread"}, {"id": 22, "start": 264.68, "end": 275.0, "text": "heißt so. USB. So, hier guck mal. Leute die, Leute die ein Upgrade gemacht haben berichten"}, {"id": 23, "start": 275.0, "end": 281.4, "text": "darüber, dass nach dem Upgrade, by the way Upgrade auf 6.11, was ich gemacht habe, genau"}, {"id": 24, "start": 281.4, "end": 286.64, "text": "das gleiche, dass ihr USB nicht mehr richtig funktioniert. So, man sollte eigentlich davon"}, {"id": 25, "start": 286.64, "end": 291.36, "text": "ausgehen, USB-Passthrough, der nicht mehr ordentlich funktioniert in VMs ist wirklich"}, {"id": 26, "start": 291.36, "end": 298.6, "text": "ein High Priority Thema. Aber anscheinend nicht. Das gab es bei 6.10 schon das Problem und"}, {"id": 27, "start": 298.6, "end": 303.8, "text": "bei 6.11 gibt es das weiter und es juckt keine Sau dort anscheinend. Ich mein USB-Passthrough"}, {"id": 28, "start": 303.8, "end": 307.48, "text": "ist ja so eines der essentiellsten Sachen, dass du VMs überhaupt gescheit verwenden kannst."}, {"id": 29, "start": 307.48, "end": 328.88, "text": "So, und die Aussage von den Typen jetzt bei Unraid ist, ja, dann. Zumindest die Aussage"}, {"id": 30, "start": 328.88, "end": 341.4, "text": "von Unraid irgendwo ist, ja, dann benutzt doch, hier guck, guckt euch das an. Hier."}, {"id": 31, "start": 341.4, "end": 347.16, "text": "Es gibt einen Addon, wo man USB-Passthrough umstellen kann, dass er wenn es geht, das"}, {"id": 32, "start": 347.16, "end": 354.72, "text": "als Serial-Passthrough tut. Warum ist ein fucking Community Addon die Erklärung für"}, {"id": 33, "start": 354.72, "end": 362.2, "text": "ein beschissen, verbuggtes System? Wafa, was ist das? Also, wie kann ein Community Addon"}, {"id": 34, "start": 362.2, "end": 367.16, "text": "die Antwort sein darauf, dass ihr scheiß Körnern verbuggt ist bis zum Abkotzen? Das"}, {"id": 35, "start": 367.16, "end": 372.4, "text": "regt mich mega auf. Das ist die Antwort darauf. Nehm einen Community Addon und schalt USB"}, {"id": 36, "start": 372.4, "end": 383.72, "text": "auf Serial um. Da kann ich mich aufregen. Alter, alles unfähige Kackspasten, man. Wie"}, {"id": 37, "start": 383.72, "end": 387.64, "text": "kann man so ein System, da wollt ihr auch noch Geld für haben? Das regt mich ultra"}, {"id": 38, "start": 387.64, "end": 396.8, "text": "auf, ja. Was eine Antwort, man. Haha, das stimmt, Q-Stream. Haha, Q-Stream und gleich"}, {"id": 39, "start": 396.8, "end": 414.12, "text": "wird übelst rumgeflamet, Leute. Haha, so sieht's aus. Okay, danke übrigens für die Subs,"}, {"id": 40, "start": 414.12, "end": 419.72, "text": "Leute hier. Pingo, Pingo und Schlechtes Wähler. Besser Titel, ja. Top. Deutschland"}, {"id": 41, "start": 419.72, "end": 423.92, "text": "hast ja nicht nur schlechtes Wähler, schlechtes Mobilfunk und schlechtes Internet. Das kannst"}, {"id": 42, "start": 423.92, "end": 427.76, "text": "du quasi, man müsste mal, man müsste mal das irgendwie zusammenfassen, Leute. Hat"}, {"id": 43, "start": 427.76, "end": 433.68, "text": "irgendwie einer gute Idee für so einen Sammelbegriff. Schlechtes WLAN, schlechtes Internet, schlechtes"}, {"id": 44, "start": 433.68, "end": 444.4, "text": "Mobilfunk. Was ist das? Schlechte, wasletzte Funk. Alles schlecht ist ja hier auch nicht."}, {"id": 45, "start": 444.4, "end": 454.32, "text": "Schlecht Kommunikation, schlechte Infrastruktur, ja. Hast du schon was über die ARK-CPUs gelesen?"}, {"id": 46, "start": 454.32, "end": 463.56, "text": "Ja, das sind die neuen Intel-GPUs, aber das war's auch. Für AV1 ist, wenn du encoden"}, {"id": 47, "start": 463.56, "end": 474.16, "text": "willst, will ich AV1 encoden, ich encode H264, drei Stücke. Mit der nötigen Auflösung"}, {"id": 48, "start": 474.16, "end": 482.32, "text": "und Bandbreite, die man aber mittlerweile ja glücklicherweise auf YouTube hat. Ja, also"}, {"id": 49, "start": 482.32, "end": 487.64, "text": "die Sache ist halt die, es hat schon seine Vorteile, Unraid, versus ein nackiger Ubuntu-Server,"}, {"id": 50, "start": 487.64, "end": 492.32, "text": "für daheim wohlgemerkt, für daheim, ja. Manche Addons sind tatsächlich ganz nice,"}, {"id": 51, "start": 492.32, "end": 498.96, "text": "ja, zum Beispiel, dass du so eine Art Shop-Schedule-Frontend hast mit Web-Interface, anstatt irgendwelche"}, {"id": 52, "start": 498.96, "end": 504.52, "text": "Cron-Jobs von Hand zu machen. Das Read-Only-System ist, dass dein USB-Stick nicht kaputt geht,"}, {"id": 53, "start": 504.52, "end": 510.4, "text": "dass du ein Web-Interface zum VM anlegen hast, zum Container anlegen, zum Samba-Shares einrichten."}, {"id": 54, "start": 510.4, "end": 520.0, "text": "An sich ist das schon ganz cool, aber es wirkt sehr, also, als ist es denen, die das entwickeln,"}, {"id": 55, "start": 520.0, "end": 525.16, "text": "egal. Na, TrueNAS an sich weiß ich nicht, ich glaube nicht, dass das richtig ist. Ich"}, {"id": 56, "start": 525.16, "end": 533.48, "text": "hatte mal eine Weile FreeNAS, und FreeNAS war ja ganz gut, wenn man ZFS verwenden will,"}, {"id": 57, "start": 533.48, "end": 545.56, "text": "und man, das Schlimmste an FreeNAS ist, Leute, das FreeNAS-Forum. Also es gibt zwei Foren,"}, {"id": 58, "start": 545.56, "end": 552.48, "text": "die, wo ich jedem nur empfehlen kann, Abstand zu halten, der vielleicht nicht so ganz gut"}, {"id": 59, "start": 552.48, "end": 559.0, "text": "klarkommt mit seinem Technik-Krams und möchte um Hilfe fragen. So, das ist einmal das deutsche"}, {"id": 60, "start": 559.0, "end": 570.84, "text": "FreeNAS-Forum und das Microcontroller-Forum. Nein, ich rede nicht von Reddit oder so. Das"}, {"id": 61, "start": 570.84, "end": 577.8, "text": "Heise-Forum ist auch kacke. Das Microcontroller-Forum, das FreeNAS-Forum und das deutschsprachige"}, {"id": 62, "start": 577.8, "end": 583.48, "text": "Arduino-Forum ist auch so ein Ding, wo ich mir immer denke, Alter, was für Vollspass"}, {"id": 63, "start": 583.48, "end": 589.12, "text": "da rum rennt, das ist echt der Wahnsinn. Erheise ist auch ätzend, ja, das stimmt, aber es"}, {"id": 64, "start": 589.12, "end": 593.72, "text": "gibt so ein paar Sachen. Und das Schlimme ist ja, wenn ja wenigstens die Antworten irgendwie,"}, {"id": 65, "start": 593.72, "end": 599.6, "text": "wenn es irgendwie eine gute, ja, wie soll ich sagen, so Wissens-Base wäre, diese Foren,"}, {"id": 66, "start": 599.6, "end": 606.64, "text": "ist es nicht. In der Regel sind die Seiten, die Threads, 20 Seiten lang, weil irgendjemand"}, {"id": 67, "start": 606.64, "end": 612.72, "text": "den Code-Block nicht richtig als Code formatiert hat oder irgendwie einer das nicht so geschrieben"}, {"id": 68, "start": 612.72, "end": 617.52, "text": "hat oder benannt hat, wie es einer gerne hätte. Also im Prinzip ist das eigentlich nur 20"}, {"id": 69, "start": 617.52, "end": 625.44, "text": "Seiten lang, wie sagen sie da auf Englisch drum, Circle Jerk oder so, Circle Jerk, also"}, {"id": 70, "start": 625.44, "end": 634.92, "text": "Kreis Wichsen auf Deutsch quasi, 20 Seiten lang unproduktives Rumgelaber in den Foren,"}, {"id": 71, "start": 634.92, "end": 641.36, "text": "das ist krass. Da ist Reddit tatsächlich zum größten Teil relativ gut. Das beste Subreddit,"}, {"id": 72, "start": 641.36, "end": 653.36, "text": "wenn man ein bisschen, ähm, das beste Subreddit, wenn man ein bisschen Gerante lesen will"}, {"id": 73, "start": 653.36, "end": 668.96, "text": "über Programmiersachen, müsst ihr auf dieses Subreddit gehen, da ist auch, also jetzt,"}, {"id": 74, "start": 668.96, "end": 696.88, "text": "das letzte Lack, ist Reddit kaputt? Oder ist die Google Weiterleitung auf Reddit kaputt?"}, {"id": 75, "start": 696.88, "end": 725.48, "text": "Ne, Reddit ist kaputt. Reddit ist beim Wiederbrauten. Reddit ist F."}, {"id": 76, "start": 725.48, "end": 737.68, "text": "Guck. Guck mal, Hui! Massive Speed, Alter! Massive Speed!"}, {"id": 77, "start": 737.68, "end": 749.84, "text": "Ja, Leute, guckt mal, YouTube geht instant auf, das muss an Reddit liegen. Old Reddit,"}, {"id": 78, "start": 749.84, "end": 753.36, "text": "das ist eine gute Idee, da kann man immer mal gucken. Das ist das beste, das ist, ohne"}, {"id": 79, "start": 753.36, "end": 756.68, "text": "zu denken, das ist das beste Subreddit, wenn man sich ein bisschen über Programmierkram"}, {"id": 80, "start": 756.68, "end": 768.44, "text": "aufregen will. Das ist quasi nur abgeflamen den ganzen Tag. Ja. So, wo sind wir denn stehengeblieben?"}, {"id": 81, "start": 768.44, "end": 775.72, "text": "Ne, hab ich, hab wie gesagt, ich hab was zugelesen, aber ansonsten nichts weiter, ja. Was hältst"}, {"id": 82, "start": 775.72, "end": 786.72, "text": "du von KMM? Ich überleg gerade, hab ich da schonmal was von gehört? Sagt mir jetzt nix."}, {"id": 83, "start": 786.72, "end": 794.4, "text": "KMM. Mobile. Oder was? Ach, Kotlin Multiplattform for cross platform mobile development. Ja,"}, {"id": 84, "start": 794.4, "end": 807.12, "text": "das ist wahrscheinlich so ein Müll wie Maui. Bloß für Java. Quasi das Maui der Java-Welt,"}, {"id": 85, "start": 807.12, "end": 826.92, "text": "das kein Mensch braucht. Ja, ja, das ist halt dumm. Das ist Maui. Oder? Die wollen mir"}, {"id": 86, "start": 826.92, "end": 832.44, "text": "doch damit sagen, die benutzen native Steuerelemente, oder? Dann ist das schon wieder, dann sieht"}, {"id": 87, "start": 832.44, "end": 840.08, "text": "es wieder kacke aus, überall. Also, was heißt kacke aus? Dann sieht es auf einer Plattform"}, {"id": 88, "start": 840.08, "end": 846.12, "text": "gut aus und aus, gut aus. Nicht Schwachsinn, dann sieht es nicht auf beiden Plattformen"}, {"id": 89, "start": 846.12, "end": 851.2, "text": "gleich aus. UI ist so 100% native. Ja, das ist ja auch das Problem, was Maui hat, dass"}, {"id": 90, "start": 851.2, "end": 854.92, "text": "dann die Apps unterschiedlich aussehen und du beim Programmieren quasi auf den kleinsten"}, {"id": 91, "start": 854.92, "end": 863.2, "text": "gemeinsamen Nennern zwischen Controls zwischen Android und IOS angewiesen bist. Da geht was"}, {"id": 92, "start": 863.2, "end": 885.64, "text": "kaputt. Down Detector. Zeig mal. Oh. Oh ja. Da ist wirklich was am abcutten. Reddit. Bam."}, {"id": 93, "start": 885.64, "end": 894.36, "text": "Reddit. Am verrecken. Also, das sagt mir nichts. Das sagt mir nichts. Aber das sieht auf den"}, {"id": 94, "start": 894.36, "end": 899.72, "text": "ersten Blick ein bisschen so aus wie Maui und von Maui bin ich, also von.NET Maui,"}, {"id": 95, "start": 899.72, "end": 902.72, "text": "da bin ich auch kein, ich bin riesiger.NET Fan, das wisst ihr aber von Maui überhaupt"}, {"id": 96, "start": 902.72, "end": 912.96, "text": "nicht. Da hat Alphalonia den besten Ansatz. Oder halt, ganz im Ernst, wisst ihr was ich"}, {"id": 97, "start": 912.96, "end": 921.24, "text": "machen würde, wenn ich eine Mobile App entwickeln müsste? Ganz im Ernst? Auch wenn ich mich"}, {"id": 98, "start": 921.24, "end": 923.84, "text": "vielleicht ein bisschen quälen müsste, aber ich glaube, ich müsste mich damit weniger"}, {"id": 99, "start": 923.84, "end": 929.68, "text": "quälen, wie mit was anderem. Okay, Flutter, Flutter vielleicht. Nee, ich würde den Javascript"}, {"id": 100, "start": 929.68, "end": 936.48, "text": "gedürnt machen. Nicht unbedingt React Native, sondern ähm, äh, Dings hier. Wie heißt"}, {"id": 101, "start": 936.48, "end": 944.56, "text": "Ionic oder sowas? Würde ich wahrscheinlich machen. Einfach Javascript gedürnt, fertig."}, {"id": 102, "start": 944.56, "end": 951.12, "text": "Javascript Islamas, fuck, was interessiert es? Für 99% der Apps ist es absolut schnell"}, {"id": 103, "start": 951.12, "end": 962.72, "text": "genug eine Webseite. Jetzt machen die schon großartig. Die meisten Apps sind übrigens"}, {"id": 104, "start": 962.72, "end": 967.44, "text": "auch einfach nur Webseiten. Wahrscheinlich sind 90% der Apps, die ja außer Mark Games"}, {"id": 105, "start": 967.44, "end": 975.6, "text": "oder sowas, ähm, sind wahrscheinlich bei euch von den Apps einfach nur in Apps verpackte"}, {"id": 106, "start": 975.6, "end": 985.68, "text": "Webseiten. Du meinst eine Progressive Web App? Nee. Ich meine eine App im App Store, die"}, {"id": 107, "start": 985.68, "end": 991.36, "text": "unter der Haube eigentlich nur Browser bzw. Web Technologie ist. So wie 90% der Apps heutzutage."}, {"id": 108, "start": 991.36, "end": 1004.08, "text": "Ich werde wohl ab Mai Tesla fahren. Nice, ich freu mich jetzt schon. Ja, mit Tesla geht"}, {"id": 109, "start": 1004.08, "end": 1010.8, "text": "es noch besser als mit meinem Fiat. Ja, Discord ist ein gutes Beispiel für, wobei Discord,"}, {"id": 110, "start": 1010.8, "end": 1015.4, "text": "an Discord sieht man ja, dass es auch schnell funktioniert. Discord macht es allerdings"}, {"id": 111, "start": 1015.4, "end": 1021.84, "text": "ziemlich high IQ. Discord macht, wenn du Discord auf dem Desktop installiert hast, wenn du"}, {"id": 112, "start": 1021.84, "end": 1027.16, "text": "Discord den Browser verwendet, dann nur zur Hälfte, äh, nicht zur Hälfte, dann weniger,"}, {"id": 113, "start": 1027.16, "end": 1032.68, "text": "die haben Native C-Module dabei, die sie da irgendwie reingehuckt haben in ihr Node.js"}, {"id": 114, "start": 1032.68, "end": 1042.88, "text": "gedürnt. Aber Discord war wirklich clever. Das muss ich jetzt mal sagen. Also, die Discord-Leute"}, {"id": 115, "start": 1042.88, "end": 1049.4, "text": "waren wirklich schlau. Und die waren aus einem Grund schlau, dass die gesagt haben, wir machen"}, {"id": 116, "start": 1049.4, "end": 1054.52, "text": "eine Web Anwendung. Das hat nämlich gerade, also ich meine jetzt nicht allgemein, sondern"}, {"id": 117, "start": 1054.52, "end": 1060.92, "text": "wirklich genau im Bezug auf Discord. Das hat wirklich für die riesige Vorteile gebracht."}, {"id": 118, "start": 1060.92, "end": 1064.36, "text": "Überlegt euch mal, das Ziel von Discord war, gut ich weiß nicht, was sie hinter in ihren"}, {"id": 119, "start": 1064.36, "end": 1068.92, "text": "Meetings gesagt haben, aber ich rate das jetzt einfach mal. Das Ziel von Discord war ja prinzipiell"}, {"id": 120, "start": 1068.92, "end": 1081.48, "text": "erstmal eine Cross-Platform-Messaging-Voice-Chat-App-Kombination zu entwickeln. Cross-Platform war wichtig."}, {"id": 121, "start": 1081.48, "end": 1087.24, "text": "Die wollten, dass das läuft im Browser, auf Mobile, auf iOS, auf Android, auf Flinux,"}, {"id": 122, "start": 1087.24, "end": 1093.44, "text": "Windows, alles. So. Und wisst ihr warum die schlau waren, dass sie einen Browser genommen"}, {"id": 123, "start": 1093.44, "end": 1100.16, "text": "haben? Überlegt euch mal, wie abartig das gewesen wäre, das ganze Audio-Video-Zeug auf"}, {"id": 124, "start": 1100.16, "end": 1106.8, "text": "jeder Plattform neu zu implementieren bzw. über die Native-ARPies zu machen. Die hätten"}, {"id": 125, "start": 1106.8, "end": 1111.72, "text": "hier allen Ernstes dann für Linux, mal ganz davon abgesehen, sie müssten eh dafür sorgen,"}, {"id": 126, "start": 1111.72, "end": 1116.4, "text": "dass es im Browser läuft. Weil der Einstieg heutzutage ist zu 90% im Browser. Es gibt"}, {"id": 127, "start": 1116.4, "end": 1119.76, "text": "bestimmt Leute, die verwenden heute noch ausschließlich Discord im Browser."}, {"id": 128, "start": 1119.76, "end": 1130.56, "text": "So. Und überlegt euch mal, die hätten eine Web-Anwendung programmieren müssen, was mit"}, {"id": 129, "start": 1130.56, "end": 1135.8, "text": "Native-IOS-ARPies, was mit... und da kommen sie nicht drum herum. Also, ich habe ja gesagt,"}, {"id": 130, "start": 1135.8, "end": 1140.16, "text": "ich würde irgendwie sowas wie Ionic oder sowas nehmen, wenn ich eine Mobile-App machen"}, {"id": 131, "start": 1140.16, "end": 1146.12, "text": "will. Wenn du sowas, Audio-Video und relativ tief ins System integriert und Sonderfälle"}, {"id": 132, "start": 1146.12, "end": 1152.52, "text": "abfangen willst wie Discord, ich glaube, dann wird es schwierig mit so einem Gedöns. Die"}, {"id": 133, "start": 1152.52, "end": 1155.52, "text": "hätten ja irgendwelche Native-Apps entwickeln müssen. Aber nein, die haben gesagt, wir"}, {"id": 134, "start": 1155.52, "end": 1164.64, "text": "nehmen einfach was Chrome-basiertes und benutzen alles das, was Chrome schon fertig gebaut"}, {"id": 135, "start": 1164.64, "end": 1169.88, "text": "hat, was Audio-Video angeht. Und das ist eine Menge. Überlegt euch mal, die hätten für"}, {"id": 136, "start": 1169.88, "end": 1176.88, "text": "X, die hätten X11-Zeug programmieren müssen unter Linux, Alter. PULS-Audio unter Linux,"}, {"id": 137, "start": 1176.88, "end": 1181.44, "text": "Kacke. Alter. Discord hätte dicht gemacht nach der zweiten Woche, als sie angefangen"}, {"id": 138, "start": 1181.44, "end": 1185.92, "text": "hätten, das zu programmieren. Wer zum Teufel will was für X programmieren oder was für"}, {"id": 139, "start": 1185.92, "end": 1196.48, "text": "PULS-Audio freiwillig? Wer ist so gestört? So. Und die waren wirklich clever, dass sie"}, {"id": 140, "start": 1196.48, "end": 1202.6, "text": "das im Browser gemacht haben. Die hätten ewig gebraucht, das wäre nicht rausgekommen."}, {"id": 141, "start": 1202.6, "end": 1207.04, "text": "Und so haben sie eine Fliege mit einer Klappe erschlagen, sie haben eine Web-Anwendung,"}, {"id": 142, "start": 1207.04, "end": 1218.48, "text": "sie haben Native, iOS, Android, Linux, Windows und Mac und alles auf Chrome-Basis. Die waren"}, {"id": 143, "start": 1218.48, "end": 1229.72, "text": "wirklich clever, was das angeht. Mit einem HBA? Nö. Warum? Warum soll ich? Ich hatte"}, {"id": 144, "start": 1229.72, "end": 1237.64, "text": "in der alten Kiste, in dieser 4HE-Kiste, die man hier unten auf dem Boden legen sieht in"}, {"id": 145, "start": 1237.64, "end": 1244.92, "text": "meinem Track, da unten hier, die hatten einen HBA. Hier, da, guck. Einen SAS-Controller"}, {"id": 146, "start": 1244.92, "end": 1258.56, "text": "mit 12 Ports oder sowas dran gehabt. Ne. 5, 10, 10 Ports? Glaube 10 Ports. Einen SAS-Controller."}, {"id": 147, "start": 1258.56, "end": 1275.12, "text": "Ja. Aber das habe ich ja mittlerweile abgeschafft, das Ding. Du hast sogar vor, einen kleinen"}, {"id": 148, "start": 1275.12, "end": 1283.44, "text": "2-Achsen-Motor zu bauen? Automatisches Laden. Ok, ich habe keine Ahnung, wie, was das,"}, {"id": 149, "start": 1283.44, "end": 1288.72, "text": "wie, was du bauen willst. Kann ich mir nicht vorstellen. Willst du den Stecker automatisch"}, {"id": 150, "start": 1288.72, "end": 1298.84, "text": "rein und rausfahren oder was? Den Lade-Stecker willst du den ins Auto reinstecken lassen"}, {"id": 151, "start": 1298.84, "end": 1307.0, "text": "von der Seite automatisch mit Motor oder hä? Ok, Moment, das muss ich mir mal angucken."}, {"id": 152, "start": 1307.0, "end": 1319.64, "text": "Oh, das sieht abenteuerlich aus, Leute. Was ist denn das? Sekunde, das sieht abenteuerlich"}, {"id": 153, "start": 1319.64, "end": 1337.84, "text": "aus. Das muss ich mir jetzt angucken. Warte mal. Warte mal, ich war ein bisschen lauter,"}, {"id": 154, "start": 1337.84, "end": 1342.92, "text": "dass ich was verstehe. Was zum? Ok, was sehe ich da? Lass mal kurz gucken, bevor, ich muss"}, {"id": 155, "start": 1342.92, "end": 1347.48, "text": "jetzt mal versuchen zu verstehen, bevor er mir das zeigt. So, der Typ hat Windows 11,"}, {"id": 156, "start": 1347.48, "end": 1351.44, "text": "das ist mir schon mal unsympathisch. So, das ist eine Lampe, wahrscheinlich, das ist eine"}, {"id": 157, "start": 1351.44, "end": 1359.88, "text": "Lampe. So, das hier ist ein Motor, der, das hier nach vorne klappt gleich. Das ist so"}, {"id": 158, "start": 1359.88, "end": 1366.2, "text": "ein Ding, womit man auch Türen aufmachen kann. Das zieht hier zusammen und dann klappt das"}, {"id": 159, "start": 1366.2, "end": 1370.96, "text": "hier, dann klappt das hier nach zur Seite. Zumindest würde ich das so einschätzen. Und"}, {"id": 160, "start": 1370.96, "end": 1395.32, "text": "hinten ist Steuerungskram. Ok. Oh, ist da eine Lampe? Ist das überhaupt eine Lampe? Da hättest"}, {"id": 161, "start": 1395.32, "end": 1399.76, "text": "du Angst um den Lack? Ne, glaube ich, musste nicht. Der schiebt ja den Charger rüber und"}, {"id": 162, "start": 1399.76, "end": 1414.76, "text": "der Charger ist ja Plastik und vorne Gummi. Na gut, mit genug Wumms. Das da vorne ist"}, {"id": 163, "start": 1414.76, "end": 1436.52, "text": "das Charger-Kabel. Alter, Six Hand. Mit TensorFlow! Das heißt auch noch Machine Learning-Kram"}, {"id": 164, "start": 1436.52, "end": 1440.2, "text": "dabei. Und für was ist das Machine Learning jetzt genau? Das hab ich nicht gecheckt."}, {"id": 165, "start": 1440.2, "end": 1453.08, "text": "Ok. Ok, der nimmt Bilder von seinem Auto auf und lässt damit Machine Learning trainieren."}, {"id": 166, "start": 1453.08, "end": 1467.92, "text": "Aber, aber warum? Ah, das ist, dass er automatisch lernt, wie er, na gut, man könnte, das ist"}, {"id": 167, "start": 1467.92, "end": 1473.84, "text": "eigentlich ziemlich Six Head. Wisst ihr warum? Das ist ziemlich clever. Das ist wirklich"}, {"id": 168, "start": 1473.84, "end": 1479.92, "text": "clever. Weil ansonsten müsste der ja immer an der gleichen Stelle parken. Und so hat"}, {"id": 169, "start": 1479.92, "end": 1487.44, "text": "sein Raspberry Pi gelernt, wie der Charging-Port aussieht vom Auto und egal wie er parkt, kann"}, {"id": 170, "start": 1487.44, "end": 1497.84, "text": "das Ding sich automatisch andocken, weil er immer den Charging-Port findet. Das ist schlau."}, {"id": 171, "start": 1497.84, "end": 1520.2, "text": "Six Head. Quatsch schon. Quatsch schon. Fourteen Head. Automatische Meditation, genau. Btw."}, {"id": 172, "start": 1520.2, "end": 1530.24, "text": "Es ist meistens eine blöde Idee, mit dem Finger GPIO-Pins kurz zu schließen. Meistens"}, {"id": 173, "start": 1530.24, "end": 1536.72, "text": "macht das nichts, meistens passiert da nichts. Meistens erwischst du auch nicht gerade irgendwie"}, {"id": 174, "start": 1536.72, "end": 1542.28, "text": "den 5-Volt-Pin und gehst auf ein GPIO-Input oder irgendwas. Aber es ist in der Regel eine"}, {"id": 175, "start": 1542.28, "end": 1551.84, "text": "doofe Idee, mit dem Finger GPIO-Pins kurz zu schließen. Das kann schon mal in die Hose"}, {"id": 176, "start": 1551.84, "end": 1563.76, "text": "gehen. Aber bringt das so viel? Steckereien ist jetzt nicht so auffällig. Naja, der Steckereien,"}, {"id": 177, "start": 1563.76, "end": 1567.44, "text": "der muss ja an der richtigen Stelle angesetzt werden, je nachdem wie tiefer in die Garage"}, {"id": 178, "start": 1567.44, "end": 1572.48, "text": "gefahren ist. Also sprich, wenn er ein bisschen weiter vorne ist, dann wird es ja nicht passen."}, {"id": 179, "start": 1572.48, "end": 1577.96, "text": "Da muss jetzt quasi automatisch erkennen, wo der Lade-Port ist und dann mit diesem Klappmechanismus"}, {"id": 180, "start": 1577.96, "end": 1589.0, "text": "das einfädeln. Bin mal gespannt, wie das funktioniert. Warum er das nicht händisch"}, {"id": 181, "start": 1589.0, "end": 1598.32, "text": "macht? Ja gut. Das verstehe ich auch nicht. Weil es geht wahrscheinlich. Weil es cool"}, {"id": 182, "start": 1598.32, "end": 1620.32, "text": "ist, wenn du reinfährst in die Garage und auf einmal kommt so ein Greifarm und schiebt"}, {"id": 183, "start": 1620.32, "end": 1632.68, "text": "ein Auto. Ich höre was moveen. Ne, der Greifarm zertratzt nicht ein Auto. Er hat doch ein"}, {"id": 184, "start": 1632.68, "end": 1636.96, "text": "Ultraschall-Sensor dran, der den Abstand zum Auto misst. Das ist das Auto nicht beschädigt."}, {"id": 185, "start": 1636.96, "end": 1663.12, "text": "Okay, das Ding macht ein Foto und dann guckt er, wo ist der, das heißt nicht Spiegel, wie"}, {"id": 186, "start": 1663.12, "end": 1671.04, "text": "heißt denn das auf Deutsch? Ich glaube, das heißt auch Reflektor, oder? Als so ein Ding,"}, {"id": 187, "start": 1671.04, "end": 1678.96, "text": "wo man im dunklen halt was besser sieht. So was, was man am Fahrrad hat. So, der sucht,"}, {"id": 188, "start": 1678.96, "end": 1684.96, "text": "wo der Reflektor ist. Das ist das Schlau. Sixhead."}, {"id": 189, "start": 1684.96, "end": 1706.88, "text": "Aber wie geht denn der Charger auf? Ist da nicht eine Klappe? Oder klappt die automatisch"}, {"id": 190, "start": 1706.88, "end": 1715.28, "text": "auf? Mit über die API, ja. Schlau."}, {"id": 191, "start": 1736.88, "end": 1759.84, "text": "Wie er das trainiert hat, ich denke mal, der hat einfach ganz viele Fotos von seinem Auto"}, {"id": 192, "start": 1759.84, "end": 1767.44, "text": "durchlaufen lassen. Gleich geht's rein, genau."}, {"id": 193, "start": 1789.84, "end": 1793.6, "text": "Sieht ja schon ein bisschen unanständig aus."}, {"id": 194, "start": 1820.72, "end": 1824.8, "text": "Ich mein, es dauert ein bisschen, aber das ist ja nicht wild."}, {"id": 195, "start": 1824.8, "end": 1850.24, "text": "Geh mir den Deck rein."}, {"id": 196, "start": 1854.8, "end": 1868.24, "text": "Das ist mal wirklich nächstes Level hier."}, {"id": 197, "start": 1885.2, "end": 1891.28, "text": "Das ist ja geil. So, und der Tommy hat das geschehen. So was willst du dir selbst bauen?"}, {"id": 198, "start": 1891.28, "end": 1897.52, "text": "Das stelle ich mir sehr aufwendig vor. Also da bist du bestimmt ein paar Wochen"}, {"id": 199, "start": 1897.52, "end": 1903.68, "text": "beschäftigt, bis das funktioniert. Aber es ist auf jeden Fall ein schönes Bastelprojekt."}, {"id": 200, "start": 1903.68, "end": 1915.84, "text": "Ja, ja, das musst du uns zeigen, unbedingt, wenn es fertig ist."}, {"id": 201, "start": 1915.84, "end": 1940.4, "text": "Die Frage ist halt auch, wie kannst du das überprüfen? Mega beispielsweise hat er früher auch gesagt, sie können gar nicht sehen, was da eigentlich drauf ist. Keine Ahnung."}, {"id": 202, "start": 1940.4, "end": 1949.84, "text": "Ich würde Cloud Storage nur verwenden, wenn ich selbst verschlüssel. Und nicht die das verschlüsseln."}, {"id": 203, "start": 1949.84, "end": 1954.8, "text": "Was spricht denn dagegen, irgendeinen x-beliebigen Cloud Service zu nehmen und selbst zu verschlüsseln?"}, {"id": 204, "start": 1954.8, "end": 1965.04, "text": "Ach so, weil du sünden willst, das heißt, du bräuchtest dort irgendwas, was wieder decrypten kann, dann geht es auf Mobile schon mal nicht richtig."}, {"id": 205, "start": 1965.04, "end": 1972.56, "text": "Ja, okay. Wahrscheinlich ist das das Problem."}, {"id": 206, "start": 1972.56, "end": 1996.0, "text": "Wahrscheinlich, weil die Bilder irgendwie zwischengespeichert werden bei irgendeinem CDN und da ist es halt langsam gerade."}, {"id": 207, "start": 1996.0, "end": 2019.84, "text": "Na, es ist jetzt für die Heim, für die Heim doch nichts. Ich will hauptsächlich ein paar Container laufen lassen, eine VM, ich will Samba Shares über das Webinterface einrichten, es ist was, wenn du hauptsächlich VMs erstellen willst, will ich doch gar nicht."}, {"id": 208, "start": 2019.84, "end": 2035.6, "text": "Ein Kotlin Stream."}, {"id": 209, "start": 2035.6, "end": 2040.48, "text": "Irgendwann Leute, irgendwann machen wir auch mal Java im Stream."}, {"id": 210, "start": 2040.48, "end": 2055.2, "text": "MonkaS"}, {"id": 211, "start": 2055.2, "end": 2062.32, "text": "Meine Frage, wie wechselst du immer zwischen deinen Desktops, wenn du in einer VM arbeitest und dann auf Windows wechseln willst? Ganz einfach, zeige ich dir schnell."}, {"id": 212, "start": 2062.32, "end": 2087.92, "text": "Guck mal da, da ist die VM, hier ist das, was wir gestern gemacht haben, also ich drücke, wir fangen anders an, wir sind auf Windows, die VM habe ich auf dem 2. Desktop, der 3. Desktop ist leer, die VM ist auf dem 2. Desktop und es gibt in Windows ein eingebautes Shortcut,"}, {"id": 213, "start": 2087.92, "end": 2108.32, "text": "das ist Ctrl, Windows Taste und dann mit den Pfeiltasten links und rechts die Desktops durchswitchen, wahrscheinlich kann man das irgendwie in den Untiefen der Registry umstellen, keine Ahnung, das ist aber Default, das kannst du auch machen, DrZombie, das funktioniert bei dir auf jeden Fall, weil das ist Windows Default."}, {"id": 214, "start": 2108.32, "end": 2132.16, "text": "So, ich habe einfach mehrere Desktops und auf dem habe ich Linux, so und jetzt ist die Sache folgendermaßen, wenn ich dorthin switche, auf den Desktop, dann ist easy, dann klicke ich rein und mache hier was und dann geht das, wenn ich raus will, dann geht ja die Windows Taste nicht, guck, wenn ich Ctrl, Windows, Pfeiltaste drücke, dann kommen irgendwelche Escape Dinger in der Shell."}, {"id": 215, "start": 2132.16, "end": 2152.96, "text": "Also, was muss ich vorher machen, ich muss vorher drücken, Ctrl, Alt, Ctrl, Alt, nimmt den Fokus aus der VM und dann kann ich direkt nacheinander wieder die Windows Taste verwenden und nachdem die Taste direkt nebeneinander sind, geht das schnell, guck, Ctrl, Alt, Ctrl, Windows und Pfeiltaste rein, easy."}, {"id": 216, "start": 2152.96, "end": 2174.0, "text": "Das kannst du auch machen, das muss übrigens nicht VMWare sein, du kannst ja auch genauso gut VMWare Player oder Virtual Box oder irgendwas nehmen, du musst bloß dir die Tastenkombination merken für, wie release ich den Fokus von der VM und dann machst du die Windows-Standard-Taste."}, {"id": 217, "start": 2174.0, "end": 2199.6, "text": "Ja, wenn du in der VM drinne bist, die Desktops durchswitchen halt, so wie das der jeweilige Desktop-Manager in der VM gerade mag, oder Ctrl, Windows, um die VM zu eskämen, ich glaub nicht, dass du das beides binden kannst, dann geht wahrscheinlich das andere nicht mehr."}, {"id": 218, "start": 2199.6, "end": 2221.2, "text": "Also was ich früher gemacht hab ist, ich hab meine Mouse verwendet, beziehungsweise die Scripting-Software von der Mouse, dann hab ich quasi die Knopfbuttonpresses simuliert, aber ganz ehrlich, ich hab mich jetzt einfach dran gewöhnt, ich druck jetzt ganz schnell nebeneinander, Ctrl, Alt, Ctrl, Windows, zack."}, {"id": 219, "start": 2221.2, "end": 2229.84, "text": "Ja, aber ich glaube, du kannst es nicht auf was legen, was schon benutzt ist, weil das kommt doch garantiert in die Quere."}, {"id": 220, "start": 2229.84, "end": 2254.08, "text": "Ach, das geht ja, ja, dann ist Geschmackssache, wenn das geht, guck mal, der Chat sagt, das geht, der Chat hat ja immer sowas prinzipiell immer recht und leckt nie critical information."}, {"id": 221, "start": 2260.08, "end": 2289.28, "text": "Warum unterschiedlich UI schlecht ist? Okay, das ist jetzt, das ist so ein bisschen was, wie man das aus einem Vorlieben hat, also, da muss ich jetzt mal versuchen, das zu erklären, also, du kannst ja, wenn du UI-Frameworks entwickelst, du kannst dir ja prinzipiell zwei verschiedene Ansätze fahren, entweder, du machst so ein Meta-Framework, was die ganzen Steuerelemente der jeweiligen Plattform quasi abstrahiert, also zum Beispiel,"}, {"id": 222, "start": 2289.28, "end": 2308.24, "text": "ähm, keine Ahnung, das Fenster, ja, und der Windows sieht das, und der Windows muss man das so machen, und der Mac sieht das anders aus, und der Linux siehts nochmal anders aus, oder so ne Input-Box hier zum Beispiel, ja, oder der File-Dialog oder sowas in der Richtung, ja."}, {"id": 223, "start": 2308.24, "end": 2323.84, "text": "Das sind ja quasi so Native-Steuerelemente, oder hier, die, die, die, die Winno, die, wie nennt man das überhaupt hier, diese, diese Settings-Leiste da oben. So, das sieht unter Windows anders aus, als unter Mac aussieht, anders als unter Android aussieht, anders als unter iOS aussieht."}, {"id": 224, "start": 2323.84, "end": 2343.04, "text": "So, da gibt's den Ansatz, du machst so ein Meta-Framework, in dem du quasi sagst, ich mach das so, dass unter der Haube immer noch die Native-Steuerelemente verwendet werden, also die Sachen aus Windows und Mac und die Sachen aus Android und iOS, und mach das aber so, dass man's über eine Schnittstelle ansteuern kann."}, {"id": 225, "start": 2343.04, "end": 2354.8, "text": "Unter der Haube verteilt das mein Framework so, dass die jeweilige Plattform richtig funktioniert, aber derjenige, der's programmiert, der muss halt nur eine Textbox machen, anstatt eine Textbox für jede Plattform zu programmieren."}, {"id": 226, "start": 2354.8, "end": 2379.6, "text": "So, das ist insofern ganz nice, weil die Anwendung dann überall aussieht, wie als gehört sie eben auf die Plattform, ja, das sind Steuerelemente von Windows unter Windows und Steuerelemente von Mac unter Mac und so weiter, und trotzdem ist die Codebase relativ kompakt, weil du's ja nur einmal programmieren musst und ja, dein Framework macht das dann für die ganzen Plattformen."}, {"id": 227, "start": 2379.6, "end": 2408.4, "text": "So, das ist, an sich könnte man denken, ganz cool, aber das hat natürlich auch seine Nachteile, nämlich, du bist auf dem kleinsten gemeinsamen Nenner, also sprich, wenn du jetzt zum Beispiel, machen wir irgendwie mal Control Panel oder irgendwas auf, ja, wenn jetzt diese komische Textbox unter Windows die Möglichkeit bietet, was zu kopieren und die unter Mac nicht, ja, was machst du dann?"}, {"id": 228, "start": 2408.4, "end": 2436.16, "text": "Baust du dann ne Funktion ein, machst du dann wieder ne Abfrage, ist es Windows, verzichtest du auf die Funktion, weil es der kleinste gemeinsame Nenner eben nicht kann, ich weiß nicht, ob KMM das nicht so macht, hat sich zumindest so gelesen, also was machst du dann, das ist insofern ganz nice, aber da fangen die Probleme dann schon an."}, {"id": 229, "start": 2436.16, "end": 2462.48, "text": "Und du hast auch das Problem, dass die Anwendung nicht überall gleich aussieht, das heißt, du musst dann trotzdem wieder, an manchen Stellen, so Betriebssystem-abhängige Optimierungen machen, weil zum Beispiel, ist halt unter Windows eventuell Hardcoded um diese Textbox ein blauer Rand, aber du willst keinen blauen Rand, weil dann dein Button nicht stimmt."}, {"id": 230, "start": 2462.48, "end": 2492.48, "text": "Und da unter Android ist dann beispielsweise kein blauer Rand, deswegen musst du die ganze Sache wieder zwei Pixel nach links schieben, also du musst dann im Endeffekt doch wieder, je nachdem wie gut das Framework gemacht ist, paar Optimierungen machen, zumindest eins ist klar, die App sieht dann nicht überall gleich aus, was dann wieder zu Problemen führen kann, weil die unterschiedlichen Betriebssysteme haben ja auch unterschiedliche Bedien-Guidelines, ja, beispielsweise unter Android ist es ganz beliebt, dass du hier unten diesen komischen, äh,"}, {"id": 231, "start": 2492.48, "end": 2498.96, "text": "Enden-Knopf hast und hier oben irgendwie so ein Sidebar-Menü, das hast du ja unter Windows standardmäßig gar nicht."}, {"id": 232, "start": 2498.96, "end": 2514.08, "text": "Also das sind so die Probleme, die du hast, wenn du so ein Meta-Framework verwendest, sowas wie MAUI zum Beispiel,.NET MAUI, die versuchen sowas zu machen, das ist meiner Meinung nach eine blöde Idee."}, {"id": 233, "start": 2514.08, "end": 2528.08, "text": "Ja, du hast den Vorteil, es sieht alles native aus, aber halt mit den Nachteilen der ganzen Plattform und dass du eben, dass es nie so aussieht, wie du es wirklich aussehen möchtest."}, {"id": 234, "start": 2528.08, "end": 2542.64, "text": "So, der bessere Ansatz meiner Ansicht nach ist, man malt seine Controls selbst, das sieht dann zwar nicht so richtig krass native aus, aber die Leute sind heutzutage eh an Webseiten gewöhnt."}, {"id": 235, "start": 2542.64, "end": 2558.0, "text": "Also, du schockst heute keinen mehr, wenn eine Anwendung aussieht wie eine Webseite und wenn du was hast, was die Steuerelemente selbst malt, dann sieht die Anwendung halt unter allen Betriebssystemen eben so aus, wie sie ja aussehen soll."}, {"id": 236, "start": 2558.0, "end": 2564.56, "text": "Und du bist auch nicht darauf festgelegt, dass die einen können rechtsklick, copy, paste, die anderen nicht, es ist dann halt einfach so."}, {"id": 237, "start": 2564.56, "end": 2578.56, "text": "Deswegen finde ich es ganz gut, wie das beispielsweise Avalonia macht, oder Flutter macht, oder jedes gescheite UI Framework macht."}, {"id": 238, "start": 2578.56, "end": 2600.32, "text": "So, ja, also eins von beiden muss es ja sein letztendlich, was KMM macht. Nee, naja gut, ich scroll mal kurz runter, dass ich noch finde wo wir stehen geblieben sind."}, {"id": 239, "start": 2600.32, "end": 2614.08, "text": "Also wenn die das nicht so machen, Alter habe ich viel Text, wenn die das nicht so machen, dann musst du für jede Plattform einzeln das UI machen. Und dann hast du ja wieder von so einem einheitlichen UI Framework nichts, wenn du für jede Plattform das UI selbst machen musst."}, {"id": 240, "start": 2614.08, "end": 2626.08, "text": "Da kannst du die gemeinsame Funktionalität vielleicht in irgendeine Library packen, aber musst jede Plattform wieder native das UI basteln und dann mit deiner Library irgendwie verknüpfen."}, {"id": 241, "start": 2626.08, "end": 2639.6, "text": "Ja, das sieht dann vielleicht cool aus, aber du musst dir Gedanken dazu machen, dass die App auf jeder Plattform ständig so quasi nach den aktuellen Plattform Richtlinien ist und dass alles auch richtig funktioniert."}, {"id": 242, "start": 2639.6, "end": 2664.56, "text": "Das heißt, du hast dann eine native Android App, eine native iOS App, eine native Windows App, eine native Mac App und tja, native Linux App in der Form, schwer zu sagen, was da eigentlich native ist und da hast du jetzt auch nicht so wirklich viel Arbeitserleichterung von, oder?"}, {"id": 243, "start": 2664.56, "end": 2682.16, "text": "Ja, das ist dann zu native Code Kombi, das leuchtet mir ein, aber das ist halt ein ganz schöner Aufwand und genau aus diesem Grund würde ich irgendwie sowas wie Flutter oder eben Ionic React Native oder irgendwie sowas verwenden heutzutage für übergreifende Mobile Apps."}, {"id": 244, "start": 2682.16, "end": 2698.64, "text": "Sieht überall gleich aus, funktioniert überall gleich und du kannst mehr oder weniger alles mitmachen, was du für die meisten Apps brauchst, aber das ist keine native UI, ist doch egal, Hauptsache, die lässt sich gescheit bedienen und die User benutzen das und geben Geld aus, da drin."}, {"id": 245, "start": 2698.64, "end": 2718.32, "text": "Ja, du kannst in Flutter verschiedene Views machen, das ist richtig, aber Flutter zeichnet soweit, ich weiß immer, die Steuerelemente selbst, das einzige, was die haben, ist verschiedene Skins für die Steuerelemente."}, {"id": 246, "start": 2718.32, "end": 2732.8, "text": "Das ist eine Verfeinerung von dem einen dieser zwei Fälle, die ich gesagt habe. Du kannst ja auch die selbstgezeichneten Steuerelemente etwas so skinnen, dass sie ähnlich der native Platform aussehen."}, {"id": 247, "start": 2732.8, "end": 2743.28, "text": "Ja, natürlich, dann gibt es immer so ein paar Dinge, die nicht so ganz passen, aber das geht und du hast trotzdem die Probleme nicht mit ein paar Pixel falsch und sowas."}, {"id": 248, "start": 2743.28, "end": 2752.4, "text": "Da musst du immer aufstehen, also ich stehe 7 oder 7 bis 7.30 Uhr auf, wenn ich Home Office mache und wenn ich auf die Arbeit gehe, auch in dem Dreh."}, {"id": 249, "start": 2752.4, "end": 2758.16, "text": "Also immer so, früher bin ich 5 vor 45 Uhr aufgestanden, Alter."}, {"id": 250, "start": 2758.16, "end": 2763.36, "text": "Weiß gar nicht, wie ich das ausgehalten habe."}, {"id": 251, "start": 2763.36, "end": 2776.32, "text": "Ach ja, PWAs, zum Thema PWAs, wenn ich jetzt gerade schon ein bisschen am Ranten über Apple und sowas bin, bzw. nee, fange ich jetzt mal an zu ranten über Apple."}, {"id": 252, "start": 2776.32, "end": 2783.84, "text": "PWAs unter iOS sind einfach übelste Abfall. Die sind nicht cute, auch wenn das heute Cute Stream ist."}, {"id": 253, "start": 2783.84, "end": 2794.56, "text": "PWAs unter iOS funktioniert die Hälfte nicht, wo man eigentlich davon ausgehen würde, dass die im Jahr 2022 funktionieren sollten, aber das gibt es nicht."}, {"id": 254, "start": 2794.56, "end": 2807.36, "text": "Wer es genau wissen will, geht auf Can I Use und lässt sich mal ein paar Sachen, ein paar PWAs auflisten, wobei ich nicht weiß, wie das ist."}, {"id": 255, "start": 2807.36, "end": 2814.08, "text": "Und da werdet ihr feststellen, tja, es geht einiges halt einfach unter Safari nicht."}, {"id": 256, "start": 2814.08, "end": 2824.4, "text": "Und nachdem es unter iOS keinen anderen Browser gibt, außer Safari, ist es halt mit PWAs unter iOS nichts."}, {"id": 257, "start": 2824.4, "end": 2835.92, "text": "Hier, Safari iOS. Safari iOS hat halt bei vielem so ein paar Probleme."}, {"id": 258, "start": 2835.92, "end": 2847.36, "text": "Und manches geht in Safari, allerdings nur in Safari. Im Safari Safari und nicht im Safari Webview. Manches geht nur im Safari, wenn du den Safari aufmachst."}, {"id": 259, "start": 2847.36, "end": 2855.6, "text": "Aber ganz ehrlich, Apple hat keinerlei Interesse an PWAs. Die haben wirklich das Mindeste nur implementiert."}, {"id": 260, "start": 2855.6, "end": 2873.28, "text": "Natürlich ist das gewollt. Was heißt gewollt? Ja, es ist gewollt, aber ein bisschen unfähig sind sie wahrscheinlich auch."}, {"id": 261, "start": 2873.28, "end": 2877.68, "text": "Du hoffst, dass eine EU-Regulierung kommt, dass Apple andere Browser zulassen muss."}, {"id": 262, "start": 2877.68, "end": 2885.84, "text": "Ich glaube, bis die EU überhaupt verstanden hat, dass es unter iOS nur einen Browser gibt, dafür gehen noch 20 Jahre."}, {"id": 263, "start": 2885.84, "end": 2893.12, "text": "Weil dann kommt dann irgend so ein komischer Typ aus dem EU-Parlament und sagt, wie ich hab doch Firefox bei mir auf dem iPhone."}, {"id": 264, "start": 2893.12, "end": 2899.52, "text": "Es gibt doch Firefox auf dem iPhone, wo ist denn das Problem? Da gibt's schon Entwürfe, wirklich?"}, {"id": 265, "start": 2899.52, "end": 2914.24, "text": "Das wäre auf jeden Fall nice, wenn es einen richtigen Firefox unter iOS gibt. Oder auch vielleicht einen, eigentlich nur einen Firefox, was anderes gibt es ja nicht."}, {"id": 266, "start": 2914.24, "end": 2928.24, "text": "Es gibt ja außer Firefox nichts mehr. Es gibt im Endeffekt Chrome und auch noch ein neues Alpha 4 Games Video, das können wir uns nachher angucken."}, {"id": 267, "start": 2928.24, "end": 2938.96, "text": "Es gibt Chrome bzw. Plink, Plink heißt es ja korrekterweise, Plink. Ist es unter Mac OS ein richtiger Firefox? Ja, ist es."}, {"id": 268, "start": 2938.96, "end": 2950.64, "text": "Es gibt Plink, das ist quasi die Browser Engine von Chrome. Es gibt Firefox, Gecko oder wie das heißt. Und es gibt WebKit, das ist Safari."}, {"id": 269, "start": 2950.64, "end": 2964.16, "text": "Also eigentlich, ja gut, es wäre cool, wenn es Chrome und Firefox da unter iOS gäbe, einen richtig echten Chrome und Firefox. Das wäre nice."}, {"id": 270, "start": 2964.16, "end": 2973.04, "text": "Opera Gaming Browser ist Chrome. Oder unter iOS halt ist Safari."}, {"id": 271, "start": 2973.04, "end": 2982.16, "text": "Ich finde Teams ist tatsächlich ganz brauchbar irgendwie."}, {"id": 272, "start": 2982.16, "end": 2994.4, "text": "Das stimmt, da hast du komplett recht. Wenn du es mit Teamspeak vergleichst, ist Discord lahm as fuck. Man muss aber mal Teamspeak vergleichen, ich meine ernsthaft."}, {"id": 273, "start": 2994.4, "end": 3005.44, "text": "Vergleicht mal das, also rein von der UI her und den Möglichkeiten mit dem da."}, {"id": 274, "start": 3005.44, "end": 3020.8, "text": "Also ich mein, da sind schon so 20 Jahre dazwischen oder? Aber ja natürlich, Teamspeak ist immer ein vielfaches, ja TS5 ist mit Sicherheit auch langsamer, wenn ich mir das UI angucke."}, {"id": 275, "start": 3020.8, "end": 3032.24, "text": "Garantiert. Das ist wahrscheinlich auch langsamer, das ist unter der Haube wahrscheinlich auch nur ein Browser."}, {"id": 276, "start": 3032.24, "end": 3039.04, "text": "Irgend ein Webview oder so. Aber solange sie ihre Audiosachen native lassen, ist ja alles gut."}, {"id": 277, "start": 3039.04, "end": 3051.28, "text": "Aber das stimmt schon, Discord ist ein bisschen langsamer, man darf aber nicht vergessen, erstens Discord ist wie gesagt ein Browser und zweitens, Discord macht halt auch ganz schön viel im Hintergrund."}, {"id": 278, "start": 3051.28, "end": 3062.24, "text": "Also beziehungsweise, was heißt im Hintergrund, im Hintergrund auch, wenn du da in 200 Channels bist, aber Discord kann halt auch ganz schön viele Funktionen."}, {"id": 279, "start": 3062.24, "end": 3074.4, "text": "Und ich finde dafür, dass es eine Browser Anwendung ist, die so viel kann, ist Discord tatsächlich wirklich erträglich. Discord ist wenn es geöffnet ist eigentlich relativ gut zu benutzen."}, {"id": 280, "start": 3074.4, "end": 3078.08, "text": "Nee Discord kannst du nicht selbst hosten."}, {"id": 281, "start": 3078.08, "end": 3088.16, "text": "Das einzig doofe an Discord ist halt, dass die Startzeit relativ lahm ist, aber das geht auch, wenn du es mal gestartet hast und das alles schön gecached ist."}, {"id": 282, "start": 3088.16, "end": 3100.4, "text": "Und ansonsten, dass es halt mal die üblichen Verdächtigen wieder gibt, von Channels nicht verfügbar, Server nicht verfügbar, Message kann gerade nicht verarbeitet werden und sonst was."}, {"id": 283, "start": 3100.4, "end": 3108.96, "text": "Ja, aber im Großen und Ganzen funktioniert Discord erstaunlich gut, was wahrscheinlich auch der Grund ist, dass Discord so diese Dominanz hat."}, {"id": 284, "start": 3108.96, "end": 3116.08, "text": "Was ist eigentlich aus dem Discord Game Store oder so gewesen, was es mal gab?"}, {"id": 285, "start": 3116.08, "end": 3123.36, "text": "What happened to the Discord Store?"}, {"id": 286, "start": 3123.36, "end": 3130.0, "text": "Ah, Nitro Games ist wieder weg. Okay alles klar, hab ich gar nicht mitgekriegt."}, {"id": 287, "start": 3130.0, "end": 3149.36, "text": "Ja tschüss."}, {"id": 288, "start": 3149.36, "end": 3156.96, "text": "Vielleicht gucken wir uns das wirklich irgendwann mal an. Teams auf Linux, ich verwende Teams nur im Browser."}, {"id": 289, "start": 3156.96, "end": 3165.04, "text": "Das funktioniert unter Linux genauso gut wie unter Windows. Native Klein kann ich nichts zu sagen."}, {"id": 290, "start": 3165.04, "end": 3171.44, "text": "Wobei der Native Klein ja eigentlich auch nur ein verpackter Browser ist. Moin Sirius Max."}, {"id": 291, "start": 3171.44, "end": 3177.44, "text": "Muss man, ich muss mal. Tauri ist dieses Elektron, was den Native Webview verwendet."}, {"id": 292, "start": 3177.44, "end": 3187.2, "text": "Oder nie angeguckt weiter."}, {"id": 293, "start": 3187.2, "end": 3197.36, "text": "PortAudi, ist das irgendwas Apple-mäßiges?"}, {"id": 294, "start": 3197.36, "end": 3200.48, "text": "Na doch, gibt es ja."}, {"id": 295, "start": 3200.48, "end": 3203.2, "text": "Naja, nee, gibt es eigentlich nicht wirklich."}, {"id": 296, "start": 3203.2, "end": 3205.32, "text": "Eigentlich nicht wirklich."}, {"id": 297, "start": 3205.32, "end": 3213.2, "text": "Es gibt eigentlich kein gescheites Plattform-Übergreifungs-UI-Framework, es gibt Flutter, das ist super für Mobile."}, {"id": 298, "start": 3213.2, "end": 3218.72, "text": "Allerdings auf dem Desktop, naja, naja."}, {"id": 299, "start": 3218.72, "end": 3223.24, "text": "Es gibt Qt, das ist auf dem Desktop ganz okay."}, {"id": 300, "start": 3223.24, "end": 3228.8, "text": "Aber Mobile, naja."}, {"id": 301, "start": 3228.8, "end": 3233.48, "text": "Es gibt Maui, das ist immer crap."}, {"id": 302, "start": 3233.48, "end": 3237.48, "text": "Und es gibt halt tatsächlich browserbasierter Kram."}, {"id": 303, "start": 3237.48, "end": 3242.28, "text": "Das ist das Beste, was es aktuell gibt für wirklich echtes Cross-Plattform."}, {"id": 304, "start": 3242.28, "end": 3247.48, "text": "Deswegen habe ich ja vorhin gesagt, deswegen war Discord ja auch so clever zu sagen, wir fangen erst gar nicht an damit,"}, {"id": 305, "start": 3247.48, "end": 3251.64, "text": "sondern nehmen einfach einen Chrome und packen den als eigene Anwendung ein."}, {"id": 306, "start": 3251.64, "end": 3259.48, "text": "Matrix, Dankeschön für den Sub. 20 Monate Massive Subscription hier."}, {"id": 307, "start": 3259.48, "end": 3267.36, "text": "Im Backend ist Discord blazingly fast. Wie ist Discord etwa written in Rust?"}, {"id": 308, "start": 3267.36, "end": 3271.52, "text": "Ist das denn möglich überhaupt?"}, {"id": 309, "start": 3271.52, "end": 3276.24, "text": "Blazingly fast kann ja nur written in Rust sein."}, {"id": 310, "start": 3276.24, "end": 3280.72, "text": "Aber ich habe noch nie gelesen, dass Discord back-end-technisch written in Rust wäre."}, {"id": 311, "start": 3280.72, "end": 3281.68, "text": "Vor allem warum?"}, {"id": 312, "start": 3281.68, "end": 3288.84, "text": "Wollen die fünfmal länger brauchen für alle Features jetzt, weil sie es in Rust programmieren?"}, {"id": 313, "start": 3288.84, "end": 3296.52, "text": "Gut, ich meine, man kann ja kritische Parts durchaus in Rust programmieren."}, {"id": 314, "start": 3296.52, "end": 3300.8, "text": "Hast du an deinem Server eigentlich ein Monitor angeschlossen oder ein IPME-Modul?"}, {"id": 315, "start": 3300.8, "end": 3303.32, "text": "Aha, weder noch."}, {"id": 316, "start": 3303.32, "end": 3307.32, "text": "Meine alte Kiste hatte IPME bzw. Management-Interface."}, {"id": 317, "start": 3307.32, "end": 3316.92, "text": "Ich habe einen."}, {"id": 318, "start": 3316.92, "end": 3319.32, "text": "Nee, nicht Spider."}, {"id": 319, "start": 3319.32, "end": 3322.44, "text": "Nee, Spider? So?"}, {"id": 320, "start": 3322.44, "end": 3324.64, "text": "So einen Teil habe ich mir gekauft."}, {"id": 321, "start": 3324.64, "end": 3329.48, "text": "Bei Ebay für irgendwie 35€ mal."}, {"id": 322, "start": 3329.48, "end": 3339.88, "text": "Das ist quasi ein Remote-KVM, sprich du schließt am Server USB und VGA oder Display an"}, {"id": 323, "start": 3339.88, "end": 3342.96, "text": "und hier machst du das Netzwerk-Kabel rein"}, {"id": 324, "start": 3342.96, "end": 3346.36, "text": "und dann kannst du über den Browser das aufmachen und mittlerweile"}, {"id": 325, "start": 3346.36, "end": 3350.32, "text": "Nee, Pika, vor allem wozu? Man kann sich so ein Ding von Apple und Apple bei Ebay kaufen."}, {"id": 326, "start": 3350.32, "end": 3354.44, "text": "Und mittlerweile, das ist so geil, könnt ihr euch noch daran erinnern, wir haben das"}, {"id": 327, "start": 3354.44, "end": 3361.52, "text": "zusammen im Stream geupdatet, dass dieses Produkt ist, ohne Scheiß, ich glaube von 2003"}, {"id": 328, "start": 3361.52, "end": 3362.52, "text": "oder so."}, {"id": 329, "start": 3362.52, "end": 3377.34, "text": "Das Produkt ist ue, ue, ue alt. PC Pro Recommendation, das ist ue alt. Und es gab letztens erst noch"}, {"id": 330, "start": 3377.34, "end": 3380.36, "text": "ein Firmware-Update mit einem HTML5-Interface, muss man sich mal vorstellen."}, {"id": 331, "start": 3380.36, "end": 3388.32, "text": "Die supporten das ding einfach seit irgendwie 18 Jahren oder so."}, {"id": 332, "start": 3388.32, "end": 3394.52, "text": "Und es gibt ja immer noch vier mehr Updates. Da können sich manche Android-Handys mal was dran abschneiden."}, {"id": 333, "start": 3396.84, "end": 3398.84, "text": "Schauen wir mal kurz, wann kam das denn raus?"}, {"id": 334, "start": 3403.04, "end": 3410.36, "text": "Wann wurde das released, das Ding? Ich meine, guckt euch mal die Webseite an, da siehst du schon. Steht da irgendein Datum drinnen? Date oder so?"}, {"id": 335, "start": 3410.36, "end": 3417.12, "text": "Ja, ne, ne, ne, ne, ne. Da habe ich den ja schon länger. Das ist ein neues Handbuch."}, {"id": 336, "start": 3420.12, "end": 3426.8, "text": "Also ich hatte eine, ich hatte eine Firmware von sonst wann, 2008 oder so."}, {"id": 337, "start": 3430.04, "end": 3432.04, "text": "Hier, 2000"}, {"id": 338, "start": 3432.04, "end": 3438.52, "text": "Release Notes, Firmware, Firmware Release Notes, Leute."}, {"id": 339, "start": 3442.84, "end": 3444.84, "text": "2013"}, {"id": 340, "start": 3445.36, "end": 3450.96, "text": "2008, das ist, das ist wirklich uralt und letztens, ne, die sind, die kosten nicht viel auf Ebay."}, {"id": 341, "start": 3454.48, "end": 3456.48, "text": "Spider-Man"}, {"id": 342, "start": 3456.48, "end": 3460.48, "text": "Oh, oh"}, {"id": 343, "start": 3463.08, "end": 3465.84, "text": "Monkeys, aktuell kosten die aber wirklich einiges."}, {"id": 344, "start": 3469.28, "end": 3471.96, "text": "Okay, dann ist es keine gute Idee, die aktuell zu kaufen."}, {"id": 345, "start": 3474.16, "end": 3476.64, "text": "Leute, ich habe die mega billig auf Ebay bekommen."}, {"id": 346, "start": 3478.08, "end": 3480.88, "text": "Ich meine, ich gebe 800 Euro dafür aus."}, {"id": 347, "start": 3480.88, "end": 3487.0, "text": "Ha, das ist ja ein Schnapper, das ist ja ein Schnapper. 843 Euro plus 271 Versand."}, {"id": 348, "start": 3491.04, "end": 3494.04, "text": "Beendete Angebote, wo macht man das?"}, {"id": 349, "start": 3494.76, "end": 3500.84, "text": "Ich, ich kenne mich, ich kenne mich bei Ebay nicht aus. Die haben mich nicht umsonst gebannt, bei Ebay kleiner zeigen, nicht bei Ebay."}, {"id": 350, "start": 3501.64, "end": 3503.64, "text": "Wo, wo macht man das?"}, {"id": 351, "start": 3507.28, "end": 3509.28, "text": "Links?"}, {"id": 352, "start": 3509.28, "end": 3511.28, "text": "Links?"}, {"id": 353, "start": 3516.72, "end": 3519.96, "text": "Beendet? Aha, beendete Angebote, exzellent."}, {"id": 354, "start": 3522.72, "end": 3524.72, "text": "109,40, es ist"}, {"id": 355, "start": 3525.84, "end": 3529.32, "text": "Ja, da kommen wir schon eher, da kommen wir schon eher in die, in die Richtung."}, {"id": 356, "start": 3529.84, "end": 3536.4, "text": "Naja, kann doch sein. Ich habe das für paar, ich habe das für paarunddreißig Euro gekauft vor ein paar Jahren und jetzt kostet es halt 75."}, {"id": 357, "start": 3536.4, "end": 3538.4, "text": "Ist halt"}, {"id": 358, "start": 3539.52, "end": 3541.52, "text": "alles teurer."}, {"id": 359, "start": 3541.52, "end": 3548.08, "text": "Ja, so ein Teil habe ich da, wenn ich da mal wirklich dran muss, bei Maus und Tastatur und Bildschirm, dann mache ich es über dieses Teil."}, {"id": 360, "start": 3549.04, "end": 3555.84, "text": "Ansonsten, ich kann auch einfach, das ist ja hinter mir, sonst kann ich auch einfach an meine Capture-Card in HDMI-Kabel stöpseln."}, {"id": 361, "start": 3555.84, "end": 3561.04, "text": "Sag mal, wie, wie, wie, wie, wie weit hinterher bin ich eigentlich mit dem Chat?"}, {"id": 362, "start": 3569.6, "end": 3571.6, "text": "Okay."}, {"id": 363, "start": 3578.0, "end": 3580.0, "text": "So, das ist, da ging es um das Video."}, {"id": 364, "start": 3580.0, "end": 3593.76, "text": "Ist es schwer, KI zu entwickeln? Kommt drauf an, was man als KI definiert, aber wenn du sowas wie TensorFlow meinst, das zu benutzen geht, aber sowas auf die Beine zu stellen, ja."}, {"id": 365, "start": 3597.76, "end": 3599.76, "text": "Ja, da bist du auf jeden Fall ein bisschen beschäftigt mit."}, {"id": 366, "start": 3599.76, "end": 3605.84, "text": "Was ist denn mit meinem Android? Ich habe geupgraded auf 6.11 und seitdem kann ich USB-Geräte nicht mehr richtig durchreichen."}, {"id": 367, "start": 3607.12, "end": 3609.12, "text": "Das ist ein unfähiger Haufen dort, ey."}, {"id": 368, "start": 3612.08, "end": 3614.08, "text": "Ja, das kenne ich, das kenne ich."}, {"id": 369, "start": 3615.92, "end": 3617.92, "text": "Das ist so ein Unfall, das ist so ein Unfall."}, {"id": 370, "start": 3619.44, "end": 3622.4, "text": "Also, ich habe da, ich habe da, ich habe da, das ist so ein Unfall, wieso?"}, {"id": 371, "start": 3622.4, "end": 3624.8, "text": "Ich habe da, ich habe da, das ist so ein Unfall, das ist so ein Unfall."}, {"id": 372, "start": 3625.28, "end": 3628.32, "text": "Also, ich habe da, ich habe da, das ist so ein Unfall, das ist so ein Unfall, das ist so ein Unfall."}, {"id": 373, "start": 3628.32, "end": 3635.48, "text": "ich das kenne ich es gibt es gibt manche aber das gab es für ios nicht"}, {"id": 374, "start": 3635.48, "end": 3640.08, "text": "irgendwo irgendwas hatte ich irgendwas war ein problem ich habe mir das auch"}, {"id": 375, "start": 3640.08, "end": 3647.28, "text": "mal angeguckt hast du mal die neue light red thread api von java gesehen ist das"}, {"id": 376, "start": 3647.28, "end": 3652.12, "text": "irgendwas schickt man ein link ist das was zum kecken"}, {"id": 377, "start": 3652.12, "end": 3662.2, "text": "wie speicher ich 200.000 characters text in postgres einfach als blob fertig oder"}, {"id": 378, "start": 3662.2, "end": 3667.64, "text": "als jason kannst du speichern speichern als speichert als jason objekt wenn du"}, {"id": 379, "start": 3667.64, "end": 3670.32, "text": "noch ein bisschen mehr dazu speichern willst ansonsten kannst du einfach als"}, {"id": 380, "start": 3670.32, "end": 3678.16, "text": "als als text speichern war ich das nie gemacht habe ehrlich gesagt"}, {"id": 381, "start": 3678.16, "end": 3690.96, "text": "da bin ich nicht der richtige für was datenmarken angeht total angenehm nice"}, {"id": 382, "start": 3690.96, "end": 3701.2, "text": "es ist ja heute auch gut streben haben hast du zugriff auf feil vielleicht ja"}, {"id": 383, "start": 3701.2, "end": 3704.84, "text": "das ist natürlich die bessere variante ja das feil speichern und nur den fad"}, {"id": 384, "start": 3704.84, "end": 3709.2, "text": "in die datenbank schreiben aber du kannst auch den was halt was halt in den blob"}, {"id": 385, "start": 3709.2, "end": 3711.8, "text": "und gut ist"}, {"id": 386, "start": 3712.6, "end": 3716.72, "text": "oder eben wenn du noch ein bisschen mehr informationen speichern also wenn es"}, {"id": 387, "start": 3716.72, "end": 3721.52, "text": "ein wenn es wirklich ein jason objekt ist dann guckt ihr mal den jason support"}, {"id": 388, "start": 3721.52, "end": 3724.4, "text": "in postgres anders ist ziemlich gut mittlerweile prine dankeschön für den"}, {"id": 389, "start": 3724.4, "end": 3738.6, "text": "timeout keck aber bei 2,5 punkte rausgehauen ok"}, {"id": 390, "start": 3738.6, "end": 3742.92, "text": "übrigens du kannst mit postgres text indizieren ohne den text selbst in der"}, {"id": 391, "start": 3742.92, "end": 3747.92, "text": "datenbank zu speichern das geht du kannst den index aufbauen mit dem text"}, {"id": 392, "start": 3747.92, "end": 3758.12, "text": "aber den text muss nicht in der datenbank speichern ist es frech wenn"}, {"id": 393, "start": 3758.12, "end": 3762.44, "text": "wo davon nur 480 m mit schatz 1000 liefert heute frisch getestet vom kabel"}, {"id": 394, "start": 3762.44, "end": 3769.16, "text": "hinter den wehren vom wlan"}, {"id": 395, "start": 3769.16, "end": 3778.16, "text": "vom wlan kannst du das net testen du hast doch keinen wlan was das schafft"}, {"id": 396, "start": 3778.16, "end": 3783.32, "text": "oder hast du es auch mal mit einem kabel angeschlossen getestet"}, {"id": 397, "start": 3791.0, "end": 3794.96, "text": "weil wlan kannst du das nicht ausprobieren"}, {"id": 398, "start": 3794.96, "end": 3802.96, "text": "so ich muss mal mit den chat ein bisschen aufholen wie gesagt zu sieben uhr rum"}, {"id": 399, "start": 3807.84, "end": 3812.12, "text": "wenn man schon mal seltsam ui geht und hat schon mal web swing"}, {"id": 400, "start": 3812.12, "end": 3822.8, "text": "ernsthaft so was gibt es swing an sich ist ja schon richtig richtig 5 gigahertz"}, {"id": 401, "start": 3822.8, "end": 3828.96, "text": "du meinst nee nur weil dein wlan 5 gigahertz ist heißt es nicht dass du"}, {"id": 402, "start": 3828.96, "end": 3836.12, "text": "gigabit drüber kriegst du kannst in der theorie über wi-fi 6 und sogar schon"}, {"id": 403, "start": 3836.12, "end": 3850.64, "text": "über wi-fi was ist es i triple i 802.11 ax und i triple i 802 11 punkt ac war"}, {"id": 404, "start": 3850.64, "end": 3855.92, "text": "das davor also ich glaube du kannst es schon seit"}, {"id": 405, "start": 3857.36, "end": 3862.8, "text": "theoretisch gigabit übertragen aber in der praxis funktioniert das natürlich"}, {"id": 406, "start": 3862.8, "end": 3866.48, "text": "nicht nie"}, {"id": 407, "start": 3866.48, "end": 3881.4, "text": "standards standards gucken wir mal so i was das für eine seite ich habe es"}, {"id": 408, "start": 3881.4, "end": 3884.88, "text": "gedacht china aber es ist in der schweiz"}, {"id": 409, "start": 3887.32, "end": 3896.08, "text": "also hier seit ac kannst du theoretisch gigabit übertragen und seit"}, {"id": 410, "start": 3896.08, "end": 3904.8, "text": "wi-fi 6 bzw ax kannst du bis zu 10 aber leute vergesst das ist alles schöne"}, {"id": 411, "start": 3904.8, "end": 3912.24, "text": "zahlen aber in der praxis können es einfach mal vergessen und wirklich den"}, {"id": 412, "start": 3912.24, "end": 3921.04, "text": "speedtest zu machen über wlan ist immer fragwürdig speedtest immer über kabel"}, {"id": 413, "start": 3921.04, "end": 3925.28, "text": "und bei einem gigabit anschluss muss man sich auch mal überlegen wie aussage"}, {"id": 414, "start": 3925.28, "end": 3929.92, "text": "kräftig ist der speedtest findet man überhaupt einen server der mal nebenbei"}, {"id": 415, "start": 3929.92, "end": 3935.84, "text": "gigabit zu einem überträgt da müsste man eher ein download test mal machen"}, {"id": 416, "start": 3935.84, "end": 3941.12, "text": "per kabel und mehrere verbindungen aufmachen am besten noch zu mehreren"}, {"id": 417, "start": 3941.12, "end": 3948.2, "text": "zielen und das dann zusammen rechnen also web swing klingt ganz ähnlich ja war"}, {"id": 418, "start": 3948.2, "end": 3960.28, "text": "ich meine wenn man äpplitz monka ist ich dachte über java äpplitz sind wir"}, {"id": 419, "start": 3960.28, "end": 3983.44, "text": "hinaus oh nee oh nee please please no no please no nee nee nee das schrecklich"}, {"id": 420, "start": 3983.44, "end": 3997.52, "text": "aber plus auf ich sagte auch selbst mit wi-fi 6 kannst du komplett knicken also"}, {"id": 421, "start": 3997.52, "end": 4002.48, "text": "wlan testen ist ist nichts internet speedtest mit wlan wenn man wirklich"}, {"id": 422, "start": 4002.48, "end": 4006.08, "text": "wissen wir das maximal drüber geht ist nichts also ich würde empfehlen kabel"}, {"id": 423, "start": 4006.08, "end": 4014.04, "text": "anschließen und dann am besten auch mehrere downloads starten zu"}, {"id": 424, "start": 4014.04, "end": 4017.48, "text": "unterschiedlichen zielen das am ende zusammen rechnen dann hat man noch so"}, {"id": 425, "start": 4017.48, "end": 4040.82, "text": "die realität den realistischsten eindruck ja ich möchte mich mal als"}, {"id": 426, "start": 4040.82, "end": 4045.24, "text": "knub auch was bedeutet eigentlich native in der regel ist damit gemeint dass man"}, {"id": 427, "start": 4045.24, "end": 4050.24, "text": "also in dem fall wo wir über über ui elemente geredet haben ist gemeint dass"}, {"id": 428, "start": 4050.24, "end": 4056.56, "text": "man die sachen verwendet die jeweilige plattform eben mit liefert also zum"}, {"id": 429, "start": 4056.56, "end": 4064.32, "text": "beispiel ein native steuerelement unter windows ist zum beispiel der datei öffnen"}, {"id": 430, "start": 4064.32, "end": 4072.72, "text": "dialog das ist ein das ist der windows native datei öffnen dialog und der"}, {"id": 431, "start": 4072.72, "end": 4076.36, "text": "linux sieht anders aus und der mac sieht anders aus und der android sieht"}, {"id": 432, "start": 4076.36, "end": 4082.28, "text": "anders aus und der ios sieht anders aus aber jede plattform hat eine art datei"}, {"id": 433, "start": 4082.28, "end": 4090.16, "text": "öffnen dialog und das hier ist der native windows datei öffnen dialog das"}, {"id": 434, "start": 4090.16, "end": 4094.36, "text": "ist der den windows mitbringt es hält keinen davon ab eine anwendung zu"}, {"id": 435, "start": 4094.36, "end": 4101.4, "text": "bauen die einen datei öffnen dialog selbst mitbringt ja aber das ist der"}, {"id": 436, "start": 4101.4, "end": 4105.44, "text": "native windows datei öffnen dialog und wenn man den verwendet dann verwenden"}, {"id": 437, "start": 4105.44, "end": 4114.36, "text": "wir den den windows mitbringen oder das hier ist eine native windows menüleiste"}, {"id": 438, "start": 4114.36, "end": 4122.0, "text": "und und und und und das hier ist höchstwahrscheinlich kein native"}, {"id": 439, "start": 4122.0, "end": 4129.32, "text": "windows button sondern irgendwas selbstgemaltes von firefox ob das hier"}, {"id": 440, "start": 4129.32, "end": 4133.48, "text": "überhaupt das hier überhaupt mit native windows fenster ist wäre ich mir schon"}, {"id": 441, "start": 4133.48, "end": 4136.4, "text": "gar nicht mal so sicher"}, {"id": 442, "start": 4144.6, "end": 4149.16, "text": "hast du bei klein anzeigen eine dsg vo anfrage gemacht schon antworten ach nee"}, {"id": 443, "start": 4149.16, "end": 4153.04, "text": "habe ich gar nicht mehr dran gedacht tatsächlich ja das wollte ich machen"}, {"id": 444, "start": 4153.04, "end": 4156.84, "text": "das müsste ich wirklich mal machen allein schon um die abzufacken"}, {"id": 445, "start": 4156.84, "end": 4162.2, "text": "und was bedeutet cloud native password bingo"}, {"id": 446, "start": 4162.2, "end": 4166.48, "text": "wo jeder was anderes darunter versteht"}, {"id": 447, "start": 4168.16, "end": 4175.2, "text": "mit dem kvm müsste es doch auch über den rest of the pie gehen oder was"}, {"id": 448, "start": 4175.2, "end": 4179.64, "text": "was das kann man das aufmachen"}, {"id": 449, "start": 4179.64, "end": 4191.48, "text": "atem fang ja ja momenten in den verbindet ihren kvm switch mit den"}, {"id": 450, "start": 4191.48, "end": 4197.64, "text": "grafiken du brauchst noch ein kvm switch von denen das ding hat kein web"}, {"id": 451, "start": 4197.64, "end": 4200.08, "text": "interface wo du drauf gehen kannst du brauchst wahrscheinlich auch in 800"}, {"id": 452, "start": 4200.08, "end": 4216.08, "text": "euro kvm switch von denen wo du es damit verbindest das wird nicht funktionieren"}, {"id": 453, "start": 4216.08, "end": 4220.04, "text": "so ich habe den chat geschafft nice so jetzt können wir uns mal videos"}, {"id": 454, "start": 4220.04, "end": 4225.88, "text": "angucken da steht vga und hat aber usb mit dran"}, {"id": 455, "start": 4225.88, "end": 4231.88, "text": "why naja für tastatur und maus zu simulieren"}, {"id": 456, "start": 4231.88, "end": 4235.44, "text": "du willst ja nicht in den bild über tragen du willst ja auch inputs machen"}, {"id": 457, "start": 4235.44, "end": 4238.36, "text": "können ich meine ist schön wenn du ins bios"}, {"id": 458, "start": 4238.36, "end": 4243.12, "text": "reinkommst aber im bios was einstellen können wir noch besser"}, {"id": 459, "start": 4248.32, "end": 4253.6, "text": "aber dann ist es nicht nur fauke ja ja das ist halt anzeige an an so wir gucken"}, {"id": 460, "start": 4253.6, "end": 4256.92, "text": "was haben wir denn 7 things no programmer ever wants to hear das ist"}, {"id": 461, "start": 4256.92, "end": 4261.08, "text": "gutes gucken wir uns jetzt an habe ich doch bestimmt schon auf hier"}, {"id": 462, "start": 4261.08, "end": 4268.84, "text": "feier schipp beste beste witz software engineer socks i was told i would be"}, {"id": 463, "start": 4268.84, "end": 4273.52, "text": "working in a fast-paced exakt aber es macht trotzdem bock das ist auch so ein"}, {"id": 464, "start": 4273.52, "end": 4277.56, "text": "ding ja es sagt aber es macht trotzdem bock"}, {"id": 465, "start": 4277.56, "end": 4283.44, "text": "gibt es gibt es noch mehr in a software engineer socks i was told i would be"}, {"id": 466, "start": 4283.44, "end": 4285.56, "text": "working in a fast-paced exciting environment"}, {"id": 467, "start": 4285.56, "end": 4288.88, "text": "also in reality i'm stuck in this cubicle building super komplex stuff"}, {"id": 468, "start": 4288.88, "end": 4293.96, "text": "denn ob wir es den chat meine frage ist das bei euch habt ihr großraumbüros und"}, {"id": 469, "start": 4293.96, "end": 4298.92, "text": "wenn ihr großraumbüros habt habt ihr da wirklich komplett offen oder habt ihr"}, {"id": 470, "start": 4298.92, "end": 4309.48, "text": "dann auch angefangen trennwände reinzustellen vnc"}, {"id": 471, "start": 4309.48, "end": 4315.72, "text": "aber vnc geht ja nicht mit vnc ins bios kommen mit mit festen trennwänden ok"}, {"id": 472, "start": 4315.72, "end": 4323.72, "text": "also bei uns ist es so wir haben früher mittelgroße büros gehabt da saßen ein"}, {"id": 473, "start": 4323.72, "end": 4327.36, "text": "paar leute drin aber die war nicht wirklich so voll da saßen dann fünf"}, {"id": 474, "start": 4327.36, "end": 4332.56, "text": "leute oder so drinnen in dem büro jetzt haben wir relativ große büros ja also"}, {"id": 475, "start": 4332.56, "end": 4340.52, "text": "großraumbüros nur dass ich schon nach den ersten ein zwei wochen die leute so"}, {"id": 476, "start": 4340.52, "end": 4344.52, "text": "abgefuckt haben gegenseitig weil die leute telefoniert haben und der eine"}, {"id": 477, "start": 4344.52, "end": 4348.72, "text": "steht rum und labert und so dass wir jetzt trennwände haben also wir haben"}, {"id": 478, "start": 4348.72, "end": 4352.52, "text": "jetzt trennwände zwischen den einzelnen sitzreihen"}, {"id": 479, "start": 4352.52, "end": 4356.32, "text": "es sind keine cubicles bei uns aber es sind trennwände zwischen den sitzreihen"}, {"id": 480, "start": 4356.32, "end": 4361.68, "text": "also man ist ins großraumbüro gegangen nur um festzustellen großraumbüro sagt"}, {"id": 481, "start": 4361.68, "end": 4370.32, "text": "um dann wieder fake trennwände einzuziehen richtig nice geil und"}, {"id": 482, "start": 4370.32, "end": 4374.88, "text": "trotzdem ist es teilweise noch richtig nervig"}, {"id": 483, "start": 4376.56, "end": 4382.84, "text": "zumal großraumbüros ja mittlerweile bei vielen schon wieder nicht mehr im trenn"}, {"id": 484, "start": 4382.84, "end": 4388.12, "text": "sind da fangen wir jetzt mit an ok also feier schipp erzähl uns was"}, {"id": 485, "start": 4388.12, "end": 4391.8, "text": "appreciates if i had a time machine i would do two things one i would tell"}, {"id": 486, "start": 4391.8, "end": 4397.48, "text": "rambe to get away from that kid ja alter dicks out"}, {"id": 487, "start": 4397.48, "end": 4403.48, "text": "vor herr ramby das ist auch schon wieder fünf jahr her oder so"}, {"id": 488, "start": 4403.48, "end": 4408.0, "text": "the time machine i would do two things one i would tell rambe to get away from"}, {"id": 489, "start": 4408.0, "end": 4413.52, "text": "that kid and two i would go back to school to become a civil engineer so i"}, {"id": 490, "start": 4413.52, "end": 4416.48, "text": "could work outside building stuff everyone admires like bridges and"}, {"id": 491, "start": 4416.48, "end": 4419.96, "text": "skyscrapers unfortunately i haven't figured out how to build a time machine"}, {"id": 492, "start": 4419.96, "end": 4422.96, "text": "and javascript yet now i would never recommend anybody choose software"}, {"id": 493, "start": 4422.96, "end": 4426.44, "text": "engineering as a career but if you do make bad life choices like me you should"}, {"id": 494, "start": 4426.44, "end": 4430.08, "text": "be prepared for some really bad things to happen like every doctor eventually"}, {"id": 495, "start": 4430.08, "end": 4433.48, "text": "loses a patient and every pilot eventually crashes a plane likewise"}, {"id": 496, "start": 4433.48, "end": 4437.24, "text": "every software engineer will eventually face a merge conflict and that's not"}, {"id": 497, "start": 4437.24, "end": 4444.52, "text": "even there das stimmt aber das ist nicht wirklich schlimm also meistens nicht"}, {"id": 498, "start": 4444.52, "end": 4449.88, "text": "95 prozent der mörsch mörsch konflikte sind nicht weiter wild"}, {"id": 499, "start": 4449.88, "end": 4453.8, "text": "bad in today's video we'll look at seven different devastated text messages"}, {"id": 500, "start": 4453.8, "end": 4457.72, "text": "that no developer ever wants to hear speaking of which i finally started a"}, {"id": 501, "start": 4457.72, "end": 4461.12, "text": "discord so feel free to chat with me over there after this video we've got"}, {"id": 502, "start": 4461.12, "end": 4464.88, "text": "some t-shirts and licenses to jetbrain software to get away over there one of"}, {"id": 503, "start": 4464.88, "end": 4468.12, "text": "the biggest problems with software engineering is that mittlerweile gibt es"}, {"id": 504, "start": 4468.12, "end": 4471.96, "text": "auf feier schippsel art that you don't want your friends and family to find out"}, {"id": 505, "start": 4471.96, "end": 4475.52, "text": "what you do the reason is you'll get messages like this from your uncle or"}, {"id": 506, "start": 4475.52, "end": 4479.12, "text": "old roommate asking if you want to build an app together it will consist of a"}, {"id": 507, "start": 4479.12, "end": 4483.76, "text": "very dumb idea that's impossibly complex to execute like uber but for horses or"}, {"id": 508, "start": 4483.76, "end": 4487.56, "text": "tiktok without the chinese with a five hundred dollar budget messages like this"}, {"id": 509, "start": 4487.56, "end": 4490.64, "text": "are so painful because software engineers are usually introverts who"}, {"id": 510, "start": 4490.64, "end": 4494.2, "text": "have a hard time saying no what you want to do is respond and say hey that's an"}, {"id": 511, "start": 4494.2, "end": 4497.56, "text": "awesome idea i would love to build it for you but my rate is three hundred"}, {"id": 512, "start": 4497.56, "end": 4501.12, "text": "dollars an hour what they'll likely get back with a counter offer of zero"}, {"id": 513, "start": 4501.12, "end": 4505.6, "text": "dollars per hour but ten percent equity also ganz ehrlich anfragen ich hab"}, {"id": 514, "start": 4505.6, "end": 4509.92, "text": "irgendwie geile app idee kannst du was für programmieren krieg ich von meinen"}, {"id": 515, "start": 4509.92, "end": 4513.64, "text": "bekannten und die kennt mich ich habe nicht viele bekannte aber selbst da"}, {"id": 516, "start": 4513.64, "end": 4519.24, "text": "krieg ich selten das einzige was ich habe ist leute die ich von der arbeit"}, {"id": 517, "start": 4519.24, "end": 4521.84, "text": "kenne oder die ich auf der arbeit irgendwann mal vielleicht kennengelernt"}, {"id": 518, "start": 4521.84, "end": 4525.92, "text": "habt ihr jetzt nicht mehr bei uns arbeiten aus dem umfeld ja da tauscht"}, {"id": 519, "start": 4525.92, "end": 4529.64, "text": "man sich manchmal über irgendwelche coolen neuen ideen aus und manchmal haben"}, {"id": 520, "start": 4529.64, "end": 4533.12, "text": "wir auch schon so paar kleine sachen gebastelt aber es ist jetzt nicht so dass"}, {"id": 521, "start": 4533.12, "end": 4540.8, "text": "irgendwie mich einer anruft und sagt übrigens max ich komme jetzt gleich"}, {"id": 522, "start": 4540.8, "end": 4544.88, "text": "vorbei dann fixen wir die die pumpe im garten und danach programmierst du mir"}, {"id": 523, "start": 4544.88, "end": 4549.92, "text": "mal bitte irgendwie die neueste neueste neueste app das kommt eigentlich nicht"}, {"id": 524, "start": 4549.92, "end": 4555.52, "text": "vor also was bei mir öfters der fall ist ist so nach dem motto hast du eine idee"}, {"id": 525, "start": 4555.52, "end": 4562.2, "text": "wenn ich auf meinem tablet irgendwie den den store aufmache dann sieht es ganz"}, {"id": 526, "start": 4562.2, "end": 4567.88, "text": "anders aus und solche dinger und meine standard antwort mittlerweile ist immer"}, {"id": 527, "start": 4567.88, "end": 4572.32, "text": "habe ich keine ahnung von gerade auch wenn einer mit windows ankommt also"}, {"id": 528, "start": 4572.32, "end": 4576.72, "text": "windows sachen supporte ich prinzipiell nicht da habe ich ja schon bei meinen"}, {"id": 529, "start": 4576.72, "end": 4580.56, "text": "eigenen sachen keine ahnung davon und irgendwelche tablet sachen ist es"}, {"id": 530, "start": 4580.56, "end": 4585.04, "text": "mittlerweile zunehmend tablet dinger was die leute nicht checken weil die leute"}, {"id": 531, "start": 4585.04, "end": 4588.96, "text": "halt kein windows desktop rechner haben sondern tablet und das sage ich auch"}, {"id": 532, "start": 4588.96, "end": 4596.76, "text": "habe ich keine ahnung von ganz im ernst ich was weiß ich warum bei der der store"}, {"id": 533, "start": 4596.76, "end": 4600.84, "text": "jetzt anders aussieht vielleicht wurde ihr account gesperrt oder so kein schimmer"}, {"id": 534, "start": 4600.84, "end": 4604.64, "text": "ich sag mittlerweile habe ich keine ahnung von das ist übrigens auch die"}, {"id": 535, "start": 4604.64, "end": 4608.04, "text": "beste antwort die man geben kann weil dann ist ruhe was sollen die da"}, {"id": 536, "start": 4608.04, "end": 4611.24, "text": "großartig erzählen wenn du sagst alter gehen wir weg mit dem scheiß habe ich"}, {"id": 537, "start": 4611.24, "end": 4614.6, "text": "keinen bock drauf erzählen sie dir weiter wie schlimm das ist und das jetzt"}, {"id": 538, "start": 4614.6, "end": 4618.84, "text": "gucken muss wenn du sagst ane habe ich keine ahnung von kenne ich nicht was"}, {"id": 539, "start": 4618.84, "end": 4623.8, "text": "sollen sie sagen soll sie sagen doch du hast bestimmt ahnung davon"}, {"id": 540, "start": 4625.8, "end": 4630.28, "text": "erdrucker und scanner kriege ich ja nicht mal mehr daheim gescheiten"}, {"id": 541, "start": 4630.28, "end": 4634.8, "text": "company which will eventually be worth billions that's pretty much checkmate"}, {"id": 542, "start": 4634.8, "end": 4638.36, "text": "ich würde just recommend accepting the offer and building the app to get them"}, {"id": 543, "start": 4638.36, "end": 4641.6, "text": "to go away now when you're not building apps for friends and family you should be"}, {"id": 544, "start": 4641.6, "end": 4645.04, "text": "working on your own side projects and in doing that you'll likely use the cloud"}, {"id": 545, "start": 4645.04, "end": 4649.2, "text": "like aws one of the worst messages you can receive is a cloud billing alert"}, {"id": 546, "start": 4649.2, "end": 4654.76, "text": "like hey it's aws your 25 dollar budget has been exceeded by 2.3 million"}, {"id": 547, "start": 4654.76, "end": 4658.72, "text": "dollars maybe you click the wrong button or accidently ja das kann ja das kann"}, {"id": 548, "start": 4658.72, "end": 4662.2, "text": "ja in der cloud tatsächlich passieren gerade wenn du functions verwendest die"}, {"id": 549, "start": 4662.2, "end": 4667.8, "text": "sich vielleicht untereinander aufrufen da gibt es einige reports dass leute"}, {"id": 550, "start": 4667.8, "end": 4672.44, "text": "über nacht aus versehen 50.000 euro und mehr oder 500.000 euro rechnung"}, {"id": 551, "start": 4672.44, "end": 4677.16, "text": "produziert haben man muss aber sagen dass die cloud anbieter da meistens"}, {"id": 552, "start": 4677.16, "end": 4682.84, "text": "relativ coolant sind das wurde schon öfters als nicht tatsächlich erlassen"}, {"id": 553, "start": 4682.84, "end": 4687.28, "text": "wenn du das glaubhaft erzählen kannst dass du nicht wirklich vorhattest 500"}, {"id": 554, "start": 4687.28, "end": 4694.04, "text": "euro 500.000 euro rechnung zu fabrizieren aber trotzdem da muss man"}, {"id": 555, "start": 4694.04, "end": 4700.4, "text": "wirklich aufpassen also ich glaube es ist nirgends wie so einfach wie in der"}, {"id": 556, "start": 4700.4, "end": 4718.24, "text": "cloud einfach mal eine halbe million auszugeben die man nicht hat"}, {"id": 557, "start": 4731.4, "end": 4745.0, "text": "tja dann könnte man fragen ihr habt ihr denn kein backup gemacht"}, {"id": 558, "start": 4745.0, "end": 4754.04, "text": "backups ist klar"}, {"id": 559, "start": 4754.04, "end": 4757.92, "text": "deswegen macht es ja auch keiner von hand der noch irgendwie bei verstand ist"}, {"id": 560, "start": 4757.92, "end": 4764.76, "text": "macht wirklich jemand irgend noch was von hand an der da an der in der live"}, {"id": 561, "start": 4764.76, "end": 4770.0, "text": "datenbank mit wir machen irgendwie den in dem in der shell auf und setzen da"}, {"id": 562, "start": 4770.0, "end": 4774.56, "text": "von hand sql befehle drin ab das macht doch keiner mehr"}, {"id": 563, "start": 4774.56, "end": 4779.92, "text": "gut vielleicht irgendwelche mayer sql p.a.p. dinger"}, {"id": 564, "start": 4779.92, "end": 4787.52, "text": "ja vielleicht den dampf für den backup oder so ok"}, {"id": 565, "start": 4792.0, "end": 4795.48, "text": "ja das ist egal"}, {"id": 566, "start": 4795.48, "end": 4811.04, "text": "ok das sind ganz viele schlimme dinge auf einmal das erste ist angular js und"}, {"id": 567, "start": 4811.04, "end": 4815.84, "text": "das andere ist angular js v1 wobei ja viele sagen angular js v1 war das beste"}, {"id": 568, "start": 4815.84, "end": 4820.12, "text": "angular js ich kann da nicht viel dazu sagen weil ich nie angular js verwendet"}, {"id": 569, "start": 4820.12, "end": 4824.4, "text": "habe aber was sagt ihr ist das so oder ist das nicht so war angular v1 das"}, {"id": 570, "start": 4824.4, "end": 4829.64, "text": "beste angular also was ich jetzt gehört habe an argumenten ist dass angular v1"}, {"id": 571, "start": 4829.64, "end": 4834.12, "text": "genau das richtige für die damalige zeit war und irgendwie noch ja"}, {"id": 572, "start": 4834.12, "end": 4838.72, "text": "übersichtlich zu benutzen war und danach ist angular quasi komplett neu"}, {"id": 573, "start": 4838.72, "end": 4843.4, "text": "geschrieben worden und total ausgeufert zu irgendeinem riesen business enterprise"}, {"id": 574, "start": 4843.4, "end": 4846.4, "text": "framework"}, {"id": 575, "start": 4847.92, "end": 4854.04, "text": "genau da war es noch angular js heute ist es ja nur nur nur angular noch ja ja"}, {"id": 576, "start": 4854.04, "end": 4857.12, "text": "angular js gibt es ja dann gar nicht mehr die haben das die haben das ja"}, {"id": 577, "start": 4857.12, "end": 4861.04, "text": "irgendwie um um gewusst es wurde dann irgendwie eingestellt dann ist es"}, {"id": 578, "start": 4861.04, "end": 4863.72, "text": "angular geworden"}, {"id": 579, "start": 4869.8, "end": 4874.64, "text": "1.3 1.3 ist ja quasi 1 2 angular 14"}, {"id": 580, "start": 4874.64, "end": 4878.2, "text": "sable the previous developer died of old age and was the only one who had any"}, {"id": 581, "start": 4878.2, "end": 4883.2, "text": "idea how ich glaube ein entwickler bei uns gestorben weil er alt war und wir"}, {"id": 582, "start": 4883.2, "end": 4886.64, "text": "brauchen was von ihm gab es noch nicht aber ich habe es euch letztens erzählt"}, {"id": 583, "start": 4886.64, "end": 4890.0, "text": "die haben entwickler in der renter angerufen der cobalt zeug programmiert"}, {"id": 584, "start": 4890.0, "end": 4893.68, "text": "hat vor fragt mich nicht sieben jahren oder so code base worked he knew exactly"}, {"id": 585, "start": 4893.68, "end": 4897.8, "text": "how to keep his job by creating an overly complex code base without any comments"}, {"id": 586, "start": 4897.8, "end": 4901.96, "text": "or documentation and now it's your turn to update it fuck my life this job will"}, {"id": 587, "start": 4901.96, "end": 4905.28, "text": "take more skill and ingenuity than building a nuclear submarine and when"}, {"id": 588, "start": 4905.28, "end": 4908.36, "text": "you finally finish the job in a few years no one will even notice or care"}, {"id": 589, "start": 4908.36, "end": 4911.6, "text": "because by that time it'll be time to migrate your legacy code base into the"}, {"id": 590, "start": 4911.6, "end": 4915.28, "text": "hot new javascript framework of 2025 speaking of which something a web"}, {"id": 591, "start": 4915.28, "end": 4919.36, "text": "developer never wants naja dass das aktuell was ist denn das aktuelle trendy"}, {"id": 592, "start": 4919.36, "end": 4924.52, "text": "javascript framework ich würde sagen quick oder zumindest was ziemlich viel"}, {"id": 593, "start": 4924.52, "end": 4929.08, "text": "hype aktuell hat chat was ist das aktuell trendigste javascript framework"}, {"id": 594, "start": 4929.08, "end": 4936.92, "text": "also ich würde sagen astro oder quick wobei astro ist ja eher ein meta framework"}, {"id": 595, "start": 4936.92, "end": 4943.24, "text": "das welt schon out du kannst den javascript von ausgehen wenn es älter"}, {"id": 596, "start": 4943.24, "end": 4948.76, "text": "ist als ein zwei monate ist es out blames war es ja das ist dieses das ist"}, {"id": 597, "start": 4948.76, "end": 4954.76, "text": "das fire ship framework view ne few ist nicht mehr angesagt ich würde heute"}, {"id": 598, "start": 4954.76, "end": 4959.44, "text": "immer noch apps in view machen und ins welt machen also keine frage aber ich"}, {"id": 599, "start": 4959.44, "end": 4964.84, "text": "rede ja von der von der aktuellen saudi die durch dorf getrieben wird"}, {"id": 600, "start": 4964.84, "end": 4969.72, "text": "und denn ist irrelevant so so na gut dass wir keinen frontend für youtube"}, {"id": 601, "start": 4969.72, "end": 4972.92, "text": "brauchen um es zu gucken"}, {"id": 602, "start": 4974.36, "end": 4981.76, "text": "astro ja ist kein frontend bann ist in javascript in typeskript javascript"}, {"id": 603, "start": 4982.52, "end": 4989.0, "text": "runtime für den server bann ist nicht also ich würde sagen quick oder astro ist"}, {"id": 604, "start": 4989.0, "end": 4992.96, "text": "das aktuelle frontend saudi durch dorf getrieben wird"}, {"id": 605, "start": 4992.96, "end": 4996.48, "text": "here is that a new better javascript framework has been invented when you"}, {"id": 606, "start": 4996.48, "end": 4999.8, "text": "learn a javascript framework you join a tribe and that means everything outside"}, {"id": 607, "start": 4999.8, "end": 5003.36, "text": "that tribe is dangerous and terrible now normally you can create an echo"}, {"id": 608, "start": 5003.36, "end": 5009.48, "text": "chamber to convince yourself that you're okay wir gucken mal wir gucken mal"}, {"id": 609, "start": 5012.2, "end": 5016.84, "text": "aus javascript entwickler fragen warum die das oft machen quick leute quick ist"}, {"id": 610, "start": 5016.84, "end": 5026.76, "text": "es sagt doch quick trendet quick"}, {"id": 611, "start": 5028.56, "end": 5039.0, "text": "unser real db leute neustes neustas deck quick mit so real db das ist dann der"}, {"id": 612, "start": 5039.0, "end": 5051.76, "text": "quesure quesure stack oder alternativ der zur zur zur wick zur wick der zur wick"}, {"id": 613, "start": 5051.76, "end": 5058.88, "text": "stack dass das hört sich gar nicht so schlecht an so wick so wick das hört"}, {"id": 614, "start": 5058.88, "end": 5063.32, "text": "sich an wie irgendwie soll wie so eine salbe die du mit der ich ein kremen"}, {"id": 615, "start": 5063.32, "end": 5071.96, "text": "wenn du husten hast und was ich habe zur wick eingeklemmt fünf jahre job"}, {"id": 616, "start": 5071.96, "end": 5080.72, "text": "erfahrung das ist das ist da könnte man richtig zur wick stack"}, {"id": 617, "start": 5082.12, "end": 5087.0, "text": "framework is absolutely 100 percent the best in every use case however at some"}, {"id": 618, "start": 5087.0, "end": 5090.24, "text": "point you may be convinced that a better framework does in fact exist"}, {"id": 619, "start": 5090.24, "end": 5100.88, "text": "das hat sich wirklich fast an wie dieser typ aus norwegen ja"}, {"id": 620, "start": 5100.88, "end": 5104.52, "text": "peter agilis gibt es nicht mehr ich habe das password vergessen für den oder"}, {"id": 621, "start": 5104.52, "end": 5111.56, "text": "verloren für den link in account leute jetzt habe ich in link in account den die"}, {"id": 622, "start": 5111.56, "end": 5117.6, "text": "nicht gesperrt haben ja und ich habe das password nicht mehr für"}, {"id": 623, "start": 5117.6, "end": 5123.48, "text": "zurücksetzen ich habe das mit einer fake handynummer gen registriert keine"}, {"id": 624, "start": 5123.48, "end": 5127.04, "text": "chance und der google account den ich als mail verwendet hat wurde wahrscheinlich"}, {"id": 625, "start": 5127.04, "end": 5130.04, "text": "auch gesperrt mittlerweile"}, {"id": 626, "start": 5130.04, "end": 5143.2, "text": "a gelater zweite roller yeahaching"}, {"id": 627, "start": 5143.16, "end": 5146.16, "text": "coach"}, {"id": 628, "start": 5147.8, "end": 5151.84, "text": "ich kann hier dort aber eine derordre um auf brukung ab und zu wenn wir"}, {"id": 629, "start": 5151.84, "end": 5156.22, "text": "nicht especiallyyou it ist kann doch meist Smoke an Tweet"}, {"id": 630, "start": 5156.22, "end": 5163.82, "text": "Und was man nicht vergessen darf, wisst ihr was ich am allerliebsten habe, wenn die dann"}, {"id": 631, "start": 5163.82, "end": 5169.38, "text": "sagen, das kann doch nicht so schwer sein, das ist doch nur so was ganz kleines, das"}, {"id": 632, "start": 5169.38, "end": 5173.22, "text": "kann doch jetzt nicht so ein großer Akt sein, das kann doch nicht so schwer sein, die haben"}, {"id": 633, "start": 5173.22, "end": 5177.1, "text": "keine Ahnung was da teilweise hinten dran hängt, aber das kann doch nicht so schwer"}, {"id": 634, "start": 5177.1, "end": 5178.1, "text": "sein."}, {"id": 635, "start": 5178.1, "end": 5191.62, "text": "Ja das, genau das, genau das, kann doch nicht so schwierig sein, kann doch nicht so schwierig"}, {"id": 636, "start": 5191.62, "end": 5192.62, "text": "sein."}, {"id": 637, "start": 5192.62, "end": 5193.62, "text": "Google."}, {"id": 638, "start": 5193.62, "end": 5208.98, "text": "Google, korrekt."}, {"id": 639, "start": 5208.98, "end": 5235.54, "text": "Ja, ich predicte mal, ich predicte mal was jetzt kommt, der Typ hat gesagt, ah ok ich"}, {"id": 640, "start": 5235.54, "end": 5242.74, "text": "hab das Problem gelöst, aber er schreibt nicht die Lösung drunter, ja ich wusste, genau"}, {"id": 641, "start": 5242.74, "end": 5247.66, "text": "das, das geht mir auch mega auf den Keks, das geht mir auch richtig auf den Sack, so"}, {"id": 642, "start": 5247.66, "end": 5250.66, "text": "nach dem Motto, never mind, it works now."}, {"id": 643, "start": 5250.66, "end": 5254.34, "text": "Und dann ist er, ja was hast du denn gemacht."}, {"id": 644, "start": 5254.34, "end": 5260.1, "text": "Ja, genau das, das kennt jeder."}, {"id": 645, "start": 5260.1, "end": 5268.26, "text": "Oder aber, wenn du in einem deutschen Forum landest, ist jetzt erstmal 20 Seiten, die"}, {"id": 646, "start": 5268.26, "end": 5291.14, "text": "du postest, keine Ahnung, der hat die Code-Formatierung nicht richtig gemacht, ohne Lösung, ja, da"}, {"id": 647, "start": 5291.14, "end": 5299.98, "text": "ist tatsächlich was dran, äh, da können wir uns doch sonst noch angucken, wir haben"}, {"id": 648, "start": 5299.98, "end": 5304.58, "text": "nicht so viel Zeit, wir haben bloß eine Viertelstunde Zeit, komm Viertelstunde Zeit, da könnten"}, {"id": 649, "start": 5304.58, "end": 5317.14, "text": "wir uns das Alpha 4 Games Halo Video angucken, oder das hier, was wollen wir uns angucken,"}, {"id": 650, "start": 5317.14, "end": 5326.54, "text": "diese Titanfall auf der Xbox 360 zum Laufen gebracht haben, oder Halo Battle Royale Verriss"}, {"id": 651, "start": 5326.54, "end": 5334.9, "text": "wahrscheinlich von Alpha 4 Games, ok, schau mal, ich hab schon lange kein alter 4 Game"}, {"id": 652, "start": 5334.9, "end": 5342.1, "text": "Video geguckt, ich bestimmt schon, ja gut, macht der auch nicht so oft Videos, zeig mal"}, {"id": 653, "start": 5342.1, "end": 5348.78, "text": "her, was war denn das davor, ja, kein Wunder, es gibt ja auch kaum welche und es interessieren"}, {"id": 654, "start": 5348.78, "end": 5367.94, "text": "mich auch nicht alle, also insofern kann es schon sein, ok, ja, ok, also ich muss sagen,"}, {"id": 655, "start": 5367.94, "end": 5373.7, "text": "ich hab's mittlerweile aufgegeben, was Halo Infinite angeht, den Singleplayer hab ich noch"}, {"id": 656, "start": 5373.7, "end": 5376.9, "text": "nicht reingeguckt, ich bin mir gar nicht sicher, ob ich den überhaupt gekauft habe, war der"}, {"id": 657, "start": 5376.9, "end": 5383.78, "text": "Multiplayer nicht free to play, vielleicht hab ich den nämlich gar nicht gekauft, ich"}, {"id": 658, "start": 5383.78, "end": 5389.02, "text": "fand Halo Infinite am Anfang wirklich nice, gerade weil ich schon relativ lang kein Halo"}, {"id": 659, "start": 5389.02, "end": 5394.58, "text": "mehr gespielt hab, aber was mich wirklich genervt hat, ist erstens, dass die super langsam"}, {"id": 660, "start": 5394.58, "end": 5401.02, "text": "waren, was Patches und Content angeht, also richtig richtig langsam, so nach dem Motto,"}, {"id": 661, "start": 5401.02, "end": 5406.34, "text": "ja eigentlich sollten schon irgendwie diese 3000 Sachen zu Release kommen, aber ach nee,"}, {"id": 662, "start": 5406.34, "end": 5410.3, "text": "eine Map reicht doch für ein halbes Jahr, also das ist wirklich, das ist ja noch fast"}, {"id": 663, "start": 5410.3, "end": 5416.34, "text": "noch weniger Content als Battlefield 2042, das musste er erst mal schaffen, fast, fast,"}, {"id": 664, "start": 5416.34, "end": 5424.66, "text": "fast, und eine Sache, die mich persönlich wirklich richtig genervt hat, ist nicht, dass"}, {"id": 665, "start": 5424.66, "end": 5430.62, "text": "es Crossplay gibt, das sag ich gar nichts dagegen, Crossplay wird bleiben und Crossplay ist irgendwo"}, {"id": 666, "start": 5430.62, "end": 5439.34, "text": "auch die Zukunft, weil durch Crossplay kannst du einfach sicherstellen, dass alle weiter"}, {"id": 667, "start": 5439.34, "end": 5444.62, "text": "spielen können, auch wenn irgendeine Plattform mal nicht mehr so angesagt ist, ja, aber es"}, {"id": 668, "start": 5444.62, "end": 5451.54, "text": "war halt in Halo extrem, normalerweise ist AimAssist da und AimAssist ist auch wichtig,"}, {"id": 669, "start": 5451.54, "end": 5457.18, "text": "weil sonst kannst du ja halt im Leben nicht mit Controller vs. PC spielen, das funktioniert"}, {"id": 670, "start": 5457.18, "end": 5466.7, "text": "nicht, das ist alles in Ordnung, auch dass es AimAssist gibt, aber der AimAssist in Halo"}, {"id": 671, "start": 5466.7, "end": 5474.58, "text": "für Controller ist auf einem komplett anderen Level, also sprich, du kannst selbst, wenn"}, {"id": 672, "start": 5474.58, "end": 5485.38, "text": "du der absolute Giga AimChat bist, nicht dieses permanent am Kopf stickige Tracke machen,"}, {"id": 673, "start": 5485.38, "end": 5492.54, "text": "was du mit einem Controller machen kannst, das führt so weit, dass die ganzen Top-Ranked-Spieler"}, {"id": 674, "start": 5492.54, "end": 5499.62, "text": "in Halo Infinite alle mit dem Controller spielen, die spielen alle mit dem Controller und da"}, {"id": 675, "start": 5499.62, "end": 5503.9, "text": "hab ich mir gedacht, nee, da hab ich keinen Bock drauf."}, {"id": 676, "start": 5503.9, "end": 5509.26, "text": "Eine Modus schon lustig genug."}, {"id": 677, "start": 5509.26, "end": 5515.58, "text": "Ich bin kein Fan von Halo Infinite, weder war ich das beim Gameplay Reveal damals, als"}, {"id": 678, "start": 5515.58, "end": 5520.02, "text": "ich mein Pre-Release Video kurz nach der Beta machte, noch bin ich das jetzt."}, {"id": 679, "start": 5520.02, "end": 5523.86, "text": "Womit ich die längste Zeit aber eindeutig in der Minderheit war, denn der Launch von"}, {"id": 680, "start": 5523.86, "end": 5527.38, "text": "Halo Infinite schmelzte sich als ein massiver Erfolg heraus."}, {"id": 681, "start": 5527.38, "end": 5533.54, "text": "Ja, das ist am Anfang auch richtig gut gestanden, mir hat's auch wirklich Bock gemacht, der"}, {"id": 682, "start": 5533.54, "end": 5538.54, "text": "Multiplayer beim Start, muss ich sagen, bis dann halt die ganzen anderen Dinger nicht"}, {"id": 683, "start": 5538.54, "end": 5545.14, "text": "passiert sind, die ich dir eben erzählt hab, ansonsten ist das, also man merkt eben schon"}, {"id": 684, "start": 5545.14, "end": 5556.38, "text": "immer noch an, dass es schon noch die Stärken hat, zumindest, naja, ich war nie großer Halo-Spieler,"}, {"id": 685, "start": 5556.38, "end": 5559.74, "text": "aber ich kann schon verstehen, dass die Leute beispielsweise Halo 3 so gefeiert haben und"}, {"id": 686, "start": 5559.74, "end": 5561.38, "text": "danach keinen Teil mehr richtig gut fanden."}, {"id": 687, "start": 5561.38, "end": 5567.66, "text": "Kann ich schon verstehen, wobei ich sagen muss, im Kern fühlt sich das im Multiplayer immer"}, {"id": 688, "start": 5567.66, "end": 5573.86, "text": "noch an wie ein Halo Multiplayer, ja, diese, auf der einen Seite träge Geschichte, aber"}, {"id": 689, "start": 5573.86, "end": 5580.74, "text": "auf der anderen Seite halt einfach, dass die, wenn du die Abläufe gut geplant hast, ja,"}, {"id": 690, "start": 5580.74, "end": 5587.14, "text": "dann passt das einfach, was weiß ich, dreimal BR-Headshot da, dann machst du irgendwie einen"}, {"id": 691, "start": 5587.14, "end": 5593.26, "text": "Nahkampfangriff, dann hebst du irgendwie das Objective-Ding auf, haust den nächsten um,"}, {"id": 692, "start": 5593.26, "end": 5599.58, "text": "drops irgendwie das runter, also das fühlt sich in Halo schon cool an, also es gibt wirklich"}, {"id": 693, "start": 5599.58, "end": 5605.62, "text": "wenig aktuelle so Multiplayer-Spiele, wo ich sage, das fühlt sich vom Gegner-Killen so"}, {"id": 694, "start": 5605.62, "end": 5611.34, "text": "rewarding an und so impactvoll irgendwie, wie man das sagen kann, wie in Halo Infinite,"}, {"id": 695, "start": 5611.34, "end": 5613.1, "text": "leider haben sie halt drum herum viel verkackt."}, {"id": 696, "start": 5613.1, "end": 5621.06, "text": "Spielten es, alle liebten es, alle lobten es und dann nicht mehr."}, {"id": 697, "start": 5621.06, "end": 5624.94, "text": "Plötzlich war ich nicht mehr in der Minderheit, die Spielerzahlen fielen schon innerhalb"}, {"id": 698, "start": 5624.94, "end": 5630.26, "text": "weniger Wochen stark heran, und wir dürfen nicht vergessen, Halo Infinite wurde von Battlefield"}, {"id": 699, "start": 5630.26, "end": 5636.82, "text": "2042 angeführt, als einer der Gründe, warum ihr Spiel so gefällt ist, da ist eher die"}, {"id": 700, "start": 5636.82, "end": 5640.7, "text": "Frage, was der größere Fail ist, die YouTuber, die es am Anfang noch in den Himmel loben,"}, {"id": 701, "start": 5640.7, "end": 5648.74, "text": "zogen ihr Lob langsam zurück, es kam und kam kein neuer Content, keine Bug-Fixes, manche"}, {"id": 702, "start": 5648.74, "end": 5651.94, "text": "Features sind nun schon seit Release vollständig broken und später sind es halt noch Leute,"}, {"id": 703, "start": 5651.94, "end": 5656.02, "text": "aber man darf nicht vergessen, dass sie sau viel angekündigt haben, wie beispielsweise,"}, {"id": 704, "start": 5656.02, "end": 5668.66, "text": "dass du einen Map-Editor bekommst und sowas, was es bis heute glaub ich noch nicht gibt."}, {"id": 705, "start": 5668.66, "end": 5670.66, "text": "Es ist still geworden, das stimmt."}, {"id": 706, "start": 5670.66, "end": 5679.54, "text": "Man kann es davon abgesehen, hätte ich das Video jetzt nicht zufällig entdeckt, ich"}, {"id": 707, "start": 5679.54, "end": 5686.42, "text": "hätte gar nicht mitbekommen, dass Halo Infinite einen Battle-Royale-Modus hatte, hat, hatte?"}, {"id": 708, "start": 5686.42, "end": 5693.18, "text": "Hat wahrscheinlich, aber also, habt ihr das mitbekommen?"}, {"id": 709, "start": 5693.18, "end": 5698.02, "text": "Ich wusste es gar nicht, hatte, okay, also ist mir, ist mir neu."}, {"id": 710, "start": 5698.02, "end": 5702.22, "text": "Doch statt eines großen Updates, das die meisten Probleme behält und Spieler in neuen"}, {"id": 711, "start": 5702.22, "end": 5708.34, "text": "Inhalten ertrinken lässt, bekam man ganze zwei Maps plus einer Reihe an neuer Spielmodi,"}, {"id": 712, "start": 5708.34, "end": 5710.62, "text": "die dann auch keiner spielen wollte."}, {"id": 713, "start": 5710.62, "end": 5715.54, "text": "Doch war das natürlich nicht der einzige Versuch, mit dem man die Spieler zahlen und den guten"}, {"id": 714, "start": 5715.54, "end": 5721.5, "text": "Ruf von Infinite wiederherstellen wollte, nee nee, man hatte noch den Lars-Spartan-Standing-Modus"}, {"id": 715, "start": 5721.5, "end": 5722.5, "text": "in der Hinterhand."}, {"id": 716, "start": 5722.5, "end": 5727.26, "text": "Er hat die halbe Laufzeit des Trailers eingenommen, der Blogpost zum Update stellt ihn in den"}, {"id": 717, "start": 5727.26, "end": 5731.66, "text": "Mittelpunkt, das erste Event der Season bestand daraus, in Kombination mit der neuen Big-Team-Karte"}, {"id": 718, "start": 5731.66, "end": 5733.9, "text": "wieder und wieder spielen zu müssen."}, {"id": 719, "start": 5733.9, "end": 5738.14, "text": "Man könnte sagen, er stellte das Herzstück von Season 2 dar."}, {"id": 720, "start": 5738.14, "end": 5747.42, "text": "Das ist ja auch mal eine Sixhead-Taktik, so nach dem Motto, ja wir können das jetzt"}, {"id": 721, "start": 5747.42, "end": 5752.62, "text": "nicht so offensichtlich schreiben, aber du kannst mir ja so tun, also ich schreibe"}, {"id": 722, "start": 5752.62, "end": 5757.54, "text": "die Fragen und dann, dann beantworte ich die Fragen selbst in so ne Blogpost, das ist natürlich"}, {"id": 723, "start": 5757.54, "end": 5758.54, "text": "Sixhead-Teilwahl."}, {"id": 724, "start": 5758.54, "end": 5772.22, "text": "Nach 20 Jahren und so vielen Modi in der Halo-Reihe, Alter, warum, wie sie sich abfeiern."}, {"id": 725, "start": 5772.22, "end": 5778.82, "text": "Is it a challenge to come up with new experiences like this?"}, {"id": 726, "start": 5778.82, "end": 5786.26, "text": "Das ist so, wie wenn ich irgendwie ein Video machen würde und mich selbst fragen würde,"}, {"id": 727, "start": 5786.26, "end": 5788.78, "text": "Alex, warum sind deine Videos eigentlich so geil?"}, {"id": 728, "start": 5788.78, "end": 5791.02, "text": "Ha, das kann ich dir erklären, kein Problem."}, {"id": 729, "start": 5791.02, "end": 5795.22, "text": "Das ist ja mal ne Taktik, Alter."}, {"id": 730, "start": 5795.22, "end": 5801.42, "text": "Übrigens, ich hab wieder Werbeanfragen bekommen heute für irgendwelche komischen Mobile-Games."}, {"id": 731, "start": 5801.42, "end": 5807.42, "text": "Ich glaube, demnächst muss ich mal wieder nicht in einer Wüste, noch nie in einer Wüste"}, {"id": 732, "start": 5807.42, "end": 5810.7, "text": "gewesen sein, mal gucken was es dann ist."}, {"id": 733, "start": 5810.7, "end": 5817.02, "text": "Die Angebote aktuell, die sind wirklich, äh, da kann man fast nicht nein sagen, die schmeißen"}, {"id": 734, "start": 5817.02, "end": 5818.3, "text": "mit Geld förmlich um sich."}, {"id": 735, "start": 5818.3, "end": 5827.26, "text": "Also, das muss ich jetzt mal kurz erzählen, die Games sind ja meistens gar nicht so, äh,"}, {"id": 736, "start": 5827.26, "end": 5834.98, "text": "so meins, ja, aber sofern ich mich mit denen drauf einigen kann, dass ich einfach nur was"}, {"id": 737, "start": 5834.98, "end": 5839.18, "text": "vorlesen muss und es klar in Video ersichtlich ist, dass das nichts ist, was ich persönlich"}, {"id": 738, "start": 5839.18, "end": 5840.9, "text": "empfehle, hab ich damit auch kein Problem."}, {"id": 739, "start": 5840.9, "end": 5846.94, "text": "Und, ich hab mir bei Genshin richtig Mühe gegeben, oder, müsst ihr schon zugeben?"}, {"id": 740, "start": 5846.94, "end": 5860.74, "text": "Du hattest einem Arbeitskollegen das, was hast du dem zugeschickt?"}, {"id": 741, "start": 5860.74, "end": 5887.74, "text": "Das Kirchen-SAP-Video, äh, ah, du meinst, ähm, das Stellenangebote-Video oder was,"}, {"id": 742, "start": 5887.74, "end": 5894.98, "text": "mit dem Christ, mit dem Christlichen, ähm, was war das, Christ, Christliches Javascript"}, {"id": 743, "start": 5894.98, "end": 5895.98, "text": "oder sowas?"}, {"id": 744, "start": 5895.98, "end": 5901.58, "text": "Jaja, ja, ja, meine Güte, Alter, so, wir müssen das Video mal fertig gucken, das war"}, {"id": 745, "start": 5901.58, "end": 5902.58, "text": "nichts."}, {"id": 746, "start": 5902.58, "end": 5909.22, "text": "Was ist so gutes Genshin-Placement wie bei Apo, was, Apo rettet auch ein Genshin-Placement,"}, {"id": 747, "start": 5909.22, "end": 5911.38, "text": "er wundert mich, nicht jeder macht aktuell ein Genshin-Placement."}, {"id": 748, "start": 5911.38, "end": 5920.62, "text": "Äh, die Zone sieht schon übelst billig aus, auch, ja."}, {"id": 749, "start": 5920.62, "end": 5947.54, "text": "Und das ist irrsinnig witzig."}, {"id": 750, "start": 5947.54, "end": 5963.7, "text": "Naja, ich würde sagen, es ist ein ganz normaler Battle Royale, du spawnst irgendwo auf der"}, {"id": 751, "start": 5963.7, "end": 5967.62, "text": "Map, du lootest irgendwelche Dinge und wer am Ende überlebt hat, gewonnen."}, {"id": 752, "start": 5967.62, "end": 5970.9, "text": "Würde ich jetzt mal so raten, aber wahrscheinlich ist es nicht so einfach."}, {"id": 753, "start": 5970.9, "end": 5988.26, "text": "Moment, ok, also es ist, ok, es ist ein Battle Royale mit Respawn, ich glaub, das gibt's"}, {"id": 754, "start": 5988.26, "end": 5999.46, "text": "in der Art und Weise, glaub, auch nicht so oft, quasi so eine Art Battle Royale-Gun-Game."}, {"id": 755, "start": 5999.46, "end": 6007.02, "text": "Das sieht es also klar, du willst Kills machen, um am besseren Waffenrand zu kommen, um dadurch"}, {"id": 756, "start": 6007.02, "end": 6011.1, "text": "deutlich bessere Chancen im Kampf zu haben, gleichzeitig willst du aber auch nur so selten"}, {"id": 757, "start": 6011.1, "end": 6015.38, "text": "wie möglich sterben, um am Ende mit mehr als nur einem einzigen Leben dazustehen bzw."}, {"id": 758, "start": 6015.38, "end": 6019.54, "text": "dann überhaupt noch zu stehen und beide diese Interessen muss man nun irgendwie unter einen"}, {"id": 759, "start": 6019.54, "end": 6020.54, "text": "Hut bringen."}, {"id": 760, "start": 6020.54, "end": 6025.1, "text": "Es spawnen Equipments auf der Map, gelegentlich kommen diese Drop-Pots runter und nach ein"}, {"id": 761, "start": 6025.1, "end": 6028.98, "text": "paar Minuten kommt ein roter Kreis, der sich immer weiter schließt."}, {"id": 762, "start": 6028.98, "end": 6029.98, "text": "Ahja, Battle Royale halt."}, {"id": 763, "start": 6029.98, "end": 6035.06, "text": "Die Spieler werden weniger, das Schlachtfeld kleiner und der Druck immer größer bis irgendwann"}, {"id": 764, "start": 6035.06, "end": 6039.38, "text": "nur noch ein paar Spieler übrig sind, die dann aber immer noch nachspawnen können und"}, {"id": 765, "start": 6039.38, "end": 6042.42, "text": "nachdem ich mein letztes Leben durch einen Nahkampf-Trade verloren habe..."}, {"id": 766, "start": 6042.42, "end": 6050.34, "text": "Ist das da unten der Ort, der Map, dass da Aussichtspunkte, das ist der Call-Out quasi"}, {"id": 767, "start": 6050.34, "end": 6057.54, "text": "auf der Map, so groß sieht die Map jetzt gar nicht aus, als dass man da super krasse"}, {"id": 768, "start": 6057.54, "end": 6062.1, "text": "Call-Out-Bezeichnung braucht, na doch, wobei die Map sieht überall gleich kacke aus."}, {"id": 769, "start": 6062.1, "end": 6065.74, "text": "...die dann aber immer noch nachspawnen können und nachdem ich mein letztes Leben durch einen"}, {"id": 770, "start": 6065.74, "end": 6071.9, "text": "Nahkampf-Trade verloren habe, endet das spannende Finale der letzten beiden Überlebenden ebenfalls"}, {"id": 771, "start": 6071.9, "end": 6076.1, "text": "mit einem Nahkampf-Trade."}, {"id": 772, "start": 6076.1, "end": 6083.06, "text": "Das ist halt ein typischer Halo-Fight, was aber für Battle Royale ziemlich pepega ist,"}, {"id": 773, "start": 6083.06, "end": 6087.58, "text": "wenn du dich selbst killst zu einem großen Anteil der Fights."}, {"id": 774, "start": 6087.58, "end": 6093.58, "text": "In Halo ist das relativ normal, also der Standard-Fight ist ja fast schon aufeinander zurennen,"}, {"id": 775, "start": 6093.58, "end": 6099.3, "text": "Schilde weghauen und einen Nahkampf-Angriff machen und dann, tja, sterben."}, {"id": 776, "start": 6099.3, "end": 6104.26, "text": "Und wer hat jetzt gewonnen?"}, {"id": 777, "start": 6104.26, "end": 6120.34, "text": "Hast du das Video letztens nicht schon geguckt?"}, {"id": 778, "start": 6120.34, "end": 6121.7, "text": "Ich kann mich nicht dran erinnern."}, {"id": 779, "start": 6121.7, "end": 6124.14, "text": "Haben wir da schon geguckt?"}, {"id": 780, "start": 6124.14, "end": 6125.14, "text": "Nee."}, {"id": 781, "start": 6125.14, "end": 6126.14, "text": "Oder?"}, {"id": 782, "start": 6126.14, "end": 6138.66, "text": "Oder ist, Leute, ist mein Gehirn, ist mein Gehirn jetzt komplett Boomer-Modus?"}, {"id": 783, "start": 6138.66, "end": 6139.66, "text": "Bäh."}, {"id": 784, "start": 6139.66, "end": 6143.42, "text": "Gut, dass es Modi mit Permadeath hat."}, {"id": 785, "start": 6143.42, "end": 6149.94, "text": "Das ist es im Grunde auch schon, eine bekannte Formel, die man aber irgendwie auf die Karten,"}, {"id": 786, "start": 6149.94, "end": 6152.62, "text": "die man schon hatte, mit nur zwölf Spielern anpassen musste."}, {"id": 787, "start": 6152.62, "end": 6157.82, "text": "Ach, das ist auch gar keine neue Map."}, {"id": 788, "start": 6157.82, "end": 6160.62, "text": "Ach, doch, das ist eine neue Map, oder?"}, {"id": 789, "start": 6160.62, "end": 6165.54, "text": "Aber auf der auch alles andere gespielt wird, weil die Map sieht wirklich nicht so groß"}, {"id": 790, "start": 6165.54, "end": 6166.54, "text": "aus."}, {"id": 791, "start": 6166.54, "end": 6177.62, "text": "Vielleicht haben wir es auch schon geguckt, ich kann mich nicht dran erinnern."}, {"id": 792, "start": 6177.62, "end": 6183.58, "text": "Das ist schon die viel unterhaltsamere Frage, finde ich."}, {"id": 793, "start": 6183.58, "end": 6187.7, "text": "Denn ja, in der Tat geht es darum, zum Finale eine möglichst gute Waffe und möglichst"}, {"id": 794, "start": 6187.7, "end": 6189.38, "text": "viele Leben zu haben."}, {"id": 795, "start": 6189.38, "end": 6193.26, "text": "Ich persönlich finde aber viele Leben deutlich sinnvoller als eine gute Waffe."}, {"id": 796, "start": 6193.26, "end": 6196.26, "text": "Naja, klar, am Ende gewinnt ja der, der der Leben übrig hat."}, {"id": 797, "start": 6196.26, "end": 6201.06, "text": "Hättest du stattdessen aber fünf Leben, so hättest du auf fünf Chancen deinen Sieg"}, {"id": 798, "start": 6201.06, "end": 6202.7, "text": "noch irgendwie zu brute-forcen."}, {"id": 799, "start": 6202.7, "end": 6207.18, "text": "Und so habe ich schon in meiner ersten oder zweiten Runde einen Spot gefunden, bei dem"}, {"id": 800, "start": 6207.18, "end": 6211.1, "text": "ich in aller Ruhe abhängen kann, während sich der Rest der Lobby gegenseitig umbringt."}, {"id": 801, "start": 6211.1, "end": 6217.14, "text": "Diese war zugegebener Maßnahme nicht sonderlich gut, weil zu weit außen und damit auch sofort"}, {"id": 802, "start": 6217.14, "end": 6218.46, "text": "außerhalb des Kreises."}, {"id": 803, "start": 6218.46, "end": 6223.26, "text": "Das war blöd und außerdem sollte man solche Eulenexploiter, wie ich einer bin, sowieso"}, {"id": 804, "start": 6223.26, "end": 6224.98, "text": "nicht mit so einfachen Positionen belohnen."}, {"id": 805, "start": 6224.98, "end": 6228.22, "text": "Also habe ich ganz schön eine bessere gefunden."}, {"id": 806, "start": 6228.22, "end": 6234.98, "text": "Du springst hier in der Mitte der Map runter und hast gewonnen."}, {"id": 807, "start": 6234.98, "end": 6236.98, "text": "Und man stirbt nicht, okay."}, {"id": 808, "start": 6236.98, "end": 6241.98, "text": "Interessant, dass man da nicht stirbt."}, {"id": 809, "start": 6241.98, "end": 6245.22, "text": "Da hat doch auch irgendeiner verschissen beim Mapbauen, oder?"}, {"id": 810, "start": 6245.22, "end": 6263.22, "text": "Ja, das ist wichtig und zusätzlich kann niemand im Zuschauermodus erkennen, wo du stehst,"}, {"id": 811, "start": 6263.22, "end": 6268.5, "text": "weil, ja, natürlich kannst du in diesem Battle-Royale-Modus Leute vom Respawn beobachten, um zu sehen,"}, {"id": 812, "start": 6268.5, "end": 6269.5, "text": "wo sie sind."}, {"id": 813, "start": 6269.5, "end": 6270.5, "text": "Alles andere wäre ja unfair."}, {"id": 814, "start": 6270.5, "end": 6271.5, "text": "Was?"}, {"id": 815, "start": 6271.5, "end": 6278.06, "text": "Okay, da fällt mir kein anderer Battle-Royale ein, der das hat."}, {"id": 816, "start": 6278.06, "end": 6279.06, "text": "Warum?"}, {"id": 817, "start": 6279.06, "end": 6285.62, "text": "Ja gut, ich kann mir vorstellen, warum, weil wahrscheinlich das in Halo Hardcoded so drin"}, {"id": 818, "start": 6285.62, "end": 6286.62, "text": "ist."}, {"id": 819, "start": 6286.62, "end": 6287.62, "text": "Genau."}, {"id": 820, "start": 6287.62, "end": 6293.14, "text": "Und die hatten keinen Bock, das anzupassen, genau das wäre meine Vermutung gewesen."}, {"id": 821, "start": 6293.14, "end": 6300.74, "text": "Ja, aber ich kann mir sogar denken, also irgendwann existiert hier unten bestimmt ein Dev-Trigger,"}, {"id": 822, "start": 6300.74, "end": 6305.94, "text": "weil halt Lava-Becken, dann dachte sich aber irgendjemand anders, dass es doch den Greifhaken"}, {"id": 823, "start": 6305.94, "end": 6310.98, "text": "gibt und man sich mit diesem noch retten könnte, also wurde der Dev-Trigger etwas weiter runtergesetzt"}, {"id": 824, "start": 6310.98, "end": 6314.46, "text": "und die Ecke blieb übrig und dann hat niemand nachgeguckt, ob dieser kleine Vorsprung hier"}, {"id": 825, "start": 6314.46, "end": 6320.02, "text": "eine Kollision hat und nein, bevor irgendjemand fragt, es wurde bis heute nicht gefixt."}, {"id": 826, "start": 6320.02, "end": 6326.9, "text": "Aber hey, ich hab noch 5 Leben übrig, der letzte andere hat nur 0, er hat 11 Kills,"}, {"id": 827, "start": 6326.9, "end": 6332.26, "text": "ich nur einen und okay, der Kreis kostet mir irgendwann auch ein Leben, ja, aber dann"}, {"id": 828, "start": 6332.26, "end": 6335.34, "text": "hab ich immer noch 4 und er nicht."}, {"id": 829, "start": 6335.34, "end": 6339.9, "text": "Selbst wenn ich also waffentechnisch unterlegen bin, irgendwie beiße ich mich da schon durch."}, {"id": 830, "start": 6339.9, "end": 6344.06, "text": "Alles was ich brauche ist ja nur ein Nahkampftrade und wie wir gesehen haben, sind Traits nicht"}, {"id": 831, "start": 6344.06, "end": 6346.34, "text": "gerade selten in diesem Spiel."}, {"id": 832, "start": 6346.34, "end": 6353.7, "text": "Und mit diesen Gedanken werfe ich ihm eine Stugnail an den Hinterkopf und tadaa, Victory"}, {"id": 833, "start": 6353.7, "end": 6354.7, "text": "Soja!"}, {"id": 834, "start": 6354.7, "end": 6361.54, "text": "Natürlich hab ich auch mal auf legitime Art und Weise gewinnen können, hier, ich greife"}, {"id": 835, "start": 6361.54, "end": 6369.26, "text": "jemanden an, dann rennt er aus dem Kreis raus und stirbt, seht ihr, ich bin gut, aber hier"}, {"id": 836, "start": 6369.26, "end": 6370.26, "text": "unten..."}, {"id": 837, "start": 6370.26, "end": 6375.34, "text": "Alter, das wirkt alles sehr mit heißer Nadel und unüberlegt gestrickt, oder?"}, {"id": 838, "start": 6375.34, "end": 6377.46, "text": "Es ist einfach so viel entspannter."}, {"id": 839, "start": 6377.46, "end": 6387.66, "text": "Ich kann Chips essen, oder Stargate gucken, oder mich mit einem Freund darüber unterhalten,"}, {"id": 840, "start": 6387.66, "end": 6390.78, "text": "dass wir beide mittlerweile wieder angefangen haben Bücher zu lesen."}, {"id": 841, "start": 6390.78, "end": 6395.06, "text": "Nein, ich würde es ja funktionieren, wenn ich sage, ey, liefert das Buch mal zu euch"}, {"id": 842, "start": 6395.06, "end": 6398.78, "text": "und dann bezahle ich bei der Abholung, aber den zahl ich halt mit meinem Einkaufszentral-Gutschein,"}, {"id": 843, "start": 6398.78, "end": 6403.46, "text": "wo ich das noch in 40 Euro Gutschein esse."}, {"id": 844, "start": 6403.46, "end": 6404.46, "text": "Wow!"}, {"id": 845, "start": 6404.46, "end": 6405.46, "text": "Nein!"}, {"id": 846, "start": 6405.46, "end": 6406.46, "text": "Diese Scheiße!"}, {"id": 847, "start": 6406.46, "end": 6409.66, "text": "Ich hab nix gemacht, ihr Liebes!"}, {"id": 848, "start": 6409.66, "end": 6412.46, "text": "Wie man sieht, es läuft prima."}, {"id": 849, "start": 6412.46, "end": 6417.34, "text": "Und ja, wie man gerade sehr schön erkennen konnte, stirbst du gegen Ende des Matches,"}, {"id": 850, "start": 6417.34, "end": 6420.86, "text": "hast aber noch Leben übrig, dann spawnst du einfach irgendwo und nirgendwo und nimmst"}, {"id": 851, "start": 6420.86, "end": 6421.86, "text": "sofort Sharp."}, {"id": 852, "start": 6421.86, "end": 6422.86, "text": "Moment, Moment!"}, {"id": 853, "start": 6422.86, "end": 6426.58, "text": "Man respawnt dann in der Zone, oder was?"}, {"id": 854, "start": 6426.58, "end": 6431.9, "text": "Alter, wie unüberlegt ist, was haben die denn da zusammengestrickt?"}, {"id": 855, "start": 6431.9, "end": 6437.66, "text": "Wie ist eigentlich die Halo-Serie?"}, {"id": 856, "start": 6437.66, "end": 6442.58, "text": "Wohl richtiger Bodensatz angeblich, die Halo-Serie, was ich gelesen hab."}, {"id": 857, "start": 6442.58, "end": 6458.06, "text": "Ja, dann sieht man halt, dass es keine so clevere Idee ist, nen respawn Battle Royale zu machen."}, {"id": 858, "start": 6458.06, "end": 6467.7, "text": "In Windeseile, so schnell wie ich nur irgendwie konnte, zu dem letzten Safe-Spot-Rennen, den"}, {"id": 859, "start": 6467.7, "end": 6468.7, "text": "es gab."}, {"id": 860, "start": 6468.7, "end": 6471.7, "text": "Geil, in dem Turtel!"}, {"id": 861, "start": 6471.7, "end": 6472.7, "text": "Toll!"}, {"id": 862, "start": 6472.7, "end": 6473.7, "text": "Super!"}, {"id": 863, "start": 6473.7, "end": 6474.7, "text": "Und jetzt kommst du nirgendswo hin."}, {"id": 864, "start": 6474.7, "end": 6479.34, "text": "Dieses fitzige Land, meine letzte Hoffnung, mein sicherer Hafen und, wie ich noch lernen"}, {"id": 865, "start": 6479.34, "end": 6482.18, "text": "sollte, meine neue Heimat."}, {"id": 866, "start": 6482.18, "end": 6483.74, "text": "Na toll."}, {"id": 867, "start": 6483.74, "end": 6488.94, "text": "Alter, wer hat sich das denn wieder ausgedacht?"}, {"id": 868, "start": 6488.94, "end": 6494.78, "text": "Haben die irgendwie Mitarbeiter geshared mit Dice, oder was ist da los?"}, {"id": 869, "start": 6494.78, "end": 6507.98, "text": "Und saß hier, und saß hier, aus Sekunden wurden Minuten, selbst die treuesten zufolge"}, {"id": 870, "start": 6507.98, "end": 6508.98, "text": "..."}, {"id": 871, "start": 6508.98, "end": 6515.74, "text": "... und erwarten, dass die Zone weiter schrumpft, oder aber sich halt bewegt oder so."}, {"id": 872, "start": 6515.74, "end": 6522.26, "text": "... und verließen nach und nach die Lobby, und es ging nur noch um uns beide, und, wie"}, {"id": 873, "start": 6522.26, "end": 6527.06, "text": "man hört, ich hockte hier unten und er dort oben."}, {"id": 874, "start": 6527.06, "end": 6531.62, "text": "Nur ein paar Meter schlecht texturierter Metallschichten trennten mich von meinem Todfeind."}, {"id": 875, "start": 6531.62, "end": 6532.62, "text": "Seh ich das richtig?"}, {"id": 876, "start": 6532.62, "end": 6535.46, "text": "Die Zone wird nicht mal kleiner und bewegt sich auch sonst nicht mehr?"}, {"id": 877, "start": 6535.46, "end": 6540.46, "text": "Also die haben quasi das Mindeste, was du einbauen musst am Ende von einem Battle Royale,"}, {"id": 878, "start": 6540.46, "end": 6541.7, "text": "gar nicht eingebaut, oder was?"}, {"id": 879, "start": 6541.7, "end": 6546.38, "text": "Alter, sind die unfähig, äh, Wahnsinn."}, {"id": 880, "start": 6546.38, "end": 6548.9, "text": "Ah, und doch, so, fair."}, {"id": 881, "start": 6548.9, "end": 6551.1, "text": "Warte, und die Zone wird hier noch mal kleiner?"}, {"id": 882, "start": 6551.1, "end": 6552.1, "text": "Wahrscheinlich."}, {"id": 883, "start": 6552.1, "end": 6553.1, "text": "Haha."}, {"id": 884, "start": 6553.1, "end": 6554.1, "text": "Weil das..."}, {"id": 885, "start": 6554.1, "end": 6555.1, "text": "Haha, so, geil."}, {"id": 886, "start": 6555.1, "end": 6559.9, "text": "Das ist da reingerannt und wurde gefestet, äh."}, {"id": 887, "start": 6559.9, "end": 6561.9, "text": "Dieses kack Spiel."}, {"id": 888, "start": 6561.9, "end": 6564.9, "text": "Mensch, was für ein spannendes Schicken-Dinner."}, {"id": 889, "start": 6564.9, "end": 6568.74, "text": "Natürlich könnte man jetzt auch einfach denken, dass es nur ein blöder Zufall war, und der"}, {"id": 890, "start": 6568.74, "end": 6572.86, "text": "Kreis ganz sicher nur ganz versehentlich so gefallen ist oder irgendwie sowas, aber,"}, {"id": 891, "start": 6572.86, "end": 6578.22, "text": "ähm, was das dann geht, der Ring kann auf genau drei Positionen fallen."}, {"id": 892, "start": 6578.22, "end": 6579.22, "text": "Moment, was?"}, {"id": 893, "start": 6579.22, "end": 6581.86, "text": "Die Zone ist nicht mal zufällig?"}, {"id": 894, "start": 6581.86, "end": 6586.1, "text": "Oder zumindest, zumindest irgendwie ein bisschen randomized?"}, {"id": 895, "start": 6586.1, "end": 6595.3, "text": "Mein, drei ist, äh, drei ist bei mir nicht random, das sind 33%."}, {"id": 896, "start": 6595.3, "end": 6596.3, "text": "Drei Zonen?"}, {"id": 897, "start": 6596.3, "end": 6597.3, "text": "Äh, äh, drei, drei."}, {"id": 898, "start": 6597.3, "end": 6599.7, "text": "Okay, also, die Zone ist nicht richtig randomized, und die Zone am Ende bewegt sich nicht und"}, {"id": 899, "start": 6599.7, "end": 6600.7, "text": "wird nicht mal kleiner."}, {"id": 900, "start": 6600.7, "end": 6609.98, "text": "Also, das ist ja, offenem Niveau, ungefähr so, wie als ich meine erste Half-Life-1-Map"}, {"id": 901, "start": 6609.98, "end": 6611.78, "text": "mit drei Containern gebaut habe."}, {"id": 902, "start": 6611.78, "end": 6620.1, "text": "Eine, bei der ich meinen regulären Sieg hatte, okay, eine genau in der Mitte der Map mit"}, {"id": 903, "start": 6620.1, "end": 6624.46, "text": "zwei Ebenen, bei der ein Typ unter mir hockt und nicht mehr wegkommt, ich hier oben hocke"}, {"id": 904, "start": 6624.46, "end": 6629.62, "text": "und hier unendlich Plasma-Granaten nachspawn, das ist auch eine tolle Pose, tolle Pose,"}, {"id": 905, "start": 6629.62, "end": 6639.58, "text": "und halt, ey, guck mal hier, wow, der Tunnel, der Tunnel wieder, ja, das heißt, irgendjemand"}, {"id": 906, "start": 6639.58, "end": 6643.38, "text": "hat sich bewusst dazu entschieden, den Kreis genau so zu platzieren, dass diese Kleinen"}, {"id": 907, "start": 6643.38, "end": 6644.38, "text": "enden würden."}, {"id": 908, "start": 6644.38, "end": 6645.38, "text": "Ach, du Kacke."}, {"id": 909, "start": 6645.38, "end": 6646.9, "text": "Ja, ja, Chat, es ist wirklich, mach mal Battle Royale, heute Mittag muss er fertig sein."}, {"id": 910, "start": 6646.9, "end": 6651.5, "text": "... übrig bleibt und ich jedes Mal wirklich Runde für Runde hier unten hock..."}, {"id": 911, "start": 6651.5, "end": 6652.5, "text": "Mr."}, {"id": 912, "start": 6652.5, "end": 6653.5, "text": "Moogam, sag das nicht so laut."}, {"id": 913, "start": 6653.5, "end": 6656.5, "text": "Sonst muss ich demnächst auch Battlefield-Container platzieren."}, {"id": 914, "start": 6656.5, "end": 6659.98, "text": "... vollkommen verdienter Sieg vom Himmelfiel."}, {"id": 915, "start": 6659.98, "end": 6662.82, "text": "Jedes andere Spiel hätte einen Ring, der noch mal ein wenig enger wird, dass nur noch"}, {"id": 916, "start": 6662.82, "end": 6668.42, "text": "einer reinpasst oder ein Zeitlimit oder irgendeine andere Mechanik, um einen Sieger zu erzwingen."}, {"id": 917, "start": 6668.42, "end": 6671.06, "text": "Nur Infinite hat sowas nicht nötig."}, {"id": 918, "start": 6671.06, "end": 6676.82, "text": "Bei Lava hocken, warten, Sieg, hoffen, dass du nicht gekickt wirst, weil du auf K warst."}, {"id": 919, "start": 6676.82, "end": 6682.86, "text": "Da hat irgendein Typ gesagt, Leute, Battle Royale ist der Shit, was machen wir denn jetzt?"}, {"id": 920, "start": 6682.86, "end": 6685.46, "text": "Wie lautet unsere Battle Royale Strategie?"}, {"id": 921, "start": 6685.46, "end": 6690.7, "text": "Und da haben sich irgendwie so ein paar arme Würstchen, die quasi nicht schnell genug"}, {"id": 922, "start": 6690.7, "end": 6695.38, "text": "flüchten konnten, hinsetzen müssen und ein Halo Battle Royale programmieren und genauso"}, {"id": 923, "start": 6695.38, "end": 6701.18, "text": "wirkt das auch. Irgendwas, was nicht ins Game passt, von Leuten, die keinen Bock drauf hatten,"}, {"id": 924, "start": 6701.18, "end": 6703.7, "text": "es zu entwickeln, irgendwie rausgekackt."}, {"id": 925, "start": 6703.7, "end": 6709.42, "text": "Ecke hocken, warten, Sieg, es ist unglaublich."}, {"id": 926, "start": 6709.42, "end": 6714.34, "text": "Dagegen sieht der Battlefield 2042 Battle Royale-Modus richtig pock aus, ja das ist richtig."}, {"id": 927, "start": 6714.34, "end": 6715.94, "text": "Nicht vorhanden ist besser als das."}, {"id": 928, "start": 6715.94, "end": 6721.26, "text": "Am meisten mochte ich ja den Typen, der hier irgendwann runtergehobst ist, wie jeder andere"}, {"id": 929, "start": 6721.26, "end": 6724.34, "text": "auch, aber einfach weiterliefern würde ich gar nicht hier gewesen."}, {"id": 930, "start": 6724.34, "end": 6729.66, "text": "Ich war echt so ein bisschen perplex, was da gerade passiert ist, also habe ich mal ganz"}, {"id": 931, "start": 6729.66, "end": 6733.58, "text": "kurz in der Kinolobby nachgeguckt und wisst ihr was?"}, {"id": 932, "start": 6733.58, "end": 6738.9, "text": "Er konnte mich in der Panik gar nicht sehen, weil 343 auf die Idee kam, rote Outlines hinter"}, {"id": 933, "start": 6738.9, "end": 6741.46, "text": "einem roten Vorhang verstecken zu müssen."}, {"id": 934, "start": 6741.46, "end": 6743.54, "text": "Okay, da siehst du wirklich nichts."}, {"id": 935, "start": 6743.54, "end": 6744.54, "text": "Da siehst du wirklich nichts."}, {"id": 936, "start": 6744.54, "end": 6750.1, "text": "Ja, das ist mein Fazit, glaube ich."}, {"id": 937, "start": 6750.1, "end": 6754.26, "text": "Stimmt, da ist wahrscheinlich sogar Hazard Zone besser, Leute."}, {"id": 938, "start": 6754.26, "end": 6758.94, "text": "Das heißt schon was, also wenn irgendwas besser ist als, wenn Hazard Zone besser ist"}, {"id": 939, "start": 6758.94, "end": 6761.94, "text": "als irgendwas, das ist wirklich, das lässt tief blicken."}, {"id": 940, "start": 6761.94, "end": 6765.98, "text": "Und das war es dann auch eigentlich schon."}, {"id": 941, "start": 6765.98, "end": 6770.42, "text": "Das war das große Season 2 Update, mit dem man die Wartezeit überbrücken wollte, bis"}, {"id": 942, "start": 6770.42, "end": 6774.74, "text": "all der angekündigte Content, der ja eigentlich schon zur Release da sein sollte, endlich"}, {"id": 943, "start": 6774.74, "end": 6779.34, "text": "mal nachgeliefert wird, sobald man jemand dran arbeiten möchte."}, {"id": 944, "start": 6779.34, "end": 6781.98, "text": "Nichts, aber auch gar nichts, passt hier zueinander."}, {"id": 945, "start": 6781.98, "end": 6784.66, "text": "Sollte Infinite nicht auch ein Service-Game werden?"}, {"id": 946, "start": 6784.66, "end": 6788.74, "text": "Was ist denn mit den ganzen Service-Games eigentlich los?"}, {"id": 947, "start": 6788.74, "end": 6793.1, "text": "Da fehlt alles unter Service."}, {"id": 948, "start": 6793.1, "end": 6798.1, "text": "Out of Service, ja."}, {"id": 949, "start": 6798.1, "end": 6822.74, "text": "Es ist so ein Fall vom Problem, die so tiefgreifend sind, dass keine mögliche Lösung funktioniert"}, {"id": 950, "start": 6822.74, "end": 6825.54, "text": "hätte, weil der Modus niemals funktioniert hätte."}, {"id": 951, "start": 6825.54, "end": 6832.26, "text": "Nicht so, nicht in diesem Spiel und schon gar nicht auf dieser Map."}, {"id": 952, "start": 6832.26, "end": 6835.74, "text": "Später konnte man das Ganze dann auch endlich auf den anderen Victim-Karten spielen, was"}, {"id": 953, "start": 6835.74, "end": 6841.58, "text": "sicher besser war als das hier, aber auch nur knapp und seit dem neuesten Update ist"}, {"id": 954, "start": 6841.58, "end": 6842.58, "text": "er sogar tot."}, {"id": 955, "start": 6842.58, "end": 6848.18, "text": "Er ist tot, der Modus ist tot, nicht du findest keine Spieler mehr tot, das war nämlich"}, {"id": 956, "start": 6848.18, "end": 6851.78, "text": "vorher schon, sondern weg, vollständig aus dem Spiel entfernt."}, {"id": 957, "start": 6851.78, "end": 6854.5, "text": "Ok, sie haben festgestellt, es ist einfach Crap gewesen."}, {"id": 958, "start": 6854.5, "end": 6859.66, "text": "343 Community-Guru-Sketch erklärte, es war bei Vitem der am wenigsten gespielte Modus"}, {"id": 959, "start": 6859.66, "end": 6860.66, "text": "in Halo Infinite."}, {"id": 960, "start": 6860.66, "end": 6861.66, "text": "Ja ach, warum wohl?"}, {"id": 961, "start": 6861.66, "end": 6862.66, "text": "Warum wohl?"}, {"id": 962, "start": 6862.66, "end": 6864.86, "text": "Weil er so gut war, oder wie?"}, {"id": 963, "start": 6864.86, "end": 6869.74, "text": "Ich frag mich ja wieso, aber ganz ehrlich, was hatte man auch anderes erwartet?"}, {"id": 964, "start": 6869.74, "end": 6874.1, "text": "Apex oder PUBG zahlen ja sicher nicht, aber überhaupt zahlen hätte man ja wohl gerne"}, {"id": 965, "start": 6874.1, "end": 6875.1, "text": "gesehen."}, {"id": 966, "start": 6875.1, "end": 6880.3, "text": "Ist doch schön, wie man so viel Mühe, so ein bisschen Mühe und so viel Arbeit kaum"}, {"id": 967, "start": 6880.3, "end": 6885.66, "text": "Arbeit investierte, nur damit der große neue Modus so hart floppte und man nicht..."}, {"id": 968, "start": 6885.66, "end": 6889.66, "text": "Es ist wahrscheinlich einfach gewesen, dass man was im Trailer zum Zeigen hatte, dass"}, {"id": 969, "start": 6889.66, "end": 6894.1, "text": "es nicht so erbärmlich ist, dass man nur eine Map irgendwie in vier Monaten hinkriegt und"}, {"id": 970, "start": 6894.1, "end": 6896.1, "text": "alles andere verschieben muss."}, {"id": 971, "start": 6896.1, "end": 6904.3, "text": "Wie vier Monate reicht das noch gar nicht, das kam von einem Jahr raus oder so."}, {"id": 972, "start": 6904.3, "end": 6915.22, "text": "Oh, ich erkenne da Parallelen zu Battlefield 2042, die posten auch ganz viele Roadmaps"}, {"id": 973, "start": 6915.22, "end": 6919.14, "text": "und neue Stellen, wo sie Kisten platzieren wollen auf Maps."}, {"id": 974, "start": 6919.14, "end": 6920.74, "text": "Aber passieren tut nix."}, {"id": 975, "start": 6920.74, "end": 6944.78, "text": "Ist"}, {"id": 976, "start": 6944.78, "end": 6952.7, "text": "das 2023?"}, {"id": 977, "start": 6952.7, "end": 6954.94, "text": "Reden die von 2023?"}, {"id": 978, "start": 6954.94, "end": 6972.06, "text": "Ich meine, wer glaubt dort, dass dann überhaupt noch irgendjemand das auch nur mitbekommt,"}, {"id": 979, "start": 6972.06, "end": 6976.82, "text": "das ist ja fast noch schlimmer als Battlefield 2042."}, {"id": 980, "start": 6976.82, "end": 7005.98, "text": "Ja, der Map-Editor, aber Coop war aber auch wirklich..."}, {"id": 981, "start": 7005.98, "end": 7006.98, "text": "Wie billig aussieht."}, {"id": 982, "start": 7006.98, "end": 7008.98, "text": "Die mega billig aussieht."}, {"id": 983, "start": 7008.98, "end": 7032.54, "text": "Seht ihr wieder richtige Experten am Start bei 343?"}, {"id": 984, "start": 7032.54, "end": 7049.66, "text": "Ach du Scheiße, das ist ja noch..."}, {"id": 985, "start": 7049.66, "end": 7055.5, "text": "Also, das kratzt ja fast schon an Battlefield 2042 Fehler."}, {"id": 986, "start": 7055.5, "end": 7060.46, "text": "Früher gab es eine Sache, wisst ihr was der Unterschied zwischen diesen Games und Games"}, {"id": 987, "start": 7060.46, "end": 7064.5, "text": "guten Spielen von früher?"}, {"id": 988, "start": 7064.5, "end": 7068.06, "text": "Der Unterschied ist, dass die Leute früher Games gemacht haben, die sie selber spielen"}, {"id": 989, "start": 7068.06, "end": 7069.06, "text": "wollten."}, {"id": 990, "start": 7069.06, "end": 7073.98, "text": "So, dass sie die selber gerne gespielt hätten, oder sie haben sie ja auch gespielt."}, {"id": 991, "start": 7073.98, "end": 7078.7, "text": "Also, Spieleentwickler haben ihre eigenen Games gespielt und das nicht zu knapp."}, {"id": 992, "start": 7078.7, "end": 7090.74, "text": "Ich meine, jetzt kann mir keiner erzählen, dass die Badais wirklich den Battlefield 2042"}, {"id": 993, "start": 7090.74, "end": 7093.74, "text": "grind gemacht haben, während der Entwicklung, im Leben nicht."}, {"id": 994, "start": 7093.74, "end": 7101.14, "text": "Und die Halo-Entwickler wahrscheinlich auch nicht, die meisten Entwickler nicht."}, {"id": 995, "start": 7101.14, "end": 7106.14, "text": "Früher wurden Games entwickelt von Entwicklern, die das was sie entwickelt haben so gebaut"}, {"id": 996, "start": 7106.14, "end": 7110.14, "text": "haben, dass es was ist, was sie selbst gerne spielen würden... oder spielen."}, {"id": 997, "start": 7110.14, "end": 7120.02, "text": "Ja, das gleiche Problem habe ich auch."}, {"id": 998, "start": 7120.02, "end": 7123.7, "text": "Es gibt immer mal wieder ein paar Sachen, aber es gibt halt nicht so diese krassen Grind"}, {"id": 999, "start": 7123.7, "end": 7127.7, "text": "Games für mich, wo ich dann quasi schon auf der Arbeit überlege, Alter, wenn ich heimkomme,"}, {"id": 1000, "start": 7127.7, "end": 7130.1, "text": "mache ich das an und dann wird eine Runde gebashed und so, das habe ich nicht mehr."}, {"id": 1001, "start": 7130.1, "end": 7135.58, "text": "Das neue Monkey Island habe ich nicht gespielt, nee."}, {"id": 1002, "start": 7135.58, "end": 7139.94, "text": "Das soll an sich tatsächlich ganz gut sein, es gab ja wieder riesen Hickhack um die Grafik,"}, {"id": 1003, "start": 7139.94, "end": 7143.94, "text": "dass die ja doch irgendwie und nicht so doll und hier und da und die Fans haben sich betrogen"}, {"id": 1004, "start": 7143.94, "end": 7149.5, "text": "gefühlt und was auch immer, das kann man so schwer sagen, wenn man das nicht in Bewegung"}, {"id": 1005, "start": 7149.5, "end": 7152.9, "text": "sieht, soll tatsächlich nicht schlecht sein."}, {"id": 1006, "start": 7152.9, "end": 7164.5, "text": "In Diablo 4 habe ich keine Hoffnung, ich habe generell in Blizzard Games auch keine"}, {"id": 1007, "start": 7164.5, "end": 7165.5, "text": "Hoffnung mehr."}, {"id": 1008, "start": 7165.5, "end": 7170.66, "text": "Die haben doch die letzten Jahre über nichts hingekriegt, das letzte wirklich was sie hingekriegt"}, {"id": 1009, "start": 7170.66, "end": 7175.5, "text": "haben ist Overwatch 1, was sie jetzt wieder auch kolossal gegen die Wand gefahren haben."}, {"id": 1010, "start": 7175.5, "end": 7189.78, "text": "Und davor 2013 oder so StarCraft 2, das Originale von den Erweiterungen, ja."}, {"id": 1011, "start": 7189.78, "end": 7195.46, "text": "Ansonsten Blizzard hat nicht wirklich was großartig auf die Reihe gekriegt."}, {"id": 1012, "start": 7195.46, "end": 7201.06, "text": "Die haben mehr gegen die Wand gefahren und verkackt die letzten Jahre über, als dass"}, {"id": 1013, "start": 7201.06, "end": 7202.34, "text": "da was gutes rauskam."}, {"id": 1014, "start": 7202.34, "end": 7211.34, "text": "Diablo 2 Resurrected, ja gut, das stimmt, das ist tatsächlich ganz okay geworden."}, {"id": 1015, "start": 7211.34, "end": 7217.26, "text": "Aber das ist jetzt ja nichts großes Neues irgendwo."}, {"id": 1016, "start": 7217.26, "end": 7234.34, "text": "Warcraft 3 Deforged, ja, also die World of Warcraft Erweiterung verfolge ich nur am Rande."}, {"id": 1017, "start": 7234.34, "end": 7239.66, "text": "Ich glaube die Erweiterung, die die Leute gut fanden, war eigentlich nur Legion, oder,"}, {"id": 1018, "start": 7239.66, "end": 7240.66, "text": "die letzten Jahre über."}, {"id": 1019, "start": 7240.66, "end": 7243.42, "text": "Battle for Azeroth fanden die alle kacke."}, {"id": 1020, "start": 7243.42, "end": 7248.46, "text": "Die Warlords of Draenor fanden sie alle kacke."}, {"id": 1021, "start": 7248.46, "end": 7251.66, "text": "Was kam da sonst noch?"}, {"id": 1022, "start": 7251.66, "end": 7258.02, "text": "Ich kenne mich mit WoW Addons nicht aus."}, {"id": 1023, "start": 7258.02, "end": 7260.66, "text": "Shadowlands fanden die meisten kacke, vor allem am Ende hin."}, {"id": 1024, "start": 7260.66, "end": 7274.02, "text": "Ich glaube das war es, mehr gab es die letzten Jahre nicht."}, {"id": 1025, "start": 7274.02, "end": 7294.02, "text": "Leute, ich muss pennen, wir sehen uns morgen, machts gut, bis dann, see you."}]}