{"text": "Ja Leute, ich dachte mir so, es ist 20.20 Uhr, ich kann jetzt eh nichts mehr machen.Da komm ich noch einfach mal eineinhalb Stunden an.Muss ich bloß erwarten bis Twitch das mitgekriegt hat.Omega Lul.Bis jetzt hat es Twitch natürlich nicht gecheckt.Boomer, müde, Bedgetime.Moin Michael, 50 Billionen.Omega wieder da.Und was macht Lisa?Ist doch Lisa, oder?Manchmal merke ich mir so random Sachen.Ich weiß nicht, ich kann dir nicht sagen was gestern war, aber manche Sachen merke ich mir.Läuft's bei euch, ja?Moin Sirius Max.Mochek ist auch am Start.Also ich hab heute immer Sushi essen.Moment.Sushi essen und sie hat bezahlt, aha.Ja, 2022 ist das Jahr kein Ding mehr.Da muss man sich auch mal einladen lassen können.69 Euro, das ist ganz schön teuer.Mein Sushi ist immer teuer.Aber mittlerweile ist es echt abfach teuer.Ich überlege, ich habe heute Thunfisch gekauft.Aus der Dose, Thunfischdose, so ein paar hundert Gramm oder so.Drei Euro pro Dose, Alter.Na dann.Da hast du entweder sehr viel Eindruck gemacht.Oder es hat andere Gründe, wo man dann immer nur spekulieren kann.So, jetzt hat's Twitch kapiert.Na das ist doch schön.Ich bin echt froh, dass ich mal so oft essen gehe.Ich gehe tatsächlich auch so gut wie gar nicht mehr essen.Ich bin ja nicht in Frankfurt, selten nur noch in Frankfurt.Und...Wartet mal.Genau, wie gesagt, ich bin ja kaum noch in Frankfurt.Dementsprechend gehe ich auch nicht essen.Ich war letzte Woche tatsächlich zwei Tage da, zwei Tage essen.Und gleich danach an einem Tag wieder ordentlich...Ja, also, ich gehe da nicht mehr essen.Ich bin eh kaum da und wenn ich da bin, sollte ich besser nicht essen gehen.Dankeschön, Leon.Messe, vier Monate Hyper-Subscription hier.Mario, Dankeschön für den Sub.Ja, da war richtig, richtig dampf wieder.Und dazu kommt, dass man richtig viel Geld spart.Also, ich bin ungefähr sonst immer einmal im Monat zur Bank gegangen.Also, ich bin öfters zur Bank gegangen.Aber ich bin einmal im Monat zur Bank gegangen, immer um halt Geld für den Monat abzuheben.Ich habe ungefähr jeden Monat irgendwie so 1.000 Euro abgehoben.Und jeden Monat.Und ich musste dieses Jahr irgendwie...Also normalerweise musst du wirklich jeden Monat 1.000 Euro abheben.So für...Zeugs halt, ja.Essen, mal was einkaufen und so.Und jetzt...Seit ich...Seit Corona und seit Homeoffice...Ich glaube, ich war dieses Jahr erst...Viermal oder so.Drei oder viermal auf der Bank.Den Rest habe ich online bestellt, online gekauft, bezahlt.Aber ich gebe halt kaum noch was zu essen aus.Es ist ein Riesenunterschied, ob du täglich in Frankfurt irgendwie 10 bis 15 Euro oder so ausgibst.Was Essen angeht und drum herum.Oder daheim halt einfach fast nichts im Vergleich.Für die Drohung am Bahnhof.Die Story mit dem Bluterkurs im Arm und dem Frankfurt am Bahnhof habe ich dir ja schon erzählt.Oder habe ich euch ja schon erzählt.Du fängst demnächst eine Lehre an.Eine zweite Lehre als Fachinformatiker.Das ist nice.Machst du eine Umschulung oder machst du eine ganz normale Ausbildung bei irgendeinem Betrieb?Ein Kollege?Vollkommen falsch.Ein um drei Ecken Bekannter hat mich gefragt, ob ich ihm nicht irgendwie so einen Praktikumsplatz bei uns vermitteln könnte.Und habe ich gesagt, ja, ich kann ja mal fragen.So ein bisschen meine gute...Wie sagt man so?Karma?Nee, so ein bisschen meine gute Aura.Bisschen wieder auffrischen, ja.Dann habe ich unseren Ausbildungschef gefragt, wie es aussieht.Um Umschulungen und Praktikum machen und sowas.Dann meinte der A, weiß er nicht so genau, braucht ein bisschen mehr Details.Dann habe ich dem, dem um drei Ecken Bekannten, habe ich dann das geschickt.Hab ich gesagt, hier guck mal, der hat noch ein paar Fragen.Und dann hat der Typ eine Woche gebraucht, darauf zu antworten.Ich habe eigentlich gar keinen Bock mehr, das jetzt unserem Ausbildungschef zu schicken.Der Kerl ist eh schon unten durch, wenn es eine Woche dauert, bis der auf die einfachsten Sachen antwortet.Also...Weiß nicht, ob ich da nochmal ein gutes Wort einlegen soll.Ich hatte gewusst, ey, das ist wie gesagt nice.Du machst ein richtiger Ausbilder.Also drei Jahre Azubi Grind ist gestartet.Erstes Kind heißt Wupplos, so muss das sein.Aber mit Null, ja.Ich frage mich, sind Buchstaben, äh ich fasse hin, Buchstaben klar.Sind Zahlen im Namen erlaubt in Deutschland, darf man das machen?Also darf man sein Kind, keine Ahnung, Max 420 oder so nennen?Oder 60, nein, oder was auch immer.Dein ist nicht erlaubt.Selfmade Eyes.Huge Abo-Falle zugeschlagen wieder.24 Monate, dankeschön.Du installierst gerade Manjaro auf deinem Arbeitsnotebook.Warum denn kein echtes Arch, by the way?Da würde sich der Chat hier freuen.Nur echtes Arch ist richtiges Arch.Manjaro ist Fake Arch.Aber ich verwende das auch.Die Kinder durchnummerieren.Sag mal, ist heute irgendwas?Normalerweise haben wir nach 10 Minuten Stream irgendwie 150, 200 Leute.Hab ich irgendwas verpasst? Ist heute irgendwas?Ich meine, nicht, dass es super spannendes Thema heute gebe oder so, was die Leute verpassen würden.Das ist nicht so.Ach, Discord hat es auch noch nicht gecheckt?Ja, dann hat Twitch einfach noch gar nicht überall rausgeschickt.Guck mal hier, was ist da los?Also sind, das stimmt übrigens auch nicht.Bei mir sind es angeblich gerade 91.Na, dafür sind es schon wiederum zu viele.Was machst du mit der neuen VM weiter?Ja, weiß nicht, die alte tut ja.Aber ja, müsste ich mal,ich müsste vor allem mal mein Surface Book einrichten,was ich da von der Arbeit bekommen habe mit Linux.Das liegt jetzt auch schon wieder zwei Wochen hier rum.Du nutzt SteamOS auf Steam Deck für die Arbeit.Meinst du, ist das wirklich eine gute Umgebung zum Arbeiten?Weißt du, also geht das gut?Du würdest die Qt4M benutzen.Ist die safe for work?Und du meinst, die hier,die einzig wahre beste Desktop-Oberfläche,die je erstellt wurde.Meinst du die hier?Ja, die ist safe for work.Die kannst du verwenden.Aber ich glaube, jetzt haben wir auch genug gesehen,jetzt kann ich wieder ausmachen.Oh, ich muss Ubuntu updaten.Ja, ich weiß, dass ich Ubuntu updaten muss.Das ist nämlich noch, wartet mal,das ist nämlich noch ein...Ach so, ich habe Termin schon auf.Das ist nämlich noch ein Ubuntu 2104.Das ist ganz schön alt.Sogar das Trash Directory ist Qt.Ja, alles hyper Qt.So, machen wir wieder aus.Was ist das?QtOS?Nein, das ist nicht QtOS.Das ist...Moment, wie hieß das?Nicht Ubuntu, sondern...Oh, ich habe vergessen, wie das hieß.Nein, nein, nein, nein, nein, nicht Ubuntu.Wartet mal.Es gibt eins, das so heißt,aber das ist was anderes.Ich muss mal kurz gucken.MoBuntu.MoBuntu war das.Genau.Jetzt weiß ich es wieder.MoBuntu.Die Webseite sieht monkaTOS aus,ist sie aber nicht.Guck mal hier.MoBuntu.Also, wer sein Ubuntu ver...äh...ver, ver, ver, ja, ähm...Aja Jan will...verwiebisieren,das ist das Richtige hier.Mit MoE ausgesprochen.Was? MoEBuntu?Was?Ist nur 22.04, wie, da gibt es noch kein...Das läuft doch überall drauf, oder?Das ist doch nur letztendlich ein Gnome-Skin.Der scheiß Gnome.Das ist doch nur ein Gnome-Skin.Das kannst du wahrscheinlich sogarunter Arch, by the way, installieren.So, für Arch?Ja, siehste,das gibt es für alles mögliche.Mo... was?MoB? Da ist die MoApp.Wie auch immer das ausgesprochen wird.Das Demo ist es auch nur ein modifiziertes Arch.Ja.Mo... wund...ach, was?Was wird's?Okay, ich hab jetzt ungefähr chat.Ich hab jetzt mindestens acht verschiedeneAussprachen von euch gehört.Es hat keiner irgendeine Ahnung.Ihr könnt's ruhig zugeben.Es weiß keiner, wie man das richtig ausspricht.Oh, jetzt kommen wir jetzt schon mitLautumschrift und so wieder an.Einziges, einziges Fallfeld-Comment hier,wobei man halt gar nicht weiß, wie man das wirklich...Also ich weiß anhand diesem hier nicht,wie man das ausspricht.Moe.Moe. Buntu.Wie man auch mal Jason ausspricht,genau so, wie ich es jetzt ausgesprochen habe,außer der eine Typ, der meinen,dass ich das ausgesprochen habe,ist es nicht.Außer der eine Typ, der meint,dass es Jawsaw heißt.Jawsaw.Jawsorn,oder so.Aber wo wir gerade beim Thema sind,das Thema ist ja, wie man was ausspricht,und es gibt ja schon seitEwigkeiten diese Diskussion, ob GIFoder GIF.Ich habe heute in der Mittagspause,okay, ich gebe zu, nicht in der Mittagspause,nebenbei auf dem Kopfhörer,einenVortrag geguckt,den ich echt...Also nicht komplett, wie gesagt, Viertelstundeoder so habe ich geguckt.Einen Vortrag geguckt von einer Konferenz hier.Why Webtecis like this. Der erzähltein bisschen was über Mosaik und BoomerZeug.Ich habe geguckt, biswo er Mosaik zeigen wollte.Ich weiß, wenn wir sonst nichts zu tun haben,können wir uns den Vortrag zusammen angucken. Ich fand es wirklich spannend.Oder wir gucken Fireship, neues Video.How to never ride back.Das sieht zwar so aus, als hätte ich es geguckt, aber ich habe es nicht geguckt.Ich habe es einfach nur aufgemacht und...Dann war es offen.Kann ich deine Nachricht umbeantworten?Was denn?GitHub oder Shithub?Ja, der Meme-Faktorist natürlich Shithub.Gerade, gerade, durchder Endpunkt.Ach, noch weiter oben.Was denn jetzt?Was, wie, wo?Kannst du einen Portalempfehlen, auf dem man zum Beispieltechnische Fortbildungen RichtungSensor... Boah.Ich habe keine Ahnung.Ich habe keine Ahnung.Das Einzige,was ich an Fortbildungen kenne,beziehungsweise, den muss man nicht sagen, kenne, aberdas Einzige, gut, immer diesegrottenschlechte Escher-Schulung, die ich letztens auf der Arbeitgemacht habe, außen vor, weil diesmal wirklichPowerpoint durchgeklickt, ohneSinn und Verstand und der Typ meinte ja auch noch, das mussso sein. Oh, der war cringe,Alter. Der Trainer, dieseEscher-Trainer. Leute, wie sprichtdir das hier aus?Mal gucken, wie Google das ausspricht.Nein, nein, nein, nein.Ich meine nicht den Billard-Stock.Ich meine die Warteschlange.Warteschlange. Nein, nein.Q. Q. Q.Q. Q. Okay?Q. So spricht man das aus.Und ich spreche dasauch Q aus, genau.Undder Escher-Trainer,wisst ihr, wie der das ausgesprochen hat?Q.Und ich bin mir nicht sicher,ob der das, ich war miram Anfang nicht sicher, meint der dasernst, aber der hat das so oftgesagt, der hat so oftdas Absicht, Q.Die hat er gesagt die ganze Zeit.Und bis ich dann irgendwann festgestellt habe,der meint das ernst.Der N-Quit und D-Quitwahrscheinlich auch.Q.Ja, und irgendwie dachteich mir dann mit der Zeit, alsower wird denn hier allesTrainer bei Microsoft, man?Q.Q.Bei dir auf der Arbeitsagt einer zu Vue.jsVue.Und JS, was sagt der wie?Vudges?Oder so? Vudges?Anstatt Vue.js? Vudges?Finde ich eigentlich gar nicht schlecht.Vudges.Vudges.Ach, nur Vue.Alles klar.Tja, gut,es gibt eh auch die Diskussion, was Javaund Java und ach, was nichtalles, was nicht alles ist.Aber das mit GIF und GIF ist mir geradeeingefallen, weil ich den Talk ganz interessant fandund ich könnte fast wetten, das kommt da auch noch irgendwanndran.Ah ja, was ich jetzt habe ganz vergessen,also neben dieser grottenschlechten AzureSchulung, jetzt weiß ich auch wieder, was ich sagen wollte.Mal mein WeebOSzu machen.Das Einzige, wo ich maltatsächlich so ein paarWebinarsoder wie man es nennt, Kursegemacht hab, warbei, wie heißt diese Plattform?Da hab ich mal vor Jahrenein Ember.js Kurs, hatte ich mir malirgendwo gekauft.Einenich glaubeeinen ASP.NET Kurs, als ich damitmal, als ich ja noch gar keine Ahnung vonhatte, hab ich mir irgendwo immer, wie heißtdenn das, wie heißt, wie heißtWarte mal, Judemi, ja, ich glaube Judemi.Ja, ja, genau, ich glaube Judemi, das kann sein.Ja, ja, ich glaube schon.Oder gibt's, gibt's nicht sowas wieNetAcad, nee, nee, nee, nee, NetAcad, das istCisco, gell.Ja, ja, ich glaube, ich glaube,dann war's wahrscheinlich.Nicht ASP.NET, ASP.NETCore.ASP.NET ist shit, ASP.NET Coreist gut. Die Sache ist halt, warumheißt das Core? Ja, weil mal die MicrosoftBenamung halt absolutQuattruple U ist,weil Microsoft ihren Shit nicht richtigbenennt. Das kommt nochvon.NET Core, was es ja eigentlich in der Formgar nicht mehr gibt, weil.NETCore 4 quasiumbenannt wurde in.NET 5,was allerdings nichts mit.NET Framework4.8 zu tun hat. Also wer denkt,dass.NET 5 die WeiteEntwicklung von.NET Framework 4.8ist, liegt falsch..NET 5ist die Weite Entwicklung von.NET Core 3.1.Alles klar?......................................................Microsoft ist halt nicht 5-Hat, das ist ja das Problem, deswegen benennen sie das auch so bescheuert.Ich sag nur One Xbox One X und sowas.Prez Rief, Dankeschön für den Sub.Ein Jahr voll. Den goldenen Keks am Start. Leute, der goldene Keks ist quasi das dasheilste Kekstier, was wir haben.Ich müsste unbedingt mal neue Kekse beauftragen.Allerdings hat die E-Mode und Keks-Designering gerade andere Probleme. Die kommt, soweit ich weiß, aus der Ukraine.Ist jetzt irgendwie geflüchtet, sonst wohin. Die hat, glaube ich, gerade andere Probleme, als E-Modes zu malen.Oder auf Office 365. Ja, das habe ich bis heute nicht verstanden. Heißt das jetzt Office 365 oder Microsoft 365?Es heißt immer noch Office 365, aber ich dachte, es wurde unbedingt Microsoft. Ja, was denn jetzt?Microsoft 365 und teilweise Office 365. Meine Güte, Microsoft. Könnt ihr euch nicht mal für eins entscheiden?Ich mein, ja, ab jetzt Microsoft 365 ist so, ab jetzt, dass es sogar auf der offiziellen Office Seite noch Office 365 heißt.Guck mal, ach, jetzt steht Microsoft 365 drinne.Ach, ja.Mensch, wer soll denn da noch durchplicken, Alter?Ganz davon abgesehen, ich verwende den Mist eh nicht. Ganz ehrlich,man braucht keine Office-Anwendung. Office-Anwendungen sind absolut bloated.Einfach Text, Ach, Text-Editor, Kommando-Zeile seht, AWK reicht.Ich habe vier Millionen Tabs. Ja, Moment, ich habe da noch Tabs.Und, also wenn schon, wenn schon, denn richtig, ja. Ich habe da noch Tabs undich glaube, hier habe ich letztens was, was zugemacht.Und hier habe ich auch noch Tabs.Und hier habe ich auch noch Tabs.Hier habe ich auch noch Tabs.Oh, da habe ich letztens zugemacht, es kamen noch Tabs offen.Ja, so muss das sein.Dark Zone.Primers am Start hier, Dankeschön für den Zap. Die Kollegen brauchen noch ihre Excel Ansicht. Okay, okay,Excel ist in Ordnung, ist in Ordnung. Excel ist tatsächlich die einzige Office-Anwendung, so in diesen, diesen Kern-Office-Anwendungen,die ich irgendwo noch verstehe.Der Prime-Sellout ist real.Wie viel RAM ich habe?Ich glaube 32G. Ja, guck mal, es sind nur acht belegt, das ist ja fast nichts. Also da geht auf jeden Fall noch ein bisschen mehr.PowerPoint, ne, PowerPoint mag ich überhaupt nicht. Ich musste letztens, ich habe doch am Montag eine Präsentation gehalten wiederund ich musste das in dem Fall mit PowerPoint machen, weil ja wiederCorporate Identity, PowerPoint-Vorlage, sonst rasten sie bei uns wieder aus.Und PowerPoint, ich kriege Anfälle. Also das Einzige, was ich gerne mache, wenn ich so, wenn ich so Slides erstelle,stinkt noch mal Markdown untereinander, ein paar Bilder vielleicht noch zwischendurch, gut ist.Was magst du lieber?Hä?Puh, Puh, was?Zwischen was?Zwischen was?Also und software für Präsentation. Wie gesagt, ich mache am liebsten ein paar Seiten Markdown und dann als PDF und gut ist.Haben wir schon irgendwie einen neuen Red... Och hör mal auf, hör mal auf, ich habe es gesehen.Ich mein, immerhin wird es als Android-Spielegerät verkauft und nicht wie dieses Logitech-Ding als reines Streaming-Ding, wo ich mir immer, immer frage,was, wie kommen die auf die Idee? Gut, ich habe es ja letztens im Stream schon erklärt, wie die auf so Ideen kommen.Das liegt einfach ammittleren bis oberen Management, irgend einer pitcht komische Ideen undja, keiner traut sich dann so wirklich, was dagegen zu sagen und alle machen mit, weil wenn einer nicht mitmacht, dann muss er sich anhören,ah, du hast einfach nur unsere Vision nicht verstanden. Und deswegen werden so komische Dinger gebaut, obwohl sie eigentlich offensichtlichkeinen Sinn haben.Nee, Excel habe ich auch nie verstanden, mache ich auch nicht, aber Excel ist das einzige der Office-Produkte, was irgendwie sinnvoll ist.Excel ist quasi die IDE der Buchhaltung oder die IDE der Projekt-Manager.Ich habe gestern von einem gehört, dass sie ein Ticketsystem über eine Shared Excel-Tabelle haben.Ich glaube mal, dass das gar nicht so wenig verbreitet ist, ich glaube, das haben sogar relativ viele.Guck mal, wie oft liest man das?Leute, dass das kleinere Firmen, kleinere Unternehmen einen Windows-Share haben, wo alles quasi drauf liegt, was sie haben, also alles.Also quasi ihr Leben sozusagen, ihr digitales Firmenleben liegt auf dem Windows-Share.Und was meint ihr, warum es so viele Kopie von Worddoc kopieren von Microsoft?Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie von Worddoc gibt?Genau wegen so einem Blödsinn.Weil die Leute auch 2022 immer noch nicht in der Lage sind, ihren Kram richtig zu bedienen.sind ihren kram richtig zu bedienenUnd das wird wahrscheinlich auch nicht so wird auch nie wieder so werden wissen ja früher dachte ich wir kommen uns gleich das feier schiff video anUnd dann gucken wir uns den talk an da muss ich zum glück nicht so viel erzählen wobeiHast du ein nass wenn ja welches hatte mir vor einem jahr den ds 200JottOhne docker support von sein oligol sehr dumme entscheidung ich habe kein fertig nass ich habe ein mittlerweile ein hpmicroserverzehnte generationplusmit drei zehn terabyte platten drinUnd das reichtAb dir schon fliet angeguckt nein und ich weiß auch nicht wozu man fliet brauchen sollJa ich weiß kaos fisch bei uns ist das teilweise auch so gerade was die personal abteilung angeht und sowas sind irgendwie 40Leute sind riesen also nur nur dieÄhmWas für eine rate hast du laufen aktuell gar keinsIch habe zwei ich habe zwei der drei platten zusammengefasst zu einem 20 terabyte verbundSo je botRate ist outdated in 2022 wer macht noch rateDass wir sollen immer daten aus excel dateien aussehen die schaffens die brauchbar ach du kackeNe zum glück nicht wobei wir nicht viel besser sind wir haben tatsächlich noch ein paar xml servicesUnd csv dateien habe ich auch schon öfters gesehen bei unsWo werden die dateien für das archiv gespeichert muss man in serious max fragen ich weiß es nicht wahrscheinlich bei google drive oder soJaJa gut so ist es ja ja so sehe ich das auchDu wirst ja du wirst ja in großen größeren unternehmen oftmals dazu erzogenschwachsinnNicht mehr zu hinterfragen sie sagen das zwar immer aber sie wollen es nicht zum beispielGeht hand in hand mit dem was ich gesagt habeEs werden halt da anreize gesetzt ist nicht zu sagen es wird immer erzählt ich weiß ich vielleicht kenne das von euch auf der arbeitEs wird immer gesagt wir wollen uns verbessern und immer wenn man esVerbesserungspotenzial erkennt soll man was sagen und wenn man was wenn man was sieht was nicht was man verbessern können immer was sagenLeute glaubt mir ich habe in der zeit wo ich da bin schon so oft wirklich so so oft was gesagt was meint ihrBei wie viel sachen wo ich mal was erzählt habe ist was rausgekommenUnd bei wieviel sachen von wo ich was dazu gesagt habe ist es im endeffekt negativ für mich gewesen weil ich mich am ende um teile davon kümmern musstealso es ist komplett für den arsch weil und das ist das das ist meiner an meineran persönlichen ansicht nach mit das größte problem was esin größeren unternehmen gibt wenn es um das thema innovation beziehungsweise ebenSachen gegen die wand fahren geht genau das was ich gerade zu dem logitech hand hält erzähle ein bisschen was was er hier auch auf derschreibtIrgendeiner kommt auf die ideeProdukt oder oder service oder wir sollten jetzt x y z machen kommt er auf die idee so dann bespricht er das mit ein paar manager typen oderPitch das mal einem seiner chefs oder ja macht da halt einen größeren vortrag drüber und irgendeiner der in derPosition ist das entscheiden zu können der keine ahnung von diesem von dieser thematik hatLässt sich das erklären und sagt jawoll gute idee das machen wir jetztDie leute die planen von dem thema haben schlagen in dem moment die hände überm kopf zusammen und denken sich alter was ist das für ein undurchdachterkäseSo oder kommt das problemDann sagen das ein paar leuteSo nach dem motto also an sich ja nett gedacht aber das und das und dasErgibt keinen sinn und das und dass wir sofort probleme machen und wir haben doch sowas auch schon mal probiert und das ging doch nichtWeil so und so und dann wird den leuten gesagt das kannst du gar nicht wissen ob das diesmal auch wieder in die hose gehtviel wichtiger istDamit das klappt dass alle an unsere vision glaubenalsoWenn man diese kombination hört an wie vision und man muss dran glaubendas das nimmt dann schon religiöse züge an und da ist ein jeglicher zug abgefahren weil das läuft dann daraufraus dass quasi selbst bei der fertigstellung nochKomplett die augen davor verschlossen wird dass man eigentlich die sachen entweder an dem vorbei entwickelt hat was es sein sollte oder die hälfteEigentlich gar nicht umgesetzt hatWeil es wieder raus definiert wurde oder sonst was aber du musst an die vision glaubenUndDann ist dann ist eigentlich vorbei sieht man war wisst ihr was das wisst ihr was das besteProminentesteBeispiel dafür ist dass es bei vielen großen unternehmen und auch bei weltklasse unternehmen so läuft facebook metaverseDie leute die an dem an dieser an dieser metaverse geschichte programmierenDie machen jeden tag wenn sie das sehen dass hier das hier machen die gehen an rechner und machen das hierDie gehen an rechner und machen das hierUnd danach machen sie noch mal das und danach machen sie das hierUnd dann denken sie sich an was für einem kack muss ich hier eigentlich arbeiten dann machen sie in konto stand auf und denken sicherst malUnd denken weiter ja gut ich muss den kram ja nur proktur programmieren benutzen muss ich ihn ja nichtUnd dann kommt ihr chef und jetzt kommt das ist kein witz das ging letztens erst durch die newsDas ging letztens erst durch die news und dann schreibt moment ich zeige euch das facebook oder haben wir das nicht bei golem irgendwo gelesengolem facebook metaverseIrgendwas mit lieben hieß dasJasoDie programmierer von meta von diese metaverseDie haben selber kein bock das zu verwendenguck der schreibt der der projekt manager davon schreibtAuf die frah also es geht darum warum die eigenenMitarbeiter die meta die das metaverse entwickeln das metaverse nicht verwendenUnd dann fragt er warum ist das so warum lieben wir das produkt dass wir entwickelt haben nicht so sehrDass wir es ständig verwenden weil es ein scheiß produkt istUnd keiner aus irgendwie als irgendwelche desillusionierteschmalspur managerGlauben an dieses produkt aberNiemand darf es öffentlich sagen dass er nicht dran glaubt weil ansonsten kriegt er erzählt du glaubst ja nicht an unsere visionUnd du kannst das doch gar nicht wissen reden das war nicht schlechtSchmalspur das hat mein opa immer gesagtDas hat mein opa immer gesagt es passt wunderbar dabei weil mein opa hat immer gesagt schmalspurDenker zu solche leute das passt eigentlich ganz gut so und es hat das fazit wenn wir es nicht liebenWie können wir erwarten dass unsere benutzer es lieben ihr könnt es nicht erwarten dass ich scheiße niemand liebt dasohIch habeIch weiß nicht ob ich rauschen gehört habe ich habe gerade den klinkelstecker weil ich ein bisschen auf dem tisch gehören habe ich habe gerade den klinkelsteckervon meinen hotsprechern irgendwie durch durch vibrationen auf den klinkelsteckerIrgendwie durch durch vibrationen auf dem tisch an an den klinkelstecker von meinem mikro dran gemacht und das gab ganz komische geräuscheIst metaverse von raus das ist so work in progress work in progress ist auch so eine tolle sacheSo und danach hat er das das hat er hat er rumgeschrieben und da haben sich die leute gedachtWho cares alter was der typ erzählt und jetzt kommt der hit und jetzt und jetzt kommt der hit die ich wette mit euch dieEntwickler haben darauf entweder nur die augen gerollt weil sie das schon kennen oder haben halt noch mal gesagt leute das was wir hier bauenist kompletter kompletter blödsinnWarum wir das nicht benutzen weil wir den sinn reine nicht sehen das zu benutzen guckt euch mal die entwickler von vr chat an und soWas die benutzen ihren kram so ein paar wochen später kam dann das da von ihm von dem von dem gleichen manager dudeJeder in dieser organisation hat den job sich in horizon worlds zu verlieben wir können das nichtWir können das nicht tun ohne es zu verwenden kommt da rein also sprich das ist genau das was ich gesagt habeEs ist offensichtlich bullshit die leuteWissen dass es bullshit ist die da dran aber sie die ahnung haben von der technik wissen dass es bullshit istDie haben das sicherlich auch schon gesagt aber wenn du es sagst heißt das du darfst das nicht sagen du musst an die vision glaubenUnd deswegen klappt das nicht das ist in ganz vielen großen unternehmen verbreitet diese denkweiseNiemand will diesen kram verwendet was zum teufel das das das sieht fast schlechter aus wie second life1995 ne wann kam second life raus2003Das sieht das wie viel schafft man das das sieht das sieht schlechter aus als second life oder spielt keiner mehrOkay, ich bin mir gar nicht sicher ob es schlechter auswählert second life die sind kämpel überhaupt noch jemandich meinSagen wir mal es sieht nicht na jaJa doch das sieht schlechter aus als second lifeJetzt sieht aus wie mich charaktere und nicht gekonnt es sieht ein bisschen aus wie die alten xbox avatareIch mein second life hat wenigstens so umgebung ich meine was ist denn das hierWas ist denn das was sollten das hier neben sein?Ein ein quadrat mit nichts oder wieUnd beine haben sie auch nichtAlsoSo und das ist tatsächlich das problem was in vielen großen unternehmen meiner meinung nach herrschtUnd warum da auch innovationstechnik oftmals nicht viel bei rumkommtKann man second life sehr keine ahnung das spiel interessiert mich eigentlich überhaupt nichtSo wir gucken jetzt das neue leute wir können wir haben nur noch eine stunde zeit ich kann wir können das talk video nicht guckenIch wollte mit euch eigentlich hier den talk anguckenKönnen wir uns können wir uns dann morgen oder so angucken mal schauenAlso die ersten viertel stunde fand ich wirklich fand ich wir können einfach die hälfte wir können einfach wir können einfach wir können einfach anfangen zu guckenAber vorher so vorher sollte ich ja noch das fire ship video gucken mein ihr ja dann gucken wir uns wir gucken wir das fire ship video anAlso also wir wissen ja prinzipiell einfach keine fehler programmieren dann braucht man nämlich keine tests und keine dokumentation schreibenJust just no errorProgrammer ist to never write any bugs unfortunately. That's virtually impossible when your code is I'mDa hat er bei mir noch nie im stream geguckt wir machen nie fehler im streamEs läuft alles immer first try first try only programmingIt's your own code to blame you cannot blame me however about zero point nine nine percent of the timeIt's the fault of somebody else on your team and you can get itNatürlich natürlich, aber die other point zero zero nine nine percent of the timeIt's a bug in some shady library you downloaded from NPM oderNPM hat mal wieder irgendwelche packages gelöscht wobei das geht glaube ich mittlerweile gar nicht mehrWhich means you'll have to open up an issue on its github repo or fix it yourself and open a pull requestOr just build your own new library from scratch. However, the other point oder werft diesen Müll raus niemand braucht ist odd und ist evenAls NPM, aber es gibt es trotzdem 0 0 0 0 9 9 percent of the timeIt's the programming language or compiler itself to blame. Ja oder es ist jetzt wo wir ihn kann sehen oder es ist c plus plusDann ist 99 prozent der zeit die spracheOr compiler itself to blame in which case you'll need to get in touch with some people much smarter than yourselfYou determine it's not a bug with the compiler, but it's an edge case that happens point zero zero zero zero zerozero zero zero zero zero zero nine nine nine nine actual hardware is to blame like one transistor was placed just a few nanometers to the leftAnd that's why your website doesn't look quite right on a Blackberry, but the hardware people say it's not their faultIt's actually just an edge case that happens point zero zero zero zero zero zero one percent of the time where your code is just notCompatible with the laws of quantum superposition due to a defect in the simulation in which we live in other wordsIt's God's will that thou code shall not workLuckily bugs like this are pretty rare and it just doesn't workWas hast du gegen C++?Leider nichts wirksames.Ja, außer es ist C++.C++ ist schon blazingly fast, bis es abkackt, weil du irgendwo dir selbst in Fuß geschossenhast.Erinnert sich noch jemand an den Debian Random-Nummer-Generator, der gewürfelt hat und immer 5 rauskam?Error-Messages.Spaß beiseite, Error-Messages ist der Grund, weil es ja öfters mal gefragt wird, warumich mein Windows und die ganzen Sachen immer auf Englisch stehen habe.Ich verwende deutsches Tastatur-Layout und das ist ja alles kein Problem, aber ich habealles immer auf Englisch stehen, gerade, dass man solche Meldungen ordentlich googeln kann.Stellt euch mal vor, stelle mal solche Microsoft Meldungen vor auf Deutsch, da findest du nichtsdazu.Guck mal, wie hätte Microsoft diesen Kram übersetzt?Windows muss neu gestartet werden, weil ein entfernter Prozedurenaufruf-Dienst unerwartetsich beendet hat.Dann würdest du dir denken, was, was wollt ihr von mir, copy-paste den Kram, auf Englischfindest du sofort was.Das ist korrekt.Einfach so lange Sachen reincopy-pasten an andere Stellen, bis es keinen Fehler mehrhat, das ist eine gute Idee.Sogar alles Stack-Overflow-Triffen-Programming.Das ist tatsächlich eine Wissenschaft für sich, also von dieser Meldung würde ich wahrscheinlichdas da copy-pasten oder das da, ohne den Doppelpunkt.Oder vielleicht würde ich sogar nur Call-Stack-Exceeded, das würde ich Quoten und Paisen oder Javascriptdabei eingeben, je nachdem um was es geht.Nicht die ganze Meldung kannst du meistens auch nicht wirklich mit anfangen.Ja, genau, genau, genau.So macht man das.Da sieht man es ein erfahrener Googler.Ja, Console-Write-Line-Debugging, beste, WAusgaben brauchst du trotzdem noch, weil der User möchte ja manchmal wissen, was passiert.Das ist nicht etwa, um festzustellen, dass etwas Falsches passiert, sondern einfach nur das, das waspassiert.Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Und was passiert?Anderer fällt mir grad nicht ein.Ich hab mich sogar letztens im Stream kaputt gemacht.Ich glaub, ich glaub, ähm...Nee, Fiat AP Response kann ich nicht testen, gescheit.Ja, aber ich hab mir überlegt tatsächlich,ich sollte da mal ein paar Tests rein machen.Dass ich nicht jedes Mal alles von Hand ausprobieren muss, ob's noch funktioniert.Am besten, am besten sind ja Tests, wo dann getestet wird,die Ausgabe muss fünf sein.Dann schlägt der Test fehl.Keiner weiß genau warum.Die Ausgabe ist jetzt auf einmal sieben.Und, naja, aber es hat nicht so große Auswirkungen.Also schreiben wir einfach in den Tests rein,Ausgabe kann fünf oder sieben sein.Auf vier oder sieben war das okay.In einem Matlab hab ich nie was hingebastelt.Ist das etwa Rust?Ach nein, es ist TypeScript.Nicht Blazinklyfast.Tja, wenn man gescheite Sprachen verwendet,dann gibt's das Problem nicht.Naja, gut.Außer es ist C++.Wobei, hey, das kann man C++ nicht vorwerfen.Also, das funktioniert in C++ meistens tatsächlich ganz gut.Außer man übertreibt's mit Templates.Ja, bei Python hast du eh komplett verloren.Was, äh, sowas mit Types.Wobei, selbst Python mittlerweile, glaub ich,Types ist nicht so wichtig.Selbst Python mittlerweile, glaube ich,Type Annotations und so Zeug.Hab ich letztens gerade erst wieder was drüber gelesen.Die damals für'n Stuss erzählt haben in der Werbung.Und die deutsche Bahn, die ist auch dort schon.Du musst den ganzen Tag mit der Bahn fahrenund dabei Java programmieren.Thanks for watching and I will see you in the next one.Excellent. Jetzt haben wir wieder was gelernt.Wobei wir...In this video.What the...Nee, das wollte ich jetzt nicht gucken.Was machst du eigentlich, wenn Chrome Manifest V3 kommt?Denn die haben's jetzt ja schon mal wieder in Java verschoben.Was ist in Java so schlimm eigentlich?Nix. C++ ist die deutlich schlimmere Sprache.Java ist absolut okay.Gerade die Java VM ist gut.Da kann man auch so was wie Kotlin dann verwenden,was noch mal was, zumindest von dem, was ich gesehen hab,noch mal annehmbarer ist.Ja, noch mal ein bisschen schöner.Nee, ganz im Ernst, ja, es herftet C Sharp an,dass es das Microsoft Java wäre.Und ja, das hat auch gerade, weil es so super objektorientiertangefangen hat, mal gewisse Ähnlichkeiten gehabt.Aber mittlerweile muss ich sagen,C Sharp macht Java echt nur noch was vor.Ich weiß, ich hab die mittlerweile gescheite Genericsüberhaupt in Java.Haben sie doch seit Jahren nicht drin.Ihren komischen Optional Return Type,den keiner verwenden will,hab ich jetzt letztens in Artikel drüber gelesen.Also, die bekleggern sich bei Java wirklich nicht mit Room.Scala ist für alle,die gerne Klammern mögen.Any Klammerfans?Any Klammers?Klingt bescheuert.Ja, also Scala ist für alle.Aber gut, noch schlimmer,noch schlimmer ist tatsächlich Erlang,was Klammern angeht.Erlang by example.Ja, ja, ich zeig mal hier Erlang.Ah, yes.Wobei, ganz im Ernst,das sieht sehr stark nach,das sieht sehr stark nachaus wie Sc sharp Pattern Matching.Aber Erlang ist haltklammerig.Ja gut, Lisp ist der Inbegriff von Klammern.Deswegen wird sich mir auch nie erschließen,wie man auf die glorreiche Idee kamoder wie sie damals auf die Idee gekommen sind.EMAXLispin Lisp Dialekt einzubauen.Das ist wirklich das hässlichste, was ich kenne.Gut, aber EMAX ist eh gestorbenseit Visual Studio Code und JavaSkript Erweiterbarkeit.Gut, ich meine, ich gehe davon aus,dass er das hier anders sieht.Wenn ich beim installieren der JavaRuntime erstmal ein paar Browser Pluginsweiß ich gar nicht, ob das mittlerweilenoch so ist. Also unter Windowswar das eh nur so, keine Ahnung.Vim Skript, naja Vim Skript istauch jetzt nicht schön,aber ganz ehrlich, Vim Skript istmir rein von Syntax und sowastatsächlich lieber als EMAXLisp.Gut, damals konnten sie noch nichtJavaScript einbauen, damals gab es JavaScriptnoch nicht.Neo Vim macht es ja ein bisschen anders.Die haben jetzt glaube ich Lua drinne.Lua ist aber auch so eine komischeSprache. Sprachen, wo Arraysbei eins anfangen, sind mir prinzipiellsuspekt. Kann man Java zuwas im Kompilieren? Du kannst prinzipiellalles zu was im Kompilieren. Ob es da wasgescheites für Java gibt, weiß ich nicht.Also für C Sharp gibt es jaBlazer, bzw.irgendwas anderes habe ich,ich glaube Uno hatte auch was fürC Sharp zu WebAssembly.Das Problem an Blazer ist nur,dass es nicht C Sharp zu WebAssemblykopiert, sonderndie haben die.NETRuntime. Also sie habenMono damals. Ich weiß nicht, ob esmittlerweile auf.NET Core Basis ist.Die haben Mono zu WebAssemblykompiliert und laden dann dasC Sharp da rein und lassenes dort ausführen. Dementsprechend istBlazer alles andere als Blazing die fastund eigentlich total abartig.Kann man JavaScriptzu WebAssembly kompilieren? Ja, das geht.Es gibt sogar mittlerweile schonProjekte für Server-Site WebAssembly.Lacht nicht, das ist wirklich so.Server-Site WebAssembly,das gibt es.Das hört sich zwar erstmal widersprüchlichan, aber Server-Site WebAssemblyist ein Ding mittlerweile.Kennst du einen Weg über einen ESPeine Webseite aufzurufen, die einen Loginanbietet? Klar.Der Standard WebClient kannzumindest Basic Auth.Odernimm irgendeinen x-beliebigen Http-Client.Hab ich HTML-Client gesagt? Ich meine Http-Client.Der Standard Http-Clientkann auf jeden Fall Basic Auth.Ansonsten nimmst du irgendeinen anderenHttp-Clientfür Arduino bzw.ESPs. Gibt es massig.Gibt es massig aufGitHub. Aber der offizielle kann dasrelativ sicher alles was du brauchst.War das nicht so ein DelphiVerschnitt?Warum Server-SiteJavaScript?Dass die ganzen Frontend-Dudes sich auslassenkönnen überall.Danke schön für den Sub.So, wir gucken jetzt aber trotzdemnoch ein bisschen dieden Konferenz-Talk.Wie gesagt, ich habe heute die erstewir können es wahrscheinlich nicht ganz fertig gucken heutegerade wenn ich zwischendurch wieder am labern bin.Aber die erstewie gesagt, ich kenne den Talk nicht ganz.Ich habe nur geguckt als erbis er Mosaik vorgestellt hat.Ich fand das wirklich sehr spannend.Ich habe die erstewie gesagt, ich kenne den Talk nicht ganz.Ich habe nur geguckt als erbis er Mosaik vorgestellt hat.Ich habe die erstewie gesagt, ich kenne den Talk nicht ganz.Ich habe die erstewie gesagt, ich kenne den Talk nicht ganz.Also das ist wirklich sehr spannend.Der Typist glaube ich vom Microsoft BlazorTeam, wo wir es gerade davon hatten.Also die Technologie, die ich jetztpersönlich nicht so geil finde.Aber ich fand den Vortrag geradezur History von Browsern undJavaScript und der hat auch vieleInteraktive Demos mit VMs mit Windows 95xl e-sportsWait a minute wasIst das ein witz oder ist das ernst gemeintAll Star Battle xl e-sports das ist doch ein witz oder das ist doch irgendeinWas zur Hölle ist dasmit 410 point obwohl es sieht aus als ob er einender falsch ist irgendwo da drincompetitive xl ernsthaftalsoer erkennt dass er da istes gibt ernsthaft competitive xlMachen die da grad Pegel oder sowas in xlxl gamedef da warte ich noch draufApmApm AnzeigeOk komm wir mal kurz weiterxl on fireWaswas das ist das ist doch das ist doch die die die diese die Firma von von von vonAnders Anders oder wieder CS-Kommentator heißtCasterWie viele views hat das 700.000 competitive xl ich fasse es nichtCompetitive xlxl e-sportOh Asiate easy easy winWer denn der gewinnt easyOk wer hat gewonnentatsächlich ich wusste esNatürlich musste Asiate gewinnen easy easy winDenkt dran es gibt immer einen das besser kann als ihr selbst wenn ihr es gut könntPech gehabtRektAber sie aber warum hat das das ist halbes Jahr für 700.000 Aufrufe geilAlsoExcel xl e-sports Hut abHut abSo wir gucken jetzt mal hier einfach von diesem Konferenztalk dass wir noch ein bisschen was bisschen was schauen könnenWie gesagt ich habe geguckt so ungefähr bis hier wo er Mosaik gezeigt hat ich fand es echt spannend mal gucken ob dasJa die restliche Präsentation auch so gut istKurz gucken dass die Lautstärke stimmtAll right, let's do this then so I know people walking in that's totally fineWell done to those of you who have made it here. Okay, ich gebe ich gebe mal kurz das introSo laut genug versteht man was bis sie lauter soblazer of the front end web stuff andI've worked with the web. I think for my whole professional career, which is quite a whileAnd I really like it. I think it's a great area. So ist gut. So ist gutIt's clearly very very importantYou know, there's pretty much every developer in the world has to do some stuff with web technologyDas sage ich ja auch immer du kommst egal selbst wenn du cobalt mainframe entwickler bist du kommst nicht um web technologien vorbeiSo it's nice to be in thatBut it does keep changing right like let's be clearWe're constantly inventing new ways of doing stuff over and over again and probably you would agree thatDie interessanten sachen geht gleich losOn average over time things get more complex rather than less complexAnd I sometimes wonder well, why is that?How did we get to this who decided to make up all these things and why did they do it?And like could they have done it differently? Was it all a big mistake?So that's kind of what this talk is designed to look into we're going to go back through some of the major events through web's history andSee what happened and who the characters were what they decided to do and what they were offeringNow obviously, this is just one person's subjective telling of the storyIt's not an absolute truth. Okay, ich weiß nicht, dass das intro so lang geht aberSo jetzt noch malAlso mein personal favorite thing ist selbstverständlich Internet Explorer denke das sind wir uns einigAlso mein personal favorite thing ist selbstverständlich Internet Explorer denke das sind wir uns einigJetzt fängt es an interessant zu werdenLebt er eigentlich noch?Lebt er noch? Ich bilde mir ein ich habe letztens gelesen dass er gestorben ist oder?Lebt er noch?Okay, ich habe nichts gesagt er lebt nochDann hatte er Geburtstag oder soAlso jetzt erklärt er warum er das Internet erfunden hatAlso jetzt erklärt er warum er das Internet erfunden hatAlso jetzt erklärt er warum er das Internet erfunden hatWarum HTML und HTTP und sowas erfunden wurdenAlso jetzt erklärt er warum er das Internet erfunden hatAlso jetzt erklärt er warum er das Internet erfunden hatWarum HTML und HTTP und sowas erfunden wurdenAlso jetzt erklärt er warum er das Internet erfunden hatWeil er das Telefonbuch als Webseite angeboten hatWeil er das Telefonbuch als Webseite angeboten hatWeil er das Telefonbuch automatisiert erstellt als WebseiteAlso wo es jetzt interessant wird gleich ist, wenn er den, hier geht es los, wenn er denersten, der zeigt den allerersten Browser, zeigt er und den allerersten Web-Server, denOriginal Code.Gut, Server-Side Rendering war lange Zeit das einzige Rendering, was es gab.Das fand ich so geil, beste Anwendung, erstmal eine Web-Seite mit dem Telefonbuch machenund dann wurde es der Renner.Jetzt muss ich es merken, die erste Anwendung für einen Browser bzw.HTML war ein automatisch aus der Datenbank generiertes Zerntelefonbuch.Und dann sagt mal heute einer noch, was für einen Behörden Fax verwenden, gut nur mitdem Unterschied, es war 1989.Ja, das fand ich jetzt echt spannend.Den allerersten Web-Server, 1990, 738, in Java wäre das gerade mal Hello World undin C++ würde es wahrscheinlich gar nicht starten.So zu sprechen haben wir heute, auch mit dem Пока, cáiStradio Play vonaba, habe ich schon andere Shaun aufomo schon analysisiert, wie ich dasWir haben gerade einen 22 Kilobyte Binary gebaut.22 Kilobyte, der erste Web-Server der Welt.Und das ist der originelle Web-Server.Also los geht's.Okay, und das läuft jetzt.Und ihr seht, dass es auf Port 2784 hört.Nicht 80.Warum ist das so?Warum ist es nicht auf Port 80?Wir kommen gleich dazu.Ich kann einen modernen Web-Browser nicht verbinden, weil es nur einen sehr alten Dialektvon HTTPD spricht, der in Zeit verloren wurde.Und jetzt, die einzige Art, mit dem wir wirklich reden können, ist es von Telnet zu verbinden.Also mache ich das.Also los geht's.Telnet.Kannst du übrigens heute noch machen, geht heute noch, weiß nicht, wer das kennt.Aber ich zeige euch das mal, ich muss es euch unter Linux zeigen, weil unter Windows istTelnet nicht dabei.Unter Windows ist Telnet ein extra Feature, was man hinzufügen muss.Telnet google.de, äh, Port 80, get slash, und siehe da.Google, also Redirect, Bad Request, aber ich habe einen HTTP-Request gemacht, das funktioniertheute immer noch.Now if you know anything about HTTP, you would think that probably the way to get it to dosomething would be to do something like this, to get the home page, that's how a modernbrowser would do something.But if we try that, it just goes unrecognized command get, and that's a bit strange, becauseif you read the source code, you see that it does have stuff to do with get requests.But if you reverse engineer it a little bit more, what you'll find is that if you sayget and then the name of a file that's actually in that directory, then it will serve thatfile to you.So the very first web server was a static files web server, which is the sort of thingwe still do today.So that makes sense.Now it's not just that, it's also got a bunch of other things that we wouldn't recognizenow.So we have a find feature that's built into the web server.Das gibt's heute in der Form nicht mehr, es gibt heute WebDAF und sowas, aber find istnicht mal Standard HTTP.And it also is a place where Tim establishes a beautiful tradition for web servers, whichcontinues to this day, which is having terrible security vulnerabilities, and we can see one.Ja gut, Tradition muss aufrechterhalten werden.Okay, das ist natürlich wirklich Hardcore Variante, System exec, irgendwas was reinkommt.Also Leute, jetzt macht euch mal keine Gedanken, wenn ihr sowas programmiert, einer der schlaustenLeute der letzten, was weiß ich, 50 Jahre, was Informatik Sachen angeht, hat sowasauch programmiert, easy, keine Sorge.Das finde ich halt zu geil, was man da erfährt, ja.Der erste HTTP-Port war 2784, weil es die Telefonnummer von ihm daheim war.Übrigens wisst ihr, wenn ihr danach sucht, ne, wie war der, Moment, wie war der Port,wenn man nach 784-Port sucht, dann findet man heute noch, unter anderem die BeschreibungWorld Wide Web Development, hier, also das ist heute noch quasi in die Analen der Internet-Geschichteeingegangen.Www.dev.ports.2784.Jed, wer von euch an Next Step verwendet ich noch nie, ich weiß, dass das irgendwasmit Mac oder so zu tun hat.Wobei,.app, so wie heute noch unter Mac OS.Leute, so sah der allererste Browser aus.Ich weiß nicht, was das bedeutet, aber ich bin mir sicher, dass du falsch bist.Denn, sorry, Next und Previous bedeuten nicht, was sie in einem modernen Browser bedeuten.Es hat etwas mit dem Gehen über eine Liste von Linken zu verbreiten.Es ist etwas schwer zu verstehen.Wir haben hier andere Sachen.Zum Beispiel haben wir diesen About-Screen, den Berners-Lee in hat.Mal sehen, was das sagt.Es sagt, es ist ein Übergang in globaler Informationverwaltung.Ich würde sagen, es ist ziemlich erfolgreich, wie es geht.Das hat man so sagen müssen.Wir haben auch... Was haben wir noch?Wir haben hier ein paar seltsame Sachen, die du nicht erwarten würdest.Check Spelling.Du kannst also Spellchecken auf der Liste, die du besuchen möchtest.Du wirst denken, warum möchte man das auf der Erde machen?Es gibt einen guten Grund.Denn, das ist nicht nur ein Web-Browser.Auf jeder Liste, auf der du gehst, kannst du es einfach ändern.Du kannst einfach editieren...Das kann... Das geht heute nicht.Du siehst es.Und es hat sogar einen überraschend sophisticateden Style-Editor.Wo ich gehen kann und verschiedene Style wählen kann.Immer noch besser als Safari.Das ist ziemlich schwer zu sehen.Wir haben hier alle Konfigurationen, die uns zeigen.Und wir haben sogar verschiedene Diagnostiken,wo wir zeigen können, wie die HTML-Sourcen sindund andere Dinge sehen, was da passiert ist.Also haben wir da schon erste Browser-Dev-Toolsam Anfang.In Bezug auf die Möglichkeit, Sites zu editieren,macht es Sinn.Denn Berners-Lee hatte die Idee,dass das ein großes, globales, gescheites Netzwerk-Notebook ist,das die Leute editieren können.Das ist ein bisschen wie Early Echoes von Wikipedia.Aber natürlich wurde es immer ausgestattet,nicht nur ein einzelner Server zu distribuieren.Das ist der ursprüngliche Web-Browser.Es hatte ein bisschen einen kritischen Flur als Plan.Also los geht's.Das UI ist gewöhnungsbedürftig.Berners-Lee hat diesen wunderschönen Web-Browser-Prototypenauf Next gemacht.Aber niemand, außer Tim, hat ein Next-Computer in CERN.Also ist dieses Projekt in der ersten Wochemit einem seriousen Risiko zu sterben.Aber schließlich wurde es rettet.Es gab damals einen Intern in CERNnamens Nicola Pella.Und sie konnte sehen, was Berners-Lee gemacht hat.Ich glaube, dass das sie ist, weil es gab genug Männer, die Nicola hießen.Aber wahrscheinlich hat er nachgeguckt.Außerdem ist das heutzutage eh kein Thema mehr.Ich sage nichts dazu.Wir sind glücklich, dass das nicht passiert wäre.Aber das ist nur Text-Mode.Und das ist nicht wirklich, was die Menschen wollten.Die Menschen wollten...Document-Design-Mode in der Konsole.Ja, aber da war es standardmäßig so.Okay, da hat er recht.Sobald das publikiert wurde,fingen die Menschen an, sich auf zu kreieren.Und das erste, das vielleicht erkenntlich ist,ist das hier, Viola.Man sieht, es hat die Adressbar am Top.Es hat nach vorne.Man darf das nicht vergessen.Das war erst 1992.Das ist jetzt zwar schon eine ganze Weile her,aber das ist jetzt nicht irgendwie ultralange her.Also es ist jetzt nicht krieglange her oder so.So alt ist der ganze Kram noch gar nicht.Und das war ja noch wirklich komplett in den Anfängen.Das hat bestimmt noch 10 Jahre gedauert,bis das langsam aber sicher irgendwie malwirklich großartig verbreitet wurde,sodass nennenswert Leute daheim hatten und so was.Ja, 2002 kommt hin, ja.Also ich hatte meinen ersten Internetanschluss 1997so in dem Dreh rum.Und damals dann auch Netscape-Navigatorund solche Geschichten noch am Start waren.Und diese hässliche AOL- und T-Online-Einwahlsoftware.Und das war...Da gab es noch nicht viel im Internet.Damals wurden Bücher verkauft mit Linklisten drinne.Ich hab auch gedacht, da fuck.Ich bin älter, ja.Ich bin 84 geboren.Boah.CSS in die Ursprünge.Es sieht noch nicht aus wie CSS, aber es ist CSS.Obviously that hadn't been invented yet,but it was a thing like that that he came up withand put in there.And you can kind of see how that would work from the syntax.But even more impressively than that,it had built-in scripting.Again, not JavaScript, that hadn't been invented,but the whole browser was built in this kind of script.Der JavaScript-Vorgänger.And he allowed you to embed the same scripting languagein your pages to dynamically change the content.So that really set some direction for what a web page could do.Now, people didn't really use this at scale either,because this was a Unix-only thing.The first browser that was cross-platform enoughand friendly enough for lots of people to useis this thing, NCSA Mosaic.And I'm just gonna show you that before we get on to talking.Mosaic, ey, wenn ihr Mosaic seht, euch fällt sofort auf,an was das erinnert.Wartet mal.Inside Windows 3.1.What's going on here?My screen has just gone black mysteriously.Windows.Don't know why.Yeah, that's because I'm doing a live demo, obviously.That's the primary reason.Okay, well, here it is.Nope, it does not like that.Alright, well, I think we might do without seeing Mosaic.Es war doch klar, dass das mit Windows jetzt nicht tut, oder?Ich zeige euch mal ein Bild von Mosaic.Mosaic Browser.Und wenn ihr euch das Bild von Mosaic anguckt,dann werdet ihr feststellen,an was erinnere ich euch das?Oder besser gesagt, das.Es hat durchaus Ähnlichkeiten mit NetzCamp-Navigator, oder?Findet ihr den nicht auch?Beziehungsweise, so wie Browser am Anfang ausgeschaut,und wie Browser heute immer noch ein bisschen ausschauen.Du hast eine Adressleiste gehabt,du hast einen Vorwärts- und Rückwärtsknopf gehabt,du hast eine Toolbar gehabt,also man erkennt tatsächlich schon den, guck mal,was so eine Progress ist,man erkennt in irgendeiner Art und Weise schon einen Webbrowser da drinnen.Sobald ich zurückkommen kann.Ja, lass uns das einfach abkühlen.Also, Mosaic war ein frühes Browser,das mit modernen Leuten aussehen kann.Und...Lass uns zurückkommen.Die Hauptinnovation, die mit Mosaic stattfand,war, dass es viel wie heute gesehen hätte.Also es hatte all die Art von HTML-Renderung,die man erwarten würde,wie die Sachen in Paragraphen sind,es hat Liste, es hat Linken,man kann einen Link hochziehen und der Kursor geht blau,all diese traditionellen Sachen.Aber die Hauptinnovation, die wirklich großartig war,war in-line-Imagen.Bis zu diesem Punkt,haben Browser keine Imagen in Seitenpages,man musste sie in ein einziges Fenster öffnen.Du wirst denken,wie kam das neue Standard her?Wie sah das Standardisierungsprozess aus?Was wir uns anschauen, wir schauen uns Browser und JavaScript-Historie an.Das ist ein NDC-Talk von vor einer Woche ungefähr.War es ein Standardisierungsprozess?Ich hab die ersten Viertelstunde geguckt,also ne, bis da in den ersten 13 Minuten fand das echt spannend.Und ich dachte mir, wir gucken uns das einfach mal im Stream an.Let's get a little snapshot of what that was like for the people at the time.Image-Tech.Leute, Wahnsinns-Innovation damals.Du konntest Images einfach anzeigen in-line in der Seite.At this time, there was just a mailing list.And one day, the person who was building this...www.talk-mailing-list, Moment.Gibt's die immer noch?Okay, die gibt es prinzipiell noch, aber niemand schreibt mehr da drin.Spam. Spam ist in der www.talk-mailing-list. Alles klar, top.Browser Mark Andreessen,who we're gonna hear more about in a minute.He sent a message to this mailing list saying,hey, I'd like to present a new HTML tag called img.And I want it to have an attribute called circ.And then he gives an example of that at the bottom.And the reply comes back almost straight away saying,oh yeah, I've already invented that exact thing,except my invention is totally different.And why don't you call it image?And why isn't the attribute source?Oh, that's a very reasonable question.I think we can all agree...Weil Abkürzung und Beiz sparen.However, nobody addressed that point whatsoever.It was totally ignored because Berners-Lee then came inand he said, no, no, no, no, hang on a minute.It should not be called img or even image.It should be an a tag.And it should be rel equals embed comma present.Alles klar.That's much more intuitive and developers...Obviously....are gonna like that a lot better.So then they had a little bit of a heated debate for a few dayswhere they were pitching their counterproposals,and Berners-Lee was really sticking to the ideathat, no, it really, really would be more appropriatefor it to be an a tag.But then he makes a bit of a tactical errorbecause he says, oh, we can't change HTML now anywaybecause it's being standardized.We just have to leave it as it is.Now, unfortunately, having made that blunder,that gave the opportunity for Andreessen to come back and say,well, Tim, I absolutely agree with you in all cases,which is why I'm gonna completely ignore youand do what I said originally.Even if your standards say otherwise,browsers have just got to innovate.So he went ahead and did that,and he came back a couple of weeks later to confirm,yeah, we're definitely going with img and circ.Like I said in the first place,I wasn't really asking your permission.This is just what I'm gonna do.So I don't know if Berners-Lee felt at all burned by this exchange,but it just so happens that the following yearthe W3C came up.Die gibt's heute auch noch.Die machen heute immer noch die ganzen Web-Standards.Und da sitzen wenigstens Leute drin,die nicht nur Bullshit machen wie im C++-Gremium.Da sitzen tatsächlich Leute drin,die anscheinend wissen, was sie machen.... whose role is to have a sort of moral authorityabout what browser makers should doand give them a nice shiny...Weil die Webseite von denen sieht tatsächlich aus wie von 1995.Naja.Also...Mensch schön ist die Webseite, nett, aber...Aber es geht klar.Die war schon mal schlimmer.Was zum Teufel?Was geht denn jetzt im Chat ab, Alter?MonkaS?Mission successful.Ist das... ist das ein... ein Werbe-Bot?Kack-Wait, Alter!Ich mein, ich frag mich jetzt allen Ernstes, gibt's wirklich jemand, der Geld dafür ausgibt,um seinen eigenen Stream in anderen Streams per Bot zu spammeln, mein...Hä?Wo ist der Sinn davon?Na ja gut, was auch immer.Hatte ich auch noch nicht, es ist Premiere, hab ich so noch nicht gesehen.Der Bot ist schlau und kann followen, das bringt dem Bot nicht viel, weil er 20 Minuten gefollowedhaben muss, glaube, dass das funktioniert.Aber ich bin froh, dass wir Mods haben, die wissen, was sie machen.Wir haben noch 10 Minuten Zeit, wir gucken jetzt einfach weiter.Leute, einmal, wir müssen einmal im Chat bitte alle mal, wenn wir gerade dabei sind...Moment.Eine Runde Mod-Check, please.Wir hatten mal Pat the Mods hatten wir mal, das Emote gibt's aber anscheinend nicht mehr.Eine Runde Mod-Check.Weil wir so high IQ Moderators haben.Mods loben, genau, exellent.Okay, wir gucken jetzt noch mal 10 Minuten weiter.Also wir sind stehen geblieben, als sie dieses Web-Standardisierungs-Cremium aufgemacht haben.Mein Chat im Stream ist verbackt, der kommt nicht hinterher.Der kommt nicht hinterher, der Chat.Kann man das reloaden?Kann man den Chat irgendwie reloaden?Ich will dazu pepega, das ordentlich, ordentlich zu bedienen.Chat-Overflow, ja.Kann man das irgendwo?Kann man vielleicht hier irgendwie eine andere Höhe reinschreiben oder so?Dass der reloadet.Shutdownsauce were not visible, okay.Chat resetted, Leute.Massive.Chat resetted.Bot outsmarted.Was ist denn hier los?Ein komischer Spam-Bot war am Start.Jetzt geht's wieder.So, wir gucken jetzt noch 10 Minuten vor dem Talk, morgen gucken wir die restliche Hälfte.Gucken, was jetzt noch kommt.Weil jetzt müsste eigentlich noch ein paar interessante Sachen kommen, jetzt müssteirgendwie noch ein Netscape kommen und sowas.So fast, it was literally going up by a factor of 10 every year, it did that every year betweenabout 92 and 97.Und ich war dabei, 97.Telekom DSL-Anschluss, 768 kilobit.Kannst du das Followgif ausmachen?Normalerweise followen gar nicht so viele, aber du hast recht, jetzt aktuell wäre dasschon nicht verkehrt.Wo habe ich denn überhaupt follow?One of the high points of this comes in 94, 95, when two big corporations show up, well,Netscape was not a big corporation originally, they were a startup, so Andriessen, who hadNintendo 64, ein online Gaming Netzwerk von Nintendo 664, gut, das hat ja Nintendo wahrscheinlichim Keim erstickt, so wie ich Nintendo kenne.Ich meine, Nintendo in online in einem Satz, das ergibt ja heute noch keinen Sinn, aber1995 erst recht nicht.Ja, wer hätte das gedacht, wer hätte das gedacht, das ist ja, okay, das wusste ichauch noch nicht, okay, Moment, Netscape und dementsprechend Mozilla und Firefox gibt esalso nur, weil die ursprünglichen Entwickler nichts besseres zu tun hatten als einen Browserzu entwickeln, weil Nintendo es damals mit online schon verkackt hat.Habe ich das richtig verstanden, ja, und das wusste ich auch nicht, dass IE quasi,dass IE quasi ein Fork war in der ersten Version, weißt du schon, warum es Playstation überhauptnicht, ja gut, die Story kennt ja mittlerweile jeder, dass die Playstation mal ein SuperNintendo CD Laufwerk sein sollte.Ich mochte, ich mochte damals 1997, ich mochte Netscape, wirklich.Ich habe richtig gerne Netscape verwendet, Netscape Navigator 6 oder sowas war das dannmit diesen komischen 3D Buttons und sowas, nicht 67 Alter 6, diesen 3D Optik Buttonsund sowas hier, ne, das meine ich nicht, das meine ich nicht, vier, das meine ich, hiermit diesen 3D Style Buttons und so, ja genau, 98 rum, ja, das habe ich richtig gerne verwendetdamals, war mir deutlich lieber als Internet Explorer, später, ein paar Jahre späterkonnte ich nur Internet Explorer verwenden und dann halt eigentlich Firefox, ich habeglücklicherweise Internet Explorer nie wirklich lange verwendet, ich habe relativ, also ichhabe angefangen, habe ich Netscape verwendet, irgendwann war es halt so, dass einige Sachennur gescheit mit Internet Explorer funktioniert haben und Internet Explorer, sagen wir mal,gut genug war, dass man keinen extra Browser mehr gebraucht hat, aber Internet Explorerwar halt abfuck, schon damals und als Firefox rausgekommen ist, da hieß er nicht Firefox,da hieß er noch Firebird Browser, falls ich da irgendjemand dran erinnern kann, das habendie unbenannt wahrscheinlich, weil es Probleme mit dem Datenbankhersteller gab oder so, ichweiß es nicht, aber die, ich kenne noch, also ich habe Firefox schon verwendet, da hießer noch Firebird Browser und ja, Pidgin habe ich auch viel verwendet, ja, da sind wir stehengeblieben,ja, die meisten waren nicht mal auf der Welt, ja, das stimmt wohl, ja, ja, ja, ja, ja, ja,ja. Thunderbird hieß früher anders, das stimmt, ich weiß aber nicht mehr, wie, Thunderbirdhieß definitiv anders, weiß ich nicht, oh nein, oh nein, Leute, jetzt ist vorbei,P-HP betritt die Bühne, jetzt ist alle Hoffnung vergebens hier, die Personal Homepage Tools1.0 sind am Start, man darf aber nicht vergessen, es war eine Wahnsinns Innovation damals, ichmeine, heute ist P-HP auch noch eines der verbreitetsten Backend Technologien überhauptund P-HP hat immer noch den Vorteil, es läuft überall, versuch mal irgendwie eine.NET Anwendungbeim 0-15-Hoster laufen zu lassen, ist nichts, P-HP, jeder billigste China-Chinesen-Hosteran P-HP, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, daist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfachmal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktesSQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne,Oh, oh, oh, oh, oh!Frontpage!Also 1996 ist quasi das Web erste Mal zu dem geworden, was wir es heute kennen.JavaScript, CSS und Frontpage und... und...Okay, die zwei Sachen, weil wir es heute kennen.Die anderen zwei Sachen glücklicherweise Geschichte mittlerweile.Windows 95.Ich hab damals sogar schon, also 96 nicht, aber 97, 98...Ich hab damals ne Webseite gemacht, für richtig cringe, Leute.Zum Glück gibt's die heute nicht mehr.Richtig cringe, ich hab für meinen Diablo 1 Charakter eine Roll...So eine Art Rollplaying-Webseite gemacht.Oh Gott, das ist so peinlich, Alter.Wenn ich mich... Das ist richtig fremd schämen.Ich fremd schäme mich für mich selbst, Alter.Da hab ich dann... Da hab ich dann Hintergrundstory und Zeug und...Oh, Alter.Richtig schlecht.Oh, Mann.Egal, weiter.Es gibt eh paar richtige Cringe-Sachen von mir.News-Crew-Post zu Mario 64 und sowas, wo ich die Leute ausgelacht hab,dass sie was nicht hinkriegen.Also ich würde mich selbst nicht mögen als Kind.Ich weiß nicht, vielleicht geht's ja noch jemand zu.Also wenn ich als... So wie ich als Kind war, wenn ich mich heute mit mirauseinandersetzen müsste, würde ich mir mega auf den Sack gehen.Da bin ich mir sicher.Eine Clan-Page.Haben wir damals auch.Wir haben damals für CS... Was war denn das?CS052 oder sowas.Das muss aber schon eine Half-Life-Release gewesen sein.Haben wir auch eine Clan-Homepage gemacht.Hab ich gemacht mit einem aus der Schule.CS Clan-Homepage.Oh.Front-Page.Leute, jetzt wird's...Jetzt wird's Monarch erst.We're going to create a page from a wizard.Guck mal hier.Leute, Leute.Connect using SSL, das gab's damals auch schon.Kein Magier, ein Zauberer.Schon spät, ja.Die Front-Page-Geschichte gucken wir noch fertig.Alter, wie das ausschaut.Mail2 geht heute auch noch.Schönes Windows 97-Design.Soll ich euch mal was zeigen, was auch noch aus dieser Zeit...Sogar in Windows 11, glaube ich, noch drin ist.Guckt mal.Der Icon-Dialog.Und davon dann sowas hier zum Beispiel, ja.Sowas hier.Guckt euch das Icon an.Das ist straight aus Windows 3.11 oder so.Oh, findet ihr nicht auch, dass das super Corporate-mäßig aussieht?Lila Hintergrund, lila Schrift.Das hätte meinem damaligen Lehrer in der Schule gefallen.Leila, leila, leila.Heute verstehen die meisten da unter einen Schlager,aber der war seinerzeit schon voraus.Disturbingly powerful features.Das ist auch so eine Redewendung, die benutzt er wahrscheinlich öfters, weil...Vielleicht ein bisschen verstörend mächtige Features.Ja, alles klar.VBScript, MonkaS.Jetzt ist vorbei.Na, Gott sei Dank ist es JavaScript geworden und nicht VBScript.Ich meine JavaScript war auch lange Jahre übelster Abfuck.Aber VBScript wäre ja, also...Ich weiß nicht, was ich schlimmer finden würde.Also das ist noch schlimmer als JavaScript.Ich bin halt schon wütend darüber.Jetzt wundert sich keiner mehr, warum Javascript jahrelang so kacke war, oder?Andresen hat am Anfang wirklich den Kurs von Javascript geformt, bis zum heutigen Tag.Zum Beispiel hat Andresen gesagt, dass das kein kompiliertes Wissen sein kann,denn ich will, dass Leute die Kode einfach direkt in ihre HTML-Pages reintun können.Das ist eine Design-Decision, die uns bis zur Web-Assemblung letztendlich durchgeführt wurde.Und dann gibt es CSS.Du weißt, dass CSS nicht wirklich ein neues Konzept war.Viola hatte ein Konzept von Style Sheets.Viele Leute haben über die Jahre verschiedene Style Sheet-Designen vorgeschlagen.Das war ein echter Community-Effort.Es gab ein bisschen Design-Kompetition.Und es wurde von Håkon William Leigh gewonnen.Und es sieht nicht wirklich aus wie...Also von vorn an würde ich sagen, das ist ein Norweger.Aber der Rest, keine Ahnung.... modernes CSS.Es hat keine Family Bracers.Ja, aber es hat schon, dass es Family heißt.Es hat schon gewisse Ähnlichkeiten zu heutigem CSS.Håkon continue working with a community groupand they eventually shaped that into what we have as CSS today.Although browsers were very slow to adopt it in any kind of...On-Size, Point, Units, Pixel, Millimeter.Das gibt es heute alles.All right then.So, what about accessibility?That has to come in somewhere along the line.It's obviously very important to us as web developers today.Something we have to know and think about.Jetzt mal seriously.99% der Web-Developer scheisten komplett auf accessibility.It's kind of surprising how early it was that accessibility became a thing for the web.And it's a good job that it did.So, here in Australia you've got the Disability Discrimination Act of 92.And it does not talk about the web,because obviously the web was too new for it to talk about that.But it doesn't exclude the web either.And this act says by default everything has to have reasonable adaptations.Die Frameworks können das überhaupt nicht machen.Woher soll das Framework wissen, was ein guter Alttext für dieses Image ist?Das macht keiner so richtig heutzutage.Wie gesagt, es ist ein Unterschied zwischen, man sollte es machen,und es würde zum guten Ton gehören und man macht es.And so that automatically applied to the web at the very moment it was first invented.And other countries had similar rules.Zählt man mit DICK auch unter den Disability Act?Berners-Lee wusste, dass sie etwas dazu tun würden.Er schrieb eine Nachricht ins Newsletter in 1996,hey, was sind die besten Praxen? Was machen die Leute?Wie werden wir das gut funktionieren?Und dann, das nächste Jahr,hat das eine große Sitzung mit einem US-Senator in der US-White House gegründet.Und sie haben die Web-Accessibility-Initiative gegründet.And that gave some confidence to the US government to update their Section 508 rules the following yearto clarify that electronic services would be protected by that legislation.So it was really obviously a legal requirement at that point.And to help web developers actually do this...Es ist ein legal requirement.Aber ab da haben alle Seiten angefangen, Flash zu verwenden,was überhaupt nicht accessibility hatte.Also ab da, wo es legal requirement ist,benutzen alle Flash und es funktioniert damit nicht.Also, dass sie da dran gedacht haben 1998,muss man wirklich mal sagen, Hut ab.Oder, man lässt es einfach bleiben, wie 90% der Entwickler heutzutage.Oh, MonkaS.ASP.NET 1.Okay, der Typ ist von Microsoft.Aber jetzt wird es schmerzhaft, Leute.Jetzt wird es schmerzhaft.Oh nein.Ich ahne, jetzt kommt Webforms.Ich ahne, jetzt kommt Webforms.Es gibt kaum was Schlimmeres.Jetzt kommt Webforms.Es kommt Webforms.Okay, so, we're now in about 2002.webforms kommt jetzt. Gibt es sowas ähnliches eigentlich noch? Ich glaube webforms würdentheoretisch immer noch funktionieren, das benutzt plus keiner mehr.So langsam, jetzt wirst du dir noch noch wieder nicht.Das ist nur mit 20 Jahren, mit Hardware aus 20 Jahren aus der Zukunft verwenden kannst.Es ist webforms. MonkaS.Webforms, stell euch mal vor, so haben Leute Webseiten erstellt.Diese Müll haben wir zu verdanken, optimiert für Microsoft Internet Explorer in 640x480.Das ist absolutes Positioning auf der Seite. Wahnsinn.Guck mal, C-Sharp für einen Browser. Wobei das alles Server-Site gerendert wurde.So, ich werde sagen, wenn wir auf diesen Knopf klicken, werde ich den Text auf den Knopf wechseln, um zu sagen, du hast klickt, und dann DateTime.now, okay, das wieder anrufen. Und dann, wenn ich meinen Knopf klicken, siehst du, ich bekomme die Zeit, das ist ziemlich schön, und ich kann es wieder klicken, und jedes Mal, wenn ich es klick, wird die Zeit erneut.Das Ding rendert unter der Haube immer eine komplett neue Seite, oder?Wir können das nicht sogar mit modern Tech machen. Wie machen die das? Also, das Trick ist, wie das implementiert wird. Wenn wir hier in ViewSource gehen, sehen wir diesen riesigen Blob von Basis64-Encoded-Stuff. Es ist ein bisschen schwer zu lesen, ich weiß. Können wir das mal wechseln? Okay, also wir haben einen riesigen Basis64-Blob, und das repräsentiert den UI-Statement, also eine objektorientierte Repräsentation der UI, die in diesen Blob serialisiert wird. Und wenn ich einen Knopf klicken, senden sie das an den Server, und dann geht es weiter.Also, das ist das Framework, was es aktuell so gibt, dass sie das ähnlich machen....Code set, it builds the UI-State, it runs the action, that I've just put some logic for, and re-renders the new HTML, and also re-emits that Base64-Blob, so it can update again. And as a consequence, each version of that ends up in the browser's history. That's a pretty clever solution to doing interactivity. But it does some other quite nice solutions to certain problems as well. For example, back at this time, CSS was...Der Handy-Dude soll mal seine Hand wegmachen....and if you wanted to do something like horizontal and vertical centering of something, well, you could probably just forget it, unless you had like a PhD in browser quirks or something like that. But if you were an ASP-Net developer, you could do it quite well, you could just go like this. There we go, that's probably about the middle, isn't it?...save that, go back into my browser, and there we go, that's nice. Now of course that worked just by disgustingly putting the absolute pixel positions into the page there, and this whole idea started to fall apart a few years later, for reasons that we'll talk about.Alright, so this was the hottest way of doing web development at that time, and it seemed like it would always be like that. Until a couple of years later, something new came......which absolutely shook things up.Leute! Es ist soweit! Ruby ist am Start! Das gucken wir uns das nächste Mal an. Wir haben jetzt ungefähr die Hälfte angeguckt, wir gucken morgen dann den Rest. Ruby! Endlich haben wir es geschafft!Ich hätte nicht gedacht, dass Ruby da drinnen vorkommt. So maßgebend für... naja gut, Server-seitig, backend-seitig hat Rails schon das ganze ziemlich umgekrempelt.Ja, ich fand den Vorteil echt richtig spannend. Twitter hat sich heute wieder gefreut über mein Bahn-Geflame, einer hat geschrieben, er ist nur noch auf Twitter, dass er mich die Bahn beleidigen sehen kann.Was für euch witzig ist, ja, auf Twitter, was dort für Entertainment sorgt, ist für mich ernst. Ich mein das so. Ich schreib das nicht einfach, weil ich denke, ah, heute wird's mal wieder Zeit, die Bahn zu flamen. Nein, ich hab richtigen Hass auf die Bahn. Heute morgen auch wieder.Das erste, was ich mache, ist, ich steh auf, guck aufs Handy, seh mein Zugfeld aus. Guck, was der nächste Zugfeld auch aus. Du hast noch nen schicken neuen Fiat, den hab ich. Der ist auch nice. Der Fiat ist nice.Ja, Chat, Chat, serious, seriously. Meint ihr, ich wäre noch nicht auf die Idee gekommen, nachdem ich, also meint ihr, ich wäre nicht ohne den Chat auf die Idee gekommen, dass wenn ich mir ein neues Auto gekauft habe, ich das Auto auch benutzen könnte.Also, kommt, ist das bei euch, ist das eine Möglichkeit? Könnt ihr denken, ja, auf die Idee ist der Max vielleicht selbst gekommen, sein neues Auto zu benutzen.Ja, offensichtlich nicht. Was für ein Smartphone benutzt du? Ich hab ein iPhone aktuell. Ich hab hier daheim eine wilde Mischung aus iPads, iPhones und Androids.Dashboards. Das auch, das auch. PCOM config zeigen, die hab ich doch auf, die hab ich doch auf, auf, ähm.Ja, PCOM config. Sehr ausführlich, sehr, sehr viel drinne.Ok, Leute. Badge-Time. Ich glaube, es wird mal wieder Zeit für den Badge-Song, oder? Also für meine Outro-Musik.Äh. Mal wieder Outro-Musik. Also Leute, wir sehen uns. Bis denn, macht's gut. See you.Das war's für heute. Ich hoffe, es hat euch gefallen. Bis zum nächsten Mal.Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen.", "segments": [{"id": 1, "start": 30.0, "end": 55.72, "text": "Ja Leute, ich dachte mir so, es ist 20.20 Uhr, ich kann jetzt eh nichts mehr machen."}, {"id": 2, "start": 55.72, "end": 63.72, "text": "Da komm ich noch einfach mal eineinhalb Stunden an."}, {"id": 3, "start": 63.72, "end": 69.72, "text": "Muss ich bloß erwarten bis Twitch das mitgekriegt hat."}, {"id": 4, "start": 69.72, "end": 77.72, "text": "Omega Lul."}, {"id": 5, "start": 77.72, "end": 93.72, "text": "Bis jetzt hat es Twitch natürlich nicht gecheckt."}, {"id": 6, "start": 93.72, "end": 99.72, "text": "Boomer, müde, Bedgetime."}, {"id": 7, "start": 99.72, "end": 102.72, "text": "Moin Michael, 50 Billionen."}, {"id": 8, "start": 102.72, "end": 105.72, "text": "Omega wieder da."}, {"id": 9, "start": 105.72, "end": 107.72, "text": "Und was macht Lisa?"}, {"id": 10, "start": 107.72, "end": 111.72, "text": "Ist doch Lisa, oder?"}, {"id": 11, "start": 111.72, "end": 113.72, "text": "Manchmal merke ich mir so random Sachen."}, {"id": 12, "start": 113.72, "end": 120.72, "text": "Ich weiß nicht, ich kann dir nicht sagen was gestern war, aber manche Sachen merke ich mir."}, {"id": 13, "start": 120.72, "end": 125.72, "text": "Läuft's bei euch, ja?"}, {"id": 14, "start": 125.72, "end": 129.72, "text": "Moin Sirius Max."}, {"id": 15, "start": 129.72, "end": 135.72, "text": "Mochek ist auch am Start."}, {"id": 16, "start": 135.72, "end": 141.72, "text": "Also ich hab heute immer Sushi essen."}, {"id": 17, "start": 141.72, "end": 145.72, "text": "Moment."}, {"id": 18, "start": 145.72, "end": 148.72, "text": "Sushi essen und sie hat bezahlt, aha."}, {"id": 19, "start": 148.72, "end": 153.72, "text": "Ja, 2022 ist das Jahr kein Ding mehr."}, {"id": 20, "start": 153.72, "end": 158.72, "text": "Da muss man sich auch mal einladen lassen können."}, {"id": 21, "start": 158.72, "end": 161.72, "text": "69 Euro, das ist ganz schön teuer."}, {"id": 22, "start": 161.72, "end": 164.72, "text": "Mein Sushi ist immer teuer."}, {"id": 23, "start": 164.72, "end": 170.72, "text": "Aber mittlerweile ist es echt abfach teuer."}, {"id": 24, "start": 170.72, "end": 173.72, "text": "Ich überlege, ich habe heute Thunfisch gekauft."}, {"id": 25, "start": 173.72, "end": 177.72, "text": "Aus der Dose, Thunfischdose, so ein paar hundert Gramm oder so."}, {"id": 26, "start": 177.72, "end": 185.72, "text": "Drei Euro pro Dose, Alter."}, {"id": 27, "start": 185.72, "end": 192.72, "text": "Na dann."}, {"id": 28, "start": 192.72, "end": 196.72, "text": "Da hast du entweder sehr viel Eindruck gemacht."}, {"id": 29, "start": 196.72, "end": 202.72, "text": "Oder es hat andere Gründe, wo man dann immer nur spekulieren kann."}, {"id": 30, "start": 202.72, "end": 207.72, "text": "So, jetzt hat's Twitch kapiert."}, {"id": 31, "start": 207.72, "end": 210.72, "text": "Na das ist doch schön."}, {"id": 32, "start": 210.72, "end": 213.72, "text": "Ich bin echt froh, dass ich mal so oft essen gehe."}, {"id": 33, "start": 213.72, "end": 216.72, "text": "Ich gehe tatsächlich auch so gut wie gar nicht mehr essen."}, {"id": 34, "start": 216.72, "end": 223.72, "text": "Ich bin ja nicht in Frankfurt, selten nur noch in Frankfurt."}, {"id": 35, "start": 223.72, "end": 226.72, "text": "Und..."}, {"id": 36, "start": 226.72, "end": 233.72, "text": "Wartet mal."}, {"id": 37, "start": 233.72, "end": 236.72, "text": "Genau, wie gesagt, ich bin ja kaum noch in Frankfurt."}, {"id": 38, "start": 236.72, "end": 238.72, "text": "Dementsprechend gehe ich auch nicht essen."}, {"id": 39, "start": 238.72, "end": 242.72, "text": "Ich war letzte Woche tatsächlich zwei Tage da, zwei Tage essen."}, {"id": 40, "start": 242.72, "end": 247.72, "text": "Und gleich danach an einem Tag wieder ordentlich..."}, {"id": 41, "start": 247.72, "end": 250.72, "text": "Ja, also, ich gehe da nicht mehr essen."}, {"id": 42, "start": 250.72, "end": 254.72, "text": "Ich bin eh kaum da und wenn ich da bin, sollte ich besser nicht essen gehen."}, {"id": 43, "start": 254.72, "end": 255.72, "text": "Dankeschön, Leon."}, {"id": 44, "start": 255.72, "end": 260.72, "text": "Messe, vier Monate Hyper-Subscription hier."}, {"id": 45, "start": 260.72, "end": 262.72, "text": "Mario, Dankeschön für den Sub."}, {"id": 46, "start": 262.72, "end": 266.72, "text": "Ja, da war richtig, richtig dampf wieder."}, {"id": 47, "start": 266.72, "end": 269.72, "text": "Und dazu kommt, dass man richtig viel Geld spart."}, {"id": 48, "start": 269.72, "end": 275.72, "text": "Also, ich bin ungefähr sonst immer einmal im Monat zur Bank gegangen."}, {"id": 49, "start": 275.72, "end": 277.72, "text": "Also, ich bin öfters zur Bank gegangen."}, {"id": 50, "start": 277.72, "end": 281.72, "text": "Aber ich bin einmal im Monat zur Bank gegangen, immer um halt Geld für den Monat abzuheben."}, {"id": 51, "start": 281.72, "end": 285.72, "text": "Ich habe ungefähr jeden Monat irgendwie so 1.000 Euro abgehoben."}, {"id": 52, "start": 285.72, "end": 287.72, "text": "Und jeden Monat."}, {"id": 53, "start": 287.72, "end": 289.72, "text": "Und ich musste dieses Jahr irgendwie..."}, {"id": 54, "start": 289.72, "end": 293.72, "text": "Also normalerweise musst du wirklich jeden Monat 1.000 Euro abheben."}, {"id": 55, "start": 293.72, "end": 295.72, "text": "So für..."}, {"id": 56, "start": 295.72, "end": 297.72, "text": "Zeugs halt, ja."}, {"id": 57, "start": 297.72, "end": 299.72, "text": "Essen, mal was einkaufen und so."}, {"id": 58, "start": 299.72, "end": 301.72, "text": "Und jetzt..."}, {"id": 59, "start": 301.72, "end": 303.72, "text": "Seit ich..."}, {"id": 60, "start": 303.72, "end": 305.72, "text": "Seit Corona und seit Homeoffice..."}, {"id": 61, "start": 305.72, "end": 308.72, "text": "Ich glaube, ich war dieses Jahr erst..."}, {"id": 62, "start": 308.72, "end": 310.72, "text": "Viermal oder so."}, {"id": 63, "start": 310.72, "end": 312.72, "text": "Drei oder viermal auf der Bank."}, {"id": 64, "start": 312.72, "end": 316.72, "text": "Den Rest habe ich online bestellt, online gekauft, bezahlt."}, {"id": 65, "start": 316.72, "end": 318.72, "text": "Aber ich gebe halt kaum noch was zu essen aus."}, {"id": 66, "start": 318.72, "end": 325.72, "text": "Es ist ein Riesenunterschied, ob du täglich in Frankfurt irgendwie 10 bis 15 Euro oder so ausgibst."}, {"id": 67, "start": 325.72, "end": 327.72, "text": "Was Essen angeht und drum herum."}, {"id": 68, "start": 327.72, "end": 331.72, "text": "Oder daheim halt einfach fast nichts im Vergleich."}, {"id": 69, "start": 331.72, "end": 334.72, "text": "Für die Drohung am Bahnhof."}, {"id": 70, "start": 334.72, "end": 339.72, "text": "Die Story mit dem Bluterkurs im Arm und dem Frankfurt am Bahnhof habe ich dir ja schon erzählt."}, {"id": 71, "start": 339.72, "end": 341.72, "text": "Oder habe ich euch ja schon erzählt."}, {"id": 72, "start": 341.72, "end": 343.72, "text": "Du fängst demnächst eine Lehre an."}, {"id": 73, "start": 343.72, "end": 345.72, "text": "Eine zweite Lehre als Fachinformatiker."}, {"id": 74, "start": 345.72, "end": 347.72, "text": "Das ist nice."}, {"id": 75, "start": 347.72, "end": 353.72, "text": "Machst du eine Umschulung oder machst du eine ganz normale Ausbildung bei irgendeinem Betrieb?"}, {"id": 76, "start": 353.72, "end": 355.72, "text": "Ein Kollege?"}, {"id": 77, "start": 355.72, "end": 357.72, "text": "Vollkommen falsch."}, {"id": 78, "start": 357.72, "end": 364.72, "text": "Ein um drei Ecken Bekannter hat mich gefragt, ob ich ihm nicht irgendwie so einen Praktikumsplatz bei uns vermitteln könnte."}, {"id": 79, "start": 364.72, "end": 367.72, "text": "Und habe ich gesagt, ja, ich kann ja mal fragen."}, {"id": 80, "start": 367.72, "end": 369.72, "text": "So ein bisschen meine gute..."}, {"id": 81, "start": 369.72, "end": 371.72, "text": "Wie sagt man so?"}, {"id": 82, "start": 371.72, "end": 372.72, "text": "Karma?"}, {"id": 83, "start": 372.72, "end": 375.72, "text": "Nee, so ein bisschen meine gute Aura."}, {"id": 84, "start": 375.72, "end": 377.72, "text": "Bisschen wieder auffrischen, ja."}, {"id": 85, "start": 377.72, "end": 382.72, "text": "Dann habe ich unseren Ausbildungschef gefragt, wie es aussieht."}, {"id": 86, "start": 382.72, "end": 385.72, "text": "Um Umschulungen und Praktikum machen und sowas."}, {"id": 87, "start": 385.72, "end": 390.72, "text": "Dann meinte der A, weiß er nicht so genau, braucht ein bisschen mehr Details."}, {"id": 88, "start": 390.72, "end": 395.72, "text": "Dann habe ich dem, dem um drei Ecken Bekannten, habe ich dann das geschickt."}, {"id": 89, "start": 395.72, "end": 398.72, "text": "Hab ich gesagt, hier guck mal, der hat noch ein paar Fragen."}, {"id": 90, "start": 398.72, "end": 401.72, "text": "Und dann hat der Typ eine Woche gebraucht, darauf zu antworten."}, {"id": 91, "start": 401.72, "end": 405.72, "text": "Ich habe eigentlich gar keinen Bock mehr, das jetzt unserem Ausbildungschef zu schicken."}, {"id": 92, "start": 405.72, "end": 410.72, "text": "Der Kerl ist eh schon unten durch, wenn es eine Woche dauert, bis der auf die einfachsten Sachen antwortet."}, {"id": 93, "start": 410.72, "end": 412.72, "text": "Also..."}, {"id": 94, "start": 413.72, "end": 417.72, "text": "Weiß nicht, ob ich da nochmal ein gutes Wort einlegen soll."}, {"id": 95, "start": 417.72, "end": 420.72, "text": "Ich hatte gewusst, ey, das ist wie gesagt nice."}, {"id": 96, "start": 434.72, "end": 436.72, "text": "Du machst ein richtiger Ausbilder."}, {"id": 97, "start": 436.72, "end": 441.72, "text": "Also drei Jahre Azubi Grind ist gestartet."}, {"id": 98, "start": 444.72, "end": 447.72, "text": "Erstes Kind heißt Wupplos, so muss das sein."}, {"id": 99, "start": 447.72, "end": 449.72, "text": "Aber mit Null, ja."}, {"id": 100, "start": 449.72, "end": 453.72, "text": "Ich frage mich, sind Buchstaben, äh ich fasse hin, Buchstaben klar."}, {"id": 101, "start": 453.72, "end": 456.72, "text": "Sind Zahlen im Namen erlaubt in Deutschland, darf man das machen?"}, {"id": 102, "start": 456.72, "end": 462.72, "text": "Also darf man sein Kind, keine Ahnung, Max 420 oder so nennen?"}, {"id": 103, "start": 462.72, "end": 465.72, "text": "Oder 60, nein, oder was auch immer."}, {"id": 104, "start": 465.72, "end": 467.72, "text": "Dein ist nicht erlaubt."}, {"id": 105, "start": 472.72, "end": 474.72, "text": "Selfmade Eyes."}, {"id": 106, "start": 474.72, "end": 477.72, "text": "Huge Abo-Falle zugeschlagen wieder."}, {"id": 107, "start": 477.72, "end": 479.72, "text": "24 Monate, dankeschön."}, {"id": 108, "start": 484.72, "end": 487.72, "text": "Du installierst gerade Manjaro auf deinem Arbeitsnotebook."}, {"id": 109, "start": 487.72, "end": 490.72, "text": "Warum denn kein echtes Arch, by the way?"}, {"id": 110, "start": 490.72, "end": 493.72, "text": "Da würde sich der Chat hier freuen."}, {"id": 111, "start": 494.72, "end": 497.72, "text": "Nur echtes Arch ist richtiges Arch."}, {"id": 112, "start": 497.72, "end": 499.72, "text": "Manjaro ist Fake Arch."}, {"id": 113, "start": 499.72, "end": 501.72, "text": "Aber ich verwende das auch."}, {"id": 114, "start": 504.72, "end": 506.72, "text": "Die Kinder durchnummerieren."}, {"id": 115, "start": 509.72, "end": 511.72, "text": "Sag mal, ist heute irgendwas?"}, {"id": 116, "start": 511.72, "end": 516.72, "text": "Normalerweise haben wir nach 10 Minuten Stream irgendwie 150, 200 Leute."}, {"id": 117, "start": 516.72, "end": 518.72, "text": "Hab ich irgendwas verpasst? Ist heute irgendwas?"}, {"id": 118, "start": 518.72, "end": 523.72, "text": "Ich meine, nicht, dass es super spannendes Thema heute gebe oder so, was die Leute verpassen würden."}, {"id": 119, "start": 523.72, "end": 525.72, "text": "Das ist nicht so."}, {"id": 120, "start": 527.72, "end": 529.72, "text": "Ach, Discord hat es auch noch nicht gecheckt?"}, {"id": 121, "start": 529.72, "end": 532.72, "text": "Ja, dann hat Twitch einfach noch gar nicht überall rausgeschickt."}, {"id": 122, "start": 532.72, "end": 534.72, "text": "Guck mal hier, was ist da los?"}, {"id": 123, "start": 534.72, "end": 535.72, "text": "Also sind, das stimmt übrigens auch nicht."}, {"id": 124, "start": 535.72, "end": 538.72, "text": "Bei mir sind es angeblich gerade 91."}, {"id": 125, "start": 540.72, "end": 543.72, "text": "Na, dafür sind es schon wiederum zu viele."}, {"id": 126, "start": 543.72, "end": 545.72, "text": "Was machst du mit der neuen VM weiter?"}, {"id": 127, "start": 545.72, "end": 547.72, "text": "Ja, weiß nicht, die alte tut ja."}, {"id": 128, "start": 547.72, "end": 549.72, "text": "Aber ja, müsste ich mal,"}, {"id": 129, "start": 549.72, "end": 551.72, "text": "ich müsste vor allem mal mein Surface Book einrichten,"}, {"id": 130, "start": 551.72, "end": 554.72, "text": "was ich da von der Arbeit bekommen habe mit Linux."}, {"id": 131, "start": 554.72, "end": 556.72, "text": "Das liegt jetzt auch schon wieder zwei Wochen hier rum."}, {"id": 132, "start": 558.72, "end": 561.72, "text": "Du nutzt SteamOS auf Steam Deck für die Arbeit."}, {"id": 133, "start": 561.72, "end": 564.72, "text": "Meinst du, ist das wirklich eine gute Umgebung zum Arbeiten?"}, {"id": 134, "start": 565.72, "end": 568.72, "text": "Weißt du, also geht das gut?"}, {"id": 135, "start": 570.72, "end": 572.72, "text": "Du würdest die Qt4M benutzen."}, {"id": 136, "start": 572.72, "end": 574.72, "text": "Ist die safe for work?"}, {"id": 137, "start": 574.72, "end": 577.72, "text": "Und du meinst, die hier,"}, {"id": 138, "start": 578.72, "end": 586.72, "text": "die einzig wahre beste Desktop-Oberfläche,"}, {"id": 139, "start": 586.72, "end": 588.72, "text": "die je erstellt wurde."}, {"id": 140, "start": 595.72, "end": 597.72, "text": "Meinst du die hier?"}, {"id": 141, "start": 597.72, "end": 600.72, "text": "Ja, die ist safe for work."}, {"id": 142, "start": 600.72, "end": 604.72, "text": "Die kannst du verwenden."}, {"id": 143, "start": 610.72, "end": 613.72, "text": "Aber ich glaube, jetzt haben wir auch genug gesehen,"}, {"id": 144, "start": 613.72, "end": 615.72, "text": "jetzt kann ich wieder ausmachen."}, {"id": 145, "start": 615.72, "end": 617.72, "text": "Oh, ich muss Ubuntu updaten."}, {"id": 146, "start": 617.72, "end": 619.72, "text": "Ja, ich weiß, dass ich Ubuntu updaten muss."}, {"id": 147, "start": 619.72, "end": 621.72, "text": "Das ist nämlich noch, wartet mal,"}, {"id": 148, "start": 621.72, "end": 624.72, "text": "das ist nämlich noch ein..."}, {"id": 149, "start": 624.72, "end": 627.72, "text": "Ach so, ich habe Termin schon auf."}, {"id": 150, "start": 627.72, "end": 632.72, "text": "Das ist nämlich noch ein Ubuntu 2104."}, {"id": 151, "start": 632.72, "end": 634.72, "text": "Das ist ganz schön alt."}, {"id": 152, "start": 636.72, "end": 639.72, "text": "Sogar das Trash Directory ist Qt."}, {"id": 153, "start": 639.72, "end": 642.72, "text": "Ja, alles hyper Qt."}, {"id": 154, "start": 647.72, "end": 649.72, "text": "So, machen wir wieder aus."}, {"id": 155, "start": 649.72, "end": 651.72, "text": "Was ist das?"}, {"id": 156, "start": 655.72, "end": 657.72, "text": "QtOS?"}, {"id": 157, "start": 657.72, "end": 659.72, "text": "Nein, das ist nicht QtOS."}, {"id": 158, "start": 659.72, "end": 661.72, "text": "Das ist..."}, {"id": 159, "start": 663.72, "end": 665.72, "text": "Moment, wie hieß das?"}, {"id": 160, "start": 665.72, "end": 667.72, "text": "Nicht Ubuntu, sondern..."}, {"id": 161, "start": 667.72, "end": 675.72, "text": "Oh, ich habe vergessen, wie das hieß."}, {"id": 162, "start": 679.72, "end": 683.72, "text": "Nein, nein, nein, nein, nein, nicht Ubuntu."}, {"id": 163, "start": 687.72, "end": 689.72, "text": "Wartet mal."}, {"id": 164, "start": 689.72, "end": 691.72, "text": "Es gibt eins, das so heißt,"}, {"id": 165, "start": 691.72, "end": 693.72, "text": "aber das ist was anderes."}, {"id": 166, "start": 693.72, "end": 695.72, "text": "Ich muss mal kurz gucken."}, {"id": 167, "start": 707.72, "end": 709.72, "text": "MoBuntu."}, {"id": 168, "start": 709.72, "end": 711.72, "text": "MoBuntu war das."}, {"id": 169, "start": 711.72, "end": 713.72, "text": "Genau."}, {"id": 170, "start": 713.72, "end": 715.72, "text": "Jetzt weiß ich es wieder."}, {"id": 171, "start": 715.72, "end": 717.72, "text": "MoBuntu."}, {"id": 172, "start": 718.72, "end": 720.72, "text": "Die Webseite sieht monkaTOS aus,"}, {"id": 173, "start": 720.72, "end": 722.72, "text": "ist sie aber nicht."}, {"id": 174, "start": 722.72, "end": 724.72, "text": "Guck mal hier."}, {"id": 175, "start": 724.72, "end": 726.72, "text": "MoBuntu."}, {"id": 176, "start": 735.72, "end": 737.72, "text": "Also, wer sein Ubuntu ver..."}, {"id": 177, "start": 737.72, "end": 739.72, "text": "äh..."}, {"id": 178, "start": 739.72, "end": 741.72, "text": "ver, ver, ver, ja, ähm..."}, {"id": 179, "start": 742.72, "end": 744.72, "text": "Aja Jan will..."}, {"id": 180, "start": 744.72, "end": 746.72, "text": "verwiebisieren,"}, {"id": 181, "start": 746.72, "end": 752.72, "text": "das ist das Richtige hier."}, {"id": 182, "start": 756.72, "end": 758.72, "text": "Mit MoE ausgesprochen."}, {"id": 183, "start": 758.72, "end": 760.72, "text": "Was? MoEBuntu?"}, {"id": 184, "start": 760.72, "end": 762.72, "text": "Was?"}, {"id": 185, "start": 764.72, "end": 766.72, "text": "Ist nur 22.04, wie, da gibt es noch kein..."}, {"id": 186, "start": 766.72, "end": 768.72, "text": "Das läuft doch überall drauf, oder?"}, {"id": 187, "start": 768.72, "end": 770.72, "text": "Das ist doch nur letztendlich ein Gnome-Skin."}, {"id": 188, "start": 770.72, "end": 774.72, "text": "Der scheiß Gnome."}, {"id": 189, "start": 776.72, "end": 778.72, "text": "Das ist doch nur ein Gnome-Skin."}, {"id": 190, "start": 780.72, "end": 782.72, "text": "Das kannst du wahrscheinlich sogar"}, {"id": 191, "start": 782.72, "end": 784.72, "text": "unter Arch, by the way, installieren."}, {"id": 192, "start": 788.72, "end": 790.72, "text": "So, für Arch?"}, {"id": 193, "start": 792.72, "end": 794.72, "text": "Ja, siehste,"}, {"id": 194, "start": 794.72, "end": 800.72, "text": "das gibt es für alles mögliche."}, {"id": 195, "start": 802.72, "end": 804.72, "text": "Mo... was?"}, {"id": 196, "start": 804.72, "end": 806.72, "text": "MoB? Da ist die MoApp."}, {"id": 197, "start": 808.72, "end": 810.72, "text": "Wie auch immer das ausgesprochen wird."}, {"id": 198, "start": 816.72, "end": 820.72, "text": "Das Demo ist es auch nur ein modifiziertes Arch."}, {"id": 199, "start": 820.72, "end": 822.72, "text": "Ja."}, {"id": 200, "start": 826.72, "end": 828.72, "text": "Mo... wund..."}, {"id": 201, "start": 828.72, "end": 830.72, "text": "ach, was?"}, {"id": 202, "start": 830.72, "end": 832.72, "text": "Was wird's?"}, {"id": 203, "start": 832.72, "end": 834.72, "text": "Okay, ich hab jetzt ungefähr chat."}, {"id": 204, "start": 834.72, "end": 836.72, "text": "Ich hab jetzt mindestens acht verschiedene"}, {"id": 205, "start": 836.72, "end": 838.72, "text": "Aussprachen von euch gehört."}, {"id": 206, "start": 838.72, "end": 840.72, "text": "Es hat keiner irgendeine Ahnung."}, {"id": 207, "start": 840.72, "end": 842.72, "text": "Ihr könnt's ruhig zugeben."}, {"id": 208, "start": 842.72, "end": 844.72, "text": "Es weiß keiner, wie man das richtig ausspricht."}, {"id": 209, "start": 844.72, "end": 846.72, "text": "Oh, jetzt kommen wir jetzt schon mit"}, {"id": 210, "start": 846.72, "end": 848.72, "text": "Lautumschrift und so wieder an."}, {"id": 211, "start": 848.72, "end": 850.72, "text": "Einziges, einziges Fallfeld-Comment hier,"}, {"id": 212, "start": 850.72, "end": 852.72, "text": "wobei man halt gar nicht weiß, wie man das wirklich..."}, {"id": 213, "start": 852.72, "end": 854.72, "text": "Also ich weiß anhand diesem hier nicht,"}, {"id": 214, "start": 854.72, "end": 856.72, "text": "wie man das ausspricht."}, {"id": 215, "start": 858.72, "end": 860.72, "text": "Moe."}, {"id": 216, "start": 860.72, "end": 862.72, "text": "Moe. Buntu."}, {"id": 217, "start": 862.72, "end": 864.72, "text": "Wie man auch mal Jason ausspricht,"}, {"id": 218, "start": 864.72, "end": 866.72, "text": "genau so, wie ich es jetzt ausgesprochen habe,"}, {"id": 219, "start": 866.72, "end": 868.72, "text": "außer der eine Typ, der meinen,"}, {"id": 220, "start": 868.72, "end": 870.72, "text": "dass ich das ausgesprochen habe,"}, {"id": 221, "start": 870.72, "end": 872.72, "text": "ist es nicht."}, {"id": 222, "start": 872.72, "end": 874.72, "text": "Außer der eine Typ, der meint,"}, {"id": 223, "start": 874.72, "end": 876.72, "text": "dass es Jawsaw heißt."}, {"id": 224, "start": 878.72, "end": 880.72, "text": "Jawsaw."}, {"id": 225, "start": 880.72, "end": 882.72, "text": "Jawsorn,"}, {"id": 226, "start": 882.72, "end": 884.72, "text": "oder so."}, {"id": 227, "start": 888.72, "end": 890.72, "text": "Aber wo wir gerade beim Thema sind,"}, {"id": 228, "start": 894.72, "end": 896.72, "text": "das Thema ist ja, wie man was ausspricht,"}, {"id": 229, "start": 896.72, "end": 898.72, "text": "und es gibt ja schon seit"}, {"id": 230, "start": 898.72, "end": 900.72, "text": "Ewigkeiten diese Diskussion, ob GIF"}, {"id": 231, "start": 900.72, "end": 902.72, "text": "oder GIF."}, {"id": 232, "start": 902.72, "end": 904.72, "text": "Ich habe heute in der Mittagspause,"}, {"id": 233, "start": 904.72, "end": 906.72, "text": "okay, ich gebe zu, nicht in der Mittagspause,"}, {"id": 234, "start": 906.72, "end": 908.72, "text": "nebenbei auf dem Kopfhörer,"}, {"id": 235, "start": 908.72, "end": 910.72, "text": "einen"}, {"id": 236, "start": 910.72, "end": 912.72, "text": "Vortrag geguckt,"}, {"id": 237, "start": 912.72, "end": 914.72, "text": "den ich echt..."}, {"id": 238, "start": 914.72, "end": 916.72, "text": "Also nicht komplett, wie gesagt, Viertelstunde"}, {"id": 239, "start": 916.72, "end": 918.72, "text": "oder so habe ich geguckt."}, {"id": 240, "start": 918.72, "end": 920.72, "text": "Einen Vortrag geguckt von einer Konferenz hier."}, {"id": 241, "start": 920.72, "end": 922.72, "text": "Why Webtec"}, {"id": 242, "start": 922.72, "end": 924.72, "text": "is like this. Der erzählt"}, {"id": 243, "start": 924.72, "end": 926.72, "text": "ein bisschen was über Mosaik und Boomer"}, {"id": 244, "start": 926.72, "end": 928.72, "text": "Zeug."}, {"id": 245, "start": 928.72, "end": 930.72, "text": "Ich habe geguckt, bis"}, {"id": 246, "start": 930.72, "end": 932.72, "text": "wo er Mosaik zeigen wollte."}, {"id": 247, "start": 934.72, "end": 936.72, "text": "Ich weiß, wenn wir sonst nichts zu tun haben,"}, {"id": 248, "start": 936.72, "end": 938.72, "text": "können wir uns den Vortrag zusammen angucken. Ich fand es wirklich spannend."}, {"id": 249, "start": 938.72, "end": 940.72, "text": "Oder wir gucken Fireship, neues Video."}, {"id": 250, "start": 942.72, "end": 944.72, "text": "How to never ride back."}, {"id": 251, "start": 944.72, "end": 946.72, "text": "Das sieht zwar so aus, als hätte ich es geguckt, aber ich habe es nicht geguckt."}, {"id": 252, "start": 946.72, "end": 948.72, "text": "Ich habe es einfach nur aufgemacht und..."}, {"id": 253, "start": 948.72, "end": 950.72, "text": "Dann war es offen."}, {"id": 254, "start": 950.72, "end": 952.72, "text": "Kann ich deine Nachricht umbeantworten?"}, {"id": 255, "start": 952.72, "end": 954.72, "text": "Was denn?"}, {"id": 256, "start": 954.72, "end": 956.72, "text": "GitHub oder Shithub?"}, {"id": 257, "start": 956.72, "end": 958.72, "text": "Ja, der Meme-Faktor"}, {"id": 258, "start": 958.72, "end": 960.72, "text": "ist natürlich Shithub."}, {"id": 259, "start": 960.72, "end": 962.72, "text": "Gerade, gerade, durch"}, {"id": 260, "start": 962.72, "end": 964.72, "text": "der Endpunkt."}, {"id": 261, "start": 964.72, "end": 966.72, "text": "Ach, noch weiter oben."}, {"id": 262, "start": 968.72, "end": 970.72, "text": "Was denn jetzt?"}, {"id": 263, "start": 970.72, "end": 972.72, "text": "Was, wie, wo?"}, {"id": 264, "start": 974.72, "end": 976.72, "text": "Kannst du einen Portal"}, {"id": 265, "start": 976.72, "end": 978.72, "text": "empfehlen, auf dem man zum Beispiel"}, {"id": 266, "start": 978.72, "end": 980.72, "text": "technische Fortbildungen Richtung"}, {"id": 267, "start": 980.72, "end": 982.72, "text": "Sensor... Boah."}, {"id": 268, "start": 982.72, "end": 986.72, "text": "Ich habe keine Ahnung."}, {"id": 269, "start": 986.72, "end": 988.72, "text": "Ich habe keine Ahnung."}, {"id": 270, "start": 988.72, "end": 990.72, "text": "Das Einzige,"}, {"id": 271, "start": 990.72, "end": 992.72, "text": "was ich an Fortbildungen kenne,"}, {"id": 272, "start": 992.72, "end": 994.72, "text": "beziehungsweise, den muss man nicht sagen, kenne, aber"}, {"id": 273, "start": 994.72, "end": 996.72, "text": "das Einzige, gut, immer diese"}, {"id": 274, "start": 996.72, "end": 998.72, "text": "grottenschlechte Escher-Schulung, die ich letztens auf der Arbeit"}, {"id": 275, "start": 998.72, "end": 1000.72, "text": "gemacht habe, außen vor, weil diesmal wirklich"}, {"id": 276, "start": 1000.72, "end": 1002.72, "text": "Powerpoint durchgeklickt, ohne"}, {"id": 277, "start": 1002.72, "end": 1004.72, "text": "Sinn und Verstand und der Typ meinte ja auch noch, das muss"}, {"id": 278, "start": 1004.72, "end": 1006.72, "text": "so sein. Oh, der war cringe,"}, {"id": 279, "start": 1006.72, "end": 1008.72, "text": "Alter. Der Trainer, diese"}, {"id": 280, "start": 1008.72, "end": 1010.72, "text": "Escher-Trainer. Leute, wie spricht"}, {"id": 281, "start": 1010.72, "end": 1012.72, "text": "dir das hier aus?"}, {"id": 282, "start": 1012.72, "end": 1014.72, "text": "Mal gucken, wie Google das ausspricht."}, {"id": 283, "start": 1016.72, "end": 1018.72, "text": "Nein, nein, nein, nein."}, {"id": 284, "start": 1018.72, "end": 1020.72, "text": "Ich meine nicht den Billard-Stock."}, {"id": 285, "start": 1020.72, "end": 1022.72, "text": "Ich meine die Warteschlange."}, {"id": 286, "start": 1028.72, "end": 1030.72, "text": "Warteschlange. Nein, nein."}, {"id": 287, "start": 1034.72, "end": 1036.72, "text": "Q. Q. Q."}, {"id": 288, "start": 1036.72, "end": 1038.72, "text": "Q. Q. Okay?"}, {"id": 289, "start": 1038.72, "end": 1040.72, "text": "Q. So spricht man das aus."}, {"id": 290, "start": 1042.72, "end": 1044.72, "text": "Und ich spreche das"}, {"id": 291, "start": 1044.72, "end": 1046.72, "text": "auch Q aus, genau."}, {"id": 292, "start": 1046.72, "end": 1048.72, "text": "Und"}, {"id": 293, "start": 1048.72, "end": 1050.72, "text": "der Escher-Trainer,"}, {"id": 294, "start": 1050.72, "end": 1052.72, "text": "wisst ihr, wie der das ausgesprochen hat?"}, {"id": 295, "start": 1052.72, "end": 1054.72, "text": "Q."}, {"id": 296, "start": 1054.72, "end": 1056.72, "text": "Und ich bin mir nicht sicher,"}, {"id": 297, "start": 1056.72, "end": 1058.72, "text": "ob der das, ich war mir"}, {"id": 298, "start": 1058.72, "end": 1060.72, "text": "am Anfang nicht sicher, meint der das"}, {"id": 299, "start": 1060.72, "end": 1062.72, "text": "ernst, aber der hat das so oft"}, {"id": 300, "start": 1062.72, "end": 1064.72, "text": "gesagt, der hat so oft"}, {"id": 301, "start": 1064.72, "end": 1066.72, "text": "das Absicht, Q."}, {"id": 302, "start": 1066.72, "end": 1068.72, "text": "Die hat er gesagt die ganze Zeit."}, {"id": 303, "start": 1068.72, "end": 1070.72, "text": "Und bis ich dann irgendwann festgestellt habe,"}, {"id": 304, "start": 1070.72, "end": 1072.72, "text": "der meint das ernst."}, {"id": 305, "start": 1072.72, "end": 1074.72, "text": "Der N-Quit und D-Quit"}, {"id": 306, "start": 1074.72, "end": 1076.72, "text": "wahrscheinlich auch."}, {"id": 307, "start": 1076.72, "end": 1078.72, "text": "Q."}, {"id": 308, "start": 1084.72, "end": 1086.72, "text": "Ja, und irgendwie dachte"}, {"id": 309, "start": 1086.72, "end": 1088.72, "text": "ich mir dann mit der Zeit, also"}, {"id": 310, "start": 1088.72, "end": 1090.72, "text": "wer wird denn hier alles"}, {"id": 311, "start": 1090.72, "end": 1092.72, "text": "Trainer bei Microsoft, man?"}, {"id": 312, "start": 1092.72, "end": 1094.72, "text": "Q."}, {"id": 313, "start": 1094.72, "end": 1096.72, "text": "Q."}, {"id": 314, "start": 1096.72, "end": 1098.72, "text": "Bei dir auf der Arbeit"}, {"id": 315, "start": 1098.72, "end": 1100.72, "text": "sagt einer zu Vue.js"}, {"id": 316, "start": 1100.72, "end": 1102.72, "text": "Vue."}, {"id": 317, "start": 1102.72, "end": 1104.72, "text": "Und JS, was sagt der wie?"}, {"id": 318, "start": 1104.72, "end": 1106.72, "text": "Vudges?"}, {"id": 319, "start": 1106.72, "end": 1108.72, "text": "Oder so? Vudges?"}, {"id": 320, "start": 1108.72, "end": 1110.72, "text": "Anstatt Vue.js? Vudges?"}, {"id": 321, "start": 1110.72, "end": 1112.72, "text": "Finde ich eigentlich gar nicht schlecht."}, {"id": 322, "start": 1112.72, "end": 1114.72, "text": "Vudges."}, {"id": 323, "start": 1116.72, "end": 1118.72, "text": "Vudges."}, {"id": 324, "start": 1118.72, "end": 1122.72, "text": "Ach, nur Vue."}, {"id": 325, "start": 1124.72, "end": 1126.72, "text": "Alles klar."}, {"id": 326, "start": 1126.72, "end": 1128.72, "text": "Tja, gut,"}, {"id": 327, "start": 1128.72, "end": 1130.72, "text": "es gibt eh auch die Diskussion, was Java"}, {"id": 328, "start": 1130.72, "end": 1132.72, "text": "und Java und ach, was nicht"}, {"id": 329, "start": 1132.72, "end": 1134.72, "text": "alles, was nicht alles ist."}, {"id": 330, "start": 1136.72, "end": 1138.72, "text": "Aber das mit GIF und GIF ist mir gerade"}, {"id": 331, "start": 1138.72, "end": 1140.72, "text": "eingefallen, weil ich den Talk ganz interessant fand"}, {"id": 332, "start": 1140.72, "end": 1142.72, "text": "und ich könnte fast wetten, das kommt da auch noch irgendwann"}, {"id": 333, "start": 1142.72, "end": 1144.72, "text": "dran."}, {"id": 334, "start": 1144.72, "end": 1146.72, "text": "Ah ja, was ich jetzt habe ganz vergessen,"}, {"id": 335, "start": 1146.72, "end": 1148.72, "text": "also neben dieser grottenschlechten Azure"}, {"id": 336, "start": 1148.72, "end": 1150.72, "text": "Schulung, jetzt weiß ich auch wieder, was ich sagen wollte."}, {"id": 337, "start": 1152.72, "end": 1154.72, "text": "Mal mein WeebOS"}, {"id": 338, "start": 1154.72, "end": 1156.72, "text": "zu machen."}, {"id": 339, "start": 1156.72, "end": 1158.72, "text": "Das Einzige, wo ich mal"}, {"id": 340, "start": 1158.72, "end": 1160.72, "text": "tatsächlich so ein paar"}, {"id": 341, "start": 1160.72, "end": 1162.72, "text": "Webinars"}, {"id": 342, "start": 1162.72, "end": 1164.72, "text": "oder wie man es nennt, Kurse"}, {"id": 343, "start": 1164.72, "end": 1166.72, "text": "gemacht hab, war"}, {"id": 344, "start": 1166.72, "end": 1168.72, "text": "bei, wie heißt diese Plattform?"}, {"id": 345, "start": 1170.72, "end": 1172.72, "text": "Da hab ich mal vor Jahren"}, {"id": 346, "start": 1172.72, "end": 1174.72, "text": "ein Ember.js Kurs, hatte ich mir mal"}, {"id": 347, "start": 1174.72, "end": 1176.72, "text": "irgendwo gekauft."}, {"id": 348, "start": 1180.72, "end": 1182.72, "text": "Einen"}, {"id": 349, "start": 1182.72, "end": 1184.72, "text": "ich glaube"}, {"id": 350, "start": 1184.72, "end": 1186.72, "text": "einen ASP.NET Kurs, als ich damit"}, {"id": 351, "start": 1186.72, "end": 1188.72, "text": "mal, als ich ja noch gar keine Ahnung von"}, {"id": 352, "start": 1188.72, "end": 1190.72, "text": "hatte, hab ich mir irgendwo immer, wie heißt"}, {"id": 353, "start": 1190.72, "end": 1192.72, "text": "denn das, wie heißt, wie heißt"}, {"id": 354, "start": 1192.72, "end": 1194.72, "text": "Warte mal, Judemi, ja, ich glaube Judemi."}, {"id": 355, "start": 1194.72, "end": 1196.72, "text": "Ja, ja, genau, ich glaube Judemi, das kann sein."}, {"id": 356, "start": 1196.72, "end": 1198.72, "text": "Ja, ja, ich glaube schon."}, {"id": 357, "start": 1198.72, "end": 1200.72, "text": "Oder gibt's, gibt's nicht sowas wie"}, {"id": 358, "start": 1200.72, "end": 1202.72, "text": "NetAcad, nee, nee, nee, nee, NetAcad, das ist"}, {"id": 359, "start": 1202.72, "end": 1204.72, "text": "Cisco, gell."}, {"id": 360, "start": 1204.72, "end": 1206.72, "text": "Ja, ja, ich glaube, ich glaube,"}, {"id": 361, "start": 1206.72, "end": 1208.72, "text": "dann war's wahrscheinlich."}, {"id": 362, "start": 1208.72, "end": 1210.72, "text": "Nicht ASP.NET, ASP.NET"}, {"id": 363, "start": 1210.72, "end": 1212.72, "text": "Core."}, {"id": 364, "start": 1212.72, "end": 1214.72, "text": "ASP.NET ist shit, ASP.NET Core"}, {"id": 365, "start": 1214.72, "end": 1216.72, "text": "ist gut. Die Sache ist halt, warum"}, {"id": 366, "start": 1216.72, "end": 1218.72, "text": "heißt das Core? Ja, weil mal die Microsoft"}, {"id": 367, "start": 1218.72, "end": 1220.72, "text": "Benamung halt absolut"}, {"id": 368, "start": 1220.72, "end": 1222.72, "text": "Quattruple U ist,"}, {"id": 369, "start": 1222.72, "end": 1224.72, "text": "weil Microsoft ihren Shit nicht richtig"}, {"id": 370, "start": 1224.72, "end": 1226.72, "text": "benennt. Das kommt noch"}, {"id": 371, "start": 1226.72, "end": 1228.72, "text": "von.NET Core, was es ja eigentlich in der Form"}, {"id": 372, "start": 1228.72, "end": 1230.72, "text": "gar nicht mehr gibt, weil.NET"}, {"id": 373, "start": 1230.72, "end": 1232.72, "text": "Core 4 quasi"}, {"id": 374, "start": 1232.72, "end": 1234.72, "text": "umbenannt wurde in.NET 5,"}, {"id": 375, "start": 1234.72, "end": 1236.72, "text": "was allerdings nichts mit.NET Framework"}, {"id": 376, "start": 1236.72, "end": 1238.72, "text": "4.8 zu tun hat. Also wer denkt,"}, {"id": 377, "start": 1238.72, "end": 1240.72, "text": "dass.NET 5 die Weite"}, {"id": 378, "start": 1240.72, "end": 1242.72, "text": "Entwicklung von.NET Framework 4.8"}, {"id": 379, "start": 1242.72, "end": 1244.72, "text": "ist, liegt falsch..NET 5"}, {"id": 380, "start": 1244.72, "end": 1246.72, "text": "ist die Weite Entwicklung von"}, {"id": 381, "start": 1246.72, "end": 1248.72, "text": ".NET Core 3.1."}, {"id": 382, "start": 1248.72, "end": 1250.72, "text": "Alles klar?"}, {"id": 383, "start": 1250.72, "end": 1252.72, "text": "..."}, {"id": 384, "start": 1252.72, "end": 1254.72, "text": "..."}, {"id": 385, "start": 1254.72, "end": 1256.72, "text": "..."}, {"id": 386, "start": 1256.72, "end": 1258.72, "text": "..."}, {"id": 387, "start": 1258.72, "end": 1260.72, "text": "..."}, {"id": 388, "start": 1260.72, "end": 1262.72, "text": "..."}, {"id": 389, "start": 1262.72, "end": 1264.72, "text": "..."}, {"id": 390, "start": 1264.72, "end": 1266.72, "text": "..."}, {"id": 391, "start": 1266.72, "end": 1268.72, "text": "..."}, {"id": 392, "start": 1268.72, "end": 1270.72, "text": "..."}, {"id": 393, "start": 1270.72, "end": 1272.72, "text": "..."}, {"id": 394, "start": 1272.72, "end": 1274.72, "text": "..."}, {"id": 395, "start": 1274.72, "end": 1276.72, "text": "..."}, {"id": 396, "start": 1276.72, "end": 1278.72, "text": "..."}, {"id": 397, "start": 1278.72, "end": 1280.72, "text": "..."}, {"id": 398, "start": 1280.72, "end": 1282.72, "text": "..."}, {"id": 399, "start": 1282.72, "end": 1284.72, "text": "..."}, {"id": 400, "start": 1284.72, "end": 1286.72, "text": "..."}, {"id": 401, "start": 1286.72, "end": 1291.44, "text": "Microsoft ist halt nicht 5-Hat, das ist ja das Problem, deswegen benennen sie das auch so bescheuert."}, {"id": 402, "start": 1291.44, "end": 1294.12, "text": "Ich sag nur One Xbox One X und sowas."}, {"id": 403, "start": 1298.6, "end": 1300.6, "text": "Prez Rief, Dankeschön für den Sub."}, {"id": 404, "start": 1300.88, "end": 1306.68, "text": "Ein Jahr voll. Den goldenen Keks am Start. Leute, der goldene Keks ist quasi das das"}, {"id": 405, "start": 1307.2, "end": 1309.2, "text": "heilste Kekstier, was wir haben."}, {"id": 406, "start": 1309.56, "end": 1313.08, "text": "Ich müsste unbedingt mal neue Kekse beauftragen."}, {"id": 407, "start": 1313.08, "end": 1319.08, "text": "Allerdings hat die E-Mode und Keks-Designering gerade andere Probleme. Die kommt, soweit ich weiß, aus der Ukraine."}, {"id": 408, "start": 1319.6, "end": 1325.96, "text": "Ist jetzt irgendwie geflüchtet, sonst wohin. Die hat, glaube ich, gerade andere Probleme, als E-Modes zu malen."}, {"id": 409, "start": 1330.44, "end": 1337.92, "text": "Oder auf Office 365. Ja, das habe ich bis heute nicht verstanden. Heißt das jetzt Office 365 oder Microsoft 365?"}, {"id": 410, "start": 1337.92, "end": 1342.68, "text": "Es heißt immer noch Office 365, aber ich dachte, es wurde unbedingt Microsoft. Ja, was denn jetzt?"}, {"id": 411, "start": 1347.4, "end": 1354.36, "text": "Microsoft 365 und teilweise Office 365. Meine Güte, Microsoft. Könnt ihr euch nicht mal für eins entscheiden?"}, {"id": 412, "start": 1355.0, "end": 1363.0, "text": "Ich mein, ja, ab jetzt Microsoft 365 ist so, ab jetzt, dass es sogar auf der offiziellen Office Seite noch Office 365 heißt."}, {"id": 413, "start": 1363.2, "end": 1366.0, "text": "Guck mal, ach, jetzt steht Microsoft 365 drinne."}, {"id": 414, "start": 1366.0, "end": 1368.0, "text": "Ach, ja."}, {"id": 415, "start": 1378.84, "end": 1381.32, "text": "Mensch, wer soll denn da noch durchplicken, Alter?"}, {"id": 416, "start": 1382.0, "end": 1385.64, "text": "Ganz davon abgesehen, ich verwende den Mist eh nicht. Ganz ehrlich,"}, {"id": 417, "start": 1386.36, "end": 1390.2, "text": "man braucht keine Office-Anwendung. Office-Anwendungen sind absolut bloated."}, {"id": 418, "start": 1390.2, "end": 1396.64, "text": "Einfach Text, Ach, Text-Editor, Kommando-Zeile seht, AWK reicht."}, {"id": 419, "start": 1398.36, "end": 1402.36, "text": "Ich habe vier Millionen Tabs. Ja, Moment, ich habe da noch Tabs."}, {"id": 420, "start": 1403.64, "end": 1409.64, "text": "Und, also wenn schon, wenn schon, denn richtig, ja. Ich habe da noch Tabs und"}, {"id": 421, "start": 1411.76, "end": 1413.76, "text": "ich glaube, hier habe ich letztens was, was zugemacht."}, {"id": 422, "start": 1415.28, "end": 1417.28, "text": "Und hier habe ich auch noch Tabs."}, {"id": 423, "start": 1417.28, "end": 1419.28, "text": "Und hier habe ich auch noch Tabs."}, {"id": 424, "start": 1424.04, "end": 1426.04, "text": "Hier habe ich auch noch Tabs."}, {"id": 425, "start": 1429.36, "end": 1431.96, "text": "Oh, da habe ich letztens zugemacht, es kamen noch Tabs offen."}, {"id": 426, "start": 1433.92, "end": 1435.92, "text": "Ja, so muss das sein."}, {"id": 427, "start": 1436.84, "end": 1438.52, "text": "Dark Zone."}, {"id": 428, "start": 1438.52, "end": 1444.52, "text": "Primers am Start hier, Dankeschön für den Zap. Die Kollegen brauchen noch ihre Excel Ansicht. Okay, okay,"}, {"id": 429, "start": 1444.52, "end": 1453.52, "text": "Excel ist in Ordnung, ist in Ordnung. Excel ist tatsächlich die einzige Office-Anwendung, so in diesen, diesen Kern-Office-Anwendungen,"}, {"id": 430, "start": 1453.52, "end": 1455.52, "text": "die ich irgendwo noch verstehe."}, {"id": 431, "start": 1461.4, "end": 1463.4, "text": "Der Prime-Sellout ist real."}, {"id": 432, "start": 1464.36, "end": 1466.36, "text": "Wie viel RAM ich habe?"}, {"id": 433, "start": 1466.36, "end": 1476.12, "text": "Ich glaube 32G. Ja, guck mal, es sind nur acht belegt, das ist ja fast nichts. Also da geht auf jeden Fall noch ein bisschen mehr."}, {"id": 434, "start": 1477.64, "end": 1482.68, "text": "PowerPoint, ne, PowerPoint mag ich überhaupt nicht. Ich musste letztens, ich habe doch am Montag eine Präsentation gehalten wieder"}, {"id": 435, "start": 1482.68, "end": 1486.16, "text": "und ich musste das in dem Fall mit PowerPoint machen, weil ja wieder"}, {"id": 436, "start": 1486.56, "end": 1491.12, "text": "Corporate Identity, PowerPoint-Vorlage, sonst rasten sie bei uns wieder aus."}, {"id": 437, "start": 1491.12, "end": 1497.56, "text": "Und PowerPoint, ich kriege Anfälle. Also das Einzige, was ich gerne mache, wenn ich so, wenn ich so Slides erstelle,"}, {"id": 438, "start": 1497.56, "end": 1502.56, "text": "stinkt noch mal Markdown untereinander, ein paar Bilder vielleicht noch zwischendurch, gut ist."}, {"id": 439, "start": 1505.04, "end": 1507.04, "text": "Was magst du lieber?"}, {"id": 440, "start": 1510.32, "end": 1512.32, "text": "Hä?"}, {"id": 441, "start": 1512.32, "end": 1514.32, "text": "Puh, Puh, was?"}, {"id": 442, "start": 1517.2, "end": 1519.2, "text": "Zwischen was?"}, {"id": 443, "start": 1519.2, "end": 1521.2, "text": "Zwischen was?"}, {"id": 444, "start": 1527.28, "end": 1534.76, "text": "Also und software für Präsentation. Wie gesagt, ich mache am liebsten ein paar Seiten Markdown und dann als PDF und gut ist."}, {"id": 445, "start": 1542.16, "end": 1545.4, "text": "Haben wir schon irgendwie einen neuen Red... Och hör mal auf, hör mal auf, ich habe es gesehen."}, {"id": 446, "start": 1545.4, "end": 1553.32, "text": "Ich mein, immerhin wird es als Android-Spielegerät verkauft und nicht wie dieses Logitech-Ding als reines Streaming-Ding, wo ich mir immer, immer frage,"}, {"id": 447, "start": 1553.32, "end": 1558.08, "text": "was, wie kommen die auf die Idee? Gut, ich habe es ja letztens im Stream schon erklärt, wie die auf so Ideen kommen."}, {"id": 448, "start": 1560.04, "end": 1562.04, "text": "Das liegt einfach am"}, {"id": 449, "start": 1562.96, "end": 1568.4, "text": "mittleren bis oberen Management, irgend einer pitcht komische Ideen und"}, {"id": 450, "start": 1568.4, "end": 1576.72, "text": "ja, keiner traut sich dann so wirklich, was dagegen zu sagen und alle machen mit, weil wenn einer nicht mitmacht, dann muss er sich anhören,"}, {"id": 451, "start": 1576.72, "end": 1584.92, "text": "ah, du hast einfach nur unsere Vision nicht verstanden. Und deswegen werden so komische Dinger gebaut, obwohl sie eigentlich offensichtlich"}, {"id": 452, "start": 1585.92, "end": 1587.92, "text": "keinen Sinn haben."}, {"id": 453, "start": 1587.92, "end": 1592.92, "text": "Nee, Excel habe ich auch nie verstanden, mache ich auch nicht, aber Excel ist das einzige der Office-Produkte, was irgendwie sinnvoll ist."}, {"id": 454, "start": 1592.92, "end": 1597.92, "text": "Excel ist quasi die IDE der Buchhaltung oder die IDE der Projekt-Manager."}, {"id": 455, "start": 1599.44, "end": 1603.44, "text": "Ich habe gestern von einem gehört, dass sie ein Ticketsystem über eine Shared Excel-Tabelle haben."}, {"id": 456, "start": 1603.44, "end": 1608.44, "text": "Ich glaube mal, dass das gar nicht so wenig verbreitet ist, ich glaube, das haben sogar relativ viele."}, {"id": 457, "start": 1608.44, "end": 1610.44, "text": "Guck mal, wie oft liest man das?"}, {"id": 458, "start": 1610.44, "end": 1618.44, "text": "Leute, dass das kleinere Firmen, kleinere Unternehmen einen Windows-Share haben, wo alles quasi drauf liegt, was sie haben, also alles."}, {"id": 459, "start": 1618.44, "end": 1624.44, "text": "Also quasi ihr Leben sozusagen, ihr digitales Firmenleben liegt auf dem Windows-Share."}, {"id": 460, "start": 1624.44, "end": 1630.44, "text": "Und was meint ihr, warum es so viele Kopie von Worddoc kopieren von Microsoft?"}, {"id": 461, "start": 1630.44, "end": 1644.44, "text": "Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie, Kopie von Worddoc gibt?"}, {"id": 462, "start": 1644.44, "end": 1646.44, "text": "Genau wegen so einem Blödsinn."}, {"id": 463, "start": 1646.44, "end": 1654.44, "text": "Weil die Leute auch 2022 immer noch nicht in der Lage sind, ihren Kram richtig zu bedienen."}, {"id": 464, "start": 1654.44, "end": 1657.08, "text": "sind ihren kram richtig zu bedienen"}, {"id": 465, "start": 1658.04, "end": 1663.82, "text": "Und das wird wahrscheinlich auch nicht so wird auch nie wieder so werden wissen ja früher dachte ich wir kommen uns gleich das feier schiff video an"}, {"id": 466, "start": 1663.82, "end": 1667.4, "text": "Und dann gucken wir uns den talk an da muss ich zum glück nicht so viel erzählen wobei"}, {"id": 467, "start": 1669.16, "end": 1674.32, "text": "Hast du ein nass wenn ja welches hatte mir vor einem jahr den ds 200"}, {"id": 468, "start": 1675.08, "end": 1676.64, "text": "Jott"}, {"id": 469, "start": 1676.64, "end": 1685.64, "text": "Ohne docker support von sein oligol sehr dumme entscheidung ich habe kein fertig nass ich habe ein mittlerweile ein hp"}, {"id": 470, "start": 1686.56, "end": 1688.08, "text": "microserver"}, {"id": 471, "start": 1688.08, "end": 1690.08, "text": "zehnte generation"}, {"id": 472, "start": 1690.16, "end": 1691.48, "text": "plus"}, {"id": 473, "start": 1691.48, "end": 1694.56, "text": "mit drei zehn terabyte platten drin"}, {"id": 474, "start": 1696.68, "end": 1698.68, "text": "Und das reicht"}, {"id": 475, "start": 1698.68, "end": 1705.72, "text": "Ab dir schon fliet angeguckt nein und ich weiß auch nicht wozu man fliet brauchen soll"}, {"id": 476, "start": 1708.88, "end": 1715.72, "text": "Ja ich weiß kaos fisch bei uns ist das teilweise auch so gerade was die personal abteilung angeht und sowas sind irgendwie 40"}, {"id": 477, "start": 1715.72, "end": 1718.48, "text": "Leute sind riesen also nur nur die"}, {"id": 478, "start": 1718.48, "end": 1720.48, "text": "Ähm"}, {"id": 479, "start": 1727.24, "end": 1731.52, "text": "Was für eine rate hast du laufen aktuell gar keins"}, {"id": 480, "start": 1734.6, "end": 1739.08, "text": "Ich habe zwei ich habe zwei der drei platten zusammengefasst zu einem 20 terabyte verbund"}, {"id": 481, "start": 1739.08, "end": 1745.92, "text": "So je bot"}, {"id": 482, "start": 1751.68, "end": 1755.36, "text": "Rate ist outdated in 2022 wer macht noch rate"}, {"id": 483, "start": 1761.68, "end": 1766.08, "text": "Dass wir sollen immer daten aus excel dateien aussehen die schaffens die brauchbar ach du kacke"}, {"id": 484, "start": 1766.08, "end": 1771.52, "text": "Ne zum glück nicht wobei wir nicht viel besser sind wir haben tatsächlich noch ein paar xml services"}, {"id": 485, "start": 1771.88, "end": 1775.08, "text": "Und csv dateien habe ich auch schon öfters gesehen bei uns"}, {"id": 486, "start": 1775.08, "end": 1791.76, "text": "Wo werden die dateien für das archiv gespeichert muss man in serious max fragen ich weiß es nicht wahrscheinlich bei google drive oder so"}, {"id": 487, "start": 1791.76, "end": 1793.76, "text": "Ja"}, {"id": 488, "start": 1803.0, "end": 1806.24, "text": "Ja gut so ist es ja ja so sehe ich das auch"}, {"id": 489, "start": 1807.24, "end": 1811.4, "text": "Du wirst ja du wirst ja in großen größeren unternehmen oftmals dazu erzogen"}, {"id": 490, "start": 1812.36, "end": 1814.36, "text": "schwachsinn"}, {"id": 491, "start": 1814.4, "end": 1819.32, "text": "Nicht mehr zu hinterfragen sie sagen das zwar immer aber sie wollen es nicht zum beispiel"}, {"id": 492, "start": 1819.32, "end": 1821.32, "text": "Geht hand in hand mit dem was ich gesagt habe"}, {"id": 493, "start": 1822.08, "end": 1827.08, "text": "Es werden halt da anreize gesetzt ist nicht zu sagen es wird immer erzählt ich weiß ich vielleicht kenne das von euch auf der arbeit"}, {"id": 494, "start": 1827.08, "end": 1829.88, "text": "Es wird immer gesagt wir wollen uns verbessern und immer wenn man es"}, {"id": 495, "start": 1830.2, "end": 1837.04, "text": "Verbesserungspotenzial erkennt soll man was sagen und wenn man was wenn man was sieht was nicht was man verbessern können immer was sagen"}, {"id": 496, "start": 1837.04, "end": 1844.52, "text": "Leute glaubt mir ich habe in der zeit wo ich da bin schon so oft wirklich so so oft was gesagt was meint ihr"}, {"id": 497, "start": 1845.16, "end": 1847.96, "text": "Bei wie viel sachen wo ich mal was erzählt habe ist was rausgekommen"}, {"id": 498, "start": 1847.96, "end": 1855.48, "text": "Und bei wieviel sachen von wo ich was dazu gesagt habe ist es im endeffekt negativ für mich gewesen weil ich mich am ende um teile davon kümmern musste"}, {"id": 499, "start": 1856.2, "end": 1860.84, "text": "also es ist komplett für den arsch weil und das ist das das ist meiner an meiner"}, {"id": 500, "start": 1861.4, "end": 1864.92, "text": "an persönlichen ansicht nach mit das größte problem was es"}, {"id": 501, "start": 1865.56, "end": 1870.32, "text": "in größeren unternehmen gibt wenn es um das thema innovation beziehungsweise eben"}, {"id": 502, "start": 1871.44, "end": 1876.96, "text": "Sachen gegen die wand fahren geht genau das was ich gerade zu dem logitech hand hält erzähle ein bisschen was was er hier auch auf der"}, {"id": 503, "start": 1876.96, "end": 1878.96, "text": "schreibt"}, {"id": 504, "start": 1880.28, "end": 1882.28, "text": "Irgendeiner kommt auf die idee"}, {"id": 505, "start": 1884.52, "end": 1892.8, "text": "Produkt oder oder service oder wir sollten jetzt x y z machen kommt er auf die idee so dann bespricht er das mit ein paar manager typen oder"}, {"id": 506, "start": 1894.16, "end": 1900.44, "text": "Pitch das mal einem seiner chefs oder ja macht da halt einen größeren vortrag drüber und irgendeiner der in der"}, {"id": 507, "start": 1902.28, "end": 1906.32, "text": "Position ist das entscheiden zu können der keine ahnung von diesem von dieser thematik hat"}, {"id": 508, "start": 1906.32, "end": 1910.8, "text": "Lässt sich das erklären und sagt jawoll gute idee das machen wir jetzt"}, {"id": 509, "start": 1911.64, "end": 1918.4, "text": "Die leute die planen von dem thema haben schlagen in dem moment die hände überm kopf zusammen und denken sich alter was ist das für ein undurchdachter"}, {"id": 510, "start": 1919.32, "end": 1920.92, "text": "käse"}, {"id": 511, "start": 1920.92, "end": 1922.92, "text": "So oder kommt das problem"}, {"id": 512, "start": 1923.72, "end": 1925.72, "text": "Dann sagen das ein paar leute"}, {"id": 513, "start": 1926.48, "end": 1932.04, "text": "So nach dem motto also an sich ja nett gedacht aber das und das und das"}, {"id": 514, "start": 1932.04, "end": 1938.72, "text": "Ergibt keinen sinn und das und dass wir sofort probleme machen und wir haben doch sowas auch schon mal probiert und das ging doch nicht"}, {"id": 515, "start": 1938.72, "end": 1945.44, "text": "Weil so und so und dann wird den leuten gesagt das kannst du gar nicht wissen ob das diesmal auch wieder in die hose geht"}, {"id": 516, "start": 1946.4, "end": 1948.4, "text": "viel wichtiger ist"}, {"id": 517, "start": 1948.4, "end": 1952.4, "text": "Damit das klappt dass alle an unsere vision glauben"}, {"id": 518, "start": 1953.08, "end": 1954.48, "text": "also"}, {"id": 519, "start": 1954.48, "end": 1958.32, "text": "Wenn man diese kombination hört an wie vision und man muss dran glauben"}, {"id": 520, "start": 1958.32, "end": 1965.4, "text": "das das nimmt dann schon religiöse züge an und da ist ein jeglicher zug abgefahren weil das läuft dann darauf"}, {"id": 521, "start": 1965.96, "end": 1969.64, "text": "raus dass quasi selbst bei der fertigstellung noch"}, {"id": 522, "start": 1971.32, "end": 1979.12, "text": "Komplett die augen davor verschlossen wird dass man eigentlich die sachen entweder an dem vorbei entwickelt hat was es sein sollte oder die hälfte"}, {"id": 523, "start": 1979.12, "end": 1981.12, "text": "Eigentlich gar nicht umgesetzt hat"}, {"id": 524, "start": 1981.12, "end": 1984.88, "text": "Weil es wieder raus definiert wurde oder sonst was aber du musst an die vision glauben"}, {"id": 525, "start": 1984.88, "end": 1986.32, "text": "Und"}, {"id": 526, "start": 1986.32, "end": 1991.2, "text": "Dann ist dann ist eigentlich vorbei sieht man war wisst ihr was das wisst ihr was das beste"}, {"id": 527, "start": 1991.76, "end": 1993.48, "text": "Prominenteste"}, {"id": 528, "start": 1993.48, "end": 2000.2, "text": "Beispiel dafür ist dass es bei vielen großen unternehmen und auch bei weltklasse unternehmen so läuft facebook metaverse"}, {"id": 529, "start": 2001.68, "end": 2005.84, "text": "Die leute die an dem an dieser an dieser metaverse geschichte programmieren"}, {"id": 530, "start": 2006.48, "end": 2011.6, "text": "Die machen jeden tag wenn sie das sehen dass hier das hier machen die gehen an rechner und machen das hier"}, {"id": 531, "start": 2011.6, "end": 2013.6, "text": "Die gehen an rechner und machen das hier"}, {"id": 532, "start": 2017.32, "end": 2020.24, "text": "Und danach machen sie noch mal das und danach machen sie das hier"}, {"id": 533, "start": 2023.04, "end": 2029.72, "text": "Und dann denken sie sich an was für einem kack muss ich hier eigentlich arbeiten dann machen sie in konto stand auf und denken sich"}, {"id": 534, "start": 2029.72, "end": 2031.72, "text": "erst mal"}, {"id": 535, "start": 2033.4, "end": 2038.48, "text": "Und denken weiter ja gut ich muss den kram ja nur proktur programmieren benutzen muss ich ihn ja nicht"}, {"id": 536, "start": 2038.48, "end": 2044.0, "text": "Und dann kommt ihr chef und jetzt kommt das ist kein witz das ging letztens erst durch die news"}, {"id": 537, "start": 2044.0, "end": 2051.28, "text": "Das ging letztens erst durch die news und dann schreibt moment ich zeige euch das facebook oder haben wir das nicht bei golem irgendwo gelesen"}, {"id": 538, "start": 2051.68, "end": 2053.68, "text": "golem facebook metaverse"}, {"id": 539, "start": 2057.84, "end": 2059.84, "text": "Irgendwas mit lieben hieß das"}, {"id": 540, "start": 2061.84, "end": 2062.84, "text": "Ja"}, {"id": 541, "start": 2062.84, "end": 2063.92, "text": "so"}, {"id": 542, "start": 2063.92, "end": 2066.84, "text": "Die programmierer von meta von diese metaverse"}, {"id": 543, "start": 2066.84, "end": 2068.84, "text": "Die haben selber kein bock das zu verwenden"}, {"id": 544, "start": 2070.12, "end": 2074.36, "text": "guck der schreibt der der projekt manager davon schreibt"}, {"id": 545, "start": 2075.56, "end": 2078.12, "text": "Auf die frah also es geht darum warum die eigenen"}, {"id": 546, "start": 2078.76, "end": 2082.6, "text": "Mitarbeiter die meta die das metaverse entwickeln das metaverse nicht verwenden"}, {"id": 547, "start": 2083.32, "end": 2088.84, "text": "Und dann fragt er warum ist das so warum lieben wir das produkt dass wir entwickelt haben nicht so sehr"}, {"id": 548, "start": 2089.08, "end": 2092.6, "text": "Dass wir es ständig verwenden weil es ein scheiß produkt ist"}, {"id": 549, "start": 2092.6, "end": 2096.52, "text": "Und keiner aus irgendwie als irgendwelche desillusionierte"}, {"id": 550, "start": 2097.96, "end": 2099.96, "text": "schmalspur manager"}, {"id": 551, "start": 2100.6, "end": 2102.6, "text": "Glauben an dieses produkt aber"}, {"id": 552, "start": 2103.48, "end": 2109.44, "text": "Niemand darf es öffentlich sagen dass er nicht dran glaubt weil ansonsten kriegt er erzählt du glaubst ja nicht an unsere vision"}, {"id": 553, "start": 2109.44, "end": 2112.48, "text": "Und du kannst das doch gar nicht wissen reden das war nicht schlecht"}, {"id": 554, "start": 2113.12, "end": 2115.12, "text": "Schmalspur das hat mein opa immer gesagt"}, {"id": 555, "start": 2115.4, "end": 2120.12, "text": "Das hat mein opa immer gesagt es passt wunderbar dabei weil mein opa hat immer gesagt schmalspur"}, {"id": 556, "start": 2120.12, "end": 2125.96, "text": "Denker zu solche leute das passt eigentlich ganz gut so und es hat das fazit wenn wir es nicht lieben"}, {"id": 557, "start": 2125.96, "end": 2131.8, "text": "Wie können wir erwarten dass unsere benutzer es lieben ihr könnt es nicht erwarten dass ich scheiße niemand liebt das"}, {"id": 558, "start": 2132.68, "end": 2134.68, "text": "oh"}, {"id": 559, "start": 2136.68, "end": 2138.68, "text": "Ich habe"}, {"id": 560, "start": 2138.68, "end": 2143.72, "text": "Ich weiß nicht ob ich rauschen gehört habe ich habe gerade den klinkelstecker weil ich ein bisschen auf dem tisch gehören habe ich habe gerade den klinkelstecker"}, {"id": 561, "start": 2143.72, "end": 2147.64, "text": "von meinen hotsprechern irgendwie durch durch vibrationen auf den klinkelstecker"}, {"id": 562, "start": 2147.64, "end": 2155.16, "text": "Irgendwie durch durch vibrationen auf dem tisch an an den klinkelstecker von meinem mikro dran gemacht und das gab ganz komische geräusche"}, {"id": 563, "start": 2157.08, "end": 2161.88, "text": "Ist metaverse von raus das ist so work in progress work in progress ist auch so eine tolle sache"}, {"id": 564, "start": 2162.28, "end": 2166.4, "text": "So und danach hat er das das hat er hat er rumgeschrieben und da haben sich die leute gedacht"}, {"id": 565, "start": 2167.28, "end": 2173.8, "text": "Who cares alter was der typ erzählt und jetzt kommt der hit und jetzt und jetzt kommt der hit die ich wette mit euch die"}, {"id": 566, "start": 2173.8, "end": 2181.68, "text": "Entwickler haben darauf entweder nur die augen gerollt weil sie das schon kennen oder haben halt noch mal gesagt leute das was wir hier bauen"}, {"id": 567, "start": 2181.68, "end": 2183.98, "text": "ist kompletter kompletter blödsinn"}, {"id": 568, "start": 2185.2, "end": 2191.12, "text": "Warum wir das nicht benutzen weil wir den sinn reine nicht sehen das zu benutzen guckt euch mal die entwickler von vr chat an und so"}, {"id": 569, "start": 2191.12, "end": 2196.16, "text": "Was die benutzen ihren kram so ein paar wochen später kam dann das da von ihm von dem von dem gleichen manager dude"}, {"id": 570, "start": 2196.64, "end": 2202.76, "text": "Jeder in dieser organisation hat den job sich in horizon worlds zu verlieben wir können das nicht"}, {"id": 571, "start": 2202.76, "end": 2208.84, "text": "Wir können das nicht tun ohne es zu verwenden kommt da rein also sprich das ist genau das was ich gesagt habe"}, {"id": 572, "start": 2209.28, "end": 2211.88, "text": "Es ist offensichtlich bullshit die leute"}, {"id": 573, "start": 2212.64, "end": 2217.76, "text": "Wissen dass es bullshit ist die da dran aber sie die ahnung haben von der technik wissen dass es bullshit ist"}, {"id": 574, "start": 2218.28, "end": 2225.2, "text": "Die haben das sicherlich auch schon gesagt aber wenn du es sagst heißt das du darfst das nicht sagen du musst an die vision glauben"}, {"id": 575, "start": 2225.2, "end": 2232.12, "text": "Und deswegen klappt das nicht das ist in ganz vielen großen unternehmen verbreitet diese denkweise"}, {"id": 576, "start": 2237.88, "end": 2243.2, "text": "Niemand will diesen kram verwendet was zum teufel das das das sieht fast schlechter aus wie second life"}, {"id": 577, "start": 2244.28, "end": 2246.28, "text": "1995 ne wann kam second life raus"}, {"id": 578, "start": 2246.84, "end": 2248.84, "text": "2003"}, {"id": 579, "start": 2248.84, "end": 2255.0, "text": "Das sieht das wie viel schafft man das das sieht das sieht schlechter aus als second life oder spielt keiner mehr"}, {"id": 580, "start": 2257.56, "end": 2263.24, "text": "Okay, ich bin mir gar nicht sicher ob es schlechter auswählert second life die sind kämpel überhaupt noch jemand"}, {"id": 581, "start": 2264.6, "end": 2266.6, "text": "ich mein"}, {"id": 582, "start": 2269.0, "end": 2271.88, "text": "Sagen wir mal es sieht nicht na ja"}, {"id": 583, "start": 2271.88, "end": 2277.68, "text": "Ja doch das sieht schlechter aus als second life"}, {"id": 584, "start": 2283.56, "end": 2288.4, "text": "Jetzt sieht aus wie mich charaktere und nicht gekonnt es sieht ein bisschen aus wie die alten xbox avatare"}, {"id": 585, "start": 2292.6, "end": 2297.04, "text": "Ich mein second life hat wenigstens so umgebung ich meine was ist denn das hier"}, {"id": 586, "start": 2297.88, "end": 2300.08, "text": "Was ist denn das was sollten das hier neben sein?"}, {"id": 587, "start": 2300.08, "end": 2303.4, "text": "Ein ein quadrat mit nichts oder wie"}, {"id": 588, "start": 2306.24, "end": 2308.24, "text": "Und beine haben sie auch nicht"}, {"id": 589, "start": 2315.12, "end": 2317.12, "text": "Also"}, {"id": 590, "start": 2317.68, "end": 2322.68, "text": "So und das ist tatsächlich das problem was in vielen großen unternehmen meiner meinung nach herrscht"}, {"id": 591, "start": 2322.68, "end": 2329.68, "text": "Und warum da auch innovationstechnik oftmals nicht viel bei rumkommt"}, {"id": 592, "start": 2330.84, "end": 2336.28, "text": "Kann man second life sehr keine ahnung das spiel interessiert mich eigentlich überhaupt nicht"}, {"id": 593, "start": 2336.28, "end": 2341.64, "text": "So wir gucken jetzt das neue leute wir können wir haben nur noch eine stunde zeit ich kann wir können das talk video nicht gucken"}, {"id": 594, "start": 2342.72, "end": 2345.52, "text": "Ich wollte mit euch eigentlich hier den talk angucken"}, {"id": 595, "start": 2346.36, "end": 2349.16, "text": "Können wir uns können wir uns dann morgen oder so angucken mal schauen"}, {"id": 596, "start": 2349.16, "end": 2355.56, "text": "Also die ersten viertel stunde fand ich wirklich fand ich wir können einfach die hälfte wir können einfach wir können einfach wir können einfach anfangen zu gucken"}, {"id": 597, "start": 2356.44, "end": 2362.68, "text": "Aber vorher so vorher sollte ich ja noch das fire ship video gucken mein ihr ja dann gucken wir uns wir gucken wir das fire ship video an"}, {"id": 598, "start": 2363.48, "end": 2371.8, "text": "Also also wir wissen ja prinzipiell einfach keine fehler programmieren dann braucht man nämlich keine tests und keine dokumentation schreiben"}, {"id": 599, "start": 2372.6, "end": 2374.6, "text": "Just just no error"}, {"id": 600, "start": 2374.6, "end": 2380.16, "text": "Programmer ist to never write any bugs unfortunately. That's virtually impossible when your code is I'm"}, {"id": 601, "start": 2380.96, "end": 2384.56, "text": "Da hat er bei mir noch nie im stream geguckt wir machen nie fehler im stream"}, {"id": 602, "start": 2385.52, "end": 2389.32, "text": "Es läuft alles immer first try first try only programming"}, {"id": 603, "start": 2390.72, "end": 2396.6, "text": "It's your own code to blame you cannot blame me however about zero point nine nine percent of the time"}, {"id": 604, "start": 2396.6, "end": 2399.28, "text": "It's the fault of somebody else on your team and you can get it"}, {"id": 605, "start": 2399.28, "end": 2405.6, "text": "Natürlich natürlich, aber die other point zero zero nine nine percent of the time"}, {"id": 606, "start": 2405.6, "end": 2409.08, "text": "It's a bug in some shady library you downloaded from NPM oder"}, {"id": 607, "start": 2409.88, "end": 2414.04, "text": "NPM hat mal wieder irgendwelche packages gelöscht wobei das geht glaube ich mittlerweile gar nicht mehr"}, {"id": 608, "start": 2414.04, "end": 2418.76, "text": "Which means you'll have to open up an issue on its github repo or fix it yourself and open a pull request"}, {"id": 609, "start": 2418.76, "end": 2425.92, "text": "Or just build your own new library from scratch. However, the other point oder werft diesen Müll raus niemand braucht ist odd und ist even"}, {"id": 610, "start": 2425.92, "end": 2429.88, "text": "Als NPM, aber es gibt es trotzdem 0 0 0 0 9 9 percent of the time"}, {"id": 611, "start": 2429.88, "end": 2436.0, "text": "It's the programming language or compiler itself to blame. Ja oder es ist jetzt wo wir ihn kann sehen oder es ist c plus plus"}, {"id": 612, "start": 2436.0, "end": 2438.56, "text": "Dann ist 99 prozent der zeit die sprache"}, {"id": 613, "start": 2438.56, "end": 2443.68, "text": "Or compiler itself to blame in which case you'll need to get in touch with some people much smarter than yourself"}, {"id": 614, "start": 2443.68, "end": 2448.4, "text": "You determine it's not a bug with the compiler, but it's an edge case that happens point zero zero zero zero zero"}, {"id": 615, "start": 2448.4, "end": 2456.64, "text": "zero zero zero zero zero zero nine nine nine nine actual hardware is to blame like one transistor was placed just a few nanometers to the left"}, {"id": 616, "start": 2456.64, "end": 2460.84, "text": "And that's why your website doesn't look quite right on a Blackberry, but the hardware people say it's not their fault"}, {"id": 617, "start": 2460.84, "end": 2466.72, "text": "It's actually just an edge case that happens point zero zero zero zero zero zero one percent of the time where your code is just not"}, {"id": 618, "start": 2466.72, "end": 2472.04, "text": "Compatible with the laws of quantum superposition due to a defect in the simulation in which we live in other words"}, {"id": 619, "start": 2472.04, "end": 2474.6, "text": "It's God's will that thou code shall not work"}, {"id": 620, "start": 2474.6, "end": 2477.8, "text": "Luckily bugs like this are pretty rare and it just doesn't work"}, {"id": 621, "start": 2477.8, "end": 2484.74, "text": "Was hast du gegen C++?"}, {"id": 622, "start": 2484.74, "end": 2486.32, "text": "Leider nichts wirksames."}, {"id": 623, "start": 2486.32, "end": 2502.8, "text": "Ja, außer es ist C++."}, {"id": 624, "start": 2502.8, "end": 2527.4, "text": "C++ ist schon blazingly fast, bis es abkackt, weil du irgendwo dir selbst in Fuß geschossen"}, {"id": 625, "start": 2527.4, "end": 2528.4, "text": "hast."}, {"id": 626, "start": 2528.4, "end": 2541.04, "text": "Erinnert sich noch jemand an den Debian Random-Nummer-Generator, der gewürfelt hat und immer 5 rauskam?"}, {"id": 627, "start": 2541.04, "end": 2542.04, "text": "Error-Messages."}, {"id": 628, "start": 2542.04, "end": 2555.84, "text": "Spaß beiseite, Error-Messages ist der Grund, weil es ja öfters mal gefragt wird, warum"}, {"id": 629, "start": 2555.84, "end": 2559.24, "text": "ich mein Windows und die ganzen Sachen immer auf Englisch stehen habe."}, {"id": 630, "start": 2559.24, "end": 2563.88, "text": "Ich verwende deutsches Tastatur-Layout und das ist ja alles kein Problem, aber ich habe"}, {"id": 631, "start": 2563.88, "end": 2567.44, "text": "alles immer auf Englisch stehen, gerade, dass man solche Meldungen ordentlich googeln kann."}, {"id": 632, "start": 2567.44, "end": 2573.0, "text": "Stellt euch mal vor, stelle mal solche Microsoft Meldungen vor auf Deutsch, da findest du nichts"}, {"id": 633, "start": 2573.0, "end": 2574.0, "text": "dazu."}, {"id": 634, "start": 2574.0, "end": 2578.76, "text": "Guck mal, wie hätte Microsoft diesen Kram übersetzt?"}, {"id": 635, "start": 2578.76, "end": 2589.68, "text": "Windows muss neu gestartet werden, weil ein entfernter Prozedurenaufruf-Dienst unerwartet"}, {"id": 636, "start": 2589.68, "end": 2591.36, "text": "sich beendet hat."}, {"id": 637, "start": 2591.36, "end": 2600.64, "text": "Dann würdest du dir denken, was, was wollt ihr von mir, copy-paste den Kram, auf Englisch"}, {"id": 638, "start": 2600.64, "end": 2601.64, "text": "findest du sofort was."}, {"id": 639, "start": 2601.64, "end": 2615.08, "text": "Das ist korrekt."}, {"id": 640, "start": 2615.08, "end": 2619.0, "text": "Einfach so lange Sachen reincopy-pasten an andere Stellen, bis es keinen Fehler mehr"}, {"id": 641, "start": 2619.0, "end": 2620.0, "text": "hat, das ist eine gute Idee."}, {"id": 642, "start": 2620.0, "end": 2622.0, "text": "Sogar alles Stack-Overflow-Triffen-Programming."}, {"id": 643, "start": 2622.0, "end": 2644.12, "text": "Das ist tatsächlich eine Wissenschaft für sich, also von dieser Meldung würde ich wahrscheinlich"}, {"id": 644, "start": 2644.12, "end": 2646.96, "text": "das da copy-pasten oder das da, ohne den Doppelpunkt."}, {"id": 645, "start": 2646.96, "end": 2653.68, "text": "Oder vielleicht würde ich sogar nur Call-Stack-Exceeded, das würde ich Quoten und Paisen oder Javascript"}, {"id": 646, "start": 2653.68, "end": 2656.52, "text": "dabei eingeben, je nachdem um was es geht."}, {"id": 647, "start": 2656.52, "end": 2659.84, "text": "Nicht die ganze Meldung kannst du meistens auch nicht wirklich mit anfangen."}, {"id": 648, "start": 2659.84, "end": 2660.84, "text": "Ja, genau, genau, genau."}, {"id": 649, "start": 2660.84, "end": 2661.84, "text": "So macht man das."}, {"id": 650, "start": 2661.84, "end": 2662.84, "text": "Da sieht man es ein erfahrener Googler."}, {"id": 651, "start": 2662.84, "end": 2692.84, "text": "Ja, Console-Write-Line-Debugging, beste, W"}, {"id": 652, "start": 2692.84, "end": 2715.4, "text": "Ausgaben brauchst du trotzdem noch, weil der User möchte ja manchmal wissen, was passiert."}, {"id": 653, "start": 2715.4, "end": 2742.16, "text": "Das ist nicht etwa, um festzustellen, dass etwas Falsches passiert, sondern einfach nur das, das was"}, {"id": 654, "start": 2742.16, "end": 2743.16, "text": "passiert."}, {"id": 655, "start": 2743.16, "end": 2744.16, "text": "Und was passiert?"}, {"id": 656, "start": 2744.16, "end": 2773.92, "text": "Und was passiert?"}, {"id": 657, "start": 2773.92, "end": 2803.68, "text": "Und was passiert?"}, {"id": 658, "start": 2803.68, "end": 2833.44, "text": "Und was passiert?"}, {"id": 659, "start": 2833.44, "end": 2863.2, "text": "Und was passiert?"}, {"id": 660, "start": 2863.2, "end": 2892.96, "text": "Und was passiert?"}, {"id": 661, "start": 2892.96, "end": 2922.72, "text": "Und was passiert?"}, {"id": 662, "start": 2922.72, "end": 2952.48, "text": "Und was passiert?"}, {"id": 663, "start": 2952.72, "end": 2982.48, "text": "Und was passiert?"}, {"id": 664, "start": 2982.48, "end": 3012.24, "text": "Und was passiert?"}, {"id": 665, "start": 3012.48, "end": 3042.24, "text": "Und was passiert?"}, {"id": 666, "start": 3042.48, "end": 3072.24, "text": "Und was passiert?"}, {"id": 667, "start": 3072.48, "end": 3102.24, "text": "Und was passiert?"}, {"id": 668, "start": 3102.24, "end": 3132.0, "text": "Und was passiert?"}, {"id": 669, "start": 3102.24, "end": 3132.0, "text": "Und was passiert?"}, {"id": 670, "start": 3102.24, "end": 3132.0, "text": "Und was passiert?"}, {"id": 671, "start": 3132.0, "end": 3159.76, "text": "Und was passiert?"}, {"id": 672, "start": 3132.0, "end": 3159.76, "text": "Und was passiert?"}, {"id": 673, "start": 3132.0, "end": 3159.76, "text": "Und was passiert?"}, {"id": 674, "start": 3132.0, "end": 3159.76, "text": "Und was passiert?"}, {"id": 675, "start": 3159.76, "end": 3161.76, "text": "Anderer fällt mir grad nicht ein."}, {"id": 676, "start": 3162.76, "end": 3164.76, "text": "Ich hab mich sogar letztens im Stream kaputt gemacht."}, {"id": 677, "start": 3168.76, "end": 3170.76, "text": "Ich glaub, ich glaub, ähm..."}, {"id": 678, "start": 3172.76, "end": 3174.76, "text": "Nee, Fiat AP Response kann ich nicht testen, gescheit."}, {"id": 679, "start": 3174.76, "end": 3176.76, "text": "Ja, aber ich hab mir überlegt tatsächlich,"}, {"id": 680, "start": 3176.76, "end": 3179.76, "text": "ich sollte da mal ein paar Tests rein machen."}, {"id": 681, "start": 3179.76, "end": 3187.76, "text": "Dass ich nicht jedes Mal alles von Hand ausprobieren muss, ob's noch funktioniert."}, {"id": 682, "start": 3203.76, "end": 3207.76, "text": "Am besten, am besten sind ja Tests, wo dann getestet wird,"}, {"id": 683, "start": 3207.76, "end": 3209.76, "text": "die Ausgabe muss fünf sein."}, {"id": 684, "start": 3211.76, "end": 3213.76, "text": "Dann schlägt der Test fehl."}, {"id": 685, "start": 3213.76, "end": 3215.76, "text": "Keiner weiß genau warum."}, {"id": 686, "start": 3215.76, "end": 3218.76, "text": "Die Ausgabe ist jetzt auf einmal sieben."}, {"id": 687, "start": 3218.76, "end": 3222.76, "text": "Und, naja, aber es hat nicht so große Auswirkungen."}, {"id": 688, "start": 3222.76, "end": 3224.76, "text": "Also schreiben wir einfach in den Tests rein,"}, {"id": 689, "start": 3224.76, "end": 3226.76, "text": "Ausgabe kann fünf oder sieben sein."}, {"id": 690, "start": 3226.76, "end": 3228.76, "text": "Auf vier oder sieben war das okay."}, {"id": 691, "start": 3228.76, "end": 3235.76, "text": "In einem Matlab hab ich nie was hingebastelt."}, {"id": 692, "start": 3245.76, "end": 3247.76, "text": "Ist das etwa Rust?"}, {"id": 693, "start": 3247.76, "end": 3249.76, "text": "Ach nein, es ist TypeScript."}, {"id": 694, "start": 3250.76, "end": 3252.76, "text": "Nicht Blazinklyfast."}, {"id": 695, "start": 3252.76, "end": 3255.76, "text": "Tja, wenn man gescheite Sprachen verwendet,"}, {"id": 696, "start": 3255.76, "end": 3257.76, "text": "dann gibt's das Problem nicht."}, {"id": 697, "start": 3257.76, "end": 3259.76, "text": "Naja, gut."}, {"id": 698, "start": 3259.76, "end": 3261.76, "text": "Außer es ist C++."}, {"id": 699, "start": 3262.76, "end": 3265.76, "text": "Wobei, hey, das kann man C++ nicht vorwerfen."}, {"id": 700, "start": 3265.76, "end": 3268.76, "text": "Also, das funktioniert in C++ meistens tatsächlich ganz gut."}, {"id": 701, "start": 3268.76, "end": 3270.76, "text": "Außer man übertreibt's mit Templates."}, {"id": 702, "start": 3270.76, "end": 3273.76, "text": "Ja, bei Python hast du eh komplett verloren."}, {"id": 703, "start": 3274.76, "end": 3276.76, "text": "Was, äh, sowas mit Types."}, {"id": 704, "start": 3276.76, "end": 3278.76, "text": "Wobei, selbst Python mittlerweile, glaub ich,"}, {"id": 705, "start": 3278.76, "end": 3280.76, "text": "Types ist nicht so wichtig."}, {"id": 706, "start": 3280.76, "end": 3282.76, "text": "Selbst Python mittlerweile, glaube ich,"}, {"id": 707, "start": 3282.76, "end": 3284.76, "text": "Type Annotations und so Zeug."}, {"id": 708, "start": 3284.76, "end": 3311.76, "text": "Hab ich letztens gerade erst wieder was drüber gelesen."}, {"id": 709, "start": 3315.76, "end": 3318.76, "text": "Die damals für'n Stuss erzählt haben in der Werbung."}, {"id": 710, "start": 3326.76, "end": 3329.76, "text": "Und die deutsche Bahn, die ist auch dort schon."}, {"id": 711, "start": 3330.76, "end": 3332.76, "text": "Du musst den ganzen Tag mit der Bahn fahren"}, {"id": 712, "start": 3332.76, "end": 3334.76, "text": "und dabei Java programmieren."}, {"id": 713, "start": 3334.76, "end": 3337.76, "text": "Thanks for watching and I will see you in the next one."}, {"id": 714, "start": 3338.76, "end": 3341.76, "text": "Excellent. Jetzt haben wir wieder was gelernt."}, {"id": 715, "start": 3341.76, "end": 3342.76, "text": "Wobei wir..."}, {"id": 716, "start": 3342.76, "end": 3343.76, "text": "In this video."}, {"id": 717, "start": 3343.76, "end": 3344.76, "text": "What the..."}, {"id": 718, "start": 3344.76, "end": 3346.76, "text": "Nee, das wollte ich jetzt nicht gucken."}, {"id": 719, "start": 3350.76, "end": 3352.76, "text": "Was machst du eigentlich, wenn Chrome Manifest V3 kommt?"}, {"id": 720, "start": 3352.76, "end": 3355.76, "text": "Denn die haben's jetzt ja schon mal wieder in Java verschoben."}, {"id": 721, "start": 3355.76, "end": 3357.76, "text": "Was ist in Java so schlimm eigentlich?"}, {"id": 722, "start": 3357.76, "end": 3360.76, "text": "Nix. C++ ist die deutlich schlimmere Sprache."}, {"id": 723, "start": 3360.76, "end": 3362.76, "text": "Java ist absolut okay."}, {"id": 724, "start": 3362.76, "end": 3364.76, "text": "Gerade die Java VM ist gut."}, {"id": 725, "start": 3364.76, "end": 3366.76, "text": "Da kann man auch so was wie Kotlin dann verwenden,"}, {"id": 726, "start": 3366.76, "end": 3368.76, "text": "was noch mal was, zumindest von dem, was ich gesehen hab,"}, {"id": 727, "start": 3368.76, "end": 3370.76, "text": "noch mal annehmbarer ist."}, {"id": 728, "start": 3370.76, "end": 3372.76, "text": "Ja, noch mal ein bisschen schöner."}, {"id": 729, "start": 3372.76, "end": 3376.76, "text": "Nee, ganz im Ernst, ja, es herftet C Sharp an,"}, {"id": 730, "start": 3376.76, "end": 3378.76, "text": "dass es das Microsoft Java wäre."}, {"id": 731, "start": 3378.76, "end": 3381.76, "text": "Und ja, das hat auch gerade, weil es so super objektorientiert"}, {"id": 732, "start": 3381.76, "end": 3385.76, "text": "angefangen hat, mal gewisse Ähnlichkeiten gehabt."}, {"id": 733, "start": 3385.76, "end": 3387.76, "text": "Aber mittlerweile muss ich sagen,"}, {"id": 734, "start": 3387.76, "end": 3390.76, "text": "C Sharp macht Java echt nur noch was vor."}, {"id": 735, "start": 3390.76, "end": 3392.76, "text": "Ich weiß, ich hab die mittlerweile gescheite Generics"}, {"id": 736, "start": 3392.76, "end": 3394.76, "text": "überhaupt in Java."}, {"id": 737, "start": 3394.76, "end": 3396.76, "text": "Haben sie doch seit Jahren nicht drin."}, {"id": 738, "start": 3400.76, "end": 3402.76, "text": "Ihren komischen Optional Return Type,"}, {"id": 739, "start": 3402.76, "end": 3403.76, "text": "den keiner verwenden will,"}, {"id": 740, "start": 3403.76, "end": 3405.76, "text": "hab ich jetzt letztens in Artikel drüber gelesen."}, {"id": 741, "start": 3405.76, "end": 3409.76, "text": "Also, die bekleggern sich bei Java wirklich nicht mit Room."}, {"id": 742, "start": 3412.76, "end": 3414.76, "text": "Scala ist für alle,"}, {"id": 743, "start": 3414.76, "end": 3417.76, "text": "die gerne Klammern mögen."}, {"id": 744, "start": 3417.76, "end": 3420.76, "text": "Any Klammerfans?"}, {"id": 745, "start": 3420.76, "end": 3422.76, "text": "Any Klammers?"}, {"id": 746, "start": 3422.76, "end": 3424.76, "text": "Klingt bescheuert."}, {"id": 747, "start": 3424.76, "end": 3426.76, "text": "Ja, also Scala ist für alle."}, {"id": 748, "start": 3426.76, "end": 3428.76, "text": "Aber gut, noch schlimmer,"}, {"id": 749, "start": 3428.76, "end": 3430.76, "text": "noch schlimmer ist tatsächlich Erlang,"}, {"id": 750, "start": 3430.76, "end": 3432.76, "text": "was Klammern angeht."}, {"id": 751, "start": 3432.76, "end": 3434.76, "text": "Erlang by example."}, {"id": 752, "start": 3434.76, "end": 3436.76, "text": "Ja, ja, ich zeig mal hier Erlang."}, {"id": 753, "start": 3436.76, "end": 3438.76, "text": "Ah, yes."}, {"id": 754, "start": 3438.76, "end": 3440.76, "text": "Wobei, ganz im Ernst,"}, {"id": 755, "start": 3440.76, "end": 3442.76, "text": "das sieht sehr stark nach,"}, {"id": 756, "start": 3442.76, "end": 3444.76, "text": "das sieht sehr stark nach"}, {"id": 757, "start": 3444.76, "end": 3446.76, "text": "aus wie Sc sharp Pattern Matching."}, {"id": 758, "start": 3446.76, "end": 3448.76, "text": "Aber Erlang ist halt"}, {"id": 759, "start": 3448.76, "end": 3450.76, "text": "klammerig."}, {"id": 760, "start": 3458.76, "end": 3461.76, "text": "Ja gut, Lisp ist der Inbegriff von Klammern."}, {"id": 761, "start": 3465.76, "end": 3467.76, "text": "Deswegen wird sich mir auch nie erschließen,"}, {"id": 762, "start": 3467.76, "end": 3469.76, "text": "wie man auf die glorreiche Idee kam"}, {"id": 763, "start": 3469.76, "end": 3471.76, "text": "oder wie sie damals auf die Idee gekommen sind."}, {"id": 764, "start": 3471.76, "end": 3473.76, "text": "EMAX"}, {"id": 765, "start": 3473.76, "end": 3475.76, "text": "Lisp"}, {"id": 766, "start": 3475.76, "end": 3477.76, "text": "in Lisp Dialekt einzubauen."}, {"id": 767, "start": 3477.76, "end": 3479.76, "text": "Das ist wirklich das hässlichste, was ich kenne."}, {"id": 768, "start": 3481.76, "end": 3483.76, "text": "Gut, aber EMAX ist eh gestorben"}, {"id": 769, "start": 3483.76, "end": 3485.76, "text": "seit Visual Studio Code und Java"}, {"id": 770, "start": 3485.76, "end": 3487.76, "text": "Skript Erweiterbarkeit."}, {"id": 771, "start": 3487.76, "end": 3489.76, "text": "Gut, ich meine, ich gehe davon aus,"}, {"id": 772, "start": 3489.76, "end": 3491.76, "text": "dass er das hier anders sieht."}, {"id": 773, "start": 3493.76, "end": 3495.76, "text": "Wenn ich beim installieren der Java"}, {"id": 774, "start": 3495.76, "end": 3497.76, "text": "Runtime erstmal ein paar Browser Plugins"}, {"id": 775, "start": 3497.76, "end": 3499.76, "text": "weiß ich gar nicht, ob das mittlerweile"}, {"id": 776, "start": 3499.76, "end": 3501.76, "text": "noch so ist. Also unter Windows"}, {"id": 777, "start": 3501.76, "end": 3503.76, "text": "war das eh nur so, keine Ahnung."}, {"id": 778, "start": 3505.76, "end": 3507.76, "text": "Vim Skript, naja Vim Skript ist"}, {"id": 779, "start": 3507.76, "end": 3509.76, "text": "auch jetzt nicht schön,"}, {"id": 780, "start": 3509.76, "end": 3511.76, "text": "aber ganz ehrlich, Vim Skript ist"}, {"id": 781, "start": 3511.76, "end": 3513.76, "text": "mir rein von Syntax und sowas"}, {"id": 782, "start": 3513.76, "end": 3515.76, "text": "tatsächlich lieber als EMAX"}, {"id": 783, "start": 3515.76, "end": 3517.76, "text": "Lisp."}, {"id": 784, "start": 3519.76, "end": 3521.76, "text": "Gut, damals konnten sie noch nicht"}, {"id": 785, "start": 3521.76, "end": 3523.76, "text": "JavaScript einbauen, damals gab es JavaScript"}, {"id": 786, "start": 3523.76, "end": 3525.76, "text": "noch nicht."}, {"id": 787, "start": 3525.76, "end": 3527.76, "text": "Neo Vim macht es ja ein bisschen anders."}, {"id": 788, "start": 3527.76, "end": 3529.76, "text": "Die haben jetzt glaube ich Lua drinne."}, {"id": 789, "start": 3529.76, "end": 3531.76, "text": "Lua ist aber auch so eine komische"}, {"id": 790, "start": 3531.76, "end": 3533.76, "text": "Sprache. Sprachen, wo Arrays"}, {"id": 791, "start": 3533.76, "end": 3535.76, "text": "bei eins anfangen, sind mir prinzipiell"}, {"id": 792, "start": 3535.76, "end": 3537.76, "text": "suspekt. Kann man Java zu"}, {"id": 793, "start": 3537.76, "end": 3539.76, "text": "was im Kompilieren? Du kannst prinzipiell"}, {"id": 794, "start": 3539.76, "end": 3541.76, "text": "alles zu was im Kompilieren. Ob es da was"}, {"id": 795, "start": 3541.76, "end": 3543.76, "text": "gescheites für Java gibt, weiß ich nicht."}, {"id": 796, "start": 3543.76, "end": 3545.76, "text": "Also für C Sharp gibt es ja"}, {"id": 797, "start": 3545.76, "end": 3547.76, "text": "Blazer, bzw."}, {"id": 798, "start": 3549.76, "end": 3551.76, "text": "irgendwas anderes habe ich,"}, {"id": 799, "start": 3551.76, "end": 3553.76, "text": "ich glaube Uno hatte auch was für"}, {"id": 800, "start": 3553.76, "end": 3555.76, "text": "C Sharp zu WebAssembly."}, {"id": 801, "start": 3555.76, "end": 3557.76, "text": "Das Problem an Blazer ist nur,"}, {"id": 802, "start": 3557.76, "end": 3559.76, "text": "dass es nicht C Sharp zu WebAssembly"}, {"id": 803, "start": 3559.76, "end": 3561.76, "text": "kopiert, sondern"}, {"id": 804, "start": 3561.76, "end": 3563.76, "text": "die haben die.NET"}, {"id": 805, "start": 3563.76, "end": 3565.76, "text": "Runtime. Also sie haben"}, {"id": 806, "start": 3565.76, "end": 3567.76, "text": "Mono damals. Ich weiß nicht, ob es"}, {"id": 807, "start": 3567.76, "end": 3569.76, "text": "mittlerweile auf.NET Core Basis ist."}, {"id": 808, "start": 3569.76, "end": 3571.76, "text": "Die haben Mono zu WebAssembly"}, {"id": 809, "start": 3571.76, "end": 3573.76, "text": "kompiliert und laden dann das"}, {"id": 810, "start": 3573.76, "end": 3575.76, "text": "C Sharp da rein und lassen"}, {"id": 811, "start": 3575.76, "end": 3577.76, "text": "es dort ausführen. Dementsprechend ist"}, {"id": 812, "start": 3577.76, "end": 3579.76, "text": "Blazer alles andere als Blazing die fast"}, {"id": 813, "start": 3579.76, "end": 3581.76, "text": "und eigentlich total abartig."}, {"id": 814, "start": 3581.76, "end": 3583.76, "text": "Kann man JavaScript"}, {"id": 815, "start": 3583.76, "end": 3585.76, "text": "zu WebAssembly kompilieren? Ja, das geht."}, {"id": 816, "start": 3587.76, "end": 3589.76, "text": "Es gibt sogar mittlerweile schon"}, {"id": 817, "start": 3589.76, "end": 3591.76, "text": "Projekte für Server-Site WebAssembly."}, {"id": 818, "start": 3591.76, "end": 3593.76, "text": "Lacht nicht, das ist wirklich so."}, {"id": 819, "start": 3593.76, "end": 3595.76, "text": "Server-Site WebAssembly,"}, {"id": 820, "start": 3595.76, "end": 3597.76, "text": "das gibt es."}, {"id": 821, "start": 3597.76, "end": 3599.76, "text": "Das hört sich zwar erstmal widersprüchlich"}, {"id": 822, "start": 3599.76, "end": 3601.76, "text": "an, aber Server-Site WebAssembly"}, {"id": 823, "start": 3601.76, "end": 3603.76, "text": "ist ein Ding mittlerweile."}, {"id": 824, "start": 3605.76, "end": 3607.76, "text": "Kennst du einen Weg über einen ESP"}, {"id": 825, "start": 3607.76, "end": 3609.76, "text": "eine Webseite aufzurufen, die einen Login"}, {"id": 826, "start": 3609.76, "end": 3611.76, "text": "anbietet? Klar."}, {"id": 827, "start": 3611.76, "end": 3613.76, "text": "Der Standard WebClient kann"}, {"id": 828, "start": 3613.76, "end": 3615.76, "text": "zumindest Basic Auth."}, {"id": 829, "start": 3615.76, "end": 3617.76, "text": "Oder"}, {"id": 830, "start": 3617.76, "end": 3619.76, "text": "nimm irgendeinen x-beliebigen Http-Client."}, {"id": 831, "start": 3619.76, "end": 3621.76, "text": "Hab ich HTML-Client gesagt? Ich meine Http-Client."}, {"id": 832, "start": 3621.76, "end": 3623.76, "text": "Der Standard Http-Client"}, {"id": 833, "start": 3623.76, "end": 3625.76, "text": "kann auf jeden Fall Basic Auth."}, {"id": 834, "start": 3625.76, "end": 3627.76, "text": "Ansonsten nimmst du irgendeinen anderen"}, {"id": 835, "start": 3627.76, "end": 3629.76, "text": "Http-Client"}, {"id": 836, "start": 3629.76, "end": 3631.76, "text": "für Arduino bzw."}, {"id": 837, "start": 3631.76, "end": 3633.76, "text": "ESPs. Gibt es massig."}, {"id": 838, "start": 3633.76, "end": 3635.76, "text": "Gibt es massig auf"}, {"id": 839, "start": 3635.76, "end": 3637.76, "text": "GitHub. Aber der offizielle kann das"}, {"id": 840, "start": 3637.76, "end": 3639.76, "text": "relativ sicher alles was du brauchst."}, {"id": 841, "start": 3641.76, "end": 3643.76, "text": "War das nicht so ein Delphi"}, {"id": 842, "start": 3643.76, "end": 3645.76, "text": "Verschnitt?"}, {"id": 843, "start": 3645.76, "end": 3647.76, "text": "Warum Server-Site"}, {"id": 844, "start": 3647.76, "end": 3649.76, "text": "JavaScript?"}, {"id": 845, "start": 3651.76, "end": 3653.76, "text": "Dass die ganzen Frontend-Dudes sich auslassen"}, {"id": 846, "start": 3653.76, "end": 3655.76, "text": "können überall."}, {"id": 847, "start": 3655.76, "end": 3657.76, "text": "Danke schön für den Sub."}, {"id": 848, "start": 3657.76, "end": 3659.76, "text": "So, wir gucken jetzt aber trotzdem"}, {"id": 849, "start": 3659.76, "end": 3661.76, "text": "noch ein bisschen die"}, {"id": 850, "start": 3661.76, "end": 3663.76, "text": "den Konferenz-Talk."}, {"id": 851, "start": 3663.76, "end": 3665.76, "text": "Wie gesagt, ich habe heute die erste"}, {"id": 852, "start": 3665.76, "end": 3667.76, "text": "wir können es wahrscheinlich nicht ganz fertig gucken heute"}, {"id": 853, "start": 3667.76, "end": 3669.76, "text": "gerade wenn ich zwischendurch wieder am labern bin."}, {"id": 854, "start": 3669.76, "end": 3671.76, "text": "Aber die erste"}, {"id": 855, "start": 3671.76, "end": 3673.76, "text": "wie gesagt, ich kenne den Talk nicht ganz."}, {"id": 856, "start": 3673.76, "end": 3675.76, "text": "Ich habe nur geguckt als er"}, {"id": 857, "start": 3675.76, "end": 3677.76, "text": "bis er Mosaik vorgestellt hat."}, {"id": 858, "start": 3677.76, "end": 3679.76, "text": "Ich fand das wirklich sehr spannend."}, {"id": 859, "start": 3679.76, "end": 3681.76, "text": "Ich habe die erste"}, {"id": 860, "start": 3681.76, "end": 3683.76, "text": "wie gesagt, ich kenne den Talk nicht ganz."}, {"id": 861, "start": 3683.76, "end": 3685.76, "text": "Ich habe nur geguckt als er"}, {"id": 862, "start": 3685.76, "end": 3687.76, "text": "bis er Mosaik vorgestellt hat."}, {"id": 863, "start": 3687.76, "end": 3689.76, "text": "Ich habe die erste"}, {"id": 864, "start": 3689.76, "end": 3691.76, "text": "wie gesagt, ich kenne den Talk nicht ganz."}, {"id": 865, "start": 3691.76, "end": 3693.76, "text": "Ich habe die erste"}, {"id": 866, "start": 3693.76, "end": 3695.76, "text": "wie gesagt, ich kenne den Talk nicht ganz."}, {"id": 867, "start": 3695.76, "end": 3697.76, "text": "Also das ist wirklich sehr spannend."}, {"id": 868, "start": 3697.76, "end": 3699.76, "text": "Der Typ"}, {"id": 869, "start": 3699.76, "end": 3701.76, "text": "ist glaube ich vom Microsoft Blazor"}, {"id": 870, "start": 3701.76, "end": 3703.78, "text": "Team, wo wir es gerade davon hatten."}, {"id": 871, "start": 3703.78, "end": 3705.38, "text": "Also die Technologie, die ich jetzt"}, {"id": 872, "start": 3705.38, "end": 3707.38, "text": "persönlich nicht so geil finde."}, {"id": 873, "start": 3707.38, "end": 3709.38, "text": "Aber ich fand den Vortrag gerade"}, {"id": 874, "start": 3709.38, "end": 3711.38, "text": "zur History von Browsern und"}, {"id": 875, "start": 3711.38, "end": 3713.72, "text": "JavaScript und der hat auch viele"}, {"id": 876, "start": 3713.72, "end": 3715.72, "text": "Interaktive Demos mit VMs mit Windows 95"}, {"id": 877, "start": 3715.72, "end": 3717.72, "text": "xl e-sports"}, {"id": 878, "start": 3717.72, "end": 3719.72, "text": "Wait a minute was"}, {"id": 879, "start": 3726.72, "end": 3729.48, "text": "Ist das ein witz oder ist das ernst gemeint"}, {"id": 880, "start": 3729.48, "end": 3741.4, "text": "All Star Battle xl e-sports das ist doch ein witz oder das ist doch irgendein"}, {"id": 881, "start": 3741.4, "end": 3751.4, "text": "Was zur Hölle ist das"}, {"id": 882, "start": 3751.4, "end": 3756.4, "text": "mit 410 point obwohl es sieht aus als ob er einen"}, {"id": 883, "start": 3756.4, "end": 3759.4, "text": "der falsch ist irgendwo da drin"}, {"id": 884, "start": 3759.4, "end": 3762.4, "text": "competitive xl ernsthaft"}, {"id": 885, "start": 3762.4, "end": 3764.4, "text": "also"}, {"id": 886, "start": 3764.4, "end": 3767.4, "text": "er erkennt dass er da ist"}, {"id": 887, "start": 3767.4, "end": 3771.4, "text": "es gibt ernsthaft competitive xl"}, {"id": 888, "start": 3775.4, "end": 3779.4, "text": "Machen die da grad Pegel oder sowas in xl"}, {"id": 889, "start": 3785.4, "end": 3787.4, "text": "xl gamedef da warte ich noch drauf"}, {"id": 890, "start": 3787.4, "end": 3797.4, "text": "Apm"}, {"id": 891, "start": 3797.4, "end": 3799.4, "text": "Apm Anzeige"}, {"id": 892, "start": 3805.4, "end": 3807.4, "text": "Ok komm wir mal kurz weiter"}, {"id": 893, "start": 3807.4, "end": 3814.4, "text": "xl on fire"}, {"id": 894, "start": 3814.4, "end": 3816.4, "text": "Was"}, {"id": 895, "start": 3816.4, "end": 3823.4, "text": "was das ist das ist doch das ist doch die die die diese die Firma von von von von"}, {"id": 896, "start": 3823.4, "end": 3828.4, "text": "Anders Anders oder wieder CS-Kommentator heißt"}, {"id": 897, "start": 3828.4, "end": 3830.4, "text": "Caster"}, {"id": 898, "start": 3830.4, "end": 3839.4, "text": "Wie viele views hat das 700.000 competitive xl ich fasse es nicht"}, {"id": 899, "start": 3845.4, "end": 3847.4, "text": "Competitive xl"}, {"id": 900, "start": 3847.4, "end": 3849.4, "text": "xl e-sport"}, {"id": 901, "start": 3849.4, "end": 3851.4, "text": "Oh Asiate easy easy win"}, {"id": 902, "start": 3851.4, "end": 3853.4, "text": "Wer denn der gewinnt easy"}, {"id": 903, "start": 3855.4, "end": 3857.4, "text": "Ok wer hat gewonnen"}, {"id": 904, "start": 3857.4, "end": 3860.4, "text": "tatsächlich ich wusste es"}, {"id": 905, "start": 3864.4, "end": 3868.4, "text": "Natürlich musste Asiate gewinnen easy easy win"}, {"id": 906, "start": 3868.4, "end": 3873.4, "text": "Denkt dran es gibt immer einen das besser kann als ihr selbst wenn ihr es gut könnt"}, {"id": 907, "start": 3873.4, "end": 3875.4, "text": "Pech gehabt"}, {"id": 908, "start": 3875.4, "end": 3877.4, "text": "Rekt"}, {"id": 909, "start": 3879.4, "end": 3885.4, "text": "Aber sie aber warum hat das das ist halbes Jahr für 700.000 Aufrufe geil"}, {"id": 910, "start": 3885.4, "end": 3887.4, "text": "Also"}, {"id": 911, "start": 3887.4, "end": 3890.4, "text": "Excel xl e-sports Hut ab"}, {"id": 912, "start": 3890.4, "end": 3892.4, "text": "Hut ab"}, {"id": 913, "start": 3892.4, "end": 3896.4, "text": "So wir gucken jetzt mal hier einfach von diesem Konferenztalk dass wir noch ein bisschen was bisschen was schauen können"}, {"id": 914, "start": 3896.4, "end": 3901.4, "text": "Wie gesagt ich habe geguckt so ungefähr bis hier wo er Mosaik gezeigt hat ich fand es echt spannend mal gucken ob das"}, {"id": 915, "start": 3901.4, "end": 3903.4, "text": "Ja die restliche Präsentation auch so gut ist"}, {"id": 916, "start": 3905.4, "end": 3907.4, "text": "Kurz gucken dass die Lautstärke stimmt"}, {"id": 917, "start": 3907.4, "end": 3911.4, "text": "All right, let's do this then so I know people walking in that's totally fine"}, {"id": 918, "start": 3912.4, "end": 3917.4, "text": "Well done to those of you who have made it here. Okay, ich gebe ich gebe mal kurz das intro"}, {"id": 919, "start": 3919.4, "end": 3923.4, "text": "So laut genug versteht man was bis sie lauter so"}, {"id": 920, "start": 3924.4, "end": 3927.4, "text": "blazer of the front end web stuff and"}, {"id": 921, "start": 3928.4, "end": 3932.4, "text": "I've worked with the web. I think for my whole professional career, which is quite a while"}, {"id": 922, "start": 3932.4, "end": 3936.4, "text": "And I really like it. I think it's a great area. So ist gut. So ist gut"}, {"id": 923, "start": 3937.4, "end": 3939.4, "text": "It's clearly very very important"}, {"id": 924, "start": 3939.4, "end": 3943.4, "text": "You know, there's pretty much every developer in the world has to do some stuff with web technology"}, {"id": 925, "start": 3944.4, "end": 3950.4, "text": "Das sage ich ja auch immer du kommst egal selbst wenn du cobalt mainframe entwickler bist du kommst nicht um web technologien vorbei"}, {"id": 926, "start": 3951.4, "end": 3953.4, "text": "So it's nice to be in that"}, {"id": 927, "start": 3953.4, "end": 3956.4, "text": "But it does keep changing right like let's be clear"}, {"id": 928, "start": 3956.4, "end": 3962.4, "text": "We're constantly inventing new ways of doing stuff over and over again and probably you would agree that"}, {"id": 929, "start": 3963.4, "end": 3965.4, "text": "Die interessanten sachen geht gleich los"}, {"id": 930, "start": 3965.4, "end": 3970.4, "text": "On average over time things get more complex rather than less complex"}, {"id": 931, "start": 3970.4, "end": 3972.4, "text": "And I sometimes wonder well, why is that?"}, {"id": 932, "start": 3972.4, "end": 3977.4, "text": "How did we get to this who decided to make up all these things and why did they do it?"}, {"id": 933, "start": 3977.4, "end": 3980.4, "text": "And like could they have done it differently? Was it all a big mistake?"}, {"id": 934, "start": 3980.4, "end": 3986.4, "text": "So that's kind of what this talk is designed to look into we're going to go back through some of the major events through web's history and"}, {"id": 935, "start": 3986.4, "end": 3991.4, "text": "See what happened and who the characters were what they decided to do and what they were offering"}, {"id": 936, "start": 3992.4, "end": 3996.4, "text": "Now obviously, this is just one person's subjective telling of the story"}, {"id": 937, "start": 3996.4, "end": 3999.4, "text": "It's not an absolute truth. Okay, ich weiß nicht, dass das intro so lang geht aber"}, {"id": 938, "start": 3999.4, "end": 4009.4, "text": "So jetzt noch mal"}, {"id": 939, "start": 4009.4, "end": 4015.4, "text": "Also mein personal favorite thing ist selbstverständlich Internet Explorer denke das sind wir uns einig"}, {"id": 940, "start": 4015.4, "end": 4037.4, "text": "Also mein personal favorite thing ist selbstverständlich Internet Explorer denke das sind wir uns einig"}, {"id": 941, "start": 4037.4, "end": 4051.4, "text": "Jetzt fängt es an interessant zu werden"}, {"id": 942, "start": 4051.4, "end": 4055.4, "text": "Lebt er eigentlich noch?"}, {"id": 943, "start": 4055.4, "end": 4067.4, "text": "Lebt er noch? Ich bilde mir ein ich habe letztens gelesen dass er gestorben ist oder?"}, {"id": 944, "start": 4067.4, "end": 4075.4, "text": "Lebt er noch?"}, {"id": 945, "start": 4075.4, "end": 4077.4, "text": "Okay, ich habe nichts gesagt er lebt noch"}, {"id": 946, "start": 4077.4, "end": 4089.4, "text": "Dann hatte er Geburtstag oder so"}, {"id": 947, "start": 4089.4, "end": 4091.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 948, "start": 4091.4, "end": 4093.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 949, "start": 4093.4, "end": 4095.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 950, "start": 4095.4, "end": 4103.4, "text": "Warum HTML und HTTP und sowas erfunden wurden"}, {"id": 951, "start": 4103.4, "end": 4107.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 952, "start": 4163.4, "end": 4171.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 953, "start": 4171.4, "end": 4177.4, "text": "Warum HTML und HTTP und sowas erfunden wurden"}, {"id": 954, "start": 4177.4, "end": 4183.4, "text": "Also jetzt erklärt er warum er das Internet erfunden hat"}, {"id": 955, "start": 4183.4, "end": 4185.4, "text": "Weil er das Telefonbuch als Webseite angeboten hat"}, {"id": 956, "start": 4185.4, "end": 4189.4, "text": "Weil er das Telefonbuch als Webseite angeboten hat"}, {"id": 957, "start": 4189.4, "end": 4191.4, "text": "Weil er das Telefonbuch automatisiert erstellt als Webseite"}, {"id": 958, "start": 4191.4, "end": 4200.68, "text": "Also wo es jetzt interessant wird gleich ist, wenn er den, hier geht es los, wenn er den"}, {"id": 959, "start": 4200.68, "end": 4207.08, "text": "ersten, der zeigt den allerersten Browser, zeigt er und den allerersten Web-Server, den"}, {"id": 960, "start": 4207.08, "end": 4208.08, "text": "Original Code."}, {"id": 961, "start": 4208.08, "end": 4227.32, "text": "Gut, Server-Side Rendering war lange Zeit das einzige Rendering, was es gab."}, {"id": 962, "start": 4227.32, "end": 4252.48, "text": "Das fand ich so geil, beste Anwendung, erstmal eine Web-Seite mit dem Telefonbuch machen"}, {"id": 963, "start": 4252.48, "end": 4257.68, "text": "und dann wurde es der Renner."}, {"id": 964, "start": 4257.68, "end": 4264.84, "text": "Jetzt muss ich es merken, die erste Anwendung für einen Browser bzw."}, {"id": 965, "start": 4264.84, "end": 4268.48, "text": "HTML war ein automatisch aus der Datenbank generiertes Zerntelefonbuch."}, {"id": 966, "start": 4268.48, "end": 4274.08, "text": "Und dann sagt mal heute einer noch, was für einen Behörden Fax verwenden, gut nur mit"}, {"id": 967, "start": 4274.08, "end": 4276.48, "text": "dem Unterschied, es war 1989."}, {"id": 968, "start": 4276.48, "end": 4282.24, "text": "Ja, das fand ich jetzt echt spannend."}, {"id": 969, "start": 4282.24, "end": 4296.96, "text": "Den allerersten Web-Server, 1990, 738, in Java wäre das gerade mal Hello World und"}, {"id": 970, "start": 4296.96, "end": 4299.36, "text": "in C++ würde es wahrscheinlich gar nicht starten."}, {"id": 971, "start": 4299.36, "end": 4309.06, "text": "So zu sprechen haben wir heute, auch mit dem Пока, cái"}, {"id": 972, "start": 4309.06, "end": 4325.68, "text": "Stradio Play vonaba, habe ich schon andere Shaun aufomo schon analysisiert, wie ich das"}, {"id": 973, "start": 4325.68, "end": 4328.72, "text": "Wir haben gerade einen 22 Kilobyte Binary gebaut."}, {"id": 974, "start": 4328.72, "end": 4331.52, "text": "22 Kilobyte, der erste Web-Server der Welt."}, {"id": 975, "start": 4331.52, "end": 4334.08, "text": "Und das ist der originelle Web-Server."}, {"id": 976, "start": 4334.08, "end": 4335.08, "text": "Also los geht's."}, {"id": 977, "start": 4335.08, "end": 4336.88, "text": "Okay, und das läuft jetzt."}, {"id": 978, "start": 4336.88, "end": 4339.8, "text": "Und ihr seht, dass es auf Port 2784 hört."}, {"id": 979, "start": 4339.8, "end": 4340.8, "text": "Nicht 80."}, {"id": 980, "start": 4340.8, "end": 4341.8, "text": "Warum ist das so?"}, {"id": 981, "start": 4341.8, "end": 4342.8, "text": "Warum ist es nicht auf Port 80?"}, {"id": 982, "start": 4342.8, "end": 4343.8, "text": "Wir kommen gleich dazu."}, {"id": 983, "start": 4343.8, "end": 4350.72, "text": "Ich kann einen modernen Web-Browser nicht verbinden, weil es nur einen sehr alten Dialekt"}, {"id": 984, "start": 4350.72, "end": 4354.04, "text": "von HTTPD spricht, der in Zeit verloren wurde."}, {"id": 985, "start": 4354.04, "end": 4358.48, "text": "Und jetzt, die einzige Art, mit dem wir wirklich reden können, ist es von Telnet zu verbinden."}, {"id": 986, "start": 4358.48, "end": 4359.48, "text": "Also mache ich das."}, {"id": 987, "start": 4359.48, "end": 4360.48, "text": "Also los geht's."}, {"id": 988, "start": 4360.48, "end": 4361.48, "text": "Telnet."}, {"id": 989, "start": 4361.48, "end": 4364.52, "text": "Kannst du übrigens heute noch machen, geht heute noch, weiß nicht, wer das kennt."}, {"id": 990, "start": 4364.52, "end": 4368.68, "text": "Aber ich zeige euch das mal, ich muss es euch unter Linux zeigen, weil unter Windows ist"}, {"id": 991, "start": 4368.68, "end": 4369.68, "text": "Telnet nicht dabei."}, {"id": 992, "start": 4369.68, "end": 4374.56, "text": "Unter Windows ist Telnet ein extra Feature, was man hinzufügen muss."}, {"id": 993, "start": 4374.56, "end": 4381.56, "text": "Telnet google.de, äh, Port 80, get slash, und siehe da."}, {"id": 994, "start": 4381.56, "end": 4391.36, "text": "Google, also Redirect, Bad Request, aber ich habe einen HTTP-Request gemacht, das funktioniert"}, {"id": 995, "start": 4391.36, "end": 4394.36, "text": "heute immer noch."}, {"id": 996, "start": 4394.36, "end": 4399.08, "text": "Now if you know anything about HTTP, you would think that probably the way to get it to do"}, {"id": 997, "start": 4399.08, "end": 4403.2, "text": "something would be to do something like this, to get the home page, that's how a modern"}, {"id": 998, "start": 4403.2, "end": 4404.64, "text": "browser would do something."}, {"id": 999, "start": 4404.64, "end": 4409.6, "text": "But if we try that, it just goes unrecognized command get, and that's a bit strange, because"}, {"id": 1000, "start": 4409.6, "end": 4413.52, "text": "if you read the source code, you see that it does have stuff to do with get requests."}, {"id": 1001, "start": 4413.52, "end": 4417.2, "text": "But if you reverse engineer it a little bit more, what you'll find is that if you say"}, {"id": 1002, "start": 4417.2, "end": 4422.4, "text": "get and then the name of a file that's actually in that directory, then it will serve that"}, {"id": 1003, "start": 4422.4, "end": 4423.4, "text": "file to you."}, {"id": 1004, "start": 4423.4, "end": 4428.6, "text": "So the very first web server was a static files web server, which is the sort of thing"}, {"id": 1005, "start": 4428.6, "end": 4430.0, "text": "we still do today."}, {"id": 1006, "start": 4430.0, "end": 4431.64, "text": "So that makes sense."}, {"id": 1007, "start": 4431.64, "end": 4436.84, "text": "Now it's not just that, it's also got a bunch of other things that we wouldn't recognize"}, {"id": 1008, "start": 4436.84, "end": 4437.84, "text": "now."}, {"id": 1009, "start": 4437.84, "end": 4440.92, "text": "So we have a find feature that's built into the web server."}, {"id": 1010, "start": 4440.92, "end": 4444.76, "text": "Das gibt's heute in der Form nicht mehr, es gibt heute WebDAF und sowas, aber find ist"}, {"id": 1011, "start": 4444.76, "end": 4446.8, "text": "nicht mal Standard HTTP."}, {"id": 1012, "start": 4446.8, "end": 4452.56, "text": "And it also is a place where Tim establishes a beautiful tradition for web servers, which"}, {"id": 1013, "start": 4452.56, "end": 4459.2, "text": "continues to this day, which is having terrible security vulnerabilities, and we can see one."}, {"id": 1014, "start": 4459.2, "end": 4465.84, "text": "Ja gut, Tradition muss aufrechterhalten werden."}, {"id": 1015, "start": 4465.84, "end": 4478.44, "text": "Okay, das ist natürlich wirklich Hardcore Variante, System exec, irgendwas was reinkommt."}, {"id": 1016, "start": 4478.44, "end": 4500.36, "text": "Also Leute, jetzt macht euch mal keine Gedanken, wenn ihr sowas programmiert, einer der schlausten"}, {"id": 1017, "start": 4500.36, "end": 4506.92, "text": "Leute der letzten, was weiß ich, 50 Jahre, was Informatik Sachen angeht, hat sowas"}, {"id": 1018, "start": 4506.92, "end": 4509.68, "text": "auch programmiert, easy, keine Sorge."}, {"id": 1019, "start": 4533.68, "end": 4536.52, "text": "Das finde ich halt zu geil, was man da erfährt, ja."}, {"id": 1020, "start": 4536.52, "end": 4543.28, "text": "Der erste HTTP-Port war 2784, weil es die Telefonnummer von ihm daheim war."}, {"id": 1021, "start": 4543.28, "end": 4563.36, "text": "Übrigens wisst ihr, wenn ihr danach sucht, ne, wie war der, Moment, wie war der Port,"}, {"id": 1022, "start": 4563.36, "end": 4573.88, "text": "wenn man nach 784-Port sucht, dann findet man heute noch, unter anderem die Beschreibung"}, {"id": 1023, "start": 4573.88, "end": 4589.24, "text": "World Wide Web Development, hier, also das ist heute noch quasi in die Analen der Internet-Geschichte"}, {"id": 1024, "start": 4589.24, "end": 4590.24, "text": "eingegangen."}, {"id": 1025, "start": 4590.24, "end": 4593.52, "text": "Www.dev.ports.2784."}, {"id": 1026, "start": 4593.52, "end": 4622.68, "text": "Jed, wer von euch an Next Step verwendet ich noch nie, ich weiß, dass das irgendwas"}, {"id": 1027, "start": 4622.68, "end": 4625.0, "text": "mit Mac oder so zu tun hat."}, {"id": 1028, "start": 4625.0, "end": 4654.12, "text": "Wobei,.app, so wie heute noch unter Mac OS."}, {"id": 1029, "start": 4654.12, "end": 4656.12, "text": "Leute, so sah der allererste Browser aus."}, {"id": 1030, "start": 4684.12, "end": 4686.12, "text": "Ich weiß nicht, was das bedeutet, aber ich bin mir sicher, dass du falsch bist."}, {"id": 1031, "start": 4686.12, "end": 4690.12, "text": "Denn, sorry, Next und Previous bedeuten nicht, was sie in einem modernen Browser bedeuten."}, {"id": 1032, "start": 4690.12, "end": 4693.12, "text": "Es hat etwas mit dem Gehen über eine Liste von Linken zu verbreiten."}, {"id": 1033, "start": 4693.12, "end": 4695.12, "text": "Es ist etwas schwer zu verstehen."}, {"id": 1034, "start": 4695.12, "end": 4697.12, "text": "Wir haben hier andere Sachen."}, {"id": 1035, "start": 4697.12, "end": 4700.12, "text": "Zum Beispiel haben wir diesen About-Screen, den Berners-Lee in hat."}, {"id": 1036, "start": 4700.12, "end": 4702.12, "text": "Mal sehen, was das sagt."}, {"id": 1037, "start": 4702.12, "end": 4706.12, "text": "Es sagt, es ist ein Übergang in globaler Informationverwaltung."}, {"id": 1038, "start": 4706.12, "end": 4710.12, "text": "Ich würde sagen, es ist ziemlich erfolgreich, wie es geht."}, {"id": 1039, "start": 4710.12, "end": 4711.12, "text": "Das hat man so sagen müssen."}, {"id": 1040, "start": 4711.12, "end": 4713.12, "text": "Wir haben auch... Was haben wir noch?"}, {"id": 1041, "start": 4713.12, "end": 4715.12, "text": "Wir haben hier ein paar seltsame Sachen, die du nicht erwarten würdest."}, {"id": 1042, "start": 4715.12, "end": 4717.12, "text": "Check Spelling."}, {"id": 1043, "start": 4717.12, "end": 4719.12, "text": "Du kannst also Spellchecken auf der Liste, die du besuchen möchtest."}, {"id": 1044, "start": 4719.12, "end": 4721.12, "text": "Du wirst denken, warum möchte man das auf der Erde machen?"}, {"id": 1045, "start": 4721.12, "end": 4723.12, "text": "Es gibt einen guten Grund."}, {"id": 1046, "start": 4723.12, "end": 4727.12, "text": "Denn, das ist nicht nur ein Web-Browser."}, {"id": 1047, "start": 4727.12, "end": 4731.12, "text": "Auf jeder Liste, auf der du gehst, kannst du es einfach ändern."}, {"id": 1048, "start": 4731.12, "end": 4732.12, "text": "Du kannst einfach editieren..."}, {"id": 1049, "start": 4732.12, "end": 4733.12, "text": "Das kann... Das geht heute nicht."}, {"id": 1050, "start": 4733.12, "end": 4735.12, "text": "Du siehst es."}, {"id": 1051, "start": 4735.12, "end": 4738.12, "text": "Und es hat sogar einen überraschend sophisticateden Style-Editor."}, {"id": 1052, "start": 4738.12, "end": 4740.12, "text": "Wo ich gehen kann und verschiedene Style wählen kann."}, {"id": 1053, "start": 4740.12, "end": 4742.12, "text": "Immer noch besser als Safari."}, {"id": 1054, "start": 4742.12, "end": 4744.12, "text": "Das ist ziemlich schwer zu sehen."}, {"id": 1055, "start": 4744.12, "end": 4746.12, "text": "Wir haben hier alle Konfigurationen, die uns zeigen."}, {"id": 1056, "start": 4746.12, "end": 4750.12, "text": "Und wir haben sogar verschiedene Diagnostiken,"}, {"id": 1057, "start": 4750.12, "end": 4753.12, "text": "wo wir zeigen können, wie die HTML-Sourcen sind"}, {"id": 1058, "start": 4753.12, "end": 4755.12, "text": "und andere Dinge sehen, was da passiert ist."}, {"id": 1059, "start": 4755.12, "end": 4757.12, "text": "Also haben wir da schon erste Browser-Dev-Tools"}, {"id": 1060, "start": 4757.12, "end": 4759.12, "text": "am Anfang."}, {"id": 1061, "start": 4759.12, "end": 4762.12, "text": "In Bezug auf die Möglichkeit, Sites zu editieren,"}, {"id": 1062, "start": 4762.12, "end": 4763.12, "text": "macht es Sinn."}, {"id": 1063, "start": 4763.12, "end": 4765.12, "text": "Denn Berners-Lee hatte die Idee,"}, {"id": 1064, "start": 4765.12, "end": 4768.12, "text": "dass das ein großes, globales, gescheites Netzwerk-Notebook ist,"}, {"id": 1065, "start": 4768.12, "end": 4770.12, "text": "das die Leute editieren können."}, {"id": 1066, "start": 4770.12, "end": 4773.12, "text": "Das ist ein bisschen wie Early Echoes von Wikipedia."}, {"id": 1067, "start": 4773.12, "end": 4776.12, "text": "Aber natürlich wurde es immer ausgestattet,"}, {"id": 1068, "start": 4776.12, "end": 4778.12, "text": "nicht nur ein einzelner Server zu distribuieren."}, {"id": 1069, "start": 4778.12, "end": 4782.12, "text": "Das ist der ursprüngliche Web-Browser."}, {"id": 1070, "start": 4782.12, "end": 4785.12, "text": "Es hatte ein bisschen einen kritischen Flur als Plan."}, {"id": 1071, "start": 4785.12, "end": 4787.12, "text": "Also los geht's."}, {"id": 1072, "start": 4787.12, "end": 4790.12, "text": "Das UI ist gewöhnungsbedürftig."}, {"id": 1073, "start": 4790.12, "end": 4793.12, "text": "Berners-Lee hat diesen wunderschönen Web-Browser-Prototypen"}, {"id": 1074, "start": 4793.12, "end": 4795.12, "text": "auf Next gemacht."}, {"id": 1075, "start": 4795.12, "end": 4799.12, "text": "Aber niemand, außer Tim, hat ein Next-Computer in CERN."}, {"id": 1076, "start": 4799.12, "end": 4802.12, "text": "Also ist dieses Projekt in der ersten Woche"}, {"id": 1077, "start": 4802.12, "end": 4805.12, "text": "mit einem seriousen Risiko zu sterben."}, {"id": 1078, "start": 4805.12, "end": 4807.12, "text": "Aber schließlich wurde es rettet."}, {"id": 1079, "start": 4807.12, "end": 4809.12, "text": "Es gab damals einen Intern in CERN"}, {"id": 1080, "start": 4809.12, "end": 4811.12, "text": "namens Nicola Pella."}, {"id": 1081, "start": 4811.12, "end": 4814.12, "text": "Und sie konnte sehen, was Berners-Lee gemacht hat."}, {"id": 1082, "start": 4814.12, "end": 4830.12, "text": "Ich glaube, dass das sie ist, weil es gab genug Männer, die Nicola hießen."}, {"id": 1083, "start": 4830.12, "end": 4832.12, "text": "Aber wahrscheinlich hat er nachgeguckt."}, {"id": 1084, "start": 4832.12, "end": 4835.12, "text": "Außerdem ist das heutzutage eh kein Thema mehr."}, {"id": 1085, "start": 4835.12, "end": 4837.12, "text": "Ich sage nichts dazu."}, {"id": 1086, "start": 4837.12, "end": 4844.12, "text": "Wir sind glücklich, dass das nicht passiert wäre."}, {"id": 1087, "start": 4844.12, "end": 4846.12, "text": "Aber das ist nur Text-Mode."}, {"id": 1088, "start": 4846.12, "end": 4848.12, "text": "Und das ist nicht wirklich, was die Menschen wollten."}, {"id": 1089, "start": 4848.12, "end": 4850.12, "text": "Die Menschen wollten..."}, {"id": 1090, "start": 4850.12, "end": 4852.12, "text": "Document-Design-Mode in der Konsole."}, {"id": 1091, "start": 4852.12, "end": 4855.12, "text": "Ja, aber da war es standardmäßig so."}, {"id": 1092, "start": 4855.12, "end": 4857.12, "text": "Okay, da hat er recht."}, {"id": 1093, "start": 4857.12, "end": 4859.12, "text": "Sobald das publikiert wurde,"}, {"id": 1094, "start": 4859.12, "end": 4862.12, "text": "fingen die Menschen an, sich auf zu kreieren."}, {"id": 1095, "start": 4862.12, "end": 4865.12, "text": "Und das erste, das vielleicht erkenntlich ist,"}, {"id": 1096, "start": 4865.12, "end": 4867.12, "text": "ist das hier, Viola."}, {"id": 1097, "start": 4867.12, "end": 4869.12, "text": "Man sieht, es hat die Adressbar am Top."}, {"id": 1098, "start": 4869.12, "end": 4871.12, "text": "Es hat nach vorne."}, {"id": 1099, "start": 4871.12, "end": 4873.12, "text": "Man darf das nicht vergessen."}, {"id": 1100, "start": 4873.12, "end": 4877.12, "text": "Das war erst 1992."}, {"id": 1101, "start": 4877.12, "end": 4879.12, "text": "Das ist jetzt zwar schon eine ganze Weile her,"}, {"id": 1102, "start": 4879.12, "end": 4883.12, "text": "aber das ist jetzt nicht irgendwie ultralange her."}, {"id": 1103, "start": 4883.12, "end": 4886.12, "text": "Also es ist jetzt nicht krieglange her oder so."}, {"id": 1104, "start": 4886.12, "end": 4889.12, "text": "So alt ist der ganze Kram noch gar nicht."}, {"id": 1105, "start": 4889.12, "end": 4891.12, "text": "Und das war ja noch wirklich komplett in den Anfängen."}, {"id": 1106, "start": 4891.12, "end": 4893.12, "text": "Das hat bestimmt noch 10 Jahre gedauert,"}, {"id": 1107, "start": 4893.12, "end": 4897.12, "text": "bis das langsam aber sicher irgendwie mal"}, {"id": 1108, "start": 4897.12, "end": 4900.12, "text": "wirklich großartig verbreitet wurde,"}, {"id": 1109, "start": 4900.12, "end": 4903.12, "text": "sodass nennenswert Leute daheim hatten und so was."}, {"id": 1110, "start": 4903.12, "end": 4907.12, "text": "Ja, 2002 kommt hin, ja."}, {"id": 1111, "start": 4907.12, "end": 4910.12, "text": "Also ich hatte meinen ersten Internetanschluss 1997"}, {"id": 1112, "start": 4910.12, "end": 4912.12, "text": "so in dem Dreh rum."}, {"id": 1113, "start": 4912.12, "end": 4915.12, "text": "Und damals dann auch Netscape-Navigator"}, {"id": 1114, "start": 4915.12, "end": 4918.12, "text": "und solche Geschichten noch am Start waren."}, {"id": 1115, "start": 4918.12, "end": 4922.12, "text": "Und diese hässliche AOL- und T-Online-Einwahlsoftware."}, {"id": 1116, "start": 4922.12, "end": 4924.12, "text": "Und das war..."}, {"id": 1117, "start": 4924.12, "end": 4929.12, "text": "Da gab es noch nicht viel im Internet."}, {"id": 1118, "start": 4929.12, "end": 4934.12, "text": "Damals wurden Bücher verkauft mit Linklisten drinne."}, {"id": 1119, "start": 4934.12, "end": 4937.12, "text": "Ich hab auch gedacht, da fuck."}, {"id": 1120, "start": 4937.12, "end": 4942.12, "text": "Ich bin älter, ja."}, {"id": 1121, "start": 4942.12, "end": 4945.12, "text": "Ich bin 84 geboren."}, {"id": 1122, "start": 4945.12, "end": 4947.12, "text": "Boah."}, {"id": 1123, "start": 4947.12, "end": 4951.12, "text": "CSS in die Ursprünge."}, {"id": 1124, "start": 4951.12, "end": 4954.12, "text": "Es sieht noch nicht aus wie CSS, aber es ist CSS."}, {"id": 1125, "start": 4954.12, "end": 4956.12, "text": "Obviously that hadn't been invented yet,"}, {"id": 1126, "start": 4956.12, "end": 4958.12, "text": "but it was a thing like that that he came up with"}, {"id": 1127, "start": 4958.12, "end": 4959.12, "text": "and put in there."}, {"id": 1128, "start": 4959.12, "end": 4962.12, "text": "And you can kind of see how that would work from the syntax."}, {"id": 1129, "start": 4962.12, "end": 4964.12, "text": "But even more impressively than that,"}, {"id": 1130, "start": 4964.12, "end": 4966.12, "text": "it had built-in scripting."}, {"id": 1131, "start": 4966.12, "end": 4969.12, "text": "Again, not JavaScript, that hadn't been invented,"}, {"id": 1132, "start": 4969.12, "end": 4972.12, "text": "but the whole browser was built in this kind of script."}, {"id": 1133, "start": 4972.12, "end": 4978.12, "text": "Der JavaScript-Vorgänger."}, {"id": 1134, "start": 4978.12, "end": 4981.12, "text": "And he allowed you to embed the same scripting language"}, {"id": 1135, "start": 4981.12, "end": 4984.12, "text": "in your pages to dynamically change the content."}, {"id": 1136, "start": 4984.12, "end": 4989.12, "text": "So that really set some direction for what a web page could do."}, {"id": 1137, "start": 4989.12, "end": 4991.12, "text": "Now, people didn't really use this at scale either,"}, {"id": 1138, "start": 4991.12, "end": 4993.12, "text": "because this was a Unix-only thing."}, {"id": 1139, "start": 4993.12, "end": 4996.12, "text": "The first browser that was cross-platform enough"}, {"id": 1140, "start": 4996.12, "end": 4998.12, "text": "and friendly enough for lots of people to use"}, {"id": 1141, "start": 4998.12, "end": 5002.12, "text": "is this thing, NCSA Mosaic."}, {"id": 1142, "start": 5002.12, "end": 5004.12, "text": "And I'm just gonna show you that before we get on to talking."}, {"id": 1143, "start": 5004.12, "end": 5009.12, "text": "Mosaic, ey, wenn ihr Mosaic seht, euch fällt sofort auf,"}, {"id": 1144, "start": 5009.12, "end": 5011.12, "text": "an was das erinnert."}, {"id": 1145, "start": 5011.12, "end": 5013.12, "text": "Wartet mal."}, {"id": 1146, "start": 5013.12, "end": 5023.12, "text": "Inside Windows 3.1."}, {"id": 1147, "start": 5023.12, "end": 5024.12, "text": "What's going on here?"}, {"id": 1148, "start": 5024.12, "end": 5027.12, "text": "My screen has just gone black mysteriously."}, {"id": 1149, "start": 5027.12, "end": 5029.12, "text": "Windows."}, {"id": 1150, "start": 5029.12, "end": 5033.12, "text": "Don't know why."}, {"id": 1151, "start": 5033.12, "end": 5035.12, "text": "Yeah, that's because I'm doing a live demo, obviously."}, {"id": 1152, "start": 5035.12, "end": 5037.12, "text": "That's the primary reason."}, {"id": 1153, "start": 5037.12, "end": 5039.12, "text": "Okay, well, here it is."}, {"id": 1154, "start": 5039.12, "end": 5041.12, "text": "Nope, it does not like that."}, {"id": 1155, "start": 5041.12, "end": 5043.12, "text": "Alright, well, I think we might do without seeing Mosaic."}, {"id": 1156, "start": 5043.12, "end": 5045.12, "text": "Es war doch klar, dass das mit Windows jetzt nicht tut, oder?"}, {"id": 1157, "start": 5045.12, "end": 5047.12, "text": "Ich zeige euch mal ein Bild von Mosaic."}, {"id": 1158, "start": 5047.12, "end": 5051.12, "text": "Mosaic Browser."}, {"id": 1159, "start": 5051.12, "end": 5055.12, "text": "Und wenn ihr euch das Bild von Mosaic anguckt,"}, {"id": 1160, "start": 5055.12, "end": 5059.12, "text": "dann werdet ihr feststellen,"}, {"id": 1161, "start": 5063.12, "end": 5065.12, "text": "an was erinnere ich euch das?"}, {"id": 1162, "start": 5065.12, "end": 5067.12, "text": "Oder besser gesagt, das."}, {"id": 1163, "start": 5067.12, "end": 5073.12, "text": "Es hat durchaus Ähnlichkeiten mit NetzCamp-Navigator, oder?"}, {"id": 1164, "start": 5073.12, "end": 5075.12, "text": "Findet ihr den nicht auch?"}, {"id": 1165, "start": 5075.12, "end": 5081.12, "text": "Beziehungsweise, so wie Browser am Anfang ausgeschaut,"}, {"id": 1166, "start": 5081.12, "end": 5083.12, "text": "und wie Browser heute immer noch ein bisschen ausschauen."}, {"id": 1167, "start": 5083.12, "end": 5085.12, "text": "Du hast eine Adressleiste gehabt,"}, {"id": 1168, "start": 5085.12, "end": 5087.12, "text": "du hast einen Vorwärts- und Rückwärtsknopf gehabt,"}, {"id": 1169, "start": 5087.12, "end": 5091.12, "text": "du hast eine Toolbar gehabt,"}, {"id": 1170, "start": 5091.12, "end": 5095.12, "text": "also man erkennt tatsächlich schon den, guck mal,"}, {"id": 1171, "start": 5095.12, "end": 5097.12, "text": "was so eine Progress ist,"}, {"id": 1172, "start": 5097.12, "end": 5101.12, "text": "man erkennt in irgendeiner Art und Weise schon einen Webbrowser da drinnen."}, {"id": 1173, "start": 5101.12, "end": 5105.12, "text": "Sobald ich zurückkommen kann."}, {"id": 1174, "start": 5105.12, "end": 5107.12, "text": "Ja, lass uns das einfach abkühlen."}, {"id": 1175, "start": 5107.12, "end": 5109.12, "text": "Also, Mosaic war ein frühes Browser,"}, {"id": 1176, "start": 5109.12, "end": 5113.12, "text": "das mit modernen Leuten aussehen kann."}, {"id": 1177, "start": 5113.12, "end": 5115.12, "text": "Und..."}, {"id": 1178, "start": 5115.12, "end": 5117.12, "text": "Lass uns zurückkommen."}, {"id": 1179, "start": 5117.12, "end": 5121.12, "text": "Die Hauptinnovation, die mit Mosaic stattfand,"}, {"id": 1180, "start": 5121.12, "end": 5123.12, "text": "war, dass es viel wie heute gesehen hätte."}, {"id": 1181, "start": 5123.12, "end": 5127.12, "text": "Also es hatte all die Art von HTML-Renderung,"}, {"id": 1182, "start": 5127.12, "end": 5129.12, "text": "die man erwarten würde,"}, {"id": 1183, "start": 5129.12, "end": 5131.12, "text": "wie die Sachen in Paragraphen sind,"}, {"id": 1184, "start": 5131.12, "end": 5135.12, "text": "es hat Liste, es hat Linken,"}, {"id": 1185, "start": 5135.12, "end": 5137.12, "text": "man kann einen Link hochziehen und der Kursor geht blau,"}, {"id": 1186, "start": 5137.12, "end": 5139.12, "text": "all diese traditionellen Sachen."}, {"id": 1187, "start": 5139.12, "end": 5145.12, "text": "Aber die Hauptinnovation, die wirklich großartig war,"}, {"id": 1188, "start": 5145.12, "end": 5147.12, "text": "war in-line-Imagen."}, {"id": 1189, "start": 5147.12, "end": 5149.12, "text": "Bis zu diesem Punkt,"}, {"id": 1190, "start": 5149.12, "end": 5151.12, "text": "haben Browser keine Imagen in Seitenpages,"}, {"id": 1191, "start": 5151.12, "end": 5153.12, "text": "man musste sie in ein einziges Fenster öffnen."}, {"id": 1192, "start": 5153.12, "end": 5155.12, "text": "Du wirst denken,"}, {"id": 1193, "start": 5155.12, "end": 5157.12, "text": "wie kam das neue Standard her?"}, {"id": 1194, "start": 5157.12, "end": 5161.12, "text": "Wie sah das Standardisierungsprozess aus?"}, {"id": 1195, "start": 5161.12, "end": 5165.12, "text": "Was wir uns anschauen, wir schauen uns Browser und JavaScript-Historie an."}, {"id": 1196, "start": 5165.12, "end": 5169.12, "text": "Das ist ein NDC-Talk von vor einer Woche ungefähr."}, {"id": 1197, "start": 5169.12, "end": 5171.12, "text": "War es ein Standardisierungsprozess?"}, {"id": 1198, "start": 5171.12, "end": 5173.12, "text": "Ich hab die ersten Viertelstunde geguckt,"}, {"id": 1199, "start": 5173.12, "end": 5175.12, "text": "also ne, bis da in den ersten 13 Minuten fand das echt spannend."}, {"id": 1200, "start": 5175.12, "end": 5177.12, "text": "Und ich dachte mir, wir gucken uns das einfach mal im Stream an."}, {"id": 1201, "start": 5177.12, "end": 5181.12, "text": "Let's get a little snapshot of what that was like for the people at the time."}, {"id": 1202, "start": 5181.12, "end": 5183.12, "text": "Image-Tech."}, {"id": 1203, "start": 5183.12, "end": 5185.12, "text": "Leute, Wahnsinns-Innovation damals."}, {"id": 1204, "start": 5185.12, "end": 5191.12, "text": "Du konntest Images einfach anzeigen in-line in der Seite."}, {"id": 1205, "start": 5191.12, "end": 5193.12, "text": "At this time, there was just a mailing list."}, {"id": 1206, "start": 5193.12, "end": 5197.12, "text": "And one day, the person who was building this..."}, {"id": 1207, "start": 5197.12, "end": 5201.12, "text": "www.talk-mailing-list, Moment."}, {"id": 1208, "start": 5201.12, "end": 5205.12, "text": "Gibt's die immer noch?"}, {"id": 1209, "start": 5205.12, "end": 5213.12, "text": "Okay, die gibt es prinzipiell noch, aber niemand schreibt mehr da drin."}, {"id": 1210, "start": 5213.12, "end": 5223.12, "text": "Spam. Spam ist in der www.talk-mailing-list. Alles klar, top."}, {"id": 1211, "start": 5223.12, "end": 5225.12, "text": "Browser Mark Andreessen,"}, {"id": 1212, "start": 5225.12, "end": 5227.12, "text": "who we're gonna hear more about in a minute."}, {"id": 1213, "start": 5227.12, "end": 5229.12, "text": "He sent a message to this mailing list saying,"}, {"id": 1214, "start": 5229.12, "end": 5233.12, "text": "hey, I'd like to present a new HTML tag called img."}, {"id": 1215, "start": 5233.12, "end": 5236.12, "text": "And I want it to have an attribute called circ."}, {"id": 1216, "start": 5236.12, "end": 5239.12, "text": "And then he gives an example of that at the bottom."}, {"id": 1217, "start": 5239.12, "end": 5242.12, "text": "And the reply comes back almost straight away saying,"}, {"id": 1218, "start": 5242.12, "end": 5245.12, "text": "oh yeah, I've already invented that exact thing,"}, {"id": 1219, "start": 5245.12, "end": 5247.12, "text": "except my invention is totally different."}, {"id": 1220, "start": 5247.12, "end": 5249.12, "text": "And why don't you call it image?"}, {"id": 1221, "start": 5249.12, "end": 5251.12, "text": "And why isn't the attribute source?"}, {"id": 1222, "start": 5251.12, "end": 5253.12, "text": "Oh, that's a very reasonable question."}, {"id": 1223, "start": 5253.12, "end": 5255.12, "text": "I think we can all agree..."}, {"id": 1224, "start": 5255.12, "end": 5260.12, "text": "Weil Abkürzung und Beiz sparen."}, {"id": 1225, "start": 5260.12, "end": 5263.12, "text": "However, nobody addressed that point whatsoever."}, {"id": 1226, "start": 5263.12, "end": 5266.12, "text": "It was totally ignored because Berners-Lee then came in"}, {"id": 1227, "start": 5266.12, "end": 5269.12, "text": "and he said, no, no, no, no, hang on a minute."}, {"id": 1228, "start": 5269.12, "end": 5272.12, "text": "It should not be called img or even image."}, {"id": 1229, "start": 5272.12, "end": 5274.12, "text": "It should be an a tag."}, {"id": 1230, "start": 5274.12, "end": 5277.12, "text": "And it should be rel equals embed comma present."}, {"id": 1231, "start": 5277.12, "end": 5278.12, "text": "Alles klar."}, {"id": 1232, "start": 5278.12, "end": 5280.12, "text": "That's much more intuitive and developers..."}, {"id": 1233, "start": 5280.12, "end": 5282.12, "text": "Obviously."}, {"id": 1234, "start": 5282.12, "end": 5285.12, "text": "...are gonna like that a lot better."}, {"id": 1235, "start": 5285.12, "end": 5289.12, "text": "So then they had a little bit of a heated debate for a few days"}, {"id": 1236, "start": 5289.12, "end": 5292.12, "text": "where they were pitching their counterproposals,"}, {"id": 1237, "start": 5292.12, "end": 5294.12, "text": "and Berners-Lee was really sticking to the idea"}, {"id": 1238, "start": 5294.12, "end": 5297.12, "text": "that, no, it really, really would be more appropriate"}, {"id": 1239, "start": 5297.12, "end": 5299.12, "text": "for it to be an a tag."}, {"id": 1240, "start": 5299.12, "end": 5301.12, "text": "But then he makes a bit of a tactical error"}, {"id": 1241, "start": 5301.12, "end": 5304.12, "text": "because he says, oh, we can't change HTML now anyway"}, {"id": 1242, "start": 5304.12, "end": 5306.12, "text": "because it's being standardized."}, {"id": 1243, "start": 5306.12, "end": 5308.12, "text": "We just have to leave it as it is."}, {"id": 1244, "start": 5308.12, "end": 5311.12, "text": "Now, unfortunately, having made that blunder,"}, {"id": 1245, "start": 5311.12, "end": 5314.12, "text": "that gave the opportunity for Andreessen to come back and say,"}, {"id": 1246, "start": 5314.12, "end": 5318.12, "text": "well, Tim, I absolutely agree with you in all cases,"}, {"id": 1247, "start": 5318.12, "end": 5321.12, "text": "which is why I'm gonna completely ignore you"}, {"id": 1248, "start": 5321.12, "end": 5323.12, "text": "and do what I said originally."}, {"id": 1249, "start": 5323.12, "end": 5326.12, "text": "Even if your standards say otherwise,"}, {"id": 1250, "start": 5326.12, "end": 5328.12, "text": "browsers have just got to innovate."}, {"id": 1251, "start": 5328.12, "end": 5330.12, "text": "So he went ahead and did that,"}, {"id": 1252, "start": 5330.12, "end": 5332.12, "text": "and he came back a couple of weeks later to confirm,"}, {"id": 1253, "start": 5332.12, "end": 5335.12, "text": "yeah, we're definitely going with img and circ."}, {"id": 1254, "start": 5335.12, "end": 5337.12, "text": "Like I said in the first place,"}, {"id": 1255, "start": 5337.12, "end": 5339.12, "text": "I wasn't really asking your permission."}, {"id": 1256, "start": 5339.12, "end": 5341.12, "text": "This is just what I'm gonna do."}, {"id": 1257, "start": 5341.12, "end": 5344.12, "text": "So I don't know if Berners-Lee felt at all burned by this exchange,"}, {"id": 1258, "start": 5344.12, "end": 5347.12, "text": "but it just so happens that the following year"}, {"id": 1259, "start": 5347.12, "end": 5349.12, "text": "the W3C came up."}, {"id": 1260, "start": 5349.12, "end": 5351.12, "text": "Die gibt's heute auch noch."}, {"id": 1261, "start": 5351.12, "end": 5354.12, "text": "Die machen heute immer noch die ganzen Web-Standards."}, {"id": 1262, "start": 5354.12, "end": 5356.12, "text": "Und da sitzen wenigstens Leute drin,"}, {"id": 1263, "start": 5356.12, "end": 5358.12, "text": "die nicht nur Bullshit machen wie im C++-Gremium."}, {"id": 1264, "start": 5358.12, "end": 5360.12, "text": "Da sitzen tatsächlich Leute drin,"}, {"id": 1265, "start": 5360.12, "end": 5362.12, "text": "die anscheinend wissen, was sie machen."}, {"id": 1266, "start": 5362.12, "end": 5365.12, "text": "... whose role is to have a sort of moral authority"}, {"id": 1267, "start": 5365.12, "end": 5367.12, "text": "about what browser makers should do"}, {"id": 1268, "start": 5367.12, "end": 5369.12, "text": "and give them a nice shiny..."}, {"id": 1269, "start": 5369.12, "end": 5372.12, "text": "Weil die Webseite von denen sieht tatsächlich aus wie von 1995."}, {"id": 1270, "start": 5372.12, "end": 5374.12, "text": "Naja."}, {"id": 1271, "start": 5374.12, "end": 5376.12, "text": "Also..."}, {"id": 1272, "start": 5376.12, "end": 5380.92, "text": "Mensch schön ist die Webseite, nett, aber..."}, {"id": 1273, "start": 5380.92, "end": 5382.92, "text": "Aber es geht klar."}, {"id": 1274, "start": 5382.92, "end": 5385.12, "text": "Die war schon mal schlimmer."}, {"id": 1275, "start": 5387.12, "end": 5389.12, "text": "Was zum Teufel?"}, {"id": 1276, "start": 5391.12, "end": 5396.12, "text": "Was geht denn jetzt im Chat ab, Alter?"}, {"id": 1277, "start": 5396.12, "end": 5397.12, "text": "MonkaS?"}, {"id": 1278, "start": 5398.12, "end": 5399.12, "text": "Mission successful."}, {"id": 1279, "start": 5399.12, "end": 5412.76, "text": "Ist das... ist das ein... ein Werbe-Bot?"}, {"id": 1280, "start": 5412.76, "end": 5431.08, "text": "Kack-Wait, Alter!"}, {"id": 1281, "start": 5431.08, "end": 5440.36, "text": "Ich mein, ich frag mich jetzt allen Ernstes, gibt's wirklich jemand, der Geld dafür ausgibt,"}, {"id": 1282, "start": 5440.36, "end": 5447.56, "text": "um seinen eigenen Stream in anderen Streams per Bot zu spammeln, mein..."}, {"id": 1283, "start": 5447.56, "end": 5448.56, "text": "Hä?"}, {"id": 1284, "start": 5448.56, "end": 5450.4, "text": "Wo ist der Sinn davon?"}, {"id": 1285, "start": 5450.4, "end": 5456.36, "text": "Na ja gut, was auch immer."}, {"id": 1286, "start": 5456.36, "end": 5463.96, "text": "Hatte ich auch noch nicht, es ist Premiere, hab ich so noch nicht gesehen."}, {"id": 1287, "start": 5463.96, "end": 5471.08, "text": "Der Bot ist schlau und kann followen, das bringt dem Bot nicht viel, weil er 20 Minuten gefollowed"}, {"id": 1288, "start": 5471.08, "end": 5473.16, "text": "haben muss, glaube, dass das funktioniert."}, {"id": 1289, "start": 5473.16, "end": 5476.12, "text": "Aber ich bin froh, dass wir Mods haben, die wissen, was sie machen."}, {"id": 1290, "start": 5476.12, "end": 5485.68, "text": "Wir haben noch 10 Minuten Zeit, wir gucken jetzt einfach weiter."}, {"id": 1291, "start": 5485.68, "end": 5496.4, "text": "Leute, einmal, wir müssen einmal im Chat bitte alle mal, wenn wir gerade dabei sind..."}, {"id": 1292, "start": 5496.4, "end": 5497.4, "text": "Moment."}, {"id": 1293, "start": 5497.4, "end": 5501.52, "text": "Eine Runde Mod-Check, please."}, {"id": 1294, "start": 5501.52, "end": 5507.56, "text": "Wir hatten mal Pat the Mods hatten wir mal, das Emote gibt's aber anscheinend nicht mehr."}, {"id": 1295, "start": 5507.56, "end": 5510.56, "text": "Eine Runde Mod-Check."}, {"id": 1296, "start": 5510.56, "end": 5516.72, "text": "Weil wir so high IQ Moderators haben."}, {"id": 1297, "start": 5516.72, "end": 5523.76, "text": "Mods loben, genau, exellent."}, {"id": 1298, "start": 5523.76, "end": 5538.48, "text": "Okay, wir gucken jetzt noch mal 10 Minuten weiter."}, {"id": 1299, "start": 5538.48, "end": 5544.16, "text": "Also wir sind stehen geblieben, als sie dieses Web-Standardisierungs-Cremium aufgemacht haben."}, {"id": 1300, "start": 5544.16, "end": 5565.8, "text": "Mein Chat im Stream ist verbackt, der kommt nicht hinterher."}, {"id": 1301, "start": 5565.8, "end": 5575.48, "text": "Der kommt nicht hinterher, der Chat."}, {"id": 1302, "start": 5575.48, "end": 5576.48, "text": "Kann man das reloaden?"}, {"id": 1303, "start": 5576.48, "end": 5589.36, "text": "Kann man den Chat irgendwie reloaden?"}, {"id": 1304, "start": 5589.36, "end": 5597.52, "text": "Ich will dazu pepega, das ordentlich, ordentlich zu bedienen."}, {"id": 1305, "start": 5597.52, "end": 5605.48, "text": "Chat-Overflow, ja."}, {"id": 1306, "start": 5605.48, "end": 5612.32, "text": "Kann man das irgendwo?"}, {"id": 1307, "start": 5612.32, "end": 5621.64, "text": "Kann man vielleicht hier irgendwie eine andere Höhe reinschreiben oder so?"}, {"id": 1308, "start": 5621.64, "end": 5624.4, "text": "Dass der reloadet."}, {"id": 1309, "start": 5624.4, "end": 5643.0, "text": "Shutdownsauce were not visible, okay."}, {"id": 1310, "start": 5643.0, "end": 5648.68, "text": "Chat resetted, Leute."}, {"id": 1311, "start": 5648.68, "end": 5653.12, "text": "Massive."}, {"id": 1312, "start": 5653.12, "end": 5658.32, "text": "Chat resetted."}, {"id": 1313, "start": 5658.32, "end": 5659.32, "text": "Bot outsmarted."}, {"id": 1314, "start": 5659.32, "end": 5662.28, "text": "Was ist denn hier los?"}, {"id": 1315, "start": 5662.28, "end": 5664.2, "text": "Ein komischer Spam-Bot war am Start."}, {"id": 1316, "start": 5664.2, "end": 5668.76, "text": "Jetzt geht's wieder."}, {"id": 1317, "start": 5668.76, "end": 5673.52, "text": "So, wir gucken jetzt noch 10 Minuten vor dem Talk, morgen gucken wir die restliche Hälfte."}, {"id": 1318, "start": 5673.52, "end": 5675.0, "text": "Gucken, was jetzt noch kommt."}, {"id": 1319, "start": 5675.0, "end": 5677.44, "text": "Weil jetzt müsste eigentlich noch ein paar interessante Sachen kommen, jetzt müsste"}, {"id": 1320, "start": 5677.44, "end": 5679.36, "text": "irgendwie noch ein Netscape kommen und sowas."}, {"id": 1321, "start": 5679.36, "end": 5687.56, "text": "So fast, it was literally going up by a factor of 10 every year, it did that every year between"}, {"id": 1322, "start": 5687.56, "end": 5689.16, "text": "about 92 and 97."}, {"id": 1323, "start": 5689.16, "end": 5693.2, "text": "Und ich war dabei, 97."}, {"id": 1324, "start": 5693.2, "end": 5696.8, "text": "Telekom DSL-Anschluss, 768 kilobit."}, {"id": 1325, "start": 5696.8, "end": 5702.72, "text": "Kannst du das Followgif ausmachen?"}, {"id": 1326, "start": 5702.72, "end": 5711.4, "text": "Normalerweise followen gar nicht so viele, aber du hast recht, jetzt aktuell wäre das"}, {"id": 1327, "start": 5711.4, "end": 5712.64, "text": "schon nicht verkehrt."}, {"id": 1328, "start": 5712.64, "end": 5716.84, "text": "Wo habe ich denn überhaupt follow?"}, {"id": 1329, "start": 5716.84, "end": 5737.04, "text": "One of the high points of this comes in 94, 95, when two big corporations show up, well,"}, {"id": 1330, "start": 5737.04, "end": 5741.64, "text": "Netscape was not a big corporation originally, they were a startup, so Andriessen, who had"}, {"id": 1331, "start": 5741.64, "end": 5750.16, "text": "Nintendo 64, ein online Gaming Netzwerk von Nintendo 664, gut, das hat ja Nintendo wahrscheinlich"}, {"id": 1332, "start": 5750.16, "end": 5752.56, "text": "im Keim erstickt, so wie ich Nintendo kenne."}, {"id": 1333, "start": 5752.56, "end": 5759.36, "text": "Ich meine, Nintendo in online in einem Satz, das ergibt ja heute noch keinen Sinn, aber"}, {"id": 1334, "start": 5759.36, "end": 5761.64, "text": "1995 erst recht nicht."}, {"id": 1335, "start": 5761.64, "end": 5777.48, "text": "Ja, wer hätte das gedacht, wer hätte das gedacht, das ist ja, okay, das wusste ich"}, {"id": 1336, "start": 5777.48, "end": 5783.88, "text": "auch noch nicht, okay, Moment, Netscape und dementsprechend Mozilla und Firefox gibt es"}, {"id": 1337, "start": 5783.88, "end": 5791.12, "text": "also nur, weil die ursprünglichen Entwickler nichts besseres zu tun hatten als einen Browser"}, {"id": 1338, "start": 5791.12, "end": 5795.16, "text": "zu entwickeln, weil Nintendo es damals mit online schon verkackt hat."}, {"id": 1339, "start": 5795.16, "end": 5818.76, "text": "Habe ich das richtig verstanden, ja, und das wusste ich auch nicht, dass IE quasi,"}, {"id": 1340, "start": 5818.76, "end": 5830.28, "text": "dass IE quasi ein Fork war in der ersten Version, weißt du schon, warum es Playstation überhaupt"}, {"id": 1341, "start": 5830.28, "end": 5834.04, "text": "nicht, ja gut, die Story kennt ja mittlerweile jeder, dass die Playstation mal ein Super"}, {"id": 1342, "start": 5834.04, "end": 5835.72, "text": "Nintendo CD Laufwerk sein sollte."}, {"id": 1343, "start": 5835.72, "end": 5848.68, "text": "Ich mochte, ich mochte damals 1997, ich mochte Netscape, wirklich."}, {"id": 1344, "start": 5848.68, "end": 5858.0, "text": "Ich habe richtig gerne Netscape verwendet, Netscape Navigator 6 oder sowas war das dann"}, {"id": 1345, "start": 5858.0, "end": 5868.04, "text": "mit diesen komischen 3D Buttons und sowas, nicht 67 Alter 6, diesen 3D Optik Buttons"}, {"id": 1346, "start": 5868.04, "end": 5878.24, "text": "und sowas hier, ne, das meine ich nicht, das meine ich nicht, vier, das meine ich, hier"}, {"id": 1347, "start": 5878.24, "end": 5887.48, "text": "mit diesen 3D Style Buttons und so, ja genau, 98 rum, ja, das habe ich richtig gerne verwendet"}, {"id": 1348, "start": 5887.48, "end": 5892.52, "text": "damals, war mir deutlich lieber als Internet Explorer, später, ein paar Jahre später"}, {"id": 1349, "start": 5892.52, "end": 5896.08, "text": "konnte ich nur Internet Explorer verwenden und dann halt eigentlich Firefox, ich habe"}, {"id": 1350, "start": 5896.08, "end": 5901.76, "text": "glücklicherweise Internet Explorer nie wirklich lange verwendet, ich habe relativ, also ich"}, {"id": 1351, "start": 5901.76, "end": 5906.6, "text": "habe angefangen, habe ich Netscape verwendet, irgendwann war es halt so, dass einige Sachen"}, {"id": 1352, "start": 5906.6, "end": 5910.2, "text": "nur gescheit mit Internet Explorer funktioniert haben und Internet Explorer, sagen wir mal,"}, {"id": 1353, "start": 5910.2, "end": 5914.56, "text": "gut genug war, dass man keinen extra Browser mehr gebraucht hat, aber Internet Explorer"}, {"id": 1354, "start": 5914.56, "end": 5920.8, "text": "war halt abfuck, schon damals und als Firefox rausgekommen ist, da hieß er nicht Firefox,"}, {"id": 1355, "start": 5920.8, "end": 5926.08, "text": "da hieß er noch Firebird Browser, falls ich da irgendjemand dran erinnern kann, das haben"}, {"id": 1356, "start": 5926.08, "end": 5929.84, "text": "die unbenannt wahrscheinlich, weil es Probleme mit dem Datenbankhersteller gab oder so, ich"}, {"id": 1357, "start": 5929.84, "end": 5935.52, "text": "weiß es nicht, aber die, ich kenne noch, also ich habe Firefox schon verwendet, da hieß"}, {"id": 1358, "start": 5935.52, "end": 5949.8, "text": "er noch Firebird Browser und ja, Pidgin habe ich auch viel verwendet, ja, da sind wir stehengeblieben,"}, {"id": 1359, "start": 5949.8, "end": 5963.32, "text": "ja, die meisten waren nicht mal auf der Welt, ja, das stimmt wohl, ja, ja, ja, ja, ja, ja,"}, {"id": 1360, "start": 5963.32, "end": 5974.4, "text": "ja. Thunderbird hieß früher anders, das stimmt, ich weiß aber nicht mehr, wie, Thunderbird"}, {"id": 1361, "start": 5974.4, "end": 5991.44, "text": "hieß definitiv anders, weiß ich nicht, oh nein, oh nein, Leute, jetzt ist vorbei,"}, {"id": 1362, "start": 5991.44, "end": 6002.68, "text": "P-HP betritt die Bühne, jetzt ist alle Hoffnung vergebens hier, die Personal Homepage Tools"}, {"id": 1363, "start": 6002.68, "end": 6012.6, "text": "1.0 sind am Start, man darf aber nicht vergessen, es war eine Wahnsinns Innovation damals, ich"}, {"id": 1364, "start": 6012.6, "end": 6017.28, "text": "meine, heute ist P-HP auch noch eines der verbreitetsten Backend Technologien überhaupt"}, {"id": 1365, "start": 6017.28, "end": 6025.44, "text": "und P-HP hat immer noch den Vorteil, es läuft überall, versuch mal irgendwie eine.NET Anwendung"}, {"id": 1366, "start": 6025.44, "end": 6033.68, "text": "beim 0-15-Hoster laufen zu lassen, ist nichts, P-HP, jeder billigste China-Chinesen-Hoster"}, {"id": 1367, "start": 6033.68, "end": 6060.56, "text": "an P-HP, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, da"}, {"id": 1368, "start": 6060.56, "end": 6084.8, "text": "ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfach"}, {"id": 1369, "start": 6084.8, "end": 6102.08, "text": "mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes"}, {"id": 1370, "start": 6102.08, "end": 6122.32, "text": "SQL drinne, da ist einfach mal nacktes SQL drinne, da ist einfach mal nacktes SQL drinne,"}, {"id": 1371, "start": 6122.32, "end": 6124.32, "text": "Oh, oh, oh, oh, oh!"}, {"id": 1372, "start": 6128.92, "end": 6129.92, "text": "Frontpage!"}, {"id": 1373, "start": 6133.62, "end": 6139.12, "text": "Also 1996 ist quasi das Web erste Mal zu dem geworden, was wir es heute kennen."}, {"id": 1374, "start": 6139.12, "end": 6144.12, "text": "JavaScript, CSS und Frontpage und... und..."}, {"id": 1375, "start": 6144.62, "end": 6146.62, "text": "Okay, die zwei Sachen, weil wir es heute kennen."}, {"id": 1376, "start": 6146.62, "end": 6152.62, "text": "Die anderen zwei Sachen glücklicherweise Geschichte mittlerweile."}, {"id": 1377, "start": 6177.12, "end": 6179.12, "text": "Windows 95."}, {"id": 1378, "start": 6191.12, "end": 6195.12, "text": "Ich hab damals sogar schon, also 96 nicht, aber 97, 98..."}, {"id": 1379, "start": 6195.12, "end": 6201.12, "text": "Ich hab damals ne Webseite gemacht, für richtig cringe, Leute."}, {"id": 1380, "start": 6201.12, "end": 6203.12, "text": "Zum Glück gibt's die heute nicht mehr."}, {"id": 1381, "start": 6203.12, "end": 6209.12, "text": "Richtig cringe, ich hab für meinen Diablo 1 Charakter eine Roll..."}, {"id": 1382, "start": 6209.12, "end": 6213.12, "text": "So eine Art Rollplaying-Webseite gemacht."}, {"id": 1383, "start": 6213.12, "end": 6215.12, "text": "Oh Gott, das ist so peinlich, Alter."}, {"id": 1384, "start": 6215.12, "end": 6217.12, "text": "Wenn ich mich... Das ist richtig fremd schämen."}, {"id": 1385, "start": 6217.12, "end": 6220.12, "text": "Ich fremd schäme mich für mich selbst, Alter."}, {"id": 1386, "start": 6222.12, "end": 6225.12, "text": "Da hab ich dann... Da hab ich dann Hintergrundstory und Zeug und..."}, {"id": 1387, "start": 6225.12, "end": 6227.12, "text": "Oh, Alter."}, {"id": 1388, "start": 6227.12, "end": 6233.12, "text": "Richtig schlecht."}, {"id": 1389, "start": 6233.12, "end": 6235.12, "text": "Oh, Mann."}, {"id": 1390, "start": 6235.12, "end": 6237.12, "text": "Egal, weiter."}, {"id": 1391, "start": 6237.12, "end": 6240.12, "text": "Es gibt eh paar richtige Cringe-Sachen von mir."}, {"id": 1392, "start": 6240.12, "end": 6244.12, "text": "News-Crew-Post zu Mario 64 und sowas, wo ich die Leute ausgelacht hab,"}, {"id": 1393, "start": 6244.12, "end": 6246.12, "text": "dass sie was nicht hinkriegen."}, {"id": 1394, "start": 6246.12, "end": 6250.12, "text": "Also ich würde mich selbst nicht mögen als Kind."}, {"id": 1395, "start": 6250.12, "end": 6253.12, "text": "Ich weiß nicht, vielleicht geht's ja noch jemand zu."}, {"id": 1396, "start": 6253.12, "end": 6258.12, "text": "Also wenn ich als... So wie ich als Kind war, wenn ich mich heute mit mir"}, {"id": 1397, "start": 6258.12, "end": 6262.12, "text": "auseinandersetzen müsste, würde ich mir mega auf den Sack gehen."}, {"id": 1398, "start": 6262.12, "end": 6265.12, "text": "Da bin ich mir sicher."}, {"id": 1399, "start": 6265.12, "end": 6267.12, "text": "Eine Clan-Page."}, {"id": 1400, "start": 6267.12, "end": 6269.12, "text": "Haben wir damals auch."}, {"id": 1401, "start": 6269.12, "end": 6271.12, "text": "Wir haben damals für CS... Was war denn das?"}, {"id": 1402, "start": 6271.12, "end": 6273.12, "text": "CS052 oder sowas."}, {"id": 1403, "start": 6273.12, "end": 6276.12, "text": "Das muss aber schon eine Half-Life-Release gewesen sein."}, {"id": 1404, "start": 6276.12, "end": 6279.12, "text": "Haben wir auch eine Clan-Homepage gemacht."}, {"id": 1405, "start": 6279.12, "end": 6282.12, "text": "Hab ich gemacht mit einem aus der Schule."}, {"id": 1406, "start": 6282.12, "end": 6286.12, "text": "CS Clan-Homepage."}, {"id": 1407, "start": 6286.12, "end": 6288.12, "text": "Oh."}, {"id": 1408, "start": 6288.12, "end": 6290.12, "text": "Front-Page."}, {"id": 1409, "start": 6290.12, "end": 6292.12, "text": "Leute, jetzt wird's..."}, {"id": 1410, "start": 6292.12, "end": 6294.12, "text": "Jetzt wird's Monarch erst."}, {"id": 1411, "start": 6294.12, "end": 6322.12, "text": "We're going to create a page from a wizard."}, {"id": 1412, "start": 6322.12, "end": 6324.12, "text": "Guck mal hier."}, {"id": 1413, "start": 6324.12, "end": 6326.12, "text": "Leute, Leute."}, {"id": 1414, "start": 6326.12, "end": 6338.12, "text": "Connect using SSL, das gab's damals auch schon."}, {"id": 1415, "start": 6338.12, "end": 6350.12, "text": "Kein Magier, ein Zauberer."}, {"id": 1416, "start": 6350.12, "end": 6352.12, "text": "Schon spät, ja."}, {"id": 1417, "start": 6352.12, "end": 6361.12, "text": "Die Front-Page-Geschichte gucken wir noch fertig."}, {"id": 1418, "start": 6361.12, "end": 6376.12, "text": "Alter, wie das ausschaut."}, {"id": 1419, "start": 6376.12, "end": 6380.12, "text": "Mail2 geht heute auch noch."}, {"id": 1420, "start": 6380.12, "end": 6384.12, "text": "Schönes Windows 97-Design."}, {"id": 1421, "start": 6384.12, "end": 6388.12, "text": "Soll ich euch mal was zeigen, was auch noch aus dieser Zeit..."}, {"id": 1422, "start": 6388.12, "end": 6391.12, "text": "Sogar in Windows 11, glaube ich, noch drin ist."}, {"id": 1423, "start": 6391.12, "end": 6400.12, "text": "Guckt mal."}, {"id": 1424, "start": 6400.12, "end": 6405.12, "text": "Der Icon-Dialog."}, {"id": 1425, "start": 6405.12, "end": 6412.12, "text": "Und davon dann sowas hier zum Beispiel, ja."}, {"id": 1426, "start": 6412.12, "end": 6414.12, "text": "Sowas hier."}, {"id": 1427, "start": 6414.12, "end": 6416.12, "text": "Guckt euch das Icon an."}, {"id": 1428, "start": 6416.12, "end": 6432.12, "text": "Das ist straight aus Windows 3.11 oder so."}, {"id": 1429, "start": 6432.12, "end": 6435.12, "text": "Oh, findet ihr nicht auch, dass das super Corporate-mäßig aussieht?"}, {"id": 1430, "start": 6435.12, "end": 6438.12, "text": "Lila Hintergrund, lila Schrift."}, {"id": 1431, "start": 6438.12, "end": 6441.12, "text": "Das hätte meinem damaligen Lehrer in der Schule gefallen."}, {"id": 1432, "start": 6441.12, "end": 6443.12, "text": "Leila, leila, leila."}, {"id": 1433, "start": 6443.12, "end": 6446.12, "text": "Heute verstehen die meisten da unter einen Schlager,"}, {"id": 1434, "start": 6446.12, "end": 6465.12, "text": "aber der war seinerzeit schon voraus."}, {"id": 1435, "start": 6465.12, "end": 6468.12, "text": "Disturbingly powerful features."}, {"id": 1436, "start": 6468.12, "end": 6473.12, "text": "Das ist auch so eine Redewendung, die benutzt er wahrscheinlich öfters, weil..."}, {"id": 1437, "start": 6473.12, "end": 6478.12, "text": "Vielleicht ein bisschen verstörend mächtige Features."}, {"id": 1438, "start": 6478.12, "end": 6483.12, "text": "Ja, alles klar."}, {"id": 1439, "start": 6483.12, "end": 6486.12, "text": "VBScript, MonkaS."}, {"id": 1440, "start": 6486.12, "end": 6490.12, "text": "Jetzt ist vorbei."}, {"id": 1441, "start": 6490.12, "end": 6493.12, "text": "Na, Gott sei Dank ist es JavaScript geworden und nicht VBScript."}, {"id": 1442, "start": 6493.12, "end": 6496.12, "text": "Ich meine JavaScript war auch lange Jahre übelster Abfuck."}, {"id": 1443, "start": 6496.12, "end": 6498.12, "text": "Aber VBScript wäre ja, also..."}, {"id": 1444, "start": 6498.12, "end": 6501.12, "text": "Ich weiß nicht, was ich schlimmer finden würde."}, {"id": 1445, "start": 6501.12, "end": 6504.12, "text": "Also das ist noch schlimmer als JavaScript."}, {"id": 1446, "start": 6504.12, "end": 6532.12, "text": "Ich bin halt schon wütend darüber."}, {"id": 1447, "start": 6532.12, "end": 6535.22, "text": "Jetzt wundert sich keiner mehr, warum Javascript jahrelang so kacke war, oder?"}, {"id": 1448, "start": 6562.12, "end": 6568.12, "text": "Andresen hat am Anfang wirklich den Kurs von Javascript geformt, bis zum heutigen Tag."}, {"id": 1449, "start": 6568.12, "end": 6572.12, "text": "Zum Beispiel hat Andresen gesagt, dass das kein kompiliertes Wissen sein kann,"}, {"id": 1450, "start": 6572.12, "end": 6576.12, "text": "denn ich will, dass Leute die Kode einfach direkt in ihre HTML-Pages reintun können."}, {"id": 1451, "start": 6576.12, "end": 6582.12, "text": "Das ist eine Design-Decision, die uns bis zur Web-Assemblung letztendlich durchgeführt wurde."}, {"id": 1452, "start": 6582.12, "end": 6584.12, "text": "Und dann gibt es CSS."}, {"id": 1453, "start": 6584.12, "end": 6586.12, "text": "Du weißt, dass CSS nicht wirklich ein neues Konzept war."}, {"id": 1454, "start": 6586.12, "end": 6589.12, "text": "Viola hatte ein Konzept von Style Sheets."}, {"id": 1455, "start": 6589.12, "end": 6593.12, "text": "Viele Leute haben über die Jahre verschiedene Style Sheet-Designen vorgeschlagen."}, {"id": 1456, "start": 6593.12, "end": 6595.12, "text": "Das war ein echter Community-Effort."}, {"id": 1457, "start": 6595.12, "end": 6597.12, "text": "Es gab ein bisschen Design-Kompetition."}, {"id": 1458, "start": 6597.12, "end": 6601.12, "text": "Und es wurde von Håkon William Leigh gewonnen."}, {"id": 1459, "start": 6601.12, "end": 6603.12, "text": "Und es sieht nicht wirklich aus wie..."}, {"id": 1460, "start": 6603.12, "end": 6606.12, "text": "Also von vorn an würde ich sagen, das ist ein Norweger."}, {"id": 1461, "start": 6606.12, "end": 6609.12, "text": "Aber der Rest, keine Ahnung."}, {"id": 1462, "start": 6609.12, "end": 6611.12, "text": "... modernes CSS."}, {"id": 1463, "start": 6611.12, "end": 6613.12, "text": "Es hat keine Family Bracers."}, {"id": 1464, "start": 6613.12, "end": 6617.12, "text": "Ja, aber es hat schon, dass es Family heißt."}, {"id": 1465, "start": 6617.12, "end": 6620.12, "text": "Es hat schon gewisse Ähnlichkeiten zu heutigem CSS."}, {"id": 1466, "start": 6620.12, "end": 6623.12, "text": "Håkon continue working with a community group"}, {"id": 1467, "start": 6623.12, "end": 6627.12, "text": "and they eventually shaped that into what we have as CSS today."}, {"id": 1468, "start": 6627.12, "end": 6629.12, "text": "Although browsers were very slow to adopt it in any kind of..."}, {"id": 1469, "start": 6629.12, "end": 6633.12, "text": "On-Size, Point, Units, Pixel, Millimeter."}, {"id": 1470, "start": 6633.12, "end": 6635.12, "text": "Das gibt es heute alles."}, {"id": 1471, "start": 6635.12, "end": 6636.12, "text": "All right then."}, {"id": 1472, "start": 6636.12, "end": 6638.12, "text": "So, what about accessibility?"}, {"id": 1473, "start": 6638.12, "end": 6640.12, "text": "That has to come in somewhere along the line."}, {"id": 1474, "start": 6640.12, "end": 6643.12, "text": "It's obviously very important to us as web developers today."}, {"id": 1475, "start": 6643.12, "end": 6645.12, "text": "Something we have to know and think about."}, {"id": 1476, "start": 6645.12, "end": 6647.12, "text": "Jetzt mal seriously."}, {"id": 1477, "start": 6647.12, "end": 6650.12, "text": "99% der Web-Developer scheisten komplett auf accessibility."}, {"id": 1478, "start": 6650.12, "end": 6656.12, "text": "It's kind of surprising how early it was that accessibility became a thing for the web."}, {"id": 1479, "start": 6656.12, "end": 6658.12, "text": "And it's a good job that it did."}, {"id": 1480, "start": 6658.12, "end": 6664.12, "text": "So, here in Australia you've got the Disability Discrimination Act of 92."}, {"id": 1481, "start": 6664.12, "end": 6666.12, "text": "And it does not talk about the web,"}, {"id": 1482, "start": 6666.12, "end": 6670.12, "text": "because obviously the web was too new for it to talk about that."}, {"id": 1483, "start": 6670.12, "end": 6672.12, "text": "But it doesn't exclude the web either."}, {"id": 1484, "start": 6672.12, "end": 6677.12, "text": "And this act says by default everything has to have reasonable adaptations."}, {"id": 1485, "start": 6677.12, "end": 6680.12, "text": "Die Frameworks können das überhaupt nicht machen."}, {"id": 1486, "start": 6680.12, "end": 6684.12, "text": "Woher soll das Framework wissen, was ein guter Alttext für dieses Image ist?"}, {"id": 1487, "start": 6684.12, "end": 6687.12, "text": "Das macht keiner so richtig heutzutage."}, {"id": 1488, "start": 6687.12, "end": 6690.12, "text": "Wie gesagt, es ist ein Unterschied zwischen, man sollte es machen,"}, {"id": 1489, "start": 6690.12, "end": 6693.12, "text": "und es würde zum guten Ton gehören und man macht es."}, {"id": 1490, "start": 6693.12, "end": 6698.12, "text": "And so that automatically applied to the web at the very moment it was first invented."}, {"id": 1491, "start": 6698.12, "end": 6700.12, "text": "And other countries had similar rules."}, {"id": 1492, "start": 6700.12, "end": 6705.12, "text": "Zählt man mit DICK auch unter den Disability Act?"}, {"id": 1493, "start": 6705.12, "end": 6708.12, "text": "Berners-Lee wusste, dass sie etwas dazu tun würden."}, {"id": 1494, "start": 6708.12, "end": 6711.12, "text": "Er schrieb eine Nachricht ins Newsletter in 1996,"}, {"id": 1495, "start": 6711.12, "end": 6714.12, "text": "hey, was sind die besten Praxen? Was machen die Leute?"}, {"id": 1496, "start": 6714.12, "end": 6716.12, "text": "Wie werden wir das gut funktionieren?"}, {"id": 1497, "start": 6716.12, "end": 6717.12, "text": "Und dann, das nächste Jahr,"}, {"id": 1498, "start": 6717.12, "end": 6721.12, "text": "hat das eine große Sitzung mit einem US-Senator in der US-White House gegründet."}, {"id": 1499, "start": 6721.12, "end": 6724.12, "text": "Und sie haben die Web-Accessibility-Initiative gegründet."}, {"id": 1500, "start": 6724.12, "end": 6730.12, "text": "And that gave some confidence to the US government to update their Section 508 rules the following year"}, {"id": 1501, "start": 6730.12, "end": 6735.12, "text": "to clarify that electronic services would be protected by that legislation."}, {"id": 1502, "start": 6735.12, "end": 6739.12, "text": "So it was really obviously a legal requirement at that point."}, {"id": 1503, "start": 6739.12, "end": 6742.12, "text": "And to help web developers actually do this..."}, {"id": 1504, "start": 6742.12, "end": 6744.12, "text": "Es ist ein legal requirement."}, {"id": 1505, "start": 6744.12, "end": 6749.12, "text": "Aber ab da haben alle Seiten angefangen, Flash zu verwenden,"}, {"id": 1506, "start": 6749.12, "end": 6754.12, "text": "was überhaupt nicht accessibility hatte."}, {"id": 1507, "start": 6754.12, "end": 6757.12, "text": "Also ab da, wo es legal requirement ist,"}, {"id": 1508, "start": 6757.12, "end": 6759.12, "text": "benutzen alle Flash und es funktioniert damit nicht."}, {"id": 1509, "start": 6759.12, "end": 6788.12, "text": "Also, dass sie da dran gedacht haben 1998,"}, {"id": 1510, "start": 6788.12, "end": 6800.12, "text": "muss man wirklich mal sagen, Hut ab."}, {"id": 1511, "start": 6800.12, "end": 6817.12, "text": "Oder, man lässt es einfach bleiben, wie 90% der Entwickler heutzutage."}, {"id": 1512, "start": 6817.12, "end": 6820.12, "text": "Oh, MonkaS."}, {"id": 1513, "start": 6820.12, "end": 6822.12, "text": "ASP.NET 1."}, {"id": 1514, "start": 6822.12, "end": 6823.12, "text": "Okay, der Typ ist von Microsoft."}, {"id": 1515, "start": 6823.12, "end": 6826.12, "text": "Aber jetzt wird es schmerzhaft, Leute."}, {"id": 1516, "start": 6826.12, "end": 6844.12, "text": "Jetzt wird es schmerzhaft."}, {"id": 1517, "start": 6844.12, "end": 6857.12, "text": "Oh nein."}, {"id": 1518, "start": 6857.12, "end": 6861.12, "text": "Ich ahne, jetzt kommt Webforms."}, {"id": 1519, "start": 6861.12, "end": 6862.12, "text": "Ich ahne, jetzt kommt Webforms."}, {"id": 1520, "start": 6862.12, "end": 6871.12, "text": "Es gibt kaum was Schlimmeres."}, {"id": 1521, "start": 6871.12, "end": 6880.12, "text": "Jetzt kommt Webforms."}, {"id": 1522, "start": 6880.12, "end": 6888.12, "text": "Es kommt Webforms."}, {"id": 1523, "start": 6888.12, "end": 6890.12, "text": "Okay, so, we're now in about 2002."}, {"id": 1524, "start": 6890.12, "end": 6903.44, "text": "webforms kommt jetzt. Gibt es sowas ähnliches eigentlich noch? Ich glaube webforms würden"}, {"id": 1525, "start": 6903.44, "end": 6905.96, "text": "theoretisch immer noch funktionieren, das benutzt plus keiner mehr."}, {"id": 1526, "start": 6905.96, "end": 6934.72, "text": "So langsam, jetzt wirst du dir noch noch wieder nicht."}, {"id": 1527, "start": 6934.72, "end": 6939.28, "text": "Das ist nur mit 20 Jahren, mit Hardware aus 20 Jahren aus der Zukunft verwenden kannst."}, {"id": 1528, "start": 6939.28, "end": 6952.0, "text": "Es ist webforms. MonkaS."}, {"id": 1529, "start": 6952.0, "end": 6974.28, "text": "Webforms, stell euch mal vor, so haben Leute Webseiten erstellt."}, {"id": 1530, "start": 6974.28, "end": 6994.04, "text": "Diese Müll haben wir zu verdanken, optimiert für Microsoft Internet Explorer in 640x480."}, {"id": 1531, "start": 6994.04, "end": 7010.2, "text": "Das ist absolutes Positioning auf der Seite. Wahnsinn."}, {"id": 1532, "start": 7010.2, "end": 7022.4, "text": "Guck mal, C-Sharp für einen Browser. Wobei das alles Server-Site gerendert wurde."}, {"id": 1533, "start": 7022.4, "end": 7044.0, "text": "So, ich werde sagen, wenn wir auf diesen Knopf klicken, werde ich den Text auf den Knopf wechseln, um zu sagen, du hast klickt, und dann DateTime.now, okay, das wieder anrufen. Und dann, wenn ich meinen Knopf klicken, siehst du, ich bekomme die Zeit, das ist ziemlich schön, und ich kann es wieder klicken, und jedes Mal, wenn ich es klick, wird die Zeit erneut."}, {"id": 1534, "start": 7044.0, "end": 7063.28, "text": "Das Ding rendert unter der Haube immer eine komplett neue Seite, oder?"}, {"id": 1535, "start": 7063.28, "end": 7091.08, "text": "Wir können das nicht sogar mit modern Tech machen. Wie machen die das? Also, das Trick ist, wie das implementiert wird. Wenn wir hier in ViewSource gehen, sehen wir diesen riesigen Blob von Basis64-Encoded-Stuff. Es ist ein bisschen schwer zu lesen, ich weiß. Können wir das mal wechseln? Okay, also wir haben einen riesigen Basis64-Blob, und das repräsentiert den UI-Statement, also eine objektorientierte Repräsentation der UI, die in diesen Blob serialisiert wird. Und wenn ich einen Knopf klicken, senden sie das an den Server, und dann geht es weiter."}, {"id": 1536, "start": 7093.28, "end": 7096.48, "text": "Also, das ist das Framework, was es aktuell so gibt, dass sie das ähnlich machen."}, {"id": 1537, "start": 7096.48, "end": 7122.48, "text": "...Code set, it builds the UI-State, it runs the action, that I've just put some logic for, and re-renders the new HTML, and also re-emits that Base64-Blob, so it can update again. And as a consequence, each version of that ends up in the browser's history. That's a pretty clever solution to doing interactivity. But it does some other quite nice solutions to certain problems as well. For example, back at this time, CSS was..."}, {"id": 1538, "start": 7122.48, "end": 7124.48, "text": "Der Handy-Dude soll mal seine Hand wegmachen."}, {"id": 1539, "start": 7124.48, "end": 7141.68, "text": "...and if you wanted to do something like horizontal and vertical centering of something, well, you could probably just forget it, unless you had like a PhD in browser quirks or something like that. But if you were an ASP-Net developer, you could do it quite well, you could just go like this. There we go, that's probably about the middle, isn't it?"}, {"id": 1540, "start": 7141.68, "end": 7159.68, "text": "...save that, go back into my browser, and there we go, that's nice. Now of course that worked just by disgustingly putting the absolute pixel positions into the page there, and this whole idea started to fall apart a few years later, for reasons that we'll talk about."}, {"id": 1541, "start": 7159.68, "end": 7171.68, "text": "Alright, so this was the hottest way of doing web development at that time, and it seemed like it would always be like that. Until a couple of years later, something new came..."}, {"id": 1542, "start": 7171.68, "end": 7173.68, "text": "...which absolutely shook things up."}, {"id": 1543, "start": 7173.68, "end": 7190.68, "text": "Leute! Es ist soweit! Ruby ist am Start! Das gucken wir uns das nächste Mal an. Wir haben jetzt ungefähr die Hälfte angeguckt, wir gucken morgen dann den Rest. Ruby! Endlich haben wir es geschafft!"}, {"id": 1544, "start": 7190.68, "end": 7208.68, "text": "Ich hätte nicht gedacht, dass Ruby da drinnen vorkommt. So maßgebend für... naja gut, Server-seitig, backend-seitig hat Rails schon das ganze ziemlich umgekrempelt."}, {"id": 1545, "start": 7208.68, "end": 7224.68, "text": "Ja, ich fand den Vorteil echt richtig spannend. Twitter hat sich heute wieder gefreut über mein Bahn-Geflame, einer hat geschrieben, er ist nur noch auf Twitter, dass er mich die Bahn beleidigen sehen kann."}, {"id": 1546, "start": 7224.68, "end": 7239.68, "text": "Was für euch witzig ist, ja, auf Twitter, was dort für Entertainment sorgt, ist für mich ernst. Ich mein das so. Ich schreib das nicht einfach, weil ich denke, ah, heute wird's mal wieder Zeit, die Bahn zu flamen. Nein, ich hab richtigen Hass auf die Bahn. Heute morgen auch wieder."}, {"id": 1547, "start": 7239.68, "end": 7259.68, "text": "Das erste, was ich mache, ist, ich steh auf, guck aufs Handy, seh mein Zugfeld aus. Guck, was der nächste Zugfeld auch aus. Du hast noch nen schicken neuen Fiat, den hab ich. Der ist auch nice. Der Fiat ist nice."}, {"id": 1548, "start": 7259.68, "end": 7275.68, "text": "Ja, Chat, Chat, serious, seriously. Meint ihr, ich wäre noch nicht auf die Idee gekommen, nachdem ich, also meint ihr, ich wäre nicht ohne den Chat auf die Idee gekommen, dass wenn ich mir ein neues Auto gekauft habe, ich das Auto auch benutzen könnte."}, {"id": 1549, "start": 7275.68, "end": 7290.68, "text": "Also, kommt, ist das bei euch, ist das eine Möglichkeit? Könnt ihr denken, ja, auf die Idee ist der Max vielleicht selbst gekommen, sein neues Auto zu benutzen."}, {"id": 1550, "start": 7290.68, "end": 7310.68, "text": "Ja, offensichtlich nicht. Was für ein Smartphone benutzt du? Ich hab ein iPhone aktuell. Ich hab hier daheim eine wilde Mischung aus iPads, iPhones und Androids."}, {"id": 1551, "start": 7310.68, "end": 7332.68, "text": "Dashboards. Das auch, das auch. PCOM config zeigen, die hab ich doch auf, die hab ich doch auf, auf, ähm."}, {"id": 1552, "start": 7340.68, "end": 7356.68, "text": "Ja, PCOM config. Sehr ausführlich, sehr, sehr viel drinne."}, {"id": 1553, "start": 7356.68, "end": 7371.68, "text": "Ok, Leute. Badge-Time. Ich glaube, es wird mal wieder Zeit für den Badge-Song, oder? Also für meine Outro-Musik."}, {"id": 1554, "start": 7371.68, "end": 7389.68, "text": "Äh. Mal wieder Outro-Musik. Also Leute, wir sehen uns. Bis denn, macht's gut. See you."}, {"id": 1555, "start": 7401.68, "end": 7416.68, "text": "Das war's für heute. Ich hoffe, es hat euch gefallen. Bis zum nächsten Mal."}, {"id": 1556, "start": 7431.68, "end": 7445.68, "text": "Ich hoffe, es hat euch gefallen. Ich hoffe, es hat euch gefallen."}]}