{"text": "das man sich auch jetzt mal deinenLodzettKada muryuuAuch schon jemand von euch da. Oh tatsächlichinstant spawn hier im chatKurzer stream ja lange geht es heute nicht vielleicht gucken wir uns die zweite hälfte von dem konferenztalk anIch muss mal gucken ich bin auch ziemlich kaputtMorgen tach homeoffice freitag muss ich noch mal nach frankfurt allerdings nur bis 14 uhr 30All michael 50 billionen also das sollte man aushalten sollte irgendwie erträglich sein allesUndEtwas gibt es neues erzählt bei irgendwas gibt es irgendwas spannendes bei euch ansonstenIch habe für heute gar nichts mehr ausgedacht wie gesagt wir gucken vielleicht ein paar sachenGucken die konferenztalk weiter oder ich bin ja auch nur ein bisschen über eine stunde daDann muss ich bettke bettke timeGabs überlegt hat gab es irgendwelche spannende news oder soEs wird irgendwas gehackt worden hat wieder microsoft irgendwelches dummes zeug gemacht wo man sich denktWie kommen die immer nur auf diese beknackten namenAber ich glaube da war nix oder war heute irgendwas war noch mal ganz ganz kurz im heise news tickerViele vertraut sabotage bei der bahn ich glaube die bahn die musst du gar nicht sabotieren die sabotieren sich schon genug selbstDas war wahrscheinlich die bahn selbst weil sie sich gedacht haben fuck sonst müssen wir wieder zugeben dass bei uns nix funktioniertKomm lass mal schnell das war schnell ein paar glasfaserkabel durchzwickelnMit dem knibbeck seitenschneiderMuss wenn schon der gute sein ich meine irgendwo müssen die millionen bei der bahn auch hin da kann man schon knibbeck seitenschneider holenMuss man nicht mit so billig all die ding rum handwerkenMein aldiAlso das nicht wirklich mein aldi aber ihr wisst was ich meine also den aldi hier in der näheDie haben jetzt ladesäulen für elektroautosIch glaube ich gehe demnächst da mal hinBeim ica war ich schonIch weiß gar nicht ob es free ist oder ob man sich anmelden muss also bei ica ist es free ist aber glaub limitiert auf 60 minutenOder irgendwas war da ich kann mich nicht mehr richtig dran erinnern aberIch war tatsächlich im ikea drin es ist ja nicht so alsHätte ich komplettFree entertainment neighbors wi-fi gemachtDieHug es aus habe morgen einen probe arbeitstag im zuge ich habe schon gelesen im zu würde ich dachteDacht dachten schonim Zuge eines Rekrutierungsprozesses für eine Ausbildung als Fachinformal, einRokkirekrutierungsprozess, mein Gott die denken alles, sie sind das nächste Googlemann, die haben immer immer Panik und mangels an Fachkräfte, aber ausbildenwill auch keiner. Egal, weiß ja nicht, gut anscheinend wollen sie ja ausbilden, sonsthätten sie keinen Rekrutierungsprozess. Hast du irgendwelcheTipps? Es kommt drauf an, was das für ein Termin ist. Also was kommt da auf dich zu?Die müssen sich ja irgendwie ein bisschen geäußert haben. Ist das nur so vorSelektion mit irgendwie ein bisschen Tests oder so oder ist das auch schonmit irgendwelche Leuten die Ahnung haben oder ist das denn das nurirgendwelche Personal-Tussis oder ja man auch das war jetzt war jetzt gemeinaber ja naja, sind das nur irgendwelche BWL Leute oder hast du auch wirklich dannjemanden wo du vielleicht die Ausbildung machst schon da? Ist schwierig, weil beiallen, du wirst eigentlich bei allen nicht mit irgendwie Vorkenntnisseglänzen können, weil die haben alle keine Ahnung von, wenn das irgendwelcheRekrutierungsdinger sind, irgendwelche Standard-Workflows, irgendwelchePersonal-Leute bringt dir irgendwie irgendwie erzählen was tolles gemachthast nichts, weil die können damit eh nichts anfangen. Da muss man sich danndementsprechend darauf einstellen. Sollte das allerdings was sein mit Leuten dieein bisschen Plan von der Technik haben, dann ist das natürlich nicht verkehrt.Ich weiß nicht, machen die irgendwelche Tests? Ich meine die müssen irgendwie gesagt haben, wasder Sache ist. Deutsche Bahn bevorzugt Prominente, aha. Da muss ich ein bisschengrößer noch auf YouTube werden, dass meine Züge auch bevorzugt werden.Na ja gut, letztendlich ist das aber auch irgendwie klar, wenn sich dairgendwie der sonst wie Oberboss von irgendwas ankündigt, dann wollen sieimmer einen guten Eindruck machen. Das ist bei uns auf der Arbeit ähnlich.Ich sitze hier in der Nähe dort wo auch unser 24-7-Support sitzt, das istrelativ großes Büro, da ist auch so eine große Monitoring Wand und so was, dasitze ich in der Nähe, ich bekomme das mit. Manchmal kündigt sich irgendwie derChef an, also der Ober-Oberchef kündigt sich an. Meistens führt er dannirgendwelche super krassen Millionen verdienenden Außendienstleute bei unsrum, weil irgendwie muss man ja Geld bekommen und da ist das bei uns auch so.Dann sagen die Leute so was in der Richtung wie, ja hier, mach mal schnellalle Fehler von der Wand weg. Und dann denke ich immer so, die Wand ist dazu daFehler anzuzeigen, wenn man Fehler weg macht von der Wand, die bestehen, aberdann, egal, mach mal Fehler weg, hier soll keiner rote Bilder sehen, hier soll keinerrote Icons sehen auf der Wand. Und dann werden dann immer irgendwelcheTabs aufgemacht mit Dashboards, wo überhaupt nichts drin ist, dass es nichtso aussieht, als ist da irgendwas rot. Oh man, das ist alles mit mehr Schein alssein immer.Naja.Schwachstelle, JavaScript, Sandbox, Bibliothek, MV2, hast du damals schon gehört?Nein, sagt mir gar nichts. VM2.js. Advanced VM Sandbox für Node.js.Was?Ah, das ist, wenn man irgendwelche Sachen ausführt, die einem vom Frontenduntergeschoben werden können. Tja. Wenn JavaScript auf dem Backend macht, ist eh selberdran schuld. Alter, warum ist mein KacW heute so ultra laut?Wie schwer ist es bei Big-Tech-Unternehmen als Software-Entwicklerreinzukommen? Das kann man pauschal nicht sagen. Wie vielErfahrung hast du, was für Technologien kannst du, kannst du einen Binarridgere-inverten? Das kann man pauschal nicht sagen, also manch einer würde sagen easy,ich habe 50 Anfragen und alle wollen sie mich haben. Ein großer nach demanderen, also nach dem Motto, und ein anderer würde sagen, ich find nix.Also, ja. Ach so, hier, sind mit den Ausbildern, 4-stündige Tests hab ichschon gemacht. Ach so, Vorstellungsgespräche mit dem Ausbilder, okay,das ist natürlich was anderes. Das ist was anderes. Dann hast du deneklichen Kram schon hinter dir und du kommst in die nähere Auswahl,beziehungsweise wahrscheinlich in die engere, die werden ja jetzt nicht 30Leute einladen oder so für. Tja, hab ich da irgendwelche Tipps? Also, ist jetzt nicht soals hätte ich mega viele Vorstellungsgespräche gemacht in meinemLeben, ja. Hat meistens eigentlich immer mehr oder weniger schnell geklappt beimir. Aber eine Sache kann ich mich an meine Ausbildung, hab ich glaube ich schon einpaar mal erzählt, in meiner Ausbildung dran erinnern, also was sich imNachhinein alles ganz gut rausgestellt hat, war, als ich damals, also für denAusbildungsplatz als Fachinformatiker Systemintegrations irgendwie vor 15Jahren, da hab ich auch einen Test vorher gemacht und danach bin ich quasi insVorstellungsgespräch rein, beziehungsweise wurde gefragt im Flur, werwill denn anfangen. Ich dachte mir, ich muss mal bald zum Zug, ich fang mal an.Zumindest als ich dann da reingegangen bin, hatte ich so spontan irgendwie dasBedürfnis zu sagen, dass ja manche Sachen irgendwie gemein waren in demEinstellungstest. Das ist vielleicht, ich sag nicht, dass das irgendwie derultimative Satz ist, den du sagen solltest. Nee, nee, auf gar nichts, sag den nicht. Ich meine nur, was mirdanach aufgefallen ist, dadurch konnte ich unbewusst, das habe ich nichtabsichtlich gemacht, dadurch konnte ich unbewusst ein bisschen steuern, was diejetzt sagen, weil wenn man sich nebeneinander, also nicht nebeneinander, wenn man sichvoreinander setzt, ja du sagst nichts, der sagt nichts, dann ist der natürlich imZugzwang irgendwas zu sagen. Ich meine jetzt nicht, dass du den voll labern sollst,so nach dem Motto, alter hier ich bin da, ich bin der geilste. Nee, aber so hat man zumindestdie Chance, so ein bisschen zu beeinflussen, was drankommt. Ja, vielleichtfindest du irgendein, vielleicht findest du irgendein Thema, was man mal so neben, ja nachder Begrüßung so im Nebensatz sagen kann, worauf er dann einsteigen kann.Ansonsten haben die halt schon, wenn es ein größerer Laden ist, irgendwelcheVorgehensworkflows, wie was ja, was da in den Gesprächen geführt wird.Zumindest dich anschweigen ist immer doof, weil dann wirst du im Zweifelsfallzu euch gefragt, was du eigentlich nicht gefragt werden willst.Sag ihm, du benutzt Arch, by the way, das ist ein guter Tipp.Nee, ich habe auch noch nichts bestellt, weder CPU noch GPU, aber ichhabe es mir immer noch vorgenommen. Dezember ist es soweit, Leute. Ich wartejetzt mal, was Intel noch vorstellt. Dezember gibt es neuen Rechner.Schenker Laptops, keine Ahnung. Also ich fand mal vor Jahren diese XMG, genauhier, XMG Dinger, ziemlich nice. Ich hatte die mal sogar vor zig Jahrenhatte ich oder wollte ich, ich weiß es gar nicht mehr. Irgendwas wegen Sponsoringmal gesprochen. Hat sich aber nichts ergeben und außerdem habe ich keineLaptops mehr. Also ich habe kein Laptop, also ich brauche auch kein Laptop.Ich kann da nichts zu sagen. Weiß ich echt nicht, was man da drauf achten mussbei Laptops. Ich meine, klar, die üblichen Geschichten, Tastatur, Bildschirm,Batterielaufzeit oder abziehungsweise Akku-Laufzeit, das weiß ich ja selbst.Ansonsten wüsste ich es nicht.Du sollst einen Taschenrechner mitnehmen zum Vorstellungsgespräch.Oh nee. Moment, als was machst du deine Ausbildung? Als Anwendungsentwicklerwollen die von dir, dass du irgendwelche bescheuerten Übungsaufgaben an derTafel löst oder was? Boah, da hätte ich jetzt keinen Bock drauf.Musst schon seinen Grund haben, warum ich einen Taschenrechner mitnehmen soll.Abschlussprüfungstipp, ja, den ultimativen Tipp für die Abschlussprüfungund eigentlich auch so ziemlich den einzigen Tipp für die Abschlussprüfung,den man braucht. Mach alte Abschlussprüfungen. Scheiß auf die Vorbereitung in der Schule,scheiß auf die Vorbereitung in der A- also, was ich meine ist, denk nicht,dass nur weil du gut in der Berufsschule warst, du automatisch gute Prüfungen schreibst,weil du Plan hast von dem, was in Betrieb gemacht wird, dass du automatisch gutePrüfungen schreibst, weil die IHK-Prüfungen haben nichts mit der Realität zu tun.Du musst die Art und Weise verstehen, wie die IHK Fragen stellt und auf IHK-WeiseAntworten lernen. Das brauchst du nicht im späteren Leben, es nützt dir nichts dazu,was du im Betrieb gelernt hast, es nützt dir nichts dazu, was du in der Berufsschulegelernt hast und du kannst es quasi nachdem du die Prüfung verstanden hast,auch wieder vergessen. Du wirst es in deinem Leben nie wieder brauchen, bis du stirbst.Was hoffentlich noch ein bisschen hin ist. Du musst alte Prüfungen machen,das ist das Einzige, was hilft. Und was meint ihr, Chet? Jemand, der drei Jahreeine Ausbildung gemacht hat und richtig gut ist in dem, was er macht und auch super Notenin der Berufsschule hat, aber sich keine alten Prüfungen angeguckt hat versus jemand,versus jemand, der den Beruf überhaupt nicht gelernt hat, der nie eine Ausbildung,der nie diese Ausbildung gemacht hat, sich allerdings zwei Monate lang auf die Abschlussprüfungvorbereitet, ohne je damit was gemacht zu haben. Was meint ihr, wer die bessere Prüfung schreibt?Also ich tippe auf den, der die Abschlussprüfung gelernt hat, weil es geht in der Abschlussprüfungnicht wirklich um Fachwissen beziehungsweise um Ahnung haben, es geht einfach um IHK Fragenverstehen und IHK Antworten liefern. Also du musst Abschlussprüfung machen. Wenn duAbschlussprüfung machst, du kannst dir in der Abschlussprüfung auch die alten Antwortenangucken und dann siehst du relativ schnell, ob das jetzt gecheckt hast oder nicht. Diehaben immer wieder diese, die haben immer wieder ähnliche Fragenstellungen. Sie sindAuszubildende in der Alligator GmbH oder irgendwie sowas, fängt es dann meistens an. Ihr Kollegefragt sie zu der Einrichtung eines neuen Desktop-Arbeitsplatzes. Wie gehen sie im Beratungsgespräch vor?Und irgendwie sowas kommt an. Ordnen sie die Begriffe zu. Tastatur, USB-Stick, Maus,Toilettenpapier, Smartphone. Und dann musst du dann irgendwie was einordnen. Das ist immerder gleiche Blödsinn. Also du musst auf jeden Fall Abschlussprüfung machen, anders gehtes nicht. Wir gucken das Video nach. Ja, wir gucken das gleich weiter. Wann kommt ein neuerPC bei mir in Frage? Wie gesagt, Ende des Jahres. Ende des Jahres kaufe ich einen. Richtigfette Kiste. Wir haben es letztens ausgerechnet. Wird wahrscheinlich um die 4500 Euro kosten.Easy Money, Easy Life, Any Primers. Ich wusste gar nicht, ob ihr wusstet, dass man, wennman Amazon Prime Account hat, den man mit Twitch verknüpft hat, kostenlos einen Streamer,den man gerne guckt und subscriben kann. Kostet euch nichts. Außer Amazon Prime. Man sagtes immer so. Ach, das ist doch alles kostenlos. Stimmt ja gar nicht. Man braucht ja AmazonPrime für. Aber wenn man Amazon Prime hat, kann man einen Streamer seiner Wahl unterstützen.Zum Beispiel mich, dass ich mir im Dezember einen 4500 Euro Rechner kaufen kann. Denkaufe ich mir auch so. Aber dann geht es nicht so sehr in die Kohle. Big Stonks Time.Ich kann keine Sellouts. Ist mir auch egal. Ihr müsst mich nicht subscriben. Du hattestnur ein Gespräch eingestellt. Ja, war bei mir bei der Ausbildung genauso. Habe ich jaschon erzählt. Das war das mit dem Typ, der sich quasi komplett eingeschwitzt. Das warein richtiger Schwitzer, Alter, beim Vorstellungsgespräch. Also nicht nicht nicht nicht in der Chef,sondern ein anderer Typ, der auch Vorstellungsgespräche am gleichen Tag hatte. Ich habe glaube ichin meinem Leben noch nie jemand gesehen, der so krass nervös war. Ich glaube, ich habewirklich, ich habe noch nie so einen nervösen Menschen gesehen. Ich war mit drei, nee, mitzwei anderen habe ich im Gang gesessen zum Vorstellungsgespräch da an dem Tag. Mit irgendeinemMädel, die hat die Ausbildung bekommen später, allerdings nicht in Frankfurt, sondern aneinem anderen Standort und mit so einem Anzugtyp. Und da hat wahrscheinlich Anzug angehabt,weil sein Vater ihm gesagt hat, zieh einen Anzug an. Alter, der Typ, der war so ultranervös. Der hat gezittert und geschwitzt. Der war, der war richtig fertig. Der war richtigfertig. Und als ich dann rausgekommen bin, ich bin da zuerst ins Vorstellungsgesprächgegangen, weil ich mir gedacht habe, ich muss mal schnell wieder zum Zug, also zur Bahn zurückfahren. Ich bin da zuerst, ich bin da der erste, der ins Vorstellungsgespräch gegangenist. Und als ich dann rausgekommen bin, da hat der Typ mich so angeguckt, so nach demMotto, und wie ist es gelaufen, wie ist es gelaufen. Und da habe ich so, so aus Spaßzu ihm eigentlich gesagt. Habe ich zu ihm gemeint, so, boah, Alter, was die alles wissenwollen. Das war eigentlich eher Joke. Ey, der Typ ist, der Typ ist fast ohnmächtig geworden.Der war eh schon, das war keine Absicht, Leute. Ohne Scheiß. Das war keine Absicht. Der warrichtig fertig, Alter. Ich habe den auch nie wieder gesehen. Keine Ahnung, also er scheintdie Stelle ja nicht gekriegt zu haben. Ich habe mir da gar nichts, ich habe mir da garnichts bei gedacht. Es war halt einfach so eine spontane blöde Antwort, ja. Der warrichtig fertig, Alter. Ich weiß nicht, was aus dem geworden ist. Ich weiß ja nicht,wie er heißt. Ich weiß nicht, was er dann gemacht hat. Er hat zumindest die Ausbildunganscheinend nicht gekriegt. Obatzdr, Dankeschön. Massive Subscriptions hier. Hast du was mitder Switch Pro mitbekommen? Nö. Switch Pro wird dann einfach neue Hardware sein, oder?Also muss ja. Und dann ist Frage, wie es mit Abwärtskompatibilität aussieht. Vielleichtwird das ein bisschen Richtung Gamecube und Wii von der Hardware. Das war ja im Prinzipdas Gleiche. Bis zur Wii U war das eigentlich mehr oder weniger die gleiche Technik. Bloßnur halt schneller. Ich halte von Zwischen-Konsolen-Releases nichts. Wenn es ein neues Konsolenrelease ist,okay, man, die Switch ist ja auch schon busy her jetzt. 2017 ist auch schon 5 Jahre alt.Können durchaus mal wieder was rausbringen. Ich meine, es gab 3 Games auf der Switch,die sich gelohnt haben zu kaufen. Der Rest ist eigentlich jetzt die Konsole komplettvon der Arsch gewesen. Wobei, das stimmt nicht. Das stimmt nicht. Es gab durchaus. Es gabvielleicht 5 Games. Die Donkey Kong-Teile waren gut. Mario Odyssey war gut. Splatoon,wenn man drauf steht, meinetwegen. Ich mochte ja persönlich, Splatoon war nicht meins.Link's Awakening Remake fand ich auch sehr niedlich, auch wenn es übelste Frame-Problemehatte. Es gab schon, sag mal so, aber unter 10 Games, für die sich die Switch lohnt.Also, weiß nicht, ich hab's mir komplett umsonst gekauft eigentlich, das Teil. Ichhab relativ viel Breath of the Wild gespielt, Mario Odyssey, das Link's Awakening Remake,aber ansonsten hält sich wirklich sehr in Grenzen. Ja, es könnte durchaus mal eine neueKonsolengeneration geben. Dass das Ding, also ich habe nichts davon mitbekommen, keine Ahnung,dass das Ding DLSS hat, das kann ich mir tatsächlich vorstellen, weil das ist ja ein komplettesNvidia-Teil, die Switch. Und, ja, warum nicht? Also der Shield TV beispielsweise und dieSwitch sind so unterschiedlich nicht, was Hardware angeht. Die Switch ist im Prinzipso eine Nvidia-Box, Nvidia-Android-TV-Box, nur ohne Android. Eigentlich wär's gar nichtso blöd gewesen, wenn Nintendo das auf Android-Basis gemacht hätte, zumindest optional die Möglichkeitgehabt hätte, in irgendein Android-System zu booten oder sowas, weil dann hättest duzumindest ein paar Games gehabt, die du spielen kannst, nicht nur fünf Stück. Gibt nix Neues.Ja, gibt, ja gut, was heißt das? Wie gesagt, mitgekriegt hab ich auch nix, aber es gibtja schon seit Jahren Gerüchte. Kann man doch flashen, wusste ich nicht, aber wundert michnicht. Wie gesagt, Shield TV und die Switch sind von dem Chip, also von der Kiste. Keingroßer Unterschied. Ich sag immer, wenn ich keinen Plan hab. Ich sag manchmal auch, wennich keinen Bock hab zu Sachen, wo ich mich auskenn, dass ich keinen Plan hab, aber indem Fall auch wirklich keinen Plan. Authentisch bleiben und Freundlichkeit ist immer gut.Ja, Freundlichkeit geb ich dir recht, authentisch würd ich dir im Prinzip auch recht geben,aber manche Sachen solltest du halt nicht sagen, auch wenn du's normalerweise so sagenwürdest. Na, wenn authentisch für dich ist, Digger, mach Auge, dann solltest du das vielleichtnicht sagen. Max, du nutzt doch VMWR. Funktioniert, Shared, Clipboard und so weiter. Nein, ähm,nee, nee, nee. Nee, nee, nee, funktioniert. Ich hab es erst letztens ausprobiert, kannstdich vergessen. Geht nicht. Deswegen ist Wayland auch der letzte Crap für virtualisiertesLinux. Weißt du, was das beste war? Wayland hat in VMWR noch nicht mal FPS gehabt. Alsohatte 0 FPS, kein Screen Refresh. Du musstest von Hand den Screen Refreshen. Also du musstestquasi das Fenster resizen, erst dann hat er das Screen Refreshed. Richtig kaputt. Dannmusstest du dann irgendeine Environment Variable setzen, dass es trotzdem ging. Ja, nächstesJahr wird das Jahr des Linux Desktops, ich sag's euch. Ja, wie gesagt, Physi Abschlussprüfungoder Fachinformatik Abschlussprüfung, genau das gleiche Kram. Ja, so sieht's aus. Dummschwärzergegen Fachkompetenz gewinnt. Nee, Dummschwärzer allein bringt dir nicht allzu viel für dieschriftliche Prüfung. Oder, Moment, oder meintest du die mündliche Abschlussprüfungoben? Vorhand. Wer auch immer das war. Äh, wer war denn das vorhand? Meintest du diemündliche Abschlussprüfung oder die schriftliche? Ich dachte du willst die schriftliche machen.Bei der mündlichen sieht das anders aus. Also bei der mündlichen solltest du zumindestschon Ahnung haben, was du da gemacht hast im Projekt. In der Suppe. Ja, bestes LeakedFoto. Dankeschön für den Sub. Stripes Massive Sub. 39 Monate, überlegt euch mal, wie langdas schon ist. Das sind ja schon über drei Jahre. Graser Scheiß. Ich auch nicht. Ichweiß nicht, ob ihr das wusstet, aber ich war auch noch nicht in einer Wüste. Leute,es entscheidet sich morgen, ob ich Mobile Tracks Games Sellout mache. Okay, sollte ichvielleicht so nicht sagen. Wenn das dann jemand hört, dann macht die kein Sellout mit mir.Wobei, ist mir auch egal. Ist halt Tracks Mobile Game. Ich werde es dann genauso überzeugendvortragen wie das Genshin Impact Sponsoring. Wobei ich denke, dass Genshin Impact an sichgar kein schlechtes Game ist. Genshin Impact auf ApoRed Star. Moment, das muss ich mirjetzt angucken. Genshin Impact ApoRed. Zeigt mal. Wo ist das? Okay. Wo ist das SponsoringGenshin Impact von ApoRed? Es muss doch irgendwo geben. Oder hat er das Video gelöscht? Daswill ich jetzt sehen. Hat er gelöscht? Ist es das hier? Ist es das hier? Jawoll. Jawoll.Das muss ich mir angucken. Auf trocken am Start ist er. Moment, das muss ich mir kurzangucken.Das ist doch vollkommen in Ordnung. Ist doch genauso mies wie meins. Brutal schön, naja.Das ist so geil. Das ist genau der gleiche Shit, den sie mir geschrieben haben, was mansagen soll. Null. Na gut, war wahrscheinlich die gleiche Agentur. Ach, Moment, das ist,das gibt es auch ungeschnitten? Ich dachte, das ist alles. Ich dachte, das ist alles.Ich meine, für wie viel haben die da bezahlt? Okay, ungeschnitten. Leute, ich muss dasjetzt sehen. Ich muss das jetzt sehen. Wo ist das? ApoRed ist, nee. Plamiert sich mit,was ist das für ein Video? Okay. Was für ein Video? Neues Mimivideo. Ich bin im deutschenYouTube-Game nicht, ich kenne die alle nicht. ApoRed kenne ich noch aus Call of Duty Zeiten.Das da? Der Typ? Also, aber Leon getroffen habe ich mir ziemlich wurscht. Meine Entschuldigungan ApoRed. Oh, come on. Was ist denn da schon wieder los? Okay, wohin muss ich? 1522. Okay.In einem Spiel steckt, und wie gut er sich auskennt. Auf geht's. Auch trocken am Start.Dieses heutige Video wird gesponsert von Genshin Impact, Freunde. Du liest es doch noch ab.Zu geil. Ist doch super. Woher hat er denn die angekattete Variante?Ganz ehrlich? Ich finde es gar nicht. Ach, vom Cutter. Okay, ganz ehrlich, mit dem Cutterwürde ich nicht mehr zusammenarbeiten, wenn der mein Material einfach an irgendwelcheLeute schickt. Unabhängig davon, ob das jetzt funny ist oder nicht, aber das gehört sichnicht. Meint ja ApoRed, war doch schon mal in einer Wüste. Leute, ich habe mir übelsteinen abgebrochen. Also, bevor wir das jetzt weiter gucken. Wir gucken gleich den Talkfertig, ja? Bevor wir das weiter gucken, Sekunde. Nur mal so, nur mal so. Also, nur mal zumVergleich mein Genshin Impact-Sponsoring, ja? Das ist auch nicht besser. Pass mal auf.So, wer es nicht gesehen hat, mein Genshin Impact-Sponsoring. Jetzt, obacht.Das bringt mich auch zum Partner des heutigen Videos. Genshin Impact ist ein Open-World-Adventure-Gamemit einer großen Anzahl verschiedener Charaktere im Anime-Style. Genshin Impact ist für PS5,PS4, PC, auch für Mobilgeräte, iOS und Android erhältlich. Die große atmosphärische offeneWelt ist ein Gieber zu erforschen. Oh Gott, das ist so schlecht. Eine Welt voller Geheimnissein der 7-Region, 7 Göttern. Wie könnte das anders sein? Auch 7 Elemente gibt, die kombiniertwerden können, um neue Synergien zu schaffen und noch mehr coole Angriffe auszuführen.Die geschlossene Karte von Genshin, wenn man nur Monstadt, Lyos und Mero mitzählt, istmehr als 5.900 Fußballfelder in der realen Welt. Das Spiel hat regelmäßig Inhaltsupdatesfür den kürzlich veröffentlichten Patch 3.1, der neue aufregende Region wie Sumeromit einem neuen Wüstengebiet bringt. Ich war noch nie in einer Wüste, aber ich kanndie geheimnisvolle Wüste, die alten Ruinen in Sumero ergänzen. Ich muss mich immer wegpissen,durch diesen Pate, Alter. Ich war noch nie in einer Wüste. Zu geil. Ich war noch niein einer Wüste, aber ich kann die geheimnisvolle Wüste, die alten Ruinen in Sumero erkunden.Und es gibt drei neue Helden im Spiel. Sino, ein 5-Sterne Electro, Kanans, ein 4-SterneHydro, beide recht mächtig und schließlich Nilo, ein 5-Sterne Hydro, recht mächtig miteinem Schwert. Zusätzlich zu den liebevoll gestalteten Anime-Visuals bietet jeder Charakterseine eigene spannende Hintergrundgeschichte und ermöglicht tiefgreifende Interaktionmit der Spielwelt. Zur Feier des Updates auf Version 3.1 zeigt Genshin Impact die Geschichteder Spieler in Genshin in Offline-Werbung auf der ganzen Welt. In Deutschland werdendie Erinnerungsspieler in der Münchner Hauptbahnhof gezeigt. Der Rest ist jetzt langweilig. Ichwar doch nie in einer Wüste, Alter. Darfst du sagen, wie viele du dafür bekommen hast?Ähm... Moment, ich muss mal kurz gucken, wo ich hier gewesen bin gerade. Keine Ahnung.Darf man fragen, wie viele du dafür bekommen hast? Bestimmt weniger als ApoRed. Geh ichmal von aus. Ich dürfte es wahrscheinlich sagen. Ich glaube, ich habe nichts unterschrieben,dass ich nichts sagen dürfte. Nicht sagen darf. Ich weiß nicht, ob ich sagen soll.Ja, 4-stellig ist das. Das kann ich sagen. Also im Ernst, 90 Sekunden, übelst krassestenSellout of Doom mache ich nicht unter 4-stellig. Und jetzt könnt ihr mal überlegen, wenn ichdas in der Richtung schon nicht unter 4-stellig mache, was ApoRed gekriegt hat. Guck mal,jetzt... Okay. Richtig coole Charaktere. Ob es jetzt ein Katzenmädchen ist, ein Fuchsmädchenoder ein Samurai. Eine richtig geile Option. Gibt es da einen Samurai? Ja, ich glaube,es gibt den ganzen Game einfach noch mal viel mehr Atmosphäre. Ah ja, gut. Alter, wo istdas Problem? Wo ist das Problem? Ganz ehrlich, der ließ den Krempel halt vor, hat keinenPlan davon. Ich habe auch keinen Plan davon gehabt, Mann. Wo ist das Problem? Außer ichfinde es wirklich nicht okay, ich meine, ich kenne das Video da vorn danach nicht, aberich finde es wirklich nicht okay, dass ein ungeschnittenes Material, das nicht gedachtist zum veröffentlichen, irgendwo liegt. Dass er sagt, dass er das Game fühlt. Okay,das habe ich tatsächlich nicht gesagt. Man hat mir aber angehört, wie sehr ich das Gamefühle, oder? Hi IQ Time. Postchamp? Die haben unterschiedliche Kulturen, die haben einfacheinen unterschiedlichen Vibe. Das heißt, ihr habt mega viel Abwechslung. Okay, ich findees insofern, wenn man es verkauft, als ich persönlich empfehle euch das, das ist blöd,aber ansonsten ist doch kein Unterschied zu Fernsehwerbung. Wie lang geht denn das? Esist gleich fertig, okay. Also muss man trotzdem sagen, Hut ab an den Cutter, dass der da drauswas gemacht hat. Ich meine, was willst du da draus schneiden? Wie willst du da drausein Wärmespot schneiden? Also mein. Geht das noch weiter? Wie, das war es jetzt oderwie? Moment, das geht das ganze Video über jetzt doch, oder wie? Kritische Hase. Ja,hat frei gesprochen, würde ich sagen. Ja gut, aber mein, wo ist das Problem jetzt? Ich findees immer ein bisschen blöd, wenn man die Sachen so verkauft, quasi so nach dem Motto, es liegtmir am Herzen. Ich empfehle, ich persönlich empfehle euch das, aber das hätte ich jetztin das Video nicht rein interpretiert. Don Cuyon, Dankeschön für den Sub. Ne, Raid ShadowLegends, die könne ich mal, das mache ich nicht. Ich mache mobile Crab Werbung demnächstvielleicht, seit denn die hören, dass ich sage, ich mache mobile Crab Werbung, wollenda nicht mal. NordVPN war auch wieder am Start, NordVPN erinnert sich dann immer wieder, aberdaran, wenn sie mit mir ein Video machen wollen, dass ich dieses Video gemacht habe, wo unterdem NordVPN auf dem Bild ist, das ist immer geil. NordVPN, irgendein random NordVPN Dudeschreibt eine Anfrage, ich sage, jo klar, machen wir NordVPN Sponsoring und dann fälltihnen immer wieder ein, ach ne, du bist ja der Kerl mit diesem Anti-VPN Video, ne ne,dann wollen wir doch nicht. Das ist auch geil, wobei ich denke, so langsam müssten Stomachgelernt haben. Leute, wo wir gerade beim Thema NordVPN sind, für alle, die es nicht gesehenhaben, VfB Stuttgart, beste Cyber Abwehr für VfB Fans. Das ist kein Fake Tweet, das istwirklich so. Wenn der VfB Stuttgart schon Werbung von NordVPN macht, dann sollte mansich aber YouTuber nicht so drüber aufregen. Achso. Ja, wir kommen jetzt den Talk gleichweiter. Noch fertig gucken, ob das was wird heute.Okay, Leute, falls ihr irgendwas übersehen habt, schreibt es doch mal in den Chat, ichglaube nicht. Wir gucken jetzt den restlichen Konferenztalk von gestern. Wir haben gesternangefangen, einen Konferenztalk zu gucken von der NDC Sydney. Da stehen sie alle aufdem Kopf. Oh, cringe-Joke, ich weiß. Und da ging es um die Geschichte, so ein bisschendie Geschichte des Internets und vor allem, was ich da dran ganz gut fand, so ein bisschenhistorisch die Web-Frameworks und Entwicklung von Browser und JavaScript, CSS und solcheGeschichten. Wir sind stehen geblieben, glaube ich, als es um Ruby on Rails ging. Ruby. Obhier sind wir stehen geblieben? Wir gucken uns einfach die letzte Minute noch mal an.Da geht es nämlich um Webforms und Webforms ist so ziemlich das Schrecklichste, was esje gegeben hat. Dort genug. Böse Zungen würden behaupten,es ist immer noch Müll. Leute, das ist mal Content hier, oder? VonApoRed zu einem HiIQ-Konferenztalk. Danach noch mal ein Excel-E-Sports. Was heißt Content?Es ist mein Reaction-Content, ja? Ist ja nicht so, als hätte ich da irgendwie einen Handschlagfür gemacht für den Content. Und wisst ihr, dass wir diesem Editor jahrzehntelange Anzeigenzu verdanken haben im Internet, wo dann da steht, diese Seite ist optimiert für den MicrosoftInternet Explorer 800 x 600? Genau wegen diesem Mist, weil es absolut positionierte Elementein der Webseite sind. Wenn ich das schon sehe, kriege ich wieder Anfälle. Excel-E-Sport.Ja, haben wir gestern schon geguckt. Ich war überrascht, dass es Excel-E-Sport gibt.Ja, Preserif, das habe ich gehört. Ich bin mir aber nicht sicher, ob es wirklich kommtoder ob das angedacht ist. Das habe ich auch schon gelesen. Und ich bin mir gar nichtsicher, in welchem Kontext ich das letztens gelesen habe. Es ging darum, dass man sicherhofft, dass eben als SAS-Features weiter Einzug in CSS erhalten. Ich weiß nicht, obdas nur ein Proposal ist oder wirklich dann kommen soll. Ja. Silverlight, oh je. Leute,Silverlight an sich war gar nicht so doof im Kontext zu der Zeit, wo Flash angesagtwar. Aber Silverlight kam mal raus. Ein paar haben Silverlight verwendet. Dann hat AppleFlash mehr oder weniger abgesägt und auch nichts anderes unterstützt. Aber Silverlightwar wieder tot. Ich weiß nicht, wie lange Silverlight gelebt hat. Eins, zwei Jahreoder so nicht lang.Das ist wahrscheinlich in der Mitte, oder? Dann schalte ich das, gehe zurück in meinenBrowser, reloade. Und da geht's los. Ich kann nach Hause gehen. Das ist toll. Das funktioniertnur, wenn man die absoluten Pixel-Positionen auf der Seite legen kann. Und diese Ideebegann ein paar Jahre später zu fallen. Also der hottest way in 2002 war eigentlichziemlicher Müll. Switchen mit Java-UI. Ich kenne auch Remote-Management-Interfaces mitJava-UI. Rails, Ruby. Ich bin ein riesen Fan, was Ruby angeht, die Programmiersprache.Ich mag Ruby. Leider ist Rails total in der Versenkung verschwunden und es benutzt keinermehr. Dementsprechend ist Ruby an sich auch nicht super beliebt. Wenn man mal zehn Jahrezurückguckt, vor zehn Jahren war Ruby auch schon auslaufend. Aber da gab es massig Zeugund ganz viele Ideen sind entstanden im Ruby-Umfeld. Wer mal Express.js-Seite gemacht hat in Node.js,das ist eindeutig von Ruby-Frameworks inspiriert. Das merkste. Und Rails war das Ding, wo dieLeute gesagt haben, wir sind jetzt Rockstar-Web-Entwickler. Ruby. Rails war wirklich nice. Man darf nichtvergessen, bis dahin haben die Leute Webforms gemacht und jetzt gibt es Ruby on Rails. Rubyon Rails ist in diesem ganzen Vortrag das erste moderne Web-Framework, so wie die heute nochfunktionieren. Wo man zumindest die Struktur wieder erkennt. Ruby on Rails hatte integriertDatenbank-Mikrations, Datenbank-Mapper, Views, Controller, Datenbank-Models, Task-Runner,also alles das, was man heute von den meisten Frameworks kennt, kommt irgendwie aus derRuby-Zeit, also aus der Rails-Zeit. Und übrigens der Typ, der Erfinder von Ruby on Rails, alsodieser David Heinemeyer-Hansen, der ist Rennfahrer mittlerweile. Der fährt irgendwelche, irgendwelcheRallies, hat wahrscheinlich genug Kohle verdient, aber, ja, Moncrustier macht er jetzt.Ruby on Rails-Benutzer waren ziemlich viele Hipster-Programmer dabei. Twitter war übrigensauch mal Rails. Ruby.Rails war nice. Rails ist nice. Rails ist immer noch aktiv, also GitHub, Ruby on Rails, esist jetzt nicht so als wäre das dead oder so. Die Verbreitung ist halt ziemlich zurückgegangen,aber es gibt immer noch viele, guck mal hier, 1500 Sterne, es gibt immer noch viele Rubyon Rails-Anwendungen, die maintained werden müssen, und Rails hat vor 5 Stunden den letztenPull-Request bekommen, also so ist es ja nett. GitHub ist immer noch Rails, ziemlich sicher,ja.Die Leute hatten Tumblr-Blocks, Gatschi-Buzz.Jetzt aber kein Rails-Tutorial, das letzte restliche Video, oder? Ne, ne, ne, sieht nichtso aus, Rails ist in zwei Minuten wieder durch.Webbrick, ja, stimmt, so ist das.Das war auch super easy, wenn man das mal mit anderen Sachen vergleicht. In PAP habendie Leute Handcrafted SQL noch schreiben müssen.In Rails musstest du das nicht.Übrigens, man muss sagen, ich finde immer noch Ruby ist eine super hübsche Programmiersprache.Die Einrückungen sind übrigens keine Pflicht, im Vergleich zu peißen, ja, also das machtman, weil es schick ist, aber man muss es nicht machen.Das war auch relativ neu in Rails, dass da so ein Kommandozeilen-Tool dabei hat, wo duSachen anlegen konntest, ohne dass du den ganzen Boilerplate da immer von Hand bastelnmusstest.Viele Leute haben vor Ruby nie was von Testing gehört, also viele haben damit... AirSpec,kennt jemand AirSpec? Quasi jedes halbwegs moderne Testing-Framework ist AirSpec, nurfür eine andere Sprache.Schöne SQL-Injection zeige ich wieder gleich.Ich glaube, man kann es nicht genug unterstreichen.Rails war das erste wirklich moderne Web-Framework, wenn man mal von der heutigen Zeit guckt.Alles andere davor war irgendwelcher Frickelshit.Rails war wirklich das erste, was so quasi die Art und Weise, auch wenn man sich maldie Ordner-Struktur anguckt, das hat da schon entscheidend mitgeprägt, wie das heute allesaussieht.Das sieht mehr oder weniger heute noch so aus, überall, egal wo ihr hinguckt, sei esals Weltkit-Anwendung oder eine ASP.NET-Anwendung, das sieht zählig aus.Ruby ist eine super Sprache, leider hat halt Ruby, außer dass es eine leise Sprache ist,und Rails hat Ruby quasi mitgecarried jahrelang, auch in der Beliebtheit her.Ganz viele anderen Libraries und Sachen sind entstanden, weil es eben Rails und das Ruby-Ökosystemgab.Allerdings Ruby an sich, ich weiß nicht warum, aber Ruby hat nie so diesen riesen Durchbruchgehabt als Sprache an sich, und gerade mit dem Abflachen von Rails, wenn ihr mich fragt,Ruby oder Python?Ich finde Ruby ist die deutlich schönere Sprache.Python ist auch okay, ist Ruby nicht saulangsam?Ruby ist zumindest schneller als Python, und das hält es ja auch nicht davon ab, benutztzu werden.Nicht viel, aber ist schneller.Ruby, Web 2.0!Ich glaube die JavaScript wurde etwa 2005 bis 2008 erneut geboren.Und eine der Dinge, die das erneut erneut erneut erneut erneut erneut erneut erneut, war das Web 2.0-Wave und die Konkurrenz darin.So, Web 2.0 war, als die Firmen realisierten, dass sie viel Kommerzwert von genieriertem Content erzielen können.Und wenn du ein User bist, welche Sites werden du dir Zeit verbringen, Content zu generieren?Das sind wahrscheinlich die, die für dich Spaß machen.Oh, ich muss mein Laptop anklicken.Das sind wahrscheinlich die, die einen schönen Interfacesystem haben.Also, es war viel Druck auf die Entwickler, die die besten Interfacesystemen erzeugen.So, dass die Entwickler ihre Zeit verbringen würden, um in diesen Bereichen zu arbeiten.Einige der besten Arbeiten in diesen Bereichen wurden von Google erzeugt.Das, was ich als neuer Entwickler von damals erinnere, war Google Maps.Das stimmt, Google Maps hat schon mehrfach mindblown, also am Anfang die pure Existenz von Google Maps, dann Street View, was ja jeder für unmöglich gehalten hat, aber Google konnte das halt mit ihrem massig Geld machen.Dann haben sie diese 3D-Ansicht mittlerweile, also Google Maps hat schon mehrfach gezeigt, was mit dem Browser möglich ist.Nö, habe ich nicht gesehen auf Netflix.Ajax.AJAX.XML.Ja, das stimmt.Aber gut, 2006 war das halt richtig geiler Shit.Ja, das stimmt.Ich meine, damals war es das Beste, was man verwenden konnte, ernsthaft.Es gab ja auch dann so ein paar Nachahmer von jQuery, so minimal jQuery, die angeblich dann besser, schneller und kleiner sein wollten.Ich hab vergessen, was es da alles gab.Irgendwas mit Z gab es da.Erinnert sich noch einer an diese JavaScript?Irgendwie was mit...JavaScript?Wie ist das?Zepto oder sowas?So minimal jQuery, nicht JavaScript, was laber ich denn?Zepto?Ja, jQuery.Ist es Zepto, oder?Ja, tatsächlich.Zepto.Jetzt haben die coolen Leute gesagt, jQuery ist plottet, Zepto ist nice.Krass, oder?Das wird kein Framework wieder schaffen.Je wieder.70% auf der top besuchten Seiten belammt jQuery benutzt.70.Das kriegt kein Vue.js, kein Svelte, kein Angular, kein React hin.React vielleicht noch am ehesten.Aber bestimmt auch nicht in den Regionen.Firebug, beste.Beste.Beste.Der Typ, der Firebug-Entwickler ist, glaube ich, dann von Google eingekauft worden für Chrome,wenn ich es noch richtig im Erinnerung habe.Firebug war eine Firefox-Erweiterung für Developer-Tools.Und vieles von den Überresten ist heute immer noch in Firefox.Und ich denke mal, deswegen hat Firefox nach wie vor auch noch die besten Developer-Tools.Gibi ist ein jQuery-Klon, habe ich ja nie was von gehört.Eine DevTools.Das größte, was man zu Browser-DevTools bekommt, ist, die Source in Notepad zu sehen.Das ist großartig.Und dieser Typ, Joe Hewitt, hat an Mozilla gearbeitet.Er ist einer der Founding-Engineer für Firefox.Aber dann ging er weg und fing an, Web-Applikationen zu bauen.Und er hat realisiert, dass es eine große Schmerz war, weil er nichts debugieren konnte.Also hat er einen Browser-Plugin gegründet, den Firebug.Und ich kann es euch zeigen.Hier habe ich Firefox und habe den Plugin installiert.Wenn ich auf den Klick rechts klicke, kann ich das Element inspektieren und ihr seht viele Sachen, die da sind, die da sind.Wir haben eine Konsole, HTML-View, wir können den CSS sehen, wir haben einen Script-Debugger.So sehen die Developer-Tools heute immer noch aus. Und warum?Weil irgendein Typ auf die Idee gekommen ist, wir machen eine Firefox-Erweiterung.Und wisst ihr, ich rate das jetzt einfach mal.Und wisst ihr, was ich glaube?Dass in der heutigen Zeit mit dem heutigen Firefox so ein Plugin gar nicht mehr möglich gewesen wäre.Weil die Firefox API auch immer weiter beschnitten wurde in den letzten Jahren.Also ich könnte mir vorstellen, dass du quasi das, was damals quasi die Erfindung der DevTools war,heute gar nicht mehr als Plugin überhaupt machen könntest.Deswegen fand ich es auch ein bisschen blöd, dass Firefox das immer weiter beschnitten hat.Ich frag mich schon seit Jahren, was denkt dann eigentlich Firefox?Wer sind denn die Anwender von Firefox?Die Oma um die Ecke?Der nur nach 15 Casual Boon, der außer Chrome und Safari nichts kennt, was vorinstalliert ist?Also ich bin der festen Überzeugung,Firefox hat sich blöderweise immer weiter von ihren Core-Anwendern wegentwickelt die letzten Jahre über.Trotzdem bin ich froh, dass es Firefox gibt.Damals hat noch keiner, wie es Code Extensions gedacht, Leute.Das ist übrigens, wahrscheinlich hat es auch kaum einer gesehen, das ist Chrome 1.0.Wow, WAP?Leute, WAP war das damals?Übrigens, nochmal jetzt an der Stelle zum Beweis.Es gibt doch diese Theorie, dass man, dass jeder, jeden Menschen auf der Welt über maximal, glaube ich, sechs oder sieben Ecken kennt.Weiß jetzt nicht, wie man das nennt.Aber ich kenne auch Steve Jobs.Über zwei Ecken.So ein Konsultentyp, der bei uns auf der Arbeit ist, der da irgendwas konsultet.Der war 2008 auf der Präsentation, wo Steve Jobs das iPhone vorgestellt hat.Also, Theorie wieder bestätigt.Weird Flex, das war kein Flex.Hat sich das wie nur ein Flex angeschaut.Ja.Das war immer noch eines der besten und gleichzeitig blödesten Ideen, was man machen konnte.Node.js.Na ja, Node ist bis heute nicht multithreaded.Oder was heißt nicht multithreaded? Du kannst kein Multithreading in Node machen.Ich glaube, du kannst mittlerweile Webworker-Shit und sowas in Node machen.Aber richtiges Multithreading ist in JavaScript nicht.Zumindest mit V8 JavaScript nicht.Ist Node.js eine gute Technologie?Muss man ganz klar sagen, ja ist es.Es ist nicht umsonst millionenfach adoptet worden.Man kann sich immer darüber lustig machen, was will man mit JavaScript auf dem Server, was soll man, warum Backends in Node.js.Aber ja, es hat schon seinen Sinn.Man kann natürlich sagen, es wurden nicht immer die besten Technologien auch adoptet.Aber es hat schon seinen Sinn gehabt.Gerade, dass die ganzen Frontend-Leute jetzt auf einmal easy irgendwelche Desktop-Anwendungen machen können mit Electron.Oder irgendwelche AP-Backends machen können.Das ging vorher nicht.Und in gewisser Weise, Node hatte tatsächlich was Cooles.Ich glaube, jetzt weiß ich auch, was er sagen möchte.Das ist kein Multithreading.Node hatte halt Multi-, wie nennt man das?Multi-, Multi-, es ist auch nicht Multi-Processing, wie nennt man das?Multi-, Multi-, Ausführung?Ich hab keine Ahnung.Weil wirklich Multithreaded, Asynchron, ja genau.Also wirklich Multithreaded ist es ja nicht.Du hast nicht mehrere Threads.Du hast einen Thread, der alles ausführt.Aber Konkurrent ist es, genau.Aber wenn der nichts macht oder auf I.O. wartet oder so was,dann kann der quasi asynchronen Bett gemacht, sich schlafen legen.Und das führt was anderes aus und dann springt es wieder zurück rein.Also ein bisschen so, wie das Async Await in.NET macht,nur das Async Await in.NET auch gleichzeitig komplett Multithreaded sein kann.Also dieses Reinspringen..NET hat standardmäßig nichts Eventloop-mäßiges oder so.Aber die haben sich das ja von.NET abgeguckt aus JavaScriptmit ihrer Async Await-Geschichte.Ja, aber das hat schon seinen Sinn gehabt.Es war eine gute und gleichzeitig blöde Idee mit Node.js.JavaScript.Leute, ich glaube, wir wären noch nicht fertig.Den Abschnitt gucken wir noch.Das war überlegen.Das war überlegen.Okay, Rails, Jackberry, Handlebars, okay.Handlebars.Ist Handlebars nicht diese komische Template,JavaScript-Template-Engine?So mit den Curly Braces und so was?Handlebars?So, dann gab es AngularJS, Ember, Backbone, Knockout.Okay, ehrlich gesagt, das Einzige,was ich davon mal hobbymäßig ein bisschen zum Basteln verwendet habe,war tatsächlich Ember.Und das hat mich so abgeschreckt von Frontend Frameworks,weil es einfach so unnötig aufgeblasen und kompliziertund man hat eigentlich gar nicht verstanden,was es macht war, dass ich da keinen Bock hatte.Richtig bloated.Knockout habe ich mir mal ganz kurz angeguckt,aber nie was mitgemacht.Ansonsten, meine zwei Lieblings Frameworks aktuell sindeindeutig Vue und Svelte und eigentlich hauptsächlich Svelte.Und wisst ihr, warum Svelte?Wisst ihr, wie es dazu gekommen ist?Durch den Chat.Hätte man nicht den Chat damals vorgeschlagen,lasst doch mal Svelte angucken,ich würde es wahrscheinlich nie angeguckt.Massive.High-Intelligenz-Quotient-Chat.Big Brain.Das ist die Mode schon wieder weg, oder wie?Lustig.Letztens war es noch da.Der Handytipp ist ja schon wieder da.Der Handytipp ist ja schon wieder da.AngularJS 1.8.Also, ich habe von vielen Angular-Fans gehört,so auch die letzten Jahre über,dass sie das erste Angular am besten fanden.Das erste AngularJS.Und das AngularJS war POG,und Angular ist bloated Mist.Sagen nicht ich, habe ich von vielen schon gehört.Wahrscheinlich ist es auch nicht so,sondern so ein bisschen verklärte,war alles so geil damals.Aber wahrscheinlich war AngularJS noch irgendwie übersichtlich,und AngularJS ist bloated AF.Backbone.Backbone gibt es heute immer noch.Hat letztens erst wieder irgendwelche Updates bekommen.Guck mal.Backbone.js.Nicht, dass ich mich da jetzt vertue.Na ja, letztens erst wieder.Aber...Na ja, letztens erst wieder.Knockout hat sich nie so richtig durchgesetzt.Das war eigentlich ganz cool.Damals.Boomer time.Guck mal.Wird nicht mehr.Is it dead?Okay, exellent.Da gucken wir morgen weiter.Wir sind bei 44 Minuten.Ich lasse das mal so auf.Passt.Das wird heute nämlich nix mehr.Was haben wir?Interview mit einem FFmpeg-Enthusiast.Ach, das ist der Typ da.Das ist meistens nicht lustig.Automatic Home Lab mit Ansible.Gucken wir uns auch angucken das nächste Mal.Firebase.Firebase.Gucken wir uns auch an.Gucken wir, wenn ihr klar was Gescheites.Battlefield Engine Upgraded.Was wollen sie da upgraden?Guck mal.Das wollte mir nicht ernsthaft erzählen,dass die Leute haben, die die Frostbite Engine sinnvoll upgraden können,wenn die nicht mal mehr Leute haben,die was anderes als Kisten auf der Map platzieren können.Gut.Mir ist auch klar, dass das unterschiedliche Leute sind.Aber die hatten so viele Probleme in der Entwicklung,weil sie niemand mehr hatten,der mit Frostbite was anfangen kann.Was wollen sie da großartig weiterentwickeln?Kriegen sie es nicht geschissen?Kriegen sie es?Oh, ich kriege meine eigenen Videos empfohlen, Pog.Okay, Leute.Ich muss jetzt ins Bett.Visual Studio Code Extensions gucke ich mir auch immer gerne an.Vielleicht was Neues dabei.Moin.Alles klar.So.Chat, Bettgetime.Wollt ihr Outro-Musik haben oder nicht?Ihr könnt es euch nicht aussuchen.Hast du die neue Suche im Archiv gesehen?Ne.Archiv.Punkt.Nein, das ist nicht Archiv.Punkt.Punkt.Punkt.Punkt.Punkt.Altyz.Es ist jetzt ein bisschen schneller, oder?Nee, das nicht.Wie ist denn dieезд alle Art von 보니까.Azure.zusammen oder einfach nur def einfach nur def ok ok neue suche stream ui ui ui aiaiaiaimit placeholder images auch noch pog guckt euch das mal an lazy loading placeholderimages jetzt jetzt gehts aber rund hier so was von responsive was denn dashast du ist das schon trends transcripted oder was hast du das auch schon gemachtdas ist nice leute ihr habt vielleicht gar mitgekriegt aber wir haben uns eineoder was heißt wir der serious max ich sag jetzt mal wir ich hatte minimal auch was damit zu tunwir haben uns eine vm gemietet in der cloud mit einer 3090 gtx und die macht jetzt grafikkartenmachine learning encoded transcript von meinem video also die lädt das video file und entstellteinen script über das was ich sage im video weiß gar nicht ob man sich das transcriptirgendwie anzeigen lassen kann kann man sich anzeigen lassen untertitel hier untertiteltld list.com noch nicht ok aber das ist das ist wirklich das ist das ist sehr nice ja das istdas ist wirklich richtig richtig nice jetzt kann man nämlich auch das archiv durchsuchenjetzt kann man das archiv durchsuchen nach zb keck das sage ich öfters na gut was sollich mal suchen ja publics gremple gremple guck und jetzt findet er das im transcript findeter guck mal der findet jetzt der man kann quasi das was ich im video sage jetzt volltextdurchsuchen das ist richtig richtig nice wie machst du die volltext suche hast du dasmit der mit der mit der postgres geschichte gemacht die ich geschrieben habe oder nimmstwas anderes postgres also nimmst du die postgres volltextsuche oder wobei das können wir ganzeinfach testen aber die volltextsuche nimmt null gremple stopp es ist die postgres volltextsuchewäre es die volltextsuche mit 3 grem index support dann wäre die datenbank jetzt deutlichgrößer aber man könnte zum beispiel nach pell suchen er wird trotzdem finden aber indem fall ist ja auch sinnvoll nach wörtern zu suchen i3 findet er nix ich glaube mal i3 hatdas das transcript zeug nicht findet gibt es nix ich glaube man muss in der suche mehrals drei buchstaben eingeben guck mal stats alter das hat das aber übertrieben hier guckteuch das mal an vor allem guckt mal wie stylisch wie stylisch das schon leht hier alles wasist das ist das craft gs oder was ist da way to dankmehr stunden gestreamt als letzten monat gesprochene wörter insgesamt ok ich habe also seit ichangefangen habe zu streamen nee in den nur in den indizierten videos habe ich sehe ichdas richtig neun fast zehn millionen wörter gesprochen alter ist das viel und nur 67.000einzigartige wörter gar nicht mal so schlecht oder durchschnittliche wörter pro stream diestatistik ist wirklich nicedie mod stats gibt es doch gibt es doch komm doch jetzt doch gleich top klipper der sebarrowas sonst ja und ich selber ach ja ich weiß warum ich hab was hab ich clips gemacht ichweiß nur was ich clips gemacht habe für videos wenn ich wenn ich manche ausschnitte in videosrein machen wollte twitch emotes better twitch tv emotes ffz emotes wurst wupp wurst sehrnice und wisst ihr was was noch viel geiler ist es gibt sogar darkseam und das sieht gescheitaus hast du die farben dir selbst ausgedacht oder ist das ist das irgendwie in den istdas ist das tailwind oder ist das irgendwas fertig ist oder was was was ist da unten druntercss technisch bootstrap customized ok ja richtig richtig muss man dazu ja sage ich massivepock das andere ist das andere ist ein custom custom thema ja beste bestes müssen wir solassen solis für die heckermans aber das ist eh das beste steam dafür ja ja ja jadas ist wirklich das ist wirklich richtig gut geworden muss man mal sagen kann manso können wir sogar master die agile github progas auger ja das ist das ist die einzigdie einzig wahre github gruppe in die man rein muss viele progas progas giga chat progaskann hier wer französisch nehmen egal leute ich kann jetzt aber ins bett gehen wir sehenuns bis denn macht's gut zu", "segments": [{"id": 1, "start": 30.0, "end": 49.24, "text": "das man sich auch jetzt mal deinen"}, {"id": 2, "start": 49.24, "end": 55.46, "text": "Lodzett"}, {"id": 3, "start": 55.46, "end": 57.46, "text": "Kada muryuu"}, {"id": 4, "start": 62.06, "end": 64.58, "text": "Auch schon jemand von euch da. Oh tatsächlich"}, {"id": 5, "start": 65.58, "end": 67.58, "text": "instant spawn hier im chat"}, {"id": 6, "start": 67.62, "end": 72.36, "text": "Kurzer stream ja lange geht es heute nicht vielleicht gucken wir uns die zweite hälfte von dem konferenztalk an"}, {"id": 7, "start": 76.2, "end": 78.2, "text": "Ich muss mal gucken ich bin auch ziemlich kaputt"}, {"id": 8, "start": 78.2, "end": 85.8, "text": "Morgen tach homeoffice freitag muss ich noch mal nach frankfurt allerdings nur bis 14 uhr 30"}, {"id": 9, "start": 88.36, "end": 94.36, "text": "All michael 50 billionen also das sollte man aushalten sollte irgendwie erträglich sein alles"}, {"id": 10, "start": 94.36, "end": 96.36, "text": "Und"}, {"id": 11, "start": 108.8, "end": 114.44, "text": "Etwas gibt es neues erzählt bei irgendwas gibt es irgendwas spannendes bei euch ansonsten"}, {"id": 12, "start": 115.72, "end": 119.44, "text": "Ich habe für heute gar nichts mehr ausgedacht wie gesagt wir gucken vielleicht ein paar sachen"}, {"id": 13, "start": 119.44, "end": 123.64, "text": "Gucken die konferenztalk weiter oder ich bin ja auch nur ein bisschen über eine stunde da"}, {"id": 14, "start": 124.36, "end": 127.04, "text": "Dann muss ich bettke bettke time"}, {"id": 15, "start": 141.16, "end": 144.8, "text": "Gabs überlegt hat gab es irgendwelche spannende news oder so"}, {"id": 16, "start": 144.8, "end": 151.24, "text": "Es wird irgendwas gehackt worden hat wieder microsoft irgendwelches dummes zeug gemacht wo man sich denkt"}, {"id": 17, "start": 151.48, "end": 153.92, "text": "Wie kommen die immer nur auf diese beknackten namen"}, {"id": 18, "start": 158.8, "end": 166.08, "text": "Aber ich glaube da war nix oder war heute irgendwas war noch mal ganz ganz kurz im heise news ticker"}, {"id": 19, "start": 166.08, "end": 173.36, "text": "Viele vertraut sabotage bei der bahn ich glaube die bahn die musst du gar nicht sabotieren die sabotieren sich schon genug selbst"}, {"id": 20, "start": 183.68, "end": 189.64, "text": "Das war wahrscheinlich die bahn selbst weil sie sich gedacht haben fuck sonst müssen wir wieder zugeben dass bei uns nix funktioniert"}, {"id": 21, "start": 189.64, "end": 196.88, "text": "Komm lass mal schnell das war schnell ein paar glasfaserkabel durchzwickeln"}, {"id": 22, "start": 199.44, "end": 201.44, "text": "Mit dem knibbeck seitenschneider"}, {"id": 23, "start": 202.52, "end": 207.84, "text": "Muss wenn schon der gute sein ich meine irgendwo müssen die millionen bei der bahn auch hin da kann man schon knibbeck seitenschneider holen"}, {"id": 24, "start": 209.32, "end": 211.8, "text": "Muss man nicht mit so billig all die ding rum handwerken"}, {"id": 25, "start": 216.4, "end": 218.4, "text": "Mein aldi"}, {"id": 26, "start": 218.4, "end": 225.0, "text": "Also das nicht wirklich mein aldi aber ihr wisst was ich meine also den aldi hier in der nähe"}, {"id": 27, "start": 225.8, "end": 228.4, "text": "Die haben jetzt ladesäulen für elektroautos"}, {"id": 28, "start": 229.24, "end": 231.36, "text": "Ich glaube ich gehe demnächst da mal hin"}, {"id": 29, "start": 232.8, "end": 234.8, "text": "Beim ica war ich schon"}, {"id": 30, "start": 239.92, "end": 246.24, "text": "Ich weiß gar nicht ob es free ist oder ob man sich anmelden muss also bei ica ist es free ist aber glaub limitiert auf 60 minuten"}, {"id": 31, "start": 246.24, "end": 249.76, "text": "Oder irgendwas war da ich kann mich nicht mehr richtig dran erinnern aber"}, {"id": 32, "start": 250.68, "end": 253.52, "text": "Ich war tatsächlich im ikea drin es ist ja nicht so als"}, {"id": 33, "start": 254.76, "end": 256.76, "text": "Hätte ich komplett"}, {"id": 34, "start": 256.92, "end": 259.36, "text": "Free entertainment neighbors wi-fi gemacht"}, {"id": 35, "start": 259.36, "end": 264.88, "text": "Die"}, {"id": 36, "start": 273.16, "end": 280.26, "text": "Hug es aus habe morgen einen probe arbeitstag im zuge ich habe schon gelesen im zu würde ich dachte"}, {"id": 37, "start": 283.6, "end": 285.6, "text": "Dacht dachten schon"}, {"id": 38, "start": 285.6, "end": 292.08, "text": "im Zuge eines Rekrutierungsprozesses für eine Ausbildung als Fachinformal, ein"}, {"id": 39, "start": 292.08, "end": 297.36, "text": "Rokkirekrutierungsprozess, mein Gott die denken alles, sie sind das nächste Google"}, {"id": 40, "start": 297.36, "end": 302.32, "text": "mann, die haben immer immer Panik und mangels an Fachkräfte, aber ausbilden"}, {"id": 41, "start": 302.32, "end": 308.4, "text": "will auch keiner. Egal, weiß ja nicht, gut anscheinend wollen sie ja ausbilden, sonst"}, {"id": 42, "start": 308.4, "end": 312.24, "text": "hätten sie keinen Rekrutierungsprozess. Hast du irgendwelche"}, {"id": 43, "start": 312.24, "end": 320.0, "text": "Tipps? Es kommt drauf an, was das für ein Termin ist. Also was kommt da auf dich zu?"}, {"id": 44, "start": 320.0, "end": 322.76, "text": "Die müssen sich ja irgendwie ein bisschen geäußert haben. Ist das nur so vor"}, {"id": 45, "start": 322.76, "end": 329.72, "text": "Selektion mit irgendwie ein bisschen Tests oder so oder ist das auch schon"}, {"id": 46, "start": 329.72, "end": 333.52, "text": "mit irgendwelche Leuten die Ahnung haben oder ist das denn das nur"}, {"id": 47, "start": 333.52, "end": 339.08, "text": "irgendwelche Personal-Tussis oder ja man auch das war jetzt war jetzt gemein"}, {"id": 48, "start": 339.08, "end": 345.38, "text": "aber ja naja, sind das nur irgendwelche BWL Leute oder hast du auch wirklich dann"}, {"id": 49, "start": 345.38, "end": 349.84, "text": "jemanden wo du vielleicht die Ausbildung machst schon da? Ist schwierig, weil bei"}, {"id": 50, "start": 349.84, "end": 354.16, "text": "allen, du wirst eigentlich bei allen nicht mit irgendwie Vorkenntnisse"}, {"id": 51, "start": 354.16, "end": 357.92, "text": "glänzen können, weil die haben alle keine Ahnung von, wenn das irgendwelche"}, {"id": 52, "start": 357.92, "end": 360.64, "text": "Rekrutierungsdinger sind, irgendwelche Standard-Workflows, irgendwelche"}, {"id": 53, "start": 360.64, "end": 366.4, "text": "Personal-Leute bringt dir irgendwie irgendwie erzählen was tolles gemacht"}, {"id": 54, "start": 366.4, "end": 375.04, "text": "hast nichts, weil die können damit eh nichts anfangen. Da muss man sich dann"}, {"id": 55, "start": 375.04, "end": 379.84, "text": "dementsprechend darauf einstellen. Sollte das allerdings was sein mit Leuten die"}, {"id": 56, "start": 379.84, "end": 383.92, "text": "ein bisschen Plan von der Technik haben, dann ist das natürlich nicht verkehrt."}, {"id": 57, "start": 383.92, "end": 389.24, "text": "Ich weiß nicht, machen die irgendwelche Tests? Ich meine die müssen irgendwie gesagt haben, was"}, {"id": 58, "start": 389.24, "end": 403.48, "text": "der Sache ist. Deutsche Bahn bevorzugt Prominente, aha. Da muss ich ein bisschen"}, {"id": 59, "start": 403.48, "end": 408.08, "text": "größer noch auf YouTube werden, dass meine Züge auch bevorzugt werden."}, {"id": 60, "start": 411.04, "end": 416.04, "text": "Na ja gut, letztendlich ist das aber auch irgendwie klar, wenn sich da"}, {"id": 61, "start": 416.04, "end": 420.12, "text": "irgendwie der sonst wie Oberboss von irgendwas ankündigt, dann wollen sie"}, {"id": 62, "start": 420.12, "end": 424.96, "text": "immer einen guten Eindruck machen. Das ist bei uns auf der Arbeit ähnlich."}, {"id": 63, "start": 424.96, "end": 429.88, "text": "Ich sitze hier in der Nähe dort wo auch unser 24-7-Support sitzt, das ist"}, {"id": 64, "start": 429.88, "end": 432.88, "text": "relativ großes Büro, da ist auch so eine große Monitoring Wand und so was, da"}, {"id": 65, "start": 432.88, "end": 437.28, "text": "sitze ich in der Nähe, ich bekomme das mit. Manchmal kündigt sich irgendwie der"}, {"id": 66, "start": 437.28, "end": 442.4, "text": "Chef an, also der Ober-Oberchef kündigt sich an. Meistens führt er dann"}, {"id": 67, "start": 442.4, "end": 447.36, "text": "irgendwelche super krassen Millionen verdienenden Außendienstleute bei uns"}, {"id": 68, "start": 447.36, "end": 454.92, "text": "rum, weil irgendwie muss man ja Geld bekommen und da ist das bei uns auch so."}, {"id": 69, "start": 454.92, "end": 459.84, "text": "Dann sagen die Leute so was in der Richtung wie, ja hier, mach mal schnell"}, {"id": 70, "start": 459.84, "end": 463.8, "text": "alle Fehler von der Wand weg. Und dann denke ich immer so, die Wand ist dazu da"}, {"id": 71, "start": 463.8, "end": 466.92, "text": "Fehler anzuzeigen, wenn man Fehler weg macht von der Wand, die bestehen, aber"}, {"id": 72, "start": 466.92, "end": 471.24, "text": "dann, egal, mach mal Fehler weg, hier soll keiner rote Bilder sehen, hier soll keiner"}, {"id": 73, "start": 471.24, "end": 476.68, "text": "rote Icons sehen auf der Wand. Und dann werden dann immer irgendwelche"}, {"id": 74, "start": 476.68, "end": 480.8, "text": "Tabs aufgemacht mit Dashboards, wo überhaupt nichts drin ist, dass es nicht"}, {"id": 75, "start": 480.8, "end": 486.32, "text": "so aussieht, als ist da irgendwas rot. Oh man, das ist alles mit mehr Schein als"}, {"id": 76, "start": 486.32, "end": 488.84, "text": "sein immer."}, {"id": 77, "start": 490.72, "end": 493.72, "text": "Naja."}, {"id": 78, "start": 494.72, "end": 499.08, "text": "Schwachstelle, JavaScript, Sandbox, Bibliothek, MV2, hast du damals schon gehört?"}, {"id": 79, "start": 499.08, "end": 509.92, "text": "Nein, sagt mir gar nichts. VM2.js. Advanced VM Sandbox für Node.js."}, {"id": 80, "start": 510.52, "end": 513.52, "text": "Was?"}, {"id": 81, "start": 513.76, "end": 518.28, "text": "Ah, das ist, wenn man irgendwelche Sachen ausführt, die einem vom Frontend"}, {"id": 82, "start": 518.28, "end": 526.28, "text": "untergeschoben werden können. Tja. Wenn JavaScript auf dem Backend macht, ist eh selber"}, {"id": 83, "start": 526.28, "end": 534.24, "text": "dran schuld. Alter, warum ist mein KacW heute so ultra laut?"}, {"id": 84, "start": 535.28, "end": 539.28, "text": "Wie schwer ist es bei Big-Tech-Unternehmen als Software-Entwickler"}, {"id": 85, "start": 539.28, "end": 542.56, "text": "reinzukommen? Das kann man pauschal nicht sagen. Wie viel"}, {"id": 86, "start": 542.56, "end": 546.56, "text": "Erfahrung hast du, was für Technologien kannst du, kannst du einen Binarridge"}, {"id": 87, "start": 546.56, "end": 555.0, "text": "re-inverten? Das kann man pauschal nicht sagen, also manch einer würde sagen easy,"}, {"id": 88, "start": 555.0, "end": 559.88, "text": "ich habe 50 Anfragen und alle wollen sie mich haben. Ein großer nach dem"}, {"id": 89, "start": 559.88, "end": 562.8, "text": "anderen, also nach dem Motto, und ein anderer würde sagen, ich find nix."}, {"id": 90, "start": 562.8, "end": 569.72, "text": "Also, ja. Ach so, hier, sind mit den Ausbildern, 4-stündige Tests hab ich"}, {"id": 91, "start": 569.72, "end": 573.6, "text": "schon gemacht. Ach so, Vorstellungsgespräche mit dem Ausbilder, okay,"}, {"id": 92, "start": 573.6, "end": 579.64, "text": "das ist natürlich was anderes. Das ist was anderes. Dann hast du den"}, {"id": 93, "start": 579.64, "end": 582.2, "text": "eklichen Kram schon hinter dir und du kommst in die nähere Auswahl,"}, {"id": 94, "start": 582.2, "end": 586.52, "text": "beziehungsweise wahrscheinlich in die engere, die werden ja jetzt nicht 30"}, {"id": 95, "start": 586.52, "end": 592.48, "text": "Leute einladen oder so für. Tja, hab ich da irgendwelche Tipps? Also, ist jetzt nicht so"}, {"id": 96, "start": 592.48, "end": 595.56, "text": "als hätte ich mega viele Vorstellungsgespräche gemacht in meinem"}, {"id": 97, "start": 595.56, "end": 600.16, "text": "Leben, ja. Hat meistens eigentlich immer mehr oder weniger schnell geklappt bei"}, {"id": 98, "start": 600.16, "end": 603.76, "text": "mir. Aber eine Sache kann ich mich an meine Ausbildung, hab ich glaube ich schon ein"}, {"id": 99, "start": 603.76, "end": 607.28, "text": "paar mal erzählt, in meiner Ausbildung dran erinnern, also was sich im"}, {"id": 100, "start": 607.28, "end": 612.0, "text": "Nachhinein alles ganz gut rausgestellt hat, war, als ich damals, also für den"}, {"id": 101, "start": 612.0, "end": 616.16, "text": "Ausbildungsplatz als Fachinformatiker Systemintegrations irgendwie vor 15"}, {"id": 102, "start": 616.16, "end": 623.24, "text": "Jahren, da hab ich auch einen Test vorher gemacht und danach bin ich quasi ins"}, {"id": 103, "start": 623.24, "end": 625.92, "text": "Vorstellungsgespräch rein, beziehungsweise wurde gefragt im Flur, wer"}, {"id": 104, "start": 625.92, "end": 629.52, "text": "will denn anfangen. Ich dachte mir, ich muss mal bald zum Zug, ich fang mal an."}, {"id": 105, "start": 629.52, "end": 635.12, "text": "Zumindest als ich dann da reingegangen bin, hatte ich so spontan irgendwie das"}, {"id": 106, "start": 635.12, "end": 639.36, "text": "Bedürfnis zu sagen, dass ja manche Sachen irgendwie gemein waren in dem"}, {"id": 107, "start": 639.36, "end": 642.16, "text": "Einstellungstest. Das ist vielleicht, ich sag nicht, dass das irgendwie der"}, {"id": 108, "start": 642.16, "end": 646.64, "text": "ultimative Satz ist, den du sagen solltest. Nee, nee, auf gar nichts, sag den nicht. Ich meine nur, was mir"}, {"id": 109, "start": 646.64, "end": 651.64, "text": "danach aufgefallen ist, dadurch konnte ich unbewusst, das habe ich nicht"}, {"id": 110, "start": 651.64, "end": 658.96, "text": "absichtlich gemacht, dadurch konnte ich unbewusst ein bisschen steuern, was die"}, {"id": 111, "start": 658.96, "end": 663.36, "text": "jetzt sagen, weil wenn man sich nebeneinander, also nicht nebeneinander, wenn man sich"}, {"id": 112, "start": 663.36, "end": 667.24, "text": "voreinander setzt, ja du sagst nichts, der sagt nichts, dann ist der natürlich im"}, {"id": 113, "start": 667.24, "end": 672.52, "text": "Zugzwang irgendwas zu sagen. Ich meine jetzt nicht, dass du den voll labern sollst,"}, {"id": 114, "start": 672.52, "end": 678.36, "text": "so nach dem Motto, alter hier ich bin da, ich bin der geilste. Nee, aber so hat man zumindest"}, {"id": 115, "start": 678.36, "end": 683.0, "text": "die Chance, so ein bisschen zu beeinflussen, was drankommt. Ja, vielleicht"}, {"id": 116, "start": 683.0, "end": 687.88, "text": "findest du irgendein, vielleicht findest du irgendein Thema, was man mal so neben, ja nach"}, {"id": 117, "start": 687.88, "end": 692.4, "text": "der Begrüßung so im Nebensatz sagen kann, worauf er dann einsteigen kann."}, {"id": 118, "start": 692.4, "end": 695.68, "text": "Ansonsten haben die halt schon, wenn es ein größerer Laden ist, irgendwelche"}, {"id": 119, "start": 695.68, "end": 699.12, "text": "Vorgehensworkflows, wie was ja, was da in den Gesprächen geführt wird."}, {"id": 120, "start": 699.12, "end": 702.84, "text": "Zumindest dich anschweigen ist immer doof, weil dann wirst du im Zweifelsfall"}, {"id": 121, "start": 702.84, "end": 707.08, "text": "zu euch gefragt, was du eigentlich nicht gefragt werden willst."}, {"id": 122, "start": 707.08, "end": 712.64, "text": "Sag ihm, du benutzt Arch, by the way, das ist ein guter Tipp."}, {"id": 123, "start": 718.32, "end": 724.76, "text": "Nee, ich habe auch noch nichts bestellt, weder CPU noch GPU, aber ich"}, {"id": 124, "start": 724.76, "end": 728.0, "text": "habe es mir immer noch vorgenommen. Dezember ist es soweit, Leute. Ich warte"}, {"id": 125, "start": 728.0, "end": 732.52, "text": "jetzt mal, was Intel noch vorstellt. Dezember gibt es neuen Rechner."}, {"id": 126, "start": 732.52, "end": 738.08, "text": "Schenker Laptops, keine Ahnung. Also ich fand mal vor Jahren diese XMG, genau"}, {"id": 127, "start": 738.08, "end": 748.72, "text": "hier, XMG Dinger, ziemlich nice. Ich hatte die mal sogar vor zig Jahren"}, {"id": 128, "start": 748.72, "end": 757.32, "text": "hatte ich oder wollte ich, ich weiß es gar nicht mehr. Irgendwas wegen Sponsoring"}, {"id": 129, "start": 757.32, "end": 764.16, "text": "mal gesprochen. Hat sich aber nichts ergeben und außerdem habe ich keine"}, {"id": 130, "start": 764.16, "end": 768.6, "text": "Laptops mehr. Also ich habe kein Laptop, also ich brauche auch kein Laptop."}, {"id": 131, "start": 768.6, "end": 774.04, "text": "Ich kann da nichts zu sagen. Weiß ich echt nicht, was man da drauf achten muss"}, {"id": 132, "start": 774.04, "end": 778.16, "text": "bei Laptops. Ich meine, klar, die üblichen Geschichten, Tastatur, Bildschirm,"}, {"id": 133, "start": 778.16, "end": 781.12, "text": "Batterielaufzeit oder abziehungsweise Akku-Laufzeit, das weiß ich ja selbst."}, {"id": 134, "start": 781.12, "end": 784.6, "text": "Ansonsten wüsste ich es nicht."}, {"id": 135, "start": 790.44, "end": 794.8, "text": "Du sollst einen Taschenrechner mitnehmen zum Vorstellungsgespräch."}, {"id": 136, "start": 794.8, "end": 802.88, "text": "Oh nee. Moment, als was machst du deine Ausbildung? Als Anwendungsentwickler"}, {"id": 137, "start": 802.88, "end": 808.88, "text": "wollen die von dir, dass du irgendwelche bescheuerten Übungsaufgaben an der"}, {"id": 138, "start": 808.88, "end": 813.6, "text": "Tafel löst oder was? Boah, da hätte ich jetzt keinen Bock drauf."}, {"id": 139, "start": 813.6, "end": 820.64, "text": "Musst schon seinen Grund haben, warum ich einen Taschenrechner mitnehmen soll."}, {"id": 140, "start": 825.96, "end": 831.28, "text": "Abschlussprüfungstipp, ja, den ultimativen Tipp für die Abschlussprüfung"}, {"id": 141, "start": 831.28, "end": 834.32, "text": "und eigentlich auch so ziemlich den einzigen Tipp für die Abschlussprüfung,"}, {"id": 142, "start": 834.32, "end": 839.44, "text": "den man braucht. Mach alte Abschlussprüfungen. Scheiß auf die Vorbereitung in der Schule,"}, {"id": 143, "start": 839.44, "end": 844.68, "text": "scheiß auf die Vorbereitung in der A- also, was ich meine ist, denk nicht,"}, {"id": 144, "start": 844.68, "end": 848.12, "text": "dass nur weil du gut in der Berufsschule warst, du automatisch gute Prüfungen schreibst,"}, {"id": 145, "start": 848.12, "end": 851.28, "text": "weil du Plan hast von dem, was in Betrieb gemacht wird, dass du automatisch gute"}, {"id": 146, "start": 851.28, "end": 857.56, "text": "Prüfungen schreibst, weil die IHK-Prüfungen haben nichts mit der Realität zu tun."}, {"id": 147, "start": 857.56, "end": 863.84, "text": "Du musst die Art und Weise verstehen, wie die IHK Fragen stellt und auf IHK-Weise"}, {"id": 148, "start": 863.84, "end": 868.84, "text": "Antworten lernen. Das brauchst du nicht im späteren Leben, es nützt dir nichts dazu,"}, {"id": 149, "start": 868.84, "end": 872.2, "text": "was du im Betrieb gelernt hast, es nützt dir nichts dazu, was du in der Berufsschule"}, {"id": 150, "start": 872.2, "end": 875.44, "text": "gelernt hast und du kannst es quasi nachdem du die Prüfung verstanden hast,"}, {"id": 151, "start": 875.44, "end": 879.04, "text": "auch wieder vergessen. Du wirst es in deinem Leben nie wieder brauchen, bis du stirbst."}, {"id": 152, "start": 879.04, "end": 884.72, "text": "Was hoffentlich noch ein bisschen hin ist. Du musst alte Prüfungen machen,"}, {"id": 153, "start": 884.72, "end": 892.28, "text": "das ist das Einzige, was hilft. Und was meint ihr, Chet? Jemand, der drei Jahre"}, {"id": 154, "start": 892.28, "end": 896.84, "text": "eine Ausbildung gemacht hat und richtig gut ist in dem, was er macht und auch super Noten"}, {"id": 155, "start": 896.84, "end": 903.12, "text": "in der Berufsschule hat, aber sich keine alten Prüfungen angeguckt hat versus jemand,"}, {"id": 156, "start": 903.12, "end": 908.6, "text": "versus jemand, der den Beruf überhaupt nicht gelernt hat, der nie eine Ausbildung,"}, {"id": 157, "start": 908.6, "end": 912.48, "text": "der nie diese Ausbildung gemacht hat, sich allerdings zwei Monate lang auf die Abschlussprüfung"}, {"id": 158, "start": 912.48, "end": 918.08, "text": "vorbereitet, ohne je damit was gemacht zu haben. Was meint ihr, wer die bessere Prüfung schreibt?"}, {"id": 159, "start": 918.08, "end": 925.56, "text": "Also ich tippe auf den, der die Abschlussprüfung gelernt hat, weil es geht in der Abschlussprüfung"}, {"id": 160, "start": 925.56, "end": 931.44, "text": "nicht wirklich um Fachwissen beziehungsweise um Ahnung haben, es geht einfach um IHK Fragen"}, {"id": 161, "start": 931.44, "end": 937.16, "text": "verstehen und IHK Antworten liefern. Also du musst Abschlussprüfung machen. Wenn du"}, {"id": 162, "start": 937.16, "end": 941.68, "text": "Abschlussprüfung machst, du kannst dir in der Abschlussprüfung auch die alten Antworten"}, {"id": 163, "start": 941.68, "end": 946.56, "text": "angucken und dann siehst du relativ schnell, ob das jetzt gecheckt hast oder nicht. Die"}, {"id": 164, "start": 946.56, "end": 950.2, "text": "haben immer wieder diese, die haben immer wieder ähnliche Fragenstellungen. Sie sind"}, {"id": 165, "start": 950.2, "end": 955.84, "text": "Auszubildende in der Alligator GmbH oder irgendwie sowas, fängt es dann meistens an. Ihr Kollege"}, {"id": 166, "start": 955.84, "end": 965.2, "text": "fragt sie zu der Einrichtung eines neuen Desktop-Arbeitsplatzes. Wie gehen sie im Beratungsgespräch vor?"}, {"id": 167, "start": 965.2, "end": 972.8, "text": "Und irgendwie sowas kommt an. Ordnen sie die Begriffe zu. Tastatur, USB-Stick, Maus,"}, {"id": 168, "start": 972.8, "end": 980.92, "text": "Toilettenpapier, Smartphone. Und dann musst du dann irgendwie was einordnen. Das ist immer"}, {"id": 169, "start": 980.92, "end": 987.76, "text": "der gleiche Blödsinn. Also du musst auf jeden Fall Abschlussprüfung machen, anders geht"}, {"id": 170, "start": 987.76, "end": 992.76, "text": "es nicht. Wir gucken das Video nach. Ja, wir gucken das gleich weiter. Wann kommt ein neuer"}, {"id": 171, "start": 992.76, "end": 997.72, "text": "PC bei mir in Frage? Wie gesagt, Ende des Jahres. Ende des Jahres kaufe ich einen. Richtig"}, {"id": 172, "start": 997.72, "end": 1004.04, "text": "fette Kiste. Wir haben es letztens ausgerechnet. Wird wahrscheinlich um die 4500 Euro kosten."}, {"id": 173, "start": 1004.04, "end": 1012.44, "text": "Easy Money, Easy Life, Any Primers. Ich wusste gar nicht, ob ihr wusstet, dass man, wenn"}, {"id": 174, "start": 1012.44, "end": 1016.68, "text": "man Amazon Prime Account hat, den man mit Twitch verknüpft hat, kostenlos einen Streamer,"}, {"id": 175, "start": 1016.68, "end": 1025.0, "text": "den man gerne guckt und subscriben kann. Kostet euch nichts. Außer Amazon Prime. Man sagt"}, {"id": 176, "start": 1025.0, "end": 1028.68, "text": "es immer so. Ach, das ist doch alles kostenlos. Stimmt ja gar nicht. Man braucht ja Amazon"}, {"id": 177, "start": 1028.68, "end": 1033.6, "text": "Prime für. Aber wenn man Amazon Prime hat, kann man einen Streamer seiner Wahl unterstützen."}, {"id": 178, "start": 1033.6, "end": 1040.04, "text": "Zum Beispiel mich, dass ich mir im Dezember einen 4500 Euro Rechner kaufen kann. Den"}, {"id": 179, "start": 1040.04, "end": 1047.56, "text": "kaufe ich mir auch so. Aber dann geht es nicht so sehr in die Kohle. Big Stonks Time."}, {"id": 180, "start": 1047.56, "end": 1053.0, "text": "Ich kann keine Sellouts. Ist mir auch egal. Ihr müsst mich nicht subscriben. Du hattest"}, {"id": 181, "start": 1053.0, "end": 1057.44, "text": "nur ein Gespräch eingestellt. Ja, war bei mir bei der Ausbildung genauso. Habe ich ja"}, {"id": 182, "start": 1057.44, "end": 1066.4, "text": "schon erzählt. Das war das mit dem Typ, der sich quasi komplett eingeschwitzt. Das war"}, {"id": 183, "start": 1066.4, "end": 1071.64, "text": "ein richtiger Schwitzer, Alter, beim Vorstellungsgespräch. Also nicht nicht nicht nicht in der Chef,"}, {"id": 184, "start": 1071.64, "end": 1076.64, "text": "sondern ein anderer Typ, der auch Vorstellungsgespräche am gleichen Tag hatte. Ich habe glaube ich"}, {"id": 185, "start": 1076.64, "end": 1080.64, "text": "in meinem Leben noch nie jemand gesehen, der so krass nervös war. Ich glaube, ich habe"}, {"id": 186, "start": 1080.64, "end": 1085.0, "text": "wirklich, ich habe noch nie so einen nervösen Menschen gesehen. Ich war mit drei, nee, mit"}, {"id": 187, "start": 1085.0, "end": 1090.88, "text": "zwei anderen habe ich im Gang gesessen zum Vorstellungsgespräch da an dem Tag. Mit irgendeinem"}, {"id": 188, "start": 1090.88, "end": 1094.36, "text": "Mädel, die hat die Ausbildung bekommen später, allerdings nicht in Frankfurt, sondern an"}, {"id": 189, "start": 1094.36, "end": 1101.36, "text": "einem anderen Standort und mit so einem Anzugtyp. Und da hat wahrscheinlich Anzug angehabt,"}, {"id": 190, "start": 1101.36, "end": 1105.52, "text": "weil sein Vater ihm gesagt hat, zieh einen Anzug an. Alter, der Typ, der war so ultra"}, {"id": 191, "start": 1105.52, "end": 1109.56, "text": "nervös. Der hat gezittert und geschwitzt. Der war, der war richtig fertig. Der war richtig"}, {"id": 192, "start": 1109.56, "end": 1115.44, "text": "fertig. Und als ich dann rausgekommen bin, ich bin da zuerst ins Vorstellungsgespräch"}, {"id": 193, "start": 1115.44, "end": 1121.04, "text": "gegangen, weil ich mir gedacht habe, ich muss mal schnell wieder zum Zug, also zur Bahn zurück"}, {"id": 194, "start": 1121.04, "end": 1124.48, "text": "fahren. Ich bin da zuerst, ich bin da der erste, der ins Vorstellungsgespräch gegangen"}, {"id": 195, "start": 1124.48, "end": 1129.16, "text": "ist. Und als ich dann rausgekommen bin, da hat der Typ mich so angeguckt, so nach dem"}, {"id": 196, "start": 1129.16, "end": 1133.68, "text": "Motto, und wie ist es gelaufen, wie ist es gelaufen. Und da habe ich so, so aus Spaß"}, {"id": 197, "start": 1133.68, "end": 1139.48, "text": "zu ihm eigentlich gesagt. Habe ich zu ihm gemeint, so, boah, Alter, was die alles wissen"}, {"id": 198, "start": 1139.48, "end": 1144.32, "text": "wollen. Das war eigentlich eher Joke. Ey, der Typ ist, der Typ ist fast ohnmächtig geworden."}, {"id": 199, "start": 1144.32, "end": 1155.96, "text": "Der war eh schon, das war keine Absicht, Leute. Ohne Scheiß. Das war keine Absicht. Der war"}, {"id": 200, "start": 1155.96, "end": 1160.2, "text": "richtig fertig, Alter. Ich habe den auch nie wieder gesehen. Keine Ahnung, also er scheint"}, {"id": 201, "start": 1160.2, "end": 1168.28, "text": "die Stelle ja nicht gekriegt zu haben. Ich habe mir da gar nichts, ich habe mir da gar"}, {"id": 202, "start": 1168.28, "end": 1174.36, "text": "nichts bei gedacht. Es war halt einfach so eine spontane blöde Antwort, ja. Der war"}, {"id": 203, "start": 1174.36, "end": 1179.4, "text": "richtig fertig, Alter. Ich weiß nicht, was aus dem geworden ist. Ich weiß ja nicht,"}, {"id": 204, "start": 1179.4, "end": 1183.04, "text": "wie er heißt. Ich weiß nicht, was er dann gemacht hat. Er hat zumindest die Ausbildung"}, {"id": 205, "start": 1183.04, "end": 1192.84, "text": "anscheinend nicht gekriegt. Obatzdr, Dankeschön. Massive Subscriptions hier. Hast du was mit"}, {"id": 206, "start": 1192.84, "end": 1203.96, "text": "der Switch Pro mitbekommen? Nö. Switch Pro wird dann einfach neue Hardware sein, oder?"}, {"id": 207, "start": 1203.96, "end": 1207.92, "text": "Also muss ja. Und dann ist Frage, wie es mit Abwärtskompatibilität aussieht. Vielleicht"}, {"id": 208, "start": 1207.92, "end": 1213.68, "text": "wird das ein bisschen Richtung Gamecube und Wii von der Hardware. Das war ja im Prinzip"}, {"id": 209, "start": 1213.68, "end": 1218.32, "text": "das Gleiche. Bis zur Wii U war das eigentlich mehr oder weniger die gleiche Technik. Bloß"}, {"id": 210, "start": 1218.32, "end": 1225.6, "text": "nur halt schneller. Ich halte von Zwischen-Konsolen-Releases nichts. Wenn es ein neues Konsolenrelease ist,"}, {"id": 211, "start": 1225.6, "end": 1233.32, "text": "okay, man, die Switch ist ja auch schon busy her jetzt. 2017 ist auch schon 5 Jahre alt."}, {"id": 212, "start": 1233.32, "end": 1238.16, "text": "Können durchaus mal wieder was rausbringen. Ich meine, es gab 3 Games auf der Switch,"}, {"id": 213, "start": 1238.16, "end": 1241.68, "text": "die sich gelohnt haben zu kaufen. Der Rest ist eigentlich jetzt die Konsole komplett"}, {"id": 214, "start": 1241.68, "end": 1246.32, "text": "von der Arsch gewesen. Wobei, das stimmt nicht. Das stimmt nicht. Es gab durchaus. Es gab"}, {"id": 215, "start": 1246.32, "end": 1251.84, "text": "vielleicht 5 Games. Die Donkey Kong-Teile waren gut. Mario Odyssey war gut. Splatoon,"}, {"id": 216, "start": 1251.84, "end": 1255.92, "text": "wenn man drauf steht, meinetwegen. Ich mochte ja persönlich, Splatoon war nicht meins."}, {"id": 217, "start": 1255.92, "end": 1262.08, "text": "Link's Awakening Remake fand ich auch sehr niedlich, auch wenn es übelste Frame-Probleme"}, {"id": 218, "start": 1262.08, "end": 1267.28, "text": "hatte. Es gab schon, sag mal so, aber unter 10 Games, für die sich die Switch lohnt."}, {"id": 219, "start": 1267.28, "end": 1274.8, "text": "Also, weiß nicht, ich hab's mir komplett umsonst gekauft eigentlich, das Teil. Ich"}, {"id": 220, "start": 1274.8, "end": 1282.4, "text": "hab relativ viel Breath of the Wild gespielt, Mario Odyssey, das Link's Awakening Remake,"}, {"id": 221, "start": 1282.4, "end": 1292.12, "text": "aber ansonsten hält sich wirklich sehr in Grenzen. Ja, es könnte durchaus mal eine neue"}, {"id": 222, "start": 1292.12, "end": 1296.68, "text": "Konsolengeneration geben. Dass das Ding, also ich habe nichts davon mitbekommen, keine Ahnung,"}, {"id": 223, "start": 1296.68, "end": 1301.4, "text": "dass das Ding DLSS hat, das kann ich mir tatsächlich vorstellen, weil das ist ja ein komplettes"}, {"id": 224, "start": 1301.4, "end": 1316.32, "text": "Nvidia-Teil, die Switch. Und, ja, warum nicht? Also der Shield TV beispielsweise und die"}, {"id": 225, "start": 1316.32, "end": 1322.88, "text": "Switch sind so unterschiedlich nicht, was Hardware angeht. Die Switch ist im Prinzip"}, {"id": 226, "start": 1322.88, "end": 1332.68, "text": "so eine Nvidia-Box, Nvidia-Android-TV-Box, nur ohne Android. Eigentlich wär's gar nicht"}, {"id": 227, "start": 1332.68, "end": 1343.0, "text": "so blöd gewesen, wenn Nintendo das auf Android-Basis gemacht hätte, zumindest optional die Möglichkeit"}, {"id": 228, "start": 1343.0, "end": 1346.84, "text": "gehabt hätte, in irgendein Android-System zu booten oder sowas, weil dann hättest du"}, {"id": 229, "start": 1346.84, "end": 1353.0, "text": "zumindest ein paar Games gehabt, die du spielen kannst, nicht nur fünf Stück. Gibt nix Neues."}, {"id": 230, "start": 1353.0, "end": 1360.68, "text": "Ja, gibt, ja gut, was heißt das? Wie gesagt, mitgekriegt hab ich auch nix, aber es gibt"}, {"id": 231, "start": 1360.68, "end": 1367.12, "text": "ja schon seit Jahren Gerüchte. Kann man doch flashen, wusste ich nicht, aber wundert mich"}, {"id": 232, "start": 1367.12, "end": 1373.96, "text": "nicht. Wie gesagt, Shield TV und die Switch sind von dem Chip, also von der Kiste. Kein"}, {"id": 233, "start": 1373.96, "end": 1379.64, "text": "großer Unterschied. Ich sag immer, wenn ich keinen Plan hab. Ich sag manchmal auch, wenn"}, {"id": 234, "start": 1379.64, "end": 1382.76, "text": "ich keinen Bock hab zu Sachen, wo ich mich auskenn, dass ich keinen Plan hab, aber in"}, {"id": 235, "start": 1382.76, "end": 1391.44, "text": "dem Fall auch wirklich keinen Plan. Authentisch bleiben und Freundlichkeit ist immer gut."}, {"id": 236, "start": 1391.44, "end": 1395.4, "text": "Ja, Freundlichkeit geb ich dir recht, authentisch würd ich dir im Prinzip auch recht geben,"}, {"id": 237, "start": 1395.4, "end": 1400.8, "text": "aber manche Sachen solltest du halt nicht sagen, auch wenn du's normalerweise so sagen"}, {"id": 238, "start": 1400.8, "end": 1411.52, "text": "würdest. Na, wenn authentisch für dich ist, Digger, mach Auge, dann solltest du das vielleicht"}, {"id": 239, "start": 1411.52, "end": 1423.24, "text": "nicht sagen. Max, du nutzt doch VMWR. Funktioniert, Shared, Clipboard und so weiter. Nein, ähm,"}, {"id": 240, "start": 1423.24, "end": 1427.96, "text": "nee, nee, nee. Nee, nee, nee, funktioniert. Ich hab es erst letztens ausprobiert, kannst"}, {"id": 241, "start": 1427.96, "end": 1434.76, "text": "dich vergessen. Geht nicht. Deswegen ist Wayland auch der letzte Crap für virtualisiertes"}, {"id": 242, "start": 1434.76, "end": 1443.2, "text": "Linux. Weißt du, was das beste war? Wayland hat in VMWR noch nicht mal FPS gehabt. Also"}, {"id": 243, "start": 1443.2, "end": 1452.2, "text": "hatte 0 FPS, kein Screen Refresh. Du musstest von Hand den Screen Refreshen. Also du musstest"}, {"id": 244, "start": 1452.2, "end": 1456.72, "text": "quasi das Fenster resizen, erst dann hat er das Screen Refreshed. Richtig kaputt. Dann"}, {"id": 245, "start": 1456.72, "end": 1464.08, "text": "musstest du dann irgendeine Environment Variable setzen, dass es trotzdem ging. Ja, nächstes"}, {"id": 246, "start": 1464.08, "end": 1473.32, "text": "Jahr wird das Jahr des Linux Desktops, ich sag's euch. Ja, wie gesagt, Physi Abschlussprüfung"}, {"id": 247, "start": 1473.32, "end": 1489.92, "text": "oder Fachinformatik Abschlussprüfung, genau das gleiche Kram. Ja, so sieht's aus. Dummschwärzer"}, {"id": 248, "start": 1489.92, "end": 1493.76, "text": "gegen Fachkompetenz gewinnt. Nee, Dummschwärzer allein bringt dir nicht allzu viel für die"}, {"id": 249, "start": 1493.76, "end": 1499.12, "text": "schriftliche Prüfung. Oder, Moment, oder meintest du die mündliche Abschlussprüfung"}, {"id": 250, "start": 1499.12, "end": 1504.52, "text": "oben? Vorhand. Wer auch immer das war. Äh, wer war denn das vorhand? Meintest du die"}, {"id": 251, "start": 1504.52, "end": 1506.96, "text": "mündliche Abschlussprüfung oder die schriftliche? Ich dachte du willst die schriftliche machen."}, {"id": 252, "start": 1506.96, "end": 1510.68, "text": "Bei der mündlichen sieht das anders aus. Also bei der mündlichen solltest du zumindest"}, {"id": 253, "start": 1510.68, "end": 1519.08, "text": "schon Ahnung haben, was du da gemacht hast im Projekt. In der Suppe. Ja, bestes Leaked"}, {"id": 254, "start": 1519.08, "end": 1526.08, "text": "Foto. Dankeschön für den Sub. Stripes Massive Sub. 39 Monate, überlegt euch mal, wie lang"}, {"id": 255, "start": 1526.08, "end": 1533.24, "text": "das schon ist. Das sind ja schon über drei Jahre. Graser Scheiß. Ich auch nicht. Ich"}, {"id": 256, "start": 1533.24, "end": 1537.08, "text": "weiß nicht, ob ihr das wusstet, aber ich war auch noch nicht in einer Wüste. Leute,"}, {"id": 257, "start": 1537.08, "end": 1542.8, "text": "es entscheidet sich morgen, ob ich Mobile Tracks Games Sellout mache. Okay, sollte ich"}, {"id": 258, "start": 1542.8, "end": 1548.36, "text": "vielleicht so nicht sagen. Wenn das dann jemand hört, dann macht die kein Sellout mit mir."}, {"id": 259, "start": 1548.36, "end": 1555.44, "text": "Wobei, ist mir auch egal. Ist halt Tracks Mobile Game. Ich werde es dann genauso überzeugend"}, {"id": 260, "start": 1555.44, "end": 1561.92, "text": "vortragen wie das Genshin Impact Sponsoring. Wobei ich denke, dass Genshin Impact an sich"}, {"id": 261, "start": 1561.92, "end": 1567.08, "text": "gar kein schlechtes Game ist. Genshin Impact auf ApoRed Star. Moment, das muss ich mir"}, {"id": 262, "start": 1567.08, "end": 1581.4, "text": "jetzt angucken. Genshin Impact ApoRed. Zeigt mal. Wo ist das? Okay. Wo ist das Sponsoring"}, {"id": 263, "start": 1581.4, "end": 1588.72, "text": "Genshin Impact von ApoRed? Es muss doch irgendwo geben. Oder hat er das Video gelöscht? Das"}, {"id": 264, "start": 1588.72, "end": 1595.12, "text": "will ich jetzt sehen. Hat er gelöscht? Ist es das hier? Ist es das hier? Jawoll. Jawoll."}, {"id": 265, "start": 1595.12, "end": 1603.92, "text": "Das muss ich mir angucken. Auf trocken am Start ist er. Moment, das muss ich mir kurz"}, {"id": 266, "start": 1603.92, "end": 1604.92, "text": "angucken."}, {"id": 267, "start": 1604.92, "end": 1632.68, "text": "Das ist doch vollkommen in Ordnung. Ist doch genauso mies wie meins. Brutal schön, naja."}, {"id": 268, "start": 1632.68, "end": 1636.88, "text": "Das ist so geil. Das ist genau der gleiche Shit, den sie mir geschrieben haben, was man"}, {"id": 269, "start": 1636.88, "end": 1644.28, "text": "sagen soll. Null. Na gut, war wahrscheinlich die gleiche Agentur. Ach, Moment, das ist,"}, {"id": 270, "start": 1644.28, "end": 1652.36, "text": "das gibt es auch ungeschnitten? Ich dachte, das ist alles. Ich dachte, das ist alles."}, {"id": 271, "start": 1652.36, "end": 1661.48, "text": "Ich meine, für wie viel haben die da bezahlt? Okay, ungeschnitten. Leute, ich muss das"}, {"id": 272, "start": 1661.48, "end": 1675.04, "text": "jetzt sehen. Ich muss das jetzt sehen. Wo ist das? ApoRed ist, nee. Plamiert sich mit,"}, {"id": 273, "start": 1675.04, "end": 1690.32, "text": "was ist das für ein Video? Okay. Was für ein Video? Neues Mimivideo. Ich bin im deutschen"}, {"id": 274, "start": 1690.32, "end": 1699.4, "text": "YouTube-Game nicht, ich kenne die alle nicht. ApoRed kenne ich noch aus Call of Duty Zeiten."}, {"id": 275, "start": 1699.4, "end": 1707.12, "text": "Das da? Der Typ? Also, aber Leon getroffen habe ich mir ziemlich wurscht. Meine Entschuldigung"}, {"id": 276, "start": 1707.12, "end": 1717.2, "text": "an ApoRed. Oh, come on. Was ist denn da schon wieder los? Okay, wohin muss ich? 1522. Okay."}, {"id": 277, "start": 1717.2, "end": 1724.64, "text": "In einem Spiel steckt, und wie gut er sich auskennt. Auf geht's. Auch trocken am Start."}, {"id": 278, "start": 1724.64, "end": 1732.04, "text": "Dieses heutige Video wird gesponsert von Genshin Impact, Freunde. Du liest es doch noch ab."}, {"id": 279, "start": 1732.04, "end": 1743.6, "text": "Zu geil. Ist doch super. Woher hat er denn die angekattete Variante?"}, {"id": 280, "start": 1743.6, "end": 1757.56, "text": "Ganz ehrlich? Ich finde es gar nicht. Ach, vom Cutter. Okay, ganz ehrlich, mit dem Cutter"}, {"id": 281, "start": 1757.56, "end": 1761.92, "text": "würde ich nicht mehr zusammenarbeiten, wenn der mein Material einfach an irgendwelche"}, {"id": 282, "start": 1761.92, "end": 1767.88, "text": "Leute schickt. Unabhängig davon, ob das jetzt funny ist oder nicht, aber das gehört sich"}, {"id": 283, "start": 1767.88, "end": 1792.2, "text": "nicht. Meint ja ApoRed, war doch schon mal in einer Wüste. Leute, ich habe mir übelst"}, {"id": 284, "start": 1792.2, "end": 1801.8, "text": "einen abgebrochen. Also, bevor wir das jetzt weiter gucken. Wir gucken gleich den Talk"}, {"id": 285, "start": 1801.8, "end": 1807.52, "text": "fertig, ja? Bevor wir das weiter gucken, Sekunde. Nur mal so, nur mal so. Also, nur mal zum"}, {"id": 286, "start": 1807.52, "end": 1816.04, "text": "Vergleich mein Genshin Impact-Sponsoring, ja? Das ist auch nicht besser. Pass mal auf."}, {"id": 287, "start": 1816.04, "end": 1819.52, "text": "So, wer es nicht gesehen hat, mein Genshin Impact-Sponsoring. Jetzt, obacht."}, {"id": 288, "start": 1819.52, "end": 1823.68, "text": "Das bringt mich auch zum Partner des heutigen Videos. Genshin Impact ist ein Open-World-Adventure-Game"}, {"id": 289, "start": 1823.68, "end": 1828.04, "text": "mit einer großen Anzahl verschiedener Charaktere im Anime-Style. Genshin Impact ist für PS5,"}, {"id": 290, "start": 1828.04, "end": 1833.04, "text": "PS4, PC, auch für Mobilgeräte, iOS und Android erhältlich. Die große atmosphärische offene"}, {"id": 291, "start": 1833.04, "end": 1836.08, "text": "Welt ist ein Gieber zu erforschen. Oh Gott, das ist so schlecht. Eine Welt voller Geheimnisse"}, {"id": 292, "start": 1836.08, "end": 1840.24, "text": "in der 7-Region, 7 Göttern. Wie könnte das anders sein? Auch 7 Elemente gibt, die kombiniert"}, {"id": 293, "start": 1840.24, "end": 1844.0, "text": "werden können, um neue Synergien zu schaffen und noch mehr coole Angriffe auszuführen."}, {"id": 294, "start": 1844.0, "end": 1847.96, "text": "Die geschlossene Karte von Genshin, wenn man nur Monstadt, Lyos und Mero mitzählt, ist"}, {"id": 295, "start": 1847.96, "end": 1852.6, "text": "mehr als 5.900 Fußballfelder in der realen Welt. Das Spiel hat regelmäßig Inhaltsupdates"}, {"id": 296, "start": 1852.6, "end": 1857.16, "text": "für den kürzlich veröffentlichten Patch 3.1, der neue aufregende Region wie Sumero"}, {"id": 297, "start": 1857.16, "end": 1860.6, "text": "mit einem neuen Wüstengebiet bringt. Ich war noch nie in einer Wüste, aber ich kann"}, {"id": 298, "start": 1860.6, "end": 1869.6, "text": "die geheimnisvolle Wüste, die alten Ruinen in Sumero ergänzen. Ich muss mich immer wegpissen,"}, {"id": 299, "start": 1869.6, "end": 1884.32, "text": "durch diesen Pate, Alter. Ich war noch nie in einer Wüste. Zu geil. Ich war noch nie"}, {"id": 300, "start": 1884.32, "end": 1888.96, "text": "in einer Wüste, aber ich kann die geheimnisvolle Wüste, die alten Ruinen in Sumero erkunden."}, {"id": 301, "start": 1888.96, "end": 1893.88, "text": "Und es gibt drei neue Helden im Spiel. Sino, ein 5-Sterne Electro, Kanans, ein 4-Sterne"}, {"id": 302, "start": 1893.88, "end": 1899.88, "text": "Hydro, beide recht mächtig und schließlich Nilo, ein 5-Sterne Hydro, recht mächtig mit"}, {"id": 303, "start": 1899.88, "end": 1903.8, "text": "einem Schwert. Zusätzlich zu den liebevoll gestalteten Anime-Visuals bietet jeder Charakter"}, {"id": 304, "start": 1903.8, "end": 1907.2, "text": "seine eigene spannende Hintergrundgeschichte und ermöglicht tiefgreifende Interaktion"}, {"id": 305, "start": 1907.2, "end": 1911.8, "text": "mit der Spielwelt. Zur Feier des Updates auf Version 3.1 zeigt Genshin Impact die Geschichte"}, {"id": 306, "start": 1911.8, "end": 1915.24, "text": "der Spieler in Genshin in Offline-Werbung auf der ganzen Welt. In Deutschland werden"}, {"id": 307, "start": 1915.24, "end": 1921.08, "text": "die Erinnerungsspieler in der Münchner Hauptbahnhof gezeigt. Der Rest ist jetzt langweilig. Ich"}, {"id": 308, "start": 1921.08, "end": 1928.52, "text": "war doch nie in einer Wüste, Alter. Darfst du sagen, wie viele du dafür bekommen hast?"}, {"id": 309, "start": 1928.52, "end": 1938.36, "text": "Ähm... Moment, ich muss mal kurz gucken, wo ich hier gewesen bin gerade. Keine Ahnung."}, {"id": 310, "start": 1938.36, "end": 1944.96, "text": "Darf man fragen, wie viele du dafür bekommen hast? Bestimmt weniger als ApoRed. Geh ich"}, {"id": 311, "start": 1944.96, "end": 1952.68, "text": "mal von aus. Ich dürfte es wahrscheinlich sagen. Ich glaube, ich habe nichts unterschrieben,"}, {"id": 312, "start": 1952.68, "end": 1957.52, "text": "dass ich nichts sagen dürfte. Nicht sagen darf. Ich weiß nicht, ob ich sagen soll."}, {"id": 313, "start": 1957.52, "end": 1965.76, "text": "Ja, 4-stellig ist das. Das kann ich sagen. Also im Ernst, 90 Sekunden, übelst krassesten"}, {"id": 314, "start": 1965.76, "end": 1971.88, "text": "Sellout of Doom mache ich nicht unter 4-stellig. Und jetzt könnt ihr mal überlegen, wenn ich"}, {"id": 315, "start": 1971.88, "end": 1981.4, "text": "das in der Richtung schon nicht unter 4-stellig mache, was ApoRed gekriegt hat. Guck mal,"}, {"id": 316, "start": 1981.4, "end": 1987.64, "text": "jetzt... Okay. Richtig coole Charaktere. Ob es jetzt ein Katzenmädchen ist, ein Fuchsmädchen"}, {"id": 317, "start": 1987.64, "end": 1997.36, "text": "oder ein Samurai. Eine richtig geile Option. Gibt es da einen Samurai? Ja, ich glaube,"}, {"id": 318, "start": 1997.36, "end": 2014.4, "text": "es gibt den ganzen Game einfach noch mal viel mehr Atmosphäre. Ah ja, gut. Alter, wo ist"}, {"id": 319, "start": 2014.4, "end": 2020.68, "text": "das Problem? Wo ist das Problem? Ganz ehrlich, der ließ den Krempel halt vor, hat keinen"}, {"id": 320, "start": 2020.68, "end": 2026.16, "text": "Plan davon. Ich habe auch keinen Plan davon gehabt, Mann. Wo ist das Problem? Außer ich"}, {"id": 321, "start": 2026.16, "end": 2030.4, "text": "finde es wirklich nicht okay, ich meine, ich kenne das Video da vorn danach nicht, aber"}, {"id": 322, "start": 2030.4, "end": 2035.88, "text": "ich finde es wirklich nicht okay, dass ein ungeschnittenes Material, das nicht gedacht"}, {"id": 323, "start": 2035.88, "end": 2043.0, "text": "ist zum veröffentlichen, irgendwo liegt. Dass er sagt, dass er das Game fühlt. Okay,"}, {"id": 324, "start": 2043.0, "end": 2046.4, "text": "das habe ich tatsächlich nicht gesagt. Man hat mir aber angehört, wie sehr ich das Game"}, {"id": 325, "start": 2046.4, "end": 2072.24, "text": "fühle, oder? Hi IQ Time. Postchamp? Die haben unterschiedliche Kulturen, die haben einfach"}, {"id": 326, "start": 2072.24, "end": 2078.16, "text": "einen unterschiedlichen Vibe. Das heißt, ihr habt mega viel Abwechslung. Okay, ich finde"}, {"id": 327, "start": 2078.16, "end": 2085.48, "text": "es insofern, wenn man es verkauft, als ich persönlich empfehle euch das, das ist blöd,"}, {"id": 328, "start": 2085.48, "end": 2094.48, "text": "aber ansonsten ist doch kein Unterschied zu Fernsehwerbung. Wie lang geht denn das? Es"}, {"id": 329, "start": 2094.48, "end": 2103.12, "text": "ist gleich fertig, okay. Also muss man trotzdem sagen, Hut ab an den Cutter, dass der da draus"}, {"id": 330, "start": 2103.12, "end": 2113.08, "text": "was gemacht hat. Ich meine, was willst du da draus schneiden? Wie willst du da draus"}, {"id": 331, "start": 2113.08, "end": 2135.12, "text": "ein Wärmespot schneiden? Also mein. Geht das noch weiter? Wie, das war es jetzt oder"}, {"id": 332, "start": 2135.12, "end": 2157.76, "text": "wie? Moment, das geht das ganze Video über jetzt doch, oder wie? Kritische Hase. Ja,"}, {"id": 333, "start": 2157.76, "end": 2167.56, "text": "hat frei gesprochen, würde ich sagen. Ja gut, aber mein, wo ist das Problem jetzt? Ich finde"}, {"id": 334, "start": 2167.56, "end": 2172.84, "text": "es immer ein bisschen blöd, wenn man die Sachen so verkauft, quasi so nach dem Motto, es liegt"}, {"id": 335, "start": 2172.84, "end": 2178.84, "text": "mir am Herzen. Ich empfehle, ich persönlich empfehle euch das, aber das hätte ich jetzt"}, {"id": 336, "start": 2178.84, "end": 2188.08, "text": "in das Video nicht rein interpretiert. Don Cuyon, Dankeschön für den Sub. Ne, Raid Shadow"}, {"id": 337, "start": 2188.08, "end": 2191.72, "text": "Legends, die könne ich mal, das mache ich nicht. Ich mache mobile Crab Werbung demnächst"}, {"id": 338, "start": 2191.72, "end": 2195.64, "text": "vielleicht, seit denn die hören, dass ich sage, ich mache mobile Crab Werbung, wollen"}, {"id": 339, "start": 2195.64, "end": 2200.6, "text": "da nicht mal. NordVPN war auch wieder am Start, NordVPN erinnert sich dann immer wieder, aber"}, {"id": 340, "start": 2200.6, "end": 2206.64, "text": "daran, wenn sie mit mir ein Video machen wollen, dass ich dieses Video gemacht habe, wo unter"}, {"id": 341, "start": 2206.64, "end": 2214.28, "text": "dem NordVPN auf dem Bild ist, das ist immer geil. NordVPN, irgendein random NordVPN Dude"}, {"id": 342, "start": 2214.28, "end": 2218.28, "text": "schreibt eine Anfrage, ich sage, jo klar, machen wir NordVPN Sponsoring und dann fällt"}, {"id": 343, "start": 2218.28, "end": 2223.52, "text": "ihnen immer wieder ein, ach ne, du bist ja der Kerl mit diesem Anti-VPN Video, ne ne,"}, {"id": 344, "start": 2223.52, "end": 2227.88, "text": "dann wollen wir doch nicht. Das ist auch geil, wobei ich denke, so langsam müssten Stomach"}, {"id": 345, "start": 2227.88, "end": 2240.32, "text": "gelernt haben. Leute, wo wir gerade beim Thema NordVPN sind, für alle, die es nicht gesehen"}, {"id": 346, "start": 2240.32, "end": 2252.64, "text": "haben, VfB Stuttgart, beste Cyber Abwehr für VfB Fans. Das ist kein Fake Tweet, das ist"}, {"id": 347, "start": 2252.64, "end": 2259.0, "text": "wirklich so. Wenn der VfB Stuttgart schon Werbung von NordVPN macht, dann sollte man"}, {"id": 348, "start": 2259.0, "end": 2288.12, "text": "sich aber YouTuber nicht so drüber aufregen. Achso. Ja, wir kommen jetzt den Talk gleich"}, {"id": 349, "start": 2288.12, "end": 2293.4, "text": "weiter. Noch fertig gucken, ob das was wird heute."}, {"id": 350, "start": 2318.12, "end": 2332.4, "text": "Okay, Leute, falls ihr irgendwas übersehen habt, schreibt es doch mal in den Chat, ich"}, {"id": 351, "start": 2332.4, "end": 2339.36, "text": "glaube nicht. Wir gucken jetzt den restlichen Konferenztalk von gestern. Wir haben gestern"}, {"id": 352, "start": 2339.36, "end": 2349.04, "text": "angefangen, einen Konferenztalk zu gucken von der NDC Sydney. Da stehen sie alle auf"}, {"id": 353, "start": 2349.04, "end": 2355.08, "text": "dem Kopf. Oh, cringe-Joke, ich weiß. Und da ging es um die Geschichte, so ein bisschen"}, {"id": 354, "start": 2355.08, "end": 2358.88, "text": "die Geschichte des Internets und vor allem, was ich da dran ganz gut fand, so ein bisschen"}, {"id": 355, "start": 2358.88, "end": 2368.08, "text": "historisch die Web-Frameworks und Entwicklung von Browser und JavaScript, CSS und solche"}, {"id": 356, "start": 2368.08, "end": 2378.4, "text": "Geschichten. Wir sind stehen geblieben, glaube ich, als es um Ruby on Rails ging. Ruby. Ob"}, {"id": 357, "start": 2378.4, "end": 2382.2, "text": "hier sind wir stehen geblieben? Wir gucken uns einfach die letzte Minute noch mal an."}, {"id": 358, "start": 2382.2, "end": 2385.8, "text": "Da geht es nämlich um Webforms und Webforms ist so ziemlich das Schrecklichste, was es"}, {"id": 359, "start": 2385.8, "end": 2397.92, "text": "je gegeben hat. Dort genug. Böse Zungen würden behaupten,"}, {"id": 360, "start": 2397.92, "end": 2411.0, "text": "es ist immer noch Müll. Leute, das ist mal Content hier, oder? Von"}, {"id": 361, "start": 2411.0, "end": 2417.68, "text": "ApoRed zu einem HiIQ-Konferenztalk. Danach noch mal ein Excel-E-Sports. Was heißt Content?"}, {"id": 362, "start": 2417.68, "end": 2423.48, "text": "Es ist mein Reaction-Content, ja? Ist ja nicht so, als hätte ich da irgendwie einen Handschlag"}, {"id": 363, "start": 2423.48, "end": 2434.32, "text": "für gemacht für den Content. Und wisst ihr, dass wir diesem Editor jahrzehntelange Anzeigen"}, {"id": 364, "start": 2434.32, "end": 2439.88, "text": "zu verdanken haben im Internet, wo dann da steht, diese Seite ist optimiert für den Microsoft"}, {"id": 365, "start": 2439.88, "end": 2446.84, "text": "Internet Explorer 800 x 600? Genau wegen diesem Mist, weil es absolut positionierte Elemente"}, {"id": 366, "start": 2446.84, "end": 2454.04, "text": "in der Webseite sind. Wenn ich das schon sehe, kriege ich wieder Anfälle. Excel-E-Sport."}, {"id": 367, "start": 2454.04, "end": 2458.56, "text": "Ja, haben wir gestern schon geguckt. Ich war überrascht, dass es Excel-E-Sport gibt."}, {"id": 368, "start": 2458.56, "end": 2466.72, "text": "Ja, Preserif, das habe ich gehört. Ich bin mir aber nicht sicher, ob es wirklich kommt"}, {"id": 369, "start": 2466.72, "end": 2472.92, "text": "oder ob das angedacht ist. Das habe ich auch schon gelesen. Und ich bin mir gar nicht"}, {"id": 370, "start": 2472.92, "end": 2479.04, "text": "sicher, in welchem Kontext ich das letztens gelesen habe. Es ging darum, dass man sich"}, {"id": 371, "start": 2479.04, "end": 2487.44, "text": "erhofft, dass eben als SAS-Features weiter Einzug in CSS erhalten. Ich weiß nicht, ob"}, {"id": 372, "start": 2487.44, "end": 2497.12, "text": "das nur ein Proposal ist oder wirklich dann kommen soll. Ja. Silverlight, oh je. Leute,"}, {"id": 373, "start": 2497.12, "end": 2501.68, "text": "Silverlight an sich war gar nicht so doof im Kontext zu der Zeit, wo Flash angesagt"}, {"id": 374, "start": 2501.68, "end": 2507.48, "text": "war. Aber Silverlight kam mal raus. Ein paar haben Silverlight verwendet. Dann hat Apple"}, {"id": 375, "start": 2507.48, "end": 2511.12, "text": "Flash mehr oder weniger abgesägt und auch nichts anderes unterstützt. Aber Silverlight"}, {"id": 376, "start": 2511.12, "end": 2514.4, "text": "war wieder tot. Ich weiß nicht, wie lange Silverlight gelebt hat. Eins, zwei Jahre"}, {"id": 377, "start": 2514.4, "end": 2515.4, "text": "oder so nicht lang."}, {"id": 378, "start": 2515.4, "end": 2520.52, "text": "Das ist wahrscheinlich in der Mitte, oder? Dann schalte ich das, gehe zurück in meinen"}, {"id": 379, "start": 2520.52, "end": 2526.72, "text": "Browser, reloade. Und da geht's los. Ich kann nach Hause gehen. Das ist toll. Das funktioniert"}, {"id": 380, "start": 2526.72, "end": 2533.0, "text": "nur, wenn man die absoluten Pixel-Positionen auf der Seite legen kann. Und diese Idee"}, {"id": 381, "start": 2533.0, "end": 2545.48, "text": "begann ein paar Jahre später zu fallen. Also der hottest way in 2002 war eigentlich"}, {"id": 382, "start": 2545.48, "end": 2552.44, "text": "ziemlicher Müll. Switchen mit Java-UI. Ich kenne auch Remote-Management-Interfaces mit"}, {"id": 383, "start": 2552.44, "end": 2567.88, "text": "Java-UI. Rails, Ruby. Ich bin ein riesen Fan, was Ruby angeht, die Programmiersprache."}, {"id": 384, "start": 2567.88, "end": 2574.4, "text": "Ich mag Ruby. Leider ist Rails total in der Versenkung verschwunden und es benutzt keiner"}, {"id": 385, "start": 2574.4, "end": 2580.16, "text": "mehr. Dementsprechend ist Ruby an sich auch nicht super beliebt. Wenn man mal zehn Jahre"}, {"id": 386, "start": 2580.16, "end": 2592.24, "text": "zurückguckt, vor zehn Jahren war Ruby auch schon auslaufend. Aber da gab es massig Zeug"}, {"id": 387, "start": 2592.24, "end": 2600.68, "text": "und ganz viele Ideen sind entstanden im Ruby-Umfeld. Wer mal Express.js-Seite gemacht hat in Node.js,"}, {"id": 388, "start": 2600.68, "end": 2607.52, "text": "das ist eindeutig von Ruby-Frameworks inspiriert. Das merkste. Und Rails war das Ding, wo die"}, {"id": 389, "start": 2607.52, "end": 2626.16, "text": "Leute gesagt haben, wir sind jetzt Rockstar-Web-Entwickler. Ruby. Rails war wirklich nice. Man darf nicht"}, {"id": 390, "start": 2626.16, "end": 2631.2, "text": "vergessen, bis dahin haben die Leute Webforms gemacht und jetzt gibt es Ruby on Rails. Ruby"}, {"id": 391, "start": 2631.2, "end": 2638.16, "text": "on Rails ist in diesem ganzen Vortrag das erste moderne Web-Framework, so wie die heute noch"}, {"id": 392, "start": 2638.16, "end": 2646.72, "text": "funktionieren. Wo man zumindest die Struktur wieder erkennt. Ruby on Rails hatte integriert"}, {"id": 393, "start": 2646.72, "end": 2661.96, "text": "Datenbank-Mikrations, Datenbank-Mapper, Views, Controller, Datenbank-Models, Task-Runner,"}, {"id": 394, "start": 2661.96, "end": 2668.0, "text": "also alles das, was man heute von den meisten Frameworks kennt, kommt irgendwie aus der"}, {"id": 395, "start": 2668.0, "end": 2676.2, "text": "Ruby-Zeit, also aus der Rails-Zeit. Und übrigens der Typ, der Erfinder von Ruby on Rails, also"}, {"id": 396, "start": 2676.2, "end": 2687.8, "text": "dieser David Heinemeyer-Hansen, der ist Rennfahrer mittlerweile. Der fährt irgendwelche, irgendwelche"}, {"id": 397, "start": 2687.8, "end": 2696.48, "text": "Rallies, hat wahrscheinlich genug Kohle verdient, aber, ja, Moncrustier macht er jetzt."}, {"id": 398, "start": 2696.48, "end": 2714.76, "text": "Ruby on Rails-Benutzer waren ziemlich viele Hipster-Programmer dabei. Twitter war übrigens"}, {"id": 399, "start": 2714.76, "end": 2723.32, "text": "auch mal Rails. Ruby."}, {"id": 400, "start": 2723.32, "end": 2744.04, "text": "Rails war nice. Rails ist nice. Rails ist immer noch aktiv, also GitHub, Ruby on Rails, es"}, {"id": 401, "start": 2744.04, "end": 2748.32, "text": "ist jetzt nicht so als wäre das dead oder so. Die Verbreitung ist halt ziemlich zurückgegangen,"}, {"id": 402, "start": 2748.32, "end": 2752.12, "text": "aber es gibt immer noch viele, guck mal hier, 1500 Sterne, es gibt immer noch viele Ruby"}, {"id": 403, "start": 2752.12, "end": 2758.24, "text": "on Rails-Anwendungen, die maintained werden müssen, und Rails hat vor 5 Stunden den letzten"}, {"id": 404, "start": 2758.24, "end": 2763.84, "text": "Pull-Request bekommen, also so ist es ja nett. GitHub ist immer noch Rails, ziemlich sicher,"}, {"id": 405, "start": 2763.84, "end": 2764.84, "text": "ja."}, {"id": 406, "start": 2764.84, "end": 2782.12, "text": "Die Leute hatten Tumblr-Blocks, Gatschi-Buzz."}, {"id": 407, "start": 2782.12, "end": 2809.16, "text": "Jetzt aber kein Rails-Tutorial, das letzte restliche Video, oder? Ne, ne, ne, sieht nicht"}, {"id": 408, "start": 2809.16, "end": 2812.4, "text": "so aus, Rails ist in zwei Minuten wieder durch."}, {"id": 409, "start": 2812.4, "end": 2832.28, "text": "Webbrick, ja, stimmt, so ist das."}, {"id": 410, "start": 2832.28, "end": 2837.28, "text": "Das war auch super easy, wenn man das mal mit anderen Sachen vergleicht. In PAP haben"}, {"id": 411, "start": 2837.28, "end": 2840.8, "text": "die Leute Handcrafted SQL noch schreiben müssen."}, {"id": 412, "start": 2840.8, "end": 2870.72, "text": "In Rails musstest du das nicht."}, {"id": 413, "start": 2870.72, "end": 2879.28, "text": "Übrigens, man muss sagen, ich finde immer noch Ruby ist eine super hübsche Programmiersprache."}, {"id": 414, "start": 2879.28, "end": 2885.48, "text": "Die Einrückungen sind übrigens keine Pflicht, im Vergleich zu peißen, ja, also das macht"}, {"id": 415, "start": 2885.48, "end": 2888.32, "text": "man, weil es schick ist, aber man muss es nicht machen."}, {"id": 416, "start": 2888.32, "end": 2912.28, "text": "Das war auch relativ neu in Rails, dass da so ein Kommandozeilen-Tool dabei hat, wo du"}, {"id": 417, "start": 2912.28, "end": 2920.04, "text": "Sachen anlegen konntest, ohne dass du den ganzen Boilerplate da immer von Hand basteln"}, {"id": 418, "start": 2920.04, "end": 2921.04, "text": "musstest."}, {"id": 419, "start": 2921.04, "end": 2926.84, "text": "Viele Leute haben vor Ruby nie was von Testing gehört, also viele haben damit... AirSpec,"}, {"id": 420, "start": 2926.84, "end": 2933.44, "text": "kennt jemand AirSpec? Quasi jedes halbwegs moderne Testing-Framework ist AirSpec, nur"}, {"id": 421, "start": 2933.44, "end": 2934.44, "text": "für eine andere Sprache."}, {"id": 422, "start": 2934.44, "end": 2962.24, "text": "Schöne SQL-Injection zeige ich wieder gleich."}, {"id": 423, "start": 2962.24, "end": 2974.4, "text": "Ich glaube, man kann es nicht genug unterstreichen."}, {"id": 424, "start": 2974.4, "end": 2980.96, "text": "Rails war das erste wirklich moderne Web-Framework, wenn man mal von der heutigen Zeit guckt."}, {"id": 425, "start": 2980.96, "end": 2984.2, "text": "Alles andere davor war irgendwelcher Frickelshit."}, {"id": 426, "start": 2984.2, "end": 2988.64, "text": "Rails war wirklich das erste, was so quasi die Art und Weise, auch wenn man sich mal"}, {"id": 427, "start": 2988.64, "end": 2994.92, "text": "die Ordner-Struktur anguckt, das hat da schon entscheidend mitgeprägt, wie das heute alles"}, {"id": 428, "start": 2994.92, "end": 2995.92, "text": "aussieht."}, {"id": 429, "start": 2995.92, "end": 3001.68, "text": "Das sieht mehr oder weniger heute noch so aus, überall, egal wo ihr hinguckt, sei es"}, {"id": 430, "start": 3001.68, "end": 3007.72, "text": "als Weltkit-Anwendung oder eine ASP.NET-Anwendung, das sieht zählig aus."}, {"id": 431, "start": 3007.72, "end": 3029.08, "text": "Ruby ist eine super Sprache, leider hat halt Ruby, außer dass es eine leise Sprache ist,"}, {"id": 432, "start": 3029.08, "end": 3037.16, "text": "und Rails hat Ruby quasi mitgecarried jahrelang, auch in der Beliebtheit her."}, {"id": 433, "start": 3037.16, "end": 3041.52, "text": "Ganz viele anderen Libraries und Sachen sind entstanden, weil es eben Rails und das Ruby-Ökosystem"}, {"id": 434, "start": 3041.52, "end": 3042.52, "text": "gab."}, {"id": 435, "start": 3042.52, "end": 3048.28, "text": "Allerdings Ruby an sich, ich weiß nicht warum, aber Ruby hat nie so diesen riesen Durchbruch"}, {"id": 436, "start": 3048.28, "end": 3060.6, "text": "gehabt als Sprache an sich, und gerade mit dem Abflachen von Rails, wenn ihr mich fragt,"}, {"id": 437, "start": 3060.6, "end": 3061.6, "text": "Ruby oder Python?"}, {"id": 438, "start": 3061.6, "end": 3063.6, "text": "Ich finde Ruby ist die deutlich schönere Sprache."}, {"id": 439, "start": 3063.6, "end": 3069.04, "text": "Python ist auch okay, ist Ruby nicht saulangsam?"}, {"id": 440, "start": 3069.04, "end": 3075.2, "text": "Ruby ist zumindest schneller als Python, und das hält es ja auch nicht davon ab, benutzt"}, {"id": 441, "start": 3075.2, "end": 3076.2, "text": "zu werden."}, {"id": 442, "start": 3076.2, "end": 3078.4, "text": "Nicht viel, aber ist schneller."}, {"id": 443, "start": 3078.4, "end": 3101.24, "text": "Ruby, Web 2.0!"}, {"id": 444, "start": 3101.24, "end": 3107.7, "text": "Ich glaube die JavaScript wurde etwa 2005 bis 2008 erneut geboren."}, {"id": 445, "start": 3107.7, "end": 3126.5, "text": "Und eine der Dinge, die das erneut erneut erneut erneut erneut erneut erneut erneut, war das Web 2.0-Wave und die Konkurrenz darin."}, {"id": 446, "start": 3126.5, "end": 3133.58, "text": "So, Web 2.0 war, als die Firmen realisierten, dass sie viel Kommerzwert von genieriertem Content erzielen können."}, {"id": 447, "start": 3133.58, "end": 3138.7, "text": "Und wenn du ein User bist, welche Sites werden du dir Zeit verbringen, Content zu generieren?"}, {"id": 448, "start": 3138.7, "end": 3140.7, "text": "Das sind wahrscheinlich die, die für dich Spaß machen."}, {"id": 449, "start": 3140.7, "end": 3143.3, "text": "Oh, ich muss mein Laptop anklicken."}, {"id": 450, "start": 3143.3, "end": 3147.26, "text": "Das sind wahrscheinlich die, die einen schönen Interfacesystem haben."}, {"id": 451, "start": 3147.26, "end": 3154.26, "text": "Also, es war viel Druck auf die Entwickler, die die besten Interfacesystemen erzeugen."}, {"id": 452, "start": 3154.26, "end": 3159.26, "text": "So, dass die Entwickler ihre Zeit verbringen würden, um in diesen Bereichen zu arbeiten."}, {"id": 453, "start": 3159.26, "end": 3162.26, "text": "Einige der besten Arbeiten in diesen Bereichen wurden von Google erzeugt."}, {"id": 454, "start": 3162.26, "end": 3169.26, "text": "Das, was ich als neuer Entwickler von damals erinnere, war Google Maps."}, {"id": 455, "start": 3169.26, "end": 3189.26, "text": "Das stimmt, Google Maps hat schon mehrfach mindblown, also am Anfang die pure Existenz von Google Maps, dann Street View, was ja jeder für unmöglich gehalten hat, aber Google konnte das halt mit ihrem massig Geld machen."}, {"id": 456, "start": 3189.26, "end": 3197.26, "text": "Dann haben sie diese 3D-Ansicht mittlerweile, also Google Maps hat schon mehrfach gezeigt, was mit dem Browser möglich ist."}, {"id": 457, "start": 3197.26, "end": 3202.26, "text": "Nö, habe ich nicht gesehen auf Netflix."}, {"id": 458, "start": 3202.26, "end": 3210.26, "text": "Ajax."}, {"id": 459, "start": 3210.26, "end": 3221.26, "text": "AJAX."}, {"id": 460, "start": 3221.26, "end": 3223.26, "text": "XML."}, {"id": 461, "start": 3223.26, "end": 3245.26, "text": "Ja, das stimmt."}, {"id": 462, "start": 3245.26, "end": 3257.26, "text": "Aber gut, 2006 war das halt richtig geiler Shit."}, {"id": 463, "start": 3257.26, "end": 3260.26, "text": "Ja, das stimmt."}, {"id": 464, "start": 3260.26, "end": 3267.26, "text": "Ich meine, damals war es das Beste, was man verwenden konnte, ernsthaft."}, {"id": 465, "start": 3267.26, "end": 3277.26, "text": "Es gab ja auch dann so ein paar Nachahmer von jQuery, so minimal jQuery, die angeblich dann besser, schneller und kleiner sein wollten."}, {"id": 466, "start": 3277.26, "end": 3279.26, "text": "Ich hab vergessen, was es da alles gab."}, {"id": 467, "start": 3279.26, "end": 3281.26, "text": "Irgendwas mit Z gab es da."}, {"id": 468, "start": 3281.26, "end": 3283.26, "text": "Erinnert sich noch einer an diese JavaScript?"}, {"id": 469, "start": 3283.26, "end": 3284.26, "text": "Irgendwie was mit..."}, {"id": 470, "start": 3284.26, "end": 3285.26, "text": "JavaScript?"}, {"id": 471, "start": 3285.26, "end": 3286.26, "text": "Wie ist das?"}, {"id": 472, "start": 3286.26, "end": 3290.26, "text": "Zepto oder sowas?"}, {"id": 473, "start": 3290.26, "end": 3294.26, "text": "So minimal jQuery, nicht JavaScript, was laber ich denn?"}, {"id": 474, "start": 3294.26, "end": 3295.26, "text": "Zepto?"}, {"id": 475, "start": 3295.26, "end": 3299.26, "text": "Ja, jQuery."}, {"id": 476, "start": 3299.26, "end": 3301.26, "text": "Ist es Zepto, oder?"}, {"id": 477, "start": 3301.26, "end": 3304.26, "text": "Ja, tatsächlich."}, {"id": 478, "start": 3304.26, "end": 3307.26, "text": "Zepto."}, {"id": 479, "start": 3307.26, "end": 3319.26, "text": "Jetzt haben die coolen Leute gesagt, jQuery ist plottet, Zepto ist nice."}, {"id": 480, "start": 3319.26, "end": 3320.26, "text": "Krass, oder?"}, {"id": 481, "start": 3320.26, "end": 3323.26, "text": "Das wird kein Framework wieder schaffen."}, {"id": 482, "start": 3323.26, "end": 3324.26, "text": "Je wieder."}, {"id": 483, "start": 3324.26, "end": 3330.26, "text": "70% auf der top besuchten Seiten belammt jQuery benutzt."}, {"id": 484, "start": 3330.26, "end": 3332.26, "text": "70."}, {"id": 485, "start": 3332.26, "end": 3337.26, "text": "Das kriegt kein Vue.js, kein Svelte, kein Angular, kein React hin."}, {"id": 486, "start": 3337.26, "end": 3339.26, "text": "React vielleicht noch am ehesten."}, {"id": 487, "start": 3339.26, "end": 3347.26, "text": "Aber bestimmt auch nicht in den Regionen."}, {"id": 488, "start": 3347.26, "end": 3349.26, "text": "Firebug, beste."}, {"id": 489, "start": 3349.26, "end": 3350.26, "text": "Beste."}, {"id": 490, "start": 3350.26, "end": 3352.26, "text": "Beste."}, {"id": 491, "start": 3352.26, "end": 3357.26, "text": "Der Typ, der Firebug-Entwickler ist, glaube ich, dann von Google eingekauft worden für Chrome,"}, {"id": 492, "start": 3357.26, "end": 3359.26, "text": "wenn ich es noch richtig im Erinnerung habe."}, {"id": 493, "start": 3359.26, "end": 3366.26, "text": "Firebug war eine Firefox-Erweiterung für Developer-Tools."}, {"id": 494, "start": 3366.26, "end": 3369.26, "text": "Und vieles von den Überresten ist heute immer noch in Firefox."}, {"id": 495, "start": 3369.26, "end": 3375.26, "text": "Und ich denke mal, deswegen hat Firefox nach wie vor auch noch die besten Developer-Tools."}, {"id": 496, "start": 3375.26, "end": 3380.26, "text": "Gibi ist ein jQuery-Klon, habe ich ja nie was von gehört."}, {"id": 497, "start": 3380.26, "end": 3381.26, "text": "Eine DevTools."}, {"id": 498, "start": 3381.26, "end": 3385.26, "text": "Das größte, was man zu Browser-DevTools bekommt, ist, die Source in Notepad zu sehen."}, {"id": 499, "start": 3385.26, "end": 3386.26, "text": "Das ist großartig."}, {"id": 500, "start": 3386.26, "end": 3390.26, "text": "Und dieser Typ, Joe Hewitt, hat an Mozilla gearbeitet."}, {"id": 501, "start": 3390.26, "end": 3392.26, "text": "Er ist einer der Founding-Engineer für Firefox."}, {"id": 502, "start": 3392.26, "end": 3395.26, "text": "Aber dann ging er weg und fing an, Web-Applikationen zu bauen."}, {"id": 503, "start": 3395.26, "end": 3399.26, "text": "Und er hat realisiert, dass es eine große Schmerz war, weil er nichts debugieren konnte."}, {"id": 504, "start": 3399.26, "end": 3402.26, "text": "Also hat er einen Browser-Plugin gegründet, den Firebug."}, {"id": 505, "start": 3402.26, "end": 3404.26, "text": "Und ich kann es euch zeigen."}, {"id": 506, "start": 3404.26, "end": 3407.26, "text": "Hier habe ich Firefox und habe den Plugin installiert."}, {"id": 507, "start": 3407.26, "end": 3411.26, "text": "Wenn ich auf den Klick rechts klicke, kann ich das Element inspektieren und ihr seht viele Sachen, die da sind, die da sind."}, {"id": 508, "start": 3411.26, "end": 3416.26, "text": "Wir haben eine Konsole, HTML-View, wir können den CSS sehen, wir haben einen Script-Debugger."}, {"id": 509, "start": 3416.26, "end": 3419.26, "text": "So sehen die Developer-Tools heute immer noch aus. Und warum?"}, {"id": 510, "start": 3419.26, "end": 3423.26, "text": "Weil irgendein Typ auf die Idee gekommen ist, wir machen eine Firefox-Erweiterung."}, {"id": 511, "start": 3423.26, "end": 3427.26, "text": "Und wisst ihr, ich rate das jetzt einfach mal."}, {"id": 512, "start": 3427.26, "end": 3429.26, "text": "Und wisst ihr, was ich glaube?"}, {"id": 513, "start": 3429.26, "end": 3438.26, "text": "Dass in der heutigen Zeit mit dem heutigen Firefox so ein Plugin gar nicht mehr möglich gewesen wäre."}, {"id": 514, "start": 3438.26, "end": 3442.26, "text": "Weil die Firefox API auch immer weiter beschnitten wurde in den letzten Jahren."}, {"id": 515, "start": 3442.26, "end": 3448.26, "text": "Also ich könnte mir vorstellen, dass du quasi das, was damals quasi die Erfindung der DevTools war,"}, {"id": 516, "start": 3448.26, "end": 3452.26, "text": "heute gar nicht mehr als Plugin überhaupt machen könntest."}, {"id": 517, "start": 3452.26, "end": 3456.26, "text": "Deswegen fand ich es auch ein bisschen blöd, dass Firefox das immer weiter beschnitten hat."}, {"id": 518, "start": 3456.26, "end": 3460.26, "text": "Ich frag mich schon seit Jahren, was denkt dann eigentlich Firefox?"}, {"id": 519, "start": 3460.26, "end": 3462.26, "text": "Wer sind denn die Anwender von Firefox?"}, {"id": 520, "start": 3462.26, "end": 3464.26, "text": "Die Oma um die Ecke?"}, {"id": 521, "start": 3464.26, "end": 3470.26, "text": "Der nur nach 15 Casual Boon, der außer Chrome und Safari nichts kennt, was vorinstalliert ist?"}, {"id": 522, "start": 3470.26, "end": 3474.26, "text": "Also ich bin der festen Überzeugung,"}, {"id": 523, "start": 3474.26, "end": 3483.26, "text": "Firefox hat sich blöderweise immer weiter von ihren Core-Anwendern wegentwickelt die letzten Jahre über."}, {"id": 524, "start": 3483.26, "end": 3486.26, "text": "Trotzdem bin ich froh, dass es Firefox gibt."}, {"id": 525, "start": 3486.26, "end": 3490.26, "text": "Damals hat noch keiner, wie es Code Extensions gedacht, Leute."}, {"id": 526, "start": 3516.26, "end": 3523.26, "text": "Das ist übrigens, wahrscheinlich hat es auch kaum einer gesehen, das ist Chrome 1.0."}, {"id": 527, "start": 3546.26, "end": 3549.26, "text": "Wow, WAP?"}, {"id": 528, "start": 3549.26, "end": 3577.26, "text": "Leute, WAP war das damals?"}, {"id": 529, "start": 3579.26, "end": 3582.26, "text": "Übrigens, nochmal jetzt an der Stelle zum Beweis."}, {"id": 530, "start": 3582.26, "end": 3593.26, "text": "Es gibt doch diese Theorie, dass man, dass jeder, jeden Menschen auf der Welt über maximal, glaube ich, sechs oder sieben Ecken kennt."}, {"id": 531, "start": 3593.26, "end": 3596.26, "text": "Weiß jetzt nicht, wie man das nennt."}, {"id": 532, "start": 3596.26, "end": 3599.26, "text": "Aber ich kenne auch Steve Jobs."}, {"id": 533, "start": 3599.26, "end": 3609.26, "text": "Über zwei Ecken."}, {"id": 534, "start": 3609.26, "end": 3616.26, "text": "So ein Konsultentyp, der bei uns auf der Arbeit ist, der da irgendwas konsultet."}, {"id": 535, "start": 3616.26, "end": 3624.26, "text": "Der war 2008 auf der Präsentation, wo Steve Jobs das iPhone vorgestellt hat."}, {"id": 536, "start": 3624.26, "end": 3631.26, "text": "Also, Theorie wieder bestätigt."}, {"id": 537, "start": 3631.26, "end": 3639.26, "text": "Weird Flex, das war kein Flex."}, {"id": 538, "start": 3639.26, "end": 3642.26, "text": "Hat sich das wie nur ein Flex angeschaut."}, {"id": 539, "start": 3642.26, "end": 3654.26, "text": "Ja."}, {"id": 540, "start": 3672.26, "end": 3686.26, "text": "Das war immer noch eines der besten und gleichzeitig blödesten Ideen, was man machen konnte."}, {"id": 541, "start": 3686.26, "end": 3703.26, "text": "Node.js."}, {"id": 542, "start": 3703.26, "end": 3712.26, "text": "Na ja, Node ist bis heute nicht multithreaded."}, {"id": 543, "start": 3712.26, "end": 3716.26, "text": "Oder was heißt nicht multithreaded? Du kannst kein Multithreading in Node machen."}, {"id": 544, "start": 3716.26, "end": 3719.26, "text": "Ich glaube, du kannst mittlerweile Webworker-Shit und sowas in Node machen."}, {"id": 545, "start": 3719.26, "end": 3722.26, "text": "Aber richtiges Multithreading ist in JavaScript nicht."}, {"id": 546, "start": 3722.26, "end": 3736.26, "text": "Zumindest mit V8 JavaScript nicht."}, {"id": 547, "start": 3736.26, "end": 3739.26, "text": "Ist Node.js eine gute Technologie?"}, {"id": 548, "start": 3739.26, "end": 3741.26, "text": "Muss man ganz klar sagen, ja ist es."}, {"id": 549, "start": 3741.26, "end": 3748.26, "text": "Es ist nicht umsonst millionenfach adoptet worden."}, {"id": 550, "start": 3748.26, "end": 3755.26, "text": "Man kann sich immer darüber lustig machen, was will man mit JavaScript auf dem Server, was soll man, warum Backends in Node.js."}, {"id": 551, "start": 3755.26, "end": 3761.26, "text": "Aber ja, es hat schon seinen Sinn."}, {"id": 552, "start": 3761.26, "end": 3766.26, "text": "Man kann natürlich sagen, es wurden nicht immer die besten Technologien auch adoptet."}, {"id": 553, "start": 3766.26, "end": 3769.26, "text": "Aber es hat schon seinen Sinn gehabt."}, {"id": 554, "start": 3769.26, "end": 3776.26, "text": "Gerade, dass die ganzen Frontend-Leute jetzt auf einmal easy irgendwelche Desktop-Anwendungen machen können mit Electron."}, {"id": 555, "start": 3776.26, "end": 3779.26, "text": "Oder irgendwelche AP-Backends machen können."}, {"id": 556, "start": 3779.26, "end": 3789.26, "text": "Das ging vorher nicht."}, {"id": 557, "start": 3789.26, "end": 3792.26, "text": "Und in gewisser Weise, Node hatte tatsächlich was Cooles."}, {"id": 558, "start": 3792.26, "end": 3794.26, "text": "Ich glaube, jetzt weiß ich auch, was er sagen möchte."}, {"id": 559, "start": 3794.26, "end": 3796.26, "text": "Das ist kein Multithreading."}, {"id": 560, "start": 3796.26, "end": 3799.26, "text": "Node hatte halt Multi-, wie nennt man das?"}, {"id": 561, "start": 3799.26, "end": 3805.26, "text": "Multi-, Multi-, es ist auch nicht Multi-Processing, wie nennt man das?"}, {"id": 562, "start": 3805.26, "end": 3810.26, "text": "Multi-, Multi-, Ausführung?"}, {"id": 563, "start": 3810.26, "end": 3812.26, "text": "Ich hab keine Ahnung."}, {"id": 564, "start": 3812.26, "end": 3816.26, "text": "Weil wirklich Multithreaded, Asynchron, ja genau."}, {"id": 565, "start": 3816.26, "end": 3818.26, "text": "Also wirklich Multithreaded ist es ja nicht."}, {"id": 566, "start": 3818.26, "end": 3819.26, "text": "Du hast nicht mehrere Threads."}, {"id": 567, "start": 3819.26, "end": 3822.26, "text": "Du hast einen Thread, der alles ausführt."}, {"id": 568, "start": 3822.26, "end": 3825.26, "text": "Aber Konkurrent ist es, genau."}, {"id": 569, "start": 3825.26, "end": 3831.26, "text": "Aber wenn der nichts macht oder auf I.O. wartet oder so was,"}, {"id": 570, "start": 3831.26, "end": 3837.26, "text": "dann kann der quasi asynchronen Bett gemacht, sich schlafen legen."}, {"id": 571, "start": 3837.26, "end": 3841.26, "text": "Und das führt was anderes aus und dann springt es wieder zurück rein."}, {"id": 572, "start": 3841.26, "end": 3845.26, "text": "Also ein bisschen so, wie das Async Await in.NET macht,"}, {"id": 573, "start": 3845.26, "end": 3851.26, "text": "nur das Async Await in.NET auch gleichzeitig komplett Multithreaded sein kann."}, {"id": 574, "start": 3851.26, "end": 3856.26, "text": "Also dieses Reinspringen."}, {"id": 575, "start": 3856.26, "end": 3859.26, "text": ".NET hat standardmäßig nichts Eventloop-mäßiges oder so."}, {"id": 576, "start": 3859.26, "end": 3864.26, "text": "Aber die haben sich das ja von.NET abgeguckt aus JavaScript"}, {"id": 577, "start": 3864.26, "end": 3866.26, "text": "mit ihrer Async Await-Geschichte."}, {"id": 578, "start": 3866.26, "end": 3871.26, "text": "Ja, aber das hat schon seinen Sinn gehabt."}, {"id": 579, "start": 3871.26, "end": 3876.26, "text": "Es war eine gute und gleichzeitig blöde Idee mit Node.js."}, {"id": 580, "start": 3876.26, "end": 3880.26, "text": "JavaScript."}, {"id": 581, "start": 3880.26, "end": 3885.26, "text": "Leute, ich glaube, wir wären noch nicht fertig."}, {"id": 582, "start": 3885.26, "end": 3911.26, "text": "Den Abschnitt gucken wir noch."}, {"id": 583, "start": 3911.26, "end": 3918.26, "text": "Das war überlegen."}, {"id": 584, "start": 3918.26, "end": 3920.26, "text": "Das war überlegen."}, {"id": 585, "start": 3920.26, "end": 3924.26, "text": "Okay, Rails, Jackberry, Handlebars, okay."}, {"id": 586, "start": 3924.26, "end": 3925.26, "text": "Handlebars."}, {"id": 587, "start": 3925.26, "end": 3929.26, "text": "Ist Handlebars nicht diese komische Template,"}, {"id": 588, "start": 3929.26, "end": 3932.26, "text": "JavaScript-Template-Engine?"}, {"id": 589, "start": 3932.26, "end": 3935.26, "text": "So mit den Curly Braces und so was?"}, {"id": 590, "start": 3935.26, "end": 3938.26, "text": "Handlebars?"}, {"id": 591, "start": 3938.26, "end": 3944.26, "text": "So, dann gab es AngularJS, Ember, Backbone, Knockout."}, {"id": 592, "start": 3944.26, "end": 3948.26, "text": "Okay, ehrlich gesagt, das Einzige,"}, {"id": 593, "start": 3948.26, "end": 3954.26, "text": "was ich davon mal hobbymäßig ein bisschen zum Basteln verwendet habe,"}, {"id": 594, "start": 3954.26, "end": 3956.26, "text": "war tatsächlich Ember."}, {"id": 595, "start": 3956.26, "end": 3960.26, "text": "Und das hat mich so abgeschreckt von Frontend Frameworks,"}, {"id": 596, "start": 3960.26, "end": 3966.26, "text": "weil es einfach so unnötig aufgeblasen und kompliziert"}, {"id": 597, "start": 3966.26, "end": 3968.26, "text": "und man hat eigentlich gar nicht verstanden,"}, {"id": 598, "start": 3968.26, "end": 3976.26, "text": "was es macht war, dass ich da keinen Bock hatte."}, {"id": 599, "start": 3976.26, "end": 3978.26, "text": "Richtig bloated."}, {"id": 600, "start": 3978.26, "end": 3980.26, "text": "Knockout habe ich mir mal ganz kurz angeguckt,"}, {"id": 601, "start": 3980.26, "end": 3983.26, "text": "aber nie was mitgemacht."}, {"id": 602, "start": 3983.26, "end": 3986.26, "text": "Ansonsten, meine zwei Lieblings Frameworks aktuell sind"}, {"id": 603, "start": 3986.26, "end": 3989.26, "text": "eindeutig Vue und Svelte und eigentlich hauptsächlich Svelte."}, {"id": 604, "start": 3989.26, "end": 3991.26, "text": "Und wisst ihr, warum Svelte?"}, {"id": 605, "start": 3991.26, "end": 3993.26, "text": "Wisst ihr, wie es dazu gekommen ist?"}, {"id": 606, "start": 3993.26, "end": 3996.26, "text": "Durch den Chat."}, {"id": 607, "start": 3996.26, "end": 3998.26, "text": "Hätte man nicht den Chat damals vorgeschlagen,"}, {"id": 608, "start": 3998.26, "end": 3999.26, "text": "lasst doch mal Svelte angucken,"}, {"id": 609, "start": 3999.26, "end": 4002.26, "text": "ich würde es wahrscheinlich nie angeguckt."}, {"id": 610, "start": 4002.26, "end": 4004.26, "text": "Massive."}, {"id": 611, "start": 4004.26, "end": 4008.26, "text": "High-Intelligenz-Quotient-Chat."}, {"id": 612, "start": 4008.26, "end": 4010.26, "text": "Big Brain."}, {"id": 613, "start": 4010.26, "end": 4014.26, "text": "Das ist die Mode schon wieder weg, oder wie?"}, {"id": 614, "start": 4014.26, "end": 4016.26, "text": "Lustig."}, {"id": 615, "start": 4016.26, "end": 4022.26, "text": "Letztens war es noch da."}, {"id": 616, "start": 4022.26, "end": 4026.26, "text": "Der Handytipp ist ja schon wieder da."}, {"id": 617, "start": 4026.26, "end": 4040.26, "text": "Der Handytipp ist ja schon wieder da."}, {"id": 618, "start": 4056.26, "end": 4058.26, "text": "AngularJS 1.8."}, {"id": 619, "start": 4058.26, "end": 4061.26, "text": "Also, ich habe von vielen Angular-Fans gehört,"}, {"id": 620, "start": 4061.26, "end": 4062.26, "text": "so auch die letzten Jahre über,"}, {"id": 621, "start": 4062.26, "end": 4065.26, "text": "dass sie das erste Angular am besten fanden."}, {"id": 622, "start": 4065.26, "end": 4067.26, "text": "Das erste AngularJS."}, {"id": 623, "start": 4067.26, "end": 4070.26, "text": "Und das AngularJS war POG,"}, {"id": 624, "start": 4070.26, "end": 4072.26, "text": "und Angular ist bloated Mist."}, {"id": 625, "start": 4072.26, "end": 4075.26, "text": "Sagen nicht ich, habe ich von vielen schon gehört."}, {"id": 626, "start": 4075.26, "end": 4076.26, "text": "Wahrscheinlich ist es auch nicht so,"}, {"id": 627, "start": 4076.26, "end": 4078.26, "text": "sondern so ein bisschen verklärte,"}, {"id": 628, "start": 4078.26, "end": 4080.26, "text": "war alles so geil damals."}, {"id": 629, "start": 4080.26, "end": 4082.26, "text": "Aber wahrscheinlich war AngularJS noch irgendwie übersichtlich,"}, {"id": 630, "start": 4082.26, "end": 4085.26, "text": "und AngularJS ist bloated AF."}, {"id": 631, "start": 4085.26, "end": 4087.26, "text": "Backbone."}, {"id": 632, "start": 4087.26, "end": 4089.26, "text": "Backbone gibt es heute immer noch."}, {"id": 633, "start": 4089.26, "end": 4093.26, "text": "Hat letztens erst wieder irgendwelche Updates bekommen."}, {"id": 634, "start": 4093.26, "end": 4094.26, "text": "Guck mal."}, {"id": 635, "start": 4094.26, "end": 4096.26, "text": "Backbone.js."}, {"id": 636, "start": 4096.26, "end": 4100.26, "text": "Nicht, dass ich mich da jetzt vertue."}, {"id": 637, "start": 4100.26, "end": 4103.26, "text": "Na ja, letztens erst wieder."}, {"id": 638, "start": 4103.26, "end": 4105.26, "text": "Aber..."}, {"id": 639, "start": 4105.26, "end": 4130.26, "text": "Na ja, letztens erst wieder."}, {"id": 640, "start": 4130.26, "end": 4132.26, "text": "Knockout hat sich nie so richtig durchgesetzt."}, {"id": 641, "start": 4132.26, "end": 4135.26, "text": "Das war eigentlich ganz cool."}, {"id": 642, "start": 4135.26, "end": 4137.26, "text": "Damals."}, {"id": 643, "start": 4137.26, "end": 4140.26, "text": "Boomer time."}, {"id": 644, "start": 4140.26, "end": 4142.26, "text": "Guck mal."}, {"id": 645, "start": 4142.26, "end": 4143.26, "text": "Wird nicht mehr."}, {"id": 646, "start": 4143.26, "end": 4151.26, "text": "Is it dead?"}, {"id": 647, "start": 4151.26, "end": 4152.26, "text": "Okay, exellent."}, {"id": 648, "start": 4152.26, "end": 4153.26, "text": "Da gucken wir morgen weiter."}, {"id": 649, "start": 4153.26, "end": 4154.26, "text": "Wir sind bei 44 Minuten."}, {"id": 650, "start": 4154.26, "end": 4156.26, "text": "Ich lasse das mal so auf."}, {"id": 651, "start": 4156.26, "end": 4160.26, "text": "Passt."}, {"id": 652, "start": 4160.26, "end": 4161.26, "text": "Das wird heute nämlich nix mehr."}, {"id": 653, "start": 4161.26, "end": 4162.26, "text": "Was haben wir?"}, {"id": 654, "start": 4162.26, "end": 4165.26, "text": "Interview mit einem FFmpeg-Enthusiast."}, {"id": 655, "start": 4165.26, "end": 4166.26, "text": "Ach, das ist der Typ da."}, {"id": 656, "start": 4166.26, "end": 4168.26, "text": "Das ist meistens nicht lustig."}, {"id": 657, "start": 4168.26, "end": 4170.26, "text": "Automatic Home Lab mit Ansible."}, {"id": 658, "start": 4170.26, "end": 4172.26, "text": "Gucken wir uns auch angucken das nächste Mal."}, {"id": 659, "start": 4172.26, "end": 4173.26, "text": "Firebase."}, {"id": 660, "start": 4173.26, "end": 4174.26, "text": "Firebase."}, {"id": 661, "start": 4174.26, "end": 4175.26, "text": "Gucken wir uns auch an."}, {"id": 662, "start": 4175.26, "end": 4176.26, "text": "Gucken wir, wenn ihr klar was Gescheites."}, {"id": 663, "start": 4176.26, "end": 4178.26, "text": "Battlefield Engine Upgraded."}, {"id": 664, "start": 4178.26, "end": 4180.26, "text": "Was wollen sie da upgraden?"}, {"id": 665, "start": 4180.26, "end": 4181.26, "text": "Guck mal."}, {"id": 666, "start": 4181.26, "end": 4183.26, "text": "Das wollte mir nicht ernsthaft erzählen,"}, {"id": 667, "start": 4183.26, "end": 4185.26, "text": "dass die Leute haben, die die Frostbite Engine sinnvoll upgraden können,"}, {"id": 668, "start": 4185.26, "end": 4187.26, "text": "wenn die nicht mal mehr Leute haben,"}, {"id": 669, "start": 4187.26, "end": 4190.26, "text": "die was anderes als Kisten auf der Map platzieren können."}, {"id": 670, "start": 4190.26, "end": 4191.26, "text": "Gut."}, {"id": 671, "start": 4191.26, "end": 4193.26, "text": "Mir ist auch klar, dass das unterschiedliche Leute sind."}, {"id": 672, "start": 4193.26, "end": 4195.26, "text": "Aber die hatten so viele Probleme in der Entwicklung,"}, {"id": 673, "start": 4195.26, "end": 4197.26, "text": "weil sie niemand mehr hatten,"}, {"id": 674, "start": 4197.26, "end": 4199.26, "text": "der mit Frostbite was anfangen kann."}, {"id": 675, "start": 4199.26, "end": 4203.26, "text": "Was wollen sie da großartig weiterentwickeln?"}, {"id": 676, "start": 4203.26, "end": 4204.26, "text": "Kriegen sie es nicht geschissen?"}, {"id": 677, "start": 4204.26, "end": 4211.26, "text": "Kriegen sie es?"}, {"id": 678, "start": 4211.26, "end": 4217.26, "text": "Oh, ich kriege meine eigenen Videos empfohlen, Pog."}, {"id": 679, "start": 4217.26, "end": 4219.26, "text": "Okay, Leute."}, {"id": 680, "start": 4219.26, "end": 4221.26, "text": "Ich muss jetzt ins Bett."}, {"id": 681, "start": 4221.26, "end": 4223.26, "text": "Visual Studio Code Extensions gucke ich mir auch immer gerne an."}, {"id": 682, "start": 4223.26, "end": 4224.26, "text": "Vielleicht was Neues dabei."}, {"id": 683, "start": 4224.26, "end": 4227.26, "text": "Moin."}, {"id": 684, "start": 4227.26, "end": 4228.26, "text": "Alles klar."}, {"id": 685, "start": 4228.26, "end": 4230.26, "text": "So."}, {"id": 686, "start": 4230.26, "end": 4232.26, "text": "Chat, Bettgetime."}, {"id": 687, "start": 4232.26, "end": 4235.26, "text": "Wollt ihr Outro-Musik haben oder nicht?"}, {"id": 688, "start": 4235.26, "end": 4238.26, "text": "Ihr könnt es euch nicht aussuchen."}, {"id": 689, "start": 4238.26, "end": 4241.26, "text": "Hast du die neue Suche im Archiv gesehen?"}, {"id": 690, "start": 4241.26, "end": 4243.26, "text": "Ne."}, {"id": 691, "start": 4243.26, "end": 4245.26, "text": "Archiv."}, {"id": 692, "start": 4245.26, "end": 4246.26, "text": "Punkt."}, {"id": 693, "start": 4246.26, "end": 4251.26, "text": "Nein, das ist nicht Archiv."}, {"id": 694, "start": 4251.26, "end": 4253.26, "text": "Punkt."}, {"id": 695, "start": 4253.26, "end": 4255.26, "text": "Punkt."}, {"id": 696, "start": 4255.26, "end": 4257.26, "text": "Punkt."}, {"id": 697, "start": 4257.26, "end": 4259.26, "text": "Punkt."}, {"id": 698, "start": 4259.26, "end": 4261.26, "text": "Punkt."}, {"id": 699, "start": 4261.26, "end": 4263.26, "text": "Altyz."}, {"id": 700, "start": 4263.26, "end": 4266.26, "text": "Es ist jetzt ein bisschen schneller, oder?"}, {"id": 701, "start": 4266.26, "end": 4267.26, "text": "Nee, das nicht."}, {"id": 702, "start": 4267.26, "end": 4269.26, "text": "Wie ist denn dieезд alle Art von 보니까."}, {"id": 703, "start": 4269.26, "end": 4273.26, "text": "Azure."}, {"id": 704, "start": 4273.26, "end": 4288.1, "text": "zusammen oder einfach nur def einfach nur def ok ok neue suche stream ui ui ui aiaiaiai"}, {"id": 705, "start": 4288.1, "end": 4296.5, "text": "mit placeholder images auch noch pog guckt euch das mal an lazy loading placeholder"}, {"id": 706, "start": 4296.5, "end": 4306.06, "text": "images jetzt jetzt gehts aber rund hier so was von responsive was denn das"}, {"id": 707, "start": 4306.06, "end": 4318.7, "text": "hast du ist das schon trends transcripted oder was hast du das auch schon gemacht"}, {"id": 708, "start": 4327.9, "end": 4332.82, "text": "das ist nice leute ihr habt vielleicht gar mitgekriegt aber wir haben uns eine"}, {"id": 709, "start": 4332.82, "end": 4339.9, "text": "oder was heißt wir der serious max ich sag jetzt mal wir ich hatte minimal auch was damit zu tun"}, {"id": 710, "start": 4339.9, "end": 4350.94, "text": "wir haben uns eine vm gemietet in der cloud mit einer 3090 gtx und die macht jetzt grafikkarten"}, {"id": 711, "start": 4350.94, "end": 4361.14, "text": "machine learning encoded transcript von meinem video also die lädt das video file und entstellt"}, {"id": 712, "start": 4361.14, "end": 4367.54, "text": "einen script über das was ich sage im video weiß gar nicht ob man sich das transcript"}, {"id": 713, "start": 4367.54, "end": 4375.1, "text": "irgendwie anzeigen lassen kann kann man sich anzeigen lassen untertitel hier untertitel"}, {"id": 714, "start": 4375.1, "end": 4387.54, "text": "tld list.com noch nicht ok aber das ist das ist wirklich das ist das ist sehr nice ja das ist"}, {"id": 715, "start": 4387.54, "end": 4392.46, "text": "das ist wirklich richtig richtig nice jetzt kann man nämlich auch das archiv durchsuchen"}, {"id": 716, "start": 4392.46, "end": 4400.38, "text": "jetzt kann man das archiv durchsuchen nach zb keck das sage ich öfters na gut was soll"}, {"id": 717, "start": 4400.38, "end": 4411.1, "text": "ich mal suchen ja publics gremple gremple guck und jetzt findet er das im transcript findet"}, {"id": 718, "start": 4411.1, "end": 4420.98, "text": "er guck mal der findet jetzt der man kann quasi das was ich im video sage jetzt volltext"}, {"id": 719, "start": 4420.98, "end": 4424.94, "text": "durchsuchen das ist richtig richtig nice wie machst du die volltext suche hast du das"}, {"id": 720, "start": 4424.94, "end": 4429.14, "text": "mit der mit der mit der postgres geschichte gemacht die ich geschrieben habe oder nimmst"}, {"id": 721, "start": 4429.14, "end": 4441.7, "text": "was anderes postgres also nimmst du die postgres volltextsuche oder wobei das können wir ganz"}, {"id": 722, "start": 4441.7, "end": 4453.38, "text": "einfach testen aber die volltextsuche nimmt null gremple stopp es ist die postgres volltextsuche"}, {"id": 723, "start": 4453.38, "end": 4463.54, "text": "wäre es die volltextsuche mit 3 grem index support dann wäre die datenbank jetzt deutlich"}, {"id": 724, "start": 4463.54, "end": 4468.58, "text": "größer aber man könnte zum beispiel nach pell suchen er wird trotzdem finden aber in"}, {"id": 725, "start": 4468.58, "end": 4476.46, "text": "dem fall ist ja auch sinnvoll nach wörtern zu suchen i3 findet er nix ich glaube mal i3 hat"}, {"id": 726, "start": 4476.46, "end": 4484.06, "text": "das das transcript zeug nicht findet gibt es nix ich glaube man muss in der suche mehr"}, {"id": 727, "start": 4484.06, "end": 4494.7, "text": "als drei buchstaben eingeben guck mal stats alter das hat das aber übertrieben hier guckt"}, {"id": 728, "start": 4494.7, "end": 4499.58, "text": "euch das mal an vor allem guckt mal wie stylisch wie stylisch das schon leht hier alles was"}, {"id": 729, "start": 4499.58, "end": 4514.7, "text": "ist das ist das craft gs oder was ist da way to dank"}, {"id": 730, "start": 4514.7, "end": 4521.3, "text": "mehr stunden gestreamt als letzten monat gesprochene wörter insgesamt ok ich habe also seit ich"}, {"id": 731, "start": 4521.3, "end": 4530.46, "text": "angefangen habe zu streamen nee in den nur in den indizierten videos habe ich sehe ich"}, {"id": 732, "start": 4530.46, "end": 4546.62, "text": "das richtig neun fast zehn millionen wörter gesprochen alter ist das viel und nur 67.000"}, {"id": 733, "start": 4546.62, "end": 4557.34, "text": "einzigartige wörter gar nicht mal so schlecht oder durchschnittliche wörter pro stream die"}, {"id": 734, "start": 4557.34, "end": 4566.02, "text": "statistik ist wirklich nice"}, {"id": 735, "start": 4566.02, "end": 4577.62, "text": "die mod stats gibt es doch gibt es doch komm doch jetzt doch gleich top klipper der sebarro"}, {"id": 736, "start": 4577.62, "end": 4592.78, "text": "was sonst ja und ich selber ach ja ich weiß warum ich hab was hab ich clips gemacht ich"}, {"id": 737, "start": 4592.78, "end": 4596.46, "text": "weiß nur was ich clips gemacht habe für videos wenn ich wenn ich manche ausschnitte in videos"}, {"id": 738, "start": 4596.46, "end": 4613.86, "text": "rein machen wollte twitch emotes better twitch tv emotes ffz emotes wurst wupp wurst sehr"}, {"id": 739, "start": 4613.86, "end": 4623.42, "text": "nice und wisst ihr was was noch viel geiler ist es gibt sogar darkseam und das sieht gescheit"}, {"id": 740, "start": 4623.42, "end": 4627.86, "text": "aus hast du die farben dir selbst ausgedacht oder ist das ist das irgendwie in den ist"}, {"id": 741, "start": 4627.86, "end": 4635.3, "text": "das ist das tailwind oder ist das irgendwas fertig ist oder was was was ist da unten drunter"}, {"id": 742, "start": 4635.3, "end": 4652.9, "text": "css technisch bootstrap customized ok ja richtig richtig muss man dazu ja sage ich massive"}, {"id": 743, "start": 4652.9, "end": 4669.02, "text": "pock das andere ist das andere ist ein custom custom thema ja beste bestes müssen wir so"}, {"id": 744, "start": 4669.02, "end": 4676.78, "text": "lassen solis für die heckermans aber das ist eh das beste steam dafür ja ja ja ja"}, {"id": 745, "start": 4676.78, "end": 4688.3, "text": "das ist wirklich das ist wirklich richtig gut geworden muss man mal sagen kann man"}, {"id": 746, "start": 4688.3, "end": 4695.42, "text": "so können wir sogar master die agile github progas auger ja das ist das ist die einzig"}, {"id": 747, "start": 4695.42, "end": 4706.5, "text": "die einzig wahre github gruppe in die man rein muss viele progas progas giga chat progas"}, {"id": 748, "start": 4706.5, "end": 4720.62, "text": "kann hier wer französisch nehmen egal leute ich kann jetzt aber ins bett gehen wir sehen"}, {"id": 749, "start": 4720.62, "end": 4747.58, "text": "uns bis denn macht's gut zu"}]}