{"text": "So, da bin ich. Heute müssen wir endlich die Skillliste fertig machen, dass ich die in den nächsten paar Tagen schicken kann. Lebenslauf habe ich mir heute schon mehr oder weniger außen den Fingern gesaugt, da muss ich bloß jetzt nochmal die ganzen Termine gucken, ob das auch alles so stimmt, wie ich es in Erinnerung habe. Ich brauche wieder High-IQ-Ideen von euch, was ich da reinschreiben kann. Ihr wisst besser als ich, was ich alles schon gemacht habe, gerade im Stream. Ups, warum habe ich jetzt Stadia aufgemacht? Musik kann sich wieder nicht entscheiden, ob es laut oder leise sein will. Ah, so geht das. Hier gibt es Skills. Ja, hast du schon was mit CICD? Ich glaube schon. Wartet mal, ich mache das mal kurz auf. Skills. Ja, also es ist alles sehr unorganisiert noch. Oh, Chain Law, seit heute oder was? Zedge. Was hältst du vom Studiengang Wirtschaftsinformatik? Naja, warum nicht? Also, was halte ich davon? Kann man machen. Man weiß jetzt nicht, was ich groß dazu sagen soll, ehrlich gesagt. Die meisten Leute, die ich kenne, die Wirtschaftsinformatik studiert haben, haben das hauptsächlich deswegen studiert, weil sie keinen Bock hatten auf das volle Mathe-Programm vom normalen Informatikstudium und nicht so sehr, weil sie Wirtschaft so geil fanden. Ich weiß ja nicht, wie es bei dir aussieht. Warum du das studieren willst? Warum willst du es denn studieren? Leute, was meint ihr? Neuer Rechner, CPU, 7950 AMD oder 13900K Intel? Leistungstechnisch müsste es eigentlich Intel sein. Aber Intel hat, glaube ich, auch echt krassen, zumindest in der Spitze krassen Stromverbrauch. Wolltest du nicht dein Skill-Sheet weiterwarnen? Doch. Doch, doch. Waren wir heute fertig. Bisschen Markdown. Komm, wir machen mal Markdown-Überschrift hier. Skillorts, alles klar, ja, das schreibe ich da so drüber. 13900, ja, ich tendiere auch dazu, tendiere da auch dazu. Chatting, ich habe ein neues Emote geadded, Leute, ich glaube, das haben wir schon eine Weile drinnen. Oh, Moment, wo sind die Emotes hin? FFZ? FFZ kaputt? Oder was? Was ist hier los? Leute, FFZ ist broken. Hat sich FFZ neu installiert oder was? Ich blick da mittlerweile nicht mehr durch. Dark Mode will ich haben. Gibt es das nicht mehr? Plugin? Wo gibt es denn hier die Plugins noch mal drinnen? Wo ist denn da Kram? Control Center? Ach, erinnert uns, hier. Ja gut, das bringt nix, weil... Emotes? Hat sich das irgendwie resetten oder was? Was ist denn das hier schon wieder? Ich glaube, jetzt geht es wieder, oder? Was auch immer, der für Schmerzen hat. Ja, und ich weiß auch nicht, warum das hier nicht im Dark Mode ist, aber okay, man. Vielleicht ist es... Hatte ich nicht eigentlich auch Timestamps? Nee, hier hatte ich keine Timestamps, die hatte ich nur bei mir auf dem anderen Bildschirm. A Kriege. Du hast letzte Woche deinen bisherigen Arbeitgeber gequittet. Was waren deine Gründe, warum du keinen Bock mehr hattest? Warte, ich hatte Timestamps, okay. Weiß nicht, warum sich das resetten hat. Trennilien, ja, das hatten wir auch, oder? Hatte ich das nicht auch, hatte ich nicht auch unterschiedliche? Ich kann doch einfach gucken, wie mein Chat letzten Stream ausgeschaut hat. Was hast du noch nicht mitbekommen? Naja, das ist schon so gemein, wie es im Titel steht. Also wenn sich bei uns nicht großartig was ändert, bin ich Ende des Jahres weg. So, zeige ich mal her, wie sah das letzte Stream aus? Gestern. Hier, so sah der Chat gestern noch aus, okay. Okay, nur Timestamps hatte ich noch, alles klar. Ja, anscheinend. Du warst eine Ein-Mann-IT-Abteilung, sozusagen. Naja, du kannst es ja auch nicht groß mitbekommen, ich erzähle das ja nicht wahnsinnig, ich zähle das ja nicht großartig rum. Also ich habe gerade ein Angebot, was ich echt nicht schlecht finde, das werde ich mir jetzt mal ein bisschen näher angucken, und wenn man sich da einig wird, was Teilzeit angeht und was Gehalt angeht, ich meine, das ist quasi 99% Remote, es gibt irgendwie zwei Events im Jahr, wo man hin muss, ja, soll mir recht sein. Aber das in Kombination ist mir einfach viel lieber als unser Boomer-Management, was von Homeoffice nichts hält. Kommt zu uns, nee, ihr wart die.NET-Entwickler, nee, da hatte ich keinen Bock drauf, ich so sehr ich sie scharf mag, hauptberuflicher.NET-Entwickler, habe ich keinen Bock. Wenn du weg bist, ist Platz für drei Consultants, nee, das ist ja gerade das Problem, kosten ja mehr Geld. So sieht es aus, sehe ich genauso, das muss drin stehen. Wie gesagt, gegen eins, zwei, drei Sachen mal Events im Jahr, soll mir recht sein, ja, so weit weg ist es auch nicht. Aber gerade nach dem Laden, wo ich jetzt bin, die sich ja auch so sehr davor drücken mit Homeoffice, ich will das auf jeden Fall vertraglich geregelt haben, ja, ja, ja, ist halt bei uns so. Gut, ich weiß ja nicht, wie es bei dir ausschaut, ist ein bisschen was anderes, aber trotzdem, die sind irgendwie nicht so ganz, was ich dann bin, tja, ich weiß nur, dass ich dann endlich Senior im Titel hab, ich hab's, ich weiß es gar nicht genau, wie die Stelle jetzt konkret hieß, weil ich bewerbe mich nicht explizit auf was, was jetzt, was schon ausgeschrieben ist, Ex-Kollege hat mich angerufen, letztens hat gemeint, Max willst nicht bei uns anfangen, aber ich hab, er hat mir auch gesagt, wie es genau heißt, ich weiß nur noch, dass Senior im Titel ist, nicht, dass ich da großartig drauf Wert legen würde, aber ich mein, hey, ich mach den Kram jetzt quasi 15 Jahre lang, da kann man, kann man auch Senior im Titel haben und alt genug, dafür bin ich ja mittlerweile auch. Unsere Consultants haben mich heute schon wieder wahnsinnig gemacht, ich hab ja heute nur E-Mails gelesen. Daily Scrum, Leute, 20 Uhr steht Daily Scrum an, jeder eine Minute, was er heute vor hat zu machen, was wollte ich jetzt sagen, man könnte das langsam in Senior in Boomer ändern, denn das müssten aber die an der Position entscheiden, die es betrifft, das werden sie nicht machen, heute hat mir einer auf Twitter geschrieben, dass in meinem Bild Chemtrails oder Chemtrails zu sehen waren, guck mal, ich hoffe ja, ich hoffe ja ein bisschen hier, ich hoffe ja ein bisschen ertreut nur, guck mal, hab ich heute gepostet, da meinte einer, da meinte einer jetzt in den Kommentaren drauf, hier siehst du Chemtrails, warte mal, irgendwo hier, schön zu sehen, dass es auch dort schon verteilt wird, Chemtrails und danach kam noch eine Antwort an, ich glaube er meint es halt irgendwie ernst, ich hoffe ja, ich hoffe ja, dass es getrollt ist, ja, dachte Chemtrails und so ist es komplett outdated Verschwörungstheorie, das nutzt keiner mehr, ich dachte es ist so ein bisschen was wie Hohlerde, Hohlerde ist auch total out, flache Erde, flache Erde ist schon angesagt aktuell, was Verschwörung angeht, aber Hohlerde ist nicht mehr so das, und ich weiß auch nicht, wie es mit den Nazis auf der Rückseite des Mondes und so aussieht, das ist auch nicht mehr so angesagt an Verschwörungstheorie glaube ich, ich hab letztens wieder ein Video geguckt, ich guck ja manchmal solche Flat Earth Fail Compilations und sowas, da hat letztens wieder einer erzählt, die Dark Side of the Moon, also die uns abgewandte Mondseite, da wäre es ja immer dunkel, hab ich mir auch gedacht, was erzählt der Typ, da ist nicht immer dunkel, da scheint auch die Sonne drauf, manchmal, wir sehen es bloß nicht, ja die haben sogar schon glaube ich vor 40 Jahren oder so mal da ne Sonde hingeschrieben, ne nicht Dark Side, das war es Far Side, ja haben es zumindest nicht, Dark Side hab ich jetzt zusammen gewurschtelt, aber da wär es ergeblich immer dunkel, im Schwachsinn da ist es nicht immer dunkel, also, hat er Blutssinn, ja, alles Fake, ja und nachts ist es kälter als draußen, das wissen wir ja alle, ach Dark Side hieß der Transformers Ding, jaja, zumindest haben sie erzählt, dass es dort ja angeblich immer dunkel wäre und niemand weiß was dort passiert und naja, wenn man sich Sondenaufnahmen oder Probenaufnahmen anguckt, da ist halt gar nix, tja, so, so sollen wir mal, sollen wir mal anfangen, Monkees, Zeit, ansonsten schwätze ich wieder zwei Stunden mit euch und dann gehe ich off, so, hier sind wir stehen geblieben das letzte Mal, ungeordnet, random Zeug, was äh dem Chet und mir so eingefallen ist, wir müssen das noch ein bisschen ordnen, ich weiß nicht ob ich da wirklich alles reinschreiben soll, weil es schon ganz schön, ganz schön viel, ganz schön viel Kram, ja, Knacken im Mikro nur bei mir, du, du hast doch letztes Mal, du hast doch letztes Mal schon was vom Knacken im Mikrofon erzählt, Mikrofon Knacktest, was ist Knackt bei dir auch? Wait a minute, Mikrofon Knacktest, was ist Knackt bei dir auch? Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, vorhin hat es geknackt, vielleicht so, weil ich hier ans Mikrofon gekommen bin, oder wenn ich mit dem Bart irgendwie ans Mikrofon komme oder so, ja, sagt mir mal wenn es wieder geknackt hat, sagt mir mal wenn es wieder geknackt hat, dann gucken wir, schauen wir mal, ja, jetzt, jetzt habe ich zum Beispiel das Mikrofon gerade bewegt, hat man das gehört? So, hört man das wenn ich das so bewege? Ne, eigentlich nicht, ja, ja, das wird es wahrscheinlich gewesen sein, Knacken mit leichten Aussatzern, okay, vielleicht waren das ein paar Frame Drops, naja, gucken wir mal, Keg-Wade, gut, macht eigentlich den Lautstärker, Teams da wieder dran rumgedockt hat, achja, was ich sagen wollte, mich haben heute wieder unsere Consultants wieder fertig gemacht, der Consultant hat einen Change gemacht, eingecheckt, Infrastructure as Code, wurde ausgerollt, ging nicht, okay, ja, ja, ja, wir müssen das noch ein bisschen ordnen, ich weiß nicht ob ich da wirklich alles reinschreiben soll, weil es schon ganz schön viel, ganz schön viel Kram, ja, ja, das hat sich tatsächlich kaputt angehört, das könnte, das könnte aber tatsächlich, beim Upload Pack-A-Loss oder irgendwas gewesen sein, ja, schon wieder, ah, ich weiß woran es liegt, ich weiß woran es liegt, ich weiß woran es liegt, ich weiß, also jetzt ist wieder gut, ne, jetzt ist wieder gut, oder, aber jetzt, weil jetzt höre ich es ja auch nicht mehr, ah, ah, was ist das, okay, was ist das, Moment Leute, ich entwirme mal mein Kabel, vielleicht bringt das was, so, schauen wir mal, Test, Test, Test, so, schauen wir mal, Test, Test, Test. Okay, wenn ich das jetzt bewege, wenn ich das bewege, fängt es dann wieder an zu knacken, oder wie ist das? Okay, wenn ich das jetzt bewege, wenn ich das bewege, fängt es dann wieder an zu knacken, oder wie ist das? Schein am Kabel, nein, das hat nicht angefangen zu knacken, ich habe es doch jetzt selbst gehört, das hat jetzt ein bisschen gerieben am Mikrofon, aber das war es, also jetzt ist nichts mehr, ne, jetzt ist nichts mehr, es ist wirklich, es ist wirklich merkwürdig, keine Ahnung was das ist, jaja, ist klar, jetzt ist Echo, alles klar, jebaited, was das ist, jaja, ist klar, jetzt ist Echo, alles klar, jeba-, was das ist, okay, das ist, das ist, das war das Kabel, aus irgendwelchen Gründen, keine Ahnung, was das Kabel für Schmerzen hat, ich weiß nicht, IP Adresse, ja, so stehe ich gleich raus, guck, jetzt bin ich wieder ins Mikrofon gekommen, aber das ist nicht das Problem, ich habe es eben auch gehört, so, also weiter geht's, also ich habe die ganze Sache hier relativ ungeordnet hingeschrieben, wir müssen jetzt mal überlegen, also, lass mal kurz in mich gehen, also, Linux, 15 Jahre Linux-Erfahrung, Red Hat, CentOS, Ubuntu, Debian, Arch-Spidey-Way, soll ich das haben, das hat halt Shed letztens geschrieben, ich schreibe nicht Arch-Spidey-Way rein, ich schreibe es einfach nur so, ich kann da nicht Arch-Spidey-Way reinschreiben, im Summer, Web-Server, Reverse-Box, Nginx, Kali, das kann ich wahrscheinlich dann weglassen, ok, ich muss mir irgendwie husten, so, die ganze DevOps-Geschichte, ok, wenn euch da noch was einfällt, sagt Puppet, Puppet habe ich tatsächlich auch noch ein bisschen Ahnung, fuck, warum muss ich jetzt so bloßen, ok, Monitoring, Prometheus, Kafana Nagios, Influx DB, alles klar, ok, Cloud, Cloudgedöns, Cloudflare, Cloudflare habe ich tatsächlich schon ein paar Sachen mitgemacht, Serverless Azure Functions, ja, mal ein bisschen Zeug hin, ok, jetzt machen wir den, so, hier schreiben wir natürlich CI, CD noch rein, du wolltest die Linux-Tools noch zusammenfassen, ok, ne, Datenbank habe ich keine Ahnung von, ja, habe ich ja schon sowas, das haben wir, so, das haben wir schon, da wollte einer jetzt hier plus plus schreiben, ok, schreiben wir, wie nennt man das, Development oder Softwareentwicklung oder irgendwie sowas, Hashtag Progers, so, da muss ich jetzt mal die ganzen Kempel hinschreiben, also was habe ich denn, was habe ich denn Ahnung von, vielleicht sollte ich hier oben noch, hier muss noch hin, Loadbalancing, Hochverfügbarkeit, Software Engineering, coolen Sachen, Cobol, Cobol musste auf jeden Fall hin, ja, das kann ich, das kann ich von unten mir dann rauskopieren, IoT wollten wir noch machen, ok, ich lösche die Sachen mal raus, die ich schon oben stehen habe, KVM muss da nicht, muss da KVM rein, KVM können wir ruhiger reinschreiben, Containerisierung, ist Containerisierung ein Wort, schreibt man das so, Containerisierung tatsächlich, mal die interessanten Sachen eben ein bisschen oben hin, ok, also Serverless, schreibe ich, das schreibe ich einfach dabei, passt das sonst, passt das sonst ganz gut hin, so IoT können wir noch machen, I'm not, kann ich nicht genau sagen wie die Stelle heißt, weil mich hat ein ehemaliger Kollege angerufen hat gemeint, Max willst du nicht bei uns anfangen und ich habe mit ihm telefoniert und hat mir auch gesagt wie das heißt, ich glaube es war irgendwas, entweder Senior, was war es denn, es war nicht Senior DevOps Engineer, es war auch nicht Senior Admin, es war Senior Engineer Development Infrastruktur oder sowas, Senior Engineer Development Infrastructure, irgendwie sowas, ich krieg's aus dem Kopf nicht genau an, was ist das denn, Chat ihr verarscht mich doch jetzt oder, was ist das denn, wie jetzt, was ist da los, was soll das, ich hab mich überhaupt nicht bewegt, wie jetzt, was ist da los, ok, ok, wir versuchen das jetzt nach zu vollziehen, ich wackel jetzt, ich wackel jetzt hier mal am, aha jetzt hab ich was gehört, jetzt hat es ein bisschen geknackt, jetzt bewege ich mal hier das Kabel und das Zeug, ok, ok, ok, das ist sehr merkwürdig, ich weiß nicht was das ist, das ist sehr merkwürdig, es liegt auch nicht an OBS, ich hab's ja eben auch in Audacity gehört, ich weiß bis heute nicht, ob man das so ausspricht, vielleicht ist es auch Windows Bullshit und nach einem Restart ist es weg, man weiß ja nicht, ok, IoT, da kann ich auf jeden Fall noch reinschreiben, also da schreib ich, das weiß ich gar nicht ob ich das hinschreibe hier, das hat ja für meinen Job überhaupt keine Relevanz so, letztendlich, ich mein, das ist eigentlich total irrelevant dafür, ok, Software Engineering, was haben wir denn da, da kann ich den Kram von hier unten nehmen, Serverless, Serverless schreiben wir einfach mal, nee Serverless hab ich da oben schon stehen, Progas, so das kann weg, Object Detection, das haben wir tatsächlich schon im Stream gemacht mit OpenCL, war das glaub damals, Protobuf, gRPC, HiIQ, Begriffe einfach mal hier eingeschmissen, Shell Scripting, Retardsenders, ok, das hab ich alles schon, Windows, wisst ihr was da rauskommt, wenn ich da drauf klicke, wenn mich einer was zu Windows fragt, Open, das kommt da raus, wenn mich einer zu Windows fragt, oder eigentlich sollte besser das da rauskommen, eigentlich bräuchten wir das, ich will nicht Kubernetes reinschreiben, die Sache ist die, ich hab Basic Ahnung von Kubernetes, aber ich bin jetzt niemand der irgendeinen Kubernetes Cluster aufbauen kann, ich kann da was deployen, ich kann da was restarten, aber super krass Ahnung von Kubernetes hab ich net, ja ich lerne das bis morgen, wenn ich abschicken muss, den Manage Kubernetes kann ich aufbauen, ich meine, ich kann das ja durchaus mal reinschreiben, aber vielleicht soll ich lieber Kubernetes, naja komm, komm wir schreiben K8S rein, die coolen wissen das, die Skills brauchen eigentlich noch eher ein Skill Level, theoretisch schon, es knackt wieder, Leute ihr könnt mich jetzt mega Chebaten, ihr könnt mich den ganzen Tag Chebaten jetzt und ich muss das nachkommen, ok das liegt dann wirklich an der Bewegung hier, vielleicht kackt das wirklich, ja wenn ich den, ich merke es gerade, wenn ich den Kopf, ja wenn ich den Kopf, ja das ist wenn ich den Kopf in falsche Richtung bewege, ich glaube das das Headset gibt langsam den Geist, aber ich meine, ohne Scheiß ich meine ich hab das Headset jetzt seit 2010 oder so, 2011, übelst lange schon, das ist immer noch das MMX300, ja das MMX300 das finde ich das beste, was es gibt, also wenn man es nicht total übertreiben will, natürlich kann man sich auch und das ist wahrscheinlich insgesamt die bessere Wahl, ja auch ein Kopfhörer kaufen mit Mikrofon, aber angenehmer ist es halt trotzdem mit dem Headset, ich könnte mir tatsächlich mal ein neues MMX300 gönnen oder, warte mal hat es da oben auch so ein Polster wie das hier her, du hast ja selber gebaut, naja selber gebaut wollte ich gerade sagen ist ein DT770 mit dem Mikrofon, ich hab kein Voice Meter, wie gesagt ich siehs ja hier, ich hab direkt, wir können da direkt das Mikrofon einstellen, ansonsten ich meine ich könnte, wenn es gar nicht hilft, ich könnte hier mal ein bisschen dran rumdrehen oben an der Verlängerung oder so, aber ja, wir lassen es jetzt einfach mal, ok also IOT, MQTT das ist ok, das ist ziemlich egal, also Softwareengine, da kann ich von hier unten was kopieren, Brotobuff ist doch ein GRPC Gedöns oder, so also es kommt da irgendwie rein, Cloud, Netlify kann ich da tatsächlich auch noch reinschreiben, exellent, exellent, was haben wir hier sonst noch, Alibaba Cloud, so ein Blödsinn, weil ich da für den Scheiß reingeschrieben hab, ok das kann ich, das kann ich kopieren, was ist was, Netlify, Netlify ist ein Dienst, was gerade angesagt ist wenn du deine, ich kanns ja noch mal schreiben, Net, Netlify, so jetzt, da kannst du deine Web Anwendung drauf deployen und nach Möglichkeiten möglichst nah an dem ausliefern der die Seite ausmacht, die die Seite aufmacht, also hauptsächlich wird es, wurde es die ganze Zeit für statisches, statischen Web Content, ein bisschen sowas wie Versel, ja, ja, im Prinzip ist es recht ähnlich, ja, ok also das kann ich doch jetzt gerade mal hier übernehmen und dann müsst ihr mir sagen, Node.js muss da auf jeden Fall nachhinein, Frontend, Frontend machen wir dann, so, Shit++, GitHubX, haben wir alle schon, ja, IDE Editors muss ich da nicht, muss ich da nicht reinschreiben, Tools, Tools, Tools könnte man vielleicht noch irgendwie, die Skillbars sind sinnlos, ja die kommen auch weg, ja in Vim könnte ich jetzt D drücken und dann einfach Punkt, Java, Kekkel, ok die Hälfte davon stimmt ja gar nicht, die Hälfte stimmt ja davon gar nicht, also, PainsChamp muss da schon mal nicht hin, so, also Cobol ist da auch eher der Witz, ja, können Sie mich aber fragen, so C Sharp, sagt man das eigentlich offiziell groß oder klein, C Sharp, Ruby, Bash, Shells, Gripting, Go, die Hype Sprachen, mal ein bisschen weiter oben, Git ist auch drauf, so, also, Chat was habe ich denn vergessen, Blatter, also, ich habe in PowerShell schon mal was gemacht, ja, hat ich schon mal gemacht, ja, so, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, so, ja, ja, ja, ja, ja, ja ja, ja, ja, ja, ja, ja, ja, ja, wire地, Allg Berry Ja plan von was gibt es kraft ql Vue gs. Ich view jason homocyste Ja Da war wahrscheinlich kein interessieren kann man ja mal hinschreiben markt dauern Die Warum nicht web assembly c++ ffm pack ne ffm pack muss ich da Was gibt es da kommen wir kommen wir sind wir sind mal so frei Wir schreiben einfach, wir schreiben einfach alles rein. CSV. Svelte, Svelte, Svelte Kit, halt man so. Gibt es Dokumentationstools mit denen du dich auskennst? Naja also Tools kenne ich mich ganz gut aus mit Jyra, mit Confluence, Dokuviki, ist das Snippingtool, Bitbucket haben wir oben schon stehen. Ich weiß gar nicht was ich da sonst noch dazu hinschreiben soll, was soll man denn bei Tools hinschreiben? Keine Ahnung, ich muss erst mal, ich muss erst mal den anderen Krämpel hier fertig machen, sonst fällt mir nix mehr ein. WebRTC haben wir Zeug gemacht. Google Maps haben wir Zeug gemacht. Tailwind, CSS haben wir Zeug gemacht, das fällt mir nicht mehr ein. Postman, sehr gut, sehr gut. Nee, nee, nee, nee, seht AWK, DD nicht rein, das habe ich hier oben aber das lasse ich raus. Das ist doch bescheuert, üblichen Tools, die braucht doch... Interessiert doch keinen. LSD, PWD, ja genau. Die Scout, JetBrains, Netzwerk, ja stimmt, ich habe eine CCNA 2009 oder so gemacht, ja geil, das hat die Welt, das hat die Welt gebraucht. Rest, Soap und, oh Gott, kann ich ja ewig aufzählen. Rust, ok, Programmiersprache, Rust, bisschen, bisschen war es schon gemacht, ja, sogar, sogar mehr als Basics, ColdFusion, was kommt als nächstes? Lotus Notes oder wie? Wenn schon dann so, warte mal, haben wir nicht Stream-Projekt-Ideen, Stream-Ideen, ok, keine Ahnung. So, jetzt da haben wir schon drinne, Monitoring haben wir auch schon, Monitoring haben wir schon drinne, mir fällt jetzt wenig, Grafana haben wir auch schon drinne, ich meine sollte doch eigentlich reichen, das ist quasi hier ganze IT-Abteilung, Cloud Asher könnte man noch aufschlüsseln in die konkreten Produkte, das ist wohl wahr, aber das können sie mich ja dann fragen, ich meine, GraphQL habe ich auch schon drinne, das liest, wollte quasi liest sich eh keiner durch, wir ordnen mal die Sprachen so ein bisschen, hast du sonst keine Zertifizierung, nö, das schreibe ich da gar nicht rein, das ist mir zu doof, kann ich jetzt hinschreiben, beste besten Soft-Skills aller Zeiten, WebAssembly haben wir schon drinne stehen, das war einfach nur genehmt im Stream, das schreibe ich so bestimmt nicht rein, das ist zu viel, ja ich denke auch, dass es zu viel ist, so irgendeine noch schlaue Ideen, also wie gesagt, wir können das auch ein bisschen zusammenfassen, das ist eigentlich viel zu viel, wie sieht denn das in Markdown aus, wenn man das rendert, ach das ist eine TXT, das ist gar kein Markdown, heck wait, oh ok, nice, easy, gg, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok... Ehrlich gesagt zum größten Teil ein Wrishel Studio Debugger, aber ansonsten hält es sich Grenzen. Profiler Tracing Tools Performance. Tracing Tool Console Write Line. Zählt das auch? Zählt das auch? Print F. Ich sag auch einfach fehlerfrei programmieren, dann braucht man keine Debugger. Wie gesagt, um die, ähm, jetzt mach ich mal raus, weil ansonsten check ich dann noch aus Versehen ab. So hab ich Ahnung von Datenbanken Leute, ich hab tatsächlich, ich hab ein bisschen Ahnung von, ähm, Postgres, Fulltext Search, SQLite, Redis hab ich tatsächlich ein bisschen Plan so Minimal, ich kenn Redis auch nur quasi als Cash, so als Cash Key Value Store, beziehungsweise so als, ähm, PubSub Lite und es war ne Zeit lang halt mega angesagt, ist es glaub ich immer noch. Elastic Search hab ich wenig Plan von, Cassandra DB hab ich auch keine Ahnung von, also ich, das einzige, pass auf, jetzt hab ich wieder am Mikrofon bewegt, ähm, das einzige was ich von Cassandra DB weiß, aber das reicht nicht um mich da zu qualifizieren zum draufschreiben, dass das irgendein verteiltes Datenbank System ist, aber ich hab die elfte schon wieder vergessen von FoxPro man, Leute mir gehts nicht darum, dass ich da irgendwas reinschreibe, das muss schon was sein wo ich ein bisschen Plan habe, ja es steht aktuell gerade zur Diskussion ja, ja das stimmt hab ich gesehen, also ich hab ein Angebot, mich hat jemand angerufen und hat gesagt hier Max willst du nicht bei uns anfangen und ich hab gesagt jo, erzählt mal und ich find das Klip hört sich echt nicht übel an, ich hab ihm gesagt ich schick ihm mal eine Skillliste ohne Lebenslauf,.NET Developer Roadmap, mal gucken was ich davon kann, ok, MonkaS zeigt mal her, wie gesagt ich arbeite, ich werde nicht als.NET Entwickler arbeiten dort, also das ist nicht so, Alter wie fett ist denn das, JIT, HTTP, HTTPS, naja gut, ah das hier ist tatsächlich gar nicht mal so blöd, wie SQLite soll man nicht lernen oder was ist das, ach you must know, ja Prometheus, Grafana, datadoc, kenn ich aber hab ich noch nie was mitgemacht, ist einfach teuer as fuck, hast du Kurzbeschreibungen zu Projekten, im Zweifelsfall gebe ich denen mein GitHub Account und dann können sie sich erstmal 20 Projekte angucken mit Champ im Namen wo keiner weiß was ich gemacht hab, das soll nämlich dann fragen was sie genau wissen wollen, das ist ja noch wie gesagt, ist nicht dass ich da morgen anfange, ich will mir das eh auch erstmal angucken, ich hab schon gefragt ob man mal so einen Probetag machen könnte, dass ich das mal angucken kann, die werden rausfinden dass du Streamer bist, naja derjenige der mich angerufen hat, der weiß ja dass ich YouTube mache und Twitch, naja das ist zu Software lastig, naja warum nicht, naja, naja das Monarch S Projekt, ja das ist ganz toll, oh was gehts, moin Michael, 5 Spillian, kannst du die Ordnung posten, das wäre mal eine Frage, ja also so viel fällt mir jetzt da wirklich nicht mehr ein, ich mein es liest doch eh kein Mensch durch, noch irgendjemand, irgendwelche schlauen Ideen, nicht was ich reinschreiben wollte, sondern irgendwas was ich noch vergessen hab, also ich will jetzt ja nicht was reinschreiben wovon ich keine Ahnung hab, also es ist nicht das Ziel hier möglichst viele Sachen aufzulisten sondern Sachen mit denen ich auch schon mal mehr als einen kleinen Handschlag gemacht hab, du würdest das einfach nur noch weiter strukturieren, das liest im Endeffekt doch eh kein Mensch, noch mein Netzwerkrahmen vom Provider, lass mal überlegen, ja ich kann ein bisschen, ich kann ein bisschen Cisco Command Line, ja ich weiß noch dass man Enable machen muss am Anfang und dass man No, No SH macht um den Port hochzufahren, das krieg ich noch aus dem Kopf hin, Conf T genau genau und dann irgendwie Backup, No Shut, No SH macht man, ah das ist tatsächlich eine gute Idee, wenn ich hier schon die ganzen anderen Websockets, ja generell Protokolle, bei Netzwerk, kann doch da jetzt nicht TCP, das ist doch hängen geblieben eigentlich oder, in Bewerbung sollte man nur Sachen reinschreiben die auch für den Job relevant sind, nachdem die mir noch gar nicht genau gesagt haben was ich eigentlich später machen soll, weil ich nur so quasi zwischen so halb offiziell mit meinem Exkollege telefoniert hab, kann ich das nicht so genau sagen, Lifecycle Management, das ist ein Sixhead Begriff, das muss da rein und zwar da, Lifecycle Management Massive High IQ, was das ist, ok wenn mich einer fragen würde was ist Lifecycle Management, danach die Motto sie haben Lifecycle Management reingeschrieben, was verstehen sie unter Lifecycle Management, da würde ich sinngemäß sowas sagen wie ja es geht im Prinzip darum System quasi von der Erstellung, von der wie nennt man das heutzutage, von der Professionierung bis zum Abbau was sie in Übersicht zu haben, ansonsten keine Ahnung ob das stimmt, ich glaube schon, also auf deutsch ist das sowas wie System Lebenszyklus oder sowas, Updates für Softwares programmiert, ich wüsste nicht wie man das schreiben soll, keine Ahnung, Patch Management Massive Idee, das schreiben wir nicht bei DevOps rein, das schreiben wir hier oben mit rein, Deckdose Flaschen, null, warum nicht, Release, ja das stimmt das mache ich ja aktuell ja gerade sogar, Release Management, Keksteam beste, ja ich finde auch die sollten sich mal neue Bezeichnung überlegen, ah Lifecycle Management, so ich glaube das erschlägt erst, das lasse ich raus, 123 Zeilen, die ersten 3 Management sind richtig geschrieben, ich kann dieses Wort nicht richtig schreiben, Chat, Twitch Chat, vor allem ja ehrlich gesagt vor allem Workstation kann ich noch einschreiben, aber Tools, ja Tools, ja ja, mit Vagrant habe ich auch schon mal was gemacht, das ist eher DevOps Kram, ne Mail habe ich keine Ahnung, GitOps, auch so ein geiles, so ein geiles, so ein geiler Begriff irgendwie, ja gut Virtualisierung kann ich da tatsächlich, anstatt KVM schreibe ich, Virtualisierung, GitOps, da soll ich aber zumindest, wie gesagt ich will eigentlich nur Sachen reinschreiben wo ich auch direkt aus bestehgreif was zu sagen könnte, GitOps, ah ok, ich verstehe, das ist quasi DevOps beziehungsweise CI, CD wenn man Git verwendet, so nach dem Motto, Comet kommt rein, Pulle Request wird genehmigt, Deployment läuft los und sowas in der Richtung, ja, naja, 5 Minuten da, ok, das hört ja gar nicht mehr auf, so kam hier noch irgendwas, kam hier noch irgendwas im Chat, schon das er schief durchgescrollt, ja, auf Stream, ich habe bestimmt total viel Zeug noch vergessen, fällt das nicht unter DevOps, doch die Kategorien sind eh, sag mal mal, Variabel, ja, schreibe es einfach doppelt rein, null, merkt schon keiner, was meinst du mit Linux Lifecycle Management, ich meine dafür geiles Management-Busword, also was sagt denn Wikipedia dazu, wie gesagt was ich da drunter verstehe, habe ich euch schon gesagt, mal gucken was Wikipedia, Produktlebenszyklus, was sagt denn Wikipedia dazu, Produktlebenszyklus Management, PLM, ah ja, ja das ist dann aber weniger Linux, das ist weniger Linux, ist tatsächlich eher sowas hier, wollen wir das nicht alles in eine Zeile machen, wie sieht es mit ITIL aus, ich habe keine ITIL Zertifizierung, ich habe weder eine safe noch ITIL noch lean noch haste nicht gesehen, Zertifizierung, ja, will ich aber nicht hinschreiben, Bench, ja tatsächlich, aber weiß nicht wo ich das dazu hinschreiben soll, nein Active Directory habe ich keine, mach TOGAF, was zum Teufel ist TOGAF, die TOGAF, alter wie viel scheiß ist da gebt man, TOGAF, Open Group Architecture Framework, Richtung AI habe ich keine Ahnung von, ne ich schreibe alles das was ich schonmal gemacht habe, wo ich zumindest schonmal mehr gemacht habe, als einfach nur 2 Zeilen zugelesen, den ISO 9001 hätte ich noch zu bieten, ne habe ich keine Ahnung von, schreibe Quantencomputer hin, alles klar, Blockchain Maschine, Quatsch Leute, ist doch blöd, ich will ja nicht diese random Buzzwords hinschreiben, UML Diagramme, View ins Welt habe ich schon hingeschrieben, UTF-8, ey die Codings UTF-8, boah das ist irgendeine MySQL Geschichte, ja, Docker ist selbstverständlich, ist Docker dabei, Docker muss da relativ weit oben hin, Docker Hub, GHCR, gute Idee, gute Idee, ne, das wird der HR Typ bestimmt nicht fragen, weil der HR Typ von sowas keine Ahnung hat, aber das ist tatsächlich, ist auf jeden Fall nicht verkehrt, ja, gezwungenermaßen aber nicht, dass ich davon Ahnung hätte, noch Veed können wir noch hinschreiben, ja, Portena mag ich nicht, ey ich glaube jetzt haben wir es, Traffic Kammer schon drinnen, haben wir es schon drinnen, wir sind nicht, wir sind nicht bei 1996, ja, das ist die Red Hat Docker Alternative, die quasi ohne Route-Rechte funktioniert, boah das ist, das glaube ich so der Haupt Selling Point, achso, ja tatsächlich, damit kenne ich mich aus, ja, Raid, wo schreiben wir das hin, wo schreiben wir denn, Raid, Raid können wir noch zu Linux schreiben oder, Raid, was ist das Besondere an Red Hat, wie, du meinst an Red Hat, an Red Hat Linux, ja gut es ist halt ein eigener Distributionszweig, einer der professionellen Support liefert und im Enterprise Business Sektor recht angesagt ist, aber es gibt auch kostenlose Nachbauten, auch wenn CentOS nicht mehr gibt, aber es gibt jetzt Rocky Linux und Alma Linux, die ich aber noch nie verwendet habe, äh, Disk End, das muss ich doch nachher hinschreibe, also was ist denn die Red Fish API, Red Fish API, aha, was es nicht alles gibt, habe ich noch nie, habe ich noch nie gehört, weil das nicht Linux ist, ja was ist das, ich habe keine Ahnung, Tools, meinst du die interessieren sich auch für deine KD, bestimmt, vielleicht sollte ich hinschreiben, dazu bräuchte das Spiel ja erstmal Stats, bei der KD kann ich dir nicht sagen, das Game hat ja keine Stats, Server Administration, ja gut, das sollte eigentlich, ähm, sollen wir Linux Erfahrung und Administration irgendwie hinschreiben, Linux Erfahrung, wollen wir das so hinschreiben, Expanter Moab World Record Holder, ohja unbedingt, Apache Meso, benutzt das überhaupt noch jemand, Ansible steht auch schon drin, Kafka habe ich zu wenig Plan, was ist das hier, das Scalable Platforms Management Forum, die haben auch einen geilen Namen, Red, Red Fish API, haben iTracks Red Fish oder was, habe ich noch nie gehört Leute, haben wir wieder was gelernt, tatsächlich interessant, wusste ich nicht, das wusste ich mir tatsächlich mal merken, tatsächlich, ok das ist cool, das wusste ich nicht, da kann man ja die iTracks zum ersten Mal ordentlich ansteuern, das wusste ich mir merken, das ist ja mal Chat wieder was gelernt, ja, ja das ist wirklich cool, ich habe das bisher immer ausgelesen über SSH, SSH eingeloggt beim iTrack und dann irgendwelche komischen SSH Befehle ausgeführt, schon mal so eine Netzwerk-Virtualisierung gemacht, ja aber nicht wirklich so jetzt, dass ich mich damit wahnsinnig auseinander gesetzt habe, ich habe mal schon virtuelle Switches installiert beziehungsweise ich habe sogar mal docker auf einer MikroTik Kiste laufen, äh nicht docker, Linux Container auf einer docker, äh auf einer MikroTik Kiste laufen lassen und wir haben auch mal glaube ich auf irgendeinem Cisco Core Switch bei uns, da habe ich nur zugeguckt bei der, also da nee da kann ich nichts zu hinschreiben, ja haben wir schon drin stehen außer Chef, von Chef habe ich nicht viel Plan, das ist jetzt auch nicht so als wäre ich da der krasse Checker, das haben wir schon drin stehen, aber wenn die mich danach fragen muss ich sagen, ja ich habe damit schon was gemacht, ich kann damit auch was deployen, ich weiß so prinzipiell, prinzipiell ja was man da so drauf gucken muss, aber der große Kubernetes Checker bin ich nicht, also jetzt nicht so als könnte ich da irgendwie ein Cluster selbst installieren und dass es dann auch irgendwie über mehrere Knoten gescheit läuft, also da habe ich zu wenig Plan von, haben wir schon drin stehen, Crossplane habe ich nicht drin stehen, genauso wenig wie biceps von ähm von Azure, weil habe ich auch zu wenig mitgemacht bisher, Software Storage habe ich auch kein Plan, MQTD habe ich tatsächlich ja, ich würde sagen das geht doch hier alles schon mal ganz gut klar, cools, nur mit dem Unterschied dass ich von den Sachen die ich da reingeschrieben habe auch insofern Ahnung habe, dass ich entweder gleich was damit machen könnte oder eben nach kurzer Zeit nochmal angucken was machen könnte, ich habe mit allen Sachen die da drinstehen schon mal was gemacht und zwar mehr als nur ein Finger krumm also, ich habe da aber, ich habe von Datenbanken wenig Ahnung, deswegen, ich habe Poresquare als Full-Text-Dutch bisschen gemacht, ich habe relativ viel SQLite, allein schon durch das ganze Programmierzeug hier gemacht, Cassandra habe ich gar keine Ahnung, Leute wir haben doch letztens so einen komischen Kurs, erinnert es, ist jetzt so ein Witz ne, ich will das nicht reinschreiben, wir haben doch letztens so einen komischen Kurs gemacht von irgendeinem Bundesministerium, da gab es doch irgendwie so einen Kurs, ich meine nicht diesen Arbeitsamt-Test, schon irgendwie ein halbes Jahr her, da hat man so einen komischen Test gemacht, es war sowas wie der Internetführerschein, ich habe schon wieder vergessen was das war, schreibe auch noch eine Projektliste, beschreib mir welche, Park Alter, das ist mir aber zu anstrengend, da muss ich mir jetzt echt Gedanken machen, da müsste ich dann schreiben wie ich den Fiat Champ programmiert habe, ja wir haben das on stream gemacht, irgendwo hat man Archive, bestes Fiat Archive, wieder einfach mal Live Overflow, warum ist der hier in dem aktuellen Stream drinnen, achso weil wir das live geguckt haben, ähm, Zwelt Auto Complete und Postgres Text Search, Jupp da ist es guck, Jason Jaml haben wir schon drinnen, Projektliste, boah ey das ist dann aber ganz schön anstrengend, ich muss, ich muss wie gesagt den Lebenslauf noch fertig machen, ich habe das schon geschrieben zum größten Teil, ich muss noch gucken, dass das Datum stimmt und sowas da drin steht, mit welchen Mail Providern hast du denn Gabe, was, Gmail, Webmail, Yahoo, mehr oder weniger keine Ahnung, ja Gmail, GMX aber wen jucken das, bitte schön, was die interessieren würde ist eher sowas wie, ähm, ob ich Ahnung von Postfix oder Q-Mail oder Exim oder was es da nicht alles gibt habe, Dofkort, ja genau, NPM, ja das ist tatsächlich keine schlechte Idee, MS-Build, war komplett andere Scheiß, ich schreibe einfach dabei, ich schreibe einfach dabei, Sprachen, da schon reingeschaut, das ist eigener, das ist mein Stil, Leute, das ist, hier ist nichts Obvious, ich habe schon Dinger gelesen, teilweise im Chat, da kann ich nicht wissen, ob einer G-Baded oder nicht, aha, aha, ich glaube, das ist verbuggt vom Serious Max an der Stelle, weil man nicht über die Startseite geht, der müsste noch ein Fallback in seine Svelte-Kit-Anwendung einbauen, Tools, ähm, ich habe noch eine Idee, Moment, Tools, Azure CLI, Unit-Tests, mit sowas gebe ich mich erst gar nicht ab, wir programmieren einfach fehlerfrei und dementsprechend brauchen wir auch keine Tests und wenn man keine Tests braucht und einen Fehlerfall programmiert hat, braucht man auch keine Dokumentation und auch keine Kommentare, ganz einfach, was das für Zeit spart alles, einfach keine Fehler machen beim Programmieren, ist doch ganz einfach, hast du vor das Markdown Dokument, ja, ich werde das wahrscheinlich als PDF, PDF machen, tatsächlich habe ich von den, ähm, hält man das so, Browser, Browser-Steuerung, ja, ja leider und ich weiß nicht woran es liegt, ich weiß nicht, ich weiß nicht woran es liegt, es ist irgendwie kaputt, es ist irgendwie kaputt, ja das knackt es manchmal, wartet mal, ich guck mal hier oben, ich guck mal kurz hier oben dran, ob ich, wenn ich das bewege, ob das was hilft, ob das ein Sack, Kacke, warte mal, warum bewegt sich hier nichts, aha, so, exellent, ja, alle wieder geknackt, meint ihr, meint ihr das ist der Stecker, an dem ich gerade rumgewackelt war, erwähnt bloß den Stream nicht, warum, also mach ich nicht, aber warum, also ich werde nicht, nichts von YouTube und sonst wie, ich werde vielleicht, ja bin ich mir noch unschlüssig, ich werde wahrscheinlich reinschreiben, in den Lebenslauf ab 2012, dass ich, wie nennt man das eigentlich, neben beruflich Selbststände, nee das ergibt keinen Sinn, wie schreibt man das, dass ich seit 2012 eine eigene Firma hab und damit Zeugs mache, wie, wie, ja, frei beruflicher Medien, alter Sixheader, ey, das muss ich mir, das muss ich mir aufschreiben, da hätt ich nie drauf, nie dran gedacht, ja, Webvideoproduzent, ja, frei beruflicher Medien, ja, nee, nein, das schreibe ich so nicht, ok, ich glaube das reicht jetzt, Leute, Das reicht jetzt Leute, ich glaube das ist genug, das ist glaube ich wirklich genug. Sieht sich doch kein Mensch alles durch. Und hier machen wir die Rakete raus. Muss eh noch kürzen, nee das knalle ich denen einfach so hin. Kann jemand ein gachi emote reinschreiben, gachi bass kannst du reinschreiben zum Beispiel. Ja gachi hyper gachi. Überqualifiziert ist ein bescheuerter Begriff, damit ist eigentlich gemeint, den kannst nicht gebrauchen, das ist sowas wie übervorteilt, das ist auch so eine bescheuerte Formulierung. Gut ich glaube das reicht jetzt, chat wenn euch noch was einfällt schreibt das ruhig in den Chat, ansonsten wollen wir mal gucken ob es irgendwelche interessanten Videos gibt. Also wir hätten hier zu bieten, was ist denn das, war ja gut wo ich es aufgemacht habe, wir hätten noch dings zu bieten hier, level, nicht level keck, fire ship neues video. Hast du raspberry pi krams reingekriegt, du hast recht habe ich nicht, könnte man bei iot reinschreiben aber einfach nur weil es sich, warum nicht, dns active directory ldap habe ich keine ahnung von, kann dns aber benutzen, aber von active directory ldap habe ich wirklich keinen plan. Was der youtube editor für den video, wortkanal, was meinste, muss da wieder zeug rausgeschnitten werden oder was, ich will das gar nicht reinschreiben da kommt noch einer auf die idee, ich soll später active directory machen, guck mal mein eigenes video wird empfohlen, das muss ich kurz mal starten und muten im tap, was ist hier los, mit dem firefox kann man das im tap muten, video starten, view time, youtube, was wollt ihr von mir, geht mal weg, hallo leute hier ist der max und jetzt muten, exellent, view time, chefs habe ich reingeschrieben allerdings weder solstack noch chef weil ich davon zu wenig plan habe, die wahrheit wurde revealed leute, nur bei level cap was ist das, ey das ist echt gut gemacht, ich meine die beleuchtung stimmt nicht so ganz aber das ist wirklich gut gemacht das ist gut, das hat er wirklich gut gemacht wie lange hat er daran gerendert, ey welche spannenden videos da drin, must have services auf dem heim server, ok nix was ich wahrscheinlich brauche, ja die videos werden mir empfohlen aber das meiste ist mir zu hyper aktiv, also wirklich spannend, das ist ja heute noch dabei oder, blazingly fast, ja ja haben wir alles schon drin stehen, haben wir alles schon drin stehen, battlewolf haben wir alles schon drin stehen, ok was, physics sagt, hey max, hab es vorhin schon kurz geschrieben aber war dann kurz weg, mein internet geht nicht aber das ist schlecht, die fritzbox zeigt trotzdem an, dass telecom gesynced ist und ipv4 verbunden ist, ja gut das kann ja schon sein, im funktionstesterbox hängt er trotzdem bei internetverbindung dns aber habe ich schon getestet, hast du vielleicht eine idee, kriegst du eine ip, also klappt die dsl einfach, kriegst du eine ip, kann ja durchaus sein, dass du eine ip kriegst und es danach nicht weiter geht, danach die telecom gerade irgendwelche probleme, das kann ja auch sein, also ich würde einfach mal gucken ob die einwahl klappt, nee ping auf dns aber geht nicht würde ich mal so sagen oder, so interpretiere ich das, ping auf dns geht nicht, traceroute wird ihm wahrscheinlich, ja doch in dem fall könnte vielleicht traceroute sogar wirklich ein bisschen was bringen, normalerweise bringt traceroute meistens nichts aber doch in dem fall könnte es vielleicht doch, ja doch in dem fall könnte traceroute wahrscheinlich doch was bringen aber solange er keine public ip kriegt bzw. überhaupt keine ip kriegt ob bei seiner fritzbox dann weiß mir ja schon was sache ist, jo nice, ich weiß nicht ob das was taugt, taugts was, ich hab das nicht, ich hab ja wie gesagt einen dreamscreen, leute ich stehe grad vor der wahl, was soll ich mir, ok fangen wir erstmal an, wenn ich ende des jahres tatsächlich kündigen sollte, dann muss ich ja mein firmenhandy zurückgeben und bei der gelegenheit wollte ich auch mir eh jetzt schonmal ein neues handy kaufen, ein eigenes neues handy, weil ich muss ja auch die ganze zwei faktor authentifizierungs services die ich über die firmenhandy nummer laufen hab umstellen, so ich bin grad am überlegen was ich für ein handy kaufen soll, ich hatte die letzten jahre über eigentlich nur iphones aus dem grund, weil ich es nicht bezahlen musste, das heißt die grundsätzliche frage ist android oder apple aber ganz ehrlich, ich tendiere eigentlich weiterhin zum apple, ich sehe auch für mich gerade keinen irgendwie richtigen grund warum ich irgendwie umsteigen sollte und mich an was neues gewöhnen muss, der einzige richtige vorteil von android bei mir wäre jetzt, dass ich sagen könnte ja, ich könnte natürlich da deutlich mehr automatisierung und spielereien machen, ihr wisst ja sowas mach ich gerne, ios kann sich ja kaum was machen in der richtung, aber ansonsten, wahrscheinlich wirds ein iphone, dann ist halt die frage welches iphone, ich tendiere aktuell zu einem 14 pro oder einem 13 pro aber 13 pro gibts nicht mehr zu kaufen, ansonsten würde ich ansonsten, weil ich finde die sache mit 120 hertz ganz cool und diese komische dynamic island geschichte oder so, brauche ich noch beim besten will nicht, aber ok, was kostet denn das aktuell, apple willst aber wissen ey, alter was sind denn das für smartphone preise man, dafür hast du, für das hast du letztes jahr noch high end grafikkarten gekriegt, heut kostet nicht high end grafikkarten das doppelte und das iphone ist doppelt so teuer wie davor, schau wirklich mal rein ok, china chinesen kram, haben die sich gedacht, jetzt wo apple vorne diese komischen kameras drauf hat, jetzt machen wir das auch oder wie, dabei war das bei apple schon ne ziemlich beschissene idee, dass das ding jetzt ohne hülle nicht mehr flach auf dem tisch liegt, hypercharge ich kauf mir nix von ebay klein anzeigen, mal ganz davon abgesehen ebay klein anzeigen hat mich ja sogar gebannt, ich kann doch nicht mal was drauf kaufen, sie haben mich gebannt obwohl ich nicht mal einen account hatte, ist auch geil oder, can't wait, tja, na gut, warum haben die hier eigentlich so nen dickshot gemacht, von dem typ, dass man hier so richtig schön den schritt gefilmt hat, warum, so und das ist schon ganz schön teuer, 13 pro, ah das ist, wow, general überholt und dann fast so teuer wie das 14er, nee das ist nix oder, das ist doch nix, ach guck mal ist doch neu, nee das sind warehouse deals, ach das sind auch warehouse deals, das ist used, das ist auch used, aha, ok, keine ahnung, kauf mir den iphone 13, bei aliexpress jetzt, wimpern, verlängerung, zubehör, alles klar dann haben die bestimmt auch iphone 13 pro, easy, kein case, auch nicht iphone, alter das kostet in china einfach 2000 euro, aber immerhin 5 euro rabatt, möb, dankeschön für den sub, hattet statt zu gucken, also ich hab wieder hier die hälfte übersehen, möb, danke für den sub, seriousmax auch, an dich danke, eclipse, nee, eclipsi oder so, ähnlich, ich hoffe ich spreche das richtig aus, dankeschön für den sub, gestern gestern gut, da haben gar nicht so viel übersehen, ich wusste nicht ob ihr es wisst, ja aber ich erwähne das mal, weil ich mache zu wenig sellout, falls ihr amazon prime habt und euch das noch nicht klar ist, wusste ihr dass ihr mit amazon prime einen streamer eurer wahl einmal im monat kostenlos mit einem prime sub unterstützen könnt, nicht dass der noch verfällt, das wollen wir ja nicht, any primers, genau, any primers, wahrscheinlich, wahrscheinlich hol ich mir wirklich wieder ein iphone, nice leute, hacky, dankeschön für den sub, 3 10 monat am start, juicybit zum ersten mal, pog, dankeschön, nice, pausierungschamp, wollen wir noch das fireship video gucken, Leute, devil's argent 11 und der rezo boy auch am start, schön dass ihr da seid, danke für den sub, hi iq subscription, chat iq steigt wieder ins unermessliche, wisst ihr jeder sub einmal iq++ für den chat, das scam train fasst schon auf level 2, hast du geguckt ob du public ip kriegst, das komische ist dass er mir in der box aber trotzdem ein externer ip anzeigt, kannst du die externe ip pingen, klingt jetzt doof, müsste gehen weil es lokal auf der fritzbox ist, aber man weiß ja nie ob es auch wirklich noch drauf ist, überall auf dem interface, oder dass es nur das mist anzeigt, wobei ich weiß nicht, blockt das nicht die fritzbox, egal von wo das kommt wenn man die externe ip pingt, zeigt nur die fritzbox auch, na gut der nächste, deswegen ist halt race route kacke, der nächste router könnte durchaus einfach lcmp zeug blocken, aber ist egal, ich vermute mal es liegt an der telekom, hast du irgendwas gemacht in letzter zeit mit der fritzbox, wahrscheinlich nicht, die ging gestern und heute ist die kaputt oder, das sieht mir sehr nach telekom probleme aus ehrlich gesagt, wenn die einwahl geht und du ne public ip kriegst, so komm wir gucken jetzt noch, ping auf die ex, also ich würde fast vermuten es liegt davor, die einwahl geht und es geht ab quasi, ab dem ersten hopp von der telekom nicht richtig weiter, vielleicht oder auch ab dem zweiten, also man weiß es ja nicht genau, also ich vermute das liegt an der telekom, du könntest mal gucken, obbei ne bringt ja nichts, hätten wir bei race route wahrscheinlich schon gesehen, ich denke es liegt an der telekom, ja das wird an der telekom liegen, die haben probleme wahrscheinlich, wahrscheinlich ist dann dein erster provider hopp router abgekackt oder was auch immer oder irgendwas lokal, wandermaus, danke schon für den sub, also ich würde mich bei der telekom wenden, ich glaube nicht das es an dir liegt, ok wollen wir noch das fireship video gucken, aber noch fireship, how to improve react performance, wo kostüm, was könnte ich denn, was könnte ich denn gut, als was könnte ich mich denn gut verkleiden, verkleiden, ist pepo fat gruselig genug, da ziehe ich mir einfach ein grünes t-shirt, blaues t-shirt an, doch wir sind fertig patrick, wir sind fertig, wie wäre es wenn ich als guter stehe, da müsste ich mich aber ganz schön roleplayen für oder, bist du überhaupt noch pepo fat genug, naja ich habe mein ziel mit unter 90 bis ende des jahres noch nicht erreicht, ich meine ich habe angefangen bei 108,5 und ich bin jetzt relativ lange schon so bei 92 oder 91,8 oder 92,2, das schwankt, ok wir gucken jetzt noch mal das fireship video, was war denn, ok fireship erzähl uns was, immer tons of money ist nie verkehrt, hast du schon mal, wie es, das ist dieser, ja ich habe sogar, ob das habe ich so, nee habe ich nicht, habe ich nicht, weil die microsoft c++ extensions nur fürs offizielle wishlist studio code funktionieren, also ich habe das schon probiert ja aber ich verwende es nicht, weil das c++ plugin irgendwelche proprietären microsoft shit enthält, das nur mit dem offiziellen wishlist studio code geht, loop guard, ach nee, nee, loot, loot guard, eigentlich schon für den zapp, iacu subscription, gehen wir mal weiter, ich habe so keinen plan vom react ökosystem, es rauscht so, gehen wir mal weiter, is that genius, ok, here to feel inspired by features bride and remix like nest that is about to hear told tonight about you, you feel inspired by those features and elsewhere, interesting though is that less than a year ago, shopify came out with mit ihrem eigenen React-Framework, Hydrogen. So wie in Next 13, Hydrogen nutzt React-Server-Komponenten, das ist die offizielle Lösung des React-Teames für Server-Side-Rendering. Wie viele... Ich frage mal gar nicht, wie viele JavaScript-Frameworks gibt es eigentlich, weil das nähert sich der Unendlichkeit. Aber allein schon im ganzen React-Ökosystem, wie viele gibt's da mittlerweile eigentlich? Da blickt doch keiner mehr durch. Next.js, 13 soll ja auch 700 mal schneller sein als Webpack. Ja, nicht Next.js 13, oder? Sondern Mono-Build oder Mono-Pack, oder wie dieser Kram hieß. Shopee! Endlich mal einer, der ein gutes Web-Framework verwendet. Ruby on Rails ist POG. Ich mein, ich würd's jetzt nicht mal verwenden, aber ich mag Ruby on Rails. GitLab ist Ruby on Rails, das weiß ich. Chat sagt, er wird nie wieder... äh, nicht Chat. Extreme aus dem Chat sagt, er wird nie wieder JavaScript anfassen, sondern nur noch WebAssembly. Ja, das Problem ist, ganz ohne JavaScript geht's halt trotzdem nicht, ne? Wie willst du aus WebAssembly beispielsweise irgendwelche Webseiten-Anpassungen machen? Way too dank, Leute. Mikrofon knackt nicht mehr als fuck ab. Was macht's denn jetzt schon wieder? Was ist denn jetzt? Hat sich doch überhaupt nichts geändert, oder? Ich hab ne Idee. Ich schließ mal morgen das Mikrofon an das andere Audio-Interface an. Und dann gucken wir mal. Müssen wir dann mal schauen, ob das... Naja, werden wir dann mal schauen, ob das gescheit funktioniert. Ja. Ja. Ja. Ja. Ja. Ja. Ja, werden wir dann mal schauen, ob das gescheit funktioniert. Ich mein... Sounds... Ach, ich hab' das gar nicht mehr angeschlossen, dull. Hin und wieder Störgeräusche, okay. Vielleicht, das ist aber auch Einfach nur twitch heute abend weil ich habe doch normalerweise nie probleme Vielleicht das ist aber auch einfach nur twitch heute abend weil ich habe doch Hört sich auch nach nix an Vielleicht muss ich mal meinen Streaming game absteppen hier Wackelkontakt, ja vielleicht Ich könnte hier mal ein bisschen ein bisschen dran wackeln oder so aber Ja, ich habe keine Ahnung Keine Ahnung Müssen wir mal gucken also ich update gerade keine Sinnvolle Erklärung für Hast du schon mit roher Gewalt gesehen was soll ich denn wo soll ich draufhauen Was in der Nähe ist so ok ich muss mir das jetzt mal kurz noch mal anschauen Anschauen anhören ist denn ist das nicht in der Aufnahme gerade drinne ok ich muss mir das jetzt mal kurz Also ich ich höre dann nichts Ist das so bla bla bla bla test test bla bla bla bla bla bla bla test test bla bla bla bla bla bla test test bla bla bla bla bla bla test test Keine Ahnung gibt es ein neues Heartbleed Bei dem ich höre da nichts war es sehr schön zu hören Also ich könnte das mal als andere audio interface anschließen aber dann muss ich gucken wie ich einen Rechner kriege von da Störgeräusche ok ok jetzt können wir hier Ist das nicht in der Aufnahme gerade drinne ok ich muss mir das jetzt mal kurz nochmal Da hatten wir es doch doch Tatsächlich das hat ein bisschen aussetzer Ist das irgendwie mein Noisegate oder sowas rumspackt Man weiß ja nie Die Lautstärke richtig so test test test test test test den jetzt müsste eigentlich gehen Keine Ahnung Am ende noch mehr Also ich ich höre da nichts Was Ich höre da nichts Also ich höre da nichts Also ich höre da nichts Also ich höre da nichts Also ich höre da nichts Also ich ich höre da nichts Also ich ich höre da nichts Wow Also ich ich höre da nichts Also ich ich höre da nichts Also ich ich höre da nichts Ok da ist irgendwo irgendwas kaputt bei mir Und das liegt das liegt nicht an meinen Twitch Settings Und das liegt auch nicht an meinen OBS Filtern ich meine da hat sich ja nichts getan seit gestern Ich speicher mir das mal Es muss ich ja es muss ja irgendwas sein ja vielleicht bin ich ein paar Mal zu viel übers Kabel gerollt oder so Kein Plan Kein Plan weil normalerweise gibt es ja keine Probleme Da war es auch wieder ordentlich Ich lasse mal kurz mitlaufen sagt sagt mir wenn es wieder gewesen ist Dann gucke ich nämlich dann gucke ich nämlich hier mal in der Audacity Aufnahme ob das ob das damit was zu tun hat Ja Schauen wir mal ist natürlich ist natürlich jetzt blöd das Wenn wir das jetzt irgendwie live live on stream debuggen müssen Dabei haben wir eigentlich gar nicht mehr großartig wie gesagt ich weiß ja nicht was ich heute noch machen soll wir sind wir sind ja eigentlich fertig damit Jetzt pass auf jetzt jetzt habe ich das hier laufen und jetzt kommt wahrscheinlich nichts Das geht jetzt schon naja mal gucken es gibt eigentlich nichts mehr was wir machen können Einzige was mir einfällt ich könnte man das audio interface tatsächlich mal raus Döpseln und wieder rein stöpseln ob das was bringt Ah Also ich mein wenn es die Aufnahme jetzt hier nebenbei fixt was ja eigentlich nicht sein kann Also am bewegen liegt es nicht leute ich ich wackele jetzt hier hin und her und es ist überhaupt gar kein Problem Also ich bewege jetzt ja alles kabel und sonst wie das ist wahrscheinlich sogar Einen Winners ding oder tatsächlich in den wackelkontakt irgendwas an anderer stelle Also gute gute frage ich werde das audio interface mal rein raus machen und mal windows neu starten das hilft ja das wirkt ja das wirkt ja wunder oftmals windows neu starten Im clip hast du dazu auch was im browser parallel gemacht okay jetzt reloaden wir einfach mal wir reloaden jetzt ganz wild irgendwie Ob das damit was zu tun hat ich mein man weiß ja man weiß ja hier nie Wait a minute wenn ich den browser reloade ich meine man weiß ja man weiß ja hier nie Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat What the fuck Wenn meine cpu was macht das ist irgendein windows shit oder Das einzige was ich gemacht habe die letzten tage ist ich habe modern warfare installiert Ist es der modern warfare anti cheat oder was Kekkel Aha Safe Aha safe Klar habe ich mw2 beendet okay mal gucken ob wir das nachvollziehen können Ich ich reload jetzt noch mal ganz die ganze zeit hier meinen browser Irgendwelche sachen reloaden bis bis in cpu na gut ich mein cpu last können wir auch antarbeit ich leute Cpu last können wir auch antarbeit ich generieren Wobei dafür brauche ich noch nicht mal hier cpu last können wir antarbeit ich generieren echo 2 hoch 1 2 3 4 nach bc Ach nee bc haben wir nicht Wie erzeugt man denn auf windows last Irgendjemand eine schlaue idee War das ist das jetzt wieder beim windows beim beim wenn ich den browser reloade Macht es dann wieder dinger Anhören ist das Oder jetzt nicht mehr Es war wieder leicht Ok ok ok ok ok Und jetzt jetzt macht er richtig jetzt macht er richtig fett jetzt macht er richtig fett ich auch Gerade und ein bisschen cpu last wenn die vm gestartet wird Das juckt das juckt jetzt ja Ja interessant interessant ok Waren wir mal waren wir mal cpu last So jetzt haben wir cpu last So, jetzt haben wir CPU-Last, guckt hier, ist es jetzt am abkacken, test, test, test, test, test, test, nope, nix, also CPU-Last allein ist es schonmal nicht, ok, CPU-Last alleine ist es nicht, so, weil wir haben jetzt, wir haben jetzt ganz schön die CPU-Last, also mehr macht es der Browser, ist es Disk, ist es Disk IO, vielleicht, äh, irgendwas aus den Ideen oder so, mal, wie viel Platz haben wir hier noch, ah, haben wir noch genug, def zero, äh, oder machen wir so hier, keckel.bin, aber ich muss Disk IO auf C wahrscheinlich machen, macht das irgendwas, ne, oder, alles gut, also ich mein jetzt ist der Rechner, der Rechner ist jetzt ordentlich ausgelastet, ok, das interessiert den nicht, ok, ok, Disk IO auf C müssen wir machen, Disk IO auf C, wie mach ich denn, wie macht man, wie macht man Disk IO unter Windows, Dateien kopieren, oder, Dateien kopieren, haben wir hier irgendwas größeres, was ich kopieren kann, details, ne, Desktop, size, viele kleine Dateien, viele kleine Dateien, wo hab ich viele kleine Dateien, hier, komm, mal jetzt einfach mal nen Ordner, der sich KekWaite nennt, ah, CPU-Auslastung lassen wir, macht das irgendwas, hat das irgendwelche Auswirkungen gehabt, ok, KekWaite wird wieder gelöscht, Chrome, Chrome hat viele Files, das können wir kopieren, Chrome, Chromium kopieren wir, ich glaub ich hab kein, ich glaub ich hab kein Node Modules hier drauf, aber das, was, wait a minute, ist das vielleicht das Problem, dass meine Festplatte voll ist, ne, die ist 18 Gigabyte, das reicht dafür bloß nicht, na geil, ne, ne, 18, 18G müssen noch reichen, ich will meinen Rechner nicht statten, hier sind viele kleine Files drin, ok, copy, da, excellent, beste, so wie schaut es jetzt aus, so wie schaut es jetzt aus, juckt es überhaupt nicht, Leute wisst ihr was, ich glaub ich werd mal neu starten und wir gucken ob das morgen immer noch da ist, das ist dem hier egal, es ist aber schon ganz schön langsam, obwohl es ne SSD, also ich mein das ist ne NVMe SSD, der sollte auch kleine Dateien ein bisschen schneller kopieren, obbei es ist immer, es ist Windows Zeug, wer weiß, wer weiß, ey Leute ich sag euch ohne Scheiß, das ist der Modern Warfare Anti-Cheat, ich hab das zum ersten mal gestartet nach dem Stream am Sonntag, und da war doch noch nix oder, am Sonntag war noch nix, also ich mein das ist ja irgendein Rootkit Anti-Cheat oder sowas, ja ich hab ja auch nicht im Browser rumgeklickt, ah im Browser, im Browser rumklicken ist anscheinend gefährlich hier, guckt hier, Browser rumklicken machts kaputt, Windows Update, neues Soundtreiber, Quatsch was, was soll denn da passiert sein in der Zwischenzeit, ich hab da nix geupdatet, ich mach mal kurz das Audio Interface rein und raus, man weiß ja, man weiß ja nicht, doch vielleicht was ist, so jetzt, oh war das überhaupt das Audio Interface, Sekunde, was hab ich hier gerade rein rausgezogen, ah das war gar nicht das Audio Interface, das ist das Audio Interface hier, drin, ok, ja daran wirds nicht gelegen haben, also ok, keine Ahnung, ich weiß es nicht, schauen wir mal, es ist zumindest, es ist zumindest schonmal hier in der Aufnahme drin, was dafür spricht, es ist zumindest schonmal, das ist irgendwas Windows technisches oder Aufnahme technisches ist, wer weiß, keine Ahnung, schauen wir mal wie es morgen ist, ich werde, wenn es gar nichts hilft, ich werde einfach Modern Warfare 2 wieder deinstallieren, fertig, Leute wir sehen uns, ich geh jetzt auf, weiß eh nicht was ich heute noch machen soll, wir haben ja das geschafft, was wir schaffen wollten, morgen nix, das Stream mal gucken, vielleicht, ja, Leute wir sehen uns bis denn, machts gut, CU.", "segments": [{"id": 1, "start": 90.0, "end": 98.4, "text": "So, da bin ich."}, {"id": 2, "start": 98.4, "end": 103.56, "text": "Heute müssen wir endlich die Skillliste fertig machen, dass ich die in den nächsten paar"}, {"id": 3, "start": 103.56, "end": 104.56, "text": "Tagen schicken kann."}, {"id": 4, "start": 104.56, "end": 108.32, "text": "Lebenslauf habe ich mir heute schon mehr oder weniger außen den Fingern gesaugt, da muss"}, {"id": 5, "start": 108.32, "end": 114.32, "text": "ich bloß jetzt nochmal die ganzen Termine gucken, ob das auch alles so stimmt, wie ich"}, {"id": 6, "start": 114.32, "end": 117.32, "text": "es in Erinnerung habe."}, {"id": 7, "start": 117.32, "end": 130.2, "text": "Ich brauche wieder High-IQ-Ideen von euch, was ich da reinschreiben kann."}, {"id": 8, "start": 130.2, "end": 133.56, "text": "Ihr wisst besser als ich, was ich alles schon gemacht habe, gerade im Stream."}, {"id": 9, "start": 133.56, "end": 146.16, "text": "Ups, warum habe ich jetzt Stadia aufgemacht?"}, {"id": 10, "start": 146.16, "end": 154.28, "text": "Musik kann sich wieder nicht entscheiden, ob es laut oder leise sein will."}, {"id": 11, "start": 154.28, "end": 173.04, "text": "Ah, so geht das."}, {"id": 12, "start": 173.04, "end": 174.04, "text": "Hier gibt es Skills."}, {"id": 13, "start": 174.04, "end": 176.24, "text": "Ja, hast du schon was mit CICD?"}, {"id": 14, "start": 176.24, "end": 177.24, "text": "Ich glaube schon."}, {"id": 15, "start": 177.24, "end": 179.24, "text": "Wartet mal, ich mache das mal kurz auf."}, {"id": 16, "start": 179.24, "end": 180.24, "text": "Skills."}, {"id": 17, "start": 180.24, "end": 186.92, "text": "Ja, also es ist alles sehr unorganisiert noch."}, {"id": 18, "start": 186.92, "end": 192.16, "text": "Oh, Chain Law, seit heute oder was?"}, {"id": 19, "start": 192.16, "end": 195.16, "text": "Zedge."}, {"id": 20, "start": 195.16, "end": 217.32, "text": "Was hältst du vom Studiengang Wirtschaftsinformatik?"}, {"id": 21, "start": 217.32, "end": 221.8, "text": "Naja, warum nicht?"}, {"id": 22, "start": 221.8, "end": 224.0, "text": "Also, was halte ich davon?"}, {"id": 23, "start": 224.0, "end": 226.76, "text": "Kann man machen."}, {"id": 24, "start": 226.76, "end": 231.2, "text": "Man weiß jetzt nicht, was ich groß dazu sagen soll, ehrlich gesagt."}, {"id": 25, "start": 231.2, "end": 239.2, "text": "Die meisten Leute, die ich kenne, die Wirtschaftsinformatik studiert haben, haben das hauptsächlich"}, {"id": 26, "start": 239.2, "end": 244.0, "text": "deswegen studiert, weil sie keinen Bock hatten auf das volle Mathe-Programm vom normalen"}, {"id": 27, "start": 244.0, "end": 247.88, "text": "Informatikstudium und nicht so sehr, weil sie Wirtschaft so geil fanden."}, {"id": 28, "start": 247.88, "end": 251.28, "text": "Ich weiß ja nicht, wie es bei dir aussieht."}, {"id": 29, "start": 251.28, "end": 254.92, "text": "Warum du das studieren willst?"}, {"id": 30, "start": 254.92, "end": 256.04, "text": "Warum willst du es denn studieren?"}, {"id": 31, "start": 256.04, "end": 270.92, "text": "Leute, was meint ihr?"}, {"id": 32, "start": 270.92, "end": 286.56, "text": "Neuer Rechner, CPU, 7950 AMD oder 13900K Intel?"}, {"id": 33, "start": 286.56, "end": 288.68, "text": "Leistungstechnisch müsste es eigentlich Intel sein."}, {"id": 34, "start": 288.68, "end": 297.44, "text": "Aber Intel hat, glaube ich, auch echt krassen, zumindest in der Spitze krassen Stromverbrauch."}, {"id": 35, "start": 297.44, "end": 303.24, "text": "Wolltest du nicht dein Skill-Sheet weiterwarnen?"}, {"id": 36, "start": 303.24, "end": 304.24, "text": "Doch."}, {"id": 37, "start": 304.24, "end": 305.24, "text": "Doch, doch."}, {"id": 38, "start": 305.24, "end": 306.24, "text": "Waren wir heute fertig."}, {"id": 39, "start": 306.24, "end": 307.24, "text": "Bisschen Markdown."}, {"id": 40, "start": 307.24, "end": 310.24, "text": "Komm, wir machen mal Markdown-Überschrift hier."}, {"id": 41, "start": 310.24, "end": 321.96, "text": "Skillorts, alles klar, ja, das schreibe ich da so drüber."}, {"id": 42, "start": 321.96, "end": 336.76, "text": "13900, ja, ich tendiere auch dazu, tendiere da auch dazu."}, {"id": 43, "start": 336.76, "end": 349.12, "text": "Chatting, ich habe ein neues Emote geadded, Leute, ich glaube, das haben wir schon eine"}, {"id": 44, "start": 349.12, "end": 350.12, "text": "Weile drinnen."}, {"id": 45, "start": 350.12, "end": 353.92, "text": "Oh, Moment, wo sind die Emotes hin?"}, {"id": 46, "start": 353.92, "end": 354.92, "text": "FFZ?"}, {"id": 47, "start": 354.92, "end": 355.92, "text": "FFZ kaputt?"}, {"id": 48, "start": 355.92, "end": 356.92, "text": "Oder was?"}, {"id": 49, "start": 356.92, "end": 357.92, "text": "Was ist hier los?"}, {"id": 50, "start": 357.92, "end": 358.92, "text": "Leute, FFZ ist broken."}, {"id": 51, "start": 358.92, "end": 363.36, "text": "Hat sich FFZ neu installiert oder was?"}, {"id": 52, "start": 363.36, "end": 373.16, "text": "Ich blick da mittlerweile nicht mehr durch."}, {"id": 53, "start": 373.16, "end": 375.84, "text": "Dark Mode will ich haben."}, {"id": 54, "start": 375.84, "end": 381.12, "text": "Gibt es das nicht mehr?"}, {"id": 55, "start": 381.12, "end": 382.12, "text": "Plugin?"}, {"id": 56, "start": 382.12, "end": 388.0, "text": "Wo gibt es denn hier die Plugins noch mal drinnen?"}, {"id": 57, "start": 388.0, "end": 392.36, "text": "Wo ist denn da Kram?"}, {"id": 58, "start": 392.36, "end": 395.36, "text": "Control Center?"}, {"id": 59, "start": 395.36, "end": 406.72, "text": "Ach, erinnert uns, hier."}, {"id": 60, "start": 406.72, "end": 416.0, "text": "Ja gut, das bringt nix, weil..."}, {"id": 61, "start": 416.0, "end": 417.8, "text": "Emotes?"}, {"id": 62, "start": 417.8, "end": 423.32, "text": "Hat sich das irgendwie resetten oder was?"}, {"id": 63, "start": 423.32, "end": 425.52, "text": "Was ist denn das hier schon wieder?"}, {"id": 64, "start": 425.52, "end": 433.56, "text": "Ich glaube, jetzt geht es wieder, oder?"}, {"id": 65, "start": 433.56, "end": 437.56, "text": "Was auch immer, der für Schmerzen hat."}, {"id": 66, "start": 437.56, "end": 446.28, "text": "Ja, und ich weiß auch nicht, warum das hier nicht im Dark Mode ist, aber okay, man."}, {"id": 67, "start": 446.28, "end": 447.28, "text": "Vielleicht ist es..."}, {"id": 68, "start": 447.28, "end": 450.48, "text": "Hatte ich nicht eigentlich auch Timestamps?"}, {"id": 69, "start": 450.48, "end": 456.92, "text": "Nee, hier hatte ich keine Timestamps, die hatte ich nur bei mir auf dem anderen Bildschirm."}, {"id": 70, "start": 456.92, "end": 463.6, "text": "A Kriege."}, {"id": 71, "start": 463.6, "end": 470.6, "text": "Du hast letzte Woche deinen bisherigen Arbeitgeber gequittet."}, {"id": 72, "start": 470.6, "end": 475.08, "text": "Was waren deine Gründe, warum du keinen Bock mehr hattest?"}, {"id": 73, "start": 475.08, "end": 488.96, "text": "Warte, ich hatte Timestamps, okay."}, {"id": 74, "start": 488.96, "end": 496.2, "text": "Weiß nicht, warum sich das resetten hat."}, {"id": 75, "start": 496.2, "end": 501.08, "text": "Trennilien, ja, das hatten wir auch, oder?"}, {"id": 76, "start": 501.08, "end": 506.88, "text": "Hatte ich das nicht auch, hatte ich nicht auch unterschiedliche?"}, {"id": 77, "start": 506.88, "end": 511.64, "text": "Ich kann doch einfach gucken, wie mein Chat letzten Stream ausgeschaut hat."}, {"id": 78, "start": 511.64, "end": 517.72, "text": "Was hast du noch nicht mitbekommen?"}, {"id": 79, "start": 517.72, "end": 524.96, "text": "Naja, das ist schon so gemein, wie es im Titel steht."}, {"id": 80, "start": 524.96, "end": 531.28, "text": "Also wenn sich bei uns nicht großartig was ändert, bin ich Ende des Jahres weg."}, {"id": 81, "start": 531.28, "end": 536.48, "text": "So, zeige ich mal her, wie sah das letzte Stream aus?"}, {"id": 82, "start": 536.48, "end": 537.48, "text": "Gestern."}, {"id": 83, "start": 537.48, "end": 542.48, "text": "Hier, so sah der Chat gestern noch aus, okay."}, {"id": 84, "start": 542.48, "end": 546.84, "text": "Okay, nur Timestamps hatte ich noch, alles klar."}, {"id": 85, "start": 546.84, "end": 550.72, "text": "Ja, anscheinend."}, {"id": 86, "start": 550.72, "end": 561.12, "text": "Du warst eine Ein-Mann-IT-Abteilung, sozusagen."}, {"id": 87, "start": 561.12, "end": 576.0, "text": "Naja, du kannst es ja auch nicht groß mitbekommen, ich erzähle das ja nicht wahnsinnig, ich zähle"}, {"id": 88, "start": 576.0, "end": 577.0, "text": "das ja nicht großartig rum."}, {"id": 89, "start": 577.0, "end": 584.16, "text": "Also ich habe gerade ein Angebot, was ich echt nicht schlecht finde, das werde ich mir"}, {"id": 90, "start": 584.16, "end": 588.36, "text": "jetzt mal ein bisschen näher angucken, und wenn man sich da einig wird, was Teilzeit"}, {"id": 91, "start": 588.36, "end": 595.52, "text": "angeht und was Gehalt angeht, ich meine, das ist quasi 99% Remote, es gibt irgendwie"}, {"id": 92, "start": 595.52, "end": 598.2, "text": "zwei Events im Jahr, wo man hin muss, ja, soll mir recht sein."}, {"id": 93, "start": 598.2, "end": 606.44, "text": "Aber das in Kombination ist mir einfach viel lieber als unser Boomer-Management, was von"}, {"id": 94, "start": 606.44, "end": 607.44, "text": "Homeoffice nichts hält."}, {"id": 95, "start": 607.44, "end": 621.8, "text": "Kommt zu uns, nee, ihr wart die.NET-Entwickler, nee, da hatte ich keinen Bock drauf, ich so"}, {"id": 96, "start": 621.8, "end": 625.4, "text": "sehr ich sie scharf mag, hauptberuflicher.NET-Entwickler, habe ich keinen Bock."}, {"id": 97, "start": 625.4, "end": 635.64, "text": "Wenn du weg bist, ist Platz für drei Consultants, nee, das ist ja gerade das Problem, kosten"}, {"id": 98, "start": 635.64, "end": 636.64, "text": "ja mehr Geld."}, {"id": 99, "start": 636.64, "end": 642.76, "text": "So sieht es aus, sehe ich genauso, das muss drin stehen."}, {"id": 100, "start": 642.76, "end": 648.04, "text": "Wie gesagt, gegen eins, zwei, drei Sachen mal Events im Jahr, soll mir recht sein, ja,"}, {"id": 101, "start": 648.04, "end": 649.28, "text": "so weit weg ist es auch nicht."}, {"id": 102, "start": 649.28, "end": 662.64, "text": "Aber gerade nach dem Laden, wo ich jetzt bin, die sich ja auch so sehr davor drücken mit"}, {"id": 103, "start": 662.64, "end": 673.48, "text": "Homeoffice, ich will das auf jeden Fall vertraglich geregelt haben, ja, ja, ja, ist halt bei uns"}, {"id": 104, "start": 673.48, "end": 674.48, "text": "so."}, {"id": 105, "start": 674.48, "end": 678.48, "text": "Gut, ich weiß ja nicht, wie es bei dir ausschaut, ist ein bisschen was anderes, aber trotzdem,"}, {"id": 106, "start": 678.48, "end": 686.28, "text": "die sind irgendwie nicht so ganz, was ich dann bin, tja, ich weiß nur, dass ich dann endlich"}, {"id": 107, "start": 686.28, "end": 693.68, "text": "Senior im Titel hab, ich hab's, ich weiß es gar nicht genau, wie die Stelle jetzt konkret"}, {"id": 108, "start": 693.68, "end": 698.68, "text": "hieß, weil ich bewerbe mich nicht explizit auf was, was jetzt, was schon ausgeschrieben"}, {"id": 109, "start": 698.68, "end": 708.8, "text": "ist, Ex-Kollege hat mich angerufen, letztens hat gemeint, Max willst nicht bei uns anfangen,"}, {"id": 110, "start": 708.8, "end": 713.44, "text": "aber ich hab, er hat mir auch gesagt, wie es genau heißt, ich weiß nur noch, dass Senior"}, {"id": 111, "start": 713.44, "end": 719.32, "text": "im Titel ist, nicht, dass ich da großartig drauf Wert legen würde, aber ich mein, hey,"}, {"id": 112, "start": 719.32, "end": 724.76, "text": "ich mach den Kram jetzt quasi 15 Jahre lang, da kann man, kann man auch Senior im Titel"}, {"id": 113, "start": 724.76, "end": 726.84, "text": "haben und alt genug, dafür bin ich ja mittlerweile auch."}, {"id": 114, "start": 726.84, "end": 743.92, "text": "Unsere Consultants haben mich heute schon wieder wahnsinnig gemacht, ich hab ja heute nur E-Mails"}, {"id": 115, "start": 743.92, "end": 744.92, "text": "gelesen."}, {"id": 116, "start": 744.92, "end": 752.68, "text": "Daily Scrum, Leute, 20 Uhr steht Daily Scrum an, jeder eine Minute, was er heute vor hat"}, {"id": 117, "start": 752.68, "end": 772.04, "text": "zu machen, was wollte ich jetzt sagen, man könnte das langsam in Senior in Boomer ändern,"}, {"id": 118, "start": 772.04, "end": 775.28, "text": "denn das müssten aber die an der Position entscheiden, die es betrifft, das werden sie"}, {"id": 119, "start": 775.28, "end": 784.96, "text": "nicht machen, heute hat mir einer auf Twitter geschrieben, dass in meinem Bild Chemtrails"}, {"id": 120, "start": 784.96, "end": 793.44, "text": "oder Chemtrails zu sehen waren, guck mal, ich hoffe ja, ich hoffe ja ein bisschen hier,"}, {"id": 121, "start": 793.44, "end": 801.44, "text": "ich hoffe ja ein bisschen ertreut nur, guck mal, hab ich heute gepostet, da meinte einer,"}, {"id": 122, "start": 801.44, "end": 813.76, "text": "da meinte einer jetzt in den Kommentaren drauf, hier siehst du Chemtrails, warte mal, irgendwo"}, {"id": 123, "start": 813.76, "end": 821.96, "text": "hier, schön zu sehen, dass es auch dort schon verteilt wird, Chemtrails und danach kam noch"}, {"id": 124, "start": 821.96, "end": 830.44, "text": "eine Antwort an, ich glaube er meint es halt irgendwie ernst, ich hoffe ja, ich hoffe ja,"}, {"id": 125, "start": 830.44, "end": 837.8, "text": "dass es getrollt ist, ja, dachte Chemtrails und so ist es komplett outdated Verschwörungstheorie,"}, {"id": 126, "start": 837.8, "end": 844.68, "text": "das nutzt keiner mehr, ich dachte es ist so ein bisschen was wie Hohlerde, Hohlerde ist"}, {"id": 127, "start": 844.68, "end": 850.6, "text": "auch total out, flache Erde, flache Erde ist schon angesagt aktuell, was Verschwörung"}, {"id": 128, "start": 850.6, "end": 859.08, "text": "angeht, aber Hohlerde ist nicht mehr so das, und ich weiß auch nicht, wie es mit den Nazis"}, {"id": 129, "start": 859.08, "end": 865.32, "text": "auf der Rückseite des Mondes und so aussieht, das ist auch nicht mehr so angesagt an Verschwörungstheorie"}, {"id": 130, "start": 865.32, "end": 878.24, "text": "glaube ich, ich hab letztens wieder ein Video geguckt, ich guck ja manchmal solche Flat"}, {"id": 131, "start": 878.24, "end": 885.12, "text": "Earth Fail Compilations und sowas, da hat letztens wieder einer erzählt, die Dark Side"}, {"id": 132, "start": 885.12, "end": 892.4, "text": "of the Moon, also die uns abgewandte Mondseite, da wäre es ja immer dunkel, hab ich mir auch"}, {"id": 133, "start": 892.4, "end": 898.4, "text": "gedacht, was erzählt der Typ, da ist nicht immer dunkel, da scheint auch die Sonne drauf,"}, {"id": 134, "start": 898.4, "end": 905.36, "text": "manchmal, wir sehen es bloß nicht, ja die haben sogar schon glaube ich vor 40 Jahren"}, {"id": 135, "start": 905.36, "end": 911.44, "text": "oder so mal da ne Sonde hingeschrieben, ne nicht Dark Side, das war es Far Side, ja"}, {"id": 136, "start": 911.44, "end": 916.04, "text": "haben es zumindest nicht, Dark Side hab ich jetzt zusammen gewurschtelt, aber da wär es"}, {"id": 137, "start": 916.04, "end": 931.32, "text": "ergeblich immer dunkel, im Schwachsinn da ist es nicht immer dunkel, also, hat er Blutssinn,"}, {"id": 138, "start": 931.32, "end": 958.92, "text": "ja, alles Fake, ja und nachts ist es kälter als draußen, das wissen wir ja alle, ach"}, {"id": 139, "start": 958.92, "end": 964.36, "text": "Dark Side hieß der Transformers Ding, jaja, zumindest haben sie erzählt, dass es dort"}, {"id": 140, "start": 964.36, "end": 970.24, "text": "ja angeblich immer dunkel wäre und niemand weiß was dort passiert und naja, wenn man"}, {"id": 141, "start": 970.24, "end": 986.2, "text": "sich Sondenaufnahmen oder Probenaufnahmen anguckt, da ist halt gar nix, tja, so, so"}, {"id": 142, "start": 986.2, "end": 997.68, "text": "sollen wir mal, sollen wir mal anfangen, Monkees, Zeit, ansonsten schwätze ich wieder"}, {"id": 143, "start": 997.68, "end": 1002.56, "text": "zwei Stunden mit euch und dann gehe ich off, so, hier sind wir stehen geblieben das letzte"}, {"id": 144, "start": 1002.56, "end": 1014.68, "text": "Mal, ungeordnet, random Zeug, was äh dem Chet und mir so eingefallen ist, wir müssen"}, {"id": 145, "start": 1014.68, "end": 1019.44, "text": "das noch ein bisschen ordnen, ich weiß nicht ob ich da wirklich alles reinschreiben soll,"}, {"id": 146, "start": 1019.44, "end": 1031.12, "text": "weil es schon ganz schön, ganz schön viel, ganz schön viel Kram, ja, Knacken im Mikro"}, {"id": 147, "start": 1031.12, "end": 1035.08, "text": "nur bei mir, du, du hast doch letztes Mal, du hast doch letztes Mal schon was vom Knacken"}, {"id": 148, "start": 1035.08, "end": 1042.8, "text": "im Mikrofon erzählt, Mikrofon Knacktest, was ist Knackt bei dir auch?"}, {"id": 149, "start": 1042.8, "end": 1056.92, "text": "Wait a minute, Mikrofon Knacktest, was ist Knackt bei dir auch?"}, {"id": 150, "start": 1056.92, "end": 1071.04, "text": "Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment, Moment,"}, {"id": 151, "start": 1071.04, "end": 1082.24, "text": "Moment, vorhin hat es geknackt, vielleicht so, weil ich hier ans Mikrofon gekommen bin,"}, {"id": 152, "start": 1082.24, "end": 1089.52, "text": "oder wenn ich mit dem Bart irgendwie ans Mikrofon komme oder so, ja, sagt mir mal wenn es wieder"}, {"id": 153, "start": 1089.52, "end": 1095.52, "text": "geknackt hat, sagt mir mal wenn es wieder geknackt hat, dann gucken wir, schauen wir"}, {"id": 154, "start": 1095.52, "end": 1110.0, "text": "mal, ja, jetzt, jetzt habe ich zum Beispiel das Mikrofon gerade bewegt, hat man das gehört?"}, {"id": 155, "start": 1110.0, "end": 1117.0, "text": "So, hört man das wenn ich das so bewege?"}, {"id": 156, "start": 1117.0, "end": 1129.48, "text": "Ne, eigentlich nicht, ja, ja, das wird es wahrscheinlich gewesen sein, Knacken mit leichten"}, {"id": 157, "start": 1129.48, "end": 1147.2, "text": "Aussatzern, okay, vielleicht waren das ein paar Frame Drops, naja, gucken wir mal, Keg-Wade,"}, {"id": 158, "start": 1147.2, "end": 1149.16, "text": "gut, macht eigentlich den Lautstärker, Teams da wieder dran rumgedockt hat, achja, was ich"}, {"id": 159, "start": 1149.16, "end": 1157.8, "text": "sagen wollte, mich haben heute wieder unsere Consultants wieder fertig gemacht, der Consultant"}, {"id": 160, "start": 1157.8, "end": 1171.32, "text": "hat einen Change gemacht, eingecheckt, Infrastructure as Code, wurde ausgerollt, ging nicht, okay,"}, {"id": 161, "start": 1171.32, "end": 1179.76, "text": "ja, ja, ja, wir müssen das noch ein bisschen ordnen, ich weiß nicht ob ich da wirklich"}, {"id": 162, "start": 1179.76, "end": 1191.12, "text": "alles reinschreiben soll, weil es schon ganz schön viel, ganz schön viel Kram, ja, ja,"}, {"id": 163, "start": 1191.12, "end": 1205.92, "text": "das hat sich tatsächlich kaputt angehört, das könnte, das könnte aber tatsächlich,"}, {"id": 164, "start": 1205.92, "end": 1218.36, "text": "beim Upload Pack-A-Loss oder irgendwas gewesen sein, ja, schon wieder, ah, ich weiß woran"}, {"id": 165, "start": 1218.36, "end": 1230.56, "text": "es liegt, ich weiß woran es liegt, ich weiß woran es liegt, ich weiß, also jetzt ist wieder"}, {"id": 166, "start": 1230.56, "end": 1239.24, "text": "gut, ne, jetzt ist wieder gut, oder, aber jetzt, weil jetzt höre ich es ja auch nicht"}, {"id": 167, "start": 1239.24, "end": 1255.92, "text": "mehr, ah, ah, was ist das, okay, was ist das, Moment Leute, ich entwirme mal mein Kabel,"}, {"id": 168, "start": 1255.92, "end": 1281.8, "text": "vielleicht bringt das was, so, schauen wir mal, Test, Test, Test, so, schauen wir mal,"}, {"id": 169, "start": 1281.8, "end": 1287.64, "text": "Test, Test, Test. Okay, wenn ich das jetzt bewege, wenn ich das bewege, fängt es dann"}, {"id": 170, "start": 1287.64, "end": 1294.64, "text": "wieder an zu knacken, oder wie ist das? Okay, wenn ich das jetzt bewege, wenn ich das bewege,"}, {"id": 171, "start": 1294.64, "end": 1303.04, "text": "fängt es dann wieder an zu knacken, oder wie ist das? Schein am Kabel, nein, das hat"}, {"id": 172, "start": 1303.04, "end": 1307.52, "text": "nicht angefangen zu knacken, ich habe es doch jetzt selbst gehört, das hat jetzt ein bisschen"}, {"id": 173, "start": 1307.52, "end": 1312.04, "text": "gerieben am Mikrofon, aber das war es, also jetzt ist nichts mehr, ne, jetzt ist nichts"}, {"id": 174, "start": 1312.04, "end": 1317.72, "text": "mehr, es ist wirklich, es ist wirklich merkwürdig, keine Ahnung was das ist, jaja, ist klar,"}, {"id": 175, "start": 1317.72, "end": 1325.52, "text": "jetzt ist Echo, alles klar, jebaited, was das ist, jaja, ist klar, jetzt ist Echo, alles"}, {"id": 176, "start": 1325.52, "end": 1331.64, "text": "klar, jeba-, was das ist, okay, das ist, das ist, das war das Kabel, aus irgendwelchen"}, {"id": 177, "start": 1331.64, "end": 1345.72, "text": "Gründen, keine Ahnung, was das Kabel für Schmerzen hat, ich weiß nicht, IP Adresse,"}, {"id": 178, "start": 1345.72, "end": 1357.16, "text": "ja, so stehe ich gleich raus, guck, jetzt bin ich wieder ins Mikrofon gekommen, aber"}, {"id": 179, "start": 1357.16, "end": 1361.8, "text": "das ist nicht das Problem, ich habe es eben auch gehört, so, also weiter geht's, also"}, {"id": 180, "start": 1361.8, "end": 1366.32, "text": "ich habe die ganze Sache hier relativ ungeordnet hingeschrieben, wir müssen jetzt mal überlegen,"}, {"id": 181, "start": 1366.32, "end": 1372.92, "text": "also, lass mal kurz in mich gehen, also, Linux, 15 Jahre Linux-Erfahrung, Red Hat, CentOS,"}, {"id": 182, "start": 1372.92, "end": 1380.16, "text": "Ubuntu, Debian, Arch-Spidey-Way, soll ich das haben, das hat halt Shed letztens geschrieben,"}, {"id": 183, "start": 1380.16, "end": 1389.08, "text": "ich schreibe nicht Arch-Spidey-Way rein, ich schreibe es einfach nur so, ich kann da nicht"}, {"id": 184, "start": 1389.08, "end": 1399.96, "text": "Arch-Spidey-Way reinschreiben, im Summer, Web-Server, Reverse-Box, Nginx, Kali, das"}, {"id": 185, "start": 1399.96, "end": 1420.72, "text": "kann ich wahrscheinlich dann weglassen, ok, ich muss mir irgendwie husten, so, die ganze"}, {"id": 186, "start": 1420.72, "end": 1426.0, "text": "DevOps-Geschichte, ok, wenn euch da noch was einfällt, sagt Puppet, Puppet habe ich tatsächlich"}, {"id": 187, "start": 1426.0, "end": 1436.36, "text": "auch noch ein bisschen Ahnung, fuck, warum muss ich jetzt so bloßen, ok, Monitoring,"}, {"id": 188, "start": 1436.36, "end": 1453.24, "text": "Prometheus, Kafana Nagios, Influx DB, alles klar, ok, Cloud, Cloudgedöns, Cloudflare,"}, {"id": 189, "start": 1453.24, "end": 1462.88, "text": "Cloudflare habe ich tatsächlich schon ein paar Sachen mitgemacht, Serverless Azure Functions,"}, {"id": 190, "start": 1462.88, "end": 1473.52, "text": "ja, mal ein bisschen Zeug hin, ok, jetzt machen wir den, so, hier schreiben wir natürlich"}, {"id": 191, "start": 1473.52, "end": 1486.6, "text": "CI, CD noch rein, du wolltest die Linux-Tools noch zusammenfassen, ok, ne, Datenbank habe"}, {"id": 192, "start": 1486.6, "end": 1505.84, "text": "ich keine Ahnung von, ja, habe ich ja schon sowas, das haben wir, so, das haben wir schon,"}, {"id": 193, "start": 1505.84, "end": 1517.24, "text": "da wollte einer jetzt hier plus plus schreiben, ok, schreiben wir, wie nennt man das, Development"}, {"id": 194, "start": 1517.24, "end": 1528.84, "text": "oder Softwareentwicklung oder irgendwie sowas, Hashtag Progers, so, da muss ich jetzt mal"}, {"id": 195, "start": 1528.84, "end": 1533.8, "text": "die ganzen Kempel hinschreiben, also was habe ich denn, was habe ich denn Ahnung von,"}, {"id": 196, "start": 1533.8, "end": 1548.76, "text": "vielleicht sollte ich hier oben noch, hier muss noch hin, Loadbalancing, Hochverfügbarkeit,"}, {"id": 197, "start": 1548.76, "end": 1558.4, "text": "Software Engineering, coolen Sachen, Cobol, Cobol musste auf jeden Fall hin, ja, das kann"}, {"id": 198, "start": 1558.4, "end": 1566.6, "text": "ich, das kann ich von unten mir dann rauskopieren, IoT wollten wir noch machen, ok, ich lösche"}, {"id": 199, "start": 1566.6, "end": 1573.96, "text": "die Sachen mal raus, die ich schon oben stehen habe, KVM muss da nicht, muss da KVM rein,"}, {"id": 200, "start": 1573.96, "end": 1588.36, "text": "KVM können wir ruhiger reinschreiben, Containerisierung, ist Containerisierung ein Wort, schreibt man"}, {"id": 201, "start": 1588.36, "end": 1610.24, "text": "das so, Containerisierung tatsächlich, mal die interessanten Sachen eben ein bisschen"}, {"id": 202, "start": 1610.24, "end": 1633.28, "text": "oben hin, ok, also Serverless, schreibe ich, das schreibe ich einfach dabei, passt das"}, {"id": 203, "start": 1633.28, "end": 1646.6, "text": "sonst, passt das sonst ganz gut hin, so IoT können wir noch machen, I'm not, kann ich"}, {"id": 204, "start": 1646.6, "end": 1655.2, "text": "nicht genau sagen wie die Stelle heißt, weil mich hat ein ehemaliger Kollege angerufen"}, {"id": 205, "start": 1655.2, "end": 1658.52, "text": "hat gemeint, Max willst du nicht bei uns anfangen und ich habe mit ihm telefoniert und hat mir"}, {"id": 206, "start": 1658.52, "end": 1668.32, "text": "auch gesagt wie das heißt, ich glaube es war irgendwas, entweder Senior, was war es denn,"}, {"id": 207, "start": 1668.32, "end": 1677.16, "text": "es war nicht Senior DevOps Engineer, es war auch nicht Senior Admin, es war Senior Engineer"}, {"id": 208, "start": 1677.16, "end": 1686.96, "text": "Development Infrastruktur oder sowas, Senior Engineer Development Infrastructure, irgendwie"}, {"id": 209, "start": 1686.96, "end": 1700.48, "text": "sowas, ich krieg's aus dem Kopf nicht genau an, was ist das denn, Chat ihr verarscht mich"}, {"id": 210, "start": 1700.48, "end": 1711.08, "text": "doch jetzt oder, was ist das denn, wie jetzt, was ist da los, was soll das, ich hab mich"}, {"id": 211, "start": 1711.08, "end": 1721.04, "text": "überhaupt nicht bewegt, wie jetzt, was ist da los, ok, ok, wir versuchen das jetzt nach"}, {"id": 212, "start": 1721.04, "end": 1727.12, "text": "zu vollziehen, ich wackel jetzt, ich wackel jetzt hier mal am, aha jetzt hab ich was gehört,"}, {"id": 213, "start": 1727.12, "end": 1735.84, "text": "jetzt hat es ein bisschen geknackt, jetzt bewege ich mal hier das Kabel und das Zeug, ok,"}, {"id": 214, "start": 1735.84, "end": 1765.8, "text": "ok, ok, das ist sehr merkwürdig, ich weiß nicht was das ist, das ist sehr merkwürdig,"}, {"id": 215, "start": 1765.8, "end": 1774.88, "text": "es liegt auch nicht an OBS, ich hab's ja eben auch in Audacity gehört, ich weiß bis heute"}, {"id": 216, "start": 1774.88, "end": 1795.24, "text": "nicht, ob man das so ausspricht, vielleicht ist es auch Windows Bullshit und nach einem"}, {"id": 217, "start": 1795.24, "end": 1809.4, "text": "Restart ist es weg, man weiß ja nicht, ok, IoT, da kann ich auf jeden Fall noch reinschreiben,"}, {"id": 218, "start": 1809.4, "end": 1815.68, "text": "also da schreib ich, das weiß ich gar nicht ob ich das hinschreibe hier, das hat ja für"}, {"id": 219, "start": 1815.68, "end": 1826.12, "text": "meinen Job überhaupt keine Relevanz so, letztendlich, ich mein, das ist eigentlich total irrelevant"}, {"id": 220, "start": 1826.12, "end": 1832.88, "text": "dafür, ok, Software Engineering, was haben wir denn da, da kann ich den Kram von hier"}, {"id": 221, "start": 1832.88, "end": 1839.52, "text": "unten nehmen, Serverless, Serverless schreiben wir einfach mal, nee Serverless hab ich da"}, {"id": 222, "start": 1839.52, "end": 1848.2, "text": "oben schon stehen, Progas, so das kann weg, Object Detection, das haben wir tatsächlich"}, {"id": 223, "start": 1848.2, "end": 1856.2, "text": "schon im Stream gemacht mit OpenCL, war das glaub damals, Protobuf, gRPC, HiIQ, Begriffe"}, {"id": 224, "start": 1856.2, "end": 1867.52, "text": "einfach mal hier eingeschmissen, Shell Scripting, Retardsenders, ok, das hab ich alles schon,"}, {"id": 225, "start": 1867.52, "end": 1872.8, "text": "Windows, wisst ihr was da rauskommt, wenn ich da drauf klicke, wenn mich einer was zu"}, {"id": 226, "start": 1872.8, "end": 1885.12, "text": "Windows fragt, Open, das kommt da raus, wenn mich einer zu Windows fragt, oder eigentlich"}, {"id": 227, "start": 1885.12, "end": 1893.28, "text": "sollte besser das da rauskommen, eigentlich bräuchten wir das, ich will nicht Kubernetes"}, {"id": 228, "start": 1893.28, "end": 1898.64, "text": "reinschreiben, die Sache ist die, ich hab Basic Ahnung von Kubernetes, aber ich bin"}, {"id": 229, "start": 1898.64, "end": 1902.2, "text": "jetzt niemand der irgendeinen Kubernetes Cluster aufbauen kann, ich kann da was deployen, ich"}, {"id": 230, "start": 1902.2, "end": 1917.6, "text": "kann da was restarten, aber super krass Ahnung von Kubernetes hab ich net, ja ich lerne das"}, {"id": 231, "start": 1917.6, "end": 1929.0, "text": "bis morgen, wenn ich abschicken muss, den Manage Kubernetes kann ich aufbauen, ich meine,"}, {"id": 232, "start": 1929.0, "end": 1934.68, "text": "ich kann das ja durchaus mal reinschreiben, aber vielleicht soll ich lieber Kubernetes,"}, {"id": 233, "start": 1934.68, "end": 1940.12, "text": "naja komm, komm wir schreiben K8S rein, die coolen wissen das, die Skills brauchen eigentlich"}, {"id": 234, "start": 1940.12, "end": 1944.68, "text": "noch eher ein Skill Level, theoretisch schon, es knackt wieder, Leute ihr könnt mich jetzt"}, {"id": 235, "start": 1944.68, "end": 1955.56, "text": "mega Chebaten, ihr könnt mich den ganzen Tag Chebaten jetzt und ich muss das nachkommen,"}, {"id": 236, "start": 1955.56, "end": 1968.52, "text": "ok das liegt dann wirklich an der Bewegung hier, vielleicht kackt das wirklich, ja wenn"}, {"id": 237, "start": 1968.52, "end": 1977.64, "text": "ich den, ich merke es gerade, wenn ich den Kopf, ja wenn ich den Kopf, ja das ist wenn"}, {"id": 238, "start": 1977.64, "end": 1982.4, "text": "ich den Kopf in falsche Richtung bewege, ich glaube das das Headset gibt langsam den Geist,"}, {"id": 239, "start": 1982.4, "end": 1997.0, "text": "aber ich meine, ohne Scheiß ich meine ich hab das Headset jetzt seit 2010 oder so, 2011,"}, {"id": 240, "start": 1997.0, "end": 2007.48, "text": "übelst lange schon, das ist immer noch das MMX300, ja das MMX300 das finde ich das beste,"}, {"id": 241, "start": 2007.48, "end": 2016.52, "text": "was es gibt, also wenn man es nicht total übertreiben will, natürlich kann man sich"}, {"id": 242, "start": 2016.52, "end": 2021.48, "text": "auch und das ist wahrscheinlich insgesamt die bessere Wahl, ja auch ein Kopfhörer kaufen"}, {"id": 243, "start": 2021.48, "end": 2028.52, "text": "mit Mikrofon, aber angenehmer ist es halt trotzdem mit dem Headset, ich könnte mir tatsächlich"}, {"id": 244, "start": 2028.52, "end": 2040.52, "text": "mal ein neues MMX300 gönnen oder, warte mal hat es da oben auch so ein Polster wie das"}, {"id": 245, "start": 2040.52, "end": 2052.44, "text": "hier her, du hast ja selber gebaut, naja selber gebaut wollte ich gerade sagen ist ein DT770"}, {"id": 246, "start": 2052.44, "end": 2067.96, "text": "mit dem Mikrofon, ich hab kein Voice Meter, wie gesagt ich siehs ja hier, ich hab direkt,"}, {"id": 247, "start": 2067.96, "end": 2085.44, "text": "wir können da direkt das Mikrofon einstellen, ansonsten ich meine ich könnte, wenn es gar"}, {"id": 248, "start": 2085.44, "end": 2091.4, "text": "nicht hilft, ich könnte hier mal ein bisschen dran rumdrehen oben an der Verlängerung oder"}, {"id": 249, "start": 2091.4, "end": 2103.64, "text": "so, aber ja, wir lassen es jetzt einfach mal, ok also IOT, MQTT das ist ok, das ist ziemlich"}, {"id": 250, "start": 2103.64, "end": 2111.0, "text": "egal, also Softwareengine, da kann ich von hier unten was kopieren, Brotobuff ist doch"}, {"id": 251, "start": 2111.0, "end": 2121.72, "text": "ein GRPC Gedöns oder, so also es kommt da irgendwie rein, Cloud, Netlify kann ich da"}, {"id": 252, "start": 2121.72, "end": 2127.8, "text": "tatsächlich auch noch reinschreiben, exellent, exellent, was haben wir hier sonst noch, Alibaba"}, {"id": 253, "start": 2127.8, "end": 2133.24, "text": "Cloud, so ein Blödsinn, weil ich da für den Scheiß reingeschrieben hab, ok das kann"}, {"id": 254, "start": 2133.24, "end": 2141.2, "text": "ich, das kann ich kopieren, was ist was, Netlify, Netlify ist ein Dienst, was gerade angesagt"}, {"id": 255, "start": 2141.2, "end": 2148.52, "text": "ist wenn du deine, ich kanns ja noch mal schreiben, Net, Netlify, so jetzt, da kannst du deine"}, {"id": 256, "start": 2148.52, "end": 2157.32, "text": "Web Anwendung drauf deployen und nach Möglichkeiten möglichst nah an dem ausliefern der die Seite"}, {"id": 257, "start": 2157.32, "end": 2165.96, "text": "ausmacht, die die Seite aufmacht, also hauptsächlich wird es, wurde es die ganze Zeit für statisches,"}, {"id": 258, "start": 2165.96, "end": 2180.8, "text": "statischen Web Content, ein bisschen sowas wie Versel, ja, ja, im Prinzip ist es recht"}, {"id": 259, "start": 2180.8, "end": 2191.08, "text": "ähnlich, ja, ok also das kann ich doch jetzt gerade mal hier übernehmen und dann müsst"}, {"id": 260, "start": 2191.08, "end": 2211.4, "text": "ihr mir sagen, Node.js muss da auf jeden Fall nachhinein, Frontend, Frontend machen wir dann,"}, {"id": 261, "start": 2211.4, "end": 2214.64, "text": "so, Shit++, GitHubX, haben wir alle schon, ja, IDE Editors muss ich da nicht, muss ich"}, {"id": 262, "start": 2214.64, "end": 2226.32, "text": "da nicht reinschreiben, Tools, Tools, Tools könnte man vielleicht noch irgendwie, die"}, {"id": 263, "start": 2226.32, "end": 2234.04, "text": "Skillbars sind sinnlos, ja die kommen auch weg, ja in Vim könnte ich jetzt D drücken"}, {"id": 264, "start": 2234.04, "end": 2242.72, "text": "und dann einfach Punkt, Java, Kekkel, ok die Hälfte davon stimmt ja gar nicht, die Hälfte"}, {"id": 265, "start": 2242.72, "end": 2252.4, "text": "stimmt ja davon gar nicht, also, PainsChamp muss da schon mal nicht hin, so, also Cobol"}, {"id": 266, "start": 2252.4, "end": 2260.36, "text": "ist da auch eher der Witz, ja, können Sie mich aber fragen, so C Sharp, sagt man das"}, {"id": 267, "start": 2260.36, "end": 2279.52, "text": "eigentlich offiziell groß oder klein, C Sharp, Ruby, Bash, Shells, Gripting, Go, die Hype"}, {"id": 268, "start": 2279.52, "end": 2292.04, "text": "Sprachen, mal ein bisschen weiter oben, Git ist auch drauf, so, also, Chat was habe ich"}, {"id": 269, "start": 2292.04, "end": 2315.24, "text": "denn vergessen, Blatter, also, ich habe in PowerShell schon mal was gemacht, ja, hat"}, {"id": 270, "start": 2315.24, "end": 2337.88, "text": "ich schon mal gemacht, ja, so, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja,"}, {"id": 271, "start": 2337.88, "end": 2351.9, "text": "ja, so, ja, ja, ja, ja, ja, ja ja, ja, ja, ja, ja, ja, ja, ja, wire地, Allg Berry"}, {"id": 272, "start": 2351.9, "end": 2355.46, "text": "Ja plan von was gibt es kraft ql"}, {"id": 273, "start": 2360.78, "end": 2363.98, "text": "Vue gs. Ich view jason"}, {"id": 274, "start": 2365.7, "end": 2367.7, "text": "homocyste"}, {"id": 275, "start": 2367.86, "end": 2369.86, "text": "Ja"}, {"id": 276, "start": 2369.9, "end": 2374.38, "text": "Da war wahrscheinlich kein interessieren kann man ja mal hinschreiben markt dauern"}, {"id": 277, "start": 2374.38, "end": 2376.94, "text": "Die"}, {"id": 278, "start": 2379.58, "end": 2381.58, "text": "Warum nicht"}, {"id": 279, "start": 2383.8, "end": 2390.02, "text": "web assembly c++ ffm pack ne ffm pack muss ich da"}, {"id": 280, "start": 2398.38, "end": 2401.9, "text": "Was gibt es da kommen wir kommen wir sind wir sind mal so frei"}, {"id": 281, "start": 2401.9, "end": 2411.06, "text": "Wir schreiben einfach, wir schreiben einfach alles rein."}, {"id": 282, "start": 2411.06, "end": 2412.06, "text": "CSV."}, {"id": 283, "start": 2412.06, "end": 2424.86, "text": "Svelte, Svelte, Svelte Kit, halt man so."}, {"id": 284, "start": 2424.86, "end": 2429.34, "text": "Gibt es Dokumentationstools mit denen du dich auskennst?"}, {"id": 285, "start": 2429.34, "end": 2449.9, "text": "Naja also Tools kenne ich mich ganz gut aus mit Jyra, mit Confluence, Dokuviki, ist das"}, {"id": 286, "start": 2449.9, "end": 2464.18, "text": "Snippingtool, Bitbucket haben wir oben schon stehen."}, {"id": 287, "start": 2464.18, "end": 2469.74, "text": "Ich weiß gar nicht was ich da sonst noch dazu hinschreiben soll, was soll man denn bei"}, {"id": 288, "start": 2469.74, "end": 2470.74, "text": "Tools hinschreiben?"}, {"id": 289, "start": 2470.74, "end": 2482.22, "text": "Keine Ahnung, ich muss erst mal, ich muss erst mal den anderen Krämpel hier fertig"}, {"id": 290, "start": 2482.22, "end": 2485.86, "text": "machen, sonst fällt mir nix mehr ein."}, {"id": 291, "start": 2485.86, "end": 2491.5, "text": "WebRTC haben wir Zeug gemacht."}, {"id": 292, "start": 2491.5, "end": 2495.5, "text": "Google Maps haben wir Zeug gemacht."}, {"id": 293, "start": 2495.5, "end": 2502.3, "text": "Tailwind, CSS haben wir Zeug gemacht, das fällt mir nicht mehr ein."}, {"id": 294, "start": 2502.3, "end": 2511.46, "text": "Postman, sehr gut, sehr gut."}, {"id": 295, "start": 2511.46, "end": 2520.06, "text": "Nee, nee, nee, nee, seht AWK, DD nicht rein, das habe ich hier oben aber das lasse ich"}, {"id": 296, "start": 2520.06, "end": 2521.06, "text": "raus."}, {"id": 297, "start": 2521.06, "end": 2524.22, "text": "Das ist doch bescheuert, üblichen Tools, die braucht doch..."}, {"id": 298, "start": 2524.22, "end": 2526.9, "text": "Interessiert doch keinen."}, {"id": 299, "start": 2526.9, "end": 2542.62, "text": "LSD, PWD, ja genau."}, {"id": 300, "start": 2542.62, "end": 2572.38, "text": "Die Scout, JetBrains, Netzwerk, ja stimmt, ich habe eine"}, {"id": 301, "start": 2572.38, "end": 2579.06, "text": "CCNA 2009 oder so gemacht, ja geil, das hat die Welt, das hat die Welt gebraucht."}, {"id": 302, "start": 2579.06, "end": 2585.5, "text": "Rest, Soap und, oh Gott, kann ich ja ewig aufzählen."}, {"id": 303, "start": 2585.5, "end": 2594.62, "text": "Rust, ok, Programmiersprache, Rust, bisschen, bisschen war es schon gemacht, ja, sogar,"}, {"id": 304, "start": 2594.62, "end": 2599.62, "text": "sogar mehr als Basics, ColdFusion, was kommt als nächstes?"}, {"id": 305, "start": 2599.62, "end": 2628.58, "text": "Lotus Notes oder wie?"}, {"id": 306, "start": 2628.58, "end": 2650.58, "text": "Wenn schon dann so, warte mal, haben wir nicht Stream-Projekt-Ideen, Stream-Ideen, ok, keine"}, {"id": 307, "start": 2650.58, "end": 2659.58, "text": "Ahnung."}, {"id": 308, "start": 2659.58, "end": 2687.62, "text": "So, jetzt da haben wir schon drinne, Monitoring haben wir auch schon, Monitoring haben wir"}, {"id": 309, "start": 2687.62, "end": 2700.58, "text": "schon drinne, mir fällt jetzt wenig, Grafana haben wir auch schon drinne, ich meine sollte"}, {"id": 310, "start": 2700.58, "end": 2707.62, "text": "doch eigentlich reichen, das ist quasi hier ganze IT-Abteilung, Cloud Asher könnte man"}, {"id": 311, "start": 2707.62, "end": 2714.14, "text": "noch aufschlüsseln in die konkreten Produkte, das ist wohl wahr, aber das können sie mich"}, {"id": 312, "start": 2714.14, "end": 2722.86, "text": "ja dann fragen, ich meine, GraphQL habe ich auch schon drinne, das liest, wollte quasi"}, {"id": 313, "start": 2722.86, "end": 2740.02, "text": "liest sich eh keiner durch, wir ordnen mal die Sprachen so ein bisschen, hast du sonst"}, {"id": 314, "start": 2740.02, "end": 2755.14, "text": "keine Zertifizierung, nö, das schreibe ich da gar nicht rein, das ist mir zu doof, kann"}, {"id": 315, "start": 2755.14, "end": 2769.74, "text": "ich jetzt hinschreiben, beste besten Soft-Skills aller Zeiten, WebAssembly haben wir schon"}, {"id": 316, "start": 2769.74, "end": 2776.58, "text": "drinne stehen, das war einfach nur genehmt im Stream, das schreibe ich so bestimmt nicht"}, {"id": 317, "start": 2776.58, "end": 2806.26, "text": "rein, das ist zu viel, ja ich denke auch, dass es zu viel ist, so irgendeine noch schlaue"}, {"id": 318, "start": 2806.26, "end": 2813.86, "text": "Ideen, also wie gesagt, wir können das auch ein bisschen zusammenfassen, das ist eigentlich"}, {"id": 319, "start": 2813.86, "end": 2830.1, "text": "viel zu viel, wie sieht denn das in Markdown aus, wenn man das rendert, ach das ist eine"}, {"id": 320, "start": 2830.1, "end": 2855.94, "text": "TXT, das ist gar kein Markdown, heck wait, oh ok, nice, easy, gg, ok, ok, ok, ok, ok,"}, {"id": 321, "start": 2855.94, "end": 2873.22, "text": "ok, ok, ok, ok, ok, ok..."}, {"id": 322, "start": 2873.22, "end": 2880.16, "text": "Ehrlich gesagt zum größten Teil ein Wrishel Studio Debugger, aber ansonsten hält es sich"}, {"id": 323, "start": 2880.16, "end": 2891.2, "text": "Grenzen."}, {"id": 324, "start": 2891.2, "end": 2893.24, "text": "Profiler Tracing Tools Performance."}, {"id": 325, "start": 2893.24, "end": 2895.44, "text": "Tracing Tool Console Write Line."}, {"id": 326, "start": 2895.44, "end": 2896.44, "text": "Zählt das auch?"}, {"id": 327, "start": 2896.44, "end": 2901.2, "text": "Zählt das auch?"}, {"id": 328, "start": 2901.2, "end": 2902.2, "text": "Print F."}, {"id": 329, "start": 2902.2, "end": 2907.76, "text": "Ich sag auch einfach fehlerfrei programmieren, dann braucht man keine Debugger."}, {"id": 330, "start": 2907.76, "end": 2916.12, "text": "Wie gesagt, um die, ähm, jetzt mach ich mal raus, weil ansonsten check ich dann noch"}, {"id": 331, "start": 2916.12, "end": 2917.12, "text": "aus Versehen ab."}, {"id": 332, "start": 2917.12, "end": 2926.32, "text": "So hab ich Ahnung von Datenbanken Leute, ich hab tatsächlich, ich hab ein bisschen Ahnung"}, {"id": 333, "start": 2926.32, "end": 2956.28, "text": "von, ähm, Postgres, Fulltext Search, SQLite, Redis hab ich tatsächlich ein bisschen Plan"}, {"id": 334, "start": 2956.28, "end": 2981.44, "text": "so Minimal, ich kenn Redis auch nur quasi als Cash, so als Cash Key Value Store, beziehungsweise"}, {"id": 335, "start": 2981.44, "end": 2992.52, "text": "so als, ähm, PubSub Lite und es war ne Zeit lang halt mega angesagt, ist es glaub ich"}, {"id": 336, "start": 2992.52, "end": 2993.52, "text": "immer noch."}, {"id": 337, "start": 2993.52, "end": 3023.44, "text": "Elastic Search hab ich wenig Plan von, Cassandra DB hab ich auch keine Ahnung von, also ich,"}, {"id": 338, "start": 3023.44, "end": 3032.64, "text": "das einzige, pass auf, jetzt hab ich wieder am Mikrofon bewegt, ähm, das einzige was"}, {"id": 339, "start": 3032.64, "end": 3042.68, "text": "ich von Cassandra DB weiß, aber das reicht nicht um mich da zu qualifizieren zum draufschreiben,"}, {"id": 340, "start": 3042.68, "end": 3048.12, "text": "dass das irgendein verteiltes Datenbank System ist, aber ich hab die elfte schon wieder vergessen"}, {"id": 341, "start": 3048.12, "end": 3055.0, "text": "von FoxPro man, Leute mir gehts nicht darum, dass ich da irgendwas reinschreibe, das muss"}, {"id": 342, "start": 3055.0, "end": 3061.36, "text": "schon was sein wo ich ein bisschen Plan habe, ja es steht aktuell gerade zur Diskussion"}, {"id": 343, "start": 3061.36, "end": 3067.72, "text": "ja, ja das stimmt hab ich gesehen, also ich hab ein Angebot, mich hat jemand angerufen"}, {"id": 344, "start": 3067.72, "end": 3071.08, "text": "und hat gesagt hier Max willst du nicht bei uns anfangen und ich hab gesagt jo, erzählt"}, {"id": 345, "start": 3071.08, "end": 3076.36, "text": "mal und ich find das Klip hört sich echt nicht übel an, ich hab ihm gesagt ich schick"}, {"id": 346, "start": 3076.36, "end": 3091.84, "text": "ihm mal eine Skillliste ohne Lebenslauf,.NET Developer Roadmap, mal gucken was ich davon"}, {"id": 347, "start": 3091.84, "end": 3100.32, "text": "kann, ok, MonkaS zeigt mal her, wie gesagt ich arbeite, ich werde nicht als.NET Entwickler"}, {"id": 348, "start": 3100.32, "end": 3117.6, "text": "arbeiten dort, also das ist nicht so, Alter wie fett ist denn das, JIT, HTTP, HTTPS, naja"}, {"id": 349, "start": 3117.6, "end": 3132.34, "text": "gut, ah das hier ist tatsächlich gar nicht mal so blöd, wie SQLite soll man nicht lernen"}, {"id": 350, "start": 3132.34, "end": 3155.76, "text": "oder was ist das, ach you must know, ja Prometheus, Grafana, datadoc, kenn ich aber hab ich noch"}, {"id": 351, "start": 3155.76, "end": 3162.32, "text": "nie was mitgemacht, ist einfach teuer as fuck, hast du Kurzbeschreibungen zu Projekten,"}, {"id": 352, "start": 3162.32, "end": 3166.32, "text": "im Zweifelsfall gebe ich denen mein GitHub Account und dann können sie sich erstmal"}, {"id": 353, "start": 3166.32, "end": 3171.88, "text": "20 Projekte angucken mit Champ im Namen wo keiner weiß was ich gemacht hab, das soll"}, {"id": 354, "start": 3171.88, "end": 3176.84, "text": "nämlich dann fragen was sie genau wissen wollen, das ist ja noch wie gesagt, ist nicht dass"}, {"id": 355, "start": 3176.84, "end": 3182.16, "text": "ich da morgen anfange, ich will mir das eh auch erstmal angucken, ich hab schon gefragt"}, {"id": 356, "start": 3182.16, "end": 3192.68, "text": "ob man mal so einen Probetag machen könnte, dass ich das mal angucken kann, die werden"}, {"id": 357, "start": 3192.68, "end": 3197.44, "text": "rausfinden dass du Streamer bist, naja derjenige der mich angerufen hat, der weiß ja dass ich"}, {"id": 358, "start": 3197.44, "end": 3224.2, "text": "YouTube mache und Twitch, naja das ist zu Software lastig, naja warum nicht, naja, naja"}, {"id": 359, "start": 3224.2, "end": 3245.8, "text": "das Monarch S Projekt, ja das ist ganz toll, oh was gehts, moin Michael, 5 Spillian, kannst"}, {"id": 360, "start": 3245.8, "end": 3275.72, "text": "du die Ordnung posten, das wäre mal eine Frage, ja"}, {"id": 361, "start": 3275.72, "end": 3287.8, "text": "also so viel fällt mir jetzt da wirklich nicht mehr ein, ich mein es liest doch eh"}, {"id": 362, "start": 3287.8, "end": 3301.96, "text": "kein Mensch durch, noch irgendjemand, irgendwelche schlauen Ideen, nicht was ich reinschreiben"}, {"id": 363, "start": 3301.96, "end": 3307.36, "text": "wollte, sondern irgendwas was ich noch vergessen hab, also ich will jetzt ja nicht was reinschreiben"}, {"id": 364, "start": 3307.36, "end": 3311.6, "text": "wovon ich keine Ahnung hab, also es ist nicht das Ziel hier möglichst viele Sachen aufzulisten"}, {"id": 365, "start": 3311.6, "end": 3316.16, "text": "sondern Sachen mit denen ich auch schon mal mehr als einen kleinen Handschlag gemacht"}, {"id": 366, "start": 3316.16, "end": 3323.6, "text": "hab, du würdest das einfach nur noch weiter strukturieren, das liest im Endeffekt doch"}, {"id": 367, "start": 3323.6, "end": 3338.08, "text": "eh kein Mensch, noch mein Netzwerkrahmen vom Provider, lass mal überlegen, ja ich kann"}, {"id": 368, "start": 3338.08, "end": 3350.88, "text": "ein bisschen, ich kann ein bisschen Cisco Command Line, ja ich weiß noch dass man Enable"}, {"id": 369, "start": 3350.88, "end": 3362.68, "text": "machen muss am Anfang und dass man No, No SH macht um den Port hochzufahren, das krieg"}, {"id": 370, "start": 3362.68, "end": 3371.68, "text": "ich noch aus dem Kopf hin, Conf T genau genau und dann irgendwie Backup, No Shut, No SH"}, {"id": 371, "start": 3371.68, "end": 3389.8, "text": "macht man, ah das ist tatsächlich eine gute Idee, wenn ich hier schon die ganzen anderen"}, {"id": 372, "start": 3389.8, "end": 3409.88, "text": "Websockets, ja generell Protokolle, bei Netzwerk, kann doch da jetzt nicht TCP, das ist doch"}, {"id": 373, "start": 3409.88, "end": 3422.6, "text": "hängen geblieben eigentlich oder, in Bewerbung sollte man nur Sachen reinschreiben die auch"}, {"id": 374, "start": 3422.6, "end": 3426.48, "text": "für den Job relevant sind, nachdem die mir noch gar nicht genau gesagt haben was ich"}, {"id": 375, "start": 3426.48, "end": 3434.0, "text": "eigentlich später machen soll, weil ich nur so quasi zwischen so halb offiziell mit meinem"}, {"id": 376, "start": 3434.0, "end": 3447.16, "text": "Exkollege telefoniert hab, kann ich das nicht so genau sagen, Lifecycle Management, das ist"}, {"id": 377, "start": 3447.16, "end": 3471.6, "text": "ein Sixhead Begriff, das muss da rein und zwar da, Lifecycle Management Massive High IQ,"}, {"id": 378, "start": 3471.6, "end": 3475.76, "text": "was das ist, ok wenn mich einer fragen würde was ist Lifecycle Management, danach die Motto"}, {"id": 379, "start": 3475.76, "end": 3480.12, "text": "sie haben Lifecycle Management reingeschrieben, was verstehen sie unter Lifecycle Management,"}, {"id": 380, "start": 3480.12, "end": 3487.76, "text": "da würde ich sinngemäß sowas sagen wie ja es geht im Prinzip darum System quasi von"}, {"id": 381, "start": 3487.76, "end": 3495.12, "text": "der Erstellung, von der wie nennt man das heutzutage, von der Professionierung bis zum"}, {"id": 382, "start": 3495.12, "end": 3507.2, "text": "Abbau was sie in Übersicht zu haben, ansonsten keine Ahnung ob das stimmt, ich glaube schon,"}, {"id": 383, "start": 3507.2, "end": 3514.84, "text": "also auf deutsch ist das sowas wie System Lebenszyklus oder sowas, Updates für Softwares"}, {"id": 384, "start": 3514.84, "end": 3537.64, "text": "programmiert, ich wüsste nicht wie man das schreiben soll, keine Ahnung, Patch Management"}, {"id": 385, "start": 3537.64, "end": 3557.44, "text": "Massive Idee, das schreiben wir nicht bei DevOps rein, das schreiben wir hier oben mit rein,"}, {"id": 386, "start": 3557.44, "end": 3569.32, "text": "Deckdose Flaschen, null, warum nicht, Release, ja das stimmt das mache ich ja aktuell ja"}, {"id": 387, "start": 3569.32, "end": 3581.12, "text": "gerade sogar, Release Management, Keksteam beste, ja ich finde auch die sollten sich"}, {"id": 388, "start": 3581.12, "end": 3599.28, "text": "mal neue Bezeichnung überlegen, ah Lifecycle Management, so ich glaube das erschlägt erst,"}, {"id": 389, "start": 3599.28, "end": 3615.2, "text": "das lasse ich raus, 123 Zeilen, die ersten 3 Management sind richtig geschrieben, ich"}, {"id": 390, "start": 3615.2, "end": 3643.0, "text": "kann dieses Wort nicht richtig schreiben, Chat, Twitch Chat, vor allem ja ehrlich gesagt"}, {"id": 391, "start": 3643.0, "end": 3654.04, "text": "vor allem Workstation kann ich noch einschreiben, aber Tools, ja Tools, ja ja, mit Vagrant"}, {"id": 392, "start": 3654.04, "end": 3682.52, "text": "habe ich auch schon mal was gemacht, das ist eher DevOps Kram, ne Mail habe ich keine Ahnung,"}, {"id": 393, "start": 3682.52, "end": 3692.44, "text": "GitOps, auch so ein geiles, so ein geiles, so ein geiler Begriff irgendwie, ja gut Virtualisierung"}, {"id": 394, "start": 3692.44, "end": 3712.84, "text": "kann ich da tatsächlich, anstatt KVM schreibe ich, Virtualisierung, GitOps, da soll ich"}, {"id": 395, "start": 3712.84, "end": 3717.08, "text": "aber zumindest, wie gesagt ich will eigentlich nur Sachen reinschreiben wo ich auch direkt"}, {"id": 396, "start": 3717.08, "end": 3726.6, "text": "aus bestehgreif was zu sagen könnte, GitOps, ah ok, ich verstehe, das ist quasi DevOps"}, {"id": 397, "start": 3726.6, "end": 3737.0, "text": "beziehungsweise CI, CD wenn man Git verwendet, so nach dem Motto, Comet kommt rein, Pulle"}, {"id": 398, "start": 3737.0, "end": 3750.44, "text": "Request wird genehmigt, Deployment läuft los und sowas in der Richtung, ja, naja, 5"}, {"id": 399, "start": 3750.44, "end": 3761.32, "text": "Minuten da, ok, das hört ja gar nicht mehr auf, so kam hier noch irgendwas, kam hier"}, {"id": 400, "start": 3761.32, "end": 3770.52, "text": "noch irgendwas im Chat, schon das er schief durchgescrollt, ja, auf Stream, ich habe bestimmt"}, {"id": 401, "start": 3770.52, "end": 3778.68, "text": "total viel Zeug noch vergessen, fällt das nicht unter DevOps, doch die Kategorien sind"}, {"id": 402, "start": 3778.68, "end": 3794.16, "text": "eh, sag mal mal, Variabel, ja, schreibe es einfach doppelt rein, null, merkt schon keiner,"}, {"id": 403, "start": 3794.16, "end": 3801.64, "text": "was meinst du mit Linux Lifecycle Management, ich meine dafür geiles Management-Busword,"}, {"id": 404, "start": 3801.64, "end": 3805.88, "text": "also was sagt denn Wikipedia dazu, wie gesagt was ich da drunter verstehe, habe ich euch"}, {"id": 405, "start": 3805.88, "end": 3814.48, "text": "schon gesagt, mal gucken was Wikipedia, Produktlebenszyklus, was sagt denn Wikipedia dazu, Produktlebenszyklus"}, {"id": 406, "start": 3814.48, "end": 3835.16, "text": "Management, PLM, ah ja, ja das ist dann aber weniger Linux, das ist weniger Linux, ist"}, {"id": 407, "start": 3835.16, "end": 3863.4, "text": "tatsächlich eher sowas hier, wollen wir das nicht alles in eine Zeile machen, wie sieht"}, {"id": 408, "start": 3863.4, "end": 3871.68, "text": "es mit ITIL aus, ich habe keine ITIL Zertifizierung, ich habe weder eine safe noch ITIL noch lean"}, {"id": 409, "start": 3871.68, "end": 3883.8, "text": "noch haste nicht gesehen, Zertifizierung, ja, will ich aber nicht hinschreiben, Bench,"}, {"id": 410, "start": 3883.8, "end": 3891.32, "text": "ja tatsächlich, aber weiß nicht wo ich das dazu hinschreiben soll, nein Active Directory"}, {"id": 411, "start": 3891.32, "end": 3902.0, "text": "habe ich keine, mach TOGAF, was zum Teufel ist TOGAF, die TOGAF, alter wie viel scheiß"}, {"id": 412, "start": 3902.0, "end": 3931.36, "text": "ist da gebt man, TOGAF, Open Group Architecture Framework, Richtung AI habe ich keine Ahnung"}, {"id": 413, "start": 3931.36, "end": 3943.68, "text": "von, ne ich schreibe alles das was ich schonmal gemacht habe, wo ich zumindest schonmal mehr"}, {"id": 414, "start": 3943.68, "end": 3952.4, "text": "gemacht habe, als einfach nur 2 Zeilen zugelesen, den ISO 9001 hätte ich noch zu bieten, ne"}, {"id": 415, "start": 3952.4, "end": 3964.92, "text": "habe ich keine Ahnung von, schreibe Quantencomputer hin, alles klar, Blockchain Maschine, Quatsch"}, {"id": 416, "start": 3964.92, "end": 3973.12, "text": "Leute, ist doch blöd, ich will ja nicht diese random Buzzwords hinschreiben, UML Diagramme,"}, {"id": 417, "start": 3973.12, "end": 3989.2, "text": "View ins Welt habe ich schon hingeschrieben, UTF-8, ey die Codings UTF-8, boah das ist"}, {"id": 418, "start": 3989.2, "end": 4004.96, "text": "irgendeine MySQL Geschichte, ja, Docker ist selbstverständlich, ist Docker dabei, Docker"}, {"id": 419, "start": 4004.96, "end": 4021.96, "text": "muss da relativ weit oben hin, Docker Hub, GHCR,"}, {"id": 420, "start": 4021.96, "end": 4045.08, "text": "gute Idee, gute Idee, ne, das wird der HR Typ bestimmt nicht fragen, weil der HR Typ"}, {"id": 421, "start": 4045.08, "end": 4048.84, "text": "von sowas keine Ahnung hat, aber das ist tatsächlich, ist auf jeden Fall nicht verkehrt,"}, {"id": 422, "start": 4048.84, "end": 4055.56, "text": "ja, gezwungenermaßen aber nicht, dass ich davon Ahnung hätte, noch Veed können wir"}, {"id": 423, "start": 4055.56, "end": 4071.92, "text": "noch hinschreiben, ja, Portena mag ich nicht, ey ich glaube jetzt haben wir es, Traffic"}, {"id": 424, "start": 4071.92, "end": 4083.96, "text": "Kammer schon drinnen, haben wir es schon drinnen, wir sind nicht, wir sind nicht bei 1996, ja,"}, {"id": 425, "start": 4083.96, "end": 4090.24, "text": "das ist die Red Hat Docker Alternative, die quasi ohne Route-Rechte funktioniert, boah"}, {"id": 426, "start": 4090.24, "end": 4096.08, "text": "das ist, das glaube ich so der Haupt Selling Point, achso, ja tatsächlich, damit kenne"}, {"id": 427, "start": 4096.08, "end": 4103.36, "text": "ich mich aus, ja, Raid, wo schreiben wir das hin, wo schreiben wir denn, Raid, Raid können"}, {"id": 428, "start": 4103.36, "end": 4113.12, "text": "wir noch zu Linux schreiben oder, Raid, was ist das Besondere an Red Hat, wie, du meinst"}, {"id": 429, "start": 4113.12, "end": 4120.28, "text": "an Red Hat, an Red Hat Linux, ja gut es ist halt ein eigener Distributionszweig, einer"}, {"id": 430, "start": 4120.28, "end": 4125.96, "text": "der professionellen Support liefert und im Enterprise Business Sektor recht angesagt"}, {"id": 431, "start": 4125.96, "end": 4132.16, "text": "ist, aber es gibt auch kostenlose Nachbauten, auch wenn CentOS nicht mehr gibt, aber es"}, {"id": 432, "start": 4132.16, "end": 4143.8, "text": "gibt jetzt Rocky Linux und Alma Linux, die ich aber noch nie verwendet habe, äh, Disk"}, {"id": 433, "start": 4143.8, "end": 4163.24, "text": "End, das muss ich doch nachher hinschreibe, also was ist denn die Red Fish API, Red Fish"}, {"id": 434, "start": 4163.24, "end": 4189.2, "text": "API, aha, was es nicht alles gibt, habe ich noch nie, habe ich noch nie gehört, weil"}, {"id": 435, "start": 4189.2, "end": 4207.44, "text": "das nicht Linux ist, ja was ist das, ich habe keine Ahnung, Tools, meinst du die interessieren"}, {"id": 436, "start": 4207.44, "end": 4215.64, "text": "sich auch für deine KD, bestimmt, vielleicht sollte ich hinschreiben, dazu bräuchte das"}, {"id": 437, "start": 4215.64, "end": 4223.76, "text": "Spiel ja erstmal Stats, bei der KD kann ich dir nicht sagen, das Game hat ja keine Stats,"}, {"id": 438, "start": 4223.76, "end": 4233.56, "text": "Server Administration, ja gut, das sollte eigentlich, ähm, sollen wir Linux Erfahrung und Administration"}, {"id": 439, "start": 4233.56, "end": 4247.76, "text": "irgendwie hinschreiben, Linux Erfahrung, wollen wir das so hinschreiben, Expanter"}, {"id": 440, "start": 4247.76, "end": 4258.16, "text": "Moab World Record Holder, ohja unbedingt, Apache Meso, benutzt das überhaupt noch jemand, Ansible"}, {"id": 441, "start": 4258.16, "end": 4268.48, "text": "steht auch schon drin, Kafka habe ich zu wenig Plan, was ist das hier, das Scalable"}, {"id": 442, "start": 4268.48, "end": 4295.68, "text": "Platforms Management Forum, die haben auch einen geilen Namen, Red, Red Fish API, haben"}, {"id": 443, "start": 4295.68, "end": 4304.56, "text": "iTracks Red Fish oder was, habe ich noch nie gehört Leute, haben wir wieder was gelernt,"}, {"id": 444, "start": 4304.56, "end": 4318.44, "text": "tatsächlich interessant, wusste ich nicht, das wusste ich mir tatsächlich mal merken,"}, {"id": 445, "start": 4318.44, "end": 4322.64, "text": "tatsächlich, ok das ist cool, das wusste ich nicht, da kann man ja die iTracks zum"}, {"id": 446, "start": 4322.64, "end": 4326.56, "text": "ersten Mal ordentlich ansteuern, das wusste ich mir merken, das ist ja mal Chat wieder"}, {"id": 447, "start": 4326.56, "end": 4333.2, "text": "was gelernt, ja, ja das ist wirklich cool, ich habe das bisher immer ausgelesen über"}, {"id": 448, "start": 4333.2, "end": 4339.56, "text": "SSH, SSH eingeloggt beim iTrack und dann irgendwelche komischen SSH Befehle ausgeführt, schon mal"}, {"id": 449, "start": 4339.56, "end": 4346.28, "text": "so eine Netzwerk-Virtualisierung gemacht, ja aber nicht wirklich so jetzt, dass ich"}, {"id": 450, "start": 4346.28, "end": 4352.28, "text": "mich damit wahnsinnig auseinander gesetzt habe, ich habe mal schon virtuelle Switches installiert"}, {"id": 451, "start": 4352.28, "end": 4357.36, "text": "beziehungsweise ich habe sogar mal docker auf einer MikroTik Kiste laufen, äh nicht docker,"}, {"id": 452, "start": 4357.36, "end": 4361.52, "text": "Linux Container auf einer docker, äh auf einer MikroTik Kiste laufen lassen und wir haben"}, {"id": 453, "start": 4361.52, "end": 4367.4, "text": "auch mal glaube ich auf irgendeinem Cisco Core Switch bei uns, da habe ich nur zugeguckt"}, {"id": 454, "start": 4367.4, "end": 4371.76, "text": "bei der, also da nee da kann ich nichts zu hinschreiben, ja haben wir schon drin stehen"}, {"id": 455, "start": 4371.76, "end": 4377.92, "text": "außer Chef, von Chef habe ich nicht viel Plan, das ist jetzt auch nicht so als wäre ich"}, {"id": 456, "start": 4377.92, "end": 4392.32, "text": "da der krasse Checker, das haben wir schon drin stehen, aber wenn die mich danach fragen"}, {"id": 457, "start": 4392.32, "end": 4396.24, "text": "muss ich sagen, ja ich habe damit schon was gemacht, ich kann damit auch was deployen,"}, {"id": 458, "start": 4396.24, "end": 4405.0, "text": "ich weiß so prinzipiell, prinzipiell ja was man da so drauf gucken muss, aber der große"}, {"id": 459, "start": 4405.0, "end": 4408.6, "text": "Kubernetes Checker bin ich nicht, also jetzt nicht so als könnte ich da irgendwie ein"}, {"id": 460, "start": 4408.6, "end": 4413.06, "text": "Cluster selbst installieren und dass es dann auch irgendwie über mehrere Knoten gescheit"}, {"id": 461, "start": 4413.06, "end": 4419.84, "text": "läuft, also da habe ich zu wenig Plan von, haben wir schon drin stehen, Crossplane habe"}, {"id": 462, "start": 4419.84, "end": 4429.24, "text": "ich nicht drin stehen, genauso wenig wie biceps von ähm von Azure, weil habe ich auch zu"}, {"id": 463, "start": 4429.24, "end": 4434.6, "text": "wenig mitgemacht bisher, Software Storage habe ich auch kein Plan, MQTD habe ich tatsächlich"}, {"id": 464, "start": 4434.6, "end": 4453.96, "text": "ja, ich würde sagen das geht doch hier alles schon mal ganz gut klar, cools, nur mit dem"}, {"id": 465, "start": 4453.96, "end": 4457.64, "text": "Unterschied dass ich von den Sachen die ich da reingeschrieben habe auch insofern Ahnung"}, {"id": 466, "start": 4457.64, "end": 4462.44, "text": "habe, dass ich entweder gleich was damit machen könnte oder eben nach kurzer Zeit nochmal"}, {"id": 467, "start": 4462.44, "end": 4465.36, "text": "angucken was machen könnte, ich habe mit allen Sachen die da drinstehen schon mal was"}, {"id": 468, "start": 4465.36, "end": 4471.88, "text": "gemacht und zwar mehr als nur ein Finger krumm also, ich habe da aber, ich habe von Datenbanken"}, {"id": 469, "start": 4471.88, "end": 4476.28, "text": "wenig Ahnung, deswegen, ich habe Poresquare als Full-Text-Dutch bisschen gemacht, ich"}, {"id": 470, "start": 4476.28, "end": 4481.04, "text": "habe relativ viel SQLite, allein schon durch das ganze Programmierzeug hier gemacht, Cassandra"}, {"id": 471, "start": 4481.04, "end": 4487.6, "text": "habe ich gar keine Ahnung, Leute wir haben doch letztens so einen komischen Kurs, erinnert"}, {"id": 472, "start": 4487.6, "end": 4491.52, "text": "es, ist jetzt so ein Witz ne, ich will das nicht reinschreiben, wir haben doch letztens"}, {"id": 473, "start": 4491.52, "end": 4496.4, "text": "so einen komischen Kurs gemacht von irgendeinem Bundesministerium, da gab es doch irgendwie"}, {"id": 474, "start": 4496.4, "end": 4502.84, "text": "so einen Kurs, ich meine nicht diesen Arbeitsamt-Test, schon irgendwie ein halbes Jahr her, da hat"}, {"id": 475, "start": 4502.84, "end": 4510.08, "text": "man so einen komischen Test gemacht, es war sowas wie der Internetführerschein, ich habe"}, {"id": 476, "start": 4510.08, "end": 4516.76, "text": "schon wieder vergessen was das war, schreibe auch noch eine Projektliste, beschreib mir"}, {"id": 477, "start": 4516.76, "end": 4530.72, "text": "welche, Park Alter, das ist mir aber zu anstrengend, da muss ich mir jetzt echt Gedanken machen,"}, {"id": 478, "start": 4530.72, "end": 4536.24, "text": "da müsste ich dann schreiben wie ich den Fiat Champ programmiert habe, ja wir haben das"}, {"id": 479, "start": 4536.24, "end": 4547.76, "text": "on stream gemacht, irgendwo hat man Archive, bestes Fiat Archive, wieder einfach mal Live"}, {"id": 480, "start": 4547.76, "end": 4556.68, "text": "Overflow, warum ist der hier in dem aktuellen Stream drinnen, achso weil wir das live geguckt"}, {"id": 481, "start": 4556.68, "end": 4574.4, "text": "haben, ähm, Zwelt Auto Complete und Postgres Text Search, Jupp da ist es guck, Jason Jaml"}, {"id": 482, "start": 4574.4, "end": 4583.0, "text": "haben wir schon drinnen, Projektliste, boah ey das ist dann aber ganz schön anstrengend,"}, {"id": 483, "start": 4583.0, "end": 4589.0, "text": "ich muss, ich muss wie gesagt den Lebenslauf noch fertig machen, ich habe das schon geschrieben"}, {"id": 484, "start": 4589.0, "end": 4595.84, "text": "zum größten Teil, ich muss noch gucken, dass das Datum stimmt und sowas da drin steht,"}, {"id": 485, "start": 4595.84, "end": 4602.12, "text": "mit welchen Mail Providern hast du denn Gabe, was, Gmail, Webmail, Yahoo, mehr oder weniger"}, {"id": 486, "start": 4602.12, "end": 4609.72, "text": "keine Ahnung, ja Gmail, GMX aber wen jucken das, bitte schön, was die interessieren würde"}, {"id": 487, "start": 4609.72, "end": 4620.88, "text": "ist eher sowas wie, ähm, ob ich Ahnung von Postfix oder Q-Mail oder Exim oder was es"}, {"id": 488, "start": 4620.88, "end": 4632.6, "text": "da nicht alles gibt habe, Dofkort, ja genau, NPM, ja das ist tatsächlich keine schlechte"}, {"id": 489, "start": 4632.6, "end": 4661.76, "text": "Idee, MS-Build, war komplett andere Scheiß, ich schreibe einfach dabei, ich schreibe einfach"}, {"id": 490, "start": 4661.76, "end": 4686.36, "text": "dabei, Sprachen, da schon reingeschaut, das ist eigener, das ist mein Stil, Leute, das"}, {"id": 491, "start": 4686.36, "end": 4692.2, "text": "ist, hier ist nichts Obvious, ich habe schon Dinger gelesen, teilweise im Chat, da kann"}, {"id": 492, "start": 4692.2, "end": 4697.88, "text": "ich nicht wissen, ob einer G-Baded oder nicht, aha, aha, ich glaube, das ist verbuggt vom"}, {"id": 493, "start": 4697.88, "end": 4702.8, "text": "Serious Max an der Stelle, weil man nicht über die Startseite geht, der müsste noch"}, {"id": 494, "start": 4702.8, "end": 4728.2, "text": "ein Fallback in seine Svelte-Kit-Anwendung einbauen, Tools, ähm, ich habe noch eine"}, {"id": 495, "start": 4728.2, "end": 4748.28, "text": "Idee, Moment, Tools, Azure CLI, Unit-Tests, mit sowas gebe ich mich erst gar nicht ab,"}, {"id": 496, "start": 4748.28, "end": 4752.08, "text": "wir programmieren einfach fehlerfrei und dementsprechend brauchen wir auch keine Tests"}, {"id": 497, "start": 4752.08, "end": 4755.44, "text": "und wenn man keine Tests braucht und einen Fehlerfall programmiert hat, braucht man auch"}, {"id": 498, "start": 4755.44, "end": 4761.52, "text": "keine Dokumentation und auch keine Kommentare, ganz einfach, was das für Zeit spart alles,"}, {"id": 499, "start": 4761.52, "end": 4767.36, "text": "einfach keine Fehler machen beim Programmieren, ist doch ganz einfach, hast du vor das Markdown"}, {"id": 500, "start": 4767.36, "end": 4776.64, "text": "Dokument, ja, ich werde das wahrscheinlich als PDF, PDF machen, tatsächlich habe ich"}, {"id": 501, "start": 4776.64, "end": 4796.2, "text": "von den, ähm, hält man das so, Browser, Browser-Steuerung, ja, ja leider und ich weiß"}, {"id": 502, "start": 4796.2, "end": 4801.88, "text": "nicht woran es liegt, ich weiß nicht, ich weiß nicht woran es liegt, es ist irgendwie"}, {"id": 503, "start": 4801.88, "end": 4809.04, "text": "kaputt, es ist irgendwie kaputt, ja das knackt es manchmal, wartet mal, ich guck mal hier"}, {"id": 504, "start": 4809.04, "end": 4814.16, "text": "oben, ich guck mal kurz hier oben dran, ob ich, wenn ich das bewege, ob das was hilft,"}, {"id": 505, "start": 4814.16, "end": 4833.56, "text": "ob das ein Sack, Kacke, warte mal, warum bewegt sich hier nichts, aha, so, exellent, ja, alle"}, {"id": 506, "start": 4833.56, "end": 4840.4, "text": "wieder geknackt, meint ihr, meint ihr das ist der Stecker, an dem ich gerade rumgewackelt"}, {"id": 507, "start": 4840.4, "end": 4855.76, "text": "war, erwähnt bloß den Stream nicht, warum, also mach ich nicht, aber warum, also ich werde"}, {"id": 508, "start": 4855.76, "end": 4860.92, "text": "nicht, nichts von YouTube und sonst wie, ich werde vielleicht, ja bin ich mir noch unschlüssig,"}, {"id": 509, "start": 4860.92, "end": 4867.56, "text": "ich werde wahrscheinlich reinschreiben, in den Lebenslauf ab 2012, dass ich, wie nennt"}, {"id": 510, "start": 4867.56, "end": 4881.6, "text": "man das eigentlich, neben beruflich Selbststände, nee das ergibt keinen Sinn, wie schreibt"}, {"id": 511, "start": 4881.6, "end": 4895.12, "text": "man das, dass ich seit 2012 eine eigene Firma hab und damit Zeugs mache, wie, wie, ja, frei"}, {"id": 512, "start": 4895.12, "end": 4901.28, "text": "beruflicher Medien, alter Sixheader, ey, das muss ich mir, das muss ich mir aufschreiben,"}, {"id": 513, "start": 4901.28, "end": 4931.24, "text": "da hätt ich nie drauf, nie dran gedacht, ja, Webvideoproduzent, ja, frei beruflicher"}, {"id": 514, "start": 4931.24, "end": 4952.84, "text": "Medien, ja, nee, nein, das schreibe ich so nicht, ok, ich glaube das reicht jetzt, Leute,"}, {"id": 515, "start": 4952.84, "end": 4959.04, "text": "Das reicht jetzt Leute, ich glaube das ist genug, das ist glaube ich wirklich genug."}, {"id": 516, "start": 4959.04, "end": 4960.56, "text": "Sieht sich doch kein Mensch alles durch."}, {"id": 517, "start": 4960.56, "end": 4970.16, "text": "Und hier machen wir die Rakete raus."}, {"id": 518, "start": 4970.16, "end": 4975.08, "text": "Muss eh noch kürzen, nee das knalle ich denen einfach so hin."}, {"id": 519, "start": 4975.08, "end": 4986.72, "text": "Kann jemand ein gachi emote reinschreiben, gachi bass kannst du reinschreiben zum Beispiel."}, {"id": 520, "start": 4986.72, "end": 5004.4, "text": "Ja gachi hyper gachi."}, {"id": 521, "start": 5004.4, "end": 5008.72, "text": "Überqualifiziert ist ein bescheuerter Begriff, damit ist eigentlich gemeint, den kannst"}, {"id": 522, "start": 5008.72, "end": 5016.6, "text": "nicht gebrauchen, das ist sowas wie übervorteilt, das ist auch so eine bescheuerte Formulierung."}, {"id": 523, "start": 5016.6, "end": 5043.16, "text": "Gut ich glaube das reicht jetzt, chat wenn euch noch was einfällt schreibt das ruhig"}, {"id": 524, "start": 5043.16, "end": 5052.64, "text": "in den Chat, ansonsten wollen wir mal gucken ob es irgendwelche interessanten Videos gibt."}, {"id": 525, "start": 5052.64, "end": 5063.32, "text": "Also wir hätten hier zu bieten, was ist denn das, war ja gut wo ich es aufgemacht habe,"}, {"id": 526, "start": 5063.32, "end": 5068.76, "text": "wir hätten noch dings zu bieten hier, level, nicht level keck, fire ship neues video."}, {"id": 527, "start": 5068.76, "end": 5075.44, "text": "Hast du raspberry pi krams reingekriegt, du hast recht habe ich nicht, könnte man bei"}, {"id": 528, "start": 5075.44, "end": 5089.52, "text": "iot reinschreiben aber einfach nur weil es sich, warum nicht, dns active directory ldap"}, {"id": 529, "start": 5089.52, "end": 5097.48, "text": "habe ich keine ahnung von, kann dns aber benutzen, aber von active directory ldap habe ich wirklich"}, {"id": 530, "start": 5097.48, "end": 5117.36, "text": "keinen plan."}, {"id": 531, "start": 5117.36, "end": 5122.76, "text": "Was der youtube editor für den video, wortkanal, was meinste, muss da wieder zeug rausgeschnitten"}, {"id": 532, "start": 5122.76, "end": 5131.64, "text": "werden oder was, ich will das gar nicht reinschreiben da kommt noch einer auf die idee, ich soll"}, {"id": 533, "start": 5131.64, "end": 5138.08, "text": "später active directory machen, guck mal mein eigenes video wird empfohlen, das muss"}, {"id": 534, "start": 5138.08, "end": 5145.8, "text": "ich kurz mal starten und muten im tap, was ist hier los, mit dem firefox kann man das"}, {"id": 535, "start": 5145.8, "end": 5160.64, "text": "im tap muten, video starten, view time, youtube, was wollt ihr von mir, geht mal weg, hallo"}, {"id": 536, "start": 5160.64, "end": 5170.72, "text": "leute hier ist der max und jetzt muten, exellent, view time, chefs habe ich reingeschrieben"}, {"id": 537, "start": 5170.72, "end": 5187.32, "text": "allerdings weder solstack noch chef weil ich davon zu wenig plan habe, die wahrheit wurde"}, {"id": 538, "start": 5187.32, "end": 5206.4, "text": "revealed leute, nur bei level cap"}, {"id": 539, "start": 5206.4, "end": 5233.92, "text": "was ist das, ey das ist echt gut gemacht, ich meine die beleuchtung stimmt nicht so"}, {"id": 540, "start": 5233.92, "end": 5247.52, "text": "ganz aber das ist wirklich gut gemacht"}, {"id": 541, "start": 5247.52, "end": 5272.52, "text": "das ist gut, das hat er wirklich gut gemacht"}, {"id": 542, "start": 5272.52, "end": 5294.72, "text": "wie lange hat er daran gerendert, ey welche spannenden videos da drin, must have services"}, {"id": 543, "start": 5294.72, "end": 5308.84, "text": "auf dem heim server, ok nix was ich wahrscheinlich brauche, ja die videos werden mir empfohlen"}, {"id": 544, "start": 5308.84, "end": 5332.28, "text": "aber das meiste ist mir zu hyper aktiv, also wirklich spannend, das ist ja heute noch dabei"}, {"id": 545, "start": 5332.28, "end": 5343.52, "text": "oder, blazingly fast, ja ja haben wir alles schon drin stehen, haben wir alles schon drin"}, {"id": 546, "start": 5343.52, "end": 5364.16, "text": "stehen, battlewolf haben wir alles schon drin stehen, ok was, physics sagt, hey max, hab"}, {"id": 547, "start": 5364.16, "end": 5368.36, "text": "es vorhin schon kurz geschrieben aber war dann kurz weg, mein internet geht nicht aber"}, {"id": 548, "start": 5368.36, "end": 5374.8, "text": "das ist schlecht, die fritzbox zeigt trotzdem an, dass telecom gesynced ist und ipv4 verbunden"}, {"id": 549, "start": 5374.8, "end": 5379.32, "text": "ist, ja gut das kann ja schon sein, im funktionstesterbox hängt er trotzdem bei internetverbindung"}, {"id": 550, "start": 5379.32, "end": 5389.72, "text": "dns aber habe ich schon getestet, hast du vielleicht eine idee, kriegst du eine ip,"}, {"id": 551, "start": 5389.72, "end": 5394.76, "text": "also klappt die dsl einfach, kriegst du eine ip, kann ja durchaus sein, dass du eine ip"}, {"id": 552, "start": 5394.76, "end": 5399.32, "text": "kriegst und es danach nicht weiter geht, danach die telecom gerade irgendwelche probleme,"}, {"id": 553, "start": 5399.32, "end": 5413.72, "text": "das kann ja auch sein, also ich würde einfach mal gucken ob die einwahl klappt, nee ping"}, {"id": 554, "start": 5413.72, "end": 5420.0, "text": "auf dns aber geht nicht würde ich mal so sagen oder, so interpretiere ich das, ping auf"}, {"id": 555, "start": 5420.0, "end": 5432.2, "text": "dns geht nicht, traceroute wird ihm wahrscheinlich, ja doch in dem fall könnte vielleicht traceroute"}, {"id": 556, "start": 5432.2, "end": 5438.0, "text": "sogar wirklich ein bisschen was bringen, normalerweise bringt traceroute meistens nichts aber doch"}, {"id": 557, "start": 5438.0, "end": 5441.68, "text": "in dem fall könnte es vielleicht doch, ja doch in dem fall könnte traceroute wahrscheinlich"}, {"id": 558, "start": 5441.68, "end": 5446.36, "text": "doch was bringen aber solange er keine public ip kriegt bzw. überhaupt keine ip kriegt"}, {"id": 559, "start": 5446.36, "end": 5457.32, "text": "ob bei seiner fritzbox dann weiß mir ja schon was sache ist, jo nice, ich weiß nicht ob"}, {"id": 560, "start": 5457.32, "end": 5462.4, "text": "das was taugt, taugts was, ich hab das nicht, ich hab ja wie gesagt einen dreamscreen, leute"}, {"id": 561, "start": 5462.4, "end": 5471.72, "text": "ich stehe grad vor der wahl, was soll ich mir, ok fangen wir erstmal an, wenn ich ende"}, {"id": 562, "start": 5471.72, "end": 5477.52, "text": "des jahres tatsächlich kündigen sollte, dann muss ich ja mein firmenhandy zurückgeben"}, {"id": 563, "start": 5477.52, "end": 5481.88, "text": "und bei der gelegenheit wollte ich auch mir eh jetzt schonmal ein neues handy kaufen,"}, {"id": 564, "start": 5481.88, "end": 5486.76, "text": "ein eigenes neues handy, weil ich muss ja auch die ganze zwei faktor authentifizierungs"}, {"id": 565, "start": 5486.76, "end": 5498.08, "text": "services die ich über die firmenhandy nummer laufen hab umstellen, so ich bin grad am überlegen"}, {"id": 566, "start": 5498.08, "end": 5503.12, "text": "was ich für ein handy kaufen soll, ich hatte die letzten jahre über eigentlich nur iphones"}, {"id": 567, "start": 5503.12, "end": 5508.4, "text": "aus dem grund, weil ich es nicht bezahlen musste, das heißt die grundsätzliche frage"}, {"id": 568, "start": 5508.4, "end": 5513.76, "text": "ist android oder apple aber ganz ehrlich, ich tendiere eigentlich weiterhin zum apple,"}, {"id": 569, "start": 5513.76, "end": 5519.8, "text": "ich sehe auch für mich gerade keinen irgendwie richtigen grund warum ich irgendwie umsteigen"}, {"id": 570, "start": 5519.8, "end": 5525.08, "text": "sollte und mich an was neues gewöhnen muss, der einzige richtige vorteil von android"}, {"id": 571, "start": 5525.08, "end": 5528.6, "text": "bei mir wäre jetzt, dass ich sagen könnte ja, ich könnte natürlich da deutlich mehr"}, {"id": 572, "start": 5528.6, "end": 5533.6, "text": "automatisierung und spielereien machen, ihr wisst ja sowas mach ich gerne, ios kann sich"}, {"id": 573, "start": 5533.6, "end": 5545.4, "text": "ja kaum was machen in der richtung, aber ansonsten, wahrscheinlich wirds ein iphone, dann ist"}, {"id": 574, "start": 5545.4, "end": 5555.04, "text": "halt die frage welches iphone, ich tendiere aktuell zu einem 14 pro oder einem 13 pro"}, {"id": 575, "start": 5555.04, "end": 5564.04, "text": "aber 13 pro gibts nicht mehr zu kaufen, ansonsten würde ich ansonsten, weil ich finde die sache"}, {"id": 576, "start": 5564.04, "end": 5577.68, "text": "mit 120 hertz ganz cool und diese komische dynamic island geschichte oder so, brauche"}, {"id": 577, "start": 5577.68, "end": 5589.36, "text": "ich noch beim besten will nicht, aber ok, was kostet denn das aktuell, apple willst aber"}, {"id": 578, "start": 5589.36, "end": 5600.36, "text": "wissen ey, alter was sind denn das für smartphone preise man, dafür hast du, für das hast du"}, {"id": 579, "start": 5600.36, "end": 5604.44, "text": "letztes jahr noch high end grafikkarten gekriegt, heut kostet nicht high end grafikkarten das"}, {"id": 580, "start": 5604.44, "end": 5618.36, "text": "doppelte und das iphone ist doppelt so teuer wie davor, schau wirklich mal rein ok, china"}, {"id": 581, "start": 5618.36, "end": 5627.88, "text": "chinesen kram, haben die sich gedacht, jetzt wo apple vorne diese komischen kameras drauf"}, {"id": 582, "start": 5627.88, "end": 5638.2, "text": "hat, jetzt machen wir das auch oder wie, dabei war das bei apple schon ne ziemlich beschissene"}, {"id": 583, "start": 5638.2, "end": 5655.96, "text": "idee, dass das ding jetzt ohne hülle nicht mehr flach auf dem tisch liegt, hypercharge"}, {"id": 584, "start": 5655.96, "end": 5660.04, "text": "ich kauf mir nix von ebay klein anzeigen, mal ganz davon abgesehen ebay klein anzeigen"}, {"id": 585, "start": 5660.04, "end": 5663.4, "text": "hat mich ja sogar gebannt, ich kann doch nicht mal was drauf kaufen, sie haben mich gebannt"}, {"id": 586, "start": 5663.4, "end": 5692.04, "text": "obwohl ich nicht mal einen account hatte, ist auch geil oder, can't wait, tja, na gut, warum"}, {"id": 587, "start": 5692.04, "end": 5700.76, "text": "haben die hier eigentlich so nen dickshot gemacht, von dem typ, dass man hier so richtig schön"}, {"id": 588, "start": 5700.76, "end": 5717.28, "text": "den schritt gefilmt hat, warum, so und das ist schon ganz schön teuer, 13 pro, ah das"}, {"id": 589, "start": 5717.28, "end": 5726.92, "text": "ist, wow, general überholt und dann fast so teuer wie das 14er, nee das ist nix oder,"}, {"id": 590, "start": 5726.92, "end": 5746.32, "text": "das ist doch nix, ach guck mal ist doch neu, nee das sind warehouse deals, ach das sind"}, {"id": 591, "start": 5746.32, "end": 5768.56, "text": "auch warehouse deals, das ist used, das ist auch used, aha, ok, keine ahnung, kauf mir"}, {"id": 592, "start": 5768.56, "end": 5780.8, "text": "den iphone 13, bei aliexpress jetzt, wimpern, verlängerung, zubehör, alles klar dann haben"}, {"id": 593, "start": 5780.8, "end": 5793.64, "text": "die bestimmt auch iphone 13 pro, easy, kein case, auch nicht iphone, alter das kostet"}, {"id": 594, "start": 5793.64, "end": 5807.72, "text": "in china einfach 2000 euro, aber immerhin 5 euro rabatt, möb, dankeschön für den sub,"}, {"id": 595, "start": 5807.72, "end": 5837.32, "text": "hattet statt zu gucken, also ich hab wieder hier die hälfte übersehen, möb, danke"}, {"id": 596, "start": 5837.32, "end": 5844.88, "text": "für den sub, seriousmax auch, an dich danke, eclipse, nee, eclipsi oder so, ähnlich, ich"}, {"id": 597, "start": 5844.88, "end": 5853.76, "text": "hoffe ich spreche das richtig aus, dankeschön für den sub, gestern gestern gut, da haben"}, {"id": 598, "start": 5853.76, "end": 5861.24, "text": "gar nicht so viel übersehen, ich wusste nicht ob ihr es wisst, ja aber ich erwähne"}, {"id": 599, "start": 5861.24, "end": 5866.12, "text": "das mal, weil ich mache zu wenig sellout, falls ihr amazon prime habt und euch das noch"}, {"id": 600, "start": 5866.12, "end": 5871.56, "text": "nicht klar ist, wusste ihr dass ihr mit amazon prime einen streamer eurer wahl einmal im monat"}, {"id": 601, "start": 5871.56, "end": 5877.28, "text": "kostenlos mit einem prime sub unterstützen könnt, nicht dass der noch verfällt, das"}, {"id": 602, "start": 5877.28, "end": 5889.64, "text": "wollen wir ja nicht, any primers, genau, any primers, wahrscheinlich, wahrscheinlich"}, {"id": 603, "start": 5889.64, "end": 5897.12, "text": "hol ich mir wirklich wieder ein iphone, nice leute, hacky, dankeschön für den sub, 3"}, {"id": 604, "start": 5897.12, "end": 5903.76, "text": "10 monat am start, juicybit zum ersten mal, pog, dankeschön, nice, pausierungschamp,"}, {"id": 605, "start": 5903.76, "end": 5913.92, "text": "wollen wir noch das fireship video gucken, Leute, devil's argent 11 und der rezo boy"}, {"id": 606, "start": 5913.92, "end": 5922.2, "text": "auch am start, schön dass ihr da seid, danke für den sub, hi iq subscription, chat iq steigt"}, {"id": 607, "start": 5922.2, "end": 5931.36, "text": "wieder ins unermessliche, wisst ihr jeder sub einmal iq++ für den chat, das scam train"}, {"id": 608, "start": 5931.36, "end": 5941.36, "text": "fasst schon auf level 2, hast du geguckt ob du public ip kriegst, das komische ist dass"}, {"id": 609, "start": 5941.36, "end": 5947.16, "text": "er mir in der box aber trotzdem ein externer ip anzeigt, kannst du die externe ip pingen,"}, {"id": 610, "start": 5947.16, "end": 5954.0, "text": "klingt jetzt doof, müsste gehen weil es lokal auf der fritzbox ist, aber man weiß ja nie"}, {"id": 611, "start": 5954.0, "end": 5959.68, "text": "ob es auch wirklich noch drauf ist, überall auf dem interface, oder dass es nur das mist"}, {"id": 612, "start": 5959.68, "end": 5968.2, "text": "anzeigt, wobei ich weiß nicht, blockt das nicht die fritzbox, egal von wo das kommt"}, {"id": 613, "start": 5968.2, "end": 5977.72, "text": "wenn man die externe ip pingt, zeigt nur die fritzbox auch, na gut der nächste, deswegen"}, {"id": 614, "start": 5977.72, "end": 5982.4, "text": "ist halt race route kacke, der nächste router könnte durchaus einfach lcmp zeug blocken,"}, {"id": 615, "start": 5982.4, "end": 5992.0, "text": "aber ist egal, ich vermute mal es liegt an der telekom, hast du irgendwas gemacht in"}, {"id": 616, "start": 5992.0, "end": 5996.12, "text": "letzter zeit mit der fritzbox, wahrscheinlich nicht, die ging gestern und heute ist die kaputt"}, {"id": 617, "start": 5996.12, "end": 6002.6, "text": "oder, das sieht mir sehr nach telekom probleme aus ehrlich gesagt, wenn die einwahl geht"}, {"id": 618, "start": 6002.6, "end": 6023.84, "text": "und du ne public ip kriegst, so komm wir gucken jetzt noch, ping auf die ex, also ich würde"}, {"id": 619, "start": 6023.84, "end": 6029.6, "text": "fast vermuten es liegt davor, die einwahl geht und es geht ab quasi, ab dem ersten hopp"}, {"id": 620, "start": 6029.6, "end": 6033.24, "text": "von der telekom nicht richtig weiter, vielleicht oder auch ab dem zweiten, also man weiß es"}, {"id": 621, "start": 6033.24, "end": 6042.04, "text": "ja nicht genau, also ich vermute das liegt an der telekom, du könntest mal gucken, obbei"}, {"id": 622, "start": 6042.04, "end": 6051.04, "text": "ne bringt ja nichts, hätten wir bei race route wahrscheinlich schon gesehen, ich denke es"}, {"id": 623, "start": 6051.04, "end": 6058.56, "text": "liegt an der telekom, ja das wird an der telekom liegen, die haben probleme wahrscheinlich,"}, {"id": 624, "start": 6058.56, "end": 6067.88, "text": "wahrscheinlich ist dann dein erster provider hopp router abgekackt oder was auch immer"}, {"id": 625, "start": 6067.88, "end": 6072.72, "text": "oder irgendwas lokal, wandermaus, danke schon für den sub, also ich würde mich bei der"}, {"id": 626, "start": 6072.72, "end": 6077.44, "text": "telekom wenden, ich glaube nicht das es an dir liegt, ok wollen wir noch das fireship"}, {"id": 627, "start": 6077.44, "end": 6091.44, "text": "video gucken, aber noch fireship, how to improve react performance, wo kostüm, was könnte"}, {"id": 628, "start": 6091.44, "end": 6098.12, "text": "ich denn, was könnte ich denn gut, als was könnte ich mich denn gut verkleiden, verkleiden,"}, {"id": 629, "start": 6098.12, "end": 6107.72, "text": "ist pepo fat gruselig genug, da ziehe ich mir einfach ein grünes t-shirt, blaues t-shirt"}, {"id": 630, "start": 6107.72, "end": 6126.32, "text": "an, doch wir sind fertig patrick, wir sind fertig, wie wäre es wenn ich als guter stehe,"}, {"id": 631, "start": 6126.32, "end": 6134.8, "text": "da müsste ich mich aber ganz schön roleplayen für oder, bist du überhaupt noch pepo fat"}, {"id": 632, "start": 6134.8, "end": 6141.76, "text": "genug, naja ich habe mein ziel mit unter 90 bis ende des jahres noch nicht erreicht,"}, {"id": 633, "start": 6141.76, "end": 6147.96, "text": "ich meine ich habe angefangen bei 108,5 und ich bin jetzt relativ lange schon so bei 92"}, {"id": 634, "start": 6147.96, "end": 6164.68, "text": "oder 91,8 oder 92,2, das schwankt, ok wir gucken jetzt noch mal das fireship video, was"}, {"id": 635, "start": 6164.68, "end": 6186.56, "text": "war denn, ok fireship erzähl uns was, immer tons of money ist nie verkehrt, hast du schon"}, {"id": 636, "start": 6186.56, "end": 6194.8, "text": "mal, wie es, das ist dieser, ja ich habe sogar, ob das habe ich so, nee habe ich nicht, habe"}, {"id": 637, "start": 6194.8, "end": 6203.24, "text": "ich nicht, weil die microsoft c++ extensions nur fürs offizielle wishlist studio code funktionieren,"}, {"id": 638, "start": 6203.24, "end": 6211.12, "text": "also ich habe das schon probiert ja aber ich verwende es nicht, weil das c++ plugin irgendwelche"}, {"id": 639, "start": 6211.12, "end": 6217.12, "text": "proprietären microsoft shit enthält, das nur mit dem offiziellen wishlist studio code"}, {"id": 640, "start": 6217.12, "end": 6226.08, "text": "geht, loop guard, ach nee, nee, loot, loot guard, eigentlich schon für den zapp, iacu"}, {"id": 641, "start": 6226.08, "end": 6250.88, "text": "subscription, gehen wir mal weiter, ich habe so keinen plan vom react ökosystem, es rauscht"}, {"id": 642, "start": 6250.88, "end": 6263.32, "text": "so, gehen wir mal weiter, is that genius, ok, here to feel inspired by features bride and"}, {"id": 643, "start": 6263.32, "end": 6271.88, "text": "remix like nest that is about to hear told"}, {"id": 644, "start": 6271.88, "end": 6275.72, "text": "tonight about you, you feel inspired by those features"}, {"id": 645, "start": 6275.72, "end": 6279.48, "text": "and elsewhere, interesting though is that less than a year ago, shopify came out with"}, {"id": 646, "start": 6279.48, "end": 6281.64, "text": "mit ihrem eigenen React-Framework, Hydrogen."}, {"id": 647, "start": 6281.64, "end": 6282.66, "text": "So wie in Next 13,"}, {"id": 648, "start": 6282.66, "end": 6284.66, "text": "Hydrogen nutzt React-Server-Komponenten,"}, {"id": 649, "start": 6284.66, "end": 6286.66, "text": "das ist die offizielle Lösung des React-Teames"}, {"id": 650, "start": 6286.66, "end": 6287.66, "text": "für Server-Side-Rendering."}, {"id": 651, "start": 6287.66, "end": 6289.66, "text": "Wie viele..."}, {"id": 652, "start": 6289.66, "end": 6291.66, "text": "Ich frage mal gar nicht,"}, {"id": 653, "start": 6291.66, "end": 6293.66, "text": "wie viele JavaScript-Frameworks"}, {"id": 654, "start": 6293.66, "end": 6295.66, "text": "gibt es eigentlich, weil das"}, {"id": 655, "start": 6295.66, "end": 6297.66, "text": "nähert sich der Unendlichkeit."}, {"id": 656, "start": 6297.66, "end": 6299.66, "text": "Aber allein schon im ganzen"}, {"id": 657, "start": 6299.66, "end": 6301.66, "text": "React-Ökosystem,"}, {"id": 658, "start": 6301.66, "end": 6303.66, "text": "wie viele gibt's da mittlerweile eigentlich?"}, {"id": 659, "start": 6303.66, "end": 6329.66, "text": "Da blickt doch keiner mehr durch."}, {"id": 660, "start": 6329.66, "end": 6332.66, "text": "Next.js, 13 soll ja auch 700 mal"}, {"id": 661, "start": 6332.66, "end": 6334.66, "text": "schneller sein als Webpack."}, {"id": 662, "start": 6334.66, "end": 6336.66, "text": "Ja, nicht Next.js 13, oder?"}, {"id": 663, "start": 6336.66, "end": 6338.66, "text": "Sondern Mono-Build"}, {"id": 664, "start": 6338.66, "end": 6340.66, "text": "oder Mono-Pack, oder wie dieser"}, {"id": 665, "start": 6340.66, "end": 6342.66, "text": "Kram hieß."}, {"id": 666, "start": 6352.66, "end": 6354.66, "text": "Shopee!"}, {"id": 667, "start": 6354.66, "end": 6356.66, "text": "Endlich mal einer, der ein gutes Web-Framework"}, {"id": 668, "start": 6356.66, "end": 6358.66, "text": "verwendet. Ruby on Rails ist"}, {"id": 669, "start": 6358.66, "end": 6360.66, "text": "POG. Ich mein, ich würd's jetzt nicht mal"}, {"id": 670, "start": 6360.66, "end": 6362.66, "text": "verwenden, aber ich mag Ruby on Rails."}, {"id": 671, "start": 6362.66, "end": 6377.66, "text": "GitLab ist Ruby on Rails, das weiß ich."}, {"id": 672, "start": 6392.66, "end": 6394.66, "text": "Chat sagt, er wird nie wieder..."}, {"id": 673, "start": 6394.66, "end": 6396.66, "text": "äh, nicht Chat."}, {"id": 674, "start": 6396.66, "end": 6398.66, "text": "Extreme aus dem Chat sagt, er wird nie wieder"}, {"id": 675, "start": 6398.66, "end": 6400.66, "text": "JavaScript anfassen, sondern nur noch WebAssembly."}, {"id": 676, "start": 6400.66, "end": 6402.66, "text": "Ja, das Problem ist, ganz ohne JavaScript"}, {"id": 677, "start": 6402.66, "end": 6404.66, "text": "geht's halt trotzdem nicht, ne?"}, {"id": 678, "start": 6404.66, "end": 6406.66, "text": "Wie willst du aus WebAssembly"}, {"id": 679, "start": 6406.66, "end": 6408.66, "text": "beispielsweise irgendwelche Webseiten-Anpassungen"}, {"id": 680, "start": 6408.66, "end": 6422.66, "text": "machen?"}, {"id": 681, "start": 6422.66, "end": 6438.66, "text": "Way too dank, Leute."}, {"id": 682, "start": 6438.66, "end": 6440.66, "text": "Mikrofon knackt nicht mehr"}, {"id": 683, "start": 6440.66, "end": 6442.66, "text": "als fuck ab. Was macht's denn jetzt schon"}, {"id": 684, "start": 6442.66, "end": 6444.66, "text": "wieder?"}, {"id": 685, "start": 6444.66, "end": 6446.66, "text": "Was ist denn jetzt?"}, {"id": 686, "start": 6446.66, "end": 6448.66, "text": "Hat sich doch überhaupt nichts geändert, oder?"}, {"id": 687, "start": 6458.66, "end": 6460.66, "text": "Ich hab ne Idee."}, {"id": 688, "start": 6460.66, "end": 6462.66, "text": "Ich schließ mal morgen"}, {"id": 689, "start": 6462.66, "end": 6464.66, "text": "das Mikrofon"}, {"id": 690, "start": 6466.66, "end": 6468.66, "text": "an das andere"}, {"id": 691, "start": 6468.66, "end": 6470.66, "text": "Audio-Interface an."}, {"id": 692, "start": 6470.66, "end": 6472.66, "text": "Und dann gucken wir mal."}, {"id": 693, "start": 6478.66, "end": 6480.66, "text": "Müssen wir dann mal schauen, ob das..."}, {"id": 694, "start": 6482.66, "end": 6484.66, "text": "Naja, werden wir dann mal schauen, ob das"}, {"id": 695, "start": 6484.66, "end": 6486.66, "text": "gescheit funktioniert."}, {"id": 696, "start": 6486.66, "end": 6488.66, "text": "Ja."}, {"id": 697, "start": 6488.66, "end": 6490.66, "text": "Ja."}, {"id": 698, "start": 6490.66, "end": 6492.66, "text": "Ja."}, {"id": 699, "start": 6492.66, "end": 6494.66, "text": "Ja."}, {"id": 700, "start": 6494.66, "end": 6496.66, "text": "Ja."}, {"id": 701, "start": 6496.66, "end": 6498.66, "text": "Ja."}, {"id": 702, "start": 6498.66, "end": 6500.66, "text": "Ja, werden wir dann mal schauen, ob das gescheit"}, {"id": 703, "start": 6500.66, "end": 6502.66, "text": "funktioniert. Ich mein..."}, {"id": 704, "start": 6502.66, "end": 6504.66, "text": "Sounds..."}, {"id": 705, "start": 6510.66, "end": 6512.66, "text": "Ach, ich hab' das gar nicht mehr angeschlossen,"}, {"id": 706, "start": 6512.66, "end": 6514.66, "text": "dull."}, {"id": 707, "start": 6520.66, "end": 6522.66, "text": "Hin und wieder Störgeräusche, okay."}, {"id": 708, "start": 6524.66, "end": 6526.66, "text": "Vielleicht, das ist aber auch"}, {"id": 709, "start": 6526.66, "end": 6531.88, "text": "Einfach nur twitch heute abend weil ich habe doch normalerweise nie probleme"}, {"id": 710, "start": 6532.66, "end": 6537.54, "text": "Vielleicht das ist aber auch einfach nur twitch heute abend weil ich habe doch"}, {"id": 711, "start": 6539.38, "end": 6541.38, "text": "Hört sich auch nach nix an"}, {"id": 712, "start": 6543.34, "end": 6545.34, "text": "Vielleicht muss ich mal meinen"}, {"id": 713, "start": 6546.74, "end": 6548.74, "text": "Streaming game absteppen hier"}, {"id": 714, "start": 6548.74, "end": 6554.18, "text": "Wackelkontakt, ja vielleicht"}, {"id": 715, "start": 6557.98, "end": 6559.98, "text": "Ich könnte hier mal ein bisschen"}, {"id": 716, "start": 6560.98, "end": 6562.98, "text": "ein bisschen dran wackeln oder so aber"}, {"id": 717, "start": 6562.98, "end": 6568.98, "text": "Ja, ich habe keine Ahnung"}, {"id": 718, "start": 6574.98, "end": 6576.98, "text": "Keine Ahnung"}, {"id": 719, "start": 6580.98, "end": 6584.98, "text": "Müssen wir mal gucken also ich update gerade keine"}, {"id": 720, "start": 6584.98, "end": 6589.98, "text": "Sinnvolle Erklärung für"}, {"id": 721, "start": 6591.98, "end": 6595.98, "text": "Hast du schon mit roher Gewalt gesehen was soll ich denn wo soll ich draufhauen"}, {"id": 722, "start": 6608.98, "end": 6612.98, "text": "Was in der Nähe ist so ok ich muss mir das jetzt mal kurz noch mal anschauen"}, {"id": 723, "start": 6612.98, "end": 6619.74, "text": "Anschauen anhören ist denn ist das nicht in der Aufnahme gerade drinne ok ich muss mir das jetzt mal kurz"}, {"id": 724, "start": 6619.98, "end": 6621.98, "text": "Also ich ich höre dann nichts"}, {"id": 725, "start": 6621.98, "end": 6628.98, "text": "Ist das so bla bla bla bla test test bla bla bla bla bla bla bla test test"}, {"id": 726, "start": 6629.98, "end": 6631.98, "text": "bla bla bla bla bla bla test test"}, {"id": 727, "start": 6632.98, "end": 6634.98, "text": "bla bla bla bla bla bla test test"}, {"id": 728, "start": 6636.98, "end": 6639.98, "text": "Keine Ahnung gibt es ein neues Heartbleed"}, {"id": 729, "start": 6639.98, "end": 6647.98, "text": "Bei dem ich höre da nichts war es sehr schön zu hören"}, {"id": 730, "start": 6647.98, "end": 6662.98, "text": "Also ich könnte das mal als andere audio interface anschließen aber dann muss ich gucken wie ich einen Rechner kriege von da"}, {"id": 731, "start": 6677.98, "end": 6680.98, "text": "Störgeräusche ok ok jetzt können wir hier"}, {"id": 732, "start": 6683.98, "end": 6688.98, "text": "Ist das nicht in der Aufnahme gerade drinne ok ich muss mir das jetzt mal kurz nochmal"}, {"id": 733, "start": 6688.98, "end": 6690.98, "text": "Da hatten wir es doch doch"}, {"id": 734, "start": 6692.98, "end": 6694.98, "text": "Tatsächlich das hat ein bisschen aussetzer"}, {"id": 735, "start": 6696.98, "end": 6698.98, "text": "Ist das irgendwie mein"}, {"id": 736, "start": 6698.98, "end": 6701.98, "text": "Noisegate oder sowas rumspackt"}, {"id": 737, "start": 6705.98, "end": 6707.98, "text": "Man weiß ja nie"}, {"id": 738, "start": 6709.98, "end": 6715.98, "text": "Die Lautstärke richtig so test test test test test test den jetzt müsste eigentlich gehen"}, {"id": 739, "start": 6715.98, "end": 6717.98, "text": "Keine Ahnung"}, {"id": 740, "start": 6723.98, "end": 6725.98, "text": "Am ende noch mehr"}, {"id": 741, "start": 6727.98, "end": 6729.98, "text": "Also ich ich höre da nichts"}, {"id": 742, "start": 6729.98, "end": 6731.98, "text": "Was"}, {"id": 743, "start": 6731.98, "end": 6733.98, "text": "Ich höre da nichts"}, {"id": 744, "start": 6733.98, "end": 6735.98, "text": "Also ich höre da nichts"}, {"id": 745, "start": 6735.98, "end": 6737.98, "text": "Also ich höre da nichts"}, {"id": 746, "start": 6737.98, "end": 6739.98, "text": "Also ich höre da nichts"}, {"id": 747, "start": 6739.98, "end": 6741.98, "text": "Also ich höre da nichts"}, {"id": 748, "start": 6741.98, "end": 6743.98, "text": "Also ich ich höre da nichts"}, {"id": 749, "start": 6743.98, "end": 6745.98, "text": "Also ich ich höre da nichts"}, {"id": 750, "start": 6745.98, "end": 6747.98, "text": "Wow"}, {"id": 751, "start": 6747.98, "end": 6749.98, "text": "Also ich ich höre da nichts"}, {"id": 752, "start": 6749.98, "end": 6751.98, "text": "Also ich ich höre da nichts"}, {"id": 753, "start": 6751.98, "end": 6753.98, "text": "Also ich ich höre da nichts"}, {"id": 754, "start": 6753.98, "end": 6757.98, "text": "Ok da ist irgendwo irgendwas kaputt bei mir"}, {"id": 755, "start": 6761.98, "end": 6764.98, "text": "Und das liegt das liegt nicht an meinen Twitch Settings"}, {"id": 756, "start": 6764.98, "end": 6769.98, "text": "Und das liegt auch nicht an meinen OBS Filtern ich meine da hat sich ja nichts getan seit gestern"}, {"id": 757, "start": 6771.98, "end": 6773.98, "text": "Ich speicher mir das mal"}, {"id": 758, "start": 6775.98, "end": 6780.98, "text": "Es muss ich ja es muss ja irgendwas sein ja vielleicht bin ich ein paar Mal zu viel übers Kabel gerollt oder so"}, {"id": 759, "start": 6782.98, "end": 6784.98, "text": "Kein Plan"}, {"id": 760, "start": 6784.98, "end": 6791.98, "text": "Kein Plan weil normalerweise gibt es ja keine Probleme"}, {"id": 761, "start": 6794.98, "end": 6796.98, "text": "Da war es auch wieder ordentlich"}, {"id": 762, "start": 6799.98, "end": 6803.98, "text": "Ich lasse mal kurz mitlaufen sagt sagt mir wenn es wieder gewesen ist"}, {"id": 763, "start": 6805.98, "end": 6811.98, "text": "Dann gucke ich nämlich dann gucke ich nämlich hier mal in der Audacity Aufnahme ob das ob das damit was zu tun hat"}, {"id": 764, "start": 6811.98, "end": 6813.98, "text": "Ja"}, {"id": 765, "start": 6815.98, "end": 6818.98, "text": "Schauen wir mal ist natürlich ist natürlich jetzt blöd das"}, {"id": 766, "start": 6820.98, "end": 6823.98, "text": "Wenn wir das jetzt irgendwie live live on stream debuggen müssen"}, {"id": 767, "start": 6825.98, "end": 6830.98, "text": "Dabei haben wir eigentlich gar nicht mehr großartig wie gesagt ich weiß ja nicht was ich heute noch machen soll wir sind wir sind ja eigentlich fertig damit"}, {"id": 768, "start": 6831.98, "end": 6835.98, "text": "Jetzt pass auf jetzt jetzt habe ich das hier laufen und jetzt kommt wahrscheinlich nichts"}, {"id": 769, "start": 6835.98, "end": 6839.98, "text": "Das geht jetzt schon naja mal gucken es gibt eigentlich nichts mehr was wir machen können"}, {"id": 770, "start": 6841.98, "end": 6844.98, "text": "Einzige was mir einfällt ich könnte man das audio interface tatsächlich mal raus"}, {"id": 771, "start": 6845.98, "end": 6850.98, "text": "Döpseln und wieder rein stöpseln ob das was bringt"}, {"id": 772, "start": 6854.98, "end": 6855.98, "text": "Ah"}, {"id": 773, "start": 6855.98, "end": 6859.98, "text": "Also ich mein wenn es die Aufnahme jetzt hier nebenbei fixt was ja eigentlich nicht sein kann"}, {"id": 774, "start": 6859.98, "end": 6866.98, "text": "Also am bewegen liegt es nicht leute ich ich wackele jetzt hier hin und her und es ist überhaupt gar kein Problem"}, {"id": 775, "start": 6870.98, "end": 6874.98, "text": "Also ich bewege jetzt ja alles kabel und sonst wie das ist wahrscheinlich sogar"}, {"id": 776, "start": 6875.98, "end": 6879.98, "text": "Einen Winners ding oder tatsächlich in den wackelkontakt irgendwas an anderer stelle"}, {"id": 777, "start": 6879.98, "end": 6889.98, "text": "Also gute gute frage ich werde das audio interface mal rein raus machen und mal windows neu starten das hilft ja das wirkt ja das wirkt ja wunder oftmals windows neu starten"}, {"id": 778, "start": 6895.98, "end": 6904.98, "text": "Im clip hast du dazu auch was im browser parallel gemacht okay jetzt reloaden wir einfach mal wir reloaden jetzt ganz wild irgendwie"}, {"id": 779, "start": 6904.98, "end": 6908.98, "text": "Ob das damit was zu tun hat ich mein man weiß ja man weiß ja hier nie"}, {"id": 780, "start": 6912.98, "end": 6918.98, "text": "Wait a minute wenn ich den browser reloade ich meine man weiß ja man weiß ja hier nie"}, {"id": 781, "start": 6923.98, "end": 6929.98, "text": "Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat"}, {"id": 782, "start": 6929.98, "end": 6934.98, "text": "Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat"}, {"id": 783, "start": 6935.98, "end": 6938.98, "text": "Wait a minute wir reloaden jetzt ganz wild irgendwelche seiten ob das damit was zu tun hat"}, {"id": 784, "start": 6939.98, "end": 6940.98, "text": "What the fuck"}, {"id": 785, "start": 6946.98, "end": 6951.98, "text": "Wenn meine cpu was macht das ist irgendein windows shit oder"}, {"id": 786, "start": 6951.98, "end": 6956.98, "text": "Das einzige was ich gemacht habe die letzten tage ist ich habe modern warfare installiert"}, {"id": 787, "start": 6957.98, "end": 6959.98, "text": "Ist es der modern warfare anti cheat oder was"}, {"id": 788, "start": 6960.98, "end": 6961.98, "text": "Kekkel"}, {"id": 789, "start": 6968.98, "end": 6969.98, "text": "Aha"}, {"id": 790, "start": 6971.98, "end": 6972.98, "text": "Safe"}, {"id": 791, "start": 6972.98, "end": 6976.98, "text": "Aha safe"}, {"id": 792, "start": 6983.98, "end": 6988.98, "text": "Klar habe ich mw2 beendet okay mal gucken ob wir das nachvollziehen können"}, {"id": 793, "start": 6989.98, "end": 6993.98, "text": "Ich ich reload jetzt noch mal ganz die ganze zeit hier meinen browser"}, {"id": 794, "start": 6994.98, "end": 7000.98, "text": "Irgendwelche sachen reloaden bis bis in cpu na gut ich mein cpu last können wir auch antarbeit ich leute"}, {"id": 795, "start": 7000.98, "end": 7002.98, "text": "Cpu last können wir auch antarbeit ich generieren"}, {"id": 796, "start": 7006.98, "end": 7011.98, "text": "Wobei dafür brauche ich noch nicht mal hier cpu last können wir antarbeit ich generieren echo"}, {"id": 797, "start": 7012.98, "end": 7017.98, "text": "2 hoch 1 2 3 4 nach bc"}, {"id": 798, "start": 7018.98, "end": 7020.98, "text": "Ach nee bc haben wir nicht"}, {"id": 799, "start": 7022.98, "end": 7024.98, "text": "Wie erzeugt man denn auf windows last"}, {"id": 800, "start": 7025.98, "end": 7026.98, "text": "Irgendjemand eine schlaue idee"}, {"id": 801, "start": 7026.98, "end": 7030.98, "text": "War das ist das jetzt wieder beim windows beim beim wenn ich den browser reloade"}, {"id": 802, "start": 7032.98, "end": 7033.98, "text": "Macht es dann wieder dinger"}, {"id": 803, "start": 7034.98, "end": 7036.98, "text": "Anhören ist das"}, {"id": 804, "start": 7038.98, "end": 7039.98, "text": "Oder jetzt nicht mehr"}, {"id": 805, "start": 7040.98, "end": 7041.98, "text": "Es war wieder leicht"}, {"id": 806, "start": 7042.98, "end": 7044.98, "text": "Ok ok ok ok ok"}, {"id": 807, "start": 7047.98, "end": 7052.98, "text": "Und jetzt jetzt macht er richtig jetzt macht er richtig fett jetzt macht er richtig fett ich auch"}, {"id": 808, "start": 7052.98, "end": 7055.98, "text": "Gerade und ein bisschen cpu last wenn die vm gestartet wird"}, {"id": 809, "start": 7060.98, "end": 7063.98, "text": "Das juckt das juckt jetzt ja"}, {"id": 810, "start": 7063.98, "end": 7068.98, "text": "Ja"}, {"id": 811, "start": 7074.98, "end": 7077.98, "text": "interessant interessant ok"}, {"id": 812, "start": 7079.98, "end": 7082.98, "text": "Waren wir mal waren wir mal cpu last"}, {"id": 813, "start": 7085.98, "end": 7088.98, "text": "So jetzt haben wir cpu last"}, {"id": 814, "start": 7088.98, "end": 7104.88, "text": "So, jetzt haben wir CPU-Last, guckt hier, ist es jetzt am abkacken, test, test, test,"}, {"id": 815, "start": 7104.88, "end": 7118.44, "text": "test, test, test, nope, nix, also CPU-Last allein ist es schonmal nicht, ok, CPU-Last"}, {"id": 816, "start": 7118.44, "end": 7128.7, "text": "alleine ist es nicht, so, weil wir haben jetzt, wir haben jetzt ganz schön die CPU-Last,"}, {"id": 817, "start": 7128.7, "end": 7139.66, "text": "also mehr macht es der Browser, ist es Disk, ist es Disk IO, vielleicht, äh, irgendwas"}, {"id": 818, "start": 7139.66, "end": 7150.26, "text": "aus den Ideen oder so, mal, wie viel Platz haben wir hier noch, ah, haben wir noch genug,"}, {"id": 819, "start": 7150.26, "end": 7168.88, "text": "def zero, äh, oder machen wir so hier, keckel.bin, aber ich muss Disk IO auf C wahrscheinlich"}, {"id": 820, "start": 7168.88, "end": 7175.5, "text": "machen, macht das irgendwas, ne, oder, alles gut, also ich mein jetzt ist der Rechner,"}, {"id": 821, "start": 7175.5, "end": 7183.18, "text": "der Rechner ist jetzt ordentlich ausgelastet, ok, das interessiert den nicht, ok, ok, Disk"}, {"id": 822, "start": 7183.18, "end": 7192.34, "text": "IO auf C müssen wir machen, Disk IO auf C, wie mach ich denn, wie macht man, wie macht"}, {"id": 823, "start": 7192.34, "end": 7199.82, "text": "man Disk IO unter Windows, Dateien kopieren, oder, Dateien kopieren, haben wir hier irgendwas"}, {"id": 824, "start": 7199.82, "end": 7220.54, "text": "größeres, was ich kopieren kann, details, ne, Desktop, size, viele kleine Dateien, viele"}, {"id": 825, "start": 7220.54, "end": 7235.94, "text": "kleine Dateien, wo hab ich viele kleine Dateien, hier, komm, mal jetzt einfach mal nen Ordner,"}, {"id": 826, "start": 7235.94, "end": 7253.02, "text": "der sich KekWaite nennt, ah, CPU-Auslastung lassen wir, macht das irgendwas, hat das irgendwelche"}, {"id": 827, "start": 7253.02, "end": 7271.62, "text": "Auswirkungen gehabt, ok, KekWaite wird wieder gelöscht, Chrome, Chrome hat viele Files,"}, {"id": 828, "start": 7271.62, "end": 7284.18, "text": "das können wir kopieren, Chrome, Chromium kopieren wir, ich glaub ich hab kein, ich"}, {"id": 829, "start": 7284.18, "end": 7295.14, "text": "glaub ich hab kein Node Modules hier drauf, aber das, was, wait a minute, ist das vielleicht"}, {"id": 830, "start": 7295.14, "end": 7306.62, "text": "das Problem, dass meine Festplatte voll ist, ne, die ist 18 Gigabyte, das reicht dafür"}, {"id": 831, "start": 7306.62, "end": 7322.02, "text": "bloß nicht, na geil, ne, ne, 18, 18G müssen noch reichen, ich will meinen Rechner nicht"}, {"id": 832, "start": 7322.02, "end": 7334.06, "text": "statten, hier sind viele kleine Files drin, ok, copy, da, excellent, beste, so wie schaut"}, {"id": 833, "start": 7334.06, "end": 7339.5, "text": "es jetzt aus, so wie schaut es jetzt aus, juckt es überhaupt nicht, Leute wisst ihr"}, {"id": 834, "start": 7339.5, "end": 7344.74, "text": "was, ich glaub ich werd mal neu starten und wir gucken ob das morgen immer noch da ist,"}, {"id": 835, "start": 7344.74, "end": 7355.22, "text": "das ist dem hier egal, es ist aber schon ganz schön langsam, obwohl es ne SSD, also ich"}, {"id": 836, "start": 7355.22, "end": 7359.9, "text": "mein das ist ne NVMe SSD, der sollte auch kleine Dateien ein bisschen schneller kopieren,"}, {"id": 837, "start": 7359.9, "end": 7369.9, "text": "obbei es ist immer, es ist Windows Zeug, wer weiß, wer weiß, ey Leute ich sag euch ohne"}, {"id": 838, "start": 7369.9, "end": 7377.46, "text": "Scheiß, das ist der Modern Warfare Anti-Cheat, ich hab das zum ersten mal gestartet nach"}, {"id": 839, "start": 7377.46, "end": 7397.06, "text": "dem Stream am Sonntag, und da war doch noch nix oder, am Sonntag war noch nix, also ich"}, {"id": 840, "start": 7397.06, "end": 7403.78, "text": "mein das ist ja irgendein Rootkit Anti-Cheat oder sowas, ja ich hab ja auch nicht im Browser"}, {"id": 841, "start": 7403.78, "end": 7420.26, "text": "rumgeklickt, ah im Browser, im Browser rumklicken ist anscheinend gefährlich hier, guckt hier,"}, {"id": 842, "start": 7420.26, "end": 7426.5, "text": "Browser rumklicken machts kaputt, Windows Update, neues Soundtreiber, Quatsch was,"}, {"id": 843, "start": 7426.5, "end": 7436.38, "text": "was soll denn da passiert sein in der Zwischenzeit, ich hab da nix geupdatet, ich mach mal kurz"}, {"id": 844, "start": 7436.38, "end": 7442.14, "text": "das Audio Interface rein und raus, man weiß ja, man weiß ja nicht, doch vielleicht was"}, {"id": 845, "start": 7442.14, "end": 7457.3, "text": "ist, so jetzt, oh war das überhaupt das Audio Interface, Sekunde, was hab ich hier gerade"}, {"id": 846, "start": 7457.3, "end": 7463.98, "text": "rein rausgezogen, ah das war gar nicht das Audio Interface, das ist das Audio Interface"}, {"id": 847, "start": 7463.98, "end": 7476.98, "text": "hier, drin, ok, ja daran wirds nicht gelegen haben, also ok, keine Ahnung, ich weiß es"}, {"id": 848, "start": 7476.98, "end": 7486.26, "text": "nicht, schauen wir mal, es ist zumindest, es ist zumindest schonmal hier in der Aufnahme"}, {"id": 849, "start": 7486.26, "end": 7492.98, "text": "drin, was dafür spricht, es ist zumindest schonmal, das ist irgendwas Windows technisches"}, {"id": 850, "start": 7492.98, "end": 7502.46, "text": "oder Aufnahme technisches ist, wer weiß, keine Ahnung, schauen wir mal wie es morgen"}, {"id": 851, "start": 7502.46, "end": 7509.82, "text": "ist, ich werde, wenn es gar nichts hilft, ich werde einfach Modern Warfare 2 wieder"}, {"id": 852, "start": 7509.82, "end": 7518.58, "text": "deinstallieren, fertig, Leute wir sehen uns, ich geh jetzt auf, weiß eh nicht was ich heute"}, {"id": 853, "start": 7518.58, "end": 7522.94, "text": "noch machen soll, wir haben ja das geschafft, was wir schaffen wollten, morgen nix, das"}, {"id": 854, "start": 7522.94, "end": 7528.22, "text": "Stream mal gucken, vielleicht, ja, Leute wir sehen uns bis denn, machts gut, CU."}]}