{"text": "So, bisschen früher als sonst, Moin Fips, du bist auch echt immer amStahl, bisschen früher als sonst, wobei was hatten die eigentlich genau so wie sonst, bloß dass eseine Stunde früher ist, so rum, das ist eigentlich richtig. Und warum soll ich noch eine Stunderum sitzen, bloß dass es neun ist, wenn ich wach bin, das macht ja keinen Sinn. Muss mal kurz gucken,ob es wieder irgendwelche Raid Shadow Legends oder VPN Anfragen gibt. Gucken, was neu ist,was neu reingekommen ist. Mal checken. NordVPN. Leute, ich hab wirklich jetzt hier die Klassikerschlechthin an Mails bekommen. Leute, ich hab bekommen Raid Shadow Legends Anfrage und NordVPN.Dann ist jetzt alles klar. Da kann ja nix mehr schiefgehen jetzt. NordVPN, Raid Shadow Legends.Ich war weiter, null. Etwas früh, na ja, mit Zeitumstellung ist es neun. Also,nee, ohne Zeitumstellung wäre es neun gewesen. Zeitumstellung ist es neun eigentlich. AberLeute, ich hab NordVPN und Raid Shadow Legends Anfragen bekommen. Das kann ich eigentlichmein YouTube-Channel dicht machen, jetzt hab ich alles geschafft. Einfach easy sell out.It's revealed. Nee, das wär ja was, was ich, also was ich machen möchte, was ich geschaffthabe und nicht, was ich nicht machen will, was ich geschafft hab. Wobei ganz ehrlich,wirklich machen möchte ich eigentlich auch kein Placement für NordVPN oder für RaidShadow Legends. Wobei NordVPN weiß ich jetzt schon, wie das laufen wird. Wir antwortendenen, die sagen ja, okay, so und so sieht's aus und danach dann irgendwie ja so und soviel, machen wir was ab und dann fällt ihnen ein, oh, ich hab ja ein VPN-kritisches Videobei mir hochgeladen. Ja, dann soll ich das Video löschen. Dann sag ich, nein, ich löschedas Video nicht und dann haben sie keinen Bock mehr. Zumindest war das das letzte Malso. NordVPN, ganz ehrlich, brauchen tun's die wenigsten, zumindest nicht für das, wassie denken, wofür sie es brauchen. Aber gut, mein, Genshin braucht auch keiner, wobeidas eigentlich ein ganz gutes Game ist. Wenn halt nicht das ganze reingekasche wäre. KyoKon, danke, schon 29 Monate Massive Subscription hier. Ja, das ist einer der wenigen Sachen,ja, tatsächlich. Aber das Problem ist, was ich so sehe bei ganzen VPN-Anbietern ist,dass da halt sonst was erzählt wird und die Leute das dann halt dann irgendwie auch fürvoll nehmen, so nach dem Motto, ja, man ist viel sicherer im Internet unterwegs, die Hackerkönnen nix mehr machen, vor allem, weil auch immer die Hacker sind, ja, dann irgendwelche,es wäre auf einmal alles verschlüsselt, was vorher nicht verschlüsselt ist, alles, dasist halt alles ziemlicher, ziemlicher Blödsinn. Ich mein, ja, okay, die Strecke ist verschlüsseltjetzt von dir zum VPN-Anbieter, aber danach genauso wenig wie vorher und naja. Also, sowirklich, ja, wenn irgendjemand noch wirklich offene WLANs ohne kleinen Isolationen oderirgendwas verwenden will, ja, meinetwegen, oder wenn einer geoblockigen Sachen umgehenwill, ja, das verstehe ich auch, aber viele Leute, so dieses, die machen mal über VPN,das ist genauso wie unser Azubi mal erzählt hat, er surft nur noch über Tor Browser.Hab ich ihm auch gesagt, also, du kannst von ausgehen, beim Tor Browser, dass dort aufjeden Fall jemand deinen Traffic mitschneidet. Man kann zwar nicht direkt drückverfolgen,wer du bist, aber da kannst du dir sicher sein, irgendjemand schneidet den auf jeden Fallund, also, wenn du da was drüber machen willst, unverschlüsselt, dann kannst du von ausgehen,es ist mitgeschnitten. So, ich mal gucken, wer Exit-Notes betreibt bei Tor. Gut, du kannstdie auswählen, aber trotzdem. Jasper, Dankeschön, Simon hat eine Subscription. Huge Subscriptions,Naisu. Ja, musste halt den richtigen auswählen. Also, ich weiß nicht, so diese Sache, ichnehme default Tor Browser, es ist nicht sinnvoll, genauso wie ich nehme default in VPN. Man kanndoch was machen, es gab hier mal eine Zeit lang auch Gaming-VPNs. Die waren tatsächlichin beschränktem Maße noch sinnvoll. Wenn du kack Routen genommen hast, irgendwie nachAsien für irgendwelche Games, falls Leute irgendwelche Asia-China-Chinesen-Games gespielthaben, oder auch nach NA teilweise, ja, wenn du nach NA geroutet würdest über Brasilienoder so, dann war das mit einem Gaming-VPN teilweise gar nicht so blöd. Hab ich sogarmal kurzzeitig auch verwendet, als ich früher mal Dark auf einem US-Sauber gespielt habevor 12 Jahren oder so. Nee, reicht gar nicht, 13 Jahre, null, auch nicht lang. Ah.Ja, komm, es ist 8.07, gestern wär's noch 9.07 gewesen. Und ich bin trotzdem wach, obwohlich gestern später ins Bett bin. Das wird man auch überleben. Unchristliche Zeit, ja.Brückentag oder arbeiten? Die Brückentag ist es Samstag. Warum sollte ich Samstag arbeiten?Sonntag, Sonntag ist, null. Vielleicht, weiß ich noch nicht, mal gucken. Es ging ja darum,dass ich eine Skill-Liste erstelle für die Bewerbung. Nee, ich hab's nur installiert,stimmt, heute ist Sonntag, aber Brückentag, wieso, ist morgen irgendwelche Feiertag, Hessen,ist irgendwann auch noch Tag der Deutschen Einheit irgendwann? Ah ja, das war schon,nee, das, doch, das war schon. Das war Montag, das war Montag, Anfang Oktober. Das hat mirnix gebracht, weil Montag, also die Deutsche Einheit hat mir schon was gebracht, aber dasses Montag ist, der Feiertag hat mir nix gebracht. Es dauert wieder bis Weihnachten, bis Feiertagesind. Und dann fallen die Feiertage auch noch so beschissen, dieses Mal bringt's mir garnix, guck mal hier, Weihnachten, 25, der Kackel, Alter, Montag, Kac, W, Triw, Silvester istdementsprechend dann auch, naja, das ist ja richtig kackel. Einzig Gute ist, dass der24. dann ein Freitag ist und dann ist das bei uns auch frei, 24 ist bei uns auch nix.In Hessen ist der 31. Feiertag. Echt jetzt? Warum, was soll das für ein Feiertag sein?Nö, ist es nicht. Ist nicht, ist kein Feiertag. Also wenn es bei hessen.de eh kein Feiertagist, dann ist es kein Feiertag. Ganz einfach. Den 31.10., ja, aber das ist kein Feiertag,sonst würd's da stehen. Das ist die offizielle Seite von Hessen mit Feiertagen in Hessen 2022.Na, der kann auch kein Feiertag sein. Aber selbst wenn's irgendwo Feiertag ist, Montagwürde mir eh nix bringen, der 31. also morgen. Weil, Montags arbeite ich nie. Dementsprechendfind ich's immer kacke. Also ich finde auch, dass Ostermontag nicht auf Montag fallensollte. Man könnte man ja ändern, Osterdienstag oder so. Das wär gut. Aber warum Ostermontagimmer an einem Montag sein muss, versteh ich nicht. Montag ist ein Kacktag für Feiertage,das bringt mir nix. Aha, sollen sie mal einführen. Was ist eigentlich aus diesem Corona-Freitaggeworden? Gab's den eigentlich jemals? Und im Jahr oder so war doch in Diskussionen malirgendwie so ein Corona-Freitag zu machen und den gab's nie, oder? Ich glaub, da istnie dazu gekommen. Gut, ich mein, irgendwelche Sachen, die man machen will und zu denen'sdann nie kommt, gibt's ja massig. Ich bin mal gespannt, ob's wirklich nächstes Jahrdas 49 oder was es da noch immer Euro-Ticket geben wird. Ich hab da auch mal eine Zweifel.Sie haben jetzt zwar alle wieder ihre Absichten erklärt, aber das heißt ja noch lange nix.Oder wie wär's mal mit der Zeitumstellung abschaffen, was man schon vor 5 Jahren machenwollte. Also 100% nicht wach bin ich auch noch nicht. Aber auch nicht wacher wie sonst,ja. Aber es ist ja immerhin schon neun. Also, wäre das gewesen. Oh, es ist gutes Wetter.Sekunde, Leute. Ich muss mal kurz was checken. Wie wird denn das Wetter heute? Vielleichtkann ich heute ein bisschen ins Gebirge gehen. Da sagen die Schweizer jetzt wieder Kekkel.Das ist doch kein Gebirge. Aber so ein bisschen hier ins... Hey, heute ist richtig gutes Wetterden ganzen Tag. Pong. Da müsste ich eigentlich jetzt nicht... Also ich hau jetzt nicht ab,ja. Da müsste ich nachher mal so... Mal zwei Stunden raus. Alles wie's morgen. Morgengeht's so. Ok. Morgen ist so, naja. Aber gut, man kann sich ja noch ändern. Das Schlimmeist, dass die USA die Zeit eine Woche später umstellt. Painschamp. Tja. Generell, ichfinde... Also ich muss ehrlich sagen, Zeitumstellung und Zeitzonen finde ich immer noch komplettuseless. Einfach überall auf der Welt die gleiche Zeit und fertig. Ich mein, wen jucktdas bei dem einen um 12 Uhr die Sonne scheint und beim anderen um 23 Uhr? Das ist doch reineGewöhnungssache. Einfach Zeitzonen abschaffen und Zeitumstellung abschaffen. Fertig. Wisstihr, wie viele Probleme damit gelöst werden? Ab auf die Wassergruppe nähe. Das ist nichtbei mir in der Nähe das. Also bei mir ist am nächsten ist der Feldberg im Taunus. Wobeidas auch nicht so nah ist. Spessart ist näher. Ne, das sollen sie halt Ostermontag auch nochmachen. Ah man. Habe ich die Woche irgendwas verpasst? War irgendwas spannendes Leute.Komm wir gucken mal kurz. Guck mal ganz schnell GitHub Trends. Das mache ich ja immer einmalSonntag. Was dann so weekly getrendet ist. Mal drüber scrollen und feststellen, dassich wieder mit nichts was anfangen kann. Ok, das habe ich gesehen. Placingly fast writtenin Rust. Irgendein neues JavaScript Bildtool. Juckt mich nicht, juckt mich nicht. Leutees gibt manchmal Beschreibungen von Projekten. Da weiß ich noch nicht mal was das Projektsein soll. Ich meine ernsthaft. Versteht das irgendjemand was sie mir hier sagen wollen?Next Generation Smart Contract Platform. High Throughput Low Latency Asset Oriented ProgrammingModel powered by Move Programming Language. Was? Also ich kann mir ja mit Ach und Krachnoch was zu Smart Contract Platform oder sowas. Genau. Kryptograms. Ich kann mir ja mit Achund Krach noch was zu Smart Contract Zeug zusammenreiben. Aber was sie mir mit dem Restsagen wollen habe ich keinen Platz für einen Schimmer. Und ich kann mir da auch nur zusammenrein irgendwelcher Kryptogramm. Layer 1 for Everyone. Was soll das sein? Rust Betriebssystem.Ah ne Blockchain. Das ist ein schlechter Name für Blockchain. Da ist so S im Name. Hätteirgendjemand an Blockchain gedacht jetzt wenn er diesen Titel liest? Ich hätte an irgendso ein Spielzeugbetriebssystem in Rust gedacht wieder. Rust Desk. Sag mal was ist da geradeangesagt? Also Rust ist ja wirklich überall gerade. Websocket Server in C++. IrgendwelchesPoppy End Zeug oder so in Go. React. KeePass. Beste. Android. Machine Learning Kram. PowerShell.SGS Ormapper für Gorm. Ein Ormapper für Go. Flipper Zero Firmware. Das ist doch irgendein3D Druckerkram oder? Okay es ist nix dabei was mich irgendwie großartig interessiertdiese Woche. Neuer AI Gamechanger. Es ist genauso Gamechanger wie Levelcap immer behauptetdass der nächste Battlefield Patch ein absoluter Gamechanger ist. Die sollen mal weiter Gamechangen.Ansonsten habe ich die Woche irgendwas spannendes verpasst. Erstmal überlegen war irgendwas.Kurz mal. Halsey News Übersicht gucken. War da irgendwas spannendes? Die haben dochimmer so eine Woche. Ja gut die Elon Musk Twitter Geschichte ist gewesen. Haben die nicht immerso eine Woche Übersicht normalerweise jetzt? Okay keine Ahnung. Die China Chinesen wollenirgendwas. Das habe ich auch mitgekriegt. Ihh. ABAP. Ein ABAP Kurs. Okay es gibt waswas ich mir wirklich nicht freiwillig geben würde. Da müsste mich jemand für bezahlendass ich einen ABAP Kurs mache. Falls man das überhaupt so ausspricht. Brennende Stromkabel.Wahrscheinlich weil es minderwertige Qualität ist oder so. Also irgendwie nichts spannendesgewesen die Woche. Nicht mal irgendwelche komischen größeren Windows Fehler oder irgendwelcheCloud Hacks oder war gar nichts die Woche. Die Originalen das war natürlich schlecht.Gut dass ich mir noch keine neue Grafikkarte gekauft habe. Wie sieht es denn da aktuellkurz aus? Ich schaue mal kurz. Also wenn ich im Dezember mir eine neue Grafikkarte kaufenwill gäbe es da überhaupt was? Ja gäbe es halt teuer. Teuer AF. Gibt es Founders Editionoder was? Ja. Weil bei uns alles teurer ist. Du kannst in der Regel kannst du die letztenJahre über schon sagen 1 zu 1 der Euro Preis. Also 1 zu 1 der Dollar Preis. Eher nochmalirgendwie 15% obendrauf. Das ist immer noch so. Das ist teuer. Grafikkarten sind megateuer. Eher 2300 wenn du was kriegen willst. Also ich rechne damit dass mal ein neuer Rechnerirgendwas um 4500 Euro oder so kosten wird. Aber was muss das? Wobei das stimmt ja garnicht. Es muss ja überhaupt nicht. Es gibt eigentlich überhaupt keinen wirklich driftigenGrund dass ich mir einen neuen Rechner kaufe. Ich meine mein Rechner ist mittlerweile 5Jahre alt mit einem 8700k oder 1080ti. Aber die Scheiße ist halt es läuft alles. Es gibtnix. Es gibt nix was nicht läuft. Und es läuft auch alles relativ gut. Gut ich meine 1080pGaming ja. 1080p Gaming. Kein Ding. Ja wenn es danach geht brauche ich auch keinen neuenPC. Aber ich hätte gerne echt wieder. Also wirklich gerne mal wieder einen neuen. Abervielleicht mache ich es auch. Vielleicht kaufe ich mir auch doch keinen neuen. Wie gesagtwir haben ja letztens einen zusammengestellt hier im Stream. Ja noch mit AMD. Mal guckenob es auch AMD wird. Vom Stromverbrauch her vielleicht AMD. Weiß nicht. Die Grafikkartehaut auf jeden Fall richtig rein. Also mal gucken. Vielleicht kaufe ich mir auch keinenneuen PC. Ganz ehrlich 4500 Euro einfach nur weil es nice ist muss ja auch nicht sein.Man kann es auch übertreiben. Aber ich neige trotzdem noch dazu neuen PC zu kaufen. SoYouTube was empfiehlt es zu uns? Angular? Ne schau mal nicht. Insane skip. Hat Fireshipein neues Video? Next. Ne das haben wir schon geguckt. Is Coding dead? Nein und wird esauch nicht sein. Ich meine seit 15 Jahren wird erzählt demnächst können Manager auchirgendwas programmieren und das hat noch nie geklappt. Sei es von Excel angefangenbis irgendwelche Clicktools und jetzt irgendwelche Low-Code-Plattforms und sonst was. Es wirdes einfach wird das nicht passieren. Was soll denn da rauskommen wenn irgendwelcheManager dann nichts programmieren. Business Software die nicht richtig funktioniert oderwas soll das sein. Das klappt nicht. Wisst ihr was ich mich frage wann endlich mal derneue ESP32 rauskommt mit ZigBee, Matter und Thread Support. Da gibt es ja zwei neue.Die sind schon seit über einem Jahr angekündigt aber da tut sich nichts. Ich weiß auch nichtwas mit den China-Chinesen los ist. Das wird tatsächlich immer praktisch wenn das Dingdemnächst rauskommt. So Leute, nachdem ich beide Anfragen jetzthabe für Raid Shadow Legends und für NordVPN. Sagt mir mal was ich zuerst machen soll.Wo soll ich zuerst drauf antworten? Raid oder NordVPN?Oh ich habe noch mehr Sachen sehe ich gerade. Ich bin aber im Spam Ordner gelandet.Ok das ist Scam. Raid die besser zahlen. Wahrscheinlich ja.Ok im Spam Ordner ist richtig Scam. Also am cringiesten finde ich die Mails immerwo dann irgendwelche Publisher oder so Mails rumschreiben. GameXY jetzt finally on Steamund dann guckst du rein und es ist so ein billiger Mobile Port von irgendeinem Game was sichnicht juckt. Die haben nicht gefragt bis jetzt. Genshinwar das einzige Weep Game was gefragt hat bisher. Raid über. Exzellent. 5 Head Idee.Das geht aber nicht weil NordVPN gesagt hat sie wollen der einzige Sponsor im Video sein.Ansonsten wäre das 6 Head Idee. Also für mich ist immer so ich mache Sponsoringsnur wenn ich den gar nicht selbst spielen muss. Also das war auch bei World of Tanksund sowas. Die wollten dann immer dass ich selbst Gameplay erspiele und sowas. Ich willden gar nicht spielen. Ich erzähl da. Ich reiß da 60 Sekunden lang irgendwie den Textrunter in den 0815 Skript wo jeder hört dass es halt von irgendeinem Cringe Marketing Typgeschrieben wurde und dann ist gut ich will den gar nicht selbst spielen.Und eigentlich wollte ich schon seit fast einer Woche ein Video hochgeladen haben zumneuen Battlefield Patch. Da ist auch ein Sponsoring drin aber die kriegen es mit ihrem Reflink nichtauf die Reihe. Raid Shadow Fallen bringen die nicht auf blöde Ideen. Da weißt du niewas passiert. Ok was gucken wir uns denn an? Lassen wir uns Level Capture Bane. Modern Warfare2 Missing Key Feature. Ok Level Capture Bane. Und dann gucken wir uns was ernsthaftes an.Ich skippe eh den meisten Krempel wieder. Kommt mal der hat noch nicht mal Timestampsdrin weil er genau weiß. Oh doch hat er. Mein Browser mag keine Timestamps. Der hat Timestampsverkackt Level Cap. Kecke. Ich weiß nicht wie er das geschafft hat aber irgendwie hater Timestamps verkackt. So. Komm wir lassen uns eine Runde Level Capture Bane. Gutes malgucken was es diese Woche neu gibt. Da kann ich auch gleich die Sound-Lautstärke einstellen.Wer hätte das gedacht? Wann kommen Spiele heutzutage schon fertig raus? Habe ich dasnicht vor 3 Jahren gesagt? Als die bei Microsoft angefangen haben alle möglichen Sachen zuübernehmen und den Xbox Game Pass zu packen. Da habe ich damals im Video gesagt, gut vielleichtwar es einfach nur Glück, aber ich habe damals im Video gesagt pass mal auf die werden dasjetzt so attraktiv machen, dass es jeder kauft und wenn es dann die Leute haben dann istes einfach auf einen Schlag übelst teuer. Mal gucken. Captain Penguin schüttet uns ab.Alter diese Map muss richtig räudig sein. Ich habe das Game noch nicht gespielt nurruntergeladen. Aber ich habe schon so viele Twitter-Messages gelesen über diese komischeAutobrücken-Map. Das muss wohl das neue Piccadilly sein quasi. Zappend, danke für den Zapp.Wenn du Crossplay disablen kannst, dann steigt die Chance, dass wenn irgendeine Plattformdead ist, dass dann keiner mehr drauf spielen kann. Alter wie ergebener Sponsoring.Wer juckt? Achso, weil die schneller progressen können. Ah ja.Alter, da bin ich wieder so krass reingekascht. Hoffentlich kriegen sie es besser ein alsHalf-Life mit Episode 3. Ich sage euch, Warzone wird das Game eh wieder retten.Nix Neues. Nix Neues. Die ganzen physischen, also viele physische Kopien von Games enthaltenmehr oder weniger. Sag mal so, wenn überhaupt enthalten die einfach nur was zum Downloaden.Es gibt ja mittlerweile physische Kopien von Games, da ist einfach ein Steam-Code drinne.Da machst du das CD-Case auf und dann ist da ein Steam-Code drinne.Das ist das, was so aussieht wie Dead Space, oder?Nix Neues.Nix Neues. Nix Neues.Nix Neues. Nix Neues. Angry Birds.Nix Neues. Nix Neues. Nix Neues. Yeieieieieieieieieieieieieieieieieieieieieieieieieieieies!Modus, selbstverständlich SBMM, dafür gibt es ja ranked. Es kommt aber auch immer einbisschen auf das Game an, muss man sagen, ja. Nur dass mich das Game so überhaupt nicht anspricht,jetzt auf den ersten Blick. Oh, neue Kisten in Battlefield. Es gibt jetzt übrigens auchorangene Container habe ich gesehen, Leute. Stellt euch das mal vor. Die haben nicht nur blaue,grüne, weiße, graue Container, die haben jetzt auch orangene Container und rote Container. Könntihr euch das vorstellen? Das ist fast, das ist nahezu unglaublich. Spass! Spass! Spass!Moment! Ein Helm hat das Game gekrascht? Na gut, bei dem Game wundert mich nix.Ich meine, das ist immerhin irgendwie schon so eine Art Game. Das wird zwar nie fertig.Ich glaube, sollte nicht die Kampagne schon vor drei Jahren erschienen sein?Juckt mich nicht. Spielt jemand von euch Star Citizen? Das würde mich einfach mal interessieren.Also ich will es jetzt nicht über Gebühren bashen oder so. Ich habe einfach keine Ahnungdavon, aber es interessiert mich auch nicht großartig. Bye, natürlich.Okay, juckt mich auch absolut gar nicht.Moment. Ach, ja gut.Ja, mal gucken. Mal gucken, was sie dann auch wirklich erhöhen.Ich bin froh, dass ich noch keine habe.Haben die das vorher nicht mal ausprobiert in irgendeinem zwei Wochen Belastungstest oder so?Na dann. Ich bin schon wieder an das Film.Ja, 2000 Euro GPU, die sparen wir aber nach. Ja, sieht aus. Der gesparte Cent macht es aus.Also verdient schon. Reden wir an ihn.Ach so Lifetime. Ich wollte gerade sagen, dass es so gehyped ist, gerade hätte ich gar nichtmitbekommen.Die Franchise ist Hardcore-Fanbase, neue Spieler der Franchise waren auch frustriert,dass es da habe ich mich wirklich geirrt bei dem game als es rausgekommen hat beziehungsweisewas ich gesagt habe als es rausgekommen ist ich habe ich hatte ich wie gesagt ich dachteauch das ist so eine eintagsfliege und ist bald wieder weg aber es war zum release auchecht fail damit habe ich echt nicht gerechnet dass ich das noch so machtBugs und die genaue Lack of Polish, aber die Devs haben ein monumentales Erlebnis,um das Spiel zusammen zu machen und obwohl es noch nicht aufgeteilt hat, vielleicht macht ja vielleicht macht ja malder Internet Historien ein Video zu, der Entgudenung von Rainbow Six SiegeTaktikale PVE-Elemente der vergangenen Titel sind weit über die Erwartungen in ziemlichjedem anderen Begriff, jetzt wenn du dich für einen tieferen Reisen in den Modern Warfare 2startst, schau dir meine ersten Impressionen im Video an, ich habe es gestern eröffnet,auch schau dir dieses GTFO Video an, das ich mit Karma Cut gemacht habe, GTFO ist so ein fantastischesSpiel, wenn du dich für einen guten Fallfliege suchst, dann gibt es GG EatsDu bist damit wahrscheinlich nie warm geworden, ja klar ist bestimmt für vieleabstrengend, wenn er erst mal 200 300 Stunden spielen muss, dass du halbwegs brauchbar bistThe most legendary programmers of all time, hey wollen wir wetten, der Dude hier links, das ist der C++ Erfinderkommt nichts, wobei ich halt es ihm immer noch übel nehme C++ erfunden zu habenSo also was kann man als nächstes sagen, was ist das hier, Kindheitstraum, Bagger reparieren,was verdient ein Baumaschinenmechatroniker, ok zeig mal her, was will er denn hier eigentlich,die ganze Serie Moneymaker, ich will nicht die ARD Mediathek gucken, Baumaschinenmechatroniker,der hat richtig gemacht, der hat auch nichts mit Holz gemacht, was ist das, gucken wir mal das hier, Vim as your editor,heute morgen nicht, das ist Werbung davor, jetzt machen die schon Werbung für ihren eigenen Kramda drinnen, ok zeig mal her, das ist eben der Kindheitstraum, so ein bisschen der kleineJunge Bagger Bagger LKW LKW, ich hab mir früher als ich klein war auch sehr gerne Bagger angeguckt,ich mein wer nicht, aber auf die Idee gekommen Bagger beruflich zu bauen hätte ich jetzt eherkeinen Bock, darum geht mit einfachen Sachen Geld zu verdienen, dann ist man hier ein bisschen falsch,kann man vorstellen, so ist halt Rally auch, lass es mal nicht Fridays for Future auf Twitter sehen,jetzt bauen wir mal zu mir auf die Arbeit, jetzt bauen wir nen Bagger, 7.15 Leute,guck mal der ist seit eineinhalb Stunden schon auf der Ahr, also heute ist Sonntag, aber jetzt wowir hier sitzen, er wäre seit eineinhalb Stunden schon auf dem Weg hier, fahr dann auf die Baustelleoder ich richte meine Sachen schon abends, fahr gleich am Morgen schon auf die Baustelle,moin moin, meistens treffen wir uns hier morgen und dann werden wir erst mal eingeteilt auf dieBaustellen, Baumaschinen, Mechatronik her, also Baumaschinen reparieren, warten, pflegen und wasmit YouTube passiert ist, das ist ein neues Design und bei YouTube ist es ja immer so ein bisschenrandom wer was kriegt, kannst ja mal Cash lernen oder einen neuen Browser verwenden oder so,dann soll es bei dir auch so sein, es ist random so ein bisschen, eben auch Einweisung geben füreinen Baggerfahrer, der die Maschine auch nicht kennt, wenn sie neu ausgeliefert wird, jetzt gehenwir erstmal an eine kleinere Maschine, ich finde das neue gar nicht schlecht, 10 Tonnen, dann müssen wireinen Schlauch abdichten, easy nur 10 Tonnen, könnte der Chet bestimmt auch reparieren,Chet kann mit Schwarmintelligenz alles, Servus Morgen, Twitch Repairs Bagger,das wäre doch mal ein Stream, kaputter Schlauch, das ist schlecht, da geht er nicht mehr,jetzt mache ich die Entlüftung vom Tank auf, da musst du aber echt Plan haben,ich meine es ist ja nicht als gibt es nur zwei Bagger, ok aber wahrscheinlich funktionen diealle relativ ähnlich, das ist einfach nur, dass der Tankdruck verschwindet und dass wirkeine Probleme haben mit Hydraulikdruck, da muss man schon ein bisschen wissen, dass es dir nicht insGesicht pustet, ich weiß nicht, da ist bestimmt ordentlich Druck drauf, wenn du da irgendwie ander falschen Stelle was öffnest und stehst davor, dann pustet es dich erstmal gut, halt einfach einHeidenspaß, ich glaube der Hauptgrund warum ich das mache ist eben das Kindheitsgefühl,so große Maschinen, wie früher am Sandkasten mit dem Bagger gespielt und heute spielen wir halt mitdem richtigen Bagger, da hat sich jemand Mühe gegeben, das ist mal ein ordentlicher Schraubenschlüssel,ne keine Ahnung, da habe ich auch so ein Set von, ich hatte mir mal so ein Vera Joker Schlüssel Set gekauft,mega teuer aber super nice, wenn man sie mal braucht, aber das ist ein ganz anderes Kaliber,da hätte ich nix was da dran passt, Maulschlüssel ja genau, ich glaube die arbeiten agiler als inder IT, wo die Leute sagen sie arbeiten agil, weil da musst du wirklich dynamisch gucken was Sacheist, die labern nicht nur agil, die sind agil, okay jetzt müssen wir nur kurz gucken wie vielÖl uns da entgegen läuft oder eben auch nicht, komplett, Bagger läuft aus, man weiß ja was aufeinen zukommt, schmierig, schlechtes Wetter, ich wollte gerade sagen 45 Stunden, Alter,der hat schon gut was zu tun, ich hoffe wirklich, dass der viel Geld verdient damit, dann passt das,will mal jemand probieren, ob alles passt soweit, passt, Betraulich ist auch voll, ich würde gerneauf jeden Fall meinen Meister irgendwann machen, Wann steht noch in den Stern, mal dieses komischeLeisten Ding da, jetzt ist weg, guck mal 9.30 Uhr, der hat schon Bagger repariert, das ist mal was,ob alles passt, ob alles richtig schön zusammengeschraubt wurde, einfach alles einmalbevor die Maschine das erste Mal rausgeht auf die Baustelle, erst mal Jira Ticket aufmachen,wenn der Bagger nicht geht, genau, Liebherrmaschinen, also wir haben einen großen Fuhrpark mit Maschinenund vermieten den natürlich, haben einen Mietpark mit Großgeräten, natürlich auch mit Kleingeräten,also von uns kann man alles von der Rüttelplatte bis zum großen Bagger alles ausleihen, natürlichverkaufen wir auch Maschinen, natürlich ist ein Bagger teuer, das ist ein Riesending mitviel Technik und muss, wundert mich nicht, dass ein Bagger ordentlich Geld kostet,mal ganz davon abgesehen, man kauft sich ja auch nicht einfach mal random einen Bagger,weil es einem danach ist, man will ja auch was damit machen.Hier am Aachen bin ich schon häufig in meinem Leben Bagger gefahren, für mich war es keinProblem, ich denke, wenn man am Anfang neu draufkommt, ist es wahrscheinlich schon einbisschen ungewohnt, aber die Maschinen, die sind sehr schön zu fahren, also da kommt man schonrelativ schnell rein, haben wir ein Protokoll, dass wir jetzt einfach mal Schritt für Schrittdurchgehen, und wenn wir das durchgegangen sind, ist die Maschine sozusagen einmal durchgechecktund fertig für den Einsatz auf der Baustelle.Und danach erstmal Daily Scrum.Was hat er für einen Agro-Schrauber?Porsche Akku, 18 Volt, ja das sind die dicken.Also, gecheckt haben wir alles, passt alles soweit, kommen jetzt noch Mietpark-Aufkleberdrauf, dass man auch weiß, von welcher Firma sie sind, genau, und dann, wenn es der Mietparkzulässt im Büro, kann die Maschine ausgelehnt werden und ist einsatzbereit für die Baustelle.Überlegt mal, wie viel der schon geschafft hat, und es ist erst mal 12, in der Zeit habendie ganzen Leute aus diesen, ich zeige euch heute meinen Software-Entwicklungsjob, habendie Kaffee gemacht, haben eine Runde Tischkicker gespielt, Daily Scrum und vielleicht nochmalirgendwie einen Code-Editor aufgemacht, zumindest in den Videos, realistisch ist es ja auchnicht, aber in den Videos sieht das immer so aus, der schafft wenigstens was.Also wie gesagt, so Leute brauchen wir, guck mal, es ist aktuell so schwierig beispielsweiseHandwerker zu bekommen, wenn du dir ein Zaun bauen lassen willst oder wenn du dir irgendwasam Klimaanlage am Haus bauen lassen willst, irgendwas am Fenster, an der Tür, was auchimmer oder sei es nur einfach ein Ladegerät fürs Elektroauto, das dauert Wochen und Monatebis du da Leute bekommst, also Handwerker brauchen wir unbedingt und deswegen hoffeich auch immer, dass die so viel verdienen, dass sie alle glücklich mit sind und das weitermachen bzw. noch mehr Leute machen.Wir brauchen viel weniger Management Bullshit-Shops, mehr sowas.Oft unterwegs, wenn es da mal was gibt, wenn man halt nichts dabei hat, also immer wiederunterschiedlich, genau, aber heute gehen wir mal in den Kramer.70, boah, die kommen aber alle mit wenig Geld aus, 70 Euro kann ich theoretisch schon füreine, kann ich eine Woche in Frankfurt Mittagessen ausgeben.Monatlich, das ist ja nix, ja, wie gesagt, wenn ich wirklich komplette Wochen nach Frankfurtfahren würde und da jeden Tag essen, bin ja aber 70 Euro oder einen großen Döner-Teller,ne, wobei, na ja nicht ganz, also Mittag, es haben ja viele Leute, viele Restaurantsmeine ich, viele Restaurants in Frankfurt haben ja immer noch so Mittagskarten und sowas,da kannst du immer noch für, sagen wir mal, 8 Euro, 8,50 oder sowas futtern, aber trotzdem,da hast du in zwei Wochen hast du das und dann musst du dich, da darfst du schon nichtszu trinken mehr dabei bestellen und so.Baggerkette ist kaputt, das Kettenlied gerissen und das wurde jetzt einmal getauscht, weilgebrochenes Kettenlied ist natürlich nicht gut, das wird, genau, das wird immer schlimmerund irgendwann drehst du und dann liegt die Kette neben Bagger und das ist natürlichnicht gewollt.Da hast du was zu tun?Ja genau, wichtig ist eben, wenn man die Kettenplatten, bevor man sie wieder drauf macht, dass esalles schön eben abgeschleift wird, dass da kein Rost, keine Farbpartikel, keine Dreckpartikeldruntersitzt, dass es alles schön nachher wieder draufsitzt, weil das wird nachher mitDrehmoment angezogen und wichtig, dass es halt eine gerade Oberfläche hat.Alter, die Musik, Alter, BTF, Pa, Pa, Pa, Pa, Skrrrra, Handwerkliche Sachen, da darf mannatürlich nicht zurückschrecken, jemand der beim Funken gleich zurückschrecken, schreitden, kann man wahrscheinlich weniger gebrauchen, hier Funken, Leute, ich hab vor nicht allzulanger Zeit das erste Mal Metall durchgeschnitten selbst und ich war überrascht, dass es Funkensprüht, also wenn man Metall durchschneidet, sprüht es Funken, das hätte ich eigentlichwissen können, aber das war mir so nicht klar und jetzt weiß ich's, aber da hab ich auchgedacht, hoch, was denn das, aber passiert ja nix.Maschine hat natürlich paar tausend Stunden schon drauf, ist im Steinbruch gelaufen, deshalbleihert sich alles ein bisschen aus und dehnt sich ein bisschen aus, deshalb müssen wirjetzt die Schraubenlöcher ein bisschen anpassen, da halt ein neues Kettenglied drin ist.Aber der gute Vera-Kraft vorm Schraubendreher da unten, seht ihr ihn?Ja passt so ganz wie es soll, deshalb beschleunigen wir das Ganze, dass wir das noch stimmelangmachen, so geht's ein bisschen schneller und den Rest bisschen wegfräsen und dann abschleufen.Ist auch nicht immer schön an schweren Ketten zu arbeiten, also nicht immer einfach, aberdu fühlst dich halt gut, wenn du zu Hause bist und du weißt, du hast gerade so riesenKettgel gut gemacht, gewechselt bzw. in dem Fall jetzt repariert.Alter, das ist mal so ein Drehmomentschlüssel, das ist ja eineinhalb Meter das Teil, dasist mal einer, da kannst du ordentlich anziehen.Ich verdiene 3200 Brutto, dazu kommt natürlich noch Überstunden.Und das wie oft im Jahr, sagt ihr auch wie viel Monatsgehälter?Also 3500 mal 12, mal 14 wäre okay würde ich sagen, aber der dürfte reust mehr verdienen,also nicht, dass ich da jetzt irgendeinen Einfluss drauf hätte.Mit dem Geld bin ich zurzeit sehr zufrieden, da kann ich mich überhaupt nicht beschweren,wirklich überhaupt nicht.Das ist auf jeden Fall nicht in Stein gemeißelt, das variiert sehr, natürlich wie lange manda ist, wie viel Erfahrung man hat.Jeder Baumaschinenhersteller bietet Lehrgänge an, desto mehr Lehrgänge, desto besser kenntman die Maschinen, umso mehr Geld verdient man natürlich dann auch, genau so ist es.Morgen muss ich einen Kundendienst machen.Ist das noch Windhoff 7, Leute, ist das noch Windhoff 7, das ist ja antik hier.Er wird bestimmt nicht mehr supportet.Vista, wie kommst du auf Vista?Stimmt, das ist IEE7 oder sowas ja.Raussuchen, morgens nur ein kleiner Radlader, noch die Teile, den nehmen wir gleich mit.Dann haben wir jetzt alles drin und machen mal jetzt Feierabend.Das war das Vista-Logo, okay, das ist ja wirklich antik.Ich zieh mich mal um kurz.Meine Freundin studiert, arbeitet auch nebenbei, aber den meisten Teil zahlt ich natürlich,weil ich verdiene noch das Geld.Also wir haben eine Zwei-Zimmer-Wohnung, das sind schätzungsweise 90 Quadratmeter.Für einen Freiburger Raum kann ich mir überhaupt nicht beschweren, ne, da bin ich total zufrieden.Ist es teuer, ein Freiburger, hab keinen Plan.Ich bin relativ zeitinsensiv, ich fahre Rallye, seit 2021 bin ich mein erstes Rennen, meinerstes Motorsport-Event gefahren und da hab ich mich auch wirklich drin verliebte undmöchte auch nichts mehr anderes machen.Der hat aber Energie, Alter, am Tag irgendwie achteinhalb Stunden arbeiten und dann auchabends Rallye fahren, bzw. üben oder was auch immer.Also der wird ja nicht abends, aber der wird wahrscheinlich üben und am Auto rumbastelnund sonst was.Boah, da hasse.Nicht schlecht, Alter.Ich hab noch nie Angst mich selber zu verletzen, ich hab immer nur Angst, dass ich mir meinAuto kaputt fahre.Und mich mach ich immer, ich hab gar keine Gedanken.Ganz ehrlich, das Gefühl kann ich nachvollziehen.Das passt schon alles irgendwie.Eigentlich sobald er ins Auto einsteigt, ist Katastrophe, ist Herzrasen, Freude, Angst.Also bis jetzt ist noch nichts passiert.Nicht ungefährlich der Sport, die sind zwar mega geschützt in dem Auto, aber wir habenschon einige Unfälle gesehen und das kann halt auch nicht so schön ausgehen.Jetzt geht's nach Offenburg in die Rallyewerkstatt, wo wir unsere Rallye-Auto stehen haben, dabauen wir das Auto ab, mit dem wir gestern gekommen sind von der Rallye und bereitendas Auto für die nächste Rallye vor.Der hat wirklich hartes Tagesprogramm.Wieder los zur nächsten Rallye.Also das Auto gehört meinen Eltern, das kaufe ich quasi monatlich ab, tanken müssen wirrelativ viel, weil wir halt am Wochenende immer viel unterwegs sind und auch weite Streckenzurücklegen.Ich darf nur Rallye fahren, solange ich auf den Führer stehe.Das ist bestimmt bei den Eltern versichert, weil es billiger ist, oder?Weil es auch eben auf öffentlichen Straßen gefahren wird, auch die Verbindungsetappenund ohne.Chad, das ist natürlich das Problem mit dem Auto.Das ist das Problem mit dem Auto.Das ist das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Das Problem mit dem Auto.Motor ist, aber auch weil da halt nichts an Isolierung oder sonst was dran ist, dass esmöglichst leicht ist, da ist doch wahrscheinlich alles außer das Nötigste, was du brauchstam Auto weg. So geil das Ding. Bei der Rallye schaue ich nicht aufs Geld. Das, was seinmuss, muss sein. Gute Sachen kosten Geld, bei der Rallye gibt es eigentlich nichts billiges,deshalb schwierig. Irgendwann später vom Rallye fahren leben, das wäre natürlich ein absoluterTraum, aber ob ich das jemals so weit schaffe, steht noch in den Sternen. Der Baumaschinenmechatroniker,der Rennfahrer, das sind zwei Sachen, die sich miteinander sehr, sehr gut verbinden.Kann ich mir vorstellen. Von großen Maschinen, von großen langsamen Maschinen zu schnellen,kleinen Autos. Es ist schon ein guter Gegensatz. Der Kick, der macht es halt vor allem aus. DerAdrenalinkick im Rallyeauto, das macht schon wirklich Spaß. Bisschen leiser. Also ganz ehrlich,wenn es nach mir geht, könnte er ruhig deutlich mehr verdienen. Aber ich darf es ja nichtentscheiden. Wenn ihr Mechatronik sogar studieren wollt, klickt mal hier. Und falls ihr mehrMechatroniker sehen wollt, die Rennfahren sogar, klickt hier. Haben die vielleicht noch was anderes,was man... Irgendwas, was vielleicht auch ein bisschen so mit Dating und Partnersuche ohne App.So arbeitet eine Partner... Oh nee, please. Nein, nein, nein, das gucken wir uns jetzt nicht an.Was verdient ein Kundendienst? Das haben wir schon geguckt. Den Rest haben wir auch schon allesgeguckt. Partnervermittlung. Gibt es sowas überhaupt noch offline? Macht das jemand offline? Also,ich habe euch ja mal erzählt, mein Vater hatte früher auch eine Partnervermittlung und hat dieLeute gescampt. Also, wenn ich sowas lese, verbinde ich damit schon Scam. Aber es istsonst irgendwas Spannendes hier. Party im Kult-Discounter. Mein Gott, was wird denn wiederabgehen? Das sind so Videos, die haben vielleicht einen ansprechenden Titel, aber interessiert michso gar nicht. Wenn ich Titel schon lese, habe ich keinen Bock. Abgezockt. Wir testen den Gaming-PCvon Netto. Aber RGB. Mittlerweile haben auch Billig-PC schon RGB. Ist your PC hacked? Sicherlich,der Chat hackt laufend mein PC. Stimmt's? Aber was können wir uns sonst noch angucken hier?What would happen if you swiped the water chat? Was? Ich glaube, das Video habe ich aufgemacht,weil das vorher in der Empfehlung drin war. Ja, dann zeig doch mal, was passiert, wenn man denWater-Chat swiped. Wie waren die Aufrufe? Die Aufrufe der einzelnen Berufe, zeigt mal her.Ja, schwankt schon. Der Jäger, guck mal, der Jäger hat richtig viele Aufrufe. Das Video mit dem Jägerhat mich verwirrt. Könnt ihr euch noch dran erinnern? Da hat er in dem Video, irgendwann hat erirgendeinen Reh erschossen und danach dem Reh so einen Zweig in den Mund gesteckt und meinte,das ist gute alte Jäger-Tradition. Ich dachte mir so, what? Hä? Als würde das erschossene Rehnoch irgendwie interessieren, ob es jetzt einen Zweig im Mund hat oder nicht?Das war doch die, die den ganzen Tag nur Excel-Tabellen gemacht hat, oder? SelbstständigeExcel-Tabellenerstellerinnen. Okay, also was passiert, wenn man den Water-Chat swiped? Allesklar. Das ist ein Video, wo wahrscheinlich drei Sekunden was passiert. Wie findest du das neueYouTube-UI? Ehrlich gesagt gar nicht mal so kacke. Also die letzten Überarbeitungen waren immerschlechter. Jetzt finde ich in Ordnung. Wir gucken mal, also wo wird denn, wo wird der Fingergeswiped? Also je nachdem, was das für einen Wasserstrahl ist, oder wie nennt man das oftdurch so Wasserschneider oder so, keine Ahnung, würde ich mal von ausgehen, das geht bis auf dieKnochen. Ich glaube nicht, dass es deine Knochen komplett durchschneidet, wenn du es einfach nurdrunter durchziehst, aber so hier Adern, Bänder, sonst ist wahrscheinlich alles durch. Schon dasBattlefield 2042-Video gesehen, Wasserschneider, genau. Nö, ich habe aber viele Battlefield-Videosgesehen schon. Ich weiß nicht, ob ich das jetzt schon gesehen habe. Ich spule jetzt mal vor,weil solche Videos in zehn Minuten Gelaber und drei Sekunden spannend ist. Also ich hätte keinenUrtsch meine Hand da drunter durchzuziehen. Aua! Okay, die Finger ist natürlich auch wieder wasanderes. Okay, also Finger schon mal im Arsch, wenn man das drunter durchzieht. Ja, Finger,Finger ist quasi ab. Okay, F für den Finger. What? Ich sehe nix.Warum haben die die Kamera eigentlich ins Gesicht gehalten jetzt? Autsch! Okay,jetzt haben wir schon alles gelernt, was wir in dem Video lernen können. Deine Hand istziemlich im Arsch, wenn du dir darunter durchgezogen hast. Der Rest des Videoskönnen wir uns wahrscheinlich sparen. So halten es noch in eine Säge und sonst was. Also Hand istF. Hand ist hinüber danach. Aber damit hätte ich ehrlich gesagt auch gerechnet. Also wie gesagt,ich glaube die Knochen hinten sind schon noch dran, aber der Rest ist... Aber so was machstdu doch wahrscheinlich normalerweise mit Handschuhen, oder? Die haben einen Notstopp. Ja,Sägen haben auch teilweise einen Notstopp. Danach ist aber oftmals das Sägeblatt kaputt. Also esgibt ja so einen Notstopp für so Kreissägen. Die messen irgendwie die Leitfähigkeit oder dieirgendwie sowas Leitfähigkeit von dem Sägeblatt. Und wenn du deinen Finger dranhältst, dann merkter das quasi in Millisekunden Schnelle und haut von unten quasi so ein Bremsblock rein in dasSägeblatt. Sodass dein Finger halt noch dran ist, selbst wenn du es reinhältst. Aber der Finger isthalt dann zumindest angeschnitten, aber halt nicht ab. Aber das Sägeblatt ist halt im Arsch.Wobei ganz ehrlich, besser Sägeblatt im Arsch als Finger ab, oder? Ja, Sägeblatt ist billigerals Arbeitsunfall. Ja, Arbeitsunfall ist ja eh nochmal extra teuer. Ist doch 10, ja. Dannlieber Sägeblatt oder wie? Was haben wir denn sonst noch? I leaked my IP address. Oje Leute,jetzt ist vorbei. Ich habe auch schon meine IP geleaked. Instant gehackt durch den Chat warich dann wieder. Chat war instant drin bei mir. Eure Smart Home Automatik. Ah ja, das gucken wirjetzt. Das finde ich immer gut. Also das Einzige, was bisher passiert ist, als ich mal ab und zumeine IP geleaked habe, ist, dass es irgendwelche komischen DDoS Leute nicht lassen konnten undmir den Stream versauen mussten. Weil ich mir dann denke, ja, sollen sie mal machen.Was hältst du von Morpheus to Twins? Habe ich tatsächlich erstaunlich wenig gesehen,aber das, was ich gesehen habe, fand ich nicht schlecht. Ich habe kaum was gesehen, muss ich sagen,bisher. Ich kenne den Channel, aber wenig Content geguckt bisher. Okay, lassen wir uns mal einbisschen Home Automation zeigen wieder. Was haben wir denn hier? Oh, eine Tür-Gegensprechanlage,das ist ja so meine, da habe ich ja eine Schwäche für. Das müssen wir uns jetzt mal angucken. Also.Wieder eure Automationen an und wo ihr überall Sensoren hingebaut habt. In Klingeln. Du bistein Künstler. Unter Sitze oder so, dass Stühle wissen können. NordVPN? NordVPN gibt es bald. Ichhabe schon eine Anfrage von NordVPN. Bald gibt es NordVPN Leute. Ihr seid echt verrückt. Alsodas Gute verrückt, nicht das Putin verrückt. Also lassen wir uns wieder von euren Automationeninspirieren und ich lasse für jede gezeigte Automation einen 50 Euro Amazon-Gutschein springen.Menschentiere Automation, Ausgabe 15. Los geht's. Was ist denn da? Das ist überhaupt nicht. Fangenwir an mit Tobias, der hat ein paar Frickelzeugprojekte geschickt. Ich bin gespannt. DieFrickelzeug-Dorbe ist, wie der Name schon sagt, ein Fingerabdruckscanner und eine Klingel in einemGerät. Da der Auto-Unlock meines Nukis bei uns nie so richtig zufällig funktioniert hat.Den Knopf hat er nachträglich reingemacht, oder? Sieht aber ziemlich gut aus. Sieht fast originalaus. Wollte ich eine andere Möglichkeit, unmöglichst bequem und schlüssellos ins Haus zu gelangen.Dazu habe ich unsere alte Klingelplatte etwas aufgemotzt und den alten Drucktaster durch einenrunden Finger abgedrückt. Sixhead. Das ist eine coole Idee. Das ist eine gute Idee. Das ist einemega nice Idee. Finger hat man noch immer dabei. Das muss ich mir aufschreiben. Weil,warum ich das sage ist, ich bin ja gerade dabei, dass mein Hoftor automatisch auf und zu geht.Beziehungsweise nicht automatisch. Dass ich mein Hoftor elektronisch auf und zu machen kann.Wenn du an der Wassersäge bist, dann sind die Finger ab. Jet, gute Überleitung zurVideo davor. Oder was heißt Überleitung? Retroleitung. Aber das wäre eine coole Sache.Das wäre eine wirklich coole Sache. Da brauchst du keine Fernbedienung. Du brauchst kein NFC-Tagscannen oder sonst was. Du kannst einfach deinen Finger dran halten und du hättest die Möglichkeit,das Hoftor aufzumachen. Das finde ich ist eine richtig coole Idee. Du kannst das für Automationennutzen, weil du die Finger kennst. Das ist ja genial. Das ist wirklich eine coole Idee.Also sprich, wenn einer den Finger drauf hält und der Knopf erkennt den Finger nicht, dann klingeltund wenn du den Finger draufhältst und er erkennt den Finger, dann kannst du zum Beispiel das Hoftoraufmachen. Das ist eine ziemlich coole Idee. Sehr nice. Sixhead. Oh nein, gut, das bräuchte ichnicht. Das ist eine coole Idee. Du bist ein Künstler. Das ist eine gute Idee. So ein Videohabe ich auch schon gesehen. Leute, die sich ein NFC-Chip unter die Haut spritzen lassenhaben, dass man damit dann verschiedene Sachen auslösen kann. Ja, das habe ich auch schon gesehen.Und es gibt mittlerweile sogar fertiges Setz. Da ist der RFID-Chip dabei und so eine Spritze,um sich das unter die Haut zu spritzen. Ich würde mir im Leben kein RFID-Chip unter dieHaut spritzen. Vor allem, wie kriege ich den wieder raus, wenn ich den nicht mehr haben will?Wenn die Tür auch abgeschlossen ist, wurden die Türen dazu gezogen. Das ist aber eine richtiggute Idee. Das gefällt mir. Das verlängert die Akku-Laufzeit im Nuki doch erheblich. DasGanze habe ich realisiert über einen ESP32-Mikro-Controller, der über MQTT mitmeinem Open Hub Server verbunden ist. Das Klingelsignal wird außerdem als Backup analogüber das bereits alte, vorhandene Klingelkabel übertragen, nur um sicher zu gehen, dass auchkein Besucher oder Paketbode aufgrund... Okay, lass mal kurz checken. Also. Can be usedto ring the... Gut, mit irgendeinem Relay dann, weil sonst wird das wahrscheinlich nichts.Ah, das sind die Knöpfe, die Kabel von dem Fingerdrucksensor. Okay, das muss man also selbstprogrammieren, die ganzen Finger. Aber trotzdem ist es eine wirklich gute Idee. Ich bin amüberlegen, ob ich nicht sowas auch machen sollte. Und mal streigen, der Technik unerkannt bleibt.Den Fall hatte ich anfangs einmal. Gute Idee. Das war kein Spaß. Finde ich sehr, sehr nice.Das sinkt sicherlich sofort die Akzeptanz in der Familie. So kam noch eine kleine Web-Anwendungzur Verwaltung der Fingerabdrücke und der Konfiguration dazu. Web in the face gebaut, easy. Ichhabe aber mittlerweile auch schon zwei nachbauten im Freundeskreis. Wer das Ganze ebenfalls nachbauenmöchte, ich habe den Quellcode und die Binary... Was ist, wenn einer mit Handschuhe kommt? Naja,musst du halt den Handschuh ausziehen, wenn du das aufmachen willst. Aber ich habe nieHandschuhe an, selbst im Winter nicht. Dokumentation auf GitHub veröffentlicht.Und du kannst ja immer noch die Fernbedienung drücken für das Schraub. Ansonsten googelteinfach nach Fingerprint. Zeigt mal her. Fingerprint Doorbell Projekt. Ach so,Paketboote mit Handschuh kann nicht klingeln, meint er. Nee, nee, nee, dafür würde ich es nichtverwenden. Ich würde die normale Klingel dran lassen und ich würde zusätzlich das Ding reinzum Öffnen fürs Tor dran machen, nicht zum Klingeln. Zum Klingeln, warum sollte ich meineKlingel auseinandernehmen, die funktioniert ja wunderbar. Ich würde einfach irgendwie draußenso ein Ding hin machen, dass man das auf und zu machen kann, die Tür. 113 Sterne, äh 133 Sterne.Das sieht auch richtig gut aus. Guckt euch das mal an. Also, du siehst fast nicht den Unterschiedzu dem normalen. Niedu, Dankeschön für den Sub. Pog, Pog, Subscription. Das ist sehr nice,finde ich gut. Was kosten so ein Teil? Bei Ali dauert es immer drei, vier Wochen bis es da ist.Guck mal, Fingerabdrucksensor. Nope, nope, nope, nope. Ja, so was hier. Bei AliExpress kostetwahrscheinlich 350. Importierte China-Chinesen sind teuer. Ja, ja, das ist genau der Kleid. Kostet5 Euro bei AliExpress oder so. Alter, was ist mit euch los? Big Stonks, guck mal mal.Ähm, warum wäre das wegen Datenschutz illegal? Du speicherst ja nicht die Fingerabdrücke vonden Leuten. Fingerprint-Sensor. Sei, warum ist das so teuer? Ich meine, okay, es kostet beiAliExpress schon mal nur die Hälfte. Aber trotzdem, warum ist das so teuer? Keck. Keck, wait. Why soteuer? Dauerhaft. Das ist typischer China-Import-Name. Da müsst ihr danach Ausschau halten. Also,wenn ihr wissen wollt, ob ein Hersteller China-Chinesen-Import ist, dann müsst ihrnach solchen Wörtern Ausschau halten. Die heißen alle irgendwie nach so einem speziellen Muster.Kann ich schwer beschreiben, aber die haben alle so einen... suche im Wörterbuch random ein Wortraus. Form schöner, schneller Fingerabdrucksensor. Ist das Paid-Bewertung?Arrivato shagiato. Wahrscheinlich heißt das, kam kaputt an? Heißt das, kam kaputt an?Kaputt angekommen, ja. Na gut, wenn das bei den Italienern nicht funktioniert. Aber kaputtankommen kann er bei mir auch. Aber 35 Euro ist gar nicht... Warum ist das so teuer? Weshalb ist das Ding so teuer? Ist doch jetzt nicht so als wäre da wahnsinnig viel Zeug dran, ne? Professional Performance. Aber von der Idee her finde ich das wirklich sehr, sehr nice.Alle anderen Sachen sind halt müllig. Aber wenn man sich das hier anguckt.Nochmal der gleiche, guck mal, noch mal der gleiche. Er kostet 34 Euro. Der Kram ist wirklich auf Amazon.de sehr, sehr teuer. Ich meine, bei Aliexpress ist es schon teuer. 15 Euro ist für Aliexpressein riesen Ding. Warum sollte ich dieses Board...So einfach nur ein Spannungswandler, oder? Ne, was ist denn das? Irgendwas mit Buzzer oder so drauf?Soll ich vielleicht einen Scanner suchen?Naja, ne. Ganz schön teuer für so ein kleines Teil. Aber es ist eine richtig gute Idee. Ich glaube, ich glaube, das werde ich mir mal im Hinterkopfbehalten.Ah ja, gut. Ein Klo braucht man ja auch. Ein Fingerabdrucksensor braucht man nicht wirklich. Das ist reine Spielerei und im Vergleich dazu benutzt du das Klo halt auch für wichtigeGeschäfte, ja. Natürlich ist ein Klo wichtiger als ein Fingerabdrucksensor.Wie das Projekt und zu den ganzen Produkten, soweit ich die finden kann, die wir heute im Video sehen, unten in der Videobeschreibung.Mein zweites Projekt, das ich euch vorstellen möchte, ist das NS-Panel von Sonoff.Ja, das juckt mich überhaupt nicht, das Ding. Da gibt es ja mittlerweile ein neues NS-Panel, sogar mit Android drauf.Habe ich kein Anwendungsgebiet für. Also im Flur habe ich meine Fire HD 10 Dashboards hängen, die besser sind als jedes Sonoff-Panel.Vor allem habe ich mehr Platz. Ganz normales Home Assistant-Dashboard drauf.Das Panel habe ich direkt am ersten Tag mit Tasmutter geflasht und dann meine eigene...Ah, das ist noch das alte, das ist noch das alte ESP32-NS-Panel. Ja, das ist ja noch unsinniger....entwickelt. Hier zeige ich mir an der Haustür die wichtigsten Infos an, die ich beim Verlassen oder beim Betreten des Hauses benötige, neben der gefühlten Außenneparatur.Ganz ehrlich, ich gucke morgen Wetterbericht und gut ist und außerdem kann ich auf mein Tablet im Flur gucken.Ja, sieht jetzt sehr brauchbar aus und je nachdem wie ihr das gemacht habt, dann ist es auch... Aber ich habe ich keine Anwendungszwecke für.Das habe ich übrigens auch. Also die Anzeigen habe ich mehr oder weniger genauso bei mir auf dem Tablet.Ich habe eine Anzeige, ob noch Licht an ist. Ich habe eine Anzeige, ob noch Fenster bzw. irgendwelche Fenster-Türkontakte offen sind.Gut, Garage habe ich nicht drin, weil Garage ist nicht automatisch öffnbar. Und Alarmanlage, ja.Ob ein Fenster offen ist oder ob die Garage noch offen ist oder der Status der Alarmanlage.Ich frage mich, wie du mit dem Schauen aus dem Fenster sagen willst, wie da Vormittag insgesamt wird.Ich meine, du kannst sagen, jetzt scheint die Sonne, aber du weißt ja nicht unbedingt, wie das um 12 Uhr Mittag ist.Ich lasse mir über ein kleines Textfeld weitere Details anzeigen, wie z.B. die gesamte Liste der noch offenen Fenster.Über die Symbole kann ich zudem Lichter oder Rollen pro Stockwerk schalten oder auch die Garage öffnen und schließen.Für die Haustür nutze ich einen eigenen Fensterkontakt, damit der Snooki auch hier...Da hat er sich aber Mühe gegeben. Was ist das für ein Kontakt?Kleiner Exkurs zu Fenster und Türkontakten. Ich nutze mittlerweile überall die Fensterkontakte FT.Ah, das ist Dings hier. Das ist N-Ocean, glaube ich.Also das ist so ein Funkprotokoll, wo die Sensoren keine Batterien benötigen.Ja, kostet was, aber dafür musst du nie Batterien tauschen.Die machen das irgendwie so, das ist irgendwie so ein ultra low power Funkprotokoll und durch quasi die Energie, die das Schalten irgendwie bringt, können die einmalig übertragen.Du musst halt nie Batterien tauschen.Es hat was, ja.Aber es ist halt teuer.Ganz ehrlich, dann...In dem Fall kaufe ich... Reichweite musst du mal gucken. N-Ocean heißt der Kram, glaube ich.Aber ganz im Ernst, die ganzen passiven Sensoren, sei es jetzt Fenster, Türkontakte oder auch Schalter, die halten Jahre, die halten wirklich lang mit kleinen Batterien drinne.E.K.E. von El Taco. Die sind zwar mit 45 Euro recht teuer, lassen sich aber unsichtbar im Fensterrahmen verstecken und dank N-Ocean und Energy Harvesting nie wieder eine Batterie wechseln zu müssen.War für mich schlichtweg nicht so.N-Ocean, ja.War für mich schlichtweg das Killerfeature überhaupt.Der Vollständigkeit halber will ich auch noch kurz meinen automatisierten Briefkasten zeigen.Das funktioniert bei mir leider nicht richtig.Das ist auch ein Projekt, was noch ansteht.Briefkasten.Aber mein Briefkasten hat so eine komische Form.Da habe ich ja nichts Gutes gefunden.Ich habe viel Automatisierungsshit, aber kein Briefkasten.Also eigentlich hätte er dafür das hier nehmen müssen.Sie haben Post.Eigentlich hätte er das nehmen müssen, oder?Sie haben Post.Falls es noch irgendjemand kennt.Da Frauen und Kinder der Technik nicht immer trauen oder im Falle der Kinder mich manchmal einfach nur ärgern wollen, kann ich den Status am NS-Panel auch noch manuell quittieren.Kinder Tibet nehmen.Oder besser gesagt, einer deiner Zuschauer. Er hat mit seiner Vorstellung von Autositzsensoren mir völlig neue Welten eröffnet.What?Ich nicht immer trauen oder im nächsten Projekt...Moment, Moment, was?Was du...Ist das...Gewichtssensor auf dem Stuhl?Sixhead-Time, Alter!Da kann man erkennen, wenn man auf dem Stuhl sitzt.Bis wie viel Kilo ist das belastbar?Aber das ist eine gute Idee. Das ist eine coole Idee.Da kann man was mit anfangen.Von Autositzsensoren mir völlig neue Welten eröffnet.Ich weiß nicht, wie ich bisher ohne ein automatisiertes Bett überhaupt leben konnte.Leider funktionieren die Autositzsensoren unter einer 15 cm dicken Matratze nicht wirklich gut.Also habe ich nach einer anderen Lösung gesucht und auch gefunden.Bei mir sind nun unter den beiden Lappenrosten jeweils vier Welgezellen im 3D-gedruckten Gehäuse zusammen mit einem ESP.Nice!Damit habe ich tatsächlich auch mal experimentiert.Ich hatte es zum Beispiel so, dass das Licht ausgeschaltet hat 15 Minuten nachdem ich ins Bett bin.Coole Sache, aber eigentlich relativ überflüssige Spielerei.Wenn man wirklich erkennen will, ob man im Bett ist, gibt es einfachere Methoden, die auch ganz gut funktionieren.Man kann zum Beispiel, wenn man sein Handy abends anschließt und lädt, falls man das macht.Oder meistens geht es auch mit Uhrzeit ganz gut.Oder aber, so wie ich es mittlerweile habe, ich habe einfach bei mir an der Tür jetzt einen Schalter hängen.Da drücke ich drauf für, ich gehe ins Bett.Dann ist es auch sicher, dann ist es keine Zufallserkennung oder so.Dann weiß ich auch sicher, jetzt kann ich alle Lichter ausschalten.Und was passiert denn eigentlich noch? Lichter ausschalten?Spaß eigentlich.Überall Lichter ausschalten.Und das Licht im Schlafzimmer noch anlassen und so was.Und dann das Licht im Schlafzimmer automatisch ausschalten nach einer Minute.Da kann man schon ganz coole Sachen machen.Das sieht aber so ein bisschen so aus, als wären nicht nur vier Wegezellen im Einsatz, sondern acht.Habe ich das eben richtig gesehen, dass die andere Betthälfte auch gewogen wird?Dünnes Eis.Das gesamte Ehebett ist nun eine einzige große Waage mit zwei voneinander unabhängigen Waagschalen.Ob die Frau so gerne gewogen wird?Dann recht gut arbeiten und nicht nur eine Belegungserkennung realisieren, die zum Beispiel eine Zu-Bett-Routine oder Aufstehroutine triggert,sondern abhängig vom Gewicht oder auch Zusatzgewicht zu gewissen Zeiten auch andere nette Spielereien treiben.Was passiert denn, wenn das Gewicht in kurzer Zeit sich ändert?Das ist Mamas und Papas Bett. Geh wieder zurück in Deins.Gute Nacht.Ja, vielen Dank. Also bei uns hilft so eine Ansage im Moment, egal ob sie von Alexa oder von mir kommt, nicht so richtig.Darum trage ich diese Augenringe.Ja, danke Tobias.Ach, die Augenringe. Ich sehe keine Augenringe.Mein Kopf brummt ein bisschen. Die Klingel mit dem Fingerabdruck ist genial.Und das Wiegebett ist auch auf jeden Fall eine interessante Idee. Auch der ganze Rest.Mit dem NS-Penner habe ich nach wie vor noch ein kleines Namensproblem.Stimmt, das hat wirklich einen blöden Namen, gerade in Deutschland.Und einfach die verschiedenen Sachen. Ich glaube, du hattest Home-Matic-Sensoren, den El-Taco-Fenster-Sensor.N-Ocean, ja.Also einfach alles so zusammengezogen, wie es für dich gut funktioniert.Die Türklingel-Geschichte ist wirklich nice.Wenn auch ihr was zu zeigen habt, dann schickt es gerne unter zeug.cool slash zeigen.Also sendet bitte nicht unbedingt ein 6-Minuten-Video wie Tobias ein.Eure Chancen stehen besser und euer Lohn ist auch besser, wenn es nur 2-3 Minuten lang ist.Und wie gesagt, für jede gezeigte Aufnahme gibt es 50 Euro.Und diese 50 Euro bekommt auch Michael, falls sein Video es in den finalen Schnitt des Videos schafft.Eine Automatisierung, um das Staubsaugen mit meinem Roborock-Staubsauger so einfach und smart wie möglich zu gestalten.In der Küche wird hierbei nur benötigt, dass nach dem Essendettich abgeräumt und abgewischt wird.Danach werden die Stühle hochgestellt und die Küche einfach verlassen.Kurz darauf wird die Küche automatisch gestaubsaugt.Guck mal, der hat da unten irgendwas dran.Ist das ein Sensor, der erkennt, ob das Ding auf dem Kopf steht oder nicht?Irgendein Beschleunigungssensor oder irgendwas in der Richtung?Gut, das passiert bei uns auch über eine Zeitschaltfunktion.Du hast jetzt gesagt, das hängt an Arbeitsabläufen.Ich habe nicht gesehen, dass irgendjemand bei euch gerade irgendwas, also wie weiß denn der Tisch, dass er abgewischt ist?Ja, da ist ja irgendwas unten, irgendwas ist ja da unten am Stuhl dran.Die Automatisierung dazu habe ich in Habitat mit Regeln.Habitat verwendet das jemand, okay.Küche-Chairs-Up-Sensor.Was ist das?Hexerei?Dazu verwende ich eine 3D-Sensor.Ah, okay, das ist das Weiße, was man da unten sieht.Und was hat er da dran?Die Geburtsverhalterung für einen Türkontakt-Sensor, welcher auf eine Medikule macht.Ach so, Alter, das ist ja viel simpler, als ich das gedacht habe.Das ist ja viel simpler, als ich gedacht habe.Ich dachte, da hat er einen Beschleunigungssensor oder sowas dran.Der hat einfach so einen ganz normalen Fenster-Open-Closed-Sensor.Und den hat er in so ein Gehäuse gesteckt, dass der Sensor sich halt bewegen kann.Der Sensor geht nach unten, wenn der Kopf übersteht.Beziehungsweise, nee, der Sensor geht nach unten, wenn der normal steht.Und der Sensor geht ran, wenn der rumgedreht wird.Das ist eigentlich ziemlich high IQ.Also aus was Simplem, was Sixheadiges gemacht.Genau.Sixhead-Movement-Threehead-Technik, so sieht es aus.Was das daneben ist, weiß ich nicht so genau.Das ist ja genial. High IQ.Ihr seid ja in Best-Form.Das brauche ich auf jeden Fall nach.Gute Idee.Werden nun die Stühle wieder alle hochgestellt, schließt sich der Türkontakt-Sensor.Eine Automatisierung prüft dann, ob...Also, das ist, dass sie auch wie so ein ganz normaler Acura...Äh...Acura...Xiaomi...Türkontakt-Sensor.Hat der das 3D-Model irgendwo?Nope.Jetzt haben wir eine gute Idee.Wirklich gute Idee.Dann fährt er los.Das ist ein einfacher Fenster-Kontakt.Ja, Idee ist gut.Ok, ja,Nach Ablauf des Timers wird diese Liste an Räumen dann an Roborock übergeben und somit werden diese Räume dann gestaubsaugt.Aber das wäre mir zu aufwendig.Jederzeit in jedem Raum das Staubsaugen anzustoßen, ohne sich auch nur einmal mit der App auseinanderzusetzen.Aber eine gute Idee ist es so, nach dem Motto Klick drauf und am nächsten Durchgang fährt er dann in den Raum. Eigentlich nicht schlecht.Also das baue ich auf jeden Fall nach. Ein billiger Fensterkontakt, der in einer kleinen Führungsschiene, die ich selber drucken kann, rumrutscht.Wunderbar. Danke Michael.Ja, gute Idee.Ich denke, da könnten wir tatsächlich den ein oder anderen Nachahmer anstiften. Also mindestens einen.So, Johannes sichert Daten.Wirklich coole Idee.Kurzbefehlen am Mac.Das klingt für mich wie ein Rezept für Desaster. Schauen wir mal rein, was er sich da gebastelt hat.Ich habe mir eine kleine Automation gebaut und das Schreiben meiner Bachelorarbeit ein bisschen zu helfen.Was sehen wir da im Hintergrund? Was ist das? Ist das HomeKit?Nein, Shortcuts ist das. Apple, Apple, Siri, Shortcuts.Das ist das, das ist Paynes Champ zu arbeiten damit, Alter. Selbst einfache Sachen sind da fünf Seiten lang.Das Programm ist teilweise nicht sehr zuverlässig in der Speicherung von Daten.Außerdem kommt es manchmal vor, dass ich Änderungen vornehme, die ich am Ende gerne rückgängig gemacht hätte.Dann ist aber schon einige Zeit vergangen und mir fällt die Textpassage zum Beispiel nicht mehr ein.Wie wäre es, er könnte es einfach in Plain Text schreiben und in Git einchecken?Diesen Umstand zu lösen und um eine Sicherung zu haben, habe ich mir in der Kurzbefehle App eine kleine Automation gebaut, die genau das löst.Und dazu ruft er am Anfang die Netzwerknamen von meinem WLAN ab, mit dem mein Mac gerade verbunden ist.Das hat den Hintergrund, dass gerne, wenn ich zu Hause bin, die Arbeit zusätzlich auf meinem Heimserver speichern möchte.Wenn das Netzwerk einen beliebigen Wert hat, also immer wenn ich mit einem Netzwerk verbunden bin, erstellt er hier aus dem Dokumenteordner ein.Ah, das interessiert mich nicht. Next....gesucht oder so. Mein Mail-Programm macht in der aktuellen Version von irgendwelchen Arbeiten, aber generell Shorty hatte ich nicht auf dem Zettel.Hm. Shortcut Trigger, Application, Time, der ist sogar in der gratis Version. Es ist ein Traum.Vielen Dank für diesen Hinweis. Und alles Gute für die Bachelorarbeit.Aber jetzt kommen wir zu einer ganz anderen Automation von mir.Jede Woche öffnet sich diese App und ich kann aus über 30 wechselnden Rezepten auswählen.Nice Sponsoring.Dann kommt ein paar Tage später hier ein Karton mit abgezählten Zutaten und schicken Rezeptkarten nach Hause.Ich muss mir keine Gedanken machen, wirst du zu essen, wirst du zur Thermomix extra dabei, die du sonst, wenn du für dich selbst gekocht hättest, vielleicht weggelassen.Den Link unten in der Videobeschreibung benutzen. Frohes Automatisieren und guten Appetit.Apropos Essen. Pit liefert ein paar Kühe für die Tiere im Namen dieses Formats.Apropos Essen meine ich, dass es hier irgendwie um ein smartes Fressgetter geht.Nicht um die Tiere natürlich.Vom Herdenmanagementprogramm.Einfangmechanismus.Ich habe überhaupt keine Ahnung von Viehzucht.What?Ich checke überhaupt nicht, was da passiert.Wolle Dankeschön für 15 Monate als Subscription.Was, was bin ich sehend?Fünfeinhalb Wege Ventil.Damit kann man irgendwie Gitter auf und zu machen oder so.Und was passiert jetzt? Die kriegt den Hals abgeschnitten oder wie?Die allerdings auch nicht.Ich hoffe ja nicht.Ach jetzt sind sie eingefangen, jetzt kommen sie nicht mehr raus.Nee.Hä?Okay, um 4.30 Uhr werden die Fressgitter geschaltet.Ich muss gestehen, ich habe nicht so richtig verstanden, was hier passiert.Ich auch nicht. Ich auch nicht.Um die Tiere fixieren, um an den Tieren arbeiten zu können. Fieber messen.Trächtigkeitsunversuchung.Ach, da geht das Gitter zu, dass der Kopf da drin stecken bleibt oder wie?Und das Warten, bis die Kühe eingefangen haben, war nicht smart genug.Die Kühe werden nach dem Melken am Melkroboter automatisch aussortiert in die Behandlungsbox.Und das Ganze mit Pneumatik gelöst, weil die Melkroboter Druckluft benötigen,dadurch wäre der Kompressor sowieso schlecht.Ach, jetzt verstehe ich es.Es gibt Fressen.Dadurch, dass es Fressen gibt, strecken die Kühe ihren Hals durch das Gitter.Dann geht das Gitter zu, sodass man an die Kühe dran kann.Aha, verstehe.Behandeln und vermeiden Kriegssturm.Ja, ganz spannend, dass man sowas einfach mit ein paar Zwischensteckern auf ihm machen kann.Jetzt habe ich es verstanden.Es gibt ein paar Landwirte unter euch, die aus dieser Geschichte irgendwie ein bisschen was gewinnen können.Oder es sind ein paar Landwirte unter euch, die andere Automationen für zukünftige Ausgaben für mich haben.So, Alvin berichtet von KNX.Und da habe ich doch im Moment ein sehr gespitztes, offenes Ohr.Weil das ja eine Option fürs neue Haus ist.Und wenn ihr dieses Video seht, dann bin ich fast aus dem Urlaub zurück.Und dann können wir endlich mit Livestreams rund um das neue Haus anfangen.Vielleicht ist der auch schon geplant.Und du findest den unten in der Videobeschreibung.Aber jetzt schauen wir erstmal, was Alvin geschickt hat.Und zwar habe ich in meinem Haus ein KNX-System verbaut, was aber leider nicht ganz vollständig war, da ich alles selbst geplant und mir alles selbst beigebracht habe.Nicht schlecht.Dazu später aber mehr.Um die Automationen zu realisieren, habe ich mich für Apple HomeKit entschieden und habe mir dieses kleine Gerät hier gekauft, das mein KNX-System HomeKit-fähig macht.Also ehrlich gesagt, ich mag HomeKit nicht sonderlich.Interaktion mit Apple-Geräten ist natürlich nice.Wenn man das unbedingt dort dann beispielsweise im Widget haben will oder so.Aber sonst kommt man auch wunderbar ohne HomeKit aus.Zumal Apple wieder ganz komische Geschichten macht.Du konntest die ganze Zeit ein am Kabel hängendes iPad als HomeKit Hub oder so verwenden.Also sprich, dass du auch von außen schalten kannst und so, wenn man das will.Das geht nicht mehr.Hat Apple jetzt abgeschafft und es geht jetzt nur noch mit einem Apple TV oder einem Apple HomeKit Hub oder sowas.Also solange ich einen Bogen im HomeKit machen kann und das nicht für irgendwas brauche, mache ich einen großen Bogen drum.Habe ich auch hier schon angefangen.Und zwar gehen dann zu einer bestimmten Uhrzeit im ganzen Erdgeschoss die Rolladen runter, die Beleuchtung am Haus sowie der Springbrunnen an.Außerdem noch diverse Geräte im Haus.Diese Automation habe ich wie gesagt ohne großen Aufwand den Apple HomeKit erstellt.Ich will noch eine weitere Automation, dass um 0.30 Uhr dann die ganze Beleuchtung im Haus und am Haus ausgeschaltet wird.So wie alle Steckdosen und anderen Geräte, die nachts nichts zu tun haben sollten.Da habe ich mich übrigens auch von dir inspirieren lassen, als du mal darüber berichtet hattest, dass deine Koma-Anlage die ganze Nacht gelaufen ist.Ich erinnere mich.Also grundsätzlich eine Automation zu haben, die irgendwie nachts einmal alles sicherheitshalber anfangen.Er hört sich voll motiviert an, ja das stimmt schon.In Zeiten, wo wir noch ein bisschen genauer auf Energieverbräuche gucken, schon ganz wertvoll sein.Ja und um nochmal auf den Anfang zu sprechen zu kommen.Er hört sich mit seinem KNX-System so ein bisschen gelangweilt an.Und so fehlen mir ja hier im System auch viele Komponenten, die ein Haus erst wirklich smart machen.Jetzt wollen wir mal sehen, was ihm fehlt, weil das ist ja der spannende Teil, die Reue eines Hobby-KNX-Implementeurs.Wie zum Beispiel Tür- oder Fensterkontakte, eine Wetterstation, einen Zeitserver und so weiter.Wetterstation habe ich ja mittlerweile.Haben wir ja sogar im Streamer ein bisschen was gebastelt für Wetterstation habe ich und muss sagen, ich bin echt zufrieden damit.Weil jetzt zum ersten Mal habe ich wirklich ordentliche Außentemperatur, wo ich auch weiß, das stimmt halbwegs.Also sowohl Außentemperatur als eben auch Windgeschwindigkeit und ob es geregnet hat in letzter Zeit.So diese drei Sachen, das ist eigentlich das, was mich hauptsächlich interessiert.Hat es geregnet so die letzten 1-2 Stunden? Ist viel Wind bzw. welche Temperatur?Der Rest interessiert mich jetzt nicht so sehr, was die Wetterstation auch kann.Aber das finde ich sehr praktisch.Also es hat sich gelohnt, die China-Chinesen-Wetterstation da hinzustellen.Seht ihr? Und weil ich ja jetzt...Zeitserver? Ich wusste nicht mal, dass das eine Sache ist.Und warum nicht, dass ich die vielleicht vermissen könnte?Diese Schnittstelle mit HomeKit habe, kann ich mir diese Geräte nun aufnehmen.Ohne NTP-Lokal, wie sollen da Geräte denn die richtige Zeit haben? Dauerhaft....nachrüsten, ohne noch Kabel verlegen zu müssen.Vielen Dank für den Input, Alwin. Also mich hat es auf jeden Fall interessiert.Ich hoffe, einige von euch auch. Und jetzt schauen wir mal weiter.Tobias hatte irgendwas mit Rudern geschickt.Für alle Sportler unter euch sind, das heißt, wenn ihr ein Sportgerät habt oder eine Ecke,wo ihr Sport betreibt...Was ist das da hinten? Ist das ein Reiskocher oder Popcorn-Maschine?Einmal, wenn es dunkel ist, dass es dann halt das Licht angeht.Und zum anderen, wenn ein bisschen coole Musik läuft.Und das habe ich relativ einfach hier mit meinem Rudergerät gemacht.Kann man aber auch mit sämtlichen anderen Geräten machen.Ein Widerstand fürs Rudern, okay.Man könnte sich vielleicht schon denken, ich habe hier einen Motion-Sensor drinnen oder drunter.Ich kann das mal zeigen.Seht ihr hier, unter dem Sitz.Und wenn man anfängt zu rudern, bewegt man sich ja.Und dadurch wird eine Bewegung erkannt.Es ist aber auch so, dass eine gewisse...Da geht aber die Batterie relativ schnell leer, weil der Lauf Bewegung erkennt.Tobias, ich möchte deine Träume nicht zerstören, aber das, was du da machst, ist kein Rudern.Aber die Batterie geht schnell.Also wenn man hier, ich glaube, 30 Sekunden anfängt zu rudern.Das mache ich jetzt mal.Im Moment läuft auch Radio im Hintergrund.Dann merkt er sich das, dass vorher Radio lief.So ist das Licht angegangen hier oben.Und die Musik.Boah!Toss!Toss!Ich nehme euch das mal kurz weg.Toss, ich wollte es gerade sagen.Wenn ich aufhör zu rudern...Toss, Toss!Man hat es davon abgesehen.Ausschalten geht auf jeden Fall schön.Und die Musik ist auch wieder...Aber das Ding wird total schnell die Batterie verlieren, weil der permanent Motion meldet.Da ist es wahrscheinlich in 2-3 Monaten leer.Jetzt läuft das Radio schon wieder.Das heißt, der stellt den ursprünglichen Zustand wieder her.Auch ganz nett.Allerdings sind natürlich die ersten 30 Sekunden, die du im Winter im Zweifel, im Dunkeln und ohne Musik ruderst, etwas trostlos.Aber das kann ja auch ein Ansporn für den Sport sein.Eigentlich wäre es besser, die Sicherheitsphase irgendwie an die Anzahl der Ruderbewegungen zu binden.Wenn ich jetzt einfach schnell durchziehe, dann kriege ich keine Ahnung.Geht schnell Licht an.Ich habe keine Ahnung von Rudern.Willis Video fängt offenbar mit mir an.Das kann ja kein gutes Zeichen sein.Dir die Möglichkeit erlaubt, auch Sachen zu steuern.Die Fenster wirst du jetzt nicht per Knopfdruck zumachen können.An diesem Punkt muss ich dich gleich einmal unterbrechen.Anzeige ist raus.Genau das tut.Hey Siri.Was war denn hier alles am Start?Die Fenster aus.Boah, ist das laut.Die Idee dazu kam hier, da meine Schwester im Zimmer unter mir wohnt.What the fuck?Was ein riesen Ding, man.Von Balkon raucht.Dadurch zieht der Rauch immer zu mir ins Zimmer.Was besonders, wenn man gerade durchlüften will, durchaus störend ist.Ich weiß nicht, ob ich das als Korrektur für meine Aussage akzeptieren kann.Also ja, technisch schließen deine Fenster automatisch.Aber es gibt da so zwei kleine Haken an der Sache.Vielleicht finden die anderen Zuschauer das.Das Ding hängt halb im Raum.Es gibt natürlich viel Platz in den Haken weg.Wenn man das verdreht, finden sie es auf jeden Fall.Aber da ich diese Ecken sowieso nur als Abstellfläche nutze,sind die Motoren nicht allzu sehr im Weg.Gesteuert wird das Ganze über ein Relais-Boardaus einer Steckdosenleiste von Didel Smart Home,welcher seit neuestem endlich mit HomeKit kompatibel ist.Dieses Board habe ich ausgebaut und mit 5 Volt versorgt.Die zwei Relais auf dem Boardsteuern je ein weiteres Relais pro Fenster an.Welches den Strom der linearen Motoren um...Ist das... Ich hoffe nicht,dass hier irgendwie 230 Volt rumläuft, oder?Das ist dann vielleicht doch ein bisschen,sagen, etwas mutig.Am Fenstergriff befindet sich ein Schalter,der bei geschlossenem Griff den Stromfluss...Ist das ein Legu-Stein?Ist das ein tragender Legu-Stein?... zum Motor stoppt,damit dieser das Fenster nicht aus der Verankerung reißen kann.Der Motor ist aktuell nur mit Heißkleber am Fenster befestigt,da sich das Ganze noch in der Testphase befindet.Dadurch ist nicht mehr der Fensterrahmen der Schwachpunkt,sondern der Kleber, was vor Beschädigungen schützt,falls das Fenster einmal klemmen sollte.Hey, Siri, schalte Fenster ein.Schalte Fenster ein.Boah, ist das laut auch.Natürlich lässt sich das Ganze auch wieder automatisch öffnen.Also, das ist eine coole Sache, aber ganz im Ernst, ich...Also, ich hätte das nicht gebaut,wenn mir da nichts bisschen Schöneres eingefallen wäre.... in- und außen Temperatur- und Feuchtigkeitssensoren verbauen,um ein automatisiertes Lüften zu ermöglichen,wenn beispielsweise nach einem warmen Tag...Was hat denn da oben an der Decke und so alles hängen?Zudem arbeite ich gerade noch an einer Möglichkeit,die Rollos zu automatisieren,was allerdings noch etwas Software braucht,damit das Fenster nicht geöffnet werden kann,solange die Rollos unten sind.Okay. Also, ich finde auf jeden Fall gut, dass du etwas gebaut hast,was für dich funktioniert.Das ist ja irgendwie die Hauptsache an der ganzen Geschichte.Ich weiß jetzt nicht, wie Maske kompatibel...Also, cooles Bastelding, aber...Also, ich hätte... weiß nicht.Ich lege jetzt ja nicht so wahnsinnig viel Wert darauf,dass das alles komplett unsichtbar ist und alles super gestylt ist,aber das wäre mir auch zu hart gewesen.Eine Lösung ist, weil die meisten Leute, die ich kenne,so ein bisschen an ihrem Wohnraum hängen.Aber hey, was auch immer für dich funktioniert,ist für dich das Richtige.Leon hat einen Ikea-Icon-Generator gebaut.Schauen wir mal rein.Und dann? Und wozu?Aber warum? Warum braucht man das?Ja.Und dann? Ach, zum Draufkleben!Ach so!Na ja, gut.Coolen Leute hätten dafür jetzt irgendwie so ein Laser-Gravur-System.Aber sowas habe ich nicht und sowas will ich auch nicht.Gut, nice, waren coole Sachen dabei.Also ich muss sagen, die Klingel, also generell die Idee,einen Fingerabdrucksensor draußen hin zu machen, finde ich super.Gerade für mein Hoftor zum automatisch auf und zu machen.Da könnte ich mir tatsächlich vorstellen, dass ich sowas machen werde.Ja. Aber erstmal muss ich mein Hoftor fertig, elektronisch auf und zu machen.Auf und zu fahrbar machen.Steuerung, so ist ja alles fertig, auch mit dem ESP32 drin.Aber auf der einen Seite ist halt der Motor noch nicht dran.So sieht es aus.So, machen wir das mal zu alles.Ach ja, was machen eigentlich die Battlefield-Spielerzahlen?Gerade dabei sind, okay, die sind wieder abgekackt, alles klar.Was macht New World?Okay, es ist tatsächlich wieder ein bisschen hochgegangen.Wahnsinn.Okay.Gab es bei YouTube ein Redesign? Ja.Es ist jetzt alles rund.Da haben irgendeinen Ex-Apple-Designer wahrscheinlich mit.Da bin ich mal gespannt drauf.Ich weiß aber nicht, ob ich eine Playstation nur dafür kaufe.Ganz im Ernst.Wahrscheinlich warte ich echt, bis es auf PC kommt.Oder ich gucke mir mal wirklich wieder ein Let's Play an, was ich eigentlich so gut wie kaum noch mache.Hast du schon das neue Video?Was?iPhone Lightning? Nee.Jetzt wird es auch zu harte kost.Leute, wisst ihr was wirklich sehr unpraktisch gerade ist?Es ist 10 Uhr und ich kriege schon Hunger langsam.Normalerweise wäre es 11 Uhr.Machst du nichts?Ist Coding wirklich tot?Okay, komm, wir gucken uns eine Runde Fireships an.Fireships über Pog.Coding ist tot.Ich habe diese Prediktion vorgelesen.Aber werden Programme wirklich...Das ist alles alles blödsinnig.Das ist nicht tot.Es ist in meinem besten Interesse, für die Learn-to-Code-Industrie auf diesem Kanal zu schüllen.Jedoch, wenn wir in 2023 schauen, gibt es wirklich schlechte Windblüte auf dem Horizont.In heute's Video schauen wir an sechs verdammten Trends, die Programme töten.Mit ein paar Schritten Hoffnung am Ende.Bevor wir in die Runde kommen, würde ich mich für Fireship Pro bedanken,um zu lernen, wie zu coden, mit einer neuen Plattform, die ich von Anfang an gebaut habe,die eine faszinierende, faszinierende Erfahrung bietet.Und das könnte deine letzte Chance sein, den Kanal zu unterstützen,bevor Coding für immer sterben wird.Der erste Trend, den ich sprechen möchte, ist Stalled-Technologie.Normalerweise mag ich auf diesem Kanal Spaß machen,aber die Dinge sind so schlecht mit dem Metaverse,dass ich ehrlich gesagt...Ist Facebook eigentlich immer noch PHP?Ich fühle mich traurig an diesem Punkt.Der ganze Metaverse hat wahrscheinlich weniger Daten,als das verdammte Side-Projekt, das du komplett vergessen hast.Was... was passiert?Wie sie einfach nur Geld in das Ding trinken.Und so far ist es nur ein beängstigendes Flop.Ich würde sehr gerne dieses Video von Mental Outlaw anschauen,um zu lernen, warum es so schlecht klingt.Jetzt, obwohl der Metaverse gerade klingt...Ich hab's ja schon mehrfach gesagt, dass sogar die Entwickler,die Metaverse-Entwickler, keinen Bock auf diesen Scheiß habenund sich fragen, warum machen sie das eigentlich?Und im Prinzip sind sie jetzt auf dem gleichen Stand wie ich,sie machen das, weil es Geld gibt.Rest geht in der Masche vorbei.Ganz davon abgesehen, ich glaube, sieht auch keinerwirklich aktuell einen Vorteil von dem Facebook-Metaverse-Shit.Ich meine, die Leute, die irgendwelche spaßige Sachen machen wollen,die machen mit VR, die machen eben VR-Chat oder so was.Alle anderen spielen MMOs.Ja, aber deswegen...Aber deswegen sterben ja Programmierer nicht aus.Und das bedeutet, Start-ups, die Geld verdienen,müssen viel mehr vorsichtig sein, wie sie es spenden.Und einer der größten Kosten für einen Start-up ist, Programmierer zu hüllen.Als von heute aus, scheint der Arbeitsmarktnoch sehr stark auf einem makro-Level zu sein.Jedoch, letztes Wochenende, da gab es Layoffs bei Microsoft,das Preis von Snap kaputt,das bedeutet, dass sie wahrscheinlich mehr Layoffs haben.Dann hast du Elon, der 75% von Twitter-Staffenüberführt hat.Und grundsätzlich haben all die großen Technik-Korporationeneine hohe Anzahl der Start-ups.Und das bedeutet, dass die Start-ups,die die Start-ups haben,auch viel mehr Geld verdienen.Und grundsätzlich haben all die großen Technik-Korporationenmit hohen Anzahl der Start-ups starten.Und das kann nicht verändert werden,wenn die Kosten der Start-ups auch stark sind.Und auch die FED hat gesagt, dass Unbearbeitungmehr in die Anzahl geht, und man sollte nie mit der FED kämpfen.nach wie vor brauchen ich meine nur weil jetzt facebook und google ein paar leute da rausgeschmissen hat sehe ich da jetzt nicht denden sich irgendwie umkehren zumal du ja international theoretisch sogar gucken kannst mittlerweile dank remote home office möglichkeitenWas ja viele deutsche unternehmen mal wieder nicht checken aber ok dann kriegen sie halt keine leuteAnd speaking of casinos another problematic trend is the crypto winter bitcoin is down 70 percent from its high of last yearThat's not a good look for an inflation. Wir haben auf der arbeit einen der schwört auf bitcoinDer will mir die ganze zeit erzählen ich muss jetzt in bitcoininvestieren weil er weil er weiß dass ende2024 ist es ein neuer er hat es in neuer höchststandDa ich mir auch so warum hast du nicht selbst ein ganzes geld in bitcoin gesteckt wenn du dir da so sicher bistIch meine kann sein kann aber auch nicht seinvielleicht vielleicht macht versucht er mich auch zu scamAlso bitcoin ist werde ich nix nix machendisasters that nobody could have ever possibly seen coming in a million years like the collapse of lunaCelsius and voyager about a year ago web 3 or the decentralized web was trending into the stratosphereTeenagers were making millions of dollars for monkeys, and it looked like web 3 was going to make everything else obsolete by this timeThis year, but unfortunately that didn't happen and now you don't really hear about web 3 anymoreWhether you like crypto or not its decline in popularity for the time being is my nft. Ja auch absoluter bullshit warNot a great sign for programming in general in der form wie es da gemacht wurdeThese smart contracts require smart programmers, but if smart people aren't using them, then we've got a problem here in my opinionI think web 3 is in the trough of disillusionmentBut we'll continue to improve and grow in the future an even bigger threat to the lives of programmers is mo code no code and low codeDas wird auch so ein ding das ist wie sie schon seitJahrzehnten erzählen dass jetzt irgendwelche manager und personaler angeblich anfangen ihre eigene anwendung zu programmierenNope, auch auch mit no und low und sonst was code nichtSo programming has kind of evolved into a blue collar professionIt's like being a janitor, but with less exercise luckily as of today. It still pays extremely wellThat's why boot camps like bloom Institute of Technology formerly lambda school can offer a job guarantee of $50,000 a yearThat's nearly $5,000 more than you would make at McDonald's working for $22 an hourAlthough they also offer a free McBus pass the reality though is that technology is now replacing many of the lines of code that used to beProduced by humans typing into a keyboardThere are tons and tons of tools now that make it possible for non engineers to create basic applications webbasic basic vielleichtAber die ganze logik dahinter ganz das kannst du vergessen ist wirst du brauchst programmierer soSehr wie noch nie zuvor und das wird sich die nächsten jahre nicht ändern eher noch verschlechtert sites and even back-end utilities and databasesdatabases on top of that engineers are now writing code with tools like github co-pilot which move us closer and closer toObsolescence there are no good people out there foaming at the mouthAber irgendeiner sollte es zumindest noch verstehen was github co-pilot da ausspucktYeah, I've entirely automating your job with AI the technology is not there yetBut just look at how far it's come in the last yearWe now have things like stable diffusion and dolly and voice cloning that's indistinguishable from the real thingIt's only a matter of time and when that day comes, it's over. We are screwedNext up we need to talk about social media consolidation a trend that's been going on for many years now techLead made a video about this last week and you can always trust him to tell you the things that you don't want to hearAnd that you think the ability to code is like maddest du als einziger it angestellte ein fünfjahresprojekt umsetzen wollenNö, es not we're not wizards nowadaysThe vast majority of content creation has been absorbed by platforms like tick-tock twitter and youtube that use the follower model for social mediaWhy is that well it incentivizes creators with money and internet fame at a time haben sie haben sie ja gar nicht das war jaDas war ja eingepackt in klasse die haben das klasse davor folgeschmiertJa, aber die idee also allein schon auf die idee zu kommen so was zu machen finde ich bescheuert aber es ist ja dem gemäldeGlücklicherweise nichts passiertCommon Persons attention span is lower than ever like more than 50% of Americans have not read a book in the last yearThis is a problem for developers because people are no longer downloading apps from the app store every day or randomly surfing the internet to find newContent this makes it extremely difficult to build a new web or mobile app and make a ton of money with itUnless you have a massive marketing budget behind it like when oil first became a thing there were all kinds of prospectors becoming overnight millionairesBut nowadays you have a small handful of companies that control the entire world it's a bad trend for independent developersBecause it's much harder to take your side hustle to the moon now the final trend which has also been going on for years is the cloudYou have big cloud platforms like AWS that have been aggressively simplifying basically all areas of development and until recentlyThat's mainly meant fewer jobs for system administrators and IT guysBut now there are many tools coming out that eliminate both front-end and back-end jobs like honeycodeWhich is a no-code tool for building web and mobile apps or in also das sehe ich aktuell auch noch nichtWeil letztendlich klarIrgendwoFallen an manchen stellen jobs weg und ob die dann an in der menge an anderen stellen entstehen okDeswegen sage ich ja auch man muss ein bisschen ahnung haben den 0815 windows clicker in der 75 ausführung brauchst du auch nichtAber leute diesen graben bedienen können brauchst du ganz im ernstDurch zu blicken bei aws azure und google cloud ist schwierigerAls einen zu finden der die ein paar windowsserver und ein paar linuxkisten administrieren kannAmplify an entire back-end as a service in additionYou've got a bunch of new startups coming out with next-gen serverless databases that further simplify the role of a back-end developer in other words as newCloud-based tools make development easier. There's just less code to write now this video may sound very pessimisticBut I think there is hope you could always get into farming. That's what bill gates did after he got sick of coding and c-sharpAnd now he's the biggest farmland owner in the united states another ray of hope for millennials is that gen z seems to be pretty techAlliterate primarily because that generation is growing up at a time when social media and technology is already very consolidatedLike I bet many kids these days don't even know how urls work or that you can even edit them in the browserDas ist ohne scheiß das wundert mich auch immerWie wie planlos heutzutage leute sind die eigentlich mit technik aufgewachsen sind ich dachte eigentlich das problem existiert2020 nicht mehrIst es heute eigentlich ein must have sich mit cloud-zeug auszukennenNaja, du musst die kommt drauf an ich mein cloud-zeug ist ja sehr weit gefasstAber du solltest heutzutage zumindest ahnung haben was die ganzenDinger so grob sind ja also wenn dir einer was erzählt von infrastructure as code solltest du so eine grobe vorstellung was meinte eigentlichWeil was mit terraform oder ansible gemacht haben ist sicherlich auch nicht verkehrtsich in einer cloud plattform ganz gut auskennen und wissen wo da was istIst vielleicht mal irgendwie so ein serverless function erstellt haben ja ist schon net verkehrtframeworkredEines der probleme an diesen ganzen locode outdoor geschichten ist wenn die anwendung komplexDu kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst auch 100 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto.Aber gut, ist ja meistens nicht lange.Aber gut, ist ja meistens nicht lange.Du hast dann zumindest, meistens ja keine Nudd-Geschichten mehr dazwischen, das heißt du brauchst auf jeden FallDu hast dann zumindest meistens, meistens ja keine Nudd-Geschichten mehr dazwischen, das heißt du brauchst auf jeden Fallirgendwelche sinnvoll-default eingestellten Firewall-Regeln auf deinem Router, dass eben von außen nichts standardmäßig durchgeleitet wird, was du nie angefragt hast.... already be hacked, and if not, then maybe your ISP knows about the issue and blocks these attempts on their end.So security issues are not really a concern and if it is, you need to fix the root issue.Security through obscurity, aka trying to hide your IP doesn't fix it.Maybe you don't worry about security issues, but about denial of service attacks.It's easy to overwhelm a basic home router, but as I said, in lots of cases the IP doesn't even pointJa, bei mir schon. Ich hab ja einen richtig echten Toolstack. Kein Toolstack, leid.Ja, das stimmt. Ist aber trotzdem kacke, wenn man streamen will und kann nicht.Ja, das stimmt.Ja, das stimmt. Und viele VPN-Anbieter sagen sie,in vielen Fällen ist die Home-IP bereits das gleiche erzielt.Es ist auch eine öffentliche IP, die viele andere Kunden teilen.Also aus dem Sicht der Internet-User, die diese IP sehen,ist man bereits ein wenig verspürt.Aber natürlich gibt es ein paar Unterschiede zwischen einer VPN und einer ISP.Also gehen wir durch sie.Die wahrscheinlich wichtigste Unterschiede ist die legale Jurisdiktion.Ja, das stimmt. Und viele VPN-Anbieter sagen sie, speichern keine Logs.Allerdings, ist halt die Frage, ob du so einem VPN-Anbieter vertraust, dass das wirklich nicht so ist.Und was passiert, wenn man dem wirklich mal das Sondereinsatzkommando vor der Tür steht?Sind die dann nicht auf einmal doch super kooperativ?Also, da ist halt einfach die Aussage da vom VPN-Anbieter.Und ob das dann wirklich so ist? Who knows.Also, ich hab gelesen, dass...Also ich hab gelesen, dass VPNs in den Iran aktuellvoll im Trends sind. Wobei ich mich frage, wie das gehen soll. Die haben ja ziemlichInternetzensurprobleme. Aber hab ich vor ein paar Monaten was drüber gelesen,dass VPN-Anbieter im Iran aktuell wohl gerade recht angesagt werden.Das sag ich ja auch schon, ich hab ja sogar ein Video drüber gemacht, wo dann im Endeffekt NordVPNgesagt hat, wenn du jemals ein Sponsoring machen willst mit uns, musst du das Video löschen. Machich natürlich nicht. Aber ja, so ist es, hat schon recht. Man bildet sich da viel mehr Schutz ein,als es eigentlich bringt. Aber die Werbung ist halt auch sehr irreführend. Nach dem Motto, es wärealles supersicher, es wäre alles zusätzlich verschlüsselt, ist ja gar nicht. Es ist derWeg zwischen dir und dem VPN-Anbieter zusätzlich verschlüsselt. Aber wenn du normale Webseitenüber HTTPS verwendest, ist es eh egal. Und danach vom Eingang bzw. vom Ausgang des VPNs zum Zielserverist es, wenn es vorher unverschlüsselt war, nachher auch unverschlüsselt. Also insofern machteigentlich gar keinen wirklichen Unterschied. Wie gesagt, um geoblocking Sachen zu imgen und so,da VPN haben schon seine Anwendungsgebiete. Aber das, was das angeblich alles Tolles macht,ist zum größten Teil Blödsinn. Also ich vertraue prinzipiell nur dem Twitch-Chat.Wie würde man sich selbst dann am besten schützen, wenn nicht mit einem VPN? Die Frage ist ja erstmal,vor was musst du dich schützen? Musst du dich überhaupt schützen? Vor was willst du dich schützen?Was willst du machen? Willst du irgendwelche Straftaten begehen? Tja, da ist wahrscheinlichdas Sinnvollste, was du machen kannst, irgendwelche Torbrowser-Geschichten. Aber ansonsten,vor was willst du dich schützen? Also es gibt ja eigentlich so in normaler Weise wenig,wovor man sich schützen müsste und wo man einen VPN vorschützt. Das Einzige, was man mit einemVPN tatsächlich ganz gut machen kann, ist halt geoblocking umgehen. Wobei man das natürlichauch selbst ohne Probleme machen kann. Man kann sich auch irgendwie einen Server mieten,beispielsweise mein YouTube Premium. Das schließe ich ja auch immer über Indian ab und das macheich über einen SSH Socks-Proxy mit einer VM Digital Ocean in Bangalore, Indien. Da erstelleich mir alle paar Monate mal eine VM. Mittlerweile habe ich ja einen Dauer-Abo, eine VM und dann perSSH Socks-Proxy verbinden mit einem Browser und dann hat man halt eine indische IP. Und dannkann man eben YouTube Premium über Indien kaufen und mit indischen Ru-Ru-Rupien, glaube ich,bezahlen. Und das kostet dann plus 3 Euro anstatt 12 Euro. Bangalore, genau. Ob man das auch soausspricht, weiß nicht. Ist das denn erlaubt? Warum nicht? Es geht. Ru-Ru-Rupien. Es gibt janichts wirklich, wofür man die schützen muss. Braucht man eine indische Kreditkarte? Nein,braucht man nicht. Man kann über Paypal bezahlen. Oder? Oder Kreditkarte? Ich weiß es gerade garnicht. Zumindest braucht man ein neues Payment-Profil im Google-Account. Neues Payment-Profil.Das musst du auf Indien stellen, dann geht's. Privacy-Issue. Privacy-Issues arise,when you share private information. So what private information does your IP leak? If you useFacebook and Instagram to share private photos, it doesn't matter if you use a VPN or yourregular IP, you still share your private photos online. So the actions you do online are muchmore important than the IP. The only thing the IP leaks is your location, but this is a bitmisleading, because what do you mean by location? It doesn't leak your exact GPS coordinates,it might point to the city you live in, but most likely it points to the region where tens ofthousands or hundreds of thousands of people live. Also das ist nicht das Problem. Of course somemight want to completely hide their general location and don't want anybody to know they live inBerlin, but I don't think this is generally an issue most people have to care about. Think aboutnormal people. They post a single picture on Instagram from hiking near their home and peoplecould figure out their general location. So let's talk about me leaking the IP addresses of playerson my Minecraft server. How bad was it? In my opinion some of those IP addresses are dynamicand changed long before I uploaded the video. And some of these IP addresses are shared withhundreds of people anyway. Of course it might leak the rough geographic location of some players,but maybe they don't care or they leaked it in many other ways. For example oh my god here Ileaked the famous automated IP address, because I'm so famous he came onto my server. Now we cangeolocate him to Seattle. Oh my god. Anzeige ist raus. But besides all of that are you readyfor the last argument why me leaking the IP addresses of players on the server is not bad?If one of those players really really cared about hiding their tracks online being super paranoidthey must have used them again to access the server anyway. As you can see in my opinionthere's no meaningful security risk or meaningful privacy issue about leaking IPs. There are crazyedge cases with very weird threat models. Naja diese Region die angezeigt wird das kommt ausirgendwelchen Datenbanken wo das halt mal jemand zugeordnet hat. Du machst da so ein Reverse Look ab.Das muss nicht zwangsläufig immer super akkurat sein. Also bei mir stimmt's ganz gut. Bei mirsagt er meistens irgendwie grobe Region, Hanau, Frankfurt.Grünstliche Hardware Bezugsquellen. Naja guckst du bei AliExpress.Er hat enttäuscht den Stream abgebrochen.Also wenn ich einem truste dann prinzipiell eh nur dem Twitch Chat.If your threat model is cannot trust anything I connect to online then don't connect to it. Don't useyour home IP whatever you consider your home IP. Okay anyway now many of you watching probablyalso scream the whole time is he talking about IPv4 or IPv6 and well yeah most of what I mentionedmostly applies to IPv4 due to them running out and many customers will share IP addresses leadingto the ISP setups discussed in this video. With IPv6 the game kind of changes. And to be honest I'mnot super sure how ISP setups look like with IPv6. The little bit of networking knowledge I haveis mostly limited to IPv4, but I guess depending on...und wie du irgendwie treangulation machen willst mit meiner IP daheim das verstehe ich auch nicht so genau. Willst du dirverschiedene... okay naja vielleicht, aber dafür sind die Laufzeiten noch viel zu unpräzise.Also du müsstest dir dann theoretisch verschiedene Server in Deutschland mieten wo du den genauenStandort kennst und dann müsstest du mich irgendwie anpingen und dann müsstest du hoffendass die Route bekannt ist die du nimmst und dass es immer die gleiche ist also dass das wirklichnennenswert was bringt bezweifle ich. Also viel genauer als die grobe Region die du meistensaus so einem Reverse Lookup über so eine Geodatenbank rauskriegst wird das auch nicht... wird das es auchnicht bringen. Zumal was machst du wenn der Router nicht auf ping antwortet. Also ich glaube nichtdass das großartig was bringt. Kommt noch was? Okay das ist der Fall, aber gut er hat komplettrecht mit allen was er sagt. Okay Leute ich hab Hunger! Es ist kurz vor 12 theoretisch,ja. Aber ich kann jetzt noch nichts essen. Ich meine es ist 10.35 Uhr. What the fuck?Das hatten wir doch grad schon! Hey there my gorgeous friends on the internet. Das hatten wir auch nicht.Wollen wir auch nicht gucken. Oh nee nee nee nee nee nee nee nee. Jetzt haben wir schon geguckt.Guck ich jetzt auch keinen bock drauf habe ich jetzt auch keinen bock drauf was haben wir sonst nochbock drauf das video von stacks man 20 minuten zu sowas habe ich jetzt kein bock ich habe hungerich glaube ich gehe jetzt was essenGehst du heute wieder spazieren?Ja, wahrscheinlich.Heute ist gutes Wetter.Normalerweise sonntags nicht, aber heute werde ich meine zwei Stunden Bewegung wahrscheinlichwieder machen.Ich glaube, ich esse jetzt doch was, lul.Auf geht's.Ne, wir kommen jetzt nix mehr, vielleicht, ne, also, ich muss heute.Heute ist nix mit Wandern, ich muss heute ein bisschen MW2 spielen und meinen Senf dazugeben.Da hat nix anderes übrig.Muss jetzt, muss jetzt mal sein, muss ich durch, auch wenn ich gar nicht so wirklichBock drauf hab.Du hast ein totes Pixel auf meinem MacBook, ich weiß nicht, wie da die Garantie aussieht,keine Ahnung.Leute, ich geh jetzt was futtern, beziehungsweise quälen mich noch ne Stunde und dann geh ichwas futtern.Bis denn, Leute, macht's gut, CU.", "segments": [{"id": 1, "start": 0.0, "end": 29.96, "text": "So, bisschen früher als sonst, Moin Fips, du bist auch echt immer am"}, {"id": 2, "start": 29.96, "end": 35.3, "text": "Stahl, bisschen früher als sonst, wobei was hatten die eigentlich genau so wie sonst, bloß dass es"}, {"id": 3, "start": 35.3, "end": 41.08, "text": "eine Stunde früher ist, so rum, das ist eigentlich richtig. Und warum soll ich noch eine Stunde"}, {"id": 4, "start": 41.08, "end": 46.84, "text": "rum sitzen, bloß dass es neun ist, wenn ich wach bin, das macht ja keinen Sinn. Muss mal kurz gucken,"}, {"id": 5, "start": 46.84, "end": 53.08, "text": "ob es wieder irgendwelche Raid Shadow Legends oder VPN Anfragen gibt. Gucken, was neu ist,"}, {"id": 6, "start": 53.08, "end": 67.68, "text": "was neu reingekommen ist. Mal checken. NordVPN. Leute, ich hab wirklich jetzt hier die Klassiker"}, {"id": 7, "start": 67.68, "end": 73.92, "text": "schlechthin an Mails bekommen. Leute, ich hab bekommen Raid Shadow Legends Anfrage und NordVPN."}, {"id": 8, "start": 73.92, "end": 93.12, "text": "Dann ist jetzt alles klar. Da kann ja nix mehr schiefgehen jetzt. NordVPN, Raid Shadow Legends."}, {"id": 9, "start": 93.12, "end": 109.72, "text": "Ich war weiter, null. Etwas früh, na ja, mit Zeitumstellung ist es neun. Also,"}, {"id": 10, "start": 109.72, "end": 139.28, "text": "nee, ohne Zeitumstellung wäre es neun gewesen. Zeitumstellung ist es neun eigentlich. Aber"}, {"id": 11, "start": 139.28, "end": 144.16, "text": "Leute, ich hab NordVPN und Raid Shadow Legends Anfragen bekommen. Das kann ich eigentlich"}, {"id": 12, "start": 144.16, "end": 154.04, "text": "mein YouTube-Channel dicht machen, jetzt hab ich alles geschafft. Einfach easy sell out."}, {"id": 13, "start": 154.04, "end": 177.4, "text": "It's revealed. Nee, das wär ja was, was ich, also was ich machen möchte, was ich geschafft"}, {"id": 14, "start": 177.4, "end": 181.4, "text": "habe und nicht, was ich nicht machen will, was ich geschafft hab. Wobei ganz ehrlich,"}, {"id": 15, "start": 181.4, "end": 186.0, "text": "wirklich machen möchte ich eigentlich auch kein Placement für NordVPN oder für Raid"}, {"id": 16, "start": 186.0, "end": 192.12, "text": "Shadow Legends. Wobei NordVPN weiß ich jetzt schon, wie das laufen wird. Wir antworten"}, {"id": 17, "start": 192.12, "end": 198.16, "text": "denen, die sagen ja, okay, so und so sieht's aus und danach dann irgendwie ja so und so"}, {"id": 18, "start": 198.16, "end": 202.64, "text": "viel, machen wir was ab und dann fällt ihnen ein, oh, ich hab ja ein VPN-kritisches Video"}, {"id": 19, "start": 202.64, "end": 206.84, "text": "bei mir hochgeladen. Ja, dann soll ich das Video löschen. Dann sag ich, nein, ich lösche"}, {"id": 20, "start": 206.84, "end": 214.32, "text": "das Video nicht und dann haben sie keinen Bock mehr. Zumindest war das das letzte Mal"}, {"id": 21, "start": 214.32, "end": 226.04, "text": "so. NordVPN, ganz ehrlich, brauchen tun's die wenigsten, zumindest nicht für das, was"}, {"id": 22, "start": 226.04, "end": 233.08, "text": "sie denken, wofür sie es brauchen. Aber gut, mein, Genshin braucht auch keiner, wobei"}, {"id": 23, "start": 233.08, "end": 241.68, "text": "das eigentlich ein ganz gutes Game ist. Wenn halt nicht das ganze reingekasche wäre. Kyo"}, {"id": 24, "start": 241.68, "end": 256.48, "text": "Kon, danke, schon 29 Monate Massive Subscription hier. Ja, das ist einer der wenigen Sachen,"}, {"id": 25, "start": 256.48, "end": 264.28, "text": "ja, tatsächlich. Aber das Problem ist, was ich so sehe bei ganzen VPN-Anbietern ist,"}, {"id": 26, "start": 264.28, "end": 268.0, "text": "dass da halt sonst was erzählt wird und die Leute das dann halt dann irgendwie auch für"}, {"id": 27, "start": 268.0, "end": 272.76, "text": "voll nehmen, so nach dem Motto, ja, man ist viel sicherer im Internet unterwegs, die Hacker"}, {"id": 28, "start": 272.76, "end": 279.68, "text": "können nix mehr machen, vor allem, weil auch immer die Hacker sind, ja, dann irgendwelche,"}, {"id": 29, "start": 279.68, "end": 282.88, "text": "es wäre auf einmal alles verschlüsselt, was vorher nicht verschlüsselt ist, alles, das"}, {"id": 30, "start": 282.88, "end": 288.92, "text": "ist halt alles ziemlicher, ziemlicher Blödsinn. Ich mein, ja, okay, die Strecke ist verschlüsselt"}, {"id": 31, "start": 288.92, "end": 300.48, "text": "jetzt von dir zum VPN-Anbieter, aber danach genauso wenig wie vorher und naja. Also, so"}, {"id": 32, "start": 300.48, "end": 307.68, "text": "wirklich, ja, wenn irgendjemand noch wirklich offene WLANs ohne kleinen Isolationen oder"}, {"id": 33, "start": 307.68, "end": 311.64, "text": "irgendwas verwenden will, ja, meinetwegen, oder wenn einer geoblockigen Sachen umgehen"}, {"id": 34, "start": 311.64, "end": 317.12, "text": "will, ja, das verstehe ich auch, aber viele Leute, so dieses, die machen mal über VPN,"}, {"id": 35, "start": 317.12, "end": 320.64, "text": "das ist genauso wie unser Azubi mal erzählt hat, er surft nur noch über Tor Browser."}, {"id": 36, "start": 320.64, "end": 329.04, "text": "Hab ich ihm auch gesagt, also, du kannst von ausgehen, beim Tor Browser, dass dort auf"}, {"id": 37, "start": 329.04, "end": 333.36, "text": "jeden Fall jemand deinen Traffic mitschneidet. Man kann zwar nicht direkt drückverfolgen,"}, {"id": 38, "start": 333.36, "end": 336.24, "text": "wer du bist, aber da kannst du dir sicher sein, irgendjemand schneidet den auf jeden Fall"}, {"id": 39, "start": 336.24, "end": 342.6, "text": "und, also, wenn du da was drüber machen willst, unverschlüsselt, dann kannst du von ausgehen,"}, {"id": 40, "start": 342.6, "end": 352.32, "text": "es ist mitgeschnitten. So, ich mal gucken, wer Exit-Notes betreibt bei Tor. Gut, du kannst"}, {"id": 41, "start": 352.32, "end": 360.12, "text": "die auswählen, aber trotzdem. Jasper, Dankeschön, Simon hat eine Subscription. Huge Subscriptions,"}, {"id": 42, "start": 360.12, "end": 373.88, "text": "Naisu. Ja, musste halt den richtigen auswählen. Also, ich weiß nicht, so diese Sache, ich"}, {"id": 43, "start": 373.88, "end": 379.6, "text": "nehme default Tor Browser, es ist nicht sinnvoll, genauso wie ich nehme default in VPN. Man kann"}, {"id": 44, "start": 379.6, "end": 385.28, "text": "doch was machen, es gab hier mal eine Zeit lang auch Gaming-VPNs. Die waren tatsächlich"}, {"id": 45, "start": 385.28, "end": 393.2, "text": "in beschränktem Maße noch sinnvoll. Wenn du kack Routen genommen hast, irgendwie nach"}, {"id": 46, "start": 393.2, "end": 398.28, "text": "Asien für irgendwelche Games, falls Leute irgendwelche Asia-China-Chinesen-Games gespielt"}, {"id": 47, "start": 398.28, "end": 404.84, "text": "haben, oder auch nach NA teilweise, ja, wenn du nach NA geroutet würdest über Brasilien"}, {"id": 48, "start": 404.84, "end": 412.36, "text": "oder so, dann war das mit einem Gaming-VPN teilweise gar nicht so blöd. Hab ich sogar"}, {"id": 49, "start": 412.36, "end": 417.12, "text": "mal kurzzeitig auch verwendet, als ich früher mal Dark auf einem US-Sauber gespielt habe"}, {"id": 50, "start": 417.12, "end": 444.92, "text": "vor 12 Jahren oder so. Nee, reicht gar nicht, 13 Jahre, null, auch nicht lang. Ah."}, {"id": 51, "start": 444.92, "end": 462.28, "text": "Ja, komm, es ist 8.07, gestern wär's noch 9.07 gewesen. Und ich bin trotzdem wach, obwohl"}, {"id": 52, "start": 462.28, "end": 470.24, "text": "ich gestern später ins Bett bin. Das wird man auch überleben. Unchristliche Zeit, ja."}, {"id": 53, "start": 470.24, "end": 480.76, "text": "Brückentag oder arbeiten? Die Brückentag ist es Samstag. Warum sollte ich Samstag arbeiten?"}, {"id": 54, "start": 480.76, "end": 497.92, "text": "Sonntag, Sonntag ist, null. Vielleicht, weiß ich noch nicht, mal gucken. Es ging ja darum,"}, {"id": 55, "start": 497.92, "end": 503.88, "text": "dass ich eine Skill-Liste erstelle für die Bewerbung. Nee, ich hab's nur installiert,"}, {"id": 56, "start": 503.88, "end": 509.84, "text": "stimmt, heute ist Sonntag, aber Brückentag, wieso, ist morgen irgendwelche Feiertag, Hessen,"}, {"id": 57, "start": 509.84, "end": 520.88, "text": "ist irgendwann auch noch Tag der Deutschen Einheit irgendwann? Ah ja, das war schon,"}, {"id": 58, "start": 520.88, "end": 533.04, "text": "nee, das, doch, das war schon. Das war Montag, das war Montag, Anfang Oktober. Das hat mir"}, {"id": 59, "start": 533.04, "end": 537.88, "text": "nix gebracht, weil Montag, also die Deutsche Einheit hat mir schon was gebracht, aber dass"}, {"id": 60, "start": 537.88, "end": 545.92, "text": "es Montag ist, der Feiertag hat mir nix gebracht. Es dauert wieder bis Weihnachten, bis Feiertage"}, {"id": 61, "start": 545.92, "end": 549.44, "text": "sind. Und dann fallen die Feiertage auch noch so beschissen, dieses Mal bringt's mir gar"}, {"id": 62, "start": 549.44, "end": 556.2, "text": "nix, guck mal hier, Weihnachten, 25, der Kackel, Alter, Montag, Kac, W, Triw, Silvester ist"}, {"id": 63, "start": 556.2, "end": 566.88, "text": "dementsprechend dann auch, naja, das ist ja richtig kackel. Einzig Gute ist, dass der"}, {"id": 64, "start": 566.88, "end": 580.04, "text": "24. dann ein Freitag ist und dann ist das bei uns auch frei, 24 ist bei uns auch nix."}, {"id": 65, "start": 580.04, "end": 594.72, "text": "In Hessen ist der 31. Feiertag. Echt jetzt? Warum, was soll das für ein Feiertag sein?"}, {"id": 66, "start": 594.72, "end": 612.2, "text": "Nö, ist es nicht. Ist nicht, ist kein Feiertag. Also wenn es bei hessen.de eh kein Feiertag"}, {"id": 67, "start": 612.2, "end": 627.08, "text": "ist, dann ist es kein Feiertag. Ganz einfach. Den 31.10., ja, aber das ist kein Feiertag,"}, {"id": 68, "start": 627.08, "end": 632.48, "text": "sonst würd's da stehen. Das ist die offizielle Seite von Hessen mit Feiertagen in Hessen 2022."}, {"id": 69, "start": 632.48, "end": 639.88, "text": "Na, der kann auch kein Feiertag sein. Aber selbst wenn's irgendwo Feiertag ist, Montag"}, {"id": 70, "start": 639.88, "end": 647.4, "text": "würde mir eh nix bringen, der 31. also morgen. Weil, Montags arbeite ich nie. Dementsprechend"}, {"id": 71, "start": 647.4, "end": 651.96, "text": "find ich's immer kacke. Also ich finde auch, dass Ostermontag nicht auf Montag fallen"}, {"id": 72, "start": 651.96, "end": 659.32, "text": "sollte. Man könnte man ja ändern, Osterdienstag oder so. Das wär gut. Aber warum Ostermontag"}, {"id": 73, "start": 659.32, "end": 666.52, "text": "immer an einem Montag sein muss, versteh ich nicht. Montag ist ein Kacktag für Feiertage,"}, {"id": 74, "start": 666.52, "end": 691.28, "text": "das bringt mir nix. Aha, sollen sie mal einführen. Was ist eigentlich aus diesem Corona-Freitag"}, {"id": 75, "start": 691.28, "end": 697.96, "text": "geworden? Gab's den eigentlich jemals? Und im Jahr oder so war doch in Diskussionen mal"}, {"id": 76, "start": 697.96, "end": 704.08, "text": "irgendwie so ein Corona-Freitag zu machen und den gab's nie, oder? Ich glaub, da ist"}, {"id": 77, "start": 704.08, "end": 709.04, "text": "nie dazu gekommen. Gut, ich mein, irgendwelche Sachen, die man machen will und zu denen's"}, {"id": 78, "start": 709.04, "end": 713.8, "text": "dann nie kommt, gibt's ja massig. Ich bin mal gespannt, ob's wirklich nächstes Jahr"}, {"id": 79, "start": 713.8, "end": 719.84, "text": "das 49 oder was es da noch immer Euro-Ticket geben wird. Ich hab da auch mal eine Zweifel."}, {"id": 80, "start": 719.84, "end": 723.52, "text": "Sie haben jetzt zwar alle wieder ihre Absichten erklärt, aber das heißt ja noch lange nix."}, {"id": 81, "start": 723.52, "end": 729.22, "text": "Oder wie wär's mal mit der Zeitumstellung abschaffen, was man schon vor 5 Jahren machen"}, {"id": 82, "start": 729.22, "end": 751.4, "text": "wollte. Also 100% nicht wach bin ich auch noch nicht. Aber auch nicht wacher wie sonst,"}, {"id": 83, "start": 751.4, "end": 760.48, "text": "ja. Aber es ist ja immerhin schon neun. Also, wäre das gewesen. Oh, es ist gutes Wetter."}, {"id": 84, "start": 760.48, "end": 769.52, "text": "Sekunde, Leute. Ich muss mal kurz was checken. Wie wird denn das Wetter heute? Vielleicht"}, {"id": 85, "start": 769.52, "end": 773.56, "text": "kann ich heute ein bisschen ins Gebirge gehen. Da sagen die Schweizer jetzt wieder Kekkel."}, {"id": 86, "start": 773.56, "end": 781.0, "text": "Das ist doch kein Gebirge. Aber so ein bisschen hier ins... Hey, heute ist richtig gutes Wetter"}, {"id": 87, "start": 781.0, "end": 788.08, "text": "den ganzen Tag. Pong. Da müsste ich eigentlich jetzt nicht... Also ich hau jetzt nicht ab,"}, {"id": 88, "start": 788.08, "end": 804.28, "text": "ja. Da müsste ich nachher mal so... Mal zwei Stunden raus. Alles wie's morgen. Morgen"}, {"id": 89, "start": 804.28, "end": 821.36, "text": "geht's so. Ok. Morgen ist so, naja. Aber gut, man kann sich ja noch ändern. Das Schlimme"}, {"id": 90, "start": 821.36, "end": 831.04, "text": "ist, dass die USA die Zeit eine Woche später umstellt. Painschamp. Tja. Generell, ich"}, {"id": 91, "start": 831.04, "end": 836.04, "text": "finde... Also ich muss ehrlich sagen, Zeitumstellung und Zeitzonen finde ich immer noch komplett"}, {"id": 92, "start": 836.04, "end": 843.0, "text": "useless. Einfach überall auf der Welt die gleiche Zeit und fertig. Ich mein, wen juckt"}, {"id": 93, "start": 843.0, "end": 846.92, "text": "das bei dem einen um 12 Uhr die Sonne scheint und beim anderen um 23 Uhr? Das ist doch reine"}, {"id": 94, "start": 846.92, "end": 864.04, "text": "Gewöhnungssache. Einfach Zeitzonen abschaffen und Zeitumstellung abschaffen. Fertig. Wisst"}, {"id": 95, "start": 864.04, "end": 873.08, "text": "ihr, wie viele Probleme damit gelöst werden? Ab auf die Wassergruppe nähe. Das ist nicht"}, {"id": 96, "start": 873.08, "end": 878.52, "text": "bei mir in der Nähe das. Also bei mir ist am nächsten ist der Feldberg im Taunus. Wobei"}, {"id": 97, "start": 878.52, "end": 894.12, "text": "das auch nicht so nah ist. Spessart ist näher. Ne, das sollen sie halt Ostermontag auch noch"}, {"id": 98, "start": 894.12, "end": 905.56, "text": "machen. Ah man. Habe ich die Woche irgendwas verpasst? War irgendwas spannendes Leute."}, {"id": 99, "start": 905.56, "end": 910.28, "text": "Komm wir gucken mal kurz. Guck mal ganz schnell GitHub Trends. Das mache ich ja immer einmal"}, {"id": 100, "start": 910.28, "end": 914.88, "text": "Sonntag. Was dann so weekly getrendet ist. Mal drüber scrollen und feststellen, dass"}, {"id": 101, "start": 914.88, "end": 920.04, "text": "ich wieder mit nichts was anfangen kann. Ok, das habe ich gesehen. Placingly fast written"}, {"id": 102, "start": 920.04, "end": 933.16, "text": "in Rust. Irgendein neues JavaScript Bildtool. Juckt mich nicht, juckt mich nicht. Leute"}, {"id": 103, "start": 933.16, "end": 940.56, "text": "es gibt manchmal Beschreibungen von Projekten. Da weiß ich noch nicht mal was das Projekt"}, {"id": 104, "start": 940.56, "end": 944.52, "text": "sein soll. Ich meine ernsthaft. Versteht das irgendjemand was sie mir hier sagen wollen?"}, {"id": 105, "start": 944.52, "end": 950.88, "text": "Next Generation Smart Contract Platform. High Throughput Low Latency Asset Oriented Programming"}, {"id": 106, "start": 950.88, "end": 957.28, "text": "Model powered by Move Programming Language. Was? Also ich kann mir ja mit Ach und Krach"}, {"id": 107, "start": 957.28, "end": 963.68, "text": "noch was zu Smart Contract Platform oder sowas. Genau. Kryptograms. Ich kann mir ja mit Ach"}, {"id": 108, "start": 963.68, "end": 967.88, "text": "und Krach noch was zu Smart Contract Zeug zusammenreiben. Aber was sie mir mit dem Rest"}, {"id": 109, "start": 967.88, "end": 972.16, "text": "sagen wollen habe ich keinen Platz für einen Schimmer. Und ich kann mir da auch nur zusammen"}, {"id": 110, "start": 972.16, "end": 989.84, "text": "rein irgendwelcher Kryptogramm. Layer 1 for Everyone. Was soll das sein? Rust Betriebssystem."}, {"id": 111, "start": 989.84, "end": 1003.44, "text": "Ah ne Blockchain. Das ist ein schlechter Name für Blockchain. Da ist so S im Name. Hätte"}, {"id": 112, "start": 1003.44, "end": 1009.36, "text": "irgendjemand an Blockchain gedacht jetzt wenn er diesen Titel liest? Ich hätte an irgend"}, {"id": 113, "start": 1009.36, "end": 1014.92, "text": "so ein Spielzeugbetriebssystem in Rust gedacht wieder. Rust Desk. Sag mal was ist da gerade"}, {"id": 114, "start": 1014.92, "end": 1030.92, "text": "angesagt? Also Rust ist ja wirklich überall gerade. Websocket Server in C++. Irgendwelches"}, {"id": 115, "start": 1030.92, "end": 1055.52, "text": "Poppy End Zeug oder so in Go. React. KeePass. Beste. Android. Machine Learning Kram. PowerShell."}, {"id": 116, "start": 1055.52, "end": 1067.04, "text": "SGS Ormapper für Gorm. Ein Ormapper für Go. Flipper Zero Firmware. Das ist doch irgendein"}, {"id": 117, "start": 1067.04, "end": 1072.32, "text": "3D Druckerkram oder? Okay es ist nix dabei was mich irgendwie großartig interessiert"}, {"id": 118, "start": 1072.32, "end": 1083.64, "text": "diese Woche. Neuer AI Gamechanger. Es ist genauso Gamechanger wie Levelcap immer behauptet"}, {"id": 119, "start": 1083.64, "end": 1094.12, "text": "dass der nächste Battlefield Patch ein absoluter Gamechanger ist. Die sollen mal weiter Gamechangen."}, {"id": 120, "start": 1094.12, "end": 1105.96, "text": "Ansonsten habe ich die Woche irgendwas spannendes verpasst. Erstmal überlegen war irgendwas."}, {"id": 121, "start": 1105.96, "end": 1111.84, "text": "Kurz mal. Halsey News Übersicht gucken. War da irgendwas spannendes? Die haben doch"}, {"id": 122, "start": 1111.84, "end": 1119.64, "text": "immer so eine Woche. Ja gut die Elon Musk Twitter Geschichte ist gewesen. Haben die nicht immer"}, {"id": 123, "start": 1119.64, "end": 1131.28, "text": "so eine Woche Übersicht normalerweise jetzt? Okay keine Ahnung. Die China Chinesen wollen"}, {"id": 124, "start": 1131.28, "end": 1147.52, "text": "irgendwas. Das habe ich auch mitgekriegt. Ihh. ABAP. Ein ABAP Kurs. Okay es gibt was"}, {"id": 125, "start": 1147.52, "end": 1151.76, "text": "was ich mir wirklich nicht freiwillig geben würde. Da müsste mich jemand für bezahlen"}, {"id": 126, "start": 1151.76, "end": 1159.76, "text": "dass ich einen ABAP Kurs mache. Falls man das überhaupt so ausspricht. Brennende Stromkabel."}, {"id": 127, "start": 1159.76, "end": 1165.48, "text": "Wahrscheinlich weil es minderwertige Qualität ist oder so. Also irgendwie nichts spannendes"}, {"id": 128, "start": 1165.48, "end": 1172.88, "text": "gewesen die Woche. Nicht mal irgendwelche komischen größeren Windows Fehler oder irgendwelche"}, {"id": 129, "start": 1172.88, "end": 1180.12, "text": "Cloud Hacks oder war gar nichts die Woche. Die Originalen das war natürlich schlecht."}, {"id": 130, "start": 1180.12, "end": 1184.48, "text": "Gut dass ich mir noch keine neue Grafikkarte gekauft habe. Wie sieht es denn da aktuell"}, {"id": 131, "start": 1184.48, "end": 1190.48, "text": "kurz aus? Ich schaue mal kurz. Also wenn ich im Dezember mir eine neue Grafikkarte kaufen"}, {"id": 132, "start": 1190.48, "end": 1216.44, "text": "will gäbe es da überhaupt was? Ja gäbe es halt teuer. Teuer AF. Gibt es Founders Edition"}, {"id": 133, "start": 1216.44, "end": 1232.72, "text": "oder was? Ja. Weil bei uns alles teurer ist. Du kannst in der Regel kannst du die letzten"}, {"id": 134, "start": 1232.72, "end": 1239.24, "text": "Jahre über schon sagen 1 zu 1 der Euro Preis. Also 1 zu 1 der Dollar Preis. Eher nochmal"}, {"id": 135, "start": 1239.24, "end": 1247.64, "text": "irgendwie 15% obendrauf. Das ist immer noch so. Das ist teuer. Grafikkarten sind mega"}, {"id": 136, "start": 1247.64, "end": 1252.96, "text": "teuer. Eher 2300 wenn du was kriegen willst. Also ich rechne damit dass mal ein neuer Rechner"}, {"id": 137, "start": 1252.96, "end": 1260.92, "text": "irgendwas um 4500 Euro oder so kosten wird. Aber was muss das? Wobei das stimmt ja gar"}, {"id": 138, "start": 1260.92, "end": 1266.96, "text": "nicht. Es muss ja überhaupt nicht. Es gibt eigentlich überhaupt keinen wirklich driftigen"}, {"id": 139, "start": 1266.96, "end": 1270.56, "text": "Grund dass ich mir einen neuen Rechner kaufe. Ich meine mein Rechner ist mittlerweile 5"}, {"id": 140, "start": 1270.56, "end": 1276.88, "text": "Jahre alt mit einem 8700k oder 1080ti. Aber die Scheiße ist halt es läuft alles. Es gibt"}, {"id": 141, "start": 1276.88, "end": 1282.8, "text": "nix. Es gibt nix was nicht läuft. Und es läuft auch alles relativ gut. Gut ich meine 1080p"}, {"id": 142, "start": 1282.8, "end": 1302.96, "text": "Gaming ja. 1080p Gaming. Kein Ding. Ja wenn es danach geht brauche ich auch keinen neuen"}, {"id": 143, "start": 1302.96, "end": 1307.52, "text": "PC. Aber ich hätte gerne echt wieder. Also wirklich gerne mal wieder einen neuen. Aber"}, {"id": 144, "start": 1307.52, "end": 1310.48, "text": "vielleicht mache ich es auch. Vielleicht kaufe ich mir auch doch keinen neuen. Wie gesagt"}, {"id": 145, "start": 1310.48, "end": 1315.52, "text": "wir haben ja letztens einen zusammengestellt hier im Stream. Ja noch mit AMD. Mal gucken"}, {"id": 146, "start": 1315.52, "end": 1319.8, "text": "ob es auch AMD wird. Vom Stromverbrauch her vielleicht AMD. Weiß nicht. Die Grafikkarte"}, {"id": 147, "start": 1319.8, "end": 1326.12, "text": "haut auf jeden Fall richtig rein. Also mal gucken. Vielleicht kaufe ich mir auch keinen"}, {"id": 148, "start": 1326.12, "end": 1330.52, "text": "neuen PC. Ganz ehrlich 4500 Euro einfach nur weil es nice ist muss ja auch nicht sein."}, {"id": 149, "start": 1330.52, "end": 1343.52, "text": "Man kann es auch übertreiben. Aber ich neige trotzdem noch dazu neuen PC zu kaufen. So"}, {"id": 150, "start": 1343.52, "end": 1353.64, "text": "YouTube was empfiehlt es zu uns? Angular? Ne schau mal nicht. Insane skip. Hat Fireship"}, {"id": 151, "start": 1353.64, "end": 1368.96, "text": "ein neues Video? Next. Ne das haben wir schon geguckt. Is Coding dead? Nein und wird es"}, {"id": 152, "start": 1368.96, "end": 1374.44, "text": "auch nicht sein. Ich meine seit 15 Jahren wird erzählt demnächst können Manager auch"}, {"id": 153, "start": 1374.44, "end": 1378.28, "text": "irgendwas programmieren und das hat noch nie geklappt. Sei es von Excel angefangen"}, {"id": 154, "start": 1378.28, "end": 1388.24, "text": "bis irgendwelche Clicktools und jetzt irgendwelche Low-Code-Plattforms und sonst was. Es wird"}, {"id": 155, "start": 1388.24, "end": 1391.44, "text": "es einfach wird das nicht passieren. Was soll denn da rauskommen wenn irgendwelche"}, {"id": 156, "start": 1391.44, "end": 1398.76, "text": "Manager dann nichts programmieren. Business Software die nicht richtig funktioniert oder"}, {"id": 157, "start": 1398.76, "end": 1417.76, "text": "was soll das sein. Das klappt nicht. Wisst ihr was ich mich frage wann endlich mal der"}, {"id": 158, "start": 1417.76, "end": 1429.2, "text": "neue ESP32 rauskommt mit ZigBee, Matter und Thread Support. Da gibt es ja zwei neue."}, {"id": 159, "start": 1429.2, "end": 1434.44, "text": "Die sind schon seit über einem Jahr angekündigt aber da tut sich nichts. Ich weiß auch nicht"}, {"id": 160, "start": 1434.44, "end": 1443.04, "text": "was mit den China-Chinesen los ist. Das wird tatsächlich immer praktisch wenn das Ding"}, {"id": 161, "start": 1443.04, "end": 1456.56, "text": "demnächst rauskommt. So Leute, nachdem ich beide Anfragen jetzt"}, {"id": 162, "start": 1456.56, "end": 1465.76, "text": "habe für Raid Shadow Legends und für NordVPN. Sagt mir mal was ich zuerst machen soll."}, {"id": 163, "start": 1465.76, "end": 1478.0, "text": "Wo soll ich zuerst drauf antworten? Raid oder NordVPN?"}, {"id": 164, "start": 1478.0, "end": 1484.76, "text": "Oh ich habe noch mehr Sachen sehe ich gerade. Ich bin aber im Spam Ordner gelandet."}, {"id": 165, "start": 1484.76, "end": 1496.08, "text": "Ok das ist Scam. Raid die besser zahlen. Wahrscheinlich ja."}, {"id": 166, "start": 1496.08, "end": 1511.76, "text": "Ok im Spam Ordner ist richtig Scam. Also am cringiesten finde ich die Mails immer"}, {"id": 167, "start": 1511.76, "end": 1521.08, "text": "wo dann irgendwelche Publisher oder so Mails rumschreiben. GameXY jetzt finally on Steam"}, {"id": 168, "start": 1521.08, "end": 1525.2, "text": "und dann guckst du rein und es ist so ein billiger Mobile Port von irgendeinem Game was sich"}, {"id": 169, "start": 1525.2, "end": 1532.36, "text": "nicht juckt. Die haben nicht gefragt bis jetzt. Genshin"}, {"id": 170, "start": 1532.36, "end": 1540.44, "text": "war das einzige Weep Game was gefragt hat bisher. Raid über. Exzellent. 5 Head Idee."}, {"id": 171, "start": 1540.44, "end": 1545.6, "text": "Das geht aber nicht weil NordVPN gesagt hat sie wollen der einzige Sponsor im Video sein."}, {"id": 172, "start": 1545.6, "end": 1561.52, "text": "Ansonsten wäre das 6 Head Idee. Also für mich ist immer so ich mache Sponsorings"}, {"id": 173, "start": 1561.52, "end": 1568.96, "text": "nur wenn ich den gar nicht selbst spielen muss. Also das war auch bei World of Tanks"}, {"id": 174, "start": 1568.96, "end": 1572.72, "text": "und sowas. Die wollten dann immer dass ich selbst Gameplay erspiele und sowas. Ich will"}, {"id": 175, "start": 1572.72, "end": 1579.36, "text": "den gar nicht spielen. Ich erzähl da. Ich reiß da 60 Sekunden lang irgendwie den Text"}, {"id": 176, "start": 1579.36, "end": 1585.76, "text": "runter in den 0815 Skript wo jeder hört dass es halt von irgendeinem Cringe Marketing Typ"}, {"id": 177, "start": 1585.76, "end": 1588.92, "text": "geschrieben wurde und dann ist gut ich will den gar nicht selbst spielen."}, {"id": 178, "start": 1588.92, "end": 1598.68, "text": "Und eigentlich wollte ich schon seit fast einer Woche ein Video hochgeladen haben zum"}, {"id": 179, "start": 1598.68, "end": 1606.48, "text": "neuen Battlefield Patch. Da ist auch ein Sponsoring drin aber die kriegen es mit ihrem Reflink nicht"}, {"id": 180, "start": 1606.48, "end": 1615.44, "text": "auf die Reihe. Raid Shadow Fallen bringen die nicht auf blöde Ideen. Da weißt du nie"}, {"id": 181, "start": 1615.44, "end": 1633.64, "text": "was passiert. Ok was gucken wir uns denn an? Lassen wir uns Level Capture Bane. Modern Warfare"}, {"id": 182, "start": 1633.64, "end": 1643.16, "text": "2 Missing Key Feature. Ok Level Capture Bane. Und dann gucken wir uns was ernsthaftes an."}, {"id": 183, "start": 1643.16, "end": 1647.16, "text": "Ich skippe eh den meisten Krempel wieder. Kommt mal der hat noch nicht mal Timestamps"}, {"id": 184, "start": 1647.16, "end": 1654.36, "text": "drin weil er genau weiß. Oh doch hat er. Mein Browser mag keine Timestamps. Der hat Timestamps"}, {"id": 185, "start": 1654.36, "end": 1662.12, "text": "verkackt Level Cap. Kecke. Ich weiß nicht wie er das geschafft hat aber irgendwie hat"}, {"id": 186, "start": 1662.12, "end": 1672.04, "text": "er Timestamps verkackt. So. Komm wir lassen uns eine Runde Level Capture Bane. Gutes mal"}, {"id": 187, "start": 1672.04, "end": 1676.12, "text": "gucken was es diese Woche neu gibt. Da kann ich auch gleich die Sound-Lautstärke einstellen."}, {"id": 188, "start": 1676.12, "end": 1693.8, "text": "Wer hätte das gedacht? Wann kommen Spiele heutzutage schon fertig raus? Habe ich das"}, {"id": 189, "start": 1693.8, "end": 1700.72, "text": "nicht vor 3 Jahren gesagt? Als die bei Microsoft angefangen haben alle möglichen Sachen zu"}, {"id": 190, "start": 1700.72, "end": 1704.88, "text": "übernehmen und den Xbox Game Pass zu packen. Da habe ich damals im Video gesagt, gut vielleicht"}, {"id": 191, "start": 1704.88, "end": 1708.44, "text": "war es einfach nur Glück, aber ich habe damals im Video gesagt pass mal auf die werden das"}, {"id": 192, "start": 1708.44, "end": 1711.84, "text": "jetzt so attraktiv machen, dass es jeder kauft und wenn es dann die Leute haben dann ist"}, {"id": 193, "start": 1711.84, "end": 1725.68, "text": "es einfach auf einen Schlag übelst teuer. Mal gucken. Captain Penguin schüttet uns ab."}, {"id": 194, "start": 1725.68, "end": 1728.84, "text": "Alter diese Map muss richtig räudig sein. Ich habe das Game noch nicht gespielt nur"}, {"id": 195, "start": 1728.84, "end": 1733.24, "text": "runtergeladen. Aber ich habe schon so viele Twitter-Messages gelesen über diese komische"}, {"id": 196, "start": 1733.24, "end": 1759.64, "text": "Autobrücken-Map. Das muss wohl das neue Piccadilly sein quasi. Zappend, danke für den Zapp."}, {"id": 197, "start": 1759.64, "end": 1765.04, "text": "Wenn du Crossplay disablen kannst, dann steigt die Chance, dass wenn irgendeine Plattform"}, {"id": 198, "start": 1765.04, "end": 1787.04, "text": "dead ist, dass dann keiner mehr drauf spielen kann. Alter wie ergebener Sponsoring."}, {"id": 199, "start": 1787.04, "end": 1815.48, "text": "Wer juckt? Achso, weil die schneller progressen können. Ah ja."}, {"id": 200, "start": 1815.48, "end": 1832.8, "text": "Alter, da bin ich wieder so krass reingekascht. Hoffentlich kriegen sie es besser ein als"}, {"id": 201, "start": 1832.8, "end": 1843.04, "text": "Half-Life mit Episode 3. Ich sage euch, Warzone wird das Game eh wieder retten."}, {"id": 202, "start": 1843.04, "end": 1862.64, "text": "Nix Neues. Nix Neues. Die ganzen physischen, also viele physische Kopien von Games enthalten"}, {"id": 203, "start": 1862.64, "end": 1868.32, "text": "mehr oder weniger. Sag mal so, wenn überhaupt enthalten die einfach nur was zum Downloaden."}, {"id": 204, "start": 1868.32, "end": 1872.24, "text": "Es gibt ja mittlerweile physische Kopien von Games, da ist einfach ein Steam-Code drinne."}, {"id": 205, "start": 1872.24, "end": 1875.48, "text": "Da machst du das CD-Case auf und dann ist da ein Steam-Code drinne."}, {"id": 206, "start": 1875.48, "end": 1905.44, "text": "Das ist das, was so aussieht wie Dead Space, oder?"}, {"id": 207, "start": 1905.44, "end": 1935.2, "text": "Nix Neues."}, {"id": 208, "start": 1935.2, "end": 1951.0, "text": "Nix Neues. Nix Neues."}, {"id": 209, "start": 1951.0, "end": 1976.28, "text": "Nix Neues. Nix Neues. Angry Birds."}, {"id": 210, "start": 1976.28, "end": 1979.32, "text": "Nix Neues. Nix Neues. Nix Neues. Yeieieieieieieieieieieieieieieieieieieieieieieieieieieies!"}, {"id": 211, "start": 1979.32, "end": 1985.76, "text": "Modus, selbstverständlich SBMM, dafür gibt es ja ranked. Es kommt aber auch immer ein"}, {"id": 212, "start": 1985.76, "end": 1996.84, "text": "bisschen auf das Game an, muss man sagen, ja. Nur dass mich das Game so überhaupt nicht anspricht,"}, {"id": 213, "start": 1996.84, "end": 2009.28, "text": "jetzt auf den ersten Blick. Oh, neue Kisten in Battlefield. Es gibt jetzt übrigens auch"}, {"id": 214, "start": 2009.28, "end": 2014.24, "text": "orangene Container habe ich gesehen, Leute. Stellt euch das mal vor. Die haben nicht nur blaue,"}, {"id": 215, "start": 2014.24, "end": 2021.08, "text": "grüne, weiße, graue Container, die haben jetzt auch orangene Container und rote Container. Könnt"}, {"id": 216, "start": 2021.08, "end": 2043.04, "text": "ihr euch das vorstellen? Das ist fast, das ist nahezu unglaublich. Spass! Spass! Spass!"}, {"id": 217, "start": 2051.08, "end": 2073.44, "text": "Moment! Ein Helm hat das Game gekrascht? Na gut, bei dem Game wundert mich nix."}, {"id": 218, "start": 2081.08, "end": 2088.16, "text": "Ich meine, das ist immerhin irgendwie schon so eine Art Game. Das wird zwar nie fertig."}, {"id": 219, "start": 2088.16, "end": 2112.48, "text": "Ich glaube, sollte nicht die Kampagne schon vor drei Jahren erschienen sein?"}, {"id": 220, "start": 2119.16, "end": 2124.24, "text": "Juckt mich nicht. Spielt jemand von euch Star Citizen? Das würde mich einfach mal interessieren."}, {"id": 221, "start": 2124.24, "end": 2128.42, "text": "Also ich will es jetzt nicht über Gebühren bashen oder so. Ich habe einfach keine Ahnung"}, {"id": 222, "start": 2128.42, "end": 2153.0, "text": "davon, aber es interessiert mich auch nicht großartig. Bye, natürlich."}, {"id": 223, "start": 2158.42, "end": 2171.72, "text": "Okay, juckt mich auch absolut gar nicht."}, {"id": 224, "start": 2171.72, "end": 2191.8, "text": "Moment. Ach, ja gut."}, {"id": 225, "start": 2201.72, "end": 2214.02, "text": "Ja, mal gucken. Mal gucken, was sie dann auch wirklich erhöhen."}, {"id": 226, "start": 2231.72, "end": 2255.78, "text": "Ich bin froh, dass ich noch keine habe."}, {"id": 227, "start": 2261.72, "end": 2275.98, "text": "Haben die das vorher nicht mal ausprobiert in irgendeinem zwei Wochen Belastungstest oder so?"}, {"id": 228, "start": 2291.72, "end": 2314.18, "text": "Na dann. Ich bin schon wieder an das Film."}, {"id": 229, "start": 2314.18, "end": 2326.88, "text": "Ja, 2000 Euro GPU, die sparen wir aber nach. Ja, sieht aus. Der gesparte Cent macht es aus."}, {"id": 230, "start": 2326.88, "end": 2343.54, "text": "Also verdient schon. Reden wir an ihn."}, {"id": 231, "start": 2343.54, "end": 2365.74, "text": "Ach so Lifetime. Ich wollte gerade sagen, dass es so gehyped ist, gerade hätte ich gar nicht"}, {"id": 232, "start": 2365.74, "end": 2381.14, "text": "mitbekommen."}, {"id": 233, "start": 2381.14, "end": 2386.14, "text": "Die Franchise ist Hardcore-Fanbase, neue Spieler der Franchise waren auch frustriert,"}, {"id": 234, "start": 2386.14, "end": 2390.98, "text": "dass es da habe ich mich wirklich geirrt bei dem game als es rausgekommen hat beziehungsweise"}, {"id": 235, "start": 2390.98, "end": 2394.5, "text": "was ich gesagt habe als es rausgekommen ist ich habe ich hatte ich wie gesagt ich dachte"}, {"id": 236, "start": 2394.5, "end": 2398.26, "text": "auch das ist so eine eintagsfliege und ist bald wieder weg aber es war zum release auch"}, {"id": 237, "start": 2398.26, "end": 2402.14, "text": "echt fail damit habe ich echt nicht gerechnet dass ich das noch so macht"}, {"id": 238, "start": 2402.14, "end": 2406.9, "text": "Bugs und die genaue Lack of Polish, aber die Devs haben ein monumentales Erlebnis,"}, {"id": 239, "start": 2406.9, "end": 2411.06, "text": "um das Spiel zusammen zu machen und obwohl es noch nicht aufgeteilt hat, vielleicht macht ja vielleicht macht ja mal"}, {"id": 240, "start": 2411.06, "end": 2415.74, "text": "der Internet Historien ein Video zu, der Entgudenung von Rainbow Six Siege"}, {"id": 241, "start": 2415.74, "end": 2421.18, "text": "Taktikale PVE-Elemente der vergangenen Titel sind weit über die Erwartungen in ziemlich"}, {"id": 242, "start": 2421.18, "end": 2425.46, "text": "jedem anderen Begriff, jetzt wenn du dich für einen tieferen Reisen in den Modern Warfare 2"}, {"id": 243, "start": 2425.46, "end": 2429.3, "text": "startst, schau dir meine ersten Impressionen im Video an, ich habe es gestern eröffnet,"}, {"id": 244, "start": 2429.3, "end": 2435.54, "text": "auch schau dir dieses GTFO Video an, das ich mit Karma Cut gemacht habe, GTFO ist so ein fantastisches"}, {"id": 245, "start": 2435.54, "end": 2438.46, "text": "Spiel, wenn du dich für einen guten Fallfliege suchst, dann gibt es GG Eats"}, {"id": 246, "start": 2438.46, "end": 2450.74, "text": "Du bist damit wahrscheinlich nie warm geworden, ja klar ist bestimmt für viele"}, {"id": 247, "start": 2450.74, "end": 2468.5, "text": "abstrengend, wenn er erst mal 200 300 Stunden spielen muss, dass du halbwegs brauchbar bist"}, {"id": 248, "start": 2468.5, "end": 2476.18, "text": "The most legendary programmers of all time, hey wollen wir wetten, der Dude hier links, das ist der C++ Erfinder"}, {"id": 249, "start": 2476.18, "end": 2492.98, "text": "kommt nichts, wobei ich halt es ihm immer noch übel nehme C++ erfunden zu haben"}, {"id": 250, "start": 2492.98, "end": 2503.98, "text": "So also was kann man als nächstes sagen, was ist das hier, Kindheitstraum, Bagger reparieren,"}, {"id": 251, "start": 2503.98, "end": 2509.82, "text": "was verdient ein Baumaschinenmechatroniker, ok zeig mal her, was will er denn hier eigentlich,"}, {"id": 252, "start": 2509.82, "end": 2520.86, "text": "die ganze Serie Moneymaker, ich will nicht die ARD Mediathek gucken, Baumaschinenmechatroniker,"}, {"id": 253, "start": 2520.86, "end": 2535.22, "text": "der hat richtig gemacht, der hat auch nichts mit Holz gemacht, was ist das, gucken wir mal das hier, Vim as your editor,"}, {"id": 254, "start": 2535.22, "end": 2546.66, "text": "heute morgen nicht, das ist Werbung davor, jetzt machen die schon Werbung für ihren eigenen Kram"}, {"id": 255, "start": 2546.66, "end": 2554.98, "text": "da drinnen, ok zeig mal her, das ist eben der Kindheitstraum, so ein bisschen der kleine"}, {"id": 256, "start": 2554.98, "end": 2560.42, "text": "Junge Bagger Bagger LKW LKW, ich hab mir früher als ich klein war auch sehr gerne Bagger angeguckt,"}, {"id": 257, "start": 2560.42, "end": 2566.82, "text": "ich mein wer nicht, aber auf die Idee gekommen Bagger beruflich zu bauen hätte ich jetzt eher"}, {"id": 258, "start": 2566.82, "end": 2571.74, "text": "keinen Bock, darum geht mit einfachen Sachen Geld zu verdienen, dann ist man hier ein bisschen falsch,"}, {"id": 259, "start": 2571.74, "end": 2583.62, "text": "kann man vorstellen, so ist halt Rally auch, lass es mal nicht Fridays for Future auf Twitter sehen,"}, {"id": 260, "start": 2583.62, "end": 2594.7, "text": "jetzt bauen wir mal zu mir auf die Arbeit, jetzt bauen wir nen Bagger, 7.15 Leute,"}, {"id": 261, "start": 2594.7, "end": 2598.22, "text": "guck mal der ist seit eineinhalb Stunden schon auf der Ahr, also heute ist Sonntag, aber jetzt wo"}, {"id": 262, "start": 2598.22, "end": 2602.42, "text": "wir hier sitzen, er wäre seit eineinhalb Stunden schon auf dem Weg hier, fahr dann auf die Baustelle"}, {"id": 263, "start": 2602.42, "end": 2606.58, "text": "oder ich richte meine Sachen schon abends, fahr gleich am Morgen schon auf die Baustelle,"}, {"id": 264, "start": 2606.58, "end": 2614.34, "text": "moin moin, meistens treffen wir uns hier morgen und dann werden wir erst mal eingeteilt auf die"}, {"id": 265, "start": 2614.34, "end": 2623.3, "text": "Baustellen, Baumaschinen, Mechatronik her, also Baumaschinen reparieren, warten, pflegen und was"}, {"id": 266, "start": 2623.3, "end": 2626.62, "text": "mit YouTube passiert ist, das ist ein neues Design und bei YouTube ist es ja immer so ein bisschen"}, {"id": 267, "start": 2626.62, "end": 2630.66, "text": "random wer was kriegt, kannst ja mal Cash lernen oder einen neuen Browser verwenden oder so,"}, {"id": 268, "start": 2630.66, "end": 2638.14, "text": "dann soll es bei dir auch so sein, es ist random so ein bisschen, eben auch Einweisung geben für"}, {"id": 269, "start": 2638.14, "end": 2643.7, "text": "einen Baggerfahrer, der die Maschine auch nicht kennt, wenn sie neu ausgeliefert wird, jetzt gehen"}, {"id": 270, "start": 2643.7, "end": 2647.58, "text": "wir erstmal an eine kleinere Maschine, ich finde das neue gar nicht schlecht, 10 Tonnen, dann müssen wir"}, {"id": 271, "start": 2647.58, "end": 2658.3, "text": "einen Schlauch abdichten, easy nur 10 Tonnen, könnte der Chet bestimmt auch reparieren,"}, {"id": 272, "start": 2658.3, "end": 2670.66, "text": "Chet kann mit Schwarmintelligenz alles, Servus Morgen, Twitch Repairs Bagger,"}, {"id": 273, "start": 2670.66, "end": 2679.54, "text": "das wäre doch mal ein Stream, kaputter Schlauch, das ist schlecht, da geht er nicht mehr,"}, {"id": 274, "start": 2679.54, "end": 2689.26, "text": "jetzt mache ich die Entlüftung vom Tank auf, da musst du aber echt Plan haben,"}, {"id": 275, "start": 2689.26, "end": 2694.62, "text": "ich meine es ist ja nicht als gibt es nur zwei Bagger, ok aber wahrscheinlich funktionen die"}, {"id": 276, "start": 2694.62, "end": 2702.18, "text": "alle relativ ähnlich, das ist einfach nur, dass der Tankdruck verschwindet und dass wir"}, {"id": 277, "start": 2702.18, "end": 2706.34, "text": "keine Probleme haben mit Hydraulikdruck, da muss man schon ein bisschen wissen, dass es dir nicht ins"}, {"id": 278, "start": 2706.34, "end": 2712.62, "text": "Gesicht pustet, ich weiß nicht, da ist bestimmt ordentlich Druck drauf, wenn du da irgendwie an"}, {"id": 279, "start": 2712.62, "end": 2718.18, "text": "der falschen Stelle was öffnest und stehst davor, dann pustet es dich erstmal gut, halt einfach ein"}, {"id": 280, "start": 2718.18, "end": 2725.38, "text": "Heidenspaß, ich glaube der Hauptgrund warum ich das mache ist eben das Kindheitsgefühl,"}, {"id": 281, "start": 2725.38, "end": 2730.3, "text": "so große Maschinen, wie früher am Sandkasten mit dem Bagger gespielt und heute spielen wir halt mit"}, {"id": 282, "start": 2730.3, "end": 2739.34, "text": "dem richtigen Bagger, da hat sich jemand Mühe gegeben, das ist mal ein ordentlicher Schraubenschlüssel,"}, {"id": 283, "start": 2739.34, "end": 2748.22, "text": "ne keine Ahnung, da habe ich auch so ein Set von, ich hatte mir mal so ein Vera Joker Schlüssel Set gekauft,"}, {"id": 284, "start": 2748.22, "end": 2753.54, "text": "mega teuer aber super nice, wenn man sie mal braucht, aber das ist ein ganz anderes Kaliber,"}, {"id": 285, "start": 2753.54, "end": 2765.3, "text": "da hätte ich nix was da dran passt, Maulschlüssel ja genau, ich glaube die arbeiten agiler als in"}, {"id": 286, "start": 2765.3, "end": 2769.74, "text": "der IT, wo die Leute sagen sie arbeiten agil, weil da musst du wirklich dynamisch gucken was Sache"}, {"id": 287, "start": 2769.74, "end": 2775.74, "text": "ist, die labern nicht nur agil, die sind agil, okay jetzt müssen wir nur kurz gucken wie viel"}, {"id": 288, "start": 2775.74, "end": 2783.98, "text": "Öl uns da entgegen läuft oder eben auch nicht, komplett, Bagger läuft aus, man weiß ja was auf"}, {"id": 289, "start": 2783.98, "end": 2790.3, "text": "einen zukommt, schmierig, schlechtes Wetter, ich wollte gerade sagen 45 Stunden, Alter,"}, {"id": 290, "start": 2790.3, "end": 2800.42, "text": "der hat schon gut was zu tun, ich hoffe wirklich, dass der viel Geld verdient damit, dann passt das,"}, {"id": 291, "start": 2800.42, "end": 2827.94, "text": "will mal jemand probieren, ob alles passt soweit, passt, Betraulich ist auch voll, ich würde gerne"}, {"id": 292, "start": 2827.94, "end": 2835.14, "text": "auf jeden Fall meinen Meister irgendwann machen, Wann steht noch in den Stern, mal dieses komische"}, {"id": 293, "start": 2835.14, "end": 2843.78, "text": "Leisten Ding da, jetzt ist weg, guck mal 9.30 Uhr, der hat schon Bagger repariert, das ist mal was,"}, {"id": 294, "start": 2843.78, "end": 2848.9, "text": "ob alles passt, ob alles richtig schön zusammengeschraubt wurde, einfach alles einmal"}, {"id": 295, "start": 2848.9, "end": 2853.9, "text": "bevor die Maschine das erste Mal rausgeht auf die Baustelle, erst mal Jira Ticket aufmachen,"}, {"id": 296, "start": 2853.9, "end": 2859.14, "text": "wenn der Bagger nicht geht, genau, Liebherrmaschinen, also wir haben einen großen Fuhrpark mit Maschinen"}, {"id": 297, "start": 2859.14, "end": 2865.62, "text": "und vermieten den natürlich, haben einen Mietpark mit Großgeräten, natürlich auch mit Kleingeräten,"}, {"id": 298, "start": 2865.62, "end": 2872.02, "text": "also von uns kann man alles von der Rüttelplatte bis zum großen Bagger alles ausleihen, natürlich"}, {"id": 299, "start": 2872.02, "end": 2878.9, "text": "verkaufen wir auch Maschinen, natürlich ist ein Bagger teuer, das ist ein Riesending mit"}, {"id": 300, "start": 2878.9, "end": 2882.74, "text": "viel Technik und muss, wundert mich nicht, dass ein Bagger ordentlich Geld kostet,"}, {"id": 301, "start": 2882.74, "end": 2886.14, "text": "mal ganz davon abgesehen, man kauft sich ja auch nicht einfach mal random einen Bagger,"}, {"id": 302, "start": 2886.14, "end": 2888.18, "text": "weil es einem danach ist, man will ja auch was damit machen."}, {"id": 303, "start": 2888.18, "end": 2893.66, "text": "Hier am Aachen bin ich schon häufig in meinem Leben Bagger gefahren, für mich war es kein"}, {"id": 304, "start": 2893.66, "end": 2897.62, "text": "Problem, ich denke, wenn man am Anfang neu draufkommt, ist es wahrscheinlich schon ein"}, {"id": 305, "start": 2897.62, "end": 2902.06, "text": "bisschen ungewohnt, aber die Maschinen, die sind sehr schön zu fahren, also da kommt man schon"}, {"id": 306, "start": 2902.06, "end": 2908.5, "text": "relativ schnell rein, haben wir ein Protokoll, dass wir jetzt einfach mal Schritt für Schritt"}, {"id": 307, "start": 2908.5, "end": 2914.42, "text": "durchgehen, und wenn wir das durchgegangen sind, ist die Maschine sozusagen einmal durchgecheckt"}, {"id": 308, "start": 2914.42, "end": 2916.62, "text": "und fertig für den Einsatz auf der Baustelle."}, {"id": 309, "start": 2916.62, "end": 2920.34, "text": "Und danach erstmal Daily Scrum."}, {"id": 310, "start": 2920.34, "end": 2935.18, "text": "Was hat er für einen Agro-Schrauber?"}, {"id": 311, "start": 2935.18, "end": 2946.98, "text": "Porsche Akku, 18 Volt, ja das sind die dicken."}, {"id": 312, "start": 2946.98, "end": 2962.34, "text": "Also, gecheckt haben wir alles, passt alles soweit, kommen jetzt noch Mietpark-Aufkleber"}, {"id": 313, "start": 2962.34, "end": 2968.62, "text": "drauf, dass man auch weiß, von welcher Firma sie sind, genau, und dann, wenn es der Mietpark"}, {"id": 314, "start": 2968.62, "end": 2973.18, "text": "zulässt im Büro, kann die Maschine ausgelehnt werden und ist einsatzbereit für die Baustelle."}, {"id": 315, "start": 2973.18, "end": 2981.94, "text": "Überlegt mal, wie viel der schon geschafft hat, und es ist erst mal 12, in der Zeit haben"}, {"id": 316, "start": 2981.94, "end": 2988.78, "text": "die ganzen Leute aus diesen, ich zeige euch heute meinen Software-Entwicklungsjob, haben"}, {"id": 317, "start": 2988.78, "end": 2995.9, "text": "die Kaffee gemacht, haben eine Runde Tischkicker gespielt, Daily Scrum und vielleicht nochmal"}, {"id": 318, "start": 2995.9, "end": 3000.18, "text": "irgendwie einen Code-Editor aufgemacht, zumindest in den Videos, realistisch ist es ja auch"}, {"id": 319, "start": 3000.18, "end": 3004.02, "text": "nicht, aber in den Videos sieht das immer so aus, der schafft wenigstens was."}, {"id": 320, "start": 3004.02, "end": 3010.26, "text": "Also wie gesagt, so Leute brauchen wir, guck mal, es ist aktuell so schwierig beispielsweise"}, {"id": 321, "start": 3010.26, "end": 3014.58, "text": "Handwerker zu bekommen, wenn du dir ein Zaun bauen lassen willst oder wenn du dir irgendwas"}, {"id": 322, "start": 3014.58, "end": 3018.54, "text": "am Klimaanlage am Haus bauen lassen willst, irgendwas am Fenster, an der Tür, was auch"}, {"id": 323, "start": 3018.54, "end": 3025.66, "text": "immer oder sei es nur einfach ein Ladegerät fürs Elektroauto, das dauert Wochen und Monate"}, {"id": 324, "start": 3025.66, "end": 3028.86, "text": "bis du da Leute bekommst, also Handwerker brauchen wir unbedingt und deswegen hoffe"}, {"id": 325, "start": 3028.86, "end": 3034.06, "text": "ich auch immer, dass die so viel verdienen, dass sie alle glücklich mit sind und das weiter"}, {"id": 326, "start": 3034.06, "end": 3035.86, "text": "machen bzw. noch mehr Leute machen."}, {"id": 327, "start": 3035.86, "end": 3043.22, "text": "Wir brauchen viel weniger Management Bullshit-Shops, mehr sowas."}, {"id": 328, "start": 3043.22, "end": 3048.62, "text": "Oft unterwegs, wenn es da mal was gibt, wenn man halt nichts dabei hat, also immer wieder"}, {"id": 329, "start": 3048.62, "end": 3053.94, "text": "unterschiedlich, genau, aber heute gehen wir mal in den Kramer."}, {"id": 330, "start": 3053.94, "end": 3061.66, "text": "70, boah, die kommen aber alle mit wenig Geld aus, 70 Euro kann ich theoretisch schon für"}, {"id": 331, "start": 3061.66, "end": 3064.26, "text": "eine, kann ich eine Woche in Frankfurt Mittagessen ausgeben."}, {"id": 332, "start": 3064.26, "end": 3073.82, "text": "Monatlich, das ist ja nix, ja, wie gesagt, wenn ich wirklich komplette Wochen nach Frankfurt"}, {"id": 333, "start": 3073.82, "end": 3079.7, "text": "fahren würde und da jeden Tag essen, bin ja aber 70 Euro oder einen großen Döner-Teller,"}, {"id": 334, "start": 3079.7, "end": 3088.54, "text": "ne, wobei, na ja nicht ganz, also Mittag, es haben ja viele Leute, viele Restaurants"}, {"id": 335, "start": 3088.54, "end": 3092.22, "text": "meine ich, viele Restaurants in Frankfurt haben ja immer noch so Mittagskarten und sowas,"}, {"id": 336, "start": 3092.22, "end": 3100.54, "text": "da kannst du immer noch für, sagen wir mal, 8 Euro, 8,50 oder sowas futtern, aber trotzdem,"}, {"id": 337, "start": 3100.54, "end": 3104.3, "text": "da hast du in zwei Wochen hast du das und dann musst du dich, da darfst du schon nichts"}, {"id": 338, "start": 3104.3, "end": 3105.86, "text": "zu trinken mehr dabei bestellen und so."}, {"id": 339, "start": 3105.86, "end": 3116.58, "text": "Baggerkette ist kaputt, das Kettenlied gerissen und das wurde jetzt einmal getauscht, weil"}, {"id": 340, "start": 3116.58, "end": 3121.82, "text": "gebrochenes Kettenlied ist natürlich nicht gut, das wird, genau, das wird immer schlimmer"}, {"id": 341, "start": 3121.82, "end": 3125.86, "text": "und irgendwann drehst du und dann liegt die Kette neben Bagger und das ist natürlich"}, {"id": 342, "start": 3125.86, "end": 3126.86, "text": "nicht gewollt."}, {"id": 343, "start": 3126.86, "end": 3129.26, "text": "Da hast du was zu tun?"}, {"id": 344, "start": 3129.26, "end": 3136.66, "text": "Ja genau, wichtig ist eben, wenn man die Kettenplatten, bevor man sie wieder drauf macht, dass es"}, {"id": 345, "start": 3136.66, "end": 3141.9, "text": "alles schön eben abgeschleift wird, dass da kein Rost, keine Farbpartikel, keine Dreckpartikel"}, {"id": 346, "start": 3141.9, "end": 3145.82, "text": "druntersitzt, dass es alles schön nachher wieder draufsitzt, weil das wird nachher mit"}, {"id": 347, "start": 3145.82, "end": 3151.14, "text": "Drehmoment angezogen und wichtig, dass es halt eine gerade Oberfläche hat."}, {"id": 348, "start": 3151.14, "end": 3163.34, "text": "Alter, die Musik, Alter, BTF, Pa, Pa, Pa, Pa, Skrrrra, Handwerkliche Sachen, da darf man"}, {"id": 349, "start": 3163.34, "end": 3168.46, "text": "natürlich nicht zurückschrecken, jemand der beim Funken gleich zurückschrecken, schreit"}, {"id": 350, "start": 3168.46, "end": 3173.18, "text": "den, kann man wahrscheinlich weniger gebrauchen, hier Funken, Leute, ich hab vor nicht allzu"}, {"id": 351, "start": 3173.18, "end": 3178.94, "text": "langer Zeit das erste Mal Metall durchgeschnitten selbst und ich war überrascht, dass es Funken"}, {"id": 352, "start": 3178.94, "end": 3186.02, "text": "sprüht, also wenn man Metall durchschneidet, sprüht es Funken, das hätte ich eigentlich"}, {"id": 353, "start": 3186.02, "end": 3195.46, "text": "wissen können, aber das war mir so nicht klar und jetzt weiß ich's, aber da hab ich auch"}, {"id": 354, "start": 3195.46, "end": 3209.18, "text": "gedacht, hoch, was denn das, aber passiert ja nix."}, {"id": 355, "start": 3209.18, "end": 3213.3, "text": "Maschine hat natürlich paar tausend Stunden schon drauf, ist im Steinbruch gelaufen, deshalb"}, {"id": 356, "start": 3213.3, "end": 3216.5, "text": "leihert sich alles ein bisschen aus und dehnt sich ein bisschen aus, deshalb müssen wir"}, {"id": 357, "start": 3216.5, "end": 3222.34, "text": "jetzt die Schraubenlöcher ein bisschen anpassen, da halt ein neues Kettenglied drin ist."}, {"id": 358, "start": 3222.34, "end": 3238.78, "text": "Aber der gute Vera-Kraft vorm Schraubendreher da unten, seht ihr ihn?"}, {"id": 359, "start": 3238.78, "end": 3243.9, "text": "Ja passt so ganz wie es soll, deshalb beschleunigen wir das Ganze, dass wir das noch stimmelang"}, {"id": 360, "start": 3243.9, "end": 3253.94, "text": "machen, so geht's ein bisschen schneller und den Rest bisschen wegfräsen und dann abschleufen."}, {"id": 361, "start": 3253.94, "end": 3258.82, "text": "Ist auch nicht immer schön an schweren Ketten zu arbeiten, also nicht immer einfach, aber"}, {"id": 362, "start": 3258.82, "end": 3262.9, "text": "du fühlst dich halt gut, wenn du zu Hause bist und du weißt, du hast gerade so riesen"}, {"id": 363, "start": 3262.9, "end": 3266.26, "text": "Kettgel gut gemacht, gewechselt bzw. in dem Fall jetzt repariert."}, {"id": 364, "start": 3266.26, "end": 3279.7, "text": "Alter, das ist mal so ein Drehmomentschlüssel, das ist ja eineinhalb Meter das Teil, das"}, {"id": 365, "start": 3279.7, "end": 3283.02, "text": "ist mal einer, da kannst du ordentlich anziehen."}, {"id": 366, "start": 3283.02, "end": 3289.1, "text": "Ich verdiene 3200 Brutto, dazu kommt natürlich noch Überstunden."}, {"id": 367, "start": 3289.1, "end": 3298.3, "text": "Und das wie oft im Jahr, sagt ihr auch wie viel Monatsgehälter?"}, {"id": 368, "start": 3298.3, "end": 3316.3, "text": "Also 3500 mal 12, mal 14 wäre okay würde ich sagen, aber der dürfte reust mehr verdienen,"}, {"id": 369, "start": 3316.3, "end": 3319.34, "text": "also nicht, dass ich da jetzt irgendeinen Einfluss drauf hätte."}, {"id": 370, "start": 3319.34, "end": 3324.06, "text": "Mit dem Geld bin ich zurzeit sehr zufrieden, da kann ich mich überhaupt nicht beschweren,"}, {"id": 371, "start": 3324.06, "end": 3325.06, "text": "wirklich überhaupt nicht."}, {"id": 372, "start": 3325.06, "end": 3329.74, "text": "Das ist auf jeden Fall nicht in Stein gemeißelt, das variiert sehr, natürlich wie lange man"}, {"id": 373, "start": 3329.74, "end": 3331.78, "text": "da ist, wie viel Erfahrung man hat."}, {"id": 374, "start": 3331.78, "end": 3337.5, "text": "Jeder Baumaschinenhersteller bietet Lehrgänge an, desto mehr Lehrgänge, desto besser kennt"}, {"id": 375, "start": 3337.5, "end": 3342.74, "text": "man die Maschinen, umso mehr Geld verdient man natürlich dann auch, genau so ist es."}, {"id": 376, "start": 3342.74, "end": 3344.9, "text": "Morgen muss ich einen Kundendienst machen."}, {"id": 377, "start": 3344.9, "end": 3351.18, "text": "Ist das noch Windhoff 7, Leute, ist das noch Windhoff 7, das ist ja antik hier."}, {"id": 378, "start": 3351.18, "end": 3356.7, "text": "Er wird bestimmt nicht mehr supportet."}, {"id": 379, "start": 3356.7, "end": 3363.94, "text": "Vista, wie kommst du auf Vista?"}, {"id": 380, "start": 3363.94, "end": 3371.78, "text": "Stimmt, das ist IEE7 oder sowas ja."}, {"id": 381, "start": 3371.78, "end": 3378.42, "text": "Raussuchen, morgens nur ein kleiner Radlader, noch die Teile, den nehmen wir gleich mit."}, {"id": 382, "start": 3378.42, "end": 3386.46, "text": "Dann haben wir jetzt alles drin und machen mal jetzt Feierabend."}, {"id": 383, "start": 3386.46, "end": 3398.18, "text": "Das war das Vista-Logo, okay, das ist ja wirklich antik."}, {"id": 384, "start": 3398.18, "end": 3407.1, "text": "Ich zieh mich mal um kurz."}, {"id": 385, "start": 3407.1, "end": 3412.06, "text": "Meine Freundin studiert, arbeitet auch nebenbei, aber den meisten Teil zahlt ich natürlich,"}, {"id": 386, "start": 3412.06, "end": 3413.38, "text": "weil ich verdiene noch das Geld."}, {"id": 387, "start": 3413.38, "end": 3417.78, "text": "Also wir haben eine Zwei-Zimmer-Wohnung, das sind schätzungsweise 90 Quadratmeter."}, {"id": 388, "start": 3417.78, "end": 3423.06, "text": "Für einen Freiburger Raum kann ich mir überhaupt nicht beschweren, ne, da bin ich total zufrieden."}, {"id": 389, "start": 3423.06, "end": 3425.54, "text": "Ist es teuer, ein Freiburger, hab keinen Plan."}, {"id": 390, "start": 3425.54, "end": 3432.22, "text": "Ich bin relativ zeitinsensiv, ich fahre Rallye, seit 2021 bin ich mein erstes Rennen, mein"}, {"id": 391, "start": 3432.22, "end": 3436.1, "text": "erstes Motorsport-Event gefahren und da hab ich mich auch wirklich drin verliebte und"}, {"id": 392, "start": 3436.1, "end": 3437.9, "text": "möchte auch nichts mehr anderes machen."}, {"id": 393, "start": 3437.9, "end": 3442.82, "text": "Der hat aber Energie, Alter, am Tag irgendwie achteinhalb Stunden arbeiten und dann auch"}, {"id": 394, "start": 3442.82, "end": 3446.38, "text": "abends Rallye fahren, bzw. üben oder was auch immer."}, {"id": 395, "start": 3446.38, "end": 3449.98, "text": "Also der wird ja nicht abends, aber der wird wahrscheinlich üben und am Auto rumbasteln"}, {"id": 396, "start": 3449.98, "end": 3450.98, "text": "und sonst was."}, {"id": 397, "start": 3450.98, "end": 3451.98, "text": "Boah, da hasse."}, {"id": 398, "start": 3451.98, "end": 3462.66, "text": "Nicht schlecht, Alter."}, {"id": 399, "start": 3462.66, "end": 3466.5, "text": "Ich hab noch nie Angst mich selber zu verletzen, ich hab immer nur Angst, dass ich mir mein"}, {"id": 400, "start": 3466.5, "end": 3467.5, "text": "Auto kaputt fahre."}, {"id": 401, "start": 3467.5, "end": 3470.26, "text": "Und mich mach ich immer, ich hab gar keine Gedanken."}, {"id": 402, "start": 3470.26, "end": 3473.34, "text": "Ganz ehrlich, das Gefühl kann ich nachvollziehen."}, {"id": 403, "start": 3473.34, "end": 3476.78, "text": "Das passt schon alles irgendwie."}, {"id": 404, "start": 3476.78, "end": 3483.06, "text": "Eigentlich sobald er ins Auto einsteigt, ist Katastrophe, ist Herzrasen, Freude, Angst."}, {"id": 405, "start": 3483.06, "end": 3484.78, "text": "Also bis jetzt ist noch nichts passiert."}, {"id": 406, "start": 3484.78, "end": 3490.54, "text": "Nicht ungefährlich der Sport, die sind zwar mega geschützt in dem Auto, aber wir haben"}, {"id": 407, "start": 3490.54, "end": 3494.54, "text": "schon einige Unfälle gesehen und das kann halt auch nicht so schön ausgehen."}, {"id": 408, "start": 3494.54, "end": 3500.66, "text": "Jetzt geht's nach Offenburg in die Rallyewerkstatt, wo wir unsere Rallye-Auto stehen haben, da"}, {"id": 409, "start": 3500.66, "end": 3505.42, "text": "bauen wir das Auto ab, mit dem wir gestern gekommen sind von der Rallye und bereiten"}, {"id": 410, "start": 3505.42, "end": 3506.42, "text": "das Auto für die nächste Rallye vor."}, {"id": 411, "start": 3506.42, "end": 3507.42, "text": "Der hat wirklich hartes Tagesprogramm."}, {"id": 412, "start": 3507.42, "end": 3508.42, "text": "Wieder los zur nächsten Rallye."}, {"id": 413, "start": 3508.42, "end": 3509.42, "text": "Also das Auto gehört meinen Eltern, das kaufe ich quasi monatlich ab, tanken müssen wir"}, {"id": 414, "start": 3509.42, "end": 3510.42, "text": "relativ viel, weil wir halt am Wochenende immer viel unterwegs sind und auch weite Strecken"}, {"id": 415, "start": 3510.42, "end": 3511.42, "text": "zurücklegen."}, {"id": 416, "start": 3511.42, "end": 3512.42, "text": "Ich darf nur Rallye fahren, solange ich auf den Führer stehe."}, {"id": 417, "start": 3512.42, "end": 3513.42, "text": "Das ist bestimmt bei den Eltern versichert, weil es billiger ist, oder?"}, {"id": 418, "start": 3513.42, "end": 3514.42, "text": "Weil es auch eben auf öffentlichen Straßen gefahren wird, auch die Verbindungsetappen"}, {"id": 419, "start": 3514.42, "end": 3515.42, "text": "und ohne."}, {"id": 420, "start": 3515.42, "end": 3516.42, "text": "Chad, das ist natürlich das Problem mit dem Auto."}, {"id": 421, "start": 3516.42, "end": 3517.42, "text": "Das ist das Problem mit dem Auto."}, {"id": 422, "start": 3517.42, "end": 3518.42, "text": "Das ist das Problem mit dem Auto."}, {"id": 423, "start": 3518.42, "end": 3519.42, "text": "Das Problem mit dem Auto."}, {"id": 424, "start": 3519.42, "end": 3520.42, "text": "Das Problem mit dem Auto."}, {"id": 425, "start": 3520.42, "end": 3521.42, "text": "Das Problem mit dem Auto."}, {"id": 426, "start": 3521.42, "end": 3522.42, "text": "Das Problem mit dem Auto."}, {"id": 427, "start": 3522.42, "end": 3523.42, "text": "Das Problem mit dem Auto."}, {"id": 428, "start": 3523.42, "end": 3524.42, "text": "Das Problem mit dem Auto."}, {"id": 429, "start": 3524.42, "end": 3543.42, "text": "Das Problem mit dem Auto."}, {"id": 430, "start": 3543.42, "end": 3568.42, "text": "Das Problem mit dem Auto."}, {"id": 431, "start": 3568.42, "end": 3589.42, "text": "Das Problem mit dem Auto."}, {"id": 432, "start": 3589.42, "end": 3593.62, "text": "Motor ist, aber auch weil da halt nichts an Isolierung oder sonst was dran ist, dass es"}, {"id": 433, "start": 3593.62, "end": 3599.5, "text": "möglichst leicht ist, da ist doch wahrscheinlich alles außer das Nötigste, was du brauchst"}, {"id": 434, "start": 3599.5, "end": 3623.54, "text": "am Auto weg. So geil das Ding. Bei der Rallye schaue ich nicht aufs Geld. Das, was sein"}, {"id": 435, "start": 3623.54, "end": 3627.58, "text": "muss, muss sein. Gute Sachen kosten Geld, bei der Rallye gibt es eigentlich nichts billiges,"}, {"id": 436, "start": 3627.58, "end": 3633.58, "text": "deshalb schwierig. Irgendwann später vom Rallye fahren leben, das wäre natürlich ein absoluter"}, {"id": 437, "start": 3633.58, "end": 3639.46, "text": "Traum, aber ob ich das jemals so weit schaffe, steht noch in den Sternen. Der Baumaschinenmechatroniker,"}, {"id": 438, "start": 3639.46, "end": 3643.98, "text": "der Rennfahrer, das sind zwei Sachen, die sich miteinander sehr, sehr gut verbinden."}, {"id": 439, "start": 3643.98, "end": 3651.46, "text": "Kann ich mir vorstellen. Von großen Maschinen, von großen langsamen Maschinen zu schnellen,"}, {"id": 440, "start": 3651.46, "end": 3657.74, "text": "kleinen Autos. Es ist schon ein guter Gegensatz. Der Kick, der macht es halt vor allem aus. Der"}, {"id": 441, "start": 3657.74, "end": 3671.98, "text": "Adrenalinkick im Rallyeauto, das macht schon wirklich Spaß. Bisschen leiser. Also ganz ehrlich,"}, {"id": 442, "start": 3671.98, "end": 3679.62, "text": "wenn es nach mir geht, könnte er ruhig deutlich mehr verdienen. Aber ich darf es ja nicht"}, {"id": 443, "start": 3679.62, "end": 3688.94, "text": "entscheiden. Wenn ihr Mechatronik sogar studieren wollt, klickt mal hier. Und falls ihr mehr"}, {"id": 444, "start": 3688.94, "end": 3696.02, "text": "Mechatroniker sehen wollt, die Rennfahren sogar, klickt hier. Haben die vielleicht noch was anderes,"}, {"id": 445, "start": 3696.02, "end": 3701.22, "text": "was man... Irgendwas, was vielleicht auch ein bisschen so mit Dating und Partnersuche ohne App."}, {"id": 446, "start": 3701.22, "end": 3706.66, "text": "So arbeitet eine Partner... Oh nee, please. Nein, nein, nein, das gucken wir uns jetzt nicht an."}, {"id": 447, "start": 3706.66, "end": 3711.86, "text": "Was verdient ein Kundendienst? Das haben wir schon geguckt. Den Rest haben wir auch schon alles"}, {"id": 448, "start": 3711.86, "end": 3719.94, "text": "geguckt. Partnervermittlung. Gibt es sowas überhaupt noch offline? Macht das jemand offline? Also,"}, {"id": 449, "start": 3719.94, "end": 3723.7, "text": "ich habe euch ja mal erzählt, mein Vater hatte früher auch eine Partnervermittlung und hat die"}, {"id": 450, "start": 3723.7, "end": 3739.82, "text": "Leute gescampt. Also, wenn ich sowas lese, verbinde ich damit schon Scam. Aber es ist"}, {"id": 451, "start": 3739.82, "end": 3758.74, "text": "sonst irgendwas Spannendes hier. Party im Kult-Discounter. Mein Gott, was wird denn wieder"}, {"id": 452, "start": 3758.74, "end": 3763.7, "text": "abgehen? Das sind so Videos, die haben vielleicht einen ansprechenden Titel, aber interessiert mich"}, {"id": 453, "start": 3763.7, "end": 3769.1, "text": "so gar nicht. Wenn ich Titel schon lese, habe ich keinen Bock. Abgezockt. Wir testen den Gaming-PC"}, {"id": 454, "start": 3769.1, "end": 3793.14, "text": "von Netto. Aber RGB. Mittlerweile haben auch Billig-PC schon RGB. Ist your PC hacked? Sicherlich,"}, {"id": 455, "start": 3793.14, "end": 3801.58, "text": "der Chat hackt laufend mein PC. Stimmt's? Aber was können wir uns sonst noch angucken hier?"}, {"id": 456, "start": 3801.58, "end": 3819.66, "text": "What would happen if you swiped the water chat? Was? Ich glaube, das Video habe ich aufgemacht,"}, {"id": 457, "start": 3819.66, "end": 3825.06, "text": "weil das vorher in der Empfehlung drin war. Ja, dann zeig doch mal, was passiert, wenn man den"}, {"id": 458, "start": 3825.06, "end": 3847.5, "text": "Water-Chat swiped. Wie waren die Aufrufe? Die Aufrufe der einzelnen Berufe, zeigt mal her."}, {"id": 459, "start": 3847.5, "end": 3865.34, "text": "Ja, schwankt schon. Der Jäger, guck mal, der Jäger hat richtig viele Aufrufe. Das Video mit dem Jäger"}, {"id": 460, "start": 3865.34, "end": 3869.82, "text": "hat mich verwirrt. Könnt ihr euch noch dran erinnern? Da hat er in dem Video, irgendwann hat er"}, {"id": 461, "start": 3869.82, "end": 3874.18, "text": "irgendeinen Reh erschossen und danach dem Reh so einen Zweig in den Mund gesteckt und meinte,"}, {"id": 462, "start": 3874.18, "end": 3880.82, "text": "das ist gute alte Jäger-Tradition. Ich dachte mir so, what? Hä? Als würde das erschossene Reh"}, {"id": 463, "start": 3880.82, "end": 3883.58, "text": "noch irgendwie interessieren, ob es jetzt einen Zweig im Mund hat oder nicht?"}, {"id": 464, "start": 3896.38, "end": 3902.58, "text": "Das war doch die, die den ganzen Tag nur Excel-Tabellen gemacht hat, oder? Selbstständige"}, {"id": 465, "start": 3902.58, "end": 3914.82, "text": "Excel-Tabellenerstellerinnen. Okay, also was passiert, wenn man den Water-Chat swiped? Alles"}, {"id": 466, "start": 3914.82, "end": 3919.66, "text": "klar. Das ist ein Video, wo wahrscheinlich drei Sekunden was passiert. Wie findest du das neue"}, {"id": 467, "start": 3919.66, "end": 3923.86, "text": "YouTube-UI? Ehrlich gesagt gar nicht mal so kacke. Also die letzten Überarbeitungen waren immer"}, {"id": 468, "start": 3923.86, "end": 3936.5, "text": "schlechter. Jetzt finde ich in Ordnung. Wir gucken mal, also wo wird denn, wo wird der Finger"}, {"id": 469, "start": 3936.5, "end": 3953.26, "text": "geswiped? Also je nachdem, was das für einen Wasserstrahl ist, oder wie nennt man das oft"}, {"id": 470, "start": 3953.26, "end": 3959.34, "text": "durch so Wasserschneider oder so, keine Ahnung, würde ich mal von ausgehen, das geht bis auf die"}, {"id": 471, "start": 3959.34, "end": 3965.7, "text": "Knochen. Ich glaube nicht, dass es deine Knochen komplett durchschneidet, wenn du es einfach nur"}, {"id": 472, "start": 3965.7, "end": 3973.9, "text": "drunter durchziehst, aber so hier Adern, Bänder, sonst ist wahrscheinlich alles durch. Schon das"}, {"id": 473, "start": 3973.9, "end": 3979.9, "text": "Battlefield 2042-Video gesehen, Wasserschneider, genau. Nö, ich habe aber viele Battlefield-Videos"}, {"id": 474, "start": 3979.9, "end": 3990.06, "text": "gesehen schon. Ich weiß nicht, ob ich das jetzt schon gesehen habe. Ich spule jetzt mal vor,"}, {"id": 475, "start": 3990.06, "end": 4009.06, "text": "weil solche Videos in zehn Minuten Gelaber und drei Sekunden spannend ist. Also ich hätte keinen"}, {"id": 476, "start": 4009.06, "end": 4022.5, "text": "Urtsch meine Hand da drunter durchzuziehen. Aua! Okay, die Finger ist natürlich auch wieder was"}, {"id": 477, "start": 4022.5, "end": 4038.66, "text": "anderes. Okay, also Finger schon mal im Arsch, wenn man das drunter durchzieht. Ja, Finger,"}, {"id": 478, "start": 4038.66, "end": 4063.98, "text": "Finger ist quasi ab. Okay, F für den Finger. What? Ich sehe nix."}, {"id": 479, "start": 4068.66, "end": 4083.58, "text": "Warum haben die die Kamera eigentlich ins Gesicht gehalten jetzt? Autsch! Okay,"}, {"id": 480, "start": 4083.58, "end": 4087.18, "text": "jetzt haben wir schon alles gelernt, was wir in dem Video lernen können. Deine Hand ist"}, {"id": 481, "start": 4087.18, "end": 4090.78, "text": "ziemlich im Arsch, wenn du dir darunter durchgezogen hast. Der Rest des Videos"}, {"id": 482, "start": 4090.78, "end": 4103.74, "text": "können wir uns wahrscheinlich sparen. So halten es noch in eine Säge und sonst was. Also Hand ist"}, {"id": 483, "start": 4103.74, "end": 4114.22, "text": "F. Hand ist hinüber danach. Aber damit hätte ich ehrlich gesagt auch gerechnet. Also wie gesagt,"}, {"id": 484, "start": 4114.22, "end": 4122.52, "text": "ich glaube die Knochen hinten sind schon noch dran, aber der Rest ist... Aber so was machst"}, {"id": 485, "start": 4122.52, "end": 4128.02, "text": "du doch wahrscheinlich normalerweise mit Handschuhen, oder? Die haben einen Notstopp. Ja,"}, {"id": 486, "start": 4128.02, "end": 4134.22, "text": "Sägen haben auch teilweise einen Notstopp. Danach ist aber oftmals das Sägeblatt kaputt. Also es"}, {"id": 487, "start": 4134.22, "end": 4142.66, "text": "gibt ja so einen Notstopp für so Kreissägen. Die messen irgendwie die Leitfähigkeit oder die"}, {"id": 488, "start": 4142.66, "end": 4147.66, "text": "irgendwie sowas Leitfähigkeit von dem Sägeblatt. Und wenn du deinen Finger dranhältst, dann merkt"}, {"id": 489, "start": 4147.66, "end": 4152.38, "text": "er das quasi in Millisekunden Schnelle und haut von unten quasi so ein Bremsblock rein in das"}, {"id": 490, "start": 4152.38, "end": 4161.02, "text": "Sägeblatt. Sodass dein Finger halt noch dran ist, selbst wenn du es reinhältst. Aber der Finger ist"}, {"id": 491, "start": 4161.02, "end": 4172.38, "text": "halt dann zumindest angeschnitten, aber halt nicht ab. Aber das Sägeblatt ist halt im Arsch."}, {"id": 492, "start": 4172.38, "end": 4193.18, "text": "Wobei ganz ehrlich, besser Sägeblatt im Arsch als Finger ab, oder? Ja, Sägeblatt ist billiger"}, {"id": 493, "start": 4193.18, "end": 4201.38, "text": "als Arbeitsunfall. Ja, Arbeitsunfall ist ja eh nochmal extra teuer. Ist doch 10, ja. Dann"}, {"id": 494, "start": 4201.38, "end": 4211.78, "text": "lieber Sägeblatt oder wie? Was haben wir denn sonst noch? I leaked my IP address. Oje Leute,"}, {"id": 495, "start": 4211.78, "end": 4219.38, "text": "jetzt ist vorbei. Ich habe auch schon meine IP geleaked. Instant gehackt durch den Chat war"}, {"id": 496, "start": 4219.38, "end": 4230.9, "text": "ich dann wieder. Chat war instant drin bei mir. Eure Smart Home Automatik. Ah ja, das gucken wir"}, {"id": 497, "start": 4230.9, "end": 4237.9, "text": "jetzt. Das finde ich immer gut. Also das Einzige, was bisher passiert ist, als ich mal ab und zu"}, {"id": 498, "start": 4237.9, "end": 4242.54, "text": "meine IP geleaked habe, ist, dass es irgendwelche komischen DDoS Leute nicht lassen konnten und"}, {"id": 499, "start": 4242.54, "end": 4249.26, "text": "mir den Stream versauen mussten. Weil ich mir dann denke, ja, sollen sie mal machen."}, {"id": 500, "start": 4253.46, "end": 4257.14, "text": "Was hältst du von Morpheus to Twins? Habe ich tatsächlich erstaunlich wenig gesehen,"}, {"id": 501, "start": 4257.14, "end": 4262.42, "text": "aber das, was ich gesehen habe, fand ich nicht schlecht. Ich habe kaum was gesehen, muss ich sagen,"}, {"id": 502, "start": 4262.42, "end": 4273.38, "text": "bisher. Ich kenne den Channel, aber wenig Content geguckt bisher. Okay, lassen wir uns mal ein"}, {"id": 503, "start": 4273.38, "end": 4284.1, "text": "bisschen Home Automation zeigen wieder. Was haben wir denn hier? Oh, eine Tür-Gegensprechanlage,"}, {"id": 504, "start": 4284.1, "end": 4288.3, "text": "das ist ja so meine, da habe ich ja eine Schwäche für. Das müssen wir uns jetzt mal angucken. Also."}, {"id": 505, "start": 4288.3, "end": 4293.54, "text": "Wieder eure Automationen an und wo ihr überall Sensoren hingebaut habt. In Klingeln. Du bist"}, {"id": 506, "start": 4293.54, "end": 4302.14, "text": "ein Künstler. Unter Sitze oder so, dass Stühle wissen können. NordVPN? NordVPN gibt es bald. Ich"}, {"id": 507, "start": 4302.14, "end": 4311.14, "text": "habe schon eine Anfrage von NordVPN. Bald gibt es NordVPN Leute. Ihr seid echt verrückt. Also"}, {"id": 508, "start": 4311.14, "end": 4315.7, "text": "das Gute verrückt, nicht das Putin verrückt. Also lassen wir uns wieder von euren Automationen"}, {"id": 509, "start": 4315.7, "end": 4320.42, "text": "inspirieren und ich lasse für jede gezeigte Automation einen 50 Euro Amazon-Gutschein springen."}, {"id": 510, "start": 4320.42, "end": 4327.9, "text": "Menschentiere Automation, Ausgabe 15. Los geht's. Was ist denn da? Das ist überhaupt nicht. Fangen"}, {"id": 511, "start": 4327.9, "end": 4333.66, "text": "wir an mit Tobias, der hat ein paar Frickelzeugprojekte geschickt. Ich bin gespannt. Die"}, {"id": 512, "start": 4333.66, "end": 4338.5, "text": "Frickelzeug-Dorbe ist, wie der Name schon sagt, ein Fingerabdruckscanner und eine Klingel in einem"}, {"id": 513, "start": 4338.5, "end": 4343.42, "text": "Gerät. Da der Auto-Unlock meines Nukis bei uns nie so richtig zufällig funktioniert hat."}, {"id": 514, "start": 4346.62, "end": 4352.54, "text": "Den Knopf hat er nachträglich reingemacht, oder? Sieht aber ziemlich gut aus. Sieht fast original"}, {"id": 515, "start": 4352.54, "end": 4359.82, "text": "aus. Wollte ich eine andere Möglichkeit, unmöglichst bequem und schlüssellos ins Haus zu gelangen."}, {"id": 516, "start": 4359.82, "end": 4364.86, "text": "Dazu habe ich unsere alte Klingelplatte etwas aufgemotzt und den alten Drucktaster durch einen"}, {"id": 517, "start": 4364.86, "end": 4378.14, "text": "runden Finger abgedrückt. Sixhead. Das ist eine coole Idee. Das ist eine gute Idee. Das ist eine"}, {"id": 518, "start": 4378.14, "end": 4391.46, "text": "mega nice Idee. Finger hat man noch immer dabei. Das muss ich mir aufschreiben. Weil,"}, {"id": 519, "start": 4391.46, "end": 4401.18, "text": "warum ich das sage ist, ich bin ja gerade dabei, dass mein Hoftor automatisch auf und zu geht."}, {"id": 520, "start": 4401.18, "end": 4407.58, "text": "Beziehungsweise nicht automatisch. Dass ich mein Hoftor elektronisch auf und zu machen kann."}, {"id": 521, "start": 4407.58, "end": 4418.74, "text": "Wenn du an der Wassersäge bist, dann sind die Finger ab. Jet, gute Überleitung zur"}, {"id": 522, "start": 4418.74, "end": 4426.9, "text": "Video davor. Oder was heißt Überleitung? Retroleitung. Aber das wäre eine coole Sache."}, {"id": 523, "start": 4426.9, "end": 4434.18, "text": "Das wäre eine wirklich coole Sache. Da brauchst du keine Fernbedienung. Du brauchst kein NFC-Tag"}, {"id": 524, "start": 4434.18, "end": 4443.62, "text": "scannen oder sonst was. Du kannst einfach deinen Finger dran halten und du hättest die Möglichkeit,"}, {"id": 525, "start": 4443.62, "end": 4465.78, "text": "das Hoftor aufzumachen. Das finde ich ist eine richtig coole Idee. Du kannst das für Automationen"}, {"id": 526, "start": 4465.78, "end": 4471.58, "text": "nutzen, weil du die Finger kennst. Das ist ja genial. Das ist wirklich eine coole Idee."}, {"id": 527, "start": 4471.58, "end": 4478.82, "text": "Also sprich, wenn einer den Finger drauf hält und der Knopf erkennt den Finger nicht, dann klingelt"}, {"id": 528, "start": 4478.82, "end": 4483.66, "text": "und wenn du den Finger draufhältst und er erkennt den Finger, dann kannst du zum Beispiel das Hoftor"}, {"id": 529, "start": 4483.66, "end": 4498.06, "text": "aufmachen. Das ist eine ziemlich coole Idee. Sehr nice. Sixhead. Oh nein, gut, das bräuchte ich"}, {"id": 530, "start": 4498.06, "end": 4518.46, "text": "nicht. Das ist eine coole Idee. Du bist ein Künstler. Das ist eine gute Idee. So ein Video"}, {"id": 531, "start": 4518.46, "end": 4526.62, "text": "habe ich auch schon gesehen. Leute, die sich ein NFC-Chip unter die Haut spritzen lassen"}, {"id": 532, "start": 4526.62, "end": 4532.46, "text": "haben, dass man damit dann verschiedene Sachen auslösen kann. Ja, das habe ich auch schon gesehen."}, {"id": 533, "start": 4532.46, "end": 4539.22, "text": "Und es gibt mittlerweile sogar fertiges Setz. Da ist der RFID-Chip dabei und so eine Spritze,"}, {"id": 534, "start": 4539.22, "end": 4543.3, "text": "um sich das unter die Haut zu spritzen. Ich würde mir im Leben kein RFID-Chip unter die"}, {"id": 535, "start": 4543.3, "end": 4551.18, "text": "Haut spritzen. Vor allem, wie kriege ich den wieder raus, wenn ich den nicht mehr haben will?"}, {"id": 536, "start": 4551.18, "end": 4561.66, "text": "Wenn die Tür auch abgeschlossen ist, wurden die Türen dazu gezogen. Das ist aber eine richtig"}, {"id": 537, "start": 4561.66, "end": 4568.26, "text": "gute Idee. Das gefällt mir. Das verlängert die Akku-Laufzeit im Nuki doch erheblich. Das"}, {"id": 538, "start": 4568.26, "end": 4573.54, "text": "Ganze habe ich realisiert über einen ESP32-Mikro-Controller, der über MQTT mit"}, {"id": 539, "start": 4573.54, "end": 4578.1, "text": "meinem Open Hub Server verbunden ist. Das Klingelsignal wird außerdem als Backup analog"}, {"id": 540, "start": 4578.1, "end": 4582.94, "text": "über das bereits alte, vorhandene Klingelkabel übertragen, nur um sicher zu gehen, dass auch"}, {"id": 541, "start": 4582.94, "end": 4593.9, "text": "kein Besucher oder Paketbode aufgrund... Okay, lass mal kurz checken. Also. Can be used"}, {"id": 542, "start": 4593.9, "end": 4598.3, "text": "to ring the... Gut, mit irgendeinem Relay dann, weil sonst wird das wahrscheinlich nichts."}, {"id": 543, "start": 4598.3, "end": 4619.94, "text": "Ah, das sind die Knöpfe, die Kabel von dem Fingerdrucksensor. Okay, das muss man also selbst"}, {"id": 544, "start": 4619.94, "end": 4624.3, "text": "programmieren, die ganzen Finger. Aber trotzdem ist es eine wirklich gute Idee. Ich bin am"}, {"id": 545, "start": 4624.3, "end": 4629.54, "text": "überlegen, ob ich nicht sowas auch machen sollte. Und mal streigen, der Technik unerkannt bleibt."}, {"id": 546, "start": 4629.54, "end": 4633.7, "text": "Den Fall hatte ich anfangs einmal. Gute Idee. Das war kein Spaß. Finde ich sehr, sehr nice."}, {"id": 547, "start": 4633.7, "end": 4638.34, "text": "Das sinkt sicherlich sofort die Akzeptanz in der Familie. So kam noch eine kleine Web-Anwendung"}, {"id": 548, "start": 4638.34, "end": 4643.9, "text": "zur Verwaltung der Fingerabdrücke und der Konfiguration dazu. Web in the face gebaut, easy. Ich"}, {"id": 549, "start": 4643.9, "end": 4648.38, "text": "habe aber mittlerweile auch schon zwei nachbauten im Freundeskreis. Wer das Ganze ebenfalls nachbauen"}, {"id": 550, "start": 4648.38, "end": 4652.54, "text": "möchte, ich habe den Quellcode und die Binary... Was ist, wenn einer mit Handschuhe kommt? Naja,"}, {"id": 551, "start": 4652.54, "end": 4655.78, "text": "musst du halt den Handschuh ausziehen, wenn du das aufmachen willst. Aber ich habe nie"}, {"id": 552, "start": 4655.78, "end": 4659.74, "text": "Handschuhe an, selbst im Winter nicht. Dokumentation auf GitHub veröffentlicht."}, {"id": 553, "start": 4659.74, "end": 4663.94, "text": "Und du kannst ja immer noch die Fernbedienung drücken für das Schraub. Ansonsten googelt"}, {"id": 554, "start": 4663.94, "end": 4676.74, "text": "einfach nach Fingerprint. Zeigt mal her. Fingerprint Doorbell Projekt. Ach so,"}, {"id": 555, "start": 4676.74, "end": 4680.7, "text": "Paketboote mit Handschuh kann nicht klingeln, meint er. Nee, nee, nee, dafür würde ich es nicht"}, {"id": 556, "start": 4680.7, "end": 4685.82, "text": "verwenden. Ich würde die normale Klingel dran lassen und ich würde zusätzlich das Ding rein"}, {"id": 557, "start": 4685.82, "end": 4690.38, "text": "zum Öffnen fürs Tor dran machen, nicht zum Klingeln. Zum Klingeln, warum sollte ich meine"}, {"id": 558, "start": 4690.38, "end": 4694.1, "text": "Klingel auseinandernehmen, die funktioniert ja wunderbar. Ich würde einfach irgendwie draußen"}, {"id": 559, "start": 4694.1, "end": 4707.26, "text": "so ein Ding hin machen, dass man das auf und zu machen kann, die Tür. 113 Sterne, äh 133 Sterne."}, {"id": 560, "start": 4707.26, "end": 4714.74, "text": "Das sieht auch richtig gut aus. Guckt euch das mal an. Also, du siehst fast nicht den Unterschied"}, {"id": 561, "start": 4714.74, "end": 4725.74, "text": "zu dem normalen. Niedu, Dankeschön für den Sub. Pog, Pog, Subscription. Das ist sehr nice,"}, {"id": 562, "start": 4725.74, "end": 4732.1, "text": "finde ich gut. Was kosten so ein Teil? Bei Ali dauert es immer drei, vier Wochen bis es da ist."}, {"id": 563, "start": 4732.1, "end": 4743.78, "text": "Guck mal, Fingerabdrucksensor. Nope, nope, nope, nope. Ja, so was hier. Bei AliExpress kostet"}, {"id": 564, "start": 4743.78, "end": 4757.42, "text": "wahrscheinlich 350. Importierte China-Chinesen sind teuer. Ja, ja, das ist genau der Kleid. Kostet"}, {"id": 565, "start": 4757.42, "end": 4769.42, "text": "5 Euro bei AliExpress oder so. Alter, was ist mit euch los? Big Stonks, guck mal mal."}, {"id": 566, "start": 4776.86, "end": 4782.5, "text": "Ähm, warum wäre das wegen Datenschutz illegal? Du speicherst ja nicht die Fingerabdrücke von"}, {"id": 567, "start": 4782.5, "end": 4796.58, "text": "den Leuten. Fingerprint-Sensor. Sei, warum ist das so teuer? Ich meine, okay, es kostet bei"}, {"id": 568, "start": 4796.58, "end": 4808.46, "text": "AliExpress schon mal nur die Hälfte. Aber trotzdem, warum ist das so teuer? Keck. Keck, wait. Why so"}, {"id": 569, "start": 4808.46, "end": 4823.7, "text": "teuer? Dauerhaft. Das ist typischer China-Import-Name. Da müsst ihr danach Ausschau halten. Also,"}, {"id": 570, "start": 4823.7, "end": 4827.22, "text": "wenn ihr wissen wollt, ob ein Hersteller China-Chinesen-Import ist, dann müsst ihr"}, {"id": 571, "start": 4827.22, "end": 4834.02, "text": "nach solchen Wörtern Ausschau halten. Die heißen alle irgendwie nach so einem speziellen Muster."}, {"id": 572, "start": 4834.02, "end": 4842.62, "text": "Kann ich schwer beschreiben, aber die haben alle so einen... suche im Wörterbuch random ein Wort"}, {"id": 573, "start": 4842.62, "end": 4862.82, "text": "raus. Form schöner, schneller Fingerabdrucksensor. Ist das Paid-Bewertung?"}, {"id": 574, "start": 4862.82, "end": 4876.9, "text": "Arrivato shagiato. Wahrscheinlich heißt das, kam kaputt an? Heißt das, kam kaputt an?"}, {"id": 575, "start": 4876.9, "end": 4900.18, "text": "Kaputt angekommen, ja. Na gut, wenn das bei den Italienern nicht funktioniert. Aber kaputt"}, {"id": 576, "start": 4900.18, "end": 4924.74, "text": "ankommen kann er bei mir auch. Aber 35 Euro ist gar nicht... Warum ist das so teuer? Weshalb ist das Ding so teuer? Ist doch jetzt nicht so als wäre da wahnsinnig viel Zeug dran, ne? Professional Performance. Aber von der Idee her finde ich das wirklich sehr, sehr nice."}, {"id": 577, "start": 4924.74, "end": 4934.66, "text": "Alle anderen Sachen sind halt müllig. Aber wenn man sich das hier anguckt."}, {"id": 578, "start": 4943.26, "end": 4953.86, "text": "Nochmal der gleiche, guck mal, noch mal der gleiche. Er kostet 34 Euro. Der Kram ist wirklich auf Amazon.de sehr, sehr teuer. Ich meine, bei Aliexpress ist es schon teuer. 15 Euro ist für Aliexpress"}, {"id": 579, "start": 4953.86, "end": 4959.06, "text": "ein riesen Ding. Warum sollte ich dieses Board..."}, {"id": 580, "start": 4961.22, "end": 4968.02, "text": "So einfach nur ein Spannungswandler, oder? Ne, was ist denn das? Irgendwas mit Buzzer oder so drauf?"}, {"id": 581, "start": 4969.46, "end": 4972.9, "text": "Soll ich vielleicht einen Scanner suchen?"}, {"id": 582, "start": 4975.94, "end": 4983.82, "text": "Naja, ne. Ganz schön teuer für so ein kleines Teil. Aber es ist eine richtig gute Idee. Ich glaube, ich glaube, das werde ich mir mal im Hinterkopf"}, {"id": 583, "start": 4983.82, "end": 4986.3, "text": "behalten."}, {"id": 584, "start": 4987.5, "end": 4997.22, "text": "Ah ja, gut. Ein Klo braucht man ja auch. Ein Fingerabdrucksensor braucht man nicht wirklich. Das ist reine Spielerei und im Vergleich dazu benutzt du das Klo halt auch für wichtige"}, {"id": 585, "start": 4997.22, "end": 5001.58, "text": "Geschäfte, ja. Natürlich ist ein Klo wichtiger als ein Fingerabdrucksensor."}, {"id": 586, "start": 5001.58, "end": 5007.02, "text": "Wie das Projekt und zu den ganzen Produkten, soweit ich die finden kann, die wir heute im Video sehen, unten in der Videobeschreibung."}, {"id": 587, "start": 5007.02, "end": 5011.42, "text": "Mein zweites Projekt, das ich euch vorstellen möchte, ist das NS-Panel von Sonoff."}, {"id": 588, "start": 5011.42, "end": 5018.14, "text": "Ja, das juckt mich überhaupt nicht, das Ding. Da gibt es ja mittlerweile ein neues NS-Panel, sogar mit Android drauf."}, {"id": 589, "start": 5018.14, "end": 5027.18, "text": "Habe ich kein Anwendungsgebiet für. Also im Flur habe ich meine Fire HD 10 Dashboards hängen, die besser sind als jedes Sonoff-Panel."}, {"id": 590, "start": 5027.18, "end": 5031.82, "text": "Vor allem habe ich mehr Platz. Ganz normales Home Assistant-Dashboard drauf."}, {"id": 591, "start": 5031.82, "end": 5036.22, "text": "Das Panel habe ich direkt am ersten Tag mit Tasmutter geflasht und dann meine eigene..."}, {"id": 592, "start": 5036.22, "end": 5042.54, "text": "Ah, das ist noch das alte, das ist noch das alte ESP32-NS-Panel. Ja, das ist ja noch unsinniger."}, {"id": 593, "start": 5042.54, "end": 5051.1, "text": "...entwickelt. Hier zeige ich mir an der Haustür die wichtigsten Infos an, die ich beim Verlassen oder beim Betreten des Hauses benötige, neben der gefühlten Außenneparatur."}, {"id": 594, "start": 5051.1, "end": 5055.82, "text": "Ganz ehrlich, ich gucke morgen Wetterbericht und gut ist und außerdem kann ich auf mein Tablet im Flur gucken."}, {"id": 595, "start": 5055.82, "end": 5063.18, "text": "Ja, sieht jetzt sehr brauchbar aus und je nachdem wie ihr das gemacht habt, dann ist es auch... Aber ich habe ich keine Anwendungszwecke für."}, {"id": 596, "start": 5063.18, "end": 5070.38, "text": "Das habe ich übrigens auch. Also die Anzeigen habe ich mehr oder weniger genauso bei mir auf dem Tablet."}, {"id": 597, "start": 5070.38, "end": 5077.02, "text": "Ich habe eine Anzeige, ob noch Licht an ist. Ich habe eine Anzeige, ob noch Fenster bzw. irgendwelche Fenster-Türkontakte offen sind."}, {"id": 598, "start": 5077.02, "end": 5083.26, "text": "Gut, Garage habe ich nicht drin, weil Garage ist nicht automatisch öffnbar. Und Alarmanlage, ja."}, {"id": 599, "start": 5083.26, "end": 5089.26, "text": "Ob ein Fenster offen ist oder ob die Garage noch offen ist oder der Status der Alarmanlage."}, {"id": 600, "start": 5089.26, "end": 5094.54, "text": "Ich frage mich, wie du mit dem Schauen aus dem Fenster sagen willst, wie da Vormittag insgesamt wird."}, {"id": 601, "start": 5094.54, "end": 5099.18, "text": "Ich meine, du kannst sagen, jetzt scheint die Sonne, aber du weißt ja nicht unbedingt, wie das um 12 Uhr Mittag ist."}, {"id": 602, "start": 5099.18, "end": 5105.18, "text": "Ich lasse mir über ein kleines Textfeld weitere Details anzeigen, wie z.B. die gesamte Liste der noch offenen Fenster."}, {"id": 603, "start": 5105.18, "end": 5111.02, "text": "Über die Symbole kann ich zudem Lichter oder Rollen pro Stockwerk schalten oder auch die Garage öffnen und schließen."}, {"id": 604, "start": 5111.02, "end": 5114.86, "text": "Für die Haustür nutze ich einen eigenen Fensterkontakt, damit der Snooki auch hier..."}, {"id": 605, "start": 5114.86, "end": 5117.58, "text": "Da hat er sich aber Mühe gegeben. Was ist das für ein Kontakt?"}, {"id": 606, "start": 5117.58, "end": 5123.1, "text": "Kleiner Exkurs zu Fenster und Türkontakten. Ich nutze mittlerweile überall die Fensterkontakte FT."}, {"id": 607, "start": 5123.1, "end": 5127.18, "text": "Ah, das ist Dings hier. Das ist N-Ocean, glaube ich."}, {"id": 608, "start": 5127.18, "end": 5134.06, "text": "Also das ist so ein Funkprotokoll, wo die Sensoren keine Batterien benötigen."}, {"id": 609, "start": 5134.06, "end": 5137.58, "text": "Ja, kostet was, aber dafür musst du nie Batterien tauschen."}, {"id": 610, "start": 5137.58, "end": 5147.66, "text": "Die machen das irgendwie so, das ist irgendwie so ein ultra low power Funkprotokoll und durch quasi die Energie, die das Schalten irgendwie bringt, können die einmalig übertragen."}, {"id": 611, "start": 5147.66, "end": 5150.14, "text": "Du musst halt nie Batterien tauschen."}, {"id": 612, "start": 5150.14, "end": 5152.62, "text": "Es hat was, ja."}, {"id": 613, "start": 5152.62, "end": 5154.62, "text": "Aber es ist halt teuer."}, {"id": 614, "start": 5154.62, "end": 5156.62, "text": "Ganz ehrlich, dann..."}, {"id": 615, "start": 5158.62, "end": 5162.94, "text": "In dem Fall kaufe ich... Reichweite musst du mal gucken. N-Ocean heißt der Kram, glaube ich."}, {"id": 616, "start": 5162.94, "end": 5177.18, "text": "Aber ganz im Ernst, die ganzen passiven Sensoren, sei es jetzt Fenster, Türkontakte oder auch Schalter, die halten Jahre, die halten wirklich lang mit kleinen Batterien drinne."}, {"id": 617, "start": 5177.18, "end": 5188.78, "text": "E.K.E. von El Taco. Die sind zwar mit 45 Euro recht teuer, lassen sich aber unsichtbar im Fensterrahmen verstecken und dank N-Ocean und Energy Harvesting nie wieder eine Batterie wechseln zu müssen."}, {"id": 618, "start": 5188.78, "end": 5190.78, "text": "War für mich schlichtweg nicht so."}, {"id": 619, "start": 5190.78, "end": 5192.78, "text": "N-Ocean, ja."}, {"id": 620, "start": 5192.78, "end": 5194.78, "text": "War für mich schlichtweg das Killerfeature überhaupt."}, {"id": 621, "start": 5194.78, "end": 5198.78, "text": "Der Vollständigkeit halber will ich auch noch kurz meinen automatisierten Briefkasten zeigen."}, {"id": 622, "start": 5198.78, "end": 5200.78, "text": "Das funktioniert bei mir leider nicht richtig."}, {"id": 623, "start": 5200.78, "end": 5202.78, "text": "Das ist auch ein Projekt, was noch ansteht."}, {"id": 624, "start": 5202.78, "end": 5204.78, "text": "Briefkasten."}, {"id": 625, "start": 5204.78, "end": 5208.78, "text": "Aber mein Briefkasten hat so eine komische Form."}, {"id": 626, "start": 5208.78, "end": 5210.78, "text": "Da habe ich ja nichts Gutes gefunden."}, {"id": 627, "start": 5210.78, "end": 5220.78, "text": "Ich habe viel Automatisierungsshit, aber kein Briefkasten."}, {"id": 628, "start": 5220.78, "end": 5238.78, "text": "Also eigentlich hätte er dafür das hier nehmen müssen."}, {"id": 629, "start": 5238.78, "end": 5240.78, "text": "Sie haben Post."}, {"id": 630, "start": 5240.78, "end": 5242.78, "text": "Eigentlich hätte er das nehmen müssen, oder?"}, {"id": 631, "start": 5242.78, "end": 5244.78, "text": "Sie haben Post."}, {"id": 632, "start": 5244.78, "end": 5250.78, "text": "Falls es noch irgendjemand kennt."}, {"id": 633, "start": 5250.78, "end": 5260.78, "text": "Da Frauen und Kinder der Technik nicht immer trauen oder im Falle der Kinder mich manchmal einfach nur ärgern wollen, kann ich den Status am NS-Panel auch noch manuell quittieren."}, {"id": 634, "start": 5260.78, "end": 5262.78, "text": "Kinder Tibet nehmen."}, {"id": 635, "start": 5262.78, "end": 5268.78, "text": "Oder besser gesagt, einer deiner Zuschauer. Er hat mit seiner Vorstellung von Autositzsensoren mir völlig neue Welten eröffnet."}, {"id": 636, "start": 5268.78, "end": 5270.78, "text": "What?"}, {"id": 637, "start": 5270.78, "end": 5274.78, "text": "Ich nicht immer trauen oder im nächsten Projekt..."}, {"id": 638, "start": 5274.78, "end": 5276.78, "text": "Moment, Moment, was?"}, {"id": 639, "start": 5276.78, "end": 5278.78, "text": "Was du..."}, {"id": 640, "start": 5282.78, "end": 5284.78, "text": "Ist das..."}, {"id": 641, "start": 5284.78, "end": 5288.78, "text": "Gewichtssensor auf dem Stuhl?"}, {"id": 642, "start": 5288.78, "end": 5290.78, "text": "Sixhead-Time, Alter!"}, {"id": 643, "start": 5290.78, "end": 5294.78, "text": "Da kann man erkennen, wenn man auf dem Stuhl sitzt."}, {"id": 644, "start": 5294.78, "end": 5298.78, "text": "Bis wie viel Kilo ist das belastbar?"}, {"id": 645, "start": 5298.78, "end": 5302.78, "text": "Aber das ist eine gute Idee. Das ist eine coole Idee."}, {"id": 646, "start": 5302.78, "end": 5306.78, "text": "Da kann man was mit anfangen."}, {"id": 647, "start": 5306.78, "end": 5308.78, "text": "Von Autositzsensoren mir völlig neue Welten eröffnet."}, {"id": 648, "start": 5308.78, "end": 5312.78, "text": "Ich weiß nicht, wie ich bisher ohne ein automatisiertes Bett überhaupt leben konnte."}, {"id": 649, "start": 5312.78, "end": 5318.78, "text": "Leider funktionieren die Autositzsensoren unter einer 15 cm dicken Matratze nicht wirklich gut."}, {"id": 650, "start": 5318.78, "end": 5322.78, "text": "Also habe ich nach einer anderen Lösung gesucht und auch gefunden."}, {"id": 651, "start": 5322.78, "end": 5328.78, "text": "Bei mir sind nun unter den beiden Lappenrosten jeweils vier Welgezellen im 3D-gedruckten Gehäuse zusammen mit einem ESP."}, {"id": 652, "start": 5328.78, "end": 5330.78, "text": "Nice!"}, {"id": 653, "start": 5330.78, "end": 5334.78, "text": "Damit habe ich tatsächlich auch mal experimentiert."}, {"id": 654, "start": 5334.78, "end": 5340.78, "text": "Ich hatte es zum Beispiel so, dass das Licht ausgeschaltet hat 15 Minuten nachdem ich ins Bett bin."}, {"id": 655, "start": 5340.78, "end": 5346.78, "text": "Coole Sache, aber eigentlich relativ überflüssige Spielerei."}, {"id": 656, "start": 5346.78, "end": 5354.78, "text": "Wenn man wirklich erkennen will, ob man im Bett ist, gibt es einfachere Methoden, die auch ganz gut funktionieren."}, {"id": 657, "start": 5354.78, "end": 5360.78, "text": "Man kann zum Beispiel, wenn man sein Handy abends anschließt und lädt, falls man das macht."}, {"id": 658, "start": 5360.78, "end": 5366.78, "text": "Oder meistens geht es auch mit Uhrzeit ganz gut."}, {"id": 659, "start": 5366.78, "end": 5370.78, "text": "Oder aber, so wie ich es mittlerweile habe, ich habe einfach bei mir an der Tür jetzt einen Schalter hängen."}, {"id": 660, "start": 5370.78, "end": 5374.78, "text": "Da drücke ich drauf für, ich gehe ins Bett."}, {"id": 661, "start": 5374.78, "end": 5378.78, "text": "Dann ist es auch sicher, dann ist es keine Zufallserkennung oder so."}, {"id": 662, "start": 5378.78, "end": 5384.78, "text": "Dann weiß ich auch sicher, jetzt kann ich alle Lichter ausschalten."}, {"id": 663, "start": 5384.78, "end": 5390.78, "text": "Und was passiert denn eigentlich noch? Lichter ausschalten?"}, {"id": 664, "start": 5390.78, "end": 5394.78, "text": "Spaß eigentlich."}, {"id": 665, "start": 5394.78, "end": 5400.78, "text": "Überall Lichter ausschalten."}, {"id": 666, "start": 5400.78, "end": 5408.78, "text": "Und das Licht im Schlafzimmer noch anlassen und so was."}, {"id": 667, "start": 5408.78, "end": 5412.78, "text": "Und dann das Licht im Schlafzimmer automatisch ausschalten nach einer Minute."}, {"id": 668, "start": 5412.78, "end": 5414.78, "text": "Da kann man schon ganz coole Sachen machen."}, {"id": 669, "start": 5414.78, "end": 5418.78, "text": "Das sieht aber so ein bisschen so aus, als wären nicht nur vier Wegezellen im Einsatz, sondern acht."}, {"id": 670, "start": 5418.78, "end": 5422.78, "text": "Habe ich das eben richtig gesehen, dass die andere Betthälfte auch gewogen wird?"}, {"id": 671, "start": 5422.78, "end": 5424.78, "text": "Dünnes Eis."}, {"id": 672, "start": 5424.78, "end": 5430.78, "text": "Das gesamte Ehebett ist nun eine einzige große Waage mit zwei voneinander unabhängigen Waagschalen."}, {"id": 673, "start": 5430.78, "end": 5434.78, "text": "Ob die Frau so gerne gewogen wird?"}, {"id": 674, "start": 5434.78, "end": 5442.78, "text": "Dann recht gut arbeiten und nicht nur eine Belegungserkennung realisieren, die zum Beispiel eine Zu-Bett-Routine oder Aufstehroutine triggert,"}, {"id": 675, "start": 5442.78, "end": 5448.78, "text": "sondern abhängig vom Gewicht oder auch Zusatzgewicht zu gewissen Zeiten auch andere nette Spielereien treiben."}, {"id": 676, "start": 5448.78, "end": 5452.78, "text": "Was passiert denn, wenn das Gewicht in kurzer Zeit sich ändert?"}, {"id": 677, "start": 5452.78, "end": 5458.78, "text": "Das ist Mamas und Papas Bett. Geh wieder zurück in Deins."}, {"id": 678, "start": 5458.78, "end": 5460.78, "text": "Gute Nacht."}, {"id": 679, "start": 5460.78, "end": 5466.78, "text": "Ja, vielen Dank. Also bei uns hilft so eine Ansage im Moment, egal ob sie von Alexa oder von mir kommt, nicht so richtig."}, {"id": 680, "start": 5466.78, "end": 5468.78, "text": "Darum trage ich diese Augenringe."}, {"id": 681, "start": 5468.78, "end": 5470.78, "text": "Ja, danke Tobias."}, {"id": 682, "start": 5470.78, "end": 5472.78, "text": "Ach, die Augenringe. Ich sehe keine Augenringe."}, {"id": 683, "start": 5472.78, "end": 5478.78, "text": "Mein Kopf brummt ein bisschen. Die Klingel mit dem Fingerabdruck ist genial."}, {"id": 684, "start": 5478.78, "end": 5484.78, "text": "Und das Wiegebett ist auch auf jeden Fall eine interessante Idee. Auch der ganze Rest."}, {"id": 685, "start": 5484.78, "end": 5488.78, "text": "Mit dem NS-Penner habe ich nach wie vor noch ein kleines Namensproblem."}, {"id": 686, "start": 5488.78, "end": 5492.78, "text": "Stimmt, das hat wirklich einen blöden Namen, gerade in Deutschland."}, {"id": 687, "start": 5492.78, "end": 5496.78, "text": "Und einfach die verschiedenen Sachen. Ich glaube, du hattest Home-Matic-Sensoren, den El-Taco-Fenster-Sensor."}, {"id": 688, "start": 5496.78, "end": 5498.78, "text": "N-Ocean, ja."}, {"id": 689, "start": 5498.78, "end": 5502.78, "text": "Also einfach alles so zusammengezogen, wie es für dich gut funktioniert."}, {"id": 690, "start": 5502.78, "end": 5504.78, "text": "Die Türklingel-Geschichte ist wirklich nice."}, {"id": 691, "start": 5504.78, "end": 5508.78, "text": "Wenn auch ihr was zu zeigen habt, dann schickt es gerne unter zeug.cool slash zeigen."}, {"id": 692, "start": 5508.78, "end": 5512.78, "text": "Also sendet bitte nicht unbedingt ein 6-Minuten-Video wie Tobias ein."}, {"id": 693, "start": 5512.78, "end": 5519.78, "text": "Eure Chancen stehen besser und euer Lohn ist auch besser, wenn es nur 2-3 Minuten lang ist."}, {"id": 694, "start": 5519.78, "end": 5524.78, "text": "Und wie gesagt, für jede gezeigte Aufnahme gibt es 50 Euro."}, {"id": 695, "start": 5524.78, "end": 5530.78, "text": "Und diese 50 Euro bekommt auch Michael, falls sein Video es in den finalen Schnitt des Videos schafft."}, {"id": 696, "start": 5530.78, "end": 5539.78, "text": "Eine Automatisierung, um das Staubsaugen mit meinem Roborock-Staubsauger so einfach und smart wie möglich zu gestalten."}, {"id": 697, "start": 5539.78, "end": 5544.78, "text": "In der Küche wird hierbei nur benötigt, dass nach dem Essendettich abgeräumt und abgewischt wird."}, {"id": 698, "start": 5544.78, "end": 5549.78, "text": "Danach werden die Stühle hochgestellt und die Küche einfach verlassen."}, {"id": 699, "start": 5549.78, "end": 5552.78, "text": "Kurz darauf wird die Küche automatisch gestaubsaugt."}, {"id": 700, "start": 5552.78, "end": 5554.78, "text": "Guck mal, der hat da unten irgendwas dran."}, {"id": 701, "start": 5554.78, "end": 5560.78, "text": "Ist das ein Sensor, der erkennt, ob das Ding auf dem Kopf steht oder nicht?"}, {"id": 702, "start": 5560.78, "end": 5566.78, "text": "Irgendein Beschleunigungssensor oder irgendwas in der Richtung?"}, {"id": 703, "start": 5568.78, "end": 5572.78, "text": "Gut, das passiert bei uns auch über eine Zeitschaltfunktion."}, {"id": 704, "start": 5572.78, "end": 5575.78, "text": "Du hast jetzt gesagt, das hängt an Arbeitsabläufen."}, {"id": 705, "start": 5575.78, "end": 5584.78, "text": "Ich habe nicht gesehen, dass irgendjemand bei euch gerade irgendwas, also wie weiß denn der Tisch, dass er abgewischt ist?"}, {"id": 706, "start": 5584.78, "end": 5587.78, "text": "Ja, da ist ja irgendwas unten, irgendwas ist ja da unten am Stuhl dran."}, {"id": 707, "start": 5587.78, "end": 5591.78, "text": "Die Automatisierung dazu habe ich in Habitat mit Regeln."}, {"id": 708, "start": 5591.78, "end": 5593.78, "text": "Habitat verwendet das jemand, okay."}, {"id": 709, "start": 5593.78, "end": 5596.78, "text": "Küche-Chairs-Up-Sensor."}, {"id": 710, "start": 5596.78, "end": 5597.78, "text": "Was ist das?"}, {"id": 711, "start": 5597.78, "end": 5598.78, "text": "Hexerei?"}, {"id": 712, "start": 5598.78, "end": 5600.78, "text": "Dazu verwende ich eine 3D-Sensor."}, {"id": 713, "start": 5600.78, "end": 5605.78, "text": "Ah, okay, das ist das Weiße, was man da unten sieht."}, {"id": 714, "start": 5605.78, "end": 5606.78, "text": "Und was hat er da dran?"}, {"id": 715, "start": 5606.78, "end": 5610.78, "text": "Die Geburtsverhalterung für einen Türkontakt-Sensor, welcher auf eine Medikule macht."}, {"id": 716, "start": 5610.78, "end": 5614.78, "text": "Ach so, Alter, das ist ja viel simpler, als ich das gedacht habe."}, {"id": 717, "start": 5618.78, "end": 5620.78, "text": "Das ist ja viel simpler, als ich gedacht habe."}, {"id": 718, "start": 5620.78, "end": 5622.78, "text": "Ich dachte, da hat er einen Beschleunigungssensor oder sowas dran."}, {"id": 719, "start": 5622.78, "end": 5627.78, "text": "Der hat einfach so einen ganz normalen Fenster-Open-Closed-Sensor."}, {"id": 720, "start": 5627.78, "end": 5632.78, "text": "Und den hat er in so ein Gehäuse gesteckt, dass der Sensor sich halt bewegen kann."}, {"id": 721, "start": 5632.78, "end": 5635.78, "text": "Der Sensor geht nach unten, wenn der Kopf übersteht."}, {"id": 722, "start": 5635.78, "end": 5639.78, "text": "Beziehungsweise, nee, der Sensor geht nach unten, wenn der normal steht."}, {"id": 723, "start": 5639.78, "end": 5642.78, "text": "Und der Sensor geht ran, wenn der rumgedreht wird."}, {"id": 724, "start": 5642.78, "end": 5645.78, "text": "Das ist eigentlich ziemlich high IQ."}, {"id": 725, "start": 5645.78, "end": 5651.78, "text": "Also aus was Simplem, was Sixheadiges gemacht."}, {"id": 726, "start": 5651.78, "end": 5652.78, "text": "Genau."}, {"id": 727, "start": 5652.78, "end": 5655.78, "text": "Sixhead-Movement-Threehead-Technik, so sieht es aus."}, {"id": 728, "start": 5655.78, "end": 5658.78, "text": "Was das daneben ist, weiß ich nicht so genau."}, {"id": 729, "start": 5661.78, "end": 5663.78, "text": "Das ist ja genial. High IQ."}, {"id": 730, "start": 5663.78, "end": 5665.78, "text": "Ihr seid ja in Best-Form."}, {"id": 731, "start": 5665.78, "end": 5668.78, "text": "Das brauche ich auf jeden Fall nach."}, {"id": 732, "start": 5676.78, "end": 5677.78, "text": "Gute Idee."}, {"id": 733, "start": 5677.78, "end": 5681.78, "text": "Werden nun die Stühle wieder alle hochgestellt, schließt sich der Türkontakt-Sensor."}, {"id": 734, "start": 5681.78, "end": 5684.78, "text": "Eine Automatisierung prüft dann, ob..."}, {"id": 735, "start": 5684.78, "end": 5687.78, "text": "Also, das ist, dass sie auch wie so ein ganz normaler Acura..."}, {"id": 736, "start": 5687.78, "end": 5688.78, "text": "Äh..."}, {"id": 737, "start": 5688.78, "end": 5689.78, "text": "Acura..."}, {"id": 738, "start": 5689.78, "end": 5690.78, "text": "Xiaomi..."}, {"id": 739, "start": 5690.78, "end": 5693.78, "text": "Türkontakt-Sensor."}, {"id": 740, "start": 5696.78, "end": 5700.78, "text": "Hat der das 3D-Model irgendwo?"}, {"id": 741, "start": 5700.78, "end": 5701.78, "text": "Nope."}, {"id": 742, "start": 5709.78, "end": 5711.78, "text": "Jetzt haben wir eine gute Idee."}, {"id": 743, "start": 5711.78, "end": 5713.78, "text": "Wirklich gute Idee."}, {"id": 744, "start": 5714.78, "end": 5716.78, "text": "Dann fährt er los."}, {"id": 745, "start": 5718.78, "end": 5720.78, "text": "Das ist ein einfacher Fenster-Kontakt."}, {"id": 746, "start": 5720.78, "end": 5722.78, "text": "Ja, Idee ist gut."}, {"id": 747, "start": 5722.78, "end": 5743.62, "text": "Ok, ja,"}, {"id": 748, "start": 5743.62, "end": 5751.62, "text": "Nach Ablauf des Timers wird diese Liste an Räumen dann an Roborock übergeben und somit werden diese Räume dann gestaubsaugt."}, {"id": 749, "start": 5752.62, "end": 5754.62, "text": "Aber das wäre mir zu aufwendig."}, {"id": 750, "start": 5754.62, "end": 5761.62, "text": "Jederzeit in jedem Raum das Staubsaugen anzustoßen, ohne sich auch nur einmal mit der App auseinanderzusetzen."}, {"id": 751, "start": 5761.62, "end": 5766.62, "text": "Aber eine gute Idee ist es so, nach dem Motto Klick drauf und am nächsten Durchgang fährt er dann in den Raum. Eigentlich nicht schlecht."}, {"id": 752, "start": 5766.62, "end": 5773.62, "text": "Also das baue ich auf jeden Fall nach. Ein billiger Fensterkontakt, der in einer kleinen Führungsschiene, die ich selber drucken kann, rumrutscht."}, {"id": 753, "start": 5773.62, "end": 5775.62, "text": "Wunderbar. Danke Michael."}, {"id": 754, "start": 5775.62, "end": 5776.62, "text": "Ja, gute Idee."}, {"id": 755, "start": 5776.62, "end": 5781.62, "text": "Ich denke, da könnten wir tatsächlich den ein oder anderen Nachahmer anstiften. Also mindestens einen."}, {"id": 756, "start": 5781.62, "end": 5782.62, "text": "So, Johannes sichert Daten."}, {"id": 757, "start": 5782.62, "end": 5783.62, "text": "Wirklich coole Idee."}, {"id": 758, "start": 5783.62, "end": 5784.62, "text": "Kurzbefehlen am Mac."}, {"id": 759, "start": 5784.62, "end": 5789.62, "text": "Das klingt für mich wie ein Rezept für Desaster. Schauen wir mal rein, was er sich da gebastelt hat."}, {"id": 760, "start": 5789.62, "end": 5796.62, "text": "Ich habe mir eine kleine Automation gebaut und das Schreiben meiner Bachelorarbeit ein bisschen zu helfen."}, {"id": 761, "start": 5796.62, "end": 5801.62, "text": "Was sehen wir da im Hintergrund? Was ist das? Ist das HomeKit?"}, {"id": 762, "start": 5801.62, "end": 5805.62, "text": "Nein, Shortcuts ist das. Apple, Apple, Siri, Shortcuts."}, {"id": 763, "start": 5805.62, "end": 5810.62, "text": "Das ist das, das ist Paynes Champ zu arbeiten damit, Alter. Selbst einfache Sachen sind da fünf Seiten lang."}, {"id": 764, "start": 5810.62, "end": 5815.62, "text": "Das Programm ist teilweise nicht sehr zuverlässig in der Speicherung von Daten."}, {"id": 765, "start": 5815.62, "end": 5822.62, "text": "Außerdem kommt es manchmal vor, dass ich Änderungen vornehme, die ich am Ende gerne rückgängig gemacht hätte."}, {"id": 766, "start": 5822.62, "end": 5828.62, "text": "Dann ist aber schon einige Zeit vergangen und mir fällt die Textpassage zum Beispiel nicht mehr ein."}, {"id": 767, "start": 5828.62, "end": 5832.62, "text": "Wie wäre es, er könnte es einfach in Plain Text schreiben und in Git einchecken?"}, {"id": 768, "start": 5832.62, "end": 5842.62, "text": "Diesen Umstand zu lösen und um eine Sicherung zu haben, habe ich mir in der Kurzbefehle App eine kleine Automation gebaut, die genau das löst."}, {"id": 769, "start": 5842.62, "end": 5848.62, "text": "Und dazu ruft er am Anfang die Netzwerknamen von meinem WLAN ab, mit dem mein Mac gerade verbunden ist."}, {"id": 770, "start": 5848.62, "end": 5857.62, "text": "Das hat den Hintergrund, dass gerne, wenn ich zu Hause bin, die Arbeit zusätzlich auf meinem Heimserver speichern möchte."}, {"id": 771, "start": 5857.62, "end": 5864.62, "text": "Wenn das Netzwerk einen beliebigen Wert hat, also immer wenn ich mit einem Netzwerk verbunden bin, erstellt er hier aus dem Dokumenteordner ein."}, {"id": 772, "start": 5864.62, "end": 5867.62, "text": "Ah, das interessiert mich nicht. Next."}, {"id": 773, "start": 5867.62, "end": 5874.62, "text": "...gesucht oder so. Mein Mail-Programm macht in der aktuellen Version von irgendwelchen Arbeiten, aber generell Shorty hatte ich nicht auf dem Zettel."}, {"id": 774, "start": 5874.62, "end": 5882.62, "text": "Hm. Shortcut Trigger, Application, Time, der ist sogar in der gratis Version. Es ist ein Traum."}, {"id": 775, "start": 5882.62, "end": 5886.62, "text": "Vielen Dank für diesen Hinweis. Und alles Gute für die Bachelorarbeit."}, {"id": 776, "start": 5886.62, "end": 5888.62, "text": "Aber jetzt kommen wir zu einer ganz anderen Automation von mir."}, {"id": 777, "start": 5888.62, "end": 5894.62, "text": "Jede Woche öffnet sich diese App und ich kann aus über 30 wechselnden Rezepten auswählen."}, {"id": 778, "start": 5894.62, "end": 5895.62, "text": "Nice Sponsoring."}, {"id": 779, "start": 5895.62, "end": 5902.62, "text": "Dann kommt ein paar Tage später hier ein Karton mit abgezählten Zutaten und schicken Rezeptkarten nach Hause."}, {"id": 780, "start": 5902.62, "end": 5911.62, "text": "Ich muss mir keine Gedanken machen, wirst du zu essen, wirst du zur Thermomix extra dabei, die du sonst, wenn du für dich selbst gekocht hättest, vielleicht weggelassen."}, {"id": 781, "start": 5911.62, "end": 5915.62, "text": "Den Link unten in der Videobeschreibung benutzen. Frohes Automatisieren und guten Appetit."}, {"id": 782, "start": 5915.62, "end": 5921.62, "text": "Apropos Essen. Pit liefert ein paar Kühe für die Tiere im Namen dieses Formats."}, {"id": 783, "start": 5921.62, "end": 5925.62, "text": "Apropos Essen meine ich, dass es hier irgendwie um ein smartes Fressgetter geht."}, {"id": 784, "start": 5925.62, "end": 5927.62, "text": "Nicht um die Tiere natürlich."}, {"id": 785, "start": 5929.62, "end": 5931.62, "text": "Vom Herdenmanagementprogramm."}, {"id": 786, "start": 5933.62, "end": 5935.62, "text": "Einfangmechanismus."}, {"id": 787, "start": 5935.62, "end": 5937.62, "text": "Ich habe überhaupt keine Ahnung von Viehzucht."}, {"id": 788, "start": 5942.62, "end": 5943.62, "text": "What?"}, {"id": 789, "start": 5944.62, "end": 5946.62, "text": "Ich checke überhaupt nicht, was da passiert."}, {"id": 790, "start": 5946.62, "end": 5948.62, "text": "Wolle Dankeschön für 15 Monate als Subscription."}, {"id": 791, "start": 5948.62, "end": 5950.62, "text": "Was, was bin ich sehend?"}, {"id": 792, "start": 5950.62, "end": 5956.62, "text": "Fünfeinhalb Wege Ventil."}, {"id": 793, "start": 5956.62, "end": 5959.62, "text": "Damit kann man irgendwie Gitter auf und zu machen oder so."}, {"id": 794, "start": 5962.62, "end": 5965.62, "text": "Und was passiert jetzt? Die kriegt den Hals abgeschnitten oder wie?"}, {"id": 795, "start": 5965.62, "end": 5967.62, "text": "Die allerdings auch nicht."}, {"id": 796, "start": 5967.62, "end": 5969.62, "text": "Ich hoffe ja nicht."}, {"id": 797, "start": 5971.62, "end": 5974.62, "text": "Ach jetzt sind sie eingefangen, jetzt kommen sie nicht mehr raus."}, {"id": 798, "start": 5974.62, "end": 5976.62, "text": "Nee."}, {"id": 799, "start": 5976.62, "end": 5978.62, "text": "Hä?"}, {"id": 800, "start": 5978.62, "end": 5983.62, "text": "Okay, um 4.30 Uhr werden die Fressgitter geschaltet."}, {"id": 801, "start": 5983.62, "end": 5986.62, "text": "Ich muss gestehen, ich habe nicht so richtig verstanden, was hier passiert."}, {"id": 802, "start": 5986.62, "end": 5988.62, "text": "Ich auch nicht. Ich auch nicht."}, {"id": 803, "start": 5988.62, "end": 5992.62, "text": "Um die Tiere fixieren, um an den Tieren arbeiten zu können. Fieber messen."}, {"id": 804, "start": 5992.62, "end": 5994.62, "text": "Trächtigkeitsunversuchung."}, {"id": 805, "start": 5994.62, "end": 5998.62, "text": "Ach, da geht das Gitter zu, dass der Kopf da drin stecken bleibt oder wie?"}, {"id": 806, "start": 5998.62, "end": 6000.62, "text": "Und das Warten, bis die Kühe eingefangen haben, war nicht smart genug."}, {"id": 807, "start": 6000.62, "end": 6005.62, "text": "Die Kühe werden nach dem Melken am Melkroboter automatisch aussortiert in die Behandlungsbox."}, {"id": 808, "start": 6005.62, "end": 6009.62, "text": "Und das Ganze mit Pneumatik gelöst, weil die Melkroboter Druckluft benötigen,"}, {"id": 809, "start": 6009.62, "end": 6011.62, "text": "dadurch wäre der Kompressor sowieso schlecht."}, {"id": 810, "start": 6011.62, "end": 6013.62, "text": "Ach, jetzt verstehe ich es."}, {"id": 811, "start": 6013.62, "end": 6015.62, "text": "Es gibt Fressen."}, {"id": 812, "start": 6015.62, "end": 6019.62, "text": "Dadurch, dass es Fressen gibt, strecken die Kühe ihren Hals durch das Gitter."}, {"id": 813, "start": 6019.62, "end": 6023.62, "text": "Dann geht das Gitter zu, sodass man an die Kühe dran kann."}, {"id": 814, "start": 6023.62, "end": 6025.62, "text": "Aha, verstehe."}, {"id": 815, "start": 6025.62, "end": 6027.62, "text": "Behandeln und vermeiden Kriegssturm."}, {"id": 816, "start": 6027.62, "end": 6031.62, "text": "Ja, ganz spannend, dass man sowas einfach mit ein paar Zwischensteckern auf ihm machen kann."}, {"id": 817, "start": 6031.62, "end": 6033.62, "text": "Jetzt habe ich es verstanden."}, {"id": 818, "start": 6033.62, "end": 6039.62, "text": "Es gibt ein paar Landwirte unter euch, die aus dieser Geschichte irgendwie ein bisschen was gewinnen können."}, {"id": 819, "start": 6039.62, "end": 6045.62, "text": "Oder es sind ein paar Landwirte unter euch, die andere Automationen für zukünftige Ausgaben für mich haben."}, {"id": 820, "start": 6045.62, "end": 6047.62, "text": "So, Alvin berichtet von KNX."}, {"id": 821, "start": 6047.62, "end": 6053.62, "text": "Und da habe ich doch im Moment ein sehr gespitztes, offenes Ohr."}, {"id": 822, "start": 6053.62, "end": 6055.62, "text": "Weil das ja eine Option fürs neue Haus ist."}, {"id": 823, "start": 6055.62, "end": 6058.62, "text": "Und wenn ihr dieses Video seht, dann bin ich fast aus dem Urlaub zurück."}, {"id": 824, "start": 6058.62, "end": 6062.62, "text": "Und dann können wir endlich mit Livestreams rund um das neue Haus anfangen."}, {"id": 825, "start": 6062.62, "end": 6064.62, "text": "Vielleicht ist der auch schon geplant."}, {"id": 826, "start": 6064.62, "end": 6066.62, "text": "Und du findest den unten in der Videobeschreibung."}, {"id": 827, "start": 6066.62, "end": 6068.62, "text": "Aber jetzt schauen wir erstmal, was Alvin geschickt hat."}, {"id": 828, "start": 6068.62, "end": 6077.62, "text": "Und zwar habe ich in meinem Haus ein KNX-System verbaut, was aber leider nicht ganz vollständig war, da ich alles selbst geplant und mir alles selbst beigebracht habe."}, {"id": 829, "start": 6077.62, "end": 6078.62, "text": "Nicht schlecht."}, {"id": 830, "start": 6078.62, "end": 6080.62, "text": "Dazu später aber mehr."}, {"id": 831, "start": 6080.62, "end": 6090.62, "text": "Um die Automationen zu realisieren, habe ich mich für Apple HomeKit entschieden und habe mir dieses kleine Gerät hier gekauft, das mein KNX-System HomeKit-fähig macht."}, {"id": 832, "start": 6090.62, "end": 6094.62, "text": "Also ehrlich gesagt, ich mag HomeKit nicht sonderlich."}, {"id": 833, "start": 6094.62, "end": 6099.62, "text": "Interaktion mit Apple-Geräten ist natürlich nice."}, {"id": 834, "start": 6099.62, "end": 6105.62, "text": "Wenn man das unbedingt dort dann beispielsweise im Widget haben will oder so."}, {"id": 835, "start": 6105.62, "end": 6108.62, "text": "Aber sonst kommt man auch wunderbar ohne HomeKit aus."}, {"id": 836, "start": 6108.62, "end": 6117.62, "text": "Zumal Apple wieder ganz komische Geschichten macht."}, {"id": 837, "start": 6117.62, "end": 6127.62, "text": "Du konntest die ganze Zeit ein am Kabel hängendes iPad als HomeKit Hub oder so verwenden."}, {"id": 838, "start": 6127.62, "end": 6131.62, "text": "Also sprich, dass du auch von außen schalten kannst und so, wenn man das will."}, {"id": 839, "start": 6131.62, "end": 6132.62, "text": "Das geht nicht mehr."}, {"id": 840, "start": 6132.62, "end": 6140.62, "text": "Hat Apple jetzt abgeschafft und es geht jetzt nur noch mit einem Apple TV oder einem Apple HomeKit Hub oder sowas."}, {"id": 841, "start": 6140.62, "end": 6147.62, "text": "Also solange ich einen Bogen im HomeKit machen kann und das nicht für irgendwas brauche, mache ich einen großen Bogen drum."}, {"id": 842, "start": 6147.62, "end": 6149.62, "text": "Habe ich auch hier schon angefangen."}, {"id": 843, "start": 6149.62, "end": 6159.62, "text": "Und zwar gehen dann zu einer bestimmten Uhrzeit im ganzen Erdgeschoss die Rolladen runter, die Beleuchtung am Haus sowie der Springbrunnen an."}, {"id": 844, "start": 6159.62, "end": 6163.62, "text": "Außerdem noch diverse Geräte im Haus."}, {"id": 845, "start": 6163.62, "end": 6168.62, "text": "Diese Automation habe ich wie gesagt ohne großen Aufwand den Apple HomeKit erstellt."}, {"id": 846, "start": 6168.62, "end": 6177.62, "text": "Ich will noch eine weitere Automation, dass um 0.30 Uhr dann die ganze Beleuchtung im Haus und am Haus ausgeschaltet wird."}, {"id": 847, "start": 6177.62, "end": 6181.62, "text": "So wie alle Steckdosen und anderen Geräte, die nachts nichts zu tun haben sollten."}, {"id": 848, "start": 6181.62, "end": 6190.62, "text": "Da habe ich mich übrigens auch von dir inspirieren lassen, als du mal darüber berichtet hattest, dass deine Koma-Anlage die ganze Nacht gelaufen ist."}, {"id": 849, "start": 6190.62, "end": 6191.62, "text": "Ich erinnere mich."}, {"id": 850, "start": 6191.62, "end": 6197.62, "text": "Also grundsätzlich eine Automation zu haben, die irgendwie nachts einmal alles sicherheitshalber anfangen."}, {"id": 851, "start": 6197.62, "end": 6199.62, "text": "Er hört sich voll motiviert an, ja das stimmt schon."}, {"id": 852, "start": 6199.62, "end": 6204.62, "text": "In Zeiten, wo wir noch ein bisschen genauer auf Energieverbräuche gucken, schon ganz wertvoll sein."}, {"id": 853, "start": 6204.62, "end": 6206.62, "text": "Ja und um nochmal auf den Anfang zu sprechen zu kommen."}, {"id": 854, "start": 6206.62, "end": 6212.62, "text": "Er hört sich mit seinem KNX-System so ein bisschen gelangweilt an."}, {"id": 855, "start": 6212.62, "end": 6217.62, "text": "Und so fehlen mir ja hier im System auch viele Komponenten, die ein Haus erst wirklich smart machen."}, {"id": 856, "start": 6217.62, "end": 6225.62, "text": "Jetzt wollen wir mal sehen, was ihm fehlt, weil das ist ja der spannende Teil, die Reue eines Hobby-KNX-Implementeurs."}, {"id": 857, "start": 6225.62, "end": 6230.62, "text": "Wie zum Beispiel Tür- oder Fensterkontakte, eine Wetterstation, einen Zeitserver und so weiter."}, {"id": 858, "start": 6230.62, "end": 6232.62, "text": "Wetterstation habe ich ja mittlerweile."}, {"id": 859, "start": 6232.62, "end": 6239.62, "text": "Haben wir ja sogar im Streamer ein bisschen was gebastelt für Wetterstation habe ich und muss sagen, ich bin echt zufrieden damit."}, {"id": 860, "start": 6239.62, "end": 6247.62, "text": "Weil jetzt zum ersten Mal habe ich wirklich ordentliche Außentemperatur, wo ich auch weiß, das stimmt halbwegs."}, {"id": 861, "start": 6247.62, "end": 6254.62, "text": "Also sowohl Außentemperatur als eben auch Windgeschwindigkeit und ob es geregnet hat in letzter Zeit."}, {"id": 862, "start": 6254.62, "end": 6257.62, "text": "So diese drei Sachen, das ist eigentlich das, was mich hauptsächlich interessiert."}, {"id": 863, "start": 6257.62, "end": 6263.62, "text": "Hat es geregnet so die letzten 1-2 Stunden? Ist viel Wind bzw. welche Temperatur?"}, {"id": 864, "start": 6263.62, "end": 6266.62, "text": "Der Rest interessiert mich jetzt nicht so sehr, was die Wetterstation auch kann."}, {"id": 865, "start": 6266.62, "end": 6268.62, "text": "Aber das finde ich sehr praktisch."}, {"id": 866, "start": 6268.62, "end": 6272.62, "text": "Also es hat sich gelohnt, die China-Chinesen-Wetterstation da hinzustellen."}, {"id": 867, "start": 6272.62, "end": 6274.62, "text": "Seht ihr? Und weil ich ja jetzt..."}, {"id": 868, "start": 6274.62, "end": 6277.62, "text": "Zeitserver? Ich wusste nicht mal, dass das eine Sache ist."}, {"id": 869, "start": 6277.62, "end": 6280.62, "text": "Und warum nicht, dass ich die vielleicht vermissen könnte?"}, {"id": 870, "start": 6280.62, "end": 6286.62, "text": "Diese Schnittstelle mit HomeKit habe, kann ich mir diese Geräte nun aufnehmen."}, {"id": 871, "start": 6286.62, "end": 6290.62, "text": "Ohne NTP-Lokal, wie sollen da Geräte denn die richtige Zeit haben? Dauerhaft."}, {"id": 872, "start": 6290.62, "end": 6294.62, "text": "...nachrüsten, ohne noch Kabel verlegen zu müssen."}, {"id": 873, "start": 6294.62, "end": 6297.62, "text": "Vielen Dank für den Input, Alwin. Also mich hat es auf jeden Fall interessiert."}, {"id": 874, "start": 6297.62, "end": 6301.62, "text": "Ich hoffe, einige von euch auch. Und jetzt schauen wir mal weiter."}, {"id": 875, "start": 6301.62, "end": 6304.62, "text": "Tobias hatte irgendwas mit Rudern geschickt."}, {"id": 876, "start": 6304.62, "end": 6309.62, "text": "Für alle Sportler unter euch sind, das heißt, wenn ihr ein Sportgerät habt oder eine Ecke,"}, {"id": 877, "start": 6309.62, "end": 6311.62, "text": "wo ihr Sport betreibt..."}, {"id": 878, "start": 6311.62, "end": 6316.62, "text": "Was ist das da hinten? Ist das ein Reiskocher oder Popcorn-Maschine?"}, {"id": 879, "start": 6316.62, "end": 6318.62, "text": "Einmal, wenn es dunkel ist, dass es dann halt das Licht angeht."}, {"id": 880, "start": 6318.62, "end": 6321.62, "text": "Und zum anderen, wenn ein bisschen coole Musik läuft."}, {"id": 881, "start": 6321.62, "end": 6324.62, "text": "Und das habe ich relativ einfach hier mit meinem Rudergerät gemacht."}, {"id": 882, "start": 6324.62, "end": 6326.62, "text": "Kann man aber auch mit sämtlichen anderen Geräten machen."}, {"id": 883, "start": 6326.62, "end": 6328.62, "text": "Ein Widerstand fürs Rudern, okay."}, {"id": 884, "start": 6328.62, "end": 6333.62, "text": "Man könnte sich vielleicht schon denken, ich habe hier einen Motion-Sensor drinnen oder drunter."}, {"id": 885, "start": 6333.62, "end": 6335.62, "text": "Ich kann das mal zeigen."}, {"id": 886, "start": 6335.62, "end": 6339.62, "text": "Seht ihr hier, unter dem Sitz."}, {"id": 887, "start": 6339.62, "end": 6343.62, "text": "Und wenn man anfängt zu rudern, bewegt man sich ja."}, {"id": 888, "start": 6343.62, "end": 6345.62, "text": "Und dadurch wird eine Bewegung erkannt."}, {"id": 889, "start": 6345.62, "end": 6347.62, "text": "Es ist aber auch so, dass eine gewisse..."}, {"id": 890, "start": 6347.62, "end": 6351.62, "text": "Da geht aber die Batterie relativ schnell leer, weil der Lauf Bewegung erkennt."}, {"id": 891, "start": 6356.62, "end": 6361.62, "text": "Tobias, ich möchte deine Träume nicht zerstören, aber das, was du da machst, ist kein Rudern."}, {"id": 892, "start": 6361.62, "end": 6365.62, "text": "Aber die Batterie geht schnell."}, {"id": 893, "start": 6365.62, "end": 6369.62, "text": "Also wenn man hier, ich glaube, 30 Sekunden anfängt zu rudern."}, {"id": 894, "start": 6369.62, "end": 6371.62, "text": "Das mache ich jetzt mal."}, {"id": 895, "start": 6371.62, "end": 6374.62, "text": "Im Moment läuft auch Radio im Hintergrund."}, {"id": 896, "start": 6374.62, "end": 6376.62, "text": "Dann merkt er sich das, dass vorher Radio lief."}, {"id": 897, "start": 6376.62, "end": 6378.62, "text": "So ist das Licht angegangen hier oben."}, {"id": 898, "start": 6378.62, "end": 6381.62, "text": "Und die Musik."}, {"id": 899, "start": 6381.62, "end": 6383.62, "text": "Boah!"}, {"id": 900, "start": 6383.62, "end": 6385.62, "text": "Toss!"}, {"id": 901, "start": 6385.62, "end": 6387.62, "text": "Toss!"}, {"id": 902, "start": 6387.62, "end": 6389.62, "text": "Ich nehme euch das mal kurz weg."}, {"id": 903, "start": 6389.62, "end": 6391.62, "text": "Toss, ich wollte es gerade sagen."}, {"id": 904, "start": 6391.62, "end": 6393.62, "text": "Wenn ich aufhör zu rudern..."}, {"id": 905, "start": 6393.62, "end": 6395.62, "text": "Toss, Toss!"}, {"id": 906, "start": 6395.62, "end": 6397.62, "text": "Man hat es davon abgesehen."}, {"id": 907, "start": 6397.62, "end": 6399.62, "text": "Ausschalten geht auf jeden Fall schön."}, {"id": 908, "start": 6399.62, "end": 6401.62, "text": "Und die Musik ist auch wieder..."}, {"id": 909, "start": 6401.62, "end": 6405.62, "text": "Aber das Ding wird total schnell die Batterie verlieren, weil der permanent Motion meldet."}, {"id": 910, "start": 6405.62, "end": 6409.62, "text": "Da ist es wahrscheinlich in 2-3 Monaten leer."}, {"id": 911, "start": 6409.62, "end": 6411.62, "text": "Jetzt läuft das Radio schon wieder."}, {"id": 912, "start": 6411.62, "end": 6414.62, "text": "Das heißt, der stellt den ursprünglichen Zustand wieder her."}, {"id": 913, "start": 6414.62, "end": 6416.62, "text": "Auch ganz nett."}, {"id": 914, "start": 6416.62, "end": 6423.62, "text": "Allerdings sind natürlich die ersten 30 Sekunden, die du im Winter im Zweifel, im Dunkeln und ohne Musik ruderst, etwas trostlos."}, {"id": 915, "start": 6423.62, "end": 6428.62, "text": "Aber das kann ja auch ein Ansporn für den Sport sein."}, {"id": 916, "start": 6428.62, "end": 6436.62, "text": "Eigentlich wäre es besser, die Sicherheitsphase irgendwie an die Anzahl der Ruderbewegungen zu binden."}, {"id": 917, "start": 6436.62, "end": 6439.62, "text": "Wenn ich jetzt einfach schnell durchziehe, dann kriege ich keine Ahnung."}, {"id": 918, "start": 6439.62, "end": 6441.62, "text": "Geht schnell Licht an."}, {"id": 919, "start": 6441.62, "end": 6443.62, "text": "Ich habe keine Ahnung von Rudern."}, {"id": 920, "start": 6443.62, "end": 6446.62, "text": "Willis Video fängt offenbar mit mir an."}, {"id": 921, "start": 6446.62, "end": 6448.62, "text": "Das kann ja kein gutes Zeichen sein."}, {"id": 922, "start": 6448.62, "end": 6451.62, "text": "Dir die Möglichkeit erlaubt, auch Sachen zu steuern."}, {"id": 923, "start": 6451.62, "end": 6453.62, "text": "Die Fenster wirst du jetzt nicht per Knopfdruck zumachen können."}, {"id": 924, "start": 6453.62, "end": 6456.62, "text": "An diesem Punkt muss ich dich gleich einmal unterbrechen."}, {"id": 925, "start": 6456.62, "end": 6457.62, "text": "Anzeige ist raus."}, {"id": 926, "start": 6457.62, "end": 6459.62, "text": "Genau das tut."}, {"id": 927, "start": 6459.62, "end": 6461.62, "text": "Hey Siri."}, {"id": 928, "start": 6461.62, "end": 6463.62, "text": "Was war denn hier alles am Start?"}, {"id": 929, "start": 6463.62, "end": 6465.62, "text": "Die Fenster aus."}, {"id": 930, "start": 6468.62, "end": 6469.62, "text": "Boah, ist das laut."}, {"id": 931, "start": 6469.62, "end": 6472.62, "text": "Die Idee dazu kam hier, da meine Schwester im Zimmer unter mir wohnt."}, {"id": 932, "start": 6472.62, "end": 6474.62, "text": "What the fuck?"}, {"id": 933, "start": 6476.62, "end": 6478.62, "text": "Was ein riesen Ding, man."}, {"id": 934, "start": 6478.62, "end": 6479.62, "text": "Von Balkon raucht."}, {"id": 935, "start": 6479.62, "end": 6481.62, "text": "Dadurch zieht der Rauch immer zu mir ins Zimmer."}, {"id": 936, "start": 6481.62, "end": 6485.62, "text": "Was besonders, wenn man gerade durchlüften will, durchaus störend ist."}, {"id": 937, "start": 6487.62, "end": 6491.62, "text": "Ich weiß nicht, ob ich das als Korrektur für meine Aussage akzeptieren kann."}, {"id": 938, "start": 6491.62, "end": 6494.62, "text": "Also ja, technisch schließen deine Fenster automatisch."}, {"id": 939, "start": 6494.62, "end": 6497.62, "text": "Aber es gibt da so zwei kleine Haken an der Sache."}, {"id": 940, "start": 6497.62, "end": 6499.62, "text": "Vielleicht finden die anderen Zuschauer das."}, {"id": 941, "start": 6499.62, "end": 6501.62, "text": "Das Ding hängt halb im Raum."}, {"id": 942, "start": 6501.62, "end": 6503.62, "text": "Es gibt natürlich viel Platz in den Haken weg."}, {"id": 943, "start": 6503.62, "end": 6505.62, "text": "Wenn man das verdreht, finden sie es auf jeden Fall."}, {"id": 944, "start": 6505.62, "end": 6508.62, "text": "Aber da ich diese Ecken sowieso nur als Abstellfläche nutze,"}, {"id": 945, "start": 6508.62, "end": 6511.62, "text": "sind die Motoren nicht allzu sehr im Weg."}, {"id": 946, "start": 6511.62, "end": 6513.62, "text": "Gesteuert wird das Ganze über ein Relais-Board"}, {"id": 947, "start": 6513.62, "end": 6516.62, "text": "aus einer Steckdosenleiste von Didel Smart Home,"}, {"id": 948, "start": 6516.62, "end": 6519.62, "text": "welcher seit neuestem endlich mit HomeKit kompatibel ist."}, {"id": 949, "start": 6519.62, "end": 6522.62, "text": "Dieses Board habe ich ausgebaut und mit 5 Volt versorgt."}, {"id": 950, "start": 6522.62, "end": 6524.62, "text": "Die zwei Relais auf dem Board"}, {"id": 951, "start": 6524.62, "end": 6527.62, "text": "steuern je ein weiteres Relais pro Fenster an."}, {"id": 952, "start": 6527.62, "end": 6529.62, "text": "Welches den Strom der linearen Motoren um..."}, {"id": 953, "start": 6529.62, "end": 6531.62, "text": "Ist das... Ich hoffe nicht,"}, {"id": 954, "start": 6531.62, "end": 6534.62, "text": "dass hier irgendwie 230 Volt rumläuft, oder?"}, {"id": 955, "start": 6534.62, "end": 6537.62, "text": "Das ist dann vielleicht doch ein bisschen,"}, {"id": 956, "start": 6537.62, "end": 6539.62, "text": "sagen, etwas mutig."}, {"id": 957, "start": 6539.62, "end": 6542.62, "text": "Am Fenstergriff befindet sich ein Schalter,"}, {"id": 958, "start": 6542.62, "end": 6544.62, "text": "der bei geschlossenem Griff den Stromfluss..."}, {"id": 959, "start": 6544.62, "end": 6546.62, "text": "Ist das ein Legu-Stein?"}, {"id": 960, "start": 6546.62, "end": 6548.62, "text": "Ist das ein tragender Legu-Stein?"}, {"id": 961, "start": 6548.62, "end": 6550.62, "text": "... zum Motor stoppt,"}, {"id": 962, "start": 6550.62, "end": 6553.62, "text": "damit dieser das Fenster nicht aus der Verankerung reißen kann."}, {"id": 963, "start": 6553.62, "end": 6556.62, "text": "Der Motor ist aktuell nur mit Heißkleber am Fenster befestigt,"}, {"id": 964, "start": 6556.62, "end": 6559.62, "text": "da sich das Ganze noch in der Testphase befindet."}, {"id": 965, "start": 6559.62, "end": 6562.62, "text": "Dadurch ist nicht mehr der Fensterrahmen der Schwachpunkt,"}, {"id": 966, "start": 6562.62, "end": 6565.62, "text": "sondern der Kleber, was vor Beschädigungen schützt,"}, {"id": 967, "start": 6565.62, "end": 6567.62, "text": "falls das Fenster einmal klemmen sollte."}, {"id": 968, "start": 6567.62, "end": 6569.62, "text": "Hey, Siri, schalte Fenster ein."}, {"id": 969, "start": 6569.62, "end": 6571.62, "text": "Schalte Fenster ein."}, {"id": 970, "start": 6571.62, "end": 6573.62, "text": "Boah, ist das laut auch."}, {"id": 971, "start": 6573.62, "end": 6577.62, "text": "Natürlich lässt sich das Ganze auch wieder automatisch öffnen."}, {"id": 972, "start": 6577.62, "end": 6581.62, "text": "Also, das ist eine coole Sache, aber ganz im Ernst, ich..."}, {"id": 973, "start": 6581.62, "end": 6583.62, "text": "Also, ich hätte das nicht gebaut,"}, {"id": 974, "start": 6583.62, "end": 6587.62, "text": "wenn mir da nichts bisschen Schöneres eingefallen wäre."}, {"id": 975, "start": 6587.62, "end": 6591.62, "text": "... in- und außen Temperatur- und Feuchtigkeitssensoren verbauen,"}, {"id": 976, "start": 6591.62, "end": 6594.62, "text": "um ein automatisiertes Lüften zu ermöglichen,"}, {"id": 977, "start": 6594.62, "end": 6596.62, "text": "wenn beispielsweise nach einem warmen Tag..."}, {"id": 978, "start": 6596.62, "end": 6599.62, "text": "Was hat denn da oben an der Decke und so alles hängen?"}, {"id": 979, "start": 6599.62, "end": 6601.62, "text": "Zudem arbeite ich gerade noch an einer Möglichkeit,"}, {"id": 980, "start": 6601.62, "end": 6603.62, "text": "die Rollos zu automatisieren,"}, {"id": 981, "start": 6603.62, "end": 6605.62, "text": "was allerdings noch etwas Software braucht,"}, {"id": 982, "start": 6605.62, "end": 6607.62, "text": "damit das Fenster nicht geöffnet werden kann,"}, {"id": 983, "start": 6607.62, "end": 6609.62, "text": "solange die Rollos unten sind."}, {"id": 984, "start": 6609.62, "end": 6613.62, "text": "Okay. Also, ich finde auf jeden Fall gut, dass du etwas gebaut hast,"}, {"id": 985, "start": 6613.62, "end": 6615.62, "text": "was für dich funktioniert."}, {"id": 986, "start": 6615.62, "end": 6617.62, "text": "Das ist ja irgendwie die Hauptsache an der ganzen Geschichte."}, {"id": 987, "start": 6617.62, "end": 6619.62, "text": "Ich weiß jetzt nicht, wie Maske kompatibel..."}, {"id": 988, "start": 6619.62, "end": 6621.62, "text": "Also, cooles Bastelding, aber..."}, {"id": 989, "start": 6621.62, "end": 6624.62, "text": "Also, ich hätte... weiß nicht."}, {"id": 990, "start": 6624.62, "end": 6626.62, "text": "Ich lege jetzt ja nicht so wahnsinnig viel Wert darauf,"}, {"id": 991, "start": 6626.62, "end": 6630.62, "text": "dass das alles komplett unsichtbar ist und alles super gestylt ist,"}, {"id": 992, "start": 6630.62, "end": 6632.62, "text": "aber das wäre mir auch zu hart gewesen."}, {"id": 993, "start": 6632.62, "end": 6634.62, "text": "Eine Lösung ist, weil die meisten Leute, die ich kenne,"}, {"id": 994, "start": 6634.62, "end": 6636.62, "text": "so ein bisschen an ihrem Wohnraum hängen."}, {"id": 995, "start": 6636.62, "end": 6638.62, "text": "Aber hey, was auch immer für dich funktioniert,"}, {"id": 996, "start": 6638.62, "end": 6640.62, "text": "ist für dich das Richtige."}, {"id": 997, "start": 6640.62, "end": 6644.62, "text": "Leon hat einen Ikea-Icon-Generator gebaut."}, {"id": 998, "start": 6644.62, "end": 6646.62, "text": "Schauen wir mal rein."}, {"id": 999, "start": 6658.62, "end": 6660.62, "text": "Und dann? Und wozu?"}, {"id": 1000, "start": 6660.62, "end": 6666.62, "text": "Aber warum? Warum braucht man das?"}, {"id": 1001, "start": 6678.62, "end": 6680.62, "text": "Ja."}, {"id": 1002, "start": 6682.62, "end": 6686.62, "text": "Und dann? Ach, zum Draufkleben!"}, {"id": 1003, "start": 6686.62, "end": 6690.62, "text": "Ach so!"}, {"id": 1004, "start": 6694.62, "end": 6696.62, "text": "Na ja, gut."}, {"id": 1005, "start": 6699.62, "end": 6703.62, "text": "Coolen Leute hätten dafür jetzt irgendwie so ein Laser-Gravur-System."}, {"id": 1006, "start": 6703.62, "end": 6717.62, "text": "Aber sowas habe ich nicht und sowas will ich auch nicht."}, {"id": 1007, "start": 6733.62, "end": 6736.62, "text": "Gut, nice, waren coole Sachen dabei."}, {"id": 1008, "start": 6736.62, "end": 6740.62, "text": "Also ich muss sagen, die Klingel, also generell die Idee,"}, {"id": 1009, "start": 6740.62, "end": 6745.62, "text": "einen Fingerabdrucksensor draußen hin zu machen, finde ich super."}, {"id": 1010, "start": 6745.62, "end": 6749.62, "text": "Gerade für mein Hoftor zum automatisch auf und zu machen."}, {"id": 1011, "start": 6752.62, "end": 6757.62, "text": "Da könnte ich mir tatsächlich vorstellen, dass ich sowas machen werde."}, {"id": 1012, "start": 6757.62, "end": 6763.62, "text": "Ja. Aber erstmal muss ich mein Hoftor fertig, elektronisch auf und zu machen."}, {"id": 1013, "start": 6763.62, "end": 6767.62, "text": "Auf und zu fahrbar machen."}, {"id": 1014, "start": 6768.62, "end": 6772.62, "text": "Steuerung, so ist ja alles fertig, auch mit dem ESP32 drin."}, {"id": 1015, "start": 6772.62, "end": 6784.62, "text": "Aber auf der einen Seite ist halt der Motor noch nicht dran."}, {"id": 1016, "start": 6784.62, "end": 6788.62, "text": "So sieht es aus."}, {"id": 1017, "start": 6792.62, "end": 6796.62, "text": "So, machen wir das mal zu alles."}, {"id": 1018, "start": 6796.62, "end": 6800.62, "text": "Ach ja, was machen eigentlich die Battlefield-Spielerzahlen?"}, {"id": 1019, "start": 6800.62, "end": 6804.62, "text": "Gerade dabei sind, okay, die sind wieder abgekackt, alles klar."}, {"id": 1020, "start": 6804.62, "end": 6808.62, "text": "Was macht New World?"}, {"id": 1021, "start": 6810.62, "end": 6813.62, "text": "Okay, es ist tatsächlich wieder ein bisschen hochgegangen."}, {"id": 1022, "start": 6813.62, "end": 6816.62, "text": "Wahnsinn."}, {"id": 1023, "start": 6822.62, "end": 6824.62, "text": "Okay."}, {"id": 1024, "start": 6824.62, "end": 6827.62, "text": "Gab es bei YouTube ein Redesign? Ja."}, {"id": 1025, "start": 6827.62, "end": 6830.62, "text": "Es ist jetzt alles rund."}, {"id": 1026, "start": 6833.62, "end": 6838.62, "text": "Da haben irgendeinen Ex-Apple-Designer wahrscheinlich mit."}, {"id": 1027, "start": 6853.62, "end": 6855.62, "text": "Da bin ich mal gespannt drauf."}, {"id": 1028, "start": 6855.62, "end": 6859.62, "text": "Ich weiß aber nicht, ob ich eine Playstation nur dafür kaufe."}, {"id": 1029, "start": 6859.62, "end": 6861.62, "text": "Ganz im Ernst."}, {"id": 1030, "start": 6861.62, "end": 6864.62, "text": "Wahrscheinlich warte ich echt, bis es auf PC kommt."}, {"id": 1031, "start": 6864.62, "end": 6869.62, "text": "Oder ich gucke mir mal wirklich wieder ein Let's Play an, was ich eigentlich so gut wie kaum noch mache."}, {"id": 1032, "start": 6871.62, "end": 6873.62, "text": "Hast du schon das neue Video?"}, {"id": 1033, "start": 6875.62, "end": 6877.62, "text": "Was?"}, {"id": 1034, "start": 6878.62, "end": 6880.62, "text": "iPhone Lightning? Nee."}, {"id": 1035, "start": 6880.62, "end": 6883.62, "text": "Jetzt wird es auch zu harte kost."}, {"id": 1036, "start": 6883.62, "end": 6889.62, "text": "Leute, wisst ihr was wirklich sehr unpraktisch gerade ist?"}, {"id": 1037, "start": 6891.62, "end": 6895.62, "text": "Es ist 10 Uhr und ich kriege schon Hunger langsam."}, {"id": 1038, "start": 6895.62, "end": 6898.62, "text": "Normalerweise wäre es 11 Uhr."}, {"id": 1039, "start": 6906.62, "end": 6908.62, "text": "Machst du nichts?"}, {"id": 1040, "start": 6908.62, "end": 6910.62, "text": "Ist Coding wirklich tot?"}, {"id": 1041, "start": 6910.62, "end": 6912.62, "text": "Okay, komm, wir gucken uns eine Runde Fireships an."}, {"id": 1042, "start": 6912.62, "end": 6914.62, "text": "Fireships über Pog."}, {"id": 1043, "start": 6914.62, "end": 6916.62, "text": "Coding ist tot."}, {"id": 1044, "start": 6916.62, "end": 6918.62, "text": "Ich habe diese Prediktion vorgelesen."}, {"id": 1045, "start": 6918.62, "end": 6920.62, "text": "Aber werden Programme wirklich..."}, {"id": 1046, "start": 6920.62, "end": 6922.62, "text": "Das ist alles alles blödsinnig."}, {"id": 1047, "start": 6922.62, "end": 6924.62, "text": "Das ist nicht tot."}, {"id": 1048, "start": 6924.62, "end": 6928.62, "text": "Es ist in meinem besten Interesse, für die Learn-to-Code-Industrie auf diesem Kanal zu schüllen."}, {"id": 1049, "start": 6928.62, "end": 6932.62, "text": "Jedoch, wenn wir in 2023 schauen, gibt es wirklich schlechte Windblüte auf dem Horizont."}, {"id": 1050, "start": 6932.62, "end": 6936.62, "text": "In heute's Video schauen wir an sechs verdammten Trends, die Programme töten."}, {"id": 1051, "start": 6936.62, "end": 6938.62, "text": "Mit ein paar Schritten Hoffnung am Ende."}, {"id": 1052, "start": 6938.62, "end": 6941.62, "text": "Bevor wir in die Runde kommen, würde ich mich für Fireship Pro bedanken,"}, {"id": 1053, "start": 6941.62, "end": 6944.62, "text": "um zu lernen, wie zu coden, mit einer neuen Plattform, die ich von Anfang an gebaut habe,"}, {"id": 1054, "start": 6944.62, "end": 6947.62, "text": "die eine faszinierende, faszinierende Erfahrung bietet."}, {"id": 1055, "start": 6947.62, "end": 6949.62, "text": "Und das könnte deine letzte Chance sein, den Kanal zu unterstützen,"}, {"id": 1056, "start": 6949.62, "end": 6951.62, "text": "bevor Coding für immer sterben wird."}, {"id": 1057, "start": 6951.62, "end": 6953.62, "text": "Der erste Trend, den ich sprechen möchte, ist Stalled-Technologie."}, {"id": 1058, "start": 6953.62, "end": 6955.62, "text": "Normalerweise mag ich auf diesem Kanal Spaß machen,"}, {"id": 1059, "start": 6955.62, "end": 6957.62, "text": "aber die Dinge sind so schlecht mit dem Metaverse,"}, {"id": 1060, "start": 6957.62, "end": 6958.62, "text": "dass ich ehrlich gesagt..."}, {"id": 1061, "start": 6958.62, "end": 6960.62, "text": "Ist Facebook eigentlich immer noch PHP?"}, {"id": 1062, "start": 6960.62, "end": 6961.62, "text": "Ich fühle mich traurig an diesem Punkt."}, {"id": 1063, "start": 6961.62, "end": 6964.62, "text": "Der ganze Metaverse hat wahrscheinlich weniger Daten,"}, {"id": 1064, "start": 6964.62, "end": 6967.62, "text": "als das verdammte Side-Projekt, das du komplett vergessen hast."}, {"id": 1065, "start": 6970.62, "end": 6971.62, "text": "Was... was passiert?"}, {"id": 1066, "start": 6971.62, "end": 6973.62, "text": "Wie sie einfach nur Geld in das Ding trinken."}, {"id": 1067, "start": 6973.62, "end": 6975.62, "text": "Und so far ist es nur ein beängstigendes Flop."}, {"id": 1068, "start": 6975.62, "end": 6977.62, "text": "Ich würde sehr gerne dieses Video von Mental Outlaw anschauen,"}, {"id": 1069, "start": 6977.62, "end": 6979.62, "text": "um zu lernen, warum es so schlecht klingt."}, {"id": 1070, "start": 6979.62, "end": 6981.62, "text": "Jetzt, obwohl der Metaverse gerade klingt..."}, {"id": 1071, "start": 6981.62, "end": 6984.62, "text": "Ich hab's ja schon mehrfach gesagt, dass sogar die Entwickler,"}, {"id": 1072, "start": 6984.62, "end": 6986.62, "text": "die Metaverse-Entwickler, keinen Bock auf diesen Scheiß haben"}, {"id": 1073, "start": 6986.62, "end": 6988.62, "text": "und sich fragen, warum machen sie das eigentlich?"}, {"id": 1074, "start": 6988.62, "end": 6991.62, "text": "Und im Prinzip sind sie jetzt auf dem gleichen Stand wie ich,"}, {"id": 1075, "start": 6991.62, "end": 6994.62, "text": "sie machen das, weil es Geld gibt."}, {"id": 1076, "start": 6994.62, "end": 7021.62, "text": "Rest geht in der Masche vorbei."}, {"id": 1077, "start": 7025.62, "end": 7027.62, "text": "Ganz davon abgesehen, ich glaube, sieht auch keiner"}, {"id": 1078, "start": 7027.62, "end": 7033.62, "text": "wirklich aktuell einen Vorteil von dem Facebook-Metaverse-Shit."}, {"id": 1079, "start": 7033.62, "end": 7036.62, "text": "Ich meine, die Leute, die irgendwelche spaßige Sachen machen wollen,"}, {"id": 1080, "start": 7036.62, "end": 7040.62, "text": "die machen mit VR, die machen eben VR-Chat oder so was."}, {"id": 1081, "start": 7040.62, "end": 7042.62, "text": "Alle anderen spielen MMOs."}, {"id": 1082, "start": 7047.62, "end": 7048.62, "text": "Ja, aber deswegen..."}, {"id": 1083, "start": 7048.62, "end": 7054.62, "text": "Aber deswegen sterben ja Programmierer nicht aus."}, {"id": 1084, "start": 7078.62, "end": 7080.62, "text": "Und das bedeutet, Start-ups, die Geld verdienen,"}, {"id": 1085, "start": 7080.62, "end": 7082.62, "text": "müssen viel mehr vorsichtig sein, wie sie es spenden."}, {"id": 1086, "start": 7082.62, "end": 7085.62, "text": "Und einer der größten Kosten für einen Start-up ist, Programmierer zu hüllen."}, {"id": 1087, "start": 7085.62, "end": 7087.62, "text": "Als von heute aus, scheint der Arbeitsmarkt"}, {"id": 1088, "start": 7087.62, "end": 7089.62, "text": "noch sehr stark auf einem makro-Level zu sein."}, {"id": 1089, "start": 7089.62, "end": 7091.62, "text": "Jedoch, letztes Wochenende, da gab es Layoffs bei Microsoft,"}, {"id": 1090, "start": 7091.62, "end": 7093.62, "text": "das Preis von Snap kaputt,"}, {"id": 1091, "start": 7093.62, "end": 7095.62, "text": "das bedeutet, dass sie wahrscheinlich mehr Layoffs haben."}, {"id": 1092, "start": 7095.62, "end": 7097.62, "text": "Dann hast du Elon, der 75% von Twitter-Staffen"}, {"id": 1093, "start": 7097.62, "end": 7098.62, "text": "überführt hat."}, {"id": 1094, "start": 7098.62, "end": 7100.62, "text": "Und grundsätzlich haben all die großen Technik-Korporationen"}, {"id": 1095, "start": 7100.62, "end": 7102.62, "text": "eine hohe Anzahl der Start-ups."}, {"id": 1096, "start": 7102.62, "end": 7104.62, "text": "Und das bedeutet, dass die Start-ups,"}, {"id": 1097, "start": 7104.62, "end": 7106.62, "text": "die die Start-ups haben,"}, {"id": 1098, "start": 7106.62, "end": 7108.62, "text": "auch viel mehr Geld verdienen."}, {"id": 1099, "start": 7108.62, "end": 7110.62, "text": "Und grundsätzlich haben all die großen Technik-Korporationen"}, {"id": 1100, "start": 7110.62, "end": 7112.62, "text": "mit hohen Anzahl der Start-ups starten."}, {"id": 1101, "start": 7112.62, "end": 7114.62, "text": "Und das kann nicht verändert werden,"}, {"id": 1102, "start": 7114.62, "end": 7116.62, "text": "wenn die Kosten der Start-ups auch stark sind."}, {"id": 1103, "start": 7116.62, "end": 7118.62, "text": "Und auch die FED hat gesagt, dass Unbearbeitung"}, {"id": 1104, "start": 7118.62, "end": 7120.62, "text": "mehr in die Anzahl geht, und man sollte nie mit der FED kämpfen."}, {"id": 1105, "start": 7120.62, "end": 7127.58, "text": "nach wie vor brauchen ich meine nur weil jetzt facebook und google ein paar leute da rausgeschmissen hat sehe ich da jetzt nicht den"}, {"id": 1106, "start": 7128.7, "end": 7136.92, "text": "den sich irgendwie umkehren zumal du ja international theoretisch sogar gucken kannst mittlerweile dank remote home office möglichkeiten"}, {"id": 1107, "start": 7139.34, "end": 7143.5, "text": "Was ja viele deutsche unternehmen mal wieder nicht checken aber ok dann kriegen sie halt keine leute"}, {"id": 1108, "start": 7143.5, "end": 7151.18, "text": "And speaking of casinos another problematic trend is the crypto winter bitcoin is down 70 percent from its high of last year"}, {"id": 1109, "start": 7151.18, "end": 7155.98, "text": "That's not a good look for an inflation. Wir haben auf der arbeit einen der schwört auf bitcoin"}, {"id": 1110, "start": 7156.14, "end": 7159.54, "text": "Der will mir die ganze zeit erzählen ich muss jetzt in bitcoin"}, {"id": 1111, "start": 7160.3, "end": 7163.18, "text": "investieren weil er weil er weiß dass ende"}, {"id": 1112, "start": 7164.14, "end": 7166.38, "text": "2024 ist es ein neuer er hat es in neuer höchststand"}, {"id": 1113, "start": 7167.14, "end": 7171.9, "text": "Da ich mir auch so warum hast du nicht selbst ein ganzes geld in bitcoin gesteckt wenn du dir da so sicher bist"}, {"id": 1114, "start": 7171.9, "end": 7175.74, "text": "Ich meine kann sein kann aber auch nicht sein"}, {"id": 1115, "start": 7176.9, "end": 7179.34, "text": "vielleicht vielleicht macht versucht er mich auch zu scam"}, {"id": 1116, "start": 7182.06, "end": 7185.58, "text": "Also bitcoin ist werde ich nix nix machen"}, {"id": 1117, "start": 7185.82, "end": 7190.66, "text": "disasters that nobody could have ever possibly seen coming in a million years like the collapse of luna"}, {"id": 1118, "start": 7190.86, "end": 7195.98, "text": "Celsius and voyager about a year ago web 3 or the decentralized web was trending into the stratosphere"}, {"id": 1119, "start": 7195.98, "end": 7202.3, "text": "Teenagers were making millions of dollars for monkeys, and it looked like web 3 was going to make everything else obsolete by this time"}, {"id": 1120, "start": 7202.3, "end": 7206.5, "text": "This year, but unfortunately that didn't happen and now you don't really hear about web 3 anymore"}, {"id": 1121, "start": 7206.5, "end": 7212.34, "text": "Whether you like crypto or not its decline in popularity for the time being is my nft. Ja auch absoluter bullshit war"}, {"id": 1122, "start": 7212.86, "end": 7217.94, "text": "Not a great sign for programming in general in der form wie es da gemacht wurde"}, {"id": 1123, "start": 7219.22, "end": 7225.3, "text": "These smart contracts require smart programmers, but if smart people aren't using them, then we've got a problem here in my opinion"}, {"id": 1124, "start": 7225.3, "end": 7227.7, "text": "I think web 3 is in the trough of disillusionment"}, {"id": 1125, "start": 7227.7, "end": 7234.22, "text": "But we'll continue to improve and grow in the future an even bigger threat to the lives of programmers is mo code no code and low code"}, {"id": 1126, "start": 7238.54, "end": 7241.18, "text": "Das wird auch so ein ding das ist wie sie schon seit"}, {"id": 1127, "start": 7241.62, "end": 7246.74, "text": "Jahrzehnten erzählen dass jetzt irgendwelche manager und personaler angeblich anfangen ihre eigene anwendung zu programmieren"}, {"id": 1128, "start": 7246.74, "end": 7250.34, "text": "Nope, auch auch mit no und low und sonst was code nicht"}, {"id": 1129, "start": 7250.34, "end": 7255.46, "text": "So programming has kind of evolved into a blue collar profession"}, {"id": 1130, "start": 7255.46, "end": 7260.66, "text": "It's like being a janitor, but with less exercise luckily as of today. It still pays extremely well"}, {"id": 1131, "start": 7260.66, "end": 7267.46, "text": "That's why boot camps like bloom Institute of Technology formerly lambda school can offer a job guarantee of $50,000 a year"}, {"id": 1132, "start": 7267.46, "end": 7271.74, "text": "That's nearly $5,000 more than you would make at McDonald's working for $22 an hour"}, {"id": 1133, "start": 7271.78, "end": 7278.74, "text": "Although they also offer a free McBus pass the reality though is that technology is now replacing many of the lines of code that used to be"}, {"id": 1134, "start": 7278.74, "end": 7280.78, "text": "Produced by humans typing into a keyboard"}, {"id": 1135, "start": 7280.78, "end": 7286.7, "text": "There are tons and tons of tools now that make it possible for non engineers to create basic applications web"}, {"id": 1136, "start": 7287.26, "end": 7289.26, "text": "basic basic vielleicht"}, {"id": 1137, "start": 7289.94, "end": 7295.42, "text": "Aber die ganze logik dahinter ganz das kannst du vergessen ist wirst du brauchst programmierer so"}, {"id": 1138, "start": 7295.66, "end": 7302.54, "text": "Sehr wie noch nie zuvor und das wird sich die nächsten jahre nicht ändern eher noch verschlechtert sites and even back-end utilities and databases"}, {"id": 1139, "start": 7302.54, "end": 7308.66, "text": "databases on top of that engineers are now writing code with tools like github co-pilot which move us closer and closer to"}, {"id": 1140, "start": 7308.98, "end": 7312.5, "text": "Obsolescence there are no good people out there foaming at the mouth"}, {"id": 1141, "start": 7312.5, "end": 7316.54, "text": "Aber irgendeiner sollte es zumindest noch verstehen was github co-pilot da ausspuckt"}, {"id": 1142, "start": 7316.54, "end": 7320.42, "text": "Yeah, I've entirely automating your job with AI the technology is not there yet"}, {"id": 1143, "start": 7320.42, "end": 7322.62, "text": "But just look at how far it's come in the last year"}, {"id": 1144, "start": 7322.62, "end": 7327.42, "text": "We now have things like stable diffusion and dolly and voice cloning that's indistinguishable from the real thing"}, {"id": 1145, "start": 7327.42, "end": 7333.86, "text": "It's only a matter of time and when that day comes, it's over. We are screwed"}, {"id": 1146, "start": 7334.78, "end": 7340.54, "text": "Next up we need to talk about social media consolidation a trend that's been going on for many years now tech"}, {"id": 1147, "start": 7340.54, "end": 7344.94, "text": "Lead made a video about this last week and you can always trust him to tell you the things that you don't want to hear"}, {"id": 1148, "start": 7344.94, "end": 7351.7, "text": "And that you think the ability to code is like maddest du als einziger it angestellte ein fünfjahresprojekt umsetzen wollen"}, {"id": 1149, "start": 7351.7, "end": 7355.82, "text": "Nö, es not we're not wizards nowadays"}, {"id": 1150, "start": 7355.82, "end": 7363.18, "text": "The vast majority of content creation has been absorbed by platforms like tick-tock twitter and youtube that use the follower model for social media"}, {"id": 1151, "start": 7363.18, "end": 7369.98, "text": "Why is that well it incentivizes creators with money and internet fame at a time haben sie haben sie ja gar nicht das war ja"}, {"id": 1152, "start": 7370.42, "end": 7374.38, "text": "Das war ja eingepackt in klasse die haben das klasse davor folgeschmiert"}, {"id": 1153, "start": 7374.62, "end": 7380.22, "text": "Ja, aber die idee also allein schon auf die idee zu kommen so was zu machen finde ich bescheuert aber es ist ja dem gemälde"}, {"id": 1154, "start": 7380.22, "end": 7382.02, "text": "Glücklicherweise nichts passiert"}, {"id": 1155, "start": 7382.02, "end": 7388.22, "text": "Common Persons attention span is lower than ever like more than 50% of Americans have not read a book in the last year"}, {"id": 1156, "start": 7388.22, "end": 7394.9, "text": "This is a problem for developers because people are no longer downloading apps from the app store every day or randomly surfing the internet to find new"}, {"id": 1157, "start": 7394.9, "end": 7399.58, "text": "Content this makes it extremely difficult to build a new web or mobile app and make a ton of money with it"}, {"id": 1158, "start": 7399.58, "end": 7406.14, "text": "Unless you have a massive marketing budget behind it like when oil first became a thing there were all kinds of prospectors becoming overnight millionaires"}, {"id": 1159, "start": 7406.14, "end": 7412.18, "text": "But nowadays you have a small handful of companies that control the entire world it's a bad trend for independent developers"}, {"id": 1160, "start": 7412.18, "end": 7418.22, "text": "Because it's much harder to take your side hustle to the moon now the final trend which has also been going on for years is the cloud"}, {"id": 1161, "start": 7418.22, "end": 7424.78, "text": "You have big cloud platforms like AWS that have been aggressively simplifying basically all areas of development and until recently"}, {"id": 1162, "start": 7424.78, "end": 7428.38, "text": "That's mainly meant fewer jobs for system administrators and IT guys"}, {"id": 1163, "start": 7428.46, "end": 7433.74, "text": "But now there are many tools coming out that eliminate both front-end and back-end jobs like honeycode"}, {"id": 1164, "start": 7433.74, "end": 7439.94, "text": "Which is a no-code tool for building web and mobile apps or in also das sehe ich aktuell auch noch nicht"}, {"id": 1165, "start": 7441.5, "end": 7443.5, "text": "Weil letztendlich klar"}, {"id": 1166, "start": 7444.34, "end": 7445.74, "text": "Irgendwo"}, {"id": 1167, "start": 7445.74, "end": 7451.02, "text": "Fallen an manchen stellen jobs weg und ob die dann an in der menge an anderen stellen entstehen ok"}, {"id": 1168, "start": 7451.14, "end": 7457.14, "text": "Deswegen sage ich ja auch man muss ein bisschen ahnung haben den 0815 windows clicker in der 75 ausführung brauchst du auch nicht"}, {"id": 1169, "start": 7458.3, "end": 7461.9, "text": "Aber leute diesen graben bedienen können brauchst du ganz im ernst"}, {"id": 1170, "start": 7461.9, "end": 7465.94, "text": "Durch zu blicken bei aws azure und google cloud ist schwieriger"}, {"id": 1171, "start": 7466.46, "end": 7471.06, "text": "Als einen zu finden der die ein paar windowsserver und ein paar linuxkisten administrieren kann"}, {"id": 1172, "start": 7472.34, "end": 7475.18, "text": "Amplify an entire back-end as a service in addition"}, {"id": 1173, "start": 7475.18, "end": 7482.38, "text": "You've got a bunch of new startups coming out with next-gen serverless databases that further simplify the role of a back-end developer in other words as new"}, {"id": 1174, "start": 7482.38, "end": 7487.82, "text": "Cloud-based tools make development easier. There's just less code to write now this video may sound very pessimistic"}, {"id": 1175, "start": 7487.82, "end": 7493.42, "text": "But I think there is hope you could always get into farming. That's what bill gates did after he got sick of coding and c-sharp"}, {"id": 1176, "start": 7493.42, "end": 7499.42, "text": "And now he's the biggest farmland owner in the united states another ray of hope for millennials is that gen z seems to be pretty tech"}, {"id": 1177, "start": 7499.42, "end": 7505.54, "text": "Alliterate primarily because that generation is growing up at a time when social media and technology is already very consolidated"}, {"id": 1178, "start": 7505.54, "end": 7510.22, "text": "Like I bet many kids these days don't even know how urls work or that you can even edit them in the browser"}, {"id": 1179, "start": 7510.22, "end": 7513.02, "text": "Das ist ohne scheiß das wundert mich auch immer"}, {"id": 1180, "start": 7513.02, "end": 7518.38, "text": "Wie wie planlos heutzutage leute sind die eigentlich mit technik aufgewachsen sind ich dachte eigentlich das problem existiert"}, {"id": 1181, "start": 7518.38, "end": 7544.38, "text": "2020 nicht mehr"}, {"id": 1182, "start": 7544.38, "end": 7546.38, "text": "Ist es heute eigentlich ein must have sich mit cloud-zeug auszukennen"}, {"id": 1183, "start": 7546.38, "end": 7551.06, "text": "Naja, du musst die kommt drauf an ich mein cloud-zeug ist ja sehr weit gefasst"}, {"id": 1184, "start": 7551.66, "end": 7555.38, "text": "Aber du solltest heutzutage zumindest ahnung haben was die ganzen"}, {"id": 1185, "start": 7556.86, "end": 7563.94, "text": "Dinger so grob sind ja also wenn dir einer was erzählt von infrastructure as code solltest du so eine grobe vorstellung was meinte eigentlich"}, {"id": 1186, "start": 7564.34, "end": 7568.26, "text": "Weil was mit terraform oder ansible gemacht haben ist sicherlich auch nicht verkehrt"}, {"id": 1187, "start": 7569.18, "end": 7573.1, "text": "sich in einer cloud plattform ganz gut auskennen und wissen wo da was ist"}, {"id": 1188, "start": 7573.1, "end": 7577.7, "text": "Ist vielleicht mal irgendwie so ein serverless function erstellt haben ja ist schon net verkehrt"}, {"id": 1189, "start": 7579.14, "end": 7580.1, "text": "framework"}, {"id": 1190, "start": 7580.1, "end": 7588.44, "text": "red"}, {"id": 1191, "start": 7592.34, "end": 7600.02, "text": "Eines der probleme an diesen ganzen locode outdoor geschichten ist wenn die anwendung komplex"}, {"id": 1192, "start": 7600.02, "end": 7617.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1193, "start": 7617.38, "end": 7637.38, "text": "Du kannst auch 100 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1194, "start": 7637.38, "end": 7645.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1195, "start": 7645.38, "end": 7665.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1196, "start": 7665.38, "end": 7689.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1197, "start": 7689.38, "end": 7709.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1198, "start": 7709.38, "end": 7737.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1199, "start": 7737.38, "end": 7757.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1200, "start": 7757.38, "end": 7785.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1201, "start": 7785.38, "end": 7805.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1202, "start": 7805.38, "end": 7825.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1203, "start": 7825.38, "end": 7845.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1204, "start": 7845.38, "end": 7871.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1205, "start": 7875.38, "end": 7901.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1206, "start": 7901.38, "end": 7917.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1207, "start": 7917.38, "end": 7945.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1208, "start": 7945.38, "end": 7965.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1209, "start": 7965.38, "end": 7993.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1210, "start": 7993.38, "end": 8013.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1211, "start": 8013.38, "end": 8033.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1212, "start": 8033.38, "end": 8055.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1213, "start": 8055.38, "end": 8075.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1214, "start": 8075.38, "end": 8095.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1215, "start": 8095.38, "end": 8123.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1216, "start": 8123.38, "end": 8151.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1217, "start": 8151.38, "end": 8173.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1218, "start": 8173.38, "end": 8201.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1219, "start": 8201.38, "end": 8221.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1220, "start": 8221.38, "end": 8241.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1221, "start": 8241.38, "end": 8261.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1222, "start": 8261.38, "end": 8287.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1223, "start": 8287.38, "end": 8313.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1224, "start": 8313.38, "end": 8341.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1225, "start": 8341.38, "end": 8361.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1226, "start": 8361.38, "end": 8381.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1227, "start": 8381.38, "end": 8407.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1228, "start": 8407.38, "end": 8435.38, "text": "Du kannst 50 Seiten Blueprints machen oder 20 Zeilen Skript, so nach dem Motto."}, {"id": 1229, "start": 8435.38, "end": 8438.38, "text": "Aber gut, ist ja meistens nicht lange."}, {"id": 1230, "start": 8465.38, "end": 8494.38, "text": "Aber gut, ist ja meistens nicht lange."}, {"id": 1231, "start": 8495.38, "end": 8500.58, "text": "Du hast dann zumindest, meistens ja keine Nudd-Geschichten mehr dazwischen, das heißt du brauchst auf jeden Fall"}, {"id": 1232, "start": 8500.58, "end": 8502.38, "text": "Du hast dann zumindest meistens, meistens ja keine Nudd-Geschichten mehr dazwischen, das heißt du brauchst auf jeden Fall"}, {"id": 1233, "start": 8502.38, "end": 8513.38, "text": "irgendwelche sinnvoll-default eingestellten Firewall-Regeln auf deinem Router, dass eben von außen nichts standardmäßig durchgeleitet wird, was du nie angefragt hast."}, {"id": 1234, "start": 8513.38, "end": 8520.44, "text": "... already be hacked, and if not, then maybe your ISP knows about the issue and blocks these attempts on their end."}, {"id": 1235, "start": 8520.44, "end": 8525.88, "text": "So security issues are not really a concern and if it is, you need to fix the root issue."}, {"id": 1236, "start": 8525.88, "end": 8531.18, "text": "Security through obscurity, aka trying to hide your IP doesn't fix it."}, {"id": 1237, "start": 8531.18, "end": 8536.78, "text": "Maybe you don't worry about security issues, but about denial of service attacks."}, {"id": 1238, "start": 8536.78, "end": 8543.18, "text": "It's easy to overwhelm a basic home router, but as I said, in lots of cases the IP doesn't even point"}, {"id": 1239, "start": 8543.18, "end": 8551.18, "text": "Ja, bei mir schon. Ich hab ja einen richtig echten Toolstack. Kein Toolstack, leid."}, {"id": 1240, "start": 8551.18, "end": 8557.18, "text": "Ja, das stimmt. Ist aber trotzdem kacke, wenn man streamen will und kann nicht."}, {"id": 1241, "start": 8581.18, "end": 8583.18, "text": "Ja, das stimmt."}, {"id": 1242, "start": 8583.18, "end": 8585.18, "text": "Ja, das stimmt. Und viele VPN-Anbieter sagen sie,"}, {"id": 1243, "start": 8585.18, "end": 8589.18, "text": "in vielen Fällen ist die Home-IP bereits das gleiche erzielt."}, {"id": 1244, "start": 8589.18, "end": 8592.18, "text": "Es ist auch eine öffentliche IP, die viele andere Kunden teilen."}, {"id": 1245, "start": 8592.18, "end": 8595.18, "text": "Also aus dem Sicht der Internet-User, die diese IP sehen,"}, {"id": 1246, "start": 8595.18, "end": 8597.18, "text": "ist man bereits ein wenig verspürt."}, {"id": 1247, "start": 8597.18, "end": 8601.18, "text": "Aber natürlich gibt es ein paar Unterschiede zwischen einer VPN und einer ISP."}, {"id": 1248, "start": 8601.18, "end": 8603.18, "text": "Also gehen wir durch sie."}, {"id": 1249, "start": 8603.18, "end": 8607.18, "text": "Die wahrscheinlich wichtigste Unterschiede ist die legale Jurisdiktion."}, {"id": 1250, "start": 8607.18, "end": 8614.18, "text": "Ja, das stimmt. Und viele VPN-Anbieter sagen sie, speichern keine Logs."}, {"id": 1251, "start": 8614.18, "end": 8620.18, "text": "Allerdings, ist halt die Frage, ob du so einem VPN-Anbieter vertraust, dass das wirklich nicht so ist."}, {"id": 1252, "start": 8620.18, "end": 8624.18, "text": "Und was passiert, wenn man dem wirklich mal das Sondereinsatzkommando vor der Tür steht?"}, {"id": 1253, "start": 8624.18, "end": 8627.18, "text": "Sind die dann nicht auf einmal doch super kooperativ?"}, {"id": 1254, "start": 8627.18, "end": 8634.18, "text": "Also, da ist halt einfach die Aussage da vom VPN-Anbieter."}, {"id": 1255, "start": 8634.18, "end": 8637.18, "text": "Und ob das dann wirklich so ist? Who knows."}, {"id": 1256, "start": 8664.18, "end": 8666.18, "text": "Also, ich hab gelesen, dass..."}, {"id": 1257, "start": 8666.18, "end": 8695.9, "text": "Also ich hab gelesen, dass VPNs in den Iran aktuell"}, {"id": 1258, "start": 8695.9, "end": 8702.38, "text": "voll im Trends sind. Wobei ich mich frage, wie das gehen soll. Die haben ja ziemlich"}, {"id": 1259, "start": 8702.38, "end": 8708.14, "text": "Internetzensurprobleme. Aber hab ich vor ein paar Monaten was drüber gelesen,"}, {"id": 1260, "start": 8708.14, "end": 8726.74, "text": "dass VPN-Anbieter im Iran aktuell wohl gerade recht angesagt werden."}, {"id": 1261, "start": 8738.14, "end": 8757.62, "text": "Das sag ich ja auch schon, ich hab ja sogar ein Video drüber gemacht, wo dann im Endeffekt NordVPN"}, {"id": 1262, "start": 8757.62, "end": 8761.46, "text": "gesagt hat, wenn du jemals ein Sponsoring machen willst mit uns, musst du das Video löschen. Mach"}, {"id": 1263, "start": 8761.46, "end": 8769.86, "text": "ich natürlich nicht. Aber ja, so ist es, hat schon recht. Man bildet sich da viel mehr Schutz ein,"}, {"id": 1264, "start": 8769.86, "end": 8777.7, "text": "als es eigentlich bringt. Aber die Werbung ist halt auch sehr irreführend. Nach dem Motto, es wäre"}, {"id": 1265, "start": 8777.7, "end": 8781.54, "text": "alles supersicher, es wäre alles zusätzlich verschlüsselt, ist ja gar nicht. Es ist der"}, {"id": 1266, "start": 8781.54, "end": 8785.82, "text": "Weg zwischen dir und dem VPN-Anbieter zusätzlich verschlüsselt. Aber wenn du normale Webseiten"}, {"id": 1267, "start": 8785.82, "end": 8793.02, "text": "über HTTPS verwendest, ist es eh egal. Und danach vom Eingang bzw. vom Ausgang des VPNs zum Zielserver"}, {"id": 1268, "start": 8793.02, "end": 8796.58, "text": "ist es, wenn es vorher unverschlüsselt war, nachher auch unverschlüsselt. Also insofern macht"}, {"id": 1269, "start": 8796.58, "end": 8803.9, "text": "eigentlich gar keinen wirklichen Unterschied. Wie gesagt, um geoblocking Sachen zu imgen und so,"}, {"id": 1270, "start": 8803.9, "end": 8808.7, "text": "da VPN haben schon seine Anwendungsgebiete. Aber das, was das angeblich alles Tolles macht,"}, {"id": 1271, "start": 8808.7, "end": 8828.7, "text": "ist zum größten Teil Blödsinn. Also ich vertraue prinzipiell nur dem Twitch-Chat."}, {"id": 1272, "start": 8828.7, "end": 8842.34, "text": "Wie würde man sich selbst dann am besten schützen, wenn nicht mit einem VPN? Die Frage ist ja erstmal,"}, {"id": 1273, "start": 8842.34, "end": 8845.62, "text": "vor was musst du dich schützen? Musst du dich überhaupt schützen? Vor was willst du dich schützen?"}, {"id": 1274, "start": 8845.62, "end": 8852.26, "text": "Was willst du machen? Willst du irgendwelche Straftaten begehen? Tja, da ist wahrscheinlich"}, {"id": 1275, "start": 8852.26, "end": 8857.18, "text": "das Sinnvollste, was du machen kannst, irgendwelche Torbrowser-Geschichten. Aber ansonsten,"}, {"id": 1276, "start": 8857.18, "end": 8868.18, "text": "vor was willst du dich schützen? Also es gibt ja eigentlich so in normaler Weise wenig,"}, {"id": 1277, "start": 8868.18, "end": 8873.86, "text": "wovor man sich schützen müsste und wo man einen VPN vorschützt. Das Einzige, was man mit einem"}, {"id": 1278, "start": 8873.86, "end": 8878.66, "text": "VPN tatsächlich ganz gut machen kann, ist halt geoblocking umgehen. Wobei man das natürlich"}, {"id": 1279, "start": 8878.66, "end": 8881.9, "text": "auch selbst ohne Probleme machen kann. Man kann sich auch irgendwie einen Server mieten,"}, {"id": 1280, "start": 8881.9, "end": 8889.5, "text": "beispielsweise mein YouTube Premium. Das schließe ich ja auch immer über Indian ab und das mache"}, {"id": 1281, "start": 8889.5, "end": 8898.42, "text": "ich über einen SSH Socks-Proxy mit einer VM Digital Ocean in Bangalore, Indien. Da erstelle"}, {"id": 1282, "start": 8898.42, "end": 8904.54, "text": "ich mir alle paar Monate mal eine VM. Mittlerweile habe ich ja einen Dauer-Abo, eine VM und dann per"}, {"id": 1283, "start": 8904.54, "end": 8912.46, "text": "SSH Socks-Proxy verbinden mit einem Browser und dann hat man halt eine indische IP. Und dann"}, {"id": 1284, "start": 8912.46, "end": 8918.06, "text": "kann man eben YouTube Premium über Indien kaufen und mit indischen Ru-Ru-Rupien, glaube ich,"}, {"id": 1285, "start": 8918.06, "end": 8926.14, "text": "bezahlen. Und das kostet dann plus 3 Euro anstatt 12 Euro. Bangalore, genau. Ob man das auch so"}, {"id": 1286, "start": 8926.14, "end": 8939.02, "text": "ausspricht, weiß nicht. Ist das denn erlaubt? Warum nicht? Es geht. Ru-Ru-Rupien. Es gibt ja"}, {"id": 1287, "start": 8939.02, "end": 8952.06, "text": "nichts wirklich, wofür man die schützen muss. Braucht man eine indische Kreditkarte? Nein,"}, {"id": 1288, "start": 8952.06, "end": 8961.26, "text": "braucht man nicht. Man kann über Paypal bezahlen. Oder? Oder Kreditkarte? Ich weiß es gerade gar"}, {"id": 1289, "start": 8961.26, "end": 8967.82, "text": "nicht. Zumindest braucht man ein neues Payment-Profil im Google-Account. Neues Payment-Profil."}, {"id": 1290, "start": 8967.82, "end": 8986.22, "text": "Das musst du auf Indien stellen, dann geht's. Privacy-Issue. Privacy-Issues arise,"}, {"id": 1291, "start": 8986.22, "end": 8992.58, "text": "when you share private information. So what private information does your IP leak? If you use"}, {"id": 1292, "start": 8992.58, "end": 8997.5, "text": "Facebook and Instagram to share private photos, it doesn't matter if you use a VPN or your"}, {"id": 1293, "start": 8997.5, "end": 9003.94, "text": "regular IP, you still share your private photos online. So the actions you do online are much"}, {"id": 1294, "start": 9003.94, "end": 9010.18, "text": "more important than the IP. The only thing the IP leaks is your location, but this is a bit"}, {"id": 1295, "start": 9010.18, "end": 9015.3, "text": "misleading, because what do you mean by location? It doesn't leak your exact GPS coordinates,"}, {"id": 1296, "start": 9015.3, "end": 9020.7, "text": "it might point to the city you live in, but most likely it points to the region where tens of"}, {"id": 1297, "start": 9020.7, "end": 9024.5, "text": "thousands or hundreds of thousands of people live. Also das ist nicht das Problem. Of course some"}, {"id": 1298, "start": 9024.5, "end": 9029.14, "text": "might want to completely hide their general location and don't want anybody to know they live in"}, {"id": 1299, "start": 9029.14, "end": 9035.02, "text": "Berlin, but I don't think this is generally an issue most people have to care about. Think about"}, {"id": 1300, "start": 9035.02, "end": 9040.3, "text": "normal people. They post a single picture on Instagram from hiking near their home and people"}, {"id": 1301, "start": 9040.3, "end": 9045.78, "text": "could figure out their general location. So let's talk about me leaking the IP addresses of players"}, {"id": 1302, "start": 9045.78, "end": 9050.86, "text": "on my Minecraft server. How bad was it? In my opinion some of those IP addresses are dynamic"}, {"id": 1303, "start": 9050.86, "end": 9056.02, "text": "and changed long before I uploaded the video. And some of these IP addresses are shared with"}, {"id": 1304, "start": 9056.02, "end": 9061.18, "text": "hundreds of people anyway. Of course it might leak the rough geographic location of some players,"}, {"id": 1305, "start": 9061.18, "end": 9067.5, "text": "but maybe they don't care or they leaked it in many other ways. For example oh my god here I"}, {"id": 1306, "start": 9067.5, "end": 9074.22, "text": "leaked the famous automated IP address, because I'm so famous he came onto my server. Now we can"}, {"id": 1307, "start": 9074.22, "end": 9084.78, "text": "geolocate him to Seattle. Oh my god. Anzeige ist raus. But besides all of that are you ready"}, {"id": 1308, "start": 9084.78, "end": 9093.18, "text": "for the last argument why me leaking the IP addresses of players on the server is not bad?"}, {"id": 1309, "start": 9093.18, "end": 9099.26, "text": "If one of those players really really cared about hiding their tracks online being super paranoid"}, {"id": 1310, "start": 9099.26, "end": 9105.26, "text": "they must have used them again to access the server anyway. As you can see in my opinion"}, {"id": 1311, "start": 9105.26, "end": 9111.46, "text": "there's no meaningful security risk or meaningful privacy issue about leaking IPs. There are crazy"}, {"id": 1312, "start": 9111.46, "end": 9116.38, "text": "edge cases with very weird threat models. Naja diese Region die angezeigt wird das kommt aus"}, {"id": 1313, "start": 9116.38, "end": 9120.38, "text": "irgendwelchen Datenbanken wo das halt mal jemand zugeordnet hat. Du machst da so ein Reverse Look ab."}, {"id": 1314, "start": 9120.38, "end": 9126.9, "text": "Das muss nicht zwangsläufig immer super akkurat sein. Also bei mir stimmt's ganz gut. Bei mir"}, {"id": 1315, "start": 9126.9, "end": 9129.74, "text": "sagt er meistens irgendwie grobe Region, Hanau, Frankfurt."}, {"id": 1316, "start": 9137.46, "end": 9140.9, "text": "Grünstliche Hardware Bezugsquellen. Naja guckst du bei AliExpress."}, {"id": 1317, "start": 9140.9, "end": 9150.46, "text": "Er hat enttäuscht den Stream abgebrochen."}, {"id": 1318, "start": 9150.46, "end": 9170.06, "text": "Also wenn ich einem truste dann prinzipiell eh nur dem Twitch Chat."}, {"id": 1319, "start": 9170.06, "end": 9180.38, "text": "If your threat model is cannot trust anything I connect to online then don't connect to it. Don't use"}, {"id": 1320, "start": 9180.38, "end": 9186.26, "text": "your home IP whatever you consider your home IP. Okay anyway now many of you watching probably"}, {"id": 1321, "start": 9186.26, "end": 9192.14, "text": "also scream the whole time is he talking about IPv4 or IPv6 and well yeah most of what I mentioned"}, {"id": 1322, "start": 9192.14, "end": 9198.54, "text": "mostly applies to IPv4 due to them running out and many customers will share IP addresses leading"}, {"id": 1323, "start": 9198.54, "end": 9205.26, "text": "to the ISP setups discussed in this video. With IPv6 the game kind of changes. And to be honest I'm"}, {"id": 1324, "start": 9205.26, "end": 9210.5, "text": "not super sure how ISP setups look like with IPv6. The little bit of networking knowledge I have"}, {"id": 1325, "start": 9210.5, "end": 9230.38, "text": "is mostly limited to IPv4, but I guess depending on..."}, {"id": 1326, "start": 9230.38, "end": 9240.94, "text": "und wie du irgendwie treangulation machen willst mit meiner IP daheim das verstehe ich auch nicht so genau. Willst du dir"}, {"id": 1327, "start": 9240.94, "end": 9250.78, "text": "verschiedene... okay naja vielleicht, aber dafür sind die Laufzeiten noch viel zu unpräzise."}, {"id": 1328, "start": 9253.1, "end": 9257.22, "text": "Also du müsstest dir dann theoretisch verschiedene Server in Deutschland mieten wo du den genauen"}, {"id": 1329, "start": 9257.22, "end": 9261.98, "text": "Standort kennst und dann müsstest du mich irgendwie anpingen und dann müsstest du hoffen"}, {"id": 1330, "start": 9261.98, "end": 9268.1, "text": "dass die Route bekannt ist die du nimmst und dass es immer die gleiche ist also dass das wirklich"}, {"id": 1331, "start": 9268.1, "end": 9273.46, "text": "nennenswert was bringt bezweifle ich. Also viel genauer als die grobe Region die du meistens"}, {"id": 1332, "start": 9273.46, "end": 9279.34, "text": "aus so einem Reverse Lookup über so eine Geodatenbank rauskriegst wird das auch nicht... wird das es auch"}, {"id": 1333, "start": 9279.34, "end": 9292.98, "text": "nicht bringen. Zumal was machst du wenn der Router nicht auf ping antwortet. Also ich glaube nicht"}, {"id": 1334, "start": 9292.98, "end": 9302.94, "text": "dass das großartig was bringt. Kommt noch was? Okay das ist der Fall, aber gut er hat komplett"}, {"id": 1335, "start": 9302.94, "end": 9310.5, "text": "recht mit allen was er sagt. Okay Leute ich hab Hunger! Es ist kurz vor 12 theoretisch,"}, {"id": 1336, "start": 9310.5, "end": 9318.06, "text": "ja. Aber ich kann jetzt noch nichts essen. Ich meine es ist 10.35 Uhr. What the fuck?"}, {"id": 1337, "start": 9318.06, "end": 9336.5, "text": "Das hatten wir doch grad schon! Hey there my gorgeous friends on the internet. Das hatten wir auch nicht."}, {"id": 1338, "start": 9336.5, "end": 9344.3, "text": "Wollen wir auch nicht gucken. Oh nee nee nee nee nee nee nee nee. Jetzt haben wir schon geguckt."}, {"id": 1339, "start": 9344.3, "end": 9350.14, "text": "Guck ich jetzt auch keinen bock drauf habe ich jetzt auch keinen bock drauf was haben wir sonst noch"}, {"id": 1340, "start": 9358.02, "end": 9365.22, "text": "bock drauf das video von stacks man 20 minuten zu sowas habe ich jetzt kein bock ich habe hunger"}, {"id": 1341, "start": 9365.22, "end": 9366.46, "text": "ich glaube ich gehe jetzt was essen"}, {"id": 1342, "start": 9366.46, "end": 9372.02, "text": "Gehst du heute wieder spazieren?"}, {"id": 1343, "start": 9372.02, "end": 9373.02, "text": "Ja, wahrscheinlich."}, {"id": 1344, "start": 9373.02, "end": 9374.02, "text": "Heute ist gutes Wetter."}, {"id": 1345, "start": 9374.02, "end": 9379.9, "text": "Normalerweise sonntags nicht, aber heute werde ich meine zwei Stunden Bewegung wahrscheinlich"}, {"id": 1346, "start": 9379.9, "end": 9380.9, "text": "wieder machen."}, {"id": 1347, "start": 9380.9, "end": 9389.1, "text": "Ich glaube, ich esse jetzt doch was, lul."}, {"id": 1348, "start": 9389.1, "end": 9390.1, "text": "Auf geht's."}, {"id": 1349, "start": 9390.1, "end": 9396.38, "text": "Ne, wir kommen jetzt nix mehr, vielleicht, ne, also, ich muss heute."}, {"id": 1350, "start": 9396.38, "end": 9400.9, "text": "Heute ist nix mit Wandern, ich muss heute ein bisschen MW2 spielen und meinen Senf dazugeben."}, {"id": 1351, "start": 9400.9, "end": 9405.9, "text": "Da hat nix anderes übrig."}, {"id": 1352, "start": 9405.9, "end": 9411.3, "text": "Muss jetzt, muss jetzt mal sein, muss ich durch, auch wenn ich gar nicht so wirklich"}, {"id": 1353, "start": 9411.3, "end": 9412.3, "text": "Bock drauf hab."}, {"id": 1354, "start": 9412.3, "end": 9422.22, "text": "Du hast ein totes Pixel auf meinem MacBook, ich weiß nicht, wie da die Garantie aussieht,"}, {"id": 1355, "start": 9422.22, "end": 9423.22, "text": "keine Ahnung."}, {"id": 1356, "start": 9423.22, "end": 9427.46, "text": "Leute, ich geh jetzt was futtern, beziehungsweise quälen mich noch ne Stunde und dann geh ich"}, {"id": 1357, "start": 9427.46, "end": 9428.46, "text": "was futtern."}, {"id": 1358, "start": 9428.46, "end": 9454.34, "text": "Bis denn, Leute, macht's gut, CU."}]}