{"text": "Ich verstehe das direkte Login hatte von 20 Jahren, wie es jetzt anscheinend nicht mehr hiebt, aber ernsthaft. Map Selection, please, bitte. Map Selection. Breakthrough mit 64 Mann ist halt nicht spielbar. Conquest mit 128 Mann ist nach wie vor nicht mein Favorit. Aber ich würde gerne meine Lieblingsspielmodel spielen. Und zwar Rush und zwar auch der neuen Map. Wo ist das Problem? Warum ist das so ein Hexenwerk? Eine Map Selection hat, dass die Spieler eben ihre Lieblingsspielmodel auf der neuen Map... So, heute geben wir uns tatsächlich nochmal eine Runde Battlefield 2024. Sag mal, höre ich mich selbst im Hintergrund? ...portal aber zurückkehren... ...aber warum? Einfach warum? Ich verstehe es nicht. Soll ich das für euch... Warte mal. Dice, meldet ernsthaft. Kein Spaß bei euch. Dice, meld euch mal. Ah! Ich habe ein paar mal mein eigenes Video laufen im Hintergrund. Ich denke mir die ganze Zeit schon, Max, warum hörst du dich selbst im Hintergrund? Was schmerzen? Ich habe mein eigenes Video laufen, ja. Gut, ich mache das immer an, wenn es mir auf YouTube empfohlen wird, weil View-Time. Aber... Ja, da muss ich mich nicht wundern. Wir gucken uns das jetzt hier zur Einstimmung. Zur Einstimmung, Leute, bis das Stream richtig losgeht. Gucken wir uns zusammen mal ein Video von heute an. Das ist die 2042 Season 3 raus. Und ich dachte mir so, es ist zwar heute kein Video geplant, aber ich setze mich jetzt mal ganz spontan hin. Und nehme dazu ein paar Takte auf, was es auf mich so einen Eindruck gemacht hat, wie ich das Ganze so finde. Und ich fasse mich auch kurz, weil ich will mich... Wir gucken uns jetzt mal ein Video an. Live-Reaction. ...ich immer wiederholen, wir wissen alle, das Game hat immer noch mit vielen Problemen zu kämpfen. Das ist, glaube ich, allen klar, da muss ich nicht... Wer es genau wissen will, was mir an dem Spiel nicht gefällt, kann sich einfach meine letzten Videos... ...meine letzten, letzten Videos zu Battlefield 2042 anschauen. Und wenn es euch gefällt, dann wisst ihr, ich freue mich unglaublich über jedes Abo und jedes Kommentar. Ihr wisst, wie wichtig das ist für Content-Creator, auch was den YouTube-Algorithmus angeht. Also gebt euch einen Ruck, drückt den Abo-Button, schreibt einen Kommentar, wenn euch das Ganze gefällt. View-Time, View-Time. Aber was heißt boosten? Ich will nicht, dass es zu negativ kommt, weil ich denke, dass DICE auch mit diesen drei wieder auf einem ganz guten Weg ist. Aber eine Sache... Ja, wir gucken uns so als Einstimmung jetzt fünf Minuten nochmal ein Video an, bis das Stream richtig angelaufen ist. Da wisst ihr auch alle, was ich bis jetzt von der aktuellen Season denke. Muss ich mir echt mal von der Seele reden. Und zwar... DICE, wollt ihr mich eigentlich veräppeln? Ich verstehe, dass ihr Technologien hattet vor 20 Jahren, die es jetzt anscheinend nicht mehr gibt. Aber ernsthaft... MAP Selection, please... Emily, zwei Dankeschön. MAP Selection. 50 Milliarden. Nur mit 64 Mann ist halbwegs spielbar, Conquest mit 128 Mann ist nach wie vor nicht mein Favorit, aber... Ich würde gerne meine Lieblingsspielmodus spielen, und zwar Rush, und zwar auf der neuen MAP. Wo ist das Problem? Warum ist das so ein Hexenwerk, eine MAP Selection einzubauen? Ja, warum? Max, erklär's uns. Dass die Spieler eben ihren Lieblingsspiel auf der neuen MAP, zum Release der neuen MAP spielen wollen. Das ist doch nicht so weit her, das muss in Schweden doch auch einleuchten. Ja, man kann eventuell... Den leuchtet da glaube ich nichts mehr ein. Aber warum? Einfach warum? Ich versteh's nicht. Soll ich das für euch programmieren? Ich mach das, DICE. DICE, meldet ernsthaft. Kein Spaß weiter. DICE, meldet... Das wär doch mal was, oder Leute? Wir programmieren im Stream MAP Selection für Battlefield 2042. Das Problem ist nur, wir haben keinen Zugriff auf den Source Code. Hält euch bei mir. Wisst ihr, hätten wir Zugriff auf den Source Code, da könnte man sogar ein gutes Spiel draus machen. Los, ich bau eine MAP Selection in das Spiel ein. Komplett gratis. Mach ich. Easy. Ruf mich an. Schreib mir den PN. Sag Bescheid. Ich mach das. Wie easy das ist, würde sich dann zeigen. Aber ich glaube nicht, dass es sonderlich schwer sein kann. Ach ja, und übrigens, der aktuelle Anti-Cheat von Battlefield 2042 macht Shadowplay kaputt. Deshalb musste ich heute ein bisschen umständlich über OBS captchern. Ich hoffe das funktioniert. Also nicht wundern, wenn euer Shadowplay den Abgang macht, dann liegt das höchstwahrscheinlich am Anti-Cheat von Battlefield 2042. Neue Season ist am Start. Das heißt, es gibt wieder eine MAP und einen neuen Specialist und ein paar neue Waffen und ein paar Vault Waffen. Im Detail sieht das folgendermaßen aus. Neuer Specialist, das ist Peter vom Microsoft Gold Support. Mega Job, Max. Neuer Assault Specialist mit einem Granatwerfer. Es gibt eine neue MAP Spearhead. Das ist auch das, was ihr im Hintergrund seht. Das ist das, was wir heute auch die ganze Zeit spielen werden. Peter hat zu drei neue Waffen, zwei neue Vault Waffen. Das heißt, Vault Waffen sind diese Copy-Paste-Sachen aus alten Games. In dem Fall ist es jetzt die LMG-Variante von der XM8 und die AN-91. Das ist, wenn ich es noch ganz richtig in Erinnerung habe, war das eine Submachine Gun aus Battlefield 3. Und Max, das Ding heißt A-91 und nicht AN-91. Und es gibt jetzt ein Wurfmesser. Ich glaube, das wird wahrscheinlich einige freuen. Wie gut man das in dem Spiel verwenden kann bei diesen großen Distanzen. Was hier abgeht, Max, Maxception, wir gucken uns zum Start, bis das Twitch gecheckt hat, dass das Stream live ist und alles passt. Wir gucken uns mein eigenes Video an. Bisschen View-Time-Boosten. Kann ich euch erst vielleicht in einem der späteren Videos oder in einem der nächsten Videos zu sagen. Und das Ganze wurde natürlich wieder schön verteilt über einen neuen Battle Pass. Es gibt jetzt zusätzlich noch XP-Boosts, die auch über den Battle Pass verteilt sind. Meine persönliche Vermutung ist, ich denke, sie mussten die Levels im Battle Pass noch irgendwie auffüllen, noch irgendwie ein bisschen strecken, damit man eben den Battle Pass vollbekommt. Das ist höchstwahrscheinlich der Grund, Max. Ansonsten ist alles beim alten, was die neue Season angeht. Die gucken wir uns gleich an, den Battle Pass. Ich hab noch gar nicht groß reingekuckt. Die Map ist mal wieder der absolute Wahnsinn. Die Mapper-Praktikanten haben wieder zugeschlagen, zumindest was die Optik angeht. Offene, grüne Fläche und zwei gleich aufgebaute viereckige Gebäude drauf. Kaum Detail. Kann man eigentlich, weiß das jemand von euch, kann man eigentlich den alten Season Pass auch noch nachträglich anlocken? Also in Dota geht das zum Beispiel. Und fertig ist die neue Map. Aber, hey, ich will mal gar nicht so anspruchsvoll sein. Es spielt sich gut und das ist ja das, worauf es am Ende ankommt. Man hat einen Tunnel zwischen den Punkten. Geht nicht. Die kleinen Basen. Ich lade das nicht hoch, nein. Die Leute lockern das Ganze ein bisschen auf. Optik und handwerklich ist die Map wirklich nicht gut gemacht. Ich mein, seriously, guckt euch die Map an. Viergegiges Gebäude, Wiese. Nur nach 15 haben wir sich gedacht, man hat alles genommen, was da ist. Hat es neu angeordnet auf einer Map. Hat zwei neue Gebäude entworfen. Das war's. Aber das Gameplay ist wirklich okay und das ist ja das, was letztendlich auch zählt. Aber wenigstens ist das Gelände diesmal so gemacht, dass man etwas... Ach ja Leute, ich werde richtig PP-GA M, das kann ich euch jetzt schon sagen. Natürlich gibt es wieder sehr viele Container. Das sind wir ja mittlerweile gewohnt bei Container Field 2042. Aber es knallt wieder nice und das Battlefield-Gefühl ist auch teilweise da. Dazu gibt es, was ich auch wirklich gut finde, ist ein neues Ping. Ich dachte mir, bis Twitch richtig angelaufen ist, gucken wir uns fünf Minuten jetzt mal ein eigenes Video an. Ein bisschen Viewtime boosten. Man kann jetzt Spieler pingen und die werden dann markiert für kurze Zeit. Es ist ja auch Container Field. Was soll man sagen? Guckt aber hier rechts. Tante oder Kent, kann man ja immer noch spielen. Und wenn man zu sehr pingt, also wenn man die ganze Zeit Q spammt zum Pingen, dann gibt es auch wieder einen Cooldown. Finde ich eigentlich eine sehr nice Geschichte. Ist auch eine sinnvolle Lösung. Hat ja nicht umsonst jahrelang, wenn nicht jahrzehntelang, in alten Spielen so oder so ähnlich funktioniert. Wäre das Spiel in diesem Zustand rausgekommen, wäre es zwar denke ich immer noch eine Enttäuschung gewesen. Aber es wäre kein totaler Reinfall geworden, wie es jetzt leider Battlefield 2042 geworden ist. Schade drum ist es tatsächlich trotzdem, vor Weihnachten gibt es noch Update 3.1. Damit gibt es dann eine überarbeitete Manifest-Map. Mit noch mehr Containern? Man kennt, Manifest ist die Containermap. Man könnte das zwar mittlerweile über jede Map in diesem Spiel sagen, aber Manifest ist diese Hafen-Containermap. Ich bin gespannt, wie sie die überarbeiten werden. Man hat ja schon ein paar Vorschaubilder gesehen. Mit mehr Containern? Wäre das gedacht? Zur Abwechslung zwischendurch wird das Ganze nochmal aufgelockert durch Betonblöcke und Sandsäcke und natürlich Container. Dazu wird es noch mehr Vault-Weapons geben, also noch mehr Copy-Paste-Waffen aus alten Battlefield-Spielen. Aber so hat man vielleicht in den Weihnachtsferien ein bisschen was zu tun. Man kann sich so seine Ladung Battlefield abholen, was ab und zu mal sein muss. Es holen sich allerdings aktuell relativ viele Leute ihre Ladung Battlefield ab, nämlich in alten Battlefield. Guck mal, Steam-Charts Battlefield 2042 hier und das ist heute hier mit Season Release. Steam-Charts BF4, BF5, BF1. Passt mal auf. Guck mal hier. Seht ihr das? Wie viele Leute den alten Kram spielen versus das neue. Und sogar Battlefield 4 wird noch ein bisschen gespielt. Also hoch. Gut genug, eigene Videos von mir müssen wir jetzt nicht fertig gucken. Also, ich mache mal das Spiel an. Nicht wundern, am Anfang lag es ein bisschen, es lag immer, das ist normal. Das ist in dem Spiel halt so. Am Anfang lag es, da muss ich den Capture-Modus ändern, hier im OBS. Und dann funktioniert es wieder richtig. Meine Spielebibliothek. Spielen. Passende Musik dabei haben wir auch schon. Sonst, sonst halte ich das nicht aus. MW2 im Vergleich, also Performance-mäßig ist beides ziemlich mies. Weiß gar nicht, was schlechter ist, ehrlich gesagt, Performance-technisch. Specs, 1080 Ti, 8700K, 32 GB RAM und SSD. Noch bis Dezember. In einer Woche ungefähr gibt es einen neuen Rechner. Guck mal, das Spiel hat zum ersten Mal so ein richtiges Startbild. Was nach einem fertigen Game irgendwie aussieht. Das Spiel ist wahnsinnig schnell, wie man hier sieht wieder. High Speed, Loading. Welche GPU gibt es im neuen Rechner? Eine 4090, eine 4090. Guck mal, wie es laggt. Seht ihr, wie es laggt? Cac Weight, Dismiss. Passt mal auf, nicht wundern, das Laggen gehört gleich auf. Hast du ein Atomkraftwerk im Keller? Nee, aber ich hätte bei den Energiepreisen gerne eins. So, das muss man ausmachen. Müssen wir den Game Capture anmachen und hoffen, dass Game Capture funktioniert. Und dann machen wir die Vorschau aus und ich hoffe, es funktioniert dann auch alles im Stream. Weil ansonsten laggt es. Kostet 2800 Euro, nee. Grafikkarte kostet 2200 oder sowas in dem Dreh. So, und jetzt müssen wir erstmal die Lautstärke einstellen. Und ich muss vorher noch was anderes machen. Boah, wo war die Sensitivity Einstellung? Maus. On Foot. 20. Ich bin gar nicht sicher, ob ich da 20 habe. Zumindest habe ich Foff 90. Ich bin nicht der coole 105er Chat. Wo käme man auch hin, wenn das Spiel sich irgendwie Settings sinken würde oder so. Das geht ja nicht. So, jetzt sollte alles funktionieren. Schauen wir mal, ob die Lautstärke okay ist. Ich vermute mal, ich muss einen Ticken leiser machen. Wo habe ich hier denn den Sound? Ja, das Game ist komplett auf Anschlag. Ich mache mal kurz runter, so auf 15. Oder so, dann sollte es eigentlich ganz gut passen. So, gucken wir mal. Auf geht's. Ich weiß nicht, wie lange ich mir das geben kann. Es war schon ein bisschen. Ihr kennt es ja. Ich kann mir das meistens so 5, 6 Runden, 10 Runden, 10 Runden oder so. Kann ich mir das geben, dann habe ich irgendwie schon keinen Bock mehr. Das ist die Ikea-Map. Das ist die Dice-Map quasi. Die in Schweden. Nordfick ist da. 5 auf 50 Minuten. Mal gucken. Das letzte Mal habe ich, glaube ich, 2 Stunden durchgehalten. Schauen wir mal. Also. Ah. Alles klar. Geht noch nicht los. Ich habe in dem Spiel absolut kein Interesse, meine Karte customise. Die sieht seit dem Anfang an so aus. Lautstärke checken. Ihr müsst mir gleich sagen, ob die Lautstärke passt. Ja, lassen wir das jetzt mal so. Gehen wir da mal rein. Ich will bloß nicht fahren. Monkastier. Wisst ihr, man kann auch den Spawn nicht mehr cancelen oder so. Wenn ich jetzt sage, ach Mist, ich wollte doch in das andere Spawn. Oder Mist, ich will doch zu Fuß spawnen. Oder ich will warten. Oder so. Keine Chance. Einmal geklickt, bis verhaftet. Sind wir Cacomodates? Oder sind wir Amis? Ne, wir sind, wir sind. Ne, was sind wir überhaupt? Wir sind Attacker, oder? Also sind wir, sind wir Russen. Cacomodates. Okay. By the way, das ist normal, dass es hier keinen Sound gibt. Bisschen leise ist es, ne? Bisschen leise. Ich mache mal einen Ticken lauter, kann ich noch machen. Wie ist die Lautstärke? Ach ja, und ich muss gucken, dass ich keine Frames droppe. Ne, scheint alles zu funktionieren. Ganz okay, warte mal, ich schieße mal kurz. Ne, ist zu leise. Zu leise. Warte mal, Mixer. Ja, so ist besser. So ist besser. Oder? So, hä? So müsste eigentlich ganz gut sein. Falls zu laut ist, sag Bescheid, aber so müsste eigentlich ganz gut. What the fuck? Warum sind die hier im Spawn schon drinnen? Ja, so ist gut, ne? Ich glaube. Sag mal, sind die im Spawn? Schieße ich schon in den Spawn rein? Es geht ja gut los. Highly advanced map design. So, gucken wir uns das Ganze mal an. Also, ich habe das, wie gesagt, noch nicht allzu lange gespielt. Ich habe nur heute... Alter, mein Gott, jetzt ruckelt es. What the hell? Habt ihr das gesehen? Guck mal. Nice, GG. Hallo, ich möchte gern an den Gunner. Oh, jetzt hat er mich gesniped. Nee, hat mich immer... Doch, doch, hat mich gesniped. Die können mich da nicht ressen, das geht nicht. Oh, nice, nice. Massive. Huge res. Doppelt res geht nicht, oder? Nee, ich glaube. Oder? Oh, doch. Guck mal hier. Nee, no pass, no pass. Yep, yep, spawn. Alter. Ich brauche übrigens das Midi-Kit und nicht diesen Crap. Hat er mich gerade noobtubt? Kann das sein? Was hast du für eine Grafika? 1080 Ti. Also hier geht ja grad nicht alles so viel. Okay, probieren wir das Ganze noch mal. Was ist da? Guck mal, was hier noch so drinne ist. Ist hier noch was drinne? Okay, massive. Ich bleib jetzt hier im Container stehen. Easy Container Camp. Achtung. What the... Wie? Warum kriege ich Damage? Achtung. Achtung. Massive. Massive Hatclitch. Oh, oh. Die wissen, dass ich da bin. Die machen hinter... Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Die machen hinter mir die Tür ab. Ich brauch' ne 4090. Ja, brauch ich. Die brauch ich. Kubernetes... Guck mal, Kubernetes-Cluster am Start. Doppel der Kubernetes-Cluster. Wir sollten, glaub ich, auf die andere Seite. Hier wird das nix. Good physics. Motion Sensor... Das flutscht ja gleich richtig gut. Okay, wir gehen hier hin. Ja, was willst du machen? Da sind einfach zu viele, aber ich meine, wenn man drei gekillt hat, wenn die Leute jetzt reinpushen, dann könnte das tatsächlich was werden. Aber hier rest mich keiner, das kann, oh, oh, nee, nee, war ein Gegner, ich dachte, ich dachte schon. Ach guck mal, wir haben es ja und jetzt kommt halt das blöde, was, what the hell, hier ist ja alles voll noch, Monkeys, jetzt seht ihr gleich, Moment, Moment, Alter, was ist das hier? Jetzt könnt ihr gleich das blöde an Breakthroughs sehen, also ja nicht so, als hätte ich nicht getroffen oder so. Jetzt könnt ihr gleich das blöde an Breakthroughs sehen, okay, jetzt könnt ihr gleich das blöde an Breakthroughs sehen und zwar, dass wenn wir rübergehen zur anderen Base und wir müssen da mit vielen Leuten anrücken, sonst kriegen wir das nicht, die sind dann komplett reingekämpft, dann respawnen die einfach, dann respawnen die einfach, ich muss hier übrigens in diese komische Hütte in der Mitte rein, das ist ein ganz guter Spot und dann guckt die Capture an A schon wieder, das ist das, was ich meine, das ist halt richtig dumm an Breakthroughs, vielleicht komme ich noch bei A schnell rein, das ist halt massiv, massiv bescheuert, dass das Ding keinerlei, keinerlei Capture Protection für irgendwie eine gewisse Zeit hat oder dass du als Defender wenigstens weniger brauchst zum Halten, das ist total Defender-Focus hier das ganze. Okay, auf auf, ich bleibe jetzt hier einfach am Fenster stehen und gucke, ob was kommt, einmal Motion Sensor, ob hier ist nichts mehr, okay, dann müssen wir rüber, müssen wir rüber zu A, wo ist er denn, da kommt ein Auto, okay, komm, jetzt rüber zu, jetzt rüber zu A, easy, easy, Cap, no Cap, easy Cap, nicht Down, Anzeige, Alter, hier kommen sie dann mal rüber, Massive Deckung am Start hier, guckt es euch an, high IQ Deckung, okay, rein hier, rein, rein und jetzt Campen in der Hütte auf A, ach nee, hier ist gar keine Hütte, hier, da drinne, besser Spot, Leute, besser Spot, kann man, kann man das gar nicht aufmachen hier, guck jetzt, Capture'n sie bestimmt gleich A, 2, während wir hier drinne stehen, okay, ich verpiss mich hier mal kurz, Alter, Geruckel, okay, ich glaube, jetzt verlieren wir A, jetzt verlieren wir A, das ist so dumm, das ist so dumm an Breakthrough, guck mal, das ist so blöde, wenn wir Glück haben, können wir das noch halten jetzt, what, okay, der ist im Haus, okay, jetzt, ich hoffe, wir verlieren jetzt A nicht, wo ist denn der, ist der hier drinne, oh, das war blöd, Alter, der wusste, dass ich komme, der hatte eine deutlich bessere Pose da drinne, das zu aim als ich, wo ich nicht genau wusste, wo er steht, aber wir haben's, wir haben's, nice, okay, das hätte ich nicht gedacht, dass wir das hinkriegen, ist hier noch einer, nee, der ist weg, ich glaube, wir haben's, das ist die neue Map, ja, ja, okay, der hat sein Namensschild zu spät gesporn, das ist die neue Map, das ist im Prinzip Orbital, also vom Skin her, nur mit zwei quadratischen Häusern drauf, Dankeschön für den Prime Sub, jetzt könnt ihr gleich eines dieser Häuser sehen, könnt ihr gleich nach dieser Base, könnt ihr eins von innen sehen, oh, Alter, könnt ihr gleich Häuser von innen sehen, ich hoffe, ich werde nicht wiederbelebt, oder, werde ich wiederbelebt, das sieht so aus, als wollte ich wiederbeleben, guck mal, die springen da schon rum, Alter, Massive Fire-AQ-Team, weil wenn ich nicht wiederbelebt werde, hätte ich mal das Midi-Pack mitnehmen können anstatt den Pen, der Midi-Pen ist ja irgendwie verbugged, Hallo, please, klettern, Alter, was willst du denn hier machen, Mensch, wie soll man das denn spielen, sag mal sind das 128, nee das sind 32, 32, okay, wir machen jetzt Flank-Action, ich muss mal ein bisschen aufwachen hier, in der Hoffnung, es klappt, Pakt, hä? Alter, PP-GA-Aim, ich hab's euch versprochen, es gibt PP-GA-Aim und schon ist es am Start, was das für Physiks sind, das funktioniert noch am besten an dem Game, die Physiks, aber das dürfte mit der Zeit sich jetzt einpendeln, Schmerzensgeld, ja, braucht man echt so ein bisschen, oh, oh, what, okay, High-AQ-Play, oh, nein, nein, nein, ganz, ganz Low-AQ, Massive Low-AQ war das, da oben drauf zu gehen war jetzt nicht so schlau, wir sollten's gleich gekappt haben, gleiches Captchern, was wollt ihr mir jetzt sagen, das wollt ich grad sagen, das war kein Treffer oder was, mein, von dem Dude hat nur der Kopf rausgeguckt, okay, gut, so, jetzt könnt ihr das Gebäude gleich von innen bewundern, irgendwie, ich mein, Auspetsch-Chäpp oder, ey, was stimmt hier grad nicht, so, mal einen Motion-Sensor hin, nein, du kannst überhaupt nicht sehen, dass ich da bin, in den Kopf, nice, noch mehr in den Kopf, dahinter, der lebt wieder, okay, wir müssen das anders machen, Plank-Play und nicht, Alter, Midi-Pen, ich brauche, Leute erinnert mich mal dran, ich will das Midi-Kit ausrüsten und nicht diesen Pen, weil der Pen ist verbuckt, jedes Mal wenn du Damage nimmst, bricht der ab, das ist ziemlich unbrauchbar im Eifer des Gefechts, okay, so, das Gebäude sieht hässlich aus, aber, Leute, das ist tatsächlich ganz, ganz brauchbar gemacht, ehrlich gesagt, guck mal, das ist wirklich ganz brauchbar gemacht, das hat ganz gute Ecken, wo man hier, wo man hier durchgucken kann, es sieht halt nicht gut aus, aber es ist wirklich kompetent gemacht, also, als wäre es ein Level-Designer, der wusste, der wusste, was er macht, aber nicht in der Lage war, ein Level hübsch zu machen, aber da außen ist doch ein, whoa, CU, CU, ich bin weg, ha, Lul, was ist mit dir los, was ist mit dir los, der sitzt da einfach, oh, and it was, wie geht das, and it was at this moment, he knew, he fucked up, Midi-Kit-Ausrüsten, jawoll, jawoll, Dankeschön, Chat, high IQ, mitdenk, mitdenk, Chat, wo ist es denn überhaupt hier, Midi-Crate, ach, es gibt ja nur noch eine, raus hier, ich hab Schiss, ich hab Schiss, meinen Kopf hier rauszustecken, ich trau mich nicht, konnte man sich ein, Leute, blöde Frage, konnte man sich lehnen in dem Game, ging das, ne, glaub das ging nicht, oh, da ist ein Gegner, der hat mich auch gesehen, pass mal auf, haha, Lul, hat sich gedacht, guckt er mich ab, wurde er von der Seite gesnackt, ah, shit, hätte klappen können, Autolin, wirklich, oh ne, ich deb, ich hab released, nope, okay, also C2 Hammer, C2 Hammer, jetzt müssen wir irgendwie C1 Captchern und ich wette mit euch, das ist das übliche, wenn wir jetzt rüber gehen zu C1 und C1 Captchern, dann verlieren wir C2, also die übliche, übliche Geschichte, okay, bin mir nicht ganz sicher, von wo ich beschossen werde, haust du her, ja, es war noch mehr da, geil, ne, Autolin glaub ich nicht, hab ich ernsthaft 20 Kills, wo hab ich denn 20 Kills, guck, jetzt verlieren wir C1, jetzt hat, das einzige, was wir machen können ist jetzt, gucken, dass wir schnell wieder an C2 rankommen, ah, ich hab euch PP-GA-Aim versprochen und gibt's heute volles Programm, das ist immer noch die Lidl-UI, hä, also ja anscheinend, du meinst, weil es so billig ist wie Lidl, ich war heute einkaufen beim Lidl, ich hab 80 Euro ausgegeben, also Lidl, das UI ist deutlich billiger als Lidl, okay, ach ja, jetzt hab ich ja das Teil, nice, ich bin mir da nicht ganz sicher, ob man jetzt sich raus trauen kann, oh, da kommt was von außen, guck mal, da, oh, hier drinnen geht ordentlich was, ich hör ja 50 Gegner rumlaufen, so, in der Hoffnung, wir kommen jetzt hier irgendwie rein, guck, jetzt haben wir wieder C1 verloren, Alter, Breakthrough ist so ein dummer Modus, man, was soll man denn da dagegen bitteschön machen, kann mir das irgendjemand erklären, was soll man, na, man geht auf die eine Seite, Capture, es müsste, es müsste so eine Art Capture-Protection geben, zumindest mal für 20, 30 Sekunden, ja, und dann, ich weiß auch nicht, warum es so was da nicht drin ist, und dann müsstest du in der Lage sein, den Punkt quasi mit weniger Leuten zu defenden, also ich meine jetzt nicht killtechnisch, sondern Capture-technisch, quasi du brauchst weniger Leute on point als die Attacker, weil ansonsten musst du dich halt, musst du dich halt festlegen, musst du halt die Punkte pushen, und die Defender können sich theoretisch auf einen raufcappen, und wenn du das eingenommen hast, respawnst und rennt auf den anderen, also das ist total blödsinnig, aber gut, wir haben es geschafft, läuft das eigentlich ruckelfrei, chat, läufts eigentlich gut, ich hoffe, weil ich kann nicht allzu viel machen, sollte es nicht gut laufen, ah, Moment, Moment, jetzt weiß ich was ist, guck mal hier, 360, was zum, Leute, das Game ist merkwürdig, ich hab ungefähr 360 drehen, ungefähr so dreiviertel Mauspad, normalerweise hab ich das komplette Mauspad, und ich hab exakt das gleiche FOV auf meinem anderen Account, und exakt die gleiche Sensitivity auf meinem anderen Account, und die Maus DPI hab ich nie umgestellt, die ist 800 bei beiden, also sus, sus, irgendwas stimmt da nicht, aber das ist gut, das ist gut, dass da was nicht stimmt, weil da kann ich jedes mal, wenn ich verkacke, kann ich sagen, das liegt an falschen Settings, das ist gut, ich lass das so, da kann ich nämlich sagen, guck Leute, dass ich den ersten nicht getroffen hab, liegt eindeutig an Senseinstellungen, alles klar, was ist denn mit ihm los, Nikolas, man, der liegt einfach mitten auf dem Weg, der Nikolas, der will, dass wir in seine Gruppe kommen, da hab ich schon ne Telegram Gruppe, ok, warum, ach, das war das Schild, was ich, nee, ich muss nicht alles verstehen, jetzt müssen wir mal was checken, das müssen wir mal ausprobieren, kann man da hoch, aha, aha, aha, aha, aha, nee, ok, ein bisschen, ein bisschen, hey, das ist gar nicht mal so doof, das ist eigentlich recht cool, dass das geht, wirst du Pepega aim wieder, ok, das ist einfach straight durch geflogen, das ist aber gut, dass das geht, das erinnert mich ein bisschen, wisst ihr, was mich das erinnert, ähm, das erinnert mich an Bad Company, wo man beispielsweise auf Valparaiso oder Isla Innocentes oder sowas raus auf die Mapbegrenzung konnte, guck, das ist eigentlich ganz nice, das ist eigentlich ne gute Sache, sag mal, fliegt das durch oder, was zur, ist das jetzt durchgeflogen oder ist das einfach auf die Range mit der Waffe oder nicht, naja, moin, sag mal, sag mal, seriously, ja, ich spiele Battlefield, das ist aber eigentlich, ich muss hier weg und Bunny hoppen, nein, Mist, ganz schlecht, ganz schlecht, ok, pass mal auf, Bunny Hop Action, nichts wie rüber, ich hab so ein bisschen Schiss, hier ist so offen, das fällt, ich hoffe, da sieht mich nicht der Typ, ok, ok, nice, nice, nice, nice, nice, einfach nichts gesehen, ich darf nicht so schnell releasen, mittlerweile reviven doch recht viele Leute, auch nicht Medics, ja, Leute, wir haben tatsächlich die realistische Chance, das irgendwie zu packen, ach, da ist ja gar nichts, komm, wir machen noch Flank Action, ja, Massive, was, war das Panzerrohr, was da gerade runtergefallen ist, oh, da geht's gar nicht weiter, ok, ok, ok, weiter, weiter Flank, wir spielen nachher noch ein paar Runden Rush, Leute, ok, die wissen das, ich, pass mal auf, Tricks 17, Tricks 17, schnell Feuerrohr drauf, Motion Sensor außen hin, dass ich weiß, wo sie sind, jetzt denken sie, ich komm da rein und jetzt, Scheiße, Monka ist, ah, Shit, der klappen könnte, der klappen könnte, ich dachte nicht, dass ich, ich dachte, ich hab den Midi Pack dabei, ja, 320 IQ Strats, hey, mit 38 muss man das machen, da kann man die nicht mehr one on one, die ganzen 12 jährigen, mal gucken, wenn ich Glück hab, sieht mich keiner und wir müssen auch noch E2 Captchern, ok, da ist er, irgendwo da hinten ist noch einer, da drüben ist er, da ist noch einer, ich hab ihn gesehen, Shit, ich weiß nicht von wo, fuck, Alter, ja, Wauts trau nicht, die ganzen Zoomer ficken alle weg, so sieht's aus mittlerweile, kann man hier drüber und irgendwie die verarschen, pass mal auf, man muss hier outplayen, wenn man die nicht out, out, amen kann, guck, so muss man das machen, out, out, outdenken anstatt outamen, äh, hallo, das war jetzt blöd, oh, oh, oh, oh, ich muss money wechseln, money, da hinten steht einer, oder, nee, wenn das movement ja funktionieren würde, da hinten was, ah, da ist ein Panzer, der Pantsman ist da, ich bin zu alt, ja, alt und falsche settings, wisst ihr, das ist gut, ich brauch was, ich brauch was, wo ich mich rausreden kann, falsche settings und alt, oh, oh, oh, oh, oh, oh, da ist ein Tank, Monka S, okay, oh, shit, jetzt ausgerechnet da drinnen steht noch einer, wir schlagen uns doch ganz gut, guck mal, das ist ein Panzer von uns, wir verlieren jetzt bestimmt wieder E2, okay, capture, capture, nice, nice, capture, wow, ich blicke nicht mehr durch, wo ist hier was, da sind noch mehr, oder, oh, oh, oh, oh, oh, so viel Leute, es ist von allen Seiten, Zoomer Brain, versus Boomer Brain, mein Hirn ist überfordert, wir machen nachher mal einen Reaction Test im Browser, mal gucken, mal gucken, wie gut mein Reaction Time noch ist, was meint ihr Leute, über oder unter 200 Millisekunden, ratet mal, ratet mal, ich weiß nicht, wir probieren es nachher aus, über oder unter 200 Millisekunden, wie, wir haben verloren, wir haben gewonnen, easy, unter, safe, okay, wollen wir ausprobieren, während er släht, komm, wir probieren mal aus, wir machen was, Sekunde hier, display, capture, wie war das hier, human, bench, oh, das laggt, Leute, ich kann das nicht machen, mein Browser laggt mit dem Spiel, das funktioniert nicht, mein Browser laggt schon, das wird nicht funktionieren, nee, der Browser laggt, Leute, klappt nicht, klappt nicht, überhaupt, das, du Scheiße, die ganze Seite laggt, das müssen wir nachher machen, Leute, na geht doch, müssen wir nachher machen, nee, das geht nicht, das geht nicht, die Seite laggt, ja, müssen wir mal nachher machen, wenn das Spiel fertig geladen hat, habt ihr nicht gesehen, dass der Browser laggt, ich hab ungefähr, guck mal, seht ihr das, wie die Seite, ich hab ungefähr 15 FPS oder, seht ihr das, guckt mal, also jetzt sag mir mal in deiner Browser laggt nicht, das machen wir nachher, das probieren wir nachher aus, okay, machen wir das hier wieder aus und wieder Game Capture an, weil ansonsten laggt es bei euch auch, wahrscheinlich hatte ich auch, was haben wir jetzt anloggt, nee, was will ich denn damit, collection, lass mal überlegen, wollen wir irgendwas spezielles mal spielen, was gab es denn diesen, das da, nee, was gab es denn diesen Patch noch mal, das Ding oder, das Ding, nee, Moment, wir müssen mal kurz schauen, was gab es denn diesen Patch für Waffen, BF204 Season 3 Block, die durchschnittliche Reaktionszahl ist 273, okay, das ist ja richtig mies, man, so Block Post, wo ist denn das Official Block, gibt es nicht, hier, also Waffen, gibt es hier, es gibt eine Rorsch MK4, das ist ein LMG anscheinend, NVK, ach Moment, das ist alles Battle Pass gedönnt, Battle Pass müssen wir uns ja auch noch angucken, ach so, na gut, die haben doch Waffen genervt, guck mal, die haben angeblich die K30 genervt, jetzt probieren wir mal aus, ob die wirklich nennenswert genervt ist, die haben die P9 genervt und die K30 genervt, also die K30 war auch ziemlich hart, nur eine neue Map, ja, die machen nur das Mindeste, kann es knicken, ja, komm, probieren wir mal aus, Vector mit Trommelmagazin, korrekt, ganz wichtig, dass diese wahnsinnig aufregende und spektakuläre Kamerafahrt jedes Mal kommt, heckle, okay, so, brauchen wir da irgendwas, naja, können wir so lassen, okay, Schussgeschwindigkeit hat sich nichts geändert, ach hier müssen wir schon, wenn wir spawnen, direkt am Defender Punkt, war das schon immer so, oh, oh, oh, ganz, ganz schlechte Idee, Max, ganz, ganz blöde Idee, wanted Sniper, nice, ich will wissen, ob die K30 extrem genervt wurde oder ob die noch ganz gut spielbar ist, weil ich bin mir gar nicht sicher, was exakt genervt wurde, die Damage Range auf jeden Fall, okay, die Damage Range auf jeden Fall, aber ich weiß noch nicht, ob es der normale, der normal, alter, der normale Damage ist, Prostata Royal hat uns gerade gekillt, alter, die Damage Range ist jetzt ja mal absolut lächerlich, da fällt ja gar nichts mehr um, man, und die wackelt auch mehr als vorher, okay, einmal probieren wir das noch, alter, die Damage Range ist ja nur wirklich mal jetzt komplett, komplett für'n Arsch, was ist denn hier los, Mensch, können wir mal aus dem spawn raus, okay, nee, nee, nee, die sackt, die sackt jetzt mal massiv, kann man nicht mehr spielen, kann man nicht mehr spielen, macht überhaupt, macht kein Damage mehr, und, also mein D-Range ist viel zu, viel zu knapp, da brauchen wir was anderes, kurzes Fazit zu, guck dir das Video von heute an, habe ich eigentlich alles gesagt, weitere, weitere Erkenntnisse habe ich noch nicht, jetzt haben sie ein bisschen zu krass genervt, ach nee, bleiben wir mal dieses Ding, so schlecht war das jetzt ja nicht, Damage, Damage, Damage, was ist das Downside, ja, okay, achso, was ist da hinter uns, was ist da hinter uns, was machst du hier, Anzeige, los mit dem, los, oh oh, guck mal, da ist ja alles voll, oh shit, Alter, warum kann ich nicht moveen, oh oh, oh, ich hab'n Problem, oh oh, ich hab'n Problem, fuck, da machst du nix, nee, krieg ich auch keinen Rest, wenn wir es halt clever machen, würden wir jetzt auf A pushen und nicht so sehr rumgammeln, ja, weil das ist normalerweise das gute an Breakthrough am Defender, sobald die sich hier drauf konzentrieren, kannst du halt zum anderen pushen, na gut, ey, ich glaube wir müssen zum Stinger Noob werden, oder, wenn ich mir das hier so angucke, wird das Zeit für den Stinger Noob, oh es wird Zeit, es ist Zeit, Monkeys ich hab' absolut keinen Plan, von wo hier irgendwas geht, hast du schon einen neuen Job, nee, ich hab morgen nochmal Gespräch mit meinem Chef, und ich hab' dann in den nächsten Wochen über, ah Mist, ich hab' dann in den nächsten Wochen über mal, suche ich mal die zu denen ich hin gehen will, und guck mir das mal vor Ort an, okay, eine kühle, einfach flache Map, guck mal, was ist denn das für ein weißer Skin, der ist eigentlich ganz nice, aber jetzt auf der grünen Map weniger, danke, geiler Spawn, ich drücke auf B1 Spawnen, und wo spawn ich, entgegengesetzt auf der anderen Seite der Map zu B1, GG, okay, wir müssen, wir müssen stingern, das ist ja nicht auszuhalten hier, oh ne, Heli ist down, was, hat gleich 3 Stück rausgeklatscht, sag mal, was zum, deswegen spiele ich gerne Rush, das ist so ein gewisser, kannst du ein bisschen irgendwie durchsteigen, beziehungsweise, hast halt so ne Art Frontline, was du hier halt nicht hast, aber immer noch, ich mein, wir können, wenn ihr wollt, wir können dann mal ne Runde Conquest spielen, aber ganz im Ernst, ich mag Conquest 128 nicht, 128 sind einfach zu viel, oh oh, was ist da, dafür ist es nicht ausgelegt, was ich hier hab, da machst du nix, da machst du nix, der hätten wir eigentlich zurückgemust, hier rettet mich auch garantiert keiner, wie lieblos die Map ist, extrem lieblos, es ist einfach grün und 2 4G Gehäuser draufgestellt, aber sie spielt sich tatsächlich ganz okay, was ja, was ja irgendwo auch das wichtige ist, ja, was die, was die fressen wieder, man, was zum, was ist mit, auf die Range ist das nichts, nichts zu machen, meine Midi Pack ist down, das andere Ding, übelst kacke Gehäuse, okay, die kommen gleich hier durch, hoffe ich mal, auch von hinten, na super, da machst du nix, okay, aber, mein, normalerweise würde ich jetzt K30 oder irgendwas spielen für Nahkampf, bringt aber nix, okay, da stirbt nix, sag mal Leute, ihr dürft auch umkippen, das ist schon erlaubt, hier siehst du nix, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, fuck, Allah wie viel, da fällt mir nix zu ein, direkt was man da gescheit machen soll, nope, gleich kommen wir noch rein rechtzeitig, moin, Icarus, aber, so wird das nichts, so wird das nix Wir campen jetzt uns hier einfach rein ab leute, sag's euch Geile taktik sehr gut Lackt es? Lackt es leute? Sollte eigentlich nix sein? Nee, es lackt auch nix Okay, C2 kriegen wir für Es wäre sehr nice, wenn das sich bewegen würde Na geil, da ist dieser hässliche Pfosten dazwischen Kannste komplett knicken hier gerade die runde, ein nicer stahlträger Weiß nicht was wir da jetzt gescheit machen sollen Wir gucken mal, ob wir noch ein paar runden rush gleich spielen können, weil ansonsten halte ich das nicht aus Aber wenn man sieht die deckung und so, das ist schon in ordnung Die AC-42 irgendwie gut alles abgefuckte Pfosten AC-42, welche ist das? Das ist die burstwaffe Ah, wie ist denn die ACR? Die habe ich noch gar nicht ausprobiert. Das muss ich jetzt mal checken, ob das was taugt 27 Schuss, das ist ja schepp. Was haben wir denn hier? Das da, das da, das da Okay, wir sollten uns mal verpissen Du kannst das, also irgendwie hier normal spielen, kannst du echt voll vergessen Einfach zu viel los Vielleicht ist das auch das dumme an den als defender auf der map Es sind halt 64 spieler auf einem punkt, das ist halt immer noch zu viel. Überlegt euch mal, das war ursprünglich gedacht für 128 Da ging ja gar nichts, am anfang, am anfang zu release. Das einzige wo da was ging ist, wenn du zufällig geklitscht warst Sodass die gegner nicht gesehen haben, dass du ein gegner bist Vielleicht können wir wieder out of map, warte mal, lass mal probieren gerade Alter, das Ding macht ja gar keinen damage Okay, ich spiele jetzt das ding noch mal ein bisschen, der richtig pepega aimt, aber wie Mit dem ding, es ist mit dem ding gar nicht mal so einfach. Richtig pro aimed, aber wie im esl feine Jetzt überrennen sie das Spawnen und mal keinen damage kriegen vielleicht Ich habe keine ahnung, was hier abgeht Alles klar, genau da wollte ich hin, genau da, so war das gedacht und so nicht anders Alter, wie soll das denn funktionieren man So, mal einen motion sensor gucken, ob wir dann was besseres, ob wir dann sehen, was da abgeht Wie soll das eigentlich, wie hat man sich gedacht, dass es gespielt werden soll Mir fällt da gerade nichts wirklich dazu ein, haben wir irgendwas anderes, was ist denn das Nee, das ding sackt, das ist ganz gut Als ob die denken, ne wahrscheinlich nicht Erflanken kannst du halt bei einem Punkt auch nicht richtig Wie, ne das ist ja blöd, okay komm wir spielen die map jetzt noch fertig, danach spielen wir ein bisschen rush, das halte ich nicht lange aus diesem graben hier Wir gehen jetzt gleich zu E2, die gammeln sonst alle hier in diesem Das Ding zieht auch mega rauf, da ist mit long range auch nicht viel So, mal gucken, motion sensor, ja ja, guck mal hier, da ist noch schon was Die sind alle noch da oben Also der motion sensor ist doch nicht so der Wahnsinn, sollte glaube ich was anderes nehmen jetzt, was ist da hinter uns Äh, das down, null, was ist mit dem los, wait a minute, komm hier mal her Ah, da war noch einer Ja die Spielerzahlen werden jetzt erstmal wieder rauf gehen für, naja, 2 Wochen oder so Und das wars dann Also da sind auf jeden Fall noch welche da, es sei denn die sind reingegangen, die sind wahrscheinlich reingegangen Ich bleib bei E2, im Lagerhaus gammeln alle rum Was ist denn hier los, wow, schlechte Idee, schlechte Idee Sagen wir mal, die sterben auch nicht mehr, guck mal da ist wieder Prostata Royal Der Name man Ach die können, die können daraus ja abspringen Da kommt was, by the way, neues Spotting System, neues, neues Spotting System Man kann als Gegner spotten, muss man wieder angewöhnen Das halte ich nicht aus, Breakthrough auf Dauer wird so anstrengend Ohne Front, wo du nicht weißt, wo du hin musst, also wo du hin kannst Oh jetzt kriegen wir aber auf den Sack, ok, gehen wir mal lieber nach E1 rein Haben wir vielleicht noch irgendwelche Chancen, wenn die sich jetzt auf E2 konzentrieren, da wieder was einzunehmen Ja guck mal, jetzt können wir E1 einnehmen Ok, ok, vielleicht haben wir Glück Nice, nice, nice, in den Bobbles man, throwing knife, endlich, ok, nice, das ist zum ersten Mal, dass ich das gesehen habe, guck mal, der knifet gerade alle Nice, das ist das erste Mal, dass ich das gesehen habe Ok, da oben drauf ist ja ne ganz doof Idee Die kommen garantiert von E jetzt rüber gerannt Alter, mit dem Ding ist auf Range nix Kannste komplett knicken Auf Range geht nix Ohne Scheiß, das ist komplett ppega Please, midi pack, heil mich doch Alter, kann es mich, wozu ist das denn da, wenn es eigentlich heilt Nee, midi pack ist auch Sack Gibt es irgendwelche gescheiten Heil-Items, midi pack heilt eigentlich, midi pen kackt ab, während man Damage bekommt Nee, gibt nix, useless Ok, nice, danke Entschuldigung, dass ich nicht gestorben bin Oh, jetzt kommt hier was ordentlich rüber gepusht Ppega aimt wieder, so wie das sein muss Also Spotting, das mit Spotting ist tatsächlich gar nicht so blöd Ich finde das wirklich gut, dass Spotting jetzt am Start ist Also Spotting, was man so nennen kann, dass du Gegner anklicken kannst und dann werden die markiert Also das, was man halt so unter Spotting versteht Das ist tatsächlich ganz nice, dass das wieder mit von der Partie ist Ok, jetzt kommen sie von hier gleich rüber Oh, da sind schon Gegners Ah, shit, hätte ich schon ein bisschen besser getroffen Hätte ich locker haben können, oh nein, F, das war's, RIP, das war's Keine Chance mehr, das ist vorbei Wir können aber probieren, ran zu pushen, aber das wird eher nix werden Ok Oh mein Gott! Verdammt! Keine Ahnung! Fuck! Ach, das klappt. Ah, nee, nee, nee. Gut, wir haben unendlich Tickets. Dann kann ich vielleicht rein spawnen bei dem Kerl da hinten. Kommen wir da tatsächlich nochmal dran? Seriously? Okay, es war blöde. Nicht, auch wenn ich auf die Map gucken soll. Aber man muss seine unendlich Tickets einfach ausnutzen. Oh oh oh oh und F Moment zwölf Auto Shotgun mit Silencer Das ist auch krasser Dude, äh, ein richtig nicer Dude, okay, man weiß, alles klar, alright, das ist ein guter Spot Leute, wo ist hier ein guter Spot, hier nicht, wo ist hier ein guter Spot, in diesen Gängen ist ziemlich errotz, man muss irgendwie oben, obendrauf, man muss das ausnutzen, dass man sein Enterhaken hat, das hier ist ja alles so flach, ich hab hier noch keine gescheiten, gescheiten Spots gefunden. Oh, das sind zu viele Leute, aber immer schön Respawn als Defender, ich mein, scheiß drauf, guck mal, wir haben keine Respawn-Limits, die schon. Oh nee, fuck, ganz schlecht, ganz, ganz schlecht. Alter, diese Waffe auf Range, man, die kannst du nicht benutzen. Pfeifhärte, ja, wir könnten, ich weiß jetzt, ich geh mal auf 1, ja, ich geh rüber auf 1. Müsste mal gleich noch ein paar Waffen durchprobieren, Alter, das kannste auch auf Range komplett klicken, das Ding, scheiße, man, das ist das, okay, das war jetzt Pepega-aimt, aber ich brauch irgendwas, wo man so auf mittlere Range was trifft, das Ding macht übelst Damage auf Nah, das ist okay, aber du kannst auf mittlere Range mit dem Ding nichts machen, gescheit. Vielleicht hat es einen anderen Lauf, der taugt, äh, man kommt ein neuer PC im Dezember, höchstwahrscheinlich, höchstwahrscheinlich, jetzt kommen sie halt von der Seite gleich und ficken rein, gatschi best, bam, weiß gar nicht, auf wen du dich konzentrieren sollst, bleibt zwar einer Nvidia-Karte, ja, 4090, muss Geld loswerden, easy money, easy life, aber das geht alle, also das kriegste gar nicht, aber es geht, dann ist esB bloody, also mal aufterorse, okay, dann geht es weiter, sliced so, paarся mit Time, blitzuma, Kacke was war das man ok ich brauche immer noch einen guten spot hier leute was ist hier ein guter spot kann man da hoch oh leute wir können die runde sogar gewinnen ok was ist hier gibt es hier ein guter spot hier oben ist was auf dem präsentierteller hier jetzt hier kämpen hinter dem ding easy easy win wie auch immer wir das gewonnen haben keine ahnung und wie auch immer ich da ein 40 leute noch gekillt aber hast du auf steam wagfreies spiel wenn man wieder gesehen hat ne ne origin und ich muss das mir glücklicherweise auch nicht kaufen mal davon abgesehen das war mit sicherheit mein letztes battlefield was ich gesponsert bekommen habe weil ich habe ja kein gutes haar an dem spiel gelassen und das ist nicht gut angekommen die lagen mich nie wieder zu irgendwelchen events ein es juckt mich nicht ja wurde ich vorher auch jahrelang schon nicht ist nicht so dass mich das großartig interessieren würde ok lasst uns mal schnell mal einen blick in den battle pass werfen was wir da so haben und da was man da anlocken kann dann spielen wir vielleicht noch eine runde breakthrough leute ihr könnt euch auch so wollen wir noch ein paar runden russ spielen das ist dann halt nicht garantiert die neueste map aber die chance eine gescheite map zu bekommen sind deutlich höher oder wollen wir noch ein bisschen breakthrough spielen russ ok was haben wir jetzt was horthorn weiß ich ob das taugt ok wir brauchen auch irgendwie mal eine ordentliche waffe was was könnte man denn spielen das ding wurde zu tode genervt das ding wurde auch zu tode genervt pp 29 weiß ich ob die was taugt von den assault rifles also die ac erst sagt 16 habe ich nicht anlockt das ding ist ganz gut allerdings definitiv nicht auf mittlere und weiter range kannst du null mit anfangen habe ich nicht wirklich gespielt das ding habe ich auch nicht wirklich gespielt bleibt ja eigentlich nur das teil hat er nicht so viele waffen a shot gun shot ne ne ne das war damit fangen wir gar nicht erst an das neue manifest schon da nein ist es nicht neue manifest kommt mit dem update 3.1 das kommt vor weihnachten heißt im endeffekt auch nie discredit jetzt wird es was hier eine der schlimmsten maps überhaupt hardcore hardcore ppega map ob sie irgendwas runtergeschmissen und ich weiß nicht was wird dir doch mehr Okay easy, lege Henne, nee Entschärfungshenne, lege Henne ist ja nur Attacker, oder kommt noch was, oder? Oder ist das über uns? Der hat sich das etwas, ach nice, der hat sich das etwas anders vorgestellt. Düt, düt, düt, düt. Ich würde gern oben auf das Schiff drauf. Die Fresse mal. Ja, dann nehme ich auch die andere Waffe jetzt, es sei denn ich werde wiederbelebt, soll ich wiederbelebt werden, dann nope werde ich nicht, ihr belebt mich nicht wieder. Dann nehme ich die andere, die da, please, please nicht sterben, nein nicht sterben. F. Warum kann sich das Ding eigentlich nicht merken, was man ausgerüstet hatte? Ist da, ist die, ist da die Technology, ist die Technology nicht da? Ich glaube die Technology ist nicht da dafür. Sie ist nicht ready, jupp. Eindeutig, sehe ich auch so. Offensichtlich, ich meine nur weil Sachen vor 20 Jahren funktioniert haben, heißt es ja noch lange nicht, dass es heute auch wieder funktioniert. Guckt euch mal die Mondlandung an, wir sind auch auf dem, wir sind auch auf dem Mond geflohen und jetzt wissen wir nicht mehr wie es geht. Hi IQ Play. Ich kann da nicht hin, wenn ich dahingehe bin ich down. Ok, ich probiere es trotzdem. Ich probiere es, aber im Moment, es ist gar nicht hier, cool, es ist auf der anderen Seite. Ok, bis der da ist habe ich defused. Lege Hände, bewegen, bewegen, bewegen, bewegen. Nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein. Das war close. Ich höre total viele rennen und ich Ich weiß nicht wo, Leute. Wo sind denn die? Sind die da oben? Die haben noch 10. Komm noch 10, das kriegen wir defended. Ich camp jetzt hier ab bis die Tickets weg sind. Au! Ich weiß nicht genau von wo. Jetzt liegt es wieder an mir, dass wir verlieren. Leute, die sehen ihn wieder nicht. Die sehen ihn wieder nicht. Doch, doch. Sehen ihn. Leute, noch 5 Tickets, Mann. Please. Die legen wieder. Die lege Henne. Die lege Henne ist aktiv und jetzt kriegen sie es auch. Gechockt hat er da, Max. War nicht ESL Finals würdig hier. Oh, ganz blöde Idee. Hallo, please. Hauen sie alle ab? Sollte das? Könnte ich einfach abhauen? Okay, das war PP-Gard, hoch 10. Aber nach unten ist auch schwierig mit dem Ding. Oh, ich höre hier so viel rennen. Was piepst denn hier eigentlich so? Location revealed. Wie? Warum ist meine Location revealed? Was ist da los? Und warum höre ich 30 Gegner um mich drum herum, obwohl gar keiner da ist? Und warum ist hier zu und Fragen über Fragen? Warum ist hier zu? Bin getaggt vom Commander. Okay, PP-Gard. Warum bin ich... Ach, weil ich... Ich weiß es, weil ich jetzt... Die haben gelegt und ich bin in der Off-Zone. Ach so. Letztes Mal, wenn man das Spiel nicht versteht. Ist das Spiel sein Gelbwert? Nee, ich würde es auf keinen Fall kaufen. Komm mal, der erste hat 43 und ansonsten sind alle immer gelieft hier. Oh, da oben steht einer. Wir sind doch bestimmt noch mehr, oder? Dachte ich mir doch. Das dachte ich mir doch, dass hier noch mehr sind. Die sind doch nicht alleine. Okay, jetzt höre ich jede Menge Leute rennen, aber das sind, glaube ich, meine. Oder das sind meine? Wie läuft man hier am besten? Oh, da oben ist ein Schneiber, Dude. Alter, Schneiber, Mann. Okay, der hat mir einen Fuß geschossen. Ja, also ihr könnt es übrigens, im Dezember könnt ihr es kostenlos spielen. Ich glaube, 1. Dezember bis 5. Dezember oder sowas. Ich weiß es aus dem Kopf nicht genau. Und auf dem PC war das, glaube ich. Wir gucken jetzt mal, ob wir den Schneiber, Mann, da oben erwischen. Oh fuck, ich bin hängen geblieben an diesem scheiß Boden, Alter. Ich denke sonst, Alter, warum geht mein Fahnenkreuz nicht nach links? Ich war stuck. Oh, Mann. Okay, Alter. Oh, fuck. Du. Oh, Mann. Oh, Mann. Okay, down. Das sind zu viele da oben, Mann. Ja, manchmal kriegt der Boomer Donnerwasser auf die Reihe. Too much. Aber guck mal, wir wissen, dass die alle da drinnen sitzen. Und by the way, warum ist diese Kanone so mies? Okay, schnell, schnell, schnell. Vielleicht haben wir Glück. What the fuck, Mann? Ich dachte nur, ich war das, man überhaupt aimen kann. Das steht einfach auf der beiden Seite. Okay, ich gebe zu high IQ Plays den anderen. Oh, please, lass mich reinspornen, Buddy. Alter, lass mich reinspornen. Ja, ja, ja, sehr gut, sehr gut. Excellent. Ah, ja. Nice. Nice, nice, nice, nice. Die legen wieder, die lege Henne ist am Start. Mächtige lege Henne. Okay, MVP Play. Wir haben es. ESL Finals, deutscher Meister. Wir haben es geschafft. Ging doch eigentlich echt gut, für dass wir quasi erst so im letzten Drittel reingejoint sind. Ist das die neue Schiff Map? Nein, Mensch, das ist die Container Map. Siehst du das nicht? Obviously. Continue. Was haben wir denn unlockt? Oh, XP haben wir unlockt, Leute. Und dann unlocken wir als nächstes die Sniper. Okay. Wie löst man denn diese XP Token überhaupt ein? Was ist jetzt? Okay. Leute, Qt das jetzt noch? Da unten dreht sich. Bedeutet das, ich bin noch in der Q? Oder bin ich irgendwie aus der Q jetzt raus? Wie ist Battlefield zur Zeit? Naja, es ist halt Battlefield. Man kann es, wenn man ab und zu mal Battlefield spielen will, schon spielen, aber es ist kein gutes Battlefield und wird es wahrscheinlich auch nie werden. Das fühlt sich seit 1, 2 Patches zum ersten Mal wirklich nach einem halbwegs zusammenhängenden Spiel an. Oh, die fast neue Map. Die fast neue Map. Die Map, wo sie sich noch mit am meisten Mühe gegeben haben. Wie soll das mal in Amazon Prime packen? Du kannst kostenlos, glaube ich, spielen, 1. bis 5. 12. auf dem PC und dir das angucken. Es gibt garantiert bald irgendwelche... Ja, please. Hallo, ich möchte spawnen bei dir. Darf ich bei dir spawnen? Mensch, das ist auch immer geil, wenn es die Hälfte vergisst. Was ist Messer? F, okay. Okay, Achtung. Okay, nice, GG. B, der ist nicht gestorben gerade, null. Das habt ihr euch anders vorgestellt, oder? Alter mein, ey man, was ist das? Okay, wie gesagt, ich hab nicht die richtigen Settings. Ich hab ja gesagt, da kann ich mich mit rausgehen. Ist da hinter uns was? Nee, oder? Okay, pass mal auf. Scheibe kaputt machen und jetzt und jetzt und jetzt. Massive. Wie gesagt, ich komm noch irgendwie weg. Achtung, Epilepsiewarnung, MonkaS, game, please. Oh. Wo war der jetzt genau? Ach, der hat da hinten rausgehackt. Verstehen, ach klar. Nice Posey, sehr gute Posey, Kollege. Exzellente Posey. Six header, seven header, eight, nine, ten header Posey. Na, hit nice hab ich doch. Morris. Okay. Shit, den hab ich nicht gesehen. Ich hab extra versucht, das ganze Lagerhaus zu klären. Den hab ich nicht gesehen in der Ecke. Ja, das ist total vielen Bereichen, ist das Game broken. Broken as fuck. Nein, die sind respawned. Shit, die sind schon wieder da. Sonst wäre er dran gewesen hinter seiner Kackkiste. Da ist in der Zwischenzeit keiner drinnen. Na gut. Kommt vor. Wieder lebt oder was? Shit, ich glaube, das hätten wir jetzt kriegen können. Jetzt hätten wir es glaube ich kriegen können. Ich glaube, außer mir schlicht und ergreifend keiner was gekillt. 19 Euro auf Steam, hm. Ja, kann man machen, ganz ehrlich. Wenn man Battlefield mag und es hat ja im Kern noch Battlefield-Gameplay in sich, wenn halt auch einiges fehlt und eigentlich nur das gut ist, was man halt nicht krampfhaft überarbeiten musste. Aber für 19 Euro, wenn man sich so mal seinen monatlichen Dosis Battlefield holen will, kann man das schon machen. Hol dir lieber paar Döner, da hast du mehr von. Also Stunden insgesamt hast du trotzdem an Battlefield mehr Spaß. Allerdings muss ich sagen, ich bin eh kein Döner-Esser mehr in letzter Zeit, sondern wenn überhaupt bestelle ich mir meistens Köfte-Teller. Döner, gut, mein ab und zu jeder futtert ab und zu mal einen Döner, aber ich muss sagen, ich bin Köfte-Enjoyer mittlerweile. Köfte-Enjoyer. Oh, wir dürfen Erika Harbour spielen. Mal gucken, ob wir die erste Base überhaupt hinbekommen. Erika Harbour ist die erste Base. Sowas von Unbalanced. Wie sieht es mit Waffen aus? Ich zeige es dir gleich. Nicht wirklich besser. Hier, guck. Das war's. Soltreifel gibt es tatsächlich noch am meisten. Oh, wir sind Defense. Smoke, Smoke. Erika Harbour ist Smoke nicht verkehrt, allerdings nicht auf Defense. Wir bleiben dabei. Also Erika Harbour klappt entweder der erste Push direkt oder, oh, wie es ruckelt, oder es ist für die Attacker ziemlich schwierig. Also erste Base Erika Harbour ist ziemlich Defense-Heavy, aber es klappt. Also es kann durchaus klappen, aber meistens klappt es dann schnell, wenn überhaupt. Ich bin mir nicht ganz sicher von wo, außer dass die wahrscheinlich von der anderen Seite pushen. Kommt man hier rauf? Ich weiß das gar nicht mehr. Kommt man hier rauf? Nee, ne? Kacke. Geht nicht. Ne, ne, ne. Also. Einfach ein bisschen wackeln, dann geht das. Okay, easy. Oh, ich werde gesniped. Nein, nein, nein. Hörst du auf mich zu snipen. Du hörst auf mich zu snipen. Au, hör auf mich zu snipen. Lass mich in Ruhe. Im RPG. Finde es gut, dass man die Waffe jede Runde neu konfigurieren muss, damit sie nicht speichert. Ich finde das nicht gut. Warum sollte der das nicht speichern? Das ist eigentlich bescheuert, dass er das nicht speichert. Du meinst, dass er dann automatisch immer das nimmt, was auf 1 ist? Ich weiß nicht. Nein, nein, nein, nein, nein, Leute. So nicht. Ich weiß nicht von wo, ich weiß nicht von wo, aber vielleicht von da? Hier vielleicht? Nein, das habe ich nicht gemarkt. Das habe ich gemarkt. Ich dachte doch, Erika Harbor ist ziemlich schwierig für die Attacker. Oh, ich höre da was hinter mir. Da oben, oder? Aha. Lul. Ok, mal gucken, ob wir da hochkommen. Und ob da noch was ist da? Da war was? No Pass. Sind die alle gelieft? Nö. Sind alle noch da? Oh, die habe ich zu spät gesehen. Aggressive Freaking L690, ja. Goll. Goll und wie ist das Ding SV? Ne, du meinst SV96, nicht L690. SV96, oder? Ist das Ding nicht so? Shit, ich wollte noch weg. Da steht eine Agony Saw. Das macht der Clever, so muss das machen. Sixheader. Alter, wo ist er? Alter, habt ihr gesehen wo unser Typ steht? Der will Long Range Sniper Shot Shit machen. Die mag ich ja, die Leute, ey. Die mag ich ja. Die Long Range Sniper Dudes. Oh, oh. Nein. Ah Shit, ich wollte aufs Dach. Bad Company 2 Maps, Leute, ich bin froh, dass die drinne sind. Sonst hätte ich ja noch weniger gescheite Maps. Jetzt haben sie gute Chancen. Jetzt haben sie gute Chancen das hinzukriegen. Ja, und das haben die gut gemacht. Normalerweise ist die erste Base wirklich schwierig. In Bad Company 2 konnte man das hier einschießen mit dem Panzer, dass man das quasi immer bekommen hat. Bin mir nicht sicher, ob das hier funktioniert. Da oben was. Ja, da oben, da oben ist was, oder? Was ist das? Seht ihr da was? Meint ihr, da ist was? Ich trau mich jetzt nicht rüber zu laufen, weil, weil wenn ich rüber laufe und da ist nichts, ist es ziemlich verschenkt. Da smoket er sich ein. Ok, wir gehen mal ein bisschen an B gucken. So, wir haben mal nichts gegen den Panzer dabei und auch nicht so wirklich was gegen das Auto. Wir können die nur, wir können die nur, oh, da war was. Nee, das war meiner. Geht euch das auch so, dass diese Punkte teilweise, also entweder bin ich boomer hirn, kommt einfach nicht mit oder die Punkte ploppen manchmal zu spät rein. Ah, ich wollte dich gerade retzen. Ich blicke, wo ist hier was? Monkas. Achtung. Oh, oh, da sieht mich. Ich weiß nicht genau, von wo, aber irgendwas hat mich gesehen. Ah, daneben. Ok. Ist der auf dem Dach? Oh. Hallo. Please. Oh. In the corp, man. Ok, ich glaube, wir haben es jetzt ganz gut unter Kontrolle gerade. Die Atmosphäre fehlt an schlechter Beleuchtung. Hast du recht, die Map sieht schlechter aus als in Bad Company 2. Oder was findet ihr? Was, was findet ihr? Wo sah die Map besser aus? BZ2 oder hier? Also ich tendiere auch zu BZ2. Das war einfach irgendwie atmosphärischer. Es war ein bisschen Low-Res, Texturen waren nicht so gut, wobei Texturen im Spiel auch nicht wirklich, nicht gut sind. 100 mal besser, ja. Aber gerade der Sound in Bad Company 2 war einfach Wahnsinn. What? Alter, wie gut hat denn der getroffen durch das Fenster? What? What is that? Scheiße. Ich dachte, der ist down, ich kann switchen. No, jetzt legen sie. Lege Henne. Ja guck mal, Alter, wo stehen denn unsere Dudes rum? Wo stehen die denn rum? Komplett am Arsch der Welt, Mann. Offenberg. So schlecht. Ok, ok, ok. Gib ihm alles. Lege Henne. Scheiße. Ich wäre fast noch rangekommen. So knapp. Aber dafür wird die Map jetzt besser. Ist eigentlich nur von Vorteil. Die Map wird deutlich besser als in dieser kleinen Wüstenstadt oder was auch immer da unten. Also der erste Spot ist wirklich ziemlich mies. Ganz klar BZ2. Find ich auch. Find ich auch. Ok, mal gucken, dass die sich hier nicht durch mogeln. Was die wahrscheinlich gleich machen. Die mogeln sich bestimmt auf der anderen Seite durch hier. Guck mal, hier, hier. Hier ist der Mogelspot. Hier, außenrum normalerweise. Guck mal, da unten ist schon der erste Down. Wo sind denn Gegner? Seht ihr Gegner? Also ich sehe wenig Gegner, wenn ich ehrlich bin. Dabei sind das voll. Voller Server. Hallo? Gegner check. Ich hoffe das atmet nicht in die falsche Spawnge-Camp jetzt aus. Das muss ja wirklich nett sein. Normalerweise, wenn es die Gegner schaffen A einzunehmen, dann kriegen sie das hier auch hin. Weil A ist ziemlich schwierig. Also A schaffen meistens die meisten Attackerteams gar nicht. Oh, ich habe das richtig gesehen durch den Zaun. Aber vielleicht haben sie jetzt Chancen und kommen hier wenigstens durch. Naja, oder auch nicht. Also BZ2 fand ich nice. BZ2 hat aber auch seine Probleme, muss man ehrlich sagen. Hätte ich mich retzen lassen können. Also viele BZ2-Maps waren sehr Spawn-Camp-lastig. Also du konntest, wenn du ein bisschen besser warst oder generell, wenn du gute Posis hast und da ein bisschen was gehalten hast, konntest du ziemlich gut. Oh, guck mal, was kommt da oben? Die Gegner Spawn-Campen. Das ging in Battlefield 3 auch teilweise noch. Aber ich muss mal kurz hören. Ist der nicht mehr hier? Das war doch ein Gegner, oder? Bin ich blind? Ach, unter mir. Scheiße. Der hat auch noch darauf gewartet, dass ich die Treppe runterkomme. Hat er aber gut gemacht, weil jetzt weiß keiner, dass er da ist. Außer ich. Ich weiß es. Nichts wie hin. Lasst mich in Ruhe von da oben. Nichts wie hin. Ja, der ist bestimmt da noch drin, Leute. Nö. Ah, da war er. Lul. Da kann man nicht mehr rein. Ja, der ist gestorben. Nicht von mir. Der hat einen anderen Typ gekillt. Also ganz ehrlich, gerade funktioniert die Map in dem Spiel nicht gut. Der Fluss. Du kannst halt nicht 1-2-1 die Maps übernehmen und denken, es ist alles gut. Das Spiel funktioniert halt anders. Gehen die zu A? Oder wo gehen die hin? Das nicht. Mensch, Alter. Muss da mehr Burst schießen. Ach, von da drüben. Lul. Hab ich Glück gehabt. Der hätte mich gekillt, weil ich jetzt weiter so PP gehabt hätte und vor allem meine Muni leer gewesen wäre. Okay, wir haben es gleich, Leute. Wir haben es gleich geschafft. Ich weiß nicht, ob wir dann Attacker sind oder ob gleich die nächste Map gespielt wird. Oh, was ist hier los? Also ich höre auf jeden Fall Leute um mich drum herum laufen. Ich weiß halt nicht. Oh, wo war der? Fuck. Hätte ja funktionieren können. Hätte ja funktionieren. Hätte ja funktionieren. Die kriegen es schon wieder auf den letzten Drücker hin. Das ist schon wieder auf den letzten Drücker hier. Da sind ein paar Stelsgegner. Ich camp mir jetzt einfach an B1 ab. Ist nichts mehr. Ist nichts. Haugt das was? Nee. Okay, die Waffe verhält sich definitiv nicht wie in BZ2. Absolut gar nicht. Das sind meine? Das sind meine Dudes, ne? Glück gehabt. Alter, das ist nicht Portal, das ist im Main Game. Wir sollten es haben, denke ich. Ich wollte ihn eigentlich razen, aber weiß ja nicht. Oh, oh. In die Luft geflogen und Win. So, jetzt mal Attacker. Gib ihm. Try the map, please. Wie soll man sich auch nicht verstehen? Warum ist dieses ganze Auto ein Intro Zeug so lang? Du brauchst ja... Hat mal jemand gestoppt, wie lange das braucht? Du brauchst bestimmt 2 Minuten, bis du im neuen Game drinne bist. Mit diesem ganzen Hin und Her. Ist das, dass die Boomer und die Casual Boomer nicht so sehr nerventechnisch am Ende sind, so nach dem Motto, jetzt ist die Runde vorbei, Alter. Jetzt muss ich erstmal aufs Klo gehen, ne Runde pinkeln, weil das war so aufregend, mal was zu trinken holen. Boah, mal kurz raus auf den Balkon, mal ein bisschen durchatmen. Boah, war das anstrengend, ich bin ja kurz vor mir. Okay, jetzt geht die Runde wieder los. Weiß ich, warum das so lange dauert? Zigarettenpause, weiß ich nicht. Ich glaube, das dauert so ewig. Mir war es in Battlefield 3 schon zu lange. Ist das Spiel endlich spielbar? Ja, gut, spielbar ist es. Nervig ist es trotzdem. Ist Breakaway eigentlich schon überarbeitet jetzt? Ich bin ja auch nicht der typische Zielgruppenboomer. Ist Breakaway schon überarbeitet? Glaube nicht. Die wollen ja Breakaway überarbeiten und diese Ölplattform näher dran machen. Erst im Januar, ja kann man schon verstehen, wenn man mit dem kompletten Team dran arbeitet, dass zwei Sachen verrücken auf der Map schon mal ein halbes Jahr dauert. Schon klar, schon klar. Logisch, ne? Das ganze Team, alle beide, ja genau. Alle beide arbeiten noch dran. So, schauen wir mal. Was ist denn hier? Ist hier was? No Pulse. Wird? Wird? Na mal, Gegner please? Hallo? Sind welche da? Hallo, ich bin hier. Gegner? Mod check? Die sterben ja auch nicht hier. Enemy check? Hallo? Wie? Ach, ich hab ne langsame. Ok, wisst ihr was? Ich wollte da jetzt hin Yoloen. Ah shit, hätte ich mal ausprobieren können. Ja, Team mit zwei Personen. Alter, der Typ hat schon sieben, ne ne ne, siebener Score. Wollte grad sagen, sieben Kills, man. Wo hat er die denn her? Gab's überhaupt keine Gegner. Wo man die hätte bekommen können. Please heal. Da ist TAX. Da ist doch bestimmt der einer hier. Ich seh nix. Ich seh nix. Hier ist nix, oder? Nix da. Oh Gegner. Kommt man da rauf? Hey, das ging auch nicht von Anfang an, gell? Och Mensch, lass mir doch was übrig. Ich hab mich hier so schön angestellst von hinten und dann hab ich nix davon. Die Map ist äußerst balanced. Gerade. Massive balanced. Extremly balanced. Gibt das ein Scoreboard? Ja. Ach ne, bei Konsolen. Keine Ahnung. Ja, spielt sich besser als Durchbruch, das stimmt. Aber Breakthrough spielt sich fast überall müllig, deswegen. Deswegen mag ich Rush auch am besten, ehrlich gesagt, oder am liebsten. Rush ist pretty hog. Naja, ne, ehrlich gesagt nicht. Es ist erträglich. Das war's aber auch. Ganz schlechte Idee. Ganz schlechte Idee da raus zu stürmen. Okay, wo geht hier was? Da unten? Ich seh nix. Ich seh nix. Wo denn? Wo denn? Au Mann. Okay, ich hol dich. Hallo, ich möcht dich resten. Alles schön. Okay. Pass mal auf, ob die auch so nett sind wie ich zu ihnen und mich retzen. Ich tippe auf nein. Oh, Wolfs Schnitzel. Fahrgast Rest. Wolfs Schnitzel? Hieß der überhaupt Wolfs Schnitzel? Okay, YOLO Modus. Woah! Die kommen hier nicht wirklich raus, ne? Oh, der hätte sich abgefuckt, hätte ich ihn gekillt. Bin ich, bin ich ein nicer Head Clitcher? Finde schon, finde schon. Ich bin ein äußerst nicer Head Clitcher. Und ein Pepega-Amer darf man nicht vergessen. Ein richtig nicer Pepega-Amer. Aber zum Glück sind die Gegner noch mehr Pepega-Amer als ich. Kommst du raus? Mensch. Auf der Skala von eins bis zehn. Ach, Rush macht mir tatsächlich relativ viel Spaß. Ah, Shit. Rush geht, aber ich kann das jetzt auch nicht super lange, ich kann das jetzt keine vier, fünf Stunden oder so ein Stück spielen. Das kriege ich auch nicht. Okay, nice. Wo sind wir? Wo sind wir? Hier? Woah, woah, woah. Achtung, ich bin weg. By the way, das ist so wackelnd, denk nicht an mir. Ich bewege mich nicht. Das wackelt so von sich aus. Weil es auch so wackelig ist, wenn man hier unter so einem Stück Metall liegt. Ich habe mich nicht bewegt. Aber ich glaube, wir kriegen das. Ich glaube, ich glaube, wir... Oh nee Mist, die sind alle da oder nicht? Ah, fuck. Aber die sind blöd, die rennen alle auf A und gucken nicht, dass wir hinterher rennen. Ein Diffuse-Cham. Diffusers. Any diffusers. Lol. Kacke. Okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Mann, Alter, was soll ich noch machen? Okay, der hatte die deutlich bessere Waffe dazu. Headshots, Headshots hätte ich ihm geben müssen. Dann hätte es funktioniert. Ich kann dich nicht retzen, Leute, sorry. Wir müssen da irgendwie ran. Wir haben es ja gelegt. Die Legehänne ist ja am Start. Die Legehänne ist ja da. Die geht ja. Ah, Gott, Alter. Okay, sinnlos reinrushen bringt gerade nichts. Die sehen nicht und wir sind... Ah nee, wir sind down. Noch sieben, noch sieben Tickets. Wird nichts. Nope. Keine Chance. Fertig. War's. GG Eats. Haben wir verloren. Mit sechs Tickets kriegen wir das nicht mehr hin. Was ist mit dir los? Fuck, ich habe ihn gesehen. Falls ihr denkt, ich habe ihn nicht gesehen, doch, doch, ich habe ihn gesehen. Ich weiß bloß nicht so genau, wo er ist. Wo ist er denn? Ich durfte ihn nicht mehr killen. Nice. Hat so gut angefangen. Yo Max, yo. Max, 40 Gegner. Ja, man konnte nichts mehr machen. Battlefield 2042, besser. Es wird mit jedem Patch ein bisschen besser, aber halt nicht jetzt irgendwie in der Geschwindigkeit, dass dann ein gescheites Game rauskommen würde, weil sie machen ja auch an der Substanz nichts mehr. Sie bringen eine Map, sie bringen einen Specialist, sie überarbeiten die Maps mit ein paar Containern, aber so grundsätzlich an diesem Spiel ändert sich ja nichts mehr, auch wenn sie sagen, sie sitzen mit dem gesamten Team dran. Ehrlich gesagt, es ist ziemlicher Bullshit aus meiner Sicht, ja. Ich glaube, ich habe auch noch keinen Battle Pass fertig gespielt in dem Spiel. Ich habe einfach nach so zwei, drei Tagen schon wieder keinen Bock gehabt. Ja. Der Hardcore-Cryen von Battlefield 3, der stellt sich bei mir da nicht wieder ein. Also PC2 habe ich krass gecrienet. BF3 habe ich krass gecrienet. BF4 ging so. Ähm. Ja. WW3, ja. Ich will aber keinen Mail.ru Anti-Cheat. Was ist das eigentlich? Leute, was meint ihr? WW3 ist ja relativ, sagen wir mal, relativ Battlefield-ähnlich. Es ist ein bisschen ja noch realistischer gehalten als Battlefield. Aber was ist es, das eigentlich kaum Spieler anspricht? Wenn man sich das anguckt, es ist das Battlefield-ähnlichste Spiel zur Zeit, was nicht Battlefield ist. Und das hat 1000, 2000 Spieler. Also man kann jetzt nicht sagen, dass es da krasser Erfolg wäre. Oh, ich werde da lieber Attacker jetzt. Geheul der Leute, weil es nicht lief. Naja, so ganz unbegründet scheint es ja nicht gewesen zu sein, wenn du schon sagst, es lief nicht. Oder meinst du, die gucken gar nicht mehr rein und jetzt läuft's. Äh, alles klar, nice. Dankeschön. Danke, dass ich nicht aufs Dach darf, easy. Pack, da sind Geister direkt vor mir. Easy. Die wollen da rein, die wollen's wissen. Ah, shit, oben war noch mehr. Alle killen kann ich jetzt auch nicht. Die sind gut. Oh, ist das wieder Discarded, Leute? Ist das schon wieder Discarded? Oh, please. Okay, Leute, ich lief. Wenn wir das nicht halten, dann lief ich und suche einen neuen Sabber. Discarded ist wirklich so ne Rotswap. Yep, cock. Wow, wow, wow, okay, okay, okay, ich bin raus, ich bin raus. Oh, da ist einer, der sieht mich nicht. Nice, dankeschön. Kacke, null. Ich seh nix, Leute, das ist mein Problem, wo ist der Gegner? Oh, hab ich den PP gehabt, okay, ich hole euch, ich hole. Oh, da kommt einer. Fuck. Ja, du, hier, guckste dir an, ich resse euch und ihr macht Scheiß, macht ihr. Okay, er ist tot. Was ist das für ne Lobby? Das ist genau die richtige Lobby für mich, weil du hast ja gerade gesehen, ich treff auch nix oder darf man sich auch Gegner wünschen, die nix treffen. Oder ist es verwerflich? Ich finde nicht. Ich finde, wenn man selbst nix trifft, ist auch okay, das ist da nicht so, nicht so Geschwitze wie in MW2, sondern es treffen einfach alle nix. Achtung. A-LUL. Nice, Bun. The Gurkenkahn. Wollte eigentlich aufs Dach, aber durch den Zaun wird das nix. Gurkenkahn hat mich gebashed. Jawoll, jawoll, jawoll, jawoll, jawoll, jawoll. Nice, nice, oh oh, da wollte ich gar nicht. Sag mal, kann man da nicht rein? Kann man in das Auto nicht rein? Ist das ein ALV, sonst mobiler Spawnpunkt oder was ist das? Kann man da nicht rein? Ich glaube, man kann da nicht rein, gell? Mein Aim, einfach wieder on point heute. Komplett, komplett on point. Da macht mir keiner was vor heute. Okay, wie kriegen wir B-Defuse? Okay, Yolo, Yolo, nein, nicht Yolo, fuck. Ist verloren, shit. Bam, bababam. Oh, busy feel. Recoil wie ein Laser. Die ist gar nicht so einfach auf Range zu treffen. Sag ich jetzt nicht einfach so, guck mal. Also du musst tatsächlich ein bisschen ziehen, dass es klappt. Ich meine, das ist jetzt keine AK aus CS oder so. Wie geht denn das hier eigentlich? Weißt du, oh oh, oh oh. Hallo, ich würde den gerne retzen. Weißt du, ernsthaft, der guckt dann auch noch dahin, wo ich da das rumhampeln mache. Ich geh mal rüber zu A. Er scheint mir sinniger. Blyat. Ah, fuck. Hopp, hopp, hopp, hopp, hopp, hopp, high speed. Das sind schon die ersten. Sag ich doch. He, Kekkel. Oh, MonkaW. Okay, Leute, mir fällt nichts anderes ein. Motion Sensor und irgendwie Flanken. Mir fällt wirklich gar nichts anderes ein. Das ist zu viel von allen Seiten. Alter, ich bin weg und schon wach die Lege, Henne. Oh, ich bin im Motion Sensor. Kann das sein? Das ist ziemlich blöd von mir. Pst, pst, pst, pst. Ich höre nichts. Dachte, die kommen hier wieder her. Machen sie aber nicht. It's been destroyed. No shit. It's been destroyed. Ja meine Güte, ey. Wow, wow, wow, wow, wow. Sniper mal eine Runde. Ich sacken mit Sniper. Einzige Game, wo ich gut snipern konnte, war Bitshit 2. Oh, da kommt ein Panzer. Pass mal auf, den verarsche ich jetzt. Sobald er hier lang fährt, springe ich über den Zaun, dann sieht er mich nicht mehr. Pass mal auf, easy, easy, easy clap. Oh nee, jetzt legen wir das Ganze. Fuck. Shit, ich hab's probiert. Warum hab ich 24-5, Mann? Nicest Video hast mir Kommentare geschrieben. Ein nicest Kommentar und ein nicest Video, so muss das sein. Ja, das haben sie jetzt. Vielleicht kriegen wir's hin. Ich meine, ich mach die Rolle ganz gut ein Job. Moment, ich bin verwirrt. Welche Richtung denn jetzt überhaupt? Wait a minute. Ah, die Maps sieht überall gleich aus. Wo kommen die Gegner denn jetzt? Da? Okay, nice. Und hier kann man nicht rein, oder wie? Ich hatte wirklich null Orientierung auf der Map gerade. Und hier kommt man nicht raus, das ist natürlich doof. Oh, nein, nein, nein, du kannst mich nicht sehen. Fuck. Nice, und jetzt, und jetzt zurückkerzen, Leute. Revangiert euch. Nope, sind down. Okay. Nope, nope. Dann campen wir uns mal ne Runde ins Schiff, würde ich sagen. Und hopp. Ui. War der Kran hier schon immer? Bin irritiert. Ja, der war schon immer da, ne? Okay, das war so nicht geplant. Ich seh euch nicht. Wo seid ihr? Nice, nice, nice, nice, nice. Oh. Unten ist einer. No pass. Du denkst, du weißt, wo ich bin. Du denkst, ich weiß aber auch, wo ihr seid. Ich weiß, wo ihr seid. Ich weiß, wo ihr seid. Mein Motion-Sensor geht nicht mehr. Fuck. Na gut. Na gut. Es hätte durchaus funktionieren können. Oh, ich trau mich nicht. Das kriegen wir nicht, die Fuse. Doch, doch, doch. Nice, nice, nice, nice. Fuck. Good work. Das habt ihr nice gemacht, Leute. Ah. Ah. Ah. Monka. Ich hab keine Ahnung, wo das kommt, ehrlich gesagt. Pok-Teammates. Ja, Teammates, die was machen. Wahnsinn, oder? Das ist extremely... Mensch, Alter. Du kannst immer deine Waffenaufsätze ändern. Extremely Pok-Teammates. Oh, das ist schlecht. Das ist schlecht. Oder auch nicht. So funktioniert das, Nat-Max. Ich hab den falschen Aufsatz dafür. Oh, shit. Ah, Mensch. Einen hab ich net getroffen. Einen Schuss net und schon stehen wieder die ganzen Leute auf dem Dach. Mensch. Aber wisst ihr, was ich gut finde? Die Pistole hat sich gemerkt, dass ich im Autofeuermodus bin und daraufhin... Also, dass ich jetzt letzte Runde eingestellt hab und das hat die sich gemerkt. Hier sind doch noch mehr, oder? Hier sind doch noch mehr. By the way, ich wollte absolut nicht. Ja, ja, ja, ja, ja. Das war dumm. Ich hab mich getroffen. Mensch. Ich lasse nach gerade. So wird das nix. So wird das nix. Wo ist das? Wo ist das irgendwie? Also, ist der da? Seriously? Da oben auf diesem Kackkran, Mann. No Pass. Alter, ich hör... Geht es euch auch? Ich hör total viele Gegner um mich drumherum. Problem ist nur, die sind überhaupt nicht hier. Okay, letzte Base. Die probieren wir noch. Das ist auch schon 21 Uhr. Wisst ihr, was bald ist, Chat? 21 Uhr. Wisst ihr, was 22 Uhr ist? Gibt es zu, ihr wisst es. Ihr wisst es genau, was 22 Uhr ist. Bad Guild, korrekt. Fisch, danke schön für den Sub und danke für die ganzen Subs heute wieder. Ich hab leider nicht so viel mitbekommen, weil ich mich aufs Game konzentriert hab, ausnahmsweise mal. FJ, ja, geht so mittelauf. Hast du nicht mal mitgespielt und übelst geowned? Der Name sagt mir noch was. Ey, wirklich? Jetzt schon? Bis ich da bin, ist es doch schon längst weg. Da kann ich nicht hin, Leute. Das funktioniert nicht. Das funktioniert nicht. Machst du noch ein Video über mein Auto? Ja, ja, ja. Mach ich, mach ich. Ist in the making? Nee, nicht wirklich. Achtung, Achtung, kriegt 17. Ey, diesen Ding auf range, Mann. Ah, geht doch. Das war denn ein Headshot? Seriously? Wollt ihr mir wirklich erzählen, das war ein Headshot gerade. Ich hab einfach nur in die Richtung gesprayed. Easy. Ich weiß überhaupt nicht, wo was ist. Wo sind die? Mensch mein, ey, bist du schlecht geworden? Guckt euch das an. Ich hätte schon drei Gegner killen können. Ich treffe aber nichts. Alter. What the fuck? Aber trotzdem, ich bin immer noch erster. Bin ich zufrieden, ja? Was? Gartenstellens Video? Zeit offline zu gehen. Boomer müde, Boomer schlafen. Commander Krieger eben schon fast. Ja, so sieht es aus. Ey, es ist Übungssache. Das Boomer ist halt, ich würde das Game ja mehr spielen, aber ich kann es mir halt nicht so lange geben. Und auf Warzone habe ich auch absolut keinen Bock. Oh, was ist denn hier los, Mann? Ich sag's noch, die kommen gerne hinten hoch und da sind sie schon, Mann. Shit. Und die wollten mich ratzen und ich bin, ich hab released, ich kack noob. Richtiger noob. Any noobers? Als erstes programmier ich mal Map Selection für das Game hier. Muss mir nur Dice and Source Code geben, dann programmier ich Map Selection. Kein Ding, easy. Map Selection Progress. Würde ich den Ticken, würde ich den Ticken mehr üben, dann würde ich den Kram auch wieder besser treffen. Das ist halt wirklich kacke, das waren wieder drei tote Gegner, aber die war nicht tot. Ey, ich gezielt habe. Okay, nice. Also dieses Objective läuft tatsächlich ganz gut. Sind die down alle? Schaut so. Ich muss, okay, ich hab's jetzt rausgekriegt, ich darf einfach nicht so viel tolle Dauerfeuer abnehmen. Eine sehr sinnvolle Plattform. Die ist da sehr überlegt, platziert, die geht einfach nirgendwohin. Ich muss einfach mal ein bisschen mehr Burst schießen auf Range, dann ist die Muni nicht so schnell leer und das Ding verzieht nicht so krass. Ich bin einfach zu faul, ist das Problem. Oh oh, unter mir, ich hab sie gesehen, ich hab sie gesehen, Leute. Okay, alles down, nice. Jawoll, ich komm' unter. Ah, wir haben's, nice, wir haben's. Das ist das neue Battlefield, ja. Ich wollte eigentlich in das Tor daneben, aber das hat nicht so ganz funktioniert, wie ich mir das vorgestellt hab. Oh, hallo, ich möchte dich spotten. Spotten geht nicht, nice, GG. By the way, ich hab' Space gedrückt, vielleicht kann man den nicht deployen, wenn man sich grad was spritzt. Wie am Frankfurter Hauptbahnhof, da deploit auch keiner während er sich gerade was spritzt. Nee, wie, die schaffen das jetzt noch. Nixes, Leute, Nixes. What the fuck, man? Oh, shit. Das war's. Oh, man. Oh, man. Oh, man. Oh, man. Oh, man. Oh, shit. Da kommen 30 Millionen Gegner. Keine Chance, das ist zu viel, das ist zu viel am Start gerade. Weil wir hätten's schaffen können, wir hätten's schaffen können. Aber ich glaube, es ist, jetzt ist lost. Jetzt ist lost. Komm, einmal, einmal. Jawoll, jawoll, jawoll. Give me, give me, give me. Okay, GG Eats. Ich wollte grad sagen, fall back. Die Runde ist fertig. Guckt euch mal den Chat an wieder. Moron Team Trash. Ich weiß ja, in dem Game geht es halt absolut um gar nichts. Es gibt keinen Rank, es gibt keine KD-Statistiken, keine öffentlichen Top-Lists, es gibt nichts. Und trotzdem rasten die Leute voll aus. Immerhin ganz gute Runde. Solide Runde. Ja, dankeschön. Also, weil ich weiß, dass du richtig gut im Spiel bist. Ich denke mir halt immer so, wenn ich einfach ein bisschen mehr spielen würde, dann würde ich halt auch so die Basics wieder ein bisschen besser drauf haben. Also nicht zu früh aufhören zu schießen, nicht Gadgets switchen, wenn man sie nicht switchen soll und so was. Aber ich hab keinen Bock, das Spiel länger zu spielen. Und nachdem ihr auch gerade kein anderer Shooter großartig Spaß macht, ist halt, wie ich es euch prophezeit habe, Pepega Aim angesagt. Und das wird es auch die nächste Zeit noch sein. Du nutzt doch X und Firefox, ja? Nee, Crash hatte ich auch nicht. Text highlighted. Aber vielleicht kommt ja irgendwann mal wieder ein gutes Battlefield. Suchst du noch jemanden für Squad? Nee, die letzte Runde. Die Basics, ja, dann gehen wir auf den Mount Everest. Dann ist alles klar. Easy. Ich habe ein bisschen drauf spekuliert, dass mir Warzone 2 Spaß macht. Macht es aber nicht. Vor allem, dass der Gulag jetzt zwei Mal ist, das zwei ist, gefällt mir gar nicht. Ach guck mal, Kaleidoskop. Ob das hatten wir heute noch gar nicht? Haben in Battlefield die Visiere eigentlich irgendeinen Nachteil? Ist da ADS langsamer? Nee, glaub in dem Fall gar nicht, oder? Nö, nicht wirklich. Was sagst du, Squad Battlefield? Nee, ganz ehrlich, Battlefield 2042 ist einfach kein fertiges Game und vor allem hat es auch keinen Inhalt. MW2 gibt sich Mühe, auch wenig Inhalt zu bieten, aber MW2 ist irgendwie noch ein halbwegs funktionables, zusammenhängendes. Sag mal, sind die gelieft? Die haben vier Bots im Gegnerteam. Ha, zwei Bots gekillt. Wie auch immer, das angeblich doppelte Headshot war. Okay. Schon mal DMZ gespielt? Ja, eine Runde und ich hab auf einmal nen Kill bekommen, obwohl ich dachte, es ist ein Bot und ich mag so Modi nicht, wo die Sachen so gemischt sind, Bots und Spieler. Ich hab dich draußen genau gehört, Kollege, kommst du rein? Ich hab ein Problem, Leute, ich hab ein Problem. Ich habe ein Problem, die können in der Mitte runter springen und hier reinkommen. Alter, wenn ich noch nicht mal nen geradeaus laufenden Gegner killen kann, dann ist wirklich vorbei. Hier ist zu viel. Da oben ist er. Okay. Guckt es euch an, normalerweise hätt ich nen EZ gehabt, aber nicht mit PP-Gar. Okay, ich bin nicht ganz sicher. Da war doch noch einer, oder? Wow. Jetzt rettet er die, ich fass es nicht. Ich will ja nicht zwangsläufig was spielen, was easy ist. Also jetzt nicht irgendwie so nach dem Motto, wo du nicht mal geradeaus aimen können musst oder laufen kannst und machst irgendwelche Kills. Aber Warzone ist schwer zu sagen. Das erste hab ich ja noch halbwegs gerne gespielt, muss ich sagen. Das war mir noch mit so das liebste Battle Royale zum Selbstspielen, weil ich ja überhaupt kein Battle Royale Fan bin. Aber das zweite gefällt mir nicht, die Map gefällt mir nicht, das Gulag-System gefällt mir nicht, dieses Bot-Load-Out-Zeug gefällt mir nicht. Ich weiß eh, gefällt mir Warzone 2 nicht. Vielleicht müsste ich es mal wirklich im Squad mit den richtigen Leuten gescheit spielen, dann vielleicht. Wäre ja möglich. Ah Shit, dachte ich klickte da noch was. Der neue Gulag ist Müll. Sind alle weg? Ok, alle weg. Und ich bin halt, das kommt halt noch dazu, ich bin halt kein Battle Royale Enjoyer. Ich mag Battle Royale an sich schon nicht. Ich hab halt Warzone gespielt, weil das, das gab ja sonst nicht viel. CS bin ich auch durch. Aber jetzt nochmal mit anfangen, nach den Jahren. Ich hab ja recht viel gespielt vor ein paar Jahren. Guckt euch das an man. Guckt euch das an, ich treffe nichts mehr. Hui, wuuuuh. Vorher spiel ich mit dem Controller App. Da ist er, oder? Johnny Depp ist da. Bestimmt der echte, was mein ich? Bestimmt muss der echte sein. Ich glaub Johnny Depp hat nichts besseres zu tun als Battlefield zu spielen. Bestimmt. Bestimmt der aller echte. Panic Attack. Was ist das? Panic Attack. Ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gefällt. Leider ist nicht der Fall. Und ich hab halt dementsprechend keine Übung. In Battlefield krieg ich keine, aber ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen Henry Cavill wird es bestimmt spielen, ey der Typ war der einzige Grund warum ich mir die Witcher Serie überhaupt angeguckt habe und die warst du ja nicht sonderlich gut. Aber der war wirklich gut und man hat ihm finde ich auch angemerkt dass er die Vorlagen mochte, leider hat er sonst nicht so viel hergegeben. Aber warum er raus ist kann man glaube ich nur mutmaßen, vielleicht haben sie ihm einfach für Superman mehr Geld geboten. Alter was ist mit dem Heli hier wieder? Ich glaube es wird Zeit zum Stinger Noob zu werden. Ich glaube wir müssen zum Stinger Noob werden. Ich weiß nicht genau von wo wir beschossen werden, von wo werden wir dann beschossen? Was da her? Rauf aufs Dach man! Dachstelz, gib ihm! Dachstelz lass mich raus! Lass mich rein je nachdem wie man das sieht. Pass auf ich predikte was passiert. Vor der Tür sind jetzt drei Schilder aufgestellt und dahinter campen fünf Leute. Wenn irgendwie so was in der Richtung ist jetzt. Okay es waren keine Schilder aufgestellt, aber dieser Punkt ist so unglaublich dumm man. Was macht ihr hier oben? Bringt doch überhaupt nichts. Das ist keine Granate, das ist ein Motion Sensor, den habe ich absichtlich vorher geworfen. Okay konnte man nicht da, Moment, Moment meine Leute, man konnte doch. Moment, wo kommt man rüber mit der Zipline? Hier? Nee, wait a minute. Hat das hier nicht auch einen? Ich kenne das hier auch nicht mehr. Hat das hier nicht auch einen Fahrstuhl und man kann dann rüber, rüber zipline? Doch, oder? Du hast ja mal Glück gehabt. Nimm doch die Treppe, es gibt keine Treppe. Oder gibt es eine Treppe? Wäre mir neu, dass es eine Treppe gibt. Oh da drüben, da drüben sitzt schon wieder. Johnny Depp. Reds please, ich liege direkt neben dir. Wolfschnitzel, bester, bester Mann. Also hier müsste man halt was killen, was gekillt bekommen. Kann man, ah shit, vielleicht geht das? Nice. Nee hier rüber kannst du nichts, kannst du vergessen. Ich habe eine Idee, pass mal auf, ich habe eine YOLO Idee. Fuck, ich noob, nein. Hä geht das nicht? Hä? Das geht nicht. Man kann aus irgendwelchen Gründen nicht so richtig da dran hochdingen. Das ist natürlich doof gewesen. Ich wollte eigentlich rüber springen mit dem Ding hoch, aber ja, das Timing nicht drauf gehabt. Ja, da müssen wir wieder hier rauf. Gedanke 1, Ausführung 0, so sieht es aus. Eigentlich 5 head play, aber da kam auf jeden Fall auch noch dabei, aber es ist irgendwas nicht stimmt, wenn man den Enterhang durch den Fallschirm schießen will. Wie viele Tickets haben wir eigentlich noch? Oh, 19. Übrigens, irgendjemand bei DICE dachte sich, es ist eine gute Idee, die Dinger da oben aufs Dach zu packen. Super Idee, oder? Findet ihr nicht auch? Absolut high IQ plays. Ok, noch mal. Pack, das funktioniert so nicht. Ich muss an den Fallschirm canceln und dann schießen, sonst klappt das nicht. Aber anders klappt das auch so nicht, also wir können das ruhig ein paar Mal probieren. Anders kommt man da eh nicht rauf. No one is pushing in. Ja, Master Monty, was meinst du, woran das liegt? Ah, funktioniert richtig gut das Game teilweise. Richtig, richtig gut. Die haben übrigens unseren Heli geklaut, seh ich da grade. What the fuck? Bestes Map Design, nice, nice. Am nice husten. Also exquisite das Map Design hat man wieder gesehen, richtig gut durchdacht. Stundenlang, ich kann das auch nicht stundenlang spielen, ich kann das jetzt einmalig hier im Stream 2-3 Stunden spielen, ok. Aber stundenlang ist für mich, ich kann 8 Stunden am Tag grinden für Monate. Das kann ich mit dem Spiel nicht. Dann würde ich auch wieder ein bisschen was treffen wahrscheinlich. Ne, an mir lags glaube ich auch nicht. Man kann das schaffen, also ich hab es letzten schon gesehen, dass das eingenommen wurde. Also die letzte Base, aber es ist schon, es ist echt bescheuert gemacht. Könnt ihr euch noch dran erinnern, als man dort mit dem Hovercraft 90 Grad an der Wand hochfallen kann? Ich finde es doof, dass es nicht mehr geht. Ich brauche ein gutes MMO, ja. Ich werde wieder Dark Free Shards spielen, ab dieser Woche bzw. dann ab Dezember wieder vermehrt. Das werde ich nicht unbedingt streamen, aber da hab ich wieder was zum, NOSHA CADDLES zum Schluss Leute, das geben wir uns nochmal. Ich hoffe wir sind Attacker und die erste Base läuft gut. Die Spielerzahlen von BF4, 1, 5, Steam Charts kannst du gucken. Steam Charts. Gib mal einfach ein Steam Charts. Oder was, Steam Stats? Ne, Steam Charts. Steam Charts Battlefield 1. Ja Battlefield 4 geht so. Battlefield 4 ist jetzt nicht wahnsinnig hoch, aber Battlefield 1 und 5 sind extrem gestiegen die letzten paar Wochen, das siehst ihr jetzt. Battlefield 1 ist jetzt weniger, wobei Battlefield 1 immer, äh nicht Battlefield 1, Battlefield 4. Battlefield 4 ist immer noch gut, gut, ähm, ah wir sind Defender, das ist blöd. Kann man mittlerweile eigentlich wechseln? Geht das? Könnte ich jetzt sagen ich will Attacker werden? Geht das irgendwie F vielleicht? Ne, gell. So, Legacy Features gibt's hier nicht. Sowas gibt's nicht, das kann man, wer, wer braucht sowas auch Teams wechseln? Ich meine, da könnten die Leute ja Spaß dran haben an dem was sie spielen. Ne, ne, ne, sowas. Sowas gibt es nicht. Spaß, ich glaub es geht los. Bus 12. Hallo, ist das ein Bot? Ne, das ist kein Bot. Die machen's richtig, die fliegen rüber. Woah! Ich glaub ich hab legit noch nie damit ein Treffen sehen. Wo sind, was ist denn hier los? Wo sind die Leute? War da was? Aber da war da was? Ja, da. Ich würde gern zu abwechselnd mal einen Spieler sehen. Spieler wäre nice. Auf der anderen Seite. Ne, das geht nicht. Du bist eigentlich bei dem Battlefield nicht angefragt Partner zu sein, doch. Aber ich hab das Spiel zu sehr geflamed, die laden mich zu nichts mehr ein, das kannst du vergessen. Was ich auch verstehen kann, aber es stört mich nicht. Besser als ich muss hier irgendwie Zeug über das Spiel erzählen, was es halt nicht ist. Ja Mist. Sag mal, von wo denn alles hier? Ok, ich glaube es wird Zeit, dass wir mal ne Runde, ah Mist, ja, das hab ich jetzt nicht gesehen, dass der da ist. Wird Zeit, dass wir mal ne Runde. Ne, da muss ich die Midi-Pen aufgeben. Egal, mit Fahrzeugen ist eh Schluss ab der nächsten. Wer ist? Mein Außer Außer Heli, der Heli geht uns wahrscheinlich weiterhin richtig auf den Keks. Das kriegen wir nicht. Ok, ich brauch nen Stinger. Das kannst du ja vergessen grade. So, wo haben wir denn den? Was ist denn da von der Stinger Leute? Gibt's überhaupt einen? Ja, da. Wo ist der Heli? Kein Heli mehr am Start, einmal das Stinger. Da ist er. Ja, das soll sich mal ganz schnell verpissen, der Dude. Was, von wo? Fuck, muss ja alles machen hier. Stingern, Gegner killen. Wo ist er denn? Oh, Lul, Kekl. Komm mal da flährt der Kacknuber, guckt euch an. Wo ist er? Wo ist er? Mir egal, ich geier den Helityp jetzt bis. Kannst ja so nicht gescheit spielen da. Wie soll das funktionieren? Ich werde jetzt zum Heli geier 9000. Der wird so abkotzen, Alter. Der wird so abkotzen. Der wird so abkotzen, ich schwörs euch. Alter Pech. Ich wach dem das komplett zur Hölle jetzt die Runde. Ich wach dem die komplette Runde zur Hölle, Leute. Der kriegt keinen Kill mehr, der Helityp. Wie, ich bin schon wieder revealed? Na toll. Ich will nicht revealed sein, man. Hör auf mich zu revealen. Oh ne, Helityp hat mich gekillt. Ja, das aber schon. Man muss ein bisschen mehr mit Stinger geiern, sonst wird das nix. What the fuck? Wo ist er hin? Ist der Helityp verreckt? Ich hör keinen Heli. Ah shit. Nope, ich glaube nicht, dass mich da einer arrestt oder? Ich mein wir haben noch nicht mal einen Verteidigungs Heli, das ist richtig dumm, Alter. Richtig dumm. Fuck, jetzt sehen sie mich. Shit. Oh, oh, oh. Siehste, das sind die Dinger. Ich hätte locker noch drei Kills machen können, hätte ich gar nicht was getroffen. Aber ich werd dem Helityp so auf den Sack gehen. Wo auch immer. Ah, das ist der, das ist der Möwe. Ach, das ist der Heli. Oh, oh, oh, oh. An A ist da was. Oh, ist ein Heli kaputt? Das tut mir aber so leid. Randa. Fuck. Oh, wir haben's, nice. Ein nicer Diffuse. Pock Diffuse. Moment, ich hab keinen Heal mehr, shit. Ich bin da zum Heli-Geierer geworden. Ich bin jetzt one shot. Warum ist denn der Typ eigentlich immer noch da? Warum ist denn der immer noch da? Pass auf, der kommt gleich wieder, der Heli-Dude. Wo ist der Heli-Dude? Da ist er, pass auf. Guck mal da. Ey, der wird so kurzen. Oh Mist. Krieg ich einen Rätsel? Ich bin direkt neben dir. Kollege, ich bin direkt neben dir. Kann man um Hilfe rufen irgendwie? Please, Leute, ich bin direkt um eure Ägyle, da liegt nichts. Come on, lass doch nicht von dem kack Heli killen. Jetzt ist er down. Oh Gott. Leute, ihr stellt euch an. Der Heli fickt euch, ihr müsst auch zum Stinger-Bob werden wie ich. Anders geht das nicht, so wie gewinnt das nicht. Stinger. Du verlierst, wir verlieren das nur wegen dem Heli. Guck, sobald ich nicht da bin und den Heli irgendwie runtergeiern kann, dann kriegen wir uns ab und legen henne, legen henne, Meister legen henne, da legen henne Meister. Fuck, hat er funktioniert können. Da ist der Heli wieder. Das Stinger-Verhalten sieht auch ziemlich pepega aus. Was? Oh Mist, ich habe keine Muni mehr. Was ist da unten los? Monkeys. Kann man da hoch? Nö. Ja, auf geht's. Mensch, wir sind im Battlefield. Na, da machst du nichts. Ich bin nicht zu, ich habe nicht die Erfahrung den Heli zuzuhören. Du hast recht, ich muss warten bis die Flares raus sind. Das ist schon richtig. Aber wenn der Heli schlau ist, dann wird das nix. Wo ist der Heli, Dude? Ist der Heli gerade gecrashed? Gut, gut, Chet. Ja, jetzt hatte ich keinen Heal. Gut, Chet, dass ich mich dran erinnert habe zu warten, bis die Flares raus sind. High IQ Plays. Chet, denk mit. Okay, Alter, siehst du ja nix hier. War safe ein anderer im Heli, der war jetzt schlauer. Ist doch gut, ist doch gut. Wir hätten schon längst gewonnen ohne den Heli. Ich meine, die letzte Base ist, ja, geht, kann man eigentlich ganz gut defenden. Oh, was ist das? Mensch, ich brauch meinen Heal, das ist das Dumme. Oh, ich bin down. So schnell komm ich da nicht weg. Die Legehände ist am Start. Ich geh jetzt in den Tank, wir müssen in den Tank von dem. Wir klauen den Tank, Leute, Tank klauen. Ach, fuck man. Alles musst du selbst machen. Voll den Tank von dem klauen, das wäre das Beste. Ich möchte bitte an F2. Ja, Dankeschön. Da haben wir nämlich irgendein Tank. Schonmal viel besser. Ah, nee, da können wir kein Damage machen. Was denn da? Jetzt lässt sich hier gar keiner mehr blinken. Ja, macht ruhig euren Tank kaputt, soll mir recht sein, alles okay. Ich bleib hier drinnen. Macht euren Tank kaputt, gut. Wir brauchen ihn wieder, bis er respawn. Fahrt ihr einfach bei uns in die Base und dann kriegt ihr euren Tank nie wieder. Oh, links war was, shit. Ich muss heilen. Shit, ich bin fast down. Please heal. Oh, fuck. Ist das die AA von den Defendern? Nee, oder? Da ist doch gerade ein Gegner mit rangefahren. Oder hatten die unser Ding? Dann habe ich es vielleicht falsch eingeschätzt, das kann sein. Okay, A kriegen wir wahrscheinlich nicht mehr. Man kann es mal probieren. Nein, keine Chance. Das wäre B, das wäre B. Oh, nee, Alter. Einmal machst du es nicht selbst. Alles musst du selber machen. Also es sah für mich so aus, als sind die Gegner rangefahren damit. Ja, jetzt ist vorbei. Bam. Wir haben uns gefusst. Na gut, die legen jetzt gleich wieder. Alter, wir haben uns gefusst. Nein, wir haben uns gefusst. Alter, wie ich habe das nicht gefusst? Ich habe das nicht gefusst? Ich habe da doch eine halbe Stunde drauf gedrückt. Warum war das nicht gefusst? Ich stand da doch eine halbe Stunde dran. Oder darf man mittlerweile nicht mehr schießen in dem Game beim diffusen? Er hat abgebrochen. Ah, geil. Es ist ja nicht handicap genug, dass man einfach nur dastehen muss und gerade ausgucken. Aber schießen darf man scheinbar auch nicht mehr. Na ja, gut. Mehr konnte ich echt nicht machen. Ich habe den Typ runtergestingert, wie sonst fast. Der hat gekotzt, ey, der Helityp. Ich sage es euch. Der hat gekotzt. Oder sonst fast alles gemacht. So muss das sein. Wenn man das jetzt jeden Tag ein paar Mal machen würde, dann würde man wahrscheinlich auch wieder was treffen und hätte ein bisschen Timing in dem Spiel. Aber da müsste man spielen und ich habe eigentlich ehrlich gesagt jetzt schon kein Bock mehr. Das soll ich viel weiter zu spielen. Manifest. Oh, wir haben Leute 2153. Mal gucken, ob wir Attacker sind. Manifest habe ich ewig nicht gespielt. Das ist die nächste Map, die überarbeitet wird, Leute. Und die Map hat jetzt schon zu wenig Container, deswegen bekommt die noch mehr Container jetzt. Wir sind Attacker. Okay, vielleicht gucke ich mir das noch mal an. Ist das Game immer noch Trash? Ja, ehrlich gesagt schon. Aber für einen Zehner oder maximal so 20 Euro kann man sich das mal gönnen, wenn man Battlefield-Fan ist und gerne ab und zu mal ein bisschen was Battlefield-artiges spielt. Aber ansonsten, ne. Leute, die überarbeiten die Map mit noch mehr Containern. Ich gucke mal kurz, wie die ersten, die sind wieder alle gelieft. Jetzt haben wir wieder irgendwelche 4-4 Bots hier. Ach, meine Waffe ist ja richtig. Ja, ja. Hopp, hopp, hopp, hopp, alles gut. Okay, der letzte Schutz einfach straight durchgegangen. Null. Bots. Tackle. What? Ja, es ist komisch, dass er alles im Rucksack hat und dass er die Waffe umbauen kann. Weird. Alter, wie schlecht ist bitteschön diese Kanone? Nice. Oh, ich hab noch den Stinger. Ich hab noch den Stinger dabei. Das ist glaube ich so ziemlich das Unsinnigste. Das Unsinnigste, was es so gibt hier, der Stinger auf der Map. Stinger ist wirklich komplett unsinnig hier. Alter, da ist immer noch ein Bot drinne. Okay, auf Bot-Games hab ich kein Bock. Die Bots gibt es doch einzig und alleine nur, dass die nicht merken, dass das Spiel keine Sau mehr spielt. Das war von Anfang an der Plan, falls es rein scheißt das Spiel, dass du immer noch Bots hast. Ah, jetzt ist es aufgefüllt. Jetzt sind die drei Bots wieder raus. Okay. Also, Bots waren wirklich so eine dumme Idee, Mann. Richtig dumm. Achtung, Long-Range. Okay, Long-Range alleine bringt noch nichts. Short-Range. Und wieder weg. Oh, oh. Blöde Idee, da rauszugehen. Die Bots sind da, dass die meisten Noobs besser ... Ja, ja. Und halt, auch wenn es keiner mehr spielt, dass du es halt noch spielen kannst. Und dass man Waffen anlocken kann. Ja, super. Kommt da grad vor um die Ecke. Und dass man Waffen anlocken kann. Man konnte sich ja, weiß nicht, wahrscheinlich geht das immer noch, man konnte sich auf Kaleidoskop oben hinlegen und die Bots killen an dem Lüftungsschacht vorbei. What? 46, null. Ach, die Stinger, ich hab immer noch die Stinger dabei. Ich bin richtig dumm. Richtig hängen geblieben. Echter Stinger, Bob. Okay, jetzt pack ich die Stinger weg. Alter, warum hab ich 13,3 und eine andere 3,6? So, Stinger, Stinger wird weggepackt. Stinger braucht man hier echt nicht. Stinger stinkt, weg. Ähm. Medipen, oder? Den könnte man ein bisschen schneller beschleunigen. Ach, das war gar kein Gegner. Habt ihr den Track, na geil, habt ihr den Track gesehen? Ich dachte, das ist ein Gegner, der da rennt. Ja, das Menü ist, das sieht nicht nur unübersichtlich aus, das ist unübersichtlich. Mega unübersichtlich ist das. Okay, jop. Alter, ich sollte mal ein bisschen mehr bewegen, wenn ich da oben drauf rumstehe. Oh, nicer Flank, high IQ Flank, Leute. Sehr schlauer Flank. Ach, shit, Alter. Leute, pusht mal ran. Die haben viel zu viel Zeit auf den Dächern rumzugucken. Jawoll, jawoll, jawoll. Push, push, push, push. Shit. Okay, Team hat wirklich keinen Bock, ran zu pushen. Der hier, hä? Der da? Nice. Das kriegen wir jetzt, das kriegen wir jetzt, Alter. Machen Morschen-Sensor hin, da hinten kommt einer. Alter, ich fasse das nicht. Ey, du musst alles selber machen, Mann. Alles, alles. Diffusen, Defenden, Morschen-Sensor, Alter. Ah, was ne Runde. Schlimm. Johnny Depp hat wieder mitgespielt. Okay, jetzt reicht es aber für heute echt genug. Yep, Clock. Unten sehe ich schlechter, das ist schön zu lesen. Oh, weg. Schluss für heute. Ach so, wir wollten noch diesen komischen. Okay, mal machen wir das jetzt noch schnell. Gucken wir mal. Okay. Ups. Alter. Alter, Alter, Alter. Alter. Okay, 177. Ich glaube, das ist ganz gut. Für fast 40 geht das glaube ich durch. Immerhin, eben irgendwas muss ich ja gut sein. Okay Leute, wir sehen uns im nächsten Video. Bis dahin, machts gut.", "segments": [{"id": 1, "start": 0.0, "end": 8.0, "text": "Ich verstehe das direkte Login hatte von 20 Jahren, wie es jetzt anscheinend nicht mehr hiebt, aber ernsthaft."}, {"id": 2, "start": 8.0, "end": 13.0, "text": "Map Selection, please, bitte. Map Selection."}, {"id": 3, "start": 13.0, "end": 16.0, "text": "Breakthrough mit 64 Mann ist halt nicht spielbar."}, {"id": 4, "start": 16.0, "end": 19.0, "text": "Conquest mit 128 Mann ist nach wie vor nicht mein Favorit."}, {"id": 5, "start": 19.0, "end": 22.0, "text": "Aber ich würde gerne meine Lieblingsspielmodel spielen."}, {"id": 6, "start": 22.0, "end": 24.0, "text": "Und zwar Rush und zwar auch der neuen Map."}, {"id": 7, "start": 24.0, "end": 27.0, "text": "Wo ist das Problem? Warum ist das so ein Hexenwerk?"}, {"id": 8, "start": 27.0, "end": 32.0, "text": "Eine Map Selection hat, dass die Spieler eben ihre Lieblingsspielmodel auf der neuen Map..."}, {"id": 9, "start": 32.0, "end": 37.0, "text": "So, heute geben wir uns tatsächlich nochmal eine Runde Battlefield 2024."}, {"id": 10, "start": 37.0, "end": 39.0, "text": "Sag mal, höre ich mich selbst im Hintergrund?"}, {"id": 11, "start": 39.0, "end": 41.0, "text": "...portal aber zurückkehren..."}, {"id": 12, "start": 41.0, "end": 44.0, "text": "...aber warum? Einfach warum? Ich verstehe es nicht. Soll ich das für euch..."}, {"id": 13, "start": 44.0, "end": 46.0, "text": "Warte mal."}, {"id": 14, "start": 46.0, "end": 49.0, "text": "Dice, meldet ernsthaft. Kein Spaß bei euch. Dice, meld euch mal."}, {"id": 15, "start": 49.0, "end": 51.0, "text": "Ah!"}, {"id": 16, "start": 51.0, "end": 55.0, "text": "Ich habe ein paar mal mein eigenes Video laufen im Hintergrund."}, {"id": 17, "start": 55.0, "end": 59.0, "text": "Ich denke mir die ganze Zeit schon, Max, warum hörst du dich selbst im Hintergrund?"}, {"id": 18, "start": 59.0, "end": 61.0, "text": "Was schmerzen?"}, {"id": 19, "start": 61.0, "end": 64.0, "text": "Ich habe mein eigenes Video laufen, ja."}, {"id": 20, "start": 64.0, "end": 68.0, "text": "Gut, ich mache das immer an, wenn es mir auf YouTube empfohlen wird, weil View-Time."}, {"id": 21, "start": 68.0, "end": 70.0, "text": "Aber..."}, {"id": 22, "start": 70.0, "end": 73.0, "text": "Ja, da muss ich mich nicht wundern."}, {"id": 23, "start": 73.0, "end": 76.0, "text": "Wir gucken uns das jetzt hier zur Einstimmung."}, {"id": 24, "start": 76.0, "end": 79.0, "text": "Zur Einstimmung, Leute, bis das Stream richtig losgeht."}, {"id": 25, "start": 79.0, "end": 82.0, "text": "Gucken wir uns zusammen mal ein Video von heute an."}, {"id": 26, "start": 82.0, "end": 85.0, "text": "Das ist die 2042 Season 3 raus."}, {"id": 27, "start": 85.0, "end": 89.0, "text": "Und ich dachte mir so, es ist zwar heute kein Video geplant, aber ich setze mich jetzt mal ganz spontan hin."}, {"id": 28, "start": 89.0, "end": 93.0, "text": "Und nehme dazu ein paar Takte auf, was es auf mich so einen Eindruck gemacht hat, wie ich das Ganze so finde."}, {"id": 29, "start": 93.0, "end": 96.0, "text": "Und ich fasse mich auch kurz, weil ich will mich..."}, {"id": 30, "start": 96.0, "end": 99.0, "text": "Wir gucken uns jetzt mal ein Video an."}, {"id": 31, "start": 99.0, "end": 101.0, "text": "Live-Reaction."}, {"id": 32, "start": 101.0, "end": 105.0, "text": "...ich immer wiederholen, wir wissen alle, das Game hat immer noch mit vielen Problemen zu kämpfen."}, {"id": 33, "start": 105.0, "end": 108.0, "text": "Das ist, glaube ich, allen klar, da muss ich nicht..."}, {"id": 34, "start": 108.0, "end": 112.0, "text": "Wer es genau wissen will, was mir an dem Spiel nicht gefällt, kann sich einfach meine letzten Videos..."}, {"id": 35, "start": 112.0, "end": 116.0, "text": "...meine letzten, letzten Videos zu Battlefield 2042 anschauen."}, {"id": 36, "start": 116.0, "end": 120.0, "text": "Und wenn es euch gefällt, dann wisst ihr, ich freue mich unglaublich über jedes Abo und jedes Kommentar."}, {"id": 37, "start": 120.0, "end": 124.0, "text": "Ihr wisst, wie wichtig das ist für Content-Creator, auch was den YouTube-Algorithmus angeht."}, {"id": 38, "start": 124.0, "end": 128.0, "text": "Also gebt euch einen Ruck, drückt den Abo-Button, schreibt einen Kommentar, wenn euch das Ganze gefällt."}, {"id": 39, "start": 128.0, "end": 131.0, "text": "View-Time, View-Time. Aber was heißt boosten?"}, {"id": 40, "start": 131.0, "end": 137.0, "text": "Ich will nicht, dass es zu negativ kommt, weil ich denke, dass DICE auch mit diesen drei wieder auf einem ganz guten Weg ist."}, {"id": 41, "start": 137.0, "end": 138.0, "text": "Aber eine Sache..."}, {"id": 42, "start": 138.0, "end": 143.0, "text": "Ja, wir gucken uns so als Einstimmung jetzt fünf Minuten nochmal ein Video an, bis das Stream richtig angelaufen ist."}, {"id": 43, "start": 143.0, "end": 145.0, "text": "Da wisst ihr auch alle, was ich bis jetzt von der aktuellen Season denke."}, {"id": 44, "start": 145.0, "end": 148.0, "text": "Muss ich mir echt mal von der Seele reden. Und zwar..."}, {"id": 45, "start": 148.0, "end": 151.0, "text": "DICE, wollt ihr mich eigentlich veräppeln?"}, {"id": 46, "start": 151.0, "end": 158.0, "text": "Ich verstehe, dass ihr Technologien hattet vor 20 Jahren, die es jetzt anscheinend nicht mehr gibt. Aber ernsthaft..."}, {"id": 47, "start": 158.0, "end": 160.0, "text": "MAP Selection, please..."}, {"id": 48, "start": 160.0, "end": 161.0, "text": "Emily, zwei Dankeschön."}, {"id": 49, "start": 161.0, "end": 162.0, "text": "MAP Selection."}, {"id": 50, "start": 162.0, "end": 163.0, "text": "50 Milliarden."}, {"id": 51, "start": 163.0, "end": 169.0, "text": "Nur mit 64 Mann ist halbwegs spielbar, Conquest mit 128 Mann ist nach wie vor nicht mein Favorit, aber..."}, {"id": 52, "start": 169.0, "end": 174.0, "text": "Ich würde gerne meine Lieblingsspielmodus spielen, und zwar Rush, und zwar auf der neuen MAP."}, {"id": 53, "start": 174.0, "end": 178.0, "text": "Wo ist das Problem? Warum ist das so ein Hexenwerk, eine MAP Selection einzubauen?"}, {"id": 54, "start": 178.0, "end": 180.0, "text": "Ja, warum? Max, erklär's uns."}, {"id": 55, "start": 180.0, "end": 183.0, "text": "Dass die Spieler eben ihren Lieblingsspiel auf der neuen MAP, zum Release der neuen MAP spielen wollen."}, {"id": 56, "start": 183.0, "end": 186.0, "text": "Das ist doch nicht so weit her, das muss in Schweden doch auch einleuchten."}, {"id": 57, "start": 186.0, "end": 188.0, "text": "Ja, man kann eventuell..."}, {"id": 58, "start": 188.0, "end": 190.0, "text": "Den leuchtet da glaube ich nichts mehr ein."}, {"id": 59, "start": 190.0, "end": 196.0, "text": "Aber warum? Einfach warum? Ich versteh's nicht. Soll ich das für euch programmieren? Ich mach das, DICE."}, {"id": 60, "start": 196.0, "end": 199.0, "text": "DICE, meldet ernsthaft. Kein Spaß weiter. DICE, meldet..."}, {"id": 61, "start": 199.0, "end": 201.0, "text": "Das wär doch mal was, oder Leute?"}, {"id": 62, "start": 201.0, "end": 208.0, "text": "Wir programmieren im Stream MAP Selection für Battlefield 2042. Das Problem ist nur, wir haben keinen Zugriff auf den Source Code."}, {"id": 63, "start": 208.0, "end": 210.0, "text": "Hält euch bei mir."}, {"id": 64, "start": 210.0, "end": 213.0, "text": "Wisst ihr, hätten wir Zugriff auf den Source Code, da könnte man sogar ein gutes Spiel draus machen."}, {"id": 65, "start": 213.0, "end": 218.0, "text": "Los, ich bau eine MAP Selection in das Spiel ein. Komplett gratis. Mach ich. Easy."}, {"id": 66, "start": 218.0, "end": 223.0, "text": "Ruf mich an. Schreib mir den PN. Sag Bescheid. Ich mach das."}, {"id": 67, "start": 223.0, "end": 229.0, "text": "Wie easy das ist, würde sich dann zeigen. Aber ich glaube nicht, dass es sonderlich schwer sein kann."}, {"id": 68, "start": 229.0, "end": 235.0, "text": "Ach ja, und übrigens, der aktuelle Anti-Cheat von Battlefield 2042 macht Shadowplay kaputt."}, {"id": 69, "start": 235.0, "end": 239.0, "text": "Deshalb musste ich heute ein bisschen umständlich über OBS captchern. Ich hoffe das funktioniert."}, {"id": 70, "start": 239.0, "end": 245.0, "text": "Also nicht wundern, wenn euer Shadowplay den Abgang macht, dann liegt das höchstwahrscheinlich am Anti-Cheat von Battlefield 2042."}, {"id": 71, "start": 245.0, "end": 252.0, "text": "Neue Season ist am Start. Das heißt, es gibt wieder eine MAP und einen neuen Specialist und ein paar neue Waffen und ein paar Vault Waffen."}, {"id": 72, "start": 252.0, "end": 256.0, "text": "Im Detail sieht das folgendermaßen aus. Neuer Specialist, das ist Peter vom Microsoft Gold Support."}, {"id": 73, "start": 256.0, "end": 257.0, "text": "Mega Job, Max."}, {"id": 74, "start": 257.0, "end": 263.0, "text": "Neuer Assault Specialist mit einem Granatwerfer. Es gibt eine neue MAP Spearhead. Das ist auch das, was ihr im Hintergrund seht."}, {"id": 75, "start": 263.0, "end": 266.0, "text": "Das ist das, was wir heute auch die ganze Zeit spielen werden."}, {"id": 76, "start": 266.0, "end": 272.0, "text": "Peter hat zu drei neue Waffen, zwei neue Vault Waffen. Das heißt, Vault Waffen sind diese Copy-Paste-Sachen aus alten Games."}, {"id": 77, "start": 272.0, "end": 276.0, "text": "In dem Fall ist es jetzt die LMG-Variante von der XM8 und die AN-91."}, {"id": 78, "start": 276.0, "end": 282.0, "text": "Das ist, wenn ich es noch ganz richtig in Erinnerung habe, war das eine Submachine Gun aus Battlefield 3."}, {"id": 79, "start": 282.0, "end": 286.0, "text": "Und Max, das Ding heißt A-91 und nicht AN-91."}, {"id": 80, "start": 286.0, "end": 289.0, "text": "Und es gibt jetzt ein Wurfmesser. Ich glaube, das wird wahrscheinlich einige freuen."}, {"id": 81, "start": 289.0, "end": 293.0, "text": "Wie gut man das in dem Spiel verwenden kann bei diesen großen Distanzen."}, {"id": 82, "start": 293.0, "end": 300.0, "text": "Was hier abgeht, Max, Maxception, wir gucken uns zum Start, bis das Twitch gecheckt hat, dass das Stream live ist und alles passt."}, {"id": 83, "start": 300.0, "end": 304.0, "text": "Wir gucken uns mein eigenes Video an. Bisschen View-Time-Boosten."}, {"id": 84, "start": 304.0, "end": 308.0, "text": "Kann ich euch erst vielleicht in einem der späteren Videos oder in einem der nächsten Videos zu sagen."}, {"id": 85, "start": 308.0, "end": 313.0, "text": "Und das Ganze wurde natürlich wieder schön verteilt über einen neuen Battle Pass."}, {"id": 86, "start": 313.0, "end": 317.0, "text": "Es gibt jetzt zusätzlich noch XP-Boosts, die auch über den Battle Pass verteilt sind."}, {"id": 87, "start": 317.0, "end": 322.0, "text": "Meine persönliche Vermutung ist, ich denke, sie mussten die Levels im Battle Pass noch irgendwie auffüllen,"}, {"id": 88, "start": 322.0, "end": 325.0, "text": "noch irgendwie ein bisschen strecken, damit man eben den Battle Pass vollbekommt."}, {"id": 89, "start": 325.0, "end": 328.0, "text": "Das ist höchstwahrscheinlich der Grund, Max."}, {"id": 90, "start": 328.0, "end": 331.0, "text": "Ansonsten ist alles beim alten, was die neue Season angeht."}, {"id": 91, "start": 331.0, "end": 335.0, "text": "Die gucken wir uns gleich an, den Battle Pass. Ich hab noch gar nicht groß reingekuckt."}, {"id": 92, "start": 335.0, "end": 338.0, "text": "Die Map ist mal wieder der absolute Wahnsinn."}, {"id": 93, "start": 338.0, "end": 342.0, "text": "Die Mapper-Praktikanten haben wieder zugeschlagen, zumindest was die Optik angeht."}, {"id": 94, "start": 342.0, "end": 348.0, "text": "Offene, grüne Fläche und zwei gleich aufgebaute viereckige Gebäude drauf. Kaum Detail."}, {"id": 95, "start": 348.0, "end": 355.0, "text": "Kann man eigentlich, weiß das jemand von euch, kann man eigentlich den alten Season Pass auch noch nachträglich anlocken?"}, {"id": 96, "start": 355.0, "end": 359.0, "text": "Also in Dota geht das zum Beispiel. Und fertig ist die neue Map."}, {"id": 97, "start": 359.0, "end": 362.0, "text": "Aber, hey, ich will mal gar nicht so anspruchsvoll sein."}, {"id": 98, "start": 362.0, "end": 365.0, "text": "Es spielt sich gut und das ist ja das, worauf es am Ende ankommt."}, {"id": 99, "start": 365.0, "end": 367.0, "text": "Man hat einen Tunnel zwischen den Punkten. Geht nicht."}, {"id": 100, "start": 367.0, "end": 370.0, "text": "Die kleinen Basen. Ich lade das nicht hoch, nein."}, {"id": 101, "start": 370.0, "end": 375.0, "text": "Die Leute lockern das Ganze ein bisschen auf. Optik und handwerklich ist die Map wirklich nicht gut gemacht."}, {"id": 102, "start": 375.0, "end": 380.0, "text": "Ich mein, seriously, guckt euch die Map an. Viergegiges Gebäude, Wiese."}, {"id": 103, "start": 380.0, "end": 385.0, "text": "Nur nach 15 haben wir sich gedacht, man hat alles genommen, was da ist. Hat es neu angeordnet auf einer Map."}, {"id": 104, "start": 385.0, "end": 389.0, "text": "Hat zwei neue Gebäude entworfen. Das war's."}, {"id": 105, "start": 389.0, "end": 392.0, "text": "Aber das Gameplay ist wirklich okay und das ist ja das, was letztendlich auch zählt."}, {"id": 106, "start": 392.0, "end": 396.0, "text": "Aber wenigstens ist das Gelände diesmal so gemacht, dass man etwas..."}, {"id": 107, "start": 396.0, "end": 400.0, "text": "Ach ja Leute, ich werde richtig PP-GA M, das kann ich euch jetzt schon sagen."}, {"id": 108, "start": 400.0, "end": 402.0, "text": "Natürlich gibt es wieder sehr viele Container."}, {"id": 109, "start": 402.0, "end": 405.0, "text": "Das sind wir ja mittlerweile gewohnt bei Container Field 2042."}, {"id": 110, "start": 405.0, "end": 409.0, "text": "Aber es knallt wieder nice und das Battlefield-Gefühl ist auch teilweise da."}, {"id": 111, "start": 409.0, "end": 412.0, "text": "Dazu gibt es, was ich auch wirklich gut finde, ist ein neues Ping."}, {"id": 112, "start": 412.0, "end": 416.0, "text": "Ich dachte mir, bis Twitch richtig angelaufen ist, gucken wir uns fünf Minuten jetzt mal ein eigenes Video an."}, {"id": 113, "start": 416.0, "end": 418.0, "text": "Ein bisschen Viewtime boosten."}, {"id": 114, "start": 418.0, "end": 421.0, "text": "Man kann jetzt Spieler pingen und die werden dann markiert für kurze Zeit."}, {"id": 115, "start": 421.0, "end": 425.0, "text": "Es ist ja auch Container Field. Was soll man sagen? Guckt aber hier rechts."}, {"id": 116, "start": 425.0, "end": 428.0, "text": "Tante oder Kent, kann man ja immer noch spielen."}, {"id": 117, "start": 428.0, "end": 434.0, "text": "Und wenn man zu sehr pingt, also wenn man die ganze Zeit Q spammt zum Pingen, dann gibt es auch wieder einen Cooldown."}, {"id": 118, "start": 434.0, "end": 437.0, "text": "Finde ich eigentlich eine sehr nice Geschichte. Ist auch eine sinnvolle Lösung."}, {"id": 119, "start": 437.0, "end": 443.0, "text": "Hat ja nicht umsonst jahrelang, wenn nicht jahrzehntelang, in alten Spielen so oder so ähnlich funktioniert."}, {"id": 120, "start": 443.0, "end": 449.0, "text": "Wäre das Spiel in diesem Zustand rausgekommen, wäre es zwar denke ich immer noch eine Enttäuschung gewesen."}, {"id": 121, "start": 449.0, "end": 455.0, "text": "Aber es wäre kein totaler Reinfall geworden, wie es jetzt leider Battlefield 2042 geworden ist."}, {"id": 122, "start": 455.0, "end": 461.0, "text": "Schade drum ist es tatsächlich trotzdem, vor Weihnachten gibt es noch Update 3.1."}, {"id": 123, "start": 461.0, "end": 465.0, "text": "Damit gibt es dann eine überarbeitete Manifest-Map."}, {"id": 124, "start": 465.0, "end": 467.0, "text": "Mit noch mehr Containern?"}, {"id": 125, "start": 467.0, "end": 469.0, "text": "Man kennt, Manifest ist die Containermap."}, {"id": 126, "start": 469.0, "end": 476.0, "text": "Man könnte das zwar mittlerweile über jede Map in diesem Spiel sagen, aber Manifest ist diese Hafen-Containermap."}, {"id": 127, "start": 476.0, "end": 480.0, "text": "Ich bin gespannt, wie sie die überarbeiten werden. Man hat ja schon ein paar Vorschaubilder gesehen."}, {"id": 128, "start": 480.0, "end": 485.0, "text": "Mit mehr Containern? Wäre das gedacht?"}, {"id": 129, "start": 485.0, "end": 491.0, "text": "Zur Abwechslung zwischendurch wird das Ganze nochmal aufgelockert durch Betonblöcke und Sandsäcke und natürlich Container."}, {"id": 130, "start": 491.0, "end": 496.0, "text": "Dazu wird es noch mehr Vault-Weapons geben, also noch mehr Copy-Paste-Waffen aus alten Battlefield-Spielen."}, {"id": 131, "start": 496.0, "end": 499.0, "text": "Aber so hat man vielleicht in den Weihnachtsferien ein bisschen was zu tun."}, {"id": 132, "start": 499.0, "end": 503.0, "text": "Man kann sich so seine Ladung Battlefield abholen, was ab und zu mal sein muss."}, {"id": 133, "start": 503.0, "end": 508.0, "text": "Es holen sich allerdings aktuell relativ viele Leute ihre Ladung Battlefield ab, nämlich in alten Battlefield."}, {"id": 134, "start": 508.0, "end": 521.0, "text": "Guck mal, Steam-Charts Battlefield 2042 hier und das ist heute hier mit Season Release."}, {"id": 135, "start": 521.0, "end": 528.0, "text": "Steam-Charts BF4, BF5, BF1."}, {"id": 136, "start": 528.0, "end": 530.0, "text": "Passt mal auf."}, {"id": 137, "start": 530.0, "end": 534.0, "text": "Guck mal hier."}, {"id": 138, "start": 534.0, "end": 543.0, "text": "Seht ihr das? Wie viele Leute den alten Kram spielen versus das neue."}, {"id": 139, "start": 543.0, "end": 552.0, "text": "Und sogar Battlefield 4 wird noch ein bisschen gespielt."}, {"id": 140, "start": 552.0, "end": 560.0, "text": "Also hoch."}, {"id": 141, "start": 560.0, "end": 564.0, "text": "Gut genug, eigene Videos von mir müssen wir jetzt nicht fertig gucken."}, {"id": 142, "start": 564.0, "end": 566.0, "text": "Also, ich mache mal das Spiel an."}, {"id": 143, "start": 566.0, "end": 571.0, "text": "Nicht wundern, am Anfang lag es ein bisschen, es lag immer, das ist normal."}, {"id": 144, "start": 571.0, "end": 574.0, "text": "Das ist in dem Spiel halt so."}, {"id": 145, "start": 574.0, "end": 579.0, "text": "Am Anfang lag es, da muss ich den Capture-Modus ändern, hier im OBS."}, {"id": 146, "start": 579.0, "end": 587.0, "text": "Und dann funktioniert es wieder richtig."}, {"id": 147, "start": 587.0, "end": 590.0, "text": "Meine Spielebibliothek."}, {"id": 148, "start": 590.0, "end": 592.0, "text": "Spielen."}, {"id": 149, "start": 592.0, "end": 598.0, "text": "Passende Musik dabei haben wir auch schon."}, {"id": 150, "start": 598.0, "end": 605.0, "text": "Sonst, sonst halte ich das nicht aus."}, {"id": 151, "start": 605.0, "end": 612.0, "text": "MW2 im Vergleich, also Performance-mäßig ist beides ziemlich mies."}, {"id": 152, "start": 612.0, "end": 617.0, "text": "Weiß gar nicht, was schlechter ist, ehrlich gesagt, Performance-technisch."}, {"id": 153, "start": 617.0, "end": 624.0, "text": "Specs, 1080 Ti, 8700K, 32 GB RAM und SSD."}, {"id": 154, "start": 624.0, "end": 626.0, "text": "Noch bis Dezember."}, {"id": 155, "start": 626.0, "end": 628.0, "text": "In einer Woche ungefähr gibt es einen neuen Rechner."}, {"id": 156, "start": 628.0, "end": 632.0, "text": "Guck mal, das Spiel hat zum ersten Mal so ein richtiges Startbild."}, {"id": 157, "start": 632.0, "end": 646.0, "text": "Was nach einem fertigen Game irgendwie aussieht."}, {"id": 158, "start": 646.0, "end": 650.0, "text": "Das Spiel ist wahnsinnig schnell, wie man hier sieht wieder."}, {"id": 159, "start": 650.0, "end": 656.0, "text": "High Speed, Loading."}, {"id": 160, "start": 656.0, "end": 658.0, "text": "Welche GPU gibt es im neuen Rechner?"}, {"id": 161, "start": 658.0, "end": 662.0, "text": "Eine 4090, eine 4090."}, {"id": 162, "start": 662.0, "end": 663.0, "text": "Guck mal, wie es laggt."}, {"id": 163, "start": 663.0, "end": 665.0, "text": "Seht ihr, wie es laggt?"}, {"id": 164, "start": 665.0, "end": 667.0, "text": "Cac Weight, Dismiss."}, {"id": 165, "start": 667.0, "end": 675.0, "text": "Passt mal auf, nicht wundern, das Laggen gehört gleich auf."}, {"id": 166, "start": 675.0, "end": 676.0, "text": "Hast du ein Atomkraftwerk im Keller?"}, {"id": 167, "start": 676.0, "end": 681.0, "text": "Nee, aber ich hätte bei den Energiepreisen gerne eins."}, {"id": 168, "start": 681.0, "end": 683.0, "text": "So, das muss man ausmachen."}, {"id": 169, "start": 683.0, "end": 687.0, "text": "Müssen wir den Game Capture anmachen und hoffen, dass Game Capture funktioniert."}, {"id": 170, "start": 687.0, "end": 694.0, "text": "Und dann machen wir die Vorschau aus und ich hoffe, es funktioniert dann auch alles im Stream."}, {"id": 171, "start": 694.0, "end": 700.0, "text": "Weil ansonsten laggt es."}, {"id": 172, "start": 700.0, "end": 702.0, "text": "Kostet 2800 Euro, nee."}, {"id": 173, "start": 702.0, "end": 708.0, "text": "Grafikkarte kostet 2200 oder sowas in dem Dreh."}, {"id": 174, "start": 708.0, "end": 711.0, "text": "So, und jetzt müssen wir erstmal die Lautstärke einstellen."}, {"id": 175, "start": 711.0, "end": 713.0, "text": "Und ich muss vorher noch was anderes machen."}, {"id": 176, "start": 713.0, "end": 716.0, "text": "Boah, wo war die Sensitivity Einstellung?"}, {"id": 177, "start": 716.0, "end": 722.0, "text": "Maus."}, {"id": 178, "start": 722.0, "end": 728.0, "text": "On Foot."}, {"id": 179, "start": 728.0, "end": 730.0, "text": "20."}, {"id": 180, "start": 730.0, "end": 737.0, "text": "Ich bin gar nicht sicher, ob ich da 20 habe."}, {"id": 181, "start": 737.0, "end": 741.0, "text": "Zumindest habe ich Foff 90."}, {"id": 182, "start": 741.0, "end": 747.0, "text": "Ich bin nicht der coole 105er Chat."}, {"id": 183, "start": 747.0, "end": 752.0, "text": "Wo käme man auch hin, wenn das Spiel sich irgendwie Settings sinken würde oder so."}, {"id": 184, "start": 752.0, "end": 753.0, "text": "Das geht ja nicht."}, {"id": 185, "start": 753.0, "end": 754.0, "text": "So, jetzt sollte alles funktionieren."}, {"id": 186, "start": 754.0, "end": 759.0, "text": "Schauen wir mal, ob die Lautstärke okay ist."}, {"id": 187, "start": 759.0, "end": 765.0, "text": "Ich vermute mal, ich muss einen Ticken leiser machen."}, {"id": 188, "start": 765.0, "end": 767.0, "text": "Wo habe ich hier denn den Sound?"}, {"id": 189, "start": 767.0, "end": 769.0, "text": "Ja, das Game ist komplett auf Anschlag."}, {"id": 190, "start": 769.0, "end": 771.0, "text": "Ich mache mal kurz runter, so auf 15."}, {"id": 191, "start": 771.0, "end": 774.0, "text": "Oder so, dann sollte es eigentlich ganz gut passen."}, {"id": 192, "start": 774.0, "end": 775.0, "text": "So, gucken wir mal."}, {"id": 193, "start": 775.0, "end": 776.0, "text": "Auf geht's."}, {"id": 194, "start": 776.0, "end": 779.0, "text": "Ich weiß nicht, wie lange ich mir das geben kann."}, {"id": 195, "start": 779.0, "end": 781.0, "text": "Es war schon ein bisschen."}, {"id": 196, "start": 781.0, "end": 782.0, "text": "Ihr kennt es ja."}, {"id": 197, "start": 782.0, "end": 787.0, "text": "Ich kann mir das meistens so 5, 6 Runden, 10 Runden, 10 Runden oder so."}, {"id": 198, "start": 787.0, "end": 790.0, "text": "Kann ich mir das geben, dann habe ich irgendwie schon keinen Bock mehr."}, {"id": 199, "start": 790.0, "end": 791.0, "text": "Das ist die Ikea-Map."}, {"id": 200, "start": 791.0, "end": 793.0, "text": "Das ist die Dice-Map quasi."}, {"id": 201, "start": 793.0, "end": 796.0, "text": "Die in Schweden."}, {"id": 202, "start": 796.0, "end": 797.0, "text": "Nordfick ist da."}, {"id": 203, "start": 797.0, "end": 799.0, "text": "5 auf 50 Minuten."}, {"id": 204, "start": 799.0, "end": 800.0, "text": "Mal gucken."}, {"id": 205, "start": 800.0, "end": 801.0, "text": "Das letzte Mal habe ich, glaube ich, 2 Stunden durchgehalten."}, {"id": 206, "start": 801.0, "end": 802.0, "text": "Schauen wir mal."}, {"id": 207, "start": 802.0, "end": 803.0, "text": "Also."}, {"id": 208, "start": 803.0, "end": 804.0, "text": "Ah."}, {"id": 209, "start": 804.0, "end": 805.0, "text": "Alles klar."}, {"id": 210, "start": 805.0, "end": 806.0, "text": "Geht noch nicht los."}, {"id": 211, "start": 806.0, "end": 811.0, "text": "Ich habe in dem Spiel absolut kein Interesse, meine Karte customise."}, {"id": 212, "start": 811.0, "end": 812.0, "text": "Die sieht seit dem Anfang an so aus."}, {"id": 213, "start": 812.0, "end": 821.0, "text": "Lautstärke checken."}, {"id": 214, "start": 821.0, "end": 823.0, "text": "Ihr müsst mir gleich sagen, ob die Lautstärke passt."}, {"id": 215, "start": 823.0, "end": 835.0, "text": "Ja, lassen wir das jetzt mal so."}, {"id": 216, "start": 835.0, "end": 836.0, "text": "Gehen wir da mal rein."}, {"id": 217, "start": 836.0, "end": 837.0, "text": "Ich will bloß nicht fahren."}, {"id": 218, "start": 837.0, "end": 838.0, "text": "Monkastier."}, {"id": 219, "start": 838.0, "end": 848.0, "text": "Wisst ihr, man kann auch den Spawn nicht mehr cancelen oder so."}, {"id": 220, "start": 848.0, "end": 851.0, "text": "Wenn ich jetzt sage, ach Mist, ich wollte doch in das andere Spawn."}, {"id": 221, "start": 851.0, "end": 852.0, "text": "Oder Mist, ich will doch zu Fuß spawnen."}, {"id": 222, "start": 852.0, "end": 853.0, "text": "Oder ich will warten."}, {"id": 223, "start": 853.0, "end": 854.0, "text": "Oder so."}, {"id": 224, "start": 854.0, "end": 855.0, "text": "Keine Chance."}, {"id": 225, "start": 855.0, "end": 857.0, "text": "Einmal geklickt, bis verhaftet."}, {"id": 226, "start": 857.0, "end": 859.0, "text": "Sind wir Cacomodates?"}, {"id": 227, "start": 859.0, "end": 861.0, "text": "Oder sind wir Amis?"}, {"id": 228, "start": 861.0, "end": 863.0, "text": "Ne, wir sind, wir sind."}, {"id": 229, "start": 863.0, "end": 864.0, "text": "Ne, was sind wir überhaupt?"}, {"id": 230, "start": 864.0, "end": 867.0, "text": "Wir sind Attacker, oder?"}, {"id": 231, "start": 867.0, "end": 869.0, "text": "Also sind wir, sind wir Russen."}, {"id": 232, "start": 869.0, "end": 870.0, "text": "Cacomodates."}, {"id": 233, "start": 870.0, "end": 871.0, "text": "Okay."}, {"id": 234, "start": 871.0, "end": 880.0, "text": "By the way, das ist normal, dass es hier keinen Sound gibt."}, {"id": 235, "start": 880.0, "end": 882.0, "text": "Bisschen leise ist es, ne?"}, {"id": 236, "start": 882.0, "end": 883.0, "text": "Bisschen leise."}, {"id": 237, "start": 883.0, "end": 884.0, "text": "Ich mache mal einen Ticken lauter, kann ich noch machen."}, {"id": 238, "start": 884.0, "end": 892.0, "text": "Wie ist die Lautstärke?"}, {"id": 239, "start": 892.0, "end": 899.0, "text": "Ach ja, und ich muss gucken, dass ich keine Frames droppe."}, {"id": 240, "start": 899.0, "end": 903.0, "text": "Ne, scheint alles zu funktionieren."}, {"id": 241, "start": 903.0, "end": 906.0, "text": "Ganz okay, warte mal, ich schieße mal kurz."}, {"id": 242, "start": 906.0, "end": 907.0, "text": "Ne, ist zu leise."}, {"id": 243, "start": 907.0, "end": 908.0, "text": "Zu leise."}, {"id": 244, "start": 908.0, "end": 911.0, "text": "Warte mal, Mixer."}, {"id": 245, "start": 911.0, "end": 914.0, "text": "Ja, so ist besser."}, {"id": 246, "start": 914.0, "end": 916.0, "text": "So ist besser."}, {"id": 247, "start": 916.0, "end": 917.0, "text": "Oder?"}, {"id": 248, "start": 917.0, "end": 918.0, "text": "So, hä?"}, {"id": 249, "start": 918.0, "end": 923.0, "text": "So müsste eigentlich ganz gut sein."}, {"id": 250, "start": 923.0, "end": 930.0, "text": "Falls zu laut ist, sag Bescheid, aber so müsste eigentlich ganz gut."}, {"id": 251, "start": 930.0, "end": 931.0, "text": "What the fuck?"}, {"id": 252, "start": 931.0, "end": 933.0, "text": "Warum sind die hier im Spawn schon drinnen?"}, {"id": 253, "start": 933.0, "end": 934.0, "text": "Ja, so ist gut, ne?"}, {"id": 254, "start": 934.0, "end": 935.0, "text": "Ich glaube."}, {"id": 255, "start": 935.0, "end": 936.0, "text": "Sag mal, sind die im Spawn?"}, {"id": 256, "start": 936.0, "end": 937.0, "text": "Schieße ich schon in den Spawn rein?"}, {"id": 257, "start": 937.0, "end": 938.0, "text": "Es geht ja gut los."}, {"id": 258, "start": 938.0, "end": 941.0, "text": "Highly advanced map design."}, {"id": 259, "start": 941.0, "end": 944.0, "text": "So, gucken wir uns das Ganze mal an."}, {"id": 260, "start": 944.0, "end": 947.0, "text": "Also, ich habe das, wie gesagt, noch nicht allzu lange gespielt."}, {"id": 261, "start": 947.0, "end": 948.0, "text": "Ich habe nur heute..."}, {"id": 262, "start": 948.0, "end": 950.0, "text": "Alter, mein Gott, jetzt ruckelt es."}, {"id": 263, "start": 950.0, "end": 951.0, "text": "What the hell?"}, {"id": 264, "start": 951.0, "end": 952.0, "text": "Habt ihr das gesehen?"}, {"id": 265, "start": 952.0, "end": 953.0, "text": "Guck mal."}, {"id": 266, "start": 953.0, "end": 954.0, "text": "Nice, GG."}, {"id": 267, "start": 954.0, "end": 965.0, "text": "Hallo, ich möchte gern an den Gunner."}, {"id": 268, "start": 965.0, "end": 970.0, "text": "Oh, jetzt hat er mich gesniped."}, {"id": 269, "start": 970.0, "end": 971.0, "text": "Nee, hat mich immer..."}, {"id": 270, "start": 971.0, "end": 972.0, "text": "Doch, doch, hat mich gesniped."}, {"id": 271, "start": 972.0, "end": 975.0, "text": "Die können mich da nicht ressen, das geht nicht."}, {"id": 272, "start": 975.0, "end": 978.0, "text": "Oh, nice, nice."}, {"id": 273, "start": 978.0, "end": 979.0, "text": "Massive."}, {"id": 274, "start": 979.0, "end": 980.0, "text": "Huge res."}, {"id": 275, "start": 980.0, "end": 981.0, "text": "Doppelt res geht nicht, oder?"}, {"id": 276, "start": 981.0, "end": 982.0, "text": "Nee, ich glaube."}, {"id": 277, "start": 982.0, "end": 983.0, "text": "Oder?"}, {"id": 278, "start": 983.0, "end": 984.0, "text": "Oh, doch."}, {"id": 279, "start": 984.0, "end": 985.0, "text": "Guck mal hier."}, {"id": 280, "start": 985.0, "end": 999.0, "text": "Nee, no pass, no pass."}, {"id": 281, "start": 999.0, "end": 1008.0, "text": "Yep, yep, spawn."}, {"id": 282, "start": 1008.0, "end": 1009.0, "text": "Alter."}, {"id": 283, "start": 1009.0, "end": 1015.0, "text": "Ich brauche übrigens das Midi-Kit und nicht diesen Crap."}, {"id": 284, "start": 1015.0, "end": 1030.0, "text": "Hat er mich gerade noobtubt?"}, {"id": 285, "start": 1030.0, "end": 1031.0, "text": "Kann das sein?"}, {"id": 286, "start": 1031.0, "end": 1033.0, "text": "Was hast du für eine Grafika?"}, {"id": 287, "start": 1033.0, "end": 1034.0, "text": "1080 Ti."}, {"id": 288, "start": 1034.0, "end": 1039.0, "text": "Also hier geht ja grad nicht alles so viel."}, {"id": 289, "start": 1039.0, "end": 1049.0, "text": "Okay, probieren wir das Ganze noch mal."}, {"id": 290, "start": 1049.0, "end": 1054.0, "text": "Was ist da?"}, {"id": 291, "start": 1054.0, "end": 1059.0, "text": "Guck mal, was hier noch so drinne ist."}, {"id": 292, "start": 1059.0, "end": 1060.0, "text": "Ist hier noch was drinne?"}, {"id": 293, "start": 1060.0, "end": 1061.0, "text": "Okay, massive."}, {"id": 294, "start": 1061.0, "end": 1067.0, "text": "Ich bleib jetzt hier im Container stehen."}, {"id": 295, "start": 1067.0, "end": 1068.0, "text": "Easy Container Camp."}, {"id": 296, "start": 1068.0, "end": 1069.0, "text": "Achtung."}, {"id": 297, "start": 1069.0, "end": 1070.0, "text": "What the..."}, {"id": 298, "start": 1070.0, "end": 1071.0, "text": "Wie?"}, {"id": 299, "start": 1071.0, "end": 1072.0, "text": "Warum kriege ich Damage?"}, {"id": 300, "start": 1072.0, "end": 1073.0, "text": "Achtung."}, {"id": 301, "start": 1073.0, "end": 1074.0, "text": "Achtung."}, {"id": 302, "start": 1074.0, "end": 1075.0, "text": "Massive."}, {"id": 303, "start": 1075.0, "end": 1076.0, "text": "Massive Hatclitch."}, {"id": 304, "start": 1076.0, "end": 1077.0, "text": "Oh, oh."}, {"id": 305, "start": 1077.0, "end": 1078.0, "text": "Die wissen, dass ich da bin."}, {"id": 306, "start": 1078.0, "end": 1079.0, "text": "Die machen hinter..."}, {"id": 307, "start": 1079.0, "end": 1080.0, "text": "Oh."}, {"id": 308, "start": 1080.0, "end": 1081.0, "text": "Oh."}, {"id": 309, "start": 1081.0, "end": 1082.0, "text": "Oh."}, {"id": 310, "start": 1082.0, "end": 1083.0, "text": "Oh."}, {"id": 311, "start": 1083.0, "end": 1084.0, "text": "Oh."}, {"id": 312, "start": 1084.0, "end": 1085.0, "text": "Oh."}, {"id": 313, "start": 1085.0, "end": 1086.0, "text": "Oh."}, {"id": 314, "start": 1086.0, "end": 1087.0, "text": "Oh."}, {"id": 315, "start": 1087.0, "end": 1088.0, "text": "Oh."}, {"id": 316, "start": 1088.0, "end": 1089.0, "text": "Oh."}, {"id": 317, "start": 1089.0, "end": 1090.0, "text": "Oh."}, {"id": 318, "start": 1090.0, "end": 1091.0, "text": "Oh."}, {"id": 319, "start": 1091.0, "end": 1092.0, "text": "Oh."}, {"id": 320, "start": 1092.0, "end": 1093.0, "text": "Die machen hinter mir die Tür ab."}, {"id": 321, "start": 1093.0, "end": 1094.32, "text": "Ich brauch' ne 4090."}, {"id": 322, "start": 1094.32, "end": 1095.32, "text": "Ja, brauch ich."}, {"id": 323, "start": 1095.32, "end": 1096.32, "text": "Die brauch ich."}, {"id": 324, "start": 1096.32, "end": 1097.32, "text": "Kubernetes..."}, {"id": 325, "start": 1097.32, "end": 1102.32, "text": "Guck mal, Kubernetes-Cluster am Start."}, {"id": 326, "start": 1102.32, "end": 1103.64, "text": "Doppel der Kubernetes-Cluster."}, {"id": 327, "start": 1103.64, "end": 1105.6, "text": "Wir sollten, glaub ich, auf die andere Seite."}, {"id": 328, "start": 1105.6, "end": 1106.6, "text": "Hier wird das nix."}, {"id": 329, "start": 1106.6, "end": 1111.6, "text": "Good physics."}, {"id": 330, "start": 1111.6, "end": 1117.28, "text": "Motion Sensor..."}, {"id": 331, "start": 1117.28, "end": 1127.36, "text": "Das flutscht ja gleich richtig gut."}, {"id": 332, "start": 1127.36, "end": 1133.64, "text": "Okay, wir gehen hier hin."}, {"id": 333, "start": 1133.64, "end": 1153.92, "text": "Ja, was willst du machen?"}, {"id": 334, "start": 1153.92, "end": 1157.92, "text": "Da sind einfach zu viele, aber ich meine, wenn man drei gekillt hat, wenn die Leute"}, {"id": 335, "start": 1157.92, "end": 1160.16, "text": "jetzt reinpushen, dann könnte das tatsächlich was werden."}, {"id": 336, "start": 1160.16, "end": 1166.96, "text": "Aber hier rest mich keiner, das kann, oh, oh, nee, nee, war ein Gegner, ich dachte, ich"}, {"id": 337, "start": 1166.96, "end": 1167.96, "text": "dachte schon."}, {"id": 338, "start": 1167.96, "end": 1173.52, "text": "Ach guck mal, wir haben es ja und jetzt kommt halt das blöde, was, what the hell, hier ist"}, {"id": 339, "start": 1173.52, "end": 1183.36, "text": "ja alles voll noch, Monkeys, jetzt seht ihr gleich, Moment, Moment, Alter, was ist das"}, {"id": 340, "start": 1183.36, "end": 1184.36, "text": "hier?"}, {"id": 341, "start": 1184.36, "end": 1190.24, "text": "Jetzt könnt ihr gleich das blöde an Breakthroughs sehen, also ja nicht so, als hätte ich nicht"}, {"id": 342, "start": 1190.24, "end": 1191.24, "text": "getroffen oder so."}, {"id": 343, "start": 1191.24, "end": 1206.32, "text": "Jetzt könnt ihr gleich das blöde an Breakthroughs sehen, okay, jetzt könnt ihr gleich das blöde"}, {"id": 344, "start": 1206.32, "end": 1213.84, "text": "an Breakthroughs sehen und zwar, dass wenn wir rübergehen zur anderen Base und wir müssen"}, {"id": 345, "start": 1213.84, "end": 1217.64, "text": "da mit vielen Leuten anrücken, sonst kriegen wir das nicht, die sind dann komplett reingekämpft,"}, {"id": 346, "start": 1217.64, "end": 1223.08, "text": "dann respawnen die einfach, dann respawnen die einfach, ich muss hier übrigens in diese"}, {"id": 347, "start": 1223.08, "end": 1227.96, "text": "komische Hütte in der Mitte rein, das ist ein ganz guter Spot und dann guckt die Capture"}, {"id": 348, "start": 1227.96, "end": 1232.12, "text": "an A schon wieder, das ist das, was ich meine, das ist halt richtig dumm an Breakthroughs,"}, {"id": 349, "start": 1232.12, "end": 1238.12, "text": "vielleicht komme ich noch bei A schnell rein, das ist halt massiv, massiv bescheuert, dass"}, {"id": 350, "start": 1238.12, "end": 1242.52, "text": "das Ding keinerlei, keinerlei Capture Protection für irgendwie eine gewisse Zeit hat oder dass"}, {"id": 351, "start": 1242.52, "end": 1248.96, "text": "du als Defender wenigstens weniger brauchst zum Halten, das ist total Defender-Focus hier"}, {"id": 352, "start": 1248.96, "end": 1249.96, "text": "das ganze."}, {"id": 353, "start": 1249.96, "end": 1260.04, "text": "Okay, auf auf, ich bleibe jetzt hier einfach am Fenster stehen und gucke, ob was kommt,"}, {"id": 354, "start": 1260.04, "end": 1265.72, "text": "einmal Motion Sensor, ob hier ist nichts mehr, okay, dann müssen wir rüber, müssen wir"}, {"id": 355, "start": 1265.72, "end": 1283.36, "text": "rüber zu A, wo ist er denn, da kommt ein Auto, okay, komm, jetzt rüber zu, jetzt rüber"}, {"id": 356, "start": 1283.36, "end": 1298.32, "text": "zu A, easy, easy, Cap, no Cap, easy Cap, nicht Down, Anzeige, Alter, hier kommen sie dann"}, {"id": 357, "start": 1298.32, "end": 1308.24, "text": "mal rüber, Massive Deckung am Start hier, guckt es euch an, high IQ Deckung, okay, rein"}, {"id": 358, "start": 1308.24, "end": 1314.4, "text": "hier, rein, rein und jetzt Campen in der Hütte auf A, ach nee, hier ist gar keine Hütte,"}, {"id": 359, "start": 1314.4, "end": 1319.92, "text": "hier, da drinne, besser Spot, Leute, besser Spot, kann man, kann man das gar nicht aufmachen"}, {"id": 360, "start": 1319.92, "end": 1329.2, "text": "hier, guck jetzt, Capture'n sie bestimmt gleich A, 2, während wir hier drinne stehen, okay,"}, {"id": 361, "start": 1329.2, "end": 1339.68, "text": "ich verpiss mich hier mal kurz, Alter, Geruckel, okay, ich glaube, jetzt verlieren wir A, jetzt"}, {"id": 362, "start": 1339.68, "end": 1345.32, "text": "verlieren wir A, das ist so dumm, das ist so dumm an Breakthrough, guck mal, das ist so"}, {"id": 363, "start": 1345.32, "end": 1361.48, "text": "blöde, wenn wir Glück haben, können wir das noch halten jetzt, what, okay, der ist im"}, {"id": 364, "start": 1361.48, "end": 1378.76, "text": "Haus, okay, jetzt, ich hoffe, wir verlieren jetzt A nicht, wo ist denn der, ist der hier"}, {"id": 365, "start": 1378.76, "end": 1386.36, "text": "drinne, oh, das war blöd, Alter, der wusste, dass ich komme, der hatte eine deutlich bessere"}, {"id": 366, "start": 1386.36, "end": 1392.24, "text": "Pose da drinne, das zu aim als ich, wo ich nicht genau wusste, wo er steht, aber wir"}, {"id": 367, "start": 1392.24, "end": 1401.64, "text": "haben's, wir haben's, nice, okay, das hätte ich nicht gedacht, dass wir das hinkriegen,"}, {"id": 368, "start": 1401.64, "end": 1411.56, "text": "ist hier noch einer, nee, der ist weg, ich glaube, wir haben's, das ist die neue Map,"}, {"id": 369, "start": 1411.56, "end": 1422.04, "text": "ja, ja, okay, der hat sein Namensschild zu spät gesporn, das ist die neue Map, das ist"}, {"id": 370, "start": 1422.04, "end": 1431.96, "text": "im Prinzip Orbital, also vom Skin her, nur mit zwei quadratischen Häusern drauf, Dankeschön"}, {"id": 371, "start": 1431.96, "end": 1449.56, "text": "für den Prime Sub, jetzt könnt ihr gleich eines dieser Häuser sehen, könnt ihr gleich"}, {"id": 372, "start": 1449.56, "end": 1454.12, "text": "nach dieser Base, könnt ihr eins von innen sehen, oh, Alter, könnt ihr gleich Häuser"}, {"id": 373, "start": 1454.12, "end": 1459.04, "text": "von innen sehen, ich hoffe, ich werde nicht wiederbelebt, oder, werde ich wiederbelebt,"}, {"id": 374, "start": 1459.04, "end": 1462.68, "text": "das sieht so aus, als wollte ich wiederbeleben, guck mal, die springen da schon rum, Alter,"}, {"id": 375, "start": 1462.68, "end": 1467.16, "text": "Massive Fire-AQ-Team, weil wenn ich nicht wiederbelebt werde, hätte ich mal das Midi-Pack"}, {"id": 376, "start": 1467.16, "end": 1482.04, "text": "mitnehmen können anstatt den Pen, der Midi-Pen ist ja irgendwie verbugged, Hallo, please,"}, {"id": 377, "start": 1482.04, "end": 1503.2, "text": "klettern, Alter, was willst du denn hier machen, Mensch, wie soll man das denn spielen, sag"}, {"id": 378, "start": 1503.2, "end": 1511.52, "text": "mal sind das 128, nee das sind 32, 32, okay, wir machen jetzt Flank-Action, ich muss mal"}, {"id": 379, "start": 1511.52, "end": 1536.2, "text": "ein bisschen aufwachen hier, in der Hoffnung, es klappt, Pakt, hä?"}, {"id": 380, "start": 1536.2, "end": 1549.36, "text": "Alter, PP-GA-Aim, ich hab's euch versprochen, es gibt PP-GA-Aim und schon ist es am Start,"}, {"id": 381, "start": 1549.36, "end": 1557.24, "text": "was das für Physiks sind, das funktioniert noch am besten an dem Game, die Physiks, aber"}, {"id": 382, "start": 1557.24, "end": 1564.6, "text": "das dürfte mit der Zeit sich jetzt einpendeln, Schmerzensgeld, ja, braucht man echt so ein"}, {"id": 383, "start": 1564.6, "end": 1576.08, "text": "bisschen, oh, oh, what, okay, High-AQ-Play, oh, nein, nein, nein, ganz, ganz Low-AQ, Massive"}, {"id": 384, "start": 1576.08, "end": 1583.68, "text": "Low-AQ war das, da oben drauf zu gehen war jetzt nicht so schlau, wir sollten's gleich"}, {"id": 385, "start": 1583.68, "end": 1594.88, "text": "gekappt haben, gleiches Captchern, was wollt ihr mir jetzt sagen, das wollt ich grad sagen,"}, {"id": 386, "start": 1594.88, "end": 1608.56, "text": "das war kein Treffer oder was, mein, von dem Dude hat nur der Kopf rausgeguckt, okay, gut,"}, {"id": 387, "start": 1608.56, "end": 1616.92, "text": "so, jetzt könnt ihr das Gebäude gleich von innen bewundern, irgendwie, ich mein, Auspetsch-Chäpp"}, {"id": 388, "start": 1616.92, "end": 1629.6, "text": "oder, ey, was stimmt hier grad nicht, so, mal einen Motion-Sensor hin, nein, du kannst"}, {"id": 389, "start": 1629.6, "end": 1643.84, "text": "überhaupt nicht sehen, dass ich da bin, in den Kopf, nice, noch mehr in den Kopf, dahinter,"}, {"id": 390, "start": 1643.84, "end": 1653.32, "text": "der lebt wieder, okay, wir müssen das anders machen, Plank-Play und nicht, Alter, Midi-Pen,"}, {"id": 391, "start": 1653.32, "end": 1658.4, "text": "ich brauche, Leute erinnert mich mal dran, ich will das Midi-Kit ausrüsten und nicht"}, {"id": 392, "start": 1658.4, "end": 1670.8, "text": "diesen Pen, weil der Pen ist verbuckt, jedes Mal wenn du Damage nimmst, bricht der ab,"}, {"id": 393, "start": 1670.8, "end": 1682.0, "text": "das ist ziemlich unbrauchbar im Eifer des Gefechts, okay, so, das Gebäude sieht hässlich"}, {"id": 394, "start": 1682.0, "end": 1689.32, "text": "aus, aber, Leute, das ist tatsächlich ganz, ganz brauchbar gemacht, ehrlich gesagt, guck"}, {"id": 395, "start": 1689.32, "end": 1696.76, "text": "mal, das ist wirklich ganz brauchbar gemacht, das hat ganz gute Ecken, wo man hier, wo man"}, {"id": 396, "start": 1696.76, "end": 1702.56, "text": "hier durchgucken kann, es sieht halt nicht gut aus, aber es ist wirklich kompetent gemacht,"}, {"id": 397, "start": 1702.56, "end": 1709.52, "text": "also, als wäre es ein Level-Designer, der wusste, der wusste, was er macht, aber nicht"}, {"id": 398, "start": 1709.52, "end": 1727.68, "text": "in der Lage war, ein Level hübsch zu machen, aber da außen ist doch ein, whoa, CU, CU,"}, {"id": 399, "start": 1727.68, "end": 1741.56, "text": "ich bin weg, ha, Lul, was ist mit dir los, was ist mit dir los, der sitzt da einfach,"}, {"id": 400, "start": 1741.56, "end": 1758.0, "text": "oh, and it was, wie geht das, and it was at this moment, he knew, he fucked up, Midi-Kit-Ausrüsten,"}, {"id": 401, "start": 1758.0, "end": 1763.8, "text": "jawoll, jawoll, Dankeschön, Chat, high IQ, mitdenk, mitdenk, Chat, wo ist es denn überhaupt"}, {"id": 402, "start": 1763.8, "end": 1778.88, "text": "hier, Midi-Crate, ach, es gibt ja nur noch eine, raus hier, ich hab Schiss, ich hab Schiss,"}, {"id": 403, "start": 1778.88, "end": 1786.84, "text": "meinen Kopf hier rauszustecken, ich trau mich nicht, konnte man sich ein, Leute, blöde"}, {"id": 404, "start": 1786.84, "end": 1798.16, "text": "Frage, konnte man sich lehnen in dem Game, ging das, ne, glaub das ging nicht, oh, da"}, {"id": 405, "start": 1798.16, "end": 1805.72, "text": "ist ein Gegner, der hat mich auch gesehen, pass mal auf, haha, Lul, hat sich gedacht,"}, {"id": 406, "start": 1805.72, "end": 1819.36, "text": "guckt er mich ab, wurde er von der Seite gesnackt, ah, shit, hätte klappen können, Autolin,"}, {"id": 407, "start": 1819.36, "end": 1832.72, "text": "wirklich, oh ne, ich deb, ich hab released, nope, okay, also C2 Hammer, C2 Hammer, jetzt"}, {"id": 408, "start": 1832.72, "end": 1836.52, "text": "müssen wir irgendwie C1 Captchern und ich wette mit euch, das ist das übliche, wenn"}, {"id": 409, "start": 1836.52, "end": 1843.44, "text": "wir jetzt rüber gehen zu C1 und C1 Captchern, dann verlieren wir C2, also die übliche,"}, {"id": 410, "start": 1843.44, "end": 1871.36, "text": "übliche Geschichte, okay, bin mir nicht ganz sicher, von wo ich beschossen werde, haust"}, {"id": 411, "start": 1871.36, "end": 1879.84, "text": "du her, ja, es war noch mehr da, geil, ne, Autolin glaub ich nicht, hab ich ernsthaft"}, {"id": 412, "start": 1879.84, "end": 1885.32, "text": "20 Kills, wo hab ich denn 20 Kills, guck, jetzt verlieren wir C1, jetzt hat, das einzige,"}, {"id": 413, "start": 1885.32, "end": 1893.52, "text": "was wir machen können ist jetzt, gucken, dass wir schnell wieder an C2 rankommen, ah, ich"}, {"id": 414, "start": 1893.52, "end": 1899.6, "text": "hab euch PP-GA-Aim versprochen und gibt's heute volles Programm, das ist immer noch"}, {"id": 415, "start": 1899.6, "end": 1907.2, "text": "die Lidl-UI, hä, also ja anscheinend, du meinst, weil es so billig ist wie Lidl, ich"}, {"id": 416, "start": 1907.2, "end": 1914.0, "text": "war heute einkaufen beim Lidl, ich hab 80 Euro ausgegeben, also Lidl, das UI ist deutlich"}, {"id": 417, "start": 1914.0, "end": 1935.76, "text": "billiger als Lidl, okay, ach ja, jetzt hab ich ja das Teil, nice, ich bin mir da nicht"}, {"id": 418, "start": 1935.76, "end": 1944.64, "text": "ganz sicher, ob man jetzt sich raus trauen kann, oh, da kommt was von außen, guck mal,"}, {"id": 419, "start": 1944.64, "end": 1960.12, "text": "da, oh, hier drinnen geht ordentlich was, ich hör ja 50 Gegner rumlaufen, so, in der"}, {"id": 420, "start": 1960.12, "end": 1964.28, "text": "Hoffnung, wir kommen jetzt hier irgendwie rein, guck, jetzt haben wir wieder C1 verloren,"}, {"id": 421, "start": 1964.28, "end": 1969.6, "text": "Alter, Breakthrough ist so ein dummer Modus, man, was soll man denn da dagegen bitteschön"}, {"id": 422, "start": 1969.6, "end": 1984.76, "text": "machen, kann mir das irgendjemand erklären, was soll man, na, man geht auf die eine Seite,"}, {"id": 423, "start": 1984.76, "end": 1990.6, "text": "Capture, es müsste, es müsste so eine Art Capture-Protection geben, zumindest mal für"}, {"id": 424, "start": 1990.6, "end": 1995.48, "text": "20, 30 Sekunden, ja, und dann, ich weiß auch nicht, warum es so was da nicht drin ist,"}, {"id": 425, "start": 1995.48, "end": 2002.24, "text": "und dann müsstest du in der Lage sein, den Punkt quasi mit weniger Leuten zu defenden,"}, {"id": 426, "start": 2002.24, "end": 2007.64, "text": "also ich meine jetzt nicht killtechnisch, sondern Capture-technisch, quasi du brauchst"}, {"id": 427, "start": 2007.64, "end": 2013.76, "text": "weniger Leute on point als die Attacker, weil ansonsten musst du dich halt, musst du dich"}, {"id": 428, "start": 2013.76, "end": 2017.32, "text": "halt festlegen, musst du halt die Punkte pushen, und die Defender können sich theoretisch"}, {"id": 429, "start": 2017.32, "end": 2022.76, "text": "auf einen raufcappen, und wenn du das eingenommen hast, respawnst und rennt auf den anderen,"}, {"id": 430, "start": 2022.76, "end": 2029.76, "text": "also das ist total blödsinnig, aber gut, wir haben es geschafft, läuft das eigentlich"}, {"id": 431, "start": 2029.76, "end": 2035.6, "text": "ruckelfrei, chat, läufts eigentlich gut, ich hoffe, weil ich kann nicht allzu viel machen,"}, {"id": 432, "start": 2035.6, "end": 2046.16, "text": "sollte es nicht gut laufen, ah, Moment, Moment, jetzt weiß ich was ist, guck mal hier, 360,"}, {"id": 433, "start": 2046.16, "end": 2056.84, "text": "was zum, Leute, das Game ist merkwürdig, ich hab ungefähr 360 drehen, ungefähr so"}, {"id": 434, "start": 2056.84, "end": 2061.24, "text": "dreiviertel Mauspad, normalerweise hab ich das komplette Mauspad, und ich hab exakt"}, {"id": 435, "start": 2061.24, "end": 2068.88, "text": "das gleiche FOV auf meinem anderen Account, und exakt die gleiche Sensitivity auf meinem"}, {"id": 436, "start": 2068.88, "end": 2076.76, "text": "anderen Account, und die Maus DPI hab ich nie umgestellt, die ist 800 bei beiden, also"}, {"id": 437, "start": 2076.76, "end": 2086.52, "text": "sus, sus, irgendwas stimmt da nicht, aber das ist gut, das ist gut, dass da was nicht"}, {"id": 438, "start": 2086.52, "end": 2090.6, "text": "stimmt, weil da kann ich jedes mal, wenn ich verkacke, kann ich sagen, das liegt an falschen"}, {"id": 439, "start": 2090.6, "end": 2103.32, "text": "Settings, das ist gut, ich lass das so, da kann ich nämlich sagen, guck Leute, dass ich"}, {"id": 440, "start": 2103.32, "end": 2108.44, "text": "den ersten nicht getroffen hab, liegt eindeutig an Senseinstellungen, alles klar, was ist"}, {"id": 441, "start": 2108.44, "end": 2120.56, "text": "denn mit ihm los, Nikolas, man, der liegt einfach mitten auf dem Weg, der Nikolas, der"}, {"id": 442, "start": 2120.56, "end": 2128.32, "text": "will, dass wir in seine Gruppe kommen, da hab ich schon ne Telegram Gruppe, ok, warum,"}, {"id": 443, "start": 2128.32, "end": 2134.8, "text": "ach, das war das Schild, was ich, nee, ich muss nicht alles verstehen, jetzt müssen wir"}, {"id": 444, "start": 2134.8, "end": 2141.6, "text": "mal was checken, das müssen wir mal ausprobieren, kann man da hoch, aha, aha, aha, aha, aha,"}, {"id": 445, "start": 2141.6, "end": 2154.36, "text": "nee, ok, ein bisschen, ein bisschen, hey, das ist gar nicht mal so doof, das ist eigentlich"}, {"id": 446, "start": 2154.36, "end": 2162.52, "text": "recht cool, dass das geht, wirst du Pepega aim wieder, ok, das ist einfach straight durch"}, {"id": 447, "start": 2162.52, "end": 2167.0, "text": "geflogen, das ist aber gut, dass das geht, das erinnert mich ein bisschen, wisst ihr,"}, {"id": 448, "start": 2167.0, "end": 2174.24, "text": "was mich das erinnert, ähm, das erinnert mich an Bad Company, wo man beispielsweise"}, {"id": 449, "start": 2174.24, "end": 2188.48, "text": "auf Valparaiso oder Isla Innocentes oder sowas raus auf die Mapbegrenzung konnte, guck,"}, {"id": 450, "start": 2188.48, "end": 2201.68, "text": "das ist eigentlich ganz nice, das ist eigentlich ne gute Sache, sag mal, fliegt das durch oder,"}, {"id": 451, "start": 2201.68, "end": 2212.2, "text": "was zur, ist das jetzt durchgeflogen oder ist das einfach auf die Range mit der Waffe"}, {"id": 452, "start": 2212.2, "end": 2233.04, "text": "oder nicht, naja, moin, sag mal, sag mal, seriously,"}, {"id": 453, "start": 2233.04, "end": 2255.48, "text": "ja, ich spiele Battlefield, das ist aber eigentlich, ich muss hier weg und Bunny hoppen, nein, Mist,"}, {"id": 454, "start": 2255.48, "end": 2277.16, "text": "ganz schlecht, ganz schlecht, ok, pass mal auf, Bunny Hop Action, nichts wie rüber, ich"}, {"id": 455, "start": 2277.16, "end": 2291.0, "text": "hab so ein bisschen Schiss, hier ist so offen, das fällt, ich hoffe, da sieht mich nicht"}, {"id": 456, "start": 2291.0, "end": 2314.24, "text": "der Typ, ok, ok, nice, nice, nice, nice, nice, einfach nichts gesehen, ich darf nicht so"}, {"id": 457, "start": 2314.24, "end": 2327.64, "text": "schnell releasen, mittlerweile reviven doch recht viele Leute, auch nicht Medics, ja,"}, {"id": 458, "start": 2327.64, "end": 2337.8, "text": "Leute, wir haben tatsächlich die realistische Chance, das irgendwie zu packen, ach, da ist"}, {"id": 459, "start": 2337.8, "end": 2347.84, "text": "ja gar nichts, komm, wir machen noch Flank Action, ja, Massive, was, war das Panzerrohr,"}, {"id": 460, "start": 2347.84, "end": 2356.56, "text": "was da gerade runtergefallen ist, oh, da geht's gar nicht weiter, ok, ok, ok, weiter, weiter"}, {"id": 461, "start": 2356.56, "end": 2364.0, "text": "Flank, wir spielen nachher noch ein paar Runden Rush, Leute, ok, die wissen das, ich, pass"}, {"id": 462, "start": 2364.0, "end": 2371.04, "text": "mal auf, Tricks 17, Tricks 17, schnell Feuerrohr drauf, Motion Sensor außen hin, dass ich"}, {"id": 463, "start": 2371.04, "end": 2382.44, "text": "weiß, wo sie sind, jetzt denken sie, ich komm da rein und jetzt, Scheiße, Monka ist, ah,"}, {"id": 464, "start": 2382.44, "end": 2388.6, "text": "Shit, der klappen könnte, der klappen könnte, ich dachte nicht, dass ich, ich dachte, ich"}, {"id": 465, "start": 2388.6, "end": 2395.48, "text": "hab den Midi Pack dabei, ja, 320 IQ Strats, hey, mit 38 muss man das machen, da kann man"}, {"id": 466, "start": 2395.48, "end": 2404.48, "text": "die nicht mehr one on one, die ganzen 12 jährigen, mal gucken, wenn ich Glück hab, sieht mich"}, {"id": 467, "start": 2404.48, "end": 2428.52, "text": "keiner und wir müssen auch noch E2 Captchern, ok, da ist er, irgendwo da hinten ist noch"}, {"id": 468, "start": 2428.52, "end": 2442.8, "text": "einer, da drüben ist er, da ist noch einer, ich hab ihn gesehen, Shit, ich weiß nicht"}, {"id": 469, "start": 2442.8, "end": 2459.84, "text": "von wo, fuck, Alter, ja, Wauts trau nicht, die ganzen Zoomer ficken alle weg, so sieht's"}, {"id": 470, "start": 2459.84, "end": 2475.72, "text": "aus mittlerweile, kann man hier drüber und irgendwie die verarschen, pass mal auf, man"}, {"id": 471, "start": 2475.72, "end": 2480.12, "text": "muss hier outplayen, wenn man die nicht out, out, amen kann, guck, so muss man das machen,"}, {"id": 472, "start": 2480.12, "end": 2508.32, "text": "out, out, outdenken anstatt outamen, äh, hallo, das war jetzt blöd, oh, oh, oh, oh, ich muss"}, {"id": 473, "start": 2508.32, "end": 2526.76, "text": "money wechseln, money, da hinten steht einer, oder, nee, wenn das movement ja funktionieren"}, {"id": 474, "start": 2526.76, "end": 2540.84, "text": "würde, da hinten was, ah, da ist ein Panzer, der Pantsman ist da, ich bin zu alt, ja, alt"}, {"id": 475, "start": 2540.84, "end": 2546.36, "text": "und falsche settings, wisst ihr, das ist gut, ich brauch was, ich brauch was, wo ich mich"}, {"id": 476, "start": 2546.36, "end": 2572.04, "text": "rausreden kann, falsche settings und alt, oh, oh, oh, oh, oh, oh, da ist ein Tank, Monka"}, {"id": 477, "start": 2572.04, "end": 2584.92, "text": "S, okay, oh, shit, jetzt ausgerechnet da drinnen steht noch einer, wir schlagen uns doch ganz"}, {"id": 478, "start": 2584.92, "end": 2596.64, "text": "gut, guck mal, das ist ein Panzer von uns, wir verlieren jetzt bestimmt wieder E2, okay,"}, {"id": 479, "start": 2596.64, "end": 2608.52, "text": "capture, capture, nice, nice, capture, wow, ich blicke nicht mehr durch, wo ist hier was,"}, {"id": 480, "start": 2608.52, "end": 2619.64, "text": "da sind noch mehr, oder, oh, oh, oh, oh, oh, so viel Leute, es ist von allen Seiten, Zoomer"}, {"id": 481, "start": 2619.64, "end": 2629.96, "text": "Brain, versus Boomer Brain, mein Hirn ist überfordert, wir machen nachher mal einen Reaction Test im"}, {"id": 482, "start": 2629.96, "end": 2637.32, "text": "Browser, mal gucken, mal gucken, wie gut mein Reaction Time noch ist, was meint ihr"}, {"id": 483, "start": 2637.32, "end": 2646.92, "text": "Leute, über oder unter 200 Millisekunden, ratet mal, ratet mal, ich weiß nicht, wir"}, {"id": 484, "start": 2646.92, "end": 2664.64, "text": "probieren es nachher aus, über oder unter 200 Millisekunden, wie, wir haben verloren,"}, {"id": 485, "start": 2664.64, "end": 2674.32, "text": "wir haben gewonnen, easy, unter, safe, okay, wollen wir ausprobieren, während er släht,"}, {"id": 486, "start": 2674.32, "end": 2683.0, "text": "komm, wir probieren mal aus, wir machen was, Sekunde hier, display, capture, wie war das"}, {"id": 487, "start": 2683.0, "end": 2688.16, "text": "hier, human, bench, oh, das laggt, Leute, ich kann das nicht machen, mein Browser laggt"}, {"id": 488, "start": 2688.16, "end": 2694.4, "text": "mit dem Spiel, das funktioniert nicht, mein Browser laggt schon, das wird nicht funktionieren,"}, {"id": 489, "start": 2694.4, "end": 2701.96, "text": "nee, der Browser laggt, Leute, klappt nicht, klappt nicht, überhaupt, das, du Scheiße,"}, {"id": 490, "start": 2701.96, "end": 2709.84, "text": "die ganze Seite laggt, das müssen wir nachher machen, Leute, na geht doch, müssen wir nachher"}, {"id": 491, "start": 2709.84, "end": 2725.24, "text": "machen, nee, das geht nicht, das geht nicht, die Seite laggt, ja, müssen wir mal nachher"}, {"id": 492, "start": 2725.24, "end": 2731.32, "text": "machen, wenn das Spiel fertig geladen hat, habt ihr nicht gesehen, dass der Browser laggt,"}, {"id": 493, "start": 2731.32, "end": 2735.12, "text": "ich hab ungefähr, guck mal, seht ihr das, wie die Seite, ich hab ungefähr 15 FPS oder,"}, {"id": 494, "start": 2735.12, "end": 2743.12, "text": "seht ihr das, guckt mal, also jetzt sag mir mal in deiner Browser laggt nicht, das machen"}, {"id": 495, "start": 2743.12, "end": 2749.56, "text": "wir nachher, das probieren wir nachher aus, okay, machen wir das hier wieder aus und wieder"}, {"id": 496, "start": 2749.56, "end": 2754.88, "text": "Game Capture an, weil ansonsten laggt es bei euch auch, wahrscheinlich hatte ich auch,"}, {"id": 497, "start": 2754.88, "end": 2763.52, "text": "was haben wir jetzt anloggt, nee, was will ich denn damit, collection, lass mal überlegen,"}, {"id": 498, "start": 2763.52, "end": 2774.4, "text": "wollen wir irgendwas spezielles mal spielen, was gab es denn diesen, das da, nee, was gab"}, {"id": 499, "start": 2774.4, "end": 2787.92, "text": "es denn diesen Patch noch mal, das Ding oder, das Ding, nee, Moment, wir müssen mal kurz"}, {"id": 500, "start": 2787.92, "end": 2803.84, "text": "schauen, was gab es denn diesen Patch für Waffen, BF204 Season 3 Block, die durchschnittliche"}, {"id": 501, "start": 2803.84, "end": 2813.16, "text": "Reaktionszahl ist 273, okay, das ist ja richtig mies, man, so Block Post, wo ist denn das"}, {"id": 502, "start": 2813.16, "end": 2824.08, "text": "Official Block, gibt es nicht, hier, also Waffen, gibt es hier, es gibt eine Rorsch MK4, das"}, {"id": 503, "start": 2824.08, "end": 2830.72, "text": "ist ein LMG anscheinend, NVK, ach Moment, das ist alles Battle Pass gedönnt, Battle"}, {"id": 504, "start": 2830.72, "end": 2848.16, "text": "Pass müssen wir uns ja auch noch angucken, ach so, na gut, die haben doch Waffen genervt,"}, {"id": 505, "start": 2848.16, "end": 2854.36, "text": "guck mal, die haben angeblich die K30 genervt, jetzt probieren wir mal aus, ob die wirklich"}, {"id": 506, "start": 2854.36, "end": 2860.68, "text": "nennenswert genervt ist, die haben die P9 genervt und die K30 genervt, also die K30"}, {"id": 507, "start": 2860.68, "end": 2865.88, "text": "war auch ziemlich hart, nur eine neue Map, ja, die machen nur das Mindeste, kann es knicken,"}, {"id": 508, "start": 2865.88, "end": 2877.52, "text": "ja, komm, probieren wir mal aus, Vector mit Trommelmagazin, korrekt, ganz wichtig, dass"}, {"id": 509, "start": 2877.52, "end": 2890.6, "text": "diese wahnsinnig aufregende und spektakuläre Kamerafahrt jedes Mal kommt, heckle, okay,"}, {"id": 510, "start": 2890.6, "end": 2898.76, "text": "so, brauchen wir da irgendwas, naja, können wir so lassen, okay, Schussgeschwindigkeit"}, {"id": 511, "start": 2898.76, "end": 2908.84, "text": "hat sich nichts geändert, ach hier müssen wir schon, wenn wir spawnen, direkt am Defender"}, {"id": 512, "start": 2908.84, "end": 2917.2, "text": "Punkt, war das schon immer so, oh, oh, oh, ganz, ganz schlechte Idee, Max, ganz, ganz"}, {"id": 513, "start": 2917.2, "end": 2937.6, "text": "blöde Idee, wanted Sniper, nice, ich will wissen, ob die K30 extrem genervt wurde oder"}, {"id": 514, "start": 2937.6, "end": 2942.76, "text": "ob die noch ganz gut spielbar ist, weil ich bin mir gar nicht sicher, was exakt genervt"}, {"id": 515, "start": 2942.76, "end": 2955.4, "text": "wurde, die Damage Range auf jeden Fall, okay, die Damage Range auf jeden Fall, aber ich"}, {"id": 516, "start": 2955.4, "end": 2967.56, "text": "weiß noch nicht, ob es der normale, der normal, alter, der normale Damage ist, Prostata Royal"}, {"id": 517, "start": 2967.56, "end": 2983.88, "text": "hat uns gerade gekillt, alter, die Damage Range ist jetzt ja mal absolut lächerlich,"}, {"id": 518, "start": 2983.88, "end": 2989.64, "text": "da fällt ja gar nichts mehr um, man, und die wackelt auch mehr als vorher, okay, einmal"}, {"id": 519, "start": 2989.64, "end": 2997.64, "text": "probieren wir das noch, alter, die Damage Range ist ja nur wirklich mal jetzt komplett,"}, {"id": 520, "start": 2997.64, "end": 3005.28, "text": "komplett für'n Arsch, was ist denn hier los, Mensch, können wir mal aus dem spawn raus,"}, {"id": 521, "start": 3005.28, "end": 3017.2, "text": "okay, nee, nee, nee, die sackt, die sackt jetzt mal massiv, kann man nicht mehr spielen,"}, {"id": 522, "start": 3017.2, "end": 3022.84, "text": "kann man nicht mehr spielen, macht überhaupt, macht kein Damage mehr, und, also mein D-Range"}, {"id": 523, "start": 3022.84, "end": 3027.52, "text": "ist viel zu, viel zu knapp, da brauchen wir was anderes, kurzes Fazit zu, guck dir das"}, {"id": 524, "start": 3027.52, "end": 3032.24, "text": "Video von heute an, habe ich eigentlich alles gesagt, weitere, weitere Erkenntnisse habe"}, {"id": 525, "start": 3032.24, "end": 3039.8, "text": "ich noch nicht, jetzt haben sie ein bisschen zu krass genervt, ach nee, bleiben wir mal"}, {"id": 526, "start": 3039.8, "end": 3048.4, "text": "dieses Ding, so schlecht war das jetzt ja nicht, Damage, Damage, Damage, was ist das Downside,"}, {"id": 527, "start": 3048.4, "end": 3076.0, "text": "ja, okay, achso, was ist da hinter uns, was ist da hinter uns, was machst du hier, Anzeige,"}, {"id": 528, "start": 3076.0, "end": 3082.24, "text": "los mit dem, los, oh oh, guck mal, da ist ja alles voll, oh shit, Alter, warum kann ich"}, {"id": 529, "start": 3082.24, "end": 3091.88, "text": "nicht moveen, oh oh, oh, ich hab'n Problem, oh oh, ich hab'n Problem, fuck, da machst"}, {"id": 530, "start": 3091.88, "end": 3100.0, "text": "du nix, nee, krieg ich auch keinen Rest, wenn wir es halt clever machen, würden wir jetzt"}, {"id": 531, "start": 3100.0, "end": 3116.64, "text": "auf A pushen und nicht so sehr rumgammeln, ja, weil das ist normalerweise das gute an"}, {"id": 532, "start": 3116.64, "end": 3120.0, "text": "Breakthrough am Defender, sobald die sich hier drauf konzentrieren, kannst du halt zum"}, {"id": 533, "start": 3120.0, "end": 3125.24, "text": "anderen pushen, na gut, ey, ich glaube wir müssen zum Stinger Noob werden, oder, wenn"}, {"id": 534, "start": 3125.24, "end": 3145.0, "text": "ich mir das hier so angucke, wird das Zeit für den Stinger Noob, oh es wird Zeit, es"}, {"id": 535, "start": 3145.0, "end": 3167.52, "text": "ist Zeit, Monkeys ich hab' absolut keinen Plan, von wo hier irgendwas geht, hast du"}, {"id": 536, "start": 3167.52, "end": 3174.76, "text": "schon einen neuen Job, nee, ich hab morgen nochmal Gespräch mit meinem Chef, und ich"}, {"id": 537, "start": 3174.76, "end": 3182.2, "text": "hab' dann in den nächsten Wochen über, ah Mist, ich hab' dann in den nächsten Wochen"}, {"id": 538, "start": 3182.2, "end": 3194.16, "text": "über mal, suche ich mal die zu denen ich hin gehen will, und guck mir das mal vor Ort"}, {"id": 539, "start": 3194.16, "end": 3205.28, "text": "an, okay, eine kühle, einfach flache Map, guck mal, was ist denn das für ein weißer"}, {"id": 540, "start": 3205.28, "end": 3213.88, "text": "Skin, der ist eigentlich ganz nice, aber jetzt auf der grünen Map weniger, danke, geiler"}, {"id": 541, "start": 3213.88, "end": 3219.72, "text": "Spawn, ich drücke auf B1 Spawnen, und wo spawn ich, entgegengesetzt auf der anderen"}, {"id": 542, "start": 3219.72, "end": 3232.6, "text": "Seite der Map zu B1, GG, okay, wir müssen, wir müssen stingern, das ist ja nicht auszuhalten"}, {"id": 543, "start": 3232.6, "end": 3249.84, "text": "hier, oh ne, Heli ist down, was, hat gleich 3 Stück rausgeklatscht, sag mal, was zum,"}, {"id": 544, "start": 3249.84, "end": 3254.44, "text": "deswegen spiele ich gerne Rush, das ist so ein gewisser, kannst du ein bisschen irgendwie"}, {"id": 545, "start": 3254.44, "end": 3268.92, "text": "durchsteigen, beziehungsweise, hast halt so ne Art Frontline, was du hier halt nicht hast,"}, {"id": 546, "start": 3268.92, "end": 3273.12, "text": "aber immer noch, ich mein, wir können, wenn ihr wollt, wir können dann mal ne Runde Conquest"}, {"id": 547, "start": 3273.12, "end": 3285.56, "text": "spielen, aber ganz im Ernst, ich mag Conquest 128 nicht, 128 sind einfach zu viel, oh oh,"}, {"id": 548, "start": 3285.56, "end": 3308.36, "text": "was ist da, dafür ist es nicht ausgelegt, was ich hier hab, da machst du nix, da machst"}, {"id": 549, "start": 3308.36, "end": 3312.24, "text": "du nix, der hätten wir eigentlich zurückgemust, hier rettet mich auch garantiert keiner, wie"}, {"id": 550, "start": 3312.24, "end": 3319.0, "text": "lieblos die Map ist, extrem lieblos, es ist einfach grün und 2 4G Gehäuser draufgestellt,"}, {"id": 551, "start": 3319.0, "end": 3324.04, "text": "aber sie spielt sich tatsächlich ganz okay, was ja, was ja irgendwo auch das wichtige"}, {"id": 552, "start": 3324.04, "end": 3352.48, "text": "ist, ja, was die, was die fressen wieder, man, was zum, was ist mit, auf die Range ist"}, {"id": 553, "start": 3352.48, "end": 3370.2, "text": "das nichts, nichts zu machen, meine Midi Pack ist down, das andere Ding, übelst kacke Gehäuse,"}, {"id": 554, "start": 3370.2, "end": 3382.72, "text": "okay, die kommen gleich hier durch, hoffe ich mal, auch von hinten, na super, da machst"}, {"id": 555, "start": 3382.72, "end": 3387.96, "text": "du nix, okay, aber, mein, normalerweise würde ich jetzt K30 oder irgendwas spielen für"}, {"id": 556, "start": 3387.96, "end": 3410.52, "text": "Nahkampf, bringt aber nix, okay, da stirbt nix, sag mal Leute, ihr dürft auch umkippen,"}, {"id": 557, "start": 3410.52, "end": 3438.88, "text": "das ist schon erlaubt, hier siehst du nix, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh,"}, {"id": 558, "start": 3438.88, "end": 3453.24, "text": "oh, oh, oh, oh, fuck, Allah wie viel, da fällt mir nix zu ein, direkt was man da gescheit machen"}, {"id": 559, "start": 3453.24, "end": 3467.76, "text": "soll, nope, gleich kommen wir noch rein rechtzeitig, moin, Icarus, aber, so wird das nichts, so"}, {"id": 560, "start": 3467.76, "end": 3469.76, "text": "wird das nix"}, {"id": 561, "start": 3470.52, "end": 3473.08, "text": "Wir campen jetzt uns hier einfach rein ab leute, sag's euch"}, {"id": 562, "start": 3474.92, "end": 3476.92, "text": "Geile taktik sehr gut"}, {"id": 563, "start": 3478.96, "end": 3480.96, "text": "Lackt es? Lackt es leute?"}, {"id": 564, "start": 3482.08, "end": 3485.54, "text": "Sollte eigentlich nix sein? Nee, es lackt auch nix"}, {"id": 565, "start": 3485.54, "end": 3495.1, "text": "Okay, C2 kriegen wir für"}, {"id": 566, "start": 3495.1, "end": 3506.9, "text": "Es wäre sehr nice, wenn das sich bewegen würde"}, {"id": 567, "start": 3518.54, "end": 3521.34, "text": "Na geil, da ist dieser hässliche Pfosten dazwischen"}, {"id": 568, "start": 3521.34, "end": 3529.82, "text": "Kannste komplett knicken hier gerade die runde, ein nicer stahlträger"}, {"id": 569, "start": 3531.82, "end": 3533.82, "text": "Weiß nicht was wir da jetzt gescheit machen sollen"}, {"id": 570, "start": 3539.18, "end": 3543.56, "text": "Wir gucken mal, ob wir noch ein paar runden rush gleich spielen können, weil ansonsten halte ich das nicht aus"}, {"id": 571, "start": 3543.56, "end": 3554.48, "text": "Aber wenn man sieht die deckung und so, das ist schon in ordnung"}, {"id": 572, "start": 3554.48, "end": 3569.32, "text": "Die AC-42 irgendwie gut alles abgefuckte Pfosten"}, {"id": 573, "start": 3574.84, "end": 3578.02, "text": "AC-42, welche ist das? Das ist die burstwaffe"}, {"id": 574, "start": 3578.02, "end": 3584.42, "text": "Ah, wie ist denn die ACR? Die habe ich noch gar nicht ausprobiert. Das muss ich jetzt mal checken, ob das was taugt"}, {"id": 575, "start": 3586.74, "end": 3594.1, "text": "27 Schuss, das ist ja schepp. Was haben wir denn hier? Das da, das da, das da"}, {"id": 576, "start": 3594.1, "end": 3605.02, "text": "Okay, wir sollten uns mal verpissen"}, {"id": 577, "start": 3605.02, "end": 3619.82, "text": "Du kannst das, also irgendwie hier normal spielen, kannst du echt voll vergessen"}, {"id": 578, "start": 3619.82, "end": 3635.82, "text": "Einfach zu viel los"}, {"id": 579, "start": 3635.82, "end": 3641.22, "text": "Vielleicht ist das auch das dumme an den als defender auf der map"}, {"id": 580, "start": 3641.22, "end": 3652.98, "text": "Es sind halt 64 spieler auf einem punkt, das ist halt immer noch zu viel. Überlegt euch mal, das war ursprünglich gedacht für 128"}, {"id": 581, "start": 3652.98, "end": 3660.98, "text": "Da ging ja gar nichts, am anfang, am anfang zu release. Das einzige wo da was ging ist, wenn du zufällig geklitscht warst"}, {"id": 582, "start": 3660.98, "end": 3664.18, "text": "Sodass die gegner nicht gesehen haben, dass du ein gegner bist"}, {"id": 583, "start": 3664.18, "end": 3672.82, "text": "Vielleicht können wir wieder out of map, warte mal, lass mal probieren gerade"}, {"id": 584, "start": 3672.82, "end": 3695.46, "text": "Alter, das Ding macht ja gar keinen damage"}, {"id": 585, "start": 3695.46, "end": 3711.46, "text": "Okay, ich spiele jetzt das ding noch mal ein bisschen, der richtig pepega aimt, aber wie"}, {"id": 586, "start": 3711.46, "end": 3727.86, "text": "Mit dem ding, es ist mit dem ding gar nicht mal so einfach. Richtig pro aimed, aber wie im esl feine"}, {"id": 587, "start": 3741.86, "end": 3748.5, "text": "Jetzt überrennen sie das"}, {"id": 588, "start": 3748.5, "end": 3754.82, "text": "Spawnen und mal keinen damage kriegen vielleicht"}, {"id": 589, "start": 3754.82, "end": 3771.86, "text": "Ich habe keine ahnung, was hier abgeht"}, {"id": 590, "start": 3771.86, "end": 3781.46, "text": "Alles klar, genau da wollte ich hin, genau da, so war das gedacht und so nicht anders"}, {"id": 591, "start": 3781.46, "end": 3800.98, "text": "Alter, wie soll das denn funktionieren man"}, {"id": 592, "start": 3800.98, "end": 3818.5, "text": "So, mal einen motion sensor gucken, ob wir dann was besseres, ob wir dann sehen, was da abgeht"}, {"id": 593, "start": 3818.5, "end": 3825.46, "text": "Wie soll das eigentlich, wie hat man sich gedacht, dass es gespielt werden soll"}, {"id": 594, "start": 3825.46, "end": 3832.5, "text": "Mir fällt da gerade nichts wirklich dazu ein, haben wir irgendwas anderes, was ist denn das"}, {"id": 595, "start": 3832.5, "end": 3839.46, "text": "Nee, das ding sackt, das ist ganz gut"}, {"id": 596, "start": 3839.46, "end": 3846.98, "text": "Als ob die denken, ne wahrscheinlich nicht"}, {"id": 597, "start": 3846.98, "end": 3866.34, "text": "Erflanken kannst du halt bei einem Punkt auch nicht richtig"}, {"id": 598, "start": 3866.34, "end": 3878.98, "text": "Wie, ne das ist ja blöd, okay komm wir spielen die map jetzt noch fertig, danach spielen wir"}, {"id": 599, "start": 3878.98, "end": 3885.38, "text": "ein bisschen rush, das halte ich nicht lange aus diesem graben hier"}, {"id": 600, "start": 3885.38, "end": 3900.66, "text": "Wir gehen jetzt gleich zu E2, die gammeln sonst alle hier in diesem"}, {"id": 601, "start": 3900.66, "end": 3909.06, "text": "Das Ding zieht auch mega rauf, da ist mit long range auch nicht viel"}, {"id": 602, "start": 3909.06, "end": 3917.78, "text": "So, mal gucken, motion sensor, ja ja, guck mal hier, da ist noch schon was"}, {"id": 603, "start": 3917.78, "end": 3926.82, "text": "Die sind alle noch da oben"}, {"id": 604, "start": 3926.82, "end": 3937.78, "text": "Also der motion sensor ist doch nicht so der Wahnsinn, sollte glaube ich was anderes nehmen"}, {"id": 605, "start": 3937.78, "end": 3941.22, "text": "jetzt, was ist da hinter uns"}, {"id": 606, "start": 3941.22, "end": 3956.66, "text": "Äh, das down, null, was ist mit dem los, wait a minute, komm hier mal her"}, {"id": 607, "start": 3956.66, "end": 3968.5, "text": "Ah, da war noch einer"}, {"id": 608, "start": 3968.5, "end": 3976.26, "text": "Ja die Spielerzahlen werden jetzt erstmal wieder rauf gehen für, naja, 2 Wochen oder"}, {"id": 609, "start": 3976.26, "end": 3977.26, "text": "so"}, {"id": 610, "start": 3977.26, "end": 3978.82, "text": "Und das wars dann"}, {"id": 611, "start": 3978.82, "end": 3986.78, "text": "Also da sind auf jeden Fall noch welche da, es sei denn die sind reingegangen, die sind"}, {"id": 612, "start": 3986.78, "end": 3987.78, "text": "wahrscheinlich reingegangen"}, {"id": 613, "start": 3987.78, "end": 3992.42, "text": "Ich bleib bei E2, im Lagerhaus gammeln alle rum"}, {"id": 614, "start": 3992.42, "end": 4011.66, "text": "Was ist denn hier los, wow, schlechte Idee, schlechte Idee"}, {"id": 615, "start": 4011.66, "end": 4027.1, "text": "Sagen wir mal, die sterben auch nicht mehr, guck mal da ist wieder Prostata Royal"}, {"id": 616, "start": 4027.1, "end": 4030.22, "text": "Der Name man"}, {"id": 617, "start": 4030.22, "end": 4036.94, "text": "Ach die können, die können daraus ja abspringen"}, {"id": 618, "start": 4036.94, "end": 4045.34, "text": "Da kommt was, by the way, neues Spotting System, neues, neues Spotting System"}, {"id": 619, "start": 4045.34, "end": 4049.26, "text": "Man kann als Gegner spotten, muss man wieder angewöhnen"}, {"id": 620, "start": 4049.26, "end": 4068.9, "text": "Das halte ich nicht aus, Breakthrough auf Dauer wird so anstrengend"}, {"id": 621, "start": 4068.9, "end": 4073.98, "text": "Ohne Front, wo du nicht weißt, wo du hin musst, also wo du hin kannst"}, {"id": 622, "start": 4073.98, "end": 4079.78, "text": "Oh jetzt kriegen wir aber auf den Sack, ok, gehen wir mal lieber nach E1 rein"}, {"id": 623, "start": 4079.78, "end": 4084.66, "text": "Haben wir vielleicht noch irgendwelche Chancen, wenn die sich jetzt auf E2 konzentrieren,"}, {"id": 624, "start": 4084.66, "end": 4085.66, "text": "da wieder was einzunehmen"}, {"id": 625, "start": 4085.66, "end": 4091.02, "text": "Ja guck mal, jetzt können wir E1 einnehmen"}, {"id": 626, "start": 4091.02, "end": 4104.18, "text": "Ok, ok, vielleicht haben wir Glück"}, {"id": 627, "start": 4104.18, "end": 4131.82, "text": "Nice, nice, nice, in den Bobbles man, throwing knife, endlich, ok, nice, das ist zum ersten"}, {"id": 628, "start": 4131.82, "end": 4135.54, "text": "Mal, dass ich das gesehen habe, guck mal, der knifet gerade alle"}, {"id": 629, "start": 4135.54, "end": 4140.5, "text": "Nice, das ist das erste Mal, dass ich das gesehen habe"}, {"id": 630, "start": 4140.5, "end": 4149.06, "text": "Ok, da oben drauf ist ja ne ganz doof Idee"}, {"id": 631, "start": 4149.06, "end": 4160.18, "text": "Die kommen garantiert von E jetzt rüber gerannt"}, {"id": 632, "start": 4160.18, "end": 4168.7, "text": "Alter, mit dem Ding ist auf Range nix"}, {"id": 633, "start": 4168.7, "end": 4172.1, "text": "Kannste komplett knicken"}, {"id": 634, "start": 4172.1, "end": 4180.18, "text": "Auf Range geht nix"}, {"id": 635, "start": 4180.18, "end": 4182.26, "text": "Ohne Scheiß, das ist komplett ppega"}, {"id": 636, "start": 4182.26, "end": 4191.5, "text": "Please, midi pack, heil mich doch"}, {"id": 637, "start": 4191.5, "end": 4201.9, "text": "Alter, kann es mich, wozu ist das denn da, wenn es eigentlich heilt"}, {"id": 638, "start": 4201.9, "end": 4206.62, "text": "Nee, midi pack ist auch Sack"}, {"id": 639, "start": 4206.62, "end": 4212.3, "text": "Gibt es irgendwelche gescheiten Heil-Items, midi pack heilt eigentlich, midi pen kackt"}, {"id": 640, "start": 4212.3, "end": 4214.34, "text": "ab, während man Damage bekommt"}, {"id": 641, "start": 4214.34, "end": 4222.3, "text": "Nee, gibt nix, useless"}, {"id": 642, "start": 4222.3, "end": 4224.02, "text": "Ok, nice, danke"}, {"id": 643, "start": 4224.02, "end": 4225.82, "text": "Entschuldigung, dass ich nicht gestorben bin"}, {"id": 644, "start": 4225.82, "end": 4238.38, "text": "Oh, jetzt kommt hier was ordentlich rüber gepusht"}, {"id": 645, "start": 4238.38, "end": 4246.94, "text": "Ppega aimt wieder, so wie das sein muss"}, {"id": 646, "start": 4246.94, "end": 4274.38, "text": "Also Spotting, das mit Spotting ist tatsächlich gar nicht so blöd"}, {"id": 647, "start": 4274.38, "end": 4280.3, "text": "Ich finde das wirklich gut, dass Spotting jetzt am Start ist"}, {"id": 648, "start": 4280.3, "end": 4285.3, "text": "Also Spotting, was man so nennen kann, dass du Gegner anklicken kannst und dann werden"}, {"id": 649, "start": 4285.3, "end": 4287.1, "text": "die markiert"}, {"id": 650, "start": 4287.1, "end": 4290.5, "text": "Also das, was man halt so unter Spotting versteht"}, {"id": 651, "start": 4290.5, "end": 4296.7, "text": "Das ist tatsächlich ganz nice, dass das wieder mit von der Partie ist"}, {"id": 652, "start": 4296.7, "end": 4310.34, "text": "Ok, jetzt kommen sie von hier gleich rüber"}, {"id": 653, "start": 4310.34, "end": 4311.34, "text": "Oh, da sind schon Gegners"}, {"id": 654, "start": 4311.34, "end": 4317.7, "text": "Ah, shit, hätte ich schon ein bisschen besser getroffen"}, {"id": 655, "start": 4317.7, "end": 4336.78, "text": "Hätte ich locker haben können, oh nein, F, das war's, RIP, das war's"}, {"id": 656, "start": 4336.78, "end": 4338.66, "text": "Keine Chance mehr, das ist vorbei"}, {"id": 657, "start": 4338.66, "end": 4349.26, "text": "Wir können aber probieren, ran zu pushen, aber das wird eher nix werden"}, {"id": 658, "start": 4349.26, "end": 4368.9, "text": "Ok"}, {"id": 659, "start": 4368.9, "end": 4370.9, "text": "Oh mein Gott!"}, {"id": 660, "start": 4372.9, "end": 4373.9, "text": "Verdammt!"}, {"id": 661, "start": 4373.9, "end": 4375.9, "text": "Keine Ahnung!"}, {"id": 662, "start": 4387.9, "end": 4389.9, "text": "Fuck!"}, {"id": 663, "start": 4390.9, "end": 4392.9, "text": "Ach, das klappt."}, {"id": 664, "start": 4393.9, "end": 4394.9, "text": "Ah, nee, nee, nee."}, {"id": 665, "start": 4394.9, "end": 4395.9, "text": "Gut, wir haben unendlich Tickets."}, {"id": 666, "start": 4395.9, "end": 4399.9, "text": "Dann kann ich vielleicht rein spawnen bei dem Kerl da hinten."}, {"id": 667, "start": 4400.9, "end": 4401.9, "text": "Kommen wir da tatsächlich nochmal dran?"}, {"id": 668, "start": 4401.9, "end": 4403.9, "text": "Seriously?"}, {"id": 669, "start": 4406.9, "end": 4408.9, "text": "Okay, es war blöde."}, {"id": 670, "start": 4409.9, "end": 4411.9, "text": "Nicht, auch wenn ich auf die Map gucken soll."}, {"id": 671, "start": 4411.9, "end": 4415.9, "text": "Aber man muss seine unendlich Tickets einfach ausnutzen."}, {"id": 672, "start": 4415.9, "end": 4431.46, "text": "Oh oh oh oh und F Moment zwölf Auto Shotgun mit Silencer"}, {"id": 673, "start": 4431.46, "end": 4452.82, "text": "Das ist auch krasser Dude, äh, ein richtig nicer Dude, okay, man weiß, alles klar, alright,"}, {"id": 674, "start": 4452.82, "end": 4479.9, "text": "das ist ein guter Spot Leute, wo ist hier ein guter Spot, hier nicht, wo ist hier ein"}, {"id": 675, "start": 4479.9, "end": 4487.7, "text": "guter Spot, in diesen Gängen ist ziemlich errotz, man muss irgendwie oben, obendrauf,"}, {"id": 676, "start": 4487.7, "end": 4491.54, "text": "man muss das ausnutzen, dass man sein Enterhaken hat, das hier ist ja alles so flach, ich hab"}, {"id": 677, "start": 4491.54, "end": 4494.38, "text": "hier noch keine gescheiten, gescheiten Spots gefunden."}, {"id": 678, "start": 4494.38, "end": 4514.54, "text": "Oh, das sind zu viele Leute, aber immer schön Respawn als Defender, ich mein, scheiß drauf,"}, {"id": 679, "start": 4514.54, "end": 4518.86, "text": "guck mal, wir haben keine Respawn-Limits, die schon."}, {"id": 680, "start": 4518.86, "end": 4527.78, "text": "Oh nee, fuck, ganz schlecht, ganz, ganz schlecht."}, {"id": 681, "start": 4548.86, "end": 4556.18, "text": "Alter, diese Waffe auf Range, man, die kannst du nicht benutzen."}, {"id": 682, "start": 4556.18, "end": 4578.46, "text": "Pfeifhärte, ja, wir könnten, ich weiß jetzt, ich geh mal auf 1, ja, ich geh rüber auf"}, {"id": 683, "start": 4578.46, "end": 4579.46, "text": "1."}, {"id": 684, "start": 4579.46, "end": 4593.38, "text": "Müsste mal gleich noch ein paar Waffen durchprobieren, Alter, das kannste auch auf Range komplett"}, {"id": 685, "start": 4593.38, "end": 4608.34, "text": "klicken, das Ding, scheiße, man, das ist das, okay, das war jetzt Pepega-aimt, aber"}, {"id": 686, "start": 4608.34, "end": 4613.62, "text": "ich brauch irgendwas, wo man so auf mittlere Range was trifft, das Ding macht übelst Damage"}, {"id": 687, "start": 4613.62, "end": 4620.22, "text": "auf Nah, das ist okay, aber du kannst auf mittlere Range mit dem Ding nichts machen,"}, {"id": 688, "start": 4620.22, "end": 4621.22, "text": "gescheit."}, {"id": 689, "start": 4621.22, "end": 4638.26, "text": "Vielleicht hat es einen anderen Lauf, der taugt, äh, man kommt ein neuer PC im Dezember,"}, {"id": 690, "start": 4638.26, "end": 4653.06, "text": "höchstwahrscheinlich, höchstwahrscheinlich, jetzt kommen sie halt von der Seite gleich"}, {"id": 691, "start": 4653.06, "end": 4668.5, "text": "und ficken rein, gatschi best, bam, weiß gar nicht, auf wen du dich konzentrieren sollst,"}, {"id": 692, "start": 4668.5, "end": 4680.94, "text": "bleibt zwar einer Nvidia-Karte, ja, 4090, muss Geld loswerden, easy money, easy life,"}, {"id": 693, "start": 4680.94, "end": 4697.82, "text": "aber das geht alle, also das kriegste gar nicht, aber es geht, dann ist esB bloody,"}, {"id": 694, "start": 4697.82, "end": 4708.06, "text": "also mal aufterorse, okay, dann geht es weiter, sliced so, paarся mit Time, blitzuma,"}, {"id": 695, "start": 4708.06, "end": 4714.66, "text": "Kacke was war das man"}, {"id": 696, "start": 4714.66, "end": 4735.1, "text": "ok ich brauche immer noch einen guten spot hier leute was ist hier ein guter spot kann man da hoch"}, {"id": 697, "start": 4735.1, "end": 4748.26, "text": "oh leute wir können die runde sogar gewinnen ok was ist hier gibt es hier ein guter spot"}, {"id": 698, "start": 4748.26, "end": 4763.82, "text": "hier oben ist was auf dem präsentierteller hier jetzt hier kämpen hinter dem ding"}, {"id": 699, "start": 4763.82, "end": 4786.26, "text": "easy easy win wie auch immer wir das gewonnen haben keine ahnung und wie auch immer ich da"}, {"id": 700, "start": 4786.26, "end": 4795.78, "text": "ein 40 leute noch gekillt aber hast du auf steam wagfreies spiel wenn man wieder gesehen hat ne"}, {"id": 701, "start": 4795.78, "end": 4802.1, "text": "ne origin und ich muss das mir glücklicherweise auch nicht kaufen mal davon abgesehen das war"}, {"id": 702, "start": 4802.1, "end": 4806.18, "text": "mit sicherheit mein letztes battlefield was ich gesponsert bekommen habe weil ich habe ja kein"}, {"id": 703, "start": 4806.18, "end": 4810.62, "text": "gutes haar an dem spiel gelassen und das ist nicht gut angekommen die lagen mich nie wieder"}, {"id": 704, "start": 4810.62, "end": 4816.14, "text": "zu irgendwelchen events ein es juckt mich nicht ja wurde ich vorher auch jahrelang schon nicht"}, {"id": 705, "start": 4816.14, "end": 4823.98, "text": "ist nicht so dass mich das großartig interessieren würde ok lasst uns mal schnell mal einen blick in"}, {"id": 706, "start": 4823.98, "end": 4831.26, "text": "den battle pass werfen was wir da so haben und da was man da anlocken kann dann spielen wir vielleicht"}, {"id": 707, "start": 4831.26, "end": 4836.54, "text": "noch eine runde breakthrough leute ihr könnt euch auch so wollen wir noch ein paar runden"}, {"id": 708, "start": 4836.54, "end": 4842.06, "text": "russ spielen das ist dann halt nicht garantiert die neueste map aber die chance eine gescheite"}, {"id": 709, "start": 4842.06, "end": 4846.42, "text": "map zu bekommen sind deutlich höher oder wollen wir noch ein bisschen breakthrough spielen russ"}, {"id": 710, "start": 4846.42, "end": 4858.14, "text": "ok was haben wir jetzt was horthorn weiß ich ob das taugt ok wir brauchen auch irgendwie mal"}, {"id": 711, "start": 4858.14, "end": 4862.9, "text": "eine ordentliche waffe was was könnte man denn spielen das ding wurde zu tode genervt das ding"}, {"id": 712, "start": 4862.9, "end": 4872.34, "text": "wurde auch zu tode genervt pp 29 weiß ich ob die was taugt von den assault rifles also die"}, {"id": 713, "start": 4872.34, "end": 4880.42, "text": "ac erst sagt 16 habe ich nicht anlockt das ding ist ganz gut allerdings definitiv nicht auf mittlere"}, {"id": 714, "start": 4880.42, "end": 4885.18, "text": "und weiter range kannst du null mit anfangen habe ich nicht wirklich gespielt das ding habe"}, {"id": 715, "start": 4885.18, "end": 4893.58, "text": "ich auch nicht wirklich gespielt bleibt ja eigentlich nur das teil hat er nicht so viele"}, {"id": 716, "start": 4893.58, "end": 4900.94, "text": "waffen a shot gun shot ne ne ne das war damit fangen wir gar nicht erst an das neue manifest"}, {"id": 717, "start": 4900.94, "end": 4918.26, "text": "schon da nein ist es nicht neue manifest kommt mit dem update 3.1 das kommt vor weihnachten"}, {"id": 718, "start": 4930.94, "end": 4941.46, "text": "heißt im endeffekt auch nie discredit jetzt wird es was hier eine der schlimmsten maps"}, {"id": 719, "start": 4941.46, "end": 4951.7, "text": "überhaupt hardcore hardcore ppega map ob sie irgendwas runtergeschmissen und ich weiß nicht"}, {"id": 720, "start": 4951.7, "end": 4968.34, "text": "was"}, {"id": 721, "start": 4968.34, "end": 4986.9, "text": "wird dir doch mehr"}, {"id": 722, "start": 4986.9, "end": 5013.38, "text": "Okay easy, lege Henne, nee Entschärfungshenne, lege Henne ist ja nur Attacker, oder kommt"}, {"id": 723, "start": 5013.38, "end": 5026.1, "text": "noch was, oder? Oder ist das über uns? Der hat sich das etwas, ach nice, der hat sich"}, {"id": 724, "start": 5026.1, "end": 5034.5, "text": "das etwas anders vorgestellt. Düt, düt, düt, düt. Ich würde gern oben auf das Schiff"}, {"id": 725, "start": 5034.5, "end": 5046.74, "text": "drauf. Die Fresse mal. Ja, dann nehme ich auch die andere Waffe jetzt, es sei denn ich"}, {"id": 726, "start": 5046.74, "end": 5053.02, "text": "werde wiederbelebt, soll ich wiederbelebt werden, dann nope werde ich nicht, ihr belebt"}, {"id": 727, "start": 5053.02, "end": 5063.58, "text": "mich nicht wieder. Dann nehme ich die andere, die da, please, please nicht sterben, nein"}, {"id": 728, "start": 5063.58, "end": 5071.74, "text": "nicht sterben. F. Warum kann sich das Ding eigentlich nicht merken, was man ausgerüstet"}, {"id": 729, "start": 5071.74, "end": 5082.82, "text": "hatte? Ist da, ist die, ist da die Technology, ist die Technology nicht da? Ich glaube die"}, {"id": 730, "start": 5082.82, "end": 5097.06, "text": "Technology ist nicht da dafür. Sie ist nicht ready, jupp. Eindeutig, sehe ich auch so."}, {"id": 731, "start": 5097.06, "end": 5101.06, "text": "Offensichtlich, ich meine nur weil Sachen vor 20 Jahren funktioniert haben, heißt es"}, {"id": 732, "start": 5101.06, "end": 5105.14, "text": "ja noch lange nicht, dass es heute auch wieder funktioniert. Guckt euch mal die Mondlandung"}, {"id": 733, "start": 5105.14, "end": 5113.06, "text": "an, wir sind auch auf dem, wir sind auch auf dem Mond geflohen und jetzt wissen wir nicht"}, {"id": 734, "start": 5113.06, "end": 5118.98, "text": "mehr wie es geht. Hi IQ Play. Ich kann da nicht hin, wenn ich dahingehe bin ich down."}, {"id": 735, "start": 5118.98, "end": 5124.82, "text": "Ok, ich probiere es trotzdem. Ich probiere es, aber im Moment, es ist gar nicht hier,"}, {"id": 736, "start": 5124.82, "end": 5140.66, "text": "cool, es ist auf der anderen Seite. Ok, bis der da ist habe ich defused. Lege Hände, bewegen,"}, {"id": 737, "start": 5140.66, "end": 5157.22, "text": "bewegen, bewegen, bewegen. Nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein,"}, {"id": 738, "start": 5157.22, "end": 5160.82, "text": "nein, nein, nein, nein, nein, nein. Das war close. Ich höre total viele rennen und ich"}, {"id": 739, "start": 5160.82, "end": 5161.82, "text": "Ich weiß nicht wo, Leute."}, {"id": 740, "start": 5190.82, "end": 5206.74, "text": "Wo sind denn die? Sind die da oben? Die haben noch 10. Komm noch 10, das kriegen wir defended."}, {"id": 741, "start": 5206.74, "end": 5214.98, "text": "Ich camp jetzt hier ab bis die Tickets weg sind. Au! Ich weiß nicht genau von wo."}, {"id": 742, "start": 5214.98, "end": 5223.66, "text": "Jetzt liegt es wieder an mir, dass wir verlieren. Leute, die sehen ihn wieder nicht. Die sehen"}, {"id": 743, "start": 5223.66, "end": 5232.62, "text": "ihn wieder nicht. Doch, doch. Sehen ihn. Leute, noch 5 Tickets, Mann. Please. Die legen wieder."}, {"id": 744, "start": 5232.62, "end": 5241.78, "text": "Die lege Henne. Die lege Henne ist aktiv und jetzt kriegen sie es auch. Gechockt hat er da, Max."}, {"id": 745, "start": 5241.78, "end": 5267.78, "text": "War nicht ESL Finals würdig hier. Oh, ganz blöde Idee. Hallo, please."}, {"id": 746, "start": 5271.78, "end": 5296.66, "text": "Hauen sie alle ab? Sollte das? Könnte ich einfach abhauen?"}, {"id": 747, "start": 5296.66, "end": 5308.14, "text": "Okay, das war PP-Gard, hoch 10. Aber nach unten ist auch schwierig mit dem Ding."}, {"id": 748, "start": 5308.14, "end": 5335.14, "text": "Oh, ich höre hier so viel rennen. Was piepst denn hier eigentlich so? Location revealed."}, {"id": 749, "start": 5335.14, "end": 5346.26, "text": "Wie? Warum ist meine Location revealed? Was ist da los? Und warum höre ich 30 Gegner um"}, {"id": 750, "start": 5346.26, "end": 5351.66, "text": "mich drum herum, obwohl gar keiner da ist? Und warum ist hier zu und Fragen über Fragen?"}, {"id": 751, "start": 5351.66, "end": 5362.54, "text": "Warum ist hier zu? Bin getaggt vom Commander. Okay, PP-Gard. Warum bin ich... Ach, weil"}, {"id": 752, "start": 5362.54, "end": 5366.74, "text": "ich... Ich weiß es, weil ich jetzt... Die haben gelegt und ich bin in der Off-Zone."}, {"id": 753, "start": 5366.74, "end": 5379.66, "text": "Ach so. Letztes Mal, wenn man das Spiel nicht versteht. Ist das Spiel sein Gelbwert? Nee,"}, {"id": 754, "start": 5379.66, "end": 5388.94, "text": "ich würde es auf keinen Fall kaufen. Komm mal, der erste hat 43 und ansonsten sind alle immer"}, {"id": 755, "start": 5388.94, "end": 5416.66, "text": "gelieft hier. Oh, da oben steht einer. Wir sind doch bestimmt noch mehr, oder? Dachte"}, {"id": 756, "start": 5416.66, "end": 5425.54, "text": "ich mir doch. Das dachte ich mir doch, dass hier noch mehr sind. Die sind doch nicht alleine."}, {"id": 757, "start": 5425.54, "end": 5433.42, "text": "Okay, jetzt höre ich jede Menge Leute rennen, aber das sind, glaube ich, meine. Oder das"}, {"id": 758, "start": 5433.42, "end": 5442.58, "text": "sind meine? Wie läuft man hier am besten? Oh, da oben ist ein Schneiber, Dude. Alter,"}, {"id": 759, "start": 5442.58, "end": 5452.78, "text": "Schneiber, Mann. Okay, der hat mir einen Fuß geschossen. Ja, also ihr könnt es übrigens,"}, {"id": 760, "start": 5452.78, "end": 5457.14, "text": "im Dezember könnt ihr es kostenlos spielen. Ich glaube, 1. Dezember bis 5. Dezember oder"}, {"id": 761, "start": 5457.14, "end": 5466.38, "text": "sowas. Ich weiß es aus dem Kopf nicht genau. Und auf dem PC war das, glaube ich. Wir gucken"}, {"id": 762, "start": 5466.38, "end": 5477.02, "text": "jetzt mal, ob wir den Schneiber, Mann, da oben erwischen. Oh fuck, ich bin hängen geblieben"}, {"id": 763, "start": 5477.02, "end": 5483.74, "text": "an diesem scheiß Boden, Alter. Ich denke sonst, Alter, warum geht mein Fahnenkreuz nicht"}, {"id": 764, "start": 5483.74, "end": 5509.7, "text": "nach links? Ich war stuck. Oh, Mann. Okay, Alter. Oh, fuck. Du. Oh, Mann. Oh, Mann."}, {"id": 765, "start": 5509.7, "end": 5530.34, "text": "Okay, down. Das sind zu viele da oben, Mann. Ja, manchmal kriegt der Boomer Donnerwasser"}, {"id": 766, "start": 5530.34, "end": 5540.94, "text": "auf die Reihe. Too much. Aber guck mal, wir wissen, dass die alle da drinnen sitzen."}, {"id": 767, "start": 5540.94, "end": 5548.42, "text": "Und by the way, warum ist diese Kanone so mies? Okay, schnell, schnell, schnell. Vielleicht"}, {"id": 768, "start": 5548.42, "end": 5571.82, "text": "haben wir Glück. What the fuck, Mann? Ich dachte nur, ich war das, man überhaupt aimen"}, {"id": 769, "start": 5571.82, "end": 5592.06, "text": "kann. Das steht einfach auf der beiden Seite. Okay, ich gebe zu high IQ Plays den anderen."}, {"id": 770, "start": 5592.06, "end": 5595.78, "text": "Oh, please, lass mich reinspornen, Buddy. Alter, lass mich reinspornen. Ja, ja, ja,"}, {"id": 771, "start": 5595.78, "end": 5618.14, "text": "sehr gut, sehr gut. Excellent. Ah, ja. Nice. Nice, nice, nice, nice. Die legen wieder,"}, {"id": 772, "start": 5618.14, "end": 5638.98, "text": "die lege Henne ist am Start. Mächtige lege Henne. Okay, MVP Play. Wir haben es. ESL"}, {"id": 773, "start": 5638.98, "end": 5650.7, "text": "Finals, deutscher Meister. Wir haben es geschafft. Ging doch eigentlich echt gut, für dass wir"}, {"id": 774, "start": 5650.7, "end": 5661.02, "text": "quasi erst so im letzten Drittel reingejoint sind. Ist das die neue Schiff Map? Nein, Mensch,"}, {"id": 775, "start": 5661.02, "end": 5679.78, "text": "das ist die Container Map. Siehst du das nicht? Obviously. Continue. Was haben wir denn unlockt?"}, {"id": 776, "start": 5679.78, "end": 5687.86, "text": "Oh, XP haben wir unlockt, Leute. Und dann unlocken wir als nächstes die Sniper. Okay."}, {"id": 777, "start": 5687.86, "end": 5708.78, "text": "Wie löst man denn diese XP Token überhaupt ein? Was ist jetzt? Okay. Leute, Qt das jetzt"}, {"id": 778, "start": 5708.78, "end": 5721.26, "text": "noch? Da unten dreht sich. Bedeutet das, ich bin noch in der Q? Oder bin ich irgendwie aus der Q jetzt"}, {"id": 779, "start": 5721.26, "end": 5740.62, "text": "raus? Wie ist Battlefield zur Zeit? Naja, es ist halt Battlefield. Man kann es, wenn man ab und zu"}, {"id": 780, "start": 5740.62, "end": 5744.98, "text": "mal Battlefield spielen will, schon spielen, aber es ist kein gutes Battlefield und wird es"}, {"id": 781, "start": 5744.98, "end": 5751.62, "text": "wahrscheinlich auch nie werden. Das fühlt sich seit 1, 2 Patches zum ersten Mal wirklich nach"}, {"id": 782, "start": 5751.62, "end": 5763.02, "text": "einem halbwegs zusammenhängenden Spiel an. Oh, die fast neue Map. Die fast neue Map. Die Map,"}, {"id": 783, "start": 5763.02, "end": 5773.5, "text": "wo sie sich noch mit am meisten Mühe gegeben haben. Wie soll das mal in Amazon Prime packen?"}, {"id": 784, "start": 5773.5, "end": 5778.86, "text": "Du kannst kostenlos, glaube ich, spielen, 1. bis 5. 12. auf dem PC und dir das angucken. Es gibt"}, {"id": 785, "start": 5778.86, "end": 5786.78, "text": "garantiert bald irgendwelche... Ja, please. Hallo, ich möchte spawnen bei dir. Darf ich bei dir spawnen?"}, {"id": 786, "start": 5786.78, "end": 5806.26, "text": "Mensch, das ist auch immer geil, wenn es die Hälfte vergisst. Was ist Messer? F, okay."}, {"id": 787, "start": 5806.26, "end": 5833.98, "text": "Okay, Achtung. Okay, nice, GG. B, der ist nicht gestorben gerade, null."}, {"id": 788, "start": 5833.98, "end": 5846.3, "text": "Das habt ihr euch anders vorgestellt, oder? Alter mein, ey man, was ist das? Okay,"}, {"id": 789, "start": 5846.3, "end": 5850.1, "text": "wie gesagt, ich hab nicht die richtigen Settings. Ich hab ja gesagt, da kann ich mich mit rausgehen."}, {"id": 790, "start": 5850.1, "end": 5862.62, "text": "Ist da hinter uns was? Nee, oder? Okay, pass mal auf. Scheibe kaputt machen und jetzt und jetzt und"}, {"id": 791, "start": 5862.62, "end": 5888.7, "text": "jetzt. Massive. Wie gesagt, ich komm noch irgendwie weg. Achtung, Epilepsiewarnung,"}, {"id": 792, "start": 5888.7, "end": 5911.54, "text": "MonkaS, game, please. Oh."}, {"id": 793, "start": 5918.7, "end": 5944.34, "text": "Wo war der jetzt genau? Ach, der hat da hinten rausgehackt. Verstehen, ach klar. Nice Posey,"}, {"id": 794, "start": 5944.34, "end": 5952.94, "text": "sehr gute Posey, Kollege. Exzellente Posey. Six header, seven header, eight, nine, ten header Posey."}, {"id": 795, "start": 5952.94, "end": 5976.38, "text": "Na, hit nice hab ich doch. Morris. Okay."}, {"id": 796, "start": 5982.94, "end": 5992.5, "text": "Shit, den hab ich nicht gesehen. Ich hab extra versucht, das ganze Lagerhaus zu"}, {"id": 797, "start": 5992.5, "end": 5998.5, "text": "klären. Den hab ich nicht gesehen in der Ecke. Ja, das ist total vielen Bereichen,"}, {"id": 798, "start": 5998.5, "end": 6009.38, "text": "ist das Game broken. Broken as fuck. Nein, die sind respawned. Shit, die sind schon wieder da."}, {"id": 799, "start": 6009.38, "end": 6016.14, "text": "Sonst wäre er dran gewesen hinter seiner Kackkiste. Da ist in der Zwischenzeit keiner drinnen. Na gut."}, {"id": 800, "start": 6016.14, "end": 6038.9, "text": "Kommt vor. Wieder lebt oder was? Shit, ich glaube, das hätten wir jetzt kriegen können."}, {"id": 801, "start": 6038.9, "end": 6047.42, "text": "Jetzt hätten wir es glaube ich kriegen können. Ich glaube, außer mir schlicht und ergreifend"}, {"id": 802, "start": 6047.42, "end": 6059.5, "text": "keiner was gekillt. 19 Euro auf Steam, hm. Ja, kann man machen, ganz ehrlich. Wenn man"}, {"id": 803, "start": 6059.5, "end": 6065.42, "text": "Battlefield mag und es hat ja im Kern noch Battlefield-Gameplay in sich, wenn halt auch"}, {"id": 804, "start": 6065.42, "end": 6075.34, "text": "einiges fehlt und eigentlich nur das gut ist, was man halt nicht krampfhaft überarbeiten musste."}, {"id": 805, "start": 6075.34, "end": 6081.34, "text": "Aber für 19 Euro, wenn man sich so mal seinen monatlichen Dosis Battlefield holen will,"}, {"id": 806, "start": 6081.34, "end": 6105.26, "text": "kann man das schon machen. Hol dir lieber paar Döner, da hast du mehr von. Also Stunden"}, {"id": 807, "start": 6105.26, "end": 6109.58, "text": "insgesamt hast du trotzdem an Battlefield mehr Spaß. Allerdings muss ich sagen,"}, {"id": 808, "start": 6109.58, "end": 6114.74, "text": "ich bin eh kein Döner-Esser mehr in letzter Zeit, sondern wenn überhaupt bestelle ich"}, {"id": 809, "start": 6114.74, "end": 6121.22, "text": "mir meistens Köfte-Teller. Döner, gut, mein ab und zu jeder futtert ab und zu mal einen Döner,"}, {"id": 810, "start": 6121.22, "end": 6131.06, "text": "aber ich muss sagen, ich bin Köfte-Enjoyer mittlerweile. Köfte-Enjoyer. Oh, wir dürfen"}, {"id": 811, "start": 6131.06, "end": 6137.58, "text": "Erika Harbour spielen. Mal gucken, ob wir die erste Base überhaupt hinbekommen. Erika Harbour"}, {"id": 812, "start": 6137.58, "end": 6147.94, "text": "ist die erste Base. Sowas von Unbalanced. Wie sieht es mit Waffen aus? Ich zeige es dir"}, {"id": 813, "start": 6147.94, "end": 6155.74, "text": "gleich. Nicht wirklich besser. Hier, guck. Das war's. Soltreifel gibt es tatsächlich noch am meisten."}, {"id": 814, "start": 6155.74, "end": 6167.98, "text": "Oh, wir sind Defense. Smoke, Smoke. Erika Harbour ist Smoke nicht verkehrt, allerdings nicht"}, {"id": 815, "start": 6167.98, "end": 6192.1, "text": "auf Defense. Wir bleiben dabei. Also Erika Harbour klappt entweder der erste Push direkt"}, {"id": 816, "start": 6192.1, "end": 6198.5, "text": "oder, oh, wie es ruckelt, oder es ist für die Attacker ziemlich schwierig. Also erste Base"}, {"id": 817, "start": 6198.5, "end": 6205.5, "text": "Erika Harbour ist ziemlich Defense-Heavy, aber es klappt. Also es kann durchaus klappen,"}, {"id": 818, "start": 6205.5, "end": 6214.78, "text": "aber meistens klappt es dann schnell, wenn überhaupt. Ich bin mir nicht ganz sicher von wo,"}, {"id": 819, "start": 6214.78, "end": 6225.82, "text": "außer dass die wahrscheinlich von der anderen Seite pushen. Kommt man hier rauf? Ich weiß"}, {"id": 820, "start": 6225.82, "end": 6246.02, "text": "das gar nicht mehr. Kommt man hier rauf? Nee, ne? Kacke. Geht nicht. Ne, ne, ne. Also."}, {"id": 821, "start": 6246.02, "end": 6260.34, "text": "Einfach ein bisschen wackeln, dann geht das. Okay, easy. Oh, ich werde gesniped. Nein,"}, {"id": 822, "start": 6260.34, "end": 6265.26, "text": "nein, nein. Hörst du auf mich zu snipen. Du hörst auf mich zu snipen. Au, hör auf mich"}, {"id": 823, "start": 6265.26, "end": 6281.78, "text": "zu snipen. Lass mich in Ruhe. Im RPG. Finde es gut, dass man die Waffe jede Runde neu konfigurieren"}, {"id": 824, "start": 6281.78, "end": 6287.02, "text": "muss, damit sie nicht speichert. Ich finde das nicht gut. Warum sollte der das nicht"}, {"id": 825, "start": 6287.02, "end": 6293.62, "text": "speichern? Das ist eigentlich bescheuert, dass er das nicht speichert. Du meinst, dass"}, {"id": 826, "start": 6293.62, "end": 6301.38, "text": "er dann automatisch immer das nimmt, was auf 1 ist? Ich weiß nicht. Nein, nein, nein,"}, {"id": 827, "start": 6301.38, "end": 6308.46, "text": "nein, nein, Leute. So nicht. Ich weiß nicht von wo, ich weiß nicht von wo, aber vielleicht"}, {"id": 828, "start": 6308.46, "end": 6317.5, "text": "von da? Hier vielleicht? Nein, das habe ich nicht gemarkt. Das habe ich gemarkt. Ich"}, {"id": 829, "start": 6317.5, "end": 6326.74, "text": "dachte doch, Erika Harbor ist ziemlich schwierig für die Attacker. Oh, ich höre da was hinter"}, {"id": 830, "start": 6326.74, "end": 6347.46, "text": "mir. Da oben, oder? Aha. Lul. Ok, mal gucken, ob wir da hochkommen. Und ob da noch was ist"}, {"id": 831, "start": 6347.46, "end": 6358.7, "text": "da? Da war was? No Pass. Sind die alle gelieft? Nö. Sind alle noch da? Oh, die habe ich zu"}, {"id": 832, "start": 6358.7, "end": 6366.9, "text": "spät gesehen. Aggressive Freaking L690, ja. Goll. Goll und wie ist das Ding SV? Ne, du"}, {"id": 833, "start": 6366.9, "end": 6390.26, "text": "meinst SV96, nicht L690. SV96, oder? Ist das Ding nicht so? Shit, ich wollte noch weg."}, {"id": 834, "start": 6390.26, "end": 6400.22, "text": "Da steht eine Agony Saw. Das macht der Clever, so muss das machen. Sixheader. Alter, wo ist"}, {"id": 835, "start": 6400.22, "end": 6407.02, "text": "er? Alter, habt ihr gesehen wo unser Typ steht? Der will Long Range Sniper Shot Shit machen."}, {"id": 836, "start": 6407.02, "end": 6435.58, "text": "Die mag ich ja, die Leute, ey. Die mag ich ja. Die Long Range Sniper Dudes. Oh, oh."}, {"id": 837, "start": 6435.58, "end": 6443.18, "text": "Nein. Ah Shit, ich wollte aufs Dach. Bad Company 2 Maps, Leute, ich bin froh, dass die drinne"}, {"id": 838, "start": 6443.18, "end": 6448.38, "text": "sind. Sonst hätte ich ja noch weniger gescheite Maps. Jetzt haben sie gute Chancen. Jetzt"}, {"id": 839, "start": 6448.38, "end": 6452.34, "text": "haben sie gute Chancen das hinzukriegen. Ja, und das haben die gut gemacht. Normalerweise"}, {"id": 840, "start": 6452.34, "end": 6457.18, "text": "ist die erste Base wirklich schwierig. In Bad Company 2 konnte man das hier einschießen"}, {"id": 841, "start": 6457.18, "end": 6461.1, "text": "mit dem Panzer, dass man das quasi immer bekommen hat. Bin mir nicht sicher, ob das hier funktioniert."}, {"id": 842, "start": 6461.1, "end": 6482.54, "text": "Da oben was. Ja, da oben, da oben ist was, oder? Was ist das? Seht ihr da was? Meint ihr,"}, {"id": 843, "start": 6482.54, "end": 6489.5, "text": "da ist was? Ich trau mich jetzt nicht rüber zu laufen, weil, weil wenn ich rüber laufe"}, {"id": 844, "start": 6489.5, "end": 6498.02, "text": "und da ist nichts, ist es ziemlich verschenkt. Da smoket er sich ein. Ok, wir gehen mal ein"}, {"id": 845, "start": 6498.02, "end": 6513.62, "text": "bisschen an B gucken. So, wir haben mal nichts gegen den Panzer dabei und auch nicht so wirklich"}, {"id": 846, "start": 6513.62, "end": 6520.7, "text": "was gegen das Auto. Wir können die nur, wir können die nur, oh, da war was. Nee, das"}, {"id": 847, "start": 6520.7, "end": 6526.94, "text": "war meiner. Geht euch das auch so, dass diese Punkte teilweise, also entweder bin ich boomer"}, {"id": 848, "start": 6526.94, "end": 6538.62, "text": "hirn, kommt einfach nicht mit oder die Punkte ploppen manchmal zu spät rein. Ah, ich wollte"}, {"id": 849, "start": 6538.62, "end": 6565.1, "text": "dich gerade retzen. Ich blicke, wo ist hier was? Monkas. Achtung. Oh, oh, da sieht mich."}, {"id": 850, "start": 6565.1, "end": 6581.62, "text": "Ich weiß nicht genau, von wo, aber irgendwas hat mich gesehen. Ah, daneben. Ok. Ist der"}, {"id": 851, "start": 6581.62, "end": 6611.38, "text": "auf dem Dach? Oh. Hallo. Please. Oh. In the corp, man. Ok, ich glaube, wir haben es"}, {"id": 852, "start": 6611.38, "end": 6618.46, "text": "jetzt ganz gut unter Kontrolle gerade. Die Atmosphäre fehlt an schlechter Beleuchtung."}, {"id": 853, "start": 6618.46, "end": 6624.58, "text": "Hast du recht, die Map sieht schlechter aus als in Bad Company 2. Oder was findet ihr?"}, {"id": 854, "start": 6624.58, "end": 6633.94, "text": "Was, was findet ihr? Wo sah die Map besser aus? BZ2 oder hier? Also ich tendiere auch"}, {"id": 855, "start": 6633.94, "end": 6641.18, "text": "zu BZ2. Das war einfach irgendwie atmosphärischer. Es war ein bisschen Low-Res, Texturen waren"}, {"id": 856, "start": 6641.18, "end": 6647.86, "text": "nicht so gut, wobei Texturen im Spiel auch nicht wirklich, nicht gut sind. 100 mal besser,"}, {"id": 857, "start": 6647.86, "end": 6655.74, "text": "ja. Aber gerade der Sound in Bad Company 2 war einfach Wahnsinn. What? Alter, wie gut"}, {"id": 858, "start": 6655.74, "end": 6678.78, "text": "hat denn der getroffen durch das Fenster? What? What is that? Scheiße. Ich dachte, der"}, {"id": 859, "start": 6678.78, "end": 6690.22, "text": "ist down, ich kann switchen. No, jetzt legen sie. Lege Henne. Ja guck mal, Alter, wo stehen"}, {"id": 860, "start": 6690.22, "end": 6697.22, "text": "denn unsere Dudes rum? Wo stehen die denn rum? Komplett am Arsch der Welt, Mann. Offenberg."}, {"id": 861, "start": 6697.22, "end": 6712.34, "text": "So schlecht. Ok, ok, ok. Gib ihm alles. Lege Henne. Scheiße. Ich wäre fast noch rangekommen."}, {"id": 862, "start": 6712.34, "end": 6721.94, "text": "So knapp. Aber dafür wird die Map jetzt besser. Ist eigentlich nur von Vorteil. Die Map wird"}, {"id": 863, "start": 6721.94, "end": 6731.86, "text": "deutlich besser als in dieser kleinen Wüstenstadt oder was auch immer da unten. Also der erste"}, {"id": 864, "start": 6731.86, "end": 6751.3, "text": "Spot ist wirklich ziemlich mies. Ganz klar BZ2. Find ich auch. Find ich auch. Ok, mal"}, {"id": 865, "start": 6751.3, "end": 6758.34, "text": "gucken, dass die sich hier nicht durch mogeln. Was die wahrscheinlich gleich machen. Die"}, {"id": 866, "start": 6758.34, "end": 6763.5, "text": "mogeln sich bestimmt auf der anderen Seite durch hier. Guck mal, hier, hier. Hier ist"}, {"id": 867, "start": 6763.5, "end": 6768.82, "text": "der Mogelspot. Hier, außenrum normalerweise. Guck mal, da unten ist schon der erste Down."}, {"id": 868, "start": 6768.82, "end": 6787.42, "text": "Wo sind denn Gegner? Seht ihr Gegner? Also ich sehe wenig Gegner, wenn ich ehrlich bin."}, {"id": 869, "start": 6787.42, "end": 6806.5, "text": "Dabei sind das voll. Voller Server. Hallo? Gegner check. Ich hoffe das atmet nicht in"}, {"id": 870, "start": 6806.5, "end": 6817.42, "text": "die falsche Spawnge-Camp jetzt aus. Das muss ja wirklich nett sein. Normalerweise, wenn"}, {"id": 871, "start": 6817.42, "end": 6822.98, "text": "es die Gegner schaffen A einzunehmen, dann kriegen sie das hier auch hin. Weil A ist"}, {"id": 872, "start": 6822.98, "end": 6851.14, "text": "ziemlich schwierig. Also A schaffen meistens die meisten Attackerteams gar nicht. Oh, ich"}, {"id": 873, "start": 6851.14, "end": 6854.14, "text": "habe das richtig gesehen durch den Zaun. Aber vielleicht haben sie jetzt Chancen und"}, {"id": 874, "start": 6854.14, "end": 6873.42, "text": "kommen hier wenigstens durch. Naja, oder auch nicht. Also BZ2 fand ich nice. BZ2 hat aber"}, {"id": 875, "start": 6873.42, "end": 6879.7, "text": "auch seine Probleme, muss man ehrlich sagen. Hätte ich mich retzen lassen können. Also"}, {"id": 876, "start": 6879.7, "end": 6885.9, "text": "viele BZ2-Maps waren sehr Spawn-Camp-lastig. Also du konntest, wenn du ein bisschen besser"}, {"id": 877, "start": 6885.9, "end": 6890.7, "text": "warst oder generell, wenn du gute Posis hast und da ein bisschen was gehalten hast, konntest"}, {"id": 878, "start": 6890.7, "end": 6896.66, "text": "du ziemlich gut. Oh, guck mal, was kommt da oben? Die Gegner Spawn-Campen. Das ging in"}, {"id": 879, "start": 6896.66, "end": 6911.42, "text": "Battlefield 3 auch teilweise noch. Aber ich muss mal kurz hören. Ist der nicht mehr hier?"}, {"id": 880, "start": 6911.42, "end": 6933.74, "text": "Das war doch ein Gegner, oder? Bin ich blind? Ach, unter mir. Scheiße. Der hat auch noch"}, {"id": 881, "start": 6933.74, "end": 6943.02, "text": "darauf gewartet, dass ich die Treppe runterkomme. Hat er aber gut gemacht, weil jetzt weiß"}, {"id": 882, "start": 6943.02, "end": 6951.18, "text": "keiner, dass er da ist. Außer ich. Ich weiß es. Nichts wie hin. Lasst mich in Ruhe von"}, {"id": 883, "start": 6951.18, "end": 6971.42, "text": "da oben. Nichts wie hin. Ja, der ist bestimmt da noch drin, Leute. Nö. Ah, da war er. Lul."}, {"id": 884, "start": 6971.42, "end": 6982.5, "text": "Da kann man nicht mehr rein. Ja, der ist gestorben. Nicht von mir. Der hat einen anderen Typ gekillt."}, {"id": 885, "start": 6982.5, "end": 6995.06, "text": "Also ganz ehrlich, gerade funktioniert die Map in dem Spiel nicht gut. Der Fluss. Du"}, {"id": 886, "start": 6995.06, "end": 7000.5, "text": "kannst halt nicht 1-2-1 die Maps übernehmen und denken, es ist alles gut. Das Spiel funktioniert"}, {"id": 887, "start": 7000.5, "end": 7024.86, "text": "halt anders. Gehen die zu A? Oder wo gehen die hin? Das nicht. Mensch, Alter. Muss da"}, {"id": 888, "start": 7024.86, "end": 7053.78, "text": "mehr Burst schießen. Ach, von da drüben. Lul. Hab ich Glück gehabt. Der hätte mich"}, {"id": 889, "start": 7053.78, "end": 7059.66, "text": "gekillt, weil ich jetzt weiter so PP gehabt hätte und vor allem meine Muni leer gewesen"}, {"id": 890, "start": 7059.66, "end": 7064.9, "text": "wäre. Okay, wir haben es gleich, Leute. Wir haben es gleich geschafft. Ich weiß nicht,"}, {"id": 891, "start": 7064.9, "end": 7076.58, "text": "ob wir dann Attacker sind oder ob gleich die nächste Map gespielt wird. Oh, was ist hier"}, {"id": 892, "start": 7076.58, "end": 7096.18, "text": "los? Also ich höre auf jeden Fall Leute um mich drum herum laufen. Ich weiß halt nicht."}, {"id": 893, "start": 7096.18, "end": 7125.5, "text": "Oh, wo war der? Fuck. Hätte ja funktionieren können. Hätte ja funktionieren. Hätte ja"}, {"id": 894, "start": 7125.5, "end": 7130.38, "text": "funktionieren. Die kriegen es schon wieder auf den letzten Drücker hin. Das ist schon"}, {"id": 895, "start": 7130.38, "end": 7139.46, "text": "wieder auf den letzten Drücker hier. Da sind ein paar Stelsgegner. Ich camp mir jetzt einfach"}, {"id": 896, "start": 7139.46, "end": 7167.26, "text": "an B1 ab. Ist nichts mehr. Ist nichts. Haugt das was? Nee. Okay, die Waffe verhält sich"}, {"id": 897, "start": 7167.26, "end": 7171.74, "text": "definitiv nicht wie in BZ2. Absolut gar nicht."}, {"id": 898, "start": 7197.26, "end": 7224.9, "text": "Das sind meine? Das sind meine Dudes, ne? Glück gehabt. Alter, das ist nicht Portal,"}, {"id": 899, "start": 7224.9, "end": 7237.5, "text": "das ist im Main Game. Wir sollten es haben, denke ich. Ich wollte ihn eigentlich razen,"}, {"id": 900, "start": 7237.5, "end": 7255.26, "text": "aber weiß ja nicht. Oh, oh. In die Luft geflogen und Win. So, jetzt mal Attacker. Gib ihm."}, {"id": 901, "start": 7255.26, "end": 7263.46, "text": "Try the map, please. Wie soll man sich auch nicht verstehen? Warum ist dieses ganze Auto"}, {"id": 902, "start": 7263.46, "end": 7268.74, "text": "ein Intro Zeug so lang? Du brauchst ja... Hat mal jemand gestoppt, wie lange das braucht?"}, {"id": 903, "start": 7268.74, "end": 7273.18, "text": "Du brauchst bestimmt 2 Minuten, bis du im neuen Game drinne bist. Mit diesem ganzen"}, {"id": 904, "start": 7273.18, "end": 7280.38, "text": "Hin und Her. Ist das, dass die Boomer und die Casual Boomer nicht so sehr nerventechnisch"}, {"id": 905, "start": 7280.38, "end": 7283.98, "text": "am Ende sind, so nach dem Motto, jetzt ist die Runde vorbei, Alter. Jetzt muss ich erstmal"}, {"id": 906, "start": 7283.98, "end": 7287.62, "text": "aufs Klo gehen, ne Runde pinkeln, weil das war so aufregend, mal was zu trinken holen."}, {"id": 907, "start": 7287.62, "end": 7292.22, "text": "Boah, mal kurz raus auf den Balkon, mal ein bisschen durchatmen. Boah, war das anstrengend,"}, {"id": 908, "start": 7292.22, "end": 7297.62, "text": "ich bin ja kurz vor mir. Okay, jetzt geht die Runde wieder los. Weiß ich, warum das"}, {"id": 909, "start": 7297.62, "end": 7307.66, "text": "so lange dauert? Zigarettenpause, weiß ich nicht. Ich glaube, das dauert so ewig. Mir"}, {"id": 910, "start": 7307.66, "end": 7316.54, "text": "war es in Battlefield 3 schon zu lange. Ist das Spiel endlich spielbar? Ja, gut, spielbar"}, {"id": 911, "start": 7316.54, "end": 7328.54, "text": "ist es. Nervig ist es trotzdem. Ist Breakaway eigentlich schon überarbeitet jetzt? Ich"}, {"id": 912, "start": 7328.54, "end": 7338.1, "text": "bin ja auch nicht der typische Zielgruppenboomer. Ist Breakaway schon überarbeitet? Glaube"}, {"id": 913, "start": 7338.1, "end": 7346.38, "text": "nicht. Die wollen ja Breakaway überarbeiten und diese Ölplattform näher dran machen."}, {"id": 914, "start": 7346.38, "end": 7355.54, "text": "Erst im Januar, ja kann man schon verstehen, wenn man mit dem kompletten Team dran arbeitet,"}, {"id": 915, "start": 7355.54, "end": 7361.02, "text": "dass zwei Sachen verrücken auf der Map schon mal ein halbes Jahr dauert. Schon klar, schon"}, {"id": 916, "start": 7361.02, "end": 7381.42, "text": "klar. Logisch, ne? Das ganze Team, alle beide, ja genau. Alle beide arbeiten noch dran."}, {"id": 917, "start": 7381.42, "end": 7402.06, "text": "So, schauen wir mal. Was ist denn hier? Ist hier was? No Pulse. Wird? Wird? Na mal, Gegner"}, {"id": 918, "start": 7402.06, "end": 7416.74, "text": "please? Hallo? Sind welche da? Hallo, ich bin hier. Gegner? Mod check? Die sterben"}, {"id": 919, "start": 7416.74, "end": 7436.7, "text": "ja auch nicht hier. Enemy check? Hallo? Wie? Ach, ich hab ne langsame. Ok, wisst ihr was?"}, {"id": 920, "start": 7436.7, "end": 7447.06, "text": "Ich wollte da jetzt hin Yoloen. Ah shit, hätte ich mal ausprobieren können. Ja, Team mit"}, {"id": 921, "start": 7447.06, "end": 7453.14, "text": "zwei Personen. Alter, der Typ hat schon sieben, ne ne ne, siebener Score. Wollte grad sagen,"}, {"id": 922, "start": 7453.14, "end": 7457.34, "text": "sieben Kills, man. Wo hat er die denn her? Gab's überhaupt keine Gegner. Wo man die"}, {"id": 923, "start": 7457.34, "end": 7482.02, "text": "hätte bekommen können."}, {"id": 924, "start": 7482.02, "end": 7508.86, "text": "Please heal. Da ist TAX. Da ist doch bestimmt der einer hier. Ich seh nix. Ich seh nix."}, {"id": 925, "start": 7508.86, "end": 7525.02, "text": "Hier ist nix, oder? Nix da. Oh Gegner. Kommt man da rauf? Hey, das ging auch nicht von"}, {"id": 926, "start": 7525.02, "end": 7545.38, "text": "Anfang an, gell? Och Mensch, lass mir doch was übrig. Ich hab mich hier so schön angestellst"}, {"id": 927, "start": 7545.38, "end": 7562.7, "text": "von hinten und dann hab ich nix davon. Die Map ist äußerst balanced. Gerade. Massive"}, {"id": 928, "start": 7562.7, "end": 7578.14, "text": "balanced. Extremly balanced. Gibt das ein Scoreboard? Ja. Ach ne, bei Konsolen. Keine"}, {"id": 929, "start": 7578.14, "end": 7586.9, "text": "Ahnung. Ja, spielt sich besser als Durchbruch, das stimmt. Aber Breakthrough spielt sich"}, {"id": 930, "start": 7586.9, "end": 7596.62, "text": "fast überall müllig, deswegen. Deswegen mag ich Rush auch am besten, ehrlich gesagt,"}, {"id": 931, "start": 7596.62, "end": 7612.02, "text": "oder am liebsten. Rush ist pretty hog. Naja, ne, ehrlich gesagt nicht. Es ist erträglich."}, {"id": 932, "start": 7612.02, "end": 7632.54, "text": "Das war's aber auch. Ganz schlechte Idee. Ganz schlechte Idee da raus zu stürmen. Okay,"}, {"id": 933, "start": 7632.54, "end": 7639.94, "text": "wo geht hier was? Da unten? Ich seh nix. Ich seh nix. Wo denn? Wo denn? Au Mann. Okay,"}, {"id": 934, "start": 7639.94, "end": 7653.58, "text": "ich hol dich. Hallo, ich möcht dich resten. Alles schön. Okay. Pass mal auf, ob die auch"}, {"id": 935, "start": 7653.58, "end": 7664.02, "text": "so nett sind wie ich zu ihnen und mich retzen. Ich tippe auf nein. Oh, Wolfs Schnitzel."}, {"id": 936, "start": 7664.02, "end": 7681.1, "text": "Fahrgast Rest. Wolfs Schnitzel? Hieß der überhaupt Wolfs Schnitzel? Okay, YOLO Modus. Woah!"}, {"id": 937, "start": 7681.1, "end": 7703.54, "text": "Die kommen hier nicht wirklich raus, ne? Oh, der hätte sich abgefuckt, hätte ich ihn"}, {"id": 938, "start": 7703.54, "end": 7716.5, "text": "gekillt. Bin ich, bin ich ein nicer Head Clitcher? Finde schon, finde schon. Ich bin ein äußerst"}, {"id": 939, "start": 7716.5, "end": 7733.5, "text": "nicer Head Clitcher. Und ein Pepega-Amer darf man nicht vergessen. Ein richtig nicer"}, {"id": 940, "start": 7733.5, "end": 7749.14, "text": "Pepega-Amer. Aber zum Glück sind die Gegner noch mehr Pepega-Amer als ich. Kommst du"}, {"id": 941, "start": 7749.14, "end": 7774.46, "text": "raus? Mensch. Auf der Skala von eins bis zehn. Ach, Rush macht mir tatsächlich relativ"}, {"id": 942, "start": 7774.46, "end": 7783.9, "text": "viel Spaß. Ah, Shit. Rush geht, aber ich kann das jetzt auch nicht super lange, ich"}, {"id": 943, "start": 7783.9, "end": 7789.7, "text": "kann das jetzt keine vier, fünf Stunden oder so ein Stück spielen. Das kriege ich auch"}, {"id": 944, "start": 7789.7, "end": 7813.42, "text": "nicht. Okay, nice. Wo sind wir? Wo sind wir? Hier? Woah, woah, woah. Achtung, ich bin weg."}, {"id": 945, "start": 7813.42, "end": 7817.78, "text": "By the way, das ist so wackelnd, denk nicht an mir. Ich bewege mich nicht. Das wackelt"}, {"id": 946, "start": 7817.78, "end": 7826.78, "text": "so von sich aus. Weil es auch so wackelig ist, wenn man hier unter so einem Stück Metall"}, {"id": 947, "start": 7826.78, "end": 7833.94, "text": "liegt. Ich habe mich nicht bewegt. Aber ich glaube, wir kriegen das. Ich glaube, ich glaube,"}, {"id": 948, "start": 7833.94, "end": 7836.94, "text": "wir... Oh nee Mist, die sind alle da oder nicht? Ah, fuck. Aber die sind blöd, die"}, {"id": 949, "start": 7836.94, "end": 7847.94, "text": "rennen alle auf A und gucken nicht, dass wir hinterher rennen. Ein Diffuse-Cham. Diffusers."}, {"id": 950, "start": 7847.94, "end": 7874.94, "text": "Any diffusers. Lol. Kacke. Okay, okay, okay, okay, okay, okay, okay, okay, okay, okay,"}, {"id": 951, "start": 7874.94, "end": 7885.74, "text": "okay. Mann, Alter, was soll ich noch machen? Okay, der hatte die deutlich bessere Waffe"}, {"id": 952, "start": 7885.74, "end": 7890.26, "text": "dazu. Headshots, Headshots hätte ich ihm geben müssen. Dann hätte es funktioniert."}, {"id": 953, "start": 7890.26, "end": 7907.58, "text": "Ich kann dich nicht retzen, Leute, sorry. Wir müssen da irgendwie ran. Wir haben es"}, {"id": 954, "start": 7907.58, "end": 7914.98, "text": "ja gelegt. Die Legehänne ist ja am Start. Die Legehänne ist ja da. Die geht ja."}, {"id": 955, "start": 7914.98, "end": 7926.9, "text": "Ah, Gott, Alter. Okay, sinnlos reinrushen bringt gerade nichts. Die sehen nicht und wir"}, {"id": 956, "start": 7926.9, "end": 7931.5, "text": "sind... Ah nee, wir sind down. Noch sieben, noch sieben Tickets. Wird nichts. Nope. Keine"}, {"id": 957, "start": 7931.5, "end": 7936.02, "text": "Chance. Fertig. War's. GG Eats. Haben wir verloren. Mit sechs Tickets kriegen wir"}, {"id": 958, "start": 7936.02, "end": 7945.22, "text": "das nicht mehr hin. Was ist mit dir los? Fuck, ich habe ihn gesehen. Falls ihr denkt, ich"}, {"id": 959, "start": 7945.22, "end": 7953.26, "text": "habe ihn nicht gesehen, doch, doch, ich habe ihn gesehen. Ich weiß bloß nicht so genau,"}, {"id": 960, "start": 7953.26, "end": 7973.06, "text": "wo er ist. Wo ist er denn? Ich durfte ihn nicht mehr killen. Nice. Hat so gut angefangen."}, {"id": 961, "start": 7973.06, "end": 7990.18, "text": "Yo Max, yo. Max, 40 Gegner. Ja, man konnte nichts mehr machen. Battlefield 2042, besser."}, {"id": 962, "start": 7990.18, "end": 7994.38, "text": "Es wird mit jedem Patch ein bisschen besser, aber halt nicht jetzt irgendwie in der Geschwindigkeit,"}, {"id": 963, "start": 7994.38, "end": 7998.82, "text": "dass dann ein gescheites Game rauskommen würde, weil sie machen ja auch an der Substanz nichts"}, {"id": 964, "start": 7998.82, "end": 8006.34, "text": "mehr. Sie bringen eine Map, sie bringen einen Specialist, sie überarbeiten die Maps mit"}, {"id": 965, "start": 8006.34, "end": 8010.78, "text": "ein paar Containern, aber so grundsätzlich an diesem Spiel ändert sich ja nichts mehr,"}, {"id": 966, "start": 8010.78, "end": 8016.86, "text": "auch wenn sie sagen, sie sitzen mit dem gesamten Team dran. Ehrlich gesagt, es ist ziemlicher"}, {"id": 967, "start": 8016.86, "end": 8021.9, "text": "Bullshit aus meiner Sicht, ja. Ich glaube, ich habe auch noch keinen Battle Pass fertig"}, {"id": 968, "start": 8021.9, "end": 8025.7, "text": "gespielt in dem Spiel. Ich habe einfach nach so zwei, drei Tagen schon wieder keinen Bock"}, {"id": 969, "start": 8025.7, "end": 8030.34, "text": "gehabt. Ja. Der Hardcore-Cryen von Battlefield 3, der stellt sich bei mir da nicht wieder"}, {"id": 970, "start": 8030.34, "end": 8039.34, "text": "ein. Also PC2 habe ich krass gecrienet. BF3 habe ich krass gecrienet. BF4 ging so. Ähm."}, {"id": 971, "start": 8039.34, "end": 8050.22, "text": "Ja. WW3, ja. Ich will aber keinen Mail.ru Anti-Cheat. Was ist das eigentlich? Leute,"}, {"id": 972, "start": 8050.22, "end": 8056.58, "text": "was meint ihr? WW3 ist ja relativ, sagen wir mal, relativ Battlefield-ähnlich. Es ist"}, {"id": 973, "start": 8056.58, "end": 8067.54, "text": "ein bisschen ja noch realistischer gehalten als Battlefield. Aber was ist es, das eigentlich"}, {"id": 974, "start": 8067.54, "end": 8076.5, "text": "kaum Spieler anspricht? Wenn man sich das anguckt, es ist das Battlefield-ähnlichste"}, {"id": 975, "start": 8076.5, "end": 8085.02, "text": "Spiel zur Zeit, was nicht Battlefield ist. Und das hat 1000, 2000 Spieler. Also man kann"}, {"id": 976, "start": 8085.02, "end": 8092.18, "text": "jetzt nicht sagen, dass es da krasser Erfolg wäre. Oh, ich werde da lieber Attacker jetzt."}, {"id": 977, "start": 8092.18, "end": 8095.46, "text": "Geheul der Leute, weil es nicht lief. Naja, so ganz unbegründet scheint es ja nicht gewesen"}, {"id": 978, "start": 8095.46, "end": 8100.18, "text": "zu sein, wenn du schon sagst, es lief nicht. Oder meinst du, die gucken gar nicht mehr"}, {"id": 979, "start": 8100.18, "end": 8109.34, "text": "rein und jetzt läuft's. Äh, alles klar, nice. Dankeschön. Danke, dass ich nicht aufs Dach"}, {"id": 980, "start": 8109.34, "end": 8135.58, "text": "darf, easy. Pack, da sind Geister direkt vor mir. Easy. Die wollen da rein, die wollen's"}, {"id": 981, "start": 8135.58, "end": 8150.74, "text": "wissen. Ah, shit, oben war noch mehr. Alle killen kann ich jetzt auch nicht. Die sind"}, {"id": 982, "start": 8150.74, "end": 8156.22, "text": "gut. Oh, ist das wieder Discarded, Leute? Ist das schon wieder Discarded? Oh, please."}, {"id": 983, "start": 8156.22, "end": 8160.86, "text": "Okay, Leute, ich lief. Wenn wir das nicht halten, dann lief ich und suche einen neuen"}, {"id": 984, "start": 8160.86, "end": 8190.78, "text": "Sabber. Discarded ist wirklich so ne Rotswap. Yep, cock. Wow, wow, wow, okay, okay, okay,"}, {"id": 985, "start": 8190.78, "end": 8202.14, "text": "ich bin raus, ich bin raus. Oh, da ist einer, der sieht mich nicht. Nice, dankeschön. Kacke,"}, {"id": 986, "start": 8202.14, "end": 8212.54, "text": "null. Ich seh nix, Leute, das ist mein Problem, wo ist der Gegner? Oh, hab ich den PP gehabt,"}, {"id": 987, "start": 8212.54, "end": 8225.66, "text": "okay, ich hole euch, ich hole. Oh, da kommt einer. Fuck. Ja, du, hier, guckste dir an,"}, {"id": 988, "start": 8225.66, "end": 8234.14, "text": "ich resse euch und ihr macht Scheiß, macht ihr. Okay, er ist tot. Was ist das für ne Lobby?"}, {"id": 989, "start": 8234.14, "end": 8238.54, "text": "Das ist genau die richtige Lobby für mich, weil du hast ja gerade gesehen, ich treff"}, {"id": 990, "start": 8238.54, "end": 8245.9, "text": "auch nix oder darf man sich auch Gegner wünschen, die nix treffen. Oder ist es verwerflich?"}, {"id": 991, "start": 8245.9, "end": 8252.7, "text": "Ich finde nicht. Ich finde, wenn man selbst nix trifft, ist auch okay, das ist da nicht"}, {"id": 992, "start": 8252.7, "end": 8262.86, "text": "so, nicht so Geschwitze wie in MW2, sondern es treffen einfach alle nix. Achtung. A-LUL."}, {"id": 993, "start": 8262.86, "end": 8274.66, "text": "Nice, Bun. The Gurkenkahn. Wollte eigentlich aufs Dach, aber durch den Zaun wird das nix."}, {"id": 994, "start": 8274.66, "end": 8293.94, "text": "Gurkenkahn hat mich gebashed. Jawoll, jawoll, jawoll, jawoll, jawoll, jawoll. Nice, nice,"}, {"id": 995, "start": 8293.94, "end": 8314.74, "text": "oh oh, da wollte ich gar nicht. Sag mal, kann man da nicht rein? Kann man in das Auto nicht"}, {"id": 996, "start": 8314.74, "end": 8319.18, "text": "rein? Ist das ein ALV, sonst mobiler Spawnpunkt oder was ist das? Kann man da nicht rein?"}, {"id": 997, "start": 8319.18, "end": 8338.38, "text": "Ich glaube, man kann da nicht rein, gell? Mein Aim, einfach wieder on point heute. Komplett,"}, {"id": 998, "start": 8338.38, "end": 8351.46, "text": "komplett on point. Da macht mir keiner was vor heute. Okay, wie kriegen wir B-Defuse?"}, {"id": 999, "start": 8351.46, "end": 8373.18, "text": "Okay, Yolo, Yolo, nein, nicht Yolo, fuck. Ist verloren, shit. Bam, bababam."}, {"id": 1000, "start": 8373.18, "end": 8398.9, "text": "Oh, busy feel. Recoil wie ein Laser. Die ist gar nicht so einfach auf Range zu treffen."}, {"id": 1001, "start": 8398.9, "end": 8408.78, "text": "Sag ich jetzt nicht einfach so, guck mal. Also du musst tatsächlich ein bisschen ziehen,"}, {"id": 1002, "start": 8408.78, "end": 8415.18, "text": "dass es klappt. Ich meine, das ist jetzt keine AK aus CS oder so. Wie geht denn das"}, {"id": 1003, "start": 8415.18, "end": 8441.22, "text": "hier eigentlich? Weißt du, oh oh, oh oh. Hallo, ich würde den gerne retzen. Weißt du,"}, {"id": 1004, "start": 8441.22, "end": 8448.58, "text": "ernsthaft, der guckt dann auch noch dahin, wo ich da das rumhampeln mache. Ich geh mal"}, {"id": 1005, "start": 8448.58, "end": 8464.42, "text": "rüber zu A. Er scheint mir sinniger. Blyat. Ah, fuck. Hopp, hopp, hopp, hopp, hopp, hopp,"}, {"id": 1006, "start": 8464.42, "end": 8486.42, "text": "high speed. Das sind schon die ersten. Sag ich doch. He, Kekkel. Oh, MonkaW. Okay, Leute,"}, {"id": 1007, "start": 8486.42, "end": 8490.66, "text": "mir fällt nichts anderes ein. Motion Sensor und irgendwie Flanken. Mir fällt wirklich"}, {"id": 1008, "start": 8490.66, "end": 8503.3, "text": "gar nichts anderes ein. Das ist zu viel von allen Seiten. Alter, ich bin weg und schon"}, {"id": 1009, "start": 8503.3, "end": 8512.42, "text": "wach die Lege, Henne. Oh, ich bin im Motion Sensor. Kann das sein? Das ist ziemlich blöd"}, {"id": 1010, "start": 8512.42, "end": 8532.42, "text": "von mir. Pst, pst, pst, pst. Ich höre nichts. Dachte, die kommen hier wieder her. Machen"}, {"id": 1011, "start": 8532.42, "end": 8546.98, "text": "sie aber nicht. It's been destroyed. No shit. It's been destroyed."}, {"id": 1012, "start": 8562.42, "end": 8588.98, "text": "Ja meine Güte, ey. Wow, wow, wow, wow, wow. Sniper mal eine Runde. Ich sacken mit Sniper."}, {"id": 1013, "start": 8588.98, "end": 8602.98, "text": "Einzige Game, wo ich gut snipern konnte, war Bitshit 2. Oh, da kommt ein Panzer. Pass"}, {"id": 1014, "start": 8602.98, "end": 8607.06, "text": "mal auf, den verarsche ich jetzt. Sobald er hier lang fährt, springe ich über den Zaun,"}, {"id": 1015, "start": 8607.06, "end": 8614.18, "text": "dann sieht er mich nicht mehr. Pass mal auf, easy, easy, easy clap. Oh nee, jetzt legen"}, {"id": 1016, "start": 8614.18, "end": 8638.5, "text": "wir das Ganze. Fuck. Shit, ich hab's probiert. Warum hab ich 24-5, Mann? Nicest Video hast"}, {"id": 1017, "start": 8638.5, "end": 8643.94, "text": "mir Kommentare geschrieben. Ein nicest Kommentar und ein nicest Video, so muss das sein. Ja,"}, {"id": 1018, "start": 8643.94, "end": 8652.46, "text": "das haben sie jetzt. Vielleicht kriegen wir's hin. Ich meine, ich mach die Rolle ganz gut"}, {"id": 1019, "start": 8652.46, "end": 8663.46, "text": "ein Job. Moment, ich bin verwirrt. Welche Richtung denn jetzt überhaupt? Wait a minute."}, {"id": 1020, "start": 8663.46, "end": 8674.9, "text": "Ah, die Maps sieht überall gleich aus. Wo kommen die Gegner denn jetzt? Da? Okay, nice."}, {"id": 1021, "start": 8674.9, "end": 8686.74, "text": "Und hier kann man nicht rein, oder wie? Ich hatte wirklich null Orientierung auf der Map"}, {"id": 1022, "start": 8686.74, "end": 8690.82, "text": "gerade. Und hier kommt man nicht raus, das ist natürlich doof. Oh, nein, nein, nein,"}, {"id": 1023, "start": 8690.82, "end": 8698.9, "text": "du kannst mich nicht sehen. Fuck. Nice, und jetzt, und jetzt zurückkerzen, Leute. Revangiert"}, {"id": 1024, "start": 8698.9, "end": 8708.62, "text": "euch. Nope, sind down. Okay. Nope, nope. Dann campen wir uns mal ne Runde ins Schiff,"}, {"id": 1025, "start": 8708.62, "end": 8726.1, "text": "würde ich sagen. Und hopp. Ui. War der Kran hier schon immer? Bin irritiert. Ja, der war"}, {"id": 1026, "start": 8726.1, "end": 8747.46, "text": "schon immer da, ne? Okay, das war so nicht geplant. Ich seh euch nicht. Wo seid ihr?"}, {"id": 1027, "start": 8747.46, "end": 8767.54, "text": "Nice, nice, nice, nice, nice. Oh. Unten ist einer."}, {"id": 1028, "start": 8767.54, "end": 8792.54, "text": "No pass. Du denkst, du weißt, wo ich bin. Du denkst, ich weiß aber auch, wo ihr seid."}, {"id": 1029, "start": 8792.54, "end": 8811.22, "text": "Ich weiß, wo ihr seid. Ich weiß, wo ihr seid. Mein Motion-Sensor geht nicht mehr. Fuck."}, {"id": 1030, "start": 8811.22, "end": 8826.14, "text": "Na gut. Na gut. Es hätte durchaus funktionieren können. Oh, ich trau mich nicht."}, {"id": 1031, "start": 8826.14, "end": 8853.34, "text": "Das kriegen wir nicht, die Fuse. Doch, doch, doch. Nice, nice, nice, nice. Fuck. Good"}, {"id": 1032, "start": 8853.34, "end": 8880.9, "text": "work. Das habt ihr nice gemacht, Leute. Ah. Ah. Ah. Monka. Ich hab keine Ahnung,"}, {"id": 1033, "start": 8880.9, "end": 8886.74, "text": "wo das kommt, ehrlich gesagt. Pok-Teammates. Ja, Teammates, die was machen. Wahnsinn, oder?"}, {"id": 1034, "start": 8886.74, "end": 8899.18, "text": "Das ist extremely... Mensch, Alter. Du kannst immer deine Waffenaufsätze ändern. Extremely"}, {"id": 1035, "start": 8899.18, "end": 8912.06, "text": "Pok-Teammates. Oh, das ist schlecht. Das ist schlecht. Oder auch nicht. So funktioniert"}, {"id": 1036, "start": 8912.06, "end": 8926.62, "text": "das, Nat-Max. Ich hab den falschen Aufsatz dafür. Oh, shit. Ah, Mensch. Einen hab ich"}, {"id": 1037, "start": 8926.62, "end": 8931.06, "text": "net getroffen. Einen Schuss net und schon stehen wieder die ganzen Leute auf dem Dach."}, {"id": 1038, "start": 8931.06, "end": 8936.7, "text": "Mensch. Aber wisst ihr, was ich gut finde? Die Pistole hat sich gemerkt, dass ich im"}, {"id": 1039, "start": 8936.7, "end": 8956.98, "text": "Autofeuermodus bin und daraufhin... Also, dass ich jetzt letzte Runde eingestellt hab und das hat die sich gemerkt."}, {"id": 1040, "start": 8956.98, "end": 8978.34, "text": "Hier sind doch noch mehr, oder? Hier sind doch noch mehr. By the way, ich wollte absolut"}, {"id": 1041, "start": 8978.34, "end": 9006.86, "text": "nicht. Ja, ja, ja, ja, ja. Das war dumm. Ich hab mich getroffen. Mensch."}, {"id": 1042, "start": 9006.86, "end": 9016.62, "text": "Ich lasse nach gerade. So wird das nix. So wird das nix. Wo ist das? Wo ist das irgendwie?"}, {"id": 1043, "start": 9016.62, "end": 9041.54, "text": "Also, ist der da? Seriously? Da oben auf diesem Kackkran, Mann. No Pass."}, {"id": 1044, "start": 9041.54, "end": 9051.82, "text": "Alter, ich hör... Geht es euch auch? Ich hör total viele Gegner um mich drumherum."}, {"id": 1045, "start": 9051.82, "end": 9077.66, "text": "Problem ist nur, die sind überhaupt nicht hier. Okay, letzte Base. Die probieren wir noch."}, {"id": 1046, "start": 9077.66, "end": 9085.34, "text": "Das ist auch schon 21 Uhr. Wisst ihr, was bald ist, Chat? 21 Uhr. Wisst ihr, was 22 Uhr ist?"}, {"id": 1047, "start": 9085.34, "end": 9091.14, "text": "Gibt es zu, ihr wisst es. Ihr wisst es genau, was 22 Uhr ist. Bad Guild, korrekt. Fisch,"}, {"id": 1048, "start": 9091.14, "end": 9097.18, "text": "danke schön für den Sub und danke für die ganzen Subs heute wieder. Ich hab leider nicht so viel"}, {"id": 1049, "start": 9097.18, "end": 9106.3, "text": "mitbekommen, weil ich mich aufs Game konzentriert hab, ausnahmsweise mal. FJ, ja, geht so mittelauf."}, {"id": 1050, "start": 9106.3, "end": 9111.34, "text": "Hast du nicht mal mitgespielt und übelst geowned? Der Name sagt mir noch was. Ey, wirklich? Jetzt"}, {"id": 1051, "start": 9111.34, "end": 9118.26, "text": "schon? Bis ich da bin, ist es doch schon längst weg. Da kann ich nicht hin, Leute. Das funktioniert"}, {"id": 1052, "start": 9118.26, "end": 9125.98, "text": "nicht. Das funktioniert nicht. Machst du noch ein Video über mein Auto? Ja, ja, ja. Mach ich,"}, {"id": 1053, "start": 9125.98, "end": 9153.82, "text": "mach ich. Ist in the making? Nee, nicht wirklich. Achtung, Achtung, kriegt 17."}, {"id": 1054, "start": 9155.98, "end": 9180.38, "text": "Ey, diesen Ding auf range, Mann. Ah, geht doch. Das war denn ein Headshot? Seriously? Wollt ihr mir"}, {"id": 1055, "start": 9180.38, "end": 9183.9, "text": "wirklich erzählen, das war ein Headshot gerade. Ich hab einfach nur in die Richtung gesprayed. Easy."}, {"id": 1056, "start": 9183.9, "end": 9197.58, "text": "Ich weiß überhaupt nicht, wo was ist. Wo sind die? Mensch mein, ey, bist du schlecht geworden?"}, {"id": 1057, "start": 9197.58, "end": 9206.94, "text": "Guckt euch das an. Ich hätte schon drei Gegner killen können. Ich treffe aber nichts. Alter."}, {"id": 1058, "start": 9206.94, "end": 9221.26, "text": "What the fuck? Aber trotzdem, ich bin immer noch erster. Bin ich zufrieden, ja? Was? Gartenstellens"}, {"id": 1059, "start": 9221.26, "end": 9232.86, "text": "Video? Zeit offline zu gehen. Boomer müde, Boomer schlafen. Commander Krieger eben schon fast."}, {"id": 1060, "start": 9232.86, "end": 9244.62, "text": "Ja, so sieht es aus. Ey, es ist Übungssache. Das Boomer ist halt, ich würde das Game ja mehr"}, {"id": 1061, "start": 9244.62, "end": 9252.02, "text": "spielen, aber ich kann es mir halt nicht so lange geben. Und auf Warzone habe ich auch absolut keinen"}, {"id": 1062, "start": 9252.02, "end": 9268.86, "text": "Bock. Oh, was ist denn hier los, Mann? Ich sag's noch, die kommen gerne hinten hoch und da sind"}, {"id": 1063, "start": 9268.86, "end": 9274.3, "text": "sie schon, Mann. Shit. Und die wollten mich ratzen und ich bin, ich hab released, ich kack noob."}, {"id": 1064, "start": 9274.3, "end": 9288.62, "text": "Richtiger noob. Any noobers? Als erstes programmier ich mal Map Selection für das Game hier. Muss"}, {"id": 1065, "start": 9288.62, "end": 9303.46, "text": "mir nur Dice and Source Code geben, dann programmier ich Map Selection. Kein Ding, easy. Map Selection"}, {"id": 1066, "start": 9303.46, "end": 9319.3, "text": "Progress. Würde ich den Ticken, würde ich den Ticken mehr üben, dann würde ich den Kram auch"}, {"id": 1067, "start": 9319.3, "end": 9323.06, "text": "wieder besser treffen. Das ist halt wirklich kacke, das waren wieder drei tote Gegner,"}, {"id": 1068, "start": 9323.06, "end": 9352.94, "text": "aber die war nicht tot. Ey, ich gezielt habe. Okay, nice. Also dieses Objective läuft tatsächlich"}, {"id": 1069, "start": 9352.94, "end": 9371.1, "text": "ganz gut. Sind die down alle? Schaut so. Ich muss, okay, ich hab's jetzt rausgekriegt,"}, {"id": 1070, "start": 9371.1, "end": 9382.02, "text": "ich darf einfach nicht so viel tolle Dauerfeuer abnehmen. Eine sehr sinnvolle Plattform. Die ist"}, {"id": 1071, "start": 9382.02, "end": 9401.3, "text": "da sehr überlegt, platziert, die geht einfach nirgendwohin. Ich muss einfach mal ein bisschen"}, {"id": 1072, "start": 9401.3, "end": 9407.78, "text": "mehr Burst schießen auf Range, dann ist die Muni nicht so schnell leer und das Ding verzieht"}, {"id": 1073, "start": 9407.78, "end": 9414.74, "text": "nicht so krass. Ich bin einfach zu faul, ist das Problem. Oh oh, unter mir, ich hab sie gesehen,"}, {"id": 1074, "start": 9414.74, "end": 9435.14, "text": "ich hab sie gesehen, Leute. Okay, alles down, nice. Jawoll, ich komm' unter. Ah, wir haben's, nice,"}, {"id": 1075, "start": 9435.14, "end": 9456.1, "text": "wir haben's. Das ist das neue Battlefield, ja. Ich wollte eigentlich in das Tor daneben,"}, {"id": 1076, "start": 9456.1, "end": 9466.98, "text": "aber das hat nicht so ganz funktioniert, wie ich mir das vorgestellt hab. Oh, hallo, ich möchte dich"}, {"id": 1077, "start": 9466.98, "end": 9482.54, "text": "spotten. Spotten geht nicht, nice, GG. By the way, ich hab' Space gedrückt, vielleicht kann man den"}, {"id": 1078, "start": 9482.54, "end": 9489.14, "text": "nicht deployen, wenn man sich grad was spritzt. Wie am Frankfurter Hauptbahnhof, da deploit auch"}, {"id": 1079, "start": 9489.14, "end": 9499.82, "text": "keiner während er sich gerade was spritzt. Nee, wie, die schaffen das jetzt noch. Nixes, Leute,"}, {"id": 1080, "start": 9499.82, "end": 9527.14, "text": "Nixes. What the fuck, man? Oh, shit. Das war's. Oh, man. Oh, man. Oh, man. Oh, man. Oh, man."}, {"id": 1081, "start": 9527.14, "end": 9541.14, "text": "Oh, shit. Da kommen 30 Millionen Gegner. Keine Chance, das ist zu viel, das ist zu viel am Start"}, {"id": 1082, "start": 9541.14, "end": 9545.3, "text": "gerade. Weil wir hätten's schaffen können, wir hätten's schaffen können. Aber ich glaube,"}, {"id": 1083, "start": 9545.3, "end": 9559.14, "text": "es ist, jetzt ist lost. Jetzt ist lost. Komm, einmal, einmal. Jawoll, jawoll, jawoll. Give me, give me, give me. Okay, GG Eats."}, {"id": 1084, "start": 9559.14, "end": 9571.06, "text": "Ich wollte grad sagen, fall back. Die Runde ist fertig. Guckt euch mal den Chat an wieder."}, {"id": 1085, "start": 9571.06, "end": 9580.22, "text": "Moron Team Trash. Ich weiß ja, in dem Game geht es halt absolut um gar nichts. Es gibt"}, {"id": 1086, "start": 9580.22, "end": 9586.46, "text": "keinen Rank, es gibt keine KD-Statistiken, keine öffentlichen Top-Lists, es gibt nichts."}, {"id": 1087, "start": 9586.46, "end": 9614.38, "text": "Und trotzdem rasten die Leute voll aus. Immerhin ganz gute Runde. Solide Runde. Ja, dankeschön."}, {"id": 1088, "start": 9614.38, "end": 9623.1, "text": "Also, weil ich weiß, dass du richtig gut im Spiel bist. Ich denke mir halt immer so, wenn"}, {"id": 1089, "start": 9623.1, "end": 9626.26, "text": "ich einfach ein bisschen mehr spielen würde, dann würde ich halt auch so die Basics wieder ein"}, {"id": 1090, "start": 9626.26, "end": 9633.46, "text": "bisschen besser drauf haben. Also nicht zu früh aufhören zu schießen, nicht Gadgets switchen,"}, {"id": 1091, "start": 9633.46, "end": 9636.06, "text": "wenn man sie nicht switchen soll und so was. Aber ich hab keinen Bock, das Spiel länger zu"}, {"id": 1092, "start": 9636.06, "end": 9641.86, "text": "spielen. Und nachdem ihr auch gerade kein anderer Shooter großartig Spaß macht, ist halt, wie ich"}, {"id": 1093, "start": 9641.86, "end": 9647.26, "text": "es euch prophezeit habe, Pepega Aim angesagt. Und das wird es auch die nächste Zeit noch sein."}, {"id": 1094, "start": 9647.26, "end": 9660.22, "text": "Du nutzt doch X und Firefox, ja? Nee, Crash hatte ich auch nicht. Text highlighted. Aber"}, {"id": 1095, "start": 9660.22, "end": 9664.02, "text": "vielleicht kommt ja irgendwann mal wieder ein gutes Battlefield. Suchst du noch jemanden für"}, {"id": 1096, "start": 9664.02, "end": 9671.86, "text": "Squad? Nee, die letzte Runde. Die Basics, ja, dann gehen wir auf den Mount Everest. Dann ist"}, {"id": 1097, "start": 9671.86, "end": 9682.7, "text": "alles klar. Easy. Ich habe ein bisschen drauf spekuliert, dass mir Warzone 2 Spaß macht. Macht"}, {"id": 1098, "start": 9682.7, "end": 9689.86, "text": "es aber nicht. Vor allem, dass der Gulag jetzt zwei Mal ist, das zwei ist, gefällt mir gar nicht."}, {"id": 1099, "start": 9689.86, "end": 9700.54, "text": "Ach guck mal, Kaleidoskop. Ob das hatten wir heute noch gar nicht? Haben in Battlefield die Visiere"}, {"id": 1100, "start": 9700.54, "end": 9706.38, "text": "eigentlich irgendeinen Nachteil? Ist da ADS langsamer? Nee, glaub in dem Fall gar nicht,"}, {"id": 1101, "start": 9706.38, "end": 9716.3, "text": "oder? Nö, nicht wirklich. Was sagst du, Squad Battlefield? Nee, ganz ehrlich,"}, {"id": 1102, "start": 9716.3, "end": 9720.14, "text": "Battlefield 2042 ist einfach kein fertiges Game und vor allem hat es auch keinen Inhalt."}, {"id": 1103, "start": 9720.14, "end": 9728.9, "text": "MW2 gibt sich Mühe, auch wenig Inhalt zu bieten, aber MW2 ist irgendwie noch ein halbwegs"}, {"id": 1104, "start": 9728.9, "end": 9736.98, "text": "funktionables, zusammenhängendes. Sag mal, sind die gelieft? Die haben vier Bots im Gegnerteam."}, {"id": 1105, "start": 9736.98, "end": 9747.54, "text": "Ha, zwei Bots gekillt. Wie auch immer, das angeblich doppelte Headshot war."}, {"id": 1106, "start": 9747.54, "end": 9771.7, "text": "Okay. Schon mal DMZ gespielt? Ja, eine Runde und ich hab auf einmal nen Kill bekommen,"}, {"id": 1107, "start": 9771.7, "end": 9779.22, "text": "obwohl ich dachte, es ist ein Bot und ich mag so Modi nicht, wo die Sachen so gemischt sind,"}, {"id": 1108, "start": 9779.22, "end": 9785.7, "text": "Bots und Spieler. Ich hab dich draußen genau gehört, Kollege, kommst du rein?"}, {"id": 1109, "start": 9785.7, "end": 9798.54, "text": "Ich hab ein Problem, Leute, ich hab ein Problem. Ich habe ein Problem, die können in der Mitte"}, {"id": 1110, "start": 9798.54, "end": 9806.94, "text": "runter springen und hier reinkommen. Alter, wenn ich noch nicht mal nen geradeaus laufenden"}, {"id": 1111, "start": 9806.94, "end": 9824.02, "text": "Gegner killen kann, dann ist wirklich vorbei. Hier ist zu viel. Da oben ist er. Okay."}, {"id": 1112, "start": 9824.02, "end": 9846.38, "text": "Guckt es euch an, normalerweise hätt ich nen EZ gehabt, aber nicht mit PP-Gar. Okay,"}, {"id": 1113, "start": 9846.38, "end": 9869.38, "text": "ich bin nicht ganz sicher. Da war doch noch einer, oder? Wow. Jetzt rettet er die, ich"}, {"id": 1114, "start": 9869.38, "end": 9884.66, "text": "fass es nicht. Ich will ja nicht zwangsläufig was spielen, was easy ist. Also jetzt nicht"}, {"id": 1115, "start": 9884.66, "end": 9890.78, "text": "irgendwie so nach dem Motto, wo du nicht mal geradeaus aimen können musst oder laufen kannst"}, {"id": 1116, "start": 9890.78, "end": 9899.38, "text": "und machst irgendwelche Kills. Aber Warzone ist schwer zu sagen. Das erste hab ich ja"}, {"id": 1117, "start": 9899.38, "end": 9905.5, "text": "noch halbwegs gerne gespielt, muss ich sagen. Das war mir noch mit so das liebste Battle"}, {"id": 1118, "start": 9905.5, "end": 9912.5, "text": "Royale zum Selbstspielen, weil ich ja überhaupt kein Battle Royale Fan bin. Aber das zweite"}, {"id": 1119, "start": 9912.5, "end": 9920.3, "text": "gefällt mir nicht, die Map gefällt mir nicht, das Gulag-System gefällt mir nicht, dieses"}, {"id": 1120, "start": 9920.3, "end": 9933.66, "text": "Bot-Load-Out-Zeug gefällt mir nicht. Ich weiß eh, gefällt mir Warzone 2 nicht. Vielleicht"}, {"id": 1121, "start": 9933.66, "end": 9937.62, "text": "müsste ich es mal wirklich im Squad mit den richtigen Leuten gescheit spielen, dann vielleicht."}, {"id": 1122, "start": 9937.62, "end": 9961.74, "text": "Wäre ja möglich. Ah Shit, dachte ich klickte da noch was. Der neue Gulag ist Müll. Sind"}, {"id": 1123, "start": 9961.74, "end": 9977.26, "text": "alle weg? Ok, alle weg. Und ich bin halt, das kommt halt noch dazu, ich bin halt kein"}, {"id": 1124, "start": 9977.26, "end": 9980.62, "text": "Battle Royale Enjoyer. Ich mag Battle Royale an sich schon nicht. Ich hab halt Warzone"}, {"id": 1125, "start": 9980.62, "end": 9988.54, "text": "gespielt, weil das, das gab ja sonst nicht viel. CS bin ich auch durch. Aber jetzt nochmal"}, {"id": 1126, "start": 9988.54, "end": 9995.38, "text": "mit anfangen, nach den Jahren. Ich hab ja recht viel gespielt vor ein paar Jahren. Guckt"}, {"id": 1127, "start": 9995.38, "end": 10005.86, "text": "euch das an man. Guckt euch das an, ich treffe nichts mehr. Hui, wuuuuh. Vorher spiel ich"}, {"id": 1128, "start": 10005.86, "end": 10021.38, "text": "mit dem Controller App. Da ist er, oder? Johnny Depp ist da. Bestimmt der echte, was"}, {"id": 1129, "start": 10021.38, "end": 10024.94, "text": "mein ich? Bestimmt muss der echte sein. Ich glaub Johnny Depp hat nichts besseres zu tun"}, {"id": 1130, "start": 10024.94, "end": 10051.82, "text": "als Battlefield zu spielen. Bestimmt. Bestimmt der aller echte. Panic Attack. Was ist das?"}, {"id": 1131, "start": 10051.82, "end": 10060.22, "text": "Panic Attack. Ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gefällt. Leider"}, {"id": 1132, "start": 10060.22, "end": 10068.02, "text": "ist nicht der Fall. Und ich hab halt dementsprechend keine Übung. In Battlefield krieg ich keine,"}, {"id": 1133, "start": 10068.02, "end": 10083.5, "text": "aber ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und"}, {"id": 1134, "start": 10083.5, "end": 10098.78, "text": "ich hab ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab"}, {"id": 1135, "start": 10098.78, "end": 10104.62, "text": "ja ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja"}, {"id": 1136, "start": 10104.62, "end": 10120.98, "text": "ein bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein"}, {"id": 1137, "start": 10120.98, "end": 10128.58, "text": "bisschen gehofft, wie gesagt, dass mir Warzone 2 gehofft hat. Und ich hab ja ein bisschen"}, {"id": 1138, "start": 10128.58, "end": 10154.34, "text": "Henry Cavill wird es bestimmt spielen, ey der Typ war der einzige Grund warum ich mir"}, {"id": 1139, "start": 10154.34, "end": 10158.26, "text": "die Witcher Serie überhaupt angeguckt habe und die warst du ja nicht sonderlich gut."}, {"id": 1140, "start": 10158.26, "end": 10168.14, "text": "Aber der war wirklich gut und man hat ihm finde ich auch angemerkt dass er die Vorlagen mochte,"}, {"id": 1141, "start": 10168.14, "end": 10180.98, "text": "leider hat er sonst nicht so viel hergegeben. Aber warum er raus ist kann man glaube ich nur"}, {"id": 1142, "start": 10180.98, "end": 10190.62, "text": "mutmaßen, vielleicht haben sie ihm einfach für Superman mehr Geld geboten. Alter was ist mit"}, {"id": 1143, "start": 10190.62, "end": 10207.18, "text": "dem Heli hier wieder? Ich glaube es wird Zeit zum Stinger Noob zu werden. Ich glaube wir müssen"}, {"id": 1144, "start": 10207.18, "end": 10216.22, "text": "zum Stinger Noob werden. Ich weiß nicht genau von wo wir beschossen werden, von wo werden wir"}, {"id": 1145, "start": 10216.22, "end": 10240.82, "text": "dann beschossen? Was da her? Rauf aufs Dach man! Dachstelz, gib ihm! Dachstelz lass mich raus!"}, {"id": 1146, "start": 10240.82, "end": 10250.42, "text": "Lass mich rein je nachdem wie man das sieht. Pass auf ich predikte was passiert. Vor der Tür"}, {"id": 1147, "start": 10250.42, "end": 10257.74, "text": "sind jetzt drei Schilder aufgestellt und dahinter campen fünf Leute. Wenn irgendwie so was in der"}, {"id": 1148, "start": 10257.74, "end": 10272.18, "text": "Richtung ist jetzt. Okay es waren keine Schilder aufgestellt, aber dieser Punkt ist so unglaublich"}, {"id": 1149, "start": 10272.18, "end": 10284.02, "text": "dumm man. Was macht ihr hier oben? Bringt doch überhaupt nichts. Das ist keine Granate,"}, {"id": 1150, "start": 10284.02, "end": 10290.62, "text": "das ist ein Motion Sensor, den habe ich absichtlich vorher geworfen. Okay konnte man nicht da,"}, {"id": 1151, "start": 10290.62, "end": 10295.34, "text": "Moment, Moment meine Leute, man konnte doch. Moment, wo kommt man rüber mit der Zipline?"}, {"id": 1152, "start": 10295.34, "end": 10307.74, "text": "Hier? Nee, wait a minute. Hat das hier nicht auch einen? Ich kenne das hier auch nicht mehr."}, {"id": 1153, "start": 10307.74, "end": 10314.7, "text": "Hat das hier nicht auch einen Fahrstuhl und man kann dann rüber, rüber zipline? Doch, oder?"}, {"id": 1154, "start": 10314.7, "end": 10327.82, "text": "Du hast ja mal Glück gehabt. Nimm doch die Treppe, es gibt keine Treppe. Oder gibt es"}, {"id": 1155, "start": 10327.82, "end": 10344.3, "text": "eine Treppe? Wäre mir neu, dass es eine Treppe gibt. Oh da drüben, da drüben sitzt schon wieder."}, {"id": 1156, "start": 10344.3, "end": 10368.18, "text": "Johnny Depp. Reds please, ich liege direkt neben dir. Wolfschnitzel, bester, bester Mann."}, {"id": 1157, "start": 10368.18, "end": 10395.82, "text": "Also hier müsste man halt was killen, was gekillt bekommen. Kann man, ah shit, vielleicht"}, {"id": 1158, "start": 10395.82, "end": 10401.98, "text": "geht das? Nice. Nee hier rüber kannst du nichts, kannst du vergessen. Ich habe eine Idee,"}, {"id": 1159, "start": 10401.98, "end": 10421.34, "text": "pass mal auf, ich habe eine YOLO Idee. Fuck, ich noob, nein. Hä geht das nicht? Hä? Das"}, {"id": 1160, "start": 10421.34, "end": 10431.66, "text": "geht nicht. Man kann aus irgendwelchen Gründen nicht so richtig da dran hochdingen. Das ist"}, {"id": 1161, "start": 10431.66, "end": 10435.38, "text": "natürlich doof gewesen. Ich wollte eigentlich rüber springen mit dem Ding hoch, aber ja,"}, {"id": 1162, "start": 10435.38, "end": 10443.42, "text": "das Timing nicht drauf gehabt. Ja, da müssen wir wieder hier rauf. Gedanke 1, Ausführung"}, {"id": 1163, "start": 10443.42, "end": 10449.5, "text": "0, so sieht es aus. Eigentlich 5 head play, aber da kam auf jeden Fall auch noch dabei,"}, {"id": 1164, "start": 10449.5, "end": 10454.46, "text": "aber es ist irgendwas nicht stimmt, wenn man den Enterhang durch den Fallschirm schießen"}, {"id": 1165, "start": 10454.46, "end": 10460.94, "text": "will. Wie viele Tickets haben wir eigentlich noch? Oh, 19. Übrigens, irgendjemand bei"}, {"id": 1166, "start": 10460.94, "end": 10467.5, "text": "DICE dachte sich, es ist eine gute Idee, die Dinger da oben aufs Dach zu packen. Super"}, {"id": 1167, "start": 10467.5, "end": 10481.42, "text": "Idee, oder? Findet ihr nicht auch? Absolut high IQ plays. Ok, noch mal. Pack, das funktioniert"}, {"id": 1168, "start": 10481.42, "end": 10495.9, "text": "so nicht. Ich muss an den Fallschirm canceln und dann schießen, sonst klappt das nicht."}, {"id": 1169, "start": 10495.9, "end": 10507.42, "text": "Aber anders klappt das auch so nicht, also wir können das ruhig ein paar Mal probieren."}, {"id": 1170, "start": 10507.42, "end": 10514.82, "text": "Anders kommt man da eh nicht rauf. No one is pushing in. Ja, Master Monty, was meinst"}, {"id": 1171, "start": 10514.82, "end": 10524.58, "text": "du, woran das liegt? Ah, funktioniert richtig gut das Game teilweise. Richtig, richtig"}, {"id": 1172, "start": 10524.58, "end": 10547.54, "text": "gut. Die haben übrigens unseren Heli geklaut, seh ich da grade. What the fuck? Bestes Map"}, {"id": 1173, "start": 10547.54, "end": 10577.38, "text": "Design, nice, nice. Am nice husten. Also exquisite das Map Design hat man wieder"}, {"id": 1174, "start": 10577.38, "end": 10589.14, "text": "gesehen, richtig gut durchdacht. Stundenlang, ich kann das auch nicht stundenlang spielen,"}, {"id": 1175, "start": 10589.14, "end": 10594.3, "text": "ich kann das jetzt einmalig hier im Stream 2-3 Stunden spielen, ok. Aber stundenlang"}, {"id": 1176, "start": 10594.3, "end": 10600.22, "text": "ist für mich, ich kann 8 Stunden am Tag grinden für Monate. Das kann ich mit dem Spiel"}, {"id": 1177, "start": 10600.22, "end": 10604.82, "text": "nicht. Dann würde ich auch wieder ein bisschen was treffen wahrscheinlich. Ne, an mir lags"}, {"id": 1178, "start": 10604.82, "end": 10614.18, "text": "glaube ich auch nicht. Man kann das schaffen, also ich hab es letzten schon gesehen, dass"}, {"id": 1179, "start": 10614.18, "end": 10622.86, "text": "das eingenommen wurde. Also die letzte Base, aber es ist schon, es ist echt bescheuert"}, {"id": 1180, "start": 10622.86, "end": 10630.86, "text": "gemacht. Könnt ihr euch noch dran erinnern, als man dort mit dem Hovercraft 90 Grad an"}, {"id": 1181, "start": 10630.86, "end": 10636.62, "text": "der Wand hochfallen kann? Ich finde es doof, dass es nicht mehr geht. Ich brauche ein gutes"}, {"id": 1182, "start": 10636.62, "end": 10644.82, "text": "MMO, ja. Ich werde wieder Dark Free Shards spielen, ab dieser Woche bzw. dann ab Dezember"}, {"id": 1183, "start": 10644.82, "end": 10649.02, "text": "wieder vermehrt. Das werde ich nicht unbedingt streamen, aber da hab ich wieder was zum,"}, {"id": 1184, "start": 10649.02, "end": 10653.94, "text": "NOSHA CADDLES zum Schluss Leute, das geben wir uns nochmal. Ich hoffe wir sind Attacker"}, {"id": 1185, "start": 10653.94, "end": 10661.78, "text": "und die erste Base läuft gut. Die Spielerzahlen von BF4, 1, 5, Steam Charts kannst du gucken."}, {"id": 1186, "start": 10661.78, "end": 10673.22, "text": "Steam Charts. Gib mal einfach ein Steam Charts. Oder was, Steam Stats? Ne, Steam Charts."}, {"id": 1187, "start": 10673.22, "end": 10679.46, "text": "Steam Charts Battlefield 1. Ja Battlefield 4 geht so. Battlefield 4 ist jetzt nicht wahnsinnig"}, {"id": 1188, "start": 10679.46, "end": 10684.02, "text": "hoch, aber Battlefield 1 und 5 sind extrem gestiegen die letzten paar Wochen, das siehst"}, {"id": 1189, "start": 10684.02, "end": 10687.9, "text": "ihr jetzt. Battlefield 1 ist jetzt weniger, wobei Battlefield 1 immer, äh nicht Battlefield"}, {"id": 1190, "start": 10687.9, "end": 10694.9, "text": "1, Battlefield 4. Battlefield 4 ist immer noch gut, gut, ähm, ah wir sind Defender,"}, {"id": 1191, "start": 10694.9, "end": 10701.66, "text": "das ist blöd. Kann man mittlerweile eigentlich wechseln? Geht das? Könnte ich jetzt sagen"}, {"id": 1192, "start": 10701.66, "end": 10708.46, "text": "ich will Attacker werden? Geht das irgendwie F vielleicht? Ne, gell. So, Legacy Features"}, {"id": 1193, "start": 10708.46, "end": 10717.62, "text": "gibt's hier nicht. Sowas gibt's nicht, das kann man, wer, wer braucht sowas auch Teams"}, {"id": 1194, "start": 10717.62, "end": 10722.9, "text": "wechseln? Ich meine, da könnten die Leute ja Spaß dran haben an dem was sie spielen."}, {"id": 1195, "start": 10722.9, "end": 10748.74, "text": "Ne, ne, ne, sowas. Sowas gibt es nicht. Spaß, ich glaub es geht los. Bus 12. Hallo, ist"}, {"id": 1196, "start": 10748.74, "end": 10769.1, "text": "das ein Bot? Ne, das ist kein Bot. Die machen's richtig, die fliegen rüber. Woah! Ich glaub"}, {"id": 1197, "start": 10769.1, "end": 10782.02, "text": "ich hab legit noch nie damit ein Treffen sehen. Wo sind, was ist denn hier los? Wo"}, {"id": 1198, "start": 10782.02, "end": 10803.14, "text": "sind die Leute? War da was? Aber da war da was? Ja, da. Ich würde gern zu abwechselnd"}, {"id": 1199, "start": 10803.14, "end": 10831.7, "text": "mal einen Spieler sehen. Spieler wäre nice. Auf der anderen Seite. Ne, das geht nicht."}, {"id": 1200, "start": 10831.7, "end": 10834.74, "text": "Du bist eigentlich bei dem Battlefield nicht angefragt Partner zu sein, doch. Aber ich"}, {"id": 1201, "start": 10834.74, "end": 10838.22, "text": "hab das Spiel zu sehr geflamed, die laden mich zu nichts mehr ein, das kannst du vergessen."}, {"id": 1202, "start": 10838.22, "end": 10844.74, "text": "Was ich auch verstehen kann, aber es stört mich nicht. Besser als ich muss hier irgendwie"}, {"id": 1203, "start": 10844.74, "end": 10861.14, "text": "Zeug über das Spiel erzählen, was es halt nicht ist. Ja Mist."}, {"id": 1204, "start": 10861.14, "end": 10877.22, "text": "Sag mal, von wo denn alles hier? Ok, ich glaube es wird Zeit, dass wir mal ne Runde, ah Mist,"}, {"id": 1205, "start": 10877.22, "end": 10881.54, "text": "ja, das hab ich jetzt nicht gesehen, dass der da ist. Wird Zeit, dass wir mal ne Runde."}, {"id": 1206, "start": 10881.54, "end": 10891.5, "text": "Ne, da muss ich die Midi-Pen aufgeben. Egal, mit Fahrzeugen ist eh Schluss ab der nächsten."}, {"id": 1207, "start": 10891.5, "end": 10895.82, "text": "Wer ist? Mein Außer Außer Heli, der Heli geht uns wahrscheinlich weiterhin richtig"}, {"id": 1208, "start": 10895.82, "end": 10911.9, "text": "auf den Keks. Das kriegen wir nicht. Ok, ich brauch nen Stinger. Das kannst du ja vergessen"}, {"id": 1209, "start": 10911.9, "end": 10918.42, "text": "grade. So, wo haben wir denn den? Was ist denn da von der Stinger Leute? Gibt's überhaupt"}, {"id": 1210, "start": 10918.42, "end": 10935.5, "text": "einen? Ja, da."}, {"id": 1211, "start": 10935.5, "end": 10964.94, "text": "Wo ist der Heli? Kein Heli mehr am Start, einmal das Stinger."}, {"id": 1212, "start": 10964.94, "end": 10975.14, "text": "Da ist er. Ja, das soll sich mal ganz schnell verpissen,"}, {"id": 1213, "start": 10975.14, "end": 11004.1, "text": "der Dude. Was, von wo?"}, {"id": 1214, "start": 11004.1, "end": 11014.82, "text": "Fuck, muss ja alles machen hier. Stingern, Gegner killen."}, {"id": 1215, "start": 11014.82, "end": 11044.42, "text": "Wo ist er denn? Oh, Lul, Kekl. Komm mal da flährt der Kacknuber, guckt euch an. Wo"}, {"id": 1216, "start": 11044.42, "end": 11053.3, "text": "ist er? Wo ist er? Mir egal, ich geier den Helityp jetzt bis. Kannst ja so nicht gescheit"}, {"id": 1217, "start": 11053.3, "end": 11075.26, "text": "spielen da. Wie soll das funktionieren? Ich werde jetzt zum Heli geier 9000."}, {"id": 1218, "start": 11075.26, "end": 11089.26, "text": "Der wird so abkotzen, Alter. Der wird so abkotzen. Der wird so abkotzen, ich schwörs euch. Alter"}, {"id": 1219, "start": 11089.26, "end": 11103.9, "text": "Pech. Ich wach dem das komplett zur Hölle jetzt die Runde. Ich wach dem die komplette"}, {"id": 1220, "start": 11103.9, "end": 11108.94, "text": "Runde zur Hölle, Leute. Der kriegt keinen Kill mehr, der Helityp."}, {"id": 1221, "start": 11108.94, "end": 11130.1, "text": "Wie, ich bin schon wieder revealed? Na toll. Ich will nicht revealed sein, man. Hör auf"}, {"id": 1222, "start": 11130.1, "end": 11143.7, "text": "mich zu revealen. Oh ne, Helityp hat mich gekillt. Ja, das aber schon. Man muss ein bisschen"}, {"id": 1223, "start": 11143.7, "end": 11173.18, "text": "mehr mit Stinger geiern, sonst wird das nix. What the fuck? Wo ist er hin? Ist der Helityp"}, {"id": 1224, "start": 11173.18, "end": 11202.78, "text": "verreckt? Ich hör keinen Heli. Ah shit. Nope, ich glaube nicht, dass mich da einer"}, {"id": 1225, "start": 11202.78, "end": 11214.9, "text": "arrestt oder? Ich mein wir haben noch nicht mal einen Verteidigungs Heli, das ist richtig"}, {"id": 1226, "start": 11214.9, "end": 11240.86, "text": "dumm, Alter. Richtig dumm. Fuck, jetzt sehen sie mich. Shit. Oh, oh, oh."}, {"id": 1227, "start": 11240.86, "end": 11261.9, "text": "Siehste, das sind die Dinger. Ich hätte locker noch drei Kills machen können, hätte ich"}, {"id": 1228, "start": 11261.9, "end": 11288.38, "text": "gar nicht was getroffen. Aber ich werd dem Helityp so auf den Sack gehen. Wo auch immer."}, {"id": 1229, "start": 11288.38, "end": 11304.62, "text": "Ah, das ist der, das ist der Möwe. Ach, das ist der Heli. Oh, oh, oh, oh. An A ist"}, {"id": 1230, "start": 11304.62, "end": 11332.54, "text": "da was. Oh, ist ein Heli kaputt? Das tut mir aber so leid."}, {"id": 1231, "start": 11332.54, "end": 11353.62, "text": "Randa. Fuck. Oh, wir haben's, nice. Ein nicer Diffuse. Pock Diffuse."}, {"id": 1232, "start": 11353.62, "end": 11374.82, "text": "Moment, ich hab keinen Heal mehr, shit. Ich bin da zum Heli-Geierer geworden. Ich bin"}, {"id": 1233, "start": 11374.82, "end": 11390.66, "text": "jetzt one shot. Warum ist denn der Typ eigentlich immer noch da? Warum ist denn der immer noch"}, {"id": 1234, "start": 11390.66, "end": 11409.82, "text": "da? Pass auf, der kommt gleich wieder, der Heli-Dude. Wo ist der Heli-Dude? Da ist er,"}, {"id": 1235, "start": 11409.82, "end": 11425.42, "text": "pass auf. Guck mal da. Ey, der wird so kurzen. Oh Mist. Krieg ich einen Rätsel? Ich bin"}, {"id": 1236, "start": 11425.42, "end": 11428.54, "text": "direkt neben dir. Kollege, ich bin direkt neben dir. Kann man um Hilfe rufen irgendwie?"}, {"id": 1237, "start": 11428.54, "end": 11433.38, "text": "Please, Leute, ich bin direkt um eure Ägyle, da liegt nichts. Come on, lass doch nicht"}, {"id": 1238, "start": 11433.38, "end": 11448.02, "text": "von dem kack Heli killen. Jetzt ist er down. Oh Gott. Leute, ihr stellt euch an. Der Heli"}, {"id": 1239, "start": 11448.02, "end": 11460.26, "text": "fickt euch, ihr müsst auch zum Stinger-Bob werden wie ich. Anders geht das nicht, so"}, {"id": 1240, "start": 11460.26, "end": 11473.78, "text": "wie gewinnt das nicht. Stinger. Du verlierst, wir verlieren das nur wegen dem Heli. Guck,"}, {"id": 1241, "start": 11473.78, "end": 11480.94, "text": "sobald ich nicht da bin und den Heli irgendwie runtergeiern kann, dann kriegen wir uns ab"}, {"id": 1242, "start": 11480.94, "end": 11491.1, "text": "und legen henne, legen henne, Meister legen henne, da legen henne Meister. Fuck, hat er"}, {"id": 1243, "start": 11491.1, "end": 11520.66, "text": "funktioniert können. Da ist der Heli wieder. Das Stinger-Verhalten sieht auch ziemlich"}, {"id": 1244, "start": 11520.66, "end": 11549.18, "text": "pepega aus. Was? Oh Mist, ich habe keine Muni mehr. Was ist da unten los? Monkeys."}, {"id": 1245, "start": 11549.18, "end": 11579.1, "text": "Kann man da hoch? Nö. Ja, auf geht's. Mensch,"}, {"id": 1246, "start": 11579.1, "end": 11603.38, "text": "wir sind im Battlefield. Na, da machst du nichts."}, {"id": 1247, "start": 11603.38, "end": 11616.06, "text": "Ich bin nicht zu, ich habe nicht die Erfahrung den Heli zuzuhören. Du hast recht, ich muss"}, {"id": 1248, "start": 11616.06, "end": 11630.78, "text": "warten bis die Flares raus sind. Das ist schon richtig. Aber wenn der Heli schlau ist, dann"}, {"id": 1249, "start": 11630.78, "end": 11651.98, "text": "wird das nix. Wo ist der Heli, Dude? Ist der Heli gerade gecrashed?"}, {"id": 1250, "start": 11651.98, "end": 11663.74, "text": "Gut, gut, Chet. Ja, jetzt hatte ich keinen Heal. Gut, Chet, dass ich mich dran erinnert"}, {"id": 1251, "start": 11663.74, "end": 11685.1, "text": "habe zu warten, bis die Flares raus sind. High IQ Plays. Chet, denk mit."}, {"id": 1252, "start": 11685.1, "end": 11700.18, "text": "Okay, Alter, siehst du ja nix hier. War safe ein anderer im Heli, der war jetzt schlauer."}, {"id": 1253, "start": 11700.18, "end": 11705.3, "text": "Ist doch gut, ist doch gut. Wir hätten schon längst gewonnen ohne den Heli. Ich meine,"}, {"id": 1254, "start": 11705.3, "end": 11721.82, "text": "die letzte Base ist, ja, geht, kann man eigentlich ganz gut defenden. Oh, was ist das? Mensch,"}, {"id": 1255, "start": 11721.82, "end": 11725.54, "text": "ich brauch meinen Heal, das ist das Dumme. Oh, ich bin down. So schnell komm ich da nicht"}, {"id": 1256, "start": 11725.54, "end": 11733.7, "text": "weg. Die Legehände ist am Start. Ich geh jetzt in den Tank, wir müssen in den Tank"}, {"id": 1257, "start": 11733.7, "end": 11740.22, "text": "von dem. Wir klauen den Tank, Leute, Tank klauen. Ach, fuck man. Alles musst du selbst"}, {"id": 1258, "start": 11740.22, "end": 11749.58, "text": "machen. Voll den Tank von dem klauen, das wäre das"}, {"id": 1259, "start": 11749.58, "end": 11769.74, "text": "Beste. Ich möchte bitte an F2. Ja, Dankeschön."}, {"id": 1260, "start": 11769.74, "end": 11789.94, "text": "Da haben wir nämlich irgendein Tank. Schonmal viel besser. Ah, nee, da können wir kein"}, {"id": 1261, "start": 11789.94, "end": 11807.62, "text": "Damage machen. Was denn da? Jetzt lässt sich hier gar keiner mehr blinken. Ja, macht ruhig"}, {"id": 1262, "start": 11807.62, "end": 11812.58, "text": "euren Tank kaputt, soll mir recht sein, alles okay. Ich bleib hier drinnen. Macht euren"}, {"id": 1263, "start": 11812.58, "end": 11832.06, "text": "Tank kaputt, gut. Wir brauchen ihn wieder, bis er respawn. Fahrt ihr einfach bei uns"}, {"id": 1264, "start": 11832.06, "end": 11856.7, "text": "in die Base und dann kriegt ihr euren Tank nie wieder. Oh, links war was, shit. Ich muss"}, {"id": 1265, "start": 11856.7, "end": 11877.14, "text": "heilen. Shit, ich bin fast down. Please heal. Oh, fuck. Ist das die AA von den Defendern?"}, {"id": 1266, "start": 11877.14, "end": 11888.74, "text": "Nee, oder? Da ist doch gerade ein Gegner mit rangefahren. Oder hatten die unser Ding?"}, {"id": 1267, "start": 11888.74, "end": 11899.86, "text": "Dann habe ich es vielleicht falsch eingeschätzt, das kann sein. Okay, A kriegen wir wahrscheinlich"}, {"id": 1268, "start": 11899.86, "end": 11915.3, "text": "nicht mehr. Man kann es mal probieren. Nein, keine Chance. Das wäre B, das wäre B. Oh,"}, {"id": 1269, "start": 11915.3, "end": 11934.1, "text": "nee, Alter. Einmal machst du es nicht selbst. Alles musst du selber machen. Also es sah"}, {"id": 1270, "start": 11934.1, "end": 11944.9, "text": "für mich so aus, als sind die Gegner rangefahren damit. Ja, jetzt ist vorbei. Bam. Wir haben"}, {"id": 1271, "start": 11944.9, "end": 11967.54, "text": "uns gefusst. Na gut, die legen jetzt gleich wieder. Alter, wir haben uns gefusst. Nein,"}, {"id": 1272, "start": 11967.54, "end": 11980.42, "text": "wir haben uns gefusst. Alter, wie ich habe das nicht gefusst? Ich habe das nicht gefusst?"}, {"id": 1273, "start": 11980.42, "end": 11990.38, "text": "Ich habe da doch eine halbe Stunde drauf gedrückt. Warum war das nicht gefusst? Ich stand da"}, {"id": 1274, "start": 11990.38, "end": 11994.3, "text": "doch eine halbe Stunde dran. Oder darf man mittlerweile nicht mehr schießen in dem Game"}, {"id": 1275, "start": 11994.3, "end": 12002.1, "text": "beim diffusen? Er hat abgebrochen. Ah, geil. Es ist ja nicht handicap genug, dass man einfach"}, {"id": 1276, "start": 12002.1, "end": 12006.18, "text": "nur dastehen muss und gerade ausgucken. Aber schießen darf man scheinbar auch nicht mehr."}, {"id": 1277, "start": 12006.18, "end": 12017.78, "text": "Na ja, gut. Mehr konnte ich echt nicht machen. Ich habe den Typ runtergestingert, wie sonst"}, {"id": 1278, "start": 12017.78, "end": 12028.82, "text": "fast. Der hat gekotzt, ey, der Helityp. Ich sage es euch. Der hat gekotzt. Oder sonst"}, {"id": 1279, "start": 12028.82, "end": 12034.74, "text": "fast alles gemacht. So muss das sein. Wenn man das jetzt jeden Tag ein paar Mal machen"}, {"id": 1280, "start": 12034.74, "end": 12037.82, "text": "würde, dann würde man wahrscheinlich auch wieder was treffen und hätte ein bisschen"}, {"id": 1281, "start": 12037.82, "end": 12043.7, "text": "Timing in dem Spiel. Aber da müsste man spielen und ich habe eigentlich ehrlich gesagt jetzt"}, {"id": 1282, "start": 12043.7, "end": 12056.46, "text": "schon kein Bock mehr. Das soll ich viel weiter zu spielen. Manifest. Oh, wir haben Leute"}, {"id": 1283, "start": 12056.46, "end": 12060.82, "text": "2153. Mal gucken, ob wir Attacker sind. Manifest habe ich ewig nicht gespielt. Das ist die"}, {"id": 1284, "start": 12060.82, "end": 12069.1, "text": "nächste Map, die überarbeitet wird, Leute. Und die Map hat jetzt schon zu wenig Container,"}, {"id": 1285, "start": 12069.1, "end": 12075.06, "text": "deswegen bekommt die noch mehr Container jetzt. Wir sind Attacker. Okay, vielleicht gucke"}, {"id": 1286, "start": 12075.06, "end": 12084.86, "text": "ich mir das noch mal an. Ist das Game immer noch Trash? Ja, ehrlich gesagt schon. Aber"}, {"id": 1287, "start": 12084.86, "end": 12090.06, "text": "für einen Zehner oder maximal so 20 Euro kann man sich das mal gönnen, wenn man Battlefield-Fan"}, {"id": 1288, "start": 12090.06, "end": 12101.9, "text": "ist und gerne ab und zu mal ein bisschen was Battlefield-artiges spielt. Aber ansonsten,"}, {"id": 1289, "start": 12101.9, "end": 12109.14, "text": "ne. Leute, die überarbeiten die Map mit noch mehr Containern. Ich gucke mal kurz, wie"}, {"id": 1290, "start": 12109.14, "end": 12123.9, "text": "die ersten, die sind wieder alle gelieft. Jetzt haben wir wieder irgendwelche 4-4 Bots"}, {"id": 1291, "start": 12123.9, "end": 12140.02, "text": "hier. Ach, meine Waffe ist ja richtig. Ja, ja. Hopp, hopp, hopp, hopp, alles gut. Okay,"}, {"id": 1292, "start": 12140.02, "end": 12169.66, "text": "der letzte Schutz einfach straight durchgegangen. Null. Bots. Tackle. What? Ja, es ist komisch,"}, {"id": 1293, "start": 12169.66, "end": 12179.42, "text": "dass er alles im Rucksack hat und dass er die Waffe umbauen kann. Weird. Alter, wie"}, {"id": 1294, "start": 12179.42, "end": 12202.3, "text": "schlecht ist bitteschön diese Kanone? Nice. Oh, ich hab noch den Stinger. Ich hab noch"}, {"id": 1295, "start": 12202.3, "end": 12226.42, "text": "den Stinger dabei. Das ist glaube ich so ziemlich das Unsinnigste. Das Unsinnigste,"}, {"id": 1296, "start": 12226.42, "end": 12240.1, "text": "was es so gibt hier, der Stinger auf der Map. Stinger ist wirklich komplett unsinnig"}, {"id": 1297, "start": 12240.1, "end": 12254.26, "text": "hier. Alter, da ist immer noch ein Bot drinne. Okay, auf Bot-Games hab ich kein Bock. Die"}, {"id": 1298, "start": 12254.26, "end": 12259.34, "text": "Bots gibt es doch einzig und alleine nur, dass die nicht merken, dass das Spiel keine"}, {"id": 1299, "start": 12259.34, "end": 12268.58, "text": "Sau mehr spielt. Das war von Anfang an der Plan, falls es rein scheißt das Spiel, dass"}, {"id": 1300, "start": 12268.58, "end": 12274.06, "text": "du immer noch Bots hast. Ah, jetzt ist es aufgefüllt. Jetzt sind die drei Bots wieder"}, {"id": 1301, "start": 12274.06, "end": 12295.94, "text": "raus. Okay. Also, Bots waren wirklich so eine dumme Idee, Mann. Richtig dumm. Achtung,"}, {"id": 1302, "start": 12295.94, "end": 12319.26, "text": "Long-Range. Okay, Long-Range alleine bringt noch nichts. Short-Range. Und wieder weg."}, {"id": 1303, "start": 12319.26, "end": 12332.66, "text": "Oh, oh. Blöde Idee, da rauszugehen. Die Bots sind da, dass die meisten Noobs besser"}, {"id": 1304, "start": 12332.66, "end": 12337.1, "text": "... Ja, ja. Und halt, auch wenn es keiner mehr spielt, dass du es halt noch spielen"}, {"id": 1305, "start": 12337.1, "end": 12343.38, "text": "kannst. Und dass man Waffen anlocken kann. Ja, super. Kommt da grad vor um die Ecke."}, {"id": 1306, "start": 12343.38, "end": 12347.86, "text": "Und dass man Waffen anlocken kann. Man konnte sich ja, weiß nicht, wahrscheinlich geht"}, {"id": 1307, "start": 12347.86, "end": 12358.62, "text": "das immer noch, man konnte sich auf Kaleidoskop oben hinlegen und die Bots killen an dem Lüftungsschacht"}, {"id": 1308, "start": 12358.62, "end": 12378.74, "text": "vorbei. What? 46, null. Ach, die Stinger, ich hab immer noch die Stinger dabei. Ich"}, {"id": 1309, "start": 12378.74, "end": 12399.14, "text": "bin richtig dumm. Richtig hängen geblieben. Echter Stinger, Bob. Okay, jetzt pack ich"}, {"id": 1310, "start": 12399.14, "end": 12405.42, "text": "die Stinger weg. Alter, warum hab ich 13,3 und eine andere 3,6? So, Stinger, Stinger"}, {"id": 1311, "start": 12405.42, "end": 12417.7, "text": "wird weggepackt. Stinger braucht man hier echt nicht. Stinger stinkt, weg. Ähm. Medipen,"}, {"id": 1312, "start": 12417.7, "end": 12434.98, "text": "oder? Den könnte man ein bisschen schneller beschleunigen. Ach, das war gar kein Gegner."}, {"id": 1313, "start": 12434.98, "end": 12439.62, "text": "Habt ihr den Track, na geil, habt ihr den Track gesehen? Ich dachte, das ist ein Gegner,"}, {"id": 1314, "start": 12439.62, "end": 12448.02, "text": "der da rennt. Ja, das Menü ist, das sieht nicht nur unübersichtlich aus, das ist unübersichtlich."}, {"id": 1315, "start": 12448.02, "end": 12475.22, "text": "Mega unübersichtlich ist das. Okay, jop. Alter, ich sollte mal ein bisschen mehr bewegen,"}, {"id": 1316, "start": 12475.22, "end": 12485.1, "text": "wenn ich da oben drauf rumstehe. Oh, nicer Flank, high IQ Flank, Leute. Sehr schlauer"}, {"id": 1317, "start": 12485.1, "end": 12501.82, "text": "Flank. Ach, shit, Alter. Leute, pusht mal ran. Die haben viel zu viel Zeit auf den Dächern"}, {"id": 1318, "start": 12501.82, "end": 12514.74, "text": "rumzugucken. Jawoll, jawoll, jawoll. Push, push, push, push. Shit. Okay, Team hat wirklich"}, {"id": 1319, "start": 12514.74, "end": 12537.86, "text": "keinen Bock, ran zu pushen. Der hier, hä? Der da? Nice. Das kriegen wir jetzt, das kriegen"}, {"id": 1320, "start": 12537.86, "end": 12561.06, "text": "wir jetzt, Alter. Machen Morschen-Sensor hin, da hinten kommt einer. Alter, ich fasse"}, {"id": 1321, "start": 12561.06, "end": 12583.9, "text": "das nicht. Ey, du musst alles selber machen, Mann. Alles, alles. Diffusen, Defenden, Morschen-Sensor,"}, {"id": 1322, "start": 12583.9, "end": 12608.06, "text": "Alter. Ah, was ne Runde. Schlimm. Johnny Depp hat wieder mitgespielt. Okay, jetzt reicht"}, {"id": 1323, "start": 12608.06, "end": 12618.7, "text": "es aber für heute echt genug. Yep, Clock. Unten sehe ich schlechter, das ist schön"}, {"id": 1324, "start": 12618.7, "end": 12638.18, "text": "zu lesen. Oh, weg. Schluss für heute. Ach so, wir wollten noch diesen komischen. Okay,"}, {"id": 1325, "start": 12638.18, "end": 12657.82, "text": "mal machen wir das jetzt noch schnell. Gucken wir mal. Okay. Ups. Alter. Alter, Alter, Alter."}, {"id": 1326, "start": 11661.12, "end": 12677.86, "text": "Alter. Okay, 177. Ich glaube, das ist ganz gut. Für fast 40 geht das glaube ich"}, {"id": 1327, "start": 12677.86, "end": 12694.22, "text": "durch. Immerhin, eben irgendwas muss ich ja gut sein. Okay Leute, wir sehen uns im nächsten"}, {"id": 1328, "start": 12694.22, "end": 12699.38, "text": "Video. Bis dahin, machts gut."}]}