{"text": "Okay, ich habe jetzt nicht Dresden, ich habe jetzt Frankfurt 2, nicht einfach nur Frankfurt 2. Ich habe keinen selbstgebauten Router, außerdem war das doch ein Witz von ihm. Ich glaube es wissen alle hier, dass es nichts bringt. Okay, schauen wir mal, jetzt sind wir in Frankfurt 2, gucken ob das jetzt besser funktioniert. Also wenn es jetzt nicht funktioniert, gehe ich off. Jetzt muss ich mir Werbung in der Vorschau zu meinem eigenen Stream angucken, ganz toll. Dankeschön Twitch, keck wait. Gehts jetzt? Okay, vielleicht haben wir Glück und es tut jetzt, schauen wir mal. Na, fix, ich weiß nicht ob das fix ist, das hatten wir immer mal ein paar Phasen jetzt dazwischen. Also es gibt anscheinend ein Problem, wir machen jetzt einfach weiter, wir machen jetzt einfach weiter, das hat ja keinen Sinn. Also es gibt wohl ein Problem, wenn einer einen Jeep verwendet, US, okay, also wir brauchen noch einen neuen Account, jetzt gehts anscheinend, wir brauchen noch einen neuen Fake Account, jeepNA, also jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, neuer Fake Account, North America, USA, 10 Minute Mails, ja ich brauch ne andere E-Mail Adresse, die da, die brauch ich jetzt unbedingt, E-Mail, nee, Register, mal gucken ob wir die Probleme von ihm nachstellen können, United States, Englisch, keqw, 0w, das ist meine E-Mail Adresse, next, next, next, Passwort, okay, next, wir agreeen allem, agreege, agreet ihr auch chat, ich hoffe wir sind uns einig, dass wir alle jetzt bei jeep agreeen, agreege time, export, wo ist, wo ist meine E-Mail Adresse, E-Mail Adresse, die hier, wir brauchen jetzt nicht mein Dodge Login, sondern mein jeep Login, Passwort, reply, so brand, also fiat region amerika ist richtig, allerdings brand ist jeep, okay, schauen wir mal was passiert, run, funktioniert, also ich kann das nicht nachvollziehen, dass es Probleme gibt beim Login, das ist halt das dumme, bei mir funktioniert's, region amerika jeep, so und er sagt er bekommt Probleme, er bekommt Probleme nach dem Login, also wenn er das hier macht, vehicle stage all, could not be deserialized to jason, kann das sein, dass eigentlich alles funktioniert, aber jeep irgendwelche nicht passbares jason zurückliefert, was ich jetzt nicht ausprobieren kann, weil ich keine Autos auf meinem account habe, also sprich, das ist natürlich jetzt doof, apurl, hier kackt das ab bei ihm, could not deserialize, jeep wird mit irgendwas antworten, was ist, was ist nicht, also was vehicle response, wie sieht das aus, user id, version, ja irgendwas hier wird da nicht serialisieren können, okay, da bleibt uns jetzt nichts anderes übrig, das können wir nicht so ohne weiteres fixen, weil ich nicht weiß woran es hängt, es könnte durchaus sein, dass die irgendwas hier zurückliefern, was hier nicht funktioniert, also was auch immer vielleicht ist, model, string oder sowas, das müssen wir mal gucken, das heißt uns bleibt jetzt eigentlich nichts anderes übrig, außer hier ein bisschen mehr zu loggen oder, was soll man sonst machen, also wir können die exception nochmal ausgeben, wobei die message haben wir ja schon, attp exception, die message können wir ausgeben und wir können eine sache probieren, den status code, wobei da sagt ihr schon, response could not deserialize, status, wir können eigentlich nur ein bisschen mehr debug machen, was anderes fällt mir jetzt an der stelle wirklich nicht ein, error, okay und jetzt hier response und dann muss er das mal ausprobieren und wir müssen gucken ob es funktioniert, was anderes fällt mir nämlich gerade echt nicht ein, so und response ist quasi call, ne ne response ist nicht gleich status code, response ist das was man im body drinne hat, body, ne, request body, funktioniert das jetzt, content oder ne, wie geht das, wie geht das, wollte ich nach request gucken, ne request body, available only if attp request message content is a floral content, was ich denn, ich will auch nicht request ich will only response, response message, content, ne, read, warte mal wie ging das denn jetzt nochmal, jetzt ersetzt attp response message, is success status message, what, read as string, alter können wir es noch komplizierter machen bitteschön, response, attp response message, content, okay ich seh schon das geht nicht anscheinend, wir haben response, ach hier, hier get string async, das wollen wir haben, ja, so die sache ist jetzt die, das geht doch bestimmt kaputt, wir müssen checken ob das null ist, wir müssen checken ob das null ist, ne ne das nicht, das ist, das ist nicht null, das hier müssen wir gucken ob es null ist, was soll der jetzt verschmerzen, das gucken ob es null ist und wir müssen gucken ob response vielleicht null ist, okay, so mehr als so ein bisschen debug message können wir wahrscheinlich gar nicht da jetzt, gar nicht tun, ne, also wir können aber mal, wir können aber mal versuchen zu testen ob, ob wir das nachstellen, also nicht nachstellen ob wir den Fehler, ob wir das testen können, dass zumindest die Error Ausgabe halbwegs, halbwegs sinnvoll ist und zwar wir faken das einfach mal, wir gehen jetzt mal hier in fiat client und hier braucht er ja den, ne, warte mal, wo sind wir, da fetch, hier braucht er ja api key, das benutzt er da auch schon, ich will dass der, ich will dass der fehl schlägt, okay wir gehen jetzt einfach nicht auf v4 accounts vehicles sondern auf vehicles und guck mal was passiert, weil das sollte ja auf jeden fall nicht funktionieren oder api key plus abc, ja das stimmt schon, error connecting to vehicles not found, okay das ist jetzt ein anderes problem, ja wir machen wirklich, das ist eine gute Idee chat, high iq chat, error connecting to, ähm, aber es geht, jetzt haben wir das Bild Das ist ein anderer Fehler, den wir jetzt kriegen. Response could not be deserialized to JSON. Okay, das können wir auch nachstellen. Das können wir auch nachstellen. Wir schreiben hier einfach irgendeinen Mist rein. Was weiß ich hier, das soll ein Bool sein, User ID. So, und dann sollte es zumindest an der Stelle doch auch abkacken. Auf, kack ab, please. Ah, ich hab kein Debugging an, deswegen ging das jetzt grad nicht. Ich sag doch hier Debug, das ist ja Blödsinn. Ich hab ja gar kein Debugging an und ich will auch gar kein Debugging zum Testen anhaben, weil dann seht ihr mein Passwort und sowas. Okay, mach mal einfach Info, sollte jetzt genauso funktionieren. Hier, alles klar, oh, das ist falsch. Response could not be deserialized to JSON, blabla. Okay, das bestärkt mich in der Annahme, dass die irgendeinen Mist responden, den es gar nicht gibt oder geben sollte. Ich hab irgendwas nicht erwartet, kann das sein? Kann man, meine blöde Frau hat gesagt, kann man null überhaupt erwarten? Nee, oder? Nee, nee, nee, also ich muss jetzt quasi erstmal checken, okay, okay, okay, das ist ja eklig. Kann ich, ich mein, ich könnte, ich könnte es halt einfach sagen, das geht wahrscheinlich. Okay, das ist, das ist im Prinzip das, was wir haben wollen, ja, das soll so sein, also der sagt den Error, den Status Code und die Response, ist schön, das können wir so lassen. Nice, wie sieht es eigentlich aus jetzt mit, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. Okay, dann geht es heute nicht weiter, ich hab keinen Bock auf den Motor von Scheiß. Leute, wir sehen uns im nächsten Stream, bis dann, see you!", "segments": [{"id": 1, "start": 0.0, "end": 13.24, "text": "Okay, ich habe jetzt nicht Dresden, ich habe jetzt Frankfurt 2, nicht einfach nur Frankfurt"}, {"id": 2, "start": 13.24, "end": 14.24, "text": "2."}, {"id": 3, "start": 14.24, "end": 27.76, "text": "Ich habe keinen selbstgebauten Router, außerdem war das doch ein Witz von ihm."}, {"id": 4, "start": 27.76, "end": 32.76, "text": "Ich glaube es wissen alle hier, dass es nichts bringt."}, {"id": 5, "start": 32.76, "end": 41.76, "text": "Okay, schauen wir mal, jetzt sind wir in Frankfurt 2, gucken ob das jetzt besser funktioniert."}, {"id": 6, "start": 41.76, "end": 43.76, "text": "Also wenn es jetzt nicht funktioniert, gehe ich off."}, {"id": 7, "start": 43.76, "end": 53.36, "text": "Jetzt muss ich mir Werbung in der Vorschau zu meinem eigenen Stream angucken, ganz toll."}, {"id": 8, "start": 53.36, "end": 81.84, "text": "Dankeschön Twitch, keck wait."}, {"id": 9, "start": 81.84, "end": 82.84, "text": "Gehts jetzt?"}, {"id": 10, "start": 82.84, "end": 92.68, "text": "Okay, vielleicht haben wir Glück und es tut jetzt, schauen wir mal."}, {"id": 11, "start": 92.68, "end": 100.12, "text": "Na, fix, ich weiß nicht ob das fix ist, das hatten wir immer mal ein paar Phasen jetzt"}, {"id": 12, "start": 100.12, "end": 101.12, "text": "dazwischen."}, {"id": 13, "start": 101.12, "end": 106.08, "text": "Also es gibt anscheinend ein Problem, wir machen jetzt einfach weiter, wir machen jetzt"}, {"id": 14, "start": 106.08, "end": 107.96, "text": "einfach weiter, das hat ja keinen Sinn."}, {"id": 15, "start": 107.96, "end": 131.8, "text": "Also es gibt wohl ein Problem, wenn einer einen Jeep verwendet, US, okay, also wir brauchen"}, {"id": 16, "start": 131.8, "end": 138.08, "text": "noch einen neuen Account, jetzt gehts anscheinend, wir brauchen noch einen neuen Fake Account,"}, {"id": 17, "start": 138.08, "end": 159.6, "text": "jeepNA, also jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep, jeep,"}, {"id": 18, "start": 159.6, "end": 172.88, "text": "neuer Fake Account, North America, USA, 10 Minute Mails, ja ich brauch ne andere E-Mail"}, {"id": 19, "start": 172.88, "end": 184.0, "text": "Adresse, die da, die brauch ich jetzt unbedingt, E-Mail, nee, Register, mal gucken ob wir die"}, {"id": 20, "start": 184.0, "end": 192.88, "text": "Probleme von ihm nachstellen können, United States, Englisch, keqw, 0w, das ist meine"}, {"id": 21, "start": 192.88, "end": 207.88, "text": "E-Mail Adresse, next, next, next, Passwort, okay, next, wir agreeen allem, agreege, agreet"}, {"id": 22, "start": 207.88, "end": 216.4, "text": "ihr auch chat, ich hoffe wir sind uns einig, dass wir alle jetzt bei jeep agreeen, agreege"}, {"id": 23, "start": 216.4, "end": 234.04, "text": "time, export, wo ist, wo ist meine E-Mail Adresse, E-Mail Adresse, die hier, wir brauchen"}, {"id": 24, "start": 234.04, "end": 242.0, "text": "jetzt nicht mein Dodge Login, sondern mein jeep Login, Passwort, reply, so brand, also"}, {"id": 25, "start": 242.0, "end": 252.2, "text": "fiat region amerika ist richtig, allerdings brand ist jeep, okay, schauen wir mal was"}, {"id": 26, "start": 252.2, "end": 268.84, "text": "passiert, run, funktioniert, also ich kann das nicht nachvollziehen, dass es Probleme"}, {"id": 27, "start": 268.84, "end": 286.08, "text": "gibt beim Login, das ist halt das dumme, bei mir funktioniert's, region amerika jeep,"}, {"id": 28, "start": 286.08, "end": 302.48, "text": "so und er sagt er bekommt Probleme, er bekommt Probleme nach dem Login, also wenn er das hier"}, {"id": 29, "start": 302.48, "end": 321.2, "text": "macht, vehicle stage all, could not be deserialized to jason, kann das sein, dass eigentlich alles"}, {"id": 30, "start": 321.2, "end": 330.44, "text": "funktioniert, aber jeep irgendwelche nicht passbares jason zurückliefert, was ich jetzt"}, {"id": 31, "start": 330.44, "end": 345.84, "text": "nicht ausprobieren kann, weil ich keine Autos auf meinem account habe, also sprich, das ist"}, {"id": 32, "start": 345.84, "end": 374.68, "text": "natürlich jetzt doof, apurl, hier kackt das ab bei ihm, could not deserialize, jeep wird"}, {"id": 33, "start": 374.68, "end": 383.04, "text": "mit irgendwas antworten, was ist, was ist nicht, also was vehicle response, wie sieht"}, {"id": 34, "start": 383.04, "end": 398.44, "text": "das aus, user id, version, ja irgendwas hier wird da nicht serialisieren können, okay,"}, {"id": 35, "start": 398.44, "end": 401.76, "text": "da bleibt uns jetzt nichts anderes übrig, das können wir nicht so ohne weiteres fixen,"}, {"id": 36, "start": 401.76, "end": 410.88, "text": "weil ich nicht weiß woran es hängt, es könnte durchaus sein, dass die irgendwas hier zurückliefern,"}, {"id": 37, "start": 410.88, "end": 420.52, "text": "was hier nicht funktioniert, also was auch immer vielleicht ist, model, string oder"}, {"id": 38, "start": 420.52, "end": 428.88, "text": "sowas, das müssen wir mal gucken, das heißt uns bleibt jetzt eigentlich nichts anderes"}, {"id": 39, "start": 428.88, "end": 434.92, "text": "übrig, außer hier ein bisschen mehr zu loggen oder, was soll man sonst machen, also wir"}, {"id": 40, "start": 434.92, "end": 442.16, "text": "können die exception nochmal ausgeben, wobei die message haben wir ja schon, attp exception,"}, {"id": 41, "start": 442.16, "end": 450.96, "text": "die message können wir ausgeben und wir können eine sache probieren, den status code, wobei"}, {"id": 42, "start": 450.96, "end": 461.48, "text": "da sagt ihr schon, response could not deserialize, status, wir können eigentlich nur ein bisschen"}, {"id": 43, "start": 461.48, "end": 471.12, "text": "mehr debug machen, was anderes fällt mir jetzt an der stelle wirklich nicht ein, error, okay"}, {"id": 44, "start": 471.12, "end": 477.84, "text": "und jetzt hier response und dann muss er das mal ausprobieren und wir müssen gucken ob"}, {"id": 45, "start": 477.84, "end": 493.6, "text": "es funktioniert, was anderes fällt mir nämlich gerade echt nicht ein, so und response ist"}, {"id": 46, "start": 493.6, "end": 501.4, "text": "quasi call, ne ne response ist nicht gleich status code, response ist das was man im body"}, {"id": 47, "start": 501.4, "end": 517.8, "text": "drinne hat, body, ne, request body, funktioniert das jetzt, content oder ne, wie geht das,"}, {"id": 48, "start": 517.8, "end": 527.28, "text": "wie geht das, wollte ich nach request gucken, ne request body, available only if attp request"}, {"id": 49, "start": 527.28, "end": 537.0, "text": "message content is a floral content, was ich denn, ich will auch nicht request ich will"}, {"id": 50, "start": 537.0, "end": 559.48, "text": "only response, response message, content, ne, read, warte mal wie ging das denn jetzt nochmal,"}, {"id": 51, "start": 559.48, "end": 577.04, "text": "jetzt ersetzt attp response message, is success status message, what, read as string, alter"}, {"id": 52, "start": 577.04, "end": 588.64, "text": "können wir es noch komplizierter machen bitteschön, response, attp response message, content,"}, {"id": 53, "start": 588.64, "end": 599.0, "text": "okay ich seh schon das geht nicht anscheinend, wir haben response, ach hier, hier get string"}, {"id": 54, "start": 599.0, "end": 614.2, "text": "async, das wollen wir haben, ja, so die sache ist jetzt die, das geht doch bestimmt kaputt,"}, {"id": 55, "start": 614.2, "end": 620.28, "text": "wir müssen checken ob das null ist, wir müssen checken ob das null ist, ne ne das nicht,"}, {"id": 56, "start": 620.28, "end": 625.08, "text": "das ist, das ist nicht null, das hier müssen wir gucken ob es null ist, was soll der jetzt"}, {"id": 57, "start": 625.08, "end": 632.4, "text": "verschmerzen, das gucken ob es null ist und wir müssen gucken ob response vielleicht"}, {"id": 58, "start": 632.4, "end": 644.56, "text": "null ist, okay, so mehr als so ein bisschen debug message können wir wahrscheinlich gar"}, {"id": 59, "start": 644.56, "end": 648.56, "text": "nicht da jetzt, gar nicht tun, ne, also wir können aber mal, wir können aber mal versuchen"}, {"id": 60, "start": 648.56, "end": 655.32, "text": "zu testen ob, ob wir das nachstellen, also nicht nachstellen ob wir den Fehler, ob wir"}, {"id": 61, "start": 655.32, "end": 659.8, "text": "das testen können, dass zumindest die Error Ausgabe halbwegs, halbwegs sinnvoll ist und"}, {"id": 62, "start": 659.8, "end": 667.8, "text": "zwar wir faken das einfach mal, wir gehen jetzt mal hier in fiat client und hier braucht"}, {"id": 63, "start": 667.8, "end": 691.56, "text": "er ja den, ne, warte mal, wo sind wir, da fetch, hier braucht er ja api key, das benutzt er"}, {"id": 64, "start": 691.56, "end": 698.84, "text": "da auch schon, ich will dass der, ich will dass der fehl schlägt, okay wir gehen jetzt"}, {"id": 65, "start": 698.84, "end": 704.96, "text": "einfach nicht auf v4 accounts vehicles sondern auf vehicles und guck mal was passiert, weil"}, {"id": 66, "start": 704.96, "end": 719.8, "text": "das sollte ja auf jeden fall nicht funktionieren oder api key plus abc, ja das stimmt schon,"}, {"id": 67, "start": 719.8, "end": 734.48, "text": "error connecting to vehicles not found, okay das ist jetzt ein anderes problem, ja wir"}, {"id": 68, "start": 734.48, "end": 754.88, "text": "machen wirklich, das ist eine gute Idee chat, high iq chat, error connecting to, ähm,"}, {"id": 69, "start": 754.88, "end": 761.52, "text": "aber es geht, jetzt haben wir das Bild"}, {"id": 70, "start": 784.88, "end": 789.28, "text": "Das ist ein anderer Fehler, den wir jetzt kriegen."}, {"id": 71, "start": 789.28, "end": 795.16, "text": "Response could not be deserialized to JSON."}, {"id": 72, "start": 795.16, "end": 797.44, "text": "Okay, das können wir auch nachstellen."}, {"id": 73, "start": 797.44, "end": 799.8, "text": "Das können wir auch nachstellen."}, {"id": 74, "start": 799.8, "end": 801.48, "text": "Wir schreiben hier einfach irgendeinen Mist rein."}, {"id": 75, "start": 801.48, "end": 806.68, "text": "Was weiß ich hier, das soll ein Bool sein, User ID."}, {"id": 76, "start": 806.68, "end": 809.56, "text": "So, und dann sollte es zumindest an der Stelle doch auch abkacken."}, {"id": 77, "start": 809.56, "end": 815.4, "text": "Auf, kack ab, please."}, {"id": 78, "start": 815.4, "end": 826.56, "text": "Ah, ich hab kein Debugging an, deswegen ging das jetzt grad nicht."}, {"id": 79, "start": 826.56, "end": 829.16, "text": "Ich sag doch hier Debug, das ist ja Blödsinn."}, {"id": 80, "start": 829.16, "end": 834.84, "text": "Ich hab ja gar kein Debugging an und ich will auch gar kein Debugging zum Testen anhaben,"}, {"id": 81, "start": 834.84, "end": 836.6, "text": "weil dann seht ihr mein Passwort und sowas."}, {"id": 82, "start": 836.6, "end": 840.76, "text": "Okay, mach mal einfach Info, sollte jetzt genauso funktionieren."}, {"id": 83, "start": 840.76, "end": 852.08, "text": "Hier, alles klar, oh, das ist falsch."}, {"id": 84, "start": 852.08, "end": 855.16, "text": "Response could not be deserialized to JSON, blabla."}, {"id": 85, "start": 855.16, "end": 860.24, "text": "Okay, das bestärkt mich in der Annahme, dass die irgendeinen Mist responden, den es gar"}, {"id": 86, "start": 860.24, "end": 862.2, "text": "nicht gibt oder geben sollte."}, {"id": 87, "start": 862.2, "end": 866.8, "text": "Ich hab irgendwas nicht erwartet, kann das sein?"}, {"id": 88, "start": 866.8, "end": 873.4, "text": "Kann man, meine blöde Frau hat gesagt, kann man null überhaupt erwarten?"}, {"id": 89, "start": 873.4, "end": 874.4, "text": "Nee, oder?"}, {"id": 90, "start": 874.4, "end": 882.56, "text": "Nee, nee, nee, also ich muss jetzt quasi erstmal checken, okay, okay, okay, das ist ja eklig."}, {"id": 91, "start": 882.56, "end": 889.76, "text": "Kann ich, ich mein, ich könnte, ich könnte es halt einfach sagen, das geht wahrscheinlich."}, {"id": 92, "start": 889.76, "end": 909.16, "text": "Okay, das ist, das ist im Prinzip das, was wir haben wollen, ja, das soll so sein, also"}, {"id": 93, "start": 909.16, "end": 916.24, "text": "der sagt den Error, den Status Code und die Response, ist schön, das können wir so lassen."}, {"id": 94, "start": 916.24, "end": 943.0, "text": "Nice, wie sieht es eigentlich aus jetzt mit, no, no, no, no, no, no, no, no, no, no, no,"}, {"id": 95, "start": 943.0, "end": 961.88, "text": "no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no."}, {"id": 96, "start": 961.88, "end": 965.62, "text": "Okay, dann geht es heute nicht weiter, ich hab keinen Bock auf den Motor von Scheiß."}, {"id": 97, "start": 965.62, "end": 968.54, "text": "Leute, wir sehen uns im nächsten Stream, bis dann, see you!"}]}