{"text": "Mal gucken ob jetzt besser ist. Ach Gott, ne ist auch nicht besser. Oder?Gleiche problemNach Amsterdam haben wir anscheinend das gleiche Problem, oder? Na vielleicht geht's jetzt wiederHoffen wir mal. Hoffen wir mal, dass es jetzt wieder funktioniert. Bei dir steht, dass du mit 48FPS Streams, das ist korrekt. 48 FPS. Steht ja auch hier, guck mal irgendwo. Da, 48 FPS.Okay, ich hoffe der Switch, des Twitch Servers hat jetzt was gebracht. Okay gut.Machen wir mal weiter. Sagt mir, wenn es wieder ruckelt. Ich hoffe, es hat sich jetzt erledigt.Na jetzt scheint es zu gehen. Na gut. So, wir können Brand und Reach noch da oben rein packen.Region, da. Und jetzt gibt es im Endeffekt eine Fiat Client Options.Das kann auch alles weg. Jetzt wird das deutlich übersichtlicher, denke ich mal, wenn wir das somachen. Don Scholle, moin. Ich glaube, jetzt wird das deutlich übersichtlicher, wenn wir das somachen. Ich hoffe nur, ich mache jetzt nichts kaputt, wenn ich hier zu sehr am Refactorn bin.Jetzt muss ich nämlich den ganzen Müll hier noch umziehen. Das ist mir jetzt eigentlich fast schonein bisschen risikoreich, das hier umzustricken. Das strege ich jetzt nicht um. Ich will erst malgucken, wir kümmern uns lieber um den Jeep. Wir kümmern uns lieber noch um das Jeep Problem. Dasumbauen kann ich auch immer machen. Wir kümmern uns lieber noch um das Jeep Problem. So. Ja,ja. Wir machen es lieber so. Geht jetzt eins? Hat er irgendwie Probleme wieder? Nee, passt.Nichts gedroppt. Einmal eine Sekunde Frames wurden gedroppt. Ich hoffe, dass die Verbindungvon Vodafone jetzt nach Amsterdam besser ist. Kann mal kurz mal schauen. Recording. Ja, allesrichtig so. Gut. Also, was haben wir denn jetzt als letztes gemacht? Also, wir haben jetzt gefixt,dass der Login bei Dodge funktioniert. Dodge Login funktioniert. Okay. Sehr schön. Nice.Fetching completed. Okay, dann committen wir das mal. Status. Welchen Text hier? Das istRyder. Das ist eine Cross-Plattform.net-Idee. Diff, was haben wir jetzt gemacht? Haben diesenKrämpel hier angepasst. Das ist relativ unsinnig. Wir haben Dodge hinzugefügt als Brand und das wares. Mehr haben wir nicht gemacht. Bitte einmal Nice, so weil du es bist.Nee, irgendwo habe ich hier eine Leerzeile drin und stand da. Wie? Wo habe ich da angeblicheine Leerzeile zu viel? Ah nee, Vehicle-Response. Ja, da, da. Nee, stimmt doch gar nicht. So,alles gut. Ist gar keine Leerzeile zu viel. Was erzählt er mir denn für einen Blödsinn?Lul. Ach, ich habe einen Tab durch die Leerzeile ersetzt. Oh, ganz, ganz furchtbar kritisch.Na, noch mal Glück gehabt, dass ich das frühzeitig gemerkt habe. Also, Neues,Commit, Commit, Fixed Dodge Login. So, welcher, welcher, welches Issue ist das jetzt? 24,okay, nice. Push. Ah, weil ich die ReadMe angepasst habe. Hit, Pull, Origin, Fixed,Minus, Minus, Rebase. Push. Sehr schön. So, gucken wir mal, ob er das gecheckt hat.Hab ich Force noch drin? Nee, ich hoffe nicht. Nee, habe ich nicht. So, Actions,baue einen neuen Container. Genau. Hier in dem Issue, in dem Issue sollte jetzt ja eigentlichauch schon drinstehen, dass er das Reference hat. Genau. Da war ein Lag.Nein, Gott! Nein, Gott, bitte nein! Nein!DSL wechseln? Nee, DSL ist ja noch schlimmer. DSL ist bei mir gar nicht in dieser Bandbreiteverfügbar. Wie war auch davon, dass das bietet. Es wird Zeit für Glasfaser so langsam, aber sichermal. Jetzt funktioniert es wieder. Ja, das sind immer so irgendwelche Bursts zwischendurch. Werweiß, was da ist. Entweder sind sie überlastet. Meine sehen wir in Samstagnachmittag. Oderirgendeiner ist wirklich im rechten Zentrum und stolpert über den Router. So zumindest,das hätten wir jetzt auch gefixt, das Dodge Login. Das heißt, wir haben jetzt, guck mal, wir haben zwei von drei Issues gefixt.Das ist schon mal nicht verkehrt. Jetzt haben wir nur noch das hier übrig.Was hat der für ein Problem? Er benutzt US East. Ja, das weiß ich. Okay, der bekommt bei Cheapirgendeinen Fehler. Okay, der bekommt den Cheap Error Connecting to Fiat RP. Okay, ich weiß,wo die Fehlermeldung herkommt. Die Fehlermeldung ist mein Try Catch All. Also, wenn es irgendeineHTTP Exception gibt, wir könnten Folgendes machen. Wir könnten noch in das Stieber Glock die dieResponse reinschreiben, wenn es eine, wenn es eine gibt. Ja, also wir könnten noch den. Das ist dieMessage, die hier herkommt. Okay, Leute, ich habe echt keinen Bock mehr. Okay, Leute, ihr könnt euchaussuchen. Soll ich noch mal einen anderen Twitch Server probieren? Irgendwo in keine Ahnung,NA oder so. Mein Amsterdam ist ja anscheinend reicht. Frankfurt geht nicht. Amsterdam geht nicht.Ich könnte, ich könnte noch. Nee, das geht nicht. Komm mal 20 Prozent, 20 Prozent Lost. Das ist kacke.Also, ich probiere noch mal einen anderen Twitch Server. Ich probiere noch mal einen anderen. Sokannst du nicht streamen. Das ist komplett für den Ahnen. Doch, 20 Prozent Lost immer zwischendurch.Man merkt das nicht, weil Standbild ist aktuell. Das ist doch für ein Arsch, man. Ich starte noch einmal neu. Wenn das geht.Wenn es da nicht geht. Ja, mal gucken. Ich bin gleich wieder da. Halbe Minute. Könnt ihr refreshen.", "segments": [{"id": 1, "start": 1.0, "end": 5.48, "text": "Mal gucken ob jetzt besser ist. Ach Gott, ne ist auch nicht besser. Oder?"}, {"id": 2, "start": 7.32, "end": 9.32, "text": "Gleiche problem"}, {"id": 3, "start": 15.6, "end": 19.84, "text": "Nach Amsterdam haben wir anscheinend das gleiche Problem, oder? Na vielleicht geht's jetzt wieder"}, {"id": 4, "start": 19.84, "end": 41.44, "text": "Hoffen wir mal. Hoffen wir mal, dass es jetzt wieder funktioniert. Bei dir steht, dass du mit 48"}, {"id": 5, "start": 41.44, "end": 53.08, "text": "FPS Streams, das ist korrekt. 48 FPS. Steht ja auch hier, guck mal irgendwo. Da, 48 FPS."}, {"id": 6, "start": 53.08, "end": 80.84, "text": "Okay, ich hoffe der Switch, des Twitch Servers hat jetzt was gebracht. Okay gut."}, {"id": 7, "start": 83.84, "end": 87.96, "text": "Machen wir mal weiter. Sagt mir, wenn es wieder ruckelt. Ich hoffe, es hat sich jetzt erledigt."}, {"id": 8, "start": 87.96, "end": 110.4, "text": "Na jetzt scheint es zu gehen. Na gut. So, wir können Brand und Reach noch da oben rein packen."}, {"id": 9, "start": 110.4, "end": 136.96, "text": "Region, da. Und jetzt gibt es im Endeffekt eine Fiat Client Options."}, {"id": 10, "start": 136.96, "end": 150.76, "text": "Das kann auch alles weg. Jetzt wird das deutlich übersichtlicher, denke ich mal, wenn wir das so"}, {"id": 11, "start": 150.76, "end": 157.64, "text": "machen. Don Scholle, moin. Ich glaube, jetzt wird das deutlich übersichtlicher, wenn wir das so"}, {"id": 12, "start": 157.64, "end": 163.84, "text": "machen. Ich hoffe nur, ich mache jetzt nichts kaputt, wenn ich hier zu sehr am Refactorn bin."}, {"id": 13, "start": 163.84, "end": 173.72, "text": "Jetzt muss ich nämlich den ganzen Müll hier noch umziehen. Das ist mir jetzt eigentlich fast schon"}, {"id": 14, "start": 173.72, "end": 180.64, "text": "ein bisschen risikoreich, das hier umzustricken. Das strege ich jetzt nicht um. Ich will erst mal"}, {"id": 15, "start": 180.64, "end": 185.24, "text": "gucken, wir kümmern uns lieber um den Jeep. Wir kümmern uns lieber noch um das Jeep Problem. Das"}, {"id": 16, "start": 185.24, "end": 203.76, "text": "umbauen kann ich auch immer machen. Wir kümmern uns lieber noch um das Jeep Problem. So. Ja,"}, {"id": 17, "start": 203.76, "end": 208.52, "text": "ja. Wir machen es lieber so. Geht jetzt eins? Hat er irgendwie Probleme wieder? Nee, passt."}, {"id": 18, "start": 208.52, "end": 214.08, "text": "Nichts gedroppt. Einmal eine Sekunde Frames wurden gedroppt. Ich hoffe, dass die Verbindung"}, {"id": 19, "start": 214.08, "end": 226.6, "text": "von Vodafone jetzt nach Amsterdam besser ist. Kann mal kurz mal schauen. Recording. Ja, alles"}, {"id": 20, "start": 226.6, "end": 236.36, "text": "richtig so. Gut. Also, was haben wir denn jetzt als letztes gemacht? Also, wir haben jetzt gefixt,"}, {"id": 21, "start": 236.36, "end": 249.32, "text": "dass der Login bei Dodge funktioniert. Dodge Login funktioniert. Okay. Sehr schön. Nice."}, {"id": 22, "start": 249.32, "end": 267.48, "text": "Fetching completed. Okay, dann committen wir das mal. Status. Welchen Text hier? Das ist"}, {"id": 23, "start": 267.48, "end": 277.28, "text": "Ryder. Das ist eine Cross-Plattform.net-Idee. Diff, was haben wir jetzt gemacht? Haben diesen"}, {"id": 24, "start": 277.28, "end": 284.4, "text": "Krämpel hier angepasst. Das ist relativ unsinnig. Wir haben Dodge hinzugefügt als Brand und das war"}, {"id": 25, "start": 284.4, "end": 294.32, "text": "es. Mehr haben wir nicht gemacht. Bitte einmal Nice, so weil du es bist."}, {"id": 26, "start": 294.32, "end": 314.2, "text": "Nee, irgendwo habe ich hier eine Leerzeile drin und stand da. Wie? Wo habe ich da angeblich"}, {"id": 27, "start": 314.2, "end": 322.56, "text": "eine Leerzeile zu viel? Ah nee, Vehicle-Response. Ja, da, da. Nee, stimmt doch gar nicht. So,"}, {"id": 28, "start": 322.56, "end": 326.36, "text": "alles gut. Ist gar keine Leerzeile zu viel. Was erzählt er mir denn für einen Blödsinn?"}, {"id": 29, "start": 326.36, "end": 335.76, "text": "Lul. Ach, ich habe einen Tab durch die Leerzeile ersetzt. Oh, ganz, ganz furchtbar kritisch."}, {"id": 30, "start": 335.76, "end": 342.52, "text": "Na, noch mal Glück gehabt, dass ich das frühzeitig gemerkt habe. Also, Neues,"}, {"id": 31, "start": 342.52, "end": 355.56, "text": "Commit, Commit, Fixed Dodge Login. So, welcher, welcher, welches Issue ist das jetzt? 24,"}, {"id": 32, "start": 355.56, "end": 373.16, "text": "okay, nice. Push. Ah, weil ich die ReadMe angepasst habe. Hit, Pull, Origin, Fixed,"}, {"id": 33, "start": 373.16, "end": 385.0, "text": "Minus, Minus, Rebase. Push. Sehr schön. So, gucken wir mal, ob er das gecheckt hat."}, {"id": 34, "start": 385.0, "end": 394.52, "text": "Hab ich Force noch drin? Nee, ich hoffe nicht. Nee, habe ich nicht. So, Actions,"}, {"id": 35, "start": 394.52, "end": 400.04, "text": "baue einen neuen Container. Genau. Hier in dem Issue, in dem Issue sollte jetzt ja eigentlich"}, {"id": 36, "start": 400.04, "end": 411.48, "text": "auch schon drinstehen, dass er das Reference hat. Genau. Da war ein Lag."}, {"id": 37, "start": 431.04, "end": 436.96, "text": "Nein, Gott! Nein, Gott, bitte nein! Nein!"}, {"id": 38, "start": 436.96, "end": 464.4, "text": "DSL wechseln? Nee, DSL ist ja noch schlimmer. DSL ist bei mir gar nicht in dieser Bandbreite"}, {"id": 39, "start": 464.4, "end": 473.6, "text": "verfügbar. Wie war auch davon, dass das bietet. Es wird Zeit für Glasfaser so langsam, aber sicher"}, {"id": 40, "start": 473.6, "end": 482.92, "text": "mal. Jetzt funktioniert es wieder. Ja, das sind immer so irgendwelche Bursts zwischendurch. Wer"}, {"id": 41, "start": 482.92, "end": 490.8, "text": "weiß, was da ist. Entweder sind sie überlastet. Meine sehen wir in Samstagnachmittag. Oder"}, {"id": 42, "start": 490.8, "end": 507.0, "text": "irgendeiner ist wirklich im rechten Zentrum und stolpert über den Router. So zumindest,"}, {"id": 43, "start": 507.0, "end": 521.52, "text": "das hätten wir jetzt auch gefixt, das Dodge Login. Das heißt, wir haben jetzt, guck mal, wir haben zwei von drei Issues gefixt."}, {"id": 44, "start": 521.52, "end": 536.08, "text": "Das ist schon mal nicht verkehrt. Jetzt haben wir nur noch das hier übrig."}, {"id": 45, "start": 536.08, "end": 558.76, "text": "Was hat der für ein Problem? Er benutzt US East. Ja, das weiß ich. Okay, der bekommt bei Cheap"}, {"id": 46, "start": 558.76, "end": 565.08, "text": "irgendeinen Fehler. Okay, der bekommt den Cheap Error Connecting to Fiat RP. Okay, ich weiß,"}, {"id": 47, "start": 565.08, "end": 584.64, "text": "wo die Fehlermeldung herkommt. Die Fehlermeldung ist mein Try Catch All. Also, wenn es irgendeine"}, {"id": 48, "start": 584.64, "end": 603.04, "text": "HTTP Exception gibt, wir könnten Folgendes machen. Wir könnten noch in das Stieber Glock die die"}, {"id": 49, "start": 603.04, "end": 626.2, "text": "Response reinschreiben, wenn es eine, wenn es eine gibt. Ja, also wir könnten noch den. Das ist die"}, {"id": 50, "start": 626.2, "end": 639.08, "text": "Message, die hier herkommt. Okay, Leute, ich habe echt keinen Bock mehr. Okay, Leute, ihr könnt euch"}, {"id": 51, "start": 639.08, "end": 644.8, "text": "aussuchen. Soll ich noch mal einen anderen Twitch Server probieren? Irgendwo in keine Ahnung,"}, {"id": 52, "start": 644.8, "end": 660.24, "text": "NA oder so. Mein Amsterdam ist ja anscheinend reicht. Frankfurt geht nicht. Amsterdam geht nicht."}, {"id": 53, "start": 660.24, "end": 666.28, "text": "Ich könnte, ich könnte noch. Nee, das geht nicht. Komm mal 20 Prozent, 20 Prozent Lost. Das ist kacke."}, {"id": 54, "start": 666.28, "end": 674.64, "text": "Also, ich probiere noch mal einen anderen Twitch Server. Ich probiere noch mal einen anderen. So"}, {"id": 55, "start": 674.64, "end": 680.6, "text": "kannst du nicht streamen. Das ist komplett für den Ahnen. Doch, 20 Prozent Lost immer zwischendurch."}, {"id": 56, "start": 680.6, "end": 697.12, "text": "Man merkt das nicht, weil Standbild ist aktuell. Das ist doch für ein Arsch, man. Ich starte noch einmal neu. Wenn das geht."}, {"id": 57, "start": 697.12, "end": 711.12, "text": "Wenn es da nicht geht. Ja, mal gucken. Ich bin gleich wieder da. Halbe Minute. Könnt ihr refreshen."}]}