{"text": "Das war's für heute.Bis zum nächsten Mal.Das war's für heute.Wir basteln heute nicht mit unserer Linux Kiste weiter, sondern wir schwätzen ein bisschen,gucken ein paar Videos und reden über Zeug.Ist ja auch nicht mehr so viel Zeit, ich bin ja bloß so ungefähr zwei Stunden da.Chat soll ich euch mal was erzählen, also bei mir auf der Arbeit geht es gerade irgendwieecht rund.Also nicht nur, dass ich in drei Monaten, also nicht stimmt, dass ich da gar nichtmehr drei Monate, in zwei Monaten weg bin, also 31.3., also in zwei Monaten bin ich quasiweg.Erster Monat ist ja schon mehr oder weniger wieder rum, fast schon rum.Also nicht nur, dass ich weg bin, ein Kollege von mir weg ist, noch ein Kollege von mirweg ist und insgesamt Leute, ich habe eine Zahl gehört, haltet euch mal fest, halteteuch mal fest.Ich habe keine Ahnung, ob das offiziell ist, ich habe das um drei Ecken, die Chance, dasses sich ausgedacht ist, ist genauso groß wie das, das stimmt.Ich habe gehört, dass rund 140 Leute Ende letzten Jahres aus der IT, beziehungsweiseIT ist ja bei uns, also alles, was zu dieser extra IT Firma gehört, das ist ja schon einbisschen größer, 140 Leute sind abgehauen.Also ich war nur einer von vielen.Da muss ich euch mal vorstellen, um die 140 Leute, das ist wirklich eine Menge.So zumindest nicht nur das, heute habe ich von meinem Teamleiter erfahren, dass er, wiegroß ist die Belegschaft, ja ich kann es euch nicht genau sagen, weil die haben dasja aus steuerlichen Gründen so gemacht, dass es für IT so eine extra Firma gibt und dannnochmal eine extra Firma, dann irgendwie so eine extra für irgendwelche Publikationenextra, da blickst du nicht durch, ich weiß nicht, ob die 140 insgesamt waren oder IT,ich vermute IT, also wir sind, ehrlich, ich habe keine Ahnung, wie viele, ne, wobei nurIT kann ich sein, wenn ich mir recht überlege, das muss insgesamt sein, insgesamt, allerdingsohne so das Kerngeschäft, also ohne jetzt irgendwie so Außendienstmitarbeiter und so was, alsoquasi nur Leute, die da auch in Frankfurt in diesem Hauptgebäude sind, 140 Leute oderum die 140 Leute, das muss insgesamt gewesen sein von, ich weiß es gar nicht so, ich habekeine Ahnung, Leute, ich kann es euch wirklich nicht sagen, ich habe jetzt, ich habe wirklichkeine Ahnung, wie viel und wie das wo wieder zugehört, aber 140 klingt erstmal zumindestnicht wenig, es muss deutlich mehr gewesen sein, als die Jahre zuvor, was ich gehörthabe und an dem Tag, wo ich die Kündigung abgegeben habe, oben war, also wir haben dieja zu zweit oben abgegeben, wir waren auch nicht die einzigen, das hast du der Personalabteilungangemerkt und nächste Woche habe ich meinen, zahltet euch, zahltet euch mal fest, wie heißtdas, Austrittsinterview glaube ich, mal gucken, irgendwann im Februar ist das, mein Austrittsinterviewhabe ich, habe ich nächste Woche, nee, nee, nee, übernächste, übernächste Woche, dawird ausgetreten, so hört sich fast, als muss ich mal in die Ecke pingeln, ja das klingtso, als muss man mal kurz irgendwo das Bein heben an irgendeine Ecke, viermal nur loben,nee, ich sag denen was Sache ist, ich sag denen, dass mir Home Office auf den Sack gegangenist, dass so oft angekündigt wurde, die und die Dinger wollen sie ändern und im Endeffekthaben sie es ja nie gemacht, gibt ja durchaus einige Punkte, die mirauf den Keks gehen, ich werde es denen sagen, heute hat man auch zum ersten Mal so richtigrealisiert glaube ich, dass ich bald weg bin, weil ihnen aufgefallen ist ja, das macht jadann gar keiner mehr, da dachte ich mir so, ach ist das wirklich so, hätte mir ja garnicht dran denken können, schon vor irgendwie einem halben Jahr oder so, als ich gesagthabe, bald bin ich höchstwahrscheinlich weg, fällt jetzt erst auf, ach wie, wirklich,ist das echt so, naja, was noch dabei kommt, heute habe ich um zwei Ecken gehört, dasswohl mein Chef, also mein jetziger Chef, wohl auch aufhört, also sprich, mein jetzigerChef hört auf und mein Chef da vorne hat ja auch aufgehört, also Führungskräftebei dem Laden, die machen es nicht lange, ja, der oben drüber hört auch auf, die habenalle keinen Bock mehr auf den Kram, das ist echt der Wahnsinn, die werfen alles Handtuch,ich hab jetzt noch, ich weiß jetzt noch von einem, der Mitte des Jahres abhaut, bei demhat das mit Ende, bis Ende letzten Jahreskündig nicht mehr hingehaut, der haut Mitte nixletzten Jahres ab, also ganz im Ernst, das sieht echt, da siehts wirklich gerade sehrdüster aus, aber ich sag euch, die überleben das ohne Probleme, ist kein Ding, die werdenentweder es einsehen und ein paar Sachen verbessern, die Leute komplett mit Geld zuscheißen,doof, dass ich dann schon weg bin, aber gut, oder es geht so den Bach runter, dass mansich nur noch zu helfen weiß, indem man irgendwelche super teuren Dienstleister kauft, die megaviel Geld kosten und das für einen machen, was auch immer, ist nicht mein Problem, ichwerd das natürlich weiter ein bisschen verfolgen, so interessiert mich ja schon, wie es weitergeht,ich war jetzt ja über 10 Jahre bald dort, also nicht so, dass ich das morgen aufhörzu interessieren und ich kenn ja auch noch ein paar Leute, ich werd mir das sicher abund zu mal erzählen lassen, so ohne Details zu verraten, was denn da jetzt abgeht, dasSchöne ist, ich bin ja nur 800 Meter Luftlinie weg, also ich geh sicherlich mit den ein oderandere nochmal was futtern, so mein 1-14-tägigen Anwesenheitstag vor Ort, das ist so geil,heute hab ich's wieder mitgekriegt, was die da für ein Geschiss machen, Alter, das Wahnsinnund bei meinem neuen Job ist einfach 1 Tag die Woche Anwesenheit oder eventuell 14 Tage,aber die wollen's, die wollen's nicht besser dort, wo ich aktuell bin, die wollen, dassalle Leute wegrennen, die wollen, wie gesagt, ich kann's mir anders erklären, naja gut,so viel dazu, mich juckt's, was ist das am Rücken, ich komm da dran, hast du das Videogesehen, Pax, ich sag mal lieber Toni, ich glaub, das ist die, das was da von der Nameist, hast das Video geguckt und wieder streamen, ja, aber heute kein Linux-Bastelzeug, heutegucken wir ein paar Videos und schwätzen ein bisschen, wie waren eigentlich eure Abschlussprüfungen,ich hab gehört, es gibt ein paar Leute, die Abschlussprüfungen hatten, ne du warst dasdoch hier, oder, warst du das nicht, das kann ich nicht aussprechen, aber der Name, denhab ich schon mal gesehen hier und ich glaube, da ging's um Abschlussprüfung, ich war indie Abschlussprüfung, Horgurs, 92 Punkte insgesamt und hat sich, also ich hatte 95%auf die mündliche Abschlusspräsentation und die schriftliche war nicht ganz so gut,aber das ist random, ganz ehrlich, das Ergebnis der Abschlussprüfung bei der IHK hat überhauptgar nichts zu sagen, also wenn die Firmen sich einreden nach dem Motto, ja, wir nehmenwirklich dann nur die Leute, die einen Abschluss über sowieso haben, total dumm, weil diebesten Leute verpassen sie dann eventuell, also das sagt gar nichts aus, das ist so random,ich würd sogar gar nicht sagen, dass tendenziell im Durchschnitt bessere Leute, bessere Abschlussergebnissehaben, das ist gar nichts, das hat wirklich gar nichts aus zu sagen, das ist komplett,es ist nicht so wie Spielstunden, wo man sagen kann, ja im Durchschnitt spielt einer mitmehr Spielstunden besser als einer mit weniger Spielstunden, aber die IHK Abschlussprüfungist einfach komplett random, also ich hatte einen in der Berufsschule, den haben sierichtig gefickt bei seinem Arbeitgeber, der wollte ja da unbedingt da bleiben, das warein großer, der Arbeitgeber war ein großer, Moment ich muss mal kurz gucken, was sinddie Wirtschaftsberater oder sowas, was ist PwC, Wirtschaftsprüfungsgesellschaft, ja,also bei PwC war der, kann ich mich noch dran erinnern und die haben ihm gesagt, der darfnur da bleiben, wenn er mindestens zwei oder so insgesamt eine Abschlussprüfung hatteund der hat halt so richtig, also die Abschlussprüfung hat er super geschrieben, aber der Typ warwirklich schlau, also ich würd sagen der hatte zum damaligen Zeitpunkt deutlich mehr Planals ich und ich würd sagen, ich hab mich auch schon für den Azubi-Style ganz gut ausgekannt,der hatte wirklich Plan, der hat auch vorher, der hat auch vorher, ich glaube Informatikfertig studiert hat er bestimmt nicht, also der war wirklich, der war wirklich klar undden haben sie richtig hart ran genommen bei der Abschlussprüfung, weil er wohl irgendwelcheStichwörter gesagt hat, die einem in dem Prüfungsausschuss nicht gefallen haben, alsowie gesagt, ich hab Präsentationen von dem gesehen, die waren super, der hatte Plan,also ich kanns mir bei dem nicht anders erklären, wie dass er einfach Pech hatte und einen Prüfererwischt hat, der an dem Tag schlecht drauf war und die haben dann gesagt, der hatte dannglaube ich irgendwie eine 3,5 oder 3,3, keine wirklich super Abschlussnote, dann hab ichgesagt, nö, dann nehmen wir dich nicht mehr, das hat nix mit Anspruch zu tun, die IHK-Prüfungist komplett random, wenn ihr das macht, habt ihr im Zweifelsfall die besten Leute, dieeuch abhauen, du kannst auf die IHK-Abschlussprüfung nichts geben, das einzige was du vielleichtbei der IHK-Abschlussprüfung sagen kannst, ist bestanden oder nicht bestanden, der Restist komplett random, das ist doch nicht mal ein Indikator, das ist einfach komplett random,das würde ich null drauf geben, welche Prüfung ist nicht komplett random, naja, die meistensind nicht komplett random, die meisten sind irgendwo relativ nachvollziehbar, was denInhalt angeht und wenn man sich auf den Inhalt vorbereitet hat, dann ist die, es geht hauptsächlichum die Präsentation, die Prüfung, die Prüfung ist auch für'n Arsch, die Prüfung ist auchfür'n Arsch, aber die Prüfung ist ja Präsentation und schriftliche Prüfung, die Prüfung istauch für'n Arsch, weil es kommt dann aus so nem riesen Ding, was dran, gut, zum größtenTeil immer wieder das gleiche, die Fragestellung ist immer äußerst wir, zumal die IHK jedesJahr massig Fragen streichen muss, weil die zu dumm gestellt sind, aber die Präsentation,die Präsentation ist allein schon aus dem menschlichen Faktor, ähm, nicht, nicht predictable,naja, man könnte, man könnte vielleicht wirklich so weit gehen noch und sagen, dass es so istwie bei Games, derjenige der sich richtig gut drauf vorbereitet und Plan vornehmen hat,ist, im Durchschnitt ist tendenziell besser, aber es gibt immer noch Ausreißer von obennach unten und die sind nicht selten.Also ich find's blöd, da drauf zu gucken.Auf die schriftliche Prüfung kann man vielleicht noch ein bisschen drauf schauen, dass mansagt, aber was bei der mündlichen Abschluss, solange das Ding abgeschlossen ist, ich mein'ganz im Ernst, warum filtert, ich mein' ganz, ich find's bescheuert, wenn ihr sagt, ähm,ihr habt so eine, so eine Übernahmequote, ihr kennt doch den Azubi drei Jahre lang,ihr kennt den doch besser als, als irgendwie dann so eine Note je einschätzen könnt, ihrhabt den Kerl drei Jahre lang ausgebildet, ihr habt den Kerl drei Jahre lang kennengelernt,ihr wisst doch am besten, ob der sich für euch eignet oder nicht, scheißt doch drauf,ob der vielleicht bei der IHK-Abschlussprüfung jetzt so eine 3 anstatt eine 2 oder eine 1hat, das ist doch überhaupt nicht ausschlaggebend, ihr könnt doch viel besser einschätzen alsdie IHK, ob der Typ Ahnung hat, ob der Plan hat, vor allem ist das jemand, der drei Jahreschon weiß, wie's bei euch aussieht, also, ich verstehe, man, ihr könnt natürlich machen,was ihr wollt, aber ich versteh's nicht, also, ich würd' da keinen Wert drauf legen, also,also wenn ich Leute mir aussuchen müsste, würd' ich das rein auf den Erfahrungen, natürlich,ich würd' voraussetzen, dass die Abschlussprüfung geschafft wird, das ist aber auch alles, derRest, ähm, find ich blöd, also find ich, find ich nicht sinnvoll. Ja, Leko, moin. Ja,wie war denn jetzt hier deine Abschlussprüfung? Wobei, oder hast du die doch gar nicht? Ach,ich hab sie bestanden. Pog. Was, ah, was für'n Ding? Moment, was? Github. Alter, wie sollman das aussprechen? Agriium. Das hört sich an wie irgendeine Krankheit. Äh, also, 8Sterne? Scheint, jetzt vor 10 Monaten letztes Release, ah, verstehe, das ist fake Github,das ist gar nicht Open Source. Die haben in Github erkannt, dass es besser aussieht, oderwie? Also, das ist was kostet, ist nicht, ist kein Ding, allerdings, das was Open Sourceist, finde ich schon ganz praktisch. Ähm, beeinigt ist das, wir haben die besten Azubismit dem besten Schnitt und niedrige schriftliche Prozentsetzung. Na ja, man könnte das machen,jawoll. Du hast dich als Cloud-Native, das hast du nicht, du jebaitest mich, das hastdu bestimmt nicht gesagt. Das ist jebait. Sowas, sowas sagt doch niemand bei seinerAbschlussprüfung. Niemand stellt sich bei seiner Abschlussprüfung hin und sagt, ichbin Cloud-Native-Negative-Latency-Expert. Das ist, sag ich doch, das ist jebaites. Gibtes eine Liste? Du, es gibt bestimmt Generator dafür. Du brauchst, du brauchst zu 20, 30Buzzwords und die kannst du beliebig zusammen, kannst du wahrscheinlich sogar Chat-GPT dazufragen, dass er dir einen coolen Buzzword-Titel generieren soll. Viele schreiben in der Stellanzeitungfür eine Ausbildung bei uns einse Azubis. Ja, das ist dann aber umgedreht. Das sollja eine, wenn auch eine vielleicht etwas merkwürdig, aber das soll ja Werbung fürdie Firma sein, das soll ja Werbung für das Unternehmen sein. So nach dem Motto, gucktmal, wir bilden so gut aus, dass ihr Einser habt. Das ist ja nicht, wir nehmen nur Leutemit Einser, das ist eher umgedreht gemeint. So nach dem Motto, guckt her, wir sind zutoll, bei uns haben die Leute Einser. Das ist ja was anderes. Keine Ahnung, was du machst.So, was sollte ich mir angucken, dass da? No credit card required, da bin ich ja schonmal froh. Äh, wer hat das, wer hat das gepostet? Gerade nicht, dass das Werbung ist oder so,kann ja sein. Wer hat das gerade gepostet? Ich sehe es nicht. Ja. Nee, Battlesheep, derist öfters da, das ist keine Werbung. Oder vielleicht, vielleicht, vielleicht, vielleichtist ja von dir, kann doch sein. So, was gucke ich, was gucke ich mir hier an? Trusted bydevelopers at Google, okay. Ähm, okay, was, das ist jetzt, das ist sehr, sehr, äh, istdas, kann man das lokal sinken oder ist das cloud only? Local und cloud vaults, mobileapps, okay. Mac, Windows, Linux, mobile apps. Ah, login. Warum ist denn das nicht so bekannt?Guck mal, Hacker News. Reddit. Hacker News. Ich, ich guck's mir mal an. Es ist, kanndas, kann das notifications auf allen Plattformen? Ah, realtime collaboration, juckt mich jetztüberhaupt nicht. Kann das to do lists mit notifications? Ja, okay. Ich bin blind, Leute,ich seh nix mehr. Ja, guck ich mir mal an. Nordstars Kalender, ja, das ist was, was ich,aber das wäre cool, dann frag ich mich, warum das nicht so beliebt ist. Naja, gut. Habeich eine interessante Stelle gesehen, da wäre aber eine MySQL Datenbankadministration dabei.Was für eine, die schreiben, die schreiben, wenn die, wenn die einen Datenbankadministratorsuchen, dann steht das auch im Titel, beziehungsweise steht ganz oben, wenn irgendwo drin stehtKenntnisse, Webserver, MySQL und Zeug. Da würde ich jetzt nicht davon ausgehen, dassdu da der MySQL Experte bist. Da musst du, da musst du vielleicht mal eine DatenbankBackup ziehen oder sowas. Ansonsten ist die Datenbankadministration ja wieder eine Wissenschaftfür sich. Ach, MSSQL, ja, komm doch das gleiche raus. Nee, da würde ich, das würde ich nichtmachen. Microsoft Zeug, Alter. Nee, das würde ich nicht machen. Aber gut, kann ja jeder machen,wenn dir das gefällt. Datenbankadministration ist Wissenschaft für sich, wenn man das wirklichmit Optimierung und sowas, gerade was Oracle angeht. Ich glaube, ich glaube bei uns sinddie Oracle DBAs so ziemlich die freifertigsten und bestbezahlten Leute, die wir haben, glaubeich, unterm Strich. Das kommt wohl gleich nach IBM Mainframe mit Host von dem, was du Ahnunghaben musst, dass es nicht beliebt ist. Da gibt es coolere Sachen, ja, das interessiertaber im Business Umfeld nicht, ob es coolere Sachen gibt. Da wird Oracle verwendet, geradeweil die Anwendungen meistens ja nicht komplett neu entwickelt werden, sondern die gibt esseit 150 Jahren schon und eben auf Oracle Basis. Außerdem ist im Enterprise Business Umfeldauch wichtig, dass du einen ordentlichen Support-Vertrag kriegst und da fallen die meisten hippen angesagtenneuen Sachen erstmal weg. Bei Oracle kriegst du nicht nur einen Support-Vertrag, bei Oraclekannst du, wenn du Bock hast, Millionen in Support-Verträge ausgeben und dann freuensich im Endeffekt alle, weil sie so toll supported sind. Ansonsten ist der Oracle Support eigentlichziemlich useless, der ist genauso unsinnig wie der Microsoft Support und andere Supports,die antworten nur möglichst schnell auf Tickets, damit sie ihre SLAs einhalten, wirklich washilfreiches kommt da eigentlich nie mehr raus. Also ich habe Snowflake Datenbank Zeug nochnie ausprobiert und das machen wir heute gar nicht, aber das können wir ruhig als Titeldrin lassen, schadet nichts. Das nächste Mal ist es dann wieder angesagt. Na wir guckenuns heute ein paar Sachen an. Gibt es irgendwelche spannenden Videos? Lass mal kurz. Never usePowerPoint again. Marp. Das kenne ich. Das ist für Markdown Präsentationen. Das kenneich. Damit habe ich ganz lange Präsentationen erstellt. Ich verwende tatsächlich in letzterZeit wieder öfters Powerpoint. Powerpoint war übrigens der Grund, warum ich mir eineOffice Lizenz gekauft habe. Ihr wisst, ich finde Office ist maximal useless. Also Wordwürde ich nicht verwenden, Excel ist das Einzelige noch mit Daseinsberechtigung, wasich aber auch nicht verwende. Aber Powerpoint war mit der Ausschlaggebenden Punkt, warumich mir tatsächlich ein Office Abo gekauft habe. Erstens, weil es im Business Umfeldeben sehr beliebt ist. Und wenn du Vorlagen und Templates verwenden musst, wo viele Unternehmenoftmals Wert darauf legen, ist Powerpoint ziemlich das Einzige. Und außerdem muss ichsagen, mittlerweile finde ich die Powerpoint Bedienung gar nicht mehr so schlecht. Alsoseit den letzten paar Versionen. Man kommt damit tatsächlich ganz gut klar. Außerdemhaben die mittlerweile ein paar wirklich coole Animationsfeatures, wo du Textzeilen animierenkannst, ist eigentlich ganz praktisch. Was ich halt nicht mache, ist so die 0815 PowerpointVorlage verwenden, die da drinnen ist, weil die sehen alle kacke aus. Ich meine, meistensein Farbverlauf im Hintergrund und dann wenige Stichworte und ein paar Bilder dabei. Azubiverkackt das richtig. Nicht nachmachen. Wichtig! Aha, eine Home-Lab-Tour. Home-Lab-Tour. Alter,heftiger Kokona. Bei dem Video haben doch bestimmt die Leute drauf geklickt, weil da stehtnicht nachmachen. Oder? Eine Home-Lab-Tour. Was home-lapt er denn? Okay, zeige ich es.Ich gucke mir immer gerne das Setup von anderen Leuten an. YouTube empfiehlt mir jetzt geradeunbedingt hier im ersten Spot Videos mit wenig Views, oder? Ja, habe ich. Er fragt,hast du auch so wenig Motivation wie ich, weil du bald einen neuen Job anfängst? Ja, habeich. Habe ich. Ich sage euch, es ist, es hätte ich selbst nicht gedacht, aber in dem Moment,wo ich da die Kündigung abgegeben habe und aller, aller spätestens, seit ich die Bestätigung,so nach dem Motto, Termin und so passt alles, in der Post hatte, sodass ich mir nicht verrechnethabe oder so, ich habe auf einen Tag vom anderen keine Motivation mehr, irgendwas großartigzu machen. Ich mache die ein oder anderen Sachen. Ja, ich gehe in meine Dailies, ich gehe inmeine Wartungsrunden, ich sage das ein oder andere auf unserer Teamrunde, ich mache imZweifelsfall auch noch ein paar Fixes und Tickets und so, aber so großartige Motivationwas zu machen ist komplett weg. Aber wo soll die auch herkommen? Na gut, das ist natürlichnicht dafür gedacht. Mockups für Frontend, was ist denn da gerade angesagt? Lange Zeithaben die Leute, wie heißt das, Figma verwendet? Figma hat eine ziemlich dofe Aussprache aufDeutsch oder vielleicht soll man Figma sagen, ich weiß nicht, ob das besser ist. Also zeitlanghaben die Leute Figma verwendet für Frontend Mockups, was ist denn gerade so der neuesteScheiß? Bestimmt nicht. Im Frontend und JavaScript Umfeld ist es selten, dass ein Tool längerals ein halbes Jahr bis Jahr angesagt ist. Das ist cool, das kenne ich, das gibt es schonjahrelang, das habe ich früher auch verwendet. Aber das gibt es doch gar nicht mehr, oder?Das basiert doch immer noch auf Adobe Air Balsamik, das gibt es doch gar nicht mehr,oder? Die letzte Version, die ich gesehen habe und die ist Jahre alt, basierte aufAdobe Air und kann man eigentlich nicht mehr verwenden. Gibt es das noch? Ja, aber alsWeb, als Web only, oder? Nicht Desktop Programm. Browser only. Also ich habe das verwendetfrüher, da war das noch auf Adobe Air Basis. Ach App, ok. Muss ich mal gucken, ich fanddas wirklich nice früher. Ich habe das gern verwendet. Wireframing Tool Desktop. Ah Alter,mein Gott, warum ist denn die das immer so? Ah kein Linux Setup? Nein, nee. Ich habedir gar nicht empfohlen, ich habe es dort zum ersten Mal ausprobiert, aber bis jetzt findeich es wirklich nice. Ich habe heute vorhin noch ein bisschen, bevor ich den Stream angemachthabe, an der VM gebastelt. Wir machen dann aber im Stream weiter, da gibt es ja durchausnoch einige Dinge, aber wir müssen gucken, dass es halbwegs einheitlich von den Farbenher aussieht. Wir müssen uns ein paar neue Cursor machen und die Konfics noch fertigmachen. Lass mal kurz schauen. Wir können uns doch gleich die Homelab Tour angucken.Das ist ein kleiner Channel anscheinend, nur 498 Zuschauer bis jetzt. Gucken wir mal, obdie Videoqualität und sowas passt. Also erstmal Wub Wub Wub Wub Intro, alles klar.Alter, was für eine Audioqualität. Und kein Video, nur ein Foto. Ok, dann will ich mirdas nicht angucken. Wir kriegen ein Video gezeigt. Any Desk. Moment, Moment, Moment,Moment. Warum geht er auf seine Server per Remote Desktop? Hat er Kisten mit komplettinstalliertem Sass? Warum macht man denn sowas? Ok, ja, sieht bei mir wie im Abstellraum aus.Was hat er am Start? Gucken wir mal ganz schnell durch. Ok, nix weltbewegendes dabei. Alsoda ist nix dabei, wofür man das bräuchte. Ich mein gut, der hat ein TrueNAS und ProxMox,damit kannste die Kisten schon ordentlich auslasten, aber ich glaube nicht, dass erdas macht. Ok, das Video ist langweilig, das gucken wir nicht. Hast du das mit MyDealsund Paypal mitbekommen? Ne, was war? Was war mit MyDeals und Paypal? Was hab ich gemisst?Wow! Banger! Ok, was ist mit Paypal? Ok, was ist mit Paypal? Ok, was ist mit Paypal?Ok, ach nee, ich dachte da wurden vielleicht irgendwie wieder, weil Paypal hat in letzterZeit mal ein paar Daten geleakt und Daten verloren, ich dachte da ist irgendwas, wasmich interessieren müsste. Rest ist mir, glaubt ihr das interessiert mich nicht.Ok, ich guck ja normalerweise keine Shorts. Ach, dass sie zeigen Emmet. Heißt das überhauptnoch so? Wurde das nicht umbenannt? Da kannst du dein HTML mit zur Abkürzung erstellen,das ist eigentlich ganz nice. Ah, ich vergaß, ich vergaß, ein Volume Slider ist selbstverständlichnicht im Scope bei Shorts. Wo wäre eigentlich das mit MySeries Frage an die krassen UIDesigner im Chat, wo wäre denn das Problem gewesen hier ein Volume Slider hin zu machenanstatt nur Ton an oder aus? Ist das zu advanced für Highly Paid Professionals bei Google?Shorts durch Watch in der Uhrlehr? Ich weiß, dass man das austauschen kann, aber warumist das nicht da? Was sagst du denn zu Chat-GPT? Ich wüsste nicht, was ich da zu großartigsagen könnte, was nicht schon tausendfach gesagt wurde. Ja, das kennen wir, das kennenwir. Ich wollte euch jetzt mal was fragen, vielleichtist das nicht ganz politisch korrekt. Ich habe das nur heute in den Nachrichten gehört,das mit Panzer liefern an die Ukraine und sowas. Es gibt zwei Sachen, die ich nichtganz verstehe, vielleicht könnt ihr mich da mal aufklären. In den Nachrichten habensie heute sinngemäß sowas erzählt wie Bundesregierungen Unterzug zwangen und wir haben einen Imageschadenerlitten, weil wir der Ukraine keine Panzer geliefert haben oder sowas. Ich denke mirzuerst, so ein Panzer ist Schweine teuer. Es gibt zwei Sachen, die ich nicht ganz verstehe.Das erste ist, also klar, Panzer sind Schweine teuer, so ein Panzer kostet irgendwie 5 Millionenoder sowas. Ich habe mal nachgeguckt, 5 Millionen im Durchschnitt. Haben die Leute dort überhauptLeute, die die fahren können? Haben die überhaupt Leute, die die fahren können? Wahrscheinlichist das nicht so easy. Ach, das liegt daran, weil die das versprochen haben in der Wahl,dass man keine Waffen liefert. Okay, dann verstehe ich natürlich, dass sie sich daso hin und her dingsen. Du kannst ja nicht einfach Leute reinsetzen und sagen, auf geht'sauf Fahrt mal. Dann ist das Ding. Das zweite ist, was ich auch nicht ganz verstehe, warumist das ein Imageschaden? Ich meine, wir sind ja nicht wirklich verpflichtet, dazu das zumachen. Ich meine, ich finde das eigentlich gar nicht verkehrt, zumindest auf den erstenBlick. Ich hatte ja oftmals mehrere Seiten, vielleicht jetzt irgendwas, woran ich nichtdenke. Ich finde das jetzt erstmal gar nicht so übel, dass sie das machen wollen. Aberwarum haben wir einen Imageschaden? Ich meine, es gibt doch nichts, das uns dazu verpflichtet,das zu machen. Es ist sicherlich nice, wenn wir das machen, aber wir sind ja nicht dazuverpflichtet. Das habe ich nicht so ganz verstanden, aber gut. Ich muss euch ganz ehrlich sagen,ich bin, was so weltpolitische Sachen angeht, ich ignoriere das meiste. Es geht mir mittlerweilealles so unglaublich auf den Sack. Nicht nur, was in der Welt passiert, auch wie es aufTwitter und Social Media alles breit diskutiert wird. Mir geht einmal die Ereignisse an sichzum größten Teil auf den Sack und mir geht fast noch mehr auf den Sack, wie dämlichdie Leute, was für dämliche Sachen die Leute dazu schreiben. Das heißt, deswegen wohneich auf Twitter auch in Andorra, damit ich nichts von diesem ganzen Shit mitkriege.Und wenn ich doch aus Versehen mal auf irgendwas draufkomme, dann sehe ich wieder, das istnoch nicht immer ein deutsches Problem. In Deutschland schreiben die Leute auch viel dummesZeug. Es ist international genauso. Egal, ob es auf Englisch oder auf Deutsch ist, dudenkst dir immer so, mein Gott, was schreiben die Leute nur für eine Scheiße immer. Ichignoriere das alles. Ich ignoriere einfach komplett, komplett alles, was passiert aufder Welt. Standort Andorra, ja, das ist eine gute Idee. Ontario, danke für den Sub. Dasist wirklich eine gute Idee. Aha, okay Chat, jetzt weiß ich Bescheid, alles klar. So, wasgucken wir uns, was gucken wir uns denn jetzt an? Hä? Erzählt er uns was vom Osimodell,oder? Und Unrate direkt oder über Proxmox? Ich sehe keinen Sinn da drin, Unrate überProxmox zu betreiben. Du kannst über Unrate auch VMs und Container hosten. Du musst gucken,wo dein Schwerpunkt ist. Wenn dein Schwerpunkt, sag mal, eine out of the box Oberfläche istfür ein bisschen Virtualisierung, Container und Netzwerkspeicher ist Unrate eine guteSache. Vor allem, wenn du eher auf, wie nennt man das so schön, out of box Experience stehstund einen Plugin Manager haben willst und ein paar Sachen, da ist Unrate ganz nice. Wenndu hauptsächlich Virtualisieren willst, Virtualisieren wohlgemerkt, dann ist Proxmox ganz gut, aberdu kannst halt keine normalen Standard Container, du kannst halt nur Raw LXC Container drauflaufen lassen, was jetzt nicht wirklich schlimm ist. Du kannst einfach einen Container startenund da drin einen Docker laufen lassen, das geht. Aber hauptsächlich für VMs, also wenndu hauptsächlich Virtualisieren willst, ist Proxmox sicherlich die bessere Variante. Wenndu ne Mischung hast aus allem, finde ich persönlich Unrate schicker, gerade im Heimbereich, weilim Heimbereich brauchst du ja selten nen 3-Node-Virtualisierungscluster. Das ist eher was Proxmox ist für meinen Geschmackeher was für Leute, die entweder viel basteln wollen daheim, also die halt sich einfachinteressieren dafür und gerne da den halben Tag drinnen verbringen oder eben für kleinereInstallationen, also jetzt sprich nicht jetzt irgendwie was mit 500 plus Mitarbeitern, diesich ohne Probleme auch ne ESX-Lizenz leisten können und ein bisschen ein Know-how damitaufbauen, sondern jetzt für irgendwie so nen Schreinerbetrieb oder so, die was brauchenoder irgendwie ein Marketing-Office oder sowas, wo schon ein Business-Umfeld, aber jetzt haltwirklich was Überschaubares, die vielleicht, wenn es hochkommt, im Keller oder so irgendwieein Rack stehen haben oder 3-4 Kisten irgendwo unterm Tisch. Da ist Proxmox, finde ich gut,so im kompletten Business-Enterprise-Umfeld weiß ich nicht, warum man da lieber Proxmoxnehmen sollte anstatt ESX. Der einzige Grund, der mir einfällt ist natürlich das Geld,wobei sich das wieder relativiert. Umso größer die Läden werden, umso mehr IT-Budget istnatürlich da auch frei. Wenn ich einfach was haben will, was easy funktioniert, dann würdeich auf jeden Fall Android nehmen, halt für Netzwerkspeicher und sonst was, da musstedir nicht viel Gedanken machen. Ich finde die Bedienung ist mittlerweile wirklich nice,deswegen habe ich das auch. Läuft alles vom USB-Stick, ich glaube Proxmox. Läuft Proxmoxauch vom USB-Stick? Ne, die machen irgendwie noch einen ZFS-Rate und sowas. Es ist einfachdie Frage, wo man den Schwerpunkt legt. Gibt ja noch mehr Möglichkeiten, du könntest jaauch TrueNAS angucken, das neue auf Debian-Basis, damit kannst du auch nass machen und Containerund Top-VMs laufen lassen. Du könntest das komplett selbst machen auf einer Ubuntu-Kiste,kannst sowas wie Cockpit drauf installieren. Also ich muss sagen, ich habe Android früherso ein bisschen geflamed, weil ich mir gedacht habe, warum braucht man sowas? Mittlerweilehabe ich selbst als einzigen Server noch im Einsatz, also X86-Kisten, ich habe noch einRaspberry Pi rumstehen und im Wohnzimmer was zum Aufnehmen und so, aber als richtig Server-Kiste,so eine HP-Micro-Server, die einzige Kiste, die übrig geblieben ist bei mir, die läuftmittlerweile auch mit Android. Da muss ich sagen, die Kombination aus Out of the Box-Funktionalitätund ein bisschen Virtualisierung, ein paar Container, ich habe da irgendwie 12-13 Containerdrauf laufen, 2 VMs, einer davon ist mein Home Assistant, du kannst relativ easy im GUIUSB-Paths für USB-Sticks, Wi-Fi-Sticks, Stick-B-Sticks und so definieren, Container kannst du automatischupdaten lassen übers GUI, das kannst du ja mit, das kannst du ja beispielsweise bei Proxmoxnicht machen, da musst du dir selbst was für ausdenken. Du kannst Container starten, dukannst theoretisch in diesem Container dann Docker installieren und dann da drin was starten,aber du musst dir dann trotzdem Gedanken machen, ok, wie bekomme ich mit, wenn es Updates fürdie Container gibt, wann pulle ich das, wie mache ich das, wo mounte ich meine Volumeshin und solche Geschichten, das brauchst du da gar nicht. Ich mache alle paar Wochen maleinen Backup von meiner Config und nächtlichen Backup auf eine externe Platte und fertig ist.Ja, also ich finde Android im Heimbereich nice, Proxmox ist auch nice, allerdings der Schwerpunktist halt im Heimbereich finde ich jetzt nicht so sehr auf den Stärken von Proxmox. Proxmoxkannst du super hochverfügbar machen, kannst du super klustern, kannst du VMs hin und herschieben, wenn was kaputt geht. Für Container-Housing finde ich es jetzt ehrlich gesagt nicht soder Hit, weil du dich trotzdem noch irgendwie um alles selbst kümmern musst. Tja, mussman gucken, wo der Schwerpunkt drauf liegt. LP-Fi, Dankeschön für den Sub, Massive Subscription,was das kostet, Android, nicht so teuer, glaube 19 Dollar oder sowas. Unraged License Purchase,oh nee, ich habe nichts gesagt. Ey, ist das teurer geworden? Oder hat es schon immer soviel gekostet? Also ich habe eine Basic-Lizenz, ich habe eine Basic-Lizenz und einmal 60 Dollarwahrscheinlich ausgegeben. Ist in Ordnung, kann man schon machen. Mit welcher Inventarisierungssoftwarehast du bisher gute Erfahrungen gemacht? Da kann ich euch tatsächlich was zeigen, weilich habe was Neues. Die ganze Zeit habe ich das hier verwendet, war aber nicht so wirklichglücklich für den Heimbereich. Ansonsten ist das eine wirklich super Software für Inventarisierung.Vielleicht kein Business-Management-taugliches Logo, wenn dort die Leute ein Logo mit gepierstensehen, dann denken die sich schon wieder, was ist das für Hipster-Software, aber das istwirklich gut. Für den Heimbereich, also ich weiß ja, haben die eine Demo, da kann icheuch das mal zeigen. Launch Demo. Admin Password. Ja, für den Heimbereich ist es nichts, weilfür den Heimbereich, sorry Leute, ich muss mich mal kurz planen, weil für den Heimbereichist es totaler Overkill. Was du im Heimbereich brauchst hiervon ist das einzige das hier.So sinngemäß. Du brauchst eine Liste, wo du was anlegen kannst und also für den Heimbereichbrauchst du zwei Sachen. Du brauchst einen Namen, so keine Ahnung, Raspberry Pi 4 unddu brauchst einen Standort, keine Ahnung, Fach 3.1. Mehr brauchst du für den Heimbereich.Vielleicht noch eine Seriennummer, wenn du willst. So und das ist halt eher eine Software,da kannst du den kompletten Lifecycle tracken von, du hast was gekauft, du gibst das aus,du kannst nämlich hier auch sagen, du gibst neue Tinte für den Drucker aus oder du schickstdas Gerät jetzt an irgendeinen Mitarbeiter, da kannst du ihn eintragen und wenn es verschrottetwird, trägst du es wieder aus und sowas. Also das ist daheim Mist. Viel zu Overkill. Ansonstenist es eine coole Software. Wofür man das braucht, wenn man zum Beispiel wissen will,wo habe ich mein Filament für den 3D Drucker. Na gut, das weiß ich, das liegt direkt daneben.Aber du hast ja kleine Elektronikteile zum Beispiel. Wo habe ich zum Beispiel einenKilo Ohm Widerstand. Oder wo habe ich Schrauben in dem und dem Format, was auch immer. Dannist es natürlich ganz praktisch, wenn du sowas hast. So zumindest, was ich jetzt gefunden habe,ist, dass, auch wie heißt denn das? Ja man kann das auch mit Excel und Google Tabellen machen,keine Frage. Aber ich habe jetzt was für mich im Heimbereich gefunden, was ich gerade ausprobiere,was ich ganz cool finde. Label Maker. Du meinst so einen Dymodrucker habe ich. Habe ich sogarzwei mittlerweile. Einen so einen kleinen für die Hand und einen größeren, der ganz vielEtiketten rausfeuern kann, wenn er will. Homebox oder wie hieß das? Ja, das da. 420 Stars. Dashabe ich jetzt entdeckt vor so ungefähr einem halben Jahr. Und das gefällt mir ganz gut. Dasist genau das Richtige für den Heimbereich. Also als erstes Mal hast du verschiedene,verschiedene Themes. Du kannst irgendwo Profile. Das ist das Allerwichtigste. Du kannst erst malsagen, ja, wir haben hier Dracula Knight. Dracula. Du musst jetzt mal schon mal DarkSeam. Die Software, die kein Dark Seam hat, sackt. Say goodbye to spreadsheets. Sehe ich jetzt nichtmehr. Keine Ahnung wo. Und hier haben schon Leute irgendwelchen Mist eingetragen und das hier isthalt total easy für den Heim gebraucht. Du kannst sagen Create Item. Sagen wir hier. Ich habe,ich habe in der Garage. Da musst du jetzt natürlich nicht wirklich Garage reinschreiben. Dakannst du auch eine Location anlegen. Fach 3.1. Ja, das ist ein Raspberry Pi 4. Vielleicht schreibeich noch ergänzend dazu. Das hat 8 Gigabyte, 8 Gigabyte RAM. Was auch immer. Das würde ichaber ehrlich gesagt den Titel schreiben, aber nur mal so. Ich könnte theoretisch noch irgendwas,irgendwas dazu reinschreiben hier. Was weiß ich. War mal kaputt, aber ging dann wieder. Labels,kann ich mir ein Label aussuchen. Home Assistant IoT. Create. Bäm, fertig. Easy. Du kannst mehr,du kannst mehr angeben, wenn du willst. Oh, das ist verbackt gerade. Und du kannst auch,du kannst auch ein QR-Code davon generieren. Du kannst mehr angeben, wenn du willst, aberansonsten war es das. Fertig. Du kannst dann auflisten lassen zum Beispiel alles mit IoT. Dukannst auflisten lassen alles, was in Fach 3.1 ist. Also das finde ich ist komplett ausreichend undist eine super Geschichte für daheim, weil du kannst natürlich auch danach suchen, wenn du willst.Wenn du jetzt wüsste wo. Wo ist der Suchen Knopf? Also ich weiß, dass du suchen kannst. Ich sucheda öfters drin. Items. Wo ist der Suchen Knopf? Kann es sein, dass die Suche in der Demo nichteingeschaltet ist? Ah ne bei Items. Ha, ich bin da blöd. Ich muss zu Items. Ja, so da könnte ichjetzt nach Raspberry Pi suchen. Pi 4 Gigabyte. Das finde ich für den Heimbereich sehr praktisch.Da bin ich gerade am Erproben, ob das traugt. Also ich habe das vor einem halben Jahr gefunden,habe jetzt auch schon einige Sachen eingetragen. Ich finde es praktisch. Ja und Label muss ichsagen, kann ich wirklich empfehlen zwei Sachen. Also eine. Also so eine Demo. Ich glaube so. Ne.So was hier. Die Dinger sind für den Heimbereich unglaublich praktisch. Das ist nichts, was duüber USB steuern musst. Sondern das kannst du in die Hand nehmen, eintippen und gut ist. Die gibtes in ein paar Varianten. Die gibt es auch glaube ich mit normalem Keyboard Layout. Das ist wirklichpraktisch. Ansonsten ich habe auch noch einen Label Writer. Irgendwie so ein Teil. Irgendwas inder Richtung. Und das Ding hat flutscht. Das haut die Etiketten raus. Wie sonst was. Also wenn manmal ein bisschen mehr drucken will vom Rechner aus ist das ganz gut. Wir müssen irgendwann unserWebinterface für das Ding auch nochmal weiter bauen. Ihr wisst, wir fangen, ich fange gerneSachen an. Aber die werden nie fertig. Dabei war das ein wirklich cooles Projekt der Labelchamp.Nur OGs erinnern sich noch an den Labelchamp. Ne, das stimmt nicht. Der Labelchamp ist nochgar nicht so lange her. Das ist erst irgendwie auch ein halbes Jahr. Irgendwie dem Dreh her.Hast du schon vom OWASP Juice Shop. Ist das der Demo Shop? Ist das der Demo Shop für ASP.NET Core?Ach ne, Moment. Ne, ne, ne. Ist es nicht. Ach das ist das Ding. Das kenne ich. Das habe ich,das habe ich schon was drüber gelesen. Ja, das ist, das ist ein Webshop mit Sicherheitslücken,wo man dran rumbasteln kann. Und gucken, wie weit man kommt. Das ist eine gute Idee. Aber ich binnicht so der krasse Security Hacker-Man. Das wisst ihr ja. Also wir machen zu öfters mal ein bisschenso Kleinigkeiten, wie mal eine.NET Anwendung dekompilieren oder ein Hex-Adapter auf. Also groß,oder wir haben auch schon mal Traffic von der Android-App mitgeschnitten und sowas. Aber sosuper, super-advance Sachen hier mit Assembly-Reverse-Engineern, die kompilen. Das machen wir hier nicht.Habe ich auch zu wenig Ahnung von. Was man dafür nicht braucht, gehe ich mal stark von aus. So,lass mal gucken. Gibt es irgendwas, gibt es irgendwas interessantes, was wir uns angucken können?Ich refreshe jetzt nochmal kurz YouTube, dass YouTube die Chance hat. Große Dankeschön für den Sub.Krelax, Pogger-Subscription. Danke, danke Leute. Habe ich gar nicht gesehen? Hat es keinen Soundgemacht? Oder habe ich zu viel geschwätzt und habe den Sound nicht gehört? Alles möglich. Warte noch,kauf dir jetzt kein Smartphone, warte auf die neuen. Wann kommen die neuen denn? New iPhone.Apple Leak Reveals. Alter, das neue iPhone, das 14er Pro, kostet glaube ich schon 1300 Euro.Was kosten das iPhone 15 dann? 2000 Euro? Die übertreiben es ja immer weiter. Design-Shocksieht aus wie das alte. Ja, das ist ja bei Apple normal, dass das meistens von derVorgänger-Generation kaum zu unterscheiden ist. Hast du ein iPhone oder Android? Ich habe einiPhone, weil ich das von der Firma gesponsert bekomme. Von der neuen witzigerweise, wo ichanfange auch, aber ich kaufe mir jetzt ein eigenes mit eigenem Vertrag. Da werde ich dieRufnummer, weil ich meine jetzt ist alles hin und her. Jetzt wechsle ich den Arbeitgeber,dann muss ich jetzt gucken, dass ich die Rufnummer mitnehmen kann vielleicht und dann auf den eigenenVertrag, dann habe ich das neue ja noch nicht. Nee, nee, nee. Das 49 Euro Chaos. Warum das 49Euro Ticket jetzt scheitert? Moment. Moment. Probleme. Wer hätte das gedacht? Probleme.Ihr habt das. Alter, das sind solche. Okay, bevor ich mich aufrege, ich lese das jetzt erstmal. Ich lese ich lese es jetzt erst mal kurz, bevor ich mich aufrege. Okay, vielleicht istes alles nur vielleicht. Vielleicht ist es alles nur Gebate. Hast du die Gesichtserkennung zum Entsperren aktiv?Meinst du beim iPhone? Ja. Wie heißt das? Face ID. Genau. Nicht Face League, Face ID. Okay,im Schneckenzempo zum Deutschland Ticket. Meine Fresse, kriegen die irgendwas hin? Das ist daseinzige. Das ist das einzige der letzten der letzten fünf Jahre oder so, was mich bei unswirklich mal interessiert. Wo ich denke, es könnte ja tatsächlich mal für meine Steuern,die ich in Tausenden, in Zehntausenden bezahle, mal irgendwas rauskommen, wo ich den Eindruck habe,dass es mir mal was bringt. Aber das geht natürlich nicht. Das neue Deutschland Tempo,das gilt auch mal nicht für das Deutschland Ticket, denn hier hakt es gewaltig. Es ist fraglich,ab 1. Mai haben die nicht sogar gesagt, sie wollen es ab 1. April schon machen. Die haben doch gesagt,es soll angeblich ab 1. April kommen. Die haben das doch vorverlegt und jetzt wieder nicht. Alter,die sind so unfähig. Das ist doch unglaublich, Alter. Ja, es sollte mal im Januar kommen, ja. Undletztes Jahr hat man auch erzählt, ja, jetzt kommt es auch wirklich. Eigentlich sollen längst,längst, genau. Sie werfen dem FDP-Politiker, blablabla. Zuletzt war der 1. April im Gespräch,genau. Wo ist der Sinn, ihn vom 3. April kaufen zu können? Das Ticket gilt eh nur einen Monat.Also warum sollte ich ihn kaufen am 3. April und am 1. Mai damit zu fahren? Ich kann ihn aucheinfach. Okay, wahrscheinlich, weil man IT-Kompetenz mit errechnet, dass ab 1. Mai die Server abkacken.Das ist doch irgendwie elektronisch, das muss ich doch nicht am Treppen. Jetzt ist ein Abo,das kann ich aber auch am 1., das ist doch eh elektronisch. Für mich steht fest, nicht späterals der 1. Mai. Okay, sobald so einer diese Aussage trifft, für mich steht fest, heißt dasim Endeffekt genau das Gegenteil. Moment, das wird nicht elektronisch? Wer ist denn der VDV?Verein der Ficker? Nee, vom Ficker, vor allem mit V. Wer ist das? Wer ist VDV? Der Verbanddeutscher Verkehrsunternehmen. Okay, eigentlich steht da nichts wirklich drin, oder? Es gehtnoch weiter, es geht noch weiter. So, das Deutschland-Deckel ist als monatlich kündbares Abo gedacht.Es soll bundesweit für Busse und Bahnen im Nah- und Regionalverkehr gültig sein. Ja, das wissen wir.Nur digital. Ach, wer braucht das auf Papier? Ich meine, okay, warum nicht? Aber digital würdedoch reichen. Also, seriously, wisst ihr, man müsste jetzt wirklich mal überlegen,wie hoch ist der Anteil der Leute, die täglich oder sagen wir so sehr regelmäßig beispielsweisemit dem Regionalexpress fährt, die kein Handy benutzen? Bist da so viele? 85 Prozent benutzenkein Handy, das kannst du mir nicht erzählen. Man nimmt nicht immer extra sein gutes Mobiltelefonmit. Wer nimmt bitte schön nicht sein Handy mit? Die meisten Leute gehen mit ihrem Handymittlerweile sogar kacken. Warum sollte das mal jemand nicht mit dem Zug nehmen? Handyakku leer.Also Leute, das ist alles äußerst konstruiert. Ich habe jetzt auch so eine Karte, die die einscannenmüssen. Und die nehme ich auch jeden Morgen mit. Wenn ich die Karte vergesse, dann gehtdas auch nicht. Und wenn ich mein Handy nicht mitnehme, dann geht das auch nicht. Ich meine,das ist jetzt kein großer Unterschied. Klar, der Handyakku ist leer. Wie oft wurdet ihr imZug schon mal kontrolliert, wo der Handyakku leer war? Ich noch nie. Jetzt kommen natürlichganz viele, die sagen, doch Max, ich laufe. Laufen ist mein Handyakku leer und ich werdelaufen kontrolliert. Also natürlich gibt es irgendwelche Edge Cases, wo das mal der Fall seinkönnte. Aber du fährst ja nicht schwarz, solange du ein Ticket besitzt. Weitere Vorteile desPapiertickets wäre, dass... Wie wir das Ticket finanzieren, ist mir scheißegal. Im Zweifelsfallaus meinen Steuern. So, wo ist jetzt das Problem genau gewesen? Geplantes Deutschland, hierist das digitale 49 Euro... Gut, das ist natürlich auch in Frankfurt. Ihr macht mal, macht malwas für euer Geld, Alter. Macht mal was. Macht mal eine Sache, von der ich auch washab. Nachdem ich hunderttausende Steuern bezahlt hab die letzten Jahre über. Ja, ich finanziereauch das 49 Euro Ticket und ihr auch. Das finde ich eine gute Regelung. Willst du michverarschen, Mann? Ich fahre seit Jahren mit der Bahn. Also wenn einer weiß, wie scheißedie Bahn ist, dann ja wohl ich, oder? Oder meint ihr, ich finde die geil? Also wer auchnur ansatzweise mal Videos von mir zur Bahn geguckt hat oder regelmäßig bei mir aufTwitter ist, erzähl mir nichts. Ich weiß wie das ist. Ich fahre wahrscheinlich mehrBahn als 95% der Bevölkerung in Deutschland. Also, jetzt mal im Ernst. Ich wurde noch niekontrolliert, wo mein Handy aus war. Ich habe sogar noch nie mein Ticket vergessen. Zumindestwurde ich ja nicht kontrolliert, als ich vergessen habe. Ich hab mir noch nie mein Papierticketzurück gewünscht oder sonstige Geschichten, was ihr euch da alles ausdenkt. Vor allem wäredas viel einfacher, wenn man das rein digital macht. Aber im Ernst, also Chet, was ist hierwieder los? Wahrscheinlich. Hey, dann würde ich, wenn das 49 Euro Ticket mit den Rundfunkgebührenbezahlen, dann würde ich sogar gerne Rundfunkgebühren bezahlen, die ich jetzt nicht gerne bezahle.Das Problem ist nicht, dass es Kaffee und WLAN im ICE gibt. Das Problem ist, dass derICE nicht pünktlich ist. Aber ich fahre relativ selten ICE. Also die einzigen Strecken, dieich ICE öfters mal fahre ist nach Köln, weil das dauerte einfach 50 Minuten von Frankfurt.Ansonsten eigentlich äußerst unregelmäßig ICE. Ja, ist halt sinnlos. So, wir wollen unshier irgendwas angucken auf YouTube. Also was haben wir denn hier? Zeig mal hier. Ich habeeine Stunde geschwätzt einfach, ohne irgendwas zu machen. Warum das 49 Euro Ticket jetztscheitert? Sollen wir das doch angucken oder muss ich mich dann wieder aufregen? Ich meine,wir haben, wir haben, wir haben es ja gerade, wir haben ja gerade die News dazu gelesen.Komm, wir gucken lieber was anderes. Ja, okay, weil ihr sidechat. Okay, aber zaggig, aberzaggig.Später als gedacht. Eigentlich wollte der Verkehrsminister da ja richtig Tempo machen.Wir haben Vorarbeiten geleistet und werden das Ticket jetzt so schnell wie technischmöglich einführen. Das war im November. Da hat er sich aber eine schöne Hintertür offengelassen mit technisch möglich. Und jetzt ist es immer noch nicht da und wird wohl auchnicht so schnell kommen. Erst heute hieß es im Schneckentempo zum Deutschland Ticket.Das Ticket. Ja, Moment, das hat die Tagesschau gesagt. Aber unten drunter, so wie sich derText gelesen hat, sah es immer noch danach aus, dass es April oder Mai losgeht. Da habeich mich ja mittlerweile schon, da habe ich mich ja schon drauf eingestellt. SämtlicheMedien ihre besten Bahnwortspiele bereits ausgepackt hatten. Bund und Länder brachtendas 49 Euro Ticket gestern aufs Gleis.Und zur Abfahrt freigeben muss es jetzt noch die EU.Bund und Länder streiten sich immer noch ums Geld. Dabei funktioniert günstiger Nahverkehrin manchen Orten jetzt schon super gut.Wobei ist das überhaupt in Bayern?Warum in Templin?Nee, nee, ist es nicht.Wieso Bund und Länder sich jetzt immer noch nicht einig sind und was das 49 Euro Ticketso wichtig macht. Jetzt.Zugfahren, wie ein Auto, aber es fährt nur vorwärts und rückwärts. Eigentlich solltedas Ticket längst für 49 Euro da sein und zwar deutschlandweit.Als Starttermin war ursprünglich der 1. Januar vorgesehen.Ja, das wissen wir doch alles schon.Und warum scheitert es jetzt?Ja, da hab ich mich schon drauf eingestellt.Wir wollen, dass viele Menschen mit uns das Leben in vollen Zügen genießen.Das sieht aus, das sieht aus wie ein Bahnhof bei mir in der Ecke, der ohne Scheiß mickrigsteBahnhof, den ich kenne, der mickrigste Bahnhof, den ich kenne, ist wie heißt das RückersbacherSchlucht Bahnhof. Der Name ist Programm, Leute.Google Maps, Google Maps, Adressen die in kommen.Der Bahnhof ist so mickrig.Okay, hier erkennst du ein bisschen, ja. Da ist nix. Da ist nicht mal ein Häuschen.Das hier, da ist so ein Unterstand, wo du warten kannst.Du steigst den Kahl auf die Kahlgrundbahn. Hey, das ist hier um die Ecke, ja ja.Das ist wirklich der mickrigste Bahnhof, den ich kenne.Da war früher sogar nur Bedarfshalt. Bedarfshalt, also du musstest drücken, wenn du raus wolltest.Also es ist der mickrigste Bahnhof, den ich kenne.Ich bezweifle nicht, dass es noch mickrigere gibt.Mensch, das war Zugspitze. Grund für die lange Bahnhof...Das ist cringe, das kann ich mir da angucken.Außerdem wissen wir doch, dass wir nix wissen.Wir wissen, dass wir nix wissen, nämlich, dass irgendjemand Zweifel daran hat, dass es bis1. Mai kommt.Allerdings alle sagen, es kommt bis 1. Mai.Ja, müssen wir abwarten.Das ist doch der Bahnhof hier.Nee, das ist ein anderer Bahnhof.Das ist ein anderer Bahnhof, der sieht aber genauso aus.Wie viele Tabs ich haben kann, ich hab noch mehr Tabs.Ich hab hier noch Tabs, hab ich gerade nicht, und ich hab da noch Tabs, guck mal, ich habda noch welche und ich hab hier welche, das reicht noch nicht.Und ich hab neben auf dem zweiten Bildschirm auch viele, auf meinem IOS auch viele.Aber ehrlich, serious, seriously jetzt, cack wait.Ernsthaft.Wie soll ich denn sonst mein RAM voll kriegen, wenn nicht mit vielen Tabs.Ich mein, guck mal, ich hab jetzt 13,8 Gigabyte RAM von 83 und das ist nicht mal belegt.Das meiste ist im Voraus gecashed, weil ich vielleicht irgendwas starte.Ich hab noch nicht mal eine VM laufen oder so.So, wie soll ich meine 64 Gigabyte RAM voll bekommen, wenn ich nicht wenigstens mal einpaar Tabs aufmache?So, also was, was können wir uns denn anschauen, lass mal her.Arm yourself.Computer, was?Compute plate is here.Was ist das?Ein PoE-gepowertes Armboard?Ah, gut noch, Tourlüfter.40, 40 in einem, wie viel?40, hier, das sind 40, das sind, das sind zwei Höhleneinheiten.Das sind zwei Höheneinheiten, 40, soll ich euch mal was sagen?Wahrscheinlich hat jeder ordentliche Epic- oder Intel-Server mit 2 HE mehr Rechenleistungals das.Ich bin skeptisch, ob das was bringt.Was ist denn da drin?Es wird auf jeden Fall stromsparender sein als die Intel-Kiste, aber rechenleistungstechnischfragwürdig.And they're about to go live on Kickstarter, but what are these for, besides wielding themlike Leonardo and the Teenage Mutant Ninja Turtles of course, but why build a clusterwith these blades and what good are they if you can't even buy a Compute Module 4 fromRaspberry Pi?Do any alternative Compute Modules work?I'll get to all those questions in this video.Last year I posted a video on an early alpha version of the board.I even redesigned almost everything since then and came up with this, and it looks gorgeous.The blade has an M.2 slot and is powered through this Ethernet connection up front.The dev model has extras like a TPM model.Wofür man das brauchen soll, na wofür man alle Blades braucht, dass man in möglichstkleinen Platz möglichst viel Rechenleistung reinbekommt.Das gleiche wofür man früher auch Blades Center und sowas verwendet hat, wobei ich michda halt frage, ob es Sinn macht, weil, also vielleicht aus Stromverbrauchssicht eventuell,aber eine fette 2HE Serverkiste mit irgendwie 48 CPU-Kernen haut das Leistungstechnik wahrscheinlicheinfach komplett weg?Kannst du das 49 Euro Bahnticket im Chat schicken?Ne, hab ich jetzt nicht mehr, du kannst aber einfach nach irgendwie Walulibahn oder sosuchen.Das wirst du ja schon finden.Ansonsten kann es vielleicht jemand im Chat posten, weil es hat mir auch jemand im Chatgepostet vorhin.Ich bin zu faul, jetzt den Tab wieder aufzumachen.Aber ich find's, ich find's nice, dass es schonmal Noctua-Fans sind, und ja ich nennedie Dinger Noctua, ich hab keine Ahnung wie man die offiziell ausspricht, die sind Österreicher,also wahrscheinlich spricht man die eher Noctua aus als, wie sagen die Amis dazu, Noctua,ne wie sprechen die jetzt aus?Noctua sagen die glaube ich, Noctua.Ansonsten?Was so besonders an den Fans ist, die sind teuer, bei euch betont alle das A, das O,so Noctua, ne das klingt doch bescheuert, Noctua, das stimmt die Noctua-Fans sehenkacke aus, aber die sehen eigentlich nur kacke aus, weil es so ne Creme-Farbe mit Braunmischungist.Das ist sicherlich nicht die Hipster-Farbgebung, aber die ist prägnant, das verbinden dieLeute mit Noctua.Die haben mittlerweile auch Lüfter in schwarz, und ich glaube die haben mittlerweile sogarLüfter, wo du so selbst tauschen kannst und solche Dinger, also die haben Plänten inverschiedenen Farben und die haben, die Gummistücke gibt es in verschiedenen Farben auch.Sehen Sie diese custom-red Heatsinks, die funktionieren toll, aber sie sind wahrscheinlichein Schicksal für Maschinen, ich bin mir nicht sicher, ob sie es zu massigen Produktionenmachen werden, aber sie funktionieren und sie sehen toll aus.Die Pies sind unter 42°C, egal was ich an ihnen gemacht habe.Selbst ohne Heatsinks gibt es diese Bläder, da bläst ja auch ein dicker Noctua-Lüfter durch,viel Kraft und Cooling für stabile Überklappung.Ivan hat seit Monaten 40 Bläder im Labor gearbeitet, und selbst wenn er überklappt hat, hat eskeinen Abfall.Aber die Computbläder packen in ein paar zusätzliche Features.Die TPM- und DEV-Versionen kommen beide mit einem integrierten Infineon TPM 2.0 Modul.TPM stands for Trusted Platform Module, and it can be used for secure embedded computing,especially paired with a Zimbit, which I'll get to later.This chip stores encryption keys and secure passwords, so someone couldn't steal a bladeand get your data.Ivan went a step further and placed the chip under the compute module for better security.Even if someone got physical access to the blade, they couldn't break into the TPM withoutunplugging the compute module.Secure Computing is a little more complicated than I can get into here, and the RaspberryPi isn't perfect, but the compute module does offer some improvements for Trusted Boot andTPM that I'll touch on more in a future video.Continuing the theme of the TPM-Module, I'll get to the TPM-Module in the next video.Continuing the theme of turning the Raspberry Pi Enterprise-Grade, these blades also havetwo features that fit right in with other racked equipment.This pull tab at the front is hinged, so it can press this front button, and these LEDsindicate SSD activity, power, and Pi activity, plus there's a front and top mounted Neopixelyou can program to do whatever you want.And you can also turn off all the LEDs and software if you want.Gut, dass RGB-Beleuchtung gleich integriert ist.Python Script uses the Neopixels to display CPU temperature using different colors, andit also allows the LED to be used for locating the blade.If you have a bunch of these in a rack somewhere, finding a particular blade might be tricky.So you can trigger the Neopixel, then when you find the right blade, press the buttonto dismiss it.So there's more to this board than meets the eye, but why?What would you even use these things for?Well, Ivan's original motivation was to get a bunch of ARM computers running for continuousintegration testing at JetBrains.They built tons of software for developers, and they needed to test them on Macs, PCs,and...Okay, wenn man...Okay, okay.Das ist ein Anwendungszweck, den verstehe ich sogar irgendwo.Wenn man ARM Software test, ARM Builds testen will, auf eigene Hardware, das ist einsehr spezieller Anwendungsfall.Das ist gar nicht?Okay.Das ist aber ein sehr spezieller Anwendungsfall.Yes, even Raspberry Pi's, and he's running 40 blades in 2U, that's 160 ARM cores, 320gigs of RAM, and up to 320-Serious, Leute.Seriously.Ein ordentlicher 2HE-Server lacht sich kaputt da drüber.Gerade über 320GB RAM.Da kriegste deutlich mehr, Leute.Wir hatten vor fast 10 Jahren schon Kisten mit 2TB RAM.Auch in Plateform, natürlich war das Plate ein bisschen größer.Es hat zwar viele Kerne, aber wenn du dir eine fette 48-Kern-Intel-Kiste da hinstellst,hat das wahrscheinlich deutlich, deutlich mehr Rechenleistung als das Ding.Aber gut, ich mein, das ist auch nicht der Anwendungszweck.Rein rechenleistungstechnisch ist das, ja, ich glaub nicht, dass das groß Sinn macht,aber für testen von ARM-Builds, das versteh ich, okay, das ist ein äußerst speziellerAnwendungszweck.Glaub ich nicht, dass es den so oft gibt, aber dafür versteh ich den Sinn.Ja, das ist natürlich äußerst sparsam, ne fette 2HE-Kiste, vor allem unter Last, diebraucht deutlich mehr.Hat er recht, hab ich nicht dran gedacht, dafür kann es durchaus auch Sinn machen.Ich mein, man kann auch einfach VMs nehmen, aber, ja gut.Ich mag die Ami-Aussprache von Kubernetes, Kubernetes, Kubernetes, Leute, ist es beieuch Kubernetes oder Kubernetes?Oder Kuber-Nedus?Shit, aber beim Schreiker ist es Kuber-Nedus, alles klar.Kuber-Nedus, also muss man immer sagen, Leistung oder Performance pro Watt, Leistung pro Wattkann ich schlecht sagen, das war ein bisschen missverständlich, aber Performance pro Wattist da natürlich besser als bei x86-Chart, weil da müssen wir gar nicht drüber reden.Aber da's dieIvan hat auch eine Kustom-Board mit Ximbit's HSM4-Security-Modul gemacht.Mit diesem hat er diese Demo gemacht, in der man, wenn man die Karte auslöscht,die Karte reagieren kann, indem man Dinge wie automatisch sensibler Daten zerstört.Und wenn du über die Idee des secure Computers auf der Pi drückst,dann mach' dir sicher, dass du abonniert bist.Du wirst nicht missen wollen, dass mein Video auf dieser Sache geht.Nicht sogar Redshirt Jeff kann es hacken.Der Rest der Welt steht nicht still.Pine64 haben auch ihre eigene Karte ausgelöst.Ich hatte noch nicht Zeit, es voll zu testen,aber ich habe die Karte ausgelöst.Okay, ich glaube, den Rest muss man nicht gucken.Es gibt sechs verschiedene OSs,sogar mit einer Bulk-Order.Okay, das ist tatsächlich mal eine Hardware, wo ich sagen würde,sie sieht auf dem Papier ganz cool aus.Sinnhaftigkeit in manchen Fällen da, aber so im Großen und Ganzen.Weil die wollen ja auch auf Kickstarter und so was,also die wollen ja quasi wirklich da großartig Business mit machen.Ich weiß nicht, ob es da so viele großen Absatzmöglichkeiten für gibt.Aber gut, wenn sie es richtig gemacht haben,haben sie das natürlich auch vorher schon ein bisschen erforscht.Was können wir uns, was haben wir noch 20 Minuten Zeit?Welches Smart Home System kommt in mein Haus?Fünf Ideen für meine eigene AI Anwendung, Geschichten.Die top, was für, wie komme ich denn da drauf?Ich verwende OMI Zsh.Wie spricht man sie überhaupt aus?OMI Zsh.Ich verwende das überhaupt nicht, aber das können wir tatsächlich mal gucken.Was sind dann die Top, ich meine die die die OMI Zsh plugins,die kann man zum größten Teil auch ohne OMI Zsh verwenden.Kann man sich einfach raus kopieren.Gucken wir mal.ich sag nicht zschel ich sag richtig schön auf deutsch zsh oder zschel wir skippen dasvideo ein bisschen drüber wir gucken uns das jetzt nicht an keine sorge also ok moment dafürbraucht man dafür braucht man doch gar kein plugin kann es zsh nicht mittlerweile so ich glaube ichweiß was der meint du schreibst das du schreibst das kommando und dann schreibt ihr dahinter wasdu normal also was du schreiben könntest als nächstes ohne dass du das tabmenü aufmachenmusst ich gebe zu das ist was was ich nicht mag ich habe ja ein bisschen fisch und so nebenbeiimmer ausprobiert das ist ein feature das gefällt mir nicht vielleicht muss man sich noch drangewöhnen ich weiß fisch macht das macht das automatisch und das hat mir nicht gefallen alsoich ich drück ich drück tapp tapp und habe da eine liste zum zum auswählen vielleicht sollteich vielleicht sollte ich noch mal noch mal eine chance geben können wir beim vm konfigurierenmal ausprobieren based on things that you've typed in the past let me open up my terminaldas ist was ich denke ok es ist das was ich denke dass der quasi also ihr seht jetzt hier kommt derschreibt der schreibt der fängt hier an was zu schreiben und das was hier dahinter kommt schlägtihm seine shell vor als vielleicht willst du meinst du ja das jetzt kann er wahrscheinlichdoppelt tapp oder was auch immer drücken oder trüppelt tapp oder keine ahnung immer dascompleted oder es fügt automatisch ein besonders cool ist natürlich wenn sich das merkt und ichglaube das macht was deine häufig aufgerufenen sachen sind dann bist du deutlich schneller beimbeim tippen ich bin jemand ich tippe nach möglichkeit eigentlich gar nichts großartig ein ich meinmein mein er also wenn ich weiß wenn ich also wenn ich weiß dass ich das kommando schon benutzthabe ich drücke eigentlich immer steuerung er das zeigt nur die history an kann auch sein es istaber doof wenn sie ist die anzeigt weil dann lernt das nicht was die meist benutzten kommandos sindnur weil es das letzte war also es wäre schon cool wenn das ich glaube das macht es auchso und das erste was ich mache ist steuerung er steuerung er also ich hätte jetzt nichtangefangen pyson zu schreiben ich hätte geschrieben steuerung steuerung er p y und dann hätte ichdie letzten drei hervor vollkommen lese durch durch geht durch durch getappt und dann passt dasin der word python ist gonna suggest the auto completion of main.py which i've used a lot soif i want that i can hit the right ok wir wissen was es ist also müssen wir nicht mehr weiterkommen so was haben wir als nächstes how to add plug-in su sudo suggestions the next plugin onthe list is sudo now this one is really really da bin ich jetzt mal gespannt was wir für sudofür den plugin brauchen so if i'm typing something like let's say i want to reboot my machine and igo reboot ok was man jetzt machen könnte ist sudo schreiben und ausrufezeichen ausrufezeichendahinter machen das kann man machen ehrlich gesagt ich mache das so gut wie nie weil ichirgendwie immer nicht dran denke aber eine schnelle variante wäre sudo ausrufezeichen ausrufezeichenausrufezeichen ausrufezeichen ist quasi den letzten befehl noch mal einsetzen das mal guckenund jetzt so i need to write sudo reboot oder sudo ausrufezeichen ausrufezeichen oder was ichauch mal eine weile hatte ich hatte sudo auf underscore alias das ging auch schneller ob dassollte ich wieder machen das war das war sehr praktisch lässt sich einfach schneller tippenals sudo ich glaube nee das mache ich nicht mehr weil es weil ich mir überlegt habe es wäreeigentlich ganz sinnvoll wenn man sudo schreiben muss dass man sich auf jeden fall immer im klarendrüber ist dass man jetzt gut rechte sich holt deswegen habe ich glaube ich wieder gelöschtoder ausrufezeichen ausrufezeichen oder something like that it's just kind ofokay das finde ich cool da hätte ich nicht mit gerechnet das ist eine gutesache das ist cool das gefällt mir da hätte ich es nicht mit gerechnet dass da was kommt wasmir gefällt das finde ich gut das hat das hat mehrere vorteile erstens du kannst dir sudoschreiben und ausrufezeichen ausrufezeichen und irgendwelche anderen sachen sparen und escapeescape seriously das machst du nicht einfach aus versehen du kommst nicht einfach aus versehenauf escape escape und drückst dann noch enter das finde ich nice das glaubt dass das muss ichmir aufschreiben das werde ich mal ausprobierensiehst du hat es schon gelohnt sich das anzugucken das ist das ist selbst selbst wenn alle anderenallen anderen schrott ist du spammst escape häufiger ja wenn du aus dem wim raus willstoder so aber in der schelm am eintippen eigentlich nicht in der schelm ich nie escapealso das finde ich gut man kann es ja wahrscheinlich sogar umlegen das muss ich mal ausprobieren dasist das klingt nice ok websearch ist useless das mache ich nicht das klingt cool dass man ausder schelm suchen kann aber nachdem man im browser also man muss ja in den browser um sich dieergebnisse anzugucken also kann man die suche auch im browser machen ich hatte auch mal ingoogle search alias in der schelm ist komplett sinnlos wie gesagt ob du jetzt auf deine schelmgehst und eintippst das und das suchen oder markierst und dann search drückst und danngeht ein browser tab auf du musst zum browser switchen oder ob du zuerst zum browser switchtund dann sagst ich google jetzt danach du spannst immer control c ich spamme immer control c aberkein control l ja control c mache ich auch laufend says let's say i'm you know i'm sitting here andi'm like ls and i can't remember how to show well there's my auto suggestions of course butlet's say i can't remember how to show hidden files and i'm like i don't know what that is let'sgoogle it so i can actually google this from the command line so i can say google ls hidden fileja das bringt nichts ihr werdet jetzt auch gleich sehen dass es nichts bringt guck mal der mussschreiben google und dann muss er in seinen browser und es kann er open a web page sissemit just what i typed sisse das heißt der schreibt was auf der schelm danach schreibt er den suchprofil das heißt es ist sogar schneller ich wechsle einfach direkt in meinen browser undgibt dann hier oben irgendwas ein zum googeln google keckel emote so also das finde ich unsinnigplug in number four is copied er in this simply copies the path of your current folder to thesystem clipboard okwhy not abernow the use case for this is let's say ich wollte gerade sagen du kannst du was geht ichwollte gerade sagen du kannst doch einfach pwd nehmen aber aber wisst ihr was cool wäre wasmir gerade einfällt wisst ihr was cool wäre wenn es ein copy file name oder sowas gebe also sprichalso was man ja manchmal machen muss ist man ist hier in einem verzeichnis ich mache jetzt maldas windows terminal auf so man ist hier in einem verzeichnis macht ls und jetzt würde man gernesich den den absoluten fad zusammen bauen zu sagen wir dieser datei so und dann ist man hieram sinnlos sinnlos rumklicken das ist was cool wäre wenn man sowas machen könnte hier weißich copy file und dann macht er das direkt ja du kannst das rausholen ja ja aber dannmüsste es immer noch nach x-clip oder so halten das das war vielleicht ganz ganz niceok das können wir skippen das ist nix dolles was haben wir alles jetzt kommt hey jetzt kommtvielleicht sowas copy file is very similar it's called copy copy the contents ja da kannst duauch das feil ketten und nach x-clip look at plugin number copy buffer kommt dann soour sixth plugin ist wie viel copy copy dann über seine shell copy buffer this plugin bindsthe control keyboard shortcut and copies the text that's currently typed in the command line sofiles copies the text that is currently ok das stelle ich mir wiederum ganz praktisch vorhier and i wanted to cd into a b das stelle ich mir tatsächlich ganz praktisch vor du tippstdu tippst irgendwas und dann und dann kopierst du das ist normalerweise müsstest du es jetztmarkieren den nächsten plug ins den kopp ist in pace plug ins ja let's say i was about to dothis and i was like oh man actually i gotta go back and fix something and i don't have toretype this in i can just hit control o ist ihr wisst ihr was ich dafür mache ich macheeinen kommentar davor dann ist es in der history und geht dann in der history einfach drei stücknach oben wenn ich fertig bin und hab's wieder da also man kann einfach den kommentar davor machendann wird es nicht ausgeführt aber man kann mit feil nach oben ist und wieder sich zurückholendas ist sogar besser als es zu copy pasten weil meistens braucht man sehr in der shell wiederwenn man es jetzt natürlich irgendwo anders braucht dann ok du fügst immer ein ein quadans ende des commands und drückst es k was macht das quad am ende das kenne ich das kenneich so in der kombination nicht was war was bringt das and let's say i cleared it i didwhat i need to do next directory history seven is der history das brauche ich nicht so thisplug-in adds keyboard keyboard shortcut directory history ok da gibt es ja komplett fertige toolsfür ich muss ehrlich sagen ich benutze einfach meine normale history in meinen in meiner normalenhistory steht da drin steht da drinnen cd bla blub ok vielleicht relative fahnen diedann nicht funktionieren wo ich da bin ok vielleicht vielleicht ist es sinnvoll aberalso nix nix was ich jetzt irgendwie keyboard shortcuts dafür mir merken möchteach so nett ja das ist clever na besch sagt dann so nach dem motto ich mache erst was wenn diequotes geschlossen sind und dann trückst du steuerung c und dann ist es in der history wenndu nach oben gehst musst du nicht das erste zeichen löschen sondern sogar nur das letztezeichen löschen das ist cool das ist eine gute taktik da hätte ich vielleicht gar nicht draufgekommen zfs nicht zfs alla zf f zf ist sehr cool dass sehr cool dass tool für so suchmenusja passiv fahnen da das kommentiert die aktuelle zeile macht dann genau das das ist das was ichauch mache ich mache ich mache ausrufe ich mache den kommentar sind also raute davor unddann habe ich in der history genauso mache ich das auch immer ok das brauche ich okreload von der konfig datei da brauchst du doch kein also mal ernsthaft ein reload von der konfigdatei dafür würde ich doch kein plugin installieren wenn ich das brauche mache ich ein alias ok ichhabe auch alias dafür editieren ich habe ein alias für meine shell konfig für die wim konfigfür die e3 konfig ist dann sowieso wie ev öffnet mir die wim konfig ei öffnet meineding so aber den reload entweder mache ich den von hand relativ schnell ich meine musst janix anderes machen als punkt leerzeichen oder source leerzeichen basher z z z z z s h rcalternativ kann sie dann kannst du dir einfach ein alias machen reload oder so was und das istwieder da. Eats. Das Plugin hat wahrscheinlich auch noch ein Alias, ja. History, okay. Ja und dannkannst du es entweder nach FZF, eine FZF-Pipen oder nach GREP. GREP ist auch deutlich flexiblerals irgendwas anderes. Da kannst du suchen, wie du lustig bist. Das ist ja nix. Das ist ja,also 2600. Ich glaub, boah, ich muss jetzt mal gucken, was ich auf der Arbeit habe,aber wahrscheinlich über 100.000 Zeilen oder so über die letzten Jahre. Okay, du kannst, okay,du hast im Prinzip, das Plugin legt dir quasi einen Alias an für History nach GREP. Ja, kannman machen. Alternativ, ich drücke STRG-R und gebe HIST ein und dann hab ich schon was mit GREP.Also, na gut, das ist, es ist useful, ja, aber da würde ich kein, was haben wir noch? JSON-Tools.Okay, das könnte jetzt was interessanter sein. Das braucht man nicht. Man pipet sein JSON einfachnach JQ und ist fertig. Das war's. Man braucht dafür kein Plugin. Next. Bonus für Back. Okay,ich muss sagen, das mit sudo fand ich cool. Der Rest ist relativ, ich meine, das sind ja seineLieblingsplugins. Da kann ich jetzt nichts zu sagen, aber der Rest erscheint mir relativ unsinnig.Fünf Stunden Linux Server. Leute, das kommt jetzt nicht an. Ich will bloß mal gucken,was die da machen. Alter, wie alt ist denn das schon? Ah nee, das ist ein Fedora. Kein Wunder,dass das so alt aussieht. Das ist ein Ubuntu. Okay. Fünfeinhalb Stunden Linux Server Kurs. Ichmeine, wenn der was taugt, kostenlos, ist das Hut ab erst mal fürs Aufnehmen. Zeig mal JQ.Du hast den JSON, das pipest du nach JQ und dann kommt es schön formatiert raus.Du benutzt PowerShell unter Archlinux. Ja, kann man machen. Ich meine, das Ding ist mittlerweilecross-Plattform verfügbar und PowerShell ist eine wirklich coole Automatisierungs-Shell. Muss abersagen, als interaktive Shell zum täglich benutzen und drinnen tippen, gefällt mir PowerShell nicht.Da finde ich es zu umständlich. Und da finde ich den klassischen Shell-Ansatz mit Pipes zwischenProgrammen, wo einfach der Text durchgeht, sogar angenehmer. Für irgendwelche Automatisierungenoder so ist PowerShell eine super Geschichte. Wobei ich viel zu wenig Automatisierung in demSinn habe, auf meiner Linux-Kiste, dass ich PowerShell lohnen würde. Ich habe ein paarBash-Skipps, die ein paar Sachen machen, so Hintergrundsätzen oder so, aber das war es auch.Also PowerShell bin ich kein großer Fan von für täglich benutzen, aber wenn es für dich gutfunktioniert. Ich sage ja, es macht überhaupt keinen Sinn, irgendwelche Tools oder Herstellerunnötig zu fanboyen. Man sollte das nehmen, was am besten funktioniert. Und das kann durchausauch was von Microsoft sein. Oh Leute, es ist 22 Uhr, fuck. Ich habe gehabt, wir haben noch Zeit.So, jetzt sehen wir mal gucken.3D Drucker schreibt meine Hausaufgaben. Microservices sind überbewertet.Das ist ungefähr, wenn ich so sage, PC-Gehäuse sind überbewertet. Eiswürfel sind überbewertet.Es kommt auf den Kontext an. Also ja, man muss nicht alles als Microservice machen. Das istsogar relativ blöd, alles auf Teufel komm raus, als Microservice zu machen. Ich meine,warum sollte ich zum Beispiel das Programm, was mir meine Emotes anzeigt, als Microservice machen?Das ergibt keinen Sinn. Das ist eine Desktop-Anwendung mit ein bisschen HTTP-Requests,dass ich es auch vom zweiten Rechner aus bedienen kann. Manchmal macht es Sinn undmanchmal nicht. Ganz einfach. Man darf auch nicht vergessen, wenn man alles als Microservice machtund jeden Furz auslagert, da blickt ja kein Sau mehr durch. Das macht es ja auch unnötigvon der Architektur her oftmals kompliziert. Also wenn es eine simple Anwendung ist,sodass das gar nicht erforderlich ist. Eine auch komplexere Anwendung muss nicht zwangsläufig sein.Das macht es auch teilweise deutlich schwieriger zu finden jetzt, wo irgendwelche Abhängigkeitenund Bugs sind, weil das alles das triggert das, das triggert das und das triggert dann das und an einem Service davorist dann vielleicht ein Zeichen reingekommen, was da irgendwo ein Fehler auslässt. Ja,das macht es unnötig kompliziert, aber es kommt halt drauf an, was man machen will.Das kommt ganz drauf an, was man hat, sage ich ja. Es gibt nicht die Anwendungsarchitektur,die einfach für alles immer gut ist. Man muss gucken, was man machen muss.Dashboard für die Heizung. Tja, ich habe keinen Dashboard mehr für meine Heizung.Ich habe es jetzt nur noch im Home Assistant drin. Ich habe keine Heizungshistory mehr im Grafana.Aber neun ist 22, ich muss pennen. Woop. Sleep muss ich jetzt machen.Ja, warum habe ich das eigentlich noch nicht, als die Mode drinne. Was, was genau habe ichhier offen? Was passiert, wenn ich zwei Bilder auswähle? He? Or item selected. Leute, ichverstehe den Sinn von Windows Anwendungen wieder nicht. Ok, ich könnte jetzt die selectenund dann könnte ich mir die in groß angucken oder wie. Guck mal, das ist fast schon Animation.Du verstehst den Sinn nicht hinter zwei Kontext Menüs. Du meinst, dass du das hier hast. Tja,das liegt daran, weil das hier ein neues Menü ist und Microsoft dachte, oh, das neue ist vielcooler. Allerdings ist das wahrscheinlich irgendeine UWP-App oder so und die ganzen altenProgramme, die sich hier drin integrieren, die sind natürlich nicht hierfür angepasst. Vielleichtgeht das gar nicht richtig. Deswegen mussten sie das alte noch mitliefern. Was das ist? MicrosoftSchrott. Dass es das überhaupt gibt. Ich verstehe nicht, warum man nicht einfach das alte Menü einbisschen schöner designt hat, weil er hätte das ja durchaus ein bisschen 2023 mehr machen können.Ja, größere Schrift und vielleicht hier ein bisschen, man die Icons skalieren dannvielleicht nicht richtig. Das hätte man alles machen können, aber so. Das ist wirklich wiederdie billigste Lösung, die eingefallen ist. Leute, ich gehe jetzt aber ins Bett. Wir sehenuns morgen. Bis dann. Macht's gut. See you.", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Das war's für heute."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Bis zum nächsten Mal."}, {"id": 3, "start": 64.0, "end": 90.0, "text": "Das war's für heute."}, {"id": 4, "start": 120.0, "end": 138.04, "text": "Wir basteln heute nicht mit unserer Linux Kiste weiter, sondern wir schwätzen ein bisschen,"}, {"id": 5, "start": 138.04, "end": 140.52, "text": "gucken ein paar Videos und reden über Zeug."}, {"id": 6, "start": 140.52, "end": 144.28, "text": "Ist ja auch nicht mehr so viel Zeit, ich bin ja bloß so ungefähr zwei Stunden da."}, {"id": 7, "start": 144.28, "end": 154.88, "text": "Chat soll ich euch mal was erzählen, also bei mir auf der Arbeit geht es gerade irgendwie"}, {"id": 8, "start": 154.88, "end": 155.88, "text": "echt rund."}, {"id": 9, "start": 155.88, "end": 159.12, "text": "Also nicht nur, dass ich in drei Monaten, also nicht stimmt, dass ich da gar nicht"}, {"id": 10, "start": 159.12, "end": 169.16, "text": "mehr drei Monate, in zwei Monaten weg bin, also 31.3., also in zwei Monaten bin ich quasi"}, {"id": 11, "start": 169.16, "end": 170.16, "text": "weg."}, {"id": 12, "start": 170.16, "end": 174.6, "text": "Erster Monat ist ja schon mehr oder weniger wieder rum, fast schon rum."}, {"id": 13, "start": 174.6, "end": 179.76, "text": "Also nicht nur, dass ich weg bin, ein Kollege von mir weg ist, noch ein Kollege von mir"}, {"id": 14, "start": 179.76, "end": 183.8, "text": "weg ist und insgesamt Leute, ich habe eine Zahl gehört, haltet euch mal fest, haltet"}, {"id": 15, "start": 183.8, "end": 184.8, "text": "euch mal fest."}, {"id": 16, "start": 184.8, "end": 194.28, "text": "Ich habe keine Ahnung, ob das offiziell ist, ich habe das um drei Ecken, die Chance, dass"}, {"id": 17, "start": 194.28, "end": 197.24, "text": "es sich ausgedacht ist, ist genauso groß wie das, das stimmt."}, {"id": 18, "start": 197.24, "end": 203.84, "text": "Ich habe gehört, dass rund 140 Leute Ende letzten Jahres aus der IT, beziehungsweise"}, {"id": 19, "start": 203.84, "end": 209.0, "text": "IT ist ja bei uns, also alles, was zu dieser extra IT Firma gehört, das ist ja schon ein"}, {"id": 20, "start": 209.0, "end": 212.6, "text": "bisschen größer, 140 Leute sind abgehauen."}, {"id": 21, "start": 212.6, "end": 218.16, "text": "Also ich war nur einer von vielen."}, {"id": 22, "start": 218.16, "end": 228.68, "text": "Da muss ich euch mal vorstellen, um die 140 Leute, das ist wirklich eine Menge."}, {"id": 23, "start": 228.68, "end": 234.24, "text": "So zumindest nicht nur das, heute habe ich von meinem Teamleiter erfahren, dass er, wie"}, {"id": 24, "start": 234.24, "end": 238.52, "text": "groß ist die Belegschaft, ja ich kann es euch nicht genau sagen, weil die haben das"}, {"id": 25, "start": 238.52, "end": 244.4, "text": "ja aus steuerlichen Gründen so gemacht, dass es für IT so eine extra Firma gibt und dann"}, {"id": 26, "start": 244.4, "end": 250.04, "text": "nochmal eine extra Firma, dann irgendwie so eine extra für irgendwelche Publikationen"}, {"id": 27, "start": 250.04, "end": 254.76, "text": "extra, da blickst du nicht durch, ich weiß nicht, ob die 140 insgesamt waren oder IT,"}, {"id": 28, "start": 254.76, "end": 261.48, "text": "ich vermute IT, also wir sind, ehrlich, ich habe keine Ahnung, wie viele, ne, wobei nur"}, {"id": 29, "start": 261.48, "end": 268.12, "text": "IT kann ich sein, wenn ich mir recht überlege, das muss insgesamt sein, insgesamt, allerdings"}, {"id": 30, "start": 268.12, "end": 275.4, "text": "ohne so das Kerngeschäft, also ohne jetzt irgendwie so Außendienstmitarbeiter und so was, also"}, {"id": 31, "start": 275.4, "end": 284.16, "text": "quasi nur Leute, die da auch in Frankfurt in diesem Hauptgebäude sind, 140 Leute oder"}, {"id": 32, "start": 284.16, "end": 290.48, "text": "um die 140 Leute, das muss insgesamt gewesen sein von, ich weiß es gar nicht so, ich habe"}, {"id": 33, "start": 290.48, "end": 293.8, "text": "keine Ahnung, Leute, ich kann es euch wirklich nicht sagen, ich habe jetzt, ich habe wirklich"}, {"id": 34, "start": 293.8, "end": 300.04, "text": "keine Ahnung, wie viel und wie das wo wieder zugehört, aber 140 klingt erstmal zumindest"}, {"id": 35, "start": 300.04, "end": 304.52, "text": "nicht wenig, es muss deutlich mehr gewesen sein, als die Jahre zuvor, was ich gehört"}, {"id": 36, "start": 304.52, "end": 310.8, "text": "habe und an dem Tag, wo ich die Kündigung abgegeben habe, oben war, also wir haben die"}, {"id": 37, "start": 310.8, "end": 315.36, "text": "ja zu zweit oben abgegeben, wir waren auch nicht die einzigen, das hast du der Personalabteilung"}, {"id": 38, "start": 315.36, "end": 320.92, "text": "angemerkt und nächste Woche habe ich meinen, zahltet euch, zahltet euch mal fest, wie heißt"}, {"id": 39, "start": 320.92, "end": 332.16, "text": "das, Austrittsinterview glaube ich, mal gucken, irgendwann im Februar ist das, mein Austrittsinterview"}, {"id": 40, "start": 332.16, "end": 338.24, "text": "habe ich, habe ich nächste Woche, nee, nee, nee, übernächste, übernächste Woche, da"}, {"id": 41, "start": 338.24, "end": 347.0, "text": "wird ausgetreten, so hört sich fast, als muss ich mal in die Ecke pingeln, ja das klingt"}, {"id": 42, "start": 347.0, "end": 352.08, "text": "so, als muss man mal kurz irgendwo das Bein heben an irgendeine Ecke, viermal nur loben,"}, {"id": 43, "start": 352.08, "end": 356.32, "text": "nee, ich sag denen was Sache ist, ich sag denen, dass mir Home Office auf den Sack gegangen"}, {"id": 44, "start": 356.32, "end": 361.44, "text": "ist, dass so oft angekündigt wurde, die und die Dinger wollen sie ändern und im Endeffekt"}, {"id": 45, "start": 361.44, "end": 376.88, "text": "haben sie es ja nie gemacht, gibt ja durchaus einige Punkte, die mir"}, {"id": 46, "start": 376.88, "end": 384.84, "text": "auf den Keks gehen, ich werde es denen sagen, heute hat man auch zum ersten Mal so richtig"}, {"id": 47, "start": 384.84, "end": 390.32, "text": "realisiert glaube ich, dass ich bald weg bin, weil ihnen aufgefallen ist ja, das macht ja"}, {"id": 48, "start": 390.32, "end": 395.04, "text": "dann gar keiner mehr, da dachte ich mir so, ach ist das wirklich so, hätte mir ja gar"}, {"id": 49, "start": 395.04, "end": 398.48, "text": "nicht dran denken können, schon vor irgendwie einem halben Jahr oder so, als ich gesagt"}, {"id": 50, "start": 398.48, "end": 405.16, "text": "habe, bald bin ich höchstwahrscheinlich weg, fällt jetzt erst auf, ach wie, wirklich,"}, {"id": 51, "start": 405.16, "end": 423.12, "text": "ist das echt so, naja, was noch dabei kommt, heute habe ich um zwei Ecken gehört, dass"}, {"id": 52, "start": 423.12, "end": 432.36, "text": "wohl mein Chef, also mein jetziger Chef, wohl auch aufhört, also sprich, mein jetziger"}, {"id": 53, "start": 432.36, "end": 437.4, "text": "Chef hört auf und mein Chef da vorne hat ja auch aufgehört, also Führungskräfte"}, {"id": 54, "start": 437.4, "end": 444.72, "text": "bei dem Laden, die machen es nicht lange, ja, der oben drüber hört auch auf, die haben"}, {"id": 55, "start": 444.72, "end": 453.68, "text": "alle keinen Bock mehr auf den Kram, das ist echt der Wahnsinn, die werfen alles Handtuch,"}, {"id": 56, "start": 453.68, "end": 458.12, "text": "ich hab jetzt noch, ich weiß jetzt noch von einem, der Mitte des Jahres abhaut, bei dem"}, {"id": 57, "start": 458.12, "end": 462.28, "text": "hat das mit Ende, bis Ende letzten Jahreskündig nicht mehr hingehaut, der haut Mitte nix"}, {"id": 58, "start": 462.28, "end": 467.8, "text": "letzten Jahres ab, also ganz im Ernst, das sieht echt, da siehts wirklich gerade sehr"}, {"id": 59, "start": 467.8, "end": 473.6, "text": "düster aus, aber ich sag euch, die überleben das ohne Probleme, ist kein Ding, die werden"}, {"id": 60, "start": 473.6, "end": 478.76, "text": "entweder es einsehen und ein paar Sachen verbessern, die Leute komplett mit Geld zuscheißen,"}, {"id": 61, "start": 478.76, "end": 483.84, "text": "doof, dass ich dann schon weg bin, aber gut, oder es geht so den Bach runter, dass man"}, {"id": 62, "start": 483.84, "end": 488.88, "text": "sich nur noch zu helfen weiß, indem man irgendwelche super teuren Dienstleister kauft, die mega"}, {"id": 63, "start": 488.88, "end": 495.12, "text": "viel Geld kosten und das für einen machen, was auch immer, ist nicht mein Problem, ich"}, {"id": 64, "start": 495.12, "end": 499.32, "text": "werd das natürlich weiter ein bisschen verfolgen, so interessiert mich ja schon, wie es weitergeht,"}, {"id": 65, "start": 499.32, "end": 504.12, "text": "ich war jetzt ja über 10 Jahre bald dort, also nicht so, dass ich das morgen aufhör"}, {"id": 66, "start": 504.12, "end": 506.96, "text": "zu interessieren und ich kenn ja auch noch ein paar Leute, ich werd mir das sicher ab"}, {"id": 67, "start": 506.96, "end": 513.72, "text": "und zu mal erzählen lassen, so ohne Details zu verraten, was denn da jetzt abgeht, das"}, {"id": 68, "start": 513.72, "end": 518.12, "text": "Schöne ist, ich bin ja nur 800 Meter Luftlinie weg, also ich geh sicherlich mit den ein oder"}, {"id": 69, "start": 518.12, "end": 529.04, "text": "andere nochmal was futtern, so mein 1-14-tägigen Anwesenheitstag vor Ort, das ist so geil,"}, {"id": 70, "start": 529.04, "end": 532.52, "text": "heute hab ich's wieder mitgekriegt, was die da für ein Geschiss machen, Alter, das Wahnsinn"}, {"id": 71, "start": 532.52, "end": 538.2, "text": "und bei meinem neuen Job ist einfach 1 Tag die Woche Anwesenheit oder eventuell 14 Tage,"}, {"id": 72, "start": 538.2, "end": 543.72, "text": "aber die wollen's, die wollen's nicht besser dort, wo ich aktuell bin, die wollen, dass"}, {"id": 73, "start": 543.72, "end": 552.76, "text": "alle Leute wegrennen, die wollen, wie gesagt, ich kann's mir anders erklären, naja gut,"}, {"id": 74, "start": 552.76, "end": 564.56, "text": "so viel dazu, mich juckt's, was ist das am Rücken, ich komm da dran, hast du das Video"}, {"id": 75, "start": 564.56, "end": 572.2, "text": "gesehen, Pax, ich sag mal lieber Toni, ich glaub, das ist die, das was da von der Name"}, {"id": 76, "start": 572.2, "end": 580.16, "text": "ist, hast das Video geguckt und wieder streamen, ja, aber heute kein Linux-Bastelzeug, heute"}, {"id": 77, "start": 580.16, "end": 585.0, "text": "gucken wir ein paar Videos und schwätzen ein bisschen, wie waren eigentlich eure Abschlussprüfungen,"}, {"id": 78, "start": 585.0, "end": 590.88, "text": "ich hab gehört, es gibt ein paar Leute, die Abschlussprüfungen hatten, ne du warst das"}, {"id": 79, "start": 590.88, "end": 596.12, "text": "doch hier, oder, warst du das nicht, das kann ich nicht aussprechen, aber der Name, den"}, {"id": 80, "start": 596.12, "end": 604.28, "text": "hab ich schon mal gesehen hier und ich glaube, da ging's um Abschlussprüfung, ich war in"}, {"id": 81, "start": 604.28, "end": 623.36, "text": "die Abschlussprüfung, Horgurs, 92 Punkte insgesamt und hat sich, also ich hatte 95%"}, {"id": 82, "start": 623.36, "end": 629.64, "text": "auf die mündliche Abschlusspräsentation und die schriftliche war nicht ganz so gut,"}, {"id": 83, "start": 629.64, "end": 635.12, "text": "aber das ist random, ganz ehrlich, das Ergebnis der Abschlussprüfung bei der IHK hat überhaupt"}, {"id": 84, "start": 635.12, "end": 640.48, "text": "gar nichts zu sagen, also wenn die Firmen sich einreden nach dem Motto, ja, wir nehmen"}, {"id": 85, "start": 640.48, "end": 644.6, "text": "wirklich dann nur die Leute, die einen Abschluss über sowieso haben, total dumm, weil die"}, {"id": 86, "start": 644.6, "end": 651.68, "text": "besten Leute verpassen sie dann eventuell, also das sagt gar nichts aus, das ist so random,"}, {"id": 87, "start": 651.68, "end": 657.08, "text": "ich würd sogar gar nicht sagen, dass tendenziell im Durchschnitt bessere Leute, bessere Abschlussergebnisse"}, {"id": 88, "start": 657.08, "end": 661.08, "text": "haben, das ist gar nichts, das hat wirklich gar nichts aus zu sagen, das ist komplett,"}, {"id": 89, "start": 661.08, "end": 665.48, "text": "es ist nicht so wie Spielstunden, wo man sagen kann, ja im Durchschnitt spielt einer mit"}, {"id": 90, "start": 665.48, "end": 670.36, "text": "mehr Spielstunden besser als einer mit weniger Spielstunden, aber die IHK Abschlussprüfung"}, {"id": 91, "start": 670.36, "end": 676.12, "text": "ist einfach komplett random, also ich hatte einen in der Berufsschule, den haben sie"}, {"id": 92, "start": 676.12, "end": 680.72, "text": "richtig gefickt bei seinem Arbeitgeber, der wollte ja da unbedingt da bleiben, das war"}, {"id": 93, "start": 680.72, "end": 684.76, "text": "ein großer, der Arbeitgeber war ein großer, Moment ich muss mal kurz gucken, was sind"}, {"id": 94, "start": 684.76, "end": 700.6, "text": "die Wirtschaftsberater oder sowas, was ist PwC, Wirtschaftsprüfungsgesellschaft, ja,"}, {"id": 95, "start": 700.6, "end": 710.92, "text": "also bei PwC war der, kann ich mich noch dran erinnern und die haben ihm gesagt, der darf"}, {"id": 96, "start": 710.92, "end": 715.84, "text": "nur da bleiben, wenn er mindestens zwei oder so insgesamt eine Abschlussprüfung hatte"}, {"id": 97, "start": 715.84, "end": 720.48, "text": "und der hat halt so richtig, also die Abschlussprüfung hat er super geschrieben, aber der Typ war"}, {"id": 98, "start": 720.48, "end": 725.36, "text": "wirklich schlau, also ich würd sagen der hatte zum damaligen Zeitpunkt deutlich mehr Plan"}, {"id": 99, "start": 725.36, "end": 732.56, "text": "als ich und ich würd sagen, ich hab mich auch schon für den Azubi-Style ganz gut ausgekannt,"}, {"id": 100, "start": 732.56, "end": 740.84, "text": "der hatte wirklich Plan, der hat auch vorher, der hat auch vorher, ich glaube Informatik"}, {"id": 101, "start": 740.84, "end": 745.32, "text": "fertig studiert hat er bestimmt nicht, also der war wirklich, der war wirklich klar und"}, {"id": 102, "start": 745.32, "end": 750.88, "text": "den haben sie richtig hart ran genommen bei der Abschlussprüfung, weil er wohl irgendwelche"}, {"id": 103, "start": 750.88, "end": 755.36, "text": "Stichwörter gesagt hat, die einem in dem Prüfungsausschuss nicht gefallen haben, also"}, {"id": 104, "start": 755.36, "end": 760.56, "text": "wie gesagt, ich hab Präsentationen von dem gesehen, die waren super, der hatte Plan,"}, {"id": 105, "start": 760.56, "end": 765.08, "text": "also ich kanns mir bei dem nicht anders erklären, wie dass er einfach Pech hatte und einen Prüfer"}, {"id": 106, "start": 765.08, "end": 768.84, "text": "erwischt hat, der an dem Tag schlecht drauf war und die haben dann gesagt, der hatte dann"}, {"id": 107, "start": 768.84, "end": 773.52, "text": "glaube ich irgendwie eine 3,5 oder 3,3, keine wirklich super Abschlussnote, dann hab ich"}, {"id": 108, "start": 773.52, "end": 782.8, "text": "gesagt, nö, dann nehmen wir dich nicht mehr, das hat nix mit Anspruch zu tun, die IHK-Prüfung"}, {"id": 109, "start": 782.8, "end": 789.92, "text": "ist komplett random, wenn ihr das macht, habt ihr im Zweifelsfall die besten Leute, die"}, {"id": 110, "start": 789.92, "end": 797.0, "text": "euch abhauen, du kannst auf die IHK-Abschlussprüfung nichts geben, das einzige was du vielleicht"}, {"id": 111, "start": 797.0, "end": 803.92, "text": "bei der IHK-Abschlussprüfung sagen kannst, ist bestanden oder nicht bestanden, der Rest"}, {"id": 112, "start": 803.92, "end": 812.16, "text": "ist komplett random, das ist doch nicht mal ein Indikator, das ist einfach komplett random,"}, {"id": 113, "start": 812.16, "end": 826.96, "text": "das würde ich null drauf geben, welche Prüfung ist nicht komplett random, naja, die meisten"}, {"id": 114, "start": 826.96, "end": 833.16, "text": "sind nicht komplett random, die meisten sind irgendwo relativ nachvollziehbar, was den"}, {"id": 115, "start": 833.16, "end": 840.52, "text": "Inhalt angeht und wenn man sich auf den Inhalt vorbereitet hat, dann ist die, es geht hauptsächlich"}, {"id": 116, "start": 840.52, "end": 844.68, "text": "um die Präsentation, die Prüfung, die Prüfung ist auch für'n Arsch, die Prüfung ist auch"}, {"id": 117, "start": 844.68, "end": 848.8, "text": "für'n Arsch, aber die Prüfung ist ja Präsentation und schriftliche Prüfung, die Prüfung ist"}, {"id": 118, "start": 848.8, "end": 854.6, "text": "auch für'n Arsch, weil es kommt dann aus so nem riesen Ding, was dran, gut, zum größten"}, {"id": 119, "start": 854.6, "end": 861.32, "text": "Teil immer wieder das gleiche, die Fragestellung ist immer äußerst wir, zumal die IHK jedes"}, {"id": 120, "start": 861.32, "end": 866.4, "text": "Jahr massig Fragen streichen muss, weil die zu dumm gestellt sind, aber die Präsentation,"}, {"id": 121, "start": 866.4, "end": 872.76, "text": "die Präsentation ist allein schon aus dem menschlichen Faktor, ähm, nicht, nicht predictable,"}, {"id": 122, "start": 872.76, "end": 877.34, "text": "naja, man könnte, man könnte vielleicht wirklich so weit gehen noch und sagen, dass es so ist"}, {"id": 123, "start": 877.34, "end": 884.32, "text": "wie bei Games, derjenige der sich richtig gut drauf vorbereitet und Plan vornehmen hat,"}, {"id": 124, "start": 884.32, "end": 889.08, "text": "ist, im Durchschnitt ist tendenziell besser, aber es gibt immer noch Ausreißer von oben"}, {"id": 125, "start": 889.08, "end": 890.88, "text": "nach unten und die sind nicht selten."}, {"id": 126, "start": 890.88, "end": 897.36, "text": "Also ich find's blöd, da drauf zu gucken."}, {"id": 127, "start": 897.36, "end": 900.68, "text": "Auf die schriftliche Prüfung kann man vielleicht noch ein bisschen drauf schauen, dass man"}, {"id": 128, "start": 900.68, "end": 904.52, "text": "sagt, aber was bei der mündlichen Abschluss, solange das Ding abgeschlossen ist, ich mein'"}, {"id": 129, "start": 904.52, "end": 912.44, "text": "ganz im Ernst, warum filtert, ich mein' ganz, ich find's bescheuert, wenn ihr sagt, ähm,"}, {"id": 130, "start": 912.44, "end": 917.36, "text": "ihr habt so eine, so eine Übernahmequote, ihr kennt doch den Azubi drei Jahre lang,"}, {"id": 131, "start": 917.36, "end": 923.12, "text": "ihr kennt den doch besser als, als irgendwie dann so eine Note je einschätzen könnt, ihr"}, {"id": 132, "start": 923.12, "end": 927.84, "text": "habt den Kerl drei Jahre lang ausgebildet, ihr habt den Kerl drei Jahre lang kennengelernt,"}, {"id": 133, "start": 927.84, "end": 931.88, "text": "ihr wisst doch am besten, ob der sich für euch eignet oder nicht, scheißt doch drauf,"}, {"id": 134, "start": 931.88, "end": 936.36, "text": "ob der vielleicht bei der IHK-Abschlussprüfung jetzt so eine 3 anstatt eine 2 oder eine 1"}, {"id": 135, "start": 936.36, "end": 940.72, "text": "hat, das ist doch überhaupt nicht ausschlaggebend, ihr könnt doch viel besser einschätzen als"}, {"id": 136, "start": 940.72, "end": 945.84, "text": "die IHK, ob der Typ Ahnung hat, ob der Plan hat, vor allem ist das jemand, der drei Jahre"}, {"id": 137, "start": 945.84, "end": 950.84, "text": "schon weiß, wie's bei euch aussieht, also, ich verstehe, man, ihr könnt natürlich machen,"}, {"id": 138, "start": 950.84, "end": 955.88, "text": "was ihr wollt, aber ich versteh's nicht, also, ich würd' da keinen Wert drauf legen, also,"}, {"id": 139, "start": 955.88, "end": 961.88, "text": "also wenn ich Leute mir aussuchen müsste, würd' ich das rein auf den Erfahrungen, natürlich,"}, {"id": 140, "start": 961.88, "end": 966.2, "text": "ich würd' voraussetzen, dass die Abschlussprüfung geschafft wird, das ist aber auch alles, der"}, {"id": 141, "start": 966.2, "end": 987.32, "text": "Rest, ähm, find ich blöd, also find ich, find ich nicht sinnvoll. Ja, Leko, moin. Ja,"}, {"id": 142, "start": 987.32, "end": 993.08, "text": "wie war denn jetzt hier deine Abschlussprüfung? Wobei, oder hast du die doch gar nicht? Ach,"}, {"id": 143, "start": 993.08, "end": 1008.6, "text": "ich hab sie bestanden. Pog. Was, ah, was für'n Ding? Moment, was? Github. Alter, wie soll"}, {"id": 144, "start": 1008.6, "end": 1019.88, "text": "man das aussprechen? Agriium. Das hört sich an wie irgendeine Krankheit. Äh, also, 8"}, {"id": 145, "start": 1019.88, "end": 1028.32, "text": "Sterne? Scheint, jetzt vor 10 Monaten letztes Release, ah, verstehe, das ist fake Github,"}, {"id": 146, "start": 1028.32, "end": 1036.92, "text": "das ist gar nicht Open Source. Die haben in Github erkannt, dass es besser aussieht, oder"}, {"id": 147, "start": 1036.92, "end": 1044.12, "text": "wie? Also, das ist was kostet, ist nicht, ist kein Ding, allerdings, das was Open Source"}, {"id": 148, "start": 1044.12, "end": 1056.44, "text": "ist, finde ich schon ganz praktisch. Ähm, beeinigt ist das, wir haben die besten Azubis"}, {"id": 149, "start": 1056.44, "end": 1063.0, "text": "mit dem besten Schnitt und niedrige schriftliche Prozentsetzung. Na ja, man könnte das machen,"}, {"id": 150, "start": 1063.0, "end": 1075.2, "text": "jawoll. Du hast dich als Cloud-Native, das hast du nicht, du jebaitest mich, das hast"}, {"id": 151, "start": 1075.2, "end": 1080.24, "text": "du bestimmt nicht gesagt. Das ist jebait. Sowas, sowas sagt doch niemand bei seiner"}, {"id": 152, "start": 1080.24, "end": 1087.84, "text": "Abschlussprüfung. Niemand stellt sich bei seiner Abschlussprüfung hin und sagt, ich"}, {"id": 153, "start": 1087.84, "end": 1097.56, "text": "bin Cloud-Native-Negative-Latency-Expert. Das ist, sag ich doch, das ist jebaites. Gibt"}, {"id": 154, "start": 1097.56, "end": 1105.64, "text": "es eine Liste? Du, es gibt bestimmt Generator dafür. Du brauchst, du brauchst zu 20, 30"}, {"id": 155, "start": 1105.64, "end": 1109.32, "text": "Buzzwords und die kannst du beliebig zusammen, kannst du wahrscheinlich sogar Chat-GPT dazu"}, {"id": 156, "start": 1109.32, "end": 1119.24, "text": "fragen, dass er dir einen coolen Buzzword-Titel generieren soll. Viele schreiben in der Stellanzeitung"}, {"id": 157, "start": 1119.24, "end": 1128.88, "text": "für eine Ausbildung bei uns einse Azubis. Ja, das ist dann aber umgedreht. Das soll"}, {"id": 158, "start": 1128.88, "end": 1134.6, "text": "ja eine, wenn auch eine vielleicht etwas merkwürdig, aber das soll ja Werbung für"}, {"id": 159, "start": 1134.6, "end": 1139.6, "text": "die Firma sein, das soll ja Werbung für das Unternehmen sein. So nach dem Motto, guckt"}, {"id": 160, "start": 1139.6, "end": 1145.32, "text": "mal, wir bilden so gut aus, dass ihr Einser habt. Das ist ja nicht, wir nehmen nur Leute"}, {"id": 161, "start": 1145.32, "end": 1151.04, "text": "mit Einser, das ist eher umgedreht gemeint. So nach dem Motto, guckt her, wir sind zu"}, {"id": 162, "start": 1151.04, "end": 1163.96, "text": "toll, bei uns haben die Leute Einser. Das ist ja was anderes. Keine Ahnung, was du machst."}, {"id": 163, "start": 1163.96, "end": 1167.48, "text": "So, was sollte ich mir angucken, dass da? No credit card required, da bin ich ja schon"}, {"id": 164, "start": 1167.48, "end": 1172.6, "text": "mal froh. Äh, wer hat das, wer hat das gepostet? Gerade nicht, dass das Werbung ist oder so,"}, {"id": 165, "start": 1172.6, "end": 1183.4, "text": "kann ja sein. Wer hat das gerade gepostet? Ich sehe es nicht. Ja. Nee, Battlesheep, der"}, {"id": 166, "start": 1183.4, "end": 1186.72, "text": "ist öfters da, das ist keine Werbung. Oder vielleicht, vielleicht, vielleicht, vielleicht"}, {"id": 167, "start": 1186.72, "end": 1191.04, "text": "ist ja von dir, kann doch sein. So, was gucke ich, was gucke ich mir hier an? Trusted by"}, {"id": 168, "start": 1191.04, "end": 1207.36, "text": "developers at Google, okay. Ähm, okay, was, das ist jetzt, das ist sehr, sehr, äh, ist"}, {"id": 169, "start": 1207.36, "end": 1215.24, "text": "das, kann man das lokal sinken oder ist das cloud only? Local und cloud vaults, mobile"}, {"id": 170, "start": 1215.24, "end": 1232.48, "text": "apps, okay. Mac, Windows, Linux, mobile apps. Ah, login. Warum ist denn das nicht so bekannt?"}, {"id": 171, "start": 1232.48, "end": 1245.64, "text": "Guck mal, Hacker News. Reddit. Hacker News. Ich, ich guck's mir mal an. Es ist, kann"}, {"id": 172, "start": 1245.64, "end": 1252.32, "text": "das, kann das notifications auf allen Plattformen? Ah, realtime collaboration, juckt mich jetzt"}, {"id": 173, "start": 1252.32, "end": 1271.4, "text": "überhaupt nicht. Kann das to do lists mit notifications? Ja, okay. Ich bin blind, Leute,"}, {"id": 174, "start": 1271.4, "end": 1296.92, "text": "ich seh nix mehr. Ja, guck ich mir mal an. Nordstars Kalender, ja, das ist was, was ich,"}, {"id": 175, "start": 1296.92, "end": 1306.8, "text": "aber das wäre cool, dann frag ich mich, warum das nicht so beliebt ist. Naja, gut. Habe"}, {"id": 176, "start": 1306.8, "end": 1311.28, "text": "ich eine interessante Stelle gesehen, da wäre aber eine MySQL Datenbankadministration dabei."}, {"id": 177, "start": 1311.28, "end": 1317.12, "text": "Was für eine, die schreiben, die schreiben, wenn die, wenn die einen Datenbankadministrator"}, {"id": 178, "start": 1317.12, "end": 1322.16, "text": "suchen, dann steht das auch im Titel, beziehungsweise steht ganz oben, wenn irgendwo drin steht"}, {"id": 179, "start": 1322.16, "end": 1330.48, "text": "Kenntnisse, Webserver, MySQL und Zeug. Da würde ich jetzt nicht davon ausgehen, dass"}, {"id": 180, "start": 1330.48, "end": 1334.16, "text": "du da der MySQL Experte bist. Da musst du, da musst du vielleicht mal eine Datenbank"}, {"id": 181, "start": 1334.16, "end": 1341.08, "text": "Backup ziehen oder sowas. Ansonsten ist die Datenbankadministration ja wieder eine Wissenschaft"}, {"id": 182, "start": 1341.08, "end": 1346.52, "text": "für sich. Ach, MSSQL, ja, komm doch das gleiche raus. Nee, da würde ich, das würde ich nicht"}, {"id": 183, "start": 1346.52, "end": 1353.32, "text": "machen. Microsoft Zeug, Alter. Nee, das würde ich nicht machen. Aber gut, kann ja jeder machen,"}, {"id": 184, "start": 1353.32, "end": 1357.92, "text": "wenn dir das gefällt. Datenbankadministration ist Wissenschaft für sich, wenn man das wirklich"}, {"id": 185, "start": 1357.92, "end": 1362.52, "text": "mit Optimierung und sowas, gerade was Oracle angeht. Ich glaube, ich glaube bei uns sind"}, {"id": 186, "start": 1362.52, "end": 1371.16, "text": "die Oracle DBAs so ziemlich die freifertigsten und bestbezahlten Leute, die wir haben, glaube"}, {"id": 187, "start": 1371.16, "end": 1377.52, "text": "ich, unterm Strich. Das kommt wohl gleich nach IBM Mainframe mit Host von dem, was du Ahnung"}, {"id": 188, "start": 1377.52, "end": 1404.44, "text": "haben musst, dass es nicht beliebt ist. Da gibt es coolere Sachen, ja, das interessiert"}, {"id": 189, "start": 1404.44, "end": 1411.52, "text": "aber im Business Umfeld nicht, ob es coolere Sachen gibt. Da wird Oracle verwendet, gerade"}, {"id": 190, "start": 1411.52, "end": 1414.96, "text": "weil die Anwendungen meistens ja nicht komplett neu entwickelt werden, sondern die gibt es"}, {"id": 191, "start": 1414.96, "end": 1421.0, "text": "seit 150 Jahren schon und eben auf Oracle Basis. Außerdem ist im Enterprise Business Umfeld"}, {"id": 192, "start": 1421.0, "end": 1428.52, "text": "auch wichtig, dass du einen ordentlichen Support-Vertrag kriegst und da fallen die meisten hippen angesagten"}, {"id": 193, "start": 1428.52, "end": 1434.48, "text": "neuen Sachen erstmal weg. Bei Oracle kriegst du nicht nur einen Support-Vertrag, bei Oracle"}, {"id": 194, "start": 1434.48, "end": 1438.32, "text": "kannst du, wenn du Bock hast, Millionen in Support-Verträge ausgeben und dann freuen"}, {"id": 195, "start": 1438.32, "end": 1444.68, "text": "sich im Endeffekt alle, weil sie so toll supported sind. Ansonsten ist der Oracle Support eigentlich"}, {"id": 196, "start": 1444.68, "end": 1450.4, "text": "ziemlich useless, der ist genauso unsinnig wie der Microsoft Support und andere Supports,"}, {"id": 197, "start": 1450.4, "end": 1454.2, "text": "die antworten nur möglichst schnell auf Tickets, damit sie ihre SLAs einhalten, wirklich was"}, {"id": 198, "start": 1454.2, "end": 1474.04, "text": "hilfreiches kommt da eigentlich nie mehr raus. Also ich habe Snowflake Datenbank Zeug noch"}, {"id": 199, "start": 1474.04, "end": 1481.04, "text": "nie ausprobiert und das machen wir heute gar nicht, aber das können wir ruhig als Titel"}, {"id": 200, "start": 1481.04, "end": 1494.56, "text": "drin lassen, schadet nichts. Das nächste Mal ist es dann wieder angesagt. Na wir gucken"}, {"id": 201, "start": 1494.56, "end": 1499.44, "text": "uns heute ein paar Sachen an. Gibt es irgendwelche spannenden Videos? Lass mal kurz. Never use"}, {"id": 202, "start": 1499.44, "end": 1512.2, "text": "PowerPoint again. Marp. Das kenne ich. Das ist für Markdown Präsentationen. Das kenne"}, {"id": 203, "start": 1512.2, "end": 1527.2, "text": "ich. Damit habe ich ganz lange Präsentationen erstellt. Ich verwende tatsächlich in letzter"}, {"id": 204, "start": 1527.2, "end": 1531.96, "text": "Zeit wieder öfters Powerpoint. Powerpoint war übrigens der Grund, warum ich mir eine"}, {"id": 205, "start": 1531.96, "end": 1536.44, "text": "Office Lizenz gekauft habe. Ihr wisst, ich finde Office ist maximal useless. Also Word"}, {"id": 206, "start": 1536.44, "end": 1540.76, "text": "würde ich nicht verwenden, Excel ist das Einzelige noch mit Daseinsberechtigung, was"}, {"id": 207, "start": 1540.76, "end": 1544.8, "text": "ich aber auch nicht verwende. Aber Powerpoint war mit der Ausschlaggebenden Punkt, warum"}, {"id": 208, "start": 1544.8, "end": 1553.6, "text": "ich mir tatsächlich ein Office Abo gekauft habe. Erstens, weil es im Business Umfeld"}, {"id": 209, "start": 1553.6, "end": 1559.12, "text": "eben sehr beliebt ist. Und wenn du Vorlagen und Templates verwenden musst, wo viele Unternehmen"}, {"id": 210, "start": 1559.12, "end": 1563.6, "text": "oftmals Wert darauf legen, ist Powerpoint ziemlich das Einzige. Und außerdem muss ich"}, {"id": 211, "start": 1563.6, "end": 1571.08, "text": "sagen, mittlerweile finde ich die Powerpoint Bedienung gar nicht mehr so schlecht. Also"}, {"id": 212, "start": 1571.08, "end": 1576.84, "text": "seit den letzten paar Versionen. Man kommt damit tatsächlich ganz gut klar. Außerdem"}, {"id": 213, "start": 1576.84, "end": 1581.28, "text": "haben die mittlerweile ein paar wirklich coole Animationsfeatures, wo du Textzeilen animieren"}, {"id": 214, "start": 1581.28, "end": 1585.88, "text": "kannst, ist eigentlich ganz praktisch. Was ich halt nicht mache, ist so die 0815 Powerpoint"}, {"id": 215, "start": 1585.88, "end": 1589.68, "text": "Vorlage verwenden, die da drinnen ist, weil die sehen alle kacke aus. Ich meine, meistens"}, {"id": 216, "start": 1589.68, "end": 1606.12, "text": "ein Farbverlauf im Hintergrund und dann wenige Stichworte und ein paar Bilder dabei. Azubi"}, {"id": 217, "start": 1606.12, "end": 1613.32, "text": "verkackt das richtig. Nicht nachmachen. Wichtig! Aha, eine Home-Lab-Tour. Home-Lab-Tour. Alter,"}, {"id": 218, "start": 1613.32, "end": 1624.0, "text": "heftiger Kokona. Bei dem Video haben doch bestimmt die Leute drauf geklickt, weil da steht"}, {"id": 219, "start": 1624.0, "end": 1633.72, "text": "nicht nachmachen. Oder? Eine Home-Lab-Tour. Was home-lapt er denn? Okay, zeige ich es."}, {"id": 220, "start": 1633.72, "end": 1642.68, "text": "Ich gucke mir immer gerne das Setup von anderen Leuten an. YouTube empfiehlt mir jetzt gerade"}, {"id": 221, "start": 1642.68, "end": 1662.96, "text": "unbedingt hier im ersten Spot Videos mit wenig Views, oder? Ja, habe ich. Er fragt,"}, {"id": 222, "start": 1662.96, "end": 1666.0, "text": "hast du auch so wenig Motivation wie ich, weil du bald einen neuen Job anfängst? Ja, habe"}, {"id": 223, "start": 1666.0, "end": 1670.76, "text": "ich. Habe ich. Ich sage euch, es ist, es hätte ich selbst nicht gedacht, aber in dem Moment,"}, {"id": 224, "start": 1670.76, "end": 1677.16, "text": "wo ich da die Kündigung abgegeben habe und aller, aller spätestens, seit ich die Bestätigung,"}, {"id": 225, "start": 1677.16, "end": 1681.68, "text": "so nach dem Motto, Termin und so passt alles, in der Post hatte, sodass ich mir nicht verrechnet"}, {"id": 226, "start": 1681.68, "end": 1687.52, "text": "habe oder so, ich habe auf einen Tag vom anderen keine Motivation mehr, irgendwas großartig"}, {"id": 227, "start": 1687.52, "end": 1693.0, "text": "zu machen. Ich mache die ein oder anderen Sachen. Ja, ich gehe in meine Dailies, ich gehe in"}, {"id": 228, "start": 1693.0, "end": 1697.72, "text": "meine Wartungsrunden, ich sage das ein oder andere auf unserer Teamrunde, ich mache im"}, {"id": 229, "start": 1697.72, "end": 1702.34, "text": "Zweifelsfall auch noch ein paar Fixes und Tickets und so, aber so großartige Motivation"}, {"id": 230, "start": 1702.34, "end": 1711.96, "text": "was zu machen ist komplett weg. Aber wo soll die auch herkommen? Na gut, das ist natürlich"}, {"id": 231, "start": 1711.96, "end": 1719.4, "text": "nicht dafür gedacht. Mockups für Frontend, was ist denn da gerade angesagt? Lange Zeit"}, {"id": 232, "start": 1719.4, "end": 1729.08, "text": "haben die Leute, wie heißt das, Figma verwendet? Figma hat eine ziemlich dofe Aussprache auf"}, {"id": 233, "start": 1729.08, "end": 1735.96, "text": "Deutsch oder vielleicht soll man Figma sagen, ich weiß nicht, ob das besser ist. Also zeitlang"}, {"id": 234, "start": 1735.96, "end": 1740.28, "text": "haben die Leute Figma verwendet für Frontend Mockups, was ist denn gerade so der neueste"}, {"id": 235, "start": 1740.28, "end": 1745.84, "text": "Scheiß? Bestimmt nicht. Im Frontend und JavaScript Umfeld ist es selten, dass ein Tool länger"}, {"id": 236, "start": 1745.84, "end": 1750.56, "text": "als ein halbes Jahr bis Jahr angesagt ist. Das ist cool, das kenne ich, das gibt es schon"}, {"id": 237, "start": 1750.56, "end": 1757.04, "text": "jahrelang, das habe ich früher auch verwendet. Aber das gibt es doch gar nicht mehr, oder?"}, {"id": 238, "start": 1757.04, "end": 1762.96, "text": "Das basiert doch immer noch auf Adobe Air Balsamik, das gibt es doch gar nicht mehr,"}, {"id": 239, "start": 1762.96, "end": 1768.0, "text": "oder? Die letzte Version, die ich gesehen habe und die ist Jahre alt, basierte auf"}, {"id": 240, "start": 1768.0, "end": 1776.48, "text": "Adobe Air und kann man eigentlich nicht mehr verwenden. Gibt es das noch? Ja, aber als"}, {"id": 241, "start": 1776.48, "end": 1787.64, "text": "Web, als Web only, oder? Nicht Desktop Programm. Browser only. Also ich habe das verwendet"}, {"id": 242, "start": 1787.64, "end": 1792.4, "text": "früher, da war das noch auf Adobe Air Basis. Ach App, ok. Muss ich mal gucken, ich fand"}, {"id": 243, "start": 1792.4, "end": 1802.52, "text": "das wirklich nice früher. Ich habe das gern verwendet. Wireframing Tool Desktop. Ah Alter,"}, {"id": 244, "start": 1802.52, "end": 1821.72, "text": "mein Gott, warum ist denn die das immer so? Ah kein Linux Setup? Nein, nee. Ich habe"}, {"id": 245, "start": 1821.72, "end": 1825.16, "text": "dir gar nicht empfohlen, ich habe es dort zum ersten Mal ausprobiert, aber bis jetzt finde"}, {"id": 246, "start": 1825.16, "end": 1829.84, "text": "ich es wirklich nice. Ich habe heute vorhin noch ein bisschen, bevor ich den Stream angemacht"}, {"id": 247, "start": 1829.84, "end": 1835.0, "text": "habe, an der VM gebastelt. Wir machen dann aber im Stream weiter, da gibt es ja durchaus"}, {"id": 248, "start": 1835.0, "end": 1837.84, "text": "noch einige Dinge, aber wir müssen gucken, dass es halbwegs einheitlich von den Farben"}, {"id": 249, "start": 1837.84, "end": 1841.88, "text": "her aussieht. Wir müssen uns ein paar neue Cursor machen und die Konfics noch fertig"}, {"id": 250, "start": 1841.88, "end": 1853.08, "text": "machen. Lass mal kurz schauen. Wir können uns doch gleich die Homelab Tour angucken."}, {"id": 251, "start": 1853.08, "end": 1862.44, "text": "Das ist ein kleiner Channel anscheinend, nur 498 Zuschauer bis jetzt. Gucken wir mal, ob"}, {"id": 252, "start": 1862.44, "end": 1867.76, "text": "die Videoqualität und sowas passt. Also erstmal Wub Wub Wub Wub Intro, alles klar."}, {"id": 253, "start": 1867.76, "end": 1877.28, "text": "Alter, was für eine Audioqualität. Und kein Video, nur ein Foto. Ok, dann will ich mir"}, {"id": 254, "start": 1877.28, "end": 1885.8, "text": "das nicht angucken. Wir kriegen ein Video gezeigt. Any Desk. Moment, Moment, Moment,"}, {"id": 255, "start": 1885.8, "end": 1896.16, "text": "Moment. Warum geht er auf seine Server per Remote Desktop? Hat er Kisten mit komplett"}, {"id": 256, "start": 1896.16, "end": 1916.08, "text": "installiertem Sass? Warum macht man denn sowas? Ok, ja, sieht bei mir wie im Abstellraum aus."}, {"id": 257, "start": 1916.08, "end": 1927.72, "text": "Was hat er am Start? Gucken wir mal ganz schnell durch. Ok, nix weltbewegendes dabei. Also"}, {"id": 258, "start": 1927.72, "end": 1931.8, "text": "da ist nix dabei, wofür man das bräuchte. Ich mein gut, der hat ein TrueNAS und ProxMox,"}, {"id": 259, "start": 1931.8, "end": 1935.72, "text": "damit kannste die Kisten schon ordentlich auslasten, aber ich glaube nicht, dass er"}, {"id": 260, "start": 1935.72, "end": 1940.28, "text": "das macht. Ok, das Video ist langweilig, das gucken wir nicht. Hast du das mit MyDeals"}, {"id": 261, "start": 1940.28, "end": 1957.36, "text": "und Paypal mitbekommen? Ne, was war? Was war mit MyDeals und Paypal? Was hab ich gemisst?"}, {"id": 262, "start": 1957.36, "end": 1986.72, "text": "Wow! Banger! Ok, was ist mit Paypal? Ok, was ist mit Paypal? Ok, was ist mit Paypal?"}, {"id": 263, "start": 1986.72, "end": 1997.12, "text": "Ok, ach nee, ich dachte da wurden vielleicht irgendwie wieder, weil Paypal hat in letzter"}, {"id": 264, "start": 1997.12, "end": 2000.28, "text": "Zeit mal ein paar Daten geleakt und Daten verloren, ich dachte da ist irgendwas, was"}, {"id": 265, "start": 2000.28, "end": 2010.2, "text": "mich interessieren müsste. Rest ist mir, glaubt ihr das interessiert mich nicht."}, {"id": 266, "start": 2010.2, "end": 2025.04, "text": "Ok, ich guck ja normalerweise keine Shorts. Ach, dass sie zeigen Emmet. Heißt das überhaupt"}, {"id": 267, "start": 2025.04, "end": 2030.4, "text": "noch so? Wurde das nicht umbenannt? Da kannst du dein HTML mit zur Abkürzung erstellen,"}, {"id": 268, "start": 2030.4, "end": 2044.4, "text": "das ist eigentlich ganz nice. Ah, ich vergaß, ich vergaß, ein Volume Slider ist selbstverständlich"}, {"id": 269, "start": 2044.4, "end": 2050.88, "text": "nicht im Scope bei Shorts. Wo wäre eigentlich das mit MySeries Frage an die krassen UI"}, {"id": 270, "start": 2050.88, "end": 2055.04, "text": "Designer im Chat, wo wäre denn das Problem gewesen hier ein Volume Slider hin zu machen"}, {"id": 271, "start": 2055.04, "end": 2062.96, "text": "anstatt nur Ton an oder aus? Ist das zu advanced für Highly Paid Professionals bei Google?"}, {"id": 272, "start": 2062.96, "end": 2069.64, "text": "Shorts durch Watch in der Uhrlehr? Ich weiß, dass man das austauschen kann, aber warum"}, {"id": 273, "start": 2069.64, "end": 2080.52, "text": "ist das nicht da? Was sagst du denn zu Chat-GPT? Ich wüsste nicht, was ich da zu großartig"}, {"id": 274, "start": 2080.52, "end": 2092.08, "text": "sagen könnte, was nicht schon tausendfach gesagt wurde. Ja, das kennen wir, das kennen"}, {"id": 275, "start": 2092.08, "end": 2109.36, "text": "wir. Ich wollte euch jetzt mal was fragen, vielleicht"}, {"id": 276, "start": 2109.36, "end": 2115.48, "text": "ist das nicht ganz politisch korrekt. Ich habe das nur heute in den Nachrichten gehört,"}, {"id": 277, "start": 2115.48, "end": 2123.2, "text": "das mit Panzer liefern an die Ukraine und sowas. Es gibt zwei Sachen, die ich nicht"}, {"id": 278, "start": 2123.2, "end": 2130.4, "text": "ganz verstehe, vielleicht könnt ihr mich da mal aufklären. In den Nachrichten haben"}, {"id": 279, "start": 2130.4, "end": 2138.44, "text": "sie heute sinngemäß sowas erzählt wie Bundesregierungen Unterzug zwangen und wir haben einen Imageschaden"}, {"id": 280, "start": 2138.44, "end": 2143.84, "text": "erlitten, weil wir der Ukraine keine Panzer geliefert haben oder sowas. Ich denke mir"}, {"id": 281, "start": 2143.84, "end": 2148.72, "text": "zuerst, so ein Panzer ist Schweine teuer. Es gibt zwei Sachen, die ich nicht ganz verstehe."}, {"id": 282, "start": 2148.72, "end": 2154.76, "text": "Das erste ist, also klar, Panzer sind Schweine teuer, so ein Panzer kostet irgendwie 5 Millionen"}, {"id": 283, "start": 2154.76, "end": 2163.32, "text": "oder sowas. Ich habe mal nachgeguckt, 5 Millionen im Durchschnitt. Haben die Leute dort überhaupt"}, {"id": 284, "start": 2163.32, "end": 2171.72, "text": "Leute, die die fahren können? Haben die überhaupt Leute, die die fahren können? Wahrscheinlich"}, {"id": 285, "start": 2171.72, "end": 2178.76, "text": "ist das nicht so easy. Ach, das liegt daran, weil die das versprochen haben in der Wahl,"}, {"id": 286, "start": 2178.76, "end": 2181.76, "text": "dass man keine Waffen liefert. Okay, dann verstehe ich natürlich, dass sie sich da"}, {"id": 287, "start": 2181.76, "end": 2188.48, "text": "so hin und her dingsen. Du kannst ja nicht einfach Leute reinsetzen und sagen, auf geht's"}, {"id": 288, "start": 2188.48, "end": 2198.08, "text": "auf Fahrt mal. Dann ist das Ding. Das zweite ist, was ich auch nicht ganz verstehe, warum"}, {"id": 289, "start": 2198.08, "end": 2202.6, "text": "ist das ein Imageschaden? Ich meine, wir sind ja nicht wirklich verpflichtet, dazu das zu"}, {"id": 290, "start": 2202.6, "end": 2205.56, "text": "machen. Ich meine, ich finde das eigentlich gar nicht verkehrt, zumindest auf den ersten"}, {"id": 291, "start": 2205.56, "end": 2208.6, "text": "Blick. Ich hatte ja oftmals mehrere Seiten, vielleicht jetzt irgendwas, woran ich nicht"}, {"id": 292, "start": 2208.6, "end": 2213.08, "text": "denke. Ich finde das jetzt erstmal gar nicht so übel, dass sie das machen wollen. Aber"}, {"id": 293, "start": 2213.08, "end": 2218.28, "text": "warum haben wir einen Imageschaden? Ich meine, es gibt doch nichts, das uns dazu verpflichtet,"}, {"id": 294, "start": 2218.28, "end": 2223.88, "text": "das zu machen. Es ist sicherlich nice, wenn wir das machen, aber wir sind ja nicht dazu"}, {"id": 295, "start": 2223.88, "end": 2232.12, "text": "verpflichtet. Das habe ich nicht so ganz verstanden, aber gut. Ich muss euch ganz ehrlich sagen,"}, {"id": 296, "start": 2232.12, "end": 2238.04, "text": "ich bin, was so weltpolitische Sachen angeht, ich ignoriere das meiste. Es geht mir mittlerweile"}, {"id": 297, "start": 2238.04, "end": 2244.28, "text": "alles so unglaublich auf den Sack. Nicht nur, was in der Welt passiert, auch wie es auf"}, {"id": 298, "start": 2244.28, "end": 2250.48, "text": "Twitter und Social Media alles breit diskutiert wird. Mir geht einmal die Ereignisse an sich"}, {"id": 299, "start": 2250.48, "end": 2255.16, "text": "zum größten Teil auf den Sack und mir geht fast noch mehr auf den Sack, wie dämlich"}, {"id": 300, "start": 2255.16, "end": 2259.96, "text": "die Leute, was für dämliche Sachen die Leute dazu schreiben. Das heißt, deswegen wohne"}, {"id": 301, "start": 2259.96, "end": 2264.88, "text": "ich auf Twitter auch in Andorra, damit ich nichts von diesem ganzen Shit mitkriege."}, {"id": 302, "start": 2264.88, "end": 2270.12, "text": "Und wenn ich doch aus Versehen mal auf irgendwas draufkomme, dann sehe ich wieder, das ist"}, {"id": 303, "start": 2270.12, "end": 2273.76, "text": "noch nicht immer ein deutsches Problem. In Deutschland schreiben die Leute auch viel dummes"}, {"id": 304, "start": 2273.76, "end": 2278.12, "text": "Zeug. Es ist international genauso. Egal, ob es auf Englisch oder auf Deutsch ist, du"}, {"id": 305, "start": 2278.12, "end": 2282.6, "text": "denkst dir immer so, mein Gott, was schreiben die Leute nur für eine Scheiße immer. Ich"}, {"id": 306, "start": 2282.6, "end": 2291.2, "text": "ignoriere das alles. Ich ignoriere einfach komplett, komplett alles, was passiert auf"}, {"id": 307, "start": 2291.2, "end": 2298.36, "text": "der Welt. Standort Andorra, ja, das ist eine gute Idee. Ontario, danke für den Sub. Das"}, {"id": 308, "start": 2298.36, "end": 2318.8, "text": "ist wirklich eine gute Idee. Aha, okay Chat, jetzt weiß ich Bescheid, alles klar. So, was"}, {"id": 309, "start": 2318.8, "end": 2331.8, "text": "gucken wir uns, was gucken wir uns denn jetzt an? Hä? Erzählt er uns was vom Osimodell,"}, {"id": 310, "start": 2331.8, "end": 2338.44, "text": "oder? Und Unrate direkt oder über Proxmox? Ich sehe keinen Sinn da drin, Unrate über"}, {"id": 311, "start": 2338.44, "end": 2345.48, "text": "Proxmox zu betreiben. Du kannst über Unrate auch VMs und Container hosten. Du musst gucken,"}, {"id": 312, "start": 2345.48, "end": 2351.92, "text": "wo dein Schwerpunkt ist. Wenn dein Schwerpunkt, sag mal, eine out of the box Oberfläche ist"}, {"id": 313, "start": 2351.92, "end": 2359.56, "text": "für ein bisschen Virtualisierung, Container und Netzwerkspeicher ist Unrate eine gute"}, {"id": 314, "start": 2359.56, "end": 2364.84, "text": "Sache. Vor allem, wenn du eher auf, wie nennt man das so schön, out of box Experience stehst"}, {"id": 315, "start": 2364.84, "end": 2370.72, "text": "und einen Plugin Manager haben willst und ein paar Sachen, da ist Unrate ganz nice. Wenn"}, {"id": 316, "start": 2370.72, "end": 2384.4, "text": "du hauptsächlich Virtualisieren willst, Virtualisieren wohlgemerkt, dann ist Proxmox ganz gut, aber"}, {"id": 317, "start": 2384.4, "end": 2390.92, "text": "du kannst halt keine normalen Standard Container, du kannst halt nur Raw LXC Container drauf"}, {"id": 318, "start": 2390.92, "end": 2395.48, "text": "laufen lassen, was jetzt nicht wirklich schlimm ist. Du kannst einfach einen Container starten"}, {"id": 319, "start": 2395.48, "end": 2399.2, "text": "und da drin einen Docker laufen lassen, das geht. Aber hauptsächlich für VMs, also wenn"}, {"id": 320, "start": 2399.2, "end": 2402.84, "text": "du hauptsächlich Virtualisieren willst, ist Proxmox sicherlich die bessere Variante. Wenn"}, {"id": 321, "start": 2402.84, "end": 2409.24, "text": "du ne Mischung hast aus allem, finde ich persönlich Unrate schicker, gerade im Heimbereich, weil"}, {"id": 322, "start": 2409.24, "end": 2421.84, "text": "im Heimbereich brauchst du ja selten nen 3-Node-Virtualisierungscluster. Das ist eher was Proxmox ist für meinen Geschmack"}, {"id": 323, "start": 2421.84, "end": 2426.2, "text": "eher was für Leute, die entweder viel basteln wollen daheim, also die halt sich einfach"}, {"id": 324, "start": 2426.2, "end": 2433.76, "text": "interessieren dafür und gerne da den halben Tag drinnen verbringen oder eben für kleinere"}, {"id": 325, "start": 2433.76, "end": 2441.16, "text": "Installationen, also jetzt sprich nicht jetzt irgendwie was mit 500 plus Mitarbeitern, die"}, {"id": 326, "start": 2441.16, "end": 2445.24, "text": "sich ohne Probleme auch ne ESX-Lizenz leisten können und ein bisschen ein Know-how damit"}, {"id": 327, "start": 2445.24, "end": 2451.16, "text": "aufbauen, sondern jetzt für irgendwie so nen Schreinerbetrieb oder so, die was brauchen"}, {"id": 328, "start": 2451.16, "end": 2458.24, "text": "oder irgendwie ein Marketing-Office oder sowas, wo schon ein Business-Umfeld, aber jetzt halt"}, {"id": 329, "start": 2458.24, "end": 2462.2, "text": "wirklich was Überschaubares, die vielleicht, wenn es hochkommt, im Keller oder so irgendwie"}, {"id": 330, "start": 2462.2, "end": 2468.76, "text": "ein Rack stehen haben oder 3-4 Kisten irgendwo unterm Tisch. Da ist Proxmox, finde ich gut,"}, {"id": 331, "start": 2468.76, "end": 2472.72, "text": "so im kompletten Business-Enterprise-Umfeld weiß ich nicht, warum man da lieber Proxmox"}, {"id": 332, "start": 2472.72, "end": 2476.76, "text": "nehmen sollte anstatt ESX. Der einzige Grund, der mir einfällt ist natürlich das Geld,"}, {"id": 333, "start": 2476.76, "end": 2480.92, "text": "wobei sich das wieder relativiert. Umso größer die Läden werden, umso mehr IT-Budget ist"}, {"id": 334, "start": 2480.92, "end": 2486.72, "text": "natürlich da auch frei. Wenn ich einfach was haben will, was easy funktioniert, dann würde"}, {"id": 335, "start": 2486.72, "end": 2491.8, "text": "ich auf jeden Fall Android nehmen, halt für Netzwerkspeicher und sonst was, da musste"}, {"id": 336, "start": 2491.8, "end": 2495.4, "text": "dir nicht viel Gedanken machen. Ich finde die Bedienung ist mittlerweile wirklich nice,"}, {"id": 337, "start": 2495.4, "end": 2500.32, "text": "deswegen habe ich das auch. Läuft alles vom USB-Stick, ich glaube Proxmox. Läuft Proxmox"}, {"id": 338, "start": 2500.32, "end": 2506.72, "text": "auch vom USB-Stick? Ne, die machen irgendwie noch einen ZFS-Rate und sowas. Es ist einfach"}, {"id": 339, "start": 2506.72, "end": 2511.28, "text": "die Frage, wo man den Schwerpunkt legt. Gibt ja noch mehr Möglichkeiten, du könntest ja"}, {"id": 340, "start": 2511.28, "end": 2515.84, "text": "auch TrueNAS angucken, das neue auf Debian-Basis, damit kannst du auch nass machen und Container"}, {"id": 341, "start": 2515.84, "end": 2519.88, "text": "und Top-VMs laufen lassen. Du könntest das komplett selbst machen auf einer Ubuntu-Kiste,"}, {"id": 342, "start": 2519.88, "end": 2525.04, "text": "kannst sowas wie Cockpit drauf installieren. Also ich muss sagen, ich habe Android früher"}, {"id": 343, "start": 2525.04, "end": 2528.28, "text": "so ein bisschen geflamed, weil ich mir gedacht habe, warum braucht man sowas? Mittlerweile"}, {"id": 344, "start": 2528.28, "end": 2533.48, "text": "habe ich selbst als einzigen Server noch im Einsatz, also X86-Kisten, ich habe noch ein"}, {"id": 345, "start": 2533.48, "end": 2538.36, "text": "Raspberry Pi rumstehen und im Wohnzimmer was zum Aufnehmen und so, aber als richtig Server-Kiste,"}, {"id": 346, "start": 2538.36, "end": 2542.28, "text": "so eine HP-Micro-Server, die einzige Kiste, die übrig geblieben ist bei mir, die läuft"}, {"id": 347, "start": 2542.28, "end": 2549.16, "text": "mittlerweile auch mit Android. Da muss ich sagen, die Kombination aus Out of the Box-Funktionalität"}, {"id": 348, "start": 2549.16, "end": 2552.64, "text": "und ein bisschen Virtualisierung, ein paar Container, ich habe da irgendwie 12-13 Container"}, {"id": 349, "start": 2552.64, "end": 2563.88, "text": "drauf laufen, 2 VMs, einer davon ist mein Home Assistant, du kannst relativ easy im GUI"}, {"id": 350, "start": 2563.88, "end": 2570.44, "text": "USB-Paths für USB-Sticks, Wi-Fi-Sticks, Stick-B-Sticks und so definieren, Container kannst du automatisch"}, {"id": 351, "start": 2570.44, "end": 2575.24, "text": "updaten lassen übers GUI, das kannst du ja mit, das kannst du ja beispielsweise bei Proxmox"}, {"id": 352, "start": 2575.24, "end": 2578.04, "text": "nicht machen, da musst du dir selbst was für ausdenken. Du kannst Container starten, du"}, {"id": 353, "start": 2578.04, "end": 2582.6, "text": "kannst theoretisch in diesem Container dann Docker installieren und dann da drin was starten,"}, {"id": 354, "start": 2582.6, "end": 2586.36, "text": "aber du musst dir dann trotzdem Gedanken machen, ok, wie bekomme ich mit, wenn es Updates für"}, {"id": 355, "start": 2586.36, "end": 2591.28, "text": "die Container gibt, wann pulle ich das, wie mache ich das, wo mounte ich meine Volumes"}, {"id": 356, "start": 2591.28, "end": 2596.96, "text": "hin und solche Geschichten, das brauchst du da gar nicht. Ich mache alle paar Wochen mal"}, {"id": 357, "start": 2596.96, "end": 2603.0, "text": "einen Backup von meiner Config und nächtlichen Backup auf eine externe Platte und fertig ist."}, {"id": 358, "start": 2603.0, "end": 2612.12, "text": "Ja, also ich finde Android im Heimbereich nice, Proxmox ist auch nice, allerdings der Schwerpunkt"}, {"id": 359, "start": 2612.12, "end": 2617.8, "text": "ist halt im Heimbereich finde ich jetzt nicht so sehr auf den Stärken von Proxmox. Proxmox"}, {"id": 360, "start": 2617.8, "end": 2623.2, "text": "kannst du super hochverfügbar machen, kannst du super klustern, kannst du VMs hin und her"}, {"id": 361, "start": 2623.2, "end": 2629.52, "text": "schieben, wenn was kaputt geht. Für Container-Housing finde ich es jetzt ehrlich gesagt nicht so"}, {"id": 362, "start": 2629.52, "end": 2641.4, "text": "der Hit, weil du dich trotzdem noch irgendwie um alles selbst kümmern musst. Tja, muss"}, {"id": 363, "start": 2641.4, "end": 2648.76, "text": "man gucken, wo der Schwerpunkt drauf liegt. LP-Fi, Dankeschön für den Sub, Massive Subscription,"}, {"id": 364, "start": 2648.76, "end": 2655.8, "text": "was das kostet, Android, nicht so teuer, glaube 19 Dollar oder sowas. Unraged License Purchase,"}, {"id": 365, "start": 2655.8, "end": 2667.0, "text": "oh nee, ich habe nichts gesagt. Ey, ist das teurer geworden? Oder hat es schon immer so"}, {"id": 366, "start": 2667.0, "end": 2672.68, "text": "viel gekostet? Also ich habe eine Basic-Lizenz, ich habe eine Basic-Lizenz und einmal 60 Dollar"}, {"id": 367, "start": 2672.68, "end": 2682.96, "text": "wahrscheinlich ausgegeben. Ist in Ordnung, kann man schon machen. Mit welcher Inventarisierungssoftware"}, {"id": 368, "start": 2682.96, "end": 2687.04, "text": "hast du bisher gute Erfahrungen gemacht? Da kann ich euch tatsächlich was zeigen, weil"}, {"id": 369, "start": 2687.04, "end": 2692.6, "text": "ich habe was Neues. Die ganze Zeit habe ich das hier verwendet, war aber nicht so wirklich"}, {"id": 370, "start": 2692.6, "end": 2698.68, "text": "glücklich für den Heimbereich. Ansonsten ist das eine wirklich super Software für Inventarisierung."}, {"id": 371, "start": 2698.68, "end": 2705.4, "text": "Vielleicht kein Business-Management-taugliches Logo, wenn dort die Leute ein Logo mit gepiersten"}, {"id": 372, "start": 2705.4, "end": 2708.6, "text": "sehen, dann denken die sich schon wieder, was ist das für Hipster-Software, aber das ist"}, {"id": 373, "start": 2708.6, "end": 2714.76, "text": "wirklich gut. Für den Heimbereich, also ich weiß ja, haben die eine Demo, da kann ich"}, {"id": 374, "start": 2714.76, "end": 2723.2, "text": "euch das mal zeigen. Launch Demo. Admin Password. Ja, für den Heimbereich ist es nichts, weil"}, {"id": 375, "start": 2723.2, "end": 2726.36, "text": "für den Heimbereich, sorry Leute, ich muss mich mal kurz planen, weil für den Heimbereich"}, {"id": 376, "start": 2726.36, "end": 2731.8, "text": "ist es totaler Overkill. Was du im Heimbereich brauchst hiervon ist das einzige das hier."}, {"id": 377, "start": 2731.8, "end": 2741.24, "text": "So sinngemäß. Du brauchst eine Liste, wo du was anlegen kannst und also für den Heimbereich"}, {"id": 378, "start": 2741.24, "end": 2745.2, "text": "brauchst du zwei Sachen. Du brauchst einen Namen, so keine Ahnung, Raspberry Pi 4 und"}, {"id": 379, "start": 2745.2, "end": 2752.72, "text": "du brauchst einen Standort, keine Ahnung, Fach 3.1. Mehr brauchst du für den Heimbereich."}, {"id": 380, "start": 2752.72, "end": 2757.44, "text": "Vielleicht noch eine Seriennummer, wenn du willst. So und das ist halt eher eine Software,"}, {"id": 381, "start": 2757.44, "end": 2762.36, "text": "da kannst du den kompletten Lifecycle tracken von, du hast was gekauft, du gibst das aus,"}, {"id": 382, "start": 2762.36, "end": 2769.36, "text": "du kannst nämlich hier auch sagen, du gibst neue Tinte für den Drucker aus oder du schickst"}, {"id": 383, "start": 2769.36, "end": 2773.2, "text": "das Gerät jetzt an irgendeinen Mitarbeiter, da kannst du ihn eintragen und wenn es verschrottet"}, {"id": 384, "start": 2773.2, "end": 2781.24, "text": "wird, trägst du es wieder aus und sowas. Also das ist daheim Mist. Viel zu Overkill. Ansonsten"}, {"id": 385, "start": 2781.24, "end": 2785.52, "text": "ist es eine coole Software. Wofür man das braucht, wenn man zum Beispiel wissen will,"}, {"id": 386, "start": 2785.52, "end": 2790.92, "text": "wo habe ich mein Filament für den 3D Drucker. Na gut, das weiß ich, das liegt direkt daneben."}, {"id": 387, "start": 2790.92, "end": 2799.12, "text": "Aber du hast ja kleine Elektronikteile zum Beispiel. Wo habe ich zum Beispiel einen"}, {"id": 388, "start": 2799.12, "end": 2810.28, "text": "Kilo Ohm Widerstand. Oder wo habe ich Schrauben in dem und dem Format, was auch immer. Dann"}, {"id": 389, "start": 2810.28, "end": 2817.0, "text": "ist es natürlich ganz praktisch, wenn du sowas hast. So zumindest, was ich jetzt gefunden habe,"}, {"id": 390, "start": 2817.0, "end": 2822.28, "text": "ist, dass, auch wie heißt denn das? Ja man kann das auch mit Excel und Google Tabellen machen,"}, {"id": 391, "start": 2822.28, "end": 2826.16, "text": "keine Frage. Aber ich habe jetzt was für mich im Heimbereich gefunden, was ich gerade ausprobiere,"}, {"id": 392, "start": 2826.16, "end": 2832.92, "text": "was ich ganz cool finde. Label Maker. Du meinst so einen Dymodrucker habe ich. Habe ich sogar"}, {"id": 393, "start": 2832.92, "end": 2837.04, "text": "zwei mittlerweile. Einen so einen kleinen für die Hand und einen größeren, der ganz viel"}, {"id": 394, "start": 2837.04, "end": 2854.08, "text": "Etiketten rausfeuern kann, wenn er will. Homebox oder wie hieß das? Ja, das da. 420 Stars. Das"}, {"id": 395, "start": 2854.08, "end": 2859.24, "text": "habe ich jetzt entdeckt vor so ungefähr einem halben Jahr. Und das gefällt mir ganz gut. Das"}, {"id": 396, "start": 2859.24, "end": 2865.64, "text": "ist genau das Richtige für den Heimbereich. Also als erstes Mal hast du verschiedene,"}, {"id": 397, "start": 2865.64, "end": 2873.52, "text": "verschiedene Themes. Du kannst irgendwo Profile. Das ist das Allerwichtigste. Du kannst erst mal"}, {"id": 398, "start": 2873.52, "end": 2882.4, "text": "sagen, ja, wir haben hier Dracula Knight. Dracula. Du musst jetzt mal schon mal Dark"}, {"id": 399, "start": 2882.4, "end": 2895.08, "text": "Seam. Die Software, die kein Dark Seam hat, sackt. Say goodbye to spreadsheets. Sehe ich jetzt nicht"}, {"id": 400, "start": 2895.08, "end": 2906.36, "text": "mehr. Keine Ahnung wo. Und hier haben schon Leute irgendwelchen Mist eingetragen und das hier ist"}, {"id": 401, "start": 2906.36, "end": 2913.72, "text": "halt total easy für den Heim gebraucht. Du kannst sagen Create Item. Sagen wir hier. Ich habe,"}, {"id": 402, "start": 2913.72, "end": 2918.24, "text": "ich habe in der Garage. Da musst du jetzt natürlich nicht wirklich Garage reinschreiben. Da"}, {"id": 403, "start": 2918.24, "end": 2924.52, "text": "kannst du auch eine Location anlegen. Fach 3.1. Ja, das ist ein Raspberry Pi 4. Vielleicht schreibe"}, {"id": 404, "start": 2924.52, "end": 2931.16, "text": "ich noch ergänzend dazu. Das hat 8 Gigabyte, 8 Gigabyte RAM. Was auch immer. Das würde ich"}, {"id": 405, "start": 2931.16, "end": 2935.24, "text": "aber ehrlich gesagt den Titel schreiben, aber nur mal so. Ich könnte theoretisch noch irgendwas,"}, {"id": 406, "start": 2935.24, "end": 2942.92, "text": "irgendwas dazu reinschreiben hier. Was weiß ich. War mal kaputt, aber ging dann wieder. Labels,"}, {"id": 407, "start": 2942.92, "end": 2951.88, "text": "kann ich mir ein Label aussuchen. Home Assistant IoT. Create. Bäm, fertig. Easy. Du kannst mehr,"}, {"id": 408, "start": 2951.88, "end": 2959.2, "text": "du kannst mehr angeben, wenn du willst. Oh, das ist verbackt gerade. Und du kannst auch,"}, {"id": 409, "start": 2959.2, "end": 2962.96, "text": "du kannst auch ein QR-Code davon generieren. Du kannst mehr angeben, wenn du willst, aber"}, {"id": 410, "start": 2962.96, "end": 2968.48, "text": "ansonsten war es das. Fertig. Du kannst dann auflisten lassen zum Beispiel alles mit IoT. Du"}, {"id": 411, "start": 2968.48, "end": 2975.52, "text": "kannst auflisten lassen alles, was in Fach 3.1 ist. Also das finde ich ist komplett ausreichend und"}, {"id": 412, "start": 2975.52, "end": 2980.48, "text": "ist eine super Geschichte für daheim, weil du kannst natürlich auch danach suchen, wenn du willst."}, {"id": 413, "start": 2980.48, "end": 2990.32, "text": "Wenn du jetzt wüsste wo. Wo ist der Suchen Knopf? Also ich weiß, dass du suchen kannst. Ich suche"}, {"id": 414, "start": 2990.32, "end": 3004.8, "text": "da öfters drin. Items. Wo ist der Suchen Knopf? Kann es sein, dass die Suche in der Demo nicht"}, {"id": 415, "start": 3004.8, "end": 3012.2, "text": "eingeschaltet ist? Ah ne bei Items. Ha, ich bin da blöd. Ich muss zu Items. Ja, so da könnte ich"}, {"id": 416, "start": 3012.2, "end": 3021.12, "text": "jetzt nach Raspberry Pi suchen. Pi 4 Gigabyte. Das finde ich für den Heimbereich sehr praktisch."}, {"id": 417, "start": 3021.12, "end": 3027.24, "text": "Da bin ich gerade am Erproben, ob das traugt. Also ich habe das vor einem halben Jahr gefunden,"}, {"id": 418, "start": 3027.24, "end": 3032.68, "text": "habe jetzt auch schon einige Sachen eingetragen. Ich finde es praktisch. Ja und Label muss ich"}, {"id": 419, "start": 3032.68, "end": 3042.12, "text": "sagen, kann ich wirklich empfehlen zwei Sachen. Also eine. Also so eine Demo. Ich glaube so. Ne."}, {"id": 420, "start": 3042.12, "end": 3049.4, "text": "So was hier. Die Dinger sind für den Heimbereich unglaublich praktisch. Das ist nichts, was du"}, {"id": 421, "start": 3049.4, "end": 3054.4, "text": "über USB steuern musst. Sondern das kannst du in die Hand nehmen, eintippen und gut ist. Die gibt"}, {"id": 422, "start": 3054.4, "end": 3058.64, "text": "es in ein paar Varianten. Die gibt es auch glaube ich mit normalem Keyboard Layout. Das ist wirklich"}, {"id": 423, "start": 3058.64, "end": 3067.76, "text": "praktisch. Ansonsten ich habe auch noch einen Label Writer. Irgendwie so ein Teil. Irgendwas in"}, {"id": 424, "start": 3067.76, "end": 3073.92, "text": "der Richtung. Und das Ding hat flutscht. Das haut die Etiketten raus. Wie sonst was. Also wenn man"}, {"id": 425, "start": 3073.92, "end": 3077.44, "text": "mal ein bisschen mehr drucken will vom Rechner aus ist das ganz gut. Wir müssen irgendwann unser"}, {"id": 426, "start": 3077.44, "end": 3082.24, "text": "Webinterface für das Ding auch nochmal weiter bauen. Ihr wisst, wir fangen, ich fange gerne"}, {"id": 427, "start": 3082.24, "end": 3089.8, "text": "Sachen an. Aber die werden nie fertig. Dabei war das ein wirklich cooles Projekt der Labelchamp."}, {"id": 428, "start": 3089.8, "end": 3095.6, "text": "Nur OGs erinnern sich noch an den Labelchamp. Ne, das stimmt nicht. Der Labelchamp ist noch"}, {"id": 429, "start": 3095.6, "end": 3098.76, "text": "gar nicht so lange her. Das ist erst irgendwie auch ein halbes Jahr. Irgendwie dem Dreh her."}, {"id": 430, "start": 3098.76, "end": 3112.2, "text": "Hast du schon vom OWASP Juice Shop. Ist das der Demo Shop? Ist das der Demo Shop für ASP.NET Core?"}, {"id": 431, "start": 3112.2, "end": 3122.52, "text": "Ach ne, Moment. Ne, ne, ne. Ist es nicht. Ach das ist das Ding. Das kenne ich. Das habe ich,"}, {"id": 432, "start": 3122.52, "end": 3127.32, "text": "das habe ich schon was drüber gelesen. Ja, das ist, das ist ein Webshop mit Sicherheitslücken,"}, {"id": 433, "start": 3127.32, "end": 3132.76, "text": "wo man dran rumbasteln kann. Und gucken, wie weit man kommt. Das ist eine gute Idee. Aber ich bin"}, {"id": 434, "start": 3132.76, "end": 3137.88, "text": "nicht so der krasse Security Hacker-Man. Das wisst ihr ja. Also wir machen zu öfters mal ein bisschen"}, {"id": 435, "start": 3137.88, "end": 3144.12, "text": "so Kleinigkeiten, wie mal eine.NET Anwendung dekompilieren oder ein Hex-Adapter auf. Also groß,"}, {"id": 436, "start": 3144.12, "end": 3148.4, "text": "oder wir haben auch schon mal Traffic von der Android-App mitgeschnitten und sowas. Aber so"}, {"id": 437, "start": 3148.4, "end": 3157.48, "text": "super, super-advance Sachen hier mit Assembly-Reverse-Engineern, die kompilen. Das machen wir hier nicht."}, {"id": 438, "start": 3157.48, "end": 3165.28, "text": "Habe ich auch zu wenig Ahnung von. Was man dafür nicht braucht, gehe ich mal stark von aus. So,"}, {"id": 439, "start": 3165.28, "end": 3168.44, "text": "lass mal gucken. Gibt es irgendwas, gibt es irgendwas interessantes, was wir uns angucken können?"}, {"id": 440, "start": 3168.44, "end": 3172.92, "text": "Ich refreshe jetzt nochmal kurz YouTube, dass YouTube die Chance hat. Große Dankeschön für den Sub."}, {"id": 441, "start": 3172.92, "end": 3178.64, "text": "Krelax, Pogger-Subscription. Danke, danke Leute. Habe ich gar nicht gesehen? Hat es keinen Sound"}, {"id": 442, "start": 3178.64, "end": 3186.32, "text": "gemacht? Oder habe ich zu viel geschwätzt und habe den Sound nicht gehört? Alles möglich. Warte noch,"}, {"id": 443, "start": 3186.32, "end": 3194.0, "text": "kauf dir jetzt kein Smartphone, warte auf die neuen. Wann kommen die neuen denn? New iPhone."}, {"id": 444, "start": 3194.0, "end": 3203.56, "text": "Apple Leak Reveals. Alter, das neue iPhone, das 14er Pro, kostet glaube ich schon 1300 Euro."}, {"id": 445, "start": 3203.56, "end": 3231.84, "text": "Was kosten das iPhone 15 dann? 2000 Euro? Die übertreiben es ja immer weiter. Design-Shock"}, {"id": 446, "start": 3231.84, "end": 3236.92, "text": "sieht aus wie das alte. Ja, das ist ja bei Apple normal, dass das meistens von der"}, {"id": 447, "start": 3236.92, "end": 3246.08, "text": "Vorgänger-Generation kaum zu unterscheiden ist. Hast du ein iPhone oder Android? Ich habe ein"}, {"id": 448, "start": 3246.08, "end": 3252.24, "text": "iPhone, weil ich das von der Firma gesponsert bekomme. Von der neuen witzigerweise, wo ich"}, {"id": 449, "start": 3252.24, "end": 3258.12, "text": "anfange auch, aber ich kaufe mir jetzt ein eigenes mit eigenem Vertrag. Da werde ich die"}, {"id": 450, "start": 3258.12, "end": 3263.64, "text": "Rufnummer, weil ich meine jetzt ist alles hin und her. Jetzt wechsle ich den Arbeitgeber,"}, {"id": 451, "start": 3263.64, "end": 3268.8, "text": "dann muss ich jetzt gucken, dass ich die Rufnummer mitnehmen kann vielleicht und dann auf den eigenen"}, {"id": 452, "start": 3268.8, "end": 3281.4, "text": "Vertrag, dann habe ich das neue ja noch nicht. Nee, nee, nee. Das 49 Euro Chaos. Warum das 49"}, {"id": 453, "start": 3281.4, "end": 3294.12, "text": "Euro Ticket jetzt scheitert? Moment. Moment. Probleme. Wer hätte das gedacht? Probleme."}, {"id": 454, "start": 3294.12, "end": 3299.4, "text": "Ihr habt das. Alter, das sind solche. Okay, bevor ich mich aufrege, ich lese das jetzt erst"}, {"id": 455, "start": 3299.4, "end": 3305.0, "text": "mal. Ich lese ich lese es jetzt erst mal kurz, bevor ich mich aufrege. Okay, vielleicht ist"}, {"id": 456, "start": 3305.0, "end": 3311.52, "text": "es alles nur vielleicht. Vielleicht ist es alles nur Gebate. Hast du die Gesichtserkennung zum Entsperren aktiv?"}, {"id": 457, "start": 3311.52, "end": 3320.16, "text": "Meinst du beim iPhone? Ja. Wie heißt das? Face ID. Genau. Nicht Face League, Face ID. Okay,"}, {"id": 458, "start": 3320.16, "end": 3325.24, "text": "im Schneckenzempo zum Deutschland Ticket. Meine Fresse, kriegen die irgendwas hin? Das ist das"}, {"id": 459, "start": 3325.24, "end": 3332.48, "text": "einzige. Das ist das einzige der letzten der letzten fünf Jahre oder so, was mich bei uns"}, {"id": 460, "start": 3332.48, "end": 3338.36, "text": "wirklich mal interessiert. Wo ich denke, es könnte ja tatsächlich mal für meine Steuern,"}, {"id": 461, "start": 3338.36, "end": 3344.96, "text": "die ich in Tausenden, in Zehntausenden bezahle, mal irgendwas rauskommen, wo ich den Eindruck habe,"}, {"id": 462, "start": 3344.96, "end": 3351.76, "text": "dass es mir mal was bringt. Aber das geht natürlich nicht. Das neue Deutschland Tempo,"}, {"id": 463, "start": 3351.76, "end": 3357.96, "text": "das gilt auch mal nicht für das Deutschland Ticket, denn hier hakt es gewaltig. Es ist fraglich,"}, {"id": 464, "start": 3357.96, "end": 3363.24, "text": "ab 1. Mai haben die nicht sogar gesagt, sie wollen es ab 1. April schon machen. Die haben doch gesagt,"}, {"id": 465, "start": 3363.24, "end": 3370.08, "text": "es soll angeblich ab 1. April kommen. Die haben das doch vorverlegt und jetzt wieder nicht. Alter,"}, {"id": 466, "start": 3370.08, "end": 3385.76, "text": "die sind so unfähig. Das ist doch unglaublich, Alter. Ja, es sollte mal im Januar kommen, ja. Und"}, {"id": 467, "start": 3385.76, "end": 3389.44, "text": "letztes Jahr hat man auch erzählt, ja, jetzt kommt es auch wirklich. Eigentlich sollen längst,"}, {"id": 468, "start": 3389.44, "end": 3401.12, "text": "längst, genau. Sie werfen dem FDP-Politiker, blablabla. Zuletzt war der 1. April im Gespräch,"}, {"id": 469, "start": 3401.12, "end": 3419.84, "text": "genau. Wo ist der Sinn, ihn vom 3. April kaufen zu können? Das Ticket gilt eh nur einen Monat."}, {"id": 470, "start": 3419.84, "end": 3425.44, "text": "Also warum sollte ich ihn kaufen am 3. April und am 1. Mai damit zu fahren? Ich kann ihn auch"}, {"id": 471, "start": 3425.44, "end": 3433.12, "text": "einfach. Okay, wahrscheinlich, weil man IT-Kompetenz mit errechnet, dass ab 1. Mai die Server abkacken."}, {"id": 472, "start": 3433.12, "end": 3440.96, "text": "Das ist doch irgendwie elektronisch, das muss ich doch nicht am Treppen. Jetzt ist ein Abo,"}, {"id": 473, "start": 3440.96, "end": 3452.48, "text": "das kann ich aber auch am 1., das ist doch eh elektronisch. Für mich steht fest, nicht später"}, {"id": 474, "start": 3452.48, "end": 3457.4, "text": "als der 1. Mai. Okay, sobald so einer diese Aussage trifft, für mich steht fest, heißt das"}, {"id": 475, "start": 3457.4, "end": 3468.96, "text": "im Endeffekt genau das Gegenteil. Moment, das wird nicht elektronisch? Wer ist denn der VDV?"}, {"id": 476, "start": 3468.96, "end": 3482.96, "text": "Verein der Ficker? Nee, vom Ficker, vor allem mit V. Wer ist das? Wer ist VDV? Der Verband"}, {"id": 477, "start": 3482.96, "end": 3504.2, "text": "deutscher Verkehrsunternehmen. Okay, eigentlich steht da nichts wirklich drin, oder? Es geht"}, {"id": 478, "start": 3504.2, "end": 3513.88, "text": "noch weiter, es geht noch weiter. So, das Deutschland-Deckel ist als monatlich kündbares Abo gedacht."}, {"id": 479, "start": 3513.88, "end": 3519.72, "text": "Es soll bundesweit für Busse und Bahnen im Nah- und Regionalverkehr gültig sein. Ja, das wissen wir."}, {"id": 480, "start": 3519.72, "end": 3528.92, "text": "Nur digital. Ach, wer braucht das auf Papier? Ich meine, okay, warum nicht? Aber digital würde"}, {"id": 481, "start": 3528.92, "end": 3542.32, "text": "doch reichen. Also, seriously, wisst ihr, man müsste jetzt wirklich mal überlegen,"}, {"id": 482, "start": 3542.32, "end": 3549.92, "text": "wie hoch ist der Anteil der Leute, die täglich oder sagen wir so sehr regelmäßig beispielsweise"}, {"id": 483, "start": 3549.92, "end": 3566.96, "text": "mit dem Regionalexpress fährt, die kein Handy benutzen? Bist da so viele? 85 Prozent benutzen"}, {"id": 484, "start": 3566.96, "end": 3578.8, "text": "kein Handy, das kannst du mir nicht erzählen. Man nimmt nicht immer extra sein gutes Mobiltelefon"}, {"id": 485, "start": 3578.8, "end": 3584.84, "text": "mit. Wer nimmt bitte schön nicht sein Handy mit? Die meisten Leute gehen mit ihrem Handy"}, {"id": 486, "start": 3584.84, "end": 3594.28, "text": "mittlerweile sogar kacken. Warum sollte das mal jemand nicht mit dem Zug nehmen? Handyakku leer."}, {"id": 487, "start": 3596.28, "end": 3606.48, "text": "Also Leute, das ist alles äußerst konstruiert. Ich habe jetzt auch so eine Karte, die die einscannen"}, {"id": 488, "start": 3606.48, "end": 3617.12, "text": "müssen. Und die nehme ich auch jeden Morgen mit. Wenn ich die Karte vergesse, dann geht"}, {"id": 489, "start": 3617.12, "end": 3621.28, "text": "das auch nicht. Und wenn ich mein Handy nicht mitnehme, dann geht das auch nicht. Ich meine,"}, {"id": 490, "start": 3621.28, "end": 3629.04, "text": "das ist jetzt kein großer Unterschied. Klar, der Handyakku ist leer. Wie oft wurdet ihr im"}, {"id": 491, "start": 3629.04, "end": 3635.76, "text": "Zug schon mal kontrolliert, wo der Handyakku leer war? Ich noch nie. Jetzt kommen natürlich"}, {"id": 492, "start": 3635.76, "end": 3640.12, "text": "ganz viele, die sagen, doch Max, ich laufe. Laufen ist mein Handyakku leer und ich werde"}, {"id": 493, "start": 3640.12, "end": 3654.52, "text": "laufen kontrolliert. Also natürlich gibt es irgendwelche Edge Cases, wo das mal der Fall sein"}, {"id": 494, "start": 3654.52, "end": 3672.72, "text": "könnte. Aber du fährst ja nicht schwarz, solange du ein Ticket besitzt. Weitere Vorteile des"}, {"id": 495, "start": 3672.72, "end": 3701.68, "text": "Papiertickets wäre, dass... Wie wir das Ticket finanzieren, ist mir scheißegal. Im Zweifelsfall"}, {"id": 496, "start": 3701.68, "end": 3712.4, "text": "aus meinen Steuern. So, wo ist jetzt das Problem genau gewesen? Geplantes Deutschland, hier"}, {"id": 497, "start": 3712.4, "end": 3721.48, "text": "ist das digitale 49 Euro... Gut, das ist natürlich auch in Frankfurt. Ihr macht mal, macht mal"}, {"id": 498, "start": 3721.48, "end": 3728.4, "text": "was für euer Geld, Alter. Macht mal was. Macht mal eine Sache, von der ich auch was"}, {"id": 499, "start": 3728.4, "end": 3739.72, "text": "hab. Nachdem ich hunderttausende Steuern bezahlt hab die letzten Jahre über. Ja, ich finanziere"}, {"id": 500, "start": 3739.72, "end": 3756.36, "text": "auch das 49 Euro Ticket und ihr auch. Das finde ich eine gute Regelung. Willst du mich"}, {"id": 501, "start": 3756.36, "end": 3763.72, "text": "verarschen, Mann? Ich fahre seit Jahren mit der Bahn. Also wenn einer weiß, wie scheiße"}, {"id": 502, "start": 3763.72, "end": 3773.84, "text": "die Bahn ist, dann ja wohl ich, oder? Oder meint ihr, ich finde die geil? Also wer auch"}, {"id": 503, "start": 3773.84, "end": 3778.32, "text": "nur ansatzweise mal Videos von mir zur Bahn geguckt hat oder regelmäßig bei mir auf"}, {"id": 504, "start": 3778.32, "end": 3786.48, "text": "Twitter ist, erzähl mir nichts. Ich weiß wie das ist. Ich fahre wahrscheinlich mehr"}, {"id": 505, "start": 3786.48, "end": 3793.76, "text": "Bahn als 95% der Bevölkerung in Deutschland. Also, jetzt mal im Ernst. Ich wurde noch nie"}, {"id": 506, "start": 3793.76, "end": 3800.24, "text": "kontrolliert, wo mein Handy aus war. Ich habe sogar noch nie mein Ticket vergessen. Zumindest"}, {"id": 507, "start": 3800.24, "end": 3804.76, "text": "wurde ich ja nicht kontrolliert, als ich vergessen habe. Ich hab mir noch nie mein Papierticket"}, {"id": 508, "start": 3804.76, "end": 3810.0, "text": "zurück gewünscht oder sonstige Geschichten, was ihr euch da alles ausdenkt. Vor allem wäre"}, {"id": 509, "start": 3810.0, "end": 3820.64, "text": "das viel einfacher, wenn man das rein digital macht. Aber im Ernst, also Chet, was ist hier"}, {"id": 510, "start": 3820.64, "end": 3840.84, "text": "wieder los? Wahrscheinlich. Hey, dann würde ich, wenn das 49 Euro Ticket mit den Rundfunkgebühren"}, {"id": 511, "start": 3840.84, "end": 3852.8, "text": "bezahlen, dann würde ich sogar gerne Rundfunkgebühren bezahlen, die ich jetzt nicht gerne bezahle."}, {"id": 512, "start": 3852.8, "end": 3857.24, "text": "Das Problem ist nicht, dass es Kaffee und WLAN im ICE gibt. Das Problem ist, dass der"}, {"id": 513, "start": 3857.24, "end": 3862.76, "text": "ICE nicht pünktlich ist. Aber ich fahre relativ selten ICE. Also die einzigen Strecken, die"}, {"id": 514, "start": 3862.76, "end": 3872.64, "text": "ich ICE öfters mal fahre ist nach Köln, weil das dauerte einfach 50 Minuten von Frankfurt."}, {"id": 515, "start": 3872.64, "end": 3889.16, "text": "Ansonsten eigentlich äußerst unregelmäßig ICE. Ja, ist halt sinnlos. So, wir wollen uns"}, {"id": 516, "start": 3889.16, "end": 3896.12, "text": "hier irgendwas angucken auf YouTube. Also was haben wir denn hier? Zeig mal hier. Ich habe"}, {"id": 517, "start": 3896.12, "end": 3902.8, "text": "eine Stunde geschwätzt einfach, ohne irgendwas zu machen. Warum das 49 Euro Ticket jetzt"}, {"id": 518, "start": 3902.8, "end": 3911.0, "text": "scheitert? Sollen wir das doch angucken oder muss ich mich dann wieder aufregen? Ich meine,"}, {"id": 519, "start": 3911.0, "end": 3914.52, "text": "wir haben, wir haben, wir haben es ja gerade, wir haben ja gerade die News dazu gelesen."}, {"id": 520, "start": 3914.52, "end": 3921.72, "text": "Komm, wir gucken lieber was anderes. Ja, okay, weil ihr sidechat. Okay, aber zaggig, aber"}, {"id": 521, "start": 3921.72, "end": 3922.72, "text": "zaggig."}, {"id": 522, "start": 3922.72, "end": 3928.2, "text": "Später als gedacht. Eigentlich wollte der Verkehrsminister da ja richtig Tempo machen."}, {"id": 523, "start": 3928.2, "end": 3932.52, "text": "Wir haben Vorarbeiten geleistet und werden das Ticket jetzt so schnell wie technisch"}, {"id": 524, "start": 3932.52, "end": 3936.76, "text": "möglich einführen. Das war im November. Da hat er sich aber eine schöne Hintertür offen"}, {"id": 525, "start": 3936.76, "end": 3941.68, "text": "gelassen mit technisch möglich. Und jetzt ist es immer noch nicht da und wird wohl auch"}, {"id": 526, "start": 3941.68, "end": 3946.28, "text": "nicht so schnell kommen. Erst heute hieß es im Schneckentempo zum Deutschland Ticket."}, {"id": 527, "start": 3946.28, "end": 3951.2, "text": "Das Ticket. Ja, Moment, das hat die Tagesschau gesagt. Aber unten drunter, so wie sich der"}, {"id": 528, "start": 3951.2, "end": 3956.6, "text": "Text gelesen hat, sah es immer noch danach aus, dass es April oder Mai losgeht. Da habe"}, {"id": 529, "start": 3956.6, "end": 3960.96, "text": "ich mich ja mittlerweile schon, da habe ich mich ja schon drauf eingestellt. Sämtliche"}, {"id": 530, "start": 3960.96, "end": 3965.72, "text": "Medien ihre besten Bahnwortspiele bereits ausgepackt hatten. Bund und Länder brachten"}, {"id": 531, "start": 3965.72, "end": 3968.52, "text": "das 49 Euro Ticket gestern aufs Gleis."}, {"id": 532, "start": 3968.52, "end": 3983.48, "text": "Und zur Abfahrt freigeben muss es jetzt noch die EU."}, {"id": 533, "start": 3983.48, "end": 3988.96, "text": "Bund und Länder streiten sich immer noch ums Geld. Dabei funktioniert günstiger Nahverkehr"}, {"id": 534, "start": 3988.96, "end": 4000.28, "text": "in manchen Orten jetzt schon super gut."}, {"id": 535, "start": 4000.28, "end": 4003.4, "text": "Wobei ist das überhaupt in Bayern?"}, {"id": 536, "start": 4003.4, "end": 4004.4, "text": "Warum in Templin?"}, {"id": 537, "start": 4004.4, "end": 4005.4, "text": "Nee, nee, ist es nicht."}, {"id": 538, "start": 4005.4, "end": 4010.64, "text": "Wieso Bund und Länder sich jetzt immer noch nicht einig sind und was das 49 Euro Ticket"}, {"id": 539, "start": 4010.64, "end": 4012.36, "text": "so wichtig macht. Jetzt."}, {"id": 540, "start": 4012.36, "end": 4029.08, "text": "Zugfahren, wie ein Auto, aber es fährt nur vorwärts und rückwärts. Eigentlich sollte"}, {"id": 541, "start": 4029.08, "end": 4033.24, "text": "das Ticket längst für 49 Euro da sein und zwar deutschlandweit."}, {"id": 542, "start": 4033.24, "end": 4036.8, "text": "Als Starttermin war ursprünglich der 1. Januar vorgesehen."}, {"id": 543, "start": 4036.8, "end": 4037.8, "text": "Ja, das wissen wir doch alles schon."}, {"id": 544, "start": 4037.8, "end": 4047.72, "text": "Und warum scheitert es jetzt?"}, {"id": 545, "start": 4047.72, "end": 4052.28, "text": "Ja, da hab ich mich schon drauf eingestellt."}, {"id": 546, "start": 4052.28, "end": 4080.36, "text": "Wir wollen, dass viele Menschen mit uns das Leben in vollen Zügen genießen."}, {"id": 547, "start": 4080.36, "end": 4091.68, "text": "Das sieht aus, das sieht aus wie ein Bahnhof bei mir in der Ecke, der ohne Scheiß mickrigste"}, {"id": 548, "start": 4091.68, "end": 4103.12, "text": "Bahnhof, den ich kenne, der mickrigste Bahnhof, den ich kenne, ist wie heißt das Rückersbacher"}, {"id": 549, "start": 4103.12, "end": 4111.4, "text": "Schlucht Bahnhof. Der Name ist Programm, Leute."}, {"id": 550, "start": 4111.4, "end": 4115.68, "text": "Google Maps, Google Maps, Adressen die in kommen."}, {"id": 551, "start": 4115.68, "end": 4123.52, "text": "Der Bahnhof ist so mickrig."}, {"id": 552, "start": 4123.52, "end": 4135.48, "text": "Okay, hier erkennst du ein bisschen, ja. Da ist nix. Da ist nicht mal ein Häuschen."}, {"id": 553, "start": 4135.48, "end": 4138.52, "text": "Das hier, da ist so ein Unterstand, wo du warten kannst."}, {"id": 554, "start": 4138.52, "end": 4144.8, "text": "Du steigst den Kahl auf die Kahlgrundbahn. Hey, das ist hier um die Ecke, ja ja."}, {"id": 555, "start": 4144.8, "end": 4147.64, "text": "Das ist wirklich der mickrigste Bahnhof, den ich kenne."}, {"id": 556, "start": 4147.64, "end": 4157.8, "text": "Da war früher sogar nur Bedarfshalt. Bedarfshalt, also du musstest drücken, wenn du raus wolltest."}, {"id": 557, "start": 4157.8, "end": 4162.84, "text": "Also es ist der mickrigste Bahnhof, den ich kenne."}, {"id": 558, "start": 4162.84, "end": 4168.48, "text": "Ich bezweifle nicht, dass es noch mickrigere gibt."}, {"id": 559, "start": 4168.48, "end": 4196.16, "text": "Mensch, das war Zugspitze. Grund für die lange Bahnhof..."}, {"id": 560, "start": 4196.16, "end": 4198.56, "text": "Das ist cringe, das kann ich mir da angucken."}, {"id": 561, "start": 4198.56, "end": 4201.08, "text": "Außerdem wissen wir doch, dass wir nix wissen."}, {"id": 562, "start": 4201.08, "end": 4206.56, "text": "Wir wissen, dass wir nix wissen, nämlich, dass irgendjemand Zweifel daran hat, dass es bis"}, {"id": 563, "start": 4206.56, "end": 4207.56, "text": "1. Mai kommt."}, {"id": 564, "start": 4207.56, "end": 4209.68, "text": "Allerdings alle sagen, es kommt bis 1. Mai."}, {"id": 565, "start": 4209.68, "end": 4210.68, "text": "Ja, müssen wir abwarten."}, {"id": 566, "start": 4210.68, "end": 4215.52, "text": "Das ist doch der Bahnhof hier."}, {"id": 567, "start": 4215.52, "end": 4219.48, "text": "Nee, das ist ein anderer Bahnhof."}, {"id": 568, "start": 4219.48, "end": 4227.56, "text": "Das ist ein anderer Bahnhof, der sieht aber genauso aus."}, {"id": 569, "start": 4227.56, "end": 4230.96, "text": "Wie viele Tabs ich haben kann, ich hab noch mehr Tabs."}, {"id": 570, "start": 4230.96, "end": 4234.28, "text": "Ich hab hier noch Tabs, hab ich gerade nicht, und ich hab da noch Tabs, guck mal, ich hab"}, {"id": 571, "start": 4234.28, "end": 4239.32, "text": "da noch welche und ich hab hier welche, das reicht noch nicht."}, {"id": 572, "start": 4239.32, "end": 4244.04, "text": "Und ich hab neben auf dem zweiten Bildschirm auch viele, auf meinem IOS auch viele."}, {"id": 573, "start": 4244.04, "end": 4248.8, "text": "Aber ehrlich, serious, seriously jetzt, cack wait."}, {"id": 574, "start": 4248.8, "end": 4249.8, "text": "Ernsthaft."}, {"id": 575, "start": 4249.8, "end": 4255.88, "text": "Wie soll ich denn sonst mein RAM voll kriegen, wenn nicht mit vielen Tabs."}, {"id": 576, "start": 4255.88, "end": 4264.24, "text": "Ich mein, guck mal, ich hab jetzt 13,8 Gigabyte RAM von 83 und das ist nicht mal belegt."}, {"id": 577, "start": 4264.24, "end": 4268.12, "text": "Das meiste ist im Voraus gecashed, weil ich vielleicht irgendwas starte."}, {"id": 578, "start": 4268.12, "end": 4270.44, "text": "Ich hab noch nicht mal eine VM laufen oder so."}, {"id": 579, "start": 4270.44, "end": 4274.84, "text": "So, wie soll ich meine 64 Gigabyte RAM voll bekommen, wenn ich nicht wenigstens mal ein"}, {"id": 580, "start": 4274.84, "end": 4275.84, "text": "paar Tabs aufmache?"}, {"id": 581, "start": 4275.84, "end": 4291.48, "text": "So, also was, was können wir uns denn anschauen, lass mal her."}, {"id": 582, "start": 4291.48, "end": 4292.48, "text": "Arm yourself."}, {"id": 583, "start": 4292.48, "end": 4296.48, "text": "Computer, was?"}, {"id": 584, "start": 4296.48, "end": 4303.48, "text": "Compute plate is here."}, {"id": 585, "start": 4303.48, "end": 4304.48, "text": "Was ist das?"}, {"id": 586, "start": 4304.48, "end": 4310.92, "text": "Ein PoE-gepowertes Armboard?"}, {"id": 587, "start": 4310.92, "end": 4320.12, "text": "Ah, gut noch, Tourlüfter."}, {"id": 588, "start": 4320.12, "end": 4332.0, "text": "40, 40 in einem, wie viel?"}, {"id": 589, "start": 4332.0, "end": 4344.44, "text": "40, hier, das sind 40, das sind, das sind zwei Höhleneinheiten."}, {"id": 590, "start": 4344.44, "end": 4355.36, "text": "Das sind zwei Höheneinheiten, 40, soll ich euch mal was sagen?"}, {"id": 591, "start": 4355.36, "end": 4366.88, "text": "Wahrscheinlich hat jeder ordentliche Epic- oder Intel-Server mit 2 HE mehr Rechenleistung"}, {"id": 592, "start": 4366.88, "end": 4367.88, "text": "als das."}, {"id": 593, "start": 4367.88, "end": 4376.16, "text": "Ich bin skeptisch, ob das was bringt."}, {"id": 594, "start": 4376.16, "end": 4382.12, "text": "Was ist denn da drin?"}, {"id": 595, "start": 4382.12, "end": 4390.2, "text": "Es wird auf jeden Fall stromsparender sein als die Intel-Kiste, aber rechenleistungstechnisch"}, {"id": 596, "start": 4390.2, "end": 4391.2, "text": "fragwürdig."}, {"id": 597, "start": 4391.2, "end": 4395.96, "text": "And they're about to go live on Kickstarter, but what are these for, besides wielding them"}, {"id": 598, "start": 4395.96, "end": 4400.64, "text": "like Leonardo and the Teenage Mutant Ninja Turtles of course, but why build a cluster"}, {"id": 599, "start": 4400.64, "end": 4404.8, "text": "with these blades and what good are they if you can't even buy a Compute Module 4 from"}, {"id": 600, "start": 4404.8, "end": 4405.8, "text": "Raspberry Pi?"}, {"id": 601, "start": 4405.8, "end": 4408.28, "text": "Do any alternative Compute Modules work?"}, {"id": 602, "start": 4408.28, "end": 4411.08, "text": "I'll get to all those questions in this video."}, {"id": 603, "start": 4411.08, "end": 4414.08, "text": "Last year I posted a video on an early alpha version of the board."}, {"id": 604, "start": 4414.08, "end": 4419.68, "text": "I even redesigned almost everything since then and came up with this, and it looks gorgeous."}, {"id": 605, "start": 4419.68, "end": 4423.92, "text": "The blade has an M.2 slot and is powered through this Ethernet connection up front."}, {"id": 606, "start": 4423.92, "end": 4425.96, "text": "The dev model has extras like a TPM model."}, {"id": 607, "start": 4425.96, "end": 4429.52, "text": "Wofür man das brauchen soll, na wofür man alle Blades braucht, dass man in möglichst"}, {"id": 608, "start": 4429.52, "end": 4433.72, "text": "kleinen Platz möglichst viel Rechenleistung reinbekommt."}, {"id": 609, "start": 4433.72, "end": 4437.84, "text": "Das gleiche wofür man früher auch Blades Center und sowas verwendet hat, wobei ich mich"}, {"id": 610, "start": 4437.84, "end": 4445.2, "text": "da halt frage, ob es Sinn macht, weil, also vielleicht aus Stromverbrauchssicht eventuell,"}, {"id": 611, "start": 4445.2, "end": 4454.84, "text": "aber eine fette 2HE Serverkiste mit irgendwie 48 CPU-Kernen haut das Leistungstechnik wahrscheinlich"}, {"id": 612, "start": 4454.84, "end": 4456.16, "text": "einfach komplett weg?"}, {"id": 613, "start": 4456.16, "end": 4465.6, "text": "Kannst du das 49 Euro Bahnticket im Chat schicken?"}, {"id": 614, "start": 4465.6, "end": 4471.4, "text": "Ne, hab ich jetzt nicht mehr, du kannst aber einfach nach irgendwie Walulibahn oder so"}, {"id": 615, "start": 4471.4, "end": 4472.4, "text": "suchen."}, {"id": 616, "start": 4472.4, "end": 4473.4, "text": "Das wirst du ja schon finden."}, {"id": 617, "start": 4473.4, "end": 4477.12, "text": "Ansonsten kann es vielleicht jemand im Chat posten, weil es hat mir auch jemand im Chat"}, {"id": 618, "start": 4477.12, "end": 4478.12, "text": "gepostet vorhin."}, {"id": 619, "start": 4478.12, "end": 4483.8, "text": "Ich bin zu faul, jetzt den Tab wieder aufzumachen."}, {"id": 620, "start": 4483.8, "end": 4506.44, "text": "Aber ich find's, ich find's nice, dass es schonmal Noctua-Fans sind, und ja ich nenne"}, {"id": 621, "start": 4506.44, "end": 4511.28, "text": "die Dinger Noctua, ich hab keine Ahnung wie man die offiziell ausspricht, die sind Österreicher,"}, {"id": 622, "start": 4511.28, "end": 4517.88, "text": "also wahrscheinlich spricht man die eher Noctua aus als, wie sagen die Amis dazu, Noctua,"}, {"id": 623, "start": 4517.88, "end": 4523.68, "text": "ne wie sprechen die jetzt aus?"}, {"id": 624, "start": 4523.68, "end": 4528.2, "text": "Noctua sagen die glaube ich, Noctua."}, {"id": 625, "start": 4528.2, "end": 4532.88, "text": "Ansonsten?"}, {"id": 626, "start": 4532.88, "end": 4559.92, "text": "Was so besonders an den Fans ist, die sind teuer, bei euch betont alle das A, das O,"}, {"id": 627, "start": 4559.92, "end": 4569.64, "text": "so Noctua, ne das klingt doch bescheuert, Noctua, das stimmt die Noctua-Fans sehen"}, {"id": 628, "start": 4569.64, "end": 4575.44, "text": "kacke aus, aber die sehen eigentlich nur kacke aus, weil es so ne Creme-Farbe mit Braunmischung"}, {"id": 629, "start": 4575.44, "end": 4576.44, "text": "ist."}, {"id": 630, "start": 4576.44, "end": 4581.92, "text": "Das ist sicherlich nicht die Hipster-Farbgebung, aber die ist prägnant, das verbinden die"}, {"id": 631, "start": 4581.92, "end": 4582.92, "text": "Leute mit Noctua."}, {"id": 632, "start": 4582.92, "end": 4586.32, "text": "Die haben mittlerweile auch Lüfter in schwarz, und ich glaube die haben mittlerweile sogar"}, {"id": 633, "start": 4586.32, "end": 4593.28, "text": "Lüfter, wo du so selbst tauschen kannst und solche Dinger, also die haben Plänten in"}, {"id": 634, "start": 4593.28, "end": 4597.36, "text": "verschiedenen Farben und die haben, die Gummistücke gibt es in verschiedenen Farben auch."}, {"id": 635, "start": 4597.36, "end": 4618.8, "text": "Sehen Sie diese custom-red Heatsinks, die funktionieren toll, aber sie sind wahrscheinlich"}, {"id": 636, "start": 4618.8, "end": 4621.28, "text": "ein Schicksal für Maschinen, ich bin mir nicht sicher, ob sie es zu massigen Produktionen"}, {"id": 637, "start": 4621.28, "end": 4624.72, "text": "machen werden, aber sie funktionieren und sie sehen toll aus."}, {"id": 638, "start": 4624.72, "end": 4628.68, "text": "Die Pies sind unter 42°C, egal was ich an ihnen gemacht habe."}, {"id": 639, "start": 4628.68, "end": 4633.6, "text": "Selbst ohne Heatsinks gibt es diese Bläder, da bläst ja auch ein dicker Noctua-Lüfter durch,"}, {"id": 640, "start": 4633.6, "end": 4636.4, "text": "viel Kraft und Cooling für stabile Überklappung."}, {"id": 641, "start": 4636.4, "end": 4641.48, "text": "Ivan hat seit Monaten 40 Bläder im Labor gearbeitet, und selbst wenn er überklappt hat, hat es"}, {"id": 642, "start": 4641.48, "end": 4642.48, "text": "keinen Abfall."}, {"id": 643, "start": 4642.48, "end": 4645.28, "text": "Aber die Computbläder packen in ein paar zusätzliche Features."}, {"id": 644, "start": 4645.28, "end": 4650.8, "text": "Die TPM- und DEV-Versionen kommen beide mit einem integrierten Infineon TPM 2.0 Modul."}, {"id": 645, "start": 4650.8, "end": 4655.76, "text": "TPM stands for Trusted Platform Module, and it can be used for secure embedded computing,"}, {"id": 646, "start": 4655.76, "end": 4658.64, "text": "especially paired with a Zimbit, which I'll get to later."}, {"id": 647, "start": 4658.64, "end": 4663.0, "text": "This chip stores encryption keys and secure passwords, so someone couldn't steal a blade"}, {"id": 648, "start": 4663.0, "end": 4664.16, "text": "and get your data."}, {"id": 649, "start": 4664.16, "end": 4668.88, "text": "Ivan went a step further and placed the chip under the compute module for better security."}, {"id": 650, "start": 4668.88, "end": 4672.88, "text": "Even if someone got physical access to the blade, they couldn't break into the TPM without"}, {"id": 651, "start": 4672.88, "end": 4674.72, "text": "unplugging the compute module."}, {"id": 652, "start": 4674.72, "end": 4682.88, "text": "Secure Computing is a little more complicated than I can get into here, and the Raspberry"}, {"id": 653, "start": 4682.88, "end": 4687.6, "text": "Pi isn't perfect, but the compute module does offer some improvements for Trusted Boot and"}, {"id": 654, "start": 4687.6, "end": 4690.16, "text": "TPM that I'll touch on more in a future video."}, {"id": 655, "start": 4690.16, "end": 4695.36, "text": "Continuing the theme of the TPM-Module, I'll get to the TPM-Module in the next video."}, {"id": 656, "start": 4695.36, "end": 4708.24, "text": "Continuing the theme of turning the Raspberry Pi Enterprise-Grade, these blades also have"}, {"id": 657, "start": 4708.24, "end": 4711.48, "text": "two features that fit right in with other racked equipment."}, {"id": 658, "start": 4711.48, "end": 4715.96, "text": "This pull tab at the front is hinged, so it can press this front button, and these LEDs"}, {"id": 659, "start": 4715.96, "end": 4721.16, "text": "indicate SSD activity, power, and Pi activity, plus there's a front and top mounted Neopixel"}, {"id": 660, "start": 4721.16, "end": 4722.92, "text": "you can program to do whatever you want."}, {"id": 661, "start": 4722.92, "end": 4726.28, "text": "And you can also turn off all the LEDs and software if you want."}, {"id": 662, "start": 4726.28, "end": 4729.0, "text": "Gut, dass RGB-Beleuchtung gleich integriert ist."}, {"id": 663, "start": 4729.0, "end": 4733.4, "text": "Python Script uses the Neopixels to display CPU temperature using different colors, and"}, {"id": 664, "start": 4733.4, "end": 4736.6, "text": "it also allows the LED to be used for locating the blade."}, {"id": 665, "start": 4736.6, "end": 4740.8, "text": "If you have a bunch of these in a rack somewhere, finding a particular blade might be tricky."}, {"id": 666, "start": 4740.8, "end": 4744.08, "text": "So you can trigger the Neopixel, then when you find the right blade, press the button"}, {"id": 667, "start": 4744.08, "end": 4745.18, "text": "to dismiss it."}, {"id": 668, "start": 4745.18, "end": 4748.68, "text": "So there's more to this board than meets the eye, but why?"}, {"id": 669, "start": 4748.68, "end": 4750.72, "text": "What would you even use these things for?"}, {"id": 670, "start": 4750.72, "end": 4755.44, "text": "Well, Ivan's original motivation was to get a bunch of ARM computers running for continuous"}, {"id": 671, "start": 4755.44, "end": 4757.56, "text": "integration testing at JetBrains."}, {"id": 672, "start": 4757.56, "end": 4761.68, "text": "They built tons of software for developers, and they needed to test them on Macs, PCs,"}, {"id": 673, "start": 4761.68, "end": 4762.68, "text": "and..."}, {"id": 674, "start": 4762.68, "end": 4763.68, "text": "Okay, wenn man..."}, {"id": 675, "start": 4763.68, "end": 4764.68, "text": "Okay, okay."}, {"id": 676, "start": 4764.68, "end": 4767.92, "text": "Das ist ein Anwendungszweck, den verstehe ich sogar irgendwo."}, {"id": 677, "start": 4767.92, "end": 4779.48, "text": "Wenn man ARM Software test, ARM Builds testen will, auf eigene Hardware, das ist ein"}, {"id": 678, "start": 4779.48, "end": 4781.48, "text": "sehr spezieller Anwendungsfall."}, {"id": 679, "start": 4781.48, "end": 4782.48, "text": "Das ist gar nicht?"}, {"id": 680, "start": 4782.48, "end": 4783.48, "text": "Okay."}, {"id": 681, "start": 4783.48, "end": 4784.48, "text": "Das ist aber ein sehr spezieller Anwendungsfall."}, {"id": 682, "start": 4784.48, "end": 4793.72, "text": "Yes, even Raspberry Pi's, and he's running 40 blades in 2U, that's 160 ARM cores, 320"}, {"id": 683, "start": 4793.72, "end": 4795.8, "text": "gigs of RAM, and up to 320-"}, {"id": 684, "start": 4795.8, "end": 4796.8, "text": "Serious, Leute."}, {"id": 685, "start": 4796.8, "end": 4797.8, "text": "Seriously."}, {"id": 686, "start": 4797.8, "end": 4802.2, "text": "Ein ordentlicher 2HE-Server lacht sich kaputt da drüber."}, {"id": 687, "start": 4802.2, "end": 4805.88, "text": "Gerade über 320GB RAM."}, {"id": 688, "start": 4805.88, "end": 4812.12, "text": "Da kriegste deutlich mehr, Leute."}, {"id": 689, "start": 4812.12, "end": 4818.04, "text": "Wir hatten vor fast 10 Jahren schon Kisten mit 2TB RAM."}, {"id": 690, "start": 4818.04, "end": 4822.6, "text": "Auch in Plateform, natürlich war das Plate ein bisschen größer."}, {"id": 691, "start": 4822.6, "end": 4827.8, "text": "Es hat zwar viele Kerne, aber wenn du dir eine fette 48-Kern-Intel-Kiste da hinstellst,"}, {"id": 692, "start": 4827.8, "end": 4831.16, "text": "hat das wahrscheinlich deutlich, deutlich mehr Rechenleistung als das Ding."}, {"id": 693, "start": 4831.16, "end": 4835.32, "text": "Aber gut, ich mein, das ist auch nicht der Anwendungszweck."}, {"id": 694, "start": 4835.32, "end": 4842.72, "text": "Rein rechenleistungstechnisch ist das, ja, ich glaub nicht, dass das groß Sinn macht,"}, {"id": 695, "start": 4842.72, "end": 4850.28, "text": "aber für testen von ARM-Builds, das versteh ich, okay, das ist ein äußerst spezieller"}, {"id": 696, "start": 4850.28, "end": 4851.28, "text": "Anwendungszweck."}, {"id": 697, "start": 4851.28, "end": 4854.32, "text": "Glaub ich nicht, dass es den so oft gibt, aber dafür versteh ich den Sinn."}, {"id": 698, "start": 4854.32, "end": 4873.6, "text": "Ja, das ist natürlich äußerst sparsam, ne fette 2HE-Kiste, vor allem unter Last, die"}, {"id": 699, "start": 4873.6, "end": 4874.6, "text": "braucht deutlich mehr."}, {"id": 700, "start": 4874.6, "end": 4891.68, "text": "Hat er recht, hab ich nicht dran gedacht, dafür kann es durchaus auch Sinn machen."}, {"id": 701, "start": 4891.68, "end": 4903.72, "text": "Ich mein, man kann auch einfach VMs nehmen, aber, ja gut."}, {"id": 702, "start": 4903.72, "end": 4923.84, "text": "Ich mag die Ami-Aussprache von Kubernetes, Kubernetes, Kubernetes, Leute, ist es bei"}, {"id": 703, "start": 4923.84, "end": 4926.16, "text": "euch Kubernetes oder Kubernetes?"}, {"id": 704, "start": 4926.16, "end": 4934.16, "text": "Oder Kuber-Nedus?"}, {"id": 705, "start": 4934.16, "end": 4953.16, "text": "Shit, aber beim Schreiker ist es Kuber-Nedus, alles klar."}, {"id": 706, "start": 4953.16, "end": 4969.56, "text": "Kuber-Nedus, also muss man immer sagen, Leistung oder Performance pro Watt, Leistung pro Watt"}, {"id": 707, "start": 4969.56, "end": 4974.2, "text": "kann ich schlecht sagen, das war ein bisschen missverständlich, aber Performance pro Watt"}, {"id": 708, "start": 4974.2, "end": 4978.76, "text": "ist da natürlich besser als bei x86-Chart, weil da müssen wir gar nicht drüber reden."}, {"id": 709, "start": 4978.76, "end": 5005.58, "text": "Aber da's die"}, {"id": 710, "start": 5005.58, "end": 5010.18, "text": "Ivan hat auch eine Kustom-Board mit Ximbit's HSM4-Security-Modul gemacht."}, {"id": 711, "start": 5010.18, "end": 5012.9, "text": "Mit diesem hat er diese Demo gemacht, in der man, wenn man die Karte auslöscht,"}, {"id": 712, "start": 5012.9, "end": 5016.7, "text": "die Karte reagieren kann, indem man Dinge wie automatisch sensibler Daten zerstört."}, {"id": 713, "start": 5016.7, "end": 5019.86, "text": "Und wenn du über die Idee des secure Computers auf der Pi drückst,"}, {"id": 714, "start": 5019.86, "end": 5021.54, "text": "dann mach' dir sicher, dass du abonniert bist."}, {"id": 715, "start": 5021.54, "end": 5024.1, "text": "Du wirst nicht missen wollen, dass mein Video auf dieser Sache geht."}, {"id": 716, "start": 5024.1, "end": 5026.26, "text": "Nicht sogar Redshirt Jeff kann es hacken."}, {"id": 717, "start": 5026.26, "end": 5028.42, "text": "Der Rest der Welt steht nicht still."}, {"id": 718, "start": 5028.42, "end": 5030.54, "text": "Pine64 haben auch ihre eigene Karte ausgelöst."}, {"id": 719, "start": 5030.54, "end": 5032.74, "text": "Ich hatte noch nicht Zeit, es voll zu testen,"}, {"id": 720, "start": 5032.74, "end": 5037.74, "text": "aber ich habe die Karte ausgelöst."}, {"id": 721, "start": 5037.74, "end": 5039.54, "text": "Okay, ich glaube, den Rest muss man nicht gucken."}, {"id": 722, "start": 5039.54, "end": 5041.86, "text": "Es gibt sechs verschiedene OSs,"}, {"id": 723, "start": 5041.86, "end": 5043.06, "text": "sogar mit einer Bulk-Order."}, {"id": 724, "start": 5043.06, "end": 5045.94, "text": "Okay, das ist tatsächlich mal eine Hardware, wo ich sagen würde,"}, {"id": 725, "start": 5045.94, "end": 5049.78, "text": "sie sieht auf dem Papier ganz cool aus."}, {"id": 726, "start": 5049.78, "end": 5054.34, "text": "Sinnhaftigkeit in manchen Fällen da, aber so im Großen und Ganzen."}, {"id": 727, "start": 5054.34, "end": 5056.14, "text": "Weil die wollen ja auch auf Kickstarter und so was,"}, {"id": 728, "start": 5056.14, "end": 5059.06, "text": "also die wollen ja quasi wirklich da großartig Business mit machen."}, {"id": 729, "start": 5059.06, "end": 5066.54, "text": "Ich weiß nicht, ob es da so viele großen Absatzmöglichkeiten für gibt."}, {"id": 730, "start": 5066.54, "end": 5067.9, "text": "Aber gut, wenn sie es richtig gemacht haben,"}, {"id": 731, "start": 5067.9, "end": 5074.66, "text": "haben sie das natürlich auch vorher schon ein bisschen erforscht."}, {"id": 732, "start": 5074.66, "end": 5077.46, "text": "Was können wir uns, was haben wir noch 20 Minuten Zeit?"}, {"id": 733, "start": 5077.46, "end": 5080.74, "text": "Welches Smart Home System kommt in mein Haus?"}, {"id": 734, "start": 5080.74, "end": 5085.98, "text": "Fünf Ideen für meine eigene AI Anwendung, Geschichten."}, {"id": 735, "start": 5085.98, "end": 5088.82, "text": "Die top, was für, wie komme ich denn da drauf?"}, {"id": 736, "start": 5088.82, "end": 5091.74, "text": "Ich verwende OMI Zsh."}, {"id": 737, "start": 5092.66, "end": 5095.02, "text": "Wie spricht man sie überhaupt aus?"}, {"id": 738, "start": 5095.02, "end": 5098.06, "text": "OMI Zsh."}, {"id": 739, "start": 5100.42, "end": 5103.3, "text": "Ich verwende das überhaupt nicht, aber das können wir tatsächlich mal gucken."}, {"id": 740, "start": 5103.3, "end": 5108.54, "text": "Was sind dann die Top, ich meine die die die OMI Zsh plugins,"}, {"id": 741, "start": 5108.54, "end": 5111.3, "text": "die kann man zum größten Teil auch ohne OMI Zsh verwenden."}, {"id": 742, "start": 5111.74, "end": 5113.14, "text": "Kann man sich einfach raus kopieren."}, {"id": 743, "start": 5113.14, "end": 5114.58, "text": "Gucken wir mal."}, {"id": 744, "start": 5114.58, "end": 5142.5, "text": "ich sag nicht zschel ich sag richtig schön auf deutsch zsh oder zschel wir skippen das"}, {"id": 745, "start": 5142.5, "end": 5161.7, "text": "video ein bisschen drüber wir gucken uns das jetzt nicht an keine sorge also ok moment dafür"}, {"id": 746, "start": 5161.7, "end": 5172.94, "text": "braucht man dafür braucht man doch gar kein plugin kann es zsh nicht mittlerweile so ich glaube ich"}, {"id": 747, "start": 5172.94, "end": 5179.94, "text": "weiß was der meint du schreibst das du schreibst das kommando und dann schreibt ihr dahinter was"}, {"id": 748, "start": 5179.94, "end": 5186.26, "text": "du normal also was du schreiben könntest als nächstes ohne dass du das tabmenü aufmachen"}, {"id": 749, "start": 5186.26, "end": 5193.34, "text": "musst ich gebe zu das ist was was ich nicht mag ich habe ja ein bisschen fisch und so nebenbei"}, {"id": 750, "start": 5193.34, "end": 5197.38, "text": "immer ausprobiert das ist ein feature das gefällt mir nicht vielleicht muss man sich noch dran"}, {"id": 751, "start": 5197.38, "end": 5208.7, "text": "gewöhnen ich weiß fisch macht das macht das automatisch und das hat mir nicht gefallen also"}, {"id": 752, "start": 5208.7, "end": 5219.1, "text": "ich ich drück ich drück tapp tapp und habe da eine liste zum zum auswählen vielleicht sollte"}, {"id": 753, "start": 5219.1, "end": 5226.46, "text": "ich vielleicht sollte ich noch mal noch mal eine chance geben können wir beim vm konfigurieren"}, {"id": 754, "start": 5226.46, "end": 5231.7, "text": "mal ausprobieren based on things that you've typed in the past let me open up my terminal"}, {"id": 755, "start": 5231.7, "end": 5238.58, "text": "das ist was ich denke ok es ist das was ich denke dass der quasi also ihr seht jetzt hier kommt der"}, {"id": 756, "start": 5238.58, "end": 5245.62, "text": "schreibt der schreibt der fängt hier an was zu schreiben und das was hier dahinter kommt schlägt"}, {"id": 757, "start": 5245.62, "end": 5250.46, "text": "ihm seine shell vor als vielleicht willst du meinst du ja das jetzt kann er wahrscheinlich"}, {"id": 758, "start": 5250.46, "end": 5254.46, "text": "doppelt tapp oder was auch immer drücken oder trüppelt tapp oder keine ahnung immer das"}, {"id": 759, "start": 5254.46, "end": 5259.98, "text": "completed oder es fügt automatisch ein besonders cool ist natürlich wenn sich das merkt und ich"}, {"id": 760, "start": 5259.98, "end": 5265.34, "text": "glaube das macht was deine häufig aufgerufenen sachen sind dann bist du deutlich schneller beim"}, {"id": 761, "start": 5265.34, "end": 5273.54, "text": "beim tippen ich bin jemand ich tippe nach möglichkeit eigentlich gar nichts großartig ein ich mein"}, {"id": 762, "start": 5273.54, "end": 5279.1, "text": "mein mein er also wenn ich weiß wenn ich also wenn ich weiß dass ich das kommando schon benutzt"}, {"id": 763, "start": 5279.1, "end": 5284.34, "text": "habe ich drücke eigentlich immer steuerung er das zeigt nur die history an kann auch sein es ist"}, {"id": 764, "start": 5284.34, "end": 5288.66, "text": "aber doof wenn sie ist die anzeigt weil dann lernt das nicht was die meist benutzten kommandos sind"}, {"id": 765, "start": 5288.66, "end": 5293.1, "text": "nur weil es das letzte war also es wäre schon cool wenn das ich glaube das macht es auch"}, {"id": 766, "start": 5295.1, "end": 5302.42, "text": "so und das erste was ich mache ist steuerung er steuerung er also ich hätte jetzt nicht"}, {"id": 767, "start": 5302.42, "end": 5309.14, "text": "angefangen pyson zu schreiben ich hätte geschrieben steuerung steuerung er p y und dann hätte ich"}, {"id": 768, "start": 5309.14, "end": 5319.78, "text": "die letzten drei hervor vollkommen lese durch durch geht durch durch getappt und dann passt das"}, {"id": 769, "start": 5319.78, "end": 5326.34, "text": "in der word python ist gonna suggest the auto completion of main.py which i've used a lot so"}, {"id": 770, "start": 5326.34, "end": 5330.02, "text": "if i want that i can hit the right ok wir wissen was es ist also müssen wir nicht mehr weiter"}, {"id": 771, "start": 5330.02, "end": 5339.54, "text": "kommen so was haben wir als nächstes how to add plug-in su sudo suggestions the next plugin on"}, {"id": 772, "start": 5339.54, "end": 5348.66, "text": "the list is sudo now this one is really really da bin ich jetzt mal gespannt was wir für sudo"}, {"id": 773, "start": 5348.66, "end": 5353.38, "text": "für den plugin brauchen so if i'm typing something like let's say i want to reboot my machine and i"}, {"id": 774, "start": 5353.38, "end": 5362.46, "text": "go reboot ok was man jetzt machen könnte ist sudo schreiben und ausrufezeichen ausrufezeichen"}, {"id": 775, "start": 5362.46, "end": 5367.58, "text": "dahinter machen das kann man machen ehrlich gesagt ich mache das so gut wie nie weil ich"}, {"id": 776, "start": 5367.58, "end": 5374.26, "text": "irgendwie immer nicht dran denke aber eine schnelle variante wäre sudo ausrufezeichen ausrufezeichen"}, {"id": 777, "start": 5374.26, "end": 5380.06, "text": "ausrufezeichen ausrufezeichen ist quasi den letzten befehl noch mal einsetzen das mal gucken"}, {"id": 778, "start": 5380.06, "end": 5387.22, "text": "und jetzt so i need to write sudo reboot oder sudo ausrufezeichen ausrufezeichen oder was ich"}, {"id": 779, "start": 5387.22, "end": 5393.74, "text": "auch mal eine weile hatte ich hatte sudo auf underscore alias das ging auch schneller ob das"}, {"id": 780, "start": 5393.74, "end": 5399.94, "text": "sollte ich wieder machen das war das war sehr praktisch lässt sich einfach schneller tippen"}, {"id": 781, "start": 5399.94, "end": 5408.86, "text": "als sudo ich glaube nee das mache ich nicht mehr weil es weil ich mir überlegt habe es wäre"}, {"id": 782, "start": 5408.86, "end": 5413.62, "text": "eigentlich ganz sinnvoll wenn man sudo schreiben muss dass man sich auf jeden fall immer im klaren"}, {"id": 783, "start": 5413.62, "end": 5416.82, "text": "drüber ist dass man jetzt gut rechte sich holt deswegen habe ich glaube ich wieder gelöscht"}, {"id": 784, "start": 5416.82, "end": 5434.86, "text": "oder ausrufezeichen ausrufezeichen oder something like that it's just kind of"}, {"id": 785, "start": 5434.86, "end": 5450.46, "text": "okay das finde ich cool da hätte ich nicht mit gerechnet das ist eine gute"}, {"id": 786, "start": 5450.46, "end": 5477.86, "text": "sache das ist cool das gefällt mir da hätte ich es nicht mit gerechnet dass da was kommt was"}, {"id": 787, "start": 5477.86, "end": 5482.58, "text": "mir gefällt das finde ich gut das hat das hat mehrere vorteile erstens du kannst dir sudo"}, {"id": 788, "start": 5482.58, "end": 5486.94, "text": "schreiben und ausrufezeichen ausrufezeichen und irgendwelche anderen sachen sparen und escape"}, {"id": 789, "start": 5486.94, "end": 5493.26, "text": "escape seriously das machst du nicht einfach aus versehen du kommst nicht einfach aus versehen"}, {"id": 790, "start": 5493.26, "end": 5498.86, "text": "auf escape escape und drückst dann noch enter das finde ich nice das glaubt dass das muss ich"}, {"id": 791, "start": 5498.86, "end": 5500.86, "text": "mir aufschreiben das werde ich mal ausprobieren"}, {"id": 792, "start": 5500.86, "end": 5509.78, "text": "siehst du hat es schon gelohnt sich das anzugucken das ist das ist selbst selbst wenn alle anderen"}, {"id": 793, "start": 5509.78, "end": 5517.74, "text": "allen anderen schrott ist du spammst escape häufiger ja wenn du aus dem wim raus willst"}, {"id": 794, "start": 5517.74, "end": 5526.9, "text": "oder so aber in der schelm am eintippen eigentlich nicht in der schelm ich nie escape"}, {"id": 795, "start": 5526.9, "end": 5533.26, "text": "also das finde ich gut man kann es ja wahrscheinlich sogar umlegen das muss ich mal ausprobieren das"}, {"id": 796, "start": 5533.26, "end": 5542.22, "text": "ist das klingt nice ok websearch ist useless das mache ich nicht das klingt cool dass man aus"}, {"id": 797, "start": 5542.22, "end": 5547.46, "text": "der schelm suchen kann aber nachdem man im browser also man muss ja in den browser um sich die"}, {"id": 798, "start": 5547.46, "end": 5552.14, "text": "ergebnisse anzugucken also kann man die suche auch im browser machen ich hatte auch mal in"}, {"id": 799, "start": 5552.14, "end": 5560.9, "text": "google search alias in der schelm ist komplett sinnlos wie gesagt ob du jetzt auf deine schelm"}, {"id": 800, "start": 5560.9, "end": 5566.46, "text": "gehst und eintippst das und das suchen oder markierst und dann search drückst und dann"}, {"id": 801, "start": 5566.46, "end": 5571.18, "text": "geht ein browser tab auf du musst zum browser switchen oder ob du zuerst zum browser switcht"}, {"id": 802, "start": 5571.18, "end": 5582.66, "text": "und dann sagst ich google jetzt danach du spannst immer control c ich spamme immer control c aber"}, {"id": 803, "start": 5582.66, "end": 5592.06, "text": "kein control l ja control c mache ich auch laufend says let's say i'm you know i'm sitting here and"}, {"id": 804, "start": 5592.06, "end": 5596.5, "text": "i'm like ls and i can't remember how to show well there's my auto suggestions of course but"}, {"id": 805, "start": 5596.5, "end": 5601.66, "text": "let's say i can't remember how to show hidden files and i'm like i don't know what that is let's"}, {"id": 806, "start": 5601.66, "end": 5608.18, "text": "google it so i can actually google this from the command line so i can say google ls hidden file"}, {"id": 807, "start": 5608.18, "end": 5612.66, "text": "ja das bringt nichts ihr werdet jetzt auch gleich sehen dass es nichts bringt guck mal der muss"}, {"id": 808, "start": 5612.66, "end": 5618.34, "text": "schreiben google und dann muss er in seinen browser und es kann er open a web page sisse"}, {"id": 809, "start": 5618.34, "end": 5624.78, "text": "mit just what i typed sisse das heißt der schreibt was auf der schelm danach schreibt er den such"}, {"id": 810, "start": 5624.78, "end": 5630.14, "text": "profil das heißt es ist sogar schneller ich wechsle einfach direkt in meinen browser und"}, {"id": 811, "start": 5630.14, "end": 5639.26, "text": "gibt dann hier oben irgendwas ein zum googeln google keckel emote so also das finde ich unsinnig"}, {"id": 812, "start": 5639.26, "end": 5646.34, "text": "plug in number four is copied er in this simply copies the path of your current folder to the"}, {"id": 813, "start": 5646.34, "end": 5654.78, "text": "system clipboard ok"}, {"id": 814, "start": 5660.78, "end": 5664.1, "text": "why not aber"}, {"id": 815, "start": 5664.1, "end": 5671.98, "text": "now the use case for this is let's say ich wollte gerade sagen du kannst du was geht ich"}, {"id": 816, "start": 5671.98, "end": 5686.78, "text": "wollte gerade sagen du kannst doch einfach pwd nehmen aber aber wisst ihr was cool wäre was"}, {"id": 817, "start": 5686.78, "end": 5694.78, "text": "mir gerade einfällt wisst ihr was cool wäre wenn es ein copy file name oder sowas gebe also sprich"}, {"id": 818, "start": 5694.78, "end": 5701.26, "text": "also was man ja manchmal machen muss ist man ist hier in einem verzeichnis ich mache jetzt mal"}, {"id": 819, "start": 5701.26, "end": 5707.54, "text": "das windows terminal auf so man ist hier in einem verzeichnis macht ls und jetzt würde man gerne"}, {"id": 820, "start": 5707.54, "end": 5716.3, "text": "sich den den absoluten fad zusammen bauen zu sagen wir dieser datei so und dann ist man hier"}, {"id": 821, "start": 5716.3, "end": 5726.78, "text": "am sinnlos sinnlos rumklicken das ist was cool wäre wenn man sowas machen könnte hier weiß"}, {"id": 822, "start": 5726.78, "end": 5735.66, "text": "ich copy file und dann macht er das direkt ja du kannst das rausholen ja ja aber dann"}, {"id": 823, "start": 5735.66, "end": 5757.18, "text": "müsste es immer noch nach x-clip oder so halten das das war vielleicht ganz ganz nice"}, {"id": 824, "start": 5765.66, "end": 5777.94, "text": "ok das können wir skippen das ist nix dolles was haben wir alles jetzt kommt hey jetzt kommt"}, {"id": 825, "start": 5777.94, "end": 5784.98, "text": "vielleicht sowas copy file is very similar it's called copy copy the contents ja da kannst du"}, {"id": 826, "start": 5784.98, "end": 5790.94, "text": "auch das feil ketten und nach x-clip look at plugin number copy buffer kommt dann so"}, {"id": 827, "start": 5790.94, "end": 5797.42, "text": "our sixth plugin ist wie viel copy copy dann über seine shell copy buffer this plugin binds"}, {"id": 828, "start": 5797.42, "end": 5803.74, "text": "the control keyboard shortcut and copies the text that's currently typed in the command line so"}, {"id": 829, "start": 5803.74, "end": 5809.94, "text": "files copies the text that is currently ok das stelle ich mir wiederum ganz praktisch vor"}, {"id": 830, "start": 5809.94, "end": 5816.98, "text": "hier and i wanted to cd into a b das stelle ich mir tatsächlich ganz praktisch vor du tippst"}, {"id": 831, "start": 5816.98, "end": 5823.34, "text": "du tippst irgendwas und dann und dann kopierst du das ist normalerweise müsstest du es jetzt"}, {"id": 832, "start": 5823.34, "end": 5830.54, "text": "markieren den nächsten plug ins den kopp ist in pace plug ins ja let's say i was about to do"}, {"id": 833, "start": 5830.54, "end": 5835.34, "text": "this and i was like oh man actually i gotta go back and fix something and i don't have to"}, {"id": 834, "start": 5835.34, "end": 5841.86, "text": "retype this in i can just hit control o ist ihr wisst ihr was ich dafür mache ich mache"}, {"id": 835, "start": 5841.86, "end": 5847.02, "text": "einen kommentar davor dann ist es in der history und geht dann in der history einfach drei stück"}, {"id": 836, "start": 5847.02, "end": 5852.86, "text": "nach oben wenn ich fertig bin und hab's wieder da also man kann einfach den kommentar davor machen"}, {"id": 837, "start": 5852.86, "end": 5858.06, "text": "dann wird es nicht ausgeführt aber man kann mit feil nach oben ist und wieder sich zurückholen"}, {"id": 838, "start": 5858.06, "end": 5863.34, "text": "das ist sogar besser als es zu copy pasten weil meistens braucht man sehr in der shell wieder"}, {"id": 839, "start": 5863.34, "end": 5877.98, "text": "wenn man es jetzt natürlich irgendwo anders braucht dann ok du fügst immer ein ein quad"}, {"id": 840, "start": 5877.98, "end": 5884.34, "text": "ans ende des commands und drückst es k was macht das quad am ende das kenne ich das kenne"}, {"id": 841, "start": 5884.34, "end": 5899.7, "text": "ich so in der kombination nicht was war was bringt das and let's say i cleared it i did"}, {"id": 842, "start": 5899.7, "end": 5914.98, "text": "what i need to do next directory history seven is der history das brauche ich nicht so this"}, {"id": 843, "start": 5914.98, "end": 5922.62, "text": "plug-in adds keyboard keyboard shortcut directory history ok da gibt es ja komplett fertige tools"}, {"id": 844, "start": 5922.62, "end": 5929.18, "text": "für ich muss ehrlich sagen ich benutze einfach meine normale history in meinen in meiner normalen"}, {"id": 845, "start": 5929.18, "end": 5935.62, "text": "history steht da drin steht da drinnen cd bla blub ok vielleicht relative fahnen die"}, {"id": 846, "start": 5935.62, "end": 5940.46, "text": "dann nicht funktionieren wo ich da bin ok vielleicht vielleicht ist es sinnvoll aber"}, {"id": 847, "start": 5940.46, "end": 5945.9, "text": "also nix nix was ich jetzt irgendwie keyboard shortcuts dafür mir merken möchte"}, {"id": 848, "start": 5945.9, "end": 5960.82, "text": "ach so nett ja das ist clever na besch sagt dann so nach dem motto ich mache erst was wenn die"}, {"id": 849, "start": 5960.82, "end": 5965.94, "text": "quotes geschlossen sind und dann trückst du steuerung c und dann ist es in der history wenn"}, {"id": 850, "start": 5965.94, "end": 5969.46, "text": "du nach oben gehst musst du nicht das erste zeichen löschen sondern sogar nur das letzte"}, {"id": 851, "start": 5969.46, "end": 5973.34, "text": "zeichen löschen das ist cool das ist eine gute taktik da hätte ich vielleicht gar nicht drauf"}, {"id": 852, "start": 5973.34, "end": 5983.7, "text": "gekommen zfs nicht zfs alla zf f zf ist sehr cool dass sehr cool dass tool für so suchmenus"}, {"id": 853, "start": 5983.7, "end": 5998.02, "text": "ja passiv fahnen da das kommentiert die aktuelle zeile macht dann genau das das ist das was ich"}, {"id": 854, "start": 5998.02, "end": 6006.98, "text": "auch mache ich mache ich mache ausrufe ich mache den kommentar sind also raute davor und"}, {"id": 855, "start": 6006.98, "end": 6018.54, "text": "dann habe ich in der history genauso mache ich das auch immer ok das brauche ich ok"}, {"id": 856, "start": 6018.54, "end": 6029.98, "text": "reload von der konfig datei da brauchst du doch kein also mal ernsthaft ein reload von der konfig"}, {"id": 857, "start": 6029.98, "end": 6035.78, "text": "datei dafür würde ich doch kein plugin installieren wenn ich das brauche mache ich ein alias ok ich"}, {"id": 858, "start": 6035.78, "end": 6039.74, "text": "habe auch alias dafür editieren ich habe ein alias für meine shell konfig für die wim konfig"}, {"id": 859, "start": 6039.74, "end": 6046.1, "text": "für die e3 konfig ist dann sowieso wie ev öffnet mir die wim konfig ei öffnet meine"}, {"id": 860, "start": 6046.1, "end": 6050.58, "text": "ding so aber den reload entweder mache ich den von hand relativ schnell ich meine musst ja"}, {"id": 861, "start": 6050.58, "end": 6058.5, "text": "nix anderes machen als punkt leerzeichen oder source leerzeichen basher z z z z z s h rc"}, {"id": 862, "start": 6058.5, "end": 6064.18, "text": "alternativ kann sie dann kannst du dir einfach ein alias machen reload oder so was und das ist"}, {"id": 863, "start": 6064.18, "end": 6085.02, "text": "wieder da. Eats. Das Plugin hat wahrscheinlich auch noch ein Alias, ja. History, okay. Ja und dann"}, {"id": 864, "start": 6085.02, "end": 6095.34, "text": "kannst du es entweder nach FZF, eine FZF-Pipen oder nach GREP. GREP ist auch deutlich flexibler"}, {"id": 865, "start": 6095.34, "end": 6106.18, "text": "als irgendwas anderes. Da kannst du suchen, wie du lustig bist. Das ist ja nix. Das ist ja,"}, {"id": 866, "start": 6106.18, "end": 6112.38, "text": "also 2600. Ich glaub, boah, ich muss jetzt mal gucken, was ich auf der Arbeit habe,"}, {"id": 867, "start": 6112.38, "end": 6137.34, "text": "aber wahrscheinlich über 100.000 Zeilen oder so über die letzten Jahre. Okay, du kannst, okay,"}, {"id": 868, "start": 6137.34, "end": 6146.3, "text": "du hast im Prinzip, das Plugin legt dir quasi einen Alias an für History nach GREP. Ja, kann"}, {"id": 869, "start": 6146.3, "end": 6151.42, "text": "man machen. Alternativ, ich drücke STRG-R und gebe HIST ein und dann hab ich schon was mit GREP."}, {"id": 870, "start": 6151.42, "end": 6159.78, "text": "Also, na gut, das ist, es ist useful, ja, aber da würde ich kein, was haben wir noch? JSON-Tools."}, {"id": 871, "start": 6159.78, "end": 6173.62, "text": "Okay, das könnte jetzt was interessanter sein. Das braucht man nicht. Man pipet sein JSON einfach"}, {"id": 872, "start": 6173.62, "end": 6184.74, "text": "nach JQ und ist fertig. Das war's. Man braucht dafür kein Plugin. Next. Bonus für Back. Okay,"}, {"id": 873, "start": 6184.74, "end": 6192.94, "text": "ich muss sagen, das mit sudo fand ich cool. Der Rest ist relativ, ich meine, das sind ja seine"}, {"id": 874, "start": 6192.94, "end": 6197.86, "text": "Lieblingsplugins. Da kann ich jetzt nichts zu sagen, aber der Rest erscheint mir relativ unsinnig."}, {"id": 875, "start": 6204.86, "end": 6209.02, "text": "Fünf Stunden Linux Server. Leute, das kommt jetzt nicht an. Ich will bloß mal gucken,"}, {"id": 876, "start": 6209.02, "end": 6218.86, "text": "was die da machen. Alter, wie alt ist denn das schon? Ah nee, das ist ein Fedora. Kein Wunder,"}, {"id": 877, "start": 6218.86, "end": 6236.58, "text": "dass das so alt aussieht. Das ist ein Ubuntu. Okay. Fünfeinhalb Stunden Linux Server Kurs. Ich"}, {"id": 878, "start": 6236.58, "end": 6249.82, "text": "meine, wenn der was taugt, kostenlos, ist das Hut ab erst mal fürs Aufnehmen. Zeig mal JQ."}, {"id": 879, "start": 6252.46, "end": 6256.62, "text": "Du hast den JSON, das pipest du nach JQ und dann kommt es schön formatiert raus."}, {"id": 880, "start": 6256.62, "end": 6272.9, "text": "Du benutzt PowerShell unter Archlinux. Ja, kann man machen. Ich meine, das Ding ist mittlerweile"}, {"id": 881, "start": 6272.9, "end": 6281.3, "text": "cross-Plattform verfügbar und PowerShell ist eine wirklich coole Automatisierungs-Shell. Muss aber"}, {"id": 882, "start": 6281.3, "end": 6287.74, "text": "sagen, als interaktive Shell zum täglich benutzen und drinnen tippen, gefällt mir PowerShell nicht."}, {"id": 883, "start": 6289.74, "end": 6294.46, "text": "Da finde ich es zu umständlich. Und da finde ich den klassischen Shell-Ansatz mit Pipes zwischen"}, {"id": 884, "start": 6294.46, "end": 6301.02, "text": "Programmen, wo einfach der Text durchgeht, sogar angenehmer. Für irgendwelche Automatisierungen"}, {"id": 885, "start": 6301.02, "end": 6309.02, "text": "oder so ist PowerShell eine super Geschichte. Wobei ich viel zu wenig Automatisierung in dem"}, {"id": 886, "start": 6309.02, "end": 6313.82, "text": "Sinn habe, auf meiner Linux-Kiste, dass ich PowerShell lohnen würde. Ich habe ein paar"}, {"id": 887, "start": 6313.82, "end": 6318.3, "text": "Bash-Skipps, die ein paar Sachen machen, so Hintergrundsätzen oder so, aber das war es auch."}, {"id": 888, "start": 6324.3, "end": 6331.46, "text": "Also PowerShell bin ich kein großer Fan von für täglich benutzen, aber wenn es für dich gut"}, {"id": 889, "start": 6331.46, "end": 6336.66, "text": "funktioniert. Ich sage ja, es macht überhaupt keinen Sinn, irgendwelche Tools oder Hersteller"}, {"id": 890, "start": 6336.66, "end": 6341.1, "text": "unnötig zu fanboyen. Man sollte das nehmen, was am besten funktioniert. Und das kann durchaus"}, {"id": 891, "start": 6341.1, "end": 6349.58, "text": "auch was von Microsoft sein. Oh Leute, es ist 22 Uhr, fuck. Ich habe gehabt, wir haben noch Zeit."}, {"id": 892, "start": 6353.34, "end": 6354.3, "text": "So, jetzt sehen wir mal gucken."}, {"id": 893, "start": 6354.3, "end": 6366.86, "text": "3D Drucker schreibt meine Hausaufgaben. Microservices sind überbewertet."}, {"id": 894, "start": 6370.86, "end": 6378.86, "text": "Das ist ungefähr, wenn ich so sage, PC-Gehäuse sind überbewertet. Eiswürfel sind überbewertet."}, {"id": 895, "start": 6378.86, "end": 6384.54, "text": "Es kommt auf den Kontext an. Also ja, man muss nicht alles als Microservice machen. Das ist"}, {"id": 896, "start": 6384.54, "end": 6389.9, "text": "sogar relativ blöd, alles auf Teufel komm raus, als Microservice zu machen. Ich meine,"}, {"id": 897, "start": 6392.9, "end": 6398.42, "text": "warum sollte ich zum Beispiel das Programm, was mir meine Emotes anzeigt, als Microservice machen?"}, {"id": 898, "start": 6398.42, "end": 6403.34, "text": "Das ergibt keinen Sinn. Das ist eine Desktop-Anwendung mit ein bisschen HTTP-Requests,"}, {"id": 899, "start": 6403.34, "end": 6413.18, "text": "dass ich es auch vom zweiten Rechner aus bedienen kann. Manchmal macht es Sinn und"}, {"id": 900, "start": 6413.18, "end": 6424.98, "text": "manchmal nicht. Ganz einfach. Man darf auch nicht vergessen, wenn man alles als Microservice macht"}, {"id": 901, "start": 6424.98, "end": 6429.62, "text": "und jeden Furz auslagert, da blickt ja kein Sau mehr durch. Das macht es ja auch unnötig"}, {"id": 902, "start": 6429.62, "end": 6433.82, "text": "von der Architektur her oftmals kompliziert. Also wenn es eine simple Anwendung ist,"}, {"id": 903, "start": 6433.82, "end": 6439.06, "text": "sodass das gar nicht erforderlich ist. Eine auch komplexere Anwendung muss nicht zwangsläufig sein."}, {"id": 904, "start": 6446.22, "end": 6452.5, "text": "Das macht es auch teilweise deutlich schwieriger zu finden jetzt, wo irgendwelche Abhängigkeiten"}, {"id": 905, "start": 6452.5, "end": 6459.7, "text": "und Bugs sind, weil das alles das triggert das, das triggert das und das triggert dann das und an einem Service davor"}, {"id": 906, "start": 6459.7, "end": 6465.22, "text": "ist dann vielleicht ein Zeichen reingekommen, was da irgendwo ein Fehler auslässt. Ja,"}, {"id": 907, "start": 6465.22, "end": 6468.18, "text": "das macht es unnötig kompliziert, aber es kommt halt drauf an, was man machen will."}, {"id": 908, "start": 6468.18, "end": 6485.5, "text": "Das kommt ganz drauf an, was man hat, sage ich ja. Es gibt nicht die Anwendungsarchitektur,"}, {"id": 909, "start": 6485.5, "end": 6489.34, "text": "die einfach für alles immer gut ist. Man muss gucken, was man machen muss."}, {"id": 910, "start": 6489.34, "end": 6496.5, "text": "Dashboard für die Heizung. Tja, ich habe keinen Dashboard mehr für meine Heizung."}, {"id": 911, "start": 6496.5, "end": 6502.34, "text": "Ich habe es jetzt nur noch im Home Assistant drin. Ich habe keine Heizungshistory mehr im Grafana."}, {"id": 912, "start": 6509.38, "end": 6516.38, "text": "Aber neun ist 22, ich muss pennen. Woop. Sleep muss ich jetzt machen."}, {"id": 913, "start": 6516.38, "end": 6529.7, "text": "Ja, warum habe ich das eigentlich noch nicht, als die Mode drinne. Was, was genau habe ich"}, {"id": 914, "start": 6529.7, "end": 6550.94, "text": "hier offen? Was passiert, wenn ich zwei Bilder auswähle? He? Or item selected. Leute, ich"}, {"id": 915, "start": 6550.94, "end": 6557.7, "text": "verstehe den Sinn von Windows Anwendungen wieder nicht. Ok, ich könnte jetzt die selecten"}, {"id": 916, "start": 6557.7, "end": 6576.5, "text": "und dann könnte ich mir die in groß angucken oder wie. Guck mal, das ist fast schon Animation."}, {"id": 917, "start": 6587.7, "end": 6598.58, "text": "Du verstehst den Sinn nicht hinter zwei Kontext Menüs. Du meinst, dass du das hier hast. Tja,"}, {"id": 918, "start": 6598.58, "end": 6603.54, "text": "das liegt daran, weil das hier ein neues Menü ist und Microsoft dachte, oh, das neue ist viel"}, {"id": 919, "start": 6603.54, "end": 6609.66, "text": "cooler. Allerdings ist das wahrscheinlich irgendeine UWP-App oder so und die ganzen alten"}, {"id": 920, "start": 6609.66, "end": 6614.86, "text": "Programme, die sich hier drin integrieren, die sind natürlich nicht hierfür angepasst. Vielleicht"}, {"id": 921, "start": 6614.86, "end": 6623.22, "text": "geht das gar nicht richtig. Deswegen mussten sie das alte noch mitliefern. Was das ist? Microsoft"}, {"id": 922, "start": 6623.22, "end": 6631.46, "text": "Schrott. Dass es das überhaupt gibt. Ich verstehe nicht, warum man nicht einfach das alte Menü ein"}, {"id": 923, "start": 6631.46, "end": 6641.22, "text": "bisschen schöner designt hat, weil er hätte das ja durchaus ein bisschen 2023 mehr machen können."}, {"id": 924, "start": 6641.22, "end": 6647.22, "text": "Ja, größere Schrift und vielleicht hier ein bisschen, man die Icons skalieren dann"}, {"id": 925, "start": 6647.22, "end": 6651.9, "text": "vielleicht nicht richtig. Das hätte man alles machen können, aber so. Das ist wirklich wieder"}, {"id": 926, "start": 6651.9, "end": 6660.94, "text": "die billigste Lösung, die eingefallen ist. Leute, ich gehe jetzt aber ins Bett. Wir sehen"}, {"id": 927, "start": 6660.94, "end": 6671.58, "text": "uns morgen. Bis dann. Macht's gut. See you."}]}