{"text": "Hallo, ich bin auch wieder da, relativ, ja ja ich wollte es gerade sagen, relativ oft bin ich da. Aber ich sage euch Leute, heute war echt kein sonnlig toller Tag. Du bist endlich als Software-Hardware-Ingenieur angestellt, was macht man denn als Software-Hardware-Ingenieur? Also Software-Ingenieur kann ich mir vorstellen, Hardware-Ingenieur kann ich mir vorstellen, was macht denn ein Software Hardware-Ingenieur, der macht alles, alles in einem. Äh warte mal, ich muss glaube ich meine Lautstärke richtig einstellen. Naja, ist richtig, richtig, ja ja ich hatte ja auch kein Teams-Offen, alles from scratch. Erstmal enjoyen, dann enjoye mal, Low-Level-Fullstack, also quasi so ein STM32-ESP32-Fullstack. Achso, ok, ah jetzt verstehe, was du meinst, du kümmerst dich um die Software für irgendwelche Microcontroller-Geschichten oder Beispiel für irgendwelche Industriesteuerungen oder für irgendwas im Auto oder sowas in der Richtung. Echt jetzt, nee das kann nicht sein, im Dezember muss ich doch mehr gestreamt haben. Na gut im Dezember habe ich viel gemacht, im Dezember habe ich auch, habe ich immer richtig, richtig viel aufgeräumt, ich habe wieder MMO-Kreisel-Kreit gemacht und alles mögliche. Steuerung, Steuerung-Krete für E-Autos, ok, ich glaube dir das, ich glaube dir das, du weißt das generell, wissen das die Zuschauer wahrscheinlich besser als ich selbst. Leute, ich muss euch was erzählen, und zwar, ach Quatsch, ich bin im falschen, ich bin im falschen, falschen Browser. Wir haben doch im letzten Stream, nee das stimmt gerade nicht, im vorletzten, im vorletzten Stream, stimmt gerade nicht, ja ja Max ist gut, wir haben doch im vorletzten Stream uns doch mit dieser Emulator-Kiste hier beschäftigt, ja, ihr erinnert euch, ich habe jetzt noch ein bisschen rumgebastelt und soll ich euch was sagen, oder was heißt, was heißt soll ich euch was sagen, ich kann es euch sogar zeigen wenn ihr wollt, da muss ich aber erstmal anschließen wie dafür, weil ich habe die Kiste vorher abgemacht, ich kann es euch mal zeigen, ihr werdet, ihr werdet, ihr werdet staunen werdet ihr, staunen. Ich schließe die Kiste mal kurz an, ihr werdet staunen, ihr werdet progerieren, ich hoffe ich schmeiße jetzt nichts runter, weil ich brauch da Stromkabel, Stromkabel brauche ich, Stromkabel, Netzwerkabel, oh fuck, HDMI-Kabel, ich habe es leider abgestöpselt alles wieder, HDMI, Netzwerkabel, wo ist das HDMI-Kabel, ich zeige, ich zeige es euch, zeigen ist besser als, oder wie zeigen ist besser als tausend Worte oder irgendwie sowas, ich zeige es euch, ihr werdet, ihr werdet proggen, oh Capture-Karte dran, hätte ich mir selbst nicht gedacht, dass das so gut funktioniert, Capture-Karte dran und jetzt den Xbox-Controller dran und ich glaube dann ist gut, so jetzt kann ich einschalten, Activate, alles klar, Achtung, passt mal auf Leute, Elgato, Elgato-Stellz, die aus irgendwelchen Gründen nicht funktioniert, ah jetzt, okay, wow, wow, wow, viel zu laut, pass mal auf, pass mal auf, ihr werdet, ihr werdet proggen, ah no signal, nice, also erstmal, Xbox funktioniert, Xbox Emulation funktioniert, leider nicht upscaled, nur normal, ich habe jetzt ein richtig schönes Übersichtsmenü, wenn du zum Beispiel ein Super Nintendo aufmachst, kriegst du sogar Videovorschau von manchen Super Nintendo Games, die in der Collection sind, N64 kriegst du Vorschau von der Collection und jetzt kommts, jetzt kommts, aber haltet euch mal fest, na, das Switch und PS3 läuft weiter, und Switch, und Switch, passt mal auf, ihr hört glaube ich den Sound, ich höre den Sound jetzt nicht, ich hoffe es ist nicht zu, ja die Ladezeiten sind mit dem Walken-Treiber ein bisschen, bisschen im Arsch, die Ladezeiten sind definitiv schlechter als auf der echten Switch, das ist Bartos Zera, Bartos Zera, aber der Switch Emulator, den muss man zusätzlich installieren, ja, ich besitze übrigens den Switch und ich besitze auch Link's Awakening, ich besaß das sogar schon auf dem Game, nein nicht Wing Wing, wirklich, ernsthaft, no cuppa, ich hab das sogar schon auf dem Game Boy, auf dem Game Boy war das, ich hatte sogar auf dem Game Boy und dem Game Boy Color, ok, Achtung, jetzt pass mal auf, wie gut das läuft, ok, es ist auf Französisch, weil ich noch nicht gecheckt hab, wie man die Sprache umstellt, aber es ist erstmal egal, Commencer, pass mal auf, seht ihr wie gut und flüssig das läuft, am Anfang ruckelst du ein bisschen wie auf der original Switch, das läuft besser als auf der originalen Switch Leute, das sieht besser aus und läuft besser als auf der Switch, ok ich hatte ein paar Grafikfehler, dem Kettenhund fehlt der Kopf, ich spiele es gerade mit dem Xbox 360 Controller, also extrem nice oder, leider, leider hat's der Switch Emulator keinen, keine Performance Overlays, sonst könnte ich es euch zeigen, also andere Games haben Performance Overlays, der hier leider nicht, aber was auch mega ist, kommt mal Gamecube, Double Dash, ihr habt Hintergrundmusik, ja ihr habt Hintergrundmusik und Ingame Musik glaube ich, ja ich mach die Hintergrundmusik, ich hab selbst keine, Moment ich muss es mal so einstellen, dass ich selbst was höre, guckt euch das mal an, ich hab hier unten jetzt die Performance Overlay Geschichten aktiviert und das ist jetzt Double Dash in 1080p, guckt mal wie gut das aussieht, pass mal auf, guckt mal wie gut das aussieht, beide, beide Emulatoren, das wo die Spiele besser unterstützt werden, das sieht besser aus als ein Switch Gamer, da kann man nix sagen oder, also das ist ein fucking Gamecube Spiel, das sieht mega aus für ein Gamecube Spiel oder und guckt euch mal die Performance an, guckt euch mal die Performance an, extrem Porgers, ihr seht unten links, das hat konstante 60 FPS, ja und es hat, es lastet im Endeffekt nichts aus, ich könnte sogar noch, ich könnte sogar, also bei der Auslastung, könnte ich theoretisch sogar noch, noch ein bisschen mehr einschalten, ich könnte sogar noch hier hergehen und sagen, ja, wir machen jetzt, wir machen jetzt, wir rennen jetzt in 1044p und machen sogar noch, keine Ahnung hier, Texture Filtering und Anti-Alasing an, so, hier, ok da gehen wir mal runter auf 1080p mehr, ok gucken wir mal ob das jetzt läuft, bin ich mal gespannt, also das sollte es eigentlich jetzt nicht mehr packen, 1440p und, aber mal gucken, mal gucken, ich bin gespannt, das letzte was wir rausprobieren, eigentlich wollte ich heute kein Gaming Zeug machen, aber ich mein, das ist, guckt mal wie gut das aussieht, das ist ein Gamecube Spiel man, da kann man sich echt, da kann man aber gar nichts sagen, oder? Ok, jetzt packt es die 60fps nur noch, nur noch mit kleinen Slowdowns, ich merke schon, es dippt, es dippt zwischendurch ein bisschen, aber hey, ich mein, guckt euch das mal in Pause an, das ist, guck mal, das hält sogar die 60fps mit 1440p, Anti-Alasing und Texture Filterung, das sieht besser aus wie die meisten Switch Games, ah, aber bei der Auflösung merke ich ein leichtes Input-Lag und die Steuerung spackt ein bisschen, Nintendo Switch Online, nein, das geht natürlich nicht, das geht natürlich nicht, Nintendo Switch Online funktioniert natürlich nicht, das wäre es jetzt auch, Omega Lul, du kannst da kein Splatoon drauf spielen und online cheaten oder sowas damit, sowas würde ich aber auch nicht empfehlen, was soll der Scheiß, nur Singleplayer, du kannst, ältere Konsolen kannst du, kannst du spielen, ältere Konsolen kannst du spielen, sogar mit, sogar mit Netzwerk-Multiplayer, ich bin mir aber nicht sicher, ob Online-Netzwerk-Multiplayer, wahrscheinlich wenn du einen Port weiterleitest, aber es gibt ja auch so Game-Server, zumindest gab es da früher so Games-Server für alte Spiele, wo man online zusammen spielen konnte mit Matchmaking und sowas, nee, das hat so gut wie kein Delay, wenn du die emulierten Sachen spielst, also mega, mega nice. Stream Delay, Quatsch, Stream Delay, kein Stream Delay, wo sollten wir Stream Delay haben, aber es ist richtig, also hättet ihr ernsthaft gedacht, dass die Switch in 1080p mit 60 FPS läuft und dass du im Endeffekt sogar noch die Möglichkeit hast, ein paar Sachen anzuschalten, sodass es dann sogar besser aussieht als auf der originalen Switch, also das hätt ich nicht gedacht. Übrigens, PS3 funktioniert auch, allerdings funktioniert die PS3 nicht performant genug, also ich hab's mit Uncharted ausprobiert und Uncharted läuft, womit's 15-20 FPS, je nachdem, was man einstellt auch ein bisschen mehr, aber nicht, dass es gut ist. Wie fandest du meinen Gameboy Asp- Du hast mir was geschrieben? Also, den letzten Tweet, ich hab, den letzten hab ich am 28. Januar gekriegt, als Antwort, ja keine Ahnung, ja Moment, ich spiel das doch nicht auf meinem Desktoprechner, ach das, das hab ich gesehen, ja das ist ja schon 5 Tage her oder so, das war cool, das hab ich gesehen, das war nice, ich hab aber nicht gedacht, dass du's wirklich gemoddert hast, ich dachte, das ist irgendwie so ein Mean-Bild, was du reingeschnitten hast, ich dachte nicht, das ist echt, doch doch, das musst du gleich, das hab ich gesehen, aber das ist ja schon 5 Tage her oder so, das war doch vor dem Wochenende glaube, das hab ich nicht sogar geliked, das machen wir heute übrigens nicht. Kennt jemand IP-Überwachungskameras ohne irgendeinen Cloud-Registrierungs-Quatsch? Ja, also suchst du teure oder billige, wahrscheinlich billige, weil teure gibt's in Massen, was ich selbst, was ich selbst habe, sind Amazon Reolink Kameras, also die versprühen jetzt nicht gerade super hochwertige Qualität, aber die funktionieren, also nicht alle, aber die meisten funktionieren rein lokal, also zum Beispiel, ich glaube, das könnte sogar sein, wo ich eine von hab, möglich, möglich, dass ich darf, also so eine, die so ähnlich aussieht, habe ich, die funktioniert rein offline und ich hab auch noch von denen sowas in der Richtung mit zum schwenken, da weiß ich aber aus dem Kopf nicht welches, die funktionieren rein, die kannst du nicht flashen, aber die funktionieren rein offline mit RTSP, was ist hier wieder, Booba Vorschlag, die funktionieren offline rein mit RTSP, hast du die rund ums Haus, ja, also ich hab, lass mal überlegen, wo hab ich Kameras, das einzige, die machen halt keinen super hochwertigen Eindruck, ja, also ich hatte auch eine, die ist mir verreckt nach irgendwie einer Woche, die hab ich dann wieder zurück zu Amazon geschickt, also ich hab, lass mal überlegen, wo hab ich, ich mach einfach mal auf dem zweiten Bildschirm kurz die Kamera übersicht auf, da kann ich euch sagen, wo ich Kameras hab, wo ich dann den Kopf überlegen, also ich hab einmal im Keller eine hängen, also das ist eine geflashte, das ist keine Reolink Kamera, das ist eine geflashte alte Wyzecam, die zeigt mir den Wasserdruck von der Heizung an, da hab ich noch nichts Gescheites gefunden, wie ich das, ne, das verwende ich nicht, das verwende ich gar nicht, die Oberfläche, ich hab's mittlerweile direkt in HomoSystem integriert, so, den Wasserdruck von der Kamera, dann hab ich einmal das Katzenklo von oben, also ich, also, ich hab ja zwei Katzenklos, das obere Katzenklo hat eine Kamera drüber hängen am Schrank, Probleme mit der Heizung ab und zu mal, jetzt mittlerweile schon nicht mehr, seitdem ich das Heizungsprofil richtig eingestellt hab, am Schrank überm Katzenklo, dass ich weiß, wenn die Katze mal wieder geschissen hat, äh, unten am Eingang beziehungsweise im Flur, auf der Terrasse im Hof hab ich eine, die ist schwenkbar, dass ich quasi Hof und Terrasse mitbekomme, dann hab ich eine, äh, zum Hoftor und eine für das Hoftor, Kameras auf dem Klo, ja, aber nicht auf meinem Klo, auf dem Katzenklo, denn die ist, es ist nicht so, dass ich unbedingt scharf drauf wäre, meine Katze beim Kacken zu beobachten, also ist aber gut zu sehen, wenn sie drauf war, weil wenn die Katze drauf war und du nicht schnell genug bist, kommt sie an und erzählt dir, dass du nicht schnell genug gewesen bist. Hast du auch welche, die Audio übertragen? Ja, ich glaub, die ganzen Reolink Kameras können Audio übertragen, das benutze ich aber nicht. Hab ich auch direkt, äh, nicht weitergeleitet, den Audio Stream, brauch ich nicht, brauch kein Audio. Das Einzige, wo ich Audio brauche, ist, äh, theoretisch, ist die Tür-Gengen-Sprechanlage und die hatte ich mal eine Weile angezapft über so eine Siedle, Siedle, äh, ja, so ein Siedle-Smart-Dingsgerät, was ich mir auf Ebay gekauft hab, aber ich hab festgestellt, ich benutze diese Gegensprechfunktion nie, also ich benutze die Gegensprechfunktion, wenn ich daheim bin, von den zwei Telefonen, also von den zwei Tür-Gengen-Sprechanlagen, die an der Wand hängen, aber dieses Weiterleiten aufs Handy, äh, und aufs Deck-Telefon hab ich nie benutzt, deswegen hab ich's wieder abgebaut. Das Einzige, was ich jetzt habe noch, ist, wenn eine klingelt an der Haustür, dann ruft sie mich auf dem Handy an, aber nicht, dass ich mit ihm reden kann, sondern bekomme ich per SIP ein Video-Feed geschickt von meiner, äh, Kamera an der Eingangs-, ähm, am Hoftor, dass ich sehe, wer davor steht, auch wenn ich unterwegs bin, also wenn ich Bock hab, kann ich aufm Handy annehmen und dann seh ich, wer vor der Tür steht, aber selbst das werd ich wahrscheinlich abschaffen, weil das benutze ich auch viel zu wenig, als dass sich, wie die Existenzrecht fertigt, ne? Wir haben halt gar kein Tür-Gengen-Sprechanlage, achso, ja, das stimmt, wobei ich mich auf die Qualität nicht so, na, weiß nicht, sag mal, kann sich, kann sich die Musik mal entscheiden, wie laut die jetzt sein möchte? Ich bin ja zu leise, die, die, die wissen's nicht. Also die Qualität dieser Reolink-Kameras und Mikrofone zum Hören vielleicht, aber zum Gegensprechen, zumal das Gegensprechen auch nur mit der offiziellen App funktioniert. Wir haben zwar mal das Reolink-, ne, ne, das war kein Reolink-, Hickwishen war das. Wir haben mal, falls sich noch jemand dran erinnert, wir haben mal im Stream die Hickwishen-, das Hickwishen-Gegensprech-Protokoll reverse-ingeniert, Achieve Wubblers, hier, Hickwishen-, ne, Tür, nur ganz kurz, lull, Türklänge plus Audio, japp, japp, japp, japp. Ist es das? Ne, das ist die SIP-Geschichte, ähm, Smarted, Tü, Tü, Tü, Tü, Tü, vor zwei Jahren mehr als ein, ja, fängt gut an, ne, da hab ich irgendwas gebastelt, dann weiß ich nicht mehr, wir haben irgendwo, wir haben irgendwann mal das nachgebaut von Hickwishen, dieses Rücksprache-, also Gegensprech-Protokoll, das war auf ein, auf HTTP-basierendes-, ne, wie kann man das am besten umschreiben? Es basierte zum Teil auf HTTP, soll ich mal nach-, Gegensprech-Anlage könnte man tatsächlich suchen, ja, das stimmt, China-Kamera-Hexhorn, Gegensprech-Anlage, ja, genau, das ist es, Alter, wie, wie, Modge-, Modge-Five-Hair-Time, guck, das, das haben wir damals gebaut, weiß ich, wo man die Anwendung irgendwo sieht, ach ja, die Katze, die Katze, wo haben wir dann übertragen? Ja, hier sieht man, hier sieht man das Kamerabild, Alter, wie lange haben wir das dann rumgemacht? Fünfeinhalb Stunden, Mann, das war so eine hässliche Klingel, genau, die habe ich nie benutzt, jupp, okay, keine Ahnung, aber irgendwo hier haben wir das nachgebaut, so, und das war ein ganz furchtbar ekliches Protokoll, das basierte auf HTTP, allerdings hat es nicht HTTP direkt gesprochen, also es hat einen HTTP-Request gemacht und dann, wenn normalerweise die Verbindung abgebaut wurde, hat es über TCP dann die Sprachdaten geschickt, also es hat irgendwie einen TCP-Handshake gemacht, irgendwie einen HTTP-Get und danach hat es dann über TCP-Raw-Socket irgendwelche Daten gepusht, das war ein absolut standard-, nicht-standard-konformes China-Chinesen-Müll-Protokoll, was die sich da ausgedacht haben, das konnte sich nur hickwischen irgendwie, ausdenken, ja, da kann ich mich auch dran erinnern, das war so kaputt, dass man den normalen C-Sharp-HTTP-Klein nicht verwenden konnte, weil das nicht richtig war, da hatten die Verbindungen immer geclosed, und man durfte die Verbindungen nicht closen, danach ging es dann weiter, ganz, ganz ekliches Zeug, ich erinnere mich dunkel dran, ganz, ganz ekliches Zeug, ganz schlimm, ja, also so sieht es aus, ich weiß nicht, wie sind wir da jetzt eigentlich drauf gekommen, gab es sich letztens ein Video, wo eine Kamera versprochen hat, nichts zu sehen, ein paar Bayer-Sharp-HTTP, die sogar die Gesichtserkennung nach China funkt, ja, das wundert mich nicht, also was relativ mittelgroßer Skandal war in dieser Runde, war die Wisecam-Kameras, wo Streams theoretisch für jeden einsehbar öffentlich im Internet gingen, über irgendwelche China-Server, die haben gesagt, alles super secure und verschlüsselt, und irgendjemand hat den China-Control-Server gefunden, weil die selbst irgendwelche China-Cloud-Services verwenden, und da konnte jemand, der den Server kannte und die richtigen URLs aufgemacht hat, quasi jede Kamera, sich von jedem auf der Welt, der das über die Cloud schickt, angucken, ich war natürlich nicht betroffen, weil ich meine Kameras geflasht habe, wo wir wieder dabei sind, du kannst den Herstellern halt absolut nichts trauen, manchmal glaube ich, die Hersteller wissen es selber nicht und lassen sich halt von den eigentlichen Produzenten dieser Kameras zuschwätzen, ja, Euphie war letztens, Euphie war letztens, was ich meine, das ist Wisecam-Skandal-Suchen, ja, schon wieder, ja, das, das, das, Major Wisecam-Security-Floor, easily allowed hackers to access stored videos, ja, ja, du konntest aber auch schon, du konntest, das ist auch schon 3er her, also ganz im Ernst, die Leute lernen es nicht, gell, das ist das gleiche, das ist das gleiche wie mit Cloud-Passport-Managern, die lernen es einfach nicht, bei jedem Preach oder bei jedem, bei jedem Sicherheitsproblem freuen sich die Leute, das ging aber nochmal gut, entweder waren meine Daten nicht dabei oder sie waren ja wenigstens noch verschlüsselt oder sonst was in der Richtung, und die Einschläge kommen immer näher und die Leute reden sich das schön und irgendwann betrifft es dann halt mal ihren gewählten Cloud-Passport-Manager und dann, dann fallen sie aus allen Wolken so, wie, meine Passwörter in der Cloud speichern war doch keine so gute Idee, ja, das wundert mich jetzt aber, da sind die Leute wirklich selbst dran schuld, also wer seine Passwörter in der Cloud speichert, ich, ich, ich werde, ich werde jetzt nie verstehen, wie man das machen kann, also ich werde jetzt, doch, doch, ich verstehe, wie man das machen kann, weil, weil es komfortabel ist und sich automatisch quasi so sünkt auf alle Geräte, ohne wirklich zu sünken, weil alle auf den gleichen Datenbestand zugreifen, aber ich würde nie im Leben meine Passwörter in der Cloud speichern, nie, bei irgendeinem Anbieter, das einzige, was eventuell in Frage kommt, wäre, wenn ich wirklich meine Passwörter unterwegs brauche, dann würde ich die selbst verschlüsseln und nur den Teil der Passwörter, die ich unterwegs brauche, verschlüsselt auf irgendeinen Cloud Drive legen, wenn es unbedingt sein müsste, am besten auf irgendeine eigene Kiste, aber am besten, es ist, es ist wie mit allem, wenn man seine Daten nicht irgendwie rausgegeben hat, dann kann einem auch nichts passieren, ja, ja, da gab es auch letztens bisschen Diskussionen, dass Bitworn Server-seitige Rotations nichts bringen und sowas, ich erinnere mich, kann man, kann man alles machen, kann man alles machen, also wisst ihr, was ich mache, also wie ich das handhabe bisher, mit Accounts, wo ich die Passwörter mobil brauche, ich tippe die einmalig ein und speicher sie in dem Passwort-Save von meinem iPhone, kann man sich jetzt fragen, traut man Apple oder nicht, nein, ich traue Apple auch nicht, aber das sind meistens jetzt nicht so die, also wenn ich sie speichere, wenn ich sie speichere, dann sind das meistens eh nicht so die aller wichtigen Sachen und ansonsten, also Scalable zum Beispiel, habe ich, habe ich gespeichert im Handy, ja, weil ich sonst den Mist immer wieder eingeben muss, aber Scalable, ja, es könnte einer meine Stunks verkaufen, aber da mache ich mir jetzt weniger Gedanken drüber, ansonsten habe ich wichtige Sachen eigentlich nicht gespeichert auf dem Handy, das habe ich einmalig eingegeben, dass die App sich, Amazon zum Beispiel, Amazon habe ich einmalig autonifiziert auf dem Handy und dann ist gut, reicht, geh wieder auf YouTube, ja, Bubatime, YouTube meint, das sollen wir unbedingt gucken, aber das juckt mich nicht, das juckt mich nicht, ob jemand einen Song für Amorant gemacht hat, der J-Lore geht wieder ab, Alexi Bexy Video, ich habe nichts persönlich gegen den, ich kenne ihn nicht, wir haben uns nie irgendwo gesehen, aber ich mag seine Videos einfach nicht, ich kann mir das nicht angucken, was können wir uns dann angucken, ich habe übrigens ein interessantes Video, ein interessantes Video gefunden und zwar das hier, Ackerman Kram, der berichtet über exakt das, was ich auch erzählt habe in meinem Video, fällt euch, Moment, Moment, kommt euch, was ist das denn, kommt euch diese Mail irgendwie bekannt vor, habt ihr, habt ihr sowas ähnliches schon mal gesehen, also falls ihr mein Video gesehen habt, also ich bin, ich bin anscheinend nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Was ist das für ein, für einen Window-Manager? Is my new desktop. Descope. Mein Vater hat früher immer gesagt, Descope. Ich glaube, der weiß bis heute nicht, dass es Desktop heißt. Descope. A real desktop. Descope. Descope. Descope. Descope. Descope. Ranking Linux Environments. Oh ne, oh ne. Das ist der Firefox Dude, oder? Das ist doch der Firefox Dude, der in einem Video erzählt hat, dass er es nicht mehr irgendwie vertreten kann, Firefox zu benutzen. Und dann hat er zwei Wochen später ein Video gemacht, ich benutze wieder Firefox. Das ist einfach fett, das ist er doch, oder? Sekunde. Äh, hatte YouTube nicht mal einen Suchenknopf? Firefox. Hier, I'm leaving Firefox. Genau, I'm leaving Firefox. Und dann hat er einen Monat später ein Video gemacht. Was not fun, er ist wieder bei Firefox zurück. Alles klar. Vor allem, seriously, der wollte diesen reudigen Gnome-Default-Browser, der wollte diesen reudigen Gnome-Default-Browser, der wollte diesen reudigen Gnome-Default-Browser verwenden, was jedem von uns im Stream sofort klar war, dass das nicht funktionieren würde. Das heißt nicht nur, dass man sowas nicht probieren kann, aber in dem Fall, es gibt doch keinen nennenswerten Browser neben Firefox und Chrome. Ich warte jetzt drauf, bis die Apple-Fanboys kommen. Das sind alles, das ist alles Chrome, Leute. Brave ist Chrome, Opera ist Chrome, Edge ist Chrome, das zählt für mich alles rein. Aber hier hat er recht. Was ist denn mit Safari? Tja, Safari taugt leider nix. Liebre Wolf ist Gecko, ja, dann ist es Firefox. Ich sagte doch, es gibt keinen nennenswerten Browser neben Firefox und Chrome. Safari ist... Müll. Safari ist, was Web-Standards angeht, so weit hinten dran, aus mehreren Kombinationen. Ich bin mir gar nicht so sicher, woran es geht. Einmal möchte Apple einiges nicht unterstützen, weil Apple beispielsweise sowas wie PWAs halt nicht mag auf dem iPhone. Weil halt im Zweifelsfall die ein bisschen Konkurrenz machen zu... ihrem App-Store. Was ist denn das? Oh, das hab ich auf Hacker-News gelesen. Das hab ich auf Hacker gelesen. Carbon... Carbonöl. Das ist... Docker Run... Okay. Das probieren wir jetzt aus, Leute. Docker Run... Things... Bam. Wir gucken uns jetzt... Wir gucken uns jetzt YouTube im Terminal an. YouTube in Docker im Terminal. Und wisst ihr, was das Schlimme ist? Das funktioniert auch noch halbwegs. Guckt euch das mal an. Das funktioniert auch noch halbwegs. Guckt euch das mal an. Das funktioniert. Vollständiges YouTube im Terminal. Ohne Ads? Nee, mit Ads. Ich mein, mein, mein... Man erkennt den Channel. Was ist das? Das ist Carbon... Carbonöl. Irgendjemand hat... hat Firefox... Nee, Chrome? Weiß ich gar nicht. Was hat er genommen? Chrome. Der hat irgendwie einen neuen Renderer eingebaut in Chrome oder sowas. Und hat halt als Output... was genommen, was man auch im Terminal rendern kann. Komm mal, jetzt können wir uns Werbung... Pixelated YouTube Werbung angucken. Porgas. Ey, gut, Sound haben wir hier nicht. Alles klar, oder? Settings... Also Text und so wird wirklich gut gerendert, kann man nichts sagen. 1044p. Nee, Leute, wenn man das weiß, dass es Battlefield 4 ist, könnte man dazu geneigt sein, zu erkennen, dass es Battlefield 4 ist. Oder? Also wenn man es weiß, wenn man es nicht weiß, erkennt man es ehrlich gesagt nicht. Ja. So kann ich sogar Booba-Videos gucken im Stream. Ja. Da könnte ich sogar auf Pornhub und man würde nichts erkennen im Stream. Funktioniert Twitch? Bestimmt, bestimmt funktioniert Twitch. Oh, da muss ich, da muss ich... Twitch. Punkt TV slash WoBloas aufmachen. Ach. Ach, ja. Okay. Ach, ja, okay. Also Twitch funktioniert nicht. Was mich jetzt ehrlich gesagt wundert, ist, dass Twitch nicht funktioniert. Okay, also Twitch funktioniert nicht, was mich jetzt ehrlich gesagt wundert. Ich würde ja gerne Cookies accepten, wenn es funktioniert. Was steht hier drauf? Safe Changes, perfekt. Accept Cookies, accept Cookies, manage Cookies. Okay, wir accepten, wir accepten einfach alles. Nielsen, Nielsen ist super. Gibt es nicht sowas wie... Gibt es nicht einfach so wie alles accept, man? Dann geht das bestimmt auch, wenn man Cookies acceptet. Weil der Cookies accepten Knopf ist kaputt. Okay. Okay, funktioniert nicht. Aber es ist unglaublich, wie viel einzelne Leute mit guten Ideen hinbekommen, oder? Twitch will das nicht wegen Ads. Twitch merkt das doch gar nicht, das ist ein ganz normaler Chrome. Twitch weiß doch nicht, wohin der Chrome rendert. Nein, du kannst da drin theoretisch alles anschauen. Aber schon mega nice, oder? Dass sowas funktioniert. FFM-Pack installiert. Wozu? Außerdem habe ich FFM-Pack installiert, aber es hat damit überhaupt nichts zu tun. Chainlore, Chainlore will mit der Temp-timeoutet werden. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. das immer aus testen sei froh dass der patrick nicht dabei der hätte schon längst wieder temp gebannt alle wie oft wollen die uns noch dieses buber wie ich will das buber video nicht sehen mann youtube kannst du mich in ruhe lassen ok geht hast du von dem was auch immer und noch was was auch immer liegt mit bekommen ne ich weiß nicht was das ist liegt er von forensik tools aber ich noch nie habe ich noch nie mitbekommen den letzten größeren liegt den ich mitbekommen habe war glaube ich der gta 6 liegt ich glaube das war das letzte letzte groß ding wo ich mich dran erinnern kann weil es auch schon nie wobei das kann nicht sein das ist ja schon wieder ein jahr her da gab es in der zwischenzeit schon 800 neun liegs hast du das mit das habe ich mitbekommen argentinische pesos und paypal ich weiß nicht mehr genau was das hat das habe ich auf jeden fall mitgekriegt wo wir gerade wo wir gerade bei tricks sind wisst ihr was wisst ihr was mir aufgefallen ist also ich habe ja youtube premium ich habe youtube premium allerdings über einen account der ein payment profil in indien hat das heißt ich bezahle irgendwie 300 indischen rupien was irgendwie vier euro sind oder dreieinhalb dreieinhalb euro versus 14 euro sondern wisst ihr was mir jetzt aufgefallen ist es und zwar in youtube premium das wusste ich bis jetzt gar nicht ist youtube music premium mit drin oder premium mit drinne was im endeffekt bedeutet dass ich amazon unlimited music jetzt gekündigt habe gucke ich einfach über youtube wenn es eben preis schon drinne ist ja so sieht es aus never sat never donated er block on stone laptop nevers wifi wobei es da noch bessere versionen von gibt die auch bis jetzt habe ich alles gefunden was ich gesucht habe das einzig blöde ist aber damit hätte ich rechnen können das einzig das ein richtig genau das wollte ich gerade sagen das einzig blöde ist wenn du auf aktuelle sachen gräst kriegst du irgendwelche bollywood charts vorgeschlagen das ist aber nicht weiter wild weil du kannst in die verschiedenen genres gehen dann ist es alles ok und das lernt nach wie vor was du gerne hörst und kriegst dann kaum indische sachen wenn du aber guckst top aktuell dann kriegst du irgendwelche indische indischen pop vorgeschlagen wenn du in den indischen account hat wen juck dafür kostet es einfach zehn euro weniger ups zwei mal starten geht nicht dann ist es procken geht das geht das noch ja geht noch guck dir das mal an wenn du das nämlich hast brauchst du kein spotify mehr du brauchst kein unlimited mehr funktioniert alles funktioniert alles gut ich habe vorhin gesehen mein lieblings c-sharp content creator hat neues video wollte ich mir nachher eh angucken es gibt nämlich in c-sharp 12 gibt es neue konstrukte neue konstruktors vielleicht gucken wir uns später noch an kann ich übrigens seinen content kann ich nur empfehlen also wenn ihr dort net verwendet beziehungsweise c-sharp entwickler seid oder euch die plattform interessiert der macht wirklich gute videos zu warum ist ein twitch chat so komisch du meinst der hier ganz einfach weil ich nicht eingeloggt bin in meinem vorschau auf dem zweiten monitor sehe ich das noch überhaupt nichts instabiles gemerkt bisher na gut der refreshed nur einmal die sekunde du kannst es auch höher stellen dass er alle alle 500 millisekunden refreshed und sowas der refreshed einmal in der sekunde also wenn du jetzt beispielsweise die ansatz wenn du hier die oben die anzeige hast ob deine nun deine num lock taste gedrückt ist dann dauert es dann dauert es mal ein bisschen kurz aber das ist nicht schlimm einmal die sekunde update von aus status bar reich doch bin ich gut ich finde aber die features nice vielleicht gebe ich mir doch mal irgendwann poli bar oder sonst was aber bis jetzt bin ich eigentlich ganz zufrieden mit meiner billigen status leistet aber das billigen trotzdem nice was alles angezeigt wird das arch beide weh selbstverständlich doch kannst du aber anscheinend denkt youtube musik trotzdem du bist in indien braucht man nicht poli bar das kannst du für so was wie für status leisten zum beispiel verwenden nur dass er dann noch coolere sachen machen kannst so laut stärker anzeigen alles mögliche brauchen tut man das nicht wirklich wenn man gerne rumbastelt ist es vielleicht ganz cool jep klock anything you called i'll pay for das ist das ist das ist so schnell geschnitten ist ist ist das ein was ist mit den leuten los ist das ein software entwicklungs influencer nein ja ja und nein zuma участlichen ja ja The Most Powerful Software Development Process is the Easiest. Kommt auf die Software an würde ich mal sagen. Der Most Powerful Software Development Process ist der, der passt zu dem was man entwickeln will. YouTube gehen auch langsam echt die Ideen aus oder? Was ich gucken will, das ist immer der gleiche Kram. Und ehrlich gesagt, ich benutze zwar Thunderbird, aber die Zukunft von Thunderbird, die interessiert mich jetzt auch nicht so wahnsinnig. Wie kriegst du die Transparenz hin, welche Transparenz, du meinst das hier? Ach hier oben, hier oben, ja das ist ein bisschen dreckreich. Jett, wer von euch hat gerade meinen Twitch-Account geöffnet? Ah ok, dann weiß ich ja was es war. Ne ich bin aus Versehen wahrscheinlich einfach hier drauf gekommen. Was ist denn ein Nicht-Real-DNS, keine Ahnung wie du da drauf kommst jetzt. Was du machen musst ist folgendes, wenn du es transparent machen willst, das hier musst du machen. Guck mal, das musst du einfügen, einfügen. I3 Bar Command I3 Bar Minus T, das Minus T ist wichtig, weil das Minus T für Transparency steht. Und wenn du das so machst, dann funktioniert es, dann ist deine Bar auch transparent. Forscher war ein Video mit einem Real-DNS, keine Ahnung, ja zu spät, jetzt habe ich schon zugemacht. Oder meinste hier Real-DNS, you want a Real-DNS-Server at home, ah ok, der erzählt dir wahrscheinlich dass du Bind verwenden kannst und 30 Milliarden Optionen zum einstellen hast. Ich glaube mit Real meint er nicht, dass das der einzige DNS-Server ist, der richtiges DNS machen kann, sondern er meint das ist quasi ein echter DNS-Server, also quasi nicht irgendwie einfach nur so ein Spielzeug-DNS-Server, sondern einer der alles kann und Millionen Client-Requests kann und sowas. Ich mein, Bind ist ja seit 40 Jahren oder so der DNS-Server schlechthin, leider von der Konfig auch abfuck, abfuck-es-fuck, die beiden Konfig, ne ne ne ne ne ne ne ne, das stimmt nicht, das stimmt nicht. Also es sind, es sind alle YouTube-Videos im Katalog, also du kannst auf YouTube-Music auch automatisch alle YouTube-Videos gucken wo die als Musikgeflaggt sind, aber die haben auch noch mehrere Sachen, zum Beispiel habe ich letztens gehört und das ist bestimmt nicht public auf YouTube, habe ich gehört Inflames, so, ok das hat irgendeinen Dude hochgeladen, aber ich habe mir nicht das, ich habe mir nicht das Album in einem Stück angehört, sondern, wait a minute, der Kram ist public auf YouTube? Kann doch nicht sein, ne das, warte mal, warte mal, warte mal, ok, ok, ok, ok, ok, ok, jetzt mal richtig cringy, cringy Power-Metal suchen, der kann doch nicht public auf YouTube sein, na teilweise, aber nicht das, aber nicht das, nicht das gesamte Album, nicht das, ne ne ne, du hast schon noch extra, du hast schon noch extra Tracks, also ich habe bisher alles das, was ich auf Amazon sonst gehört hatte auch bei YouTube Music gefunden und der Katalog soll auch relativ gut sein, ich habe, ja, tatsächlich, ja Moment, weil ich hier eingeloggt bin, ja Moment, das ist die Free-Version, was du jetzt gezeigt hast ist die Free-Version von Google Music, ja, was auch immer, ehrlich gesagt ist mir es egal, ich habe bisher alles, was ich bei Amazon gehört habe auch auf YouTube gefunden, hast du das Video von Tim Gabel mit Morphoist gesehen, ne, um was ging es da, nicht, dass ich das lohne anzugucken, ok, das war, komm wir müssen jetzt, wir müssen jetzt nochmal ein bisschen was an uns anschauen, Windows XP Steam, ok, ich will einfach wissen, wie jebaited wir werden, achso, jeder macht irgendwelche Chat-GPT Videos, man, ich kann es bald nicht mehr sehen, gut, es geht halt auch einfach gut gerade, wir gucken jetzt das hier, das ist nur ein Remote-Screen, das ist nur ein Remote-Screen, ja, dann gucken wir mal, wie jebaited wir werden, ich skippe da mal drüber, ok, Unboxing, ok, das sieht, das sieht aber wirklich nach Budget aus, das sieht aus wie ein Navigationsgerät, das sieht aus wie ein Navigationsgerät, GMA 900, lul, Alter, ich weiß doch gar nicht, was ist denn ein Zehneron, M-U-L-V, GMA 900, da weißt du schon, das ist von 2008 oder so, Discount, ja, sag ich doch, lul, Erscheinungsdatum 2005, das ist nur 6545 Tage alt, ich glaube, wir haben sogar, wir haben das nicht animierte Becherst nur, ich spule ein bisschen vor, ich spule ein bisschen vor, ich spule ein bisschen vor, was will er eigentlich damit, ich meine, das ist eine Kiste von 2005, damit kannst du, ich meine, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste", "segments": [{"id": 1, "start": 90.0, "end": 102.16, "text": "Hallo, ich bin auch wieder da, relativ, ja ja ich wollte es gerade sagen, relativ oft"}, {"id": 2, "start": 102.16, "end": 103.16, "text": "bin ich da."}, {"id": 3, "start": 103.16, "end": 110.44, "text": "Aber ich sage euch Leute, heute war echt kein sonnlig toller Tag."}, {"id": 4, "start": 110.44, "end": 133.44, "text": "Du bist endlich als Software-Hardware-Ingenieur angestellt, was macht man denn als Software-Hardware-Ingenieur?"}, {"id": 5, "start": 133.44, "end": 138.56, "text": "Also Software-Ingenieur kann ich mir vorstellen, Hardware-Ingenieur kann ich mir vorstellen,"}, {"id": 6, "start": 138.56, "end": 144.8, "text": "was macht denn ein Software Hardware-Ingenieur, der macht alles, alles in einem."}, {"id": 7, "start": 144.8, "end": 152.0, "text": "Äh warte mal, ich muss glaube ich meine Lautstärke richtig einstellen."}, {"id": 8, "start": 152.0, "end": 158.8, "text": "Naja, ist richtig, richtig, ja ja ich hatte ja auch kein Teams-Offen, alles from scratch."}, {"id": 9, "start": 158.8, "end": 173.28, "text": "Erstmal enjoyen, dann enjoye mal, Low-Level-Fullstack, also quasi so ein STM32-ESP32-Fullstack."}, {"id": 10, "start": 173.28, "end": 183.8, "text": "Achso, ok, ah jetzt verstehe, was du meinst, du kümmerst dich um die Software für irgendwelche"}, {"id": 11, "start": 183.8, "end": 187.36, "text": "Microcontroller-Geschichten oder Beispiel für irgendwelche Industriesteuerungen oder"}, {"id": 12, "start": 187.36, "end": 189.04, "text": "für irgendwas im Auto oder sowas in der Richtung."}, {"id": 13, "start": 189.04, "end": 198.04, "text": "Echt jetzt, nee das kann nicht sein, im Dezember muss ich doch mehr gestreamt haben."}, {"id": 14, "start": 198.04, "end": 204.96, "text": "Na gut im Dezember habe ich viel gemacht, im Dezember habe ich auch, habe ich immer richtig,"}, {"id": 15, "start": 204.96, "end": 211.08, "text": "richtig viel aufgeräumt, ich habe wieder MMO-Kreisel-Kreit gemacht und alles mögliche."}, {"id": 16, "start": 211.08, "end": 217.92, "text": "Steuerung, Steuerung-Krete für E-Autos, ok, ich glaube dir das, ich glaube dir das, du"}, {"id": 17, "start": 217.92, "end": 220.92, "text": "weißt das generell, wissen das die Zuschauer wahrscheinlich besser als ich selbst."}, {"id": 18, "start": 220.92, "end": 238.88, "text": "Leute, ich muss euch was erzählen, und zwar, ach Quatsch, ich bin im falschen, ich bin"}, {"id": 19, "start": 238.88, "end": 241.2, "text": "im falschen, falschen Browser."}, {"id": 20, "start": 241.2, "end": 247.56, "text": "Wir haben doch im letzten Stream, nee das stimmt gerade nicht, im vorletzten, im vorletzten"}, {"id": 21, "start": 247.56, "end": 256.24, "text": "Stream, stimmt gerade nicht, ja ja Max ist gut, wir haben doch im vorletzten Stream uns"}, {"id": 22, "start": 256.24, "end": 265.44, "text": "doch mit dieser Emulator-Kiste hier beschäftigt, ja, ihr erinnert euch, ich habe jetzt noch"}, {"id": 23, "start": 265.44, "end": 272.84, "text": "ein bisschen rumgebastelt und soll ich euch was sagen, oder was heißt, was heißt soll"}, {"id": 24, "start": 272.84, "end": 280.04, "text": "ich euch was sagen, ich kann es euch sogar zeigen wenn ihr wollt, da muss ich aber erstmal"}, {"id": 25, "start": 280.04, "end": 284.84, "text": "anschließen wie dafür, weil ich habe die Kiste vorher abgemacht, ich kann es euch mal"}, {"id": 26, "start": 284.84, "end": 290.36, "text": "zeigen, ihr werdet, ihr werdet, ihr werdet staunen werdet ihr, staunen."}, {"id": 27, "start": 290.36, "end": 303.92, "text": "Ich schließe die Kiste mal kurz an, ihr werdet staunen, ihr werdet progerieren, ich hoffe"}, {"id": 28, "start": 303.92, "end": 317.16, "text": "ich schmeiße jetzt nichts runter, weil ich brauch da Stromkabel, Stromkabel brauche ich,"}, {"id": 29, "start": 317.16, "end": 328.64, "text": "Stromkabel, Netzwerkabel, oh fuck, HDMI-Kabel, ich habe es leider abgestöpselt alles wieder,"}, {"id": 30, "start": 328.64, "end": 336.88, "text": "HDMI, Netzwerkabel, wo ist das HDMI-Kabel, ich zeige, ich zeige es euch, zeigen ist besser"}, {"id": 31, "start": 336.88, "end": 342.64, "text": "als, oder wie zeigen ist besser als tausend Worte oder irgendwie sowas, ich zeige es euch,"}, {"id": 32, "start": 342.64, "end": 349.76, "text": "ihr werdet, ihr werdet proggen, oh Capture-Karte dran, hätte ich mir selbst nicht gedacht,"}, {"id": 33, "start": 349.76, "end": 356.28, "text": "dass das so gut funktioniert, Capture-Karte dran und jetzt den Xbox-Controller dran und"}, {"id": 34, "start": 356.28, "end": 369.36, "text": "ich glaube dann ist gut, so jetzt kann ich einschalten, Activate, alles klar, Achtung,"}, {"id": 35, "start": 369.36, "end": 378.68, "text": "passt mal auf Leute, Elgato, Elgato-Stellz, die aus irgendwelchen Gründen nicht funktioniert,"}, {"id": 36, "start": 378.68, "end": 392.08, "text": "ah jetzt, okay, wow, wow, wow, viel zu laut, pass mal auf, pass mal auf, ihr werdet, ihr"}, {"id": 37, "start": 392.08, "end": 403.6, "text": "werdet proggen, ah no signal, nice, also erstmal, Xbox funktioniert, Xbox Emulation funktioniert,"}, {"id": 38, "start": 403.6, "end": 410.8, "text": "leider nicht upscaled, nur normal, ich habe jetzt ein richtig schönes Übersichtsmenü,"}, {"id": 39, "start": 410.8, "end": 415.0, "text": "wenn du zum Beispiel ein Super Nintendo aufmachst, kriegst du sogar Videovorschau von manchen"}, {"id": 40, "start": 415.0, "end": 421.84, "text": "Super Nintendo Games, die in der Collection sind, N64 kriegst du Vorschau von der Collection"}, {"id": 41, "start": 421.84, "end": 449.12, "text": "und jetzt kommts, jetzt kommts, aber haltet euch mal fest, na, das Switch und PS3 läuft"}, {"id": 42, "start": 449.12, "end": 461.76, "text": "weiter, und Switch, und Switch, passt mal auf, ihr hört glaube ich den Sound, ich höre"}, {"id": 43, "start": 461.76, "end": 466.36, "text": "den Sound jetzt nicht, ich hoffe es ist nicht zu, ja die Ladezeiten sind mit dem Walken-Treiber"}, {"id": 44, "start": 466.36, "end": 474.24, "text": "ein bisschen, bisschen im Arsch, die Ladezeiten sind definitiv schlechter als auf der echten"}, {"id": 45, "start": 474.24, "end": 491.24, "text": "Switch, das ist Bartos Zera, Bartos Zera, aber der Switch Emulator, den muss man zusätzlich"}, {"id": 46, "start": 491.24, "end": 507.32, "text": "installieren, ja, ich besitze übrigens den Switch und ich besitze auch Link's Awakening,"}, {"id": 47, "start": 507.32, "end": 511.72, "text": "ich besaß das sogar schon auf dem Game, nein nicht Wing Wing, wirklich, ernsthaft, no"}, {"id": 48, "start": 511.72, "end": 516.56, "text": "cuppa, ich hab das sogar schon auf dem Game Boy, auf dem Game Boy war das, ich hatte sogar"}, {"id": 49, "start": 516.56, "end": 523.52, "text": "auf dem Game Boy und dem Game Boy Color, ok, Achtung, jetzt pass mal auf, wie gut das läuft,"}, {"id": 50, "start": 523.52, "end": 530.64, "text": "ok, es ist auf Französisch, weil ich noch nicht gecheckt hab, wie man die Sprache umstellt,"}, {"id": 51, "start": 530.64, "end": 541.56, "text": "aber es ist erstmal egal, Commencer, pass mal auf, seht ihr wie gut und flüssig das"}, {"id": 52, "start": 541.56, "end": 548.48, "text": "läuft, am Anfang ruckelst du ein bisschen wie auf der original Switch, das läuft besser"}, {"id": 53, "start": 548.48, "end": 559.28, "text": "als auf der originalen Switch Leute, das sieht besser aus und läuft besser als auf der Switch,"}, {"id": 54, "start": 559.28, "end": 569.36, "text": "ok ich hatte ein paar Grafikfehler, dem Kettenhund fehlt der Kopf, ich spiele es gerade mit dem"}, {"id": 55, "start": 569.36, "end": 588.44, "text": "Xbox 360 Controller, also extrem nice oder, leider, leider hat's der Switch Emulator keinen,"}, {"id": 56, "start": 588.44, "end": 594.8, "text": "keine Performance Overlays, sonst könnte ich es euch zeigen, also andere Games haben"}, {"id": 57, "start": 594.8, "end": 602.76, "text": "Performance Overlays, der hier leider nicht, aber was auch mega ist, kommt mal Gamecube,"}, {"id": 58, "start": 602.76, "end": 613.68, "text": "Double Dash, ihr habt Hintergrundmusik, ja ihr habt Hintergrundmusik und Ingame Musik"}, {"id": 59, "start": 613.68, "end": 621.6, "text": "glaube ich, ja ich mach die Hintergrundmusik, ich hab selbst keine, Moment ich muss es mal"}, {"id": 60, "start": 621.6, "end": 627.48, "text": "so einstellen, dass ich selbst was höre, guckt euch das mal an, ich hab hier unten jetzt"}, {"id": 61, "start": 627.48, "end": 644.32, "text": "die Performance Overlay Geschichten aktiviert und das ist jetzt Double Dash in 1080p, guckt"}, {"id": 62, "start": 644.32, "end": 659.84, "text": "mal wie gut das aussieht, pass mal auf, guckt mal wie gut das aussieht, beide, beide Emulatoren,"}, {"id": 63, "start": 659.84, "end": 669.84, "text": "das wo die Spiele besser unterstützt werden, das sieht besser aus als ein Switch Gamer,"}, {"id": 64, "start": 669.84, "end": 676.92, "text": "da kann man nix sagen oder, also das ist ein fucking Gamecube Spiel, das sieht mega aus"}, {"id": 65, "start": 676.92, "end": 686.88, "text": "für ein Gamecube Spiel oder und guckt euch mal die Performance an, guckt euch mal die"}, {"id": 66, "start": 686.88, "end": 705.68, "text": "Performance an, extrem Porgers, ihr seht unten links, das hat konstante 60 FPS, ja"}, {"id": 67, "start": 705.68, "end": 711.56, "text": "und es hat, es lastet im Endeffekt nichts aus, ich könnte sogar noch, ich könnte sogar,"}, {"id": 68, "start": 711.56, "end": 717.32, "text": "also bei der Auslastung, könnte ich theoretisch sogar noch, noch ein bisschen mehr einschalten,"}, {"id": 69, "start": 717.32, "end": 722.28, "text": "ich könnte sogar noch hier hergehen und sagen, ja, wir machen jetzt, wir machen jetzt, wir"}, {"id": 70, "start": 722.28, "end": 731.72, "text": "rennen jetzt in 1044p und machen sogar noch, keine Ahnung hier, Texture Filtering und Anti-Alasing"}, {"id": 71, "start": 731.72, "end": 738.48, "text": "an, so, hier, ok da gehen wir mal runter auf 1080p mehr, ok gucken wir mal ob das jetzt"}, {"id": 72, "start": 738.48, "end": 745.28, "text": "läuft, bin ich mal gespannt, also das sollte es eigentlich jetzt nicht mehr packen, 1440p"}, {"id": 73, "start": 745.28, "end": 749.76, "text": "und, aber mal gucken, mal gucken, ich bin gespannt, das letzte was wir rausprobieren,"}, {"id": 74, "start": 749.76, "end": 754.44, "text": "eigentlich wollte ich heute kein Gaming Zeug machen, aber ich mein, das ist, guckt mal"}, {"id": 75, "start": 754.44, "end": 761.28, "text": "wie gut das aussieht, das ist ein Gamecube Spiel man, da kann man sich echt, da kann"}, {"id": 76, "start": 761.28, "end": 771.6, "text": "man aber gar nichts sagen, oder? Ok, jetzt packt es die 60fps nur noch, nur noch mit"}, {"id": 77, "start": 771.6, "end": 778.52, "text": "kleinen Slowdowns, ich merke schon, es dippt, es dippt zwischendurch ein bisschen, aber"}, {"id": 78, "start": 778.52, "end": 785.48, "text": "hey, ich mein, guckt euch das mal in Pause an, das ist, guck mal, das hält sogar die"}, {"id": 79, "start": 785.48, "end": 792.92, "text": "60fps mit 1440p, Anti-Alasing und Texture Filterung, das sieht besser aus wie die meisten"}, {"id": 80, "start": 792.92, "end": 804.56, "text": "Switch Games, ah, aber bei der Auflösung merke ich ein leichtes Input-Lag und die Steuerung"}, {"id": 81, "start": 804.56, "end": 812.36, "text": "spackt ein bisschen, Nintendo Switch Online, nein, das geht natürlich nicht, das geht"}, {"id": 82, "start": 812.36, "end": 823.04, "text": "natürlich nicht, Nintendo Switch Online funktioniert natürlich nicht, das wäre es jetzt auch,"}, {"id": 83, "start": 823.04, "end": 831.52, "text": "Omega Lul, du kannst da kein Splatoon drauf spielen und online cheaten oder sowas damit,"}, {"id": 84, "start": 831.52, "end": 841.12, "text": "sowas würde ich aber auch nicht empfehlen, was soll der Scheiß, nur Singleplayer, du"}, {"id": 85, "start": 841.12, "end": 847.12, "text": "kannst, ältere Konsolen kannst du, kannst du spielen, ältere Konsolen kannst du spielen,"}, {"id": 86, "start": 847.12, "end": 864.72, "text": "sogar mit, sogar mit Netzwerk-Multiplayer, ich bin mir aber nicht sicher, ob Online-Netzwerk-Multiplayer,"}, {"id": 87, "start": 864.72, "end": 869.2, "text": "wahrscheinlich wenn du einen Port weiterleitest, aber es gibt ja auch so Game-Server, zumindest"}, {"id": 88, "start": 869.2, "end": 873.52, "text": "gab es da früher so Games-Server für alte Spiele, wo man online zusammen spielen konnte"}, {"id": 89, "start": 873.52, "end": 884.08, "text": "mit Matchmaking und sowas, nee, das hat so gut wie kein Delay, wenn du die emulierten"}, {"id": 90, "start": 884.08, "end": 900.08, "text": "Sachen spielst, also mega, mega nice."}, {"id": 91, "start": 914.08, "end": 932.2, "text": "Stream Delay, Quatsch, Stream Delay, kein Stream Delay, wo sollten wir Stream Delay"}, {"id": 92, "start": 932.2, "end": 943.44, "text": "haben, aber es ist richtig, also hättet ihr ernsthaft gedacht, dass die Switch in 1080p"}, {"id": 93, "start": 943.44, "end": 948.96, "text": "mit 60 FPS läuft und dass du im Endeffekt sogar noch die Möglichkeit hast, ein paar"}, {"id": 94, "start": 948.96, "end": 955.28, "text": "Sachen anzuschalten, sodass es dann sogar besser aussieht als auf der originalen Switch,"}, {"id": 95, "start": 955.28, "end": 956.28, "text": "also das hätt ich nicht gedacht."}, {"id": 96, "start": 956.28, "end": 971.88, "text": "Übrigens, PS3 funktioniert auch, allerdings funktioniert die PS3 nicht performant genug,"}, {"id": 97, "start": 971.88, "end": 982.32, "text": "also ich hab's mit Uncharted ausprobiert und Uncharted läuft, womit's 15-20 FPS, je"}, {"id": 98, "start": 982.32, "end": 985.72, "text": "nachdem, was man einstellt auch ein bisschen mehr, aber nicht, dass es gut ist."}, {"id": 99, "start": 985.72, "end": 990.96, "text": "Wie fandest du meinen Gameboy Asp- Du hast mir was geschrieben?"}, {"id": 100, "start": 990.96, "end": 1012.44, "text": "Also, den letzten Tweet, ich hab, den letzten hab ich am 28."}, {"id": 101, "start": 1012.44, "end": 1040.64, "text": "Januar gekriegt, als Antwort, ja keine Ahnung, ja Moment, ich spiel das doch nicht auf meinem"}, {"id": 102, "start": 1040.64, "end": 1050.68, "text": "Desktoprechner, ach das, das hab ich gesehen, ja das ist ja schon 5 Tage her oder so, das"}, {"id": 103, "start": 1050.68, "end": 1055.56, "text": "war cool, das hab ich gesehen, das war nice, ich hab aber nicht gedacht, dass du's wirklich"}, {"id": 104, "start": 1055.56, "end": 1059.32, "text": "gemoddert hast, ich dachte, das ist irgendwie so ein Mean-Bild, was du reingeschnitten hast,"}, {"id": 105, "start": 1059.32, "end": 1063.4, "text": "ich dachte nicht, das ist echt, doch doch, das musst du gleich, das hab ich gesehen,"}, {"id": 106, "start": 1063.4, "end": 1069.0, "text": "aber das ist ja schon 5 Tage her oder so, das war doch vor dem Wochenende glaube, das"}, {"id": 107, "start": 1069.0, "end": 1087.12, "text": "hab ich nicht sogar geliked, das machen wir heute übrigens nicht."}, {"id": 108, "start": 1087.12, "end": 1090.92, "text": "Kennt jemand IP-Überwachungskameras ohne irgendeinen Cloud-Registrierungs-Quatsch?"}, {"id": 109, "start": 1090.92, "end": 1097.12, "text": "Ja, also suchst du teure oder billige, wahrscheinlich billige, weil teure gibt's in Massen, was"}, {"id": 110, "start": 1097.12, "end": 1106.28, "text": "ich selbst, was ich selbst habe, sind Amazon Reolink Kameras, also die versprühen jetzt"}, {"id": 111, "start": 1106.28, "end": 1110.92, "text": "nicht gerade super hochwertige Qualität, aber die funktionieren, also nicht alle, aber die"}, {"id": 112, "start": 1110.92, "end": 1117.24, "text": "meisten funktionieren rein lokal, also zum Beispiel, ich glaube, das könnte sogar sein,"}, {"id": 113, "start": 1117.24, "end": 1123.68, "text": "wo ich eine von hab, möglich, möglich, dass ich darf, also so eine, die so ähnlich aussieht,"}, {"id": 114, "start": 1123.68, "end": 1131.68, "text": "habe ich, die funktioniert rein offline und ich hab auch noch von denen sowas in der Richtung"}, {"id": 115, "start": 1131.68, "end": 1136.84, "text": "mit zum schwenken, da weiß ich aber aus dem Kopf nicht welches, die funktionieren rein,"}, {"id": 116, "start": 1136.84, "end": 1141.88, "text": "die kannst du nicht flashen, aber die funktionieren rein offline mit RTSP, was ist hier wieder,"}, {"id": 117, "start": 1141.88, "end": 1150.24, "text": "Booba Vorschlag, die funktionieren offline rein mit RTSP, hast du die rund ums Haus, ja,"}, {"id": 118, "start": 1150.24, "end": 1158.24, "text": "also ich hab, lass mal überlegen, wo hab ich Kameras, das einzige, die machen halt keinen"}, {"id": 119, "start": 1158.24, "end": 1163.28, "text": "super hochwertigen Eindruck, ja, also ich hatte auch eine, die ist mir verreckt nach"}, {"id": 120, "start": 1163.28, "end": 1167.88, "text": "irgendwie einer Woche, die hab ich dann wieder zurück zu Amazon geschickt, also ich hab,"}, {"id": 121, "start": 1167.88, "end": 1171.88, "text": "lass mal überlegen, wo hab ich, ich mach einfach mal auf dem zweiten Bildschirm kurz die Kamera"}, {"id": 122, "start": 1171.88, "end": 1176.36, "text": "übersicht auf, da kann ich euch sagen, wo ich Kameras hab, wo ich dann den Kopf überlegen,"}, {"id": 123, "start": 1176.36, "end": 1182.72, "text": "also ich hab einmal im Keller eine hängen, also das ist eine geflashte, das ist keine"}, {"id": 124, "start": 1182.72, "end": 1187.8, "text": "Reolink Kamera, das ist eine geflashte alte Wyzecam, die zeigt mir den Wasserdruck von"}, {"id": 125, "start": 1187.8, "end": 1193.52, "text": "der Heizung an, da hab ich noch nichts Gescheites gefunden, wie ich das, ne, das verwende ich"}, {"id": 126, "start": 1193.52, "end": 1196.84, "text": "nicht, das verwende ich gar nicht, die Oberfläche, ich hab's mittlerweile direkt in HomoSystem"}, {"id": 127, "start": 1196.84, "end": 1205.2, "text": "integriert, so, den Wasserdruck von der Kamera, dann hab ich einmal das Katzenklo von oben,"}, {"id": 128, "start": 1205.2, "end": 1209.84, "text": "also ich, also, ich hab ja zwei Katzenklos, das obere Katzenklo hat eine Kamera drüber"}, {"id": 129, "start": 1209.84, "end": 1216.4, "text": "hängen am Schrank, Probleme mit der Heizung ab und zu mal, jetzt mittlerweile schon nicht"}, {"id": 130, "start": 1216.4, "end": 1220.68, "text": "mehr, seitdem ich das Heizungsprofil richtig eingestellt hab, am Schrank überm Katzenklo,"}, {"id": 131, "start": 1220.68, "end": 1225.84, "text": "dass ich weiß, wenn die Katze mal wieder geschissen hat, äh, unten am Eingang beziehungsweise"}, {"id": 132, "start": 1225.84, "end": 1232.92, "text": "im Flur, auf der Terrasse im Hof hab ich eine, die ist schwenkbar, dass ich quasi Hof und"}, {"id": 133, "start": 1232.92, "end": 1244.52, "text": "Terrasse mitbekomme, dann hab ich eine, äh, zum Hoftor und eine für das Hoftor, Kameras"}, {"id": 134, "start": 1244.52, "end": 1250.96, "text": "auf dem Klo, ja, aber nicht auf meinem Klo, auf dem Katzenklo, denn die ist, es ist nicht"}, {"id": 135, "start": 1250.96, "end": 1253.96, "text": "so, dass ich unbedingt scharf drauf wäre, meine Katze beim Kacken zu beobachten, also"}, {"id": 136, "start": 1253.96, "end": 1258.16, "text": "ist aber gut zu sehen, wenn sie drauf war, weil wenn die Katze drauf war und du nicht"}, {"id": 137, "start": 1258.16, "end": 1261.76, "text": "schnell genug bist, kommt sie an und erzählt dir, dass du nicht schnell genug gewesen bist."}, {"id": 138, "start": 1261.76, "end": 1268.32, "text": "Hast du auch welche, die Audio übertragen?"}, {"id": 139, "start": 1268.32, "end": 1273.24, "text": "Ja, ich glaub, die ganzen Reolink Kameras können Audio übertragen, das benutze ich"}, {"id": 140, "start": 1273.24, "end": 1274.24, "text": "aber nicht."}, {"id": 141, "start": 1274.24, "end": 1279.6, "text": "Hab ich auch direkt, äh, nicht weitergeleitet, den Audio Stream, brauch ich nicht, brauch"}, {"id": 142, "start": 1279.6, "end": 1280.6, "text": "kein Audio."}, {"id": 143, "start": 1280.6, "end": 1290.44, "text": "Das Einzige, wo ich Audio brauche, ist, äh, theoretisch, ist die Tür-Gengen-Sprechanlage"}, {"id": 144, "start": 1290.44, "end": 1296.4, "text": "und die hatte ich mal eine Weile angezapft über so eine Siedle, Siedle, äh, ja, so"}, {"id": 145, "start": 1296.4, "end": 1301.76, "text": "ein Siedle-Smart-Dingsgerät, was ich mir auf Ebay gekauft hab, aber ich hab festgestellt,"}, {"id": 146, "start": 1301.76, "end": 1307.08, "text": "ich benutze diese Gegensprechfunktion nie, also ich benutze die Gegensprechfunktion,"}, {"id": 147, "start": 1307.08, "end": 1310.92, "text": "wenn ich daheim bin, von den zwei Telefonen, also von den zwei Tür-Gengen-Sprechanlagen,"}, {"id": 148, "start": 1310.92, "end": 1315.88, "text": "die an der Wand hängen, aber dieses Weiterleiten aufs Handy, äh, und aufs Deck-Telefon hab"}, {"id": 149, "start": 1315.88, "end": 1317.72, "text": "ich nie benutzt, deswegen hab ich's wieder abgebaut."}, {"id": 150, "start": 1317.72, "end": 1330.76, "text": "Das Einzige, was ich jetzt habe noch, ist, wenn eine klingelt an der Haustür, dann ruft"}, {"id": 151, "start": 1330.76, "end": 1334.48, "text": "sie mich auf dem Handy an, aber nicht, dass ich mit ihm reden kann, sondern bekomme ich"}, {"id": 152, "start": 1334.48, "end": 1340.84, "text": "per SIP ein Video-Feed geschickt von meiner, äh, Kamera an der Eingangs-, ähm, am Hoftor,"}, {"id": 153, "start": 1340.84, "end": 1345.12, "text": "dass ich sehe, wer davor steht, auch wenn ich unterwegs bin, also wenn ich Bock hab,"}, {"id": 154, "start": 1345.12, "end": 1348.48, "text": "kann ich aufm Handy annehmen und dann seh ich, wer vor der Tür steht, aber selbst das werd"}, {"id": 155, "start": 1348.48, "end": 1355.08, "text": "ich wahrscheinlich abschaffen, weil das benutze ich auch viel zu wenig, als dass sich, wie"}, {"id": 156, "start": 1355.08, "end": 1358.56, "text": "die Existenzrecht fertigt, ne?"}, {"id": 157, "start": 1358.56, "end": 1371.2, "text": "Wir haben halt gar kein Tür-Gengen-Sprechanlage, achso, ja, das stimmt, wobei ich mich auf"}, {"id": 158, "start": 1371.2, "end": 1378.36, "text": "die Qualität nicht so, na, weiß nicht, sag mal, kann sich, kann sich die Musik mal entscheiden,"}, {"id": 159, "start": 1378.36, "end": 1379.6, "text": "wie laut die jetzt sein möchte?"}, {"id": 160, "start": 1379.6, "end": 1404.08, "text": "Ich bin ja zu leise, die, die, die wissen's nicht."}, {"id": 161, "start": 1404.08, "end": 1409.8, "text": "Also die Qualität dieser Reolink-Kameras und Mikrofone zum Hören vielleicht, aber zum"}, {"id": 162, "start": 1409.8, "end": 1415.04, "text": "Gegensprechen, zumal das Gegensprechen auch nur mit der offiziellen App funktioniert."}, {"id": 163, "start": 1415.04, "end": 1421.52, "text": "Wir haben zwar mal das Reolink-, ne, ne, das war kein Reolink-, Hickwishen war das."}, {"id": 164, "start": 1421.52, "end": 1428.84, "text": "Wir haben mal, falls sich noch jemand dran erinnert, wir haben mal im Stream die Hickwishen-,"}, {"id": 165, "start": 1428.84, "end": 1442.24, "text": "das Hickwishen-Gegensprech-Protokoll reverse-ingeniert, Achieve Wubblers, hier, Hickwishen-, ne, Tür,"}, {"id": 166, "start": 1442.24, "end": 1449.56, "text": "nur ganz kurz, lull, Türklänge plus Audio, japp, japp, japp, japp."}, {"id": 167, "start": 1449.56, "end": 1450.56, "text": "Ist es das?"}, {"id": 168, "start": 1450.56, "end": 1467.28, "text": "Ne, das ist die SIP-Geschichte, ähm, Smarted, Tü, Tü, Tü, Tü, Tü, vor zwei Jahren mehr"}, {"id": 169, "start": 1467.28, "end": 1479.44, "text": "als ein, ja, fängt gut an, ne, da hab ich irgendwas gebastelt,"}, {"id": 170, "start": 1479.44, "end": 1492.8, "text": "dann weiß ich nicht mehr, wir haben irgendwo, wir haben irgendwann mal das nachgebaut von"}, {"id": 171, "start": 1492.8, "end": 1506.0, "text": "Hickwishen, dieses Rücksprache-, also Gegensprech-Protokoll, das war auf ein, auf HTTP-basierendes-, ne,"}, {"id": 172, "start": 1506.0, "end": 1507.96, "text": "wie kann man das am besten umschreiben?"}, {"id": 173, "start": 1507.96, "end": 1514.84, "text": "Es basierte zum Teil auf HTTP, soll ich mal nach-, Gegensprech-Anlage könnte man tatsächlich"}, {"id": 174, "start": 1514.84, "end": 1524.48, "text": "suchen, ja, das stimmt, China-Kamera-Hexhorn, Gegensprech-Anlage, ja, genau, das ist es,"}, {"id": 175, "start": 1524.48, "end": 1536.0, "text": "Alter, wie, wie, Modge-, Modge-Five-Hair-Time, guck, das, das haben wir damals gebaut, weiß"}, {"id": 176, "start": 1536.0, "end": 1540.56, "text": "ich, wo man die Anwendung irgendwo sieht, ach ja, die Katze, die Katze, wo haben wir"}, {"id": 177, "start": 1540.56, "end": 1541.56, "text": "dann übertragen?"}, {"id": 178, "start": 1541.56, "end": 1556.52, "text": "Ja, hier sieht man, hier sieht man das Kamerabild, Alter, wie lange haben wir das dann rumgemacht?"}, {"id": 179, "start": 1556.52, "end": 1568.96, "text": "Fünfeinhalb Stunden, Mann, das war so eine hässliche Klingel, genau, die habe ich nie"}, {"id": 180, "start": 1568.96, "end": 1583.96, "text": "benutzt, jupp, okay, keine Ahnung, aber irgendwo hier haben wir das nachgebaut, so, und das"}, {"id": 181, "start": 1583.96, "end": 1591.88, "text": "war ein ganz furchtbar ekliches Protokoll, das basierte auf HTTP, allerdings hat es nicht"}, {"id": 182, "start": 1591.88, "end": 1599.76, "text": "HTTP direkt gesprochen, also es hat einen HTTP-Request gemacht und dann, wenn normalerweise"}, {"id": 183, "start": 1599.76, "end": 1604.36, "text": "die Verbindung abgebaut wurde, hat es über TCP dann die Sprachdaten geschickt, also"}, {"id": 184, "start": 1604.36, "end": 1610.72, "text": "es hat irgendwie einen TCP-Handshake gemacht, irgendwie einen HTTP-Get und danach hat es"}, {"id": 185, "start": 1610.72, "end": 1617.88, "text": "dann über TCP-Raw-Socket irgendwelche Daten gepusht, das war ein absolut standard-, nicht-standard-konformes"}, {"id": 186, "start": 1617.88, "end": 1623.96, "text": "China-Chinesen-Müll-Protokoll, was die sich da ausgedacht haben, das konnte sich nur hickwischen"}, {"id": 187, "start": 1623.96, "end": 1633.92, "text": "irgendwie, ausdenken, ja, da kann ich mich auch dran erinnern, das war so kaputt, dass"}, {"id": 188, "start": 1633.92, "end": 1640.56, "text": "man den normalen C-Sharp-HTTP-Klein nicht verwenden konnte, weil das nicht richtig"}, {"id": 189, "start": 1640.56, "end": 1644.88, "text": "war, da hatten die Verbindungen immer geclosed, und man durfte die Verbindungen nicht closen,"}, {"id": 190, "start": 1644.88, "end": 1651.68, "text": "danach ging es dann weiter, ganz, ganz ekliches Zeug, ich erinnere mich dunkel dran, ganz,"}, {"id": 191, "start": 1651.68, "end": 1670.16, "text": "ganz ekliches Zeug, ganz schlimm, ja, also so sieht es aus,"}, {"id": 192, "start": 1670.16, "end": 1678.44, "text": "ich weiß nicht, wie sind wir da jetzt eigentlich drauf gekommen, gab es sich letztens ein Video,"}, {"id": 193, "start": 1678.44, "end": 1682.56, "text": "wo eine Kamera versprochen hat, nichts zu sehen, ein paar Bayer-Sharp-HTTP, die sogar"}, {"id": 194, "start": 1682.56, "end": 1689.16, "text": "die Gesichtserkennung nach China funkt, ja, das wundert mich nicht, also was relativ mittelgroßer"}, {"id": 195, "start": 1689.16, "end": 1697.24, "text": "Skandal war in dieser Runde, war die Wisecam-Kameras, wo Streams theoretisch für jeden einsehbar"}, {"id": 196, "start": 1697.24, "end": 1703.76, "text": "öffentlich im Internet gingen, über irgendwelche China-Server, die haben gesagt, alles super"}, {"id": 197, "start": 1703.76, "end": 1708.16, "text": "secure und verschlüsselt, und irgendjemand hat den China-Control-Server gefunden, weil"}, {"id": 198, "start": 1708.16, "end": 1714.2, "text": "die selbst irgendwelche China-Cloud-Services verwenden, und da konnte jemand, der den Server"}, {"id": 199, "start": 1714.2, "end": 1717.8, "text": "kannte und die richtigen URLs aufgemacht hat, quasi jede Kamera, sich von jedem auf der"}, {"id": 200, "start": 1717.8, "end": 1721.52, "text": "Welt, der das über die Cloud schickt, angucken, ich war natürlich nicht betroffen, weil ich"}, {"id": 201, "start": 1721.52, "end": 1727.44, "text": "meine Kameras geflasht habe, wo wir wieder dabei sind, du kannst den Herstellern halt"}, {"id": 202, "start": 1727.44, "end": 1731.6, "text": "absolut nichts trauen, manchmal glaube ich, die Hersteller wissen es selber nicht und"}, {"id": 203, "start": 1731.6, "end": 1742.6, "text": "lassen sich halt von den eigentlichen Produzenten dieser Kameras zuschwätzen, ja, Euphie war"}, {"id": 204, "start": 1742.6, "end": 1758.36, "text": "letztens, Euphie war letztens, was ich meine, das ist Wisecam-Skandal-Suchen, ja, schon"}, {"id": 205, "start": 1758.36, "end": 1768.12, "text": "wieder, ja, das, das, das, Major Wisecam-Security-Floor, easily allowed hackers to access stored videos,"}, {"id": 206, "start": 1768.12, "end": 1772.68, "text": "ja, ja, du konntest aber auch schon, du konntest, das ist auch schon 3er her, also ganz im Ernst,"}, {"id": 207, "start": 1772.68, "end": 1779.44, "text": "die Leute lernen es nicht, gell, das ist das gleiche, das ist das gleiche wie mit Cloud-Passport-Managern,"}, {"id": 208, "start": 1779.44, "end": 1784.36, "text": "die lernen es einfach nicht, bei jedem Preach oder bei jedem, bei jedem Sicherheitsproblem"}, {"id": 209, "start": 1784.36, "end": 1789.44, "text": "freuen sich die Leute, das ging aber nochmal gut, entweder waren meine Daten nicht dabei"}, {"id": 210, "start": 1789.44, "end": 1793.88, "text": "oder sie waren ja wenigstens noch verschlüsselt oder sonst was in der Richtung, und die Einschläge"}, {"id": 211, "start": 1793.88, "end": 1798.24, "text": "kommen immer näher und die Leute reden sich das schön und irgendwann betrifft es dann"}, {"id": 212, "start": 1798.24, "end": 1802.84, "text": "halt mal ihren gewählten Cloud-Passport-Manager und dann, dann fallen sie aus allen Wolken"}, {"id": 213, "start": 1802.84, "end": 1807.4, "text": "so, wie, meine Passwörter in der Cloud speichern war doch keine so gute Idee, ja, das wundert"}, {"id": 214, "start": 1807.4, "end": 1814.12, "text": "mich jetzt aber, da sind die Leute wirklich selbst dran schuld, also wer seine Passwörter"}, {"id": 215, "start": 1814.12, "end": 1817.36, "text": "in der Cloud speichert, ich, ich, ich werde, ich werde jetzt nie verstehen, wie man das"}, {"id": 216, "start": 1817.36, "end": 1820.8, "text": "machen kann, also ich werde jetzt, doch, doch, ich verstehe, wie man das machen kann, weil,"}, {"id": 217, "start": 1820.8, "end": 1826.04, "text": "weil es komfortabel ist und sich automatisch quasi so sünkt auf alle Geräte, ohne wirklich"}, {"id": 218, "start": 1826.04, "end": 1830.16, "text": "zu sünken, weil alle auf den gleichen Datenbestand zugreifen, aber ich würde nie im Leben meine"}, {"id": 219, "start": 1830.16, "end": 1834.72, "text": "Passwörter in der Cloud speichern, nie, bei irgendeinem Anbieter, das einzige, was eventuell"}, {"id": 220, "start": 1834.72, "end": 1841.72, "text": "in Frage kommt, wäre, wenn ich wirklich meine Passwörter unterwegs brauche, dann würde"}, {"id": 221, "start": 1841.72, "end": 1846.0, "text": "ich die selbst verschlüsseln und nur den Teil der Passwörter, die ich unterwegs brauche,"}, {"id": 222, "start": 1846.0, "end": 1852.6, "text": "verschlüsselt auf irgendeinen Cloud Drive legen, wenn es unbedingt sein müsste, am"}, {"id": 223, "start": 1852.6, "end": 1857.68, "text": "besten auf irgendeine eigene Kiste, aber am besten, es ist, es ist wie mit allem, wenn"}, {"id": 224, "start": 1857.68, "end": 1861.12, "text": "man seine Daten nicht irgendwie rausgegeben hat, dann kann einem auch nichts passieren,"}, {"id": 225, "start": 1861.12, "end": 1873.32, "text": "ja, ja, da gab es auch letztens bisschen Diskussionen, dass Bitworn Server-seitige Rotations nichts"}, {"id": 226, "start": 1873.32, "end": 1878.96, "text": "bringen und sowas, ich erinnere mich, kann man, kann man alles machen, kann man alles"}, {"id": 227, "start": 1878.96, "end": 1885.28, "text": "machen, also wisst ihr, was ich mache, also wie ich das handhabe bisher, mit Accounts,"}, {"id": 228, "start": 1885.28, "end": 1891.08, "text": "wo ich die Passwörter mobil brauche, ich tippe die einmalig ein und speicher sie in"}, {"id": 229, "start": 1891.08, "end": 1894.64, "text": "dem Passwort-Save von meinem iPhone, kann man sich jetzt fragen, traut man Apple oder"}, {"id": 230, "start": 1894.64, "end": 1900.16, "text": "nicht, nein, ich traue Apple auch nicht, aber das sind meistens jetzt nicht so die, also"}, {"id": 231, "start": 1900.16, "end": 1905.48, "text": "wenn ich sie speichere, wenn ich sie speichere, dann sind das meistens eh nicht so die aller"}, {"id": 232, "start": 1905.48, "end": 1912.8, "text": "wichtigen Sachen und ansonsten, also Scalable zum Beispiel, habe ich, habe ich gespeichert"}, {"id": 233, "start": 1912.8, "end": 1918.44, "text": "im Handy, ja, weil ich sonst den Mist immer wieder eingeben muss, aber Scalable, ja, es"}, {"id": 234, "start": 1918.44, "end": 1925.96, "text": "könnte einer meine Stunks verkaufen, aber da mache ich mir jetzt weniger Gedanken"}, {"id": 235, "start": 1925.96, "end": 1932.28, "text": "drüber, ansonsten habe ich wichtige Sachen eigentlich nicht gespeichert auf dem Handy,"}, {"id": 236, "start": 1932.28, "end": 1936.76, "text": "das habe ich einmalig eingegeben, dass die App sich, Amazon zum Beispiel, Amazon habe"}, {"id": 237, "start": 1936.76, "end": 1942.36, "text": "ich einmalig autonifiziert auf dem Handy und dann ist gut, reicht, geh wieder auf YouTube,"}, {"id": 238, "start": 1942.36, "end": 1951.08, "text": "ja, Bubatime, YouTube meint, das sollen wir unbedingt gucken, aber das juckt mich nicht,"}, {"id": 239, "start": 1951.08, "end": 1968.6, "text": "das juckt mich nicht, ob jemand einen Song für Amorant gemacht hat, der J-Lore geht"}, {"id": 240, "start": 1968.6, "end": 1981.04, "text": "wieder ab, Alexi Bexy Video, ich habe nichts persönlich gegen den, ich kenne ihn nicht,"}, {"id": 241, "start": 1981.04, "end": 1986.48, "text": "wir haben uns nie irgendwo gesehen, aber ich mag seine Videos einfach nicht, ich kann mir"}, {"id": 242, "start": 1986.48, "end": 1998.84, "text": "das nicht angucken, was können wir uns dann angucken, ich habe übrigens ein interessantes"}, {"id": 243, "start": 1998.84, "end": 2006.76, "text": "Video, ein interessantes Video gefunden und zwar das hier, Ackerman Kram, der berichtet"}, {"id": 244, "start": 2006.76, "end": 2017.12, "text": "über exakt das, was ich auch erzählt habe in meinem Video, fällt euch, Moment, Moment,"}, {"id": 245, "start": 2017.12, "end": 2030.08, "text": "kommt euch, was ist das denn, kommt euch diese Mail irgendwie bekannt vor, habt ihr, habt"}, {"id": 246, "start": 2030.08, "end": 2040.16, "text": "ihr sowas ähnliches schon mal gesehen, also falls ihr mein Video gesehen habt, also ich"}, {"id": 247, "start": 2040.16, "end": 2064.04, "text": "bin, ich bin anscheinend nicht der Einzige, der solche Scam E-Mails bekommen hat, ich"}, {"id": 248, "start": 2064.04, "end": 2075.56, "text": "bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der"}, {"id": 249, "start": 2075.56, "end": 2085.12, "text": "Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche"}, {"id": 250, "start": 2085.12, "end": 2095.22, "text": "Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen"}, {"id": 251, "start": 2095.22, "end": 2101.74, "text": "hat, ich bin aber nicht der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht"}, {"id": 252, "start": 2101.74, "end": 2109.48, "text": "der Einzige, der solche Scam E-Mails bekommen hat, ich bin aber nicht der Einzige, der solche"}, {"id": 253, "start": 2109.48, "end": 2112.48, "text": "Was ist das für ein, für einen Window-Manager?"}, {"id": 254, "start": 2113.48, "end": 2115.48, "text": "Is my new desktop."}, {"id": 255, "start": 2117.48, "end": 2118.48, "text": "Descope."}, {"id": 256, "start": 2119.48, "end": 2121.48, "text": "Mein Vater hat früher immer gesagt, Descope."}, {"id": 257, "start": 2122.48, "end": 2124.48, "text": "Ich glaube, der weiß bis heute nicht, dass es Desktop heißt."}, {"id": 258, "start": 2125.48, "end": 2126.48, "text": "Descope."}, {"id": 259, "start": 2127.48, "end": 2129.48, "text": "A real desktop."}, {"id": 260, "start": 2130.48, "end": 2131.48, "text": "Descope."}, {"id": 261, "start": 2132.48, "end": 2133.48, "text": "Descope."}, {"id": 262, "start": 2134.48, "end": 2135.48, "text": "Descope."}, {"id": 263, "start": 2136.48, "end": 2137.48, "text": "Descope."}, {"id": 264, "start": 2137.48, "end": 2138.48, "text": "Descope."}, {"id": 265, "start": 2139.48, "end": 2140.48, "text": "Ranking Linux Environments."}, {"id": 266, "start": 2141.48, "end": 2142.48, "text": "Oh ne, oh ne."}, {"id": 267, "start": 2143.48, "end": 2144.48, "text": "Das ist der Firefox Dude, oder?"}, {"id": 268, "start": 2160.48, "end": 2163.48, "text": "Das ist doch der Firefox Dude, der in einem Video erzählt hat,"}, {"id": 269, "start": 2163.48, "end": 2168.48, "text": "dass er es nicht mehr irgendwie vertreten kann, Firefox zu benutzen."}, {"id": 270, "start": 2169.48, "end": 2172.48, "text": "Und dann hat er zwei Wochen später ein Video gemacht,"}, {"id": 271, "start": 2173.48, "end": 2174.48, "text": "ich benutze wieder Firefox."}, {"id": 272, "start": 2175.48, "end": 2177.48, "text": "Das ist einfach fett, das ist er doch, oder?"}, {"id": 273, "start": 2178.48, "end": 2179.48, "text": "Sekunde."}, {"id": 274, "start": 2180.48, "end": 2183.48, "text": "Äh, hatte YouTube nicht mal einen Suchenknopf?"}, {"id": 275, "start": 2184.48, "end": 2185.48, "text": "Firefox."}, {"id": 276, "start": 2185.48, "end": 2187.48, "text": "Hier, I'm leaving Firefox."}, {"id": 277, "start": 2191.48, "end": 2193.48, "text": "Genau, I'm leaving Firefox."}, {"id": 278, "start": 2194.48, "end": 2197.48, "text": "Und dann hat er einen Monat später ein Video gemacht."}, {"id": 279, "start": 2199.48, "end": 2201.48, "text": "Was not fun, er ist wieder bei Firefox zurück."}, {"id": 280, "start": 2202.48, "end": 2203.48, "text": "Alles klar."}, {"id": 281, "start": 2204.48, "end": 2208.48, "text": "Vor allem, seriously, der wollte diesen reudigen Gnome-Default-Browser,"}, {"id": 282, "start": 2209.48, "end": 2211.48, "text": "der wollte diesen reudigen Gnome-Default-Browser,"}, {"id": 283, "start": 2211.48, "end": 2215.48, "text": "der wollte diesen reudigen Gnome-Default-Browser verwenden,"}, {"id": 284, "start": 2216.48, "end": 2220.48, "text": "was jedem von uns im Stream sofort klar war, dass das nicht funktionieren würde."}, {"id": 285, "start": 2221.48, "end": 2223.48, "text": "Das heißt nicht nur, dass man sowas nicht probieren kann,"}, {"id": 286, "start": 2224.48, "end": 2227.48, "text": "aber in dem Fall, es gibt doch keinen nennenswerten Browser"}, {"id": 287, "start": 2228.48, "end": 2229.48, "text": "neben Firefox und Chrome."}, {"id": 288, "start": 2229.48, "end": 2235.48, "text": "Ich warte jetzt drauf, bis die Apple-Fanboys kommen."}, {"id": 289, "start": 2244.48, "end": 2246.48, "text": "Das sind alles, das ist alles Chrome, Leute."}, {"id": 290, "start": 2247.48, "end": 2250.48, "text": "Brave ist Chrome, Opera ist Chrome, Edge ist Chrome,"}, {"id": 291, "start": 2251.48, "end": 2252.48, "text": "das zählt für mich alles rein."}, {"id": 292, "start": 2253.48, "end": 2254.48, "text": "Aber hier hat er recht."}, {"id": 293, "start": 2255.48, "end": 2256.48, "text": "Was ist denn mit Safari?"}, {"id": 294, "start": 2256.48, "end": 2258.48, "text": "Tja, Safari taugt leider nix."}, {"id": 295, "start": 2260.48, "end": 2262.48, "text": "Liebre Wolf ist Gecko, ja, dann ist es Firefox."}, {"id": 296, "start": 2263.48, "end": 2265.48, "text": "Ich sagte doch, es gibt keinen nennenswerten Browser"}, {"id": 297, "start": 2266.48, "end": 2267.48, "text": "neben Firefox und Chrome."}, {"id": 298, "start": 2271.48, "end": 2272.48, "text": "Safari ist..."}, {"id": 299, "start": 2275.48, "end": 2276.48, "text": "Müll."}, {"id": 300, "start": 2277.48, "end": 2279.48, "text": "Safari ist, was Web-Standards angeht, so weit hinten dran,"}, {"id": 301, "start": 2280.48, "end": 2281.48, "text": "aus mehreren Kombinationen."}, {"id": 302, "start": 2282.48, "end": 2284.48, "text": "Ich bin mir gar nicht so sicher, woran es geht."}, {"id": 303, "start": 2284.48, "end": 2286.48, "text": "Einmal möchte Apple einiges nicht unterstützen,"}, {"id": 304, "start": 2287.48, "end": 2291.48, "text": "weil Apple beispielsweise sowas wie PWAs halt nicht mag auf dem iPhone."}, {"id": 305, "start": 2292.48, "end": 2295.48, "text": "Weil halt im Zweifelsfall die ein bisschen Konkurrenz machen zu..."}, {"id": 306, "start": 2297.48, "end": 2298.48, "text": "ihrem App-Store."}, {"id": 307, "start": 2299.48, "end": 2300.48, "text": "Was ist denn das?"}, {"id": 308, "start": 2301.48, "end": 2302.48, "text": "Oh, das hab ich auf Hacker-News gelesen."}, {"id": 309, "start": 2304.48, "end": 2305.48, "text": "Das hab ich auf Hacker gelesen."}, {"id": 310, "start": 2306.48, "end": 2307.48, "text": "Carbon... Carbonöl."}, {"id": 311, "start": 2309.48, "end": 2310.48, "text": "Das ist..."}, {"id": 312, "start": 2310.48, "end": 2312.48, "text": "Docker Run... Okay."}, {"id": 313, "start": 2313.48, "end": 2315.48, "text": "Das probieren wir jetzt aus, Leute."}, {"id": 314, "start": 2316.48, "end": 2317.48, "text": "Docker Run..."}, {"id": 315, "start": 2318.48, "end": 2319.48, "text": "Things... Bam."}, {"id": 316, "start": 2323.48, "end": 2326.48, "text": "Wir gucken uns jetzt... Wir gucken uns jetzt YouTube im Terminal an."}, {"id": 317, "start": 2327.48, "end": 2328.48, "text": "YouTube in Docker im Terminal."}, {"id": 318, "start": 2330.48, "end": 2331.48, "text": "Und wisst ihr, was das Schlimme ist?"}, {"id": 319, "start": 2332.48, "end": 2334.48, "text": "Das funktioniert auch noch halbwegs."}, {"id": 320, "start": 2335.48, "end": 2336.48, "text": "Guckt euch das mal an."}, {"id": 321, "start": 2336.48, "end": 2340.48, "text": "Das funktioniert auch noch halbwegs. Guckt euch das mal an."}, {"id": 322, "start": 2343.48, "end": 2344.48, "text": "Das funktioniert."}, {"id": 323, "start": 2345.48, "end": 2347.48, "text": "Vollständiges YouTube im Terminal."}, {"id": 324, "start": 2352.48, "end": 2355.48, "text": "Ohne Ads? Nee, mit Ads."}, {"id": 325, "start": 2357.48, "end": 2360.48, "text": "Ich mein, mein, mein... Man erkennt den Channel."}, {"id": 326, "start": 2360.48, "end": 2366.48, "text": "Was ist das? Das ist Carbon... Carbonöl."}, {"id": 327, "start": 2367.48, "end": 2368.48, "text": "Irgendjemand hat..."}, {"id": 328, "start": 2370.48, "end": 2371.48, "text": "hat Firefox..."}, {"id": 329, "start": 2372.48, "end": 2373.48, "text": "Nee, Chrome?"}, {"id": 330, "start": 2374.48, "end": 2376.48, "text": "Weiß ich gar nicht. Was hat er genommen?"}, {"id": 331, "start": 2380.48, "end": 2381.48, "text": "Chrome."}, {"id": 332, "start": 2382.48, "end": 2387.48, "text": "Der hat irgendwie einen neuen Renderer eingebaut in Chrome oder sowas."}, {"id": 333, "start": 2387.48, "end": 2390.48, "text": "Und hat halt als Output..."}, {"id": 334, "start": 2391.48, "end": 2394.48, "text": "was genommen, was man auch im Terminal rendern kann."}, {"id": 335, "start": 2397.48, "end": 2400.48, "text": "Komm mal, jetzt können wir uns Werbung..."}, {"id": 336, "start": 2401.48, "end": 2403.48, "text": "Pixelated YouTube Werbung angucken."}, {"id": 337, "start": 2404.48, "end": 2405.48, "text": "Porgas."}, {"id": 338, "start": 2406.48, "end": 2408.48, "text": "Ey, gut, Sound haben wir hier nicht."}, {"id": 339, "start": 2409.48, "end": 2410.48, "text": "Alles klar, oder?"}, {"id": 340, "start": 2411.48, "end": 2412.48, "text": "Settings..."}, {"id": 341, "start": 2412.48, "end": 2415.48, "text": "Also Text und so wird wirklich gut gerendert, kann man nichts sagen."}, {"id": 342, "start": 2416.48, "end": 2417.48, "text": "1044p."}, {"id": 343, "start": 2418.48, "end": 2421.48, "text": "Nee, Leute, wenn man das weiß, dass es Battlefield 4 ist,"}, {"id": 344, "start": 2422.48, "end": 2427.48, "text": "könnte man dazu geneigt sein, zu erkennen, dass es Battlefield 4 ist."}, {"id": 345, "start": 2428.48, "end": 2429.48, "text": "Oder?"}, {"id": 346, "start": 2430.48, "end": 2433.48, "text": "Also wenn man es weiß, wenn man es nicht weiß, erkennt man es ehrlich gesagt nicht."}, {"id": 347, "start": 2434.48, "end": 2435.48, "text": "Ja."}, {"id": 348, "start": 2437.48, "end": 2440.48, "text": "So kann ich sogar Booba-Videos gucken im Stream."}, {"id": 349, "start": 2440.48, "end": 2441.48, "text": "Ja."}, {"id": 350, "start": 2444.48, "end": 2448.48, "text": "Da könnte ich sogar auf Pornhub und man würde nichts erkennen im Stream."}, {"id": 351, "start": 2450.48, "end": 2453.48, "text": "Funktioniert Twitch? Bestimmt, bestimmt funktioniert Twitch."}, {"id": 352, "start": 2454.48, "end": 2456.48, "text": "Oh, da muss ich, da muss ich..."}, {"id": 353, "start": 2457.48, "end": 2458.48, "text": "Twitch."}, {"id": 354, "start": 2459.48, "end": 2462.48, "text": "Punkt TV slash WoBloas aufmachen."}, {"id": 355, "start": 2462.48, "end": 2463.48, "text": "Ach."}, {"id": 356, "start": 2465.48, "end": 2466.48, "text": "Ach, ja."}, {"id": 357, "start": 2474.48, "end": 2475.48, "text": "Okay."}, {"id": 358, "start": 2478.48, "end": 2479.48, "text": "Ach, ja, okay."}, {"id": 359, "start": 2480.48, "end": 2482.48, "text": "Also Twitch funktioniert nicht."}, {"id": 360, "start": 2483.48, "end": 2484.48, "text": "Was mich jetzt ehrlich gesagt wundert,"}, {"id": 361, "start": 2485.48, "end": 2487.48, "text": "ist, dass Twitch nicht funktioniert."}, {"id": 362, "start": 2487.48, "end": 2492.48, "text": "Okay, also Twitch funktioniert nicht, was mich jetzt ehrlich gesagt wundert."}, {"id": 363, "start": 2494.48, "end": 2497.48, "text": "Ich würde ja gerne Cookies accepten, wenn es funktioniert."}, {"id": 364, "start": 2502.48, "end": 2505.48, "text": "Was steht hier drauf? Safe Changes, perfekt."}, {"id": 365, "start": 2506.48, "end": 2509.48, "text": "Accept Cookies, accept Cookies, manage Cookies."}, {"id": 366, "start": 2511.48, "end": 2514.48, "text": "Okay, wir accepten, wir accepten einfach alles."}, {"id": 367, "start": 2514.48, "end": 2517.48, "text": "Nielsen, Nielsen ist super. Gibt es nicht sowas wie..."}, {"id": 368, "start": 2521.48, "end": 2523.48, "text": "Gibt es nicht einfach so wie alles accept, man?"}, {"id": 369, "start": 2525.48, "end": 2527.48, "text": "Dann geht das bestimmt auch, wenn man Cookies acceptet."}, {"id": 370, "start": 2528.48, "end": 2531.48, "text": "Weil der Cookies accepten Knopf ist kaputt."}, {"id": 371, "start": 2532.48, "end": 2533.48, "text": "Okay."}, {"id": 372, "start": 2540.48, "end": 2541.48, "text": "Okay, funktioniert nicht."}, {"id": 373, "start": 2541.48, "end": 2547.48, "text": "Aber es ist unglaublich, wie viel einzelne Leute mit guten Ideen hinbekommen, oder?"}, {"id": 374, "start": 2550.48, "end": 2552.48, "text": "Twitch will das nicht wegen Ads."}, {"id": 375, "start": 2553.48, "end": 2555.48, "text": "Twitch merkt das doch gar nicht, das ist ein ganz normaler Chrome."}, {"id": 376, "start": 2556.48, "end": 2558.48, "text": "Twitch weiß doch nicht, wohin der Chrome rendert."}, {"id": 377, "start": 2558.48, "end": 2562.48, "text": "Nein, du kannst da drin theoretisch alles anschauen."}, {"id": 378, "start": 2567.48, "end": 2569.48, "text": "Aber schon mega nice, oder?"}, {"id": 379, "start": 2571.48, "end": 2576.48, "text": "Dass sowas funktioniert. FFM-Pack installiert. Wozu?"}, {"id": 380, "start": 2576.48, "end": 2583.48, "text": "Außerdem habe ich FFM-Pack installiert, aber es hat damit überhaupt nichts zu tun."}, {"id": 381, "start": 2584.48, "end": 2591.48, "text": "Chainlore, Chainlore will mit der Temp-timeoutet werden."}, {"id": 382, "start": 2592.48, "end": 2593.48, "text": "Okay."}, {"id": 383, "start": 2595.48, "end": 2596.48, "text": "Okay."}, {"id": 384, "start": 2597.48, "end": 2598.48, "text": "Okay."}, {"id": 385, "start": 2599.48, "end": 2600.48, "text": "Okay."}, {"id": 386, "start": 2601.48, "end": 2602.48, "text": "Okay."}, {"id": 387, "start": 2603.48, "end": 2604.48, "text": "Okay."}, {"id": 388, "start": 2604.48, "end": 2605.48, "text": "Okay."}, {"id": 389, "start": 2606.48, "end": 2607.48, "text": "Okay."}, {"id": 390, "start": 2608.48, "end": 2609.48, "text": "Okay."}, {"id": 391, "start": 2610.48, "end": 2611.48, "text": "Okay."}, {"id": 392, "start": 2611.48, "end": 2623.36, "text": "das immer aus testen sei froh dass der patrick nicht dabei der hätte schon"}, {"id": 393, "start": 2623.36, "end": 2628.0, "text": "längst wieder temp gebannt alle wie oft wollen die uns noch dieses buber wie ich"}, {"id": 394, "start": 2628.0, "end": 2633.08, "text": "will das buber video nicht sehen mann youtube kannst du mich in ruhe lassen"}, {"id": 395, "start": 2633.08, "end": 2648.08, "text": "ok geht hast du von dem was auch immer und noch was was auch immer liegt mit"}, {"id": 396, "start": 2648.08, "end": 2653.36, "text": "bekommen ne ich weiß nicht was das ist"}, {"id": 397, "start": 2653.36, "end": 2664.24, "text": "liegt er von forensik tools aber ich noch nie habe ich noch nie mitbekommen den"}, {"id": 398, "start": 2664.24, "end": 2666.8, "text": "letzten größeren liegt den ich mitbekommen habe war glaube ich der"}, {"id": 399, "start": 2666.8, "end": 2671.44, "text": "gta 6 liegt ich glaube das war das letzte letzte groß ding wo ich mich"}, {"id": 400, "start": 2671.44, "end": 2676.48, "text": "dran erinnern kann weil es auch schon nie wobei das kann nicht sein das ist ja"}, {"id": 401, "start": 2676.48, "end": 2680.64, "text": "schon wieder ein jahr her da gab es in der zwischenzeit schon 800 neun liegs"}, {"id": 402, "start": 2680.64, "end": 2685.36, "text": "hast du das mit das habe ich mitbekommen argentinische pesos und paypal ich weiß"}, {"id": 403, "start": 2685.36, "end": 2689.84, "text": "nicht mehr genau was das hat das habe ich auf jeden fall mitgekriegt"}, {"id": 404, "start": 2694.8, "end": 2699.28, "text": "wo wir gerade wo wir gerade bei tricks sind wisst ihr was wisst ihr was mir"}, {"id": 405, "start": 2699.28, "end": 2706.12, "text": "aufgefallen ist also ich habe ja youtube premium ich habe youtube premium"}, {"id": 406, "start": 2706.12, "end": 2714.44, "text": "allerdings über einen account der ein payment profil in indien hat das heißt"}, {"id": 407, "start": 2714.44, "end": 2721.96, "text": "ich bezahle irgendwie 300 indischen rupien was irgendwie vier euro sind oder"}, {"id": 408, "start": 2721.96, "end": 2725.44, "text": "dreieinhalb dreieinhalb euro versus 14 euro sondern wisst ihr was mir jetzt"}, {"id": 409, "start": 2725.44, "end": 2729.76, "text": "aufgefallen ist es und zwar in youtube premium das wusste ich bis jetzt gar"}, {"id": 410, "start": 2729.76, "end": 2737.44, "text": "nicht ist youtube music premium mit drin oder premium mit drinne was im endeffekt"}, {"id": 411, "start": 2737.44, "end": 2743.2, "text": "bedeutet dass ich amazon unlimited music jetzt gekündigt habe gucke ich einfach"}, {"id": 412, "start": 2743.2, "end": 2750.0, "text": "über youtube wenn es eben preis schon drinne ist ja so sieht es aus never"}, {"id": 413, "start": 2750.0, "end": 2754.96, "text": "sat never donated er block on stone laptop nevers wifi wobei es da noch"}, {"id": 414, "start": 2754.96, "end": 2762.88, "text": "bessere versionen von gibt die auch bis jetzt habe ich alles gefunden was ich"}, {"id": 415, "start": 2762.88, "end": 2768.56, "text": "gesucht habe das einzig blöde ist aber damit hätte ich rechnen können das"}, {"id": 416, "start": 2768.56, "end": 2773.36, "text": "einzig das ein richtig genau das wollte ich gerade sagen das einzig blöde ist"}, {"id": 417, "start": 2773.36, "end": 2777.44, "text": "wenn du auf aktuelle sachen gräst kriegst du irgendwelche bollywood charts"}, {"id": 418, "start": 2777.44, "end": 2782.2, "text": "vorgeschlagen das ist aber nicht weiter wild weil du kannst in die verschiedenen"}, {"id": 419, "start": 2782.2, "end": 2785.88, "text": "genres gehen dann ist es alles ok und das lernt nach wie vor was du gerne"}, {"id": 420, "start": 2785.88, "end": 2789.44, "text": "hörst und kriegst dann kaum indische sachen wenn du aber guckst top aktuell"}, {"id": 421, "start": 2789.44, "end": 2792.52, "text": "dann kriegst du irgendwelche indische indischen pop vorgeschlagen wenn du in"}, {"id": 422, "start": 2792.52, "end": 2799.04, "text": "den indischen account hat wen juck dafür kostet es einfach zehn euro weniger"}, {"id": 423, "start": 2800.92, "end": 2805.08, "text": "ups zwei mal starten geht nicht dann ist es procken"}, {"id": 424, "start": 2805.08, "end": 2815.4, "text": "geht das geht das noch ja geht noch guck dir das mal an wenn du das nämlich"}, {"id": 425, "start": 2815.4, "end": 2818.96, "text": "hast brauchst du kein spotify mehr du brauchst kein unlimited mehr"}, {"id": 426, "start": 2818.96, "end": 2824.84, "text": "funktioniert alles funktioniert alles gut ich habe vorhin gesehen mein"}, {"id": 427, "start": 2824.84, "end": 2829.96, "text": "lieblings c-sharp content creator hat neues video wollte ich mir nachher eh"}, {"id": 428, "start": 2829.96, "end": 2835.48, "text": "angucken es gibt nämlich in c-sharp 12 gibt es neue konstrukte neue konstruktors"}, {"id": 429, "start": 2835.48, "end": 2839.0, "text": "vielleicht gucken wir uns später noch an kann ich übrigens seinen content kann"}, {"id": 430, "start": 2839.0, "end": 2842.68, "text": "ich nur empfehlen also wenn ihr dort net verwendet beziehungsweise c-sharp"}, {"id": 431, "start": 2842.68, "end": 2845.68, "text": "entwickler seid oder euch die plattform interessiert der macht wirklich gute"}, {"id": 432, "start": 2845.68, "end": 2871.56, "text": "videos zu warum ist ein twitch chat so komisch du meinst der hier ganz einfach"}, {"id": 433, "start": 2871.56, "end": 2877.84, "text": "weil ich nicht eingeloggt bin in meinem vorschau auf dem zweiten monitor sehe ich"}, {"id": 434, "start": 2877.84, "end": 2879.96, "text": "das"}, {"id": 435, "start": 2885.36, "end": 2892.24, "text": "noch überhaupt nichts instabiles gemerkt bisher na gut der refreshed nur"}, {"id": 436, "start": 2892.24, "end": 2896.76, "text": "einmal die sekunde du kannst es auch höher stellen dass er alle alle 500"}, {"id": 437, "start": 2896.76, "end": 2900.76, "text": "millisekunden refreshed und sowas der refreshed einmal in der sekunde also wenn"}, {"id": 438, "start": 2900.76, "end": 2904.32, "text": "du jetzt beispielsweise die ansatz wenn du hier die oben die anzeige hast ob"}, {"id": 439, "start": 2904.32, "end": 2908.72, "text": "deine nun deine num lock taste gedrückt ist dann dauert es dann dauert es mal"}, {"id": 440, "start": 2908.72, "end": 2911.28, "text": "ein bisschen kurz aber das ist nicht schlimm einmal die sekunde update von"}, {"id": 441, "start": 2911.28, "end": 2918.6, "text": "aus status bar reich doch bin ich gut ich finde aber die features nice"}, {"id": 442, "start": 2918.6, "end": 2922.48, "text": "vielleicht gebe ich mir doch mal irgendwann poli bar oder sonst was aber"}, {"id": 443, "start": 2922.48, "end": 2925.68, "text": "bis jetzt bin ich eigentlich ganz zufrieden mit meiner billigen status"}, {"id": 444, "start": 2925.68, "end": 2941.76, "text": "leistet aber das billigen trotzdem nice was alles angezeigt wird"}, {"id": 445, "start": 2941.76, "end": 2945.96, "text": "das arch beide weh selbstverständlich"}, {"id": 446, "start": 2948.72, "end": 2955.2, "text": "doch kannst du aber anscheinend denkt youtube musik trotzdem du bist in indien"}, {"id": 447, "start": 2955.2, "end": 2962.52, "text": "braucht man nicht poli bar das kannst du für so was wie für status leisten zum"}, {"id": 448, "start": 2962.52, "end": 2965.76, "text": "beispiel verwenden nur dass er dann noch coolere sachen machen kannst so laut"}, {"id": 449, "start": 2965.76, "end": 2971.88, "text": "stärker anzeigen alles mögliche brauchen tut man das nicht wirklich"}, {"id": 450, "start": 2971.88, "end": 2980.68, "text": "wenn man gerne rumbastelt ist es vielleicht ganz cool"}, {"id": 451, "start": 2985.04, "end": 2986.0, "text": "jep klock"}, {"id": 452, "start": 2991.8, "end": 2999.4, "text": "anything you called i'll pay for das ist das ist das ist so schnell geschnitten ist"}, {"id": 453, "start": 2999.4, "end": 3010.52, "text": "ist ist das ein was ist mit den leuten los ist das ein software entwicklungs"}, {"id": 454, "start": 3010.52, "end": 3015.84, "text": "influencer nein ja ja und nein"}, {"id": 455, "start": 3015.84, "end": 3039.0, "text": "zuma участlichen ja ja"}, {"id": 456, "start": 3039.0, "end": 3046.8, "text": "The Most Powerful Software Development Process is the Easiest."}, {"id": 457, "start": 3046.8, "end": 3051.0, "text": "Kommt auf die Software an würde ich mal sagen."}, {"id": 458, "start": 3051.0, "end": 3055.0, "text": "Der Most Powerful Software Development Process ist der, der passt zu dem was man entwickeln"}, {"id": 459, "start": 3055.0, "end": 3056.0, "text": "will."}, {"id": 460, "start": 3056.0, "end": 3061.28, "text": "YouTube gehen auch langsam echt die Ideen aus oder?"}, {"id": 461, "start": 3061.28, "end": 3065.52, "text": "Was ich gucken will, das ist immer der gleiche Kram."}, {"id": 462, "start": 3065.52, "end": 3071.96, "text": "Und ehrlich gesagt, ich benutze zwar Thunderbird, aber die Zukunft von Thunderbird, die interessiert"}, {"id": 463, "start": 3071.96, "end": 3072.96, "text": "mich jetzt auch nicht so wahnsinnig."}, {"id": 464, "start": 3072.96, "end": 3077.4, "text": "Wie kriegst du die Transparenz hin, welche Transparenz, du meinst das hier?"}, {"id": 465, "start": 3077.4, "end": 3083.92, "text": "Ach hier oben, hier oben, ja das ist ein bisschen dreckreich."}, {"id": 466, "start": 3083.92, "end": 3099.16, "text": "Jett, wer von euch hat gerade meinen Twitch-Account geöffnet?"}, {"id": 467, "start": 3099.16, "end": 3109.36, "text": "Ah ok, dann weiß ich ja was es war."}, {"id": 468, "start": 3109.36, "end": 3121.12, "text": "Ne ich bin aus Versehen wahrscheinlich einfach hier drauf gekommen."}, {"id": 469, "start": 3121.12, "end": 3125.0, "text": "Was ist denn ein Nicht-Real-DNS, keine Ahnung wie du da drauf kommst jetzt."}, {"id": 470, "start": 3125.0, "end": 3130.76, "text": "Was du machen musst ist folgendes, wenn du es transparent machen willst, das hier musst"}, {"id": 471, "start": 3130.76, "end": 3131.76, "text": "du machen."}, {"id": 472, "start": 3131.76, "end": 3135.96, "text": "Guck mal, das musst du einfügen, einfügen."}, {"id": 473, "start": 3135.96, "end": 3146.16, "text": "I3 Bar Command I3 Bar Minus T, das Minus T ist wichtig, weil das Minus T für Transparency"}, {"id": 474, "start": 3146.16, "end": 3147.16, "text": "steht."}, {"id": 475, "start": 3147.16, "end": 3150.92, "text": "Und wenn du das so machst, dann funktioniert es, dann ist deine Bar auch transparent."}, {"id": 476, "start": 3150.92, "end": 3160.08, "text": "Forscher war ein Video mit einem Real-DNS, keine Ahnung, ja zu spät, jetzt habe ich"}, {"id": 477, "start": 3160.08, "end": 3161.08, "text": "schon zugemacht."}, {"id": 478, "start": 3161.08, "end": 3170.32, "text": "Oder meinste hier Real-DNS, you want a Real-DNS-Server at home, ah ok, der erzählt dir wahrscheinlich"}, {"id": 479, "start": 3170.32, "end": 3174.92, "text": "dass du Bind verwenden kannst und 30 Milliarden Optionen zum einstellen hast."}, {"id": 480, "start": 3174.92, "end": 3181.4, "text": "Ich glaube mit Real meint er nicht, dass das der einzige DNS-Server ist, der richtiges"}, {"id": 481, "start": 3181.4, "end": 3185.96, "text": "DNS machen kann, sondern er meint das ist quasi ein echter DNS-Server, also quasi nicht"}, {"id": 482, "start": 3185.96, "end": 3191.92, "text": "irgendwie einfach nur so ein Spielzeug-DNS-Server, sondern einer der alles kann und Millionen"}, {"id": 483, "start": 3191.92, "end": 3193.92, "text": "Client-Requests kann und sowas."}, {"id": 484, "start": 3193.92, "end": 3200.48, "text": "Ich mein, Bind ist ja seit 40 Jahren oder so der DNS-Server schlechthin, leider von"}, {"id": 485, "start": 3200.48, "end": 3217.76, "text": "der Konfig auch abfuck, abfuck-es-fuck, die beiden Konfig, ne ne ne ne ne ne ne ne, das"}, {"id": 486, "start": 3217.76, "end": 3226.2, "text": "stimmt nicht, das stimmt nicht."}, {"id": 487, "start": 3226.2, "end": 3232.56, "text": "Also es sind, es sind alle YouTube-Videos im Katalog, also du kannst auf YouTube-Music"}, {"id": 488, "start": 3232.56, "end": 3239.12, "text": "auch automatisch alle YouTube-Videos gucken wo die als Musikgeflaggt sind, aber die haben"}, {"id": 489, "start": 3239.12, "end": 3243.56, "text": "auch noch mehrere Sachen, zum Beispiel habe ich letztens gehört und das ist bestimmt"}, {"id": 490, "start": 3243.56, "end": 3256.08, "text": "nicht public auf YouTube, habe ich gehört Inflames, so, ok das hat irgendeinen Dude"}, {"id": 491, "start": 3256.08, "end": 3260.44, "text": "hochgeladen, aber ich habe mir nicht das, ich habe mir nicht das Album in einem Stück"}, {"id": 492, "start": 3260.44, "end": 3268.4, "text": "angehört, sondern, wait a minute, der Kram ist public auf YouTube?"}, {"id": 493, "start": 3268.4, "end": 3285.44, "text": "Kann doch nicht sein, ne das, warte mal, warte mal, warte mal, ok, ok, ok, ok, ok,"}, {"id": 494, "start": 3285.44, "end": 3293.4, "text": "ok, jetzt mal richtig cringy, cringy Power-Metal suchen, der kann doch nicht public auf YouTube"}, {"id": 495, "start": 3293.4, "end": 3306.84, "text": "sein, na teilweise, aber nicht das, aber nicht das, nicht das gesamte Album, nicht das, ne"}, {"id": 496, "start": 3306.84, "end": 3311.56, "text": "ne ne, du hast schon noch extra, du hast schon noch extra Tracks, also ich habe bisher alles"}, {"id": 497, "start": 3311.56, "end": 3317.28, "text": "das, was ich auf Amazon sonst gehört hatte auch bei YouTube Music gefunden und der Katalog"}, {"id": 498, "start": 3317.28, "end": 3334.48, "text": "soll auch relativ gut sein, ich habe, ja, tatsächlich, ja Moment, weil ich hier eingeloggt bin, ja"}, {"id": 499, "start": 3334.48, "end": 3340.52, "text": "Moment, das ist die Free-Version, was du jetzt gezeigt hast ist die Free-Version von Google"}, {"id": 500, "start": 3340.52, "end": 3345.52, "text": "Music, ja, was auch immer, ehrlich gesagt ist mir es egal, ich habe bisher alles, was"}, {"id": 501, "start": 3345.52, "end": 3355.52, "text": "ich bei Amazon gehört habe auch auf YouTube gefunden, hast du das Video von Tim Gabel"}, {"id": 502, "start": 3355.52, "end": 3367.36, "text": "mit Morphoist gesehen, ne, um was ging es da, nicht, dass ich das lohne anzugucken, ok,"}, {"id": 503, "start": 3367.36, "end": 3371.72, "text": "das war, komm wir müssen jetzt, wir müssen jetzt nochmal ein bisschen was an uns anschauen,"}, {"id": 504, "start": 3371.72, "end": 3378.12, "text": "Windows XP Steam, ok, ich will einfach wissen, wie jebaited wir werden, achso, jeder macht"}, {"id": 505, "start": 3378.12, "end": 3382.6, "text": "irgendwelche Chat-GPT Videos, man, ich kann es bald nicht mehr sehen, gut, es geht halt"}, {"id": 506, "start": 3382.6, "end": 3396.36, "text": "auch einfach gut gerade, wir gucken jetzt das hier, das ist nur ein Remote-Screen, das ist"}, {"id": 507, "start": 3396.36, "end": 3420.12, "text": "nur ein Remote-Screen, ja, dann gucken wir mal, wie jebaited wir werden, ich skippe da"}, {"id": 508, "start": 3420.12, "end": 3441.96, "text": "mal drüber, ok, Unboxing, ok, das sieht, das sieht aber wirklich nach Budget aus, das"}, {"id": 509, "start": 3441.96, "end": 3459.96, "text": "sieht aus wie ein Navigationsgerät, das sieht aus wie ein Navigationsgerät, GMA 900, lul,"}, {"id": 510, "start": 3459.96, "end": 3472.96, "text": "Alter, ich weiß doch gar nicht, was ist denn ein Zehneron, M-U-L-V, GMA 900, da weißt du"}, {"id": 511, "start": 3472.96, "end": 3487.16, "text": "schon, das ist von 2008 oder so, Discount, ja, sag ich doch, lul, Erscheinungsdatum 2005,"}, {"id": 512, "start": 3487.16, "end": 3497.64, "text": "das ist nur 6545 Tage alt, ich glaube, wir haben sogar, wir haben das nicht animierte"}, {"id": 513, "start": 3497.64, "end": 3518.52, "text": "Becherst nur, ich spule ein bisschen vor, ich spule ein bisschen vor, ich spule ein bisschen"}, {"id": 514, "start": 3518.52, "end": 3519.52, "text": "vor,"}, {"id": 515, "start": 3519.52, "end": 3536.04, "text": "was will er eigentlich damit, ich meine, das ist eine Kiste von 2005, damit kannst du,"}, {"id": 516, "start": 3536.04, "end": 3557.08, "text": "ich meine, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 517, "start": 3557.08, "end": 3573.52, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 518, "start": 3573.52, "end": 3591.44, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 519, "start": 3591.44, "end": 3607.88, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 520, "start": 3607.88, "end": 3636.6, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 521, "start": 3636.6, "end": 3665.16, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 522, "start": 3665.16, "end": 3687.8, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 523, "start": 3687.8, "end": 3705.72, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 524, "start": 3705.72, "end": 3731.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 525, "start": 3731.64, "end": 3759.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 526, "start": 3759.64, "end": 3787.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 527, "start": 3787.64, "end": 3815.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 528, "start": 3815.64, "end": 3843.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 529, "start": 3843.64, "end": 3865.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 530, "start": 3865.64, "end": 3893.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 531, "start": 3893.64, "end": 3921.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 532, "start": 3921.64, "end": 3941.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 533, "start": 3941.64, "end": 3959.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 534, "start": 3959.64, "end": 3979.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 535, "start": 3979.64, "end": 4003.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 536, "start": 4003.64, "end": 4023.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 537, "start": 4023.64, "end": 4047.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 538, "start": 4047.64, "end": 4067.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 539, "start": 4067.64, "end": 4087.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 540, "start": 4087.64, "end": 4111.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 541, "start": 4111.64, "end": 4131.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 542, "start": 4131.64, "end": 4155.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 543, "start": 4155.64, "end": 4175.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 544, "start": 4175.64, "end": 4195.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 545, "start": 4195.64, "end": 4215.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 546, "start": 4215.64, "end": 4235.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 547, "start": 4235.64, "end": 4255.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 548, "start": 4255.64, "end": 4279.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 549, "start": 4279.64, "end": 4299.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 550, "start": 4299.64, "end": 4319.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 551, "start": 4319.64, "end": 4343.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 552, "start": 4343.64, "end": 4363.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 553, "start": 4363.64, "end": 4383.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 554, "start": 4383.64, "end": 4407.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 555, "start": 4407.64, "end": 4427.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 556, "start": 4427.64, "end": 4451.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 557, "start": 4451.64, "end": 4471.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 558, "start": 4471.64, "end": 4495.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 559, "start": 4495.64, "end": 4515.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 560, "start": 4515.64, "end": 4539.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 561, "start": 4539.64, "end": 4559.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 562, "start": 4559.64, "end": 4583.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 563, "start": 4583.64, "end": 4603.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 564, "start": 4603.64, "end": 4627.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 565, "start": 4627.64, "end": 4647.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 566, "start": 4647.64, "end": 4671.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 567, "start": 4671.64, "end": 4691.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 568, "start": 4691.64, "end": 4717.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 569, "start": 4717.64, "end": 4737.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 570, "start": 4737.64, "end": 4757.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 571, "start": 4757.64, "end": 4777.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 572, "start": 4777.64, "end": 4797.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 573, "start": 4797.64, "end": 4821.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 574, "start": 4821.64, "end": 4841.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 575, "start": 4841.64, "end": 4861.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 576, "start": 4861.64, "end": 4881.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 577, "start": 4881.64, "end": 4901.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 578, "start": 4901.64, "end": 4921.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 579, "start": 4921.64, "end": 4941.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 580, "start": 4941.64, "end": 4961.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 581, "start": 4961.64, "end": 4981.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 582, "start": 4981.64, "end": 5001.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 583, "start": 5001.64, "end": 5025.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 584, "start": 5025.64, "end": 5045.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 585, "start": 5045.64, "end": 5069.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 586, "start": 5069.64, "end": 5089.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 587, "start": 5089.64, "end": 5109.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 588, "start": 5109.64, "end": 5129.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 589, "start": 5129.64, "end": 5149.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 590, "start": 5149.64, "end": 5173.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 591, "start": 5173.64, "end": 5193.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 592, "start": 5193.64, "end": 5213.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 593, "start": 5213.64, "end": 5233.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 594, "start": 5233.64, "end": 5253.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 595, "start": 5253.64, "end": 5273.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 596, "start": 5273.64, "end": 5293.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 597, "start": 5293.64, "end": 5313.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 598, "start": 5313.64, "end": 5333.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 599, "start": 5333.64, "end": 5353.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 600, "start": 5353.64, "end": 5373.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 601, "start": 5373.64, "end": 5393.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 602, "start": 5393.64, "end": 5413.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 603, "start": 5413.64, "end": 5433.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 604, "start": 5433.64, "end": 5453.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 605, "start": 5453.64, "end": 5473.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 606, "start": 5473.64, "end": 5497.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 607, "start": 5497.64, "end": 5517.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 608, "start": 5517.64, "end": 5537.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 609, "start": 5537.64, "end": 5557.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 610, "start": 5557.64, "end": 5577.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 611, "start": 5577.64, "end": 5597.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 612, "start": 5597.64, "end": 5617.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 613, "start": 5617.64, "end": 5637.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 614, "start": 5637.64, "end": 5661.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 615, "start": 5661.64, "end": 5681.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 616, "start": 5681.64, "end": 5705.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 617, "start": 5705.64, "end": 5725.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 618, "start": 5725.64, "end": 5745.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 619, "start": 5745.64, "end": 5769.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 620, "start": 5769.64, "end": 5789.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 621, "start": 5789.64, "end": 5809.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 622, "start": 5809.64, "end": 5829.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 623, "start": 5829.64, "end": 5849.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 624, "start": 5849.64, "end": 5873.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 625, "start": 5873.64, "end": 5893.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 626, "start": 5893.64, "end": 5913.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 627, "start": 5913.64, "end": 5933.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 628, "start": 5933.64, "end": 5953.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 629, "start": 5953.64, "end": 5973.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 630, "start": 5973.64, "end": 5993.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 631, "start": 5993.64, "end": 6013.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 632, "start": 6013.64, "end": 6033.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 633, "start": 6033.64, "end": 6053.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 634, "start": 6053.64, "end": 6073.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 635, "start": 6073.64, "end": 6093.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 636, "start": 6093.64, "end": 6117.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 637, "start": 6117.64, "end": 6137.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 638, "start": 6137.64, "end": 6157.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 639, "start": 6157.64, "end": 6181.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 640, "start": 6181.64, "end": 6201.64, "text": "von 2005, das ist eine Kiste von 2005, das ist eine Kiste von 2005, das ist eine Kiste"}, {"id": 641, "start": 6201.64, "end": 6221.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 642, "start": 6221.64, "end": 6245.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 643, "start": 6245.64, "end": 6265.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 644, "start": 6265.64, "end": 6289.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 645, "start": 6289.64, "end": 6309.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 646, "start": 6309.64, "end": 6329.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 647, "start": 6329.64, "end": 6349.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 648, "start": 6349.64, "end": 6369.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 649, "start": 6369.64, "end": 6393.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 650, "start": 6393.64, "end": 6413.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 651, "start": 6413.64, "end": 6437.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 652, "start": 6437.64, "end": 6463.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 653, "start": 6463.64, "end": 6491.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 654, "start": 6491.64, "end": 6517.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 655, "start": 6517.64, "end": 6537.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 656, "start": 6537.64, "end": 6557.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 657, "start": 6557.64, "end": 6577.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 658, "start": 6577.64, "end": 6597.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 659, "start": 6597.64, "end": 6617.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 660, "start": 6617.64, "end": 6637.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 661, "start": 6637.64, "end": 6657.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 662, "start": 6657.64, "end": 6677.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 663, "start": 6677.64, "end": 6701.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 664, "start": 6701.64, "end": 6721.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 665, "start": 6721.64, "end": 6745.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 666, "start": 6745.64, "end": 6765.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 667, "start": 6765.64, "end": 6789.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 668, "start": 6789.64, "end": 6809.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 669, "start": 6809.64, "end": 6829.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 670, "start": 6829.64, "end": 6853.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 671, "start": 6853.64, "end": 6873.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 672, "start": 6873.64, "end": 6893.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 673, "start": 6893.64, "end": 6917.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 674, "start": 6917.64, "end": 6937.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 675, "start": 6937.64, "end": 6961.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 676, "start": 6961.64, "end": 6981.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 677, "start": 6981.64, "end": 7001.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 678, "start": 7001.64, "end": 7021.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 679, "start": 7021.64, "end": 7041.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 680, "start": 7041.64, "end": 7065.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 681, "start": 7065.64, "end": 7085.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 682, "start": 7085.64, "end": 7113.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 683, "start": 7113.64, "end": 7133.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 684, "start": 7133.64, "end": 7153.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 685, "start": 7153.64, "end": 7173.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 686, "start": 7173.64, "end": 7193.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 687, "start": 7193.64, "end": 7213.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 688, "start": 7213.64, "end": 7233.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 689, "start": 7233.64, "end": 7253.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 690, "start": 7253.64, "end": 7273.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 691, "start": 7273.64, "end": 7293.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 692, "start": 7293.64, "end": 7313.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 693, "start": 7313.64, "end": 7333.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 694, "start": 7333.64, "end": 7353.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 695, "start": 7353.64, "end": 7373.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 696, "start": 7373.64, "end": 7393.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 697, "start": 7393.64, "end": 7413.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 698, "start": 7413.64, "end": 7437.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 699, "start": 7437.64, "end": 7457.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 700, "start": 7457.64, "end": 7481.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 701, "start": 7481.64, "end": 7501.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 702, "start": 7501.64, "end": 7525.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 703, "start": 7525.64, "end": 7545.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 704, "start": 7545.64, "end": 7569.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 705, "start": 7569.64, "end": 7589.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 706, "start": 7589.64, "end": 7609.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 707, "start": 7609.64, "end": 7633.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 708, "start": 7633.64, "end": 7653.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 709, "start": 7653.64, "end": 7673.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 710, "start": 7673.64, "end": 7697.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 711, "start": 7697.64, "end": 7717.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 712, "start": 7717.64, "end": 7741.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 713, "start": 7741.64, "end": 7769.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 714, "start": 7769.64, "end": 7789.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 715, "start": 7789.64, "end": 7813.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 716, "start": 7813.64, "end": 7833.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 717, "start": 7833.64, "end": 7861.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 718, "start": 7861.64, "end": 7887.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 719, "start": 7887.64, "end": 7913.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 720, "start": 7913.64, "end": 7933.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 721, "start": 7933.64, "end": 7953.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 722, "start": 7953.64, "end": 7973.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 723, "start": 7973.64, "end": 7997.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 724, "start": 7997.64, "end": 8017.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 725, "start": 8017.64, "end": 8037.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 726, "start": 8037.64, "end": 8057.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 727, "start": 8057.64, "end": 8077.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 728, "start": 8077.64, "end": 8101.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 729, "start": 8101.64, "end": 8121.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 730, "start": 8121.64, "end": 8141.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 731, "start": 8141.64, "end": 8161.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 732, "start": 8161.64, "end": 8181.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 733, "start": 8181.64, "end": 8201.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 734, "start": 8201.64, "end": 8221.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 735, "start": 8221.64, "end": 8245.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 736, "start": 8245.64, "end": 8265.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 737, "start": 8265.64, "end": 8285.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 738, "start": 8285.64, "end": 8305.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 739, "start": 8305.64, "end": 8325.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 740, "start": 8325.64, "end": 8345.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 741, "start": 8345.64, "end": 8365.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 742, "start": 8365.64, "end": 8385.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 743, "start": 8385.64, "end": 8409.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 744, "start": 8409.64, "end": 8429.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 745, "start": 8429.64, "end": 8453.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 746, "start": 8453.64, "end": 8473.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 747, "start": 8473.64, "end": 8493.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 748, "start": 8493.64, "end": 8513.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 749, "start": 8513.64, "end": 8533.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 750, "start": 8533.64, "end": 8553.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 751, "start": 8553.64, "end": 8577.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 752, "start": 8577.64, "end": 8597.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 753, "start": 8597.64, "end": 8623.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 754, "start": 8623.64, "end": 8649.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 755, "start": 8649.64, "end": 8669.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 756, "start": 8669.64, "end": 8689.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 757, "start": 8689.64, "end": 8713.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 758, "start": 8713.64, "end": 8733.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 759, "start": 8733.64, "end": 8753.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 760, "start": 8753.64, "end": 8773.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 761, "start": 8773.64, "end": 8793.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 762, "start": 8793.64, "end": 8813.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 763, "start": 8813.64, "end": 8833.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 764, "start": 8833.64, "end": 8853.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}, {"id": 765, "start": 8853.64, "end": 8873.64, "text": "von 2015, das ist eine Kiste von 2015, das ist eine Kiste von 2015, das ist eine Kiste"}]}