{"text": "Leute, weiter gehts. Ich bin ja richtig hier auf einem Streaming Streak. Ja, die letzten paar Tage ist man es irgendwie danach. Und heute kam ein neuer Patch raus. Ihr werdet das nicht glauben. Battlefield 2042 ist jetzt endlich ein richtiges Battlefield. Zumindest sagt das der Blogpost von EA. Ja, also der Blogpost von EA, der sagt... Moment, Moment, Moment. Ah ja, der offizielle Blogposter sagt... Wobei, das haben wir doch letzten schon gesehen. News. Ach, keine Ahnung. Twitter, Battlefield, Communication. Die haben noch irgendwas gepostet. Direct, sorry, Direct Communication natürlich. Controller-Settings sind irgendwie im Arsch. Also hier das. Known Issues. Ah, Twitter gehen wir nicht auf den Keks, mann. Zumindest ist der neue Patch am Start und es hat sich ein bisschen was getan. Wobei ich sagen muss, also es macht es nicht zu einem anderen Game, ja. Es gibt jetzt ein übergestülptes Lastensystem. Für die Specialist im Prinzip ist es noch das gleiche wie vorher. Nur, dass jeder Specialist jetzt in der Klasse zugeordnet wurde, was er vorher im Prinzip ja auch schon war. Und jetzt haben sie ein bisschen das Equipment beschränkt. Also du hast beispielsweise als Assault, hast du immer einen Medipen dabei, der übrigens nur noch einen Charge hat im Vergleich zu, glaube ich, drei oder vier, wie es früher war. Das finde ich ein bisschen arg wenig. Wobei es vielleicht ein bisschen wieder Teamplay fördert. Mal gucken. Ja und ansonsten ist es relativ an klassischen Battlefield-Gadgets orientiert. Das Spiel hat mittlerweile viel mehr Waffen, weil sie einfach das gemacht haben, was ich seit Anfang an auch schon sage. Sie haben jegliche Sachen importiert, die es an Battlefields gab. Übrigens, ich sage es schon gleich, erwarte dich jetzt nicht zu viel. Ich bin zwar nicht der allergrößte Battlefield-Loop, ich spiele das schon lange, aber ich habe ganz lange, seit dem letzten Stream, habe ich kein Battlefield mehr angefasst und eigentlich auch keinerlei Shooter großartig mehr gespielt. Also klar, so die Basics verlernst du nie. Und es war die letzten Streams auch witzig, dass ich, wie ich im Laufe des Abends immer wieder besser geworden bin. Also ich werde jetzt nicht krass abgehen. Ja, das könnte er dürftelig erwarten. Und ansonsten gucken wir uns das mal an. Vor allem, wo ich auch gespannt drauf bin, wie gut das und ob das besser auf dem neuen Rechner läuft, als auf dem alten Rechner. Ich meine, ich gehe mal davon aus. Ich meine, der alte Rechner war nach 1.700k mit 1.080ti und das ist jetzt in 13.900k mit 4090 ohne ti. Dafür RTX. Ob es mehr Spaß macht? Es wird wahrscheinlich, also ich gehe mal davon aus, es wird auf jeden Fall mehr Spaß machen, weil es flüssiger läuft. Aber, also sage ich jetzt einfach mal. Ob ich es lange spielen werde? Wahrscheinlich nicht. Ich werde auf jeden Fall ein Video zu aufnehmen, um meine Eindrücke zu ablassen. Es scheint sich jetzt alles ein bisschen battlefieldiger zu spielen, auf jeden Fall. Durch die Gadget-Begrenzung. Also du kannst jetzt nicht mehr mit Sundance rumfliegen und mit dem Recoiless-RPG aus der Luft da die Leute ab. Raketenlaunchern, das geht jetzt nicht mehr. Ich starte mal, ich starte mal. Mal gucken, wie gut das jetzt läuft. Mal kurz. Was ist das jetzt schon wieder? Wie planet man nochmal FPS ein im Battlefield? Draw, mal mal. BFZ-FPS anzeigen. Origin, ich will das nicht in Origin. Es gibt auch Draw, FPS, Overlay, irgendwas. Ich will auch nicht EA joinen. Früher war das Draw, FPS, 1 oder sowas. Mal gucken. Ach ja und ich habe die Bitrate im Stream natürlich höher gestellt, dass es heute ein bisschen besser ausschaut. Alt-R für Nvidia-Overlay. Nein, Alt-Z, nicht Alt-R. Alt-Z ist es bei mir. Und aus irgendwelchen Gründen ist das Ding der Meinung, es geht jetzt nicht mehr. Was auch immer. Okay. Und jetzt? Ist es abgekackt, oder? Ja? Game? Ich habe keinen Season Pass gekauft. Game? Das geht ja schon mal gut los. Also, dass es läuft, weiß ich. Ich habe das ja vorhin erst wieder neu frisch installiert auf dem Rechner. Ja, was ist denn jetzt? Also, ich sehe hier nichts. Okay, Task Manager. Battlefield. Ja, da ist es doch. Angeblich läuft es. Ich sehe da nichts von. Seht ihr irgendwas? Mal was nochmal aus. Mal was nochmal an. Man weiß ja nie. Das dauert doch auch schon viel zu lang. Was ist denn da schon wieder los? Ich habe es eben gestartet. Also, ich habe eben extra ausprobiert, bevor ich Stream angemacht habe, dass es geht. Erkennt das OP? What the fuck? Close your game first. Ich mache jetzt EA Play nochmal aus und wieder an. Ich habe euch übrigens absichtlich umgeschaltet. Das ist irgendwie keine Daten Leak oder sowas. Ja, es wird wahrscheinlich nichts mit Battlefield. Das scheiß Spiel startet. Ich habe es eben gestartet. Es ging ohne Probleme. Hat das vielleicht wirklich Probleme mit OBS? Weil ich hatte kein OBS laufen eben. Startet nicht. Hängt bei Anti-Cheat. Wahrscheinlich ist Anti-Cheat schuld. Keine Ahnung. Wahrscheinlich kommt jetzt demnächst ihr Account gebannt wegen Cheating-Tools oder sowas. Reboot? Es macht irgendwas. Guck mal, EA läuft mehrfach. Was passiert denn, wenn ich das jetzt beende? Was passiert, wenn ich das beende? Und das? X ist denied. Und der Scheiß geht einfach nicht. Das scheiß Loi. Ich kriege schon wieder Anfälle. Warum startet das Game jetzt einfach nicht? Jedes, aber wirklich jedes Game funktioniert einfach. Zumindest zu starten, ob es danach funktioniert oder was anderes. Nicht so Battlefield 2042. Das Game hat von Anfang an reingeschissen. Was ist neu in dem Update? Geht einfach nicht. Ich habe keinen Bock. So Leute, ich starte jetzt den Rechner neu.", "segments": [{"id": 1, "start": 30.0, "end": 37.48, "text": "Leute, weiter gehts. Ich bin ja richtig hier auf einem Streaming Streak."}, {"id": 2, "start": 37.48, "end": 45.08, "text": "Ja, die letzten paar Tage ist man es irgendwie danach. Und heute kam ein neuer Patch raus."}, {"id": 3, "start": 45.08, "end": 51.6, "text": "Ihr werdet das nicht glauben. Battlefield 2042 ist jetzt endlich ein richtiges Battlefield."}, {"id": 4, "start": 51.6, "end": 69.2, "text": "Zumindest sagt das der Blogpost von EA. Ja, also der Blogpost von EA, der sagt..."}, {"id": 5, "start": 69.2, "end": 81.84, "text": "Moment, Moment, Moment. Ah ja, der offizielle Blogposter sagt..."}, {"id": 6, "start": 81.84, "end": 85.88, "text": "Wobei, das haben wir doch letzten schon gesehen. News. Ach, keine Ahnung."}, {"id": 7, "start": 85.88, "end": 93.0, "text": "Twitter, Battlefield, Communication. Die haben noch irgendwas gepostet."}, {"id": 8, "start": 93.0, "end": 101.28, "text": "Direct, sorry, Direct Communication natürlich. Controller-Settings sind irgendwie im Arsch."}, {"id": 9, "start": 101.28, "end": 108.44, "text": "Also hier das. Known Issues. Ah, Twitter gehen wir nicht auf den Keks, mann."}, {"id": 10, "start": 108.44, "end": 112.16, "text": "Zumindest ist der neue Patch am Start und es hat sich ein bisschen was getan."}, {"id": 11, "start": 112.16, "end": 120.6, "text": "Wobei ich sagen muss, also es macht es nicht zu einem anderen Game, ja."}, {"id": 12, "start": 120.6, "end": 132.08, "text": "Es gibt jetzt ein übergestülptes Lastensystem. Für die Specialist im Prinzip ist es noch das"}, {"id": 13, "start": 132.08, "end": 138.44, "text": "gleiche wie vorher. Nur, dass jeder Specialist jetzt in der Klasse zugeordnet wurde, was er"}, {"id": 14, "start": 138.44, "end": 145.0, "text": "vorher im Prinzip ja auch schon war. Und jetzt haben sie ein bisschen das Equipment beschränkt."}, {"id": 15, "start": 145.0, "end": 149.28, "text": "Also du hast beispielsweise als Assault, hast du immer einen Medipen dabei, der übrigens nur noch"}, {"id": 16, "start": 149.28, "end": 153.84, "text": "einen Charge hat im Vergleich zu, glaube ich, drei oder vier, wie es früher war. Das finde"}, {"id": 17, "start": 153.84, "end": 159.72, "text": "ich ein bisschen arg wenig. Wobei es vielleicht ein bisschen wieder Teamplay fördert. Mal gucken."}, {"id": 18, "start": 159.72, "end": 171.04, "text": "Ja und ansonsten ist es relativ an klassischen Battlefield-Gadgets orientiert. Das Spiel hat"}, {"id": 19, "start": 171.04, "end": 174.76, "text": "mittlerweile viel mehr Waffen, weil sie einfach das gemacht haben, was ich seit Anfang an auch"}, {"id": 20, "start": 174.76, "end": 178.2, "text": "schon sage. Sie haben jegliche Sachen importiert, die es an Battlefields gab."}, {"id": 21, "start": 178.2, "end": 183.64, "text": "Übrigens, ich sage es schon gleich, erwarte dich jetzt nicht zu viel. Ich bin zwar nicht der"}, {"id": 22, "start": 183.64, "end": 188.24, "text": "allergrößte Battlefield-Loop, ich spiele das schon lange, aber ich habe ganz lange, seit dem"}, {"id": 23, "start": 188.24, "end": 192.8, "text": "letzten Stream, habe ich kein Battlefield mehr angefasst und eigentlich auch keinerlei Shooter"}, {"id": 24, "start": 192.8, "end": 199.44, "text": "großartig mehr gespielt. Also klar, so die Basics verlernst du nie. Und es war die letzten Streams"}, {"id": 25, "start": 199.44, "end": 204.36, "text": "auch witzig, dass ich, wie ich im Laufe des Abends immer wieder besser geworden bin. Also"}, {"id": 26, "start": 204.36, "end": 212.68, "text": "ich werde jetzt nicht krass abgehen. Ja, das könnte er dürftelig erwarten. Und ansonsten gucken wir"}, {"id": 27, "start": 212.68, "end": 220.0, "text": "uns das mal an. Vor allem, wo ich auch gespannt drauf bin, wie gut das und ob das besser auf dem"}, {"id": 28, "start": 220.0, "end": 224.6, "text": "neuen Rechner läuft, als auf dem alten Rechner. Ich meine, ich gehe mal davon aus. Ich meine,"}, {"id": 29, "start": 224.6, "end": 236.0, "text": "der alte Rechner war nach 1.700k mit 1.080ti und das ist jetzt in 13.900k mit 4090 ohne ti. Dafür"}, {"id": 30, "start": 236.0, "end": 242.24, "text": "RTX. Ob es mehr Spaß macht? Es wird wahrscheinlich, also ich gehe mal davon aus, es wird auf jeden"}, {"id": 31, "start": 242.24, "end": 250.68, "text": "Fall mehr Spaß machen, weil es flüssiger läuft. Aber, also sage ich jetzt einfach mal. Ob ich es"}, {"id": 32, "start": 250.68, "end": 254.8, "text": "lange spielen werde? Wahrscheinlich nicht. Ich werde auf jeden Fall ein Video zu aufnehmen, um meine"}, {"id": 33, "start": 254.8, "end": 265.64, "text": "Eindrücke zu ablassen. Es scheint sich jetzt alles ein bisschen battlefieldiger zu spielen,"}, {"id": 34, "start": 265.64, "end": 271.4, "text": "auf jeden Fall. Durch die Gadget-Begrenzung. Also du kannst jetzt nicht mehr mit Sundance rumfliegen"}, {"id": 35, "start": 271.4, "end": 280.28, "text": "und mit dem Recoiless-RPG aus der Luft da die Leute ab. Raketenlaunchern, das geht jetzt nicht mehr."}, {"id": 36, "start": 280.28, "end": 289.08, "text": "Ich starte mal, ich starte mal. Mal gucken, wie gut das jetzt läuft. Mal kurz. Was ist das jetzt"}, {"id": 37, "start": 289.08, "end": 297.96, "text": "schon wieder? Wie planet man nochmal FPS ein im Battlefield? Draw, mal mal. BFZ-FPS anzeigen."}, {"id": 38, "start": 297.96, "end": 305.92, "text": "Origin, ich will das nicht in Origin. Es gibt auch Draw, FPS, Overlay, irgendwas. Ich will auch"}, {"id": 39, "start": 305.92, "end": 321.2, "text": "nicht EA joinen. Früher war das Draw, FPS, 1 oder sowas. Mal gucken. Ach ja und ich habe die"}, {"id": 40, "start": 321.2, "end": 327.88, "text": "Bitrate im Stream natürlich höher gestellt, dass es heute ein bisschen besser ausschaut. Alt-R für"}, {"id": 41, "start": 327.88, "end": 335.68, "text": "Nvidia-Overlay. Nein, Alt-Z, nicht Alt-R. Alt-Z ist es bei mir. Und aus irgendwelchen Gründen ist das"}, {"id": 42, "start": 335.68, "end": 356.8, "text": "Ding der Meinung, es geht jetzt nicht mehr. Was auch immer. Okay. Und jetzt? Ist es abgekackt,"}, {"id": 43, "start": 356.8, "end": 382.64, "text": "oder? Ja? Game? Ich habe keinen Season Pass gekauft. Game?"}, {"id": 44, "start": 386.8, "end": 399.08, "text": "Das geht ja schon mal gut los. Also, dass es läuft, weiß ich. Ich habe das ja vorhin erst"}, {"id": 45, "start": 399.08, "end": 405.32, "text": "wieder neu frisch installiert auf dem Rechner. Ja, was ist denn jetzt? Also, ich sehe hier nichts."}, {"id": 46, "start": 405.32, "end": 415.04, "text": "Okay, Task Manager. Battlefield. Ja, da ist es doch. Angeblich läuft es. Ich sehe da nichts von. Seht"}, {"id": 47, "start": 415.04, "end": 433.72, "text": "ihr irgendwas? Mal was nochmal aus. Mal was nochmal an. Man weiß ja nie. Das dauert doch"}, {"id": 48, "start": 433.72, "end": 441.52, "text": "auch schon viel zu lang. Was ist denn da schon wieder los? Ich habe es eben gestartet. Also,"}, {"id": 49, "start": 441.52, "end": 456.08, "text": "ich habe eben extra ausprobiert, bevor ich Stream angemacht habe, dass es geht. Erkennt"}, {"id": 50, "start": 456.08, "end": 474.44, "text": "das OP? What the fuck? Close your game first."}, {"id": 51, "start": 486.08, "end": 504.08, "text": "Ich mache jetzt EA Play nochmal aus und wieder an. Ich habe euch übrigens absichtlich umgeschaltet."}, {"id": 52, "start": 504.08, "end": 516.2, "text": "Das ist irgendwie keine Daten Leak oder sowas. Ja, es wird wahrscheinlich nichts mit Battlefield."}, {"id": 53, "start": 516.2, "end": 530.08, "text": "Das scheiß Spiel startet. Ich habe es eben gestartet. Es ging ohne Probleme. Hat das vielleicht"}, {"id": 54, "start": 530.08, "end": 546.96, "text": "wirklich Probleme mit OBS? Weil ich hatte kein OBS laufen eben. Startet nicht. Hängt bei Anti-Cheat."}, {"id": 55, "start": 546.96, "end": 558.16, "text": "Wahrscheinlich ist Anti-Cheat schuld. Keine Ahnung. Wahrscheinlich kommt jetzt demnächst"}, {"id": 56, "start": 558.16, "end": 582.92, "text": "ihr Account gebannt wegen Cheating-Tools oder sowas. Reboot? Es macht irgendwas."}, {"id": 57, "start": 589.16, "end": 599.92, "text": "Guck mal, EA läuft mehrfach. Was passiert denn, wenn ich das jetzt beende? Was passiert,"}, {"id": 58, "start": 599.92, "end": 625.4, "text": "wenn ich das beende? Und das? X ist denied. Und der Scheiß geht einfach nicht."}, {"id": 59, "start": 629.92, "end": 653.24, "text": "Das scheiß Loi. Ich kriege schon wieder Anfälle. Warum startet das Game jetzt einfach nicht?"}, {"id": 60, "start": 653.24, "end": 660.16, "text": "Jedes, aber wirklich jedes Game funktioniert einfach. Zumindest zu starten, ob es danach"}, {"id": 61, "start": 660.16, "end": 667.36, "text": "funktioniert oder was anderes. Nicht so Battlefield 2042. Das Game hat von Anfang an reingeschissen."}, {"id": 62, "start": 667.36, "end": 673.84, "text": "Was ist neu in dem Update? Geht einfach nicht. Ich habe keinen Bock. So Leute,"}, {"id": 63, "start": 673.84, "end": 684.12, "text": "ich starte jetzt den Rechner neu."}]}