{"text": "und und und und und und und und und und und und und und und und und und und und und und und und und und und und und So, alles klar, ich muss grad noch was gucken auf dem zweiten Bildschirm. Eigentlich ist mein Vorschau-Rechner immer noch total overkill für einfach nur Vorschau-Rechner. Aber ich will mich ja mal nicht beschweren. Besser zu viel Vorschau-Rechner als zu wenig Vorschau-Rechner. Projektdokumentation, was schreibst du denn? Das stimmt für die Abschlussprüfung, oder? Was hast du für ein Thema? Was hast du für ein Thema in der Abschlussprüfung? Äh, für dein Projekt? Für dein Abschlussprojekt? Ich glaube es gibt kaum einer, der weiter entfernt ist, Vollzeit-Streamer zu werden beziehungsweise zu wollen als ich, also jemand aus diesem Twitch-YouTube-Ökosystem, ja. Also der 0815-Dude um die Ecke wahrscheinlich weniger, aber ich hab da keine Ambition. Ach so, okay kein Abschlussprojekt. Keg-Buy. Könntest du von YouTube und Twitch leben, also so wie ich es jetzt aktuell mache? Nee, auf gar keinen Fall. Zumindest, sag mal, ich könnte vielleicht überleben davon, also ich könnte mir wahrscheinlich zu Essen kaufen und ich könnte heizen oder so, aber ich könnte sonst wahrscheinlich wenig machen. Auf der anderen Seite, wenn ich Vollzeit machen würde, dann würde ich wahrscheinlich pro Woche auch zwei, drei, wahrscheinlich eher drei Videos machen und wahrscheinlich täglich streamen und mehr Sponsorships und irgendwelche anderen Kooperationssachen machen, dann vielleicht, aber sag mal so, mit dem was jetzt unter dem Strich rauskommt, könntest du halbwegs überleben, aber nicht wirklich gut vonleben. Doch, wenn ich jeden Tag ein Video mache und Sponsorship mache oder so, dann bestimmt, aber das sehe ich jetzt nicht als da way für mich, außer weil ich da gar keinen Bock drauf gezwungenermaßen Content machen zu müssen, nicht da ich wirklich jeden Tag streamen würde, jeden Tag Videos machen würde, also jeden zweiten Tag Videos machen würde, viel mehr Sponsorings annehmen und Sellout machen, alle möglichen Geschichten. Wo du schon auf Patreon seid und alles, was du nicht gesehen machst, doch, klar, wahrscheinlich, höchstwahrscheinlich schon, aber habe ich überhaupt keinen Bock drauf, mir ist das so viel lieber. Normaler Job, dafür Teilzeit dort und hier, wie ich Bock habe, ich muss halt nicht. Das ist gute, das ist unglaublich beruhigend, wenn du weißt, du musst weder das eine noch das andere machen. Also wenn dich das eine nervt, könntest du das andere machen und umgedreht. Also Wohnung habe ich ja eh nicht das Problem, ich muss ja keine Miete bezahlen. Was hältst du eigentlich von Zappix, ich finde Zappix gut, ich habe Zappix bei mir daheim auch im Einsatz. Ich muss sagen, Zappix ist halt vom Web-Interface und der Konfiguration im Web-Interface ziemlich abartig, bzw. muss ich erstmal an die Zappix-Logik gewöhnen und dass sie Sachen so nennen, aber es nicht unbedingt das ist, wie es benannt ist und so, das ist ganz merkwürdig. Aber Zappix ist ne gute Sache, wenn man quasi was haben will mit Web-Interface zum Konfigurieren und wo du mehr machen kannst als mit Uptime-Kuma, also wenn ein das pure Pingen-Up-Down-Anzeige oder halt auch einfache Statuswerte nicht reicht, wenn man zum Beispiel Notifications haben will, wenn die Festplatte voll läuft oder wenn man vielleicht auch mal 2-3 Wochen History haben will, rückwärts gucken will, also wenn da Uptime-Kuma nicht reicht, ist Zappix ne super Geschichte. Die Prometheus-Grafana-Kombi ist eher so, wir bauen unser Monitoring selbst, was ja auch seine Daseinsberechtigung hat und es sind ja auch zwei unterschiedliche Ansätze. Prometheus ist ursprünglich mal dafür entwickelt worden, damit man Anwendungsmetriken einsammeln kann. Nicht so sehr, wie ist die CPU-Auslastung auf der Linux-Kiste. Kann man auch machen, aber ich finde man merkt schon, wo das herkommt. Deswegen ist Zappix nicht verkehrt. Hast du eigentlich auch Pläne, was smartes Energiemanagement angeht mit Solar? Nee, hab ich nicht. Ich werd in nächster Zeit kein Photovoltaikzeug aufs Dach bauen lassen. Liegt an mehreren Gründen. Die Lage ist ganz okay, aber man kommt halt sehr schlecht ans Dach dran, d.h. da muss wahrscheinlich Gerüst gebaut werden, das ist ein riesen Akt. Am Ende bezahle ich dann irgendwie 30.000 Euro oder so für eine Installation, dann hab ich ehrlich gesagt keinen Bock drauf. Bis ich das jemals wieder eingespart habe, sind wahrscheinlich die ersten Panels kaputt oder so. Und selbst wenn es einem nur auf so plus minus null geht, selbst dann, dafür ist es eigentlich zu teuer. Dementsprechend hab ich da keine Ambitionen, was das angeht. Also noch Kontakt zum Friseur, unregelmäßig, ja. Ich glaub vor einem Monat oder so hab ich das letzte Mal mit ihm geschrieben im Discord. Was meinst du mit optimieren, achso, naja, ich weiß nicht, was man auf den Dingern einstellen kann. Das erste, was ich mal prinzipiell ausprobieren würde, wie gut ist denn die Übertragungsrate, wenn man direkt neben dem Access Point steht? Das ist das erste, wo ich mal gucken würde, so, weil je nachdem, was in deiner, also wenn du nur 80 MB Down bekommst, was kann denn der Access Point? Was ist das für ein Access Point, also was, was, was, was, was geht denn da maximal? Also brauchst du natürlich auch das passende Endgerät dafür, logischerweise, ja. Also 80 MB Down ist schon ein bisschen wenig, also ich krieg mit meinem hier irgendwie so 100, 160, 170 MBit und das ist schon nicht wirklich eine der neuesten. Hä, 100, verwendet man 100 überhaupt? WLAN-technisch darfst du mich nix fragen, WLAN-technisch hab ich wenig Ahnung. Kein Plan, guck mir lieber zum beruhigenden Runde ASCII-Quarium jetzt an. Aber viele Access Points haben so einen automatisch Optimierungsmodus, wo die gucken, welche Kanäle frei sind und dann darauf switchen. Das könnte man vielleicht mal machen. Habt ihr im Büro auch laufen, Beste? Naja, Pläne hab ich im Prinzip dahingehend, dass ich mich damit beschäftigt hab und es nicht aktiv plane, das zu machen, das sind meine Pläne dazu. Ja, also ich zeige euch mal kurz, was wir heute machen, Stream, ja, korrekt, Pogo-Stream, oh, Sekunde, ich muss mal kurz mein Headset entknoten, ich bin gleich wieder am Start. So, bin ich wieder. Excellent, also, was machen wir heute? Weiß ich, ob Modgis schon da ist, irgendeiner der Modgis, ja doch, der Sirius Max ist da, der ist immer richtig, richtig high IQ, was Daily-Zusammenfassungsschreiben angeht. Also, was wir heute machen ist, wir gucken uns folgendes an, und zwar, nein, nicht, ich hätte es eine Cloud, oh, oh, mein Auge, Sekunde, Sekunde, Dark Reader, ah, jetzt ist es gleich viel besser. Also, wir gucken uns heute folgende Sache an, zservers.com, das habe ich gefunden über, ne, ja, über Hacker News damals, da habe ich einen Post gelesen vor, ist doch nicht so lange her, Hacker News, Set-Servers, ja hier, ist doch gar nicht so lange her, von drei Monaten, das war irgendwann im November, so, und da ist jemand auf eine sehr schlaue Idee gekommen, und zwar, der hat eine Übungsseite gebaut, nicht für irgendwelchen Hacker-Gramm oder irgendwelches Kryptografiezeug oder Programmier-Stells, äh, Lead-Code-Gedöns, nein, der ist auf die Idee gekommen, hat gesagt, hey, warum bauen wir nicht mal so eine Challenge, beziehungsweise Test-Übungsseite für Linux-Administration und DevOps-Themen? Und da hat er, oder sagen wir so, hauptsächlich Linux-Skills, und da hat er zservers.com gebaut und da gibt es unterschiedlich schwere Herausforderungen, die man in einer vorgegebenen Zeitspanne schaffen muss. Also, guckt mal, könnt ihr euch mal angucken, also, was es zum Beispiel gibt, aktuell gibt es 17 verschiedene Tests, die man machen kann, zwischen easy und 10 Minuten zu schwer und bis zu 30 Minuten. Ich würde sagen, wir fangen einfach von oben nach unten an, ja. Ich muss sagen, ich mach das nicht ganz planlos, ich hab mir manche Aufgaben, Stellungen und Sachen schon im Vorfeld angeguckt, auf dem Smartphone, als ich mal morgens im Zug gehockt hab, da kann ich mich auch dran erinnern, da hab ich morgens im Zug bisschen durchgescrollt, wobei man das Terminal im Zug nicht gescheit bedienen konnte, und da gibt es Aufgaben, da gibt es dann zum Beispiel Aufgaben wie, also, level easy, du hast 10 Minuten Zeit und zur Info siehst du, ok, Aufgabe ist folgende, hier auf diesem Server läuft ein Programm, was eine Log-Datei schreibt, warlog badlog.log, und was die Festplatte vollschreibt, und das kann man hiermit überprüfen, und das Ziel ist es, dass das Programm quasi für bis zu 6 Sekunden, also der Test, den man am Ende durchführen kann, ist, dass das Programm 6 Sekunden lang nichts in die Log-Datei reingeschrieben hat. Das fängt relativ simpel an, ich mein, jeder, der ein bisschen was mit Linux bisher zu tun hatte, wird sich denken können, ja, gut, psauks, grep, oder ls, äh, nee, nicht, nicht, äh, effuser, ls-off, oder irgendwas auf die Datei, gucken, was es ist, den Prozess abschießen und dann ist es wieder gut, aber das wird dann mit der Zeit schon ein bisschen komplexer, ja, da gibt es dann irgendwann so ein paar Mediums, kommen dann solche Aufgaben, wie hier zum Beispiel, es gibt hier eine Web-Application mit einem Proxy davor, und der Proxy funktioniert nicht richtig, man soll rausbekommen, woran das liegt, dass die Anwendung nicht richtig erreichbar ist, also das geht von easy, die teilweise wirklich easy sind, von der Aufgabenbeschreibung her zu, doch schon relativ, relativ kompliziert, ja, zum Beispiel hier solche Geschichten wie, ähm, Docker-Container kann nicht zur Datenbank-Container und sowas, also das fängt einfach an, ist dann aber spätestens, spätestens am Medium, nix mehr, was man innerhalb von einer Minute mal easy bei, easy nebenbei, mal kurz, äh, einmal angeguckt, man weiß es sofort. Finde ich, ist eine super Idee, weil mir ist nichts bekannt, wo man so ein bisschen so mit, mit vordefinierten Aufgaben, äh, vordefinierten Aufgaben und auch Tests am Ende wirklich ein bisschen so seine Linux-Skills testen kann, hätte es das vor ein paar Jahren gegeben, guck mal, das ist auch ganz neu hier unten, hätte es das vor ein paar Jahren gegeben, hätte ich mal unsere Azubis immer so Dinger machen lassen. Als Linux-Noop-coole Übung zum reinkommen bestimmt, ich gehe davon aus, dass es spätestens ab Medium gar nicht mehr so noobig ist, also was ich hier gelesen habe, zum Beispiel, ähm, sowas hier, war das glaube ich, genau, äh, die Datei home-admin-sum-file wird, wird geschrieben von irgendeinem Prozess und man soll die Datei schließen, ohne dass man den Prozess abschießt, da muss man wahrscheinlich irgendein Signal an den Prozess senden oder sowas, müssen wir uns da mal angucken, aber das ist dann schon ein bisschen trickreicher, also sprich, wie kriege ich das Ding dazu, dass die Log-Datei freigegeben wird, ohne dass ich den Prozess abschieße, das kann ja auch durchaus ein realistisches Szenario sein, überlegt euch mal, ihr habt irgendeine Anwendung, irgendeine produktive Anwendung, die gigabyteweise Log schreibt und ihr wollt die dazu auffordern, rotier mal deine Logs oder mach mal Log, äh, ein neues Log, weil die Platte voll läuft, also das ist gar kein so unrealistisches Szenario, oder was haben wir hier, DNS, kann pinggoogle.com, das kann ja potentiell alles sein, pinggoogle.com, name of service unknown, das kann ja prinzipiell alles sein, also woran auch immer das liegt, ja, Unix-Porn schon, gute Idee, das machen wir nachher. Gucken wir uns nachher eine Runde Unix-Porn an, Gatschi-Buzz, jetzt müssen wir erstmal ein paar Server glücklich machen, ja, also und so ist das ganze aufgebaut, ich finde das ist eine super Idee von dem Typ, ich hab doch auf Discord einen Aufruf aus der Community, ich war seit gestern nicht mal auf Discord drauf, ich hab noch nicht auf Discord drauf geguckt, keine Ahnung, ich lecke critical information, ich hab keine Ahnung was es da gibt, es gibt einen neuen Channel dafür, ich guck da mal kurz rein, Sekunde Leute. Unix-Porn, Bilder-Only-Channels, Max macht morgen im Stream, hab ich das tatsächlich gesagt, dass ich das morgen geschwöre, fuck Alter wie viel da drinnen ist, ja, ok gucken wir uns nachher an, ja, falls ich irgendwie das wieder ignorieren sollte und verdrängen sollte erinnert mich mal dran, ich schreib's mir extra mal auf, dass ich's am Ende nicht vergesse, Unix-Porn aus Discord, alles klar so machen wir das, ja was weiß ich was ich gestern im Stream alles erzählt habe, ich meine Leute ich rede da 3-4 Stunden teilweise ohne Unterbrechung, was weiß ich, was ich da irgendwie mal in einem Nebensatz gesagt habe, was ich angeblich mache, es war jetzt auch ein Tag später nicht mehr, ne jetzt machen wir erstmal ZGServer, die sind nämlich alle sehr traurig gerade und müssen von uns gefixt werden, ja und das können wir nicht tolerieren, dass die Linux-Server traurig sind, so also übrigens gibt ein GitHub Projekt dazu, FDuran Set Servers hätte durchaus noch ein paar Sterne verdient, also Leute tut euch wenn euch dieser Service gefällt ja tut euch Konzwang an, gebt ihm ein paar Sterne auf GitHub und ich würde sagen wir probieren das einfach mal, wir gucken uns das ganze jetzt einfach mal an, also Chat wenn ihr Fragen habt, beziehungsweise wenn ihr Ideen habt, wenn ich nicht weiter kommen sollte oder so, ihr dürft auch Backseiten wie ihr wollt heute, ok was heißt wie ihr wollt, ja ihr dürft Backseiten wie ihr wollt, wenn es mir auf den Sack geht kann es aber sein, dass ich euch time oute, also da weiß ich nie so genau, manchmal regt es mich ja auf, aber so prinzipiell dürft ihr so viel Backseiten wie ihr wollt und ich glaube man hat verstanden um was es geht oder, ich mein wir können uns ja nochmal kurz angucken was der Typ selbst über den Servers schreibt, der schreibt hier Lead Code for Linux Troubleshoot and make a Set Server happy. Aktuell ist der Server äußerst Setgip und danach ist der Server WhitePepo happy. Was ist Backseiten? Ich würd jetzt ja eigentlich Chat-GPT fragen, what's backseiting, aber ich fürchte meine Session ist abgelaufen, Bergseiting vor allem. Ok ich fürchte meine Session ist tatsächlich wieder abgelaufen, keine Ahnung. Backseiting ist, wenn jemand was macht im Stream und der Chat versucht ihm die ganze Zeit zu erzählen was er denn jetzt als nächstes machen soll, zum Beispiel stell dir vor irgendjemand spielt ein Spiel, kommt nicht weiter und der Chat sagt dem im Sekundentakt was er jetzt machen soll und meistens, und das ist ja das fatale beim Backseiting, meistens hat der Chat noch weniger Ahnung von der ganzen Sache als der Streamer selbst und der Chat ist einfach nur nervig am Backseiten. Genau, das ist zum Beispiel, das könnte man schon als Backseiting interpretieren. Ok, also wir fangen jetzt mal an. Gucken wir uns das Ganze mal an. Also Setge Servers, wir fangen oben an, wir machen die Easy Variante. Also wir fangen an mit St. John. What's writing to this log file? Run. Ja danke. Aber die coole Sache daran ist, ich hab mir ja ein bisschen hier durchgelesen bei Hacker News, was der Typ macht. Man bekommt, eine steht ja auch hier glaube ich irgendwo, man bekommt einen echten AWS, eine echte AWS Linux VM. Moin wie geil dass du Chat-GPT direkt an der Hand hast. Gibt's eine Möglichkeit das zu nutzen ohne seine Handynummer angeben zu müssen. Nee, registrieren musst du dich so. Du kannst aber wenigstens das ohne Api-Key machen. Also du kannst zum Beispiel das hier verwenden auf dem Terminal. Du kannst so Chat-GPT-Wrapper. Kannst du sowas hier zum Beispiel verwenden. Das sind Kommando-Zeilen-Tools, was quasi einen Browser simuliert und so tut, bzw. keinen Browser simuliert, einen Browser fernsteuert und die Antworten dann ins Terminal haut. Also quasi wie wenn du einen Browser aufmachst und auch direkt auf die Webseite gehst. Aber du brauchst einen Account, das geht nicht anders. Okay Leute, also geh los. Wir haben 10 Minuten Zeit, wenn ich das richtige in Erinnerung hab für die Challenge. Also, time to solve 10 minutes. Übrigens Leute, wenn man es in 10 Minuten nicht geschafft hat, dann wird einfach der Server wieder gelöscht. Also du musst es in 10 Minuten schaffen. Das liegt einfach daran, der Typ der will ja auch nicht unendlich Geld für seine AVS VMS bezahlen. Deswegen ist das alles zeitlich beschränkt. Das ist nicht arschteuer zu hosten, ja deswegen ist es ja auch zeitlich beschränkt. Okay also, Instructions, Terminal aufmachen. Okay, nice. Mach mal kurz ein bisschen größere Schrift, dass ihr auch was ordentlich seht. Also, Beschriftung. Äh Beschriftung. Description, Beschreibung. Level easy, Description. Also ein Entwickler. Ah Leute, Leute, weißt du was wir machen? Five-Hat-Time. Guck mal. Komm für euch. Für euch machen wir das jetzt. Diepel. Ach fuck. Ich will ja von Englisch zu Englisch. Oh. Okay. Dann übersetzen wir es mit der Webseite. Ein Entwickler hat ein Testprogramm erstellt, das kontinuierlich in eine Protokolldatei warlog badlog schreibt und die Festplatte füllt. Sie können dies z.B. tail-f warlog überprüfen. Dieses Programm wird nicht mehr benötigt. Finden Sie es und beenden Sie es. Okay, das ist relativ easy. Ich glaube das kriegen wir einfach hin. Wir sehen, okay auf dem Server gibt es eine Log-Datei, wo permanent reingespammt wird. Ja, der Chat schon wieder am Backseaten, aber wenn es ausarten gibt es Timeouts. Ich sag es euch. Ihr dürft Backseaten, aber ihr müsst den feinen Grad finden zwischen Backseaten und mir auf den Sack gehen. Und nachdem es ja irgendwie keine Anzeige gibt, auf welcher Seite ich gerade bin, ist Backseating quasi immer nur auf eigene Gefahr. Danke für den Sub. So, also von der Idee her relativ einfach. Wir können z.B. mal gucken was läuft denn da so. Wir können hier mal gucken ob da irgendwas drin auftaucht. Also ich meine die einfachste, ich zeige euch gleich wie man es ordentlich macht oder wie ich denke, dass man es ordentlich macht. Also da sieht man hier z.B. links großartig. Wir können z.B. PS AUX gucken, CREP, BAD. Ach guck mal da läuft doch schon was. BADLOG.PI. Okay, das wird es wahrscheinlich sein. Allerdings, die einfachste Variante ist LS OFF. Chat ist im Weg? Ja, der Chat, der Chat ist, ähm, eigentlich ist der Chat, nee der Chat ist meistens nicht im Weg. Der Chat ist hier unten recht. Ich weiß eben war es im Weg, aber das wird wahrscheinlich so oft der Fall sein. Chat bleibt trotzdem eingeplendet. So, gehen wir mal ins Heimatverzeichnis. Select ein bisschen. So, BADLOG.PI haben wir hier. Und dann machen wir LS OFF auf, äh, Moment. LS OFF war log BADLOG und da sehen wir, es ist tatsächlich BADLOG.PI was da drauf zugreift. D.h. wir können jetzt folgendes machen, entweder sagen wir KILL 633, also hier die Prozess-ID, oder wir sagen, äh, Kivo macht hier keine Gedanken, der Chat ist wieder ein bisschen am rum, rumchibäden. Ich hab damit keine Schmerzen mit, wenn mich einer darauf hinweist, dass der Chat über dem Text ist. So, ähm, oder wir sagen KILL ALL BADLOG.PI, wenn das jetzt allerdings mehrfach laufen würde, dann würden wir alles abschießen. Was LS OFF macht, das guckt, äh, welche Filehandles offen sind. Gucken, was sie sagen. LIST OPEN FILE. Guckt, ob es Filehandles gibt auf die, auf die Datei und zeigt ihr an, was da drauf zugreift. Und jetzt haben wir es eigentlich gefixt, würde ich sagen. So, TAIL minus F und wir sehen, dass wir nichts mehr sehen, dass nichts mehr reingeschrieben wird. Okay, dann lasst uns mal checken, ob wir recht haben. Check mal Solution. KORREKT. EASY. Geh davon aus, dass nicht alles so einfach sein wird. Okay. Jetzt restliche Zeit meinen. Ich glaube, man hat kein Internetzugriff. Man hat, man hat kein Internetzugriff. Funktioniert nicht. Okay, ähm, der schreibt irgendwie, dass man nicht VM ausschalten soll hier. Also, SUDO, POWER OFF. CONNECTION CLOSED. NEXT. NEXT. Also, erstes war tatsächlich easy. Ich behaupte mal, wir haben nicht mal ansatzweise 10 Minuten gebraucht. Ah, ich hab, meinst du, ich hab jetzt ganz AWS runtergefahren? Ja. Ich glaube, ich ruf mal kurz bei der Amazon Hotline an. Okay, nächstes. COUNTING IPs. RUN. So, was haben wir hier? Während die VM erzeugt wird, lesen wir uns mal durch, um was es geht. SASCATON. SUS. SASCATON. COUNTING IPs. Okay. DIPL. Wir übersetzen es jetzt einfach wirklich jedes Jahr. Also, folgendes. Was ist die Aufgabe? Es gibt eine Web-Server Zugriffs-Portokoll-Datei, alles klar, unter HomeAdminAccess.log. Die Datei besteht aus einer Zeile pro HTTP Anfrage, wobei die IP-Adresse des Anfragen am Anfang jeder Zeile steht. Finden Sie die IP-Adresse mit den meisten Anfragen in dieser Datei heraus. Es gibt keinen Gleichstand, die IP-Adresse ist eindeutig. Schreiben Sie die Lösung in eine Datei. HOME-HIGHEST-IP. Okay, easy. Easy. Easy. Machen wir das doch mal. Probieren wir uns mal hier das Lösungsding. Ah, okay, man kann auch einen Hash-Wert machen und gucken, ob das alles stimmt. Alles klar, gucken wir mal. Schauen wir uns das Ganze mal an. Leute, ich schiebe das einfach auf die linke Seite des Terminals, weil da kann der Chat nicht drüber sein. Ob der Chat hier drüber ist, ist ja nicht schlimm. Alles klar. Okay, also, gehen wir mal HomeAdmin, wobei da sind wir wahrscheinlich schon. HomeAdmin und da gibt es eine Access-Log. Okay, die Datei ist leer. Heißt IP.txt. Es gibt eine Access-Log, tatsächlich. Access-Log. Okay, gucken wir noch mal kurz rein. Oh, die ist ein bisschen größer. Okay, das erste in jeder Zeile ist die IP. Wir sollen jetzt quasi, was sollen wir... Da wollte ich jetzt nicht hin. Was sollen wir machen? Wir sollen zählen, welche IP, das die meisten Requests gemacht hat. Okay, also, ich würde sagen, jetzt weiß ich, jetzt kommt bestimmt der erste, useless use of cat oder irgendwie sowas. Also, ganz am Anfang jeder Zeile steht die IP. Oh, ich hätte das nicht catten sollen, das Ding. Also, sagen wir mal, cat an einem Leerzeichen, an einem Leerzeichen field one. So, haben wir alle IPs. Sortieren wir die IPs. So. Uniken die IPs. Nee, nicht Unik. Unik count, geht das irgendwie? Ich glaube schon. Ich glaube, Unik kann zählen. Unik count. Okay, also Unik count. Okay. Jetzt haben wir pro Zeile, wie oft die Sache aufgetaucht ist. Das heißt, jetzt können wir das Ganze nochmal sortieren. Numeric. Und dann haben wir diese IP. Diese IP hat 482 Anfragen. Können wir auch überprüfen, wenn wir einfach sagen Echo und dann was? Char. Eins. Summ. 6ef42. Okay, check my solution. Ach, Moment. Ich noob. Ich muss es ja erst noch in die Datei reinschreiben. Jesper, danke für den Zapp. Check my solution ist korrekt. Wir gucken uns jetzt mal an, wie die offizielle Lösung dazu ist. Also, was der sagt, wie man das machen soll. To get the first field IP of. Okay, da macht's mit AWK. Cut, genau. Okay, aber andere Delimiter, aber es ist im Prinzip das gleiche. Klar, mit AWK ist die schönere Variante, weil dann ist es egal, ob es Leerzeichen oder Tabs oder sonst was sind. And pick the first field. Okay, cat accessible. Ja, das braucht man gar nicht. Ach nee, ach field 1. Okay, ja, das habe ich ja auch so gemacht. You may want to append a pipe, head or tail as you constrain. Und weiter. Das ist ja noch nicht die Lösung. After the previous step. Sort. Ja, haben wir auch gemacht. Unique minus C haben wir auch gemacht. Ah, der macht es anders. Ah, okay, wie macht der das? Ich habe Sort numeric gemacht und er hat Sort minus A. Okay, das wird wahrscheinlich auch funktionieren. Das ist der Leute viele, viele Wege führen zum Ziel. Aber wir haben es richtige rausgekriegt. Easy. Sudo Power off. Also ich gehe davon aus, dass die Dinger noch ein bisschen schwerer werden. Das soll easy sein. Ja, das ist doch auch easy. Also jeder, der schon ein bisschen Linux Erfahrung. Also ich rede jetzt nicht Linux Desktop Erfahrung reine Anwendersache, aber jeder, der ein bisschen Linux Administration Erfahrung hatte, sollte sowas eigentlich easy hinkriegen. Chat, findet ihr das nicht? Okay, okay, wir machen eine Umfrage. Max, falls du noch da bist, könntest du eine Umfrage machen? War das easy? Ja, nein. Und ohne und ohne mit Kekseworten und sowas. Warum kommt nach dem S was? Was kommt nach dem S? Okay, also war es Eats oder nicht Eats? Cut ein Sort, ja, kann ich dir gleich erklären. Vielleicht lasse ich ja vom Teil nur ein Highlight schneiden für YouTube von diesem Stream. Da könnt ihr jetzt einmal alle Hallo YouTube spammen, wobei ich glaube YouTube interessiert das nicht null, nicht die Bohne, ob ich die irgendwie Linux-Admin-Challenges hier mache. Okay, also wir sind uns nicht ganz einig, ob es Eats oder nicht Eats ist, aber der überwiegende Teil meint Eats, allerdings ist es sehr knapp Eats. Und jetzt höre ich auf, weil ich weiß genau, alle Leute, die jetzt noch nicht abgestimmt haben und noch abstimmen können, die stimmen jetzt so ab, dass es 50-50 wird am Ende. Das ist immer so. Das heißt, man darf eigentlich, sobald man im Stream das Ergebnis zeigt, muss die absch Abstimmung fertig sein oder du musst das ignorieren, weil genau sonst passiert nämlich exakt das. Also 50-50. Mit Google hättet ihr es auf jeden Fall alle hinbekommen. Warum? Die Frage war, warum nach dem Cut ein Sort muss, weil Unix sonst nicht funktioniert. Unix erwartet, dass der Input sortiert ist. Also du musst zuerst, also guck mal, wenn du das hier machst, also der erste Teil ist, du holst dir die IP-Adressen raus. Der nächste Teil ist, du sortierst die IP-Adressen. Der nächste Teil ist, du guckst mit Unix, wie oft welche IP-Adresse vorkommt und dann, das ist ein bisschen abweichend von der offiziellen Lösung, dann sortiere ich das Ganze nochmal numerisch, weil nach dem hier steht ja vorne ganz am Anfang eine Zahl und mit Sort minus N sortiert er quasi anhand von numerisch das Ganze und dementsprechend steht 482 unten und die letzte Zeile ist, also meine Lösung ist ein bisschen anders als die offizielle Lösung, aber funktioniert ja auch genauso. Ja, Google ist ja auch erlaubt. Google ist ja, ist ja hier denke ich auch erlaubt. Okay, Power off. Easy, next. More Scenarios. Also wenn ihr was wissen wollt, Leute, gerade wenn wir durch sind, könntest du auch Sort minus U machen, wahrscheinlich. In der offiziellen Lösung ist es ein Revertsort und sowas. Gibt sich, wahrscheinlich könntest du auch noch ganz trickreichere Sachen machen. Der Python Crack hätte wahrscheinlich in Python Interpreter gepiped und das darin irgendwie sortiert oder was auch immer. Nutzt du deine Linux-Maschine als VM und was für ein Linux-Distro benutzt du? Das ist eine VM, korrekt? Guckt da. Ich benutze selbstverständlich Archlinux, by the way. Das ist aber gut, dass du es ansprichst, weil ich denke, ich hätte euch das heute schon nochmal erzählen müssen, dass ich Archlinux verwende. Also hier nochmal ganz offiziell Leute, ich verwende Archlinux. Ich hoffe, ihr habt es mitbekommen. Archlinux. Nicht elitär genug für Gento. Auf Gento hab ich keinen Bock. Manjaro, doch Manjaro war es vorher. Opensuse, äh, Igitt. Oder Gentoo, wie es manche sagen, ja. Womit sollte man bei Windows 11 virtualisieren, um halbwegs performant zu sein? Vor allem bei Workstation finde ich es die beste Desktop-Virtualisierung, die es gibt. Auch mit Snapshots und allem dabei und bisschen 3D-Beschleunigung und Acceleration und du kannst sogar nestet-Virtualisierung machen und sowas. Ja, also gerade wenn wir mit so einer Übung durch sind und ihr was wissen wollt, Leute, könnt ihr das ohne Probleme dann, ihr könnt es vorher schon in den Chat schreiben, aber wenn wir mit der Übung durch sind, kann ich ja noch ein bisschen was erklären, wenn es noch was offene Fragen gibt, wobei ich denke, das war jetzt relativ einfach. Ok, weiter. Find Secret Combination, doch easy, aber jetzt haben wir 15 Minuten Zeit. Deine Meinung zu Postgres, beste Datenbank, gerade beste Open Source-Datenbank. Das Gute an Postgres ist, dass Postgres alles kann, du kannst Time-Series-Daten, du kannst Time-Series-Sachen drinnen speichern, mit Time-Scale-DB, oma, was, Time-Scale, ja doch, ich glaube, Time-Scale-DB, vielleicht nicht so gut wie ein Influx oder sonst was, aber performant genug. Du kannst eine Volltext-Suche, du hast eine Trigram-Suche für Wildcards und Autocomplete und sowas. Postgres ist das Beste, was es gibt. SQLite ist auch das Beste, was es gibt in seinem Bereich. SQLite, also wenn ich die Auswahl hätte zwischen, was ist die beste, universellste, einsetzbare Datenbank, dann SQLite, weil ich glaube, SQLite dürfte auch die weltweit verbreitetste Datenbank sein, gerade weil so gut wie jede Android-App mit einer internen SQLite-Datenbank daherkommt, aber das war jetzt ja nicht die Frage. Also es ging ja um keine so embedded Datenbank-Kram wie SQLite, sondern es ging ja um einen richtigen Datenbank-Server und da finde ich Postgres das Beste, auch wenn ich nicht der Super-Datenbank-Checker bin. Ich habe schon gelesen, es gibt manchmal Datenbank, also manche dieser Aufgaben sind so Datenbank-Aufgaben, da bin ich mal gespannt. Auf geht's, nächste Übung. Okay, easy, Santiago. Find a secret combination, okay, Alice hat zwei geheime Nummern versteckt auf dem System. So, wir sollen die Anzahl der Zeilen rausbekommen, wie oft der String Alice vorkommt in allen txt-Files im home-admin-directory. Okay, also wir sinds. Okay, Deep L, ihr habt Recht. Massive. Massive, Diepel. Deep L. So, also. Alice die Spionin hat eine geheime Zahlenkombination versteckt. Finden Sie mit diesen Anweisungen, finde die Anzahl der Zeilen, in denen die Zeichenkette Alice in allen txt-Dateilen im verzeichnungs-home-admin vorkommt. Es gibt eine Datei, in der Alice genau einmal vorkommt, in der Zeile nach diesem Vorkommen steht eine Zahl. Schreiben Sie beide Zahlen nacheinander als eine, keine neue Zeile oder Leerzeichen in die Lösungsdatei. Okay, da hat Diepel jetzt ein bisschen verkackt. Zum Beispiel, wenn die ersten Zahlen, okay. Ich soll im Prinzip beide Zeilen ohne Leerzeichen. Das ist okay. Kann man so machen. Könnt ihr auch einfach hintereinander echoen. Okay, dann probieren wir das doch mal. Also, wir sollen rausfinden, wie oft kommt Alice vor. Na, das ist relativ easy. Crab minus C. Alice. Wohlgemer Groß- und Kleinschreibung ist an der Stelle wichtig, also machen wir nicht minus I. Und dann Sternchen Punkt txt. Und wir sehen. Okay. Mit AWK könntest du es bestimmt auch irgendwie machen, aber in dem Fall ist Crab einfacher, zumal es um Zeilen geht. Okay, also hier kommt Alice einmal vor in 1, 3, 2, 1, 3, 4, 2, 0 Punkt txt. Und in den anderen kommt es 12 und 0 mal vor. Okay, das heißt, wir rechnen das mal kurz zusammen. Echo 3, 9, 8 plus 1 plus 12 nach BC. Cringe. BC nicht installiert. Darf man Sachen nachinstallieren? Wahrscheinlich nicht. Ich glaube nicht, dass das funktioniert. Nachinstalliert werden darf nicht. Na gut. Dann, ich wollte gerade sagen, dann machen wir es mit Bash Build ins Deskump funktioniert auch. So. 411. Okay, 411 ist schon mal unsere erste Zahl. Und die zweite Zahl finden wir in der Datei, wo Alice nur einmal vorkommt. Könnte man eventuell mit WC rechnen? Ja, du könntest es auch mit WC machen. Das zeige ich gleich. So, machen wir das mal auf, suchen da drin nach Alice. Kommt ja nur einmal drin vor und dann brauchen wir in the line after, dann nach Alice. Okay, also brauchen wir 156. Also haben wir 411, 156 und das soll exakt so in die Datei rein. Ich zeige gleich, wie man es mit WC eventuell machen könnte. Bin mir gerade nicht ganz sicher, ob es funktioniert. Da müsste gehen. Und das muss jetzt in die Datei. Solution. X ist Solution. MD5 Sum. Solution. Ja, D80E02D sieht gut aus. Check my Solution. Passt, ist korrekt. Also was man auch machen könnte wahrscheinlich ist, anstatt CREP minus C könnte man wahrscheinlich auch WC minus L machen. Dann hat man auch 411. Das ist eine gute Idee. Das ist eine gute Idee. Zählt WC auch richtig, wenn Alice zweimal pro Zeile vorkommt? Ja, weil CREP das nur einmal ausspucken würde. Das ist eine gute Idee, Chat, das so zu machen. Was der Unterschied ist, der Unterschied ist, hier wird es angehängt und hier wird es überschrieben. Guck mal, jetzt steht es zweimal drinnen und mehrfach und jetzt, wobei das bei ZSH nicht unbedingt so standardlich funktioniert, überschreibt das. Also das ist reinschreiben in die Datei, aber quasi von vorne anfangen und den Rest überschreiben oder erstmal Datei quasi leeren und dann überschreiben und das andere ist Anhängen. Also zwei sind Anhängen, eins ist reinschreiben. Also wenn du ein Log File hast, was permanent gefüllt werden soll, dann ist das. Wenn du einen Log hast pro Skript dran, zum Beispiel, dann würdest du es mit einem machen. Was macht minus L? Zählen, Beligns, Zeilen zählen. Wenn du nämlich normales WC machst, dann zeigt es dir auch Zeilen an. Es zeigt dir Zeilen, Charakter und keine Ahnung, was sonst noch an. Wörter, Charakter, Zeilen, irgendwie sowas. WC minus L ist nur Zeilen, nur Zeilen rechnen. WC minus L ist auch das am häufigsten Benutzte in der Kombination. Ok, sudo power off easy. Bevor ich ausmache, noch irgendwelche Questions zu der Aufgabe. Ich vermute mal, jetzt wird es ein bisschen schwerer. Ach ja, wir gucken uns doch mal die offizielle Lösung an, was sie dazu wie sie schreiben, wie man das machen soll. Use find. Ok, das haben wir schon mal nicht gemacht. Use find and pass the results to grab via xarx. Kann man auch machen. Solution, zum Beispiel find, home, admin, xarx, grab minus zählen. Könnte man auch so machen. Ja, also was xarx macht, ist folgendes. xarx nimmt die Zeilen vom Input und macht daraus quasi eine Argumentliste, die sie an grab anhängt. Was im Endeffekt bedeutet, es ruft in grab auf und dahinter schreibt es die Dateien, so das grab in den Dateien. Aber wie gesagt, man kann auch Sternchen.txt machen. Ok, fertig. Was ist zserver? Zserver ist troubleshoot and makes zservers happy. Lead code for linux. Capture the flag challenges. Train and prove your debugging skills. Practice for your next sre devops interview. Also im Endeffekt bekommst du den linux server bei aws, auf dem du verschiedene Aufgaben lösen musst. Das war doch nicht die ganze solution. Doch. Also das was ich gemacht hab. Signs auch oder? Signs funktioniert auch hier. Wobei ich meins angenehmer fand. Das ist ohne Registrierung ja, aber das hat ein Limit. Also du kannst jetzt nicht irgendwie das ganze 40 mal am Tag machen oder so. Ach so, der zweite Teil hat noch gefehlt. Ja, jetzt steht stimmt, wenn man mir nochmal drauf klicken müssen. Alles klar. Nice haben wir sudo sudo power off. Bäm. Next. More Scenarios. Also Leute, easy ist jetzt fertig. Jetzt wirds anstrengend. Jetzt kommen die medium medium schweren Dinger. Manhattan can't write into database. Da wollen wir mal gucken was man hätten für Probleme hat. Manhattan hat wahrscheinlich zu viel dritter deutschland in den letzten Tagen gelesen und hat keinen Bock mehr. Hat sich gedacht, ne ich hör auf, ich stell den Dienst ein. Richtig gut, da ist es schön, dass du deinen Weg hergefunden hat und dass dirs gefällt. So, also wir können uns das ganze ja mal durchlesen bis die vm gestartet ist. Ok, description. Moment, Diepel. Diepel. Diepel. Also Beschreibung. Ihr Ziel ist es, eine Zeile in eine bestehende Postgres Datenbank einzufügen. Das Problem ist nicht spezifisch für Postgres und sie brauchen keine Details darüber zu wissen, obwohl es hilfreich sein könnte. Aha. Ja, ich hab die neuen Api Pricings gesehen, total lächerlich. Zur hilfreichen Information zu Postgres. Es handelt sich um einen Dienst, der an einem Port 5432, das ist der Standard Postgres Port, lauscht und auf die Festplatte in ein Datenverzeichnis schreibt, dessen Speicherort im Parameter Data Directory der Konfigurationsdatei etc die Postgres14MainPostgres.conf. In unserem Fall wird Postgres von Systemd als eine Unit mit dem Namen PostgresQL verwaltet. Vom Standard Admin Benutzer. Ok, der Test. Das ist der Test, da können wir testen, ob es funktioniert. Alles klar. Den Test copypasten wir uns mal und schauen wir mal, ob der Server bereit ist. Jop. Ok, führen wir das mal aus und stellen fest, nope geht nicht. Warum geht es nicht? Weil, no such file or directory is the server running. Ok, wahrscheinlich läuft Postgres einfach nicht. Ostge. Wobei es heißt glaube ich, PG irgendwas. Gibt es nicht. Ok, System CTL, Status, Postgres, nee PostgresQL, das ist glaube ich. Ok, das ist, ok, jetzt wird es langsam interessant. Ich hätte jetzt gedacht, easy, wir gucken einfach und das Service läuft nicht und wir starten den Service. So einfach ist es anscheinend schon mal nicht. Also Postgres selber läuft wohl, aber trotzdem funktioniert der Zugriff auf Postgres nicht. Das heißt wir machen jetzt mal NetStats und gucken ob an Port 5, 5 4 3 2 überhaupt was lauscht und wir stellen fest, Postgres ist der Meinung, dass es läuft. Ja, das ist komisch. Ok, das ist natürlich merkwürdig. Postgres ist der Meinung, dass es läuft, aber Postgres läuft anscheinend gar nicht. Da ist ChainLore, ja. Werde ich meinem Cutter ausrichten, wir werden in Zukunft easy selbstverständlich noch als easy emote einplanen und Begründung ist, weil es der ChainLore gesagt hat. Aber ist wahrscheinlich, wäre wahrscheinlich doch besser gewesen. Ok, lass mal kurz, lass mal kurz so prinzipiell ein paar Sachen, ein paar Sachen checken. War, log, Postgres, Postgres MainLog, wieder ist nichts drin. Das schon mal, sus, could not create log file, no space, ok, Moment, df-h, die Festplatte ist voll. Ok, das ist ein guter Test. Das ist gar nicht so weit von der Realität weg, Leute. Das kommt tatsächlich vor in der Praxis. Ok, die Festplatte ist voll. Also, gehen wir mal nach. Opt, pg-data, gucken wir mal, was es da so gibt. Guck mal, es gibt sogar einen File, was ich delete me nennt. rm, delete me, Moment, in dem File steht überhaupt nichts drinne. Der muss aber auch nur einen pit-file anlegen, vielleicht reicht das ja, delete me. Ok, System, ctl, restart, Postgresql, net-stat, ups, what the fuck, net-stat, minus, nein, die läuft immer noch nicht. Wir löschen, komm, wir löschen die anderen, ich mein, das sind Backup-Files oder irgendwie, irgendwie, Postgres-Dumps oder sowas. Das hier wird, das hier ist ja die eigentliche Datenbank. Wir löschen, wir löschen den ganzen Kampel hier einfach mal. rm, File, m, restart, Postgresql. Hast du das neue Harry Potter Spiel? Nee, hab ich nicht. Ich war aber nach diesem ganzen Circle-Jerk auf Twitter mal ganz kurz haben überlegen, ob ich es mir nicht kaufen soll. Einfach, um ein paar Leute abzufucken. Aber ich hab mir dann am Ende gedacht, nee, eigentlich ist es bescheuert, Geld auszugeben für ein Game, was dich nicht interessiert und dich das Franchise auch nicht wirklich interessiert, also insofern. So, net-stat. Jetzt läuft die Datenbank. sudo, insert-into, funktioniert, Datenbank läuft wieder, check my solution, ist korrekt. You made a Zetges server happy, congrats. Nice, oder? Wir sind, wir sind schon richtig, richtig nette Leute hier. Server is happy. A white pepo happy server. Ich muss es auf Twitter streamen. Ich muss gar nichts. Alles auf Twitter streamen, das machen bestimmt manche Leute zum Ultratriggern. Poggers, Server is wieder glücklich. Chat, gibt es noch Fragen dazu? Wollt ihr noch was wissen? Hab ich irgendwas übersehen? Ja, man kann, man kann auf Twitter, früher war das mit Periscope, aber man kann auf Twitter irgendwie streamen. Kannste auf Twitter so viel Bullshit machen, was keiner will? Ach, was wäre die Original-Lösung gewesen? Gute Frage, gucken wir gleich. A disk space voll. Wir hatten Glück, dass in der Fehlermeldung stand, no space left on device. Weil auf die Idee da jetzt zu gucken, wäre ich wahrscheinlich erst viel später gekommen. Die Original-Lösung. Ja, was ist die Original-Lösung? Run the test, is this Postgres Server running? You can check sudo, das haben wir gemacht. PS AUX Postgres, ne das haben wir, doch haben wir glaub ich auch so was probiert. System start Postgres, check status again, sowas in der Richtung haben wir auch gemacht. Das haben wir nicht gemacht. Journal minus u, Postgres, blablub. Wir haben es im Postgres Log selber gefunden, ist aber auch ok, ist ja egal wo man es herfindet. Warlog syslog, hab ich auch nicht reingeguckt, ich hab im Postgres Log selber geguckt. Check disk space, das haben wir wieder gemacht. Minus h ist übrigens nicht wirklich erforderlich. Minus h ist nur, dass es human readable ist. Das heißt, hier hätten wir es auch gesehen, aber minus h ist natürlich deutlich angenehmer zu lesen. Weil, was weiß ich wie viele bytes versus 8G, da erkennt man das deutlich besser. So und danach krept minus i im syslog, aha. Und dann Postgres data, ok leute, ich hab es ganz anders gemacht anscheinend. Delete backup files, ok das hab ich dann wiederum gemacht und das Ding gestartet. Ok, die offizielle Lösung ist finde ich fast komplizierter als meins. Leute, das ist jetzt, das ist wirklich noch nichts großartig kompliziertes. Ich hab 15 Jahre Linux Erfahrung und auch Admin Erfahrung, da ist sowas nicht sonderlich kompliziert. Ich gebe zu, ich gebe zu, das war Zufall, das muss ich auch zugeben, das war in dem Fall tatsächlich Zufall, dass ich das gefunden habe so schnell. Das ist so direkt im Log drin entstanden, das war Zufall, das hätte doch durchaus länger dauern können. Weirdflex, ja was soll ich sagen, es ist die Wahrheit. Aber man muss sich da keine Gedanken drüber machen. Ich benutze täglich Linux, ja. ncedu ist wahrscheinlich nicht drauf. Ich benutze täglich Linux, ich benutze täglich Linux auf der Arbeit, sowohl auf dem Desktop als auch in unserer gesamten Linux Umgebung. So ein paar Sachen, wie Dienst läuft nicht, Logg Files nachgucken, das macht man so oft, da denkt man gar nicht mehr großartig drüber nach. Ich habe in Warlog geschaut, genau. Ja. Das ist auch nicht verkehrt erstmal zu gucken. Also ich glaube so eines der meist benutzten Befehle ist df-h, free-m und solche Geschichten. Danach dicht gefolgt von htop, ok vielleicht normales top, wenn es kein htop gibt. Alles klar, check my solution, korrekt, BÄM. Sudo, ne brauchen wir nicht. Power off. Gibt es noch Fragen zu der Aufgabe chat? Ist das eine Debian vm, das ist eine gute Frage, guck mal mal. Alter, leckt, meine Güte, jetzt haben wir, ach home is not set. CUT, etc. Es ist eine Debian GNU Linux, nicht dass man etwa auf die Idee kommt, einfach nur Linux zu sagen, weil ihr wisst was passiert. Dann wirds kritisch, wenn man einfach nur Linux sagt. Man muss schon korrekterweise GNU Linux sagen, sonst spawnt er bei euch um die Ecke und flamet euch. Du hast keinen anderen Zugang von dort, du kannst dort nicht rein und nicht raus. Funktioniert nicht auf der Kiste. Die haben das schon ganz gut gemacht, guck du kannst jetzt zum Beispiel, du kannst ja nicht mal ein DNS Server pingen. Kannste gar nichts machen. Was aber auch sinnvoll ist, weil sonst würden die Leute garantiert das irgendwie missbrauchen. Was für ein Linux wird auf Enterprise Ebene gerne benutzt, dazu kann man eigentlich bloß sagen Red Hat beziehungsweise CentOS, was es ja nicht mehr gibt in der jetzigen Form. Zum größten Teil Red Hat. Mit UFW geblockt, können wir gucken. Ach, der hat mal installiert. Ne ne, das ist bestimmt nicht geblockt, das ist ein privates Netz ohne Zugang. So blöd ist der Betreiber bestimmt nicht. Also Red Hat, Red Hat ist im Enterprise Umfeld eigentlich mit Abstand das beliebteste, zumindest meiner Erfahrung nach. IP Tables willst du, ja können wir auch gucken. IP Tables minus V minus L, nix drinne. Ansonsten, ich wollte gerade sagen, flirten als ich wollte gerade sagen, in Asher ist Ubuntu tatsächlich relativ beliebt. Dadurch, dass es jetzt kein CentOS mehr gibt, könnte ich mir vorstellen, dass es im Enterprise Umfeld auch etwas nachlässt. Weil aktuell ist es so, entweder du kaufst dir wirklich Red Hat für jede Kiste, beziehungsweise mit Support Abo und Geschiss, oder du benutzt eines der neuen CentOS Nachfolgeprojekte. Genau, sowas. Wobei, da hat kaum noch eine Erfahrung so wirklich damit. Oder, oder, das ist auch eine Möglichkeit, oder man benutzt Oracle Linux. Kann man auch machen. Wobei ich persönlich eher auf Ubuntu setzen würde, Debian ist auch möglich. Also, so wie Shryker sagt, es ist eigentlich Red Hat, Red Hat, Ubuntu und Debian. Suze ist, ist mir ehrlich gesagt in freier Wildbahn bis einmal für die Telefonanlage noch nie untergekommen. Ja, Alpine, wenn die Container zählen, da hast du recht. OpenBSD habe ich so, will ich gerade, habe ich so in freier Wildbahn mal ein OpenBSD gesehen? Nee, ich glaube nicht. Doch, habe ich. PFSense habe ich ein paar Mal im Einsatz gesehen. Aber ansonsten. Ja gut, Alpine basierte Images haben den Vorteil, die sind halt sehr klein. Ok, also sind wir hier fertig. Sudo, Power off. Bam. Ups, ja. So, more Scenarios. Next please. Wo sind wir stehen geblieben? Manhattan. Can't write into Database. Als nächstes kommt Tokyo. Can't surf Webfile. Medium, 15 Minuten. Ok, run. Also, was ist die Aufgabe? Die Aufgabe ist tatsächlich diesmal relativ kurz und knapp. Also, Stufe Mittel. Es gibt einen Web Server, der eine Datei war www.html.ok, das ist also der Standard der Standardfahrt. Der eine Datei war www.htmlindex.html mit dem Inhalt Hello Set Server bereitstellt. Aber wenn wir versuchen sie lokal mit einem HTTP Client wie Curl zu prüfen, zu überprüfen, wird nichts zurückgegeben. In diesem Szenario geht es nicht um die spezielle Web Server Konfiguration und sie müssen nur allgemeine Kenntnisse über die Funktionsweise von Web Servern haben. Ok, Test ist Curl auf Port 80 sollte Hello Set Server zurückliefern. Alles klar. Gucken wir mal. Gucken wir mal was passiert, wenn wir es ausführen. Curl hängt. Hängen ist komisch. Home, Ubuntu, ja gut, was auch immer. Netstat. Wir gucken mal ob auf Port 80 überhaupt was läuft. Port 80 läuft ein Apache. Der läuft und ist an. Ob IPv6 auf Port 40, das ist bei lokalen Sachen, das ist egal, das müsste auch so funktionieren. Ok, ich habe eine Idee. Ich habe eine Idee. Nachdem das hier gar nicht funktioniert, machen wir mal System CTL, stopp, Apache, Apache 2, ok, Apache 2 ist es. Status, aus. Wir haben das gleiche Ergebnis wie vorher. Passt mal auf Leute, die wollen uns debaten. Ich sage euch, die wollen uns debaten. Sieht eigentlich gut aus. Ne, sieht nicht gut aus. Die wollen uns ernsthaft debaten. Die wollen uns wirklich debaten. Ich habe es eigentlich nur eingegeben, weil vor zwei Minuten jemand im Chat geschrieben hat, wie man mit IP Tables überhaupt die Chains und so auflistet. Das hätte ich aus dem Kopf gar nicht gewusst. Also ohne den Chat hätte ich das nicht so schnell rausgekriegt. Ja, daran liegt es. Daran liegt es, der droppt einfach alles. Also normalerweise, also hätte jetzt nicht einer im Chat geschrieben, hätte ich folgendes gemacht. Ich hätte einen temporären Web Server oder Netcat gestartet auf Port 80. Ich hätte Apache ausgeschaltet. Wir machen das mal. Wir tun mal so, als hätten wir es noch nicht gefunden. Wir tun einfach mal so, als hätten wir es noch nicht gefunden. Also wahrscheinlich hätte ich als nächstes folgendes gemacht. Python One Liner HTTP Server. Wahrscheinlich hätte ich das hier gemacht. Wahrscheinlich hätte ich sowas hier gemacht. Haben wir eine T-Max drauf? Ah, Polgarz, nice. Also wahrscheinlich hätte ich jetzt gesagt, war www. War www, habe ich mal hier geguckt, HTML. Okay, es ist zwar alles root, das ist schon sehr merkwürdig, aber es ist zumindest lesbar. HTML. Und dann hätte ich wahrscheinlich sowas hier gemacht. Port 80. Ach Mist, okay. Ist gar nicht drauf. Na dann. Ah nee, doch ist drauf. Wahrscheinlich hätte ich das hier gemacht. Und dann hätte ich mal probiert. Curl, Local Host 80. Brauchen wir da eigentlich nicht. Und es geht immer noch nicht. Und dann wäre ich wahrscheinlich schon skeptisch geworden, weil ich mir gedacht, okay, das kommt gar nichts an. Das wird wahrscheinlich auch nicht am Apache liegen. Das nächste, was ich wahrscheinlich probiert hätte, ist auf Port 8000. Und dann hätte ich geguckt, geht es auf Port 8000? Auf Port 8000 funktioniert es. Und dann hätte ich mir gedacht, Moment, woran kann das liegen? Und dann hätte ich wahrscheinlich IP-Tables geguckt. IP-Tables minus V minus L. Und da ist es drin. Ja, okay. Also dann wählen wir das Ganze mal. System CTL Restart Apache. IP-Tables, boah, das weiß ich aus dem Kopf nicht. IP-Tables minus D. Keine Ahnung, weiß ich aus dem Kopf nicht. IP-Tables, Delete, Rule. Ist NF-Tables eigentlich mittlerweile weit verbreitet? Nö. IP-Tables minus F, okay. Und wie löscht man? Okay, ich machs einfach wieder. Ich machs einfach wieder. Chatters schreiben. IP-Tables einfach nur minus F oder sowas wie minus F Input. Das ist doch, glaube ich, eine Input-Regel. Gibt es sowas wie IP-Tables, IP-Tables minus F Input, sowas? No-Chain, ah nee. Input groß geschrieben, so. Okay, einfach nur minus F. Alles klar. Okay, jetzt ist es leer. Und jetzt Curl Local Host. Oh. Da ist noch mehr im Argen. Nee, Leute, das hab ich jetzt kaputt gemacht. Ich glaube, das hab ich mit meinem Python Zeug kaputt gemacht. Nee, Apache ist gestartet. Alter, was will denn das hier? NetStats minus Tulpen. Apache läuft. Ich glaube, ich hab's kaputt gemacht. Aber Curl funktioniert nicht. Warum oder was ist der Test? Ach so, Moment. Wobei das eigentlich können. You don't have permissions. Eigentlich müsste das ja auch WWW-Data gehören. War schon kaputt? Also normalerweise müsste das WWW-Data gehören. Vermute ich mal. Gucken wir mal. Hier ist auch Scrap-Apache. Der läuft als WWW-Data. Allerdings wundert es mich, weil es ist ReadX. Was im Endeffekt? Ah. She baited. Deswegen funktioniert das nicht. Okay, dann machen wir's gleich mal richtig. CHown WWW-Data. WWW-Data. CHown minus R. HTML. HTML. Curl. Jetzt funktioniert's. Okay, alles klar. Das hab ich doch nicht selbst kaputt gemacht. Also waren's zwei Schritte. Als erstes, musste man feststellen, dass IP-Tables HTTP Traffic blockt. Und als zweites hat man festgestellt, der Datei hat die falschen Rechte. Schauen wir mal, ob das jetzt funktioniert. Check my solution. Correct. Also, dann schauen wir uns mal die offizielle Lösung an. Chat, wenn ihr Fragen zu dieser Übung habt, haut's jetzt in Chat. Wahrscheinlich hab ich manche Sachen übersehen. Oh. Ich glaub, wir haben länger gebraucht als notwendig. Dafür ist. Okay, alles klar. Also, Solution. Run test Curl. Okay, haben wir gemacht. Siehste, da wär ich wahrscheinlich erst viel später draufgekommen, IP-Tables zu gucken. Siehste, das war Zufall, weil's eben jemand im Chat vorher geschrieben hat. IP-Tables. Dann muss man IP-Tables minus F machen. Okay. Dann muss man das Ownership checken für die Datei. Ja. Und dann CHown. Okay, ich hab Recursive FCA ongemacht. Alles klar. Okay, nice. Haben wir auch rausgekriegt? Pfeifert. Wobei das wahrscheinlich gar nicht funktioniert, weil der DNS ist ja cached. Da hat's eine Anfrage geschickt. Ja, so was in der Richtung machen wir. Okay, gibt anscheinend. Nee, hab ich nicht. Da lagst du gar nicht so falsch mit. Warst ja am Ende dann auch. Also was? Okay, Moment. Hallo und guten Tag. Ich habe mal eine Frage. Vielleicht kann mir hier einer helfen. Ich benutze in meiner Schule auf Linux VM Tools. Was? Ich benutze in meiner Schule auf Linux VM Tools. Kann ich meine erstellte Sandbox, die Daten kopieren, diese bei mir zu Hause auf Windows dann aufrufen mit dem VM Tools bei mir? Ich hab keine Ahnung, was du genau machst. Da kann ich jetzt so nichts zu sagen. Das ist mir zu vage. Okay, haben wir das fertig? Next. Tokio sind verstehen geblieben. Tokio. Als nächstes kommt Cape Town. Das hört sich ja schon an. Run. Moment, das gehört ja gar nicht dazu. Okay, also. Was ist die Aufgabe? Gestörte Engine X. Kollege vom Chainlord, der Engine X hier. Es ist ein Engine X Web Server installiert, der von System D verwaltet wird. Wenn Sie curl minus L machen, ausführen, erhalten Sie curl fail to connect to localhost. Beheben Sie das, so dass Sie die Standard Engine X-Seite erhalten, wenn Sie curl ausführen. Okay. Okay, die VM ist noch nicht ready. Nicht ready. Ich glaube, er will einfach nur seine VM kopieren. Ja, vielleicht. Keine Ahnung. Er könnte sich auch die Dateien auf den USB Stick kopieren und dann was ich daheim in der VM oder was auch immer. Ich kann daraus das nicht erkennen. Also du kannst die, also wenn du die VM kopierst, komplett, also mit Config Files und Disk Images und sowas, da kannst du die ohne Probleme eins zu eins auf dem anderen Rechner starten. Okay, was? In der Schule haben wir ein Linux PC. Da ist VM Tools drauf. Da machten wir ein Windows 10 Pro Sandbox drin. Jetzt habe ich aber zu Hause kein Linux, sondern nur Windows 10 kann ich erteilen, die ich in. Ach so, ja, sind ja die gleichen. Es ist ja das gleiche Betriebssystem in der VM. Ja, ja, das funktioniert. Nee, also ich kenne das, aber dieses habe ich nicht gemacht. Das funktioniert. Am besten ist, du nimmst einen USB Stick, ziehst dir das da drauf und nimmst halt einfach mit. Okay, also, wo sind wir stehen geblieben? Open Terminal. Next. So, was soll funktionieren? Was soll funktionieren? Erst mal root werden, wie immer. Curl 127.0.0.1. Geht nicht. Connection refused. Der ist in engine.x-webserver install. Okay, also System CTL Status engine.x. Paled. MonkaS. Geht schon gut los. Warum ist der engine.x-Server? Warum failed der? Der failed, weil. Unexpected Semicolon in etc engine.x sites enabled default. Aha, da sind irgendwelche Zeichen drinnen, die da nicht rein sollen. Ich sehe es nicht. Wo ist da? Er sagt Zeile 1. Ah, she baited. She baited. Habe ich nicht gesehen, Leute. Alles klar, okay. So, Semicolon weg. Restart engine.x. Okay, das sieht jetzt schon viel besser aus. Das wird aber wahrscheinlich nicht alles gewesen sein, oder? Status engine.x running. Eats. Okay, das wird aber wirklich, ich glaube nicht, dass das alles gewesen wird. Curl. Okay, ich wusste doch, dass da was kommt. Internal Server Error. Oh, Moment. Jetzt müssen wir nochmal. Vielleicht heißt die Datei falsch. War. Okay, ich meine, sie gehört gut, aber sie hat Read Access. Das sollte reichen. Da ist doch bestimmt ein Schreibfehler drinne oder sowas. Index Engine.x debian.html. Darf das, darf das Ding so heißen? Das darf so heißen. Okay. MV. Wir verschieben, wir verschieben das Ding jetzt mal. Machen ein Curl und gucken, was rauskommt. Pop in. Okay, also prinzipiell geht das, aber es hat einen Internal Server. Hä? Da kaputt. Wie kommt man auf den Internal, Festplatte voll wieder. Wie kommt man auf den Internal Server Error bei einer einfachen Log Datei, bei einer einfachen HTML Datei. Ist der rechte Schein okay? Gucken wir mal, Wahllog. Show in die HTML. Können wir gleich machen? Na klar. Alter Windows, was ist jetzt los? Engine.x Error Log. Oh, was ist da? Was ist da los? TMAX. Ach fuck. Okay, es ist kein TMAX auf. Too many open files? Two? Hat das Ding irgendwelche Limits gesetzt, dass es keine Dateien aufmachen kann? Hat es ein File Handle Limit irgendwo gesetzt, was ich jetzt nicht gesehen habe? Wobei man das wahrscheinlich nicht in der. Okay, das ist jetzt tatsächlich ein bisschen komplizierter. Ich glaube hier in der Konfig setzt man das nicht. Moment, Moment, Moment. Google. Too many open files. Engine.x Aha, aha. Too many open files. Also in der Engine.x Konfig habe ich nichts gesehen. Es wäre aber auch bescheuert. Ah, hier guck mal. Limit. Das kann sein, dass in der Limits da Teil was drinne steht. Limits. Nope. Du hast recht, im Unit File. Im Unit File könnte wirklich sein. System CTL Edit. Okay. Stack Overflow Driven Bug Fixing. Limit File. Zehn. Ich habe seriously keine Ahnung was diese Option macht. Ich habe diese Option noch nie in meinem Leben verwendet. Du hast zwei VWW. Nee, ich kann keine zwei VWW haben. Okay, wir schreiben einfach 10.000 rein oder so. Okay, easy. Wenn das hilft. Ups. Ah, das ist ja Nano, MonkaS. Wer macht denn sowas? Wer quält einen hier mit Nano, Mensch? Richtiger Pepega Editor. System CTL Restart Engine.x Wie? Was? Hey, ist die Datei aber noch vorhin editiert? Hä? Ach, ETC Engine. Ist das da auch noch verkehrt oder was? Nee, Quatsch. Quatsch, Quatsch, Quatsch. Ach, kann man sich mit der ID etwa verbinden, Chat? Ah, okay. Ich muss die Kiste jetzt ausschalten, Leute. Wer weiß was ihr da drauf rumwurstet. Das hätte ich ja nicht gedacht, dass man mit der ID, wenn man die ID sieht, irgendwelche komischen Dinge anstellen kann. Das hätte ich wirklich nicht gedacht. Aber okay, dann kann man das so im Stream nicht machen. Kann man, ja. Anscheinend geht das. Also, es gibt jetzt zwei Varianten, wie wir das machen können, Chat. Entweder ihr haltet euch zurück, wobei ich vermute, vermute, dass das nicht funktionieren wird. Oder ich muss das irgendwie ausblenden. Okay, oder Vollscreen, oder, nee, das ist, das ist auch dumm. Einfach die Katze oben in die Ecke. Nee, nee, nee, so einfach ist das, glaube ich, nicht. Wie blende ich das jetzt? Kann man nicht irgendwie einfach die Adressleiste ausblenden oder so? Okay, wir müssen das, glaube ich, OBS-technisch irgendwie ein bisschen verschieben. Okay, jetzt muss ich mal kurz gucken, ob das jetzt weg ist. Nee, aber da muss ich viel zu viel ausblenden. Das ist doof. Da muss uns irgendwas anderes einfallen. Keklchi bated. Nee, nee, das kannst du vergessen. Der Chat wird sich nicht benehmen. Das kannst du, das kannst, das ist ausgeschlossen. Kannst du den OBS einfach eine Color-Source hinzufügen und dann? Okay, gibt es die Möglichkeit Chrome-Hide-Addressbar, Auto-Hide-Addressbar, okay. Ja, ich muss, ich muss wohl einen Offerlay machen. Halt, gibt es da irgendwas? About-Flags? Hä? Hide-Toolbar, das ist doch was ganz anderes. Ach nee, das geht tatsächlich. Das geht, das geht tatsächlich. Ach komm, scheiß drauf, ich mach jetzt, ich mach jetzt einfach folgendes. So. Easy. Jetzt seht ihr auch nichts mehr. Okay, more scenarios. Weil mich das triggert, ich kann keine 1 mehr kopieren. Also, wo sind wir stehengeblieben? BorkedEngineX, das hatten wir gerade, das haben wir gefixt. Außer Keklchi Baited. Doch, das war gefixt. Das hätte funktioniert, das hätte funktioniert. Ich bin mir relativ sicher, das hätte funktioniert jetzt. Ich weiß, wir können es auch einfach nochmal schnell fixen, okay. Können wir nämlich gleich testen, ob es funktioniert. Wir probieren es nochmal aus, wir probieren es nochmal aus. Wir machen, wir machen das nochmal schnell, das dauert ja bloß 2-3 Minuten. Wir machen das nochmal schnell. Keklchi Baited, mann. Zu geil. 15 Minuten soll die Aufgabe gehen. Ja, sonst wird es für den zu teuer auf AWS. Keklchi Baited. Wer das wohl gewesen ist. Warum gibt es den Preis-Champ nicht mehr? Weil es zu eklig war, die Crawler aktuell zu halten. Ich glaube, Leute, Leute, ich glaube, wir dürfen das nicht nochmal machen. Ich glaube, wir dürfen es nicht nochmal machen. Die Firm geht nicht auf. Kann das sein, dass das procken ist? W-Power-Off bringt nichts oder was? Na na na. Ach, jetzt surfen wir, okay. Alter. Okay, das heißt, wir wissen jetzt, wo wir es positionieren müssen und zwar, wir müssen es so positionieren. Okay, wenn ich es jetzt verschließe, okay, jetzt ist alles weg. Connection Closed. Okay, jetzt ist, jetzt ist weg. Jetzt müssen wir nochmal einen Server erstellen. Wahrscheinlich sind wir gleich im Rate-Limit drin. Wahrscheinlich sind wir gleich im Rate-Limit und dürfen nicht weitermachen. Kurz Cookies clearen. Ich glaube, die sind nicht so blöd und machen das auf Cookie-Basis. Es steht unten, wenn ich über den Link haffe. Alter, es ist ja gut jetzt, Mann. Warum ist das so kompliziert? Brauche ich unten Link? Brauche ich jetzt hier unten nochmal einen Terminal drüber oder wie? Okay, wir machen hier oben mal was anderes. Oh, excellent. Okay, jetzt sieht man nichts, oder? Chat, top secret. Jetzt ist alles hidden. Okay, also zwei Sachen. Moment, wenn ich das jetzt rüberschiebe, hoa, Glück gehabt, Leute. Knappe Geschichte, knappe Kiste hier. Okay, man sieht nichts. Also, wo sind vielleicht die Sachen? Etc, nginx, nginx, ne, default, ne, wo war das Ding? Sites, enabled, default, irgendwie so. Zack, die Musik ist aus. So geht das net. Also, hier war das drinne. System, ctl, restart, nginx, status. Was war das andere Problem nochmal? Ah, das ist das sus-edit, mir das da. Limit. Okay, pepega-editor, Mann. Yes. Hat das jetzt funktioniert? Yes. Restart, nginx, status, nginx. Läuft, jetzt steht ja auch nicht kackel, cibeide drin. Und curl, nginx, returns. Returns, okay. Check my solution. Bäm, hat funktioniert, alles klar. Also Leute, so war die offizie... Achso, wir können uns mal angucken, was die offizielle Lösung ist, wie man das Ganze fixen soll. Check status of nginx. Jo, haben wir gemacht. Nginx minus t. Das hätte ich machen sollen. Habe ich nicht dran gedacht, dass es sowas gibt. Hat aber glaube ich jemand im Chat geschrieben. After fixing config file and restarting nginx hat 500er error. Und dann soll man im log gucken. Ich glaube, das habe ich auch gemacht. Und dann soll man im service limit no file anpassen. Und dann restarten. Okay, alles klar, haben wir gemacht. Bäm, next please. Wir sind stehen geblieben bei borkt nginx. Als nächstes kommt jetzt salta. Docker container won't start. Da bin ich jetzt mal gespannt. Docker containerisierungsstells am start. Okay, also was ist die Aufgabe? Die Aufgabe ist, im Verzeichnis home admin app befindet sich eine gedokte, eine dockerize, befindet sich eine containeri dockerizierte web anwendung. Erstellen sie einen docker container, sodass sie eine web anwendung auf port 8888 erhalten und zu ihr curlen können. Damit die lösung gültig ist, sollte es nur einen laufenden docker container geben. Also der test ist curl localhost 8888 soll hello world zurückgeben. Schauen wir mal. Was macht curl eigentlich so webrequest? Curl hat bald 25 jähriges jubiläum im märz. Das habe ich auf github gelesen. Die haben irgendwie so einen curl celebration day oder sowas im märz irgendwann. Okay, auf geht's. Okay, was passiert, wenn man das hier. Okay, da läuft. Okay, gut, dass wir das ausprobiert haben am Anfang, weil da wäre ich jetzt auf die nase gefallen, dass der port geblockt ist. Es läuft schon was auf port 8888. Was läuft denn, was läuft denn so auf port 8888? Netstat minus tulben. Es läuft auf port 8888 ein engine x. Systemctl stopp engine x. Und jetzt machen wir nochmal ein curl. Und jetzt geht nix mehr. Okay, das ist schon mal gut. So, wo liegt die dockeranwendung? App. Ich will ein bisschen was sehen hier. Okay, home admin, home app. Da gibt's ein dockerfile. Kann ich das hier resizen, ohne dass ich es irgendwie leake? Ja, kann ich. Also da liegt ein dockerfile, ein server.js. Gucken wir mal ein server.js rein. Server.js. Das ist eine express anwendung, habe ich keinen plan von map slash send hello world. Okay. Alles klar. Ja gut, t-max gibt's net. Ach toll. Dann würde ich sagen, wir bauen das Ding einfach mal. Docker, bild, Punkt. Geben wir dem Ding mal Name, App. Was ist t-max? Da kannst du dann mehrere, da kannst du in einem Terminal mehrere tabs und sowas aufmachen. Das ist ganz praktisch, wenn man ein paar Sachen parallel machen möchte. So, also wir haben jetzt die App gebaut. Da machen wir jetzt mal docker run minus d, weil ich nicht will, dass es im Vordergrund ist, da ich noch was tippen kann. Minus d, App. Okay, docker ps. Okay. Docker log. Logs. Wie heißt das Ding? Kind. Ach ja, guck mal da. Es gibt ein Fehler in der Node.js Anwendung. Cannot find module user user src app surf.js. Lasst uns mal in das Docker File gucken. Okay. Okay. Okay. Das soll 8888 sein, oder? Nicht 8880. Wart mal. Moment, Moment. Ich glaube, die wollen uns schon wieder jebaden. Genau, das heißt server.js. Das ist ein Master jebader. Der Part fürs Working, der sieht falsch aus. User source. Sicher? Nö. Müsste eigentlich stimmen. Sehen wir gleich. Ein richtiger Master jebader ist das. Server.js. Build. Run. Docker ps. Aha. Netztat. Ach, ich hab Port Mapping nicht richtig gemacht. Docker stopp. Hab das Port Mapping nicht richtig gemacht. Wir wollen es ja auf Port 8888 haben. Wir werden nicht das Docker File anpassen. Wir sagen einfach Docker Run und dann minus P 8888 auf Port 8880. Bam. Docker ps. Aha. Läuft. Jo. Mehr alter Shit. Läuft. Okay. Und was ist der Test? Der Test ist curl 8888 returns hello world. Fuck. Das wäre ja auch zu einfach gewesen, wenn das einfach funktioniert hätte. Warum funktioniert das nicht? Netztat. Oh nee, ist das wieder eine IP-Tables-Regel? Ich raste aus, Alter. Boah, das ist zu viel. Moment. Äh. Ich seh nix. Seht ihr irgendwas Schlemmes? Sieht doch okay aus, oder? Nee, was ist das hier? Nee, alles gut. Nee, das ist eigentlich okay. Oh, what? Nee, das sieht, das sieht eigentlich okay aus. Okay. Ähm. Warum geht das nicht? Netztat. Sieht eigentlich okay aus. Docker stopp. Die App hört auf einem anderen Port, aber das ist nicht wild, weil ich hab's ja umgemappt. Stopp. Fuck. Ich hab, ich hab Steuerung W gedrückt. Shit. Es war nicht so high IQ. Curl. Localhost 8888. Connection reset. Okay, jetzt steh ich echt ein bisschen auf dem Schlauch. Was hat er jetzt für Probleme? Docker logs. Moment. Der Server startet an 8888 anstatt auf. Moment, ist da noch ein Fehler im Dockerfile? CD, Home, Admin, Dockerfile. Aha. 8888, weil ich vermute mal im Server.js steht Port 8. Aha. Okay, okay, okay. Docker stopp. Da war auch noch ein Fehler drin. Da war auch noch ein Fehler drin. Alles klar. Wir haben zwar den richtigen Port umgeleitet, aber die Anwendung lauscht auf dem anderen Port. Jetzt, jetzt wird's funktionieren hier. Build. Richtiger Chebater, der Typ. So, jetzt können wir quasi 8888 extern auf 8888 intern machen. Docker, PS. Curl, Localhost 8. Das ist wunderbar für Azubis. Okay, hello world. Funst. Check my solution. Correct. Agreege. Nice. Leute, gibt's noch Fragen? Wir haben nicht mal viel Zeit in der VM. Ich glaube wir haben bloß 15 Minuten Zeit. Wir haben die 15 Minuten wahrscheinlich fast erreicht. Zudo, Power off. Bam. More Scenarios. Hab ich irgendwas überlesen? Bei dem, bei dem musste ich mich ein bisschen konzentrieren. Das war schon ein bisschen komplizierter jetzt, oder? Stimmt, wir können unseren Timer verwenden. Leute, Sixhead, wir verwenden das nächste Mal den Timer. Sind das jetzt Admin-Aufgaben oder ist das schon ein Bereich? DevOps. Das kann man nicht so, das kann man nicht so genau trennen. Seriously, viele Admins nennen sich heute einfach nur DevOps-Engineer, weil es cooler klingt. Glaubt mir, ich spreche da aus Erfahrung. Das ist alles fließend, der Übergang. Okay, gab's Questions, die ich übersehen habe? Nee. Weiter, was haben wir das nächste? Docker, Container, Wunschpass. Venice. I'm in a container. Okay. 15 Minuten Zeit. Guck mal Leute, wir benutzen mal unseren neuen Sixhead Timer. 15 Minuten. Okay. Gleich geht's los, sobald es startet. Was ist denn die Aufgabe? Try to figure out if you are inside a container or inside a virtual machine. Leute, easy. Wisst ihr was ich einfach probiere? Modprobe, PC-Speaker. Wenn Modprobe funktioniert, weiß ich, ich bin in der VM. Wenn Modprobe fehlschlägt, weiß ich, ich bin im Container. Was ist denn sonst noch? Man könnte, wird what verwenden? Was ich nicht installiert habe? Wird what? Wird what könnte ich verwenden? Als root, ja, ist gut. VMWare. Aber ich gehe davon aus, dass es nicht installiert ist. Wir könnten die MAC-Adresse checken. Wir könnten die MAC-Adresse checken, ob das bekannte VMWare, KVM oder sonst was MAC-Adressen sind. Wir könnten vielleicht die kernel command line angucken, mit was das OS gestartet wurde. Wir könnten gucken, ob unser Initprozess, falls wir einen Initprozess, wobei, wenn wir System D laufen haben, ist es höchstwahrscheinlich kein Docker-Container. Wir könnten gucken, ob unser Initprozess, der erste Prozess ist, der gestartet wurde. Keine Ahnung, wie man gescheit rauskriegt auf einem Container. Du kannst auf.dockerenv schauen. Ja, es gibt aber nicht nur Docker als Kontainerisierungslösung. Proc CPU-Info. Das ist eine gute Idee. Wir können gucken. Hostname-CTL. DMSC. Ja, gucken wir. Also ich probiere das mit dem kernel-Modul. Der kernel-Modul dürfte das aller-einfachste sein. Open new window. Sack. Also, modprop. Modprop ist nicht drauf. Meine... Scheiße. Okay. Mein erster Ansatz funktioniert schonmal nicht, dass ich einfach kernel-Module laden kann. Ellers wird wahrscheinlich alles nicht drauf sein. DME-Decode. Alles nicht drauf. Okay. Cat Proc CPU-Info. Da könnten wir gucken. Das ist ein AMD-Epic. Tja. Erkennt man jetzt nicht wirklich was. Mein bester Guess ist erstmal Mac-Adressen. Ist das eine bekannte Mac-Adresse von irgendeiner Virtualisierungslösung? Mac. What? Sender. Nope. Okay. Cat Proc CMD-Line oder sowas. Boot-Image. Cloud-AMD-64. Das sieht nach einer VM aus, wobei ich mir ehrlich gesagt nicht sicher bin, ob das nicht in einem Container, der auf einer VM läuft, schlicht und ergreifend ganz genauso aussieht. Gibt es nicht System-D-Detect-Wirt? Ach. Was ist das? Okay. Wir sind in einem Container. Das habe ich ja noch nie gehört. System-D-Detect-Wirt. Yep. Cock. Kannte dir das? Versuch Hostname-CTL. Ach. Guck mal. Das ist auch cool. Okay. Das muss ich mir merken. Da habe ich wieder was gelernt. Das kannte ich selbst auch nicht. Hostname-CTL und System-D. Schau Proc 1-C-Groups an. Proc 1? Ja gut, das ist ja Init. C-Groups. Init Scope. Das ist jetzt gut oder schlecht? Was sagt... Also okay, wir sind in einem Container. Das wissen wir. Aber erkennt man jetzt daran, ob es ein Container ist oder nicht? Ja. Aber nice, nice. Interessant. Das wusste ich nicht. Okay, da hätte ich jetzt ein bisschen überlegen müssen. Aber gut, wir haben es rausbekommen. Wir sind in einem Container. Ease. E. Sudo. Power off. Ach so, gibt es nicht. Okay. Also next. Wo sind wir stehen geblieben? Close an open file. Ach, jetzt kommt das. Boah Leute, ich kann mich nicht mehr lange konzentrieren. Also wir machen das hier noch. Vielleicht, vielleicht. Mal gucken. Aber das machen wir auf jeden Fall noch. Guck mal, da haben wir fast die Hälfte. Dann machen wir das nächste Mal die schweren Dinger. Close an open file. Okay, also Aufgabe. Wir haben eine Datei. Home admin some file is open for writing by some process. Das habe ich eben vorhin schon angeguckt. Close this file without killing the process. Okay, also wir sollen die Datei quasi schließen ohne den Prozess, der die Datei offen hat, zu killen. Das klingt, je nachdem. Irgendwie ein Signal schicken oder sowas. Okay, erstmal root werden, wie immer. Home admin. Okay. Moment, was ist das? Open file.sh? Also Alice of some file. Okay, die Datei ist offen. Womit bin ich das selbst? Wait a minute. Home? Ich glaube, da ist wieder der MasterChebader am Werk. Das bin ich selbst, der die Datei offen hat. Moment. Da ist wirklich wieder der MasterChebader am Werk. Ich glaube, das ist einfacher, als man denkt. Besher C? Less? Geht da irgendwas? Be connect! DEeeeeEEEEHHHHH Okay das ist das ist gemein, das ist wirklich gemein ich bin nur drauf gekommen Weil ich zufällig hier irgendwie OpenFile.sh und sowas gesehen habe Ok das ist das ist Achiebe, das ist Richtig krasser Achiebe Das heißt im Bold Das heißt im Endeffekt eigentlich muss ich nur die Zeile aus der Bash Sahne löschen und es ist gefixt ich mal zack ok loggen wir uns aus loggen wir uns noch mal ein das war aber gemein das war wirklich gemein das ist wirklich der prozess ist jetzt dead ja ja der prozess beendet sich beim aus loggen aber ich habe ihn nicht gekillt das war aber fies also das ist wirklich das ist also ich glaube wenn du nicht zufällig daran denkst weil du die datei gesehen hast suchst du dich da kaputt an den moment power aus der kram kostet ja geld sudo power off ok nice more scenarios ok wir hören jetzt hier auf und ich guck mir hacker ich ich guck mir guck mir unix porn von euch an machen wir das nächste mal weiter an der stelle also merkt euch wir sind bis zu nummer übung nummer 9 gekommen dass man den prozess nicht töten soll auch nicht durch stand das da drin ok dann haben wir es vielleicht nicht auf die richtige art und weise gelöst ok discord ich mache kurz discord auf das muss ich leider am zweiten bildschirm machen weil hier bin ich eingeloggt aber ich kopiere mir die bilder raus jepp discord channel unix porn ok oder bin ich hier eingeloggt discord wahrscheinlich discord habe ich hier gar installiert weil ich müsste habe ich echt kein discord anscheinend nicht ok also weiter geht's dann gucken wir uns das mal an dass den ersten desktop den wir uns angucken ist vom serious max na das passt doch motte motte höchstpersönlich copy image ob ging das jetzt nicht copy link copy link muss ich machen ok du hast nicht wirklich den typ da im hintergrund oder nur für den screenshot sagst du jetzt in die bilder auch noch größer wenn man die anklickt neger oder gehen die noch größer ach so die gehen noch größer ich bin nur zu blöd hier haben wir es das ist kacke ich muss mich in discord einloggen sonst klicke ich sonst klicke ich mich da ja kaputt da bin ich da bin ich ja bin ich ja am mich drei drei tage am kopieren bis ich das hier offen habe ok also das ist hier das ist der linux desktop von unserem obermod also was hat er denn am start lasst mal gucken also ich finde farblich ist das ganze sommer sehr schick gemacht vor allem die kombination mit b top oder b top plus plus oder wie das ding genau heißt die farblich tatsächlich zum terminal passt ich könnte dir vielleicht noch einen tipp dafür geben und meine augen viel zu hell ich könnte ich könnte da vielleicht einen tipp für geben und zwar ist mir auch aufgefallen dass der guck mal du kannst den hintergrund einstellen wenn du hier auf menü gehst options du kannst sagen dass der den background nicht vom theme nimmt sondern den background von einem terminal finde ich persönlich schicker weil weil dann sich der hintergrund besser ins terminal integriert ist aber sicherlich geschmackssache aber ansonsten passt das eigentlich ganz gut finde ich finde ich hübsch schickes schickes color scheme terminal font hack ist eh allerbeste terminal font endeavor os arch by the way auch beste sway also ich sehe du verwendest wayland allerdings dann nicht in einer vm weil der vm funktioniert nicht gescheit ist das hier was ist das hier oben für eine leiste was was hast du da am start wey bar ok alles klar excellent so das hier ist der tap mit dem browser ok du hast umgedreht ich mache es immer so ich mache browser tap 1 command line tap 2 das ist aber geschmackssache ok moment habe ich doppelt aufgemacht ja und hier haben wir noch sein wishlist studio code mit selbstverständlich blazingly fast written in go und er verwendet extra extra als ls ersatz da bin ich ja nicht so richtig mit warm geworden bisher ich habe es eine weile verwendet aber ich finde immer noch raw ls beste tuner als file manager vermute ich jetzt einfach mal ja sehr schick sehr schick sieht auch alles so ziemlich aus einem guss aus also ich vermute dass es tuner ist nicht laut die los arch enjoyer ja finde ich nice so zu sagen so wenn haben wir als nächstes sink sinking face haben wir als nächstes hat leider nicht allzu viele screenshots gepostet aber ein screenshot der wahrscheinlich allen weeps unter uns gefällt also wir sehen hier ein terminal i3 vermute vermutlich i3 mit irgendeiner recht minimalistischen i3 status leiste scheinen wohl keine vm zu sein arch linux by the way was mich jetzt noch interessieren würde ist ist das der hintergrund vom terminal oder ist das der hintergrund von deinem i3 der durch terminal durchschimmert weil ich muss sagen ich für meinen geschmack wäre es ein bisschen viel transparenz im terminal also ein bisschen transparenz im terminal finde ich nice das sieht optisch schick aus aber ich also ich persönlich würde die schrift zu schlecht erkennen mit so viel transparenz hintendran aber sonst sieht doch auch schick aus es ist mir ein bisschen zu also für meinen also für meinen geschmack ist es zu zu nah am original i3 dran und ich finde original i3 sieht nicht so schick aus ok komm uns das nächste an nächste nächste kommt wieder von motge motge und zwar stripes 007 kommt als nächstes dran mit einem linux mint vermute ich mal ja sieht linux mint pinguine im hintergrund ok also b top ist an ist sehr beliebt anscheinend weil es was her macht im terminal mich würde interessieren wie viele von euch es wirklich regelmäßig verwenden und hard top vorziehen jetzt soll ich laufen es ist ein linux mint mit ist es ein i3 das ist kein i3 ist kein i3 das ist ein gnome denn ist mate ist das mateen wobei das steht doch hier irgendwo auch gnome terminal cinnamon ist es cinnamon ach das sind beide bildschirme das ist ein linker bildschirm den fotografiert hatten das ist ein rechter bildschirm jetzt verstehe ich das auch warum die taskleiste auf einmal hier aufhört ok dann suchen wir mal suchen wir mal ran aber es war so dass es irgendwie mit bildschirm passt ok es sieht sehr klassisch gnome style ich aus ok cinnamon style ich in dem fall und der eine monitor ist auch kleiner als der andere sieht aber auch ganz schick aus ist halt klassischer recht klassischer desktop also mehr desktop als ein i3 aber auch schick ich vermute aber dass das default color scheme ist hier sieht man ja auch mint dark orange und sowas also das ist halt der vorteil von sovorkonfigurierten distributionen du kannst es einfach installieren und so benutzen also der hat wahrscheinlich nicht allzu viel custom ist sieht aber trotzdem nicht schlecht aus aber nicht sagen wir haben als nächstes doch der adrian legacy aber als nächstes ok alter was das für eine font das ist doch das ist doch gemimt oder oder benutzt er wirklich die font aber das farbschema ist nicht schlecht ich glaube das ist nicht dass die fault farbschema oder sieht ein bisschen heller aus als das die fault farbschema aber der rest sieht ziemlich die folgt aus was hat er denn sonst noch dann noch einen anderen bildschirm gepostet von sich gießen es ist einer sieht man was es ist ein pop os pop os gnome ziemlich klassischer standard gnome klausur so so das ist ein pop os pop os mit gnome dark theme ok gnome terminal und das letzte sieht man so nach seinem desktop das nicht so spannend aber wenn das alles die voll ist sieht auch nicht schlecht aus wobei ich ehrlich sagen was die schriftart ist nicht so meins pop os genau pop os ist das gachi bus als nächstes haben wir tibelius tibelius hat ein ultra pepo white happy bild gepostet also das das ist mega auflösung dem sein bildschirm oder sind wahrscheinlich sogar zwei bildschirme beste so muss das sein ja ja art ok da hat er dran rum gebastelt also ein artschlinux mit gnome defaults theme defaults black box terminal habe ich noch nie gehört a beautiful getika fort terminal ok beautiful artsch by the way schicken hintergrund hat natürlich gerade unten was in rust was was ein poser und hier omer noch ein terminal aber im groß und ganzen ist es doch ein sehr schickes setup also farblich auch gut aufeinander abgestimmt vom hintergrund zur leiste oben zum leicht durchschimmernden background vom terminal wie teilt er die windows wahrscheinlich gar nicht sondern von hand oder man kann vielleicht hat gnome ja auch irgendwelche shortcuts dafür ist das mal kurz dorken was er laufen hat ok ein wine enjoyer was ist denn btm das sieht ein bisschen aus wie hardtop nur noch mal anders btm github yet another cross platform graphical process monitor irgendwann ist auch mal gut ach das ist written in rust ja dann dann ist ja alles klar das muss auch sein explorer exit ja wine stels ich finde es aber hübsch also ich finde die farbausfall gut so diese farbtöne passt das passt alles richtig gut zusammen so als nächstes kommt captain paul oder auch captain poggers genannt merkt euch das mal please wo wir stehen geblieben sind ich schreibt mir das mal auf captain poggers kommt als nächstes dran ich muss jetzt nämlich mal ganz dringend aufs klo und dann muss ich was essen dass wir machen für heute schluss und schauen das nächste mal weiter ich hoffe euch hat es gefallen chat set setke ja aber die set servers sind jetzt mittlerweile white pepo happy servers die sind glücklich dass wir uns um sie gekümmert haben und dass es jetzt alles läuft ja schön dass ihr da wart schön dass es euch gefallen hat wir machen demnächst weiter mit set servers der zweiten hälfte und gucken uns auch weiter eure desktops an vielleicht machen wir das desktop angucken das nächste mal am anfang im stream vielleicht auch gleich morgen früh oder so machen wir lieber morgen mittag falls wir noch mal streamen oder am nächsten stream dann mal gucken alles klar ich gehe jetzt was futtern leute wir sehen uns macht's gut bis dann", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "und"}, {"id": 2, "start": 7.0, "end": 10.0, "text": "und"}, {"id": 3, "start": 10.0, "end": 13.0, "text": "und"}, {"id": 4, "start": 13.0, "end": 16.0, "text": "und"}, {"id": 5, "start": 16.0, "end": 19.0, "text": "und"}, {"id": 6, "start": 19.0, "end": 22.0, "text": "und"}, {"id": 7, "start": 22.0, "end": 25.0, "text": "und"}, {"id": 8, "start": 25.0, "end": 28.0, "text": "und"}, {"id": 9, "start": 28.0, "end": 31.0, "text": "und"}, {"id": 10, "start": 31.0, "end": 34.0, "text": "und"}, {"id": 11, "start": 34.0, "end": 37.0, "text": "und"}, {"id": 12, "start": 37.0, "end": 42.0, "text": "und"}, {"id": 13, "start": 42.0, "end": 45.0, "text": "und"}, {"id": 14, "start": 45.0, "end": 48.0, "text": "und"}, {"id": 15, "start": 48.0, "end": 51.0, "text": "und"}, {"id": 16, "start": 51.0, "end": 54.0, "text": "und"}, {"id": 17, "start": 54.0, "end": 57.0, "text": "und"}, {"id": 18, "start": 57.0, "end": 60.0, "text": "und"}, {"id": 19, "start": 60.0, "end": 63.0, "text": "und"}, {"id": 20, "start": 63.0, "end": 66.0, "text": "und"}, {"id": 21, "start": 66.0, "end": 69.0, "text": "und"}, {"id": 22, "start": 69.0, "end": 72.0, "text": "und"}, {"id": 23, "start": 72.0, "end": 74.0, "text": "und"}, {"id": 24, "start": 74.0, "end": 77.0, "text": "und"}, {"id": 25, "start": 77.0, "end": 80.0, "text": "und"}, {"id": 26, "start": 80.0, "end": 83.0, "text": "und"}, {"id": 27, "start": 83.0, "end": 90.0, "text": "und"}, {"id": 28, "start": 91.0, "end": 96.0, "text": "und"}, {"id": 29, "start": 96.0, "end": 99.0, "text": "und"}, {"id": 30, "start": 99.0, "end": 105.88, "text": "So, alles klar, ich muss grad noch was gucken auf dem zweiten Bildschirm."}, {"id": 31, "start": 105.88, "end": 111.96, "text": "Eigentlich ist mein Vorschau-Rechner immer noch total overkill für einfach nur Vorschau-Rechner."}, {"id": 32, "start": 111.96, "end": 115.96, "text": "Aber ich will mich ja mal nicht beschweren."}, {"id": 33, "start": 115.96, "end": 120.56, "text": "Besser zu viel Vorschau-Rechner als zu wenig Vorschau-Rechner."}, {"id": 34, "start": 120.56, "end": 128.04, "text": "Projektdokumentation, was schreibst du denn?"}, {"id": 35, "start": 128.04, "end": 130.8, "text": "Das stimmt für die Abschlussprüfung, oder?"}, {"id": 36, "start": 130.8, "end": 132.32, "text": "Was hast du für ein Thema?"}, {"id": 37, "start": 132.32, "end": 138.76, "text": "Was hast du für ein Thema in der Abschlussprüfung?"}, {"id": 38, "start": 138.76, "end": 141.28, "text": "Äh, für dein Projekt?"}, {"id": 39, "start": 141.28, "end": 161.0, "text": "Für dein Abschlussprojekt?"}, {"id": 40, "start": 161.0, "end": 166.8, "text": "Ich glaube es gibt kaum einer, der weiter entfernt ist, Vollzeit-Streamer zu werden"}, {"id": 41, "start": 166.8, "end": 173.48, "text": "beziehungsweise zu wollen als ich, also jemand aus diesem Twitch-YouTube-Ökosystem, ja."}, {"id": 42, "start": 173.48, "end": 179.04, "text": "Also der 0815-Dude um die Ecke wahrscheinlich weniger, aber ich hab da keine Ambition."}, {"id": 43, "start": 179.04, "end": 185.56, "text": "Ach so, okay kein Abschlussprojekt."}, {"id": 44, "start": 185.56, "end": 186.56, "text": "Keg-Buy."}, {"id": 45, "start": 186.56, "end": 194.64, "text": "Könntest du von YouTube und Twitch leben, also so wie ich es jetzt aktuell mache?"}, {"id": 46, "start": 194.64, "end": 195.64, "text": "Nee, auf gar keinen Fall."}, {"id": 47, "start": 195.64, "end": 202.52, "text": "Zumindest, sag mal, ich könnte vielleicht überleben davon, also ich könnte mir wahrscheinlich"}, {"id": 48, "start": 202.52, "end": 207.56, "text": "zu Essen kaufen und ich könnte heizen oder so, aber ich könnte sonst wahrscheinlich"}, {"id": 49, "start": 207.56, "end": 208.56, "text": "wenig machen."}, {"id": 50, "start": 208.56, "end": 212.32, "text": "Auf der anderen Seite, wenn ich Vollzeit machen würde, dann würde ich wahrscheinlich"}, {"id": 51, "start": 212.32, "end": 216.52, "text": "pro Woche auch zwei, drei, wahrscheinlich eher drei Videos machen und wahrscheinlich"}, {"id": 52, "start": 216.52, "end": 225.16, "text": "täglich streamen und mehr Sponsorships und irgendwelche anderen Kooperationssachen machen,"}, {"id": 53, "start": 225.16, "end": 229.4, "text": "dann vielleicht, aber sag mal so, mit dem was jetzt unter dem Strich rauskommt, könntest"}, {"id": 54, "start": 229.4, "end": 231.84, "text": "du halbwegs überleben, aber nicht wirklich gut vonleben."}, {"id": 55, "start": 231.84, "end": 241.96, "text": "Doch, wenn ich jeden Tag ein Video mache und Sponsorship mache oder so, dann bestimmt,"}, {"id": 56, "start": 241.96, "end": 251.48, "text": "aber das sehe ich jetzt nicht als da way für mich, außer weil ich da gar keinen Bock"}, {"id": 57, "start": 251.48, "end": 258.56, "text": "drauf gezwungenermaßen Content machen zu müssen, nicht da ich wirklich jeden Tag streamen"}, {"id": 58, "start": 258.56, "end": 262.04, "text": "würde, jeden Tag Videos machen würde, also jeden zweiten Tag Videos machen würde, viel"}, {"id": 59, "start": 262.04, "end": 265.12, "text": "mehr Sponsorings annehmen und Sellout machen, alle möglichen Geschichten."}, {"id": 60, "start": 265.12, "end": 270.56, "text": "Wo du schon auf Patreon seid und alles, was du nicht gesehen machst, doch, klar, wahrscheinlich,"}, {"id": 61, "start": 270.56, "end": 274.08, "text": "höchstwahrscheinlich schon, aber habe ich überhaupt keinen Bock drauf, mir ist das"}, {"id": 62, "start": 274.08, "end": 275.08, "text": "so viel lieber."}, {"id": 63, "start": 275.08, "end": 281.4, "text": "Normaler Job, dafür Teilzeit dort und hier, wie ich Bock habe, ich muss halt nicht."}, {"id": 64, "start": 281.4, "end": 286.4, "text": "Das ist gute, das ist unglaublich beruhigend, wenn du weißt, du musst weder das eine noch"}, {"id": 65, "start": 286.4, "end": 287.4, "text": "das andere machen."}, {"id": 66, "start": 287.4, "end": 299.36, "text": "Also wenn dich das eine nervt, könntest du das andere machen und umgedreht."}, {"id": 67, "start": 299.36, "end": 303.12, "text": "Also Wohnung habe ich ja eh nicht das Problem, ich muss ja keine Miete bezahlen."}, {"id": 68, "start": 303.12, "end": 312.96, "text": "Was hältst du eigentlich von Zappix, ich finde Zappix gut, ich habe Zappix bei mir daheim"}, {"id": 69, "start": 312.96, "end": 313.96, "text": "auch im Einsatz."}, {"id": 70, "start": 313.96, "end": 319.88, "text": "Ich muss sagen, Zappix ist halt vom Web-Interface und der Konfiguration im Web-Interface ziemlich"}, {"id": 71, "start": 319.88, "end": 326.0, "text": "abartig, bzw. muss ich erstmal an die Zappix-Logik gewöhnen und dass sie Sachen so nennen, aber"}, {"id": 72, "start": 326.0, "end": 330.32, "text": "es nicht unbedingt das ist, wie es benannt ist und so, das ist ganz merkwürdig."}, {"id": 73, "start": 330.32, "end": 337.84, "text": "Aber Zappix ist ne gute Sache, wenn man quasi was haben will mit Web-Interface zum Konfigurieren"}, {"id": 74, "start": 337.84, "end": 343.8, "text": "und wo du mehr machen kannst als mit Uptime-Kuma, also wenn ein das pure Pingen-Up-Down-Anzeige"}, {"id": 75, "start": 343.8, "end": 349.6, "text": "oder halt auch einfache Statuswerte nicht reicht, wenn man zum Beispiel Notifications haben"}, {"id": 76, "start": 349.6, "end": 354.24, "text": "will, wenn die Festplatte voll läuft oder wenn man vielleicht auch mal 2-3 Wochen History"}, {"id": 77, "start": 354.24, "end": 357.52, "text": "haben will, rückwärts gucken will, also wenn da Uptime-Kuma nicht reicht, ist Zappix ne"}, {"id": 78, "start": 357.52, "end": 360.52, "text": "super Geschichte."}, {"id": 79, "start": 360.52, "end": 368.96, "text": "Die Prometheus-Grafana-Kombi ist eher so, wir bauen unser Monitoring selbst, was ja auch"}, {"id": 80, "start": 368.96, "end": 375.76, "text": "seine Daseinsberechtigung hat und es sind ja auch zwei unterschiedliche Ansätze."}, {"id": 81, "start": 375.76, "end": 382.12, "text": "Prometheus ist ursprünglich mal dafür entwickelt worden, damit man Anwendungsmetriken einsammeln"}, {"id": 82, "start": 382.12, "end": 383.12, "text": "kann."}, {"id": 83, "start": 383.12, "end": 386.0, "text": "Nicht so sehr, wie ist die CPU-Auslastung auf der Linux-Kiste."}, {"id": 84, "start": 386.0, "end": 390.64, "text": "Kann man auch machen, aber ich finde man merkt schon, wo das herkommt."}, {"id": 85, "start": 390.64, "end": 394.68, "text": "Deswegen ist Zappix nicht verkehrt."}, {"id": 86, "start": 394.68, "end": 399.84, "text": "Hast du eigentlich auch Pläne, was smartes Energiemanagement angeht mit Solar?"}, {"id": 87, "start": 399.84, "end": 403.44, "text": "Nee, hab ich nicht."}, {"id": 88, "start": 403.44, "end": 409.92, "text": "Ich werd in nächster Zeit kein Photovoltaikzeug aufs Dach bauen lassen."}, {"id": 89, "start": 409.92, "end": 411.52, "text": "Liegt an mehreren Gründen."}, {"id": 90, "start": 411.52, "end": 415.92, "text": "Die Lage ist ganz okay, aber man kommt halt sehr schlecht ans Dach dran, d.h. da muss"}, {"id": 91, "start": 415.92, "end": 418.8, "text": "wahrscheinlich Gerüst gebaut werden, das ist ein riesen Akt."}, {"id": 92, "start": 418.8, "end": 422.6, "text": "Am Ende bezahle ich dann irgendwie 30.000 Euro oder so für eine Installation, dann hab"}, {"id": 93, "start": 422.6, "end": 424.16, "text": "ich ehrlich gesagt keinen Bock drauf."}, {"id": 94, "start": 424.16, "end": 428.92, "text": "Bis ich das jemals wieder eingespart habe, sind wahrscheinlich die ersten Panels kaputt"}, {"id": 95, "start": 428.92, "end": 429.92, "text": "oder so."}, {"id": 96, "start": 429.92, "end": 434.84, "text": "Und selbst wenn es einem nur auf so plus minus null geht, selbst dann, dafür ist es eigentlich"}, {"id": 97, "start": 434.84, "end": 435.84, "text": "zu teuer."}, {"id": 98, "start": 435.84, "end": 442.88, "text": "Dementsprechend hab ich da keine Ambitionen, was das angeht."}, {"id": 99, "start": 442.88, "end": 448.96, "text": "Also noch Kontakt zum Friseur, unregelmäßig, ja."}, {"id": 100, "start": 448.96, "end": 454.6, "text": "Ich glaub vor einem Monat oder so hab ich das letzte Mal mit ihm geschrieben im Discord."}, {"id": 101, "start": 454.6, "end": 470.84, "text": "Was meinst du mit optimieren, achso, naja, ich weiß nicht, was man auf den Dingern einstellen"}, {"id": 102, "start": 470.84, "end": 471.84, "text": "kann."}, {"id": 103, "start": 471.84, "end": 476.64, "text": "Das erste, was ich mal prinzipiell ausprobieren würde, wie gut ist denn die Übertragungsrate,"}, {"id": 104, "start": 476.64, "end": 478.4, "text": "wenn man direkt neben dem Access Point steht?"}, {"id": 105, "start": 478.4, "end": 487.24, "text": "Das ist das erste, wo ich mal gucken würde, so, weil je nachdem, was in deiner, also wenn"}, {"id": 106, "start": 487.24, "end": 494.2, "text": "du nur 80 MB Down bekommst, was kann denn der Access Point?"}, {"id": 107, "start": 494.2, "end": 498.16, "text": "Was ist das für ein Access Point, also was, was, was, was, was geht denn da maximal?"}, {"id": 108, "start": 498.16, "end": 502.56, "text": "Also brauchst du natürlich auch das passende Endgerät dafür, logischerweise, ja."}, {"id": 109, "start": 502.56, "end": 506.92, "text": "Also 80 MB Down ist schon ein bisschen wenig, also ich krieg mit meinem hier irgendwie so"}, {"id": 110, "start": 506.92, "end": 514.28, "text": "100, 160, 170 MBit und das ist schon nicht wirklich eine der neuesten."}, {"id": 111, "start": 514.28, "end": 522.48, "text": "Hä, 100, verwendet man 100 überhaupt?"}, {"id": 112, "start": 522.48, "end": 527.0, "text": "WLAN-technisch darfst du mich nix fragen, WLAN-technisch hab ich wenig Ahnung."}, {"id": 113, "start": 527.0, "end": 533.4, "text": "Kein Plan, guck mir lieber zum beruhigenden Runde ASCII-Quarium jetzt an."}, {"id": 114, "start": 533.4, "end": 542.96, "text": "Aber viele Access Points haben so einen automatisch Optimierungsmodus, wo die gucken, welche Kanäle"}, {"id": 115, "start": 542.96, "end": 545.52, "text": "frei sind und dann darauf switchen."}, {"id": 116, "start": 545.52, "end": 551.72, "text": "Das könnte man vielleicht mal machen."}, {"id": 117, "start": 551.72, "end": 565.24, "text": "Habt ihr im Büro auch laufen, Beste?"}, {"id": 118, "start": 565.24, "end": 581.08, "text": "Naja, Pläne hab ich im Prinzip dahingehend, dass ich mich damit beschäftigt hab und es"}, {"id": 119, "start": 581.08, "end": 585.04, "text": "nicht aktiv plane, das zu machen, das sind meine Pläne dazu."}, {"id": 120, "start": 585.04, "end": 609.84, "text": "Ja, also ich zeige euch mal kurz, was wir heute machen, Stream, ja, korrekt, Pogo-Stream,"}, {"id": 121, "start": 609.84, "end": 615.28, "text": "oh, Sekunde, ich muss mal kurz mein Headset entknoten, ich bin gleich wieder am Start."}, {"id": 122, "start": 615.28, "end": 632.48, "text": "So, bin ich wieder."}, {"id": 123, "start": 632.48, "end": 640.96, "text": "Excellent, also, was machen wir heute?"}, {"id": 124, "start": 640.96, "end": 650.0, "text": "Weiß ich, ob Modgis schon da ist, irgendeiner der Modgis, ja doch, der Sirius Max ist da,"}, {"id": 125, "start": 650.0, "end": 654.56, "text": "der ist immer richtig, richtig high IQ, was Daily-Zusammenfassungsschreiben angeht."}, {"id": 126, "start": 654.56, "end": 659.68, "text": "Also, was wir heute machen ist, wir gucken uns folgendes an, und zwar, nein, nicht, ich"}, {"id": 127, "start": 659.68, "end": 678.36, "text": "hätte es eine Cloud, oh, oh, mein Auge, Sekunde, Sekunde, Dark Reader, ah, jetzt ist es gleich"}, {"id": 128, "start": 678.36, "end": 679.36, "text": "viel besser."}, {"id": 129, "start": 679.36, "end": 686.76, "text": "Also, wir gucken uns heute folgende Sache an, zservers.com, das habe ich gefunden über,"}, {"id": 130, "start": 686.76, "end": 692.4, "text": "ne, ja, über Hacker News damals, da habe ich einen Post gelesen vor, ist doch nicht so"}, {"id": 131, "start": 692.4, "end": 702.76, "text": "lange her, Hacker News, Set-Servers, ja hier, ist doch gar nicht so lange her, von drei"}, {"id": 132, "start": 702.76, "end": 713.68, "text": "Monaten, das war irgendwann im November, so, und da ist jemand auf eine sehr schlaue Idee"}, {"id": 133, "start": 713.68, "end": 720.6, "text": "gekommen, und zwar, der hat eine Übungsseite gebaut, nicht für irgendwelchen Hacker-Gramm"}, {"id": 134, "start": 720.6, "end": 728.96, "text": "oder irgendwelches Kryptografiezeug oder Programmier-Stells, äh, Lead-Code-Gedöns, nein, der ist auf die"}, {"id": 135, "start": 728.96, "end": 733.16, "text": "Idee gekommen, hat gesagt, hey, warum bauen wir nicht mal so eine Challenge, beziehungsweise"}, {"id": 136, "start": 733.16, "end": 737.68, "text": "Test-Übungsseite für Linux-Administration und DevOps-Themen?"}, {"id": 137, "start": 737.68, "end": 745.72, "text": "Und da hat er, oder sagen wir so, hauptsächlich Linux-Skills, und da hat er zservers.com gebaut"}, {"id": 138, "start": 745.72, "end": 752.16, "text": "und da gibt es unterschiedlich schwere Herausforderungen, die man in einer vorgegebenen Zeitspanne"}, {"id": 139, "start": 752.16, "end": 753.16, "text": "schaffen muss."}, {"id": 140, "start": 753.16, "end": 757.88, "text": "Also, guckt mal, könnt ihr euch mal angucken, also, was es zum Beispiel gibt, aktuell gibt"}, {"id": 141, "start": 757.88, "end": 764.24, "text": "es 17 verschiedene Tests, die man machen kann, zwischen easy und 10 Minuten zu schwer und"}, {"id": 142, "start": 764.24, "end": 765.24, "text": "bis zu 30 Minuten."}, {"id": 143, "start": 765.24, "end": 769.64, "text": "Ich würde sagen, wir fangen einfach von oben nach unten an, ja."}, {"id": 144, "start": 769.64, "end": 774.04, "text": "Ich muss sagen, ich mach das nicht ganz planlos, ich hab mir manche Aufgaben, Stellungen und"}, {"id": 145, "start": 774.04, "end": 780.24, "text": "Sachen schon im Vorfeld angeguckt, auf dem Smartphone, als ich mal morgens im Zug gehockt"}, {"id": 146, "start": 780.24, "end": 784.72, "text": "hab, da kann ich mich auch dran erinnern, da hab ich morgens im Zug bisschen durchgescrollt,"}, {"id": 147, "start": 784.72, "end": 789.28, "text": "wobei man das Terminal im Zug nicht gescheit bedienen konnte, und da gibt es Aufgaben,"}, {"id": 148, "start": 789.28, "end": 795.24, "text": "da gibt es dann zum Beispiel Aufgaben wie, also, level easy, du hast 10 Minuten Zeit und"}, {"id": 149, "start": 795.24, "end": 802.52, "text": "zur Info siehst du, ok, Aufgabe ist folgende, hier auf diesem Server läuft ein Programm,"}, {"id": 150, "start": 802.52, "end": 808.88, "text": "was eine Log-Datei schreibt, warlog badlog.log, und was die Festplatte vollschreibt, und"}, {"id": 151, "start": 808.88, "end": 815.72, "text": "das kann man hiermit überprüfen, und das Ziel ist es, dass das Programm quasi für"}, {"id": 152, "start": 815.72, "end": 819.56, "text": "bis zu 6 Sekunden, also der Test, den man am Ende durchführen kann, ist, dass das Programm"}, {"id": 153, "start": 819.56, "end": 823.44, "text": "6 Sekunden lang nichts in die Log-Datei reingeschrieben hat."}, {"id": 154, "start": 823.44, "end": 826.68, "text": "Das fängt relativ simpel an, ich mein, jeder, der ein bisschen was mit Linux bisher zu tun"}, {"id": 155, "start": 826.68, "end": 836.88, "text": "hatte, wird sich denken können, ja, gut, psauks, grep, oder ls, äh, nee, nicht, nicht, äh,"}, {"id": 156, "start": 836.88, "end": 842.2, "text": "effuser, ls-off, oder irgendwas auf die Datei, gucken, was es ist, den Prozess abschießen"}, {"id": 157, "start": 842.2, "end": 846.28, "text": "und dann ist es wieder gut, aber das wird dann mit der Zeit schon ein bisschen komplexer,"}, {"id": 158, "start": 846.28, "end": 849.56, "text": "ja, da gibt es dann irgendwann so ein paar Mediums, kommen dann solche Aufgaben, wie"}, {"id": 159, "start": 849.56, "end": 856.8, "text": "hier zum Beispiel, es gibt hier eine Web-Application mit einem Proxy davor, und der Proxy funktioniert"}, {"id": 160, "start": 856.8, "end": 860.48, "text": "nicht richtig, man soll rausbekommen, woran das liegt, dass die Anwendung nicht richtig"}, {"id": 161, "start": 860.48, "end": 868.68, "text": "erreichbar ist, also das geht von easy, die teilweise wirklich easy sind, von der Aufgabenbeschreibung"}, {"id": 162, "start": 868.68, "end": 873.92, "text": "her zu, doch schon relativ, relativ kompliziert, ja, zum Beispiel hier solche Geschichten"}, {"id": 163, "start": 873.92, "end": 878.36, "text": "wie, ähm, Docker-Container kann nicht zur Datenbank-Container und sowas, also das fängt"}, {"id": 164, "start": 878.36, "end": 883.64, "text": "einfach an, ist dann aber spätestens, spätestens am Medium, nix mehr, was man innerhalb von"}, {"id": 165, "start": 883.64, "end": 888.4, "text": "einer Minute mal easy bei, easy nebenbei, mal kurz, äh, einmal angeguckt, man weiß"}, {"id": 166, "start": 888.4, "end": 889.4, "text": "es sofort."}, {"id": 167, "start": 889.4, "end": 897.4, "text": "Finde ich, ist eine super Idee, weil mir ist nichts bekannt, wo man so ein bisschen"}, {"id": 168, "start": 897.4, "end": 903.36, "text": "so mit, mit vordefinierten Aufgaben, äh, vordefinierten Aufgaben und auch Tests am Ende"}, {"id": 169, "start": 903.36, "end": 908.84, "text": "wirklich ein bisschen so seine Linux-Skills testen kann, hätte es das vor ein paar Jahren"}, {"id": 170, "start": 908.84, "end": 914.28, "text": "gegeben, guck mal, das ist auch ganz neu hier unten, hätte es das vor ein paar Jahren"}, {"id": 171, "start": 914.28, "end": 917.4, "text": "gegeben, hätte ich mal unsere Azubis immer so Dinger machen lassen."}, {"id": 172, "start": 917.4, "end": 924.44, "text": "Als Linux-Noop-coole Übung zum reinkommen bestimmt, ich gehe davon aus, dass es spätestens"}, {"id": 173, "start": 924.44, "end": 931.16, "text": "ab Medium gar nicht mehr so noobig ist, also was ich hier gelesen habe, zum Beispiel, ähm,"}, {"id": 174, "start": 931.16, "end": 943.12, "text": "sowas hier, war das glaube ich, genau, äh, die Datei home-admin-sum-file wird, wird geschrieben"}, {"id": 175, "start": 943.12, "end": 953.28, "text": "von irgendeinem Prozess und man soll die Datei schließen, ohne dass man den Prozess abschießt,"}, {"id": 176, "start": 953.28, "end": 957.52, "text": "da muss man wahrscheinlich irgendein Signal an den Prozess senden oder sowas, müssen"}, {"id": 177, "start": 957.52, "end": 961.52, "text": "wir uns da mal angucken, aber das ist dann schon ein bisschen trickreicher, also sprich,"}, {"id": 178, "start": 961.52, "end": 965.68, "text": "wie kriege ich das Ding dazu, dass die Log-Datei freigegeben wird, ohne dass ich den Prozess"}, {"id": 179, "start": 965.68, "end": 970.4, "text": "abschieße, das kann ja auch durchaus ein realistisches Szenario sein, überlegt euch"}, {"id": 180, "start": 970.4, "end": 975.12, "text": "mal, ihr habt irgendeine Anwendung, irgendeine produktive Anwendung, die gigabyteweise Log"}, {"id": 181, "start": 975.12, "end": 979.4, "text": "schreibt und ihr wollt die dazu auffordern, rotier mal deine Logs oder mach mal Log, äh,"}, {"id": 182, "start": 979.4, "end": 986.76, "text": "ein neues Log, weil die Platte voll läuft, also das ist gar kein so unrealistisches Szenario,"}, {"id": 183, "start": 986.76, "end": 996.96, "text": "oder was haben wir hier, DNS, kann pinggoogle.com, das kann ja potentiell alles sein, pinggoogle.com,"}, {"id": 184, "start": 996.96, "end": 1002.0, "text": "name of service unknown, das kann ja prinzipiell alles sein, also woran auch immer das liegt,"}, {"id": 185, "start": 1002.0, "end": 1012.28, "text": "ja, Unix-Porn schon, gute Idee, das machen wir nachher. Gucken wir uns nachher eine Runde"}, {"id": 186, "start": 1012.28, "end": 1018.0, "text": "Unix-Porn an, Gatschi-Buzz, jetzt müssen wir erstmal ein paar Server glücklich machen,"}, {"id": 187, "start": 1018.0, "end": 1030.52, "text": "ja, also und so ist das ganze aufgebaut, ich finde das ist eine super Idee von dem Typ,"}, {"id": 188, "start": 1030.52, "end": 1034.12, "text": "ich hab doch auf Discord einen Aufruf aus der Community, ich war seit gestern nicht"}, {"id": 189, "start": 1034.12, "end": 1041.76, "text": "mal auf Discord drauf, ich hab noch nicht auf Discord drauf geguckt, keine Ahnung, ich"}, {"id": 190, "start": 1041.76, "end": 1046.28, "text": "lecke critical information, ich hab keine Ahnung was es da gibt, es gibt einen neuen"}, {"id": 191, "start": 1046.28, "end": 1063.2, "text": "Channel dafür, ich guck da mal kurz rein, Sekunde Leute."}, {"id": 192, "start": 1063.2, "end": 1087.88, "text": "Unix-Porn, Bilder-Only-Channels, Max macht morgen im Stream, hab ich das tatsächlich"}, {"id": 193, "start": 1087.88, "end": 1094.32, "text": "gesagt, dass ich das morgen geschwöre, fuck Alter wie viel da drinnen ist, ja, ok gucken"}, {"id": 194, "start": 1094.32, "end": 1100.16, "text": "wir uns nachher an, ja, falls ich irgendwie das wieder ignorieren sollte und verdrängen"}, {"id": 195, "start": 1100.16, "end": 1105.6, "text": "sollte erinnert mich mal dran, ich schreib's mir extra mal auf, dass ich's am Ende nicht"}, {"id": 196, "start": 1105.6, "end": 1114.68, "text": "vergesse, Unix-Porn aus Discord, alles klar so machen wir das, ja was weiß ich was ich"}, {"id": 197, "start": 1114.68, "end": 1120.56, "text": "gestern im Stream alles erzählt habe, ich meine Leute ich rede da 3-4 Stunden teilweise"}, {"id": 198, "start": 1120.56, "end": 1125.08, "text": "ohne Unterbrechung, was weiß ich, was ich da irgendwie mal in einem Nebensatz gesagt"}, {"id": 199, "start": 1125.08, "end": 1130.96, "text": "habe, was ich angeblich mache, es war jetzt auch ein Tag später nicht mehr, ne jetzt"}, {"id": 200, "start": 1130.96, "end": 1139.96, "text": "machen wir erstmal ZGServer, die sind nämlich alle sehr traurig gerade und müssen von uns"}, {"id": 201, "start": 1139.96, "end": 1150.88, "text": "gefixt werden, ja und das können wir nicht tolerieren, dass die Linux-Server traurig"}, {"id": 202, "start": 1150.88, "end": 1160.76, "text": "sind, so also übrigens gibt ein GitHub Projekt dazu, FDuran Set Servers hätte durchaus noch"}, {"id": 203, "start": 1160.76, "end": 1165.96, "text": "ein paar Sterne verdient, also Leute tut euch wenn euch dieser Service gefällt ja tut"}, {"id": 204, "start": 1165.96, "end": 1171.84, "text": "euch Konzwang an, gebt ihm ein paar Sterne auf GitHub und ich würde sagen wir probieren"}, {"id": 205, "start": 1171.84, "end": 1175.84, "text": "das einfach mal, wir gucken uns das ganze jetzt einfach mal an, also Chat wenn ihr Fragen"}, {"id": 206, "start": 1175.84, "end": 1179.48, "text": "habt, beziehungsweise wenn ihr Ideen habt, wenn ich nicht weiter kommen sollte oder so,"}, {"id": 207, "start": 1179.48, "end": 1184.88, "text": "ihr dürft auch Backseiten wie ihr wollt heute, ok was heißt wie ihr wollt, ja ihr dürft"}, {"id": 208, "start": 1184.88, "end": 1188.04, "text": "Backseiten wie ihr wollt, wenn es mir auf den Sack geht kann es aber sein, dass ich"}, {"id": 209, "start": 1188.04, "end": 1198.32, "text": "euch time oute, also da weiß ich nie so genau, manchmal regt es mich ja auf, aber so prinzipiell"}, {"id": 210, "start": 1198.32, "end": 1203.08, "text": "dürft ihr so viel Backseiten wie ihr wollt und ich glaube man hat verstanden um was es"}, {"id": 211, "start": 1203.08, "end": 1208.16, "text": "geht oder, ich mein wir können uns ja nochmal kurz angucken was der Typ selbst über den"}, {"id": 212, "start": 1208.16, "end": 1218.52, "text": "Servers schreibt, der schreibt hier Lead Code for Linux Troubleshoot and make a Set Server"}, {"id": 213, "start": 1218.52, "end": 1233.28, "text": "happy. Aktuell ist der Server äußerst Setgip und danach ist der Server WhitePepo happy."}, {"id": 214, "start": 1233.28, "end": 1248.88, "text": "Was ist Backseiten? Ich würd jetzt ja eigentlich Chat-GPT fragen, what's backseiting, aber"}, {"id": 215, "start": 1248.88, "end": 1263.16, "text": "ich fürchte meine Session ist abgelaufen, Bergseiting vor allem. Ok ich fürchte meine"}, {"id": 216, "start": 1263.16, "end": 1267.12, "text": "Session ist tatsächlich wieder abgelaufen, keine Ahnung. Backseiting ist, wenn jemand"}, {"id": 217, "start": 1267.12, "end": 1272.68, "text": "was macht im Stream und der Chat versucht ihm die ganze Zeit zu erzählen was er denn"}, {"id": 218, "start": 1272.68, "end": 1277.8, "text": "jetzt als nächstes machen soll, zum Beispiel stell dir vor irgendjemand spielt ein Spiel,"}, {"id": 219, "start": 1277.8, "end": 1282.2, "text": "kommt nicht weiter und der Chat sagt dem im Sekundentakt was er jetzt machen soll und"}, {"id": 220, "start": 1282.2, "end": 1288.04, "text": "meistens, und das ist ja das fatale beim Backseiting, meistens hat der Chat noch weniger Ahnung"}, {"id": 221, "start": 1288.04, "end": 1295.08, "text": "von der ganzen Sache als der Streamer selbst und der Chat ist einfach nur nervig am Backseiten."}, {"id": 222, "start": 1295.08, "end": 1305.48, "text": "Genau, das ist zum Beispiel, das könnte man schon als Backseiting interpretieren."}, {"id": 223, "start": 1305.48, "end": 1323.92, "text": "Ok, also wir fangen jetzt mal an. Gucken wir uns das Ganze mal an. Also Setge Servers,"}, {"id": 224, "start": 1323.92, "end": 1331.28, "text": "wir fangen oben an, wir machen die Easy Variante. Also wir fangen an mit St. John. What's writing"}, {"id": 225, "start": 1331.28, "end": 1342.28, "text": "to this log file? Run. Ja danke. Aber die coole Sache daran ist, ich hab mir ja ein bisschen"}, {"id": 226, "start": 1342.28, "end": 1347.04, "text": "hier durchgelesen bei Hacker News, was der Typ macht. Man bekommt, eine steht ja auch"}, {"id": 227, "start": 1347.04, "end": 1357.12, "text": "hier glaube ich irgendwo, man bekommt einen echten AWS, eine echte AWS Linux VM. Moin"}, {"id": 228, "start": 1357.12, "end": 1360.56, "text": "wie geil dass du Chat-GPT direkt an der Hand hast. Gibt's eine Möglichkeit das zu nutzen"}, {"id": 229, "start": 1360.56, "end": 1366.96, "text": "ohne seine Handynummer angeben zu müssen. Nee, registrieren musst du dich so. Du kannst"}, {"id": 230, "start": 1366.96, "end": 1375.38, "text": "aber wenigstens das ohne Api-Key machen. Also du kannst zum Beispiel das hier verwenden"}, {"id": 231, "start": 1375.38, "end": 1385.76, "text": "auf dem Terminal. Du kannst so Chat-GPT-Wrapper. Kannst du sowas hier zum Beispiel verwenden."}, {"id": 232, "start": 1385.76, "end": 1393.72, "text": "Das sind Kommando-Zeilen-Tools, was quasi einen Browser simuliert und so tut, bzw."}, {"id": 233, "start": 1393.72, "end": 1399.6, "text": "keinen Browser simuliert, einen Browser fernsteuert und die Antworten dann ins Terminal haut."}, {"id": 234, "start": 1399.6, "end": 1405.28, "text": "Also quasi wie wenn du einen Browser aufmachst und auch direkt auf die Webseite gehst. Aber"}, {"id": 235, "start": 1405.28, "end": 1410.44, "text": "du brauchst einen Account, das geht nicht anders. Okay Leute, also geh los. Wir haben"}, {"id": 236, "start": 1410.44, "end": 1414.08, "text": "10 Minuten Zeit, wenn ich das richtige in Erinnerung hab für die Challenge. Also, time"}, {"id": 237, "start": 1414.08, "end": 1418.44, "text": "to solve 10 minutes. Übrigens Leute, wenn man es in 10 Minuten nicht geschafft hat,"}, {"id": 238, "start": 1418.44, "end": 1421.92, "text": "dann wird einfach der Server wieder gelöscht. Also du musst es in 10 Minuten schaffen."}, {"id": 239, "start": 1421.92, "end": 1425.76, "text": "Das liegt einfach daran, der Typ der will ja auch nicht unendlich Geld für seine AVS"}, {"id": 240, "start": 1425.76, "end": 1431.92, "text": "VMS bezahlen. Deswegen ist das alles zeitlich beschränkt. Das ist nicht arschteuer zu hosten,"}, {"id": 241, "start": 1431.92, "end": 1436.4, "text": "ja deswegen ist es ja auch zeitlich beschränkt. Okay also, Instructions, Terminal aufmachen."}, {"id": 242, "start": 1436.4, "end": 1444.32, "text": "Okay, nice. Mach mal kurz ein bisschen größere Schrift, dass ihr auch was ordentlich seht."}, {"id": 243, "start": 1444.32, "end": 1450.84, "text": "Also, Beschriftung. Äh Beschriftung. Description, Beschreibung. Level easy, Description. Also"}, {"id": 244, "start": 1450.84, "end": 1458.12, "text": "ein Entwickler. Ah Leute, Leute, weißt du was wir machen? Five-Hat-Time. Guck mal. Komm"}, {"id": 245, "start": 1458.12, "end": 1466.76, "text": "für euch. Für euch machen wir das jetzt. Diepel. Ach fuck. Ich will ja von Englisch"}, {"id": 246, "start": 1466.76, "end": 1483.12, "text": "zu Englisch. Oh. Okay. Dann übersetzen wir es mit der Webseite. Ein Entwickler hat ein"}, {"id": 247, "start": 1483.12, "end": 1489.52, "text": "Testprogramm erstellt, das kontinuierlich in eine Protokolldatei warlog badlog schreibt"}, {"id": 248, "start": 1489.52, "end": 1496.36, "text": "und die Festplatte füllt. Sie können dies z.B. tail-f warlog überprüfen. Dieses Programm"}, {"id": 249, "start": 1496.36, "end": 1499.8, "text": "wird nicht mehr benötigt. Finden Sie es und beenden Sie es. Okay, das ist relativ easy."}, {"id": 250, "start": 1499.8, "end": 1506.08, "text": "Ich glaube das kriegen wir einfach hin. Wir sehen, okay auf dem Server gibt es eine Log-Datei,"}, {"id": 251, "start": 1506.08, "end": 1515.08, "text": "wo permanent reingespammt wird. Ja, der Chat schon wieder am Backseaten, aber wenn es"}, {"id": 252, "start": 1515.08, "end": 1522.6, "text": "ausarten gibt es Timeouts. Ich sag es euch. Ihr dürft Backseaten, aber ihr müsst den"}, {"id": 253, "start": 1522.6, "end": 1528.84, "text": "feinen Grad finden zwischen Backseaten und mir auf den Sack gehen. Und nachdem es ja"}, {"id": 254, "start": 1528.84, "end": 1533.84, "text": "irgendwie keine Anzeige gibt, auf welcher Seite ich gerade bin, ist Backseating quasi"}, {"id": 255, "start": 1533.84, "end": 1543.68, "text": "immer nur auf eigene Gefahr. Danke für den Sub. So, also von der Idee her relativ einfach."}, {"id": 256, "start": 1543.68, "end": 1551.44, "text": "Wir können z.B. mal gucken was läuft denn da so. Wir können hier mal gucken ob da irgendwas"}, {"id": 257, "start": 1551.44, "end": 1555.68, "text": "drin auftaucht. Also ich meine die einfachste, ich zeige euch gleich wie man es ordentlich"}, {"id": 258, "start": 1555.68, "end": 1560.16, "text": "macht oder wie ich denke, dass man es ordentlich macht. Also da sieht man hier z.B. links großartig."}, {"id": 259, "start": 1560.16, "end": 1568.56, "text": "Wir können z.B. PS AUX gucken, CREP, BAD. Ach guck mal da läuft doch schon was. BADLOG.PI."}, {"id": 260, "start": 1568.56, "end": 1578.68, "text": "Okay, das wird es wahrscheinlich sein. Allerdings, die einfachste Variante ist LS OFF. Chat ist"}, {"id": 261, "start": 1578.68, "end": 1585.8, "text": "im Weg? Ja, der Chat, der Chat ist, ähm, eigentlich ist der Chat, nee der Chat ist"}, {"id": 262, "start": 1585.8, "end": 1589.52, "text": "meistens nicht im Weg. Der Chat ist hier unten recht. Ich weiß eben war es im Weg, aber das"}, {"id": 263, "start": 1589.52, "end": 1594.24, "text": "wird wahrscheinlich so oft der Fall sein. Chat bleibt trotzdem eingeplendet. So, gehen"}, {"id": 264, "start": 1594.24, "end": 1601.72, "text": "wir mal ins Heimatverzeichnis. Select ein bisschen. So, BADLOG.PI haben wir hier. Und"}, {"id": 265, "start": 1601.72, "end": 1617.32, "text": "dann machen wir LS OFF auf, äh, Moment. LS OFF war log BADLOG und da sehen wir, es ist"}, {"id": 266, "start": 1617.32, "end": 1625.0, "text": "tatsächlich BADLOG.PI was da drauf zugreift. D.h. wir können jetzt folgendes machen, entweder"}, {"id": 267, "start": 1625.0, "end": 1633.8, "text": "sagen wir KILL 633, also hier die Prozess-ID, oder wir sagen, äh, Kivo macht hier keine"}, {"id": 268, "start": 1633.8, "end": 1638.92, "text": "Gedanken, der Chat ist wieder ein bisschen am rum, rumchibäden. Ich hab damit keine"}, {"id": 269, "start": 1638.92, "end": 1645.2, "text": "Schmerzen mit, wenn mich einer darauf hinweist, dass der Chat über dem Text ist. So, ähm,"}, {"id": 270, "start": 1645.2, "end": 1650.76, "text": "oder wir sagen KILL ALL BADLOG.PI, wenn das jetzt allerdings mehrfach laufen würde, dann"}, {"id": 271, "start": 1650.76, "end": 1657.8, "text": "würden wir alles abschießen. Was LS OFF macht, das guckt, äh, welche Filehandles offen"}, {"id": 272, "start": 1657.8, "end": 1666.48, "text": "sind. Gucken, was sie sagen. LIST OPEN FILE. Guckt, ob es Filehandles gibt auf die, auf"}, {"id": 273, "start": 1666.48, "end": 1672.16, "text": "die Datei und zeigt ihr an, was da drauf zugreift. Und jetzt haben wir es eigentlich gefixt,"}, {"id": 274, "start": 1672.16, "end": 1678.36, "text": "würde ich sagen. So, TAIL minus F und wir sehen, dass wir nichts mehr sehen, dass nichts"}, {"id": 275, "start": 1678.36, "end": 1684.0, "text": "mehr reingeschrieben wird. Okay, dann lasst uns mal checken, ob wir recht haben. Check"}, {"id": 276, "start": 1684.0, "end": 1699.12, "text": "mal Solution. KORREKT. EASY. Geh davon aus, dass nicht alles so einfach sein wird. Okay."}, {"id": 277, "start": 1699.12, "end": 1709.44, "text": "Jetzt restliche Zeit meinen. Ich glaube, man hat kein Internetzugriff. Man hat, man hat"}, {"id": 278, "start": 1709.44, "end": 1714.04, "text": "kein Internetzugriff. Funktioniert nicht. Okay, ähm, der schreibt irgendwie, dass man"}, {"id": 279, "start": 1714.04, "end": 1729.28, "text": "nicht VM ausschalten soll hier. Also, SUDO, POWER OFF. CONNECTION CLOSED. NEXT. NEXT."}, {"id": 280, "start": 1729.28, "end": 1734.88, "text": "Also, erstes war tatsächlich easy. Ich behaupte mal, wir haben nicht mal ansatzweise 10 Minuten"}, {"id": 281, "start": 1734.88, "end": 1748.72, "text": "gebraucht. Ah, ich hab, meinst du, ich hab jetzt ganz AWS runtergefahren? Ja. Ich glaube,"}, {"id": 282, "start": 1748.72, "end": 1761.44, "text": "ich ruf mal kurz bei der Amazon Hotline an. Okay, nächstes. COUNTING IPs. RUN. So, was"}, {"id": 283, "start": 1761.44, "end": 1769.6, "text": "haben wir hier? Während die VM erzeugt wird, lesen wir uns mal durch, um was es geht. SASCATON."}, {"id": 284, "start": 1769.6, "end": 1787.0, "text": "SUS. SASCATON. COUNTING IPs. Okay. DIPL. Wir übersetzen es jetzt einfach wirklich jedes"}, {"id": 285, "start": 1787.0, "end": 1796.36, "text": "Jahr. Also, folgendes. Was ist die Aufgabe? Es gibt eine Web-Server Zugriffs-Portokoll-Datei,"}, {"id": 286, "start": 1796.36, "end": 1804.16, "text": "alles klar, unter HomeAdminAccess.log. Die Datei besteht aus einer Zeile pro HTTP Anfrage,"}, {"id": 287, "start": 1804.16, "end": 1812.24, "text": "wobei die IP-Adresse des Anfragen am Anfang jeder Zeile steht. Finden Sie die IP-Adresse"}, {"id": 288, "start": 1812.24, "end": 1818.08, "text": "mit den meisten Anfragen in dieser Datei heraus. Es gibt keinen Gleichstand, die IP-Adresse"}, {"id": 289, "start": 1818.08, "end": 1824.8, "text": "ist eindeutig. Schreiben Sie die Lösung in eine Datei. HOME-HIGHEST-IP. Okay, easy. Easy."}, {"id": 290, "start": 1824.8, "end": 1834.2, "text": "Easy. Machen wir das doch mal. Probieren wir uns mal hier das Lösungsding. Ah, okay, man"}, {"id": 291, "start": 1834.2, "end": 1840.6, "text": "kann auch einen Hash-Wert machen und gucken, ob das alles stimmt. Alles klar, gucken wir"}, {"id": 292, "start": 1840.6, "end": 1845.32, "text": "mal. Schauen wir uns das Ganze mal an. Leute, ich schiebe das einfach auf die linke Seite"}, {"id": 293, "start": 1845.32, "end": 1848.36, "text": "des Terminals, weil da kann der Chat nicht drüber sein. Ob der Chat hier drüber ist,"}, {"id": 294, "start": 1848.36, "end": 1856.8, "text": "ist ja nicht schlimm. Alles klar. Okay, also, gehen wir mal HomeAdmin, wobei da sind wir"}, {"id": 295, "start": 1856.8, "end": 1872.52, "text": "wahrscheinlich schon. HomeAdmin und da gibt es eine Access-Log. Okay, die Datei ist leer."}, {"id": 296, "start": 1872.52, "end": 1881.52, "text": "Heißt IP.txt. Es gibt eine Access-Log, tatsächlich. Access-Log. Okay, gucken wir noch mal kurz"}, {"id": 297, "start": 1881.52, "end": 1895.36, "text": "rein. Oh, die ist ein bisschen größer. Okay, das erste in jeder Zeile ist die IP. Wir"}, {"id": 298, "start": 1895.36, "end": 1905.76, "text": "sollen jetzt quasi, was sollen wir... Da wollte ich jetzt nicht hin. Was sollen wir"}, {"id": 299, "start": 1905.76, "end": 1914.92, "text": "machen? Wir sollen zählen, welche IP, das die meisten Requests gemacht hat. Okay, also,"}, {"id": 300, "start": 1914.92, "end": 1919.16, "text": "ich würde sagen, jetzt weiß ich, jetzt kommt bestimmt der erste, useless use of cat oder"}, {"id": 301, "start": 1919.16, "end": 1924.72, "text": "irgendwie sowas. Also, ganz am Anfang jeder Zeile steht die IP. Oh, ich hätte das nicht"}, {"id": 302, "start": 1924.72, "end": 1931.04, "text": "catten sollen, das Ding. Also, sagen wir mal, cat an einem Leerzeichen, an einem Leerzeichen"}, {"id": 303, "start": 1931.04, "end": 1942.56, "text": "field one. So, haben wir alle IPs. Sortieren wir die IPs. So. Uniken die IPs. Nee, nicht"}, {"id": 304, "start": 1942.56, "end": 1948.48, "text": "Unik. Unik count, geht das irgendwie? Ich glaube schon. Ich glaube, Unik kann zählen."}, {"id": 305, "start": 1948.48, "end": 1961.68, "text": "Unik count. Okay, also Unik count. Okay. Jetzt haben wir pro Zeile, wie oft die Sache"}, {"id": 306, "start": 1961.68, "end": 1970.84, "text": "aufgetaucht ist. Das heißt, jetzt können wir das Ganze nochmal sortieren. Numeric. Und"}, {"id": 307, "start": 1970.84, "end": 1980.36, "text": "dann haben wir diese IP. Diese IP hat 482 Anfragen. Können wir auch überprüfen, wenn"}, {"id": 308, "start": 1980.36, "end": 1995.16, "text": "wir einfach sagen Echo und dann was? Char. Eins. Summ. 6ef42. Okay, check my solution."}, {"id": 309, "start": 1995.16, "end": 2003.32, "text": "Ach, Moment. Ich noob. Ich muss es ja erst noch in die Datei reinschreiben. Jesper, danke"}, {"id": 310, "start": 2003.32, "end": 2012.84, "text": "für den Zapp. Check my solution ist korrekt. Wir gucken uns jetzt mal an, wie die offizielle"}, {"id": 311, "start": 2012.84, "end": 2020.44, "text": "Lösung dazu ist. Also, was der sagt, wie man das machen soll. To get the first field IP"}, {"id": 312, "start": 2020.44, "end": 2026.8, "text": "of. Okay, da macht's mit AWK. Cut, genau. Okay, aber andere Delimiter, aber es ist im"}, {"id": 313, "start": 2026.8, "end": 2030.8, "text": "Prinzip das gleiche. Klar, mit AWK ist die schönere Variante, weil dann ist es egal,"}, {"id": 314, "start": 2030.8, "end": 2038.16, "text": "ob es Leerzeichen oder Tabs oder sonst was sind. And pick the first field. Okay, cat"}, {"id": 315, "start": 2038.16, "end": 2043.8, "text": "accessible. Ja, das braucht man gar nicht. Ach nee, ach field 1. Okay, ja, das habe"}, {"id": 316, "start": 2043.8, "end": 2049.4, "text": "ich ja auch so gemacht. You may want to append a pipe, head or tail as you constrain. Und"}, {"id": 317, "start": 2049.4, "end": 2054.48, "text": "weiter. Das ist ja noch nicht die Lösung. After the previous step. Sort. Ja, haben wir"}, {"id": 318, "start": 2054.48, "end": 2063.8, "text": "auch gemacht. Unique minus C haben wir auch gemacht. Ah, der macht es anders. Ah, okay,"}, {"id": 319, "start": 2063.8, "end": 2073.44, "text": "wie macht der das? Ich habe Sort numeric gemacht und er hat Sort minus A. Okay, das wird wahrscheinlich"}, {"id": 320, "start": 2073.44, "end": 2081.88, "text": "auch funktionieren. Das ist der Leute viele, viele Wege führen zum Ziel. Aber wir haben"}, {"id": 321, "start": 2081.88, "end": 2086.56, "text": "es richtige rausgekriegt. Easy. Sudo Power off. Also ich gehe davon aus, dass die Dinger"}, {"id": 322, "start": 2086.56, "end": 2097.04, "text": "noch ein bisschen schwerer werden. Das soll easy sein. Ja, das ist doch auch easy. Also"}, {"id": 323, "start": 2097.04, "end": 2101.48, "text": "jeder, der schon ein bisschen Linux Erfahrung. Also ich rede jetzt nicht Linux Desktop Erfahrung"}, {"id": 324, "start": 2101.48, "end": 2105.36, "text": "reine Anwendersache, aber jeder, der ein bisschen Linux Administration Erfahrung hatte, sollte"}, {"id": 325, "start": 2105.36, "end": 2111.64, "text": "sowas eigentlich easy hinkriegen. Chat, findet ihr das nicht? Okay, okay, wir machen eine"}, {"id": 326, "start": 2111.64, "end": 2119.52, "text": "Umfrage. Max, falls du noch da bist, könntest du eine Umfrage machen? War das easy? Ja,"}, {"id": 327, "start": 2119.52, "end": 2130.36, "text": "nein. Und ohne und ohne mit Kekseworten und sowas. Warum kommt nach dem S was? Was kommt"}, {"id": 328, "start": 2130.36, "end": 2150.48, "text": "nach dem S? Okay, also war es Eats oder nicht Eats? Cut ein Sort, ja, kann ich dir gleich"}, {"id": 329, "start": 2150.48, "end": 2156.8, "text": "erklären. Vielleicht lasse ich ja vom Teil nur ein Highlight schneiden für YouTube von"}, {"id": 330, "start": 2156.8, "end": 2161.6, "text": "diesem Stream. Da könnt ihr jetzt einmal alle Hallo YouTube spammen, wobei ich glaube YouTube"}, {"id": 331, "start": 2161.6, "end": 2167.12, "text": "interessiert das nicht null, nicht die Bohne, ob ich die irgendwie Linux-Admin-Challenges"}, {"id": 332, "start": 2167.12, "end": 2179.36, "text": "hier mache. Okay, also wir sind uns nicht ganz einig, ob es Eats oder nicht Eats ist,"}, {"id": 333, "start": 2179.36, "end": 2187.48, "text": "aber der überwiegende Teil meint Eats, allerdings ist es sehr knapp Eats. Und jetzt höre ich"}, {"id": 334, "start": 2187.48, "end": 2195.84, "text": "auf, weil ich weiß genau, alle Leute, die jetzt noch nicht abgestimmt haben und noch"}, {"id": 335, "start": 2195.84, "end": 2201.12, "text": "abstimmen können, die stimmen jetzt so ab, dass es 50-50 wird am Ende. Das ist immer"}, {"id": 336, "start": 2201.12, "end": 2206.04, "text": "so. Das heißt, man darf eigentlich, sobald man im Stream das Ergebnis zeigt, muss die"}, {"id": 337, "start": 2206.04, "end": 2211.48, "text": "absch Abstimmung fertig sein oder du musst das ignorieren, weil genau sonst passiert"}, {"id": 338, "start": 2211.48, "end": 2218.92, "text": "nämlich exakt das. Also 50-50. Mit Google hättet ihr es auf jeden Fall alle hinbekommen."}, {"id": 339, "start": 2218.92, "end": 2225.96, "text": "Warum? Die Frage war, warum nach dem Cut ein Sort muss, weil Unix sonst nicht funktioniert."}, {"id": 340, "start": 2225.96, "end": 2234.92, "text": "Unix erwartet, dass der Input sortiert ist. Also du musst zuerst, also guck mal, wenn"}, {"id": 341, "start": 2234.92, "end": 2240.76, "text": "du das hier machst, also der erste Teil ist, du holst dir die IP-Adressen raus. Der nächste"}, {"id": 342, "start": 2240.76, "end": 2253.4, "text": "Teil ist, du sortierst die IP-Adressen. Der nächste Teil ist, du guckst mit Unix, wie"}, {"id": 343, "start": 2253.4, "end": 2259.04, "text": "oft welche IP-Adresse vorkommt und dann, das ist ein bisschen abweichend von der offiziellen"}, {"id": 344, "start": 2259.04, "end": 2268.36, "text": "Lösung, dann sortiere ich das Ganze nochmal numerisch, weil nach dem hier steht ja vorne"}, {"id": 345, "start": 2268.36, "end": 2275.08, "text": "ganz am Anfang eine Zahl und mit Sort minus N sortiert er quasi anhand von numerisch das"}, {"id": 346, "start": 2275.08, "end": 2281.2, "text": "Ganze und dementsprechend steht 482 unten und die letzte Zeile ist, also meine Lösung"}, {"id": 347, "start": 2281.2, "end": 2284.24, "text": "ist ein bisschen anders als die offizielle Lösung, aber funktioniert ja auch genauso."}, {"id": 348, "start": 2284.24, "end": 2295.88, "text": "Ja, Google ist ja auch erlaubt. Google ist ja, ist ja hier denke ich auch erlaubt. Okay,"}, {"id": 349, "start": 2295.88, "end": 2306.08, "text": "Power off. Easy, next. More Scenarios. Also wenn ihr was wissen wollt, Leute, gerade"}, {"id": 350, "start": 2306.08, "end": 2311.64, "text": "wenn wir durch sind, könntest du auch Sort minus U machen, wahrscheinlich. In der offiziellen"}, {"id": 351, "start": 2311.64, "end": 2317.2, "text": "Lösung ist es ein Revertsort und sowas. Gibt sich, wahrscheinlich könntest du auch noch"}, {"id": 352, "start": 2317.2, "end": 2323.32, "text": "ganz trickreichere Sachen machen. Der Python Crack hätte wahrscheinlich in Python Interpreter"}, {"id": 353, "start": 2323.32, "end": 2337.4, "text": "gepiped und das darin irgendwie sortiert oder was auch immer. Nutzt du deine Linux-Maschine"}, {"id": 354, "start": 2337.4, "end": 2344.24, "text": "als VM und was für ein Linux-Distro benutzt du? Das ist eine VM, korrekt? Guckt da. Ich"}, {"id": 355, "start": 2344.24, "end": 2352.92, "text": "benutze selbstverständlich Archlinux, by the way. Das ist aber gut, dass du es ansprichst,"}, {"id": 356, "start": 2352.92, "end": 2357.32, "text": "weil ich denke, ich hätte euch das heute schon nochmal erzählen müssen, dass ich Archlinux"}, {"id": 357, "start": 2357.32, "end": 2366.28, "text": "verwende. Also hier nochmal ganz offiziell Leute, ich verwende Archlinux. Ich hoffe,"}, {"id": 358, "start": 2366.28, "end": 2381.8, "text": "ihr habt es mitbekommen. Archlinux. Nicht elitär genug für Gento. Auf Gento hab ich"}, {"id": 359, "start": 2381.8, "end": 2400.2, "text": "keinen Bock. Manjaro, doch Manjaro war es vorher. Opensuse, äh, Igitt. Oder Gentoo,"}, {"id": 360, "start": 2400.2, "end": 2410.0, "text": "wie es manche sagen, ja. Womit sollte man bei Windows 11 virtualisieren, um halbwegs"}, {"id": 361, "start": 2410.0, "end": 2416.04, "text": "performant zu sein? Vor allem bei Workstation finde ich es die beste Desktop-Virtualisierung,"}, {"id": 362, "start": 2416.04, "end": 2422.4, "text": "die es gibt. Auch mit Snapshots und allem dabei und bisschen 3D-Beschleunigung und"}, {"id": 363, "start": 2422.4, "end": 2433.92, "text": "Acceleration und du kannst sogar nestet-Virtualisierung machen und sowas. Ja, also gerade wenn wir"}, {"id": 364, "start": 2433.92, "end": 2437.12, "text": "mit so einer Übung durch sind und ihr was wissen wollt, Leute, könnt ihr das ohne"}, {"id": 365, "start": 2437.12, "end": 2441.6, "text": "Probleme dann, ihr könnt es vorher schon in den Chat schreiben, aber wenn wir mit der"}, {"id": 366, "start": 2441.6, "end": 2446.44, "text": "Übung durch sind, kann ich ja noch ein bisschen was erklären, wenn es noch was offene Fragen"}, {"id": 367, "start": 2446.44, "end": 2459.48, "text": "gibt, wobei ich denke, das war jetzt relativ einfach. Ok, weiter. Find Secret Combination,"}, {"id": 368, "start": 2459.48, "end": 2467.92, "text": "doch easy, aber jetzt haben wir 15 Minuten Zeit. Deine Meinung zu Postgres, beste Datenbank,"}, {"id": 369, "start": 2467.92, "end": 2474.0, "text": "gerade beste Open Source-Datenbank. Das Gute an Postgres ist, dass Postgres alles kann,"}, {"id": 370, "start": 2474.0, "end": 2479.76, "text": "du kannst Time-Series-Daten, du kannst Time-Series-Sachen drinnen speichern, mit Time-Scale-DB, oma,"}, {"id": 371, "start": 2479.76, "end": 2483.8, "text": "was, Time-Scale, ja doch, ich glaube, Time-Scale-DB, vielleicht nicht so gut wie ein Influx oder"}, {"id": 372, "start": 2483.8, "end": 2488.68, "text": "sonst was, aber performant genug. Du kannst eine Volltext-Suche, du hast eine Trigram-Suche"}, {"id": 373, "start": 2488.68, "end": 2496.44, "text": "für Wildcards und Autocomplete und sowas. Postgres ist das Beste, was es gibt. SQLite"}, {"id": 374, "start": 2496.44, "end": 2504.04, "text": "ist auch das Beste, was es gibt in seinem Bereich. SQLite, also wenn ich die Auswahl"}, {"id": 375, "start": 2504.04, "end": 2509.64, "text": "hätte zwischen, was ist die beste, universellste, einsetzbare Datenbank, dann SQLite, weil ich"}, {"id": 376, "start": 2509.64, "end": 2514.16, "text": "glaube, SQLite dürfte auch die weltweit verbreitetste Datenbank sein, gerade weil so gut wie jede"}, {"id": 377, "start": 2514.16, "end": 2520.8, "text": "Android-App mit einer internen SQLite-Datenbank daherkommt, aber das war jetzt ja nicht die"}, {"id": 378, "start": 2520.8, "end": 2529.0, "text": "Frage. Also es ging ja um keine so embedded Datenbank-Kram wie SQLite, sondern es ging"}, {"id": 379, "start": 2529.0, "end": 2533.0, "text": "ja um einen richtigen Datenbank-Server und da finde ich Postgres das Beste, auch wenn"}, {"id": 380, "start": 2533.0, "end": 2540.96, "text": "ich nicht der Super-Datenbank-Checker bin. Ich habe schon gelesen, es gibt manchmal Datenbank,"}, {"id": 381, "start": 2540.96, "end": 2551.88, "text": "also manche dieser Aufgaben sind so Datenbank-Aufgaben, da bin ich mal gespannt. Auf geht's, nächste"}, {"id": 382, "start": 2551.88, "end": 2564.84, "text": "Übung. Okay, easy, Santiago. Find a secret combination, okay, Alice hat zwei geheime"}, {"id": 383, "start": 2564.84, "end": 2574.68, "text": "Nummern versteckt auf dem System. So, wir sollen die Anzahl der Zeilen rausbekommen,"}, {"id": 384, "start": 2574.68, "end": 2585.56, "text": "wie oft der String Alice vorkommt in allen txt-Files im home-admin-directory. Okay, also"}, {"id": 385, "start": 2585.56, "end": 2606.96, "text": "wir sinds. Okay, Deep L, ihr habt Recht. Massive. Massive, Diepel. Deep L. So, also. Alice die"}, {"id": 386, "start": 2606.96, "end": 2614.68, "text": "Spionin hat eine geheime Zahlenkombination versteckt. Finden Sie mit diesen Anweisungen,"}, {"id": 387, "start": 2614.68, "end": 2618.96, "text": "finde die Anzahl der Zeilen, in denen die Zeichenkette Alice in allen txt-Dateilen im"}, {"id": 388, "start": 2618.96, "end": 2625.6, "text": "verzeichnungs-home-admin vorkommt. Es gibt eine Datei, in der Alice genau einmal vorkommt,"}, {"id": 389, "start": 2625.6, "end": 2630.92, "text": "in der Zeile nach diesem Vorkommen steht eine Zahl. Schreiben Sie beide Zahlen nacheinander"}, {"id": 390, "start": 2630.92, "end": 2640.0, "text": "als eine, keine neue Zeile oder Leerzeichen in die Lösungsdatei. Okay, da hat Diepel"}, {"id": 391, "start": 2640.0, "end": 2644.84, "text": "jetzt ein bisschen verkackt. Zum Beispiel, wenn die ersten Zahlen, okay. Ich soll im"}, {"id": 392, "start": 2644.84, "end": 2650.08, "text": "Prinzip beide Zeilen ohne Leerzeichen. Das ist okay. Kann man so machen. Könnt ihr auch"}, {"id": 393, "start": 2650.08, "end": 2662.12, "text": "einfach hintereinander echoen. Okay, dann probieren wir das doch mal. Also, wir sollen"}, {"id": 394, "start": 2662.12, "end": 2674.52, "text": "rausfinden, wie oft kommt Alice vor. Na, das ist relativ easy. Crab minus C. Alice. Wohlgemer"}, {"id": 395, "start": 2674.52, "end": 2680.04, "text": "Groß- und Kleinschreibung ist an der Stelle wichtig, also machen wir nicht minus I. Und"}, {"id": 396, "start": 2680.04, "end": 2690.68, "text": "dann Sternchen Punkt txt. Und wir sehen. Okay. Mit AWK könntest du es bestimmt auch irgendwie"}, {"id": 397, "start": 2690.68, "end": 2699.48, "text": "machen, aber in dem Fall ist Crab einfacher, zumal es um Zeilen geht. Okay, also hier kommt"}, {"id": 398, "start": 2699.48, "end": 2712.32, "text": "Alice einmal vor in 1, 3, 2, 1, 3, 4, 2, 0 Punkt txt. Und in den anderen kommt es 12"}, {"id": 399, "start": 2712.32, "end": 2721.44, "text": "und 0 mal vor. Okay, das heißt, wir rechnen das mal kurz zusammen. Echo 3, 9, 8 plus 1"}, {"id": 400, "start": 2721.44, "end": 2733.48, "text": "plus 12 nach BC. Cringe. BC nicht installiert. Darf man Sachen nachinstallieren? Wahrscheinlich"}, {"id": 401, "start": 2733.48, "end": 2744.68, "text": "nicht. Ich glaube nicht, dass das funktioniert. Nachinstalliert werden darf nicht. Na gut."}, {"id": 402, "start": 2744.68, "end": 2748.68, "text": "Dann, ich wollte gerade sagen, dann machen wir es mit Bash Build ins Deskump funktioniert"}, {"id": 403, "start": 2748.68, "end": 2761.5, "text": "auch. So. 411. Okay, 411 ist schon mal unsere erste Zahl. Und die zweite Zahl finden wir"}, {"id": 404, "start": 2761.5, "end": 2772.8, "text": "in der Datei, wo Alice nur einmal vorkommt. Könnte man eventuell mit WC rechnen? Ja,"}, {"id": 405, "start": 2772.8, "end": 2781.24, "text": "du könntest es auch mit WC machen. Das zeige ich gleich. So, machen wir das mal auf, suchen"}, {"id": 406, "start": 2781.24, "end": 2789.48, "text": "da drin nach Alice. Kommt ja nur einmal drin vor und dann brauchen wir in the line after,"}, {"id": 407, "start": 2789.48, "end": 2798.36, "text": "dann nach Alice. Okay, also brauchen wir 156. Also haben wir 411, 156 und das soll exakt"}, {"id": 408, "start": 2798.36, "end": 2804.24, "text": "so in die Datei rein. Ich zeige gleich, wie man es mit WC eventuell machen könnte. Bin"}, {"id": 409, "start": 2804.24, "end": 2809.24, "text": "mir gerade nicht ganz sicher, ob es funktioniert. Da müsste gehen. Und das muss jetzt in die"}, {"id": 410, "start": 2809.24, "end": 2828.36, "text": "Datei. Solution. X ist Solution. MD5 Sum. Solution. Ja, D80E02D sieht gut aus. Check"}, {"id": 411, "start": 2828.36, "end": 2834.28, "text": "my Solution. Passt, ist korrekt. Also was man auch machen könnte wahrscheinlich ist,"}, {"id": 412, "start": 2834.28, "end": 2842.96, "text": "anstatt CREP minus C könnte man wahrscheinlich auch WC minus L machen. Dann hat man auch"}, {"id": 413, "start": 2842.96, "end": 2850.64, "text": "411. Das ist eine gute Idee. Das ist eine gute Idee. Zählt WC auch richtig, wenn Alice"}, {"id": 414, "start": 2850.64, "end": 2857.4, "text": "zweimal pro Zeile vorkommt? Ja, weil CREP das nur einmal ausspucken würde. Das ist"}, {"id": 415, "start": 2857.4, "end": 2862.36, "text": "eine gute Idee, Chat, das so zu machen. Was der Unterschied ist, der Unterschied ist,"}, {"id": 416, "start": 2862.36, "end": 2873.36, "text": "hier wird es angehängt und hier wird es überschrieben. Guck mal, jetzt steht es zweimal drinnen"}, {"id": 417, "start": 2873.36, "end": 2879.64, "text": "und mehrfach und jetzt, wobei das bei ZSH nicht unbedingt so standardlich funktioniert,"}, {"id": 418, "start": 2879.64, "end": 2884.92, "text": "überschreibt das. Also das ist reinschreiben in die Datei, aber quasi von vorne anfangen"}, {"id": 419, "start": 2884.92, "end": 2889.76, "text": "und den Rest überschreiben oder erstmal Datei quasi leeren und dann überschreiben und das"}, {"id": 420, "start": 2889.76, "end": 2898.68, "text": "andere ist Anhängen. Also zwei sind Anhängen, eins ist reinschreiben. Also wenn du ein Log"}, {"id": 421, "start": 2898.68, "end": 2905.84, "text": "File hast, was permanent gefüllt werden soll, dann ist das. Wenn du einen Log hast pro Skript"}, {"id": 422, "start": 2905.84, "end": 2920.64, "text": "dran, zum Beispiel, dann würdest du es mit einem machen. Was macht minus L? Zählen,"}, {"id": 423, "start": 2920.64, "end": 2929.2, "text": "Beligns, Zeilen zählen. Wenn du nämlich normales WC machst, dann zeigt es dir auch"}, {"id": 424, "start": 2929.2, "end": 2936.48, "text": "Zeilen an. Es zeigt dir Zeilen, Charakter und keine Ahnung, was sonst noch an. Wörter,"}, {"id": 425, "start": 2936.48, "end": 2944.0, "text": "Charakter, Zeilen, irgendwie sowas. WC minus L ist nur Zeilen, nur Zeilen rechnen. WC minus"}, {"id": 426, "start": 2944.0, "end": 2953.12, "text": "L ist auch das am häufigsten Benutzte in der Kombination. Ok, sudo power off easy. Bevor"}, {"id": 427, "start": 2953.12, "end": 2962.28, "text": "ich ausmache, noch irgendwelche Questions zu der Aufgabe. Ich vermute mal, jetzt wird"}, {"id": 428, "start": 2962.28, "end": 2965.8, "text": "es ein bisschen schwerer. Ach ja, wir gucken uns doch mal die offizielle Lösung an, was"}, {"id": 429, "start": 2965.8, "end": 2972.48, "text": "sie dazu wie sie schreiben, wie man das machen soll. Use find. Ok, das haben wir schon mal"}, {"id": 430, "start": 2972.48, "end": 2988.72, "text": "nicht gemacht. Use find and pass the results to grab via xarx. Kann man auch machen. Solution,"}, {"id": 431, "start": 2988.72, "end": 3006.72, "text": "zum Beispiel find, home, admin, xarx, grab minus zählen. Könnte man auch so machen."}, {"id": 432, "start": 3006.72, "end": 3021.28, "text": "Ja, also was xarx macht, ist folgendes. xarx nimmt die Zeilen vom Input und macht daraus"}, {"id": 433, "start": 3021.28, "end": 3027.2, "text": "quasi eine Argumentliste, die sie an grab anhängt. Was im Endeffekt bedeutet, es ruft"}, {"id": 434, "start": 3027.2, "end": 3032.12, "text": "in grab auf und dahinter schreibt es die Dateien, so das grab in den Dateien. Aber wie gesagt,"}, {"id": 435, "start": 3032.12, "end": 3055.48, "text": "man kann auch Sternchen.txt machen. Ok, fertig. Was ist zserver? Zserver ist troubleshoot"}, {"id": 436, "start": 3055.48, "end": 3062.12, "text": "and makes zservers happy. Lead code for linux. Capture the flag challenges. Train and prove"}, {"id": 437, "start": 3062.12, "end": 3069.48, "text": "your debugging skills. Practice for your next sre devops interview. Also im Endeffekt bekommst"}, {"id": 438, "start": 3069.48, "end": 3076.6, "text": "du den linux server bei aws, auf dem du verschiedene Aufgaben lösen musst. Das war doch nicht die"}, {"id": 439, "start": 3076.6, "end": 3095.36, "text": "ganze solution. Doch. Also das was ich gemacht hab. Signs auch oder? Signs funktioniert"}, {"id": 440, "start": 3095.36, "end": 3101.68, "text": "auch hier. Wobei ich meins angenehmer fand. Das ist ohne Registrierung ja, aber das hat"}, {"id": 441, "start": 3101.68, "end": 3109.36, "text": "ein Limit. Also du kannst jetzt nicht irgendwie das ganze 40 mal am Tag machen oder so. Ach"}, {"id": 442, "start": 3109.36, "end": 3113.58, "text": "so, der zweite Teil hat noch gefehlt. Ja, jetzt steht stimmt, wenn man mir nochmal drauf"}, {"id": 443, "start": 3113.58, "end": 3127.24, "text": "klicken müssen. Alles klar. Nice haben wir sudo sudo power off. Bäm. Next. More Scenarios."}, {"id": 444, "start": 3127.24, "end": 3134.2, "text": "Also Leute, easy ist jetzt fertig. Jetzt wirds anstrengend. Jetzt kommen die medium medium"}, {"id": 445, "start": 3134.2, "end": 3145.84, "text": "schweren Dinger. Manhattan can't write into database. Da wollen wir mal gucken was man"}, {"id": 446, "start": 3145.84, "end": 3152.88, "text": "hätten für Probleme hat. Manhattan hat wahrscheinlich zu viel dritter deutschland in den letzten"}, {"id": 447, "start": 3152.88, "end": 3161.76, "text": "Tagen gelesen und hat keinen Bock mehr. Hat sich gedacht, ne ich hör auf, ich stell den"}, {"id": 448, "start": 3161.76, "end": 3177.68, "text": "Dienst ein. Richtig gut, da ist es schön, dass du deinen Weg hergefunden hat und dass"}, {"id": 449, "start": 3177.68, "end": 3182.6, "text": "dirs gefällt. So, also wir können uns das ganze ja mal durchlesen bis die vm gestartet"}, {"id": 450, "start": 3182.6, "end": 3198.4, "text": "ist. Ok, description. Moment, Diepel. Diepel. Diepel. Also Beschreibung. Ihr Ziel ist es,"}, {"id": 451, "start": 3198.4, "end": 3205.84, "text": "eine Zeile in eine bestehende Postgres Datenbank einzufügen. Das Problem ist nicht spezifisch"}, {"id": 452, "start": 3205.84, "end": 3210.48, "text": "für Postgres und sie brauchen keine Details darüber zu wissen, obwohl es hilfreich sein"}, {"id": 453, "start": 3210.48, "end": 3217.4, "text": "könnte. Aha. Ja, ich hab die neuen Api Pricings gesehen, total lächerlich. Zur hilfreichen"}, {"id": 454, "start": 3217.4, "end": 3223.2, "text": "Information zu Postgres. Es handelt sich um einen Dienst, der an einem Port 5432, das"}, {"id": 455, "start": 3223.2, "end": 3228.28, "text": "ist der Standard Postgres Port, lauscht und auf die Festplatte in ein Datenverzeichnis"}, {"id": 456, "start": 3228.28, "end": 3235.32, "text": "schreibt, dessen Speicherort im Parameter Data Directory der Konfigurationsdatei etc"}, {"id": 457, "start": 3235.32, "end": 3242.6, "text": "die Postgres14MainPostgres.conf. In unserem Fall wird Postgres von Systemd als eine Unit"}, {"id": 458, "start": 3242.6, "end": 3249.96, "text": "mit dem Namen PostgresQL verwaltet. Vom Standard Admin Benutzer. Ok, der Test. Das ist der"}, {"id": 459, "start": 3249.96, "end": 3255.12, "text": "Test, da können wir testen, ob es funktioniert. Alles klar. Den Test copypasten wir uns mal"}, {"id": 460, "start": 3255.12, "end": 3267.96, "text": "und schauen wir mal, ob der Server bereit ist. Jop. Ok, führen wir das mal aus und stellen"}, {"id": 461, "start": 3267.96, "end": 3275.48, "text": "fest, nope geht nicht. Warum geht es nicht? Weil, no such file or directory is the server"}, {"id": 462, "start": 3275.48, "end": 3282.84, "text": "running. Ok, wahrscheinlich läuft Postgres einfach nicht. Ostge. Wobei es heißt glaube"}, {"id": 463, "start": 3282.84, "end": 3292.44, "text": "ich, PG irgendwas. Gibt es nicht. Ok, System CTL, Status, Postgres, nee PostgresQL, das"}, {"id": 464, "start": 3292.44, "end": 3298.44, "text": "ist glaube ich. Ok, das ist, ok, jetzt wird es langsam interessant. Ich hätte jetzt gedacht,"}, {"id": 465, "start": 3298.44, "end": 3303.64, "text": "easy, wir gucken einfach und das Service läuft nicht und wir starten den Service. So einfach"}, {"id": 466, "start": 3303.64, "end": 3309.0, "text": "ist es anscheinend schon mal nicht. Also Postgres selber läuft wohl, aber trotzdem"}, {"id": 467, "start": 3309.0, "end": 3313.72, "text": "funktioniert der Zugriff auf Postgres nicht. Das heißt wir machen jetzt mal NetStats und"}, {"id": 468, "start": 3313.72, "end": 3322.16, "text": "gucken ob an Port 5, 5 4 3 2 überhaupt was lauscht und wir stellen fest, Postgres ist"}, {"id": 469, "start": 3322.16, "end": 3332.6, "text": "der Meinung, dass es läuft. Ja, das ist komisch. Ok, das ist natürlich merkwürdig. Postgres"}, {"id": 470, "start": 3332.6, "end": 3340.2, "text": "ist der Meinung, dass es läuft, aber Postgres läuft anscheinend gar nicht."}, {"id": 471, "start": 3340.2, "end": 3351.24, "text": "Da ist ChainLore, ja. Werde ich meinem Cutter ausrichten, wir werden in Zukunft easy selbstverständlich"}, {"id": 472, "start": 3351.24, "end": 3358.88, "text": "noch als easy emote einplanen und Begründung ist, weil es der ChainLore gesagt hat. Aber"}, {"id": 473, "start": 3358.88, "end": 3364.04, "text": "ist wahrscheinlich, wäre wahrscheinlich doch besser gewesen. Ok, lass mal kurz, lass mal"}, {"id": 474, "start": 3364.04, "end": 3372.72, "text": "kurz so prinzipiell ein paar Sachen, ein paar Sachen checken. War, log, Postgres, Postgres"}, {"id": 475, "start": 3372.72, "end": 3389.96, "text": "MainLog, wieder ist nichts drin. Das schon mal, sus, could not create log file, no space,"}, {"id": 476, "start": 3389.96, "end": 3407.04, "text": "ok, Moment, df-h, die Festplatte ist voll. Ok, das ist ein guter Test. Das ist gar nicht"}, {"id": 477, "start": 3407.04, "end": 3413.64, "text": "so weit von der Realität weg, Leute. Das kommt tatsächlich vor in der Praxis. Ok, die Festplatte"}, {"id": 478, "start": 3413.64, "end": 3426.56, "text": "ist voll. Also, gehen wir mal nach. Opt, pg-data, gucken wir mal, was es da so gibt. Guck mal,"}, {"id": 479, "start": 3426.56, "end": 3433.96, "text": "es gibt sogar einen File, was ich delete me nennt. rm, delete me, Moment, in dem File steht"}, {"id": 480, "start": 3433.96, "end": 3440.52, "text": "überhaupt nichts drinne. Der muss aber auch nur einen pit-file anlegen, vielleicht reicht"}, {"id": 481, "start": 3440.52, "end": 3462.56, "text": "das ja, delete me. Ok, System, ctl, restart, Postgresql, net-stat, ups, what the fuck, net-stat,"}, {"id": 482, "start": 3462.56, "end": 3475.2, "text": "minus, nein, die läuft immer noch nicht. Wir löschen, komm, wir löschen die anderen,"}, {"id": 483, "start": 3475.2, "end": 3483.44, "text": "ich mein, das sind Backup-Files oder irgendwie, irgendwie, Postgres-Dumps oder sowas. Das"}, {"id": 484, "start": 3483.44, "end": 3487.88, "text": "hier wird, das hier ist ja die eigentliche Datenbank. Wir löschen, wir löschen den"}, {"id": 485, "start": 3487.88, "end": 3502.32, "text": "ganzen Kampel hier einfach mal. rm, File, m, restart, Postgresql. Hast du das neue Harry"}, {"id": 486, "start": 3502.32, "end": 3508.36, "text": "Potter Spiel? Nee, hab ich nicht. Ich war aber nach diesem ganzen Circle-Jerk auf Twitter"}, {"id": 487, "start": 3508.36, "end": 3511.92, "text": "mal ganz kurz haben überlegen, ob ich es mir nicht kaufen soll. Einfach, um ein paar"}, {"id": 488, "start": 3511.92, "end": 3515.84, "text": "Leute abzufucken. Aber ich hab mir dann am Ende gedacht, nee, eigentlich ist es bescheuert,"}, {"id": 489, "start": 3515.84, "end": 3519.68, "text": "Geld auszugeben für ein Game, was dich nicht interessiert und dich das Franchise auch nicht"}, {"id": 490, "start": 3519.68, "end": 3533.56, "text": "wirklich interessiert, also insofern. So, net-stat. Jetzt läuft die Datenbank. sudo, insert-into,"}, {"id": 491, "start": 3533.56, "end": 3540.04, "text": "funktioniert, Datenbank läuft wieder, check my solution, ist korrekt. You made a Zetges"}, {"id": 492, "start": 3540.04, "end": 3548.36, "text": "server happy, congrats. Nice, oder? Wir sind, wir sind schon richtig, richtig nette Leute"}, {"id": 493, "start": 3548.36, "end": 3557.24, "text": "hier. Server is happy. A white pepo happy server. Ich muss es auf Twitter streamen."}, {"id": 494, "start": 3557.24, "end": 3565.96, "text": "Ich muss gar nichts. Alles auf Twitter streamen, das machen bestimmt manche Leute zum Ultratriggern."}, {"id": 495, "start": 3565.96, "end": 3577.16, "text": "Poggers, Server is wieder glücklich. Chat, gibt es noch Fragen dazu? Wollt ihr noch"}, {"id": 496, "start": 3577.16, "end": 3583.12, "text": "was wissen? Hab ich irgendwas übersehen? Ja, man kann, man kann auf Twitter, früher"}, {"id": 497, "start": 3583.12, "end": 3587.24, "text": "war das mit Periscope, aber man kann auf Twitter irgendwie streamen. Kannste auf Twitter so"}, {"id": 498, "start": 3587.24, "end": 3591.12, "text": "viel Bullshit machen, was keiner will? Ach, was wäre die Original-Lösung gewesen? Gute"}, {"id": 499, "start": 3591.12, "end": 3599.92, "text": "Frage, gucken wir gleich. A disk space voll. Wir hatten Glück, dass in der Fehlermeldung"}, {"id": 500, "start": 3599.92, "end": 3605.16, "text": "stand, no space left on device. Weil auf die Idee da jetzt zu gucken, wäre ich wahrscheinlich"}, {"id": 501, "start": 3605.16, "end": 3612.76, "text": "erst viel später gekommen. Die Original-Lösung. Ja, was ist die Original-Lösung? Run the test,"}, {"id": 502, "start": 3612.76, "end": 3618.52, "text": "is this Postgres Server running? You can check sudo, das haben wir gemacht. PS AUX Postgres,"}, {"id": 503, "start": 3618.52, "end": 3624.48, "text": "ne das haben wir, doch haben wir glaub ich auch so was probiert. System start Postgres,"}, {"id": 504, "start": 3624.48, "end": 3627.8, "text": "check status again, sowas in der Richtung haben wir auch gemacht. Das haben wir nicht"}, {"id": 505, "start": 3627.8, "end": 3634.68, "text": "gemacht. Journal minus u, Postgres, blablub. Wir haben es im Postgres Log selber gefunden,"}, {"id": 506, "start": 3634.68, "end": 3642.68, "text": "ist aber auch ok, ist ja egal wo man es herfindet. Warlog syslog, hab ich auch nicht reingeguckt,"}, {"id": 507, "start": 3642.68, "end": 3647.8, "text": "ich hab im Postgres Log selber geguckt. Check disk space, das haben wir wieder gemacht. Minus"}, {"id": 508, "start": 3647.8, "end": 3652.88, "text": "h ist übrigens nicht wirklich erforderlich. Minus h ist nur, dass es human readable ist."}, {"id": 509, "start": 3652.88, "end": 3657.64, "text": "Das heißt, hier hätten wir es auch gesehen, aber minus h ist natürlich deutlich angenehmer"}, {"id": 510, "start": 3657.64, "end": 3666.56, "text": "zu lesen. Weil, was weiß ich wie viele bytes versus 8G, da erkennt man das deutlich besser."}, {"id": 511, "start": 3666.56, "end": 3686.88, "text": "So und danach krept minus i im syslog, aha. Und dann Postgres data, ok leute, ich hab es"}, {"id": 512, "start": 3686.88, "end": 3692.72, "text": "ganz anders gemacht anscheinend. Delete backup files, ok das hab ich dann wiederum gemacht"}, {"id": 513, "start": 3692.72, "end": 3698.68, "text": "und das Ding gestartet. Ok, die offizielle Lösung ist finde ich fast komplizierter als"}, {"id": 514, "start": 3698.68, "end": 3707.56, "text": "meins. Leute, das ist jetzt, das ist wirklich noch nichts großartig kompliziertes. Ich"}, {"id": 515, "start": 3707.56, "end": 3713.12, "text": "hab 15 Jahre Linux Erfahrung und auch Admin Erfahrung, da ist sowas nicht sonderlich kompliziert."}, {"id": 516, "start": 3713.12, "end": 3718.36, "text": "Ich gebe zu, ich gebe zu, das war Zufall, das muss ich auch zugeben, das war in dem"}, {"id": 517, "start": 3718.36, "end": 3722.8, "text": "Fall tatsächlich Zufall, dass ich das gefunden habe so schnell. Das ist so direkt im Log"}, {"id": 518, "start": 3722.8, "end": 3729.56, "text": "drin entstanden, das war Zufall, das hätte doch durchaus länger dauern können. Weirdflex,"}, {"id": 519, "start": 3729.56, "end": 3733.84, "text": "ja was soll ich sagen, es ist die Wahrheit. Aber man muss sich da keine Gedanken drüber"}, {"id": 520, "start": 3733.84, "end": 3739.44, "text": "machen. Ich benutze täglich Linux, ja. ncedu ist wahrscheinlich nicht drauf. Ich benutze"}, {"id": 521, "start": 3739.44, "end": 3743.6, "text": "täglich Linux, ich benutze täglich Linux auf der Arbeit, sowohl auf dem Desktop als"}, {"id": 522, "start": 3743.6, "end": 3750.84, "text": "auch in unserer gesamten Linux Umgebung. So ein paar Sachen, wie Dienst läuft nicht,"}, {"id": 523, "start": 3750.84, "end": 3754.72, "text": "Logg Files nachgucken, das macht man so oft, da denkt man gar nicht mehr großartig drüber"}, {"id": 524, "start": 3754.72, "end": 3771.36, "text": "nach. Ich habe in Warlog geschaut, genau. Ja. Das ist auch nicht verkehrt erstmal zu"}, {"id": 525, "start": 3771.36, "end": 3778.68, "text": "gucken. Also ich glaube so eines der meist benutzten Befehle ist df-h, free-m und solche"}, {"id": 526, "start": 3778.68, "end": 3787.84, "text": "Geschichten. Danach dicht gefolgt von htop, ok vielleicht normales top, wenn es kein htop"}, {"id": 527, "start": 3787.84, "end": 3804.68, "text": "gibt. Alles klar, check my solution, korrekt, BÄM. Sudo, ne brauchen wir nicht. Power off."}, {"id": 528, "start": 3804.68, "end": 3817.84, "text": "Gibt es noch Fragen zu der Aufgabe chat? Ist das eine Debian vm, das ist eine gute Frage,"}, {"id": 529, "start": 3817.84, "end": 3828.88, "text": "guck mal mal. Alter, leckt, meine Güte, jetzt haben wir, ach home is not set. CUT, etc."}, {"id": 530, "start": 3828.88, "end": 3835.96, "text": "Es ist eine Debian GNU Linux, nicht dass man etwa auf die Idee kommt, einfach nur Linux"}, {"id": 531, "start": 3835.96, "end": 3843.96, "text": "zu sagen, weil ihr wisst was passiert. Dann wirds kritisch, wenn man einfach nur Linux"}, {"id": 532, "start": 3843.96, "end": 3852.64, "text": "sagt. Man muss schon korrekterweise GNU Linux sagen, sonst spawnt er bei euch um die Ecke"}, {"id": 533, "start": 3852.64, "end": 3865.2, "text": "und flamet euch. Du hast keinen anderen Zugang von dort, du kannst dort nicht rein und nicht"}, {"id": 534, "start": 3865.2, "end": 3871.72, "text": "raus. Funktioniert nicht auf der Kiste. Die haben das schon ganz gut gemacht, guck du"}, {"id": 535, "start": 3871.72, "end": 3876.8, "text": "kannst jetzt zum Beispiel, du kannst ja nicht mal ein DNS Server pingen. Kannste gar nichts"}, {"id": 536, "start": 3876.8, "end": 3881.72, "text": "machen. Was aber auch sinnvoll ist, weil sonst würden die Leute garantiert das irgendwie"}, {"id": 537, "start": 3881.72, "end": 3887.52, "text": "missbrauchen. Was für ein Linux wird auf Enterprise Ebene gerne benutzt, dazu kann"}, {"id": 538, "start": 3887.52, "end": 3891.84, "text": "man eigentlich bloß sagen Red Hat beziehungsweise CentOS, was es ja nicht mehr gibt in der jetzigen"}, {"id": 539, "start": 3891.84, "end": 3904.16, "text": "Form. Zum größten Teil Red Hat. Mit UFW geblockt, können wir gucken. Ach, der hat mal installiert."}, {"id": 540, "start": 3904.16, "end": 3909.04, "text": "Ne ne, das ist bestimmt nicht geblockt, das ist ein privates Netz ohne Zugang. So blöd"}, {"id": 541, "start": 3909.04, "end": 3916.12, "text": "ist der Betreiber bestimmt nicht. Also Red Hat, Red Hat ist im Enterprise Umfeld eigentlich"}, {"id": 542, "start": 3916.12, "end": 3928.08, "text": "mit Abstand das beliebteste, zumindest meiner Erfahrung nach. IP Tables willst du, ja können"}, {"id": 543, "start": 3928.08, "end": 3939.2, "text": "wir auch gucken. IP Tables minus V minus L, nix drinne. Ansonsten, ich wollte gerade sagen,"}, {"id": 544, "start": 3939.2, "end": 3944.64, "text": "flirten als ich wollte gerade sagen, in Asher ist Ubuntu tatsächlich relativ beliebt. Dadurch,"}, {"id": 545, "start": 3944.64, "end": 3950.16, "text": "dass es jetzt kein CentOS mehr gibt, könnte ich mir vorstellen, dass es im Enterprise"}, {"id": 546, "start": 3950.16, "end": 3956.0, "text": "Umfeld auch etwas nachlässt. Weil aktuell ist es so, entweder du kaufst dir wirklich"}, {"id": 547, "start": 3956.0, "end": 3964.24, "text": "Red Hat für jede Kiste, beziehungsweise mit Support Abo und Geschiss, oder du benutzt"}, {"id": 548, "start": 3964.24, "end": 3970.92, "text": "eines der neuen CentOS Nachfolgeprojekte. Genau, sowas. Wobei, da hat kaum noch eine"}, {"id": 549, "start": 3970.92, "end": 3976.76, "text": "Erfahrung so wirklich damit. Oder, oder, das ist auch eine Möglichkeit, oder man benutzt"}, {"id": 550, "start": 3976.76, "end": 3987.64, "text": "Oracle Linux. Kann man auch machen. Wobei ich persönlich eher auf Ubuntu setzen würde,"}, {"id": 551, "start": 3987.64, "end": 3995.2, "text": "Debian ist auch möglich. Also, so wie Shryker sagt, es ist eigentlich Red Hat, Red Hat,"}, {"id": 552, "start": 3995.2, "end": 4000.76, "text": "Ubuntu und Debian. Suze ist, ist mir ehrlich gesagt in freier Wildbahn bis einmal für"}, {"id": 553, "start": 4000.76, "end": 4006.2, "text": "die Telefonanlage noch nie untergekommen. Ja, Alpine, wenn die Container zählen, da"}, {"id": 554, "start": 4006.2, "end": 4017.04, "text": "hast du recht. OpenBSD habe ich so, will ich gerade, habe ich so in freier Wildbahn mal"}, {"id": 555, "start": 4017.04, "end": 4023.4, "text": "ein OpenBSD gesehen? Nee, ich glaube nicht. Doch, habe ich. PFSense habe ich ein paar"}, {"id": 556, "start": 4023.4, "end": 4041.08, "text": "Mal im Einsatz gesehen. Aber ansonsten. Ja gut, Alpine basierte Images haben den Vorteil,"}, {"id": 557, "start": 4041.08, "end": 4065.68, "text": "die sind halt sehr klein. Ok, also sind wir hier fertig. Sudo, Power off. Bam. Ups, ja."}, {"id": 558, "start": 4065.68, "end": 4072.4, "text": "So, more Scenarios. Next please. Wo sind wir stehen geblieben? Manhattan. Can't write into"}, {"id": 559, "start": 4072.4, "end": 4084.92, "text": "Database. Als nächstes kommt Tokyo. Can't surf Webfile. Medium, 15 Minuten. Ok, run."}, {"id": 560, "start": 4084.92, "end": 4091.68, "text": "Also, was ist die Aufgabe? Die Aufgabe ist tatsächlich diesmal relativ kurz und knapp."}, {"id": 561, "start": 4091.68, "end": 4100.48, "text": "Also, Stufe Mittel. Es gibt einen Web Server, der eine Datei war www.html.ok, das ist also"}, {"id": 562, "start": 4100.48, "end": 4107.44, "text": "der Standard der Standardfahrt. Der eine Datei war www.htmlindex.html mit dem Inhalt Hello"}, {"id": 563, "start": 4107.44, "end": 4114.68, "text": "Set Server bereitstellt. Aber wenn wir versuchen sie lokal mit einem HTTP Client wie Curl zu"}, {"id": 564, "start": 4114.68, "end": 4123.84, "text": "prüfen, zu überprüfen, wird nichts zurückgegeben. In diesem Szenario geht es nicht um die spezielle"}, {"id": 565, "start": 4123.84, "end": 4130.92, "text": "Web Server Konfiguration und sie müssen nur allgemeine Kenntnisse über die Funktionsweise"}, {"id": 566, "start": 4130.92, "end": 4140.24, "text": "von Web Servern haben. Ok, Test ist Curl auf Port 80 sollte Hello Set Server zurückliefern."}, {"id": 567, "start": 4140.24, "end": 4153.36, "text": "Alles klar. Gucken wir mal. Gucken wir mal was passiert, wenn wir es ausführen. Curl hängt."}, {"id": 568, "start": 4153.36, "end": 4166.24, "text": "Hängen ist komisch. Home, Ubuntu, ja gut, was auch immer. Netstat. Wir gucken mal ob"}, {"id": 569, "start": 4166.24, "end": 4190.96, "text": "auf Port 80 überhaupt was läuft. Port 80 läuft ein Apache. Der läuft und ist an."}, {"id": 570, "start": 4196.24, "end": 4202.6, "text": "Ob IPv6 auf Port 40, das ist bei lokalen Sachen, das ist egal, das müsste auch so funktionieren."}, {"id": 571, "start": 4202.6, "end": 4222.76, "text": "Ok, ich habe eine Idee. Ich habe eine Idee. Nachdem das hier gar nicht funktioniert, machen"}, {"id": 572, "start": 4222.76, "end": 4240.36, "text": "wir mal System CTL, stopp, Apache, Apache 2, ok, Apache 2 ist es. Status, aus. Wir haben"}, {"id": 573, "start": 4240.36, "end": 4251.32, "text": "das gleiche Ergebnis wie vorher. Passt mal auf Leute, die wollen uns debaten. Ich sage"}, {"id": 574, "start": 4251.32, "end": 4266.6, "text": "euch, die wollen uns debaten. Sieht eigentlich gut aus. Ne, sieht nicht gut aus. Die wollen"}, {"id": 575, "start": 4266.6, "end": 4282.44, "text": "uns ernsthaft debaten. Die wollen uns wirklich debaten. Ich habe es eigentlich nur eingegeben,"}, {"id": 576, "start": 4282.44, "end": 4289.72, "text": "weil vor zwei Minuten jemand im Chat geschrieben hat, wie man mit IP Tables überhaupt die"}, {"id": 577, "start": 4289.72, "end": 4294.92, "text": "Chains und so auflistet. Das hätte ich aus dem Kopf gar nicht gewusst. Also ohne den"}, {"id": 578, "start": 4294.92, "end": 4305.72, "text": "Chat hätte ich das nicht so schnell rausgekriegt. Ja, daran liegt es. Daran liegt es, der droppt"}, {"id": 579, "start": 4305.72, "end": 4309.92, "text": "einfach alles. Also normalerweise, also hätte jetzt nicht einer im Chat geschrieben, hätte"}, {"id": 580, "start": 4309.92, "end": 4314.68, "text": "ich folgendes gemacht. Ich hätte einen temporären Web Server oder Netcat gestartet auf Port"}, {"id": 581, "start": 4314.68, "end": 4319.24, "text": "80. Ich hätte Apache ausgeschaltet. Wir machen das mal. Wir tun mal so, als hätten wir es"}, {"id": 582, "start": 4319.24, "end": 4323.76, "text": "noch nicht gefunden. Wir tun einfach mal so, als hätten wir es noch nicht gefunden. Also"}, {"id": 583, "start": 4323.76, "end": 4333.64, "text": "wahrscheinlich hätte ich als nächstes folgendes gemacht. Python One Liner HTTP Server. Wahrscheinlich"}, {"id": 584, "start": 4333.64, "end": 4340.28, "text": "hätte ich das hier gemacht. Wahrscheinlich hätte ich sowas hier gemacht. Haben wir eine"}, {"id": 585, "start": 4340.28, "end": 4351.84, "text": "T-Max drauf? Ah, Polgarz, nice. Also wahrscheinlich hätte ich jetzt gesagt, war www. War www,"}, {"id": 586, "start": 4351.84, "end": 4355.52, "text": "habe ich mal hier geguckt, HTML. Okay, es ist zwar alles root, das ist schon sehr merkwürdig,"}, {"id": 587, "start": 4355.52, "end": 4361.28, "text": "aber es ist zumindest lesbar. HTML. Und dann hätte ich wahrscheinlich sowas hier gemacht."}, {"id": 588, "start": 4361.28, "end": 4375.0, "text": "Port 80. Ach Mist, okay. Ist gar nicht drauf. Na dann. Ah nee, doch ist drauf. Wahrscheinlich"}, {"id": 589, "start": 4375.0, "end": 4381.44, "text": "hätte ich das hier gemacht. Und dann hätte ich mal probiert. Curl, Local Host 80. Brauchen"}, {"id": 590, "start": 4381.44, "end": 4384.84, "text": "wir da eigentlich nicht. Und es geht immer noch nicht. Und dann wäre ich wahrscheinlich"}, {"id": 591, "start": 4384.84, "end": 4389.64, "text": "schon skeptisch geworden, weil ich mir gedacht, okay, das kommt gar nichts an. Das wird wahrscheinlich"}, {"id": 592, "start": 4389.64, "end": 4395.24, "text": "auch nicht am Apache liegen. Das nächste, was ich wahrscheinlich probiert hätte, ist"}, {"id": 593, "start": 4395.24, "end": 4404.96, "text": "auf Port 8000. Und dann hätte ich geguckt, geht es auf Port 8000? Auf Port 8000 funktioniert"}, {"id": 594, "start": 4404.96, "end": 4411.08, "text": "es. Und dann hätte ich mir gedacht, Moment, woran kann das liegen? Und dann hätte ich"}, {"id": 595, "start": 4411.08, "end": 4424.08, "text": "wahrscheinlich IP-Tables geguckt. IP-Tables minus V minus L. Und da ist es drin. Ja, okay."}, {"id": 596, "start": 4424.08, "end": 4433.52, "text": "Also dann wählen wir das Ganze mal. System CTL Restart Apache. IP-Tables, boah, das"}, {"id": 597, "start": 4433.52, "end": 4441.28, "text": "weiß ich aus dem Kopf nicht. IP-Tables minus D. Keine Ahnung, weiß ich aus dem Kopf nicht."}, {"id": 598, "start": 4441.28, "end": 4451.04, "text": "IP-Tables, Delete, Rule. Ist NF-Tables eigentlich mittlerweile weit verbreitet? Nö. IP-Tables"}, {"id": 599, "start": 4451.04, "end": 4457.92, "text": "minus F, okay. Und wie löscht man? Okay, ich machs einfach wieder. Ich machs einfach"}, {"id": 600, "start": 4457.92, "end": 4464.28, "text": "wieder. Chatters schreiben. IP-Tables einfach nur minus F oder sowas wie minus F Input."}, {"id": 601, "start": 4464.28, "end": 4471.88, "text": "Das ist doch, glaube ich, eine Input-Regel. Gibt es sowas wie IP-Tables, IP-Tables minus"}, {"id": 602, "start": 4471.88, "end": 4478.84, "text": "F Input, sowas? No-Chain, ah nee. Input groß geschrieben, so. Okay, einfach nur minus"}, {"id": 603, "start": 4478.84, "end": 4499.96, "text": "F. Alles klar. Okay, jetzt ist es leer. Und jetzt Curl Local Host. Oh. Da ist noch mehr"}, {"id": 604, "start": 4499.96, "end": 4509.08, "text": "im Argen. Nee, Leute, das hab ich jetzt kaputt gemacht. Ich glaube, das hab ich mit meinem"}, {"id": 605, "start": 4509.08, "end": 4516.8, "text": "Python Zeug kaputt gemacht. Nee, Apache ist gestartet. Alter, was will denn das hier?"}, {"id": 606, "start": 4516.8, "end": 4526.8, "text": "NetStats minus Tulpen. Apache läuft. Ich glaube, ich hab's kaputt gemacht. Aber Curl"}, {"id": 607, "start": 4526.8, "end": 4530.88, "text": "funktioniert nicht. Warum oder was ist der Test? Ach so, Moment. Wobei das eigentlich"}, {"id": 608, "start": 4530.88, "end": 4542.0, "text": "können. You don't have permissions. Eigentlich müsste das ja auch WWW-Data gehören. War"}, {"id": 609, "start": 4542.0, "end": 4549.4, "text": "schon kaputt? Also normalerweise müsste das WWW-Data gehören. Vermute ich mal. Gucken"}, {"id": 610, "start": 4549.4, "end": 4558.6, "text": "wir mal. Hier ist auch Scrap-Apache. Der läuft als WWW-Data. Allerdings wundert es mich,"}, {"id": 611, "start": 4558.6, "end": 4571.24, "text": "weil es ist ReadX. Was im Endeffekt? Ah. She baited. Deswegen funktioniert das nicht."}, {"id": 612, "start": 4571.24, "end": 4584.68, "text": "Okay, dann machen wir's gleich mal richtig. CHown WWW-Data. WWW-Data. CHown minus R. HTML."}, {"id": 613, "start": 4584.68, "end": 4597.32, "text": "HTML. Curl. Jetzt funktioniert's. Okay, alles klar. Das hab ich doch nicht selbst kaputt"}, {"id": 614, "start": 4597.32, "end": 4611.4, "text": "gemacht. Also waren's zwei Schritte. Als erstes, musste man feststellen, dass IP-Tables HTTP"}, {"id": 615, "start": 4611.4, "end": 4618.36, "text": "Traffic blockt. Und als zweites hat man festgestellt, der Datei hat die falschen Rechte. Schauen"}, {"id": 616, "start": 4618.36, "end": 4623.92, "text": "wir mal, ob das jetzt funktioniert. Check my solution. Correct. Also, dann schauen wir"}, {"id": 617, "start": 4623.92, "end": 4627.44, "text": "uns mal die offizielle Lösung an. Chat, wenn ihr Fragen zu dieser Übung habt, haut's"}, {"id": 618, "start": 4627.44, "end": 4636.44, "text": "jetzt in Chat. Wahrscheinlich hab ich manche Sachen übersehen. Oh. Ich glaub, wir haben"}, {"id": 619, "start": 4636.44, "end": 4644.68, "text": "länger gebraucht als notwendig. Dafür ist. Okay, alles klar. Also, Solution. Run test"}, {"id": 620, "start": 4644.68, "end": 4649.76, "text": "Curl. Okay, haben wir gemacht. Siehste, da wär ich wahrscheinlich erst viel später"}, {"id": 621, "start": 4649.76, "end": 4658.44, "text": "draufgekommen, IP-Tables zu gucken. Siehste, das war Zufall, weil's eben jemand im Chat"}, {"id": 622, "start": 4658.44, "end": 4666.24, "text": "vorher geschrieben hat. IP-Tables. Dann muss man IP-Tables minus F machen. Okay. Dann"}, {"id": 623, "start": 4666.24, "end": 4676.76, "text": "muss man das Ownership checken für die Datei. Ja. Und dann CHown. Okay, ich hab Recursive"}, {"id": 624, "start": 4676.76, "end": 4699.52, "text": "FCA ongemacht. Alles klar. Okay, nice. Haben wir auch rausgekriegt? Pfeifert. Wobei das"}, {"id": 625, "start": 4699.52, "end": 4711.16, "text": "wahrscheinlich gar nicht funktioniert, weil der DNS ist ja cached. Da hat's eine Anfrage"}, {"id": 626, "start": 4711.16, "end": 4726.12, "text": "geschickt. Ja, so was in der Richtung machen wir. Okay, gibt anscheinend. Nee, hab ich nicht."}, {"id": 627, "start": 4726.12, "end": 4746.0, "text": "Da lagst du gar nicht so falsch mit. Warst ja am Ende dann auch. Also was? Okay, Moment."}, {"id": 628, "start": 4746.0, "end": 4750.68, "text": "Hallo und guten Tag. Ich habe mal eine Frage. Vielleicht kann mir hier einer helfen. Ich"}, {"id": 629, "start": 4750.68, "end": 4757.88, "text": "benutze in meiner Schule auf Linux VM Tools. Was? Ich benutze in meiner Schule auf Linux"}, {"id": 630, "start": 4757.88, "end": 4763.28, "text": "VM Tools. Kann ich meine erstellte Sandbox, die Daten kopieren, diese bei mir zu Hause"}, {"id": 631, "start": 4763.28, "end": 4767.68, "text": "auf Windows dann aufrufen mit dem VM Tools bei mir? Ich hab keine Ahnung, was du genau"}, {"id": 632, "start": 4767.68, "end": 4780.16, "text": "machst. Da kann ich jetzt so nichts zu sagen. Das ist mir zu vage. Okay, haben wir das fertig?"}, {"id": 633, "start": 4780.16, "end": 4790.32, "text": "Next. Tokio sind verstehen geblieben. Tokio. Als nächstes kommt Cape Town. Das hört sich"}, {"id": 634, "start": 4790.32, "end": 4806.64, "text": "ja schon an. Run. Moment, das gehört ja gar nicht dazu. Okay, also. Was ist die Aufgabe?"}, {"id": 635, "start": 4806.64, "end": 4817.6, "text": "Gestörte Engine X. Kollege vom Chainlord, der Engine X hier. Es ist ein Engine X Web Server"}, {"id": 636, "start": 4817.6, "end": 4827.72, "text": "installiert, der von System D verwaltet wird. Wenn Sie curl minus L machen, ausführen,"}, {"id": 637, "start": 4827.72, "end": 4834.08, "text": "erhalten Sie curl fail to connect to localhost. Beheben Sie das, so dass Sie die Standard"}, {"id": 638, "start": 4834.08, "end": 4847.12, "text": "Engine X-Seite erhalten, wenn Sie curl ausführen. Okay. Okay, die VM ist noch nicht ready. Nicht"}, {"id": 639, "start": 4847.12, "end": 4853.64, "text": "ready. Ich glaube, er will einfach nur seine VM kopieren. Ja, vielleicht. Keine Ahnung."}, {"id": 640, "start": 4853.64, "end": 4857.72, "text": "Er könnte sich auch die Dateien auf den USB Stick kopieren und dann was ich daheim in"}, {"id": 641, "start": 4857.72, "end": 4867.92, "text": "der VM oder was auch immer. Ich kann daraus das nicht erkennen. Also du kannst die, also"}, {"id": 642, "start": 4867.92, "end": 4873.64, "text": "wenn du die VM kopierst, komplett, also mit Config Files und Disk Images und sowas, da"}, {"id": 643, "start": 4873.64, "end": 4878.76, "text": "kannst du die ohne Probleme eins zu eins auf dem anderen Rechner starten. Okay, was? In"}, {"id": 644, "start": 4878.76, "end": 4883.24, "text": "der Schule haben wir ein Linux PC. Da ist VM Tools drauf. Da machten wir ein Windows"}, {"id": 645, "start": 4883.24, "end": 4889.96, "text": "10 Pro Sandbox drin. Jetzt habe ich aber zu Hause kein Linux, sondern nur Windows 10 kann"}, {"id": 646, "start": 4889.96, "end": 4896.08, "text": "ich erteilen, die ich in. Ach so, ja, sind ja die gleichen. Es ist ja das gleiche Betriebssystem"}, {"id": 647, "start": 4896.08, "end": 4905.12, "text": "in der VM. Ja, ja, das funktioniert. Nee, also ich kenne das, aber dieses habe ich nicht"}, {"id": 648, "start": 4905.12, "end": 4909.4, "text": "gemacht. Das funktioniert. Am besten ist, du nimmst einen USB Stick, ziehst dir das"}, {"id": 649, "start": 4909.4, "end": 4914.32, "text": "da drauf und nimmst halt einfach mit. Okay, also, wo sind wir stehen geblieben? Open Terminal."}, {"id": 650, "start": 4914.32, "end": 4920.84, "text": "Next. So, was soll funktionieren? Was soll funktionieren? Erst mal root werden, wie immer."}, {"id": 651, "start": 4920.84, "end": 4937.68, "text": "Curl 127.0.0.1. Geht nicht. Connection refused. Der ist in engine.x-webserver install. Okay,"}, {"id": 652, "start": 4937.68, "end": 4948.32, "text": "also System CTL Status engine.x. Paled. MonkaS. Geht schon gut los. Warum ist der engine.x-Server?"}, {"id": 653, "start": 4948.32, "end": 4961.44, "text": "Warum failed der? Der failed, weil. Unexpected Semicolon in etc engine.x sites enabled default."}, {"id": 654, "start": 4961.44, "end": 4988.72, "text": "Aha, da sind irgendwelche Zeichen drinnen, die da nicht rein sollen. Ich sehe es nicht."}, {"id": 655, "start": 4988.72, "end": 5013.0, "text": "Wo ist da? Er sagt Zeile 1. Ah, she baited. She baited. Habe ich nicht gesehen, Leute."}, {"id": 656, "start": 5013.0, "end": 5037.72, "text": "Alles klar, okay. So, Semicolon weg. Restart engine.x. Okay, das sieht jetzt schon viel"}, {"id": 657, "start": 5037.72, "end": 5043.08, "text": "besser aus. Das wird aber wahrscheinlich nicht alles gewesen sein, oder? Status engine.x running."}, {"id": 658, "start": 5043.08, "end": 5051.6, "text": "Eats. Okay, das wird aber wirklich, ich glaube nicht, dass das alles gewesen wird. Curl."}, {"id": 659, "start": 5051.6, "end": 5075.32, "text": "Okay, ich wusste doch, dass da was kommt. Internal Server Error. Oh, Moment. Jetzt müssen"}, {"id": 660, "start": 5075.32, "end": 5092.84, "text": "wir nochmal. Vielleicht heißt die Datei falsch. War. Okay, ich meine, sie gehört gut, aber"}, {"id": 661, "start": 5092.84, "end": 5098.8, "text": "sie hat Read Access. Das sollte reichen. Da ist doch bestimmt ein Schreibfehler drinne"}, {"id": 662, "start": 5098.8, "end": 5112.12, "text": "oder sowas. Index Engine.x debian.html. Darf das, darf das Ding so heißen? Das darf so"}, {"id": 663, "start": 5112.12, "end": 5123.0, "text": "heißen. Okay. MV. Wir verschieben, wir verschieben das Ding jetzt mal. Machen ein Curl und gucken,"}, {"id": 664, "start": 5123.0, "end": 5132.0, "text": "was rauskommt. Pop in. Okay, also prinzipiell geht das, aber es hat einen Internal Server."}, {"id": 665, "start": 5132.0, "end": 5143.16, "text": "Hä? Da kaputt. Wie kommt man auf den Internal, Festplatte voll wieder. Wie kommt man auf"}, {"id": 666, "start": 5143.16, "end": 5149.2, "text": "den Internal Server Error bei einer einfachen Log Datei, bei einer einfachen HTML Datei."}, {"id": 667, "start": 5149.2, "end": 5159.64, "text": "Ist der rechte Schein okay? Gucken wir mal, Wahllog. Show in die HTML. Können wir gleich"}, {"id": 668, "start": 5159.64, "end": 5186.96, "text": "machen? Na klar. Alter Windows, was ist jetzt los? Engine.x Error Log. Oh, was ist da? Was"}, {"id": 669, "start": 5186.96, "end": 5208.52, "text": "ist da los? TMAX. Ach fuck. Okay, es ist kein TMAX auf. Too many open files? Two? Hat das"}, {"id": 670, "start": 5208.52, "end": 5214.76, "text": "Ding irgendwelche Limits gesetzt, dass es keine Dateien aufmachen kann? Hat es ein File"}, {"id": 671, "start": 5214.76, "end": 5220.92, "text": "Handle Limit irgendwo gesetzt, was ich jetzt nicht gesehen habe? Wobei man das wahrscheinlich"}, {"id": 672, "start": 5220.92, "end": 5226.96, "text": "nicht in der. Okay, das ist jetzt tatsächlich ein bisschen komplizierter. Ich glaube hier"}, {"id": 673, "start": 5226.96, "end": 5234.4, "text": "in der Konfig setzt man das nicht. Moment, Moment, Moment. Google. Too many open files."}, {"id": 674, "start": 5234.4, "end": 5249.12, "text": "Engine.x Aha, aha. Too many open files. Also in der Engine.x Konfig habe ich nichts gesehen."}, {"id": 675, "start": 5249.12, "end": 5255.04, "text": "Es wäre aber auch bescheuert. Ah, hier guck mal. Limit. Das kann sein, dass in der Limits"}, {"id": 676, "start": 5255.04, "end": 5275.36, "text": "da Teil was drinne steht. Limits. Nope. Du hast recht, im Unit File. Im Unit File könnte"}, {"id": 677, "start": 5275.36, "end": 5293.88, "text": "wirklich sein. System CTL Edit. Okay. Stack Overflow Driven Bug Fixing. Limit File. Zehn."}, {"id": 678, "start": 5293.88, "end": 5298.96, "text": "Ich habe seriously keine Ahnung was diese Option macht. Ich habe diese Option noch nie"}, {"id": 679, "start": 5298.96, "end": 5312.8, "text": "in meinem Leben verwendet. Du hast zwei VWW. Nee, ich kann keine zwei VWW haben. Okay,"}, {"id": 680, "start": 5312.8, "end": 5322.68, "text": "wir schreiben einfach 10.000 rein oder so. Okay, easy. Wenn das hilft. Ups. Ah, das ist"}, {"id": 681, "start": 5322.68, "end": 5332.24, "text": "ja Nano, MonkaS. Wer macht denn sowas? Wer quält einen hier mit Nano, Mensch? Richtiger"}, {"id": 682, "start": 5332.24, "end": 5357.12, "text": "Pepega Editor. System CTL Restart Engine.x Wie? Was? Hey, ist die Datei aber noch vorhin"}, {"id": 683, "start": 5357.12, "end": 5382.6, "text": "editiert? Hä? Ach, ETC Engine. Ist das da auch noch verkehrt oder was? Nee, Quatsch."}, {"id": 684, "start": 5382.6, "end": 5408.2, "text": "Quatsch, Quatsch, Quatsch. Ach, kann man sich mit der ID etwa verbinden, Chat? Ah,"}, {"id": 685, "start": 5408.2, "end": 5427.88, "text": "okay. Ich muss die Kiste jetzt ausschalten, Leute. Wer weiß was ihr da drauf rumwurstet."}, {"id": 686, "start": 5427.88, "end": 5434.68, "text": "Das hätte ich ja nicht gedacht, dass man mit der ID, wenn man die ID sieht, irgendwelche"}, {"id": 687, "start": 5434.68, "end": 5441.44, "text": "komischen Dinge anstellen kann. Das hätte ich wirklich nicht gedacht. Aber okay, dann"}, {"id": 688, "start": 5441.44, "end": 5451.44, "text": "kann man das so im Stream nicht machen. Kann man, ja. Anscheinend geht das. Also, es gibt"}, {"id": 689, "start": 5451.44, "end": 5461.76, "text": "jetzt zwei Varianten, wie wir das machen können, Chat. Entweder ihr haltet euch zurück, wobei"}, {"id": 690, "start": 5461.76, "end": 5470.0, "text": "ich vermute, vermute, dass das nicht funktionieren wird. Oder ich muss das irgendwie ausblenden."}, {"id": 691, "start": 5470.0, "end": 5488.64, "text": "Okay, oder Vollscreen, oder, nee, das ist, das ist auch dumm. Einfach die Katze oben"}, {"id": 692, "start": 5488.64, "end": 5502.76, "text": "in die Ecke. Nee, nee, nee, so einfach ist das, glaube ich, nicht. Wie blende ich das"}, {"id": 693, "start": 5502.76, "end": 5513.04, "text": "jetzt? Kann man nicht irgendwie einfach die Adressleiste ausblenden oder so? Okay, wir"}, {"id": 694, "start": 5513.04, "end": 5525.8, "text": "müssen das, glaube ich, OBS-technisch irgendwie ein bisschen verschieben. Okay, jetzt muss"}, {"id": 695, "start": 5525.8, "end": 5535.88, "text": "ich mal kurz gucken, ob das jetzt weg ist. Nee, aber da muss ich viel zu viel ausblenden."}, {"id": 696, "start": 5535.88, "end": 5557.36, "text": "Das ist doof. Da muss uns irgendwas anderes einfallen. Keklchi bated. Nee, nee, das kannst"}, {"id": 697, "start": 5557.36, "end": 5562.64, "text": "du vergessen. Der Chat wird sich nicht benehmen. Das kannst du, das kannst, das ist ausgeschlossen."}, {"id": 698, "start": 5562.64, "end": 5576.52, "text": "Kannst du den OBS einfach eine Color-Source hinzufügen und dann? Okay, gibt es die Möglichkeit"}, {"id": 699, "start": 5576.52, "end": 5592.8, "text": "Chrome-Hide-Addressbar, Auto-Hide-Addressbar, okay. Ja, ich muss, ich muss wohl einen Offerlay"}, {"id": 700, "start": 5592.8, "end": 5617.48, "text": "machen. Halt, gibt es da irgendwas? About-Flags? Hä? Hide-Toolbar, das ist doch was ganz anderes."}, {"id": 701, "start": 5617.48, "end": 5627.68, "text": "Ach nee, das geht tatsächlich. Das geht, das geht tatsächlich. Ach komm, scheiß drauf,"}, {"id": 702, "start": 5627.68, "end": 5647.96, "text": "ich mach jetzt, ich mach jetzt einfach folgendes. So. Easy. Jetzt seht ihr auch nichts mehr."}, {"id": 703, "start": 5647.96, "end": 5654.04, "text": "Okay, more scenarios. Weil mich das triggert, ich kann keine 1 mehr kopieren. Also, wo sind"}, {"id": 704, "start": 5654.04, "end": 5661.4, "text": "wir stehengeblieben? BorkedEngineX, das hatten wir gerade, das haben wir gefixt. Außer Keklchi"}, {"id": 705, "start": 5661.4, "end": 5685.2, "text": "Baited. Doch, das war gefixt. Das hätte funktioniert, das hätte funktioniert. Ich bin mir relativ"}, {"id": 706, "start": 5685.2, "end": 5689.52, "text": "sicher, das hätte funktioniert jetzt. Ich weiß, wir können es auch einfach nochmal"}, {"id": 707, "start": 5689.52, "end": 5696.16, "text": "schnell fixen, okay. Können wir nämlich gleich testen, ob es funktioniert. Wir probieren"}, {"id": 708, "start": 5696.16, "end": 5702.48, "text": "es nochmal aus, wir probieren es nochmal aus. Wir machen, wir machen das nochmal schnell,"}, {"id": 709, "start": 5702.48, "end": 5711.36, "text": "das dauert ja bloß 2-3 Minuten. Wir machen das nochmal schnell. Keklchi Baited, mann."}, {"id": 710, "start": 5711.36, "end": 5719.0, "text": "Zu geil. 15 Minuten soll die Aufgabe gehen. Ja, sonst wird es für den zu teuer auf AWS."}, {"id": 711, "start": 5719.0, "end": 5736.04, "text": "Keklchi Baited. Wer das wohl gewesen ist. Warum gibt es den Preis-Champ nicht mehr? Weil"}, {"id": 712, "start": 5736.04, "end": 5747.88, "text": "es zu eklig war, die Crawler aktuell zu halten. Ich glaube, Leute, Leute, ich glaube, wir"}, {"id": 713, "start": 5747.88, "end": 5758.68, "text": "dürfen das nicht nochmal machen. Ich glaube, wir dürfen es nicht nochmal machen. Die Firm"}, {"id": 714, "start": 5758.68, "end": 5786.48, "text": "geht nicht auf. Kann das sein, dass das procken ist? W-Power-Off bringt nichts oder was? Na"}, {"id": 715, "start": 5786.48, "end": 5804.32, "text": "na na. Ach, jetzt surfen wir, okay. Alter. Okay, das heißt, wir wissen jetzt, wo wir"}, {"id": 716, "start": 5804.32, "end": 5810.68, "text": "es positionieren müssen und zwar, wir müssen es so positionieren. Okay, wenn ich es jetzt"}, {"id": 717, "start": 5810.68, "end": 5826.6, "text": "verschließe, okay, jetzt ist alles weg. Connection Closed. Okay, jetzt ist, jetzt ist weg. Jetzt"}, {"id": 718, "start": 5826.6, "end": 5829.52, "text": "müssen wir nochmal einen Server erstellen. Wahrscheinlich sind wir gleich im Rate-Limit"}, {"id": 719, "start": 5829.52, "end": 5846.28, "text": "drin. Wahrscheinlich sind wir gleich im Rate-Limit und dürfen nicht weitermachen. Kurz Cookies"}, {"id": 720, "start": 5846.28, "end": 5859.72, "text": "clearen. Ich glaube, die sind nicht so blöd und machen das auf Cookie-Basis. Es steht"}, {"id": 721, "start": 5859.72, "end": 5868.28, "text": "unten, wenn ich über den Link haffe. Alter, es ist ja gut jetzt, Mann. Warum ist das so"}, {"id": 722, "start": 5868.28, "end": 5877.2, "text": "kompliziert? Brauche ich unten Link? Brauche ich jetzt hier unten nochmal einen Terminal"}, {"id": 723, "start": 5877.2, "end": 5906.64, "text": "drüber oder wie? Okay, wir machen hier oben mal was anderes."}, {"id": 724, "start": 5906.64, "end": 5917.52, "text": "Oh, excellent. Okay, jetzt sieht man nichts, oder? Chat, top secret. Jetzt ist alles hidden."}, {"id": 725, "start": 5917.52, "end": 5925.88, "text": "Okay, also zwei Sachen. Moment, wenn ich das jetzt rüberschiebe, hoa, Glück gehabt, Leute."}, {"id": 726, "start": 5925.88, "end": 5930.76, "text": "Knappe Geschichte, knappe Kiste hier. Okay, man sieht nichts. Also, wo sind vielleicht"}, {"id": 727, "start": 5930.76, "end": 5939.84, "text": "die Sachen? Etc, nginx, nginx, ne, default, ne, wo war das Ding? Sites, enabled, default,"}, {"id": 728, "start": 5939.84, "end": 5953.76, "text": "irgendwie so. Zack, die Musik ist aus. So geht das net. Also, hier war das drinne. System,"}, {"id": 729, "start": 5953.76, "end": 5972.56, "text": "ctl, restart, nginx, status. Was war das andere Problem nochmal? Ah, das ist das sus-edit,"}, {"id": 730, "start": 5972.56, "end": 5986.32, "text": "mir das da. Limit. Okay, pepega-editor, Mann. Yes. Hat das jetzt funktioniert? Yes. Restart,"}, {"id": 731, "start": 5986.32, "end": 5994.88, "text": "nginx, status, nginx. Läuft, jetzt steht ja auch nicht kackel, cibeide drin. Und curl,"}, {"id": 732, "start": 5994.88, "end": 6002.64, "text": "nginx, returns. Returns, okay. Check my solution. Bäm, hat funktioniert, alles klar. Also Leute,"}, {"id": 733, "start": 6002.64, "end": 6007.24, "text": "so war die offizie... Achso, wir können uns mal angucken, was die offizielle Lösung ist,"}, {"id": 734, "start": 6007.24, "end": 6017.56, "text": "wie man das Ganze fixen soll. Check status of nginx. Jo, haben wir gemacht. Nginx minus"}, {"id": 735, "start": 6017.56, "end": 6021.76, "text": "t. Das hätte ich machen sollen. Habe ich nicht dran gedacht, dass es sowas gibt. Hat"}, {"id": 736, "start": 6021.76, "end": 6028.64, "text": "aber glaube ich jemand im Chat geschrieben. After fixing config file and restarting nginx"}, {"id": 737, "start": 6028.64, "end": 6033.88, "text": "hat 500er error. Und dann soll man im log gucken. Ich glaube, das habe ich auch gemacht."}, {"id": 738, "start": 6033.88, "end": 6051.16, "text": "Und dann soll man im service limit no file anpassen. Und dann restarten. Okay,"}, {"id": 739, "start": 6051.16, "end": 6062.8, "text": "alles klar, haben wir gemacht. Bäm, next please. Wir sind stehen geblieben bei borkt nginx. Als"}, {"id": 740, "start": 6062.8, "end": 6072.28, "text": "nächstes kommt jetzt salta. Docker container won't start. Da bin ich jetzt mal gespannt."}, {"id": 741, "start": 6072.28, "end": 6086.36, "text": "Docker containerisierungsstells am start. Okay, also was ist die Aufgabe? Die Aufgabe ist,"}, {"id": 742, "start": 6086.36, "end": 6096.12, "text": "im Verzeichnis home admin app befindet sich eine gedokte, eine dockerize, befindet sich eine"}, {"id": 743, "start": 6096.12, "end": 6105.6, "text": "containeri dockerizierte web anwendung. Erstellen sie einen docker container, sodass sie eine"}, {"id": 744, "start": 6105.6, "end": 6115.76, "text": "web anwendung auf port 8888 erhalten und zu ihr curlen können. Damit die lösung gültig ist,"}, {"id": 745, "start": 6115.76, "end": 6125.24, "text": "sollte es nur einen laufenden docker container geben. Also der test ist curl localhost 8888"}, {"id": 746, "start": 6125.24, "end": 6136.52, "text": "soll hello world zurückgeben. Schauen wir mal. Was macht curl eigentlich so webrequest?"}, {"id": 747, "start": 6136.52, "end": 6145.28, "text": "Curl hat bald 25 jähriges jubiläum im märz. Das habe ich auf github gelesen. Die haben irgendwie"}, {"id": 748, "start": 6145.28, "end": 6160.04, "text": "so einen curl celebration day oder sowas im märz irgendwann. Okay, auf geht's. Okay,"}, {"id": 749, "start": 6160.04, "end": 6165.8, "text": "was passiert, wenn man das hier. Okay, da läuft. Okay, gut, dass wir das ausprobiert haben am"}, {"id": 750, "start": 6165.8, "end": 6171.8, "text": "Anfang, weil da wäre ich jetzt auf die nase gefallen, dass der port geblockt ist. Es läuft"}, {"id": 751, "start": 6171.8, "end": 6181.64, "text": "schon was auf port 8888. Was läuft denn, was läuft denn so auf port 8888? Netstat minus tulben."}, {"id": 752, "start": 6181.64, "end": 6192.64, "text": "Es läuft auf port 8888 ein engine x. Systemctl stopp engine x. Und jetzt machen wir nochmal"}, {"id": 753, "start": 6192.64, "end": 6202.96, "text": "ein curl. Und jetzt geht nix mehr. Okay, das ist schon mal gut. So, wo liegt die dockeranwendung?"}, {"id": 754, "start": 6202.96, "end": 6224.16, "text": "App. Ich will ein bisschen was sehen hier. Okay, home admin, home app. Da gibt's ein dockerfile. Kann"}, {"id": 755, "start": 6224.16, "end": 6229.72, "text": "ich das hier resizen, ohne dass ich es irgendwie leake? Ja, kann ich. Also da liegt ein dockerfile,"}, {"id": 756, "start": 6229.72, "end": 6235.84, "text": "ein server.js. Gucken wir mal ein server.js rein. Server.js. Das ist eine express anwendung,"}, {"id": 757, "start": 6235.84, "end": 6251.24, "text": "habe ich keinen plan von map slash send hello world. Okay. Alles klar. Ja gut, t-max gibt's"}, {"id": 758, "start": 6251.24, "end": 6259.84, "text": "net. Ach toll. Dann würde ich sagen, wir bauen das Ding einfach mal. Docker, bild, Punkt. Geben wir"}, {"id": 759, "start": 6259.84, "end": 6267.08, "text": "dem Ding mal Name, App. Was ist t-max? Da kannst du dann mehrere, da kannst du in einem Terminal"}, {"id": 760, "start": 6267.08, "end": 6271.92, "text": "mehrere tabs und sowas aufmachen. Das ist ganz praktisch, wenn man ein paar Sachen parallel machen"}, {"id": 761, "start": 6271.92, "end": 6279.36, "text": "möchte. So, also wir haben jetzt die App gebaut. Da machen wir jetzt mal docker run minus d, weil"}, {"id": 762, "start": 6279.36, "end": 6290.28, "text": "ich nicht will, dass es im Vordergrund ist, da ich noch was tippen kann. Minus d, App. Okay, docker ps."}, {"id": 763, "start": 6290.28, "end": 6317.44, "text": "Okay. Docker log. Logs. Wie heißt das Ding? Kind. Ach ja, guck mal da. Es gibt ein Fehler in"}, {"id": 764, "start": 6317.44, "end": 6329.08, "text": "der Node.js Anwendung. Cannot find module user user src app surf.js. Lasst uns mal in das Docker"}, {"id": 765, "start": 6329.08, "end": 6355.88, "text": "File gucken. Okay. Okay. Okay. Das soll 8888 sein, oder? Nicht 8880. Wart mal. Moment, Moment. Ich"}, {"id": 766, "start": 6355.88, "end": 6363.96, "text": "glaube, die wollen uns schon wieder jebaden. Genau, das heißt server.js. Das ist ein Master"}, {"id": 767, "start": 6363.96, "end": 6377.6, "text": "jebader. Der Part fürs Working, der sieht falsch aus. User source. Sicher? Nö. Müsste eigentlich"}, {"id": 768, "start": 6377.6, "end": 6398.76, "text": "stimmen. Sehen wir gleich. Ein richtiger Master jebader ist das. Server.js. Build. Run. Docker ps."}, {"id": 769, "start": 6398.76, "end": 6415.36, "text": "Aha. Netztat. Ach, ich hab Port Mapping nicht richtig gemacht. Docker stopp. Hab das Port"}, {"id": 770, "start": 6415.36, "end": 6424.84, "text": "Mapping nicht richtig gemacht. Wir wollen es ja auf Port 8888 haben. Wir werden nicht das"}, {"id": 771, "start": 6424.84, "end": 6436.96, "text": "Docker File anpassen. Wir sagen einfach Docker Run und dann minus P 8888 auf Port 8880. Bam."}, {"id": 772, "start": 6436.96, "end": 6449.64, "text": "Docker ps. Aha. Läuft. Jo. Mehr alter Shit. Läuft. Okay. Und was ist der Test? Der Test ist"}, {"id": 773, "start": 6449.64, "end": 6463.36, "text": "curl 8888 returns hello world. Fuck. Das wäre ja auch zu einfach gewesen, wenn das einfach"}, {"id": 774, "start": 6463.36, "end": 6490.96, "text": "funktioniert hätte. Warum funktioniert das nicht? Netztat. Oh nee, ist das wieder eine"}, {"id": 775, "start": 6490.96, "end": 6515.0, "text": "IP-Tables-Regel? Ich raste aus, Alter. Boah, das ist zu viel. Moment. Äh."}, {"id": 776, "start": 6520.96, "end": 6542.92, "text": "Ich seh nix. Seht ihr irgendwas Schlemmes? Sieht doch okay aus, oder? Nee, was ist das hier?"}, {"id": 777, "start": 6542.92, "end": 6566.68, "text": "Nee, alles gut. Nee, das ist eigentlich okay. Oh, what? Nee, das sieht, das sieht eigentlich"}, {"id": 778, "start": 6566.68, "end": 6590.96, "text": "okay aus. Okay. Ähm. Warum geht das nicht? Netztat. Sieht eigentlich okay aus. Docker stopp. Die App"}, {"id": 779, "start": 6590.96, "end": 6608.12, "text": "hört auf einem anderen Port, aber das ist nicht wild, weil ich hab's ja umgemappt. Stopp. Fuck. Ich"}, {"id": 780, "start": 6608.12, "end": 6629.68, "text": "hab, ich hab Steuerung W gedrückt. Shit. Es war nicht so high IQ. Curl. Localhost 8888. Connection"}, {"id": 781, "start": 6629.68, "end": 6638.68, "text": "reset. Okay, jetzt steh ich echt ein bisschen auf dem Schlauch. Was hat er jetzt für Probleme? Docker"}, {"id": 782, "start": 6638.68, "end": 6659.92, "text": "logs. Moment. Der Server startet an 8888 anstatt auf. Moment, ist da noch ein Fehler im Dockerfile?"}, {"id": 783, "start": 6659.92, "end": 6678.52, "text": "CD, Home, Admin, Dockerfile. Aha. 8888, weil ich vermute mal im Server.js steht Port 8. Aha. Okay,"}, {"id": 784, "start": 6678.52, "end": 6685.32, "text": "okay, okay. Docker stopp. Da war auch noch ein Fehler drin. Da war auch noch ein Fehler drin."}, {"id": 785, "start": 6685.32, "end": 6690.76, "text": "Alles klar. Wir haben zwar den richtigen Port umgeleitet, aber die Anwendung lauscht auf dem"}, {"id": 786, "start": 6690.76, "end": 6698.32, "text": "anderen Port. Jetzt, jetzt wird's funktionieren hier. Build. Richtiger Chebater, der Typ. So,"}, {"id": 787, "start": 6698.32, "end": 6708.6, "text": "jetzt können wir quasi 8888 extern auf 8888 intern machen. Docker, PS. Curl, Localhost 8. Das ist"}, {"id": 788, "start": 6708.6, "end": 6719.52, "text": "wunderbar für Azubis. Okay, hello world. Funst. Check my solution. Correct. Agreege. Nice. Leute,"}, {"id": 789, "start": 6719.52, "end": 6723.4, "text": "gibt's noch Fragen? Wir haben nicht mal viel Zeit in der VM. Ich glaube wir haben bloß 15"}, {"id": 790, "start": 6723.4, "end": 6734.48, "text": "Minuten Zeit. Wir haben die 15 Minuten wahrscheinlich fast erreicht. Zudo, Power off. Bam. More Scenarios."}, {"id": 791, "start": 6734.48, "end": 6739.84, "text": "Hab ich irgendwas überlesen? Bei dem, bei dem musste ich mich ein bisschen konzentrieren. Das"}, {"id": 792, "start": 6739.84, "end": 6748.48, "text": "war schon ein bisschen komplizierter jetzt, oder? Stimmt, wir können unseren Timer verwenden. Leute,"}, {"id": 793, "start": 6748.48, "end": 6754.96, "text": "Sixhead, wir verwenden das nächste Mal den Timer. Sind das jetzt Admin-Aufgaben oder ist"}, {"id": 794, "start": 6754.96, "end": 6759.76, "text": "das schon ein Bereich? DevOps. Das kann man nicht so, das kann man nicht so genau trennen. Seriously,"}, {"id": 795, "start": 6759.76, "end": 6764.6, "text": "viele Admins nennen sich heute einfach nur DevOps-Engineer, weil es cooler klingt. Glaubt mir,"}, {"id": 796, "start": 6764.6, "end": 6775.04, "text": "ich spreche da aus Erfahrung. Das ist alles fließend, der Übergang. Okay, gab's Questions,"}, {"id": 797, "start": 6775.04, "end": 6780.64, "text": "die ich übersehen habe? Nee. Weiter, was haben wir das nächste? Docker, Container,"}, {"id": 798, "start": 6780.64, "end": 6793.96, "text": "Wunschpass. Venice. I'm in a container. Okay. 15 Minuten Zeit. Guck mal Leute, wir benutzen"}, {"id": 799, "start": 6793.96, "end": 6810.48, "text": "mal unseren neuen Sixhead Timer. 15 Minuten. Okay. Gleich geht's los, sobald es startet."}, {"id": 800, "start": 6810.48, "end": 6820.32, "text": "Was ist denn die Aufgabe? Try to figure out if you are inside a container or inside a virtual"}, {"id": 801, "start": 6820.32, "end": 6829.0, "text": "machine. Leute, easy. Wisst ihr was ich einfach probiere? Modprobe, PC-Speaker. Wenn Modprobe"}, {"id": 802, "start": 6829.0, "end": 6833.8, "text": "funktioniert, weiß ich, ich bin in der VM. Wenn Modprobe fehlschlägt, weiß ich, ich bin im"}, {"id": 803, "start": 6833.8, "end": 6851.32, "text": "Container. Was ist denn sonst noch? Man könnte, wird what verwenden? Was ich nicht installiert"}, {"id": 804, "start": 6851.32, "end": 6866.4, "text": "habe? Wird what? Wird what könnte ich verwenden? Als root, ja, ist gut. VMWare. Aber ich gehe"}, {"id": 805, "start": 6866.4, "end": 6873.6, "text": "davon aus, dass es nicht installiert ist. Wir könnten die MAC-Adresse checken. Wir"}, {"id": 806, "start": 6873.6, "end": 6883.04, "text": "könnten die MAC-Adresse checken, ob das bekannte VMWare, KVM oder sonst was MAC-Adressen sind."}, {"id": 807, "start": 6883.04, "end": 6892.52, "text": "Wir könnten vielleicht die kernel command line angucken, mit was das OS gestartet wurde."}, {"id": 808, "start": 6892.52, "end": 6901.04, "text": "Wir könnten gucken, ob unser Initprozess, falls wir einen Initprozess, wobei, wenn wir"}, {"id": 809, "start": 6901.04, "end": 6906.76, "text": "System D laufen haben, ist es höchstwahrscheinlich kein Docker-Container. Wir könnten gucken,"}, {"id": 810, "start": 6906.76, "end": 6913.48, "text": "ob unser Initprozess, der erste Prozess ist, der gestartet wurde. Keine Ahnung, wie man"}, {"id": 811, "start": 6913.48, "end": 6918.32, "text": "gescheit rauskriegt auf einem Container. Du kannst auf.dockerenv schauen. Ja, es gibt"}, {"id": 812, "start": 6918.32, "end": 6926.08, "text": "aber nicht nur Docker als Kontainerisierungslösung. Proc CPU-Info. Das ist eine gute Idee. Wir"}, {"id": 813, "start": 6926.08, "end": 6936.52, "text": "können gucken. Hostname-CTL. DMSC. Ja, gucken wir. Also ich probiere das mit dem kernel-Modul."}, {"id": 814, "start": 6936.52, "end": 6960.44, "text": "Der kernel-Modul dürfte das aller-einfachste sein. Open new window. Sack. Also, modprop."}, {"id": 815, "start": 6960.44, "end": 6968.48, "text": "Modprop ist nicht drauf. Meine... Scheiße. Okay. Mein erster Ansatz funktioniert schonmal"}, {"id": 816, "start": 6968.48, "end": 6973.16, "text": "nicht, dass ich einfach kernel-Module laden kann. Ellers wird wahrscheinlich alles nicht"}, {"id": 817, "start": 6973.16, "end": 6988.96, "text": "drauf sein. DME-Decode. Alles nicht drauf. Okay. Cat Proc CPU-Info. Da könnten wir gucken."}, {"id": 818, "start": 6988.96, "end": 6996.68, "text": "Das ist ein AMD-Epic. Tja. Erkennt man jetzt nicht wirklich was. Mein bester Guess ist"}, {"id": 819, "start": 6996.68, "end": 7004.6, "text": "erstmal Mac-Adressen. Ist das eine bekannte Mac-Adresse von irgendeiner Virtualisierungslösung?"}, {"id": 820, "start": 7004.6, "end": 7033.16, "text": "Mac. What? Sender. Nope. Okay. Cat Proc CMD-Line oder sowas. Boot-Image. Cloud-AMD-64."}, {"id": 821, "start": 7033.16, "end": 7043.04, "text": "Das sieht nach einer VM aus, wobei ich mir ehrlich gesagt nicht sicher bin, ob das nicht"}, {"id": 822, "start": 7043.04, "end": 7047.48, "text": "in einem Container, der auf einer VM läuft, schlicht und ergreifend ganz genauso aussieht."}, {"id": 823, "start": 7047.48, "end": 7057.6, "text": "Gibt es nicht System-D-Detect-Wirt? Ach. Was ist das? Okay. Wir sind in einem Container."}, {"id": 824, "start": 7057.6, "end": 7078.36, "text": "Das habe ich ja noch nie gehört. System-D-Detect-Wirt. Yep. Cock. Kannte dir das? Versuch Hostname-CTL."}, {"id": 825, "start": 7078.36, "end": 7094.44, "text": "Ach. Guck mal. Das ist auch cool. Okay. Das muss ich mir merken. Da habe ich wieder was"}, {"id": 826, "start": 7094.44, "end": 7108.08, "text": "gelernt. Das kannte ich selbst auch nicht. Hostname-CTL und System-D. Schau Proc 1-C-Groups"}, {"id": 827, "start": 7108.08, "end": 7122.16, "text": "an. Proc 1? Ja gut, das ist ja Init. C-Groups. Init Scope. Das ist jetzt gut oder schlecht?"}, {"id": 828, "start": 7122.16, "end": 7127.96, "text": "Was sagt... Also okay, wir sind in einem Container. Das wissen wir. Aber erkennt man jetzt daran,"}, {"id": 829, "start": 7127.96, "end": 7141.92, "text": "ob es ein Container ist oder nicht? Ja. Aber nice, nice. Interessant. Das wusste ich nicht."}, {"id": 830, "start": 7141.92, "end": 7145.2, "text": "Okay, da hätte ich jetzt ein bisschen überlegen müssen. Aber gut, wir haben es rausbekommen."}, {"id": 831, "start": 7145.2, "end": 7162.28, "text": "Wir sind in einem Container. Ease. E. Sudo. Power off. Ach so, gibt es nicht. Okay. Also"}, {"id": 832, "start": 7162.28, "end": 7171.8, "text": "next. Wo sind wir stehen geblieben? Close an open file. Ach, jetzt kommt das. Boah Leute,"}, {"id": 833, "start": 7171.8, "end": 7178.72, "text": "ich kann mich nicht mehr lange konzentrieren. Also wir machen das hier noch. Vielleicht,"}, {"id": 834, "start": 7178.72, "end": 7183.84, "text": "vielleicht. Mal gucken. Aber das machen wir auf jeden Fall noch. Guck mal, da haben wir"}, {"id": 835, "start": 7183.84, "end": 7190.76, "text": "fast die Hälfte. Dann machen wir das nächste Mal die schweren Dinger. Close an open file."}, {"id": 836, "start": 7190.76, "end": 7207.0, "text": "Okay, also Aufgabe. Wir haben eine Datei. Home admin some file is open for writing by"}, {"id": 837, "start": 7207.0, "end": 7212.88, "text": "some process. Das habe ich eben vorhin schon angeguckt. Close this file without killing"}, {"id": 838, "start": 7212.88, "end": 7222.64, "text": "the process. Okay, also wir sollen die Datei quasi schließen ohne den Prozess, der die"}, {"id": 839, "start": 7222.64, "end": 7233.04, "text": "Datei offen hat, zu killen. Das klingt, je nachdem. Irgendwie ein Signal schicken oder"}, {"id": 840, "start": 7233.04, "end": 7249.96, "text": "sowas. Okay, erstmal root werden, wie immer. Home admin. Okay. Moment, was ist das? Open"}, {"id": 841, "start": 7249.96, "end": 7265.04, "text": "file.sh? Also Alice of some file. Okay, die Datei ist offen. Womit bin ich das selbst?"}, {"id": 842, "start": 7265.04, "end": 7282.44, "text": "Wait a minute. Home? Ich glaube, da ist wieder der MasterChebader am Werk. Das bin ich selbst,"}, {"id": 843, "start": 7282.44, "end": 7290.32, "text": "der die Datei offen hat. Moment. Da ist wirklich wieder der MasterChebader am Werk. Ich glaube,"}, {"id": 844, "start": 7290.32, "end": 7316.16, "text": "das ist einfacher, als man denkt. Besher C? Less? Geht da irgendwas? Be connect!"}, {"id": 845, "start": 7316.16, "end": 7319.58, "text": "DEeeeeEEEEHHHHH"}, {"id": 846, "start": 7321.06, "end": 7324.9, "text": "Okay das ist das ist gemein, das ist wirklich gemein"}, {"id": 847, "start": 7325.56, "end": 7327.56, "text": "ich bin nur drauf gekommen"}, {"id": 848, "start": 7327.78, "end": 7332.24, "text": "Weil ich zufällig hier irgendwie OpenFile.sh und sowas gesehen habe"}, {"id": 849, "start": 7335.46, "end": 7338.62, "text": "Ok das ist das ist Achiebe, das ist Richtig krasser Achiebe"}, {"id": 850, "start": 7339.62, "end": 7316.84, "text": "Das heißt im Bold"}, {"id": 851, "start": 7339.94, "end": 7345.6, "text": "Das heißt im Endeffekt eigentlich muss ich nur die Zeile aus der Bash Sahne löschen und es ist gefixt"}, {"id": 852, "start": 7345.6, "end": 7354.8, "text": "ich mal zack ok loggen wir uns aus loggen wir uns noch mal ein"}, {"id": 853, "start": 7354.8, "end": 7379.48, "text": "das war aber gemein das war wirklich gemein das ist wirklich"}, {"id": 854, "start": 7379.48, "end": 7389.84, "text": "der prozess ist jetzt dead ja ja der prozess beendet sich beim aus loggen aber ich habe"}, {"id": 855, "start": 7389.84, "end": 7397.12, "text": "ihn nicht gekillt das war aber fies also das ist wirklich das ist also ich glaube wenn du"}, {"id": 856, "start": 7397.12, "end": 7401.64, "text": "nicht zufällig daran denkst weil du die datei gesehen hast suchst du dich da kaputt"}, {"id": 857, "start": 7401.64, "end": 7416.56, "text": "an den moment power aus der kram kostet ja geld sudo power off ok nice more scenarios ok wir hören"}, {"id": 858, "start": 7416.56, "end": 7420.24, "text": "jetzt hier auf und ich guck mir hacker ich ich guck mir guck mir unix porn von euch an"}, {"id": 859, "start": 7420.24, "end": 7426.24, "text": "machen wir das nächste mal weiter an der stelle also merkt euch wir sind bis zu"}, {"id": 860, "start": 7426.24, "end": 7439.24, "text": "nummer übung nummer 9 gekommen dass man den prozess nicht töten soll auch nicht durch"}, {"id": 861, "start": 7439.24, "end": 7445.08, "text": "stand das da drin ok dann haben wir es vielleicht nicht auf die richtige art und weise gelöst"}, {"id": 862, "start": 7445.08, "end": 7454.48, "text": "ok discord ich mache kurz discord auf das muss ich leider am zweiten bildschirm machen weil"}, {"id": 863, "start": 7454.48, "end": 7460.2, "text": "hier bin ich eingeloggt aber ich kopiere mir die bilder raus jepp discord"}, {"id": 864, "start": 7468.2, "end": 7482.76, "text": "channel unix porn ok oder bin ich hier eingeloggt discord wahrscheinlich discord"}, {"id": 865, "start": 7482.76, "end": 7486.04, "text": "habe ich hier gar installiert weil ich müsste"}, {"id": 866, "start": 7492.04, "end": 7493.68, "text": "habe ich echt kein discord"}, {"id": 867, "start": 7499.68, "end": 7512.28, "text": "anscheinend nicht ok also weiter geht's"}, {"id": 868, "start": 7512.28, "end": 7516.12, "text": "dann gucken wir uns das mal an dass den ersten desktop den wir uns angucken"}, {"id": 869, "start": 7516.12, "end": 7527.64, "text": "ist vom serious max na das passt doch motte motte höchstpersönlich copy image"}, {"id": 870, "start": 7527.64, "end": 7536.28, "text": "ob ging das jetzt nicht copy link copy link muss ich machen ok"}, {"id": 871, "start": 7536.28, "end": 7542.68, "text": "du hast nicht wirklich den typ da im hintergrund oder"}, {"id": 872, "start": 7542.68, "end": 7570.24, "text": "nur für den screenshot sagst du jetzt in die bilder auch noch größer wenn man die anklickt"}, {"id": 873, "start": 7570.24, "end": 7573.16, "text": "neger oder gehen die noch größer"}, {"id": 874, "start": 7573.16, "end": 7587.64, "text": "ach so die gehen noch größer ich bin nur zu blöd hier haben wir es das ist kacke ich"}, {"id": 875, "start": 7587.64, "end": 7591.68, "text": "muss mich in discord einloggen sonst klicke ich sonst klicke ich mich da ja kaputt"}, {"id": 876, "start": 7591.68, "end": 7603.2, "text": "da bin ich da bin ich ja bin ich ja am mich drei drei tage am kopieren bis ich"}, {"id": 877, "start": 7603.2, "end": 7616.96, "text": "das hier offen habe ok also das ist hier das ist der linux desktop von unserem"}, {"id": 878, "start": 7616.96, "end": 7624.4, "text": "obermod also was hat er denn am start lasst mal gucken also ich finde farblich"}, {"id": 879, "start": 7624.4, "end": 7632.48, "text": "ist das ganze sommer sehr schick gemacht vor allem die kombination mit b top oder"}, {"id": 880, "start": 7632.48, "end": 7639.04, "text": "b top plus plus oder wie das ding genau heißt die farblich tatsächlich zum"}, {"id": 881, "start": 7639.04, "end": 7643.52, "text": "terminal passt ich könnte dir vielleicht noch einen tipp dafür geben und meine"}, {"id": 882, "start": 7643.52, "end": 7649.44, "text": "augen viel zu hell ich könnte ich könnte da vielleicht einen tipp für geben und"}, {"id": 883, "start": 7649.44, "end": 7654.52, "text": "zwar ist mir auch aufgefallen dass der guck mal du kannst den hintergrund"}, {"id": 884, "start": 7654.52, "end": 7659.52, "text": "einstellen wenn du hier auf menü gehst options du kannst sagen dass der den"}, {"id": 885, "start": 7659.52, "end": 7663.8, "text": "background nicht vom theme nimmt sondern den background von einem terminal finde"}, {"id": 886, "start": 7663.8, "end": 7668.28, "text": "ich persönlich schicker weil weil dann sich der hintergrund besser ins terminal"}, {"id": 887, "start": 7668.28, "end": 7671.72, "text": "integriert ist aber sicherlich geschmackssache aber ansonsten passt"}, {"id": 888, "start": 7671.72, "end": 7677.56, "text": "das eigentlich ganz gut finde ich finde ich hübsch schickes schickes color scheme"}, {"id": 889, "start": 7677.56, "end": 7684.52, "text": "terminal font hack ist eh allerbeste terminal font endeavor os arch by the way"}, {"id": 890, "start": 7684.52, "end": 7689.24, "text": "auch beste sway also ich sehe du verwendest wayland allerdings dann nicht"}, {"id": 891, "start": 7689.24, "end": 7693.56, "text": "in einer vm weil der vm funktioniert nicht gescheit ist das hier was ist das"}, {"id": 892, "start": 7693.56, "end": 7706.96, "text": "hier oben für eine leiste was was hast du da am start wey bar ok alles klar"}, {"id": 893, "start": 7714.4, "end": 7721.96, "text": "excellent so das hier ist der tap mit dem browser ok du hast umgedreht ich"}, {"id": 894, "start": 7721.96, "end": 7727.0, "text": "mache es immer so ich mache browser tap 1 command line tap 2 das ist aber"}, {"id": 895, "start": 7727.0, "end": 7735.84, "text": "geschmackssache ok moment habe ich doppelt aufgemacht ja und hier haben wir"}, {"id": 896, "start": 7735.84, "end": 7741.8, "text": "noch sein wishlist studio code mit selbstverständlich blazingly fast"}, {"id": 897, "start": 7741.8, "end": 7750.56, "text": "written in go und er verwendet extra extra als ls ersatz da bin ich ja nicht so"}, {"id": 898, "start": 7750.56, "end": 7754.48, "text": "richtig mit warm geworden bisher ich habe es eine weile verwendet aber ich"}, {"id": 899, "start": 7754.48, "end": 7760.28, "text": "finde immer noch raw ls beste tuner als file manager vermute ich jetzt einfach"}, {"id": 900, "start": 7760.28, "end": 7768.92, "text": "mal ja sehr schick sehr schick sieht auch alles so ziemlich aus einem guss aus"}, {"id": 901, "start": 7768.92, "end": 7773.8, "text": "also ich vermute dass es tuner ist nicht laut die los"}, {"id": 902, "start": 7773.8, "end": 7788.04, "text": "arch enjoyer ja finde ich nice so zu sagen so wenn haben wir als nächstes"}, {"id": 903, "start": 7788.04, "end": 7800.08, "text": "sink sinking face haben wir als nächstes hat leider nicht allzu viele screenshots"}, {"id": 904, "start": 7800.08, "end": 7805.9, "text": "gepostet aber ein screenshot der wahrscheinlich allen weeps unter uns"}, {"id": 905, "start": 7805.9, "end": 7825.48, "text": "gefällt also wir sehen hier ein terminal i3 vermute vermutlich i3 mit"}, {"id": 906, "start": 7825.48, "end": 7838.2, "text": "irgendeiner recht minimalistischen i3 status leiste scheinen wohl keine vm zu"}, {"id": 907, "start": 7838.2, "end": 7843.2, "text": "sein arch linux by the way was mich jetzt noch"}, {"id": 908, "start": 7843.2, "end": 7847.44, "text": "interessieren würde ist ist das der hintergrund vom terminal oder ist das"}, {"id": 909, "start": 7847.44, "end": 7851.64, "text": "der hintergrund von deinem i3 der durch terminal durchschimmert weil ich muss"}, {"id": 910, "start": 7851.64, "end": 7858.0, "text": "sagen ich für meinen geschmack wäre es ein bisschen viel transparenz im"}, {"id": 911, "start": 7858.0, "end": 7862.48, "text": "terminal also ein bisschen transparenz im terminal finde ich nice das sieht"}, {"id": 912, "start": 7862.48, "end": 7867.04, "text": "optisch schick aus aber ich also ich persönlich würde die schrift zu schlecht"}, {"id": 913, "start": 7867.04, "end": 7871.12, "text": "erkennen mit so viel transparenz hintendran"}, {"id": 914, "start": 7873.04, "end": 7877.24, "text": "aber sonst sieht doch auch schick aus"}, {"id": 915, "start": 7877.24, "end": 7881.28, "text": "es ist mir ein bisschen zu also für meinen also für meinen geschmack ist es"}, {"id": 916, "start": 7881.28, "end": 7889.08, "text": "zu zu nah am original i3 dran und ich finde original i3 sieht nicht so schick"}, {"id": 917, "start": 7889.08, "end": 7891.32, "text": "aus"}, {"id": 918, "start": 7896.96, "end": 7903.08, "text": "ok komm uns das nächste an nächste nächste kommt wieder von motge motge und"}, {"id": 919, "start": 7903.08, "end": 7907.48, "text": "zwar stripes 007 kommt als nächstes dran"}, {"id": 920, "start": 7910.84, "end": 7917.32, "text": "mit einem linux mint vermute ich mal ja sieht linux mint"}, {"id": 921, "start": 7924.4, "end": 7928.08, "text": "pinguine im hintergrund"}, {"id": 922, "start": 7928.08, "end": 7936.24, "text": "ok also b top ist an ist sehr beliebt anscheinend weil es was her macht im"}, {"id": 923, "start": 7936.24, "end": 7939.88, "text": "terminal mich würde interessieren wie viele von euch es wirklich regelmäßig"}, {"id": 924, "start": 7939.88, "end": 7949.72, "text": "verwenden und hard top vorziehen jetzt soll ich laufen es ist ein linux mint mit"}, {"id": 925, "start": 7949.72, "end": 7955.64, "text": "ist es ein i3 das ist kein i3 ist kein i3 das ist ein gnome"}, {"id": 926, "start": 7955.64, "end": 7959.72, "text": "denn ist mate ist das mateen wobei das steht doch hier irgendwo auch gnome"}, {"id": 927, "start": 7959.72, "end": 7964.28, "text": "terminal cinnamon ist es cinnamon"}, {"id": 928, "start": 7971.72, "end": 7975.24, "text": "ach das sind beide bildschirme das ist ein linker bildschirm den"}, {"id": 929, "start": 7975.24, "end": 7978.52, "text": "fotografiert hatten das ist ein rechter bildschirm jetzt verstehe ich das auch"}, {"id": 930, "start": 7978.52, "end": 7982.0, "text": "warum die taskleiste auf einmal hier aufhört ok dann suchen wir mal"}, {"id": 931, "start": 7982.0, "end": 7986.6, "text": "suchen wir mal ran aber es war so dass es irgendwie mit bildschirm passt ok es"}, {"id": 932, "start": 7986.6, "end": 7993.12, "text": "sieht sehr klassisch gnome style ich aus ok cinnamon style ich in dem fall und"}, {"id": 933, "start": 7993.12, "end": 7997.04, "text": "der eine monitor ist auch kleiner als der andere sieht aber auch ganz schick"}, {"id": 934, "start": 7997.04, "end": 8006.72, "text": "aus ist halt klassischer recht klassischer desktop also mehr desktop"}, {"id": 935, "start": 8006.72, "end": 8014.36, "text": "als ein i3 aber auch schick ich vermute aber dass das default color scheme ist"}, {"id": 936, "start": 8014.36, "end": 8020.8, "text": "hier sieht man ja auch mint dark orange und sowas also das ist halt der vorteil"}, {"id": 937, "start": 8020.8, "end": 8026.44, "text": "von sovorkonfigurierten distributionen du kannst es einfach installieren und so"}, {"id": 938, "start": 8026.44, "end": 8029.28, "text": "benutzen also der hat wahrscheinlich nicht allzu viel custom ist sieht aber"}, {"id": 939, "start": 8029.28, "end": 8034.96, "text": "trotzdem nicht schlecht aus aber nicht sagen wir haben als nächstes doch der"}, {"id": 940, "start": 8034.96, "end": 8038.28, "text": "adrian legacy"}, {"id": 941, "start": 8040.88, "end": 8044.6, "text": "aber als nächstes"}, {"id": 942, "start": 8045.76, "end": 8048.76, "text": "ok"}, {"id": 943, "start": 8053.32, "end": 8056.64, "text": "alter was das für eine font"}, {"id": 944, "start": 8056.64, "end": 8064.72, "text": "das ist doch das ist doch gemimt oder oder benutzt er wirklich die font"}, {"id": 945, "start": 8064.72, "end": 8089.68, "text": "aber das farbschema ist nicht schlecht ich glaube das ist nicht dass die"}, {"id": 946, "start": 8089.68, "end": 8096.24, "text": "fault farbschema oder sieht ein bisschen heller aus als das die fault farbschema"}, {"id": 947, "start": 8096.24, "end": 8104.4, "text": "aber der rest sieht ziemlich die folgt aus was hat er denn sonst noch"}, {"id": 948, "start": 8105.28, "end": 8113.72, "text": "dann noch einen anderen bildschirm gepostet von sich gießen es ist einer"}, {"id": 949, "start": 8113.72, "end": 8119.36, "text": "sieht man was es ist ein pop os pop os gnome ziemlich klassischer standard"}, {"id": 950, "start": 8119.36, "end": 8130.92, "text": "gnome klausur so so das ist ein pop os pop os mit gnome dark theme ok gnome"}, {"id": 951, "start": 8130.92, "end": 8133.2, "text": "terminal"}, {"id": 952, "start": 8135.64, "end": 8141.68, "text": "und das letzte sieht man so nach seinem desktop das nicht so spannend aber wenn"}, {"id": 953, "start": 8141.68, "end": 8143.92, "text": "das alles die voll ist sieht auch nicht schlecht aus wobei ich ehrlich sagen"}, {"id": 954, "start": 8143.92, "end": 8158.0, "text": "was die schriftart ist nicht so meins pop os genau pop os ist das gachi bus als"}, {"id": 955, "start": 8158.0, "end": 8164.2, "text": "nächstes haben wir tibelius tibelius hat ein ultra pepo white happy bild"}, {"id": 956, "start": 8164.2, "end": 8169.12, "text": "gepostet also das das ist mega auflösung dem sein bildschirm oder sind"}, {"id": 957, "start": 8169.12, "end": 8176.0, "text": "wahrscheinlich sogar zwei bildschirme beste so muss das sein"}, {"id": 958, "start": 8182.0, "end": 8191.84, "text": "ja ja art ok da hat er dran rum gebastelt also ein artschlinux mit gnome"}, {"id": 959, "start": 8191.84, "end": 8203.28, "text": "defaults theme defaults black box terminal habe ich noch nie gehört"}, {"id": 960, "start": 8210.08, "end": 8215.04, "text": "a beautiful getika fort terminal"}, {"id": 961, "start": 8215.04, "end": 8219.28, "text": "ok"}, {"id": 962, "start": 8225.28, "end": 8232.12, "text": "beautiful artsch by the way schicken hintergrund hat"}, {"id": 963, "start": 8232.12, "end": 8253.96, "text": "natürlich gerade unten was in rust was was ein poser und hier omer noch ein"}, {"id": 964, "start": 8253.96, "end": 8262.8, "text": "terminal aber im groß und ganzen ist es doch ein sehr schickes setup also"}, {"id": 965, "start": 8262.8, "end": 8269.36, "text": "farblich auch gut aufeinander abgestimmt vom hintergrund zur leiste"}, {"id": 966, "start": 8269.36, "end": 8276.48, "text": "oben zum leicht durchschimmernden background vom terminal wie teilt er die"}, {"id": 967, "start": 8276.48, "end": 8282.04, "text": "windows wahrscheinlich gar nicht sondern von hand oder man kann vielleicht hat"}, {"id": 968, "start": 8282.04, "end": 8285.88, "text": "gnome ja auch irgendwelche shortcuts dafür"}, {"id": 969, "start": 8288.36, "end": 8298.16, "text": "ist das mal kurz dorken was er laufen hat ok ein wine enjoyer"}, {"id": 970, "start": 8301.6, "end": 8306.4, "text": "was ist denn btm das sieht ein bisschen aus wie hardtop nur noch mal anders"}, {"id": 971, "start": 8306.4, "end": 8315.16, "text": "btm github yet another cross platform graphical process monitor"}, {"id": 972, "start": 8317.72, "end": 8324.36, "text": "irgendwann ist auch mal gut ach das ist written in rust ja dann dann ist ja"}, {"id": 973, "start": 8324.36, "end": 8337.12, "text": "alles klar das muss auch sein explorer exit ja wine stels ich finde es aber"}, {"id": 974, "start": 8337.12, "end": 8341.28, "text": "hübsch also ich finde die farbausfall gut so diese farbtöne passt das passt"}, {"id": 975, "start": 8341.28, "end": 8347.04, "text": "alles richtig gut zusammen so als nächstes kommt captain paul oder"}, {"id": 976, "start": 8347.04, "end": 8353.28, "text": "auch captain poggers genannt merkt euch das mal please wo wir stehen geblieben"}, {"id": 977, "start": 8353.28, "end": 8359.24, "text": "sind ich schreibt mir das mal auf captain poggers kommt als nächstes"}, {"id": 978, "start": 8359.24, "end": 8365.32, "text": "dran ich muss jetzt nämlich mal ganz dringend aufs klo und dann muss ich was"}, {"id": 979, "start": 8365.32, "end": 8373.6, "text": "essen dass wir machen für heute schluss und schauen das nächste mal weiter ich"}, {"id": 980, "start": 8373.6, "end": 8379.96, "text": "hoffe euch hat es gefallen chat set setke ja aber die set servers sind"}, {"id": 981, "start": 8379.96, "end": 8384.52, "text": "jetzt mittlerweile white pepo happy servers die sind glücklich dass wir uns"}, {"id": 982, "start": 8384.52, "end": 8388.56, "text": "um sie gekümmert haben und dass es jetzt alles läuft"}, {"id": 983, "start": 8390.96, "end": 8395.48, "text": "ja schön dass ihr da wart schön dass es euch gefallen hat wir machen demnächst"}, {"id": 984, "start": 8395.48, "end": 8400.32, "text": "weiter mit set servers der zweiten hälfte und gucken uns auch weiter eure"}, {"id": 985, "start": 8400.32, "end": 8404.44, "text": "desktops an vielleicht machen wir das desktop angucken das nächste mal am"}, {"id": 986, "start": 8404.44, "end": 8411.12, "text": "anfang im stream vielleicht auch gleich morgen früh oder so machen wir lieber"}, {"id": 987, "start": 8411.12, "end": 8413.92, "text": "morgen mittag falls wir noch mal streamen oder am nächsten stream dann"}, {"id": 988, "start": 8413.92, "end": 8417.48, "text": "mal gucken alles klar ich gehe jetzt was futtern leute wir sehen uns macht's gut"}, {"id": 989, "start": 8417.48, "end": 8435.24, "text": "bis dann"}]}