{"text": "Auf gehts Pogu, ich muss nebenbei ins Discord gucken, ob MMO Kreiselgrind losgeht, da mussich nämlich abhauen. Da ist er wieder. So Leute, seid ihr bereit noch für eine Rundezu gehen? Dann macht mal kurz ein Update in meiner Vm. Irgendwas stimmt auch mit meinemMikrofon nicht. Sekunde, was hat Windows da wieder getrieben? Na ja, es ist doch zumGroßteil eigentlich okay so. Ja, weiter gehts. Heute kümmern wir uns um zwei essentiellwichtige Sachen, nämlich Secrets und Let's Encrypt Zertifikate. Oder generell Zertifikatebei den meisten Leuten. Eigentlich Let's Encrypt, wenn man mal ehrlich ist. Wer gibtheute schon noch großartig Geld aus, außer mein Arbeitgeber, aber wer gibt da noch normalim Kopf ist, der gibt da noch großartig Geld für Zertifikate aus. Beziehungsweise machtsich den Aufwand dann mit teilweise noch manuellem Verlängern und sowas in der Richtung.Webminister, danke schön für den Zap. Patrick, moin. Schön, dass ihr alle am Start seid.Benutzt irgendjemand von euch noch Zertifikate, die nicht Let's Encrypt sind? Also ich weiß,bei mir auf der Arbeit haben wir noch Zertifikate, die nicht Let's Encrypt sind, weil irgendwelcheLeute der Meinung sind, es ist besser, wenn sie die immer von Hand bestellen, weil siedann wichtig sind. Ansonsten hat es keinen weiteren Sinn. So, ich mach mal kurz. Okay,läuft der Cluster noch? Nee, der Cluster ist abgekackt. Na auch gut. Ohne Mist, ichwürde für Let's Encrypt auch was bezahlen. Kein Ding? Also wenn Let's Encrypt, also ichwürde theoretisch sogar für Let's Encrypt auch so bezahlen, aber wenn die wirklich wollten,die müssten einfach nur irgendwie so paar ganz kleine Sachen vielleicht als Premiumbieten, von der Supporter-Batch im Forum bis zu vielleicht irgendwie die Möglichkeit,die E-Mails nochmal zu redirecten, die man da eingetragen hat, wobei das natürlich dannauch bis braucht werden kann. Muss man sich halt genau überlegen. Also man müsste echtviel machen, dass ich da Geld bezahlen würde bei Let's Encrypt. Ja, das hat es bei unsauch gehießen, aber das kommt meistens von Leuten, die das nicht so meinen. Also es gibtzwei Varianten, entweder die haben keine Ahnung oder die meinen das eigentlich gar nicht so,sagen es aber trotzdem, weil sie es dann nicht mehr wichtig sind. Also es gibt ja Leute, diekümmern sich hauptsächlich um Zertifikats-Handling, Zertifikats-Management, Bestellen, Überwachen,Verneuern und diese Leute sagen dann null Let's Encrypt in der Produktion. Das sagendie allerdings nur, weil sie Schiss haben, dass Let's Encrypt sie irgendwie überflüssigmacht. Ich weiß nicht, Stefan, wie war es bei euch? Oder wie schätzt du es denn ein?So, ich starte mal kurz die VM neu und wir machen mal Delete Minikube, machen wir denCluster mal kurz aus, machen hier alles zu. Wir starten jetzt nämlich den Rechner malneu, also die VM, nicht den Rechner, weil sonst wäre ja das Stream weg. Das kommt auchdazu, aber ich glaube gerade wenn es von Leuten kommt, die ein bisschen Ahnung haben, dannsehen die so ihre Fälle wegschwimmen. Also wenn die vorher was mit Zertifikaten zu tunhatten. Was ich gerade mache, ich habe gerade den Stream angemacht vor 4 Minuten. Ne, dieDiablo 4, da werde ich mal warten bis es rauskommt. Ich kann mich auch dran erinnern, die Diablo3 Beta war auch nicht übel, weil der erste Akt auch das beste am ganzen Game war. Esist ja noch nicht mal nur Zertbot. Mittlerweile ist der Mist ja schon in nahezu alles Möglicheintegriert. Du hast Caddy geprinkt, das standardmäßig mit Traffic, falls irgendjemand wirklich nochTraffic verwenden will, freiwillig. Na gut, im Containerumfeld ist Traffic wirklich ganznice, wenn man was braucht, was easy zum Setup ist. Allerdings, ich bin kein großer TrafficFan. Caddy hat es eingebaut, Traffic hat es eingebaut, alle möglichen Hoster und CloudProvenzer, alle haben es eingebaut mittlerweile. Das ist halt schon sehr praktisch. Ja, bewundertmich, ich glaube auch nicht. Nice, hat es richtig gelohnt. Moment, soll ich dich timeouten? Moment, ich time oute dich persönlich sogar. Ich weiß gar nicht wie das geht. Wieüberhaupt? Hatte man da nicht im Knopf, wenn man den Namen anklickt? Warte mal, ich binzu blöd, ich kann das glaube ich nicht mehr. Ich kann nicht bunnen, blocken, ah hier, hier,hier, time out. Nice, so, jetzt bist du getime outet. Jetzt habe ich dich wieder untime outet,jetzt bist du wieder da. Was ist denn das hier, was passiert denn da im Hintergrund gerade?The Way aktualisiert Leute, The Way. Rust, nicht Blazingly Fast aktuell. Das ist überhauptnicht Blazingly Fast. Ich mache das jetzt aus. Nochmal, nochmal neu starten. The Way.Erstmal halbes Internet runterladen, ja. Ah, okay, jetzt geht es schneller, na gut. Waspassiert da eigentlich gerade? Der lädt wirklich, das ist ja fast schon zweites Node Moduleswas hier abgeht. Ich erzähle gleich was wir heute machen wenn ein paar mehr Leute da sind.Ich muss nebenbei immer ins Discord, erinnert mich mal please mit dran, ich muss mal nebenbeiimmer ins Discord gucken ob die Leute da sind. Dann machen wir nachher noch eine Runde Kreiselgrind. Mein Gott, Rust, mach hinne, Alter. Was ist denn das? The Way, was ist das überhaupt?Das ist ein Snippet Manager für Command Line. Geht kein Mensch, Alter. The Way. Weg damit,cool. Alles klar, exzellent, perfekt. Okay, Reboot. Wir machen jetzt gleich ein neuesGitHub Repo. Ja, wir machen jetzt ein neues GitHub Repo. Für den Stream heute. Beziehungsweisewir können ein GitHub Repo machen wo wir die ganzen Sachen rein posten in nächsterZeit. Also, dann erzähle ich mal so ungefähr was wir heute vorhaben. Es ist blöd wennich das jetzt erzähle. Ich starte erstmal den Cluster wie wir das letzte Mal aufgehörthaben und dann gucken wir uns das an. Ja, geiles Notizprogramm, das haben wir jetztgebraucht. So, ich hoffe es ist alles geupdatet. Cute. Cute K8S, da sind wir. Okay, allesklar, also ich werde das mal ganz kurz zeigen, mal kurz einloggen in Shithub. Fiveheader,alles klar. Repos. Nein, das nicht, das ist mein privates, da machen wir hier. Machenwir auch Public, ist nicht wild, dann könnt ihr danach gucken was wir heute gebastelt haben.Create Repo. So, also ich zeige euch mal wo wir das letzte Mal stehen geblieben sind,dass ihr so ungefähr durchblickt was wir das letzte Mal gemacht haben und dann sageich was wir heute machen werden. Als erstes starte ich mal wieder wie gehabt einen lokalenKubernetes Cluster, bei mir auf der VM mit Minikube. Das ist nichts wo man später produktiveKubernetes Cluster mit laufen lässt, sondern das ist nur lokal in der VM zum ausprobieren.Was ich mir demnächst vielleicht mit euch mal angucken will war Talos OS. Keine Ahnungob das was taucht. Ich habe eh nicht vor im großen Stil Kubernetes Cluster selber zuhausen, aber sich so ein bisschen mit so Basics zu beschäftigen ist nie verkehrt, das hilfteinem auch wenn man Managed Lösungen verwendet, weil man dann Dinge einfach besser einschätzenkann. So, also unser lokaler Kubernetes Cluster ist am Laufen und ich applye jetzt mal dieConfig vom letzten Mal. Ich bin mir nicht ganz sicher ob das so überhaupt funktionierthat. Nee das funktioniert so nicht. Moment. Warte mal. Ich muss doch erstmal meine Passwörtersetzen oder? Ich habe doch hier so eine Datei die sich super geheim nennt. Dann löschenwir den Cluster nochmal kurz. Wir machen jetzt nochmal start.sh. Dann sollte das Ding hoffentlichden Cluster hochfahren. Und dann sagen wir kubectl applye-k und applye in unsere aktuelleConfig. Ich zeige mal kurz was wir aktuell im Cluster laufen haben. Nicht wahnsinnigirgendwie spannendes Zeug. Wir haben aktuell nur zwei Sachen laufen und zwar wir habeneinmal ArgoCD laufen und einmal eine selbst entwickelte App, die nichts anderes außerbisschen Blödsinn auf dem Webinterface ausgibt zum testen. Dazu haben wir ein paar Configsnoch angelegt. Kann ich euch zeigen. Wir haben noch ein paar Configs angelegt. So wir legeneine Namespace an für ArgoCD und ein bisschen Magic. Wir starten ein Ingress Server, quasiein Reverseproxy, dass wir uns unter ArgoCDkappaLUL.com connecten können. Ihr könnt es ausprobierenob ihr euch hinconnecten könnt. Ihr könnt nicht hinconnecten, weil ich die Domainlokaleumgebogen habe. Dann haben wir zwei Appdefinitionen für ArgoCD. Einmal es selber und dann unsereselbst entwickelte App. Ich zeige euch das Ganze jetzt auch noch mal im Webinterfacebzw. wenn man die Config Applian auf den Cluster. Das mache ich jetzt mal. Es gibt mehrereMöglichkeiten so eine Jaml-Konfigurationsdatei auf seinen Cluster zu schieben. Also es gibtgenerell mehrere Varianten so ein kombiniertes Cluster zu administrieren. Die billigste Variante,ich weiß nicht wie ich es jetzt nenne, die einsteigerfreundlichste Variante ist per Kommandozeilemit kubectl. Oder was ich witzig finde, Leute jetzt mal eine Frage. Wie sprecht ihr kubectlaus? Ich meine meiner Meinung nach steht das ja eindeutig für Kubernetes Control. Aberes gibt Leute die sprechen es nicht kubectl oder kubectl aus, sondern haltet euch festkubectl. Also Kuschelwürfel quasi, Würfelkuschel. K9S ist das beste Interface, das bringt diraber nichts wenn du den Cluster managen willst, großartig. Damit kannst du schön Sachen angucken.Ja es gibt Leute die sprechen das so aus, kubectl so. Also quasi Würfelkuschel, Würfelkuschler.Ich würde ja sagen der Chat darf sich aussuchen wie ich es ausspreche, das halte ich abernicht aus das kubectl zu nennen. Sonst gewöhn ich mich noch an diesen Blödsinn. Das istweiterhin kubectl. So also Cluster gestartet, also die einfachste Variante kubectl ist überkubectl. Da kann man alle möglichen Sachen, man kann sagen create, namespace, das Dinghat übrigens wie ihr seht auch TabCompletion. TabCompletion ist was was ich lustigerweiserelativ selten in YouTube Tutorials sehe wo es um Kubernetes geht. Ich glaube das liegtdaran dass viele Leute aus welchen Gründen auch immer die Administration von Windows ausmachen in Videos. Ich weiß nicht was die geritten hat, warum man sowas machen will. Wir benutzentatsächlich ziemlich playing Kubernetes ohne irgendwas aktuell, lokal. Die nächsten Tagemachen wir tatsächlich dann auch mal richtig was ordentliches und zwar in Google Cloud.So und man kann in seine config für die shell, kann man eintragen dass man das hier habenwill guck kubectl completion für zsh. Wenn man das hier einträgt dann hat man autocompletefür seinen Kubernetes Cluster. Und dann kann man das ganze noch aliasen und dann hat manganz kurze Sachen und hat noch die Möglichkeit ihr seht es hier schon autocomplete zu machen,also besser geht es da nicht wenn man das über Kumano-Zehler administrieren will. Aliasdass das ganze abgekürzt ist plus noch, ja was es noch gibt zeige ich euch vielleichtauch noch, aber nachdem ich den Cluster konfiguriert habe. So und der Nachvollziehbarkeit halbermacht man außer beim Einstieg eigentlich relativ wenig über kubectl direkt am Kubernetes Cluster,sondern man macht das alles in Kubernetes Manifest Dateien, das sind solche Yammels,so was hier, so eine Yammel Datei zum Beispiel, da steht dann zum Beispiel drinne leg einen,also ich könnte zum Beispiel sagen kubectl create namespace keckel, da würde er namespaceanlegen. Ich kann das allerdings auch so im Yammel definieren, das hat den Vorteil wennich das im Yammel definiere ist das halt irgendwo nachvollziehbar was passiert, ich brauchekeine komischen Skripte mit Shell Befehlen, ich kann das relativ easy auf weitere Serveranwenden, ich kann auch Sachen automatisch deployen lassen über Yammels, das ist allesüber Kommandozeile ein bisschen, ein bisschen eklig und wenn man das eincheckt auf GitHubin den Repo, sorry auf Shithub in den Repo eincheckt, dann kann man sogar nachvollziehenwer wie wo wann was dran geändert hat, also das ist eigentlich so da way wie man das heutzutagemacht, man macht natürlich trotzdem Sachen weiterhin mit kubectl, logs angucken, Portstatusangucken, Serviceadresse an was auch immer, alle möglichen Geschichten, man kann auchfalls gerade einer im Chat erwähnt hat, man kann auch K9S verwenden als Frontend für denCluster und sich dann so Sachen angucken wie IP vom Container, logs, logs vom Containerund solche Geschichten, gibt es halt da keine logs. So und wenn man so eine Konfigurationerstellt hat in Yammel, da gibt es keine so strikte Vorgabe wie man das machen muss,man kann da kann man sich jeder selbst ein bisschen überlegen wie man das ganze ebenorganisiert, also ich mache ganz gerne zumindest aktuell mal gucken wie das ist, wenn ich damal wirklich im richtig großen Stil komplett selbst konfigurieren muss, vielleicht denkeich mir da auch was anderes aus, pro installierte Anwendung ein Ordner wenn die Custom-Configbraucht und für jede App so ein Application-File hier oben im Apps-Folder. So und dann hatman hier seine Konfiguration für den Cluster und dann geht man in das Verzeichnis und sagtkubectl apply entweder minus f, da kann man dann direkt das Yammel-File angeben was manauf den Cluster applyen will oder man sagt minus k Punkt, dann wird das Customize-Fileim aktuellen Verzeichnis ausgeführt. Customize ist eingebaut in kubectl und auch in ganzvielen anderen Gruppen des Tools, damit kannst du so ein bisschen die ganzen Yammel-Dateienbundeln. Ich kann zum Beispiel sagen hier, führ mal alles aus was im Argo-CD-Ordner istund zusätzlich noch das da. Man kann da noch mehr machen, man kann auch Namespaces überschreibenin allen quasi ja darunter liegenden Ressourcen und noch viel andere ekliche Geschichtenmachen aber das lassen wir jetzt. Ich applye das jetzt mal auf meinen Cluster und danngucken wir mal ob das noch funktioniert was wir das letzte Mal gebaut haben. Ah das wirdwahrscheinlich nicht funktionieren, ja ok was auch immer. Das wird wahrscheinlich nichtfunktionieren Leute, ich weiß auch warum das nicht mehr funktionieren wird. Mein GitHubTalken vom letzten Mal ist expired. Da sollte jetzt eigentlich nix gehen. Also schauen wirmal Pots. Zumindest Argo-CD selber läuft. Secret. Initial Secret. Einmal das mal hier.Port forward in den Cluster rein. Machen das mal auf. Das einzige was wir auf unserem Clusteraktuell installiert haben ist Argo-CD. Also das einzige was wir aktuell installiert habenauf unserem Kubernetes Cluster ist Argo-CD. Argo-CD ist ein Tool was dafür gedacht istum eben solche Konfig hier aus einem Git Repo automatisch auf Kubernetes Cluster auszuführen.Also man macht dann gar nichts mehr per kubectl sondern man ändert so eine Datei, pusht dasins Git Repo und Argo-CD applyt das automatisch auf den Cluster. So das funktioniert allerdingsaktuell gerade nicht weil mein GitHub Talken ausgelaufen ist und das Ding kommt nicht zuGitHub. Das heißt ich muss mal kurz mein GitHub Talken drüber kopieren damit wir heute weitermachen können. So Clipboard aus. Chat ihr müsst jetzt leider mal kurz weggucken. Ichweiß ihr guckt auch so weg wenn ich sage aber manchmal muss man auch nur sicher gehen.Wo haben wir es denn hier? GitHub Talken. Dauert eine Minute da muss ich den Clamp drüber kopieren.Ich hoffe man sieht nichts mehr. Github Talken. Da ist es zack. Glaube das war es. Das solltereichen. Gehen wir mal zurück. Mache euch wieder an. Und ich hoffe ich habe meinen Talkenjetzt nicht geleakt. Nein ich habe nicht meinen Talken geleakt. Und selbst wenn ich meinenTalken geleakt hätte das wäre nicht so schlimm. Weil ich habe was gemacht was ich schon längsthätte machen sollen wenn ich öfter streamen und in GitHub rum klicke. Kann ich euch vielleichtauch noch mal so als Sixhead Tipp erzählen. Wenn ihr einen privaten GitHub Account habtso wie ich hier und ihr habt da einige Repos drinnen und ihr habt Talkens generiert woman Zugriff auf Repos hat wo ihr vielleicht nicht wollt dass jeder wenn ihr aus Versehenim Stream mal das Talken zeigt auf eure privaten Repos Zugriff hat dann könnt ihr folgendesmachen. Ihr könnt eine Organisation erstellen auf GitHub zum Beispiel so hier wie ich hier5header und dann erstellt ihr euch einen neuen GitHub User mit irgendeiner Fake E-Mail Adresseoder aber mit irgendeiner E-Mail Adresse irgendeiner Catch All E-Mail Adresse von einem eurer Domainserstellt ihr euch einen neuen User und gebt diesem User Zugriff auf diese Organisationdann hat und dann stellt ihr die Talkens nur mit diesem neuen User aus dann habt ihr Zugriffauf die Repos in der Organisation mit eurem alten User mit dem ihr normalerweise verwendetund mit eurem neuen User aber wenn ihr das Talken liegt kann nichts Schlimmeres passierenals dass Leute Zugriff bekommen auf die Repos in eurer Organisation und dann muss man haltsich überlegen was man da reinpusht und was nicht. Ja so siehts aus. Ok. Delete. Ich initialisieremal unseren Cluster neu und diesmal mit dem richtigen Git-Talken und dann hoffe ich zumindestdass es jetzt das richtige Git-Talken ist. Ihr habt den Blackscreen durchschaut. Shit.Jetzt ist vorbei. Blackscreen hack. Finde ich persönlich schlimmer als Blackfacing zuFasching. Oh da haben sie wieder diskutiert aber ich sag dazu nichts. Ich sag dazu nichtsdas ist eine mühsliche Diskussion. So ist das Ding gestartet. Apply. Ich hoffe es funktioniertjetzt sonst müssen wir heute anfangen ohne dass ich euch den letzten Stand zeigen kann.Ok nicht nochmal ausführen. Secret. Secret ist noch nicht da das ist ok. Get Pots wirkönnen auch K9S aufmachen und uns die Pots angucken und feststellen dass Argo CD Servergerade erstellt wird und deswegen man auch noch nicht drauf zugreifen kann. Aha dasind wir. Passwort. Port forward machen in den Cluster. Öffnen. Admin. Zack. Sign in.Update. Und. Ach das ist normal das kommt manchmal vor. Das kommt manchmal vor wennman zu oft auf GitHub zugegriffen hat. Dann gehts das geht gleich. Das wird gleich. Repositorynot found. Welches Repo nehmen wir denn überhaupt. Ich hätte ich wäre halt doof dass meineGithub Keys abgelaufen sind. Welches Repo nehmen wir denn überhaupt. Github ja. Achich hab mein privates Repo noch. Ja ne das funktioniert natürlich nicht. Wenn ich meinprivates Repo nehme. Ok dann müssen wir das mal umstellen. Und zwar. Git. Remote. Rm.Origin. Git. Remote. Add. Origin. Im neuen Repo. Und dann sagen wir Git. Push. Oh.Bridge. Genau. Git. Push. Origin. Master. Oder Main. Wie es euch beliebt. Und dannhaben wir hier den ganzen Krempel drinnen. Sehr schön. Gut. Und jetzt können wir pushen.So jetzt können wir das ganze noch mal ausführen. Unser Cluster initialisieren und hoffen dasses jetzt endlich funktioniert. Es wird wahrscheinlich auch nicht funktionieren. Weil meine App glaubeich auch in einem privaten Repo von meinem privaten Account liegt. Ja. Leider. Ne. CuteApp. Naja gut. Das ist egal. Die App kann ruhig fehlschlagen. Ich kann euch aber zeigendass es soweit alles funktioniert. Im Cluster. Weil wir machen das heute eh anders. Ihr habtja mitbekommen ich hab jetzt Probleme mit meinen Github Secrets. Dass ich die hier nicht leakeund sonst was. Wir kümmern uns heute um zwei Sachen. Einmal Secret Management in Kubernetesum Zertifikate. Aber erstmal um Secret Management. Also wenn ihr einen Kubernetes Cluster habtda werden ja da höchstwahrscheinlich entweder Infrastruktur Management Anwendungen drin laufendie Talkons, Passwörter, Usernamen und sowas brauchen damit sie funktionieren. Oder aberihr habt irgendwelche Apps die irgendwo drauf hinzugreifen müssen. Die brauchen auch Passwörter,Usernamen, Talkons und haste nicht gesehen. Und da gibt es zwei verschiedene Variantenwie man das machen kann. Wir machen das heute mit einem Secret Manager. So. Rampel ist gepusht.Apply. Recaps Wobblors. Was sieht man da? Das meist benutzte E-Mode ist Wubgasm. Allesklar. Gucken wir uns später angucken. So Cluster ist eingerichtet. Forward. Ne Secret. So unddann können wir uns angucken wo wir das letzte Mal stehen geblieben sind. Ich hoffe es funktioniertjetzt. Ansonsten machen wir einfach weiter. Local Hosts. Update. Alter. Ah Moment. Moment.Das ist das Initiale. Ich hab Probleme auf GitHub zuzugreifen. Wait a minute. Ich habdas Repo noch nicht angepasst, oder? Ich hab das Repo noch nicht angepasst. Das ist5header. 5header. Ok jetzt. Ne Moment. Was mach ich denn hier? Das hier. So. So istrichtig. Und dann auch mit dem großen H an der Stelle. Jetzt aber gut. Jetzt nochmalund dann soll es aber endlich funktionieren. Basefin 16. Very secure. Highly, highly secure.Ist schon. Achso ne das Repo nicht. Das kann ich dir zeigen. Das Secret ist hier drinnen.Da. Guck der macht hier ein bisschen Magic. Der stellt ein wie oft er GitHub abfragt undhier kommen die ganzen Secrets her. Deswegen hat es eben auch nicht funktioniert. Dassei das Ding. ArgoCD muss funktionieren damit ich mein Cluster gescheit da drüber verwaltenkann. Sonst müsste ich jetzt halt von Hand apply nochmal. Wär ja auch nicht schlimm.So. Apply. Kommt drauf an. Kommt drauf an wieviel du da drauf laufen lasst. Also so pauschalfinde ich kann man es nicht sagen. Man muss sich bei Kubernetes halt mit ganz vielen Sachendrum herum beschäftigen. Kubernetes an sich ist nicht das Problem. So das gesamte Ökosystemund die ganzen Feinheiten. Und wenn man dann vom hundertsten ins tausendste gucken mussdas ist tatsächlich ein Problem. Also Docker Compose File ist auf jeden Fall einfacherzu managen. Um Welten einfacher zu managen. Aber wenn man ab und zu mal was ändern muss.Also ein Kubernetes Cluster. Aber ansonsten kann das durchaus Sinn machen. Also ich würdejetzt nicht sagen es ist doof. Also das kann durchaus Sinn machen ja. So jetzt aber Clusterplease funktionier. Was? Wollt ihr mich verarschen? Ich hab's so angepasst. I-Fedder? Hä? Momentich applye das jetzt gleich nochmal. Ohne den Cluster neu aufzubauen. Hab ich doch irgendwienur drinstehen? Fuck genau. Ach so. Ja dann. Okay mal gucken ob es jetzt funktioniert.Ja ja forward alles gut. Ah jetzt ist schon besser. Kaum passt man das repo an ist allesgut. So und was ihr jetzt nicht gesehen habt ist. Der züngt sich jetzt automatisch alleanderen Apps rüber. Wie euch vielleicht aufgefallen ist. Also ich hab eine Root App also so eineMaster App so eine Main App in meinem Repo drinne und die holt sich aus diesem Verzeichnisalle anderen App Definitionen. Das ist quasi so die Base App selbst. Das ist meine selbstentwickelte App und das hier ist Argo CD selbst. Das hat den großen Vorteil ich zeiges euch jetzt nochmal. Das geht übrigens an der Stelle nicht. Weil ich keinen Zugriffauf das Repo hab und auch nicht auf das Repo mit dem Image. Aber das müssen wir eh fixen.Cute. Cute App. Wir machen jetzt hier nochmal für die Cute App ein Repo. Äh Public. Bämgeb ihm. Kopieren. Git Remote Rm Origin Git Add Push. Ok jetzt haben wir den ganzen Klempelhier. Ich hoffe die Action funktioniert auch. Git Tag. Ach ja gut. Minus Minus Tags pushenalles gut. So ich hoffe meine Action funktioniert. Nö die Action funktioniert nicht. Ok warumauch immer. Action. Ah weil Action. Sollte die GitHub Action nicht funktionieren jetzteigentlich. Äh ich sag da gleich was zu. Ich guck mir gleich den Chat an. Warum gehtmeine GitHub Action nicht. Muss ich vielleicht ein neues Tag machen. Tag. Version 6 oderso. Warum läuft meine GitHub Action nicht. Ach jetzt. Best Feature ever. Ok. Actionläuft. Gucken wir mal kurz in die Action rein. Ja ich muss das alles jetzt umziehenin meine Public Orga. Deswegen muss ich das nochmal ein bisschen fixen vom letzten Mal.Bevor wir heute mit der eigentlichen Geschichte anfangen können. So blub blub blub. Wo bloßist auch verkehrt. Aufwärts. Pfeilfeder muss das sein. So. Pfeilfeder Cute App. Unddann muss ich noch der Action. Rechte geben. Äh. Äh. Warum geht das nicht. Äh. Äh.Wo ist das Problem. Warum darf ich das nicht einstellen. Äh. Äh. Äh. Äh. Äh. Äh.Hä. Wo ist das Problem. External Secrets probiere ich heute aus. Ähm. Ok. Muss ich irgendwieden User wechseln. Muss ich irgendwie in den Organisations User wechseln oder sowas.Warum darf ich hier nichts einstellen. Wo ich die Secrets ablege in dem lokalen Vault.Das ist jetzt kacke. Ich brauche GitHub Actions die in die Container Registry pushen dürfen.Warum geht das nicht. Settings. Muss man da vielleicht irgendwas einstellen. Packages.Action. General. Vielleicht da drüber. Aha. Aha. Man muss es komplett für die Organisationerst mal erlauben dass das funktioniert. Alles klar. Ok. Das ist gut zu wissen. Daswar mir so nicht klar. GitHub. Pfeilfeder. Shit. Ne ne das ist nicht Premium Only. Sosind wir in der App. Gehen wir in die Settings. Nochmal in die Actions. General. Jetzt. Ok.Alles klar. Jetzt passt es. Gut. Weil unsere Actions sollten fehlgeschlagen sein und zwarmit er hat keine Rechte auf die Container Registry verbinden to push. Tja. So siehtes aus. Neuer Tag. Sollten die alten vielleicht mal löschen. Aber gut. Tags löscht maneigentlich nicht. Tags sollten eigentlich unverändert so auf immer das gleiche Cometzeigen. Aber man kann Tags löschen. Nur dass man was nicht machen sollte heißt ja nichtdass man es nicht machen kann. So und jetzt geht hoffentlich. Der Workflow für meineContainer Registry. Und dann gucke ich mir und dann gucke ich mir den Chat an. Pushdas Image ins richtige Repo. Ich hab es eben angepasst ja. Ich bilde mir ein ich hab eseben angepasst auf Pfeilfeder Organisation. Sehen wir jetzt gleich. Ach fuck. Ne hä warumnicht. Ich hab das doch eben angepasst. Ah ich hab nicht gepullt lokal. Ich hab vergessenzu pullen. Ja. Was. Ich hab vergessen zu pullen. Ok. Jetzt aber.Also wer wissen will wie man Tags pusht ist eigentlich relativ easy. Man sagt git pushund entweder minus minus du lead oder Doppelpunkt 0.0.1 zum Beispiel. Oder git push origin.So und dann kann man den ersten Tag zum Beispiel löschen. Und dann muss man allerdings auchnoch sagen dass man ihn lokal löscht weil ansonsten ist er irgendwann einfach wiederda. Dann ist der Tag weg. Aus irgendwelchen Gründen ist jetzt der GitHub Workflow nichtgelaufen. Ja Mensch was ist denn heute los. Warum geht denn das nicht. Jetzt. So. PleasePrage Chat. Wir brauchen wieder eine Runde Prage dass das funktioniert. Das letzte Malhat es auch erst funktioniert als der Chat Prage gespammt hat. Gut nice Chat. Jetzt kannnichts mehr schief gehen. Jetzt ist jetzt alles gut. Jetzt easy win easy win. Jetzt läuftes ohne Probleme durch. Alter. Was. Was hat er denn jetzt für Probleme. Repository mustbe lowercase. Das ist aber heute wirklich ein ganz schöner Akt man. Ok. Repository mustbe lowercase. Also dann 5 header so geschrieben vielleicht. So. Massive. Tolles. The bestfeature ever. Genau. So muss es heißen. Neuer Tag drauf. Es ist nicht das rechte Problem.Wir nähern uns. Wir nähern uns der Sache. Best feature ever wird gepusht. Es muss jetztgehen. So viel Prage. So viel Prage wie im Chat ist muss es jetzt einfach gehen. Übrigenswenn man das schön machen will mit GitHub Actions man kann auch die Steps cashen sodasser nicht immer wieder den gleichen Container neu neu neu bauen muss. Potato Bob dankefür den Sub. So jetzt Prage please. Ich will jetzt mal das eigentliche vom heutigen Streammachen und nicht GitHub Actions vom letzten Mal fixen. Push. Ok das ist gut. Das istgut. Nice er hat gepusht. Endlich. Poggers. Nice. Ok. So jetzt kann ich in meinem Manifesteinstellen. Hat funktioniert. Easy. So jetzt kann ich in meinem Manifest einstellen dasswir bei Qt App nicht Wuppler sondern 5 header verwenden wollen und zwar Version äh keineAhnung. Punkt 10 ist glaube ich die letzte. So. Push. Best feature ever. Beste Git commitsheute des Tages. Alles klar. Und jetzt sollte automatisch das ganze schon Applied werden.Es kann doch gar nicht sein dass das Repo nicht gefunden wurde. Jetzt hat er es. Istdoch richtig. Ach es funktioniert ja auch. Es funktioniert. Es funktioniert. So Podsbacking of image. Unauthorized. Das ist public. Das Image ist public.Das Image ist public oder oder etwa nicht. Also das Repo ist public. Da ist normalerweisedas. Nee ich brauche kein Key. Das Image. Das Image ist public. Guck. Probieren wirGit nicht geht. Alter doch. Ja wenn man das. Ich habe mit GitHub Organisation noch niewas gemacht aber normalerweise ist die Package Registry public wenn das Repo public ist unddas Repo ist public. Ok Package Settings. Change Package Visibility. Ok aus irgendwelchenGründen. Settings ist Disabled per Organisation Administrator. Glücklicherweise bin ich derOrganisation Administrator und kann das. So wo könnte das jetzt sein Packages. Nee.Nicht so hier drüber jetzt. Nee das das geht jetzt wahrscheinlich wieder nicht. Settingschanges. Da vielleicht. Hier. Ah hier alle alle bitte einmal donaten. Ach hier. Ok allesklar. Das ist so huge League dass das die öffentliche Adresse ist die ich für Donationseingetragen habe. Ok jetzt müsste es aber eigentlich gehen. Repositories Cute App wobeiich habe es doch hier noch auf. Cute App. So. Change Visibility Public. Jawoll. Jetztmuss ich mit der SMS Authentifizierung machen oder irgend so ein Shit. Nee es geht einfachso. Nice. Ok Pull. Ja Gott sei Dank man. So hat sich mein Kubernetes Cluster von alleinegefixt. Nee der ist immer noch der Meinung Image. Backoff Image. Also der Cluster solltesich von alleine fixen wenn ich ein bisschen warte. Weil aktuell hängt er im Pull Backoff also der macht es jetzt erst in drei Minuten oder so versucht er wieder zu pullen. Dasist der Prompt das ist Starship. Ja das ist Starship. So also der Kubernetes Cluster fixtsich gleich von alleine. Warum das hier sich dreht da kann ich auch gleich noch was zuerzählen das liegt an meinem lokalen Setup dass das nicht funktioniert. So wenn wir jetztlange genug warten bis der nochmal versucht das Image zu pullen dann fixt sich der Clustervon alleine. Das macht er so der versucht ein Image zu pullen wenn es nicht geht versuchter wieder ein Image zu pullen und dann macht er so einen Backoff also quasi dann versuchter für eine Minute nicht zu pullen dann für zwei Minuten nicht zu pullen dann für vierMinuten nicht zu pullen also ich weiß die genauen Intervalle ehrlich gesagt nicht aberso in der Richtung dass er nicht permanent irgendwelche Registries voll spammt mit Imagesdie es vielleicht nicht gibt. Also er müsste sich gleich von selbst reparieren oder ichkann sagen recreate Deployment das würde auch funktionieren. Also was man unter KommandoZeile sagen kann ist z.B. sowas wie Cube CTL ich glaube. Nee Ree. Wie ist es. Restart Deploymentboah weiß ich aus dem Kopf gar nicht. CTL Restart Deployment. Warum findet man da nichtgleich was. Was. Was. Deployment. Nee. Replace. Nee. Nee. Replace was nicht. Rollout. Achhier Rollout. Rollout Restart Deployment und dann die App. Das könnte man machen oderdie oder die oder die die Pods weghauen aber eigentlich sollte. Aha. Aha. Jetzt hat dasjetzt hat das gecheckt. Jetzt hat er sich selbst repariert weil er jetzt das Image pullenkonnte. Okay alles funktioniert. Anwendung läuft. Aus irgendwelchen Gründen proprogresser noch wegen dem ingress alles gut. So da kann ich euch zeigen wie die App aussiehtwenn man die aufmacht und zwar unter CuteAppKappaLull.com ich hoffe. Okay aus irgendwelchen. Ja Momentnicht nicht. Okay. Hä. Wait a minute. Ach so. Oh man ich hab mir das Ingress noch nichtan. Das muss ich unbedingt in mein Startscript reinschreiben. Sonst werde ich mich da nochoft wundern warum irgendwelche Sachen nicht funktionieren. Start. Nee. Ach so das isthier. Start. So. Okay. CuteApp. Da ist die App. Okay. Also das ist das wo wir das letzteMal. Hat jetzt nur 50 Minuten gedauert bis wir da sind wo wir das letzte Mal gewesensind. Also das ist das wo wir das letzte Mal stehen geblieben sind. Wir haben eine Installationmit ArgoCD am Start und einer selbst programmierten App die da drüber deployed wird. Nochmalganz kurz was das coole daran ist. Normalerweise administriert man seinen Cluster über KommandoZeile. Was heißt normalerweise. Eigentlich macht man das normalerweise nicht. Zum startenmacht man es oftmals. Über Kommando Zeile. Aber es ist natürlich besser wenn das ganzenachvollziehbar ist. Über YAML Files in irgendeinem Git Repo. Da hat man eine History woman nachgucken kann. Da kann man einfacher auch zurückrollen. Änderungen rückgängigmachen wenn was nicht geht. So und jetzt mal so als Beispiel was da dran ganz cool istwenn das alles automatisch funktioniert. Ich muss nichts machen außer. Also ich habeaktuell wie ihr hier seht habe ich 1 2 3 4 5 6 Backends laufen von meiner App. Stehtauch hier drin. 6 Stück. Wenn ich jetzt sage ach komm es ist Nacht. Es ist Nacht. Ich brauchegar nicht so viele. Das kann man übrigens auch automatisch machen. Da kommen wir vielleichtirgendwann auch nochmal dazu. Dann kann ich sagen ok es ist jetzt bald Nacht. Da braucheich ja nur 3. Das reicht ja. Oder sogar ich brauche ok ich brauche nur 2. Ich brauchenur 2. Weil es ist Nacht. Ist kaum Last drauf. Und dann trage ich das hier in mein Git Reporein. Gehe in mein Repo. Mache ein Comet. Push das ganze. Also ich push jetzt die Änderungwo ich hier von 6 auf 2 runter bin. Push die Änderung. So und jetzt gucken wir mal hierzu. So in ein paar Sekunden wird er jetzt auf einmal die ganze Sache. Wartet mal. Machmal so das man es vielleicht besser sieht. So in ein paar Sekunden falls ich automatischDeployment eingestellt habe. Wird er jetzt runter skalieren. Auf 2 Pods. Habt ihr gesehenich musste nichts machen. Der hat das automatisch über AgroCD ausgerollt. AgroCD hat die neuenÄnderungen aus GitHub gepullt. Hat gesehen. Aha. ReplikaZ wurde verringert auf 2. Unddarauf hin wurde es automatisch applied auf den Cluster. Und meine Pod Anzahl ist runtergegangen auf 2. So und wenn jetzt zufälligerweise. Was gibt es denn für deutsche gehypte YouTuber.Was ist denn da aktuell so angesagt. Sagt mir mal irgendeiner der da gerade angesagtist. Ich blicke nicht durch in YouTube Deutschland. Max FPS. Genau wenn jetzt zufälligerweiseMax FPS ein Video zugemacht der Apo rett bestimmt nicht. Oder ist er immer noch aus dem InsieModus wieder raus. Also wenn jetzt irgendein bekannter YouTuber zufälligerweise ein Videoüber eure App gemacht hat. Beziehungsweise über eure Website gemacht hat. Und ihr ganzviel Traffic bekommt. Dann könnt ihr sagen wir skalieren jetzt mal diagonal auf den MountEverest und sagen wir brauchen 12 Pods. Wird eingestellt. Hups. Eingestellt. Comet gemacht.Gepusht. Und gleich werdet ihr sehen. Übrigens hier das ganze ich demonstriere das mal indemich hier auf Refreshen drücke. Das ganze ohne Serviceausfall. Passt mal auf. Ihr werdetes gleich sehen. Also ich guck jetzt hat das abgerufen es skaliert hoch auf 12 Pods auf12 Backends. Und während der hoch skaliert habe ich keinen Serviceausfall. Also ich bekommedie ganze Zeit weiter meinen Service. Obwohl der grad Dinger im Hintergrund neu startet.Stoppt und erweitert. So. Wir haben das letzte Mal tatsächlich getestet mit einem HTTP BenchmarkTool. Es sind von einer Million Requests 56 verloren gegangen oder 46 verloren gegangen.Also es ist tatsächlich ganz ganz gut. Ich kann euch das ich kann. Können wir machenkönnen wir machen. Leute wir machen. Ich zeige ich zeige euch das. So wir gehen jetzt malwir gehen jetzt mal wieder runter auf drei Pods. Ich muss ich muss das Ding immer wiederauf den zweiten Bildschirm verschieben. Wir gehen jetzt mal runter auf zwei Pods. Puschendas. Warten bis das ganze Applied ist. Und dann machen wir mal einen Benchmark von. KeineAhnung hier von von zwei Minuten. Auf den auf den auf den Service. So ich warte jetzterst mal bis das ganze Applied wurde. Wobei ich kann es ein bisschen beschleunigen nehmeich hier von Hand auf Refresh drücke. So. Pots runter skaliert. Alles gut. Ihr seht essind bloß noch drei Pods am Start. Und jetzt schreibe ich hier mal wieder rein. Wir skalierenjetzt hoch auf neun Pods. Ich pushe das jetzt und dann mache ich ein HTTP Benchmark an.Und dann gucken wir mal zu. Ich lasse es jetzt. Ich lasse es jetzt eine Minute laufen. Guckenwir hier wieder zu. Na gut das oben kann ich mir eigentlich sparen. So es sind noch dreies sind noch drei. Ich mache gerade ganz viel ganz viel Benchmark im Hintergrund. So ichRefresh jetzt mal von Hand und jetzt skaliert er hoch. Jetzt skaliert er hoch auf neun Pods.Gleich ist er fertig. Alles ready alles gut. So jetzt können wir jetzt okay jetzt könnenwir eigentlich noch die Zeit warten. Warten wir mal bis zwei Minuten um sind bis der Benchmarkdurch ist. Hier unten. Und dann werdet ihr sehen wie viel von den Requests wirklich indie Hose gegangen sind. Man darf nicht vergessen ich laufe hier auf einer VM und mache denBenchmark auf eine VM. Und meine gesamte VM ist komplett ausgelastet. Also daher kannes auch ein bisschen kommen. Ich lasse es jetzt mal kurz laufen die zwei Minuten alsodie paar Sekunden haben wir jetzt noch übrig dafür. So und ich gucke mal in den Chat. AlsoPrompt ist Starship ja.Ich habe doch eben was gelesen im Chat wo ich gesagt habe da sage ich gleich was zuwas war das denn noch mal.Ne das war was anderes gewesen.Welches Secret Management probierst du heute aus? Also ich habe lokal ein Vault laufenauf dem zweiten Rechner den seht ihr nicht. Da habe ich ein Cloudflare DNS Talken drinneund ich habe mein GitHub Talken drinne. Und wir werden aus der Vault Instanz Sünden inunseren Kubernetes Cluster mit dem External Secrets Manager heißt das Ding glaube ichoder einfach nur External Secrets. Ja ist auch eine sinnvolle Sache. Muss das nichtunbedingt alles in Kubernetes jammeln machen. Aber wenn sich Argo quasi selbst managt kanndas sich dann selbst updaten. Das kann sich selbst updaten das klappt in der Regel auchohne Probleme. Es kann aber auch in die Hose gehen. Also wenn irgendwas kaputt ist zwischenden Updates und es nicht mal startet dann hast du ein Problem dann kannst du nicht mehrso einfach zurückrollen über das Web Interface. Ich meine Applying per kubectl und sowasist ganz natürlich immer noch. Es ist tatsächlich dann doof. Das heißt man könnte sich zumBeispiel auch überlegen hey man managt Argo CD nicht über Argo CD sondern man machtirgendwie mit einem Helm Chart ein Update oder ja sogar ganz von Hand. Oder noch sinnigervielleicht wenn man viele Kubernetes Cluster hat man lässt Argo CD zentral laufen nichtin jedem Cluster oder sowas sondern man lässt Argo CD einfach zentral laufen in irgendeinemnennen es mal Infrastruktur Management Cluster. Da kann dann auch gleich Prometheus mit laufenund alle möglichen Dinger. Dann hast du dann so nicht das Problem. Dann ist zumindest wennArgo CD kaputt ist außer Argo CD sonst nix kaputt. Gibt es ja verschiedene Ansätze aberja das geht und in der Regel geht das auch ohne Probleme aber es kann in die Hose gehenalso muss man sich überlegen ob das eine gute Idee ist. Ne das kenne ich nicht.Ok nice. So also Request. Leute es ist nichts. Es ist nichts. Es ist nicht ein Request verlorengegangen bei diesem Upgrade. Von einer Million Request ist nicht ein Request fehl geschlagenwährend ich meine App hochskaliert habe. Also ich glaube da kann man sich nicht beschwerenoder? Ja die Response Time ging zwischenzeitlich mal ein bisschen hoch. Aber das war es. Unddas ist halt wirklich das richtig coole an Kuba. Ne das sowas out of the box möglich ist.Das ist auch der Hauptgrund warum sowas benutzt wird. Weil du eben on the fly dein Zeug abdeckenkannst, hoch verfügbar machen, neu ausrollen kannst, super agil wie man so schon sagt geradesein kannst, kontinuierlich kleine Verbesserungen rausbringen kannst, deine App updaten kannstohne dass großartig was kaputt geht. Natürlich ist die App jetzt von mir enorm simpel. Dasist ein Web Request auf einen Endpunkt und fertig. Also da kann ja nichts großartig schiefgehen. Es ist keine Datenbank dahinter. Da muss keine Datenbankmigration gemacht werdenbeim ersten starten. Das ist äußerst simpel. Natürlich ist es in der Praxis dann nichtso simpel wie es jetzt hier aussieht. Aber man sieht dass das prinzipiell möglich ist.So und was wir uns heute angucken nachdem jetzt alles funktioniert ist folgendes. Ich machmal die Cute App zu. Was wir uns heute angucken ist folgendes. Ich hoffe ich mach mein Clusternicht kaputt dabei. Ich skaliere mal meine App wieder ein bisschen runter. Was wir unsangucken ist folgendes. Also ich brauche an dieser Stelle, nee an dieser Stelle, braucheich meinen GitHub Talken und wenn ich Zertifikate generieren will, dann brauche ich auch meinenGitHub Talken. Heißt im Endeffekt, äh nicht beim GitHub, im Cloudflare Talken. Also ichbrauche an der Stelle einen GitHub Talken und ich brauche bei den anderen CloudflareDNS Talken. Aktuell mache ich das mit den Talkens so. Die Talkens sind nicht im GitRepo drinnen, weil ich will ja mein Cloudflare DNS Talken nicht in mein Public Git Repo einchecken.Die Talkens mache ich am Anfang einmal initial per Kommandozeil in den Cluster und dann funktioniertes. Das ist natürlich nicht so der Weisheitsletzter Schluss, vor allem wenn man viele Secrets hatund wenn man Secrets hat, die sich auch ab und zu mal ändern. Muss ich dann CubeCTL machenfür jeden Cluster den ich hab, muss ich dann dran denken, dass überall im Jaml irgendwieReferenzen und was auch immer anzupassen, neue Secrets, das ist auf jeden Fall doof.So und um Passwörter, Talken und solche Geschichten in Kubernetes zu verwalten bzw. in Jaml Manifestszu verwalten, gibt es mehrere Ansätze. Es gibt einmal sowas hier. Sealed Secrets, dasist im Prinzip eine Verschlüsselung. Das heißt du schreibst deine Secrets immer nochin dein Jaml, du schreibst dein Passwort quasi immer noch in dein Jaml File rein. Allerdingsdu verschlüsselst das was hier drinnen steht und der Cluster selbst hat ein Zertifikatmit dem man das wieder entschlüsseln kann. Das ist eine ganz coole Geschichte. Wenn mandas alles 100%ig in seinen Jaml Files haben will, ist das eine ganz coole Geschichte.Wir machen heute das mit einem anderen Projekt und wir machen das heute mit dem ExternalSecrets. Und zwar ist das ein Tool, das kann man installieren in seinem Kubernetes Clusterund das kann sich dann verbinden zu verschiedenen Passwort Saves. Aktuell unterstützen die natürlichden AWS Secret Store, Google Secret Manager und Azure irgendwo, wo ist er? Und Azure Keyboard.Also natürlich unterstützen die die drei großen Cloud Anbieter, dann können sie noch IBMSecrets Manager, Achilles, das habe ich noch nie bemerkt. Vault, das werden wir heute benutzen.Yandex, ist das irgendein China-Chinesen Zeug oder? Ne, Yandex in Russen oder? GitLab Variablen,Oracle Vault, One Passwort, über Webhooks kann man das ganze machen. Von einem anderenKubernetes Cluster, Secrets Sinken, ja unterstützt eigentlich relativ viel. Wie groß war derAufwand Vault bei dir im Hintergrund aufzusetzen? Zeige ich dir, wie groß der Aufwand war. Install,Vault. Yes. Vault. Def. Ne, äh. Mode. Ne, boah, wie ging das denn heute? Def Mode.Ah ja, Vault Server Def, so rum. So, fertig, Vault läuft. Das sollte man so nicht benutzen,weil das rein in Memory ist, das unsealed ist und man mit irgendwelchen Keys rumhantieren muss,aber es ist rein lokal bei mir auf der VM, also da würde ich mir jetzt nicht so viele Gedankendrum machen. Das ist jetzt ein lokaler Vault, allerdings im Developer-Modus. Das ist nichtpersistent, es ist alles im RAM und er ist unsealed, du kannst es auch nicht speichern, also das istwirklich nur zum rumbasteln gedacht. So, und so ein Vault habe ich hier auf der zweiten VM-Laufmit ein paar Talkings von mir drin und da greifen wir heute drauf zu. Damit man jetzt auch sieht,dass das Ganze was bringt, fangen wir jetzt nicht direkt mit dem Secrets Manager an, weil ich warmit einem Secrets Manager anzufangen. Der Secrets Manager, den man nirgendswo braucht,ist ja relativ doof. Wir fangen jetzt mit Zertifikaten an. Also, an der Stelle hier,Ingress, an der Stelle seht ihr ja, habe ich ein Web-Server laufen bzw. ein Reverse-Proxy laufen,der SSL verschlüsselt ist, also der auf Port 443 lauscht und man mit HTTPS drauf zugreifen kann unddas war unter argocdkappalul.com. Aktuell sind das alles Self-Signed Zertifikate. Mario, danke schönfür den Sub. Aktuell sind das alles Self-Signed Zertifikate, das seht ihr auch, das kann ich euchauch zeigen. Geben wir mal Chrome auf, da sieht man das schöner. argocdkappalul.com, Zertifikateanzeigen, Kubernetes Ingress Controller Fake Certificate. Ich glaube, genauer kann das da nichtstehen. So, und jetzt wirst du uns angucken, wie kriegen wir da letzte Encrypt-Zertifikate rein.Dazu gibt es ein weiteres Projekt, das nennt sich Cert Manager, den gibt's da,ist auch saumäßig beliebt, wenn man das mal sucht. GitHub, Cert Manager.Warum bei Orga? Weil das das Protokoll ist zum Zertifikate ausstellen, warum die das da reingeschriebenhaben, kein Plan. Also das Projekt ist auch ziemlich beliebt, ich meine 10.000 Sterne auf GitHubsprechen da denke ich mal für sich. Wie können wir jetzt Zertifikate für unsere Sachen ausstellen?Also wir brauchen ein Zertifikat für argocdkappalul.com, aber wir brauchen noch viel eher ein Zertifikatfür Qt-App, also für unsere App. Und damit fangen wir jetzt mal an. Das heißt, als erstesinstallieren wir mal den Cert Manager. Und nachdem wir das Ganze ja über Kubernetes-Konfixmachen, machen wir das nicht über Helm direkt und machen das auch nicht über kubectl mitirgendwelchen Yammel-Files, sondern wir machen das so, dass es nachvollziehbar ist, dassjeder durchblickt, wann im Git wie was passiert ist. Das heißt wir legen hier eine neue Appan, die nennen wir einfach mal Cert Manager. Punkt Yammel. Und ich kopiere das jetzt malrüber und dann erkläre ich, weil warum soll ich das jetzt alles von Hand schreiben, ichkönnte es aus dem Kopf eh nicht, ich muss eh abgucken. Also es hat keinen Sinn, wennich sage, haha wir schreiben jetzt hier api-version-pong-dump. Ich weiß es aus dem Kopf nicht, ich kannkeine fehlerfreie Yammel-Syntax da aus dem Kopf mir zusammenwursten. So, das heißt ichkopiere das jetzt mal rüber. So sieht das Ganze aus an App-Definition. Wir müssen hierplus anpassen auf QS, das richtige repo rein machen. Und dann kann ich erklären, was drinnenpassiert. Also MMO-Kreise, Crying Ritthot, wahrscheinlich nichts, sind erst zwei Leuteda. So, also jetzt kann ich euch erklären, was passiert. Wir können uns, wir gucken esuns einfach mal, wir gucken es uns einfach mal an. Es wird jetzt gleich gesagt, es wirdjetzt nicht funktionieren, aber wir gucken es uns trotzdem an. Ich mache jetzt mal einenPush in unser Repo. Best Feature Ever immer noch. Push in unser Repo. Und auf einmal wirdjetzt, ich beschleunige das Refreshen mal ein bisschen, auf einmal taucht jetzt derCert Manager hier als neue App auf. Der wird natürlich nicht funktionieren, weil, naja,ich habe ja noch gar nichts drinne stehen. Ah, ich habe das Projekt gar nicht angelegt.Okay, das ist natürlich bescheuert. Dann müssen wir das anders machen, dann kommt das in ProjektDefault. Hat mir nichts anderes übrig. So, und jetzt müssen wir noch ein bisschen Konfixanlegen für das Ganze. Das heißt, wir machen jetzt noch ein neues Verzeichnis, nennenwir auch Cert Manager. Dort kopieren wir einmal eine Namespace-Definition rein. Cert Manager.Das Ding soll in seinem eigenen Namespace laufen. Namespaces sind, das sind quasidiese Unterteilungen im Kubernetes Cluster. Man sieht ja, ich habe aktuell vier Namespaces,Cube System, das ist standardmäßig dabei, für den Ingress, also für den Reverse Box,den Default Namespace und für Argo CD, den Namespace. Da kann man das so ein bisschenaufteilen. Da kann man zum Beispiel, könnte man eine Namespace machen fürs Monitoring,Namespace machen für irgendwelche Storage-Streiber oder so, dass es ein bisschen besser kopiertist. Es hat auch ein bisschen was später mit Berechtigungen zu tun, weil es können nur,oftmals, manchmal gibt es Ausnahmen, es können nur Sachen innerhalb eines Namespaces aufRessourcen innerhalb von dem gleichen Namespace zugreifen. Ich glaube, die einzige Ausnahmeist, dass man per DNS übergreifend auflösen kann. Aber wenn ich zum Beispiel Passwörterund sowas habe, dann ist das immer auf den Namespace beschränkt. Das heißt, ich kannnicht einfach ein Passwort in meinem Kubernetes Cluster speichern, hier in Default und dannvon diesem Namespace, von irgendeiner Anwendung in diesem Namespace drauf zugreifen. Das funktioniertnicht. Man sollte es vielleicht auch nicht übertreiben mit Namespaces. Die Diskussion,ob man Environments als Namespaces abbildet oder ob man Environments besser als eigeneCluster abbildet, kann man sich darüber streiten, hängt, denke ich, am Ende davon ab, wie gutwill man es wirklich trennen und wie viel Geld hat man übrig. Also will man für das Live-Systemeinen eigenen Cluster haben und für das Test-System einen eigenen Cluster haben oder sagt man sichscheiß drauf, wir machen das alles in einen Cluster, dann halt in einem unterschiedlichenNamespace. Muss man sich überlegen. Das gibt es auch, würde ich sagen, gibt es pauschalnichts, wo man sagen kann so und einzig wahre Sache. Ich schreibe mein Continuing, ich kanndas nicht schreiben. So. Jetzt hat mich Discord gerade abgelenkt. Wo sind wir stehen geblieben?Wir wollten uns als Third-Manager konfigurieren. Ich glaube, jetzt passt das. Also das Dingbraucht einen eigenen Namespace. Das ist schon mal ganz sinnvoll, dass der Third-Managerim eigenen Namespace läuft. Gut, dann müssen wir den Third-Manager konfigurieren. Das istrelativ simpel an der Stelle. Und da muss ich jetzt gucken, dass ich nichts leake, aberich glaube, es passt. Ja, nee, ist okay. Nix drinne. So. In die Third-Manager-Definitionmuss ich jetzt mal gucken, was ich hier anlegen will. Das ist die Konfiguration für Let'sEncrypt, dass ich Let's Encrypt-Zertifikate ausstellen kann. Ich lege hier einen Cluster-Issueran. Warum das so heißt? Weil die Third-Manager-Leute gedacht haben, das muss so heißen. Ein Cluster-Issuerist eine Ressource im Kubernetes-Cluster für den gesamten Cluster. Das heißt, dieist nicht Namespace gebunden. Sie selbst gehört zwar zum Third-Manager-Namespace, aber siekann benutzt werden, weil Cluster vorne dran steht, aus dem gesamten Cluster. Das heißt,es kann jetzt jede Anwendung in diesem Kubernetes-Cluster nachfragen beim Let's Encrypt Cloudflare DNS-Cluster-Issuer.Bitte gib mir doch mal ein Zertifikat. So. Und damit der funktioniert, brauche ich einenAPI-Token für Cloudflare. Wo wir jetzt genau bei dem Problem sind, wo kriege ich diesesAPI-Token her? Das API-Token liegt in meinem Vault. Die verbinde ich den Vault mit Kubernetes.Wir richten jetzt erstmal den Third-Manager noch ein. Brauche ich noch irgendwas? Alter,was habe ich denn hier für Magic gemacht? What the fuck? MonkaS, was ist das? Was habeich denn da gebaut? Egal. Ich Copy-Paste das jetzt einfach mal rüber. Wir müssen den Third-Managernoch installieren. Und das machen wir mal raus. Muss nicht jeder Pod Internetzugriffhaben, um ein Zert anzufordern? Nein, muss nicht. Also ist standardmäßig so. Oder wäreso, wenn das Routing stimmt, muss nicht. Der Pod geht zum Cluster-Issuer und der Cluster-Issuerläuft im Hintergrund und macht das. Es reicht, wenn der ins Internet kommt. Der Pod selbermuss nicht ins Internet kommen. Das ist gerade Sinn und Zweck der ganzen Übung. Oder eineder Übungen. Also der Pod selber muss nicht zwangsläufig ins Internet kommen. So, ichglaube, das passt jetzt soweit. Jetzt können wir das installieren. Und wir gehen schonmal her und stellen für unsere App ein, dass die erreichbar sein soll. Und zwar übercuteapp.com. Wunderbar. Nicht argocdls, cuteapp.tls. Jetzt commenten wir das Ganze. Und dann hates schon gecheckt. Er hat es schon kapiert. Guck, er hat erkannt, ThirdManager ist am Start,die cuteapp muss sich refreschen und ThirdManager wird im Hintergrund installiert. Ohne, ohnedass ich was machen muss. Was hat er jetzt für ein Schmelz? Ach so, genau. ThirdManagerkann nicht installiert werden. Richtig. Weil... Okay, die Fehlermeldung ist ziemlich pepega.Aber weil das Secret nicht stimmt. Also dieses Secret, was ich im ThirdManager eingestellthabe hier an der Stelle, das Cloudflare-Talken, das gibt es noch gar nicht im Cluster. Alsodas wird nicht klappen. Deswegen sagt er auch hier, ich bin kaputt. Kommen wir mal angucken.Startup, bla, funktioniert nicht. Man kann mal gucken mit Certificate-Requests. Aber mansieht, für Argo CD gibt es schon ein Certificate-Request. Der wird allerdings nie bearbeitet werdenkönnen, weil das Talken für Cloudflare, für den Cloudflare-DNS ist ja noch gar nichtda. Auf geht's. Das heißt, wir müssen jetzt mal gucken, wie kriegt man... Übrigens selbstwenn ich, ich sag's jetzt gleich mal, selbst wenn ich mein Cloudflare-Talken leaken sollteist es nicht schlimm. Ich hab das gescoped auf meine Absender-IP. Das heißt, ihr könntnoch nicht mal darüber großartig was machen. Es sei dann, ihr kommt über meine Absender-IP,die ihr nicht habt. Ach stimmt, man kann auch... Ja, du hast recht. Irgendwie denke ich da nichtdran, weil ich hab das meistens schon so in der History, da ich an der Stelle einfachnur noch Complete drücken muss. ThirdManager ist installiert. Allerdings, wie gesagt,funktionieren kann das Ganze noch nicht. Qt-App ist am Start. Juna möchte auch TLS haben.Damit das Ganze funktioniert, muss man noch ein paar Sachen hinzuschreiben. Wie gesagt,neben dem, dass das Talken fehlt, kannst du uns denn den Scope mal zeigen? Was füreinen Scope? Von was? Den Quickscope? Du meinst also quasi den...Wo hab ich denn den Sound? Man, jetzt wenn man ihn braucht, finde ich ihn nicht. DenScope? Ich hab keine Ahnung, was du wissen willst. Also das ist alles bei mir nur lokalaufgelöst. Da kannst du externer nichts ausprobieren. Hat er mal das andere jetzt auch schon angefragt?Nee. So, also wo sind wir stehen geblieben? Also uns fehlt einmal das Token für den Zertifikatmanager,das ist noch nicht drinne. Und es fehlen auch noch ein paar Annotations, dass der Zertifikatmanagerüberhaupt checkt, dass er hierfür zuständig sein soll. Da muss man Folgendes machen, dasCopy-Paste ich mir auch raus, weil aus dem Kopf kann ich den ganzen Krempel auch nicht,muss man noch zwei Annotations setzen bzw. eine, die essentiell ist. Und zwar gucken,wo ich die hab. Hier, Metadata Annotations muss man setzen. Zwar da, das da nicht, dasda muss man setzen. Das heißt, hiermit sagt man dem Zertifikatmanager, du bist dafürzuständig. Guckt mal da rein, was dafür auszahlt und stell dafür ein Zertifikat aus. So undwenn ich das jetzt pushe, dann sollte der Zertifikatmanager zumindest denken, dass er dafür zuständigist. Kann auch sein, dass er kaputt ist wegen dem Token. Ok. Guck, er hat versucht das Ganzeanzufordern, aber es hat nicht funktioniert. Man sieht jetzt aus, es gibt jetzt zwei verschiedeneZertifikatsrequests, aber geht nicht. Das eine schon vor 4 Minuten, das andere vor 13.Das heißt, ich muss irgendwie dieses blöde Cloudflare Token da reinbekommen, dass dasfunktioniert. So und das machen wir jetzt mit dem External Secrets Manager. Das heißt,es gibt nochmal eine neue App. Diesmal für External Secrets. External Secrets.Copy Paste stellst du am Start. Du hast Sicht-Services, um dich selbst zu verwalten. Ja. Deswegenlohnt sich das auch für kleine Sachen nicht. Wenn du irgendwas kleines hosten willst, vmbei Hetzner und fertig aus. Neues Repo anpassen, fertig. Projekt Default muss sein. Ich habdas andere Zeug nicht hier. Ok, das ist alles gut so. Dann legen wir noch ein Verzeichnisfür die anderen External Secrets. Da muss jetzt noch ein bisschen Konfiguration rein.Das ist der letzte Service, den wir konfigurieren müssen. Danach können wir einfach alleshinzufügen. Das da rein copy pasten. Weg damit. Also wir wollen External Secrets installierenin Version 0.81 von dieser Quelle in diesen Namespace und alles ist gut. Und dann brauchenwir noch eine Konfiguration, damit man sich oder damit sich der External Secrets Managerzu meinem lokalen Vault verbinden kann, den ich bei mir lokal laufen habe. Vault.yaml unddas sieht so aus. Hier läuft der Vault und für den Zugriff auf das Vault braucht erauch wieder ein Token. Das heißt einmal am Anfang, wenn ich den Cluster boote, einmalmuss ich den Token hinterlegen. Da komm ich nicht drumherum. Aber es reicht, wenn ichdas Token hinterlege für meinen Passwort Manager, aus dem ich dann alle anderen Tokensholen kann. Ich meine irgendwie komme ich nicht gut. Ich meine ich könnte wahrscheinlichauch einen Passwort Manager nehmen, der nicht Passwort geschützt ist selber, aber das istdann ein bisschen fragwürdig natürlich, ob das dann unterm Strich so sinnvoll ist. Ichmuss jetzt einmal initial in meinen Kubernetes Cluster das hier noch reinpushen und zwarim Namespace External Secrets ein Secret anlegen Key mit einem, Key ist ein bescheuerer Nameeigentlich. Man könnte es auch besser nennen. Cloudflare zum Beispiel könnte man das nennen.Wobei Cloudflare kann man das nicht nennen. Das ist doof, wenn ich Cloudflare nenne, weilCloudflare nenne ich das Target Secret dann. Ich nenne es einfach mal Keys. Und da drindrunter dann ein Schlüssel, der sich Token nennt. Da kommt das ganze rein. Gut, alsojetzt muss ich das ganze Copy Pasten. So, das dürft ihr übrigens alles sehen. Das istnicht geheim, weil das ist eh bei mir lokal. Also nicht wirklich schlimm. Ich muss jetztnoch mein Token rüber kopieren für den Zugriff auf meinen lokalen Passwortmanager. Zack,leaked. Namespaces External Secrets not found. Ah, ja, weil ich es nicht installiert habe.Dann gibt es hier noch eine Namespace Definition. External Secrets. Alles klar, alles klar. Push.Gut, dann gucken wir erstmal, dass das ganze installiert wird. Refresh die ganzen Apps.Hopp, da ist sie. Das ist halt sehr praktisch mit ArgoCD. Du musst einfach nur eine Apphinzufügen oder eine App Definition hinzufügen und zack ist der Kram auf dem Cluster applied.So, out of sync. Ja, geht nicht, weil failed Webhook und hast du nicht gesehen. Ja, ichweiß, dass der Webhook failed ist, weil naja, das Token ist nicht drinnen. Aber jetzt kannich das hinzufügen. External Secrets created. Jetzt sollte das alles sich gleich von alleinefixen. Hoffe ich mal. Bin ich mal gespannt. Out of sync. Ah, kommt mal, External Secrets.Hat funktioniert. Der ist schon mal grün. Ja, jetzt fehlt eigentlich, guck mal, das hatsich jetzt alles gefixt. Jetzt fehlt eigentlich noch die App. Das Zertifikat ist allerdingsnoch nicht da. Es hat auch vor 5 Minuten angefragt, da war das Ganze noch nicht drin. Mal gucken,ob er das von alleine checkt. Da bin ich mir gar nicht sicher, ob er das von alleine kapiert.Ich habe aber noch gar keine Definition für das Zertifikat angelegt. Moment, Sekunde,brauche ich das? Cloudflare? Ja, ich muss, ich muss, ich muss ja noch anlegen, dass dersich zu Cloudflare verbinden soll. Das habe ich ja noch gar nicht gemacht. Also mein Zertmanagerkann sich noch nicht zu Cloudflare verbinden. So, das heißt, wir müssen jetzt im Zertmanagersagen, dass der gefälligst mal auf das Cloudflare-Token zugreift bzw. erstmal das Cloudflare-Tokenals Secret überhaupt anlegt und das soll er sich über den external Secret-Manager holen.Und das funktioniert folgendermaßen, ich mache hier nochmal eine neue Datei, Secrets,Zertmanager, Secrets und das kann man dann so definieren, dann sagt man ihm, guck mal,hier zum Cluster-Secret-Store, der Cluster-Secret-Store, der wird hier angelegt und connectet sichzu meinem Vault-Backend und aus dem Cluster-Secret-Store holt ihr das Cloudflare-Token und erstelltein neues internes Kubernetes-Secret mit dem Namen Cloudflare und einem Key-Token.Also man kann hier drin auch quasi so eine eigene Config zusammenbauen mit vielleichtaus verschiedenen Secrets, falls die jeweilige App das braucht.Dann committen wir das Ganze mal und wenn wir jetzt Glück haben, dann sollte sich in2-3 Minuten alles erledigt haben von alleine und ich sollte ein Zertifikat haben.Noch kein richtig echtes gültiges Zertifikat, Cloudflare.de Domains, da bin ich sofortdabei. Also noch kein richtig echtes gültiges Zertifikat,weil ich habe Cloudflare hier, wie ihr seht. Let's Encrypt habe ich ja Staging drinnen,das ist die Let's Encrypt-Stelle zum Testen, weil man hat ja nur gewisse Limits in derWoche für Let's Encrypt, die man benutzen kann. Ich habe eigentlich gehofft, der machteine neue Anfrage für das Zertifikat, macht er aber nicht, natürlich doof.Jetzt weiß ich nicht, wie ich das gescheit regelt, dass der Cert Manager nochmal nachguckt.Also der Cert Manager hat zumindest nicht gecheckt, der Cert Manager hat nicht gecheckt,dass er ein neues Zertifikat anfragen soll. Das ist natürlich doof, wir können auchmal in die Logs rein gucken, Logs, Namespace, Cert Manager, Cert Manager, hier was machter? Error, get in Cloudflare's Secret, Secret Cloudflare not found, okay, get secrets,übrigens die secrets die werde ich nicht anzeigen, denn ansonsten habe ich ein Problem,das Cloudflare's Secret ist doch, das Cloudflare's Secret ist doch da, alles gut, ah im NamespaceCert Manager, okay da ist das ja, da ist es falsch, das muss in, nee Moment, nee im NamespaceCert Manager ist das richtig, Error, get in Cloudflare's Secret, Secret Cloudflare notfound, da ist es doch, hä, jaja es ist angelegt, alles im Vault, not found, aber warum nicht,da ist es doch, es ist im Cert Manager Namespace und der Cert Manager meint, das ist nichtda, ah Moment, das ist 19, Moment, Moment, das ist vor, das war vor 4 Minuten, wir habenes hier eben auch erst updated, wir haben es hier eben auch erst updated, ah, es funktioniertalles, man muss einfach nur ein bisschen warten, guck, DNS-Record, Qt-App-Capa-Lul-Not-Yet-Propagated,das dauert jetzt ein bisschen bis der Authentifizierung für Let's Encrypt gemacht hat über DNS,aber in paar Minuten oder bald, bald sollte, sollte es da sein, Certificate Requests, nochnicht, noch nichts zu sehen, wenn Ready True da steht, True 0W, dann weiß ich, es hat funktioniert,es kann durchaus mal 2-3 Minuten dauern, ah, not yet propagated, bla bla bla, wir wartenjetzt bis das Zertifikat da ist und dann zeige ich euch, Qt-App, da ist es, Qt-App-Capa-Lul,ja, ist ja gut, man, so, ihr seht, noch ist das alte Zertifikat da, ne, da ist es schon,staging Let's Encrypt hat funktioniert, True, in dem Moment, wo ich es ausprobieren wollte,also er ist jetzt zu Let's Encrypt, da habe ich den Zertifikat ausgestellt, das ist diestaging, also die Testumgebung von Let's Encrypt, das habe ich absichtlich gemacht, weil ichansonsten in irgendwelche Limits laufen würde, ich kann es euch mal zeigen, dass es wirklichecht funktioniert mit dem echten Zertifikat, ja, sodass ich nicht so sehr in meine Limitslaufen darf, das heißt, wir ändern das ganze mal, ich gehe jetzt hier wieder rein, wo ichden Clusterissuer definiert habe und sage, ok, von welchem Server sollst du dir die Zertifikateholen bei Let's Encrypt, aktuell haben wir das Staging drinne und ich habe ehrlich gesagtkeine Ahnung, ob das die richtige URL ist, wahrscheinlich einfach Staging raus, oder,ok, einfach Staging raus, so und jetzt holen wir uns mal ein Zertifikat, ich hoffe, derrefrescht das jetzt, wenn ich es an der Stelle ändere, müsst ihr eigentlich, jetzt gehenwir auf das Live Let's Encrypt, also auf geht's, Push, jetzt gehen wir auf das Live Let's Encrypt,ich refresche mal, dass es ein bisschen schneller geht, ok, ne, das juckt dir nicht, wenn mandas da refrescht, ja, wie, ok, das habe ich noch nicht gemacht, wie kann man ihm jetztsagen, please ein neues Zertifikat ausstellen, oh, was, URL ist falsch, fail to retrieveorder, oh, ist das falsch, Moment, Cert Manager Let's Encrypt URL, wie ist denn die richtigeURL, oder, Let's Encrypt URLs, was ist die Let's Encrypt URL, ja, aber ich bilde mirein, das habe ich doch, habe ich das nicht, äh, sieht ziemlich gut aus, vielleicht ohneDirectory hinten dran, gibt's da, gibt's, ups, da gibt's doch bestimmt Cert ManagerExample mit Let's Encrypt, kann doch nicht so kompliziert sein, muss doch schon irgendjemandvor mir gemacht haben, ja, ja genau, von dem will ich das jetzt wissen, ne, ist doch, istdoch richtig, ist doch alles richtig, was hat er für Schmerzen, war doch, ist doch alles,ist doch alles gut, selbes Secret, ja, das ist ja nur das Secret vom, vom, vom DNS, äh,das kann sein, dass ich das, dass ich das noch ändern muss, das kann sein, dass erdas gecached hat und das deswegen nicht funktioniert, das wäre vielleicht, vielleicht möglich,keine Ahnung, gucken wir mal, das Problem hatte ich so noch nicht, Refresh, na gut,das, äh, ich glaube, ich glaube jetzt hat er's gecheckt, ja, das ist glaube ich besser,deswegen, so und wie kann ich dem jetzt sagen, dass er das Zertifikat neu ausstellen soll,also das sieht jetzt schon mal besser aus, ich hab jetzt ja, das, das hat's dir ja sonormalerweise auch nicht, dass da einfach mal die, ähm, Zertifizierungsstelle für schonbestehen, ich mein, ich könnte die URL ändern, das ist vielleicht nicht so, nicht so geil,das machen wir jetzt aber mal, weil, vielleicht muss man auch einfach nur ein bisschen warten,das könnte natürlich auch sagen, ah ja, ok, alles gut, ah nee, jetzt holt er fürArgo CD eins, ah gut, dann, dann warten wir doch mal ab, ob das, ob das funktioniert,gucken wir mal, dann kann ich Argo CD gleich mit einem echten, mit einem echten Zertifikataufmachen, wir müssen auf jeden Fall noch eine Sache eintragen und zwar, Annotationssollten da noch, ach nee, hab ich schon, hab ich schon, ach deswegen geht das jetzt, so,Error, not yet propagated, ja, blablabla, mach hinne, welche Distro würdest du zum Umsteigenempfehlen, habe bisher nur Erfahrung mit Debian-Servern, na ja, wie wär's mit Ubuntu?Error, was ist denn jetzt für ein Problem, Key-ID-Header-Contain-Invalid-Account-Ul,hä, irgendwas hab ich da verkehrt, verkehrt reingepastet, das ist die falsche URL fürLet's Encrypt man, keine Ahnung, was der für Schmerzen hat, aber das stimmt doch,muss man das vielleicht Quoten oder so, nur für den Fall der Fälle, DNS Error AcceptingChallenge-Invalid-Account-Ul, okay, keine Ahnung, kein Plan man, Key-ID-Header ist Invalid-Account,irgendjemand im Plan was der für Schmerzen hat, ich hätte jetzt eigentlich gerechnetdamit, das geht einfach, weil wenn, wenn über Staging das funktioniert und ich die Url austausche,dann würde man erwarten, dass es für Produktion auch geht, also fürs Produktive Let's Encrypt,ist die URL vielleicht doch falsch, es muss doch irgendwo ein Cert Manager Let's EncryptExempel geben, kann doch nicht sein, irgendwas Aktuelles halt, irgendwas aus dem letzten Jahr,Let's Encrypt, Staging, so schlau bin ich auch, ich will es ja nicht für Staging, das hatte ich ja schon,gibt es das vielleicht auch mal ohne Staging das Beispiel, ja Digital ist das beste, washabe ich verkehrt gemacht, keine Ahnung, ich ändere jetzt, okay ich probiere jetzt mal das aus,ich ändere jetzt die URL für meine App, das ist jetzt CuteApp-Prot und das heißt auch MinusProt-TLS, push, dann schauen wir mal ob das funktioniert, weil ansonsten wüsste ich echtnicht mehr, was er noch für Schmerzen hat, das sieht gut aus, hier Digital Ocean,haben wir noch da bestimmt, ist doch genau das, Moment, ist doch genau das was ich verwende, istein Bug ja, das kann tatsächlich sein, dass der denkt das ist der alte, jedenfalls doof,dass es nicht funktioniert, aber jetzt habe ich den neuen Domain, also mit der muss es jaauf jeden Fall funktionieren, CuteApp-Prot, okay das ist das ist soweit, okay CuteApp-Prot,gut, das ist in Ordnung, so in 1-2 Minuten sollte er jetzt ein gültiges Zertifikat haben, schauenwir mal ob das so ist, jetzt bräuchte man so ein Tail oder sowas, okay, not yet propagated,ne Anführungszeichen sind es eigentlich, ich habe die extra drum gemacht, das sollte inJaml an der Stelle keinen Unterschied machen, hat funktioniert, hat funktioniert, CuteApp-Prot,ach ich habe oben vergessen anzupassen, Lul, push, aber man sieht einen Vorteil davon schon,es ist alles nachvollziehbar, das ist halt wirklich nice, ich muss nichts per CubeCTLoder sonst was machen, es wird alles automatisch Applied ausgerollt auf mein Cluster, ich beschleunigedas ganze jetzt halt mal ein bisschen, es wird alles automatisch ausgerollt auf mein Clusterund das ist natürlich cool, so jetzt sollte es eigentlich schon gehen, Pester geht, so und jetztwird euch vielleicht was auffallen, ich habe ein gültiges Let's Encrypt Zertifikat, also es hatfunktioniert, Verified Let's Encrypt, echtes gültiges Zertifikat, nicht Self-Signed, nichtStaging, sondern richtig echtes Zertifikat, was in jeder Browser akzeptiert und das kann ich jetztfür jede App anfordern lassen in der Config aus meinem Kubernetes-Klasse, also wenn ich jetzt hiernoch 15 andere Apps reinpappe, dann muss ich einfach so einen Eintrag hier rein machen und schon kriegenich ein Zertifikat ausgestellt über den Certificate Manager und haben ein gültiges TLS SSL HTTPSZertifikat, so wir machen jetzt noch mal das andere, wundert mich nämlich, dass es mit ArgoCDnicht richtig funktioniert, guck mal hier CR, CR, All Namespaces, True, False, wir löschen es jetzt einfach mal,hier Delete, habe ich glaube ich noch nie gemacht, CR, wie löscht man das eigentlich, Namespace,achso okay einfach so, alles als Helm-Chart bauen, nee warum, das ist doch so übersichtlich genug,da brauche ich doch keine Helm-Charts für, bin ich der große Helm-Freund ehrlich gesagt, vielleichtkommt noch irgendwann das große Aha-Erlebnis, wo ich sagen würde, ja unbedingt, aber ich denke mirhalt die meisten Sachen zusammen bundeln kannst du mit Customize machen und sobald man Logik brauchtund Templates braucht, da finde ich Helm jetzt auch nicht so wirklich nice, ich meine du kannstdas damit machen, aber es ist halt diese komische Go-Template-Syntax, dann würde ich, wenn ichwirklich was kompliziertes machen will, dann würde ich wahrscheinlich sogar lieber sowas verwendenund das in einer ordentlichen Programmiersprache erstellen, meine Manifests, da kann ich nämlichwirklich alles machen, wie ich will, aber das ist ein bisschen Philosophie-Frage, das ist ein bisschenRichtung Pulumi versus Terraform, die einen sagen ja klar Easy Terraform Beste reicht für alles unddie anderen sagen ja ein bisschen Programmiersprache, Logik drumherum war auch nicht verkehrt.Fordert er jetzt das ganze noch mal neu an oder muss ich noch irgendwas machen?Wer hat das eben vorgeschlagen mit CR löschen und alles ist gut?Muss ich jetzt noch irgendwas machen, dass er das noch mal anfragt?Ich hätte jetzt, guck mal hier, wenn ich jetzt sage Argo CD Kappa Lull, dann ist immer nochdas Self-Sign-Zertifikan am Start. Ich weiß es gibt für Third Manager einCommando Sign Tool, um sowas zu machen, aber man muss es ja auch irgendwie im Plaster anfordernkönnen und das ohne, dass ich das lösche, ist ja doof, wenn ich das jedes mal löschen muss.Argo CD TLS habe ich gelöscht, muss ich das Zertifikat selber vielleicht noch löschen?Request habe ich schon gelöscht, Zertifikat, das können wir löschen, ok, das muss ichvielleicht löschen, dass das dann checkt. Jetzt funktioniert es, ok, jetzt haben wirdas Zertifikat selbst, Blablabla. Was? Ok, jetzt sollte es funktionieren.Jetzt müsste es gleich funktionieren, hol mal aus Argo CD Kappa Lull, noch ist es dasfalsche Zertifikat, noch ist es das Fake Ingress Zertifikat, Watch. Ich hoffe, dass der Kramgleich auf True springt, True Lull W, wenn es Propagated ist. Ich meine, ich habe dasZertifikat gelöscht, ich habe den Zertifikat Request gelöscht, eigentlich sollte er jetztein neues Zertifikat anfragen, aber noch ist es das alte, vielleicht wird es sonstnoch irgendwo gecasht, kein Plan. Zumindest für unsere App hat er schon mal, ach jetzt,True, True, aber hier ist noch das alte. Ok, er hat jetzt ein gültiges Zertifikat,aber er liefert noch das alte aus, warum? Oder ist das ein Firefox Ding? Ah easy, funktioniert,alles gut, Firefox hat es gecasht, ok, alles gut, in Chrome sieht man, dass es funktioniert,guck, zack, gültiges Zertifikat, Connection ist secure, vertraut und das ganze ist ausgestellt,Argo CD Kappa Lull, Let's Encrypt, so muss das sein, wunderbar. So, jetzt kann man dasvielleicht noch ein bisschen in der Handhabung angenehmer machen, indem wir jetzt zum Beispieleinen zweiten Cluster Issuer definieren, den man, na komm, scheiß drauf, also ich hab euch,ne, das machen wir nicht, das machen wir nicht, weil aus dem Grund, ich stell das um, auseinem ganz praktischen Grund, ich hab keinen Bock, dass ich jetzt den Cluster ein paarmal neu aufsetze und neu starte und ich mein wöchentliches Let's Encrypt Kontingent damitirgendwie voll mache, da hab ich wirklich keinen Nerv drauf, deswegen, ich tu einfachso, als wäre das echte Zertifikate, ich hab euch jetzt gezeigt, es funktioniert, ja,es gibt richtig echte, gültige Zertifikate und das funktioniert und die Browser vertrauendem, aber ich stell's wieder um hier auf das Staging Area, da gibt's gar keine Probleme.Push, gut, dann hätten wir das an der Stelle eigentlich schon, was haben wir gemacht, wirhaben Zert Manager installiert und wir haben External Secrets, Private Key Secret Ref,ja, stell was so um, so und jetzt können wir per External Secrets auf unseren Passwortvon Vault zugreifen, dort Tokens, Username, Passwörter auslesen und mit Zert Manager Zertifikateausstellen für alle Services im Cluster, so, das war's jetzt im Prinzip, was man großartigselbst konfigurieren muss, das weitere Zeug kann man eigentlich mehr oder weniger so installierenoder eben Apps drauf hosten, wir haben jetzt die grundlegenden Sachen da, das nächsteMal können wir uns noch eine Runde Monitor, wobei, ich mein, es ist noch Zeit, wir könntenjetzt auch noch ein bisschen, wir könnten irgendwie mal so ein Prometheus Stack reinpushen, wobei, nee, Prometheus drauf zu hauen ist wirklich abfuck, bis das läuft, ich mein,wir können's probieren, vielleicht geht's auch, soll man noch probieren Prometheus draufzu hauen für Cluster Monitoring, ich hab fertige Manifests dafür, wo ich eigentlichnur Copy Paste muss und wir uns das Ganze angucken können, aber es hängt halt einiges dranund das ist ein bisschen blöd, also zum Beispiel, wenn ich Grafana installieren will, ne, CheckMK will ich jetzt grade nicht machen, okay, wir probieren das mal, also wir machen eineneue App, in dem Fall Grafana.YAML, ich Copy Paste das mal und dann erzähl ich was zu,wir müssen eh ein paar Sachen anpassen, so, wir installieren jetzt Grafana, wir installierenhier einfach nur Grafana, wir installieren den Kubernetes Prometheus Stack, der bestehtaus einem Prometheus, aus einem Grafana, aus irgendeinem Loki Endpunkt, aus zig tausendZeug, vergiss es, so, Loki schmeißen wir raus, das werd ich jetzt nicht installieren,Grafana Services lassen wir so stehen, wie es ist, Project wird Default, das reicht,ansonsten der Rest passt, glaub ich, so und das hier geht auch noch nicht, weil Prometheusist ein Monitoring System, das heißt, das braucht Storage logischerweise und es gibtnur ein Plugin, das würd ich normalerweise jetzt vielleicht in einem Cloud Service nichtverwenden, aber lokal ist es ganz praktisch, da kann man automatisch den Storage auf derlokalen Kiste professionieren lassen für Container in Kubernetes, das ist ganz praktisch,das hauen wir jetzt auch noch rein, ich bin mir gar nicht sicher, was er macht, wenn ichdie Storage Glass weglasse, wahrscheinlich gar nicht starten, dafür machen wir jetzthier noch Local Storage, das Storage Punkt Jamme, Local Storage, Local Storage PunktJamme und da kommt folgendes rein, ich muss mir gleich die Manifest nochmal angucken,ich hab bestimmt irgendwas übersehen, da kommt folgendes rein, bla bla bla blub, diesesRepo, bla bla bla blub, fertig aus, Zombie, das passt so, das ist wie gesagt nur fürlokale Cluster, das würd ich nicht unbedingt machen, das ist Public, Kyo-Kun, ach du bistauch mal wieder am Start, moin, ja, das ist Public, ok, ich hoffe, ich hab alles richtiggemacht, das sollte eigentlich jetzt schon reichen für eine Runde Grafana, es ist nichtauf Wublaws, es ist, hier guck mal, in der Fiveheader Organisation ist es, damit ichnicht, falls ich im Trocken liege, nix passiert, ist das in der Organisation drinne, so wennich jetzt Glück habe, sollte mein Prometheus funktionieren gleich, ich bin da noch skeptisch,hab ich irgendwelche Repos vielleicht noch nicht angepasst, ne Repos drinne passt, ok,checken wir mal, so wir müssen wieder nichts selbst machen, ich beschleunige nur das Refreshenmal, Argo CD wird das ganze für uns installieren, Local Path, ok, Local Path ist installiert,so wenn wir Glück haben, geht Grafana jetzt auch noch, Grafana dauert ein bisschen zuminstallieren, ihr sehts hier oben vielleicht, mein Rechner ist ein bisschen am abkackengerade, und dann haben wir gleich einen Grafana Stack laufen, wo wir unseren Cluster mit monitornkönnen, wenn das funktioniert, das ist immer ein bisschen eklig, was hat er hier was nichtfunktioniert, ah Namespace, den Namespace gibt es nicht, wobei hab ich nicht gesagtCreate Namespace, doch hab ich gesagt, müsste funktionieren, was hat er das Problem fürNamespace, de-created, warum, oh Moment, soll ich mir erzählen, dass mein Grafana einfachjetzt funktioniert oder was, so ganz von alleine, Moin, Shane Law, wie Moment, das hat aufihn funktioniert, meine Grafana Installation, da hab ich jetzt aber, da hab ich jetzt ehrlichgesagt nicht mit gerechnet, also aber gar nicht, ok, ja, dann connecten wir uns mal zuunserem Grafana, und zwar auf den Grafana Service, wie macht man das mit K9S denn jetzteigentlich so hier, auf Grafana Service, das sind ja nur Pods, ich will ja den Servicehaben, wie lässt man sich hier den Service anzeigen, beim Plan, ich weiß, wie ich Spielin CubeZtl mache, keine Ahnung, wie könnte man das mit K9S machen jetzt den Service,egal, wir machen Forward, service, auf Service Grafana, Grafana, nein, wie heißt das Service,was heißt Grafana, achso, ich hab den Namespace überschrieben, das ist auch nicht Portding,sondern Port 80, nee, Port 3000, nee, wo denn, Get Service, Get Service, Grafana Serviceläuft auf Port 80, läuft nicht Grafana, normalerweise auf Port 8000, na gut, Local House 8080 undschon haben wir einen Grafana am Start, zack, kann man die Helm-Values noch in eine eigeneDatei kippen, ja, es gibt verschiedene Varianten, wie man das machen kann, also, es gibt inArgoCD zwei Varianten, wie man Helmcharts installieren kann, du kannst Helmcharts entwederdirekt als Application und zwar als Helmchart angeben, dann kannst du hier, achso, du meinstdie Values hier in der eigenen Datei, du kannst irgendeine Config, ja, das geht, das geht,das war nochmal ArgoCD Helm-Values, das geht, die Hilfe-Seite von denen ist tatsächlichganz nice, Value Files, hier, hier, du kannst, du kannst, hier, so, das kannst du angeben,Value Files, Values Production-Yaml, ja, das kannst du machen, it's Ctrl-Z-Button-Paper,ok Chain-Lore, all du's bist, das können wir uns morgen früh angucken, ja, das, dasfunktioniert, ja, genau, es gibt zwei Varianten, wie du Helmcharts hinzufügen kannst, einmalhier halt direkt als Helmchart enden oder wenn du das Helmchart selber noch etwas erweiternmusst, ohne dass du selbst quasi ein eigenes Chart machen willst mit der Dependency aufdas andere Chart und sowas, da kannst du's einfach auch in die, da kannst du's auchso in der Customize-Datei reinschreiben, funktioniert auch, da kannst du hier noch andere Sachenincluiden im gleichen Ordner, ohne dass du quasi das Helmchart forken musst oder ohnedass du das Helmchart extenden musst, für kleine Sachen ist das ganz, ganz nice, isthalt wieder komplex, as fuck, unnötigerweise, so, ja, also, wir haben uns bei Grafana eingeloggt,jetzt können wir mal unseren Cluster uns angucken, also, Browse, das war jetzt wirklich easymit Grafana, Browse, so, wir haben ein paar Standard-Dashboards dabei, ja, das stimmtwohl, das ist, da ist vieles, immer auf 50 Varianten möglich und bei Yammel-Bausen laufenauch irgendwelche Fehler ein, so, gucken wir uns mal, gucken wir uns mal die mitgeliefertenDashboards an, ob da irgendwas Spannendes drin ist, Cordien ist, okay, alert man, dasswas drin, ah ja, interessant, nichts, sehr schön, ah, nichts, excellent, auch sehr interessant,wahrscheinlich sollte ich mal auf die letzten fünf Minuten stellen, auch nicht, wann habeich überhaupt Datenquellen drinnen, die funktionieren, data sources, ja, ich hab die Standard-Prometos-Data-Sourcedrin, die sollte funktionieren, ah, hier steht was drinnen, computer-sources, CPU, no data,auch geil, nice, ggeats, no data, hier, memory, doch ein paar Sachen stehen drin, CPU-limitsund sowas, no data, CPU-usage, ich geh davon aus, du musst einfach noch ein bisschen einsammeln,da steht überall nichts drin, excellent, sehr schön, alles klar, da weiß man gleichBescheid, okay, hier steht was drin, CPU-utilization, aber die Grafen sind auch noch nicht gefüllt,hier haben wir ein bisschen was, api-server und hier haben wir overview, Cordien, CordienS, haben wir ein paar Anfragen, okay, Requests, Alert-Manager, ja gut, wollen wir haben Alerts,warum haben wir Alerts, von was, ja, wenn wir schon so gerade so nice am Monitoren sind,hauen wir auch gleich nochmal Loki drauf für Loks, dann kann ich euch das auch zeigen,so, aber jetzt, okay, langsam, lang, aber, ja, doch, jetzt, jetzt kriegen wir langsamein paar Werte her, nicht dass mir das jetzt irgendwie großartig ist, was sagt, aber wirhaben schon ein paar hübsche Dashboards, die beim Chef Eindruck machen, gibt es Monitoringfürs Monitoring und dann Monitoring fürs Monitoring, um dann wiederum das Monitor zumonitorn, mein Monitoring des Monitorings ist mein Auge, iChamp, so, Loki am Start,mehr müssen wir hier glaube ich an der Stelle nicht machen, Projekt Default und wir müssenjetzt noch hier abschließend in Grafana die Loki-Source einbinden und dann habe ich sogarLog-Dateien, ich zeige euch noch was wichtiges an der Stelle, guckt mal hier, Server-Site-Apply-Truemuss man setzen, weil Grafana bzw. dieses ganze Bundle hier aus Cube, Prometheus, Stack undalles mögliche, das ist so groß, dass das Probleme hat, wenn es an die Kubernetes-APgeschickt wird, deswegen muss man Server-Site-Apply einstellen, dann gibt es keine Probleme mehr.So, Push, jetzt sollten wir auch gleich noch eine Loki-Installation haben, achso, Local-Host,das ist ja klar, dass das nicht geht, Secret, Massive Password, Loki, da ist es doch schonund es ist auch gesüngt, der Pod startet noch nicht, mal abwarten, sollte sich hoffentlichgleich erledigt haben, Loki ist nicht Running, vielleicht braucht er einfach noch ein bisschen,ja, aber wir sind gleich fertig, ok, Loki hat kein Bock zu starten, mal gucken was ichverkackt habe, Logs, Loki, warum will das nicht starten, weil, Handing Over Indexesto Shipper, alles klar, die allerbesten Fehlermeldungen, achja ok, es läuft, ich habe nichts gesagt,funktioniert, Loki läuft, so, das heißt, ich kann jetzt auch in meinen Grafana gehenund wenn ich Glück habe, haben die, achso, vielleicht soll ich, Forwarding ist an, Forwardingist an, Unexpected Error, ok, geht es jetzt, kein Unexpected Error mehr, Data Sources,Loki am Start, ok, so, jetzt können wir mal unsere Log-Dateien browsen, Data Source, Lokiund zwar, keine Ahnung, hier, Pod, und zwar wollen wir uns Logs angucken und besser gesagtServer, egal, Pod, Pod wollen wir uns angucken vom Server Manager unbedingt, so, Run Queryund wir haben Logs drinnen, Bam, wir sehen was kritisch ist, wir sehen was nicht kritischist, können Logs durchsuchen, eigentlich ganz nice, hier sieht man ok, da gab es irgendwelcheFehler, man könnte jetzt noch ein Log-Level einstellen, das ging jetzt deutlich schnellerals ich gedacht habe, mein so ist das ein ziemliches Müll-Frontend, ja, oh, was machter denn hier, ja, aber das ist doch jetzt schon mal eine ganz gute Grundlage, ich meine,da können wir doch die nächsten Male ordentlich weiter machen, wir haben alle Basics da, diewir brauchen, wir haben einen Cert Manager für Zertifikate, wir haben eine Testanwendungfür unseren Kram, wir haben Anbindung an unseren Key Vault, das heißt selbst wenn ich mal meineKeys ändere, dann ist es easy, das einfach im Vault anpassen und gut ist und der Clusteraktualisiert sich, wir haben Logging, wir haben lokale Storage, wir haben Grafana fürsMonitoring beziehungsweise zum drauf gucken, Argo CD zum automatisch ausrollen, das istauch schon mal ein ganz gutes Setup, nutzt du Wayland oder X, das ist X, Wayland funktioniertja vm nicht gescheit, das ist ja immer noch meine Linux vm, ja guck hier Windows da Linux,ok.So, ja gut, man könnte sich jetzt noch ein bisschen Gedanken darüber machen, warum zumBeispiel die Qt App hier die ganze Zeit so ein drehendes Ding hat. Könnte das sein,dass der Health Check schlicht und ergreifend nicht funktioniert? Was habe ich denn da fürden Health Check eingestellt? Gar keinen! Nee doch, hier. Readiness Probe slash Health,das sollte doch eigentlich funktionieren. Holen wir mal aus. Slash Health, jo. Health,ja, weil, weil, warum Health mit Z? Weil sich irgendwelche coolen Leute bei Google gedachthaben. Das ist eine gute Idee, das mit Z zu schreiben. Ich habe keine Ahnung, warum dieauf diese klorreiche Idee gekommen sind. Aber der Default Endpunkt für einen Cluster Endpunkt,nein, für einen Service Endpunkt Check ist Health Z. Das ist der Default. Also warumder Service hier permanent in progressing ist, weiß ich nicht. Ich vermute aber mal,das liegt daran, weil ich es lokal betreibe und nicht bei einem Cloud-Anbieter. Also dasArgoCD da irgendwelche Probleme damit. Habe ich auch mal was zu gelesen. Progressing Service,wenn man das lokal hat. Hier, ArgoCD progressing state forever. Ja, Resource Health, genau,Service. If Service ist auf type Load Balancer, Status Load Balancer Ingress List ist non-empty.Okay, wollen wir mal gucken, ob das auf Typ Load Balancer ist. Get Service, Minus A. Esist auf type. Moment, ich habe da einen Falto, Qt-App muss ich gucken, hier. Load Balancer,aha. Das ist das Problem. Die App ist auf Typ, der Service ist auf Typ Load Balancer. Warumeigentlich? Kann der lokal gar nicht funktionieren. So, gucken wir mal wahrscheinlich, weil ich Misteingestellt habe. Will ich Cluster IP haben? Wahrscheinlich will ich Cluster IP haben. Ist ClusterIP nicht so geil der Default? Okay, Push. Und jetzt hat sich das hoffentlich erledigt. Bäm. Allesgesüngt. Healthy, wunderbar. Pogu. So muss das sein. Haben wir alles am Start.External Secrets, Zertifikate, Log-Auswertungen, Grafana-Dashboard, lokale Storage, automatischesAusrollen auf dem Cluster. Da kann man doch mit leben, so. Okay, was sagt Chat-GPT? In Kubernetesist slash Health ein Endpunkt für den einfachen Gesundheitscheck von Pods, während Health einEndpunkt für erweiterte Prüfung der Pod-Gesundheit ist. Das erscheint mir ein bisschen sass, was Chat-GPTda erzählt. Also, ich mein, das heißt ja im Endeffekt, das gibt's nämlich gar nicht.Dass das Z für Zero steht, nee, das ist irgendwie so Google-Ding mit dem Z hinten dran. Keine Ahnung.Svelte. Svelte, finde ich, ist mit Abstand mein Favorite. Wenn du was brauchst, was verbreitetist, also super krass weit verbreitet, und wenn du Leute finden willst, die mit dran arbeiten,da bleibt ja eigentlich nur React. React ist das mit Abstand, wirklich mit riesem Abstandverbreitetste Frontend-Framework, wo du auch ein paar Leute für findest, die davon Planhaben. Ja, mit Svelte, weiß ich nicht, ob es da so viele gibt. So. Leute, wir habennoch eine Stunde Zeit, was machen wir denn jetzt? Wir haben jetzt 2 Stunden 15 Kubernetes-ed,können wir doch irgendwas Sinniges da drin machen jetzt? Ich überleg gerade. Trafficals Ingress, nee. Traffic als Ingress ist jetzt eklig zu einzurichten, weil bei mirlokal auf der Kiste, da muss ich einfach bei Minikube das Nginx Addon anmachen und gutist. Hast du Geburtstag in 3 Stunden? Pogu. Nee, das machen wir heute nicht, das ist zuumfangreiches Thema. Nö, da fällt mir jetzt gerade nichts mehr, ehrlich gesagt großartigein, was wir da heute machen könnten. Du kannst links zu Stackoverflow posten, jaja. KubeDoom. Die Leute haben ja schon wieder Ideen, ey. Kackel. Das ist einfach eine gute Idee,oder? Kubernetes Doom. Security Scan. Ich schreibe mir das mal alles, ich schreibe mirdas mal auf als To Do's, ja. Das ist ja geil. Das zusammen Windows Update machen, dann fährtmein Rechner ja runter und ihr seid weg. Leute, wisst ihr, dass ich bald 39 werde? Ich habda auch kein Bock drauf. Dann ist nur noch ein Jahr bis 40. Mit 40 ist das Leben zurHälfte vorbei, sozusagen. Chainlord, ich weiß nicht, wie alt du bist, aber wenn duunter 20 bist, könnte ich easy dein Vater sein, ja? Ist richtig. Ja, könnte ich, theoretisch.Ich bin es meines Wissens nach nicht, aber ich könnte, rein vom Alter her. Ja, wer weiß.Wenn du dir dein Alter aussuchen könntest, welches würdest du gerne wieder sein? Okay,es geht ja um das Alter und nicht um die Zeit. Ja, das muss man ja immer trennen. Wenn esum die Zeit ging, was richtig cool war, dann hätte ich eindeutig gesagt. Bonkers. Alter.Also, wenn es um die Zeit geht, da gibt es mehrere, aber ich glaube, ohne Mist, wennich nochmal Zeit, dann würde ich tatsächlich was nehmen, wo ich Ferien hatte und noch indie Schule gegangen bin. Ja, wo Oma und Opa noch am Leben waren, wo ich Half-Life gespielthabe den ganzen Tag auf meinem 17 Zoll Röhrenbildschirm, dann angefangen habe, schon ein bisschenMMOs zu grinden. So, sagen wir mal, sagen wir mal so die, so 1996 bis 2000, so die Zeit,das fände ich geil. So, aber wenn es um das Alter geht, also quasi so mit jetzigem Wissenund jetziger Zeit und so, wie alt ich heute sein möchte, ganz ehrlich, dann wahrscheinlichnur ein paar Jahre jünger, nicht wirklich viel. Vielleicht 25 oder so. Oder 30, 30wahrscheinlich. 30 ist eigentlich ganz gut. 30, paarunddreißig. Ehrlich keine Schmerzen.25 bis 35 so dazwischen irgendwie. Es ist jetzt auch nicht wirklich so schlimm gerade.Ich kann mich jetzt nicht beschweren. Wie gesagt, ich war lange nicht mehr so fit und so gesund,so auch was Rückenschmerzen und Kopfweh und so angeht wie jetzt. Und das liegt einzigund allein an mehr Bewegung. So ist es. Also ich war lange nicht mehr, wie gesagt, so fitund ja, also insgesamt eigentlich alles ganz gut wie jetzt. Ja, deswegen habe ich ja gesagt,wenn Ferien sind, Schulzeit selbst, da hätte ich auch keinen Bock mehr drauf. Schule warrichtig kacke. Da hätte ich auch keinen Bock drauf jetzt. Schule ist ultra suck.Ähm. Kommt das hin mit 24? Joah. Leg gerade. AlsoAusbildung 2007. Ja, ja, so irgendwie in dem Dreh, ne? Ja, nochmal. 2007 minus 1984, 23,ja, also mit 23, 24 ist richtig. Joah. Äh, was ich vorher gemacht habe. Ich habe vorherbeispielsweise BWL-Shit gemacht. Ja. Nicht wirklich studiert BWL-Shit oder so. Eher ausbildungstechnischwas gemacht, aber da habe ich überhaupt keinen Bock drauf gehabt. Das habe ich auch nurgemacht, weil mich meine Mutter so genervt hat, genervt hat, dass ich das jetzt unbedingtwas machen muss. Ja, was mit Holz. Was hast du für eine Ausbildung? Wie gesagt, ich habemal Bürokauf angefangen zu lernen. Vor langer Zeit habe ich nicht fertig gemacht und daswar die Zeit, da habe ich eigentlich mich morgens an Rechner gesetzt, eingeloggt, MMO-Kreiselgrindgemacht bis abends und dann bin ich dann bin ich pennen gegangen und dann bin ich aufgestandenund habe wieder MMO-Kreiselgrind gemacht den ganzen Tag. Und dann ging mir halt meine Mutterso sehr auf den Keks, dass ich dann mich habe halt dazu überreden lassen Bürokaufmannzu machen. Weil man ja irgendwie eine Ausbildung angeblich machen muss so. Und egal was, wiescheiße es ist, mach halt mal. Und ich meine nicht, dass ich da irgendwie jetzt großartigwas gerissen hätte. Janfried, danke schön für den Sub. Nicht, dass ich da groß wasgerissen hätte. Ich hatte auch keinen Bock. Also wie gesagt, ich habe da den ganzen Taghabe ich MMO-Kreiselgrind gemacht, mich für nichts anderes interessiert. Ja, lötendeswegen mal was sinnvolles was man lernt, wenn man sowas lernt in der Schule. Also wiegesagt, das einzige was ich mir gemerkt habe aus meiner kaufmännischen Ausbildungszeitda ist, wie man eine Buchhalternase macht und dass man linear und dekresiv abschreibenkann. Wobei ich gehört habe, dass es mittlerweile gar nicht mehr so ist. Kannst du noch etwassagen, was du nach der Physi-Ausbildung verdient hast? Ja, kann ich sagen 33.500 im Jahr beimProvider. Direkt nach der Ausbildung. Ja, mit Bonus sogar ein bisschen mehr. Also sagenwir mal, ich habe meinen Gehalt in den letzten 15 Jahren quasi ziemlich genau verdreifacht,kann man glaube ich sagen. Ne, sogar mehr. Bisschen mehr sogar. Fast verdreifacht. Ichbin mir relativ sicher, in den nächsten 15 Jahren wird das nicht mal so viel sein. Ichglaube nicht, dass ich nochmal mal 3 verdienen werde. 2035. Die hat Epic? Was soll dennEpic sein? Erzählende Literatur, ok. Inflationsbereinigt, keine Ahnung, musst du selbst ausrechnen.Gibt es dazu einen Rechner? Wie viel das heute wird? 33.500, 2010 oder so. Die Seitemache ich nicht auf. Die sieht sass aus. Ah, im Moment das Spiegel ist aus. Ok, es siehttrotzdem sass aus. Ok, zeig mal her. Protogohalt, Datum, so frisst es jedenfalls. Was soll ichda jetzt eintippen? Muss ich jetzt da zurückgehen auf 2010 oderdas muss ich da jetzt einstellen. 2010 habe ich, keine Ahnung, 33.500 durch 12. Wie vielist denn das? Ok. Um sich genauso viel leisten zu können wie November, müssen sie heute3600 verdienen. Ok. Ok, ich glaube ich kann auch einfach das Jahresgal reinschreiben.Ok, also heute müsste man dann schon 43.000 verdienen. Das ist schon krass wenn man sichdas hier anguckt, oder? Davor eigentlich nur halbwegs milde und jetzt wirklich bergab.Da kann das durchaus sein, wenn das so weiter geht. Also wenn das irgendwie 10% im Jahrsind, da kann das durchaus sein, dass ich in 15 Jahren oder in 10 Jahren tatsächlichdieses doppelte habe oder so, weil die müssen ja irgendwie da mitziehen. Wer weiß. Ja, dasist doch eigentlich ziemlich gut, oder? Es kommt recht genau hin. Mit meinem Einstiegsgehaltdamals und jetzt bei ihm. Naja. So, ich war mal kurz bei dem Kubernetes-Klasse aus. Ausgecubedfür heute. Das Chat-GPT uns alle arbeitslos macht. Ja, wenn es nach YouTube geht ist dasja so. Wenn die Leute damit leben können, dass in allen Arbeiten irgendwelche verstecktenFehler drin sind, von denen du nichts weißt, ja dann kannst du Chat-GPT alles machen lassen.Welchen IT-Job kann man machen, wo man nicht 24-7 programmiert? Alle außer Software-Entwicklerund selbst als Software-Entwickler programmierst du nicht 24 Stunden? Wann war der letzteAVM-Aufsett-Stream? Gar nicht so lange her. Ich glaube im Dezember. Ich bin echt richtiggelangweilt von diesen ganzen Chat-GPT-Videos oder generell von diesem Ultra-AI-Gehype.Ich habe es nach einer Woche schon gelangweilt. Weil die Videos auch immer die gleichen sind.Oh, ich lasse Chat-GPT eine Webseite machen. Oh, Chat-GPT schreibt meine Bewerbung. Blablabla.Die Diskussion ist sehr ermüdend alles. Es ist ja auch langsam mal wieder gut. War dochJanuar, Februar kann auch sein. Kann auch sein, dass es Januar, Februar gewesen ist.Na ja, Leute, ich glaube, ich gehe jetzt off.Ja, ich habe da auch ein paar Ausschnitte gesehen. Was sie da erzählt haben auf Genie-Levelund sowas. Ich muss Chat-GPT einfach nur mal nach einer genauen Funktionsweise vom Kommando-Zahlen-Toolfragen. Da denkt sich schon irgendwelchen Blödsinn aus. Chat-GPT kann eins richtiggut. Dich mit einer riesen Masse an Text erschlagen.Ja, Leute, wir haben jetzt genug gewürfelt für heute. Kubernetes. Das schon, das hatja mit Chat-GPT erstmal nur am Rande zu tun. Bis denn, macht's gut, CU.", "segments": [{"id": 1, "start": 0.0, "end": 24.36, "text": "Auf gehts Pogu, ich muss nebenbei ins Discord gucken, ob MMO Kreiselgrind losgeht, da muss"}, {"id": 2, "start": 24.36, "end": 44.0, "text": "ich nämlich abhauen. Da ist er wieder. So Leute, seid ihr bereit noch für eine Runde"}, {"id": 3, "start": 44.0, "end": 61.68, "text": "zu gehen? Dann macht mal kurz ein Update in meiner Vm. Irgendwas stimmt auch mit meinem"}, {"id": 4, "start": 61.68, "end": 72.4, "text": "Mikrofon nicht. Sekunde, was hat Windows da wieder getrieben? Na ja, es ist doch zum"}, {"id": 5, "start": 72.4, "end": 79.44, "text": "Großteil eigentlich okay so. Ja, weiter gehts. Heute kümmern wir uns um zwei essentiell"}, {"id": 6, "start": 79.44, "end": 87.66, "text": "wichtige Sachen, nämlich Secrets und Let's Encrypt Zertifikate. Oder generell Zertifikate"}, {"id": 7, "start": 87.66, "end": 93.04, "text": "bei den meisten Leuten. Eigentlich Let's Encrypt, wenn man mal ehrlich ist. Wer gibt"}, {"id": 8, "start": 93.04, "end": 98.0, "text": "heute schon noch großartig Geld aus, außer mein Arbeitgeber, aber wer gibt da noch normal"}, {"id": 9, "start": 98.0, "end": 103.72, "text": "im Kopf ist, der gibt da noch großartig Geld für Zertifikate aus. Beziehungsweise macht"}, {"id": 10, "start": 103.72, "end": 108.76, "text": "sich den Aufwand dann mit teilweise noch manuellem Verlängern und sowas in der Richtung."}, {"id": 11, "start": 108.76, "end": 114.92, "text": "Webminister, danke schön für den Zap. Patrick, moin. Schön, dass ihr alle am Start seid."}, {"id": 12, "start": 114.92, "end": 122.2, "text": "Benutzt irgendjemand von euch noch Zertifikate, die nicht Let's Encrypt sind? Also ich weiß,"}, {"id": 13, "start": 122.2, "end": 128.24, "text": "bei mir auf der Arbeit haben wir noch Zertifikate, die nicht Let's Encrypt sind, weil irgendwelche"}, {"id": 14, "start": 128.24, "end": 132.84, "text": "Leute der Meinung sind, es ist besser, wenn sie die immer von Hand bestellen, weil sie"}, {"id": 15, "start": 132.84, "end": 140.6, "text": "dann wichtig sind. Ansonsten hat es keinen weiteren Sinn. So, ich mach mal kurz. Okay,"}, {"id": 16, "start": 140.6, "end": 145.76, "text": "läuft der Cluster noch? Nee, der Cluster ist abgekackt. Na auch gut. Ohne Mist, ich"}, {"id": 17, "start": 145.76, "end": 152.48, "text": "würde für Let's Encrypt auch was bezahlen. Kein Ding? Also wenn Let's Encrypt, also ich"}, {"id": 18, "start": 152.48, "end": 159.36, "text": "würde theoretisch sogar für Let's Encrypt auch so bezahlen, aber wenn die wirklich wollten,"}, {"id": 19, "start": 159.36, "end": 164.52, "text": "die müssten einfach nur irgendwie so paar ganz kleine Sachen vielleicht als Premium"}, {"id": 20, "start": 164.52, "end": 178.12, "text": "bieten, von der Supporter-Batch im Forum bis zu vielleicht irgendwie die Möglichkeit,"}, {"id": 21, "start": 178.12, "end": 181.52, "text": "die E-Mails nochmal zu redirecten, die man da eingetragen hat, wobei das natürlich dann"}, {"id": 22, "start": 181.52, "end": 189.32, "text": "auch bis braucht werden kann. Muss man sich halt genau überlegen. Also man müsste echt"}, {"id": 23, "start": 189.32, "end": 199.72, "text": "viel machen, dass ich da Geld bezahlen würde bei Let's Encrypt. Ja, das hat es bei uns"}, {"id": 24, "start": 199.72, "end": 204.36, "text": "auch gehießen, aber das kommt meistens von Leuten, die das nicht so meinen. Also es gibt"}, {"id": 25, "start": 204.36, "end": 209.12, "text": "zwei Varianten, entweder die haben keine Ahnung oder die meinen das eigentlich gar nicht so,"}, {"id": 26, "start": 209.12, "end": 213.4, "text": "sagen es aber trotzdem, weil sie es dann nicht mehr wichtig sind. Also es gibt ja Leute, die"}, {"id": 27, "start": 213.4, "end": 218.96, "text": "kümmern sich hauptsächlich um Zertifikats-Handling, Zertifikats-Management, Bestellen, Überwachen,"}, {"id": 28, "start": 218.96, "end": 225.16, "text": "Verneuern und diese Leute sagen dann null Let's Encrypt in der Produktion. Das sagen"}, {"id": 29, "start": 225.16, "end": 228.92, "text": "die allerdings nur, weil sie Schiss haben, dass Let's Encrypt sie irgendwie überflüssig"}, {"id": 30, "start": 228.92, "end": 235.52, "text": "macht. Ich weiß nicht, Stefan, wie war es bei euch? Oder wie schätzt du es denn ein?"}, {"id": 31, "start": 235.52, "end": 249.8, "text": "So, ich starte mal kurz die VM neu und wir machen mal Delete Minikube, machen wir den"}, {"id": 32, "start": 249.8, "end": 253.56, "text": "Cluster mal kurz aus, machen hier alles zu. Wir starten jetzt nämlich den Rechner mal"}, {"id": 33, "start": 253.56, "end": 262.12, "text": "neu, also die VM, nicht den Rechner, weil sonst wäre ja das Stream weg. Das kommt auch"}, {"id": 34, "start": 262.12, "end": 265.76, "text": "dazu, aber ich glaube gerade wenn es von Leuten kommt, die ein bisschen Ahnung haben, dann"}, {"id": 35, "start": 265.76, "end": 275.88, "text": "sehen die so ihre Fälle wegschwimmen. Also wenn die vorher was mit Zertifikaten zu tun"}, {"id": 36, "start": 275.88, "end": 284.16, "text": "hatten. Was ich gerade mache, ich habe gerade den Stream angemacht vor 4 Minuten. Ne, die"}, {"id": 37, "start": 284.16, "end": 292.52, "text": "Diablo 4, da werde ich mal warten bis es rauskommt. Ich kann mich auch dran erinnern, die Diablo"}, {"id": 38, "start": 292.52, "end": 306.72, "text": "3 Beta war auch nicht übel, weil der erste Akt auch das beste am ganzen Game war. Es"}, {"id": 39, "start": 306.72, "end": 312.68, "text": "ist ja noch nicht mal nur Zertbot. Mittlerweile ist der Mist ja schon in nahezu alles Mögliche"}, {"id": 40, "start": 312.68, "end": 318.76, "text": "integriert. Du hast Caddy geprinkt, das standardmäßig mit Traffic, falls irgendjemand wirklich noch"}, {"id": 41, "start": 318.76, "end": 323.04, "text": "Traffic verwenden will, freiwillig. Na gut, im Containerumfeld ist Traffic wirklich ganz"}, {"id": 42, "start": 323.04, "end": 330.72, "text": "nice, wenn man was braucht, was easy zum Setup ist. Allerdings, ich bin kein großer Traffic"}, {"id": 43, "start": 330.72, "end": 337.44, "text": "Fan. Caddy hat es eingebaut, Traffic hat es eingebaut, alle möglichen Hoster und Cloud"}, {"id": 44, "start": 337.44, "end": 349.64, "text": "Provenzer, alle haben es eingebaut mittlerweile. Das ist halt schon sehr praktisch. Ja, bewundert"}, {"id": 45, "start": 349.64, "end": 354.96, "text": "mich, ich glaube auch nicht. Nice, hat es richtig gelohnt. Moment, soll ich dich time"}, {"id": 46, "start": 354.96, "end": 363.48, "text": "outen? Moment, ich time oute dich persönlich sogar. Ich weiß gar nicht wie das geht. Wie"}, {"id": 47, "start": 363.48, "end": 373.88, "text": "überhaupt? Hatte man da nicht im Knopf, wenn man den Namen anklickt? Warte mal, ich bin"}, {"id": 48, "start": 373.88, "end": 383.72, "text": "zu blöd, ich kann das glaube ich nicht mehr. Ich kann nicht bunnen, blocken, ah hier, hier,"}, {"id": 49, "start": 383.72, "end": 405.44, "text": "hier, time out. Nice, so, jetzt bist du getime outet. Jetzt habe ich dich wieder untime outet,"}, {"id": 50, "start": 405.44, "end": 414.12, "text": "jetzt bist du wieder da. Was ist denn das hier, was passiert denn da im Hintergrund gerade?"}, {"id": 51, "start": 414.12, "end": 432.12, "text": "The Way aktualisiert Leute, The Way. Rust, nicht Blazingly Fast aktuell. Das ist überhaupt"}, {"id": 52, "start": 432.12, "end": 440.84, "text": "nicht Blazingly Fast. Ich mache das jetzt aus. Nochmal, nochmal neu starten. The Way."}, {"id": 53, "start": 440.84, "end": 450.08, "text": "Erstmal halbes Internet runterladen, ja. Ah, okay, jetzt geht es schneller, na gut. Was"}, {"id": 54, "start": 450.08, "end": 454.4, "text": "passiert da eigentlich gerade? Der lädt wirklich, das ist ja fast schon zweites Node Modules"}, {"id": 55, "start": 454.4, "end": 467.36, "text": "was hier abgeht. Ich erzähle gleich was wir heute machen wenn ein paar mehr Leute da sind."}, {"id": 56, "start": 467.36, "end": 470.64, "text": "Ich muss nebenbei immer ins Discord, erinnert mich mal please mit dran, ich muss mal nebenbei"}, {"id": 57, "start": 470.64, "end": 474.68, "text": "immer ins Discord gucken ob die Leute da sind. Dann machen wir nachher noch eine Runde Kreisel"}, {"id": 58, "start": 474.68, "end": 486.88, "text": "grind. Mein Gott, Rust, mach hinne, Alter. Was ist denn das? The Way, was ist das überhaupt?"}, {"id": 59, "start": 486.88, "end": 495.76, "text": "Das ist ein Snippet Manager für Command Line. Geht kein Mensch, Alter. The Way. Weg damit,"}, {"id": 60, "start": 495.76, "end": 504.96, "text": "cool. Alles klar, exzellent, perfekt. Okay, Reboot. Wir machen jetzt gleich ein neues"}, {"id": 61, "start": 504.96, "end": 515.24, "text": "GitHub Repo. Ja, wir machen jetzt ein neues GitHub Repo. Für den Stream heute. Beziehungsweise"}, {"id": 62, "start": 515.24, "end": 521.56, "text": "wir können ein GitHub Repo machen wo wir die ganzen Sachen rein posten in nächster"}, {"id": 63, "start": 521.56, "end": 527.16, "text": "Zeit. Also, dann erzähle ich mal so ungefähr was wir heute vorhaben. Es ist blöd wenn"}, {"id": 64, "start": 527.16, "end": 531.72, "text": "ich das jetzt erzähle. Ich starte erstmal den Cluster wie wir das letzte Mal aufgehört"}, {"id": 65, "start": 531.72, "end": 541.04, "text": "haben und dann gucken wir uns das an. Ja, geiles Notizprogramm, das haben wir jetzt"}, {"id": 66, "start": 541.04, "end": 554.16, "text": "gebraucht. So, ich hoffe es ist alles geupdatet. Cute. Cute K8S, da sind wir. Okay, alles"}, {"id": 67, "start": 554.16, "end": 563.6, "text": "klar, also ich werde das mal ganz kurz zeigen, mal kurz einloggen in Shithub. Fiveheader,"}, {"id": 68, "start": 563.6, "end": 585.76, "text": "alles klar. Repos. Nein, das nicht, das ist mein privates, da machen wir hier. Machen"}, {"id": 69, "start": 585.76, "end": 591.12, "text": "wir auch Public, ist nicht wild, dann könnt ihr danach gucken was wir heute gebastelt haben."}, {"id": 70, "start": 591.12, "end": 598.68, "text": "Create Repo. So, also ich zeige euch mal wo wir das letzte Mal stehen geblieben sind,"}, {"id": 71, "start": 598.68, "end": 601.96, "text": "dass ihr so ungefähr durchblickt was wir das letzte Mal gemacht haben und dann sage"}, {"id": 72, "start": 601.96, "end": 609.76, "text": "ich was wir heute machen werden. Als erstes starte ich mal wieder wie gehabt einen lokalen"}, {"id": 73, "start": 609.76, "end": 617.28, "text": "Kubernetes Cluster, bei mir auf der VM mit Minikube. Das ist nichts wo man später produktive"}, {"id": 74, "start": 617.28, "end": 621.64, "text": "Kubernetes Cluster mit laufen lässt, sondern das ist nur lokal in der VM zum ausprobieren."}, {"id": 75, "start": 621.64, "end": 629.2, "text": "Was ich mir demnächst vielleicht mit euch mal angucken will war Talos OS. Keine Ahnung"}, {"id": 76, "start": 629.2, "end": 633.56, "text": "ob das was taucht. Ich habe eh nicht vor im großen Stil Kubernetes Cluster selber zu"}, {"id": 77, "start": 633.56, "end": 638.56, "text": "hausen, aber sich so ein bisschen mit so Basics zu beschäftigen ist nie verkehrt, das hilft"}, {"id": 78, "start": 638.56, "end": 643.08, "text": "einem auch wenn man Managed Lösungen verwendet, weil man dann Dinge einfach besser einschätzen"}, {"id": 79, "start": 643.08, "end": 651.24, "text": "kann. So, also unser lokaler Kubernetes Cluster ist am Laufen und ich applye jetzt mal die"}, {"id": 80, "start": 651.24, "end": 658.68, "text": "Config vom letzten Mal. Ich bin mir nicht ganz sicher ob das so überhaupt funktioniert"}, {"id": 81, "start": 658.68, "end": 666.44, "text": "hat. Nee das funktioniert so nicht. Moment. Warte mal. Ich muss doch erstmal meine Passwörter"}, {"id": 82, "start": 666.44, "end": 672.32, "text": "setzen oder? Ich habe doch hier so eine Datei die sich super geheim nennt. Dann löschen"}, {"id": 83, "start": 672.32, "end": 679.8, "text": "wir den Cluster nochmal kurz. Wir machen jetzt nochmal start.sh. Dann sollte das Ding hoffentlich"}, {"id": 84, "start": 679.8, "end": 690.88, "text": "den Cluster hochfahren. Und dann sagen wir kubectl applye-k und applye in unsere aktuelle"}, {"id": 85, "start": 690.88, "end": 696.0, "text": "Config. Ich zeige mal kurz was wir aktuell im Cluster laufen haben. Nicht wahnsinnig"}, {"id": 86, "start": 696.0, "end": 700.72, "text": "irgendwie spannendes Zeug. Wir haben aktuell nur zwei Sachen laufen und zwar wir haben"}, {"id": 87, "start": 700.72, "end": 706.96, "text": "einmal ArgoCD laufen und einmal eine selbst entwickelte App, die nichts anderes außer"}, {"id": 88, "start": 706.96, "end": 717.84, "text": "bisschen Blödsinn auf dem Webinterface ausgibt zum testen. Dazu haben wir ein paar Configs"}, {"id": 89, "start": 717.84, "end": 724.64, "text": "noch angelegt. Kann ich euch zeigen. Wir haben noch ein paar Configs angelegt. So wir legen"}, {"id": 90, "start": 724.64, "end": 734.68, "text": "eine Namespace an für ArgoCD und ein bisschen Magic. Wir starten ein Ingress Server, quasi"}, {"id": 91, "start": 734.68, "end": 741.36, "text": "ein Reverseproxy, dass wir uns unter ArgoCDkappaLUL.com connecten können. Ihr könnt es ausprobieren"}, {"id": 92, "start": 741.36, "end": 744.24, "text": "ob ihr euch hinconnecten könnt. Ihr könnt nicht hinconnecten, weil ich die Domainlokale"}, {"id": 93, "start": 744.24, "end": 751.2, "text": "umgebogen habe. Dann haben wir zwei Appdefinitionen für ArgoCD. Einmal es selber und dann unsere"}, {"id": 94, "start": 751.2, "end": 755.28, "text": "selbst entwickelte App. Ich zeige euch das Ganze jetzt auch noch mal im Webinterface"}, {"id": 95, "start": 755.28, "end": 763.32, "text": "bzw. wenn man die Config Applian auf den Cluster. Das mache ich jetzt mal. Es gibt mehrere"}, {"id": 96, "start": 763.32, "end": 769.76, "text": "Möglichkeiten so eine Jaml-Konfigurationsdatei auf seinen Cluster zu schieben. Also es gibt"}, {"id": 97, "start": 769.76, "end": 776.88, "text": "generell mehrere Varianten so ein kombiniertes Cluster zu administrieren. Die billigste Variante,"}, {"id": 98, "start": 776.88, "end": 783.44, "text": "ich weiß nicht wie ich es jetzt nenne, die einsteigerfreundlichste Variante ist per Kommandozeile"}, {"id": 99, "start": 783.44, "end": 791.64, "text": "mit kubectl. Oder was ich witzig finde, Leute jetzt mal eine Frage. Wie sprecht ihr kubectl"}, {"id": 100, "start": 791.64, "end": 798.44, "text": "aus? Ich meine meiner Meinung nach steht das ja eindeutig für Kubernetes Control. Aber"}, {"id": 101, "start": 798.44, "end": 806.28, "text": "es gibt Leute die sprechen es nicht kubectl oder kubectl aus, sondern haltet euch fest"}, {"id": 102, "start": 806.28, "end": 822.56, "text": "kubectl. Also Kuschelwürfel quasi, Würfelkuschel. K9S ist das beste Interface, das bringt dir"}, {"id": 103, "start": 822.56, "end": 827.56, "text": "aber nichts wenn du den Cluster managen willst, großartig. Damit kannst du schön Sachen angucken."}, {"id": 104, "start": 827.56, "end": 838.84, "text": "Ja es gibt Leute die sprechen das so aus, kubectl so. Also quasi Würfelkuschel, Würfelkuschler."}, {"id": 105, "start": 838.84, "end": 853.2, "text": "Ich würde ja sagen der Chat darf sich aussuchen wie ich es ausspreche, das halte ich aber"}, {"id": 106, "start": 853.2, "end": 862.2, "text": "nicht aus das kubectl zu nennen. Sonst gewöhn ich mich noch an diesen Blödsinn. Das ist"}, {"id": 107, "start": 862.2, "end": 870.2, "text": "weiterhin kubectl. So also Cluster gestartet, also die einfachste Variante kubectl ist über"}, {"id": 108, "start": 870.2, "end": 874.72, "text": "kubectl. Da kann man alle möglichen Sachen, man kann sagen create, namespace, das Ding"}, {"id": 109, "start": 874.72, "end": 881.76, "text": "hat übrigens wie ihr seht auch TabCompletion. TabCompletion ist was was ich lustigerweise"}, {"id": 110, "start": 881.76, "end": 888.32, "text": "relativ selten in YouTube Tutorials sehe wo es um Kubernetes geht. Ich glaube das liegt"}, {"id": 111, "start": 888.32, "end": 894.28, "text": "daran dass viele Leute aus welchen Gründen auch immer die Administration von Windows aus"}, {"id": 112, "start": 894.28, "end": 902.24, "text": "machen in Videos. Ich weiß nicht was die geritten hat, warum man sowas machen will. Wir benutzen"}, {"id": 113, "start": 902.24, "end": 908.56, "text": "tatsächlich ziemlich playing Kubernetes ohne irgendwas aktuell, lokal. Die nächsten Tage"}, {"id": 114, "start": 908.56, "end": 916.2, "text": "machen wir tatsächlich dann auch mal richtig was ordentliches und zwar in Google Cloud."}, {"id": 115, "start": 916.2, "end": 927.6, "text": "So und man kann in seine config für die shell, kann man eintragen dass man das hier haben"}, {"id": 116, "start": 927.6, "end": 934.52, "text": "will guck kubectl completion für zsh. Wenn man das hier einträgt dann hat man autocomplete"}, {"id": 117, "start": 934.52, "end": 940.56, "text": "für seinen Kubernetes Cluster. Und dann kann man das ganze noch aliasen und dann hat man"}, {"id": 118, "start": 940.56, "end": 946.32, "text": "ganz kurze Sachen und hat noch die Möglichkeit ihr seht es hier schon autocomplete zu machen,"}, {"id": 119, "start": 946.32, "end": 950.96, "text": "also besser geht es da nicht wenn man das über Kumano-Zehler administrieren will. Alias"}, {"id": 120, "start": 950.96, "end": 955.44, "text": "dass das ganze abgekürzt ist plus noch, ja was es noch gibt zeige ich euch vielleicht"}, {"id": 121, "start": 955.44, "end": 971.28, "text": "auch noch, aber nachdem ich den Cluster konfiguriert habe. So und der Nachvollziehbarkeit halber"}, {"id": 122, "start": 971.28, "end": 977.84, "text": "macht man außer beim Einstieg eigentlich relativ wenig über kubectl direkt am Kubernetes Cluster,"}, {"id": 123, "start": 977.84, "end": 982.44, "text": "sondern man macht das alles in Kubernetes Manifest Dateien, das sind solche Yammels,"}, {"id": 124, "start": 982.44, "end": 986.48, "text": "so was hier, so eine Yammel Datei zum Beispiel, da steht dann zum Beispiel drinne leg einen,"}, {"id": 125, "start": 986.48, "end": 993.2, "text": "also ich könnte zum Beispiel sagen kubectl create namespace keckel, da würde er namespace"}, {"id": 126, "start": 993.2, "end": 998.32, "text": "anlegen. Ich kann das allerdings auch so im Yammel definieren, das hat den Vorteil wenn"}, {"id": 127, "start": 998.32, "end": 1002.08, "text": "ich das im Yammel definiere ist das halt irgendwo nachvollziehbar was passiert, ich brauche"}, {"id": 128, "start": 1002.08, "end": 1007.72, "text": "keine komischen Skripte mit Shell Befehlen, ich kann das relativ easy auf weitere Server"}, {"id": 129, "start": 1007.72, "end": 1012.08, "text": "anwenden, ich kann auch Sachen automatisch deployen lassen über Yammels, das ist alles"}, {"id": 130, "start": 1012.08, "end": 1016.56, "text": "über Kommandozeile ein bisschen, ein bisschen eklig und wenn man das eincheckt auf GitHub"}, {"id": 131, "start": 1016.56, "end": 1021.8, "text": "in den Repo, sorry auf Shithub in den Repo eincheckt, dann kann man sogar nachvollziehen"}, {"id": 132, "start": 1021.8, "end": 1027.32, "text": "wer wie wo wann was dran geändert hat, also das ist eigentlich so da way wie man das heutzutage"}, {"id": 133, "start": 1027.32, "end": 1033.92, "text": "macht, man macht natürlich trotzdem Sachen weiterhin mit kubectl, logs angucken, Portstatus"}, {"id": 134, "start": 1033.92, "end": 1039.12, "text": "angucken, Serviceadresse an was auch immer, alle möglichen Geschichten, man kann auch"}, {"id": 135, "start": 1039.12, "end": 1044.6, "text": "falls gerade einer im Chat erwähnt hat, man kann auch K9S verwenden als Frontend für den"}, {"id": 136, "start": 1044.6, "end": 1051.92, "text": "Cluster und sich dann so Sachen angucken wie IP vom Container, logs, logs vom Container"}, {"id": 137, "start": 1051.92, "end": 1062.2, "text": "und solche Geschichten, gibt es halt da keine logs. So und wenn man so eine Konfiguration"}, {"id": 138, "start": 1062.2, "end": 1069.08, "text": "erstellt hat in Yammel, da gibt es keine so strikte Vorgabe wie man das machen muss,"}, {"id": 139, "start": 1069.08, "end": 1073.6, "text": "man kann da kann man sich jeder selbst ein bisschen überlegen wie man das ganze eben"}, {"id": 140, "start": 1073.6, "end": 1078.6, "text": "organisiert, also ich mache ganz gerne zumindest aktuell mal gucken wie das ist, wenn ich da"}, {"id": 141, "start": 1078.6, "end": 1083.76, "text": "mal wirklich im richtig großen Stil komplett selbst konfigurieren muss, vielleicht denke"}, {"id": 142, "start": 1083.76, "end": 1091.12, "text": "ich mir da auch was anderes aus, pro installierte Anwendung ein Ordner wenn die Custom-Config"}, {"id": 143, "start": 1091.12, "end": 1098.72, "text": "braucht und für jede App so ein Application-File hier oben im Apps-Folder. So und dann hat"}, {"id": 144, "start": 1098.72, "end": 1103.36, "text": "man hier seine Konfiguration für den Cluster und dann geht man in das Verzeichnis und sagt"}, {"id": 145, "start": 1103.36, "end": 1110.72, "text": "kubectl apply entweder minus f, da kann man dann direkt das Yammel-File angeben was man"}, {"id": 146, "start": 1110.72, "end": 1116.52, "text": "auf den Cluster applyen will oder man sagt minus k Punkt, dann wird das Customize-File"}, {"id": 147, "start": 1116.52, "end": 1125.28, "text": "im aktuellen Verzeichnis ausgeführt. Customize ist eingebaut in kubectl und auch in ganz"}, {"id": 148, "start": 1125.28, "end": 1130.24, "text": "vielen anderen Gruppen des Tools, damit kannst du so ein bisschen die ganzen Yammel-Dateien"}, {"id": 149, "start": 1130.24, "end": 1135.36, "text": "bundeln. Ich kann zum Beispiel sagen hier, führ mal alles aus was im Argo-CD-Ordner ist"}, {"id": 150, "start": 1135.36, "end": 1140.66, "text": "und zusätzlich noch das da. Man kann da noch mehr machen, man kann auch Namespaces überschreiben"}, {"id": 151, "start": 1140.66, "end": 1147.64, "text": "in allen quasi ja darunter liegenden Ressourcen und noch viel andere ekliche Geschichten"}, {"id": 152, "start": 1147.64, "end": 1151.16, "text": "machen aber das lassen wir jetzt. Ich applye das jetzt mal auf meinen Cluster und dann"}, {"id": 153, "start": 1151.16, "end": 1158.84, "text": "gucken wir mal ob das noch funktioniert was wir das letzte Mal gebaut haben. Ah das wird"}, {"id": 154, "start": 1158.84, "end": 1163.52, "text": "wahrscheinlich nicht funktionieren, ja ok was auch immer. Das wird wahrscheinlich nicht"}, {"id": 155, "start": 1163.52, "end": 1168.08, "text": "funktionieren Leute, ich weiß auch warum das nicht mehr funktionieren wird. Mein GitHub"}, {"id": 156, "start": 1168.08, "end": 1184.24, "text": "Talken vom letzten Mal ist expired. Da sollte jetzt eigentlich nix gehen. Also schauen wir"}, {"id": 157, "start": 1184.24, "end": 1203.44, "text": "mal Pots. Zumindest Argo-CD selber läuft. Secret. Initial Secret. Einmal das mal hier."}, {"id": 158, "start": 1203.44, "end": 1209.52, "text": "Port forward in den Cluster rein. Machen das mal auf. Das einzige was wir auf unserem Cluster"}, {"id": 159, "start": 1209.52, "end": 1220.48, "text": "aktuell installiert haben ist Argo-CD. Also das einzige was wir aktuell installiert haben"}, {"id": 160, "start": 1220.48, "end": 1225.92, "text": "auf unserem Kubernetes Cluster ist Argo-CD. Argo-CD ist ein Tool was dafür gedacht ist"}, {"id": 161, "start": 1225.92, "end": 1232.72, "text": "um eben solche Konfig hier aus einem Git Repo automatisch auf Kubernetes Cluster auszuführen."}, {"id": 162, "start": 1232.72, "end": 1241.12, "text": "Also man macht dann gar nichts mehr per kubectl sondern man ändert so eine Datei, pusht das"}, {"id": 163, "start": 1241.12, "end": 1249.2, "text": "ins Git Repo und Argo-CD applyt das automatisch auf den Cluster. So das funktioniert allerdings"}, {"id": 164, "start": 1249.2, "end": 1253.92, "text": "aktuell gerade nicht weil mein GitHub Talken ausgelaufen ist und das Ding kommt nicht zu"}, {"id": 165, "start": 1253.92, "end": 1259.88, "text": "GitHub. Das heißt ich muss mal kurz mein GitHub Talken drüber kopieren damit wir heute weiter"}, {"id": 166, "start": 1259.88, "end": 1268.04, "text": "machen können. So Clipboard aus. Chat ihr müsst jetzt leider mal kurz weggucken. Ich"}, {"id": 167, "start": 1268.04, "end": 1273.12, "text": "weiß ihr guckt auch so weg wenn ich sage aber manchmal muss man auch nur sicher gehen."}, {"id": 168, "start": 1273.12, "end": 1290.32, "text": "Wo haben wir es denn hier? GitHub Talken. Dauert eine Minute da muss ich den Clamp drüber kopieren."}, {"id": 169, "start": 1290.32, "end": 1311.92, "text": "Ich hoffe man sieht nichts mehr. Github Talken. Da ist es zack. Glaube das war es. Das sollte"}, {"id": 170, "start": 1311.92, "end": 1324.6, "text": "reichen. Gehen wir mal zurück. Mache euch wieder an. Und ich hoffe ich habe meinen Talken"}, {"id": 171, "start": 1324.6, "end": 1328.2, "text": "jetzt nicht geleakt. Nein ich habe nicht meinen Talken geleakt. Und selbst wenn ich meinen"}, {"id": 172, "start": 1328.2, "end": 1332.12, "text": "Talken geleakt hätte das wäre nicht so schlimm. Weil ich habe was gemacht was ich schon längst"}, {"id": 173, "start": 1332.12, "end": 1335.8, "text": "hätte machen sollen wenn ich öfter streamen und in GitHub rum klicke. Kann ich euch vielleicht"}, {"id": 174, "start": 1335.8, "end": 1342.24, "text": "auch noch mal so als Sixhead Tipp erzählen. Wenn ihr einen privaten GitHub Account habt"}, {"id": 175, "start": 1342.24, "end": 1348.68, "text": "so wie ich hier und ihr habt da einige Repos drinnen und ihr habt Talkens generiert wo"}, {"id": 176, "start": 1348.68, "end": 1352.2, "text": "man Zugriff auf Repos hat wo ihr vielleicht nicht wollt dass jeder wenn ihr aus Versehen"}, {"id": 177, "start": 1352.2, "end": 1356.56, "text": "im Stream mal das Talken zeigt auf eure privaten Repos Zugriff hat dann könnt ihr folgendes"}, {"id": 178, "start": 1356.56, "end": 1361.16, "text": "machen. Ihr könnt eine Organisation erstellen auf GitHub zum Beispiel so hier wie ich hier"}, {"id": 179, "start": 1361.16, "end": 1369.12, "text": "5header und dann erstellt ihr euch einen neuen GitHub User mit irgendeiner Fake E-Mail Adresse"}, {"id": 180, "start": 1369.12, "end": 1374.32, "text": "oder aber mit irgendeiner E-Mail Adresse irgendeiner Catch All E-Mail Adresse von einem eurer Domains"}, {"id": 181, "start": 1374.32, "end": 1380.24, "text": "erstellt ihr euch einen neuen User und gebt diesem User Zugriff auf diese Organisation"}, {"id": 182, "start": 1380.24, "end": 1385.12, "text": "dann hat und dann stellt ihr die Talkens nur mit diesem neuen User aus dann habt ihr Zugriff"}, {"id": 183, "start": 1385.12, "end": 1391.12, "text": "auf die Repos in der Organisation mit eurem alten User mit dem ihr normalerweise verwendet"}, {"id": 184, "start": 1391.12, "end": 1396.0, "text": "und mit eurem neuen User aber wenn ihr das Talken liegt kann nichts Schlimmeres passieren"}, {"id": 185, "start": 1396.0, "end": 1401.04, "text": "als dass Leute Zugriff bekommen auf die Repos in eurer Organisation und dann muss man halt"}, {"id": 186, "start": 1401.04, "end": 1415.64, "text": "sich überlegen was man da reinpusht und was nicht. Ja so siehts aus. Ok. Delete. Ich initialisiere"}, {"id": 187, "start": 1415.64, "end": 1421.16, "text": "mal unseren Cluster neu und diesmal mit dem richtigen Git-Talken und dann hoffe ich zumindest"}, {"id": 188, "start": 1421.16, "end": 1429.56, "text": "dass es jetzt das richtige Git-Talken ist. Ihr habt den Blackscreen durchschaut. Shit."}, {"id": 189, "start": 1429.56, "end": 1436.48, "text": "Jetzt ist vorbei. Blackscreen hack. Finde ich persönlich schlimmer als Blackfacing zu"}, {"id": 190, "start": 1436.48, "end": 1443.52, "text": "Fasching. Oh da haben sie wieder diskutiert aber ich sag dazu nichts. Ich sag dazu nichts"}, {"id": 191, "start": 1443.52, "end": 1453.8, "text": "das ist eine mühsliche Diskussion. So ist das Ding gestartet. Apply. Ich hoffe es funktioniert"}, {"id": 192, "start": 1453.8, "end": 1457.36, "text": "jetzt sonst müssen wir heute anfangen ohne dass ich euch den letzten Stand zeigen kann."}, {"id": 193, "start": 1457.36, "end": 1466.8, "text": "Ok nicht nochmal ausführen. Secret. Secret ist noch nicht da das ist ok. Get Pots wir"}, {"id": 194, "start": 1466.8, "end": 1473.16, "text": "können auch K9S aufmachen und uns die Pots angucken und feststellen dass Argo CD Server"}, {"id": 195, "start": 1473.16, "end": 1479.04, "text": "gerade erstellt wird und deswegen man auch noch nicht drauf zugreifen kann. Aha da"}, {"id": 196, "start": 1479.04, "end": 1487.92, "text": "sind wir. Passwort. Port forward machen in den Cluster. Öffnen. Admin. Zack. Sign in."}, {"id": 197, "start": 1487.92, "end": 1495.16, "text": "Update. Und. Ach das ist normal das kommt manchmal vor. Das kommt manchmal vor wenn"}, {"id": 198, "start": 1495.16, "end": 1501.36, "text": "man zu oft auf GitHub zugegriffen hat. Dann gehts das geht gleich. Das wird gleich. Repository"}, {"id": 199, "start": 1501.36, "end": 1520.24, "text": "not found. Welches Repo nehmen wir denn überhaupt. Ich hätte ich wäre halt doof dass meine"}, {"id": 200, "start": 1520.24, "end": 1528.96, "text": "Github Keys abgelaufen sind. Welches Repo nehmen wir denn überhaupt. Github ja. Ach"}, {"id": 201, "start": 1528.96, "end": 1533.68, "text": "ich hab mein privates Repo noch. Ja ne das funktioniert natürlich nicht. Wenn ich mein"}, {"id": 202, "start": 1533.68, "end": 1542.52, "text": "privates Repo nehme. Ok dann müssen wir das mal umstellen. Und zwar. Git. Remote. Rm."}, {"id": 203, "start": 1542.52, "end": 1551.68, "text": "Origin. Git. Remote. Add. Origin. Im neuen Repo. Und dann sagen wir Git. Push. Oh."}, {"id": 204, "start": 1551.68, "end": 1559.96, "text": "Bridge. Genau. Git. Push. Origin. Master. Oder Main. Wie es euch beliebt. Und dann"}, {"id": 205, "start": 1559.96, "end": 1567.0, "text": "haben wir hier den ganzen Krempel drinnen. Sehr schön. Gut. Und jetzt können wir pushen."}, {"id": 206, "start": 1567.0, "end": 1579.92, "text": "So jetzt können wir das ganze noch mal ausführen. Unser Cluster initialisieren und hoffen dass"}, {"id": 207, "start": 1579.92, "end": 1585.08, "text": "es jetzt endlich funktioniert. Es wird wahrscheinlich auch nicht funktionieren. Weil meine App glaube"}, {"id": 208, "start": 1585.08, "end": 1597.88, "text": "ich auch in einem privaten Repo von meinem privaten Account liegt. Ja. Leider. Ne. Cute"}, {"id": 209, "start": 1597.88, "end": 1611.36, "text": "App. Naja gut. Das ist egal. Die App kann ruhig fehlschlagen. Ich kann euch aber zeigen"}, {"id": 210, "start": 1611.36, "end": 1617.48, "text": "dass es soweit alles funktioniert. Im Cluster. Weil wir machen das heute eh anders. Ihr habt"}, {"id": 211, "start": 1617.48, "end": 1620.92, "text": "ja mitbekommen ich hab jetzt Probleme mit meinen Github Secrets. Dass ich die hier nicht leake"}, {"id": 212, "start": 1620.92, "end": 1626.56, "text": "und sonst was. Wir kümmern uns heute um zwei Sachen. Einmal Secret Management in Kubernetes"}, {"id": 213, "start": 1626.56, "end": 1632.08, "text": "um Zertifikate. Aber erstmal um Secret Management. Also wenn ihr einen Kubernetes Cluster habt"}, {"id": 214, "start": 1632.08, "end": 1638.2, "text": "da werden ja da höchstwahrscheinlich entweder Infrastruktur Management Anwendungen drin laufen"}, {"id": 215, "start": 1638.2, "end": 1643.28, "text": "die Talkons, Passwörter, Usernamen und sowas brauchen damit sie funktionieren. Oder aber"}, {"id": 216, "start": 1643.28, "end": 1647.96, "text": "ihr habt irgendwelche Apps die irgendwo drauf hinzugreifen müssen. Die brauchen auch Passwörter,"}, {"id": 217, "start": 1647.96, "end": 1653.8, "text": "Usernamen, Talkons und haste nicht gesehen. Und da gibt es zwei verschiedene Varianten"}, {"id": 218, "start": 1653.8, "end": 1664.92, "text": "wie man das machen kann. Wir machen das heute mit einem Secret Manager. So. Rampel ist gepusht."}, {"id": 219, "start": 1664.92, "end": 1688.28, "text": "Apply. Recaps Wobblors. Was sieht man da? Das meist benutzte E-Mode ist Wubgasm. Alles"}, {"id": 220, "start": 1688.28, "end": 1702.68, "text": "klar. Gucken wir uns später angucken. So Cluster ist eingerichtet. Forward. Ne Secret. So und"}, {"id": 221, "start": 1702.68, "end": 1705.8, "text": "dann können wir uns angucken wo wir das letzte Mal stehen geblieben sind. Ich hoffe es funktioniert"}, {"id": 222, "start": 1705.8, "end": 1718.52, "text": "jetzt. Ansonsten machen wir einfach weiter. Local Hosts. Update. Alter. Ah Moment. Moment."}, {"id": 223, "start": 1718.52, "end": 1726.72, "text": "Das ist das Initiale. Ich hab Probleme auf GitHub zuzugreifen. Wait a minute. Ich hab"}, {"id": 224, "start": 1726.72, "end": 1733.76, "text": "das Repo noch nicht angepasst, oder? Ich hab das Repo noch nicht angepasst. Das ist"}, {"id": 225, "start": 1733.76, "end": 1754.48, "text": "5header. 5header. Ok jetzt. Ne Moment. Was mach ich denn hier? Das hier. So. So ist"}, {"id": 226, "start": 1754.48, "end": 1762.6, "text": "richtig. Und dann auch mit dem großen H an der Stelle. Jetzt aber gut. Jetzt nochmal"}, {"id": 227, "start": 1762.6, "end": 1771.0, "text": "und dann soll es aber endlich funktionieren. Basefin 16. Very secure. Highly, highly secure."}, {"id": 228, "start": 1771.0, "end": 1786.08, "text": "Ist schon. Achso ne das Repo nicht. Das kann ich dir zeigen. Das Secret ist hier drinnen."}, {"id": 229, "start": 1786.08, "end": 1793.52, "text": "Da. Guck der macht hier ein bisschen Magic. Der stellt ein wie oft er GitHub abfragt und"}, {"id": 230, "start": 1793.52, "end": 1801.48, "text": "hier kommen die ganzen Secrets her. Deswegen hat es eben auch nicht funktioniert. Das"}, {"id": 231, "start": 1801.48, "end": 1805.0, "text": "sei das Ding. ArgoCD muss funktionieren damit ich mein Cluster gescheit da drüber verwalten"}, {"id": 232, "start": 1805.0, "end": 1807.8, "text": "kann. Sonst müsste ich jetzt halt von Hand apply nochmal. Wär ja auch nicht schlimm."}, {"id": 233, "start": 1807.8, "end": 1832.08, "text": "So. Apply. Kommt drauf an. Kommt drauf an wieviel du da drauf laufen lasst. Also so pauschal"}, {"id": 234, "start": 1832.08, "end": 1835.76, "text": "finde ich kann man es nicht sagen. Man muss sich bei Kubernetes halt mit ganz vielen Sachen"}, {"id": 235, "start": 1835.76, "end": 1840.84, "text": "drum herum beschäftigen. Kubernetes an sich ist nicht das Problem. So das gesamte Ökosystem"}, {"id": 236, "start": 1840.84, "end": 1846.0, "text": "und die ganzen Feinheiten. Und wenn man dann vom hundertsten ins tausendste gucken muss"}, {"id": 237, "start": 1846.0, "end": 1850.0, "text": "das ist tatsächlich ein Problem. Also Docker Compose File ist auf jeden Fall einfacher"}, {"id": 238, "start": 1850.0, "end": 1854.48, "text": "zu managen. Um Welten einfacher zu managen. Aber wenn man ab und zu mal was ändern muss."}, {"id": 239, "start": 1854.48, "end": 1868.12, "text": "Also ein Kubernetes Cluster. Aber ansonsten kann das durchaus Sinn machen. Also ich würde"}, {"id": 240, "start": 1868.12, "end": 1883.68, "text": "jetzt nicht sagen es ist doof. Also das kann durchaus Sinn machen ja. So jetzt aber Cluster"}, {"id": 241, "start": 1883.68, "end": 1900.72, "text": "please funktionier. Was? Wollt ihr mich verarschen? Ich hab's so angepasst. I-Fedder? Hä? Moment"}, {"id": 242, "start": 1900.72, "end": 1905.68, "text": "ich applye das jetzt gleich nochmal. Ohne den Cluster neu aufzubauen. Hab ich doch irgendwie"}, {"id": 243, "start": 1905.68, "end": 1935.44, "text": "nur drinstehen? Fuck genau. Ach so. Ja dann. Okay mal gucken ob es jetzt funktioniert."}, {"id": 244, "start": 1935.44, "end": 1944.08, "text": "Ja ja forward alles gut. Ah jetzt ist schon besser. Kaum passt man das repo an ist alles"}, {"id": 245, "start": 1944.08, "end": 1951.56, "text": "gut. So und was ihr jetzt nicht gesehen habt ist. Der züngt sich jetzt automatisch alle"}, {"id": 246, "start": 1951.56, "end": 1959.16, "text": "anderen Apps rüber. Wie euch vielleicht aufgefallen ist. Also ich hab eine Root App also so eine"}, {"id": 247, "start": 1959.16, "end": 1965.84, "text": "Master App so eine Main App in meinem Repo drinne und die holt sich aus diesem Verzeichnis"}, {"id": 248, "start": 1965.84, "end": 1972.4, "text": "alle anderen App Definitionen. Das ist quasi so die Base App selbst. Das ist meine selbst"}, {"id": 249, "start": 1972.4, "end": 1977.48, "text": "entwickelte App und das hier ist Argo CD selbst. Das hat den großen Vorteil ich zeig"}, {"id": 250, "start": 1977.48, "end": 1982.44, "text": "es euch jetzt nochmal. Das geht übrigens an der Stelle nicht. Weil ich keinen Zugriff"}, {"id": 251, "start": 1982.44, "end": 1991.04, "text": "auf das Repo hab und auch nicht auf das Repo mit dem Image. Aber das müssen wir eh fixen."}, {"id": 252, "start": 1991.04, "end": 2015.76, "text": "Cute. Cute App. Wir machen jetzt hier nochmal für die Cute App ein Repo. Äh Public. Bäm"}, {"id": 253, "start": 2015.76, "end": 2033.04, "text": "geb ihm. Kopieren. Git Remote Rm Origin Git Add Push. Ok jetzt haben wir den ganzen Klempel"}, {"id": 254, "start": 2033.04, "end": 2042.2, "text": "hier. Ich hoffe die Action funktioniert auch. Git Tag. Ach ja gut. Minus Minus Tags pushen"}, {"id": 255, "start": 2042.2, "end": 2049.8, "text": "alles gut. So ich hoffe meine Action funktioniert. Nö die Action funktioniert nicht. Ok warum"}, {"id": 256, "start": 2049.8, "end": 2072.68, "text": "auch immer. Action. Ah weil Action. Sollte die GitHub Action nicht funktionieren jetzt"}, {"id": 257, "start": 2072.68, "end": 2082.72, "text": "eigentlich. Äh ich sag da gleich was zu. Ich guck mir gleich den Chat an. Warum geht"}, {"id": 258, "start": 2082.72, "end": 2090.96, "text": "meine GitHub Action nicht. Muss ich vielleicht ein neues Tag machen. Tag. Version 6 oder"}, {"id": 259, "start": 2090.96, "end": 2099.08, "text": "so. Warum läuft meine GitHub Action nicht. Ach jetzt. Best Feature ever. Ok. Action"}, {"id": 260, "start": 2099.08, "end": 2103.0, "text": "läuft. Gucken wir mal kurz in die Action rein. Ja ich muss das alles jetzt umziehen"}, {"id": 261, "start": 2103.0, "end": 2108.2, "text": "in meine Public Orga. Deswegen muss ich das nochmal ein bisschen fixen vom letzten Mal."}, {"id": 262, "start": 2108.2, "end": 2112.6, "text": "Bevor wir heute mit der eigentlichen Geschichte anfangen können. So blub blub blub. Wo bloß"}, {"id": 263, "start": 2112.6, "end": 2121.6, "text": "ist auch verkehrt. Aufwärts. Pfeilfeder muss das sein. So. Pfeilfeder Cute App. Und"}, {"id": 264, "start": 2121.6, "end": 2150.76, "text": "dann muss ich noch der Action. Rechte geben. Äh. Äh. Warum geht das nicht. Äh. Äh."}, {"id": 265, "start": 2150.76, "end": 2179.96, "text": "Wo ist das Problem. Warum darf ich das nicht einstellen. Äh. Äh. Äh. Äh. Äh. Äh."}, {"id": 266, "start": 2179.96, "end": 2198.24, "text": "Hä. Wo ist das Problem. External Secrets probiere ich heute aus. Ähm. Ok. Muss ich irgendwie"}, {"id": 267, "start": 2198.24, "end": 2205.96, "text": "den User wechseln. Muss ich irgendwie in den Organisations User wechseln oder sowas."}, {"id": 268, "start": 2205.96, "end": 2220.64, "text": "Warum darf ich hier nichts einstellen. Wo ich die Secrets ablege in dem lokalen Vault."}, {"id": 269, "start": 2220.64, "end": 2226.36, "text": "Das ist jetzt kacke. Ich brauche GitHub Actions die in die Container Registry pushen dürfen."}, {"id": 270, "start": 2226.36, "end": 2247.6, "text": "Warum geht das nicht. Settings. Muss man da vielleicht irgendwas einstellen. Packages."}, {"id": 271, "start": 2247.6, "end": 2258.2, "text": "Action. General. Vielleicht da drüber. Aha. Aha. Man muss es komplett für die Organisation"}, {"id": 272, "start": 2258.2, "end": 2265.92, "text": "erst mal erlauben dass das funktioniert. Alles klar. Ok. Das ist gut zu wissen. Das"}, {"id": 273, "start": 2265.92, "end": 2273.56, "text": "war mir so nicht klar. GitHub. Pfeilfeder. Shit. Ne ne das ist nicht Premium Only. So"}, {"id": 274, "start": 2273.56, "end": 2284.72, "text": "sind wir in der App. Gehen wir in die Settings. Nochmal in die Actions. General. Jetzt. Ok."}, {"id": 275, "start": 2284.72, "end": 2288.68, "text": "Alles klar. Jetzt passt es. Gut. Weil unsere Actions sollten fehlgeschlagen sein und zwar"}, {"id": 276, "start": 2288.68, "end": 2295.84, "text": "mit er hat keine Rechte auf die Container Registry verbinden to push. Tja. So sieht"}, {"id": 277, "start": 2295.84, "end": 2300.4, "text": "es aus. Neuer Tag. Sollten die alten vielleicht mal löschen. Aber gut. Tags löscht man"}, {"id": 278, "start": 2300.4, "end": 2306.52, "text": "eigentlich nicht. Tags sollten eigentlich unverändert so auf immer das gleiche Comet"}, {"id": 279, "start": 2306.52, "end": 2310.48, "text": "zeigen. Aber man kann Tags löschen. Nur dass man was nicht machen sollte heißt ja nicht"}, {"id": 280, "start": 2310.48, "end": 2321.92, "text": "dass man es nicht machen kann. So und jetzt geht hoffentlich. Der Workflow für meine"}, {"id": 281, "start": 2321.92, "end": 2328.4, "text": "Container Registry. Und dann gucke ich mir und dann gucke ich mir den Chat an. Push"}, {"id": 282, "start": 2328.4, "end": 2333.6, "text": "das Image ins richtige Repo. Ich hab es eben angepasst ja. Ich bilde mir ein ich hab es"}, {"id": 283, "start": 2333.6, "end": 2340.88, "text": "eben angepasst auf Pfeilfeder Organisation. Sehen wir jetzt gleich. Ach fuck. Ne hä warum"}, {"id": 284, "start": 2340.88, "end": 2350.92, "text": "nicht. Ich hab das doch eben angepasst. Ah ich hab nicht gepullt lokal. Ich hab vergessen"}, {"id": 285, "start": 2350.92, "end": 2377.24, "text": "zu pullen. Ja. Was. Ich hab vergessen zu pullen. Ok. Jetzt aber."}, {"id": 286, "start": 2377.24, "end": 2385.8, "text": "Also wer wissen will wie man Tags pusht ist eigentlich relativ easy. Man sagt git push"}, {"id": 287, "start": 2385.8, "end": 2394.2, "text": "und entweder minus minus du lead oder Doppelpunkt 0.0.1 zum Beispiel. Oder git push origin."}, {"id": 288, "start": 2394.2, "end": 2398.84, "text": "So und dann kann man den ersten Tag zum Beispiel löschen. Und dann muss man allerdings auch"}, {"id": 289, "start": 2398.84, "end": 2402.52, "text": "noch sagen dass man ihn lokal löscht weil ansonsten ist er irgendwann einfach wieder"}, {"id": 290, "start": 2402.52, "end": 2418.4, "text": "da. Dann ist der Tag weg. Aus irgendwelchen Gründen ist jetzt der GitHub Workflow nicht"}, {"id": 291, "start": 2418.4, "end": 2426.72, "text": "gelaufen. Ja Mensch was ist denn heute los. Warum geht denn das nicht. Jetzt. So. Please"}, {"id": 292, "start": 2426.72, "end": 2432.24, "text": "Prage Chat. Wir brauchen wieder eine Runde Prage dass das funktioniert. Das letzte Mal"}, {"id": 293, "start": 2432.24, "end": 2438.44, "text": "hat es auch erst funktioniert als der Chat Prage gespammt hat. Gut nice Chat. Jetzt kann"}, {"id": 294, "start": 2438.44, "end": 2443.48, "text": "nichts mehr schief gehen. Jetzt ist jetzt alles gut. Jetzt easy win easy win. Jetzt läuft"}, {"id": 295, "start": 2443.48, "end": 2458.0, "text": "es ohne Probleme durch. Alter. Was. Was hat er denn jetzt für Probleme. Repository must"}, {"id": 296, "start": 2458.0, "end": 2468.52, "text": "be lowercase. Das ist aber heute wirklich ein ganz schöner Akt man. Ok. Repository must"}, {"id": 297, "start": 2468.52, "end": 2480.12, "text": "be lowercase. Also dann 5 header so geschrieben vielleicht. So. Massive. Tolles. The best"}, {"id": 298, "start": 2480.12, "end": 2491.56, "text": "feature ever. Genau. So muss es heißen. Neuer Tag drauf. Es ist nicht das rechte Problem."}, {"id": 299, "start": 2491.56, "end": 2495.52, "text": "Wir nähern uns. Wir nähern uns der Sache. Best feature ever wird gepusht. Es muss jetzt"}, {"id": 300, "start": 2495.52, "end": 2501.6, "text": "gehen. So viel Prage. So viel Prage wie im Chat ist muss es jetzt einfach gehen. Übrigens"}, {"id": 301, "start": 2501.6, "end": 2508.52, "text": "wenn man das schön machen will mit GitHub Actions man kann auch die Steps cashen sodass"}, {"id": 302, "start": 2508.52, "end": 2513.72, "text": "er nicht immer wieder den gleichen Container neu neu neu bauen muss. Potato Bob danke"}, {"id": 303, "start": 2513.72, "end": 2518.6, "text": "für den Sub. So jetzt Prage please. Ich will jetzt mal das eigentliche vom heutigen Stream"}, {"id": 304, "start": 2518.6, "end": 2524.48, "text": "machen und nicht GitHub Actions vom letzten Mal fixen. Push. Ok das ist gut. Das ist"}, {"id": 305, "start": 2524.48, "end": 2535.16, "text": "gut. Nice er hat gepusht. Endlich. Poggers. Nice. Ok. So jetzt kann ich in meinem Manifest"}, {"id": 306, "start": 2535.16, "end": 2545.16, "text": "einstellen. Hat funktioniert. Easy. So jetzt kann ich in meinem Manifest einstellen dass"}, {"id": 307, "start": 2545.16, "end": 2552.88, "text": "wir bei Qt App nicht Wuppler sondern 5 header verwenden wollen und zwar Version äh keine"}, {"id": 308, "start": 2552.88, "end": 2563.8, "text": "Ahnung. Punkt 10 ist glaube ich die letzte. So. Push. Best feature ever. Beste Git commits"}, {"id": 309, "start": 2563.8, "end": 2573.8, "text": "heute des Tages. Alles klar. Und jetzt sollte automatisch das ganze schon Applied werden."}, {"id": 310, "start": 2573.8, "end": 2596.04, "text": "Es kann doch gar nicht sein dass das Repo nicht gefunden wurde. Jetzt hat er es. Ist"}, {"id": 311, "start": 2596.04, "end": 2603.88, "text": "doch richtig. Ach es funktioniert ja auch. Es funktioniert. Es funktioniert. So Pods"}, {"id": 312, "start": 2603.88, "end": 2630.76, "text": "backing of image. Unauthorized. Das ist public. Das Image ist public."}, {"id": 313, "start": 2630.76, "end": 2642.84, "text": "Das Image ist public oder oder etwa nicht. Also das Repo ist public. Da ist normalerweise"}, {"id": 314, "start": 2642.84, "end": 2649.04, "text": "das. Nee ich brauche kein Key. Das Image. Das Image ist public. Guck. Probieren wir"}, {"id": 315, "start": 2649.04, "end": 2667.04, "text": "Git nicht geht. Alter doch. Ja wenn man das. Ich habe mit GitHub Organisation noch nie"}, {"id": 316, "start": 2667.04, "end": 2676.08, "text": "was gemacht aber normalerweise ist die Package Registry public wenn das Repo public ist und"}, {"id": 317, "start": 2676.08, "end": 2687.0, "text": "das Repo ist public. Ok Package Settings. Change Package Visibility. Ok aus irgendwelchen"}, {"id": 318, "start": 2687.0, "end": 2695.36, "text": "Gründen. Settings ist Disabled per Organisation Administrator. Glücklicherweise bin ich der"}, {"id": 319, "start": 2695.36, "end": 2724.12, "text": "Organisation Administrator und kann das. So wo könnte das jetzt sein Packages. Nee."}, {"id": 320, "start": 2724.12, "end": 2753.96, "text": "Nicht so hier drüber jetzt. Nee das das geht jetzt wahrscheinlich wieder nicht. Settings"}, {"id": 321, "start": 2753.96, "end": 2770.48, "text": "changes. Da vielleicht. Hier. Ah hier alle alle bitte einmal donaten. Ach hier. Ok alles"}, {"id": 322, "start": 2770.48, "end": 2775.8, "text": "klar. Das ist so huge League dass das die öffentliche Adresse ist die ich für Donations"}, {"id": 323, "start": 2775.8, "end": 2796.48, "text": "eingetragen habe. Ok jetzt müsste es aber eigentlich gehen. Repositories Cute App wobei"}, {"id": 324, "start": 2796.48, "end": 2806.16, "text": "ich habe es doch hier noch auf. Cute App. So. Change Visibility Public. Jawoll. Jetzt"}, {"id": 325, "start": 2806.16, "end": 2809.16, "text": "muss ich mit der SMS Authentifizierung machen oder irgend so ein Shit. Nee es geht einfach"}, {"id": 326, "start": 2809.16, "end": 2817.28, "text": "so. Nice. Ok Pull. Ja Gott sei Dank man. So hat sich mein Kubernetes Cluster von alleine"}, {"id": 327, "start": 2817.28, "end": 2824.96, "text": "gefixt. Nee der ist immer noch der Meinung Image. Backoff Image. Also der Cluster sollte"}, {"id": 328, "start": 2824.96, "end": 2832.2, "text": "sich von alleine fixen wenn ich ein bisschen warte. Weil aktuell hängt er im Pull Back"}, {"id": 329, "start": 2832.2, "end": 2836.56, "text": "off also der macht es jetzt erst in drei Minuten oder so versucht er wieder zu pullen. Das"}, {"id": 330, "start": 2836.56, "end": 2842.64, "text": "ist der Prompt das ist Starship. Ja das ist Starship. So also der Kubernetes Cluster fixt"}, {"id": 331, "start": 2842.64, "end": 2851.08, "text": "sich gleich von alleine. Warum das hier sich dreht da kann ich auch gleich noch was zu"}, {"id": 332, "start": 2851.08, "end": 2855.92, "text": "erzählen das liegt an meinem lokalen Setup dass das nicht funktioniert. So wenn wir jetzt"}, {"id": 333, "start": 2855.92, "end": 2865.04, "text": "lange genug warten bis der nochmal versucht das Image zu pullen dann fixt sich der Cluster"}, {"id": 334, "start": 2865.04, "end": 2869.52, "text": "von alleine. Das macht er so der versucht ein Image zu pullen wenn es nicht geht versucht"}, {"id": 335, "start": 2869.52, "end": 2874.36, "text": "er wieder ein Image zu pullen und dann macht er so einen Backoff also quasi dann versucht"}, {"id": 336, "start": 2874.36, "end": 2877.28, "text": "er für eine Minute nicht zu pullen dann für zwei Minuten nicht zu pullen dann für vier"}, {"id": 337, "start": 2877.28, "end": 2881.84, "text": "Minuten nicht zu pullen also ich weiß die genauen Intervalle ehrlich gesagt nicht aber"}, {"id": 338, "start": 2881.84, "end": 2885.76, "text": "so in der Richtung dass er nicht permanent irgendwelche Registries voll spammt mit Images"}, {"id": 339, "start": 2885.76, "end": 2893.12, "text": "die es vielleicht nicht gibt. Also er müsste sich gleich von selbst reparieren oder ich"}, {"id": 340, "start": 2893.12, "end": 2898.4, "text": "kann sagen recreate Deployment das würde auch funktionieren. Also was man unter Kommando"}, {"id": 341, "start": 2898.4, "end": 2913.44, "text": "Zeile sagen kann ist z.B. sowas wie Cube CTL ich glaube. Nee Ree. Wie ist es. Restart Deployment"}, {"id": 342, "start": 2913.44, "end": 2928.48, "text": "boah weiß ich aus dem Kopf gar nicht. CTL Restart Deployment. Warum findet man da nicht"}, {"id": 343, "start": 2928.48, "end": 2942.12, "text": "gleich was. Was. Was. Deployment. Nee. Replace. Nee. Nee. Replace was nicht. Rollout. Ach"}, {"id": 344, "start": 2942.12, "end": 2948.12, "text": "hier Rollout. Rollout Restart Deployment und dann die App. Das könnte man machen oder"}, {"id": 345, "start": 2948.12, "end": 2956.4, "text": "die oder die oder die die Pods weghauen aber eigentlich sollte. Aha. Aha. Jetzt hat das"}, {"id": 346, "start": 2956.4, "end": 2961.24, "text": "jetzt hat das gecheckt. Jetzt hat er sich selbst repariert weil er jetzt das Image pullen"}, {"id": 347, "start": 2961.24, "end": 2971.08, "text": "konnte. Okay alles funktioniert. Anwendung läuft. Aus irgendwelchen Gründen proprogress"}, {"id": 348, "start": 2971.08, "end": 2980.88, "text": "er noch wegen dem ingress alles gut. So da kann ich euch zeigen wie die App aussieht"}, {"id": 349, "start": 2980.88, "end": 2986.52, "text": "wenn man die aufmacht und zwar unter CuteAppKappaLull.com ich hoffe. Okay aus irgendwelchen. Ja Moment"}, {"id": 350, "start": 2986.52, "end": 2999.36, "text": "nicht nicht. Okay. Hä. Wait a minute. Ach so. Oh man ich hab mir das Ingress noch nicht"}, {"id": 351, "start": 2999.36, "end": 3005.88, "text": "an. Das muss ich unbedingt in mein Startscript reinschreiben. Sonst werde ich mich da noch"}, {"id": 352, "start": 3005.88, "end": 3017.32, "text": "oft wundern warum irgendwelche Sachen nicht funktionieren. Start. Nee. Ach so das ist"}, {"id": 353, "start": 3017.32, "end": 3038.64, "text": "hier. Start. So. Okay. CuteApp. Da ist die App. Okay. Also das ist das wo wir das letzte"}, {"id": 354, "start": 3038.64, "end": 3042.32, "text": "Mal. Hat jetzt nur 50 Minuten gedauert bis wir da sind wo wir das letzte Mal gewesen"}, {"id": 355, "start": 3042.32, "end": 3050.0, "text": "sind. Also das ist das wo wir das letzte Mal stehen geblieben sind. Wir haben eine Installation"}, {"id": 356, "start": 3050.0, "end": 3055.2, "text": "mit ArgoCD am Start und einer selbst programmierten App die da drüber deployed wird. Nochmal"}, {"id": 357, "start": 3055.2, "end": 3061.0, "text": "ganz kurz was das coole daran ist. Normalerweise administriert man seinen Cluster über Kommando"}, {"id": 358, "start": 3061.0, "end": 3065.16, "text": "Zeile. Was heißt normalerweise. Eigentlich macht man das normalerweise nicht. Zum starten"}, {"id": 359, "start": 3065.16, "end": 3069.44, "text": "macht man es oftmals. Über Kommando Zeile. Aber es ist natürlich besser wenn das ganze"}, {"id": 360, "start": 3069.44, "end": 3073.6, "text": "nachvollziehbar ist. Über YAML Files in irgendeinem Git Repo. Da hat man eine History wo"}, {"id": 361, "start": 3073.6, "end": 3076.92, "text": "man nachgucken kann. Da kann man einfacher auch zurückrollen. Änderungen rückgängig"}, {"id": 362, "start": 3076.92, "end": 3083.24, "text": "machen wenn was nicht geht. So und jetzt mal so als Beispiel was da dran ganz cool ist"}, {"id": 363, "start": 3083.24, "end": 3087.16, "text": "wenn das alles automatisch funktioniert. Ich muss nichts machen außer. Also ich habe"}, {"id": 364, "start": 3087.16, "end": 3095.54, "text": "aktuell wie ihr hier seht habe ich 1 2 3 4 5 6 Backends laufen von meiner App. Steht"}, {"id": 365, "start": 3095.54, "end": 3103.16, "text": "auch hier drin. 6 Stück. Wenn ich jetzt sage ach komm es ist Nacht. Es ist Nacht. Ich brauche"}, {"id": 366, "start": 3103.16, "end": 3106.76, "text": "gar nicht so viele. Das kann man übrigens auch automatisch machen. Da kommen wir vielleicht"}, {"id": 367, "start": 3106.76, "end": 3112.04, "text": "irgendwann auch nochmal dazu. Dann kann ich sagen ok es ist jetzt bald Nacht. Da brauche"}, {"id": 368, "start": 3112.04, "end": 3116.2, "text": "ich ja nur 3. Das reicht ja. Oder sogar ich brauche ok ich brauche nur 2. Ich brauche"}, {"id": 369, "start": 3116.2, "end": 3120.84, "text": "nur 2. Weil es ist Nacht. Ist kaum Last drauf. Und dann trage ich das hier in mein Git Repo"}, {"id": 370, "start": 3120.84, "end": 3128.24, "text": "rein. Gehe in mein Repo. Mache ein Comet. Push das ganze. Also ich push jetzt die Änderung"}, {"id": 371, "start": 3128.24, "end": 3132.64, "text": "wo ich hier von 6 auf 2 runter bin. Push die Änderung. So und jetzt gucken wir mal hier"}, {"id": 372, "start": 3132.64, "end": 3143.44, "text": "zu. So in ein paar Sekunden wird er jetzt auf einmal die ganze Sache. Wartet mal. Mach"}, {"id": 373, "start": 3143.44, "end": 3149.4, "text": "mal so das man es vielleicht besser sieht. So in ein paar Sekunden falls ich automatisch"}, {"id": 374, "start": 3149.4, "end": 3156.76, "text": "Deployment eingestellt habe. Wird er jetzt runter skalieren. Auf 2 Pods. Habt ihr gesehen"}, {"id": 375, "start": 3156.76, "end": 3162.44, "text": "ich musste nichts machen. Der hat das automatisch über AgroCD ausgerollt. AgroCD hat die neuen"}, {"id": 376, "start": 3162.44, "end": 3171.16, "text": "Änderungen aus GitHub gepullt. Hat gesehen. Aha. ReplikaZ wurde verringert auf 2. Und"}, {"id": 377, "start": 3171.16, "end": 3176.24, "text": "darauf hin wurde es automatisch applied auf den Cluster. Und meine Pod Anzahl ist runter"}, {"id": 378, "start": 3176.24, "end": 3183.16, "text": "gegangen auf 2. So und wenn jetzt zufälligerweise. Was gibt es denn für deutsche gehypte YouTuber."}, {"id": 379, "start": 3183.16, "end": 3189.32, "text": "Was ist denn da aktuell so angesagt. Sagt mir mal irgendeiner der da gerade angesagt"}, {"id": 380, "start": 3189.32, "end": 3195.76, "text": "ist. Ich blicke nicht durch in YouTube Deutschland. Max FPS. Genau wenn jetzt zufälligerweise"}, {"id": 381, "start": 3195.76, "end": 3202.12, "text": "Max FPS ein Video zugemacht der Apo rett bestimmt nicht. Oder ist er immer noch aus dem Insie"}, {"id": 382, "start": 3202.12, "end": 3207.56, "text": "Modus wieder raus. Also wenn jetzt irgendein bekannter YouTuber zufälligerweise ein Video"}, {"id": 383, "start": 3207.56, "end": 3213.36, "text": "über eure App gemacht hat. Beziehungsweise über eure Website gemacht hat. Und ihr ganz"}, {"id": 384, "start": 3213.36, "end": 3220.2, "text": "viel Traffic bekommt. Dann könnt ihr sagen wir skalieren jetzt mal diagonal auf den Mount"}, {"id": 385, "start": 3220.2, "end": 3229.2, "text": "Everest und sagen wir brauchen 12 Pods. Wird eingestellt. Hups. Eingestellt. Comet gemacht."}, {"id": 386, "start": 3229.2, "end": 3237.08, "text": "Gepusht. Und gleich werdet ihr sehen. Übrigens hier das ganze ich demonstriere das mal indem"}, {"id": 387, "start": 3237.08, "end": 3243.16, "text": "ich hier auf Refreshen drücke. Das ganze ohne Serviceausfall. Passt mal auf. Ihr werdet"}, {"id": 388, "start": 3243.16, "end": 3248.88, "text": "es gleich sehen. Also ich guck jetzt hat das abgerufen es skaliert hoch auf 12 Pods auf"}, {"id": 389, "start": 3248.88, "end": 3255.68, "text": "12 Backends. Und während der hoch skaliert habe ich keinen Serviceausfall. Also ich bekomme"}, {"id": 390, "start": 3255.68, "end": 3261.32, "text": "die ganze Zeit weiter meinen Service. Obwohl der grad Dinger im Hintergrund neu startet."}, {"id": 391, "start": 3261.32, "end": 3282.24, "text": "Stoppt und erweitert. So. Wir haben das letzte Mal tatsächlich getestet mit einem HTTP Benchmark"}, {"id": 392, "start": 3282.24, "end": 3291.32, "text": "Tool. Es sind von einer Million Requests 56 verloren gegangen oder 46 verloren gegangen."}, {"id": 393, "start": 3291.32, "end": 3295.16, "text": "Also es ist tatsächlich ganz ganz gut. Ich kann euch das ich kann. Können wir machen"}, {"id": 394, "start": 3295.16, "end": 3299.48, "text": "können wir machen. Leute wir machen. Ich zeige ich zeige euch das. So wir gehen jetzt mal"}, {"id": 395, "start": 3299.48, "end": 3303.6, "text": "wir gehen jetzt mal wieder runter auf drei Pods. Ich muss ich muss das Ding immer wieder"}, {"id": 396, "start": 3303.6, "end": 3306.92, "text": "auf den zweiten Bildschirm verschieben. Wir gehen jetzt mal runter auf zwei Pods. Puschen"}, {"id": 397, "start": 3306.92, "end": 3317.64, "text": "das. Warten bis das ganze Applied ist. Und dann machen wir mal einen Benchmark von. Keine"}, {"id": 398, "start": 3317.64, "end": 3325.72, "text": "Ahnung hier von von zwei Minuten. Auf den auf den auf den Service. So ich warte jetzt"}, {"id": 399, "start": 3325.72, "end": 3329.04, "text": "erst mal bis das ganze Applied wurde. Wobei ich kann es ein bisschen beschleunigen nehme"}, {"id": 400, "start": 3329.04, "end": 3338.36, "text": "ich hier von Hand auf Refresh drücke. So. Pots runter skaliert. Alles gut. Ihr seht es"}, {"id": 401, "start": 3338.36, "end": 3344.8, "text": "sind bloß noch drei Pods am Start. Und jetzt schreibe ich hier mal wieder rein. Wir skalieren"}, {"id": 402, "start": 3344.8, "end": 3351.0, "text": "jetzt hoch auf neun Pods. Ich pushe das jetzt und dann mache ich ein HTTP Benchmark an."}, {"id": 403, "start": 3351.0, "end": 3357.12, "text": "Und dann gucken wir mal zu. Ich lasse es jetzt. Ich lasse es jetzt eine Minute laufen. Gucken"}, {"id": 404, "start": 3357.12, "end": 3370.56, "text": "wir hier wieder zu. Na gut das oben kann ich mir eigentlich sparen. So es sind noch drei"}, {"id": 405, "start": 3370.56, "end": 3377.2, "text": "es sind noch drei. Ich mache gerade ganz viel ganz viel Benchmark im Hintergrund. So ich"}, {"id": 406, "start": 3377.2, "end": 3383.72, "text": "Refresh jetzt mal von Hand und jetzt skaliert er hoch. Jetzt skaliert er hoch auf neun Pods."}, {"id": 407, "start": 3383.72, "end": 3397.96, "text": "Gleich ist er fertig. Alles ready alles gut. So jetzt können wir jetzt okay jetzt können"}, {"id": 408, "start": 3397.96, "end": 3404.96, "text": "wir eigentlich noch die Zeit warten. Warten wir mal bis zwei Minuten um sind bis der Benchmark"}, {"id": 409, "start": 3404.96, "end": 3414.76, "text": "durch ist. Hier unten. Und dann werdet ihr sehen wie viel von den Requests wirklich in"}, {"id": 410, "start": 3414.76, "end": 3418.08, "text": "die Hose gegangen sind. Man darf nicht vergessen ich laufe hier auf einer VM und mache den"}, {"id": 411, "start": 3418.08, "end": 3422.08, "text": "Benchmark auf eine VM. Und meine gesamte VM ist komplett ausgelastet. Also daher kann"}, {"id": 412, "start": 3422.08, "end": 3430.2, "text": "es auch ein bisschen kommen. Ich lasse es jetzt mal kurz laufen die zwei Minuten also"}, {"id": 413, "start": 3430.2, "end": 3438.36, "text": "die paar Sekunden haben wir jetzt noch übrig dafür. So und ich gucke mal in den Chat. Also"}, {"id": 414, "start": 3438.36, "end": 3460.8, "text": "Prompt ist Starship ja."}, {"id": 415, "start": 3460.8, "end": 3477.16, "text": "Ich habe doch eben was gelesen im Chat wo ich gesagt habe da sage ich gleich was zu"}, {"id": 416, "start": 3477.16, "end": 3498.6, "text": "was war das denn noch mal."}, {"id": 417, "start": 3498.6, "end": 3508.56, "text": "Ne das war was anderes gewesen."}, {"id": 418, "start": 3508.56, "end": 3519.44, "text": "Welches Secret Management probierst du heute aus? Also ich habe lokal ein Vault laufen"}, {"id": 419, "start": 3519.44, "end": 3524.64, "text": "auf dem zweiten Rechner den seht ihr nicht. Da habe ich ein Cloudflare DNS Talken drinne"}, {"id": 420, "start": 3524.64, "end": 3531.92, "text": "und ich habe mein GitHub Talken drinne. Und wir werden aus der Vault Instanz Sünden in"}, {"id": 421, "start": 3531.92, "end": 3540.04, "text": "unseren Kubernetes Cluster mit dem External Secrets Manager heißt das Ding glaube ich"}, {"id": 422, "start": 3540.04, "end": 3551.92, "text": "oder einfach nur External Secrets. Ja ist auch eine sinnvolle Sache. Muss das nicht"}, {"id": 423, "start": 3551.92, "end": 3561.96, "text": "unbedingt alles in Kubernetes jammeln machen. Aber wenn sich Argo quasi selbst managt kann"}, {"id": 424, "start": 3561.96, "end": 3566.52, "text": "das sich dann selbst updaten. Das kann sich selbst updaten das klappt in der Regel auch"}, {"id": 425, "start": 3566.52, "end": 3572.04, "text": "ohne Probleme. Es kann aber auch in die Hose gehen. Also wenn irgendwas kaputt ist zwischen"}, {"id": 426, "start": 3572.04, "end": 3574.76, "text": "den Updates und es nicht mal startet dann hast du ein Problem dann kannst du nicht mehr"}, {"id": 427, "start": 3574.76, "end": 3580.52, "text": "so einfach zurückrollen über das Web Interface. Ich meine Applying per kubectl und sowas"}, {"id": 428, "start": 3580.52, "end": 3585.92, "text": "ist ganz natürlich immer noch. Es ist tatsächlich dann doof. Das heißt man könnte sich zum"}, {"id": 429, "start": 3585.92, "end": 3590.64, "text": "Beispiel auch überlegen hey man managt Argo CD nicht über Argo CD sondern man macht"}, {"id": 430, "start": 3590.64, "end": 3596.56, "text": "irgendwie mit einem Helm Chart ein Update oder ja sogar ganz von Hand. Oder noch sinniger"}, {"id": 431, "start": 3596.56, "end": 3601.12, "text": "vielleicht wenn man viele Kubernetes Cluster hat man lässt Argo CD zentral laufen nicht"}, {"id": 432, "start": 3601.12, "end": 3605.96, "text": "in jedem Cluster oder sowas sondern man lässt Argo CD einfach zentral laufen in irgendeinem"}, {"id": 433, "start": 3605.96, "end": 3612.08, "text": "nennen es mal Infrastruktur Management Cluster. Da kann dann auch gleich Prometheus mit laufen"}, {"id": 434, "start": 3612.08, "end": 3617.4, "text": "und alle möglichen Dinger. Dann hast du dann so nicht das Problem. Dann ist zumindest wenn"}, {"id": 435, "start": 3617.4, "end": 3623.72, "text": "Argo CD kaputt ist außer Argo CD sonst nix kaputt. Gibt es ja verschiedene Ansätze aber"}, {"id": 436, "start": 3623.72, "end": 3627.56, "text": "ja das geht und in der Regel geht das auch ohne Probleme aber es kann in die Hose gehen"}, {"id": 437, "start": 3627.56, "end": 3632.04, "text": "also muss man sich überlegen ob das eine gute Idee ist. Ne das kenne ich nicht."}, {"id": 438, "start": 3632.04, "end": 3649.04, "text": "Ok nice. So also Request. Leute es ist nichts. Es ist nichts. Es ist nicht ein Request verloren"}, {"id": 439, "start": 3649.04, "end": 3659.96, "text": "gegangen bei diesem Upgrade. Von einer Million Request ist nicht ein Request fehl geschlagen"}, {"id": 440, "start": 3659.96, "end": 3666.0, "text": "während ich meine App hochskaliert habe. Also ich glaube da kann man sich nicht beschweren"}, {"id": 441, "start": 3666.0, "end": 3676.88, "text": "oder? Ja die Response Time ging zwischenzeitlich mal ein bisschen hoch. Aber das war es. Und"}, {"id": 442, "start": 3676.88, "end": 3681.56, "text": "das ist halt wirklich das richtig coole an Kuba. Ne das sowas out of the box möglich ist."}, {"id": 443, "start": 3681.56, "end": 3687.44, "text": "Das ist auch der Hauptgrund warum sowas benutzt wird. Weil du eben on the fly dein Zeug abdecken"}, {"id": 444, "start": 3687.44, "end": 3693.48, "text": "kannst, hoch verfügbar machen, neu ausrollen kannst, super agil wie man so schon sagt gerade"}, {"id": 445, "start": 3693.48, "end": 3700.24, "text": "sein kannst, kontinuierlich kleine Verbesserungen rausbringen kannst, deine App updaten kannst"}, {"id": 446, "start": 3700.24, "end": 3704.84, "text": "ohne dass großartig was kaputt geht. Natürlich ist die App jetzt von mir enorm simpel. Das"}, {"id": 447, "start": 3704.84, "end": 3710.2, "text": "ist ein Web Request auf einen Endpunkt und fertig. Also da kann ja nichts großartig schief"}, {"id": 448, "start": 3710.2, "end": 3714.36, "text": "gehen. Es ist keine Datenbank dahinter. Da muss keine Datenbankmigration gemacht werden"}, {"id": 449, "start": 3714.36, "end": 3718.44, "text": "beim ersten starten. Das ist äußerst simpel. Natürlich ist es in der Praxis dann nicht"}, {"id": 450, "start": 3718.44, "end": 3722.16, "text": "so simpel wie es jetzt hier aussieht. Aber man sieht dass das prinzipiell möglich ist."}, {"id": 451, "start": 3722.16, "end": 3729.16, "text": "So und was wir uns heute angucken nachdem jetzt alles funktioniert ist folgendes. Ich mach"}, {"id": 452, "start": 3729.16, "end": 3734.96, "text": "mal die Cute App zu. Was wir uns heute angucken ist folgendes. Ich hoffe ich mach mein Cluster"}, {"id": 453, "start": 3734.96, "end": 3748.0, "text": "nicht kaputt dabei. Ich skaliere mal meine App wieder ein bisschen runter. Was wir uns"}, {"id": 454, "start": 3748.0, "end": 3753.52, "text": "angucken ist folgendes. Also ich brauche an dieser Stelle, nee an dieser Stelle, brauche"}, {"id": 455, "start": 3753.52, "end": 3759.44, "text": "ich meinen GitHub Talken und wenn ich Zertifikate generieren will, dann brauche ich auch meinen"}, {"id": 456, "start": 3759.44, "end": 3765.24, "text": "GitHub Talken. Heißt im Endeffekt, äh nicht beim GitHub, im Cloudflare Talken. Also ich"}, {"id": 457, "start": 3765.24, "end": 3769.24, "text": "brauche an der Stelle einen GitHub Talken und ich brauche bei den anderen Cloudflare"}, {"id": 458, "start": 3769.24, "end": 3775.16, "text": "DNS Talken. Aktuell mache ich das mit den Talkens so. Die Talkens sind nicht im Git"}, {"id": 459, "start": 3775.16, "end": 3782.16, "text": "Repo drinnen, weil ich will ja mein Cloudflare DNS Talken nicht in mein Public Git Repo einchecken."}, {"id": 460, "start": 3782.16, "end": 3791.44, "text": "Die Talkens mache ich am Anfang einmal initial per Kommandozeil in den Cluster und dann funktioniert"}, {"id": 461, "start": 3791.44, "end": 3795.96, "text": "es. Das ist natürlich nicht so der Weisheitsletzter Schluss, vor allem wenn man viele Secrets hat"}, {"id": 462, "start": 3795.96, "end": 3802.2, "text": "und wenn man Secrets hat, die sich auch ab und zu mal ändern. Muss ich dann CubeCTL machen"}, {"id": 463, "start": 3802.2, "end": 3806.32, "text": "für jeden Cluster den ich hab, muss ich dann dran denken, dass überall im Jaml irgendwie"}, {"id": 464, "start": 3806.32, "end": 3810.68, "text": "Referenzen und was auch immer anzupassen, neue Secrets, das ist auf jeden Fall doof."}, {"id": 465, "start": 3810.68, "end": 3819.32, "text": "So und um Passwörter, Talken und solche Geschichten in Kubernetes zu verwalten bzw. in Jaml Manifests"}, {"id": 466, "start": 3819.32, "end": 3826.76, "text": "zu verwalten, gibt es mehrere Ansätze. Es gibt einmal sowas hier. Sealed Secrets, das"}, {"id": 467, "start": 3826.76, "end": 3831.04, "text": "ist im Prinzip eine Verschlüsselung. Das heißt du schreibst deine Secrets immer noch"}, {"id": 468, "start": 3831.04, "end": 3836.44, "text": "in dein Jaml, du schreibst dein Passwort quasi immer noch in dein Jaml File rein. Allerdings"}, {"id": 469, "start": 3836.44, "end": 3841.92, "text": "du verschlüsselst das was hier drinnen steht und der Cluster selbst hat ein Zertifikat"}, {"id": 470, "start": 3841.92, "end": 3847.12, "text": "mit dem man das wieder entschlüsseln kann. Das ist eine ganz coole Geschichte. Wenn man"}, {"id": 471, "start": 3847.12, "end": 3853.68, "text": "das alles 100%ig in seinen Jaml Files haben will, ist das eine ganz coole Geschichte."}, {"id": 472, "start": 3853.68, "end": 3859.16, "text": "Wir machen heute das mit einem anderen Projekt und wir machen das heute mit dem External"}, {"id": 473, "start": 3859.16, "end": 3867.88, "text": "Secrets. Und zwar ist das ein Tool, das kann man installieren in seinem Kubernetes Cluster"}, {"id": 474, "start": 3867.88, "end": 3874.8, "text": "und das kann sich dann verbinden zu verschiedenen Passwort Saves. Aktuell unterstützen die natürlich"}, {"id": 475, "start": 3874.8, "end": 3882.68, "text": "den AWS Secret Store, Google Secret Manager und Azure irgendwo, wo ist er? Und Azure Keyboard."}, {"id": 476, "start": 3882.68, "end": 3887.44, "text": "Also natürlich unterstützen die die drei großen Cloud Anbieter, dann können sie noch IBM"}, {"id": 477, "start": 3887.44, "end": 3891.6, "text": "Secrets Manager, Achilles, das habe ich noch nie bemerkt. Vault, das werden wir heute benutzen."}, {"id": 478, "start": 3891.6, "end": 3902.0, "text": "Yandex, ist das irgendein China-Chinesen Zeug oder? Ne, Yandex in Russen oder? GitLab Variablen,"}, {"id": 479, "start": 3902.0, "end": 3907.48, "text": "Oracle Vault, One Passwort, über Webhooks kann man das ganze machen. Von einem anderen"}, {"id": 480, "start": 3907.48, "end": 3914.28, "text": "Kubernetes Cluster, Secrets Sinken, ja unterstützt eigentlich relativ viel. Wie groß war der"}, {"id": 481, "start": 3914.28, "end": 3923.92, "text": "Aufwand Vault bei dir im Hintergrund aufzusetzen? Zeige ich dir, wie groß der Aufwand war. Install,"}, {"id": 482, "start": 3923.92, "end": 3944.36, "text": "Vault. Yes. Vault. Def. Ne, äh. Mode. Ne, boah, wie ging das denn heute? Def Mode."}, {"id": 483, "start": 3953.92, "end": 3961.44, "text": "Ah ja, Vault Server Def, so rum. So, fertig, Vault läuft. Das sollte man so nicht benutzen,"}, {"id": 484, "start": 3961.44, "end": 3969.36, "text": "weil das rein in Memory ist, das unsealed ist und man mit irgendwelchen Keys rumhantieren muss,"}, {"id": 485, "start": 3969.36, "end": 3976.72, "text": "aber es ist rein lokal bei mir auf der VM, also da würde ich mir jetzt nicht so viele Gedanken"}, {"id": 486, "start": 3976.72, "end": 3997.08, "text": "drum machen. Das ist jetzt ein lokaler Vault, allerdings im Developer-Modus. Das ist nicht"}, {"id": 487, "start": 3997.08, "end": 4007.0, "text": "persistent, es ist alles im RAM und er ist unsealed, du kannst es auch nicht speichern, also das ist"}, {"id": 488, "start": 4007.0, "end": 4013.2, "text": "wirklich nur zum rumbasteln gedacht. So, und so ein Vault habe ich hier auf der zweiten VM-Lauf"}, {"id": 489, "start": 4013.2, "end": 4021.68, "text": "mit ein paar Talkings von mir drin und da greifen wir heute drauf zu. Damit man jetzt auch sieht,"}, {"id": 490, "start": 4021.68, "end": 4026.88, "text": "dass das Ganze was bringt, fangen wir jetzt nicht direkt mit dem Secrets Manager an, weil ich war"}, {"id": 491, "start": 4026.88, "end": 4030.28, "text": "mit einem Secrets Manager anzufangen. Der Secrets Manager, den man nirgendswo braucht,"}, {"id": 492, "start": 4030.28, "end": 4036.76, "text": "ist ja relativ doof. Wir fangen jetzt mit Zertifikaten an. Also, an der Stelle hier,"}, {"id": 493, "start": 4036.76, "end": 4047.12, "text": "Ingress, an der Stelle seht ihr ja, habe ich ein Web-Server laufen bzw. ein Reverse-Proxy laufen,"}, {"id": 494, "start": 4047.12, "end": 4056.68, "text": "der SSL verschlüsselt ist, also der auf Port 443 lauscht und man mit HTTPS drauf zugreifen kann und"}, {"id": 495, "start": 4056.68, "end": 4063.8, "text": "das war unter argocdkappalul.com. Aktuell sind das alles Self-Signed Zertifikate. Mario, danke schön"}, {"id": 496, "start": 4063.8, "end": 4068.24, "text": "für den Sub. Aktuell sind das alles Self-Signed Zertifikate, das seht ihr auch, das kann ich euch"}, {"id": 497, "start": 4068.24, "end": 4077.28, "text": "auch zeigen. Geben wir mal Chrome auf, da sieht man das schöner. argocdkappalul.com, Zertifikate"}, {"id": 498, "start": 4077.28, "end": 4083.64, "text": "anzeigen, Kubernetes Ingress Controller Fake Certificate. Ich glaube, genauer kann das da nicht"}, {"id": 499, "start": 4083.64, "end": 4105.8, "text": "stehen. So, und jetzt wirst du uns angucken, wie kriegen wir da letzte Encrypt-Zertifikate rein."}, {"id": 500, "start": 4105.8, "end": 4112.24, "text": "Dazu gibt es ein weiteres Projekt, das nennt sich Cert Manager, den gibt's da,"}, {"id": 501, "start": 4112.24, "end": 4116.84, "text": "ist auch saumäßig beliebt, wenn man das mal sucht. GitHub, Cert Manager."}, {"id": 502, "start": 4116.84, "end": 4127.44, "text": "Warum bei Orga? Weil das das Protokoll ist zum Zertifikate ausstellen, warum die das da reingeschrieben"}, {"id": 503, "start": 4127.44, "end": 4132.88, "text": "haben, kein Plan. Also das Projekt ist auch ziemlich beliebt, ich meine 10.000 Sterne auf GitHub"}, {"id": 504, "start": 4132.88, "end": 4140.64, "text": "sprechen da denke ich mal für sich. Wie können wir jetzt Zertifikate für unsere Sachen ausstellen?"}, {"id": 505, "start": 4140.64, "end": 4147.88, "text": "Also wir brauchen ein Zertifikat für argocdkappalul.com, aber wir brauchen noch viel eher ein Zertifikat"}, {"id": 506, "start": 4147.88, "end": 4155.2, "text": "für Qt-App, also für unsere App. Und damit fangen wir jetzt mal an. Das heißt, als erstes"}, {"id": 507, "start": 4155.2, "end": 4166.04, "text": "installieren wir mal den Cert Manager. Und nachdem wir das Ganze ja über Kubernetes-Konfix"}, {"id": 508, "start": 4166.04, "end": 4171.32, "text": "machen, machen wir das nicht über Helm direkt und machen das auch nicht über kubectl mit"}, {"id": 509, "start": 4171.32, "end": 4175.48, "text": "irgendwelchen Yammel-Files, sondern wir machen das so, dass es nachvollziehbar ist, dass"}, {"id": 510, "start": 4175.48, "end": 4179.56, "text": "jeder durchblickt, wann im Git wie was passiert ist. Das heißt wir legen hier eine neue App"}, {"id": 511, "start": 4179.56, "end": 4185.68, "text": "an, die nennen wir einfach mal Cert Manager. Punkt Yammel. Und ich kopiere das jetzt mal"}, {"id": 512, "start": 4185.68, "end": 4190.68, "text": "rüber und dann erkläre ich, weil warum soll ich das jetzt alles von Hand schreiben, ich"}, {"id": 513, "start": 4190.68, "end": 4193.76, "text": "könnte es aus dem Kopf eh nicht, ich muss eh abgucken. Also es hat keinen Sinn, wenn"}, {"id": 514, "start": 4193.76, "end": 4199.2, "text": "ich sage, haha wir schreiben jetzt hier api-version-pong-dump. Ich weiß es aus dem Kopf nicht, ich kann"}, {"id": 515, "start": 4199.2, "end": 4207.08, "text": "keine fehlerfreie Yammel-Syntax da aus dem Kopf mir zusammenwursten. So, das heißt ich"}, {"id": 516, "start": 4207.08, "end": 4212.64, "text": "kopiere das jetzt mal rüber. So sieht das Ganze aus an App-Definition. Wir müssen hier"}, {"id": 517, "start": 4212.64, "end": 4223.8, "text": "plus anpassen auf QS, das richtige repo rein machen. Und dann kann ich erklären, was drinnen"}, {"id": 518, "start": 4223.8, "end": 4246.52, "text": "passiert. Also MMO-Kreise, Crying Ritthot, wahrscheinlich nichts, sind erst zwei Leute"}, {"id": 519, "start": 4246.52, "end": 4251.2, "text": "da. So, also jetzt kann ich euch erklären, was passiert. Wir können uns, wir gucken es"}, {"id": 520, "start": 4251.2, "end": 4255.28, "text": "uns einfach mal, wir gucken es uns einfach mal an. Es wird jetzt gleich gesagt, es wird"}, {"id": 521, "start": 4255.28, "end": 4261.12, "text": "jetzt nicht funktionieren, aber wir gucken es uns trotzdem an. Ich mache jetzt mal einen"}, {"id": 522, "start": 4261.12, "end": 4271.72, "text": "Push in unser Repo. Best Feature Ever immer noch. Push in unser Repo. Und auf einmal wird"}, {"id": 523, "start": 4271.72, "end": 4275.76, "text": "jetzt, ich beschleunige das Refreshen mal ein bisschen, auf einmal taucht jetzt der"}, {"id": 524, "start": 4275.76, "end": 4280.84, "text": "Cert Manager hier als neue App auf. Der wird natürlich nicht funktionieren, weil, naja,"}, {"id": 525, "start": 4280.84, "end": 4296.28, "text": "ich habe ja noch gar nichts drinne stehen. Ah, ich habe das Projekt gar nicht angelegt."}, {"id": 526, "start": 4296.28, "end": 4307.24, "text": "Okay, das ist natürlich bescheuert. Dann müssen wir das anders machen, dann kommt das in Projekt"}, {"id": 527, "start": 4307.24, "end": 4314.64, "text": "Default. Hat mir nichts anderes übrig. So, und jetzt müssen wir noch ein bisschen Konfix"}, {"id": 528, "start": 4314.64, "end": 4317.84, "text": "anlegen für das Ganze. Das heißt, wir machen jetzt noch ein neues Verzeichnis, nennen"}, {"id": 529, "start": 4317.84, "end": 4325.76, "text": "wir auch Cert Manager. Dort kopieren wir einmal eine Namespace-Definition rein. Cert Manager."}, {"id": 530, "start": 4325.76, "end": 4335.28, "text": "Das Ding soll in seinem eigenen Namespace laufen. Namespaces sind, das sind quasi"}, {"id": 531, "start": 4335.28, "end": 4339.84, "text": "diese Unterteilungen im Kubernetes Cluster. Man sieht ja, ich habe aktuell vier Namespaces,"}, {"id": 532, "start": 4339.84, "end": 4344.36, "text": "Cube System, das ist standardmäßig dabei, für den Ingress, also für den Reverse Box,"}, {"id": 533, "start": 4344.36, "end": 4348.12, "text": "den Default Namespace und für Argo CD, den Namespace. Da kann man das so ein bisschen"}, {"id": 534, "start": 4348.12, "end": 4353.72, "text": "aufteilen. Da kann man zum Beispiel, könnte man eine Namespace machen fürs Monitoring,"}, {"id": 535, "start": 4353.72, "end": 4357.04, "text": "Namespace machen für irgendwelche Storage-Streiber oder so, dass es ein bisschen besser kopiert"}, {"id": 536, "start": 4357.04, "end": 4363.6, "text": "ist. Es hat auch ein bisschen was später mit Berechtigungen zu tun, weil es können nur,"}, {"id": 537, "start": 4363.6, "end": 4369.68, "text": "oftmals, manchmal gibt es Ausnahmen, es können nur Sachen innerhalb eines Namespaces auf"}, {"id": 538, "start": 4369.68, "end": 4374.76, "text": "Ressourcen innerhalb von dem gleichen Namespace zugreifen. Ich glaube, die einzige Ausnahme"}, {"id": 539, "start": 4374.76, "end": 4380.16, "text": "ist, dass man per DNS übergreifend auflösen kann. Aber wenn ich zum Beispiel Passwörter"}, {"id": 540, "start": 4380.16, "end": 4383.92, "text": "und sowas habe, dann ist das immer auf den Namespace beschränkt. Das heißt, ich kann"}, {"id": 541, "start": 4383.92, "end": 4388.24, "text": "nicht einfach ein Passwort in meinem Kubernetes Cluster speichern, hier in Default und dann"}, {"id": 542, "start": 4388.24, "end": 4391.84, "text": "von diesem Namespace, von irgendeiner Anwendung in diesem Namespace drauf zugreifen. Das funktioniert"}, {"id": 543, "start": 4391.84, "end": 4399.84, "text": "nicht. Man sollte es vielleicht auch nicht übertreiben mit Namespaces. Die Diskussion,"}, {"id": 544, "start": 4399.84, "end": 4406.04, "text": "ob man Environments als Namespaces abbildet oder ob man Environments besser als eigene"}, {"id": 545, "start": 4406.04, "end": 4411.68, "text": "Cluster abbildet, kann man sich darüber streiten, hängt, denke ich, am Ende davon ab, wie gut"}, {"id": 546, "start": 4411.68, "end": 4419.6, "text": "will man es wirklich trennen und wie viel Geld hat man übrig. Also will man für das Live-System"}, {"id": 547, "start": 4419.6, "end": 4424.96, "text": "einen eigenen Cluster haben und für das Test-System einen eigenen Cluster haben oder sagt man sich"}, {"id": 548, "start": 4424.96, "end": 4428.92, "text": "scheiß drauf, wir machen das alles in einen Cluster, dann halt in einem unterschiedlichen"}, {"id": 549, "start": 4428.92, "end": 4434.16, "text": "Namespace. Muss man sich überlegen. Das gibt es auch, würde ich sagen, gibt es pauschal"}, {"id": 550, "start": 4434.16, "end": 4462.76, "text": "nichts, wo man sagen kann so und einzig wahre Sache. Ich schreibe mein Continuing, ich kann"}, {"id": 551, "start": 4462.76, "end": 4480.84, "text": "das nicht schreiben. So. Jetzt hat mich Discord gerade abgelenkt. Wo sind wir stehen geblieben?"}, {"id": 552, "start": 4480.84, "end": 4496.6, "text": "Wir wollten uns als Third-Manager konfigurieren. Ich glaube, jetzt passt das. Also das Ding"}, {"id": 553, "start": 4496.6, "end": 4502.56, "text": "braucht einen eigenen Namespace. Das ist schon mal ganz sinnvoll, dass der Third-Manager"}, {"id": 554, "start": 4502.56, "end": 4524.04, "text": "im eigenen Namespace läuft. Gut, dann müssen wir den Third-Manager konfigurieren. Das ist"}, {"id": 555, "start": 4524.04, "end": 4534.24, "text": "relativ simpel an der Stelle. Und da muss ich jetzt gucken, dass ich nichts leake, aber"}, {"id": 556, "start": 4534.24, "end": 4557.76, "text": "ich glaube, es passt. Ja, nee, ist okay. Nix drinne. So. In die Third-Manager-Definition"}, {"id": 557, "start": 4557.76, "end": 4570.44, "text": "muss ich jetzt mal gucken, was ich hier anlegen will. Das ist die Konfiguration für Let's"}, {"id": 558, "start": 4570.44, "end": 4576.0, "text": "Encrypt, dass ich Let's Encrypt-Zertifikate ausstellen kann. Ich lege hier einen Cluster-Issuer"}, {"id": 559, "start": 4576.0, "end": 4582.96, "text": "an. Warum das so heißt? Weil die Third-Manager-Leute gedacht haben, das muss so heißen. Ein Cluster-Issuer"}, {"id": 560, "start": 4582.96, "end": 4592.64, "text": "ist eine Ressource im Kubernetes-Cluster für den gesamten Cluster. Das heißt, die"}, {"id": 561, "start": 4592.64, "end": 4598.28, "text": "ist nicht Namespace gebunden. Sie selbst gehört zwar zum Third-Manager-Namespace, aber sie"}, {"id": 562, "start": 4598.28, "end": 4604.06, "text": "kann benutzt werden, weil Cluster vorne dran steht, aus dem gesamten Cluster. Das heißt,"}, {"id": 563, "start": 4604.06, "end": 4616.4, "text": "es kann jetzt jede Anwendung in diesem Kubernetes-Cluster nachfragen beim Let's Encrypt Cloudflare DNS-Cluster-Issuer."}, {"id": 564, "start": 4616.4, "end": 4621.28, "text": "Bitte gib mir doch mal ein Zertifikat. So. Und damit der funktioniert, brauche ich einen"}, {"id": 565, "start": 4621.28, "end": 4627.44, "text": "API-Token für Cloudflare. Wo wir jetzt genau bei dem Problem sind, wo kriege ich dieses"}, {"id": 566, "start": 4627.44, "end": 4634.56, "text": "API-Token her? Das API-Token liegt in meinem Vault. Die verbinde ich den Vault mit Kubernetes."}, {"id": 567, "start": 4634.56, "end": 4644.76, "text": "Wir richten jetzt erstmal den Third-Manager noch ein. Brauche ich noch irgendwas? Alter,"}, {"id": 568, "start": 4644.76, "end": 4658.28, "text": "was habe ich denn hier für Magic gemacht? What the fuck? MonkaS, was ist das? Was habe"}, {"id": 569, "start": 4658.28, "end": 4664.24, "text": "ich denn da gebaut? Egal. Ich Copy-Paste das jetzt einfach mal rüber. Wir müssen den Third-Manager"}, {"id": 570, "start": 4664.24, "end": 4678.72, "text": "noch installieren. Und das machen wir mal raus. Muss nicht jeder Pod Internetzugriff"}, {"id": 571, "start": 4678.72, "end": 4685.24, "text": "haben, um ein Zert anzufordern? Nein, muss nicht. Also ist standardmäßig so. Oder wäre"}, {"id": 572, "start": 4685.24, "end": 4690.56, "text": "so, wenn das Routing stimmt, muss nicht. Der Pod geht zum Cluster-Issuer und der Cluster-Issuer"}, {"id": 573, "start": 4690.56, "end": 4695.82, "text": "läuft im Hintergrund und macht das. Es reicht, wenn der ins Internet kommt. Der Pod selber"}, {"id": 574, "start": 4695.82, "end": 4703.6, "text": "muss nicht ins Internet kommen. Das ist gerade Sinn und Zweck der ganzen Übung. Oder eine"}, {"id": 575, "start": 4703.6, "end": 4710.36, "text": "der Übungen. Also der Pod selber muss nicht zwangsläufig ins Internet kommen. So, ich"}, {"id": 576, "start": 4710.36, "end": 4716.16, "text": "glaube, das passt jetzt soweit. Jetzt können wir das installieren. Und wir gehen schon"}, {"id": 577, "start": 4716.16, "end": 4728.36, "text": "mal her und stellen für unsere App ein, dass die erreichbar sein soll. Und zwar über"}, {"id": 578, "start": 4728.36, "end": 4744.92, "text": "cuteapp.com. Wunderbar. Nicht argocdls, cuteapp.tls. Jetzt commenten wir das Ganze. Und dann hat"}, {"id": 579, "start": 4744.92, "end": 4749.4, "text": "es schon gecheckt. Er hat es schon kapiert. Guck, er hat erkannt, ThirdManager ist am Start,"}, {"id": 580, "start": 4749.4, "end": 4755.44, "text": "die cuteapp muss sich refreschen und ThirdManager wird im Hintergrund installiert. Ohne, ohne"}, {"id": 581, "start": 4755.44, "end": 4758.72, "text": "dass ich was machen muss. Was hat er jetzt für ein Schmelz? Ach so, genau. ThirdManager"}, {"id": 582, "start": 4758.72, "end": 4766.56, "text": "kann nicht installiert werden. Richtig. Weil... Okay, die Fehlermeldung ist ziemlich pepega."}, {"id": 583, "start": 4766.56, "end": 4770.92, "text": "Aber weil das Secret nicht stimmt. Also dieses Secret, was ich im ThirdManager eingestellt"}, {"id": 584, "start": 4770.92, "end": 4778.36, "text": "habe hier an der Stelle, das Cloudflare-Talken, das gibt es noch gar nicht im Cluster. Also"}, {"id": 585, "start": 4778.36, "end": 4784.16, "text": "das wird nicht klappen. Deswegen sagt er auch hier, ich bin kaputt. Kommen wir mal angucken."}, {"id": 586, "start": 4784.16, "end": 4797.76, "text": "Startup, bla, funktioniert nicht. Man kann mal gucken mit Certificate-Requests. Aber man"}, {"id": 587, "start": 4797.76, "end": 4806.76, "text": "sieht, für Argo CD gibt es schon ein Certificate-Request. Der wird allerdings nie bearbeitet werden"}, {"id": 588, "start": 4806.76, "end": 4812.88, "text": "können, weil das Talken für Cloudflare, für den Cloudflare-DNS ist ja noch gar nicht"}, {"id": 589, "start": 4812.88, "end": 4823.0, "text": "da. Auf geht's. Das heißt, wir müssen jetzt mal gucken, wie kriegt man... Übrigens selbst"}, {"id": 590, "start": 4823.0, "end": 4826.68, "text": "wenn ich, ich sag's jetzt gleich mal, selbst wenn ich mein Cloudflare-Talken leaken sollte"}, {"id": 591, "start": 4826.68, "end": 4830.96, "text": "ist es nicht schlimm. Ich hab das gescoped auf meine Absender-IP. Das heißt, ihr könnt"}, {"id": 592, "start": 4830.96, "end": 4836.04, "text": "noch nicht mal darüber großartig was machen. Es sei dann, ihr kommt über meine Absender-IP,"}, {"id": 593, "start": 4836.04, "end": 4843.44, "text": "die ihr nicht habt. Ach stimmt, man kann auch... Ja, du hast recht. Irgendwie denke ich da nicht"}, {"id": 594, "start": 4843.44, "end": 4846.72, "text": "dran, weil ich hab das meistens schon so in der History, da ich an der Stelle einfach"}, {"id": 595, "start": 4846.72, "end": 4856.64, "text": "nur noch Complete drücken muss. ThirdManager ist installiert. Allerdings, wie gesagt,"}, {"id": 596, "start": 4856.64, "end": 4866.72, "text": "funktionieren kann das Ganze noch nicht. Qt-App ist am Start. Juna möchte auch TLS haben."}, {"id": 597, "start": 4866.72, "end": 4878.72, "text": "Damit das Ganze funktioniert, muss man noch ein paar Sachen hinzuschreiben. Wie gesagt,"}, {"id": 598, "start": 4878.72, "end": 4884.24, "text": "neben dem, dass das Talken fehlt, kannst du uns denn den Scope mal zeigen? Was für"}, {"id": 599, "start": 4884.24, "end": 4902.84, "text": "einen Scope? Von was? Den Quickscope? Du meinst also quasi den..."}, {"id": 600, "start": 4902.84, "end": 4924.24, "text": "Wo hab ich denn den Sound? Man, jetzt wenn man ihn braucht, finde ich ihn nicht. Den"}, {"id": 601, "start": 4924.24, "end": 4935.24, "text": "Scope? Ich hab keine Ahnung, was du wissen willst. Also das ist alles bei mir nur lokal"}, {"id": 602, "start": 4935.24, "end": 4941.2, "text": "aufgelöst. Da kannst du externer nichts ausprobieren. Hat er mal das andere jetzt auch schon angefragt?"}, {"id": 603, "start": 4941.2, "end": 4952.04, "text": "Nee. So, also wo sind wir stehen geblieben? Also uns fehlt einmal das Token für den Zertifikatmanager,"}, {"id": 604, "start": 4952.04, "end": 4960.16, "text": "das ist noch nicht drinne. Und es fehlen auch noch ein paar Annotations, dass der Zertifikatmanager"}, {"id": 605, "start": 4960.16, "end": 4964.68, "text": "überhaupt checkt, dass er hierfür zuständig sein soll. Da muss man Folgendes machen, das"}, {"id": 606, "start": 4964.68, "end": 4969.96, "text": "Copy-Paste ich mir auch raus, weil aus dem Kopf kann ich den ganzen Krempel auch nicht,"}, {"id": 607, "start": 4969.96, "end": 4979.76, "text": "muss man noch zwei Annotations setzen bzw. eine, die essentiell ist. Und zwar gucken,"}, {"id": 608, "start": 4979.76, "end": 4994.12, "text": "wo ich die hab. Hier, Metadata Annotations muss man setzen. Zwar da, das da nicht, das"}, {"id": 609, "start": 4994.12, "end": 5003.24, "text": "da muss man setzen. Das heißt, hiermit sagt man dem Zertifikatmanager, du bist dafür"}, {"id": 610, "start": 5003.24, "end": 5009.08, "text": "zuständig. Guckt mal da rein, was dafür auszahlt und stell dafür ein Zertifikat aus. So und"}, {"id": 611, "start": 5009.08, "end": 5020.2, "text": "wenn ich das jetzt pushe, dann sollte der Zertifikatmanager zumindest denken, dass er dafür zuständig"}, {"id": 612, "start": 5020.2, "end": 5044.2, "text": "ist. Kann auch sein, dass er kaputt ist wegen dem Token. Ok. Guck, er hat versucht das Ganze"}, {"id": 613, "start": 5044.2, "end": 5052.2, "text": "anzufordern, aber es hat nicht funktioniert. Man sieht jetzt aus, es gibt jetzt zwei verschiedene"}, {"id": 614, "start": 5052.2, "end": 5059.56, "text": "Zertifikatsrequests, aber geht nicht. Das eine schon vor 4 Minuten, das andere vor 13."}, {"id": 615, "start": 5059.56, "end": 5070.44, "text": "Das heißt, ich muss irgendwie dieses blöde Cloudflare Token da reinbekommen, dass das"}, {"id": 616, "start": 5070.44, "end": 5076.76, "text": "funktioniert. So und das machen wir jetzt mit dem External Secrets Manager. Das heißt,"}, {"id": 617, "start": 5076.76, "end": 5104.24, "text": "es gibt nochmal eine neue App. Diesmal für External Secrets. External Secrets."}, {"id": 618, "start": 5104.24, "end": 5117.6, "text": "Copy Paste stellst du am Start. Du hast Sicht-Services, um dich selbst zu verwalten. Ja. Deswegen"}, {"id": 619, "start": 5117.6, "end": 5121.76, "text": "lohnt sich das auch für kleine Sachen nicht. Wenn du irgendwas kleines hosten willst, vm"}, {"id": 620, "start": 5121.76, "end": 5132.48, "text": "bei Hetzner und fertig aus. Neues Repo anpassen, fertig. Projekt Default muss sein. Ich hab"}, {"id": 621, "start": 5132.48, "end": 5142.16, "text": "das andere Zeug nicht hier. Ok, das ist alles gut so. Dann legen wir noch ein Verzeichnis"}, {"id": 622, "start": 5142.16, "end": 5149.92, "text": "für die anderen External Secrets. Da muss jetzt noch ein bisschen Konfiguration rein."}, {"id": 623, "start": 5149.92, "end": 5153.72, "text": "Das ist der letzte Service, den wir konfigurieren müssen. Danach können wir einfach alles"}, {"id": 624, "start": 5153.72, "end": 5168.28, "text": "hinzufügen. Das da rein copy pasten. Weg damit. Also wir wollen External Secrets installieren"}, {"id": 625, "start": 5168.28, "end": 5176.08, "text": "in Version 0.81 von dieser Quelle in diesen Namespace und alles ist gut. Und dann brauchen"}, {"id": 626, "start": 5176.08, "end": 5181.48, "text": "wir noch eine Konfiguration, damit man sich oder damit sich der External Secrets Manager"}, {"id": 627, "start": 5181.48, "end": 5191.68, "text": "zu meinem lokalen Vault verbinden kann, den ich bei mir lokal laufen habe. Vault.yaml und"}, {"id": 628, "start": 5191.68, "end": 5197.28, "text": "das sieht so aus. Hier läuft der Vault und für den Zugriff auf das Vault braucht er"}, {"id": 629, "start": 5197.28, "end": 5204.28, "text": "auch wieder ein Token. Das heißt einmal am Anfang, wenn ich den Cluster boote, einmal"}, {"id": 630, "start": 5204.28, "end": 5208.08, "text": "muss ich den Token hinterlegen. Da komm ich nicht drumherum. Aber es reicht, wenn ich"}, {"id": 631, "start": 5208.08, "end": 5214.8, "text": "das Token hinterlege für meinen Passwort Manager, aus dem ich dann alle anderen Tokens"}, {"id": 632, "start": 5214.8, "end": 5221.28, "text": "holen kann. Ich meine irgendwie komme ich nicht gut. Ich meine ich könnte wahrscheinlich"}, {"id": 633, "start": 5221.28, "end": 5224.76, "text": "auch einen Passwort Manager nehmen, der nicht Passwort geschützt ist selber, aber das ist"}, {"id": 634, "start": 5224.76, "end": 5234.44, "text": "dann ein bisschen fragwürdig natürlich, ob das dann unterm Strich so sinnvoll ist. Ich"}, {"id": 635, "start": 5234.44, "end": 5241.72, "text": "muss jetzt einmal initial in meinen Kubernetes Cluster das hier noch reinpushen und zwar"}, {"id": 636, "start": 5241.72, "end": 5249.48, "text": "im Namespace External Secrets ein Secret anlegen Key mit einem, Key ist ein bescheuerer Name"}, {"id": 637, "start": 5249.48, "end": 5256.28, "text": "eigentlich. Man könnte es auch besser nennen. Cloudflare zum Beispiel könnte man das nennen."}, {"id": 638, "start": 5256.28, "end": 5259.28, "text": "Wobei Cloudflare kann man das nicht nennen. Das ist doof, wenn ich Cloudflare nenne, weil"}, {"id": 639, "start": 5259.28, "end": 5264.36, "text": "Cloudflare nenne ich das Target Secret dann. Ich nenne es einfach mal Keys. Und da drin"}, {"id": 640, "start": 5264.36, "end": 5275.84, "text": "drunter dann ein Schlüssel, der sich Token nennt. Da kommt das ganze rein. Gut, also"}, {"id": 641, "start": 5275.84, "end": 5285.2, "text": "jetzt muss ich das ganze Copy Pasten. So, das dürft ihr übrigens alles sehen. Das ist"}, {"id": 642, "start": 5285.2, "end": 5292.92, "text": "nicht geheim, weil das ist eh bei mir lokal. Also nicht wirklich schlimm. Ich muss jetzt"}, {"id": 643, "start": 5292.92, "end": 5301.68, "text": "noch mein Token rüber kopieren für den Zugriff auf meinen lokalen Passwortmanager. Zack,"}, {"id": 644, "start": 5301.68, "end": 5308.28, "text": "leaked. Namespaces External Secrets not found. Ah, ja, weil ich es nicht installiert habe."}, {"id": 645, "start": 5308.28, "end": 5326.2, "text": "Dann gibt es hier noch eine Namespace Definition. External Secrets. Alles klar, alles klar. Push."}, {"id": 646, "start": 5326.2, "end": 5336.4, "text": "Gut, dann gucken wir erstmal, dass das ganze installiert wird. Refresh die ganzen Apps."}, {"id": 647, "start": 5336.4, "end": 5343.32, "text": "Hopp, da ist sie. Das ist halt sehr praktisch mit ArgoCD. Du musst einfach nur eine App"}, {"id": 648, "start": 5343.32, "end": 5348.96, "text": "hinzufügen oder eine App Definition hinzufügen und zack ist der Kram auf dem Cluster applied."}, {"id": 649, "start": 5348.96, "end": 5354.96, "text": "So, out of sync. Ja, geht nicht, weil failed Webhook und hast du nicht gesehen. Ja, ich"}, {"id": 650, "start": 5354.96, "end": 5362.12, "text": "weiß, dass der Webhook failed ist, weil naja, das Token ist nicht drinnen. Aber jetzt kann"}, {"id": 651, "start": 5362.12, "end": 5368.2, "text": "ich das hinzufügen. External Secrets created. Jetzt sollte das alles sich gleich von alleine"}, {"id": 652, "start": 5368.2, "end": 5376.72, "text": "fixen. Hoffe ich mal. Bin ich mal gespannt. Out of sync. Ah, kommt mal, External Secrets."}, {"id": 653, "start": 5376.72, "end": 5385.0, "text": "Hat funktioniert. Der ist schon mal grün. Ja, jetzt fehlt eigentlich, guck mal, das hat"}, {"id": 654, "start": 5385.0, "end": 5390.4, "text": "sich jetzt alles gefixt. Jetzt fehlt eigentlich noch die App. Das Zertifikat ist allerdings"}, {"id": 655, "start": 5390.4, "end": 5397.92, "text": "noch nicht da. Es hat auch vor 5 Minuten angefragt, da war das Ganze noch nicht drin. Mal gucken,"}, {"id": 656, "start": 5397.92, "end": 5402.04, "text": "ob er das von alleine checkt. Da bin ich mir gar nicht sicher, ob er das von alleine kapiert."}, {"id": 657, "start": 5402.04, "end": 5410.8, "text": "Ich habe aber noch gar keine Definition für das Zertifikat angelegt. Moment, Sekunde,"}, {"id": 658, "start": 5410.8, "end": 5417.84, "text": "brauche ich das? Cloudflare? Ja, ich muss, ich muss, ich muss ja noch anlegen, dass der"}, {"id": 659, "start": 5417.84, "end": 5429.68, "text": "sich zu Cloudflare verbinden soll. Das habe ich ja noch gar nicht gemacht. Also mein Zertmanager"}, {"id": 660, "start": 5429.68, "end": 5435.04, "text": "kann sich noch nicht zu Cloudflare verbinden. So, das heißt, wir müssen jetzt im Zertmanager"}, {"id": 661, "start": 5435.04, "end": 5443.72, "text": "sagen, dass der gefälligst mal auf das Cloudflare-Token zugreift bzw. erstmal das Cloudflare-Token"}, {"id": 662, "start": 5443.72, "end": 5448.56, "text": "als Secret überhaupt anlegt und das soll er sich über den external Secret-Manager holen."}, {"id": 663, "start": 5448.56, "end": 5456.6, "text": "Und das funktioniert folgendermaßen, ich mache hier nochmal eine neue Datei, Secrets,"}, {"id": 664, "start": 5456.6, "end": 5465.44, "text": "Zertmanager, Secrets und das kann man dann so definieren, dann sagt man ihm, guck mal,"}, {"id": 665, "start": 5465.44, "end": 5472.84, "text": "hier zum Cluster-Secret-Store, der Cluster-Secret-Store, der wird hier angelegt und connectet sich"}, {"id": 666, "start": 5472.84, "end": 5484.04, "text": "zu meinem Vault-Backend und aus dem Cluster-Secret-Store holt ihr das Cloudflare-Token und erstellt"}, {"id": 667, "start": 5484.04, "end": 5490.6, "text": "ein neues internes Kubernetes-Secret mit dem Namen Cloudflare und einem Key-Token."}, {"id": 668, "start": 5490.6, "end": 5498.84, "text": "Also man kann hier drin auch quasi so eine eigene Config zusammenbauen mit vielleicht"}, {"id": 669, "start": 5498.84, "end": 5505.68, "text": "aus verschiedenen Secrets, falls die jeweilige App das braucht."}, {"id": 670, "start": 5505.68, "end": 5511.16, "text": "Dann committen wir das Ganze mal und wenn wir jetzt Glück haben, dann sollte sich in"}, {"id": 671, "start": 5511.16, "end": 5517.08, "text": "2-3 Minuten alles erledigt haben von alleine und ich sollte ein Zertifikat haben."}, {"id": 672, "start": 5517.08, "end": 5524.56, "text": "Noch kein richtig echtes gültiges Zertifikat, Cloudflare.de Domains, da bin ich sofort"}, {"id": 673, "start": 5524.56, "end": 5531.28, "text": "dabei. Also noch kein richtig echtes gültiges Zertifikat,"}, {"id": 674, "start": 5531.28, "end": 5538.92, "text": "weil ich habe Cloudflare hier, wie ihr seht. Let's Encrypt habe ich ja Staging drinnen,"}, {"id": 675, "start": 5538.92, "end": 5544.56, "text": "das ist die Let's Encrypt-Stelle zum Testen, weil man hat ja nur gewisse Limits in der"}, {"id": 676, "start": 5544.56, "end": 5552.16, "text": "Woche für Let's Encrypt, die man benutzen kann. Ich habe eigentlich gehofft, der macht"}, {"id": 677, "start": 5552.16, "end": 5558.96, "text": "eine neue Anfrage für das Zertifikat, macht er aber nicht, natürlich doof."}, {"id": 678, "start": 5558.96, "end": 5580.08, "text": "Jetzt weiß ich nicht, wie ich das gescheit regelt, dass der Cert Manager nochmal nachguckt."}, {"id": 679, "start": 5580.08, "end": 5591.08, "text": "Also der Cert Manager hat zumindest nicht gecheckt, der Cert Manager hat nicht gecheckt,"}, {"id": 680, "start": 5591.08, "end": 5595.08, "text": "dass er ein neues Zertifikat anfragen soll. Das ist natürlich doof, wir können auch"}, {"id": 681, "start": 5595.08, "end": 5603.12, "text": "mal in die Logs rein gucken, Logs, Namespace, Cert Manager, Cert Manager, hier was macht"}, {"id": 682, "start": 5603.12, "end": 5624.48, "text": "er? Error, get in Cloudflare's Secret, Secret Cloudflare not found, okay, get secrets,"}, {"id": 683, "start": 5624.48, "end": 5630.28, "text": "übrigens die secrets die werde ich nicht anzeigen, denn ansonsten habe ich ein Problem,"}, {"id": 684, "start": 5630.28, "end": 5636.04, "text": "das Cloudflare's Secret ist doch, das Cloudflare's Secret ist doch da, alles gut, ah im Namespace"}, {"id": 685, "start": 5636.04, "end": 5643.04, "text": "Cert Manager, okay da ist das ja, da ist es falsch, das muss in, nee Moment, nee im Namespace"}, {"id": 686, "start": 5643.04, "end": 5652.16, "text": "Cert Manager ist das richtig, Error, get in Cloudflare's Secret, Secret Cloudflare not"}, {"id": 687, "start": 5652.16, "end": 5670.48, "text": "found, da ist es doch, hä, jaja es ist angelegt, alles im Vault, not found, aber warum nicht,"}, {"id": 688, "start": 5670.48, "end": 5679.2, "text": "da ist es doch, es ist im Cert Manager Namespace und der Cert Manager meint, das ist nicht"}, {"id": 689, "start": 5679.2, "end": 5685.32, "text": "da, ah Moment, das ist 19, Moment, Moment, das ist vor, das war vor 4 Minuten, wir haben"}, {"id": 690, "start": 5685.32, "end": 5693.52, "text": "es hier eben auch erst updated, wir haben es hier eben auch erst updated, ah, es funktioniert"}, {"id": 691, "start": 5693.52, "end": 5700.28, "text": "alles, man muss einfach nur ein bisschen warten, guck, DNS-Record, Qt-App-Capa-Lul-Not-Yet-Propagated,"}, {"id": 692, "start": 5700.28, "end": 5706.36, "text": "das dauert jetzt ein bisschen bis der Authentifizierung für Let's Encrypt gemacht hat über DNS,"}, {"id": 693, "start": 5706.36, "end": 5715.32, "text": "aber in paar Minuten oder bald, bald sollte, sollte es da sein, Certificate Requests, noch"}, {"id": 694, "start": 5715.32, "end": 5726.36, "text": "nicht, noch nichts zu sehen, wenn Ready True da steht, True 0W, dann weiß ich, es hat funktioniert,"}, {"id": 695, "start": 5726.36, "end": 5732.24, "text": "es kann durchaus mal 2-3 Minuten dauern, ah, not yet propagated, bla bla bla, wir warten"}, {"id": 696, "start": 5732.24, "end": 5739.84, "text": "jetzt bis das Zertifikat da ist und dann zeige ich euch, Qt-App, da ist es, Qt-App-Capa-Lul,"}, {"id": 697, "start": 5739.84, "end": 5753.64, "text": "ja, ist ja gut, man, so, ihr seht, noch ist das alte Zertifikat da, ne, da ist es schon,"}, {"id": 698, "start": 5753.64, "end": 5759.2, "text": "staging Let's Encrypt hat funktioniert, True, in dem Moment, wo ich es ausprobieren wollte,"}, {"id": 699, "start": 5759.2, "end": 5764.28, "text": "also er ist jetzt zu Let's Encrypt, da habe ich den Zertifikat ausgestellt, das ist die"}, {"id": 700, "start": 5764.28, "end": 5771.12, "text": "staging, also die Testumgebung von Let's Encrypt, das habe ich absichtlich gemacht, weil ich"}, {"id": 701, "start": 5771.12, "end": 5776.48, "text": "ansonsten in irgendwelche Limits laufen würde, ich kann es euch mal zeigen, dass es wirklich"}, {"id": 702, "start": 5776.48, "end": 5781.36, "text": "echt funktioniert mit dem echten Zertifikat, ja, sodass ich nicht so sehr in meine Limits"}, {"id": 703, "start": 5781.36, "end": 5792.24, "text": "laufen darf, das heißt, wir ändern das ganze mal, ich gehe jetzt hier wieder rein, wo ich"}, {"id": 704, "start": 5792.24, "end": 5796.6, "text": "den Clusterissuer definiert habe und sage, ok, von welchem Server sollst du dir die Zertifikate"}, {"id": 705, "start": 5796.6, "end": 5801.32, "text": "holen bei Let's Encrypt, aktuell haben wir das Staging drinne und ich habe ehrlich gesagt"}, {"id": 706, "start": 5801.32, "end": 5811.72, "text": "keine Ahnung, ob das die richtige URL ist, wahrscheinlich einfach Staging raus, oder,"}, {"id": 707, "start": 5811.72, "end": 5816.64, "text": "ok, einfach Staging raus, so und jetzt holen wir uns mal ein Zertifikat, ich hoffe, der"}, {"id": 708, "start": 5816.64, "end": 5824.2, "text": "refrescht das jetzt, wenn ich es an der Stelle ändere, müsst ihr eigentlich, jetzt gehen"}, {"id": 709, "start": 5824.2, "end": 5836.04, "text": "wir auf das Live Let's Encrypt, also auf geht's, Push, jetzt gehen wir auf das Live Let's Encrypt,"}, {"id": 710, "start": 5836.04, "end": 5843.28, "text": "ich refresche mal, dass es ein bisschen schneller geht, ok, ne, das juckt dir nicht, wenn man"}, {"id": 711, "start": 5843.28, "end": 5856.04, "text": "das da refrescht, ja, wie, ok, das habe ich noch nicht gemacht, wie kann man ihm jetzt"}, {"id": 712, "start": 5856.04, "end": 5873.12, "text": "sagen, please ein neues Zertifikat ausstellen, oh, was, URL ist falsch, fail to retrieve"}, {"id": 713, "start": 5873.12, "end": 5891.24, "text": "order, oh, ist das falsch, Moment, Cert Manager Let's Encrypt URL, wie ist denn die richtige"}, {"id": 714, "start": 5891.24, "end": 5905.32, "text": "URL, oder, Let's Encrypt URLs, was ist die Let's Encrypt URL, ja, aber ich bilde mir"}, {"id": 715, "start": 5905.32, "end": 5920.68, "text": "ein, das habe ich doch, habe ich das nicht, äh, sieht ziemlich gut aus, vielleicht ohne"}, {"id": 716, "start": 5920.68, "end": 5930.12, "text": "Directory hinten dran, gibt's da, gibt's, ups, da gibt's doch bestimmt Cert Manager"}, {"id": 717, "start": 5930.12, "end": 5935.84, "text": "Example mit Let's Encrypt, kann doch nicht so kompliziert sein, muss doch schon irgendjemand"}, {"id": 718, "start": 5935.84, "end": 5948.84, "text": "vor mir gemacht haben, ja, ja genau, von dem will ich das jetzt wissen, ne, ist doch, ist"}, {"id": 719, "start": 5948.84, "end": 5963.56, "text": "doch richtig, ist doch alles richtig, was hat er für Schmerzen, war doch, ist doch alles,"}, {"id": 720, "start": 5963.56, "end": 5978.2, "text": "ist doch alles gut, selbes Secret, ja, das ist ja nur das Secret vom, vom, vom DNS, äh,"}, {"id": 721, "start": 5978.2, "end": 5984.76, "text": "das kann sein, dass ich das, dass ich das noch ändern muss, das kann sein, dass er"}, {"id": 722, "start": 5984.76, "end": 5988.44, "text": "das gecached hat und das deswegen nicht funktioniert, das wäre vielleicht, vielleicht möglich,"}, {"id": 723, "start": 5988.44, "end": 5999.72, "text": "keine Ahnung, gucken wir mal, das Problem hatte ich so noch nicht, Refresh, na gut,"}, {"id": 724, "start": 5999.72, "end": 6021.08, "text": "das, äh, ich glaube, ich glaube jetzt hat er's gecheckt, ja, das ist glaube ich besser,"}, {"id": 725, "start": 6021.08, "end": 6035.6, "text": "deswegen, so und wie kann ich dem jetzt sagen, dass er das Zertifikat neu ausstellen soll,"}, {"id": 726, "start": 6035.6, "end": 6039.44, "text": "also das sieht jetzt schon mal besser aus, ich hab jetzt ja, das, das hat's dir ja so"}, {"id": 727, "start": 6039.44, "end": 6044.04, "text": "normalerweise auch nicht, dass da einfach mal die, ähm, Zertifizierungsstelle für schon"}, {"id": 728, "start": 6044.04, "end": 6049.04, "text": "bestehen, ich mein, ich könnte die URL ändern, das ist vielleicht nicht so, nicht so geil,"}, {"id": 729, "start": 6049.04, "end": 6053.8, "text": "das machen wir jetzt aber mal, weil, vielleicht muss man auch einfach nur ein bisschen warten,"}, {"id": 730, "start": 6053.8, "end": 6064.84, "text": "das könnte natürlich auch sagen, ah ja, ok, alles gut, ah nee, jetzt holt er für"}, {"id": 731, "start": 6064.84, "end": 6085.32, "text": "Argo CD eins, ah gut, dann, dann warten wir doch mal ab, ob das, ob das funktioniert,"}, {"id": 732, "start": 6085.32, "end": 6089.24, "text": "gucken wir mal, dann kann ich Argo CD gleich mit einem echten, mit einem echten Zertifikat"}, {"id": 733, "start": 6089.24, "end": 6097.24, "text": "aufmachen, wir müssen auf jeden Fall noch eine Sache eintragen und zwar, Annotations"}, {"id": 734, "start": 6097.24, "end": 6109.64, "text": "sollten da noch, ach nee, hab ich schon, hab ich schon, ach deswegen geht das jetzt, so,"}, {"id": 735, "start": 6109.64, "end": 6124.52, "text": "Error, not yet propagated, ja, blablabla, mach hinne, welche Distro würdest du zum Umsteigen"}, {"id": 736, "start": 6124.52, "end": 6133.08, "text": "empfehlen, habe bisher nur Erfahrung mit Debian-Servern, na ja, wie wär's mit Ubuntu?"}, {"id": 737, "start": 6133.08, "end": 6147.48, "text": "Error, was ist denn jetzt für ein Problem, Key-ID-Header-Contain-Invalid-Account-Ul,"}, {"id": 738, "start": 6147.48, "end": 6154.56, "text": "hä, irgendwas hab ich da verkehrt, verkehrt reingepastet, das ist die falsche URL für"}, {"id": 739, "start": 6154.56, "end": 6162.4, "text": "Let's Encrypt man, keine Ahnung, was der für Schmerzen hat, aber das stimmt doch,"}, {"id": 740, "start": 6162.4, "end": 6171.92, "text": "muss man das vielleicht Quoten oder so, nur für den Fall der Fälle, DNS Error Accepting"}, {"id": 741, "start": 6171.92, "end": 6196.04, "text": "Challenge-Invalid-Account-Ul, okay, keine Ahnung, kein Plan man, Key-ID-Header ist Invalid-Account,"}, {"id": 742, "start": 6196.04, "end": 6204.92, "text": "irgendjemand im Plan was der für Schmerzen hat, ich hätte jetzt eigentlich gerechnet"}, {"id": 743, "start": 6204.92, "end": 6211.12, "text": "damit, das geht einfach, weil wenn, wenn über Staging das funktioniert und ich die Url austausche,"}, {"id": 744, "start": 6211.12, "end": 6217.08, "text": "dann würde man erwarten, dass es für Produktion auch geht, also fürs Produktive Let's Encrypt,"}, {"id": 745, "start": 6217.08, "end": 6225.12, "text": "ist die URL vielleicht doch falsch, es muss doch irgendwo ein Cert Manager Let's Encrypt"}, {"id": 746, "start": 6225.12, "end": 6237.72, "text": "Exempel geben, kann doch nicht sein, irgendwas Aktuelles halt, irgendwas aus dem letzten Jahr,"}, {"id": 747, "start": 6237.72, "end": 6259.72, "text": "Let's Encrypt, Staging, so schlau bin ich auch, ich will es ja nicht für Staging, das hatte ich ja schon,"}, {"id": 748, "start": 6259.72, "end": 6274.48, "text": "gibt es das vielleicht auch mal ohne Staging das Beispiel, ja Digital ist das beste, was"}, {"id": 749, "start": 6274.48, "end": 6281.96, "text": "habe ich verkehrt gemacht, keine Ahnung, ich ändere jetzt, okay ich probiere jetzt mal das aus,"}, {"id": 750, "start": 6281.96, "end": 6291.12, "text": "ich ändere jetzt die URL für meine App, das ist jetzt CuteApp-Prot und das heißt auch Minus"}, {"id": 751, "start": 6291.12, "end": 6302.32, "text": "Prot-TLS, push, dann schauen wir mal ob das funktioniert, weil ansonsten wüsste ich echt"}, {"id": 752, "start": 6302.32, "end": 6318.88, "text": "nicht mehr, was er noch für Schmerzen hat, das sieht gut aus, hier Digital Ocean,"}, {"id": 753, "start": 6318.88, "end": 6336.84, "text": "haben wir noch da bestimmt, ist doch genau das, Moment, ist doch genau das was ich verwende, ist"}, {"id": 754, "start": 6336.84, "end": 6345.6, "text": "ein Bug ja, das kann tatsächlich sein, dass der denkt das ist der alte, jedenfalls doof,"}, {"id": 755, "start": 6345.6, "end": 6349.84, "text": "dass es nicht funktioniert, aber jetzt habe ich den neuen Domain, also mit der muss es ja"}, {"id": 756, "start": 6349.84, "end": 6359.8, "text": "auf jeden Fall funktionieren, CuteApp-Prot, okay das ist das ist soweit, okay CuteApp-Prot,"}, {"id": 757, "start": 6359.8, "end": 6378.84, "text": "gut, das ist in Ordnung, so in 1-2 Minuten sollte er jetzt ein gültiges Zertifikat haben, schauen"}, {"id": 758, "start": 6378.84, "end": 6389.36, "text": "wir mal ob das so ist, jetzt bräuchte man so ein Tail oder sowas, okay, not yet propagated,"}, {"id": 759, "start": 6389.36, "end": 6395.88, "text": "ne Anführungszeichen sind es eigentlich, ich habe die extra drum gemacht, das sollte in"}, {"id": 760, "start": 6395.88, "end": 6410.6, "text": "Jaml an der Stelle keinen Unterschied machen, hat funktioniert, hat funktioniert, CuteApp-Prot,"}, {"id": 761, "start": 6425.88, "end": 6443.56, "text": "ach ich habe oben vergessen anzupassen, Lul, push, aber man sieht einen Vorteil davon schon,"}, {"id": 762, "start": 6443.56, "end": 6452.04, "text": "es ist alles nachvollziehbar, das ist halt wirklich nice, ich muss nichts per CubeCTL"}, {"id": 763, "start": 6452.04, "end": 6459.08, "text": "oder sonst was machen, es wird alles automatisch Applied ausgerollt auf mein Cluster, ich beschleunige"}, {"id": 764, "start": 6459.08, "end": 6463.92, "text": "das ganze jetzt halt mal ein bisschen, es wird alles automatisch ausgerollt auf mein Cluster"}, {"id": 765, "start": 6463.92, "end": 6469.32, "text": "und das ist natürlich cool, so jetzt sollte es eigentlich schon gehen, Pester geht, so und jetzt"}, {"id": 766, "start": 6469.32, "end": 6475.52, "text": "wird euch vielleicht was auffallen, ich habe ein gültiges Let's Encrypt Zertifikat, also es hat"}, {"id": 767, "start": 6475.52, "end": 6483.52, "text": "funktioniert, Verified Let's Encrypt, echtes gültiges Zertifikat, nicht Self-Signed, nicht"}, {"id": 768, "start": 6483.52, "end": 6489.84, "text": "Staging, sondern richtig echtes Zertifikat, was in jeder Browser akzeptiert und das kann ich jetzt"}, {"id": 769, "start": 6489.84, "end": 6496.36, "text": "für jede App anfordern lassen in der Config aus meinem Kubernetes-Klasse, also wenn ich jetzt hier"}, {"id": 770, "start": 6496.36, "end": 6502.68, "text": "noch 15 andere Apps reinpappe, dann muss ich einfach so einen Eintrag hier rein machen und schon kriegen"}, {"id": 771, "start": 6502.68, "end": 6515.64, "text": "ich ein Zertifikat ausgestellt über den Certificate Manager und haben ein gültiges TLS SSL HTTPS"}, {"id": 772, "start": 6515.64, "end": 6519.72, "text": "Zertifikat, so wir machen jetzt noch mal das andere, wundert mich nämlich, dass es mit ArgoCD"}, {"id": 773, "start": 6519.72, "end": 6527.8, "text": "nicht richtig funktioniert, guck mal hier CR, CR, All Namespaces, True, False, wir löschen es jetzt einfach mal,"}, {"id": 774, "start": 6527.8, "end": 6536.4, "text": "hier Delete, habe ich glaube ich noch nie gemacht, CR, wie löscht man das eigentlich, Namespace,"}, {"id": 775, "start": 6536.4, "end": 6546.72, "text": "achso okay einfach so, alles als Helm-Chart bauen, nee warum, das ist doch so übersichtlich genug,"}, {"id": 776, "start": 6546.72, "end": 6552.84, "text": "da brauche ich doch keine Helm-Charts für, bin ich der große Helm-Freund ehrlich gesagt, vielleicht"}, {"id": 777, "start": 6552.84, "end": 6558.44, "text": "kommt noch irgendwann das große Aha-Erlebnis, wo ich sagen würde, ja unbedingt, aber ich denke mir"}, {"id": 778, "start": 6558.44, "end": 6564.4, "text": "halt die meisten Sachen zusammen bundeln kannst du mit Customize machen und sobald man Logik braucht"}, {"id": 779, "start": 6564.4, "end": 6569.52, "text": "und Templates braucht, da finde ich Helm jetzt auch nicht so wirklich nice, ich meine du kannst"}, {"id": 780, "start": 6569.52, "end": 6575.76, "text": "das damit machen, aber es ist halt diese komische Go-Template-Syntax, dann würde ich, wenn ich"}, {"id": 781, "start": 6575.76, "end": 6580.48, "text": "wirklich was kompliziertes machen will, dann würde ich wahrscheinlich sogar lieber sowas verwenden"}, {"id": 782, "start": 6580.48, "end": 6585.52, "text": "und das in einer ordentlichen Programmiersprache erstellen, meine Manifests, da kann ich nämlich"}, {"id": 783, "start": 6585.52, "end": 6590.56, "text": "wirklich alles machen, wie ich will, aber das ist ein bisschen Philosophie-Frage, das ist ein bisschen"}, {"id": 784, "start": 6590.56, "end": 6597.92, "text": "Richtung Pulumi versus Terraform, die einen sagen ja klar Easy Terraform Beste reicht für alles und"}, {"id": 785, "start": 6597.92, "end": 6601.32, "text": "die anderen sagen ja ein bisschen Programmiersprache, Logik drumherum war auch nicht verkehrt."}, {"id": 786, "start": 6601.32, "end": 6611.4, "text": "Fordert er jetzt das ganze noch mal neu an oder muss ich noch irgendwas machen?"}, {"id": 787, "start": 6611.4, "end": 6617.52, "text": "Wer hat das eben vorgeschlagen mit CR löschen und alles ist gut?"}, {"id": 788, "start": 6617.52, "end": 6631.16, "text": "Muss ich jetzt noch irgendwas machen, dass er das noch mal anfragt?"}, {"id": 789, "start": 6631.16, "end": 6638.64, "text": "Ich hätte jetzt, guck mal hier, wenn ich jetzt sage Argo CD Kappa Lull, dann ist immer noch"}, {"id": 790, "start": 6638.64, "end": 6646.32, "text": "das Self-Sign-Zertifikan am Start. Ich weiß es gibt für Third Manager ein"}, {"id": 791, "start": 6646.32, "end": 6653.68, "text": "Commando Sign Tool, um sowas zu machen, aber man muss es ja auch irgendwie im Plaster anfordern"}, {"id": 792, "start": 6653.68, "end": 6662.36, "text": "können und das ohne, dass ich das lösche, ist ja doof, wenn ich das jedes mal löschen muss."}, {"id": 793, "start": 6662.36, "end": 6670.4, "text": "Argo CD TLS habe ich gelöscht, muss ich das Zertifikat selber vielleicht noch löschen?"}, {"id": 794, "start": 6670.4, "end": 6680.28, "text": "Request habe ich schon gelöscht, Zertifikat, das können wir löschen, ok, das muss ich"}, {"id": 795, "start": 6680.28, "end": 6688.36, "text": "vielleicht löschen, dass das dann checkt. Jetzt funktioniert es, ok, jetzt haben wir"}, {"id": 796, "start": 6688.36, "end": 6704.8, "text": "das Zertifikat selbst, Blablabla. Was? Ok, jetzt sollte es funktionieren."}, {"id": 797, "start": 6704.8, "end": 6715.56, "text": "Jetzt müsste es gleich funktionieren, hol mal aus Argo CD Kappa Lull, noch ist es das"}, {"id": 798, "start": 6715.56, "end": 6734.32, "text": "falsche Zertifikat, noch ist es das Fake Ingress Zertifikat, Watch. Ich hoffe, dass der Kram"}, {"id": 799, "start": 6734.32, "end": 6747.6, "text": "gleich auf True springt, True Lull W, wenn es Propagated ist. Ich meine, ich habe das"}, {"id": 800, "start": 6747.6, "end": 6752.56, "text": "Zertifikat gelöscht, ich habe den Zertifikat Request gelöscht, eigentlich sollte er jetzt"}, {"id": 801, "start": 6752.56, "end": 6764.64, "text": "ein neues Zertifikat anfragen, aber noch ist es das alte, vielleicht wird es sonst"}, {"id": 802, "start": 6764.64, "end": 6769.8, "text": "noch irgendwo gecasht, kein Plan. Zumindest für unsere App hat er schon mal, ach jetzt,"}, {"id": 803, "start": 6769.8, "end": 6778.12, "text": "True, True, aber hier ist noch das alte. Ok, er hat jetzt ein gültiges Zertifikat,"}, {"id": 804, "start": 6778.12, "end": 6790.72, "text": "aber er liefert noch das alte aus, warum? Oder ist das ein Firefox Ding? Ah easy, funktioniert,"}, {"id": 805, "start": 6790.72, "end": 6797.28, "text": "alles gut, Firefox hat es gecasht, ok, alles gut, in Chrome sieht man, dass es funktioniert,"}, {"id": 806, "start": 6797.28, "end": 6803.76, "text": "guck, zack, gültiges Zertifikat, Connection ist secure, vertraut und das ganze ist ausgestellt,"}, {"id": 807, "start": 6803.76, "end": 6814.6, "text": "Argo CD Kappa Lull, Let's Encrypt, so muss das sein, wunderbar. So, jetzt kann man das"}, {"id": 808, "start": 6814.6, "end": 6821.4, "text": "vielleicht noch ein bisschen in der Handhabung angenehmer machen, indem wir jetzt zum Beispiel"}, {"id": 809, "start": 6821.4, "end": 6831.12, "text": "einen zweiten Cluster Issuer definieren, den man, na komm, scheiß drauf, also ich hab euch,"}, {"id": 810, "start": 6831.12, "end": 6835.76, "text": "ne, das machen wir nicht, das machen wir nicht, weil aus dem Grund, ich stell das um, aus"}, {"id": 811, "start": 6835.76, "end": 6839.6, "text": "einem ganz praktischen Grund, ich hab keinen Bock, dass ich jetzt den Cluster ein paar"}, {"id": 812, "start": 6839.6, "end": 6846.12, "text": "mal neu aufsetze und neu starte und ich mein wöchentliches Let's Encrypt Kontingent damit"}, {"id": 813, "start": 6846.12, "end": 6850.76, "text": "irgendwie voll mache, da hab ich wirklich keinen Nerv drauf, deswegen, ich tu einfach"}, {"id": 814, "start": 6850.76, "end": 6855.32, "text": "so, als wäre das echte Zertifikate, ich hab euch jetzt gezeigt, es funktioniert, ja,"}, {"id": 815, "start": 6855.32, "end": 6860.88, "text": "es gibt richtig echte, gültige Zertifikate und das funktioniert und die Browser vertrauen"}, {"id": 816, "start": 6860.88, "end": 6866.88, "text": "dem, aber ich stell's wieder um hier auf das Staging Area, da gibt's gar keine Probleme."}, {"id": 817, "start": 6866.88, "end": 6878.56, "text": "Push, gut, dann hätten wir das an der Stelle eigentlich schon, was haben wir gemacht, wir"}, {"id": 818, "start": 6878.56, "end": 6892.8, "text": "haben Zert Manager installiert und wir haben External Secrets, Private Key Secret Ref,"}, {"id": 819, "start": 6892.8, "end": 6914.4, "text": "ja, stell was so um, so und jetzt können wir per External Secrets auf unseren Passwort"}, {"id": 820, "start": 6914.4, "end": 6923.52, "text": "von Vault zugreifen, dort Tokens, Username, Passwörter auslesen und mit Zert Manager Zertifikate"}, {"id": 821, "start": 6923.52, "end": 6931.66, "text": "ausstellen für alle Services im Cluster, so, das war's jetzt im Prinzip, was man großartig"}, {"id": 822, "start": 6931.66, "end": 6936.24, "text": "selbst konfigurieren muss, das weitere Zeug kann man eigentlich mehr oder weniger so installieren"}, {"id": 823, "start": 6936.24, "end": 6940.6, "text": "oder eben Apps drauf hosten, wir haben jetzt die grundlegenden Sachen da, das nächste"}, {"id": 824, "start": 6940.6, "end": 6949.28, "text": "Mal können wir uns noch eine Runde Monitor, wobei, ich mein, es ist noch Zeit, wir könnten"}, {"id": 825, "start": 6949.28, "end": 6957.16, "text": "jetzt auch noch ein bisschen, wir könnten irgendwie mal so ein Prometheus Stack rein"}, {"id": 826, "start": 6957.16, "end": 6965.12, "text": "pushen, wobei, nee, Prometheus drauf zu hauen ist wirklich abfuck, bis das läuft, ich mein,"}, {"id": 827, "start": 6965.12, "end": 6969.52, "text": "wir können's probieren, vielleicht geht's auch, soll man noch probieren Prometheus drauf"}, {"id": 828, "start": 6969.52, "end": 6976.0, "text": "zu hauen für Cluster Monitoring, ich hab fertige Manifests dafür, wo ich eigentlich"}, {"id": 829, "start": 6976.0, "end": 6982.04, "text": "nur Copy Paste muss und wir uns das Ganze angucken können, aber es hängt halt einiges dran"}, {"id": 830, "start": 6982.04, "end": 6993.56, "text": "und das ist ein bisschen blöd, also zum Beispiel, wenn ich Grafana installieren will, ne, Check"}, {"id": 831, "start": 6993.56, "end": 6999.68, "text": "MK will ich jetzt grade nicht machen, okay, wir probieren das mal, also wir machen eine"}, {"id": 832, "start": 6999.68, "end": 7017.8, "text": "neue App, in dem Fall Grafana.YAML, ich Copy Paste das mal und dann erzähl ich was zu,"}, {"id": 833, "start": 7017.8, "end": 7022.64, "text": "wir müssen eh ein paar Sachen anpassen, so, wir installieren jetzt Grafana, wir installieren"}, {"id": 834, "start": 7022.64, "end": 7028.56, "text": "hier einfach nur Grafana, wir installieren den Kubernetes Prometheus Stack, der besteht"}, {"id": 835, "start": 7028.56, "end": 7035.96, "text": "aus einem Prometheus, aus einem Grafana, aus irgendeinem Loki Endpunkt, aus zig tausend"}, {"id": 836, "start": 7035.96, "end": 7040.2, "text": "Zeug, vergiss es, so, Loki schmeißen wir raus, das werd ich jetzt nicht installieren,"}, {"id": 837, "start": 7040.2, "end": 7045.8, "text": "Grafana Services lassen wir so stehen, wie es ist, Project wird Default, das reicht,"}, {"id": 838, "start": 7045.8, "end": 7052.2, "text": "ansonsten der Rest passt, glaub ich, so und das hier geht auch noch nicht, weil Prometheus"}, {"id": 839, "start": 7052.2, "end": 7059.36, "text": "ist ein Monitoring System, das heißt, das braucht Storage logischerweise und es gibt"}, {"id": 840, "start": 7059.36, "end": 7064.72, "text": "nur ein Plugin, das würd ich normalerweise jetzt vielleicht in einem Cloud Service nicht"}, {"id": 841, "start": 7064.72, "end": 7070.36, "text": "verwenden, aber lokal ist es ganz praktisch, da kann man automatisch den Storage auf der"}, {"id": 842, "start": 7070.36, "end": 7076.2, "text": "lokalen Kiste professionieren lassen für Container in Kubernetes, das ist ganz praktisch,"}, {"id": 843, "start": 7076.2, "end": 7080.36, "text": "das hauen wir jetzt auch noch rein, ich bin mir gar nicht sicher, was er macht, wenn ich"}, {"id": 844, "start": 7080.36, "end": 7086.48, "text": "die Storage Glass weglasse, wahrscheinlich gar nicht starten, dafür machen wir jetzt"}, {"id": 845, "start": 7086.48, "end": 7096.96, "text": "hier noch Local Storage, das Storage Punkt Jamme, Local Storage, Local Storage Punkt"}, {"id": 846, "start": 7096.96, "end": 7106.28, "text": "Jamme und da kommt folgendes rein, ich muss mir gleich die Manifest nochmal angucken,"}, {"id": 847, "start": 7106.28, "end": 7111.92, "text": "ich hab bestimmt irgendwas übersehen, da kommt folgendes rein, bla bla bla blub, dieses"}, {"id": 848, "start": 7111.92, "end": 7117.72, "text": "Repo, bla bla bla blub, fertig aus, Zombie, das passt so, das ist wie gesagt nur für"}, {"id": 849, "start": 7117.72, "end": 7124.68, "text": "lokale Cluster, das würd ich nicht unbedingt machen, das ist Public, Kyo-Kun, ach du bist"}, {"id": 850, "start": 7124.68, "end": 7134.68, "text": "auch mal wieder am Start, moin, ja, das ist Public, ok, ich hoffe, ich hab alles richtig"}, {"id": 851, "start": 7134.68, "end": 7140.92, "text": "gemacht, das sollte eigentlich jetzt schon reichen für eine Runde Grafana, es ist nicht"}, {"id": 852, "start": 7140.92, "end": 7151.36, "text": "auf Wublaws, es ist, hier guck mal, in der Fiveheader Organisation ist es, damit ich"}, {"id": 853, "start": 7151.36, "end": 7158.32, "text": "nicht, falls ich im Trocken liege, nix passiert, ist das in der Organisation drinne, so wenn"}, {"id": 854, "start": 7158.32, "end": 7169.72, "text": "ich jetzt Glück habe, sollte mein Prometheus funktionieren gleich, ich bin da noch skeptisch,"}, {"id": 855, "start": 7169.72, "end": 7176.12, "text": "hab ich irgendwelche Repos vielleicht noch nicht angepasst, ne Repos drinne passt, ok,"}, {"id": 856, "start": 7176.12, "end": 7180.68, "text": "checken wir mal, so wir müssen wieder nichts selbst machen, ich beschleunige nur das Refreshen"}, {"id": 857, "start": 7180.68, "end": 7191.96, "text": "mal, Argo CD wird das ganze für uns installieren, Local Path, ok, Local Path ist installiert,"}, {"id": 858, "start": 7191.96, "end": 7198.76, "text": "so wenn wir Glück haben, geht Grafana jetzt auch noch, Grafana dauert ein bisschen zum"}, {"id": 859, "start": 7198.76, "end": 7201.84, "text": "installieren, ihr sehts hier oben vielleicht, mein Rechner ist ein bisschen am abkacken"}, {"id": 860, "start": 7201.84, "end": 7209.32, "text": "gerade, und dann haben wir gleich einen Grafana Stack laufen, wo wir unseren Cluster mit monitorn"}, {"id": 861, "start": 7209.32, "end": 7219.12, "text": "können, wenn das funktioniert, das ist immer ein bisschen eklig, was hat er hier was nicht"}, {"id": 862, "start": 7219.12, "end": 7225.12, "text": "funktioniert, ah Namespace, den Namespace gibt es nicht, wobei hab ich nicht gesagt"}, {"id": 863, "start": 7225.12, "end": 7235.0, "text": "Create Namespace, doch hab ich gesagt, müsste funktionieren, was hat er das Problem für"}, {"id": 864, "start": 7235.0, "end": 7248.36, "text": "Namespace, de-created, warum, oh Moment, soll ich mir erzählen, dass mein Grafana einfach"}, {"id": 865, "start": 7248.36, "end": 7263.56, "text": "jetzt funktioniert oder was, so ganz von alleine, Moin, Shane Law, wie Moment, das hat auf"}, {"id": 866, "start": 7263.56, "end": 7268.28, "text": "ihn funktioniert, meine Grafana Installation, da hab ich jetzt aber, da hab ich jetzt ehrlich"}, {"id": 867, "start": 7268.28, "end": 7279.6, "text": "gesagt nicht mit gerechnet, also aber gar nicht, ok, ja, dann connecten wir uns mal zu"}, {"id": 868, "start": 7279.6, "end": 7289.88, "text": "unserem Grafana, und zwar auf den Grafana Service, wie macht man das mit K9S denn jetzt"}, {"id": 869, "start": 7289.88, "end": 7298.68, "text": "eigentlich so hier, auf Grafana Service, das sind ja nur Pods, ich will ja den Service"}, {"id": 870, "start": 7298.68, "end": 7310.2, "text": "haben, wie lässt man sich hier den Service anzeigen, beim Plan, ich weiß, wie ich Spiel"}, {"id": 871, "start": 7310.2, "end": 7317.04, "text": "in CubeZtl mache, keine Ahnung, wie könnte man das mit K9S machen jetzt den Service,"}, {"id": 872, "start": 7317.04, "end": 7338.68, "text": "egal, wir machen Forward, service, auf Service Grafana, Grafana, nein, wie heißt das Service,"}, {"id": 873, "start": 7338.68, "end": 7353.0, "text": "was heißt Grafana, achso, ich hab den Namespace überschrieben, das ist auch nicht Portding,"}, {"id": 874, "start": 7353.0, "end": 7371.32, "text": "sondern Port 80, nee, Port 3000, nee, wo denn, Get Service, Get Service, Grafana Service"}, {"id": 875, "start": 7371.32, "end": 7379.12, "text": "läuft auf Port 80, läuft nicht Grafana, normalerweise auf Port 8000, na gut, Local House 8080 und"}, {"id": 876, "start": 7379.12, "end": 7389.64, "text": "schon haben wir einen Grafana am Start, zack, kann man die Helm-Values noch in eine eigene"}, {"id": 877, "start": 7389.64, "end": 7396.6, "text": "Datei kippen, ja, es gibt verschiedene Varianten, wie man das machen kann, also, es gibt in"}, {"id": 878, "start": 7396.6, "end": 7401.12, "text": "ArgoCD zwei Varianten, wie man Helmcharts installieren kann, du kannst Helmcharts entweder"}, {"id": 879, "start": 7401.12, "end": 7406.64, "text": "direkt als Application und zwar als Helmchart angeben, dann kannst du hier, achso, du meinst"}, {"id": 880, "start": 7406.64, "end": 7414.76, "text": "die Values hier in der eigenen Datei, du kannst irgendeine Config, ja, das geht, das geht,"}, {"id": 881, "start": 7414.76, "end": 7421.32, "text": "das war nochmal ArgoCD Helm-Values, das geht, die Hilfe-Seite von denen ist tatsächlich"}, {"id": 882, "start": 7421.32, "end": 7436.64, "text": "ganz nice, Value Files, hier, hier, du kannst, du kannst, hier, so, das kannst du angeben,"}, {"id": 883, "start": 7436.64, "end": 7460.16, "text": "Value Files, Values Production-Yaml, ja, das kannst du machen, it's Ctrl-Z-Button-Paper,"}, {"id": 884, "start": 7460.16, "end": 7476.92, "text": "ok Chain-Lore, all du's bist, das können wir uns morgen früh angucken, ja, das, das"}, {"id": 885, "start": 7476.92, "end": 7484.32, "text": "funktioniert, ja, genau, es gibt zwei Varianten, wie du Helmcharts hinzufügen kannst, einmal"}, {"id": 886, "start": 7484.32, "end": 7491.56, "text": "hier halt direkt als Helmchart enden oder wenn du das Helmchart selber noch etwas erweitern"}, {"id": 887, "start": 7491.56, "end": 7497.12, "text": "musst, ohne dass du selbst quasi ein eigenes Chart machen willst mit der Dependency auf"}, {"id": 888, "start": 7497.12, "end": 7506.2, "text": "das andere Chart und sowas, da kannst du's einfach auch in die, da kannst du's auch"}, {"id": 889, "start": 7506.2, "end": 7513.56, "text": "so in der Customize-Datei reinschreiben, funktioniert auch, da kannst du hier noch andere Sachen"}, {"id": 890, "start": 7513.56, "end": 7517.96, "text": "incluiden im gleichen Ordner, ohne dass du quasi das Helmchart forken musst oder ohne"}, {"id": 891, "start": 7517.96, "end": 7526.24, "text": "dass du das Helmchart extenden musst, für kleine Sachen ist das ganz, ganz nice, ist"}, {"id": 892, "start": 7526.24, "end": 7537.96, "text": "halt wieder komplex, as fuck, unnötigerweise, so, ja, also, wir haben uns bei Grafana eingeloggt,"}, {"id": 893, "start": 7537.96, "end": 7542.16, "text": "jetzt können wir mal unseren Cluster uns angucken, also, Browse, das war jetzt wirklich easy"}, {"id": 894, "start": 7542.16, "end": 7551.4, "text": "mit Grafana, Browse, so, wir haben ein paar Standard-Dashboards dabei, ja, das stimmt"}, {"id": 895, "start": 7551.4, "end": 7559.02, "text": "wohl, das ist, da ist vieles, immer auf 50 Varianten möglich und bei Yammel-Bausen laufen"}, {"id": 896, "start": 7559.02, "end": 7563.64, "text": "auch irgendwelche Fehler ein, so, gucken wir uns mal, gucken wir uns mal die mitgelieferten"}, {"id": 897, "start": 7563.64, "end": 7568.8, "text": "Dashboards an, ob da irgendwas Spannendes drin ist, Cordien ist, okay, alert man, dass"}, {"id": 898, "start": 7568.8, "end": 7577.24, "text": "was drin, ah ja, interessant, nichts, sehr schön, ah, nichts, excellent, auch sehr interessant,"}, {"id": 899, "start": 7577.24, "end": 7580.88, "text": "wahrscheinlich sollte ich mal auf die letzten fünf Minuten stellen, auch nicht, wann habe"}, {"id": 900, "start": 7580.88, "end": 7588.2, "text": "ich überhaupt Datenquellen drinnen, die funktionieren, data sources, ja, ich hab die Standard-Prometos-Data-Source"}, {"id": 901, "start": 7588.2, "end": 7595.68, "text": "drin, die sollte funktionieren, ah, hier steht was drinnen, computer-sources, CPU, no data,"}, {"id": 902, "start": 7595.68, "end": 7605.92, "text": "auch geil, nice, ggeats, no data, hier, memory, doch ein paar Sachen stehen drin, CPU-limits"}, {"id": 903, "start": 7605.92, "end": 7612.24, "text": "und sowas, no data, CPU-usage, ich geh davon aus, du musst einfach noch ein bisschen einsammeln,"}, {"id": 904, "start": 7612.24, "end": 7619.36, "text": "da steht überall nichts drin, excellent, sehr schön, alles klar, da weiß man gleich"}, {"id": 905, "start": 7619.36, "end": 7637.08, "text": "Bescheid, okay, hier steht was drin, CPU-utilization, aber die Grafen sind auch noch nicht gefüllt,"}, {"id": 906, "start": 7637.08, "end": 7642.88, "text": "hier haben wir ein bisschen was, api-server und hier haben wir overview, Cordien, Cordien"}, {"id": 907, "start": 7642.88, "end": 7649.76, "text": "S, haben wir ein paar Anfragen, okay, Requests, Alert-Manager, ja gut, wollen wir haben Alerts,"}, {"id": 908, "start": 7649.76, "end": 7663.48, "text": "warum haben wir Alerts, von was, ja, wenn wir schon so gerade so nice am Monitoren sind,"}, {"id": 909, "start": 7663.48, "end": 7668.68, "text": "hauen wir auch gleich nochmal Loki drauf für Loks, dann kann ich euch das auch zeigen,"}, {"id": 910, "start": 7668.68, "end": 7681.2, "text": "so, aber jetzt, okay, langsam, lang, aber, ja, doch, jetzt, jetzt kriegen wir langsam"}, {"id": 911, "start": 7681.2, "end": 7687.36, "text": "ein paar Werte her, nicht dass mir das jetzt irgendwie großartig ist, was sagt, aber wir"}, {"id": 912, "start": 7687.36, "end": 7692.32, "text": "haben schon ein paar hübsche Dashboards, die beim Chef Eindruck machen, gibt es Monitoring"}, {"id": 913, "start": 7692.32, "end": 7697.4, "text": "fürs Monitoring und dann Monitoring fürs Monitoring, um dann wiederum das Monitor zu"}, {"id": 914, "start": 7697.4, "end": 7714.28, "text": "monitorn, mein Monitoring des Monitorings ist mein Auge, iChamp, so, Loki am Start,"}, {"id": 915, "start": 7714.28, "end": 7719.56, "text": "mehr müssen wir hier glaube ich an der Stelle nicht machen, Projekt Default und wir müssen"}, {"id": 916, "start": 7719.56, "end": 7736.56, "text": "jetzt noch hier abschließend in Grafana die Loki-Source einbinden und dann habe ich sogar"}, {"id": 917, "start": 7736.56, "end": 7744.72, "text": "Log-Dateien, ich zeige euch noch was wichtiges an der Stelle, guckt mal hier, Server-Site-Apply-True"}, {"id": 918, "start": 7744.72, "end": 7754.68, "text": "muss man setzen, weil Grafana bzw. dieses ganze Bundle hier aus Cube, Prometheus, Stack und"}, {"id": 919, "start": 7754.68, "end": 7760.36, "text": "alles mögliche, das ist so groß, dass das Probleme hat, wenn es an die Kubernetes-AP"}, {"id": 920, "start": 7760.36, "end": 7766.08, "text": "geschickt wird, deswegen muss man Server-Site-Apply einstellen, dann gibt es keine Probleme mehr."}, {"id": 921, "start": 7766.08, "end": 7783.44, "text": "So, Push, jetzt sollten wir auch gleich noch eine Loki-Installation haben, achso, Local-Host,"}, {"id": 922, "start": 7783.44, "end": 7807.64, "text": "das ist ja klar, dass das nicht geht, Secret, Massive Password, Loki, da ist es doch schon"}, {"id": 923, "start": 7807.64, "end": 7825.36, "text": "und es ist auch gesüngt, der Pod startet noch nicht, mal abwarten, sollte sich hoffentlich"}, {"id": 924, "start": 7825.36, "end": 7853.52, "text": "gleich erledigt haben, Loki ist nicht Running, vielleicht braucht er einfach noch ein bisschen,"}, {"id": 925, "start": 7853.52, "end": 7858.04, "text": "ja, aber wir sind gleich fertig, ok, Loki hat kein Bock zu starten, mal gucken was ich"}, {"id": 926, "start": 7858.04, "end": 7872.48, "text": "verkackt habe, Logs, Loki, warum will das nicht starten, weil, Handing Over Indexes"}, {"id": 927, "start": 7872.48, "end": 7879.28, "text": "to Shipper, alles klar, die allerbesten Fehlermeldungen, achja ok, es läuft, ich habe nichts gesagt,"}, {"id": 928, "start": 7879.28, "end": 7886.2, "text": "funktioniert, Loki läuft, so, das heißt, ich kann jetzt auch in meinen Grafana gehen"}, {"id": 929, "start": 7886.2, "end": 7901.88, "text": "und wenn ich Glück habe, haben die, achso, vielleicht soll ich, Forwarding ist an, Forwarding"}, {"id": 930, "start": 7901.88, "end": 7916.84, "text": "ist an, Unexpected Error, ok, geht es jetzt, kein Unexpected Error mehr, Data Sources,"}, {"id": 931, "start": 7916.84, "end": 7927.08, "text": "Loki am Start, ok, so, jetzt können wir mal unsere Log-Dateien browsen, Data Source, Loki"}, {"id": 932, "start": 7927.08, "end": 7932.72, "text": "und zwar, keine Ahnung, hier, Pod, und zwar wollen wir uns Logs angucken und besser gesagt"}, {"id": 933, "start": 7932.72, "end": 7940.92, "text": "Server, egal, Pod, Pod wollen wir uns angucken vom Server Manager unbedingt, so, Run Query"}, {"id": 934, "start": 7940.92, "end": 7947.92, "text": "und wir haben Logs drinnen, Bam, wir sehen was kritisch ist, wir sehen was nicht kritisch"}, {"id": 935, "start": 7947.92, "end": 7956.16, "text": "ist, können Logs durchsuchen, eigentlich ganz nice, hier sieht man ok, da gab es irgendwelche"}, {"id": 936, "start": 7956.16, "end": 7964.6, "text": "Fehler, man könnte jetzt noch ein Log-Level einstellen, das ging jetzt deutlich schneller"}, {"id": 937, "start": 7964.6, "end": 7975.96, "text": "als ich gedacht habe, mein so ist das ein ziemliches Müll-Frontend, ja, oh, was macht"}, {"id": 938, "start": 7975.96, "end": 7981.68, "text": "er denn hier, ja, aber das ist doch jetzt schon mal eine ganz gute Grundlage, ich meine,"}, {"id": 939, "start": 7981.68, "end": 7988.8, "text": "da können wir doch die nächsten Male ordentlich weiter machen, wir haben alle Basics da, die"}, {"id": 940, "start": 7988.8, "end": 7994.4, "text": "wir brauchen, wir haben einen Cert Manager für Zertifikate, wir haben eine Testanwendung"}, {"id": 941, "start": 7994.4, "end": 7999.8, "text": "für unseren Kram, wir haben Anbindung an unseren Key Vault, das heißt selbst wenn ich mal meine"}, {"id": 942, "start": 7999.8, "end": 8005.4, "text": "Keys ändere, dann ist es easy, das einfach im Vault anpassen und gut ist und der Cluster"}, {"id": 943, "start": 8005.4, "end": 8011.96, "text": "aktualisiert sich, wir haben Logging, wir haben lokale Storage, wir haben Grafana fürs"}, {"id": 944, "start": 8011.96, "end": 8019.48, "text": "Monitoring beziehungsweise zum drauf gucken, Argo CD zum automatisch ausrollen, das ist"}, {"id": 945, "start": 8019.48, "end": 8035.92, "text": "auch schon mal ein ganz gutes Setup, nutzt du Wayland oder X, das ist X, Wayland funktioniert"}, {"id": 946, "start": 8035.92, "end": 8053.2, "text": "ja vm nicht gescheit, das ist ja immer noch meine Linux vm, ja guck hier Windows da Linux,"}, {"id": 947, "start": 8053.2, "end": 8063.36, "text": "ok."}, {"id": 948, "start": 8063.36, "end": 8092.52, "text": "So, ja gut, man könnte sich jetzt noch ein bisschen Gedanken darüber machen, warum zum"}, {"id": 949, "start": 8092.52, "end": 8101.12, "text": "Beispiel die Qt App hier die ganze Zeit so ein drehendes Ding hat. Könnte das sein,"}, {"id": 950, "start": 8101.12, "end": 8109.32, "text": "dass der Health Check schlicht und ergreifend nicht funktioniert? Was habe ich denn da für"}, {"id": 951, "start": 8109.32, "end": 8117.52, "text": "den Health Check eingestellt? Gar keinen! Nee doch, hier. Readiness Probe slash Health,"}, {"id": 952, "start": 8117.52, "end": 8135.64, "text": "das sollte doch eigentlich funktionieren. Holen wir mal aus. Slash Health, jo. Health,"}, {"id": 953, "start": 8135.64, "end": 8141.64, "text": "ja, weil, weil, warum Health mit Z? Weil sich irgendwelche coolen Leute bei Google gedacht"}, {"id": 954, "start": 8141.64, "end": 8146.96, "text": "haben. Das ist eine gute Idee, das mit Z zu schreiben. Ich habe keine Ahnung, warum die"}, {"id": 955, "start": 8146.96, "end": 8155.2, "text": "auf diese klorreiche Idee gekommen sind. Aber der Default Endpunkt für einen Cluster Endpunkt,"}, {"id": 956, "start": 8155.2, "end": 8170.84, "text": "nein, für einen Service Endpunkt Check ist Health Z. Das ist der Default. Also warum"}, {"id": 957, "start": 8170.84, "end": 8175.8, "text": "der Service hier permanent in progressing ist, weiß ich nicht. Ich vermute aber mal,"}, {"id": 958, "start": 8175.8, "end": 8181.68, "text": "das liegt daran, weil ich es lokal betreibe und nicht bei einem Cloud-Anbieter. Also das"}, {"id": 959, "start": 8181.68, "end": 8186.6, "text": "ArgoCD da irgendwelche Probleme damit. Habe ich auch mal was zu gelesen. Progressing Service,"}, {"id": 960, "start": 8186.6, "end": 8195.24, "text": "wenn man das lokal hat. Hier, ArgoCD progressing state forever. Ja, Resource Health, genau,"}, {"id": 961, "start": 8195.24, "end": 8203.08, "text": "Service. If Service ist auf type Load Balancer, Status Load Balancer Ingress List ist non-empty."}, {"id": 962, "start": 8203.08, "end": 8215.76, "text": "Okay, wollen wir mal gucken, ob das auf Typ Load Balancer ist. Get Service, Minus A. Es"}, {"id": 963, "start": 8215.76, "end": 8227.52, "text": "ist auf type. Moment, ich habe da einen Falto, Qt-App muss ich gucken, hier. Load Balancer,"}, {"id": 964, "start": 8227.52, "end": 8235.92, "text": "aha. Das ist das Problem. Die App ist auf Typ, der Service ist auf Typ Load Balancer. Warum"}, {"id": 965, "start": 8235.92, "end": 8241.88, "text": "eigentlich? Kann der lokal gar nicht funktionieren. So, gucken wir mal wahrscheinlich, weil ich Mist"}, {"id": 966, "start": 8241.88, "end": 8246.96, "text": "eingestellt habe. Will ich Cluster IP haben? Wahrscheinlich will ich Cluster IP haben. Ist Cluster"}, {"id": 967, "start": 8246.96, "end": 8258.32, "text": "IP nicht so geil der Default? Okay, Push. Und jetzt hat sich das hoffentlich erledigt. Bäm. Alles"}, {"id": 968, "start": 8258.32, "end": 8276.48, "text": "gesüngt. Healthy, wunderbar. Pogu. So muss das sein. Haben wir alles am Start."}, {"id": 969, "start": 8276.48, "end": 8283.12, "text": "External Secrets, Zertifikate, Log-Auswertungen, Grafana-Dashboard, lokale Storage, automatisches"}, {"id": 970, "start": 8283.12, "end": 8289.6, "text": "Ausrollen auf dem Cluster. Da kann man doch mit leben, so. Okay, was sagt Chat-GPT? In Kubernetes"}, {"id": 971, "start": 8289.6, "end": 8294.72, "text": "ist slash Health ein Endpunkt für den einfachen Gesundheitscheck von Pods, während Health ein"}, {"id": 972, "start": 8294.72, "end": 8305.88, "text": "Endpunkt für erweiterte Prüfung der Pod-Gesundheit ist. Das erscheint mir ein bisschen sass, was Chat-GPT"}, {"id": 973, "start": 8305.88, "end": 8324.6, "text": "da erzählt. Also, ich mein, das heißt ja im Endeffekt, das gibt's nämlich gar nicht."}, {"id": 974, "start": 8324.6, "end": 8334.44, "text": "Dass das Z für Zero steht, nee, das ist irgendwie so Google-Ding mit dem Z hinten dran. Keine Ahnung."}, {"id": 975, "start": 8334.44, "end": 8351.6, "text": "Svelte. Svelte, finde ich, ist mit Abstand mein Favorite. Wenn du was brauchst, was verbreitet"}, {"id": 976, "start": 8351.6, "end": 8357.0, "text": "ist, also super krass weit verbreitet, und wenn du Leute finden willst, die mit dran arbeiten,"}, {"id": 977, "start": 8357.0, "end": 8361.92, "text": "da bleibt ja eigentlich nur React. React ist das mit Abstand, wirklich mit riesem Abstand"}, {"id": 978, "start": 8361.92, "end": 8367.36, "text": "verbreitetste Frontend-Framework, wo du auch ein paar Leute für findest, die davon Plan"}, {"id": 979, "start": 8367.36, "end": 8391.32, "text": "haben. Ja, mit Svelte, weiß ich nicht, ob es da so viele gibt. So. Leute, wir haben"}, {"id": 980, "start": 8391.32, "end": 8400.0, "text": "noch eine Stunde Zeit, was machen wir denn jetzt? Wir haben jetzt 2 Stunden 15 Kubernetes-ed,"}, {"id": 981, "start": 8400.0, "end": 8413.48, "text": "können wir doch irgendwas Sinniges da drin machen jetzt? Ich überleg gerade. Traffic"}, {"id": 982, "start": 8413.48, "end": 8420.2, "text": "als Ingress, nee. Traffic als Ingress ist jetzt eklig zu einzurichten, weil bei mir"}, {"id": 983, "start": 8420.2, "end": 8424.44, "text": "lokal auf der Kiste, da muss ich einfach bei Minikube das Nginx Addon anmachen und gut"}, {"id": 984, "start": 8424.44, "end": 8433.6, "text": "ist. Hast du Geburtstag in 3 Stunden? Pogu. Nee, das machen wir heute nicht, das ist zu"}, {"id": 985, "start": 8433.6, "end": 8460.76, "text": "umfangreiches Thema. Nö, da fällt mir jetzt gerade nichts mehr, ehrlich gesagt großartig"}, {"id": 986, "start": 8460.76, "end": 8476.08, "text": "ein, was wir da heute machen könnten. Du kannst links zu Stackoverflow posten, jaja. Kube"}, {"id": 987, "start": 8476.08, "end": 8506.0, "text": "Doom. Die Leute haben ja schon wieder Ideen, ey. Kackel. Das ist einfach eine gute Idee,"}, {"id": 988, "start": 8506.0, "end": 8523.88, "text": "oder? Kubernetes Doom. Security Scan. Ich schreibe mir das mal alles, ich schreibe mir"}, {"id": 989, "start": 8523.88, "end": 8553.24, "text": "das mal auf als To Do's, ja. Das ist ja geil. Das zusammen Windows Update machen, dann fährt"}, {"id": 990, "start": 8553.24, "end": 8564.88, "text": "mein Rechner ja runter und ihr seid weg. Leute, wisst ihr, dass ich bald 39 werde? Ich hab"}, {"id": 991, "start": 8564.88, "end": 8572.6, "text": "da auch kein Bock drauf. Dann ist nur noch ein Jahr bis 40. Mit 40 ist das Leben zur"}, {"id": 992, "start": 8572.6, "end": 8585.28, "text": "Hälfte vorbei, sozusagen. Chainlord, ich weiß nicht, wie alt du bist, aber wenn du"}, {"id": 993, "start": 8585.28, "end": 8592.12, "text": "unter 20 bist, könnte ich easy dein Vater sein, ja? Ist richtig. Ja, könnte ich, theoretisch."}, {"id": 994, "start": 8592.12, "end": 8608.56, "text": "Ich bin es meines Wissens nach nicht, aber ich könnte, rein vom Alter her. Ja, wer weiß."}, {"id": 995, "start": 8608.56, "end": 8624.32, "text": "Wenn du dir dein Alter aussuchen könntest, welches würdest du gerne wieder sein? Okay,"}, {"id": 996, "start": 8624.32, "end": 8634.28, "text": "es geht ja um das Alter und nicht um die Zeit. Ja, das muss man ja immer trennen. Wenn es"}, {"id": 997, "start": 8634.28, "end": 8647.6, "text": "um die Zeit ging, was richtig cool war, dann hätte ich eindeutig gesagt. Bonkers. Alter."}, {"id": 998, "start": 8647.6, "end": 8665.52, "text": "Also, wenn es um die Zeit geht, da gibt es mehrere, aber ich glaube, ohne Mist, wenn"}, {"id": 999, "start": 8665.52, "end": 8675.36, "text": "ich nochmal Zeit, dann würde ich tatsächlich was nehmen, wo ich Ferien hatte und noch in"}, {"id": 1000, "start": 8675.36, "end": 8682.88, "text": "die Schule gegangen bin. Ja, wo Oma und Opa noch am Leben waren, wo ich Half-Life gespielt"}, {"id": 1001, "start": 8682.88, "end": 8688.0, "text": "habe den ganzen Tag auf meinem 17 Zoll Röhrenbildschirm, dann angefangen habe, schon ein bisschen"}, {"id": 1002, "start": 8688.0, "end": 8703.8, "text": "MMOs zu grinden. So, sagen wir mal, sagen wir mal so die, so 1996 bis 2000, so die Zeit,"}, {"id": 1003, "start": 8703.8, "end": 8715.96, "text": "das fände ich geil. So, aber wenn es um das Alter geht, also quasi so mit jetzigem Wissen"}, {"id": 1004, "start": 8715.96, "end": 8723.6, "text": "und jetziger Zeit und so, wie alt ich heute sein möchte, ganz ehrlich, dann wahrscheinlich"}, {"id": 1005, "start": 8723.6, "end": 8736.92, "text": "nur ein paar Jahre jünger, nicht wirklich viel. Vielleicht 25 oder so. Oder 30, 30"}, {"id": 1006, "start": 8736.92, "end": 8747.48, "text": "wahrscheinlich. 30 ist eigentlich ganz gut. 30, paarunddreißig. Ehrlich keine Schmerzen."}, {"id": 1007, "start": 8747.48, "end": 8754.48, "text": "25 bis 35 so dazwischen irgendwie. Es ist jetzt auch nicht wirklich so schlimm gerade."}, {"id": 1008, "start": 8754.48, "end": 8761.0, "text": "Ich kann mich jetzt nicht beschweren. Wie gesagt, ich war lange nicht mehr so fit und so gesund,"}, {"id": 1009, "start": 8761.0, "end": 8765.08, "text": "so auch was Rückenschmerzen und Kopfweh und so angeht wie jetzt. Und das liegt einzig"}, {"id": 1010, "start": 8765.08, "end": 8779.92, "text": "und allein an mehr Bewegung. So ist es. Also ich war lange nicht mehr, wie gesagt, so fit"}, {"id": 1011, "start": 8779.92, "end": 8790.36, "text": "und ja, also insgesamt eigentlich alles ganz gut wie jetzt. Ja, deswegen habe ich ja gesagt,"}, {"id": 1012, "start": 8790.36, "end": 8795.56, "text": "wenn Ferien sind, Schulzeit selbst, da hätte ich auch keinen Bock mehr drauf. Schule war"}, {"id": 1013, "start": 8795.56, "end": 8820.76, "text": "richtig kacke. Da hätte ich auch keinen Bock drauf jetzt. Schule ist ultra suck."}, {"id": 1014, "start": 8820.76, "end": 8850.72, "text": "Ähm. Kommt das hin mit 24? Joah. Leg gerade. Also"}, {"id": 1015, "start": 8850.72, "end": 8862.8, "text": "Ausbildung 2007. Ja, ja, so irgendwie in dem Dreh, ne? Ja, nochmal. 2007 minus 1984, 23,"}, {"id": 1016, "start": 8862.8, "end": 8868.48, "text": "ja, also mit 23, 24 ist richtig. Joah. Äh, was ich vorher gemacht habe. Ich habe vorher"}, {"id": 1017, "start": 8868.48, "end": 8879.88, "text": "beispielsweise BWL-Shit gemacht. Ja. Nicht wirklich studiert BWL-Shit oder so. Eher ausbildungstechnisch"}, {"id": 1018, "start": 8879.88, "end": 8883.72, "text": "was gemacht, aber da habe ich überhaupt keinen Bock drauf gehabt. Das habe ich auch nur"}, {"id": 1019, "start": 8883.72, "end": 8891.52, "text": "gemacht, weil mich meine Mutter so genervt hat, genervt hat, dass ich das jetzt unbedingt"}, {"id": 1020, "start": 8891.52, "end": 8902.88, "text": "was machen muss. Ja, was mit Holz. Was hast du für eine Ausbildung? Wie gesagt, ich habe"}, {"id": 1021, "start": 8902.88, "end": 8913.48, "text": "mal Bürokauf angefangen zu lernen. Vor langer Zeit habe ich nicht fertig gemacht und das"}, {"id": 1022, "start": 8913.48, "end": 8920.2, "text": "war die Zeit, da habe ich eigentlich mich morgens an Rechner gesetzt, eingeloggt, MMO-Kreiselgrind"}, {"id": 1023, "start": 8920.2, "end": 8926.72, "text": "gemacht bis abends und dann bin ich dann bin ich pennen gegangen und dann bin ich aufgestanden"}, {"id": 1024, "start": 8926.72, "end": 8935.16, "text": "und habe wieder MMO-Kreiselgrind gemacht den ganzen Tag. Und dann ging mir halt meine Mutter"}, {"id": 1025, "start": 8935.16, "end": 8946.08, "text": "so sehr auf den Keks, dass ich dann mich habe halt dazu überreden lassen Bürokaufmann"}, {"id": 1026, "start": 8946.08, "end": 8951.64, "text": "zu machen. Weil man ja irgendwie eine Ausbildung angeblich machen muss so. Und egal was, wie"}, {"id": 1027, "start": 8951.64, "end": 8957.8, "text": "scheiße es ist, mach halt mal. Und ich meine nicht, dass ich da irgendwie jetzt großartig"}, {"id": 1028, "start": 8957.8, "end": 8968.64, "text": "was gerissen hätte. Janfried, danke schön für den Sub. Nicht, dass ich da groß was"}, {"id": 1029, "start": 8968.64, "end": 8977.2, "text": "gerissen hätte. Ich hatte auch keinen Bock. Also wie gesagt, ich habe da den ganzen Tag"}, {"id": 1030, "start": 8977.2, "end": 8985.68, "text": "habe ich MMO-Kreiselgrind gemacht, mich für nichts anderes interessiert. Ja, löten"}, {"id": 1031, "start": 8985.68, "end": 8994.0, "text": "deswegen mal was sinnvolles was man lernt, wenn man sowas lernt in der Schule. Also wie"}, {"id": 1032, "start": 8994.0, "end": 8998.96, "text": "gesagt, das einzige was ich mir gemerkt habe aus meiner kaufmännischen Ausbildungszeit"}, {"id": 1033, "start": 8998.96, "end": 9006.72, "text": "da ist, wie man eine Buchhalternase macht und dass man linear und dekresiv abschreiben"}, {"id": 1034, "start": 9006.72, "end": 9020.4, "text": "kann. Wobei ich gehört habe, dass es mittlerweile gar nicht mehr so ist. Kannst du noch etwas"}, {"id": 1035, "start": 9020.4, "end": 9027.16, "text": "sagen, was du nach der Physi-Ausbildung verdient hast? Ja, kann ich sagen 33.500 im Jahr beim"}, {"id": 1036, "start": 9027.16, "end": 9044.28, "text": "Provider. Direkt nach der Ausbildung. Ja, mit Bonus sogar ein bisschen mehr. Also sagen"}, {"id": 1037, "start": 9044.28, "end": 9050.84, "text": "wir mal, ich habe meinen Gehalt in den letzten 15 Jahren quasi ziemlich genau verdreifacht,"}, {"id": 1038, "start": 9050.84, "end": 9065.96, "text": "kann man glaube ich sagen. Ne, sogar mehr. Bisschen mehr sogar. Fast verdreifacht. Ich"}, {"id": 1039, "start": 9065.96, "end": 9070.76, "text": "bin mir relativ sicher, in den nächsten 15 Jahren wird das nicht mal so viel sein. Ich"}, {"id": 1040, "start": 9070.76, "end": 9086.4, "text": "glaube nicht, dass ich nochmal mal 3 verdienen werde. 2035. Die hat Epic? Was soll denn"}, {"id": 1041, "start": 9086.4, "end": 9104.48, "text": "Epic sein? Erzählende Literatur, ok. Inflationsbereinigt, keine Ahnung, musst du selbst ausrechnen."}, {"id": 1042, "start": 9104.48, "end": 9127.96, "text": "Gibt es dazu einen Rechner? Wie viel das heute wird? 33.500, 2010 oder so. Die Seite"}, {"id": 1043, "start": 9127.96, "end": 9131.8, "text": "mache ich nicht auf. Die sieht sass aus. Ah, im Moment das Spiegel ist aus. Ok, es sieht"}, {"id": 1044, "start": 9131.8, "end": 9141.96, "text": "trotzdem sass aus. Ok, zeig mal her. Protogohalt, Datum, so frisst es jedenfalls. Was soll ich"}, {"id": 1045, "start": 9141.96, "end": 9169.48, "text": "da jetzt eintippen? Muss ich jetzt da zurückgehen auf 2010 oder"}, {"id": 1046, "start": 9169.48, "end": 9176.16, "text": "das muss ich da jetzt einstellen. 2010 habe ich, keine Ahnung, 33.500 durch 12. Wie viel"}, {"id": 1047, "start": 9176.16, "end": 9186.24, "text": "ist denn das? Ok. Um sich genauso viel leisten zu können wie November, müssen sie heute"}, {"id": 1048, "start": 9186.24, "end": 9195.36, "text": "3600 verdienen. Ok. Ok, ich glaube ich kann auch einfach das Jahresgal reinschreiben."}, {"id": 1049, "start": 9195.36, "end": 9207.12, "text": "Ok, also heute müsste man dann schon 43.000 verdienen. Das ist schon krass wenn man sich"}, {"id": 1050, "start": 9207.12, "end": 9214.6, "text": "das hier anguckt, oder? Davor eigentlich nur halbwegs milde und jetzt wirklich bergab."}, {"id": 1051, "start": 9214.6, "end": 9232.64, "text": "Da kann das durchaus sein, wenn das so weiter geht. Also wenn das irgendwie 10% im Jahr"}, {"id": 1052, "start": 9232.64, "end": 9239.76, "text": "sind, da kann das durchaus sein, dass ich in 15 Jahren oder in 10 Jahren tatsächlich"}, {"id": 1053, "start": 9239.76, "end": 9254.4, "text": "dieses doppelte habe oder so, weil die müssen ja irgendwie da mitziehen. Wer weiß. Ja, das"}, {"id": 1054, "start": 9254.4, "end": 9263.48, "text": "ist doch eigentlich ziemlich gut, oder? Es kommt recht genau hin. Mit meinem Einstiegsgehalt"}, {"id": 1055, "start": 9263.48, "end": 9286.24, "text": "damals und jetzt bei ihm. Naja. So, ich war mal kurz bei dem Kubernetes-Klasse aus. Ausgecubed"}, {"id": 1056, "start": 9286.24, "end": 9304.08, "text": "für heute. Das Chat-GPT uns alle arbeitslos macht. Ja, wenn es nach YouTube geht ist das"}, {"id": 1057, "start": 9304.08, "end": 9312.8, "text": "ja so. Wenn die Leute damit leben können, dass in allen Arbeiten irgendwelche versteckten"}, {"id": 1058, "start": 9312.8, "end": 9316.48, "text": "Fehler drin sind, von denen du nichts weißt, ja dann kannst du Chat-GPT alles machen lassen."}, {"id": 1059, "start": 9342.8, "end": 9357.96, "text": "Welchen IT-Job kann man machen, wo man nicht 24-7 programmiert? Alle außer Software-Entwickler"}, {"id": 1060, "start": 9357.96, "end": 9368.44, "text": "und selbst als Software-Entwickler programmierst du nicht 24 Stunden? Wann war der letzte"}, {"id": 1061, "start": 9368.44, "end": 9386.8, "text": "AVM-Aufsett-Stream? Gar nicht so lange her. Ich glaube im Dezember. Ich bin echt richtig"}, {"id": 1062, "start": 9386.8, "end": 9392.88, "text": "gelangweilt von diesen ganzen Chat-GPT-Videos oder generell von diesem Ultra-AI-Gehype."}, {"id": 1063, "start": 9392.88, "end": 9400.88, "text": "Ich habe es nach einer Woche schon gelangweilt. Weil die Videos auch immer die gleichen sind."}, {"id": 1064, "start": 9400.88, "end": 9406.52, "text": "Oh, ich lasse Chat-GPT eine Webseite machen. Oh, Chat-GPT schreibt meine Bewerbung. Blablabla."}, {"id": 1065, "start": 9406.52, "end": 9417.2, "text": "Die Diskussion ist sehr ermüdend alles. Es ist ja auch langsam mal wieder gut. War doch"}, {"id": 1066, "start": 9417.2, "end": 9423.44, "text": "Januar, Februar kann auch sein. Kann auch sein, dass es Januar, Februar gewesen ist."}, {"id": 1067, "start": 9423.44, "end": 9447.56, "text": "Na ja, Leute, ich glaube, ich gehe jetzt off."}, {"id": 1068, "start": 9447.56, "end": 9458.84, "text": "Ja, ich habe da auch ein paar Ausschnitte gesehen. Was sie da erzählt haben auf Genie-Level"}, {"id": 1069, "start": 9458.84, "end": 9463.24, "text": "und sowas. Ich muss Chat-GPT einfach nur mal nach einer genauen Funktionsweise vom Kommando-Zahlen-Tool"}, {"id": 1070, "start": 9463.24, "end": 9471.6, "text": "fragen. Da denkt sich schon irgendwelchen Blödsinn aus. Chat-GPT kann eins richtig"}, {"id": 1071, "start": 9471.6, "end": 9488.92, "text": "gut. Dich mit einer riesen Masse an Text erschlagen."}, {"id": 1072, "start": 9488.92, "end": 9502.8, "text": "Ja, Leute, wir haben jetzt genug gewürfelt für heute. Kubernetes. Das schon, das hat"}, {"id": 1073, "start": 9502.8, "end": 9517.44, "text": "ja mit Chat-GPT erstmal nur am Rande zu tun. Bis denn, macht's gut, CU."}]}