{"text": "Ich habe heute endlich mal alles von dem iPhone, was ich von der Firma hatte umgestellt aufmein neues iPhone, weil das andere muss ich abgeben übermorgen.Es nähert sich ja dem Ende alles. Mir ist wieder mal aufgefallen, wie abartig es ist,Daten vom iPhone runterzubekommen. Also was ja in der Regel recht gut geht,ist wenn man das gleich beim Setup macht, die einen Sachen vom alten aufs neue iPhone zu kopieren.Aber es funktioniert ja ganz gut. Aber irgendwie die Sachen runterzubekommen,das ist wirklich immer ein bisschen abartig. Da kann ich euch was Nices zu zeigen,falls ihr das nicht kennt. Ich mache schon mal die VM an, weil die brauchen wir heute eh.Aber eh gleich, da kann ich schon mal Updates und sowas machen, weil Arch by the way immerUpdates hat. Schon das neue Fireship Video gesehen? Nee. Aber lasst mich raten, wahrscheinlich wiederAI oder? Es wird langsam langweilig. Ich habe langsam keinen Bock mehr das zu gucken.Wenn ich das, wenn ich das, kann er noch was anderes als AI Videos machen. So langsam istirgendwann auch mal wieder gut. I literally connected my brain to GPD with JavaScript.Javascript, keck, JS. So ich muss noch ein bisschen warten, bis Twitch kapiert hat,dass ich online bin. Der Stream ist noch nicht richtig angelaufen. Ich bin mir nicht sicher,ob der Bot im Discord schon was gecheckt hat. Was ist C-Sharpen? Was ist .NET?Also ich könnte jetzt sagen, das ist wahrscheinlich besser, wenn du das 10Sekunden googelst und eine viel bessere Erklärung hast. Aber ich sage es dir trotzdem,C-Sharpen ist eine Programmiersprache und .NET ist die Laufzeit. Das stimmt ja sodirekt gar nicht mehr. .NET ist das Framework drum herum. Lernen wir es mal so und C-Sharpenist eine Programmiersprache. Aber wenn du es genauer wissen willst, ich meine, wir bastelnheute ein bisschen was in C-Sharpen, aber ich glaube nicht, dass das, wenn man die Sprachenoch nicht gesehen hat, sondern nicht erhellend sein wird. Aber gut, jetzt weißt du Bescheid.Im Prinzip ist .NET und C-Sharpen, falls du Java kennst, Java ist die Programmiersprache undJVM ist die Runtime. So ist das bei .NET auch. .NET ist die Runtime und C-Sharpen ist dieProgrammiersprache. Dementsprechend gibt es auf .NET Basis auch noch mehr Programmiersprachen.Also du kannst beispielsweise F-Sharpen machen. Da stehen ja manche Leute drauf,die finden das furchtbar geil. So funktionale Dinger. Dann gibt es, was gibt es noch fürbedeutende .NET basierte Sprachen? Das kommt mir nicht mit vb.net,das interessiert doch kein Mensch mehr. Was gibt es denn da großartig noch?Was gibt es für große Sprachen auf der .NET Runtime? Eigentlich nicht so viel,oder? Es gab mal den Versuch, Python und Ruby drauflaufen zu lassen, das war aber eher cringe.ASP.NET ist keine eigene Sprache, ASP.NET ist das Web-Framework für .NET bzw. was manhauptsächlich in C-Sharp programmiert. Was man theoretisch mit F-Sharp aber auchprogrammieren könnte, ist eigentlich eher so eine Library für Web-Anwendungen. Also ich glaube,auf .NET Basis ist das größte wirklich C-Sharp und F-Sharp. Die anderen Dinger,die es da vielleicht für die Runtime gibt, sind glaube ich eher nicht so bedeutend.Bei Java gibt es mehr. Auf JVM Basis gibt es mehr. Da gibt es Kotlin, da gibt es Java,da gibt es Erlang auf JVM Basis. Da gibt es Groovy, da gibt es jede Menge Sachen.Mein Chef will, dass ich VB anstehe. Jetzt ernsthaft, was ist denn mit dem los?Also entweder ist der Ultra-Boomer und kennt nur irgendwie Rishal Basic früher aus Excel oderoder er ist komplett planlos. Ich glaube, Microsoft supportet VB gar nicht mehr richtig.Bin mir gar nicht sicher, ob es dazu irgendwie in den letzten Jahren nochnennenswert Updates gekriegt hat. Ich glaube gar nicht. VB.NET still supportet. Gucken wirdoch mal danach. Rishal Basis, exact support for Windows. Ja, das meine ich. VB.NET istdone, not dead. Microsoft hat gesagt, es gibt keine neuen Features mehr, aber es ist nicht dead.Logisch, Microsoft Logik. Wir lassen es links liegen und supporten es nicht mehr bzw. sagensie ja nicht. Wir lassen es links liegen und updaten es nicht mehr, aber es ist nicht dead.Ja, natürlich Microsoft. Five-Hat-Time, ganz klar. Also VB, es wird Zeit, Leute. Es wird Zeit fürRust.NET, was keinen Sinn ergibt, ehrlich gesagt. Rust.NET würde absolut keinen Sinn ergeben,weil Rust hauptsächlich dafür erstellt wurde, nicht irgendwie, um eine besonders schöne Sündags zuhaben oder sowas, sondern um unmanaged halbwegs safe hinzubekommen. Und das würde ja keinen Sinnmachen. Rust in der managed Umgebung, also das widerspricht sich komplett. Echt, gibt es,ok, das gucken wir jetzt. Gibt es da neue Features? Gibt es da wirklich neue Features? Nee,nee, nee, gibt es nicht. Zumindest sagt das Wikipedia und Wikipedia im Prinzip meistensrecht. Gucken wir mal. Preview 7, nein, nein, Preview 1. Gibt es nicht sogar Preview 2 mittlerweileseit einer Woche oder so? Also hier taucht WhistleBasic nicht drin auf und hier tauchtWhistleBasic auch nicht drin auf. Also ich würde mal sagen, nee, gibt es nicht. So,was haben wir hier? Ah, da will geupdated werden. PNPM wird geupdated. Ja, da kann ich nicht neinsagen, wenn PNPM geupdated wird. Cac Javascript. Außerdem muss ich eh warten, bis der Stream richtigangelaufen ist. Ich weiß, es ist Montagnachmittag, fast schon Abend, da sitzen die meisten Leute jetztbeim Essen oder fahren gerade heim oder sowas. Es sind jetzt eh noch nicht so viele da. Abermuss man Twitch ein bisschen Zeit geben. Du musst gerade VB lernen, weil ich Exist-Datenbank,also ich weiß ja gar nicht, was ich da schlimmer finde. Ich weiß ja gar nicht,was ich da schlimmer finden soll. Dass du was mit Exist-Datenbanken machen musst. Was ist,Leute, ich habe eine wirklich ernst gemeinte Frage. Wann macht es Sinn Exist-Datenbanken zubenutzen? Also ich habe noch nie verstanden, warum jemand eine Exist-Datenbank, ich meine,den Kram gibt es seit irgendwie 30 Jahren und es wird benutzt. Also es muss ja schon irgendwieein validen Grund, warum man sich für Exist-Datenbanken entscheidet. Aber wann? Wann ist das? Ja,genau, zumal man könnte auch einfach SQLite benutzen, dann hat man wenigstens was Gescheites,was man auch so verwenden kann. Vielleicht, weil das eine UI dabei hat, könnte das sein,dass das vielleicht daran liegt, dass das eine UI dabei hat und die Leute deswegen früher immerzum Einstieg dann nice fanden oder... Also wann verwendet man Exist-Datenbanken? Ich weiß wirklichnicht. Ja, keine Ahnung. Also wenn die User selbst was bauen wollen... Ja, aber die könnendas ja in Excel machen. Also was bietet Exist mehr als Excel für so eine 0815 User?Ja, aber wann? Also wann ist es eine gute Idee? Ich verstehe das bis heute nicht. Also ichverstehe bis heute die Daseinsberechtigung von Exist nicht. Ich verstehe übrigens auch vieleOffice-Programme die Daseinsberechtigung nicht. Also Excel kann ich noch am ehesten nachvollziehen.Excel ist keine Datenbank. Ja gut, aber was macht denn der 0815 Anwender,der angeblich die IT umgehen möchte und deswegen Exist verwendet, in Exist dann mehr als in Excel?Also ich sehe den Anwendungszweck immer noch nicht. Eingabe, Masken, UI, ja das machen dieLeute aber auch schon in Excel. Ich weiß nicht, keine Ahnung, ich verstehe den Anwendungszweckvon Exist nicht. Zumal es so etwas wie SQLite gibt, was einfach wunderbar funktioniert und ichüberhaupt nicht wüsste wozu man. Kann man überhaupt ordentlich SQL machen mit Exist? Geht das? Ichmuss gestehen, ich habe noch nie in meinem Leben Exist verwendet. Keine Ahnung, es kann sein,dass ich in der Schule mal irgendwie was kleines für Exist gebaut habe, weil der Lehrer das wollte,aber also ja vielleicht, aber ansonsten habe ich nie Exist verwendet. Ich habe das auch nicht vor,ich wüsste auch gar nicht warum. Na gut, wenn man das benutzen muss, muss ich ja irgendjemandüberlegt haben, warum. Also ich verstehe es immer noch nicht, keine Ahnung warum man Exist braucht.Selfmade Eyes, Dankeschön für den Sub. Ahja. Ich habe eine kurze Frage, wie oft kann man deinerMeinung nach eine Gehaltserlöhung verlangen? Wie viel Prozent? Naja, immer. So öfters, also ichmeine es ist nicht im Minutentakt oder so, aber du kannst dich schon öfters mal daran erinnern,dass man wieder Zeit wird, gerade in aktuellen Zeiten, wo es ja quasi wöchentlich teurer wird.Also die werden dir natürlich erzählen, ah aktuell ist ein ganz schlechter Zeitpunkt,weil Corona und wirtschaftliche Lage und Inflation, gerade deswegen braucht man ja eine,ja und und Geschäfte wegen Lockdown, die jetzt immer noch schlecht laufen und dann,ah ganz furchtbar schlimm. Also es ist immer schlecht, also das war zumindest so die StandardAntwort, die ich immer bekommen habe. Standardmäßig, wenn sie keinen Bock hatten,sich damit auseinanderzusetzen, deswegen muss man auch hartnäckig sein, war immer so eine 0815Ausrede, das ist gerade ganz furchtbar schlecht, ist aber egal. Fragen kannst du laufen, also ichmeine wie ich es da nicht im 5-Minuten-Takt oder so. Aber wenn du da, also mindestens einmal im Jahr,ja mindestens, mindestens einmal im Jahr, es spricht eigentlich aus meiner Sicht garnichts dagegen, das sogar öfters mal anzusprechen. Du musst ja nicht immer so super offiziellChef lassen, Einladung machen, wir müssen übers Gehalt reden oder so, kannst ja schon öfters malsagen. Wir hatten mal wieder Zeit, vor allem bei so tollen Sachen, die die Simon, nee,Simonu, vor allem so tolle Sachen, die man macht. Und wenn mal wieder was besonders toll gelaufen ist,kann man durchaus auch sagen, ja wird mal Zeit wieder für, also es schadet nichts die permanentdarauf vorzubereiten, dass es mal wieder an der Zeit ist. Wie viel Prozent ist schwer zu sagen,das hängt so ein bisschen vom Umfeld ab. Ich meine natürlich am besten ist es, du sagst,du bekommst am Ende das womit du zufrieden bist. Taktisch gesehen ist natürlich immer sinnvoll,man fragt nach deutlich mehr als mit was man zufrieden ist, aber das kannst du ja schlecht imWochentakt machen. Aber insgesamt, je nachdem wann du was zuletzt bekommen hast, ist natürlichrelevant, also wenn du jetzt vor einem halben Jahr was gekriegt hast und willst jetzt 30% mehr,dann würde ich vielleicht sagen, also wenn du jetzt nicht gerade irgendwie eine neue Positionhast, wo du es dann eh neu verhandelt, vielleicht ein bisschen sportlich, am Ende ist wichtig,dass du damit halbwegs zufrieden bist. Und gerade in aktuellen Zeiten, wenn es jetzt im letztenJahr nichts gegeben hat, würde ich da jetzt auch nicht anfangen mit irgendwie 3-4% oder so einBlödsinn, dann kannst du gleich ordentlich sagen. Ich meine, die wissen auch, dass es 10% teurerwird pro Jahr. Und wenn es letztes Jahr nichts gegeben hat, sind es schon mal mindestens 10%,die du mehr haben willst. Eher mehr, weil am Ende sollen es ja 10% mindestens sein. Alsowillst du wahrscheinlich mindestens 20-25% mehr, was schwachsinnig ist, aber das werden die dir,also 25% werden die dir nicht geben, aber sie können ja einfach nein sagen und dann landet10%. Also es ist nicht schlimm. Was soll dir passieren? Wenn du was Unverschämtes sagst,lacht man mal drüber und dann kommt man irgendwie auf was Realistisches. Ich meine,was soll passieren, wenn du was höre, wenn du was zu hohes sagst? Die sagen ja nicht,oder Simon, der macht gute Arbeit, der will mehr Geld haben, jetzt bin ich aber sauer,der hat nach zu viel mehr Geld gefragt, jetzt schmeiße ich den raus. Also das ergibt ja keinenSinn. Die werden doch wahrscheinlich sagen, nee, gibt's nicht, aber ein bisschen mehr sagen,ist auf jeden Fall nicht verkehrt. Sag einfach mal das Doppelte von dem, womit du zufrieden bist.Naja, das kann auch funktionieren, wobei das natürlich ein gewisses Risiko ist.Das kann auch, du kannst natürlich auch sagen, Jungs, also wenn du eh keinen Bock mehr auf denLaden hast, kannst du natürlich auch sagen, Jungs, also wenn es jetzt nicht mehr Geld gibt, bin ichweg. Entweder machen sie es oder nicht, aber dann musst du halt im Zweifelsfall auch sagen undTschüss. Weil das finde ich immer ein bisschen blöd, wenn man das so als Druckmittel verwendet,so nach dem Motto, aha, dann bin ich weg und dann bin ich gar nicht mehr. Also wenn schon,am besten in Kombination, man hat sich schon mal umgeguckt und sagt dann, Jungs, ich hau ab undwenn sie dann ankommen mit, willst du nicht 30 Prozent mehr verdienen oder irgendwas,was halt lukrativ ist, weil die Sachen, die dich nerven, sind ja immer noch da. Ja gut,kann es immer noch da bleiben. Aber es schadet durchaus nicht, sich umzugucken. Das ist immersinnvoll zu wissen, was angesagt ist. Also gerade so mal ein bisschen links und rechts geguckt,ein bisschen links und rechts geguckt, also sprich, was bieten Unternehmen bei dir in der Umgebung an?Ja, also sprich, was bieten die Konkurrenz bei dir an, ist ja sicherlich nicht verkehrt.Wahrscheinlich sogar besser. Ja, das ist schwer zu sagen. Also ich würde mir ja nicht anmaßen,das einschätzen zu können, aber man muss ja auch sagen, erstens in der IT, allein wenn die Leuteup to date bleiben, auch wenn sie nicht mehr Aufgaben übernehmen, aber wenn sie einfach nurup to date bleiben, haben sie ja quasi schon einen Mehrwert für die Firma, den man ja durchaus auchentlohnen kann. Und die Firma kann ja nach wie vor die Arbeit zu Geld machen und wahrscheinlichmittlerweile dank Inflation zumindest in reinen Zahlen auch zu mehr Geld. Also allein schon deswegen,selbst wenn du die gleiche Arbeit machst, eure Sachen einfach am Laufen hältst, die gleichenSachen wie vor 3-4 Jahren und die nächsten 3-4 Jahre das gleiche, sogar das, die Firma wird mehrGeld dafür verlangen, für ihre Dienstleistung, für ihren Service und allein schon deswegen bringstdu der Firma mehr Geld. Also allein schon deswegen kannst du mehr Geld fordern. Wir suchen dich,bewirb dich. Warum soll ich mich da, ne Moment, nicht, deine Aufgaben, C++, ach so, 3D Software,das ist ja gar nicht meins. Reddit und Steam sind dein Zuhause. Raspberry Pi ist nicht nur einDessert für dich, das ist dir vertraut wie Counter-Strike. Bios Bernd, cringe Anzeige,Alter. Bios Bernd, ja, so will ich auch immer genannt werden. Wer von euch möchte nicht auchgerne der Bios Bernd sein? Kann man nicht C++ auch ins .NET kompilen? Ja, ne, ne, kann man nicht,also es gab mal oder gibt es noch, aber das ist ziemlich sinnlos. Es gibt so ein C++ Interop-Layervon Microsoft, da haben die die C++-Sündags erweitert. Ich bin mir gar nicht sicher,wie der Kram hieß. C++ CLI heißt das Ding, hat nichts mit Command-Line-Interface zu tun.Das gab es mal und gibt es immer noch von Microsoft. Das war mal der Versuch bzw. dasEntgegenkommen von Microsoft zur damaligen Zeit, wo halt vieles, gerade an Windows-Software,für C++ entwickelt war, die irgendwie besseren Interop in C++ mit Managed Languages machen zukönnen. Das hat sich nie großartig durchgesetzt. Das ist in .NET auch nicht mehr drin, soweit ichweiß, und ist eh Windows-Only. Also das kannst du eigentlich komplett vergessen und es interessiertMicrosoft selbst nicht mehr. Ich weiß, dass Frostbite ursprünglich, also die Battlefield-Engine und jaNeed for Speed und alles mögliche, dass Frostbite einiges in CLI C++ Interop gemacht hat. Diehatten wohl früher halt ihr altes Zeug in C und ihr neues Zeug, der Editor und alles, das warwohl in C-Sharp und um das zu verbinden, haben sie wohl irgendwelchen C++ CLI Interop-Shit gemacht.Vielleicht eines der Gründe und vielleicht auch eines der abschreckenden Beispiele,warum man es nicht verwenden sollte. Vielleicht ist das eines der Gründe, warum heute keine Saumadurchblickt, wie Frostbite eigentlich funktioniert. Was hältst du von Gehaltsportalen im Internet,die Geldrasche immer? Ich glaube, ich hab mir noch nie, mir fällt gar kein Gehaltsportal ein.Also wir haben mal lustigerweise so einen Test, ein paar Steps down gemacht vor ein paar Jahrenund das war komplett pepega, was da rausgekommen ist. Also das einfachste, was du wahrscheinlichmachen kannst, ist mal bei deinen Kollegen fragen, was die denn so verdienen. Also du musst dich jetztnicht neben den Typen setzen und sag mal, Alter, wie viel Kohle kommt im Monat rüber, aber wenndu dich da mit Leuten ganz gut verstehst, kannst du die ja durchaus mal fragen, sag mal, wie sinddas bei dir eigentlich? Weil im Endeffekt, also es ist nicht verboten, drüber zu reden, das muss manauch sagen. Es wird immer so getan, so nach dem Motto, oh, das wird nicht gerne gesehen und sonstwas. Das ist vollkommen egal, das ist erlaubt. Es gibt ganz, ganz seltene Sachen, wo das ausbegründeten, also normalerweise darf das auch gar nicht im Vertrag drinstehen, dass du nichtdrüber reden darfst, aber es gibt Wohlstellen, da ist das begründet drin und aber das ist bei 99,9nicht der Fall. Also du kannst einfach mal deine Kollegen fragen, wie es da aussieht.Ja, sehe ich genauso. Bist du schon auf der neuen Arbeit? Nee, noch nicht. Nächste Woche. NächsteWoche um die Zeit. Ja, nächste Woche um die Zeit war schon ein Tag da. Zwei Tage, zwei Tage. Montag,Montag und Dienstag. Ja. Also ich würde ganz ehrlich, frag mal doch die anderen Leute bei dir,die ähnliche Aufgaben haben, was bei denen so ist. Im Endeffekt, unterm Strich bringt es euchwahrscheinlich beiden was, wenn ihr euch da mal kurz schließt. Ja, also wenn du, wenn er das weiß vondir und du das weißt von ihm, vielleicht kann er was besseres rausholen, vielleicht kannst dunoch was besseres rausholen. Im Zweifelsfall ist es auch gut, wenn sich die Leute zumindest einigsind, dass die wissen, hey, wenn wir jetzt nicht auf die Leute aufpassen, wenn uns zwei abhauen,im Zweifelsfall dann ist ganz beschissen. Also es schadet eigentlich nichts darüber zu reden. Ichfinde es auch überhaupt nicht verwerflich, auch wenn immer so getan wird, aber im Prinzip hilft,dass nur deinem Arbeitgeber weniger bezahlen zu müssen, wenn ihr nicht drüber redet.Ja, hyped, hyped. Ich freue mich drauf, ja. Ich freue mich drauf. Ich bin wirklich gespanntdrauf, wie es da ist. Beziehungsweise, ja gut, wie es da ist, das werde ich wahrscheinlich erstnach so zwei, drei Monaten so wirklich gut einschätzen können. Aber ich bin wirklichgespannt drauf und ich freue mich schon drauf. Ich freue mich vor allem auch drauf, dass malein bisschen was Neues ist und dass ich das alte Zeug jetzt dann abgehakt habe. Ich meine,ich habe das, ich habe alles schon fertig. Ich habe mein Handy umgezogen heute. Ich habe jetztmein eigenes hier am Start mit allem drauf. Handy umgezogen, ausgeschaltet, Notebook zusammengepackt,hingelegt. Also ich werde nächsten Mittwoch Notebook mitnehmen, Handy mitnehmen, dort abgeben,meine Eintrittskarte abgeben und das war's. Was das nächste Woche Mittwoch? Stimmt überhaupt nicht.Morgen? Nee, übermorgen. Hier, da. Mittwoch. Mittwoch fahre ich zum letzten Mal nach Frankfurtauf die Arbeit. Auf die alte, also auf die jetzige Arbeit. Was am besten machen als jemand,der eine Umschulung zum Physi gemacht hat und theoretisch von vielem ein bisschenwas weiß, aber wenig praktische Erfahrung in vielen Bereichen hat, bin gerade Softwareverteilungbetreut und mache zum Großteil 2nd Level Support für die grob 250, das ist gar nicht mal so wenig,ja. Verschiedene Softwareprodukte, die bei uns eingesetzt werden, beim Großteil-Tickets hierreinkommen, habe ich das Gefühl überhaupt keine Ahnung. Ja, gut, dass man keine Ahnung hat,was abgeht, ist eigentlich leider in der IT fast schon der normale Zustand. Man sollte sichnatürlich vielleicht mal, da kannst du nichts für, also ich glaube nicht, dass man sinnvollen2nd Level Support, 2nd Level heißt ja auch mal schon ein bisschen Ahnung von der ganzen Geschichte,dass man sinnvollen 2nd Level Support liefern kann für 300 verschiedene Softwareprodukte. Wiewillst du das machen? Es sei denn, es gibt 5 Base-Produkte und 300 Customizations davon,wo sich nicht viel ändert, aber man kann nicht wirklich sinnvollerweise Support leisten,wie soll das funktionieren? Dein Hirn ist ja auch limitiert.Also das liegt nicht an dir, die sollten sich vielleicht eher mal überlegen, ob sie nichtverschiedene Schwerpunkte machen, so nach dem Motto Anwendung zusammenfassen, dass dann Leutenur noch für 15, die in der gleichen Kategorie sind, zuständig sind. Aber gut, wie die dashandhaben, kann man nicht schwer sagen, aber dass du da keine Ahnung hast, wundert mich nicht.Was du machen kannst als Physi, der wenig praktische Erfahrungen hat, ganz ehrlich,wenn du die praktische Erfahrung auf der Arbeit nicht kriegst, oder halt nicht in den Bereichenkriegst, auf die du Bock hast, dann bleibt dir nichts anderes übrig und das ist eh das Beste,was man auch so machen kann, dich privat mit der ganzen Geschichte zu beschäftigen. Wenn du Bockauf Basteln und Programmieren hast, ist natürlich ein GitHub-Account auch immer ein gutes Aushängeschild,und wenn du dich irgendwo anders da bewirbst zu zeigen, guck mal hier, was habe ich schonalles Cooles gemacht, wobei das jetzt als Physi vielleicht jetzt nicht so das Ding ist, aber hey,auch als Physi ist ein ordentlicher GitHub-Account nicht verkehrt. Es ist ja heutzutage vieles,nicht nur Softwareentwicklung, was in Source-Code technisch Git-mäßig eingecheckt wird,sondern zum Beispiel auch Terraform-Config, Pulumi-Config, Ansible, Kubernetes-Manifests und sowas, also heute definiert man ja vieles seiner Infrastruktur schon über YAML-Files, Terraform-Manifestsund alles Mögliche, das ist auch was, was man durchaus aus seinem GitHub-Profil haben kann,auch wenn man eher in der Administration, ich finde es ist nicht verkehrt, da die ein oderandere Sachen zu haben. Ja, und ansonsten bleibt dir wahrscheinlich nichts anderes übrig,wenn dir das in dem Bereich keine praktischen Erfahrungen bekommst oder zumindest nicht indem Bereich, was dir gefällt, da bleibt dir gar nichts übrig, wie selbst ein bisschen zu basteln.Das hat den Vorteil, selbst rum zu basteln, du kannst dir aussuchen, worauf du Bock hast,und das dann halt machen. Wenn du sagst, hey, ich habe Bock mich beispielsweise mit, weil ich esgerade erzählt habe, ja und ich selbst zurzeit viel damit am rumbasteln bin, wenn du sagst,ich habe Bock mir mal ein bisschen Kubernetes anzugucken, dann mach das. Da guck dir das an,es ist scheißegal, ob die Arbeit das braucht oder nicht, die Skills sind so gefragt aktuell,es ist auf jeden Fall gut das zu können und sei es nicht bei deinem aktuellen Arbeitgeber,sondern bei einem anderen. Und ein bisschen Kubernetes anschauen ist gut, da fängst du an mit,am ersten Tag denkst du dir, ich blicke eigentlich ganz gut durch, am zweiten Tag denkst du dir,ich bin das nächste halbe Jahr am nichts anderen machen mehr, bis ich halbwegs durchblicke.War StepStone zu hoch oder zu niedrig? Jetzt wo du mich fragst, ich glaube es war gar nicht soschlecht. Wir haben ja mal so eine Gehaltsprognose gemacht bei StepStone und ich glaube die habendamals ausgespuckt 85.000 Euro im Jahr, ich bin mir da gar nicht mehr sicher, was ja eigentlich,muss man ehrlich sagen, ganz gut hinkommt. Jetzt mittlerweile nicht mehr, mittlerweile ist ja nochein bisschen mehr, was mich persönlich natürlich freut, mehr Stonks immer gut. Aber die wareneigentlich ganz gut damals, die lagen damit eigentlich ganz richtig, also was so im Durchschnittdrinne ist. Hast du diese Woche noch wirklich etwas zu tun auf der aktuellen Arbeit oder chillstzu deinem Leben? Ganz ehrlich, ich chille mein Leben und ich mache das auch schon seit ein paarWochen so. Klar ich mache die ein oder anderen Sachen schon noch, gerade wenn mich irgendwelcheKollegen fragen, wie sieht es aus? Kannst du mal gucken? Guck ich immer, es ist nicht so,dass ich nichts mache, aber so wirklich irgendwie super motiviert an irgendwas basteln. Es istvorbei jetzt, ist eigentlich schon vorbei seit ich gekündigt habe, habe ich direkt im Januar schongemerkt, als ich angefangen habe, dass mich das absolut nicht juckt. Die zwei Tage, wo ich jetztnoch arbeiten muss, morgen und übermorgen, die chille ich wirklich mein Leben. Ich sehe auchwenig Lerneffekt, weil ein aufgekommenes Problem nur selten so wieder vorkommt. Habt Angst nichtzu lernen, irgendwie auf der Strecke zu bleiben, wenn es um anderen geht. Ja gut, dann ist doch dasBeste eigentlich, dass du dir privat was anguckst, was dich interessiert. Gibt ja tausende Bereiche.Natürlich am besten ist, wenn es dich privat interessiert und ein Thema ist, was auch gefragtist. Muss ja nicht gleich Kobol-Programmierer sein, aber wenn du dir zum Beispiel ein bisschen was imCloud-Umfeld anschaust, wenn du dir beispielsweise mal einen Test-Account machst bei Google Cloud oderbei Azure oder AWS, da kriegst du ja immer 100, 200, 300 Euro, was auch immer Startgut haben undkannst da ein bisschen ausprobieren und kannst meistens auch beliebig viele Accounts machen,wenn es nicht total übertreibst. Also, wenn du dich ein bisschen auskennst bei den jeweiligenCloud-Anbietern auf den Plattformen, da hast du schon mal einiges, also hast du schon mal einigenLeuten was voraus und das wird immer wichtiger. Das ist eigentlich, ich will nicht sagen, dass esPflicht ist heute für jemand, der so im Admin-Umfeld arbeitet, aber ein bisschen Ahnung von aktuellenCloud-Plattformen sollte man haben. Es ist nicht so wichtig, dass es exakt die ist, die dann Arbeitgebereinsetzt, aber ich finde es nicht verkehrt, wenn man, zwar es gibt drei große, du hast Amazon,du hast Microsoft, du hast Google, also sprich, du hast Google Cloud, du hast Microsoft Azure und duhast Amazon AWS. Und ich finde es nicht verkehrt, wenn man in zwei von drei schon mal reingeguckthat. Und das alle kriegt man dann immerhin. Die haben alle so ein paar Dinger. Amazon hatbeschissene Benamung, gut man muss sagen, das haben sie alle irgendwo, aber Amazon hat die superbeschissene Benamung. Ich sage nur hier, Elastic, setze AWS, dann Elastic, dann irgendwas anderes einoder das Fargate Managed Kubernetes Cluster ist. Niemand kommt drauf, dass Fargate damit was zu tunhat. Also Amazon benennt die Sachen beschissen. Und hat dafür finde ich zwar eine Oldschool,aber eine ganz gute Oberfläche. Bei Google Cloud finde ich nichts. Dafür kann man es wunderbarnatürlich auch über Terraform oder so administrieren, aber Google Cloud im Webinterfacefinde ich gar nichts. Da blicke ich bis heute nicht durch. Vor allem, weil du manche interessantenSachen auch unter mehr Anzeigen stehen hast und dann klickst du auf mehr Anzeigen und es ploppen180 Dinge auf, du verstehst noch weniger. Als Google Cloud finde ich im Webinterface gar nichts,über die Suche schon, aber nie über dieses Menü. Und Azure muss ich ehrlich sagen, finde icheigentlich von der Aufmachung her, was so die Benamung und das Interface, wie gesagt, ich redeimmer noch vom Webinterface angeht, noch mit am besten. Aber selbst da ist schwierig durchzublickenund man macht die wenigsten Sachen ja auch über das Webinterface. Das guckt man sich am Anfang an.Also das ist zum Beispiel was, wenn du dich dafür interessierst, guck dir mal die aktuellenCloud-Anbieter an. Schnapp dir beispielsweise bei Google kriegst du 100 Euro Startguthaben,bei Azure kriegst du auch 100 Euro Startguthaben. Ich glaube bei Azure sind sogar 300 Dollar Startguthaben,aber du kannst ein bisschen ausprobieren. Bei Google ist das schöne, du kannst dir bei GoogleCloud einen Account erstellen. Du musst den zwar einmalig per Kreditkarte aktivieren, das machendie, dass die Leute nicht 100.000 Fake-Accounts erstellen, aber dann ist Bezahlung ausgeschaltet.Also selbst wenn du es total verkackst, ist nicht so, dass nach den 100 Euro Startguthabenauf einmal dein Konto leer ist. Das hört dann auf. Du kannst nicht pleite werden durch das Testen,das ist was, was du machen kannst. Hat das mit dem Arbeitszeugnis dann geklappt? Also ich geheübermorgen hin, angeblich ist mein Zeugnis da und ich kann es abholen und die Bescheinigungüber Überurlaubstage auch. Doch, doch, doch, doch, die neue Arbeit ist, ist, ist keine Ahnung,500 Meter Luftlinie von der alten entfernt. Was hast du bis jetzt gemacht? Was wirst du abnächster Woche machen? Als ab nächster Woche bin ich offiziell, jetzt haltet euch fest,Senior Linux Engineer und was ich aktuell mache, habe ich 30 Milliarden Videos aufgenommen hier,das mache ich auf der Arbeit, Talk über Ausbildung, das verdiene ich als DevOpsEngineer und alles Mögliche. Jetzt immer wieder interessant, mal auf diesen VOD-Kanal zu gucken,ob es da Kommentare gibt, aber da schreibt mir jemand Kommentare. Ja, nice, warum nicht? Alsoden Sinn von der Apple Watch habe ich noch nicht so hundertprozentig für mich verstanden,warum man das braucht. Also ich verstehe es, wenn man Fitnesszeug tracken will, aber ansonsten...Na, ich werde dieses Jahr 39 Leute, da wird es immer schon Zeit. So, also, hat es fertiggeupdatet, Reboot. Jetzt wird es langsam Zeit, dass ich euch mal zeige bzw.Oh fuck, warte mal. Oh nee, Glück, ich habe nichts übersehen. Close. Du bist gespannt darauf,was ein Senior Linux Engineer macht? Tja, ich auch. Aber ehrlich gesagt, Jobtitel, das ist doch ehnur Schall und Rauch. Ich könnte genauso gut Senior DevOps Engineer, Senior Linux Engineer,Senior System Administrator, Senior, selbst mit Senior, mit Expert, mit was auch immer. Letztendlichist das alles nur bla bla und ziemlich austauschbar von den Bezeichnungen her.Wir machen heute ein paar coole Sachen an einem bestehenden Projekt. Allerdings sind die Sachenrelativ easy, glaube ich zumindest, sodass man nebenbei können wir schwätzen und ich kann einbisschen was erklären und sowas. Ja, so, also, was machen wir heute? Oder Senior, Senior,Agile, Dev, Bus, Fin, Win, SecOps. Wenn schon dann richtig. Ja, Moment, Cloud natürlich auchnoch dabei. Cloud-Native, Cloud-Native, bitteschön. Da wird reingerollt in die Cloud.Solange man Kubernetes richtig ausspricht. Ja, das ist die Frage, wie man das nur richtigausspricht. Ist es Kubernetes? Ist es Kubernetes? Ist es Kubernetes? Es ist nicht so ganz klar.Oder ist es sogar vielleicht Kates? Kates, finde ich, hört sich irgendwie einfach falsch an.Hört sich doch noch AIDS an, Kates. Aber was mich persönlich immer noch komplett fertig macht,sind die Leute, die kubectl, nicht kubectl oder kubectl-control aussprengen, sondern kubectl.Kubectl, man. Ich habe jetzt die ein oder anderen Videos auf YouTube geguckt zu Themenso im Kubernetes-Bereich. Da gibt es echt viele, die es wirklich kubectl aussprechen. Ich werdemich da nie dran gewöhnen. Ich habe ewig gebraucht zu merken, warum K8S K8S ist. Ich glaube,ihr könnt mir mal schreiben, ob ich richtig liege. Ich glaube, es liegt daran, weil es 8 Buchstabensind in Kubernetes. Oder, warte mal, in Kubernetes zwischen K und S irgendwie. 1, 2, 3, 4, 5, 6,7, 8. Ja, genau. Es sind 8 Buchstaben zwischen K und S. Deswegen ist es so. Stimmt schon. Wobeiich ja schwanke bei STRG zwischen STRG und Control. Ich glaube, mittlerweile sage ichhauptsächlich Control. Na gut, alles klar. Also geupdatet haben wir alles. Gucken,nicht dass jetzt noch was nachgekommen ist, weil Arch, by the way. Was heißt K3S eigentlich? Dasist eine gute Frage. Also ich habe keine Ahnung, was das heißt. Ich will auch gerade überlegen.Ich weiß, was es ist. Ich habe keine Ahnung, wo der Name herkommt. Kubez. Ja, Kubez gibt esja auch. Es gibt im Prinzip eigentlich fast alles in diesem Umfeld, wo nicht schon derName belegt wäre. Ach, ich muss euch noch was trauriges erzählen. Zetketime, Leute. RichtigZetketime, was ich heute erfahren habe. Nee, für euch nicht Zetke. Aber was ich wieder richtig kackefinde und zwar, ich habe versucht bei mir auf der aktuellen Arbeit einen Azubi zu vermitteln voreinem dreiviertel Jahr oder vor einem Jahr. Ich schaue ein bisschen her. Und zwar war das jemand,der hat eine Umschulung gemacht zum Fachinformatiker Systemintegration. Also ein bisschen so wieDot Project oder falls ich das richtig, ja genau, das Umschulung zum Physik gemacht. Also er hateine Umschulung, der macht gerade eine Umschulung zum Fachinformatiker Systemintegration. Davorwar er Schreiner oder sowas. Keine Ahnung. Zumindest, die müssen, glaube ich, im zweitenJahr müssen sie für drei oder vier Monate ein in Anführung zu dem Praktikum machen, wo sie dannauch ihr Abschlussprojekt durchführen können. Also die brauchen einen Betrieb. Also wenn duUmschulungen zum Fachinformatiker Systemintegration machst, dann vielleicht Dot Project kann esvielleicht was zu sagen, ob das stimmt, was ich hier erzähle, musste beim Betrieb irgendwie einPraktikum machen und in dieser Zeit dann quasi auch dein Abschlussprojekt dort finden unddurchführen und Doku schreiben und Zeug. Also sprich, das ist erforderlich dafür, dass du diese drei,vier Monate im Betrieb bist, dass du deine Ausbildung fertig machen kannst. So. Und ichhabe versucht einen Umschulungsazubi an die Firma, wo ich aktuell noch bin, für zwei Tage zuvermitteln. Ich kenne den nur um drei Ecken. Also das ist der Freund von der Tochter von einerFreundin von meiner Mutter. Also es ist wirklich um drei Ecken. Ist auch vollkommen egal. Ich dachtemir, gut, du kannst ja mal fragen. Und ich habe bei uns die Personalabteilung, äh nicht diePersonalabteilung, die die die die Ausbildungsbetreuung angehauen und die haben sich ewig nicht gerührt undimmer nur gesagt so nach dem Motto Ja, was ist denn in dem Fall? Was ist das? Ich habe 100.000 Sachengefragt, aber es war nie so wirklich Zug drinnen und ich habe dann halt wirklich drei, vier Wochenam Stück oder eher vier, fünf Wochen am Stück immer mal wieder genervt, obwohl sie ja auchzwischendurch immer erzählt haben. Das ist eh so ein Ding, was ich bei dem aktuellen Arbeitgebernicht verstehe. Auf der einen Seite erzählen sie immer wir finden keine Azubis, keine Geigen.Also niemand bewirbt sich und dann präsentierst du ihn ein auf dem Silbertablett und da wollensie nicht. Also das, was da gesagt wird und was wirklich gemacht wird für zwei verschiedenePaar Schuhe zumindest hat das nicht geklappt. Ich habe sie dann noch ein bisschen weiter genervtund ich habe halt dann irgendwann festgestellt, okay, selbst die Ausbildungsbetreuung kümmertsich überhaupt nicht darum. Und dann habe ich noch mal offiziell über meinen Chefanfragen lassen. Dann mussten sie reagieren und haben mir noch am gleichen Tag abgesagtmit der Begründung. So nach dem Motto Sie keine der Abteilung hätte sich bereit erklärt, ihnzu nehmen blablabla. Also im Prinzip die haben einfach sie fünf Wochen nichts gemacht und alsich dann noch mal offiziell gefragt habe, haben sie gesagt, nee machen wir nicht. So und jetztZedge, ich wusste der Kerl ist eh schon ein bisschen neben der Spur ja und das Einzige,was ihn irgendwie noch halbwegs auf der Spur gehalten hat so die letzten zwei Jahre ist,dass der eben sich die Ausbildung gemacht hat und jetzt irgendwie so ein bisschen was ja wie sollman sagen, was festes so in seinem Leben hatte, was irgendwie täglich aufstehen und so. Zumindest,ich habe jetzt gehört, er hat nirgends woanders, nein nein Leute keine Panik, keine Panik, so schlimmist es nicht, so schlimm ist es nicht, was jetzt kommt. Nein nein, er hat sich nicht umgebracht,also macht euch keine Sorgen, das hätte ich euch so jetzt nicht erzählt. Er hat zumindest keinAusbildungs, kein Praktikum oder sowas gefunden und ich habe letztens jetzt gehört, das hat ihn soaus der Bahn geschmissen, dass er jetzt irgendwie seit zwei Monaten in der Psychiatrie ist undbehandelt werden muss. Da siehst du mal, was einfach, was so dahin, wie soll man sagen, so nicht drumgekümmert ist, so einfach mal seinen Job nicht gemacht als Ausbildungsbetreuer, was das fürAuswirkungen auf andere Leute haben kann und da wäre bestimmt gar nicht schlecht gewesen der Typ,zumindest hätte er dann seine Ausbildung fertig. Jetzt ist er wohl gerade wieder raus und es gehtihm wieder halbwegs gut, aber es hat ihn voll aus der Bahn geschmissen und alles nur, was heißtalles, es hätte sich ja durchaus auch eine andere Firma finden können, das lag jetzt nicht nur andem Laden, das alles nur, weil sie bei uns keinen Bock hatten, sich mit der Thematik auseinanderzusetzen.Wozu braucht man jetzt mal eine blöde Frage, wozu braucht man einen Recruiter, wenn manniemand einstellen will? Ist das einfachste, wenn man niemand einstellen will, nicht einfachkeinen Recruiter zu haben? Wieso? Sie hätten sich doch einfach auch drum kümmern können. Es heißtnicht, dass sie es machen müssen, das nicht, aber sie hätten sich doch auch drum kümmern können undnicht sich fünf Wochen von mir nerven lassen und als ich dann offiziell angefragt habe noch mal amgleichen Tag noch zu sagen, ach es hat sich niemand gefunden. Hätten die sich wirklich da drumgekümmert, hätten die gefragt, gibt es da einen Platz und es wäre am Ende rausgekommen, nee gibtes nicht, dann hätte ich gar nichts gesagt, aber einfach nichts zu machen fünf Wochen lang und wennman dann noch mal besonders nervt zu sagen, ach nee ist nicht, was ist das für ein Arsch, dafür gibtes Leute, die explizit dafür da sind, sich um Ausbildung und sowas zu kümmern. Der soll halt malihren Job machen. Ahja, gut, unerm Strich, Geld regelt. Unerm Strich ist es wahrscheinlich fürdiese Unternehmen oder denken sie zumindest, ist es unterm Strich billiger oder was heißt billiger,unterm Strich stehen sie besser da, wenn die Entwickler unbezahlt bei ihnen rumhocken,als was wichtiges bei der Konkurrenz zu machen. Naja. So, aber jetzt müssen wir mal loslegen,Leute, damit das heute noch was wird. Ich zeige euch mal kurz, um was es heute geht. Wir werdenheute nämlich ein bisschen .NET bzw. ein bisschen C-Sharp und mit unter .NET 8 weiterprogrammieren. Ich hätte nämlich nicht gedacht, dass so mein an einem Tag erstelltes Miniprojektmir dann doch so viel Bock macht, dass ich da noch ein paar kleine Sachen ergänzen will.Es war um was geht's. Ich demonstriere euch das mal. Vorher zeige ich euch was anderes,habe ich ganz am Anfang des Streams schon gesagt. Das finde ich auch kacke, dass Microsoft das sonennt, weil eigentlich sind alle Sachen mit Champ hinten dran so mein Ding. Schade, dass mandas Patente kein Wildcard Support haben. Vielleicht sollte ich das mal vorschlagen, dass man sichSternchen Champ in Verbindung mit Softwareprojekten komplett sichern kann. Wildcard Patente oder sowas. Ich wollte euch eine Sache noch zeigen, und zwar ich habe hier heute meine ganzen Datenumgezogen vom alten iPhone aufs neue iPhone. Ist der ASCII CAC WPR schon da? Ja, der istschon da, der ist schon da und der ist auch geklost von mir schon, weil der PR Autocomplete kaputtgemacht hat von der Shell. Allerdings ist es kein Problem, weil ich habe selbst ein besseresFeature eingebaut, nämlich einen farbigen CAC W mit versteckter Option. Ja, also was ich euchjetzt zeigen wollte, ich habe hier heute meine ganzen Daten umgezogen vom alten iPhone aufsneue iPhone und es ist immer unglaublich schwierig vom iPhone Daten abzuziehen, wenn man nicht geradeund selbst da am einfachsten ist es vom alten auf ein neues iPhone umzustellen. Das ist einfach,aber die Daten da runter zu bekommen, um mal ein komplettes Backup zu machen, zum Beispiel einBackup von allen Fotos, ist gar nicht so einfach. Es gibt ein paar Apps, da geht das, dass manbeispielsweise einen FTP Server, einen Web Server aufmacht und da drüber Sachen runter lädt. Damuss man es aber auch erst importieren in diese Anwendung oder man muss Shit iTunes verwenden,was absolute Abfuck ist, was ich niemals auf meinen Rechner installieren werde oder was auchganz praktisch ist. Man kann, also natürlich kann man es einfach per USB verbinden und hierüber den Explorer drüber ziehen, das geht, aber es gibt ein viel, viel besseres Projekt und zwarnennt sich das iFuse oder iFuse oder wie auch immer. Damit kann man sein iPhone in einen Ordnermounten unter Linux und kann dann auf das meiste zugreifen und auf das, was man nicht zugreifenkann, kann man das mit bestimmten Optionen mounten, dass du direkt auf Anwendungsordnerzugreifen kannst. Also du kannst dann zum Beispiel den Ordner mounten von deiner Notizanwendung unddie Daten daraus ziehen, ohne dass die Notizanwendung selbst zwingenderweise eine Exportfunktion habenmuss. Also das ist wirklich sehr praktisch. Ich kann es euch nicht zeigen, weil wenn ich es euchzeige, ja mit einem MacBook ist das easy, aber wenn ich es euch zeige, leake ich vielleichtSachen von meinem iPhone, da habe ich keinen Bock drauf. Ja, also das finde ich sehr nice,habe ich heute wieder benutzt um iPhone Backup zu machen. Kann ich, kann ich nur recommenden.Moin Sirius Max. Alles klar, so muss ich mal kurz in mich gehen. Ich glaube die Musik ist einTicken lauter. Mir geht eigentlich. Okay, also um was geht es heute? Ich zeige euch mal was.Ich mache mal kurz zu und mache mal hier einen neuen Browser auf. Ich habe letzte Woche was,nein nicht die Cute App und auch nicht Pfeilfeder. Ich habe letzte Woche was entwickelt,an einem Tag, weil ich selbst gerne so ein Programm hätte haben wollen und ich nichtsgefunden habe in der Richtung und zwar ich habe den VmChamp erstellt. Was macht der VmChamp?Der VmChamp erlaubt das, der Name ist natürlich, bei mir heißt ja alles irgendwie was mit Champhinten dran. Man kann damit, wobei guckt euch, guckt euch die ReadMe an, da steht ja eigentlichalles drin. Simple and fast creation of throw away VMs on your local machine. Connect via SSH injust a few seconds. We are all sitting in one boat. Nicht Vagrant. Anderer Anwendungszweck alsVagrant. Das stimmt nicht so wirklich. Anderer Anwendungszweck als Vagrant. Vagrant ist ja eherein, so ein bisschen so ein Automatisierungstool für VMs. Da kannst du ja auch custom Sachendran anpassen und sowas. Dafür ist es schwierig mit Vagrant quasi vom gleichen Ordner, vom gleichenVagrant-File, wenn ich es zumindest noch richtig in Erinnerung habe, zehnmal die gleiche VM zustarten und sowas. Und Vagrant ist halt ziemlich oldschool mit Ruby und es unterstützt KVM nichtstandardmäßig, nur mit Third-Party-Provider. Ich wollte ein simples Tool haben, wo ich mit einemBefehl lokal bei mir eine VM anlegen kann, um was auszuprobieren. Und warum will ich das haben?Naja, weil es gehen halt nicht Container für alles. Genau das ist der Grund, warum ich es gemachthabe. Es ist nicht immer möglich, alles in Containern zu machen. Zum Beispiel, wenn manKernel-Module braucht oder zum Beispiel, wenn man irgendwelche in Docker-Schweinereien machen will.Das kann man zwar meistens irgendwie noch regeln oder wenn man mehr als eine Sache laufen will,wenn man sich Packages inszenieren will aus dem Repo, die vielleicht irgendwelche Modulenachlädt. Also manchmal macht es einen Docker-Container einfach nicht. Manchmal braucht es eine VM.Ja zum Beispiel, bestes bestes Beispiel dafür, man möchte einen GitLab-Runner oder einenGTA-Runner jetzt mal lokal testen. Kannste knicken mit Docker in Docker. Das wäre nämlich Docker inDocker in Docker in Docker. Und irgendwann hört es dann auch auf, gescheit zu funktionieren.Und das ist dann halt ein bisschen blöd. Das müsstest du machen, das müsstest du machen,um beispielsweise einen GitLab-Runner. Nee, nee, nee. Der Runner ist Docker in Docker in Docker.Also für alles, wo du keine VM, wo du keinen Container verwenden kannst und das habe ichmanchmal, ist das ganz sinnvoll. Und es gibt einfach nichts Gescheites dafür. Das Beste,was ich auf GitLab gefunden habe, ist das hier. Das ist ein Projekt von einem Spanier oder so,wahrscheinlich. Der hat in Bash sich was zusammengescriptet, was die lokale VMs anlegt.Deswegen habe ich selbst was gebaut dafür und das funktioniert folgendermaßen. Ich zeige euchdas mal. Ich muss übrigens eine Sache vorher mal machen, weil das immer, wobei, nee, muss ichgar nicht machen. Müsste eigentlich auch so funktionieren, weil das in Verbindung mit VMmanchmal buggt. Also was man machen kann ist, ich demonstriere euch das jetzt einfach mal kurz.Ihr könnt zum Beispiel sagen, VMChamp, run, Name für die VM, test-vm. Ihr habt übrigens beiallem Autocomplete hier an der Stelle. Test-vm. So und jetzt könnt ihr entweder sagen, inBackground, Disk, Local Image Remedings. Ihr müsst aber auch gar nichts angeben. Ihr könnt es einfachso leer lassen und ausführen. Dann lädt ein aktuelles, Default ist Debian, dann lädt einaktuelles Debian Cloud Image runter und startet die VM. Und nach kürzerer Zeit, ich mache malden Wirtmanager auf, dass wir zugucken können. Das ist normalerweise natürlich nicht notwendigdafür. Der hoffentlich sich jetzt verbindet. Guckt, die VM bootet. Also wie gesagt, die braucht maneigentlich nicht. Die VM bootet und die connectet sich jetzt auch gleich im Netzwerk und dannconnectet er sich direkt per SSH auf die VM. Zack, ist meine VM am Start. Also viel einfacher gehtes nicht, um eine lokale VM zu erstellen. Jetzt ist man auf der VM drauf, kann da irgendwelcheDinger treiben und wenn man fertig ist, in seiner VM Sachen auszuprobieren. Das Coole ist halt auchhier, dass man jetzt eine richtig echte VM hat. Man kann jetzt sowas hier machen wie Modprobeminus R PC Speaker oder PC Speaker. Nee, wie heißt denn das überhaupt? Ach, keine Ahnung.PC. Ach, PC Speaker ist im Cloud Image vielleicht gar nicht drinnen. Zumindest,kann ich Kernel-Module laden und entladen, was halt so in Docker-Containern nicht funktioniert.Und du kannst auch alles andere machen, was du in so einer VM machst. Wenn du fertig bist,du kannst noch eine zweite VM starten und sonst was. Wenn du fertig bist, kannst du die VM entweder,wenn du siehst, hier überall Autocomplete, kannst du die VM entweder wieder löschen oder du kannstnoch eine zweite VM erstellen, wenn du vielleicht noch mehr brauchst zum Testen. Und da sagen wirjetzt mal, okay, da brauchen wir was anderes. Da brauchen wir jetzt hier einen Ubuntu. Ubuntu2004 brauchen wir oder komm, Schein an. Wir nehmen einfach noch mal einen Debian, weil dannist das ISO schon runtergeladen. Also wir brauchen einen Debian, allerdings brauchen wir jetzt einbisschen mehr Arbeitsspeicher. Hier 1024 MB Arbeitsspeicher und wir brauchen eine größereFestplatte für die VM, hier 32G. Und die VM mit dem Namen gibt es schon, deswegen erstellen wirTest VM 2. Und dann fährt er eine zweite VM hoch und alles ist gut. Wirt Manager braucht mandafür nicht. Das ist wirklich sehr nice für lokale Test VMs, die man kurzzeitig mal braucht,was auszuprobieren und dann wieder wegzuschmeißen. Ja, und wenn man dann fertig ist, wenn man das dann,wenn man dann fertig ausprobiert hat, das war mir nämlich auch wichtig, dass man den ganzenKrempel rückstandslos, rückstandslos wieder wegbekommt. Wenn er irgendwann dann gestartetist und Netzwerkverbindung hat. So, jetzt bin ich fertig. Jetzt kann ich erst mal gucken,wie viele VMs habe ich denn. Kann ich mir das Ganze auflisten lassen. Wenn ich connecten willauf so eine Test VM, kann ich das PSSH machen. Direkt hiermit, der sucht sich das dann raus undconnectet einer mit. Ja. Und ansonsten. Das Teil managt auch die SSH Keys dafür. Es nimmt dieSSH Keys, die bei dir in deinem SSH-Verzeichnis liegen. Ja. So, und wenn du fertig bist und daswar mir wichtig, dass man das hat. Also wie gesagt, man kann sich alles auflisten lassen,was man gerade laufen hat oder welche Betriebssysteme unterstützt sind standardmäßig.Man kann auch ein lokales, man kann auch sagen Local Image und da eins übergeben. Ja, das gehtauch. Und wenn man fertig ist, sagt man einfach VMChem clean. Man fragt da ein noch mal. Hey,ich lösche alles. Alle Images, alle VMs. Dann sagst du ja, okay, alles klar. Und alle VMs sindweg. Alle Images sind weg. Das heißt, aller Speicherplatz ist freigegeben. Also für kleine,lokale Test VMs habe ich mir sowas schon die ganze Zeit gewünscht. Vor allem,weil es Cloud Images sind. Wenn man eine lokale Test VM braucht, normalerweise legt man eine neueVM an, legt das ISO ein, klickt den Installer durch und das ist halt doof. Man könnte beimClean noch die VMs auflisten, die gelöscht werden. Könnte man Theoretisch. Ich weiß nicht,wie sinnig das ist, wenn ich sage, ich bin fertig. Ist das auch auf Windows-Support? Es sei denn,Windows unterstützt LibVirt. Das habe ich so meine Zweifel. Ne. Du brauchst LibVirt und dasheißt im Prinzip eigentlich in der Regel die Kombination. Also VMWare würde gehen. VMWarewürde gehen. Ich habe keine Ahnung, ob LibVirt in WSL geht. Das könnte man mal ausprobieren.Ach, Remote KVM, ja. Weil ich glaube, KVM wird nicht wirklich funktionieren.Geht KVM in WSL im Leben nicht, oder?Was? Okay, dann würde es in WSL funktionieren.Ganz schimmer. Keine Ahnung, ob KVM gescheit funktioniert in WSL. Aber dann würde es funktionieren.Man könnte es auch Clean All nennen. Ja, so. Dann kannste schmeißt alles weg. Was macht dasKV-Command? Es ist auch da. Das Allerwichtigste. Und wir haben sogar letztens geguckt,wie viele KWs pro Sekunde wir schaffen. Relativ wenig. Also wir schaffen nur 2,3 Megabyte KWsdie Sekunde. Da geht noch mehr. Ach ja, und wenn man Help eingibt, ist KW nicht gelistet. Das istein Easter Egg. Und ihr wisst es jetzt, Chat. Kannste auch einzelne Frames vom Video so ausgeben?Hä? Das verstehe ich nicht. Jo. Und ansonsten, was ich auch sehr nice finde,KW-Video in die Konsole. Das ist kein GIF, das ist ein Stratisches Bild. Also was ich machen kann,ist, weil ich das beste Terminal ever verwende, ist, ich kann GIFs in der Konsole abspielen.Ganz essentielles Feature. Und theoretisch jedes x-beliebige Video, wenn ich es vorher mit FFMPack nach GIF umwandle, was man wahrscheinlich nicht will. Wie heißt das Terminal? West Term.Bestes. West Term. Kann ich euch wirklich nur wärmsten empfehlen? Es gibt es für Mac, Linux,Windows, hat Image Support, hat super Customizable Config, ist GPU gerendert, ist für mich so dasbeste Terminal, was ich die letzten Jahre über entdeckt habe. Find ich besser als die ganzenanderen neueren Terminals, die es so gibt. Vor allem weil es auch TMAX-Funktionalitäten,also das was TMAX hatte, auch direkt im Terminal bietet. Mit Z. West Term. Hier,ich habe es doch gerade gezeigt. West Term. Jo. Und was ich auch haben wollte und was tatsächlichein bisschen kompliziert war einzubauen, ihr werdet, guck mal, ich habe Autocomplete füralle Sachen. Und wenn ich, beide kann ich an der Stelle zeigen, wenn ich eine VM laufen habe,dann habe ich sogar Autocomplete für die Kommandos hier. Also wenn ich jetzt sage löschen,ich will eine VM löschen, dann Autocomplete, da sogar alle VMs, die er selbst angelegt hat.Nur VMs, die er selbst angelegt hat. Also das löscht ja nicht alle VMs, sondern die VMs,die er selbst angelegt hat. Ja. Und Autocomplete ist auch total easy zu konfigurieren. Man kannnämlich einfach sagen vmchamp, ich glaube completion. Ja. Minus minus completion zsh.Und dann kriegt man so eine Funktion ausgespuckt, die kann man in seine zshrc packen oder man machtdas so wie ich und packt einfach source da drauf. So source vmchamp completion zsh. Und dann hatman shell completion für alle seine lokalen test vms. Ja, so sieht es aus. Und ich dachte,wir bauen heute mal ein paar kleine Sachen noch ein. Ich habe das innerhalb von einem Tagzusammengefrickelt, dieses, das Tool. Was heißt zusammengefrickelt? Eigentlich ist dersource code sogar relativ gut lesbar. Also kann sich jeder, jeder der will, kann sich das zurGemüte führen. Ist, ich finde relativ gut lesbar alles. Und ich habe da jetzt mehr Spaß dran,da weiter dran zu basteln, als ich eigentlich gedacht habe. Ich habe es ja ursprünglich gemacht,weil ich mir selbst so ein Tool gewünscht habe für schnelle lokale test VMs direkt zum wiederwegschmeißen danach. Und jetzt habe ich irgendwie Bock, da noch ein paar kleine Kleinigkeiteneinzubauen. Was wird gebastelt? Wir erweitern den vmchamp heute um ein paar Kleinigkeiten. Wasist der vmchamp? Kannst du dir durchlesen auf github beziehungsweise die readme überspringen.Damit kannst du lokale test vms erstellen innerhalb von ein paar Sekunden. Mal velkrim, ja,habe ich früher, habe ich relativ viel velkrim benutzt. Wobei velkrim ein bisschen in anderenAnwendungsfall abdeckt und das Problem hat, dass es nicht mit kvm native zusammenarbeitet,sondern nur mit virtualbox. Und da habe ich gar keinen Bock drauf. Ich weiß, es gibt einen kvmthirdparty plugin wohl. Aber was du mit vkrim nicht machen kannst ist, keine Ahnung, auf die schnelleeine debian, eine fedora und nochmal drei ubuntu vms starten. Du brauchst dann einen pfile drinnen,mit vkrim pfile, mit vkrim up einmalig und sowas. Ja, das ist, das ist hat, finde ich,ein bisschen anderen Anwendungszweck. Vakrant ist quasi noch aus Zeiten, wo terraform undsolche Sachen noch nicht existiert haben. Was übrigens von der gleichen Firma ist,falls ihr das nicht wisst. Der Vakrant Erfinder ist der haschi haschi korb Gründer. Und daswurde, das hat er quasi schon erfunden davor. Es passt auch irgendwie zusammen, dass das diegleichen Dudes sind, weil der gleiche Typ ist. Hast du eine Description Vorlage für deine Repos?Nee, die mache ich eigentlich immer so, wie es passt. Die Readme, das Format der Readmehabe ich tatsächlich von einem unserer Mods geklaut. Ja, und es ist ganz einfach. Du kannsteinfach eine vm lokal starten und dann verbindet sich per Netzwerk dahin, wenn es nicht zu langedauert. So, also es gibt ein paar Sachen, die ich heute machen will. Wir müssen mal ein bisschenein bisschen was, ein bisschen was anfangen heute. Also ich mache mal kurz hier to do's,to do's für heute. Also was haben wir am Start? Was will ich machen? Ich will einmal die ganzenmegabyte angaben zu megabyte, maybe bytes, maybe byte, wie auch immer zu megabyte ändern,weil keine Sau, ehrlich gesagt, kann was mit, passt mal auf, keiner kann was anfangen mit976,56, maybe, maybe byte. Man kann sich denken, dass es 1024 megabytes sind. Für den Arsch.Kann das mehr als Knoam als was? Knoam Boxes? Soll das Boxes heißen? Knoam Boxes. Ja, es ist einKommando Zeilentool. Das kann ein Kommando Zeilentool sein. Und es ist dafür gedacht,dass man vm's anlegt und danach gleich wieder wegschmeißt. Es geht hier nicht um den generellenvm Manager oder sowas. Anlegen, PSSH drauf, connecten, was ausprobieren für 20 Minuten undwieder wegschmeißen, weil spätestens nach dem Reboot sind die vm's eh wieder weg und alleswieder aufgeräumt. Sollte was nicht aufgeräumt sein, sagste einfach vm-champ, clean und allesist wieder weg. Und Wirt Manager ist immer noch das beste, was es gibt, wenn man wirklich in GUIbraucht und was damit machen will. Werden die Downloads gecached? Ja, werden sie. Guck mal,jetzt habe ich gerade einen clean ausgeführt, also sprich, da hat alle Images und vm's gelöscht,aber ich zeig's dir noch mal. Also erstens er nimmt die Cloud-Images, was eh schon maldeutlich leichtgewichtiger ist als die ganzen anderen Images. Das funktioniert folgendermaßen,ich mach mal... Was? Ah ja, okay. Kannst du mal ein Beispiel nennen? Naja, zum Beispiel,wenn ein Container nicht ausreicht, sei es wenn du Kernel-Module brauchst oder du malirgendeinen Continuous Integration Tool Runner testen willst, wie wir letztens zum Beispiel hattenund keinen Bock hast auf Docker, in Docker, in Docker und Prey machen musst, dass es funktioniert.Manchmal sind vm's noch ganz sinnvoll zum Testen. Und ich hab mir die ganze Zeit eben schon so einenTool gewünscht, wo du sagst, hey, lass mal schnell eine Test-VM starten, lokal, ein vollständigesBetriebssystem, also auch mit einem System D drauf, wo man auch mal irgendeinen Init-Skripttesten kann. Das kannst du ja in Docker Containern nicht machen. Wenn du beispielsweise mal ein UnitFile erstellen willst und gucken... Du musst irgendeinen Package machen mit einem Unit File und guckenmusst, ob du willst, ob das startet und sowas. Das kannst du alles nicht im Container gescheitmachen. Also es gibt Fälle, da ist ein Container nicht so praktisch. Aber das ist auch nichts,wo du jetzt dir eine neue VM anlegen willst, hier, mal eine Debian-Install durchlaufen lassen willst,du willst eine kurze vollwertige VM haben, drauf was ausprobieren und wieder wegschmeißen. Im Prinzipein bisschen wie wenn du zum Testen mal schnell einen Container startest mit, ihr Docker run,bla bla bla. Nur, dass es halt eine VM ist. Und natürlich bei weitem nicht so sophisticatedManagement wie Docker und soll's ja auch, soll's ja auch gar nicht. Ja, und jetzt die Downloadswerden gecashed. Guck mal, ich hab grad ein Debian-System gestartet und wenn ich jetzt einzweites Debian-System starte, dann use der das Existing Image und es geht schneller.Ich mein, booten und IP ziehen muss die VM immer noch. So, also. Was will ich denn sonst nochmachen? Dann will ich noch eine Ausgabe haben, das hat mich tatsächlich letztens der Streamdraufgebracht. Wenn ich sage, List oder LS oder wie auch immer oder PS, ich glaube,ich hab das alles gealliast, dass man sich's merken kann. Hätte ich gerne hier noch eineAusgabe, ob die running ist oder vielleicht gecrasht ist oder irgendwie sowas in der Richtung. AlsoStatus bei LS. Ja, und jetzt kann man einfach alles wieder wegschmeißen,alle Images und VMs sind weg. Finde ich sehr praktisch.So, war der letzte Arbeitstag schon? Nee, mein letzter Arbeitstag ist übermorgen, am Mittwoch.So, also das will ich machen. Status bei LS, ob VM running oder gecrasht oder so. Dann hätteich gerne noch Images, mehr Images und zwar Arch-By-The-Way-Image muss natürlich sein.Fedora und vielleicht CentOS? Nee, keine. Was brauchen wir denn noch? Aktuell hab ich nurUbuntu. Also kommt mir nicht mit Suse, Suse bau ich nicht ein. Auf Suse hab ich keinen Bock.Suse, Suse. Windows? Nee. Windows wird nicht funktionieren. Windows, alter Leute. Red Hat,ich weiß nicht. Wenn schon CentOS. Debian haben wir. Debian und Ubuntu Images haben wir. Alsoist es drinne. Debian 11, 10, 9 und Ubuntu 18.04, 20.04 und 22.04. Nein Leute, ich mein's ernsthaft.Nee, irgendwelchen Blödsinn. Brauchen wir den? Brauchen wir den nicht. Also Arch-Mama rein,Fedora und CentOS reicht, glaube ich. Oracle, das ist vielleicht gar nicht so schlecht. Da könnenwir uns Red Hat sparen, weil das aktuelle Oracle ist ja ein Red Hat-Klon. Willst du die Liste mitden Images hardcone? Ja, hab ich schon. Aber wenn du ein eigenes Image angeben willst, kannst du dasauch machen. Also aktuell hat er ein Images drinne. Debian 11, 10, 9 und Ubuntu 18.04, 20.04 und 22.04.Du kannst aber auch, du kannst aber auch ein lokales Image angeben, wenn du eins hast. Und es muss keinDebian sein oder es kann alles sein. Also wenn du ein lokales Image hast, kannst du auch ein lokalesImage angeben. Was macht da VM-Champ? Lokale VMs starten. Du kannst hier die GitHub-Readme durchlesen,wenn du willst hier. Lokale, ich hab's jetzt nämlich schon zehnmal erzählt gerade. LokaleVMs starten, die du danach wieder wegschmeißen kannst. Für den Fall der Fälle, dass ein Docker-Containernicht ausreichend ist. Und er kann Kegway auf der Konsole posten. Holy Luck, Gamers. Dankeschön.Eventuell das Repo im Titel verlinken. Ach nee. Alma. Da muss ich euch was fragen mal. Habt ihrErfahrung mit Rocky Linux oder Alma Linux? Das sind ja quasi zwei Red Hat-Clones jetzt,seit CentOS nicht mehr ist. Was davon würdet ihr bevorzugen? Ich mach das Repo doch in Titel.Mir fällt übrigens eine Sache ein. Ich glaube, ich sollte die Release-Datei umbenennen. Kannman den Kram umbenennen nachträglich noch? Nee, oder? Man kann es nur neu oder kann man dasumbenennen? Noch nie machen müssen. Nee, man kann das umbenennen. Cool. Wie nennt man das dann?VMChamp? Das ist eine gute Bezeichnung. Linux? AMD 64 oder so? Wie benennt man den Scheißgescheit? Irgendwie eine Five-Hater-Idee? Wie machen die das denn? Wie benennen die ihreRunner denn? Hat doch letztens runtergeladen. Download? Okay, so benennen sie das. AMD hier,Linux, AMD 64. Sehr schön, so machen wir das auch. VMChamp, Linux, AMD 64. Jetzt weiß auch jeder,wofür das Binary ist. VMChamp PDF Screensaver. Nein, das ist out. Das ist out. Man nennt dieDinger heute .doc.exe. From left to right mit arabischen Buchstaben. So machen das die Five-Hater.Also weiter, so. Dann, was ich auch noch machen wollte ist, das sind alles Sachen,die dauern jetzt einzelne Schritte, nicht so lange. Dann hätte ich gerne noch die Möglichkeit überdie CLI eine VM zu rebooten. So blöds klingt, das geht aktuell noch nicht. Man kann nur die VMlöschen und wieder erstellen, aber manchmal möchte man ja auch mal rebooten, zum Beispiel,um ein Unit-File zu testen oder sowas. Manchmal ist ein Reboot nicht verkehrt. Und sei es nur,das Ding ist vielleicht abgekackt und du willst es resetten. Ja, moment, ja, rebooten. Mit einemForce-Switch. Dann recreate, wenn die VM schon existiert, ne Abfrage, ja, nein, neu erstellen.Auf allen VMs einen Befehl ausführen. Das würde ich nicht darüber machen. Das sollte man vielleichtbesser per SSH machen, direkt. Weil ich will das nicht übertreiben an Features, ehrlich gesagt.Ich meine, das ist für kleine Sachen und nicht, um irgendwie eine virtualisierte Umgebung zuorchestrieren oder sowas. Also den einen Vorschlag fand ich eben tatsächlich ganz gut. Da weiß ichaber nicht, ob es, nee, Klon muss nicht rein. Das brauchen wir nicht. Glaube ich nicht, oder?Nee. Cloud in den Zeugs benutzt es schon. Custom Pagages. Ich mache mal ein Fragezeichen dahinter beiSachen, wo ich mir nicht ganz sicher bin. Der Chat will direkt Docker, ja. Nee. VM. Das weiß ichnicht, ob es eine gute Idee ist. Also Custom Commands nach Boot. Das könnte man tatsächlichmachen. Das könnte man tatsächlich machen, weil ich verwende jetzt schon Cloudinit. Nee, Cloudiniterneut ausführen, das wird mir zu. Also alles, wo man eine Verbindung auf die VM braucht, ist doof.Da müsste man das nämlich per SSH machen. Das wird dann nur funktionieren, wenn SSH-Loginrichtig geht und alles. Nee, Ressourcen-Monitor. Nee, nee. Da kannst du einfach Hardtop machen undgucken, ob QEMO viel braucht oder KVM viel braucht. Also.Zum Beispiel Dashboard. Ja, so, das wird das Zeug neu erstellt und mehr fällt mir jetzt. Nee,nee, das mache ich nicht. Wenn man CPU und RAM changen will, dann muss man die VM ausschaltenoder resetten oder was auch immer. Das ist, glaube ich, ich weiß nicht, da kann man, da könnte mansie einfach recreate. Es soll ja wirklich nichts großartig damit gemacht werden, wo man die VM dreiTage laufen lässt. Change RAM. Ja, mal überlegen, mal gucken. Nee, GPU-Pastel und sowas bestimmt nicht.Aber Reboot, also ich glaube, das ist auch das erste, was wir machen danach. Also das machen wirjetzt als erstes, das ist easy. Und danach machen wir tatsächlich ein Reboot, weil Reboot sollterelativ einfach sein, Reboot zu implementieren für die VMs. Und Reboot ist tatsächlich sehr wichtig,weil so eine VM kann ja auch mal abkacken oder man möchte was testen in einer VM, was halt nurausgeführt wird beim Start. Ja, beispielsweise irgendein Unit-Start-Config, was auch immer.Ist das HKEY als Parameter? Naja, also aktuell ist es relativ easy gelöst. Aktuell nimmt ereinfach alles aus deinem SSH-Verzeichnis an Public Keys. Ja, wir können vielleicht minusminus SSH,ID. Naja, das mit User-Parameter von Hand können wir nicht machen. Dann geht es kaputt, der Rest.Ach so, User. Du meinst den Login-User. Ach nee, das glaubt das. Der User heißt standardmäßigUser. Das reicht schon. Wie gesagt, es geht ja nicht um VMs, die dann remote benutzt werden sollenoder sowas, die dir dann drei Wochen laufen lässt, sondern erstellen, einloggen, testen,wegschmeißen. Aber das mit dem Befehl ausführen hinten dran finde ich tatsächlich ganz interessantund das könnte sogar sein, dass wir das relativ easy eingebaut bekommen. Und zwar, da bin ich mirnicht sicher, wie Cloud-Init richtig funktioniert, weil die VMs, die werden ja mit den Cloud-Imagesaufgebaut und da läuft einmal Cloud-Init. Ich glaube Snapshots, supported, werden nichtsupported für... Können wir mal ausprobieren. Ich glaube Snapshots werden nicht supported fürtemporäre VMs. Können wir mal ausprobieren. So, was wollte ich jetzt zeigen? Mist. Ach so, Cloud-Init.Die VMs werden gestartet und bekommen in ISO eingehängt, wo Cloud-Init-Files drauf sind. Sokonfigurieren die sich nämlich. Das heißt, ich kann hier ins Cloud-Init was reinschreiben.Und theoretisch könnte man hier unten Custom-Commands reinbauen. VM Disk Size als Parameter,das gibt es schon. Das gibt es schon. Guck, du kannst hier Disk angeben, kannst sagen,keine Ahnung, 17 Gigabyte oder so. Oder du benutzt eines von den vorgefertigten Größen,die du mit deiner Tab-Completion kriegst. Was ich eh nice finde, dass das Ding Tab-Completion hat.So, wir gucken mal, ob Snapshots... Ach so, ich bin doof. Jetzt habe ich es wieder gelöscht.Der ist sehr schlau, Max. Super. Erstellt zum Ausprobieren und gleich wieder gelöscht.So, guck mal, ich bin mir nicht sicher, ob Snapshots überhaupt unterstützt werden.Wie machen wir das? Take Snapshot? Nein, nicht Screenshot. Moment. Wo war das noch mal?Nee, Snapshots sind anscheinend nicht möglich für temporäre VMs.Ist auch okay so. Wir müssen es ja nicht übertreiben. Snapshots ist wahrscheinlichecht ein bisschen zu viel des Guten. Ich schreibe es immer auf, falls... Ach ja,und was man sich... Ich will noch eine Timeout-Option. Warten auf Netzwerk. Wie lange?Standardmäßig 45 Sekunden, aber manche Images booten ein bisschen länger. Und vielleicht,da bin ich mir nicht sicher, ob es eine gute Idee ist, Config File Support, dass man so ein paarSachen standardmäßig definieren kann, wie welches Verzeichnis soll benutzt werden oder so was.Doch, habe ich, habe ich. Aber jetzt gibt es den Preis-Champ nicht mehr, das heißt,ich brauche es nicht mehr. Ja. Was ist eine temporäre VM im LibVirt-Umfeld? Das ist eineVM, die du nicht defines, sondern nur createst. Zumindest nennt das LibVirt so. Also wenn du sagst,Create VM, dann ist die nur da bis zum Ausschalten oder bis zum Reboot. Aber wenn du sagst,Define VM, dann speichert er sich die Config und alles dazu und du kannst sie quasi runterfahren,Rebooten, wieder hochfahren. Lizenz festlegen, das könnte man tatsächlich, das wäre vielleichtkeine schlechte Idee. Was ist denn eine temporäre, was ist aus dem Preis-Champ geworden? Der wurdeetwas zu nervig zu maintainen mit den Crawlern für die Shops. Deswegen habe ich das rausgeschmissen.Der ist weg. Also es könnte durchaus sein, dass man hier Custom Commands ausführen kann in diesemCloud-Init. Ich probiere das mal aus. Wir machen jetzt mal Echo 123 nach rootkekel.bin. Oh, dasist eigentlich egal. Wir gucken mal, ob das funktioniert, ob man das so im Cloud-Init ausführenkann. Muss man mal gucken. Dotnet, run, run. Ja, einfach so gucken, ob es geht. Jetzt bin ich malgespannt, ob das funktioniert. Weil wenn das funktioniert, ist das tatsächlich eine guteIdee gewesen, Chet. Da kann man nämlich Custom Commands angeben. Das ist gar nicht so blöd,weil es könnte ja durchaus Custom Cloud-Init-Commands, ja meine ich ja, meine ich ja so was,dass man hier Custom Commands. Custom Cloud-Init funktioniert nicht richtig, weil die Sachen müssen,also Ausnäh muss gesetzt werden, dass das mit der DACP-IP richtig funktioniert. Keys müsseneigentlich auch gesetzt werden, dass das Login richtig funktioniert. Also komplett Custom Cloud-Initist schwierig. Man könnte halt Sachen anhängen lassen. Ja, das wird wahrscheinlich funktionieren.Okay, ist es gestartet? Wir gucken mal. Cut, root, ach so, ja. Rout, kekel, es funktioniert. Nice.Okay, Custom Commands ist schon mal easy. Das können wir schon mal einbauen. Ja, weg damit.Also Custom Commands sollte tatsächlich schon mal relativ gut funktionieren an der Stelle.Da müssen wir uns nur noch die Optionen überlegen. So, wir fangen mal mit was Einfachem an. Ichändere mal gleich am Anfang. Das ist nämlich nur an einer Stelle Megabyte zu Megabyte und dassieht gleich besser aus. Guckt mal. 256 MB und 4000 MB. Da können die Leute wenigstens wasordentlich mit anfangen. Da weiß man wenigstens schon was Sache ist. So, okay, was machen wir jetztals nächstes? Ja, das machen wir jetzt. Weil aktuell kann man sich ja anzeigen lassen,was aktuell schon für VMs laufen. Und da sieht man, es läuft eine, die noch keine IP hat und eswäre ja schon praktisch, wenn es dahinter noch was gäbe, wo dann Status oder sowas steht und dannRunning oder eben Booted oder sowas in der Richtung. Das probieren wir jetzt mal aus.Dann gehen wir mal ins List Command, fügen noch mal neue Tabelle hinzu, neue Spalte,State oder Status. Da gibt es ja irgendwie so eine Eselsbrücke für, um sich das merken zu können.Sprich, bei Hotelzimmern ist, ich kriege es immer aus dem Kopf nicht hin, bei Hotelzimmern istdas Date quasi ob es eine Einzelzimmer, ein Doppelzimmer oder sonst was ist und der Status ist,ob es belegt ist oder nicht. Also gut, keine Ahnung, ob es in dem Fall State oder Status ist,Running, Booted. Tim790, danke schön für den Sub. Okay, dann geben wir doch jetzt hier einfach malaus und gucken, ob das funktioniert, dass wir da jetzt was in die Tabelle mit reiten. Nein,nicht Run, nicht Run, Lists. Gehst du eigentlich auch auf Messen? Auf die Games kommen ab und zu,war ich aber auch schon Jahre nicht mehr. Auf IT-Konferenzen gehe ich nicht. Wüsste ich jetzt auch nicht,warum? Weil die ganzen Talks kann man sich im Internet angucken oder kann ich mir die in Ruhezu Gemüte führen und mir auch nur die Talks raussuchen, auf die ich Bock habe?Okay, das funktioniert. Also in der Tabelle, in der Tabelle kann man noch einen zusätzlichenState reinschreiben. Jetzt ist natürlich die Frage, wie bekommen wir den Status? In dem Fall istglaube ich tatsächlich eher der Status, oder? Mir egal. Wie bekommen wir das raus? Da müssen wirmal in die LibWird-Docs gucken. Und suchen wir mal nach Status. Wir Domain Dirty State.Was? Ne, dann suchen wir nach State. State. Aha. Domain Control State, No State. Wir Domain State.Das klingt doch schon mal ganz gut. Wir Domain State. No State. Running,blocked, paused, shut down, shut down. Genau das will ich haben. Wir Domain State. Okay,wie kriegt man den? Was zum? Okay, was auch immer. Was? Wir connect, get all Domain Stats.Alter, was ist das für eine Signatur, man? Was wollen die von mir?Wir Domain Stats Record Pointer. Pointer, Pointer. Triple Pointer. Pointer? Und ein Pointer auf denPointer und ein Pointer auf den Pointer des Pointers. Alles klar. Exit. Pfeifer. PointerStells. Was wollen die von mir? Wir connect Pointer. Alter, mich interessiert die CPU-Zeitund RAM und so gar nicht. Ich will einfach nur, ob die VM running ist oder nicht. So.Wir Domain Info. Das klingt auch nicht schlecht. Ja, das ist doch nicht schlecht. Woüber gehtman? Wir Domain Info. Wir Domain Get Info. Ja, das klingt doch gut. Das brauchen wir. Wir DomainGet Info. So. Jetzt könnt ihr euch an der Stelle gleich mal angucken, wer vielleicht C-Sharp benutzt,aber noch kein Interop mit C-Libraries gemacht hat in C-Sharp. Da könnt ihr euch das angucken,wie das funktioniert. Da gibt es mittlerweile auch viele Varianten. Mittlerweile ist DLL Importeigentlich gar nicht mehr angesagt, sondern es ist, glaube ich, Library Import mittlerweile,was man verwenden soll, weil DLL Import macht Magic zur Runtime und Library Import macht CodeGeneration zur Kompilzeit. Also theoretisch ist Library Import schneller als DLL Import,aber ich habe Library Import noch nie verwendet. Deswegen. So. Also jetzt müssen wir erst einmalunserem Manage.net Code definieren, wie die Funktion aussieht, die wir in der C-Libraryaufrufen wollen. Es ist ja klar, C-Sharp selbst kann direkt keine C-Funktion aufrufen. Man kannallerdings das definieren und anlegen in C-Sharp und sagen, okay, diese Funktion ist jetzt nichthier definiert, sondern in einer anderen Library. Das funktioniert. Direkt im Source Code sagen,ich will auf eine C-Funktion zugreifen, geht nicht, aber ich kann diese C-Funktion definieren undsagen, die gibt es und dann eben sagen, wo es die gibt und dann kann ich die aufrufen. Dasfunktioniert dann so. WirDomainGetInfo, also Domain, und dann brauchen wir einen Info-Pointer.MonkaS. Was? Einen WirDomainInfo-Pointer brauchen wir dann. WirDomainInfo. WirDomainInfo. Okay,das ist wieder ein Struct. Alles klar. Dann machen wir das mal. Das ist ein Struct. Ein Struct,das sich nennt WirDomainInfo. Was so ein gross geschrieben bliesst. WirDomainInfo mit einem,jetzt müssen wir aufpassen, mit einem Byte als State. Keinem Pointer, einem normalen Byte. Ichkann übrigens hier unten abgucken. Man darf sich nicht verarschen lassen, hier im C-Source Codesteht, dass es ein Character ist. Und in C stimmt das auch. In C ist ein Byte und ein Character imPrinzip das Gleiche. Das ist immer ein Byte. In C Sharp ist das nicht so. In C Sharp ist Byte,ein Byte und Character sind zwei Byte. Warum? Weil Microsoft sich gedacht hat, ein Character in CSharp, also quasi so das Zeichen von einem String, ist zwei Byte groß. Also quasi UTF 16.Allerdings haben die sich das ausgedacht schon zu Zeiten, da gab es UTF 8 Encoding und sowasnoch nicht. Rust zum Beispiel benutzt UTF 8 und das bedeutet, dass alle Character aktuell zumindestzwischen einem Byte und vier Bytes sind. Also wir brauchen ein paar Public State. Dann haben wir alsnächstes, das kann man doch so keiner lesen, wie das hier reinkopiert ist. Also als nächstes habenwir ein Unsigned Long. Ich glaube, das ist Uint. Das reicht an der Stelle. Das ist MaxMem.Ist das nicht sogar das Gleiche mittlerweile? Ein Int und ein Long in C Sharp? Ach nee, ein Intist ein Int 32. Logisch, das andere ist ein Int 64. Ja klar. Long, MaxMem, Used haben wir als nächstes.Also das nächste ist Memory. CPU Time interessiert mich jetzt mal gar nicht. Das ist ein Unsigned Short.Sachen, die die Welt nicht braucht. Und dann gibt es CPU Time. Das ist ein Unsigned Long Long.Was zum Geier ist ein Unsigned... Ist das ein Unsigned Double? Nee, Double ist... Was ist denn Long Long?128 oder wie? Also Int 128 oder was? Oder wie? Dann muss ich dann Uint machen. Ist das...Wir benutzen einfach einen Pointer-Typ dafür, dann ist das auch immer... Obwohl, das ist eigentlich auch blöd.Das ist ja kein Pointer. Okay, was genau, bitteschön, ist ein Unsigned Long Long? 64, ja wie jetzt? Ah,Uint 64. Also ein U Long quasi. Alles klar. Uint, wunderbar, wunderbar, gut. Excellent,wir Domain Interf... Moment, soll nicht wir Domain Interface heißen. Das soll wir Domain Info heißen.Long Long. Gut, das passt so. Unsaved muss hier tatsächlich nichts sein. Und... Moment, wo sind wir?Da sind wir. Wir Domain Info Pointer auf... Auf nennen, wir Domain Info Objekt und nenntsich Info. Okay, mal schauen. Pointer-Tour wird Domain Info... Allocated by the user. Okay,das machen wir. Preis-Champ ist offline, ja, ist er. War gespannt, ob das jetzt funktioniert,was ich da zusammen gewurstet habe. Okay, also wir fragen jetzt für jede VM ab. Interop,Info, Get Domain Info, die Connection-Native-Pointer und jetzt... Und jetzt brauchen wir was?Ein Wir Domain Info... Ein Pointer auf ein Wir Domain Info, Allocated by the user. Okay,also Wir Domain Info. Gleich... Ja, sowas hier quasi. Und dann die Adresse davon. Das müsste jaeigentlich funktionieren. So, und jetzt die Adresse von dem Info-Struct. Funktioniert natürlich nicht.Das wäre auch viel zu einfach, wenn das so gehen würde. So, Pointers can only be used in... Achso,ja, okay. Lul. Unsave. Das ganze Ding ist unsaved, dass es funktioniert. Okay, wunderbar. Ich gebejetzt mal hier nur testweise irgendwas aus. Was ist denn der Return-Code davon? Returns 0 incase of success, minus 1 in case of failure. Okay, dann geben wir mal das Info aus hier. Gucken wirmal. Geben wir jetzt einfach mal State aus und Memory und gucken mal, ob das klappt. Neues Terminalauf CD repos.net run list. Prager. Invalid Domain Pointer. In Wir Domain destroy. Destroy.Oh. Ups. Ups. Einfach mal alles gelöscht. Easy. Ja, gut, das ist natürlich eine blöde Idee gewesen.Ja. Hey, aber es ist nicht gecrashed, ja? Okay, jetzt aber. Invalid Domain Pointer.Ah, Moment. Man soll ja auch... Haha. Ich bin ja auch falsch. Ich übergebe ja auch das Falsche.Moment, wir haben Followers Only Mode an? Was war denn? Warum haben wir Followers Only Mode an? Wer hatdann so was gemacht? Was ist denn hier los? 1KS. War oft 10 Minuten. Ja, wundere mich. Ichhabe mich schon gewundert, warum keiner was schreibt. Spambot, vielleicht, ja. So. Oh fuck,wir machen. Wir machen gerade MMO Kreiselgrind. Die machen MMO Kreiselgrind ohne mich. Da mussich jetzt eigentlich hin. Okay, Moment. Zumindest, dass das funktioniert. Invalid Domain...Zumindest, okay. Das können wir jetzt machen. Wir Domain... Okay, wir brauchen die Domain ID.Die brauchen wir von der... Ja, die VMID brauchen wir. Genau, VMID. Und dann funktioniert das auch.Was ist der MMO Kreiselgrind? Der MMO Kreiselgrind. Ich muss PVP machen. Die anderen 5 Leute sindauch alle am Start. So, das scheint zu funktionieren. PVP nicht. Nicht World of Warcraft PVP. Wirspielen hier eben... Wir spielen Dark, FreeShard. Spielen wir, ja. Das ist noch deutlich älter alsWorld of Warcraft. Okay, das funktioniert schon mal. Also, haben wir heute schon was gelernt.Leider muss ich jetzt MMO Kreiselgrind machen, Leute. Wir sehen uns im nächsten Stream. Da machen wirdann wirklich was. Ich habe ja heute im Prinzip eineinhalb Stunden geschwätzt und jetzt habenwir nichts gemacht. Also, Kreiselgrind startet. Ich muss weg. Bis dann. Macht's gut. See you.", "segments": [{"id": 1, "start": 90.0, "end": 112.52, "text": "Ich habe heute endlich mal alles von dem iPhone, was ich von der Firma hatte umgestellt auf"}, {"id": 2, "start": 112.52, "end": 117.24, "text": "mein neues iPhone, weil das andere muss ich abgeben übermorgen."}, {"id": 3, "start": 117.24, "end": 128.88, "text": "Es nähert sich ja dem Ende alles. Mir ist wieder mal aufgefallen, wie abartig es ist,"}, {"id": 4, "start": 128.88, "end": 136.16, "text": "Daten vom iPhone runterzubekommen. Also was ja in der Regel recht gut geht,"}, {"id": 5, "start": 136.16, "end": 145.76, "text": "ist wenn man das gleich beim Setup macht, die einen Sachen vom alten aufs neue iPhone zu kopieren."}, {"id": 6, "start": 145.96, "end": 156.28, "text": "Aber es funktioniert ja ganz gut. Aber irgendwie die Sachen runterzubekommen,"}, {"id": 7, "start": 156.28, "end": 162.12, "text": "das ist wirklich immer ein bisschen abartig. Da kann ich euch was Nices zu zeigen,"}, {"id": 8, "start": 162.12, "end": 165.44, "text": "falls ihr das nicht kennt. Ich mache schon mal die VM an, weil die brauchen wir heute eh."}, {"id": 9, "start": 175.76, "end": 179.4, "text": "Aber eh gleich, da kann ich schon mal Updates und sowas machen, weil Arch by the way immer"}, {"id": 10, "start": 179.4, "end": 185.96, "text": "Updates hat. Schon das neue Fireship Video gesehen? Nee. Aber lasst mich raten, wahrscheinlich wieder"}, {"id": 11, "start": 185.96, "end": 189.68, "text": "AI oder? Es wird langsam langweilig. Ich habe langsam keinen Bock mehr das zu gucken."}, {"id": 12, "start": 189.68, "end": 201.72, "text": "Wenn ich das, wenn ich das, kann er noch was anderes als AI Videos machen. So langsam ist"}, {"id": 13, "start": 201.72, "end": 208.48, "text": "irgendwann auch mal wieder gut. I literally connected my brain to GPD with JavaScript."}, {"id": 14, "start": 208.48, "end": 221.88, "text": "Javascript, keck, JS. So ich muss noch ein bisschen warten, bis Twitch kapiert hat,"}, {"id": 15, "start": 221.88, "end": 225.12, "text": "dass ich online bin. Der Stream ist noch nicht richtig angelaufen. Ich bin mir nicht sicher,"}, {"id": 16, "start": 225.12, "end": 230.36, "text": "ob der Bot im Discord schon was gecheckt hat. Was ist C-Sharpen? Was ist .NET?"}, {"id": 17, "start": 230.36, "end": 237.2, "text": "Also ich könnte jetzt sagen, das ist wahrscheinlich besser, wenn du das 10"}, {"id": 18, "start": 237.2, "end": 240.44, "text": "Sekunden googelst und eine viel bessere Erklärung hast. Aber ich sage es dir trotzdem,"}, {"id": 19, "start": 240.44, "end": 244.84, "text": "C-Sharpen ist eine Programmiersprache und .NET ist die Laufzeit. Das stimmt ja so"}, {"id": 20, "start": 244.84, "end": 250.08, "text": "direkt gar nicht mehr. .NET ist das Framework drum herum. Lernen wir es mal so und C-Sharpen"}, {"id": 21, "start": 250.08, "end": 257.64, "text": "ist eine Programmiersprache. Aber wenn du es genauer wissen willst, ich meine, wir basteln"}, {"id": 22, "start": 257.64, "end": 261.24, "text": "heute ein bisschen was in C-Sharpen, aber ich glaube nicht, dass das, wenn man die Sprache"}, {"id": 23, "start": 261.24, "end": 268.04, "text": "noch nicht gesehen hat, sondern nicht erhellend sein wird. Aber gut, jetzt weißt du Bescheid."}, {"id": 24, "start": 268.04, "end": 277.84, "text": "Im Prinzip ist .NET und C-Sharpen, falls du Java kennst, Java ist die Programmiersprache und"}, {"id": 25, "start": 277.84, "end": 284.32, "text": "JVM ist die Runtime. So ist das bei .NET auch. .NET ist die Runtime und C-Sharpen ist die"}, {"id": 26, "start": 284.32, "end": 290.6, "text": "Programmiersprache. Dementsprechend gibt es auf .NET Basis auch noch mehr Programmiersprachen."}, {"id": 27, "start": 290.6, "end": 295.8, "text": "Also du kannst beispielsweise F-Sharpen machen. Da stehen ja manche Leute drauf,"}, {"id": 28, "start": 295.8, "end": 305.28, "text": "die finden das furchtbar geil. So funktionale Dinger. Dann gibt es, was gibt es noch für"}, {"id": 29, "start": 305.28, "end": 309.36, "text": "bedeutende .NET basierte Sprachen? Das kommt mir nicht mit vb.net,"}, {"id": 30, "start": 309.44, "end": 313.52, "text": "das interessiert doch kein Mensch mehr. Was gibt es denn da großartig noch?"}, {"id": 31, "start": 313.52, "end": 322.92, "text": "Was gibt es für große Sprachen auf der .NET Runtime? Eigentlich nicht so viel,"}, {"id": 32, "start": 322.92, "end": 329.8, "text": "oder? Es gab mal den Versuch, Python und Ruby drauflaufen zu lassen, das war aber eher cringe."}, {"id": 33, "start": 329.8, "end": 337.56, "text": "ASP.NET ist keine eigene Sprache, ASP.NET ist das Web-Framework für .NET bzw. was man"}, {"id": 34, "start": 337.56, "end": 340.32, "text": "hauptsächlich in C-Sharp programmiert. Was man theoretisch mit F-Sharp aber auch"}, {"id": 35, "start": 340.32, "end": 346.52, "text": "programmieren könnte, ist eigentlich eher so eine Library für Web-Anwendungen. Also ich glaube,"}, {"id": 36, "start": 346.52, "end": 353.0, "text": "auf .NET Basis ist das größte wirklich C-Sharp und F-Sharp. Die anderen Dinger,"}, {"id": 37, "start": 353.0, "end": 356.0, "text": "die es da vielleicht für die Runtime gibt, sind glaube ich eher nicht so bedeutend."}, {"id": 38, "start": 356.0, "end": 361.36, "text": "Bei Java gibt es mehr. Auf JVM Basis gibt es mehr. Da gibt es Kotlin, da gibt es Java,"}, {"id": 39, "start": 361.36, "end": 370.04, "text": "da gibt es Erlang auf JVM Basis. Da gibt es Groovy, da gibt es jede Menge Sachen."}, {"id": 40, "start": 370.04, "end": 375.72, "text": "Mein Chef will, dass ich VB anstehe. Jetzt ernsthaft, was ist denn mit dem los?"}, {"id": 41, "start": 375.72, "end": 388.8, "text": "Also entweder ist der Ultra-Boomer und kennt nur irgendwie Rishal Basic früher aus Excel oder"}, {"id": 42, "start": 389.76, "end": 395.56, "text": "oder er ist komplett planlos. Ich glaube, Microsoft supportet VB gar nicht mehr richtig."}, {"id": 43, "start": 395.56, "end": 398.92, "text": "Bin mir gar nicht sicher, ob es dazu irgendwie in den letzten Jahren noch"}, {"id": 44, "start": 398.92, "end": 409.12, "text": "nennenswert Updates gekriegt hat. Ich glaube gar nicht. VB.NET still supportet. Gucken wir"}, {"id": 45, "start": 409.12, "end": 416.76, "text": "doch mal danach. Rishal Basis, exact support for Windows. Ja, das meine ich. VB.NET ist"}, {"id": 46, "start": 416.76, "end": 423.36, "text": "done, not dead. Microsoft hat gesagt, es gibt keine neuen Features mehr, aber es ist nicht dead."}, {"id": 47, "start": 423.36, "end": 429.92, "text": "Logisch, Microsoft Logik. Wir lassen es links liegen und supporten es nicht mehr bzw. sagen"}, {"id": 48, "start": 429.92, "end": 433.4, "text": "sie ja nicht. Wir lassen es links liegen und updaten es nicht mehr, aber es ist nicht dead."}, {"id": 49, "start": 433.4, "end": 443.64, "text": "Ja, natürlich Microsoft. Five-Hat-Time, ganz klar. Also VB, es wird Zeit, Leute. Es wird Zeit für"}, {"id": 50, "start": 443.64, "end": 448.76, "text": "Rust.NET, was keinen Sinn ergibt, ehrlich gesagt. Rust.NET würde absolut keinen Sinn ergeben,"}, {"id": 51, "start": 448.76, "end": 454.24, "text": "weil Rust hauptsächlich dafür erstellt wurde, nicht irgendwie, um eine besonders schöne Sündags zu"}, {"id": 52, "start": 454.24, "end": 461.6, "text": "haben oder sowas, sondern um unmanaged halbwegs safe hinzubekommen. Und das würde ja keinen Sinn"}, {"id": 53, "start": 461.6, "end": 468.76, "text": "machen. Rust in der managed Umgebung, also das widerspricht sich komplett. Echt, gibt es,"}, {"id": 54, "start": 469.24, "end": 479.8, "text": "ok, das gucken wir jetzt. Gibt es da neue Features? Gibt es da wirklich neue Features? Nee,"}, {"id": 55, "start": 479.8, "end": 485.44, "text": "nee, nee, gibt es nicht. Zumindest sagt das Wikipedia und Wikipedia im Prinzip meistens"}, {"id": 56, "start": 485.44, "end": 494.92, "text": "recht. Gucken wir mal. Preview 7, nein, nein, Preview 1. Gibt es nicht sogar Preview 2 mittlerweile"}, {"id": 57, "start": 494.92, "end": 512.88, "text": "seit einer Woche oder so? Also hier taucht WhistleBasic nicht drin auf und hier taucht"}, {"id": 58, "start": 512.88, "end": 520.88, "text": "WhistleBasic auch nicht drin auf. Also ich würde mal sagen, nee, gibt es nicht. So,"}, {"id": 59, "start": 520.92, "end": 531.8, "text": "was haben wir hier? Ah, da will geupdated werden. PNPM wird geupdated. Ja, da kann ich nicht nein"}, {"id": 60, "start": 531.8, "end": 539.04, "text": "sagen, wenn PNPM geupdated wird. Cac Javascript. Außerdem muss ich eh warten, bis der Stream richtig"}, {"id": 61, "start": 539.04, "end": 544.56, "text": "angelaufen ist. Ich weiß, es ist Montagnachmittag, fast schon Abend, da sitzen die meisten Leute jetzt"}, {"id": 62, "start": 544.56, "end": 549.6, "text": "beim Essen oder fahren gerade heim oder sowas. Es sind jetzt eh noch nicht so viele da. Aber"}, {"id": 63, "start": 549.6, "end": 561.24, "text": "muss man Twitch ein bisschen Zeit geben. Du musst gerade VB lernen, weil ich Exist-Datenbank,"}, {"id": 64, "start": 561.24, "end": 566.28, "text": "also ich weiß ja gar nicht, was ich da schlimmer finde. Ich weiß ja gar nicht,"}, {"id": 65, "start": 566.28, "end": 571.76, "text": "was ich da schlimmer finden soll. Dass du was mit Exist-Datenbanken machen musst. Was ist,"}, {"id": 66, "start": 571.76, "end": 584.36, "text": "Leute, ich habe eine wirklich ernst gemeinte Frage. Wann macht es Sinn Exist-Datenbanken zu"}, {"id": 67, "start": 584.36, "end": 601.32, "text": "benutzen? Also ich habe noch nie verstanden, warum jemand eine Exist-Datenbank, ich meine,"}, {"id": 68, "start": 601.32, "end": 607.28, "text": "den Kram gibt es seit irgendwie 30 Jahren und es wird benutzt. Also es muss ja schon irgendwie"}, {"id": 69, "start": 607.28, "end": 615.8, "text": "ein validen Grund, warum man sich für Exist-Datenbanken entscheidet. Aber wann? Wann ist das? Ja,"}, {"id": 70, "start": 615.8, "end": 620.24, "text": "genau, zumal man könnte auch einfach SQLite benutzen, dann hat man wenigstens was Gescheites,"}, {"id": 71, "start": 620.24, "end": 627.64, "text": "was man auch so verwenden kann. Vielleicht, weil das eine UI dabei hat, könnte das sein,"}, {"id": 72, "start": 627.64, "end": 634.88, "text": "dass das vielleicht daran liegt, dass das eine UI dabei hat und die Leute deswegen früher immer"}, {"id": 73, "start": 635.36, "end": 641.64, "text": "zum Einstieg dann nice fanden oder... Also wann verwendet man Exist-Datenbanken? Ich weiß wirklich"}, {"id": 74, "start": 641.64, "end": 656.04, "text": "nicht. Ja, keine Ahnung. Also wenn die User selbst was bauen wollen... Ja, aber die können"}, {"id": 75, "start": 656.04, "end": 660.44, "text": "das ja in Excel machen. Also was bietet Exist mehr als Excel für so eine 0815 User?"}, {"id": 76, "start": 664.88, "end": 674.08, "text": "Ja, aber wann? Also wann ist es eine gute Idee? Ich verstehe das bis heute nicht. Also ich"}, {"id": 77, "start": 674.08, "end": 679.76, "text": "verstehe bis heute die Daseinsberechtigung von Exist nicht. Ich verstehe übrigens auch viele"}, {"id": 78, "start": 679.76, "end": 686.72, "text": "Office-Programme die Daseinsberechtigung nicht. Also Excel kann ich noch am ehesten nachvollziehen."}, {"id": 79, "start": 686.72, "end": 693.4, "text": "Excel ist keine Datenbank. Ja gut, aber was macht denn der 0815 Anwender,"}, {"id": 80, "start": 693.4, "end": 700.16, "text": "der angeblich die IT umgehen möchte und deswegen Exist verwendet, in Exist dann mehr als in Excel?"}, {"id": 81, "start": 700.16, "end": 710.64, "text": "Also ich sehe den Anwendungszweck immer noch nicht. Eingabe, Masken, UI, ja das machen die"}, {"id": 82, "start": 710.64, "end": 715.48, "text": "Leute aber auch schon in Excel. Ich weiß nicht, keine Ahnung, ich verstehe den Anwendungszweck"}, {"id": 83, "start": 715.48, "end": 721.52, "text": "von Exist nicht. Zumal es so etwas wie SQLite gibt, was einfach wunderbar funktioniert und ich"}, {"id": 84, "start": 721.52, "end": 727.36, "text": "überhaupt nicht wüsste wozu man. Kann man überhaupt ordentlich SQL machen mit Exist? Geht das? Ich"}, {"id": 85, "start": 727.36, "end": 732.08, "text": "muss gestehen, ich habe noch nie in meinem Leben Exist verwendet. Keine Ahnung, es kann sein,"}, {"id": 86, "start": 732.08, "end": 738.32, "text": "dass ich in der Schule mal irgendwie was kleines für Exist gebaut habe, weil der Lehrer das wollte,"}, {"id": 87, "start": 738.32, "end": 743.88, "text": "aber also ja vielleicht, aber ansonsten habe ich nie Exist verwendet. Ich habe das auch nicht vor,"}, {"id": 88, "start": 743.88, "end": 764.0, "text": "ich wüsste auch gar nicht warum. Na gut, wenn man das benutzen muss, muss ich ja irgendjemand"}, {"id": 89, "start": 764.0, "end": 767.56, "text": "überlegt haben, warum. Also ich verstehe es immer noch nicht, keine Ahnung warum man Exist braucht."}, {"id": 90, "start": 767.56, "end": 782.36, "text": "Selfmade Eyes, Dankeschön für den Sub. Ahja. Ich habe eine kurze Frage, wie oft kann man deiner"}, {"id": 91, "start": 782.36, "end": 789.6, "text": "Meinung nach eine Gehaltserlöhung verlangen? Wie viel Prozent? Naja, immer. So öfters, also ich"}, {"id": 92, "start": 789.6, "end": 795.92, "text": "meine es ist nicht im Minutentakt oder so, aber du kannst dich schon öfters mal daran erinnern,"}, {"id": 93, "start": 795.92, "end": 801.56, "text": "dass man wieder Zeit wird, gerade in aktuellen Zeiten, wo es ja quasi wöchentlich teurer wird."}, {"id": 94, "start": 801.56, "end": 809.12, "text": "Also die werden dir natürlich erzählen, ah aktuell ist ein ganz schlechter Zeitpunkt,"}, {"id": 95, "start": 809.12, "end": 817.2, "text": "weil Corona und wirtschaftliche Lage und Inflation, gerade deswegen braucht man ja eine,"}, {"id": 96, "start": 817.2, "end": 823.76, "text": "ja und und Geschäfte wegen Lockdown, die jetzt immer noch schlecht laufen und dann,"}, {"id": 97, "start": 823.76, "end": 828.84, "text": "ah ganz furchtbar schlimm. Also es ist immer schlecht, also das war zumindest so die Standard"}, {"id": 98, "start": 828.84, "end": 832.76, "text": "Antwort, die ich immer bekommen habe. Standardmäßig, wenn sie keinen Bock hatten,"}, {"id": 99, "start": 832.76, "end": 838.44, "text": "sich damit auseinanderzusetzen, deswegen muss man auch hartnäckig sein, war immer so eine 0815"}, {"id": 100, "start": 838.44, "end": 843.28, "text": "Ausrede, das ist gerade ganz furchtbar schlecht, ist aber egal. Fragen kannst du laufen, also ich"}, {"id": 101, "start": 843.28, "end": 849.84, "text": "meine wie ich es da nicht im 5-Minuten-Takt oder so. Aber wenn du da, also mindestens einmal im Jahr,"}, {"id": 102, "start": 854.6, "end": 859.64, "text": "ja mindestens, mindestens einmal im Jahr, es spricht eigentlich aus meiner Sicht gar"}, {"id": 103, "start": 859.64, "end": 865.12, "text": "nichts dagegen, das sogar öfters mal anzusprechen. Du musst ja nicht immer so super offiziell"}, {"id": 104, "start": 865.12, "end": 870.08, "text": "Chef lassen, Einladung machen, wir müssen übers Gehalt reden oder so, kannst ja schon öfters mal"}, {"id": 105, "start": 870.08, "end": 877.84, "text": "sagen. Wir hatten mal wieder Zeit, vor allem bei so tollen Sachen, die die Simon, nee,"}, {"id": 106, "start": 877.84, "end": 888.04, "text": "Simonu, vor allem so tolle Sachen, die man macht. Und wenn mal wieder was besonders toll gelaufen ist,"}, {"id": 107, "start": 888.04, "end": 893.64, "text": "kann man durchaus auch sagen, ja wird mal Zeit wieder für, also es schadet nichts die permanent"}, {"id": 108, "start": 893.64, "end": 898.44, "text": "darauf vorzubereiten, dass es mal wieder an der Zeit ist. Wie viel Prozent ist schwer zu sagen,"}, {"id": 109, "start": 898.44, "end": 906.04, "text": "das hängt so ein bisschen vom Umfeld ab. Ich meine natürlich am besten ist es, du sagst,"}, {"id": 110, "start": 907.04, "end": 912.92, "text": "du bekommst am Ende das womit du zufrieden bist. Taktisch gesehen ist natürlich immer sinnvoll,"}, {"id": 111, "start": 912.92, "end": 919.12, "text": "man fragt nach deutlich mehr als mit was man zufrieden ist, aber das kannst du ja schlecht im"}, {"id": 112, "start": 919.12, "end": 925.28, "text": "Wochentakt machen. Aber insgesamt, je nachdem wann du was zuletzt bekommen hast, ist natürlich"}, {"id": 113, "start": 925.28, "end": 930.84, "text": "relevant, also wenn du jetzt vor einem halben Jahr was gekriegt hast und willst jetzt 30% mehr,"}, {"id": 114, "start": 930.84, "end": 935.16, "text": "dann würde ich vielleicht sagen, also wenn du jetzt nicht gerade irgendwie eine neue Position"}, {"id": 115, "start": 935.16, "end": 942.36, "text": "hast, wo du es dann eh neu verhandelt, vielleicht ein bisschen sportlich, am Ende ist wichtig,"}, {"id": 116, "start": 942.36, "end": 947.44, "text": "dass du damit halbwegs zufrieden bist. Und gerade in aktuellen Zeiten, wenn es jetzt im letzten"}, {"id": 117, "start": 947.44, "end": 951.8, "text": "Jahr nichts gegeben hat, würde ich da jetzt auch nicht anfangen mit irgendwie 3-4% oder so ein"}, {"id": 118, "start": 951.8, "end": 956.88, "text": "Blödsinn, dann kannst du gleich ordentlich sagen. Ich meine, die wissen auch, dass es 10% teurer"}, {"id": 119, "start": 956.96, "end": 961.36, "text": "wird pro Jahr. Und wenn es letztes Jahr nichts gegeben hat, sind es schon mal mindestens 10%,"}, {"id": 120, "start": 961.36, "end": 967.4, "text": "die du mehr haben willst. Eher mehr, weil am Ende sollen es ja 10% mindestens sein. Also"}, {"id": 121, "start": 967.4, "end": 973.84, "text": "willst du wahrscheinlich mindestens 20-25% mehr, was schwachsinnig ist, aber das werden die dir,"}, {"id": 122, "start": 973.84, "end": 980.52, "text": "also 25% werden die dir nicht geben, aber sie können ja einfach nein sagen und dann landet"}, {"id": 123, "start": 981.0, "end": 987.64, "text": "10%. Also es ist nicht schlimm. Was soll dir passieren? Wenn du was Unverschämtes sagst,"}, {"id": 124, "start": 987.64, "end": 991.36, "text": "lacht man mal drüber und dann kommt man irgendwie auf was Realistisches. Ich meine,"}, {"id": 125, "start": 991.36, "end": 996.56, "text": "was soll passieren, wenn du was höre, wenn du was zu hohes sagst? Die sagen ja nicht,"}, {"id": 126, "start": 996.56, "end": 1002.76, "text": "oder Simon, der macht gute Arbeit, der will mehr Geld haben, jetzt bin ich aber sauer,"}, {"id": 127, "start": 1002.76, "end": 1007.64, "text": "der hat nach zu viel mehr Geld gefragt, jetzt schmeiße ich den raus. Also das ergibt ja keinen"}, {"id": 128, "start": 1007.64, "end": 1012.76, "text": "Sinn. Die werden doch wahrscheinlich sagen, nee, gibt's nicht, aber ein bisschen mehr sagen,"}, {"id": 129, "start": 1012.76, "end": 1018.28, "text": "ist auf jeden Fall nicht verkehrt. Sag einfach mal das Doppelte von dem, womit du zufrieden bist."}, {"id": 130, "start": 1018.28, "end": 1039.72, "text": "Naja, das kann auch funktionieren, wobei das natürlich ein gewisses Risiko ist."}, {"id": 131, "start": 1039.72, "end": 1046.28, "text": "Das kann auch, du kannst natürlich auch sagen, Jungs, also wenn du eh keinen Bock mehr auf den"}, {"id": 132, "start": 1046.32, "end": 1052.72, "text": "Laden hast, kannst du natürlich auch sagen, Jungs, also wenn es jetzt nicht mehr Geld gibt, bin ich"}, {"id": 133, "start": 1052.72, "end": 1057.56, "text": "weg. Entweder machen sie es oder nicht, aber dann musst du halt im Zweifelsfall auch sagen und"}, {"id": 134, "start": 1057.56, "end": 1062.92, "text": "Tschüss. Weil das finde ich immer ein bisschen blöd, wenn man das so als Druckmittel verwendet,"}, {"id": 135, "start": 1062.92, "end": 1065.84, "text": "so nach dem Motto, aha, dann bin ich weg und dann bin ich gar nicht mehr. Also wenn schon,"}, {"id": 136, "start": 1065.84, "end": 1071.8, "text": "am besten in Kombination, man hat sich schon mal umgeguckt und sagt dann, Jungs, ich hau ab und"}, {"id": 137, "start": 1071.8, "end": 1075.2, "text": "wenn sie dann ankommen mit, willst du nicht 30 Prozent mehr verdienen oder irgendwas,"}, {"id": 138, "start": 1075.2, "end": 1080.8, "text": "was halt lukrativ ist, weil die Sachen, die dich nerven, sind ja immer noch da. Ja gut,"}, {"id": 139, "start": 1080.8, "end": 1092.04, "text": "kann es immer noch da bleiben. Aber es schadet durchaus nicht, sich umzugucken. Das ist immer"}, {"id": 140, "start": 1092.04, "end": 1097.36, "text": "sinnvoll zu wissen, was angesagt ist. Also gerade so mal ein bisschen links und rechts geguckt,"}, {"id": 141, "start": 1097.36, "end": 1106.24, "text": "ein bisschen links und rechts geguckt, also sprich, was bieten Unternehmen bei dir in der Umgebung an?"}, {"id": 142, "start": 1120.24, "end": 1123.68, "text": "Ja, also sprich, was bieten die Konkurrenz bei dir an, ist ja sicherlich nicht verkehrt."}, {"id": 143, "start": 1123.68, "end": 1136.8, "text": "Wahrscheinlich sogar besser. Ja, das ist schwer zu sagen. Also ich würde mir ja nicht anmaßen,"}, {"id": 144, "start": 1136.8, "end": 1141.08, "text": "das einschätzen zu können, aber man muss ja auch sagen, erstens in der IT, allein wenn die Leute"}, {"id": 145, "start": 1141.08, "end": 1145.64, "text": "up to date bleiben, auch wenn sie nicht mehr Aufgaben übernehmen, aber wenn sie einfach nur"}, {"id": 146, "start": 1145.64, "end": 1152.0, "text": "up to date bleiben, haben sie ja quasi schon einen Mehrwert für die Firma, den man ja durchaus auch"}, {"id": 147, "start": 1152.0, "end": 1159.92, "text": "entlohnen kann. Und die Firma kann ja nach wie vor die Arbeit zu Geld machen und wahrscheinlich"}, {"id": 148, "start": 1159.92, "end": 1165.52, "text": "mittlerweile dank Inflation zumindest in reinen Zahlen auch zu mehr Geld. Also allein schon deswegen,"}, {"id": 149, "start": 1165.52, "end": 1171.48, "text": "selbst wenn du die gleiche Arbeit machst, eure Sachen einfach am Laufen hältst, die gleichen"}, {"id": 150, "start": 1171.48, "end": 1176.08, "text": "Sachen wie vor 3-4 Jahren und die nächsten 3-4 Jahre das gleiche, sogar das, die Firma wird mehr"}, {"id": 151, "start": 1176.08, "end": 1183.28, "text": "Geld dafür verlangen, für ihre Dienstleistung, für ihren Service und allein schon deswegen bringst"}, {"id": 152, "start": 1183.28, "end": 1191.88, "text": "du der Firma mehr Geld. Also allein schon deswegen kannst du mehr Geld fordern. Wir suchen dich,"}, {"id": 153, "start": 1191.88, "end": 1202.48, "text": "bewirb dich. Warum soll ich mich da, ne Moment, nicht, deine Aufgaben, C++, ach so, 3D Software,"}, {"id": 154, "start": 1202.96, "end": 1208.84, "text": "das ist ja gar nicht meins. Reddit und Steam sind dein Zuhause. Raspberry Pi ist nicht nur ein"}, {"id": 155, "start": 1208.84, "end": 1216.28, "text": "Dessert für dich, das ist dir vertraut wie Counter-Strike. Bios Bernd, cringe Anzeige,"}, {"id": 156, "start": 1216.28, "end": 1223.32, "text": "Alter. Bios Bernd, ja, so will ich auch immer genannt werden. Wer von euch möchte nicht auch"}, {"id": 157, "start": 1223.32, "end": 1234.12, "text": "gerne der Bios Bernd sein? Kann man nicht C++ auch ins .NET kompilen? Ja, ne, ne, kann man nicht,"}, {"id": 158, "start": 1234.12, "end": 1243.76, "text": "also es gab mal oder gibt es noch, aber das ist ziemlich sinnlos. Es gibt so ein C++ Interop-Layer"}, {"id": 159, "start": 1243.76, "end": 1250.04, "text": "von Microsoft, da haben die die C++-Sündags erweitert. Ich bin mir gar nicht sicher,"}, {"id": 160, "start": 1250.04, "end": 1263.44, "text": "wie der Kram hieß. C++ CLI heißt das Ding, hat nichts mit Command-Line-Interface zu tun."}, {"id": 161, "start": 1263.44, "end": 1271.96, "text": "Das gab es mal und gibt es immer noch von Microsoft. Das war mal der Versuch bzw. das"}, {"id": 162, "start": 1271.96, "end": 1276.72, "text": "Entgegenkommen von Microsoft zur damaligen Zeit, wo halt vieles, gerade an Windows-Software,"}, {"id": 163, "start": 1276.72, "end": 1286.08, "text": "für C++ entwickelt war, die irgendwie besseren Interop in C++ mit Managed Languages machen zu"}, {"id": 164, "start": 1286.08, "end": 1291.12, "text": "können. Das hat sich nie großartig durchgesetzt. Das ist in .NET auch nicht mehr drin, soweit ich"}, {"id": 165, "start": 1291.12, "end": 1296.32, "text": "weiß, und ist eh Windows-Only. Also das kannst du eigentlich komplett vergessen und es interessiert"}, {"id": 166, "start": 1296.32, "end": 1304.84, "text": "Microsoft selbst nicht mehr. Ich weiß, dass Frostbite ursprünglich, also die Battlefield-Engine und ja"}, {"id": 167, "start": 1305.44, "end": 1314.6, "text": "Need for Speed und alles mögliche, dass Frostbite einiges in CLI C++ Interop gemacht hat. Die"}, {"id": 168, "start": 1314.6, "end": 1320.12, "text": "hatten wohl früher halt ihr altes Zeug in C und ihr neues Zeug, der Editor und alles, das war"}, {"id": 169, "start": 1320.12, "end": 1326.36, "text": "wohl in C-Sharp und um das zu verbinden, haben sie wohl irgendwelchen C++ CLI Interop-Shit gemacht."}, {"id": 170, "start": 1326.36, "end": 1330.12, "text": "Vielleicht eines der Gründe und vielleicht auch eines der abschreckenden Beispiele,"}, {"id": 171, "start": 1330.12, "end": 1333.84, "text": "warum man es nicht verwenden sollte. Vielleicht ist das eines der Gründe, warum heute keine Sauma"}, {"id": 172, "start": 1333.84, "end": 1344.28, "text": "durchblickt, wie Frostbite eigentlich funktioniert. Was hältst du von Gehaltsportalen im Internet,"}, {"id": 173, "start": 1344.28, "end": 1352.76, "text": "die Geldrasche immer? Ich glaube, ich hab mir noch nie, mir fällt gar kein Gehaltsportal ein."}, {"id": 174, "start": 1352.76, "end": 1358.92, "text": "Also wir haben mal lustigerweise so einen Test, ein paar Steps down gemacht vor ein paar Jahren"}, {"id": 175, "start": 1359.16, "end": 1365.32, "text": "und das war komplett pepega, was da rausgekommen ist. Also das einfachste, was du wahrscheinlich"}, {"id": 176, "start": 1365.32, "end": 1372.12, "text": "machen kannst, ist mal bei deinen Kollegen fragen, was die denn so verdienen. Also du musst dich jetzt"}, {"id": 177, "start": 1372.12, "end": 1375.12, "text": "nicht neben den Typen setzen und sag mal, Alter, wie viel Kohle kommt im Monat rüber, aber wenn"}, {"id": 178, "start": 1375.12, "end": 1379.08, "text": "du dich da mit Leuten ganz gut verstehst, kannst du die ja durchaus mal fragen, sag mal, wie sind"}, {"id": 179, "start": 1379.08, "end": 1383.48, "text": "das bei dir eigentlich? Weil im Endeffekt, also es ist nicht verboten, drüber zu reden, das muss man"}, {"id": 180, "start": 1383.56, "end": 1393.96, "text": "auch sagen. Es wird immer so getan, so nach dem Motto, oh, das wird nicht gerne gesehen und sonst"}, {"id": 181, "start": 1393.96, "end": 1400.84, "text": "was. Das ist vollkommen egal, das ist erlaubt. Es gibt ganz, ganz seltene Sachen, wo das aus"}, {"id": 182, "start": 1400.84, "end": 1405.4, "text": "begründeten, also normalerweise darf das auch gar nicht im Vertrag drinstehen, dass du nicht"}, {"id": 183, "start": 1405.4, "end": 1411.76, "text": "drüber reden darfst, aber es gibt Wohlstellen, da ist das begründet drin und aber das ist bei 99,9"}, {"id": 184, "start": 1412.32, "end": 1417.76, "text": "nicht der Fall. Also du kannst einfach mal deine Kollegen fragen, wie es da aussieht."}, {"id": 185, "start": 1419.76, "end": 1427.76, "text": "Ja, sehe ich genauso. Bist du schon auf der neuen Arbeit? Nee, noch nicht. Nächste Woche. Nächste"}, {"id": 186, "start": 1427.76, "end": 1434.48, "text": "Woche um die Zeit. Ja, nächste Woche um die Zeit war schon ein Tag da. Zwei Tage, zwei Tage. Montag,"}, {"id": 187, "start": 1434.48, "end": 1442.96, "text": "Montag und Dienstag. Ja. Also ich würde ganz ehrlich, frag mal doch die anderen Leute bei dir,"}, {"id": 188, "start": 1442.96, "end": 1447.28, "text": "die ähnliche Aufgaben haben, was bei denen so ist. Im Endeffekt, unterm Strich bringt es euch"}, {"id": 189, "start": 1447.28, "end": 1458.08, "text": "wahrscheinlich beiden was, wenn ihr euch da mal kurz schließt. Ja, also wenn du, wenn er das weiß von"}, {"id": 190, "start": 1458.08, "end": 1462.28, "text": "dir und du das weißt von ihm, vielleicht kann er was besseres rausholen, vielleicht kannst du"}, {"id": 191, "start": 1462.32, "end": 1467.2, "text": "noch was besseres rausholen. Im Zweifelsfall ist es auch gut, wenn sich die Leute zumindest einig"}, {"id": 192, "start": 1467.2, "end": 1471.24, "text": "sind, dass die wissen, hey, wenn wir jetzt nicht auf die Leute aufpassen, wenn uns zwei abhauen,"}, {"id": 193, "start": 1471.24, "end": 1475.76, "text": "im Zweifelsfall dann ist ganz beschissen. Also es schadet eigentlich nichts darüber zu reden. Ich"}, {"id": 194, "start": 1475.76, "end": 1480.72, "text": "finde es auch überhaupt nicht verwerflich, auch wenn immer so getan wird, aber im Prinzip hilft,"}, {"id": 195, "start": 1480.72, "end": 1484.56, "text": "dass nur deinem Arbeitgeber weniger bezahlen zu müssen, wenn ihr nicht drüber redet."}, {"id": 196, "start": 1484.56, "end": 1497.56, "text": "Ja, hyped, hyped. Ich freue mich drauf, ja. Ich freue mich drauf. Ich bin wirklich gespannt"}, {"id": 197, "start": 1497.56, "end": 1502.32, "text": "drauf, wie es da ist. Beziehungsweise, ja gut, wie es da ist, das werde ich wahrscheinlich erst"}, {"id": 198, "start": 1502.32, "end": 1505.48, "text": "nach so zwei, drei Monaten so wirklich gut einschätzen können. Aber ich bin wirklich"}, {"id": 199, "start": 1505.48, "end": 1509.92, "text": "gespannt drauf und ich freue mich schon drauf. Ich freue mich vor allem auch drauf, dass mal"}, {"id": 200, "start": 1509.92, "end": 1514.72, "text": "ein bisschen was Neues ist und dass ich das alte Zeug jetzt dann abgehakt habe. Ich meine,"}, {"id": 201, "start": 1514.72, "end": 1519.28, "text": "ich habe das, ich habe alles schon fertig. Ich habe mein Handy umgezogen heute. Ich habe jetzt"}, {"id": 202, "start": 1519.28, "end": 1524.92, "text": "mein eigenes hier am Start mit allem drauf. Handy umgezogen, ausgeschaltet, Notebook zusammengepackt,"}, {"id": 203, "start": 1524.92, "end": 1529.16, "text": "hingelegt. Also ich werde nächsten Mittwoch Notebook mitnehmen, Handy mitnehmen, dort abgeben,"}, {"id": 204, "start": 1529.16, "end": 1535.48, "text": "meine Eintrittskarte abgeben und das war's. Was das nächste Woche Mittwoch? Stimmt überhaupt nicht."}, {"id": 205, "start": 1535.48, "end": 1540.28, "text": "Morgen? Nee, übermorgen. Hier, da. Mittwoch. Mittwoch fahre ich zum letzten Mal nach Frankfurt"}, {"id": 206, "start": 1540.28, "end": 1551.32, "text": "auf die Arbeit. Auf die alte, also auf die jetzige Arbeit. Was am besten machen als jemand,"}, {"id": 207, "start": 1551.32, "end": 1565.44, "text": "der eine Umschulung zum Physi gemacht hat und theoretisch von vielem ein bisschen"}, {"id": 208, "start": 1565.44, "end": 1570.04, "text": "was weiß, aber wenig praktische Erfahrung in vielen Bereichen hat, bin gerade Softwareverteilung"}, {"id": 209, "start": 1570.04, "end": 1576.96, "text": "betreut und mache zum Großteil 2nd Level Support für die grob 250, das ist gar nicht mal so wenig,"}, {"id": 210, "start": 1576.96, "end": 1580.76, "text": "ja. Verschiedene Softwareprodukte, die bei uns eingesetzt werden, beim Großteil-Tickets hier"}, {"id": 211, "start": 1580.76, "end": 1585.56, "text": "reinkommen, habe ich das Gefühl überhaupt keine Ahnung. Ja, gut, dass man keine Ahnung hat,"}, {"id": 212, "start": 1585.56, "end": 1592.2, "text": "was abgeht, ist eigentlich leider in der IT fast schon der normale Zustand. Man sollte sich"}, {"id": 213, "start": 1592.2, "end": 1597.84, "text": "natürlich vielleicht mal, da kannst du nichts für, also ich glaube nicht, dass man sinnvollen"}, {"id": 214, "start": 1597.84, "end": 1601.52, "text": "2nd Level Support, 2nd Level heißt ja auch mal schon ein bisschen Ahnung von der ganzen Geschichte,"}, {"id": 215, "start": 1601.52, "end": 1606.16, "text": "dass man sinnvollen 2nd Level Support liefern kann für 300 verschiedene Softwareprodukte. Wie"}, {"id": 216, "start": 1606.16, "end": 1610.8, "text": "willst du das machen? Es sei denn, es gibt 5 Base-Produkte und 300 Customizations davon,"}, {"id": 217, "start": 1610.8, "end": 1615.92, "text": "wo sich nicht viel ändert, aber man kann nicht wirklich sinnvollerweise Support leisten,"}, {"id": 218, "start": 1616.92, "end": 1620.96, "text": "wie soll das funktionieren? Dein Hirn ist ja auch limitiert."}, {"id": 219, "start": 1620.96, "end": 1632.0, "text": "Also das liegt nicht an dir, die sollten sich vielleicht eher mal überlegen, ob sie nicht"}, {"id": 220, "start": 1632.0, "end": 1637.52, "text": "verschiedene Schwerpunkte machen, so nach dem Motto Anwendung zusammenfassen, dass dann Leute"}, {"id": 221, "start": 1637.52, "end": 1642.96, "text": "nur noch für 15, die in der gleichen Kategorie sind, zuständig sind. Aber gut, wie die das"}, {"id": 222, "start": 1642.96, "end": 1647.4, "text": "handhaben, kann man nicht schwer sagen, aber dass du da keine Ahnung hast, wundert mich nicht."}, {"id": 223, "start": 1647.4, "end": 1653.8, "text": "Was du machen kannst als Physi, der wenig praktische Erfahrungen hat, ganz ehrlich,"}, {"id": 224, "start": 1653.8, "end": 1662.4, "text": "wenn du die praktische Erfahrung auf der Arbeit nicht kriegst, oder halt nicht in den Bereichen"}, {"id": 225, "start": 1662.4, "end": 1666.8, "text": "kriegst, auf die du Bock hast, dann bleibt dir nichts anderes übrig und das ist eh das Beste,"}, {"id": 226, "start": 1666.8, "end": 1672.68, "text": "was man auch so machen kann, dich privat mit der ganzen Geschichte zu beschäftigen. Wenn du Bock"}, {"id": 227, "start": 1672.68, "end": 1676.84, "text": "auf Basteln und Programmieren hast, ist natürlich ein GitHub-Account auch immer ein gutes Aushängeschild,"}, {"id": 228, "start": 1676.84, "end": 1679.96, "text": "und wenn du dich irgendwo anders da bewirbst zu zeigen, guck mal hier, was habe ich schon"}, {"id": 229, "start": 1679.96, "end": 1684.56, "text": "alles Cooles gemacht, wobei das jetzt als Physi vielleicht jetzt nicht so das Ding ist, aber hey,"}, {"id": 230, "start": 1684.56, "end": 1690.68, "text": "auch als Physi ist ein ordentlicher GitHub-Account nicht verkehrt. Es ist ja heutzutage vieles,"}, {"id": 231, "start": 1690.68, "end": 1696.76, "text": "nicht nur Softwareentwicklung, was in Source-Code technisch Git-mäßig eingecheckt wird,"}, {"id": 232, "start": 1696.76, "end": 1703.28, "text": "sondern zum Beispiel auch Terraform-Config, Pulumi-Config, Ansible, Kubernetes-Manifests und so"}, {"id": 233, "start": 1703.28, "end": 1712.76, "text": "was, also heute definiert man ja vieles seiner Infrastruktur schon über YAML-Files, Terraform-Manifests"}, {"id": 234, "start": 1712.76, "end": 1718.64, "text": "und alles Mögliche, das ist auch was, was man durchaus aus seinem GitHub-Profil haben kann,"}, {"id": 235, "start": 1718.64, "end": 1723.68, "text": "auch wenn man eher in der Administration, ich finde es ist nicht verkehrt, da die ein oder"}, {"id": 236, "start": 1723.68, "end": 1729.28, "text": "andere Sachen zu haben. Ja, und ansonsten bleibt dir wahrscheinlich nichts anderes übrig,"}, {"id": 237, "start": 1729.28, "end": 1736.0, "text": "wenn dir das in dem Bereich keine praktischen Erfahrungen bekommst oder zumindest nicht in"}, {"id": 238, "start": 1736.0, "end": 1739.48, "text": "dem Bereich, was dir gefällt, da bleibt dir gar nichts übrig, wie selbst ein bisschen zu basteln."}, {"id": 239, "start": 1739.48, "end": 1743.48, "text": "Das hat den Vorteil, selbst rum zu basteln, du kannst dir aussuchen, worauf du Bock hast,"}, {"id": 240, "start": 1743.48, "end": 1747.28, "text": "und das dann halt machen. Wenn du sagst, hey, ich habe Bock mich beispielsweise mit, weil ich es"}, {"id": 241, "start": 1747.28, "end": 1751.84, "text": "gerade erzählt habe, ja und ich selbst zurzeit viel damit am rumbasteln bin, wenn du sagst,"}, {"id": 242, "start": 1751.92, "end": 1759.28, "text": "ich habe Bock mir mal ein bisschen Kubernetes anzugucken, dann mach das. Da guck dir das an,"}, {"id": 243, "start": 1759.28, "end": 1763.4, "text": "es ist scheißegal, ob die Arbeit das braucht oder nicht, die Skills sind so gefragt aktuell,"}, {"id": 244, "start": 1763.4, "end": 1767.68, "text": "es ist auf jeden Fall gut das zu können und sei es nicht bei deinem aktuellen Arbeitgeber,"}, {"id": 245, "start": 1767.68, "end": 1775.64, "text": "sondern bei einem anderen. Und ein bisschen Kubernetes anschauen ist gut, da fängst du an mit,"}, {"id": 246, "start": 1775.64, "end": 1779.12, "text": "am ersten Tag denkst du dir, ich blicke eigentlich ganz gut durch, am zweiten Tag denkst du dir,"}, {"id": 247, "start": 1779.84, "end": 1784.96, "text": "ich bin das nächste halbe Jahr am nichts anderen machen mehr, bis ich halbwegs durchblicke."}, {"id": 248, "start": 1784.96, "end": 1794.2, "text": "War StepStone zu hoch oder zu niedrig? Jetzt wo du mich fragst, ich glaube es war gar nicht so"}, {"id": 249, "start": 1794.2, "end": 1800.56, "text": "schlecht. Wir haben ja mal so eine Gehaltsprognose gemacht bei StepStone und ich glaube die haben"}, {"id": 250, "start": 1800.56, "end": 1806.12, "text": "damals ausgespuckt 85.000 Euro im Jahr, ich bin mir da gar nicht mehr sicher, was ja eigentlich,"}, {"id": 251, "start": 1806.12, "end": 1816.08, "text": "muss man ehrlich sagen, ganz gut hinkommt. Jetzt mittlerweile nicht mehr, mittlerweile ist ja noch"}, {"id": 252, "start": 1816.08, "end": 1827.08, "text": "ein bisschen mehr, was mich persönlich natürlich freut, mehr Stonks immer gut. Aber die waren"}, {"id": 253, "start": 1827.08, "end": 1835.4, "text": "eigentlich ganz gut damals, die lagen damit eigentlich ganz richtig, also was so im Durchschnitt"}, {"id": 254, "start": 1835.4, "end": 1843.6, "text": "drinne ist. Hast du diese Woche noch wirklich etwas zu tun auf der aktuellen Arbeit oder chillst"}, {"id": 255, "start": 1843.6, "end": 1849.56, "text": "zu deinem Leben? Ganz ehrlich, ich chille mein Leben und ich mache das auch schon seit ein paar"}, {"id": 256, "start": 1849.56, "end": 1856.16, "text": "Wochen so. Klar ich mache die ein oder anderen Sachen schon noch, gerade wenn mich irgendwelche"}, {"id": 257, "start": 1856.16, "end": 1859.76, "text": "Kollegen fragen, wie sieht es aus? Kannst du mal gucken? Guck ich immer, es ist nicht so,"}, {"id": 258, "start": 1859.76, "end": 1865.72, "text": "dass ich nichts mache, aber so wirklich irgendwie super motiviert an irgendwas basteln. Es ist"}, {"id": 259, "start": 1865.72, "end": 1870.44, "text": "vorbei jetzt, ist eigentlich schon vorbei seit ich gekündigt habe, habe ich direkt im Januar schon"}, {"id": 260, "start": 1870.44, "end": 1877.96, "text": "gemerkt, als ich angefangen habe, dass mich das absolut nicht juckt. Die zwei Tage, wo ich jetzt"}, {"id": 261, "start": 1877.96, "end": 1885.48, "text": "noch arbeiten muss, morgen und übermorgen, die chille ich wirklich mein Leben. Ich sehe auch"}, {"id": 262, "start": 1885.48, "end": 1890.52, "text": "wenig Lerneffekt, weil ein aufgekommenes Problem nur selten so wieder vorkommt. Habt Angst nicht"}, {"id": 263, "start": 1890.52, "end": 1900.88, "text": "zu lernen, irgendwie auf der Strecke zu bleiben, wenn es um anderen geht. Ja gut, dann ist doch das"}, {"id": 264, "start": 1900.88, "end": 1909.72, "text": "Beste eigentlich, dass du dir privat was anguckst, was dich interessiert. Gibt ja tausende Bereiche."}, {"id": 265, "start": 1909.84, "end": 1916.48, "text": "Natürlich am besten ist, wenn es dich privat interessiert und ein Thema ist, was auch gefragt"}, {"id": 266, "start": 1916.48, "end": 1924.16, "text": "ist. Muss ja nicht gleich Kobol-Programmierer sein, aber wenn du dir zum Beispiel ein bisschen was im"}, {"id": 267, "start": 1924.16, "end": 1930.6, "text": "Cloud-Umfeld anschaust, wenn du dir beispielsweise mal einen Test-Account machst bei Google Cloud oder"}, {"id": 268, "start": 1930.6, "end": 1937.4, "text": "bei Azure oder AWS, da kriegst du ja immer 100, 200, 300 Euro, was auch immer Startgut haben und"}, {"id": 269, "start": 1937.4, "end": 1940.64, "text": "kannst da ein bisschen ausprobieren und kannst meistens auch beliebig viele Accounts machen,"}, {"id": 270, "start": 1940.64, "end": 1945.48, "text": "wenn es nicht total übertreibst. Also, wenn du dich ein bisschen auskennst bei den jeweiligen"}, {"id": 271, "start": 1945.48, "end": 1950.28, "text": "Cloud-Anbietern auf den Plattformen, da hast du schon mal einiges, also hast du schon mal einigen"}, {"id": 272, "start": 1950.28, "end": 1955.04, "text": "Leuten was voraus und das wird immer wichtiger. Das ist eigentlich, ich will nicht sagen, dass es"}, {"id": 273, "start": 1955.04, "end": 1961.08, "text": "Pflicht ist heute für jemand, der so im Admin-Umfeld arbeitet, aber ein bisschen Ahnung von aktuellen"}, {"id": 274, "start": 1961.08, "end": 1967.04, "text": "Cloud-Plattformen sollte man haben. Es ist nicht so wichtig, dass es exakt die ist, die dann Arbeitgeber"}, {"id": 275, "start": 1967.04, "end": 1972.0, "text": "einsetzt, aber ich finde es nicht verkehrt, wenn man, zwar es gibt drei große, du hast Amazon,"}, {"id": 276, "start": 1972.0, "end": 1978.76, "text": "du hast Microsoft, du hast Google, also sprich, du hast Google Cloud, du hast Microsoft Azure und du"}, {"id": 277, "start": 1978.76, "end": 1987.04, "text": "hast Amazon AWS. Und ich finde es nicht verkehrt, wenn man in zwei von drei schon mal reingeguckt"}, {"id": 278, "start": 1987.04, "end": 1992.32, "text": "hat. Und das alle kriegt man dann immerhin. Die haben alle so ein paar Dinger. Amazon hat"}, {"id": 279, "start": 1992.32, "end": 1996.56, "text": "beschissene Benamung, gut man muss sagen, das haben sie alle irgendwo, aber Amazon hat die super"}, {"id": 280, "start": 1996.56, "end": 2008.24, "text": "beschissene Benamung. Ich sage nur hier, Elastic, setze AWS, dann Elastic, dann irgendwas anderes ein"}, {"id": 281, "start": 2008.24, "end": 2012.64, "text": "oder das Fargate Managed Kubernetes Cluster ist. Niemand kommt drauf, dass Fargate damit was zu tun"}, {"id": 282, "start": 2012.64, "end": 2022.48, "text": "hat. Also Amazon benennt die Sachen beschissen. Und hat dafür finde ich zwar eine Oldschool,"}, {"id": 283, "start": 2022.48, "end": 2028.8, "text": "aber eine ganz gute Oberfläche. Bei Google Cloud finde ich nichts. Dafür kann man es wunderbar"}, {"id": 284, "start": 2028.8, "end": 2033.36, "text": "natürlich auch über Terraform oder so administrieren, aber Google Cloud im Webinterface"}, {"id": 285, "start": 2033.36, "end": 2038.04, "text": "finde ich gar nichts. Da blicke ich bis heute nicht durch. Vor allem, weil du manche interessanten"}, {"id": 286, "start": 2038.04, "end": 2042.96, "text": "Sachen auch unter mehr Anzeigen stehen hast und dann klickst du auf mehr Anzeigen und es ploppen"}, {"id": 287, "start": 2042.96, "end": 2047.76, "text": "180 Dinge auf, du verstehst noch weniger. Als Google Cloud finde ich im Webinterface gar nichts,"}, {"id": 288, "start": 2047.76, "end": 2053.08, "text": "über die Suche schon, aber nie über dieses Menü. Und Azure muss ich ehrlich sagen, finde ich"}, {"id": 289, "start": 2053.08, "end": 2059.88, "text": "eigentlich von der Aufmachung her, was so die Benamung und das Interface, wie gesagt, ich rede"}, {"id": 290, "start": 2059.88, "end": 2065.68, "text": "immer noch vom Webinterface angeht, noch mit am besten. Aber selbst da ist schwierig durchzublicken"}, {"id": 291, "start": 2065.68, "end": 2070.2, "text": "und man macht die wenigsten Sachen ja auch über das Webinterface. Das guckt man sich am Anfang an."}, {"id": 292, "start": 2070.2, "end": 2074.32, "text": "Also das ist zum Beispiel was, wenn du dich dafür interessierst, guck dir mal die aktuellen"}, {"id": 293, "start": 2074.32, "end": 2078.64, "text": "Cloud-Anbieter an. Schnapp dir beispielsweise bei Google kriegst du 100 Euro Startguthaben,"}, {"id": 294, "start": 2078.64, "end": 2083.32, "text": "bei Azure kriegst du auch 100 Euro Startguthaben. Ich glaube bei Azure sind sogar 300 Dollar Startguthaben,"}, {"id": 295, "start": 2083.32, "end": 2087.6, "text": "aber du kannst ein bisschen ausprobieren. Bei Google ist das schöne, du kannst dir bei Google"}, {"id": 296, "start": 2087.6, "end": 2093.96, "text": "Cloud einen Account erstellen. Du musst den zwar einmalig per Kreditkarte aktivieren, das machen"}, {"id": 297, "start": 2093.96, "end": 2100.0, "text": "die, dass die Leute nicht 100.000 Fake-Accounts erstellen, aber dann ist Bezahlung ausgeschaltet."}, {"id": 298, "start": 2100.0, "end": 2104.8, "text": "Also selbst wenn du es total verkackst, ist nicht so, dass nach den 100 Euro Startguthaben"}, {"id": 299, "start": 2104.8, "end": 2111.64, "text": "auf einmal dein Konto leer ist. Das hört dann auf. Du kannst nicht pleite werden durch das Testen,"}, {"id": 300, "start": 2111.64, "end": 2117.68, "text": "das ist was, was du machen kannst. Hat das mit dem Arbeitszeugnis dann geklappt? Also ich gehe"}, {"id": 301, "start": 2117.68, "end": 2121.8, "text": "übermorgen hin, angeblich ist mein Zeugnis da und ich kann es abholen und die Bescheinigung"}, {"id": 302, "start": 2121.8, "end": 2131.4, "text": "über Überurlaubstage auch. Doch, doch, doch, doch, die neue Arbeit ist, ist, ist keine Ahnung,"}, {"id": 303, "start": 2131.4, "end": 2137.92, "text": "500 Meter Luftlinie von der alten entfernt. Was hast du bis jetzt gemacht? Was wirst du ab"}, {"id": 304, "start": 2137.92, "end": 2142.52, "text": "nächster Woche machen? Als ab nächster Woche bin ich offiziell, jetzt haltet euch fest,"}, {"id": 305, "start": 2142.52, "end": 2151.56, "text": "Senior Linux Engineer und was ich aktuell mache, habe ich 30 Milliarden Videos aufgenommen hier,"}, {"id": 306, "start": 2151.56, "end": 2156.48, "text": "das mache ich auf der Arbeit, Talk über Ausbildung, das verdiene ich als DevOps"}, {"id": 307, "start": 2156.48, "end": 2167.32, "text": "Engineer und alles Mögliche. Jetzt immer wieder interessant, mal auf diesen VOD-Kanal zu gucken,"}, {"id": 308, "start": 2167.32, "end": 2178.4, "text": "ob es da Kommentare gibt, aber da schreibt mir jemand Kommentare. Ja, nice, warum nicht? Also"}, {"id": 309, "start": 2178.88, "end": 2186.24, "text": "den Sinn von der Apple Watch habe ich noch nicht so hundertprozentig für mich verstanden,"}, {"id": 310, "start": 2186.24, "end": 2192.2, "text": "warum man das braucht. Also ich verstehe es, wenn man Fitnesszeug tracken will, aber ansonsten..."}, {"id": 311, "start": 2192.2, "end": 2212.96, "text": "Na, ich werde dieses Jahr 39 Leute, da wird es immer schon Zeit. So, also, hat es fertig"}, {"id": 312, "start": 2212.96, "end": 2220.56, "text": "geupdatet, Reboot. Jetzt wird es langsam Zeit, dass ich euch mal zeige bzw."}, {"id": 313, "start": 2220.56, "end": 2238.72, "text": "Oh fuck, warte mal. Oh nee, Glück, ich habe nichts übersehen. Close. Du bist gespannt darauf,"}, {"id": 314, "start": 2238.72, "end": 2246.16, "text": "was ein Senior Linux Engineer macht? Tja, ich auch. Aber ehrlich gesagt, Jobtitel, das ist doch eh"}, {"id": 315, "start": 2246.16, "end": 2250.88, "text": "nur Schall und Rauch. Ich könnte genauso gut Senior DevOps Engineer, Senior Linux Engineer,"}, {"id": 316, "start": 2250.88, "end": 2259.84, "text": "Senior System Administrator, Senior, selbst mit Senior, mit Expert, mit was auch immer. Letztendlich"}, {"id": 317, "start": 2259.84, "end": 2266.08, "text": "ist das alles nur bla bla und ziemlich austauschbar von den Bezeichnungen her."}, {"id": 318, "start": 2266.08, "end": 2282.64, "text": "Wir machen heute ein paar coole Sachen an einem bestehenden Projekt. Allerdings sind die Sachen"}, {"id": 319, "start": 2282.64, "end": 2288.76, "text": "relativ easy, glaube ich zumindest, sodass man nebenbei können wir schwätzen und ich kann ein"}, {"id": 320, "start": 2288.76, "end": 2298.08, "text": "bisschen was erklären und sowas. Ja, so, also, was machen wir heute? Oder Senior, Senior,"}, {"id": 321, "start": 2298.08, "end": 2311.4, "text": "Agile, Dev, Bus, Fin, Win, SecOps. Wenn schon dann richtig. Ja, Moment, Cloud natürlich auch"}, {"id": 322, "start": 2311.4, "end": 2319.64, "text": "noch dabei. Cloud-Native, Cloud-Native, bitteschön. Da wird reingerollt in die Cloud."}, {"id": 323, "start": 2319.64, "end": 2327.48, "text": "Solange man Kubernetes richtig ausspricht. Ja, das ist die Frage, wie man das nur richtig"}, {"id": 324, "start": 2327.48, "end": 2337.8, "text": "ausspricht. Ist es Kubernetes? Ist es Kubernetes? Ist es Kubernetes? Es ist nicht so ganz klar."}, {"id": 325, "start": 2337.88, "end": 2350.04, "text": "Oder ist es sogar vielleicht Kates? Kates, finde ich, hört sich irgendwie einfach falsch an."}, {"id": 326, "start": 2350.04, "end": 2357.72, "text": "Hört sich doch noch AIDS an, Kates. Aber was mich persönlich immer noch komplett fertig macht,"}, {"id": 327, "start": 2357.72, "end": 2363.44, "text": "sind die Leute, die kubectl, nicht kubectl oder kubectl-control aussprengen, sondern kubectl."}, {"id": 328, "start": 2363.44, "end": 2370.92, "text": "Kubectl, man. Ich habe jetzt die ein oder anderen Videos auf YouTube geguckt zu Themen"}, {"id": 329, "start": 2370.92, "end": 2378.48, "text": "so im Kubernetes-Bereich. Da gibt es echt viele, die es wirklich kubectl aussprechen. Ich werde"}, {"id": 330, "start": 2378.48, "end": 2385.56, "text": "mich da nie dran gewöhnen. Ich habe ewig gebraucht zu merken, warum K8S K8S ist. Ich glaube,"}, {"id": 331, "start": 2385.56, "end": 2392.08, "text": "ihr könnt mir mal schreiben, ob ich richtig liege. Ich glaube, es liegt daran, weil es 8 Buchstaben"}, {"id": 332, "start": 2392.08, "end": 2403.12, "text": "sind in Kubernetes. Oder, warte mal, in Kubernetes zwischen K und S irgendwie. 1, 2, 3, 4, 5, 6,"}, {"id": 333, "start": 2403.12, "end": 2419.6, "text": "7, 8. Ja, genau. Es sind 8 Buchstaben zwischen K und S. Deswegen ist es so. Stimmt schon. Wobei"}, {"id": 334, "start": 2419.6, "end": 2428.28, "text": "ich ja schwanke bei STRG zwischen STRG und Control. Ich glaube, mittlerweile sage ich"}, {"id": 335, "start": 2428.28, "end": 2448.04, "text": "hauptsächlich Control. Na gut, alles klar. Also geupdatet haben wir alles. Gucken,"}, {"id": 336, "start": 2448.04, "end": 2455.8, "text": "nicht dass jetzt noch was nachgekommen ist, weil Arch, by the way. Was heißt K3S eigentlich? Das"}, {"id": 337, "start": 2455.8, "end": 2460.28, "text": "ist eine gute Frage. Also ich habe keine Ahnung, was das heißt. Ich will auch gerade überlegen."}, {"id": 338, "start": 2460.28, "end": 2473.12, "text": "Ich weiß, was es ist. Ich habe keine Ahnung, wo der Name herkommt. Kubez. Ja, Kubez gibt es"}, {"id": 339, "start": 2473.12, "end": 2477.84, "text": "ja auch. Es gibt im Prinzip eigentlich fast alles in diesem Umfeld, wo nicht schon der"}, {"id": 340, "start": 2477.84, "end": 2489.76, "text": "Name belegt wäre. Ach, ich muss euch noch was trauriges erzählen. Zetketime, Leute. Richtig"}, {"id": 341, "start": 2489.76, "end": 2498.4, "text": "Zetketime, was ich heute erfahren habe. Nee, für euch nicht Zetke. Aber was ich wieder richtig kacke"}, {"id": 342, "start": 2498.4, "end": 2507.24, "text": "finde und zwar, ich habe versucht bei mir auf der aktuellen Arbeit einen Azubi zu vermitteln vor"}, {"id": 343, "start": 2507.72, "end": 2514.4, "text": "einem dreiviertel Jahr oder vor einem Jahr. Ich schaue ein bisschen her. Und zwar war das jemand,"}, {"id": 344, "start": 2514.4, "end": 2520.32, "text": "der hat eine Umschulung gemacht zum Fachinformatiker Systemintegration. Also ein bisschen so wie"}, {"id": 345, "start": 2520.32, "end": 2531.8, "text": "Dot Project oder falls ich das richtig, ja genau, das Umschulung zum Physik gemacht. Also er hat"}, {"id": 346, "start": 2531.8, "end": 2537.2, "text": "eine Umschulung, der macht gerade eine Umschulung zum Fachinformatiker Systemintegration. Davor"}, {"id": 347, "start": 2537.2, "end": 2544.0, "text": "war er Schreiner oder sowas. Keine Ahnung. Zumindest, die müssen, glaube ich, im zweiten"}, {"id": 348, "start": 2544.0, "end": 2551.68, "text": "Jahr müssen sie für drei oder vier Monate ein in Anführung zu dem Praktikum machen, wo sie dann"}, {"id": 349, "start": 2551.68, "end": 2555.32, "text": "auch ihr Abschlussprojekt durchführen können. Also die brauchen einen Betrieb. Also wenn du"}, {"id": 350, "start": 2555.32, "end": 2559.32, "text": "Umschulungen zum Fachinformatiker Systemintegration machst, dann vielleicht Dot Project kann es"}, {"id": 351, "start": 2559.32, "end": 2564.76, "text": "vielleicht was zu sagen, ob das stimmt, was ich hier erzähle, musste beim Betrieb irgendwie ein"}, {"id": 352, "start": 2564.76, "end": 2570.56, "text": "Praktikum machen und in dieser Zeit dann quasi auch dein Abschlussprojekt dort finden und"}, {"id": 353, "start": 2570.56, "end": 2575.48, "text": "durchführen und Doku schreiben und Zeug. Also sprich, das ist erforderlich dafür, dass du diese drei,"}, {"id": 354, "start": 2575.48, "end": 2580.8, "text": "vier Monate im Betrieb bist, dass du deine Ausbildung fertig machen kannst. So. Und ich"}, {"id": 355, "start": 2580.8, "end": 2588.56, "text": "habe versucht einen Umschulungsazubi an die Firma, wo ich aktuell noch bin, für zwei Tage zu"}, {"id": 356, "start": 2588.56, "end": 2599.48, "text": "vermitteln. Ich kenne den nur um drei Ecken. Also das ist der Freund von der Tochter von einer"}, {"id": 357, "start": 2599.48, "end": 2604.72, "text": "Freundin von meiner Mutter. Also es ist wirklich um drei Ecken. Ist auch vollkommen egal. Ich dachte"}, {"id": 358, "start": 2604.72, "end": 2609.76, "text": "mir, gut, du kannst ja mal fragen. Und ich habe bei uns die Personalabteilung, äh nicht die"}, {"id": 359, "start": 2609.76, "end": 2616.0, "text": "Personalabteilung, die die die die Ausbildungsbetreuung angehauen und die haben sich ewig nicht gerührt und"}, {"id": 360, "start": 2616.0, "end": 2620.92, "text": "immer nur gesagt so nach dem Motto Ja, was ist denn in dem Fall? Was ist das? Ich habe 100.000 Sachen"}, {"id": 361, "start": 2620.92, "end": 2625.08, "text": "gefragt, aber es war nie so wirklich Zug drinnen und ich habe dann halt wirklich drei, vier Wochen"}, {"id": 362, "start": 2625.08, "end": 2631.04, "text": "am Stück oder eher vier, fünf Wochen am Stück immer mal wieder genervt, obwohl sie ja auch"}, {"id": 363, "start": 2631.04, "end": 2634.68, "text": "zwischendurch immer erzählt haben. Das ist eh so ein Ding, was ich bei dem aktuellen Arbeitgeber"}, {"id": 364, "start": 2634.68, "end": 2639.52, "text": "nicht verstehe. Auf der einen Seite erzählen sie immer wir finden keine Azubis, keine Geigen."}, {"id": 365, "start": 2639.52, "end": 2645.04, "text": "Also niemand bewirbt sich und dann präsentierst du ihn ein auf dem Silbertablett und da wollen"}, {"id": 366, "start": 2645.08, "end": 2648.8, "text": "sie nicht. Also das, was da gesagt wird und was wirklich gemacht wird für zwei verschiedene"}, {"id": 367, "start": 2648.8, "end": 2655.32, "text": "Paar Schuhe zumindest hat das nicht geklappt. Ich habe sie dann noch ein bisschen weiter genervt"}, {"id": 368, "start": 2655.32, "end": 2659.24, "text": "und ich habe halt dann irgendwann festgestellt, okay, selbst die Ausbildungsbetreuung kümmert"}, {"id": 369, "start": 2659.24, "end": 2662.92, "text": "sich überhaupt nicht darum. Und dann habe ich noch mal offiziell über meinen Chef"}, {"id": 370, "start": 2662.92, "end": 2667.8, "text": "anfragen lassen. Dann mussten sie reagieren und haben mir noch am gleichen Tag abgesagt"}, {"id": 371, "start": 2667.8, "end": 2672.12, "text": "mit der Begründung. So nach dem Motto Sie keine der Abteilung hätte sich bereit erklärt, ihn"}, {"id": 372, "start": 2672.12, "end": 2676.28, "text": "zu nehmen blablabla. Also im Prinzip die haben einfach sie fünf Wochen nichts gemacht und als"}, {"id": 373, "start": 2676.28, "end": 2680.52, "text": "ich dann noch mal offiziell gefragt habe, haben sie gesagt, nee machen wir nicht. So und jetzt"}, {"id": 374, "start": 2680.52, "end": 2688.12, "text": "Zedge, ich wusste der Kerl ist eh schon ein bisschen neben der Spur ja und das Einzige,"}, {"id": 375, "start": 2688.12, "end": 2691.96, "text": "was ihn irgendwie noch halbwegs auf der Spur gehalten hat so die letzten zwei Jahre ist,"}, {"id": 376, "start": 2691.96, "end": 2698.2, "text": "dass der eben sich die Ausbildung gemacht hat und jetzt irgendwie so ein bisschen was ja wie soll"}, {"id": 377, "start": 2698.2, "end": 2704.76, "text": "man sagen, was festes so in seinem Leben hatte, was irgendwie täglich aufstehen und so. Zumindest,"}, {"id": 378, "start": 2704.76, "end": 2710.56, "text": "ich habe jetzt gehört, er hat nirgends woanders, nein nein Leute keine Panik, keine Panik, so schlimm"}, {"id": 379, "start": 2710.56, "end": 2714.76, "text": "ist es nicht, so schlimm ist es nicht, was jetzt kommt. Nein nein, er hat sich nicht umgebracht,"}, {"id": 380, "start": 2714.76, "end": 2721.6, "text": "also macht euch keine Sorgen, das hätte ich euch so jetzt nicht erzählt. Er hat zumindest kein"}, {"id": 381, "start": 2721.6, "end": 2727.48, "text": "Ausbildungs, kein Praktikum oder sowas gefunden und ich habe letztens jetzt gehört, das hat ihn so"}, {"id": 382, "start": 2727.48, "end": 2731.64, "text": "aus der Bahn geschmissen, dass er jetzt irgendwie seit zwei Monaten in der Psychiatrie ist und"}, {"id": 383, "start": 2731.64, "end": 2740.8, "text": "behandelt werden muss. Da siehst du mal, was einfach, was so dahin, wie soll man sagen, so nicht drum"}, {"id": 384, "start": 2740.8, "end": 2746.28, "text": "gekümmert ist, so einfach mal seinen Job nicht gemacht als Ausbildungsbetreuer, was das für"}, {"id": 385, "start": 2746.28, "end": 2751.44, "text": "Auswirkungen auf andere Leute haben kann und da wäre bestimmt gar nicht schlecht gewesen der Typ,"}, {"id": 386, "start": 2751.44, "end": 2759.04, "text": "zumindest hätte er dann seine Ausbildung fertig. Jetzt ist er wohl gerade wieder raus und es geht"}, {"id": 387, "start": 2759.04, "end": 2764.08, "text": "ihm wieder halbwegs gut, aber es hat ihn voll aus der Bahn geschmissen und alles nur, was heißt"}, {"id": 388, "start": 2764.08, "end": 2767.68, "text": "alles, es hätte sich ja durchaus auch eine andere Firma finden können, das lag jetzt nicht nur an"}, {"id": 389, "start": 2767.68, "end": 2773.72, "text": "dem Laden, das alles nur, weil sie bei uns keinen Bock hatten, sich mit der Thematik auseinanderzusetzen."}, {"id": 390, "start": 2781.44, "end": 2800.28, "text": "Wozu braucht man jetzt mal eine blöde Frage, wozu braucht man einen Recruiter, wenn man"}, {"id": 391, "start": 2800.28, "end": 2804.24, "text": "niemand einstellen will? Ist das einfachste, wenn man niemand einstellen will, nicht einfach"}, {"id": 392, "start": 2804.24, "end": 2816.32, "text": "keinen Recruiter zu haben? Wieso? Sie hätten sich doch einfach auch drum kümmern können. Es heißt"}, {"id": 393, "start": 2816.32, "end": 2821.44, "text": "nicht, dass sie es machen müssen, das nicht, aber sie hätten sich doch auch drum kümmern können und"}, {"id": 394, "start": 2821.44, "end": 2826.52, "text": "nicht sich fünf Wochen von mir nerven lassen und als ich dann offiziell angefragt habe noch mal am"}, {"id": 395, "start": 2826.52, "end": 2834.0, "text": "gleichen Tag noch zu sagen, ach es hat sich niemand gefunden. Hätten die sich wirklich da drum"}, {"id": 396, "start": 2834.08, "end": 2839.04, "text": "gekümmert, hätten die gefragt, gibt es da einen Platz und es wäre am Ende rausgekommen, nee gibt"}, {"id": 397, "start": 2839.04, "end": 2843.8, "text": "es nicht, dann hätte ich gar nichts gesagt, aber einfach nichts zu machen fünf Wochen lang und wenn"}, {"id": 398, "start": 2843.8, "end": 2848.52, "text": "man dann noch mal besonders nervt zu sagen, ach nee ist nicht, was ist das für ein Arsch, dafür gibt"}, {"id": 399, "start": 2848.52, "end": 2854.56, "text": "es Leute, die explizit dafür da sind, sich um Ausbildung und sowas zu kümmern. Der soll halt mal"}, {"id": 400, "start": 2854.56, "end": 2883.12, "text": "ihren Job machen. Ahja, gut, unerm Strich, Geld regelt. Unerm Strich ist es wahrscheinlich für"}, {"id": 401, "start": 2883.12, "end": 2890.6, "text": "diese Unternehmen oder denken sie zumindest, ist es unterm Strich billiger oder was heißt billiger,"}, {"id": 402, "start": 2890.6, "end": 2895.44, "text": "unterm Strich stehen sie besser da, wenn die Entwickler unbezahlt bei ihnen rumhocken,"}, {"id": 403, "start": 2895.44, "end": 2906.64, "text": "als was wichtiges bei der Konkurrenz zu machen. Naja. So, aber jetzt müssen wir mal loslegen,"}, {"id": 404, "start": 2906.64, "end": 2911.56, "text": "Leute, damit das heute noch was wird. Ich zeige euch mal kurz, um was es heute geht. Wir werden"}, {"id": 405, "start": 2911.56, "end": 2918.4, "text": "heute nämlich ein bisschen .NET bzw. ein bisschen C-Sharp und mit unter .NET 8 weiter"}, {"id": 406, "start": 2918.4, "end": 2925.12, "text": "programmieren. Ich hätte nämlich nicht gedacht, dass so mein an einem Tag erstelltes Miniprojekt"}, {"id": 407, "start": 2925.12, "end": 2930.48, "text": "mir dann doch so viel Bock macht, dass ich da noch ein paar kleine Sachen ergänzen will."}, {"id": 408, "start": 2930.48, "end": 2937.28, "text": "Es war um was geht's. Ich demonstriere euch das mal. Vorher zeige ich euch was anderes,"}, {"id": 409, "start": 2937.28, "end": 2945.2, "text": "habe ich ganz am Anfang des Streams schon gesagt. Das finde ich auch kacke, dass Microsoft das so"}, {"id": 410, "start": 2945.2, "end": 2950.8, "text": "nennt, weil eigentlich sind alle Sachen mit Champ hinten dran so mein Ding. Schade, dass man"}, {"id": 411, "start": 2950.8, "end": 2956.52, "text": "das Patente kein Wildcard Support haben. Vielleicht sollte ich das mal vorschlagen, dass man sich"}, {"id": 412, "start": 2956.52, "end": 2964.24, "text": "Sternchen Champ in Verbindung mit Softwareprojekten komplett sichern kann. Wildcard Patente oder so"}, {"id": 413, "start": 2964.24, "end": 2971.44, "text": "was. Ich wollte euch eine Sache noch zeigen, und zwar ich habe hier heute meine ganzen Daten"}, {"id": 414, "start": 2971.44, "end": 2977.64, "text": "umgezogen vom alten iPhone aufs neue iPhone. Ist der ASCII CAC WPR schon da? Ja, der ist"}, {"id": 415, "start": 2977.64, "end": 2989.84, "text": "schon da, der ist schon da und der ist auch geklost von mir schon, weil der PR Autocomplete kaputt"}, {"id": 416, "start": 2989.84, "end": 2995.12, "text": "gemacht hat von der Shell. Allerdings ist es kein Problem, weil ich habe selbst ein besseres"}, {"id": 417, "start": 2995.12, "end": 3002.32, "text": "Feature eingebaut, nämlich einen farbigen CAC W mit versteckter Option. Ja, also was ich euch"}, {"id": 418, "start": 3002.32, "end": 3009.12, "text": "jetzt zeigen wollte, ich habe hier heute meine ganzen Daten umgezogen vom alten iPhone aufs"}, {"id": 419, "start": 3009.12, "end": 3014.72, "text": "neue iPhone und es ist immer unglaublich schwierig vom iPhone Daten abzuziehen, wenn man nicht gerade"}, {"id": 420, "start": 3015.72, "end": 3022.32, "text": "und selbst da am einfachsten ist es vom alten auf ein neues iPhone umzustellen. Das ist einfach,"}, {"id": 421, "start": 3022.32, "end": 3026.2, "text": "aber die Daten da runter zu bekommen, um mal ein komplettes Backup zu machen, zum Beispiel ein"}, {"id": 422, "start": 3026.2, "end": 3031.16, "text": "Backup von allen Fotos, ist gar nicht so einfach. Es gibt ein paar Apps, da geht das, dass man"}, {"id": 423, "start": 3031.16, "end": 3035.48, "text": "beispielsweise einen FTP Server, einen Web Server aufmacht und da drüber Sachen runter lädt. Da"}, {"id": 424, "start": 3035.48, "end": 3039.48, "text": "muss man es aber auch erst importieren in diese Anwendung oder man muss Shit iTunes verwenden,"}, {"id": 425, "start": 3039.48, "end": 3044.44, "text": "was absolute Abfuck ist, was ich niemals auf meinen Rechner installieren werde oder was auch"}, {"id": 426, "start": 3044.44, "end": 3051.6, "text": "ganz praktisch ist. Man kann, also natürlich kann man es einfach per USB verbinden und hier"}, {"id": 427, "start": 3051.6, "end": 3059.12, "text": "über den Explorer drüber ziehen, das geht, aber es gibt ein viel, viel besseres Projekt und zwar"}, {"id": 428, "start": 3059.12, "end": 3068.6, "text": "nennt sich das iFuse oder iFuse oder wie auch immer. Damit kann man sein iPhone in einen Ordner"}, {"id": 429, "start": 3068.6, "end": 3074.88, "text": "mounten unter Linux und kann dann auf das meiste zugreifen und auf das, was man nicht zugreifen"}, {"id": 430, "start": 3074.88, "end": 3079.96, "text": "kann, kann man das mit bestimmten Optionen mounten, dass du direkt auf Anwendungsordner"}, {"id": 431, "start": 3079.96, "end": 3086.68, "text": "zugreifen kannst. Also du kannst dann zum Beispiel den Ordner mounten von deiner Notizanwendung und"}, {"id": 432, "start": 3086.68, "end": 3094.12, "text": "die Daten daraus ziehen, ohne dass die Notizanwendung selbst zwingenderweise eine Exportfunktion haben"}, {"id": 433, "start": 3094.12, "end": 3101.68, "text": "muss. Also das ist wirklich sehr praktisch. Ich kann es euch nicht zeigen, weil wenn ich es euch"}, {"id": 434, "start": 3101.68, "end": 3106.6, "text": "zeige, ja mit einem MacBook ist das easy, aber wenn ich es euch zeige, leake ich vielleicht"}, {"id": 435, "start": 3106.6, "end": 3115.76, "text": "Sachen von meinem iPhone, da habe ich keinen Bock drauf. Ja, also das finde ich sehr nice,"}, {"id": 436, "start": 3115.76, "end": 3121.0, "text": "habe ich heute wieder benutzt um iPhone Backup zu machen. Kann ich, kann ich nur recommenden."}, {"id": 437, "start": 3121.0, "end": 3136.64, "text": "Moin Sirius Max. Alles klar, so muss ich mal kurz in mich gehen. Ich glaube die Musik ist ein"}, {"id": 438, "start": 3136.64, "end": 3152.6, "text": "Ticken lauter. Mir geht eigentlich. Okay, also um was geht es heute? Ich zeige euch mal was."}, {"id": 439, "start": 3152.6, "end": 3159.4, "text": "Ich mache mal kurz zu und mache mal hier einen neuen Browser auf. Ich habe letzte Woche was,"}, {"id": 440, "start": 3159.4, "end": 3165.72, "text": "nein nicht die Cute App und auch nicht Pfeilfeder. Ich habe letzte Woche was entwickelt,"}, {"id": 441, "start": 3165.72, "end": 3175.0, "text": "an einem Tag, weil ich selbst gerne so ein Programm hätte haben wollen und ich nichts"}, {"id": 442, "start": 3175.0, "end": 3182.08, "text": "gefunden habe in der Richtung und zwar ich habe den VmChamp erstellt. Was macht der VmChamp?"}, {"id": 443, "start": 3182.08, "end": 3187.56, "text": "Der VmChamp erlaubt das, der Name ist natürlich, bei mir heißt ja alles irgendwie was mit Champ"}, {"id": 444, "start": 3187.56, "end": 3193.08, "text": "hinten dran. Man kann damit, wobei guckt euch, guckt euch die ReadMe an, da steht ja eigentlich"}, {"id": 445, "start": 3193.08, "end": 3203.24, "text": "alles drin. Simple and fast creation of throw away VMs on your local machine. Connect via SSH in"}, {"id": 446, "start": 3203.24, "end": 3211.8, "text": "just a few seconds. We are all sitting in one boat. Nicht Vagrant. Anderer Anwendungszweck als"}, {"id": 447, "start": 3211.8, "end": 3220.04, "text": "Vagrant. Das stimmt nicht so wirklich. Anderer Anwendungszweck als Vagrant. Vagrant ist ja eher"}, {"id": 448, "start": 3220.04, "end": 3228.56, "text": "ein, so ein bisschen so ein Automatisierungstool für VMs. Da kannst du ja auch custom Sachen"}, {"id": 449, "start": 3228.56, "end": 3234.84, "text": "dran anpassen und sowas. Dafür ist es schwierig mit Vagrant quasi vom gleichen Ordner, vom gleichen"}, {"id": 450, "start": 3234.84, "end": 3239.24, "text": "Vagrant-File, wenn ich es zumindest noch richtig in Erinnerung habe, zehnmal die gleiche VM zu"}, {"id": 451, "start": 3239.24, "end": 3247.84, "text": "starten und sowas. Und Vagrant ist halt ziemlich oldschool mit Ruby und es unterstützt KVM nicht"}, {"id": 452, "start": 3247.84, "end": 3254.32, "text": "standardmäßig, nur mit Third-Party-Provider. Ich wollte ein simples Tool haben, wo ich mit einem"}, {"id": 453, "start": 3254.32, "end": 3259.84, "text": "Befehl lokal bei mir eine VM anlegen kann, um was auszuprobieren. Und warum will ich das haben?"}, {"id": 454, "start": 3259.84, "end": 3265.44, "text": "Naja, weil es gehen halt nicht Container für alles. Genau das ist der Grund, warum ich es gemacht"}, {"id": 455, "start": 3265.6, "end": 3272.96, "text": "habe. Es ist nicht immer möglich, alles in Containern zu machen. Zum Beispiel, wenn man"}, {"id": 456, "start": 3272.96, "end": 3278.4, "text": "Kernel-Module braucht oder zum Beispiel, wenn man irgendwelche in Docker-Schweinereien machen will."}, {"id": 457, "start": 3278.4, "end": 3286.4, "text": "Das kann man zwar meistens irgendwie noch regeln oder wenn man mehr als eine Sache laufen will,"}, {"id": 458, "start": 3286.4, "end": 3293.68, "text": "wenn man sich Packages inszenieren will aus dem Repo, die vielleicht irgendwelche Module"}, {"id": 459, "start": 3293.68, "end": 3302.08, "text": "nachlädt. Also manchmal macht es einen Docker-Container einfach nicht. Manchmal braucht es eine VM."}, {"id": 460, "start": 3302.08, "end": 3311.08, "text": "Ja zum Beispiel, bestes bestes Beispiel dafür, man möchte einen GitLab-Runner oder einen"}, {"id": 461, "start": 3311.08, "end": 3320.6, "text": "GTA-Runner jetzt mal lokal testen. Kannste knicken mit Docker in Docker. Das wäre nämlich Docker in"}, {"id": 462, "start": 3320.6, "end": 3323.96, "text": "Docker in Docker in Docker. Und irgendwann hört es dann auch auf, gescheit zu funktionieren."}, {"id": 463, "start": 3323.96, "end": 3340.36, "text": "Und das ist dann halt ein bisschen blöd. Das müsstest du machen, das müsstest du machen,"}, {"id": 464, "start": 3340.36, "end": 3353.8, "text": "um beispielsweise einen GitLab-Runner. Nee, nee, nee. Der Runner ist Docker in Docker in Docker."}, {"id": 465, "start": 3359.8, "end": 3364.08, "text": "Also für alles, wo du keine VM, wo du keinen Container verwenden kannst und das habe ich"}, {"id": 466, "start": 3364.08, "end": 3374.6, "text": "manchmal, ist das ganz sinnvoll. Und es gibt einfach nichts Gescheites dafür. Das Beste,"}, {"id": 467, "start": 3374.6, "end": 3381.72, "text": "was ich auf GitLab gefunden habe, ist das hier. Das ist ein Projekt von einem Spanier oder so,"}, {"id": 468, "start": 3381.72, "end": 3388.48, "text": "wahrscheinlich. Der hat in Bash sich was zusammengescriptet, was die lokale VMs anlegt."}, {"id": 469, "start": 3388.48, "end": 3393.44, "text": "Deswegen habe ich selbst was gebaut dafür und das funktioniert folgendermaßen. Ich zeige euch"}, {"id": 470, "start": 3393.44, "end": 3398.84, "text": "das mal. Ich muss übrigens eine Sache vorher mal machen, weil das immer, wobei, nee, muss ich"}, {"id": 471, "start": 3398.84, "end": 3403.84, "text": "gar nicht machen. Müsste eigentlich auch so funktionieren, weil das in Verbindung mit VM"}, {"id": 472, "start": 3403.84, "end": 3409.04, "text": "manchmal buggt. Also was man machen kann ist, ich demonstriere euch das jetzt einfach mal kurz."}, {"id": 473, "start": 3409.04, "end": 3418.56, "text": "Ihr könnt zum Beispiel sagen, VMChamp, run, Name für die VM, test-vm. Ihr habt übrigens bei"}, {"id": 474, "start": 3418.56, "end": 3423.0, "text": "allem Autocomplete hier an der Stelle. Test-vm. So und jetzt könnt ihr entweder sagen, in"}, {"id": 475, "start": 3423.0, "end": 3428.36, "text": "Background, Disk, Local Image Remedings. Ihr müsst aber auch gar nichts angeben. Ihr könnt es einfach"}, {"id": 476, "start": 3428.36, "end": 3434.48, "text": "so leer lassen und ausführen. Dann lädt ein aktuelles, Default ist Debian, dann lädt ein"}, {"id": 477, "start": 3434.48, "end": 3444.0, "text": "aktuelles Debian Cloud Image runter und startet die VM. Und nach kürzerer Zeit, ich mache mal"}, {"id": 478, "start": 3444.0, "end": 3447.52, "text": "den Wirtmanager auf, dass wir zugucken können. Das ist normalerweise natürlich nicht notwendig"}, {"id": 479, "start": 3447.52, "end": 3457.68, "text": "dafür. Der hoffentlich sich jetzt verbindet. Guckt, die VM bootet. Also wie gesagt, die braucht man"}, {"id": 480, "start": 3457.68, "end": 3464.48, "text": "eigentlich nicht. Die VM bootet und die connectet sich jetzt auch gleich im Netzwerk und dann"}, {"id": 481, "start": 3464.48, "end": 3471.0, "text": "connectet er sich direkt per SSH auf die VM. Zack, ist meine VM am Start. Also viel einfacher geht"}, {"id": 482, "start": 3471.0, "end": 3476.2, "text": "es nicht, um eine lokale VM zu erstellen. Jetzt ist man auf der VM drauf, kann da irgendwelche"}, {"id": 483, "start": 3476.28, "end": 3482.2, "text": "Dinger treiben und wenn man fertig ist, in seiner VM Sachen auszuprobieren. Das Coole ist halt auch"}, {"id": 484, "start": 3482.2, "end": 3486.16, "text": "hier, dass man jetzt eine richtig echte VM hat. Man kann jetzt sowas hier machen wie Modprobe"}, {"id": 485, "start": 3486.16, "end": 3494.8, "text": "minus R PC Speaker oder PC Speaker. Nee, wie heißt denn das überhaupt? Ach, keine Ahnung."}, {"id": 486, "start": 3494.8, "end": 3502.52, "text": "PC. Ach, PC Speaker ist im Cloud Image vielleicht gar nicht drinnen. Zumindest,"}, {"id": 487, "start": 3502.84, "end": 3506.84, "text": "kann ich Kernel-Module laden und entladen, was halt so in Docker-Containern nicht funktioniert."}, {"id": 488, "start": 3506.84, "end": 3514.04, "text": "Und du kannst auch alles andere machen, was du in so einer VM machst. Wenn du fertig bist,"}, {"id": 489, "start": 3514.04, "end": 3518.72, "text": "du kannst noch eine zweite VM starten und sonst was. Wenn du fertig bist, kannst du die VM entweder,"}, {"id": 490, "start": 3518.72, "end": 3524.88, "text": "wenn du siehst, hier überall Autocomplete, kannst du die VM entweder wieder löschen oder du kannst"}, {"id": 491, "start": 3524.88, "end": 3529.72, "text": "noch eine zweite VM erstellen, wenn du vielleicht noch mehr brauchst zum Testen. Und da sagen wir"}, {"id": 492, "start": 3529.72, "end": 3534.48, "text": "jetzt mal, okay, da brauchen wir was anderes. Da brauchen wir jetzt hier einen Ubuntu. Ubuntu"}, {"id": 493, "start": 3534.48, "end": 3539.04, "text": "2004 brauchen wir oder komm, Schein an. Wir nehmen einfach noch mal einen Debian, weil dann"}, {"id": 494, "start": 3539.04, "end": 3542.96, "text": "ist das ISO schon runtergeladen. Also wir brauchen einen Debian, allerdings brauchen wir jetzt ein"}, {"id": 495, "start": 3542.96, "end": 3547.68, "text": "bisschen mehr Arbeitsspeicher. Hier 1024 MB Arbeitsspeicher und wir brauchen eine größere"}, {"id": 496, "start": 3547.68, "end": 3553.2, "text": "Festplatte für die VM, hier 32G. Und die VM mit dem Namen gibt es schon, deswegen erstellen wir"}, {"id": 497, "start": 3553.2, "end": 3559.32, "text": "Test VM 2. Und dann fährt er eine zweite VM hoch und alles ist gut. Wirt Manager braucht man"}, {"id": 498, "start": 3559.32, "end": 3567.88, "text": "dafür nicht. Das ist wirklich sehr nice für lokale Test VMs, die man kurzzeitig mal braucht,"}, {"id": 499, "start": 3567.88, "end": 3575.64, "text": "was auszuprobieren und dann wieder wegzuschmeißen. Ja, und wenn man dann fertig ist, wenn man das dann,"}, {"id": 500, "start": 3575.64, "end": 3579.6, "text": "wenn man dann fertig ausprobiert hat, das war mir nämlich auch wichtig, dass man den ganzen"}, {"id": 501, "start": 3579.6, "end": 3584.28, "text": "Krempel rückstandslos, rückstandslos wieder wegbekommt. Wenn er irgendwann dann gestartet"}, {"id": 502, "start": 3584.28, "end": 3588.88, "text": "ist und Netzwerkverbindung hat. So, jetzt bin ich fertig. Jetzt kann ich erst mal gucken,"}, {"id": 503, "start": 3588.88, "end": 3593.64, "text": "wie viele VMs habe ich denn. Kann ich mir das Ganze auflisten lassen. Wenn ich connecten will"}, {"id": 504, "start": 3593.64, "end": 3598.92, "text": "auf so eine Test VM, kann ich das PSSH machen. Direkt hiermit, der sucht sich das dann raus und"}, {"id": 505, "start": 3598.92, "end": 3627.68, "text": "connectet einer mit. Ja. Und ansonsten. Das Teil managt auch die SSH Keys dafür. Es nimmt die"}, {"id": 506, "start": 3627.68, "end": 3636.92, "text": "SSH Keys, die bei dir in deinem SSH-Verzeichnis liegen. Ja. So, und wenn du fertig bist und das"}, {"id": 507, "start": 3636.92, "end": 3640.44, "text": "war mir wichtig, dass man das hat. Also wie gesagt, man kann sich alles auflisten lassen,"}, {"id": 508, "start": 3640.44, "end": 3644.44, "text": "was man gerade laufen hat oder welche Betriebssysteme unterstützt sind standardmäßig."}, {"id": 509, "start": 3644.44, "end": 3648.84, "text": "Man kann auch ein lokales, man kann auch sagen Local Image und da eins übergeben. Ja, das geht"}, {"id": 510, "start": 3648.84, "end": 3654.32, "text": "auch. Und wenn man fertig ist, sagt man einfach VMChem clean. Man fragt da ein noch mal. Hey,"}, {"id": 511, "start": 3654.4, "end": 3660.92, "text": "ich lösche alles. Alle Images, alle VMs. Dann sagst du ja, okay, alles klar. Und alle VMs sind"}, {"id": 512, "start": 3660.92, "end": 3666.08, "text": "weg. Alle Images sind weg. Das heißt, aller Speicherplatz ist freigegeben. Also für kleine,"}, {"id": 513, "start": 3666.08, "end": 3672.08, "text": "lokale Test VMs habe ich mir sowas schon die ganze Zeit gewünscht. Vor allem,"}, {"id": 514, "start": 3672.08, "end": 3677.0, "text": "weil es Cloud Images sind. Wenn man eine lokale Test VM braucht, normalerweise legt man eine neue"}, {"id": 515, "start": 3677.0, "end": 3684.32, "text": "VM an, legt das ISO ein, klickt den Installer durch und das ist halt doof. Man könnte beim"}, {"id": 516, "start": 3684.32, "end": 3698.28, "text": "Clean noch die VMs auflisten, die gelöscht werden. Könnte man Theoretisch. Ich weiß nicht,"}, {"id": 517, "start": 3698.28, "end": 3703.6, "text": "wie sinnig das ist, wenn ich sage, ich bin fertig. Ist das auch auf Windows-Support? Es sei denn,"}, {"id": 518, "start": 3703.6, "end": 3713.16, "text": "Windows unterstützt LibVirt. Das habe ich so meine Zweifel. Ne. Du brauchst LibVirt und das"}, {"id": 519, "start": 3713.16, "end": 3718.0, "text": "heißt im Prinzip eigentlich in der Regel die Kombination. Also VMWare würde gehen. VMWare"}, {"id": 520, "start": 3718.0, "end": 3725.24, "text": "würde gehen. Ich habe keine Ahnung, ob LibVirt in WSL geht. Das könnte man mal ausprobieren."}, {"id": 521, "start": 3726.24, "end": 3732.92, "text": "Ach, Remote KVM, ja. Weil ich glaube, KVM wird nicht wirklich funktionieren."}, {"id": 522, "start": 3732.92, "end": 3739.2, "text": "Geht KVM in WSL im Leben nicht, oder?"}, {"id": 523, "start": 3739.2, "end": 3750.44, "text": "Was? Okay, dann würde es in WSL funktionieren."}, {"id": 524, "start": 3750.44, "end": 3772.0, "text": "Ganz schimmer. Keine Ahnung, ob KVM gescheit funktioniert in WSL. Aber dann würde es funktionieren."}, {"id": 525, "start": 3772.0, "end": 3777.72, "text": "Man könnte es auch Clean All nennen. Ja, so. Dann kannste schmeißt alles weg. Was macht das"}, {"id": 526, "start": 3777.72, "end": 3795.8, "text": "KV-Command? Es ist auch da. Das Allerwichtigste. Und wir haben sogar letztens geguckt,"}, {"id": 527, "start": 3795.8, "end": 3810.72, "text": "wie viele KWs pro Sekunde wir schaffen. Relativ wenig. Also wir schaffen nur 2,3 Megabyte KWs"}, {"id": 528, "start": 3810.72, "end": 3824.12, "text": "die Sekunde. Da geht noch mehr. Ach ja, und wenn man Help eingibt, ist KW nicht gelistet. Das ist"}, {"id": 529, "start": 3824.6, "end": 3832.8, "text": "ein Easter Egg. Und ihr wisst es jetzt, Chat. Kannste auch einzelne Frames vom Video so ausgeben?"}, {"id": 530, "start": 3832.8, "end": 3852.32, "text": "Hä? Das verstehe ich nicht. Jo. Und ansonsten, was ich auch sehr nice finde,"}, {"id": 531, "start": 3852.32, "end": 3862.24, "text": "KW-Video in die Konsole. Das ist kein GIF, das ist ein Stratisches Bild. Also was ich machen kann,"}, {"id": 532, "start": 3862.24, "end": 3875.96, "text": "ist, weil ich das beste Terminal ever verwende, ist, ich kann GIFs in der Konsole abspielen."}, {"id": 533, "start": 3875.96, "end": 3889.56, "text": "Ganz essentielles Feature. Und theoretisch jedes x-beliebige Video, wenn ich es vorher mit FFM"}, {"id": 534, "start": 3889.56, "end": 3896.0, "text": "Pack nach GIF umwandle, was man wahrscheinlich nicht will. Wie heißt das Terminal? West Term."}, {"id": 535, "start": 3896.0, "end": 3903.8, "text": "Bestes. West Term. Kann ich euch wirklich nur wärmsten empfehlen? Es gibt es für Mac, Linux,"}, {"id": 536, "start": 3903.8, "end": 3911.92, "text": "Windows, hat Image Support, hat super Customizable Config, ist GPU gerendert, ist für mich so das"}, {"id": 537, "start": 3911.92, "end": 3917.0, "text": "beste Terminal, was ich die letzten Jahre über entdeckt habe. Find ich besser als die ganzen"}, {"id": 538, "start": 3917.0, "end": 3923.3, "text": "anderen neueren Terminals, die es so gibt. Vor allem weil es auch TMAX-Funktionalitäten,"}, {"id": 539, "start": 3923.3, "end": 3933.34, "text": "also das was TMAX hatte, auch direkt im Terminal bietet. Mit Z. West Term. Hier,"}, {"id": 540, "start": 3933.34, "end": 3944.42, "text": "ich habe es doch gerade gezeigt. West Term. Jo. Und was ich auch haben wollte und was tatsächlich"}, {"id": 541, "start": 3944.42, "end": 3948.94, "text": "ein bisschen kompliziert war einzubauen, ihr werdet, guck mal, ich habe Autocomplete für"}, {"id": 542, "start": 3948.94, "end": 3955.82, "text": "alle Sachen. Und wenn ich, beide kann ich an der Stelle zeigen, wenn ich eine VM laufen habe,"}, {"id": 543, "start": 3955.82, "end": 3965.62, "text": "dann habe ich sogar Autocomplete für die Kommandos hier. Also wenn ich jetzt sage löschen,"}, {"id": 544, "start": 3965.62, "end": 3971.22, "text": "ich will eine VM löschen, dann Autocomplete, da sogar alle VMs, die er selbst angelegt hat."}, {"id": 545, "start": 3971.22, "end": 3975.86, "text": "Nur VMs, die er selbst angelegt hat. Also das löscht ja nicht alle VMs, sondern die VMs,"}, {"id": 546, "start": 3975.86, "end": 3983.58, "text": "die er selbst angelegt hat. Ja. Und Autocomplete ist auch total easy zu konfigurieren. Man kann"}, {"id": 547, "start": 3983.58, "end": 3993.1, "text": "nämlich einfach sagen vmchamp, ich glaube completion. Ja. Minus minus completion zsh."}, {"id": 548, "start": 3993.1, "end": 3999.78, "text": "Und dann kriegt man so eine Funktion ausgespuckt, die kann man in seine zshrc packen oder man macht"}, {"id": 549, "start": 3999.78, "end": 4009.38, "text": "das so wie ich und packt einfach source da drauf. So source vmchamp completion zsh. Und dann hat"}, {"id": 550, "start": 4009.38, "end": 4014.54, "text": "man shell completion für alle seine lokalen test vms. Ja, so sieht es aus. Und ich dachte,"}, {"id": 551, "start": 4014.54, "end": 4019.14, "text": "wir bauen heute mal ein paar kleine Sachen noch ein. Ich habe das innerhalb von einem Tag"}, {"id": 552, "start": 4019.14, "end": 4025.58, "text": "zusammengefrickelt, dieses, das Tool. Was heißt zusammengefrickelt? Eigentlich ist der"}, {"id": 553, "start": 4025.58, "end": 4031.34, "text": "source code sogar relativ gut lesbar. Also kann sich jeder, jeder der will, kann sich das zur"}, {"id": 554, "start": 4031.34, "end": 4041.38, "text": "Gemüte führen. Ist, ich finde relativ gut lesbar alles. Und ich habe da jetzt mehr Spaß dran,"}, {"id": 555, "start": 4041.38, "end": 4045.02, "text": "da weiter dran zu basteln, als ich eigentlich gedacht habe. Ich habe es ja ursprünglich gemacht,"}, {"id": 556, "start": 4045.02, "end": 4049.3, "text": "weil ich mir selbst so ein Tool gewünscht habe für schnelle lokale test VMs direkt zum wieder"}, {"id": 557, "start": 4049.3, "end": 4054.98, "text": "wegschmeißen danach. Und jetzt habe ich irgendwie Bock, da noch ein paar kleine Kleinigkeiten"}, {"id": 558, "start": 4054.98, "end": 4066.98, "text": "einzubauen. Was wird gebastelt? Wir erweitern den vmchamp heute um ein paar Kleinigkeiten. Was"}, {"id": 559, "start": 4066.98, "end": 4072.86, "text": "ist der vmchamp? Kannst du dir durchlesen auf github beziehungsweise die readme überspringen."}, {"id": 560, "start": 4072.86, "end": 4077.86, "text": "Damit kannst du lokale test vms erstellen innerhalb von ein paar Sekunden. Mal velkrim, ja,"}, {"id": 561, "start": 4077.9, "end": 4081.82, "text": "habe ich früher, habe ich relativ viel velkrim benutzt. Wobei velkrim ein bisschen in anderen"}, {"id": 562, "start": 4081.82, "end": 4089.62, "text": "Anwendungsfall abdeckt und das Problem hat, dass es nicht mit kvm native zusammenarbeitet,"}, {"id": 563, "start": 4089.62, "end": 4095.5, "text": "sondern nur mit virtualbox. Und da habe ich gar keinen Bock drauf. Ich weiß, es gibt einen kvm"}, {"id": 564, "start": 4095.5, "end": 4107.82, "text": "thirdparty plugin wohl. Aber was du mit vkrim nicht machen kannst ist, keine Ahnung, auf die schnelle"}, {"id": 565, "start": 4107.82, "end": 4113.94, "text": "eine debian, eine fedora und nochmal drei ubuntu vms starten. Du brauchst dann einen pfile drinnen,"}, {"id": 566, "start": 4113.94, "end": 4119.78, "text": "mit vkrim pfile, mit vkrim up einmalig und sowas. Ja, das ist, das ist hat, finde ich,"}, {"id": 567, "start": 4119.78, "end": 4128.7, "text": "ein bisschen anderen Anwendungszweck. Vakrant ist quasi noch aus Zeiten, wo terraform und"}, {"id": 568, "start": 4128.7, "end": 4133.66, "text": "solche Sachen noch nicht existiert haben. Was übrigens von der gleichen Firma ist,"}, {"id": 569, "start": 4133.66, "end": 4142.06, "text": "falls ihr das nicht wisst. Der Vakrant Erfinder ist der haschi haschi korb Gründer. Und das"}, {"id": 570, "start": 4142.06, "end": 4148.1, "text": "wurde, das hat er quasi schon erfunden davor. Es passt auch irgendwie zusammen, dass das die"}, {"id": 571, "start": 4148.1, "end": 4156.34, "text": "gleichen Dudes sind, weil der gleiche Typ ist. Hast du eine Description Vorlage für deine Repos?"}, {"id": 572, "start": 4156.34, "end": 4166.78, "text": "Nee, die mache ich eigentlich immer so, wie es passt. Die Readme, das Format der Readme"}, {"id": 573, "start": 4166.78, "end": 4173.38, "text": "habe ich tatsächlich von einem unserer Mods geklaut. Ja, und es ist ganz einfach. Du kannst"}, {"id": 574, "start": 4173.74, "end": 4178.58, "text": "einfach eine vm lokal starten und dann verbindet sich per Netzwerk dahin, wenn es nicht zu lange"}, {"id": 575, "start": 4178.58, "end": 4181.62, "text": "dauert. So, also es gibt ein paar Sachen, die ich heute machen will. Wir müssen mal ein bisschen"}, {"id": 576, "start": 4181.62, "end": 4187.66, "text": "ein bisschen was, ein bisschen was anfangen heute. Also ich mache mal kurz hier to do's,"}, {"id": 577, "start": 4187.66, "end": 4192.86, "text": "to do's für heute. Also was haben wir am Start? Was will ich machen? Ich will einmal die ganzen"}, {"id": 578, "start": 4192.86, "end": 4198.58, "text": "megabyte angaben zu megabyte, maybe bytes, maybe byte, wie auch immer zu megabyte ändern,"}, {"id": 579, "start": 4198.58, "end": 4208.26, "text": "weil keine Sau, ehrlich gesagt, kann was mit, passt mal auf, keiner kann was anfangen mit"}, {"id": 580, "start": 4208.26, "end": 4221.46, "text": "976,56, maybe, maybe byte. Man kann sich denken, dass es 1024 megabytes sind. Für den Arsch."}, {"id": 581, "start": 4221.46, "end": 4243.02, "text": "Kann das mehr als Knoam als was? Knoam Boxes? Soll das Boxes heißen? Knoam Boxes. Ja, es ist ein"}, {"id": 582, "start": 4243.02, "end": 4251.78, "text": "Kommando Zeilentool. Das kann ein Kommando Zeilentool sein. Und es ist dafür gedacht,"}, {"id": 583, "start": 4251.78, "end": 4255.82, "text": "dass man vm's anlegt und danach gleich wieder wegschmeißt. Es geht hier nicht um den generellen"}, {"id": 584, "start": 4255.82, "end": 4263.18, "text": "vm Manager oder sowas. Anlegen, PSSH drauf, connecten, was ausprobieren für 20 Minuten und"}, {"id": 585, "start": 4263.18, "end": 4267.9, "text": "wieder wegschmeißen, weil spätestens nach dem Reboot sind die vm's eh wieder weg und alles"}, {"id": 586, "start": 4267.9, "end": 4273.46, "text": "wieder aufgeräumt. Sollte was nicht aufgeräumt sein, sagste einfach vm-champ, clean und alles"}, {"id": 587, "start": 4273.46, "end": 4288.14, "text": "ist wieder weg. Und Wirt Manager ist immer noch das beste, was es gibt, wenn man wirklich in GUI"}, {"id": 588, "start": 4288.14, "end": 4292.62, "text": "braucht und was damit machen will. Werden die Downloads gecached? Ja, werden sie. Guck mal,"}, {"id": 589, "start": 4292.62, "end": 4297.3, "text": "jetzt habe ich gerade einen clean ausgeführt, also sprich, da hat alle Images und vm's gelöscht,"}, {"id": 590, "start": 4297.3, "end": 4303.5, "text": "aber ich zeig's dir noch mal. Also erstens er nimmt die Cloud-Images, was eh schon mal"}, {"id": 591, "start": 4303.5, "end": 4308.18, "text": "deutlich leichtgewichtiger ist als die ganzen anderen Images. Das funktioniert folgendermaßen,"}, {"id": 592, "start": 4308.18, "end": 4316.18, "text": "ich mach mal... Was? Ah ja, okay. Kannst du mal ein Beispiel nennen? Naja, zum Beispiel,"}, {"id": 593, "start": 4316.18, "end": 4321.66, "text": "wenn ein Container nicht ausreicht, sei es wenn du Kernel-Module brauchst oder du mal"}, {"id": 594, "start": 4321.66, "end": 4326.18, "text": "irgendeinen Continuous Integration Tool Runner testen willst, wie wir letztens zum Beispiel hatten"}, {"id": 595, "start": 4326.18, "end": 4332.78, "text": "und keinen Bock hast auf Docker, in Docker, in Docker und Prey machen musst, dass es funktioniert."}, {"id": 596, "start": 4332.78, "end": 4342.26, "text": "Manchmal sind vm's noch ganz sinnvoll zum Testen. Und ich hab mir die ganze Zeit eben schon so einen"}, {"id": 597, "start": 4342.26, "end": 4347.78, "text": "Tool gewünscht, wo du sagst, hey, lass mal schnell eine Test-VM starten, lokal, ein vollständiges"}, {"id": 598, "start": 4347.78, "end": 4352.5, "text": "Betriebssystem, also auch mit einem System D drauf, wo man auch mal irgendeinen Init-Skript"}, {"id": 599, "start": 4352.5, "end": 4358.26, "text": "testen kann. Das kannst du ja in Docker Containern nicht machen. Wenn du beispielsweise mal ein Unit"}, {"id": 600, "start": 4358.26, "end": 4364.82, "text": "File erstellen willst und gucken... Du musst irgendeinen Package machen mit einem Unit File und gucken"}, {"id": 601, "start": 4364.82, "end": 4368.46, "text": "musst, ob du willst, ob das startet und sowas. Das kannst du alles nicht im Container gescheit"}, {"id": 602, "start": 4368.46, "end": 4375.5, "text": "machen. Also es gibt Fälle, da ist ein Container nicht so praktisch. Aber das ist auch nichts,"}, {"id": 603, "start": 4375.5, "end": 4381.42, "text": "wo du jetzt dir eine neue VM anlegen willst, hier, mal eine Debian-Install durchlaufen lassen willst,"}, {"id": 604, "start": 4381.74, "end": 4387.9, "text": "du willst eine kurze vollwertige VM haben, drauf was ausprobieren und wieder wegschmeißen. Im Prinzip"}, {"id": 605, "start": 4387.9, "end": 4395.58, "text": "ein bisschen wie wenn du zum Testen mal schnell einen Container startest mit, ihr Docker run,"}, {"id": 606, "start": 4395.58, "end": 4402.82, "text": "bla bla bla. Nur, dass es halt eine VM ist. Und natürlich bei weitem nicht so sophisticated"}, {"id": 607, "start": 4402.82, "end": 4407.26, "text": "Management wie Docker und soll's ja auch, soll's ja auch gar nicht. Ja, und jetzt die Downloads"}, {"id": 608, "start": 4407.26, "end": 4411.82, "text": "werden gecashed. Guck mal, ich hab grad ein Debian-System gestartet und wenn ich jetzt ein"}, {"id": 609, "start": 4411.82, "end": 4418.34, "text": "zweites Debian-System starte, dann use der das Existing Image und es geht schneller."}, {"id": 610, "start": 4418.34, "end": 4433.22, "text": "Ich mein, booten und IP ziehen muss die VM immer noch. So, also. Was will ich denn sonst noch"}, {"id": 611, "start": 4433.22, "end": 4437.98, "text": "machen? Dann will ich noch eine Ausgabe haben, das hat mich tatsächlich letztens der Stream"}, {"id": 612, "start": 4437.98, "end": 4443.78, "text": "draufgebracht. Wenn ich sage, List oder LS oder wie auch immer oder PS, ich glaube,"}, {"id": 613, "start": 4443.78, "end": 4448.9, "text": "ich hab das alles gealliast, dass man sich's merken kann. Hätte ich gerne hier noch eine"}, {"id": 614, "start": 4448.9, "end": 4454.98, "text": "Ausgabe, ob die running ist oder vielleicht gecrasht ist oder irgendwie sowas in der Richtung. Also"}, {"id": 615, "start": 4454.98, "end": 4463.06, "text": "Status bei LS. Ja, und jetzt kann man einfach alles wieder wegschmeißen,"}, {"id": 616, "start": 4463.06, "end": 4467.46, "text": "alle Images und VMs sind weg. Finde ich sehr praktisch."}, {"id": 617, "start": 4484.98, "end": 4511.62, "text": "So, war der letzte Arbeitstag schon? Nee, mein letzter Arbeitstag ist übermorgen, am Mittwoch."}, {"id": 618, "start": 4511.62, "end": 4524.7, "text": "So, also das will ich machen. Status bei LS, ob VM running oder gecrasht oder so. Dann hätte"}, {"id": 619, "start": 4524.7, "end": 4529.98, "text": "ich gerne noch Images, mehr Images und zwar Arch-By-The-Way-Image muss natürlich sein."}, {"id": 620, "start": 4529.98, "end": 4536.1, "text": "Fedora und vielleicht CentOS? Nee, keine. Was brauchen wir denn noch? Aktuell hab ich nur"}, {"id": 621, "start": 4536.66, "end": 4541.38, "text": "Ubuntu. Also kommt mir nicht mit Suse, Suse bau ich nicht ein. Auf Suse hab ich keinen Bock."}, {"id": 622, "start": 4541.38, "end": 4558.9, "text": "Suse, Suse. Windows? Nee. Windows wird nicht funktionieren. Windows, alter Leute. Red Hat,"}, {"id": 623, "start": 4558.9, "end": 4567.06, "text": "ich weiß nicht. Wenn schon CentOS. Debian haben wir. Debian und Ubuntu Images haben wir. Also"}, {"id": 624, "start": 4567.06, "end": 4575.34, "text": "ist es drinne. Debian 11, 10, 9 und Ubuntu 18.04, 20.04 und 22.04. Nein Leute, ich mein's ernsthaft."}, {"id": 625, "start": 4575.34, "end": 4581.94, "text": "Nee, irgendwelchen Blödsinn. Brauchen wir den? Brauchen wir den nicht. Also Arch-Mama rein,"}, {"id": 626, "start": 4581.94, "end": 4591.86, "text": "Fedora und CentOS reicht, glaube ich. Oracle, das ist vielleicht gar nicht so schlecht. Da können"}, {"id": 627, "start": 4591.86, "end": 4606.54, "text": "wir uns Red Hat sparen, weil das aktuelle Oracle ist ja ein Red Hat-Klon. Willst du die Liste mit"}, {"id": 628, "start": 4606.54, "end": 4612.98, "text": "den Images hardcone? Ja, hab ich schon. Aber wenn du ein eigenes Image angeben willst, kannst du das"}, {"id": 629, "start": 4612.98, "end": 4622.26, "text": "auch machen. Also aktuell hat er ein Images drinne. Debian 11, 10, 9 und Ubuntu 18.04, 20.04 und 22.04."}, {"id": 630, "start": 4622.26, "end": 4630.46, "text": "Du kannst aber auch, du kannst aber auch ein lokales Image angeben, wenn du eins hast. Und es muss kein"}, {"id": 631, "start": 4630.46, "end": 4634.66, "text": "Debian sein oder es kann alles sein. Also wenn du ein lokales Image hast, kannst du auch ein lokales"}, {"id": 632, "start": 4634.66, "end": 4644.38, "text": "Image angeben. Was macht da VM-Champ? Lokale VMs starten. Du kannst hier die GitHub-Readme durchlesen,"}, {"id": 633, "start": 4644.38, "end": 4649.7, "text": "wenn du willst hier. Lokale, ich hab's jetzt nämlich schon zehnmal erzählt gerade. Lokale"}, {"id": 634, "start": 4649.7, "end": 4654.54, "text": "VMs starten, die du danach wieder wegschmeißen kannst. Für den Fall der Fälle, dass ein Docker-Container"}, {"id": 635, "start": 4654.54, "end": 4660.22, "text": "nicht ausreichend ist. Und er kann Kegway auf der Konsole posten. Holy Luck, Gamers. Dankeschön."}, {"id": 636, "start": 4660.22, "end": 4676.3, "text": "Eventuell das Repo im Titel verlinken. Ach nee. Alma. Da muss ich euch was fragen mal. Habt ihr"}, {"id": 637, "start": 4676.3, "end": 4685.62, "text": "Erfahrung mit Rocky Linux oder Alma Linux? Das sind ja quasi zwei Red Hat-Clones jetzt,"}, {"id": 638, "start": 4685.62, "end": 4701.1, "text": "seit CentOS nicht mehr ist. Was davon würdet ihr bevorzugen? Ich mach das Repo doch in Titel."}, {"id": 639, "start": 4715.62, "end": 4725.34, "text": "Mir fällt übrigens eine Sache ein. Ich glaube, ich sollte die Release-Datei umbenennen. Kann"}, {"id": 640, "start": 4725.34, "end": 4731.98, "text": "man den Kram umbenennen nachträglich noch? Nee, oder? Man kann es nur neu oder kann man das"}, {"id": 641, "start": 4731.98, "end": 4741.66, "text": "umbenennen? Noch nie machen müssen. Nee, man kann das umbenennen. Cool. Wie nennt man das dann?"}, {"id": 642, "start": 4741.66, "end": 4750.5, "text": "VMChamp? Das ist eine gute Bezeichnung. Linux? AMD 64 oder so? Wie benennt man den Scheiß"}, {"id": 643, "start": 4750.5, "end": 4775.66, "text": "gescheit? Irgendwie eine Five-Hater-Idee? Wie machen die das denn? Wie benennen die ihre"}, {"id": 644, "start": 4775.66, "end": 4787.78, "text": "Runner denn? Hat doch letztens runtergeladen. Download? Okay, so benennen sie das. AMD hier,"}, {"id": 645, "start": 4787.78, "end": 4798.74, "text": "Linux, AMD 64. Sehr schön, so machen wir das auch. VMChamp, Linux, AMD 64. Jetzt weiß auch jeder,"}, {"id": 646, "start": 4798.74, "end": 4806.9, "text": "wofür das Binary ist. VMChamp PDF Screensaver. Nein, das ist out. Das ist out. Man nennt die"}, {"id": 647, "start": 4806.9, "end": 4816.26, "text": "Dinger heute .doc.exe. From left to right mit arabischen Buchstaben. So machen das die Five-Hater."}, {"id": 648, "start": 4828.74, "end": 4837.14, "text": "Also weiter, so. Dann, was ich auch noch machen wollte ist, das sind alles Sachen,"}, {"id": 649, "start": 4837.14, "end": 4843.02, "text": "die dauern jetzt einzelne Schritte, nicht so lange. Dann hätte ich gerne noch die Möglichkeit über"}, {"id": 650, "start": 4843.02, "end": 4850.38, "text": "die CLI eine VM zu rebooten. So blöds klingt, das geht aktuell noch nicht. Man kann nur die VM"}, {"id": 651, "start": 4850.38, "end": 4855.62, "text": "löschen und wieder erstellen, aber manchmal möchte man ja auch mal rebooten, zum Beispiel,"}, {"id": 652, "start": 4855.62, "end": 4861.9, "text": "um ein Unit-File zu testen oder sowas. Manchmal ist ein Reboot nicht verkehrt. Und sei es nur,"}, {"id": 653, "start": 4861.9, "end": 4872.26, "text": "das Ding ist vielleicht abgekackt und du willst es resetten. Ja, moment, ja, rebooten. Mit einem"}, {"id": 654, "start": 4872.86, "end": 4884.18, "text": "Force-Switch. Dann recreate, wenn die VM schon existiert, ne Abfrage, ja, nein, neu erstellen."}, {"id": 655, "start": 4884.18, "end": 4893.34, "text": "Auf allen VMs einen Befehl ausführen. Das würde ich nicht darüber machen. Das sollte man vielleicht"}, {"id": 656, "start": 4893.34, "end": 4901.74, "text": "besser per SSH machen, direkt. Weil ich will das nicht übertreiben an Features, ehrlich gesagt."}, {"id": 657, "start": 4901.74, "end": 4907.22, "text": "Ich meine, das ist für kleine Sachen und nicht, um irgendwie eine virtualisierte Umgebung zu"}, {"id": 658, "start": 4907.22, "end": 4915.38, "text": "orchestrieren oder sowas. Also den einen Vorschlag fand ich eben tatsächlich ganz gut. Da weiß ich"}, {"id": 659, "start": 4915.38, "end": 4919.74, "text": "aber nicht, ob es, nee, Klon muss nicht rein. Das brauchen wir nicht. Glaube ich nicht, oder?"}, {"id": 660, "start": 4919.74, "end": 4931.02, "text": "Nee. Cloud in den Zeugs benutzt es schon. Custom Pagages. Ich mache mal ein Fragezeichen dahinter bei"}, {"id": 661, "start": 4931.02, "end": 4942.42, "text": "Sachen, wo ich mir nicht ganz sicher bin. Der Chat will direkt Docker, ja. Nee. VM. Das weiß ich"}, {"id": 662, "start": 4942.42, "end": 4957.94, "text": "nicht, ob es eine gute Idee ist. Also Custom Commands nach Boot. Das könnte man tatsächlich"}, {"id": 663, "start": 4957.94, "end": 4964.1, "text": "machen. Das könnte man tatsächlich machen, weil ich verwende jetzt schon Cloudinit. Nee, Cloudinit"}, {"id": 664, "start": 4964.1, "end": 4969.3, "text": "erneut ausführen, das wird mir zu. Also alles, wo man eine Verbindung auf die VM braucht, ist doof."}, {"id": 665, "start": 4969.3, "end": 4974.18, "text": "Da müsste man das nämlich per SSH machen. Das wird dann nur funktionieren, wenn SSH-Login"}, {"id": 666, "start": 4974.18, "end": 4980.9, "text": "richtig geht und alles. Nee, Ressourcen-Monitor. Nee, nee. Da kannst du einfach Hardtop machen und"}, {"id": 667, "start": 4980.9, "end": 4991.74, "text": "gucken, ob QEMO viel braucht oder KVM viel braucht. Also."}, {"id": 668, "start": 4999.3, "end": 5011.26, "text": "Zum Beispiel Dashboard. Ja, so, das wird das Zeug neu erstellt und mehr fällt mir jetzt. Nee,"}, {"id": 669, "start": 5011.26, "end": 5018.58, "text": "nee, das mache ich nicht. Wenn man CPU und RAM changen will, dann muss man die VM ausschalten"}, {"id": 670, "start": 5018.58, "end": 5022.86, "text": "oder resetten oder was auch immer. Das ist, glaube ich, ich weiß nicht, da kann man, da könnte man"}, {"id": 671, "start": 5022.86, "end": 5027.94, "text": "sie einfach recreate. Es soll ja wirklich nichts großartig damit gemacht werden, wo man die VM drei"}, {"id": 672, "start": 5027.98, "end": 5039.26, "text": "Tage laufen lässt. Change RAM. Ja, mal überlegen, mal gucken. Nee, GPU-Pastel und sowas bestimmt nicht."}, {"id": 673, "start": 5039.26, "end": 5046.3, "text": "Aber Reboot, also ich glaube, das ist auch das erste, was wir machen danach. Also das machen wir"}, {"id": 674, "start": 5046.3, "end": 5052.86, "text": "jetzt als erstes, das ist easy. Und danach machen wir tatsächlich ein Reboot, weil Reboot sollte"}, {"id": 675, "start": 5053.66, "end": 5059.94, "text": "relativ einfach sein, Reboot zu implementieren für die VMs. Und Reboot ist tatsächlich sehr wichtig,"}, {"id": 676, "start": 5059.94, "end": 5068.06, "text": "weil so eine VM kann ja auch mal abkacken oder man möchte was testen in einer VM, was halt nur"}, {"id": 677, "start": 5068.06, "end": 5073.9, "text": "ausgeführt wird beim Start. Ja, beispielsweise irgendein Unit-Start-Config, was auch immer."}, {"id": 678, "start": 5073.9, "end": 5081.9, "text": "Ist das HKEY als Parameter? Naja, also aktuell ist es relativ easy gelöst. Aktuell nimmt er"}, {"id": 679, "start": 5081.9, "end": 5088.34, "text": "einfach alles aus deinem SSH-Verzeichnis an Public Keys. Ja, wir können vielleicht minusminus SSH,"}, {"id": 680, "start": 5088.34, "end": 5100.5, "text": "ID. Naja, das mit User-Parameter von Hand können wir nicht machen. Dann geht es kaputt, der Rest."}, {"id": 681, "start": 5100.5, "end": 5107.86, "text": "Ach so, User. Du meinst den Login-User. Ach nee, das glaubt das. Der User heißt standardmäßig"}, {"id": 682, "start": 5107.86, "end": 5112.7, "text": "User. Das reicht schon. Wie gesagt, es geht ja nicht um VMs, die dann remote benutzt werden sollen"}, {"id": 683, "start": 5112.7, "end": 5118.9, "text": "oder sowas, die dir dann drei Wochen laufen lässt, sondern erstellen, einloggen, testen,"}, {"id": 684, "start": 5118.9, "end": 5125.7, "text": "wegschmeißen. Aber das mit dem Befehl ausführen hinten dran finde ich tatsächlich ganz interessant"}, {"id": 685, "start": 5125.7, "end": 5131.26, "text": "und das könnte sogar sein, dass wir das relativ easy eingebaut bekommen. Und zwar, da bin ich mir"}, {"id": 686, "start": 5131.26, "end": 5136.42, "text": "nicht sicher, wie Cloud-Init richtig funktioniert, weil die VMs, die werden ja mit den Cloud-Images"}, {"id": 687, "start": 5136.42, "end": 5144.1, "text": "aufgebaut und da läuft einmal Cloud-Init. Ich glaube Snapshots, supported, werden nicht"}, {"id": 688, "start": 5144.1, "end": 5150.98, "text": "supported für... Können wir mal ausprobieren. Ich glaube Snapshots werden nicht supported für"}, {"id": 689, "start": 5150.98, "end": 5161.66, "text": "temporäre VMs. Können wir mal ausprobieren. So, was wollte ich jetzt zeigen? Mist. Ach so, Cloud-Init."}, {"id": 690, "start": 5161.66, "end": 5169.86, "text": "Die VMs werden gestartet und bekommen in ISO eingehängt, wo Cloud-Init-Files drauf sind. So"}, {"id": 691, "start": 5169.86, "end": 5174.7, "text": "konfigurieren die sich nämlich. Das heißt, ich kann hier ins Cloud-Init was reinschreiben."}, {"id": 692, "start": 5174.7, "end": 5185.02, "text": "Und theoretisch könnte man hier unten Custom-Commands reinbauen. VM Disk Size als Parameter,"}, {"id": 693, "start": 5185.02, "end": 5192.42, "text": "das gibt es schon. Das gibt es schon. Guck, du kannst hier Disk angeben, kannst sagen,"}, {"id": 694, "start": 5192.42, "end": 5201.74, "text": "keine Ahnung, 17 Gigabyte oder so. Oder du benutzt eines von den vorgefertigten Größen,"}, {"id": 695, "start": 5201.74, "end": 5209.5, "text": "die du mit deiner Tab-Completion kriegst. Was ich eh nice finde, dass das Ding Tab-Completion hat."}, {"id": 696, "start": 5209.5, "end": 5218.14, "text": "So, wir gucken mal, ob Snapshots... Ach so, ich bin doof. Jetzt habe ich es wieder gelöscht."}, {"id": 697, "start": 5218.14, "end": 5224.62, "text": "Der ist sehr schlau, Max. Super. Erstellt zum Ausprobieren und gleich wieder gelöscht."}, {"id": 698, "start": 5224.62, "end": 5230.14, "text": "So, guck mal, ich bin mir nicht sicher, ob Snapshots überhaupt unterstützt werden."}, {"id": 699, "start": 5230.14, "end": 5239.98, "text": "Wie machen wir das? Take Snapshot? Nein, nicht Screenshot. Moment. Wo war das noch mal?"}, {"id": 700, "start": 5239.98, "end": 5245.3, "text": "Nee, Snapshots sind anscheinend nicht möglich für temporäre VMs."}, {"id": 701, "start": 5245.3, "end": 5261.46, "text": "Ist auch okay so. Wir müssen es ja nicht übertreiben. Snapshots ist wahrscheinlich"}, {"id": 702, "start": 5261.46, "end": 5270.46, "text": "echt ein bisschen zu viel des Guten. Ich schreibe es immer auf, falls... Ach ja,"}, {"id": 703, "start": 5270.5, "end": 5278.86, "text": "und was man sich... Ich will noch eine Timeout-Option. Warten auf Netzwerk. Wie lange?"}, {"id": 704, "start": 5278.86, "end": 5283.26, "text": "Standardmäßig 45 Sekunden, aber manche Images booten ein bisschen länger. Und vielleicht,"}, {"id": 705, "start": 5283.26, "end": 5288.7, "text": "da bin ich mir nicht sicher, ob es eine gute Idee ist, Config File Support, dass man so ein paar"}, {"id": 706, "start": 5288.7, "end": 5294.5, "text": "Sachen standardmäßig definieren kann, wie welches Verzeichnis soll benutzt werden oder so was."}, {"id": 707, "start": 5294.5, "end": 5300.74, "text": "Doch, habe ich, habe ich. Aber jetzt gibt es den Preis-Champ nicht mehr, das heißt,"}, {"id": 708, "start": 5300.74, "end": 5312.86, "text": "ich brauche es nicht mehr. Ja. Was ist eine temporäre VM im LibVirt-Umfeld? Das ist eine"}, {"id": 709, "start": 5312.86, "end": 5318.98, "text": "VM, die du nicht defines, sondern nur createst. Zumindest nennt das LibVirt so. Also wenn du sagst,"}, {"id": 710, "start": 5318.98, "end": 5327.34, "text": "Create VM, dann ist die nur da bis zum Ausschalten oder bis zum Reboot. Aber wenn du sagst,"}, {"id": 711, "start": 5327.34, "end": 5333.9, "text": "Define VM, dann speichert er sich die Config und alles dazu und du kannst sie quasi runterfahren,"}, {"id": 712, "start": 5333.9, "end": 5339.06, "text": "Rebooten, wieder hochfahren. Lizenz festlegen, das könnte man tatsächlich, das wäre vielleicht"}, {"id": 713, "start": 5339.06, "end": 5346.7, "text": "keine schlechte Idee. Was ist denn eine temporäre, was ist aus dem Preis-Champ geworden? Der wurde"}, {"id": 714, "start": 5346.7, "end": 5352.7, "text": "etwas zu nervig zu maintainen mit den Crawlern für die Shops. Deswegen habe ich das rausgeschmissen."}, {"id": 715, "start": 5352.7, "end": 5360.34, "text": "Der ist weg. Also es könnte durchaus sein, dass man hier Custom Commands ausführen kann in diesem"}, {"id": 716, "start": 5360.34, "end": 5370.66, "text": "Cloud-Init. Ich probiere das mal aus. Wir machen jetzt mal Echo 123 nach rootkekel.bin. Oh, das"}, {"id": 717, "start": 5370.66, "end": 5377.06, "text": "ist eigentlich egal. Wir gucken mal, ob das funktioniert, ob man das so im Cloud-Init ausführen"}, {"id": 718, "start": 5377.06, "end": 5391.62, "text": "kann. Muss man mal gucken. Dotnet, run, run. Ja, einfach so gucken, ob es geht. Jetzt bin ich mal"}, {"id": 719, "start": 5391.62, "end": 5395.86, "text": "gespannt, ob das funktioniert. Weil wenn das funktioniert, ist das tatsächlich eine gute"}, {"id": 720, "start": 5395.86, "end": 5402.06, "text": "Idee gewesen, Chet. Da kann man nämlich Custom Commands angeben. Das ist gar nicht so blöd,"}, {"id": 721, "start": 5402.06, "end": 5407.94, "text": "weil es könnte ja durchaus Custom Cloud-Init-Commands, ja meine ich ja, meine ich ja so was,"}, {"id": 722, "start": 5407.94, "end": 5414.42, "text": "dass man hier Custom Commands. Custom Cloud-Init funktioniert nicht richtig, weil die Sachen müssen,"}, {"id": 723, "start": 5414.42, "end": 5424.9, "text": "also Ausnäh muss gesetzt werden, dass das mit der DACP-IP richtig funktioniert. Keys müssen"}, {"id": 724, "start": 5424.9, "end": 5432.14, "text": "eigentlich auch gesetzt werden, dass das Login richtig funktioniert. Also komplett Custom Cloud-Init"}, {"id": 725, "start": 5432.14, "end": 5439.1, "text": "ist schwierig. Man könnte halt Sachen anhängen lassen. Ja, das wird wahrscheinlich funktionieren."}, {"id": 726, "start": 5439.1, "end": 5451.54, "text": "Okay, ist es gestartet? Wir gucken mal. Cut, root, ach so, ja. Rout, kekel, es funktioniert. Nice."}, {"id": 727, "start": 5451.54, "end": 5460.34, "text": "Okay, Custom Commands ist schon mal easy. Das können wir schon mal einbauen. Ja, weg damit."}, {"id": 728, "start": 5460.34, "end": 5464.7, "text": "Also Custom Commands sollte tatsächlich schon mal relativ gut funktionieren an der Stelle."}, {"id": 729, "start": 5464.7, "end": 5473.26, "text": "Da müssen wir uns nur noch die Optionen überlegen. So, wir fangen mal mit was Einfachem an. Ich"}, {"id": 730, "start": 5473.26, "end": 5484.9, "text": "ändere mal gleich am Anfang. Das ist nämlich nur an einer Stelle Megabyte zu Megabyte und das"}, {"id": 731, "start": 5484.9, "end": 5492.82, "text": "sieht gleich besser aus. Guckt mal. 256 MB und 4000 MB. Da können die Leute wenigstens was"}, {"id": 732, "start": 5492.82, "end": 5498.58, "text": "ordentlich mit anfangen. Da weiß man wenigstens schon was Sache ist. So, okay, was machen wir jetzt"}, {"id": 733, "start": 5498.58, "end": 5510.06, "text": "als nächstes? Ja, das machen wir jetzt. Weil aktuell kann man sich ja anzeigen lassen,"}, {"id": 734, "start": 5510.06, "end": 5516.82, "text": "was aktuell schon für VMs laufen. Und da sieht man, es läuft eine, die noch keine IP hat und es"}, {"id": 735, "start": 5516.82, "end": 5522.46, "text": "wäre ja schon praktisch, wenn es dahinter noch was gäbe, wo dann Status oder sowas steht und dann"}, {"id": 736, "start": 5522.46, "end": 5529.1, "text": "Running oder eben Booted oder sowas in der Richtung. Das probieren wir jetzt mal aus."}, {"id": 737, "start": 5529.1, "end": 5538.54, "text": "Dann gehen wir mal ins List Command, fügen noch mal neue Tabelle hinzu, neue Spalte,"}, {"id": 738, "start": 5538.54, "end": 5549.34, "text": "State oder Status. Da gibt es ja irgendwie so eine Eselsbrücke für, um sich das merken zu können."}, {"id": 739, "start": 5550.22, "end": 5557.66, "text": "Sprich, bei Hotelzimmern ist, ich kriege es immer aus dem Kopf nicht hin, bei Hotelzimmern ist"}, {"id": 740, "start": 5557.66, "end": 5567.1, "text": "das Date quasi ob es eine Einzelzimmer, ein Doppelzimmer oder sonst was ist und der Status ist,"}, {"id": 741, "start": 5567.1, "end": 5575.9, "text": "ob es belegt ist oder nicht. Also gut, keine Ahnung, ob es in dem Fall State oder Status ist,"}, {"id": 742, "start": 5575.9, "end": 5584.82, "text": "Running, Booted. Tim790, danke schön für den Sub. Okay, dann geben wir doch jetzt hier einfach mal"}, {"id": 743, "start": 5584.82, "end": 5592.1, "text": "aus und gucken, ob das funktioniert, dass wir da jetzt was in die Tabelle mit reiten. Nein,"}, {"id": 744, "start": 5592.1, "end": 5602.86, "text": "nicht Run, nicht Run, Lists. Gehst du eigentlich auch auf Messen? Auf die Games kommen ab und zu,"}, {"id": 745, "start": 5603.02, "end": 5612.5, "text": "war ich aber auch schon Jahre nicht mehr. Auf IT-Konferenzen gehe ich nicht. Wüsste ich jetzt auch nicht,"}, {"id": 746, "start": 5612.5, "end": 5619.1, "text": "warum? Weil die ganzen Talks kann man sich im Internet angucken oder kann ich mir die in Ruhe"}, {"id": 747, "start": 5619.1, "end": 5622.78, "text": "zu Gemüte führen und mir auch nur die Talks raussuchen, auf die ich Bock habe?"}, {"id": 748, "start": 5622.78, "end": 5636.7, "text": "Okay, das funktioniert. Also in der Tabelle, in der Tabelle kann man noch einen zusätzlichen"}, {"id": 749, "start": 5636.7, "end": 5642.94, "text": "State reinschreiben. Jetzt ist natürlich die Frage, wie bekommen wir den Status? In dem Fall ist"}, {"id": 750, "start": 5642.94, "end": 5650.02, "text": "glaube ich tatsächlich eher der Status, oder? Mir egal. Wie bekommen wir das raus? Da müssen wir"}, {"id": 751, "start": 5650.02, "end": 5662.94, "text": "mal in die LibWird-Docs gucken. Und suchen wir mal nach Status. Wir Domain Dirty State."}, {"id": 752, "start": 5662.94, "end": 5674.58, "text": "Was? Ne, dann suchen wir nach State. State. Aha. Domain Control State, No State. Wir Domain State."}, {"id": 753, "start": 5674.7, "end": 5680.26, "text": "Das klingt doch schon mal ganz gut. Wir Domain State. No State. Running,"}, {"id": 754, "start": 5680.26, "end": 5685.74, "text": "blocked, paused, shut down, shut down. Genau das will ich haben. Wir Domain State. Okay,"}, {"id": 755, "start": 5685.74, "end": 5699.78, "text": "wie kriegt man den? Was zum? Okay, was auch immer. Was? Wir connect, get all Domain Stats."}, {"id": 756, "start": 5699.78, "end": 5707.06, "text": "Alter, was ist das für eine Signatur, man? Was wollen die von mir?"}, {"id": 757, "start": 5718.9, "end": 5727.42, "text": "Wir Domain Stats Record Pointer. Pointer, Pointer. Triple Pointer. Pointer? Und ein Pointer auf den"}, {"id": 758, "start": 5727.5, "end": 5732.66, "text": "Pointer und ein Pointer auf den Pointer des Pointers. Alles klar. Exit. Pfeifer. Pointer"}, {"id": 759, "start": 5732.66, "end": 5743.34, "text": "Stells. Was wollen die von mir? Wir connect Pointer. Alter, mich interessiert die CPU-Zeit"}, {"id": 760, "start": 5743.34, "end": 5750.02, "text": "und RAM und so gar nicht. Ich will einfach nur, ob die VM running ist oder nicht. So."}, {"id": 761, "start": 5757.42, "end": 5773.7, "text": "Wir Domain Info. Das klingt auch nicht schlecht. Ja, das ist doch nicht schlecht. Woüber geht"}, {"id": 762, "start": 5773.7, "end": 5784.02, "text": "man? Wir Domain Info. Wir Domain Get Info. Ja, das klingt doch gut. Das brauchen wir. Wir Domain"}, {"id": 763, "start": 5784.02, "end": 5790.02, "text": "Get Info. So. Jetzt könnt ihr euch an der Stelle gleich mal angucken, wer vielleicht C-Sharp benutzt,"}, {"id": 764, "start": 5790.02, "end": 5798.1, "text": "aber noch kein Interop mit C-Libraries gemacht hat in C-Sharp. Da könnt ihr euch das angucken,"}, {"id": 765, "start": 5798.1, "end": 5804.9, "text": "wie das funktioniert. Da gibt es mittlerweile auch viele Varianten. Mittlerweile ist DLL Import"}, {"id": 766, "start": 5804.9, "end": 5808.58, "text": "eigentlich gar nicht mehr angesagt, sondern es ist, glaube ich, Library Import mittlerweile,"}, {"id": 767, "start": 5808.58, "end": 5819.26, "text": "was man verwenden soll, weil DLL Import macht Magic zur Runtime und Library Import macht Code"}, {"id": 768, "start": 5819.26, "end": 5825.82, "text": "Generation zur Kompilzeit. Also theoretisch ist Library Import schneller als DLL Import,"}, {"id": 769, "start": 5825.82, "end": 5833.82, "text": "aber ich habe Library Import noch nie verwendet. Deswegen. So. Also jetzt müssen wir erst einmal"}, {"id": 770, "start": 5833.82, "end": 5841.14, "text": "unserem Manage.net Code definieren, wie die Funktion aussieht, die wir in der C-Library"}, {"id": 771, "start": 5841.14, "end": 5847.78, "text": "aufrufen wollen. Es ist ja klar, C-Sharp selbst kann direkt keine C-Funktion aufrufen. Man kann"}, {"id": 772, "start": 5847.78, "end": 5855.1, "text": "allerdings das definieren und anlegen in C-Sharp und sagen, okay, diese Funktion ist jetzt nicht"}, {"id": 773, "start": 5855.1, "end": 5860.94, "text": "hier definiert, sondern in einer anderen Library. Das funktioniert. Direkt im Source Code sagen,"}, {"id": 774, "start": 5860.94, "end": 5866.02, "text": "ich will auf eine C-Funktion zugreifen, geht nicht, aber ich kann diese C-Funktion definieren und"}, {"id": 775, "start": 5866.02, "end": 5871.14, "text": "sagen, die gibt es und dann eben sagen, wo es die gibt und dann kann ich die aufrufen. Das"}, {"id": 776, "start": 5871.14, "end": 5876.86, "text": "funktioniert dann so. WirDomainGetInfo, also Domain, und dann brauchen wir einen Info-Pointer."}, {"id": 777, "start": 5876.86, "end": 5889.5, "text": "MonkaS. Was? Einen WirDomainInfo-Pointer brauchen wir dann. WirDomainInfo. WirDomainInfo. Okay,"}, {"id": 778, "start": 5889.5, "end": 5900.38, "text": "das ist wieder ein Struct. Alles klar. Dann machen wir das mal. Das ist ein Struct. Ein Struct,"}, {"id": 779, "start": 5900.38, "end": 5911.5, "text": "das sich nennt WirDomainInfo. Was so ein gross geschrieben bliesst. WirDomainInfo mit einem,"}, {"id": 780, "start": 5911.5, "end": 5923.02, "text": "jetzt müssen wir aufpassen, mit einem Byte als State. Keinem Pointer, einem normalen Byte. Ich"}, {"id": 781, "start": 5923.02, "end": 5929.62, "text": "kann übrigens hier unten abgucken. Man darf sich nicht verarschen lassen, hier im C-Source Code"}, {"id": 782, "start": 5929.62, "end": 5936.38, "text": "steht, dass es ein Character ist. Und in C stimmt das auch. In C ist ein Byte und ein Character im"}, {"id": 783, "start": 5936.38, "end": 5942.82, "text": "Prinzip das Gleiche. Das ist immer ein Byte. In C Sharp ist das nicht so. In C Sharp ist Byte,"}, {"id": 784, "start": 5942.82, "end": 5952.62, "text": "ein Byte und Character sind zwei Byte. Warum? Weil Microsoft sich gedacht hat, ein Character in C"}, {"id": 785, "start": 5952.62, "end": 5959.74, "text": "Sharp, also quasi so das Zeichen von einem String, ist zwei Byte groß. Also quasi UTF 16."}, {"id": 786, "start": 5959.74, "end": 5965.9, "text": "Allerdings haben die sich das ausgedacht schon zu Zeiten, da gab es UTF 8 Encoding und sowas"}, {"id": 787, "start": 5965.9, "end": 5975.66, "text": "noch nicht. Rust zum Beispiel benutzt UTF 8 und das bedeutet, dass alle Character aktuell zumindest"}, {"id": 788, "start": 5975.66, "end": 5983.58, "text": "zwischen einem Byte und vier Bytes sind. Also wir brauchen ein paar Public State. Dann haben wir als"}, {"id": 789, "start": 5983.58, "end": 5989.06, "text": "nächstes, das kann man doch so keiner lesen, wie das hier reinkopiert ist. Also als nächstes haben"}, {"id": 790, "start": 5989.06, "end": 5998.66, "text": "wir ein Unsigned Long. Ich glaube, das ist Uint. Das reicht an der Stelle. Das ist MaxMem."}, {"id": 791, "start": 5998.66, "end": 6013.18, "text": "Ist das nicht sogar das Gleiche mittlerweile? Ein Int und ein Long in C Sharp? Ach nee, ein Int"}, {"id": 792, "start": 6013.18, "end": 6027.7, "text": "ist ein Int 32. Logisch, das andere ist ein Int 64. Ja klar. Long, MaxMem, Used haben wir als nächstes."}, {"id": 793, "start": 6027.7, "end": 6038.74, "text": "Also das nächste ist Memory. CPU Time interessiert mich jetzt mal gar nicht. Das ist ein Unsigned Short."}, {"id": 794, "start": 6038.74, "end": 6046.18, "text": "Sachen, die die Welt nicht braucht. Und dann gibt es CPU Time. Das ist ein Unsigned Long Long."}, {"id": 795, "start": 6046.18, "end": 6059.38, "text": "Was zum Geier ist ein Unsigned... Ist das ein Unsigned Double? Nee, Double ist... Was ist denn Long Long?"}, {"id": 796, "start": 6059.38, "end": 6076.3, "text": "128 oder wie? Also Int 128 oder was? Oder wie? Dann muss ich dann Uint machen. Ist das..."}, {"id": 797, "start": 6076.3, "end": 6086.7, "text": "Wir benutzen einfach einen Pointer-Typ dafür, dann ist das auch immer... Obwohl, das ist eigentlich auch blöd."}, {"id": 798, "start": 6086.74, "end": 6100.82, "text": "Das ist ja kein Pointer. Okay, was genau, bitteschön, ist ein Unsigned Long Long? 64, ja wie jetzt? Ah,"}, {"id": 799, "start": 6100.82, "end": 6118.14, "text": "Uint 64. Also ein U Long quasi. Alles klar. Uint, wunderbar, wunderbar, gut. Excellent,"}, {"id": 800, "start": 6119.14, "end": 6127.7, "text": "wir Domain Interf... Moment, soll nicht wir Domain Interface heißen. Das soll wir Domain Info heißen."}, {"id": 801, "start": 6127.7, "end": 6144.62, "text": "Long Long. Gut, das passt so. Unsaved muss hier tatsächlich nichts sein. Und... Moment, wo sind wir?"}, {"id": 802, "start": 6144.62, "end": 6159.42, "text": "Da sind wir. Wir Domain Info Pointer auf... Auf nennen, wir Domain Info Objekt und nennt"}, {"id": 803, "start": 6159.42, "end": 6167.42, "text": "sich Info. Okay, mal schauen. Pointer-Tour wird Domain Info... Allocated by the user. Okay,"}, {"id": 804, "start": 6167.42, "end": 6173.9, "text": "das machen wir. Preis-Champ ist offline, ja, ist er. War gespannt, ob das jetzt funktioniert,"}, {"id": 805, "start": 6173.9, "end": 6179.58, "text": "was ich da zusammen gewurstet habe. Okay, also wir fragen jetzt für jede VM ab. Interop,"}, {"id": 806, "start": 6179.58, "end": 6191.54, "text": "Info, Get Domain Info, die Connection-Native-Pointer und jetzt... Und jetzt brauchen wir was?"}, {"id": 807, "start": 6191.54, "end": 6197.78, "text": "Ein Wir Domain Info... Ein Pointer auf ein Wir Domain Info, Allocated by the user. Okay,"}, {"id": 808, "start": 6197.78, "end": 6210.1, "text": "also Wir Domain Info. Gleich... Ja, sowas hier quasi. Und dann die Adresse davon. Das müsste ja"}, {"id": 809, "start": 6210.1, "end": 6217.58, "text": "eigentlich funktionieren. So, und jetzt die Adresse von dem Info-Struct. Funktioniert natürlich nicht."}, {"id": 810, "start": 6217.58, "end": 6225.22, "text": "Das wäre auch viel zu einfach, wenn das so gehen würde. So, Pointers can only be used in... Achso,"}, {"id": 811, "start": 6225.3, "end": 6240.14, "text": "ja, okay. Lul. Unsave. Das ganze Ding ist unsaved, dass es funktioniert. Okay, wunderbar. Ich gebe"}, {"id": 812, "start": 6240.14, "end": 6245.54, "text": "jetzt mal hier nur testweise irgendwas aus. Was ist denn der Return-Code davon? Returns 0 in"}, {"id": 813, "start": 6245.54, "end": 6253.18, "text": "case of success, minus 1 in case of failure. Okay, dann geben wir mal das Info aus hier. Gucken wir"}, {"id": 814, "start": 6253.18, "end": 6261.98, "text": "mal. Geben wir jetzt einfach mal State aus und Memory und gucken mal, ob das klappt. Neues Terminal"}, {"id": 815, "start": 6261.98, "end": 6287.42, "text": "auf CD repos.net run list. Prager. Invalid Domain Pointer. In Wir Domain destroy. Destroy."}, {"id": 816, "start": 6287.42, "end": 6313.3, "text": "Oh. Ups. Ups. Einfach mal alles gelöscht. Easy. Ja, gut, das ist natürlich eine blöde Idee gewesen."}, {"id": 817, "start": 6313.3, "end": 6331.34, "text": "Ja. Hey, aber es ist nicht gecrashed, ja? Okay, jetzt aber. Invalid Domain Pointer."}, {"id": 818, "start": 6331.34, "end": 6342.18, "text": "Ah, Moment. Man soll ja auch... Haha. Ich bin ja auch falsch. Ich übergebe ja auch das Falsche."}, {"id": 819, "start": 6342.18, "end": 6349.74, "text": "Moment, wir haben Followers Only Mode an? Was war denn? Warum haben wir Followers Only Mode an? Wer hat"}, {"id": 820, "start": 6349.74, "end": 6360.1, "text": "dann so was gemacht? Was ist denn hier los? 1KS. War oft 10 Minuten. Ja, wundere mich. Ich"}, {"id": 821, "start": 6360.14, "end": 6370.9, "text": "habe mich schon gewundert, warum keiner was schreibt. Spambot, vielleicht, ja. So. Oh fuck,"}, {"id": 822, "start": 6370.9, "end": 6387.66, "text": "wir machen. Wir machen gerade MMO Kreiselgrind. Die machen MMO Kreiselgrind ohne mich. Da muss"}, {"id": 823, "start": 6387.66, "end": 6397.34, "text": "ich jetzt eigentlich hin. Okay, Moment. Zumindest, dass das funktioniert. Invalid Domain..."}, {"id": 824, "start": 6397.34, "end": 6411.3, "text": "Zumindest, okay. Das können wir jetzt machen. Wir Domain... Okay, wir brauchen die Domain ID."}, {"id": 825, "start": 6411.3, "end": 6425.74, "text": "Die brauchen wir von der... Ja, die VMID brauchen wir. Genau, VMID. Und dann funktioniert das auch."}, {"id": 826, "start": 6425.74, "end": 6436.14, "text": "Was ist der MMO Kreiselgrind? Der MMO Kreiselgrind. Ich muss PVP machen. Die anderen 5 Leute sind"}, {"id": 827, "start": 6436.14, "end": 6457.54, "text": "auch alle am Start. So, das scheint zu funktionieren. PVP nicht. Nicht World of Warcraft PVP. Wir"}, {"id": 828, "start": 6457.54, "end": 6471.1, "text": "spielen hier eben... Wir spielen Dark, FreeShard. Spielen wir, ja. Das ist noch deutlich älter als"}, {"id": 829, "start": 6471.1, "end": 6476.66, "text": "World of Warcraft. Okay, das funktioniert schon mal. Also, haben wir heute schon was gelernt."}, {"id": 830, "start": 6476.66, "end": 6484.7, "text": "Leider muss ich jetzt MMO Kreiselgrind machen, Leute. Wir sehen uns im nächsten Stream. Da machen wir"}, {"id": 831, "start": 6484.7, "end": 6488.14, "text": "dann wirklich was. Ich habe ja heute im Prinzip eineinhalb Stunden geschwätzt und jetzt haben"}, {"id": 832, "start": 6488.14, "end": 6493.34, "text": "wir nichts gemacht. Also, Kreiselgrind startet. Ich muss weg. Bis dann. Macht's gut. See you."}]}