{"text": "Wie sind die Emoats? Bissle groß. Monkeys. Mal gucken, wie schnell ich das Ganze drücken kann. Okay, schneller geht nicht. Aber zumindest eins ist cool zu sehen. Egal wie schnell ich klicke, immer ein Tool kommt mit. Ja, das ist ein bisschen... Mal gucken, bis Twitch das Ganze mitkriegt, dass ich on bin. Es dauert ja immer ein bisschen. Ah, es limpt. Sag mal, kennt ihr mal ein gutes Mikro SD-Karten-Aufbewahrungs-Case? Ich hab da vorhin mal gesucht. Ich find' nur absoluten China-Crap. Wenn man dann mal in China sucht, dann findet man zwar was, aber das sieht mega billig aus. Sowas hier in der Richtung. Das sieht mega billig aus. Sag mal, bin ich überhaupt on? Ich glaub' Twitch hat das noch nicht gecheckt. Egal, ich warte einfach mal kurz. Twitch braucht ja manchmal seine 5 Minuten. Kann schon mal ein bisschen mein Zeug hier dampfen. Ich hab hier irgendwie Mist reingelegt. PoE-Stream. Ja, aber einzig und allein nur, weil ich echt im Konflikt bin. Ich wollte heute eigentlich ein bisschen Laberstream machen, ein bisschen Zeug nachgucken. Was man sich vielleicht holen könnte, was man streamen könnte in Zukunft. Vielleicht sowas in der Richtung wie ein Streaming-Plan machen wollte ich. Aber nix. Ihr kennt mich ja. Wenn ich es übertreibe und sag' Leute, ich stream jetzt zu diesem und diesem Termin dreimal die Woche, dann funktioniert das nicht. Dann bin ich einmal da und danach nicht mehr. Ich wollte mir irgendwie mal sowas überlegen, dass man nicht einen festen Plan macht, sondern einfach mal überlegt, was könnte man für Themen machen, dass man dann quasi weiß, was demnächst aufhandzukommt. Primo2k abonniert Stufe 1, 2 Monate. Dankeschön. Leute, ich muss mal den Chat refreshen. Ich seh' euch kurz nicht, aber der Chat ist ja brav bei mir immer. Cute Chat. So, jetzt seh' ich euch wieder. Jetzt vorbei mit lustig. Hat jemand von euch ein gutes USB-Aufbewahrungs-Case? Irgendwas Gescheites? Irgendwas, was taugt, was nicht so'n billig China-Ding ist und wo auch ein bisschen mehr reinpassen? Weil das ist totaler Müll. Wie ist eigentlich die Musik? Passt? Bissi laut, hä? Bissi laut, die Musik. Sonst gibt's gleich wieder hier. Sonst sagt Twitch im Watt, nein, hier ist kein Sound drinne. Nimmst du Überraschungseier für deine USB-Sticks? Hab ich USB-Stick gesagt? Äh, ich mein' Mikro-SD-Karte. Ihr wisst ja, ich sag' manchmal Dinger und mein' andere. Weil ich bin ja schon 35, da kann das mal vorkommen, ja. Nimm am besten das Waterproof-Gun-Case. Du meinst das, was man mit der Gabel aufmachen kann? Exzellent. Phoenix, sieben Monate. Huge. Ups, äh, falsch. Auch falsch. Ja, ich kann meine Emotes nicht mehr klicken, aber danke für die sieben Monate. Das wollte ich haben. Richtig Boomer-Hirn. Habt ihr eigentlich schon gesehen, dass wir Boomer-Emotes haben mittlerweile? Wir haben Boomer-Emotes. Äh, Leute, wie laut ist denn so die Lautstärke? Ein bisschen laut, hä? Ich glaub', das müssen wir einen Ticken runter machen. Ich glaub', das müssen wir... Oh Gott. Windows-Mixer, please. Windows-Mixer. Es ist mittlerweile so übertrieben kompliziert, irgendwelche Settings zu machen. Man kann ja, man kann ja Linux 1 vorwerfen, ja. Das ist von der Oberfläche teilweise 20 Jahre zurück, wenn ich mir das an manchen Stellen angucke. Aber es hat oftmals einen gewissen Weg, der, wenn man es verstanden hat, logisch ist. Der ist nicht immer gleich logisch. Wartet mal, wartet mal, ist das ein bisschen laut? Oder kommt mir das nur so laut vor? Wartet mal. Ist das nicht zu laut? Nee, ich glaub', das passt, oder? Stopp, passt. Oh, der Scamtrain. Der Scamtrain. 94% Scamtrain am Start. Alter, was ist da los? Oh, da will irgendeiner was kaufen von mir. Was, Moment, was will der Dude kaufen? Buy your Heartbreaker Roll Skin listed for 3 Chaos Ops. Ach du Scheiße. Moment, der will was kaufen. Wartet mal. Was will der Dude kaufen? Das da, oder? Nee. Moment. Stashtab, Price, blablabla. Left 6, 1, 2, 3, 4, 5, 6, 100. Ach, das da. Das will der kaufen? Das, was der kaufen will? Ah, ich glaub' schon. Okay, easy. Den walten wir den Dude mal. Was machen wir gleich mit der Klasse Trade Action? Hat er gerade eh, weiß ich nicht, wie lang das her ist, wo er geschrieben hat. Egal, ich hab' ihn jetzt mal invited. Mal gucken, ob der noch auftaucht. Äh, ja. Danke für die ganzen Subs. Ich glaub', ich hab' was übersehen, denn... Oh, da ist er am Start. Der Neo aus Stufe 1. Dankeschön. Äh, äh, äh, äh, äh, Trade. Ich glaub', THX. Gibt es, weiß jemand, ob es eine Option gibt zum automatischen Antworten? Das hab' ich noch nicht so ganz gecheckt. Hat jemand eine Ahnung? Jetzt ist auch ich Trade und nicht jetzt voll am Trade, naja. Bisschen, ich muss Gear Upgrade. Hey, mein Gear ist jetzt gar nicht mehr übel. Mein Gear ist jetzt, ich hab' gesagt, ich Trade nicht, bis ich ein bisschen Durchblick im Game hab', aber es geht jetzt mittlerweile eigentlich. So. Wenn ihr wollt, ich glaub', ich bin mir nicht sicher, wie viele Leute das Game kennen. Ähm, ich würd' mal ganz kurz was zu dem Game erzählen für die Leute, die das nicht kennen. Wenn ihr wollt, ja. Weil es ist, also nur mal, nur mal so ganz grob, weil es ist ultra komplex, das Game. Ich werd', ich werd' euch jetzt mal schocken. Äh, was hältst du eigentlich von Blazer? Server oder Client-Side? Äh, aktuell ist, glaub' ich, das Einzige, was supported ist, Server-Side. Client-Side ist, glaub' ich, noch nicht supported. Äh, Blazer fehlt einiges noch. Blazer fehlt einiges noch. Blazer fehlt einiges noch. Das ist was, was wir uns, wir haben's uns ja schon mal on stream angeguckt, was man, äh, was man uns in fünf Jahren nochmal angucken können, wenn man, ähm, beispielsweise bei diesem ganzen Web-Assembly-Zeug nicht noch, nicht noch JavaScript zusätzlich braucht. Das ist, das ist, ich, ich war ein bisschen enttäuscht von, es geht einfach vieles noch nicht. Sieht für mich aus wie Diablo ist es im Prinzip ja auch. Ein bisschen, aber eher wie Diablo 2. Also, nur mal, nur mal ganz kurz, Leute, zum, zum Game, ja, das, äh, was wir jetzt, wir werden ein bisschen, ein bisschen Kreisel-Client machen, weil ich war voll im Konflikt zwischen, ähm, zwischen Streamsorn und, und Kreisel-Client in Path of Exile machen. Deswegen hab' ich gedacht, egal, ich weiß, dass nicht allzu viele zugucken, ähm, oder wahrscheinlich nicht so wahnsinnig viele interessiert, aber besser als gar nicht streamen und gar nicht Kreisel-Client, habe ich gedacht, dann mach ich wenigstens mit weniger Zuschauern Kreisel-Client und labern ein bisschen über aktuelle Technik oder Geschichten. Ähm, eine Sache, die allen Leuten auffällt, die neuen Path of Exile sind, was für ein Item kreiselst du oder farmst du irgendwelche Maps? Äh, ich werde wahrscheinlich irgendwelche Maps farmen, ja, irgendwelche, mal gucken, mal gucken, was wir machen. Ich erzähl' aber erstmal kurz was zum Game. Ich hab' hier erst wieder angefangen. Das ist meine erste League seit, äh, fünf Jahren. Ähm, ich muss immer mal gucken, nicht, dass irgendjemand was, was, was kaufen will. Ähm, rofl1436, dankeschön für den Sub. Und das erste, mit was die Leute bei Path of Exile in Kontakt kommen, wenn sie neu in das Game... Wenn sie neu in das Game... Oh, der Hype-Train, Poggers, alter, huge, dankeschön für die, für den, für den, das, das, das Scam-Train war erfolgreich. Das erste, mit dem viele Leute von Path of Exile in Kontakt kommen, was ganz viele Leute abschreckt, ich zeig' euch mal den Skill-Tree. Äh, FlickGP, dankeschön, ich zeig' euch mal den Skill-Tree. Und ich sag euch, Leute, nicht erschrecken, nicht, nicht erschrecken. Oh, Skamars Level 2, 50% sogar schon. So, der Skill-Tree, ihr kennt andere, also, ihr kennt Skill-Trees noch vielleicht aus Diablo 2, oder Diablo 3 hat ja keinen Skill-Tree mehr. Das war nur so der Skill-Tree in Diablo 2. Oder jetzt der Skill-Tree in, in, in Wolsen, oder wie man das ausspricht, der ist Path of Exile inspiriert. Der ist, das ist alles relativ klein im Vergleich zu dem Path of Exile Skill-Tree. Ich geh' mal kurz ins Game und mach' den Skill-Tree auf. Ähm, ja. Leute, ne? Das ist der Skill-Tree und ich weiß, dass viele Leute, wenn sie das das erste Mal sehen, denken sich scheißlich an den Stalker wieder. Ich denk' mich, fuck, was ist das für ein Crap, Alter? Also, das ist schon im Vergleich mit anderen Action-RPGs ein sehr heftiger Skill-Tree. Der Witz ist allerdings, das ist gar nicht, also, wenn man ein bisschen sich das Ganze anguckt hat, wenn man vielleicht auch einen Guide hat, ich hab' da auch mit einem Guide angefangen, äh, wieder, weil das gibt so viel neue Zeug, es ist gar nicht so wild. Vor allem, nachdem es ein wunderbares Tool dafür gibt, das Ganze offline zu machen, nehme ich das da. Es gibt ein super Tool, um offline seinen Skill-Tree zu, zu gestalten, wo man auch sieht, was, was dann am Ende rauskommt. Das ist Free-To-Play, ja, aber ich hab' schon ein bisschen Kohle ausgegeben, weil, weil Stash und so, ne? Hab', ich hab', ich hab' ein paar Stash-Taps gekauft. Äh ja, muss, muss sein. Genau, und, ähm, ich hab' das Noob-Bild schlechthin, das ist absolut OP, ich spiel', äh, Skeleton Summoner. Das, ich hab' angefangen mit Archwitch, weil's dann super Einsteiger-Guide gibt, aber jetzt spiel' ich, äh, das ist, das ist wirklich absolut Noob-Style, das kann jeder. Das, das, das kann echt jeder. Also, das ist das beste, das absolut Noob-Style-Einsteiger-Bild schlechthin. Da kann man mit minimalem Gear, ich hatte ja Glück, dass ich schon ein bisschen was gefarmt habe, mit meiner anderen Witch, ähm, da kann man Endgame-Content clearen. Also, ihr seht's hier, ich hab' hier teilweise mit, ich hab' hier Tier, Tier 16 Maps drinne, Tier 14, 15, 16 Maps, und das geht, ist alles kein Problem, ja. So, aber, warum das Skilltree nicht so wild ist, muss ich, muss ich jetzt mal vielleicht kurz erzählen. Es sieht erst mal, es sieht erst mal übertrieben, überladen und, und extrem aus. Aber, je nachdem, welche Klasse man am Anfang auswählt, startet man entweder hier, hier, hier, hier oder hier, oder in der Mitte, je nachdem. Das heißt, wenn man einfach nur mal gucken will und dann mal Richtung, wenn man einfach nur mal einen Caster anspielen will, dann ist das gar nicht so wild. Dann startet man hier und skillt halt das so erst mal, wie man lustig ist. Den ersten Charakter verkackt man eh, es sei dann, man hat einen ordentlichen Build. Und, äh, wie gesagt, ich, ich hab' mir den Build als absolut noob-freundlich, noob-freundlich ein OP-Bild rausgesucht. Aber ganz, ganz zum Einstieg, finde ich, ist der Guide echt gut. Weil, ähm, das ist zwar kein OP-Bild, aber der erklärt vieles um das Game drum herum. Und der erklärt auch, worauf man achten muss beim Leveln und welcher Reihenfolge man am besten levelt und wie man in welcher Reihenfolge man am besten skillt. Ähm, das ist, ist echt praktisch. Und wenn man dann erst beim Endgame angekommen ist, dann kann man, dann kann man immer noch was anderes spielen. Wenn man die Story eins, zwei, drei Mal durchgespielt hat, dann geht das auch ziemlich schnell. Das, das geht wirklich ziemlich zackig. Ja, ähm, es gibt, es gibt ein paar richtig, richtig coole Tools, wie gesagt, für diesen Skillt, wie zum Verwalten. Das kann ich jedem nur empfehlen. Da kann man nämlich auch schön vergleichen, so nach dem Motto, in welcher Reihenfolge man leveln sollte. Sprich, das was man in-Game macht, in der Reihenfolge, wie das der Guide vorschlägt. Das ist, das wirklich sehr praktisch. Naja. Ähm, wenn ihr irgendwelche Technik-Sachen, Fragen habt, wissen wollt, schießt los. Ich mach jetzt mal eine Map und renn, renn eine Runde mal im Kreis und, und, und crying in mir ein. Ähm, und eine, eine Sache, die mich echt überrascht hat, persönlich, ist, der deutsche, der global chat, der, der ist tatsächlich mal zur Abwechslung deutlich freundlicher als der global chat. Ich weiß gar nicht, was los ist. Oh, der, der, der, ist das Gamtrain durch, Leute. Ja, der ist fertig. Dankeschön für die ganzen Subs. Genutze ich den Bits extra für die, äh, du hast unten rechts im Chat, hast du so einen Knopf für Bits. Wir machen jetzt, wir machen jetzt erst mal irgendwie eine Runde, wegen Enchanten. Ich bin da übrigens offen, Leute, wenn, wenn ihr euch mit dem Game gut auskennt, also sprich, wenn ihr schon ein bisschen länger spielt, ähm, ich, ich hätte da noch eins, zwei Fragen, was gewisse Items angeht, also wenn sich jemand auskennt. Dankeschön für die umgerechnet drei Euro, es war nur der Name frei zwei. Big Brain Name. Ice Freak, sechs Monate, huge. Wahnsinn. Also falls ihr einer der übelsten Path of Exile Pro ist, ähm, sagt mal Bescheid, es gibt nämlich ein paar Items, wo ich kein, wo ich keinen Plan habe, was sie machen. Zum Beispiel, zum Beispiel das hier, guckt mal, ähm, hier, zum Beispiel dieses ganze Zeug. What the fuck, was ist das? Ich hab keinen Schimmer, was das ist. Ich, ich blicke ja bei den anderen Sachen im Game mittlerweile halb fix durch, aber ich hab keinen Schimmer, was das, was das Ganze ist. Also die Karten weiß ich, aber was machen wir mit den Splittern? Ich hab keine Ahnung, was das Ganze ist. Ich hab keine Ahnung, was das Ganze ist. Ich hab keine Ahnung, was das Ganze ist. Die Karten weiß ich, aber was machen wir mit den Splittern? Also es gibt, das Game hat so viele Sachen. Splitter sind für einen Boss. Das heißt, ich kann das in mein Map Device rein machen und dann den Map mit dem speziellen Boss spawnen, oder wie? Das hab ich noch nicht gemacht. So, ich, ich, ich, ich, das Ding jetzt einfach mal. Davon brauchst du 100 und das ist deine Art von Map-Boss. Okay. So, wir rennen jetzt erstmal, wir rennen, wir rennen jetzt erstmal eine Runde hier durch. Oh, oh, muss man Zeug, muss man ganze Zeug beschwören. Also, ähm, das geht relativ schnell, wie gesagt, mit dem Build. Das ist ziemlich OP. Also, ähm, wie soll ich sagen? Das ist halt sehr, sehr, sehr Noob-freundlich. Es ist natürlich für viele, für viele mag es ein bisschen langweilig sein, ja. Man geht hier rein, beschwört ein paar Skelette, macht Armor an und lässt die Skelette alles umweschen. Easy, easy, es fuckt und sammelt, sammelt Zeug dabei aus. Und, und sprintet sich halt hier ein ab über die Map und guckt, dass man möglichst viele Mobs basht. Easy. Was halt sehr schön schnell geht, weil ich gar, ich muss nichts machen, ich muss einfach laufen. Ich muss einfach laufen, meine Skelette macht alles platt. Und das ist eine absolut poggers Map. Wir haben einen Plight Encounter auf der Map und wir haben noch mal so eine, so eine Inception Map. Eine Map in der Map. Ist da Dropsore. Und dass das Game manchmal framed, ist normal. Da kann man nichts machen. Also wahnsinnig gut optimiert ist das Ganze nicht. Ach ja, eine wichtige Sache, die man machen sollte, wenn man neu einsteigt, habe ich am Anfang auch nicht gemacht. Ist, sollte man aber direkt von Anfang an machen, man sollte hier den Lootfilter installieren. Da erkennste nichts. Warum, weil der Stream verschwimmt. Oder, oder weil einfach zu viel passiert, wahrscheinlich weil einfach zu viel passiert. Sollte der Stream verschwimmen, muss ich die Bitrate hochstellen. Passt das, passt das im Stream? Passt das, passt das im Stream? Beides? Artefakte? Echt? Okay. Ich habe genug Upload, kein Problem. Ich habe genug Upload, das ist kein, kein Ding. Machen wir mal hoch, auf 5, gucken wir mal. Ich muss halt nur gucken, dass ich nicht, dass ich nicht zu hoch mache. Warum verschmiert der Stream, sollte er eigentlich nicht verschwimmen, das liegt bestimmt an der Bitrate. Ach ja, auf was habe ich in den Stream gestellt? 1080? Oh, da muss ich ein bisschen mehr machen. Ähm, Leute, wir müssen mal gucken, wie weit das Ganze geht. Ich habe jetzt mal hochgestellt, auf 8 ermitt, das müsste jetzt deutlich besser sein. Das müsste jetzt deutlich besser sein. Das müsste jetzt deutlich besser sein. Probieren wir mal aus. Das müsste deutlich besser sein. Ist, ist eine Ecke schärfer. Ja, macht, macht es halt viel aus. Ja, besser. Ja, die Bitrate macht es halt krass aus. Ich habe die Bitrate halt ziemlich hochgestellt, das ist halt für manche vielleicht jetzt zu viel, weil wir sind immer noch Internet in Deutschland, ne? Und Internet in Deutschland, wissen wir ja, ist so eine Sache für sich. Ähm, genau, eine Sache, die ich allen empfehlen würde, die neu anfängt. Und zwar, wenn man in die Options guckt, hat man hier unten die Möglichkeit... Die Musik ist unterschiedlich laut. Hm. Null. Ähm, man hat mir hier unten die Möglichkeit, wenn ihr jetzt wisst, wo das ist, ich glaube hier. Hier, kann man Lootfilter einstellen. Ähm, und das versteckt halt manche Drops. Zum Beispiel, wenn man hier guckt, es sieht gar nicht so aus, als hätten die Monster viel getroppt, ne? Aber wenn ich mal Alt drücke, sieht man, wie viel die eigentlich getroppt haben. Also sprich, das highlightet mir nur das Wichtige. Oder das, was potenziell wichtig ist. Und ich weiß, dass die richtig guten Spieler verwenden auch fast jeder einen eigenen Lootfilter. Und, ähm, halt mit dem, was man sucht. Weil die Monster droppen so unglaublich viel, da blickst du nicht durch, wenn du keinen Lootfilter hast. Irgendjemand hat auch gefragt, was das für Flaschen sind. Das ist was, was ich noch während meinem Leveln gefunden habe. Ja, gut. Ähm, das ist einmal so eine Instant-Heal-Flasche. Die ist sogar relativ teuer, wenn man die kaufen will. Ich glaube, irgendwie 10 Chaos oder so. Irgendwie in dem Dreh. Äh, und normales, stinknormales Zeug. Einmal für mehr Rüstung, ein bisschen Movement Speed, für mehr Movement Speed und für Mana auffüllen. Also nichts super spezielles. Und in manchen dieser Missionen kriegt man halt noch mal Untermissionen. Da muss man jetzt zum Beispiel, ähm, dieses Gebiet hier abschließen, ohne zu sterben. Easy. Wir sind ja auch vom Level nicht sonderlich hoch. Ich meine, das ist eine Tier-8-9-Map. Das ist ja zum Mittel. So, Monsters Reflect Elemental Damage ist für mich kein Problem. Kann man sonst noch zur Auswahl... Ich glaube... Das ist sogar besser. Einmal das. Spielst du schon lange? Äh, ich habe gespielt vor 5 Jahren mal. Das ist meine erste League seit... äh, seit 5 Jahren. Man kommt aber wieder halbwegs schnell rein. Das einzige Problem ist, dass so viel Neues an Währungen und Crafting-Möglichkeiten, sonst was mittlerweile drin sind. Das ist der Wahnsinn. Also, da habe ich noch nicht komplett aufgeholt. Deswegen, wenn sich einer richtig gut auskennt... Ich hätte, ich hätte da noch ein bisschen mehr. Zum Beispiel, wie man, wie man das mit dem... Craften mit den, ähm... Nicht mit den Fragments, mit diesen anderen Dingern macht, mit diesen gelben Dingern. Das habe ich noch nicht so ganz gecheckt. Wie man mit den gelben Dingern craftet. Das muss man irgendwie aus der Mine holen oder so, ne? Ich weiß gar nicht aus dem Kopf, wie die gelben Dingern heißen. Äh, ähm... Äh, Incubator oder so, kann das sein? Zumindest gibt es, gibt es irgendwie neue, neue Crafting-Sachen. So, so gelbe Dinger. Fossils, Fossils meine ich, genau. Jetzt fällst du mir wieder ein. Äh, Fossil-Crafting. Die pflege ich noch, die pflege ich noch nicht wirklich durch. Äh... Ich habe mir mal, ich habe mir einen Guide so angeguckt. Der hat gesagt, man muss irgendwie sich in diesem Minen-Camp irgendwelche Dinger kaufen, wo man die dann einsetzt. Und dann gibt es eine extra Crafting-Simulator irgendwie. Ich habe, da habe ich, da habe ich, das hat man hier nicht verarbeitet, äh. Da gibt es dann wohl irgendwie einen extra Crafting-Simulator, wo man gucken kann, welche Fossils man am besten einsetzt, dass man die größten Chancen auf die Mine hat. Und welche Fossils man am besten einsetzt, dass man die größten Chancen auf den besten Item-Roll hat. Äh... Da habe ich, da hat es bei mir im Kopf ausgestiegen. Das habe ich doch nicht kapiert. Achso, wir haben die Mission übrigens beendet. Cute-Chat. Aber auch sowas von cute heute, der Chat-Gio. Der Chat ist heute cute, cute. Cute, cute-Chat. Du brauchst dafür Items, in die du diese Fossil einsetzt, dann kannst du das Item auf ein Item... Aber man braucht diesen komischen Crafting-Simulator dafür, oder? Weil ansonsten haben wir da keine Ahnung, was da am Ende rauskommt. Äh, wir müssen übrigens hier noch den Tentacle-Encounter machen. Und hier habe ich auch noch keinen richtigen Plan, wie man das am besten macht. Aktuell mache ich es einfach so. Ich nehme dieses Blitz-Ding und upgrade das und dann mache ich sonst nichts mehr. Dann mache ich es auch ein bisschen slow. Aber das ist wahrscheinlich voll Noob-Style, wie ich das mache. Das ist so ein bisschen diesen Tower-Defense-Mode. Was für mein Build gerade weniger ein Problem ist, weil halt meine Minions-OP sind und alles wegbashing. Ich muss im Prinzip, ich kann es hier face-rollen. Hände weg vom Keyboard, easy-Mode. Also viel muss ich da ja nicht machen. Aber später weiß ich, wird es ein bisschen komplizierter. Da habe ich schon gesehen, es gibt ja auch komplette Maps, die nur diesen Tower-Defense-Monster-Bash-Modus haben. Und da kommen dann 30 Milliarden Gegner. So, erstmal mehr Monster beschweren, easy. Übrigens, wenn ihr nicht seht, was hier passiert, das ist normal. Ich sehe das auch nicht. Ich mache einfach Hände hoch, easy-Mode, Summoner-Build. So, wenn man dann zumindest alle Monster gebashed hat, die aus den Portalen rauskommen, dann kriegt man, wenn man Glück hat, ultra-nices Loot. Da ist jetzt nicht so viel tolles Zeug dabei gewesen gerade. Aber wir haben ja noch ein paar Kisten zum Aufmachen. Mehr Cards. Die verkaufen sich teilweise auch für richtig viel Kohle. Die meisten Unix sind nichts wert. Was? Eis, Feuer, Feuer, Eis, Erde, Plitzminen, jetzt halten die Mobs auf. Aha. Okay. Was haben wir denn da? Übrigens, ich habe noch was Schönes. Wenn ich jetzt Steuerung C drücke, ich habe ja schon wie die Pros, ich bin zwar noch kein Pro in dem Game, aber ich habe schon die Tools wie die Pros am Start, erstmal abrufen, was das Item wert ist und feststellen, das ist ein absolutes Crap-Unique, was man eigentlich auch gleich an den Hersteller, äh, zurückschicken könnte. Also direkt an den Händler raushauen könnte. Erstmal gleich, erstmal gleich hier online Wert checken des Items. Chaos Orb, lohnt fast schon gar nicht. So, raus, next. Refund. Und eins habe ich mir auch von den Pros auf Twitch abgeguckt, man braucht Dump-Taps, also sprich, dass man nicht nach jeder Runde sein Kram hier durchsortieren muss, macht man sich einfach ein paar Dump-Taps im Stash und dumpt den ganzen Crap dann da rein, außer das, was man behalten will für die nächste Runde und macht dann gleich weiter. Oh, Sana ist der Meinung, wir haben eine Mission. Oh nee, Story-Mission, der Crap braucht schon Story-Mission. Und next. Machen wir mal ein bisschen was schwereres. Machen wir mal eine Tier-14-Map, ist das Reflect oder sowas? Players cannot regenerate life, mana or energy shield. Das kann ein bisschen schwierig werden. Ups. Watch-Stones, ach stimmt, genau, das vergesse ich auch immer, Leute, das vergesse ich auch immer. Hier hat man so eine Übersichtskarte, quasi welche der Minimissionen man schon durch hat und normalerweise sollte man gucken, dass wenn man sagt, okay, wir machen jetzt keine Ahnung, wir machen jetzt irgendwie, weiß ich, die Map, kann man G drücken, sich das highlighten lassen, wo das ist und sieht das dann hier, aber hier, und man kann quasi in diese, was ist das hier? Zitadels, Zitadellen, auch immer das auf Deutsch heißt, kann man nach und nach Steine anlocken und die sind dann quasi für das jeweilige Gebiet zuständig, wo diese Missionen drinne stattfinden und darauf wiederum kann man dann noch Items anwenden, die die Drops verbessern. Was die Wisdom und Portal Scrolls, kannst du raus machen aus dem Filter. Orb, off chance kannst du eins... Aha. Okay, gut. Gut zu wissen. Ich meine, ich schraube jetzt nicht am Blutfilter rum, aber das ist auf jeden Fall gut zu wissen. Also, die Unübersichtlichkeit wurde nicht gespart. Ich finde, die meisten Sachen sind schon, wenn man verstanden hat, dass sie da sind, sind eigentlich schon ganz innovativ, intuitiv zu benutzen. Also, das Trade System ist gut, wenn man es kapiert hat, dass man beispielsweise seine Stashtaps freischalten kann und sowas. Alles kein Ding. Das Game ist halt mehrere Simulationen in einem, ja? Von Wirtschaftssimulationen bis Crafting, random, alles. Es ist halt ultra komplex, was alles drinne steckt. Alternativ, spielt man einfach ein Kack-Noop-Bild wie ich und macht jetzt hier Hände hoch, Noop-Modus und dann geht man wieder dahin und stellt fest, aha, alle Mops tun, weil das Bild zu OP ist. Ich kann euch gleich mal mal ein Gear zeigen. Das ist wirklich nichts Teures. Ich meine, ich habe auf dem Charakter, was habe ich denn hier, Played, einen Tag zwölf Stunden. Das ist, denke ich mal nicht sonderlich viel. Andere haben da wahrscheinlich mindestens eine Woche oder so. Aber wie gesagt, ich hatte davor noch einen anderen Charakter, aber den habe ich auch nicht so viel länger gespielt. Quiien? Ich meine, die platzen einfach ward, Nearculo. Dieyskiilette Aw wayso krass. Lohnt sich das eigentlich noch die restliche Map zu machen oder lohnt sich das immer nur bis zum Boss zu gehen? Aber ich hab dich nur aus dem Augenblick gesehen. Was stimmt da nicht? Was hab ich falsch gemacht? Oh nice. Jetzt gibt's Clusterfuck Leute, sag ich euch. Oh was war das? Ah ne 14er, aber jetzt gibt's Clusterfuck Leute, Achtung, Epilepsie Warnung, Epilepsie Warnung. Oh mega Lull. Oh ich bin gleich tot, wenn ich nicht auflasse. Okay Leute, habt ihr alle verstanden was passiert ist? Ich hab's dir schon angekündigt. Es gibt manchmal so Art Rifts, wo dann 30 Milliarden Mops rauskommen und dadurch, dass ich so ne Noob Summoner build hab, das einzige was ich machen muss ist einfach Skelette spawnen und im Kreis rennen und nichts machen und die killen das alles für mich. Okay. Ach da unten. Hä? Moment. Was ist mein Lootfilter der Meinung, soll ich hier aufheben? Blink blink, alles tot, ach da unten, hab ich gar nicht gesehen eben. Ja, ähm wie gesagt lohnt sich das die Map quasi immer noch mal komplett fertig zu machen? Ja klar, kann man zu zweit spielen. Ich glaub bis zu 4 Leute in der Party, bin ich mir nicht sicher. Es gibt so ein paar Leute die übertreiben es voll und machen Koop Builds, quasi mit Buffbots und sowas. Ähm lohnt sich das die Map fertig abzukrasen, wenn man den Bosszugang schon gefunden hat oder geht man einfach nur rein, Bossbashing gut ist. Oh Hände hoch, oh okay doch nicht Hände hoch, ist okay, nichts gesagt. Oh da ist was rotes getroppt oben, easy, easy win, easy kill. So und das ist jetzt hier neue Mechanik in der aktuellen League, ähm die Monster troppen random irgendwelche Organe und die kann man dann hier einsetzen und je nachdem was die Monster für Innereien getroppt haben, kann man daraus ein neues Boss Monster zusammen basteln, was dann spezielle Eigenschaften hat und besondere Sachen troppt. Das Problem ist nur, die Dinger sind teilweise übelst brutal, die one shotten einen auch mal ganz gerne. Also das heißt jetzt muss man erstmal gucken was man haben will, wir wollen auf jeden Fall extra Currency immer, mehr Essences, die lassen sich ganz gut verkaufen im Zweifelsfall. So und jetzt hoffen wir dass der uns nicht one shottet, ach ne da geht, der ist nicht so wild. So und Leute deswegen, das ist der Grund warum ihr ne Lootfilter braucht, weil wenn ich jetzt mal all drücke, ohne Lootfilter hätte er das hier alles angezeigt und mit Lootfilter ist auch schon recht viel, aber dann blickst du gar nicht mehr durch. Also ich glaube wenn 6 Leute oder 4 Leute in der Party, 6 Leute, das geht, das rechner Kackt einfach nur ab. Ja um auch wieder auf die ursprüngliche Frage zurück zu kommen, die ich ganz am Anfang gestellt hab, hat irgendjemand nen guten Tipp für nen Micro SD Karten Case, so irgendwas wo mehrere reinpassen, am besten wo 24 reinpassen, alles alles Müll, müsste es doch geben, ich mein einfach so nen Koffer mit mehreren Seiten zum durch plättern, aber gibt es irgendwie nicht. Mache mal wieder das Kirby Theme an, da haste recht, da wirds mal wieder Zeit, Kirby Gourmet Race, 10 Stunden, jawoll, endlich mal wieder gescheite Musik, sehr gut, so muss das sein, so mag ich das, ich fackel übrigens hier gerade mein ganzes Hotel quasi ab, so jetzt muss ich mal kurz gucken, ob ich irgendwas im Chat übersehen hab, Boss lohnts oft sogar eher nicht, wenn du den nicht direkt bursten kannst, weil du kaum Loot bekommst im Vergleich zu, ok, gut bei mir ist der Mob, der Boss meistens relativ schnell tot, einfach ein paar Skillette drauf und fertig, ja Maxi Villanos mit TF is going on, weiß ich auch nicht, aber die Mops fallen um und sie troppen Dinger, Discharge Build ist unübersichtlicher oder Flickerstrike, also ich weiß nicht, ich find das schon übertrieben unübersichtlich, meinst du sowas hier, Moment, das ist ja witzig, das ist ja lustig, dass du ausgerechnet das hier zeigst, weil das ist genau das, was es auch in China gibt, bloß dass es in China 1,50€ kostet, guck mal, das ist genau das gleiche was es in China gibt, Moment, wo ist es denn jetzt, Micro SD, ich hatte vorhin genau das gleiche in China, hier, das ist genau das gleiche, nur aus China und da kostet es nur 1,21€, also 1,21€ versus 10€, aber wobei das nicht genau das ist was ich vorhin gefunden hab, hier, das hatte ich vorhin, also im Prinzip genau das gleiche Kram kostet 1,50€ zu 10€ hier, aber im Prinzip sowas, sowas in der Richtung suche ich, allerdings halt nicht für SD-Karten, sondern für Micro SD-Karten und es ist ja Platzverschwendung, wenn man hier eine Micro SD-Karte rein macht, was Buffering, oh nicht schon wieder, oh come on Unity Media, Unity Media was ist los, Moment Leute, Alter, nicht schon wieder, wollt ihr mich verarschen, das haben wir doch letztens erst, nicht zum Angebot, ihr kriegt jetzt von mir erstmal den Scheißhaufen wieder, heute ist eh eine massive Störung bei Vodafone, ich hab das Gefühl es ist immer eine massive Störung bei Unity Media und Vodafone ist das gleiche, ja die haben keinen Marcel Davis, die haben den Twittersupport, der sich Mühe gibt aber die halt auch für die Crap Technik ist, guckt euch das mal an, fuck, wobei es bringt nichts wenn ich das runter mache, ich mach mal einen Speedtest auf dem zweiten Monitor und guck mir das mal an, guck mal wie der Speedtest läuft, es kann sein das es jetzt ruckelt aber das liegt dann am Speedtest, oh ne der Speedtest geht gar nicht richtig, wenn der Speedtest schon nicht richtig funktioniert dann weißt du was los ist, na geil, schade um Unity Media, macht doch keinen Unterschied unterm Strich, wem das jetzt gehört, ich glaube nicht dass es einen großen Unterschied macht, außer dass das rot übelst aggressiv macht, also ich weiß immer noch, ihr fragt mich immer noch welche Firma auf die Idee kommt ihre Hauptfarbe rot zu machen, fällt mir bloß ein Operahein und Vodafone, okay haben die andere Sachen, das ist doch immer noch genau das gleiche, wie ich auch bei Unity Media hab, bloß dass sie hier den Quoten-Opa setzen haben, weil das gar kein Opa ist, da steht der Quoten-Boomer, der noch telefoniert, was geht mit dem eigentlich ab, der telefoniert, hat eine Fernbedienung in der Hand und hat ein Notebook auf dem Schoß, was macht der eigentlich alles parallel, außerdem wozu braucht er ein Telefon wenn er sein Notebook da am Start hat, er braucht auch kein Fernseher wenn er sein Notebook direkt, was auch immer, gehts eigentlich wieder, funktionierts wieder oder lagts noch, laggerino, okay scheint wieder zu funktionieren, ich mein vielleicht liegt es auch am Twitch Server, ja, Frankfurt, aber ich mein Frankfurt ist der beste Twitch Server überhaupt, alter was ist das hier, Unity Media, was soll denn der Scheiß, spacken er, kann ich nicht streben so, wie soll das funktionieren, wie soll das funktionieren, 107, 0, 0, Leute, ich glaube, ich werd mal eine Sache probieren, ich werd mal ausmachen und den Router mal neu starten, ich weiß, das ist ja bescheuert, ergibt keinen Sinn, aber mach ich mal unten einen anderen Server für Twitch auswählen, das heißt ich bin in 5 Minuten oder so wieder am Start und mal gucken, weil ich mein, so ist ja fürn Arsch, so bringts ja nix, bin gleich wieder am Start.", "segments": [{"id": 1, "start": 0.0, "end": 3.0, "text": "Wie sind die Emoats? Bissle groß."}, {"id": 2, "start": 5.0, "end": 7.0, "text": "Monkeys."}, {"id": 3, "start": 10.0, "end": 13.0, "text": "Mal gucken, wie schnell ich das Ganze drücken kann."}, {"id": 4, "start": 16.0, "end": 18.0, "text": "Okay, schneller geht nicht."}, {"id": 5, "start": 18.0, "end": 22.0, "text": "Aber zumindest eins ist cool zu sehen. Egal wie schnell ich klicke, immer ein Tool kommt mit."}, {"id": 6, "start": 22.0, "end": 24.0, "text": "Ja, das ist ein bisschen..."}, {"id": 7, "start": 29.0, "end": 33.0, "text": "Mal gucken, bis Twitch das Ganze mitkriegt, dass ich on bin. Es dauert ja immer ein bisschen."}, {"id": 8, "start": 36.0, "end": 38.0, "text": "Ah, es limpt."}, {"id": 9, "start": 42.0, "end": 46.0, "text": "Sag mal, kennt ihr mal ein gutes Mikro SD-Karten-Aufbewahrungs-Case?"}, {"id": 10, "start": 47.0, "end": 50.0, "text": "Ich hab da vorhin mal gesucht. Ich find' nur absoluten China-Crap."}, {"id": 11, "start": 50.0, "end": 57.0, "text": "Wenn man dann mal in China sucht, dann findet man zwar was, aber das sieht mega billig aus."}, {"id": 12, "start": 58.0, "end": 61.0, "text": "Sowas hier in der Richtung. Das sieht mega billig aus."}, {"id": 13, "start": 63.0, "end": 65.0, "text": "Sag mal, bin ich überhaupt on?"}, {"id": 14, "start": 67.0, "end": 70.0, "text": "Ich glaub' Twitch hat das noch nicht gecheckt."}, {"id": 15, "start": 70.0, "end": 79.0, "text": "Egal, ich warte einfach mal kurz. Twitch braucht ja manchmal seine 5 Minuten."}, {"id": 16, "start": 81.0, "end": 85.0, "text": "Kann schon mal ein bisschen mein Zeug hier dampfen."}, {"id": 17, "start": 87.0, "end": 90.0, "text": "Ich hab hier irgendwie Mist reingelegt."}, {"id": 18, "start": 91.0, "end": 96.0, "text": "PoE-Stream. Ja, aber einzig und allein nur, weil ich echt im Konflikt bin."}, {"id": 19, "start": 96.0, "end": 103.0, "text": "Ich wollte heute eigentlich ein bisschen Laberstream machen, ein bisschen Zeug nachgucken."}, {"id": 20, "start": 104.0, "end": 108.0, "text": "Was man sich vielleicht holen könnte, was man streamen könnte in Zukunft."}, {"id": 21, "start": 109.0, "end": 118.0, "text": "Vielleicht sowas in der Richtung wie ein Streaming-Plan machen wollte ich."}, {"id": 22, "start": 118.0, "end": 126.0, "text": "Aber nix. Ihr kennt mich ja. Wenn ich es übertreibe und sag' Leute, ich stream jetzt zu diesem und diesem Termin dreimal die Woche, dann funktioniert das nicht."}, {"id": 23, "start": 127.0, "end": 129.0, "text": "Dann bin ich einmal da und danach nicht mehr."}, {"id": 24, "start": 130.0, "end": 141.0, "text": "Ich wollte mir irgendwie mal sowas überlegen, dass man nicht einen festen Plan macht, sondern einfach mal überlegt, was könnte man für Themen machen, dass man dann quasi weiß, was demnächst aufhandzukommt."}, {"id": 25, "start": 142.0, "end": 144.0, "text": "Primo2k abonniert Stufe 1, 2 Monate. Dankeschön."}, {"id": 26, "start": 144.0, "end": 151.0, "text": "Leute, ich muss mal den Chat refreshen. Ich seh' euch kurz nicht, aber der Chat ist ja brav bei mir immer."}, {"id": 27, "start": 152.0, "end": 154.0, "text": "Cute Chat."}, {"id": 28, "start": 155.0, "end": 158.0, "text": "So, jetzt seh' ich euch wieder."}, {"id": 29, "start": 159.0, "end": 161.0, "text": "Jetzt vorbei mit lustig."}, {"id": 30, "start": 162.0, "end": 166.0, "text": "Hat jemand von euch ein gutes USB-Aufbewahrungs-Case?"}, {"id": 31, "start": 166.0, "end": 173.0, "text": "Irgendwas Gescheites? Irgendwas, was taugt, was nicht so'n billig China-Ding ist und wo auch ein bisschen mehr reinpassen?"}, {"id": 32, "start": 174.0, "end": 176.0, "text": "Weil das ist totaler Müll."}, {"id": 33, "start": 177.0, "end": 181.0, "text": "Wie ist eigentlich die Musik? Passt? Bissi laut, hä?"}, {"id": 34, "start": 182.0, "end": 184.0, "text": "Bissi laut, die Musik."}, {"id": 35, "start": 185.0, "end": 191.0, "text": "Sonst gibt's gleich wieder hier. Sonst sagt Twitch im Watt, nein, hier ist kein Sound drinne."}, {"id": 36, "start": 191.0, "end": 197.0, "text": "Nimmst du Überraschungseier für deine USB-Sticks? Hab ich USB-Stick gesagt?"}, {"id": 37, "start": 198.0, "end": 202.0, "text": "Äh, ich mein' Mikro-SD-Karte. Ihr wisst ja, ich sag' manchmal Dinger und mein' andere."}, {"id": 38, "start": 203.0, "end": 206.0, "text": "Weil ich bin ja schon 35, da kann das mal vorkommen, ja."}, {"id": 39, "start": 208.0, "end": 214.0, "text": "Nimm am besten das Waterproof-Gun-Case. Du meinst das, was man mit der Gabel aufmachen kann? Exzellent."}, {"id": 40, "start": 215.0, "end": 218.0, "text": "Phoenix, sieben Monate. Huge."}, {"id": 41, "start": 218.0, "end": 222.0, "text": "Ups, äh, falsch. Auch falsch."}, {"id": 42, "start": 223.0, "end": 227.0, "text": "Ja, ich kann meine Emotes nicht mehr klicken, aber danke für die sieben Monate."}, {"id": 43, "start": 228.0, "end": 232.0, "text": "Das wollte ich haben. Richtig Boomer-Hirn."}, {"id": 44, "start": 233.0, "end": 238.0, "text": "Habt ihr eigentlich schon gesehen, dass wir Boomer-Emotes haben mittlerweile? Wir haben Boomer-Emotes."}, {"id": 45, "start": 239.0, "end": 243.0, "text": "Äh, Leute, wie laut ist denn so die Lautstärke?"}, {"id": 46, "start": 243.0, "end": 247.0, "text": "Ein bisschen laut, hä? Ich glaub', das müssen wir einen Ticken runter machen."}, {"id": 47, "start": 248.0, "end": 252.0, "text": "Ich glaub', das müssen wir... Oh Gott. Windows-Mixer, please."}, {"id": 48, "start": 253.0, "end": 255.0, "text": "Windows-Mixer."}, {"id": 49, "start": 256.0, "end": 259.0, "text": "Es ist mittlerweile so übertrieben kompliziert, irgendwelche Settings zu machen."}, {"id": 50, "start": 260.0, "end": 263.0, "text": "Man kann ja, man kann ja Linux 1 vorwerfen, ja."}, {"id": 51, "start": 264.0, "end": 268.0, "text": "Das ist von der Oberfläche teilweise 20 Jahre zurück, wenn ich mir das an manchen Stellen angucke."}, {"id": 52, "start": 268.0, "end": 274.0, "text": "Aber es hat oftmals einen gewissen Weg, der, wenn man es verstanden hat, logisch ist."}, {"id": 53, "start": 275.0, "end": 277.0, "text": "Der ist nicht immer gleich logisch."}, {"id": 54, "start": 278.0, "end": 281.0, "text": "Wartet mal, wartet mal, ist das ein bisschen laut?"}, {"id": 55, "start": 282.0, "end": 285.0, "text": "Oder kommt mir das nur so laut vor?"}, {"id": 56, "start": 286.0, "end": 288.0, "text": "Wartet mal. Ist das nicht zu laut?"}, {"id": 57, "start": 289.0, "end": 292.0, "text": "Nee, ich glaub', das passt, oder?"}, {"id": 58, "start": 292.0, "end": 298.0, "text": "Stopp, passt. Oh, der Scamtrain."}, {"id": 59, "start": 299.0, "end": 303.0, "text": "Der Scamtrain. 94% Scamtrain am Start. Alter, was ist da los?"}, {"id": 60, "start": 304.0, "end": 308.0, "text": "Oh, da will irgendeiner was kaufen von mir. Was, Moment, was will der Dude kaufen?"}, {"id": 61, "start": 309.0, "end": 312.0, "text": "Buy your Heartbreaker Roll Skin listed for 3 Chaos Ops."}, {"id": 62, "start": 313.0, "end": 316.0, "text": "Ach du Scheiße. Moment, der will was kaufen."}, {"id": 63, "start": 317.0, "end": 320.0, "text": "Wartet mal. Was will der Dude kaufen? Das da, oder? Nee."}, {"id": 64, "start": 320.0, "end": 323.0, "text": "Moment. Stashtab, Price, blablabla."}, {"id": 65, "start": 324.0, "end": 333.0, "text": "Left 6, 1, 2, 3, 4, 5, 6, 100. Ach, das da. Das will der kaufen?"}, {"id": 66, "start": 334.0, "end": 337.0, "text": "Das, was der kaufen will?"}, {"id": 67, "start": 338.0, "end": 341.0, "text": "Ah, ich glaub' schon. Okay, easy."}, {"id": 68, "start": 343.0, "end": 345.0, "text": "Den walten wir den Dude mal."}, {"id": 69, "start": 345.0, "end": 349.0, "text": "Was machen wir gleich mit der Klasse Trade Action?"}, {"id": 70, "start": 354.0, "end": 358.0, "text": "Hat er gerade eh, weiß ich nicht, wie lang das her ist, wo er geschrieben hat."}, {"id": 71, "start": 359.0, "end": 362.0, "text": "Egal, ich hab' ihn jetzt mal invited. Mal gucken, ob der noch auftaucht."}, {"id": 72, "start": 363.0, "end": 367.0, "text": "Äh, ja. Danke für die ganzen Subs. Ich glaub', ich hab' was übersehen, denn..."}, {"id": 73, "start": 368.0, "end": 371.0, "text": "Oh, da ist er am Start. Der Neo aus Stufe 1. Dankeschön."}, {"id": 74, "start": 371.0, "end": 375.0, "text": "Äh, äh, äh, äh, äh, Trade."}, {"id": 75, "start": 382.0, "end": 384.0, "text": "Ich glaub', THX."}, {"id": 76, "start": 385.0, "end": 390.0, "text": "Gibt es, weiß jemand, ob es eine Option gibt zum automatischen Antworten?"}, {"id": 77, "start": 391.0, "end": 393.0, "text": "Das hab' ich noch nicht so ganz gecheckt."}, {"id": 78, "start": 395.0, "end": 397.0, "text": "Hat jemand eine Ahnung?"}, {"id": 79, "start": 397.0, "end": 400.0, "text": "Jetzt ist auch ich Trade und nicht jetzt voll am Trade, naja."}, {"id": 80, "start": 401.0, "end": 404.0, "text": "Bisschen, ich muss Gear Upgrade. Hey, mein Gear ist jetzt gar nicht mehr übel."}, {"id": 81, "start": 406.0, "end": 412.0, "text": "Mein Gear ist jetzt, ich hab' gesagt, ich Trade nicht, bis ich ein bisschen Durchblick im Game hab', aber es geht jetzt mittlerweile eigentlich."}, {"id": 82, "start": 413.0, "end": 418.0, "text": "So. Wenn ihr wollt, ich glaub', ich bin mir nicht sicher, wie viele Leute das Game kennen."}, {"id": 83, "start": 419.0, "end": 424.0, "text": "Ähm, ich würd' mal ganz kurz was zu dem Game erzählen für die Leute, die das nicht kennen."}, {"id": 84, "start": 424.0, "end": 430.0, "text": "Wenn ihr wollt, ja. Weil es ist, also nur mal, nur mal so ganz grob, weil es ist ultra komplex, das Game."}, {"id": 85, "start": 431.0, "end": 432.0, "text": "Ich werd', ich werd' euch jetzt mal schocken."}, {"id": 86, "start": 433.0, "end": 436.0, "text": "Äh, was hältst du eigentlich von Blazer? Server oder Client-Side?"}, {"id": 87, "start": 437.0, "end": 439.0, "text": "Äh, aktuell ist, glaub' ich, das Einzige, was supported ist, Server-Side."}, {"id": 88, "start": 440.0, "end": 442.0, "text": "Client-Side ist, glaub' ich, noch nicht supported."}, {"id": 89, "start": 443.0, "end": 447.0, "text": "Äh, Blazer fehlt einiges noch. Blazer fehlt einiges noch."}, {"id": 90, "start": 447.0, "end": 456.0, "text": "Blazer fehlt einiges noch. Das ist was, was wir uns, wir haben's uns ja schon mal on stream angeguckt, was man, äh, was man uns in fünf Jahren nochmal angucken können,"}, {"id": 91, "start": 457.0, "end": 465.0, "text": "wenn man, ähm, beispielsweise bei diesem ganzen Web-Assembly-Zeug nicht noch, nicht noch JavaScript zusätzlich braucht."}, {"id": 92, "start": 466.0, "end": 470.0, "text": "Das ist, das ist, ich, ich war ein bisschen enttäuscht von, es geht einfach vieles noch nicht."}, {"id": 93, "start": 471.0, "end": 473.0, "text": "Sieht für mich aus wie Diablo ist es im Prinzip ja auch."}, {"id": 94, "start": 473.0, "end": 483.0, "text": "Ein bisschen, aber eher wie Diablo 2. Also, nur mal, nur mal ganz kurz, Leute, zum, zum Game, ja, das, äh, was wir jetzt, wir werden ein bisschen, ein bisschen Kreisel-Client machen,"}, {"id": 95, "start": 484.0, "end": 492.0, "text": "weil ich war voll im Konflikt zwischen, ähm, zwischen Streamsorn und, und Kreisel-Client in Path of Exile machen."}, {"id": 96, "start": 493.0, "end": 500.0, "text": "Deswegen hab' ich gedacht, egal, ich weiß, dass nicht allzu viele zugucken, ähm, oder wahrscheinlich nicht so wahnsinnig viele interessiert,"}, {"id": 97, "start": 500.0, "end": 505.0, "text": "aber besser als gar nicht streamen und gar nicht Kreisel-Client, habe ich gedacht, dann mach ich wenigstens mit weniger Zuschauern Kreisel-Client"}, {"id": 98, "start": 506.0, "end": 508.0, "text": "und labern ein bisschen über aktuelle Technik oder Geschichten."}, {"id": 99, "start": 509.0, "end": 517.0, "text": "Ähm, eine Sache, die allen Leuten auffällt, die neuen Path of Exile sind, was für ein Item kreiselst du oder farmst du irgendwelche Maps?"}, {"id": 100, "start": 518.0, "end": 522.0, "text": "Äh, ich werde wahrscheinlich irgendwelche Maps farmen, ja, irgendwelche, mal gucken, mal gucken, was wir machen."}, {"id": 101, "start": 523.0, "end": 526.0, "text": "Ich erzähl' aber erstmal kurz was zum Game. Ich hab' hier erst wieder angefangen."}, {"id": 102, "start": 526.0, "end": 530.0, "text": "Das ist meine erste League seit, äh, fünf Jahren."}, {"id": 103, "start": 533.0, "end": 538.0, "text": "Ähm, ich muss immer mal gucken, nicht, dass irgendjemand was, was, was kaufen will."}, {"id": 104, "start": 539.0, "end": 541.0, "text": "Ähm, rofl1436, dankeschön für den Sub."}, {"id": 105, "start": 542.0, "end": 548.0, "text": "Und das erste, mit was die Leute bei Path of Exile in Kontakt kommen, wenn sie neu in das Game..."}, {"id": 106, "start": 548.0, "end": 556.0, "text": "Wenn sie neu in das Game... Oh, der Hype-Train, Poggers, alter, huge, dankeschön für die, für den, für den, das, das, das Scam-Train war erfolgreich."}, {"id": 107, "start": 557.0, "end": 564.0, "text": "Das erste, mit dem viele Leute von Path of Exile in Kontakt kommen, was ganz viele Leute abschreckt, ich zeig' euch mal den Skill-Tree."}, {"id": 108, "start": 565.0, "end": 569.0, "text": "Äh, FlickGP, dankeschön, ich zeig' euch mal den Skill-Tree."}, {"id": 109, "start": 570.0, "end": 572.0, "text": "Und ich sag euch, Leute, nicht erschrecken, nicht, nicht erschrecken."}, {"id": 110, "start": 573.0, "end": 576.0, "text": "Oh, Skamars Level 2, 50% sogar schon."}, {"id": 111, "start": 576.0, "end": 586.0, "text": "So, der Skill-Tree, ihr kennt andere, also, ihr kennt Skill-Trees noch vielleicht aus Diablo 2, oder Diablo 3 hat ja keinen Skill-Tree mehr."}, {"id": 112, "start": 587.0, "end": 588.0, "text": "Das war nur so der Skill-Tree in Diablo 2."}, {"id": 113, "start": 589.0, "end": 596.0, "text": "Oder jetzt der Skill-Tree in, in, in Wolsen, oder wie man das ausspricht, der ist Path of Exile inspiriert."}, {"id": 114, "start": 597.0, "end": 601.0, "text": "Der ist, das ist alles relativ klein im Vergleich zu dem Path of Exile Skill-Tree."}, {"id": 115, "start": 601.0, "end": 605.0, "text": "Ich geh' mal kurz ins Game und mach' den Skill-Tree auf."}, {"id": 116, "start": 606.0, "end": 609.0, "text": "Ähm, ja."}, {"id": 117, "start": 610.0, "end": 611.0, "text": "Leute, ne?"}, {"id": 118, "start": 612.0, "end": 617.0, "text": "Das ist der Skill-Tree und ich weiß, dass viele Leute, wenn sie das das erste Mal sehen, denken sich scheißlich an den Stalker wieder."}, {"id": 119, "start": 618.0, "end": 621.0, "text": "Ich denk' mich, fuck, was ist das für ein Crap, Alter?"}, {"id": 120, "start": 622.0, "end": 628.0, "text": "Also, das ist schon im Vergleich mit anderen Action-RPGs ein sehr heftiger Skill-Tree."}, {"id": 121, "start": 628.0, "end": 633.0, "text": "Der Witz ist allerdings, das ist gar nicht, also, wenn man ein bisschen sich das Ganze anguckt hat,"}, {"id": 122, "start": 634.0, "end": 640.0, "text": "wenn man vielleicht auch einen Guide hat, ich hab' da auch mit einem Guide angefangen, äh, wieder, weil das gibt so viel neue Zeug, es ist gar nicht so wild."}, {"id": 123, "start": 641.0, "end": 647.0, "text": "Vor allem, nachdem es ein wunderbares Tool dafür gibt, das Ganze offline zu machen, nehme ich das da."}, {"id": 124, "start": 648.0, "end": 654.0, "text": "Es gibt ein super Tool, um offline seinen Skill-Tree zu, zu gestalten, wo man auch sieht, was, was dann am Ende rauskommt."}, {"id": 125, "start": 654.0, "end": 661.0, "text": "Das ist Free-To-Play, ja, aber ich hab' schon ein bisschen Kohle ausgegeben, weil, weil Stash und so, ne?"}, {"id": 126, "start": 666.0, "end": 668.0, "text": "Hab', ich hab', ich hab' ein paar Stash-Taps gekauft."}, {"id": 127, "start": 673.0, "end": 674.0, "text": "Äh ja, muss, muss sein."}, {"id": 128, "start": 674.0, "end": 683.0, "text": "Genau, und, ähm, ich hab' das Noob-Bild schlechthin, das ist absolut OP, ich spiel', äh, Skeleton Summoner."}, {"id": 129, "start": 684.0, "end": 692.0, "text": "Das, ich hab' angefangen mit Archwitch, weil's dann super Einsteiger-Guide gibt, aber jetzt spiel' ich, äh, das ist, das ist wirklich absolut Noob-Style, das kann jeder."}, {"id": 130, "start": 695.0, "end": 700.0, "text": "Das, das, das kann echt jeder. Also, das ist das beste, das absolut Noob-Style-Einsteiger-Bild schlechthin."}, {"id": 131, "start": 700.0, "end": 710.0, "text": "Da kann man mit minimalem Gear, ich hatte ja Glück, dass ich schon ein bisschen was gefarmt habe, mit meiner anderen Witch, ähm, da kann man Endgame-Content clearen."}, {"id": 132, "start": 711.0, "end": 720.0, "text": "Also, ihr seht's hier, ich hab' hier teilweise mit, ich hab' hier Tier, Tier 16 Maps drinne, Tier 14, 15, 16 Maps, und das geht, ist alles kein Problem, ja."}, {"id": 133, "start": 721.0, "end": 725.0, "text": "So, aber, warum das Skilltree nicht so wild ist, muss ich, muss ich jetzt mal vielleicht kurz erzählen."}, {"id": 134, "start": 725.0, "end": 729.0, "text": "Es sieht erst mal, es sieht erst mal übertrieben, überladen und, und extrem aus."}, {"id": 135, "start": 730.0, "end": 737.0, "text": "Aber, je nachdem, welche Klasse man am Anfang auswählt, startet man entweder hier, hier, hier, hier oder hier, oder in der Mitte, je nachdem."}, {"id": 136, "start": 738.0, "end": 746.0, "text": "Das heißt, wenn man einfach nur mal gucken will und dann mal Richtung, wenn man einfach nur mal einen Caster anspielen will, dann ist das gar nicht so wild."}, {"id": 137, "start": 747.0, "end": 750.0, "text": "Dann startet man hier und skillt halt das so erst mal, wie man lustig ist."}, {"id": 138, "start": 750.0, "end": 754.0, "text": "Den ersten Charakter verkackt man eh, es sei dann, man hat einen ordentlichen Build."}, {"id": 139, "start": 755.0, "end": 763.0, "text": "Und, äh, wie gesagt, ich, ich hab' mir den Build als absolut noob-freundlich, noob-freundlich ein OP-Bild rausgesucht."}, {"id": 140, "start": 764.0, "end": 769.0, "text": "Aber ganz, ganz zum Einstieg, finde ich, ist der Guide echt gut."}, {"id": 141, "start": 770.0, "end": 775.0, "text": "Weil, ähm, das ist zwar kein OP-Bild, aber der erklärt vieles um das Game drum herum."}, {"id": 142, "start": 775.0, "end": 782.0, "text": "Und der erklärt auch, worauf man achten muss beim Leveln und welcher Reihenfolge man am besten levelt und wie man in welcher Reihenfolge man am besten skillt."}, {"id": 143, "start": 783.0, "end": 786.0, "text": "Ähm, das ist, ist echt praktisch."}, {"id": 144, "start": 787.0, "end": 791.0, "text": "Und wenn man dann erst beim Endgame angekommen ist, dann kann man, dann kann man immer noch was anderes spielen."}, {"id": 145, "start": 792.0, "end": 796.0, "text": "Wenn man die Story eins, zwei, drei Mal durchgespielt hat, dann geht das auch ziemlich schnell."}, {"id": 146, "start": 797.0, "end": 799.0, "text": "Das, das geht wirklich ziemlich zackig."}, {"id": 147, "start": 799.0, "end": 805.0, "text": "Ja, ähm, es gibt, es gibt ein paar richtig, richtig coole Tools, wie gesagt, für diesen Skillt, wie zum Verwalten."}, {"id": 148, "start": 806.0, "end": 807.0, "text": "Das kann ich jedem nur empfehlen."}, {"id": 149, "start": 808.0, "end": 811.0, "text": "Da kann man nämlich auch schön vergleichen, so nach dem Motto, in welcher Reihenfolge man leveln sollte."}, {"id": 150, "start": 812.0, "end": 817.0, "text": "Sprich, das was man in-Game macht, in der Reihenfolge, wie das der Guide vorschlägt."}, {"id": 151, "start": 818.0, "end": 820.0, "text": "Das ist, das wirklich sehr praktisch."}, {"id": 152, "start": 821.0, "end": 822.0, "text": "Naja."}, {"id": 153, "start": 822.0, "end": 828.0, "text": "Ähm, wenn ihr irgendwelche Technik-Sachen, Fragen habt, wissen wollt, schießt los."}, {"id": 154, "start": 829.0, "end": 834.0, "text": "Ich mach jetzt mal eine Map und renn, renn eine Runde mal im Kreis und, und, und crying in mir ein."}, {"id": 155, "start": 835.0, "end": 839.0, "text": "Ähm, und eine, eine Sache, die mich echt überrascht hat, persönlich, ist,"}, {"id": 156, "start": 840.0, "end": 843.0, "text": "der deutsche, der global chat,"}, {"id": 157, "start": 844.0, "end": 849.0, "text": "der, der ist tatsächlich mal zur Abwechslung deutlich freundlicher als der global chat."}, {"id": 158, "start": 849.0, "end": 851.0, "text": "Ich weiß gar nicht, was los ist."}, {"id": 159, "start": 852.0, "end": 855.0, "text": "Oh, der, der, der, ist das Gamtrain durch, Leute."}, {"id": 160, "start": 858.0, "end": 859.0, "text": "Ja, der ist fertig."}, {"id": 161, "start": 860.0, "end": 861.0, "text": "Dankeschön für die ganzen Subs."}, {"id": 162, "start": 863.0, "end": 868.0, "text": "Genutze ich den Bits extra für die, äh, du hast unten rechts im Chat, hast du so einen Knopf für Bits."}, {"id": 163, "start": 873.0, "end": 875.0, "text": "Wir machen jetzt, wir machen jetzt erst mal irgendwie eine Runde,"}, {"id": 164, "start": 875.0, "end": 881.0, "text": "wegen Enchanten. Ich bin da übrigens offen, Leute, wenn, wenn ihr euch mit dem Game gut auskennt,"}, {"id": 165, "start": 882.0, "end": 884.0, "text": "also sprich, wenn ihr schon ein bisschen länger spielt, ähm,"}, {"id": 166, "start": 885.0, "end": 890.0, "text": "ich, ich hätte da noch eins, zwei Fragen, was gewisse Items angeht, also wenn sich jemand auskennt."}, {"id": 167, "start": 891.0, "end": 895.0, "text": "Dankeschön für die umgerechnet drei Euro, es war nur der Name frei zwei."}, {"id": 168, "start": 896.0, "end": 897.0, "text": "Big Brain Name."}, {"id": 169, "start": 897.0, "end": 906.0, "text": "Ice Freak, sechs Monate, huge. Wahnsinn. Also falls ihr einer der übelsten Path of Exile Pro ist, ähm,"}, {"id": 170, "start": 908.0, "end": 914.0, "text": "sagt mal Bescheid, es gibt nämlich ein paar Items, wo ich kein, wo ich keinen Plan habe, was sie machen."}, {"id": 171, "start": 915.0, "end": 918.0, "text": "Zum Beispiel, zum Beispiel das hier, guckt mal, ähm,"}, {"id": 172, "start": 918.0, "end": 926.0, "text": "hier, zum Beispiel dieses ganze Zeug. What the fuck, was ist das? Ich hab keinen Schimmer, was das ist."}, {"id": 173, "start": 927.0, "end": 930.0, "text": "Ich, ich blicke ja bei den anderen Sachen im Game mittlerweile halb fix durch,"}, {"id": 174, "start": 931.0, "end": 933.0, "text": "aber ich hab keinen Schimmer, was das, was das Ganze ist."}, {"id": 175, "start": 934.0, "end": 936.0, "text": "Also die Karten weiß ich, aber was machen wir mit den Splittern?"}, {"id": 176, "start": 937.0, "end": 939.0, "text": "Ich hab keine Ahnung, was das Ganze ist."}, {"id": 177, "start": 940.0, "end": 942.0, "text": "Ich hab keine Ahnung, was das Ganze ist."}, {"id": 178, "start": 943.0, "end": 945.0, "text": "Ich hab keine Ahnung, was das Ganze ist."}, {"id": 179, "start": 945.0, "end": 947.0, "text": "Die Karten weiß ich, aber was machen wir mit den Splittern?"}, {"id": 180, "start": 948.0, "end": 950.0, "text": "Also es gibt, das Game hat so viele Sachen."}, {"id": 181, "start": 951.0, "end": 953.0, "text": "Splitter sind für einen Boss."}, {"id": 182, "start": 954.0, "end": 959.0, "text": "Das heißt, ich kann das in mein Map Device rein machen und dann den Map mit dem speziellen Boss spawnen, oder wie?"}, {"id": 183, "start": 960.0, "end": 962.0, "text": "Das hab ich noch nicht gemacht. So, ich, ich, ich, ich,"}, {"id": 184, "start": 963.0, "end": 966.0, "text": "das Ding jetzt einfach mal. Davon brauchst du 100 und das ist deine Art von Map-Boss."}, {"id": 185, "start": 967.0, "end": 968.0, "text": "Okay."}, {"id": 186, "start": 969.0, "end": 971.0, "text": "So, wir rennen jetzt erstmal, wir rennen, wir rennen jetzt erstmal eine Runde hier durch."}, {"id": 187, "start": 971.0, "end": 974.0, "text": "Oh, oh, muss man Zeug, muss man ganze Zeug beschwören."}, {"id": 188, "start": 975.0, "end": 980.0, "text": "Also, ähm, das geht relativ schnell, wie gesagt, mit dem Build."}, {"id": 189, "start": 981.0, "end": 985.0, "text": "Das ist ziemlich OP. Also, ähm, wie soll ich sagen?"}, {"id": 190, "start": 986.0, "end": 988.0, "text": "Das ist halt sehr, sehr, sehr Noob-freundlich."}, {"id": 191, "start": 989.0, "end": 992.0, "text": "Es ist natürlich für viele, für viele mag es ein bisschen langweilig sein, ja."}, {"id": 192, "start": 993.0, "end": 996.0, "text": "Man geht hier rein, beschwört ein paar Skelette, macht Armor an und lässt die Skelette alles umweschen."}, {"id": 193, "start": 996.0, "end": 1000.0, "text": "Easy, easy, es fuckt und sammelt, sammelt Zeug dabei aus."}, {"id": 194, "start": 1001.0, "end": 1005.0, "text": "Und, und sprintet sich halt hier ein ab über die Map und guckt, dass man möglichst viele Mobs basht."}, {"id": 195, "start": 1006.0, "end": 1007.0, "text": "Easy."}, {"id": 196, "start": 1008.0, "end": 1012.0, "text": "Was halt sehr schön schnell geht, weil ich gar, ich muss nichts machen, ich muss einfach laufen."}, {"id": 197, "start": 1013.0, "end": 1015.0, "text": "Ich muss einfach laufen, meine Skelette macht alles platt."}, {"id": 198, "start": 1016.0, "end": 1018.0, "text": "Und das ist eine absolut poggers Map."}, {"id": 199, "start": 1019.0, "end": 1023.0, "text": "Wir haben einen Plight Encounter auf der Map und wir haben noch mal so eine, so eine Inception Map."}, {"id": 200, "start": 1023.0, "end": 1025.0, "text": "Eine Map in der Map."}, {"id": 201, "start": 1028.0, "end": 1030.0, "text": "Ist da Dropsore."}, {"id": 202, "start": 1032.0, "end": 1035.0, "text": "Und dass das Game manchmal framed, ist normal."}, {"id": 203, "start": 1036.0, "end": 1037.0, "text": "Da kann man nichts machen."}, {"id": 204, "start": 1038.0, "end": 1040.0, "text": "Also wahnsinnig gut optimiert ist das Ganze nicht."}, {"id": 205, "start": 1041.0, "end": 1048.0, "text": "Ach ja, eine wichtige Sache, die man machen sollte, wenn man neu einsteigt, habe ich am Anfang auch nicht gemacht."}, {"id": 206, "start": 1048.0, "end": 1053.0, "text": "Ist, sollte man aber direkt von Anfang an machen, man sollte hier den Lootfilter installieren."}, {"id": 207, "start": 1054.0, "end": 1055.0, "text": "Da erkennste nichts."}, {"id": 208, "start": 1057.0, "end": 1059.0, "text": "Warum, weil der Stream verschwimmt."}, {"id": 209, "start": 1060.0, "end": 1063.0, "text": "Oder, oder weil einfach zu viel passiert, wahrscheinlich weil einfach zu viel passiert."}, {"id": 210, "start": 1064.0, "end": 1066.0, "text": "Sollte der Stream verschwimmen, muss ich die Bitrate hochstellen."}, {"id": 211, "start": 1071.0, "end": 1073.0, "text": "Passt das, passt das im Stream?"}, {"id": 212, "start": 1073.0, "end": 1075.0, "text": "Passt das, passt das im Stream?"}, {"id": 213, "start": 1078.0, "end": 1079.0, "text": "Beides?"}, {"id": 214, "start": 1080.0, "end": 1081.0, "text": "Artefakte? Echt?"}, {"id": 215, "start": 1083.0, "end": 1084.0, "text": "Okay."}, {"id": 216, "start": 1085.0, "end": 1087.0, "text": "Ich habe genug Upload, kein Problem."}, {"id": 217, "start": 1088.0, "end": 1090.0, "text": "Ich habe genug Upload, das ist kein, kein Ding."}, {"id": 218, "start": 1092.0, "end": 1094.0, "text": "Machen wir mal hoch, auf 5, gucken wir mal."}, {"id": 219, "start": 1098.0, "end": 1101.0, "text": "Ich muss halt nur gucken, dass ich nicht, dass ich nicht zu hoch mache."}, {"id": 220, "start": 1101.0, "end": 1106.0, "text": "Warum verschmiert der Stream, sollte er eigentlich nicht verschwimmen, das liegt bestimmt an der Bitrate."}, {"id": 221, "start": 1107.0, "end": 1109.0, "text": "Ach ja, auf was habe ich in den Stream gestellt?"}, {"id": 222, "start": 1110.0, "end": 1111.0, "text": "1080?"}, {"id": 223, "start": 1112.0, "end": 1114.0, "text": "Oh, da muss ich ein bisschen mehr machen."}, {"id": 224, "start": 1115.0, "end": 1118.0, "text": "Ähm, Leute, wir müssen mal gucken, wie weit das Ganze geht."}, {"id": 225, "start": 1121.0, "end": 1125.0, "text": "Ich habe jetzt mal hochgestellt, auf 8 ermitt, das müsste jetzt deutlich besser sein."}, {"id": 226, "start": 1125.0, "end": 1127.0, "text": "Das müsste jetzt deutlich besser sein."}, {"id": 227, "start": 1131.0, "end": 1133.0, "text": "Das müsste jetzt deutlich besser sein."}, {"id": 228, "start": 1138.0, "end": 1139.0, "text": "Probieren wir mal aus."}, {"id": 229, "start": 1147.0, "end": 1149.0, "text": "Das müsste deutlich besser sein."}, {"id": 230, "start": 1149.0, "end": 1155.0, "text": "Ist, ist eine Ecke schärfer."}, {"id": 231, "start": 1158.0, "end": 1160.0, "text": "Ja, macht, macht es halt viel aus."}, {"id": 232, "start": 1161.0, "end": 1162.0, "text": "Ja, besser."}, {"id": 233, "start": 1163.0, "end": 1165.0, "text": "Ja, die Bitrate macht es halt krass aus."}, {"id": 234, "start": 1166.0, "end": 1172.0, "text": "Ich habe die Bitrate halt ziemlich hochgestellt, das ist halt für manche vielleicht jetzt zu viel, weil wir sind immer noch Internet in Deutschland, ne?"}, {"id": 235, "start": 1173.0, "end": 1177.0, "text": "Und Internet in Deutschland, wissen wir ja, ist so eine Sache für sich."}, {"id": 236, "start": 1177.0, "end": 1181.0, "text": "Ähm, genau, eine Sache, die ich allen empfehlen würde, die neu anfängt."}, {"id": 237, "start": 1182.0, "end": 1186.0, "text": "Und zwar, wenn man in die Options guckt, hat man hier unten die Möglichkeit..."}, {"id": 238, "start": 1189.0, "end": 1191.0, "text": "Die Musik ist unterschiedlich laut."}, {"id": 239, "start": 1198.0, "end": 1199.0, "text": "Hm."}, {"id": 240, "start": 1200.0, "end": 1201.0, "text": "Null."}, {"id": 241, "start": 1202.0, "end": 1205.0, "text": "Ähm, man hat mir hier unten die Möglichkeit, wenn ihr jetzt wisst, wo das ist, ich glaube hier."}, {"id": 242, "start": 1205.0, "end": 1207.0, "text": "Hier, kann man Lootfilter einstellen."}, {"id": 243, "start": 1208.0, "end": 1212.0, "text": "Ähm, und das versteckt halt manche Drops."}, {"id": 244, "start": 1213.0, "end": 1217.0, "text": "Zum Beispiel, wenn man hier guckt, es sieht gar nicht so aus, als hätten die Monster viel getroppt, ne?"}, {"id": 245, "start": 1218.0, "end": 1220.0, "text": "Aber wenn ich mal Alt drücke, sieht man, wie viel die eigentlich getroppt haben."}, {"id": 246, "start": 1221.0, "end": 1223.0, "text": "Also sprich, das highlightet mir nur das Wichtige."}, {"id": 247, "start": 1224.0, "end": 1225.0, "text": "Oder das, was potenziell wichtig ist."}, {"id": 248, "start": 1226.0, "end": 1230.0, "text": "Und ich weiß, dass die richtig guten Spieler verwenden auch fast jeder einen eigenen Lootfilter."}, {"id": 249, "start": 1230.0, "end": 1234.0, "text": "Und, ähm, halt mit dem, was man sucht."}, {"id": 250, "start": 1235.0, "end": 1239.0, "text": "Weil die Monster droppen so unglaublich viel, da blickst du nicht durch, wenn du keinen Lootfilter hast."}, {"id": 251, "start": 1240.0, "end": 1243.0, "text": "Irgendjemand hat auch gefragt, was das für Flaschen sind."}, {"id": 252, "start": 1244.0, "end": 1246.0, "text": "Das ist was, was ich noch während meinem Leveln gefunden habe."}, {"id": 253, "start": 1247.0, "end": 1248.0, "text": "Ja, gut."}, {"id": 254, "start": 1249.0, "end": 1252.0, "text": "Ähm, das ist einmal so eine Instant-Heal-Flasche."}, {"id": 255, "start": 1253.0, "end": 1255.0, "text": "Die ist sogar relativ teuer, wenn man die kaufen will."}, {"id": 256, "start": 1256.0, "end": 1258.0, "text": "Ich glaube, irgendwie 10 Chaos oder so."}, {"id": 257, "start": 1258.0, "end": 1259.0, "text": "Irgendwie in dem Dreh."}, {"id": 258, "start": 1260.0, "end": 1261.0, "text": "Äh, und normales, stinknormales Zeug."}, {"id": 259, "start": 1262.0, "end": 1265.0, "text": "Einmal für mehr Rüstung, ein bisschen Movement Speed, für mehr Movement Speed und für Mana auffüllen."}, {"id": 260, "start": 1266.0, "end": 1267.0, "text": "Also nichts super spezielles."}, {"id": 261, "start": 1268.0, "end": 1271.0, "text": "Und in manchen dieser Missionen kriegt man halt noch mal Untermissionen."}, {"id": 262, "start": 1272.0, "end": 1276.0, "text": "Da muss man jetzt zum Beispiel, ähm, dieses Gebiet hier abschließen, ohne zu sterben."}, {"id": 263, "start": 1277.0, "end": 1278.0, "text": "Easy."}, {"id": 264, "start": 1279.0, "end": 1280.0, "text": "Wir sind ja auch vom Level nicht sonderlich hoch."}, {"id": 265, "start": 1281.0, "end": 1282.0, "text": "Ich meine, das ist eine Tier-8-9-Map."}, {"id": 266, "start": 1283.0, "end": 1284.0, "text": "Das ist ja zum Mittel."}, {"id": 267, "start": 1284.0, "end": 1287.0, "text": "So, Monsters Reflect Elemental Damage ist für mich kein Problem."}, {"id": 268, "start": 1288.0, "end": 1289.0, "text": "Kann man sonst noch zur Auswahl..."}, {"id": 269, "start": 1295.0, "end": 1296.0, "text": "Ich glaube..."}, {"id": 270, "start": 1299.0, "end": 1300.0, "text": "Das ist sogar besser."}, {"id": 271, "start": 1301.0, "end": 1302.0, "text": "Einmal das."}, {"id": 272, "start": 1305.0, "end": 1306.0, "text": "Spielst du schon lange?"}, {"id": 273, "start": 1307.0, "end": 1309.0, "text": "Äh, ich habe gespielt vor 5 Jahren mal."}, {"id": 274, "start": 1310.0, "end": 1311.0, "text": "Das ist meine erste League seit..."}, {"id": 275, "start": 1311.0, "end": 1313.0, "text": "äh, seit 5 Jahren."}, {"id": 276, "start": 1319.0, "end": 1321.0, "text": "Man kommt aber wieder halbwegs schnell rein."}, {"id": 277, "start": 1322.0, "end": 1330.0, "text": "Das einzige Problem ist, dass so viel Neues an Währungen und Crafting-Möglichkeiten, sonst was mittlerweile drin sind."}, {"id": 278, "start": 1331.0, "end": 1332.0, "text": "Das ist der Wahnsinn."}, {"id": 279, "start": 1333.0, "end": 1334.0, "text": "Also, da habe ich noch nicht komplett aufgeholt."}, {"id": 280, "start": 1335.0, "end": 1337.0, "text": "Deswegen, wenn sich einer richtig gut auskennt..."}, {"id": 281, "start": 1338.0, "end": 1339.0, "text": "Ich hätte, ich hätte da noch ein bisschen mehr."}, {"id": 282, "start": 1339.0, "end": 1341.0, "text": "Zum Beispiel, wie man, wie man das mit dem..."}, {"id": 283, "start": 1342.0, "end": 1345.0, "text": "Craften mit den, ähm..."}, {"id": 284, "start": 1346.0, "end": 1349.0, "text": "Nicht mit den Fragments, mit diesen anderen Dingern macht, mit diesen gelben Dingern."}, {"id": 285, "start": 1350.0, "end": 1351.0, "text": "Das habe ich noch nicht so ganz gecheckt."}, {"id": 286, "start": 1352.0, "end": 1354.0, "text": "Wie man mit den gelben Dingern craftet."}, {"id": 287, "start": 1355.0, "end": 1357.0, "text": "Das muss man irgendwie aus der Mine holen oder so, ne?"}, {"id": 288, "start": 1361.0, "end": 1363.0, "text": "Ich weiß gar nicht aus dem Kopf, wie die gelben Dingern heißen."}, {"id": 289, "start": 1363.0, "end": 1368.0, "text": "Äh, ähm..."}, {"id": 290, "start": 1369.0, "end": 1371.0, "text": "Äh, Incubator oder so, kann das sein?"}, {"id": 291, "start": 1374.0, "end": 1377.0, "text": "Zumindest gibt es, gibt es irgendwie neue, neue Crafting-Sachen."}, {"id": 292, "start": 1378.0, "end": 1379.0, "text": "So, so gelbe Dinger."}, {"id": 293, "start": 1380.0, "end": 1381.0, "text": "Fossils, Fossils meine ich, genau."}, {"id": 294, "start": 1382.0, "end": 1383.0, "text": "Jetzt fällst du mir wieder ein."}, {"id": 295, "start": 1384.0, "end": 1385.0, "text": "Äh, Fossil-Crafting."}, {"id": 296, "start": 1386.0, "end": 1388.0, "text": "Die pflege ich noch, die pflege ich noch nicht wirklich durch."}, {"id": 297, "start": 1389.0, "end": 1390.0, "text": "Äh..."}, {"id": 298, "start": 1390.0, "end": 1392.0, "text": "Ich habe mir mal, ich habe mir einen Guide so angeguckt."}, {"id": 299, "start": 1393.0, "end": 1396.0, "text": "Der hat gesagt, man muss irgendwie sich in diesem Minen-Camp"}, {"id": 300, "start": 1397.0, "end": 1400.0, "text": "irgendwelche Dinger kaufen, wo man die dann einsetzt."}, {"id": 301, "start": 1401.0, "end": 1404.0, "text": "Und dann gibt es eine extra Crafting-Simulator irgendwie."}, {"id": 302, "start": 1405.0, "end": 1408.0, "text": "Ich habe, da habe ich, da habe ich, das hat man hier nicht verarbeitet, äh."}, {"id": 303, "start": 1409.0, "end": 1411.0, "text": "Da gibt es dann wohl irgendwie einen extra Crafting-Simulator,"}, {"id": 304, "start": 1412.0, "end": 1414.0, "text": "wo man gucken kann, welche Fossils man am besten einsetzt,"}, {"id": 305, "start": 1415.0, "end": 1417.0, "text": "dass man die größten Chancen auf die Mine hat."}, {"id": 306, "start": 1417.0, "end": 1419.0, "text": "Und welche Fossils man am besten einsetzt, dass man die größten Chancen"}, {"id": 307, "start": 1420.0, "end": 1421.0, "text": "auf den besten Item-Roll hat."}, {"id": 308, "start": 1422.0, "end": 1423.0, "text": "Äh..."}, {"id": 309, "start": 1424.0, "end": 1426.0, "text": "Da habe ich, da hat es bei mir im Kopf ausgestiegen."}, {"id": 310, "start": 1427.0, "end": 1428.0, "text": "Das habe ich doch nicht kapiert."}, {"id": 311, "start": 1430.0, "end": 1432.0, "text": "Achso, wir haben die Mission übrigens beendet."}, {"id": 312, "start": 1437.0, "end": 1438.0, "text": "Cute-Chat."}, {"id": 313, "start": 1439.0, "end": 1442.0, "text": "Aber auch sowas von cute heute, der Chat-Gio."}, {"id": 314, "start": 1442.0, "end": 1446.0, "text": "Der Chat ist heute cute, cute."}, {"id": 315, "start": 1447.0, "end": 1448.0, "text": "Cute, cute-Chat."}, {"id": 316, "start": 1453.0, "end": 1455.0, "text": "Du brauchst dafür Items, in die du diese Fossil einsetzt,"}, {"id": 317, "start": 1456.0, "end": 1458.0, "text": "dann kannst du das Item auf ein Item..."}, {"id": 318, "start": 1459.0, "end": 1462.0, "text": "Aber man braucht diesen komischen Crafting-Simulator dafür, oder?"}, {"id": 319, "start": 1463.0, "end": 1465.0, "text": "Weil ansonsten haben wir da keine Ahnung, was da am Ende rauskommt."}, {"id": 320, "start": 1465.0, "end": 1471.0, "text": "Äh, wir müssen übrigens hier noch den Tentacle-Encounter machen."}, {"id": 321, "start": 1479.0, "end": 1482.0, "text": "Und hier habe ich auch noch keinen richtigen Plan, wie man das am besten macht."}, {"id": 322, "start": 1483.0, "end": 1484.0, "text": "Aktuell mache ich es einfach so."}, {"id": 323, "start": 1485.0, "end": 1488.0, "text": "Ich nehme dieses Blitz-Ding und upgrade das und dann mache ich sonst nichts mehr."}, {"id": 324, "start": 1489.0, "end": 1490.0, "text": "Dann mache ich es auch ein bisschen slow."}, {"id": 325, "start": 1491.0, "end": 1493.0, "text": "Aber das ist wahrscheinlich voll Noob-Style, wie ich das mache."}, {"id": 326, "start": 1493.0, "end": 1496.0, "text": "Das ist so ein bisschen diesen Tower-Defense-Mode."}, {"id": 327, "start": 1498.0, "end": 1500.0, "text": "Was für mein Build gerade weniger ein Problem ist,"}, {"id": 328, "start": 1501.0, "end": 1503.0, "text": "weil halt meine Minions-OP sind und alles wegbashing."}, {"id": 329, "start": 1504.0, "end": 1507.0, "text": "Ich muss im Prinzip, ich kann es hier face-rollen."}, {"id": 330, "start": 1508.0, "end": 1510.0, "text": "Hände weg vom Keyboard, easy-Mode."}, {"id": 331, "start": 1512.0, "end": 1514.0, "text": "Also viel muss ich da ja nicht machen."}, {"id": 332, "start": 1517.0, "end": 1520.0, "text": "Aber später weiß ich, wird es ein bisschen komplizierter."}, {"id": 333, "start": 1520.0, "end": 1524.0, "text": "Da habe ich schon gesehen, es gibt ja auch komplette Maps,"}, {"id": 334, "start": 1525.0, "end": 1528.0, "text": "die nur diesen Tower-Defense-Monster-Bash-Modus haben."}, {"id": 335, "start": 1530.0, "end": 1533.0, "text": "Und da kommen dann 30 Milliarden Gegner."}, {"id": 336, "start": 1541.0, "end": 1543.0, "text": "So, erstmal mehr Monster beschweren, easy."}, {"id": 337, "start": 1544.0, "end": 1546.0, "text": "Übrigens, wenn ihr nicht seht, was hier passiert, das ist normal."}, {"id": 338, "start": 1547.0, "end": 1548.0, "text": "Ich sehe das auch nicht."}, {"id": 339, "start": 1548.0, "end": 1552.0, "text": "Ich mache einfach Hände hoch, easy-Mode, Summoner-Build."}, {"id": 340, "start": 1555.0, "end": 1557.0, "text": "So, wenn man dann zumindest alle Monster gebashed hat,"}, {"id": 341, "start": 1558.0, "end": 1561.0, "text": "die aus den Portalen rauskommen, dann kriegt man, wenn man Glück hat,"}, {"id": 342, "start": 1562.0, "end": 1564.0, "text": "ultra-nices Loot."}, {"id": 343, "start": 1565.0, "end": 1567.0, "text": "Da ist jetzt nicht so viel tolles Zeug dabei gewesen gerade."}, {"id": 344, "start": 1567.0, "end": 1575.0, "text": "Aber wir haben ja noch ein paar Kisten zum Aufmachen."}, {"id": 345, "start": 1579.0, "end": 1582.0, "text": "Mehr Cards. Die verkaufen sich teilweise auch für richtig viel Kohle."}, {"id": 346, "start": 1590.0, "end": 1592.0, "text": "Die meisten Unix sind nichts wert."}, {"id": 347, "start": 1592.0, "end": 1596.0, "text": "Was? Eis, Feuer, Feuer, Eis, Erde, Plitzminen, jetzt halten die Mobs auf."}, {"id": 348, "start": 1597.0, "end": 1599.0, "text": "Aha. Okay."}, {"id": 349, "start": 1600.0, "end": 1601.0, "text": "Was haben wir denn da?"}, {"id": 350, "start": 1602.0, "end": 1604.0, "text": "Übrigens, ich habe noch was Schönes."}, {"id": 351, "start": 1605.0, "end": 1608.0, "text": "Wenn ich jetzt Steuerung C drücke, ich habe ja schon wie die Pros,"}, {"id": 352, "start": 1609.0, "end": 1611.0, "text": "ich bin zwar noch kein Pro in dem Game, aber ich habe schon die Tools wie die Pros am Start,"}, {"id": 353, "start": 1612.0, "end": 1615.0, "text": "erstmal abrufen, was das Item wert ist und feststellen, das ist ein absolutes Crap-Unique,"}, {"id": 354, "start": 1616.0, "end": 1619.0, "text": "was man eigentlich auch gleich an den Hersteller, äh, zurückschicken könnte."}, {"id": 355, "start": 1619.0, "end": 1622.0, "text": "Also direkt an den Händler raushauen könnte."}, {"id": 356, "start": 1623.0, "end": 1628.0, "text": "Erstmal gleich, erstmal gleich hier online Wert checken des Items."}, {"id": 357, "start": 1629.0, "end": 1632.0, "text": "Chaos Orb, lohnt fast schon gar nicht."}, {"id": 358, "start": 1633.0, "end": 1635.0, "text": "So, raus, next."}, {"id": 359, "start": 1636.0, "end": 1638.0, "text": "Refund."}, {"id": 360, "start": 1639.0, "end": 1641.0, "text": "Und eins habe ich mir auch von den Pros auf Twitch abgeguckt,"}, {"id": 361, "start": 1642.0, "end": 1646.0, "text": "man braucht Dump-Taps, also sprich, dass man nicht nach jeder Runde"}, {"id": 362, "start": 1646.0, "end": 1651.0, "text": "sein Kram hier durchsortieren muss, macht man sich einfach ein paar Dump-Taps im Stash"}, {"id": 363, "start": 1652.0, "end": 1656.0, "text": "und dumpt den ganzen Crap dann da rein, außer das, was man behalten will für die nächste Runde"}, {"id": 364, "start": 1657.0, "end": 1660.0, "text": "und macht dann gleich weiter."}, {"id": 365, "start": 1661.0, "end": 1664.0, "text": "Oh, Sana ist der Meinung, wir haben eine Mission."}, {"id": 366, "start": 1665.0, "end": 1669.0, "text": "Oh nee, Story-Mission, der Crap braucht schon Story-Mission."}, {"id": 367, "start": 1670.0, "end": 1672.0, "text": "Und next."}, {"id": 368, "start": 1672.0, "end": 1675.0, "text": "Machen wir mal ein bisschen was schwereres."}, {"id": 369, "start": 1676.0, "end": 1680.0, "text": "Machen wir mal eine Tier-14-Map, ist das Reflect oder sowas?"}, {"id": 370, "start": 1681.0, "end": 1684.0, "text": "Players cannot regenerate life, mana or energy shield."}, {"id": 371, "start": 1689.0, "end": 1691.0, "text": "Das kann ein bisschen schwierig werden."}, {"id": 372, "start": 1692.0, "end": 1694.0, "text": "Ups."}, {"id": 373, "start": 1694.0, "end": 1701.0, "text": "Watch-Stones, ach stimmt, genau, das vergesse ich auch immer, Leute, das vergesse ich auch immer."}, {"id": 374, "start": 1702.0, "end": 1706.0, "text": "Hier hat man so eine Übersichtskarte, quasi welche der Minimissionen man schon durch hat"}, {"id": 375, "start": 1707.0, "end": 1713.0, "text": "und normalerweise sollte man gucken, dass wenn man sagt, okay, wir machen jetzt keine Ahnung,"}, {"id": 376, "start": 1714.0, "end": 1719.0, "text": "wir machen jetzt irgendwie, weiß ich, die Map, kann man G drücken, sich das highlighten lassen, wo das ist"}, {"id": 377, "start": 1719.0, "end": 1725.0, "text": "und sieht das dann hier, aber hier, und man kann quasi in diese, was ist das hier?"}, {"id": 378, "start": 1726.0, "end": 1732.0, "text": "Zitadels, Zitadellen, auch immer das auf Deutsch heißt, kann man nach und nach Steine anlocken"}, {"id": 379, "start": 1733.0, "end": 1739.0, "text": "und die sind dann quasi für das jeweilige Gebiet zuständig, wo diese Missionen drinne stattfinden"}, {"id": 380, "start": 1739.0, "end": 1748.0, "text": "und darauf wiederum kann man dann noch Items anwenden, die die Drops verbessern."}, {"id": 381, "start": 1749.0, "end": 1753.0, "text": "Was die Wisdom und Portal Scrolls, kannst du raus machen aus dem Filter."}, {"id": 382, "start": 1754.0, "end": 1757.0, "text": "Orb, off chance kannst du eins... Aha."}, {"id": 383, "start": 1758.0, "end": 1761.0, "text": "Okay, gut. Gut zu wissen."}, {"id": 384, "start": 1761.0, "end": 1768.0, "text": "Ich meine, ich schraube jetzt nicht am Blutfilter rum, aber das ist auf jeden Fall gut zu wissen."}, {"id": 385, "start": 1773.0, "end": 1776.0, "text": "Also, die Unübersichtlichkeit wurde nicht gespart."}, {"id": 386, "start": 1777.0, "end": 1784.0, "text": "Ich finde, die meisten Sachen sind schon, wenn man verstanden hat, dass sie da sind,"}, {"id": 387, "start": 1784.0, "end": 1790.0, "text": "sind eigentlich schon ganz innovativ, intuitiv zu benutzen."}, {"id": 388, "start": 1791.0, "end": 1794.0, "text": "Also, das Trade System ist gut, wenn man es kapiert hat, dass man beispielsweise"}, {"id": 389, "start": 1795.0, "end": 1798.0, "text": "seine Stashtaps freischalten kann und sowas. Alles kein Ding."}, {"id": 390, "start": 1799.0, "end": 1806.0, "text": "Das Game ist halt mehrere Simulationen in einem, ja?"}, {"id": 391, "start": 1807.0, "end": 1810.0, "text": "Von Wirtschaftssimulationen bis Crafting, random, alles."}, {"id": 392, "start": 1810.0, "end": 1814.0, "text": "Es ist halt ultra komplex, was alles drinne steckt."}, {"id": 393, "start": 1815.0, "end": 1821.0, "text": "Alternativ, spielt man einfach ein Kack-Noop-Bild wie ich"}, {"id": 394, "start": 1822.0, "end": 1825.0, "text": "und macht jetzt hier Hände hoch, Noop-Modus"}, {"id": 395, "start": 1826.0, "end": 1831.0, "text": "und dann geht man wieder dahin und stellt fest, aha, alle Mops tun, weil das Bild zu OP ist."}, {"id": 396, "start": 1832.0, "end": 1835.0, "text": "Ich kann euch gleich mal mal ein Gear zeigen."}, {"id": 397, "start": 1836.0, "end": 1838.0, "text": "Das ist wirklich nichts Teures."}, {"id": 398, "start": 1838.0, "end": 1843.0, "text": "Ich meine, ich habe auf dem Charakter, was habe ich denn hier, Played, einen Tag zwölf Stunden."}, {"id": 399, "start": 1844.0, "end": 1847.0, "text": "Das ist, denke ich mal nicht sonderlich viel."}, {"id": 400, "start": 1848.0, "end": 1852.0, "text": "Andere haben da wahrscheinlich mindestens eine Woche oder so."}, {"id": 401, "start": 1855.0, "end": 1860.0, "text": "Aber wie gesagt, ich hatte davor noch einen anderen Charakter, aber den habe ich auch nicht so viel länger gespielt."}, {"id": 402, "start": 1860.0, "end": 1877.76, "text": "Quiien?"}, {"id": 403, "start": 1869.76, "end": 1874.0, "text": "Ich meine, die platzen einfach ward, Nearculo. Dieyskiilette Aw wayso krass."}, {"id": 404, "start": 1874.0, "end": 1883.08, "text": "Lohnt sich das eigentlich noch die restliche Map zu machen oder lohnt sich das immer nur"}, {"id": 405, "start": 1883.08, "end": 1884.08, "text": "bis zum Boss zu gehen?"}, {"id": 406, "start": 1884.08, "end": 1897.0, "text": "Aber ich hab dich nur aus dem Augenblick gesehen."}, {"id": 407, "start": 1897.0, "end": 1898.0, "text": "Was stimmt da nicht?"}, {"id": 408, "start": 1898.0, "end": 1899.0, "text": "Was hab ich falsch gemacht?"}, {"id": 409, "start": 1899.0, "end": 1900.0, "text": "Oh nice."}, {"id": 410, "start": 1900.0, "end": 1907.88, "text": "Jetzt gibt's Clusterfuck Leute, sag ich euch."}, {"id": 411, "start": 1907.88, "end": 1908.88, "text": "Oh was war das?"}, {"id": 412, "start": 1908.88, "end": 1922.72, "text": "Ah ne 14er, aber jetzt gibt's Clusterfuck Leute, Achtung, Epilepsie Warnung, Epilepsie"}, {"id": 413, "start": 1922.72, "end": 1923.72, "text": "Warnung."}, {"id": 414, "start": 1923.72, "end": 1930.76, "text": "Oh mega Lull."}, {"id": 415, "start": 1930.76, "end": 1951.46, "text": "Oh ich bin gleich tot, wenn ich nicht auflasse."}, {"id": 416, "start": 1951.46, "end": 1959.84, "text": "Okay Leute, habt ihr alle verstanden was passiert ist?"}, {"id": 417, "start": 1959.84, "end": 1964.24, "text": "Ich hab's dir schon angekündigt."}, {"id": 418, "start": 1964.24, "end": 1970.92, "text": "Es gibt manchmal so Art Rifts, wo dann 30 Milliarden Mops rauskommen und dadurch, dass"}, {"id": 419, "start": 1970.92, "end": 1976.28, "text": "ich so ne Noob Summoner build hab, das einzige was ich machen muss ist einfach Skelette spawnen"}, {"id": 420, "start": 1976.28, "end": 1981.04, "text": "und im Kreis rennen und nichts machen und die killen das alles für mich."}, {"id": 421, "start": 1981.04, "end": 1982.04, "text": "Okay."}, {"id": 422, "start": 1982.04, "end": 1983.04, "text": "Ach da unten."}, {"id": 423, "start": 1983.04, "end": 1984.04, "text": "Hä?"}, {"id": 424, "start": 1984.04, "end": 1985.04, "text": "Moment."}, {"id": 425, "start": 1985.04, "end": 1989.44, "text": "Was ist mein Lootfilter der Meinung, soll ich hier aufheben?"}, {"id": 426, "start": 1989.44, "end": 2000.44, "text": "Blink blink, alles tot, ach da unten, hab ich gar nicht gesehen eben."}, {"id": 427, "start": 2000.44, "end": 2006.72, "text": "Ja, ähm wie gesagt lohnt sich das die Map quasi immer noch mal komplett fertig zu"}, {"id": 428, "start": 2006.72, "end": 2007.72, "text": "machen?"}, {"id": 429, "start": 2007.72, "end": 2010.16, "text": "Ja klar, kann man zu zweit spielen."}, {"id": 430, "start": 2010.16, "end": 2014.88, "text": "Ich glaub bis zu 4 Leute in der Party, bin ich mir nicht sicher."}, {"id": 431, "start": 2014.88, "end": 2019.32, "text": "Es gibt so ein paar Leute die übertreiben es voll und machen Koop Builds, quasi mit"}, {"id": 432, "start": 2019.32, "end": 2020.32, "text": "Buffbots und sowas."}, {"id": 433, "start": 2020.32, "end": 2028.92, "text": "Ähm lohnt sich das die Map fertig abzukrasen, wenn man den Bosszugang schon gefunden hat"}, {"id": 434, "start": 2028.92, "end": 2032.88, "text": "oder geht man einfach nur rein, Bossbashing gut ist."}, {"id": 435, "start": 2032.88, "end": 2039.16, "text": "Oh Hände hoch, oh okay doch nicht Hände hoch, ist okay, nichts gesagt."}, {"id": 436, "start": 2039.16, "end": 2048.36, "text": "Oh da ist was rotes getroppt oben, easy, easy win, easy kill."}, {"id": 437, "start": 2048.36, "end": 2057.6, "text": "So und das ist jetzt hier neue Mechanik in der aktuellen League, ähm die Monster troppen"}, {"id": 438, "start": 2057.6, "end": 2063.24, "text": "random irgendwelche Organe und die kann man dann hier einsetzen und je nachdem was die"}, {"id": 439, "start": 2063.24, "end": 2067.36, "text": "Monster für Innereien getroppt haben, kann man daraus ein neues Boss Monster zusammen"}, {"id": 440, "start": 2067.36, "end": 2073.2, "text": "basteln, was dann spezielle Eigenschaften hat und besondere Sachen troppt."}, {"id": 441, "start": 2073.2, "end": 2078.6, "text": "Das Problem ist nur, die Dinger sind teilweise übelst brutal, die one shotten einen auch"}, {"id": 442, "start": 2078.6, "end": 2079.6, "text": "mal ganz gerne."}, {"id": 443, "start": 2079.6, "end": 2082.96, "text": "Also das heißt jetzt muss man erstmal gucken was man haben will, wir wollen auf jeden Fall"}, {"id": 444, "start": 2082.96, "end": 2087.04, "text": "extra Currency immer, mehr Essences, die lassen sich ganz gut verkaufen im Zweifelsfall."}, {"id": 445, "start": 2087.04, "end": 2104.32, "text": "So und jetzt hoffen wir dass der uns nicht one shottet, ach ne da geht, der ist nicht"}, {"id": 446, "start": 2104.32, "end": 2105.32, "text": "so wild."}, {"id": 447, "start": 2105.32, "end": 2131.16, "text": "So und Leute deswegen, das ist der Grund warum ihr ne Lootfilter braucht, weil wenn ich"}, {"id": 448, "start": 2131.16, "end": 2139.16, "text": "jetzt mal all drücke, ohne Lootfilter hätte er das hier alles angezeigt und mit Lootfilter"}, {"id": 449, "start": 2139.16, "end": 2153.72, "text": "ist auch schon recht viel, aber dann blickst du gar nicht mehr durch."}, {"id": 450, "start": 2153.72, "end": 2174.4, "text": "Also ich glaube wenn 6 Leute oder 4 Leute in der Party, 6 Leute, das geht, das rechner"}, {"id": 451, "start": 2174.4, "end": 2186.72, "text": "Kackt einfach nur ab."}, {"id": 452, "start": 2186.72, "end": 2189.4, "text": "Ja um auch wieder auf die ursprüngliche Frage zurück zu kommen, die ich ganz am Anfang"}, {"id": 453, "start": 2189.4, "end": 2196.24, "text": "gestellt hab, hat irgendjemand nen guten Tipp für nen Micro SD Karten Case, so irgendwas"}, {"id": 454, "start": 2196.24, "end": 2205.08, "text": "wo mehrere reinpassen, am besten wo 24 reinpassen, alles alles Müll, müsste es doch geben,"}, {"id": 455, "start": 2205.08, "end": 2212.52, "text": "ich mein einfach so nen Koffer mit mehreren Seiten zum durch plättern, aber gibt es irgendwie"}, {"id": 456, "start": 2212.52, "end": 2213.52, "text": "nicht."}, {"id": 457, "start": 2213.52, "end": 2221.96, "text": "Mache mal wieder das Kirby Theme an, da haste recht, da wirds mal wieder Zeit, Kirby Gourmet"}, {"id": 458, "start": 2221.96, "end": 2242.16, "text": "Race, 10 Stunden, jawoll, endlich mal wieder gescheite Musik, sehr gut, so muss das sein,"}, {"id": 459, "start": 2242.16, "end": 2268.36, "text": "so mag ich das, ich fackel übrigens hier gerade mein ganzes Hotel quasi ab, so jetzt"}, {"id": 460, "start": 2268.36, "end": 2279.04, "text": "muss ich mal kurz gucken, ob ich irgendwas im Chat übersehen hab, Boss lohnts oft sogar"}, {"id": 461, "start": 2279.04, "end": 2283.68, "text": "eher nicht, wenn du den nicht direkt bursten kannst, weil du kaum Loot bekommst im Vergleich"}, {"id": 462, "start": 2283.68, "end": 2288.84, "text": "zu, ok, gut bei mir ist der Mob, der Boss meistens relativ schnell tot, einfach ein"}, {"id": 463, "start": 2288.84, "end": 2296.0, "text": "paar Skillette drauf und fertig, ja Maxi Villanos mit TF is going on, weiß ich auch nicht, aber"}, {"id": 464, "start": 2296.0, "end": 2302.96, "text": "die Mops fallen um und sie troppen Dinger, Discharge Build ist unübersichtlicher oder"}, {"id": 465, "start": 2302.96, "end": 2324.12, "text": "Flickerstrike, also ich weiß nicht, ich find das schon übertrieben unübersichtlich, meinst"}, {"id": 466, "start": 2324.12, "end": 2334.6, "text": "du sowas hier, Moment, das ist ja witzig, das ist ja lustig, dass du ausgerechnet das"}, {"id": 467, "start": 2334.6, "end": 2343.56, "text": "hier zeigst, weil das ist genau das, was es auch in China gibt, bloß dass es in China"}, {"id": 468, "start": 2343.56, "end": 2355.88, "text": "1,50€ kostet, guck mal, das ist genau das gleiche was es in China gibt, Moment, wo ist"}, {"id": 469, "start": 2355.88, "end": 2366.8, "text": "es denn jetzt, Micro SD, ich hatte vorhin genau das gleiche in China, hier, das ist genau"}, {"id": 470, "start": 2366.8, "end": 2378.92, "text": "das gleiche, nur aus China und da kostet es nur 1,21€, also 1,21€ versus 10€, aber"}, {"id": 471, "start": 2378.92, "end": 2385.92, "text": "wobei das nicht genau das ist was ich vorhin gefunden hab, hier, das hatte ich vorhin,"}, {"id": 472, "start": 2385.92, "end": 2392.52, "text": "also im Prinzip genau das gleiche Kram kostet 1,50€ zu 10€ hier, aber im Prinzip sowas,"}, {"id": 473, "start": 2392.52, "end": 2396.96, "text": "sowas in der Richtung suche ich, allerdings halt nicht für SD-Karten, sondern für Micro"}, {"id": 474, "start": 2396.96, "end": 2403.0, "text": "SD-Karten und es ist ja Platzverschwendung, wenn man hier eine Micro SD-Karte rein macht,"}, {"id": 475, "start": 2403.0, "end": 2414.92, "text": "was Buffering, oh nicht schon wieder, oh come on Unity Media, Unity Media was ist los, Moment"}, {"id": 476, "start": 2414.92, "end": 2427.0, "text": "Leute, Alter, nicht schon wieder, wollt ihr mich verarschen, das haben wir doch letztens"}, {"id": 477, "start": 2427.0, "end": 2438.04, "text": "erst, nicht zum Angebot, ihr kriegt jetzt von mir erstmal den Scheißhaufen wieder,"}, {"id": 478, "start": 2438.04, "end": 2443.2, "text": "heute ist eh eine massive Störung bei Vodafone, ich hab das Gefühl es ist immer eine massive"}, {"id": 479, "start": 2443.2, "end": 2453.72, "text": "Störung bei Unity Media und Vodafone ist das gleiche, ja die haben keinen Marcel Davis,"}, {"id": 480, "start": 2453.72, "end": 2458.48, "text": "die haben den Twittersupport, der sich Mühe gibt aber die halt auch für die Crap Technik"}, {"id": 481, "start": 2458.48, "end": 2474.08, "text": "ist, guckt euch das mal an, fuck, wobei es bringt nichts wenn ich das runter mache, ich"}, {"id": 482, "start": 2474.08, "end": 2484.52, "text": "mach mal einen Speedtest auf dem zweiten Monitor und guck mir das mal an, guck mal wie der"}, {"id": 483, "start": 2484.52, "end": 2490.08, "text": "Speedtest läuft, es kann sein das es jetzt ruckelt aber das liegt dann am Speedtest,"}, {"id": 484, "start": 2490.08, "end": 2498.92, "text": "oh ne der Speedtest geht gar nicht richtig, wenn der Speedtest schon nicht richtig funktioniert"}, {"id": 485, "start": 2498.92, "end": 2521.16, "text": "dann weißt du was los ist, na geil, schade um Unity Media, macht doch keinen Unterschied"}, {"id": 486, "start": 2521.16, "end": 2534.36, "text": "unterm Strich, wem das jetzt gehört, ich glaube nicht dass es einen großen Unterschied macht,"}, {"id": 487, "start": 2534.36, "end": 2538.88, "text": "außer dass das rot übelst aggressiv macht, also ich weiß immer noch, ihr fragt mich"}, {"id": 488, "start": 2538.88, "end": 2544.84, "text": "immer noch welche Firma auf die Idee kommt ihre Hauptfarbe rot zu machen, fällt mir bloß"}, {"id": 489, "start": 2544.84, "end": 2551.44, "text": "ein Operahein und Vodafone, okay haben die andere Sachen, das ist doch immer noch genau"}, {"id": 490, "start": 2551.44, "end": 2561.32, "text": "das gleiche, wie ich auch bei Unity Media hab, bloß dass sie hier den Quoten-Opa setzen"}, {"id": 491, "start": 2561.32, "end": 2569.08, "text": "haben, weil das gar kein Opa ist, da steht der Quoten-Boomer, der noch telefoniert, was"}, {"id": 492, "start": 2569.08, "end": 2573.68, "text": "geht mit dem eigentlich ab, der telefoniert, hat eine Fernbedienung in der Hand und hat"}, {"id": 493, "start": 2573.68, "end": 2581.08, "text": "ein Notebook auf dem Schoß, was macht der eigentlich alles parallel, außerdem wozu"}, {"id": 494, "start": 2581.08, "end": 2584.6, "text": "braucht er ein Telefon wenn er sein Notebook da am Start hat, er braucht auch kein Fernseher"}, {"id": 495, "start": 2584.6, "end": 2592.08, "text": "wenn er sein Notebook direkt, was auch immer, gehts eigentlich wieder, funktionierts wieder"}, {"id": 496, "start": 2592.08, "end": 2606.28, "text": "oder lagts noch, laggerino, okay scheint wieder zu funktionieren, ich mein vielleicht liegt"}, {"id": 497, "start": 2606.28, "end": 2619.28, "text": "es auch am Twitch Server, ja, Frankfurt, aber ich mein Frankfurt ist der beste Twitch Server"}, {"id": 498, "start": 2619.28, "end": 2640.88, "text": "überhaupt, alter was ist das hier, Unity Media, was soll denn der Scheiß, spacken er, kann"}, {"id": 499, "start": 2640.88, "end": 2662.76, "text": "ich nicht streben so, wie soll das funktionieren, wie soll das funktionieren, 107, 0, 0, Leute,"}, {"id": 500, "start": 2662.76, "end": 2676.64, "text": "ich glaube, ich werd mal eine Sache probieren, ich werd mal ausmachen und den Router mal"}, {"id": 501, "start": 2676.64, "end": 2680.36, "text": "neu starten, ich weiß, das ist ja bescheuert, ergibt keinen Sinn, aber mach ich mal unten"}, {"id": 502, "start": 2680.36, "end": 2683.76, "text": "einen anderen Server für Twitch auswählen, das heißt ich bin in 5 Minuten oder so wieder"}, {"id": 503, "start": 2683.76, "end": 2695.52, "text": "am Start und mal gucken, weil ich mein, so ist ja fürn Arsch, so bringts ja nix, bin"}, {"id": 504, "start": 2695.52, "end": 2715.92, "text": "gleich wieder am Start."}]}