{"text": "Was war denn das jetzt? Geht das wieder? Bin ich wieder am Start? Ich glaube, ich bin wieder am Start. Die Kirby-Musik war zu hart, äh. Aber laut Unity Media, also lautdings, 0 Frames Dropped. Äh, was heißt wieder da? Ja, ich wollte auch off, aber eben ist gerade das Stream abgekackt. Aber ich glaube, diesmal lag es echt nicht an Unity Media, sondern wirklich an Twitch. Weil er konnte sich auch nicht reconnecten gerade. Ich glaube, es war einfach kaputt. Ich glaube, es ist einfach kaputt gewesen gerade. Nun gut, ich weiß, es hat sich nicht wirklich gelohnt, dass der Stream jetzt wieder online gegangen ist, weil ich gehe jetzt wieder auf. Äh, mich höre ich vom Acker. Ich wollte euch eigentlich bloß noch mal Tschüss sagen, weil wäre jetzt blöd gewesen, einfach abzuhauen. Zumal es gerade Twitch den Stream verkackt hat. Also wir sehen uns dann die Tage. Und wer den Battlefield-Clip hat, Ausrufezeichen BattlePlays, kriegt ihr das Formular zum Einschicken. Und im nächsten Stream gucken wir dann auch mal, was es so alles schon gibt. Aktuell haben drei Leute was eingeschickt, zwei davon Legend-Clips. Äh, einer hat irgendwas getrollt, keine Ahnung, was auch immer. Also bis denn, wir sehen uns CU.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Was war denn das jetzt?"}, {"id": 2, "start": 8.0, "end": 9.0, "text": "Geht das wieder?"}, {"id": 3, "start": 11.0, "end": 13.0, "text": "Bin ich wieder am Start? Ich glaube, ich bin wieder am Start."}, {"id": 4, "start": 17.0, "end": 19.0, "text": "Die Kirby-Musik war zu hart, äh."}, {"id": 5, "start": 21.0, "end": 25.0, "text": "Aber laut Unity Media, also lautdings, 0 Frames Dropped."}, {"id": 6, "start": 27.0, "end": 28.0, "text": "Äh, was heißt wieder da?"}, {"id": 7, "start": 28.0, "end": 31.0, "text": "Ja, ich wollte auch off, aber eben ist gerade das Stream abgekackt."}, {"id": 8, "start": 32.0, "end": 36.0, "text": "Aber ich glaube, diesmal lag es echt nicht an Unity Media, sondern wirklich an Twitch."}, {"id": 9, "start": 39.0, "end": 41.0, "text": "Weil er konnte sich auch nicht reconnecten gerade."}, {"id": 10, "start": 42.0, "end": 44.0, "text": "Ich glaube, es war einfach kaputt."}, {"id": 11, "start": 46.0, "end": 48.0, "text": "Ich glaube, es ist einfach kaputt gewesen gerade."}, {"id": 12, "start": 48.0, "end": 58.0, "text": "Nun gut, ich weiß, es hat sich nicht wirklich gelohnt, dass der Stream jetzt wieder online gegangen ist, weil ich gehe jetzt wieder auf."}, {"id": 13, "start": 59.0, "end": 61.0, "text": "Äh, mich höre ich vom Acker."}, {"id": 14, "start": 62.0, "end": 66.0, "text": "Ich wollte euch eigentlich bloß noch mal Tschüss sagen, weil wäre jetzt blöd gewesen, einfach abzuhauen."}, {"id": 15, "start": 67.0, "end": 69.0, "text": "Zumal es gerade Twitch den Stream verkackt hat."}, {"id": 16, "start": 70.0, "end": 73.0, "text": "Also wir sehen uns dann die Tage."}, {"id": 17, "start": 73.0, "end": 80.0, "text": "Und wer den Battlefield-Clip hat, Ausrufezeichen BattlePlays, kriegt ihr das Formular zum Einschicken."}, {"id": 18, "start": 81.0, "end": 86.0, "text": "Und im nächsten Stream gucken wir dann auch mal, was es so alles schon gibt."}, {"id": 19, "start": 87.0, "end": 91.0, "text": "Aktuell haben drei Leute was eingeschickt, zwei davon Legend-Clips."}, {"id": 20, "start": 92.0, "end": 95.0, "text": "Äh, einer hat irgendwas getrollt, keine Ahnung, was auch immer."}, {"id": 21, "start": 95.0, "end": 102.0, "text": "Also bis denn, wir sehen uns CU."}]}