{"text": "Da ist er wieder, ich war jetzt nicht lange auf, ich weiß, oh wie sie groß sind im Outschloss. So, ich bin jetzt wieder auf, ich weiß, ich war jetzt nicht lange auf, ich weiß, oh wie sie groß sind im Outschloss. So, also das erste, ich muss erstmal warten, bis Twitch richtig am Start ist. Es gibt, wenn man nämlich auf GitHub sucht, es gibt 30 Millionen Corona-APs. Ja, ich bin schon wieder da, ich habe nämlich gedacht, ich meine heute ist Sonntag, da passiert allgemein nicht so viel. Wir können mal versuchen, eine schöne Corona-Übersicht bzw. Statistik mit Karte zu programmieren. 78%, du gehörst dazu, oder was? Der Eichler, dankeschön, sieben Monate, huge. Ja, ich hatte allerdings großartig zu tun, ich hatte jetzt die Auswahl, entweder wir programmieren was aktuelles mit aktuellem Bezug. Oder ich nehme das Battlefield-Video auf, auf was ich gerade nicht so in kreativer Stimmung bin. Oder aber, ich spiele Path of Exile. Und ich habe mir gedacht, komm wir können mal was halbwegs sinnvolles programmieren, was vielleicht irgendjemand noch was bringt. Das Problem ist nur bei der ganzen Geschichte, ich muss mal ein bisschen was trinken, sonst kriege ich irgendwann noch Kopfweh heute. Kopfweh, Ursache Nummer eins, zu wenig trinken, Battlefields sackt, das aktuelle Battlefields voll vernascht, spiele ich nicht. Also es gibt 30 Millionen Corona-Apis, ich habe schon ein paar durchgeguckt, die Sache ist bloß die, die nehmen mehr oder weniger, manches heißt doch einfach nur Corona. Das Problem ist, die nehmen alle mehr oder weniger die gleiche API. So, wenn man jetzt hier guckt, zum Beispiel bei dem hier, wenn man nach Germany sucht, dann sind das die Zahlen von gestern. Also sprich, die ziehen sich die Daten alle, ich habe mal nachgeguckt von wo die sich die Daten ziehen, die ziehen sich die Daten mehr oder weniger alle hiervon. So, und die updaten nicht so oft. Hat das RKI keine Zahlen für die, was ist denn das RKI? Ach, die meint es, das Robert-Koch-Institut, habe ich nicht gefunden, zumindest nichts, um was abzufragen. Die hatten auch den letzten Stand von 14, die Fallzahlen, die hatten auch 14. So, was ich allerdings gefunden habe, ne, wie ich hoffe, das ist alles nicht aktuell, also was ich gefunden habe, ist einmal die hier, ich habe aber keine Ahnung, wo die ihre Zahlen näher haben, wie verlässlich das Ganze ist. Wenn man jetzt zum Beispiel hier auf Germany geht, die aktualisieren halt mehrfach am Tag und ich habe das da noch gefunden und mich würde mal, ja, das Robert-Koch-Institut hat keine, zeig mir mal, doch kann ich, wenn du mir ne schöne Seite vom Robert-Koch-Institut zeigst, der die aktuellen Daten hat. Die hier und die hier, die haben das aktuelle. So, was ich halt nicht checke ist, vielleicht schreiben die auch einfach voneinander ab, wo ich keine Ahnung hab, wo haben die die Sachen her? Woher wissen die, dass in Hessen und in Bayern Fälle sind und woher wissen die schon, dass wir bei 5.426 sind und warum ist hier auf GitHub alles, was ich an Datenbanken finde, das ist Stand gestern, da sind wir bei 4.000 noch was. Ne, die haben keines, na doch, die haben schon Quellen dastehen, aber die bringen mir nix, weil die Quellen, die die angegeben haben, sich nicht decken mit dem, was die sich, also Leute, wenn ihr was habt, schickt mir ordentliche Links, ja. Also alle APs, die ich kenne, haben als letzte Zahlen für Deutschland 4.585. Ja genau, genau, die hab ich auch, die hab ich auch, aber die hier sind, die wissen angeblich schon mehr. Und ich frage mich, woher haben die erstens die Region, weil die findet man nirgendswo, in keinem AP, in keinem Bericht findet man für Deutschland Region, für die Amis gibt's Region, die haben welche, wir nicht. Ähm, also das, ich bin mal echt gespannt, ob das irgendjemand von euch was findet, ja, so, ähm, ja und dazu haben wir, dazu haben wir, wenn wir hier nach Quellen gucken, die haben das. Warte mal, ich muss mal kurz Skype zumachen, warum ist Skype überhaupt angegangen? Skype, geh weg, was will Skype denn jetzt? So, ich hab Skype mal installiert, so, wenn man sich hier die Quellen anguckt, die haben wir, das ist das hier und die sind von gestern, so, Robert Koch Institut auch von gestern. Einzige, was wir sonst noch haben könnten, wäre das da, das da und das da, so, die hier sind von 8 Uhr, aber was ist das für ein total beknacktes Format? Guck, und die sagen auch, wir haben nur 3795, wieder was ganz, wieder was ganz was anderes, äh, und das sind irgendwelche chinesischen Dinger, wo ich echt keinen Plassen Schimmer hab, was da, was da Sache ist, ja. Also, ich weiß echt nicht, wo die ihre Daten herkriegen, die zwei, echt kein Plan. Ich finde, ich finde diese Daten nicht, die die hier haben, bei der Morgenpost. Das heißt, wir werden mal als Grundlage, ich bin irgendwie ein bisschen heiser, komisch, hab ich auch mal in soviel geschwätzt, dann ist vielleicht keine gute Idee, dass ich jetzt streme. So, oje, ja Leute. Ja, hast du mal eine Seite von den Bundesländern, wo das drauf steht? Hessen, Corona. Der Corona-Ticker. Hallo Knierbier. Das Kultusministerium ist verantwortlich, hä? Hessen, Corona, Zahlen. Ich finde nichts. Ah, hier, guck mal. Ah, yes, excellent, excellent. Das war mal in Frankfurt, 21. So. Wir suchen mal nach, wie heißt das Zeug ja? Covid. Okay, danach muss man natürlich suchen. Jeder nennt es Corona, aber wir nennen es SARS-CoV-2. Man findet einfach nix. Und wenn man was findet, dann sind die Daten halt von gestern. Die sind von gestern. Und dann auch nur als nicht barrierefreie PDF-WTF. Geier, wie soll man das pasen? Wollen die mich veräppeln? Die Daten werden um 17 Uhr aktualisiert. Also was ich an merkwürdig finde, da sind die, ich frage mich echt, wo die das her haben. Deswegen werden wir das jetzt folgendermaßen machen. Habe ich mir schon überlegt. Wir programmieren jetzt mal was mit irgendwie, wir ziehen uns irgendwie, keine Ahnung, wir ziehen uns von hier. Wir ziehen uns einfach einmalig von hier den kompletten Dump und basteln das quasi so zurecht, dass wir daraus eine Karte generieren können. Aber wir greifen dann nicht direkt auf die API jedes Mal zu, sondern wir laden uns das einmal runter, speichern das in der SQLite-Datenbank und liefern den Kram aus. Und dann ist das nämlich abstrahiert von dem, wo ich die Daten herkriege. Das heißt, sollte ich nochmal eine ordentliche Quelle finden, die auch immer aktuell ist, dann kann ich das daher holen. Oder aber, ich bin ganz fies und webscrape hier die Seite irgendwie, die hier. Können wir ein Tor machen. Ist auch eine Möglichkeit. Aber keine schöne. Wir nehmen das jetzt einfach mal von hier. So, ich habe hier mal gerade mal mein ganzes Zeug aktualisiert. So, ich habe schon das Corona-Projekt angelegt. Wir gehen jetzt erstmal hier rein. Corona, was? Moment, wo ist es denn? Ach, in Test Stream ist es. Das ist da, wo wir gestern drin waren. Nee, nee, nee, nee. Okay, da will ich das nicht drin haben. Wobei, warum eigentlich nicht? Ich meine, wir machen es doch im Stream. Ist doch gut. Welche IDE? Das ist Rider. Es ist die einzige sinnvolle Cross-Platform.net-IDE, die es gibt. Der nimmt, was nimmt die Daten von? Okay, zeigt mal her. Deckt sich das? Deckt sich das? Deckt sich das? Hessen 203? Nö. Sag mal, die Daten sind ja komplett unterschiedlich. Alter Mono-Developer, hör mal auf. Ich meine, die sagen Hessen 203 und Hessen selbst sagt 282. Dafür haben die insgesamt halt schon die 5.426. Und die offiziellen Daten, die ich finde, die haben halt nur 4.000, noch was. Oh, jetzt wird sie holen. Jetzt kommt die Big-Brain-Diskussion im Chat, wie der Kram jetzt heißt. Also, was wir jetzt, wir abstrahieren das Ganze jetzt mal ein bisschen. Wir schnappen uns jetzt einfach mal diese API hier, laden alles runter, speichern es in der SQLite-Datenbank und bauen da ein paar Klassen drumherum, dass ich die Quelle austauschen kann, zu was ich will. So, der Wetter-Forkast, der kommt erstmal weg. Das ist so diese Standard-Beispiel-API, die immer dabei ist. Den benennen wir mal um in Corona-Controller. So, der ganze Schmodder hier kommt weg, den brauchen wir nicht, und das hier kommt auch weg. Wir haben ja noch keine Klassen, wir haben ja noch nichts drinne. So, das heißt, als erstes legen wir jetzt mal einen Ordner an, für unsere Datenbank. Oh, die Kirby-Musik. SQLite-Datenbank, ja, wenn schon, wir machen ein MongoDB-Cluster. Azure, Azure MongoDB-Cluster. Ich meine, so eine SQLite-Datenbank, die ist ja wahrscheinlich mit 5.000 Datensätzen heillos, heillos, da braucht man MongoDB-Cluster, stretched über drei Kontinente. Mindestens. So, als erstes fügen wir mal SQLite hinzu. Hallo, kannst du mal suchen? SQLite, EF Core, EF Core SQLite, da ist es. Poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch. So, da legen wir jetzt was an, und zwar ein AppDB-Context. DB-Context, oh, da kam es noch nicht installiert. DB. DB-Context, ah, yes, excellent. So, bevor wir hier weiter machen, wir gucken jetzt erstmal, wie wir die Daten hier abgefragt kriegen. Also Corona, Tracker, RP, wir machen das jetzt ganz ganz Noob-Style-mäßig, wir importieren einfach alles mal in unsere SQLite-Datenbank und dann speichern wir die einfach und importieren nicht mehr. Und dann haben wir die Sachen erstmal drin und danach kann ich gucken, wie ich den Kram aktualisiere, Hauptsache wir haben erstmal ein paar Daten drinne. Also, HTTPS-Redirection wollen wir nicht, Autorisierung, wer braucht Autorisierung, das ist ja komplett overrated, so Services, AddDB-Kontext, ne das machen wir noch nicht, das machen wir noch. Erstmal hier abfragen, so wir laden uns jetzt erstmal den Kram von dieser Seite runter. AddTTP, client, get, string, async, alles was wir haben, bam. Ahja, was auch ganz praktisch ist, man kann jetzt hier nach, ups, vielleicht soll ich mal in den richtigen Ort lang gehen, stream, Corona, da ist ja unser Projekt drinne, man kann jetzt hier drinne sagen,.net, watch, run und was der jetzt macht ist, das ist sehr praktisch, das ist sehr praktisch, wenn ich jetzt hier nehm ich was drinne ändere, sagen wir mal ich, ich geb jetzt mal aus, ich geb jetzt mal aus, was wir hier von der API abrufen, ah, ups und ich drück jetzt speichern, dann aktualisiert sich das selbst und startet sich neu und gibt den Kram aus, das ist praktisch, ich find das viel praktischer, wie jedes mal hier auf run zu drücken oder Steuerung F5 zu drücken, einfach speichern drücken und es startet sich neu und man muss auch nichts machen, das ist viel, dass der startet den kompletten.net Server neu und das macht man einfach doppelt, unten macht man einen watch auf die client Anwendung, dass er das ganze JavaScript Zeug neu baut und oben macht man es einfach auf den.net Server und dann aktualisiert sich der Kram immer und man muss nicht laufend auf irgendwas draufklicken, das ist viel einfacher. So, also wir rufen jetzt hier von der API das ganze Corona Zeug ab, Jason Convert, ich weiß, dass man eigentlich mit dem neuen ASP.NET Core, also eine Karte wo der Corona Verlauf eingezeichnet ist, also was mir vorschwebt ist folgendes, was mir vorschwebt ist folgendes, die haben doch eine Demo, sowas schwebt mir vor, aber halt im weltweiten Stil ja, sowas, sowas schwebt mir hier vor, Heatmap, genau, so und dann das dann im Endeffekt was sollte rauskommen am Ende, dass USA recht verteilt ist und nicht so viel, Europa hat halt hier einen roten Flag, Skandinavien ein bisschen und China und vor allem Italien hat einen ganz, ganz ultra roten Flag, sowas in der Richtung, wenn nicht das bei der Karte gerne rauskommt, und bei der Statistik, bei der Statistik machen wir hier sowas in der Richtung, so irgendwie so ein Graf, sowas hier, mit Apex Charts, das ist relativ simpel, aber erstmal müssen wir, high IQ ja, aber erstmal müssen wir den Graf abfragen und in unsere Datenbank schreiben, damit wir die ganzen Corona Daten bei uns auch lokal haben, die Erde ist doch keine Kugel, na das erkennt man ja schon hier dran, warte mal, wo habe ich jetzt zugemacht, man erkennt ja schon hier dran, dass die Erde in Wirklichkeit eine unendliche, eine, what, das ist kaputt, ok, Moment, erstmal gucken, Demo, man erkennt ja allein schon hier dran, dass die Welt eine unendliche Ebene ist, ja, wenn das Javascript sagt, dann hat, und Javascript hat eigentlich immer recht, also sprich, die Erde ist weder rund noch ist die Erde flach, die Erde ist in Wirklichkeit 2D, wie man hier sieht, und 2D, was man unendlich scrollen kann, hier habt ihr es zuerst erfahren, die Erde ist ein Sidescroller, genau, und das Interessante ist, dass das quasi, was man sich jetzt fragen kann, sind das vielleicht sogar mehrere Welten, weil man sieht hier die Heatmap, die Heatmap ist nur hier auf der Welt, und da ist die gleiche Welt, aber die hat keine Heatmap, das heißt ja auch, das hier muss, das muss eine andere Welt sein, parallel Welt muss das hier sein, das ist keine Disney-Musik, das ist Kirby-Musik, ihr seht hier, hier hat Neuseeland, hier hat Neuseeland einen Punkt, und hier hat Neuseeland keinen Punkt, das ist echt, wo ist mein Illuminati-Symbol? Ey, wenn ich in dem Tempo weiter mache, dann kriegen wir heute nichts geschissen, aber das sind wir ja schon gewöhnt. So, jetzt gucken wir mal, dass wir den Kram irgendwie rausgepasst kriegen, so, gucken wir mal, ob da jetzt was rauskommt, jetzt müssten wir eigentlich zumindest das Zeug halbwegs ordentlich als Jason gepasst zurück kriegen, gucken wir mal, da war, da, das sieht aber nicht ordentlich Jason gepasst aus, wenn ich ehrlich bin, aber doch, vielleicht schon, wie sieht denn das hier aus, was wir da überhaupt zurückkriegen? Ja, erstmal den ganzen anderen Shit zumachen, was kriegen wir da, Confirmed, Confirmed, ok, gucken wir mal, ob wir da Confirmed noch kriegen, Confirmed, warum printet er das denn so beknackt, warum printet er das denn nicht schön, warum printet er das nicht schön, das finde ich nicht gut von dem, achso, ah, ich gebe es doppelt aus, deswegen, null, ah, yes, jetzt ist gut, so ist es doch viel besser, null, mal nicht aufpassen, so, als erstes müssen wir mal, ok, also jetzt haben wir den Kram hier raus, vielleicht sollten wir erst mal eine Klasse für das ganze Corona Zeug anlegen, also machen wir hier noch einen neuen Ordner, Models, und da gibt es eine neue Klasse, die nennen wir, wie nennen wir da den Kram überhaupt, wow, geh fort, wie nennt man den Kram hier denn, ok, also die Statistik nach bestätigt, toden, latest und recovered juckt mich nicht, mich interessiert erstmal nur Confirmed, sprich einfach nur die neuen Fallzahlen, den Rest können wir, wenn wir das haben, können wir den Kram danach abfragen, so, und was mich hiervon interessiert ist ja auch weder latest noch sonst was, sondern die Locations interessieren mich, so, und in den Locations steht dann sowas drin, die, keine Ahnung, Thailand, Koordinaten sind dabei, das ist sehr gut, dass Koordinaten dabei sind, weil ich brauch Koordinaten für die Map, und ne History, das ist doch eigentlich alles, was ich brauche, so, das heißt, dann machen wir mal ne Klasse, die dann, die heißt jetzt Corona Location, so, und die hat ne, die hat ne Name, oder soll ich Corona Location, ich kanns auch Corona, Corona, ja ich nenns Location, eigentlich ist Country, Country besser, ja, weil das geht ja letztendlich, gehts ja um, die erste Kompetenz mal, Corona Country, hört sich an wie irgendwie Volksmusik oder so, Name hat das Ding, den Country Code, den braucht man vielleicht, wenn man mal ne andere API verwendet, schon, muss man mal gucken, Latest ist glaube ich gar nicht so schlecht, Latest zu haben, sind dann die Koordinaten, ja, das ist, also ich würde, wir können ja mal gucken, was für ne Koordinate in Deutschland drinne steht, Germany, 51.9, das ist irgendwo in der Mitte, also sprich, das sind keine Koordinaten für extra Fälle drin, da such ich ja immer noch ne API, wie ich da draufkomme, also wer die Daten dazu hat, ich hab bis jetzt noch nix gefunden, so, also, Koordinaten haben wir hier, das heißt, wir haben Corona Country als Klasse, Latest, das können wir mal reinmachen, die Fallzahlen gehen ja nur hoch, also können wir das als Unsigned Int machen, und dann nennen wir das hier Current oder so, dann brauchen wir auch die Koordinaten, die Kapseln wir aber nicht in extra Koordinaten, Objekt vorzu, sondern wir machen einfach hier ein Double, also das hier, Breitengrad, und dann gibt es ne History, in der History steht drinne Datum und jeweils Infizierte, ok, das heißt, wir brauchen nochmal ne extra Spezialklasse dafür, die nennen wir irgendwie, keine Ahnung, wie nennen wir das Ding, Corona Date, aber ich bin beim benennen, Timeline, ja Timeline finde ich, also, ne, History ist schon gut, aber wie nenne ich denn den Typ, ist, History ist ok, ja, wir können es auch Timeline nennen, aber ich finde History ist eigentlich ok, dann nennen wir das, History, das ist, wenn einem nix einfällt, dann nennt man die Dinger so, das geht immer, History Entry, das ist also schön nichtsagend, aber hilft einem, wenn einem nix einfällt, so, das heißt, wir haben jetzt ne Collection von History Entries in der Corona History, klingt schon wieder huge brainig, ja, so, und da ist dann der Verlauf drinne, wir können es auch, da ist dann der Verlauf drinne, ja, kann ich auch machen, aber ne eigene Klasse ist wahrscheinlich beim Serialisieren und Deserialisieren besser, weil ich muss ja am Ende des Chasen Zeug dann zu meinem Client wieder schicken, so, und so ein History hat im Prinzip nix anderes als ein Date und ein Counter oder sowas, Counter, so, so, gut, mehr brauchen wir jetzt nicht, da können wir alles mit abbilden erstmal, nachdem wir das aber in die Datenbank schreiben, brauchen wir auf jeden Fall ne ID, sonst meckert die Datenbank, dass wir keine eindeutigen IDs für unser Zeug vergeben können, gut, also wir fragen jetzt die Confirmed Corona Fälle ab und in den Confirmed Corona Fällen wollen wir, da machen wir jetzt ne Schleife drüber, das kann jetzt auch ruhig hässlich sein was wir da machen, weil wir brauchen das genau einmal, wir brauchen das einmal ums in die Datenbank zu importieren und danach nicht mehr, so, ok, das ist was ist das hier, das ist dann eine Location und wenn ich das ausgebe, sollte er mir jetzt mich zu-spammen mit dem ganzen Kram, genau, so, und in dieser Location drinnen sind dann wieder Country zum Beispiel, ok, das heißt jetzt sollte er mir nur die Länder ausgeben, die Zahlen ändern sich doch jeden Tag, ja, ja, das importiere ich dann einfach jeden Tag, aber jetzt zum Basteln ist, wat, aber jetzt zum Basteln ist wichtig, dass ich nicht bei jedem Mal neu starten die API von dem Typ hier abfragen muss, das ist ja, das findet er bestimmt auch nicht geil, also jetzt für Schmerzen, ach Moment, Locations brauche ich noch, null, ah, yes, so, jetzt haben wir die, oh, Kokona Land ist am Start, aber das hört ja gar nicht mehr auf, so viel US, Kokona, genau, so, also was hier war, Country ist das da, so, dann haben wir jetzt noch einen Country Code, das ist das hier, so, dann haben wir noch einen aktuellen Latest, Latest haben wir dann noch, und danach kommt eigentlich schon die History, hier was übersehen, ah, die Koordinaten brauchen wir noch, die Koordinaten brauchen wir noch, also, die Koordinaten brauchen wir noch, Co, Coor, was, Coordinates, stimmt das, ja, ah, der Längengrad, Breitengrad, ok, was schreibt denn das, ja, der, also, die Schreibweise vor Längengrad, Breitengrad ist immer ein bisschen unterschiedlich, Lat wird eigentlich immer Lat abkürzt, aber Long oder Lon, ähm, liegt denke ich daran, dass mittlerweile Lon fast schon bevorzugt wird, weil Long eben ein Datentyp ist und nicht in jeder Sprache funktioniert, wie viele Monitore, ich hab zwei Monitore, ich hab zwei Monitore, wenn ich was übersehe oder irgendwelche Subs übersehe, müsst ihr mich beanschreiten, weil ich konzentrieren muss, dann, ähm, ah, überseh ich das mal schnell, Talks to Warzone, ne, gut, so, jetzt haben wir eigentlich alle Informationen, die wir brauchen, außer die History vom jeweiligen Land, das kriegen wir auch relativ einfach hin, ähm, aber vorher sagen wir mal hier, ähm, Corona Location, äh, ne, wie hab ich's genannt, nicht Location, ich hab's wie genannt, äh, Corona Country, ok, so, so, und das Ding braucht eine ID, wie gesagt, Current, Current ist unser Latest, ähm, Breitengrad, Enggrad, Name ist der Name von dem Ding, Country Code is Code, so, ah, Quatsch, die Datentypen stehen mir hinten und vorne nicht, äh, Uint, ok, to Object, Uint, next, to Object Double, to Object, äh, Double, so, ist das ein Programm oder ne Seite, was, das hier, das ist ein Texteditor, also Texteditor, so, also jetzt legen wir uns den Kram an und jetzt müssen wir hier nur noch durch alle History Einträge durchgehen und davon einen Corona, wie hab ich genannt, einen History Entry, ein Corona History Entry erstellen, ne, ein bisschen, vielleicht sollten wir noch Factory einbauen, dass es mehr nach Java aussieht, ähm, ok, das heißt, also ein Programm, ah, yes, excellent, ähm, das heißt, wir müssen jetzt hier alles durchgehen, nochmal ne Schleife machen und zwar alles durchgehen, was hier in, in der History drin steht, History, also sprich das da, was wir hier zurück kriegen, History, alles was da drin steht, müssen wir nochmal ne Schleife drüber machen, so, jetzt lassen wir uns, wir lassen uns jetzt mal nur den Kram ausgeben, wir lassen uns nur hier mal, den, den, die Fallzahlen ausgeben, äh, wie macht man das jetzt überhaupt, value, ne, name, key, äh, Moment, true, oh fuck, wie komm ich da jetzt überhaupt ran, äh, äh, warum hatten das Ding kein key und value, wer hat nicht das wieder ausgedacht, so ein Alex, I'm back, sehr schön, zwei Monate, danke schön, Subscriber, Moment, wie krieg ich da jetzt den Kram raus, äh, to object, ja zu welchem object, kann man machen, kann man sowas machen, sowas, ne oder, das wird nicht funktionieren, ne, j-object, und dann, ne, what the fuck, ok, eh, value, value, ne, true, value, Gott ist das beknackt, Alter, ich struggle immer mit diesem komischen Jason Pasa darum, ich weiß, ich glaub ich weiß woran es liegt, man muss, ich erinnere mich da gerade dran, man muss hier irgendwie den Kram vorher umstellen, name, value, genau, soll jetzt funktionieren, jetzt passt auf, ah, was, was machen wir, ich mach, ich mach doch irgendwas verkehrt, ich mach irgendwas verkehrt gerade, das ist gar kein Fehler von da unten, what, das Raum ist kaputt, was, ich caste irgendwas verkehrt, irgendwas mach ich kaputt, what, hä, das ging doch eben noch, btf, das ist so kompliziert, das ist jetzt gar nicht, wow, what, ach, guck mal da, manchmal, aber den Kram nur sinnlos, nur sinnlos copy paste, dann kann das nicht funktionieren, quai, drei monat, dankeschön, huge, und der Pro Gaming Sebi ist auch am Start, so viele nice subs, gibt es eine Corona Rest, ja, sowas in der Richtung, da frag ich grad den ganzen Kram ab, aber es gibt keine richtig gute, ok, weiter, weiter, also, so, jetzt müssen wir den Kram rückgängig machen, so, mal gucken, ob es jetzt funktioniert, ah, jetzt klappt es, guckt, jetzt funktioniert es, so, das heißt jetzt haben wir die history, die Corona history, die kriegt jetzt neue Liste, und da schreiben wir jetzt den Kram rein, Corona history, history, add, ah, Quatsch, ah Gott, heißt drauf, Liste warum auch nicht, ah, add, Corona history, das heißt da kommt jetzt rein ein Corona history entry, und das besteht aus einem Counter, das ist value, also ne, was ist das da, also sprich der zweite Wert ist das, Tazer hat zwei Abos verschenkt, nice, dankeschön, huge, richtig, richtiger Sub, kein Primal, so, value, dann haben wir hier noch das aktuelle Datum, und das ist datetime, pass, und zwar e-name, und jetzt bin ich mal gespannt, ob der Kram funktioniert, den ich hier gebastelt hab, das müssen wir noch zu einem int-kasten, so, gucken, ob das funktioniert, mal gucken, ob es ohne Fehler durchläuft, wahrscheinlich schon, okay, das ist nice, gut, jetzt haben wir den ganzen Kram hier rausgepasst, jetzt können wir es eigentlich in der Datenbank speichern, das heißt wir sagen jetzt hier, service, add db-kontext, so, unsere db-kontext, eine Sache brauchen wir hier noch im db-kontext, eine Sache, die ich immer vergesse, und zwar deswegen guck ich die jetzt ab, weil ich die immer vergesse, muss ich mal kurz in mein GitLab gehen und schauen, weil ich mir das nie merken kann, und zwar muss der Kram so aussehen, kann ich mir nie merken, so, so ein paar Sachen, die ich mir nicht merken kann, hab ich mir mal irgendwo hin kopiert, dass ich mir irgendwann mal merken kann vielleicht, so, jetzt leg dann nämlich die Datenbank an, die den wahnsinnigen tollen Namen data.database hat, dass man sofort weiß, was drinnen ist, db-set aus corona country, countries, so, sehr schön, was meckert da hier, never instantiated, ich weiß, so, add db-kontext, gut, jetzt kann ich mir den hier injecten, den db-kontext, und kann den Kram, den wir von der API abrufen, speichern, vorher muss ich allerdings sagen, database, erstmal gucken, dass auf jeden Fall der Kram erstellt ist, und danach kann ich den Kram adden, quasi hier corona countries add, so, und jetzt schreibt er den Kram in die Datenbank, und hier speichere ich es, und jetzt sollte ich eine Datenbank haben, wo mein ganzes Corona Zeug drin steht, falls ich das mehrfach starten muss, sag ich jetzt erstmal hier, deleted, und danach wird er angelegt, schauen wir mal, ob das ganze jetzt funktioniert, ob es ohne Fehler durchläuft, anscheinend schon, der Tainser sagt, ich considere derzeit, ein sehr schöner Satz, von GitLab zu GitHub zu wechseln wegen den Actions, denkst du, das ist erst ein smart move, weil es gar nicht vielleicht schwer, dass migraten ist, alter was nen Satz, was nen Satz, oh der Hype Train war erfolgreich Leute, huge poggers, ja wenn du Actions brauchst, und die Actions lieber besser gefällt als das GitHub CI, warum nicht, ich mein, es ist ja nicht so schwierig, Git Projekte, du addest ein zweites Remote und pusht den Kram und fertig, also ist ja nicht so, als wäre GitHub, als wäre Git Projekte irgendwie schwierig, du kannst einfach beides Übergangsweise benutzen, du kannst ja mehrere Remotes hinzufügen in dein Repo, fügst du einfach noch dein GitHub, dein GitHub, nimm dein GitHub, Remote hinzu und gut ist, hab ich denn nen ordentlichen Datenbank Browser, um mal in die Datenbank rein zu gucken jetzt hier, DB, wie heißt der Kram, DB, was gibt's nen schönen, nen schönen SQLite Browser für Linux, was gibt's denn da, gibt's da was schönes, DB Visualizer, ach guck mal, es gibt ja sogar den offiziellen SQLite Browser, hab ich sogar installiert, konnte mich bloß noch mal dran erinnern, ok, Open, nach Stream, Corona, Corona, DB, guck mal, was da drinne ist, huge, alles drinne Leute, hat importiert, guck mal mal nach Deutschland, äh, ist irgendwie nicht so ganz, Germany 4585, ja das ist die aktuelle Version, die aktuelle Variante hier, die man aus den Daten kriegt, in Wirklichkeit sind sie wohl mehr, ne, das sieht jeder, ich glaub die ersten 25 Subs oder so haben sowas neben am Namen, das Sebaro hat das auch, es gibt noch ein paar, ich glaub der Zero des Max hat's auch, ein paar haben's, das stimmt, der Sebaro war der allererste Sub, ja, der Silent Pain, genau, der hab ich jetzt ganz vergessen, ich glaub 25 Leute haben das, gut, der Kram ist importiert, das hat funktioniert, das heißt, nachdem unsere Datenbank jetzt befüllt ist, können wir den ganzen Mist erstmal wieder auskommentieren, hat sich wahnsinnig gelohnt, dass wir den ganzen Kram programmiert haben, ähm, aber jetzt ist ja der Kram in der Datenbank drinnen und jetzt können wir gucken, dass wir das über unsere AP abgefragt kriegen, so, dann nehmen wir unseren Corona Controller, hat leider nicht den DB Tool integriert möglich, ne, hab ich aber ausgeschaltet, ähm, Corona Country liefern wir zurück eine Liste vor, und da brauch ich erstmal meinen Datenbank Kontext, dass das überhaupt funktioniert, so, Return, Countries, Bäm, gut, das ist nice, jetzt starten wir das, bzw. wir mussten es ja gar nicht starten, weil sich das automatisch startet, weil wir hier einen Watch haben, und jetzt fahren wir mal den Postman auf, oh, ich hab den Postman gar nicht installiert, Leute, was sollen wir installieren, Postman oder Postwoman, das ist jetzt kein Witz und auch kein Fremdschirmwitz, das gibt's wirklich, aber anscheinend gibt's da keine Pakete dafür, Postman, Postwoman, es gibt beides, es gibt beide Projekte, ja, ich weiß nicht warum, man sich da an dem Namen so gestört hat, achso, das eine ist rein Browser basiert, oder wie, das ist Postwoman, was halt mit einem Alien-Kopf dran ist, warum auch immer, aber dann installieren wir mal Postman, äh, Postman, Posthentai, das sind wir auch, das war, das war ja klar, so, oh nee, das ist nix für mich, Patrick, geh mal fort. So, es wäre jetzt natürlich sehr nice, wenn der Kram, Pearl, IGIT, wenn ich eine Sache noch weniger mag als Java, dann ist es Pearl, ich weiß aber, dass mein Paketmanager auf Pearl-Basis ist, Pearl, die einzige Write-Only-Programmiersprache, vielleicht nehmen wir Brainfuck, ich sag mal, was macht der denn da, installiert er jetzt das halbe Internet, oder was, was macht der da so lang, Arch, by the way, was zum Teufel macht der da, der macht nichts, der macht ein Package, er stript gerade, ja, exzellent Musik, ja, jetzt wird noch compressed, da wird kein Move, liegt bestimmt alles nur daran, dass es ein Pearl-Programm ist, wobei man ja gesehen hat, dass das überhaupt nicht das Programm selber macht, oh, jetzt wird gepackt, CPU, äh, CPU, wie viel, wie viel Kerne hat meine, ich hab vier Kerne der VM gegeben, kein Wunder, dass das so wahnsinnig schnell ist, das braucht mindestens zwölf Kerne, auch die Musik, ihh, die Musik hört sich aber jetzt kaputt an, ah, besser, yes, exzellent, drei Stunden Paket installieren, das kann Windows ja besser, ich hab wirklich keinen Plan, was er da gerade so lange macht, er packt, der packt das wahrscheinlich dreimal ein und aus, aber warum macht er das, man weiß es nicht, wahrscheinlich erstmal Virus installieren, the fuck, das kann man nicht mal richtig weitermachen, ah, jetzt ist er fertig, yes, 240 MB, das ist ja nix, Rootkit ist raus, Postman, da ist er, also, von der Idee her sollte ich jetzt, wenn ich eine Abfrage mache, gegen Localhost Port 5000, sollte ich auf Corona, sollte ich den Kamer als Antwort kriegen, da ist es, bam, das kommt jetzt lokal aus meiner Datenbank, das heißt ich muss nicht mehr diese komische API hier aufrufen, das ist natürlich praktisch, funktioniert, das heißt jetzt können wir uns unserem Frontend widmen, Dinge die beim ersten mal funktionieren geht nicht, naja, es hat ja nicht alles beim ersten mal funktioniert, gut, ach ja, ich hab grad was gesehen, was noch gefehlt hat, ist euch aufgefallen, ist euch aufgefallen was noch gefehlt hat, was fehlt hier noch, die History fehlt noch, ich brauch ja auch die History im Frontend dann, deswegen muss ich jetzt sagen noch, Include History und das geile ist, Leute, pass mal auf, das ist echt so eines der besten, so der besten.NET Core Tips ever, wenn ich jetzt Speichern drücke, dann startet er sich hier im Hintergrund neu und seht ihr, ich muss nix machen, ich klicke jetzt einfach nochmal auf Send, er hat sich im Hintergrund neu gestartet und jetzt ist alles dabei, einfach mal 100, wie viel, der Scroll Balken ist weg, Leute, ja, da ist er, der Scroll Balken, kommst du her, der Scroll Balken ist kaputt, guck mal, ich kann doch nicht mal runter scrollen, so viel Zeugs ist da drinnen, der Scroll Balken macht das nicht mit und von der Idee her würde ich den Kram ja auch nicht direkt auf der Startseite abrufen, ich bin ja gerade mit dem Kollegen dabei eine App zu basteln für einen Lokal, also keine App im eigentlichen Sinne, eine Website, die man aber auch ordentlich mobil verwenden kann für einen lokalen Heizungsinstallateur Service, weil aktuell machen die das so, die gehen in ihre, die haben irgendwie eine riesen Excel Tabelle, machen Termine mit den Leuten aus und machen so die Routenplanung von Hand und wir haben gesagt, wir können es einfach so machen, wir exportieren eure Kundendaten und ihr sagt, welche Kunden ihr besuchen müsst und das Ding berechnet euch eine, nicht für meinen Heizungstypen und das Ding berechnet euch einfach die optimale Reihenfolge, na optimal geht ja nicht, eine nahezu optimale Reihenfolge, in welcher Reihenfolge ihr die Kunden besuchen müsst, von der Entfernung her, so wie bin ich jetzt drauf gekommen, genau und da mach ich das so, da mach ich das über CraftQL, das ist der neueste Shit, Alter, CraftQL, die Abfrage von Daten, ist recht praktisch, weil die haben irgendwie 50.000 Kundendaten, sonst war es da am Start und wenn ich das alles auf eine Seite laden würde, wäre ein bisschen viel, aber in dem Fall glaube ich, brauchen wir das hier nicht und da mit Routen per Google Maps, das war eines der Gründe, warum ich heute Morgen nach einem ordentlichen Geocoding Service gefragt habe, aktuell haben wir einen Google Business Account gemacht und auch schon mal probiert ein bisschen, funktioniert ganz gut, aber eine kostenlose Lösung wäre halt nice, ist auch kein Problem, ist auch kein Problem, weil die Routenberechnung machen wir über Google, machen wir eh nicht darüber, die Routenberechnung macht ihr in ihr Navi, es geht bloß in die Richtung, in welcher Reihenfolge sie die Termine machen müssen, Webbox bezahlt man auch, ja ich muss mal gucken, ich muss mal gucken, ich weiß nicht ob ich euch die App zeigen darf jetzt, ob oder was dagegen hat, sonst hätte ich euch mal gezeigt, ja OpenStreetMap, ich nehme aktuell OpenStreetMap, ich habe mir einen Jason exportiert mit allen Postleitzahlen und Städten in Deutschland, das heißt für das Autocomplete Feld, das ist relativ easy an der Stelle, aber sobald Straßen dazukommen wird es halt eine ganze Ecke komplizierter und die Routenberechnung mache ich mit einem anderen Open Source Projekt, das macht die Routenberechnung für mich, ich mache das ja nicht selbst, ich mache hier kein, es ist ja quasi nicht nur Traveling Salesman, es ist Traveling Salesman mit mehreren Fahrzeugen und Zeitfenstern, das programmiere ich doch nicht selbst, das bin ich verrückt, dann nehme ich was was fertig ist, was das schon kann, das mache ich doch nicht selbst, ich glaube es geht los, ich habe übrigens festgestellt, es ist mir gerade wo ich hier gelabert habe, wo heißt das Ding, verrate ich nicht, mir ist noch eine Sache aufgefallen, was fail ist von dem was ich hier gebastelt habe, was richtig fail ist und zwar guck mal, die glaube ich zumindest, die Reihenfolge der Tage stimmt nicht, wie mache ich das, also am besten wäre natürlich wenn ich beim Importieren die Reihenfolge der Tage richtig mache, habt ihr die angesprochen oder sich beauftragt, das ist in dem Fall ganz einfach, halbe halbe, der Chef dem die Firma gehört ist ein Freund aus der Schule von meinem Kollege und er hat ihm wahrscheinlich erzählt, dass man da was viel praktisches programmieren könnte und der hat ihn dann beauftragt, so rum, also halbe halbe, ich muss den Kram übrigens noch sortieren und jetzt stehe ich ein bisschen auf dem Schlauch, wie mache ich das jetzt am besten, ich meine ich kann jetzt hier sagen order by, aber das funktioniert nicht, ich müsste jetzt hier sagen order by, aber das funktioniert auch nicht, wie mache ich das jetzt richtig, wie sortiere ich, wie sortiere ich die history, also das hier ist ja quasi so ein Subquery unter der Haube in der Datenbank, ein Subselect ist das hier ja unter der Haube im Endeffekt, wie mache ich denn das jetzt, weil was ich von der Theorie her muss ich jetzt den Kram hier sortieren, ok, noch mal so Result und dann, wir machen erstmal eine Liste drauf, dass kein Datenbankkram mehr ist, ja genau ich werde es auch nachher sortieren, also ich frage es dir erstmal ab und sortier es jetzt quasi so post-processing-mäßig, das macht dann halt nicht die Datenbank oder so, aber kann sich auch gar nicht, weil ich habe es ja da gar nicht gesortet gespeichert, ne gut, können wir ja mal machen, also das heißt ich sage jetzt hier Result, also irgendwie was gibt es auch, for each oder aggregate, ne kommt for each, das ist aber nicht schön, history, order by, date, so was in der Richtung, geht das, ah return value is not used, so, boah das ist aber echt unschön jetzt, wenn funktionieren wird es wahrscheinlich, aber schön ist es nicht, user123698745, absolut high IQ Username, Dankeschön für den Zapp, PgRooting habe ich ja nie gehört, ich weiß es gibt einen OpenStreetMaps, Postgres Export so es ist jetzt sortiert, erster 23 jetzt ist es sortiert, guck, jetzt funktioniert, aber schön ist es hier nicht, erstmal alles abfragen, um es danach nochmal neu zu sortieren, schön ist das nicht, also ich müsste das beim Import schon richtig speichern, müsste das eigentlich beim Import einmalig sortieren hier, also ich müsste quasi hier sowas sagen, history und hier sort, also quasi, egal wir lassen es jetzt so, wir lassen es jetzt, funktioniert ja, so viele Datensätze sind es jetzt auch nicht, dass es jetzt wahnsinnig langsam wäre, ok jetzt kriege ich den Kram zurück, gut jetzt können wir mit unserem Frontend anfangen, wir machen eine neue Frontend App, und zwar Stream, oh die Musik ist nice, ok, ok, ok, ok, jetzt haben wir den Kram sortiert, so jetzt müssen wir ein neues Frontend anlegen, also View, Create, Client App, ah nee, Moment ich hab noch was vergessen, wir machen erstmal einen Git Repo aus der ganzen Sache, Git Init, Git Init, so und da kopiere ich jetzt mal ein ordentliches Git Ignore rein, was ich mir jetzt auch mal aus meinem anderen Projekt klaue, dass ich nicht unnötig viel Zeugs da drinnen einchecke, so, Git Commit A-M, Git Init, sehr schön, und jetzt gehen wir da rein und legen unsere Client App an, so, brauchen wir nicht, Linter Formatter, ha, null, alter, der braucht schon Linter, mein Code ist ohne Linter viel besser lesbar, Big Brain braucht, wenn man, ab einer gewissen Hirngröße braucht man kein Linter mehr, da lintet man quasi instinktiv, Git Ignore.io, ah, ah, yes, excellent, das ist wirklich praktisch, das kannte ich noch nicht, das ist wirklich praktisch, nee kein TypeScript, nee hör mal auf, ich will es nicht komplizierter machen als ohnehin, so, reicht, reicht, wir machen den Router rein und Statemanager, das reicht, PWA Support, nee nicht wirklich, wozu, nein, wollen wir nicht, wir wollen kein History Mode, alles ins Package Jason rein und auch nicht speichern, for future projects, jetzt installieren wir erstmal das halbe Internet, weil das ist JavaScript, JavaScript funktioniert ohne das halbe Internet nicht, und die restliche andere Hälfte des Internets funktioniert ohne JavaScript nicht, das heißt man braucht immer das 100% des Internets, ja, Sebaro habe ich heute morgen noch erzählt, ich habe einen halben Schrank voller Nudeln, immer, CloPop hier habe ich noch 5-6 Packungen im Vorratsschrank, also reicht alles, so, enden wir den Kram mal, Huge Comet, Big Brain Comets, gut, also, und jetzt können wir folgendes machen, hier oben, hier oben läuft der, das Backend und hier unten läuft das Frontend, das heißt wir gehen jetzt hier unten hin, sagen Yarn Surf und schon, ah nee, wir müssen, wobei nee, erstmal okay, so und schon kann ich mal meine IDE woanders hinschieben, wir machen Visual Studio Code auf, ach nee, wir haben ja, wir haben jetzt ja die Open Source Variante davon, die ohne Microsoft gedönnt, warum habe ich das nochmal installiert, ich weiß es gar nicht mehr, so und jetzt haben wir hier unser Frontend am Start, Source, Main App, alles gut, wir sind natürlich gleich mal so hart drauf und hauen nochmal ein ordentliches Frontend Framework mit drauf, also für CSS und Buttons und User Elemente, ob wir es brauchen, keine Ahnung, Moment, wie ging das nochmal, kann man das immer nicht merken, das macht man immer einmal zum Projekt und dann nie wieder, ja, View, Add, genau, dann sieht das auch alles ein bisschen hübscher aus, nee, das haben wir uns noch nicht angeguckt, Tommy, das haben wir uns noch nicht angeguckt, Default, ah yes, excellent. So, sehr schön und so Kram wie Node Modules sollte der gar nicht adden da drinnen, gut, dann gucken wir uns mal unser Frontend an, wie das so ausschaut jetzt, das ist natürlich noch das Default Template, da schmeißen wir jetzt so gut wie alles raus, was hältst du von Webstorm, ich habs mir kurz mal angeguckt, es hat mich jetzt nicht so vom Hocker gehauen, dass ich es instant benutzen wollte, aber man braucht immer eine Weile bis man da durch pikt, ich hab kein Chrome installiert, was ist das denn, Abmahnung ist raus, warum hab ich kein Chrome installiert, so, jetzt aber, ah yes, localhost port 80, nein Google, localhost, der localhost port 8080, da ist unsere Default App, die natürlich nichts macht außer Default zu sein, git, settings, ich brauch meine Schriftart, wuah, wuah, warum hab ich meine Schriftart hier nicht, Font, ja, 22 und zwar Hack, vielleicht auch nur 20, wie groß, hör mal 18, ah so ist das doch gut, aber 18 ist mir fast ein bisschen klein, 19, ja so ist das doch schick, ist das Hack jetzt, machen wir was anderes rein, ja das ist anscheinend doch, ach lassen wir das so, gut, so jetzt wollen wir mal Tabs gucken, ja wir haben das ja letztens runtergeschmissen, Tab size, wir haben ja das andere Visual Studio runtergeschmissen, das heißt ich hab hier nichts installiert für drinnen, zumindest also keine Config Datei, Extensions haben wir aber die wichtigen Sachen installiert, ok, so, defaultmäßig wir schmeißen jetzt erstmal diesen ganzen Crap raus, App Bar, was auch immer, hast du nicht gesehen, alles fort und das geile ist, ich muss jetzt auch nur hier speichern und zack, aktualisiert sich das ganze, Import Hello World from, ah piss dich, weg, weg, so, so ist das schön, erstmal alle schön, schön leer, ehm, gucken wir mal ob der da überhaupt eben das Content weg, ok, Inhalt funktioniert noch, Routen, Main, Main Routen, Home, About, About brauchen wir grad nicht, kommt fort, erstmal ein bisschen aufräumen mit Standard Zeug, eh Home brauchen wir aber, und damit Home funktioniert, müssen wir hier einen, oh wie ging das, Router View, Router View machen, oh, Moment wie ging der, oh fuck wie ging das nochmal, was, achso ich hab beides, sehr gut, sehr schön, so, Router View, Home, kommt hier auch noch raus, zack, zack, gut, so, jetzt haben wir den Kram aufgeräumt, was, was eine schwere Geburt, eh, Michael, du bist jetzt ja noch rechtzeitig, hast ja noch ein Stream erwischt, gut, jetzt haben wir alles, ganz wichtig wir müssen erstmal einen Button machen, warum geht denn der Button da nicht, warum ist das jetzt kein Button, oh, ah, da ist ein Button, what, warum geht der Button da nicht, hab ich jetzt irgendwas zu viel gelöscht, Low Brain, hab ich jetzt irgendwas zu viel gelöscht, warum, ich will mit der Map anfangen und mich nicht mit so stark rumschlagen müssen, könnte das das Problem sein, weil das im Content ist, gute Frage, nächste Frage, ich hab garantiert irgendwas zu viel gelöscht, ich hab garantiert zu viel, irgendwas, irgendwas zu viel, ich hab keine Ahnung, echt mal funktionieren tut's ja, ah, was ist das wieder für JavaScript-Gefrickel, was ist das wieder für JavaScript-Gefrickel, was, ah Gott, gucken wir mal in die Konsole rein, was merkt ihr da denn hier rum, no such compute, what the fuck, es lebe Frontend-Kram, hä, what, was hab ich denn jetzt anders gemacht als vorher, was hab ich jetzt anders gemacht als vorher, vielleicht Cash-Problem, vielleicht, ja, ok, was auch immer, scheiß drauf, wir fangen jetzt mit der Karte an, also was brauchen wir, Leaflet, Leaflet, es gibt einen Leaflet Vue.js Rapper, aber den schenken wir uns erst mal und machen so mal ne Karte von Hand und schauen uns an, wie das Ganze ausschaut, äh, warte mal, was ist da unten los, äh, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok. Musik Musik Musik Musik Musik Das war's für heute. Das war's für heute. So, ähm, ich muss grad runter. Mein Nachbar war grad da. Mein Nachbar war grad da, hat gesagt, er hat gegrillt und hat uns was mitgebracht. Das heißt, wir müssen mal eine kurze Essensunterbrechung machen. Und ich muss jetzt erstmal kurz was vortan, weil sonst kalt wird. Ich hab jetzt hier zwei Würste und zwei so gegrillte Pepperoni oder sowas. Also gucken wir mal ein bisschen Essenvideo und ich futter mach schnell was. Der Beef Bagel Burger. Kokona. Kokona Grill Sendung. Wir gucken mal eine Runde Burger Grillen und ich ess mal kurz meine Wurst. Also ich hör mal kurz hier Text. Sollten wir den Kram noch mal in einer ordentlichen Größe machen. Essen, Pause, zack. Was? Was ist denn S-P-G? Wow, schmeckt gut aus, toll. Die Pepperoni schmeckt echt gut. Warum tut ihr das? Ich weiß es nicht. Oh, Wurst. What? Was ist jetzt los? Die haben Knall die Typen ey. Es riecht gut. Nicht? Normalerweise sagt er das immer. Da jetzt. 300° sind 300°. Die leben sehr gesund. Ich hab letztens ein Video von ihm gesehen. Dann. Das wird es mir auch geben. Ich hoffe ich schmatze euch nicht zu sehr ins Bauch. Das sieht aber gut aus. Das sieht gut aus. Ich möchte es erstmal. Ich hab es ja nicht. Wer soll das essen? WTF? Das ist ja 3 Meter hoch. Die Musik dabei auch. Bacon Salami Cheeseburger. Das klingt auch gut. Der klingt so richtig Kokona pur. Ist das eine Gewürzmischung? Das kommt auch immer am Anfang. Ich know meine Salami. Der Chat. Der hat seine Machete gelassen. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint. Ich weiß, dass er mit Bakterien meint.", "segments": [{"id": 1, "start": 0.0, "end": 23.36, "text": "Da ist er wieder, ich war jetzt nicht lange auf, ich weiß, oh wie sie groß sind im Outschloss."}, {"id": 2, "start": 23.36, "end": 33.36, "text": "So, ich bin jetzt wieder auf, ich weiß, ich war jetzt nicht lange auf, ich weiß, oh wie sie groß sind im Outschloss."}, {"id": 3, "start": 53.36, "end": 71.84, "text": "So, also das erste, ich muss erstmal warten, bis Twitch richtig am Start ist."}, {"id": 4, "start": 71.84, "end": 78.32, "text": "Es gibt, wenn man nämlich auf GitHub sucht, es gibt 30 Millionen Corona-APs."}, {"id": 5, "start": 78.32, "end": 96.56, "text": "Ja, ich bin schon wieder da, ich habe nämlich gedacht, ich meine heute ist Sonntag, da passiert allgemein nicht so viel."}, {"id": 6, "start": 96.56, "end": 104.96, "text": "Wir können mal versuchen, eine schöne Corona-Übersicht bzw. Statistik mit Karte zu programmieren."}, {"id": 7, "start": 104.96, "end": 116.88, "text": "78%, du gehörst dazu, oder was? Der Eichler, dankeschön, sieben Monate, huge."}, {"id": 8, "start": 116.88, "end": 129.68, "text": "Ja, ich hatte allerdings großartig zu tun, ich hatte jetzt die Auswahl, entweder wir programmieren was aktuelles mit aktuellem Bezug."}, {"id": 9, "start": 129.68, "end": 138.32, "text": "Oder ich nehme das Battlefield-Video auf, auf was ich gerade nicht so in kreativer Stimmung bin."}, {"id": 10, "start": 138.32, "end": 143.84, "text": "Oder aber, ich spiele Path of Exile."}, {"id": 11, "start": 143.84, "end": 150.96, "text": "Und ich habe mir gedacht, komm wir können mal was halbwegs sinnvolles programmieren, was vielleicht irgendjemand noch was bringt."}, {"id": 12, "start": 150.96, "end": 156.72, "text": "Das Problem ist nur bei der ganzen Geschichte, ich muss mal ein bisschen was trinken, sonst kriege ich irgendwann noch Kopfweh heute."}, {"id": 13, "start": 156.72, "end": 166.56, "text": "Kopfweh, Ursache Nummer eins, zu wenig trinken, Battlefields sackt, das aktuelle Battlefields voll vernascht, spiele ich nicht."}, {"id": 14, "start": 166.56, "end": 180.24, "text": "Also es gibt 30 Millionen Corona-Apis, ich habe schon ein paar durchgeguckt, die Sache ist bloß die, die nehmen mehr oder weniger, manches heißt doch einfach nur Corona."}, {"id": 15, "start": 180.24, "end": 188.24, "text": "Das Problem ist, die nehmen alle mehr oder weniger die gleiche API."}, {"id": 16, "start": 188.24, "end": 202.8, "text": "So, wenn man jetzt hier guckt, zum Beispiel bei dem hier, wenn man nach Germany sucht, dann sind das die Zahlen von gestern."}, {"id": 17, "start": 202.8, "end": 214.88, "text": "Also sprich, die ziehen sich die Daten alle, ich habe mal nachgeguckt von wo die sich die Daten ziehen, die ziehen sich die Daten mehr oder weniger alle hiervon."}, {"id": 18, "start": 214.88, "end": 218.48, "text": "So, und die updaten nicht so oft."}, {"id": 19, "start": 218.48, "end": 224.88, "text": "Hat das RKI keine Zahlen für die, was ist denn das RKI?"}, {"id": 20, "start": 224.88, "end": 237.92, "text": "Ach, die meint es, das Robert-Koch-Institut, habe ich nicht gefunden, zumindest nichts, um was abzufragen."}, {"id": 21, "start": 237.92, "end": 247.44, "text": "Die hatten auch den letzten Stand von 14, die Fallzahlen, die hatten auch 14."}, {"id": 22, "start": 247.44, "end": 263.44, "text": "So, was ich allerdings gefunden habe, ne, wie ich hoffe, das ist alles nicht aktuell, also was ich gefunden habe, ist einmal die hier, ich habe aber keine Ahnung, wo die ihre Zahlen näher haben, wie verlässlich das Ganze ist."}, {"id": 23, "start": 263.44, "end": 278.88, "text": "Wenn man jetzt zum Beispiel hier auf Germany geht, die aktualisieren halt mehrfach am Tag und ich habe das da noch gefunden und mich würde mal,"}, {"id": 24, "start": 278.88, "end": 294.56, "text": "ja, das Robert-Koch-Institut hat keine, zeig mir mal, doch kann ich, wenn du mir ne schöne Seite vom Robert-Koch-Institut zeigst, der die aktuellen Daten hat. Die hier und die hier, die haben das aktuelle."}, {"id": 25, "start": 294.56, "end": 301.36, "text": "So, was ich halt nicht checke ist, vielleicht schreiben die auch einfach voneinander ab, wo ich keine Ahnung hab, wo haben die die Sachen her?"}, {"id": 26, "start": 301.36, "end": 324.32, "text": "Woher wissen die, dass in Hessen und in Bayern Fälle sind und woher wissen die schon, dass wir bei 5.426 sind und warum ist hier auf GitHub alles, was ich an Datenbanken finde, das ist Stand gestern, da sind wir bei 4.000 noch was."}, {"id": 27, "start": 324.32, "end": 339.76, "text": "Ne, die haben keines, na doch, die haben schon Quellen dastehen, aber die bringen mir nix, weil die Quellen, die die angegeben haben, sich nicht decken mit dem, was die sich, also Leute, wenn ihr was habt, schickt mir ordentliche Links, ja."}, {"id": 28, "start": 339.76, "end": 355.52, "text": "Also alle APs, die ich kenne, haben als letzte Zahlen für Deutschland 4.585. Ja genau, genau, die hab ich auch, die hab ich auch, aber die hier sind, die wissen angeblich schon mehr."}, {"id": 29, "start": 355.52, "end": 377.92, "text": "Und ich frage mich, woher haben die erstens die Region, weil die findet man nirgendswo, in keinem AP, in keinem Bericht findet man für Deutschland Region, für die Amis gibt's Region, die haben welche, wir nicht."}, {"id": 30, "start": 377.92, "end": 394.96, "text": "Ähm, also das, ich bin mal echt gespannt, ob das irgendjemand von euch was findet, ja, so, ähm, ja und dazu haben wir, dazu haben wir, wenn wir hier nach Quellen gucken, die haben das."}, {"id": 31, "start": 394.96, "end": 412.48, "text": "Warte mal, ich muss mal kurz Skype zumachen, warum ist Skype überhaupt angegangen? Skype, geh weg, was will Skype denn jetzt?"}, {"id": 32, "start": 412.48, "end": 429.76, "text": "So, ich hab Skype mal installiert, so, wenn man sich hier die Quellen anguckt, die haben wir, das ist das hier und die sind von gestern, so, Robert Koch Institut auch von gestern."}, {"id": 33, "start": 429.76, "end": 444.0, "text": "Einzige, was wir sonst noch haben könnten, wäre das da, das da und das da, so, die hier sind von 8 Uhr, aber was ist das für ein total beknacktes Format?"}, {"id": 34, "start": 444.0, "end": 461.76, "text": "Guck, und die sagen auch, wir haben nur 3795, wieder was ganz, wieder was ganz was anderes, äh, und das sind irgendwelche chinesischen Dinger, wo ich echt keinen Plassen Schimmer hab, was da, was da Sache ist, ja."}, {"id": 35, "start": 461.76, "end": 471.84, "text": "Also, ich weiß echt nicht, wo die ihre Daten herkriegen, die zwei, echt kein Plan. Ich finde, ich finde diese Daten nicht, die die hier haben, bei der Morgenpost."}, {"id": 36, "start": 471.84, "end": 479.84, "text": "Das heißt, wir werden mal als Grundlage, ich bin irgendwie ein bisschen heiser, komisch, hab ich auch mal in soviel geschwätzt, dann ist vielleicht keine gute Idee, dass ich jetzt streme."}, {"id": 37, "start": 479.84, "end": 487.84, "text": "So, oje, ja Leute."}, {"id": 38, "start": 487.84, "end": 503.84, "text": "Ja, hast du mal eine Seite von den Bundesländern, wo das drauf steht? Hessen, Corona. Der Corona-Ticker."}, {"id": 39, "start": 503.84, "end": 523.84, "text": "Hallo Knierbier. Das Kultusministerium ist verantwortlich, hä? Hessen, Corona, Zahlen."}, {"id": 40, "start": 523.84, "end": 545.84, "text": "Ich finde nichts. Ah, hier, guck mal. Ah, yes, excellent, excellent. Das war mal in Frankfurt, 21. So."}, {"id": 41, "start": 545.84, "end": 565.84, "text": "Wir suchen mal nach, wie heißt das Zeug ja? Covid. Okay, danach muss man natürlich suchen. Jeder nennt es Corona, aber wir nennen es SARS-CoV-2."}, {"id": 42, "start": 565.84, "end": 583.84, "text": "Man findet einfach nix. Und wenn man was findet, dann sind die Daten halt von gestern."}, {"id": 43, "start": 583.84, "end": 605.84, "text": "Die sind von gestern. Und dann auch nur als nicht barrierefreie PDF-WTF. Geier, wie soll man das pasen? Wollen die mich veräppeln?"}, {"id": 44, "start": 605.84, "end": 613.84, "text": "Die Daten werden um 17 Uhr aktualisiert. Also was ich an merkwürdig finde, da sind die, ich frage mich echt, wo die das her haben. Deswegen werden wir das jetzt folgendermaßen machen."}, {"id": 45, "start": 613.84, "end": 619.84, "text": "Habe ich mir schon überlegt. Wir programmieren jetzt mal was mit irgendwie, wir ziehen uns irgendwie, keine Ahnung, wir ziehen uns von hier."}, {"id": 46, "start": 619.84, "end": 627.84, "text": "Wir ziehen uns einfach einmalig von hier den kompletten Dump und basteln das quasi so zurecht, dass wir daraus eine Karte generieren können."}, {"id": 47, "start": 627.84, "end": 638.84, "text": "Aber wir greifen dann nicht direkt auf die API jedes Mal zu, sondern wir laden uns das einmal runter, speichern das in der SQLite-Datenbank und liefern den Kram aus."}, {"id": 48, "start": 638.84, "end": 651.84, "text": "Und dann ist das nämlich abstrahiert von dem, wo ich die Daten herkriege. Das heißt, sollte ich nochmal eine ordentliche Quelle finden, die auch immer aktuell ist, dann kann ich das daher holen."}, {"id": 49, "start": 651.84, "end": 668.84, "text": "Oder aber, ich bin ganz fies und webscrape hier die Seite irgendwie, die hier. Können wir ein Tor machen."}, {"id": 50, "start": 668.84, "end": 679.84, "text": "Ist auch eine Möglichkeit. Aber keine schöne. Wir nehmen das jetzt einfach mal von hier."}, {"id": 51, "start": 679.84, "end": 687.84, "text": "So, ich habe hier mal gerade mal mein ganzes Zeug aktualisiert. So, ich habe schon das Corona-Projekt angelegt."}, {"id": 52, "start": 687.84, "end": 695.84, "text": "Wir gehen jetzt erstmal hier rein. Corona, was?"}, {"id": 53, "start": 695.84, "end": 704.84, "text": "Moment, wo ist es denn? Ach, in Test Stream ist es."}, {"id": 54, "start": 704.84, "end": 726.84, "text": "Das ist da, wo wir gestern drin waren. Nee, nee, nee, nee."}, {"id": 55, "start": 726.84, "end": 734.84, "text": "Okay, da will ich das nicht drin haben. Wobei, warum eigentlich nicht? Ich meine, wir machen es doch im Stream. Ist doch gut."}, {"id": 56, "start": 734.84, "end": 740.84, "text": "Welche IDE? Das ist Rider. Es ist die einzige sinnvolle Cross-Platform.net-IDE, die es gibt."}, {"id": 57, "start": 740.84, "end": 761.84, "text": "Der nimmt, was nimmt die Daten von? Okay, zeigt mal her. Deckt sich das? Deckt sich das? Deckt sich das? Hessen 203?"}, {"id": 58, "start": 761.84, "end": 770.84, "text": "Nö. Sag mal, die Daten sind ja komplett unterschiedlich."}, {"id": 59, "start": 770.84, "end": 794.84, "text": "Alter Mono-Developer, hör mal auf. Ich meine, die sagen Hessen 203 und Hessen selbst sagt 282. Dafür haben die insgesamt halt schon die 5.426."}, {"id": 60, "start": 794.84, "end": 802.84, "text": "Und die offiziellen Daten, die ich finde, die haben halt nur 4.000, noch was."}, {"id": 61, "start": 802.84, "end": 807.84, "text": "Oh, jetzt wird sie holen. Jetzt kommt die Big-Brain-Diskussion im Chat, wie der Kram jetzt heißt."}, {"id": 62, "start": 807.84, "end": 811.84, "text": "Also, was wir jetzt, wir abstrahieren das Ganze jetzt mal ein bisschen."}, {"id": 63, "start": 811.84, "end": 822.84, "text": "Wir schnappen uns jetzt einfach mal diese API hier, laden alles runter, speichern es in der SQLite-Datenbank und bauen da ein paar Klassen drumherum, dass ich die Quelle austauschen kann, zu was ich will."}, {"id": 64, "start": 822.84, "end": 831.84, "text": "So, der Wetter-Forkast, der kommt erstmal weg. Das ist so diese Standard-Beispiel-API, die immer dabei ist."}, {"id": 65, "start": 831.84, "end": 846.84, "text": "Den benennen wir mal um in Corona-Controller."}, {"id": 66, "start": 846.84, "end": 853.84, "text": "So, der ganze Schmodder hier kommt weg, den brauchen wir nicht, und das hier kommt auch weg."}, {"id": 67, "start": 853.84, "end": 856.84, "text": "Wir haben ja noch keine Klassen, wir haben ja noch nichts drinne."}, {"id": 68, "start": 856.84, "end": 863.84, "text": "So, das heißt, als erstes legen wir jetzt mal einen Ordner an, für unsere Datenbank."}, {"id": 69, "start": 863.84, "end": 875.84, "text": "Oh, die Kirby-Musik."}, {"id": 70, "start": 875.84, "end": 881.84, "text": "SQLite-Datenbank, ja, wenn schon, wir machen ein MongoDB-Cluster."}, {"id": 71, "start": 881.84, "end": 884.84, "text": "Azure, Azure MongoDB-Cluster."}, {"id": 72, "start": 884.84, "end": 897.84, "text": "Ich meine, so eine SQLite-Datenbank, die ist ja wahrscheinlich mit 5.000 Datensätzen heillos, heillos, da braucht man MongoDB-Cluster, stretched über drei Kontinente."}, {"id": 73, "start": 897.84, "end": 902.84, "text": "Mindestens."}, {"id": 74, "start": 902.84, "end": 910.84, "text": "So, als erstes fügen wir mal SQLite hinzu."}, {"id": 75, "start": 910.84, "end": 921.84, "text": "Hallo, kannst du mal suchen? SQLite, EF Core, EF Core SQLite, da ist es."}, {"id": 76, "start": 921.84, "end": 932.84, "text": "Poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch, poch."}, {"id": 77, "start": 932.84, "end": 940.84, "text": "So, da legen wir jetzt was an, und zwar ein AppDB-Context."}, {"id": 78, "start": 940.84, "end": 943.84, "text": "DB-Context, oh, da kam es noch nicht installiert."}, {"id": 79, "start": 943.84, "end": 946.84, "text": "DB."}, {"id": 80, "start": 946.84, "end": 950.84, "text": "DB-Context, ah, yes, excellent."}, {"id": 81, "start": 950.84, "end": 957.24, "text": "So, bevor wir hier weiter machen, wir gucken jetzt erstmal, wie wir die Daten hier abgefragt"}, {"id": 82, "start": 957.24, "end": 958.24, "text": "kriegen."}, {"id": 83, "start": 958.24, "end": 964.32, "text": "Also Corona, Tracker, RP, wir machen das jetzt ganz ganz Noob-Style-mäßig, wir importieren"}, {"id": 84, "start": 964.32, "end": 972.0, "text": "einfach alles mal in unsere SQLite-Datenbank und dann speichern wir die einfach und importieren"}, {"id": 85, "start": 972.0, "end": 973.0, "text": "nicht mehr."}, {"id": 86, "start": 973.0, "end": 975.92, "text": "Und dann haben wir die Sachen erstmal drin und danach kann ich gucken, wie ich den Kram"}, {"id": 87, "start": 975.92, "end": 979.24, "text": "aktualisiere, Hauptsache wir haben erstmal ein paar Daten drinne."}, {"id": 88, "start": 979.24, "end": 985.04, "text": "Also, HTTPS-Redirection wollen wir nicht, Autorisierung, wer braucht Autorisierung,"}, {"id": 89, "start": 985.04, "end": 994.48, "text": "das ist ja komplett overrated, so Services, AddDB-Kontext, ne das machen wir noch nicht,"}, {"id": 90, "start": 994.48, "end": 995.48, "text": "das machen wir noch."}, {"id": 91, "start": 995.48, "end": 1003.44, "text": "Erstmal hier abfragen, so wir laden uns jetzt erstmal den Kram von dieser Seite runter."}, {"id": 92, "start": 1003.44, "end": 1011.72, "text": "AddTTP, client, get, string, async, alles was wir haben, bam."}, {"id": 93, "start": 1011.72, "end": 1017.28, "text": "Ahja, was auch ganz praktisch ist, man kann jetzt hier nach, ups, vielleicht soll ich"}, {"id": 94, "start": 1017.28, "end": 1024.4, "text": "mal in den richtigen Ort lang gehen, stream, Corona, da ist ja unser Projekt drinne, man"}, {"id": 95, "start": 1024.4, "end": 1032.84, "text": "kann jetzt hier drinne sagen,.net, watch, run und was der jetzt macht ist, das ist sehr"}, {"id": 96, "start": 1032.84, "end": 1040.84, "text": "praktisch, das ist sehr praktisch, wenn ich jetzt hier nehm ich was drinne ändere, sagen"}, {"id": 97, "start": 1040.84, "end": 1047.92, "text": "wir mal ich, ich geb jetzt mal aus, ich geb jetzt mal aus, was wir hier von der API abrufen,"}, {"id": 98, "start": 1047.92, "end": 1057.28, "text": "ah, ups und ich drück jetzt speichern, dann aktualisiert sich das selbst und startet sich"}, {"id": 99, "start": 1057.28, "end": 1062.46, "text": "neu und gibt den Kram aus, das ist praktisch, ich find das viel praktischer, wie jedes"}, {"id": 100, "start": 1062.46, "end": 1067.36, "text": "mal hier auf run zu drücken oder Steuerung F5 zu drücken, einfach speichern drücken"}, {"id": 101, "start": 1067.36, "end": 1071.0, "text": "und es startet sich neu und man muss auch nichts machen, das ist viel, dass der startet"}, {"id": 102, "start": 1071.0, "end": 1078.12, "text": "den kompletten.net Server neu und das macht man einfach doppelt, unten macht man einen"}, {"id": 103, "start": 1078.12, "end": 1082.96, "text": "watch auf die client Anwendung, dass er das ganze JavaScript Zeug neu baut und oben macht"}, {"id": 104, "start": 1082.96, "end": 1086.88, "text": "man es einfach auf den.net Server und dann aktualisiert sich der Kram immer und man"}, {"id": 105, "start": 1086.88, "end": 1094.32, "text": "muss nicht laufend auf irgendwas draufklicken, das ist viel einfacher. So, also wir rufen"}, {"id": 106, "start": 1094.32, "end": 1103.16, "text": "jetzt hier von der API das ganze Corona Zeug ab, Jason Convert, ich weiß, dass man eigentlich"}, {"id": 107, "start": 1103.16, "end": 1108.6, "text": "mit dem neuen ASP.NET Core, also eine Karte wo der Corona Verlauf eingezeichnet ist, also"}, {"id": 108, "start": 1108.6, "end": 1120.12, "text": "was mir vorschwebt ist folgendes, was mir vorschwebt ist folgendes, die haben doch"}, {"id": 109, "start": 1120.12, "end": 1135.76, "text": "eine Demo, sowas schwebt mir vor, aber halt im weltweiten Stil ja, sowas, sowas schwebt"}, {"id": 110, "start": 1135.76, "end": 1144.24, "text": "mir hier vor, Heatmap, genau, so und dann das dann im Endeffekt was sollte rauskommen"}, {"id": 111, "start": 1144.24, "end": 1151.56, "text": "am Ende, dass USA recht verteilt ist und nicht so viel, Europa hat halt hier einen roten"}, {"id": 112, "start": 1151.56, "end": 1155.76, "text": "Flag, Skandinavien ein bisschen und China und vor allem Italien hat einen ganz, ganz"}, {"id": 113, "start": 1155.76, "end": 1163.48, "text": "ultra roten Flag, sowas in der Richtung, wenn nicht das bei der Karte gerne rauskommt,"}, {"id": 114, "start": 1163.48, "end": 1176.24, "text": "und bei der Statistik, bei der Statistik machen wir hier sowas in der Richtung, so irgendwie"}, {"id": 115, "start": 1176.24, "end": 1185.6, "text": "so ein Graf, sowas hier, mit Apex Charts, das ist relativ simpel, aber erstmal müssen"}, {"id": 116, "start": 1185.6, "end": 1192.96, "text": "wir, high IQ ja, aber erstmal müssen wir den Graf abfragen und in unsere Datenbank"}, {"id": 117, "start": 1192.96, "end": 1200.6, "text": "schreiben, damit wir die ganzen Corona Daten bei uns auch lokal haben, die Erde ist doch"}, {"id": 118, "start": 1200.6, "end": 1209.2, "text": "keine Kugel, na das erkennt man ja schon hier dran, warte mal, wo habe ich jetzt zugemacht,"}, {"id": 119, "start": 1209.2, "end": 1223.4, "text": "man erkennt ja schon hier dran, dass die Erde in Wirklichkeit eine unendliche, eine, what,"}, {"id": 120, "start": 1223.4, "end": 1239.68, "text": "das ist kaputt, ok, Moment, erstmal gucken, Demo, man erkennt ja allein schon hier dran,"}, {"id": 121, "start": 1239.68, "end": 1245.24, "text": "dass die Welt eine unendliche Ebene ist, ja, wenn das Javascript sagt, dann hat, und Javascript"}, {"id": 122, "start": 1245.24, "end": 1253.44, "text": "hat eigentlich immer recht, also sprich, die Erde ist weder rund noch ist die Erde"}, {"id": 123, "start": 1253.44, "end": 1261.76, "text": "flach, die Erde ist in Wirklichkeit 2D, wie man hier sieht, und 2D, was man unendlich"}, {"id": 124, "start": 1261.76, "end": 1275.0, "text": "scrollen kann, hier habt ihr es zuerst erfahren, die Erde ist ein Sidescroller, genau, und"}, {"id": 125, "start": 1275.0, "end": 1278.6, "text": "das Interessante ist, dass das quasi, was man sich jetzt fragen kann, sind das vielleicht"}, {"id": 126, "start": 1278.6, "end": 1284.08, "text": "sogar mehrere Welten, weil man sieht hier die Heatmap, die Heatmap ist nur hier auf"}, {"id": 127, "start": 1284.08, "end": 1289.36, "text": "der Welt, und da ist die gleiche Welt, aber die hat keine Heatmap, das heißt ja auch,"}, {"id": 128, "start": 1289.36, "end": 1295.44, "text": "das hier muss, das muss eine andere Welt sein, parallel Welt muss das hier sein, das ist"}, {"id": 129, "start": 1295.44, "end": 1299.48, "text": "keine Disney-Musik, das ist Kirby-Musik, ihr seht hier, hier hat Neuseeland, hier hat"}, {"id": 130, "start": 1299.48, "end": 1307.88, "text": "Neuseeland einen Punkt, und hier hat Neuseeland keinen Punkt, das ist echt, wo ist mein Illuminati-Symbol?"}, {"id": 131, "start": 1307.88, "end": 1316.12, "text": "Ey, wenn ich in dem Tempo weiter mache, dann kriegen wir heute nichts geschissen, aber"}, {"id": 132, "start": 1316.12, "end": 1338.2, "text": "das sind wir ja schon gewöhnt. So, jetzt gucken wir mal, dass wir den Kram irgendwie"}, {"id": 133, "start": 1338.2, "end": 1348.12, "text": "rausgepasst kriegen, so, gucken wir mal, ob da jetzt was rauskommt, jetzt müssten wir"}, {"id": 134, "start": 1348.12, "end": 1353.04, "text": "eigentlich zumindest das Zeug halbwegs ordentlich als Jason gepasst zurück kriegen, gucken"}, {"id": 135, "start": 1353.04, "end": 1362.32, "text": "wir mal, da war, da, das sieht aber nicht ordentlich Jason gepasst aus, wenn ich ehrlich"}, {"id": 136, "start": 1362.32, "end": 1374.76, "text": "bin, aber doch, vielleicht schon, wie sieht denn das hier aus, was wir da überhaupt zurückkriegen?"}, {"id": 137, "start": 1374.76, "end": 1382.4, "text": "Ja, erstmal den ganzen anderen Shit zumachen, was kriegen wir da, Confirmed, Confirmed,"}, {"id": 138, "start": 1382.4, "end": 1393.08, "text": "ok, gucken wir mal, ob wir da Confirmed noch kriegen, Confirmed, warum printet er das"}, {"id": 139, "start": 1393.08, "end": 1403.52, "text": "denn so beknackt, warum printet er das denn nicht schön, warum printet er das nicht schön,"}, {"id": 140, "start": 1403.52, "end": 1415.96, "text": "das finde ich nicht gut von dem, achso, ah, ich gebe es doppelt aus, deswegen, null, ah,"}, {"id": 141, "start": 1415.96, "end": 1433.2, "text": "yes, jetzt ist gut, so ist es doch viel besser, null, mal nicht aufpassen, so, als erstes"}, {"id": 142, "start": 1433.2, "end": 1437.84, "text": "müssen wir mal, ok, also jetzt haben wir den Kram hier raus, vielleicht sollten wir erst"}, {"id": 143, "start": 1437.84, "end": 1445.96, "text": "mal eine Klasse für das ganze Corona Zeug anlegen, also machen wir hier noch einen neuen"}, {"id": 144, "start": 1445.96, "end": 1455.04, "text": "Ordner, Models, und da gibt es eine neue Klasse, die nennen wir, wie nennen wir da den Kram"}, {"id": 145, "start": 1455.04, "end": 1463.56, "text": "überhaupt, wow, geh fort, wie nennt man den Kram hier denn, ok, also die Statistik nach"}, {"id": 146, "start": 1463.56, "end": 1468.44, "text": "bestätigt, toden, latest und recovered juckt mich nicht, mich interessiert erstmal nur"}, {"id": 147, "start": 1468.44, "end": 1474.6, "text": "Confirmed, sprich einfach nur die neuen Fallzahlen, den Rest können wir, wenn wir das haben,"}, {"id": 148, "start": 1474.6, "end": 1481.32, "text": "können wir den Kram danach abfragen, so, und was mich hiervon interessiert ist ja auch"}, {"id": 149, "start": 1481.32, "end": 1486.32, "text": "weder latest noch sonst was, sondern die Locations interessieren mich, so, und in den Locations"}, {"id": 150, "start": 1486.32, "end": 1490.84, "text": "steht dann sowas drin, die, keine Ahnung, Thailand, Koordinaten sind dabei, das ist"}, {"id": 151, "start": 1490.84, "end": 1496.28, "text": "sehr gut, dass Koordinaten dabei sind, weil ich brauch Koordinaten für die Map, und"}, {"id": 152, "start": 1496.28, "end": 1502.36, "text": "ne History, das ist doch eigentlich alles, was ich brauche, so, das heißt, dann machen"}, {"id": 153, "start": 1502.36, "end": 1511.8, "text": "wir mal ne Klasse, die dann, die heißt jetzt Corona Location, so, und die hat ne, die hat"}, {"id": 154, "start": 1511.8, "end": 1520.52, "text": "ne Name, oder soll ich Corona Location, ich kanns auch Corona, Corona, ja ich nenns Location,"}, {"id": 155, "start": 1520.52, "end": 1526.16, "text": "eigentlich ist Country, Country besser, ja, weil das geht ja letztendlich, gehts ja um,"}, {"id": 156, "start": 1526.16, "end": 1532.56, "text": "die erste Kompetenz mal, Corona Country, hört sich an wie irgendwie Volksmusik oder so,"}, {"id": 157, "start": 1532.56, "end": 1539.84, "text": "Name hat das Ding, den Country Code, den braucht man vielleicht, wenn man mal ne andere API"}, {"id": 158, "start": 1539.84, "end": 1551.92, "text": "verwendet, schon, muss man mal gucken, Latest ist glaube ich gar nicht so schlecht, Latest"}, {"id": 159, "start": 1551.92, "end": 1558.52, "text": "zu haben, sind dann die Koordinaten, ja, das ist, also ich würde, wir können ja mal gucken,"}, {"id": 160, "start": 1558.52, "end": 1564.88, "text": "was für ne Koordinate in Deutschland drinne steht, Germany, 51.9, das ist irgendwo in"}, {"id": 161, "start": 1564.88, "end": 1570.48, "text": "der Mitte, also sprich, das sind keine Koordinaten für extra Fälle drin, da such ich ja immer"}, {"id": 162, "start": 1570.48, "end": 1575.8, "text": "noch ne API, wie ich da draufkomme, also wer die Daten dazu hat, ich hab bis jetzt noch"}, {"id": 163, "start": 1575.8, "end": 1583.08, "text": "nix gefunden, so, also, Koordinaten haben wir hier, das heißt, wir haben Corona Country"}, {"id": 164, "start": 1583.08, "end": 1588.0, "text": "als Klasse, Latest, das können wir mal reinmachen, die Fallzahlen gehen ja nur hoch, also können"}, {"id": 165, "start": 1588.0, "end": 1598.2, "text": "wir das als Unsigned Int machen, und dann nennen wir das hier Current oder so, dann"}, {"id": 166, "start": 1598.2, "end": 1604.36, "text": "brauchen wir auch die Koordinaten, die Kapseln wir aber nicht in extra Koordinaten, Objekt"}, {"id": 167, "start": 1604.36, "end": 1616.52, "text": "vorzu, sondern wir machen einfach hier ein Double, also das hier, Breitengrad, und dann"}, {"id": 168, "start": 1616.52, "end": 1624.28, "text": "gibt es ne History, in der History steht drinne Datum und jeweils Infizierte, ok, das heißt,"}, {"id": 169, "start": 1624.28, "end": 1634.6, "text": "wir brauchen nochmal ne extra Spezialklasse dafür, die nennen wir irgendwie, keine Ahnung,"}, {"id": 170, "start": 1634.6, "end": 1653.48, "text": "wie nennen wir das Ding, Corona Date, aber ich bin beim benennen, Timeline, ja Timeline"}, {"id": 171, "start": 1653.48, "end": 1661.08, "text": "finde ich, also, ne, History ist schon gut, aber wie nenne ich denn den Typ, ist, History"}, {"id": 172, "start": 1661.08, "end": 1666.48, "text": "ist ok, ja, wir können es auch Timeline nennen, aber ich finde History ist eigentlich ok, dann"}, {"id": 173, "start": 1666.48, "end": 1672.2, "text": "nennen wir das, History, das ist, wenn einem nix einfällt, dann nennt man die Dinger so,"}, {"id": 174, "start": 1672.2, "end": 1679.48, "text": "das geht immer, History Entry, das ist also schön nichtsagend, aber hilft einem, wenn"}, {"id": 175, "start": 1679.48, "end": 1684.64, "text": "einem nix einfällt, so, das heißt, wir haben jetzt ne Collection von History Entries in"}, {"id": 176, "start": 1684.64, "end": 1698.2, "text": "der Corona History, klingt schon wieder huge brainig, ja, so, und da ist dann der Verlauf"}, {"id": 177, "start": 1698.2, "end": 1708.96, "text": "drinne, wir können es auch, da ist dann der Verlauf drinne, ja, kann ich auch machen,"}, {"id": 178, "start": 1708.96, "end": 1713.24, "text": "aber ne eigene Klasse ist wahrscheinlich beim Serialisieren und Deserialisieren besser,"}, {"id": 179, "start": 1713.24, "end": 1718.84, "text": "weil ich muss ja am Ende des Chasen Zeug dann zu meinem Client wieder schicken, so, und"}, {"id": 180, "start": 1718.84, "end": 1732.36, "text": "so ein History hat im Prinzip nix anderes als ein Date und ein Counter oder sowas, Counter,"}, {"id": 181, "start": 1732.36, "end": 1738.96, "text": "so, so, gut, mehr brauchen wir jetzt nicht, da können wir alles mit abbilden erstmal,"}, {"id": 182, "start": 1738.96, "end": 1744.84, "text": "nachdem wir das aber in die Datenbank schreiben, brauchen wir auf jeden Fall ne ID, sonst"}, {"id": 183, "start": 1744.84, "end": 1751.32, "text": "meckert die Datenbank, dass wir keine eindeutigen IDs für unser Zeug vergeben können, gut,"}, {"id": 184, "start": 1751.32, "end": 1757.04, "text": "also wir fragen jetzt die Confirmed Corona Fälle ab und in den Confirmed Corona Fällen"}, {"id": 185, "start": 1757.04, "end": 1766.96, "text": "wollen wir, da machen wir jetzt ne Schleife drüber, das kann jetzt auch ruhig hässlich"}, {"id": 186, "start": 1766.96, "end": 1771.24, "text": "sein was wir da machen, weil wir brauchen das genau einmal, wir brauchen das einmal"}, {"id": 187, "start": 1771.24, "end": 1787.16, "text": "ums in die Datenbank zu importieren und danach nicht mehr, so, ok, das ist was ist das hier,"}, {"id": 188, "start": 1787.16, "end": 1793.96, "text": "das ist dann eine Location und wenn ich das ausgebe, sollte er mir jetzt mich zu-spammen"}, {"id": 189, "start": 1793.96, "end": 1803.88, "text": "mit dem ganzen Kram, genau, so, und in dieser Location drinnen sind dann wieder Country"}, {"id": 190, "start": 1803.88, "end": 1814.6, "text": "zum Beispiel, ok, das heißt jetzt sollte er mir nur die Länder ausgeben, die Zahlen"}, {"id": 191, "start": 1814.6, "end": 1820.48, "text": "ändern sich doch jeden Tag, ja, ja, das importiere ich dann einfach jeden Tag, aber jetzt zum"}, {"id": 192, "start": 1820.48, "end": 1827.28, "text": "Basteln ist, wat, aber jetzt zum Basteln ist wichtig, dass ich nicht bei jedem Mal neu"}, {"id": 193, "start": 1827.28, "end": 1831.68, "text": "starten die API von dem Typ hier abfragen muss, das ist ja, das findet er bestimmt"}, {"id": 194, "start": 1831.68, "end": 1851.8, "text": "auch nicht geil, also jetzt für Schmerzen, ach Moment, Locations brauche ich noch, null,"}, {"id": 195, "start": 1851.8, "end": 1862.72, "text": "ah, yes, so, jetzt haben wir die, oh, Kokona Land ist am Start, aber das hört ja gar nicht"}, {"id": 196, "start": 1862.72, "end": 1886.36, "text": "mehr auf, so viel US, Kokona, genau, so, also was hier war, Country ist das da, so, dann"}, {"id": 197, "start": 1886.36, "end": 1893.68, "text": "haben wir jetzt noch einen Country Code, das ist das hier, so, dann haben wir noch einen"}, {"id": 198, "start": 1893.68, "end": 1908.44, "text": "aktuellen Latest, Latest haben wir dann noch, und danach kommt eigentlich schon die History,"}, {"id": 199, "start": 1908.44, "end": 1916.84, "text": "hier was übersehen, ah, die Koordinaten brauchen wir noch, die Koordinaten brauchen"}, {"id": 200, "start": 1916.84, "end": 1927.16, "text": "wir noch, also, die Koordinaten brauchen wir noch, Co, Coor, was, Coordinates, stimmt"}, {"id": 201, "start": 1927.16, "end": 1943.48, "text": "das, ja, ah, der Längengrad, Breitengrad, ok, was schreibt denn das, ja, der, also,"}, {"id": 202, "start": 1943.48, "end": 1946.88, "text": "die Schreibweise vor Längengrad, Breitengrad ist immer ein bisschen unterschiedlich, Lat"}, {"id": 203, "start": 1946.88, "end": 1952.48, "text": "wird eigentlich immer Lat abkürzt, aber Long oder Lon, ähm, liegt denke ich daran, dass"}, {"id": 204, "start": 1952.48, "end": 1957.28, "text": "mittlerweile Lon fast schon bevorzugt wird, weil Long eben ein Datentyp ist und nicht"}, {"id": 205, "start": 1957.28, "end": 1981.04, "text": "in jeder Sprache funktioniert, wie viele Monitore, ich hab zwei Monitore, ich hab zwei Monitore,"}, {"id": 206, "start": 1981.04, "end": 1984.08, "text": "wenn ich was übersehe oder irgendwelche Subs übersehe, müsst ihr mich beanschreiten,"}, {"id": 207, "start": 1984.08, "end": 1991.76, "text": "weil ich konzentrieren muss, dann, ähm, ah, überseh ich das mal schnell, Talks to Warzone,"}, {"id": 208, "start": 1991.76, "end": 1998.4, "text": "ne, gut, so, jetzt haben wir eigentlich alle Informationen, die wir brauchen, außer die"}, {"id": 209, "start": 1998.4, "end": 2005.92, "text": "History vom jeweiligen Land, das kriegen wir auch relativ einfach hin, ähm, aber vorher"}, {"id": 210, "start": 2005.92, "end": 2018.04, "text": "sagen wir mal hier, ähm, Corona Location, äh, ne, wie hab ich's genannt, nicht Location,"}, {"id": 211, "start": 2018.04, "end": 2034.48, "text": "ich hab's wie genannt, äh, Corona Country, ok, so, so, und das Ding braucht eine ID,"}, {"id": 212, "start": 2034.48, "end": 2058.32, "text": "wie gesagt, Current, Current ist unser Latest, ähm, Breitengrad, Enggrad, Name ist der Name"}, {"id": 213, "start": 2058.32, "end": 2066.72, "text": "von dem Ding, Country Code is Code, so, ah, Quatsch, die Datentypen stehen mir hinten und"}, {"id": 214, "start": 2066.72, "end": 2092.0, "text": "vorne nicht, äh, Uint, ok, to Object, Uint, next, to Object Double, to Object, äh, Double,"}, {"id": 215, "start": 2092.0, "end": 2109.72, "text": "so, ist das ein Programm oder ne Seite, was, das hier, das ist ein Texteditor, also Texteditor,"}, {"id": 216, "start": 2109.72, "end": 2114.12, "text": "so, also jetzt legen wir uns den Kram an und jetzt müssen wir hier nur noch durch alle"}, {"id": 217, "start": 2114.12, "end": 2122.52, "text": "History Einträge durchgehen und davon einen Corona, wie hab ich genannt, einen History Entry,"}, {"id": 218, "start": 2122.52, "end": 2131.76, "text": "ein Corona History Entry erstellen, ne, ein bisschen, vielleicht sollten wir noch Factory"}, {"id": 219, "start": 2131.76, "end": 2147.88, "text": "einbauen, dass es mehr nach Java aussieht, ähm, ok, das heißt, also ein Programm, ah,"}, {"id": 220, "start": 2147.88, "end": 2153.48, "text": "yes, excellent, ähm, das heißt, wir müssen jetzt hier alles durchgehen, nochmal ne Schleife"}, {"id": 221, "start": 2153.48, "end": 2163.48, "text": "machen und zwar alles durchgehen, was hier in, in der History drin steht, History, also"}, {"id": 222, "start": 2163.48, "end": 2171.72, "text": "sprich das da, was wir hier zurück kriegen, History, alles was da drin steht, müssen wir"}, {"id": 223, "start": 2171.72, "end": 2181.48, "text": "nochmal ne Schleife drüber machen, so, jetzt lassen wir uns, wir lassen uns jetzt mal nur"}, {"id": 224, "start": 2181.48, "end": 2190.08, "text": "den Kram ausgeben, wir lassen uns nur hier mal, den, den, die Fallzahlen ausgeben, äh,"}, {"id": 225, "start": 2190.08, "end": 2200.68, "text": "wie macht man das jetzt überhaupt, value, ne, name, key, äh, Moment, true, oh fuck,"}, {"id": 226, "start": 2200.68, "end": 2212.0, "text": "wie komm ich da jetzt überhaupt ran, äh, äh, warum hatten das Ding kein key und value,"}, {"id": 227, "start": 2212.0, "end": 2221.84, "text": "wer hat nicht das wieder ausgedacht, so ein Alex, I'm back, sehr schön, zwei Monate,"}, {"id": 228, "start": 2221.84, "end": 2247.16, "text": "danke schön, Subscriber, Moment, wie krieg ich da jetzt den Kram raus, äh, to object,"}, {"id": 229, "start": 2247.16, "end": 2273.24, "text": "ja zu welchem object, kann man machen, kann man sowas machen, sowas, ne oder, das wird"}, {"id": 230, "start": 2273.24, "end": 2301.6, "text": "nicht funktionieren, ne, j-object, und dann, ne, what the fuck, ok, eh, value, value, ne,"}, {"id": 231, "start": 2301.6, "end": 2309.52, "text": "true, value, Gott ist das beknackt, Alter, ich struggle immer mit diesem komischen Jason"}, {"id": 232, "start": 2309.52, "end": 2321.2, "text": "Pasa darum, ich weiß, ich glaub ich weiß woran es liegt, man muss, ich erinnere mich"}, {"id": 233, "start": 2321.2, "end": 2328.48, "text": "da gerade dran, man muss hier irgendwie den Kram vorher umstellen, name, value, genau,"}, {"id": 234, "start": 2328.48, "end": 2341.52, "text": "soll jetzt funktionieren, jetzt passt auf, ah, was, was machen wir, ich mach, ich mach"}, {"id": 235, "start": 2341.52, "end": 2346.04, "text": "doch irgendwas verkehrt, ich mach irgendwas verkehrt gerade, das ist gar kein Fehler"}, {"id": 236, "start": 2346.04, "end": 2358.76, "text": "von da unten, what, das Raum ist kaputt, was, ich caste irgendwas verkehrt, irgendwas mach"}, {"id": 237, "start": 2358.76, "end": 2366.24, "text": "ich kaputt, what, hä, das ging doch eben noch, btf, das ist so kompliziert, das ist jetzt"}, {"id": 238, "start": 2366.24, "end": 2387.72, "text": "gar nicht, wow, what, ach, guck mal da, manchmal, aber den Kram nur sinnlos, nur sinnlos copy"}, {"id": 239, "start": 2387.72, "end": 2397.2, "text": "paste, dann kann das nicht funktionieren, quai, drei monat, dankeschön, huge, und der"}, {"id": 240, "start": 2397.2, "end": 2406.32, "text": "Pro Gaming Sebi ist auch am Start, so viele nice subs, gibt es eine Corona Rest, ja, sowas"}, {"id": 241, "start": 2406.32, "end": 2411.24, "text": "in der Richtung, da frag ich grad den ganzen Kram ab, aber es gibt keine richtig gute,"}, {"id": 242, "start": 2411.24, "end": 2425.48, "text": "ok, weiter, weiter, also, so, jetzt müssen wir den Kram rückgängig machen, so, mal gucken,"}, {"id": 243, "start": 2425.48, "end": 2432.92, "text": "ob es jetzt funktioniert, ah, jetzt klappt es, guckt, jetzt funktioniert es, so, das"}, {"id": 244, "start": 2432.92, "end": 2441.2, "text": "heißt jetzt haben wir die history, die Corona history, die kriegt jetzt neue Liste, und"}, {"id": 245, "start": 2441.2, "end": 2455.96, "text": "da schreiben wir jetzt den Kram rein, Corona history, history, add, ah, Quatsch, ah Gott,"}, {"id": 246, "start": 2455.96, "end": 2472.72, "text": "heißt drauf, Liste warum auch nicht, ah, add, Corona history, das heißt da kommt jetzt rein"}, {"id": 247, "start": 2472.72, "end": 2480.84, "text": "ein Corona history entry, und das besteht aus einem Counter, das ist value, also ne,"}, {"id": 248, "start": 2480.84, "end": 2492.32, "text": "was ist das da, also sprich der zweite Wert ist das, Tazer hat zwei Abos verschenkt, nice,"}, {"id": 249, "start": 2492.32, "end": 2500.52, "text": "dankeschön, huge, richtig, richtiger Sub, kein Primal, so, value, dann haben wir hier"}, {"id": 250, "start": 2500.52, "end": 2513.4, "text": "noch das aktuelle Datum, und das ist datetime, pass, und zwar e-name, und jetzt bin ich mal"}, {"id": 251, "start": 2513.4, "end": 2517.92, "text": "gespannt, ob der Kram funktioniert, den ich hier gebastelt hab, das müssen wir noch zu"}, {"id": 252, "start": 2517.92, "end": 2528.32, "text": "einem int-kasten, so, gucken, ob das funktioniert, mal gucken, ob es ohne Fehler durchläuft,"}, {"id": 253, "start": 2528.32, "end": 2533.36, "text": "wahrscheinlich schon, okay, das ist nice, gut, jetzt haben wir den ganzen Kram hier"}, {"id": 254, "start": 2533.36, "end": 2538.24, "text": "rausgepasst, jetzt können wir es eigentlich in der Datenbank speichern, das heißt wir"}, {"id": 255, "start": 2538.24, "end": 2546.88, "text": "sagen jetzt hier, service, add db-kontext, so, unsere db-kontext, eine Sache brauchen"}, {"id": 256, "start": 2546.88, "end": 2551.36, "text": "wir hier noch im db-kontext, eine Sache, die ich immer vergesse, und zwar deswegen guck"}, {"id": 257, "start": 2551.36, "end": 2560.24, "text": "ich die jetzt ab, weil ich die immer vergesse, muss ich mal kurz in mein GitLab gehen und"}, {"id": 258, "start": 2560.24, "end": 2571.92, "text": "schauen, weil ich mir das nie merken kann, und zwar muss der Kram so aussehen, kann"}, {"id": 259, "start": 2571.92, "end": 2577.36, "text": "ich mir nie merken, so, so ein paar Sachen, die ich mir nicht merken kann, hab ich mir"}, {"id": 260, "start": 2577.36, "end": 2581.16, "text": "mal irgendwo hin kopiert, dass ich mir irgendwann mal merken kann vielleicht, so, jetzt leg"}, {"id": 261, "start": 2581.16, "end": 2586.72, "text": "dann nämlich die Datenbank an, die den wahnsinnigen tollen Namen data.database hat, dass man sofort"}, {"id": 262, "start": 2586.72, "end": 2603.12, "text": "weiß, was drinnen ist, db-set aus corona country, countries, so, sehr schön, was meckert"}, {"id": 263, "start": 2603.12, "end": 2613.52, "text": "da hier, never instantiated, ich weiß, so, add db-kontext, gut, jetzt kann ich mir den"}, {"id": 264, "start": 2613.52, "end": 2619.96, "text": "hier injecten, den db-kontext, und kann den Kram, den wir von der API abrufen, speichern,"}, {"id": 265, "start": 2619.96, "end": 2627.04, "text": "vorher muss ich allerdings sagen, database, erstmal gucken, dass auf jeden Fall der Kram"}, {"id": 266, "start": 2627.04, "end": 2644.84, "text": "erstellt ist, und danach kann ich den Kram adden, quasi hier corona countries add, so,"}, {"id": 267, "start": 2644.84, "end": 2648.64, "text": "und jetzt schreibt er den Kram in die Datenbank, und hier speichere ich es, und jetzt sollte"}, {"id": 268, "start": 2648.64, "end": 2653.92, "text": "ich eine Datenbank haben, wo mein ganzes Corona Zeug drin steht, falls ich das mehrfach starten"}, {"id": 269, "start": 2653.92, "end": 2658.76, "text": "muss, sag ich jetzt erstmal hier, deleted, und danach wird er angelegt, schauen wir mal,"}, {"id": 270, "start": 2658.76, "end": 2667.68, "text": "ob das ganze jetzt funktioniert, ob es ohne Fehler durchläuft, anscheinend schon, der"}, {"id": 271, "start": 2667.68, "end": 2674.68, "text": "Tainser sagt, ich considere derzeit, ein sehr schöner Satz, von GitLab zu GitHub zu wechseln"}, {"id": 272, "start": 2674.68, "end": 2679.32, "text": "wegen den Actions, denkst du, das ist erst ein smart move, weil es gar nicht vielleicht"}, {"id": 273, "start": 2679.32, "end": 2685.84, "text": "schwer, dass migraten ist, alter was nen Satz, was nen Satz, oh der Hype Train war erfolgreich"}, {"id": 274, "start": 2685.84, "end": 2691.08, "text": "Leute, huge poggers, ja wenn du Actions brauchst, und die Actions lieber besser gefällt als"}, {"id": 275, "start": 2691.08, "end": 2698.12, "text": "das GitHub CI, warum nicht, ich mein, es ist ja nicht so schwierig, Git Projekte, du addest"}, {"id": 276, "start": 2698.12, "end": 2706.4, "text": "ein zweites Remote und pusht den Kram und fertig, also ist ja nicht so, als wäre GitHub,"}, {"id": 277, "start": 2706.4, "end": 2711.12, "text": "als wäre Git Projekte irgendwie schwierig, du kannst einfach beides Übergangsweise benutzen,"}, {"id": 278, "start": 2711.12, "end": 2717.12, "text": "du kannst ja mehrere Remotes hinzufügen in dein Repo, fügst du einfach noch dein GitHub,"}, {"id": 279, "start": 2717.12, "end": 2723.68, "text": "dein GitHub, nimm dein GitHub, Remote hinzu und gut ist, hab ich denn nen ordentlichen"}, {"id": 280, "start": 2723.68, "end": 2729.56, "text": "Datenbank Browser, um mal in die Datenbank rein zu gucken jetzt hier, DB, wie heißt"}, {"id": 281, "start": 2729.56, "end": 2737.32, "text": "der Kram, DB, was gibt's nen schönen, nen schönen SQLite Browser für Linux, was gibt's"}, {"id": 282, "start": 2737.32, "end": 2751.36, "text": "denn da, gibt's da was schönes, DB Visualizer, ach guck mal, es gibt ja sogar den offiziellen"}, {"id": 283, "start": 2751.36, "end": 2760.12, "text": "SQLite Browser, hab ich sogar installiert, konnte mich bloß noch mal dran erinnern, ok,"}, {"id": 284, "start": 2760.12, "end": 2767.56, "text": "Open, nach Stream, Corona, Corona, DB, guck mal, was da drinne ist, huge, alles drinne"}, {"id": 285, "start": 2767.56, "end": 2787.8, "text": "Leute, hat importiert, guck mal mal nach Deutschland, äh, ist irgendwie nicht so ganz, Germany 4585,"}, {"id": 286, "start": 2787.8, "end": 2793.2, "text": "ja das ist die aktuelle Version, die aktuelle Variante hier, die man aus den Daten kriegt,"}, {"id": 287, "start": 2793.2, "end": 2801.52, "text": "in Wirklichkeit sind sie wohl mehr, ne, das sieht jeder, ich glaub die ersten 25 Subs"}, {"id": 288, "start": 2801.52, "end": 2812.6, "text": "oder so haben sowas neben am Namen, das Sebaro hat das auch, es gibt noch ein paar, ich glaub"}, {"id": 289, "start": 2812.6, "end": 2831.28, "text": "der Zero des Max hat's auch, ein paar haben's, das stimmt, der Sebaro war der allererste"}, {"id": 290, "start": 2831.28, "end": 2843.44, "text": "Sub, ja, der Silent Pain, genau, der hab ich jetzt ganz vergessen, ich glaub 25 Leute haben"}, {"id": 291, "start": 2843.44, "end": 2848.4, "text": "das, gut, der Kram ist importiert, das hat funktioniert, das heißt, nachdem unsere Datenbank"}, {"id": 292, "start": 2848.4, "end": 2853.64, "text": "jetzt befüllt ist, können wir den ganzen Mist erstmal wieder auskommentieren, hat sich wahnsinnig"}, {"id": 293, "start": 2853.64, "end": 2859.76, "text": "gelohnt, dass wir den ganzen Kram programmiert haben, ähm, aber jetzt ist ja der Kram in"}, {"id": 294, "start": 2859.76, "end": 2864.08, "text": "der Datenbank drinnen und jetzt können wir gucken, dass wir das über unsere AP abgefragt"}, {"id": 295, "start": 2864.08, "end": 2871.2, "text": "kriegen, so, dann nehmen wir unseren Corona Controller, hat leider nicht den DB Tool integriert"}, {"id": 296, "start": 2871.2, "end": 2881.36, "text": "möglich, ne, hab ich aber ausgeschaltet, ähm, Corona Country liefern wir zurück eine Liste"}, {"id": 297, "start": 2881.36, "end": 2892.12, "text": "vor, und da brauch ich erstmal meinen Datenbank Kontext, dass das überhaupt funktioniert,"}, {"id": 298, "start": 2892.12, "end": 2905.96, "text": "so, Return, Countries, Bäm, gut, das ist nice, jetzt starten wir das, bzw. wir mussten"}, {"id": 299, "start": 2905.96, "end": 2910.12, "text": "es ja gar nicht starten, weil sich das automatisch startet, weil wir hier einen Watch haben,"}, {"id": 300, "start": 2910.12, "end": 2914.92, "text": "und jetzt fahren wir mal den Postman auf, oh, ich hab den Postman gar nicht installiert,"}, {"id": 301, "start": 2914.92, "end": 2920.24, "text": "Leute, was sollen wir installieren, Postman oder Postwoman, das ist jetzt kein Witz und"}, {"id": 302, "start": 2920.24, "end": 2929.76, "text": "auch kein Fremdschirmwitz, das gibt's wirklich, aber anscheinend gibt's da keine Pakete dafür,"}, {"id": 303, "start": 2929.76, "end": 2939.32, "text": "Postman, Postwoman, es gibt beides, es gibt beide Projekte, ja, ich weiß nicht warum,"}, {"id": 304, "start": 2939.32, "end": 2948.8, "text": "man sich da an dem Namen so gestört hat, achso, das eine ist rein Browser basiert, oder wie,"}, {"id": 305, "start": 2948.8, "end": 2954.72, "text": "das ist Postwoman, was halt mit einem Alien-Kopf dran ist, warum auch immer, aber dann installieren"}, {"id": 306, "start": 2954.72, "end": 2962.4, "text": "wir mal Postman, äh, Postman, Posthentai, das sind wir auch, das war, das war ja klar,"}, {"id": 307, "start": 2962.4, "end": 2990.52, "text": "so, oh nee, das ist nix für mich, Patrick, geh mal fort."}, {"id": 308, "start": 2992.64, "end": 2998.0, "text": "So, es wäre jetzt natürlich sehr nice, wenn der Kram, Pearl, IGIT, wenn ich eine Sache"}, {"id": 309, "start": 2998.0, "end": 3003.2, "text": "noch weniger mag als Java, dann ist es Pearl, ich weiß aber, dass mein Paketmanager auf"}, {"id": 310, "start": 3003.2, "end": 3025.88, "text": "Pearl-Basis ist, Pearl, die einzige Write-Only-Programmiersprache, vielleicht nehmen wir Brainfuck, ich sag mal,"}, {"id": 311, "start": 3025.88, "end": 3034.72, "text": "was macht der denn da, installiert er jetzt das halbe Internet, oder was, was macht der"}, {"id": 312, "start": 3034.72, "end": 3050.32, "text": "da so lang, Arch, by the way, was zum Teufel macht der da, der macht nichts, der macht"}, {"id": 313, "start": 3050.32, "end": 3070.4, "text": "ein Package, er stript gerade, ja, exzellent Musik, ja, jetzt wird noch compressed, da wird"}, {"id": 314, "start": 3070.4, "end": 3074.96, "text": "kein Move, liegt bestimmt alles nur daran, dass es ein Pearl-Programm ist, wobei man ja"}, {"id": 315, "start": 3074.96, "end": 3080.6, "text": "gesehen hat, dass das überhaupt nicht das Programm selber macht, oh, jetzt wird gepackt,"}, {"id": 316, "start": 3080.6, "end": 3087.84, "text": "CPU, äh, CPU, wie viel, wie viel Kerne hat meine, ich hab vier Kerne der VM gegeben,"}, {"id": 317, "start": 3087.84, "end": 3095.36, "text": "kein Wunder, dass das so wahnsinnig schnell ist, das braucht mindestens zwölf Kerne,"}, {"id": 318, "start": 3095.36, "end": 3110.0, "text": "auch die Musik, ihh, die Musik hört sich aber jetzt kaputt an, ah, besser, yes, exzellent,"}, {"id": 319, "start": 3110.0, "end": 3118.36, "text": "drei Stunden Paket installieren, das kann Windows ja besser, ich hab wirklich keinen"}, {"id": 320, "start": 3118.36, "end": 3123.92, "text": "Plan, was er da gerade so lange macht, er packt, der packt das wahrscheinlich dreimal"}, {"id": 321, "start": 3123.92, "end": 3132.48, "text": "ein und aus, aber warum macht er das, man weiß es nicht, wahrscheinlich erstmal Virus"}, {"id": 322, "start": 3132.48, "end": 3143.92, "text": "installieren, the fuck, das kann man nicht mal richtig weitermachen, ah, jetzt ist er"}, {"id": 323, "start": 3143.92, "end": 3156.88, "text": "fertig, yes, 240 MB, das ist ja nix, Rootkit ist raus, Postman, da ist er, also, von der"}, {"id": 324, "start": 3156.88, "end": 3167.96, "text": "Idee her sollte ich jetzt, wenn ich eine Abfrage mache, gegen Localhost Port 5000, sollte ich"}, {"id": 325, "start": 3167.96, "end": 3177.6, "text": "auf Corona, sollte ich den Kamer als Antwort kriegen, da ist es, bam, das kommt jetzt"}, {"id": 326, "start": 3177.6, "end": 3182.44, "text": "lokal aus meiner Datenbank, das heißt ich muss nicht mehr diese komische API hier aufrufen,"}, {"id": 327, "start": 3182.44, "end": 3189.24, "text": "das ist natürlich praktisch, funktioniert, das heißt jetzt können wir uns unserem Frontend"}, {"id": 328, "start": 3189.24, "end": 3200.88, "text": "widmen, Dinge die beim ersten mal funktionieren geht nicht, naja, es hat ja nicht alles beim"}, {"id": 329, "start": 3200.88, "end": 3207.04, "text": "ersten mal funktioniert, gut, ach ja, ich hab grad was gesehen, was noch gefehlt hat,"}, {"id": 330, "start": 3207.04, "end": 3223.04, "text": "ist euch aufgefallen, ist euch aufgefallen was noch gefehlt hat, was fehlt hier noch,"}, {"id": 331, "start": 3223.04, "end": 3230.28, "text": "die History fehlt noch, ich brauch ja auch die History im Frontend dann, deswegen muss"}, {"id": 332, "start": 3230.28, "end": 3239.28, "text": "ich jetzt sagen noch, Include History und das geile ist, Leute, pass mal auf, das ist"}, {"id": 333, "start": 3239.28, "end": 3247.12, "text": "echt so eines der besten, so der besten.NET Core Tips ever, wenn ich jetzt Speichern drücke,"}, {"id": 334, "start": 3247.12, "end": 3250.48, "text": "dann startet er sich hier im Hintergrund neu und seht ihr, ich muss nix machen, ich klicke"}, {"id": 335, "start": 3250.48, "end": 3255.04, "text": "jetzt einfach nochmal auf Send, er hat sich im Hintergrund neu gestartet und jetzt ist"}, {"id": 336, "start": 3255.04, "end": 3273.32, "text": "alles dabei, einfach mal 100, wie viel, der Scroll Balken ist weg, Leute, ja, da ist er,"}, {"id": 337, "start": 3273.32, "end": 3278.44, "text": "der Scroll Balken, kommst du her, der Scroll Balken ist kaputt, guck mal, ich kann doch"}, {"id": 338, "start": 3278.44, "end": 3286.0, "text": "nicht mal runter scrollen, so viel Zeugs ist da drinnen, der Scroll Balken macht das nicht"}, {"id": 339, "start": 3286.0, "end": 3293.88, "text": "mit und von der Idee her würde ich den Kram ja auch nicht direkt auf der Startseite abrufen,"}, {"id": 340, "start": 3293.88, "end": 3303.08, "text": "ich bin ja gerade mit dem Kollegen dabei eine App zu basteln für einen Lokal, also keine"}, {"id": 341, "start": 3303.08, "end": 3308.48, "text": "App im eigentlichen Sinne, eine Website, die man aber auch ordentlich mobil verwenden kann"}, {"id": 342, "start": 3308.48, "end": 3317.52, "text": "für einen lokalen Heizungsinstallateur Service, weil aktuell machen die das so, die gehen"}, {"id": 343, "start": 3317.52, "end": 3322.52, "text": "in ihre, die haben irgendwie eine riesen Excel Tabelle, machen Termine mit den Leuten aus"}, {"id": 344, "start": 3322.52, "end": 3326.4, "text": "und machen so die Routenplanung von Hand und wir haben gesagt, wir können es einfach so"}, {"id": 345, "start": 3326.4, "end": 3330.88, "text": "machen, wir exportieren eure Kundendaten und ihr sagt, welche Kunden ihr besuchen müsst"}, {"id": 346, "start": 3330.88, "end": 3337.2, "text": "und das Ding berechnet euch eine, nicht für meinen Heizungstypen und das Ding berechnet"}, {"id": 347, "start": 3337.2, "end": 3343.04, "text": "euch einfach die optimale Reihenfolge, na optimal geht ja nicht, eine nahezu optimale"}, {"id": 348, "start": 3343.04, "end": 3350.36, "text": "Reihenfolge, in welcher Reihenfolge ihr die Kunden besuchen müsst, von der Entfernung"}, {"id": 349, "start": 3350.36, "end": 3357.6, "text": "her, so wie bin ich jetzt drauf gekommen, genau und da mach ich das so, da mach ich das"}, {"id": 350, "start": 3357.6, "end": 3364.2, "text": "über CraftQL, das ist der neueste Shit, Alter, CraftQL, die Abfrage von Daten, ist recht"}, {"id": 351, "start": 3364.2, "end": 3370.96, "text": "praktisch, weil die haben irgendwie 50.000 Kundendaten, sonst war es da am Start und"}, {"id": 352, "start": 3370.96, "end": 3377.16, "text": "wenn ich das alles auf eine Seite laden würde, wäre ein bisschen viel, aber in dem Fall glaube"}, {"id": 353, "start": 3377.16, "end": 3389.28, "text": "ich, brauchen wir das hier nicht und da mit Routen per Google Maps, das war eines der Gründe,"}, {"id": 354, "start": 3389.28, "end": 3393.72, "text": "warum ich heute Morgen nach einem ordentlichen Geocoding Service gefragt habe, aktuell haben"}, {"id": 355, "start": 3393.72, "end": 3401.48, "text": "wir einen Google Business Account gemacht und auch schon mal probiert ein bisschen, funktioniert"}, {"id": 356, "start": 3401.48, "end": 3409.88, "text": "ganz gut, aber eine kostenlose Lösung wäre halt nice, ist auch kein Problem, ist auch"}, {"id": 357, "start": 3409.88, "end": 3413.96, "text": "kein Problem, weil die Routenberechnung machen wir über Google, machen wir eh nicht darüber,"}, {"id": 358, "start": 3413.96, "end": 3418.92, "text": "die Routenberechnung macht ihr in ihr Navi, es geht bloß in die Richtung, in welcher Reihenfolge"}, {"id": 359, "start": 3418.92, "end": 3425.8, "text": "sie die Termine machen müssen, Webbox bezahlt man auch, ja ich muss mal gucken, ich muss"}, {"id": 360, "start": 3425.8, "end": 3434.08, "text": "mal gucken, ich weiß nicht ob ich euch die App zeigen darf jetzt, ob oder was dagegen"}, {"id": 361, "start": 3434.08, "end": 3444.6, "text": "hat, sonst hätte ich euch mal gezeigt, ja OpenStreetMap, ich nehme aktuell OpenStreetMap,"}, {"id": 362, "start": 3444.6, "end": 3451.44, "text": "ich habe mir einen Jason exportiert mit allen Postleitzahlen und Städten in Deutschland,"}, {"id": 363, "start": 3451.44, "end": 3455.36, "text": "das heißt für das Autocomplete Feld, das ist relativ easy an der Stelle, aber sobald"}, {"id": 364, "start": 3455.36, "end": 3462.08, "text": "Straßen dazukommen wird es halt eine ganze Ecke komplizierter und die Routenberechnung"}, {"id": 365, "start": 3462.08, "end": 3467.36, "text": "mache ich mit einem anderen Open Source Projekt, das macht die Routenberechnung für mich,"}, {"id": 366, "start": 3467.36, "end": 3472.04, "text": "ich mache das ja nicht selbst, ich mache hier kein, es ist ja quasi nicht nur Traveling"}, {"id": 367, "start": 3472.04, "end": 3477.44, "text": "Salesman, es ist Traveling Salesman mit mehreren Fahrzeugen und Zeitfenstern, das programmiere"}, {"id": 368, "start": 3477.44, "end": 3483.44, "text": "ich doch nicht selbst, das bin ich verrückt, dann nehme ich was was fertig ist, was das"}, {"id": 369, "start": 3483.44, "end": 3491.32, "text": "schon kann, das mache ich doch nicht selbst, ich glaube es geht los, ich habe übrigens"}, {"id": 370, "start": 3491.32, "end": 3496.56, "text": "festgestellt, es ist mir gerade wo ich hier gelabert habe, wo heißt das Ding, verrate"}, {"id": 371, "start": 3496.56, "end": 3505.76, "text": "ich nicht, mir ist noch eine Sache aufgefallen, was fail ist von dem was ich hier gebastelt"}, {"id": 372, "start": 3505.76, "end": 3513.64, "text": "habe, was richtig fail ist und zwar guck mal, die glaube ich zumindest, die Reihenfolge"}, {"id": 373, "start": 3513.64, "end": 3520.28, "text": "der Tage stimmt nicht, wie mache ich das, also am besten wäre natürlich wenn ich beim"}, {"id": 374, "start": 3520.28, "end": 3528.04, "text": "Importieren die Reihenfolge der Tage richtig mache, habt ihr die angesprochen oder sich"}, {"id": 375, "start": 3528.04, "end": 3535.72, "text": "beauftragt, das ist in dem Fall ganz einfach, halbe halbe, der Chef dem die Firma gehört"}, {"id": 376, "start": 3535.72, "end": 3544.12, "text": "ist ein Freund aus der Schule von meinem Kollege und er hat ihm wahrscheinlich erzählt, dass"}, {"id": 377, "start": 3544.12, "end": 3547.68, "text": "man da was viel praktisches programmieren könnte und der hat ihn dann beauftragt, so"}, {"id": 378, "start": 3547.68, "end": 3560.8, "text": "rum, also halbe halbe, ich muss den Kram übrigens noch sortieren und jetzt stehe ich ein bisschen"}, {"id": 379, "start": 3560.8, "end": 3564.12, "text": "auf dem Schlauch, wie mache ich das jetzt am besten, ich meine ich kann jetzt hier sagen"}, {"id": 380, "start": 3564.12, "end": 3570.36, "text": "order by, aber das funktioniert nicht, ich müsste jetzt hier sagen order by, aber das"}, {"id": 381, "start": 3570.36, "end": 3582.64, "text": "funktioniert auch nicht, wie mache ich das jetzt richtig, wie sortiere ich, wie sortiere"}, {"id": 382, "start": 3582.64, "end": 3592.64, "text": "ich die history, also das hier ist ja quasi so ein Subquery unter der Haube in der Datenbank,"}, {"id": 383, "start": 3592.64, "end": 3602.52, "text": "ein Subselect ist das hier ja unter der Haube im Endeffekt, wie mache ich denn das jetzt,"}, {"id": 384, "start": 3602.52, "end": 3610.0, "text": "weil was ich von der Theorie her muss ich jetzt den Kram hier sortieren, ok, noch mal"}, {"id": 385, "start": 3610.0, "end": 3624.12, "text": "so Result und dann, wir machen erstmal eine Liste drauf, dass kein Datenbankkram mehr ist,"}, {"id": 386, "start": 3624.12, "end": 3628.28, "text": "ja genau ich werde es auch nachher sortieren, also ich frage es dir erstmal ab und sortier"}, {"id": 387, "start": 3628.28, "end": 3633.68, "text": "es jetzt quasi so post-processing-mäßig, das macht dann halt nicht die Datenbank oder"}, {"id": 388, "start": 3633.68, "end": 3639.72, "text": "so, aber kann sich auch gar nicht, weil ich habe es ja da gar nicht gesortet gespeichert,"}, {"id": 389, "start": 3639.72, "end": 3653.12, "text": "ne gut, können wir ja mal machen, also das heißt ich sage jetzt hier Result, also irgendwie"}, {"id": 390, "start": 3653.12, "end": 3670.56, "text": "was gibt es auch, for each oder aggregate, ne kommt for each, das ist aber nicht schön,"}, {"id": 391, "start": 3670.56, "end": 3699.12, "text": "history, order by, date, so was in der Richtung, geht das, ah return value is not used, so,"}, {"id": 392, "start": 3699.12, "end": 3714.68, "text": "boah das ist aber echt unschön jetzt, wenn funktionieren wird es wahrscheinlich, aber"}, {"id": 393, "start": 3714.68, "end": 3732.88, "text": "schön ist es nicht, user123698745, absolut high IQ Username, Dankeschön für den Zapp,"}, {"id": 394, "start": 3732.88, "end": 3746.04, "text": "PgRooting habe ich ja nie gehört, ich weiß es gibt einen OpenStreetMaps, Postgres Export"}, {"id": 395, "start": 3746.04, "end": 3753.92, "text": "so es ist jetzt sortiert, erster 23 jetzt ist es sortiert, guck, jetzt funktioniert, aber"}, {"id": 396, "start": 3753.92, "end": 3758.72, "text": "schön ist es hier nicht, erstmal alles abfragen, um es danach nochmal neu zu sortieren, schön"}, {"id": 397, "start": 3758.72, "end": 3765.88, "text": "ist das nicht, also ich müsste das beim Import schon richtig speichern, müsste das eigentlich"}, {"id": 398, "start": 3765.88, "end": 3771.36, "text": "beim Import einmalig sortieren hier, also ich müsste quasi hier sowas sagen, history und"}, {"id": 399, "start": 3771.36, "end": 3783.72, "text": "hier sort, also quasi, egal wir lassen es jetzt so, wir lassen es jetzt, funktioniert"}, {"id": 400, "start": 3783.72, "end": 3790.52, "text": "ja, so viele Datensätze sind es jetzt auch nicht, dass es jetzt wahnsinnig langsam wäre,"}, {"id": 401, "start": 3790.52, "end": 3796.8, "text": "ok jetzt kriege ich den Kram zurück, gut jetzt können wir mit unserem Frontend anfangen,"}, {"id": 402, "start": 3796.8, "end": 3822.6, "text": "wir machen eine neue Frontend App, und zwar Stream, oh die Musik ist nice, ok, ok, ok,"}, {"id": 403, "start": 3822.6, "end": 3837.0, "text": "ok, jetzt haben wir den Kram sortiert, so jetzt müssen wir ein neues Frontend anlegen, also"}, {"id": 404, "start": 3837.0, "end": 3846.12, "text": "View, Create, Client App, ah nee, Moment ich hab noch was vergessen, wir machen erstmal"}, {"id": 405, "start": 3846.12, "end": 3859.68, "text": "einen Git Repo aus der ganzen Sache, Git Init, Git Init, so und da kopiere ich jetzt mal ein"}, {"id": 406, "start": 3859.68, "end": 3866.92, "text": "ordentliches Git Ignore rein, was ich mir jetzt auch mal aus meinem anderen Projekt klaue,"}, {"id": 407, "start": 3866.92, "end": 3892.8, "text": "dass ich nicht unnötig viel Zeugs da drinnen einchecke, so, Git Commit A-M, Git Init, sehr"}, {"id": 408, "start": 3892.8, "end": 3902.56, "text": "schön, und jetzt gehen wir da rein und legen unsere Client App an, so, brauchen wir nicht,"}, {"id": 409, "start": 3902.56, "end": 3909.96, "text": "Linter Formatter, ha, null, alter, der braucht schon Linter, mein Code ist ohne Linter viel"}, {"id": 410, "start": 3909.96, "end": 3918.4, "text": "besser lesbar, Big Brain braucht, wenn man, ab einer gewissen Hirngröße braucht man"}, {"id": 411, "start": 3918.4, "end": 3941.92, "text": "kein Linter mehr, da lintet man quasi instinktiv, Git Ignore.io, ah, ah, yes, excellent, das"}, {"id": 412, "start": 3941.92, "end": 3948.6, "text": "ist wirklich praktisch, das kannte ich noch nicht, das ist wirklich praktisch, nee kein"}, {"id": 413, "start": 3948.6, "end": 3955.24, "text": "TypeScript, nee hör mal auf, ich will es nicht komplizierter machen als ohnehin, so,"}, {"id": 414, "start": 3955.24, "end": 3966.28, "text": "reicht, reicht, wir machen den Router rein und Statemanager, das reicht, PWA Support,"}, {"id": 415, "start": 3966.28, "end": 3971.84, "text": "nee nicht wirklich, wozu, nein, wollen wir nicht, wir wollen kein History Mode, alles"}, {"id": 416, "start": 3971.84, "end": 3977.28, "text": "ins Package Jason rein und auch nicht speichern, for future projects, jetzt installieren wir"}, {"id": 417, "start": 3977.28, "end": 3982.8, "text": "erstmal das halbe Internet, weil das ist JavaScript, JavaScript funktioniert ohne das halbe Internet"}, {"id": 418, "start": 3982.8, "end": 3990.2, "text": "nicht, und die restliche andere Hälfte des Internets funktioniert ohne JavaScript nicht,"}, {"id": 419, "start": 3990.2, "end": 3996.6, "text": "das heißt man braucht immer das 100% des Internets, ja, Sebaro habe ich heute morgen"}, {"id": 420, "start": 3996.6, "end": 4000.32, "text": "noch erzählt, ich habe einen halben Schrank voller Nudeln, immer, CloPop hier habe ich"}, {"id": 421, "start": 4000.32, "end": 4016.32, "text": "noch 5-6 Packungen im Vorratsschrank, also reicht alles, so, enden wir den Kram mal,"}, {"id": 422, "start": 4016.32, "end": 4024.4, "text": "Huge Comet, Big Brain Comets, gut, also, und jetzt können wir folgendes machen, hier"}, {"id": 423, "start": 4024.4, "end": 4039.2, "text": "oben, hier oben läuft der, das Backend und hier unten läuft das Frontend, das heißt"}, {"id": 424, "start": 4039.2, "end": 4046.96, "text": "wir gehen jetzt hier unten hin, sagen Yarn Surf und schon, ah nee, wir müssen, wobei"}, {"id": 425, "start": 4046.96, "end": 4052.96, "text": "nee, erstmal okay, so und schon kann ich mal meine IDE woanders hinschieben, wir machen"}, {"id": 426, "start": 4052.96, "end": 4058.2, "text": "Visual Studio Code auf, ach nee, wir haben ja, wir haben jetzt ja die Open Source Variante"}, {"id": 427, "start": 4058.2, "end": 4064.48, "text": "davon, die ohne Microsoft gedönnt, warum habe ich das nochmal installiert, ich weiß es"}, {"id": 428, "start": 4064.48, "end": 4077.2, "text": "gar nicht mehr, so und jetzt haben wir hier unser Frontend am Start, Source, Main App,"}, {"id": 429, "start": 4077.2, "end": 4084.12, "text": "alles gut, wir sind natürlich gleich mal so hart drauf und hauen nochmal ein ordentliches"}, {"id": 430, "start": 4084.12, "end": 4089.44, "text": "Frontend Framework mit drauf, also für CSS und Buttons und User Elemente, ob wir es"}, {"id": 431, "start": 4089.44, "end": 4101.68, "text": "brauchen, keine Ahnung, Moment, wie ging das nochmal, kann man das immer nicht merken,"}, {"id": 432, "start": 4101.68, "end": 4109.0, "text": "das macht man immer einmal zum Projekt und dann nie wieder, ja, View, Add, genau, dann"}, {"id": 433, "start": 4109.0, "end": 4114.12, "text": "sieht das auch alles ein bisschen hübscher aus, nee, das haben wir uns noch nicht angeguckt,"}, {"id": 434, "start": 4114.12, "end": 4120.96, "text": "Tommy, das haben wir uns noch nicht angeguckt, Default, ah yes, excellent."}, {"id": 435, "start": 4120.96, "end": 4147.48, "text": "So, sehr schön und so Kram wie Node Modules sollte der gar nicht adden da drinnen, gut,"}, {"id": 436, "start": 4147.48, "end": 4150.36, "text": "dann gucken wir uns mal unser Frontend an, wie das so ausschaut jetzt, das ist natürlich"}, {"id": 437, "start": 4150.36, "end": 4154.36, "text": "noch das Default Template, da schmeißen wir jetzt so gut wie alles raus, was hältst du"}, {"id": 438, "start": 4154.36, "end": 4163.0, "text": "von Webstorm, ich habs mir kurz mal angeguckt, es hat mich jetzt nicht so vom Hocker gehauen,"}, {"id": 439, "start": 4163.0, "end": 4166.28, "text": "dass ich es instant benutzen wollte, aber man braucht immer eine Weile bis man da durch"}, {"id": 440, "start": 4166.28, "end": 4185.12, "text": "pikt, ich hab kein Chrome installiert, was ist das denn, Abmahnung ist raus, warum hab"}, {"id": 441, "start": 4185.12, "end": 4204.32, "text": "ich kein Chrome installiert, so, jetzt aber, ah yes, localhost port 80, nein Google, localhost,"}, {"id": 442, "start": 4204.32, "end": 4210.24, "text": "der localhost port 8080, da ist unsere Default App, die natürlich nichts macht außer Default"}, {"id": 443, "start": 4210.24, "end": 4221.88, "text": "zu sein, git, settings, ich brauch meine Schriftart, wuah, wuah, warum hab ich meine Schriftart"}, {"id": 444, "start": 4221.88, "end": 4248.92, "text": "hier nicht, Font, ja, 22 und zwar Hack, vielleicht auch nur 20, wie groß, hör mal 18, ah so ist"}, {"id": 445, "start": 4248.92, "end": 4256.76, "text": "das doch gut, aber 18 ist mir fast ein bisschen klein, 19, ja so ist das doch schick, ist"}, {"id": 446, "start": 4256.76, "end": 4267.72, "text": "das Hack jetzt, machen wir was anderes rein, ja das ist anscheinend doch, ach lassen wir"}, {"id": 447, "start": 4267.72, "end": 4280.44, "text": "das so, gut, so jetzt wollen wir mal Tabs gucken, ja wir haben das ja letztens runtergeschmissen,"}, {"id": 448, "start": 4280.44, "end": 4284.4, "text": "Tab size, wir haben ja das andere Visual Studio runtergeschmissen, das heißt ich hab hier"}, {"id": 449, "start": 4284.4, "end": 4289.6, "text": "nichts installiert für drinnen, zumindest also keine Config Datei, Extensions haben"}, {"id": 450, "start": 4289.6, "end": 4297.2, "text": "wir aber die wichtigen Sachen installiert, ok, so, defaultmäßig wir schmeißen jetzt"}, {"id": 451, "start": 4297.2, "end": 4303.0, "text": "erstmal diesen ganzen Crap raus, App Bar, was auch immer, hast du nicht gesehen, alles"}, {"id": 452, "start": 4303.0, "end": 4307.76, "text": "fort und das geile ist, ich muss jetzt auch nur hier speichern und zack, aktualisiert"}, {"id": 453, "start": 4307.76, "end": 4320.4, "text": "sich das ganze, Import Hello World from, ah piss dich, weg, weg, so, so ist das schön,"}, {"id": 454, "start": 4320.4, "end": 4327.48, "text": "erstmal alle schön, schön leer, ehm, gucken wir mal ob der da überhaupt eben das Content"}, {"id": 455, "start": 4327.48, "end": 4339.48, "text": "weg, ok, Inhalt funktioniert noch, Routen, Main, Main Routen, Home, About, About brauchen"}, {"id": 456, "start": 4339.48, "end": 4348.96, "text": "wir grad nicht, kommt fort, erstmal ein bisschen aufräumen mit Standard Zeug, eh Home brauchen"}, {"id": 457, "start": 4348.96, "end": 4361.24, "text": "wir aber, und damit Home funktioniert, müssen wir hier einen, oh wie ging das, Router View,"}, {"id": 458, "start": 4361.24, "end": 4373.04, "text": "Router View machen, oh, Moment wie ging der, oh fuck wie ging das nochmal, was, achso ich"}, {"id": 459, "start": 4373.04, "end": 4384.64, "text": "hab beides, sehr gut, sehr schön, so, Router View, Home, kommt hier auch noch raus, zack,"}, {"id": 460, "start": 4384.64, "end": 4399.6, "text": "zack, gut, so, jetzt haben wir den Kram aufgeräumt, was, was eine schwere Geburt, eh, Michael,"}, {"id": 461, "start": 4399.6, "end": 4404.0, "text": "du bist jetzt ja noch rechtzeitig, hast ja noch ein Stream erwischt, gut, jetzt haben"}, {"id": 462, "start": 4404.0, "end": 4420.76, "text": "wir alles, ganz wichtig wir müssen erstmal einen Button machen, warum geht denn der Button"}, {"id": 463, "start": 4420.76, "end": 4449.8, "text": "da nicht, warum ist das jetzt kein Button, oh, ah, da ist ein Button, what, warum geht"}, {"id": 464, "start": 4449.8, "end": 4464.36, "text": "der Button da nicht, hab ich jetzt irgendwas zu viel gelöscht, Low Brain, hab ich jetzt"}, {"id": 465, "start": 4464.36, "end": 4474.48, "text": "irgendwas zu viel gelöscht, warum, ich will mit der Map anfangen und mich nicht mit so"}, {"id": 466, "start": 4474.48, "end": 4489.24, "text": "stark rumschlagen müssen, könnte das das Problem sein, weil das im Content ist, gute Frage,"}, {"id": 467, "start": 4489.24, "end": 4494.56, "text": "nächste Frage, ich hab garantiert irgendwas zu viel gelöscht, ich hab garantiert zu viel,"}, {"id": 468, "start": 4494.56, "end": 4517.36, "text": "irgendwas, irgendwas zu viel, ich hab keine Ahnung, echt mal funktionieren tut's ja, ah,"}, {"id": 469, "start": 4517.36, "end": 4542.36, "text": "was ist das wieder für JavaScript-Gefrickel, was ist das wieder für JavaScript-Gefrickel,"}, {"id": 470, "start": 4542.36, "end": 4552.4, "text": "was, ah Gott, gucken wir mal in die Konsole rein, was merkt ihr da denn hier rum, no such"}, {"id": 471, "start": 4552.4, "end": 4569.28, "text": "compute, what the fuck, es lebe Frontend-Kram, hä, what, was hab ich denn jetzt anders gemacht"}, {"id": 472, "start": 4569.28, "end": 4583.88, "text": "als vorher, was hab ich jetzt anders gemacht als vorher, vielleicht Cash-Problem, vielleicht,"}, {"id": 473, "start": 4583.88, "end": 4590.72, "text": "ja, ok, was auch immer, scheiß drauf, wir fangen jetzt mit der Karte an, also was brauchen"}, {"id": 474, "start": 4590.72, "end": 4597.6, "text": "wir, Leaflet, Leaflet, es gibt einen Leaflet Vue.js Rapper, aber den schenken wir uns"}, {"id": 475, "start": 4597.6, "end": 4601.6, "text": "erst mal und machen so mal ne Karte von Hand und schauen uns an, wie das Ganze ausschaut,"}, {"id": 476, "start": 4601.6, "end": 4618.6, "text": "äh, warte mal, was ist da unten los, äh, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 477, "start": 4618.6, "end": 4628.22, "text": "ok."}, {"id": 478, "start": 4678.6, "end": 4683.6, "text": "Musik"}, {"id": 479, "start": 4683.6, "end": 4688.6, "text": "Musik"}, {"id": 480, "start": 4688.6, "end": 4693.6, "text": "Musik"}, {"id": 481, "start": 4693.6, "end": 4698.6, "text": "Musik"}, {"id": 482, "start": 4698.6, "end": 4703.6, "text": "Musik"}, {"id": 483, "start": 4733.6, "end": 4735.6, "text": "Das war's für heute."}, {"id": 484, "start": 4735.6, "end": 4764.6, "text": "Das war's für heute."}, {"id": 485, "start": 4765.6, "end": 4776.6, "text": "So, ähm, ich muss grad runter."}, {"id": 486, "start": 4776.6, "end": 4778.6, "text": "Mein Nachbar war grad da."}, {"id": 487, "start": 4778.6, "end": 4782.6, "text": "Mein Nachbar war grad da, hat gesagt, er hat gegrillt und hat uns was mitgebracht."}, {"id": 488, "start": 4782.6, "end": 4786.6, "text": "Das heißt, wir müssen mal eine kurze Essensunterbrechung machen."}, {"id": 489, "start": 4786.6, "end": 4792.6, "text": "Und ich muss jetzt erstmal kurz was vortan, weil sonst kalt wird."}, {"id": 490, "start": 4792.6, "end": 4806.6, "text": "Ich hab jetzt hier zwei Würste und zwei so gegrillte Pepperoni oder sowas."}, {"id": 491, "start": 4806.6, "end": 4809.6, "text": "Also gucken wir mal ein bisschen Essenvideo und ich futter mach schnell was."}, {"id": 492, "start": 4809.6, "end": 4815.6, "text": "Der Beef Bagel Burger."}, {"id": 493, "start": 4815.6, "end": 4818.6, "text": "Kokona. Kokona Grill Sendung."}, {"id": 494, "start": 4818.6, "end": 4830.6, "text": "Wir gucken mal eine Runde Burger Grillen und ich ess mal kurz meine Wurst."}, {"id": 495, "start": 4830.6, "end": 4849.6, "text": "Also ich hör mal kurz hier Text."}, {"id": 496, "start": 4849.6, "end": 4857.6, "text": "Sollten wir den Kram noch mal in einer ordentlichen Größe machen."}, {"id": 497, "start": 4857.6, "end": 4882.6, "text": "Essen, Pause, zack."}, {"id": 498, "start": 4882.6, "end": 4888.6, "text": "Was? Was ist denn S-P-G?"}, {"id": 499, "start": 4888.6, "end": 4893.6, "text": "Wow, schmeckt gut aus, toll."}, {"id": 500, "start": 4893.6, "end": 4904.6, "text": "Die Pepperoni schmeckt echt gut."}, {"id": 501, "start": 4904.6, "end": 4912.6, "text": "Warum tut ihr das? Ich weiß es nicht."}, {"id": 502, "start": 4912.6, "end": 4921.6, "text": "Oh, Wurst."}, {"id": 503, "start": 4921.6, "end": 4935.6, "text": "What? Was ist jetzt los?"}, {"id": 504, "start": 4935.6, "end": 4947.6, "text": "Die haben Knall die Typen ey."}, {"id": 505, "start": 4947.6, "end": 4964.6, "text": "Es riecht gut."}, {"id": 506, "start": 4964.6, "end": 4970.6, "text": "Nicht? Normalerweise sagt er das immer."}, {"id": 507, "start": 4970.6, "end": 4988.6, "text": "Da jetzt."}, {"id": 508, "start": 4988.6, "end": 5007.6, "text": "300° sind 300°."}, {"id": 509, "start": 5007.6, "end": 5010.6, "text": "Die leben sehr gesund."}, {"id": 510, "start": 5010.6, "end": 5024.6, "text": "Ich hab letztens ein Video von ihm gesehen."}, {"id": 511, "start": 5024.6, "end": 5044.6, "text": "Dann."}, {"id": 512, "start": 5044.6, "end": 5050.6, "text": "Das wird es mir auch geben."}, {"id": 513, "start": 5050.6, "end": 5070.6, "text": "Ich hoffe ich schmatze euch nicht zu sehr ins Bauch."}, {"id": 514, "start": 5070.6, "end": 5086.6, "text": "Das sieht aber gut aus."}, {"id": 515, "start": 5086.6, "end": 5095.6, "text": "Das sieht gut aus."}, {"id": 516, "start": 5095.6, "end": 5114.6, "text": "Ich möchte es erstmal. Ich hab es ja nicht."}, {"id": 517, "start": 5114.6, "end": 5121.6, "text": "Wer soll das essen? WTF?"}, {"id": 518, "start": 5121.6, "end": 5136.6, "text": "Das ist ja 3 Meter hoch."}, {"id": 519, "start": 5136.6, "end": 5146.6, "text": "Die Musik dabei auch."}, {"id": 520, "start": 5146.6, "end": 5152.6, "text": "Bacon Salami Cheeseburger."}, {"id": 521, "start": 5152.6, "end": 5171.6, "text": "Das klingt auch gut."}, {"id": 522, "start": 5171.6, "end": 5183.6, "text": "Der klingt so richtig Kokona pur."}, {"id": 523, "start": 5183.6, "end": 5196.6, "text": "Ist das eine Gewürzmischung?"}, {"id": 524, "start": 5196.6, "end": 5208.6, "text": "Das kommt auch immer am Anfang."}, {"id": 525, "start": 5208.6, "end": 5218.6, "text": "Ich know meine Salami."}, {"id": 526, "start": 5218.6, "end": 5230.6, "text": "Der Chat."}, {"id": 527, "start": 5230.6, "end": 5256.6, "text": "Der hat seine Machete gelassen."}, {"id": 528, "start": 5256.6, "end": 5271.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 529, "start": 5271.6, "end": 5286.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 530, "start": 5286.6, "end": 5301.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 531, "start": 5301.6, "end": 5316.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 532, "start": 5316.6, "end": 5331.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 533, "start": 5331.6, "end": 5346.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 534, "start": 5346.6, "end": 5361.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 535, "start": 5361.6, "end": 5376.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 536, "start": 5376.6, "end": 5391.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 537, "start": 5391.6, "end": 5406.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 538, "start": 5406.6, "end": 5421.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 539, "start": 5421.6, "end": 5436.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 540, "start": 5436.6, "end": 5451.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 541, "start": 5451.6, "end": 5466.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 542, "start": 5466.6, "end": 5481.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 543, "start": 5481.6, "end": 5496.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 544, "start": 5496.6, "end": 5511.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 545, "start": 5511.6, "end": 5526.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 546, "start": 5526.6, "end": 5541.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 547, "start": 5541.6, "end": 5556.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 548, "start": 5556.6, "end": 5571.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 549, "start": 5571.6, "end": 5586.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 550, "start": 5586.6, "end": 5601.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 551, "start": 5601.6, "end": 5616.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 552, "start": 5616.6, "end": 5631.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 553, "start": 5631.6, "end": 5646.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 554, "start": 5646.6, "end": 5661.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 555, "start": 5661.6, "end": 5676.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 556, "start": 5676.6, "end": 5691.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 557, "start": 5691.6, "end": 5706.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 558, "start": 5706.6, "end": 5721.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 559, "start": 5721.6, "end": 5736.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 560, "start": 5736.6, "end": 5751.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 561, "start": 5751.6, "end": 5766.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 562, "start": 5766.6, "end": 5781.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 563, "start": 5781.6, "end": 5796.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 564, "start": 5796.6, "end": 5811.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 565, "start": 5811.6, "end": 5826.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 566, "start": 5826.6, "end": 5841.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 567, "start": 5841.6, "end": 5856.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 568, "start": 5856.6, "end": 5871.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 569, "start": 5871.6, "end": 5886.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 570, "start": 5886.6, "end": 5901.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 571, "start": 5901.6, "end": 5916.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 572, "start": 5916.6, "end": 5931.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 573, "start": 5931.6, "end": 5946.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 574, "start": 5946.6, "end": 5961.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 575, "start": 5961.6, "end": 5976.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 576, "start": 5976.6, "end": 5991.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 577, "start": 5991.6, "end": 6006.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 578, "start": 6006.6, "end": 6021.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 579, "start": 6021.6, "end": 6036.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 580, "start": 6036.6, "end": 6061.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 581, "start": 6061.6, "end": 6086.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 582, "start": 6086.6, "end": 6108.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 583, "start": 6108.6, "end": 6133.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 584, "start": 6133.6, "end": 6161.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 585, "start": 6161.6, "end": 6186.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 586, "start": 6186.6, "end": 6206.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 587, "start": 6206.6, "end": 6233.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 588, "start": 6233.6, "end": 6260.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 589, "start": 6260.6, "end": 6285.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 590, "start": 6285.6, "end": 6312.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 591, "start": 6312.6, "end": 6337.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 592, "start": 6337.6, "end": 6362.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 593, "start": 6362.6, "end": 6387.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 594, "start": 6387.6, "end": 6414.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 595, "start": 6414.6, "end": 6439.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 596, "start": 6439.6, "end": 6464.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 597, "start": 6464.6, "end": 6489.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 598, "start": 6489.6, "end": 6517.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 599, "start": 6517.6, "end": 6544.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 600, "start": 6544.6, "end": 6568.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 601, "start": 6568.6, "end": 6593.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 602, "start": 6593.6, "end": 6618.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 603, "start": 6618.6, "end": 6638.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 604, "start": 6638.6, "end": 6663.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 605, "start": 6663.6, "end": 6690.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 606, "start": 6690.6, "end": 6717.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 607, "start": 6717.6, "end": 6744.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 608, "start": 6744.6, "end": 6769.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 609, "start": 6769.6, "end": 6794.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 610, "start": 6794.6, "end": 6819.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 611, "start": 6819.6, "end": 6846.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 612, "start": 6846.6, "end": 6871.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 613, "start": 6871.6, "end": 6898.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 614, "start": 6898.6, "end": 6925.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 615, "start": 6925.6, "end": 6950.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 616, "start": 6950.6, "end": 6965.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 617, "start": 6965.6, "end": 6980.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 618, "start": 6980.6, "end": 6995.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 619, "start": 6995.6, "end": 7010.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 620, "start": 7010.6, "end": 7025.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 621, "start": 7025.6, "end": 7040.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 622, "start": 7040.6, "end": 7055.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 623, "start": 7055.6, "end": 7070.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 624, "start": 7070.6, "end": 7085.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 625, "start": 7085.6, "end": 7100.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 626, "start": 7100.6, "end": 7115.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 627, "start": 7115.6, "end": 7130.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 628, "start": 7130.6, "end": 7145.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 629, "start": 7145.6, "end": 7160.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 630, "start": 7160.6, "end": 7175.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 631, "start": 7175.6, "end": 7190.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 632, "start": 7190.6, "end": 7205.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 633, "start": 7205.6, "end": 7220.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 634, "start": 7220.6, "end": 7235.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 635, "start": 7235.6, "end": 7250.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 636, "start": 7250.6, "end": 7265.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 637, "start": 7265.6, "end": 7280.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 638, "start": 7280.6, "end": 7295.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 639, "start": 7295.6, "end": 7310.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 640, "start": 7310.6, "end": 7325.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 641, "start": 7325.6, "end": 7340.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 642, "start": 7340.6, "end": 7355.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 643, "start": 7355.6, "end": 7370.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 644, "start": 7370.6, "end": 7385.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 645, "start": 7385.6, "end": 7400.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 646, "start": 7400.6, "end": 7415.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 647, "start": 7415.6, "end": 7430.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 648, "start": 7430.6, "end": 7445.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 649, "start": 7445.6, "end": 7460.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 650, "start": 7460.6, "end": 7475.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 651, "start": 7475.6, "end": 7490.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 652, "start": 7490.6, "end": 7505.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 653, "start": 7505.6, "end": 7520.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 654, "start": 7520.6, "end": 7535.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 655, "start": 7535.6, "end": 7550.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 656, "start": 7550.6, "end": 7565.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 657, "start": 7565.6, "end": 7580.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 658, "start": 7580.6, "end": 7595.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 659, "start": 7595.6, "end": 7610.6, "text": "Ich weiß, dass er mit Bakterien meint."}, {"id": 660, "start": 7610.6, "end": 7625.6, "text": "Ich weiß, dass er mit Bakterien meint."}]}