{"text": "So, weiter gehts. Ich hab jetzt ungefähr rausgekriegt, wie man das macht, was ich letztes Mal schon machen wollte. Das heißt, ich kann jetzt noch ein bisschen abgucken, aber ich kann euch gleich schon sagen, die Library, die wir dafür verwenden müssen, ist absoluter Rotz. Aber eine andere gibt's nicht. Andere hab ich nicht gefunden bisher. Und wenn jetzt mal ein paar Leute da sind, also sprich, wenn Twitch gecheckt hat, dass das Stream on ist, weil es sind immer noch null Zuschauer. Ich bin schon... Wie lang bin ich schon? Sieht man da, wie lang ich on bin? Ähm... Okay, 2.50. Aber normalerweise checkt das Twitch immer sofort. Ich kann ja mal in Discord gucken. Ich muss gucken, dass ich nicht auf einem falschen Channel bin. Oh Gott. Max! Hoffentlich bist du nicht auf einem Weebspam-Channel. Dann ist hier gleich Monka Toss. Wartet mal. Ich hoffe, ich bin nicht auf einem falschen Channel, Alter. Was ist das? Nein! Nein! Nein! Nein! Nein! Okay, gut. Ich bin nicht auf einem falschen Channel, Alter. Ich wollte gucken, ob der Stream angekündigt wurde. Jetzt gerade, oder? Jetzt eben. Deswegen, jetzt sind auch... Jetzt kommen auch ein paar Leute rein. Keine Ahnung, was wieder los war mit Twitch. Ja, wenn ein paar Leute da sind, zeige ich euch noch mal was Lustiges, was ich gerade gefunden habe auf Twitter. Progress auf Wumplors Chat. Jetzt bin ich verhöhnt schon von meinem eigenen Twitch-Chat, Alter. Das ist hier was. Der De-Abo ist raus. Wer namen am Start? Detikarn hat subscribt für drei Monate. Dankeschön. Huge Sub. Benutzt du KeyPass oder LastPass? KeyPass. LastPass würde ich nie verwenden. Richtig. Der Eichler ist mir auch gerade eingefallen, dass De-Abo normalerweise in diesem Kontext nicht verwendet wird. Dis-Abo. Dis-Abo, Alter. Warum nie LastPass, weil ich nichts verwende, wo meine Passwörter, also quasi die Zugänge zu den sensibelsten Sachen, die ich irgendwie habe, online gespeichert werden und ich keine Ahnung habe, was die Software treibt. Moonbeard Desmond, sechs Monate am Start. Easy clap, nice. Easy. Fatir, ihr hat es erkannt. Du musst mal unterscheiden zwischen sensibel oder sensitiv. Wieso hast du X-Server auf dem Desktop, habe ich. Stimmt. Warum habe ich einen X-Server auf dem Desktop? Was ist das für eine gute Frage, warum habe ich einen X-Server auf dem Desktop? Ich glaube, wir haben mal probiert, ob man nicht mit diesem neuen, mit diesem WSL-Windows-Zeug, wie es damit aussieht, grafische Programme laufen zu lassen. Schon ewig her, das heißt, es war noch WSL-1, es wird jetzt schon wieder Zeit, das mit WSL-2 auszuprobieren. So, jetzt seid ihr ja da, ich muss euch mal was zeigen. Muss ich mich gerade kaputtlachen. Ich dachte erst, das ist ein G-Bait, aber ich glaube, es ist echt. Also, Steam macht ja immer schon Werbung für irgendwelche Deals, in dem Fall für das hier. Das Game juckt mich nicht, ich finde die Antwort witzig. Ich habe mal ausgeplannet die Antwort, ja. Stadia Better, und guckt euch mal was von, für einen Lauch, Alter, Stadia Better im Vergleich zu Steam, oder so ein 8-Jähriger. Okay, ich sehe schon, der Chat findet es nicht lustig, aber ich fand das übelst lustig. Okay, mittlerweile gibt es schon eine Antwort drauf, oder irgendwie, was? Kid, who plays games on Stadia, Red Dead Redemption 2 und Doom Eternal, der sieht nicht so aus, als dürfte weder Red Dead Redemption 2, noch Doom Eternal überhaupt spielen. Die Weide ist nicht lustig, genau, es ist ja fucked, es ist ja allgemein bekannt, es steht überhaupt nicht mehr zur Diskussion, dass Google Stadia besser ist als Steam, das ist ja schon erwiesen. Marketing Account, dachte ich auch erst, aber das ist so authentisch, der Account, oh, was hat denn, was macht denn Merkel wieder? Was ist da, zeige ich dir mal her, was zum Teufel ist das, yeah, hat die Physik studiert, hat die nicht Physik studiert, ich weiß nicht, wie das funktioniert, das ist das Kind vom Alphabet CEO, ich habe ehrlich gesagt gar keine Ahnung, wie der Alphabet CEO heißt, ist das nicht irgendein Inder, oder ist der neue Google CEO ein Inder, oder er sieht zumindest irgendwie indisch aus, oder heißt indisch, ich kann das immer nicht auseinanderhalten, ob Alphabet oder Google, der Google CEO, das Inder durchaus CEO können und nicht nur scammen, sieht man am Microsoft Chef, der geht ja ab, das hätte was der geschafft haben in Microsoft, man muss ja ab und zu mal zur Abwechslung seinen Hut ziehen, also das hätte ich vor 10 Jahren oder so, wo der Microsoft, weiß nicht seit wann der Typ Microsoft, seit wann ist der Microsoft Chef, seit wann ist das hier, 2014, also seit 6 Jahren, also ganz ehrlich, also 2014 hätte ich im Leben nicht gedacht, dass aus Microsoft mal das unternehmen wird, was mit die meisten Open Source Contributions und größten Open Source Dinge hat, wobei das Marketing-Geschwätze ist, bei einem wichtigen Projekt weiß ich nicht, wie sie so drin sind, dass denen mal GitHub gehört, dass die einen Code-Editor raushauen, den die meisten Leute verwenden, das hätte ich nicht gedacht, was, nee, Larry Page ist doch der, warte mal, jetzt bringe ich es durcheinander, nee, Larry Page ist der Googlemensch, der mit dem Facebook man verwechselt, ah, und wo ist sehr, sehr, sehr, sehr gay, sehr, sehr gay, Brin oder wie er heißt, ist das nicht auch irgendein Googlemann, ja, der da, ist das nicht auch irgendein, Google, Googleman, ah, das ist der Co-Founder von Google, ah, verstehe, exzellent, der war das, stimmt, so, ok, was hat sie denn wieder angestellt, was hat sie denn angestellt, vor allem warum sind die ganzen Tweets über Merkel auf Englisch, wahrscheinlich juckt uns in Deutschland mal wieder überhaupt nicht, was eigentlich abgeht, uns interessiert nur das, oh, oh, WTF, was ist das, warum hat der Typ sich gelöscht, RIP Stadia Kid, das ging aber schnell, das ging aber schnell, also entweder, entweder war das wirklich eindeutig Exposed Fake Account, die Stadia Gang, oder der hat bei mir im Stream zugeguckt und hat gesagt, fuck, der Max hat mich geflammt, gleich Countdicht machen, aber war das ja nie, naja, aber ich hab's euch ja noch, guck mal, wir haben keine Frametrops, also heute mal hier, nix, mal gucken, ob das ganze so bleibt, kaum dürfen die Leute wieder auf die Arbeit fahren oder in Geschäfte gehen, schon ist hier wieder, hat Vodafone keine Probleme mehr, aber ich hab's auf Twitter gepostet schon, und ich sag's jetzt hier noch mal im Stream, warum, warum genau hat der jetzt mal ein Video copy pasted, der Typ ist zu heftig, er nutzt 2020 unironisch LeadSpeak, richtig weggeraised, ja, also ich sag's jetzt auch noch mal hier, ich bin ja der Ansicht, meine persönliche Meinung ist, Gamer Grill mit Headsetter wirst so massiv gedisst, echt werde ich, hab ich gar nicht gelesen, ne, da werde ich nicht gedisst, die anderen oder was, naja, also wenn das schon massiver Dis ist, dann weiß ich auch nicht, in welchem denn, wo werde ich massiv gedisst, naja, also wenn das jetzt massiver Dis ist, dann darf er mich ruhig gern weiter massiv, wenn er Spaß dran hat, so, ja, was wollte ich jetzt mal, genau, ich wollte euch ja eigentlich was auf Twitter von mir zeigen, und zwar, meine persönliche Meinung ist ja, dass, wenn die jetzt anfangen, irgendwo hab ich jetzt hier geschrieben, genau, also wenn die jetzt wieder anfangen alles aufzumachen, und es scheint ja so zu sein, vor allem total uneinheitlich, ja, mal darfste, mal darfste nicht, mal Eisdiele auf, mal Eisdiele zu, mal Mundschutz, mal keinen Mundschutz, es blickt im Prinzip keine Sau durch, und ich bin, also meine persönliche Meinung ist, dass es nicht lange dauern wird, weil du kannst dich auf die Leute absolut nicht verlassen, meine persönliche Meinung ist, dass das nicht lange dauern wird, und wir machen wieder alles dicht, oder wir nehmen im Kauf, dass reihenweise Leute abkratzen, eins von beiden, eins von beiden, wir können auch den Ami-Style machen und uns überlegen, ob man Corona nicht erschießen kann oder so, aber ich glaube nicht, dass das hier passieren wird, das wird nicht lange dauern, ich bin, also im Vergleich zu den letzten Tagen, wenn ich so rumgelaufen bin, da hast du ja auch schon so die üblichen geistig verwirrten Leute am Start gehabt, die am Main mit fünf Leuten rumgehungen haben, ja, meistens irgendwelche Jugendliche oder so, aber ja, Weinwegen, aber heute war schon, heute war schon deutlich mehr, und der einzige Unterschied zu sonst ist, dass die Leute jetzt im Laden eine Maske anziehen müssen, und dass die Leute jetzt ein bisschen mehr Abstand halten müssen, das ist natürlich schon im Vergleich zu sonst ein riesen Unterschied, aber ich kann mir vorstellen, umso mehr das Normalität wird, umso mehr scheißen die Leute drauf, und man hätte es wahrscheinlich heute schon gesehen, wenn man in einem Supermarkt arbeitet, dass viele Leute wieder diskutieren und rumnerven und alles in der Richtung, das wird nicht, du kannst dich nicht, du kannst dich nicht auf die Leute verlassen, das klappt nicht, das weiß ich als IT-Mann ganz besonders, zum Glück habe ich mit End-User-Support nichts zu tun, aber da ist es auch so, erinnere ich mich mal wieder daran, wo mir mal einer eine Mail geschrieben hat, mit dem Titel, ich hoffe, das kriege ich jetzt irgendwie richtig zusammen, das System geht nicht, da habe ich ihr zurückgeschrieben, ja, ich glaube nicht, dass sie bei mir richtig ist, weiß gar nicht, wie sie meine E-Mail-Adresse bekommen hat, aber ich kann es weiterleiten, wenn sie mir sagt, um welches System es geht, und die Antwort war, das System, mit dem wir täglich arbeiten, nicht einfach nur das System, mit dem wir täglich arbeiten, die hat geschrieben, natürlich das System, mit dem wir täglich arbeiten, und da weißt du schon, was du für Leute, für geistig, naja, komische, nicht auch ganz auf der Höhe Leute hast, und die ist sicherlich nicht blöd gewesen, aber gerade Leute, die im IT-Support arbeiten, die werden wissen, du kannst dich auf Leute nicht verlassen und gerade, also wenn du dich schon nicht auf die Leute mit ein bisschen was im Hirn verlassen kannst, ja, dann kannst du dich garantiert auch nicht auf die Leute, ohne was im Hirn zu verlassen, das ist wirklich, oi, 3-Head, ganz extrem, das ist 2-Head, da reichen die 3 gar nicht mehr, das war die indische Scam-Mail, ne, das war keine indische Scam-Mail, ich habe übrigens noch hier MonkaDB-Fahren, weil ich mir gedacht habe, dass das ASCII-Quarium allein ist zu wenig, ja, bevor wir anfangen, wollte ich noch eine Sache mal loswerden, weil sich ja auch persönlich an dieser, was mich ein bisschen nervt, an dieser ganzen Corona-Geschichte, hat überhaupt nichts mit Corona zu tun, null, eine Sache, die mich schon seit langer Zeit nervt und wo ich mir für die Leute, die da drin arbeiten halt was besseres wünschen würde, und zwar alle, die jetzt im Krankenhaus arbeiten, oder irgendwie jeder Arztpraxis im Krankenhaus, irgendwo im Gesundheitswesen, ja, da wo die Leute jetzt alle rumschleimen, oh, unsere Helden und auch die Politik und die Nachrichten, alles irgendwie große Schleimattacke startet, das sind die wahren Helden, oder die Supermarktverkäuferin, das sind die wahren Helden, eigentlich verlassen sich alle viel zu sehr drauf, dass die Leute das aus Überzeugung machen und selbstverständlich das alles machen, weil ich könnte wetten, wenn die ganze Corona-Geschichte vorbei ist und wenn diese Leute mal später Probleme haben mit irgendwas, es wird sich niemand mehr dran erinnern, was sie 2020 gemacht haben, dass sie 2020 da dabei waren, das heißt, theoretisch das beste, was die jetzt machen könnten, ist meiner Ansicht nach, die müssten jetzt eigentlich sagen, Jungs, Kohle oder wir arbeiten nicht mehr, ich weiß, es klingt übelst asozial und das sind halt Leute, die machen sowas nicht, weil die meisten Leute, es ist ja auch wirklich sehr lobenswert alles, das sind halt Leute, denen ist es zum größten Teil überhaupt noch was wert, dass die anderen Leuten helfen können und die würden auch andere Leute nicht im Stich lassen, das Problem ist aber, dass sich quasi die Chefs von denen und wir alle uns quasi selbstverständlich darauf verlassen, dass sie das machen und wenn sich alle selbstverständlich darauf verlassen, sagt man dann, ja gut, dann müssen wir denen auch nicht mehr Geld geben, weil die machen es ja eh selbstverständlich, das heißt eigentlich müssten die sagen, auch wenn es übelst asozial wäre und das gerade die Leute in dieser Situation nicht machen würden, die da eh schon arbeiten, die müssten jetzt sagen, Leute, über 10 Jahre wollen wir jetzt das und das, die unterschreiben aktuell alles, die unterschreiben aktuell, unterschreiben die alles, natürlich ist das maximal egoistisch, aber die Leute haben deutlich mehr Geld verdient, die haben deutlich mehr Geld verdient für den Scheiß, was die machen und das Problem ist, man, das wird sofort wieder vergessen, sobald die ganze Corona-Geschichte vorbei ist. Überlegt euch mal, wenn irgendjemand, der, keine Ahnung, der heute im, oder der Krankenschwester, die gerade im Krankenhaus arbeitet und wirklich Tag ein, Tag aus, die ist fertig, die gibt wirklich alles, kriegt nicht viel Geld und mal angenommen, die kann in, sag mal, die kann in 5 Jahren nicht mehr arbeiten, weil sie irgendwie Rückenprobleme hat, kann die nicht mal als Krankenschwester arbeiten, so, dann gehen die zum Arbeitsamt oder irgendwo anders hin, meint ihr, das erinnert sich irgendjemand noch daran, dass die 2020 als Krankenschwester mit dafür gesorgt hat, dass die ganze Corona-Geschichte nicht so ausartet, das ist den Leuten in 5 Jahren absolut egal, das juckt die, das juckt die, das überhaupt nicht, da sagen sie, ja, 2020, da hab ich ja gesehen, oh, sie war in der 2020 8 Wochen krank, da sagt, ja, ich hatte Corona und hatte sonst was, sonst wie, ja, aber 8 Wochen, ne, ne, da müssen wir ihnen aber 2 Wochen von ihren Gebühren, von ihrem Betrag abziehen, weil das geht ja nicht, es wird sich kein Mensch dran erinnern, was sie gemacht haben. Und gerade deswegen, weil alle anderen Leute wahrscheinlich in Zukunft maßlos undankbar sind, was das angeht, sollten sie jetzt ein bisschen egoistischer sein, sagen, Jungs, jetzt mehr Kohle, weil jetzt sind wir in einer Situation, wo wir sowas fordern können. Schonmal über eine Mitgliedschaft in der SPD nachgedacht, weder SPD noch CDU noch sonst was. Ich sag ja nur, die Leute sollten, die haben deutlich mehr Geld verdient und jetzt wäre die Variante, wie man das machen könnte. Ich sag nicht, dass es machen soll, das wäre natürlich auch maximal asozial, aber jetzt wäre die Situation, wo man noch Kohle rausholen könnte. Ja, und deswegen, das ist voll von Arsch und man muss auch mal sagen, dass ich das Verhältnis zwischen landlichen Berufen irgendwie ungerechtfertigt finde. Wenn ich mir überlege, dass irgendein Projektmanagement, Consultant, Dude, keine Ahnung, 180k im Jahr kriegt, ich sag das jetzt einfach mal so ungefähr über den Daumen von denen, wo ich das so grob bei manchen weiß, 180k im Jahr kriegt für extrem viel heiße Luft, so Stonks-Menschen, so extrem viel heiße Luft, die natürlich auch dem jeweiligen Laden, wo die sind, mit Sicherheit auch Kohle bringen, so ist das nicht, oder zumindest denkt man das. Und ich weiß nicht, was eine Krankenschwester aktuell verdient, aber ich finde, das steht in keinem Verhältnis. Das sind richtige Stonks-Typen, genau. Ich finde, das steht in keinem Verhältnis. Ich sage nicht, dass man dem Stonks-Mensch unbedingt weniger geben sollte, die Verantwortung wird bezahlt. Ja, das stimmt, aber wenn es danach geht, dann müsste man jemand, der im Krankenhaus arbeitet, auch mehr bezahlen, weil die haben auch Verantwortung. Die haben zwar keine Verantwortung, wo es irgendwie um ein paar Millionen Euro geht, aber die haben Verantwortung, dass ihre Leute da nicht abkratzen, was natürlich die Allgemeinheit deutlich weniger juckt, als die Verantwortung, ob man ein paar Millionen hat oder nicht. Also ich will nicht, dass man irgendwelche Leuten weniger Kohle gibt, das ist ja alles irgendwie okay, wenn irgendjemand bereit ist, ihn für diesen Betrag einzustellen, aber du müsstest manche Leute schlicht und ergreifend einfach mehr Kohle geben, das kann nicht sein. Ja, Feuerwehrleute, Sanitäter, es gibt viele Berufe, wo ich sage, ey, das kann nicht sein. Und letztendlich ist es ja so, solange nicht ein gewisser Druck da verspürt wird, dann tut sich da auch nichts. Guckt euch doch mal an, in was für einem scheiß Zustand teilweise Schulen bei uns sind. Was die sich da teilweise überlegt haben, ey. Da frage ich mich immer, ob die schon mal in den letzten paar Jahren in der Schule gewesen sind. Ja, aber ich kann ja verstehen, dass das nicht jeder so sieht. Und man muss auch sagen, dass so ziemlich alles, was gesetzlich versichert ist und du quasi mit deiner gesetzlichen Versicherung bekommst, sehr großen Ausbeutungscharakter hat. Also sprich, der Vergleich zwischen, man lässt sich mal privat behandeln und bezahlt das selbst oder eine private Versicherung und das, was du kriegst, wenn du gesetzlich versichert bist, das ist der Witz, ey. Das ist das Verhältnis, das ist der absolute Witz. Bei dem einen, krasse das Gefühl, wenn du zwei Fragen stellst, der will dich am liebsten direkt aus dem Fenster schmeißen. Und bei dem anderen, der fragt dir nicht, ob dir noch die Ledersätze ranrutschen sollte jetzt. Erstmal übertrieben gesagt, das ist ein riesen Unterschied dazwischen. Und wenn sie immer erzählen so nach dem Motto, ja, wir müssen aufpassen, dass wir keine zwei Klassenmedizin kriegen, totaler Schwachsinn, den haben wir schon. Und der ist auch schon offensichtlich. Ich machs mittlerweile so, dass wenn ich Kleinkram hab, das ist ja auch der Grund, warum so viel Zeug operiert wird, das bringt Kohle. Ich weiß nicht, ob ich euch erzählt hab, meine Mutter hatte Probleme in der Hüfte hier, irgendwie unten im Rücken und die war zuerst, zuerst war die beim Hausarzt. So, gesetzlich versichert, beim Hausarzt. Und der Hausarzt hat gesagt, naja, da ist nichts, schonen, und Tschüss. Nichts untersucht, nix. Ich hab gesagt, ihr tut es schon vier Wochen weh, nix. Untersucht. Und damals hab ich zuerst schon gesagt, ey komm, ich such mal ein ordentlicher Autopäde in Frankfurt raus, Canon ordentlich, der ist bei uns um die Ecke, da ist wirklich 300 Meter Luftlinie weg von da, wo ich arbeite. Lass uns da mal hin, der rechnet auch im ganz guten Satz ab, das ist nicht so teuer. Ja, natürlich präsent ist das, was du dafür bezahlt kriegst, auch pauschal, diese Pauschalvergütungsgeschichten sind komplett für'n Arsch. Das sorgt einfach nur dafür, dass es nicht das Ziel ist, die Leute gut zu behandeln, oder das sag mal so, das Wohl der Leute im Vordergrund steht, sondern, dass das irgendwie Profit orientiert ist. Und ich bin da an sich, dass Krankenhäuser oder auch Arztpraxen, dass das nicht unbedingt, die müssen natürlich gut verdienen, da sag ich nix dagegen, aber es sollte nicht darauf ausgelegt sein, dass unterm Strich Plus rauskommt. Das ist okay, wenn das Plus Minus Null rauskommt. Und es ist auch okay, wenn da Minus rauskommt. Man hat ja dadurch auch was gewonnen. Es ist ja nicht so, dass das verlorenes Geld ist. Frag mal die Leute, die da drin behandelt werden, die sagen bestimmt nicht, oh nee, oh fuck Minus gemacht, Alter mach dicht. Na zumindest, die war dann zuerst mal im Hausarzt und der hat halt gesagt, oh nee, hier, juckt mich nicht, mach dich wieder ab. Da ist er irgendwie ein paar Tage später wieder hingegangen, ist alles nicht besser geworden, da hat er gesagt, ah, machen wir mal ein bisschen Wärmebehandlung. So, nix, so. Da ist er wieder hingegangen und dann ist da das Problem, wenn du so oft da hintereinander hingehst, dann hat der Arzt so die Wahl, der muss sich entweder mit dir beschäftigen, das Problem ist, du warst schon zweimal da, so richtig abrechnen kann er es nicht mehr. Das heißt, du hast eigentlich gar keinen Bock. Ich will den Ärzten gar nicht mal unterstellen, dass die nicht wollen. Ich könnte mir vorstellen, vielen finden das System auch richtig für'n Arsch. So, dann hat er ihr irgendwie, irgendeine komische Spritze zum Abschwellen und Schmerzmittel geschützt gegeben und da ging es ihr kreislaufmäßig schon überhaupt nicht gut. Das ist ja auch das, was ich euch dann auf Twitter geschrieben hab, wo wir ins Krankenhaus gefahren sind. So, und dann hatte ich die Spritze nach drei Tagen nochmal geben lassen und dann war es so heftig, dass wir ins Krankenhaus fahren mussten, nachts. Weil sie irgendwie einen Puls von, frag mich nicht, 200 oder so, was mit 69 nicht normal ist. Wir sind ins Krankenhaus gefahren und eins muss man dir sagen, als Notaufnahme, das war echt okay, du konntest dich nicht beschweren und auf der Station war dann voll für'n Arsch. Komplett für'n Arsch. Also da hat man gesehen, es geht im Prinzip nicht darum, die Leute gut zu behandeln, sondern, dass das möglichst kosteneffizient ist und die Leute möglichst schnell wieder draußen sind. So, und was haben wir dann gemacht? Dann sind wir nach Frankfurt gefahren zu dem Orthopäde, den ich rausgesucht hab und das haben wir selbst bezahlt und das war von Anfang an, ich hab mich ja auch schon bei ein paar Sachen selbst bezahlt bei der Behandlung, deswegen hatte ich ja schon ein bisschen Erfahrung vorher auf was man gucken muss und halt auch selbst die Erfahrung gemacht, dass es ein riesen Unterschied ist und dann sind wir hingefahren nach Frankfurt, ohne Scheiß. Allein schon die Terminvergabe war ja, ach jo, eine Sache hab ich ja vorher gar nicht erzählt, davor war sie ja noch im Krankenhaus beim Orthopäde und der hat gemeint, er will seine Hüfte operieren. Die hat nichts an der Hüfte, die hat hinten irgendwas ausgerenkt am Rücken, die hat überhaupt nichts an der Hüfte. Aber schnell mal operieren, es gibt Kohle. Ja, ich räume hier mal nebenbei auf. So, und wie gesagt, dann sind wir zu dem Orthopäde nach Frankfurt gefahren und siehe da, die Terminvergabe war schon mal komplett unterschiedlich wie Tag und Nacht, also sprich, ich mach mal hier eine neue Datei, was macht man da, header, CPP-File, ach was weiß ich, erstmal alles hinkopieren. Allein schon die Terminvergabe war ein Unterschied wie Tag und Nacht, da hast du angerufen, hast gesagt, hier, wir haben Schmerzen im Rücken, wie sieht's aus? Zwei Tage später, da fuck, bei den anderen wartest du ein halbes Jahr drauf. Darfobi, fünf Monate, dankeschön. So, und dann sind wir dahin, dann sind wir dahin, so und was hat er am Ende gemacht? Einmal eingerenkt und nochmal an die richtige Stelle eine Schmerzspritze gegeben, aber eine, die ein bisschen mehr kostet, deutlich besser verträglich ist und ohne Scheiß, Leute, die hat sich da, glaub ich, zwei oder drei Monate mit rumgequält. Nach einer Woche war es fast wieder weg, da sind wir nach einer Woche nochmal hin und haben das nochmal kontrollieren lassen, der hat das nochmal abgetast, nochmal geultraschaltet und guckt nochmal, ja, muss ich auf jeden Fall nochmal ein paar Wochen schonen, aber die Entzündung ist auf dem Ultraschall schon fast wieder weg und wenn was ist, sollen wir nochmal vorbeikommen. Easy, ja, dafür waren wir da halt auch eine halbe Stunde drin beim ersten Mal, sprich, die wurde wirklich eine halbe Stunde lang behandelt, das hast du normalerweise, wenn du das gesetzlich bezahlst nicht, da wirst du never eine halbe Stunde behandelt, da wirst du vielleicht, wenn du Glück hast, eine halbe Stunde im Wartezimmer sitzen gelassen, wenn eher eine Stunde und danach wirst du zwei Minuten behandelt. Was hat der eigentlich vor Schmerzen? Warum will das hier nicht? Ach, kacke Sprache, äh. So, und ich installiere mal schon die Library nebenbei. So, und die Sache ist jetzt halt die, die Behandlung hat jetzt was uns selber gekostet, aber die hat halt auch einfach was gebracht. So, und was hab ich davon, wenn ich gesetzlich versichert bin, Riesen aufrissen machen muss und zu zwanzig Ärzten und sich nix tut, ist jetzt doch einfach nur Stress für alle. So, ähm, hast du beim Termin machen gesagt, dass du privat bezahlst? Ja, weil, also und, weil auf dem seine Homepage steht, dass er halt nur privat macht. Der hat gar keine, kann sogar nicht gesetzlich versichert. Und das ist halt wieder mal ein richtig krasser Unterschied gewesen, wo man gesehen hat, dass unser Gesundheitssystem für'n Arsch ist. Ob der Login auch funktioniert? Ach, ich hab im Helperfall die Includes vergessen. Wat? Achso, hab ich nicht connected. Ja, und das ist ein Ding. Wat? Ja. Ok. Bescheuerte Fehlermeldung, ich weiß noch nicht, ob ich das connecten will. So, ähm, also es ist anscheinend grad wirklich so, das einzige, was es dir bringt, gesetzlich versichert zu sein ist, du kannst zum Arzt in eine Krankmeldung holen, weil du eine Erkältung hast und du verreckst nicht, weil du nur als rufen kannst und behandelt wirst, dass du zwar jetzt nicht akut instant stirbst. Dafür ist es gut, dafür ist es auch nicht verkehrt, dass wir sowas haben. Ähm, wenn du wirklich gut behandelt werden wirst, du musst es selbst bezahlen. Du hast, du hast keine Möglichkeit mehr. Oder du findest wirklich, also oder man hat echt Glück und findet irgendwas Gutes in der Nähe. Aber die Chancen werden immer, werden immer geringer. Oh, achso, vielleicht soll ich mal Delay rein machen. Ja, und ich war ja auch schon bei ein paar Sachen, die ich selbst bezahlt hab. Jetzt, ich, ich, ich weiß halt nicht, ob es sich bei mir lohnt, wenn ich mich privat versichern lassen würde. Ähm, ich mein, ich bin jetzt 35, das heißt, das ist eigentlich das Jahr, wo man sagt, man sollte sich spätestens entscheiden, ob man gesetzlich bleibt oder sich privat versichern lässt. Aber bisher mach ich so, die teuren Sachen, die mach ich halt über die gesetzliche Kasse, sprich, wenn man irgendwie mal sich röntgen lassen muss oder muss man MRT machen lassen, das ist halt übelst teuer. Ähm, so Kleinkram oder halt auch, sagen wir so Kleinkram bis Mittelkram, mach ich mittlerweile rein privat bezahlt selbst. Einfach weil es sackt, wenn man, wie man gesetzlich versichert behandelt wird. Und es ist, es ist ein Unterschied wie Tag und Nacht. Ich war beispielsweise beim, beim, äh, Halsnasen, Ohren, Stellarzt in, hallo, ich will, ich will, ich will den Zug ausmachen. Der, der Zug geht nicht aus, Leute. Der Zug, ich kann den Zug nicht beenden. Steuerung C. Ist ja fast wie bei der Bahn. Nur umgedreht, da kommt der Zug und geht nicht weg. Na gut, zack, killen wir's halt, auch gut. So, also. Wie kriegt man den Zug? SL. Bin SL. Die Lösung ist einfach reich sein, ja, das stimmt. Ich muss ja sagen, ähm, es wird ja immer gesagt so nach dem Motto Geld, äh, Geld macht nicht glücklich. Also, ich finde so pauschal kann man das nicht sagen. Weil wenn man gesunder ist, hat man durchaus größere Chancen glücklich zu sein. Du hast mit Kohle auf jeden Fall weniger Probleme. Ich mein, es müssen, es müssen jetzt nicht Millionen sein. Aber wenn man sich überlegt, ab wann man schon, ich hab letztens den Artikel gelesen, ab wann man schon, ähm, als reich gilt oder sag mal, oder was, nicht, ich weiß nicht, ob's reich ist oder ab wann man in Deutschland schon ab, ähm, als wohlhabend oder so gilt. Das ist der Witz. Ich, ich hab jetzt die Zahlen nicht mehr im Kopf. Was ist denn das irgendwie? Irgendwie kein 45k im Jahr oder so. Irgendwie ganz merkwürdig, ey. Und das liegt da dran, weil, das glaubt man gar nicht so niedrig, ist das. Müssen wir mal gleich raussuchen. Man glaubt gar nicht, wie niedrig das ist. Und das liegt einfach da dran. Weil sau viele Leute so wirklich gerade an der Grenze leben, wo sie irgendwie über die Runden kommen. Es kann man nicht wirklich reich nennen, aber quasi ab wann man, ab wann man zu den, zu den oberen so und so viel gehört. Wir reden jetzt nicht von eins und zehn Prozent, aber zu, zu, zu, zu der Gruppe, die, die mehr hat als, als der Rest. Das ist total wenig. Ich weiß nicht, ob es 45k im Jahr ist. Wir müssen, das ist total wenig. So viel glaubt man gar nicht. Ja. Genau, der Durchschnitt, der Durchschnitt liegt bei wie viel im Jahr? Im Monat, im Monat ist ein übelster Scheißwert, weil ich krieg 14 Monatsgelder. Ich kann das nicht im Monat rechnen. Ähm, ich muss das, ich muss das im Jahr rechnen. Ja, der Durchschnitt, der Durchschnitt liegt bei, das ist halt, das ist fast nix. Ähm, hier in Hessen, in Hessen gibt es das vielleicht auch mal irgendwie im Jahr. Ich weiß nicht. Ähm, ne ne ne, das war das nicht. Ich hab irgendeine komische Grafik letztens gesehen. Da haben sie so gezeigt, wie viel, ab wann du quasi über der Grenze bist, wo irgendwie dann 50% unter dir sind. Und das ist, das ist viel weniger als man denkt. Gut, das ist die Armutsgrenze, das ist wieder was ganz anderes. Ähm, ja, oh, fuck. Wenn du dir überlegst, dass du quasi ab 3400 Euro, ok, das ist jetzt im Monat, das ist jetzt, sag mal im Monat, dass du ab 3400 Euro, als quasi in Anführung, als Reich, da steht netto, ich weiß, dass da netto, der Brutto, das hält das ja auch fast jeder. Ja, dass du da als Reich giltst. Ähm, Reich, Reich ist was, wo man, wo man denkt, ey, geh mal hier Millionen oder so. Einkommen Single-Aushalt. Ich hab letztens eine schönere Statistik. Ja, genau, nicht Reich, Oberschicht. Ähm, es ist, es ist auf jeden Fall, ähm, wer als Single mehr als 3400, 3400 Euro netto im Monat zur Verfügung hat, gehört zur Oberschicht. Es ist, also das ist jetzt nicht wenig oder so, aber das ist nicht das, was ich mir, was ich so quasi unter Reich, äh, im Kopf habe, ja. Ja, sowas hier. Das, das Tool, das Tool ist schön. Hier, hier sieht man es. Und man sieht hier auch, guckt mal, guckt euch das mal an, dass, äh, was, ich will nicht Paare ohne, ich will Alleinlebende. Hier, 50%. So, wenn du über, also der Durchschnitt ist wohl, ist wohl, ist wohl über 1859. So. Aber wenn die hoch geht, das ist, guckt mal. Du hast, du hast dann, du hast dann quasi mehr als 80% der Leute in Deutschland. NWTF, das ist viel niedriger, als man denkt. Ja, zumindest, wie gesagt, ich hab den letzten Artikel drüber, ich hab gedacht, das ist viel, ich hätte mir das viel höher vorgestellt, alles. So, und, ähm, ich weiß jetzt gar nicht, wie man draufgekommen, gekommen sind, ehrlich gesagt. Ist auch egal. Ähm, ich hab mich, ich hab mich mal wieder über irgendwas, über irgendwas ausgelassen. Äh, also was ich verdiene, kann ich euch nicht genau sagen. Nur so der, nur so der, der, vom Anhaltspunkt her, ich arbeite ja nur vier Tage die Woche. Ich bin im, fuck, in welchem Tarifvertrag bin ich, ich hab's irgendwann mal im Stream gezeigt. Ich weiß noch nicht mal, bei welcher Gruppe ich bin. Ich hab, ich vergesse das, ich vergesse das immer. Was man auch, was man auch schon als Indiz dafür sehen könnte, dass es mir eigentlich zu gut geht. Wenn, wenn du, wenn du hier irgendwo rumkrebst, wenn du hier irgendwo rumkrebst, dann weißt du sehr genau, in welchem Tarifvertrag, in welcher Gruppe und was jeder Euro herkommt und was jeder Euro macht. Garantiert, das musst du wissen, weil sonst bist du im Arsch. So. Allein schon dafür, dass ich das nicht weiß, ist das wahrscheinlich schon ein Indiz, für das es mir eigentlich viel zu gut geht. Ähm, also ich bin im, im Tarifvertrag für, Tarifvertrag für Versicherung? Versicherung, glaube ich. AGV, AGV, Tarifvertrag, das klingt, glaube ich, gut. Ja, ja, ja, da bin ich, da. Da, so was, blubblubblub. Äh, Gehalts-Tarifvertrag. Ich bin da, glaube ich bin da. Da oder da, ich glaube da, da bin ich drin in der Gruppe. Also sprich, das ist das, da könnt ihr euch ungefähr vorstellen, ich, ich weiß gar nicht, ob ich euch überhaupt sagen darf, wie viel es genau sind, aber da könnt ihr euch ungefähr vorstellen, das ist das unterste, unter den es nicht gehen kann. Also sprich, das ist das mindeste, was im Tarifvertrag vereinbar, fuck, vereinbart ist. So und, wenn man sich überlegt, dass ich nur vier Tage arbeiten gehen muss, ich gebe ja auch kaum was aus. Also ich bin nicht absichtlich sparsam, ähm, aber es gibt wenig wofür ich was ausgebe. Du hast ja Leute, die haben wenig Kohle und schmeißen das Geld zum Fenster raus. Ähm, oder ich gebe kaum was aus. Keine Ahnung. Ähm, kannst du die Seite mit dem Diagramm mal verlinken, das hier? Ja, also ich komm wahrscheinlich auch ohne Probleme mit dreimal die Woche oder so aus. Dazu kommt ja bei mir mittlerweile aber auch noch ein bisschen anderes Zeug. Ich mein, ich mach grad wenig YouTube, ja, meine Twitch-Aktivität hält sich auch, hält sich auch in Grenzen. Das heißt, ich verdiene nicht wahnsinnig viel, aber dadurch, dass ich jahrelang Amazon Reflinks gespammt habe, ein bisschen Twitch Prime, ein bisschen YouTube und Zeug, ein bisschen was krieg ich auch so im Monat. Nicht viel, nicht viel. Das ist wirklich nicht der Wahnsinn. Ähm, das kommt auch nochmal dazu. Klar, wenn ich jetzt voll die Woche arbeiten gehen würde, bekomme ich, würde ich wahrscheinlich noch mehr bekommen, aber es ist viel entspannter, so wie es jetzt ist. So, ähm, so viele Taten. Zumindest schauen wir mal, was das Mindeste ist. Ja, da kommt noch ein bisschen, ein bisschen, äh, vertragsspezifische Sachen dazu. Eventuell auch noch ein bisschen Bonus am Ende des Jahres. Äh, was hast du für nen Stuhl? Ein Mr. Sedus 24. Ne, ein Mr. Sedus Mr. 24, so rum. Was sagst du dazu, dass bei mir im Studium in IT-Sicherheit Zoom benutzt wird? Zoom ist dieses Videokonferenz-Ding, ne? Was jetzt voll im Trend ist. Ich hab keine Ahnung, gut Zoom oder schlechtes. Äh, machst du einfach weniger Stunden in der Woche oder hast du pauschal einen Tag frei? Ich arbeite montags nicht, ja. Benutzt du KeyPass oder das was? KeyPass. Bei Springer gibt es gerade viele Progas, Bücher kostenlos, vielleicht sind auch welche für dich dabei. Schick mal Blitz Link, da gucken wir uns das zusammen an. Kompletter Fail. Also eins muss man ja über Microsoft Teams sagen, ich muss jetzt echt mal anfangen. Eins muss man ja über Microsoft Teams sagen, das hat ein paar Macken, aber groß und ganz funktioniert es wirklich gut für ein Microsoft Produkt. So, ich zeig euch mal die Library, die wir verwenden jetzt dafür. Weil ich hab mir ja in den Kopf gesetzt, wir wollen ein Over-the-Air-Update machen, also sprich ich will meine Microcontroller aktualisieren können, übers WLAN, ähm, über HTTPS, also über SSL. Und ich war mal wieder so richtig big brain, dass ich mir was ausgesucht hab, was es anscheinend nicht gibt. Und was bisher keiner gemacht hat, ähm, und irgendwie auch sonst keiner machen will. Ich weiß auch nicht warum, es gibt nichts fertiges. Es gibt nichts fertiges dafür. Das heißt wir müssen das selbst machen. Über HTTP ist kein Problem, da gibt es sich Web-Server. Sucht ihr Anwendungsentwickler? Ja, wir suchen, so gut wie immer, Programmierer, Anwendungsentwickler. Programmierer reduziert ja die Leute ein bisschen zu sehr. Also wir suchen immer Anwendungsentwickler. Hä, ähm, irgendwas wollte ich gerade noch sagen. Achja, die Progress-Bücher, die Progress-Bücher wollten wir uns kurz angucken. Das kommt mir bekannt vor, die Musik. Ah, ja, hab ich nie durchgespielt. Ähm, ok, also, Springer, das ist doch nicht Bild-Zeitung. Wo gibt's die ganzen Bücher? Hier, Free Books. Ach, Download, All. Achso, ein Ref-Link für die Bewerbung. Ne, aber solltest du dich bei einer Bank in Frankfurt bewerben, kannst du mich ja vorher mal fragen, ob ich da nicht arbeite, weil, dann, ähm, dann empfehle ich dich und dann kann ich dann erst das Monatsgehalt, oder ich glaube sogar den ersten zwei Monatsgehalte kassieren. Als, ähm, äh, Werbungs-, äh, Programm. So, wo steht denn, wo steht denn was die alles für Bücher haben? Ich will jetzt, ich will mir nicht unbedingt alles runterladen, ich will erst mal sehen, was die eigentlich alles haben. Hier, Springer-Announcement, ja. Und wo sieht man jetzt was die für Bücher? Hier, Archiv. What? Zweiter Link, Full List. Hier. Ah, yes. Lieber Office, wusste gar nicht, dass ich den Crab installiert hab. Also, was haben sie mir zu bieten? Juckt mich nicht, juckt mich nicht, juckt mich nicht, juckt mich nicht. Auch nicht, auch nicht. Wo sind denn die Programme? 400? What the fuck? Brustkrebs. Nein, will ich mich überhaupt nicht angucken. Äh, sind die nach, sind die nach, nach Themen irgendwie sortiert? Das kann ich mir jetzt nicht angucken, dann krieg ich ja drei, drei Stunden. Nach Kategorien? Wie? Ah, Product Type. German Books. Wo ist denn die Kategorie? Ah, hier. Rasta. Ok, also. Religion, Philosophie raus, Social Science, Science, Science, Science, Science. Physik und Astronomie, Medizin, Mathematik, Statistik. Oha, mal gucken. Intelligent Technologies. Oh, das ist Mega Man. Glaub ich. Das ist Mega Man? Ja, oh, huge Musik. Äh, was mit Menschen, gehen wir bloß fort. Energie, BWL Crap, Computer Science, können wir mal den Rest weg. Was bleibt da noch übrig? Einfach mal. Äh. Äh. Äh. Sind wir noch so viel? Das kann ich mir jetzt nicht angucken, das ist zu viel. Ok, wir machen jetzt mal Education, Engineering, machen wir alles weg, wir machen bloß Computer, Computer Science. Ah, nur Computer, nur Computer Science. So, wie viele Bücher haben wir da? Was? Warum sind das immer noch 406? Ach nee. Ach guck mal, das überspringt das. Ok, ich bin zu dumm für Excel. Aber ihr wisst, ich verwende Excel nicht. Ich kann mich mit Excel nicht auskennen. Noch nie Excel benutzt? Ja, einmal oder so. Ich hab mich ja schon gewundert, dass ich überhaupt LibreOffice installiert hab. Äh, ok, also das interessiert mich nicht so wirklich. Das könnte relativ interessant sein. La. LaTeX. Brauchst du noch die Excel Tool? Oh, da hab ich mich auf der Arbeit glücklicherweise vorgedrückt. Ähm. Automaten und Computability. Äh, nee. Design, UML. Boah. Ich glaub, ich hab irgendwie gefühlt jede Menge Subs übersehen, kann das sein? Ich muss da mal kurz reingucken. Da ich nicht für die Hälfte übersehen hab. Das wäre ziemlich MonkaS. Wen haben wir denn hier am Start? Äh, Heinrich hat Subscribed. Sechs Monate, Dankeschön. Huge Sub. Und da Fobi auch, fünf Monate. Dich hatt ich glaub ich schon, aber trotzdem, Dankeschön für die ganzen Subs. Nicht lull. Wollte ich gar nicht drücken. Als wollte ich drücken. UML, Power Plus Off. Äh, ok, Foundations for Designing User Sentences. Computer Vision Data Mining, Simple Geometry, Hanzo. Autografie, Eye Tracking, Machine Learning. Oh, haben wir hier für unsere ganzen Mathe-Fans. Nope, nope, nope. Concise Guide to Software Engineering. Das Pison Workbook, vielleicht nicht schlecht. Fundamentals Multimedia, vielleicht, kein Schimmer. Äh, jede Menge Pison-Programmierung. Object-Oriented Analysis. Oh, nee, das mir zu harte kost. Introduction to Data Science, Concise Guide to Databases, Digital Image Processing. Irgendwas, wo ich jetzt sagen würde. Ja, ja, das interessiert mich voll. Statistics, Guide to Competitive Programming. Das könnte tatsächlich interessant sein. Das habe ich sogar letztens mal in einem Video als Empfehlung gehört, diesen Guide to Competitive Programming. Der könnte wahrscheinlich ganz, ganz gut sein. Äh, Introduction to Artificial Intelligence. Nee. Scala. Java. Geh fort. Ich weiß, das mit Java nichts zu tun hat, aber ist Scala nicht auf JVM-Basis? BWL-Crap. Oh, das war's für mich. Guide to Scientific Computing in C++. Endlich. Herz390. Hallo. Äh, oh, das ist ja, ist ja das Doppelpack. Wenn du denkst, es kann kaum noch schlimmer werden, kommt die Java-Grundlage danach. Logical Foundation of Cyber-Physical Systems. Fortran. Was ist denn mit denen los? Aus 2018. Es gibt ein Buch aus 2018 über Fortran. Ich hätte erwartet, es ist ein Buch von 1970 oder so. System Programming in Unix-Linux. Das könnte ganz interessant sein. Parallel Computing vielleicht auch. Eine ist es für Computer. Java into Semesters. Beginner. Die könnten, die, ich glaube die Dinger sind sogar ganz gut hier. Ich, ich, ich bilde mir ein, das habe ich schon mal irgendwo als Empfehlung gelesen, die zwei Pausenbücher. So, aber Leute, ich habe geschrieben, wir machen Progress. Wir machen jetzt auch Progress. Und zwar, jetzt pass mal auf, jetzt geht es ab. Bam. Bam. Also, das Ziel ist ja, dass ich meine Micro-Controllers, also unter anderem die hier, updaten kann über das WLAN. Und über das WLAN updaten gibt es zwei verschiedene Varianten. Entweder man legt die neue Firmware irgendwo auf einen Server drauf und lässt die sich von seinem Controller per HTTP pullen von einem Server. Das ist interessant. Mal angenommen, man ist Hersteller von einer smarten Steckdosenleiste, sowie CoGeek. Die CoGeek Steckdosenleiste, die hat ja einen ESP866 drin. Und mal angenommen, ich bin ein Hersteller einer smarten Steckdosenleiste. Und ich möchte alle meine Geräte auf der Welt die Möglichkeit geben, mit neuer Firmware versorgt zu werden. Dann würde ich diese Methode nehmen. Dann würde ich nämlich auf einen Server bei mir signierte Firmware Package legen, neue Firmware. Und würde einfach sagen, okay, ich biete neues Update an. Und dann kriegen die Leute dann ein Pop-Up und klicken drauf und dann lädt es von meinem Server das Firmware Update runter und überhaltet TPS und macht das Update und gut ist. So, das ist die eine Variante. Was ich machen will, ist die umgedrehte Variante. Ich will nicht, dass das Gerät sich das Update pullt vom Server, sondern ich will das Update auf das Gerät pushen. Und das gibt, es gibt schlicht und ergreifend, ums Verr- ich hab GitHub rauf und runter abgesucht. Es gibt nichts fertiges dafür. Über HTTPS ist das gar kein Problem, da gibt es ein paar fertige Sachen und man kann es auch relativ easy selbst machen. Aber über HTTPS findet man eh verdammt wenig. Auf dem ESP32. Das liegt zum größten Teil daran, weil der ESP32 halt auch nicht viel RAM hat. Ich glaub 80 Kilo Byte oder so. Weiß nicht, wie viel RAM das Ding hat. Ja, 160, 160K. Und ich glaube, das teilt man sich auch mit, also das ist nicht reiner RAM, das teilt man sich glaube ich auch mit irgendwelchen statischen Sachen aus dem Sketch und so. Also wir können ja mal gucken, ob wir ausgeben lassen können, wie viel RAM man hat. ESP, irgendwie Heap. GetFreeHeap. Gucken wir mal. Wir geben uns mal den RAM aus, den wir haben. Also da sieht man schon, das Ding ist relativ beschränkt, was RAM-Size ist. Wie viel hast du für deinen TinyPico bezahlt, die 40€ oder wie? 20 Dollar? Also irgendwie mit Versand wahrscheinlich. Also ich hab 10 Stück bestellt gleich. Wahrscheinlich mit Versand ein bisschen mehr als 20€. So, ich kanns dir genau sagen. Bye. So, ich glaube ich hab da bestellt, ne zu teuer. Da oder da hab ich bestellt, eins von beiden, genau. So, stellst du dir klein mal 10 Stück. Add to Cart. 200 Dollar. Eats AF. Checkout. So, continue. Ich will einfach nur sagen, was Shipping. Ok, wir geben jetzt mal Fake ein. Ich will einfach nur zum Shipping. Shipping. So, Blob, Blob, Blob, Blob in Germany. Germany. 6 0 3 2 9 Frankfurt. Frankfurt. Hessen. Phone Number. Ok, genau. 15 Dollar kostet's. Was? Ja gut, ab spätestens wir, jetzt machen wir nicht weiter. Also 15 Dollar Tracked Package, Tracked Post. Das heißt du bezahlst am Ende 115 Dollar. Also das heißt du bezahlst ziemlich genau 200€ für 10 Stück. Du kannst natürlich auch weniger nehmen, ne? Aber die Versandkosten, also ist halt die Frage, ob sich das so sehr lohnt, ne? Ich bestell mir bei fast allen mittlerweile 10er Packs. Ich hab am Anfang den Fehler gemacht und hab bei vielen Sachen, auch bei kleinen Elektronikkram, hab ich immer eins bestellt. Und du machst so kleine Teile, in den ersten Teilen die Pico hab ich schon gefetzt, ja. Aber weil ich zu doof war. Ich hab die WLAN Antenne abgebrochen aus Versehen, weil ich zu sehr dran gezogen hab. Kann man wieder fixen, kann ich dran löten, ist kein Problem. Hab ich bloß noch nicht gemacht. Ähm, so. Und, äh, deswegen, ich bestell mir bei allen Elektronikdingern mittlerweile entweder 5 oder 10. Oder halt 3, wenn's das anderweitig nicht gibt. Es ist, es ist wirklich sinnvoll, sich mehrere Sachen zu bestellen, weil so Kleinkram, gerade wenn man sich beispielsweise irgendwelche Sensoren holt oder sonst was, die macht man so schnell mal kaputt und dann hat man keinen Ersatz da. Ich hab mittlerweile von den meisten Sensoren halt auch hier ein paar liegen. Also quasi, so Sachen die man immer braucht, paar Widerstände, die gängigsten Sensoren, paar Spannungswandler, da hab ich immer genug da, dass man einfach auch mal Ersatz hat. So, ähm, also wir sehen wir haben freien Speicher, das sind wahrscheinlich Bites, denk ich mal. Bites to Megabytes. Nein, Google. Ja, schon besser. Also wir haben 250, 250 Kilobyte RAM auf dem ESP gerade. Das ist, äh, das ist sogar mehr als ich gedacht hab, ehrlich gesagt. Ich dachte es ist weniger. Ähm, aber man sieht, man kann da keine allzu großen Sprünge machen. Also sprich 250 Kilobyte. Wir haben weniger als 1 MB RAM. Und in meinem Desktop Rechner sind gerade 32 Gigabyte. Also da sieht man mal was das Hardware mäßig so vom Vergleich her ist, ja. Ähm, okay, aber ich hab gesagt wir wollen ein bisschen Progress machen. Gut. Also wir nehmen diese Library hier. Die hab ich im Vorfeld schon rausgesucht. Habe ich es nicht eben schon mal auf. Ja. Den ESP32 HTTPS Server. Ich hab, ich hab da wie gesagt schon ein bisschen mit rumgespielt. Das heißt ich kann jetzt auch ein bisschen abgucken vorher. Ich hab, ich hab hier, also ich will jetzt nicht sagen ich mach das alles komplett blind und ist es nicht. Also ich hab schon ein paar Sachen im Vorfeld ausprobiert und ich hab echt gekämpft mit dem Ding. Also die Library ist bei weitem nicht bugfrei und hat echt ein paar sehr merkwürdige Designentscheidungen. Das werden wir aber gleich sehen. Ich installiere das ganze das erste Mal. Ähm, aber es ist das einzige was ich gefunden habe, was auf dem ESP32 Arduino Kram funktioniert und einen HTTPS Web Server mit TLS bzw. SSL HTTPS hat. Ansonsten hab ich nix gefunden. Das Ding ist so verbugged, ihr werdet es gleich sehen, diese Library ist so verbugged, dass wenn ich die Verbindung abbreche, dann muss ich den ESP neu starten, dass der Server sich wieder, wieder einkriegt. Das Ding ist schon ganz schön im Arsch. YouTube Money klingt halt, wenn man sich direkt für 200 Euro ESPs kauft. Das hat ja mit YouTube Money, ja das ist schon nicht unreich, aber es ist einfach preisleistungsmäßig sinnvoller sich gleich 10 Stück zu kaufen. Die sind natürlich viel zu teuer, muss man auch mal sagen. Also ich empfehle das, übrigens wo war ich jetzt schon. Also ich empfehle euch nicht die Dinger zu kaufen, wenn ihr nicht eh schon ein bisschen damit rum spielt. Wenn ihr anfangen wollt ESP32 zu programmieren, ist es viel, viel einfacher. Ihr kauft euch z.B. eine NodeMCU. Die kannst du dir bei Amazon.de kaufen für ein Apple und ein i. Hier, ATS Delivery. Ne, das ist die falsche ESP. Das ist die ESP32866. Die gibt es teilweise bei Amazon, auch schon Amazon.de. Für 8, 9, hier. Ne. Ja gut, hier kriegst du 3 Stück. 5 Stück. Haben die keine? Das sind die 9, da muss man aufpassen. Das sind die mit USB, wofür es noch nichts gibt. Okay, ja, also gibt es bei AliExpress günstiger. Aber wenn ihr einfangen wollt, kauft euch lieber so ein Board. 1, 2. Wie gesagt, ich würde immer 2 kaufen oder klein 3. Die sind nämlich schon komplett fertig. Die haben mehr Pins als der Tiny und die haben natürlich schon alles vorgelötet. Ihr müsst hier gar nichts machen. Und was können diese Tiny Picos mehr? Die können nicht mehr, die können kleiner sein. Das ist der einzige wirkliche Vorteil von den Dinger, dass die klein sind. Und die sind halt extrem klein. Die sind so klein wie mein Daumennagel, siehst du hier im Vergleich zu einer AA-Batterie. Die sind einfach klein. Das heißt, wenn man die Dinger irgendwo einbauen will, hinter eine Dose in die Wand oder so, da sind natürlich super dafür. Da sind die normalen NodeMCUs ein bisschen dick. Die sind ungefähr, so ein NodeMCU ist ungefähr ein Zentimeter kleiner als ein Raspberry Pi Zero. Ja. Hi Max, gibt es eine Möglichkeit, wenn man auf einem deutschen System einen Double generiert, der mit Komma getrennt ist, in Punkttrennung umzuwandeln und damit man das richtig in einer Datenbank speichern kann, ohne es vorher in ein String zu kommen. Ja, du kannst, warte mal, ne. Du musst das nicht umwandeln. Wenn es ein Float ist und du speicherst es in die Datenbank, dann ist das vollkommen egal. Der Punkt und die, es gibt gar keinen Punkt und Komma in der internen Speicherung von so einem Float, wie du dir das vorstellst. Wenn du einen Double oder einen Float hast, dann ist es egal, ob Deutsch oder Englisch. Deutsch oder Englisch wird erst interessant, wenn du es in ein String umwandeln willst. Davor ist es egal. Wenn du eine Zahl als Double hast, gibt es kein Deutsch und Englisch. Da gibt es nur Double oder Float oder Long oder Long Long oder U Long oder was auch immer. Float ist so der Überbegriff. Kleid, Kleidkomma, Fließkomma, Kleidkomma. Ich bin ja eher für Kleidkomma. Was kann man mit dem ganzen Zeug machen? Bei meiner Schule, beim PC-Raum liegen nur solche Dinge rum. Ein Schüler hat einfach die Dinger auf den Boden geschmissen. Da würde ich den Schüler erst mal anscheißen, warum er einen Dinger auf den Boden schmeißt. So, also, Leute, Max, ich habe nicht mehr lang Zeit. Konzentriert. Also, wir haben nichts gemacht heute. Also, ich habe die Library jetzt installiert. Wie gesagt, Fragen gehen bei mir nicht verloren. Fragen werden hier mitgelockt. Also, ich werde das nachher noch alles beantworten. So, also, was wir jetzt machen ist, wir gehen jetzt mal auf die Seite und gucken uns den Example-Code an. Das ist nämlich recht easy, recht easy zu benutzen. HTML Forms. Das heißt, wir werden zuerst, wir machen, wir machen es gleich mit HTTPS. Das Ziel ist, das Ziel ist ja, dass wir das mit HTTPS machen, aber erst gleich. Also, Examples. So, wir nehmen uns das Formsexample, weil wir Sachen pushen wollen. Und, ja, ich zeige euch jetzt mal gleich, ich zeige euch erst mal, was für eine krasse Qualität diese Library hat. Self-Signed. Wo ist das Beispiel mit Self-Signed? Hier, Self-Signed-Zertifikat. Ich will es euch noch mal beispielsweise zeigen, mit was für einer doch etwas, ja, sagen wir noch, Optimierung, Optimier-Library mit Optimierungsbedarf wir uns hier zu tun haben. Also, erst mal die ganzen Headers include. Ich gebe dir Header. So, HTTPS. Watt? Watt, ich hab's doch installiert. Was hat er für Schmerzen? Hab ich, hab ich die Library eben installiert, oder? Jetzt bin jetzt wir im Kopf. Install. Build. Ah, ich hab Using-Namespace vergessen. Wir sind ja C++, ganz vergessen. Sah der Code gestern ich so, doch. Ah, jetzt funktioniert's. Jetzt muss ich noch mal neu starten, nur dass er meine Header gecheckt. Ich hab mich mal wieder zum Labern hinreißen lassen. Aber jetzt machen wir noch was, jetzt machen wir noch was. Letzte Zeit hier machen wir jetzt noch was. So, bla, bla, SSL-Zert. So, und jetzt passt mal auf, wie kaputt das Ganze ist. Setup. Wir generieren jetzt mal ein SSL, ein Self-Signed SSL-Zertifikat. Weil, ich mein, wir wollen ja einen HTTPS, also einen TLS-Webserver mit SSL haben. Und dazu müssen wir natürlich irgendein Zertifikat hinterlegen auf dem Webserver, dass das überhaupt funktioniert. So, also, KeySize, das hier, wir fancy company, unser Name, das sind die Sachen, die dann später im Zertifikat drinne stehen. Also, unsere Firma, also, Organization, heißt CACW und der Name, wofür das Ganze ausgestellt wird, 122168, 100, nee, keine Ahnung, ist ein Scheiß egal. Vollkommen egal. Es geht eh nicht. So, laufe ich bis 2030, wunderbar. So, jetzt passt mal auf. Ich will euch nur mal zeigen, wie toll die Library funktioniert. Blablabla, funktioniert. Wir lagen jetzt mal hoch. Also, was der jetzt machen sollte ist, ein neues Zertifikat generieren und dann ausgeben, hat funktioniert. Nee, gar nicht. Ja, das hat funktioniert, gibt er nicht aus. Einfach nicht ausgeben, er hat funktioniert. Aber ich kann euch schon mal spoilern, das Zertifikat generieren funktioniert nicht. Warum, weiß ich nicht. Es ist natürlich für einen HTTPS-SSL-Webserver schon mal sehr schlecht, wenn das Zertifikate-Generieren nicht funktioniert. Weil ohne Zertifikate kein SSL und kein HTTPS und sowas. Deswegen müssen wir die Zertifikate jetzt selber generieren. Weil die Library bietet das zwar an, aber die ist kaputt. Wir warten jetzt erst mal, bis er Zertifikate generiert hat. Das dauert ja so 20, 30 Sekunden und dann werdet ihr gleich sehen, was passiert, wenn er fertig Zertifikate generiert ist. Es kann natürlich auch sein, dass es jetzt mittlerweile einen neuen Bug gibt, weil das ist ja schon ein Jahr her, wo ich das ausprobiert habe, dass es jetzt komplett hängt oder so. Mal abwarten. Schauen wir mal ab, das dauert so eine halbe Minute, die Zertifikate zu generieren. Oliver391 sagt Namespaces C++, ja. Leider kommen wir nicht drum herum. Ich hab mir während der Zertifikate, nee, ich will es euch ja zeigen, ich will ja, dass wir sehen, wie er crasht. Craschosaurus rex. Oh, das war Payne's Champ, oder? Kann das sein, dass er gar nichts macht gerade? Dass er einfach nur hängt? Komplett hängen geblieben. Sollte es, ich kann euch spoilern, es funktioniert nicht. Zertifikate generieren ist kaputt. Wir sehen es ja gleich. Ich hab mir nämlich noch was anderes gekauft. Das müssen wir auch demnächst mal im Stream ausprobieren. Ich hab mir nämlich ein Meadow bestellt. Das ist, den hab ich mir schon vor 2-3 Monaten bestellt. Das ist ein Microcontroller, den man angeblich komplett mit.NET und C sharp programmieren kann. Mit ziemlich viel Leistung drinne sogar. Oh, was? Moment. Das Zertifikate-Galerien hat funktioniert? Das ist gestern immer abgekackt? Ja, wie denn das? Warum geht denn das jetzt? Ich bin begeistert. Wisst ihr, was ich jetzt mal mache? Nur für den Fall der Fälle, dass ich noch mal einen funktionierenden Example brauche hier. Aber es keck weh, hab ich keck weh gemacht. Get in it. Ich check das mal kurz ein. Geht, warum auch immer, dass ich es wieder kriege. Okay, das war so nicht geplant, weil gestern ist es die ganze Zeit abgekackt. Ich mach mal die kleine Key-Size, weil die ist definitiv immer abgeschissen gestern. Komisch. Ein nicer Vorführeffekt, ja. Hallo Marvcat. Unglaublich, dass was funktioniert, ja. Diese Fehlerbehandlung hier ist auch Wahnsinn. Das funktioniert? Es funktioniert einfach. So, dann bin ich mal gespannt, ob der Web-Server jetzt auch funktioniert. So, gut. Also wenn das Zertifikat-Generieren nicht funktioniert, dann sagen wir Restart. Wir machen noch mal eine weitere Funktion und sagen jetzt in it WLAN, in it Wi-Fi oder was auch immer. Und da schieben wir den ganzen Kram hier rein und rufen das in it Wi-Fi hier auf, weil ich will meinen Setup-Funktion ein bisschen sauberer halten, dass ich durchblicke, was da eigentlich passiert. Nur durch die Kraft des Q-Chats tatsächlich, ja. Nur dadurch, ohne Scheiß, Leute, ich hab das Gleiche gestern probiert. Der ist mir bei jedem Zertifikat-Generieren verreckt. Ich hab keinen Schimmer, warum das jetzt funktioniert. Ich will mich ja nicht beschweren, dass es geht. So, jetzt haben wir nen Zertifikat. Jetzt haben wir nen Server. Was macht der jetzt hier? Der gute Server-Start. Ja. Server. Also wir haben jetzt nen Zertifikat. Hiernach haben wir nen Zertifikat. Wir weisen das Zertifikat dem Server zu, sagen ihm noch, wir wollen auf Port 443 lauschen. Müssen wir nicht. Das ist Default. Und wir wollen 20-20 Verbindungen maximal. 20 ist viel zu viel. Das kann das Ding wahrscheinlich eh nicht ab. Was sind die Sternchen in C++-Kommentare? Nee. Welche? Sternchen? Ah, hier. Da ist ein Pointer. Nicht zu verwechseln mit dem da. Das ist eine Speicheradresse. Ein Pointer ist keine, nicht nur eine Speicheradresse. Das hier ist eine Speicheradresse. Das hier ist eine Kombination aus Speicheradresse und Typ. Das ist der Unterschied zwischen Pointer und Speicheradresse. Das war eigentlich so im Nachhinein, war das eine ziemlich kurz und knackige Erklärung für Pointer, oder? Pointer ist eine Speicheradresse und ein Typ. Das ist eigentlich eine ziemlich gute Erklärung. Big, big brain. Ah, yes. Excellent. Danke Max, das wird mir bei meiner Klausur helfen. Also wenn der Lehrer sagt, das ist falsch, dann ist er ein Kacknoob. So, also Server gestartet. Hier, Server start, müssen wir jetzt noch eine Webseite oder irgendwas, wo man was abrufen kann vom Web-Server. So, brauchen wir noch Funktionen. Übrigens, jetzt noch mal was schönes C++-mäßiges, was mich auch schon wieder komplett verwirrt. Wobei, machen wir nachher, machen wir nachher, weil es könnte sein, dass es hier tatsächlich sogar funktioniert. Update und wir wollen da einen Post machen, weil wir wollen ja unsere neue Firmware hochschieben. Lehrer sind halt öfters Kacknoobs als einem Lieb ist. Das ist korrekt. Excellent. So sieht's aus. Wo hat er hier die Funktion? Die Funktion für, das nennen wir übrigens nicht Handle Root. Handle Root wäre ein ziemlich blöder Name dafür. Das nennen wir Handle Update, weil wir den Update hochpushen und wir machen den ganzen Klempel raus. So, yes. Handle Update. So, man könnte jetzt hier annehmen und das jetzt mal kompilieren, mal gucken, dass das funktioniert. Ja, funktioniert. Man könnte jetzt hier annehmen und wahrscheinlich, dank der Macht des QChat, funktioniert wahrscheinlich das auch, aber ich hab's gestern probiert mit einer Websocket-Verbindung, da hat es nicht funktioniert, weil ich zu doof war, die richtige Syntax zu finden, wahrscheinlich. Man könnte jetzt davon ausgehen, es würde sich hier anbieten, wenn man was Kleines, hier einen kleinen Funktionsaufruf programmieren will, der nur ein paar Zeilen lang ist, dann würde es sich anbieten, das über einen Lambda-Aufruf zu machen, würde man denken, weil das hat der C++ mittlerweile. Also sprich, dass wir nicht eine extra Funktion hier oben definieren, die aufgerufen wird, wenn einer einen Postrequest auf diese Uhr macht, sondern ein Lambda-Request und ich hab's gestern mit Websocket-Verbindung versucht, das hat uns verrecken nicht funktioniert. Mal gucken, ob das jetzt funktioniert. So, anscheinend, anscheinend ist das eben eine Websocket-Problem. Gut, das würde funktionieren, aber wir machen es trotzdem mit einer eigenen Funktion. C++ Pros, wofür ist das und hier davor? Weil das geht mit und und ohne und. Wo ist da der Unterschied? Warum geht das mit und ohne und, was bedeutet das und überhaupt? An der Stelle. Es kann keine Adresse, es kann keine, es kann ja keine, keine Referenz sein an der Stelle. Oder doch, oder nicht? Was ist das und an der Stelle? Ich verstehe, C++ leuchtet mir an manchen Sachen einfach nicht ein. Wie kommst du immer auf die Musik? Ich hab ne Playlist mit tausend besten Nintendo-Songs. Aber ich glaub nicht, dass das an der Stelle hier ne Referenz ist zu dieser komischen Funktion, weil warum geht es mit und und ohne und? Was hat Max überhaupt vor? Ich will meine Microcontroller über WLAN mit neuer Firmware updaten können und das Ganze über HTTPS. Und ich hab mir wieder so ein Thema rausgesucht, was vor mir anscheinend noch keiner gemacht hat. Und wohlgemerkt nicht einfach die Firmware abrufen, sondern die Firmware pushen zum Controller. Und es gibt einfach nix Fertiges und es gibt keinen, der das gemacht hat vorher. Ich weiß auch nicht, warum ich immer so komische, so komische Dinge mir aussuche. So, ähm, jetzt müssen wir noch dem Server sagen, dass er auch unter slash update das Ganze verwenden soll. Das nennen wir das Ganze nennen wir nicht Node, das nennen wir Update-Node. So. Und wenn ich das jetzt hoch lade, dann sollte ich mit Curl schon mal drauf zugreifen können. Und da sehen wir schon das erste Problem dieser Library. Und zwar, dass sie endlos schleifen, fabriziert, die ich nicht außer einem ESP neustart beheben kann. Werdet ihr gleich sehen. Zeig euch gleich. Über HTTPS, äh, ein Dodo, über HTTPS ist es relativ einfach. Äh, Secure Server Loop müssen wir noch. Hallo? Ok. Warum ist das jetzt denn? Ah, weil da Pointer. Dann sind die Beispiele komisch. Man macht das mit Pointer, man macht das hier als Referenz und man macht das als globale Variable. Ok, das ist auch wurscht. Ähm, machen wir das so. Hochladen. So, und dann greifen wir mit nem Curl drauf zu. Curl auf OE. Warte mal, was hat das Ding? Äh, welcher IP hat's gekriegt? Ich hab's gar nicht geguckt. Mal kurz mal schauen, was das Ding für ne IP kriegt. Ja, das ist, das ist in C++ nicht immer so einfach. Und ist nicht immer Adresse. Zum Beispiel hier ist das und was anderes. Die mögen in C++ doppelte, doppelte Bedeutung von Dingern. Oh ne, äh, ja, Adresse. Die sind eben Meister in doppelten, doppelte, doppeldeutigen Sachen in C++. Ok, jetzt versuchen wir mal unsere Firmware hochzuladen. Ich mein, die wird nicht funktionieren, aber, ähm, dass ihr mal seht, was passiert, wenn man's probiert. Also, wir machen jetzt den Curl und zwar ignorieren wir mal alle Zertifikate und rufen einfach nur mal die, die Adresse auf. Gut. Sagt der New Connection. Funktioniert nicht, weil es ist ja kein Post. Also sagen wir ihm, wir wollen das mit, als Post machen. Ich hab's ja hier als HTTP Post registriert. Ah, funktioniert auch. So, und wenn wir da jetzt was hochladen und zwar mit, äh, Binary, äh, Data, Binary. Genau, und jetzt laden wir mal unsere Firmware hoch. Ich glaub, Add, oder? Oh ne, äh. Curl. Ja, wo ist unsere Firmware? Build. Firmware bin. Pst, ich bin mir nicht sicher, ob ich ein Add davor machen muss. So, ähm. Was ein Add. Ah, jetzt, jetzt funktioniert der Upload, genau. So, und jetzt seht ihr schon ein Problem. Wenn ich das jetzt abbreche, was ja durchaus mal sein kann, dass ich den Upload abbrechen will, dann wird das Ding jetzt gleich in der Endlosschleife hängen bleiben. Gegen die ich nichts tun kann. Weil das irgendwie diese komische Web-Server-Library äh, intern macht. Das Einzige, was ich an der Stelle machen kann, ist, ich hab alles ausprobiert, Leute. Ich hab heute Morgen zwei Stunden daran rumgedockt, ich habe keinen Weg gefunden, dem Ding zu sagen, Scheiß auf die, was juckt ihn überhaupt, Connections, die geschlossen wurden. Ich habe dazu keine Lösung gefunden. Ich hab sogar auf GitHub geguckt, das haben andere Leute über diesen Fehler berichtet und gibt kein Ergebnis zu. Das ist natürlich was, das ist komplett für'n Arsch und kann man auf gar keinen Fall so verwenden. Weil, wenn du mal ein Update pusht, ja, übrigens der Server ist jetzt auch kaputt, da geht jetzt, da geht das nicht mehr, ne. Der ist jetzt, der ist jetzt hinüber. Der muss ich jetzt neu starten. Also ne ganz schlechte Situation für ne Sache, die irgendwo in der Wand steckt, die ich nicht einfach so neu starten kann. Also sprich, wenn ich, wenn ich den Upload cancel, dann gehts kaputt. Das ist schon mal absoluter Fail. Keine Ahnung, was sie da zurecht programmiert haben. Und ihr seht, ich mache noch nichts. Also es kann, es kann gar nicht an mir liegen, weil mein Handle-Funktionier ist komplett leer. So, das ist das erste Problem, was ich mit der Library hatte. Dass die Endlosschleifen fabriziert gegen die ich nichts machen kann. Deswegen habe ich mir gedacht, wir machen Monka Big Brain Lösung. Und zwar, ich zeig euch jetzt mal die Big Brain Lösung. Und zwar, machen wir jetzt ne Schleife. Und wir starten den ESP einfach neu, wenn der Web-Server hängt. Es ist zwar ne mega hässliche Lösung, aber sie funktioniert. Das heißt, sollte der Web-Server hängen, starten wir den ESP neu. Wenn ihr ne bessere Idee habt, schießt los, ja. So und was ich da rausgekriegt habe, wie man jetzt lesen kann, was man hier, also was das Curl macht hier ist folgendes, minus K ignoriert das Server-Zertifikat. Weil mein Server-Zertifikat ist natürlich nicht gültig. Weder das hier noch meine Organisation KeckW und die Zertifizierungsstelle ist nicht gültig. Also Curl wird auf jeden Fall meckern, Zertifikat ist ungültig. So, das macht minus K insecure. X sagt, die Methode, die er verwenden soll, sich zum Server zu verbinden, das ist ein Postrequest. Das ist kein Get-Request, wie man hier sieht, hab ich auch eingestellt. Das Update ist quasi geroutet nur für Hostrequests. Hat der Controller einen Watchdog Timer? Ähm, ja. Ja, aber der schlägt nicht zu an der Stelle. Oder ich müsste den irgendwie von Hand reinbauen oder so. Den hab ich aber noch nie gemacht. Der schlägt nicht zu, weil die Main-Loop läuft weiter. Das juckt dir nicht. Aber das könnte ich machen, irgendeinen Timeout setzen. Irgendeinen Timeout setzen und wenn es bis dahin nicht resettet ist, dann starte neu. Irgendwie sowas. Ähm, aber ich zeig euch jetzt mal, was ich mir überlegt hab. Zumindest, er geht auf diese Uhr und postet dann unsere Firmware, unser Firmware-Binary, postet er, also schickt er an den Web-Server vom Controller. So, und deswegen hab ich überlegt, was wir machen können. Das hab ich im Vorfeld natürlich schon mal ausprobiert. Sonst wäre das hier komplett hereinfallen. Und zwar, man kann gucken, ist Request complete? Das heißt, wir machen jetzt in meinem Händler in die Funktion mal eine Schleife rein, die so lange läuft, bis ich diesen kompletten Request eingelesen hab. Also quasi alles, bis ich alles eingelesen hab. So, und, ähm, jetzt muss ich grad mal gucken, an welcher Stelle ich das hier mache. Genau, und jetzt lesen wir erstmal den Request ein. Dazu brauchen wir einen Array mit, der war irgendwie mal ein Buffer mit, ähm, keine Ahnung, 512 Bytes. Request, Read. Und zwar readen wir jetzt, size, in den Buffer, also sprich, wir lesen jetzt das hier ein, on the fly, was wir hier hoch uploaden gerade. So, äh, also read Bytes in den Buffer, äh, mit der Länge 512. Also, wir lesen so viele Bytes ein, wie in unseren Buffer reinpassen. So, äh, was wir jetzt auch sehen werden ist, dass es, ich zeige euch mal, dass es prinzipiell funktioniert. Wir lassen uns jetzt mal hier ausgeben, die, ähm, Request, Konter, also die Länge, die noch drinnen ist in dem Buffer, und ihr werdet sehen, dass es bei jedem Durchlauf, wird das weniger. Und jetzt, ich machte, ich führte es jetzt erstmal aus, danach zeige ich euch mal den Trick, den ich mir überlegt hab, was wir machen können. Aber erstmal uploaden wir das Teil. Oh, im Chat, man, big brain Sachen. Ähm, schreibe das ganze mit Python, lösen sich viele da, nee, nee, nee, in dem Fall nicht. Hab ich mir kurzzeitig überlegt, heute Morgen, ob ich das machen soll. Erstens, findest du auch wenig zu, ähm, MicroPython, ESP32 mit SSL-Unterstützung. Scheint wohl zu gehen, aber wo es komplett aufhört, ist, äh, ESP32, SSL und Secure Websockets in Python. Da schaffst du eine Verbindung und danach stürzt das Ding mit Out of Memory ab, hab ich auf GitHub gefunden. Dazu kommt, dass du aus MicroPython die ganzen C-Libraries nicht verwenden kannst, die du für irgendwelche Sensoren und Hardware brauchst. Du musst halt hoffen, dass es welche dafür gibt. So, ähm, ich lade jetzt mal was hoch und dann werdet ihr sehen, der Upload an sich funktioniert. Guckt die, seht ihr, die Content-Länge wird immer weniger. Also sprich, der Uploadet hier und ich zeig euch jetzt mal den krassen, den, den, den Über-Curl-Hack, den, den keiner kennt. Hier habt ihr, hier habt ihr ihn zuerst gesehen, Leute. Jetzt zeig ich euch, er war übrigens fertig mit Uploaden. Pass mal auf, den über-krassen Curl-Hack. Wisst ihr, dass ihr bei Curl angeben könnt? Procress, Procress Bar und dann passiert nichts, wenn ihr das angibt. Ist euch vielleicht auch schon mal aufgefallen, dass die Procress Bar bei Curl nicht funktioniert? Guckt, die Procress Bar funktioniert nicht. Und jetzt zeig ich euch, was ihr machen müsst, dass die Procress Bar funktioniert. Übrigens, ich kann jetzt nicht abbrechen, wenn ich jetzt abbreche, hänge ich wieder Endlosschleife drinnen. So, und jetzt zeig ich euch, jetzt zeig ich euch mit Tricks 17. Ihr müsst das ganze pipen nach Def Null und schon habt ihr eine Procress Bar. Wieso? Ganz hundertprozentig habe ich es auch nicht verstanden. Anscheinend ist es so, dass Curl den Standard Out benutzt für Response vom Server. Und quasi Response vom Server irgendwie mit der Procress Bar konkurriert. Und wenn ich das ganze, also T-Splitter das ganze Jahr in der Datei und Standard Out, und wenn ich den Standard Out dann umleite nach Def Null und Curl irgendwie denkt, und Curl irgendwie denkt, ich habe, ich möchte den Standard Out vom Server Response nicht haben, dann zeigt er, dann zeigt er die Procress Bar an. Ich weiß auch nicht, wer sich das wieder überlegt hat. Das ist Matt, also eigentlich ist das nicht Big Brain, das ist ziemlich, ziemlich Low Brain von Curl Entwicklern. Man kann es den Leuten auch einfacher machen. Aber wenn ihr bei Curl eine Procress Bar haben wollt, dann müsst ihr es nach T-pipen und das T als Datei in die gesplittet wird Def Null. Dann macht Curl eine Procress Bar. Six header. Ok, so. Und jetzt zeige ich euch mal den Trick, den ich mir überlegt habe, was wir machen können, dass das System nicht mehr in der Endlosschleife hängen bleibt. So, und zwar, ja. So, und zwar was wir machen ist, wir speichern uns, also sprich wir merken uns, wie viele Bites wir schon eingelesen haben. Also sprich, da sagen wir hier File Length plus gleich S. Also sprich in S oder nennen wir es mal, man könnte es auch Size nennen oder ich könnte es auch direkt da reinschreiben lassen. Das ist wahrscheinlich eher C-Style, dass es ein bisschen kryptischer aussieht, noch alles. Was der jetzt macht ist, der liest quasi von dem, was ich uploade in diesen Buffer und die Funktion gibt die Menge der gelesenen Bites zurück. Das heißt in File Length haben wir quasi nach jedem Durchlauf dieser Schleife drinne stehen, wie viele Sachen wir eingelesen haben. Laut Stack Overflow würde sogar Curl Procress Barket ausreichen. Aha, können wir gleich mal ausprobieren. So, und was wir jetzt machen ist, einmal, hier drinne werden wir unsere Firmware updaten, also sprich, wir brauchen es übrigens doch als eigene Variable. So, wenn wir was eingelesen haben, dann machen wir hier Firmware to Flash, dann speichern wir das neue Zeug auf dem internen Flash Speicher. Weil wenn wir was eingelesen haben, möchten wir es ja speichern, dass wir Rebooten können und die neue Firmware ist da. So, und was wir jetzt aber machen, jetzt kommt mal, was sehr eklig ist, wieso nicht File Length größer Null, das wirst du gleich sehen. Weil File Length ja nach dem ersten Durchlauf immer größer Null ist. Und es bei jedem Durchlauf neu gesetzt wird und was wir jetzt machen ist, aber der Patrick ist da schon auf dem richtigen Weg, jetzt gucken wir, lsif, wenn File Length größer Null ist, und dann bedeutet das nämlich, in dem Fall, s ist nicht größer Null, das heißt, wir wechseln in diesen lsif rein. Also sprich, wenn wir in diesem lsif ankommen, bedeutet das, s ist kleiner gleich Null. Also Null in dem Fall, weil er kann nicht negativ lesen. So, und das heißt, wenn wir jetzt hier haben, also in dem Fall, ich schreib's mal aus, s gleich gleich Null ist es in dem Fall, das ist aber impliziert schon, weil sonst würden wir hier gar nicht ankommen. Aber ich schon was eingelesen habe, dann bedeutet das, der Client hat abgebrochen. Es könnte natürlich auch bedeuten, mein Client ist einfach unglaublich langsam, aber dann hab ich nen Bug drinnen. So, und in dem Fall, wenn das hier zusammen eintritt, dann würde das nämlich bedeuten, mein Server bleibt in der Endlosschleife hängen. Und deswegen machen wir an dieser Stelle einfach die Holzhammer-Methode und restarten den ESP. Ist das nicht ne schöne Lösung? So, jetzt gucken wir mal, ob der ganze Kram funktioniert. Big Brain-Lösung, Big Brain-Time, Alter. Das ist übel, ich kann nix dagegen machen, dass das Ding Endlosschleife produziert. Ich könnte jetzt die Library downloaden, als es geht, klonen hier nach lib rein und versuchen den Fehler bei dem zu fixen, aber hab ich ehrlich gesagt gar keinen Bock drauf. So, und jetzt passt mal auf, was passiert. Jetzt starte ich den Upload. Upload. Server restarten, das sag ich gleich mal zu. Upload, so, jetzt brech ich ab und jetzt kackt der Server ab und BAM, ESP startet sich neu. Funktioniert und geht wieder von vorne los, sehr schön. Funktioniert. Server neu starten geht nicht, weil, wenn man sagt, also ich hab's ausprobiert. Server. Ich kann's noch mal machen, vielleicht geht. What the fuck. Mein Visual Studio Code hat sich grad beendet. Java-Script in 2020. Java-Script in 2020. Ich mein, wir können das mal ausprobieren. Anstatt, anstatt hier neu zu starten, mach ich mal, Secure Server stopp. Hallo, ah nee, stopp und Secure Server start. Also, ich hab das nämlich schon ausprobiert und das Phänomen, was ich dann hatte, ist, dass, ähm, der hier blockt und meine Main Loop gar nicht mehr läuft. Also sprich, der Server ist nicht stopp- und startbar, der geht dann kaputt. Was natürlich auch für die herausragende Qualität dieser Library spricht. Dass es eine stopp- und startfunktion gibt, die aber nicht funktioniert. Controller willst du nicht uploaden? Controller willst du nicht uploaden? Ach, wie wär's? Press F. So, ähm, ich zieh mal raus. Machen wir da rein. Nee, also Patrick, ich hab das vorher mehr an unterschiedlichsten, ähm, ich hab das vorher an unterschiedlichen Sachen ausprobiert. Ich hab auch ein extra Task aufgemacht und hab das Handling von Server starten, stoppen, äh, quasi gemacht, nachdem ich aus der Funktion raus bin, in einem extra, in einem extra Thread noch mal. Und ich hab vorher extra in der, in der Main Schleife gesagt, wenn ich grad in der Fehlerbahn bin, dann nicht ausführen. Also, es hat nicht, es hat nicht funktioniert. Aber wir können ja mal gucken, vielleicht kriegen wir, vielleicht kriegen wir es jetzt ja gebacken. Also so funktioniert es definitiv nicht. Das hab ich nämlich schon ausprobiert. Guck, wenn ich jetzt hier was uploade, lass mal warten, bis der anfängt. Upload läuft, sprech ich ab und... What? Der, der startet, stoppt jetzt die ganze Zeit den Server und das juckt den überhaupt nicht. Das war jetzt natürlich ziemlich bescheuert, weil ich hätte hier nochmal sagen müssen, return. Ähm, ja, abbrechen müsste ich das Ganze auch schon. Oder, oder was heißt return, wir können auch einfach sagen, break, haben wir das gleiche raus. Also Patrick, ich hab's vorher ausprobiert, der blockt irgendwie komplett. Aber vielleicht kriegen wir es ja hin. Machen wir noch kurz Zeit. Und wisst ihr, was das geile ist? Ähm, ich muss morgen nicht aufstehen früh, ich kann wieder Homeoffice machen. So, äh, ein Command für die Playlist, könnte man machen. Äh, mach so einen Check, ob die Daten, die ankommen, auch wirklich valid sind. Ja, es ist, es ist eine TCP-Verbindung, also ich würde mal sagen, dass übertragungsmäßig sollte nichts kaputt gehen. Aber ja, du hast recht, man sollte, man sollte eigentlich nochmal ne Check-Summe machen. Das wäre, das schreib ich immer als To-Do auf. So, guckt und jetzt hängt, hängt meine Main-Loop. Geht nichts mehr. Nach Start, Stop vom Server. Und wenn ich dann nochmal versuche, was hochzuladen, ist Crash angesagt. Bam, in your face, kaputt. Aber wir können, wir können es mal probieren, vielleicht kriegen wir, vielleicht kriegen wir es ja gebacken. Ähm, ok, da schreiben wir noch einen To-Do auf. Äh, was hab ich grad gesagt? Ja, Leute, mein Hirn. Äh, Check-Summe. Check-Summe. Gucken wir mal, was wir machen. So, also das heißt, das, das, das funktioniert so an der, an der Stelle, an der, an der Stelle schon mal nicht. Was wir machen können ist, das hab ich vorher auch schon mal ausprobiert, wir können sowas hier mit dem Bool, keine Ahnung, Handle, Error, is false. So, dann können wir an der Stelle sagen, nicht Handle, nicht Handle, Error. Handler, Error. Handler-Error ist true. So, dann geht er raus. Dann gehen wir in unsere Main-Schleife rein und sagen hier, aber wie gesagt, ich hab's vorhin ausprobiert, das hat nicht funktioniert. Aber, weißt ihr nicht, die Macht des Qt-Chats ist, ist ja, ist ja heute, äh, kann viel ausrichten, ja. Also, if Handler-Error, dann, ähm, sagen wir, Secure, Secure-Server, Stop. Ups. Stop. Da machen wir nochmal ein Delay rein. Ah, man weiß ja nie. Wir machen mal, wir machen mal ein Delay davor, ein Delay danach, man kann nicht genug delayen an der Stelle. Und dann ist aber Start. So, ähm, else, Handler-Error setzen wir wieder auf false. Und hier machen wir die Loop rein. So, Patrick, sowas in der Richtung meinste, ne? Ich mein, das ist zwar nicht so ganz so schön, ähm, weil wir das als nächsten Durchlauf machen, aber es sollte funktionieren. Aber ich hab's ausprobiert, funktioniert nicht. Aber vielleicht, vielleicht funktioniert's ja doch. Wir können's noch locken oder sowas. Denn der Händler sollte eigentlich aufgerufen werden, hier, wenn ich in der Loop drinnen bin. Weil, wozu, wozu muss ich's sonst machen? So, als Upload starten. Pointer, Pogger, sieben Monate, dankeschön. Abbrechen. Bäm. Klein Closed. Und die Main Loop läuft nicht mehr. Also sprich, ähm, der hängt, der hängt, der ist hier noch drinnen, der ist mit der Loop noch gar nicht fertig. Also, müsste man irgendwie, irgendwie einmal warten oder so, bis er mit der Loop raus ist. Aber das kann ja eigentlich nicht sein. Der kann nicht in der Loop hängen, weil er ist hier, wenn er stoppen muss. Also, der stoppt, der stoppt ja nur, wenn Händler-Error ist. Das heißt, er geht nie aus dieser Loop raus. Das ist total fail. Ähm, mach den trotzdem mal volatile. Was denn? Was soll ich volatile machen? Den Händlerror. Muss man das zuerst schrei-, äh, wie schreibt man das Wort? Ne, vor-, so. Macht man das zuerst? D-d-d-d-d-d-d-d-d-d-d. Huge Upload Speed. Was ist denn volatile? Das krieg ich aus dem Kopf nicht genau hin. Das ist irgendeine Compiler-Anweisung, dass er Dinger, Dinger nicht macht, die er normalerweise optimieren würde. Ich glaub, das ist, das ist, ich glaub, das ist, äh, Optimierung ausschalten. Ja, genau. Also, Patrick, der kennt sich damit aus. So. Upload läuft, zack. Ah, Grip. Also, für'n Arsch. So. Das-, deswegen, so, so Dinger hab ich auch schon rumprobiert heute Morgen. Ähm, was ne Kack-Library. So meine Worte. Übelster Crap. Aber die einzige, die es gibt. Deswegen bin ich hier auf meinen Neustart gekommen. Ich gestehe, dass ich kaum was verstehe, aber trotzdem gern im Stream schimmel. Das ist schön, wenn du so gerne da bist. Wenn du willst, dass ich dir was erklär, äh, kann ich das jetzt erklären? Ich mein, ich kann jetzt nicht die komplette, äh, nicht vom ersten If an erklären, aber wenn du konkrete Fragen hast, schieß immer, immer los, schieße, ne? Kannst du nicht einfach im Restobjekt einen Statuscode setzen und damit aus der Funktion-, ich geh doch aus der Funktion raus. Hier, guck mal. Ich geh ja hier raus. Break und danach ist Schluss. Hier ist vorbei. Also der, der geht nach Break raus. Ich mein, ich kann den Return machen, aber das dürfte jetzt keinen großen Unterschied machen. Ja. Aber in Rest ist nichts gesetzt. Das macht keinen Unterschied. Ähm, das macht keinen Unterschied. Das hab ich auch schon ausprobiert. Aber wie gesagt, die Library ist busy, ähm, kaputt. Wir können aber ruhig noch ein bisschen rumprobieren das nächste Mal. Ähm, ich hab jetzt nicht mehr allzu viel Zeit. Wir können ruhig das nächste Mal rumprobieren, ob wir das irgendwie noch gebacken kriegen. Also ich bleib jetzt erstmal bei meiner Geschichte hier. Ich lass ihn jetzt erst mal restarten. Einfach die Hardcore-Variante restart. Ich würd jetzt gerne noch mal ganz kurz probieren, ob der Sache, das Firmware-Update noch ein bisschen näher kommt. Und zwar, was er jetzt hier her macht ist, er liest ja das ein, was ich pushe zum Server. Und das heißt, an der Stelle kann ich meine Firmware schreiben. Ähm, am besten sollte ich natürlich danach zumindest noch mal oder on the fly in irgendeiner Form, wie auch immer ich das am besten mache, muss ich mir mal überlegen. Ähm, Check-Summe drüber machen. Aber wir scheißen jetzt mal auf Check-Summe. Ja, ich mein, im Zweifelsfall, ich hab's per USB dran und ich kann's immer neu flashen. Man kann's ja gar nicht komplett kaputt machen. Ich kann's ja nur kaputt machen, dass ich über WLAN nicht mehr flashen kann. So, hauen wir mal das Update-Header rein, wo man ESP32 und ESP266 Updates mitmachen kann. Jancu300, schön, dass du da bist. Er schreibt, es ist so schön, deine Stimmen zu hören, Max. Kenne dich schon seit den ersten Tagen. Es ist nice, dass du den Weg in den Stream gefunden hast, auch wenn das hier in dem Stream natürlich was ganz anderes ist, als auf YouTube. So. Ähm. Mach das mal, Patrick, bester Mann. Such mal. Aber die Library ist auch nicht schön programmiert, also du wirst Spaß haben. Ähm, gut. Also wenn man über WLAN ein Update auf dem ESP starten will, dann muss man als erstes erst mal sagen, Update, äh, Begin. UpdateBegin braucht eine Funktion, ist, äh, äh, braucht als Parameter, ähm, wie groß das Update ist. Dass es checken kann, ob es genug Platz hat. Das heißt, man muss jetzt erst mal hier gucken, dass wir uns mal speichern, wie groß, wie groß meine, wie groß mein Update ist, also dass die Firmware, die ich hier hoch lade, wie groß die ist, das kriege ich ja aus Content-Length raus. Jetzt kann ich sagen, ok, wenn genug Platz ist auf deinem internen Flash, dann leg los. Ähm, das heißt, ich muss das jetzt natürlich noch überprüfen, sonst wäre das... Was hatte der jetzt für Schmerzen? Ah, yes, Visual Studio Code zeigt Blödsinn an. Äh, was programmierst du grad da? Äh, eine Möglichkeit, dass ich über WLAN eine neue Firmware auf meinen Microcontroller pushen kann. Ähm, über HTTPS. Pushen, nicht pullen. Warum Pointer statt Referenzen? Hä? Auf was beziehst du dich? In dem Fall ist ganz einfach, weil die Library das so haben will. Das ist ein ESP32, das ist ein ESP32, den ich hier grad hab. Ich hab so einen hier, am Start, dafür. Äh, Stein des Anstoßes, oder warum ich das jetzt mache, ist eigentlich das. Ich hab ja meine Klingel etwas smarter gemacht, mit einem ESP32, mit so einem, der steckt in der Gegensprechanlage in der Wand. Und die Update-Funktion, die ich da aktuell drauf hab, ist ein wenig fehleranfällig. Ich hab's schon geschafft, das Ding... Da gibt's keine fertigen Lösungen für HTTPS, gibt's nicht. Ähm, für HTTPS ist es easy, mit HTTPS ist es schwierig, findste ganz wenig dagegen. Äh, findste ganz wenig dazu. Und ich hab' das hier in der Wand stecken und ich hab's ja schon mal geschafft, das Ding zu deadlocken, also über WLAN-Update. Bisschen verkackt. Deswegen wollte ich jetzt mal ne ordentliche WLAN-Update-Sache programmieren, dass ich auch meine Controller updaten kann, die in der Wand verbaucht sind, ohne dass ich Gefahr laufe, dass ich erstmal Strom ausschalten muss überall. So, also wir müssen jetzt gucken, ob genug Platz ist. So, wenn Update-Beginn nicht funktioniert, dann sagen wir Update-Print-Error auf unseren Debug-Ausgabe. Smart-Klingel. Ja, hab ich im letzten Stream erzählt, was ich gemacht hab. Und zwar, ich hab' immer ganz kurz gesagt, ich hab' ne Siedeltelefonanlage aus, da hab' ich nen ESP32 in das Gegensprech-Apparat eingebaut. Also nicht eben auf der Straße, sondern in dem Handgerät. Ich zeig's euch. Ich hab' doch hier letztens, wo hab ich denn das Bild dafür? Post. Image. Äh, wo... Wo hatte ich denn Punkt CC? Ah, Leute, wo hatte ich denn das, das letztens auf hier? Hatt' ich das auf Windows auf oder hatt' ich das? Fuck. Wo hatt' ich das denn auf? Okay, hier schonmal nicht. Ich hab' doch ein Bild von dem gemacht. Wo ist denn meine History? History. History. Post. Wo ist das denn? Bin ich jetzt total hängen geblieben? Wo... Wo ist mein Bild? Das war Picture-Upload, jaja. Irgendwas mit Post war das. Picture. Aber warum ist das nicht in der Historie drin? Das verwirrt mich viel mehr. Hatte man das vielleicht in Chrome offen? Post. Ein farbiger Stuhl Abdeckung. Äh. Äh. Tja, Leute. RIP. Keine Ahnung mehr, wo das hin ist. Das war... Irgendwas mit Punkt Post Image. Punkt CC oder irgendwie sowas war das, glaub' ich. Ja. Post Image. Hatte man das hochgeladen? Sag' mal. Das kann doch nicht sein. Warum ist das nicht in der Historie drin? Hatte man das vielleicht in Firefox auf? Ah nee, das ist ja der Firefox. Hatte man das dann vielleicht in Chrome auf? Warte mal, ist das in Chrome oder in Firefox? History. Vor zwei Tagen. CC. Ich hab' kein Schimmer vor das Bild hin. Das ist echt nicht... Sehr merkwürdig. Ähm. Na gut. Wie dem... Wie dem Ausseier. Irgendwie... Man hat überall History und jeder lockt was mit, aber wenn er mal was mitlocken soll, dann geht's nicht. Das ist echt nicht merkwürdig. Wie... Der Chat weiß es wieder. Der Chat weiß es. Hier. Der Chat weiß es. Da ist das Bild. Krass. Woher der Chat das wieder weiß. So. Und dahinter. Hinter diesem Gegensprechgerät. Da steckt ein ESP32 in der Wand. In der Dose. Und es ist ziemlich doof, wenn man das Ding updaten will. Wenn sich's aufhängt beim Update. Weil man Scheiße programmiert hat. Weil da muss man das Ganze abmachen und die Strom abmachen und die Strom wieder reinmachen. Das sackt massiv. Und deswegen will ich jetzt ein ordentlicher Updatevorgang programmieren. Und ich will das Update halt pushen auf den ESP. Und ich will... Das hab ich mir in den Kopf gesetzt. Das ist eigentlich ziemlich dumm. Ich will das über HTTPS machen. Über HTTPS ist es gar kein Problem. Gibt sogar fertige Sachen vorne und selbst zu programmieren. Ist auch total easy. Über HTTPS gibt's kaum was. Und was macht der ESP in der Telefonanlage? Der ist nicht in der Telefonanlage. Das ist nur dieses Gegensprechding. Telefon von der Tür-Gegensprechanlage. Der ist da angeschlossen und guckt, ob's klingelt. Und zwar folgendermaßen. Da ist so eine kleine, wirklich nur aus vier Bauteilen Schaltung dran. Die quasi guckt, welche Spannung auf der Leitung drauf ist. Und wenn 24 Volt oder größer 20 Volt auf der Leitung sind, signalisiert das Ding damit, dass es klingelt. Und wenn es das feststellt, dass es klingelt, dann schickt es eine Nachricht an meine Heimautomatisierung. Und meine Heimautomatisierung schaltet das Tablet an. Und das Tablet zeigt mir die Kamera von der Tür und vom Hof. Und das natürlich schon, bevor ich überhaupt am Gerät dran bin. Weil das geht schnell. Das dauert, bis der Browser hier offen ist, dauert das eine halbe Sekunde. Das geht wirklich flutsch. In der Zeit bin ich garantiert nicht an der Gegensprechanlage. Und ich hab noch ein Magnetsensor, also ein Sensor, der Magnetfelder erkennt. Hier hinter das Telefon auf der anderen Seite gepappt. Weil das Telefon hat ein Magnet drinne. Und mit dem Magnetsensor erkenne ich auch noch, an welcher Station der Hörer abgenommen wurde. Also sprich, wenn ich hier den Hörer abnehme, dann kriegt es der ESP auch mit über den Magnetsensor. Und da kann ich beispielsweise auch dann das Tablet wieder ausschalten direkt sobald jemand auflegt und sowas. Das ist echt nice. Hat auch ein bisschen Gehirnschmalz gebraucht, muss ich sagen. Ist das Tablet am Dauerstrom? Ja. Also hier dahinter, ich mach euch mal ein paar Bilder das nächste Mal. Mach euch mal ein paar Bilder, kann ich euch zeigen. Hier dahinter ein Hallsensor, genau. Ein ganz kleiner Hallsensor. So ein 5 Cent Hallsensor. So ein ganz billigen Kleinen ist dahinter. Kost nix. Hier. Konrad, ich hab Konrad einen Hallsensor, den billigsten gekauft. Den billigsten, der für 3,3 Volt funktioniert hat. Hallsensor. Hallsensor. 3,3 oder 5 ist egal. 5 Volt. Hier so, boah, so teuer? Nee, meiner war deutlich billiger. Hab ich hier einen liegen, dass ich hier mal gucken kann? Nee. Hallsensor. Hier, so ein Ding. So ein Ding da. Ich glaube nicht, dass es genau der ist, aber so was in der Richtung ist er. 3,5 Volt, genau, so ein billigen hier. 36 Cent, äh, 86 Cent, Eats. Nee, bei AliExpress kannst du grad nicht bestellen, das dauert zu lang. So ein billig Ding hab ich dahinter. Also man muss ja sagen, die Bauteile für diese Geschichte, die haben vielleicht einen Euro gekostet oder so. Also nicht sonderlich teuer. Nichtsdestotrotz, wir machen im nächsten Stream weiter und dann machen wir dann, schließen wir das Ganze mit dem Update ab, weil ich weiß jetzt ungefähr wie es funktioniert, wir haben mal ein bisschen ProCraft gemacht. Äh, ich kann zwar morgen ausschlafen, dank Homeoffice muss allerdings trotzdem, ähm, 7.30 Uhr oder so Homeoffice anfangen und außerdem muss ich mal dringend kacken. Ähm, das heißt wir machen das nächste Mal weiter. Ich guck mal ob es irgendjemand gibt, den ich hosten kann. Du folgst? Wem folge ich denn, der das brauchen könnte? Mein Gott, manchmal ist die Twitch-Behandhabung aber auch eklig. Äh, du folgst, ja. Ja. Gibt es da irgendjemand den ich hosten könnte, den er klein ist, den ich follower und der es brauchen könnte? Den Cyrus, komm wir hosten den Krieger, wir hosten den Krieger zurück. Der Krieger hat uns das letzte Mal gehostet, hosten wir heute mal den Krieger. Letztes Mal kamen die ganzen Call of Duty Leute bei uns, da können hier die Broggers Leute jetzt mal zum Krieger rüber. Auch wenn sich das, ich glaube das Publikum wirklich mittlerweile kaum noch überschneidet. Bei ihm ist Call of Duty vielleicht ein bisschen tauchen und bei mir ist hier Hardcore-Programmier-Gedöns angesagt. Ähm, ja. Also, wir raiden den Krieger Leute, wir sehen uns, ich denke mal morgen, weil ich will den Kram wirklich jetzt mal langsam fertig machen, wird Zeit. Ähm, ja, wir raiden den Krieger. Der Kanal richtet sich an Erwachsene, also Leute. Seid brav, ja. Tut wenigstens Erwachsen. Okay, Leute, wir sehen uns. Bis denn. See you.", "segments": [{"id": 1, "start": 90.0, "end": 119.12, "text": "So, weiter gehts."}, {"id": 2, "start": 119.12, "end": 136.42, "text": "Ich hab jetzt ungefähr rausgekriegt, wie man das macht, was ich letztes Mal schon machen"}, {"id": 3, "start": 136.42, "end": 137.42, "text": "wollte."}, {"id": 4, "start": 137.42, "end": 140.04, "text": "Das heißt, ich kann jetzt noch ein bisschen abgucken, aber ich kann euch gleich schon"}, {"id": 5, "start": 140.04, "end": 145.72, "text": "sagen, die Library, die wir dafür verwenden müssen, ist absoluter Rotz."}, {"id": 6, "start": 145.72, "end": 149.64, "text": "Aber eine andere gibt's nicht."}, {"id": 7, "start": 149.64, "end": 152.68, "text": "Andere hab ich nicht gefunden bisher."}, {"id": 8, "start": 152.68, "end": 157.56, "text": "Und wenn jetzt mal ein paar Leute da sind, also sprich, wenn Twitch gecheckt hat, dass"}, {"id": 9, "start": 157.56, "end": 160.72, "text": "das Stream on ist, weil es sind immer noch null Zuschauer."}, {"id": 10, "start": 160.72, "end": 161.72, "text": "Ich bin schon..."}, {"id": 11, "start": 161.72, "end": 162.72, "text": "Wie lang bin ich schon?"}, {"id": 12, "start": 162.72, "end": 163.72, "text": "Sieht man da, wie lang ich on bin?"}, {"id": 13, "start": 163.72, "end": 164.72, "text": "Ähm..."}, {"id": 14, "start": 164.72, "end": 165.72, "text": "Okay, 2.50."}, {"id": 15, "start": 165.72, "end": 168.64, "text": "Aber normalerweise checkt das Twitch immer sofort."}, {"id": 16, "start": 168.64, "end": 171.72, "text": "Ich kann ja mal in Discord gucken."}, {"id": 17, "start": 171.72, "end": 176.48, "text": "Ich muss gucken, dass ich nicht auf einem falschen Channel bin."}, {"id": 18, "start": 176.48, "end": 177.48, "text": "Oh Gott."}, {"id": 19, "start": 177.48, "end": 178.48, "text": "Max!"}, {"id": 20, "start": 178.48, "end": 180.52, "text": "Hoffentlich bist du nicht auf einem Weebspam-Channel."}, {"id": 21, "start": 180.52, "end": 182.76, "text": "Dann ist hier gleich Monka Toss."}, {"id": 22, "start": 182.76, "end": 183.76, "text": "Wartet mal."}, {"id": 23, "start": 183.76, "end": 189.44, "text": "Ich hoffe, ich bin nicht auf einem falschen Channel, Alter."}, {"id": 24, "start": 189.44, "end": 192.36, "text": "Was ist das?"}, {"id": 25, "start": 192.36, "end": 193.36, "text": "Nein!"}, {"id": 26, "start": 193.36, "end": 194.36, "text": "Nein!"}, {"id": 27, "start": 194.36, "end": 195.36, "text": "Nein!"}, {"id": 28, "start": 195.36, "end": 196.36, "text": "Nein!"}, {"id": 29, "start": 196.36, "end": 203.52, "text": "Nein!"}, {"id": 30, "start": 203.52, "end": 204.52, "text": "Okay, gut."}, {"id": 31, "start": 204.52, "end": 206.52, "text": "Ich bin nicht auf einem falschen Channel, Alter."}, {"id": 32, "start": 206.52, "end": 209.76, "text": "Ich wollte gucken, ob der Stream angekündigt wurde."}, {"id": 33, "start": 209.76, "end": 210.76, "text": "Jetzt gerade, oder?"}, {"id": 34, "start": 210.76, "end": 211.76, "text": "Jetzt eben."}, {"id": 35, "start": 211.76, "end": 212.76, "text": "Deswegen, jetzt sind auch..."}, {"id": 36, "start": 212.76, "end": 213.76, "text": "Jetzt kommen auch ein paar Leute rein."}, {"id": 37, "start": 213.76, "end": 214.76, "text": "Keine Ahnung, was wieder los war mit Twitch."}, {"id": 38, "start": 214.76, "end": 215.76, "text": "Ja, wenn ein paar Leute da sind, zeige ich euch noch mal was Lustiges, was ich gerade"}, {"id": 39, "start": 215.76, "end": 216.76, "text": "gefunden habe auf Twitter."}, {"id": 40, "start": 216.76, "end": 226.72, "text": "Progress auf Wumplors Chat."}, {"id": 41, "start": 226.72, "end": 234.48, "text": "Jetzt bin ich verhöhnt schon von meinem eigenen Twitch-Chat, Alter."}, {"id": 42, "start": 234.48, "end": 236.48, "text": "Das ist hier was."}, {"id": 43, "start": 236.48, "end": 249.6, "text": "Der De-Abo ist raus."}, {"id": 44, "start": 249.6, "end": 250.6, "text": "Wer namen am Start?"}, {"id": 45, "start": 250.6, "end": 252.76, "text": "Detikarn hat subscribt für drei Monate."}, {"id": 46, "start": 252.76, "end": 253.76, "text": "Dankeschön."}, {"id": 47, "start": 253.76, "end": 254.76, "text": "Huge Sub."}, {"id": 48, "start": 254.76, "end": 261.76, "text": "Benutzt du KeyPass oder LastPass?"}, {"id": 49, "start": 261.76, "end": 262.76, "text": "KeyPass."}, {"id": 50, "start": 262.76, "end": 266.76, "text": "LastPass würde ich nie verwenden."}, {"id": 51, "start": 266.76, "end": 267.76, "text": "Richtig."}, {"id": 52, "start": 267.76, "end": 273.24, "text": "Der Eichler ist mir auch gerade eingefallen, dass De-Abo normalerweise in diesem Kontext"}, {"id": 53, "start": 273.24, "end": 274.24, "text": "nicht verwendet wird."}, {"id": 54, "start": 274.24, "end": 275.24, "text": "Dis-Abo."}, {"id": 55, "start": 275.24, "end": 276.24, "text": "Dis-Abo, Alter."}, {"id": 56, "start": 276.24, "end": 286.04, "text": "Warum nie LastPass, weil ich nichts verwende, wo meine Passwörter, also quasi die Zugänge"}, {"id": 57, "start": 286.04, "end": 291.4, "text": "zu den sensibelsten Sachen, die ich irgendwie habe, online gespeichert werden und ich keine"}, {"id": 58, "start": 291.4, "end": 296.4, "text": "Ahnung habe, was die Software treibt."}, {"id": 59, "start": 296.4, "end": 298.8, "text": "Moonbeard Desmond, sechs Monate am Start."}, {"id": 60, "start": 298.8, "end": 299.8, "text": "Easy clap, nice."}, {"id": 61, "start": 299.8, "end": 300.8, "text": "Easy."}, {"id": 62, "start": 300.8, "end": 321.78, "text": "Fatir, ihr hat es erkannt."}, {"id": 63, "start": 321.78, "end": 327.32, "text": "Du musst mal unterscheiden zwischen sensibel oder sensitiv."}, {"id": 64, "start": 327.32, "end": 333.6, "text": "Wieso hast du X-Server auf dem Desktop, habe ich."}, {"id": 65, "start": 333.6, "end": 334.6, "text": "Stimmt."}, {"id": 66, "start": 334.6, "end": 337.36, "text": "Warum habe ich einen X-Server auf dem Desktop?"}, {"id": 67, "start": 337.36, "end": 346.64, "text": "Was ist das für eine gute Frage, warum habe ich einen X-Server auf dem Desktop?"}, {"id": 68, "start": 346.64, "end": 359.24, "text": "Ich glaube, wir haben mal probiert, ob man nicht mit diesem neuen, mit diesem WSL-Windows-Zeug,"}, {"id": 69, "start": 359.24, "end": 361.92, "text": "wie es damit aussieht, grafische Programme laufen zu lassen."}, {"id": 70, "start": 361.92, "end": 366.44, "text": "Schon ewig her, das heißt, es war noch WSL-1, es wird jetzt schon wieder Zeit, das mit WSL-2"}, {"id": 71, "start": 366.44, "end": 367.44, "text": "auszuprobieren."}, {"id": 72, "start": 367.44, "end": 370.04, "text": "So, jetzt seid ihr ja da, ich muss euch mal was zeigen."}, {"id": 73, "start": 370.04, "end": 371.6, "text": "Muss ich mich gerade kaputtlachen."}, {"id": 74, "start": 371.6, "end": 378.2, "text": "Ich dachte erst, das ist ein G-Bait, aber ich glaube, es ist echt."}, {"id": 75, "start": 378.2, "end": 382.88, "text": "Also, Steam macht ja immer schon Werbung für irgendwelche Deals, in dem Fall für das hier."}, {"id": 76, "start": 382.88, "end": 385.12, "text": "Das Game juckt mich nicht, ich finde die Antwort witzig."}, {"id": 77, "start": 385.12, "end": 389.52, "text": "Ich habe mal ausgeplannet die Antwort, ja."}, {"id": 78, "start": 389.52, "end": 399.92, "text": "Stadia Better, und guckt euch mal was von, für einen Lauch, Alter, Stadia Better im Vergleich"}, {"id": 79, "start": 399.92, "end": 402.52, "text": "zu Steam, oder so ein 8-Jähriger."}, {"id": 80, "start": 402.52, "end": 409.72, "text": "Okay, ich sehe schon, der Chat findet es nicht lustig, aber ich fand das übelst lustig."}, {"id": 81, "start": 409.72, "end": 414.84, "text": "Okay, mittlerweile gibt es schon eine Antwort drauf, oder irgendwie, was?"}, {"id": 82, "start": 414.84, "end": 420.64, "text": "Kid, who plays games on Stadia, Red Dead Redemption 2 und Doom Eternal, der sieht nicht so aus,"}, {"id": 83, "start": 420.64, "end": 426.04, "text": "als dürfte weder Red Dead Redemption 2, noch Doom Eternal überhaupt spielen."}, {"id": 84, "start": 426.04, "end": 435.32, "text": "Die Weide ist nicht lustig, genau, es ist ja fucked, es ist ja allgemein bekannt, es steht"}, {"id": 85, "start": 435.32, "end": 441.44, "text": "überhaupt nicht mehr zur Diskussion, dass Google Stadia besser ist als Steam, das ist"}, {"id": 86, "start": 441.44, "end": 442.44, "text": "ja schon erwiesen."}, {"id": 87, "start": 442.44, "end": 451.52, "text": "Marketing Account, dachte ich auch erst, aber das ist so authentisch, der Account, oh, was"}, {"id": 88, "start": 451.52, "end": 453.6, "text": "hat denn, was macht denn Merkel wieder?"}, {"id": 89, "start": 453.6, "end": 465.64, "text": "Was ist da, zeige ich dir mal her, was zum Teufel ist das, yeah, hat die Physik studiert,"}, {"id": 90, "start": 465.64, "end": 475.36, "text": "hat die nicht Physik studiert, ich weiß nicht, wie das funktioniert, das ist das Kind vom"}, {"id": 91, "start": 475.36, "end": 480.68, "text": "Alphabet CEO, ich habe ehrlich gesagt gar keine Ahnung, wie der Alphabet CEO heißt,"}, {"id": 92, "start": 480.68, "end": 488.0, "text": "ist das nicht irgendein Inder, oder ist der neue Google CEO ein Inder, oder er sieht zumindest"}, {"id": 93, "start": 488.0, "end": 491.32, "text": "irgendwie indisch aus, oder heißt indisch, ich kann das immer nicht auseinanderhalten,"}, {"id": 94, "start": 491.32, "end": 502.68, "text": "ob Alphabet oder Google, der Google CEO, das Inder durchaus CEO können und nicht nur scammen,"}, {"id": 95, "start": 502.68, "end": 511.44, "text": "sieht man am Microsoft Chef, der geht ja ab, das hätte was der geschafft haben in Microsoft,"}, {"id": 96, "start": 511.44, "end": 524.32, "text": "man muss ja ab und zu mal zur Abwechslung seinen Hut ziehen, also das hätte ich vor"}, {"id": 97, "start": 524.32, "end": 533.6, "text": "10 Jahren oder so, wo der Microsoft, weiß nicht seit wann der Typ Microsoft, seit wann"}, {"id": 98, "start": 533.6, "end": 541.24, "text": "ist der Microsoft Chef, seit wann ist das hier, 2014, also seit 6 Jahren, also ganz"}, {"id": 99, "start": 541.24, "end": 549.12, "text": "ehrlich, also 2014 hätte ich im Leben nicht gedacht, dass aus Microsoft mal das unternehmen"}, {"id": 100, "start": 549.12, "end": 554.52, "text": "wird, was mit die meisten Open Source Contributions und größten Open Source Dinge hat, wobei"}, {"id": 101, "start": 554.52, "end": 559.48, "text": "das Marketing-Geschwätze ist, bei einem wichtigen Projekt weiß ich nicht, wie sie so drin sind,"}, {"id": 102, "start": 559.48, "end": 564.12, "text": "dass denen mal GitHub gehört, dass die einen Code-Editor raushauen, den die meisten Leute"}, {"id": 103, "start": 564.12, "end": 573.52, "text": "verwenden, das hätte ich nicht gedacht, was, nee, Larry Page ist doch der, warte mal,"}, {"id": 104, "start": 573.52, "end": 579.08, "text": "jetzt bringe ich es durcheinander, nee, Larry Page ist der Googlemensch, der mit dem Facebook"}, {"id": 105, "start": 579.08, "end": 586.4, "text": "man verwechselt, ah, und wo ist sehr, sehr, sehr, sehr gay, sehr, sehr gay, Brin oder"}, {"id": 106, "start": 586.4, "end": 595.8, "text": "wie er heißt, ist das nicht auch irgendein Googlemann, ja, der da, ist das nicht auch"}, {"id": 107, "start": 595.8, "end": 608.8, "text": "irgendein, Google, Googleman, ah, das ist der Co-Founder von Google, ah, verstehe, exzellent,"}, {"id": 108, "start": 608.8, "end": 625.4, "text": "der war das, stimmt, so, ok, was hat sie denn wieder angestellt, was hat sie denn angestellt,"}, {"id": 109, "start": 625.4, "end": 629.76, "text": "vor allem warum sind die ganzen Tweets über Merkel auf Englisch, wahrscheinlich juckt"}, {"id": 110, "start": 629.76, "end": 634.76, "text": "uns in Deutschland mal wieder überhaupt nicht, was eigentlich abgeht, uns interessiert nur"}, {"id": 111, "start": 634.76, "end": 658.88, "text": "das, oh, oh, WTF, was ist das, warum hat der Typ sich gelöscht, RIP Stadia Kid, das ging"}, {"id": 112, "start": 658.88, "end": 667.28, "text": "aber schnell, das ging aber schnell, also entweder, entweder war das wirklich eindeutig"}, {"id": 113, "start": 667.28, "end": 674.48, "text": "Exposed Fake Account, die Stadia Gang, oder der hat bei mir im Stream zugeguckt und hat"}, {"id": 114, "start": 674.48, "end": 687.36, "text": "gesagt, fuck, der Max hat mich geflammt, gleich Countdicht machen, aber war das ja nie, naja,"}, {"id": 115, "start": 687.36, "end": 692.56, "text": "aber ich hab's euch ja noch, guck mal, wir haben keine Frametrops, also heute mal hier,"}, {"id": 116, "start": 692.56, "end": 699.64, "text": "nix, mal gucken, ob das ganze so bleibt, kaum dürfen die Leute wieder auf die Arbeit fahren"}, {"id": 117, "start": 699.64, "end": 705.6, "text": "oder in Geschäfte gehen, schon ist hier wieder, hat Vodafone keine Probleme mehr, aber ich"}, {"id": 118, "start": 705.6, "end": 720.12, "text": "hab's auf Twitter gepostet schon, und ich sag's jetzt hier noch mal im Stream, warum,"}, {"id": 119, "start": 720.12, "end": 732.12, "text": "warum genau hat der jetzt mal ein Video copy pasted, der Typ ist zu heftig, er nutzt 2020"}, {"id": 120, "start": 732.12, "end": 745.68, "text": "unironisch LeadSpeak, richtig weggeraised, ja, also ich sag's jetzt auch noch mal hier,"}, {"id": 121, "start": 745.68, "end": 754.4, "text": "ich bin ja der Ansicht, meine persönliche Meinung ist, Gamer Grill mit Headsetter wirst"}, {"id": 122, "start": 754.4, "end": 763.6, "text": "so massiv gedisst, echt werde ich, hab ich gar nicht gelesen, ne, da werde ich nicht"}, {"id": 123, "start": 763.6, "end": 776.48, "text": "gedisst, die anderen oder was, naja, also wenn das schon massiver Dis ist, dann weiß ich"}, {"id": 124, "start": 776.48, "end": 783.84, "text": "auch nicht, in welchem denn, wo werde ich massiv gedisst, naja, also wenn das jetzt"}, {"id": 125, "start": 783.84, "end": 794.0, "text": "massiver Dis ist, dann darf er mich ruhig gern weiter massiv, wenn er Spaß dran hat,"}, {"id": 126, "start": 794.0, "end": 800.0, "text": "so, ja, was wollte ich jetzt mal, genau, ich wollte euch ja eigentlich was auf Twitter"}, {"id": 127, "start": 800.0, "end": 808.28, "text": "von mir zeigen, und zwar, meine persönliche Meinung ist ja, dass, wenn die jetzt anfangen,"}, {"id": 128, "start": 808.28, "end": 810.96, "text": "irgendwo hab ich jetzt hier geschrieben, genau, also wenn die jetzt wieder anfangen alles"}, {"id": 129, "start": 810.96, "end": 817.12, "text": "aufzumachen, und es scheint ja so zu sein, vor allem total uneinheitlich, ja, mal darfste,"}, {"id": 130, "start": 817.12, "end": 820.2, "text": "mal darfste nicht, mal Eisdiele auf, mal Eisdiele zu, mal Mundschutz, mal keinen Mundschutz,"}, {"id": 131, "start": 820.2, "end": 827.76, "text": "es blickt im Prinzip keine Sau durch, und ich bin, also meine persönliche Meinung ist,"}, {"id": 132, "start": 827.76, "end": 833.08, "text": "dass es nicht lange dauern wird, weil du kannst dich auf die Leute absolut nicht verlassen,"}, {"id": 133, "start": 833.08, "end": 836.88, "text": "meine persönliche Meinung ist, dass das nicht lange dauern wird, und wir machen wieder alles"}, {"id": 134, "start": 836.88, "end": 845.84, "text": "dicht, oder wir nehmen im Kauf, dass reihenweise Leute abkratzen, eins von beiden, eins von beiden,"}, {"id": 135, "start": 845.84, "end": 849.32, "text": "wir können auch den Ami-Style machen und uns überlegen, ob man Corona nicht erschießen"}, {"id": 136, "start": 849.32, "end": 854.28, "text": "kann oder so, aber ich glaube nicht, dass das hier passieren wird, das wird nicht lange"}, {"id": 137, "start": 854.28, "end": 860.64, "text": "dauern, ich bin, also im Vergleich zu den letzten Tagen, wenn ich so rumgelaufen bin,"}, {"id": 138, "start": 860.64, "end": 867.24, "text": "da hast du ja auch schon so die üblichen geistig verwirrten Leute am Start gehabt, die am Main"}, {"id": 139, "start": 867.24, "end": 873.76, "text": "mit fünf Leuten rumgehungen haben, ja, meistens irgendwelche Jugendliche oder so, aber ja,"}, {"id": 140, "start": 873.76, "end": 879.44, "text": "Weinwegen, aber heute war schon, heute war schon deutlich mehr, und der einzige Unterschied"}, {"id": 141, "start": 879.44, "end": 885.32, "text": "zu sonst ist, dass die Leute jetzt im Laden eine Maske anziehen müssen, und dass die"}, {"id": 142, "start": 885.32, "end": 889.68, "text": "Leute jetzt ein bisschen mehr Abstand halten müssen, das ist natürlich schon im Vergleich"}, {"id": 143, "start": 889.68, "end": 894.92, "text": "zu sonst ein riesen Unterschied, aber ich kann mir vorstellen, umso mehr das Normalität"}, {"id": 144, "start": 894.92, "end": 901.04, "text": "wird, umso mehr scheißen die Leute drauf, und man hätte es wahrscheinlich heute schon"}, {"id": 145, "start": 901.04, "end": 905.52, "text": "gesehen, wenn man in einem Supermarkt arbeitet, dass viele Leute wieder diskutieren und rumnerven"}, {"id": 146, "start": 905.52, "end": 911.08, "text": "und alles in der Richtung, das wird nicht, du kannst dich nicht, du kannst dich nicht"}, {"id": 147, "start": 911.08, "end": 916.52, "text": "auf die Leute verlassen, das klappt nicht, das weiß ich als IT-Mann ganz besonders, zum"}, {"id": 148, "start": 916.52, "end": 923.2, "text": "Glück habe ich mit End-User-Support nichts zu tun, aber da ist es auch so, erinnere ich"}, {"id": 149, "start": 923.2, "end": 928.68, "text": "mich mal wieder daran, wo mir mal einer eine Mail geschrieben hat, mit dem Titel, ich hoffe,"}, {"id": 150, "start": 928.68, "end": 934.28, "text": "das kriege ich jetzt irgendwie richtig zusammen, das System geht nicht, da habe ich ihr zurückgeschrieben,"}, {"id": 151, "start": 934.28, "end": 936.88, "text": "ja, ich glaube nicht, dass sie bei mir richtig ist, weiß gar nicht, wie sie meine E-Mail-Adresse"}, {"id": 152, "start": 936.88, "end": 941.96, "text": "bekommen hat, aber ich kann es weiterleiten, wenn sie mir sagt, um welches System es geht,"}, {"id": 153, "start": 941.96, "end": 946.84, "text": "und die Antwort war, das System, mit dem wir täglich arbeiten, nicht einfach nur das System,"}, {"id": 154, "start": 946.84, "end": 951.32, "text": "mit dem wir täglich arbeiten, die hat geschrieben, natürlich das System, mit dem wir täglich"}, {"id": 155, "start": 951.32, "end": 961.96, "text": "arbeiten, und da weißt du schon, was du für Leute, für geistig, naja, komische, nicht"}, {"id": 156, "start": 961.96, "end": 966.68, "text": "auch ganz auf der Höhe Leute hast, und die ist sicherlich nicht blöd gewesen, aber gerade"}, {"id": 157, "start": 966.68, "end": 971.72, "text": "Leute, die im IT-Support arbeiten, die werden wissen, du kannst dich auf Leute nicht verlassen"}, {"id": 158, "start": 971.72, "end": 977.2, "text": "und gerade, also wenn du dich schon nicht auf die Leute mit ein bisschen was im Hirn verlassen"}, {"id": 159, "start": 977.2, "end": 981.12, "text": "kannst, ja, dann kannst du dich garantiert auch nicht auf die Leute, ohne was im Hirn"}, {"id": 160, "start": 981.12, "end": 988.8, "text": "zu verlassen, das ist wirklich, oi, 3-Head, ganz extrem, das ist 2-Head, da reichen die"}, {"id": 161, "start": 988.8, "end": 994.28, "text": "3 gar nicht mehr, das war die indische Scam-Mail, ne, das war keine indische Scam-Mail, ich"}, {"id": 162, "start": 994.28, "end": 1000.72, "text": "habe übrigens noch hier MonkaDB-Fahren, weil ich mir gedacht habe, dass das ASCII-Quarium"}, {"id": 163, "start": 1000.72, "end": 1012.76, "text": "allein ist zu wenig, ja, bevor wir anfangen, wollte ich noch eine Sache mal loswerden,"}, {"id": 164, "start": 1012.76, "end": 1019.68, "text": "weil sich ja auch persönlich an dieser, was mich ein bisschen nervt, an dieser ganzen"}, {"id": 165, "start": 1019.68, "end": 1026.28, "text": "Corona-Geschichte, hat überhaupt nichts mit Corona zu tun, null, eine Sache, die mich"}, {"id": 166, "start": 1026.28, "end": 1031.0, "text": "schon seit langer Zeit nervt und wo ich mir für die Leute, die da drin arbeiten halt"}, {"id": 167, "start": 1031.0, "end": 1035.96, "text": "was besseres wünschen würde, und zwar alle, die jetzt im Krankenhaus arbeiten, oder irgendwie"}, {"id": 168, "start": 1035.96, "end": 1039.92, "text": "jeder Arztpraxis im Krankenhaus, irgendwo im Gesundheitswesen, ja, da wo die Leute jetzt"}, {"id": 169, "start": 1039.92, "end": 1046.84, "text": "alle rumschleimen, oh, unsere Helden und auch die Politik und die Nachrichten, alles irgendwie"}, {"id": 170, "start": 1046.84, "end": 1051.2, "text": "große Schleimattacke startet, das sind die wahren Helden, oder die Supermarktverkäuferin,"}, {"id": 171, "start": 1051.2, "end": 1060.8, "text": "das sind die wahren Helden, eigentlich verlassen sich alle viel zu sehr drauf, dass die Leute"}, {"id": 172, "start": 1060.8, "end": 1070.36, "text": "das aus Überzeugung machen und selbstverständlich das alles machen, weil ich könnte wetten,"}, {"id": 173, "start": 1070.36, "end": 1076.84, "text": "wenn die ganze Corona-Geschichte vorbei ist und wenn diese Leute mal später Probleme"}, {"id": 174, "start": 1076.84, "end": 1082.36, "text": "haben mit irgendwas, es wird sich niemand mehr dran erinnern, was sie 2020 gemacht"}, {"id": 175, "start": 1082.36, "end": 1089.36, "text": "haben, dass sie 2020 da dabei waren, das heißt, theoretisch das beste, was die jetzt machen"}, {"id": 176, "start": 1089.36, "end": 1094.16, "text": "könnten, ist meiner Ansicht nach, die müssten jetzt eigentlich sagen, Jungs, Kohle oder"}, {"id": 177, "start": 1094.16, "end": 1098.52, "text": "wir arbeiten nicht mehr, ich weiß, es klingt übelst asozial und das sind halt Leute, die"}, {"id": 178, "start": 1098.52, "end": 1104.04, "text": "machen sowas nicht, weil die meisten Leute, es ist ja auch wirklich sehr lobenswert alles,"}, {"id": 179, "start": 1104.04, "end": 1110.92, "text": "das sind halt Leute, denen ist es zum größten Teil überhaupt noch was wert, dass die anderen"}, {"id": 180, "start": 1110.92, "end": 1115.12, "text": "Leuten helfen können und die würden auch andere Leute nicht im Stich lassen, das Problem"}, {"id": 181, "start": 1115.12, "end": 1118.92, "text": "ist aber, dass sich quasi die Chefs von denen und wir alle uns quasi selbstverständlich"}, {"id": 182, "start": 1118.92, "end": 1123.76, "text": "darauf verlassen, dass sie das machen und wenn sich alle selbstverständlich darauf verlassen,"}, {"id": 183, "start": 1123.76, "end": 1126.24, "text": "sagt man dann, ja gut, dann müssen wir denen auch nicht mehr Geld geben, weil die machen"}, {"id": 184, "start": 1126.24, "end": 1130.98, "text": "es ja eh selbstverständlich, das heißt eigentlich müssten die sagen, auch wenn es übelst asozial"}, {"id": 185, "start": 1130.98, "end": 1139.08, "text": "wäre und das gerade die Leute in dieser Situation nicht machen würden, die da eh schon arbeiten,"}, {"id": 186, "start": 1139.08, "end": 1143.92, "text": "die müssten jetzt sagen, Leute, über 10 Jahre wollen wir jetzt das und das, die unterschreiben"}, {"id": 187, "start": 1143.92, "end": 1149.64, "text": "aktuell alles, die unterschreiben aktuell, unterschreiben die alles, natürlich ist das"}, {"id": 188, "start": 1149.64, "end": 1159.28, "text": "maximal egoistisch, aber die Leute haben deutlich mehr Geld verdient, die haben deutlich mehr"}, {"id": 189, "start": 1159.28, "end": 1167.8, "text": "Geld verdient für den Scheiß, was die machen und das Problem ist, man, das wird sofort"}, {"id": 190, "start": 1167.8, "end": 1174.72, "text": "wieder vergessen, sobald die ganze Corona-Geschichte vorbei ist."}, {"id": 191, "start": 1174.72, "end": 1181.12, "text": "Überlegt euch mal, wenn irgendjemand, der, keine Ahnung, der heute im, oder der Krankenschwester,"}, {"id": 192, "start": 1181.12, "end": 1186.64, "text": "die gerade im Krankenhaus arbeitet und wirklich Tag ein, Tag aus, die ist fertig, die gibt"}, {"id": 193, "start": 1186.64, "end": 1194.16, "text": "wirklich alles, kriegt nicht viel Geld und mal angenommen, die kann in, sag mal, die"}, {"id": 194, "start": 1194.16, "end": 1197.8, "text": "kann in 5 Jahren nicht mehr arbeiten, weil sie irgendwie Rückenprobleme hat, kann die"}, {"id": 195, "start": 1197.8, "end": 1202.08, "text": "nicht mal als Krankenschwester arbeiten, so, dann gehen die zum Arbeitsamt oder irgendwo"}, {"id": 196, "start": 1202.08, "end": 1207.44, "text": "anders hin, meint ihr, das erinnert sich irgendjemand noch daran, dass die 2020 als"}, {"id": 197, "start": 1207.44, "end": 1211.44, "text": "Krankenschwester mit dafür gesorgt hat, dass die ganze Corona-Geschichte nicht so ausartet,"}, {"id": 198, "start": 1211.44, "end": 1217.04, "text": "das ist den Leuten in 5 Jahren absolut egal, das juckt die, das juckt die, das überhaupt"}, {"id": 199, "start": 1217.04, "end": 1222.6, "text": "nicht, da sagen sie, ja, 2020, da hab ich ja gesehen, oh, sie war in der 2020 8 Wochen"}, {"id": 200, "start": 1222.6, "end": 1226.96, "text": "krank, da sagt, ja, ich hatte Corona und hatte sonst was, sonst wie, ja, aber 8 Wochen, ne,"}, {"id": 201, "start": 1226.96, "end": 1230.76, "text": "ne, da müssen wir ihnen aber 2 Wochen von ihren Gebühren, von ihrem Betrag abziehen,"}, {"id": 202, "start": 1230.76, "end": 1236.32, "text": "weil das geht ja nicht, es wird sich kein Mensch dran erinnern, was sie gemacht haben."}, {"id": 203, "start": 1236.32, "end": 1246.96, "text": "Und gerade deswegen, weil alle anderen Leute wahrscheinlich in Zukunft maßlos undankbar"}, {"id": 204, "start": 1246.96, "end": 1255.36, "text": "sind, was das angeht, sollten sie jetzt ein bisschen egoistischer sein, sagen, Jungs,"}, {"id": 205, "start": 1255.36, "end": 1258.4, "text": "jetzt mehr Kohle, weil jetzt sind wir in einer Situation, wo wir sowas fordern können."}, {"id": 206, "start": 1258.4, "end": 1263.36, "text": "Schonmal über eine Mitgliedschaft in der SPD nachgedacht, weder SPD noch CDU noch sonst"}, {"id": 207, "start": 1263.36, "end": 1269.6, "text": "was. Ich sag ja nur, die Leute sollten, die haben deutlich mehr Geld verdient und jetzt"}, {"id": 208, "start": 1269.6, "end": 1273.96, "text": "wäre die Variante, wie man das machen könnte. Ich sag nicht, dass es machen soll, das wäre"}, {"id": 209, "start": 1273.96, "end": 1278.56, "text": "natürlich auch maximal asozial, aber jetzt wäre die Situation, wo man noch Kohle rausholen"}, {"id": 210, "start": 1278.56, "end": 1297.0, "text": "könnte. Ja, und deswegen, das ist voll von Arsch und man muss auch mal sagen, dass ich"}, {"id": 211, "start": 1297.0, "end": 1305.48, "text": "das Verhältnis zwischen landlichen Berufen irgendwie ungerechtfertigt finde. Wenn ich"}, {"id": 212, "start": 1305.48, "end": 1312.0, "text": "mir überlege, dass irgendein Projektmanagement, Consultant, Dude, keine Ahnung, 180k im Jahr"}, {"id": 213, "start": 1312.0, "end": 1318.36, "text": "kriegt, ich sag das jetzt einfach mal so ungefähr über den Daumen von denen, wo ich das so grob"}, {"id": 214, "start": 1318.36, "end": 1330.28, "text": "bei manchen weiß, 180k im Jahr kriegt für extrem viel heiße Luft, so Stonks-Menschen,"}, {"id": 215, "start": 1330.28, "end": 1335.92, "text": "so extrem viel heiße Luft, die natürlich auch dem jeweiligen Laden, wo die sind, mit"}, {"id": 216, "start": 1335.92, "end": 1342.0, "text": "Sicherheit auch Kohle bringen, so ist das nicht, oder zumindest denkt man das. Und ich"}, {"id": 217, "start": 1342.0, "end": 1344.88, "text": "weiß nicht, was eine Krankenschwester aktuell verdient, aber ich finde, das steht in keinem"}, {"id": 218, "start": 1344.88, "end": 1353.24, "text": "Verhältnis. Das sind richtige Stonks-Typen, genau. Ich finde, das steht in keinem Verhältnis."}, {"id": 219, "start": 1353.24, "end": 1364.88, "text": "Ich sage nicht, dass man dem Stonks-Mensch unbedingt weniger geben sollte, die Verantwortung"}, {"id": 220, "start": 1364.88, "end": 1369.16, "text": "wird bezahlt. Ja, das stimmt, aber wenn es danach geht, dann müsste man jemand, der im"}, {"id": 221, "start": 1369.16, "end": 1373.92, "text": "Krankenhaus arbeitet, auch mehr bezahlen, weil die haben auch Verantwortung. Die haben"}, {"id": 222, "start": 1373.92, "end": 1378.36, "text": "zwar keine Verantwortung, wo es irgendwie um ein paar Millionen Euro geht, aber die"}, {"id": 223, "start": 1378.36, "end": 1383.64, "text": "haben Verantwortung, dass ihre Leute da nicht abkratzen, was natürlich die Allgemeinheit"}, {"id": 224, "start": 1383.64, "end": 1387.08, "text": "deutlich weniger juckt, als die Verantwortung, ob man ein paar Millionen hat oder nicht."}, {"id": 225, "start": 1387.08, "end": 1393.08, "text": "Also ich will nicht, dass man irgendwelche Leuten weniger Kohle gibt, das ist ja alles"}, {"id": 226, "start": 1393.08, "end": 1397.88, "text": "irgendwie okay, wenn irgendjemand bereit ist, ihn für diesen Betrag einzustellen, aber"}, {"id": 227, "start": 1397.88, "end": 1401.04, "text": "du müsstest manche Leute schlicht und ergreifend einfach mehr Kohle geben, das kann nicht sein."}, {"id": 228, "start": 1401.04, "end": 1415.8, "text": "Ja, Feuerwehrleute, Sanitäter, es gibt viele Berufe, wo ich sage, ey, das kann nicht sein."}, {"id": 229, "start": 1415.8, "end": 1429.16, "text": "Und letztendlich ist es ja so, solange nicht ein gewisser Druck da verspürt wird, dann"}, {"id": 230, "start": 1429.16, "end": 1434.04, "text": "tut sich da auch nichts. Guckt euch doch mal an, in was für einem scheiß Zustand teilweise"}, {"id": 231, "start": 1434.04, "end": 1440.52, "text": "Schulen bei uns sind. Was die sich da teilweise überlegt haben, ey. Da frage ich mich immer,"}, {"id": 232, "start": 1440.52, "end": 1464.64, "text": "ob die schon mal in den letzten paar Jahren in der Schule gewesen sind. Ja, aber ich kann"}, {"id": 233, "start": 1464.64, "end": 1478.36, "text": "ja verstehen, dass das nicht jeder so sieht. Und man muss auch sagen, dass so ziemlich"}, {"id": 234, "start": 1478.36, "end": 1485.04, "text": "alles, was gesetzlich versichert ist und du quasi mit deiner gesetzlichen Versicherung"}, {"id": 235, "start": 1485.04, "end": 1496.8, "text": "bekommst, sehr großen Ausbeutungscharakter hat. Also sprich, der Vergleich zwischen, man"}, {"id": 236, "start": 1496.8, "end": 1500.8, "text": "lässt sich mal privat behandeln und bezahlt das selbst oder eine private Versicherung"}, {"id": 237, "start": 1500.8, "end": 1507.8, "text": "und das, was du kriegst, wenn du gesetzlich versichert bist, das ist der Witz, ey. Das"}, {"id": 238, "start": 1507.8, "end": 1517.24, "text": "ist das Verhältnis, das ist der absolute Witz. Bei dem einen, krasse das Gefühl, wenn du"}, {"id": 239, "start": 1517.24, "end": 1523.16, "text": "zwei Fragen stellst, der will dich am liebsten direkt aus dem Fenster schmeißen. Und bei"}, {"id": 240, "start": 1523.16, "end": 1527.16, "text": "dem anderen, der fragt dir nicht, ob dir noch die Ledersätze ranrutschen sollte jetzt."}, {"id": 241, "start": 1527.16, "end": 1535.12, "text": "Erstmal übertrieben gesagt, das ist ein riesen Unterschied dazwischen. Und wenn sie immer"}, {"id": 242, "start": 1535.12, "end": 1539.2, "text": "erzählen so nach dem Motto, ja, wir müssen aufpassen, dass wir keine zwei Klassenmedizin"}, {"id": 243, "start": 1539.2, "end": 1543.76, "text": "kriegen, totaler Schwachsinn, den haben wir schon. Und der ist auch schon offensichtlich."}, {"id": 244, "start": 1543.76, "end": 1549.0, "text": "Ich machs mittlerweile so, dass wenn ich Kleinkram hab, das ist ja auch der Grund, warum so viel"}, {"id": 245, "start": 1549.0, "end": 1554.64, "text": "Zeug operiert wird, das bringt Kohle. Ich weiß nicht, ob ich euch erzählt hab, meine"}, {"id": 246, "start": 1554.64, "end": 1564.88, "text": "Mutter hatte Probleme in der Hüfte hier, irgendwie unten im Rücken und die war zuerst,"}, {"id": 247, "start": 1564.88, "end": 1572.16, "text": "zuerst war die beim Hausarzt. So, gesetzlich versichert, beim Hausarzt. Und der Hausarzt"}, {"id": 248, "start": 1572.16, "end": 1576.96, "text": "hat gesagt, naja, da ist nichts, schonen, und Tschüss. Nichts untersucht, nix. Ich"}, {"id": 249, "start": 1576.96, "end": 1581.52, "text": "hab gesagt, ihr tut es schon vier Wochen weh, nix. Untersucht. Und damals hab ich zuerst"}, {"id": 250, "start": 1581.52, "end": 1584.52, "text": "schon gesagt, ey komm, ich such mal ein ordentlicher Autopäde in Frankfurt raus, Canon ordentlich,"}, {"id": 251, "start": 1584.52, "end": 1588.24, "text": "der ist bei uns um die Ecke, da ist wirklich 300 Meter Luftlinie weg von da, wo ich arbeite."}, {"id": 252, "start": 1588.24, "end": 1596.4, "text": "Lass uns da mal hin, der rechnet auch im ganz guten Satz ab, das ist nicht so teuer. Ja,"}, {"id": 253, "start": 1596.4, "end": 1602.36, "text": "natürlich präsent ist das, was du dafür bezahlt kriegst, auch pauschal, diese Pauschalvergütungsgeschichten"}, {"id": 254, "start": 1602.36, "end": 1609.28, "text": "sind komplett für'n Arsch. Das sorgt einfach nur dafür, dass es nicht das Ziel ist, die"}, {"id": 255, "start": 1609.28, "end": 1613.88, "text": "Leute gut zu behandeln, oder das sag mal so, das Wohl der Leute im Vordergrund steht,"}, {"id": 256, "start": 1613.88, "end": 1619.68, "text": "sondern, dass das irgendwie Profit orientiert ist. Und ich bin da an sich, dass Krankenhäuser"}, {"id": 257, "start": 1619.68, "end": 1624.64, "text": "oder auch Arztpraxen, dass das nicht unbedingt, die müssen natürlich gut verdienen, da sag"}, {"id": 258, "start": 1624.64, "end": 1632.8, "text": "ich nix dagegen, aber es sollte nicht darauf ausgelegt sein, dass unterm Strich Plus rauskommt."}, {"id": 259, "start": 1632.8, "end": 1640.88, "text": "Das ist okay, wenn das Plus Minus Null rauskommt. Und es ist auch okay, wenn da Minus rauskommt."}, {"id": 260, "start": 1640.88, "end": 1645.28, "text": "Man hat ja dadurch auch was gewonnen. Es ist ja nicht so, dass das verlorenes Geld ist."}, {"id": 261, "start": 1645.28, "end": 1648.24, "text": "Frag mal die Leute, die da drin behandelt werden, die sagen bestimmt nicht, oh nee,"}, {"id": 262, "start": 1648.24, "end": 1653.88, "text": "oh fuck Minus gemacht, Alter mach dicht. Na zumindest, die war dann zuerst mal im Hausarzt"}, {"id": 263, "start": 1653.88, "end": 1658.36, "text": "und der hat halt gesagt, oh nee, hier, juckt mich nicht, mach dich wieder ab. Da ist er"}, {"id": 264, "start": 1658.36, "end": 1661.2, "text": "irgendwie ein paar Tage später wieder hingegangen, ist alles nicht besser geworden, da hat er"}, {"id": 265, "start": 1661.2, "end": 1668.12, "text": "gesagt, ah, machen wir mal ein bisschen Wärmebehandlung. So, nix, so. Da ist er wieder hingegangen und"}, {"id": 266, "start": 1668.12, "end": 1672.04, "text": "dann ist da das Problem, wenn du so oft da hintereinander hingehst, dann hat der Arzt"}, {"id": 267, "start": 1672.04, "end": 1676.52, "text": "so die Wahl, der muss sich entweder mit dir beschäftigen, das Problem ist, du warst schon"}, {"id": 268, "start": 1676.52, "end": 1681.24, "text": "zweimal da, so richtig abrechnen kann er es nicht mehr. Das heißt, du hast eigentlich"}, {"id": 269, "start": 1681.24, "end": 1685.2, "text": "gar keinen Bock. Ich will den Ärzten gar nicht mal unterstellen, dass die nicht wollen."}, {"id": 270, "start": 1685.2, "end": 1690.6, "text": "Ich könnte mir vorstellen, vielen finden das System auch richtig für'n Arsch. So,"}, {"id": 271, "start": 1690.6, "end": 1698.28, "text": "dann hat er ihr irgendwie, irgendeine komische Spritze zum Abschwellen und Schmerzmittel"}, {"id": 272, "start": 1698.28, "end": 1702.8, "text": "geschützt gegeben und da ging es ihr kreislaufmäßig schon überhaupt nicht gut. Das ist ja auch"}, {"id": 273, "start": 1702.8, "end": 1705.84, "text": "das, was ich euch dann auf Twitter geschrieben hab, wo wir ins Krankenhaus gefahren sind."}, {"id": 274, "start": 1705.84, "end": 1709.88, "text": "So, und dann hatte ich die Spritze nach drei Tagen nochmal geben lassen und dann war es"}, {"id": 275, "start": 1709.88, "end": 1714.52, "text": "so heftig, dass wir ins Krankenhaus fahren mussten, nachts. Weil sie irgendwie einen"}, {"id": 276, "start": 1714.52, "end": 1722.28, "text": "Puls von, frag mich nicht, 200 oder so, was mit 69 nicht normal ist. Wir sind ins Krankenhaus"}, {"id": 277, "start": 1722.28, "end": 1727.12, "text": "gefahren und eins muss man dir sagen, als Notaufnahme, das war echt okay, du konntest"}, {"id": 278, "start": 1727.12, "end": 1733.36, "text": "dich nicht beschweren und auf der Station war dann voll für'n Arsch. Komplett für'n"}, {"id": 279, "start": 1733.36, "end": 1740.12, "text": "Arsch. Also da hat man gesehen, es geht im Prinzip nicht darum, die Leute gut zu behandeln,"}, {"id": 280, "start": 1740.12, "end": 1744.68, "text": "sondern, dass das möglichst kosteneffizient ist und die Leute möglichst schnell wieder"}, {"id": 281, "start": 1744.68, "end": 1750.96, "text": "draußen sind. So, und was haben wir dann gemacht? Dann sind wir nach Frankfurt gefahren zu dem"}, {"id": 282, "start": 1750.96, "end": 1757.72, "text": "Orthopäde, den ich rausgesucht hab und das haben wir selbst bezahlt und das war von Anfang"}, {"id": 283, "start": 1757.72, "end": 1762.32, "text": "an, ich hab mich ja auch schon bei ein paar Sachen selbst bezahlt bei der Behandlung,"}, {"id": 284, "start": 1762.32, "end": 1767.84, "text": "deswegen hatte ich ja schon ein bisschen Erfahrung vorher auf was man gucken muss und halt auch"}, {"id": 285, "start": 1767.84, "end": 1772.28, "text": "selbst die Erfahrung gemacht, dass es ein riesen Unterschied ist und dann sind wir hingefahren"}, {"id": 286, "start": 1772.28, "end": 1779.96, "text": "nach Frankfurt, ohne Scheiß. Allein schon die Terminvergabe war ja, ach jo, eine Sache hab"}, {"id": 287, "start": 1779.96, "end": 1783.4, "text": "ich ja vorher gar nicht erzählt, davor war sie ja noch im Krankenhaus beim Orthopäde"}, {"id": 288, "start": 1783.4, "end": 1788.44, "text": "und der hat gemeint, er will seine Hüfte operieren. Die hat nichts an der Hüfte, die hat hinten"}, {"id": 289, "start": 1788.44, "end": 1792.12, "text": "irgendwas ausgerenkt am Rücken, die hat überhaupt nichts an der Hüfte. Aber schnell mal operieren,"}, {"id": 290, "start": 1792.12, "end": 1804.68, "text": "es gibt Kohle. Ja, ich räume hier mal nebenbei auf. So, und wie gesagt, dann sind wir zu"}, {"id": 291, "start": 1804.68, "end": 1811.32, "text": "dem Orthopäde nach Frankfurt gefahren und siehe da, die Terminvergabe war schon mal"}, {"id": 292, "start": 1811.32, "end": 1822.36, "text": "komplett unterschiedlich wie Tag und Nacht, also sprich, ich mach mal hier eine neue Datei,"}, {"id": 293, "start": 1822.36, "end": 1827.6, "text": "was macht man da, header, CPP-File, ach was weiß ich, erstmal alles hinkopieren. Allein"}, {"id": 294, "start": 1827.6, "end": 1832.44, "text": "schon die Terminvergabe war ein Unterschied wie Tag und Nacht, da hast du angerufen,"}, {"id": 295, "start": 1832.44, "end": 1836.8, "text": "hast gesagt, hier, wir haben Schmerzen im Rücken, wie sieht's aus? Zwei Tage später,"}, {"id": 296, "start": 1836.8, "end": 1843.4, "text": "da fuck, bei den anderen wartest du ein halbes Jahr drauf. Darfobi, fünf Monate, dankeschön."}, {"id": 297, "start": 1843.4, "end": 1857.92, "text": "So, und dann sind wir dahin, dann sind wir dahin, so und was hat er am Ende gemacht?"}, {"id": 298, "start": 1857.92, "end": 1864.48, "text": "Einmal eingerenkt und nochmal an die richtige Stelle eine Schmerzspritze gegeben, aber eine,"}, {"id": 299, "start": 1864.48, "end": 1870.44, "text": "die ein bisschen mehr kostet, deutlich besser verträglich ist und ohne Scheiß, Leute, die"}, {"id": 300, "start": 1870.44, "end": 1877.12, "text": "hat sich da, glaub ich, zwei oder drei Monate mit rumgequält. Nach einer Woche war es fast"}, {"id": 301, "start": 1877.12, "end": 1883.68, "text": "wieder weg, da sind wir nach einer Woche nochmal hin und haben das nochmal kontrollieren lassen,"}, {"id": 302, "start": 1883.68, "end": 1887.08, "text": "der hat das nochmal abgetast, nochmal geultraschaltet und guckt nochmal, ja, muss ich auf jeden"}, {"id": 303, "start": 1887.08, "end": 1890.4, "text": "Fall nochmal ein paar Wochen schonen, aber die Entzündung ist auf dem Ultraschall schon"}, {"id": 304, "start": 1890.4, "end": 1901.52, "text": "fast wieder weg und wenn was ist, sollen wir nochmal vorbeikommen. Easy, ja, dafür"}, {"id": 305, "start": 1901.52, "end": 1905.84, "text": "waren wir da halt auch eine halbe Stunde drin beim ersten Mal, sprich, die wurde wirklich"}, {"id": 306, "start": 1905.84, "end": 1911.48, "text": "eine halbe Stunde lang behandelt, das hast du normalerweise, wenn du das gesetzlich bezahlst"}, {"id": 307, "start": 1911.48, "end": 1916.8, "text": "nicht, da wirst du never eine halbe Stunde behandelt, da wirst du vielleicht, wenn du"}, {"id": 308, "start": 1916.8, "end": 1921.36, "text": "Glück hast, eine halbe Stunde im Wartezimmer sitzen gelassen, wenn eher eine Stunde und"}, {"id": 309, "start": 1921.36, "end": 1928.0, "text": "danach wirst du zwei Minuten behandelt. Was hat der eigentlich vor Schmerzen? Warum will"}, {"id": 310, "start": 1928.0, "end": 1934.2, "text": "das hier nicht? Ach, kacke Sprache, äh. So, und ich installiere mal schon die Library"}, {"id": 311, "start": 1934.2, "end": 1942.6, "text": "nebenbei. So, und die Sache ist jetzt halt die, die Behandlung hat jetzt was uns selber"}, {"id": 312, "start": 1942.6, "end": 1950.28, "text": "gekostet, aber die hat halt auch einfach was gebracht. So, und was hab ich davon, wenn"}, {"id": 313, "start": 1950.28, "end": 1956.76, "text": "ich gesetzlich versichert bin, Riesen aufrissen machen muss und zu zwanzig Ärzten und sich"}, {"id": 314, "start": 1956.76, "end": 1968.72, "text": "nix tut, ist jetzt doch einfach nur Stress für alle. So, ähm, hast du beim Termin machen"}, {"id": 315, "start": 1968.72, "end": 1978.32, "text": "gesagt, dass du privat bezahlst? Ja, weil, also und, weil auf dem seine Homepage steht,"}, {"id": 316, "start": 1978.32, "end": 1983.76, "text": "dass er halt nur privat macht. Der hat gar keine, kann sogar nicht gesetzlich versichert."}, {"id": 317, "start": 1983.76, "end": 1997.84, "text": "Und das ist halt wieder mal ein richtig krasser Unterschied gewesen, wo man gesehen hat, dass"}, {"id": 318, "start": 1997.84, "end": 2014.32, "text": "unser Gesundheitssystem für'n Arsch ist. Ob der Login auch funktioniert? Ach, ich hab"}, {"id": 319, "start": 2014.32, "end": 2020.0, "text": "im Helperfall die Includes vergessen. Wat? Achso, hab ich nicht connected. Ja, und das"}, {"id": 320, "start": 2020.0, "end": 2031.76, "text": "ist ein Ding. Wat? Ja. Ok. Bescheuerte Fehlermeldung, ich weiß noch nicht, ob ich das connecten"}, {"id": 321, "start": 2031.76, "end": 2042.96, "text": "will. So, ähm, also es ist anscheinend grad wirklich so, das einzige, was es dir bringt,"}, {"id": 322, "start": 2042.96, "end": 2046.0, "text": "gesetzlich versichert zu sein ist, du kannst zum Arzt in eine Krankmeldung holen, weil"}, {"id": 323, "start": 2046.0, "end": 2049.92, "text": "du eine Erkältung hast und du verreckst nicht, weil du nur als rufen kannst und behandelt"}, {"id": 324, "start": 2049.92, "end": 2054.72, "text": "wirst, dass du zwar jetzt nicht akut instant stirbst. Dafür ist es gut, dafür ist es auch"}, {"id": 325, "start": 2054.72, "end": 2059.84, "text": "nicht verkehrt, dass wir sowas haben. Ähm, wenn du wirklich gut behandelt werden wirst,"}, {"id": 326, "start": 2059.84, "end": 2066.64, "text": "du musst es selbst bezahlen. Du hast, du hast keine Möglichkeit mehr. Oder du findest wirklich,"}, {"id": 327, "start": 2066.64, "end": 2072.68, "text": "also oder man hat echt Glück und findet irgendwas Gutes in der Nähe. Aber die Chancen werden"}, {"id": 328, "start": 2072.68, "end": 2082.84, "text": "immer, werden immer geringer. Oh, achso, vielleicht soll ich mal Delay rein machen. Ja, und ich"}, {"id": 329, "start": 2082.84, "end": 2087.48, "text": "war ja auch schon bei ein paar Sachen, die ich selbst bezahlt hab. Jetzt, ich, ich, ich"}, {"id": 330, "start": 2087.48, "end": 2090.8, "text": "weiß halt nicht, ob es sich bei mir lohnt, wenn ich mich privat versichern lassen würde."}, {"id": 331, "start": 2090.8, "end": 2101.2, "text": "Ähm, ich mein, ich bin jetzt 35, das heißt, das ist eigentlich das Jahr, wo man sagt,"}, {"id": 332, "start": 2101.2, "end": 2107.56, "text": "man sollte sich spätestens entscheiden, ob man gesetzlich bleibt oder sich privat versichern"}, {"id": 333, "start": 2107.56, "end": 2117.04, "text": "lässt. Aber bisher mach ich so, die teuren Sachen, die mach ich halt über die gesetzliche"}, {"id": 334, "start": 2117.04, "end": 2121.68, "text": "Kasse, sprich, wenn man irgendwie mal sich röntgen lassen muss oder muss man MRT machen"}, {"id": 335, "start": 2121.68, "end": 2128.52, "text": "lassen, das ist halt übelst teuer. Ähm, so Kleinkram oder halt auch, sagen wir so Kleinkram"}, {"id": 336, "start": 2128.52, "end": 2136.2, "text": "bis Mittelkram, mach ich mittlerweile rein privat bezahlt selbst. Einfach weil es sackt,"}, {"id": 337, "start": 2136.2, "end": 2144.2, "text": "wenn man, wie man gesetzlich versichert behandelt wird. Und es ist, es ist ein Unterschied"}, {"id": 338, "start": 2144.2, "end": 2151.4, "text": "wie Tag und Nacht. Ich war beispielsweise beim, beim, äh, Halsnasen, Ohren, Stellarzt"}, {"id": 339, "start": 2151.4, "end": 2160.56, "text": "in, hallo, ich will, ich will, ich will den Zug ausmachen. Der, der Zug geht nicht aus,"}, {"id": 340, "start": 2160.56, "end": 2170.52, "text": "Leute. Der Zug, ich kann den Zug nicht beenden. Steuerung C. Ist ja fast wie bei der Bahn."}, {"id": 341, "start": 2170.52, "end": 2177.16, "text": "Nur umgedreht, da kommt der Zug und geht nicht weg. Na gut, zack, killen wir's halt, auch"}, {"id": 342, "start": 2177.16, "end": 2189.4, "text": "gut. So, also. Wie kriegt man den Zug? SL. Bin SL. Die Lösung ist einfach reich sein,"}, {"id": 343, "start": 2189.4, "end": 2193.84, "text": "ja, das stimmt. Ich muss ja sagen, ähm, es wird ja immer gesagt so nach dem Motto Geld,"}, {"id": 344, "start": 2193.84, "end": 2202.96, "text": "äh, Geld macht nicht glücklich. Also, ich finde so pauschal kann man das nicht sagen."}, {"id": 345, "start": 2202.96, "end": 2211.24, "text": "Weil wenn man gesunder ist, hat man durchaus größere Chancen glücklich zu sein. Du hast"}, {"id": 346, "start": 2211.24, "end": 2216.56, "text": "mit Kohle auf jeden Fall weniger Probleme. Ich mein, es müssen, es müssen jetzt nicht"}, {"id": 347, "start": 2216.56, "end": 2221.56, "text": "Millionen sein. Aber wenn man sich überlegt, ab wann man schon, ich hab letztens den Artikel"}, {"id": 348, "start": 2221.56, "end": 2229.0, "text": "gelesen, ab wann man schon, ähm, als reich gilt oder sag mal, oder was, nicht, ich weiß"}, {"id": 349, "start": 2229.0, "end": 2234.24, "text": "nicht, ob's reich ist oder ab wann man in Deutschland schon ab, ähm, als wohlhabend"}, {"id": 350, "start": 2234.24, "end": 2239.32, "text": "oder so gilt. Das ist der Witz. Ich, ich hab jetzt die Zahlen nicht mehr im Kopf. Was"}, {"id": 351, "start": 2239.32, "end": 2248.6, "text": "ist denn das irgendwie? Irgendwie kein 45k im Jahr oder so. Irgendwie ganz merkwürdig,"}, {"id": 352, "start": 2248.6, "end": 2253.4, "text": "ey. Und das liegt da dran, weil, das glaubt man gar nicht so niedrig, ist das. Müssen"}, {"id": 353, "start": 2253.4, "end": 2257.2, "text": "wir mal gleich raussuchen. Man glaubt gar nicht, wie niedrig das ist. Und das liegt"}, {"id": 354, "start": 2257.2, "end": 2264.96, "text": "einfach da dran. Weil sau viele Leute so wirklich gerade an der Grenze leben, wo sie irgendwie"}, {"id": 355, "start": 2264.96, "end": 2274.56, "text": "über die Runden kommen. Es kann man nicht wirklich reich nennen, aber quasi ab wann"}, {"id": 356, "start": 2274.56, "end": 2278.56, "text": "man, ab wann man zu den, zu den oberen so und so viel gehört. Wir reden jetzt nicht"}, {"id": 357, "start": 2278.56, "end": 2284.04, "text": "von eins und zehn Prozent, aber zu, zu, zu, zu der Gruppe, die, die mehr hat als, als"}, {"id": 358, "start": 2284.04, "end": 2295.96, "text": "der Rest. Das ist total wenig. Ich weiß nicht, ob es 45k im Jahr ist. Wir müssen, das ist"}, {"id": 359, "start": 2295.96, "end": 2301.68, "text": "total wenig. So viel glaubt man gar nicht. Ja. Genau, der Durchschnitt, der Durchschnitt"}, {"id": 360, "start": 2301.68, "end": 2308.72, "text": "liegt bei wie viel im Jahr? Im Monat, im Monat ist ein übelster Scheißwert, weil ich krieg"}, {"id": 361, "start": 2308.72, "end": 2312.48, "text": "14 Monatsgelder. Ich kann das nicht im Monat rechnen. Ähm, ich muss das, ich muss das"}, {"id": 362, "start": 2312.48, "end": 2319.84, "text": "im Jahr rechnen. Ja, der Durchschnitt, der Durchschnitt liegt bei, das ist halt, das"}, {"id": 363, "start": 2319.84, "end": 2326.48, "text": "ist fast nix. Ähm, hier in Hessen, in Hessen gibt es das vielleicht auch mal irgendwie"}, {"id": 364, "start": 2326.48, "end": 2350.92, "text": "im Jahr. Ich weiß nicht. Ähm, ne ne ne, das war das nicht. Ich hab irgendeine komische"}, {"id": 365, "start": 2350.92, "end": 2359.28, "text": "Grafik letztens gesehen. Da haben sie so gezeigt, wie viel, ab wann du quasi über der Grenze"}, {"id": 366, "start": 2359.28, "end": 2365.56, "text": "bist, wo irgendwie dann 50% unter dir sind. Und das ist, das ist viel weniger als man"}, {"id": 367, "start": 2365.56, "end": 2376.28, "text": "denkt. Gut, das ist die Armutsgrenze, das ist wieder was ganz anderes. Ähm, ja, oh,"}, {"id": 368, "start": 2376.28, "end": 2387.68, "text": "fuck. Wenn du dir überlegst, dass du quasi ab 3400 Euro, ok, das ist jetzt im Monat,"}, {"id": 369, "start": 2387.68, "end": 2392.8, "text": "das ist jetzt, sag mal im Monat, dass du ab 3400 Euro, als quasi in Anführung, als"}, {"id": 370, "start": 2392.8, "end": 2398.64, "text": "Reich, da steht netto, ich weiß, dass da netto, der Brutto, das hält das ja auch fast jeder."}, {"id": 371, "start": 2398.64, "end": 2409.96, "text": "Ja, dass du da als Reich giltst. Ähm, Reich, Reich ist was, wo man, wo man denkt, ey, geh"}, {"id": 372, "start": 2409.96, "end": 2419.24, "text": "mal hier Millionen oder so. Einkommen Single-Aushalt. Ich hab letztens eine schönere Statistik."}, {"id": 373, "start": 2419.24, "end": 2430.84, "text": "Ja, genau, nicht Reich, Oberschicht. Ähm, es ist, es ist auf jeden Fall, ähm, wer als"}, {"id": 374, "start": 2430.84, "end": 2437.6, "text": "Single mehr als 3400, 3400 Euro netto im Monat zur Verfügung hat, gehört zur Oberschicht."}, {"id": 375, "start": 2437.6, "end": 2446.8, "text": "Es ist, also das ist jetzt nicht wenig oder so, aber das ist nicht das, was ich mir, was"}, {"id": 376, "start": 2446.8, "end": 2458.64, "text": "ich so quasi unter Reich, äh, im Kopf habe, ja. Ja, sowas hier. Das, das Tool, das Tool"}, {"id": 377, "start": 2458.64, "end": 2462.04, "text": "ist schön. Hier, hier sieht man es. Und man sieht hier auch, guckt mal, guckt euch das"}, {"id": 378, "start": 2462.04, "end": 2483.16, "text": "mal an, dass, äh, was, ich will nicht Paare ohne, ich will Alleinlebende. Hier, 50%. So,"}, {"id": 379, "start": 2483.16, "end": 2493.8, "text": "wenn du über, also der Durchschnitt ist wohl, ist wohl, ist wohl über 1859. So. Aber wenn"}, {"id": 380, "start": 2493.8, "end": 2502.96, "text": "die hoch geht, das ist, guckt mal. Du hast, du hast dann, du hast dann quasi mehr als"}, {"id": 381, "start": 2502.96, "end": 2516.28, "text": "80% der Leute in Deutschland. NWTF, das ist viel niedriger, als man denkt. Ja, zumindest,"}, {"id": 382, "start": 2516.28, "end": 2519.16, "text": "wie gesagt, ich hab den letzten Artikel drüber, ich hab gedacht, das ist viel, ich hätte"}, {"id": 383, "start": 2519.16, "end": 2528.96, "text": "mir das viel höher vorgestellt, alles. So, und, ähm, ich weiß jetzt gar nicht, wie"}, {"id": 384, "start": 2528.96, "end": 2535.28, "text": "man draufgekommen, gekommen sind, ehrlich gesagt. Ist auch egal. Ähm, ich hab mich,"}, {"id": 385, "start": 2535.28, "end": 2541.24, "text": "ich hab mich mal wieder über irgendwas, über irgendwas ausgelassen. Äh, also was ich verdiene,"}, {"id": 386, "start": 2541.24, "end": 2546.28, "text": "kann ich euch nicht genau sagen. Nur so der, nur so der, der, vom Anhaltspunkt her, ich"}, {"id": 387, "start": 2546.28, "end": 2553.24, "text": "arbeite ja nur vier Tage die Woche. Ich bin im, fuck, in welchem Tarifvertrag bin ich,"}, {"id": 388, "start": 2553.24, "end": 2556.68, "text": "ich hab's irgendwann mal im Stream gezeigt. Ich weiß noch nicht mal, bei welcher Gruppe"}, {"id": 389, "start": 2556.68, "end": 2565.24, "text": "ich bin. Ich hab, ich vergesse das, ich vergesse das immer. Was man auch, was man auch schon"}, {"id": 390, "start": 2565.24, "end": 2570.2, "text": "als Indiz dafür sehen könnte, dass es mir eigentlich zu gut geht. Wenn, wenn du, wenn"}, {"id": 391, "start": 2570.2, "end": 2578.72, "text": "du hier irgendwo rumkrebst, wenn du hier irgendwo rumkrebst, dann weißt du sehr genau, in welchem"}, {"id": 392, "start": 2578.72, "end": 2585.52, "text": "Tarifvertrag, in welcher Gruppe und was jeder Euro herkommt und was jeder Euro macht. Garantiert,"}, {"id": 393, "start": 2585.52, "end": 2589.44, "text": "das musst du wissen, weil sonst bist du im Arsch. So. Allein schon dafür, dass ich das"}, {"id": 394, "start": 2589.44, "end": 2592.12, "text": "nicht weiß, ist das wahrscheinlich schon ein Indiz, für das es mir eigentlich viel zu"}, {"id": 395, "start": 2592.12, "end": 2609.48, "text": "gut geht. Ähm, also ich bin im, im Tarifvertrag für, Tarifvertrag für Versicherung? Versicherung,"}, {"id": 396, "start": 2609.48, "end": 2620.4, "text": "glaube ich. AGV, AGV, Tarifvertrag, das klingt, glaube ich, gut. Ja, ja, ja, da bin ich, da."}, {"id": 397, "start": 2620.4, "end": 2636.24, "text": "Da, so was, blubblubblub. Äh, Gehalts-Tarifvertrag. Ich bin da, glaube ich bin da. Da oder da,"}, {"id": 398, "start": 2636.24, "end": 2642.24, "text": "ich glaube da, da bin ich drin in der Gruppe. Also sprich, das ist das, da könnt ihr euch"}, {"id": 399, "start": 2642.24, "end": 2645.08, "text": "ungefähr vorstellen, ich, ich weiß gar nicht, ob ich euch überhaupt sagen darf, wie viel"}, {"id": 400, "start": 2645.08, "end": 2649.4, "text": "es genau sind, aber da könnt ihr euch ungefähr vorstellen, das ist das unterste, unter den"}, {"id": 401, "start": 2649.4, "end": 2657.08, "text": "es nicht gehen kann. Also sprich, das ist das mindeste, was im Tarifvertrag vereinbar,"}, {"id": 402, "start": 2657.08, "end": 2673.16, "text": "fuck, vereinbart ist. So und, wenn man sich überlegt, dass ich nur vier Tage arbeiten"}, {"id": 403, "start": 2673.16, "end": 2681.72, "text": "gehen muss, ich gebe ja auch kaum was aus. Also ich bin nicht absichtlich sparsam, ähm,"}, {"id": 404, "start": 2681.72, "end": 2685.32, "text": "aber es gibt wenig wofür ich was ausgebe. Du hast ja Leute, die haben wenig Kohle und"}, {"id": 405, "start": 2685.32, "end": 2694.48, "text": "schmeißen das Geld zum Fenster raus. Ähm, oder ich gebe kaum was aus. Keine Ahnung."}, {"id": 406, "start": 2694.48, "end": 2702.64, "text": "Ähm, kannst du die Seite mit dem Diagramm mal verlinken, das hier? Ja, also ich komm"}, {"id": 407, "start": 2702.64, "end": 2706.52, "text": "wahrscheinlich auch ohne Probleme mit dreimal die Woche oder so aus. Dazu kommt ja bei mir"}, {"id": 408, "start": 2706.52, "end": 2709.84, "text": "mittlerweile aber auch noch ein bisschen anderes Zeug. Ich mein, ich mach grad wenig YouTube,"}, {"id": 409, "start": 2709.84, "end": 2714.56, "text": "ja, meine Twitch-Aktivität hält sich auch, hält sich auch in Grenzen. Das heißt, ich"}, {"id": 410, "start": 2714.56, "end": 2719.0, "text": "verdiene nicht wahnsinnig viel, aber dadurch, dass ich jahrelang Amazon Reflinks gespammt"}, {"id": 411, "start": 2719.0, "end": 2723.84, "text": "habe, ein bisschen Twitch Prime, ein bisschen YouTube und Zeug, ein bisschen was krieg ich"}, {"id": 412, "start": 2723.84, "end": 2728.88, "text": "auch so im Monat. Nicht viel, nicht viel. Das ist wirklich nicht der Wahnsinn. Ähm,"}, {"id": 413, "start": 2728.88, "end": 2733.0, "text": "das kommt auch nochmal dazu. Klar, wenn ich jetzt voll die Woche arbeiten gehen würde,"}, {"id": 414, "start": 2733.0, "end": 2735.96, "text": "bekomme ich, würde ich wahrscheinlich noch mehr bekommen, aber es ist viel entspannter,"}, {"id": 415, "start": 2735.96, "end": 2750.28, "text": "so wie es jetzt ist. So, ähm, so viele Taten. Zumindest schauen wir mal, was das Mindeste"}, {"id": 416, "start": 2750.28, "end": 2758.52, "text": "ist. Ja, da kommt noch ein bisschen, ein bisschen, äh, vertragsspezifische Sachen dazu. Eventuell"}, {"id": 417, "start": 2758.52, "end": 2766.2, "text": "auch noch ein bisschen Bonus am Ende des Jahres. Äh, was hast du für nen Stuhl? Ein Mr. Sedus"}, {"id": 418, "start": 2766.2, "end": 2777.4, "text": "24. Ne, ein Mr. Sedus Mr. 24, so rum. Was sagst du dazu, dass bei mir im Studium in IT-Sicherheit"}, {"id": 419, "start": 2777.4, "end": 2784.48, "text": "Zoom benutzt wird? Zoom ist dieses Videokonferenz-Ding, ne? Was jetzt voll im Trend ist. Ich hab"}, {"id": 420, "start": 2784.48, "end": 2789.8, "text": "keine Ahnung, gut Zoom oder schlechtes. Äh, machst du einfach weniger Stunden in der Woche"}, {"id": 421, "start": 2789.8, "end": 2796.64, "text": "oder hast du pauschal einen Tag frei? Ich arbeite montags nicht, ja. Benutzt du KeyPass oder"}, {"id": 422, "start": 2796.64, "end": 2800.4, "text": "das was? KeyPass. Bei Springer gibt es gerade viele Progas, Bücher kostenlos, vielleicht"}, {"id": 423, "start": 2800.4, "end": 2803.72, "text": "sind auch welche für dich dabei. Schick mal Blitz Link, da gucken wir uns das zusammen"}, {"id": 424, "start": 2803.72, "end": 2810.88, "text": "an. Kompletter Fail. Also eins muss man ja über Microsoft Teams sagen, ich muss jetzt"}, {"id": 425, "start": 2810.88, "end": 2818.68, "text": "echt mal anfangen. Eins muss man ja über Microsoft Teams sagen, das hat ein paar Macken,"}, {"id": 426, "start": 2818.68, "end": 2824.2, "text": "aber groß und ganz funktioniert es wirklich gut für ein Microsoft Produkt. So, ich zeig"}, {"id": 427, "start": 2824.2, "end": 2828.96, "text": "euch mal die Library, die wir verwenden jetzt dafür. Weil ich hab mir ja in den Kopf gesetzt,"}, {"id": 428, "start": 2828.96, "end": 2833.68, "text": "wir wollen ein Over-the-Air-Update machen, also sprich ich will meine Microcontroller"}, {"id": 429, "start": 2833.68, "end": 2843.0, "text": "aktualisieren können, übers WLAN, ähm, über HTTPS, also über SSL. Und ich war mal wieder"}, {"id": 430, "start": 2843.0, "end": 2848.0, "text": "so richtig big brain, dass ich mir was ausgesucht hab, was es anscheinend nicht gibt. Und was"}, {"id": 431, "start": 2848.0, "end": 2852.52, "text": "bisher keiner gemacht hat, ähm, und irgendwie auch sonst keiner machen will. Ich weiß auch"}, {"id": 432, "start": 2852.52, "end": 2859.92, "text": "nicht warum, es gibt nichts fertiges. Es gibt nichts fertiges dafür. Das heißt wir"}, {"id": 433, "start": 2859.92, "end": 2870.68, "text": "müssen das selbst machen. Über HTTP ist kein Problem, da gibt es sich Web-Server. Sucht"}, {"id": 434, "start": 2870.68, "end": 2875.36, "text": "ihr Anwendungsentwickler? Ja, wir suchen, so gut wie immer, Programmierer, Anwendungsentwickler."}, {"id": 435, "start": 2875.36, "end": 2890.92, "text": "Programmierer reduziert ja die Leute ein bisschen zu sehr. Also wir suchen immer Anwendungsentwickler."}, {"id": 436, "start": 2890.92, "end": 2913.56, "text": "Hä, ähm, irgendwas wollte ich gerade noch sagen. Achja, die Progress-Bücher, die Progress-Bücher"}, {"id": 437, "start": 2913.56, "end": 2926.52, "text": "wollten wir uns kurz angucken. Das kommt mir bekannt vor, die Musik. Ah, ja, hab ich nie"}, {"id": 438, "start": 2926.52, "end": 2935.8, "text": "durchgespielt. Ähm, ok, also, Springer, das ist doch nicht Bild-Zeitung. Wo gibt's die"}, {"id": 439, "start": 2935.8, "end": 2944.48, "text": "ganzen Bücher? Hier, Free Books. Ach, Download, All. Achso, ein Ref-Link für die Bewerbung."}, {"id": 440, "start": 2944.48, "end": 2948.28, "text": "Ne, aber solltest du dich bei einer Bank in Frankfurt bewerben, kannst du mich ja vorher"}, {"id": 441, "start": 2948.28, "end": 2956.24, "text": "mal fragen, ob ich da nicht arbeite, weil, dann, ähm, dann empfehle ich dich und dann"}, {"id": 442, "start": 2956.24, "end": 2959.12, "text": "kann ich dann erst das Monatsgehalt, oder ich glaube sogar den ersten zwei Monatsgehalte"}, {"id": 443, "start": 2959.12, "end": 2972.56, "text": "kassieren. Als, ähm, äh, Werbungs-, äh, Programm. So, wo steht denn, wo steht denn"}, {"id": 444, "start": 2972.56, "end": 2975.24, "text": "was die alles für Bücher haben? Ich will jetzt, ich will mir nicht unbedingt alles"}, {"id": 445, "start": 2975.24, "end": 2979.32, "text": "runterladen, ich will erst mal sehen, was die eigentlich alles haben. Hier, Springer-Announcement,"}, {"id": 446, "start": 2979.32, "end": 2995.32, "text": "ja. Und wo sieht man jetzt was die für Bücher? Hier, Archiv. What? Zweiter Link, Full List."}, {"id": 447, "start": 2995.32, "end": 3005.96, "text": "Hier. Ah, yes. Lieber Office, wusste gar nicht, dass ich den Crab installiert hab. Also,"}, {"id": 448, "start": 3005.96, "end": 3013.4, "text": "was haben sie mir zu bieten? Juckt mich nicht, juckt mich nicht, juckt mich nicht, juckt"}, {"id": 449, "start": 3013.4, "end": 3021.04, "text": "mich nicht. Auch nicht, auch nicht. Wo sind denn die Programme? 400? What the fuck? Brustkrebs."}, {"id": 450, "start": 3021.04, "end": 3026.32, "text": "Nein, will ich mich überhaupt nicht angucken. Äh, sind die nach, sind die nach, nach Themen"}, {"id": 451, "start": 3026.32, "end": 3029.76, "text": "irgendwie sortiert? Das kann ich mir jetzt nicht angucken, dann krieg ich ja drei, drei"}, {"id": 452, "start": 3029.76, "end": 3051.44, "text": "Stunden. Nach Kategorien? Wie? Ah, Product Type. German Books. Wo ist denn die Kategorie?"}, {"id": 453, "start": 3051.44, "end": 3080.92, "text": "Ah, hier. Rasta. Ok, also. Religion, Philosophie raus, Social Science, Science, Science, Science,"}, {"id": 454, "start": 3080.92, "end": 3094.56, "text": "Science. Physik und Astronomie, Medizin, Mathematik, Statistik. Oha, mal gucken. Intelligent Technologies."}, {"id": 455, "start": 3094.56, "end": 3107.56, "text": "Oh, das ist Mega Man. Glaub ich. Das ist Mega Man? Ja, oh, huge Musik. Äh, was mit Menschen,"}, {"id": 456, "start": 3107.56, "end": 3119.56, "text": "gehen wir bloß fort. Energie, BWL Crap, Computer Science, können wir mal den Rest weg. Was bleibt"}, {"id": 457, "start": 3119.56, "end": 3138.44, "text": "da noch übrig? Einfach mal. Äh. Äh. Äh. Sind wir noch so viel? Das kann ich mir jetzt"}, {"id": 458, "start": 3138.44, "end": 3147.52, "text": "nicht angucken, das ist zu viel. Ok, wir machen jetzt mal Education, Engineering, machen wir"}, {"id": 459, "start": 3147.52, "end": 3154.64, "text": "alles weg, wir machen bloß Computer, Computer Science. Ah, nur Computer, nur Computer Science."}, {"id": 460, "start": 3154.64, "end": 3166.36, "text": "So, wie viele Bücher haben wir da? Was? Warum sind das immer noch 406? Ach nee. Ach guck"}, {"id": 461, "start": 3166.36, "end": 3173.24, "text": "mal, das überspringt das. Ok, ich bin zu dumm für Excel. Aber ihr wisst, ich verwende"}, {"id": 462, "start": 3173.24, "end": 3179.04, "text": "Excel nicht. Ich kann mich mit Excel nicht auskennen. Noch nie Excel benutzt? Ja, einmal"}, {"id": 463, "start": 3179.04, "end": 3183.92, "text": "oder so. Ich hab mich ja schon gewundert, dass ich überhaupt LibreOffice installiert"}, {"id": 464, "start": 3183.92, "end": 3190.36, "text": "hab. Äh, ok, also das interessiert mich nicht so wirklich. Das könnte relativ interessant"}, {"id": 465, "start": 3190.36, "end": 3201.76, "text": "sein. La. LaTeX. Brauchst du noch die Excel Tool? Oh, da hab ich mich auf der Arbeit glücklicherweise"}, {"id": 466, "start": 3201.76, "end": 3216.72, "text": "vorgedrückt. Ähm. Automaten und Computability. Äh, nee. Design, UML. Boah. Ich glaub, ich"}, {"id": 467, "start": 3216.72, "end": 3221.4, "text": "hab irgendwie gefühlt jede Menge Subs übersehen, kann das sein? Ich muss da mal kurz reingucken."}, {"id": 468, "start": 3221.4, "end": 3234.36, "text": "Da ich nicht für die Hälfte übersehen hab. Das wäre ziemlich MonkaS. Wen haben wir denn"}, {"id": 469, "start": 3234.36, "end": 3242.0, "text": "hier am Start? Äh, Heinrich hat Subscribed. Sechs Monate, Dankeschön. Huge Sub. Und"}, {"id": 470, "start": 3242.0, "end": 3245.88, "text": "da Fobi auch, fünf Monate. Dich hatt ich glaub ich schon, aber trotzdem, Dankeschön"}, {"id": 471, "start": 3245.88, "end": 3254.04, "text": "für die ganzen Subs. Nicht lull. Wollte ich gar nicht drücken. Als wollte ich drücken."}, {"id": 472, "start": 3254.04, "end": 3263.0, "text": "UML, Power Plus Off. Äh, ok, Foundations for Designing User Sentences. Computer Vision"}, {"id": 473, "start": 3263.0, "end": 3272.88, "text": "Data Mining, Simple Geometry, Hanzo. Autografie, Eye Tracking, Machine Learning. Oh, haben wir"}, {"id": 474, "start": 3272.88, "end": 3280.32, "text": "hier für unsere ganzen Mathe-Fans. Nope, nope, nope. Concise Guide to Software Engineering."}, {"id": 475, "start": 3280.32, "end": 3284.84, "text": "Das Pison Workbook, vielleicht nicht schlecht. Fundamentals Multimedia, vielleicht, kein"}, {"id": 476, "start": 3284.84, "end": 3292.96, "text": "Schimmer. Äh, jede Menge Pison-Programmierung. Object-Oriented Analysis. Oh, nee, das mir"}, {"id": 477, "start": 3292.96, "end": 3298.56, "text": "zu harte kost. Introduction to Data Science, Concise Guide to Databases, Digital Image"}, {"id": 478, "start": 3298.56, "end": 3306.16, "text": "Processing. Irgendwas, wo ich jetzt sagen würde. Ja, ja, das interessiert mich voll."}, {"id": 479, "start": 3306.16, "end": 3311.52, "text": "Statistics, Guide to Competitive Programming. Das könnte tatsächlich interessant sein. Das"}, {"id": 480, "start": 3311.52, "end": 3315.4, "text": "habe ich sogar letztens mal in einem Video als Empfehlung gehört, diesen Guide to Competitive"}, {"id": 481, "start": 3315.4, "end": 3323.96, "text": "Programming. Der könnte wahrscheinlich ganz, ganz gut sein. Äh, Introduction to Artificial"}, {"id": 482, "start": 3323.96, "end": 3332.6, "text": "Intelligence. Nee. Scala. Java. Geh fort. Ich weiß, das mit Java nichts zu tun hat, aber"}, {"id": 483, "start": 3332.6, "end": 3342.64, "text": "ist Scala nicht auf JVM-Basis? BWL-Crap. Oh, das war's für mich. Guide to Scientific"}, {"id": 484, "start": 3342.64, "end": 3358.08, "text": "Computing in C++. Endlich. Herz390. Hallo. Äh, oh, das ist ja, ist ja das Doppelpack."}, {"id": 485, "start": 3358.08, "end": 3367.04, "text": "Wenn du denkst, es kann kaum noch schlimmer werden, kommt die Java-Grundlage danach. Logical"}, {"id": 486, "start": 3367.04, "end": 3377.28, "text": "Foundation of Cyber-Physical Systems. Fortran. Was ist denn mit denen los? Aus 2018. Es gibt"}, {"id": 487, "start": 3377.28, "end": 3393.0, "text": "ein Buch aus 2018 über Fortran. Ich hätte erwartet, es ist ein Buch von 1970 oder so."}, {"id": 488, "start": 3393.0, "end": 3398.8, "text": "System Programming in Unix-Linux. Das könnte ganz interessant sein. Parallel Computing vielleicht"}, {"id": 489, "start": 3398.8, "end": 3406.16, "text": "auch. Eine ist es für Computer. Java into Semesters. Beginner. Die könnten, die, ich"}, {"id": 490, "start": 3406.16, "end": 3409.64, "text": "glaube die Dinger sind sogar ganz gut hier. Ich, ich, ich bilde mir ein, das habe ich"}, {"id": 491, "start": 3409.64, "end": 3416.92, "text": "schon mal irgendwo als Empfehlung gelesen, die zwei Pausenbücher. So, aber Leute, ich"}, {"id": 492, "start": 3416.92, "end": 3420.92, "text": "habe geschrieben, wir machen Progress. Wir machen jetzt auch Progress. Und zwar, jetzt"}, {"id": 493, "start": 3420.92, "end": 3428.2, "text": "pass mal auf, jetzt geht es ab. Bam. Bam. Also, das Ziel ist ja, dass ich meine Micro-Controllers,"}, {"id": 494, "start": 3428.2, "end": 3433.8, "text": "also unter anderem die hier, updaten kann über das WLAN. Und über das WLAN updaten"}, {"id": 495, "start": 3433.8, "end": 3438.32, "text": "gibt es zwei verschiedene Varianten. Entweder man legt die neue Firmware irgendwo auf einen"}, {"id": 496, "start": 3438.32, "end": 3448.36, "text": "Server drauf und lässt die sich von seinem Controller per HTTP pullen von einem Server."}, {"id": 497, "start": 3448.36, "end": 3454.12, "text": "Das ist interessant. Mal angenommen, man ist Hersteller von einer smarten Steckdosenleiste,"}, {"id": 498, "start": 3454.12, "end": 3461.8, "text": "sowie CoGeek. Die CoGeek Steckdosenleiste, die hat ja einen ESP866 drin. Und mal angenommen,"}, {"id": 499, "start": 3461.8, "end": 3470.72, "text": "ich bin ein Hersteller einer smarten Steckdosenleiste. Und ich möchte alle meine Geräte auf der"}, {"id": 500, "start": 3470.72, "end": 3475.28, "text": "Welt die Möglichkeit geben, mit neuer Firmware versorgt zu werden. Dann würde ich diese Methode"}, {"id": 501, "start": 3475.28, "end": 3479.4, "text": "nehmen. Dann würde ich nämlich auf einen Server bei mir signierte Firmware Package legen,"}, {"id": 502, "start": 3479.4, "end": 3486.16, "text": "neue Firmware. Und würde einfach sagen, okay, ich biete neues Update an. Und dann kriegen"}, {"id": 503, "start": 3486.16, "end": 3489.96, "text": "die Leute dann ein Pop-Up und klicken drauf und dann lädt es von meinem Server das Firmware"}, {"id": 504, "start": 3489.96, "end": 3495.0, "text": "Update runter und überhaltet TPS und macht das Update und gut ist. So, das ist die eine"}, {"id": 505, "start": 3495.0, "end": 3500.44, "text": "Variante. Was ich machen will, ist die umgedrehte Variante. Ich will nicht, dass das Gerät"}, {"id": 506, "start": 3500.44, "end": 3505.88, "text": "sich das Update pullt vom Server, sondern ich will das Update auf das Gerät pushen."}, {"id": 507, "start": 3505.88, "end": 3513.44, "text": "Und das gibt, es gibt schlicht und ergreifend, ums Verr- ich hab GitHub rauf und runter abgesucht."}, {"id": 508, "start": 3513.44, "end": 3519.2, "text": "Es gibt nichts fertiges dafür. Über HTTPS ist das gar kein Problem, da gibt es ein paar"}, {"id": 509, "start": 3519.2, "end": 3526.36, "text": "fertige Sachen und man kann es auch relativ easy selbst machen. Aber über HTTPS findet"}, {"id": 510, "start": 3526.36, "end": 3533.8, "text": "man eh verdammt wenig. Auf dem ESP32. Das liegt zum größten Teil daran, weil der ESP32"}, {"id": 511, "start": 3533.8, "end": 3541.24, "text": "halt auch nicht viel RAM hat. Ich glaub 80 Kilo Byte oder so. Weiß nicht, wie viel RAM"}, {"id": 512, "start": 3541.24, "end": 3549.64, "text": "das Ding hat. Ja, 160, 160K. Und ich glaube, das teilt man sich auch mit, also das ist"}, {"id": 513, "start": 3549.64, "end": 3554.88, "text": "nicht reiner RAM, das teilt man sich glaube ich auch mit irgendwelchen statischen Sachen"}, {"id": 514, "start": 3554.88, "end": 3558.8, "text": "aus dem Sketch und so. Also wir können ja mal gucken, ob wir ausgeben lassen können,"}, {"id": 515, "start": 3558.8, "end": 3565.52, "text": "wie viel RAM man hat. ESP, irgendwie Heap. GetFreeHeap. Gucken wir mal. Wir geben uns"}, {"id": 516, "start": 3565.52, "end": 3570.24, "text": "mal den RAM aus, den wir haben. Also da sieht man schon, das Ding ist relativ beschränkt,"}, {"id": 517, "start": 3570.24, "end": 3580.08, "text": "was RAM-Size ist. Wie viel hast du für deinen TinyPico bezahlt, die 40€ oder wie? 20 Dollar?"}, {"id": 518, "start": 3580.08, "end": 3587.88, "text": "Also irgendwie mit Versand wahrscheinlich. Also ich hab 10 Stück bestellt gleich. Wahrscheinlich"}, {"id": 519, "start": 3587.88, "end": 3598.48, "text": "mit Versand ein bisschen mehr als 20€. So, ich kanns dir genau sagen. Bye. So, ich glaube"}, {"id": 520, "start": 3598.48, "end": 3606.08, "text": "ich hab da bestellt, ne zu teuer. Da oder da hab ich bestellt, eins von beiden, genau."}, {"id": 521, "start": 3606.08, "end": 3619.72, "text": "So, stellst du dir klein mal 10 Stück. Add to Cart. 200 Dollar. Eats AF. Checkout. So,"}, {"id": 522, "start": 3619.72, "end": 3625.96, "text": "continue. Ich will einfach nur sagen, was Shipping. Ok, wir geben jetzt mal Fake ein."}, {"id": 523, "start": 3625.96, "end": 3636.96, "text": "Ich will einfach nur zum Shipping. Shipping. So, Blob, Blob, Blob, Blob in Germany. Germany."}, {"id": 524, "start": 3636.96, "end": 3649.96, "text": "6 0 3 2 9 Frankfurt. Frankfurt. Hessen. Phone Number. Ok, genau. 15 Dollar kostet's. Was?"}, {"id": 525, "start": 3649.96, "end": 3657.2, "text": "Ja gut, ab spätestens wir, jetzt machen wir nicht weiter. Also 15 Dollar Tracked Package,"}, {"id": 526, "start": 3657.2, "end": 3669.64, "text": "Tracked Post. Das heißt du bezahlst am Ende 115 Dollar. Also das heißt du bezahlst ziemlich"}, {"id": 527, "start": 3669.64, "end": 3675.68, "text": "genau 200€ für 10 Stück. Du kannst natürlich auch weniger nehmen, ne? Aber die Versandkosten,"}, {"id": 528, "start": 3675.68, "end": 3680.52, "text": "also ist halt die Frage, ob sich das so sehr lohnt, ne? Ich bestell mir bei fast allen mittlerweile"}, {"id": 529, "start": 3680.52, "end": 3688.68, "text": "10er Packs. Ich hab am Anfang den Fehler gemacht und hab bei vielen Sachen, auch bei"}, {"id": 530, "start": 3688.68, "end": 3694.2, "text": "kleinen Elektronikkram, hab ich immer eins bestellt. Und du machst so kleine Teile, in"}, {"id": 531, "start": 3694.2, "end": 3701.48, "text": "den ersten Teilen die Pico hab ich schon gefetzt, ja. Aber weil ich zu doof war. Ich hab die"}, {"id": 532, "start": 3701.48, "end": 3704.92, "text": "WLAN Antenne abgebrochen aus Versehen, weil ich zu sehr dran gezogen hab. Kann man wieder"}, {"id": 533, "start": 3704.92, "end": 3710.44, "text": "fixen, kann ich dran löten, ist kein Problem. Hab ich bloß noch nicht gemacht. Ähm, so."}, {"id": 534, "start": 3710.44, "end": 3714.88, "text": "Und, äh, deswegen, ich bestell mir bei allen Elektronikdingern mittlerweile entweder 5"}, {"id": 535, "start": 3714.88, "end": 3722.84, "text": "oder 10. Oder halt 3, wenn's das anderweitig nicht gibt. Es ist, es ist wirklich sinnvoll,"}, {"id": 536, "start": 3722.84, "end": 3726.56, "text": "sich mehrere Sachen zu bestellen, weil so Kleinkram, gerade wenn man sich beispielsweise"}, {"id": 537, "start": 3726.56, "end": 3730.2, "text": "irgendwelche Sensoren holt oder sonst was, die macht man so schnell mal kaputt und dann"}, {"id": 538, "start": 3730.2, "end": 3734.4, "text": "hat man keinen Ersatz da. Ich hab mittlerweile von den meisten Sensoren halt auch hier ein"}, {"id": 539, "start": 3734.4, "end": 3739.48, "text": "paar liegen. Also quasi, so Sachen die man immer braucht, paar Widerstände, die gängigsten"}, {"id": 540, "start": 3739.48, "end": 3743.96, "text": "Sensoren, paar Spannungswandler, da hab ich immer genug da, dass man einfach auch mal"}, {"id": 541, "start": 3743.96, "end": 3754.0, "text": "Ersatz hat. So, ähm, also wir sehen wir haben freien Speicher, das sind wahrscheinlich"}, {"id": 542, "start": 3754.0, "end": 3767.16, "text": "Bites, denk ich mal. Bites to Megabytes. Nein, Google. Ja, schon besser. Also wir haben"}, {"id": 543, "start": 3767.16, "end": 3777.56, "text": "250, 250 Kilobyte RAM auf dem ESP gerade. Das ist, äh, das ist sogar mehr als ich gedacht"}, {"id": 544, "start": 3777.56, "end": 3783.08, "text": "hab, ehrlich gesagt. Ich dachte es ist weniger. Ähm, aber man sieht, man kann da keine allzu"}, {"id": 545, "start": 3783.08, "end": 3788.8, "text": "großen Sprünge machen. Also sprich 250 Kilobyte. Wir haben weniger als 1 MB RAM. Und in meinem"}, {"id": 546, "start": 3788.8, "end": 3792.64, "text": "Desktop Rechner sind gerade 32 Gigabyte. Also da sieht man mal was das Hardware mäßig"}, {"id": 547, "start": 3792.64, "end": 3797.64, "text": "so vom Vergleich her ist, ja. Ähm, okay, aber ich hab gesagt wir wollen ein bisschen"}, {"id": 548, "start": 3797.64, "end": 3801.72, "text": "Progress machen. Gut. Also wir nehmen diese Library hier. Die hab ich im Vorfeld schon"}, {"id": 549, "start": 3801.72, "end": 3810.52, "text": "rausgesucht. Habe ich es nicht eben schon mal auf. Ja. Den ESP32 HTTPS Server. Ich hab,"}, {"id": 550, "start": 3810.52, "end": 3813.16, "text": "ich hab da wie gesagt schon ein bisschen mit rumgespielt. Das heißt ich kann jetzt auch"}, {"id": 551, "start": 3813.16, "end": 3818.36, "text": "ein bisschen abgucken vorher. Ich hab, ich hab hier, also ich will jetzt nicht sagen"}, {"id": 552, "start": 3818.36, "end": 3822.16, "text": "ich mach das alles komplett blind und ist es nicht. Also ich hab schon ein paar Sachen"}, {"id": 553, "start": 3822.16, "end": 3828.6, "text": "im Vorfeld ausprobiert und ich hab echt gekämpft mit dem Ding. Also die Library ist bei weitem"}, {"id": 554, "start": 3828.6, "end": 3833.88, "text": "nicht bugfrei und hat echt ein paar sehr merkwürdige Designentscheidungen. Das werden wir aber"}, {"id": 555, "start": 3833.88, "end": 3841.84, "text": "gleich sehen. Ich installiere das ganze das erste Mal. Ähm, aber es ist das einzige was"}, {"id": 556, "start": 3841.84, "end": 3851.8, "text": "ich gefunden habe, was auf dem ESP32 Arduino Kram funktioniert und einen HTTPS Web Server"}, {"id": 557, "start": 3851.8, "end": 3859.48, "text": "mit TLS bzw. SSL HTTPS hat. Ansonsten hab ich nix gefunden. Das Ding ist so verbugged,"}, {"id": 558, "start": 3859.48, "end": 3863.52, "text": "ihr werdet es gleich sehen, diese Library ist so verbugged, dass wenn ich die Verbindung"}, {"id": 559, "start": 3863.52, "end": 3870.8, "text": "abbreche, dann muss ich den ESP neu starten, dass der Server sich wieder, wieder einkriegt."}, {"id": 560, "start": 3870.8, "end": 3876.8, "text": "Das Ding ist schon ganz schön im Arsch. YouTube Money klingt halt, wenn man sich direkt für"}, {"id": 561, "start": 3876.8, "end": 3883.2, "text": "200 Euro ESPs kauft. Das hat ja mit YouTube Money, ja das ist schon nicht unreich, aber"}, {"id": 562, "start": 3883.2, "end": 3887.32, "text": "es ist einfach preisleistungsmäßig sinnvoller sich gleich 10 Stück zu kaufen. Die sind natürlich"}, {"id": 563, "start": 3887.32, "end": 3891.76, "text": "viel zu teuer, muss man auch mal sagen. Also ich empfehle das, übrigens wo war ich jetzt"}, {"id": 564, "start": 3891.76, "end": 3894.52, "text": "schon. Also ich empfehle euch nicht die Dinger zu kaufen, wenn ihr nicht eh schon ein bisschen"}, {"id": 565, "start": 3894.52, "end": 3900.48, "text": "damit rum spielt. Wenn ihr anfangen wollt ESP32 zu programmieren, ist es viel, viel"}, {"id": 566, "start": 3900.48, "end": 3906.8, "text": "einfacher. Ihr kauft euch z.B. eine NodeMCU. Die kannst du dir bei Amazon.de kaufen für"}, {"id": 567, "start": 3906.8, "end": 3913.52, "text": "ein Apple und ein i. Hier, ATS Delivery. Ne, das ist die falsche ESP. Das ist die"}, {"id": 568, "start": 3913.52, "end": 3922.4, "text": "ESP32866. Die gibt es teilweise bei Amazon, auch schon Amazon.de. Für 8, 9, hier. Ne."}, {"id": 569, "start": 3922.4, "end": 3935.52, "text": "Ja gut, hier kriegst du 3 Stück. 5 Stück. Haben die keine? Das sind die 9, da muss"}, {"id": 570, "start": 3935.52, "end": 3945.88, "text": "man aufpassen. Das sind die mit USB, wofür es noch nichts gibt. Okay, ja, also gibt es"}, {"id": 571, "start": 3945.88, "end": 3952.64, "text": "bei AliExpress günstiger. Aber wenn ihr einfangen wollt, kauft euch lieber so ein Board. 1, 2."}, {"id": 572, "start": 3952.64, "end": 3955.8, "text": "Wie gesagt, ich würde immer 2 kaufen oder klein 3. Die sind nämlich schon komplett"}, {"id": 573, "start": 3955.8, "end": 3962.4, "text": "fertig. Die haben mehr Pins als der Tiny und die haben natürlich schon alles vorgelötet."}, {"id": 574, "start": 3962.4, "end": 3966.2, "text": "Ihr müsst hier gar nichts machen. Und was können diese Tiny Picos mehr? Die können"}, {"id": 575, "start": 3966.2, "end": 3971.16, "text": "nicht mehr, die können kleiner sein. Das ist der einzige wirkliche Vorteil von den Dinger,"}, {"id": 576, "start": 3971.16, "end": 3979.28, "text": "dass die klein sind. Und die sind halt extrem klein. Die sind so klein wie mein Daumennagel,"}, {"id": 577, "start": 3979.28, "end": 3984.4, "text": "siehst du hier im Vergleich zu einer AA-Batterie. Die sind einfach klein. Das heißt, wenn man"}, {"id": 578, "start": 3984.4, "end": 3988.56, "text": "die Dinger irgendwo einbauen will, hinter eine Dose in die Wand oder so, da sind natürlich"}, {"id": 579, "start": 3988.56, "end": 3997.72, "text": "super dafür. Da sind die normalen NodeMCUs ein bisschen dick. Die sind ungefähr, so"}, {"id": 580, "start": 3997.72, "end": 4013.92, "text": "ein NodeMCU ist ungefähr ein Zentimeter kleiner als ein Raspberry Pi Zero. Ja. Hi Max, gibt"}, {"id": 581, "start": 4013.92, "end": 4020.16, "text": "es eine Möglichkeit, wenn man auf einem deutschen System einen Double generiert, der mit Komma"}, {"id": 582, "start": 4020.16, "end": 4025.04, "text": "getrennt ist, in Punkttrennung umzuwandeln und damit man das richtig in einer Datenbank"}, {"id": 583, "start": 4025.04, "end": 4032.44, "text": "speichern kann, ohne es vorher in ein String zu kommen. Ja, du kannst, warte mal, ne. Du"}, {"id": 584, "start": 4032.44, "end": 4036.72, "text": "musst das nicht umwandeln. Wenn es ein Float ist und du speicherst es in die Datenbank,"}, {"id": 585, "start": 4036.72, "end": 4042.48, "text": "dann ist das vollkommen egal. Der Punkt und die, es gibt gar keinen Punkt und Komma in"}, {"id": 586, "start": 4042.48, "end": 4048.16, "text": "der internen Speicherung von so einem Float, wie du dir das vorstellst. Wenn du einen Double"}, {"id": 587, "start": 4048.16, "end": 4052.52, "text": "oder einen Float hast, dann ist es egal, ob Deutsch oder Englisch. Deutsch oder Englisch"}, {"id": 588, "start": 4052.52, "end": 4058.76, "text": "wird erst interessant, wenn du es in ein String umwandeln willst. Davor ist es egal. Wenn du"}, {"id": 589, "start": 4058.76, "end": 4064.8, "text": "eine Zahl als Double hast, gibt es kein Deutsch und Englisch. Da gibt es nur Double oder"}, {"id": 590, "start": 4064.8, "end": 4072.04, "text": "Float oder Long oder Long Long oder U Long oder was auch immer. Float ist so der Überbegriff."}, {"id": 591, "start": 4072.04, "end": 4087.8, "text": "Kleid, Kleidkomma, Fließkomma, Kleidkomma. Ich bin ja eher für Kleidkomma. Was kann man"}, {"id": 592, "start": 4087.8, "end": 4091.44, "text": "mit dem ganzen Zeug machen? Bei meiner Schule, beim PC-Raum liegen nur solche Dinge rum."}, {"id": 593, "start": 4091.44, "end": 4094.96, "text": "Ein Schüler hat einfach die Dinger auf den Boden geschmissen. Da würde ich den Schüler"}, {"id": 594, "start": 4094.96, "end": 4106.0, "text": "erst mal anscheißen, warum er einen Dinger auf den Boden schmeißt. So, also, Leute, Max,"}, {"id": 595, "start": 4106.0, "end": 4111.04, "text": "ich habe nicht mehr lang Zeit. Konzentriert. Also, wir haben nichts gemacht heute. Also,"}, {"id": 596, "start": 4111.04, "end": 4115.76, "text": "ich habe die Library jetzt installiert. Wie gesagt, Fragen gehen bei mir nicht verloren."}, {"id": 597, "start": 4115.76, "end": 4123.08, "text": "Fragen werden hier mitgelockt. Also, ich werde das nachher noch alles beantworten. So, also,"}, {"id": 598, "start": 4123.08, "end": 4126.52, "text": "was wir jetzt machen ist, wir gehen jetzt mal auf die Seite und gucken uns den Example-Code"}, {"id": 599, "start": 4126.52, "end": 4135.28, "text": "an. Das ist nämlich recht easy, recht easy zu benutzen. HTML Forms. Das heißt, wir werden"}, {"id": 600, "start": 4135.28, "end": 4147.28, "text": "zuerst, wir machen, wir machen es gleich mit HTTPS. Das Ziel ist, das Ziel ist ja, dass"}, {"id": 601, "start": 4147.28, "end": 4154.44, "text": "wir das mit HTTPS machen, aber erst gleich. Also, Examples. So, wir nehmen uns das Formsexample,"}, {"id": 602, "start": 4154.44, "end": 4161.68, "text": "weil wir Sachen pushen wollen. Und, ja, ich zeige euch jetzt mal gleich, ich zeige euch"}, {"id": 603, "start": 4161.68, "end": 4171.64, "text": "erst mal, was für eine krasse Qualität diese Library hat. Self-Signed. Wo ist das Beispiel"}, {"id": 604, "start": 4171.64, "end": 4177.44, "text": "mit Self-Signed? Hier, Self-Signed-Zertifikat. Ich will es euch noch mal beispielsweise zeigen,"}, {"id": 605, "start": 4177.44, "end": 4186.28, "text": "mit was für einer doch etwas, ja, sagen wir noch, Optimierung, Optimier-Library mit Optimierungsbedarf"}, {"id": 606, "start": 4186.28, "end": 4192.88, "text": "wir uns hier zu tun haben. Also, erst mal die ganzen Headers include. Ich gebe dir Header."}, {"id": 607, "start": 4192.88, "end": 4209.8, "text": "So, HTTPS. Watt? Watt, ich hab's doch installiert. Was hat er für Schmerzen? Hab ich, hab ich"}, {"id": 608, "start": 4209.8, "end": 4225.72, "text": "die Library eben installiert, oder? Jetzt bin jetzt wir im Kopf. Install. Build. Ah,"}, {"id": 609, "start": 4225.72, "end": 4233.72, "text": "ich hab Using-Namespace vergessen. Wir sind ja C++, ganz vergessen. Sah der Code gestern"}, {"id": 610, "start": 4233.72, "end": 4239.84, "text": "ich so, doch. Ah, jetzt funktioniert's. Jetzt muss ich noch mal neu starten, nur dass er"}, {"id": 611, "start": 4239.84, "end": 4247.36, "text": "meine Header gecheckt. Ich hab mich mal wieder zum Labern hinreißen lassen. Aber jetzt machen"}, {"id": 612, "start": 4247.36, "end": 4252.16, "text": "wir noch was, jetzt machen wir noch was. Letzte Zeit hier machen wir jetzt noch was. So,"}, {"id": 613, "start": 4252.16, "end": 4261.0, "text": "bla, bla, SSL-Zert. So, und jetzt passt mal auf, wie kaputt das Ganze ist. Setup. Wir"}, {"id": 614, "start": 4261.0, "end": 4265.68, "text": "generieren jetzt mal ein SSL, ein Self-Signed SSL-Zertifikat. Weil, ich mein, wir wollen"}, {"id": 615, "start": 4265.68, "end": 4273.0, "text": "ja einen HTTPS, also einen TLS-Webserver mit SSL haben. Und dazu müssen wir natürlich"}, {"id": 616, "start": 4273.0, "end": 4277.44, "text": "irgendein Zertifikat hinterlegen auf dem Webserver, dass das überhaupt funktioniert."}, {"id": 617, "start": 4277.44, "end": 4284.88, "text": "So, also, KeySize, das hier, wir fancy company, unser Name, das sind die Sachen, die dann"}, {"id": 618, "start": 4284.88, "end": 4292.04, "text": "später im Zertifikat drinne stehen. Also, unsere Firma, also, Organization, heißt CACW"}, {"id": 619, "start": 4292.04, "end": 4298.52, "text": "und der Name, wofür das Ganze ausgestellt wird, 122168, 100, nee, keine Ahnung, ist"}, {"id": 620, "start": 4298.52, "end": 4306.72, "text": "ein Scheiß egal. Vollkommen egal. Es geht eh nicht. So, laufe ich bis 2030, wunderbar."}, {"id": 621, "start": 4306.72, "end": 4313.68, "text": "So, jetzt passt mal auf. Ich will euch nur mal zeigen, wie toll die Library funktioniert."}, {"id": 622, "start": 4313.68, "end": 4317.8, "text": "Blablabla, funktioniert. Wir lagen jetzt mal hoch. Also, was der jetzt machen sollte"}, {"id": 623, "start": 4317.8, "end": 4326.08, "text": "ist, ein neues Zertifikat generieren und dann ausgeben, hat funktioniert. Nee, gar"}, {"id": 624, "start": 4326.08, "end": 4330.32, "text": "nicht. Ja, das hat funktioniert, gibt er nicht aus. Einfach nicht ausgeben, er hat"}, {"id": 625, "start": 4330.32, "end": 4335.92, "text": "funktioniert. Aber ich kann euch schon mal spoilern, das Zertifikat generieren funktioniert"}, {"id": 626, "start": 4335.92, "end": 4344.52, "text": "nicht. Warum, weiß ich nicht. Es ist natürlich für einen HTTPS-SSL-Webserver schon mal sehr"}, {"id": 627, "start": 4344.52, "end": 4349.8, "text": "schlecht, wenn das Zertifikate-Generieren nicht funktioniert. Weil ohne Zertifikate"}, {"id": 628, "start": 4349.8, "end": 4356.76, "text": "kein SSL und kein HTTPS und sowas. Deswegen müssen wir die Zertifikate jetzt selber generieren."}, {"id": 629, "start": 4356.76, "end": 4368.08, "text": "Weil die Library bietet das zwar an, aber die ist kaputt. Wir warten jetzt erst mal,"}, {"id": 630, "start": 4368.08, "end": 4377.08, "text": "bis er Zertifikate generiert hat. Das dauert ja so 20, 30 Sekunden und dann werdet ihr"}, {"id": 631, "start": 4377.08, "end": 4380.92, "text": "gleich sehen, was passiert, wenn er fertig Zertifikate generiert ist. Es kann natürlich"}, {"id": 632, "start": 4380.92, "end": 4383.8, "text": "auch sein, dass es jetzt mittlerweile einen neuen Bug gibt, weil das ist ja schon ein"}, {"id": 633, "start": 4383.8, "end": 4390.32, "text": "Jahr her, wo ich das ausprobiert habe, dass es jetzt komplett hängt oder so. Mal abwarten."}, {"id": 634, "start": 4390.32, "end": 4398.0, "text": "Schauen wir mal ab, das dauert so eine halbe Minute, die Zertifikate zu generieren. Oliver391"}, {"id": 635, "start": 4398.0, "end": 4405.88, "text": "sagt Namespaces C++, ja. Leider kommen wir nicht drum herum. Ich hab mir während der"}, {"id": 636, "start": 4405.88, "end": 4409.48, "text": "Zertifikate, nee, ich will es euch ja zeigen, ich will ja, dass wir sehen, wie er crasht."}, {"id": 637, "start": 4409.48, "end": 4425.24, "text": "Craschosaurus rex. Oh, das war Payne's Champ, oder? Kann das sein, dass er gar nichts macht"}, {"id": 638, "start": 4425.24, "end": 4437.28, "text": "gerade? Dass er einfach nur hängt? Komplett hängen geblieben. Sollte es, ich kann euch"}, {"id": 639, "start": 4437.28, "end": 4445.16, "text": "spoilern, es funktioniert nicht. Zertifikate generieren ist kaputt. Wir sehen es ja gleich."}, {"id": 640, "start": 4445.16, "end": 4449.32, "text": "Ich hab mir nämlich noch was anderes gekauft. Das müssen wir auch demnächst mal im Stream"}, {"id": 641, "start": 4449.32, "end": 4455.4, "text": "ausprobieren. Ich hab mir nämlich ein Meadow bestellt. Das ist, den hab ich mir schon vor"}, {"id": 642, "start": 4455.4, "end": 4460.7, "text": "2-3 Monaten bestellt. Das ist ein Microcontroller, den man angeblich komplett mit.NET und C"}, {"id": 643, "start": 4460.7, "end": 4474.6, "text": "sharp programmieren kann. Mit ziemlich viel Leistung drinne sogar. Oh, was? Moment. Das"}, {"id": 644, "start": 4474.6, "end": 4491.44, "text": "Zertifikate-Galerien hat funktioniert? Das ist gestern immer abgekackt? Ja, wie denn"}, {"id": 645, "start": 4491.44, "end": 4503.88, "text": "das? Warum geht denn das jetzt? Ich bin begeistert. Wisst ihr, was ich jetzt mal mache? Nur für"}, {"id": 646, "start": 4503.88, "end": 4511.24, "text": "den Fall der Fälle, dass ich noch mal einen funktionierenden Example brauche hier. Aber"}, {"id": 647, "start": 4511.24, "end": 4523.48, "text": "es keck weh, hab ich keck weh gemacht. Get in it. Ich check das mal kurz ein. Geht,"}, {"id": 648, "start": 4523.48, "end": 4530.76, "text": "warum auch immer, dass ich es wieder kriege. Okay, das war so nicht geplant, weil gestern"}, {"id": 649, "start": 4530.76, "end": 4537.76, "text": "ist es die ganze Zeit abgekackt. Ich mach mal die kleine Key-Size, weil die ist definitiv"}, {"id": 650, "start": 4537.76, "end": 4553.2, "text": "immer abgeschissen gestern. Komisch. Ein nicer Vorführeffekt, ja. Hallo Marvcat. Unglaublich,"}, {"id": 651, "start": 4553.2, "end": 4572.76, "text": "dass was funktioniert, ja. Diese Fehlerbehandlung hier ist auch Wahnsinn. Das funktioniert?"}, {"id": 652, "start": 4572.76, "end": 4578.76, "text": "Es funktioniert einfach. So, dann bin ich mal gespannt, ob der Web-Server jetzt auch"}, {"id": 653, "start": 4578.76, "end": 4587.08, "text": "funktioniert. So, gut. Also wenn das Zertifikat-Generieren nicht funktioniert, dann sagen wir Restart."}, {"id": 654, "start": 4587.08, "end": 4594.96, "text": "Wir machen noch mal eine weitere Funktion und sagen jetzt in it WLAN, in it Wi-Fi oder"}, {"id": 655, "start": 4594.96, "end": 4604.12, "text": "was auch immer. Und da schieben wir den ganzen Kram hier rein und rufen das in it Wi-Fi"}, {"id": 656, "start": 4604.12, "end": 4610.24, "text": "hier auf, weil ich will meinen Setup-Funktion ein bisschen sauberer halten, dass ich durchblicke,"}, {"id": 657, "start": 4610.24, "end": 4616.88, "text": "was da eigentlich passiert. Nur durch die Kraft des Q-Chats tatsächlich, ja. Nur dadurch,"}, {"id": 658, "start": 4616.88, "end": 4621.8, "text": "ohne Scheiß, Leute, ich hab das Gleiche gestern probiert. Der ist mir bei jedem Zertifikat-Generieren"}, {"id": 659, "start": 4621.8, "end": 4626.84, "text": "verreckt. Ich hab keinen Schimmer, warum das jetzt funktioniert. Ich will mich ja nicht"}, {"id": 660, "start": 4626.84, "end": 4634.44, "text": "beschweren, dass es geht. So, jetzt haben wir nen Zertifikat. Jetzt haben wir nen Server."}, {"id": 661, "start": 4634.44, "end": 4646.32, "text": "Was macht der jetzt hier? Der gute Server-Start. Ja. Server. Also wir haben jetzt nen Zertifikat."}, {"id": 662, "start": 4646.32, "end": 4651.24, "text": "Hiernach haben wir nen Zertifikat. Wir weisen das Zertifikat dem Server zu, sagen ihm"}, {"id": 663, "start": 4651.24, "end": 4656.4, "text": "noch, wir wollen auf Port 443 lauschen. Müssen wir nicht. Das ist Default. Und wir wollen"}, {"id": 664, "start": 4656.4, "end": 4660.76, "text": "20-20 Verbindungen maximal. 20 ist viel zu viel. Das kann das Ding wahrscheinlich eh"}, {"id": 665, "start": 4660.76, "end": 4671.52, "text": "nicht ab. Was sind die Sternchen in C++-Kommentare? Nee. Welche? Sternchen? Ah, hier. Da ist ein"}, {"id": 666, "start": 4671.52, "end": 4681.2, "text": "Pointer. Nicht zu verwechseln mit dem da. Das ist eine Speicheradresse. Ein Pointer ist"}, {"id": 667, "start": 4681.2, "end": 4687.68, "text": "keine, nicht nur eine Speicheradresse. Das hier ist eine Speicheradresse. Das hier ist"}, {"id": 668, "start": 4687.68, "end": 4691.36, "text": "eine Kombination aus Speicheradresse und Typ. Das ist der Unterschied zwischen Pointer und"}, {"id": 669, "start": 4691.36, "end": 4700.04, "text": "Speicheradresse. Das war eigentlich so im Nachhinein, war das eine ziemlich kurz und"}, {"id": 670, "start": 4700.04, "end": 4708.6, "text": "knackige Erklärung für Pointer, oder? Pointer ist eine Speicheradresse und ein Typ. Das ist"}, {"id": 671, "start": 4708.6, "end": 4720.88, "text": "eigentlich eine ziemlich gute Erklärung. Big, big brain. Ah, yes. Excellent. Danke Max,"}, {"id": 672, "start": 4720.88, "end": 4724.16, "text": "das wird mir bei meiner Klausur helfen. Also wenn der Lehrer sagt, das ist falsch, dann"}, {"id": 673, "start": 4724.16, "end": 4735.76, "text": "ist er ein Kacknoob. So, also Server gestartet. Hier, Server start, müssen wir jetzt noch"}, {"id": 674, "start": 4735.76, "end": 4748.64, "text": "eine Webseite oder irgendwas, wo man was abrufen kann vom Web-Server. So, brauchen wir noch"}, {"id": 675, "start": 4748.64, "end": 4753.72, "text": "Funktionen. Übrigens, jetzt noch mal was schönes C++-mäßiges, was mich auch schon"}, {"id": 676, "start": 4753.72, "end": 4760.44, "text": "wieder komplett verwirrt. Wobei, machen wir nachher, machen wir nachher, weil es könnte"}, {"id": 677, "start": 4760.44, "end": 4770.6, "text": "sein, dass es hier tatsächlich sogar funktioniert. Update und wir wollen da einen Post machen,"}, {"id": 678, "start": 4770.6, "end": 4777.16, "text": "weil wir wollen ja unsere neue Firmware hochschieben. Lehrer sind halt öfters Kacknoobs als einem"}, {"id": 679, "start": 4777.16, "end": 4789.6, "text": "Lieb ist. Das ist korrekt. Excellent. So sieht's aus. Wo hat er hier die Funktion? Die Funktion"}, {"id": 680, "start": 4789.6, "end": 4794.52, "text": "für, das nennen wir übrigens nicht Handle Root. Handle Root wäre ein ziemlich blöder"}, {"id": 681, "start": 4794.52, "end": 4799.48, "text": "Name dafür. Das nennen wir Handle Update, weil wir den Update hochpushen und wir machen"}, {"id": 682, "start": 4799.48, "end": 4808.84, "text": "den ganzen Klempel raus. So, yes. Handle Update. So, man könnte jetzt hier annehmen und das"}, {"id": 683, "start": 4808.84, "end": 4816.72, "text": "jetzt mal kompilieren, mal gucken, dass das funktioniert. Ja, funktioniert. Man könnte"}, {"id": 684, "start": 4816.72, "end": 4821.72, "text": "jetzt hier annehmen und wahrscheinlich, dank der Macht des QChat, funktioniert wahrscheinlich"}, {"id": 685, "start": 4821.72, "end": 4824.96, "text": "das auch, aber ich hab's gestern probiert mit einer Websocket-Verbindung, da hat es"}, {"id": 686, "start": 4824.96, "end": 4828.24, "text": "nicht funktioniert, weil ich zu doof war, die richtige Syntax zu finden, wahrscheinlich."}, {"id": 687, "start": 4828.24, "end": 4837.68, "text": "Man könnte jetzt davon ausgehen, es würde sich hier anbieten, wenn man was Kleines,"}, {"id": 688, "start": 4837.68, "end": 4843.32, "text": "hier einen kleinen Funktionsaufruf programmieren will, der nur ein paar Zeilen lang ist, dann"}, {"id": 689, "start": 4843.32, "end": 4847.28, "text": "würde es sich anbieten, das über einen Lambda-Aufruf zu machen, würde man denken, weil das hat"}, {"id": 690, "start": 4847.28, "end": 4853.0, "text": "der C++ mittlerweile. Also sprich, dass wir nicht eine extra Funktion hier oben definieren,"}, {"id": 691, "start": 4853.0, "end": 4857.48, "text": "die aufgerufen wird, wenn einer einen Postrequest auf diese Uhr macht, sondern ein Lambda-Request"}, {"id": 692, "start": 4857.48, "end": 4862.52, "text": "und ich hab's gestern mit Websocket-Verbindung versucht, das hat uns verrecken nicht funktioniert."}, {"id": 693, "start": 4862.52, "end": 4872.68, "text": "Mal gucken, ob das jetzt funktioniert. So, anscheinend, anscheinend ist das eben eine"}, {"id": 694, "start": 4872.68, "end": 4876.96, "text": "Websocket-Problem. Gut, das würde funktionieren, aber wir machen es trotzdem mit einer eigenen"}, {"id": 695, "start": 4876.96, "end": 4885.68, "text": "Funktion. C++ Pros, wofür ist das und hier davor? Weil das geht mit und und ohne und."}, {"id": 696, "start": 4885.68, "end": 4894.36, "text": "Wo ist da der Unterschied? Warum geht das mit und ohne und, was bedeutet das und überhaupt?"}, {"id": 697, "start": 4894.36, "end": 4901.28, "text": "An der Stelle. Es kann keine Adresse, es kann keine, es kann ja keine, keine Referenz sein"}, {"id": 698, "start": 4901.28, "end": 4909.28, "text": "an der Stelle. Oder doch, oder nicht? Was ist das und an der Stelle? Ich verstehe, C++"}, {"id": 699, "start": 4909.28, "end": 4916.0, "text": "leuchtet mir an manchen Sachen einfach nicht ein. Wie kommst du immer auf die Musik? Ich"}, {"id": 700, "start": 4916.0, "end": 4924.36, "text": "hab ne Playlist mit tausend besten Nintendo-Songs. Aber ich glaub nicht, dass das an der Stelle"}, {"id": 701, "start": 4924.36, "end": 4929.0, "text": "hier ne Referenz ist zu dieser komischen Funktion, weil warum geht es mit und und ohne und?"}, {"id": 702, "start": 4929.0, "end": 4939.08, "text": "Was hat Max überhaupt vor? Ich will meine Microcontroller über WLAN mit neuer Firmware"}, {"id": 703, "start": 4939.08, "end": 4944.36, "text": "updaten können und das Ganze über HTTPS. Und ich hab mir wieder so ein Thema rausgesucht,"}, {"id": 704, "start": 4944.36, "end": 4948.2, "text": "was vor mir anscheinend noch keiner gemacht hat. Und wohlgemerkt nicht einfach die Firmware"}, {"id": 705, "start": 4948.2, "end": 4953.88, "text": "abrufen, sondern die Firmware pushen zum Controller. Und es gibt einfach nix Fertiges und es gibt"}, {"id": 706, "start": 4953.88, "end": 4957.4, "text": "keinen, der das gemacht hat vorher. Ich weiß auch nicht, warum ich immer so komische, so"}, {"id": 707, "start": 4957.4, "end": 4970.08, "text": "komische Dinge mir aussuche. So, ähm, jetzt müssen wir noch dem Server sagen, dass er"}, {"id": 708, "start": 4970.08, "end": 4976.96, "text": "auch unter slash update das Ganze verwenden soll. Das nennen wir das Ganze nennen wir"}, {"id": 709, "start": 4976.96, "end": 4984.04, "text": "nicht Node, das nennen wir Update-Node. So. Und wenn ich das jetzt hoch lade, dann sollte"}, {"id": 710, "start": 4984.04, "end": 4988.32, "text": "ich mit Curl schon mal drauf zugreifen können. Und da sehen wir schon das erste Problem dieser"}, {"id": 711, "start": 4988.32, "end": 4994.72, "text": "Library. Und zwar, dass sie endlos schleifen, fabriziert, die ich nicht außer einem ESP"}, {"id": 712, "start": 4994.72, "end": 5010.64, "text": "neustart beheben kann. Werdet ihr gleich sehen. Zeig euch gleich. Über HTTPS, äh, ein Dodo,"}, {"id": 713, "start": 5010.64, "end": 5024.52, "text": "über HTTPS ist es relativ einfach. Äh, Secure Server Loop müssen wir noch. Hallo? Ok. Warum"}, {"id": 714, "start": 5024.52, "end": 5033.56, "text": "ist das jetzt denn? Ah, weil da Pointer. Dann sind die Beispiele komisch. Man macht"}, {"id": 715, "start": 5033.56, "end": 5039.32, "text": "das mit Pointer, man macht das hier als Referenz und man macht das als globale Variable. Ok,"}, {"id": 716, "start": 5039.32, "end": 5045.72, "text": "das ist auch wurscht. Ähm, machen wir das so. Hochladen. So, und dann greifen wir mit"}, {"id": 717, "start": 5045.72, "end": 5052.32, "text": "nem Curl drauf zu. Curl auf OE. Warte mal, was hat das Ding? Äh, welcher IP hat's gekriegt?"}, {"id": 718, "start": 5052.32, "end": 5059.44, "text": "Ich hab's gar nicht geguckt. Mal kurz mal schauen, was das Ding für ne IP kriegt. Ja,"}, {"id": 719, "start": 5059.44, "end": 5065.72, "text": "das ist, das ist in C++ nicht immer so einfach. Und ist nicht immer Adresse. Zum Beispiel"}, {"id": 720, "start": 5065.72, "end": 5077.2, "text": "hier ist das und was anderes. Die mögen in C++ doppelte, doppelte Bedeutung von Dingern."}, {"id": 721, "start": 5077.2, "end": 5086.12, "text": "Oh ne, äh, ja, Adresse. Die sind eben Meister in doppelten, doppelte, doppeldeutigen Sachen"}, {"id": 722, "start": 5086.12, "end": 5090.64, "text": "in C++. Ok, jetzt versuchen wir mal unsere Firmware hochzuladen. Ich mein, die wird nicht"}, {"id": 723, "start": 5090.64, "end": 5096.28, "text": "funktionieren, aber, ähm, dass ihr mal seht, was passiert, wenn man's probiert. Also, wir"}, {"id": 724, "start": 5096.28, "end": 5101.36, "text": "machen jetzt den Curl und zwar ignorieren wir mal alle Zertifikate und rufen einfach"}, {"id": 725, "start": 5101.36, "end": 5108.16, "text": "nur mal die, die Adresse auf. Gut. Sagt der New Connection. Funktioniert nicht, weil es"}, {"id": 726, "start": 5108.16, "end": 5113.92, "text": "ist ja kein Post. Also sagen wir ihm, wir wollen das mit, als Post machen. Ich hab's"}, {"id": 727, "start": 5113.92, "end": 5126.68, "text": "ja hier als HTTP Post registriert. Ah, funktioniert auch. So, und wenn wir da jetzt was hochladen"}, {"id": 728, "start": 5126.68, "end": 5135.72, "text": "und zwar mit, äh, Binary, äh, Data, Binary. Genau, und jetzt laden wir mal unsere Firmware"}, {"id": 729, "start": 5135.72, "end": 5151.0, "text": "hoch. Ich glaub, Add, oder? Oh ne, äh. Curl. Ja, wo ist unsere Firmware? Build. Firmware"}, {"id": 730, "start": 5151.0, "end": 5165.16, "text": "bin. Pst, ich bin mir nicht sicher, ob ich ein Add davor machen muss. So, ähm. Was"}, {"id": 731, "start": 5165.16, "end": 5178.16, "text": "ein Add. Ah, jetzt, jetzt funktioniert der Upload, genau. So, und jetzt seht ihr schon"}, {"id": 732, "start": 5178.16, "end": 5182.28, "text": "ein Problem. Wenn ich das jetzt abbreche, was ja durchaus mal sein kann, dass ich den"}, {"id": 733, "start": 5182.28, "end": 5185.8, "text": "Upload abbrechen will, dann wird das Ding jetzt gleich in der Endlosschleife hängen"}, {"id": 734, "start": 5185.8, "end": 5193.92, "text": "bleiben. Gegen die ich nichts tun kann. Weil das irgendwie diese komische Web-Server-Library"}, {"id": 735, "start": 5193.92, "end": 5199.0, "text": "äh, intern macht. Das Einzige, was ich an der Stelle machen kann, ist, ich hab alles"}, {"id": 736, "start": 5199.0, "end": 5203.12, "text": "ausprobiert, Leute. Ich hab heute Morgen zwei Stunden daran rumgedockt, ich habe keinen"}, {"id": 737, "start": 5203.12, "end": 5210.64, "text": "Weg gefunden, dem Ding zu sagen, Scheiß auf die, was juckt ihn überhaupt, Connections,"}, {"id": 738, "start": 5210.64, "end": 5215.4, "text": "die geschlossen wurden. Ich habe dazu keine Lösung gefunden. Ich hab sogar auf GitHub"}, {"id": 739, "start": 5215.4, "end": 5220.32, "text": "geguckt, das haben andere Leute über diesen Fehler berichtet und gibt kein Ergebnis zu."}, {"id": 740, "start": 5220.32, "end": 5224.32, "text": "Das ist natürlich was, das ist komplett für'n Arsch und kann man auf gar keinen Fall so"}, {"id": 741, "start": 5224.32, "end": 5229.08, "text": "verwenden. Weil, wenn du mal ein Update pusht, ja, übrigens der Server ist jetzt auch kaputt,"}, {"id": 742, "start": 5229.08, "end": 5233.12, "text": "da geht jetzt, da geht das nicht mehr, ne. Der ist jetzt, der ist jetzt hinüber. Der"}, {"id": 743, "start": 5233.12, "end": 5237.04, "text": "muss ich jetzt neu starten. Also ne ganz schlechte Situation für ne Sache, die irgendwo in der"}, {"id": 744, "start": 5237.04, "end": 5242.48, "text": "Wand steckt, die ich nicht einfach so neu starten kann. Also sprich, wenn ich, wenn"}, {"id": 745, "start": 5242.48, "end": 5248.96, "text": "ich den Upload cancel, dann gehts kaputt. Das ist schon mal absoluter Fail. Keine Ahnung,"}, {"id": 746, "start": 5248.96, "end": 5253.56, "text": "was sie da zurecht programmiert haben. Und ihr seht, ich mache noch nichts. Also es kann,"}, {"id": 747, "start": 5253.56, "end": 5266.44, "text": "es kann gar nicht an mir liegen, weil mein Handle-Funktionier ist komplett leer. So,"}, {"id": 748, "start": 5266.44, "end": 5269.96, "text": "das ist das erste Problem, was ich mit der Library hatte. Dass die Endlosschleifen fabriziert"}, {"id": 749, "start": 5269.96, "end": 5276.4, "text": "gegen die ich nichts machen kann. Deswegen habe ich mir gedacht, wir machen Monka Big"}, {"id": 750, "start": 5276.4, "end": 5282.8, "text": "Brain Lösung. Und zwar, ich zeig euch jetzt mal die Big Brain Lösung. Und zwar, machen"}, {"id": 751, "start": 5282.8, "end": 5290.48, "text": "wir jetzt ne Schleife. Und wir starten den ESP einfach neu, wenn der Web-Server hängt."}, {"id": 752, "start": 5290.48, "end": 5295.68, "text": "Es ist zwar ne mega hässliche Lösung, aber sie funktioniert. Das heißt, sollte der Web-Server"}, {"id": 753, "start": 5295.68, "end": 5305.84, "text": "hängen, starten wir den ESP neu. Wenn ihr ne bessere Idee habt, schießt los, ja. So"}, {"id": 754, "start": 5305.84, "end": 5312.0, "text": "und was ich da rausgekriegt habe, wie man jetzt lesen kann, was man hier, also was das"}, {"id": 755, "start": 5312.0, "end": 5319.8, "text": "Curl macht hier ist folgendes, minus K ignoriert das Server-Zertifikat. Weil mein Server-Zertifikat"}, {"id": 756, "start": 5319.8, "end": 5326.76, "text": "ist natürlich nicht gültig. Weder das hier noch meine Organisation KeckW und die Zertifizierungsstelle"}, {"id": 757, "start": 5326.76, "end": 5331.56, "text": "ist nicht gültig. Also Curl wird auf jeden Fall meckern, Zertifikat ist ungültig. So,"}, {"id": 758, "start": 5331.56, "end": 5336.64, "text": "das macht minus K insecure. X sagt, die Methode, die er verwenden soll, sich zum Server zu"}, {"id": 759, "start": 5336.64, "end": 5340.12, "text": "verbinden, das ist ein Postrequest. Das ist kein Get-Request, wie man hier sieht, hab"}, {"id": 760, "start": 5340.12, "end": 5346.48, "text": "ich auch eingestellt. Das Update ist quasi geroutet nur für Hostrequests. Hat der Controller"}, {"id": 761, "start": 5346.48, "end": 5362.32, "text": "einen Watchdog Timer? Ähm, ja. Ja, aber der schlägt nicht zu an der Stelle. Oder ich"}, {"id": 762, "start": 5362.32, "end": 5369.68, "text": "müsste den irgendwie von Hand reinbauen oder so. Den hab ich aber noch nie gemacht. Der"}, {"id": 763, "start": 5369.68, "end": 5377.4, "text": "schlägt nicht zu, weil die Main-Loop läuft weiter. Das juckt dir nicht. Aber das könnte"}, {"id": 764, "start": 5377.4, "end": 5382.48, "text": "ich machen, irgendeinen Timeout setzen. Irgendeinen Timeout setzen und wenn es bis dahin nicht"}, {"id": 765, "start": 5382.48, "end": 5390.28, "text": "resettet ist, dann starte neu. Irgendwie sowas. Ähm, aber ich zeig euch jetzt mal, was ich"}, {"id": 766, "start": 5390.28, "end": 5396.96, "text": "mir überlegt hab. Zumindest, er geht auf diese Uhr und postet dann unsere Firmware, unser"}, {"id": 767, "start": 5396.96, "end": 5404.32, "text": "Firmware-Binary, postet er, also schickt er an den Web-Server vom Controller. So, und"}, {"id": 768, "start": 5404.32, "end": 5407.24, "text": "deswegen hab ich überlegt, was wir machen können. Das hab ich im Vorfeld natürlich"}, {"id": 769, "start": 5407.24, "end": 5411.2, "text": "schon mal ausprobiert. Sonst wäre das hier komplett hereinfallen. Und zwar, man kann"}, {"id": 770, "start": 5411.2, "end": 5419.12, "text": "gucken, ist Request complete? Das heißt, wir machen jetzt in meinem Händler in die"}, {"id": 771, "start": 5419.12, "end": 5424.68, "text": "Funktion mal eine Schleife rein, die so lange läuft, bis ich diesen kompletten Request"}, {"id": 772, "start": 5424.68, "end": 5430.8, "text": "eingelesen hab. Also quasi alles, bis ich alles eingelesen hab. So, und, ähm, jetzt"}, {"id": 773, "start": 5430.8, "end": 5439.6, "text": "muss ich grad mal gucken, an welcher Stelle ich das hier mache. Genau, und jetzt lesen"}, {"id": 774, "start": 5439.6, "end": 5444.4, "text": "wir erstmal den Request ein. Dazu brauchen wir einen Array mit, der war irgendwie mal"}, {"id": 775, "start": 5444.4, "end": 5456.4, "text": "ein Buffer mit, ähm, keine Ahnung, 512 Bytes. Request, Read. Und zwar readen wir jetzt,"}, {"id": 776, "start": 5456.4, "end": 5463.0, "text": "size, in den Buffer, also sprich, wir lesen jetzt das hier ein, on the fly, was wir hier"}, {"id": 777, "start": 5463.0, "end": 5481.24, "text": "hoch uploaden gerade. So, äh, also read Bytes in den Buffer, äh, mit der Länge 512. Also,"}, {"id": 778, "start": 5481.24, "end": 5489.12, "text": "wir lesen so viele Bytes ein, wie in unseren Buffer reinpassen. So, äh, was wir jetzt"}, {"id": 779, "start": 5489.12, "end": 5493.2, "text": "auch sehen werden ist, dass es, ich zeige euch mal, dass es prinzipiell funktioniert."}, {"id": 780, "start": 5493.2, "end": 5499.44, "text": "Wir lassen uns jetzt mal hier ausgeben, die, ähm, Request, Konter, also die Länge, die"}, {"id": 781, "start": 5499.44, "end": 5502.56, "text": "noch drinnen ist in dem Buffer, und ihr werdet sehen, dass es bei jedem Durchlauf, wird das"}, {"id": 782, "start": 5502.56, "end": 5507.36, "text": "weniger. Und jetzt, ich machte, ich führte es jetzt erstmal aus, danach zeige ich euch"}, {"id": 783, "start": 5507.36, "end": 5513.04, "text": "mal den Trick, den ich mir überlegt hab, was wir machen können. Aber erstmal uploaden"}, {"id": 784, "start": 5513.04, "end": 5520.36, "text": "wir das Teil. Oh, im Chat, man, big brain Sachen. Ähm, schreibe das ganze mit Python, lösen"}, {"id": 785, "start": 5520.36, "end": 5526.6, "text": "sich viele da, nee, nee, nee, in dem Fall nicht. Hab ich mir kurzzeitig überlegt, heute"}, {"id": 786, "start": 5526.6, "end": 5533.88, "text": "Morgen, ob ich das machen soll. Erstens, findest du auch wenig zu, ähm, MicroPython, ESP32"}, {"id": 787, "start": 5533.88, "end": 5539.92, "text": "mit SSL-Unterstützung. Scheint wohl zu gehen, aber wo es komplett aufhört, ist, äh, ESP32,"}, {"id": 788, "start": 5539.92, "end": 5545.32, "text": "SSL und Secure Websockets in Python. Da schaffst du eine Verbindung und danach stürzt das Ding"}, {"id": 789, "start": 5545.32, "end": 5550.08, "text": "mit Out of Memory ab, hab ich auf GitHub gefunden. Dazu kommt, dass du aus MicroPython die ganzen"}, {"id": 790, "start": 5550.08, "end": 5554.04, "text": "C-Libraries nicht verwenden kannst, die du für irgendwelche Sensoren und Hardware brauchst."}, {"id": 791, "start": 5554.04, "end": 5565.76, "text": "Du musst halt hoffen, dass es welche dafür gibt. So, ähm, ich lade jetzt mal was hoch"}, {"id": 792, "start": 5565.76, "end": 5571.52, "text": "und dann werdet ihr sehen, der Upload an sich funktioniert. Guckt die, seht ihr, die Content-Länge"}, {"id": 793, "start": 5571.52, "end": 5580.32, "text": "wird immer weniger. Also sprich, der Uploadet hier und ich zeig euch jetzt mal den krassen,"}, {"id": 794, "start": 5580.32, "end": 5587.68, "text": "den, den, den Über-Curl-Hack, den, den keiner kennt. Hier habt ihr, hier habt ihr ihn zuerst"}, {"id": 795, "start": 5587.68, "end": 5592.84, "text": "gesehen, Leute. Jetzt zeig ich euch, er war übrigens fertig mit Uploaden. Pass mal auf,"}, {"id": 796, "start": 5592.84, "end": 5600.26, "text": "den über-krassen Curl-Hack. Wisst ihr, dass ihr bei Curl angeben könnt? Procress, Procress"}, {"id": 797, "start": 5600.26, "end": 5606.32, "text": "Bar und dann passiert nichts, wenn ihr das angibt. Ist euch vielleicht auch schon mal"}, {"id": 798, "start": 5606.32, "end": 5613.72, "text": "aufgefallen, dass die Procress Bar bei Curl nicht funktioniert? Guckt, die Procress Bar"}, {"id": 799, "start": 5613.72, "end": 5617.6, "text": "funktioniert nicht. Und jetzt zeig ich euch, was ihr machen müsst, dass die Procress Bar"}, {"id": 800, "start": 5617.6, "end": 5624.44, "text": "funktioniert. Übrigens, ich kann jetzt nicht abbrechen, wenn ich jetzt abbreche, hänge"}, {"id": 801, "start": 5624.44, "end": 5628.6, "text": "ich wieder Endlosschleife drinnen. So, und jetzt zeig ich euch, jetzt zeig ich euch"}, {"id": 802, "start": 5628.6, "end": 5639.8, "text": "mit Tricks 17. Ihr müsst das ganze pipen nach Def Null und schon habt ihr eine Procress"}, {"id": 803, "start": 5639.8, "end": 5650.44, "text": "Bar. Wieso? Ganz hundertprozentig habe ich es auch nicht verstanden. Anscheinend ist"}, {"id": 804, "start": 5650.44, "end": 5658.36, "text": "es so, dass Curl den Standard Out benutzt für Response vom Server. Und quasi Response"}, {"id": 805, "start": 5658.36, "end": 5663.8, "text": "vom Server irgendwie mit der Procress Bar konkurriert. Und wenn ich das ganze, also"}, {"id": 806, "start": 5663.8, "end": 5670.28, "text": "T-Splitter das ganze Jahr in der Datei und Standard Out, und wenn ich den Standard Out"}, {"id": 807, "start": 5670.28, "end": 5678.4, "text": "dann umleite nach Def Null und Curl irgendwie denkt, und Curl irgendwie denkt, ich habe,"}, {"id": 808, "start": 5678.4, "end": 5684.96, "text": "ich möchte den Standard Out vom Server Response nicht haben, dann zeigt er, dann zeigt er"}, {"id": 809, "start": 5684.96, "end": 5689.24, "text": "die Procress Bar an. Ich weiß auch nicht, wer sich das wieder überlegt hat. Das ist"}, {"id": 810, "start": 5689.24, "end": 5696.4, "text": "Matt, also eigentlich ist das nicht Big Brain, das ist ziemlich, ziemlich Low Brain von Curl"}, {"id": 811, "start": 5696.4, "end": 5701.92, "text": "Entwicklern. Man kann es den Leuten auch einfacher machen. Aber wenn ihr bei Curl eine Procress"}, {"id": 812, "start": 5701.92, "end": 5707.08, "text": "Bar haben wollt, dann müsst ihr es nach T-pipen und das T als Datei in die gesplittet wird"}, {"id": 813, "start": 5707.08, "end": 5719.8, "text": "Def Null. Dann macht Curl eine Procress Bar. Six header. Ok, so. Und jetzt zeige ich euch"}, {"id": 814, "start": 5719.8, "end": 5723.04, "text": "mal den Trick, den ich mir überlegt habe, was wir machen können, dass das System nicht"}, {"id": 815, "start": 5723.04, "end": 5737.8, "text": "mehr in der Endlosschleife hängen bleibt. So, und zwar, ja. So, und zwar was wir machen"}, {"id": 816, "start": 5737.8, "end": 5746.76, "text": "ist, wir speichern uns, also sprich wir merken uns, wie viele Bites wir schon eingelesen"}, {"id": 817, "start": 5746.76, "end": 5753.48, "text": "haben. Also sprich, da sagen wir hier File Length plus gleich S. Also sprich in S oder"}, {"id": 818, "start": 5753.48, "end": 5757.4, "text": "nennen wir es mal, man könnte es auch Size nennen oder ich könnte es auch direkt da"}, {"id": 819, "start": 5757.4, "end": 5761.24, "text": "reinschreiben lassen. Das ist wahrscheinlich eher C-Style, dass es ein bisschen kryptischer"}, {"id": 820, "start": 5761.24, "end": 5767.76, "text": "aussieht, noch alles. Was der jetzt macht ist, der liest quasi von dem, was ich uploade"}, {"id": 821, "start": 5767.76, "end": 5774.12, "text": "in diesen Buffer und die Funktion gibt die Menge der gelesenen Bites zurück. Das heißt"}, {"id": 822, "start": 5774.12, "end": 5778.06, "text": "in File Length haben wir quasi nach jedem Durchlauf dieser Schleife drinne stehen, wie"}, {"id": 823, "start": 5778.06, "end": 5783.76, "text": "viele Sachen wir eingelesen haben. Laut Stack Overflow würde sogar Curl Procress Barket"}, {"id": 824, "start": 5783.76, "end": 5790.72, "text": "ausreichen. Aha, können wir gleich mal ausprobieren. So, und was wir jetzt machen ist, einmal,"}, {"id": 825, "start": 5790.72, "end": 5793.88, "text": "hier drinne werden wir unsere Firmware updaten, also sprich, wir brauchen es übrigens doch"}, {"id": 826, "start": 5793.88, "end": 5810.72, "text": "als eigene Variable. So, wenn wir was eingelesen haben, dann machen wir hier Firmware to Flash,"}, {"id": 827, "start": 5810.72, "end": 5817.24, "text": "dann speichern wir das neue Zeug auf dem internen Flash Speicher. Weil wenn wir was eingelesen"}, {"id": 828, "start": 5817.24, "end": 5820.28, "text": "haben, möchten wir es ja speichern, dass wir Rebooten können und die neue Firmware ist"}, {"id": 829, "start": 5820.28, "end": 5830.04, "text": "da. So, und was wir jetzt aber machen, jetzt kommt mal, was sehr eklig ist, wieso nicht"}, {"id": 830, "start": 5830.04, "end": 5837.68, "text": "File Length größer Null, das wirst du gleich sehen. Weil File Length ja nach dem ersten"}, {"id": 831, "start": 5837.68, "end": 5843.24, "text": "Durchlauf immer größer Null ist. Und es bei jedem Durchlauf neu gesetzt wird und was"}, {"id": 832, "start": 5843.24, "end": 5847.76, "text": "wir jetzt machen ist, aber der Patrick ist da schon auf dem richtigen Weg, jetzt gucken"}, {"id": 833, "start": 5847.76, "end": 5862.0, "text": "wir, lsif, wenn File Length größer Null ist, und dann bedeutet das nämlich, in dem"}, {"id": 834, "start": 5862.0, "end": 5871.2, "text": "Fall, s ist nicht größer Null, das heißt, wir wechseln in diesen lsif rein. Also sprich,"}, {"id": 835, "start": 5871.2, "end": 5877.92, "text": "wenn wir in diesem lsif ankommen, bedeutet das, s ist kleiner gleich Null. Also Null in"}, {"id": 836, "start": 5877.92, "end": 5883.6, "text": "dem Fall, weil er kann nicht negativ lesen. So, und das heißt, wenn wir jetzt hier haben,"}, {"id": 837, "start": 5883.6, "end": 5887.36, "text": "also in dem Fall, ich schreib's mal aus, s gleich gleich Null ist es in dem Fall, das"}, {"id": 838, "start": 5887.36, "end": 5892.52, "text": "ist aber impliziert schon, weil sonst würden wir hier gar nicht ankommen. Aber ich schon"}, {"id": 839, "start": 5892.52, "end": 5901.88, "text": "was eingelesen habe, dann bedeutet das, der Client hat abgebrochen. Es könnte natürlich"}, {"id": 840, "start": 5901.88, "end": 5906.24, "text": "auch bedeuten, mein Client ist einfach unglaublich langsam, aber dann hab ich nen Bug drinnen."}, {"id": 841, "start": 5906.24, "end": 5913.96, "text": "So, und in dem Fall, wenn das hier zusammen eintritt, dann würde das nämlich bedeuten,"}, {"id": 842, "start": 5913.96, "end": 5918.68, "text": "mein Server bleibt in der Endlosschleife hängen. Und deswegen machen wir an dieser Stelle einfach"}, {"id": 843, "start": 5918.68, "end": 5932.76, "text": "die Holzhammer-Methode und restarten den ESP. Ist das nicht ne schöne Lösung? So, jetzt"}, {"id": 844, "start": 5932.76, "end": 5944.24, "text": "gucken wir mal, ob der ganze Kram funktioniert. Big Brain-Lösung, Big Brain-Time, Alter."}, {"id": 845, "start": 5944.24, "end": 5947.84, "text": "Das ist übel, ich kann nix dagegen machen, dass das Ding Endlosschleife produziert. Ich"}, {"id": 846, "start": 5947.84, "end": 5955.72, "text": "könnte jetzt die Library downloaden, als es geht, klonen hier nach lib rein und versuchen"}, {"id": 847, "start": 5955.72, "end": 5962.6, "text": "den Fehler bei dem zu fixen, aber hab ich ehrlich gesagt gar keinen Bock drauf. So,"}, {"id": 848, "start": 5962.6, "end": 5974.24, "text": "und jetzt passt mal auf, was passiert. Jetzt starte ich den Upload. Upload. Server restarten,"}, {"id": 849, "start": 5974.24, "end": 5978.44, "text": "das sag ich gleich mal zu. Upload, so, jetzt brech ich ab und jetzt kackt der Server ab"}, {"id": 850, "start": 5978.44, "end": 5988.12, "text": "und BAM, ESP startet sich neu. Funktioniert und geht wieder von vorne los, sehr schön."}, {"id": 851, "start": 5988.12, "end": 5996.84, "text": "Funktioniert. Server neu starten geht nicht, weil, wenn man sagt, also ich hab's ausprobiert."}, {"id": 852, "start": 5996.84, "end": 6006.24, "text": "Server. Ich kann's noch mal machen, vielleicht geht. What the fuck. Mein Visual Studio Code"}, {"id": 853, "start": 6006.24, "end": 6023.08, "text": "hat sich grad beendet. Java-Script in 2020. Java-Script in 2020. Ich mein, wir können"}, {"id": 854, "start": 6023.08, "end": 6029.84, "text": "das mal ausprobieren. Anstatt, anstatt hier neu zu starten, mach ich mal, Secure Server"}, {"id": 855, "start": 6029.84, "end": 6040.88, "text": "stopp. Hallo, ah nee, stopp und Secure Server start. Also, ich hab das nämlich schon ausprobiert"}, {"id": 856, "start": 6040.88, "end": 6050.48, "text": "und das Phänomen, was ich dann hatte, ist, dass, ähm, der hier blockt und meine Main"}, {"id": 857, "start": 6050.48, "end": 6058.04, "text": "Loop gar nicht mehr läuft. Also sprich, der Server ist nicht stopp- und startbar, der geht"}, {"id": 858, "start": 6058.04, "end": 6069.28, "text": "dann kaputt. Was natürlich auch für die herausragende Qualität dieser Library spricht. Dass es"}, {"id": 859, "start": 6069.28, "end": 6075.96, "text": "eine stopp- und startfunktion gibt, die aber nicht funktioniert. Controller willst du"}, {"id": 860, "start": 6075.96, "end": 6100.96, "text": "nicht uploaden? Controller willst du nicht uploaden? Ach, wie wär's? Press F. So, ähm,"}, {"id": 861, "start": 6100.96, "end": 6105.96, "text": "ich zieh mal raus. Machen wir da rein. Nee, also Patrick, ich hab das vorher mehr an unterschiedlichsten,"}, {"id": 862, "start": 6105.96, "end": 6110.72, "text": "ähm, ich hab das vorher an unterschiedlichen Sachen ausprobiert. Ich hab auch ein extra"}, {"id": 863, "start": 6110.72, "end": 6115.8, "text": "Task aufgemacht und hab das Handling von Server starten, stoppen, äh, quasi gemacht, nachdem"}, {"id": 864, "start": 6115.8, "end": 6121.0, "text": "ich aus der Funktion raus bin, in einem extra, in einem extra Thread noch mal. Und ich hab"}, {"id": 865, "start": 6121.0, "end": 6128.96, "text": "vorher extra in der, in der Main Schleife gesagt, wenn ich grad in der Fehlerbahn bin,"}, {"id": 866, "start": 6128.96, "end": 6132.32, "text": "dann nicht ausführen. Also, es hat nicht, es hat nicht funktioniert. Aber wir können"}, {"id": 867, "start": 6132.32, "end": 6135.68, "text": "ja mal gucken, vielleicht kriegen wir, vielleicht kriegen wir es jetzt ja gebacken. Also so funktioniert"}, {"id": 868, "start": 6135.68, "end": 6139.96, "text": "es definitiv nicht. Das hab ich nämlich schon ausprobiert. Guck, wenn ich jetzt hier was"}, {"id": 869, "start": 6139.96, "end": 6167.12, "text": "uploade, lass mal warten, bis der anfängt. Upload läuft, sprech ich ab und... What? Der,"}, {"id": 870, "start": 6167.12, "end": 6170.16, "text": "der startet, stoppt jetzt die ganze Zeit den Server und das juckt den überhaupt nicht."}, {"id": 871, "start": 6170.16, "end": 6173.08, "text": "Das war jetzt natürlich ziemlich bescheuert, weil ich hätte hier nochmal sagen müssen,"}, {"id": 872, "start": 6173.08, "end": 6178.04, "text": "return. Ähm, ja, abbrechen müsste ich das Ganze auch schon. Oder, oder was heißt return,"}, {"id": 873, "start": 6178.04, "end": 6187.92, "text": "wir können auch einfach sagen, break, haben wir das gleiche raus. Also Patrick, ich hab's"}, {"id": 874, "start": 6187.92, "end": 6193.16, "text": "vorher ausprobiert, der blockt irgendwie komplett. Aber vielleicht kriegen wir es ja hin. Machen"}, {"id": 875, "start": 6193.16, "end": 6203.12, "text": "wir noch kurz Zeit. Und wisst ihr, was das geile ist? Ähm, ich muss morgen nicht aufstehen"}, {"id": 876, "start": 6203.12, "end": 6215.12, "text": "früh, ich kann wieder Homeoffice machen. So, äh, ein Command für die Playlist, könnte"}, {"id": 877, "start": 6215.12, "end": 6220.0, "text": "man machen. Äh, mach so einen Check, ob die Daten, die ankommen, auch wirklich valid sind."}, {"id": 878, "start": 6220.0, "end": 6225.2, "text": "Ja, es ist, es ist eine TCP-Verbindung, also ich würde mal sagen, dass übertragungsmäßig"}, {"id": 879, "start": 6225.2, "end": 6229.2, "text": "sollte nichts kaputt gehen. Aber ja, du hast recht, man sollte, man sollte eigentlich nochmal"}, {"id": 880, "start": 6229.2, "end": 6242.64, "text": "ne Check-Summe machen. Das wäre, das schreib ich immer als To-Do auf. So, guckt und jetzt"}, {"id": 881, "start": 6242.64, "end": 6251.2, "text": "hängt, hängt meine Main-Loop. Geht nichts mehr. Nach Start, Stop vom Server. Und wenn"}, {"id": 882, "start": 6251.2, "end": 6255.24, "text": "ich dann nochmal versuche, was hochzuladen, ist Crash angesagt. Bam, in your face, kaputt."}, {"id": 883, "start": 6255.24, "end": 6259.56, "text": "Aber wir können, wir können es mal probieren, vielleicht kriegen wir, vielleicht kriegen"}, {"id": 884, "start": 6259.56, "end": 6265.32, "text": "wir es ja gebacken. Ähm, ok, da schreiben wir noch einen To-Do auf. Äh, was hab ich"}, {"id": 885, "start": 6265.32, "end": 6275.72, "text": "grad gesagt? Ja, Leute, mein Hirn. Äh, Check-Summe. Check-Summe. Gucken wir mal, was wir machen."}, {"id": 886, "start": 6275.72, "end": 6279.72, "text": "So, also das heißt, das, das, das funktioniert so an der, an der Stelle, an der, an der Stelle"}, {"id": 887, "start": 6279.72, "end": 6282.72, "text": "schon mal nicht. Was wir machen können ist, das hab ich vorher auch schon mal ausprobiert,"}, {"id": 888, "start": 6282.72, "end": 6290.8, "text": "wir können sowas hier mit dem Bool, keine Ahnung, Handle, Error, is false. So, dann"}, {"id": 889, "start": 6290.8, "end": 6302.68, "text": "können wir an der Stelle sagen, nicht Handle, nicht Handle, Error. Handler, Error. Handler-Error"}, {"id": 890, "start": 6302.68, "end": 6308.84, "text": "ist true. So, dann geht er raus. Dann gehen wir in unsere Main-Schleife rein und sagen"}, {"id": 891, "start": 6308.84, "end": 6312.6, "text": "hier, aber wie gesagt, ich hab's vorhin ausprobiert, das hat nicht funktioniert. Aber, weißt"}, {"id": 892, "start": 6312.6, "end": 6321.24, "text": "ihr nicht, die Macht des Qt-Chats ist, ist ja, ist ja heute, äh, kann viel ausrichten,"}, {"id": 893, "start": 6321.24, "end": 6333.64, "text": "ja. Also, if Handler-Error, dann, ähm, sagen wir, Secure, Secure-Server, Stop. Ups. Stop."}, {"id": 894, "start": 6333.64, "end": 6338.64, "text": "Da machen wir nochmal ein Delay rein. Ah, man weiß ja nie. Wir machen mal, wir machen"}, {"id": 895, "start": 6338.64, "end": 6342.2, "text": "mal ein Delay davor, ein Delay danach, man kann nicht genug delayen an der Stelle. Und"}, {"id": 896, "start": 6342.2, "end": 6356.08, "text": "dann ist aber Start. So, ähm, else, Handler-Error setzen wir wieder auf false. Und hier machen"}, {"id": 897, "start": 6356.08, "end": 6365.68, "text": "wir die Loop rein. So, Patrick, sowas in der Richtung meinste, ne? Ich mein, das ist zwar"}, {"id": 898, "start": 6365.68, "end": 6371.72, "text": "nicht so ganz so schön, ähm, weil wir das als nächsten Durchlauf machen, aber es sollte"}, {"id": 899, "start": 6371.72, "end": 6375.36, "text": "funktionieren. Aber ich hab's ausprobiert, funktioniert nicht. Aber vielleicht, vielleicht"}, {"id": 900, "start": 6375.36, "end": 6397.04, "text": "funktioniert's ja doch. Wir können's noch locken oder sowas. Denn der Händler sollte"}, {"id": 901, "start": 6397.04, "end": 6401.08, "text": "eigentlich aufgerufen werden, hier, wenn ich in der Loop drinnen bin. Weil, wozu, wozu"}, {"id": 902, "start": 6401.08, "end": 6411.68, "text": "muss ich's sonst machen? So, als Upload starten. Pointer, Pogger, sieben Monate, dankeschön."}, {"id": 903, "start": 6411.68, "end": 6431.16, "text": "Abbrechen. Bäm. Klein Closed. Und die Main Loop läuft nicht mehr. Also sprich, ähm,"}, {"id": 904, "start": 6431.16, "end": 6437.12, "text": "der hängt, der hängt, der ist hier noch drinnen, der ist mit der Loop noch gar nicht fertig."}, {"id": 905, "start": 6437.12, "end": 6444.08, "text": "Also, müsste man irgendwie, irgendwie einmal warten oder so, bis er mit der Loop raus ist."}, {"id": 906, "start": 6444.08, "end": 6447.16, "text": "Aber das kann ja eigentlich nicht sein. Der kann nicht in der Loop hängen, weil er ist"}, {"id": 907, "start": 6447.16, "end": 6452.64, "text": "hier, wenn er stoppen muss. Also, der stoppt, der stoppt ja nur, wenn Händler-Error ist."}, {"id": 908, "start": 6452.64, "end": 6458.28, "text": "Das heißt, er geht nie aus dieser Loop raus. Das ist total fail. Ähm, mach den trotzdem"}, {"id": 909, "start": 6458.28, "end": 6473.4, "text": "mal volatile. Was denn? Was soll ich volatile machen? Den Händlerror. Muss man das zuerst"}, {"id": 910, "start": 6473.4, "end": 6499.56, "text": "schrei-, äh, wie schreibt man das Wort? Ne, vor-, so. Macht man das zuerst? D-d-d-d-d-d-d-d-d-d-d."}, {"id": 911, "start": 6499.56, "end": 6506.52, "text": "Huge Upload Speed. Was ist denn volatile? Das krieg ich aus dem Kopf nicht genau hin."}, {"id": 912, "start": 6506.52, "end": 6510.76, "text": "Das ist irgendeine Compiler-Anweisung, dass er Dinger, Dinger nicht macht, die er normalerweise"}, {"id": 913, "start": 6510.76, "end": 6514.92, "text": "optimieren würde. Ich glaub, das ist, das ist, ich glaub, das ist, äh, Optimierung"}, {"id": 914, "start": 6514.92, "end": 6530.0, "text": "ausschalten. Ja, genau. Also, Patrick, der kennt sich damit aus. So. Upload läuft, zack."}, {"id": 915, "start": 6530.0, "end": 6537.0, "text": "Ah, Grip. Also, für'n Arsch. So. Das-, deswegen, so, so Dinger hab ich auch schon rumprobiert"}, {"id": 916, "start": 6537.0, "end": 6545.08, "text": "heute Morgen. Ähm, was ne Kack-Library. So meine Worte. Übelster Crap. Aber die einzige,"}, {"id": 917, "start": 6545.08, "end": 6552.44, "text": "die es gibt. Deswegen bin ich hier auf meinen Neustart gekommen. Ich gestehe, dass ich"}, {"id": 918, "start": 6552.44, "end": 6555.64, "text": "kaum was verstehe, aber trotzdem gern im Stream schimmel. Das ist schön, wenn du so"}, {"id": 919, "start": 6555.64, "end": 6559.04, "text": "gerne da bist. Wenn du willst, dass ich dir was erklär, äh, kann ich das jetzt erklären?"}, {"id": 920, "start": 6559.04, "end": 6563.8, "text": "Ich mein, ich kann jetzt nicht die komplette, äh, nicht vom ersten If an erklären, aber"}, {"id": 921, "start": 6563.8, "end": 6571.32, "text": "wenn du konkrete Fragen hast, schieß immer, immer los, schieße, ne? Kannst du nicht einfach"}, {"id": 922, "start": 6571.32, "end": 6575.52, "text": "im Restobjekt einen Statuscode setzen und damit aus der Funktion-, ich geh doch aus der Funktion"}, {"id": 923, "start": 6575.52, "end": 6587.24, "text": "raus. Hier, guck mal. Ich geh ja hier raus. Break und danach ist Schluss. Hier ist vorbei."}, {"id": 924, "start": 6587.24, "end": 6593.88, "text": "Also der, der geht nach Break raus. Ich mein, ich kann den Return machen, aber das dürfte"}, {"id": 925, "start": 6593.88, "end": 6605.32, "text": "jetzt keinen großen Unterschied machen. Ja. Aber in Rest ist nichts gesetzt. Das macht"}, {"id": 926, "start": 6605.32, "end": 6612.84, "text": "keinen Unterschied. Ähm, das macht keinen Unterschied. Das hab ich auch schon ausprobiert."}, {"id": 927, "start": 6612.84, "end": 6619.32, "text": "Aber wie gesagt, die Library ist busy, ähm, kaputt. Wir können aber ruhig noch ein bisschen"}, {"id": 928, "start": 6619.32, "end": 6624.04, "text": "rumprobieren das nächste Mal. Ähm, ich hab jetzt nicht mehr allzu viel Zeit. Wir können"}, {"id": 929, "start": 6624.04, "end": 6628.92, "text": "ruhig das nächste Mal rumprobieren, ob wir das irgendwie noch gebacken kriegen. Also"}, {"id": 930, "start": 6628.92, "end": 6632.68, "text": "ich bleib jetzt erstmal bei meiner Geschichte hier. Ich lass ihn jetzt erst mal restarten."}, {"id": 931, "start": 6632.68, "end": 6638.84, "text": "Einfach die Hardcore-Variante restart. Ich würd jetzt gerne noch mal ganz kurz probieren,"}, {"id": 932, "start": 6638.84, "end": 6642.48, "text": "ob der Sache, das Firmware-Update noch ein bisschen näher kommt. Und zwar, was er jetzt"}, {"id": 933, "start": 6642.48, "end": 6650.12, "text": "hier her macht ist, er liest ja das ein, was ich pushe zum Server. Und das heißt, an der"}, {"id": 934, "start": 6650.12, "end": 6655.72, "text": "Stelle kann ich meine Firmware schreiben. Ähm, am besten sollte ich natürlich danach zumindest"}, {"id": 935, "start": 6655.72, "end": 6659.36, "text": "noch mal oder on the fly in irgendeiner Form, wie auch immer ich das am besten mache, muss"}, {"id": 936, "start": 6659.36, "end": 6664.64, "text": "ich mir mal überlegen. Ähm, Check-Summe drüber machen. Aber wir scheißen jetzt mal auf Check-Summe."}, {"id": 937, "start": 6664.64, "end": 6668.88, "text": "Ja, ich mein, im Zweifelsfall, ich hab's per USB dran und ich kann's immer neu flashen."}, {"id": 938, "start": 6668.88, "end": 6672.92, "text": "Man kann's ja gar nicht komplett kaputt machen. Ich kann's ja nur kaputt machen, dass ich"}, {"id": 939, "start": 6672.92, "end": 6679.56, "text": "über WLAN nicht mehr flashen kann. So, hauen wir mal das Update-Header rein, wo man ESP32"}, {"id": 940, "start": 6679.56, "end": 6685.56, "text": "und ESP266 Updates mitmachen kann. Jancu300, schön, dass du da bist. Er schreibt, es ist"}, {"id": 941, "start": 6685.56, "end": 6688.76, "text": "so schön, deine Stimmen zu hören, Max. Kenne dich schon seit den ersten Tagen. Es ist nice,"}, {"id": 942, "start": 6688.76, "end": 6692.8, "text": "dass du den Weg in den Stream gefunden hast, auch wenn das hier in dem Stream natürlich"}, {"id": 943, "start": 6692.8, "end": 6707.2, "text": "was ganz anderes ist, als auf YouTube. So. Ähm. Mach das mal, Patrick, bester Mann. Such mal."}, {"id": 944, "start": 6707.2, "end": 6713.2, "text": "Aber die Library ist auch nicht schön programmiert, also du wirst Spaß haben. Ähm, gut. Also"}, {"id": 945, "start": 6713.2, "end": 6718.28, "text": "wenn man über WLAN ein Update auf dem ESP starten will, dann muss man als erstes erst"}, {"id": 946, "start": 6718.28, "end": 6725.52, "text": "mal sagen, Update, äh, Begin. UpdateBegin braucht eine Funktion, ist, äh, äh, braucht"}, {"id": 947, "start": 6725.52, "end": 6736.96, "text": "als Parameter, ähm, wie groß das Update ist. Dass es checken kann, ob es genug Platz hat."}, {"id": 948, "start": 6736.96, "end": 6745.4, "text": "Das heißt, man muss jetzt erst mal hier gucken, dass wir uns mal speichern, wie groß, wie"}, {"id": 949, "start": 6745.4, "end": 6751.28, "text": "groß meine, wie groß mein Update ist, also dass die Firmware, die ich hier hoch lade,"}, {"id": 950, "start": 6751.28, "end": 6757.32, "text": "wie groß die ist, das kriege ich ja aus Content-Length raus. Jetzt kann ich sagen, ok, wenn genug"}, {"id": 951, "start": 6757.32, "end": 6766.32, "text": "Platz ist auf deinem internen Flash, dann leg los. Ähm, das heißt, ich muss das jetzt"}, {"id": 952, "start": 6766.32, "end": 6789.6, "text": "natürlich noch überprüfen, sonst wäre das... Was hatte der jetzt für Schmerzen? Ah, yes,"}, {"id": 953, "start": 6789.6, "end": 6800.56, "text": "Visual Studio Code zeigt Blödsinn an. Äh, was programmierst du grad da? Äh, eine Möglichkeit,"}, {"id": 954, "start": 6800.56, "end": 6807.32, "text": "dass ich über WLAN eine neue Firmware auf meinen Microcontroller pushen kann. Ähm,"}, {"id": 955, "start": 6807.32, "end": 6815.2, "text": "über HTTPS. Pushen, nicht pullen. Warum Pointer statt Referenzen? Hä? Auf was beziehst du"}, {"id": 956, "start": 6815.2, "end": 6828.96, "text": "dich? In dem Fall ist ganz einfach, weil die Library das so haben will. Das ist ein ESP32,"}, {"id": 957, "start": 6828.96, "end": 6838.16, "text": "das ist ein ESP32, den ich hier grad hab. Ich hab so einen hier, am Start, dafür. Äh,"}, {"id": 958, "start": 6838.16, "end": 6841.76, "text": "Stein des Anstoßes, oder warum ich das jetzt mache, ist eigentlich das. Ich hab ja meine"}, {"id": 959, "start": 6841.76, "end": 6848.72, "text": "Klingel etwas smarter gemacht, mit einem ESP32, mit so einem, der steckt in der Gegensprechanlage"}, {"id": 960, "start": 6848.72, "end": 6856.0, "text": "in der Wand. Und die Update-Funktion, die ich da aktuell drauf hab, ist ein wenig fehleranfällig."}, {"id": 961, "start": 6856.0, "end": 6861.08, "text": "Ich hab's schon geschafft, das Ding... Da gibt's keine fertigen Lösungen für HTTPS,"}, {"id": 962, "start": 6861.08, "end": 6867.76, "text": "gibt's nicht. Ähm, für HTTPS ist es easy, mit HTTPS ist es schwierig, findste ganz wenig"}, {"id": 963, "start": 6867.76, "end": 6872.96, "text": "dagegen. Äh, findste ganz wenig dazu. Und ich hab' das hier in der Wand stecken und"}, {"id": 964, "start": 6872.96, "end": 6878.64, "text": "ich hab's ja schon mal geschafft, das Ding zu deadlocken, also über WLAN-Update. Bisschen"}, {"id": 965, "start": 6878.64, "end": 6884.16, "text": "verkackt. Deswegen wollte ich jetzt mal ne ordentliche WLAN-Update-Sache programmieren,"}, {"id": 966, "start": 6884.16, "end": 6887.6, "text": "dass ich auch meine Controller updaten kann, die in der Wand verbaucht sind, ohne dass ich"}, {"id": 967, "start": 6887.6, "end": 6894.92, "text": "Gefahr laufe, dass ich erstmal Strom ausschalten muss überall. So, also wir müssen jetzt gucken,"}, {"id": 968, "start": 6894.92, "end": 6906.44, "text": "ob genug Platz ist. So, wenn Update-Beginn nicht funktioniert, dann sagen wir Update-Print-Error"}, {"id": 969, "start": 6906.44, "end": 6913.24, "text": "auf unseren Debug-Ausgabe. Smart-Klingel. Ja, hab ich im letzten Stream erzählt, was"}, {"id": 970, "start": 6913.24, "end": 6917.56, "text": "ich gemacht hab. Und zwar, ich hab' immer ganz kurz gesagt, ich hab' ne Siedeltelefonanlage"}, {"id": 971, "start": 6917.56, "end": 6925.52, "text": "aus, da hab' ich nen ESP32 in das Gegensprech-Apparat eingebaut. Also nicht eben auf der Straße,"}, {"id": 972, "start": 6925.52, "end": 6932.88, "text": "sondern in dem Handgerät. Ich zeig's euch. Ich hab' doch hier letztens, wo hab ich denn"}, {"id": 973, "start": 6932.88, "end": 6946.08, "text": "das Bild dafür? Post. Image. Äh, wo... Wo hatte ich denn Punkt CC? Ah, Leute, wo hatte"}, {"id": 974, "start": 6946.08, "end": 6950.2, "text": "ich denn das, das letztens auf hier? Hatt' ich das auf Windows auf oder hatt' ich das?"}, {"id": 975, "start": 6950.2, "end": 6971.72, "text": "Fuck. Wo hatt' ich das denn auf? Okay, hier schonmal nicht. Ich hab' doch ein Bild von"}, {"id": 976, "start": 6971.72, "end": 6990.96, "text": "dem gemacht. Wo ist denn meine History? History. History. Post. Wo ist das denn? Bin ich jetzt"}, {"id": 977, "start": 6990.96, "end": 7008.8, "text": "total hängen geblieben? Wo... Wo ist mein Bild? Das war Picture-Upload, jaja. Irgendwas"}, {"id": 978, "start": 7008.8, "end": 7018.0, "text": "mit Post war das. Picture. Aber warum ist das nicht in der Historie drin? Das verwirrt"}, {"id": 979, "start": 7018.0, "end": 7029.04, "text": "mich viel mehr. Hatte man das vielleicht in Chrome offen? Post. Ein farbiger Stuhl Abdeckung."}, {"id": 980, "start": 7029.04, "end": 7049.8, "text": "Äh. Äh. Tja, Leute. RIP. Keine Ahnung mehr, wo das hin ist. Das war... Irgendwas mit Punkt"}, {"id": 981, "start": 7049.8, "end": 7061.08, "text": "Post Image. Punkt CC oder irgendwie sowas war das, glaub' ich. Ja. Post Image. Hatte"}, {"id": 982, "start": 7061.08, "end": 7065.24, "text": "man das hochgeladen? Sag' mal. Das kann doch nicht sein. Warum ist das nicht in der Historie"}, {"id": 983, "start": 7065.24, "end": 7071.68, "text": "drin? Hatte man das vielleicht in Firefox auf? Ah nee, das ist ja der Firefox. Hatte man"}, {"id": 984, "start": 7071.68, "end": 7094.56, "text": "das dann vielleicht in Chrome auf? Warte mal, ist das in Chrome oder in Firefox? History."}, {"id": 985, "start": 7094.56, "end": 7103.2, "text": "Vor zwei Tagen. CC. Ich hab' kein Schimmer vor das Bild hin. Das ist echt nicht... Sehr"}, {"id": 986, "start": 7103.2, "end": 7110.08, "text": "merkwürdig. Ähm. Na gut. Wie dem... Wie dem Ausseier. Irgendwie... Man hat überall"}, {"id": 987, "start": 7110.08, "end": 7117.32, "text": "History und jeder lockt was mit, aber wenn er mal was mitlocken soll, dann geht's nicht."}, {"id": 988, "start": 7117.32, "end": 7127.84, "text": "Das ist echt nicht merkwürdig. Wie... Der Chat weiß es wieder. Der Chat weiß es. Hier."}, {"id": 989, "start": 7127.84, "end": 7136.2, "text": "Der Chat weiß es. Da ist das Bild. Krass. Woher der Chat das wieder weiß. So. Und dahinter."}, {"id": 990, "start": 7136.2, "end": 7146.48, "text": "Hinter diesem Gegensprechgerät. Da steckt ein ESP32 in der Wand. In der Dose. Und es"}, {"id": 991, "start": 7146.48, "end": 7154.92, "text": "ist ziemlich doof, wenn man das Ding updaten will. Wenn sich's aufhängt beim Update. Weil"}, {"id": 992, "start": 7154.92, "end": 7160.44, "text": "man Scheiße programmiert hat. Weil da muss man das Ganze abmachen und die Strom abmachen"}, {"id": 993, "start": 7160.44, "end": 7167.24, "text": "und die Strom wieder reinmachen. Das sackt massiv. Und deswegen will ich jetzt ein ordentlicher"}, {"id": 994, "start": 7167.24, "end": 7172.36, "text": "Updatevorgang programmieren. Und ich will das Update halt pushen auf den ESP. Und ich"}, {"id": 995, "start": 7172.36, "end": 7176.64, "text": "will... Das hab ich mir in den Kopf gesetzt. Das ist eigentlich ziemlich dumm. Ich will"}, {"id": 996, "start": 7176.64, "end": 7180.6, "text": "das über HTTPS machen. Über HTTPS ist es gar kein Problem. Gibt sogar fertige Sachen"}, {"id": 997, "start": 7180.6, "end": 7185.52, "text": "vorne und selbst zu programmieren. Ist auch total easy. Über HTTPS gibt's kaum was."}, {"id": 998, "start": 7185.52, "end": 7189.36, "text": "Und was macht der ESP in der Telefonanlage? Der ist nicht in der Telefonanlage. Das ist"}, {"id": 999, "start": 7189.36, "end": 7197.52, "text": "nur dieses Gegensprechding. Telefon von der Tür-Gegensprechanlage. Der ist da angeschlossen"}, {"id": 1000, "start": 7197.52, "end": 7204.44, "text": "und guckt, ob's klingelt. Und zwar folgendermaßen. Da ist so eine kleine, wirklich nur aus vier"}, {"id": 1001, "start": 7204.44, "end": 7208.96, "text": "Bauteilen Schaltung dran. Die quasi guckt, welche Spannung auf der Leitung drauf ist."}, {"id": 1002, "start": 7208.96, "end": 7216.48, "text": "Und wenn 24 Volt oder größer 20 Volt auf der Leitung sind, signalisiert das Ding damit,"}, {"id": 1003, "start": 7216.48, "end": 7222.72, "text": "dass es klingelt. Und wenn es das feststellt, dass es klingelt, dann schickt es eine Nachricht"}, {"id": 1004, "start": 7222.72, "end": 7229.16, "text": "an meine Heimautomatisierung. Und meine Heimautomatisierung schaltet das Tablet an. Und das Tablet zeigt"}, {"id": 1005, "start": 7229.16, "end": 7233.88, "text": "mir die Kamera von der Tür und vom Hof. Und das natürlich schon, bevor ich überhaupt"}, {"id": 1006, "start": 7233.88, "end": 7240.8, "text": "am Gerät dran bin. Weil das geht schnell. Das dauert, bis der Browser hier offen ist,"}, {"id": 1007, "start": 7240.8, "end": 7246.12, "text": "dauert das eine halbe Sekunde. Das geht wirklich flutsch. In der Zeit bin ich garantiert nicht"}, {"id": 1008, "start": 7246.12, "end": 7255.88, "text": "an der Gegensprechanlage. Und ich hab noch ein Magnetsensor, also ein Sensor, der Magnetfelder"}, {"id": 1009, "start": 7255.88, "end": 7261.32, "text": "erkennt. Hier hinter das Telefon auf der anderen Seite gepappt. Weil das Telefon hat ein Magnet"}, {"id": 1010, "start": 7261.32, "end": 7268.52, "text": "drinne. Und mit dem Magnetsensor erkenne ich auch noch, an welcher Station der Hörer abgenommen"}, {"id": 1011, "start": 7268.52, "end": 7273.0, "text": "wurde. Also sprich, wenn ich hier den Hörer abnehme, dann kriegt es der ESP auch mit über"}, {"id": 1012, "start": 7273.0, "end": 7279.32, "text": "den Magnetsensor. Und da kann ich beispielsweise auch dann das Tablet wieder ausschalten direkt"}, {"id": 1013, "start": 7279.32, "end": 7285.76, "text": "sobald jemand auflegt und sowas. Das ist echt nice. Hat auch ein bisschen Gehirnschmalz"}, {"id": 1014, "start": 7285.76, "end": 7297.52, "text": "gebraucht, muss ich sagen. Ist das Tablet am Dauerstrom? Ja. Also hier dahinter, ich"}, {"id": 1015, "start": 7297.52, "end": 7303.64, "text": "mach euch mal ein paar Bilder das nächste Mal. Mach euch mal ein paar Bilder, kann ich euch"}, {"id": 1016, "start": 7303.64, "end": 7308.16, "text": "zeigen. Hier dahinter ein Hallsensor, genau. Ein ganz kleiner Hallsensor. So ein 5 Cent"}, {"id": 1017, "start": 7308.16, "end": 7317.16, "text": "Hallsensor. So ein ganz billigen Kleinen ist dahinter. Kost nix. Hier. Konrad, ich hab"}, {"id": 1018, "start": 7317.16, "end": 7322.44, "text": "Konrad einen Hallsensor, den billigsten gekauft. Den billigsten, der für 3,3 Volt funktioniert"}, {"id": 1019, "start": 7322.44, "end": 7337.28, "text": "hat. Hallsensor. Hallsensor. 3,3 oder 5 ist egal. 5 Volt. Hier so, boah, so teuer? Nee,"}, {"id": 1020, "start": 7337.28, "end": 7353.32, "text": "meiner war deutlich billiger. Hab ich hier einen liegen, dass ich hier mal gucken kann?"}, {"id": 1021, "start": 7353.32, "end": 7361.6, "text": "Nee. Hallsensor. Hier, so ein Ding. So ein Ding da. Ich glaube nicht, dass es genau"}, {"id": 1022, "start": 7361.6, "end": 7368.6, "text": "der ist, aber so was in der Richtung ist er. 3,5 Volt, genau, so ein billigen hier. 36"}, {"id": 1023, "start": 7368.6, "end": 7373.6, "text": "Cent, äh, 86 Cent, Eats. Nee, bei AliExpress kannst du grad nicht bestellen, das dauert"}, {"id": 1024, "start": 7373.6, "end": 7378.36, "text": "zu lang. So ein billig Ding hab ich dahinter. Also man muss ja sagen, die Bauteile für"}, {"id": 1025, "start": 7378.36, "end": 7383.12, "text": "diese Geschichte, die haben vielleicht einen Euro gekostet oder so. Also nicht sonderlich"}, {"id": 1026, "start": 7383.12, "end": 7390.08, "text": "teuer. Nichtsdestotrotz, wir machen im nächsten Stream weiter und dann machen wir dann, schließen"}, {"id": 1027, "start": 7390.08, "end": 7393.08, "text": "wir das Ganze mit dem Update ab, weil ich weiß jetzt ungefähr wie es funktioniert,"}, {"id": 1028, "start": 7393.08, "end": 7396.96, "text": "wir haben mal ein bisschen ProCraft gemacht. Äh, ich kann zwar morgen ausschlafen, dank"}, {"id": 1029, "start": 7396.96, "end": 7405.64, "text": "Homeoffice muss allerdings trotzdem, ähm, 7.30 Uhr oder so Homeoffice anfangen und außerdem"}, {"id": 1030, "start": 7405.64, "end": 7413.28, "text": "muss ich mal dringend kacken. Ähm, das heißt wir machen das nächste Mal weiter. Ich guck"}, {"id": 1031, "start": 7413.28, "end": 7424.96, "text": "mal ob es irgendjemand gibt, den ich hosten kann. Du folgst? Wem folge ich denn, der das"}, {"id": 1032, "start": 7424.96, "end": 7434.88, "text": "brauchen könnte? Mein Gott, manchmal ist die Twitch-Behandhabung aber auch eklig. Äh,"}, {"id": 1033, "start": 7434.88, "end": 7444.44, "text": "du folgst, ja. Ja. Gibt es da irgendjemand den ich hosten könnte, den er klein ist, den"}, {"id": 1034, "start": 7444.44, "end": 7452.84, "text": "ich follower und der es brauchen könnte? Den Cyrus, komm wir hosten den Krieger, wir hosten"}, {"id": 1035, "start": 7452.84, "end": 7456.52, "text": "den Krieger zurück. Der Krieger hat uns das letzte Mal gehostet, hosten wir heute mal"}, {"id": 1036, "start": 7456.52, "end": 7463.52, "text": "den Krieger. Letztes Mal kamen die ganzen Call of Duty Leute bei uns, da können hier"}, {"id": 1037, "start": 7463.52, "end": 7469.44, "text": "die Broggers Leute jetzt mal zum Krieger rüber. Auch wenn sich das, ich glaube das Publikum"}, {"id": 1038, "start": 7469.44, "end": 7474.2, "text": "wirklich mittlerweile kaum noch überschneidet. Bei ihm ist Call of Duty vielleicht ein bisschen"}, {"id": 1039, "start": 7474.2, "end": 7482.04, "text": "tauchen und bei mir ist hier Hardcore-Programmier-Gedöns angesagt. Ähm, ja. Also, wir raiden den Krieger"}, {"id": 1040, "start": 7482.04, "end": 7485.4, "text": "Leute, wir sehen uns, ich denke mal morgen, weil ich will den Kram wirklich jetzt mal"}, {"id": 1041, "start": 7485.4, "end": 7495.08, "text": "langsam fertig machen, wird Zeit. Ähm, ja, wir raiden den Krieger. Der Kanal richtet"}, {"id": 1042, "start": 7495.08, "end": 7511.4, "text": "sich an Erwachsene, also Leute. Seid brav, ja. Tut wenigstens Erwachsen. Okay, Leute,"}, {"id": 1043, "start": 7511.4, "end": 7515.84, "text": "wir sehen uns. Bis denn. See you."}]}