{"text": "Nice!Woah!Wood Face!Hoffentlich pendelt sich das jetzt ein klei.Naja, jetzt gehts anscheinend.Wo davon ist so ein Kackladen, Alter?Ah, das gibt's nicht!Ich hoffe das backt jetzt nicht wieder übelst rum.Wir brauchen auf jeden Fall irgendwann noch mal ein Kack-Woder von Emote.Oh, ihr seid ja schon am Start hier, der Michael 50 Billion ist am Start, der Patrickist am Start, Moonbeard Desmond am Start, der U-Mode auch wieder, Credo ist da, ContiAttacks, Galaga, Somniac Dude, Remember Wookiee, jetzt kommen alle, alle kommen an den Start.Sieht gut aus, also anscheinend spackt es jetzt nicht rum, es hat bloß initial einfachmal gar nichts funktioniert, ein paar Woder von Gravidda, schauen wir mal, fastest du?Okay, warum sollte ich fasten?Ostern ist ja schon lang vorbei, also das ist ja das wo die meisten, ach ist es Ramadanoder sowas?Naja, ich hab's mit keiner Glaubensrichtung, also wer da an Sachen glauben will, kann dasruhig machen, aber ich nicht.Fast, ich hab grad 6 Stücke Toastbrot gefressen, weil ich den ganzen Tag sonst nichts geforderthab.Und dann auch noch wahnsinnig, wahnsinnig gesunde Toastbrotmischung, nämlich 3 StückNutella, 3 Stück Erdnussbutter.Du frierst eine vor allem ein, bist du voll, warum soll ich die nicht einfrieren?Wäre doch bescheuert, eh mal neu zu starten, oder?Uiuiui, da ist aber ganz schön viele, ganz schön viele Sachen übrig, Anfragen, mussman sich das gleich mal kurz angucken.Glaubst du an die Progasgürteln?Gürteln?Ich muss mal den Chat neu laden, irgendwie hängt's bei mir, was soll das dann sein?So, jetzt, es funktioniert.Moin, Captain Seekai, soll mal schnell hier im Schnelldurchgang mal die ganzen Questionsabhaken.Ahjaja, Moment, warum spakt das rum?Äh, ist meine Abfrage fail im Frontend, dass ich gar nicht alle Sachen abfrage, sondernnur 100 oder so?Würdest du, wenn du die Wahl hättest, oh das ist eine interessante Frage, würdest duwenn du die Wahl hättest, Schule, mal Ausbildung in Informatik machen?Hm, gut, der Coding Niklas ist wahrscheinlich jetzt nicht da, weil ich nicht weiß von wanndie Frage ist, wahrscheinlich vom vorletzten Stream oder sowas, das kann man so pauschalfinde ich gar nicht, gar nicht sagen.Es kommt drauf an, wo dein Schwerpunkt ist, also wenn du die ganzen theoretischen Kramenwissen willst, oder vielleicht auch später, ja was gibt's da eigentlich theoretischesData Science, keine Ahnung, machen willst, dann ja, aber man muss sagen, die meistenLeute die Informatik studiert haben, landen dann irgendwann auch ganz normal in irgendeinemProgrammiert Job oder sonst wo, ein paar machen wahrscheinlich irgendwelche akademischenSachen, aber die meisten eher nicht, im Durchschnitt wirst du, wenn du studiert hast, trotzdemein bisschen mehr verdienen, das wars jetzt aber über die Stelle, die du dann spezielldas auch nicht viel aussagst, Compilerbau, exellent, Compilerbau, ja ich glaub die wenigstenLeute sitzen wirklich am Compilerbau, Moment warum ist die Frage jetzt weg, hab ich dieraus für den gelöscht, oder, ok ich glaub wir müssen, wo fangen wir jetzt am bestenan, mein, mein, mein Fragen Board ist kaputt, das zeigt Fragen in komischer Reihenfolgedann, was hältst du eigentlich vor Lutris, also vor dem Linux Gaming Launcher, ja dasist nicht schlecht, leider gibt's halt unter Linux so wenig Spiele, also die wirklich ordentlichsupporten, die man ohne Beine ausreißen ordentlich zu laufen kriegt, es wird immer besser, abersolang es da keinen offiziellen Support gibt wird das nie gut werden, zumal man alle Spielemit Anti-Cheat eh vergessen kann, das ist das Problem, es gibt auf YouTube so viele Videos,Linux die bessere Gaming Alternative, was eigentlich, was denn, natürlich ist im Vergleichzu Windows, Linux auf keinen Fall die bessere Gaming Alternative, kommt heute nix, ich weißja nicht was wir heute machen, keine Ahnung, ich muss erstmal fragen, wahrscheinlich nicht,aber ich kann euch mal erzählen was ich mir aufgeschrieben hab, was man alles machen kann,ne kann ich nicht, weil ich hab meine Notes nicht gesyncht vorher, aber ein paar Sachen,ich hab nämlich was cooles gefunden, das gucken wir uns demnächst an, so, was machtman denn, was macht denn ein ITler vor Ort, Windows Pass, ok da weiß ich jetzt nichtmal was ich das bezogen hat, nein war ich noch nie, ich war schon ein paar Mal eingeladen,hab aber noch nie in die USA gefahren, keine Ahnung wie es da ist, ah da haben wir anscheinendBarbecue Pit Boys geguckt, oh das ist ja ewig her, das Stream, das kann ich jetzt alles mallöschen, so, ähm, hast du morgen eigentlich arbeiten, ich wusste wahrscheinlich, ja, jawas, das ist auch sowas, du solltest mal ein Video machen, in dem du den Leuten erklärst,dass es wichtiger ist zu googeln und zu suchen zu lernen, als alles andere beim Programmieren,ja das ist so, weiß nicht ob ich da ein Video drüber machen sollte, ähm, das ist in fastjedem Beruf wo es um Technik geht heutzutage fast das wichtigste, dass man ordentlich suchenkann und ich sehs bei uns ja, ähm, wenn ich mir da die Leute anguck, die jetzt geradeHomeoffice machen, vor allem die die schon ein bisschen älter sind, das ist jetzt keinFlame, gegen ein bisschen ältere, weil es gibt auch genug die das hinkriegen, aber geradedie, die halt so, äh, aus Zeiten von Handbüchern, Handbücher lesen und, und, äh, Kobold undLochkarten, ne, also, die können ruhig schon ein bisschen jünger sein, ähm, aber Leute,es gibt, es gibt ja welche, die, ähm, die finden das als Niederlage wenn sie googelnmüssen, so nach dem Motto, oh fuck, ich weiß es nicht, krieg es nicht alleine raus, ichmuss googeln, aber es ist viel einfacher, gerade in der heutigen Zeit wo es Seiten wieStackoverflow gibt, ist das viel effektiver was zu googeln anstatt seine 3 Stunden selbstraumzu probieren.Ich, mich würde mal interessieren, dass, ey, ich hab ne richtig geile Idee für ein Videobzw. für ein Stream, aber ich weiß nicht wie wir das machen, und zwar, ähm, oh, Danny,Void Danny Twitch Prime 8 Monate, huge, das ist ja schon, das ist weder, noch Prime Subscriber,dass es 8 Monat ist, Max, du bist dick, oh fuck, kokona style, ähm, ja, ich hatte richtiggute Idee für den Stream, was ich gerade gesagt hab, es gibt so viel, was man auf Stackoverflowund so kopieren kann, man müsste mal nen Stream machen, wo man sich das Ziel setzt, ne,irgendeine billige, was kleines, ja, ähm, irgendeine kleine Anwendung zu basteln, unddas nur mit Copy Paste von Stackoverflow, Clocks HD, 8 Monat, ajajaja, Q-Chat, man müsstejetzt echt mal probieren, irgendwas kleines, ähm, hast du dir schon mal meine, ich habmir die meisten, ne, ich hab's noch nicht angeschaut, die meisten Sachen, ähm, dasmuss irgendwas kleines sein, irgendwas in Richtung, was könnte man, was, was, was würdensie sich da anbieten, äh, irgendeine Konsolenanwendung oder so, irgendwas, wo man schön copy pastenkann, ne, eine, das für ne reine, reine Copy, vielleicht, sag mal, sag mal ne 95% reineCopy Paste Anwendung geht schlecht, aber ne 95% Copy Paste Anwendung machen und gucken,was dann am Ende rauskommt, oh Leute, der Scam Train ist am Start, war da, 2 Monateabonniert, huge Subscriber, du hast nur wenig Zeit, 94% Leute, jetzt wird's aber knapp,der Scam Train läuft, ja, äh, A-Max hat der Kix eigentlich immer noch eine Muschi, jetztjeder kommt aufs Auge des Betrachters an, oh, war da vorn, was los, ach ne, das geht,geht nur runter, ähm, so, was haben wir sonst noch für schöne Fragen gehabt, aber ja,das, das, also ja, ja, das soll ich vielleicht mal wirklich machen, machst du im Moment andereTätigkeit in deinem Job wegen der Quarantäne, ne, ich mach eigentlich genau das gleiche,vor allem ist es sogar eher mehr, weil, weil man im Homeoffice total vielen Leuten hinterherrennen muss, ich, ich weiß nicht, ob es jetzt, ob es ein paar Leute, ich hab ja gesternein bisschen rumgerantet, ähm, auf Twitter, über manche Leute im Homeoffice, ähm, undzwar finde ich, der Vergleich triffts, triffts eigentlich gut, ähm, gestern Abend gab esnämlich mal wieder so ne, so ne Mail, wo sich unser Management gefreut hat, wie gut undtoll das Homeoffice funktioniert, wo ich mich dann so gefragt hab, ok, ähm, mit, mit wasdie teilweise schon zufrieden sind, ist lustig, aber, das sind halt alles auch irgendwelcheBoomer-Manager, die sich das wahrscheinlich überhaupt nicht vorstellen konnten, dassdie Leute, wenn man sie in Ruhe lässt, auch was arbeiten. Es gibt eh im Homeoffice totalviele Leute, gerade im, gerade im BWL und Management-Bereich, die, die jetzt, die jetztecht, denen geht der Arsch auf Grundeis, und wisst ihr warum? Weil durch diese ganze Homeoffice-Geschichtehaben die große Probleme ihre Existenz zu rechtfertigen, ja, weil was machst du alsirgendwelchen, kennst du den Tim von Alpha 4 Games, nicht, also nicht so richtig vonAngesicht zu Angesicht, ne, kennen ist auch zu viel gesagt, wir hatten nur, glaub mal,eine kurze Begegnung im Voice-Chat, vor einiger Zeit, ist ganz lang her. Ja, aber ich habden Eindruck, viele Leute haben echt Probleme, äh, so ihre Existenz zu rechtfertigen, gerade,gerade halt, äh, bei dieser ganzen Homeoffice-Thematik, weil wozu brauchst du jetzt einen, ähm, wasgibt's denn da, was gibt's denn da für, für, für schöne Sachen, einen Prozess-Requirements-blah,sonst war's Typ, ja, ist grad komplett useless, und die wissen grad nicht so genau, was siemachen sollen, hast du nicht mal so ein Stampf-Game für alte F4-Games gemacht, doch, doch, daswar das ja, wo wir mal kurz zusammen im Voice-Chat waren, das war die einzige Begegnung, dieich mal mit ihm hatte. Ähm, Pater, was, Moment, wie heißt der Name? Pater Oherli, jetzt kannich die aussprechen, schreibt, äh, unsere Angestellten denken, dass der Chef wiederSchichtdienst einführt mit Ausreden Loadbalancing der VPN-Server. Was zum Teufel hat Schichtdienstmit dem Loadbalancing der VPN-Server zu tun? Der Zusammenhang klingt mir grad voll random.Oh, der Keeper XY ist da, der weiß sogar von welchen Leuten ich rede vielleicht. Ja, aberwas ich witzig finde, ähm, ich hab's ja, ich hab's hier auf Twitter geschrieben, alsoerstens bei uns überschlägt sich halt das Management voll, wie gut das Ganze läuft.Kommt überhaupt nicht mit dem Chat hinterher, Leute. Ähm, klar weißt du, wen ich mein,das glaub ich nicht, ich mein gar keinen wirklich jetzt so bestimmten, wenn ich dassag. Ähm, wir haben ja ein paar, die im Homeoffice echt so ein bisschen ihre Probleme haben.Zumindest ich find den Vergleich mit dem MMO eigentlich ganz gut, ja. Es gibt auch im Homeofficeviele Leute, die sind einfach nicht in der Lage ihre Klasse richtig zu spielen, ja. Dasist dann sowas wie Melee Heiler oder, oder, oder, äh, Damage, äh, oder, keine Ahnung,Caster der heilen will oder Damage, ähm, Buffer oder irgendwie sowas, ja. Da hast dudann halt Leute daheim sitzen, wo du denkst, ok, der müsste das eigentlich können. Unddann stellst du dir einmal fest, der kann das nicht. So, jetzt wusste ich, ich kommim Chat ja gerade wirklich überhaupt nicht nach, was ist denn hier los. Ähm, was denkstdu eigentlich dazu, dass es immer weniger Leute auf YouTube gibt, die Commentaries machen?Also, ja gut, das zieht halt nicht mehr. Na, du kannst ja Reaction Content machen. Alsoman kann ja Reaction Content, da stehen ja die Leute zur Zeit total drauf. Reaction Contentmuss sein. Oh, huge, huge Song hier. Das ist, das ist, ähm, A Link to the Past, das istnicht Dark World, ist das nicht das Schloss? Doch, das ist das Schloss, das Schloss, Castle,Castle Theme, oder? Moment, gucke. Ok, ja, es ist, es ist A Link Between Worlds, aberes ist der gleiche, exakt gleiche, gleiche Soundtrack, oder fast gleiche Soundtrack, bloßein bisschen neuer gemacht. Äh, oh, ho, sagt. Ähm, hab mal eine Frage, du benutzt ja auchWindows 10? Äh, ja, mal kurz. Jetzt kann man was, jetzt machen. So. Ah, muss ja immerdafür sorgen, dass die Leute aufmerksam bleiben, oder ist, ist beste, wenn was auf den Bildschirmpassiert. So, jetzt passiert was auf dem Bildschirm, weil wir wissen ja alle, die Aufmerksamkeitsspanneder Zuschauer ist ja heutzutage ist nicht hoch. Da muss ich jetzt mal ein bisschen was machen.Oh, perfekt. Äh, hab mal ne Frage, du benutzt ja auch Windows 10 und hast da ne VM auf demzweiten Desktop. Mit Ctrl, Windows plus rechts plus links kann man ja zwischen Windows 10und VM wechseln. Ja, du kannst, du kannst, äh, zwischen, zwischen virtuellen Desktopwechseln, also du musst nicht unbedingt ne VM sein. Ja, wenn ich in der VM bin, mussich, um da rauszukommen, erstmal Ctrl alt drücken und kann erst wieder rüber zu Windows10 switchen. Da sind sie, ja, das stimmt. Hast du da ne Lösung, wie man das mit wenigerTasten geht? Das kann ich dir erzählen, ähm, weil das Problem hatte ich auch. Äh, habversucht mit AutoHotkey das zu automatisieren, aber da gibts dann Probleme mit VM-Ware undderen Keyboard-Rapier. AutoHotkey funktioniert nicht, bringt vollkommen Milchbrot. Dankeschönfür die zwei Monate, huge Subscriber. Excellent, hrq-sub. Ayayar. Ähm, also mit AutoHotkeygeht nicht. V.a. wer hat irgendeinen Low-Level-USB, äh, frag mich nicht, Keyboard-Driver, daist mit AutoHotkey nix. Äh, was du machen kannst ist, wenn du ne Maus beziehungsweisene Tastatur hast, die halt ne, ne Macrosoftware dabei hat, Cozart, Logitech, was auch immer,da kannst du das programmieren. Das funktioniert, das hab ich auch gemacht. Allerdings hab ichdas hier nicht drinnen, sondern hier drück ich immer, äh, Ctrl alt, Ctrl alt und dannCtrl Windows links. Ist ein bisschen Übungssache, aber ich hab mir das in der Logitech-Softwaregebuffelt, dass genau das Ganze funktioniert. Damit geht das. Ähm, gibt es eigentlichdie Knu... Knu... Eus noch? Was? Was für ein Ding? Knu-E-U-W-S? Was ist das? Oh, derScamtrain-Level 2. 3 Sekunden, Leute. 3 Sekunden. Er ist da vorbei. Der Scamtrain ist abgefahren.Ähm... Also, Pater, ich muss sagen, das ist ne sehr merkwürdige Geschichte, weil eureVPN-Software ausgelastet sind. Ach, jetzt hab ich, jetzt versteh ich das. Euer Chefwill Schichtarbeit einführen, weil die VPN-Software ausgelastet sind, mit dem ihr euch auf dieArbeit einloggt. Ach so. Kann man da nicht einfach noch ein paar VPN-Software dazustellen?Vor allem, was habt... Mein, VPN, wenn es jetzt nicht gerade OpenVPN ist, merkwürdigkonfiguriert, hält es sich doch in Grenzen. Einfach noch, einfach noch was dazu, einfachmit Hardware erschlagen, das geht doch bestimmt. Wenn natürlich eure Anbindung zu langsamist, ja, aber trotzdem. Bescheuerte Idee. Max, du willst Content auf YouTube einfachReactions auf Quellcode? Exzellent. Reactions-Videos zu Reaction-Videos. Ja, das hab ich letztensauch gesehen. Ich hab letztens ein Video gesehen, war so, war, war, war komplett weird. Daswar so nach dem Motto, Unge reagiert auf Inscope21, der auf MontanaBlack reagiert. Ja, ich weißeuch jetzt vorbei, das ist echt abgefahren. Spielst du immer noch Path of Exile oder auchnoch was anderes? Ich spiel gerade noch nicht mal mehr Path of Exile, ich spiel grad, äh,gar nichts. Ich, ich spiel grad den Doom Singleplayer noch mal auf schwer, ein bisschen schwerer.Aber ansonsten, also der hat der Dings hier Doom Eternal, aber ansonsten, äh, geradewenig, ja. Äh, da hast du recht. John hat eine DVD, hast du einen Streamplan. Ich habmir das tatsächlich überlegt, ob wir nicht einen Streamplan machen, aber ihr kennt mich.Wenn ich sag, wir machen einen Streamplan, dann setzt mich das immer irgendwie unterZugzwang und ich machs nicht. Deswegen werd ich wahrscheinlich keinen Streamplan machen.Der Kommentar, das hat dir, das hat dir gefallen, ne? Übrigens, der Kommentator, der hat nichtUbi gesagt, der hat Rubi gesagt. Das ist eine Programmiersprache. Äh, KeeperFX, bist dunoch da? Kennst du noch den Typ bei uns, der, ähm, der vor seinem Rechner gesessen hatund den PC Speaker anhatte, wenn er mit der Maustaste, mit der Maustaste an den Rand gekommenist und dann gesagt hat, der scheiß Gnome und ab und zu, und ab und zu gesagt hat, Rubi,der vom Rechner gesessen hat. Den hatten wir damals für ZFS, für Mail ZFS geholt undhaben uns dann überlegt, wir wollen doch kein ZFS, wo er da war. Wie gut kennst du dichmit Shadern aus? Das einzige, was ich bei Shadern weiß, ist der Unterschied zwischeneinem Pixel-Shader und einem Vertax-Shader, dass der eine sagt, welche Farbe der Pixelhat und der andere sagt, wo der Pixel ist. Ansonsten hab ich keine Ahnung. Also Michael50 Billionen, ich glaube, ich hab die letzten Sonntage, äh, innerhalb, ich glaube, ichhab das letzte Jahr über, ähm, einmal sonntags nicht gestreamt. Der mir, ja mir fälltgrad auch was ein, wo ich erzähle, der Typ, der bei uns auf der Arbeit da gesessen hatund, und PC Speaker anhatte. Wir hatten auch mal einen, der war auch geil, der hat immerauf seine Tastatur geschlagen, wenn was nicht funktioniert hat. Und das ging einem megaauf den Sack. Das ist dann, irgendwas, irgendwas hat nicht funktioniert, was er gebastelt hatund dann saß er dann echt da. Das war eh einer, der hat ganz harte Aufmerksamkeit,also ganz irgendwie Aufmerksamkeitsprobleme gehabt, weil, ähm, also, dass er die bekommt,denn, ähm, der hat meiner Meinung nach auch eigenhändlich dafür gesorgt, dass eineAuszubildende nicht mehr zu uns in die Gruppe wollte, ne. Also, und, und er hat Liegestützeim Büro gemacht, sowas, der war echt ein bisschen neben der Spur. Der ist manchmalaufgesprungen, hat angefangen, Liegestützen zu machen. Leck, oh, Leck, wo davon? Der istmanchmal aufgesprungen, hat angefangen, Liegestützen zu machen. Mitten, mitten im Büro, wo alleda gesessen haben und haben gearbeitet und irgendwann haben's alle ignoriert und habenquasi absichtlich weggeguckt, wenn er angefangen hat. Ja, zumindest, wir hatten mal eine Auszubildendeeiner der wenigen Mädels, äh, IT-technisch, ja, und die ist dann bei uns ins Büro gekommen,hat irgendwas gefragt und da hat er seine Charme-Offensive gestartet und, ähm, hat sichdann quasi in den Türrahmen gestellt und hat so Stretch-Übungen gemacht, so, um quasiso ein bisschen männliche, äh, Dominanz, äh, auszustrahlen und das hat die echt komplett,äh, auf den falschen Fuß erwischt und die wollte nie wieder bei uns in die Gruppe irgendwiedann was, was da machen. Ist auch, ist auch ein Depp, warum macht er auch so Zeug, ja?Aber wir müssen jetzt leider warten, bis Wodafone sich wieder, bis Wodafone ausgeschissenhat. Seit wann kann man Kekse sammeln, äh, seit zwei Streams? Ach, Pater, die Aussagegibt's gar nicht, das ist Fake-Grund vom Chef, ja, das siehst du mal, das daran siehtman, wenn du, wenn du, wenn er euch halt irgendwie nicht traut, was halt merkwürdig ist, weilgerade als Chef solltest du eigentlich erkennen können, in der Lage sein zu erkennen, wasdeine Leute machen und, äh, wenn das Homeoffice-mäßig auch klappt, dann ist doch gut.Jetzt, Wodafone, komm mach hinne.Max, kennst du dich mit Container-Networking aus? Also mit dem Standard-Docker-Zeug schon?So halbwegs, was man halt so braucht? Je nachdem, was du machen willst, also wenn du jetzt diesenCisco, Cisco-Firmware-Emulator da irgendwie in der VM laufen lassen willst, mit 48 Interfacesim Container laufen lassen willst, da kann ich ja nicht sagen, wie das geht. Also denkann man übrigens gar nicht im Container laufen lassen, fällt mir ein.Äh, warum 48 FPS für die cineastische Experience? 48 FPS ist ganz einfach zu erklären. 48 FPSist deutlich flüssiger als 30 und sieht schärfer aus bei der gleichen Bandbreite wie 60.Meine Güte, Wodafone, ey. Ich kann so nicht weitermachen.Ich kann so nichts machen, wenn der Kack nicht funktioniert.Soll ich dir mal einen OpenVPN-Server in Frankfurt, Niederlande aufsetzen? Hilft es gegen Kack-Wodafone-Peering?Ich glaube nicht, dass das hilft. Ich wollte das auch schon mal ausprobieren,ich wollte mir mal bei einfach bei DigitalOcean eine Kiste holen und dann VPN hin machen undgucken, ob es funktioniert dann mit Wodafone, aber ich, ich bin mir eigentlich ziemlichsicher, das wird nicht funktionieren.Dein Tweet bezüglich Leute, die zuhause was machen oder nicht stimmt 200%.Ich finde es schön, wenn sich das auch mit deiner Erfahrung deckt. 8,6% Frame Loss.Was ist mit Wodafone, was machen die eigentlich mit ihrem Netzwerk?Hat er den Switch aufgemacht und erstmal irgendwie reingespuckt?Was machen die da?Ja Pater, das wäre ja auch komplett unsinnig, wozu braucht man das 24-7?Welcher Zwischenspeicher kann eigentlich voll offenbar dieser Unity Media Connect Boxsein?Hat das jemand von Wodafone erzählt oder was?Ich wüsste nicht, was da groß voll laufen soll, ich meine, wenn du irgendwelche Bufferhast, die können natürlich immer voll laufen, wenn es dann schnell genug wegkommt auf deranderen Seite.Das ist aber nicht das Problem von der Connect Box oder von dem Buffer, irgendwie sind Bufferhalt voll.Und es bringt ja auch nichts drei Stunden da irgendwas drin zu speichern, wenn das zueiner aktiven Verbindung gehört, das braucht dann keiner mehr, wenn es nach drei Stundenankommt.Das liegt einfach an anderen Stellen, da kann man daheim nichts machen.7, 8, das ist ja immer noch am abkacken, 10% fast.Ach stimmt, das habe ich ganz vergessen, die 48 FPS liegen ja auch daran, weil jedes Augenur 24 FPS sehen kann, natürlich, exellent.Wobei, ne, es waren 12 FPS pro Auge, wie kann man das dann erklären?Wie kommen bei dir die Bilder mit den Memelinks im Bild, hier vorn, da, ich habe mir sowasprogrammiert, wo man Zeug einblenden kann hier, so nicht der Gaben, der könnte unsjetzt mal helfen, dass Wodafone nicht mehr so leckt, oder Hackermans haben wir auch hier,aber Achtung Leute, äh, Passt, äh, also, Warnung, jetzt wird es laut, spielst du nochOverwatch?Ne, das letzte halbe Jahr nicht mal angefasst.JSPP64 schreibt von seinen Freunden, er hört immer noch schlechte Sachen über Wodafone,ich höre auch selten Gutes von Wodafone, allerdings ist es bei mir der beste Anbieter,was Upload und Download angeht, Telekom kann da nicht in ähnliche Regionen mithalten,leider, sonst hätte ich wahrscheinlich auch gar kein Wodafone.Aber ich werde das jetzt jeden Stream so machen, wenn die rumleggen, das dauert ja meistensgar nicht so lang, und das ist ja auch meistens nur so einmal richtig pro Stream.Ähm, ich lass einfach jetzt immer den Scheißhaufen von Wodafone auf, bis ich das nach 10 Minutenwieder erledigt hab, mir bleibt eh nix anderes übrig, ich hab ja mal, ich hab's euch jaerzählt, ich hab den Wodafone-Support angeschrieben, und der Wodafone-Support hat mir dann untermStrich gesagt, ich soll die SSID von meinem Wlan ändern, da sieht man mal, was da fürSpezialisten sitzen.Flame mal etwas auf Twitter, das hat überhaupt keinen Sinn.Die reagieren zwar schnell, aber passiert halt nix, die Anbindung von denen wahrscheinlichirgendwo in Frankfurt oder so, das ist halt einfach grottenschlecht.Guck mal, ah nee, geht, geht trotzdem nicht.Der hat bei mir das, bei Void-Danny sagt, bei ihm hat der Wodafone-Mitarbeiter genaudas gleiche erzählen, ja, das scheint wohl so ne Standardantwort zu sein, ändern siemal ihre SSIDs.Ja gut, 1&1 ist ja auch wirklich Bullshit, also wenn schon Telekom Resale, dann haltauch gleich Telekom und nicht Resale.Wann kommt ein Video über deinen neuen Server rum, der so neu ist, hat da gar nix.Der neue Server steht immer noch hier links neben mir auf der Erde.Wir haben 10% geschafft, Leute.Yeah!Ähm, ich stelle mal kurz die Bitrate ein bisschen runter, vielleicht bringt das jawas.Nö, das ist immer noch, 2 Mbit ist 2,9 Mbit ist immer noch zu viel anscheinend.Oh, wir haben 11% geschafft, sehr gut, exquisite, Wodafone exquisite, ok, Achtung, 1,9, ok,2,9.Jetzt haben wir 2 Mbit noch übrig, 2 Mbit, komm Wodafone, 2 Mbit schafft ihr, da gehtaußer Sound kaum noch was durch, in anehmbarer Qualität gerade.Na, 2 Mbit scheint zu funktionieren, hä?Was ist das für ein Scheiß, Alter?Was die Soundbitrate ist da nicht drinnen, warum steht da da total, das ergibt jetztda eigentlich keinen Sinn.Es ist, ach Gott, ey, 101,3 Mbit und es geht nicht ordentlich durch, ich kriege AnfälleWodafone.Läufst du am Montag mit deiner Metromaske rum, wieso am Montag, ist da Maskenpflichtoder was, ich weiß, ich hab noch keine News gelesen heute, also wer die Metromaske nochnicht kennt, ich zeig sie euch nochmal, meine Metromaske, was, warum kann ich meine eigenen,meine eigenen, ach Gott, Twitter, alle, warum gängeln die ein, alle immer so, warum gängelndie ein, alle so, wo ist denn mein Bild, wo ist das Bild von meiner Maske, Twitter, nochnicht mal Twitter lädt, ich hab was von Metro geschrieben dabei, hier, ah, meine Metromaske,WTF Trending, was ist Trending, Kim Jong Un dead, was, Kim Jong Un ist dead, das istdoch fake oder, ja was denn du, stimmt das jetzt oder nicht, ok, da kann man, Twitter,Twitter kann man nicht glauben, Kim, ah, ihr, ne, da ist anscheinend nichts dran, unbestätigt,ja, dead, ist er geplatzt oder was, naja, mal gucken, wird, wird die nächsten Tage schonrauskommen, was kommt denn als nächstes, wir werden jetzt Kim Jong Un, davor hattenwir Kim Jong Il, davor hatten wir Kim, wie ist der andere, ach kein Schimmer, jetzt kommtKim Jong Un, oder so kommt jetzt, Maskenpflicht, steht das hier, ja, stimmt, da wollte ich jetztgerade mal gucken, was, Maskenpflicht, wisst ihr was ich geil finde, warte mal, wisst ihrwas ich lustig finde, also, am Anfang, wo alle noch gesagt haben, ach Lull ist dochnicht so schlimm, könnt ihr euch noch dran erinnern, auf Twitter, wo alle gesagt haben,ach was, was interessiert es mich, ah Krippe ist doch viel schlimmer, es ist doch gar nichtso wild, ist doch alles toll und zu diesem Zeitpunkt, waren ja auch die Leute am Start,die alle dann kamen so, siehst du, und Masken bringen doch eh nix, und es ist auch fragwürdig,was Masken bringen, also, das klang schon glaubwürdig, was damals die Leute erzählthaben, die sich damit auskennen, Kim kommt um, das ist so geil, so, und Masken komplettoverrated, brauchen wir alles nicht, Masken brauchen wir, total schwachsinnig, Maskenbringen eh nix, Masken schützen nicht, so, dann haben wir angefangen, das alles einbisschen runter zu fahren, das lief auch ganz gut, und jetzt fahren wir das ganze wiederan, und, weil die Leute nicht in der Lage sind, weil die Leute teilweise auch zu degeneriertim Kopf sind, sich irgendwie halbwegs dran zu halten, dass man ein bisschen Abstand hält,dass man in Geschäften irgendwie sich was umzieht, jetzt sollen wir überall Maskenaufziehen, die ja angeblich, wie es am Anfang gesagt hat, nix bringen, also, rein irgendwoam Arsch der Welt, im Freien, brauche ich keine Maske, das ist kompletter Schwachsinn,im Geschäft, vollkommen okay, den mega Upload Song, warum denn den mega Upload Song, dumeinst, weil es Kim Jong-Kom ist, oder was, okay, also was, was haben wir denn, Ab derkommende Woche gilt in allen Bundesländern eine Maske nicht, wie diese kontrolliertund welche Bußgelder bei Missachtung fällig werden wird, ohne dass ihr dich kannt habt.Ja, ist ja auch klar, die Leute haben sich ja auch absolut nicht dran gehalten, ich habein Foto, ich muss euch das mal zeigen, jetzt wird's wieder schwierig mit Upload, ich hoffeman erkennt's, ich hab ein Foto am Main gemacht, über den Main weg halt, Moment, was hattenwir letztens für eine Seite, um Bilder hochzuladen, wie hieß das, Post Image Punkt, ja genau,da lad ich, ich lad mal grad was hoch, ich zeig euch mal ein Bild, was ich am Main gemachthab, wo es um soziale Distanz und generell Leute gibt, die ein bisschen ihr Hirn einschalten,und da werdet ihr sehen, dass es halt viel zu viele Falschbasten gibt, die nix hinkriegen.So, ich hab das Bild mal hochgeladen, so, also, Post Image, ich hoffe man erkennt's,ich hab das mit meinem alten iPhone aufgenommen, also mit dem 6s, das hat halt keine, oderhat, nee, 6s ist das glaube ich, das alte auf jeden Fall, das hat halt eine scheiß Kamera-Qualiim Vergleich zu den neuen, aber ich hoffe man erkennt das trotzdem, erkennt man's, guckteuch mal an, das hab ich über den Main fotografiert aufgenommen, also sprich, ich bin hier gelaufenauf der Seite, und da drüben ist so ein Strand, seht ihr das am Strand, seht ihr das am Strand,was da los ist, man erkennt's schlecht, ja, aber, ok, ich geb zu, es ist pixelig, aberman sollte es eigentlich erkennen, da sitzen Leute, da sitzen Leute, da stehen irgendwie8 Leute auf einem Haufen, hier stehen auch irgendwie 8 Leute am Haufen, da vorne istein Schwan am Start, das ist fast schon ein paar Ding am Strand gewesen, natürlich keinerMundschutz auf oder irgendwas, machst du gerne Fotos vom Fremden, nee, mach ich nicht, ichmach nur Fotos von Sachen, die mich aufregen, und das ist ne Sache, die mich aufregt, alsomir kann jetzt aber keiner erzählen, dass er hier irgendwelche Leute erkennen würde,ja, also eindeutig hier, den da, den im Busch, den erkennt man zu gut, da muss ich den schwarzenBalken drüber machen, naja, so, also was, wo ohne Maske Bußgel droht, da bin ich malgespannt jetzt, stimmt, da hinten ist der Kabum irgendwo gewesen, Quatsch ey Leute,also DSGVO, ab der kommenden Woche geht alles, wie diese kontrolliert wird und welche Bußgeldabei ist, also ich hab die Polizei bei uns am Main schon gesehen, aber noch nie hat irgendwieeiner was gesagt, angeblich haben die bei uns irgendwo im Nachbarort am Friedhof ne Partyvon Jugendlichen, am Friedhof, ne Party von 20 Jugendlichen aufgelöst, letztes Wochenende,am Friedhof, die haben wahrscheinlich gedacht, das sieht keiner, also wer sich drauf verlässtund wer Hoffnung hatte, dass die Leute freiwillig und mit Hirn einschalten was machen, ist ehkomplett hängen geblieben, ok Moment, das ist, warum ist der Scheiß immer so kompliziert,können die nicht einfach sagen, ja, gilt, wenn du dagegen verstößt in dem und demGebiet, dann, keine Ahnung, 200 Euro Geldstrafe, du musst dir immer, dass du die Sachen inDeutschland kapierst, musst du dir immer 5 Seiten durchlesen und hoffen, dass du nichtzufällig über die Grenze in Bayern fährst, wo die Sachen wieder komplett anders sind,ok also hoffen wir mal, Berlin juckt mich nicht, Hessen, was ist Hessen, Hessen, 50 Euro,weißt du was ich mache, Leute wisst ihr was, wisst ihr was ich am Montag mache, das nehmeich auf, das nehme ich auf mit der Kamera, ich gehe am Montag auf die Sparkasse Geldabheben und guck mal ob die mich reinlassen, mit meiner Maske, das nehme ich auf im Handy,mal gucken was passiert, mal gucken ob die mich rauslassen, weil bei der Sparkasse hängtimmer noch das Schild vorne dran, dass man nicht mit Motorradhelm rein darf, ich meinedas ist, das ist, streng genommen ist das kein Motorradhelm, die denken ja du bist Bankro,wahrscheinlich denke ich mit Bankro, wiederholte Verstöße mit einem, die gehen mir jetztso auf den Sack, wenn ich am Main spazieren gehe und ich bin ja jemand der achtet aufAbstand, ich ziehe mir auch öfters mein Hemd über die Nase wenn es mal wieder einer nichtmacht, ok dafür ist, aber ich versuche wirklich riesen Bogen um die Leute zu machen, ich glaubenicht, dass wenn ich am Main mal kurz spazieren gehe, dass ich da irgendwie Leute gefährdeund gefährdet bin, das ist einfach ätzend, die gehen mir auf den Keks jetzt, hat eigentlichirgendwie einer Plan da, wie man sowas managen sollte, nicht dass ich es wüsste, an mirkommt es irgendwie so vor, als machen wir einfach nur Aktion nach Aktion nach Aktionohne dass die irgendwie zusammenhängen, na anscheinend gilt es jetzt überall, das BundeslandHessen, wo das Massenpflicht ebenfalls am Montag in Kraft tritt, die gehen mir allesso auf den Sack, all die Klappe, so Hessen, jetzt heißt es schon mal Hessen, Hessen, Hessen,diese Solle für Geschäfte A und den öffentlichen Nahverkehr gelten, also jetzt wieder, ok alsojetzt doch nicht oder wie, kannst du wieder 5mbit stellen, hat es aufgehört zu ruckeln,hat es aufgehört zu ruckeln, ruckelt nicht mehr, stellen wir mal wieder hoch, gucken wirmal, exzellent, dass es jetzt mal kurz ruckelt, ist normal beim Bandbreiten ändern, aberjetzt sollte es funktionieren, wenn das wieder hoch geht Leute, ich resette mal die Stats,dass man das auch sieht, naja, eine seriöse FAQ der hessischen Regierung, ooooh Wahnsinn,die sind ja schnell, ok, die hessische Landesregierung hat eine Massenpflicht beschlossen, die amMontag, 27. April gilt, ok, Nahverkehr nutzen oder die Publikationsbereich von Geschäften,Banken und Postfiltern, das finde ich gut, das ist ok, das scheint mir sinnvoll, dasfinde ich ok und wisst ihr was man mal machen müsste, man müsste den Leuten mal erklären,wie man eine Maske überhaupt richtig aufzieht, ich sehe nämlich ganz viele Leute auch inGeschäften, die haben die Maske über den Mund und nicht über die Nase, was meinendie denn warum die so eine Form hat, dass die über Mund und Nase getragen werden kann,was für eine GPU und CPU hast du in den 8700K, ein bisschen übertakt der 9800HTi, warumbist du so scharf darauf, dass ich den Mega Upload Song anmache, Leute, Mega Upload Songoder kein Mega Upload Song, wir hatten den Mega Upload Song schon lange nicht mehr, ok,Mega Upload Song, wild, big, Battlefield 5 Final, it's over, haha, ok, haltet euch fest,der Mega Upload Song, da hat der Knäber sogar kleingesubscribed, kommt, dass ich keine Subsübersehen habe, Vollkorn Mischprode habe ich glaube ich übersehen, danke für denTier 1 Sub, 2 Monate, nee, nee, doch, doch, doch, das habe ich gesehen, habe ich gesehen,alles gut, alles gut, also Mega Upload Song, weil, weil, weil ihr der, seid,kein Pock, meinetwegen auch ein Pock, ich finde es immer so geil, die, die Typen hattenalle keinen Plastenschimmer, für was sie sich da in die Kamera gesetzt haben, wer istdas, den kenne ich, den habe ich schon mal gesehen, die habe ich auch schon mal irgendwogesehen, andere kenne ich nicht, warum machen die Künstler werden für Raumkopien, weilich keine Ahnung hatten, warum vor sie da vor die Kamera gesessen haben, jetzt musser noch selbst singen, der Knäber und das Sebaro, die steigern sich ja richtig reingerade, 10 times faster, bit by bit unlimited, it's a hit, warum kann man sich den Kram überhauptnicht merken, guck mal Leute, da merkt ihr, dass ihr alt seid, 2011, 9 Jahre ist das her,übrigens der Frosch ist mein Overlay, das gehört nicht zum Video, hobs, Book Free, BookFree, wo kommt man eigentlich raus, wenn man auf Mega Upload, nee was war das Punkt, MomentLeute, ich gehe mal kurz in meine Linux-VM, ich weiß nicht, was muss ich da einfangen,mega-upload.com war das, nee da gibt es nicht, der Mega NZ ist das Neue, wie lange gehtdas eigentlich noch, was macht dann eigentlich gerade so, wie hast du gerade so schnell gewechselt,hier, Windows-Alt-File-Taste, Achtung Epilepsie-Warnung, was macht der eigentlich gerade, Sam knastjetzt, ich hoffe nicht, das ist der VM, ja das ist hier VM-Workstation, ich hoffe nicht,dass er im Knast ist, ja okay, keine Ahnung, was da jetzt gerade rausgekommen ist, ich glaube,er kehrt schon schon Shrimp-Warrant, alles kurz, ich hoffe, okay, Laddra chaotic, Aa,Keine Ahnung, was er gerade so treibt.Na gut, alsoFAQ, es betrifftnur Nahverkehr,Geschäfte, Banken und Postvieland, das findeich sinnvoll.Habt ihr das mitgekriegt,dass Leute jetzt abgemahntwerden, dieAtem-Atemschutzmasken und soverkaufen oder Schutzmasken verkaufenund die Schutzmasken und Atemschutzmasken nennen,obwohl es selbstgenähte Sachen sind,da werden die abgemahnt, weil dasquasi keinerichtige Atemschutzmaskeist und sie ja irgendwiedann auch, was auch immer,das wettbewerbsmäßigverstoßen gegen irgendwas.So ist das in Deutschland.Du wirst abgemahnt,wenn du ein paar Masken lest.Was hältst du vom neuen Zero,der Export von Apple?Ich hab's vorhin nur kurz gesehen, das ist das mit den Mails.Das da.Das hier.Das ist so eine typischeApple, so eine typische IOS-Sicherheitslücke.Die hatten ja schon öfters Dinger, dass duper Mails und per iMessageentweder dasSmartphone zum Absturzbringen kannst oderCode einschleusen, was auch immer. Die hatten ja schon ein paarso Dinger. Ich hoffe nur,angeblich gibt es keine direkte Gefahr. Aha.Ich hoffe nur, die kriegen das gebacken.Zack Opshat's entdeckt.Okay, Zack Ops ist auchgut.Guter Name für eineSecurity-Firma. Oder für eine Security-Gruppe. Zack Ops.Besonders kritisch.Die sind alle gerade beschäftigtmit der Corona-Tracker-App.Die ja wieder erwartettotal unsicher ist. Wer hättedas nur gedacht?Das ist eine App.Das ist eine offizielle App, die wirhier in Deutschland basteln, dass die unsicherist. Daswäre mir nie inSinn gekommen.Ja,da ist es doch. Corona-Tracking-App.Alleins schon, das kann manheute mal aussprechen.P-P-T-P-P-Pepel.Pep-Pepega.Pepega-Tracker hätten sie dasnennen sollen.Ah, ihr habt ja gesehen,Facebookhat angeblichjetzt auch eineVideo-Chat-App vorgestelltfür bis zu, glaub, 50Leute.Weil sie festgestellt haben, dass die Leutealle Zoom verwenden und kein Facebook.Ich würde weder Zoom noch Facebookverwenden, wenn ich die Auswahl habe.Guck mal, wo davon? Kann nicht mehr rum.Funktioniert.Eigentlich waren wir ja mal beim Fragenbeantworten irgendwann.Hast du was von Nintendo Online?Was? Die Frage ist doch schonuralt.Oder ist die? Kam die eben gerade?Ach, die kam eben gerade.Ja, habe ichmitbekommen und ich wollte eigentlichgucken, ob ich 2-Faktor-Authentifizierung aufmeinemAccount anhab.Hab ich aber nicht gemacht.Passwort?Nintendo, ey.Oh Gott, warum seid ihrso unfähig, was Online angeht?Ahh.Warum ist Nintendo so unfähig, wasOnline-Sachen angeht?Es heißt, was ich damit nicht sagen will,ist, dass das andere nicht soWas ich damit nicht sagen will, ist, dass das andere nicht auch passiert.Das passiert, es ist, es ist, Sony ist das schon passiert.Ähm, sogar ziemlich groß, ich glaube Microsoft auch.Allen ist das schon irgendwie mal passiert.Aber Passwort!Warum speichert man das Passwort überhaupt?Was ist, was ist mit den Leuten eigentlich los?Warum speichert man Passwörter?Es ist doch komplett unsinnig, Passwörter zu speichern.Braucht kein Mensch, muss Passwörter speichern.Und dann, und dann auch noch ein Teil unverschlüsselt.Aber erstmal Plain Text Passwörter.Das passt aber zu Nintendo.Letztens im Video gesehen,das in Animal Crossing, das im neuen Animal Crossing,dass man, quasi Leute, die mit Passwörtern speichern,dass man quasi Leute aus seiner Freundeslistebesuchen kann in seinem Dorf.Allerdings, ist es wohl dann so,dass wenn der Host oder irgendeiner der Leute,die die Session gejoint sind, das Menü offen hat,dann kann niemand mehr die Session verlassen.Also sprich, wenn ihr jetzt mit ein paar Freundenirgendwie in Animal Crossing jemand besucht,und es hat einer von den Leuten, die im gleichen Spiel sind,das Menü offen, dann könnt ihr das Spiel nicht mehr verlassen.Exzellent, Nintendo, oder?Ach ja, und wenn dann jemand Rage quittet über Menü,wenn dann jemand übers Menü Rage quittet,verlieren alle, inklusive der Host der Session,jeglichen Progress, der gemacht wurde.Das ist wirklich exzellent, Nintendo-Taktik.Huge, da hat Nintendo mir die ganze Arbeit geleistet,was das angeht. Mir leuchtet es auch nicht ein,wie es Nintendo so krass verkacken kann,über drei Konsolengenerationen hinweg.Das leuchtet mir nicht ein, wie das geht.Das ist ja auf der Wii, das war zu Zeiten von der Xbox 360,also schon nach der ersten Xbox, das war zu Zeiten von der Xbox 360und der PS3, da war der Online-Modus schon scheiße.Und da hat man sich gedacht, okay, das ist die erste Online-Konsole,so richtig von Nintendo, da müssen die erstmal was draus lernen.Gut, Wii U kam raus, Online-Modus war zum größten Teil auch scheiße.Switch kommt raus, Online-Modus zum größten Teil auch scheiße.Was macht Nintendo denn? Wie unfähig kann man sein,im Jahr 2020 ordentliche Online-Funktionen zu basteln?Man muss doch gar nichts bahnbrechendes Neues machen.Man muss einfach nur den Mist nachbauen,den die anderen schon gemacht haben.Das heißt, wenn man keinen Plan hat, was man machen soll,dann klaut man es einfach von Microsoft und Sonyund irgendwelchen x-beliebigen anderen Online-Diensten.Dann klaut man es einfach.Dann braucht man auch keine Splatoon-App,in der man nicht mal Squats bilden kann oder sonst was.Dann guckt man sich es einfach ab.Aber Nintendo ist absolut unfähig, was online angeht.Was ist eigentlich aus Arms geworden, ihrem E-Sport-Competitive-E-Sport-Game?Nee, das ist was anderes.Arms League? Hä?Das ist ein Ingame-Kram.Das ist ein Ingame-Kram, das hat nichts mit echten Sachen zu tun.Also sie wollten ja mal hier einen richtig krassen E-Sport starten in Arms.Das hat halt nicht funktioniert, wahrscheinlich weil der Online-Modus scheiße ist.Also was wurde denn alles bei Nintendo geleakt?Nintendo, A Network, Aldi, also alles.Im Prinzip alles, was drin ist.Oh, Geschlecht.Was ist, wenn da ein anderes Geschlecht drin ist,als ich mich jetzt gerade fühle?Oh, Nintendo-Anzeige ist raus.Du bist toll.Das ist schön, wenn du das so siehst.Vier Monate in Folge abonniert, nice.Danke schön für den Sub.Makes no sense, Dota.Hyper-Subscriber.Mich würde interessieren, die meisten anderen veröffentlichen auch ein bisschen was zu.So, wie ist es dazu gekommen?Was war?Okay, Dear Customer.Ah, excellent.Wir können uns die japanische Stellungnahme angucken.Ich weiß noch nicht mal, mit welcher E-Mail-Adresse ich überhaupt meinen Nintendo-Account verknüpft habe.Oh, Beste hier.Oh, Beste hier.Ja, muss ich nachher noch mal gucken nach meinem Nintendo-ACC.Verknäher, aber ja.Guck mal, jetzt ist wieder komplett lack-free.Lack-Fryer.Ja, Knäher-Beer.Ja, ich wollte eigentlich nicht mehr drauf kommen, auf das Ganze, nur weil ich euch mal kurz noch mal meine Maske zeigen wollte.Die werde ich dann vielleicht am Montag einweihen.Ich gehe Montag auf die Bank und heb Geld ab.Mal gucken, ob die mich mit der Maske reinlassen.Na, eigentlich waren wir mal am Fragen beantworten.Wir kommen ja gar nicht hinterher, irgendwas zu machen heute.Hör mal auf, mit dem Thema, da sag ich nichts zu.Was? Hä? Um was geht's?Ich hab keine Ahnung, auf was sich diese Frage bezieht.Ach, Kim dort, komm. Was? Der ist bei Knossi dabei.Okay, irgendwie passt das zusammen.Irgendwie passt das sogar gut zusammen.Irgendwie, irgendwie passen die zusammen, ich weiß nicht.Was?Was?Nee, kein Overwatch mehr.Das hatten wir alle schon.Das hatten wir alle schon.Das hatten wir doch alle schon.Hatten wir alle schon.So, sind wir durch.Ich wollte euch mal was cooles zeigen, was ich gefunden hab.Was wir in einem der nächsten Streams ausprobieren müssen.Zwar hab ich für meine Microcontrollers was gefunden.Und zwar, es gibt irgendjemand, der hat sich hingesetztund hat eine.NET-Implementierung für ESP32 gebastelt.Das wollte ich mal ausprobieren in einem der nächsten Streams.Da kann man wohl die meisten normalen.NET Klassenund sie scharf verwenden, um einen ESP32 zu programmieren.Da bin ich mal gespannt, ob das gut funktioniert.Weil ich hatte heute wieder viel Spaß mit C++.Ich geh immer schon wieder mega auf den Keks.Ich hab mir überlegt, ob ich will einen Stream anmachenund mich ein bisschen auskotze.Aber ich kann nicht jedes Mal einen Stream machen,wenn mich C++ nervt.Weil dann müsste ich ja quasi viermal im Streamund mich permanent über C++ aufregen.Das will ja auch keiner sehen, dass ich michganz zeitaufrege.Du wolltest doch mit uns eine neue Programmiersprachedemnächst lernen.Ich hab gesagt, wir gucken uns maldieses Cobol-Handbuch an da.Also just for fun, machen wir ein paar kleine Cobol-Sachen.Da werd ich aber auch kotzen bei.Das weiß ich jetzt schon.Wir hatten doch letztens so Learn Cobol.Wo hatten wir es denn?Muss ich meinen Browser mal wieder updaten?Ah, exzellent.Browser updaten.Irgendwie hab ich es nicht mehr in der History.Aber ich hab es mir gebookmarktin meiner To-Do-Liste,was wir im Stream machen wollen.Eine Woche lang C++ Railstream wäre okay.Ich hab heut wieder was gelernt,was mich wieder komplett an C++hat zweifeln lassen.Und zwar wollte ich versuchen...Ich zeig's euch, wir haben sie hier noch auf.Hier, guckt mal.Das ist hier der Callbackfür den Upload von Updatesübers WLAN.Und das wollte ich in eine Klasse packen.Und dann hab ich festgestellt,dass man Funktionen,also Methoden einer Klassein C++nicht als normaleCallbacks für C-Funktionenverwenden kann.Und ich dachte,warum war das...Ich kann die Scharp-Funktionenals Callbacks für C verwenden.Warum kann ich keine C++-Methodenals Callbacks für C verwenden?Das ist dann wiederrichtig schwer getan.Und dann suchst du ein paar Stack-Overflowdanach und kriegst wieder 20 SeitenTemplates als Lösung geschickt.Tim ist die BSF, mir ist auch langweilig.Ja, dann exzellent.Das ist hier richtig. Wir können uns zusammen langweilen.Empfehlung für externeFestplatte für Backups.Wie willst du das machen?Willst du eine externe Festplatte haben, die du einfach per USBdranstöpselst? Oder willst du irgendeinNetzwerklaufwerk haben?Was meinst du mit Callback?Sowas hier.Also sprich, die Funktion wird aufgerufen,wenn sich irgendwie einer auf dieUhr unterupdate verbindet. Da wird die Funktionaufgerufen und das Updatewird durchgeführt. Das ist halt einCallbackin diese Funktion.Die Funktion wird dann aufgerufen, wenn es so weit ist.Das geht nicht.Ganz simpel, per USB.Nee, habe ich jetzt keinen speziellenTipp, aber was vor einerZeit, deraufwas war das?Data Horder.Das ist manchmal ganz interessant zu lesen.Das sind dann Leute, wo irgendwieihre 5 petabyteWebcam-Sammlung haben oder so.Kennt ihr noch den Typ, derAmazon Unlimitedauch wirklich Unlimitedgemacht hat?Wie der das gemacht hat?Das habe ich euch glaube ich schon mal erzählt.Als Amazon Unlimitednoch wirklich Unlimited war,wollte halt irgendein Typ,ich sage gleich was zur Festplatte,wollte irgendein Typ das Ganzetesten, ob das wirklich Unlimited ist,was Amazon da sagt.Und was hat er gemacht? Er konnte ja schlechtpetabyte oderterabyteweise Daten hochladen.Funktioniert ja nicht.Bist du Amazon voll geladen, hast du über deinenDSL Anschluss, ist ja schondie Welt zu Ende.Und dementsprechend ist er hergegangen, hat sich gedacht,was gibt es im Internet denn massig?Und da ist er auf Porn gekommen.Und da hat er wasprogrammiert auf irgendeinem Server mit einer schnellenAnbindung, der versuchthat, jeglicheLivecamGrills mitzuschneiden undbei Amazon hochzuladen.Auf allen möglichenLivecam Seiten hat erdie Sessions mitgeschnittenund hat sie bei Amazon hochgeladen.Und Amazon war wirklich Unlimited.Amazon hat das nicht gelöschtund hat ihn nicht geblockt oder sonst was.Ich persönlich gehe ja davon aus,dass die Amazon Adminsdasgut fanden und ihn deswegen nicht gebannthaben.Die haben wahrscheinlich gedacht, endlichhaben wir hier was zu tun, wenn wir die ganzeZeit auf unser Monitoring gucken und nichts passiert.So.Was wollte ich jetzt sagen? Festplatte.Genau, hier bei Dataorder habe ich letztens was gesehen.Externe Festplatten, wo man diewobei dasist jetzt eher interessant, wenn mansich in Last bauen will, externe Festplatten,die man günstiger bekommt, als die Festplatte,die drin ist. Klingt jetzt erstmalmerkwürdig, aber war so.Also sprich, es gab externeLaufwerke,die günstiger waren, alsdie Festplatten, die drin waren. Und da konnteman sich wunderbar die Platten rausrippen.Wäre vielleicht auch für dich eine Option,wenn du schon einen USB-FestplattenWechselrahmen oder sowas hast.Aber ansonsten,jetzt wirklich ein Tipp,für eine USB-Festplatte habe ichehrlich gesagt nicht.Aber ich glaube, man kann daehrlich, ich glaube, man kann da auch gar nichtso viel verkehrt machen.Ich würde einfach nur gucken, was geradedie günstigste Terabyte zu Cent istund mir davon was kaufen.Was Funktionen im Konstrakteund dir fehlt der Rückgabewert oder wie?Was?Hast du dir schonDiret X 12 Ultimateangeschaut? Nee, ich wusste gar nicht, dass es von3D-Frameworks jetzt auchUltimate Editions gibt. Wann gibt es denn Diret XSeason Passoder so?Ja, genau, Sebaro, sowas.Der Sebaro hat mal wieder hierden Link am Start.Genau sowas hier.Wie sehr sich das jetztlohnt, weiß ich nicht. Muss man mal sich genau angucken.Aber da gibt es ab und zu malAngebote. Da sind die externen Festplatten günstigerals das, was drin ist. Und mankriegt, man spart dann irgendwie 30 Euro am Endeoder so.USB-Festplatteist viel zu langsam. Nö, wenn man USB...Also alles ab USB 3 isterträglich.Und jetzt kommt mir nicht mehr dieDiskussion, was jetzt für ein USB 3.3.0, 3.1, 3.2,Gen 2x2,Gen 2x1, Gen 2x3,3x1.Alles ab USB 3.Alles, was einen blauenStecker hat, ist okay.Frag nicht, was für USB. USB 3.2,Gen 2x2.Nee, es ist USB 3.2,Gen 2x2. Ich glaube dasGen 2 kommt an der Stelle weg.Es gibt ja auch USB3.2,Gen 1,2x1.Ich habe da mal irgendwann ein Video drüber gemacht,dass das USB-Cremiumabsolut Dachschadenhat, wasdie Benahmung angeht und anscheinendhaben es mittlerweile auf 50.000 Leute geguckt.Okay, nice.Haben mir 50.000 Leute zugehört,fühle ich mich über das USB-Forum aufregelt.Ich glaube, dass das USB-Forumund das C++-Cremium,dass da große Überschneidungen sind,was die Leute angeht.3K-Likes und reinauf 50.000 Likes.Was soll ich heute machen?Außer euch mit sinnlosensinnlosen Emotes voll zu spammen.DirectX 10 Ultimate.Was ist DirectX 12 Ultimate?Na, dann Java im Leben nicht.Nee, nee, nee, C++ war ich heute immer.Announcing DirectX12 Ultimate.Das ist ein April-Scherz.Nee, ist es nicht.We are beyond pleased.Oh, das klingtja mal wieder.Auf meine Ideen ist,ich habe meine Notizen nicht gesunken.Ich sehe sie gerade nicht.Also im Prinziphätte man das Ganze auch13 nennen können, oder?Aber Microsoft hat es jamit Benamen nicht.Übrigens noch mal eine richtige Pepega-Sache,was Microsoft-Benamung angeht.Die hatten ja früherdas ganz normale.NET-Framework.Das ist ja deprecatedim Endeffekt und jetzt gibt es ja.NET Core.So, und Microsoft hat sich jetztüberlegt, sie hatten jetzt.NET Core1.1.1.2.2.1.3.Also immer.NET Core.Alles gut von der Benamung her.1.0.1.2.0.2.1.2.2.3.0.3.1So, und das nächste ist.NET5.Die lassen das Core wieder weg.Und dann ist es jetzt.NET 5.Was übelst verwirrend ist, weil das.NETFramework war, die letzte Version,4.8.Und.NET 5hat mit dem.NET Framework4.8 nichts zu tun.Und auch im Prinzipist.NET 5 der Nachfolgervon.NET Core 3,wo man das Core aber weglässt.Und wo es noch verwirrender wird, istihr Datenbank-Zugriffs-Framework.Das heißt ja aktuell Entity Framework Core.Immer mit der gleichen Versionwie.NET.Also sprich aktuell heißt esdann Entity Framework Core 3.Und dann haben sie sich jetztüberlegt, sie nennen das dannin.NET 5, nennen sie das dann auch wiederEntity Framework 5.Und der Witz ist, dass dasganz, ganz alte EntityFramework im alten.NET Framework hieß 6.Das heißt wir haben.NET 5, was mit.NET Framework 4.8 nichtszu tun hat. Und wir haben EntityFramework 6, wir habenEntity Framework 5, wasjetzt nach Entity Framework6 rauskommt, aber neuerist und auf anderer Sache basiert.Was ist mit Microsoftlos?Die haben sie nämlich alle, wasdas angeht. Wie bescheuert kann man eigentlichsein?Was soll man von einer Firmaerwarten, die Windows 9 übersprungen hat?Naja, dass man Windows 9übersprungen hat, wenigstens ging esaufwärts mit der Zahl.Und nicht wie bei Battlefield von 4 auf 1.Ist doch alles voll logisch.Also wer das logisch findet, findet auch die BattlefieldBenamung logisch und die Xbox Benamunglogisch.Aber das ist wirklich, das istkomplett, einfach nur totalhängen geblieben.Guck mal, was Heise dazu schreibt.Ultimate.Ok, das ist im Prinzip, im Prinzipscheint es wahrscheinlich, Dialog X 12.1oder sowas zu sein.Gut, da kann ich nichts zu sagen.Wie gesagt, ich sag's ja jedes Mal,ich bin nicht der großeGrafikprogrammierer.Das Einzige, was ich mal in 3D gemachthab, was man 3D,nur einsatzweise 3D nennen kann,ist die T-Kanne in OpenGL,diese Standard, die Standard T-Kanne,den Standard Teapot in OpenGLeinmal zu rendern.Mit Rust.Ich hab mir ein Rust OpenGL Tutorial angeguckt.So die Standard,Standard T-Kanne,die kennt glaube ich jeder, der ein bisschenwas mit Grafik Sachen gemacht hat,die Standard T-Kanne.Ich weiß auch nicht, warum,warum ausgerechnet eine T-Kanne.Keine Ahnung.Und ansonstenhab ich mit Dialog X eigentlich nur 2DSachen gemacht.Video rescalenund so Sachen, abernieirgendwelche großartige3D-Programmiergeschichten.Und was ist mit 0.3D?0.3D ist, ich weiß,es ist schwer zu glauben,aber 0.3D ist bloß eine Illusion.Das ist gar nicht wirklich 3D.Schau dir mal die Proposalsfür C-Sharp 9 an,das ist eine gute Idee.Oho!Das ist,das, das machen wir,das machen wir wirklich mal.Ähm,das ist eine gute Idee.Gerade mal kurz gucken, dass ich keine Fragenüber sehen hab.Ich glaube in der Seite haben sie wahrscheinlichSachen drinnen.Steht doch hier, hier, Candidate für 9.0.Bei C-Sharp geht's wenigstens.Da heißt der Kram wenigstensimmer aufsteigend.Brauchst du ein Clear All?Tatsächlich, aber ich hab keinen Bockdas Programm mehr anzufassen.Per zu wechseln, ne.Wieso ist C++die beste Programmiersprache?Das ist, also, das ist so offensichtlicherGebate.Da geh ich nicht drauf ein.Ne,hab ich nicht. Ich warte bis es auf den PCkommt, dann vielleicht.Hast du schon Abend gegessen? Ja, hab ich.Hab ich schon ganz am Anfang erzählt.Ich hab den ganzen Tag nichts gegessenund Abend erst mal 6 Toastbrote.Huge, gesunde,wahnsinnig gesunde Toastbrote.3x Nutella, 3x Erdnussbutter.Hast du ein Laptop favorit mit Linux?Hm.Ich hab nur auf den Notebooks das ganzeausprobiert, die wir auf der Arbeit haben.Ich hab ja privat seit Jahren schon kein Notebookmehr. Ich habeinen alten AMD Notebook,das ist aber schon 10 Jahre alt oder so.Da ist auch noch ein Ubuntu, frag mich nicht,1404 oder sowas drauf.Oder noch 1204 odersowas.Undauf der Arbeit haben wirLenovo Thinkpads.Da funktioniert's wunderbar.Du kannst mein Tool nichtcrashen.Das eskept ordentlich.Und es haben wir auch schon versucht,Leute zu injecten und sonst was.Ich hab ordentlich eskept.Funktioniert nicht.Ganz ein mächtigeren Twitch Chat Hacker hier.Hacker Mans.Hotkey zum Desktop wechseln.Steuerung, Windows,File, äh äh,Windows-File-Taste.Doch, Patrick,ISC eskept mit Sicherheit das Meiste.Garantiert.Ok, also, C Sharp 9 Proposals.Was haben wir da so zu bieten?Ok, ich lese mir jetzt nicht dieOriginalsachen durch, weil da sind wirlange beschäftigt. Wir gucken unsdie Zusammenfassung an.Was? Diskriminierte Vereinigung.Was ist da los?Microsoft Anzeige ist raus.Ok, also, Records.Was gibt's an RecordsNeues?Er ist anscheinend ganzaußer sich, dass das ein ganz tolles neuesFeature ist.Wat?Ok, der Artikelist ein bisschen wehgeschrieben. Gucken wir uns malCode an. Recordwould be Public Class.Warumnehme ich da nicht einfach einen Struct?Wenn ich sowas haben will?Weil man esRead-Only haben will, oder was?Keine Ahnung, was das mir sagen soll.Checker nicht.F-Sharp kommt jetzt.Jetzt wollte ich es aber wissen.Das ist mir zu abstrakt.Ich will mal irgendwie ein paar ordentlicheTargetar-Oh, was ist das?Neue Operators sind immer gut.Neue Operators sind immer gut.It's, was?A low implicit conversion from null?Was?Was?Ok, was? Moment, was macht das?Ah, heißt das, neheißt das wenn, das gibt's doch schon.Das, gibt's dasnicht schon?Oder bring ich das jetzt durcheinander?Oder ist das JavaScript, wo es das schon gibt?Gibt's das nicht schon?Also im Prinzipist das wahrscheinlichwenn die Listenull ist,dann legeine neue Liste an.So verstehe ich das jetzt.Also sollte es-Ach nee, hier unten ist das Beispielfür C-Sharp 9.Ah, ok,man kann jetztdas Initialisieren kürzer schreiben.Das ist cool.Was? Ok, das kann manverkürzen zu so?Oh, das finde ich auch ganz nice.Weil das Handlingvon KeyValue hat sich schon immer ein bisscheneklig angefühlt.Schau dir mal Parameter Null Checkingan. Steht das hier drinnen?Gucken wir mal, C-Sharp 9.Ganz unten?Ja, gut, da kommen wir gleich noch dazu.Ok, das ist ganzpraktisch, finde ich.Man hätte aberauch, hätte man nicht einfachhätte man das nicht einfach noch kürzermachen können?Dass man das einfach weglässt?Dass man so die Ruby Syntax nimmt?Ähm, quasisowas hier in der Richtung?Wobei, das wäre wahrscheinlich kollidiertmit der Lambda Syntax.Ich glaube, das hätte nicht so gutfunktioniert.Ja, wahrscheinlich doch so istähC-Sharpiger.C-Rautemäßiger.C-Hashtag.Ne.Ok, das istgewöhnungsbedürftig erstmal.Das ist mir jetzt zu lang, da platzt mein Kopf.Das kriege ich nicht verarbeitet gerade.Aber das finde ich cool hier.Da kann man sich halt sparen, dass manjetzt schreibt New Point.Schreibt man einfach Newund der checkt, was man für eineKlasse haben will, mit dem jeweiligenpassenden Constructor, weil hieraber was wahrscheinlich nicht gehtwas wahrscheinlich nicht gehtist dann das hier, ne?Das wirdwahrscheinlich nicht gehen.Weilwoher soll er wissen, was es ist?Das wäre natürlich hier Trick 17übelst Magic, wenn das irgendwiegehen würde, aber ich wüsste nicht, wie dasfunktionieren soll.Caller Expression Attribute. Was?Das ist bestimmt für irgendwelcheDebug-Zwecke, dass man sieht, wer wowas aufgerufen hat.Äh, ich glaube Feature habe ich noch nieverwendet bisher.Das hier.Ach, ich glaube, ich habe noch nicht einmal probiert.What?Public Ref Partial StructHaben wir das hier?Public Ref Partial StructHabe ich auch noch nie verwendet?Ich sehe, ich muss malmit den neuen C Sharp Featuresbeschäftigen.Ich habe irgendwie die meisten davon noch gar nichtbenutzt.Das letztemassiv hilfreichesC Sharp Featurewar für mich der hier.Dieser NullCheck Operator hier, keine Ahnung.String, was auch immer,Punkt, blub.Der dann checkt, ob das Null ist.Das fand ich schonecht hilfreich.Das war das letzte richtige, wo ich gesagt habe, oh geil,das bringt richtig was. Die neuePattern-Matching-Geschichte war auch cool.Erklär dasFragezeichen, Fragezeichen.So wie ich das verstanden habe, istFragezeichen, Fragezeichen. Also wenn ich hiersowas habe.Noch mal kurz Zwischen Studio Codeauf.Neu.Stellen wir das Ganze mal aufC Hashtag.Also wenn ich hiersowas habe,irgendeine Liste,eine Liste,irgendeine Liste,irgendeine Liste,so unddie will ich zuweisen.Oder ich will irgendeine Variable zuweisen.Also Temp.Ich habe eine Listeund die Liste ist Null.Dann nimmt er das, was auf der rechten Seite steht.Also quasi hier sowas.Wenn ich das richtig verstehe.Ich hoffe, dieser Tag ist richtig.Also der guckt dann quasi, obdie Liste Null ist.Was interessant wäre, ist, ob die ListeNull oder leer sein kann.Wahrscheinlich muss hier wirklich Null sein.Also sprich, der guckt, ob die ListeNull ist. Und wenn die ListeNull ist, macht er eine neue default Liste.Ich hätte wetten können, das gab es schon.Ja, das ist ganz praktisch.Parameter Null Checking.Ist das das, was ich mir angucken sollte?Oh!Das ist, glaube ich, ganz cool.Hello, simplifyingStandard Null ValidationDas ist cool!Das ist super!Das ist super!Das ist cool!Das gefällt mir!Das gefällt mir!Gerade jetzt,wo siedas Featureeingeführt haben, dass man...Wow, fuck, wo bin ich jetzt?Da sie mit der letztenC Sharp Version eingeführt haben,dass, wenn man Opt-inist aufNull, dass mandann hier was angezeigt kriegt, wenn man es nicht gekennzeichnet hat.Das finde ich cool.Das finde ich echt nice. Das gefällt mir.Weil man muss sonstso viele unsinnige Null Checksmachen. Im Prinzip ist ja unter der Haubealso man könnte sagen, ist kein großer Akt.Es steht dann explizit da.Und explizit ist ja eh besser, weil man kann es sehen.Aber das ist auch explizit,wenn man weiß, was es macht. Das finde ich cool.Das gefällt mir.Skip Locals in it.Was?Moment, das geht doch jetzt schon.Ach nee!Das ist neu. Ah!Das ist praktisch. Das ist echt praktisch.Ähm, aktuellist es so, wenn ichkeine Ahnung, ich habe eineListe.Ich habe eine Liste.Und ich sag jetzt irgendwie in der Listeähmmachen wir mal Pseudo. Sword.So, dannähmSword ist ein doofes Beispiel.Äh, was gibt's da fürschönes?Ja genau, ich mach Sword.Sword kriegtzwei Parameter.Da muss man glaube ich bisher so machen, wenn manbeides diskaten will.Wenn man jetztdie Werte diskaten will, kann man anscheinendAnderscore, Anderscore machen.Das ist eigentlich, kann man, ja, dasfinde ich eigentlich ganz nett.Wenn das das ist, was ich, wenn ich das so verstanden habe.Prime Sub, der Felix sagtHallo, moin Felix.Huge Sub.Wie stellt zum Beispiel Studio Code dieProgrammiersprecher hier ohne? Da, da gibt's einen Knopf für.Speicher will ichMinecraft nicht.Scheint ein ganznettes Feature zu sein.Attributes onLocal Functions. Äh, ich hab noch nicht einmalLocal Functions verwendet.Finde ich sieht auch echt ekligaus. SoNested Functions in Functions.C++20C++20 ist so einClusterfuck. Ja.C++ allgemein istein Clusterfuck.Wie gesagt, Patrick,ich hab ja vorhin wieder gelernt, wo ich ein bisschen vor dem Streamrumgebastelt hab, dass manähm,Methoden aus der C++Klasse nicht alsFunction Pointer verwenden kann.Also wenn ich hier so OldschoolCallbacks hab, so wie hier,dann kann ich dort nicht einfachähm, nene, ne, ne Klassenmethodereinstecken oder so. Das funktioniert nicht.Weil Klassenmethoden komplett anders implementiertsind, wie so normale C-Funktionen anscheinend.Das funktioniert nicht.NativeInns.Okay, dasweiß ich nicht,wie sinnvoll das ist.In manchen Anwendungsgebieten bestimmt.Stimmt, das gehtnur, wenn sie Static sind, was aberirgendwie doof ist. Dann kann die ganzenKlassenkram auch weglassen.Function Pointers. Uah! Wo was gradhatten davon? Haben die meine Gedankengelesen grad oder was?Haben die grade meine Gedankengelesen? Ich hab grad was von ekligemFunction Pointer in C++ erzählt und jetzthier um die Ecke Function Pointers.Das ist bestimmt gut, wenn man irgendwieC-Interop machen will.Oh, wenn ich sowas schon sehe hier.Das ist wahrscheinlich für Interopmit C ganz praktisch, kann ich mirvorstellen.Ja, sind doch ein paar cooleSachen dabei.Ja, mit dem Ausrufezeichen finde ichdas eine sehr coole Geschichte, das gefällt mirrichtig gut.Was? Primary Constructors, das haben wirbei dem anderen nicht gesehen.Was macht das?Hä?Das ist doch nicht so einfach.Hä?Das ist doch schon immer so.Ah!Oh, cool!Das finde ich, das finde ich nice.Weil oftmals macht man nureinen Constructor, einzig und allein,aus dem Grund,um ein paarParameter zu speichern.Das ist cool.Das ist cool.Das ist nice, das gefällt mir.Ich meine, noch cooler wäre,wenn man gar keinen Constructor mehr bräuchte.Aber dann ist schwierig,welche Properties soll er alsParameter nehmen?Das geht dann nicht. Aber das istpraktisch.Das ist cool, das gefällt mir.Ja, Record Classes habe ichbei dem anderen nicht gecheckt, das war mir zuExpanded, Extended Brain.Bin ich eigentlich der Einzige,der solche Artikel nicht liest, sondernsich nur die Code Samples anguckt?Du hast letztens Go geflammtgegen C-Aufrufen, aber das geht nicht gut.Also das Aufrufen geht halbwegs.Dazu kommt erstens, dass manim Mission Studio Code für Gokomplett breakt, wenn du C-Go verwendest.Und die Performance, das ist auchmein hauptsächliches Problem, weil ich das für jedenFrame aus dem Video mache.Der OverheadzwischenC und Go wechselt.Guck mal hier.170 Nanosekundenpro Funktionsaufruf, Overhead obendrauf.Ich glaube mittlerweile ist es ein bisschen besser, aber das ist der Bits.Aber schön ist es trotzdem nicht,auch die ganze Interop-Geschichte an sichist sehr hakelig.Für einfache Sachen geht es ganzgut, ja. Der Support ist mittlerweileauch bei Goganz okay. Das generiert jabeispielsweise die C-Header-Files,die du brauchst, doch gleich mit.Aber gerade der Performance-Overheadist halt abartig groß.Und was auch ein bisschen kompliziert ist, istdie Qualitätsverwaltung.C-Bindingsfür eine Library, ja wahrscheinlichkönnte ich mir sogar vorstellen, dass das relativ...Das geht einfach, ja das geht einfach.C-Bindings für die Library.Das geht einfach.Da musst du einfach hier drüber schreibenExport, blablub,und schon hast du eineSchnittstellefür C-Zu-Go-Funktion.Das geht einfach, ja.Dafür ist es gut.Aber insgesamtist es scheiße..NET 5 hat auch Java-Interop.Echt?Ja endlich.Ich konnte es kaum erwarten. Wobei das ganz coolist. Also je nachdem wie gutdas funktioniert, ist das wirklich nichtschlecht. Es gibtdoch ein paar Projekte in Java,die vielleicht ganz nützlich sind.Müsste ich mir malanschauen.Und wie machen die das?Exposen die Javaals C-Sachenund rufen das von C-Sharp aus. Und wie machen dieden Interop? Ist der halbwegs schnellzwischen.NET und Java?Müsste ich mir mal angucken.Wenn es rauskommt.Also das fand ich eigentlich ganz nice hier.Das da, das gefällt mir, das Feature.Record Class, das war mir zubig, ist mein Brain gerade zulow, dass ich das checke.Das ist mir auch zu kompliziert gewesen.Aber es waren ein paar coole Sachen dabei.Das mag ichauch an C-Sharp, bzw.an dem Produkt, wie das Microsofthandelt. Oder von den Leuten,die das machen. Das ist ja grad der,das ist irgendein Norweger oder so.Also der Heilsberg war ja ursprünglichder Erfinder. Wie heißt denn der?Der aktuelle C-Sharp. Jetzt heißt er irgendwie Metz.Metz. Und dann irgendwieskandinavischer Name.Und wie die das handeln, finde ich eigentlich ganz gut.Die entwickeln das kontinuierlich weiter,immer so ein bisschen in die Richtung,was halt geradenicht geradehip ist, sondern was sich gerade alssinnvoll rausgestellt hat.Zum Beispiel ist ja C-Sharp deutlich funktionalergeworden jetzt, die letzten zwei Versionen.Mit Pattern Matching, den ganzenLambda Zeug, was dazu gekommen ist.Kommt sich teilweise schonwie in irgendeiner funktionalen Sprache vor.Sebaro kann ein Lied von singen.Ich hab gehört, der muss Haskell in der Unigerade machen.Äh...Patrick...Ich glaub, das krieg ich jetzt nicht aus dem Stegreif hin.Wir können das abermal insgesamt machen. Wir machen einfachnicht FFM-Pack.Wir machen einfach malPrint...Wir counten eins hoch.Go, Lip.Und rufenaus die Sharp auf. Also ich hab das mal ausprobiert.Das macht bei wenigAufrufen nicht viel aus.Ich hatte das malausprobiert. Aber bei...Also wenn's da halt in die Millionen geht, dieaufrufen, macht das was aus. Bei meinem FFM-PackZeug wahrscheinlich nicht.Weil so ein Frame ist halt...Selbst wenn's 30 Frames pro Sekunde sindund das wären 30...Nee, das ist doch gut.Wenn die Funktion kürzer ist, macht die Funktionselbst kaum was und man sieht den eigentlichen Overhead.Bei meinem FFM-Pack Zeugist das eigentlich fast egal. Selbst wennich 30 Frames pro Sekunde hab,bis ich da mal irgendwo in Bereiche komme,wo das relevant wäre,ist...drauf geschissen.Aber mir geht's trotzdem auf den Keks.Ja...Bett durfte ich übrigens nicht beziehen.Google Dark Mode!Haben die da einen Knopf für?Wo geht das?Geht das nur, wenn man eingeloggt ist?Wo machen wir das denn?Ich weiß es nicht.Ich weiß es nicht.Ich weiß es nicht.Ich weiß es nicht.Ich weiß es nicht.Ich weiß es nicht.Wo macht man das?Ich könnte den Darkreader einfachanmachen. Eats.Easy!Na ja.Wisst ihr was Leute, mir war langweilig.Mir ist immer noch langweilig, aber ich gehe jetzt aufWelche seite nutzt du dich um rund ums programmieren auf dem laufe zu halten reddit ich guck ich habe eigentlich allehalbwegs großenprogrammiert subsFür windows linux die schar ja war sogar javascript als möglicheGesappt bestimmt 60 stück oder so da gucke ich halt immer mal so rein was es für neue sachen gibtJavascript ignoriere ich die hälfte fall javascript gibt es jeden tag drei neue frameworks die hip sindDa warte ich immer mal ein bisschen ab was so rauskommtHast du jemals eine winera lizenz ervorfenDer gag ist mittlerweile der gag ist mittlerweile eigentlich outdatedOb es irgendjemand gibt, den ich follow, den ich raussuchen kann aber keiner da der es nötig hätteJa und wir sehen uns morgen frühMorgen früh bin ich ja wie gewohnt wieder am startZum sonntaglichen aufwach strebenDen gibt es ja schon seit zwei jahren jeden sonntagJa ich weiß kong hat sich angeblich eine winera lizenz gekauftAlso wir sehen uns bis morgen machts gutSee youWollt ihr noch autosong oder geht es ohne mit naja gutBis morgen früh coUndUndUndUndUndUndUndUnd", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Nice!"}, {"id": 2, "start": 30.0, "end": 31.0, "text": "Woah!"}, {"id": 3, "start": 31.0, "end": 59.0, "text": "Wood Face!"}, {"id": 4, "start": 59.0, "end": 70.28, "text": "Hoffentlich pendelt sich das jetzt ein klei."}, {"id": 5, "start": 70.28, "end": 83.64, "text": "Naja, jetzt gehts anscheinend."}, {"id": 6, "start": 83.64, "end": 85.88, "text": "Wo davon ist so ein Kackladen, Alter?"}, {"id": 7, "start": 85.88, "end": 91.68, "text": "Ah, das gibt's nicht!"}, {"id": 8, "start": 91.68, "end": 117.08, "text": "Ich hoffe das backt jetzt nicht wieder übelst rum."}, {"id": 9, "start": 117.08, "end": 123.28, "text": "Wir brauchen auf jeden Fall irgendwann noch mal ein Kack-Woder von Emote."}, {"id": 10, "start": 123.28, "end": 132.28, "text": "Oh, ihr seid ja schon am Start hier, der Michael 50 Billion ist am Start, der Patrick"}, {"id": 11, "start": 132.28, "end": 141.2, "text": "ist am Start, Moonbeard Desmond am Start, der U-Mode auch wieder, Credo ist da, Conti"}, {"id": 12, "start": 141.2, "end": 158.8, "text": "Attacks, Galaga, Somniac Dude, Remember Wookiee, jetzt kommen alle, alle kommen an den Start."}, {"id": 13, "start": 158.8, "end": 162.04, "text": "Sieht gut aus, also anscheinend spackt es jetzt nicht rum, es hat bloß initial einfach"}, {"id": 14, "start": 162.04, "end": 167.2, "text": "mal gar nichts funktioniert, ein paar Woder von Gravidda, schauen wir mal, fastest du?"}, {"id": 15, "start": 167.2, "end": 171.32, "text": "Okay, warum sollte ich fasten?"}, {"id": 16, "start": 171.32, "end": 176.36, "text": "Ostern ist ja schon lang vorbei, also das ist ja das wo die meisten, ach ist es Ramadan"}, {"id": 17, "start": 176.36, "end": 177.36, "text": "oder sowas?"}, {"id": 18, "start": 177.36, "end": 189.4, "text": "Naja, ich hab's mit keiner Glaubensrichtung, also wer da an Sachen glauben will, kann das"}, {"id": 19, "start": 189.4, "end": 193.28, "text": "ruhig machen, aber ich nicht."}, {"id": 20, "start": 193.28, "end": 200.56, "text": "Fast, ich hab grad 6 Stücke Toastbrot gefressen, weil ich den ganzen Tag sonst nichts gefordert"}, {"id": 21, "start": 200.56, "end": 201.56, "text": "hab."}, {"id": 22, "start": 201.56, "end": 211.68, "text": "Und dann auch noch wahnsinnig, wahnsinnig gesunde Toastbrotmischung, nämlich 3 Stück"}, {"id": 23, "start": 211.68, "end": 213.04, "text": "Nutella, 3 Stück Erdnussbutter."}, {"id": 24, "start": 213.04, "end": 224.84, "text": "Du frierst eine vor allem ein, bist du voll, warum soll ich die nicht einfrieren?"}, {"id": 25, "start": 224.84, "end": 227.08, "text": "Wäre doch bescheuert, eh mal neu zu starten, oder?"}, {"id": 26, "start": 227.08, "end": 234.08, "text": "Uiuiui, da ist aber ganz schön viele, ganz schön viele Sachen übrig, Anfragen, muss"}, {"id": 27, "start": 234.08, "end": 245.88, "text": "man sich das gleich mal kurz angucken."}, {"id": 28, "start": 245.88, "end": 247.36, "text": "Glaubst du an die Progasgürteln?"}, {"id": 29, "start": 247.36, "end": 248.36, "text": "Gürteln?"}, {"id": 30, "start": 248.36, "end": 253.24, "text": "Ich muss mal den Chat neu laden, irgendwie hängt's bei mir, was soll das dann sein?"}, {"id": 31, "start": 253.24, "end": 259.36, "text": "So, jetzt, es funktioniert."}, {"id": 32, "start": 259.36, "end": 275.28, "text": "Moin, Captain Seekai, soll mal schnell hier im Schnelldurchgang mal die ganzen Questions"}, {"id": 33, "start": 275.28, "end": 276.28, "text": "abhaken."}, {"id": 34, "start": 276.28, "end": 279.96, "text": "Ahjaja, Moment, warum spakt das rum?"}, {"id": 35, "start": 279.96, "end": 293.32, "text": "Äh, ist meine Abfrage fail im Frontend, dass ich gar nicht alle Sachen abfrage, sondern"}, {"id": 36, "start": 293.32, "end": 294.32, "text": "nur 100 oder so?"}, {"id": 37, "start": 294.32, "end": 302.76, "text": "Würdest du, wenn du die Wahl hättest, oh das ist eine interessante Frage, würdest du"}, {"id": 38, "start": 302.76, "end": 305.2, "text": "wenn du die Wahl hättest, Schule, mal Ausbildung in Informatik machen?"}, {"id": 39, "start": 305.2, "end": 310.96, "text": "Hm, gut, der Coding Niklas ist wahrscheinlich jetzt nicht da, weil ich nicht weiß von wann"}, {"id": 40, "start": 310.96, "end": 316.24, "text": "die Frage ist, wahrscheinlich vom vorletzten Stream oder sowas, das kann man so pauschal"}, {"id": 41, "start": 316.24, "end": 317.92, "text": "finde ich gar nicht, gar nicht sagen."}, {"id": 42, "start": 317.92, "end": 328.32, "text": "Es kommt drauf an, wo dein Schwerpunkt ist, also wenn du die ganzen theoretischen Kramen"}, {"id": 43, "start": 328.32, "end": 336.2, "text": "wissen willst, oder vielleicht auch später, ja was gibt's da eigentlich theoretisches"}, {"id": 44, "start": 336.2, "end": 348.24, "text": "Data Science, keine Ahnung, machen willst, dann ja, aber man muss sagen, die meisten"}, {"id": 45, "start": 348.24, "end": 351.92, "text": "Leute die Informatik studiert haben, landen dann irgendwann auch ganz normal in irgendeinem"}, {"id": 46, "start": 351.92, "end": 357.0, "text": "Programmiert Job oder sonst wo, ein paar machen wahrscheinlich irgendwelche akademischen"}, {"id": 47, "start": 357.0, "end": 362.4, "text": "Sachen, aber die meisten eher nicht, im Durchschnitt wirst du, wenn du studiert hast, trotzdem"}, {"id": 48, "start": 362.4, "end": 369.28, "text": "ein bisschen mehr verdienen, das wars jetzt aber über die Stelle, die du dann speziell"}, {"id": 49, "start": 369.28, "end": 379.08, "text": "das auch nicht viel aussagst, Compilerbau, exellent, Compilerbau, ja ich glaub die wenigsten"}, {"id": 50, "start": 379.08, "end": 385.12, "text": "Leute sitzen wirklich am Compilerbau, Moment warum ist die Frage jetzt weg, hab ich die"}, {"id": 51, "start": 385.12, "end": 401.52, "text": "raus für den gelöscht, oder, ok ich glaub wir müssen, wo fangen wir jetzt am besten"}, {"id": 52, "start": 401.52, "end": 407.04, "text": "an, mein, mein, mein Fragen Board ist kaputt, das zeigt Fragen in komischer Reihenfolge"}, {"id": 53, "start": 407.04, "end": 415.28, "text": "dann, was hältst du eigentlich vor Lutris, also vor dem Linux Gaming Launcher, ja das"}, {"id": 54, "start": 415.28, "end": 421.04, "text": "ist nicht schlecht, leider gibt's halt unter Linux so wenig Spiele, also die wirklich ordentlich"}, {"id": 55, "start": 421.04, "end": 428.8, "text": "supporten, die man ohne Beine ausreißen ordentlich zu laufen kriegt, es wird immer besser, aber"}, {"id": 56, "start": 428.8, "end": 433.48, "text": "solang es da keinen offiziellen Support gibt wird das nie gut werden, zumal man alle Spiele"}, {"id": 57, "start": 433.48, "end": 439.48, "text": "mit Anti-Cheat eh vergessen kann, das ist das Problem, es gibt auf YouTube so viele Videos,"}, {"id": 58, "start": 439.48, "end": 443.6, "text": "Linux die bessere Gaming Alternative, was eigentlich, was denn, natürlich ist im Vergleich"}, {"id": 59, "start": 443.6, "end": 448.64, "text": "zu Windows, Linux auf keinen Fall die bessere Gaming Alternative, kommt heute nix, ich weiß"}, {"id": 60, "start": 448.64, "end": 455.64, "text": "ja nicht was wir heute machen, keine Ahnung, ich muss erstmal fragen, wahrscheinlich nicht,"}, {"id": 61, "start": 455.64, "end": 458.56, "text": "aber ich kann euch mal erzählen was ich mir aufgeschrieben hab, was man alles machen kann,"}, {"id": 62, "start": 458.56, "end": 463.76, "text": "ne kann ich nicht, weil ich hab meine Notes nicht gesyncht vorher, aber ein paar Sachen,"}, {"id": 63, "start": 463.76, "end": 468.16, "text": "ich hab nämlich was cooles gefunden, das gucken wir uns demnächst an, so, was macht"}, {"id": 64, "start": 468.16, "end": 472.48, "text": "man denn, was macht denn ein ITler vor Ort, Windows Pass, ok da weiß ich jetzt nicht"}, {"id": 65, "start": 472.48, "end": 482.48, "text": "mal was ich das bezogen hat, nein war ich noch nie, ich war schon ein paar Mal eingeladen,"}, {"id": 66, "start": 482.48, "end": 488.64, "text": "hab aber noch nie in die USA gefahren, keine Ahnung wie es da ist, ah da haben wir anscheinend"}, {"id": 67, "start": 488.64, "end": 494.0, "text": "Barbecue Pit Boys geguckt, oh das ist ja ewig her, das Stream, das kann ich jetzt alles mal"}, {"id": 68, "start": 494.0, "end": 511.84, "text": "löschen, so, ähm, hast du morgen eigentlich arbeiten, ich wusste wahrscheinlich, ja, ja"}, {"id": 69, "start": 511.84, "end": 515.8, "text": "was, das ist auch sowas, du solltest mal ein Video machen, in dem du den Leuten erklärst,"}, {"id": 70, "start": 515.8, "end": 520.48, "text": "dass es wichtiger ist zu googeln und zu suchen zu lernen, als alles andere beim Programmieren,"}, {"id": 71, "start": 520.48, "end": 527.0, "text": "ja das ist so, weiß nicht ob ich da ein Video drüber machen sollte, ähm, das ist in fast"}, {"id": 72, "start": 527.0, "end": 531.76, "text": "jedem Beruf wo es um Technik geht heutzutage fast das wichtigste, dass man ordentlich suchen"}, {"id": 73, "start": 531.76, "end": 536.8, "text": "kann und ich sehs bei uns ja, ähm, wenn ich mir da die Leute anguck, die jetzt gerade"}, {"id": 74, "start": 536.8, "end": 539.92, "text": "Homeoffice machen, vor allem die die schon ein bisschen älter sind, das ist jetzt kein"}, {"id": 75, "start": 539.92, "end": 545.0, "text": "Flame, gegen ein bisschen ältere, weil es gibt auch genug die das hinkriegen, aber gerade"}, {"id": 76, "start": 545.0, "end": 553.28, "text": "die, die halt so, äh, aus Zeiten von Handbüchern, Handbücher lesen und, und, äh, Kobold und"}, {"id": 77, "start": 553.28, "end": 558.08, "text": "Lochkarten, ne, also, die können ruhig schon ein bisschen jünger sein, ähm, aber Leute,"}, {"id": 78, "start": 558.08, "end": 563.68, "text": "es gibt, es gibt ja welche, die, ähm, die finden das als Niederlage wenn sie googeln"}, {"id": 79, "start": 563.68, "end": 566.92, "text": "müssen, so nach dem Motto, oh fuck, ich weiß es nicht, krieg es nicht alleine raus, ich"}, {"id": 80, "start": 566.92, "end": 570.08, "text": "muss googeln, aber es ist viel einfacher, gerade in der heutigen Zeit wo es Seiten wie"}, {"id": 81, "start": 570.08, "end": 574.0, "text": "Stackoverflow gibt, ist das viel effektiver was zu googeln anstatt seine 3 Stunden selbstraum"}, {"id": 82, "start": 574.0, "end": 575.0, "text": "zu probieren."}, {"id": 83, "start": 575.0, "end": 580.72, "text": "Ich, mich würde mal interessieren, dass, ey, ich hab ne richtig geile Idee für ein Video"}, {"id": 84, "start": 580.72, "end": 585.8, "text": "bzw. für ein Stream, aber ich weiß nicht wie wir das machen, und zwar, ähm, oh, Danny,"}, {"id": 85, "start": 585.8, "end": 593.72, "text": "Void Danny Twitch Prime 8 Monate, huge, das ist ja schon, das ist weder, noch Prime Subscriber,"}, {"id": 86, "start": 593.72, "end": 602.72, "text": "dass es 8 Monat ist, Max, du bist dick, oh fuck, kokona style, ähm, ja, ich hatte richtig"}, {"id": 87, "start": 602.72, "end": 608.2, "text": "gute Idee für den Stream, was ich gerade gesagt hab, es gibt so viel, was man auf Stackoverflow"}, {"id": 88, "start": 608.2, "end": 613.8, "text": "und so kopieren kann, man müsste mal nen Stream machen, wo man sich das Ziel setzt, ne,"}, {"id": 89, "start": 613.8, "end": 619.04, "text": "irgendeine billige, was kleines, ja, ähm, irgendeine kleine Anwendung zu basteln, und"}, {"id": 90, "start": 619.04, "end": 633.96, "text": "das nur mit Copy Paste von Stackoverflow, Clocks HD, 8 Monat, ajajaja, Q-Chat, man müsste"}, {"id": 91, "start": 633.96, "end": 639.24, "text": "jetzt echt mal probieren, irgendwas kleines, ähm, hast du dir schon mal meine, ich hab"}, {"id": 92, "start": 639.24, "end": 643.52, "text": "mir die meisten, ne, ich hab's noch nicht angeschaut, die meisten Sachen, ähm, das"}, {"id": 93, "start": 643.52, "end": 647.68, "text": "muss irgendwas kleines sein, irgendwas in Richtung, was könnte man, was, was, was würden"}, {"id": 94, "start": 647.68, "end": 654.28, "text": "sie sich da anbieten, äh, irgendeine Konsolenanwendung oder so, irgendwas, wo man schön copy pasten"}, {"id": 95, "start": 654.28, "end": 660.72, "text": "kann, ne, eine, das für ne reine, reine Copy, vielleicht, sag mal, sag mal ne 95% reine"}, {"id": 96, "start": 660.72, "end": 665.36, "text": "Copy Paste Anwendung geht schlecht, aber ne 95% Copy Paste Anwendung machen und gucken,"}, {"id": 97, "start": 665.36, "end": 674.44, "text": "was dann am Ende rauskommt, oh Leute, der Scam Train ist am Start, war da, 2 Monate"}, {"id": 98, "start": 674.44, "end": 690.52, "text": "abonniert, huge Subscriber, du hast nur wenig Zeit, 94% Leute, jetzt wird's aber knapp,"}, {"id": 99, "start": 690.52, "end": 695.4, "text": "der Scam Train läuft, ja, äh, A-Max hat der Kix eigentlich immer noch eine Muschi, jetzt"}, {"id": 100, "start": 695.4, "end": 701.0, "text": "jeder kommt aufs Auge des Betrachters an, oh, war da vorn, was los, ach ne, das geht,"}, {"id": 101, "start": 701.0, "end": 705.96, "text": "geht nur runter, ähm, so, was haben wir sonst noch für schöne Fragen gehabt, aber ja,"}, {"id": 102, "start": 705.96, "end": 711.76, "text": "das, das, also ja, ja, das soll ich vielleicht mal wirklich machen, machst du im Moment andere"}, {"id": 103, "start": 711.76, "end": 715.6, "text": "Tätigkeit in deinem Job wegen der Quarantäne, ne, ich mach eigentlich genau das gleiche,"}, {"id": 104, "start": 715.6, "end": 719.68, "text": "vor allem ist es sogar eher mehr, weil, weil man im Homeoffice total vielen Leuten hinterher"}, {"id": 105, "start": 719.68, "end": 723.68, "text": "rennen muss, ich, ich weiß nicht, ob es jetzt, ob es ein paar Leute, ich hab ja gestern"}, {"id": 106, "start": 723.68, "end": 732.6, "text": "ein bisschen rumgerantet, ähm, auf Twitter, über manche Leute im Homeoffice, ähm, und"}, {"id": 107, "start": 732.6, "end": 738.76, "text": "zwar finde ich, der Vergleich triffts, triffts eigentlich gut, ähm, gestern Abend gab es"}, {"id": 108, "start": 738.76, "end": 742.96, "text": "nämlich mal wieder so ne, so ne Mail, wo sich unser Management gefreut hat, wie gut und"}, {"id": 109, "start": 742.96, "end": 750.16, "text": "toll das Homeoffice funktioniert, wo ich mich dann so gefragt hab, ok, ähm, mit, mit was"}, {"id": 110, "start": 750.16, "end": 756.16, "text": "die teilweise schon zufrieden sind, ist lustig, aber, das sind halt alles auch irgendwelche"}, {"id": 111, "start": 756.16, "end": 759.28, "text": "Boomer-Manager, die sich das wahrscheinlich überhaupt nicht vorstellen konnten, dass"}, {"id": 112, "start": 759.28, "end": 763.36, "text": "die Leute, wenn man sie in Ruhe lässt, auch was arbeiten. Es gibt eh im Homeoffice total"}, {"id": 113, "start": 763.36, "end": 768.04, "text": "viele Leute, gerade im, gerade im BWL und Management-Bereich, die, die jetzt, die jetzt"}, {"id": 114, "start": 768.04, "end": 774.52, "text": "echt, denen geht der Arsch auf Grundeis, und wisst ihr warum? Weil durch diese ganze Homeoffice-Geschichte"}, {"id": 115, "start": 774.52, "end": 780.84, "text": "haben die große Probleme ihre Existenz zu rechtfertigen, ja, weil was machst du als"}, {"id": 116, "start": 780.84, "end": 792.68, "text": "irgendwelchen, kennst du den Tim von Alpha 4 Games, nicht, also nicht so richtig von"}, {"id": 117, "start": 792.68, "end": 803.76, "text": "Angesicht zu Angesicht, ne, kennen ist auch zu viel gesagt, wir hatten nur, glaub mal,"}, {"id": 118, "start": 803.76, "end": 812.44, "text": "eine kurze Begegnung im Voice-Chat, vor einiger Zeit, ist ganz lang her. Ja, aber ich hab"}, {"id": 119, "start": 812.44, "end": 816.52, "text": "den Eindruck, viele Leute haben echt Probleme, äh, so ihre Existenz zu rechtfertigen, gerade,"}, {"id": 120, "start": 816.52, "end": 825.04, "text": "gerade halt, äh, bei dieser ganzen Homeoffice-Thematik, weil wozu brauchst du jetzt einen, ähm, was"}, {"id": 121, "start": 825.04, "end": 832.96, "text": "gibt's denn da, was gibt's denn da für, für, für schöne Sachen, einen Prozess-Requirements-blah,"}, {"id": 122, "start": 832.96, "end": 840.88, "text": "sonst war's Typ, ja, ist grad komplett useless, und die wissen grad nicht so genau, was sie"}, {"id": 123, "start": 840.88, "end": 847.12, "text": "machen sollen, hast du nicht mal so ein Stampf-Game für alte F4-Games gemacht, doch, doch, das"}, {"id": 124, "start": 847.12, "end": 853.64, "text": "war das ja, wo wir mal kurz zusammen im Voice-Chat waren, das war die einzige Begegnung, die"}, {"id": 125, "start": 853.64, "end": 867.76, "text": "ich mal mit ihm hatte. Ähm, Pater, was, Moment, wie heißt der Name? Pater Oherli, jetzt kann"}, {"id": 126, "start": 867.76, "end": 872.44, "text": "ich die aussprechen, schreibt, äh, unsere Angestellten denken, dass der Chef wieder"}, {"id": 127, "start": 872.44, "end": 878.2, "text": "Schichtdienst einführt mit Ausreden Loadbalancing der VPN-Server. Was zum Teufel hat Schichtdienst"}, {"id": 128, "start": 878.2, "end": 883.16, "text": "mit dem Loadbalancing der VPN-Server zu tun? Der Zusammenhang klingt mir grad voll random."}, {"id": 129, "start": 883.16, "end": 905.8, "text": "Oh, der Keeper XY ist da, der weiß sogar von welchen Leuten ich rede vielleicht. Ja, aber"}, {"id": 130, "start": 905.8, "end": 909.96, "text": "was ich witzig finde, ähm, ich hab's ja, ich hab's hier auf Twitter geschrieben, also"}, {"id": 131, "start": 909.96, "end": 913.64, "text": "erstens bei uns überschlägt sich halt das Management voll, wie gut das Ganze läuft."}, {"id": 132, "start": 913.64, "end": 925.76, "text": "Kommt überhaupt nicht mit dem Chat hinterher, Leute. Ähm, klar weißt du, wen ich mein,"}, {"id": 133, "start": 925.76, "end": 931.12, "text": "das glaub ich nicht, ich mein gar keinen wirklich jetzt so bestimmten, wenn ich das"}, {"id": 134, "start": 931.12, "end": 937.4, "text": "sag. Ähm, wir haben ja ein paar, die im Homeoffice echt so ein bisschen ihre Probleme haben."}, {"id": 135, "start": 937.4, "end": 942.72, "text": "Zumindest ich find den Vergleich mit dem MMO eigentlich ganz gut, ja. Es gibt auch im Homeoffice"}, {"id": 136, "start": 942.72, "end": 946.84, "text": "viele Leute, die sind einfach nicht in der Lage ihre Klasse richtig zu spielen, ja. Das"}, {"id": 137, "start": 946.84, "end": 954.68, "text": "ist dann sowas wie Melee Heiler oder, oder, oder, äh, Damage, äh, oder, keine Ahnung,"}, {"id": 138, "start": 954.68, "end": 963.0, "text": "Caster der heilen will oder Damage, ähm, Buffer oder irgendwie sowas, ja. Da hast du"}, {"id": 139, "start": 963.0, "end": 969.0, "text": "dann halt Leute daheim sitzen, wo du denkst, ok, der müsste das eigentlich können. Und"}, {"id": 140, "start": 969.0, "end": 975.28, "text": "dann stellst du dir einmal fest, der kann das nicht. So, jetzt wusste ich, ich komm"}, {"id": 141, "start": 975.28, "end": 981.36, "text": "im Chat ja gerade wirklich überhaupt nicht nach, was ist denn hier los. Ähm, was denkst"}, {"id": 142, "start": 981.36, "end": 984.16, "text": "du eigentlich dazu, dass es immer weniger Leute auf YouTube gibt, die Commentaries machen?"}, {"id": 143, "start": 984.16, "end": 989.88, "text": "Also, ja gut, das zieht halt nicht mehr. Na, du kannst ja Reaction Content machen. Also"}, {"id": 144, "start": 989.88, "end": 994.12, "text": "man kann ja Reaction Content, da stehen ja die Leute zur Zeit total drauf. Reaction Content"}, {"id": 145, "start": 994.12, "end": 1005.8, "text": "muss sein. Oh, huge, huge Song hier. Das ist, das ist, ähm, A Link to the Past, das ist"}, {"id": 146, "start": 1005.8, "end": 1012.2, "text": "nicht Dark World, ist das nicht das Schloss? Doch, das ist das Schloss, das Schloss, Castle,"}, {"id": 147, "start": 1012.2, "end": 1017.8, "text": "Castle Theme, oder? Moment, gucke. Ok, ja, es ist, es ist A Link Between Worlds, aber"}, {"id": 148, "start": 1017.8, "end": 1021.88, "text": "es ist der gleiche, exakt gleiche, gleiche Soundtrack, oder fast gleiche Soundtrack, bloß"}, {"id": 149, "start": 1021.88, "end": 1030.44, "text": "ein bisschen neuer gemacht. Äh, oh, ho, sagt. Ähm, hab mal eine Frage, du benutzt ja auch"}, {"id": 150, "start": 1030.44, "end": 1041.16, "text": "Windows 10? Äh, ja, mal kurz. Jetzt kann man was, jetzt machen. So. Ah, muss ja immer"}, {"id": 151, "start": 1041.16, "end": 1047.72, "text": "dafür sorgen, dass die Leute aufmerksam bleiben, oder ist, ist beste, wenn was auf den Bildschirm"}, {"id": 152, "start": 1047.72, "end": 1052.24, "text": "passiert. So, jetzt passiert was auf dem Bildschirm, weil wir wissen ja alle, die Aufmerksamkeitsspanne"}, {"id": 153, "start": 1052.24, "end": 1056.2, "text": "der Zuschauer ist ja heutzutage ist nicht hoch. Da muss ich jetzt mal ein bisschen was machen."}, {"id": 154, "start": 1056.2, "end": 1064.08, "text": "Oh, perfekt. Äh, hab mal ne Frage, du benutzt ja auch Windows 10 und hast da ne VM auf dem"}, {"id": 155, "start": 1064.08, "end": 1068.92, "text": "zweiten Desktop. Mit Ctrl, Windows plus rechts plus links kann man ja zwischen Windows 10"}, {"id": 156, "start": 1068.92, "end": 1072.72, "text": "und VM wechseln. Ja, du kannst, du kannst, äh, zwischen, zwischen virtuellen Desktop"}, {"id": 157, "start": 1072.72, "end": 1076.76, "text": "wechseln, also du musst nicht unbedingt ne VM sein. Ja, wenn ich in der VM bin, muss"}, {"id": 158, "start": 1076.76, "end": 1082.08, "text": "ich, um da rauszukommen, erstmal Ctrl alt drücken und kann erst wieder rüber zu Windows"}, {"id": 159, "start": 1082.08, "end": 1086.2, "text": "10 switchen. Da sind sie, ja, das stimmt. Hast du da ne Lösung, wie man das mit weniger"}, {"id": 160, "start": 1086.2, "end": 1092.12, "text": "Tasten geht? Das kann ich dir erzählen, ähm, weil das Problem hatte ich auch. Äh, hab"}, {"id": 161, "start": 1092.12, "end": 1096.6, "text": "versucht mit AutoHotkey das zu automatisieren, aber da gibts dann Probleme mit VM-Ware und"}, {"id": 162, "start": 1096.6, "end": 1101.0, "text": "deren Keyboard-Rapier. AutoHotkey funktioniert nicht, bringt vollkommen Milchbrot. Dankeschön"}, {"id": 163, "start": 1101.0, "end": 1115.4, "text": "für die zwei Monate, huge Subscriber. Excellent, hrq-sub. Ayayar. Ähm, also mit AutoHotkey"}, {"id": 164, "start": 1115.4, "end": 1120.2, "text": "geht nicht. V.a. wer hat irgendeinen Low-Level-USB, äh, frag mich nicht, Keyboard-Driver, da"}, {"id": 165, "start": 1120.2, "end": 1126.4, "text": "ist mit AutoHotkey nix. Äh, was du machen kannst ist, wenn du ne Maus beziehungsweise"}, {"id": 166, "start": 1126.4, "end": 1132.84, "text": "ne Tastatur hast, die halt ne, ne Macrosoftware dabei hat, Cozart, Logitech, was auch immer,"}, {"id": 167, "start": 1132.84, "end": 1136.56, "text": "da kannst du das programmieren. Das funktioniert, das hab ich auch gemacht. Allerdings hab ich"}, {"id": 168, "start": 1136.56, "end": 1141.56, "text": "das hier nicht drinnen, sondern hier drück ich immer, äh, Ctrl alt, Ctrl alt und dann"}, {"id": 169, "start": 1141.56, "end": 1146.36, "text": "Ctrl Windows links. Ist ein bisschen Übungssache, aber ich hab mir das in der Logitech-Software"}, {"id": 170, "start": 1146.36, "end": 1153.16, "text": "gebuffelt, dass genau das Ganze funktioniert. Damit geht das. Ähm, gibt es eigentlich"}, {"id": 171, "start": 1153.16, "end": 1166.84, "text": "die Knu... Knu... Eus noch? Was? Was für ein Ding? Knu-E-U-W-S? Was ist das? Oh, der"}, {"id": 172, "start": 1166.84, "end": 1175.0, "text": "Scamtrain-Level 2. 3 Sekunden, Leute. 3 Sekunden. Er ist da vorbei. Der Scamtrain ist abgefahren."}, {"id": 173, "start": 1175.0, "end": 1193.76, "text": "Ähm... Also, Pater, ich muss sagen, das ist ne sehr merkwürdige Geschichte, weil eure"}, {"id": 174, "start": 1193.76, "end": 1199.12, "text": "VPN-Software ausgelastet sind. Ach, jetzt hab ich, jetzt versteh ich das. Euer Chef"}, {"id": 175, "start": 1199.12, "end": 1204.52, "text": "will Schichtarbeit einführen, weil die VPN-Software ausgelastet sind, mit dem ihr euch auf die"}, {"id": 176, "start": 1204.52, "end": 1211.4, "text": "Arbeit einloggt. Ach so. Kann man da nicht einfach noch ein paar VPN-Software dazustellen?"}, {"id": 177, "start": 1211.4, "end": 1216.68, "text": "Vor allem, was habt... Mein, VPN, wenn es jetzt nicht gerade OpenVPN ist, merkwürdig"}, {"id": 178, "start": 1216.68, "end": 1220.96, "text": "konfiguriert, hält es sich doch in Grenzen. Einfach noch, einfach noch was dazu, einfach"}, {"id": 179, "start": 1220.96, "end": 1226.68, "text": "mit Hardware erschlagen, das geht doch bestimmt. Wenn natürlich eure Anbindung zu langsam"}, {"id": 180, "start": 1226.68, "end": 1236.04, "text": "ist, ja, aber trotzdem. Bescheuerte Idee. Max, du willst Content auf YouTube einfach"}, {"id": 181, "start": 1236.04, "end": 1244.72, "text": "Reactions auf Quellcode? Exzellent. Reactions-Videos zu Reaction-Videos. Ja, das hab ich letztens"}, {"id": 182, "start": 1244.72, "end": 1249.24, "text": "auch gesehen. Ich hab letztens ein Video gesehen, war so, war, war, war komplett weird. Das"}, {"id": 183, "start": 1249.24, "end": 1256.32, "text": "war so nach dem Motto, Unge reagiert auf Inscope21, der auf MontanaBlack reagiert. Ja, ich weiß"}, {"id": 184, "start": 1256.32, "end": 1264.48, "text": "euch jetzt vorbei, das ist echt abgefahren. Spielst du immer noch Path of Exile oder auch"}, {"id": 185, "start": 1264.48, "end": 1268.32, "text": "noch was anderes? Ich spiel gerade noch nicht mal mehr Path of Exile, ich spiel grad, äh,"}, {"id": 186, "start": 1268.32, "end": 1272.84, "text": "gar nichts. Ich, ich spiel grad den Doom Singleplayer noch mal auf schwer, ein bisschen schwerer."}, {"id": 187, "start": 1272.84, "end": 1278.76, "text": "Aber ansonsten, also der hat der Dings hier Doom Eternal, aber ansonsten, äh, gerade"}, {"id": 188, "start": 1278.76, "end": 1286.28, "text": "wenig, ja. Äh, da hast du recht. John hat eine DVD, hast du einen Streamplan. Ich hab"}, {"id": 189, "start": 1286.28, "end": 1289.76, "text": "mir das tatsächlich überlegt, ob wir nicht einen Streamplan machen, aber ihr kennt mich."}, {"id": 190, "start": 1289.76, "end": 1293.24, "text": "Wenn ich sag, wir machen einen Streamplan, dann setzt mich das immer irgendwie unter"}, {"id": 191, "start": 1293.24, "end": 1303.92, "text": "Zugzwang und ich machs nicht. Deswegen werd ich wahrscheinlich keinen Streamplan machen."}, {"id": 192, "start": 1303.92, "end": 1311.32, "text": "Der Kommentar, das hat dir, das hat dir gefallen, ne? Übrigens, der Kommentator, der hat nicht"}, {"id": 193, "start": 1311.32, "end": 1320.12, "text": "Ubi gesagt, der hat Rubi gesagt. Das ist eine Programmiersprache. Äh, KeeperFX, bist du"}, {"id": 194, "start": 1320.12, "end": 1327.28, "text": "noch da? Kennst du noch den Typ bei uns, der, ähm, der vor seinem Rechner gesessen hat"}, {"id": 195, "start": 1327.28, "end": 1331.8, "text": "und den PC Speaker anhatte, wenn er mit der Maustaste, mit der Maustaste an den Rand gekommen"}, {"id": 196, "start": 1331.8, "end": 1339.12, "text": "ist und dann gesagt hat, der scheiß Gnome und ab und zu, und ab und zu gesagt hat, Rubi,"}, {"id": 197, "start": 1339.12, "end": 1346.48, "text": "der vom Rechner gesessen hat. Den hatten wir damals für ZFS, für Mail ZFS geholt und"}, {"id": 198, "start": 1346.48, "end": 1351.36, "text": "haben uns dann überlegt, wir wollen doch kein ZFS, wo er da war. Wie gut kennst du dich"}, {"id": 199, "start": 1351.36, "end": 1354.96, "text": "mit Shadern aus? Das einzige, was ich bei Shadern weiß, ist der Unterschied zwischen"}, {"id": 200, "start": 1354.96, "end": 1358.72, "text": "einem Pixel-Shader und einem Vertax-Shader, dass der eine sagt, welche Farbe der Pixel"}, {"id": 201, "start": 1358.72, "end": 1366.96, "text": "hat und der andere sagt, wo der Pixel ist. Ansonsten hab ich keine Ahnung. Also Michael"}, {"id": 202, "start": 1366.96, "end": 1371.2, "text": "50 Billionen, ich glaube, ich hab die letzten Sonntage, äh, innerhalb, ich glaube, ich"}, {"id": 203, "start": 1371.2, "end": 1381.56, "text": "hab das letzte Jahr über, ähm, einmal sonntags nicht gestreamt. Der mir, ja mir fällt"}, {"id": 204, "start": 1381.56, "end": 1384.44, "text": "grad auch was ein, wo ich erzähle, der Typ, der bei uns auf der Arbeit da gesessen hat"}, {"id": 205, "start": 1384.44, "end": 1390.04, "text": "und, und PC Speaker anhatte. Wir hatten auch mal einen, der war auch geil, der hat immer"}, {"id": 206, "start": 1390.04, "end": 1393.64, "text": "auf seine Tastatur geschlagen, wenn was nicht funktioniert hat. Und das ging einem mega"}, {"id": 207, "start": 1393.64, "end": 1397.4, "text": "auf den Sack. Das ist dann, irgendwas, irgendwas hat nicht funktioniert, was er gebastelt hat"}, {"id": 208, "start": 1397.4, "end": 1404.92, "text": "und dann saß er dann echt da. Das war eh einer, der hat ganz harte Aufmerksamkeit,"}, {"id": 209, "start": 1404.92, "end": 1410.72, "text": "also ganz irgendwie Aufmerksamkeitsprobleme gehabt, weil, ähm, also, dass er die bekommt,"}, {"id": 210, "start": 1410.72, "end": 1417.32, "text": "denn, ähm, der hat meiner Meinung nach auch eigenhändlich dafür gesorgt, dass eine"}, {"id": 211, "start": 1417.32, "end": 1422.6, "text": "Auszubildende nicht mehr zu uns in die Gruppe wollte, ne. Also, und, und er hat Liegestütze"}, {"id": 212, "start": 1422.6, "end": 1426.16, "text": "im Büro gemacht, sowas, der war echt ein bisschen neben der Spur. Der ist manchmal"}, {"id": 213, "start": 1426.16, "end": 1435.0, "text": "aufgesprungen, hat angefangen, Liegestützen zu machen. Leck, oh, Leck, wo davon? Der ist"}, {"id": 214, "start": 1435.0, "end": 1440.48, "text": "manchmal aufgesprungen, hat angefangen, Liegestützen zu machen. Mitten, mitten im Büro, wo alle"}, {"id": 215, "start": 1440.48, "end": 1443.48, "text": "da gesessen haben und haben gearbeitet und irgendwann haben's alle ignoriert und haben"}, {"id": 216, "start": 1443.48, "end": 1452.48, "text": "quasi absichtlich weggeguckt, wenn er angefangen hat. Ja, zumindest, wir hatten mal eine Auszubildende"}, {"id": 217, "start": 1452.48, "end": 1458.88, "text": "einer der wenigen Mädels, äh, IT-technisch, ja, und die ist dann bei uns ins Büro gekommen,"}, {"id": 218, "start": 1458.88, "end": 1465.6, "text": "hat irgendwas gefragt und da hat er seine Charme-Offensive gestartet und, ähm, hat sich"}, {"id": 219, "start": 1465.6, "end": 1471.8, "text": "dann quasi in den Türrahmen gestellt und hat so Stretch-Übungen gemacht, so, um quasi"}, {"id": 220, "start": 1471.8, "end": 1478.32, "text": "so ein bisschen männliche, äh, Dominanz, äh, auszustrahlen und das hat die echt komplett,"}, {"id": 221, "start": 1478.32, "end": 1482.8, "text": "äh, auf den falschen Fuß erwischt und die wollte nie wieder bei uns in die Gruppe irgendwie"}, {"id": 222, "start": 1482.8, "end": 1489.64, "text": "dann was, was da machen. Ist auch, ist auch ein Depp, warum macht er auch so Zeug, ja?"}, {"id": 223, "start": 1489.64, "end": 1499.76, "text": "Aber wir müssen jetzt leider warten, bis Wodafone sich wieder, bis Wodafone ausgeschissen"}, {"id": 224, "start": 1499.76, "end": 1516.4, "text": "hat. Seit wann kann man Kekse sammeln, äh, seit zwei Streams? Ach, Pater, die Aussage"}, {"id": 225, "start": 1516.4, "end": 1520.2, "text": "gibt's gar nicht, das ist Fake-Grund vom Chef, ja, das siehst du mal, das daran sieht"}, {"id": 226, "start": 1520.2, "end": 1524.2, "text": "man, wenn du, wenn du, wenn er euch halt irgendwie nicht traut, was halt merkwürdig ist, weil"}, {"id": 227, "start": 1524.2, "end": 1528.72, "text": "gerade als Chef solltest du eigentlich erkennen können, in der Lage sein zu erkennen, was"}, {"id": 228, "start": 1528.72, "end": 1534.96, "text": "deine Leute machen und, äh, wenn das Homeoffice-mäßig auch klappt, dann ist doch gut."}, {"id": 229, "start": 1534.96, "end": 1562.76, "text": "Jetzt, Wodafone, komm mach hinne."}, {"id": 230, "start": 1562.76, "end": 1572.4, "text": "Max, kennst du dich mit Container-Networking aus? Also mit dem Standard-Docker-Zeug schon?"}, {"id": 231, "start": 1572.4, "end": 1580.56, "text": "So halbwegs, was man halt so braucht? Je nachdem, was du machen willst, also wenn du jetzt diesen"}, {"id": 232, "start": 1580.56, "end": 1585.96, "text": "Cisco, Cisco-Firmware-Emulator da irgendwie in der VM laufen lassen willst, mit 48 Interfaces"}, {"id": 233, "start": 1585.96, "end": 1589.84, "text": "im Container laufen lassen willst, da kann ich ja nicht sagen, wie das geht. Also den"}, {"id": 234, "start": 1589.84, "end": 1595.04, "text": "kann man übrigens gar nicht im Container laufen lassen, fällt mir ein."}, {"id": 235, "start": 1595.04, "end": 1606.04, "text": "Äh, warum 48 FPS für die cineastische Experience? 48 FPS ist ganz einfach zu erklären. 48 FPS"}, {"id": 236, "start": 1606.04, "end": 1613.84, "text": "ist deutlich flüssiger als 30 und sieht schärfer aus bei der gleichen Bandbreite wie 60."}, {"id": 237, "start": 1613.84, "end": 1624.8, "text": "Meine Güte, Wodafone, ey. Ich kann so nicht weitermachen."}, {"id": 238, "start": 1624.8, "end": 1628.96, "text": "Ich kann so nichts machen, wenn der Kack nicht funktioniert."}, {"id": 239, "start": 1628.96, "end": 1637.84, "text": "Soll ich dir mal einen OpenVPN-Server in Frankfurt, Niederlande aufsetzen? Hilft es gegen Kack-Wodafone-Peering?"}, {"id": 240, "start": 1637.84, "end": 1644.0, "text": "Ich glaube nicht, dass das hilft. Ich wollte das auch schon mal ausprobieren,"}, {"id": 241, "start": 1644.0, "end": 1649.48, "text": "ich wollte mir mal bei einfach bei DigitalOcean eine Kiste holen und dann VPN hin machen und"}, {"id": 242, "start": 1649.48, "end": 1654.36, "text": "gucken, ob es funktioniert dann mit Wodafone, aber ich, ich bin mir eigentlich ziemlich"}, {"id": 243, "start": 1654.36, "end": 1655.56, "text": "sicher, das wird nicht funktionieren."}, {"id": 244, "start": 1655.56, "end": 1680.68, "text": "Dein Tweet bezüglich Leute, die zuhause was machen oder nicht stimmt 200%."}, {"id": 245, "start": 1680.68, "end": 1688.36, "text": "Ich finde es schön, wenn sich das auch mit deiner Erfahrung deckt. 8,6% Frame Loss."}, {"id": 246, "start": 1688.36, "end": 1692.0, "text": "Was ist mit Wodafone, was machen die eigentlich mit ihrem Netzwerk?"}, {"id": 247, "start": 1692.0, "end": 1699.16, "text": "Hat er den Switch aufgemacht und erstmal irgendwie reingespuckt?"}, {"id": 248, "start": 1699.16, "end": 1703.04, "text": "Was machen die da?"}, {"id": 249, "start": 1703.04, "end": 1721.96, "text": "Ja Pater, das wäre ja auch komplett unsinnig, wozu braucht man das 24-7?"}, {"id": 250, "start": 1721.96, "end": 1732.28, "text": "Welcher Zwischenspeicher kann eigentlich voll offenbar dieser Unity Media Connect Box"}, {"id": 251, "start": 1732.28, "end": 1733.28, "text": "sein?"}, {"id": 252, "start": 1733.28, "end": 1736.36, "text": "Hat das jemand von Wodafone erzählt oder was?"}, {"id": 253, "start": 1736.36, "end": 1741.72, "text": "Ich wüsste nicht, was da groß voll laufen soll, ich meine, wenn du irgendwelche Buffer"}, {"id": 254, "start": 1741.72, "end": 1746.72, "text": "hast, die können natürlich immer voll laufen, wenn es dann schnell genug wegkommt auf der"}, {"id": 255, "start": 1746.72, "end": 1747.72, "text": "anderen Seite."}, {"id": 256, "start": 1747.72, "end": 1752.12, "text": "Das ist aber nicht das Problem von der Connect Box oder von dem Buffer, irgendwie sind Buffer"}, {"id": 257, "start": 1752.12, "end": 1753.12, "text": "halt voll."}, {"id": 258, "start": 1753.12, "end": 1756.64, "text": "Und es bringt ja auch nichts drei Stunden da irgendwas drin zu speichern, wenn das zu"}, {"id": 259, "start": 1756.64, "end": 1759.28, "text": "einer aktiven Verbindung gehört, das braucht dann keiner mehr, wenn es nach drei Stunden"}, {"id": 260, "start": 1759.28, "end": 1760.28, "text": "ankommt."}, {"id": 261, "start": 1760.28, "end": 1767.6, "text": "Das liegt einfach an anderen Stellen, da kann man daheim nichts machen."}, {"id": 262, "start": 1767.6, "end": 1774.88, "text": "7, 8, das ist ja immer noch am abkacken, 10% fast."}, {"id": 263, "start": 1774.88, "end": 1785.12, "text": "Ach stimmt, das habe ich ganz vergessen, die 48 FPS liegen ja auch daran, weil jedes Auge"}, {"id": 264, "start": 1785.12, "end": 1788.6, "text": "nur 24 FPS sehen kann, natürlich, exellent."}, {"id": 265, "start": 1788.6, "end": 1794.76, "text": "Wobei, ne, es waren 12 FPS pro Auge, wie kann man das dann erklären?"}, {"id": 266, "start": 1794.76, "end": 1806.68, "text": "Wie kommen bei dir die Bilder mit den Memelinks im Bild, hier vorn, da, ich habe mir sowas"}, {"id": 267, "start": 1806.68, "end": 1810.32, "text": "programmiert, wo man Zeug einblenden kann hier, so nicht der Gaben, der könnte uns"}, {"id": 268, "start": 1810.32, "end": 1815.28, "text": "jetzt mal helfen, dass Wodafone nicht mehr so leckt, oder Hackermans haben wir auch hier,"}, {"id": 269, "start": 1815.28, "end": 1827.84, "text": "aber Achtung Leute, äh, Passt, äh, also, Warnung, jetzt wird es laut, spielst du noch"}, {"id": 270, "start": 1827.84, "end": 1828.84, "text": "Overwatch?"}, {"id": 271, "start": 1828.84, "end": 1830.64, "text": "Ne, das letzte halbe Jahr nicht mal angefasst."}, {"id": 272, "start": 1830.64, "end": 1841.44, "text": "JSPP64 schreibt von seinen Freunden, er hört immer noch schlechte Sachen über Wodafone,"}, {"id": 273, "start": 1841.44, "end": 1848.32, "text": "ich höre auch selten Gutes von Wodafone, allerdings ist es bei mir der beste Anbieter,"}, {"id": 274, "start": 1848.32, "end": 1854.68, "text": "was Upload und Download angeht, Telekom kann da nicht in ähnliche Regionen mithalten,"}, {"id": 275, "start": 1854.68, "end": 1856.6, "text": "leider, sonst hätte ich wahrscheinlich auch gar kein Wodafone."}, {"id": 276, "start": 1856.6, "end": 1865.36, "text": "Aber ich werde das jetzt jeden Stream so machen, wenn die rumleggen, das dauert ja meistens"}, {"id": 277, "start": 1865.36, "end": 1869.56, "text": "gar nicht so lang, und das ist ja auch meistens nur so einmal richtig pro Stream."}, {"id": 278, "start": 1869.56, "end": 1876.84, "text": "Ähm, ich lass einfach jetzt immer den Scheißhaufen von Wodafone auf, bis ich das nach 10 Minuten"}, {"id": 279, "start": 1876.84, "end": 1881.64, "text": "wieder erledigt hab, mir bleibt eh nix anderes übrig, ich hab ja mal, ich hab's euch ja"}, {"id": 280, "start": 1881.64, "end": 1886.8, "text": "erzählt, ich hab den Wodafone-Support angeschrieben, und der Wodafone-Support hat mir dann unterm"}, {"id": 281, "start": 1886.8, "end": 1892.44, "text": "Strich gesagt, ich soll die SSID von meinem Wlan ändern, da sieht man mal, was da für"}, {"id": 282, "start": 1892.44, "end": 1904.12, "text": "Spezialisten sitzen."}, {"id": 283, "start": 1904.12, "end": 1906.04, "text": "Flame mal etwas auf Twitter, das hat überhaupt keinen Sinn."}, {"id": 284, "start": 1906.04, "end": 1917.04, "text": "Die reagieren zwar schnell, aber passiert halt nix, die Anbindung von denen wahrscheinlich"}, {"id": 285, "start": 1917.04, "end": 1923.36, "text": "irgendwo in Frankfurt oder so, das ist halt einfach grottenschlecht."}, {"id": 286, "start": 1923.36, "end": 1933.24, "text": "Guck mal, ah nee, geht, geht trotzdem nicht."}, {"id": 287, "start": 1933.24, "end": 1937.32, "text": "Der hat bei mir das, bei Void-Danny sagt, bei ihm hat der Wodafone-Mitarbeiter genau"}, {"id": 288, "start": 1937.32, "end": 1939.92, "text": "das gleiche erzählen, ja, das scheint wohl so ne Standardantwort zu sein, ändern sie"}, {"id": 289, "start": 1939.92, "end": 1940.92, "text": "mal ihre SSIDs."}, {"id": 290, "start": 1940.92, "end": 1948.72, "text": "Ja gut, 1&1 ist ja auch wirklich Bullshit, also wenn schon Telekom Resale, dann halt"}, {"id": 291, "start": 1948.72, "end": 1951.04, "text": "auch gleich Telekom und nicht Resale."}, {"id": 292, "start": 1951.04, "end": 1956.32, "text": "Wann kommt ein Video über deinen neuen Server rum, der so neu ist, hat da gar nix."}, {"id": 293, "start": 1956.32, "end": 1959.0, "text": "Der neue Server steht immer noch hier links neben mir auf der Erde."}, {"id": 294, "start": 1959.0, "end": 1970.76, "text": "Wir haben 10% geschafft, Leute."}, {"id": 295, "start": 1970.76, "end": 1971.76, "text": "Yeah!"}, {"id": 296, "start": 1971.76, "end": 1984.4, "text": "Ähm, ich stelle mal kurz die Bitrate ein bisschen runter, vielleicht bringt das ja"}, {"id": 297, "start": 1984.4, "end": 1985.4, "text": "was."}, {"id": 298, "start": 1985.4, "end": 2001.76, "text": "Nö, das ist immer noch, 2 Mbit ist 2,9 Mbit ist immer noch zu viel anscheinend."}, {"id": 299, "start": 2001.76, "end": 2014.76, "text": "Oh, wir haben 11% geschafft, sehr gut, exquisite, Wodafone exquisite, ok, Achtung, 1,9, ok,"}, {"id": 300, "start": 2014.76, "end": 2015.76, "text": "2,9."}, {"id": 301, "start": 2015.76, "end": 2021.12, "text": "Jetzt haben wir 2 Mbit noch übrig, 2 Mbit, komm Wodafone, 2 Mbit schafft ihr, da geht"}, {"id": 302, "start": 2021.12, "end": 2024.48, "text": "außer Sound kaum noch was durch, in anehmbarer Qualität gerade."}, {"id": 303, "start": 2024.48, "end": 2042.0, "text": "Na, 2 Mbit scheint zu funktionieren, hä?"}, {"id": 304, "start": 2042.0, "end": 2062.44, "text": "Was ist das für ein Scheiß, Alter?"}, {"id": 305, "start": 2062.44, "end": 2066.72, "text": "Was die Soundbitrate ist da nicht drinnen, warum steht da da total, das ergibt jetzt"}, {"id": 306, "start": 2066.72, "end": 2067.72, "text": "da eigentlich keinen Sinn."}, {"id": 307, "start": 2067.72, "end": 2090.6, "text": "Es ist, ach Gott, ey, 101,3 Mbit und es geht nicht ordentlich durch, ich kriege Anfälle"}, {"id": 308, "start": 2090.6, "end": 2091.6, "text": "Wodafone."}, {"id": 309, "start": 2091.6, "end": 2101.52, "text": "Läufst du am Montag mit deiner Metromaske rum, wieso am Montag, ist da Maskenpflicht"}, {"id": 310, "start": 2101.52, "end": 2106.92, "text": "oder was, ich weiß, ich hab noch keine News gelesen heute, also wer die Metromaske noch"}, {"id": 311, "start": 2106.92, "end": 2118.32, "text": "nicht kennt, ich zeig sie euch nochmal, meine Metromaske, was, warum kann ich meine eigenen,"}, {"id": 312, "start": 2118.32, "end": 2128.36, "text": "meine eigenen, ach Gott, Twitter, alle, warum gängeln die ein, alle immer so, warum gängeln"}, {"id": 313, "start": 2128.36, "end": 2144.64, "text": "die ein, alle so, wo ist denn mein Bild, wo ist das Bild von meiner Maske, Twitter, noch"}, {"id": 314, "start": 2144.64, "end": 2161.0, "text": "nicht mal Twitter lädt, ich hab was von Metro geschrieben dabei, hier, ah, meine Metromaske,"}, {"id": 315, "start": 2161.0, "end": 2190.96, "text": "WTF Trending, was ist Trending, Kim Jong Un dead, was, Kim Jong Un ist dead, das ist"}, {"id": 316, "start": 2190.96, "end": 2208.04, "text": "doch fake oder, ja was denn du, stimmt das jetzt oder nicht, ok, da kann man, Twitter,"}, {"id": 317, "start": 2208.04, "end": 2229.6, "text": "Twitter kann man nicht glauben, Kim, ah, ihr, ne, da ist anscheinend nichts dran, unbestätigt,"}, {"id": 318, "start": 2229.6, "end": 2245.52, "text": "ja, dead, ist er geplatzt oder was, naja, mal gucken, wird, wird die nächsten Tage schon"}, {"id": 319, "start": 2245.52, "end": 2250.48, "text": "rauskommen, was kommt denn als nächstes, wir werden jetzt Kim Jong Un, davor hatten"}, {"id": 320, "start": 2250.48, "end": 2257.84, "text": "wir Kim Jong Il, davor hatten wir Kim, wie ist der andere, ach kein Schimmer, jetzt kommt"}, {"id": 321, "start": 2257.84, "end": 2280.36, "text": "Kim Jong Un, oder so kommt jetzt, Maskenpflicht, steht das hier, ja, stimmt, da wollte ich jetzt"}, {"id": 322, "start": 2280.36, "end": 2307.96, "text": "gerade mal gucken, was, Maskenpflicht, wisst ihr was ich geil finde, warte mal, wisst ihr"}, {"id": 323, "start": 2307.96, "end": 2315.52, "text": "was ich lustig finde, also, am Anfang, wo alle noch gesagt haben, ach Lull ist doch"}, {"id": 324, "start": 2315.52, "end": 2318.68, "text": "nicht so schlimm, könnt ihr euch noch dran erinnern, auf Twitter, wo alle gesagt haben,"}, {"id": 325, "start": 2318.68, "end": 2322.6, "text": "ach was, was interessiert es mich, ah Krippe ist doch viel schlimmer, es ist doch gar nicht"}, {"id": 326, "start": 2322.6, "end": 2327.72, "text": "so wild, ist doch alles toll und zu diesem Zeitpunkt, waren ja auch die Leute am Start,"}, {"id": 327, "start": 2327.72, "end": 2334.24, "text": "die alle dann kamen so, siehst du, und Masken bringen doch eh nix, und es ist auch fragwürdig,"}, {"id": 328, "start": 2334.24, "end": 2339.64, "text": "was Masken bringen, also, das klang schon glaubwürdig, was damals die Leute erzählt"}, {"id": 329, "start": 2339.64, "end": 2351.12, "text": "haben, die sich damit auskennen, Kim kommt um, das ist so geil, so, und Masken komplett"}, {"id": 330, "start": 2351.12, "end": 2354.68, "text": "overrated, brauchen wir alles nicht, Masken brauchen wir, total schwachsinnig, Masken"}, {"id": 331, "start": 2354.68, "end": 2361.52, "text": "bringen eh nix, Masken schützen nicht, so, dann haben wir angefangen, das alles ein"}, {"id": 332, "start": 2361.52, "end": 2365.44, "text": "bisschen runter zu fahren, das lief auch ganz gut, und jetzt fahren wir das ganze wieder"}, {"id": 333, "start": 2365.44, "end": 2372.46, "text": "an, und, weil die Leute nicht in der Lage sind, weil die Leute teilweise auch zu degeneriert"}, {"id": 334, "start": 2372.46, "end": 2379.48, "text": "im Kopf sind, sich irgendwie halbwegs dran zu halten, dass man ein bisschen Abstand hält,"}, {"id": 335, "start": 2379.48, "end": 2382.84, "text": "dass man in Geschäften irgendwie sich was umzieht, jetzt sollen wir überall Masken"}, {"id": 336, "start": 2382.84, "end": 2391.44, "text": "aufziehen, die ja angeblich, wie es am Anfang gesagt hat, nix bringen, also, rein irgendwo"}, {"id": 337, "start": 2391.44, "end": 2396.16, "text": "am Arsch der Welt, im Freien, brauche ich keine Maske, das ist kompletter Schwachsinn,"}, {"id": 338, "start": 2396.16, "end": 2405.16, "text": "im Geschäft, vollkommen okay, den mega Upload Song, warum denn den mega Upload Song, du"}, {"id": 339, "start": 2405.16, "end": 2416.04, "text": "meinst, weil es Kim Jong-Kom ist, oder was, okay, also was, was haben wir denn, Ab der"}, {"id": 340, "start": 2416.04, "end": 2419.24, "text": "kommende Woche gilt in allen Bundesländern eine Maske nicht, wie diese kontrolliert"}, {"id": 341, "start": 2419.24, "end": 2422.6, "text": "und welche Bußgelder bei Missachtung fällig werden wird, ohne dass ihr dich kannt habt."}, {"id": 342, "start": 2422.6, "end": 2431.56, "text": "Ja, ist ja auch klar, die Leute haben sich ja auch absolut nicht dran gehalten, ich hab"}, {"id": 343, "start": 2431.56, "end": 2437.28, "text": "ein Foto, ich muss euch das mal zeigen, jetzt wird's wieder schwierig mit Upload, ich hoffe"}, {"id": 344, "start": 2437.28, "end": 2447.4, "text": "man erkennt's, ich hab ein Foto am Main gemacht, über den Main weg halt, Moment, was hatten"}, {"id": 345, "start": 2447.4, "end": 2454.32, "text": "wir letztens für eine Seite, um Bilder hochzuladen, wie hieß das, Post Image Punkt, ja genau,"}, {"id": 346, "start": 2454.32, "end": 2457.28, "text": "da lad ich, ich lad mal grad was hoch, ich zeig euch mal ein Bild, was ich am Main gemacht"}, {"id": 347, "start": 2457.28, "end": 2467.76, "text": "hab, wo es um soziale Distanz und generell Leute gibt, die ein bisschen ihr Hirn einschalten,"}, {"id": 348, "start": 2467.76, "end": 2479.64, "text": "und da werdet ihr sehen, dass es halt viel zu viele Falschbasten gibt, die nix hinkriegen."}, {"id": 349, "start": 2479.64, "end": 2499.68, "text": "So, ich hab das Bild mal hochgeladen, so, also, Post Image, ich hoffe man erkennt's,"}, {"id": 350, "start": 2499.68, "end": 2504.88, "text": "ich hab das mit meinem alten iPhone aufgenommen, also mit dem 6s, das hat halt keine, oder"}, {"id": 351, "start": 2504.88, "end": 2510.08, "text": "hat, nee, 6s ist das glaube ich, das alte auf jeden Fall, das hat halt eine scheiß Kamera-Quali"}, {"id": 352, "start": 2510.08, "end": 2517.16, "text": "im Vergleich zu den neuen, aber ich hoffe man erkennt das trotzdem, erkennt man's, guckt"}, {"id": 353, "start": 2517.16, "end": 2522.5, "text": "euch mal an, das hab ich über den Main fotografiert aufgenommen, also sprich, ich bin hier gelaufen"}, {"id": 354, "start": 2522.5, "end": 2534.8, "text": "auf der Seite, und da drüben ist so ein Strand, seht ihr das am Strand, seht ihr das am Strand,"}, {"id": 355, "start": 2534.8, "end": 2544.0, "text": "was da los ist, man erkennt's schlecht, ja, aber, ok, ich geb zu, es ist pixelig, aber"}, {"id": 356, "start": 2544.0, "end": 2548.12, "text": "man sollte es eigentlich erkennen, da sitzen Leute, da sitzen Leute, da stehen irgendwie"}, {"id": 357, "start": 2548.12, "end": 2552.12, "text": "8 Leute auf einem Haufen, hier stehen auch irgendwie 8 Leute am Haufen, da vorne ist"}, {"id": 358, "start": 2552.12, "end": 2557.52, "text": "ein Schwan am Start, das ist fast schon ein paar Ding am Strand gewesen, natürlich keiner"}, {"id": 359, "start": 2557.52, "end": 2568.0, "text": "Mundschutz auf oder irgendwas, machst du gerne Fotos vom Fremden, nee, mach ich nicht, ich"}, {"id": 360, "start": 2568.0, "end": 2578.56, "text": "mach nur Fotos von Sachen, die mich aufregen, und das ist ne Sache, die mich aufregt, also"}, {"id": 361, "start": 2578.56, "end": 2582.2, "text": "mir kann jetzt aber keiner erzählen, dass er hier irgendwelche Leute erkennen würde,"}, {"id": 362, "start": 2582.2, "end": 2591.76, "text": "ja, also eindeutig hier, den da, den im Busch, den erkennt man zu gut, da muss ich den schwarzen"}, {"id": 363, "start": 2591.76, "end": 2601.72, "text": "Balken drüber machen, naja, so, also was, wo ohne Maske Bußgel droht, da bin ich mal"}, {"id": 364, "start": 2601.72, "end": 2610.44, "text": "gespannt jetzt, stimmt, da hinten ist der Kabum irgendwo gewesen, Quatsch ey Leute,"}, {"id": 365, "start": 2610.44, "end": 2617.92, "text": "also DSGVO, ab der kommenden Woche geht alles, wie diese kontrolliert wird und welche Bußgel"}, {"id": 366, "start": 2617.92, "end": 2625.56, "text": "dabei ist, also ich hab die Polizei bei uns am Main schon gesehen, aber noch nie hat irgendwie"}, {"id": 367, "start": 2625.56, "end": 2634.84, "text": "einer was gesagt, angeblich haben die bei uns irgendwo im Nachbarort am Friedhof ne Party"}, {"id": 368, "start": 2634.84, "end": 2640.8, "text": "von Jugendlichen, am Friedhof, ne Party von 20 Jugendlichen aufgelöst, letztes Wochenende,"}, {"id": 369, "start": 2640.8, "end": 2657.12, "text": "am Friedhof, die haben wahrscheinlich gedacht, das sieht keiner, also wer sich drauf verlässt"}, {"id": 370, "start": 2657.12, "end": 2663.72, "text": "und wer Hoffnung hatte, dass die Leute freiwillig und mit Hirn einschalten was machen, ist eh"}, {"id": 371, "start": 2663.72, "end": 2675.52, "text": "komplett hängen geblieben, ok Moment, das ist, warum ist der Scheiß immer so kompliziert,"}, {"id": 372, "start": 2675.52, "end": 2680.0, "text": "können die nicht einfach sagen, ja, gilt, wenn du dagegen verstößt in dem und dem"}, {"id": 373, "start": 2680.0, "end": 2685.76, "text": "Gebiet, dann, keine Ahnung, 200 Euro Geldstrafe, du musst dir immer, dass du die Sachen in"}, {"id": 374, "start": 2685.76, "end": 2690.0, "text": "Deutschland kapierst, musst du dir immer 5 Seiten durchlesen und hoffen, dass du nicht"}, {"id": 375, "start": 2690.0, "end": 2698.52, "text": "zufällig über die Grenze in Bayern fährst, wo die Sachen wieder komplett anders sind,"}, {"id": 376, "start": 2698.52, "end": 2714.12, "text": "ok also hoffen wir mal, Berlin juckt mich nicht, Hessen, was ist Hessen, Hessen, 50 Euro,"}, {"id": 377, "start": 2714.12, "end": 2719.12, "text": "weißt du was ich mache, Leute wisst ihr was, wisst ihr was ich am Montag mache, das nehme"}, {"id": 378, "start": 2719.12, "end": 2725.36, "text": "ich auf, das nehme ich auf mit der Kamera, ich gehe am Montag auf die Sparkasse Geld"}, {"id": 379, "start": 2725.36, "end": 2734.16, "text": "abheben und guck mal ob die mich reinlassen, mit meiner Maske, das nehme ich auf im Handy,"}, {"id": 380, "start": 2734.16, "end": 2741.88, "text": "mal gucken was passiert, mal gucken ob die mich rauslassen, weil bei der Sparkasse hängt"}, {"id": 381, "start": 2741.88, "end": 2748.64, "text": "immer noch das Schild vorne dran, dass man nicht mit Motorradhelm rein darf, ich meine"}, {"id": 382, "start": 2748.64, "end": 2759.84, "text": "das ist, das ist, streng genommen ist das kein Motorradhelm, die denken ja du bist Bankro,"}, {"id": 383, "start": 2759.84, "end": 2770.64, "text": "wahrscheinlich denke ich mit Bankro, wiederholte Verstöße mit einem, die gehen mir jetzt"}, {"id": 384, "start": 2770.64, "end": 2776.32, "text": "so auf den Sack, wenn ich am Main spazieren gehe und ich bin ja jemand der achtet auf"}, {"id": 385, "start": 2776.32, "end": 2780.72, "text": "Abstand, ich ziehe mir auch öfters mein Hemd über die Nase wenn es mal wieder einer nicht"}, {"id": 386, "start": 2780.72, "end": 2785.48, "text": "macht, ok dafür ist, aber ich versuche wirklich riesen Bogen um die Leute zu machen, ich glaube"}, {"id": 387, "start": 2785.48, "end": 2791.44, "text": "nicht, dass wenn ich am Main mal kurz spazieren gehe, dass ich da irgendwie Leute gefährde"}, {"id": 388, "start": 2791.44, "end": 2801.6, "text": "und gefährdet bin, das ist einfach ätzend, die gehen mir auf den Keks jetzt, hat eigentlich"}, {"id": 389, "start": 2801.6, "end": 2806.72, "text": "irgendwie einer Plan da, wie man sowas managen sollte, nicht dass ich es wüsste, an mir"}, {"id": 390, "start": 2806.72, "end": 2810.36, "text": "kommt es irgendwie so vor, als machen wir einfach nur Aktion nach Aktion nach Aktion"}, {"id": 391, "start": 2810.36, "end": 2822.88, "text": "ohne dass die irgendwie zusammenhängen, na anscheinend gilt es jetzt überall, das Bundesland"}, {"id": 392, "start": 2822.88, "end": 2836.16, "text": "Hessen, wo das Massenpflicht ebenfalls am Montag in Kraft tritt, die gehen mir alles"}, {"id": 393, "start": 2836.16, "end": 2858.32, "text": "so auf den Sack, all die Klappe, so Hessen, jetzt heißt es schon mal Hessen, Hessen, Hessen,"}, {"id": 394, "start": 2858.32, "end": 2865.12, "text": "diese Solle für Geschäfte A und den öffentlichen Nahverkehr gelten, also jetzt wieder, ok also"}, {"id": 395, "start": 2865.12, "end": 2874.24, "text": "jetzt doch nicht oder wie, kannst du wieder 5mbit stellen, hat es aufgehört zu ruckeln,"}, {"id": 396, "start": 2874.24, "end": 2887.24, "text": "hat es aufgehört zu ruckeln, ruckelt nicht mehr, stellen wir mal wieder hoch, gucken wir"}, {"id": 397, "start": 2887.24, "end": 2896.24, "text": "mal, exzellent, dass es jetzt mal kurz ruckelt, ist normal beim Bandbreiten ändern, aber"}, {"id": 398, "start": 2896.24, "end": 2900.4, "text": "jetzt sollte es funktionieren, wenn das wieder hoch geht Leute, ich resette mal die Stats,"}, {"id": 399, "start": 2900.4, "end": 2922.16, "text": "dass man das auch sieht, naja, eine seriöse FAQ der hessischen Regierung, ooooh Wahnsinn,"}, {"id": 400, "start": 2922.16, "end": 2927.12, "text": "die sind ja schnell, ok, die hessische Landesregierung hat eine Massenpflicht beschlossen, die am"}, {"id": 401, "start": 2927.12, "end": 2937.56, "text": "Montag, 27. April gilt, ok, Nahverkehr nutzen oder die Publikationsbereich von Geschäften,"}, {"id": 402, "start": 2937.56, "end": 2943.52, "text": "Banken und Postfiltern, das finde ich gut, das ist ok, das scheint mir sinnvoll, das"}, {"id": 403, "start": 2943.52, "end": 2949.64, "text": "finde ich ok und wisst ihr was man mal machen müsste, man müsste den Leuten mal erklären,"}, {"id": 404, "start": 2949.64, "end": 2953.12, "text": "wie man eine Maske überhaupt richtig aufzieht, ich sehe nämlich ganz viele Leute auch in"}, {"id": 405, "start": 2953.12, "end": 2958.72, "text": "Geschäften, die haben die Maske über den Mund und nicht über die Nase, was meinen"}, {"id": 406, "start": 2958.72, "end": 2964.12, "text": "die denn warum die so eine Form hat, dass die über Mund und Nase getragen werden kann,"}, {"id": 407, "start": 2964.12, "end": 2990.08, "text": "was für eine GPU und CPU hast du in den 8700K, ein bisschen übertakt der 9800HTi, warum"}, {"id": 408, "start": 2990.08, "end": 2995.88, "text": "bist du so scharf darauf, dass ich den Mega Upload Song anmache, Leute, Mega Upload Song"}, {"id": 409, "start": 2995.88, "end": 3019.8, "text": "oder kein Mega Upload Song, wir hatten den Mega Upload Song schon lange nicht mehr, ok,"}, {"id": 410, "start": 3019.8, "end": 3033.88, "text": "Mega Upload Song, wild, big, Battlefield 5 Final, it's over, haha, ok, haltet euch fest,"}, {"id": 411, "start": 3033.88, "end": 3040.44, "text": "der Mega Upload Song, da hat der Knäber sogar kleingesubscribed, kommt, dass ich keine Subs"}, {"id": 412, "start": 3040.44, "end": 3053.92, "text": "übersehen habe, Vollkorn Mischprode habe ich glaube ich übersehen, danke für den"}, {"id": 413, "start": 3053.92, "end": 3057.92, "text": "Tier 1 Sub, 2 Monate, nee, nee, doch, doch, doch, das habe ich gesehen, habe ich gesehen,"}, {"id": 414, "start": 3057.92, "end": 3066.68, "text": "alles gut, alles gut, also Mega Upload Song, weil, weil, weil ihr der, seid,"}, {"id": 415, "start": 3066.68, "end": 3094.68, "text": "kein Pock, meinetwegen auch ein Pock, ich finde es immer so geil, die, die Typen hatten"}, {"id": 416, "start": 3094.68, "end": 3107.72, "text": "alle keinen Plastenschimmer, für was sie sich da in die Kamera gesetzt haben, wer ist"}, {"id": 417, "start": 3107.72, "end": 3120.24, "text": "das, den kenne ich, den habe ich schon mal gesehen, die habe ich auch schon mal irgendwo"}, {"id": 418, "start": 3120.24, "end": 3127.44, "text": "gesehen, andere kenne ich nicht, warum machen die Künstler werden für Raumkopien, weil"}, {"id": 419, "start": 3127.44, "end": 3152.56, "text": "ich keine Ahnung hatten, warum vor sie da vor die Kamera gesessen haben, jetzt muss"}, {"id": 420, "start": 3152.56, "end": 3160.72, "text": "er noch selbst singen, der Knäber und das Sebaro, die steigern sich ja richtig rein"}, {"id": 421, "start": 3160.72, "end": 3177.28, "text": "gerade, 10 times faster, bit by bit unlimited, it's a hit, warum kann man sich den Kram überhaupt"}, {"id": 422, "start": 3177.28, "end": 3196.84, "text": "nicht merken, guck mal Leute, da merkt ihr, dass ihr alt seid, 2011, 9 Jahre ist das her,"}, {"id": 423, "start": 3196.84, "end": 3220.96, "text": "übrigens der Frosch ist mein Overlay, das gehört nicht zum Video, hobs, Book Free, Book"}, {"id": 424, "start": 3220.96, "end": 3237.0, "text": "Free, wo kommt man eigentlich raus, wenn man auf Mega Upload, nee was war das Punkt, Moment"}, {"id": 425, "start": 3237.0, "end": 3242.28, "text": "Leute, ich gehe mal kurz in meine Linux-VM, ich weiß nicht, was muss ich da einfangen,"}, {"id": 426, "start": 3242.28, "end": 3265.4, "text": "mega-upload.com war das, nee da gibt es nicht, der Mega NZ ist das Neue, wie lange geht"}, {"id": 427, "start": 3265.4, "end": 3282.44, "text": "das eigentlich noch, was macht dann eigentlich gerade so, wie hast du gerade so schnell gewechselt,"}, {"id": 428, "start": 3282.44, "end": 3300.28, "text": "hier, Windows-Alt-File-Taste, Achtung Epilepsie-Warnung, was macht der eigentlich gerade, Sam knast"}, {"id": 429, "start": 3300.28, "end": 3323.12, "text": "jetzt, ich hoffe nicht, das ist der VM, ja das ist hier VM-Workstation, ich hoffe nicht,"}, {"id": 430, "start": 3323.12, "end": 3351.48, "text": "dass er im Knast ist, ja okay, keine Ahnung, was da jetzt gerade rausgekommen ist, ich glaube,"}, {"id": 431, "start": 3351.48, "end": 3369.32, "text": "er kehrt schon schon Shrimp-Warrant, alles kurz, ich hoffe, okay, Laddra chaotic, Aa,"}, {"id": 432, "start": 3369.32, "end": 3371.32, "text": "Keine Ahnung, was er gerade so treibt."}, {"id": 433, "start": 3371.32, "end": 3373.32, "text": "Na gut, also"}, {"id": 434, "start": 3373.32, "end": 3375.32, "text": "FAQ, es betrifft"}, {"id": 435, "start": 3375.32, "end": 3377.32, "text": "nur Nahverkehr,"}, {"id": 436, "start": 3377.32, "end": 3379.32, "text": "Geschäfte, Banken und Postvieland, das finde"}, {"id": 437, "start": 3379.32, "end": 3381.32, "text": "ich sinnvoll."}, {"id": 438, "start": 3381.32, "end": 3383.32, "text": "Habt ihr das mitgekriegt,"}, {"id": 439, "start": 3383.32, "end": 3385.32, "text": "dass Leute jetzt abgemahnt"}, {"id": 440, "start": 3385.32, "end": 3387.32, "text": "werden, die"}, {"id": 441, "start": 3387.32, "end": 3389.32, "text": "Atem-"}, {"id": 442, "start": 3389.32, "end": 3391.32, "text": "Atemschutzmasken und so"}, {"id": 443, "start": 3391.32, "end": 3393.32, "text": "verkaufen oder Schutzmasken verkaufen"}, {"id": 444, "start": 3393.32, "end": 3395.32, "text": "und die Schutzmasken und Atemschutzmasken nennen,"}, {"id": 445, "start": 3395.32, "end": 3397.32, "text": "obwohl es selbstgenähte Sachen sind,"}, {"id": 446, "start": 3397.32, "end": 3399.32, "text": "da werden die abgemahnt, weil das"}, {"id": 447, "start": 3399.32, "end": 3401.32, "text": "quasi keine"}, {"id": 448, "start": 3401.32, "end": 3403.32, "text": "richtige Atemschutzmaske"}, {"id": 449, "start": 3403.32, "end": 3405.32, "text": "ist und sie ja irgendwie"}, {"id": 450, "start": 3405.32, "end": 3407.32, "text": "dann auch, was auch immer,"}, {"id": 451, "start": 3407.32, "end": 3409.32, "text": "das wettbewerbsmäßig"}, {"id": 452, "start": 3409.32, "end": 3411.32, "text": "verstoßen gegen irgendwas."}, {"id": 453, "start": 3411.32, "end": 3413.32, "text": "So ist das in Deutschland."}, {"id": 454, "start": 3413.32, "end": 3415.32, "text": "Du wirst abgemahnt,"}, {"id": 455, "start": 3415.32, "end": 3417.32, "text": "wenn du ein paar Masken lest."}, {"id": 456, "start": 3419.32, "end": 3421.32, "text": "Was hältst du vom neuen Zero,"}, {"id": 457, "start": 3421.32, "end": 3423.32, "text": "der Export von Apple?"}, {"id": 458, "start": 3423.32, "end": 3425.32, "text": "Ich hab's vorhin nur kurz gesehen, das ist das mit den Mails."}, {"id": 459, "start": 3425.32, "end": 3427.32, "text": "Das da."}, {"id": 460, "start": 3427.32, "end": 3429.32, "text": "Das hier."}, {"id": 461, "start": 3429.32, "end": 3431.32, "text": "Das ist so eine typische"}, {"id": 462, "start": 3431.32, "end": 3433.32, "text": "Apple, so eine typische IOS-Sicherheitslücke."}, {"id": 463, "start": 3433.32, "end": 3435.32, "text": "Die hatten ja schon öfters Dinger, dass du"}, {"id": 464, "start": 3435.32, "end": 3437.32, "text": "per Mails und per iMessage"}, {"id": 465, "start": 3439.32, "end": 3441.32, "text": "entweder das"}, {"id": 466, "start": 3441.32, "end": 3443.32, "text": "Smartphone zum Absturz"}, {"id": 467, "start": 3443.32, "end": 3445.32, "text": "bringen kannst oder"}, {"id": 468, "start": 3445.32, "end": 3447.32, "text": "Code einschleusen, was auch immer. Die hatten ja schon ein paar"}, {"id": 469, "start": 3447.32, "end": 3449.32, "text": "so Dinger. Ich hoffe nur,"}, {"id": 470, "start": 3449.32, "end": 3451.32, "text": "angeblich gibt es keine direkte Gefahr. Aha."}, {"id": 471, "start": 3451.32, "end": 3453.32, "text": "Ich hoffe nur, die kriegen das gebacken."}, {"id": 472, "start": 3453.32, "end": 3455.32, "text": "Zack Ops"}, {"id": 473, "start": 3455.32, "end": 3457.32, "text": "hat's entdeckt."}, {"id": 474, "start": 3459.32, "end": 3461.32, "text": "Okay, Zack Ops ist auch"}, {"id": 475, "start": 3461.32, "end": 3463.32, "text": "gut."}, {"id": 476, "start": 3463.32, "end": 3465.32, "text": "Guter Name für eine"}, {"id": 477, "start": 3465.32, "end": 3467.32, "text": "Security-Firma. Oder für eine Security-"}, {"id": 478, "start": 3467.32, "end": 3469.32, "text": "Gruppe. Zack Ops."}, {"id": 479, "start": 3471.32, "end": 3473.32, "text": "Besonders kritisch."}, {"id": 480, "start": 3473.32, "end": 3475.32, "text": "Die sind alle gerade beschäftigt"}, {"id": 481, "start": 3475.32, "end": 3477.32, "text": "mit der Corona-Tracker-App."}, {"id": 482, "start": 3477.32, "end": 3479.32, "text": "Die ja wieder erwartet"}, {"id": 483, "start": 3479.32, "end": 3481.32, "text": "total unsicher ist. Wer hätte"}, {"id": 484, "start": 3481.32, "end": 3483.32, "text": "das nur gedacht?"}, {"id": 485, "start": 3483.32, "end": 3485.32, "text": "Das ist eine App."}, {"id": 486, "start": 3485.32, "end": 3487.32, "text": "Das ist eine offizielle App, die wir"}, {"id": 487, "start": 3487.32, "end": 3489.32, "text": "hier in Deutschland basteln, dass die unsicher"}, {"id": 488, "start": 3489.32, "end": 3491.32, "text": "ist. Das"}, {"id": 489, "start": 3491.32, "end": 3493.32, "text": "wäre mir nie in"}, {"id": 490, "start": 3493.32, "end": 3495.32, "text": "Sinn gekommen."}, {"id": 491, "start": 3495.32, "end": 3497.32, "text": "Ja,"}, {"id": 492, "start": 3497.32, "end": 3499.32, "text": "da ist es doch. Corona-Tracking-App."}, {"id": 493, "start": 3499.32, "end": 3501.32, "text": "Alleins schon, das kann man"}, {"id": 494, "start": 3501.32, "end": 3503.32, "text": "heute mal aussprechen."}, {"id": 495, "start": 3505.32, "end": 3507.32, "text": "P-P-T-P-P-Pepel."}, {"id": 496, "start": 3507.32, "end": 3509.32, "text": "Pep-Pepega."}, {"id": 497, "start": 3509.32, "end": 3511.32, "text": "Pepega-Tracker hätten sie das"}, {"id": 498, "start": 3511.32, "end": 3513.32, "text": "nennen sollen."}, {"id": 499, "start": 3519.32, "end": 3521.32, "text": "Ah, ihr habt ja gesehen,"}, {"id": 500, "start": 3521.32, "end": 3523.32, "text": "Facebook"}, {"id": 501, "start": 3523.32, "end": 3525.32, "text": "hat angeblich"}, {"id": 502, "start": 3525.32, "end": 3527.32, "text": "jetzt auch eine"}, {"id": 503, "start": 3527.32, "end": 3529.32, "text": "Video-Chat-App vorgestellt"}, {"id": 504, "start": 3529.32, "end": 3531.32, "text": "für bis zu, glaub, 50"}, {"id": 505, "start": 3531.32, "end": 3533.32, "text": "Leute."}, {"id": 506, "start": 3533.32, "end": 3535.32, "text": "Weil sie festgestellt haben, dass die Leute"}, {"id": 507, "start": 3535.32, "end": 3539.32, "text": "alle Zoom verwenden und kein Facebook."}, {"id": 508, "start": 3539.32, "end": 3541.32, "text": "Ich würde weder Zoom noch Facebook"}, {"id": 509, "start": 3541.32, "end": 3543.32, "text": "verwenden, wenn ich die Auswahl habe."}, {"id": 510, "start": 3543.32, "end": 3545.32, "text": "Guck mal, wo davon? Kann nicht mehr rum."}, {"id": 511, "start": 3545.32, "end": 3547.32, "text": "Funktioniert."}, {"id": 512, "start": 3547.32, "end": 3549.32, "text": "Eigentlich waren wir ja mal beim Fragen"}, {"id": 513, "start": 3549.32, "end": 3551.32, "text": "beantworten irgendwann."}, {"id": 514, "start": 3551.32, "end": 3553.32, "text": "Hast du was von Nintendo Online?"}, {"id": 515, "start": 3553.32, "end": 3555.32, "text": "Was? Die Frage ist doch schon"}, {"id": 516, "start": 3555.32, "end": 3557.32, "text": "uralt."}, {"id": 517, "start": 3559.32, "end": 3561.32, "text": "Oder ist die? Kam die eben gerade?"}, {"id": 518, "start": 3561.32, "end": 3563.32, "text": "Ach, die kam eben gerade."}, {"id": 519, "start": 3563.32, "end": 3565.32, "text": "Ja, habe ich"}, {"id": 520, "start": 3565.32, "end": 3567.32, "text": "mitbekommen und ich wollte eigentlich"}, {"id": 521, "start": 3567.32, "end": 3569.32, "text": "gucken, ob ich 2-Faktor-"}, {"id": 522, "start": 3569.32, "end": 3571.32, "text": "Authentifizierung auf"}, {"id": 523, "start": 3571.32, "end": 3573.32, "text": "meinem"}, {"id": 524, "start": 3573.32, "end": 3575.32, "text": "Account anhab."}, {"id": 525, "start": 3577.32, "end": 3579.32, "text": "Hab ich aber nicht gemacht."}, {"id": 526, "start": 3583.32, "end": 3585.32, "text": "Passwort?"}, {"id": 527, "start": 3585.32, "end": 3587.32, "text": "Nintendo, ey."}, {"id": 528, "start": 3587.32, "end": 3589.32, "text": "Oh Gott, warum seid ihr"}, {"id": 529, "start": 3589.32, "end": 3593.32, "text": "so unfähig, was Online angeht?"}, {"id": 530, "start": 3593.32, "end": 3595.32, "text": "Ahh."}, {"id": 531, "start": 3613.32, "end": 3615.32, "text": "Warum ist Nintendo so unfähig, was"}, {"id": 532, "start": 3615.32, "end": 3617.32, "text": "Online-Sachen angeht?"}, {"id": 533, "start": 3617.32, "end": 3619.32, "text": "Es heißt, was ich damit nicht sagen will,"}, {"id": 534, "start": 3619.32, "end": 3621.32, "text": "ist, dass das andere nicht so"}, {"id": 535, "start": 3621.32, "end": 3624.22, "text": "Was ich damit nicht sagen will, ist, dass das andere nicht auch passiert."}, {"id": 536, "start": 3625.72, "end": 3628.52, "text": "Das passiert, es ist, es ist, Sony ist das schon passiert."}, {"id": 537, "start": 3629.02, "end": 3631.12, "text": "Ähm, sogar ziemlich groß, ich glaube Microsoft auch."}, {"id": 538, "start": 3631.22, "end": 3633.22, "text": "Allen ist das schon irgendwie mal passiert."}, {"id": 539, "start": 3633.42, "end": 3634.82, "text": "Aber Passwort!"}, {"id": 540, "start": 3637.72, "end": 3640.02, "text": "Warum speichert man das Passwort überhaupt?"}, {"id": 541, "start": 3641.22, "end": 3643.72, "text": "Was ist, was ist mit den Leuten eigentlich los?"}, {"id": 542, "start": 3644.42, "end": 3646.12, "text": "Warum speichert man Passwörter?"}, {"id": 543, "start": 3646.12, "end": 3648.82, "text": "Es ist doch komplett unsinnig, Passwörter zu speichern."}, {"id": 544, "start": 3649.82, "end": 3651.82, "text": "Braucht kein Mensch, muss Passwörter speichern."}, {"id": 545, "start": 3653.82, "end": 3656.32, "text": "Und dann, und dann auch noch ein Teil unverschlüsselt."}, {"id": 546, "start": 3660.82, "end": 3662.82, "text": "Aber erstmal Plain Text Passwörter."}, {"id": 547, "start": 3662.82, "end": 3664.82, "text": "Das passt aber zu Nintendo."}, {"id": 548, "start": 3665.32, "end": 3666.82, "text": "Letztens im Video gesehen,"}, {"id": 549, "start": 3667.32, "end": 3670.32, "text": "das in Animal Crossing, das im neuen Animal Crossing,"}, {"id": 550, "start": 3670.82, "end": 3674.32, "text": "dass man, quasi Leute, die mit Passwörtern speichern,"}, {"id": 551, "start": 3674.32, "end": 3677.32, "text": "dass man quasi Leute aus seiner Freundesliste"}, {"id": 552, "start": 3678.32, "end": 3680.32, "text": "besuchen kann in seinem Dorf."}, {"id": 553, "start": 3681.32, "end": 3684.82, "text": "Allerdings, ist es wohl dann so,"}, {"id": 554, "start": 3685.32, "end": 3689.32, "text": "dass wenn der Host oder irgendeiner der Leute,"}, {"id": 555, "start": 3689.32, "end": 3692.82, "text": "die die Session gejoint sind, das Menü offen hat,"}, {"id": 556, "start": 3693.32, "end": 3695.32, "text": "dann kann niemand mehr die Session verlassen."}, {"id": 557, "start": 3695.82, "end": 3698.32, "text": "Also sprich, wenn ihr jetzt mit ein paar Freunden"}, {"id": 558, "start": 3698.32, "end": 3700.82, "text": "irgendwie in Animal Crossing jemand besucht,"}, {"id": 559, "start": 3700.82, "end": 3703.82, "text": "und es hat einer von den Leuten, die im gleichen Spiel sind,"}, {"id": 560, "start": 3703.82, "end": 3707.82, "text": "das Menü offen, dann könnt ihr das Spiel nicht mehr verlassen."}, {"id": 561, "start": 3710.82, "end": 3712.82, "text": "Exzellent, Nintendo, oder?"}, {"id": 562, "start": 3713.82, "end": 3716.82, "text": "Ach ja, und wenn dann jemand Rage quittet über Menü,"}, {"id": 563, "start": 3717.82, "end": 3719.82, "text": "wenn dann jemand übers Menü Rage quittet,"}, {"id": 564, "start": 3719.82, "end": 3722.82, "text": "verlieren alle, inklusive der Host der Session,"}, {"id": 565, "start": 3722.82, "end": 3730.82, "text": "jeglichen Progress, der gemacht wurde."}, {"id": 566, "start": 3730.82, "end": 3734.82, "text": "Das ist wirklich exzellent, Nintendo-Taktik."}, {"id": 567, "start": 3734.82, "end": 3737.82, "text": "Huge, da hat Nintendo mir die ganze Arbeit geleistet,"}, {"id": 568, "start": 3737.82, "end": 3740.82, "text": "was das angeht. Mir leuchtet es auch nicht ein,"}, {"id": 569, "start": 3740.82, "end": 3744.82, "text": "wie es Nintendo so krass verkacken kann,"}, {"id": 570, "start": 3745.82, "end": 3749.82, "text": "über drei Konsolengenerationen hinweg."}, {"id": 571, "start": 3749.82, "end": 3753.82, "text": "Das leuchtet mir nicht ein, wie das geht."}, {"id": 572, "start": 3754.82, "end": 3760.82, "text": "Das ist ja auf der Wii, das war zu Zeiten von der Xbox 360,"}, {"id": 573, "start": 3760.82, "end": 3763.82, "text": "also schon nach der ersten Xbox, das war zu Zeiten von der Xbox 360"}, {"id": 574, "start": 3763.82, "end": 3766.82, "text": "und der PS3, da war der Online-Modus schon scheiße."}, {"id": 575, "start": 3769.82, "end": 3773.82, "text": "Und da hat man sich gedacht, okay, das ist die erste Online-Konsole,"}, {"id": 576, "start": 3773.82, "end": 3776.82, "text": "so richtig von Nintendo, da müssen die erstmal was draus lernen."}, {"id": 577, "start": 3776.82, "end": 3781.82, "text": "Gut, Wii U kam raus, Online-Modus war zum größten Teil auch scheiße."}, {"id": 578, "start": 3781.82, "end": 3784.82, "text": "Switch kommt raus, Online-Modus zum größten Teil auch scheiße."}, {"id": 579, "start": 3784.82, "end": 3789.82, "text": "Was macht Nintendo denn? Wie unfähig kann man sein,"}, {"id": 580, "start": 3789.82, "end": 3793.82, "text": "im Jahr 2020 ordentliche Online-Funktionen zu basteln?"}, {"id": 581, "start": 3793.82, "end": 3796.82, "text": "Man muss doch gar nichts bahnbrechendes Neues machen."}, {"id": 582, "start": 3796.82, "end": 3799.82, "text": "Man muss einfach nur den Mist nachbauen,"}, {"id": 583, "start": 3799.82, "end": 3801.82, "text": "den die anderen schon gemacht haben."}, {"id": 584, "start": 3801.82, "end": 3804.82, "text": "Das heißt, wenn man keinen Plan hat, was man machen soll,"}, {"id": 585, "start": 3804.82, "end": 3807.82, "text": "dann klaut man es einfach von Microsoft und Sony"}, {"id": 586, "start": 3807.82, "end": 3809.82, "text": "und irgendwelchen x-beliebigen anderen Online-Diensten."}, {"id": 587, "start": 3809.82, "end": 3810.82, "text": "Dann klaut man es einfach."}, {"id": 588, "start": 3810.82, "end": 3812.82, "text": "Dann braucht man auch keine Splatoon-App,"}, {"id": 589, "start": 3812.82, "end": 3814.82, "text": "in der man nicht mal Squats bilden kann oder sonst was."}, {"id": 590, "start": 3815.82, "end": 3817.82, "text": "Dann guckt man sich es einfach ab."}, {"id": 591, "start": 3818.82, "end": 3821.82, "text": "Aber Nintendo ist absolut unfähig, was online angeht."}, {"id": 592, "start": 3821.82, "end": 3831.82, "text": "Was ist eigentlich aus Arms geworden, ihrem E-Sport-Competitive-E-Sport-Game?"}, {"id": 593, "start": 3834.82, "end": 3836.82, "text": "Nee, das ist was anderes."}, {"id": 594, "start": 3836.82, "end": 3857.82, "text": "Arms League? Hä?"}, {"id": 595, "start": 3861.82, "end": 3863.82, "text": "Das ist ein Ingame-Kram."}, {"id": 596, "start": 3863.82, "end": 3866.82, "text": "Das ist ein Ingame-Kram, das hat nichts mit echten Sachen zu tun."}, {"id": 597, "start": 3872.82, "end": 3875.82, "text": "Also sie wollten ja mal hier einen richtig krassen E-Sport starten in Arms."}, {"id": 598, "start": 3875.82, "end": 3878.82, "text": "Das hat halt nicht funktioniert, wahrscheinlich weil der Online-Modus scheiße ist."}, {"id": 599, "start": 3878.82, "end": 3881.82, "text": "Also was wurde denn alles bei Nintendo geleakt?"}, {"id": 600, "start": 3881.82, "end": 3883.82, "text": "Nintendo, A Network, Aldi, also alles."}, {"id": 601, "start": 3883.82, "end": 3885.82, "text": "Im Prinzip alles, was drin ist."}, {"id": 602, "start": 3885.82, "end": 3886.82, "text": "Oh, Geschlecht."}, {"id": 603, "start": 3888.82, "end": 3890.82, "text": "Was ist, wenn da ein anderes Geschlecht drin ist,"}, {"id": 604, "start": 3890.82, "end": 3892.82, "text": "als ich mich jetzt gerade fühle?"}, {"id": 605, "start": 3892.82, "end": 3894.82, "text": "Oh, Nintendo-Anzeige ist raus."}, {"id": 606, "start": 3894.82, "end": 3896.82, "text": "Du bist toll."}, {"id": 607, "start": 3896.82, "end": 3899.82, "text": "Das ist schön, wenn du das so siehst."}, {"id": 608, "start": 3899.82, "end": 3901.82, "text": "Vier Monate in Folge abonniert, nice."}, {"id": 609, "start": 3901.82, "end": 3903.82, "text": "Danke schön für den Sub."}, {"id": 610, "start": 3904.82, "end": 3906.82, "text": "Makes no sense, Dota."}, {"id": 611, "start": 3907.82, "end": 3909.82, "text": "Hyper-Subscriber."}, {"id": 612, "start": 3915.82, "end": 3919.82, "text": "Mich würde interessieren, die meisten anderen veröffentlichen auch ein bisschen was zu."}, {"id": 613, "start": 3919.82, "end": 3921.82, "text": "So, wie ist es dazu gekommen?"}, {"id": 614, "start": 3921.82, "end": 3923.82, "text": "Was war?"}, {"id": 615, "start": 3925.82, "end": 3927.82, "text": "Okay, Dear Customer."}, {"id": 616, "start": 3929.82, "end": 3930.82, "text": "Ah, excellent."}, {"id": 617, "start": 3930.82, "end": 3932.82, "text": "Wir können uns die japanische Stellungnahme angucken."}, {"id": 618, "start": 3935.82, "end": 3939.82, "text": "Ich weiß noch nicht mal, mit welcher E-Mail-Adresse ich überhaupt meinen Nintendo-Account verknüpft habe."}, {"id": 619, "start": 3944.82, "end": 3946.82, "text": "Oh, Beste hier."}, {"id": 620, "start": 3946.82, "end": 3948.82, "text": "Oh, Beste hier."}, {"id": 621, "start": 3954.82, "end": 3958.82, "text": "Ja, muss ich nachher noch mal gucken nach meinem Nintendo-ACC."}, {"id": 622, "start": 3962.82, "end": 3964.82, "text": "Verknäher, aber ja."}, {"id": 623, "start": 3970.82, "end": 3972.82, "text": "Guck mal, jetzt ist wieder komplett lack-free."}, {"id": 624, "start": 3972.82, "end": 3976.82, "text": "Lack-Fryer."}, {"id": 625, "start": 3978.82, "end": 3980.82, "text": "Ja, Knäher-Beer."}, {"id": 626, "start": 3982.82, "end": 3988.82, "text": "Ja, ich wollte eigentlich nicht mehr drauf kommen, auf das Ganze, nur weil ich euch mal kurz noch mal meine Maske zeigen wollte."}, {"id": 627, "start": 3988.82, "end": 3990.82, "text": "Die werde ich dann vielleicht am Montag einweihen."}, {"id": 628, "start": 3990.82, "end": 3994.82, "text": "Ich gehe Montag auf die Bank und heb Geld ab."}, {"id": 629, "start": 3994.82, "end": 3996.82, "text": "Mal gucken, ob die mich mit der Maske reinlassen."}, {"id": 630, "start": 3996.82, "end": 3998.82, "text": "Na, eigentlich waren wir mal am Fragen beantworten."}, {"id": 631, "start": 3998.82, "end": 4000.82, "text": "Wir kommen ja gar nicht hinterher, irgendwas zu machen heute."}, {"id": 632, "start": 4002.82, "end": 4004.82, "text": "Hör mal auf, mit dem Thema, da sag ich nichts zu."}, {"id": 633, "start": 4018.82, "end": 4020.82, "text": "Was? Hä? Um was geht's?"}, {"id": 634, "start": 4020.82, "end": 4024.82, "text": "Ich hab keine Ahnung, auf was sich diese Frage bezieht."}, {"id": 635, "start": 4030.82, "end": 4034.82, "text": "Ach, Kim dort, komm. Was? Der ist bei Knossi dabei."}, {"id": 636, "start": 4034.82, "end": 4036.82, "text": "Okay, irgendwie passt das zusammen."}, {"id": 637, "start": 4036.82, "end": 4038.82, "text": "Irgendwie passt das sogar gut zusammen."}, {"id": 638, "start": 4038.82, "end": 4044.82, "text": "Irgendwie, irgendwie passen die zusammen, ich weiß nicht."}, {"id": 639, "start": 4068.82, "end": 4070.82, "text": "Was?"}, {"id": 640, "start": 4070.82, "end": 4078.82, "text": "Was?"}, {"id": 641, "start": 4092.82, "end": 4094.82, "text": "Nee, kein Overwatch mehr."}, {"id": 642, "start": 4094.82, "end": 4096.82, "text": "Das hatten wir alle schon."}, {"id": 643, "start": 4098.82, "end": 4100.82, "text": "Das hatten wir alle schon."}, {"id": 644, "start": 4108.82, "end": 4110.82, "text": "Das hatten wir doch alle schon."}, {"id": 645, "start": 4112.82, "end": 4114.82, "text": "Hatten wir alle schon."}, {"id": 646, "start": 4118.82, "end": 4120.82, "text": "So, sind wir durch."}, {"id": 647, "start": 4120.82, "end": 4122.82, "text": "Ich wollte euch mal was cooles zeigen, was ich gefunden hab."}, {"id": 648, "start": 4122.82, "end": 4126.82, "text": "Was wir in einem der nächsten Streams ausprobieren müssen."}, {"id": 649, "start": 4126.82, "end": 4134.82, "text": "Zwar hab ich für meine Microcontrollers was gefunden."}, {"id": 650, "start": 4134.82, "end": 4136.82, "text": "Und zwar, es gibt irgendjemand, der hat sich hingesetzt"}, {"id": 651, "start": 4136.82, "end": 4142.82, "text": "und hat eine.NET-Implementierung für ESP32 gebastelt."}, {"id": 652, "start": 4142.82, "end": 4144.82, "text": "Das wollte ich mal ausprobieren in einem der nächsten Streams."}, {"id": 653, "start": 4144.82, "end": 4150.82, "text": "Da kann man wohl die meisten normalen.NET Klassen"}, {"id": 654, "start": 4150.82, "end": 4154.82, "text": "und sie scharf verwenden, um einen ESP32 zu programmieren."}, {"id": 655, "start": 4156.82, "end": 4158.82, "text": "Da bin ich mal gespannt, ob das gut funktioniert."}, {"id": 656, "start": 4158.82, "end": 4160.82, "text": "Weil ich hatte heute wieder viel Spaß mit C++."}, {"id": 657, "start": 4160.82, "end": 4162.82, "text": "Ich geh immer schon wieder mega auf den Keks."}, {"id": 658, "start": 4162.82, "end": 4164.82, "text": "Ich hab mir überlegt, ob ich will einen Stream anmachen"}, {"id": 659, "start": 4164.82, "end": 4166.82, "text": "und mich ein bisschen auskotze."}, {"id": 660, "start": 4166.82, "end": 4168.82, "text": "Aber ich kann nicht jedes Mal einen Stream machen,"}, {"id": 661, "start": 4168.82, "end": 4170.82, "text": "wenn mich C++ nervt."}, {"id": 662, "start": 4170.82, "end": 4172.82, "text": "Weil dann müsste ich ja quasi viermal im Stream"}, {"id": 663, "start": 4172.82, "end": 4174.82, "text": "und mich permanent über C++ aufregen."}, {"id": 664, "start": 4174.82, "end": 4176.82, "text": "Das will ja auch keiner sehen, dass ich mich"}, {"id": 665, "start": 4176.82, "end": 4180.82, "text": "ganz zeitaufrege."}, {"id": 666, "start": 4180.82, "end": 4182.82, "text": "Du wolltest doch mit uns eine neue Programmiersprache"}, {"id": 667, "start": 4182.82, "end": 4184.82, "text": "demnächst lernen."}, {"id": 668, "start": 4184.82, "end": 4186.82, "text": "Ich hab gesagt, wir gucken uns mal"}, {"id": 669, "start": 4186.82, "end": 4188.82, "text": "dieses Cobol-Handbuch an da."}, {"id": 670, "start": 4188.82, "end": 4192.82, "text": "Also just for fun, machen wir ein paar kleine Cobol-Sachen."}, {"id": 671, "start": 4192.82, "end": 4196.82, "text": "Da werd ich aber auch kotzen bei."}, {"id": 672, "start": 4196.82, "end": 4200.82, "text": "Das weiß ich jetzt schon."}, {"id": 673, "start": 4200.82, "end": 4206.82, "text": "Wir hatten doch letztens so Learn Cobol."}, {"id": 674, "start": 4212.82, "end": 4214.82, "text": "Wo hatten wir es denn?"}, {"id": 675, "start": 4214.82, "end": 4220.82, "text": "Muss ich meinen Browser mal wieder updaten?"}, {"id": 676, "start": 4220.82, "end": 4222.82, "text": "Ah, exzellent."}, {"id": 677, "start": 4222.82, "end": 4224.82, "text": "Browser updaten."}, {"id": 678, "start": 4226.82, "end": 4228.82, "text": "Irgendwie hab ich es nicht mehr in der History."}, {"id": 679, "start": 4228.82, "end": 4230.82, "text": "Aber ich hab es mir gebookmarkt"}, {"id": 680, "start": 4230.82, "end": 4232.82, "text": "in meiner To-Do-Liste,"}, {"id": 681, "start": 4232.82, "end": 4234.82, "text": "was wir im Stream machen wollen."}, {"id": 682, "start": 4242.82, "end": 4244.82, "text": "Eine Woche lang C++ Railstream wäre okay."}, {"id": 683, "start": 4244.82, "end": 4246.82, "text": "Ich hab heut wieder was gelernt,"}, {"id": 684, "start": 4246.82, "end": 4248.82, "text": "was mich wieder komplett an C++"}, {"id": 685, "start": 4248.82, "end": 4250.82, "text": "hat zweifeln lassen."}, {"id": 686, "start": 4252.82, "end": 4254.82, "text": "Und zwar wollte ich versuchen..."}, {"id": 687, "start": 4254.82, "end": 4258.82, "text": "Ich zeig's euch, wir haben sie hier noch auf."}, {"id": 688, "start": 4258.82, "end": 4260.82, "text": "Hier, guckt mal."}, {"id": 689, "start": 4260.82, "end": 4262.82, "text": "Das ist hier der Callback"}, {"id": 690, "start": 4262.82, "end": 4264.82, "text": "für den Upload von Updates"}, {"id": 691, "start": 4264.82, "end": 4266.82, "text": "übers WLAN."}, {"id": 692, "start": 4266.82, "end": 4268.82, "text": "Und das wollte ich in eine Klasse packen."}, {"id": 693, "start": 4268.82, "end": 4270.82, "text": "Und dann hab ich festgestellt,"}, {"id": 694, "start": 4270.82, "end": 4272.82, "text": "dass man Funktionen,"}, {"id": 695, "start": 4272.82, "end": 4274.82, "text": "also Methoden einer Klasse"}, {"id": 696, "start": 4274.82, "end": 4276.82, "text": "in C++"}, {"id": 697, "start": 4276.82, "end": 4278.82, "text": "nicht als normale"}, {"id": 698, "start": 4278.82, "end": 4280.82, "text": "Callbacks für C-Funktionen"}, {"id": 699, "start": 4280.82, "end": 4282.82, "text": "verwenden kann."}, {"id": 700, "start": 4282.82, "end": 4284.82, "text": "Und ich dachte,"}, {"id": 701, "start": 4284.82, "end": 4286.82, "text": "warum war das..."}, {"id": 702, "start": 4286.82, "end": 4288.82, "text": "Ich kann die Scharp-Funktionen"}, {"id": 703, "start": 4288.82, "end": 4290.82, "text": "als Callbacks für C verwenden."}, {"id": 704, "start": 4290.82, "end": 4292.82, "text": "Warum kann ich keine C++-Methoden"}, {"id": 705, "start": 4292.82, "end": 4294.82, "text": "als Callbacks für C verwenden?"}, {"id": 706, "start": 4294.82, "end": 4296.82, "text": "Das ist dann wieder"}, {"id": 707, "start": 4296.82, "end": 4298.82, "text": "richtig schwer getan."}, {"id": 708, "start": 4298.82, "end": 4300.82, "text": "Und dann suchst du ein paar Stack-Overflow"}, {"id": 709, "start": 4300.82, "end": 4302.82, "text": "danach und kriegst wieder 20 Seiten"}, {"id": 710, "start": 4302.82, "end": 4304.82, "text": "Templates als Lösung geschickt."}, {"id": 711, "start": 4306.82, "end": 4308.82, "text": "Tim ist die BSF, mir ist auch langweilig."}, {"id": 712, "start": 4308.82, "end": 4310.82, "text": "Ja, dann exzellent."}, {"id": 713, "start": 4310.82, "end": 4312.82, "text": "Das ist hier richtig. Wir können uns zusammen langweilen."}, {"id": 714, "start": 4312.82, "end": 4314.82, "text": "Empfehlung für externe"}, {"id": 715, "start": 4314.82, "end": 4316.82, "text": "Festplatte für Backups."}, {"id": 716, "start": 4320.82, "end": 4322.82, "text": "Wie willst du das machen?"}, {"id": 717, "start": 4322.82, "end": 4324.82, "text": "Willst du eine externe Festplatte haben, die du einfach per USB"}, {"id": 718, "start": 4324.82, "end": 4326.82, "text": "dranstöpselst? Oder willst du irgendein"}, {"id": 719, "start": 4326.82, "end": 4328.82, "text": "Netzwerklaufwerk haben?"}, {"id": 720, "start": 4334.82, "end": 4336.82, "text": "Was meinst du mit Callback?"}, {"id": 721, "start": 4336.82, "end": 4338.82, "text": "Sowas hier."}, {"id": 722, "start": 4338.82, "end": 4340.82, "text": "Also sprich, die Funktion wird aufgerufen,"}, {"id": 723, "start": 4340.82, "end": 4342.82, "text": "wenn sich irgendwie einer auf die"}, {"id": 724, "start": 4342.82, "end": 4344.82, "text": "Uhr unter"}, {"id": 725, "start": 4344.82, "end": 4346.82, "text": "update verbindet. Da wird die Funktion"}, {"id": 726, "start": 4346.82, "end": 4348.82, "text": "aufgerufen und das Update"}, {"id": 727, "start": 4348.82, "end": 4350.82, "text": "wird durchgeführt. Das ist halt ein"}, {"id": 728, "start": 4350.82, "end": 4352.82, "text": "Callback"}, {"id": 729, "start": 4352.82, "end": 4354.82, "text": "in diese Funktion."}, {"id": 730, "start": 4354.82, "end": 4356.82, "text": "Die Funktion wird dann aufgerufen, wenn es so weit ist."}, {"id": 731, "start": 4356.82, "end": 4358.82, "text": "Das geht nicht."}, {"id": 732, "start": 4358.82, "end": 4360.82, "text": "Ganz simpel, per USB."}, {"id": 733, "start": 4362.82, "end": 4364.82, "text": "Nee, habe ich jetzt keinen speziellen"}, {"id": 734, "start": 4364.82, "end": 4366.82, "text": "Tipp, aber was vor einer"}, {"id": 735, "start": 4366.82, "end": 4368.82, "text": "Zeit, der"}, {"id": 736, "start": 4368.82, "end": 4370.82, "text": "auf"}, {"id": 737, "start": 4370.82, "end": 4372.82, "text": "was war das?"}, {"id": 738, "start": 4372.82, "end": 4374.82, "text": "Data Horder."}, {"id": 739, "start": 4374.82, "end": 4376.82, "text": "Das ist manchmal ganz interessant zu lesen."}, {"id": 740, "start": 4376.82, "end": 4378.82, "text": "Das sind dann Leute, wo irgendwie"}, {"id": 741, "start": 4378.82, "end": 4380.82, "text": "ihre 5 petabyte"}, {"id": 742, "start": 4384.82, "end": 4386.82, "text": "Webcam-Sammlung haben oder so."}, {"id": 743, "start": 4388.82, "end": 4390.82, "text": "Kennt ihr noch den Typ, der"}, {"id": 744, "start": 4390.82, "end": 4392.82, "text": "Amazon Unlimited"}, {"id": 745, "start": 4392.82, "end": 4394.82, "text": "auch wirklich Unlimited"}, {"id": 746, "start": 4394.82, "end": 4396.82, "text": "gemacht hat?"}, {"id": 747, "start": 4396.82, "end": 4398.82, "text": "Wie der das gemacht hat?"}, {"id": 748, "start": 4398.82, "end": 4400.82, "text": "Das habe ich euch glaube ich schon mal erzählt."}, {"id": 749, "start": 4400.82, "end": 4402.82, "text": "Als Amazon Unlimited"}, {"id": 750, "start": 4402.82, "end": 4404.82, "text": "noch wirklich Unlimited war,"}, {"id": 751, "start": 4404.82, "end": 4406.82, "text": "wollte halt irgendein Typ,"}, {"id": 752, "start": 4406.82, "end": 4408.82, "text": "ich sage gleich was zur Festplatte,"}, {"id": 753, "start": 4408.82, "end": 4410.82, "text": "wollte irgendein Typ das Ganze"}, {"id": 754, "start": 4410.82, "end": 4412.82, "text": "testen, ob das wirklich Unlimited ist,"}, {"id": 755, "start": 4412.82, "end": 4414.82, "text": "was Amazon da sagt."}, {"id": 756, "start": 4414.82, "end": 4416.82, "text": "Und was hat er gemacht? Er konnte ja schlecht"}, {"id": 757, "start": 4416.82, "end": 4418.82, "text": "petabyte oder"}, {"id": 758, "start": 4418.82, "end": 4420.82, "text": "terabyteweise Daten hochladen."}, {"id": 759, "start": 4420.82, "end": 4422.82, "text": "Funktioniert ja nicht."}, {"id": 760, "start": 4422.82, "end": 4424.82, "text": "Bist du Amazon voll geladen, hast du über deinen"}, {"id": 761, "start": 4424.82, "end": 4426.82, "text": "DSL Anschluss, ist ja schon"}, {"id": 762, "start": 4426.82, "end": 4428.82, "text": "die Welt zu Ende."}, {"id": 763, "start": 4428.82, "end": 4430.82, "text": "Und dementsprechend ist er hergegangen, hat sich gedacht,"}, {"id": 764, "start": 4430.82, "end": 4432.82, "text": "was gibt es im Internet denn massig?"}, {"id": 765, "start": 4432.82, "end": 4434.82, "text": "Und da ist er auf Porn gekommen."}, {"id": 766, "start": 4434.82, "end": 4436.82, "text": "Und da hat er was"}, {"id": 767, "start": 4436.82, "end": 4438.82, "text": "programmiert auf irgendeinem Server mit einer schnellen"}, {"id": 768, "start": 4438.82, "end": 4440.82, "text": "Anbindung, der versucht"}, {"id": 769, "start": 4440.82, "end": 4442.82, "text": "hat, jegliche"}, {"id": 770, "start": 4442.82, "end": 4444.82, "text": "Livecam"}, {"id": 771, "start": 4444.82, "end": 4446.82, "text": "Grills mitzuschneiden und"}, {"id": 772, "start": 4446.82, "end": 4448.82, "text": "bei Amazon hochzuladen."}, {"id": 773, "start": 4448.82, "end": 4450.82, "text": "Auf allen möglichen"}, {"id": 774, "start": 4450.82, "end": 4452.82, "text": "Livecam Seiten hat er"}, {"id": 775, "start": 4452.82, "end": 4454.82, "text": "die Sessions mitgeschnitten"}, {"id": 776, "start": 4454.82, "end": 4456.82, "text": "und hat sie bei Amazon hochgeladen."}, {"id": 777, "start": 4456.82, "end": 4458.82, "text": "Und Amazon war wirklich Unlimited."}, {"id": 778, "start": 4458.82, "end": 4460.82, "text": "Amazon hat das nicht gelöscht"}, {"id": 779, "start": 4460.82, "end": 4462.82, "text": "und hat ihn nicht geblockt oder sonst was."}, {"id": 780, "start": 4462.82, "end": 4464.82, "text": "Ich persönlich gehe ja davon aus,"}, {"id": 781, "start": 4464.82, "end": 4466.82, "text": "dass die Amazon Admins"}, {"id": 782, "start": 4466.82, "end": 4468.82, "text": "das"}, {"id": 783, "start": 4468.82, "end": 4470.82, "text": "gut fanden und ihn deswegen nicht gebannt"}, {"id": 784, "start": 4470.82, "end": 4472.82, "text": "haben."}, {"id": 785, "start": 4472.82, "end": 4474.82, "text": "Die haben wahrscheinlich gedacht, endlich"}, {"id": 786, "start": 4474.82, "end": 4476.82, "text": "haben wir hier was zu tun, wenn wir die ganze"}, {"id": 787, "start": 4476.82, "end": 4478.82, "text": "Zeit auf unser Monitoring gucken und nichts passiert."}, {"id": 788, "start": 4486.82, "end": 4488.82, "text": "So."}, {"id": 789, "start": 4488.82, "end": 4490.82, "text": "Was wollte ich jetzt sagen? Festplatte."}, {"id": 790, "start": 4490.82, "end": 4492.82, "text": "Genau, hier bei Dataorder habe ich letztens was gesehen."}, {"id": 791, "start": 4498.82, "end": 4500.82, "text": "Externe Festplatten, wo man die"}, {"id": 792, "start": 4500.82, "end": 4502.82, "text": "wobei das"}, {"id": 793, "start": 4502.82, "end": 4504.82, "text": "ist jetzt eher interessant, wenn man"}, {"id": 794, "start": 4504.82, "end": 4506.82, "text": "sich in Last bauen will, externe Festplatten,"}, {"id": 795, "start": 4506.82, "end": 4508.82, "text": "die man günstiger bekommt, als die Festplatte,"}, {"id": 796, "start": 4508.82, "end": 4510.82, "text": "die drin ist. Klingt jetzt erstmal"}, {"id": 797, "start": 4510.82, "end": 4512.82, "text": "merkwürdig, aber war so."}, {"id": 798, "start": 4512.82, "end": 4514.82, "text": "Also sprich, es gab externe"}, {"id": 799, "start": 4514.82, "end": 4516.82, "text": "Laufwerke,"}, {"id": 800, "start": 4516.82, "end": 4518.82, "text": "die günstiger waren, als"}, {"id": 801, "start": 4518.82, "end": 4520.82, "text": "die Festplatten, die drin waren. Und da konnte"}, {"id": 802, "start": 4520.82, "end": 4522.82, "text": "man sich wunderbar die Platten rausrippen."}, {"id": 803, "start": 4524.82, "end": 4526.82, "text": "Wäre vielleicht auch für dich eine Option,"}, {"id": 804, "start": 4526.82, "end": 4528.82, "text": "wenn du schon einen USB-Festplatten"}, {"id": 805, "start": 4528.82, "end": 4530.82, "text": "Wechselrahmen oder sowas hast."}, {"id": 806, "start": 4530.82, "end": 4532.82, "text": "Aber ansonsten,"}, {"id": 807, "start": 4532.82, "end": 4534.82, "text": "jetzt wirklich ein Tipp,"}, {"id": 808, "start": 4534.82, "end": 4536.82, "text": "für eine USB-Festplatte habe ich"}, {"id": 809, "start": 4536.82, "end": 4538.82, "text": "ehrlich gesagt nicht."}, {"id": 810, "start": 4538.82, "end": 4540.82, "text": "Aber ich glaube, man kann da"}, {"id": 811, "start": 4540.82, "end": 4542.82, "text": "ehrlich, ich glaube, man kann da auch gar nicht"}, {"id": 812, "start": 4542.82, "end": 4544.82, "text": "so viel verkehrt machen."}, {"id": 813, "start": 4544.82, "end": 4546.82, "text": "Ich würde einfach nur gucken, was gerade"}, {"id": 814, "start": 4546.82, "end": 4548.82, "text": "die günstigste Terabyte zu Cent ist"}, {"id": 815, "start": 4548.82, "end": 4550.82, "text": "und mir davon was kaufen."}, {"id": 816, "start": 4556.82, "end": 4558.82, "text": "Was Funktionen im Konstrakte"}, {"id": 817, "start": 4558.82, "end": 4560.82, "text": "und dir fehlt der Rückgabewert oder wie?"}, {"id": 818, "start": 4560.82, "end": 4562.82, "text": "Was?"}, {"id": 819, "start": 4566.82, "end": 4568.82, "text": "Hast du dir schon"}, {"id": 820, "start": 4568.82, "end": 4570.82, "text": "Diret X 12 Ultimate"}, {"id": 821, "start": 4572.82, "end": 4574.82, "text": "angeschaut? Nee, ich wusste gar nicht, dass es von"}, {"id": 822, "start": 4574.82, "end": 4576.82, "text": "3D-Frameworks jetzt auch"}, {"id": 823, "start": 4576.82, "end": 4578.82, "text": "Ultimate Editions gibt. Wann gibt es denn Diret X"}, {"id": 824, "start": 4578.82, "end": 4580.82, "text": "Season Pass"}, {"id": 825, "start": 4580.82, "end": 4604.82, "text": "oder so?"}, {"id": 826, "start": 4604.82, "end": 4606.82, "text": "Ja, genau, Sebaro, sowas."}, {"id": 827, "start": 4606.82, "end": 4608.82, "text": "Der Sebaro hat mal wieder hier"}, {"id": 828, "start": 4608.82, "end": 4610.82, "text": "den Link am Start."}, {"id": 829, "start": 4610.82, "end": 4612.82, "text": "Genau sowas hier."}, {"id": 830, "start": 4614.82, "end": 4616.82, "text": "Wie sehr sich das jetzt"}, {"id": 831, "start": 4616.82, "end": 4618.82, "text": "lohnt, weiß ich nicht. Muss man mal sich genau angucken."}, {"id": 832, "start": 4618.82, "end": 4620.82, "text": "Aber da gibt es ab und zu mal"}, {"id": 833, "start": 4620.82, "end": 4622.82, "text": "Angebote. Da sind die externen Festplatten günstiger"}, {"id": 834, "start": 4622.82, "end": 4624.82, "text": "als das, was drin ist. Und man"}, {"id": 835, "start": 4624.82, "end": 4626.82, "text": "kriegt, man spart dann irgendwie 30 Euro am Ende"}, {"id": 836, "start": 4626.82, "end": 4628.82, "text": "oder so."}, {"id": 837, "start": 4632.82, "end": 4634.82, "text": "USB-Festplatte"}, {"id": 838, "start": 4634.82, "end": 4636.82, "text": "ist viel zu langsam. Nö, wenn man USB..."}, {"id": 839, "start": 4636.82, "end": 4638.82, "text": "Also alles ab USB 3 ist"}, {"id": 840, "start": 4638.82, "end": 4640.82, "text": "erträglich."}, {"id": 841, "start": 4642.82, "end": 4644.82, "text": "Und jetzt kommt mir nicht mehr die"}, {"id": 842, "start": 4644.82, "end": 4646.82, "text": "Diskussion, was jetzt für ein USB 3."}, {"id": 843, "start": 4646.82, "end": 4648.82, "text": "3.0, 3.1, 3.2,"}, {"id": 844, "start": 4648.82, "end": 4650.82, "text": "Gen 2x2,"}, {"id": 845, "start": 4650.82, "end": 4652.82, "text": "Gen 2x1, Gen 2x3,"}, {"id": 846, "start": 4652.82, "end": 4654.82, "text": "3x1."}, {"id": 847, "start": 4654.82, "end": 4656.82, "text": "Alles ab USB 3."}, {"id": 848, "start": 4656.82, "end": 4658.82, "text": "Alles, was einen blauen"}, {"id": 849, "start": 4658.82, "end": 4674.82, "text": "Stecker hat, ist okay."}, {"id": 850, "start": 4674.82, "end": 4676.82, "text": "Frag nicht, was für USB. USB 3.2,"}, {"id": 851, "start": 4676.82, "end": 4678.82, "text": "Gen 2x2."}, {"id": 852, "start": 4678.82, "end": 4680.82, "text": "Nee, es ist USB 3.2,"}, {"id": 853, "start": 4680.82, "end": 4682.82, "text": "Gen 2x2. Ich glaube das"}, {"id": 854, "start": 4682.82, "end": 4684.82, "text": "Gen 2 kommt an der Stelle weg."}, {"id": 855, "start": 4684.82, "end": 4686.82, "text": "Es gibt ja auch USB"}, {"id": 856, "start": 4686.82, "end": 4688.82, "text": "3.2,"}, {"id": 857, "start": 4688.82, "end": 4690.82, "text": "Gen 1,"}, {"id": 858, "start": 4690.82, "end": 4692.82, "text": "2x1."}, {"id": 859, "start": 4692.82, "end": 4694.82, "text": "Ich habe da mal irgendwann ein Video drüber gemacht,"}, {"id": 860, "start": 4694.82, "end": 4696.82, "text": "dass das USB-Cremium"}, {"id": 861, "start": 4696.82, "end": 4698.82, "text": "absolut Dachschaden"}, {"id": 862, "start": 4698.82, "end": 4700.82, "text": "hat, was"}, {"id": 863, "start": 4700.82, "end": 4702.82, "text": "die Benahmung angeht und anscheinend"}, {"id": 864, "start": 4702.82, "end": 4704.82, "text": "haben es mittlerweile auf 50.000 Leute geguckt."}, {"id": 865, "start": 4704.82, "end": 4706.82, "text": "Okay, nice."}, {"id": 866, "start": 4706.82, "end": 4708.82, "text": "Haben mir 50.000 Leute zugehört,"}, {"id": 867, "start": 4708.82, "end": 4710.82, "text": "fühle ich mich über das USB-Forum aufregelt."}, {"id": 868, "start": 4710.82, "end": 4712.82, "text": "Ich glaube, dass das USB-Forum"}, {"id": 869, "start": 4712.82, "end": 4714.82, "text": "und das C++-Cremium,"}, {"id": 870, "start": 4714.82, "end": 4716.82, "text": "dass da große Überschneidungen sind,"}, {"id": 871, "start": 4716.82, "end": 4718.82, "text": "was die Leute angeht."}, {"id": 872, "start": 4734.82, "end": 4736.82, "text": "3K-Likes und rein"}, {"id": 873, "start": 4736.82, "end": 4744.82, "text": "auf 50.000 Likes."}, {"id": 874, "start": 4766.82, "end": 4768.82, "text": "Was soll ich heute machen?"}, {"id": 875, "start": 4768.82, "end": 4770.82, "text": "Außer euch mit sinnlosen"}, {"id": 876, "start": 4772.82, "end": 4774.82, "text": "sinnlosen Emotes voll zu spammen."}, {"id": 877, "start": 4780.82, "end": 4782.82, "text": "DirectX 10 Ultimate."}, {"id": 878, "start": 4782.82, "end": 4784.82, "text": "Was ist DirectX 12 Ultimate?"}, {"id": 879, "start": 4786.82, "end": 4788.82, "text": "Na, dann Java im Leben nicht."}, {"id": 880, "start": 4788.82, "end": 4790.82, "text": "Nee, nee, nee, C++ war ich heute immer."}, {"id": 881, "start": 4790.82, "end": 4792.82, "text": "Announcing DirectX"}, {"id": 882, "start": 4792.82, "end": 4794.82, "text": "12 Ultimate."}, {"id": 883, "start": 4794.82, "end": 4796.82, "text": "Das ist ein April-Scherz."}, {"id": 884, "start": 4796.82, "end": 4798.82, "text": "Nee, ist es nicht."}, {"id": 885, "start": 4804.82, "end": 4806.82, "text": "We are beyond pleased."}, {"id": 886, "start": 4806.82, "end": 4808.82, "text": "Oh, das klingt"}, {"id": 887, "start": 4808.82, "end": 4810.82, "text": "ja mal wieder."}, {"id": 888, "start": 4810.82, "end": 4812.82, "text": "Auf meine Ideen ist,"}, {"id": 889, "start": 4812.82, "end": 4814.82, "text": "ich habe meine Notizen nicht gesunken."}, {"id": 890, "start": 4814.82, "end": 4816.82, "text": "Ich sehe sie gerade nicht."}, {"id": 891, "start": 4818.82, "end": 4820.82, "text": "Also im Prinzip"}, {"id": 892, "start": 4820.82, "end": 4822.82, "text": "hätte man das Ganze auch"}, {"id": 893, "start": 4822.82, "end": 4824.82, "text": "13 nennen können, oder?"}, {"id": 894, "start": 4824.82, "end": 4826.82, "text": "Aber Microsoft hat es ja"}, {"id": 895, "start": 4826.82, "end": 4828.82, "text": "mit Benamen nicht."}, {"id": 896, "start": 4828.82, "end": 4830.82, "text": "Übrigens noch mal eine richtige Pepega-Sache,"}, {"id": 897, "start": 4830.82, "end": 4832.82, "text": "was Microsoft-Benamung angeht."}, {"id": 898, "start": 4834.82, "end": 4836.82, "text": "Die hatten ja früher"}, {"id": 899, "start": 4836.82, "end": 4838.82, "text": "das ganz normale.NET-Framework."}, {"id": 900, "start": 4840.82, "end": 4842.82, "text": "Das ist ja deprecated"}, {"id": 901, "start": 4842.82, "end": 4844.82, "text": "im Endeffekt und jetzt gibt es ja.NET Core."}, {"id": 902, "start": 4846.82, "end": 4848.82, "text": "So, und Microsoft hat sich jetzt"}, {"id": 903, "start": 4848.82, "end": 4850.82, "text": "überlegt, sie hatten jetzt.NET Core"}, {"id": 904, "start": 4850.82, "end": 4852.82, "text": "1.1.1.2.2.1.3."}, {"id": 905, "start": 4854.82, "end": 4856.82, "text": "Also immer.NET Core."}, {"id": 906, "start": 4856.82, "end": 4858.82, "text": "Alles gut von der Benamung her."}, {"id": 907, "start": 4858.82, "end": 4860.82, "text": "1.0.1.2.0.2.1.2.2.3.0.3.1"}, {"id": 908, "start": 4860.82, "end": 4862.82, "text": "So, und das nächste ist.NET"}, {"id": 909, "start": 4862.82, "end": 4864.82, "text": "5."}, {"id": 910, "start": 4864.82, "end": 4866.82, "text": "Die lassen das Core wieder weg."}, {"id": 911, "start": 4866.82, "end": 4868.82, "text": "Und dann ist es jetzt.NET 5."}, {"id": 912, "start": 4868.82, "end": 4870.82, "text": "Was übelst verwirrend ist, weil das.NET"}, {"id": 913, "start": 4870.82, "end": 4872.82, "text": "Framework war, die letzte Version,"}, {"id": 914, "start": 4872.82, "end": 4874.82, "text": "4.8."}, {"id": 915, "start": 4874.82, "end": 4876.82, "text": "Und.NET 5"}, {"id": 916, "start": 4876.82, "end": 4878.82, "text": "hat mit dem.NET Framework"}, {"id": 917, "start": 4878.82, "end": 4880.82, "text": "4.8 nichts zu tun."}, {"id": 918, "start": 4880.82, "end": 4882.82, "text": "Und auch im Prinzip"}, {"id": 919, "start": 4882.82, "end": 4884.82, "text": "ist.NET 5 der Nachfolger"}, {"id": 920, "start": 4884.82, "end": 4886.82, "text": "von.NET Core 3,"}, {"id": 921, "start": 4886.82, "end": 4888.82, "text": "wo man das Core aber weglässt."}, {"id": 922, "start": 4888.82, "end": 4890.82, "text": "Und wo es noch verwirrender wird, ist"}, {"id": 923, "start": 4890.82, "end": 4892.82, "text": "ihr Datenbank-Zugriffs-Framework."}, {"id": 924, "start": 4894.82, "end": 4896.82, "text": "Das heißt ja aktuell Entity Framework Core."}, {"id": 925, "start": 4898.82, "end": 4900.82, "text": "Immer mit der gleichen Version"}, {"id": 926, "start": 4900.82, "end": 4902.82, "text": "wie.NET."}, {"id": 927, "start": 4904.82, "end": 4906.82, "text": "Also sprich aktuell heißt es"}, {"id": 928, "start": 4906.82, "end": 4908.82, "text": "dann Entity Framework Core 3."}, {"id": 929, "start": 4908.82, "end": 4910.82, "text": "Und dann haben sie sich jetzt"}, {"id": 930, "start": 4910.82, "end": 4912.82, "text": "überlegt, sie nennen das dann"}, {"id": 931, "start": 4912.82, "end": 4914.82, "text": "in.NET 5, nennen sie das dann auch wieder"}, {"id": 932, "start": 4914.82, "end": 4916.82, "text": "Entity Framework 5."}, {"id": 933, "start": 4916.82, "end": 4918.82, "text": "Und der Witz ist, dass das"}, {"id": 934, "start": 4918.82, "end": 4920.82, "text": "ganz, ganz alte Entity"}, {"id": 935, "start": 4920.82, "end": 4922.82, "text": "Framework im alten"}, {"id": 936, "start": 4922.82, "end": 4924.82, "text": ".NET Framework hieß 6."}, {"id": 937, "start": 4924.82, "end": 4926.82, "text": "Das heißt wir haben"}, {"id": 938, "start": 4926.82, "end": 4928.82, "text": ".NET 5, was mit"}, {"id": 939, "start": 4928.82, "end": 4930.82, "text": ".NET Framework 4.8 nichts"}, {"id": 940, "start": 4930.82, "end": 4932.82, "text": "zu tun hat. Und wir haben Entity"}, {"id": 941, "start": 4932.82, "end": 4934.82, "text": "Framework 6, wir haben"}, {"id": 942, "start": 4934.82, "end": 4936.82, "text": "Entity Framework 5, was"}, {"id": 943, "start": 4936.82, "end": 4938.82, "text": "jetzt nach Entity Framework"}, {"id": 944, "start": 4938.82, "end": 4940.82, "text": "6 rauskommt, aber neuer"}, {"id": 945, "start": 4940.82, "end": 4942.82, "text": "ist und auf anderer Sache basiert."}, {"id": 946, "start": 4942.82, "end": 4944.82, "text": "Was ist mit Microsoft"}, {"id": 947, "start": 4944.82, "end": 4946.82, "text": "los?"}, {"id": 948, "start": 4946.82, "end": 4948.82, "text": "Die haben sie nämlich alle, was"}, {"id": 949, "start": 4948.82, "end": 4950.82, "text": "das angeht. Wie bescheuert kann man eigentlich"}, {"id": 950, "start": 4950.82, "end": 4952.82, "text": "sein?"}, {"id": 951, "start": 4952.82, "end": 4954.82, "text": "Was soll man von einer Firma"}, {"id": 952, "start": 4954.82, "end": 4956.82, "text": "erwarten, die Windows 9 übersprungen hat?"}, {"id": 953, "start": 4956.82, "end": 4958.82, "text": "Naja, dass man Windows 9"}, {"id": 954, "start": 4958.82, "end": 4960.82, "text": "übersprungen hat, wenigstens ging es"}, {"id": 955, "start": 4960.82, "end": 4962.82, "text": "aufwärts mit der Zahl."}, {"id": 956, "start": 4962.82, "end": 4964.82, "text": "Und nicht wie bei Battlefield von 4 auf 1."}, {"id": 957, "start": 4966.82, "end": 4968.82, "text": "Ist doch alles voll logisch."}, {"id": 958, "start": 4968.82, "end": 4970.82, "text": "Also wer das logisch findet, findet auch die Battlefield"}, {"id": 959, "start": 4970.82, "end": 4972.82, "text": "Benamung logisch und die Xbox Benamung"}, {"id": 960, "start": 4972.82, "end": 4974.82, "text": "logisch."}, {"id": 961, "start": 4974.82, "end": 4976.82, "text": "Aber das ist wirklich, das ist"}, {"id": 962, "start": 4976.82, "end": 4978.82, "text": "komplett, einfach nur total"}, {"id": 963, "start": 4978.82, "end": 4980.82, "text": "hängen geblieben."}, {"id": 964, "start": 4982.82, "end": 4984.82, "text": "Guck mal, was Heise dazu schreibt."}, {"id": 965, "start": 4984.82, "end": 4988.82, "text": "Ultimate."}, {"id": 966, "start": 4992.82, "end": 4994.82, "text": "Ok, das ist im Prinzip, im Prinzip"}, {"id": 967, "start": 4994.82, "end": 4996.82, "text": "scheint es wahrscheinlich, Dialog X 12.1"}, {"id": 968, "start": 4996.82, "end": 4998.82, "text": "oder sowas zu sein."}, {"id": 969, "start": 5004.82, "end": 5006.82, "text": "Gut, da kann ich nichts zu sagen."}, {"id": 970, "start": 5006.82, "end": 5008.82, "text": "Wie gesagt, ich sag's ja jedes Mal,"}, {"id": 971, "start": 5008.82, "end": 5010.82, "text": "ich bin nicht der große"}, {"id": 972, "start": 5010.82, "end": 5012.82, "text": "Grafikprogrammierer."}, {"id": 973, "start": 5012.82, "end": 5014.82, "text": "Das Einzige, was ich mal in 3D gemacht"}, {"id": 974, "start": 5014.82, "end": 5016.82, "text": "hab, was man 3D,"}, {"id": 975, "start": 5016.82, "end": 5018.82, "text": "nur einsatzweise 3D nennen kann,"}, {"id": 976, "start": 5018.82, "end": 5020.82, "text": "ist die T-Kanne in OpenGL,"}, {"id": 977, "start": 5020.82, "end": 5022.82, "text": "diese Standard, die Standard T-Kanne,"}, {"id": 978, "start": 5022.82, "end": 5024.82, "text": "den Standard Teapot in OpenGL"}, {"id": 979, "start": 5024.82, "end": 5026.82, "text": "einmal zu rendern."}, {"id": 980, "start": 5026.82, "end": 5028.82, "text": "Mit Rust."}, {"id": 981, "start": 5028.82, "end": 5030.82, "text": "Ich hab mir ein Rust OpenGL Tutorial angeguckt."}, {"id": 982, "start": 5030.82, "end": 5032.82, "text": "So die Standard,"}, {"id": 983, "start": 5032.82, "end": 5034.82, "text": "Standard T-Kanne,"}, {"id": 984, "start": 5034.82, "end": 5036.82, "text": "die kennt glaube ich jeder, der ein bisschen"}, {"id": 985, "start": 5036.82, "end": 5038.82, "text": "was mit Grafik Sachen gemacht hat,"}, {"id": 986, "start": 5038.82, "end": 5040.82, "text": "die Standard T-Kanne."}, {"id": 987, "start": 5040.82, "end": 5042.82, "text": "Ich weiß auch nicht, warum,"}, {"id": 988, "start": 5042.82, "end": 5044.82, "text": "warum ausgerechnet eine T-Kanne."}, {"id": 989, "start": 5044.82, "end": 5046.82, "text": "Keine Ahnung."}, {"id": 990, "start": 5046.82, "end": 5048.82, "text": "Und ansonsten"}, {"id": 991, "start": 5048.82, "end": 5050.82, "text": "hab ich mit Dialog X eigentlich nur 2D"}, {"id": 992, "start": 5050.82, "end": 5052.82, "text": "Sachen gemacht."}, {"id": 993, "start": 5052.82, "end": 5054.82, "text": "Video rescalen"}, {"id": 994, "start": 5054.82, "end": 5056.82, "text": "und so Sachen, aber"}, {"id": 995, "start": 5056.82, "end": 5058.82, "text": "nie"}, {"id": 996, "start": 5058.82, "end": 5060.82, "text": "irgendwelche großartige"}, {"id": 997, "start": 5060.82, "end": 5070.82, "text": "3D-Programmiergeschichten."}, {"id": 998, "start": 5070.82, "end": 5072.82, "text": "Und was ist mit 0.3D?"}, {"id": 999, "start": 5072.82, "end": 5074.82, "text": "0.3D ist, ich weiß,"}, {"id": 1000, "start": 5074.82, "end": 5076.82, "text": "es ist schwer zu glauben,"}, {"id": 1001, "start": 5076.82, "end": 5078.82, "text": "aber 0.3D ist bloß eine Illusion."}, {"id": 1002, "start": 5078.82, "end": 5082.82, "text": "Das ist gar nicht wirklich 3D."}, {"id": 1003, "start": 5082.82, "end": 5084.82, "text": "Schau dir mal die Proposals"}, {"id": 1004, "start": 5084.82, "end": 5086.82, "text": "für C-Sharp 9 an,"}, {"id": 1005, "start": 5086.82, "end": 5088.82, "text": "das ist eine gute Idee."}, {"id": 1006, "start": 5088.82, "end": 5090.82, "text": "Oho!"}, {"id": 1007, "start": 5090.82, "end": 5092.82, "text": "Das ist,"}, {"id": 1008, "start": 5092.82, "end": 5094.82, "text": "das, das machen wir,"}, {"id": 1009, "start": 5094.82, "end": 5096.82, "text": "das machen wir wirklich mal."}, {"id": 1010, "start": 5096.82, "end": 5098.82, "text": "Ähm,"}, {"id": 1011, "start": 5098.82, "end": 5100.82, "text": "das ist eine gute Idee."}, {"id": 1012, "start": 5100.82, "end": 5102.82, "text": "Gerade mal kurz gucken, dass ich keine Fragen"}, {"id": 1013, "start": 5102.82, "end": 5104.82, "text": "über sehen hab."}, {"id": 1014, "start": 5104.82, "end": 5106.82, "text": "Ich glaube in der Seite haben sie wahrscheinlich"}, {"id": 1015, "start": 5106.82, "end": 5108.82, "text": "Sachen drinnen."}, {"id": 1016, "start": 5108.82, "end": 5110.82, "text": "Steht doch hier, hier, Candidate für 9.0."}, {"id": 1017, "start": 5110.82, "end": 5112.82, "text": "Bei C-Sharp geht's wenigstens."}, {"id": 1018, "start": 5112.82, "end": 5114.82, "text": "Da heißt der Kram wenigstens"}, {"id": 1019, "start": 5114.82, "end": 5116.82, "text": "immer aufsteigend."}, {"id": 1020, "start": 5116.82, "end": 5118.82, "text": "Brauchst du ein Clear All?"}, {"id": 1021, "start": 5118.82, "end": 5120.82, "text": "Tatsächlich, aber ich hab keinen Bock"}, {"id": 1022, "start": 5120.82, "end": 5122.82, "text": "das Programm mehr anzufassen."}, {"id": 1023, "start": 5132.82, "end": 5134.82, "text": "Per zu wechseln, ne."}, {"id": 1024, "start": 5134.82, "end": 5136.82, "text": "Wieso ist C++"}, {"id": 1025, "start": 5136.82, "end": 5138.82, "text": "die beste Programmiersprache?"}, {"id": 1026, "start": 5138.82, "end": 5140.82, "text": "Das ist, also, das ist so offensichtlicher"}, {"id": 1027, "start": 5140.82, "end": 5142.82, "text": "Gebate."}, {"id": 1028, "start": 5142.82, "end": 5146.82, "text": "Da geh ich nicht drauf ein."}, {"id": 1029, "start": 5146.82, "end": 5148.82, "text": "Ne,"}, {"id": 1030, "start": 5148.82, "end": 5150.82, "text": "hab ich nicht. Ich warte bis es auf den PC"}, {"id": 1031, "start": 5150.82, "end": 5152.82, "text": "kommt, dann vielleicht."}, {"id": 1032, "start": 5162.82, "end": 5164.82, "text": "Hast du schon Abend gegessen? Ja, hab ich."}, {"id": 1033, "start": 5164.82, "end": 5166.82, "text": "Hab ich schon ganz am Anfang erzählt."}, {"id": 1034, "start": 5166.82, "end": 5168.82, "text": "Ich hab den ganzen Tag nichts gegessen"}, {"id": 1035, "start": 5168.82, "end": 5170.82, "text": "und Abend erst mal 6 Toastbrote."}, {"id": 1036, "start": 5170.82, "end": 5172.82, "text": "Huge, gesunde,"}, {"id": 1037, "start": 5172.82, "end": 5174.82, "text": "wahnsinnig gesunde Toastbrote."}, {"id": 1038, "start": 5174.82, "end": 5176.82, "text": "3x Nutella, 3x Erdnussbutter."}, {"id": 1039, "start": 5184.82, "end": 5186.82, "text": "Hast du ein Laptop favorit mit Linux?"}, {"id": 1040, "start": 5186.82, "end": 5188.82, "text": "Hm."}, {"id": 1041, "start": 5188.82, "end": 5190.82, "text": "Ich hab nur auf den Notebooks das ganze"}, {"id": 1042, "start": 5190.82, "end": 5192.82, "text": "ausprobiert, die wir auf der Arbeit haben."}, {"id": 1043, "start": 5192.82, "end": 5194.82, "text": "Ich hab ja privat seit Jahren schon kein Notebook"}, {"id": 1044, "start": 5194.82, "end": 5196.82, "text": "mehr. Ich hab"}, {"id": 1045, "start": 5196.82, "end": 5198.82, "text": "einen alten AMD Notebook,"}, {"id": 1046, "start": 5198.82, "end": 5200.82, "text": "das ist aber schon 10 Jahre alt oder so."}, {"id": 1047, "start": 5200.82, "end": 5202.82, "text": "Da ist auch noch ein Ubuntu, frag mich nicht,"}, {"id": 1048, "start": 5202.82, "end": 5204.82, "text": "1404 oder sowas drauf."}, {"id": 1049, "start": 5204.82, "end": 5206.82, "text": "Oder noch 1204 oder"}, {"id": 1050, "start": 5206.82, "end": 5208.82, "text": "sowas."}, {"id": 1051, "start": 5208.82, "end": 5210.82, "text": "Und"}, {"id": 1052, "start": 5210.82, "end": 5212.82, "text": "auf der Arbeit haben wir"}, {"id": 1053, "start": 5212.82, "end": 5214.82, "text": "Lenovo Thinkpads."}, {"id": 1054, "start": 5214.82, "end": 5230.82, "text": "Da funktioniert's wunderbar."}, {"id": 1055, "start": 5230.82, "end": 5232.82, "text": "Du kannst mein Tool nicht"}, {"id": 1056, "start": 5232.82, "end": 5234.82, "text": "crashen."}, {"id": 1057, "start": 5234.82, "end": 5236.82, "text": "Das eskept ordentlich."}, {"id": 1058, "start": 5238.82, "end": 5240.82, "text": "Und es haben wir auch schon versucht,"}, {"id": 1059, "start": 5240.82, "end": 5242.82, "text": "Leute zu injecten und sonst was."}, {"id": 1060, "start": 5242.82, "end": 5244.82, "text": "Ich hab ordentlich eskept."}, {"id": 1061, "start": 5244.82, "end": 5246.82, "text": "Funktioniert nicht."}, {"id": 1062, "start": 5250.82, "end": 5252.82, "text": "Ganz ein mächtigeren Twitch Chat Hacker hier."}, {"id": 1063, "start": 5256.82, "end": 5258.82, "text": "Hacker Mans."}, {"id": 1064, "start": 5264.82, "end": 5266.82, "text": "Hotkey zum Desktop wechseln."}, {"id": 1065, "start": 5266.82, "end": 5268.82, "text": "Steuerung, Windows,"}, {"id": 1066, "start": 5268.82, "end": 5270.82, "text": "File, äh äh,"}, {"id": 1067, "start": 5270.82, "end": 5272.82, "text": "Windows-File-Taste."}, {"id": 1068, "start": 5276.82, "end": 5278.82, "text": "Doch, Patrick,"}, {"id": 1069, "start": 5278.82, "end": 5280.82, "text": "ISC eskept mit Sicherheit das Meiste."}, {"id": 1070, "start": 5280.82, "end": 5282.82, "text": "Garantiert."}, {"id": 1071, "start": 5282.82, "end": 5284.82, "text": "Ok, also, C Sharp 9 Proposals."}, {"id": 1072, "start": 5284.82, "end": 5286.82, "text": "Was haben wir da so zu bieten?"}, {"id": 1073, "start": 5290.82, "end": 5292.82, "text": "Ok, ich lese mir jetzt nicht die"}, {"id": 1074, "start": 5292.82, "end": 5294.82, "text": "Originalsachen durch, weil da sind wir"}, {"id": 1075, "start": 5294.82, "end": 5296.82, "text": "lange beschäftigt. Wir gucken uns"}, {"id": 1076, "start": 5296.82, "end": 5300.82, "text": "die Zusammenfassung an."}, {"id": 1077, "start": 5300.82, "end": 5302.82, "text": "Was? Diskriminierte Vereinigung."}, {"id": 1078, "start": 5302.82, "end": 5304.82, "text": "Was ist da los?"}, {"id": 1079, "start": 5304.82, "end": 5306.82, "text": "Microsoft Anzeige ist raus."}, {"id": 1080, "start": 5318.82, "end": 5320.82, "text": "Ok, also, Records."}, {"id": 1081, "start": 5320.82, "end": 5322.82, "text": "Was gibt's an Records"}, {"id": 1082, "start": 5322.82, "end": 5324.82, "text": "Neues?"}, {"id": 1083, "start": 5324.82, "end": 5326.82, "text": "Er ist anscheinend ganz"}, {"id": 1084, "start": 5326.82, "end": 5328.82, "text": "außer sich, dass das ein ganz tolles neues"}, {"id": 1085, "start": 5328.82, "end": 5330.82, "text": "Feature ist."}, {"id": 1086, "start": 5334.82, "end": 5336.82, "text": "Wat?"}, {"id": 1087, "start": 5340.82, "end": 5342.82, "text": "Ok, der Artikel"}, {"id": 1088, "start": 5342.82, "end": 5344.82, "text": "ist ein bisschen wehgeschrieben. Gucken wir uns mal"}, {"id": 1089, "start": 5344.82, "end": 5346.82, "text": "Code an. Record"}, {"id": 1090, "start": 5346.82, "end": 5348.82, "text": "would be Public Class."}, {"id": 1091, "start": 5348.82, "end": 5350.82, "text": "Warum"}, {"id": 1092, "start": 5350.82, "end": 5352.82, "text": "nehme ich da nicht einfach einen Struct?"}, {"id": 1093, "start": 5352.82, "end": 5354.82, "text": "Wenn ich sowas haben will?"}, {"id": 1094, "start": 5354.82, "end": 5356.82, "text": "Weil man es"}, {"id": 1095, "start": 5356.82, "end": 5358.82, "text": "Read-Only haben will, oder was?"}, {"id": 1096, "start": 5372.82, "end": 5374.82, "text": "Keine Ahnung, was das mir sagen soll."}, {"id": 1097, "start": 5376.82, "end": 5378.82, "text": "Checker nicht."}, {"id": 1098, "start": 5378.82, "end": 5380.82, "text": "F-Sharp kommt jetzt."}, {"id": 1099, "start": 5380.82, "end": 5382.82, "text": "Jetzt wollte ich es aber wissen."}, {"id": 1100, "start": 5386.82, "end": 5388.82, "text": "Das ist mir zu abstrakt."}, {"id": 1101, "start": 5388.82, "end": 5390.82, "text": "Ich will mal irgendwie ein paar ordentliche"}, {"id": 1102, "start": 5390.82, "end": 5392.82, "text": "Targetar-"}, {"id": 1103, "start": 5392.82, "end": 5394.82, "text": "Oh, was ist das?"}, {"id": 1104, "start": 5394.82, "end": 5396.82, "text": "Neue Operators sind immer gut."}, {"id": 1105, "start": 5396.82, "end": 5398.82, "text": "Neue Operators sind immer gut."}, {"id": 1106, "start": 5400.82, "end": 5402.82, "text": "It's, was?"}, {"id": 1107, "start": 5402.82, "end": 5404.82, "text": "A low implicit conversion from null?"}, {"id": 1108, "start": 5404.82, "end": 5406.82, "text": "Was?"}, {"id": 1109, "start": 5406.82, "end": 5408.82, "text": "Was?"}, {"id": 1110, "start": 5408.82, "end": 5410.82, "text": "Ok, was? Moment, was macht das?"}, {"id": 1111, "start": 5414.82, "end": 5416.82, "text": "Ah, heißt das, ne"}, {"id": 1112, "start": 5416.82, "end": 5418.82, "text": "heißt das wenn, das gibt's doch schon."}, {"id": 1113, "start": 5420.82, "end": 5422.82, "text": "Das, gibt's das"}, {"id": 1114, "start": 5422.82, "end": 5424.82, "text": "nicht schon?"}, {"id": 1115, "start": 5424.82, "end": 5426.82, "text": "Oder bring ich das jetzt durcheinander?"}, {"id": 1116, "start": 5426.82, "end": 5428.82, "text": "Oder ist das JavaScript, wo es das schon gibt?"}, {"id": 1117, "start": 5428.82, "end": 5430.82, "text": "Gibt's das nicht schon?"}, {"id": 1118, "start": 5430.82, "end": 5432.82, "text": "Also im Prinzip"}, {"id": 1119, "start": 5432.82, "end": 5434.82, "text": "ist das wahrscheinlich"}, {"id": 1120, "start": 5434.82, "end": 5436.82, "text": "wenn die Liste"}, {"id": 1121, "start": 5436.82, "end": 5438.82, "text": "null ist,"}, {"id": 1122, "start": 5438.82, "end": 5440.82, "text": "dann leg"}, {"id": 1123, "start": 5440.82, "end": 5442.82, "text": "eine neue Liste an."}, {"id": 1124, "start": 5442.82, "end": 5444.82, "text": "So verstehe ich das jetzt."}, {"id": 1125, "start": 5444.82, "end": 5446.82, "text": "Also sollte es-"}, {"id": 1126, "start": 5446.82, "end": 5448.82, "text": "Ach nee, hier unten ist das Beispiel"}, {"id": 1127, "start": 5448.82, "end": 5450.82, "text": "für C-Sharp 9."}, {"id": 1128, "start": 5452.82, "end": 5454.82, "text": "Ah, ok,"}, {"id": 1129, "start": 5454.82, "end": 5456.82, "text": "man kann jetzt"}, {"id": 1130, "start": 5456.82, "end": 5458.82, "text": "das Initialisieren kürzer schreiben."}, {"id": 1131, "start": 5458.82, "end": 5460.82, "text": "Das ist cool."}, {"id": 1132, "start": 5468.82, "end": 5470.82, "text": "Was? Ok, das kann man"}, {"id": 1133, "start": 5470.82, "end": 5472.82, "text": "verkürzen zu so?"}, {"id": 1134, "start": 5472.82, "end": 5474.82, "text": "Oh, das finde ich auch ganz nice."}, {"id": 1135, "start": 5474.82, "end": 5476.82, "text": "Weil das Handling"}, {"id": 1136, "start": 5476.82, "end": 5478.82, "text": "von KeyValue hat sich schon immer ein bisschen"}, {"id": 1137, "start": 5478.82, "end": 5480.82, "text": "eklig angefühlt."}, {"id": 1138, "start": 5482.82, "end": 5484.82, "text": "Schau dir mal Parameter Null Checking"}, {"id": 1139, "start": 5484.82, "end": 5488.82, "text": "an. Steht das hier drinnen?"}, {"id": 1140, "start": 5492.82, "end": 5494.82, "text": "Gucken wir mal, C-Sharp 9."}, {"id": 1141, "start": 5494.82, "end": 5496.82, "text": "Ganz unten?"}, {"id": 1142, "start": 5496.82, "end": 5498.82, "text": "Ja, gut, da kommen wir gleich noch dazu."}, {"id": 1143, "start": 5498.82, "end": 5500.82, "text": "Ok, das ist ganz"}, {"id": 1144, "start": 5500.82, "end": 5502.82, "text": "praktisch, finde ich."}, {"id": 1145, "start": 5502.82, "end": 5504.82, "text": "Man hätte aber"}, {"id": 1146, "start": 5504.82, "end": 5506.82, "text": "auch, hätte man nicht einfach"}, {"id": 1147, "start": 5508.82, "end": 5510.82, "text": "hätte man das nicht einfach noch kürzer"}, {"id": 1148, "start": 5510.82, "end": 5512.82, "text": "machen können?"}, {"id": 1149, "start": 5512.82, "end": 5514.82, "text": "Dass man das einfach weglässt?"}, {"id": 1150, "start": 5514.82, "end": 5516.82, "text": "Dass man so die Ruby Syntax nimmt?"}, {"id": 1151, "start": 5516.82, "end": 5518.82, "text": "Ähm, quasi"}, {"id": 1152, "start": 5518.82, "end": 5520.82, "text": "sowas hier in der Richtung?"}, {"id": 1153, "start": 5522.82, "end": 5524.82, "text": "Wobei, das wäre wahrscheinlich kollidiert"}, {"id": 1154, "start": 5524.82, "end": 5526.82, "text": "mit der Lambda Syntax."}, {"id": 1155, "start": 5526.82, "end": 5528.82, "text": "Ich glaube, das hätte nicht so gut"}, {"id": 1156, "start": 5528.82, "end": 5530.82, "text": "funktioniert."}, {"id": 1157, "start": 5530.82, "end": 5532.82, "text": "Ja, wahrscheinlich doch so ist"}, {"id": 1158, "start": 5532.82, "end": 5534.82, "text": "äh"}, {"id": 1159, "start": 5534.82, "end": 5536.82, "text": "C-Sharpiger."}, {"id": 1160, "start": 5536.82, "end": 5538.82, "text": "C-Rautemäßiger."}, {"id": 1161, "start": 5538.82, "end": 5540.82, "text": "C-Hashtag."}, {"id": 1162, "start": 5540.82, "end": 5542.82, "text": "Ne."}, {"id": 1163, "start": 5554.82, "end": 5556.82, "text": "Ok, das ist"}, {"id": 1164, "start": 5556.82, "end": 5558.82, "text": "gewöhnungsbedürftig erstmal."}, {"id": 1165, "start": 5560.82, "end": 5562.82, "text": "Das ist mir jetzt zu lang, da platzt mein Kopf."}, {"id": 1166, "start": 5562.82, "end": 5564.82, "text": "Das kriege ich nicht verarbeitet gerade."}, {"id": 1167, "start": 5564.82, "end": 5568.82, "text": "Aber das finde ich cool hier."}, {"id": 1168, "start": 5570.82, "end": 5572.82, "text": "Da kann man sich halt sparen, dass man"}, {"id": 1169, "start": 5572.82, "end": 5574.82, "text": "jetzt schreibt New Point."}, {"id": 1170, "start": 5574.82, "end": 5576.82, "text": "Schreibt man einfach New"}, {"id": 1171, "start": 5576.82, "end": 5578.82, "text": "und der checkt, was man für eine"}, {"id": 1172, "start": 5578.82, "end": 5580.82, "text": "Klasse haben will, mit dem jeweiligen"}, {"id": 1173, "start": 5580.82, "end": 5582.82, "text": "passenden Constructor, weil hier"}, {"id": 1174, "start": 5582.82, "end": 5584.82, "text": "aber was wahrscheinlich nicht geht"}, {"id": 1175, "start": 5584.82, "end": 5586.82, "text": "was wahrscheinlich nicht geht"}, {"id": 1176, "start": 5586.82, "end": 5588.82, "text": "ist dann das hier, ne?"}, {"id": 1177, "start": 5588.82, "end": 5590.82, "text": "Das wird"}, {"id": 1178, "start": 5590.82, "end": 5594.82, "text": "wahrscheinlich nicht gehen."}, {"id": 1179, "start": 5596.82, "end": 5598.82, "text": "Weil"}, {"id": 1180, "start": 5598.82, "end": 5600.82, "text": "woher soll er wissen, was es ist?"}, {"id": 1181, "start": 5604.82, "end": 5606.82, "text": "Das wäre natürlich hier Trick 17"}, {"id": 1182, "start": 5606.82, "end": 5608.82, "text": "übelst Magic, wenn das irgendwie"}, {"id": 1183, "start": 5608.82, "end": 5610.82, "text": "gehen würde, aber ich wüsste nicht, wie das"}, {"id": 1184, "start": 5610.82, "end": 5612.82, "text": "funktionieren soll."}, {"id": 1185, "start": 5612.82, "end": 5614.82, "text": "Caller Expression Attribute. Was?"}, {"id": 1186, "start": 5614.82, "end": 5616.82, "text": "Das ist bestimmt für irgendwelche"}, {"id": 1187, "start": 5616.82, "end": 5618.82, "text": "Debug-Zwecke, dass man sieht, wer wo"}, {"id": 1188, "start": 5618.82, "end": 5620.82, "text": "was aufgerufen hat."}, {"id": 1189, "start": 5624.82, "end": 5626.82, "text": "Äh, ich glaube Feature habe ich noch nie"}, {"id": 1190, "start": 5626.82, "end": 5628.82, "text": "verwendet bisher."}, {"id": 1191, "start": 5628.82, "end": 5630.82, "text": "Das hier."}, {"id": 1192, "start": 5630.82, "end": 5632.82, "text": "Ach, ich glaube, ich habe noch nicht einmal probiert."}, {"id": 1193, "start": 5634.82, "end": 5636.82, "text": "What?"}, {"id": 1194, "start": 5638.82, "end": 5640.82, "text": "Public Ref Partial Struct"}, {"id": 1195, "start": 5640.82, "end": 5642.82, "text": "Haben wir das hier?"}, {"id": 1196, "start": 5642.82, "end": 5644.82, "text": "Public Ref Partial Struct"}, {"id": 1197, "start": 5644.82, "end": 5646.82, "text": "Habe ich auch noch nie verwendet?"}, {"id": 1198, "start": 5646.82, "end": 5648.82, "text": "Ich sehe, ich muss mal"}, {"id": 1199, "start": 5648.82, "end": 5650.82, "text": "mit den neuen C Sharp Features"}, {"id": 1200, "start": 5650.82, "end": 5652.82, "text": "beschäftigen."}, {"id": 1201, "start": 5652.82, "end": 5654.82, "text": "Ich habe irgendwie die meisten davon noch gar nicht"}, {"id": 1202, "start": 5654.82, "end": 5656.82, "text": "benutzt."}, {"id": 1203, "start": 5658.82, "end": 5660.82, "text": "Das letzte"}, {"id": 1204, "start": 5660.82, "end": 5662.82, "text": "massiv hilfreiches"}, {"id": 1205, "start": 5662.82, "end": 5664.82, "text": "C Sharp Feature"}, {"id": 1206, "start": 5664.82, "end": 5666.82, "text": "war für mich der hier."}, {"id": 1207, "start": 5668.82, "end": 5670.82, "text": "Dieser Null"}, {"id": 1208, "start": 5670.82, "end": 5672.82, "text": "Check Operator hier, keine Ahnung."}, {"id": 1209, "start": 5674.82, "end": 5676.82, "text": "String, was auch immer,"}, {"id": 1210, "start": 5676.82, "end": 5678.82, "text": "Punkt, blub."}, {"id": 1211, "start": 5678.82, "end": 5680.82, "text": "Der dann checkt, ob das Null ist."}, {"id": 1212, "start": 5680.82, "end": 5682.82, "text": "Das fand ich schon"}, {"id": 1213, "start": 5682.82, "end": 5684.82, "text": "echt hilfreich."}, {"id": 1214, "start": 5684.82, "end": 5686.82, "text": "Das war das letzte richtige, wo ich gesagt habe, oh geil,"}, {"id": 1215, "start": 5686.82, "end": 5688.82, "text": "das bringt richtig was. Die neue"}, {"id": 1216, "start": 5688.82, "end": 5690.82, "text": "Pattern-Matching-Geschichte war auch cool."}, {"id": 1217, "start": 5690.82, "end": 5692.82, "text": "Erklär das"}, {"id": 1218, "start": 5692.82, "end": 5694.82, "text": "Fragezeichen, Fragezeichen."}, {"id": 1219, "start": 5694.82, "end": 5696.82, "text": "So wie ich das verstanden habe, ist"}, {"id": 1220, "start": 5696.82, "end": 5698.82, "text": "Fragezeichen, Fragezeichen. Also wenn ich hier"}, {"id": 1221, "start": 5698.82, "end": 5700.82, "text": "sowas habe."}, {"id": 1222, "start": 5700.82, "end": 5702.82, "text": "Noch mal kurz Zwischen Studio Code"}, {"id": 1223, "start": 5702.82, "end": 5704.82, "text": "auf."}, {"id": 1224, "start": 5704.82, "end": 5706.82, "text": "Neu."}, {"id": 1225, "start": 5706.82, "end": 5708.82, "text": "Stellen wir das Ganze mal auf"}, {"id": 1226, "start": 5708.82, "end": 5710.82, "text": "C Hashtag."}, {"id": 1227, "start": 5710.82, "end": 5712.82, "text": "Also wenn ich hier"}, {"id": 1228, "start": 5712.82, "end": 5714.82, "text": "sowas habe,"}, {"id": 1229, "start": 5714.82, "end": 5716.82, "text": "irgendeine Liste,"}, {"id": 1230, "start": 5716.82, "end": 5718.82, "text": "eine Liste,"}, {"id": 1231, "start": 5718.82, "end": 5720.82, "text": "irgendeine Liste,"}, {"id": 1232, "start": 5720.82, "end": 5722.82, "text": "irgendeine Liste,"}, {"id": 1233, "start": 5722.82, "end": 5724.82, "text": "so und"}, {"id": 1234, "start": 5724.82, "end": 5726.82, "text": "die will ich zuweisen."}, {"id": 1235, "start": 5726.82, "end": 5728.82, "text": "Oder ich will irgendeine Variable zuweisen."}, {"id": 1236, "start": 5728.82, "end": 5730.82, "text": "Also Temp."}, {"id": 1237, "start": 5730.82, "end": 5732.82, "text": "Ich habe eine Liste"}, {"id": 1238, "start": 5732.82, "end": 5734.82, "text": "und die Liste ist Null."}, {"id": 1239, "start": 5734.82, "end": 5736.82, "text": "Dann nimmt er das, was auf der rechten Seite steht."}, {"id": 1240, "start": 5736.82, "end": 5738.82, "text": "Also quasi hier sowas."}, {"id": 1241, "start": 5740.82, "end": 5742.82, "text": "Wenn ich das richtig verstehe."}, {"id": 1242, "start": 5742.82, "end": 5744.82, "text": "Ich hoffe, dieser Tag ist richtig."}, {"id": 1243, "start": 5744.82, "end": 5746.82, "text": "Also der guckt dann quasi, ob"}, {"id": 1244, "start": 5746.82, "end": 5748.82, "text": "die Liste Null ist."}, {"id": 1245, "start": 5748.82, "end": 5750.82, "text": "Was interessant wäre, ist, ob die Liste"}, {"id": 1246, "start": 5750.82, "end": 5752.82, "text": "Null oder leer sein kann."}, {"id": 1247, "start": 5752.82, "end": 5754.82, "text": "Wahrscheinlich muss hier wirklich Null sein."}, {"id": 1248, "start": 5756.82, "end": 5758.82, "text": "Also sprich, der guckt, ob die Liste"}, {"id": 1249, "start": 5758.82, "end": 5760.82, "text": "Null ist. Und wenn die Liste"}, {"id": 1250, "start": 5760.82, "end": 5762.82, "text": "Null ist, macht er eine neue default Liste."}, {"id": 1251, "start": 5762.82, "end": 5764.82, "text": "Ich hätte wetten können, das gab es schon."}, {"id": 1252, "start": 5766.82, "end": 5768.82, "text": "Ja, das ist ganz praktisch."}, {"id": 1253, "start": 5768.82, "end": 5770.82, "text": "Parameter Null Checking."}, {"id": 1254, "start": 5770.82, "end": 5772.82, "text": "Ist das das, was ich mir angucken sollte?"}, {"id": 1255, "start": 5778.82, "end": 5780.82, "text": "Oh!"}, {"id": 1256, "start": 5780.82, "end": 5782.82, "text": "Das ist, glaube ich, ganz cool."}, {"id": 1257, "start": 5782.82, "end": 5784.82, "text": "Hello, simplifying"}, {"id": 1258, "start": 5784.82, "end": 5786.82, "text": "Standard Null Validation"}, {"id": 1259, "start": 5786.82, "end": 5788.82, "text": "Das ist cool!"}, {"id": 1260, "start": 5792.82, "end": 5794.82, "text": "Das ist super!"}, {"id": 1261, "start": 5794.82, "end": 5796.82, "text": "Das ist super!"}, {"id": 1262, "start": 5796.82, "end": 5798.82, "text": "Das ist cool!"}, {"id": 1263, "start": 5798.82, "end": 5800.82, "text": "Das gefällt mir!"}, {"id": 1264, "start": 5804.82, "end": 5806.82, "text": "Das gefällt mir!"}, {"id": 1265, "start": 5806.82, "end": 5808.82, "text": "Gerade jetzt,"}, {"id": 1266, "start": 5808.82, "end": 5810.82, "text": "wo sie"}, {"id": 1267, "start": 5810.82, "end": 5812.82, "text": "das Feature"}, {"id": 1268, "start": 5812.82, "end": 5814.82, "text": "eingeführt haben, dass man..."}, {"id": 1269, "start": 5814.82, "end": 5816.82, "text": "Wow, fuck, wo bin ich jetzt?"}, {"id": 1270, "start": 5816.82, "end": 5818.82, "text": "Da sie mit der letzten"}, {"id": 1271, "start": 5818.82, "end": 5820.82, "text": "C Sharp Version eingeführt haben,"}, {"id": 1272, "start": 5820.82, "end": 5822.82, "text": "dass, wenn man Opt-in"}, {"id": 1273, "start": 5822.82, "end": 5824.82, "text": "ist auf"}, {"id": 1274, "start": 5824.82, "end": 5826.82, "text": "Null, dass man"}, {"id": 1275, "start": 5826.82, "end": 5828.82, "text": "dann hier was angezeigt kriegt, wenn man es nicht gekennzeichnet hat."}, {"id": 1276, "start": 5828.82, "end": 5830.82, "text": "Das finde ich cool."}, {"id": 1277, "start": 5830.82, "end": 5832.82, "text": "Das finde ich echt nice. Das gefällt mir."}, {"id": 1278, "start": 5834.82, "end": 5836.82, "text": "Weil man muss sonst"}, {"id": 1279, "start": 5836.82, "end": 5838.82, "text": "so viele unsinnige Null Checks"}, {"id": 1280, "start": 5838.82, "end": 5840.82, "text": "machen. Im Prinzip ist ja unter der Haube"}, {"id": 1281, "start": 5840.82, "end": 5842.82, "text": "also man könnte sagen, ist kein großer Akt."}, {"id": 1282, "start": 5842.82, "end": 5844.82, "text": "Es steht dann explizit da."}, {"id": 1283, "start": 5844.82, "end": 5846.82, "text": "Und explizit ist ja eh besser, weil man kann es sehen."}, {"id": 1284, "start": 5846.82, "end": 5848.82, "text": "Aber das ist auch explizit,"}, {"id": 1285, "start": 5848.82, "end": 5850.82, "text": "wenn man weiß, was es macht. Das finde ich cool."}, {"id": 1286, "start": 5850.82, "end": 5854.82, "text": "Das gefällt mir."}, {"id": 1287, "start": 5858.82, "end": 5860.82, "text": "Skip Locals in it."}, {"id": 1288, "start": 5860.82, "end": 5862.82, "text": "Was?"}, {"id": 1289, "start": 5866.82, "end": 5868.82, "text": "Moment, das geht doch jetzt schon."}, {"id": 1290, "start": 5868.82, "end": 5870.82, "text": "Ach nee!"}, {"id": 1291, "start": 5870.82, "end": 5872.82, "text": "Das ist neu. Ah!"}, {"id": 1292, "start": 5872.82, "end": 5874.82, "text": "Das ist praktisch. Das ist echt praktisch."}, {"id": 1293, "start": 5874.82, "end": 5876.82, "text": "Ähm, aktuell"}, {"id": 1294, "start": 5876.82, "end": 5878.82, "text": "ist es so, wenn ich"}, {"id": 1295, "start": 5878.82, "end": 5880.82, "text": "keine Ahnung, ich habe eine"}, {"id": 1296, "start": 5880.82, "end": 5882.82, "text": "Liste."}, {"id": 1297, "start": 5882.82, "end": 5884.82, "text": "Ich habe eine Liste."}, {"id": 1298, "start": 5884.82, "end": 5886.82, "text": "Und ich sag jetzt irgendwie in der Liste"}, {"id": 1299, "start": 5886.82, "end": 5888.82, "text": "ähm"}, {"id": 1300, "start": 5888.82, "end": 5890.82, "text": "machen wir mal Pseudo. Sword."}, {"id": 1301, "start": 5890.82, "end": 5892.82, "text": "So, dann"}, {"id": 1302, "start": 5892.82, "end": 5894.82, "text": "ähm"}, {"id": 1303, "start": 5894.82, "end": 5896.82, "text": "Sword ist ein doofes Beispiel."}, {"id": 1304, "start": 5896.82, "end": 5898.82, "text": "Äh, was gibt's da für"}, {"id": 1305, "start": 5898.82, "end": 5900.82, "text": "schönes?"}, {"id": 1306, "start": 5900.82, "end": 5902.82, "text": "Ja genau, ich mach Sword."}, {"id": 1307, "start": 5902.82, "end": 5904.82, "text": "Sword kriegt"}, {"id": 1308, "start": 5904.82, "end": 5906.82, "text": "zwei Parameter."}, {"id": 1309, "start": 5906.82, "end": 5908.82, "text": "Da muss man glaube ich bisher so machen, wenn man"}, {"id": 1310, "start": 5908.82, "end": 5910.82, "text": "beides diskaten will."}, {"id": 1311, "start": 5910.82, "end": 5912.82, "text": "Wenn man jetzt"}, {"id": 1312, "start": 5912.82, "end": 5914.82, "text": "die Werte diskaten will, kann man anscheinend"}, {"id": 1313, "start": 5914.82, "end": 5916.82, "text": "Anderscore, Anderscore machen."}, {"id": 1314, "start": 5916.82, "end": 5918.82, "text": "Das ist eigentlich, kann man, ja, das"}, {"id": 1315, "start": 5918.82, "end": 5920.82, "text": "finde ich eigentlich ganz nett."}, {"id": 1316, "start": 5920.82, "end": 5922.82, "text": "Wenn das das ist, was ich, wenn ich das so verstanden habe."}, {"id": 1317, "start": 5922.82, "end": 5924.82, "text": "Prime Sub, der Felix sagt"}, {"id": 1318, "start": 5924.82, "end": 5926.82, "text": "Hallo, moin Felix."}, {"id": 1319, "start": 5926.82, "end": 5928.82, "text": "Huge Sub."}, {"id": 1320, "start": 5930.82, "end": 5932.82, "text": "Wie stellt zum Beispiel Studio Code die"}, {"id": 1321, "start": 5932.82, "end": 5934.82, "text": "Programmiersprecher hier ohne? Da, da gibt's einen Knopf für."}, {"id": 1322, "start": 5934.82, "end": 5936.82, "text": "Speicher will ich"}, {"id": 1323, "start": 5936.82, "end": 5938.82, "text": "Minecraft nicht."}, {"id": 1324, "start": 5940.82, "end": 5942.82, "text": "Scheint ein ganz"}, {"id": 1325, "start": 5942.82, "end": 5944.82, "text": "nettes Feature zu sein."}, {"id": 1326, "start": 5946.82, "end": 5948.82, "text": "Attributes on"}, {"id": 1327, "start": 5948.82, "end": 5950.82, "text": "Local Functions. Äh, ich hab noch nicht einmal"}, {"id": 1328, "start": 5950.82, "end": 5952.82, "text": "Local Functions verwendet."}, {"id": 1329, "start": 5954.82, "end": 5956.82, "text": "Finde ich sieht auch echt eklig"}, {"id": 1330, "start": 5956.82, "end": 5958.82, "text": "aus. So"}, {"id": 1331, "start": 5958.82, "end": 5960.82, "text": "Nested Functions in Functions."}, {"id": 1332, "start": 5960.82, "end": 5962.82, "text": "C++20"}, {"id": 1333, "start": 5962.82, "end": 5964.82, "text": "C++20 ist so ein"}, {"id": 1334, "start": 5964.82, "end": 5966.82, "text": "Clusterfuck. Ja."}, {"id": 1335, "start": 5966.82, "end": 5968.82, "text": "C++ allgemein ist"}, {"id": 1336, "start": 5968.82, "end": 5970.82, "text": "ein Clusterfuck."}, {"id": 1337, "start": 5970.82, "end": 5972.82, "text": "Wie gesagt, Patrick,"}, {"id": 1338, "start": 5972.82, "end": 5974.82, "text": "ich hab ja vorhin wieder gelernt, wo ich ein bisschen vor dem Stream"}, {"id": 1339, "start": 5974.82, "end": 5976.82, "text": "rumgebastelt hab, dass man"}, {"id": 1340, "start": 5976.82, "end": 5978.82, "text": "ähm,"}, {"id": 1341, "start": 5978.82, "end": 5980.82, "text": "Methoden aus der C++"}, {"id": 1342, "start": 5980.82, "end": 5982.82, "text": "Klasse nicht als"}, {"id": 1343, "start": 5982.82, "end": 5984.82, "text": "Function Pointer verwenden kann."}, {"id": 1344, "start": 5984.82, "end": 5986.82, "text": "Also wenn ich hier so Oldschool"}, {"id": 1345, "start": 5986.82, "end": 5988.82, "text": "Callbacks hab, so wie hier,"}, {"id": 1346, "start": 5988.82, "end": 5990.82, "text": "dann kann ich dort nicht einfach"}, {"id": 1347, "start": 5990.82, "end": 5992.82, "text": "ähm, ne"}, {"id": 1348, "start": 5992.82, "end": 5994.82, "text": "ne, ne, ne Klassenmethode"}, {"id": 1349, "start": 5994.82, "end": 5996.82, "text": "reinstecken oder so. Das funktioniert nicht."}, {"id": 1350, "start": 5996.82, "end": 5998.82, "text": "Weil Klassenmethoden komplett anders implementiert"}, {"id": 1351, "start": 5998.82, "end": 6000.82, "text": "sind, wie so normale C-Funktionen anscheinend."}, {"id": 1352, "start": 6000.82, "end": 6002.82, "text": "Das funktioniert nicht."}, {"id": 1353, "start": 6006.82, "end": 6008.82, "text": "Native"}, {"id": 1354, "start": 6008.82, "end": 6010.82, "text": "Inns."}, {"id": 1355, "start": 6012.82, "end": 6014.82, "text": "Okay, das"}, {"id": 1356, "start": 6014.82, "end": 6016.82, "text": "weiß ich nicht,"}, {"id": 1357, "start": 6016.82, "end": 6018.82, "text": "wie sinnvoll das ist."}, {"id": 1358, "start": 6018.82, "end": 6020.82, "text": "In manchen Anwendungsgebieten bestimmt."}, {"id": 1359, "start": 6020.82, "end": 6022.82, "text": "Stimmt, das geht"}, {"id": 1360, "start": 6022.82, "end": 6024.82, "text": "nur, wenn sie Static sind, was aber"}, {"id": 1361, "start": 6024.82, "end": 6026.82, "text": "irgendwie doof ist. Dann kann die ganzen"}, {"id": 1362, "start": 6026.82, "end": 6028.82, "text": "Klassenkram auch weglassen."}, {"id": 1363, "start": 6030.82, "end": 6032.82, "text": "Function Pointers. Uah! Wo was grad"}, {"id": 1364, "start": 6032.82, "end": 6034.82, "text": "hatten davon? Haben die meine Gedanken"}, {"id": 1365, "start": 6034.82, "end": 6036.82, "text": "gelesen grad oder was?"}, {"id": 1366, "start": 6036.82, "end": 6038.82, "text": "Haben die grade meine Gedanken"}, {"id": 1367, "start": 6038.82, "end": 6040.82, "text": "gelesen? Ich hab grad was von ekligem"}, {"id": 1368, "start": 6040.82, "end": 6042.82, "text": "Function Pointer in C++ erzählt und jetzt"}, {"id": 1369, "start": 6042.82, "end": 6046.82, "text": "hier um die Ecke Function Pointers."}, {"id": 1370, "start": 6058.82, "end": 6060.82, "text": "Das ist bestimmt gut, wenn man irgendwie"}, {"id": 1371, "start": 6060.82, "end": 6062.82, "text": "C-Interop machen will."}, {"id": 1372, "start": 6062.82, "end": 6070.82, "text": "Oh, wenn ich sowas schon sehe hier."}, {"id": 1373, "start": 6072.82, "end": 6074.82, "text": "Das ist wahrscheinlich für Interop"}, {"id": 1374, "start": 6074.82, "end": 6076.82, "text": "mit C ganz praktisch, kann ich mir"}, {"id": 1375, "start": 6076.82, "end": 6078.82, "text": "vorstellen."}, {"id": 1376, "start": 6080.82, "end": 6082.82, "text": "Ja, sind doch ein paar coole"}, {"id": 1377, "start": 6082.82, "end": 6084.82, "text": "Sachen dabei."}, {"id": 1378, "start": 6084.82, "end": 6086.82, "text": "Ja, mit dem Ausrufezeichen finde ich"}, {"id": 1379, "start": 6086.82, "end": 6088.82, "text": "das eine sehr coole Geschichte, das gefällt mir"}, {"id": 1380, "start": 6088.82, "end": 6090.82, "text": "richtig gut."}, {"id": 1381, "start": 6090.82, "end": 6092.82, "text": "Was? Primary Constructors, das haben wir"}, {"id": 1382, "start": 6092.82, "end": 6094.82, "text": "bei dem anderen nicht gesehen."}, {"id": 1383, "start": 6098.82, "end": 6100.82, "text": "Was macht das?"}, {"id": 1384, "start": 6106.82, "end": 6108.82, "text": "Hä?"}, {"id": 1385, "start": 6108.82, "end": 6110.82, "text": "Das ist doch nicht so einfach."}, {"id": 1386, "start": 6110.82, "end": 6112.82, "text": "Hä?"}, {"id": 1387, "start": 6112.82, "end": 6114.82, "text": "Das ist doch schon immer so."}, {"id": 1388, "start": 6114.82, "end": 6116.82, "text": "Ah!"}, {"id": 1389, "start": 6118.82, "end": 6120.82, "text": "Oh, cool!"}, {"id": 1390, "start": 6120.82, "end": 6122.82, "text": "Das finde ich, das finde ich nice."}, {"id": 1391, "start": 6122.82, "end": 6124.82, "text": "Weil oftmals macht man nur"}, {"id": 1392, "start": 6124.82, "end": 6126.82, "text": "einen Constructor, einzig und allein,"}, {"id": 1393, "start": 6126.82, "end": 6128.82, "text": "aus dem Grund,"}, {"id": 1394, "start": 6128.82, "end": 6130.82, "text": "um ein paar"}, {"id": 1395, "start": 6130.82, "end": 6132.82, "text": "Parameter zu speichern."}, {"id": 1396, "start": 6134.82, "end": 6136.82, "text": "Das ist cool."}, {"id": 1397, "start": 6136.82, "end": 6138.82, "text": "Das ist cool."}, {"id": 1398, "start": 6144.82, "end": 6146.82, "text": "Das ist nice, das gefällt mir."}, {"id": 1399, "start": 6150.82, "end": 6152.82, "text": "Ich meine, noch cooler wäre,"}, {"id": 1400, "start": 6152.82, "end": 6154.82, "text": "wenn man gar keinen Constructor mehr bräuchte."}, {"id": 1401, "start": 6156.82, "end": 6158.82, "text": "Aber dann ist schwierig,"}, {"id": 1402, "start": 6158.82, "end": 6160.82, "text": "welche Properties soll er als"}, {"id": 1403, "start": 6160.82, "end": 6162.82, "text": "Parameter nehmen?"}, {"id": 1404, "start": 6162.82, "end": 6164.82, "text": "Das geht dann nicht. Aber das ist"}, {"id": 1405, "start": 6164.82, "end": 6166.82, "text": "praktisch."}, {"id": 1406, "start": 6166.82, "end": 6168.82, "text": "Das ist cool, das gefällt mir."}, {"id": 1407, "start": 6168.82, "end": 6170.82, "text": "Ja, Record Classes habe ich"}, {"id": 1408, "start": 6170.82, "end": 6172.82, "text": "bei dem anderen nicht gecheckt, das war mir zu"}, {"id": 1409, "start": 6172.82, "end": 6174.82, "text": "Expanded, Extended Brain."}, {"id": 1410, "start": 6178.82, "end": 6180.82, "text": "Bin ich eigentlich der Einzige,"}, {"id": 1411, "start": 6180.82, "end": 6182.82, "text": "der solche Artikel nicht liest, sondern"}, {"id": 1412, "start": 6182.82, "end": 6184.82, "text": "sich nur die Code Samples anguckt?"}, {"id": 1413, "start": 6188.82, "end": 6190.82, "text": "Du hast letztens Go geflammt"}, {"id": 1414, "start": 6190.82, "end": 6194.82, "text": "gegen C-Aufrufen, aber das geht nicht gut."}, {"id": 1415, "start": 6198.82, "end": 6200.82, "text": "Also das Aufrufen geht halbwegs."}, {"id": 1416, "start": 6202.82, "end": 6204.82, "text": "Dazu kommt erstens, dass man"}, {"id": 1417, "start": 6204.82, "end": 6206.82, "text": "im Mission Studio Code für Go"}, {"id": 1418, "start": 6206.82, "end": 6208.82, "text": "komplett breakt, wenn du C-Go verwendest."}, {"id": 1419, "start": 6210.82, "end": 6212.82, "text": "Und die Performance, das ist auch"}, {"id": 1420, "start": 6212.82, "end": 6214.82, "text": "mein hauptsächliches Problem, weil ich das für jeden"}, {"id": 1421, "start": 6214.82, "end": 6216.82, "text": "Frame aus dem Video mache."}, {"id": 1422, "start": 6216.82, "end": 6218.82, "text": "Der Overhead"}, {"id": 1423, "start": 6218.82, "end": 6220.82, "text": "zwischen"}, {"id": 1424, "start": 6220.82, "end": 6222.82, "text": "C und Go wechselt."}, {"id": 1425, "start": 6222.82, "end": 6224.82, "text": "Guck mal hier."}, {"id": 1426, "start": 6224.82, "end": 6226.82, "text": "170 Nanosekunden"}, {"id": 1427, "start": 6226.82, "end": 6228.82, "text": "pro Funktionsaufruf, Overhead obendrauf."}, {"id": 1428, "start": 6230.82, "end": 6232.82, "text": "Ich glaube mittlerweile ist es ein bisschen besser, aber das ist der Bits."}, {"id": 1429, "start": 6244.82, "end": 6246.82, "text": "Aber schön ist es trotzdem nicht,"}, {"id": 1430, "start": 6246.82, "end": 6248.82, "text": "auch die ganze Interop-Geschichte an sich"}, {"id": 1431, "start": 6248.82, "end": 6250.82, "text": "ist sehr hakelig."}, {"id": 1432, "start": 6250.82, "end": 6252.82, "text": "Für einfache Sachen geht es ganz"}, {"id": 1433, "start": 6252.82, "end": 6254.82, "text": "gut, ja. Der Support ist mittlerweile"}, {"id": 1434, "start": 6254.82, "end": 6256.82, "text": "auch bei Go"}, {"id": 1435, "start": 6256.82, "end": 6258.82, "text": "ganz okay. Das generiert ja"}, {"id": 1436, "start": 6258.82, "end": 6260.82, "text": "beispielsweise die C-Header-Files,"}, {"id": 1437, "start": 6260.82, "end": 6262.82, "text": "die du brauchst, doch gleich mit."}, {"id": 1438, "start": 6262.82, "end": 6264.82, "text": "Aber gerade der Performance-Overhead"}, {"id": 1439, "start": 6264.82, "end": 6266.82, "text": "ist halt abartig groß."}, {"id": 1440, "start": 6272.82, "end": 6274.82, "text": "Und was auch ein bisschen kompliziert ist, ist"}, {"id": 1441, "start": 6274.82, "end": 6276.82, "text": "die Qualitätsverwaltung."}, {"id": 1442, "start": 6280.82, "end": 6282.82, "text": "C-Bindings"}, {"id": 1443, "start": 6282.82, "end": 6284.82, "text": "für eine Library, ja wahrscheinlich"}, {"id": 1444, "start": 6284.82, "end": 6286.82, "text": "könnte ich mir sogar vorstellen, dass das relativ..."}, {"id": 1445, "start": 6286.82, "end": 6288.82, "text": "Das geht einfach, ja das geht einfach."}, {"id": 1446, "start": 6288.82, "end": 6290.82, "text": "C-Bindings für die Library."}, {"id": 1447, "start": 6290.82, "end": 6292.82, "text": "Das geht einfach."}, {"id": 1448, "start": 6292.82, "end": 6294.82, "text": "Da musst du einfach hier drüber schreiben"}, {"id": 1449, "start": 6294.82, "end": 6296.82, "text": "Export, blablub,"}, {"id": 1450, "start": 6296.82, "end": 6298.82, "text": "und schon hast du eine"}, {"id": 1451, "start": 6298.82, "end": 6300.82, "text": "Schnittstelle"}, {"id": 1452, "start": 6300.82, "end": 6302.82, "text": "für C-Zu-Go-Funktion."}, {"id": 1453, "start": 6302.82, "end": 6304.82, "text": "Das geht einfach, ja."}, {"id": 1454, "start": 6308.82, "end": 6310.82, "text": "Dafür ist es gut."}, {"id": 1455, "start": 6310.82, "end": 6312.82, "text": "Aber insgesamt"}, {"id": 1456, "start": 6312.82, "end": 6314.82, "text": "ist es scheiße."}, {"id": 1457, "start": 6314.82, "end": 6316.82, "text": ".NET 5 hat auch Java-Interop."}, {"id": 1458, "start": 6316.82, "end": 6318.82, "text": "Echt?"}, {"id": 1459, "start": 6320.82, "end": 6322.82, "text": "Ja endlich."}, {"id": 1460, "start": 6322.82, "end": 6324.82, "text": "Ich konnte es kaum erwarten. Wobei das ganz cool"}, {"id": 1461, "start": 6324.82, "end": 6326.82, "text": "ist. Also je nachdem wie gut"}, {"id": 1462, "start": 6326.82, "end": 6328.82, "text": "das funktioniert, ist das wirklich nicht"}, {"id": 1463, "start": 6328.82, "end": 6330.82, "text": "schlecht. Es gibt"}, {"id": 1464, "start": 6330.82, "end": 6332.82, "text": "doch ein paar Projekte in Java,"}, {"id": 1465, "start": 6332.82, "end": 6334.82, "text": "die vielleicht ganz nützlich sind."}, {"id": 1466, "start": 6336.82, "end": 6338.82, "text": "Müsste ich mir mal"}, {"id": 1467, "start": 6338.82, "end": 6340.82, "text": "anschauen."}, {"id": 1468, "start": 6342.82, "end": 6344.82, "text": "Und wie machen die das?"}, {"id": 1469, "start": 6346.82, "end": 6348.82, "text": "Exposen die Java"}, {"id": 1470, "start": 6348.82, "end": 6350.82, "text": "als C-Sachen"}, {"id": 1471, "start": 6350.82, "end": 6352.82, "text": "und rufen das von C-Sharp aus. Und wie machen die"}, {"id": 1472, "start": 6352.82, "end": 6354.82, "text": "den Interop? Ist der halbwegs schnell"}, {"id": 1473, "start": 6354.82, "end": 6356.82, "text": "zwischen.NET und Java?"}, {"id": 1474, "start": 6356.82, "end": 6358.82, "text": "Müsste ich mir mal angucken."}, {"id": 1475, "start": 6358.82, "end": 6360.82, "text": "Wenn es rauskommt."}, {"id": 1476, "start": 6360.82, "end": 6362.82, "text": "Also das fand ich eigentlich ganz nice hier."}, {"id": 1477, "start": 6362.82, "end": 6364.82, "text": "Das da, das gefällt mir, das Feature."}, {"id": 1478, "start": 6364.82, "end": 6366.82, "text": "Record Class, das war mir zu"}, {"id": 1479, "start": 6366.82, "end": 6368.82, "text": "big, ist mein Brain gerade zu"}, {"id": 1480, "start": 6368.82, "end": 6370.82, "text": "low, dass ich das checke."}, {"id": 1481, "start": 6370.82, "end": 6372.82, "text": "Das ist mir auch zu kompliziert gewesen."}, {"id": 1482, "start": 6372.82, "end": 6374.82, "text": "Aber es waren ein paar coole Sachen dabei."}, {"id": 1483, "start": 6374.82, "end": 6376.82, "text": "Das mag ich"}, {"id": 1484, "start": 6376.82, "end": 6378.82, "text": "auch an C-Sharp, bzw."}, {"id": 1485, "start": 6378.82, "end": 6380.82, "text": "an dem Produkt, wie das Microsoft"}, {"id": 1486, "start": 6380.82, "end": 6382.82, "text": "handelt. Oder von den Leuten,"}, {"id": 1487, "start": 6382.82, "end": 6384.82, "text": "die das machen. Das ist ja grad der,"}, {"id": 1488, "start": 6384.82, "end": 6386.82, "text": "das ist irgendein Norweger oder so."}, {"id": 1489, "start": 6386.82, "end": 6388.82, "text": "Also der Heilsberg war ja ursprünglich"}, {"id": 1490, "start": 6388.82, "end": 6390.82, "text": "der Erfinder. Wie heißt denn der?"}, {"id": 1491, "start": 6390.82, "end": 6392.82, "text": "Der aktuelle C-Sharp. Jetzt heißt er irgendwie Metz."}, {"id": 1492, "start": 6392.82, "end": 6394.82, "text": "Metz. Und dann irgendwie"}, {"id": 1493, "start": 6394.82, "end": 6396.82, "text": "skandinavischer Name."}, {"id": 1494, "start": 6396.82, "end": 6398.82, "text": "Und wie die das handeln, finde ich eigentlich ganz gut."}, {"id": 1495, "start": 6400.82, "end": 6402.82, "text": "Die entwickeln das kontinuierlich weiter,"}, {"id": 1496, "start": 6402.82, "end": 6404.82, "text": "immer so ein bisschen in die Richtung,"}, {"id": 1497, "start": 6404.82, "end": 6406.82, "text": "was halt gerade"}, {"id": 1498, "start": 6406.82, "end": 6408.82, "text": "nicht gerade"}, {"id": 1499, "start": 6408.82, "end": 6410.82, "text": "hip ist, sondern was sich gerade als"}, {"id": 1500, "start": 6410.82, "end": 6412.82, "text": "sinnvoll rausgestellt hat."}, {"id": 1501, "start": 6412.82, "end": 6414.82, "text": "Zum Beispiel ist ja C-Sharp deutlich funktionaler"}, {"id": 1502, "start": 6414.82, "end": 6416.82, "text": "geworden jetzt, die letzten zwei Versionen."}, {"id": 1503, "start": 6416.82, "end": 6418.82, "text": "Mit Pattern Matching, den ganzen"}, {"id": 1504, "start": 6418.82, "end": 6420.82, "text": "Lambda Zeug, was dazu gekommen ist."}, {"id": 1505, "start": 6420.82, "end": 6422.82, "text": "Kommt sich teilweise schon"}, {"id": 1506, "start": 6422.82, "end": 6424.82, "text": "wie in irgendeiner funktionalen Sprache vor."}, {"id": 1507, "start": 6424.82, "end": 6426.82, "text": "Sebaro kann ein Lied von singen."}, {"id": 1508, "start": 6426.82, "end": 6428.82, "text": "Ich hab gehört, der muss Haskell in der Uni"}, {"id": 1509, "start": 6428.82, "end": 6430.82, "text": "gerade machen."}, {"id": 1510, "start": 6434.82, "end": 6436.82, "text": "Äh..."}, {"id": 1511, "start": 6436.82, "end": 6438.82, "text": "Patrick..."}, {"id": 1512, "start": 6438.82, "end": 6440.82, "text": "Ich glaub, das krieg ich jetzt nicht aus dem Stegreif hin."}, {"id": 1513, "start": 6440.82, "end": 6442.82, "text": "Wir können das aber"}, {"id": 1514, "start": 6442.82, "end": 6444.82, "text": "mal insgesamt machen. Wir machen einfach"}, {"id": 1515, "start": 6444.82, "end": 6446.82, "text": "nicht FFM-Pack."}, {"id": 1516, "start": 6446.82, "end": 6448.82, "text": "Wir machen einfach mal"}, {"id": 1517, "start": 6448.82, "end": 6450.82, "text": "Print..."}, {"id": 1518, "start": 6450.82, "end": 6452.82, "text": "Wir counten eins hoch."}, {"id": 1519, "start": 6452.82, "end": 6454.82, "text": "Go, Lip."}, {"id": 1520, "start": 6454.82, "end": 6456.82, "text": "Und rufen"}, {"id": 1521, "start": 6456.82, "end": 6458.82, "text": "aus die Sharp auf. Also ich hab das mal ausprobiert."}, {"id": 1522, "start": 6458.82, "end": 6460.82, "text": "Das macht bei wenig"}, {"id": 1523, "start": 6460.82, "end": 6462.82, "text": "Aufrufen nicht viel aus."}, {"id": 1524, "start": 6464.82, "end": 6466.82, "text": "Ich hatte das mal"}, {"id": 1525, "start": 6466.82, "end": 6468.82, "text": "ausprobiert. Aber bei..."}, {"id": 1526, "start": 6468.82, "end": 6470.82, "text": "Also wenn's da halt in die Millionen geht, die"}, {"id": 1527, "start": 6470.82, "end": 6472.82, "text": "aufrufen, macht das was aus. Bei meinem FFM-Pack"}, {"id": 1528, "start": 6472.82, "end": 6474.82, "text": "Zeug wahrscheinlich nicht."}, {"id": 1529, "start": 6474.82, "end": 6476.82, "text": "Weil so ein Frame ist halt..."}, {"id": 1530, "start": 6476.82, "end": 6478.82, "text": "Selbst wenn's 30 Frames pro Sekunde sind"}, {"id": 1531, "start": 6478.82, "end": 6480.82, "text": "und das wären 30..."}, {"id": 1532, "start": 6484.82, "end": 6486.82, "text": "Nee, das ist doch gut."}, {"id": 1533, "start": 6486.82, "end": 6488.82, "text": "Wenn die Funktion kürzer ist, macht die Funktion"}, {"id": 1534, "start": 6488.82, "end": 6490.82, "text": "selbst kaum was und man sieht den eigentlichen Overhead."}, {"id": 1535, "start": 6490.82, "end": 6492.82, "text": "Bei meinem FFM-Pack Zeug"}, {"id": 1536, "start": 6492.82, "end": 6494.82, "text": "ist das eigentlich fast egal. Selbst wenn"}, {"id": 1537, "start": 6494.82, "end": 6496.82, "text": "ich 30 Frames pro Sekunde hab,"}, {"id": 1538, "start": 6496.82, "end": 6498.82, "text": "bis ich da mal irgendwo in Bereiche komme,"}, {"id": 1539, "start": 6498.82, "end": 6500.82, "text": "wo das relevant wäre,"}, {"id": 1540, "start": 6500.82, "end": 6502.82, "text": "ist..."}, {"id": 1541, "start": 6502.82, "end": 6504.82, "text": "drauf geschissen."}, {"id": 1542, "start": 6504.82, "end": 6506.82, "text": "Aber mir geht's trotzdem auf den Keks."}, {"id": 1543, "start": 6506.82, "end": 6508.82, "text": "Ja..."}, {"id": 1544, "start": 6508.82, "end": 6510.82, "text": "Bett durfte ich übrigens nicht beziehen."}, {"id": 1545, "start": 6510.82, "end": 6512.82, "text": "Google Dark Mode!"}, {"id": 1546, "start": 6512.82, "end": 6514.82, "text": "Haben die da einen Knopf für?"}, {"id": 1547, "start": 6514.82, "end": 6516.82, "text": "Wo geht das?"}, {"id": 1548, "start": 6516.82, "end": 6518.82, "text": "Geht das nur, wenn man eingeloggt ist?"}, {"id": 1549, "start": 6520.82, "end": 6522.82, "text": "Wo machen wir das denn?"}, {"id": 1550, "start": 6522.82, "end": 6524.82, "text": "Ich weiß es nicht."}, {"id": 1551, "start": 6524.82, "end": 6526.82, "text": "Ich weiß es nicht."}, {"id": 1552, "start": 6526.82, "end": 6528.82, "text": "Ich weiß es nicht."}, {"id": 1553, "start": 6528.82, "end": 6530.82, "text": "Ich weiß es nicht."}, {"id": 1554, "start": 6530.82, "end": 6532.82, "text": "Ich weiß es nicht."}, {"id": 1555, "start": 6532.82, "end": 6534.82, "text": "Ich weiß es nicht."}, {"id": 1556, "start": 6534.82, "end": 6536.82, "text": "Wo macht man das?"}, {"id": 1557, "start": 6538.82, "end": 6540.82, "text": "Ich könnte den Darkreader einfach"}, {"id": 1558, "start": 6540.82, "end": 6542.82, "text": "anmachen. Eats."}, {"id": 1559, "start": 6550.82, "end": 6552.82, "text": "Easy!"}, {"id": 1560, "start": 6560.26, "end": 6562.26, "text": "Na ja."}, {"id": 1561, "start": 6562.26, "end": 6564.26, "text": "Wisst ihr was Leute, mir war langweilig."}, {"id": 1562, "start": 6564.26, "end": 6567.42, "text": "Mir ist immer noch langweilig, aber ich gehe jetzt auf"}, {"id": 1563, "start": 6573.9, "end": 6580.94, "text": "Welche seite nutzt du dich um rund ums programmieren auf dem laufe zu halten reddit ich guck ich habe eigentlich alle"}, {"id": 1564, "start": 6581.82, "end": 6583.82, "text": "halbwegs großen"}, {"id": 1565, "start": 6584.14, "end": 6586.14, "text": "programmiert subs"}, {"id": 1566, "start": 6586.34, "end": 6590.1, "text": "Für windows linux die schar ja war sogar javascript als mögliche"}, {"id": 1567, "start": 6590.1, "end": 6595.46, "text": "Gesappt bestimmt 60 stück oder so da gucke ich halt immer mal so rein was es für neue sachen gibt"}, {"id": 1568, "start": 6595.86, "end": 6600.5, "text": "Javascript ignoriere ich die hälfte fall javascript gibt es jeden tag drei neue frameworks die hip sind"}, {"id": 1569, "start": 6600.7, "end": 6602.78, "text": "Da warte ich immer mal ein bisschen ab was so rauskommt"}, {"id": 1570, "start": 6612.06, "end": 6614.7, "text": "Hast du jemals eine winera lizenz ervorfen"}, {"id": 1571, "start": 6614.7, "end": 6621.22, "text": "Der gag ist mittlerweile der gag ist mittlerweile eigentlich outdated"}, {"id": 1572, "start": 6644.7, "end": 6649.98, "text": "Ob es irgendjemand gibt, den ich follow, den ich raussuchen kann aber keiner da der es nötig hätte"}, {"id": 1573, "start": 6663.42, "end": 6665.42, "text": "Ja und wir sehen uns morgen früh"}, {"id": 1574, "start": 6669.82, "end": 6672.02, "text": "Morgen früh bin ich ja wie gewohnt wieder am start"}, {"id": 1575, "start": 6672.02, "end": 6675.06, "text": "Zum sonntaglichen aufwach streben"}, {"id": 1576, "start": 6677.38, "end": 6679.38, "text": "Den gibt es ja schon seit zwei jahren jeden sonntag"}, {"id": 1577, "start": 6680.46, "end": 6683.06, "text": "Ja ich weiß kong hat sich angeblich eine winera lizenz gekauft"}, {"id": 1578, "start": 6683.94, "end": 6685.94, "text": "Also wir sehen uns bis morgen machts gut"}, {"id": 1579, "start": 6687.1, "end": 6688.62, "text": "See you"}, {"id": 1580, "start": 6688.62, "end": 6702.26, "text": "Wollt ihr noch autosong oder geht es ohne mit naja gut"}, {"id": 1581, "start": 6702.26, "end": 6714.26, "text": "Bis morgen früh co"}, {"id": 1582, "start": 6733.26, "end": 6734.26, "text": "Und"}, {"id": 1583, "start": 6734.26, "end": 6735.26, "text": "Und"}, {"id": 1584, "start": 6735.26, "end": 6736.26, "text": "Und"}, {"id": 1585, "start": 6736.26, "end": 6737.26, "text": "Und"}, {"id": 1586, "start": 6737.26, "end": 6738.26, "text": "Und"}, {"id": 1587, "start": 6738.26, "end": 6739.26, "text": "Und"}, {"id": 1588, "start": 6739.26, "end": 6763.26, "text": "Und"}, {"id": 1589, "start": 6799.26, "end": 6820.26, "text": "Und"}]}