{"text": "Das war's für heute. Vielen Dank für's Zuschauen. Das war's für heute. Vielen Dank für's Zuschauen. Das ist schon fast Der Raspberry Pi hat auch Mikro HDMI. Ja, deswegen habe ich auch danach gesucht. Also mir war bis vorhin nicht klar, dass es diese Sorte Kabel gibt. Sieht aus wie ein Mini-USB mit Mikro-USB auf HDMI, aber es ist in Wirklichkeit HDMI auf Mikro-HDMI, was es nicht alles gibt. Gibt es eigentlich mittlerweile irgendwelche Schnittstellen und Adapter? Nicht in drei Varianten mindestens. Ich meine, ok, USB ist ein ganz schlechtes Beispiel. USB gibt es ja mittlerweile 16 Stecker oder so. Oder 16 verschieden geformte Anschlüsse, wenn nicht mehr. Da blickt wirklich keiner mehr durch. Bei HDMI gibt es, soweit ich das gesehen habe, nur den normalen HDMI, Mini-HDMI und Mikro-HDMI. Die sich dann aber auch irgendwie Typ A und Typ D und Typ C und wie auch immer nennen. Weil Hauptsache habt ihr kompliziert. VGA. Du hast recht. VGA gibt es glaube ich echt nur VGA. Aber VGA kommt auch noch aus einer Zeit, da gab es Anschlüsse, die gab es dann für 25 Jahre, wenn es die gab. Da gab es VGA, S-Video. Das war es. Nee, nicht S-Video. Das Gelbe. Doch das Gelbe war S-Video, oder? S-Video? Ja, das Gelbe. Composite. Was war das? Gelbe? Doch das Gelbe. Ach nee, S-Video gab es auch noch. Moment, das habe ich jetzt durcheinander gebracht. Ich meine das da. Ich meine das da. Das gab es auch noch. Das gab es auch noch. Und das hier kommt aus einer Zeit, wo sie gerade nicht so genau... Das ist die Zeit kurz vor HDMI. Das ist die Zeit kurz vor... Nee, die Composite-Video ist gelb gewesen. Und rot-weiß war für Audio. Das hier war kurz vor HDMI. Das war die Zeit, wo sie dann noch teilweise SCART, S-Video, Composite oder aber diesen komischen RGB-Komponenten eingegangen hatten. Den die ersten HD... Vielleicht hatte jemand von euch mal sowas? Das hatte die ersten... Nee, das ist nicht HDMI. Die ersten HD-Fernseher hatten diesen Komponent RGB-Eingang oder ich weiß nicht wie dieser Kram heißt. Genau, die HD-PvR hatte sowas auch. Ich hatte nie eine HD-PvR. Ich habe angefangen mit einer Blackmagic-Karte und jetzt das Elgato-Ding. Übrigens das Elgato-Ding, da müssen wir mal klar gucken, ob es funktioniert. Zumindest das ist Excellent Micro HDMI. Was war zuerst da? Die Sache, die ich mir vorher meinen Raspberry Pi 4 angeguckt habe und weil ich den Video gesehen habe, nehme ich das hier. Das hier. Ein kompletter Schwachsinn. Das ist irgendeiner, der den Raspian gestylt hat auf Windows XP und Windows 95. Dabei allerdings einen VM-Image für Windows 98 dabei hat und wohl irgendwo ein QEMO-Ding mit Windows 95. Ich habe mir gedacht, wir könnten uns das Just For Fun einfach mal angucken. Nicht zum Benutzen, weil ich habe keinerlei Anwendungszweck für sowas. Das ist eigentlich komplett sinnlos, aber ich probiere es einfach mal aus. Hi, es ist Juhi. Fünf Monate. Wahnsinn. Subscriber. Huge. Massive. Gigantic. Enormous. Huge. Subscribers. Und das Ganze sogar. Kein Prime, sondern richtig echt. So. Und das wollte ich ausprobieren und dann habe ich auf meinen Raspberry Pi 4 geguckt, weil man nicht richtig schreiben kann. Raspberry Pi 4. Aber das Gute ist, dass Google mittlerweile so gut Autovervollständigung ist, dass das einfach funktioniert. Dann habe ich mir ein Bild voll angeguckt und habe festgestellt, also kein Bild vor Schwachsinn, ich habe mir den angeguckt, ich zeige euch jetzt einfach mal ein Bild und habe festgestellt, was zum Teufel ist das? Und dann bin ich draufgekommen, Scheiße, das ist ja Mikro HDMI. Wer verwendet Mikro HDMI? Ich habe mich mal auf gut Glück in meiner Amazon Bestellhistorie gesucht, HDMI, und habe mir alle HDMI Kabel angeguckt, die ich jemals bestellt habe und ich habe mir 2014, also vor sechs Jahren, habe ich gesehen, dass ich mal einen Mikro HDMI Kabel gekauft habe. Warum auch immer. Und das hatte glücklicherweise einen sehr markanten Stecker. Das hatte glücklicherweise einen sehr markanten Stecker, das Mikro HDMI Kabel. Sieht ein bisschen aus wie das hier, bloß in grau-weiß. Und da habe ich mich dran erinnert, Moment, das Ding hängt doch auf halb acht hinter meinem Schreibtisch runter und so habe ich es relativ schnell gefunden, da habe ich mir gedacht, komm wir probieren das heute Abend einfach mal aus. Also. Green Abonnier Twitch Prime. Huge Sub. Massive. Die Musik ist ein bisschen laut, oder? So, so ist besser. So, deswegen probieren wir das jetzt mal aus. Wir müssen uns mal kurz das Video anschauen. Ich vermute mal, dass man. Ich vermute mal, dass man das einfach installiert, indem man, komm wir dehnen das einfach auf die SD-Karte. Wir probieren das jetzt mal aus. Oh fuck, wo ist mein Kartenleser? Wo ist mein SD-Kartenleser? Ich könnte auch einfach aus der Historie nehmen. Wo ist mein SD-Kartenleser? Ich habe extra zwei Stück hier rumfliegen, dass ich immer einen finde. Irgendwo. Oh, ne, das ist was anderes. Was ist da? Hier, ich habe ihn. Ich habe ihn, da ist er. China Billish. Billish China USB-SD-Kartenleser. So, und das erste, was wir machen müssen ist, und ich sage euch gleich, ich würde es an eurer Stelle nicht machen. Was ich nämlich in diesem Video gesehen habe ist, wenn man das downloaden will, wenn man das downloaden will, dann, das ist der Typ, der sich, im Prinzip ist das ein reskinntes Respian mit Windows XP. Es ist komplett schwachsinnig, ja. So, und wenn man das ganze downloaden will, wird man feststellen, man kommt auf Google Drive Links raus. Google Drive Links sind in der Regel nichts, was ich downloade und auf meiner Hardware irgendwie installiere. Aber wir machen heute mal eine Ausnahme. Wir probieren das einfach mal aus. Ich meine, was soll großartig passieren? Eigenes WLAN, fertig. Ist dein HostOS eigentlich Windows oder Linux? Windows mit Linux in VMWare Workstation. Aber wie gesagt, ich würde es nicht an eurer Stelle empfehlen zu installieren, solange es da nicht einen offiziellen Mirror gibt, bzw. eine offizielle Seite, wo auch Checksum dabei stehen, dass man wenigstens überprüfen kann, ob der Download richtig ist. Das würde ich nicht machen. Jetzt geht es hier aber los im Chat. Ja, der Qt-Mod ist da. Da geht es immer los. So, ich muss das erst mal flashen. Ich muss das jetzt erst mal kurz flashen, das Ding auf die SD-Card. Also. Was habe ich? Also ich habe hier eine, das müsste doch reichen, ne? Ich habe hier eine 16 GB Samsung SD-Karte. Das sollte doch reichen. So, downgeloadet habe ich das Ganze schon. Nämlich hier. Wir müssen das bloß noch mal kurz rüberkopieren. Was? Bulk rename? WTF? File Manager aufmachen. Wir müssen das noch mal rüberkopieren. Und zwar habe ich hier eh einen Doppelpunkt. Da ist es Raspbian 1.1.7. Ah, ja, ja. Das kopieren wir mal jetzt hier. Auf mein Linux VM, weil die brauchen wir gleich zum Flashen. Vielleicht soll ich die Ubuntu-Beta mal löschen, weil die frisst einfach nur sinnlos Speicherplatz. Sorry Leute. Ubuntu. Ubuntu, richtig Clocks HD. Wenigstens einer das richtig macht. Ich meine, wir haben uns ja sogar die Aussprache von Nelson Mandela höchstpersönlich angehört. Und ihr wart alle dabei. Nelson Mandela hat natürlich gesagt, Ubuntu. Ubuntu. Ne, aber genug gibated. Natürlich hat er das nicht gesagt, sondern er hat gesagt Ubuntu. Achso, mein SD-Karten-Reader soll ich vielleicht mal reinstecken. Wie rum kommt denn der? So. Ah, excellent. Stream-VM. Ja. Ich wusste, dass euch dieses PPE-Mode gefällt, Chat. Das war mir klar. Ich hatte die Auswahl, mache ich Salami rein oder Hyper-Gachi? Ich wusste, Salami ist für den Chat das bessere E-Mode. Geht aber nicht. Klar geht das. Ich sehe das E-Mode. Das geht. Siehst du? Ach guck mal, in meinem Chat geht das nicht. Kann das sein, dass die Custom-E-Modes kaputt sind? Kann das sein, dass die Custom-E-Modes im Chat kaputt sind? Wir probieren jetzt mal einen FFZ-E-Mode aus und einen Better-Twitch-TV-E-Mode aus. Wartet mal. Mal gucken, ob das funktioniert. Aha. Also es funktionieren nur FFZ-E-Modes gerade. Warum funktionieren nur FFZ-E-Modes in meinem... komisch. Sehr, sehr komisch. Ich glaube der Steam-Labs-Chat-Bot-Einblendungs-Ding ist gerade kaputt. Ja im Chat gehen beide, aber in meiner Chat-Einblendung nicht. Sehr merkwürdig. Äh im Moment, wo habe ich den Kram jetzt überhaupt hinkopiert? Ah. Machen wir mal nach Downloads. Bam. Excellent. Jetzt flashen wir den Kram nochmal. Ups, gehe aus. Ich bin irgendwie ziemlich kaputt heute. Ich weiß auch nicht genau warum. Warum gehen die E-Modes in der Chat vor? Schau nicht. So, wo haben wir es denn hier? Wo ist es denn? Raspian? Hä? Kann das das nicht? Kann das sein, dass das kein 7-Zip kann? Kann das kein 7-Zip? Ich glaube das kann kein 7-Zip. Äh wie anzippt man 7-Zip und... wir machen uns das Leben einfach. What the hell. Wir nehmen einfach den X-Archive und entpacken das. Aber entpacken? Ah da ist ein Image drin. Ok, ein Image entpacken ist ok. Das funktioniert. Extract tut... ne nicht zu Temp. Wir wollen sich ja Temp extrahieren, sondern eigentlich wollen wir es nach Downloads extrahieren. Da. Home, Downloads. Da wollen wir es hin extrahieren. Extract. Sehr gut. Ich hoffe wir haben danach noch genug Platz. Oh, 8 Gigabyte? Nein. Das ist keine gute Idee, Max. Das ist keine gute Idee. Wir haben keinen Platz, Leute. Wir haben keinen Platz. Dann machen wir es jetzt. Komm, wir machen es in der neuen VM. Wir machen es. Warum mache ich überhaupt noch so viel in der alten VM? Wir machen das in der neuen VM. Wir machen das in der neuen VM. Da habe ich zwar schon eine Weihlingsmaterie gemacht, aber das passt. Wir machen es in der neuen VM. Da haben wir mehr als genug Platz. Warum spendet mein Bot die ganze Zeit meine Hardware? Das macht er doch sonst nicht. Achso. Weil die Leute die Commandos verwenden. Ich bin mir gar nicht sicher ob das überhaupt aktuell ist. Was da in dem Hardware-Commando drin steht. Keine Ahnung ob das überhaupt aktuell ist. Etcher. Haben wir nicht mal installiert. Etcher. Kommen wir jetzt. Etcher. Install. Yes. Excellent. Oh. Oh wir haben. Okay wir müssen erstmal noch ein Update machen. Sitze mal. Huge massive Vorbereitung wieder Leute. Internet connection. What the fuck. Was ist hier gerade los? Ping. 1 1 1. Geht doch. Pacman. Pacman. Alles updaten. Jetzt geht noch nicht mal meine. What the hell. Warum ist meine VM gerade so kaputt. Wodafone. Oh ruckelts wieder. Nee hoffentlich nicht. Ach ich weiß ich habe hier meine Dot-Files noch gar nicht aktualisiert. Sollte ich vielleicht mal machen. Sollte ich vielleicht mal machen. Weil ich habe hier nämlich auf GitHub Wobblorz Dot-Files. Ich habe den ganzen Kram mittlerweile abgeloadet. Und ich könnte die ganz einfach wieder auschecken jetzt. Aber wir machen jetzt nicht so ein langes Ding. Also nicht so lang. Wir flashen jetzt die SD-Card und gut ist. Dann wollen wir uns das nämlich mal ausprobieren. Connect. Yes. Sehr gut. Was hast du für ein CPU in 8700K ein bisschen übertaktet? Das ist eine gute Sache. Was hast du gerade vor? Wir probieren das hier aus. Auf Raspberry Pi probieren wir das hier aus. Einfach just for fun. Einfach sinnloserweise probieren wir die Raspbian XP Edition aus. Ich habe keinerlei Anwendungszweck für. Das sage ich gleich. Bisschen übertaktet auf 6 Gigahertz. Nee 4,5 Gigahertz habe ich glaube ich übertaktet. Base Takt mit All Core Enhancement war glaube ich 4,7 beim 8700K. 8700K. Kommen wir gerade mal gucken. 4,7 genau All Core Turbo 4,7. Ich habe auf 5 Gigahertz übertaktet also nicht viel. Aber geht. Ich meine wenn ich schon so einen fetten Lüfter drauf habe warum soll ich denn nicht auch fette, fette ne Zeug nehmen? Ich muss den Kram nochmal rüber kopieren. What? What the fuck? Warum ist mein Copy Paste? Warum ist meine VM so im Arsch heute? Was ist denn da los? Was ist denn da los? MonkaS wird noch eine Herausforderung das zu kopieren. Doch VMer Tools habe ich installiert sonst würde ja die Auflösung nicht funktionieren. Warum geht das Tracking? Ah ich weiß warum das Tracking Drop nicht geht. Wahrscheinlich weil ich das nicht aktiviert habe. Das muss man doch in Settings irgendwo aktivieren. Erstmal ausmachen. Ich glaube das muss man in Settings doch irgendwie aktivieren. Oder muss man das nicht irgendwo Tracking Drop? Shared Folder? Nee Shared Folder war was anderes. Scheint Big Brainiger als ich das Ganze gedacht habe. Vmware Enable, Tracking Drop, Linux. Muss man da irgendwas spezielles machen. Ah hier Options, Select Guest Isolation. Options, Guest Enable, Tracking Drop, Copy und Paste. Ok sollte eigentlich funktionieren. Na schauen wir mal. Da haben wir erstmal ein Curdle Update gemacht. Kann ja nichts schaden. Öffne mal den Download Ordner und zieh es da rein. Das macht überhaupt keinen Unterschied. Wir probieren das jetzt mal aus. Das Hintergrundbeladen ist auch kaputt. Was ist denn mit meiner VM los? What the fuck? Ich habe keinen Schimmer was da kaputt ist. Excellent. Boah warum geht das nicht? Warum ist Tracking Drop kaputt? Was ist denn nur mit Kasten los? Ok da müssen wir erstmal gucken. Da ist es komplizierter als ich gedacht habe. Arch, Tracking Drop, Vmware. Warum geht das nicht? Warum ist das Broken? Tracking Drop, Copy und Paste. Ok. Also. Also was muss man machen? Tracking Drop, Feature, Open VM Tools und GTKMM3. Haben wir das installiert? Ich glaube schon. Ich glaube schon. Haben wir installiert. Ok. Make the command. Run. Ah vielleicht macht er das nicht automatisch. Vmware, User. Excellent. Oh ne ne da will ich nicht hinkopieren. Ah. Ok. Dann machen wir das mal. Archwiki Leute ich sag es euch. Archwiki ist das beste. Meine Güte warum? Was ist, was zum Teufel ist mit meinem Keybindings los? Sehr gut. Gut dass es funktioniert. Perfekt. Dann machen wir das hier irgendwo. Vmware, User. Ich führe es doch aus. Ich führe es doch aus. Ok. Wie auch immer halten wir uns mal nicht so lang drauf. Aber dran auf. Wir kopieren den Kram jetzt hier mal rein. Zack. Zack. Mehr müssen wir ja nicht machen. Den Rest können wir dann. Warum die VM rumspackt ist jetzt heute nicht unser Problem. Was machst du gerade? Ich flasche Raspbian XP auf eine SD Karte und dann gucken wir mal. Wie Mikro HDMI. Will mich das heute alles verarschen oder was? Ok. Das kriegen wir schon gebacken. Sonst mache ich Shared Folder. Shared Folder geht immer. Ok. Wie meine Keybindings nicht funktionieren. Auch geil. Jetzt muss ich hier wie der letzte Kack nur mit den File Tasten rum navigieren. Ah das funktioniert jetzt oder wie? Das funktioniert jetzt anscheinend. Na gut. Wunderbar. Kann ich auch mitleben? Move. Raspbian in Download und C in Download. Wie unpackt man eigentlich ein 7zip unter Linux? Unpack. Gibt es da sowas wie 7unpack oder so? Wie unpackt man ein 7zip? Es ist kein Ta. Das ist was anderes. Ne ne. Denn Ta geht nicht. Wenn ich sage Ta dann wird der... Moment. Target Z wäre das hier. Das funktioniert nicht weil es kein Ta ist und auch wenn es kein Gzip ist. Das ist was anderes. How do I compress? 7zip File. Also was müssen wir installieren? 77zx falls wir das schon installiert haben. Raspbian ok. 7zip installieren wir da. Wunderbar. 7zip jawoll. So sehr schön. TobiX das ist die neu aufgesetzte VM. Die sieht man ja auch. Die ist viel weniger drauf und auf der Alten viel mehr Platz. Ich hab bloß meine Config Files noch nicht gepult die ich mittlerweile aktualisiert hab. Offstream. Sollte ich mal machen. Dann sind auch die ganzen Keybindings da und das Rumgespacke weg. Installier P7 und A-Tool und danach immer A-unpack. Was ist denn A-Tool? Ist das so ein Archive Tool was unter der Haube alle möglichen Formate erkennt und den richtigen Unpacker nimmt? Wie viel Speicher hast du insgesamt? Also ich hab 2TB SSD, 500GB SSD und 6TB HDD in dem Rechner. Warum hat er seine VM nur aufgesetzt? Weil ich im Stream zeigen wollte wie man dann Manjaro Linux installiert mit so Basic Sachen drauf. Und weil meine VM ziemlich vermüllt ist mittlerweile mit zig Sachen und ich wollte auch mal ein paar neue Sachen ausprobieren. Was und dein Server? Also die alte 4HE NAS Kiste bzw. mein Multifunktions Server für alles, die 4HE Kiste, die hat 3x 10TB Platte und irgendwelche Intel Server SSDs die ich bei uns auf der Arbeit gekriegt hab als wir das RZ ausgeräumt haben. Den verwende ich aber nicht mehr. Ich verwende jetzt hier diese kleine 2HE Kiste oder 1,5HE sind sie eigentlich nur wenn man genau ist. Und die hat nur eine SSD, eine 500G SSD drin und eine 12TB Platte drin. Fertig. Ohne Backup Platte gibt es dann demnächst noch. Reicht. Scheiß auf ZFS, Scheiß auf RAID. Ist alles absolut Overkill für mich daheim. Brauchen wir nicht. Genormen auf 1,5HE. Ja das ist das schlechteste, billigste REC Gehäuse was es gegeben hat. Also 19 Zoll Gehäuse. So jetzt, jetzt können wir endlich, jetzt können wir den Kram endlich flashen. Äh hier Image. Etcher. Etcher starten. Etcher. Hab ich nicht Etcher gerade schon installiert? Etcher. Nee hab ich nicht installiert. Nicht 10x10TB im RAID. Nee es waren 3x10TB im RAID 5. Wobei das bei ZFS nicht RAID 5 heißt. Sondern ich glaube bei ZFS, nicht echt. Vielleicht ZRAID 1. Warum ist das? Genau RAID Z1 ist es. Bei ZFS. Ist aber ähnlich zu einem RAID 5. Während der hier flasht und entpackt können wir noch ein paar Fragen beantworten. Oh nee ich hab meine Stream vor allem ausgemacht. Es geht ja nicht. Jetzt ist ja mein. Fuck. Jetzt hab ich die Fragen ja alle gar nicht mehr mitgekriegt. Mal kurz durchscrollen. Wird es nochmal eine Memetool Version auf GitHub geben? Das weiß ich noch nicht. Äh. Ich glaube ich hab nichts verpasst. Aber die müssen wir laufen lassen, dass das Pepega Board weiter funktioniert. Oh ohne Pepega Board übersehe ich ja die Hälfte. So. Während der Kram hier jetzt auf die SD-Karte SD kartet. Ach ist er fertig? Hat er jetzt entpackt? Okay. Etcher. Etchor. Gucken ob ich hier darf. Select Image. Downloads. Respion Image. Select Target. Okay geht nicht. Dann muss ich das mit Sudo starten. Weil das ist die SD-Karte. Alter warum erkennst du die SD-Karte? Achso da hat die SD-Karte wieder unmounted. Auch. Exzellent. So. Jetzt aber. Ah. Sehr schön. Respion Image. SD-Karte. 16G. Flash. Und das geht nicht, weil ich nicht root bin. Na auch toll. Ich überleg gerade. Was für eine Gruppe muss ich mich packen, dass ich das machen darf ohne Sudo? Weiß ich jetzt gerade nicht. So. Gut. Während der Flash. Das dauert jetzt 2-3 Minuten. Nein das dauert keine 25 Minuten. Das ist G-Bait. Gucken wir uns das andere mal an. Oh das ist doch nicht G-Bait. Das ist G-Bait. Was zum... Willst du mich verarschen? Was ist denn das für eine Zeitrechnung? Ja aber 13 Minuten ist auch viel zu lang. Der will ja sich wirklich 13 Minuten flashen oder? 13 Minuten? Ja wir sehen uns morgen. Also gucken wir uns mal die Fragen an, die ich übersehen habe. Hast du gerade gesagt, welche Oberfläche du bei der VMS hättest? Ja. Das ist i3-WM. Firefox Browser. Genau im Terminal. Und ein bisschen anderes Zeug. Aber das ist i3. So. Was habe ich denn für Fragen übersehen? Jede Menge, wie es aussieht. Das ist ja nicht nur von heute, sondern auch vom Stream gestern und davor. SD-Karten sind langsam. Ja ich habe auch leider nicht die schnellste reingemacht. Ich habe hier ein paar richtig gute SD-Karten. Ach ja, geht eigentlich... Wo wir gerade dabei sind. Kann man eigentlich mittlerweile den Raspberry Pi 4 von USB booten? So richtig offiziell ohne Hex mit SD-Karte. Die Hex mit SD-Karte kenne ich. Vertratet.info. Macht doch mal einen eigenen WM mit Moelander. Garantiert nicht. Moelander. Der macht das auch mit einer SD-Karte. Der macht das auch mit einer SD-Karte. Kann man den Pi mittlerweile vielleicht so richtig echt von USB booten? Denn letzte Stunde ist vielleicht ein bisschen optimistisch. Letzte Woche. Ah, letzte Woche von 2017. Exzellent. Ja das Video vom Andreas Spieß kenne ich, aber der macht es auch mit einer SD-Karte. Anscheinend geht das noch nicht. Anscheinend geht das nicht. Ich frage mich, wie die das geschafft haben. Der Raspberry Pi 3 kann das auch. Verstehe ich gar nicht. Wie sie das hingekriegt haben, dass der das nicht kann. Naja. So, also gucken wir uns mal ein paar Fragen an. Was haben wir denn hier? Alles schönes. Während der Kram hier vor sich hin flasht. Naja, haben wir ein bisschen Zeit. Nee. Hab ich gesagt, haben wir, haben wir, haben wir. Du hast mal was über WireGuard gemacht, finde es aber im Archiv nicht. Google ist dein Freund. Oder auch nicht. Vielleicht habe ich das auch nicht WireGuard genannt. Kann man, kann man auf Twitch Clips durchsuchen? Geht das? Kann man Clips nach Titel durchsuchen? Clips. Nee, Clips Suche geht natürlich nicht. Das wäre zu einfach. Da hätte man nämlich schön suchen können und dann anhand des Datums, was das für ein Stream gewesen ist. Nee, dann weiß ich auch nicht, welcher Stream das war. Hm. Keine Ahnung. Das war was mit VPN. Das war ein YouTube Video, ja. Aber da habe ich nicht gezeigt, wie man WireGuard einrichtet, sondern da habe ich mich generell über die ganzen VPN-Anbieter aufgeregt, dass das zum größten Teil ziemlicher Sack ist. Dann weiß ich nicht, welcher Stream das war. Moin, David Schar. Dark Mode. Wir haben noch einen Dark Mode. Wir haben noch einen Dark Reader. Kann man doch hier mit aufmachen. Bäm. On. Exzellent. Jetzt haben wir aber keine Emotes. Okay. Was ist wichtiger? Emotes oder Dark Mode? Wir können aber einfach Dark Reader in der VM installieren und gut ist, aber das ist Firefox, oder? Das ist Firefox. Dann machen wir das noch viel big brainiger. Wir machen Chrome auf und machen nur im Chrome das Pepega Board auf, aber dann haben wir dann wiederum keine Twitch Emotes. Doch. So machen wir das. Pepega Board machen wir nur im Chrome auf. Da haben wir Twitch Emotes und dann installieren wir da auch den Dark Reader und das ist dann wirklich jetzt absolut next level. So gut, oder? So ist doch perfekt. Twitch Emotes und Dark Reader. Also, WireGuard weiß ich aus dem Kopf nicht, welches Video das ist. Der Host hat mir beantwortet. Das ist die Baron-Url-Weiterleitung eingerichtet. Das ist sehr nice. Wie bist du eigentlich zur IT gekommen? Wie bist du eigentlich zur IT gekommen? Hast du in deiner Jugend schon was damit gemacht? Ja, was genau? Ich habe so viel gemacht in meiner Jugend, das kann ich dir gar nicht alles erzählen. Ich habe natürlich angefangen mit irgendwelchen Sachen, die ich für Bekannte eingerichtet habe. Also, ich glaube, das erste Mal, wo ich Kontakt mit so Elektronik und Konsolen hatte, war glaube ich mein Gameboy. Aber da habe ich natürlich nicht dran rumgebastelt. Danach einen Super Nintendo. Da habe ich natürlich auch nicht dran rumgebastelt. Das war dann ungefähr zeitgleich. Hatte mein Vater damals einen, ich glaube, das war sogar noch ein 4680er. Da habe ich ein bisschen rumgespielt mit Windows 3.0 oder was das war. Aber da habe ich auch nicht so großartig Ahnung gehabt. Da habe ich halt einfach rumgeklickt und sinnloses Zeug gemacht. Damals gab es noch BTX bei der Telekom, falls das noch jemand kennt. BTX. Bildschirmtext. Das war wieder so eine deutsche Geschichte, wo sich gedacht haben, das möchte die Welt haben. Im Endeffekt hat die Welt gesagt, nee, braucht kein Mensch. Aber das war BTX. Nee, das war BTX. So genau so sah das aus. BTX. Sah ähnlich aus wie Videotext, nur dass es über Internet quasi ging. Also nicht wirklich übers Internet, nach raus öffentliches Netzwerk. Sah ein bisschen aus wie Videotext, ein bisschen höher aufgelöst wie Videotext. Ja, und das war so die Zeit, wo ich auch angefangen habe, dann an Technik Sachen rumzubasteln. Der Computer wurde dann aufgeschraubt, da wurde mal ein neues CD-Laufwerk eingebaut. So die kleinen Sachen, mit denen man so anfängt. Ich meine, es fängt ja keiner damit an, Microcontroller zu programmieren. Na, das ging dann weiter mit den üblichen Sachen, wie Windows für irgendwelche Bekannte installiert. Drucker und das, was man so macht, wenn man klein ist und sich ein bisschen auskennt. Und ich fand's damals schon erschreckend, aber das war mir nicht ganz klar, wie wenig Plan eigentlich alle hatten. Weil, ich meine, überlegt euch mal, wenn man einen 7-Jährigen oder so fragen muss, wie man seinen Drucker unter Windows 3.11 installiert, ist schon der Wahnsinn. Wenn man das nicht selbst allein auf die Reihe kriegt. Ja, das sind so die Sachen, womit ich angefangen habe. Ich meine, so richtig angefangen habe ich mich dann dafür zu interessieren, wo ich ein bisschen älter war. Dann hab ich irgendwann auch angefangen, ein bisschen zu programmieren. Und noch eine Ecke später hab ich angefangen, mich mit Linux zu beschäftigen. Das muss schon später gewesen sein, weil die ersten Linux-Distributionen gab's ja dann so 2000 drum vielleicht erstmal. Also das erste, was ich programmiert hab, war damals, hab ich das noch mit C probiert, ganz, ganz eklig. Das erste, was ich versucht hab zu programmieren, war ein, ich nenn's mal so eine Art Cheat für einen MMO, was ich damals gespielt hab. Aber es war kein Cheat, also ich muss jetzt mal kurz erklären. Ich hab da nicht versucht wirklich zu bescheißen im eigentlichen Sinne, nur indirekt, nur indirekt zu bescheißen, aber so, dass es keinem geschadet hat. Und zwar, ich hab damals Dark Age of Camelot gespielt, das war ein MMO von, da kenn ich auch den Friseur her. Das ist ein uraltes MMO und sieht halt auch dementsprechend, dementsprechend aus, wie halt alte MMOs aussehen. Und die haben sich damals gedacht, dass es eine gute Idee wär, wenn man den Spiele klein nicht beenden könnte. Weil, wenn man sobald man den Spiele klein minimiert hat, ist das Spiel abgekackt, weil sie wollten dadurch Cheats verhindern. Dein Drucker geht nicht mehr ohne, ich glaube, ich hab seit 10 Jahren oder so, ohne Mist, oder 5 Jahren, keinen Drucker mehr aus der Linux installiert, kein Schimmer. Ja, und was ich da machen wollte, ist, weil man das Game nicht in den Hintergrund packen konnte. Also, das muss, gucken wir mal, wann das Release Date hat, das war ziemlich zu Release. Ja, so 2001 rum, 2001 rum, 2002 rum, muss das gewesen sein. Da wollte ich quasi ein Programm basteln, was den Chat-Log von dem Spiel ausliest. Das war nämlich das einzige, wo man quasi mit der restlichen Welt interagieren konnte. Und da hab ich ein Programm gebastelt, oder versucht zu basteln, was den Chat-Log ausliest. Und dann hab ich einen einfach im Chat Sachen eingetippt, wie zum Beispiel Musik-Playlist starten und sowas. Und dann hat der das im Hintergrund gemacht, ohne dass ich das Spiel minimieren musste, weil wenn ich das Spiel minimiert hab, hat sich das Spiel ja beendet. So, das war das erste, wo ich so richtig mal angefangen hab, mich mit dem Thema Programmieren zu beschäftigen. So, dann hab ich festgestellt, C-Programmieren ist zum Einstieg voll für'n Arsch. Und dann hab ich ein bisschen später gesagt, okay, wir probieren das mal in.NET zu machen. Dann hab ich angefangen,.NET zu lernen. Seitdem, muss ich sagen, ist C-Sharp immer noch bis heute meine Lieblingssprache. Hat Dark Age of Clem eine API dafür? Nee, das gab eine Textdatei, wo der Chat reingeschrieben wurde, das war alles. Das war die API. Das war ja auch keine offizielle API, die wollten das ja nicht. Oh, wir haben, nee, wir haben nicht fertig geflasht. Die wollten das ja nicht. Die wollten ja nicht, dass man außerhalb vom Spiel was macht, weil man das ja nicht, äh, weil man ja dann cheaten kann, wenn man das Spiel minimiert und sowas. Total bescheuert eigentlich. Es gab dann später weitere Hacks für das Game, dass man das auch mini-, also Hacks, dass man es halt minimieren konnte. Und, äh, ohne dass es abgekackt ist. Und irgendwann haben sie es dann offiziell eingeführt. Wie bist du an die Chatdaten gekommen? Wie gesagt, die standen in der Textdatei. Man konnte in-game Chatlog einschalten. Da muss man, glaub ich, F oder L drücken. Ich glaub, L muss man drücken dafür. Da hat es den Chatlog eingeschaltet. Das war eigentlich eine Funktion, die dafür gedacht war, dass wenn man beleidigt wird in-game, dass man Chatloggen kann und an den, an den Hersteller schicken kann. Und ich hab einfach aber so immer Chatlog laufen lassen und hab dann mit meinem Programm im Hintergrund die Textdatei eingelesen, wo der Chatlog reingeschrieben wird. Also ich hab das, ich, das war da, ein bisschen gehacksort war es damals schon, ja. Also für mich war das natürlich, äh, richtig big brain, was ich mir da gedacht habe. Es hat auch, es hat nie richtig funktioniert. Es hat halbwegs funktioniert, aber nie wirklich, nie wirklich gut. In C. Ja, danach hab ich versucht, im.NET zu machen und das hat deutlich besser funktioniert. Richtig big brain, massive. Ja, aber nicht, das war 2002. .NET,.NET 2.0 Release war am... War das erst 2006? 2006. Ja, cool. Und dann kam das 1er. Genau, das, das kommt auch ungefähr hin von der Zeit her. Also ich muss so in dem Dreh dann angefangen haben mit.NET zu programmieren, weil ich weiß noch, dass es nicht lange gedauert hat, bis es dann irgendeine Testversion und sonst was von.NET 2.0 gab. Ich hab gerade angefangen, wo Neue Special Studio und.NET 2.0 sich am Horizont abgezeichnet haben und damals alle ausgeflippt sind, weil es jetzt Generic Support hat. Da kann ich mich noch dran erinnern. Was ist an C-Sharp besser als an C++? Naja, also besser ist ja eh immer so im Auge des Betrachters. Es kommt für den Anwendungszweck an. Es gibt Sachen, die kannst du mit C++ machen, irgendwie den Microcontroller programmieren, das geht natürlich mit C-Sharp so ohne Weiteres nicht. Aber wenn man mal rein von der Sprache, rein von der, von der, von der Sprache an sich ausgeht, jetzt mal nicht so sehr vom Anwendungszweck, dann ist C-Sharp deutlich logischer in sich aufgebaut als C++. Und ist auch viel, viel eingängiger von der Syntax her als C++. Und nicht so widersprüchlich wie C++. Hat eine bessere Standard-Library als C++. Hat eigentlich fast alles, was die Sprache an sich angeht, besser als C++. Durch das.NET-Framework drunter ist es halt nicht unbedingt für allen Anwendungszweck geeignet. Gibt es Pointer in C-Sharp? Ja, gibt es auch. Wobei man die meistens nicht braucht. Boah, wie lange macht der an der kacke SD-Karte rum? Meine Fresse, äh, das dauert ja ewig. Okay, da können wir noch ein bisschen weiter Fragen lesen. Ähm, gibt's Pointer? Ja, genau, ja, ja, gibt es, gibt es. Es gibt Pointer in C-Sharp, es gibt Referenzen in C-Sharp, Pointer in C-Sharp, unsaved, string manipulation in C-Sharp. Man kann relativ viel in C-Sharp machen, was man auch unsaved in C++ machen kann. Aber halt, äh, braucht man das standardmäßig so gut wie nie. Das braucht man eigentlich fast nur, wenn man interop mit C-Libraries oder anderem Low-Level-Kram macht. Also zum Beispiel, wenn man FFmpeg verwendet, also wenn man FFmpeg verwendet aus.NET bzw. C-Sharp raus, dann braucht man das. Guck, der macht hier auch alles unsaved und mit Pointer. Und das ist C-Sharp. Ähm, wenn man, wie gesagt, wenn man Low-Level-Sachen macht und vor allem interop mit C, dann braucht man unsaved, Pointer und Pointer in C-Sharp, sonst brauchst du das eigentlich fast nie. Damals hab ich den Druckertreiber auf dem C64 selber geschrieben in Hex. Ich weiß nicht, ob's, ob's getrollt ist, aber ich glaub's dir mal, weil es gab Leute, die haben sowas gemacht. Das ist Big Brain. Kurz auf der Klasse, warum, ach. So, haben wir das beantwortet. Mikro-ADMI, okay. Ja, ich hatte sowas bis jetzt noch nicht. Es ist heute das erste Mal, dass ich Mikro-ADMI bewusst gesehen hab. Das ist doch von gestern vom Einkaufs, Einkaufsstream. Hast du nen Befehl, mit dem ich nen Tree Recursive machen kann in Ubuntu, damit alle da in allen unter... Ist Tree nicht schon Recursive? Ist doch Recursive. Hä? Ja, also Siebau. Das ist schon schnell am Tree Recursive. Musst doch gar nix machen. Ja. I outbroke or the Home Assistant? Ich hab Home Assistant für meine ganze Heimautomatisierung. Ja, dann installier das mal. Also, ich glaub, das ist einer der Vorteile von Tree, dass das standardmäßig Recursive ist. So, wir sind bei 79% SD-Karten. Das ist tatsächlich ein Problem. Ein halbwegs komplexer 3D-Druck, der kann auch ohne Probleme mal vier, fünf Stunden dauern. Sogar relativ kleine Gehäuse dauern vier, fünf Stunden. Und falls mal einer... Hat mal einer von euch versucht, ein Raspberry-Gehäuse zu drucken oder so? Da druckst du mit Deckel 12, 13 Stunden. Ist eigentlich komplett lächerlich so. Aber ist trotzdem ganz nice. Hast du schon mal mit dem Entity-Framework gearbeitet? Also mit dem klassischen Entity-Framework? Noch nicht. Mit Entity-Framework Core relativ oft schon. Kann der Pi 4 mittlerweile HDCP-Content abspielen? Kein Schwimmer. Probieren wir mal. Können wir mal ausprobieren, klar. Du meinst wohl ER5? Null. Noch nicht. Noch nicht. Noch nicht bei ER5. Was willst du denn wissen Entity-Framework-mäßig? Schrieße los. Gleich ist es fertig. Das ist Animal Crossing Musik. Oder? Ach nee. Evangelion can do it, nicht Animal Crossing. Woah wir haben es geschafft Leute. Pockets. So. Sehr schön. Sync. Und jetzt stöpseln wir das mal in unseren Raspberry Pi rein. Mal gucken was passiert. Ich hab mir keinen Guide oder sonst was dazu angeguckt. Ich hab das jetzt einfach mal reingesteckt und gehofft, dass es funktioniert. Und das machen wir jetzt mal also. SD-Karte raus. Oh fuck. Nein. Die SD-Karte ist runtergefallen. Eine schwarze SD-Karte auf meinem schwarzen Teppich. Wo ist... Ah da ist sie. Onkel S. Das wärs jetzt. Hätte ich die SD-Karte runtergeschmissen und hab sie aber gefunden.", "segments": [{"id": 1, "start": 150.0, "end": 152.0, "text": "Das war's für heute."}, {"id": 2, "start": 152.0, "end": 154.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 3, "start": 154.0, "end": 181.0, "text": "Das war's für heute."}, {"id": 4, "start": 181.0, "end": 188.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 5, "start": 211.0, "end": 213.0, "text": "Das ist schon fast"}, {"id": 6, "start": 217.5, "end": 221.0, "text": "Der Raspberry Pi hat auch Mikro HDMI. Ja, deswegen habe ich auch danach gesucht."}, {"id": 7, "start": 226.0, "end": 229.3, "text": "Also mir war bis vorhin nicht klar, dass es diese Sorte Kabel gibt."}, {"id": 8, "start": 229.8, "end": 237.0, "text": "Sieht aus wie ein Mini-USB mit Mikro-USB auf HDMI, aber es ist in Wirklichkeit HDMI auf Mikro-HDMI, was es nicht alles gibt."}, {"id": 9, "start": 237.0, "end": 241.0, "text": "Gibt es eigentlich mittlerweile irgendwelche Schnittstellen und Adapter?"}, {"id": 10, "start": 241.0, "end": 245.0, "text": "Nicht in drei Varianten mindestens."}, {"id": 11, "start": 247.0, "end": 250.0, "text": "Ich meine, ok, USB ist ein ganz schlechtes Beispiel."}, {"id": 12, "start": 250.0, "end": 254.0, "text": "USB gibt es ja mittlerweile 16 Stecker oder so."}, {"id": 13, "start": 254.0, "end": 258.0, "text": "Oder 16 verschieden geformte Anschlüsse, wenn nicht mehr."}, {"id": 14, "start": 258.0, "end": 260.0, "text": "Da blickt wirklich keiner mehr durch."}, {"id": 15, "start": 260.0, "end": 270.0, "text": "Bei HDMI gibt es, soweit ich das gesehen habe, nur den normalen HDMI, Mini-HDMI und Mikro-HDMI."}, {"id": 16, "start": 270.0, "end": 275.0, "text": "Die sich dann aber auch irgendwie Typ A und Typ D und Typ C und wie auch immer nennen."}, {"id": 17, "start": 275.0, "end": 277.0, "text": "Weil Hauptsache habt ihr kompliziert."}, {"id": 18, "start": 281.0, "end": 287.0, "text": "VGA. Du hast recht. VGA gibt es glaube ich echt nur VGA."}, {"id": 19, "start": 287.0, "end": 297.0, "text": "Aber VGA kommt auch noch aus einer Zeit, da gab es Anschlüsse, die gab es dann für 25 Jahre, wenn es die gab."}, {"id": 20, "start": 303.0, "end": 307.0, "text": "Da gab es VGA, S-Video."}, {"id": 21, "start": 308.0, "end": 309.0, "text": "Das war es."}, {"id": 22, "start": 309.0, "end": 316.0, "text": "Nee, nicht S-Video. Das Gelbe. Doch das Gelbe war S-Video, oder?"}, {"id": 23, "start": 316.0, "end": 318.0, "text": "S-Video?"}, {"id": 24, "start": 320.0, "end": 324.0, "text": "Ja, das Gelbe. Composite. Was war das? Gelbe?"}, {"id": 25, "start": 325.0, "end": 329.0, "text": "Doch das Gelbe. Ach nee, S-Video gab es auch noch. Moment, das habe ich jetzt durcheinander gebracht."}, {"id": 26, "start": 329.0, "end": 331.0, "text": "Ich meine das da. Ich meine das da."}, {"id": 27, "start": 335.0, "end": 336.0, "text": "Das gab es auch noch."}, {"id": 28, "start": 336.0, "end": 343.0, "text": "Das gab es auch noch. Und das hier kommt aus einer Zeit, wo sie gerade nicht so genau..."}, {"id": 29, "start": 343.0, "end": 345.0, "text": "Das ist die Zeit kurz vor HDMI."}, {"id": 30, "start": 347.0, "end": 351.0, "text": "Das ist die Zeit kurz vor... Nee, die Composite-Video ist gelb gewesen."}, {"id": 31, "start": 354.0, "end": 357.0, "text": "Und rot-weiß war für Audio."}, {"id": 32, "start": 357.0, "end": 370.0, "text": "Das hier war kurz vor HDMI. Das war die Zeit, wo sie dann noch teilweise SCART, S-Video, Composite oder aber diesen komischen RGB-Komponenten eingegangen hatten."}, {"id": 33, "start": 370.0, "end": 373.0, "text": "Den die ersten HD... Vielleicht hatte jemand von euch mal sowas?"}, {"id": 34, "start": 373.0, "end": 387.0, "text": "Das hatte die ersten... Nee, das ist nicht HDMI. Die ersten HD-Fernseher hatten diesen Komponent RGB-Eingang oder ich weiß nicht wie dieser Kram heißt."}, {"id": 35, "start": 387.0, "end": 396.0, "text": "Genau, die HD-PvR hatte sowas auch. Ich hatte nie eine HD-PvR. Ich habe angefangen mit einer Blackmagic-Karte und jetzt das Elgato-Ding."}, {"id": 36, "start": 396.0, "end": 407.0, "text": "Übrigens das Elgato-Ding, da müssen wir mal klar gucken, ob es funktioniert. Zumindest das ist Excellent Micro HDMI."}, {"id": 37, "start": 409.0, "end": 421.0, "text": "Was war zuerst da? Die Sache, die ich mir vorher meinen Raspberry Pi 4 angeguckt habe und weil ich den Video gesehen habe, nehme ich das hier."}, {"id": 38, "start": 421.0, "end": 433.0, "text": "Das hier. Ein kompletter Schwachsinn. Das ist irgendeiner, der den Raspian gestylt hat auf Windows XP und Windows 95."}, {"id": 39, "start": 433.0, "end": 443.0, "text": "Dabei allerdings einen VM-Image für Windows 98 dabei hat und wohl irgendwo ein QEMO-Ding mit Windows 95."}, {"id": 40, "start": 443.0, "end": 453.0, "text": "Ich habe mir gedacht, wir könnten uns das Just For Fun einfach mal angucken. Nicht zum Benutzen, weil ich habe keinerlei Anwendungszweck für sowas."}, {"id": 41, "start": 453.0, "end": 456.0, "text": "Das ist eigentlich komplett sinnlos, aber ich probiere es einfach mal aus."}, {"id": 42, "start": 456.0, "end": 474.0, "text": "Hi, es ist Juhi. Fünf Monate. Wahnsinn. Subscriber. Huge. Massive. Gigantic. Enormous. Huge. Subscribers. Und das Ganze sogar. Kein Prime, sondern richtig echt."}, {"id": 43, "start": 474.0, "end": 486.0, "text": "So. Und das wollte ich ausprobieren und dann habe ich auf meinen Raspberry Pi 4 geguckt, weil man nicht richtig schreiben kann. Raspberry Pi 4."}, {"id": 44, "start": 486.0, "end": 494.0, "text": "Aber das Gute ist, dass Google mittlerweile so gut Autovervollständigung ist, dass das einfach funktioniert."}, {"id": 45, "start": 494.0, "end": 506.0, "text": "Dann habe ich mir ein Bild voll angeguckt und habe festgestellt, also kein Bild vor Schwachsinn, ich habe mir den angeguckt, ich zeige euch jetzt einfach mal ein Bild und habe festgestellt, was zum Teufel ist das?"}, {"id": 46, "start": 506.0, "end": 514.0, "text": "Und dann bin ich draufgekommen, Scheiße, das ist ja Mikro HDMI. Wer verwendet Mikro HDMI?"}, {"id": 47, "start": 514.0, "end": 533.0, "text": "Ich habe mich mal auf gut Glück in meiner Amazon Bestellhistorie gesucht, HDMI, und habe mir alle HDMI Kabel angeguckt, die ich jemals bestellt habe und ich habe mir 2014, also vor sechs Jahren, habe ich gesehen, dass ich mal einen Mikro HDMI Kabel gekauft habe."}, {"id": 48, "start": 533.0, "end": 546.0, "text": "Warum auch immer. Und das hatte glücklicherweise einen sehr markanten Stecker. Das hatte glücklicherweise einen sehr markanten Stecker, das Mikro HDMI Kabel."}, {"id": 49, "start": 546.0, "end": 563.0, "text": "Sieht ein bisschen aus wie das hier, bloß in grau-weiß. Und da habe ich mich dran erinnert, Moment, das Ding hängt doch auf halb acht hinter meinem Schreibtisch runter und so habe ich es relativ schnell gefunden, da habe ich mir gedacht, komm wir probieren das heute Abend einfach mal aus."}, {"id": 50, "start": 563.0, "end": 573.0, "text": "Also. Green Abonnier Twitch Prime. Huge Sub. Massive."}, {"id": 51, "start": 573.0, "end": 584.0, "text": "Die Musik ist ein bisschen laut, oder?"}, {"id": 52, "start": 584.0, "end": 588.0, "text": "So, so ist besser."}, {"id": 53, "start": 588.0, "end": 602.0, "text": "So, deswegen probieren wir das jetzt mal aus. Wir müssen uns mal kurz das Video anschauen. Ich vermute mal, dass man."}, {"id": 54, "start": 602.0, "end": 609.0, "text": "Ich vermute mal, dass man das einfach installiert, indem man, komm wir dehnen das einfach auf die SD-Karte. Wir probieren das jetzt mal aus."}, {"id": 55, "start": 609.0, "end": 625.0, "text": "Oh fuck, wo ist mein Kartenleser? Wo ist mein SD-Kartenleser?"}, {"id": 56, "start": 625.0, "end": 634.0, "text": "Ich könnte auch einfach aus der Historie nehmen. Wo ist mein SD-Kartenleser?"}, {"id": 57, "start": 634.0, "end": 644.0, "text": "Ich habe extra zwei Stück hier rumfliegen, dass ich immer einen finde."}, {"id": 58, "start": 644.0, "end": 655.0, "text": "Irgendwo. Oh, ne, das ist was anderes. Was ist da? Hier, ich habe ihn. Ich habe ihn, da ist er."}, {"id": 59, "start": 655.0, "end": 667.0, "text": "China Billish. Billish China USB-SD-Kartenleser. So, und das erste, was wir machen müssen ist, und ich sage euch gleich, ich würde es an eurer Stelle nicht machen."}, {"id": 60, "start": 667.0, "end": 680.0, "text": "Was ich nämlich in diesem Video gesehen habe ist, wenn man das downloaden will, wenn man das downloaden will, dann, das ist der Typ, der sich, im Prinzip ist das ein reskinntes Respian mit Windows XP."}, {"id": 61, "start": 680.0, "end": 689.0, "text": "Es ist komplett schwachsinnig, ja. So, und wenn man das ganze downloaden will, wird man feststellen, man kommt auf Google Drive Links raus."}, {"id": 62, "start": 689.0, "end": 700.0, "text": "Google Drive Links sind in der Regel nichts, was ich downloade und auf meiner Hardware irgendwie installiere."}, {"id": 63, "start": 700.0, "end": 713.0, "text": "Aber wir machen heute mal eine Ausnahme. Wir probieren das einfach mal aus. Ich meine, was soll großartig passieren?"}, {"id": 64, "start": 713.0, "end": 722.0, "text": "Eigenes WLAN, fertig. Ist dein HostOS eigentlich Windows oder Linux? Windows mit Linux in VMWare Workstation."}, {"id": 65, "start": 722.0, "end": 733.0, "text": "Aber wie gesagt, ich würde es nicht an eurer Stelle empfehlen zu installieren, solange es da nicht einen offiziellen Mirror gibt, bzw. eine offizielle Seite, wo auch Checksum dabei stehen,"}, {"id": 66, "start": 733.0, "end": 740.0, "text": "dass man wenigstens überprüfen kann, ob der Download richtig ist. Das würde ich nicht machen."}, {"id": 67, "start": 740.0, "end": 754.0, "text": "Jetzt geht es hier aber los im Chat. Ja, der Qt-Mod ist da. Da geht es immer los."}, {"id": 68, "start": 754.0, "end": 764.0, "text": "So, ich muss das erst mal flashen. Ich muss das jetzt erst mal kurz flashen, das Ding auf die SD-Card. Also."}, {"id": 69, "start": 764.0, "end": 776.0, "text": "Was habe ich? Also ich habe hier eine, das müsste doch reichen, ne? Ich habe hier eine 16 GB Samsung SD-Karte. Das sollte doch reichen."}, {"id": 70, "start": 776.0, "end": 784.0, "text": "So, downgeloadet habe ich das Ganze schon. Nämlich hier. Wir müssen das bloß noch mal kurz rüberkopieren."}, {"id": 71, "start": 784.0, "end": 797.0, "text": "Was? Bulk rename? WTF? File Manager aufmachen. Wir müssen das noch mal rüberkopieren. Und zwar habe ich hier eh einen Doppelpunkt. Da ist es Raspbian 1.1.7."}, {"id": 72, "start": 797.0, "end": 808.0, "text": "Ah, ja, ja. Das kopieren wir mal jetzt hier. Auf mein Linux VM, weil die brauchen wir gleich zum Flashen."}, {"id": 73, "start": 808.0, "end": 814.0, "text": "Vielleicht soll ich die Ubuntu-Beta mal löschen, weil die frisst einfach nur sinnlos Speicherplatz. Sorry Leute."}, {"id": 74, "start": 814.0, "end": 824.0, "text": "Ubuntu. Ubuntu, richtig Clocks HD. Wenigstens einer das richtig macht."}, {"id": 75, "start": 824.0, "end": 832.0, "text": "Ich meine, wir haben uns ja sogar die Aussprache von Nelson Mandela höchstpersönlich angehört. Und ihr wart alle dabei."}, {"id": 76, "start": 832.0, "end": 840.0, "text": "Nelson Mandela hat natürlich gesagt, Ubuntu. Ubuntu."}, {"id": 77, "start": 840.0, "end": 850.0, "text": "Ne, aber genug gibated. Natürlich hat er das nicht gesagt, sondern er hat gesagt Ubuntu."}, {"id": 78, "start": 850.0, "end": 864.0, "text": "Achso, mein SD-Karten-Reader soll ich vielleicht mal reinstecken. Wie rum kommt denn der? So. Ah, excellent. Stream-VM. Ja."}, {"id": 79, "start": 864.0, "end": 874.0, "text": "Ich wusste, dass euch dieses PPE-Mode gefällt, Chat. Das war mir klar. Ich hatte die Auswahl, mache ich Salami rein oder Hyper-Gachi?"}, {"id": 80, "start": 874.0, "end": 891.0, "text": "Ich wusste, Salami ist für den Chat das bessere E-Mode."}, {"id": 81, "start": 891.0, "end": 901.0, "text": "Geht aber nicht. Klar geht das. Ich sehe das E-Mode. Das geht. Siehst du? Ach guck mal, in meinem Chat geht das nicht."}, {"id": 82, "start": 901.0, "end": 913.0, "text": "Kann das sein, dass die Custom-E-Modes kaputt sind? Kann das sein, dass die Custom-E-Modes im Chat kaputt sind?"}, {"id": 83, "start": 913.0, "end": 931.0, "text": "Wir probieren jetzt mal einen FFZ-E-Mode aus und einen Better-Twitch-TV-E-Mode aus. Wartet mal. Mal gucken, ob das funktioniert. Aha. Also es funktionieren nur FFZ-E-Modes gerade."}, {"id": 84, "start": 931.0, "end": 945.0, "text": "Warum funktionieren nur FFZ-E-Modes in meinem... komisch. Sehr, sehr komisch. Ich glaube der Steam-Labs-Chat-Bot-Einblendungs-Ding ist gerade kaputt."}, {"id": 85, "start": 945.0, "end": 955.0, "text": "Ja im Chat gehen beide, aber in meiner Chat-Einblendung nicht. Sehr merkwürdig."}, {"id": 86, "start": 955.0, "end": 970.0, "text": "Äh im Moment, wo habe ich den Kram jetzt überhaupt hinkopiert? Ah. Machen wir mal nach Downloads. Bam. Excellent. Jetzt flashen wir den Kram nochmal."}, {"id": 87, "start": 970.0, "end": 982.0, "text": "Ups, gehe aus. Ich bin irgendwie ziemlich kaputt heute. Ich weiß auch nicht genau warum. Warum gehen die E-Modes in der Chat vor? Schau nicht."}, {"id": 88, "start": 982.0, "end": 999.0, "text": "So, wo haben wir es denn hier? Wo ist es denn? Raspian? Hä? Kann das das nicht? Kann das sein, dass das kein 7-Zip kann? Kann das kein 7-Zip?"}, {"id": 89, "start": 999.0, "end": 1014.0, "text": "Ich glaube das kann kein 7-Zip. Äh wie anzippt man 7-Zip und... wir machen uns das Leben einfach. What the hell. Wir nehmen einfach den X-Archive und entpacken das."}, {"id": 90, "start": 1014.0, "end": 1033.0, "text": "Aber entpacken? Ah da ist ein Image drin. Ok, ein Image entpacken ist ok. Das funktioniert. Extract tut... ne nicht zu Temp. Wir wollen sich ja Temp extrahieren, sondern eigentlich wollen wir es nach Downloads extrahieren."}, {"id": 91, "start": 1033.0, "end": 1047.0, "text": "Da. Home, Downloads. Da wollen wir es hin extrahieren. Extract. Sehr gut. Ich hoffe wir haben danach noch genug Platz. Oh, 8 Gigabyte?"}, {"id": 92, "start": 1047.0, "end": 1064.0, "text": "Nein. Das ist keine gute Idee, Max. Das ist keine gute Idee. Wir haben keinen Platz, Leute. Wir haben keinen Platz. Dann machen wir es jetzt. Komm, wir machen es in der neuen VM."}, {"id": 93, "start": 1064.0, "end": 1084.0, "text": "Wir machen es. Warum mache ich überhaupt noch so viel in der alten VM? Wir machen das in der neuen VM. Wir machen das in der neuen VM. Da habe ich zwar schon eine Weihlingsmaterie gemacht, aber das passt. Wir machen es in der neuen VM. Da haben wir mehr als genug Platz."}, {"id": 94, "start": 1084.0, "end": 1108.0, "text": "Warum spendet mein Bot die ganze Zeit meine Hardware? Das macht er doch sonst nicht. Achso. Weil die Leute die Commandos verwenden. Ich bin mir gar nicht sicher ob das überhaupt aktuell ist. Was da in dem Hardware-Commando drin steht. Keine Ahnung ob das überhaupt aktuell ist."}, {"id": 95, "start": 1108.0, "end": 1118.0, "text": "Etcher. Haben wir nicht mal installiert. Etcher. Kommen wir jetzt. Etcher. Install. Yes. Excellent. Oh. Oh wir haben. Okay wir müssen erstmal noch ein Update machen."}, {"id": 96, "start": 1118.0, "end": 1140.0, "text": "Sitze mal. Huge massive Vorbereitung wieder Leute. Internet connection. What the fuck. Was ist hier gerade los? Ping. 1 1 1. Geht doch. Pacman. Pacman. Alles updaten."}, {"id": 97, "start": 1140.0, "end": 1150.0, "text": "Jetzt geht noch nicht mal meine. What the hell. Warum ist meine VM gerade so kaputt."}, {"id": 98, "start": 1150.0, "end": 1178.0, "text": "Wodafone. Oh ruckelts wieder. Nee hoffentlich nicht. Ach ich weiß ich habe hier meine Dot-Files noch gar nicht aktualisiert. Sollte ich vielleicht mal machen. Sollte ich vielleicht mal machen. Weil ich habe hier nämlich auf GitHub Wobblorz Dot-Files. Ich habe den ganzen Kram mittlerweile abgeloadet. Und ich könnte die ganz einfach wieder auschecken jetzt."}, {"id": 99, "start": 1178.0, "end": 1193.0, "text": "Aber wir machen jetzt nicht so ein langes Ding. Also nicht so lang. Wir flashen jetzt die SD-Card und gut ist. Dann wollen wir uns das nämlich mal ausprobieren. Connect. Yes. Sehr gut."}, {"id": 100, "start": 1193.0, "end": 1200.0, "text": "Was hast du für ein CPU in 8700K ein bisschen übertaktet?"}, {"id": 101, "start": 1200.0, "end": 1218.0, "text": "Das ist eine gute Sache. Was hast du gerade vor? Wir probieren das hier aus. Auf Raspberry Pi probieren wir das hier aus. Einfach just for fun. Einfach sinnloserweise probieren wir die Raspbian XP Edition aus. Ich habe keinerlei Anwendungszweck für."}, {"id": 102, "start": 1218.0, "end": 1234.0, "text": "Das sage ich gleich. Bisschen übertaktet auf 6 Gigahertz. Nee 4,5 Gigahertz habe ich glaube ich übertaktet. Base Takt mit All Core Enhancement war glaube ich 4,7 beim 8700K."}, {"id": 103, "start": 1234.0, "end": 1251.0, "text": "8700K. Kommen wir gerade mal gucken. 4,7 genau All Core Turbo 4,7. Ich habe auf 5 Gigahertz übertaktet also nicht viel. Aber geht."}, {"id": 104, "start": 1251.0, "end": 1266.0, "text": "Ich meine wenn ich schon so einen fetten Lüfter drauf habe warum soll ich denn nicht auch fette, fette ne Zeug nehmen? Ich muss den Kram nochmal rüber kopieren."}, {"id": 105, "start": 1266.0, "end": 1283.0, "text": "What? What the fuck? Warum ist mein Copy Paste? Warum ist meine VM so im Arsch heute? Was ist denn da los? Was ist denn da los? MonkaS wird noch eine Herausforderung das zu kopieren."}, {"id": 106, "start": 1283.0, "end": 1297.0, "text": "Doch VMer Tools habe ich installiert sonst würde ja die Auflösung nicht funktionieren. Warum geht das Tracking? Ah ich weiß warum das Tracking Drop nicht geht. Wahrscheinlich weil ich das nicht aktiviert habe. Das muss man doch in Settings irgendwo aktivieren."}, {"id": 107, "start": 1297.0, "end": 1312.0, "text": "Erstmal ausmachen. Ich glaube das muss man in Settings doch irgendwie aktivieren. Oder muss man das nicht irgendwo Tracking Drop? Shared Folder? Nee Shared Folder war was anderes."}, {"id": 108, "start": 1312.0, "end": 1319.0, "text": "Scheint Big Brainiger als ich das Ganze gedacht habe."}, {"id": 109, "start": 1319.0, "end": 1345.0, "text": "Vmware Enable, Tracking Drop, Linux. Muss man da irgendwas spezielles machen. Ah hier Options, Select Guest Isolation. Options, Guest Enable, Tracking Drop, Copy und Paste. Ok sollte eigentlich funktionieren."}, {"id": 110, "start": 1345.0, "end": 1361.0, "text": "Na schauen wir mal. Da haben wir erstmal ein Curdle Update gemacht. Kann ja nichts schaden. Öffne mal den Download Ordner und zieh es da rein. Das macht überhaupt keinen Unterschied."}, {"id": 111, "start": 1361.0, "end": 1382.0, "text": "Wir probieren das jetzt mal aus. Das Hintergrundbeladen ist auch kaputt. Was ist denn mit meiner VM los? What the fuck? Ich habe keinen Schimmer was da kaputt ist. Excellent. Boah warum geht das nicht? Warum ist Tracking Drop kaputt?"}, {"id": 112, "start": 1382.0, "end": 1401.0, "text": "Was ist denn nur mit Kasten los? Ok da müssen wir erstmal gucken. Da ist es komplizierter als ich gedacht habe. Arch, Tracking Drop, Vmware. Warum geht das nicht? Warum ist das Broken? Tracking Drop, Copy und Paste. Ok."}, {"id": 113, "start": 1401.0, "end": 1420.0, "text": "Also. Also was muss man machen? Tracking Drop, Feature, Open VM Tools und GTKMM3. Haben wir das installiert? Ich glaube schon. Ich glaube schon."}, {"id": 114, "start": 1420.0, "end": 1440.0, "text": "Haben wir installiert. Ok. Make the command. Run. Ah vielleicht macht er das nicht automatisch. Vmware, User."}, {"id": 115, "start": 1440.0, "end": 1464.0, "text": "Excellent. Oh ne ne da will ich nicht hinkopieren. Ah. Ok. Dann machen wir das mal. Archwiki Leute ich sag es euch. Archwiki ist das beste. Meine Güte warum? Was ist, was zum Teufel ist mit meinem Keybindings los?"}, {"id": 116, "start": 1464.0, "end": 1478.0, "text": "Sehr gut. Gut dass es funktioniert. Perfekt. Dann machen wir das hier irgendwo. Vmware, User. Ich führe es doch aus. Ich führe es doch aus. Ok. Wie auch immer halten wir uns mal nicht so lang drauf."}, {"id": 117, "start": 1478.0, "end": 1490.0, "text": "Aber dran auf. Wir kopieren den Kram jetzt hier mal rein. Zack. Zack. Mehr müssen wir ja nicht machen. Den Rest können wir dann. Warum die VM rumspackt ist jetzt heute nicht unser Problem."}, {"id": 118, "start": 1490.0, "end": 1507.0, "text": "Was machst du gerade? Ich flasche Raspbian XP auf eine SD Karte und dann gucken wir mal. Wie Mikro HDMI."}, {"id": 119, "start": 1507.0, "end": 1519.0, "text": "Will mich das heute alles verarschen oder was? Ok. Das kriegen wir schon gebacken. Sonst mache ich Shared Folder. Shared Folder geht immer."}, {"id": 120, "start": 1519.0, "end": 1540.0, "text": "Ok. Wie meine Keybindings nicht funktionieren. Auch geil. Jetzt muss ich hier wie der letzte Kack nur mit den File Tasten rum navigieren."}, {"id": 121, "start": 1540.0, "end": 1556.0, "text": "Ah das funktioniert jetzt oder wie? Das funktioniert jetzt anscheinend. Na gut. Wunderbar. Kann ich auch mitleben? Move. Raspbian in Download und C in Download."}, {"id": 122, "start": 1556.0, "end": 1573.0, "text": "Wie unpackt man eigentlich ein 7zip unter Linux? Unpack. Gibt es da sowas wie 7unpack oder so? Wie unpackt man ein 7zip?"}, {"id": 123, "start": 1573.0, "end": 1587.0, "text": "Es ist kein Ta. Das ist was anderes. Ne ne. Denn Ta geht nicht. Wenn ich sage Ta dann wird der... Moment. Target Z wäre das hier. Das funktioniert nicht weil es kein Ta ist und auch wenn es kein Gzip ist."}, {"id": 124, "start": 1587.0, "end": 1604.0, "text": "Das ist was anderes. How do I compress? 7zip File. Also was müssen wir installieren? 77zx falls wir das schon installiert haben. Raspbian ok. 7zip installieren wir da. Wunderbar."}, {"id": 125, "start": 1604.0, "end": 1618.0, "text": "7zip jawoll. So sehr schön. TobiX das ist die neu aufgesetzte VM. Die sieht man ja auch. Die ist viel weniger drauf und auf der Alten viel mehr Platz."}, {"id": 126, "start": 1618.0, "end": 1632.0, "text": "Ich hab bloß meine Config Files noch nicht gepult die ich mittlerweile aktualisiert hab. Offstream. Sollte ich mal machen. Dann sind auch die ganzen Keybindings da und das Rumgespacke weg."}, {"id": 127, "start": 1632.0, "end": 1648.0, "text": "Installier P7 und A-Tool und danach immer A-unpack. Was ist denn A-Tool? Ist das so ein Archive Tool was unter der Haube alle möglichen Formate erkennt und den richtigen Unpacker nimmt?"}, {"id": 128, "start": 1648.0, "end": 1663.0, "text": "Wie viel Speicher hast du insgesamt? Also ich hab 2TB SSD, 500GB SSD und 6TB HDD in dem Rechner. Warum hat er seine VM nur aufgesetzt?"}, {"id": 129, "start": 1663.0, "end": 1678.0, "text": "Weil ich im Stream zeigen wollte wie man dann Manjaro Linux installiert mit so Basic Sachen drauf. Und weil meine VM ziemlich vermüllt ist mittlerweile mit zig Sachen und ich wollte auch mal ein paar neue Sachen ausprobieren."}, {"id": 130, "start": 1678.0, "end": 1702.0, "text": "Was und dein Server? Also die alte 4HE NAS Kiste bzw. mein Multifunktions Server für alles, die 4HE Kiste, die hat 3x 10TB Platte und irgendwelche Intel Server SSDs die ich bei uns auf der Arbeit gekriegt hab als wir das RZ ausgeräumt haben."}, {"id": 131, "start": 1702.0, "end": 1722.0, "text": "Den verwende ich aber nicht mehr. Ich verwende jetzt hier diese kleine 2HE Kiste oder 1,5HE sind sie eigentlich nur wenn man genau ist. Und die hat nur eine SSD, eine 500G SSD drin und eine 12TB Platte drin. Fertig. Ohne Backup Platte gibt es dann demnächst noch. Reicht."}, {"id": 132, "start": 1722.0, "end": 1736.0, "text": "Scheiß auf ZFS, Scheiß auf RAID. Ist alles absolut Overkill für mich daheim. Brauchen wir nicht. Genormen auf 1,5HE. Ja das ist das schlechteste, billigste REC Gehäuse was es gegeben hat. Also 19 Zoll Gehäuse."}, {"id": 133, "start": 1736.0, "end": 1752.0, "text": "So jetzt, jetzt können wir endlich, jetzt können wir den Kram endlich flashen. Äh hier Image. Etcher. Etcher starten. Etcher. Hab ich nicht Etcher gerade schon installiert? Etcher. Nee hab ich nicht installiert."}, {"id": 134, "start": 1752.0, "end": 1766.0, "text": "Nicht 10x10TB im RAID. Nee es waren 3x10TB im RAID 5. Wobei das bei ZFS nicht RAID 5 heißt. Sondern ich glaube bei ZFS, nicht echt. Vielleicht ZRAID 1."}, {"id": 135, "start": 1766.0, "end": 1783.0, "text": "Warum ist das? Genau RAID Z1 ist es. Bei ZFS. Ist aber ähnlich zu einem RAID 5. Während der hier flasht und entpackt können wir noch ein paar Fragen beantworten."}, {"id": 136, "start": 1783.0, "end": 1798.0, "text": "Oh nee ich hab meine Stream vor allem ausgemacht. Es geht ja nicht. Jetzt ist ja mein. Fuck. Jetzt hab ich die Fragen ja alle gar nicht mehr mitgekriegt. Mal kurz durchscrollen. Wird es nochmal eine Memetool Version auf GitHub geben? Das weiß ich noch nicht."}, {"id": 137, "start": 1798.0, "end": 1823.0, "text": "Äh. Ich glaube ich hab nichts verpasst. Aber die müssen wir laufen lassen, dass das Pepega Board weiter funktioniert. Oh ohne Pepega Board übersehe ich ja die Hälfte."}, {"id": 138, "start": 1823.0, "end": 1844.0, "text": "So. Während der Kram hier jetzt auf die SD-Karte SD kartet. Ach ist er fertig? Hat er jetzt entpackt? Okay. Etcher. Etchor. Gucken ob ich hier darf. Select Image. Downloads. Respion Image. Select Target. Okay geht nicht."}, {"id": 139, "start": 1844.0, "end": 1860.0, "text": "Dann muss ich das mit Sudo starten. Weil das ist die SD-Karte. Alter warum erkennst du die SD-Karte? Achso da hat die SD-Karte wieder unmounted. Auch. Exzellent. So. Jetzt aber."}, {"id": 140, "start": 1860.0, "end": 1877.0, "text": "Ah. Sehr schön. Respion Image. SD-Karte. 16G. Flash. Und das geht nicht, weil ich nicht root bin. Na auch toll. Ich überleg gerade. Was für eine Gruppe muss ich mich packen, dass ich das machen darf ohne Sudo?"}, {"id": 141, "start": 1877.0, "end": 1891.0, "text": "Weiß ich jetzt gerade nicht. So. Gut. Während der Flash. Das dauert jetzt 2-3 Minuten. Nein das dauert keine 25 Minuten. Das ist G-Bait. Gucken wir uns das andere mal an."}, {"id": 142, "start": 1891.0, "end": 1911.0, "text": "Oh das ist doch nicht G-Bait. Das ist G-Bait. Was zum... Willst du mich verarschen? Was ist denn das für eine Zeitrechnung? Ja aber 13 Minuten ist auch viel zu lang."}, {"id": 143, "start": 1911.0, "end": 1926.0, "text": "Der will ja sich wirklich 13 Minuten flashen oder? 13 Minuten? Ja wir sehen uns morgen. Also gucken wir uns mal die Fragen an, die ich übersehen habe."}, {"id": 144, "start": 1926.0, "end": 1941.0, "text": "Hast du gerade gesagt, welche Oberfläche du bei der VMS hättest? Ja. Das ist i3-WM. Firefox Browser. Genau im Terminal. Und ein bisschen anderes Zeug. Aber das ist i3."}, {"id": 145, "start": 1941.0, "end": 1951.0, "text": "So. Was habe ich denn für Fragen übersehen? Jede Menge, wie es aussieht. Das ist ja nicht nur von heute, sondern auch vom Stream gestern und davor. SD-Karten sind langsam. Ja ich habe auch leider nicht die schnellste reingemacht."}, {"id": 146, "start": 1951.0, "end": 1967.0, "text": "Ich habe hier ein paar richtig gute SD-Karten. Ach ja, geht eigentlich... Wo wir gerade dabei sind. Kann man eigentlich mittlerweile den Raspberry Pi 4 von USB booten? So richtig offiziell ohne Hex mit SD-Karte."}, {"id": 147, "start": 1967.0, "end": 1989.0, "text": "Die Hex mit SD-Karte kenne ich. Vertratet.info. Macht doch mal einen eigenen WM mit Moelander. Garantiert nicht. Moelander."}, {"id": 148, "start": 1989.0, "end": 2001.0, "text": "Der macht das auch mit einer SD-Karte. Der macht das auch mit einer SD-Karte. Kann man den Pi mittlerweile vielleicht so richtig echt von USB booten?"}, {"id": 149, "start": 2001.0, "end": 2023.0, "text": "Denn letzte Stunde ist vielleicht ein bisschen optimistisch. Letzte Woche. Ah, letzte Woche von 2017. Exzellent. Ja das Video vom Andreas Spieß kenne ich, aber der macht es auch mit einer SD-Karte."}, {"id": 150, "start": 2023.0, "end": 2032.0, "text": "Anscheinend geht das noch nicht. Anscheinend geht das nicht. Ich frage mich, wie die das geschafft haben. Der Raspberry Pi 3 kann das auch."}, {"id": 151, "start": 2032.0, "end": 2046.0, "text": "Verstehe ich gar nicht. Wie sie das hingekriegt haben, dass der das nicht kann. Naja. So, also gucken wir uns mal ein paar Fragen an."}, {"id": 152, "start": 2046.0, "end": 2060.0, "text": "Was haben wir denn hier? Alles schönes. Während der Kram hier vor sich hin flasht. Naja, haben wir ein bisschen Zeit. Nee. Hab ich gesagt, haben wir, haben wir, haben wir."}, {"id": 153, "start": 2060.0, "end": 2082.0, "text": "Du hast mal was über WireGuard gemacht, finde es aber im Archiv nicht. Google ist dein Freund. Oder auch nicht. Vielleicht habe ich das auch nicht WireGuard genannt."}, {"id": 154, "start": 2082.0, "end": 2096.0, "text": "Kann man, kann man auf Twitch Clips durchsuchen? Geht das? Kann man Clips nach Titel durchsuchen? Clips. Nee, Clips Suche geht natürlich nicht."}, {"id": 155, "start": 2096.0, "end": 2123.0, "text": "Das wäre zu einfach. Da hätte man nämlich schön suchen können und dann anhand des Datums, was das für ein Stream gewesen ist. Nee, dann weiß ich auch nicht, welcher Stream das war."}, {"id": 156, "start": 2123.0, "end": 2133.0, "text": "Hm. Keine Ahnung. Das war was mit VPN. Das war ein YouTube Video, ja. Aber da habe ich nicht gezeigt, wie man WireGuard einrichtet,"}, {"id": 157, "start": 2133.0, "end": 2142.0, "text": "sondern da habe ich mich generell über die ganzen VPN-Anbieter aufgeregt, dass das zum größten Teil ziemlicher Sack ist. Dann weiß ich nicht, welcher Stream das war."}, {"id": 158, "start": 2142.0, "end": 2156.0, "text": "Moin, David Schar. Dark Mode. Wir haben noch einen Dark Mode. Wir haben noch einen Dark Reader. Kann man doch hier mit aufmachen."}, {"id": 159, "start": 2156.0, "end": 2170.0, "text": "Bäm. On. Exzellent. Jetzt haben wir aber keine Emotes. Okay. Was ist wichtiger? Emotes oder Dark Mode?"}, {"id": 160, "start": 2170.0, "end": 2179.0, "text": "Wir können aber einfach Dark Reader in der VM installieren und gut ist, aber das ist Firefox, oder? Das ist Firefox."}, {"id": 161, "start": 2179.0, "end": 2189.0, "text": "Dann machen wir das noch viel big brainiger. Wir machen Chrome auf und machen nur im Chrome das Pepega Board auf, aber dann haben wir dann wiederum keine Twitch Emotes."}, {"id": 162, "start": 2189.0, "end": 2208.0, "text": "Doch. So machen wir das. Pepega Board machen wir nur im Chrome auf. Da haben wir Twitch Emotes und dann installieren wir da auch den Dark Reader und das ist dann wirklich jetzt absolut next level."}, {"id": 163, "start": 2208.0, "end": 2217.0, "text": "So gut, oder? So ist doch perfekt. Twitch Emotes und Dark Reader. Also, WireGuard weiß ich aus dem Kopf nicht, welches Video das ist."}, {"id": 164, "start": 2217.0, "end": 2223.0, "text": "Der Host hat mir beantwortet. Das ist die Baron-Url-Weiterleitung eingerichtet. Das ist sehr nice."}, {"id": 165, "start": 2223.0, "end": 2250.0, "text": "Wie bist du eigentlich zur IT gekommen? Wie bist du eigentlich zur IT gekommen? Hast du in deiner Jugend schon was damit gemacht? Ja, was genau? Ich habe so viel gemacht in meiner Jugend, das kann ich dir gar nicht alles erzählen."}, {"id": 166, "start": 2250.0, "end": 2255.0, "text": "Ich habe natürlich angefangen mit irgendwelchen Sachen, die ich für Bekannte eingerichtet habe."}, {"id": 167, "start": 2255.0, "end": 2265.0, "text": "Also, ich glaube, das erste Mal, wo ich Kontakt mit so Elektronik und Konsolen hatte, war glaube ich mein Gameboy."}, {"id": 168, "start": 2265.0, "end": 2271.0, "text": "Aber da habe ich natürlich nicht dran rumgebastelt. Danach einen Super Nintendo. Da habe ich natürlich auch nicht dran rumgebastelt."}, {"id": 169, "start": 2271.0, "end": 2283.0, "text": "Das war dann ungefähr zeitgleich. Hatte mein Vater damals einen, ich glaube, das war sogar noch ein 4680er. Da habe ich ein bisschen rumgespielt mit Windows 3.0 oder was das war."}, {"id": 170, "start": 2283.0, "end": 2289.0, "text": "Aber da habe ich auch nicht so großartig Ahnung gehabt. Da habe ich halt einfach rumgeklickt und sinnloses Zeug gemacht."}, {"id": 171, "start": 2289.0, "end": 2296.0, "text": "Damals gab es noch BTX bei der Telekom, falls das noch jemand kennt. BTX."}, {"id": 172, "start": 2296.0, "end": 2302.0, "text": "Bildschirmtext. Das war wieder so eine deutsche Geschichte, wo sich gedacht haben, das möchte die Welt haben."}, {"id": 173, "start": 2302.0, "end": 2310.0, "text": "Im Endeffekt hat die Welt gesagt, nee, braucht kein Mensch. Aber das war BTX. Nee, das war BTX. So genau so sah das aus. BTX."}, {"id": 174, "start": 2310.0, "end": 2320.0, "text": "Sah ähnlich aus wie Videotext, nur dass es über Internet quasi ging. Also nicht wirklich übers Internet, nach raus öffentliches Netzwerk."}, {"id": 175, "start": 2320.0, "end": 2327.0, "text": "Sah ein bisschen aus wie Videotext, ein bisschen höher aufgelöst wie Videotext."}, {"id": 176, "start": 2327.0, "end": 2332.0, "text": "Ja, und das war so die Zeit, wo ich auch angefangen habe, dann an Technik Sachen rumzubasteln."}, {"id": 177, "start": 2332.0, "end": 2338.0, "text": "Der Computer wurde dann aufgeschraubt, da wurde mal ein neues CD-Laufwerk eingebaut. So die kleinen Sachen, mit denen man so anfängt."}, {"id": 178, "start": 2338.0, "end": 2348.0, "text": "Ich meine, es fängt ja keiner damit an, Microcontroller zu programmieren."}, {"id": 179, "start": 2348.0, "end": 2355.0, "text": "Na, das ging dann weiter mit den üblichen Sachen, wie Windows für irgendwelche Bekannte installiert."}, {"id": 180, "start": 2355.0, "end": 2359.0, "text": "Drucker und das, was man so macht, wenn man klein ist und sich ein bisschen auskennt."}, {"id": 181, "start": 2359.0, "end": 2369.0, "text": "Und ich fand's damals schon erschreckend, aber das war mir nicht ganz klar, wie wenig Plan eigentlich alle hatten."}, {"id": 182, "start": 2369.0, "end": 2384.0, "text": "Weil, ich meine, überlegt euch mal, wenn man einen 7-Jährigen oder so fragen muss, wie man seinen Drucker unter Windows 3.11 installiert, ist schon der Wahnsinn."}, {"id": 183, "start": 2384.0, "end": 2390.0, "text": "Wenn man das nicht selbst allein auf die Reihe kriegt."}, {"id": 184, "start": 2390.0, "end": 2398.0, "text": "Ja, das sind so die Sachen, womit ich angefangen habe. Ich meine, so richtig angefangen habe ich mich dann dafür zu interessieren, wo ich ein bisschen älter war."}, {"id": 185, "start": 2398.0, "end": 2402.0, "text": "Dann hab ich irgendwann auch angefangen, ein bisschen zu programmieren."}, {"id": 186, "start": 2402.0, "end": 2405.0, "text": "Und noch eine Ecke später hab ich angefangen, mich mit Linux zu beschäftigen."}, {"id": 187, "start": 2405.0, "end": 2412.0, "text": "Das muss schon später gewesen sein, weil die ersten Linux-Distributionen gab's ja dann so 2000 drum vielleicht erstmal."}, {"id": 188, "start": 2412.0, "end": 2422.0, "text": "Also das erste, was ich programmiert hab, war damals, hab ich das noch mit C probiert, ganz, ganz eklig."}, {"id": 189, "start": 2422.0, "end": 2432.0, "text": "Das erste, was ich versucht hab zu programmieren, war ein, ich nenn's mal so eine Art Cheat für einen MMO, was ich damals gespielt hab."}, {"id": 190, "start": 2432.0, "end": 2435.0, "text": "Aber es war kein Cheat, also ich muss jetzt mal kurz erklären."}, {"id": 191, "start": 2435.0, "end": 2442.0, "text": "Ich hab da nicht versucht wirklich zu bescheißen im eigentlichen Sinne, nur indirekt, nur indirekt zu bescheißen, aber so, dass es keinem geschadet hat."}, {"id": 192, "start": 2442.0, "end": 2449.0, "text": "Und zwar, ich hab damals Dark Age of Camelot gespielt, das war ein MMO von, da kenn ich auch den Friseur her."}, {"id": 193, "start": 2449.0, "end": 2456.0, "text": "Das ist ein uraltes MMO und sieht halt auch dementsprechend, dementsprechend aus, wie halt alte MMOs aussehen."}, {"id": 194, "start": 2456.0, "end": 2464.0, "text": "Und die haben sich damals gedacht, dass es eine gute Idee wär, wenn man den Spiele klein nicht beenden könnte."}, {"id": 195, "start": 2464.0, "end": 2472.0, "text": "Weil, wenn man sobald man den Spiele klein minimiert hat, ist das Spiel abgekackt, weil sie wollten dadurch Cheats verhindern."}, {"id": 196, "start": 2472.0, "end": 2482.0, "text": "Dein Drucker geht nicht mehr ohne, ich glaube, ich hab seit 10 Jahren oder so, ohne Mist, oder 5 Jahren, keinen Drucker mehr aus der Linux installiert, kein Schimmer."}, {"id": 197, "start": 2482.0, "end": 2488.0, "text": "Ja, und was ich da machen wollte, ist, weil man das Game nicht in den Hintergrund packen konnte."}, {"id": 198, "start": 2488.0, "end": 2494.0, "text": "Also, das muss, gucken wir mal, wann das Release Date hat, das war ziemlich zu Release."}, {"id": 199, "start": 2494.0, "end": 2498.0, "text": "Ja, so 2001 rum, 2001 rum, 2002 rum, muss das gewesen sein."}, {"id": 200, "start": 2498.0, "end": 2508.0, "text": "Da wollte ich quasi ein Programm basteln, was den Chat-Log von dem Spiel ausliest."}, {"id": 201, "start": 2508.0, "end": 2512.0, "text": "Das war nämlich das einzige, wo man quasi mit der restlichen Welt interagieren konnte."}, {"id": 202, "start": 2512.0, "end": 2516.0, "text": "Und da hab ich ein Programm gebastelt, oder versucht zu basteln, was den Chat-Log ausliest."}, {"id": 203, "start": 2516.0, "end": 2525.0, "text": "Und dann hab ich einen einfach im Chat Sachen eingetippt, wie zum Beispiel Musik-Playlist starten und sowas."}, {"id": 204, "start": 2525.0, "end": 2532.0, "text": "Und dann hat der das im Hintergrund gemacht, ohne dass ich das Spiel minimieren musste, weil wenn ich das Spiel minimiert hab, hat sich das Spiel ja beendet."}, {"id": 205, "start": 2532.0, "end": 2538.0, "text": "So, das war das erste, wo ich so richtig mal angefangen hab, mich mit dem Thema Programmieren zu beschäftigen."}, {"id": 206, "start": 2538.0, "end": 2541.0, "text": "So, dann hab ich festgestellt, C-Programmieren ist zum Einstieg voll für'n Arsch."}, {"id": 207, "start": 2541.0, "end": 2546.0, "text": "Und dann hab ich ein bisschen später gesagt, okay, wir probieren das mal in.NET zu machen."}, {"id": 208, "start": 2546.0, "end": 2550.0, "text": "Dann hab ich angefangen,.NET zu lernen."}, {"id": 209, "start": 2550.0, "end": 2553.0, "text": "Seitdem, muss ich sagen, ist C-Sharp immer noch bis heute meine Lieblingssprache."}, {"id": 210, "start": 2553.0, "end": 2555.0, "text": "Hat Dark Age of Clem eine API dafür?"}, {"id": 211, "start": 2555.0, "end": 2560.0, "text": "Nee, das gab eine Textdatei, wo der Chat reingeschrieben wurde, das war alles."}, {"id": 212, "start": 2560.0, "end": 2562.0, "text": "Das war die API."}, {"id": 213, "start": 2562.0, "end": 2564.0, "text": "Das war ja auch keine offizielle API, die wollten das ja nicht."}, {"id": 214, "start": 2564.0, "end": 2566.0, "text": "Oh, wir haben, nee, wir haben nicht fertig geflasht."}, {"id": 215, "start": 2566.0, "end": 2568.0, "text": "Die wollten das ja nicht."}, {"id": 216, "start": 2574.0, "end": 2581.0, "text": "Die wollten ja nicht, dass man außerhalb vom Spiel was macht, weil man das ja nicht, äh, weil man ja dann cheaten kann, wenn man das Spiel minimiert und sowas."}, {"id": 217, "start": 2581.0, "end": 2583.0, "text": "Total bescheuert eigentlich."}, {"id": 218, "start": 2583.0, "end": 2588.0, "text": "Es gab dann später weitere Hacks für das Game, dass man das auch mini-, also Hacks, dass man es halt minimieren konnte."}, {"id": 219, "start": 2588.0, "end": 2590.0, "text": "Und, äh, ohne dass es abgekackt ist."}, {"id": 220, "start": 2590.0, "end": 2595.0, "text": "Und irgendwann haben sie es dann offiziell eingeführt."}, {"id": 221, "start": 2595.0, "end": 2596.0, "text": "Wie bist du an die Chatdaten gekommen?"}, {"id": 222, "start": 2596.0, "end": 2598.0, "text": "Wie gesagt, die standen in der Textdatei."}, {"id": 223, "start": 2598.0, "end": 2600.0, "text": "Man konnte in-game Chatlog einschalten."}, {"id": 224, "start": 2600.0, "end": 2602.0, "text": "Da muss man, glaub ich, F oder L drücken."}, {"id": 225, "start": 2602.0, "end": 2604.0, "text": "Ich glaub, L muss man drücken dafür."}, {"id": 226, "start": 2604.0, "end": 2606.0, "text": "Da hat es den Chatlog eingeschaltet."}, {"id": 227, "start": 2606.0, "end": 2608.0, "text": "Das war eigentlich eine Funktion, die dafür gedacht war,"}, {"id": 228, "start": 2608.0, "end": 2614.0, "text": "dass wenn man beleidigt wird in-game, dass man Chatloggen kann und an den, an den Hersteller schicken kann."}, {"id": 229, "start": 2614.0, "end": 2622.0, "text": "Und ich hab einfach aber so immer Chatlog laufen lassen und hab dann mit meinem Programm im Hintergrund die Textdatei eingelesen, wo der Chatlog reingeschrieben wird."}, {"id": 230, "start": 2622.0, "end": 2626.0, "text": "Also ich hab das, ich, das war da, ein bisschen gehacksort war es damals schon, ja."}, {"id": 231, "start": 2626.0, "end": 2630.0, "text": "Also für mich war das natürlich, äh, richtig big brain, was ich mir da gedacht habe."}, {"id": 232, "start": 2630.0, "end": 2632.0, "text": "Es hat auch, es hat nie richtig funktioniert."}, {"id": 233, "start": 2632.0, "end": 2636.0, "text": "Es hat halbwegs funktioniert, aber nie wirklich, nie wirklich gut."}, {"id": 234, "start": 2636.0, "end": 2640.0, "text": "In C."}, {"id": 235, "start": 2640.0, "end": 2644.0, "text": "Ja, danach hab ich versucht, im.NET zu machen und das hat deutlich besser funktioniert."}, {"id": 236, "start": 2644.0, "end": 2647.0, "text": "Richtig big brain, massive."}, {"id": 237, "start": 2647.0, "end": 2653.0, "text": "Ja, aber nicht, das war 2002."}, {"id": 238, "start": 2653.0, "end": 2657.0, "text": ".NET,.NET 2.0 Release war am..."}, {"id": 239, "start": 2657.0, "end": 2665.0, "text": "War das erst 2006?"}, {"id": 240, "start": 2665.0, "end": 2667.0, "text": "2006."}, {"id": 241, "start": 2667.0, "end": 2670.0, "text": "Ja, cool."}, {"id": 242, "start": 2670.0, "end": 2676.0, "text": "Und dann kam das 1er."}, {"id": 243, "start": 2676.0, "end": 2685.0, "text": "Genau, das, das kommt auch ungefähr hin von der Zeit her."}, {"id": 244, "start": 2685.0, "end": 2689.0, "text": "Also ich muss so in dem Dreh dann angefangen haben mit.NET zu programmieren,"}, {"id": 245, "start": 2689.0, "end": 2695.0, "text": "weil ich weiß noch, dass es nicht lange gedauert hat, bis es dann irgendeine Testversion und sonst was von.NET 2.0 gab."}, {"id": 246, "start": 2695.0, "end": 2701.0, "text": "Ich hab gerade angefangen, wo Neue Special Studio und.NET 2.0 sich am Horizont abgezeichnet haben"}, {"id": 247, "start": 2701.0, "end": 2705.0, "text": "und damals alle ausgeflippt sind, weil es jetzt Generic Support hat."}, {"id": 248, "start": 2705.0, "end": 2707.0, "text": "Da kann ich mich noch dran erinnern."}, {"id": 249, "start": 2707.0, "end": 2710.0, "text": "Was ist an C-Sharp besser als an C++?"}, {"id": 250, "start": 2710.0, "end": 2714.0, "text": "Naja, also besser ist ja eh immer so im Auge des Betrachters."}, {"id": 251, "start": 2714.0, "end": 2716.0, "text": "Es kommt für den Anwendungszweck an."}, {"id": 252, "start": 2716.0, "end": 2720.0, "text": "Es gibt Sachen, die kannst du mit C++ machen, irgendwie den Microcontroller programmieren,"}, {"id": 253, "start": 2720.0, "end": 2723.0, "text": "das geht natürlich mit C-Sharp so ohne Weiteres nicht."}, {"id": 254, "start": 2723.0, "end": 2730.0, "text": "Aber wenn man mal rein von der Sprache, rein von der, von der, von der Sprache an sich ausgeht,"}, {"id": 255, "start": 2730.0, "end": 2732.0, "text": "jetzt mal nicht so sehr vom Anwendungszweck,"}, {"id": 256, "start": 2732.0, "end": 2740.0, "text": "dann ist C-Sharp deutlich logischer in sich aufgebaut als C++."}, {"id": 257, "start": 2740.0, "end": 2744.0, "text": "Und ist auch viel, viel eingängiger von der Syntax her als C++."}, {"id": 258, "start": 2744.0, "end": 2747.0, "text": "Und nicht so widersprüchlich wie C++."}, {"id": 259, "start": 2747.0, "end": 2750.0, "text": "Hat eine bessere Standard-Library als C++."}, {"id": 260, "start": 2754.0, "end": 2761.0, "text": "Hat eigentlich fast alles, was die Sprache an sich angeht, besser als C++."}, {"id": 261, "start": 2761.0, "end": 2766.0, "text": "Durch das.NET-Framework drunter ist es halt nicht unbedingt für allen Anwendungszweck geeignet."}, {"id": 262, "start": 2766.0, "end": 2769.0, "text": "Gibt es Pointer in C-Sharp? Ja, gibt es auch."}, {"id": 263, "start": 2769.0, "end": 2774.0, "text": "Wobei man die meistens nicht braucht."}, {"id": 264, "start": 2774.0, "end": 2776.0, "text": "Boah, wie lange macht der an der kacke SD-Karte rum?"}, {"id": 265, "start": 2776.0, "end": 2785.0, "text": "Meine Fresse, äh, das dauert ja ewig."}, {"id": 266, "start": 2785.0, "end": 2793.0, "text": "Okay, da können wir noch ein bisschen weiter Fragen lesen."}, {"id": 267, "start": 2793.0, "end": 2797.0, "text": "Ähm, gibt's Pointer? Ja, genau, ja, ja, gibt es, gibt es."}, {"id": 268, "start": 2797.0, "end": 2801.0, "text": "Es gibt Pointer in C-Sharp, es gibt Referenzen in C-Sharp, Pointer in C-Sharp,"}, {"id": 269, "start": 2801.0, "end": 2803.0, "text": "unsaved, string manipulation in C-Sharp."}, {"id": 270, "start": 2803.0, "end": 2808.0, "text": "Man kann relativ viel in C-Sharp machen, was man auch unsaved in C++ machen kann."}, {"id": 271, "start": 2808.0, "end": 2813.0, "text": "Aber halt, äh, braucht man das standardmäßig so gut wie nie."}, {"id": 272, "start": 2813.0, "end": 2819.0, "text": "Das braucht man eigentlich fast nur, wenn man interop mit C-Libraries oder anderem Low-Level-Kram macht."}, {"id": 273, "start": 2819.0, "end": 2837.0, "text": "Also zum Beispiel, wenn man FFmpeg verwendet, also wenn man FFmpeg verwendet aus.NET bzw. C-Sharp raus, dann braucht man das."}, {"id": 274, "start": 2837.0, "end": 2841.0, "text": "Guck, der macht hier auch alles unsaved und mit Pointer."}, {"id": 275, "start": 2841.0, "end": 2843.0, "text": "Und das ist C-Sharp."}, {"id": 276, "start": 2843.0, "end": 2849.0, "text": "Ähm, wenn man, wie gesagt, wenn man Low-Level-Sachen macht und vor allem interop mit C, dann braucht man unsaved,"}, {"id": 277, "start": 2849.0, "end": 2853.0, "text": "Pointer und Pointer in C-Sharp, sonst brauchst du das eigentlich fast nie."}, {"id": 278, "start": 2853.0, "end": 2858.0, "text": "Damals hab ich den Druckertreiber auf dem C64 selber geschrieben in Hex."}, {"id": 279, "start": 2858.0, "end": 2866.0, "text": "Ich weiß nicht, ob's, ob's getrollt ist, aber ich glaub's dir mal, weil es gab Leute, die haben sowas gemacht."}, {"id": 280, "start": 2866.0, "end": 2869.0, "text": "Das ist Big Brain."}, {"id": 281, "start": 2869.0, "end": 2873.0, "text": "Kurz auf der Klasse, warum, ach."}, {"id": 282, "start": 2873.0, "end": 2875.0, "text": "So, haben wir das beantwortet."}, {"id": 283, "start": 2875.0, "end": 2878.0, "text": "Mikro-ADMI, okay."}, {"id": 284, "start": 2878.0, "end": 2880.0, "text": "Ja, ich hatte sowas bis jetzt noch nicht."}, {"id": 285, "start": 2880.0, "end": 2896.0, "text": "Es ist heute das erste Mal, dass ich Mikro-ADMI bewusst gesehen hab."}, {"id": 286, "start": 2896.0, "end": 2902.0, "text": "Das ist doch von gestern vom Einkaufs, Einkaufsstream."}, {"id": 287, "start": 2902.0, "end": 2907.0, "text": "Hast du nen Befehl, mit dem ich nen Tree Recursive machen kann in Ubuntu, damit alle da in allen unter..."}, {"id": 288, "start": 2907.0, "end": 2913.0, "text": "Ist Tree nicht schon Recursive?"}, {"id": 289, "start": 2913.0, "end": 2921.0, "text": "Ist doch Recursive."}, {"id": 290, "start": 2921.0, "end": 2932.0, "text": "Hä?"}, {"id": 291, "start": 2932.0, "end": 2935.0, "text": "Ja, also Siebau."}, {"id": 292, "start": 2935.0, "end": 2937.0, "text": "Das ist schon schnell am Tree Recursive."}, {"id": 293, "start": 2937.0, "end": 2945.0, "text": "Musst doch gar nix machen."}, {"id": 294, "start": 2945.0, "end": 2955.0, "text": "Ja."}, {"id": 295, "start": 2955.0, "end": 2957.0, "text": "I outbroke or the Home Assistant?"}, {"id": 296, "start": 2957.0, "end": 2960.0, "text": "Ich hab Home Assistant für meine ganze Heimautomatisierung."}, {"id": 297, "start": 2960.0, "end": 2962.0, "text": "Ja, dann installier das mal."}, {"id": 298, "start": 2962.0, "end": 2966.0, "text": "Also, ich glaub, das ist einer der Vorteile von Tree, dass das standardmäßig Recursive ist."}, {"id": 299, "start": 2966.0, "end": 2978.0, "text": "So, wir sind bei 79% SD-Karten."}, {"id": 300, "start": 2978.0, "end": 2980.0, "text": "Das ist tatsächlich ein Problem."}, {"id": 301, "start": 2980.0, "end": 2985.0, "text": "Ein halbwegs komplexer 3D-Druck, der kann auch ohne Probleme mal vier, fünf Stunden dauern."}, {"id": 302, "start": 2985.0, "end": 2988.0, "text": "Sogar relativ kleine Gehäuse dauern vier, fünf Stunden."}, {"id": 303, "start": 2988.0, "end": 2992.0, "text": "Und falls mal einer... Hat mal einer von euch versucht, ein Raspberry-Gehäuse zu drucken oder so?"}, {"id": 304, "start": 2992.0, "end": 2996.0, "text": "Da druckst du mit Deckel 12, 13 Stunden."}, {"id": 305, "start": 2996.0, "end": 2998.0, "text": "Ist eigentlich komplett lächerlich so."}, {"id": 306, "start": 2998.0, "end": 3004.0, "text": "Aber ist trotzdem ganz nice."}, {"id": 307, "start": 3004.0, "end": 3006.0, "text": "Hast du schon mal mit dem Entity-Framework gearbeitet?"}, {"id": 308, "start": 3006.0, "end": 3008.0, "text": "Also mit dem klassischen Entity-Framework?"}, {"id": 309, "start": 3008.0, "end": 3009.0, "text": "Noch nicht."}, {"id": 310, "start": 3009.0, "end": 3027.0, "text": "Mit Entity-Framework Core relativ oft schon."}, {"id": 311, "start": 3027.0, "end": 3029.0, "text": "Kann der Pi 4 mittlerweile HDCP-Content abspielen?"}, {"id": 312, "start": 3029.0, "end": 3030.0, "text": "Kein Schwimmer."}, {"id": 313, "start": 3030.0, "end": 3031.0, "text": "Probieren wir mal."}, {"id": 314, "start": 3031.0, "end": 3034.0, "text": "Können wir mal ausprobieren, klar."}, {"id": 315, "start": 3034.0, "end": 3035.0, "text": "Du meinst wohl ER5?"}, {"id": 316, "start": 3035.0, "end": 3036.0, "text": "Null."}, {"id": 317, "start": 3036.0, "end": 3037.0, "text": "Noch nicht."}, {"id": 318, "start": 3037.0, "end": 3038.0, "text": "Noch nicht."}, {"id": 319, "start": 3038.0, "end": 3043.0, "text": "Noch nicht bei ER5."}, {"id": 320, "start": 3043.0, "end": 3046.0, "text": "Was willst du denn wissen Entity-Framework-mäßig?"}, {"id": 321, "start": 3046.0, "end": 3051.0, "text": "Schrieße los."}, {"id": 322, "start": 3051.0, "end": 3053.0, "text": "Gleich ist es fertig."}, {"id": 323, "start": 3053.0, "end": 3058.0, "text": "Das ist Animal Crossing Musik."}, {"id": 324, "start": 3058.0, "end": 3059.0, "text": "Oder?"}, {"id": 325, "start": 3059.0, "end": 3060.0, "text": "Ach nee."}, {"id": 326, "start": 3060.0, "end": 3079.0, "text": "Evangelion can do it, nicht Animal Crossing."}, {"id": 327, "start": 3079.0, "end": 3081.0, "text": "Woah wir haben es geschafft Leute."}, {"id": 328, "start": 3081.0, "end": 3082.0, "text": "Pockets."}, {"id": 329, "start": 3082.0, "end": 3083.0, "text": "So."}, {"id": 330, "start": 3083.0, "end": 3086.0, "text": "Sehr schön."}, {"id": 331, "start": 3086.0, "end": 3088.0, "text": "Sync."}, {"id": 332, "start": 3088.0, "end": 3092.0, "text": "Und jetzt stöpseln wir das mal in unseren Raspberry Pi rein."}, {"id": 333, "start": 3092.0, "end": 3095.0, "text": "Mal gucken was passiert."}, {"id": 334, "start": 3095.0, "end": 3099.0, "text": "Ich hab mir keinen Guide oder sonst was dazu angeguckt."}, {"id": 335, "start": 3099.0, "end": 3105.0, "text": "Ich hab das jetzt einfach mal reingesteckt und gehofft, dass es funktioniert."}, {"id": 336, "start": 3105.0, "end": 3108.0, "text": "Und das machen wir jetzt mal also."}, {"id": 337, "start": 3108.0, "end": 3111.0, "text": "SD-Karte raus."}, {"id": 338, "start": 3111.0, "end": 3113.0, "text": "Oh fuck."}, {"id": 339, "start": 3113.0, "end": 3114.0, "text": "Nein."}, {"id": 340, "start": 3114.0, "end": 3116.0, "text": "Die SD-Karte ist runtergefallen."}, {"id": 341, "start": 3116.0, "end": 3118.0, "text": "Eine schwarze SD-Karte auf meinem schwarzen Teppich."}, {"id": 342, "start": 3118.0, "end": 3119.0, "text": "Wo ist..."}, {"id": 343, "start": 3119.0, "end": 3120.0, "text": "Ah da ist sie."}, {"id": 344, "start": 3120.0, "end": 3121.0, "text": "Onkel S."}, {"id": 345, "start": 3121.0, "end": 3122.0, "text": "Das wärs jetzt."}, {"id": 346, "start": 3122.0, "end": 3147.0, "text": "Hätte ich die SD-Karte runtergeschmissen und hab sie aber gefunden."}]}