{"text": "Oh oh was ist hier los?Was ist hier los?Jetzt geht was?Jetzt geht was?Geht jetzt was?Nee, ich weiß, dass es laggt.Geht jetzt was?Ich hoffe, dass jetzt was funktioniert.Ich kann meinen eigenen Stream nicht mehr refreshen in der Vorschau.Es geht.Leute, soll ich euch was geiles zeigen?Ich zeige euch mal, welcher Twitch-Server funktioniert.Passt mal auf, welcher Twitch-Server funktioniert hat.Ich habe jetzt einige Twitch-Server durchprobiert und bei den meisten war es bloß 0-90kb durchgegangensind.Und ihr seht schon, es ist trotzdem nicht ganz am Anschlag hier.Es ist wirklich echt, es ist wie in Uganda, ohne Scheiß.Wie die Datei heißt, drifts Vodafone ihr scheiß Ficker.Das passt genau.So, ich zeige euch mal, welchen Twitch-Server ich jetzt gerade verwende.Südkorea.Ich muss allen Ernstes den südkoreanischen Twitch-Server verwenden, dass der Scheißmit Vodafone funktioniert.Wie viel Delay habt ihr zu mir?Wie viel Delay habt ihr zum Streamer?3,5 Sekunden.Ja, es geht doch.Ich meine Lichtgeschwindigkeit ist Lichtgeschwindigkeit.Die ist auch nach Südkorea noch relativ zügig.Aber das ist doch absolut lächerlicher Scheiß.So ein Kackladen.Swiftrage.Wieder da, da kann man nicht so richtig sagen.Ich meine, ich kann gerade mal, ich guck mal, guck dir schon mal meine Bandbreite an.900 Kilo, 900, 900.Soll ich es mal riskieren und wenigstens auf 2 MBit hochstellen?Ich mein, immerhin verwenden wir jetzt, gehen wir jetzt gerade über den südkoreanischenServer.Ich, ich riskier's mal, ob ich die Wahnsinnsbandbreite von 1,9 MBit verwenden kann.Nein, Kacke, Kacke, Kacke X, Kacke Vodafone.Ich meine, wir haben jetzt, ich hab hier relativ viel gestreamt, ne, in letzter Zeit.Und ich würde sagen, wir hatten in 80% schon mal einen VPN ausprobiert, ehrlich gesagtnicht, aber wenn ich zum Twitch-Server in Frankfurt schon Verbindungsprobleme hab, dannmüsste ich schon eine sehr glückliche Route erwischen zu einem VPN, dass ich da keineProbleme hab.Da glaub ich ja nicht dran.Ich hab's noch nicht mit dem VPN ausprobiert, wir können das, wir können, äh, wir könnendas mal machen.Sieh, Baron, das machen wir nach dem Stream, oder Moje, irgendwann, wenn du Zeit hast,nicht, nicht jetzt.Da muss ich nämlich noch mal neu starten und alles.Wenn's funktioniert, machen wir uns ein eigenes VPN im Stream, ja, ich schreib dir, nein,nein, ich brauch keinen ordentlichen VPN.Ich bezweifle halt, dass ein VPN was bringt, wie gesagt, der Twitch-Server in Frankfurtspackt rum und Frankfurt, wo davon, ist das erste, wo ich rauskomm.Oh, es hat gerockelt, Leute, ich hab's gesehen.Guck mal, ich hab jetzt, ich hab jetzt relativ regelmäßig gestreamt, ne?Schauen wir mal hier.Also ich hoffe mal, der Stream ist halbwegs scharf, auch bei, bei wenig Bewegung, ne?Also guck mal, wir haben relativ viel gestreamt in letzter Zeit.Wir haben hier, äh, so, hier hatten wir Lacks, gestern, ich glaub, gestern ging's, gesternging's, ne?Gestern war mal einer der Streams, wo es wirklich funktioniert hat.Da hatten wir Lacks, vorgestern hatten wir glaub ich auch Lacks, da hatten wir Lacks,der aufwachen Stream hat auch geleckt, langweilig Stream hat, glaube ich, ja, hatten wir gesagt,der hat auch geleckt, also, äh, der Susestream hat, glaube ich, es, also, sagen wir mal 80%der Streams, 85, 80 bis 90%, hast du auch die Entschuldigungs-E-Mail von Vodafone gesternbekommen?Keine Ahnung, ne, glaub nicht.Die können sich aber noch so viel entschuldigen, das ist mir scheißegal, die Spasten.Ich will, dass der Kram, wenn es ab und zu mal nicht funktioniert, ist, lass ich ja mitmir reden.Aber es kann nicht sein, dass 80 bis 90% der Zeit, wo ich mal streamen will, der scheißnicht geht.Ich hol mir keine Business-Leitung, ich geh, wenn schon, geh ich zur Telekom.Sobald es bei der Telekom irgendwas gibt, was auch nur, ich muss mal gucken, ich habschon eine Weile bei der Telekom nicht mehr Bandbreiten-Check bei mir geguckt, ich habhalt aktuell 40 ab, 400 down, was eigentlich eine ganz gute Geschichte ist für mich.Theoretisch könnte ich Gigabit kriegen bei Vodafone, was nicht ankommt und was mir auchnix bringt, wenn der Scheiß nicht klappt.Da nehm ich aber lieber die 250 oder so, die es vor der Telekom gibt, 250 down und wasist das?50 ab, oder?Was ist...Was ist VDSL 250, 250 down und wie viel ab, 50 ab, 40 ab, 100 ab, noch besser.Da nehm ich lieber das, ich mein, ganz ehrlich, scheiß drauf, dass ich dann ein bisschenmehr Geld bezahle, ja, und scheiß drauf, dass es weniger Bandbreite ist, warum ist dasInternet in Deutschland nur so abgrundtiefes Scheiße, das ist nicht einfach nur Scheiße,das ist richtiger Dünnschiss.100 ab gibt's nur mit Glasfaser, ja ganz ehrlich, 50 ab oder 40 ab reicht mir auch.Das ist, das ist doch, da reicht noch nicht mal Dünnschiss für, das ist, was kommtnach Dünnschiss noch?Dünnschiss mit Blut drinne ist das Internet in Deutschland, äh.Was hast du jetzt für Speed, ich hab 400 down, 40 ab, 400 down und die wollt mich dieganze Zeit schon überreden, ob ich nicht auf Gigabit upgrade, aber mach ich nicht, dannläuft nämlich meine Mindestvertraglaufzeit irgendwann auch in nicht allzu langer Zeitaus.Ich mein, ich könnte natürlich sagen, es klappt überhaupt nicht, ihr Leute, lasstmich weg, aber da kann ich nix, ich werd mich hüten, dass bei Vodafone irgendwie nochwas abzuschließen, dass sich das dann wieder auf zwei Jahre verlängert.Ja, das Internet, Blut im Stuhl trifft's, trifft's genau, so ist das Internet in Deutschland.So, wollen wir mal, wollen wir mal riskieren, wollen wir mal riskieren, ob wir da ein bisschenhochstellen können.Haha, das ist doch lächerlich, das ist doch absoluter Witz, 900 Kilobyte, Leute, ich hab40 ab, 400 down und ich kann 900 Kilo, nee, nicht mal Kilobyte, Kilobits, es sind Kilobits,es sind gar keine Kilobyte, es sind Kilobits, Typhoon, Stufe 1, dankeschön.Das bringt nix, wenn du das Vodafone twitterst, das einzige, was passiert ist, dass Vodafonemich anruft und fragt, ob ich nicht zufällig zwei WLAN SSIDs verwende.Wir müssten höchstens Vodafone so krass zu spammen, tagelang, dass das an anderenStellen ankommt, aber die können ja da wahrscheinlich gar nix dran machen.Also, ich kann nicht streamen mit einem MBit, wie soll das funktionieren?Davon sind irgendwie 200, ungefähr sind irgendwie, keine Ahnung, Audio ist 160, 160K ist Audio,das heißt, ich hab noch ungefähr 800, 800, 700 Kilobit für Video, was soll ich denndamit streamen außer ein Standbild mit einem großen Haufen Scheiße neben dem VodafoneLogo?Ich kann außer das hier nichts anderes flüssig streamen gerade.Das ist das einzige, was ich zur Zeit flüssig streamen kann, Wimmelbildstream.Und sogar da droppen die Frames.Wisst ihr was Leute, wir warten, wir mussten warten, es bleibt nichts anderes übrig außerzu warten.Was wir jetzt machen ist, wir beantworten jetzt noch ein paar Fragen aus dem Chat, wasanderes können wir eh nicht machen, aber ich muss gucken, dass ich das Vodafone Logo nebenbeieingeplanet kriege.Dass wir auch mal ein bisschen schön Werbung für Vodafone machen, was für ein Scheißladenist.Okay, also, ist der Chat im Video so verpixelt, dass man ihn nicht lesen kann?Ja, das in der fucking Chat geht nicht ey.Ja, seh Baro, können wir morgen mal probieren.Was für ein Kabelmotor hast du, was für ein Doxel Standard, keine Ahnung, ich habirgendeine Connectbox.Das ist ne Sache, mit der ich mich eigentlich auch nur widerwillig beschäftige, weil icheinfach von meinem Anbieter erwarte, dass der Kram funktioniert.Hast du schon einen Plan, zu welchem Anbieter du wechselst, es bleibt ja nur die Telekom.Was hast du denn für ne Auswahl?Es ist doch nur noch Vodafone oder Telekom, Vodafone oder Telekom oder irgendein lokalerAnbieter, bei dem es ganz gut funktioniert, wenn du eine Glocke hast.Aber was gibt es denn noch außer Vodafone und Telekom?1 und 1 ist Telekom Resale, gibt es auch sonst nix mehr.Lass doch Glasfaser legen, ja 5000 Euro Eats, das geht mir echt auf den Sack.Warst du mit deiner Maske schon einkaufen?Ne, ich war gerade beim EDK und hab wieder festgestellt, wie bescheuert die Leute sind.Im EDK steht alles schön da, alles schön mit Abstand, alles schön mit Masken auf, aberdort wo es den Einkaufswagen gibt, stehen sie im Häuschen drin, 5 cm Abstand und leckensich fast ab, kloppen sich um den Wagen.Verstehe nicht, warum Vodafone bei dir so Probleme macht, du wohnst ja fast beim Dezix.Die Probleme von Vodafone liegen, vermute ich, höchstwahrscheinlich nicht auf der SeiteKunde zu Vodafone, sondern an der Anbindung von Vodafone zu allen anderen Sachen.Okay, wir stellen mal wieder hoch, wir gucken jetzt gerade mal, ob es funktioniert, vielleicht,dann müssen wir zwischenseitig mal kurz probieren, ob es wieder geht, oah, oah, oah, oah, oah.Die meinen doch, dass sie Backbone-Probleme haben, das sind keine Probleme, was die haben,das sind riesen Löcher.Probleme ist ja sowas, wie es geht normalerweise, aber manchmal gibt es halt Probleme, bei Vodafoneist das umgedreht, es gibt Probleme, und manchmal geht's, wie gesagt, ich hab keine Entschuldigungs-Mailvon Vodafone bekommen.Hast du dich echt mal informiert, was Glasfaser kostet, wenn du bei mir, nee, ehrlich gesagtnicht, ich weiß gar nicht, weiß gar nicht zu wem ich da hin müsste.Glasfaser-Anschluss hat bei euch 400 Euro gekostet, okay, wo hast du den her, wo mussman da hin?400 Euro bezahle ich, das ist überhaupt kein Problem, easy as fuck, ich bezahle auch 1000Euro für ein Glasfaser-Anschluss, mir vollkommen egal, also nicht im Monat, okay, muss ichmal gucken.Das wäre natürlich, na 400 Euro im Monat bezahle ich nicht, also ich würde auch 1000Euro einmalig für das Ausbau bezahlen, wenn die Preise im Monat dann halt nicht gar soüberzogen sind.Das machen die nur, wenn du deine komplette Straße dazu überlegen kannst, na guter Witz,in meiner Straße gibt's nur solche, bis auf mein Nachbar, und der eine Nachbar glaubt,dass Corona eine Strafe Gottes ist und der andere Nachbar ist normal.Sebaro was hast du da rausgesucht, Verfügbarkeit prüfen, Verwechsel zu Synfia, was zum Geierist Synfia, nee gibt's bei mir nicht Sebaro, ich hab geguckt, meine Hausnummer ist nichtdabei, meine Hausnummer ist nicht dabei Sebaro, Telekom bietet Glasfaser-Anschluss fürjener Mann, okay zeig ich mal her, auch für Privat gehen individuelle Glasfaser-Anschlussins Haus, allerdings nur, wenn man das nötige Kleine für die Bauern hat, nur in VDSL-Ausbaugebieten,VDSL-Ausbaugebiete heißt dort wo VDSL schon vorhanden ist oder, so ich muss das jetztso machen, dass das Logo die ganze Zeit eingeblendet bleibt irgendwo, gleich probieren, wir testennochmal, wir testen nochmal kurz, das kann doch nicht sein, das kann doch nicht sein,was sind das eigentlich für Spasten, warum verkaufen die überhaupt noch Anschlüsse,Geysi der ist gut, der Witz ist echt gut, was hat Vodafone und DHL gemeinsam, Paketverlust,da muss ich jetzt echt eine Runde Kek wehen, der war echt gut, allerdings nur wenn man dasnötige Kleingeld für unsere individuelle Glasfaser-Anschluss, das kostet 100 Euro Bearbeitungsgebühr,easy, erstmal 100 Euro abgraben, MBFM-Ausbau, what the fuck, was ist das, was ist das, wasist das, warum muss ich mich um den Scheiß selber kümmern, sind wir echt Uganda 2 inEuropa oder was, was ist hier los, warum, warum muss ich mir da überhaupt Gedankenzu machen, wahrscheinlich hat jedes Dixi-Klo in Südafrika einen besseren Anschluss, ichwill mich um den Scheiß nicht kümmern müssen, das geht mir voll auf den Sack, warum, warumsoll ich die Telekom anschreiben, warum soll ich meine Nachbarn organisieren, die Telekomanschreiben, dass ich irgendwann mal zeitgemäßen einen Internetanschluss kriege, wo sind wirdenn, wo sind wir denn für Gott und die Welt und für jeden Bullshit haben wir Geld, ja,aber mal für die ordentliche Infrastruktur investieren, dass wir hier wieder was auf,dass wir hier immer was geschissen kriegen, ja, das kriegen wir nicht hin, nicht scrollen,stimmt, wenn ich scrolle, dann lagts ja, bzw. dann Pixels, da Kompressionsartefakte gibtes dann, wir müssen ja hier korrekt sein, wir sind ja immer noch ein IT-Stream, es laggtnicht, es pixelt nicht, es sind Kompressionsartefakte, Leute, so, darf ich heute irgendwann nochmal anfangen normal zu streamen, ist das möglich, oder, geht das, wollt ihr mal lachen, wolltihr mal lachen, Leute?Kennst du den CCC-Vortrag, trau keinen, scan nur, den nicht selbst gefällt hast, ja, ja,ich mach mal nen Speedtest auf nem anderen Rechner grade, der Speedtest verbindet nichtmal, oh doch, jetzt gehts, ok, Download, Download ist gut, Download ist ok mit 162 MBit, Obstauf Lauf, du machst höchstwahrscheinlich nichts falsch, bringst der Upload nach Frankfurtzu dem Anbieter, Speedtest ist vollkommen ok grade, vielleicht sollte ich den Stream nochmalneu starten und jetzt wieder den Server in Frankfurt verwenden, weil ich musste ja ebenauf den Server in Südkorea umschalten, dass ich überhaupt benutzen konnte, soll ich nochmalmit dem Server in Frankfurt probieren, weil ganz ehrlich, sonst kommen wir heute zu nix,sonst kommen wir heute echt zu nix, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,ok, ok.", "segments": [{"id": 1, "start": 30.0, "end": 36.36, "text": "Oh oh was ist hier los?"}, {"id": 2, "start": 36.36, "end": 37.36, "text": "Was ist hier los?"}, {"id": 3, "start": 37.36, "end": 38.36, "text": "Jetzt geht was?"}, {"id": 4, "start": 38.36, "end": 39.36, "text": "Jetzt geht was?"}, {"id": 5, "start": 39.36, "end": 46.36, "text": "Geht jetzt was?"}, {"id": 6, "start": 46.36, "end": 60.88, "text": "Nee, ich weiß, dass es laggt."}, {"id": 7, "start": 60.88, "end": 68.16, "text": "Geht jetzt was?"}, {"id": 8, "start": 68.16, "end": 79.08, "text": "Ich hoffe, dass jetzt was funktioniert."}, {"id": 9, "start": 79.08, "end": 92.72, "text": "Ich kann meinen eigenen Stream nicht mehr refreshen in der Vorschau."}, {"id": 10, "start": 92.72, "end": 93.72, "text": "Es geht."}, {"id": 11, "start": 93.72, "end": 95.72, "text": "Leute, soll ich euch was geiles zeigen?"}, {"id": 12, "start": 95.72, "end": 101.72, "text": "Ich zeige euch mal, welcher Twitch-Server funktioniert."}, {"id": 13, "start": 101.72, "end": 104.56, "text": "Passt mal auf, welcher Twitch-Server funktioniert hat."}, {"id": 14, "start": 104.56, "end": 111.04, "text": "Ich habe jetzt einige Twitch-Server durchprobiert und bei den meisten war es bloß 0-90kb durchgegangen"}, {"id": 15, "start": 111.04, "end": 112.04, "text": "sind."}, {"id": 16, "start": 112.04, "end": 119.04, "text": "Und ihr seht schon, es ist trotzdem nicht ganz am Anschlag hier."}, {"id": 17, "start": 119.04, "end": 122.2, "text": "Es ist wirklich echt, es ist wie in Uganda, ohne Scheiß."}, {"id": 18, "start": 122.2, "end": 126.16, "text": "Wie die Datei heißt, drifts Vodafone ihr scheiß Ficker."}, {"id": 19, "start": 126.16, "end": 127.6, "text": "Das passt genau."}, {"id": 20, "start": 127.6, "end": 133.6, "text": "So, ich zeige euch mal, welchen Twitch-Server ich jetzt gerade verwende."}, {"id": 21, "start": 133.6, "end": 136.6, "text": "Südkorea."}, {"id": 22, "start": 136.6, "end": 150.76, "text": "Ich muss allen Ernstes den südkoreanischen Twitch-Server verwenden, dass der Scheiß"}, {"id": 23, "start": 150.76, "end": 152.04, "text": "mit Vodafone funktioniert."}, {"id": 24, "start": 152.04, "end": 163.2, "text": "Wie viel Delay habt ihr zu mir?"}, {"id": 25, "start": 163.2, "end": 167.0, "text": "Wie viel Delay habt ihr zum Streamer?"}, {"id": 26, "start": 167.0, "end": 171.88, "text": "3,5 Sekunden."}, {"id": 27, "start": 171.88, "end": 176.52, "text": "Ja, es geht doch."}, {"id": 28, "start": 176.52, "end": 178.88, "text": "Ich meine Lichtgeschwindigkeit ist Lichtgeschwindigkeit."}, {"id": 29, "start": 178.88, "end": 183.28, "text": "Die ist auch nach Südkorea noch relativ zügig."}, {"id": 30, "start": 183.28, "end": 187.76, "text": "Aber das ist doch absolut lächerlicher Scheiß."}, {"id": 31, "start": 187.76, "end": 192.52, "text": "So ein Kackladen."}, {"id": 32, "start": 192.52, "end": 193.52, "text": "Swiftrage."}, {"id": 33, "start": 193.52, "end": 200.92, "text": "Wieder da, da kann man nicht so richtig sagen."}, {"id": 34, "start": 200.92, "end": 205.44, "text": "Ich meine, ich kann gerade mal, ich guck mal, guck dir schon mal meine Bandbreite an."}, {"id": 35, "start": 205.44, "end": 210.44, "text": "900 Kilo, 900, 900."}, {"id": 36, "start": 210.44, "end": 217.36, "text": "Soll ich es mal riskieren und wenigstens auf 2 MBit hochstellen?"}, {"id": 37, "start": 217.36, "end": 222.72, "text": "Ich mein, immerhin verwenden wir jetzt, gehen wir jetzt gerade über den südkoreanischen"}, {"id": 38, "start": 222.72, "end": 223.72, "text": "Server."}, {"id": 39, "start": 223.72, "end": 231.92, "text": "Ich, ich riskier's mal, ob ich die Wahnsinnsbandbreite von 1,9 MBit verwenden kann."}, {"id": 40, "start": 231.92, "end": 247.16, "text": "Nein, Kacke, Kacke, Kacke X, Kacke Vodafone."}, {"id": 41, "start": 247.16, "end": 266.76, "text": "Ich meine, wir haben jetzt, ich hab hier relativ viel gestreamt, ne, in letzter Zeit."}, {"id": 42, "start": 266.76, "end": 273.48, "text": "Und ich würde sagen, wir hatten in 80% schon mal einen VPN ausprobiert, ehrlich gesagt"}, {"id": 43, "start": 273.48, "end": 282.2, "text": "nicht, aber wenn ich zum Twitch-Server in Frankfurt schon Verbindungsprobleme hab, dann"}, {"id": 44, "start": 282.2, "end": 286.08, "text": "müsste ich schon eine sehr glückliche Route erwischen zu einem VPN, dass ich da keine"}, {"id": 45, "start": 286.08, "end": 287.08, "text": "Probleme hab."}, {"id": 46, "start": 287.08, "end": 292.04, "text": "Da glaub ich ja nicht dran."}, {"id": 47, "start": 292.04, "end": 297.32, "text": "Ich hab's noch nicht mit dem VPN ausprobiert, wir können das, wir können, äh, wir können"}, {"id": 48, "start": 297.32, "end": 298.32, "text": "das mal machen."}, {"id": 49, "start": 298.32, "end": 303.6, "text": "Sieh, Baron, das machen wir nach dem Stream, oder Moje, irgendwann, wenn du Zeit hast,"}, {"id": 50, "start": 303.6, "end": 304.6, "text": "nicht, nicht jetzt."}, {"id": 51, "start": 304.6, "end": 306.72, "text": "Da muss ich nämlich noch mal neu starten und alles."}, {"id": 52, "start": 306.72, "end": 318.92, "text": "Wenn's funktioniert, machen wir uns ein eigenes VPN im Stream, ja, ich schreib dir, nein,"}, {"id": 53, "start": 318.92, "end": 321.52, "text": "nein, ich brauch keinen ordentlichen VPN."}, {"id": 54, "start": 321.52, "end": 325.24, "text": "Ich bezweifle halt, dass ein VPN was bringt, wie gesagt, der Twitch-Server in Frankfurt"}, {"id": 55, "start": 325.24, "end": 330.0, "text": "spackt rum und Frankfurt, wo davon, ist das erste, wo ich rauskomm."}, {"id": 56, "start": 330.0, "end": 336.52, "text": "Oh, es hat gerockelt, Leute, ich hab's gesehen."}, {"id": 57, "start": 336.52, "end": 342.0, "text": "Guck mal, ich hab jetzt, ich hab jetzt relativ regelmäßig gestreamt, ne?"}, {"id": 58, "start": 342.0, "end": 343.0, "text": "Schauen wir mal hier."}, {"id": 59, "start": 343.0, "end": 349.4, "text": "Also ich hoffe mal, der Stream ist halbwegs scharf, auch bei, bei wenig Bewegung, ne?"}, {"id": 60, "start": 349.4, "end": 352.36, "text": "Also guck mal, wir haben relativ viel gestreamt in letzter Zeit."}, {"id": 61, "start": 352.36, "end": 365.24, "text": "Wir haben hier, äh, so, hier hatten wir Lacks, gestern, ich glaub, gestern ging's, gestern"}, {"id": 62, "start": 365.24, "end": 366.24, "text": "ging's, ne?"}, {"id": 63, "start": 366.24, "end": 369.2, "text": "Gestern war mal einer der Streams, wo es wirklich funktioniert hat."}, {"id": 64, "start": 369.2, "end": 375.68, "text": "Da hatten wir Lacks, vorgestern hatten wir glaub ich auch Lacks, da hatten wir Lacks,"}, {"id": 65, "start": 375.68, "end": 381.0, "text": "der aufwachen Stream hat auch geleckt, langweilig Stream hat, glaube ich, ja, hatten wir gesagt,"}, {"id": 66, "start": 381.0, "end": 387.64, "text": "der hat auch geleckt, also, äh, der Susestream hat, glaube ich, es, also, sagen wir mal 80%"}, {"id": 67, "start": 387.64, "end": 394.56, "text": "der Streams, 85, 80 bis 90%, hast du auch die Entschuldigungs-E-Mail von Vodafone gestern"}, {"id": 68, "start": 394.56, "end": 395.56, "text": "bekommen?"}, {"id": 69, "start": 395.56, "end": 398.68, "text": "Keine Ahnung, ne, glaub nicht."}, {"id": 70, "start": 398.68, "end": 404.24, "text": "Die können sich aber noch so viel entschuldigen, das ist mir scheißegal, die Spasten."}, {"id": 71, "start": 404.24, "end": 410.08, "text": "Ich will, dass der Kram, wenn es ab und zu mal nicht funktioniert, ist, lass ich ja mit"}, {"id": 72, "start": 410.08, "end": 411.08, "text": "mir reden."}, {"id": 73, "start": 411.08, "end": 417.8, "text": "Aber es kann nicht sein, dass 80 bis 90% der Zeit, wo ich mal streamen will, der scheiß"}, {"id": 74, "start": 417.8, "end": 418.8, "text": "nicht geht."}, {"id": 75, "start": 418.8, "end": 426.36, "text": "Ich hol mir keine Business-Leitung, ich geh, wenn schon, geh ich zur Telekom."}, {"id": 76, "start": 426.36, "end": 429.96, "text": "Sobald es bei der Telekom irgendwas gibt, was auch nur, ich muss mal gucken, ich hab"}, {"id": 77, "start": 429.96, "end": 434.48, "text": "schon eine Weile bei der Telekom nicht mehr Bandbreiten-Check bei mir geguckt, ich hab"}, {"id": 78, "start": 434.48, "end": 440.0, "text": "halt aktuell 40 ab, 400 down, was eigentlich eine ganz gute Geschichte ist für mich."}, {"id": 79, "start": 440.0, "end": 443.92, "text": "Theoretisch könnte ich Gigabit kriegen bei Vodafone, was nicht ankommt und was mir auch"}, {"id": 80, "start": 443.92, "end": 445.44, "text": "nix bringt, wenn der Scheiß nicht klappt."}, {"id": 81, "start": 445.44, "end": 456.2, "text": "Da nehm ich aber lieber die 250 oder so, die es vor der Telekom gibt, 250 down und was"}, {"id": 82, "start": 456.2, "end": 457.2, "text": "ist das?"}, {"id": 83, "start": 457.2, "end": 458.2, "text": "50 ab, oder?"}, {"id": 84, "start": 458.2, "end": 459.2, "text": "Was ist..."}, {"id": 85, "start": 459.2, "end": 468.32, "text": "Was ist VDSL 250, 250 down und wie viel ab, 50 ab, 40 ab, 100 ab, noch besser."}, {"id": 86, "start": 468.32, "end": 476.88, "text": "Da nehm ich lieber das, ich mein, ganz ehrlich, scheiß drauf, dass ich dann ein bisschen"}, {"id": 87, "start": 476.88, "end": 482.38, "text": "mehr Geld bezahle, ja, und scheiß drauf, dass es weniger Bandbreite ist, warum ist das"}, {"id": 88, "start": 482.38, "end": 487.64, "text": "Internet in Deutschland nur so abgrundtiefes Scheiße, das ist nicht einfach nur Scheiße,"}, {"id": 89, "start": 487.64, "end": 489.12, "text": "das ist richtiger Dünnschiss."}, {"id": 90, "start": 489.12, "end": 498.24, "text": "100 ab gibt's nur mit Glasfaser, ja ganz ehrlich, 50 ab oder 40 ab reicht mir auch."}, {"id": 91, "start": 498.24, "end": 507.24, "text": "Das ist, das ist doch, da reicht noch nicht mal Dünnschiss für, das ist, was kommt"}, {"id": 92, "start": 507.24, "end": 508.24, "text": "nach Dünnschiss noch?"}, {"id": 93, "start": 508.24, "end": 517.0, "text": "Dünnschiss mit Blut drinne ist das Internet in Deutschland, äh."}, {"id": 94, "start": 517.0, "end": 525.32, "text": "Was hast du jetzt für Speed, ich hab 400 down, 40 ab, 400 down und die wollt mich die"}, {"id": 95, "start": 525.32, "end": 532.24, "text": "ganze Zeit schon überreden, ob ich nicht auf Gigabit upgrade, aber mach ich nicht, dann"}, {"id": 96, "start": 532.24, "end": 539.28, "text": "läuft nämlich meine Mindestvertraglaufzeit irgendwann auch in nicht allzu langer Zeit"}, {"id": 97, "start": 539.28, "end": 540.28, "text": "aus."}, {"id": 98, "start": 540.28, "end": 543.12, "text": "Ich mein, ich könnte natürlich sagen, es klappt überhaupt nicht, ihr Leute, lasst"}, {"id": 99, "start": 543.12, "end": 547.92, "text": "mich weg, aber da kann ich nix, ich werd mich hüten, dass bei Vodafone irgendwie noch"}, {"id": 100, "start": 547.92, "end": 550.96, "text": "was abzuschließen, dass sich das dann wieder auf zwei Jahre verlängert."}, {"id": 101, "start": 550.96, "end": 556.68, "text": "Ja, das Internet, Blut im Stuhl trifft's, trifft's genau, so ist das Internet in Deutschland."}, {"id": 102, "start": 556.68, "end": 562.6, "text": "So, wollen wir mal, wollen wir mal riskieren, wollen wir mal riskieren, ob wir da ein bisschen"}, {"id": 103, "start": 562.6, "end": 563.6, "text": "hochstellen können."}, {"id": 104, "start": 563.6, "end": 574.8, "text": "Haha, das ist doch lächerlich, das ist doch absoluter Witz, 900 Kilobyte, Leute, ich hab"}, {"id": 105, "start": 574.8, "end": 584.12, "text": "40 ab, 400 down und ich kann 900 Kilo, nee, nicht mal Kilobyte, Kilobits, es sind Kilobits,"}, {"id": 106, "start": 584.12, "end": 591.6, "text": "es sind gar keine Kilobyte, es sind Kilobits, Typhoon, Stufe 1, dankeschön."}, {"id": 107, "start": 591.6, "end": 601.56, "text": "Das bringt nix, wenn du das Vodafone twitterst, das einzige, was passiert ist, dass Vodafone"}, {"id": 108, "start": 601.56, "end": 606.84, "text": "mich anruft und fragt, ob ich nicht zufällig zwei WLAN SSIDs verwende."}, {"id": 109, "start": 606.84, "end": 615.32, "text": "Wir müssten höchstens Vodafone so krass zu spammen, tagelang, dass das an anderen"}, {"id": 110, "start": 615.32, "end": 618.04, "text": "Stellen ankommt, aber die können ja da wahrscheinlich gar nix dran machen."}, {"id": 111, "start": 618.04, "end": 644.88, "text": "Also, ich kann nicht streamen mit einem MBit, wie soll das funktionieren?"}, {"id": 112, "start": 644.88, "end": 654.96, "text": "Davon sind irgendwie 200, ungefähr sind irgendwie, keine Ahnung, Audio ist 160, 160K ist Audio,"}, {"id": 113, "start": 654.96, "end": 661.6, "text": "das heißt, ich hab noch ungefähr 800, 800, 700 Kilobit für Video, was soll ich denn"}, {"id": 114, "start": 661.6, "end": 666.8, "text": "damit streamen außer ein Standbild mit einem großen Haufen Scheiße neben dem Vodafone"}, {"id": 115, "start": 666.8, "end": 667.8, "text": "Logo?"}, {"id": 116, "start": 667.8, "end": 671.64, "text": "Ich kann außer das hier nichts anderes flüssig streamen gerade."}, {"id": 117, "start": 671.64, "end": 680.28, "text": "Das ist das einzige, was ich zur Zeit flüssig streamen kann, Wimmelbildstream."}, {"id": 118, "start": 680.28, "end": 704.28, "text": "Und sogar da droppen die Frames."}, {"id": 119, "start": 704.28, "end": 707.24, "text": "Wisst ihr was Leute, wir warten, wir mussten warten, es bleibt nichts anderes übrig außer"}, {"id": 120, "start": 707.24, "end": 708.24, "text": "zu warten."}, {"id": 121, "start": 708.24, "end": 715.8, "text": "Was wir jetzt machen ist, wir beantworten jetzt noch ein paar Fragen aus dem Chat, was"}, {"id": 122, "start": 715.8, "end": 720.48, "text": "anderes können wir eh nicht machen, aber ich muss gucken, dass ich das Vodafone Logo nebenbei"}, {"id": 123, "start": 720.48, "end": 721.48, "text": "eingeplanet kriege."}, {"id": 124, "start": 721.48, "end": 727.52, "text": "Dass wir auch mal ein bisschen schön Werbung für Vodafone machen, was für ein Scheißladen"}, {"id": 125, "start": 727.52, "end": 728.52, "text": "ist."}, {"id": 126, "start": 728.52, "end": 747.4, "text": "Okay, also, ist der Chat im Video so verpixelt, dass man ihn nicht lesen kann?"}, {"id": 127, "start": 747.4, "end": 770.04, "text": "Ja, das in der fucking Chat geht nicht ey."}, {"id": 128, "start": 770.04, "end": 789.92, "text": "Ja, seh Baro, können wir morgen mal probieren."}, {"id": 129, "start": 789.92, "end": 795.92, "text": "Was für ein Kabelmotor hast du, was für ein Doxel Standard, keine Ahnung, ich hab"}, {"id": 130, "start": 795.92, "end": 796.92, "text": "irgendeine Connectbox."}, {"id": 131, "start": 796.92, "end": 802.84, "text": "Das ist ne Sache, mit der ich mich eigentlich auch nur widerwillig beschäftige, weil ich"}, {"id": 132, "start": 802.84, "end": 805.36, "text": "einfach von meinem Anbieter erwarte, dass der Kram funktioniert."}, {"id": 133, "start": 805.36, "end": 811.08, "text": "Hast du schon einen Plan, zu welchem Anbieter du wechselst, es bleibt ja nur die Telekom."}, {"id": 134, "start": 811.08, "end": 812.6, "text": "Was hast du denn für ne Auswahl?"}, {"id": 135, "start": 812.6, "end": 818.12, "text": "Es ist doch nur noch Vodafone oder Telekom, Vodafone oder Telekom oder irgendein lokaler"}, {"id": 136, "start": 818.12, "end": 820.6, "text": "Anbieter, bei dem es ganz gut funktioniert, wenn du eine Glocke hast."}, {"id": 137, "start": 820.6, "end": 823.16, "text": "Aber was gibt es denn noch außer Vodafone und Telekom?"}, {"id": 138, "start": 823.16, "end": 833.84, "text": "1 und 1 ist Telekom Resale, gibt es auch sonst nix mehr."}, {"id": 139, "start": 833.84, "end": 845.92, "text": "Lass doch Glasfaser legen, ja 5000 Euro Eats, das geht mir echt auf den Sack."}, {"id": 140, "start": 845.92, "end": 848.32, "text": "Warst du mit deiner Maske schon einkaufen?"}, {"id": 141, "start": 848.32, "end": 853.32, "text": "Ne, ich war gerade beim EDK und hab wieder festgestellt, wie bescheuert die Leute sind."}, {"id": 142, "start": 853.32, "end": 858.32, "text": "Im EDK steht alles schön da, alles schön mit Abstand, alles schön mit Masken auf, aber"}, {"id": 143, "start": 858.32, "end": 862.2, "text": "dort wo es den Einkaufswagen gibt, stehen sie im Häuschen drin, 5 cm Abstand und lecken"}, {"id": 144, "start": 862.2, "end": 870.36, "text": "sich fast ab, kloppen sich um den Wagen."}, {"id": 145, "start": 870.36, "end": 873.76, "text": "Verstehe nicht, warum Vodafone bei dir so Probleme macht, du wohnst ja fast beim Dezix."}, {"id": 146, "start": 873.76, "end": 878.96, "text": "Die Probleme von Vodafone liegen, vermute ich, höchstwahrscheinlich nicht auf der Seite"}, {"id": 147, "start": 878.96, "end": 883.84, "text": "Kunde zu Vodafone, sondern an der Anbindung von Vodafone zu allen anderen Sachen."}, {"id": 148, "start": 883.84, "end": 901.24, "text": "Okay, wir stellen mal wieder hoch, wir gucken jetzt gerade mal, ob es funktioniert, vielleicht,"}, {"id": 149, "start": 901.24, "end": 921.2, "text": "dann müssen wir zwischenseitig mal kurz probieren, ob es wieder geht, oah, oah, oah, oah, oah."}, {"id": 150, "start": 921.2, "end": 935.08, "text": "Die meinen doch, dass sie Backbone-Probleme haben, das sind keine Probleme, was die haben,"}, {"id": 151, "start": 935.08, "end": 940.64, "text": "das sind riesen Löcher."}, {"id": 152, "start": 940.64, "end": 946.76, "text": "Probleme ist ja sowas, wie es geht normalerweise, aber manchmal gibt es halt Probleme, bei Vodafone"}, {"id": 153, "start": 946.76, "end": 963.32, "text": "ist das umgedreht, es gibt Probleme, und manchmal geht's, wie gesagt, ich hab keine Entschuldigungs-Mail"}, {"id": 154, "start": 963.32, "end": 964.32, "text": "von Vodafone bekommen."}, {"id": 155, "start": 964.32, "end": 969.52, "text": "Hast du dich echt mal informiert, was Glasfaser kostet, wenn du bei mir, nee, ehrlich gesagt"}, {"id": 156, "start": 969.52, "end": 972.88, "text": "nicht, ich weiß gar nicht, weiß gar nicht zu wem ich da hin müsste."}, {"id": 157, "start": 972.88, "end": 982.04, "text": "Glasfaser-Anschluss hat bei euch 400 Euro gekostet, okay, wo hast du den her, wo muss"}, {"id": 158, "start": 982.04, "end": 983.04, "text": "man da hin?"}, {"id": 159, "start": 983.04, "end": 999.68, "text": "400 Euro bezahle ich, das ist überhaupt kein Problem, easy as fuck, ich bezahle auch 1000"}, {"id": 160, "start": 999.68, "end": 1018.04, "text": "Euro für ein Glasfaser-Anschluss, mir vollkommen egal, also nicht im Monat, okay, muss ich"}, {"id": 161, "start": 1018.04, "end": 1019.04, "text": "mal gucken."}, {"id": 162, "start": 1019.04, "end": 1037.88, "text": "Das wäre natürlich, na 400 Euro im Monat bezahle ich nicht, also ich würde auch 1000"}, {"id": 163, "start": 1037.88, "end": 1042.6, "text": "Euro einmalig für das Ausbau bezahlen, wenn die Preise im Monat dann halt nicht gar so"}, {"id": 164, "start": 1042.6, "end": 1052.36, "text": "überzogen sind."}, {"id": 165, "start": 1052.36, "end": 1057.88, "text": "Das machen die nur, wenn du deine komplette Straße dazu überlegen kannst, na guter Witz,"}, {"id": 166, "start": 1057.88, "end": 1064.36, "text": "in meiner Straße gibt's nur solche, bis auf mein Nachbar, und der eine Nachbar glaubt,"}, {"id": 167, "start": 1064.36, "end": 1087.88, "text": "dass Corona eine Strafe Gottes ist und der andere Nachbar ist normal."}, {"id": 168, "start": 1087.88, "end": 1099.32, "text": "Sebaro was hast du da rausgesucht, Verfügbarkeit prüfen, Verwechsel zu Synfia, was zum Geier"}, {"id": 169, "start": 1099.32, "end": 1107.8, "text": "ist Synfia, nee gibt's bei mir nicht Sebaro, ich hab geguckt, meine Hausnummer ist nicht"}, {"id": 170, "start": 1107.8, "end": 1129.32, "text": "dabei, meine Hausnummer ist nicht dabei Sebaro, Telekom bietet Glasfaser-Anschluss für"}, {"id": 171, "start": 1129.32, "end": 1141.48, "text": "jener Mann, okay zeig ich mal her, auch für Privat gehen individuelle Glasfaser-Anschluss"}, {"id": 172, "start": 1141.48, "end": 1146.56, "text": "ins Haus, allerdings nur, wenn man das nötige Kleine für die Bauern hat, nur in VDSL-Ausbaugebieten,"}, {"id": 173, "start": 1146.56, "end": 1156.24, "text": "VDSL-Ausbaugebiete heißt dort wo VDSL schon vorhanden ist oder, so ich muss das jetzt"}, {"id": 174, "start": 1156.24, "end": 1165.84, "text": "so machen, dass das Logo die ganze Zeit eingeblendet bleibt irgendwo, gleich probieren, wir testen"}, {"id": 175, "start": 1165.84, "end": 1191.52, "text": "nochmal, wir testen nochmal kurz, das kann doch nicht sein, das kann doch nicht sein,"}, {"id": 176, "start": 1191.52, "end": 1211.92, "text": "was sind das eigentlich für Spasten, warum verkaufen die überhaupt noch Anschlüsse,"}, {"id": 177, "start": 1211.92, "end": 1223.56, "text": "Geysi der ist gut, der Witz ist echt gut, was hat Vodafone und DHL gemeinsam, Paketverlust,"}, {"id": 178, "start": 1223.56, "end": 1243.2, "text": "da muss ich jetzt echt eine Runde Kek wehen, der war echt gut, allerdings nur wenn man das"}, {"id": 179, "start": 1243.2, "end": 1248.12, "text": "nötige Kleingeld für unsere individuelle Glasfaser-Anschluss, das kostet 100 Euro Bearbeitungsgebühr,"}, {"id": 180, "start": 1248.12, "end": 1278.04, "text": "easy, erstmal 100 Euro abgraben, MBFM-Ausbau, what the fuck, was ist das, was ist das, was"}, {"id": 181, "start": 1278.04, "end": 1286.04, "text": "ist das, warum muss ich mich um den Scheiß selber kümmern, sind wir echt Uganda 2 in"}, {"id": 182, "start": 1286.04, "end": 1290.0, "text": "Europa oder was, was ist hier los, warum, warum muss ich mir da überhaupt Gedanken"}, {"id": 183, "start": 1290.0, "end": 1305.68, "text": "zu machen, wahrscheinlich hat jedes Dixi-Klo in Südafrika einen besseren Anschluss, ich"}, {"id": 184, "start": 1305.68, "end": 1311.84, "text": "will mich um den Scheiß nicht kümmern müssen, das geht mir voll auf den Sack, warum, warum"}, {"id": 185, "start": 1311.84, "end": 1316.88, "text": "soll ich die Telekom anschreiben, warum soll ich meine Nachbarn organisieren, die Telekom"}, {"id": 186, "start": 1316.88, "end": 1320.92, "text": "anschreiben, dass ich irgendwann mal zeitgemäßen einen Internetanschluss kriege, wo sind wir"}, {"id": 187, "start": 1320.92, "end": 1327.6, "text": "denn, wo sind wir denn für Gott und die Welt und für jeden Bullshit haben wir Geld, ja,"}, {"id": 188, "start": 1327.6, "end": 1330.88, "text": "aber mal für die ordentliche Infrastruktur investieren, dass wir hier wieder was auf,"}, {"id": 189, "start": 1330.88, "end": 1337.6, "text": "dass wir hier immer was geschissen kriegen, ja, das kriegen wir nicht hin, nicht scrollen,"}, {"id": 190, "start": 1337.6, "end": 1343.16, "text": "stimmt, wenn ich scrolle, dann lagts ja, bzw. dann Pixels, da Kompressionsartefakte gibt"}, {"id": 191, "start": 1343.16, "end": 1347.96, "text": "es dann, wir müssen ja hier korrekt sein, wir sind ja immer noch ein IT-Stream, es laggt"}, {"id": 192, "start": 1347.96, "end": 1366.52, "text": "nicht, es pixelt nicht, es sind Kompressionsartefakte, Leute, so, darf ich heute irgendwann noch"}, {"id": 193, "start": 1366.52, "end": 1373.84, "text": "mal anfangen normal zu streamen, ist das möglich, oder, geht das, wollt ihr mal lachen, wollt"}, {"id": 194, "start": 1373.84, "end": 1396.0, "text": "ihr mal lachen, Leute?"}, {"id": 195, "start": 1396.0, "end": 1418.16, "text": "Kennst du den CCC-Vortrag, trau keinen, scan nur, den nicht selbst gefällt hast, ja, ja,"}, {"id": 196, "start": 1418.16, "end": 1431.36, "text": "ich mach mal nen Speedtest auf nem anderen Rechner grade, der Speedtest verbindet nicht"}, {"id": 197, "start": 1431.36, "end": 1450.84, "text": "mal, oh doch, jetzt gehts, ok, Download, Download ist gut, Download ist ok mit 162 MBit, Obst"}, {"id": 198, "start": 1450.84, "end": 1456.2, "text": "auf Lauf, du machst höchstwahrscheinlich nichts falsch, bringst der Upload nach Frankfurt"}, {"id": 199, "start": 1456.2, "end": 1461.52, "text": "zu dem Anbieter, Speedtest ist vollkommen ok grade, vielleicht sollte ich den Stream nochmal"}, {"id": 200, "start": 1461.52, "end": 1465.64, "text": "neu starten und jetzt wieder den Server in Frankfurt verwenden, weil ich musste ja eben"}, {"id": 201, "start": 1465.64, "end": 1478.24, "text": "auf den Server in Südkorea umschalten, dass ich überhaupt benutzen konnte, soll ich nochmal"}, {"id": 202, "start": 1478.24, "end": 1482.8, "text": "mit dem Server in Frankfurt probieren, weil ganz ehrlich, sonst kommen wir heute zu nix,"}, {"id": 203, "start": 1482.8, "end": 1503.8, "text": "sonst kommen wir heute echt zu nix, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 204, "start": 1503.8, "end": 1513.28, "text": "ok, ok."}]}