{"text": "So, auf geht's!Ah, exzellent. Ähm, ah guck mal da, der Sebaru ist auch da. Ich hab jetzt grad denChat refreshed, ich hab gar nicht gesehen, wer alles da ist.Wahrscheinlich die üblichen Verdächtigen. Der geht immer. Der geht echt immer.Äh, was ich grad noch im Chat gesehen hab, ist, irgendjemand hat gefragt, wie das mit...Ich weiß nicht, ob ich noch ein paar Voter davon bin oder ob ich schon die Fritzbox bestellthab, hat irgendjemand gefragt. Ja, also ich hab die Fritzbox noch nicht bestellt, weilder Covid Simulator, ja genau, den brauchen wir jetzt noch unbedingt. Ist eh schon allesvoll mit Nachrichten und Leute, die die ganze Nacht nur über Covid labern. Hab ich eucheigentlich erzählt, dass ich mir versucht hab Covid, dass ich mir, langsam Max, dassich mir versucht habe, also mega big brain move eigentlich, dass ich mir versucht habeCovid 20 und Covid 21 Usernamen zu sichern und Domains zu registrieren. Hat leider nichtgeklappt, die waren schon alle weg. Ich hab gedacht, das bleibt jetzt noch eine Weileerhalten, also registrierst du dir mal covid20.de, covid21.de, covid21.biz. Sogar fucking covid20.bizist belegt. Nee, nee, nee, die hab ich nicht. Die mit Bindestrich, das war irgendeine komische,was war denn das? Covid-20.best, das ist ja die bescheuertste Domain dafür überhaupt.Punkt best. Ja, also zum thema, zum thema Fritzbox. Ja, also zum thema, hab ich die gar nichtin Eingang. Welche wollte ich kaufen? Die da, die da wollte ich kaufen. Genau, aber nichtauf lager, na super, jetzt hab ich's verkackt, kann ich nicht mehr kaufen. Nein, danke. Alsozum thema Fritzbox, ich hab mir noch keine Fritzbox bestellt. Das liegt nämlich daran,dass ich den Vodafone geantwortet hab. Stell euch das mal vor. Und die haben sich aber gedacht,ich les euch mal vor, ich les euch mal vor, was Vodafone geantwortet hat. So, ich mussmal messages aufmachen, Vodafone hat geantwortet. Ähm, oh nee, geh weg, C++, ah, weg. So, also,Vodafone hat geschrieben, blablabla, lieber, lieber Kunde Unity Media Etc. Vodafone, willkommenbei uns, blablabla, wir haben ihr Anliegen aufgenommen und melden uns schnellstmöglichbei ihnen, vielen Dank für die Geduld. So, und dann kam gestern noch ne Nachricht gleichhinterher, ähm, lieber Kunde, ihre Störung wird durch ein externes Störsignal in ihrerNähe verursacht. Da hab ich mir schon so gedacht, klingt mal wieder nach Ausrede. Ähm, bittehaben sie noch etwas Geduld, wir melden uns, sobald die Störung beseitigt wurde, vielenDank für ihr Verständnis. Danach hab ich nix mehr gehört von Vodafone und heute Morgenkam ne Mail, ob ich nicht an der Umfrage teilnehmen möchte, wie zufrieden ich mit dem Kundenservicebin. Also, ich hab's nicht ausgefüllt, weil ich hab keine Ahnung, ob das Problem wegist. Es wär ja nicht schlecht, wenn sich irgendjemand, irgendjemand gesagt hätte, ok, es ist abgeschlossen,wir, sie können jetzt wieder normal benutzen oder so, ne? Vodafone gedacht, nein. Das ist...Hatsi, haben sie sich gedacht, ja? Aber trotzdem, es klingt halbwegs plausibel, mal gucken,mal gucken, wir werden es ja sehen, Leute, wir werden es ja sehen, ob, ähm, dompc sagt,Störsignale gibt es oft bei Kabel, wo kommen die dann her? Ich muss bei Kabel immer darandenken, wie man früher noch bei, kennt noch jemand, kennt jemand noch diese Dinger? Hatdas noch irgendjemand mitbekommen, der so in meinem Alter ist? Was Störsignale, mussjemand daran denken, wenn einer so ein Ding nicht aufgesteckt hat? Das ist, das ist hochgradigeBoomer-Technologie hier, das Ding, zumindest was Netzwerk angeht. Damals hat man, ähm,Oszilloskop hat einen BNC-Stecker, das ist auch noch sowas, was ich irgendwann mir maleins holen wollte, ich weiß noch nicht genau, was ich mitmachen soll, aber so ein Oszilloskophätt ich auch mal gern. Also, und, ähm, muss ich noch was für, was man damals hat,ist BNC und T-Stück, weiß gar nicht, wie das Ding auf Englisch hieß, das war zu Zeiten,da hab ich die Sachen noch nicht auf Englisch gesucht. Oh, guck mal, gibt's ja immer noch,BNC-T-Stück. Ja, hoho, das hat man früher an die Netzwerkkarte gemacht. Also, das kaman die Netzwerkkarte, auf der einen Seite kam so ein Abschlusswiderstand hin und aufder anderen Seite das BNC-Kabel zum nächsten Netzwerkkabel. Das war, das war wirklich,ziemlich ja kacke. Hier sieht man's mal, wie das aussah mit dem Netzwerkkabel. 10Base2,wusste gar nicht, wie der Kram heißt. Gab's dafür eigentlich auch Switche? Widersprichtzwar eigentlich dem Sinn, aber man weiß ja nie. Gab es, gab es, äh, 10Base2-Switche,gab's sowas? Scheiße, sowas gab's wirklich. Ach du große Kacke. Sowas gab's, aber dassieht genauso boomer aus, wie die Leute, die den Kram noch verwenden. Oh Mann. Du hastein USB-Osteloskop aus, aus China. Aus China, sozusagen. Ein Osteloskop aus China und taugtdas? Na, man könnte damit doch ohne Probleme den Switch machen. Einfach 1 zu 1 Verbindungendamit machen. Ist zwar bescheuert mit dem Medium, aber warum nicht? Täglich bei STI-Kamerashat es schon nie in der Hand. Kabel kann auch den Mobilfunk stören. Echt. Die Technikwird mir immer sympathischer. Ähm, ich wollte dann eigentlich schon viel früher anfangen.Ich hab den Streamtitel irgendwie geändert vor 3 Stunden und dann hab ich noch gedacht,ach komm, ne halbe Stunde Stream guckste noch, fängst dann irgendwie so 18 oder sonst wasan und dann bin ich bei, äh, bei Daffran, Daffran, Alter, Daffran oder wie er jetztgenau ausspricht, hängen geblieben und hab mir ein Valorant Tournament angeguckt, 2Runden. Und dann hab ich gedacht, gut, jetzt ist es schon 20.40 Uhr, jetzt lohnt es sichauch nicht mehr, aber scheiß drauf, komm jetzt mal. Jetzt mach noch mal Stream an, ja.Und ich hab wirklich nix im Sinne heute Sinnvolles zu machen, ja. Spiele auch mal Valorant,ich hab kein Account, ich hab mich auch nicht registriert, ich hab kein Riot-Account, ichhab keine Keys irgendwie geleashed im Stream. Das Einzige, was ich machen könnte ist, darfman ja wahrscheinlich nicht, aber man macht jeder und der im Zweifel, also ich könnteauf Ebay gehen und mir ein Account kaufen. Stimmt es, dass Valorant Anti-Cheat Chinameine Nudes gibt. Was? Wie soll es das geben? Aber wenn du welche auf der Platte hast, habendie die mittlerweile bestimmt. Aber nicht nur, aber nicht nur die, aber nicht nur die,sondern die anderen auch alle, also deswegen ist das nicht so wild, es war schon verbreitetgenug vorher. Der Tribolone ist auch am Start, Patrick ist auch da, der Nightbot ist auchda. xDxDxD, so, Nightbot, genau. Noch ne Idee für die Liste, keine Ahnung ob du es schonhast gemacht hast, Arch plus DWM. Da stellt sich mir die Frage. Bäh, Nordpad, da stelltsich mir die Frage, wo ist mein, naja, Windows und Dateien, ja. So, ähm, was, DWM. Was tunwir hier? Eine Stunde, eineinhalb Stunden streamen oder gehe ich pennen? Wir gucken uns erstein paar übrig gebliebenen Fragen vom letzten Stream an, wir hatten ja mal Zeit. Äh, Triboloneund ich auch. Heute, ich bin heute am Main ne Runde spazieren gegangen und da war wiederder komplette Strand fort. Strand ist zu viel gesagt, wir haben am Main so zwei, drei Buchtenmit ein bisschen Sand und da sitzen die ganzen Outdoor-Boomer-Pepegas rum, Wufftschmann amStrand und stecken sich an. Das ist, das ist auch wieder so ein Ding, ne? Irgendwie gibt'skaum Leute, die da noch halbwegs normal ticken im Kopf. Du hast einmal die Fraktion, so nachdem Motto, ähm, Bill Gates, ist der, ist der Corona-Mann oder gar, dass Vire nicht existierenoder alles, alles nur, äh, staatlich verorderte Fake-News, ja? Sondern hast du auf der anderenSeite, die sagen, ne, also, äh, jegliche Corona-Maßnahmen sind gerechtfertigt. Gibt's, gibt's eigentlichnoch ein paar normale Leute im Kopf? So irgendwas, so Leute, die sagen, okay, wir verstehen,wir haben es eingesehen, dass die Lage ernst ist, aber zumindest sollte man sich mal überdie Maßnahmen Gedanken machen. Oh, das, das ist Weep-Musik. Ach ne, das ist, das, dasist das Skyward Sword Intro, das ist doch keine Weep-Musik. Naja, doch, doch, eigentlichschon, wenn man genau ist. Wie soll der Mittelweg gehen? Ja, einfach LTE statt 5G, ist docheinfach. Oh, ja, die Schweizer nehmen das ernst, Patrick, wie es aussieht. Zum Türma,Störungen, Kabel, Mobilfunk. Aha, ist das ein Vortrag? Ah ne, ah doch. Okay, der schautaus, als müsste das. Oh ne, das ist mir jetzt, der Vortrag ist mir jetzt ein Ticken, einTicken zu lange für ein Stream. Aber der hat bestimmt Ahnung, der sieht pro aus. Speichelmit das mal. Zum Thema Boomer-Technik, ich kenne jemand, der seine Modelleisenbahn auchüber Relays ansteuert. Wie macht man das denn sonst aktuell? Ich habe von Modelleisenbahnnur wirklich keine Ahnung. Ich wusste gar nicht, dass es noch Modelleisenbahn Leutegibt. Der angeblich das schnellsteigende Hobby weltweit ist Drone-Racing, habe ichgelesen. Und das ist so ein Ding, das, das, das würde ich auch gerne mal ausprobieren.Drone-Racing, dann hast du eine ordentliche Brille, ja, da kannst du mit Drone-Racing,da kannst du mit Filme gucken, da kannst du mit VR-Porn gucken, da kannst du mit Sachenspielen. Ne, ich glaube mit der Brille für Drone-Racing kannst du keine Filme gucken.Dafür müsstest du aber das Haus verlassen. Ja, das ist richtig, aber ich kann bestimmtauch von meinem Dach aus Drone-Racing. Seit wann ist das Chat, seit wann das Chat-Overlayso transparent ist? Das ist eine gute Frage, da erkennt man ja kaum was, oder? Was istmit dem Chat, was ist da los? Oder erkennt man da was? Sagt mal Leute, ist das, ist dasbesser so oder, oder war das vorher besser mit dem, mit dem dunklen Chat? Ich muss dasgrad mal selbst ins Vollbild machen, dass ich da überhaupt noch was erkenne. Warte mal,1080p, etwas zu, ne, das sieht gut aus, gefällt mir. Na wobei, ne, ganz so gut sieht das aus.Ich weiß woran das liegt, ich kanns euch sagen, und zwar, ich hab grad nur so getan, als wüssteichs nicht. Ich grad mal hier die Qualität wieder runter, ich hab euch gebadet, ichweiß natürlich woran das liegt, und zwar weil ich das vorhin umgestellt hab. So, unddas kann man umstellen jetzt nicht in Dark, sondern in, äh, ich glaub Better TwitchTV Dark, und dann sagen wir Refresh, und jetzt sollte es besser aussehen eigentlich. SoChat, probiert mal aus, ob es jetzt besser funktioniert. Ne oder, ist immer noch so komischtransparent. Ich muss den Hintergrund weiß machen, äh, gehts ja noch schlechter alsvorher. Wartet mal. Moment, das muss ich jetzt grad mal ausprobieren. Ah, ich hab das,ich hab das falsch geschrieben. Ich hab das falsch geschrieben, Leute. Ich bin ein Kacknoob.Ich hab das falsch geschrieben. Das heißt nicht Better Twitch TV Dark, das heißt BetterTwitch TV Dark, und dann funktioniert das auch. Aha, guckt, jetzt ist es dunkel. Sehtihr das? Pock. So ist es besser, ne? So ist das gut. So war es vorher nämlich auch.Also, wie gesagt, ich hab's mal aufgeschrieben. Wir haben jetzt ein Vodafone-Emote auf demDiscord. Ja, das hab ich gesehen, das ist ziemlich gut. Wobei ich das obere Omega-Lulwegmachen würde, dass man das Vodafone größer sieht. Google Notes, weil ich kein GoogleZeug verwende für meinen privaten Kram. Wie viel, oh, das ist ne Frage. Wie viele Netzwerkerätehast du in, ach du Scheiße. Boah, keine Ahnung. Das ist so viel Zeug, das weiß ich ja ausdem Kopf nicht. Kein Schimmer. Okay, okay, also probieren wir das mal. Fangen wir erstmalan. Ne Kamera im Hof, ne Kamera oben, da wo die Katze immer schläft, ne Kamera untenim Flur, ne Kamera an der Eingangstür, okay. Zwei Ubiquiti Access Points, ne 10G-Switch,ne 8-Port 1G-Switch, ne Mikrotik-Router, ne Connectbox, ne Fritzbox, dann, keine Ahnung,jetzt einmal 15 Raspberry Pi ESP32 und Raspberry Pi Zero und Odroid-Dinger, so Single-Boardund Mikro-Controller-Dinger, die 4HE-Server-Kiste, 2HE-Server-Kiste, 2 Desktop-Rechner, Notebook,keine Ahnung, 8 Tablets oder so, 2 Smartphones, ach du Scheiße, keine Ahnung, das kriegeich nicht alles zusammen. Geil, ne, das war jetzt das beste, was ich auf dem Kopf hingekriegthabe. Wahrscheinlich war es das auch. Wahrscheinlich war es das auch. Aber das ist wirklich schwerzu beantworten gerade. Ne, die 8 Tablets sind nicht permanent an, das hat sich halt mittlerweileso angesammelt. Ich habe 2 Shield-Tablets, die Dinger, falls ihr noch jemand kennt, diefand ich für ihre Zeit eigentlich ziemlich gut, diese Dinger, die Shield-Tablets, wobeidie halt, ich finde es doof, dass Nvidia nie ein neues Shield-Tablet gemacht hat. Hatjemand einen Tipp für einen Server-Anbieter? Kommt doch an, was du brauchst, was brauchstdu denn? Also ich habe bisher immer alles mal digital ausgemacht, wenn ich viel Powergebraucht habe für kurze Zeit. In Zukunft werde ich es mal mit der Hetzer-Cloud probieren,weil die kostet einfach teilweise fast nur ein Drittel von digital aus. Da hole ich mirmein Zeug normalerweise. Das lohnt sich aber nur, wenn man halt kurzzeitig fette Powerauf. Dann ist es aber richtig gut, weil, guck mal sich das hier mal an, Droplets, Pricing,Standard. So, da kriegst du zum Beispiel, das Ding hier habe ich letztens gebucht, entwederhabe ich das Ding oder das Ding gebucht, ich glaube das Ding habe ich letztens gebucht,halt aber nur für 3-4 Stunden und was habe ich denn am Ende bezahlt, irgendwie 3-4 Dollar,das ist halt praktisch. Und die Handhabung von diesen Web-Interfaces ist halt auch super,das ist total einfach. Machst einen Account, create, bam, kriegst einen Key, Ubuntu einloggenund auf gehts. Für den ganzen Monat ist das natürlich nichts, dafür sind 480 Euro einbisschen viel. Selbst mit YouTube-Money. Der ganze Dong ist nicht relevant, nur hier.Okay, gucken wir uns mal nach. Ich weiß nicht, ich muss jetzt irgendwas machen, was mich interessiert.Jetzt schlafe ich ein, ich bin schon so spät am Start heute. Max flexed uns. Ey, halt gefragt,wie viele Netzwerkgeräte ich hab. Also, zu den Tablets wollte ich doch kurz was sagen.Wie gesagt, es haben sich 2 Shield Tablets angesammelt, davon geht aber nur eins, weildas andere wurde ausgetauscht, weil ja angeblich der Akku explodiert. Es erinnert sich vielleichtnoch Leute dran, dass der Akku vom Shield Tablet ein bisschen zu heiß wurde. Aber dashabe ich aus in der Ecke stehen, das kann ich jederzeit anmachen. Es gibt nämlich einenFix dafür, falls jemand auch sein Shield Tablet ausgetauscht hat, es gibt einen Fix. Also,wer sich traut sein Shield Tablet weiter zu betreiben, trotzdem dass der Akku eventuellbrennen kann, kann das hier machen. Ich würde es aber nicht machen, ich würde es aber nichtmachen, weil wie gesagt, wenn dann euer Haus abbrennt habt ihr gelitten. Keine Garantieund so für nix. NVIDIA auch nicht. NVIDIA hat es ja Big Brain gemacht, so sollten eseigentlich alle machen. NVIDIA hat gesagt, unser Shield Tablet ist verbackt, da brenntder Akku, schicke uns einfach die Seriennummer und du kriegst ein neues. Habe ich gemachtund sobald das neue Tablet das erste Mal ins Internet geht, schickt NVIDIA an das alteTablet, nen OTA, was den Bootloader flasht. Eigentlich ne gute Idee, also sprich, sobalddas neue in Betrieb genommen wurde, geht das alte kaputt. Eigentlich keine schlechte Idee.Natürlich kann man das halt verhindern, indem man den Kill Switch killt, indem man quasidas NVIDIA Tablet auch nachdem es deaktiviert wurde weiter benutzen kann. Aber wie gesagtkann ich keinem empfehlen, falls einer noch so ein altes Ding rumliegen hat, weil wennder Akku abbrennt ist halt scheiße. Aber die Idee ist schon ziemlich Big Brainy von NVIDIA.Aber wenn euch das egal ist, dass das Haus abbrennt, dann macht was ihr wollt. Genau,also zu den Tablets. Es haben sich einfach ein paar Tablets mit den, ich weiß gar nichtob 8 reicht, mit den Jahren angesammelt. Also 2 Shield Tablets, nen Tegra Node 1, nen OlusLenovo, nen Asus Tablet, Asus, sorry, Asus, was mich auch sehr schwer enttäuscht hat.Das Asus Tablet, dafür nenne ich jetzt Asus, weil das mögen sie überhaupt nicht, dasAsus Tablet, das hat mich sehr enttäuscht. Das war eigentlich ein ganz gutes Tablet fürüber 53€, also sprich, das war mal ein Android Tablet, wo man sagen kann, ey, das ist ganzgut, allerdings leider auch ähnlich preislich wie ein iPad. Zumindest haben die mich schwerenttäuscht. Die Software, die sie mitgeliefert haben, war absoluter Crap und die haben nieFirmware Updates gebracht, nie. Einfach komplett rausgebracht das Tablet und quasi einen Monatspäter eingestellt. So, und da hab ich mir gedacht, fickt euch, ihr könnt mich mal amArsch lecken, kauf ich mir nicht mehr. Und jetzt hab ich mir zwei iPads noch. Also, weiter.Also, ein Asus Tablet hatten wir, ein Tegra Tablet hatten wir schon, nen iPad und nenFire HD 10 oben, nen Fire HD unten, nen Fire HD 8 und nen iPad. So, neun, oder? Ne, elf.Keine Ahnung, es sind mittlerweile elf Tablets, Alter. Yolo. Aber davon verwenden wir halteins, zwei, zwei. iPad und das Fire HD 8. Und, ähm, und halt oben und unten das FireHD 10 als, das habt ihr ja schon gesehen, das hab ich euch ja schon hier gezeigt, dasFire HD 10 als, ähm, Dashboard an der Wand, ja. Das tue ich jetzt einfach mal nicht mitzuverwenden,das ist halt an und zeigt Kameras an und zeigt Home Assistant, Dashboard und sowas an. Aberes ist halt, da ist jetzt ein Tablet, also es ist auch an. So. Ist das Pinephone wasfür dich hab ich mir noch gar nicht angeguckt, was ist denn das Pinephone? Ne, ich will,das ist eh nix für mich. Ich will kein Smartphone selbst bauen, ich will ein Smartphone, dasfunktioniert. Da drauf läuft ja im Endeffekt da nix, ne? Da läuft da wahrscheinlich, dasist ja wahrscheinlich wieder kein Android, sondern irgendwas Eigengestricktes, gibt'skeine gescheiten Apps für, ähm, wird wahrscheinlich alles außer dem Preis zacken, also der Preiswird viel zu hoch sein und wahrscheinlich wird er erst zacken. Ähm, es gab ja schonso ein paar Versuche in der Richtung und das hat halt leider nie hingehauen, deswegen,ich bleib, ich bleib bei, bei iOS und bei Android. Ein Fire HD oben und unten, das sehdie rum, ich hab's doch gerade gezeigt, der Chat gebated, gebated mich wieder. Das istdas Dashboard oben an der Wand und unten ist natürlich noch mal genau das gleiche, ne?Gegensprechanlage von der Tür und das Dashboard daneben, unten ist das Dashboard, da hat dasKabel ein bisschen schöner, ich hab nämlich kein kurzes USB-Kabel mehr gehabt, unten istdas Dashboard-Kabel hier so. Tja. Was hältst du vom neuen Microsoft Edge auf Chromium-Basis?Also, ganz ehrlich, ich bin weder dafür noch dagegen, wir haben's ja hier installiert,das Ding, das ist ja hier der Chrome, der Chrome Edge, man sieht's ja hier auch an UplogOrigin. Ähm, warum nicht? Also, Microsoft sagt ja selbst, der hauptsächliche Grunddafür, dass sie das ganze, was ist denn das für ein Gimmick? Nein, der hauptsächlicheGrund dafür, dass sie das ganze gemacht haben, ist, dass jemand anderes sich drum kümmert,dass die Webseiten korrekt aussehen. Eigentlich eine ziemlich gute Idee, weil den Edge musstensie selbst dafür sorgen, in der Chrome-Engine kann ihnen das scheiß egal sein, die Seitensehen einfach richtig aus und es ist nur einfach so, dass heute die meisten Seiten im Chromeentwickelt werden oder für Chrome entwickelt werden. Das ist jetzt nicht so das riesenDing, wie früher zwischen Mozilla und Internet Explorer und sonst was, aber es gibt schonein paar Sachen, wenn man die verwendet, geht's halt im Firefox nicht. Oh, das ist wieder,das ist F-Zero-Musik, ne? Ja. Ja, steht zwar da, dass es Smash Bros. ist, aber das istein F-Zero-Track. Poggers. Hallo, warum ist das jetzt so laut? Ich hab's so leiser gemacht.So. Hast du einen eigenen Code-Style, wenn du nur für dich was programmierst? Hm. Also,ich versuche eigentlich, mich meistens an das zu halten, was für die jeweilige Sprachevom Hersteller so Style-Guide ist. Bis auf so ein paar Sachen, so ein paar Sachen verstoßeich manchmal dagegen. Mir fällt jetzt leider kein richtig gutes Beispiel ein, aber woich mich zum Beispiel nie dran halte, ist in C++, weil ihr wisst, dass für mich C++die größte Kacksprache auf der Welt ist. Ich hab mich schon oft genug darüber ausgelassenund da mach ich einfach so, dass es funktioniert und für mich am sinnvollsten erscheint. ZumBeispiel mach ich den C++ manchmal so, dass ich keine Klassen verwende, ich zeig euchdas mal. Ich weiß, da wird sich jeder C++-Man sagen, Max, sowas kannst du doch nicht machen.Aber guck mal, ich verwende beispielsweise hier keine Klasse, sondern hab das alles ineinem Namespace mit globalen Variablen drinne. Ich hab das aber an der Stelle nur gemacht,weil das mit der Klasse nicht funktioniert hat, was ich machen wollte. Weil das ist jawieder so eine typische C++-Crap-Geschichte. Man kann in C++ keine C-Funktion, also mankann keine Methoden von einer Klasse an alten C-Code als Funktionszeige übergeben, dasgeht nicht. Also das heißt, mir blieb gar nichts anderes da übrig, wie das Ganze ohneeine Klasse mit globalen Variablen zu machen, weil das C++ nicht supportet hat. Also mankann, nur so, dass ich zu erklären, was man nicht machen kann. Also wenn ihr jetzt zumBeispiel hier in C++, das ist schon wieder so typischer C++-Schwachsinn, ja. Also wennihr jetzt hier eine Klasse in C++ macht, so und da drinne habt ihr, macht ihr irgendwieeine Methode, keine Ahnung, void, blub, so, bester Name. Und ihr habt irgendwie noch eineandere Methode, void, kappa, hd. Und ihr wollt jetzt eine C-Funktion mit einem Callback aufrufen,C, Callback, Function, so. Was ihr nicht machen könnt, ist das hier. Das geht nicht. Alsowenn ihr wollt, dass diese C-Funktion quasi das hier als Callback aufruft, das geht nicht,das ist nicht supportet. Das darf man nicht. Also das hier geht nicht, ja, aber weil esdie Funktion nicht geht, das ist nicht supportet. Wenn man das versucht zu kompilieren, sagter nein, man darf keine, keine Klassenmethoden als Raw Funktionspointer verwenden. Ist jaschön und gut, aber es gibt keine Alternative für. Das ist so eine typische C++-Geschichte,wo ich mir denke, ist okay. Also wenn jetzt nicht der Interop mit C in C++ gut ist, dannweiß ich auch nicht. Das ist C++-Logik. Muss für die Uni Codestyle für C++ entwickeln.Was, du musst einen Codestyle für C++ entwickeln? Warum nehmt ihr nicht den normalen recommendedCodestyle? Was aber auch witzig ist, so einen richtigen globalen Codestyle für C++ gibtja gar nicht, ne. Die einen sagen, man soll CamelCase machen, die anderen sagen, man sollSnake. Ne, das ist nicht Snake. Ist das SnakeCase? Ne, wie heißt das hier Variable-Namen? Istdas SnakeCase? SnakeCase ist doch, ne, das ist KebabCase. Ah ja, genau, das ist, dasist, das ist SnakeCase, ne. Und, und KebabCase ist das hier. Das ist, das mögen die JavascriptLeute. Das finden die ganz, ganz super. Da sagen die. CamelCase. Ich muss sagen CamelCaseall the way. Also vor allem in C sharp CamelCase beste. In C++ nehme ich tatsächlich manchmalSnakeCase, weil die eingebauten Sachen oftmals CamelCase haben. Da weiß ich, was von mirdas hier ist. Ja. Aber normalerweise nehme ich das, was vom Hersteller empfohlen wird.Es gibt einen Punkt, wo ich mittlerweile in C sharp dagegen verstoße und zwar ist dasfür Variablen, also für Klassenvariablen, die private sind, mache ich einen Anderscoredavor. Laut dem offiziellen Code-Guide, den es da von Microsoft gibt, ist das glaube ichoptional erlaubt, wenn sich, aber die empfehlen, dass man das nicht macht und private Variablenkleinschreibt und dann this zum referenzieren verwendet. Kann man auch machen, wobei ichmittlerweile, ich fand es am Anfang auch nicht gut. Könnt ihr euch noch dran erinnern,von zwei Jahren oder so habe ich sogar noch gesagt, Leute ich mache lieber this und kleingeschrieben,weil mittlerweile mache ich auch Anderscore. Beschäftigst du dich überhaupt mit Reverse? Nee. Nicht wirklich. Ich meine ein paar Sachen habe ich schon über die Jahre mal,nennen wir es mal Reverse-Enginiert. Kennt ihr mal noch Croof Shark? Das gibt es ja nichtmehr. Kennt das zufällig noch jemand? Das war so ein Radiodienst, wo man kostenlos Musikanhören konnte und die haben halt darauf aufgebaut, dass man halt das über die offizielle Seitemacht, mit dem offiziellen Player macht, dass die Werbung schalten können und sowas unddie haben den Fehler gemacht damals. Die haben ne Flash-Anwendung rausgebracht. Das gingnicht in Deutschland so richtig, ja, aber man konnte die bescheißen. Und zwar, diehaben den Fehler gemacht, die haben ne Flash-Anwendung rausgebracht, ne Desktop-Flash-Anwendung habendie damals rausgebracht und was ich damals gemacht habe ist, ich habe die Flash-Anwendung,da gibt es so D-Compiler für Flash-Anwendungen, das ist total simpel was da rauskommt, dakommt mehr oder weniger eins zu eins der Source-Code wieder raus und dann habe ich das Passwort,was die verwenden um sich an ihre API zu authentifizieren, habe ich aus der Flash-Anwendung ausgelesenund wisst ihr wie das Passwort war, heute kann man das ja verraten, ist ja kein Ding,wisst ihr wie das Passwort war, war ein richtig geiles Passwort, mal gucken ob ich es nochfinde, mal gucken ob man es in Google noch findet, das Passwort war Quit Stealing MyShit, aber es war ein bisschen Leadspeak geschrieben, das war nicht so geschrieben, es war ein bisschenLeadspeak geschrieben, das war irgendwie Quit Stealing My Shit oder sowas, ne gibt es,es hat man hat es ein bisschen anders geschrieben, aber so in der Richtung, so ein paar Kleinigkeitenhabe ich gemacht, also wie gesagt von den ganzen Reverse, was gibt es da, Ida, Pro undGhidra, ich weiß gar nicht wie man den ausspricht, Ghidra, wie spricht man das aus, Ghidra, Gaidra,die coolen Leute, die coolen Leute sprechen das bestimmt Gaidra, Gaidra aus, Gaidra,wir haben ja auch Leute die Hira, Gyra aussprechen und sowas, aber am besten, was mich immertriggert Leute, Chat, Chat, ich sag es euch, das was mich echt triggert sind die Leutedie Ghidra aussprechen, da kriege ich echt Anfälle, wenn dann irgendwie einer kommtmir der hat den Ghidra eingecheckt und sowas, in Ghidra, ja nachdem letztes Jahr der Vodafonedas System abgekackt ist, wo ich gerade einen mega Witz reißen wollte, wisst ihr wie dasGit Gui Plugin für Eclipse heißt, GIF versus GIF, eindeutig GIF, selbst wenn der GIF ErfinderGIF sagt ist es nach wie vor GIF, zumindest das Git Plugin für Eclipse heißt, IGIT, passtzu dem ganzen Kack oder, IGIT das ist der perfekte Name für den Eclipse Plugin, das ist geniusja aber richtig, ok wenn man das nicht IGIT aussprecht, die coolen Leute müssten esja dann AYJIT aussprechen, das hört sich fast an wie irgendein türkischer Name, türkischerMädchen Name, wie heißt du AYJIT, das könnte echt ein türkischer Mädchen Name sein, klingtirgendwie so, sowas haben wir ansonsten, klingt irgendwie so, wir hatten früher, wo wir gewohnthaben im Haus eine, die hieß Ayshe Güll und die war keine Ahnung, das war, das war schoneine ganze Weile, hey was wie alt wird die gewesen sein, 14, 15 oder so und die ist immerdraußen rum gerannt und ich hab die übelste Abneigung diesen Namen, weil die Eltern immeraus dem Fenster geschrien haben, Ayshe Güll, die übelst lauten halben Tag haben die ihreTochter gerufen und da, also das ist das echte Name und der, der triggert mich, genauso wieMario, bei uns früher im Haus hat auch mal ein Mario gelebt und der hat permanent, permanenthat er seine Frau und seine Frau ihn gerufen, auch so ein Ding er, es gibt schon ein paarSachen, die sind eigentlich ganz normal, aber, aber manche Leute nerven sie, weil sie haltdamit schlechte Erfahrungen gemacht haben, Robert, bei mir war es Mario, Mario und dieFrau hieß Angela, das weiß ich noch, da haben die, da haben die immer aus dem Fenster geschrien,Mario, Mario und dann kam ich an, Angela, Angela, das war nervig, das, das, das war aberrichtige Unterschicht, das sag ich euch, was da gewohnt hat bei uns im zweiten Stock oderso, das war wirklich komplett Unterschicht, anders kann man das nicht nennen, oh Max,ich sehe, du willst Captain Affleck, ich kann dir gute Webseiten, Ressourcen geben, ichweiß nicht, ob du noch schon da bist, gerade wieder, Bildungsfern sagt man, ja stimmt,besonders, besonders, ja, mit besonderen Fähigkeiten, hey Max, du benutzt doch einen Mikrotik-Routeroder welchen hast du zur Zeit, ein Hex-POE, das habe ich glaube ich schon mal beantwortet,wie sieht dein Arbeitsalltag im Homeoffice aus, das wollte ich tatsächlich mal in Ruhebeantworten, das, das wollte ich mal wirklich in Ruhe beantworten, also sprich das da, weil,das hat glaube ich Vodafone das letzte Mal, das Vodafone glaube ich das letzte Mal abgekackt,das ich beantwortet habe, vielleicht, das ist Chat, was ist da?Okay.so ich schicke den jetzt gleich auf twitter was leute bin ich wieder dagleich auf gleich geht gleich weiter geht gleich weiterich wie gesagt ich werde jetzt jeden tag voll spam auf twitter wie lang war ich jetztan 40 minutentweet geht raus ja mal gucken ob ich jetzt wieder hoch hoch schalten kann jabeste musik jetzt leider bei jawollmonka monka monka monka monka geht nichtgeht das läuft immer noch rund alter das das was was ich habe es noch gesagtne ich habe es noch gesagt dass das einfach nur wieder wieder flair flairausgestoßen von wo da vorne wareinmal geflehrt im heli haben sie mit dem dass man ticket geschlossen habendie nupt fliegen den heliso tweet ist rausschau mal malschau mal was da heute kommtjetzt kannst du wenigstens die umfrage zum kundenservice beantworten gute ideemache ich jetzt gleich mache ich jetzt gleich wie zufrieden wie zufrieden warensie waren sie mit demkunde nummer ja wir wollen jetzt mal nicht so ist nicht so eng nicht so engseht oder geht das stimmt es überhaupt was geschrieben war 2 mbit upload und geht es damit jetzt halbwegsgeht so ich war zum glück reichen 2 mbit für den desktop betrieb so ansatzweise ausjaja ihr dürft alle leiten alle leiten retweeten beste hauptsache dass den so dassihn so ein bisschen der arsch geht dass es halt auch die leute sehen weil ansonsten denken die sichso leute wo bin ich wo bin ich stehen geblieben ich war gerade dabei beimerzählen bei irgendwas von wo da vorne oder und in dem moment wo ich wo da vorneerwähnt habe ist es abgekackt was was war was habe ich denn gerade erzielthomeoffice richtig stimmt ich wollte die frage vom sebaro beantworten oder vonwem von den maligen wie wäre es mit einem tun das oder von kacke bildautomatisch einblendet wenn die frames trocken das ist eigentlich ziemlichgute idee also wie sieht ein arbeitstag im homeoffice aus also bin ich da vorda vorne kommen da bin ich übrigens auch die letzten tage übelste probleme imhomeoffice mit wo da vorne weil das ist ganz schön kacke wenn wenn in einerteamsbesprechung bist und das komplett abkackt zwischendurch man könnte das isteine gute idee das ist eine richtig gute idee das muss uns gleich aufschreibenleute machen wir mal so was wie hier projektideen wir machen einen tool tooldas automatisch wurde von service antwittert wenn stream lag das ist dochwas exzellent das machen wir demnächstdas ist eine gute idee es kam an bestimmt das kam an bestimmt recht easyfeststellen ob das stream gerade abkacken ist dann werden die richtigfolgespampt ist ja eh macht doch nix so gut so wunderbar die sollen ruhigfolgespammt werdendann brechen auch die twitter selber zusammen wenn das also wenn nur ich dasmacht dann geht das wenn das alle machen ist schlechtleute ich habe re-subs übersehen nämlich vom bildschirm arbeiter und vomjiu jim für einmal für sieben monat und einmal für zehn monate wahnsinn hypersubscribermassif iq chat wieder richtiger boost am start heute dank für die subs hast dudie webcam in teams an manchmal manchmal nicht oftnicht oft also wie sieht denn gerade an arbeitsalltag im ok da kommen wir mal zuder eigentlichen frage das war ich die ganze zeit schon beantwortet also beimir sieht das ungefähr so aus wieso machst du nicht einfach ein ordner fürdie gifs das ist ganz einfach weil der chat sichjedes mal freut wenn wenn man meinen desktop sieht stimmt jedes mal meindesktop der desktop sieht macht der chat innerlich soso also um jetzt mal die eigentliche frage zu beantworten also ich stehe soirgendwie 7 30 oder so in dem dreh auf da muss ich erstmal kurz der katze waszu essen machen dann gehe ich mal aufs klo und sonst was das führen wir jetztnicht weiter aus da mache ich den rechner an und lockt mich erst einmal ein einerunde teams eine runde bei uns ist es bei uns ist es irgendwie zu tricksremont lösung war mich nicht scheiß egal browser einloggen gut ist einloggengucken und da gucke ich mir erstmal die mails an und ob es irgendwie neue ticketsgibt oder sonstige geschichten habe ich gesagt ich mache mein pc aus ich machemein pc an warum soll ich mein pc ausmachen chat also chat manchmal jamanchmal muss man schon bisschen mitdenken ihr wisst dass ich öfters malkomisch dass ich öfters mal die wörter vertauscht ja rechner ausmachen machtkeinen sinn also da mache ich den rechner an der log ich mich ein da guckeich erst mal ob es neue tickets gibt ob e-mails gekommen sind ob irgendwaspassiert ist halt in der zeit wo ich nicht drauf geguckt habe und meistensund ich glaube das habe ich letztes mal bis dahin habe ich das letzte mal jaauch schon erzählt meistens ist dann auch schon irgendwas am start vonirgendwelchen leuten die die was haben wollen ich habe es euch ja ich habe eseuch ja schon zweimal oder so im stream gezeigt letztens hier fand ich auchgeil letztens per mail gekriegt hier morgens hier das da das habe ich euchja schon gezeigt so nachdem du könntest du dieseändert mit der nötigen eile bearbeiten ausrollen habe ich geschrieben ja ichbin heute nicht da wofür ist denn der fix und wie dringend ist das ja das isthalt eine absolut exzellent exzellent fife hat high IQ antwort da hast du allesmit abgehängt sagst einfach ja und daraufhin habe ich mich halt nichteingeloggt hab es erst mal ignoriert aber solche nachrichten kriege ich dannmeistens paar minuten nachdem ich gesagt habe dass ich nicht per mail des teamsist das die weeps sind wieder unterwegsso und ja wie gesagt meistens kommt dann irgendwie so was in der richtung das kannsein von hier bitte mal ganz schnell fixen und es kommen auch leute die sagenmax ich habe mein git branche kaputt gemacht das sind die geilsten vor allemwenn es java entwickler sind was auch immer vor allem wenn es java entwicklersind das finde ich immer geil ich würde eigentlich erwarten dass im jahre 2020das in der entwickler schafft so die so die geht basics zu beherrschen ja so dieso die ganz normalen sachen so die so so was weiß ich der kann sich der kannden checkout machen in eigenen branche erstellen da drin paar sachen comittenvielleicht ab und zu mal rebasen auf den master und und und und pull requestaufmachen viel man muss da eigentlich gar nicht können aber die meistenentwickler bei uns die ja wenn es um skit händling geht machen die das eherso und das schlimmste ist dann schon dass sie alle die java entwickler dieseskomische e-git eclipse plugin verwenden was die sache nicht besser macht ich habeschon ich habe schon kommt ich habe schon histories gesehen von leuten die wasgemurtscht haben wollten da waren fünf leere comments drin weil das irgendwieihr e-git plugin gemacht hatzumindest soll so nach ich kriege ich dann und ja wenn es um Hilfe max ich habemeinen git branche kaputt gemacht ist das ist das manchmal ist das manchmalganz witzig weil dann muss man müssen wir erst mal erklären wie sie ihr gitbranche kaputt gemacht hat heute ich höre mal auf zwischen den zwischen hellund dunkel zu switchen das brennen mich das ist ziemlich pepega style wir wartenjetzt einfach mal bis unity media geantwortet hat in der zwischenzeiterzähle ich weiter wobei die wahrscheinlichwobei die wahrscheinlich nicht nicht antworten so schnell so und also da mussman erst mal erklären wie sie denn ihre git branche zerstört haben da aber sozwei da war so zwei fraktionen wir haben einmal die die wirklich gar keinenblassen schimmer haben wie man geht verwendet aber es nicht zugeben wollenund einfach irgendwas machen die kein plan haben die eigentlich nichts falschnichts richtig machen die einfach kein plan haben ja und dann haben die anderendies eigentlich können aber sobald was unvorher gesehen ist basiertirgendwie in panik verfallen und dann komische dinge machen so die zweifraktionen haben wir bei den ersten da habe ich mittlerweile schon gar keinenbock mehr denen zu helfen weil ich denke mir wäre es als entwickler oder alsadmin oder als def ops man oder als service wer ist 2020 der ein bisschenwas mit it zu tun hat nicht schafft so die 45 basics git befehle kommandos zubeherrschen der ist falsch falsch im beruf und da wenn das welche sind dieoffensichtlich kein bock haben da habe ich auch kein bock mehr mittlerweile wirhaben beispielsweise einen das das ganz besonders tollder sagt immer nicht ich habe kein plan ich habe kein plan der sagt immer jawo ist das denn dokumentiert und mittlerweile sage ich ihm ja lesehalt das offizielle git handbuch und bei der way das offizielle git handbuchist kacke und die git man pages sind auch kacke jetzt passt habe ich ich weißnicht ob ich es schon mal gezeigt haben kennt ihr die man page von git von gitpusch wer kann mir nach dem hit nach dem einleitungssatz der hilfeseite erklärenwas git pusch machtwer wer hat gedacht das ist ein guter einleitungstext wer hat sich das werhat gedacht so ja ja jetzt versteht man sofort was git pusch macht ichexzellent ich habe das ist updates remote raffs using the local raffswhile sending objects necessary to complete the given raffs alles klarexzellent exzellent exquisite anleitung geht aber wenn die leute nur nur fragenkönnen sie nach dem motto ja wo ist das denn dokumentiert da habe ich kein bockmal drauf gerade externe gerade externe es kann nicht sein dass ein externereksperte berater wie auch immer dem anzunehmen zu dem thema im jahr 2020keine 5 basic git befehle kann das geht nicht an das das kann nicht sein und ichbin nicht dafür da den leuten die nicht willentlich sind sich mal ich erklärees ja jedem ich erkläre es auch jedem fünf mal aber beim sechsten war habe ich kein bockmehr und da haben wir haben so ein kandidat der ist ganz besonders toll wasdas angeht der fragt zu allem wirklich zu allem ja wo ist aus den dokumentiert zuden zu den größten basics wo willst du denn wo landet man denn damit irgendwannwill er dann irgendwann wikipedia inhalt haben wir sein arbeit macht daser quasi nur noch in die in die how to do work wikipedia gucken muss dass er danndann einfach oben anfängt und hat den tag erledigt oder was und vor allem wieweit runter soll das dann eigentlich gehen so nach dem motto bitte jetztzeigefinger ausfahren auf den powerknopf drücken zeigefinger nach unten 30sekunden warten wie soll das funktionieren ich stelle sich das vorund gerade wie gesagt gerade als externer experte berater musste musstedas musste das muss er das gebacken kriegen und da gehe ich schon gar nichtmehr darauf ein ist es mittlerweile wird sicherweise so dass die anderenmittlerweile auch schon sagen ja guck mal du bist jetzt zwei jahre dawarum hast du es nicht mehr aufgeschrieben du hast schon dreimalgemacht und dann ist er immer so wie der stolber früher und dann ist erstinkig dann ist er stinkig danach weil man in der ex post hat ja so aber dahaben wir aber glücklicherweise nicht so viele und da habe ich dann auch keinenbock mit den leuten zu helfen was was öfters was tatsächlich öftersvorkommt ist ich weiß ich habe gesagt ich will nicht mehr zwitschen aber ichmuss die frage noch mal kopieren dass man sieht um was es geht kopieren wir diemal dahingenau und das da habe ich dann da habe ich dann schon schon kein kein bockkein bock drauf an der stelle bei den anderen ist das überhaupt kein problemda kommt öfters mal vor ist jetzt auch nicht immer so übertrieben wie ich jetztgesagt habe das was total kaputt ist aber was mir aufgefallen ist was wo dieleute beim beim gett händling ein bisschen probleme haben ist wenn siesachen machen in einem branche und dann versuchen den branche zu wechseln weildann müssen sie dann hast dann hast ja in das so zwei varianten das dreivarianten du hast eigentlich drei varianten entweder kannst du denbranche wechseln weil die dateien sich irgendwie nicht überschneiden und es istgut und du nimmst die änderung mit das wollen die meisten aber nicht diemeisten wollen dass die änderung in diesem branche bleiben aber so funktioniertdas paket nicht die änderung bleiben erst in diesem branche wenn du sokommited hast aber das checken manche nicht so und dann zwitschen sie denbranche und es geht und kommiten sie im falschen branche falsche sachen oderdanach fragen sie sich hoch wo sind denn meine changes hin oder aber sie könnenden branche nicht wechseln weil sie noch unkommittete sachen haben das verwirrtoftmals die leute man muss aber auch sagen es ist nicht so schön gemachtso die zweite variante ist anstatt dass das wechsel einfach funktioniert ist dumachst ein kommet dann ist die sache auch gegessen dann ist das in diesembranche als neues kommet und du kannst wechseln machen was willst die drittevariante ist du staschst das einfach für später das funktioniert auchund da kannst du später weitermachen. Git stash ist eh eines derusesten kommandos überhaupt ich sehe kaum leute das verwenden dabei ist daseigentlich das beste das beste kommando für zwischendurch wenn man grad wasmacht und der chef kommt zu einem oder irgendjemand sagt hier du musst jetztda und da was mal schnell machen dann stashst du deine endung wechselst in dieanderen branche machst die endung schnell dich an chef haben willkommet ist das pusht das gehst wieder zurückpops den stash und kannst an der stelle weitermachen wo du aufgehört hast alsoich popp also vielleicht liegt das daran dass ich dass ich gerne ins dashpoppe weiß ich auch nicht zumindest dass es sehr under used in git meinst du nee ich meindas war es wirklich stash heißttom ux xx nee nee nee nee das stimmt nicht tom ux schreibt wir machen wirmachen jetzt mal sollen wir mal eine runde eine runde jit magic mit maxmachen jetzt also tom ux schreibt was mich bei git am meisten abfuckt ist dasunbenennt von verzeichnissen dann geht die gesamte historie flöten das stimmtnicht du musst das richtig machen du musst das mit git mv machen also wirmachen es hier test gibt ich habe keinerlei completion oder sonst wasinstalliert ist ein bisschen doof also wir machen jetzt eine datei cute chatpunkt txt 123 wir machen noch ein ordner mk dir blub so wunderbar aber geht statusgucken wir uns an uncommitted wir muven mal cute chat cute chat nach in denordner blub so als wenn man geht status da sehen wir okay und rechtfalls so wirenden mal alles und wir machen ein kommet in it und gucken wir uns jetztdurch anstellen fest macht das lokal aus hat ein kommet gemacht so und was dertormox jetzt meint ist und da hat er nicht unrecht muss man sagen aberwas richtig macht geht's wenn man jetzt das hier macht wenn man den ordner jetztunbenennt move blub nach blub 2 geht status dann sieht man jetzt schon okayfür ihn sieht das so aus als ist die eine datei gelöscht und es gibtkomplett neue neue files und so macht man das nicht so macht man das nichtweil geht denkt jetzt unter der haube ok die datei an dieser stelle wurdegelöscht und es wurde neues verzeichnet mit der neuen datei die zwar zufälliggenauso heißt aber es ist ein neuer datei angelegt das denke der richtigeweg das ganze zu machen ist in status jetzt haben wir zurück brennender richtige das umzubinden ist das git mv muss du machen so wenn jetzt dasmacht nach blub 2 und an geht status machte dann sagt er renamedexcellentso muss man das machen tormox ich hoffe das hatte geholfen falls je nachdem wieviele unbenennt und unbenennt willst aber das bringt was so wenn ihr das mitrename macht dann ist nämlich auch die history in takt ich zeige euch noch malwas was man jetzt machen kann was ultra praktisch ist was wasso was auch was auch sehr praktisch ist wenn man jetzt hier reingeht in in denordner und sagt okay ich meine meine history ist jetzt relativ überschaubaralso meine history hat jetzt zwei kommets da ist jetzt ist jetzt nicht soviel wir brauchen mal wir brauchen mal den git repo wo mehr committed ist wasnehmen da jetzt kommt mir nicht mit dem linux kernel etwas mittel mittel großesview gs github klonen wir jetzt mal da kann ich euch nämlich ein bisschen waszeigen aber nämlich ein repo wo ein bisschen mehr dran ist da kommen zwarnix da kann man zwar nix comitten was also excellent verzeichnissen habenwenn noch so auskommenda wird sich mein review freuen dass nicht so viel rot und grün ja und nachdemich bei uns ja der hauptsächliche reviewer bin freue ich mich bei sowas auchso also wir haben jetzt mal das view gs repo geklont und was auch sehr praktischist wir machen jetzt mal ein bisschen bisschen git match die kann ich euch einbisschen was zeigen ich meine es muss ja irgendeinen sinn haben dass ich denganzen tag diesen kram macht so wir nehmen uns jetzt mal in die in diedatei aus wie zum beispiel die ritmi ritmi hat ja fast jeder hat ja fastjeder im repo im root verzeichnis liegen außer wir natürlich bei uns gibt beiuns liegt keine ritmi datei im root verzeichnis bei uns liegt nur einechange log datei im root verzeichnis wo man nachgucken kann zumindest wenn manjetzt nachgucken möchte was hat sich alles an dieser datei geändert und werhat alles was an dieser datei gemacht da gibt es zwei varianten ich zeige euchmal eine variante die ist zwar nicht so schön aber die ist bei anderen sachenganz praktisch ihr könnt sagen geht lock minus minus name only und dann seht ihralle commits inklusive den dateien die angefasst wurdendas ist ganz praktisch für ein bisschen überblick verschaffen willwas hat sich denn in den commits getan weil normalerweise sieht ein lock ja soaus da sieht man nicht was sich geändert hatso man kann nur angeben da sieht man auch zuletzt lichter was sich geändert hatwenn man es ganz genau machen will macht man auch minus p dabeiach das geht mit name only wohl nicht zusammen okay da kriegt man nämlich nochdas diff das ist eigentlich so eine sache die ich mir am tag 20.000 malangucken da kriegt man nämlich auch das diff zu den endungen was schöner ist wennman rauskriegen will was sich an der datei geändert hat ist man kann einfachden geht lock auf die datei machen und dann kriegt man nur die kommets und ihrseht da sind nicht viele das view report viel mehr kommets da kriegt ihr nur diekommets die was an dieser datei geändert haben und dann könnt ihr euch das diffzu angucken und so kriegt man richtig easy raus in welcher reinfolge wer was ander datei kaputt gemacht hat das ist äußerst nützlich geht lock und dann aufdie datei machst du deine rift in der konsole ich wachte in der konsole zumgrößten teil und schreibt dann in den polo quest halt an den jeweiligenstellen was reinso nächste geschichte wollte ich jetzt noch sagen nächste geschichte was manmachen kann was man probieren kann vielleicht bringt das nämlich wer hatdas eben gefragt dem tormox auch was was man probieren kann ist wenn sachenhin und her geschoben wurden es gibt die option dass man nochminus minus follow an gibt weil ich das richtig in erinnerung habe versuchtdass solche sachen wie renaming und sowas nach zu vollziehen dass man quasialle änderungen an dieser datei nach vollziehen kann auch wenn sie umbenanntwurde ja so viel zu so viel zum datei unbedenkeneben geht es gibt ich wie gesagt ich kann euch da jetzt noch 100.000 100.000andere geschichten zeigen ja vielleicht zeige ich das mit dem stash noch malvielleicht zeige ich das mit dem stash noch mal ich das sehr under just findedeswegen gehen wir noch mal unser test repo zeigt das mit dem follow noch malein tester gut da können wir nämlich mal ausprobieren ob das überhaupt stimmt was icherzählt habe also probieren wir mal aus geht plupp 2sagen wir mal hier move cute chat nach cute cute chat 2 geht status aber mag ernicht werden wir das ganze comitten das ganze bis big brainguck da hat sogar schon gecheckt dass ich renamed hab da ist nicht blöd weil sichnichts geändert hat in der zeit jetzt kann ich gar nicht zeigengut passt na gut an der datei hat sich ja so im momentmein follow guckt seht ihr es funktioniert wenn ich ihn geht lock auf die datei machtfindet er nur vielleicht muss man das noch mal deutlicher deutlicher zeigenwenn ich ihn geht lock macht auf die datei dann findet er nur das letztekommet warum findet er nur das letzte kommet weil ich ja nur in diesem kommetdiese datei überhaupt existiert mit dem namen oder weil diese datei erstüberhaupt ab diesem kommet existiert aber wenn ich den minus minus followdran machen dann versucht er auch renames nach zuvollziehen und ihr seht ok die datei hier heißt die cute chat 2 jetzt noch cutechat 1 aber er verfolgt das ganze hinterher so man könne es natürlichauch name only dran machen dann sieht man auch aha hier war es cutechat 2 und hier war es noch cute chat 1 das heißt die hat einfach eine nichtrichtig renamed die hat eine nicht get moved sondern die hat einer get hateiner moved auf dem fallsystem das ist das ist ganz praktisch wenn was wennwas nachvollziehen muss und das wichtigste kommando ever um sache nachzu vollziehen können das mit dem stash zeige ich euch gleich die die die diewichtigste sache um nachzuvollziehen können wer es verkackt hat ist ist undbleibt das da geht play zeigt euch an wer in welchem kommet diese zeile inder datei hinzugefügt hat beziehungsweise zuletzt editiert hatsieht sehr unübersichtlich aus da kann ich euch empfehlen das tatsächlich nichtauf der konsole zu machen sondern in dem editor oder so aber hier sieht mankomplett wer was gemacht hat in der datei also wir sehen zum beispiel dassihr den dennis oben das angepasst hat dann hat er der avenue das ist deroverview js mann ich finde es übrigens geil dass ich das dass ich avenuespricht also so wie so eine straße quasi der das hier angepasst und sofindet man in kombination mit dem normalen lock und follow auf die dateiziemlich schnell raus wie man wie man was machen kannes gibt noch ein paar übelst abgedrehte tools um rauszufinden wann was kaputtwar da gibt es noch hier geht bisect und sowas das da will ich jetzt nicht sosehr ins detail gehen das ist aber auch gerade für leute die so was machenmüssen wie ich öfters mal rausfinden wer es an welcher stelle kaputt gemachthat beziehungsweise welcher kommet es kaputt gemacht hat ist das hier einesache die man sich mal merken sollte das halbiert einfach immer die historybis da fehler gefunden wurde das können wir irgendwann anders machen das istjetzt ein bisschen ein bisschen zu viel genau und ich wollte euch das mit demstash noch mal zeigen weil das mit dem stashäußerst äußerst praktisch ist so wir gehen jetzt mal von aus wir macheneinen neuen wir haben einen neuen bratsch obwohl davon hat geantwortetwo davon müsste gerade geantwortet habenwo bitte melde dich dazu direkt noch mal per p.m. da können die zuständigenkollegen sich direkt soll ich jetzt soll ich jetzt ich schreibe jetzt ichschreibe jetzt das hier alte mmo alte mmo gewohnheit ich schreibe jetzt das indie p.m. meld was soll ich denn sonst noch schreibe ich findene ne ne die können ruhig du sagen ich sagte das juckt mich überhaupt nichtdie sollen den scheiß beheben die haben nette support grills die dürfen ruhigdu sagen das ist okay ja ich schicke das noch dabeiok zack moment ich muss wundervon p.m. ich muss wundervon p.m. schickenwo ist meine p.m. dieses twitter das twitter layout im browser wenn es zukleines da findet man auch überhaupt nix nachrichten wundervonokay ich habe jetzt geschrieben meld was soll ich sonst machengut weiter im text um 10 macht das support der support hat bestimmt feierabenderwarte ich heute abend jetzt auch nix so also stash wollte ich zeigen so wasauch was finde ich eines der under justesten geht sachen überhaupt ist malangenommen man ist jetzt in irgendeinem anderen branche trennen check out wirgehen jetzt mal in den anderen branche in den eier ja das ist mein ach so minusb das ist mein eier ja feature branche haben die nicht 24 7 ich glaube derendkundensupporter mit den leuten die antworten 24 7 aber die leute diewirklich was was was fixen an den geräten die haben bestimmt auch malirgendwann feierabend also jetzt sind wir in einem anderen branche wir machenjetzt mal ein neuer teile keine hallo punkt txt so und jetzt haben wir eineuncommittede datei und jetzt kommt der chef zu uns hat wurde auch noch nie intechniker geschickt bis jetzt nicht eigentlich ist doch gar ganz gut weiler müsste den weg freiräumen dass er da hinkommt ok also ich habe jetzt eineneue datei angelegt hallo punkt txt und bin da gerade wild wild am editierentrennen und zwar ich mache hier drin zum beispiel keine liste warum c++ sagt soc plus c triple plus das ist sogar noch noch mal besser sagt so mache ich einetolle liste weil so und so und während ich am schreiben bin kommt mein chefrein nach max ganz wichtig wir müssen was hotfixen weil das ist produktiv undkaputt und sonst was ich ane ich bin auch gerade dabei mir eine liste zuerstellen dass c++ scheiße ist aber kein problem ich mache nachher weiterdeswegen sage ich jetzt geht stash akumulat zahmar cheat 95 kann das seindass ich dich vorhin in irgendeinem anderen chat gesehen habeich bilde mir ein ich habe dich vorhin in irgendeinem anderen chat gesehen inirgendeinem anderen programmier streamdings hier von von von einem gott von einem deutschen spiele programmiererder sich darüber ausgelassen hat wie scheiße es in deutschland in der spieleszene zu arbeiten ich andi def genau ja ja stimmtdann warst du das ok ich wusste ich dachte mir der name kommt mir irgendwiebekannt vor ich habe das sogar rumgespammt vielleichtdass mich auch gesehen so als ob max den andi def klar habe ich vorhin reingegucktso wie gesagt schäfer da gesagt jetzt müssen wir uns unbedingt machen aber ichkann ja eigentlich gar nicht weil ich bin ja gerade dabei diese diese meineliste zu editieren warum c++ sagt was ich jetzt nicht machen will ich willjetzt noch kein kommet machen weil das ist ja noch gar nicht fertig also wasich jetzt mache ist geht es also übrigens eine sache doch und das istdas was viele auch verkacken wenn jetzt ein get checker und master macht nimmtgeht das standardmäßig mit also sprich die änderung die ich in dem anderenbranche angefangen habe nimmt damit so und das verwirrt viele leute so was manjetzt machen kann ich edde die datei erste mal also dass das habe ich dashabe ich schon gemacht dann sieht man nämlich schöner ok und was ich jetztmachen kann ist ich möchte jetzt diese datei erst mal weg haben aus meinemworking directory und nachher weitermachen also sage ich gibt's dassiehst du bem datai ist weg jetzt gehe ich in master da soll ich ja was fürmein chef machen und zwar soll ich hier cute chat 2 editieren da mussunbedingt eine 4 hin weil der vorstand hat angerufen hat gesagt das muss mitvier enden weil es muss durch zwei teilbar sein sonst ist die anzeigeraus und dann machen wir daserkommitten wir das mit einer super tollen kommet message kappa poch hdund dann sind wir fertig und jetzt wechseln wir zurück in unseren anderenbrancheund wollen weitermachen unserer z plus plus liste das problem ist jetzt wirhaben die ja gestascht also die ist ja gar nicht mehr dadeswegen sagen wir jetzt einfach geht stash pop und schon seht ihr ist dasganze wieder da und wir können genau an der gleichen stelle weitermachen wo wirvorhin aufgehört haben so sieht es aus also hallo andy deralso so könnte das einfach in eurem git repo machen wenn der chef reinkommt undsagt danke für die erwähnung wie kommste ich habe bei mir im chat geradeden cheat 95 wieder erkannt und habe ihn gefragt ob ich ihn nicht vorherirgendwo in dem chat gesehen habe oder hat er gemeint ja war andy der stimmtgenau so sind wir auf die ganze geschichte geklappt ich wusste ichwusste nicht mal genau wie der channel heißt ich habe gesagt ich war vorhin ichhabe dich vorhin in dem channel gesehen bei einem deutschen spiel entwicklerdass ich drüber aufgeregt hat wie scheiß ist in deutschland spiel entwickler zusein da hat er cheat gemeint das muss andy der gewesen genau ja ich habevorhin mal die ganze science and technology kategorie ein bisschendurchgekuckt auf tritt schon ist mir aufgefallen dass es mittlerweile dochrecht viele deutschsprachige channels in dem bereich gibt es also viele vierstück im vergleich zu frühernee das war ich ich fand das gut ich es gibt auch so dinge ich habe auch sodinge wo ich mich wo ich mich übelst übelst einfach einfach dringern lassechat sagt man was gibt es denn da so gefällt gerade nichts ein aber es gibtdinge die muss ich auch jeden stream bestimmt dreimal erzählent plus plus richtig richtig t plus plus triggert mich auch immer jawo davon und wo davon auch ja und java stimmt was ich hier mache aktuellehrlich gesagt gar nichts ich habe gerade versucht den leuten irgendwiepagittricks zu er zu zeigen aber eigentlich wollte ich nur gucken obwo davon wieder funktioniert und ich hatte für diesen stream heute absolutkein plan was ich machen sollte ehrlich gesagt jaja wo davon hat geantwortet mal gucken ich habe vor davon auch gar vonschau mal was rauskommt was erzählen mal an die deft diegeschichte mit dem bahn klo das putet auch gar nicht das kann ich das ist diebahn triggert mich auch oft du programmierst wohner vorn oder zumglück nicht zum glück zum glück prokramiert nicht an wohner vorn rumwo fuckach ja und solche nachrichten triggern mich auch auf der arbeite hatten was auchgerade von jawo davon plus plus hör mal auf also wenn man zwei sachen verbinden könntedie wo davon plus plus das passt eigentlich ziemlich gut zusammen dassind zwei zwei sachen die sind zwar komplett passen überhaupt nichtzusammen auf den ersten blick aber die haben sehr viel gemeinsamkeiten sitztder hast tiefer gegen wo davon oder gegen die bahn also man muss sagenexterne berater triggern auch ja externe berater triggern mich auchmanchmal man muss sagen ich hasse weder wirklich also hassen ist ich hasseweder wo davon noch die bahn die regen mich manchmal auf aber vonhassen das würde ja bedeuten dass ich dass ich irgendwie persönlich irgendwasgegen gegen den typ ab der in der bahn tickets kontrolliert also das ist janicht so die können ja für den ganzen mist auch nichts genauso wenig wie dieservice mit arbeiter hier bei wo davon irgendwas können wer dafür was kanninternet in deutschland ist auch so ein thema was mich was mich übelst triggernoftmalsja macht deine augenweite ist denn also wie gesagt ich hasse weder die bahn nochnoch wo davon noch sonst was vor allem schon gar nicht die mitarbeitermitarbeiter irgendwie von da von der bahnach moment war an die def jetzt mit mit seinem stream live in meinem stream oderwas das war jetzt aber stream stream section nun gut um was oder eigentlichzurückzukommen wie gesagt ich hasse ich hasse die nicht ist schon schon ich habschon mal gar nichts gegen die gegen die service mitarbeiter oder so wo ich wasgegen hab ist zum beispiel der internet ausbau in deutschlandder geht mir echt auf den sack beziehungsweise was wir hier mit unsererinfrastruktur machen und das ist so ein thema das haben wo davon und die bahngemeinsam beides ist irgendwo infrastruktur und beides istinfrastruktur da was eigentlich für die sagen wir mal sagen wir jetzt mal hochhochgesteckt sagen wir jetzt mal für die menschen im land da sein sollte jabeides versucht geld zu verdienen und und meiner mein nach wo davonja wo davon ist da fast auf fast das meine ich noch noch mehr berechtigtgeld zu verdienen als die bahn weil ich finde gerade zur mobilitätsinfrastruktur genauso wie krankenhäuser und sowas soll nicht primär dafür dasein um gewinn zu machen sondern quasi um die um die leute zu versorgen beiwo davon muss ich sagen okwo davon darf schon das aus meiner sicht das ganze schon darauf auslegen gewinnzu machen aber es gibt ja oftmals gar keine alternativendie leute haben entweder den telekom oder wo davon was anderes gibt es nichtund deswegen fehlen da auch die nötigen vorgaben irgendwie du kannst indeutschland so eine kacke anbieten und die leute müssen es kaufen weil was hastdu denn für eine auswahl ich bin ja quasi schon gesegnet im endeffekt hastdu zufällig das neue video von simplicissimus gesehen die habe ich nichtich bin ja relativ gesegnet was das ganze angeht noch ich meine ich kann ichhabe die auswahl zwischen voter von 440 ab was macht die cia in frankfurtnee was denn bei was bei was soll ich gucken vier minutendas wohl wo steht hier vier minuten vier minuten 30in frankfurt ist das größte us konsulat der welt perfekt um camp aufzuschlagenwenn man dann zum beispiel den französischen präsidenten belauschenwill setzt sich ein cia agent einfach in frankfurt in einen zug und kommt nichtan er wieder aus weil die bahn nicht fährt undversteht was wir meinen genauso ist es so sieht es ausirgendwie erinnert mich die stimme von dem wissen wir nämlich erinnert das istmir das fällt mir jedes mal auf wenn ich die die videos von ihm anhöreperfekt um camp aufzuschlagen er erinnert mich übertrieben an ihn hiervon der stimme her falls sie nur irgendjemand kenntdie fordernden spielberichterstatter mit nah mit seiner youtube stimme vielleichtweniger aber wenn man so mit ihm im skype gelabert hat hat sehr ähnlichangehört freiheitsliebende auch sozusagen so und damit sage ich malherzlich willkommen habe heute finde ich auch schon angekündigt also ein bisschenein bisschen aber wenn er normal redet und nicht seine commentary stimme amstart hat dann dann hört sich das wirklich ziemlich ähnlich andirekt übertragen nicht gleich erst mal zur linken seite der karte wir könnenmal sagen hier das hat schon hat schon gewisse ähnlichkeit ja oh gott nochskalli ja stimmt stimmt ist blöd dass so viele leute weg sind so das habe icheuch ein bisschen jitt jitt magic gezeigt zum abschluss hier nochbeenden wir die eine frage noch dass ich nächsten striem nicht wieder davonanfangen muss nämlich das hier was das in bau gefragt hat wie das bei mirdaheim aussieht mit mit mit home office wie gesagt ich habe mich jetzt einbisschen über git geschichten ausgelassen leute dies verkacken so dakommen natürlich noch ein paar andere sachen dazu es kommen irgendwelchetäglichen meeting geschichten dazu da gibt es wartungsarbeiten runden undund von unserem service 24 sieben support es ist kein 24 sieben supportnicht das stimmt so nicht von unserem monitoring team da haben wir einmal imtag eine runde wo ich mich dabei hocke dann haben wir ab und zu team runde dahaben wir irgendwelche abteilungs runden also es wird es wird öfters wird öftersmal gemietet und da gibt es manchmal tage da hast du wirklich fünf sachenwurde ganz nach nichts anderes macht außer sinnlos mieten das sagt natürlichaber was willst du machen letztendlich wenn man unter demstrich betrachtet ich habe ich habe aufgehört mich da so so extrem darüberaufzuregen wenn zu viel gemietet wird weil ich denke mir die haben die habenzwei sachen zur auswahl die können mich dafür bezahlen dass ich was sinnvollesmache oder die können mich dafür bezahlen dass ich rum sitze und nixmache also und wenn man die wahl hat und man wählt ich soll rum sitzen und nixmachen ist das auch vollkommen in ordnungvollkommen in ordnung er schied 95 da ist er rechtja zu zählen zum thema merckst du jetzt bin ich ja noch gar nicht gekommen sound dann kommt ganz drauf an was an diesem tag ansteht gibt es irgendwelcheneue releases müssen irgendwelche sachen getestet werden müssen irgendwelchesachen gehort fix werden müssen irgendwelche sachen dokumentiert werdenmüssen vielleicht vielleicht irgendwelche automatisierung sachen ein bisschen umgeskriptet werden oder sonst wasirgendwas was halt in meinen bereich noch fällt gibt es vielfältige sachen diesein können das mache ich den restlichen tag über ja ja leider leider muss ichsagen ist in letzter zeit ich habe es ja schon mal gesagtleider ist in letzter zeit ein bisschen wenig selbst programmieren angesagtleider ist ein bisschen wenig selbst programmieren angesagt so die letztist eigentlich schon die letzten paar jahre so aber was ich so aber dafür habe ichdie da dafür habe ich ja den chat und mein rumgebastel hier auf twitchda muss ich dann nichts mehr programmieren was ich letztensgebastelt haben was weiß ich was ist was tatsächlich ganz cool ist unser supportvon dem ich gerade erzählt habe unser monitoring anguck team ich kann ich kannich kann nicht wirklich sagen wie das team heißt weil das ist ein ziemlichunik name den sonst keiner verwendet also wir haben ein team das ist quasi quasiso es ist nicht wirklich eine art es ist nicht wirklich in first level aber ichbeschreibe ihn mal als first level wir haben ein team das hat so ein operationcenter ist das quasi ja können operation center nennen die haben allemonitorin mann gucken ob da irgendwelche monitorin geschichten aufschlagen objetzt irgendwelche fehlermeldung kommen und dann leiten sie halt die notwendigeentstörung und koordination in die wege ja so operation hauptquartier so wasin der richtung genau und jetzt habe ich vergessen was ich damit genau und dakommen manchmal leute auf die glorreiche idee dort etwas brain debtaufgaben abzuladen weil so nach dem motto ok die sind eh 24 7 da das heißtman kann da auch die unnötigsten aufgaben wo man keinen bock hat sich drumzu kümmern hin hin verlagern so und wir haben einen externen anbieter für spamfiltern wir filtern zwar intern auch mal spam aber wir haben noch einen externenanbieter weil unsere reputation für mail relay nicht gut genug ist da sindvergleich spam wir machen das über den externen anbieter zumindest ist der mailfilter von dem externen anbieter ein bisschen sehr scharf eingestellt und eskommt vor dass mails die quasi kunden bei uns verschicken über unser systemdass die als spam klassifiziert werdenund die landen dann im spam ordner und die kann man relativ einfach erkennenanhand der absender adresse so und da kam jetzt irgendjemand auf die idee undmusste entscheiden ok wir geben das unseren programmierern die das malordentlich programmieren dass das spam system nicht so viele anhaltspunkte fürspam findet und die mails gar nicht im spam ordner landen das war das war diedas war die eine möglichkeit die zweite möglichkeit war wir geben das unserem24 7 support dass der einfach fünf mal am tag ins web interface geht und spam vonhand frei gibt ratet mal für welche variante man sich entschieden hat für diefive hat variante richtig warum trendet festsplatte eigentlich wattmanagement genau also die hatten den auftrag sie müssen das ganze siemüssen das ganze manuell von hand frei geben was natürlich ziemlich sagt habeich mir gedacht ok tun wir den mal gefallen und basteln was was was ihnenhilft das war eines der sachen die sie letzteseinmal wirklich wieder programmiert haben und zwar habe ich was kleinesgebastelt dort net core weil wenn ich eigene projektemacht die wodurch dran beteiligt mir ganz ohne problem in dort net core machenda muss kann ich ja was nehmen was womit ich klarkommen womit kein andererklarkommen muss habe ich dort net core projekt gemacht so dass es halt auchunterlinungs läuft und hab das automatisiert so funktioniert folgendermassenes ist relativ klein was hat das am ende 400 zeilen oder so also es ist rechtrecht überschaubar oder 500 ist nicht so viel ist recht überschaubar so und wases macht im endeffekt ist es nimmt nen embedded embedded chromium nimmt das hierdas dadamit kann man nämlich den headless chrome den headless chrome starten aberdu wurdest nicht beauftragt das zu machen doch wurde ich ich hab mich selbstbeauftragt indem ich zu meinem chef gegangen bin hab gesagt er soll michbeauftragen und dann bin ich zum chef gegangen vom vom support und habegesagt er soll mich beauftragen und beide haben ich beauftragt easy schonals auftrag auf geht'sdas hat ja auch nicht lang gedauert halb tache oder soja zumindest ist das ding hier echt praktisch das hat nen embedded chromiumein embedded headless chromium chrome wie auch immer also sprich man kann das aufeinem kommando zeilen system ausführen und dort in webseiten den chrome inwebseiten rumklicken lassen ohne dass man eine grafische ausgabe braucht daswas habe ich gemacht ich habe nen browser plugin genommen das user eingabenaufzeichnet hab diesen ganzen vorgang was heißt headless ohne ohne grafischeausgabe also nun chrome ohne dass du dieses fenster hier siehst aber dertrotzdem läuft und webseiten aufmachen kann den kannst du dann halt überdieses über diese programmierstillstelle steuerndas heißt du klickst da nicht das heißt du klickst da nicht hier drauf du sagstdann newtab navigate ull klick das macht das hier warte aufseitenladen so art selenium ja plus das pappertier ist kein dotnet programpappertier ist das offizielle das offizielle chromium automatisierungsdingglaube genau headless chrome node.js api 61.000 sternen hat das bem system keineapi nein sonst hätte ich es da drüber gemacht und sie haben auch nicht vorher inzukunft eine wir haben wahrscheinlich für die letzten crap anbieter gewähltoder eine kacklizenz oder was auch immer so zumindest im prinzip unter der haubehabe ich habe mitgeschnitten mit einem browser plugin was das auf der seitemacht und habe das dann ein bisschen vereinfachter form in dieses in das dotnetcore programm gepackt hat ein paar sachen drumherum gebaut das ist eineschöne log datei schreiben was es gerade macht wie viele sachen sie freigegebenhat und die premium lösung leute die premium lösung die ich eingebaut habenachdem es mit gelockt hat welchen spam es freigibt geht es und das jetzt kommtjetzt kommt absolut big brain time danach wenn es was gemacht hat lockte sich beiunserem ticket system ein wir haben wir haben so einen extra user für fürscript zugriffe lockte sich bei uns über die jira api im ticket system einsucht das letzte ticket was mit dem titel mit dem titel spam freigeben odersowas sucht das letzte ticket also ordnet sucht alle tickets mit dem titelordnet es nach nach zeit geht in das letzte ticket rein und schreibt dort undpostet dort drinnen in comment wie viele spams es gefunden hat und wo auf welcheremail adresse und wie viel es freigegeben hat und dadurch dass es indiesem ticket benachrichtigt gibt es automatisch den alert vorne auf dermonitor wand dass das ticket geupdatet war das heißt alles was die leute nochmachen müssen ist zu warten bis das script alle 15 minuten einmal gelaufenist das ticket geupdatet hat und dann können sie sagen ok alert ist da siegucken das ticket rein gucken sich den reporter machen das ticket zuklickenjagibt es die premium lösung auch erst nach einem in app in store sollte ichvielleicht mal überlegen sowas ja fati schreibt schreibe aktuell einpappetier script welches datum aus der excel datei unsere sap zeit erfahrti geht also da sieht man schon mal dass beide scheiß software ist weil wenn manweil wenn man das über den umweg eines headlesschrome's machen muss ist entweder das zielsystem kacke oder dasquelsystem kacke dein script ist bestimmt gut ja aber allein schon dassman sowas dafür braucht ist absolute brain dead und wie entscheidet das script waswas spam ist das ist ganz einfach das entscheidet es auf dem gleichen weg wiedas ein menschlicher freigeber entscheiden würde nämlich alles wasvon einer speziellen email adresse kommt wird freigegeben und wir haben auch schonwir haben auch schon den übelsten mist freigegeben ich kann mich noch dranerinnern also die anweisung ist klar die anweisung die die haben ist jede maildie dort mit dieser email adresse mit dieser mit diesem wildcard filter im spamordner landet muss freigegeben werden da steht ganz klar eine arbeitsanweisungfür die leute drin und eines tages kann der stelle auch noch mal zähleneines tages wurde sich ein bisschen darüber beschwert weil irgendeiner eineharry pussy mail gekriegt hat und die wurde natürlich auch freigegeben ausdem spam ordner oder hat er sich beschwert dass er eine harry pussy mailgekriegt hat und da haben wir gesagt ja gut also was heißt wir der support dasoperation center wie auch immer man das endbar hat gesagt die die anleitung istklar alles freigeben mit dieser email adresseund genau das gleiche macht man skript kann man da keine regeln auf nein kannman nicht das das ist wirklich das spam anbieter das webinterface ist derletzte krabbok leute fragen sie mit gelockt was habt ihr für den ticket system hierwusstest du dass die nase apis anbietet nee leute ich gucke mir die fragenächsten mal an ich wollte ja eigentlich nur checken obwo davon funktioniert wir feststellen dass wo davon nicht funktioniert wasden baro was meinst du was haben wir uns vorgestellt hat wiewir so haben sich so was die kollegen nicht selbst geschrieben ich glaube dasist recht recht simpel entweder war keiner da das konnte oder dieskorten hatten kein bock gehabt also ich tipp mal drauf dass das für unseren fürdie meisten leute die dort im operation center support arbeiten nicht unbedingtdas skill set ist was sie besitzen das habe ich jetzt schön ausgedrückt oderfür die meisten können es nichtich sage nicht wie das beim anbieter heißtsebaro das oben geschrieben was wir uns darunter vorstellen ja was genau habtihr euch da eigentlich vorgestellt was wollt ihr bautdie entwicklung des archivs ich habe mir da noch gar keine gedanken drübergemacht aber das schreiben wir jetzt mal in stream ideen reinwo plus punkt tv archiv einfach eine suchmaskeirgendwas eine suchmaske und fast wo du einfach hochladen kannstwas ich da habe ich habe mir noch wenig gedanken drüber gemachtdiscord ja wir haben einen discord noch mal ausgleichen discordja ich weiß dass es alles in google drive hofft das macht aber nix das istok wir machen einfach ein upload wir machendann einfach dann ab den upload fällt für dich da kannst du kannst du ingoogle drive hochladen du kannst in google drive hochladen muss danach haltirgendwie einfach den link den link irgendwie mal irgendwo rein pasten unddann dann liest er sich das den titel aus und schreibt in irgendwie in esgleich datenbank oder irgendwas mal guckenleute ignoriert das was im chat steht wenn in discord kommt geht nicht in denweep spam channel das ist mein ernst das ist hochgradighochgradig verstörend also das erste ich muss ja einmal im tag in den weepchannel gucken weil ich halt den channel markieren muss für gelesen und daserste was man da sieht sind irgendwelche hentai tentakel titties und zeugs undalles also das wollen wir nicht sehen als erstes im chat wer sehen willdanach kann sich das angucken guckt da nicht rein guckt euch dieanderen channels anrechts links stumm schalten ja ich weiß das mache ich zum größten teil auch cutecontent jeder jeder wie er will für die für die weeps unter euch ihr wisst jadass ich eigentlich seltenst irgendwelche animes oder irgendwelchejapanischen japanischen content konsumiere aber ich muss sagen ich habewirklich in anime geguckt letztens und zumindest die ersten drei folgen undund noch nicht mehr aber ich werde wahrscheinlich noch fertig gucken jaselber stellen es vor tatsächlich tatsächlich kein kein porn was normalesdinks hier wie heißt das into abyss oder so dass er das heißt letztensamazon prime gesehen da rief es auchansonsten gucke ich ja gucke ich ja wenigso leute wir sehen uns ich muss jetzt echt pennen morgen wahrscheinlich wiederstreamen bisschen technik kram dann heute war ja nur einfach so random wir sehenuns macht's gut bis den chat weiß was wir horsten jetzt denan die def komm wir horsten jetzt den an die def oder kommen wir an die an diedef vor an die def an die def vor an die def den ort in den reiten auswärts kommt der hat's verdientratehallogeht das bauisch der rate ist kaputt bei mirder rate ist kaputt bei mirich kann den rate nicht auslösenich kann eigentlich ich sehe das fenster nicht um den rate auszulösenich muss auf meinen chat neu ladenah jetzt jetzt geht's jetzt geht's ok leute wir sehen uns bis zum nächstenmal macht's gut zu", "segments": [{"id": 1, "start": 150.0, "end": 172.16, "text": "So, auf geht's!"}, {"id": 2, "start": 172.16, "end": 182.72, "text": "Ah, exzellent. Ähm, ah guck mal da, der Sebaru ist auch da. Ich hab jetzt grad den"}, {"id": 3, "start": 182.72, "end": 184.92, "text": "Chat refreshed, ich hab gar nicht gesehen, wer alles da ist."}, {"id": 4, "start": 184.92, "end": 203.2, "text": "Wahrscheinlich die üblichen Verdächtigen. Der geht immer. Der geht echt immer."}, {"id": 5, "start": 203.2, "end": 209.36, "text": "Äh, was ich grad noch im Chat gesehen hab, ist, irgendjemand hat gefragt, wie das mit..."}, {"id": 6, "start": 209.36, "end": 215.64, "text": "Ich weiß nicht, ob ich noch ein paar Voter davon bin oder ob ich schon die Fritzbox bestellt"}, {"id": 7, "start": 215.64, "end": 220.76, "text": "hab, hat irgendjemand gefragt. Ja, also ich hab die Fritzbox noch nicht bestellt, weil"}, {"id": 8, "start": 220.76, "end": 226.88, "text": "der Covid Simulator, ja genau, den brauchen wir jetzt noch unbedingt. Ist eh schon alles"}, {"id": 9, "start": 226.88, "end": 232.72, "text": "voll mit Nachrichten und Leute, die die ganze Nacht nur über Covid labern. Hab ich euch"}, {"id": 10, "start": 232.72, "end": 237.2, "text": "eigentlich erzählt, dass ich mir versucht hab Covid, dass ich mir, langsam Max, dass"}, {"id": 11, "start": 237.2, "end": 242.44, "text": "ich mir versucht habe, also mega big brain move eigentlich, dass ich mir versucht habe"}, {"id": 12, "start": 242.44, "end": 251.88, "text": "Covid 20 und Covid 21 Usernamen zu sichern und Domains zu registrieren. Hat leider nicht"}, {"id": 13, "start": 251.88, "end": 255.0, "text": "geklappt, die waren schon alle weg. Ich hab gedacht, das bleibt jetzt noch eine Weile"}, {"id": 14, "start": 255.0, "end": 265.32, "text": "erhalten, also registrierst du dir mal covid20.de, covid21.de, covid21.biz. Sogar fucking covid20.biz"}, {"id": 15, "start": 265.32, "end": 275.8, "text": "ist belegt. Nee, nee, nee, die hab ich nicht. Die mit Bindestrich, das war irgendeine komische,"}, {"id": 16, "start": 275.8, "end": 282.92, "text": "was war denn das? Covid-20.best, das ist ja die bescheuertste Domain dafür überhaupt."}, {"id": 17, "start": 282.92, "end": 303.48, "text": "Punkt best. Ja, also zum thema, zum thema Fritzbox. Ja, also zum thema, hab ich die gar nicht"}, {"id": 18, "start": 303.48, "end": 314.12, "text": "in Eingang. Welche wollte ich kaufen? Die da, die da wollte ich kaufen. Genau, aber nicht"}, {"id": 19, "start": 314.12, "end": 319.32, "text": "auf lager, na super, jetzt hab ich's verkackt, kann ich nicht mehr kaufen. Nein, danke. Also"}, {"id": 20, "start": 319.32, "end": 326.28, "text": "zum thema Fritzbox, ich hab mir noch keine Fritzbox bestellt. Das liegt nämlich daran,"}, {"id": 21, "start": 326.28, "end": 333.88, "text": "dass ich den Vodafone geantwortet hab. Stell euch das mal vor. Und die haben sich aber gedacht,"}, {"id": 22, "start": 333.88, "end": 345.12, "text": "ich les euch mal vor, ich les euch mal vor, was Vodafone geantwortet hat. So, ich muss"}, {"id": 23, "start": 345.12, "end": 370.68, "text": "mal messages aufmachen, Vodafone hat geantwortet. Ähm, oh nee, geh weg, C++, ah, weg. So, also,"}, {"id": 24, "start": 370.68, "end": 378.36, "text": "Vodafone hat geschrieben, blablabla, lieber, lieber Kunde Unity Media Etc. Vodafone, willkommen"}, {"id": 25, "start": 378.36, "end": 382.56, "text": "bei uns, blablabla, wir haben ihr Anliegen aufgenommen und melden uns schnellstmöglich"}, {"id": 26, "start": 382.56, "end": 386.4, "text": "bei ihnen, vielen Dank für die Geduld. So, und dann kam gestern noch ne Nachricht gleich"}, {"id": 27, "start": 386.4, "end": 395.44, "text": "hinterher, ähm, lieber Kunde, ihre Störung wird durch ein externes Störsignal in ihrer"}, {"id": 28, "start": 395.44, "end": 406.56, "text": "Nähe verursacht. Da hab ich mir schon so gedacht, klingt mal wieder nach Ausrede. Ähm, bitte"}, {"id": 29, "start": 406.56, "end": 410.56, "text": "haben sie noch etwas Geduld, wir melden uns, sobald die Störung beseitigt wurde, vielen"}, {"id": 30, "start": 410.56, "end": 418.92, "text": "Dank für ihr Verständnis. Danach hab ich nix mehr gehört von Vodafone und heute Morgen"}, {"id": 31, "start": 418.92, "end": 423.76, "text": "kam ne Mail, ob ich nicht an der Umfrage teilnehmen möchte, wie zufrieden ich mit dem Kundenservice"}, {"id": 32, "start": 423.76, "end": 431.56, "text": "bin. Also, ich hab's nicht ausgefüllt, weil ich hab keine Ahnung, ob das Problem weg"}, {"id": 33, "start": 431.56, "end": 438.36, "text": "ist. Es wär ja nicht schlecht, wenn sich irgendjemand, irgendjemand gesagt hätte, ok, es ist abgeschlossen,"}, {"id": 34, "start": 438.36, "end": 446.2, "text": "wir, sie können jetzt wieder normal benutzen oder so, ne? Vodafone gedacht, nein. Das ist..."}, {"id": 35, "start": 446.2, "end": 458.36, "text": "Hatsi, haben sie sich gedacht, ja? Aber trotzdem, es klingt halbwegs plausibel, mal gucken,"}, {"id": 36, "start": 458.36, "end": 465.2, "text": "mal gucken, wir werden es ja sehen, Leute, wir werden es ja sehen, ob, ähm, dompc sagt,"}, {"id": 37, "start": 465.2, "end": 470.88, "text": "Störsignale gibt es oft bei Kabel, wo kommen die dann her? Ich muss bei Kabel immer daran"}, {"id": 38, "start": 470.88, "end": 480.52, "text": "denken, wie man früher noch bei, kennt noch jemand, kennt jemand noch diese Dinger? Hat"}, {"id": 39, "start": 480.52, "end": 487.92, "text": "das noch irgendjemand mitbekommen, der so in meinem Alter ist? Was Störsignale, muss"}, {"id": 40, "start": 487.92, "end": 498.16, "text": "jemand daran denken, wenn einer so ein Ding nicht aufgesteckt hat? Das ist, das ist hochgradige"}, {"id": 41, "start": 498.16, "end": 504.44, "text": "Boomer-Technologie hier, das Ding, zumindest was Netzwerk angeht. Damals hat man, ähm,"}, {"id": 42, "start": 504.44, "end": 507.96, "text": "Oszilloskop hat einen BNC-Stecker, das ist auch noch sowas, was ich irgendwann mir mal"}, {"id": 43, "start": 507.96, "end": 511.44, "text": "eins holen wollte, ich weiß noch nicht genau, was ich mitmachen soll, aber so ein Oszilloskop"}, {"id": 44, "start": 511.44, "end": 518.96, "text": "hätt ich auch mal gern. Also, und, ähm, muss ich noch was für, was man damals hat,"}, {"id": 45, "start": 518.96, "end": 524.12, "text": "ist BNC und T-Stück, weiß gar nicht, wie das Ding auf Englisch hieß, das war zu Zeiten,"}, {"id": 46, "start": 524.12, "end": 528.84, "text": "da hab ich die Sachen noch nicht auf Englisch gesucht. Oh, guck mal, gibt's ja immer noch,"}, {"id": 47, "start": 528.84, "end": 536.32, "text": "BNC-T-Stück. Ja, hoho, das hat man früher an die Netzwerkkarte gemacht. Also, das kam"}, {"id": 48, "start": 536.32, "end": 541.96, "text": "an die Netzwerkkarte, auf der einen Seite kam so ein Abschlusswiderstand hin und auf"}, {"id": 49, "start": 541.96, "end": 549.04, "text": "der anderen Seite das BNC-Kabel zum nächsten Netzwerkkabel. Das war, das war wirklich,"}, {"id": 50, "start": 549.04, "end": 554.84, "text": "ziemlich ja kacke. Hier sieht man's mal, wie das aussah mit dem Netzwerkkabel. 10Base2,"}, {"id": 51, "start": 554.84, "end": 566.76, "text": "wusste gar nicht, wie der Kram heißt. Gab's dafür eigentlich auch Switche? Widerspricht"}, {"id": 52, "start": 566.76, "end": 574.8, "text": "zwar eigentlich dem Sinn, aber man weiß ja nie. Gab es, gab es, äh, 10Base2-Switche,"}, {"id": 53, "start": 574.8, "end": 591.6, "text": "gab's sowas? Scheiße, sowas gab's wirklich. Ach du große Kacke. Sowas gab's, aber das"}, {"id": 54, "start": 591.6, "end": 603.52, "text": "sieht genauso boomer aus, wie die Leute, die den Kram noch verwenden. Oh Mann. Du hast"}, {"id": 55, "start": 603.52, "end": 614.72, "text": "ein USB-Osteloskop aus, aus China. Aus China, sozusagen. Ein Osteloskop aus China und taugt"}, {"id": 56, "start": 614.72, "end": 630.52, "text": "das? Na, man könnte damit doch ohne Probleme den Switch machen. Einfach 1 zu 1 Verbindungen"}, {"id": 57, "start": 630.52, "end": 642.16, "text": "damit machen. Ist zwar bescheuert mit dem Medium, aber warum nicht? Täglich bei STI-Kameras"}, {"id": 58, "start": 642.16, "end": 651.04, "text": "hat es schon nie in der Hand. Kabel kann auch den Mobilfunk stören. Echt. Die Technik"}, {"id": 59, "start": 651.04, "end": 664.56, "text": "wird mir immer sympathischer. Ähm, ich wollte dann eigentlich schon viel früher anfangen."}, {"id": 60, "start": 664.56, "end": 668.36, "text": "Ich hab den Streamtitel irgendwie geändert vor 3 Stunden und dann hab ich noch gedacht,"}, {"id": 61, "start": 668.36, "end": 671.56, "text": "ach komm, ne halbe Stunde Stream guckste noch, fängst dann irgendwie so 18 oder sonst was"}, {"id": 62, "start": 671.56, "end": 677.0, "text": "an und dann bin ich bei, äh, bei Daffran, Daffran, Alter, Daffran oder wie er jetzt"}, {"id": 63, "start": 677.0, "end": 683.28, "text": "genau ausspricht, hängen geblieben und hab mir ein Valorant Tournament angeguckt, 2"}, {"id": 64, "start": 683.28, "end": 687.6, "text": "Runden. Und dann hab ich gedacht, gut, jetzt ist es schon 20.40 Uhr, jetzt lohnt es sich"}, {"id": 65, "start": 687.6, "end": 693.88, "text": "auch nicht mehr, aber scheiß drauf, komm jetzt mal. Jetzt mach noch mal Stream an, ja."}, {"id": 66, "start": 693.88, "end": 703.6, "text": "Und ich hab wirklich nix im Sinne heute Sinnvolles zu machen, ja. Spiele auch mal Valorant,"}, {"id": 67, "start": 703.6, "end": 708.04, "text": "ich hab kein Account, ich hab mich auch nicht registriert, ich hab kein Riot-Account, ich"}, {"id": 68, "start": 708.04, "end": 713.12, "text": "hab keine Keys irgendwie geleashed im Stream. Das Einzige, was ich machen könnte ist, darf"}, {"id": 69, "start": 713.12, "end": 718.24, "text": "man ja wahrscheinlich nicht, aber man macht jeder und der im Zweifel, also ich könnte"}, {"id": 70, "start": 718.24, "end": 727.96, "text": "auf Ebay gehen und mir ein Account kaufen. Stimmt es, dass Valorant Anti-Cheat China"}, {"id": 71, "start": 727.96, "end": 736.64, "text": "meine Nudes gibt. Was? Wie soll es das geben? Aber wenn du welche auf der Platte hast, haben"}, {"id": 72, "start": 736.64, "end": 743.8, "text": "die die mittlerweile bestimmt. Aber nicht nur, aber nicht nur die, aber nicht nur die,"}, {"id": 73, "start": 743.8, "end": 747.52, "text": "sondern die anderen auch alle, also deswegen ist das nicht so wild, es war schon verbreitet"}, {"id": 74, "start": 747.52, "end": 755.88, "text": "genug vorher. Der Tribolone ist auch am Start, Patrick ist auch da, der Nightbot ist auch"}, {"id": 75, "start": 755.88, "end": 776.56, "text": "da. xDxDxD, so, Nightbot, genau. Noch ne Idee für die Liste, keine Ahnung ob du es schon"}, {"id": 76, "start": 776.56, "end": 792.2, "text": "hast gemacht hast, Arch plus DWM. Da stellt sich mir die Frage. Bäh, Nordpad, da stellt"}, {"id": 77, "start": 792.2, "end": 812.36, "text": "sich mir die Frage, wo ist mein, naja, Windows und Dateien, ja. So, ähm, was, DWM. Was tun"}, {"id": 78, "start": 812.36, "end": 816.52, "text": "wir hier? Eine Stunde, eineinhalb Stunden streamen oder gehe ich pennen? Wir gucken uns erst"}, {"id": 79, "start": 816.52, "end": 823.28, "text": "ein paar übrig gebliebenen Fragen vom letzten Stream an, wir hatten ja mal Zeit. Äh, Tribolone"}, {"id": 80, "start": 823.28, "end": 828.0, "text": "und ich auch. Heute, ich bin heute am Main ne Runde spazieren gegangen und da war wieder"}, {"id": 81, "start": 828.0, "end": 833.12, "text": "der komplette Strand fort. Strand ist zu viel gesagt, wir haben am Main so zwei, drei Buchten"}, {"id": 82, "start": 833.12, "end": 841.2, "text": "mit ein bisschen Sand und da sitzen die ganzen Outdoor-Boomer-Pepegas rum, Wufftschmann am"}, {"id": 83, "start": 841.2, "end": 848.76, "text": "Strand und stecken sich an. Das ist, das ist auch wieder so ein Ding, ne? Irgendwie gibt's"}, {"id": 84, "start": 848.76, "end": 855.08, "text": "kaum Leute, die da noch halbwegs normal ticken im Kopf. Du hast einmal die Fraktion, so nach"}, {"id": 85, "start": 855.08, "end": 864.96, "text": "dem Motto, ähm, Bill Gates, ist der, ist der Corona-Mann oder gar, dass Vire nicht existieren"}, {"id": 86, "start": 864.96, "end": 873.08, "text": "oder alles, alles nur, äh, staatlich verorderte Fake-News, ja? Sondern hast du auf der anderen"}, {"id": 87, "start": 873.08, "end": 880.64, "text": "Seite, die sagen, ne, also, äh, jegliche Corona-Maßnahmen sind gerechtfertigt. Gibt's, gibt's eigentlich"}, {"id": 88, "start": 880.64, "end": 890.08, "text": "noch ein paar normale Leute im Kopf? So irgendwas, so Leute, die sagen, okay, wir verstehen,"}, {"id": 89, "start": 890.08, "end": 894.2, "text": "wir haben es eingesehen, dass die Lage ernst ist, aber zumindest sollte man sich mal über"}, {"id": 90, "start": 894.2, "end": 903.4, "text": "die Maßnahmen Gedanken machen. Oh, das, das ist Weep-Musik. Ach ne, das ist, das, das"}, {"id": 91, "start": 903.4, "end": 906.48, "text": "ist das Skyward Sword Intro, das ist doch keine Weep-Musik. Naja, doch, doch, eigentlich"}, {"id": 92, "start": 906.48, "end": 919.8, "text": "schon, wenn man genau ist. Wie soll der Mittelweg gehen? Ja, einfach LTE statt 5G, ist doch"}, {"id": 93, "start": 919.8, "end": 937.32, "text": "einfach. Oh, ja, die Schweizer nehmen das ernst, Patrick, wie es aussieht. Zum Türma,"}, {"id": 94, "start": 937.32, "end": 945.92, "text": "Störungen, Kabel, Mobilfunk. Aha, ist das ein Vortrag? Ah ne, ah doch. Okay, der schaut"}, {"id": 95, "start": 945.92, "end": 953.56, "text": "aus, als müsste das. Oh ne, das ist mir jetzt, der Vortrag ist mir jetzt ein Ticken, ein"}, {"id": 96, "start": 953.56, "end": 962.0, "text": "Ticken zu lange für ein Stream. Aber der hat bestimmt Ahnung, der sieht pro aus. Speichel"}, {"id": 97, "start": 962.0, "end": 973.4, "text": "mit das mal. Zum Thema Boomer-Technik, ich kenne jemand, der seine Modelleisenbahn auch"}, {"id": 98, "start": 973.4, "end": 979.0, "text": "über Relays ansteuert. Wie macht man das denn sonst aktuell? Ich habe von Modelleisenbahn"}, {"id": 99, "start": 979.0, "end": 986.28, "text": "nur wirklich keine Ahnung. Ich wusste gar nicht, dass es noch Modelleisenbahn Leute"}, {"id": 100, "start": 986.28, "end": 992.64, "text": "gibt. Der angeblich das schnellsteigende Hobby weltweit ist Drone-Racing, habe ich"}, {"id": 101, "start": 992.64, "end": 999.28, "text": "gelesen. Und das ist so ein Ding, das, das, das würde ich auch gerne mal ausprobieren."}, {"id": 102, "start": 999.28, "end": 1007.28, "text": "Drone-Racing, dann hast du eine ordentliche Brille, ja, da kannst du mit Drone-Racing,"}, {"id": 103, "start": 1007.28, "end": 1011.6, "text": "da kannst du mit Filme gucken, da kannst du mit VR-Porn gucken, da kannst du mit Sachen"}, {"id": 104, "start": 1011.6, "end": 1024.12, "text": "spielen. Ne, ich glaube mit der Brille für Drone-Racing kannst du keine Filme gucken."}, {"id": 105, "start": 1024.12, "end": 1027.16, "text": "Dafür müsstest du aber das Haus verlassen. Ja, das ist richtig, aber ich kann bestimmt"}, {"id": 106, "start": 1027.16, "end": 1035.68, "text": "auch von meinem Dach aus Drone-Racing. Seit wann ist das Chat, seit wann das Chat-Overlay"}, {"id": 107, "start": 1035.68, "end": 1041.24, "text": "so transparent ist? Das ist eine gute Frage, da erkennt man ja kaum was, oder? Was ist"}, {"id": 108, "start": 1041.24, "end": 1047.08, "text": "mit dem Chat, was ist da los? Oder erkennt man da was? Sagt mal Leute, ist das, ist das"}, {"id": 109, "start": 1047.08, "end": 1056.36, "text": "besser so oder, oder war das vorher besser mit dem, mit dem dunklen Chat? Ich muss das"}, {"id": 110, "start": 1056.36, "end": 1061.92, "text": "grad mal selbst ins Vollbild machen, dass ich da überhaupt noch was erkenne. Warte mal,"}, {"id": 111, "start": 1061.92, "end": 1069.88, "text": "1080p, etwas zu, ne, das sieht gut aus, gefällt mir. Na wobei, ne, ganz so gut sieht das aus."}, {"id": 112, "start": 1069.88, "end": 1074.72, "text": "Ich weiß woran das liegt, ich kanns euch sagen, und zwar, ich hab grad nur so getan, als wüsste"}, {"id": 113, "start": 1074.72, "end": 1081.24, "text": "ichs nicht. Ich grad mal hier die Qualität wieder runter, ich hab euch gebadet, ich"}, {"id": 114, "start": 1081.24, "end": 1085.24, "text": "weiß natürlich woran das liegt, und zwar weil ich das vorhin umgestellt hab. So, und"}, {"id": 115, "start": 1085.24, "end": 1089.16, "text": "das kann man umstellen jetzt nicht in Dark, sondern in, äh, ich glaub Better Twitch"}, {"id": 116, "start": 1089.16, "end": 1098.76, "text": "TV Dark, und dann sagen wir Refresh, und jetzt sollte es besser aussehen eigentlich. So"}, {"id": 117, "start": 1098.76, "end": 1105.0, "text": "Chat, probiert mal aus, ob es jetzt besser funktioniert. Ne oder, ist immer noch so komisch"}, {"id": 118, "start": 1105.0, "end": 1116.08, "text": "transparent. Ich muss den Hintergrund weiß machen, äh, gehts ja noch schlechter als"}, {"id": 119, "start": 1116.08, "end": 1136.52, "text": "vorher. Wartet mal. Moment, das muss ich jetzt grad mal ausprobieren. Ah, ich hab das,"}, {"id": 120, "start": 1136.52, "end": 1144.0, "text": "ich hab das falsch geschrieben. Ich hab das falsch geschrieben, Leute. Ich bin ein Kacknoob."}, {"id": 121, "start": 1144.0, "end": 1150.76, "text": "Ich hab das falsch geschrieben. Das heißt nicht Better Twitch TV Dark, das heißt Better"}, {"id": 122, "start": 1150.76, "end": 1158.24, "text": "Twitch TV Dark, und dann funktioniert das auch. Aha, guckt, jetzt ist es dunkel. Seht"}, {"id": 123, "start": 1158.24, "end": 1174.92, "text": "ihr das? Pock. So ist es besser, ne? So ist das gut. So war es vorher nämlich auch."}, {"id": 124, "start": 1174.92, "end": 1197.68, "text": "Also, wie gesagt, ich hab's mal aufgeschrieben. Wir haben jetzt ein Vodafone-Emote auf dem"}, {"id": 125, "start": 1197.68, "end": 1201.6, "text": "Discord. Ja, das hab ich gesehen, das ist ziemlich gut. Wobei ich das obere Omega-Lul"}, {"id": 126, "start": 1201.6, "end": 1209.52, "text": "wegmachen würde, dass man das Vodafone größer sieht. Google Notes, weil ich kein Google"}, {"id": 127, "start": 1209.52, "end": 1217.84, "text": "Zeug verwende für meinen privaten Kram. Wie viel, oh, das ist ne Frage. Wie viele Netzwerkeräte"}, {"id": 128, "start": 1217.84, "end": 1226.04, "text": "hast du in, ach du Scheiße. Boah, keine Ahnung. Das ist so viel Zeug, das weiß ich ja aus"}, {"id": 129, "start": 1226.04, "end": 1237.72, "text": "dem Kopf nicht. Kein Schimmer. Okay, okay, also probieren wir das mal. Fangen wir erstmal"}, {"id": 130, "start": 1237.72, "end": 1246.16, "text": "an. Ne Kamera im Hof, ne Kamera oben, da wo die Katze immer schläft, ne Kamera unten"}, {"id": 131, "start": 1246.16, "end": 1257.6, "text": "im Flur, ne Kamera an der Eingangstür, okay. Zwei Ubiquiti Access Points, ne 10G-Switch,"}, {"id": 132, "start": 1257.6, "end": 1269.12, "text": "ne 8-Port 1G-Switch, ne Mikrotik-Router, ne Connectbox, ne Fritzbox, dann, keine Ahnung,"}, {"id": 133, "start": 1269.12, "end": 1277.72, "text": "jetzt einmal 15 Raspberry Pi ESP32 und Raspberry Pi Zero und Odroid-Dinger, so Single-Board"}, {"id": 134, "start": 1277.72, "end": 1290.8, "text": "und Mikro-Controller-Dinger, die 4HE-Server-Kiste, 2HE-Server-Kiste, 2 Desktop-Rechner, Notebook,"}, {"id": 135, "start": 1290.8, "end": 1301.92, "text": "keine Ahnung, 8 Tablets oder so, 2 Smartphones, ach du Scheiße, keine Ahnung, das kriege"}, {"id": 136, "start": 1301.92, "end": 1309.08, "text": "ich nicht alles zusammen. Geil, ne, das war jetzt das beste, was ich auf dem Kopf hingekriegt"}, {"id": 137, "start": 1309.08, "end": 1316.08, "text": "habe. Wahrscheinlich war es das auch. Wahrscheinlich war es das auch. Aber das ist wirklich schwer"}, {"id": 138, "start": 1316.08, "end": 1320.72, "text": "zu beantworten gerade. Ne, die 8 Tablets sind nicht permanent an, das hat sich halt mittlerweile"}, {"id": 139, "start": 1320.72, "end": 1327.36, "text": "so angesammelt. Ich habe 2 Shield-Tablets, die Dinger, falls ihr noch jemand kennt, die"}, {"id": 140, "start": 1327.36, "end": 1332.72, "text": "fand ich für ihre Zeit eigentlich ziemlich gut, diese Dinger, die Shield-Tablets, wobei"}, {"id": 141, "start": 1332.72, "end": 1337.64, "text": "die halt, ich finde es doof, dass Nvidia nie ein neues Shield-Tablet gemacht hat. Hat"}, {"id": 142, "start": 1337.64, "end": 1340.08, "text": "jemand einen Tipp für einen Server-Anbieter? Kommt doch an, was du brauchst, was brauchst"}, {"id": 143, "start": 1340.08, "end": 1346.28, "text": "du denn? Also ich habe bisher immer alles mal digital ausgemacht, wenn ich viel Power"}, {"id": 144, "start": 1346.28, "end": 1352.56, "text": "gebraucht habe für kurze Zeit. In Zukunft werde ich es mal mit der Hetzer-Cloud probieren,"}, {"id": 145, "start": 1352.56, "end": 1365.56, "text": "weil die kostet einfach teilweise fast nur ein Drittel von digital aus. Da hole ich mir"}, {"id": 146, "start": 1365.56, "end": 1370.6, "text": "mein Zeug normalerweise. Das lohnt sich aber nur, wenn man halt kurzzeitig fette Power"}, {"id": 147, "start": 1370.6, "end": 1377.96, "text": "auf. Dann ist es aber richtig gut, weil, guck mal sich das hier mal an, Droplets, Pricing,"}, {"id": 148, "start": 1377.96, "end": 1384.04, "text": "Standard. So, da kriegst du zum Beispiel, das Ding hier habe ich letztens gebucht, entweder"}, {"id": 149, "start": 1384.04, "end": 1388.12, "text": "habe ich das Ding oder das Ding gebucht, ich glaube das Ding habe ich letztens gebucht,"}, {"id": 150, "start": 1388.12, "end": 1393.92, "text": "halt aber nur für 3-4 Stunden und was habe ich denn am Ende bezahlt, irgendwie 3-4 Dollar,"}, {"id": 151, "start": 1393.92, "end": 1398.56, "text": "das ist halt praktisch. Und die Handhabung von diesen Web-Interfaces ist halt auch super,"}, {"id": 152, "start": 1398.56, "end": 1402.76, "text": "das ist total einfach. Machst einen Account, create, bam, kriegst einen Key, Ubuntu einloggen"}, {"id": 153, "start": 1402.76, "end": 1409.88, "text": "und auf gehts. Für den ganzen Monat ist das natürlich nichts, dafür sind 480 Euro ein"}, {"id": 154, "start": 1409.88, "end": 1423.52, "text": "bisschen viel. Selbst mit YouTube-Money. Der ganze Dong ist nicht relevant, nur hier."}, {"id": 155, "start": 1423.52, "end": 1431.28, "text": "Okay, gucken wir uns mal nach. Ich weiß nicht, ich muss jetzt irgendwas machen, was mich interessiert."}, {"id": 156, "start": 1431.28, "end": 1447.64, "text": "Jetzt schlafe ich ein, ich bin schon so spät am Start heute. Max flexed uns. Ey, halt gefragt,"}, {"id": 157, "start": 1447.64, "end": 1454.92, "text": "wie viele Netzwerkgeräte ich hab. Also, zu den Tablets wollte ich doch kurz was sagen."}, {"id": 158, "start": 1454.92, "end": 1459.8, "text": "Wie gesagt, es haben sich 2 Shield Tablets angesammelt, davon geht aber nur eins, weil"}, {"id": 159, "start": 1459.8, "end": 1464.24, "text": "das andere wurde ausgetauscht, weil ja angeblich der Akku explodiert. Es erinnert sich vielleicht"}, {"id": 160, "start": 1464.24, "end": 1471.76, "text": "noch Leute dran, dass der Akku vom Shield Tablet ein bisschen zu heiß wurde. Aber das"}, {"id": 161, "start": 1471.76, "end": 1475.16, "text": "habe ich aus in der Ecke stehen, das kann ich jederzeit anmachen. Es gibt nämlich einen"}, {"id": 162, "start": 1475.16, "end": 1482.12, "text": "Fix dafür, falls jemand auch sein Shield Tablet ausgetauscht hat, es gibt einen Fix. Also,"}, {"id": 163, "start": 1482.12, "end": 1494.64, "text": "wer sich traut sein Shield Tablet weiter zu betreiben, trotzdem dass der Akku eventuell"}, {"id": 164, "start": 1494.64, "end": 1499.48, "text": "brennen kann, kann das hier machen. Ich würde es aber nicht machen, ich würde es aber nicht"}, {"id": 165, "start": 1499.48, "end": 1503.56, "text": "machen, weil wie gesagt, wenn dann euer Haus abbrennt habt ihr gelitten. Keine Garantie"}, {"id": 166, "start": 1503.56, "end": 1511.36, "text": "und so für nix. NVIDIA auch nicht. NVIDIA hat es ja Big Brain gemacht, so sollten es"}, {"id": 167, "start": 1511.36, "end": 1515.84, "text": "eigentlich alle machen. NVIDIA hat gesagt, unser Shield Tablet ist verbackt, da brennt"}, {"id": 168, "start": 1515.84, "end": 1520.92, "text": "der Akku, schicke uns einfach die Seriennummer und du kriegst ein neues. Habe ich gemacht"}, {"id": 169, "start": 1520.92, "end": 1525.96, "text": "und sobald das neue Tablet das erste Mal ins Internet geht, schickt NVIDIA an das alte"}, {"id": 170, "start": 1525.96, "end": 1535.48, "text": "Tablet, nen OTA, was den Bootloader flasht. Eigentlich ne gute Idee, also sprich, sobald"}, {"id": 171, "start": 1535.48, "end": 1542.84, "text": "das neue in Betrieb genommen wurde, geht das alte kaputt. Eigentlich keine schlechte Idee."}, {"id": 172, "start": 1542.84, "end": 1550.8, "text": "Natürlich kann man das halt verhindern, indem man den Kill Switch killt, indem man quasi"}, {"id": 173, "start": 1550.8, "end": 1555.88, "text": "das NVIDIA Tablet auch nachdem es deaktiviert wurde weiter benutzen kann. Aber wie gesagt"}, {"id": 174, "start": 1555.88, "end": 1559.32, "text": "kann ich keinem empfehlen, falls einer noch so ein altes Ding rumliegen hat, weil wenn"}, {"id": 175, "start": 1559.32, "end": 1567.2, "text": "der Akku abbrennt ist halt scheiße. Aber die Idee ist schon ziemlich Big Brainy von NVIDIA."}, {"id": 176, "start": 1567.2, "end": 1578.92, "text": "Aber wenn euch das egal ist, dass das Haus abbrennt, dann macht was ihr wollt. Genau,"}, {"id": 177, "start": 1578.92, "end": 1582.56, "text": "also zu den Tablets. Es haben sich einfach ein paar Tablets mit den, ich weiß gar nicht"}, {"id": 178, "start": 1582.56, "end": 1588.44, "text": "ob 8 reicht, mit den Jahren angesammelt. Also 2 Shield Tablets, nen Tegra Node 1, nen Olus"}, {"id": 179, "start": 1588.44, "end": 1596.92, "text": "Lenovo, nen Asus Tablet, Asus, sorry, Asus, was mich auch sehr schwer enttäuscht hat."}, {"id": 180, "start": 1596.92, "end": 1601.4, "text": "Das Asus Tablet, dafür nenne ich jetzt Asus, weil das mögen sie überhaupt nicht, das"}, {"id": 181, "start": 1601.4, "end": 1608.24, "text": "Asus Tablet, das hat mich sehr enttäuscht. Das war eigentlich ein ganz gutes Tablet für"}, {"id": 182, "start": 1608.24, "end": 1615.04, "text": "über 53€, also sprich, das war mal ein Android Tablet, wo man sagen kann, ey, das ist ganz"}, {"id": 183, "start": 1615.04, "end": 1619.68, "text": "gut, allerdings leider auch ähnlich preislich wie ein iPad. Zumindest haben die mich schwer"}, {"id": 184, "start": 1619.68, "end": 1625.08, "text": "enttäuscht. Die Software, die sie mitgeliefert haben, war absoluter Crap und die haben nie"}, {"id": 185, "start": 1625.08, "end": 1630.72, "text": "Firmware Updates gebracht, nie. Einfach komplett rausgebracht das Tablet und quasi einen Monat"}, {"id": 186, "start": 1630.72, "end": 1634.48, "text": "später eingestellt. So, und da hab ich mir gedacht, fickt euch, ihr könnt mich mal am"}, {"id": 187, "start": 1634.48, "end": 1639.8, "text": "Arsch lecken, kauf ich mir nicht mehr. Und jetzt hab ich mir zwei iPads noch. Also, weiter."}, {"id": 188, "start": 1639.8, "end": 1649.0, "text": "Also, ein Asus Tablet hatten wir, ein Tegra Tablet hatten wir schon, nen iPad und nen"}, {"id": 189, "start": 1649.0, "end": 1659.84, "text": "Fire HD 10 oben, nen Fire HD unten, nen Fire HD 8 und nen iPad. So, neun, oder? Ne, elf."}, {"id": 190, "start": 1659.84, "end": 1675.48, "text": "Keine Ahnung, es sind mittlerweile elf Tablets, Alter. Yolo. Aber davon verwenden wir halt"}, {"id": 191, "start": 1675.48, "end": 1691.32, "text": "eins, zwei, zwei. iPad und das Fire HD 8. Und, ähm, und halt oben und unten das Fire"}, {"id": 192, "start": 1691.32, "end": 1696.0, "text": "HD 10 als, das habt ihr ja schon gesehen, das hab ich euch ja schon hier gezeigt, das"}, {"id": 193, "start": 1696.0, "end": 1706.64, "text": "Fire HD 10 als, ähm, Dashboard an der Wand, ja. Das tue ich jetzt einfach mal nicht mitzuverwenden,"}, {"id": 194, "start": 1706.64, "end": 1711.64, "text": "das ist halt an und zeigt Kameras an und zeigt Home Assistant, Dashboard und sowas an. Aber"}, {"id": 195, "start": 1711.64, "end": 1719.6, "text": "es ist halt, da ist jetzt ein Tablet, also es ist auch an. So. Ist das Pinephone was"}, {"id": 196, "start": 1719.6, "end": 1730.56, "text": "für dich hab ich mir noch gar nicht angeguckt, was ist denn das Pinephone? Ne, ich will,"}, {"id": 197, "start": 1730.56, "end": 1735.04, "text": "das ist eh nix für mich. Ich will kein Smartphone selbst bauen, ich will ein Smartphone, das"}, {"id": 198, "start": 1735.04, "end": 1742.32, "text": "funktioniert. Da drauf läuft ja im Endeffekt da nix, ne? Da läuft da wahrscheinlich, das"}, {"id": 199, "start": 1742.32, "end": 1745.56, "text": "ist ja wahrscheinlich wieder kein Android, sondern irgendwas Eigengestricktes, gibt's"}, {"id": 200, "start": 1745.56, "end": 1751.76, "text": "keine gescheiten Apps für, ähm, wird wahrscheinlich alles außer dem Preis zacken, also der Preis"}, {"id": 201, "start": 1751.76, "end": 1755.12, "text": "wird viel zu hoch sein und wahrscheinlich wird er erst zacken. Ähm, es gab ja schon"}, {"id": 202, "start": 1755.12, "end": 1760.48, "text": "so ein paar Versuche in der Richtung und das hat halt leider nie hingehauen, deswegen,"}, {"id": 203, "start": 1760.48, "end": 1772.84, "text": "ich bleib, ich bleib bei, bei iOS und bei Android. Ein Fire HD oben und unten, das seh"}, {"id": 204, "start": 1772.84, "end": 1783.0, "text": "die rum, ich hab's doch gerade gezeigt, der Chat gebated, gebated mich wieder. Das ist"}, {"id": 205, "start": 1783.0, "end": 1786.92, "text": "das Dashboard oben an der Wand und unten ist natürlich noch mal genau das gleiche, ne?"}, {"id": 206, "start": 1786.92, "end": 1791.72, "text": "Gegensprechanlage von der Tür und das Dashboard daneben, unten ist das Dashboard, da hat das"}, {"id": 207, "start": 1791.72, "end": 1795.56, "text": "Kabel ein bisschen schöner, ich hab nämlich kein kurzes USB-Kabel mehr gehabt, unten ist"}, {"id": 208, "start": 1795.56, "end": 1805.64, "text": "das Dashboard-Kabel hier so. Tja. Was hältst du vom neuen Microsoft Edge auf Chromium-Basis?"}, {"id": 209, "start": 1805.64, "end": 1810.76, "text": "Also, ganz ehrlich, ich bin weder dafür noch dagegen, wir haben's ja hier installiert,"}, {"id": 210, "start": 1810.76, "end": 1815.52, "text": "das Ding, das ist ja hier der Chrome, der Chrome Edge, man sieht's ja hier auch an Uplog"}, {"id": 211, "start": 1815.52, "end": 1824.08, "text": "Origin. Ähm, warum nicht? Also, Microsoft sagt ja selbst, der hauptsächliche Grund"}, {"id": 212, "start": 1824.08, "end": 1829.0, "text": "dafür, dass sie das ganze, was ist denn das für ein Gimmick? Nein, der hauptsächliche"}, {"id": 213, "start": 1829.0, "end": 1832.68, "text": "Grund dafür, dass sie das ganze gemacht haben, ist, dass jemand anderes sich drum kümmert,"}, {"id": 214, "start": 1832.68, "end": 1837.6, "text": "dass die Webseiten korrekt aussehen. Eigentlich eine ziemlich gute Idee, weil den Edge mussten"}, {"id": 215, "start": 1837.6, "end": 1842.16, "text": "sie selbst dafür sorgen, in der Chrome-Engine kann ihnen das scheiß egal sein, die Seiten"}, {"id": 216, "start": 1842.16, "end": 1847.4, "text": "sehen einfach richtig aus und es ist nur einfach so, dass heute die meisten Seiten im Chrome"}, {"id": 217, "start": 1847.4, "end": 1851.32, "text": "entwickelt werden oder für Chrome entwickelt werden. Das ist jetzt nicht so das riesen"}, {"id": 218, "start": 1851.32, "end": 1855.96, "text": "Ding, wie früher zwischen Mozilla und Internet Explorer und sonst was, aber es gibt schon"}, {"id": 219, "start": 1855.96, "end": 1861.36, "text": "ein paar Sachen, wenn man die verwendet, geht's halt im Firefox nicht. Oh, das ist wieder,"}, {"id": 220, "start": 1861.36, "end": 1868.48, "text": "das ist F-Zero-Musik, ne? Ja. Ja, steht zwar da, dass es Smash Bros. ist, aber das ist"}, {"id": 221, "start": 1868.48, "end": 1886.56, "text": "ein F-Zero-Track. Poggers. Hallo, warum ist das jetzt so laut? Ich hab's so leiser gemacht."}, {"id": 222, "start": 1886.56, "end": 1902.08, "text": "So. Hast du einen eigenen Code-Style, wenn du nur für dich was programmierst? Hm. Also,"}, {"id": 223, "start": 1902.08, "end": 1910.12, "text": "ich versuche eigentlich, mich meistens an das zu halten, was für die jeweilige Sprache"}, {"id": 224, "start": 1910.12, "end": 1915.96, "text": "vom Hersteller so Style-Guide ist. Bis auf so ein paar Sachen, so ein paar Sachen verstoße"}, {"id": 225, "start": 1915.96, "end": 1920.36, "text": "ich manchmal dagegen. Mir fällt jetzt leider kein richtig gutes Beispiel ein, aber wo"}, {"id": 226, "start": 1920.36, "end": 1927.64, "text": "ich mich zum Beispiel nie dran halte, ist in C++, weil ihr wisst, dass für mich C++"}, {"id": 227, "start": 1927.64, "end": 1932.68, "text": "die größte Kacksprache auf der Welt ist. Ich hab mich schon oft genug darüber ausgelassen"}, {"id": 228, "start": 1932.68, "end": 1936.8, "text": "und da mach ich einfach so, dass es funktioniert und für mich am sinnvollsten erscheint. Zum"}, {"id": 229, "start": 1936.8, "end": 1941.2, "text": "Beispiel mach ich den C++ manchmal so, dass ich keine Klassen verwende, ich zeig euch"}, {"id": 230, "start": 1941.2, "end": 1948.64, "text": "das mal. Ich weiß, da wird sich jeder C++-Man sagen, Max, sowas kannst du doch nicht machen."}, {"id": 231, "start": 1948.64, "end": 1955.96, "text": "Aber guck mal, ich verwende beispielsweise hier keine Klasse, sondern hab das alles in"}, {"id": 232, "start": 1955.96, "end": 1963.68, "text": "einem Namespace mit globalen Variablen drinne. Ich hab das aber an der Stelle nur gemacht,"}, {"id": 233, "start": 1963.68, "end": 1966.56, "text": "weil das mit der Klasse nicht funktioniert hat, was ich machen wollte. Weil das ist ja"}, {"id": 234, "start": 1966.56, "end": 1976.64, "text": "wieder so eine typische C++-Crap-Geschichte. Man kann in C++ keine C-Funktion, also man"}, {"id": 235, "start": 1976.64, "end": 1985.0, "text": "kann keine Methoden von einer Klasse an alten C-Code als Funktionszeige übergeben, das"}, {"id": 236, "start": 1985.0, "end": 1988.92, "text": "geht nicht. Also das heißt, mir blieb gar nichts anderes da übrig, wie das Ganze ohne"}, {"id": 237, "start": 1988.92, "end": 1996.0, "text": "eine Klasse mit globalen Variablen zu machen, weil das C++ nicht supportet hat. Also man"}, {"id": 238, "start": 1996.0, "end": 1999.72, "text": "kann, nur so, dass ich zu erklären, was man nicht machen kann. Also wenn ihr jetzt zum"}, {"id": 239, "start": 1999.72, "end": 2003.84, "text": "Beispiel hier in C++, das ist schon wieder so typischer C++-Schwachsinn, ja. Also wenn"}, {"id": 240, "start": 2003.84, "end": 2008.56, "text": "ihr jetzt hier eine Klasse in C++ macht, so und da drinne habt ihr, macht ihr irgendwie"}, {"id": 241, "start": 2008.56, "end": 2015.16, "text": "eine Methode, keine Ahnung, void, blub, so, bester Name. Und ihr habt irgendwie noch eine"}, {"id": 242, "start": 2015.16, "end": 2026.64, "text": "andere Methode, void, kappa, hd. Und ihr wollt jetzt eine C-Funktion mit einem Callback aufrufen,"}, {"id": 243, "start": 2026.64, "end": 2035.44, "text": "C, Callback, Function, so. Was ihr nicht machen könnt, ist das hier. Das geht nicht. Also"}, {"id": 244, "start": 2035.44, "end": 2041.08, "text": "wenn ihr wollt, dass diese C-Funktion quasi das hier als Callback aufruft, das geht nicht,"}, {"id": 245, "start": 2041.08, "end": 2047.72, "text": "das ist nicht supportet. Das darf man nicht. Also das hier geht nicht, ja, aber weil es"}, {"id": 246, "start": 2047.72, "end": 2051.04, "text": "die Funktion nicht geht, das ist nicht supportet. Wenn man das versucht zu kompilieren, sagt"}, {"id": 247, "start": 2051.04, "end": 2056.8, "text": "er nein, man darf keine, keine Klassenmethoden als Raw Funktionspointer verwenden. Ist ja"}, {"id": 248, "start": 2056.8, "end": 2062.12, "text": "schön und gut, aber es gibt keine Alternative für. Das ist so eine typische C++-Geschichte,"}, {"id": 249, "start": 2062.12, "end": 2067.0, "text": "wo ich mir denke, ist okay. Also wenn jetzt nicht der Interop mit C in C++ gut ist, dann"}, {"id": 250, "start": 2067.0, "end": 2076.44, "text": "weiß ich auch nicht. Das ist C++-Logik. Muss für die Uni Codestyle für C++ entwickeln."}, {"id": 251, "start": 2076.44, "end": 2084.4, "text": "Was, du musst einen Codestyle für C++ entwickeln? Warum nehmt ihr nicht den normalen recommended"}, {"id": 252, "start": 2084.4, "end": 2092.44, "text": "Codestyle? Was aber auch witzig ist, so einen richtigen globalen Codestyle für C++ gibt"}, {"id": 253, "start": 2092.44, "end": 2098.08, "text": "ja gar nicht, ne. Die einen sagen, man soll CamelCase machen, die anderen sagen, man soll"}, {"id": 254, "start": 2098.08, "end": 2104.64, "text": "Snake. Ne, das ist nicht Snake. Ist das SnakeCase? Ne, wie heißt das hier Variable-Namen? Ist"}, {"id": 255, "start": 2104.64, "end": 2110.12, "text": "das SnakeCase? SnakeCase ist doch, ne, das ist KebabCase. Ah ja, genau, das ist, das"}, {"id": 256, "start": 2110.12, "end": 2118.32, "text": "ist, das ist SnakeCase, ne. Und, und KebabCase ist das hier. Das ist, das mögen die Javascript"}, {"id": 257, "start": 2118.32, "end": 2130.56, "text": "Leute. Das finden die ganz, ganz super. Da sagen die. CamelCase. Ich muss sagen CamelCase"}, {"id": 258, "start": 2130.56, "end": 2136.16, "text": "all the way. Also vor allem in C sharp CamelCase beste. In C++ nehme ich tatsächlich manchmal"}, {"id": 259, "start": 2136.16, "end": 2141.2, "text": "SnakeCase, weil die eingebauten Sachen oftmals CamelCase haben. Da weiß ich, was von mir"}, {"id": 260, "start": 2141.2, "end": 2150.96, "text": "das hier ist. Ja. Aber normalerweise nehme ich das, was vom Hersteller empfohlen wird."}, {"id": 261, "start": 2150.96, "end": 2154.4, "text": "Es gibt einen Punkt, wo ich mittlerweile in C sharp dagegen verstoße und zwar ist das"}, {"id": 262, "start": 2154.4, "end": 2161.36, "text": "für Variablen, also für Klassenvariablen, die private sind, mache ich einen Anderscore"}, {"id": 263, "start": 2161.36, "end": 2167.88, "text": "davor. Laut dem offiziellen Code-Guide, den es da von Microsoft gibt, ist das glaube ich"}, {"id": 264, "start": 2167.88, "end": 2173.88, "text": "optional erlaubt, wenn sich, aber die empfehlen, dass man das nicht macht und private Variablen"}, {"id": 265, "start": 2173.88, "end": 2178.64, "text": "kleinschreibt und dann this zum referenzieren verwendet. Kann man auch machen, wobei ich"}, {"id": 266, "start": 2178.64, "end": 2182.12, "text": "mittlerweile, ich fand es am Anfang auch nicht gut. Könnt ihr euch noch dran erinnern,"}, {"id": 267, "start": 2182.12, "end": 2187.08, "text": "von zwei Jahren oder so habe ich sogar noch gesagt, Leute ich mache lieber this und kleingeschrieben,"}, {"id": 268, "start": 2187.08, "end": 2192.88, "text": "weil mittlerweile mache ich auch Anderscore. Beschäftigst du dich überhaupt mit Reverse"}, {"id": 269, "start": 2192.88, "end": 2202.44, "text": "? Nee. Nicht wirklich. Ich meine ein paar Sachen habe ich schon über die Jahre mal,"}, {"id": 270, "start": 2202.44, "end": 2211.72, "text": "nennen wir es mal Reverse-Enginiert. Kennt ihr mal noch Croof Shark? Das gibt es ja nicht"}, {"id": 271, "start": 2211.72, "end": 2218.28, "text": "mehr. Kennt das zufällig noch jemand? Das war so ein Radiodienst, wo man kostenlos Musik"}, {"id": 272, "start": 2218.28, "end": 2225.12, "text": "anhören konnte und die haben halt darauf aufgebaut, dass man halt das über die offizielle Seite"}, {"id": 273, "start": 2225.12, "end": 2229.92, "text": "macht, mit dem offiziellen Player macht, dass die Werbung schalten können und sowas und"}, {"id": 274, "start": 2229.92, "end": 2241.12, "text": "die haben den Fehler gemacht damals. Die haben ne Flash-Anwendung rausgebracht. Das ging"}, {"id": 275, "start": 2241.12, "end": 2248.76, "text": "nicht in Deutschland so richtig, ja, aber man konnte die bescheißen. Und zwar, die"}, {"id": 276, "start": 2248.76, "end": 2253.44, "text": "haben den Fehler gemacht, die haben ne Flash-Anwendung rausgebracht, ne Desktop-Flash-Anwendung haben"}, {"id": 277, "start": 2253.44, "end": 2259.72, "text": "die damals rausgebracht und was ich damals gemacht habe ist, ich habe die Flash-Anwendung,"}, {"id": 278, "start": 2259.72, "end": 2264.08, "text": "da gibt es so D-Compiler für Flash-Anwendungen, das ist total simpel was da rauskommt, da"}, {"id": 279, "start": 2264.08, "end": 2268.2, "text": "kommt mehr oder weniger eins zu eins der Source-Code wieder raus und dann habe ich das Passwort,"}, {"id": 280, "start": 2268.2, "end": 2274.0, "text": "was die verwenden um sich an ihre API zu authentifizieren, habe ich aus der Flash-Anwendung ausgelesen"}, {"id": 281, "start": 2274.0, "end": 2279.4, "text": "und wisst ihr wie das Passwort war, heute kann man das ja verraten, ist ja kein Ding,"}, {"id": 282, "start": 2279.4, "end": 2283.24, "text": "wisst ihr wie das Passwort war, war ein richtig geiles Passwort, mal gucken ob ich es noch"}, {"id": 283, "start": 2283.24, "end": 2290.8, "text": "finde, mal gucken ob man es in Google noch findet, das Passwort war Quit Stealing My"}, {"id": 284, "start": 2290.8, "end": 2297.96, "text": "Shit, aber es war ein bisschen Leadspeak geschrieben, das war nicht so geschrieben, es war ein bisschen"}, {"id": 285, "start": 2297.96, "end": 2308.28, "text": "Leadspeak geschrieben, das war irgendwie Quit Stealing My Shit oder sowas, ne gibt es,"}, {"id": 286, "start": 2308.28, "end": 2314.32, "text": "es hat man hat es ein bisschen anders geschrieben, aber so in der Richtung, so ein paar Kleinigkeiten"}, {"id": 287, "start": 2314.32, "end": 2320.2, "text": "habe ich gemacht, also wie gesagt von den ganzen Reverse, was gibt es da, Ida, Pro und"}, {"id": 288, "start": 2320.2, "end": 2334.0, "text": "Ghidra, ich weiß gar nicht wie man den ausspricht, Ghidra, wie spricht man das aus, Ghidra, Gaidra,"}, {"id": 289, "start": 2334.0, "end": 2341.48, "text": "die coolen Leute, die coolen Leute sprechen das bestimmt Gaidra, Gaidra aus, Gaidra,"}, {"id": 290, "start": 2341.48, "end": 2346.96, "text": "wir haben ja auch Leute die Hira, Gyra aussprechen und sowas, aber am besten, was mich immer"}, {"id": 291, "start": 2346.96, "end": 2352.6, "text": "triggert Leute, Chat, Chat, ich sag es euch, das was mich echt triggert sind die Leute"}, {"id": 292, "start": 2352.6, "end": 2359.92, "text": "die Ghidra aussprechen, da kriege ich echt Anfälle, wenn dann irgendwie einer kommt"}, {"id": 293, "start": 2359.92, "end": 2369.52, "text": "mir der hat den Ghidra eingecheckt und sowas, in Ghidra, ja nachdem letztes Jahr der Vodafone"}, {"id": 294, "start": 2369.52, "end": 2377.12, "text": "das System abgekackt ist, wo ich gerade einen mega Witz reißen wollte, wisst ihr wie das"}, {"id": 295, "start": 2377.12, "end": 2390.08, "text": "Git Gui Plugin für Eclipse heißt, GIF versus GIF, eindeutig GIF, selbst wenn der GIF Erfinder"}, {"id": 296, "start": 2390.08, "end": 2405.68, "text": "GIF sagt ist es nach wie vor GIF, zumindest das Git Plugin für Eclipse heißt, IGIT, passt"}, {"id": 297, "start": 2405.68, "end": 2417.84, "text": "zu dem ganzen Kack oder, IGIT das ist der perfekte Name für den Eclipse Plugin, das ist genius"}, {"id": 298, "start": 2417.84, "end": 2428.64, "text": "ja aber richtig, ok wenn man das nicht IGIT aussprecht, die coolen Leute müssten es"}, {"id": 299, "start": 2428.64, "end": 2435.56, "text": "ja dann AYJIT aussprechen, das hört sich fast an wie irgendein türkischer Name, türkischer"}, {"id": 300, "start": 2435.56, "end": 2442.68, "text": "Mädchen Name, wie heißt du AYJIT, das könnte echt ein türkischer Mädchen Name sein, klingt"}, {"id": 301, "start": 2442.68, "end": 2457.36, "text": "irgendwie so, sowas haben wir ansonsten, klingt irgendwie so, wir hatten früher, wo wir gewohnt"}, {"id": 302, "start": 2457.36, "end": 2464.0, "text": "haben im Haus eine, die hieß Ayshe Güll und die war keine Ahnung, das war, das war schon"}, {"id": 303, "start": 2464.0, "end": 2467.8, "text": "eine ganze Weile, hey was wie alt wird die gewesen sein, 14, 15 oder so und die ist immer"}, {"id": 304, "start": 2467.8, "end": 2472.66, "text": "draußen rum gerannt und ich hab die übelste Abneigung diesen Namen, weil die Eltern immer"}, {"id": 305, "start": 2472.66, "end": 2478.16, "text": "aus dem Fenster geschrien haben, Ayshe Güll, die übelst lauten halben Tag haben die ihre"}, {"id": 306, "start": 2478.16, "end": 2483.76, "text": "Tochter gerufen und da, also das ist das echte Name und der, der triggert mich, genauso wie"}, {"id": 307, "start": 2483.76, "end": 2491.76, "text": "Mario, bei uns früher im Haus hat auch mal ein Mario gelebt und der hat permanent, permanent"}, {"id": 308, "start": 2491.76, "end": 2502.64, "text": "hat er seine Frau und seine Frau ihn gerufen, auch so ein Ding er, es gibt schon ein paar"}, {"id": 309, "start": 2502.64, "end": 2507.28, "text": "Sachen, die sind eigentlich ganz normal, aber, aber manche Leute nerven sie, weil sie halt"}, {"id": 310, "start": 2507.28, "end": 2513.08, "text": "damit schlechte Erfahrungen gemacht haben, Robert, bei mir war es Mario, Mario und die"}, {"id": 311, "start": 2513.08, "end": 2516.84, "text": "Frau hieß Angela, das weiß ich noch, da haben die, da haben die immer aus dem Fenster geschrien,"}, {"id": 312, "start": 2516.84, "end": 2523.44, "text": "Mario, Mario und dann kam ich an, Angela, Angela, das war nervig, das, das, das war aber"}, {"id": 313, "start": 2523.44, "end": 2528.64, "text": "richtige Unterschicht, das sag ich euch, was da gewohnt hat bei uns im zweiten Stock oder"}, {"id": 314, "start": 2528.64, "end": 2538.16, "text": "so, das war wirklich komplett Unterschicht, anders kann man das nicht nennen, oh Max,"}, {"id": 315, "start": 2538.16, "end": 2541.52, "text": "ich sehe, du willst Captain Affleck, ich kann dir gute Webseiten, Ressourcen geben, ich"}, {"id": 316, "start": 2541.52, "end": 2546.8, "text": "weiß nicht, ob du noch schon da bist, gerade wieder, Bildungsfern sagt man, ja stimmt,"}, {"id": 317, "start": 2546.8, "end": 2558.16, "text": "besonders, besonders, ja, mit besonderen Fähigkeiten, hey Max, du benutzt doch einen Mikrotik-Router"}, {"id": 318, "start": 2558.16, "end": 2563.88, "text": "oder welchen hast du zur Zeit, ein Hex-POE, das habe ich glaube ich schon mal beantwortet,"}, {"id": 319, "start": 2563.88, "end": 2568.4, "text": "wie sieht dein Arbeitsalltag im Homeoffice aus, das wollte ich tatsächlich mal in Ruhe"}, {"id": 320, "start": 2568.4, "end": 2576.36, "text": "beantworten, das, das wollte ich mal wirklich in Ruhe beantworten, also sprich das da, weil,"}, {"id": 321, "start": 2576.36, "end": 2580.2, "text": "das hat glaube ich Vodafone das letzte Mal, das Vodafone glaube ich das letzte Mal abgekackt,"}, {"id": 322, "start": 2580.2, "end": 2602.64, "text": "das ich beantwortet habe, vielleicht, das ist Chat, was ist da?"}, {"id": 323, "start": 2602.64, "end": 2611.0, "text": "Okay."}, {"id": 324, "start": 2731.0, "end": 2741.32, "text": "so ich schicke den jetzt gleich auf twitter was leute bin ich wieder da"}, {"id": 325, "start": 2741.32, "end": 2747.52, "text": "gleich auf gleich geht gleich weiter geht gleich weiter"}, {"id": 326, "start": 2747.52, "end": 2767.92, "text": "ich wie gesagt ich werde jetzt jeden tag voll spam auf twitter wie lang war ich jetzt"}, {"id": 327, "start": 2767.92, "end": 2785.16, "text": "an 40 minuten"}, {"id": 328, "start": 2798.48, "end": 2804.64, "text": "tweet geht raus ja mal gucken ob ich jetzt wieder hoch hoch schalten kann ja"}, {"id": 329, "start": 2804.64, "end": 2808.48, "text": "beste musik jetzt leider bei jawoll"}, {"id": 330, "start": 2808.48, "end": 2824.44, "text": "monka monka monka monka monka geht nicht"}, {"id": 331, "start": 2838.48, "end": 2867.76, "text": "geht das läuft immer noch rund alter das das was was ich habe es noch gesagt"}, {"id": 332, "start": 2867.76, "end": 2873.04, "text": "ne ich habe es noch gesagt dass das einfach nur wieder wieder flair flair"}, {"id": 333, "start": 2873.04, "end": 2876.84, "text": "ausgestoßen von wo da vorne war"}, {"id": 334, "start": 2880.32, "end": 2886.08, "text": "einmal geflehrt im heli haben sie mit dem dass man ticket geschlossen haben"}, {"id": 335, "start": 2886.08, "end": 2907.12, "text": "die nupt fliegen den heli"}, {"id": 336, "start": 2907.12, "end": 2921.28, "text": "so tweet ist raus"}, {"id": 337, "start": 2921.28, "end": 2925.04, "text": "schau mal mal"}, {"id": 338, "start": 2925.04, "end": 2930.4, "text": "schau mal was da heute kommt"}, {"id": 339, "start": 2930.4, "end": 2933.12, "text": "jetzt kannst du wenigstens die umfrage zum kundenservice beantworten gute idee"}, {"id": 340, "start": 2933.12, "end": 2939.12, "text": "mache ich jetzt gleich mache ich jetzt gleich wie zufrieden wie zufrieden waren"}, {"id": 341, "start": 2939.12, "end": 2950.48, "text": "sie waren sie mit dem"}, {"id": 342, "start": 2950.48, "end": 2954.44, "text": "kunde nummer ja wir wollen jetzt mal nicht so ist nicht so eng nicht so eng"}, {"id": 343, "start": 2954.44, "end": 2963.64, "text": "seht oder geht das stimmt es überhaupt was geschrieben war 2 mbit upload und geht es damit jetzt halbwegs"}, {"id": 344, "start": 2963.64, "end": 2971.28, "text": "geht so ich war zum glück reichen 2 mbit für den desktop betrieb so ansatzweise aus"}, {"id": 345, "start": 2971.28, "end": 2988.52, "text": "ja"}, {"id": 346, "start": 2988.52, "end": 3004.36, "text": "ja ihr dürft alle leiten alle leiten retweeten beste hauptsache dass den so dass"}, {"id": 347, "start": 3004.36, "end": 3020.64, "text": "ihn so ein bisschen der arsch geht dass es halt auch die leute sehen weil ansonsten denken die sich"}, {"id": 348, "start": 3020.64, "end": 3025.12, "text": "so leute wo bin ich wo bin ich stehen geblieben ich war gerade dabei beim"}, {"id": 349, "start": 3025.12, "end": 3029.76, "text": "erzählen bei irgendwas von wo da vorne oder und in dem moment wo ich wo da vorne"}, {"id": 350, "start": 3029.76, "end": 3036.32, "text": "erwähnt habe ist es abgekackt was was war was habe ich denn gerade erzielt"}, {"id": 351, "start": 3036.32, "end": 3042.44, "text": "homeoffice richtig stimmt ich wollte die frage vom sebaro beantworten oder von"}, {"id": 352, "start": 3042.44, "end": 3048.28, "text": "wem von den maligen wie wäre es mit einem tun das oder von kacke bild"}, {"id": 353, "start": 3048.28, "end": 3051.52, "text": "automatisch einblendet wenn die frames trocken das ist eigentlich ziemlich"}, {"id": 354, "start": 3051.52, "end": 3057.88, "text": "gute idee also wie sieht ein arbeitstag im homeoffice aus also bin ich da vor"}, {"id": 355, "start": 3057.88, "end": 3067.08, "text": "da vorne kommen da bin ich übrigens auch die letzten tage übelste probleme im"}, {"id": 356, "start": 3067.08, "end": 3071.36, "text": "homeoffice mit wo da vorne weil das ist ganz schön kacke wenn wenn in einer"}, {"id": 357, "start": 3071.36, "end": 3077.04, "text": "teamsbesprechung bist und das komplett abkackt zwischendurch man könnte das ist"}, {"id": 358, "start": 3077.04, "end": 3080.76, "text": "eine gute idee das ist eine richtig gute idee das muss uns gleich aufschreiben"}, {"id": 359, "start": 3080.76, "end": 3093.2, "text": "leute machen wir mal so was wie hier projektideen wir machen einen tool tool"}, {"id": 360, "start": 3093.2, "end": 3105.32, "text": "das automatisch wurde von service antwittert wenn stream lag das ist doch"}, {"id": 361, "start": 3105.32, "end": 3110.96, "text": "was exzellent das machen wir demnächst"}, {"id": 362, "start": 3119.04, "end": 3124.96, "text": "das ist eine gute idee es kam an bestimmt das kam an bestimmt recht easy"}, {"id": 363, "start": 3124.96, "end": 3130.6, "text": "feststellen ob das stream gerade abkacken ist dann werden die richtig"}, {"id": 364, "start": 3130.6, "end": 3138.36, "text": "folgespampt ist ja eh macht doch nix so gut so wunderbar die sollen ruhig"}, {"id": 365, "start": 3138.36, "end": 3141.32, "text": "folgespammt werden"}, {"id": 366, "start": 3154.52, "end": 3159.4, "text": "dann brechen auch die twitter selber zusammen wenn das also wenn nur ich das"}, {"id": 367, "start": 3159.4, "end": 3161.68, "text": "macht dann geht das wenn das alle machen ist schlecht"}, {"id": 368, "start": 3161.68, "end": 3167.68, "text": "leute ich habe re-subs übersehen nämlich vom bildschirm arbeiter und vom"}, {"id": 369, "start": 3167.68, "end": 3173.92, "text": "jiu jim für einmal für sieben monat und einmal für zehn monate wahnsinn hyper"}, {"id": 370, "start": 3173.92, "end": 3176.16, "text": "subscriber"}, {"id": 371, "start": 3177.4, "end": 3187.84, "text": "massif iq chat wieder richtiger boost am start heute dank für die subs hast du"}, {"id": 372, "start": 3187.84, "end": 3194.24, "text": "die webcam in teams an manchmal manchmal nicht oft"}, {"id": 373, "start": 3195.08, "end": 3201.72, "text": "nicht oft also wie sieht denn gerade an arbeitsalltag im ok da kommen wir mal zu"}, {"id": 374, "start": 3201.72, "end": 3204.08, "text": "der eigentlichen frage das war ich die ganze zeit schon beantwortet also bei"}, {"id": 375, "start": 3204.08, "end": 3207.84, "text": "mir sieht das ungefähr so aus wieso machst du nicht einfach ein ordner für"}, {"id": 376, "start": 3207.84, "end": 3211.84, "text": "die gifs das ist ganz einfach weil der chat sich"}, {"id": 377, "start": 3211.84, "end": 3215.8, "text": "jedes mal freut wenn wenn man meinen desktop sieht stimmt jedes mal mein"}, {"id": 378, "start": 3215.8, "end": 3220.6, "text": "desktop der desktop sieht macht der chat innerlich so"}, {"id": 379, "start": 3222.04, "end": 3226.84, "text": "so also um jetzt mal die eigentliche frage zu beantworten also ich stehe so"}, {"id": 380, "start": 3226.84, "end": 3231.84, "text": "irgendwie 7 30 oder so in dem dreh auf da muss ich erstmal kurz der katze was"}, {"id": 381, "start": 3231.84, "end": 3234.0, "text": "zu essen machen dann gehe ich mal aufs klo und sonst was das führen wir jetzt"}, {"id": 382, "start": 3234.0, "end": 3240.28, "text": "nicht weiter aus da mache ich den rechner an und lockt mich erst einmal ein eine"}, {"id": 383, "start": 3240.28, "end": 3246.28, "text": "runde teams eine runde bei uns ist es bei uns ist es irgendwie zu tricks"}, {"id": 384, "start": 3246.28, "end": 3253.56, "text": "remont lösung war mich nicht scheiß egal browser einloggen gut ist einloggen"}, {"id": 385, "start": 3253.56, "end": 3258.88, "text": "gucken und da gucke ich mir erstmal die mails an und ob es irgendwie neue tickets"}, {"id": 386, "start": 3258.88, "end": 3264.76, "text": "gibt oder sonstige geschichten habe ich gesagt ich mache mein pc aus ich mache"}, {"id": 387, "start": 3264.76, "end": 3270.76, "text": "mein pc an warum soll ich mein pc ausmachen chat also chat manchmal ja"}, {"id": 388, "start": 3270.76, "end": 3275.8, "text": "manchmal muss man schon bisschen mitdenken ihr wisst dass ich öfters mal"}, {"id": 389, "start": 3275.8, "end": 3280.16, "text": "komisch dass ich öfters mal die wörter vertauscht ja rechner ausmachen macht"}, {"id": 390, "start": 3280.16, "end": 3285.04, "text": "keinen sinn also da mache ich den rechner an der log ich mich ein da gucke"}, {"id": 391, "start": 3285.04, "end": 3289.32, "text": "ich erst mal ob es neue tickets gibt ob e-mails gekommen sind ob irgendwas"}, {"id": 392, "start": 3289.32, "end": 3293.96, "text": "passiert ist halt in der zeit wo ich nicht drauf geguckt habe und meistens"}, {"id": 393, "start": 3293.96, "end": 3296.48, "text": "und ich glaube das habe ich letztes mal bis dahin habe ich das letzte mal ja"}, {"id": 394, "start": 3296.48, "end": 3304.72, "text": "auch schon erzählt meistens ist dann auch schon irgendwas am start von"}, {"id": 395, "start": 3304.72, "end": 3307.96, "text": "irgendwelchen leuten die die was haben wollen ich habe es euch ja ich habe es"}, {"id": 396, "start": 3307.96, "end": 3311.44, "text": "euch ja schon zweimal oder so im stream gezeigt letztens hier fand ich auch"}, {"id": 397, "start": 3311.44, "end": 3316.32, "text": "geil letztens per mail gekriegt hier morgens hier das da das habe ich euch"}, {"id": 398, "start": 3316.32, "end": 3319.08, "text": "ja schon gezeigt so nachdem du könntest du diese"}, {"id": 399, "start": 3319.08, "end": 3323.32, "text": "ändert mit der nötigen eile bearbeiten ausrollen habe ich geschrieben ja ich"}, {"id": 400, "start": 3323.32, "end": 3327.8, "text": "bin heute nicht da wofür ist denn der fix und wie dringend ist das ja das ist"}, {"id": 401, "start": 3327.8, "end": 3334.0, "text": "halt eine absolut exzellent exzellent fife hat high IQ antwort da hast du alles"}, {"id": 402, "start": 3334.0, "end": 3339.0, "text": "mit abgehängt sagst einfach ja und daraufhin habe ich mich halt nicht"}, {"id": 403, "start": 3339.0, "end": 3342.16, "text": "eingeloggt hab es erst mal ignoriert aber solche nachrichten kriege ich dann"}, {"id": 404, "start": 3342.16, "end": 3346.72, "text": "meistens paar minuten nachdem ich gesagt habe dass ich nicht per mail des teams"}, {"id": 405, "start": 3346.72, "end": 3354.12, "text": "ist das die weeps sind wieder unterwegs"}, {"id": 406, "start": 3358.24, "end": 3364.48, "text": "so und ja wie gesagt meistens kommt dann irgendwie so was in der richtung das kann"}, {"id": 407, "start": 3364.48, "end": 3370.84, "text": "sein von hier bitte mal ganz schnell fixen und es kommen auch leute die sagen"}, {"id": 408, "start": 3370.84, "end": 3375.96, "text": "max ich habe mein git branche kaputt gemacht das sind die geilsten vor allem"}, {"id": 409, "start": 3375.96, "end": 3381.12, "text": "wenn es java entwickler sind was auch immer vor allem wenn es java entwickler"}, {"id": 410, "start": 3381.12, "end": 3386.84, "text": "sind das finde ich immer geil ich würde eigentlich erwarten dass im jahre 2020"}, {"id": 411, "start": 3386.84, "end": 3390.84, "text": "das in der entwickler schafft so die so die geht basics zu beherrschen ja so die"}, {"id": 412, "start": 3390.84, "end": 3396.56, "text": "so die ganz normalen sachen so die so so was weiß ich der kann sich der kann"}, {"id": 413, "start": 3396.56, "end": 3400.76, "text": "den checkout machen in eigenen branche erstellen da drin paar sachen comitten"}, {"id": 414, "start": 3400.76, "end": 3407.16, "text": "vielleicht ab und zu mal rebasen auf den master und und und und pull request"}, {"id": 415, "start": 3407.16, "end": 3411.68, "text": "aufmachen viel man muss da eigentlich gar nicht können aber die meisten"}, {"id": 416, "start": 3411.68, "end": 3416.96, "text": "entwickler bei uns die ja wenn es um skit händling geht machen die das eher"}, {"id": 417, "start": 3416.96, "end": 3423.44, "text": "so und das schlimmste ist dann schon dass sie alle die java entwickler dieses"}, {"id": 418, "start": 3423.44, "end": 3429.12, "text": "komische e-git eclipse plugin verwenden was die sache nicht besser macht ich habe"}, {"id": 419, "start": 3429.12, "end": 3432.04, "text": "schon ich habe schon kommt ich habe schon histories gesehen von leuten die was"}, {"id": 420, "start": 3432.04, "end": 3436.0, "text": "gemurtscht haben wollten da waren fünf leere comments drin weil das irgendwie"}, {"id": 421, "start": 3436.0, "end": 3442.04, "text": "ihr e-git plugin gemacht hat"}, {"id": 422, "start": 3444.16, "end": 3450.96, "text": "zumindest soll so nach ich kriege ich dann und ja wenn es um Hilfe max ich habe"}, {"id": 423, "start": 3450.96, "end": 3454.2, "text": "meinen git branche kaputt gemacht ist das ist das manchmal ist das manchmal"}, {"id": 424, "start": 3454.2, "end": 3458.72, "text": "ganz witzig weil dann muss man müssen wir erst mal erklären wie sie ihr git"}, {"id": 425, "start": 3458.72, "end": 3462.16, "text": "branche kaputt gemacht hat heute ich höre mal auf zwischen den zwischen hell"}, {"id": 426, "start": 3462.16, "end": 3469.6, "text": "und dunkel zu switchen das brennen mich das ist ziemlich pepega style wir warten"}, {"id": 427, "start": 3469.6, "end": 3473.0, "text": "jetzt einfach mal bis unity media geantwortet hat in der zwischenzeit"}, {"id": 428, "start": 3473.0, "end": 3477.4, "text": "erzähle ich weiter wobei die wahrscheinlich"}, {"id": 429, "start": 3478.96, "end": 3486.28, "text": "wobei die wahrscheinlich nicht nicht antworten so schnell so und also da muss"}, {"id": 430, "start": 3486.28, "end": 3491.28, "text": "man erst mal erklären wie sie denn ihre git branche zerstört haben da aber so"}, {"id": 431, "start": 3491.28, "end": 3497.16, "text": "zwei da war so zwei fraktionen wir haben einmal die die wirklich gar keinen"}, {"id": 432, "start": 3497.16, "end": 3500.92, "text": "blassen schimmer haben wie man geht verwendet aber es nicht zugeben wollen"}, {"id": 433, "start": 3500.92, "end": 3507.6, "text": "und einfach irgendwas machen die kein plan haben die eigentlich nichts falsch"}, {"id": 434, "start": 3507.6, "end": 3516.48, "text": "nichts richtig machen die einfach kein plan haben ja und dann haben die anderen"}, {"id": 435, "start": 3516.48, "end": 3522.76, "text": "dies eigentlich können aber sobald was unvorher gesehen ist basiert"}, {"id": 436, "start": 3522.76, "end": 3527.52, "text": "irgendwie in panik verfallen und dann komische dinge machen so die zwei"}, {"id": 437, "start": 3527.52, "end": 3532.76, "text": "fraktionen haben wir bei den ersten da habe ich mittlerweile schon gar keinen"}, {"id": 438, "start": 3532.76, "end": 3536.52, "text": "bock mehr denen zu helfen weil ich denke mir wäre es als entwickler oder als"}, {"id": 439, "start": 3536.52, "end": 3542.68, "text": "admin oder als def ops man oder als service wer ist 2020 der ein bisschen"}, {"id": 440, "start": 3542.68, "end": 3549.96, "text": "was mit it zu tun hat nicht schafft so die 45 basics git befehle kommandos zu"}, {"id": 441, "start": 3549.96, "end": 3556.48, "text": "beherrschen der ist falsch falsch im beruf und da wenn das welche sind die"}, {"id": 442, "start": 3556.48, "end": 3560.08, "text": "offensichtlich kein bock haben da habe ich auch kein bock mehr mittlerweile wir"}, {"id": 443, "start": 3560.08, "end": 3564.44, "text": "haben beispielsweise einen das das ganz besonders toll"}, {"id": 444, "start": 3564.44, "end": 3569.8, "text": "der sagt immer nicht ich habe kein plan ich habe kein plan der sagt immer ja"}, {"id": 445, "start": 3569.8, "end": 3573.2, "text": "wo ist das denn dokumentiert und mittlerweile sage ich ihm ja lese"}, {"id": 446, "start": 3573.2, "end": 3576.88, "text": "halt das offizielle git handbuch und bei der way das offizielle git handbuch"}, {"id": 447, "start": 3576.88, "end": 3581.76, "text": "ist kacke und die git man pages sind auch kacke jetzt passt habe ich ich weiß"}, {"id": 448, "start": 3581.76, "end": 3586.4, "text": "nicht ob ich es schon mal gezeigt haben kennt ihr die man page von git von git"}, {"id": 449, "start": 3586.4, "end": 3594.8, "text": "pusch wer kann mir nach dem hit nach dem einleitungssatz der hilfeseite erklären"}, {"id": 450, "start": 3594.8, "end": 3597.6, "text": "was git pusch macht"}, {"id": 451, "start": 3602.36, "end": 3608.2, "text": "wer wer hat gedacht das ist ein guter einleitungstext wer hat sich das wer"}, {"id": 452, "start": 3608.2, "end": 3613.68, "text": "hat gedacht so ja ja jetzt versteht man sofort was git pusch macht ich"}, {"id": 453, "start": 3613.68, "end": 3623.76, "text": "exzellent ich habe das ist updates remote raffs using the local raffs"}, {"id": 454, "start": 3623.76, "end": 3630.08, "text": "while sending objects necessary to complete the given raffs alles klar"}, {"id": 455, "start": 3630.08, "end": 3637.56, "text": "exzellent exzellent exquisite anleitung geht aber wenn die leute nur nur fragen"}, {"id": 456, "start": 3637.56, "end": 3641.12, "text": "können sie nach dem motto ja wo ist das denn dokumentiert da habe ich kein bock"}, {"id": 457, "start": 3641.12, "end": 3647.72, "text": "mal drauf gerade externe gerade externe es kann nicht sein dass ein externer"}, {"id": 458, "start": 3647.72, "end": 3653.88, "text": "eksperte berater wie auch immer dem anzunehmen zu dem thema im jahr 2020"}, {"id": 459, "start": 3653.88, "end": 3660.16, "text": "keine 5 basic git befehle kann das geht nicht an das das kann nicht sein und ich"}, {"id": 460, "start": 3660.16, "end": 3667.12, "text": "bin nicht dafür da den leuten die nicht willentlich sind sich mal ich erkläre"}, {"id": 461, "start": 3667.12, "end": 3671.04, "text": "es ja jedem ich erkläre es auch jedem fünf mal aber beim sechsten war habe ich kein bock"}, {"id": 462, "start": 3671.04, "end": 3676.84, "text": "mehr und da haben wir haben so ein kandidat der ist ganz besonders toll was"}, {"id": 463, "start": 3676.84, "end": 3685.84, "text": "das angeht der fragt zu allem wirklich zu allem ja wo ist aus den dokumentiert zu"}, {"id": 464, "start": 3685.84, "end": 3691.52, "text": "den zu den größten basics wo willst du denn wo landet man denn damit irgendwann"}, {"id": 465, "start": 3691.52, "end": 3696.52, "text": "will er dann irgendwann wikipedia inhalt haben wir sein arbeit macht das"}, {"id": 466, "start": 3696.52, "end": 3701.88, "text": "er quasi nur noch in die in die how to do work wikipedia gucken muss dass er dann"}, {"id": 467, "start": 3701.88, "end": 3706.36, "text": "dann einfach oben anfängt und hat den tag erledigt oder was und vor allem wie"}, {"id": 468, "start": 3706.36, "end": 3710.6, "text": "weit runter soll das dann eigentlich gehen so nach dem motto bitte jetzt"}, {"id": 469, "start": 3710.6, "end": 3717.48, "text": "zeigefinger ausfahren auf den powerknopf drücken zeigefinger nach unten 30"}, {"id": 470, "start": 3717.48, "end": 3720.08, "text": "sekunden warten wie soll das funktionieren ich stelle sich das vor"}, {"id": 471, "start": 3720.08, "end": 3725.36, "text": "und gerade wie gesagt gerade als externer experte berater musste musste"}, {"id": 472, "start": 3725.36, "end": 3731.0, "text": "das musste das muss er das gebacken kriegen und da gehe ich schon gar nicht"}, {"id": 473, "start": 3731.0, "end": 3736.24, "text": "mehr darauf ein ist es mittlerweile wird sicherweise so dass die anderen"}, {"id": 474, "start": 3736.24, "end": 3739.16, "text": "mittlerweile auch schon sagen ja guck mal du bist jetzt zwei jahre da"}, {"id": 475, "start": 3739.16, "end": 3741.44, "text": "warum hast du es nicht mehr aufgeschrieben du hast schon dreimal"}, {"id": 476, "start": 3741.44, "end": 3756.84, "text": "gemacht und dann ist er immer so wie der stolber früher und dann ist er"}, {"id": 477, "start": 3756.84, "end": 3765.36, "text": "stinkig dann ist er stinkig danach weil man in der ex post hat ja so aber da"}, {"id": 478, "start": 3765.36, "end": 3767.76, "text": "haben wir aber glücklicherweise nicht so viele und da habe ich dann auch keinen"}, {"id": 479, "start": 3767.76, "end": 3771.8, "text": "bock mit den leuten zu helfen was was öfters was tatsächlich öfters"}, {"id": 480, "start": 3771.8, "end": 3774.8, "text": "vorkommt ist ich weiß ich habe gesagt ich will nicht mehr zwitschen aber ich"}, {"id": 481, "start": 3774.8, "end": 3782.72, "text": "muss die frage noch mal kopieren dass man sieht um was es geht kopieren wir die"}, {"id": 482, "start": 3782.72, "end": 3785.24, "text": "mal dahin"}, {"id": 483, "start": 3790.44, "end": 3794.64, "text": "genau und das da habe ich dann da habe ich dann schon schon kein kein bock"}, {"id": 484, "start": 3794.64, "end": 3798.64, "text": "kein bock drauf an der stelle bei den anderen ist das überhaupt kein problem"}, {"id": 485, "start": 3798.64, "end": 3802.16, "text": "da kommt öfters mal vor ist jetzt auch nicht immer so übertrieben wie ich jetzt"}, {"id": 486, "start": 3802.16, "end": 3809.36, "text": "gesagt habe das was total kaputt ist aber was mir aufgefallen ist was wo die"}, {"id": 487, "start": 3809.36, "end": 3812.88, "text": "leute beim beim gett händling ein bisschen probleme haben ist wenn sie"}, {"id": 488, "start": 3812.88, "end": 3821.72, "text": "sachen machen in einem branche und dann versuchen den branche zu wechseln weil"}, {"id": 489, "start": 3821.72, "end": 3825.72, "text": "dann müssen sie dann hast dann hast ja in das so zwei varianten das drei"}, {"id": 490, "start": 3825.72, "end": 3829.28, "text": "varianten du hast eigentlich drei varianten entweder kannst du den"}, {"id": 491, "start": 3829.28, "end": 3832.2, "text": "branche wechseln weil die dateien sich irgendwie nicht überschneiden und es ist"}, {"id": 492, "start": 3832.2, "end": 3836.52, "text": "gut und du nimmst die änderung mit das wollen die meisten aber nicht die"}, {"id": 493, "start": 3836.52, "end": 3839.52, "text": "meisten wollen dass die änderung in diesem branche bleiben aber so funktioniert"}, {"id": 494, "start": 3839.52, "end": 3843.0, "text": "das paket nicht die änderung bleiben erst in diesem branche wenn du so"}, {"id": 495, "start": 3843.0, "end": 3847.36, "text": "kommited hast aber das checken manche nicht so und dann zwitschen sie den"}, {"id": 496, "start": 3847.36, "end": 3851.84, "text": "branche und es geht und kommiten sie im falschen branche falsche sachen oder"}, {"id": 497, "start": 3851.84, "end": 3856.48, "text": "danach fragen sie sich hoch wo sind denn meine changes hin oder aber sie können"}, {"id": 498, "start": 3856.48, "end": 3859.76, "text": "den branche nicht wechseln weil sie noch unkommittete sachen haben das verwirrt"}, {"id": 499, "start": 3859.76, "end": 3863.28, "text": "oftmals die leute man muss aber auch sagen es ist nicht so schön gemacht"}, {"id": 500, "start": 3863.28, "end": 3867.44, "text": "so die zweite variante ist anstatt dass das wechsel einfach funktioniert ist du"}, {"id": 501, "start": 3867.44, "end": 3871.24, "text": "machst ein kommet dann ist die sache auch gegessen dann ist das in diesem"}, {"id": 502, "start": 3871.24, "end": 3874.04, "text": "branche als neues kommet und du kannst wechseln machen was willst die dritte"}, {"id": 503, "start": 3874.04, "end": 3880.68, "text": "variante ist du staschst das einfach für später das funktioniert auch"}, {"id": 504, "start": 3880.68, "end": 3887.28, "text": "und da kannst du später weitermachen. Git stash ist eh eines der"}, {"id": 505, "start": 3887.28, "end": 3894.44, "text": "usesten kommandos überhaupt ich sehe kaum leute das verwenden dabei ist das"}, {"id": 506, "start": 3894.44, "end": 3898.16, "text": "eigentlich das beste das beste kommando für zwischendurch wenn man grad was"}, {"id": 507, "start": 3898.16, "end": 3901.88, "text": "macht und der chef kommt zu einem oder irgendjemand sagt hier du musst jetzt"}, {"id": 508, "start": 3901.88, "end": 3906.04, "text": "da und da was mal schnell machen dann stashst du deine endung wechselst in die"}, {"id": 509, "start": 3906.04, "end": 3908.36, "text": "anderen branche machst die endung schnell dich an chef haben will"}, {"id": 510, "start": 3908.36, "end": 3910.76, "text": "kommet ist das pusht das gehst wieder zurück"}, {"id": 511, "start": 3910.76, "end": 3915.92, "text": "pops den stash und kannst an der stelle weitermachen wo du aufgehört hast also"}, {"id": 512, "start": 3915.92, "end": 3919.16, "text": "ich popp also vielleicht liegt das daran dass ich dass ich gerne ins dash"}, {"id": 513, "start": 3919.16, "end": 3931.84, "text": "poppe weiß ich auch nicht zumindest dass es sehr under used in git meinst du nee ich mein"}, {"id": 514, "start": 3931.84, "end": 3935.24, "text": "das war es wirklich stash heißt"}, {"id": 515, "start": 3938.24, "end": 3944.6, "text": "tom ux xx nee nee nee nee das stimmt nicht tom ux schreibt wir machen wir"}, {"id": 516, "start": 3944.6, "end": 3948.8, "text": "machen jetzt mal sollen wir mal eine runde eine runde jit magic mit max"}, {"id": 517, "start": 3948.8, "end": 3954.44, "text": "machen jetzt also tom ux schreibt was mich bei git am meisten abfuckt ist das"}, {"id": 518, "start": 3954.44, "end": 3958.0, "text": "unbenennt von verzeichnissen dann geht die gesamte historie flöten das stimmt"}, {"id": 519, "start": 3958.0, "end": 3963.32, "text": "nicht du musst das richtig machen du musst das mit git mv machen also wir"}, {"id": 520, "start": 3963.32, "end": 3971.0, "text": "machen es hier test gibt ich habe keinerlei completion oder sonst was"}, {"id": 521, "start": 3971.0, "end": 3974.56, "text": "installiert ist ein bisschen doof also wir machen jetzt eine datei cute chat"}, {"id": 522, "start": 3974.56, "end": 3983.24, "text": "punkt txt 123 wir machen noch ein ordner mk dir blub so wunderbar aber geht status"}, {"id": 523, "start": 3983.24, "end": 3988.56, "text": "gucken wir uns an uncommitted wir muven mal cute chat cute chat nach in den"}, {"id": 524, "start": 3988.56, "end": 3993.52, "text": "ordner blub so als wenn man geht status da sehen wir okay und rechtfalls so wir"}, {"id": 525, "start": 3993.52, "end": 3998.8, "text": "enden mal alles und wir machen ein kommet in it und gucken wir uns jetzt"}, {"id": 526, "start": 3998.8, "end": 4004.48, "text": "durch anstellen fest macht das lokal aus hat ein kommet gemacht so und was der"}, {"id": 527, "start": 4004.48, "end": 4007.96, "text": "tormox jetzt meint ist und da hat er nicht unrecht muss man sagen aber"}, {"id": 528, "start": 4007.96, "end": 4012.76, "text": "was richtig macht geht's wenn man jetzt das hier macht wenn man den ordner jetzt"}, {"id": 529, "start": 4012.76, "end": 4021.44, "text": "unbenennt move blub nach blub 2 geht status dann sieht man jetzt schon okay"}, {"id": 530, "start": 4021.44, "end": 4026.12, "text": "für ihn sieht das so aus als ist die eine datei gelöscht und es gibt"}, {"id": 531, "start": 4026.12, "end": 4034.8, "text": "komplett neue neue files und so macht man das nicht so macht man das nicht"}, {"id": 532, "start": 4034.8, "end": 4039.56, "text": "weil geht denkt jetzt unter der haube ok die datei an dieser stelle wurde"}, {"id": 533, "start": 4039.56, "end": 4042.64, "text": "gelöscht und es wurde neues verzeichnet mit der neuen datei die zwar zufällig"}, {"id": 534, "start": 4042.64, "end": 4047.84, "text": "genauso heißt aber es ist ein neuer datei angelegt das denke der richtige"}, {"id": 535, "start": 4047.84, "end": 4051.44, "text": "weg das ganze zu machen ist in status jetzt haben wir zurück brennen"}, {"id": 536, "start": 4051.44, "end": 4057.16, "text": "der richtige das umzubinden ist das git mv muss du machen so wenn jetzt das"}, {"id": 537, "start": 4057.16, "end": 4066.36, "text": "macht nach blub 2 und an geht status machte dann sagt er renamed"}, {"id": 538, "start": 4067.36, "end": 4070.36, "text": "excellent"}, {"id": 539, "start": 4073.68, "end": 4080.0, "text": "so muss man das machen tormox ich hoffe das hatte geholfen falls je nachdem wie"}, {"id": 540, "start": 4080.0, "end": 4084.64, "text": "viele unbenennt und unbenennt willst aber das bringt was so wenn ihr das mit"}, {"id": 541, "start": 4084.64, "end": 4087.52, "text": "rename macht dann ist nämlich auch die history in takt ich zeige euch noch mal"}, {"id": 542, "start": 4087.52, "end": 4093.16, "text": "was was man jetzt machen kann was ultra praktisch ist was was"}, {"id": 543, "start": 4097.08, "end": 4104.64, "text": "so was auch was auch sehr praktisch ist wenn man jetzt hier reingeht in in den"}, {"id": 544, "start": 4104.64, "end": 4107.72, "text": "ordner und sagt okay ich meine meine history ist jetzt relativ überschaubar"}, {"id": 545, "start": 4107.72, "end": 4111.56, "text": "also meine history hat jetzt zwei kommets da ist jetzt ist jetzt nicht so"}, {"id": 546, "start": 4111.56, "end": 4116.12, "text": "viel wir brauchen mal wir brauchen mal den git repo wo mehr committed ist was"}, {"id": 547, "start": 4116.12, "end": 4119.96, "text": "nehmen da jetzt kommt mir nicht mit dem linux kernel etwas mittel mittel großes"}, {"id": 548, "start": 4119.96, "end": 4125.12, "text": "view gs github klonen wir jetzt mal da kann ich euch nämlich ein bisschen was"}, {"id": 549, "start": 4125.12, "end": 4128.12, "text": "zeigen aber nämlich ein repo wo ein bisschen mehr dran ist da kommen zwar"}, {"id": 550, "start": 4128.12, "end": 4139.68, "text": "nix da kann man zwar nix comitten was also excellent verzeichnissen haben"}, {"id": 551, "start": 4140.84, "end": 4144.04, "text": "wenn noch so auskommen"}, {"id": 552, "start": 4149.96, "end": 4155.12, "text": "da wird sich mein review freuen dass nicht so viel rot und grün ja und nachdem"}, {"id": 553, "start": 4155.12, "end": 4158.52, "text": "ich bei uns ja der hauptsächliche reviewer bin freue ich mich bei sowas auch"}, {"id": 554, "start": 4158.52, "end": 4163.68, "text": "so also wir haben jetzt mal das view gs repo geklont und was auch sehr praktisch"}, {"id": 555, "start": 4163.68, "end": 4166.76, "text": "ist wir machen jetzt mal ein bisschen bisschen git match die kann ich euch ein"}, {"id": 556, "start": 4166.76, "end": 4169.4, "text": "bisschen was zeigen ich meine es muss ja irgendeinen sinn haben dass ich den"}, {"id": 557, "start": 4169.4, "end": 4173.12, "text": "ganzen tag diesen kram macht so wir nehmen uns jetzt mal in die in die"}, {"id": 558, "start": 4173.12, "end": 4177.44, "text": "datei aus wie zum beispiel die ritmi ritmi hat ja fast jeder hat ja fast"}, {"id": 559, "start": 4177.44, "end": 4184.68, "text": "jeder im repo im root verzeichnis liegen außer wir natürlich bei uns gibt bei"}, {"id": 560, "start": 4184.68, "end": 4190.8, "text": "uns liegt keine ritmi datei im root verzeichnis bei uns liegt nur eine"}, {"id": 561, "start": 4190.8, "end": 4195.12, "text": "change log datei im root verzeichnis wo man nachgucken kann zumindest wenn man"}, {"id": 562, "start": 4195.12, "end": 4199.64, "text": "jetzt nachgucken möchte was hat sich alles an dieser datei geändert und wer"}, {"id": 563, "start": 4199.64, "end": 4205.36, "text": "hat alles was an dieser datei gemacht da gibt es zwei varianten ich zeige euch"}, {"id": 564, "start": 4205.36, "end": 4208.64, "text": "mal eine variante die ist zwar nicht so schön aber die ist bei anderen sachen"}, {"id": 565, "start": 4208.64, "end": 4213.68, "text": "ganz praktisch ihr könnt sagen geht lock minus minus name only und dann seht ihr"}, {"id": 566, "start": 4213.68, "end": 4218.72, "text": "alle commits inklusive den dateien die angefasst wurden"}, {"id": 567, "start": 4219.56, "end": 4222.96, "text": "das ist ganz praktisch für ein bisschen überblick verschaffen will"}, {"id": 568, "start": 4222.96, "end": 4226.84, "text": "was hat sich denn in den commits getan weil normalerweise sieht ein lock ja so"}, {"id": 569, "start": 4226.84, "end": 4229.76, "text": "aus da sieht man nicht was sich geändert hat"}, {"id": 570, "start": 4229.76, "end": 4233.12, "text": "so man kann nur angeben da sieht man auch zuletzt lichter was sich geändert hat"}, {"id": 571, "start": 4233.12, "end": 4236.12, "text": "wenn man es ganz genau machen will macht man auch minus p dabei"}, {"id": 572, "start": 4236.12, "end": 4239.84, "text": "ach das geht mit name only wohl nicht zusammen okay da kriegt man nämlich noch"}, {"id": 573, "start": 4239.84, "end": 4243.44, "text": "das diff das ist eigentlich so eine sache die ich mir am tag 20.000 mal"}, {"id": 574, "start": 4243.44, "end": 4247.48, "text": "angucken da kriegt man nämlich auch das diff zu den endungen was schöner ist wenn"}, {"id": 575, "start": 4247.48, "end": 4250.4, "text": "man rauskriegen will was sich an der datei geändert hat ist man kann einfach"}, {"id": 576, "start": 4250.4, "end": 4255.96, "text": "den geht lock auf die datei machen und dann kriegt man nur die kommets und ihr"}, {"id": 577, "start": 4255.96, "end": 4260.24, "text": "seht da sind nicht viele das view report viel mehr kommets da kriegt ihr nur die"}, {"id": 578, "start": 4260.24, "end": 4265.12, "text": "kommets die was an dieser datei geändert haben und dann könnt ihr euch das diff"}, {"id": 579, "start": 4265.12, "end": 4271.6, "text": "zu angucken und so kriegt man richtig easy raus in welcher reinfolge wer was an"}, {"id": 580, "start": 4271.6, "end": 4278.2, "text": "der datei kaputt gemacht hat das ist äußerst nützlich geht lock und dann auf"}, {"id": 581, "start": 4278.2, "end": 4282.64, "text": "die datei machst du deine rift in der konsole ich wachte in der konsole zum"}, {"id": 582, "start": 4282.64, "end": 4286.24, "text": "größten teil und schreibt dann in den polo quest halt an den jeweiligen"}, {"id": 583, "start": 4286.24, "end": 4290.44, "text": "stellen was rein"}, {"id": 584, "start": 4291.56, "end": 4298.04, "text": "so nächste geschichte wollte ich jetzt noch sagen nächste geschichte was man"}, {"id": 585, "start": 4298.04, "end": 4301.0, "text": "machen kann was man probieren kann vielleicht bringt das nämlich wer hat"}, {"id": 586, "start": 4301.0, "end": 4305.6, "text": "das eben gefragt dem tormox auch was was man probieren kann ist wenn sachen"}, {"id": 587, "start": 4305.6, "end": 4310.08, "text": "hin und her geschoben wurden es gibt die option dass man noch"}, {"id": 588, "start": 4310.08, "end": 4314.76, "text": "minus minus follow an gibt weil ich das richtig in erinnerung habe versucht"}, {"id": 589, "start": 4314.76, "end": 4323.92, "text": "dass solche sachen wie renaming und sowas nach zu vollziehen dass man quasi"}, {"id": 590, "start": 4323.92, "end": 4327.56, "text": "alle änderungen an dieser datei nach vollziehen kann auch wenn sie umbenannt"}, {"id": 591, "start": 4327.56, "end": 4337.28, "text": "wurde ja so viel zu so viel zum datei unbedenken"}, {"id": 592, "start": 4337.28, "end": 4342.48, "text": "eben geht es gibt ich wie gesagt ich kann euch da jetzt noch 100.000 100.000"}, {"id": 593, "start": 4342.48, "end": 4349.6, "text": "andere geschichten zeigen ja vielleicht zeige ich das mit dem stash noch mal"}, {"id": 594, "start": 4349.6, "end": 4354.2, "text": "vielleicht zeige ich das mit dem stash noch mal ich das sehr under just finde"}, {"id": 595, "start": 4354.2, "end": 4361.96, "text": "deswegen gehen wir noch mal unser test repo zeigt das mit dem follow noch mal"}, {"id": 596, "start": 4361.96, "end": 4364.6, "text": "ein tester gut da können wir nämlich mal ausprobieren ob das überhaupt stimmt was ich"}, {"id": 597, "start": 4364.6, "end": 4368.6, "text": "erzählt habe also probieren wir mal aus geht plupp 2"}, {"id": 598, "start": 4368.6, "end": 4378.36, "text": "sagen wir mal hier move cute chat nach cute cute chat 2 geht status aber mag er"}, {"id": 599, "start": 4378.36, "end": 4386.12, "text": "nicht werden wir das ganze comitten das ganze bis big brain"}, {"id": 600, "start": 4386.12, "end": 4389.6, "text": "guck da hat sogar schon gecheckt dass ich renamed hab da ist nicht blöd weil sich"}, {"id": 601, "start": 4389.6, "end": 4394.2, "text": "nichts geändert hat in der zeit jetzt kann ich gar nicht zeigen"}, {"id": 602, "start": 4396.88, "end": 4400.52, "text": "gut passt na gut an der datei hat sich ja so im moment"}, {"id": 603, "start": 4400.52, "end": 4408.32, "text": "mein follow guckt seht ihr es funktioniert wenn ich ihn geht lock auf die datei macht"}, {"id": 604, "start": 4408.32, "end": 4412.4, "text": "findet er nur vielleicht muss man das noch mal deutlicher deutlicher zeigen"}, {"id": 605, "start": 4412.4, "end": 4416.36, "text": "wenn ich ihn geht lock macht auf die datei dann findet er nur das letzte"}, {"id": 606, "start": 4416.36, "end": 4420.48, "text": "kommet warum findet er nur das letzte kommet weil ich ja nur in diesem kommet"}, {"id": 607, "start": 4420.48, "end": 4424.48, "text": "diese datei überhaupt existiert mit dem namen oder weil diese datei erst"}, {"id": 608, "start": 4424.48, "end": 4428.28, "text": "überhaupt ab diesem kommet existiert aber wenn ich den minus minus follow"}, {"id": 609, "start": 4428.28, "end": 4432.04, "text": "dran machen dann versucht er auch renames nach zu"}, {"id": 610, "start": 4432.04, "end": 4436.88, "text": "vollziehen und ihr seht ok die datei hier heißt die cute chat 2 jetzt noch cute"}, {"id": 611, "start": 4436.88, "end": 4441.24, "text": "chat 1 aber er verfolgt das ganze hinterher so man könne es natürlich"}, {"id": 612, "start": 4441.24, "end": 4446.8, "text": "auch name only dran machen dann sieht man auch aha hier war es cute"}, {"id": 613, "start": 4446.8, "end": 4450.28, "text": "chat 2 und hier war es noch cute chat 1 das heißt die hat einfach eine nicht"}, {"id": 614, "start": 4450.28, "end": 4455.04, "text": "richtig renamed die hat eine nicht get moved sondern die hat einer get hat"}, {"id": 615, "start": 4455.04, "end": 4461.2, "text": "einer moved auf dem fallsystem das ist das ist ganz praktisch wenn was wenn"}, {"id": 616, "start": 4461.2, "end": 4465.76, "text": "was nachvollziehen muss und das wichtigste kommando ever um sache nach"}, {"id": 617, "start": 4465.76, "end": 4472.72, "text": "zu vollziehen können das mit dem stash zeige ich euch gleich die die die die"}, {"id": 618, "start": 4472.72, "end": 4477.96, "text": "wichtigste sache um nachzuvollziehen können wer es verkackt hat ist ist und"}, {"id": 619, "start": 4477.96, "end": 4488.0, "text": "bleibt das da geht play zeigt euch an wer in welchem kommet diese zeile in"}, {"id": 620, "start": 4488.0, "end": 4490.96, "text": "der datei hinzugefügt hat beziehungsweise zuletzt editiert hat"}, {"id": 621, "start": 4490.96, "end": 4495.0, "text": "sieht sehr unübersichtlich aus da kann ich euch empfehlen das tatsächlich nicht"}, {"id": 622, "start": 4495.0, "end": 4500.24, "text": "auf der konsole zu machen sondern in dem editor oder so aber hier sieht man"}, {"id": 623, "start": 4500.24, "end": 4504.6, "text": "komplett wer was gemacht hat in der datei also wir sehen zum beispiel dass"}, {"id": 624, "start": 4504.6, "end": 4508.44, "text": "ihr den dennis oben das angepasst hat dann hat er der avenue das ist der"}, {"id": 625, "start": 4508.44, "end": 4513.12, "text": "overview js mann ich finde es übrigens geil dass ich das dass ich avenue"}, {"id": 626, "start": 4513.12, "end": 4518.56, "text": "spricht also so wie so eine straße quasi der das hier angepasst und so"}, {"id": 627, "start": 4518.56, "end": 4522.88, "text": "findet man in kombination mit dem normalen lock und follow auf die datei"}, {"id": 628, "start": 4522.88, "end": 4527.16, "text": "ziemlich schnell raus wie man wie man was machen kann"}, {"id": 629, "start": 4527.16, "end": 4531.44, "text": "es gibt noch ein paar übelst abgedrehte tools um rauszufinden wann was kaputt"}, {"id": 630, "start": 4531.44, "end": 4535.12, "text": "war da gibt es noch hier geht bisect und sowas das da will ich jetzt nicht so"}, {"id": 631, "start": 4535.12, "end": 4539.32, "text": "sehr ins detail gehen das ist aber auch gerade für leute die so was machen"}, {"id": 632, "start": 4539.32, "end": 4543.2, "text": "müssen wie ich öfters mal rausfinden wer es an welcher stelle kaputt gemacht"}, {"id": 633, "start": 4543.2, "end": 4546.48, "text": "hat beziehungsweise welcher kommet es kaputt gemacht hat ist das hier eine"}, {"id": 634, "start": 4546.48, "end": 4551.64, "text": "sache die man sich mal merken sollte das halbiert einfach immer die history"}, {"id": 635, "start": 4551.64, "end": 4554.32, "text": "bis da fehler gefunden wurde das können wir irgendwann anders machen das ist"}, {"id": 636, "start": 4554.32, "end": 4557.96, "text": "jetzt ein bisschen ein bisschen zu viel genau und ich wollte euch das mit dem"}, {"id": 637, "start": 4557.96, "end": 4561.8, "text": "stash noch mal zeigen weil das mit dem stash"}, {"id": 638, "start": 4562.12, "end": 4568.92, "text": "äußerst äußerst praktisch ist so wir gehen jetzt mal von aus wir machen"}, {"id": 639, "start": 4568.92, "end": 4574.48, "text": "einen neuen wir haben einen neuen bratsch obwohl davon hat geantwortet"}, {"id": 640, "start": 4577.08, "end": 4581.88, "text": "wo davon müsste gerade geantwortet haben"}, {"id": 641, "start": 4581.88, "end": 4591.0, "text": "wo bitte melde dich dazu direkt noch mal per p.m. da können die zuständigen"}, {"id": 642, "start": 4591.0, "end": 4598.52, "text": "kollegen sich direkt soll ich jetzt soll ich jetzt ich schreibe jetzt ich"}, {"id": 643, "start": 4598.52, "end": 4605.36, "text": "schreibe jetzt das hier alte mmo alte mmo gewohnheit ich schreibe jetzt das in"}, {"id": 644, "start": 4605.36, "end": 4617.36, "text": "die p.m. meld was soll ich denn sonst noch schreibe ich finde"}, {"id": 645, "start": 4617.36, "end": 4622.52, "text": "ne ne ne die können ruhig du sagen ich sagte das juckt mich überhaupt nicht"}, {"id": 646, "start": 4622.52, "end": 4629.28, "text": "die sollen den scheiß beheben die haben nette support grills die dürfen ruhig"}, {"id": 647, "start": 4629.28, "end": 4640.4, "text": "du sagen das ist okay ja ich schicke das noch dabei"}, {"id": 648, "start": 4640.4, "end": 4648.04, "text": "ok zack moment ich muss wundervon p.m. ich muss wundervon p.m. schicken"}, {"id": 649, "start": 4648.04, "end": 4655.2, "text": "wo ist meine p.m. dieses twitter das twitter layout im browser wenn es zu"}, {"id": 650, "start": 4655.2, "end": 4661.16, "text": "kleines da findet man auch überhaupt nix nachrichten wundervon"}, {"id": 651, "start": 4661.16, "end": 4679.6, "text": "okay ich habe jetzt geschrieben meld was soll ich sonst machen"}, {"id": 652, "start": 4679.6, "end": 4694.44, "text": "gut weiter im text um 10 macht das support der support hat bestimmt feierabend"}, {"id": 653, "start": 4694.44, "end": 4700.76, "text": "erwarte ich heute abend jetzt auch nix so also stash wollte ich zeigen so was"}, {"id": 654, "start": 4700.76, "end": 4706.72, "text": "auch was finde ich eines der under justesten geht sachen überhaupt ist mal"}, {"id": 655, "start": 4706.72, "end": 4710.76, "text": "angenommen man ist jetzt in irgendeinem anderen branche trennen check out wir"}, {"id": 656, "start": 4710.76, "end": 4717.6, "text": "gehen jetzt mal in den anderen branche in den eier ja das ist mein ach so minus"}, {"id": 657, "start": 4717.6, "end": 4722.92, "text": "b das ist mein eier ja feature branche haben die nicht 24 7 ich glaube der"}, {"id": 658, "start": 4722.92, "end": 4727.64, "text": "endkundensupporter mit den leuten die antworten 24 7 aber die leute die"}, {"id": 659, "start": 4727.64, "end": 4731.76, "text": "wirklich was was was fixen an den geräten die haben bestimmt auch mal"}, {"id": 660, "start": 4731.76, "end": 4737.92, "text": "irgendwann feierabend also jetzt sind wir in einem anderen branche wir machen"}, {"id": 661, "start": 4737.92, "end": 4744.08, "text": "jetzt mal ein neuer teile keine hallo punkt txt so und jetzt haben wir eine"}, {"id": 662, "start": 4744.08, "end": 4749.44, "text": "uncommittede datei und jetzt kommt der chef zu uns hat wurde auch noch nie in"}, {"id": 663, "start": 4749.44, "end": 4757.08, "text": "techniker geschickt bis jetzt nicht eigentlich ist doch gar ganz gut weil"}, {"id": 664, "start": 4757.08, "end": 4764.84, "text": "er müsste den weg freiräumen dass er da hinkommt ok also ich habe jetzt eine"}, {"id": 665, "start": 4764.84, "end": 4769.28, "text": "neue datei angelegt hallo punkt txt und bin da gerade wild wild am editieren"}, {"id": 666, "start": 4769.28, "end": 4774.64, "text": "trennen und zwar ich mache hier drin zum beispiel keine liste warum c++ sagt so"}, {"id": 667, "start": 4774.64, "end": 4779.72, "text": "c plus c triple plus das ist sogar noch noch mal besser sagt so mache ich eine"}, {"id": 668, "start": 4779.72, "end": 4784.84, "text": "tolle liste weil so und so und während ich am schreiben bin kommt mein chef"}, {"id": 669, "start": 4784.84, "end": 4790.96, "text": "rein nach max ganz wichtig wir müssen was hotfixen weil das ist produktiv und"}, {"id": 670, "start": 4790.96, "end": 4794.16, "text": "kaputt und sonst was ich ane ich bin auch gerade dabei mir eine liste zu"}, {"id": 671, "start": 4794.16, "end": 4799.0, "text": "erstellen dass c++ scheiße ist aber kein problem ich mache nachher weiter"}, {"id": 672, "start": 4799.0, "end": 4805.48, "text": "deswegen sage ich jetzt geht stash akumulat zahmar cheat 95 kann das sein"}, {"id": 673, "start": 4805.48, "end": 4810.32, "text": "dass ich dich vorhin in irgendeinem anderen chat gesehen habe"}, {"id": 674, "start": 4810.32, "end": 4815.36, "text": "ich bilde mir ein ich habe dich vorhin in irgendeinem anderen chat gesehen in"}, {"id": 675, "start": 4815.36, "end": 4819.32, "text": "irgendeinem anderen programmier stream"}, {"id": 676, "start": 4823.12, "end": 4829.08, "text": "dings hier von von von einem gott von einem deutschen spiele programmierer"}, {"id": 677, "start": 4829.08, "end": 4832.36, "text": "der sich darüber ausgelassen hat wie scheiße es in deutschland in der spiele"}, {"id": 678, "start": 4832.36, "end": 4843.48, "text": "szene zu arbeiten ich andi def genau ja ja stimmt"}, {"id": 679, "start": 4843.48, "end": 4847.6, "text": "dann warst du das ok ich wusste ich dachte mir der name kommt mir irgendwie"}, {"id": 680, "start": 4847.6, "end": 4851.88, "text": "bekannt vor ich habe das sogar rumgespammt vielleicht"}, {"id": 681, "start": 4851.88, "end": 4859.56, "text": "dass mich auch gesehen so als ob max den andi def klar habe ich vorhin reingeguckt"}, {"id": 682, "start": 4859.56, "end": 4865.52, "text": "so wie gesagt schäfer da gesagt jetzt müssen wir uns unbedingt machen aber ich"}, {"id": 683, "start": 4865.52, "end": 4869.64, "text": "kann ja eigentlich gar nicht weil ich bin ja gerade dabei diese diese meine"}, {"id": 684, "start": 4869.64, "end": 4873.2, "text": "liste zu editieren warum c++ sagt was ich jetzt nicht machen will ich will"}, {"id": 685, "start": 4873.2, "end": 4876.72, "text": "jetzt noch kein kommet machen weil das ist ja noch gar nicht fertig also was"}, {"id": 686, "start": 4876.72, "end": 4880.36, "text": "ich jetzt mache ist geht es also übrigens eine sache doch und das ist"}, {"id": 687, "start": 4880.36, "end": 4885.32, "text": "das was viele auch verkacken wenn jetzt ein get checker und master macht nimmt"}, {"id": 688, "start": 4885.32, "end": 4890.28, "text": "geht das standardmäßig mit also sprich die änderung die ich in dem anderen"}, {"id": 689, "start": 4890.28, "end": 4903.92, "text": "branche angefangen habe nimmt damit so und das verwirrt viele leute so was man"}, {"id": 690, "start": 4903.92, "end": 4907.52, "text": "jetzt machen kann ich edde die datei erste mal also dass das habe ich das"}, {"id": 691, "start": 4907.52, "end": 4914.0, "text": "habe ich schon gemacht dann sieht man nämlich schöner ok und was ich jetzt"}, {"id": 692, "start": 4914.0, "end": 4918.64, "text": "machen kann ist ich möchte jetzt diese datei erst mal weg haben aus meinem"}, {"id": 693, "start": 4918.64, "end": 4923.0, "text": "working directory und nachher weitermachen also sage ich gibt's das"}, {"id": 694, "start": 4923.0, "end": 4928.92, "text": "siehst du bem datai ist weg jetzt gehe ich in master da soll ich ja was für"}, {"id": 695, "start": 4928.92, "end": 4933.2, "text": "mein chef machen und zwar soll ich hier cute chat 2 editieren da muss"}, {"id": 696, "start": 4933.2, "end": 4937.56, "text": "unbedingt eine 4 hin weil der vorstand hat angerufen hat gesagt das muss mit"}, {"id": 697, "start": 4937.56, "end": 4941.0, "text": "vier enden weil es muss durch zwei teilbar sein sonst ist die anzeige"}, {"id": 698, "start": 4941.0, "end": 4946.4, "text": "raus und dann machen wir das"}, {"id": 699, "start": 4946.72, "end": 4954.0, "text": "erkommitten wir das mit einer super tollen kommet message kappa poch hd"}, {"id": 700, "start": 4954.0, "end": 4959.0, "text": "und dann sind wir fertig und jetzt wechseln wir zurück in unseren anderen"}, {"id": 701, "start": 4959.0, "end": 4961.32, "text": "branche"}, {"id": 702, "start": 4963.52, "end": 4967.28, "text": "und wollen weitermachen unserer z plus plus liste das problem ist jetzt wir"}, {"id": 703, "start": 4967.28, "end": 4969.68, "text": "haben die ja gestascht also die ist ja gar nicht mehr da"}, {"id": 704, "start": 4969.68, "end": 4974.76, "text": "deswegen sagen wir jetzt einfach geht stash pop und schon seht ihr ist das"}, {"id": 705, "start": 4974.76, "end": 4978.56, "text": "ganze wieder da und wir können genau an der gleichen stelle weitermachen wo wir"}, {"id": 706, "start": 4978.56, "end": 5007.8, "text": "vorhin aufgehört haben so sieht es aus also hallo andy der"}, {"id": 707, "start": 5007.8, "end": 5014.8, "text": "also so könnte das einfach in eurem git repo machen wenn der chef reinkommt und"}, {"id": 708, "start": 5014.8, "end": 5020.88, "text": "sagt danke für die erwähnung wie kommste ich habe bei mir im chat gerade"}, {"id": 709, "start": 5020.88, "end": 5025.08, "text": "den cheat 95 wieder erkannt und habe ihn gefragt ob ich ihn nicht vorher"}, {"id": 710, "start": 5025.08, "end": 5031.0, "text": "irgendwo in dem chat gesehen habe oder hat er gemeint ja war andy der stimmt"}, {"id": 711, "start": 5031.0, "end": 5039.64, "text": "genau so sind wir auf die ganze geschichte geklappt ich wusste ich"}, {"id": 712, "start": 5039.64, "end": 5044.16, "text": "wusste nicht mal genau wie der channel heißt ich habe gesagt ich war vorhin ich"}, {"id": 713, "start": 5044.16, "end": 5047.32, "text": "habe dich vorhin in dem channel gesehen bei einem deutschen spiel entwickler"}, {"id": 714, "start": 5047.32, "end": 5050.2, "text": "dass ich drüber aufgeregt hat wie scheiß ist in deutschland spiel entwickler zu"}, {"id": 715, "start": 5050.2, "end": 5056.48, "text": "sein da hat er cheat gemeint das muss andy der gewesen genau ja ich habe"}, {"id": 716, "start": 5056.48, "end": 5061.8, "text": "vorhin mal die ganze science and technology kategorie ein bisschen"}, {"id": 717, "start": 5061.8, "end": 5064.88, "text": "durchgekuckt auf tritt schon ist mir aufgefallen dass es mittlerweile doch"}, {"id": 718, "start": 5064.88, "end": 5070.16, "text": "recht viele deutschsprachige channels in dem bereich gibt es also viele vier"}, {"id": 719, "start": 5070.16, "end": 5074.64, "text": "stück im vergleich zu früher"}, {"id": 720, "start": 5075.32, "end": 5081.32, "text": "nee das war ich ich fand das gut ich es gibt auch so dinge ich habe auch so"}, {"id": 721, "start": 5081.32, "end": 5084.6, "text": "dinge wo ich mich wo ich mich übelst übelst einfach einfach dringern lasse"}, {"id": 722, "start": 5084.6, "end": 5090.52, "text": "chat sagt man was gibt es denn da so gefällt gerade nichts ein aber es gibt"}, {"id": 723, "start": 5090.52, "end": 5095.72, "text": "dinge die muss ich auch jeden stream bestimmt dreimal erzählen"}, {"id": 724, "start": 5095.72, "end": 5103.4, "text": "t plus plus richtig richtig t plus plus triggert mich auch immer ja"}, {"id": 725, "start": 5103.4, "end": 5108.68, "text": "wo davon und wo davon auch ja und java stimmt was ich hier mache aktuell"}, {"id": 726, "start": 5108.68, "end": 5115.76, "text": "ehrlich gesagt gar nichts ich habe gerade versucht den leuten irgendwie"}, {"id": 727, "start": 5115.76, "end": 5120.68, "text": "pagittricks zu er zu zeigen aber eigentlich wollte ich nur gucken ob"}, {"id": 728, "start": 5120.68, "end": 5125.8, "text": "wo davon wieder funktioniert und ich hatte für diesen stream heute absolut"}, {"id": 729, "start": 5125.8, "end": 5129.68, "text": "kein plan was ich machen sollte ehrlich gesagt ja"}, {"id": 730, "start": 5130.12, "end": 5133.64, "text": "ja wo davon hat geantwortet mal gucken ich habe vor davon auch gar von"}, {"id": 731, "start": 5133.64, "end": 5140.48, "text": "schau mal was rauskommt was erzählen mal an die deft die"}, {"id": 732, "start": 5140.48, "end": 5144.8, "text": "geschichte mit dem bahn klo das putet auch gar nicht das kann ich das ist die"}, {"id": 733, "start": 5144.8, "end": 5150.92, "text": "bahn triggert mich auch oft du programmierst wohner vorn oder zum"}, {"id": 734, "start": 5150.92, "end": 5156.04, "text": "glück nicht zum glück zum glück prokramiert nicht an wohner vorn rum"}, {"id": 735, "start": 5156.04, "end": 5159.24, "text": "wo fuck"}, {"id": 736, "start": 5159.24, "end": 5163.24, "text": "ach ja und solche nachrichten triggern mich auch auf der arbeite hatten was auch"}, {"id": 737, "start": 5163.24, "end": 5168.76, "text": "gerade von ja"}, {"id": 738, "start": 5170.12, "end": 5175.76, "text": "wo davon plus plus hör mal auf also wenn man zwei sachen verbinden könnte"}, {"id": 739, "start": 5175.76, "end": 5180.2, "text": "die wo davon plus plus das passt eigentlich ziemlich gut zusammen das"}, {"id": 740, "start": 5180.2, "end": 5186.28, "text": "sind zwei zwei sachen die sind zwar komplett passen überhaupt nicht"}, {"id": 741, "start": 5186.28, "end": 5193.36, "text": "zusammen auf den ersten blick aber die haben sehr viel gemeinsamkeiten sitzt"}, {"id": 742, "start": 5193.36, "end": 5197.88, "text": "der hast tiefer gegen wo davon oder gegen die bahn also man muss sagen"}, {"id": 743, "start": 5197.88, "end": 5201.48, "text": "externe berater triggern auch ja externe berater triggern mich auch"}, {"id": 744, "start": 5201.48, "end": 5207.84, "text": "manchmal man muss sagen ich hasse weder wirklich also hassen ist ich hasse"}, {"id": 745, "start": 5207.84, "end": 5212.16, "text": "weder wo davon noch die bahn die regen mich manchmal auf aber von"}, {"id": 746, "start": 5212.16, "end": 5216.28, "text": "hassen das würde ja bedeuten dass ich dass ich irgendwie persönlich irgendwas"}, {"id": 747, "start": 5216.28, "end": 5219.56, "text": "gegen gegen den typ ab der in der bahn tickets kontrolliert also das ist ja"}, {"id": 748, "start": 5219.56, "end": 5224.28, "text": "nicht so die können ja für den ganzen mist auch nichts genauso wenig wie die"}, {"id": 749, "start": 5224.28, "end": 5228.36, "text": "service mit arbeiter hier bei wo davon irgendwas können wer dafür was kann"}, {"id": 750, "start": 5228.36, "end": 5231.68, "text": "internet in deutschland ist auch so ein thema was mich was mich übelst triggern"}, {"id": 751, "start": 5231.68, "end": 5233.88, "text": "oftmals"}, {"id": 752, "start": 5233.88, "end": 5242.96, "text": "ja macht deine augenweite ist denn also wie gesagt ich hasse weder die bahn noch"}, {"id": 753, "start": 5242.96, "end": 5246.88, "text": "noch wo davon noch sonst was vor allem schon gar nicht die mitarbeiter"}, {"id": 754, "start": 5246.88, "end": 5250.72, "text": "mitarbeiter irgendwie von da von der bahn"}, {"id": 755, "start": 5250.72, "end": 5265.24, "text": "ach moment war an die def jetzt mit mit seinem stream live in meinem stream oder"}, {"id": 756, "start": 5265.24, "end": 5271.6, "text": "was das war jetzt aber stream stream section nun gut um was oder eigentlich"}, {"id": 757, "start": 5271.6, "end": 5277.16, "text": "zurückzukommen wie gesagt ich hasse ich hasse die nicht ist schon schon ich hab"}, {"id": 758, "start": 5277.16, "end": 5280.6, "text": "schon mal gar nichts gegen die gegen die service mitarbeiter oder so wo ich was"}, {"id": 759, "start": 5280.6, "end": 5285.48, "text": "gegen hab ist zum beispiel der internet ausbau in deutschland"}, {"id": 760, "start": 5285.48, "end": 5289.04, "text": "der geht mir echt auf den sack beziehungsweise was wir hier mit unserer"}, {"id": 761, "start": 5289.04, "end": 5293.6, "text": "infrastruktur machen und das ist so ein thema das haben wo davon und die bahn"}, {"id": 762, "start": 5293.6, "end": 5299.44, "text": "gemeinsam beides ist irgendwo infrastruktur und beides ist"}, {"id": 763, "start": 5299.44, "end": 5304.8, "text": "infrastruktur da was eigentlich für die sagen wir mal sagen wir jetzt mal hoch"}, {"id": 764, "start": 5304.8, "end": 5308.4, "text": "hochgesteckt sagen wir jetzt mal für die menschen im land da sein sollte ja"}, {"id": 765, "start": 5308.4, "end": 5315.2, "text": "beides versucht geld zu verdienen und und meiner mein nach wo davon"}, {"id": 766, "start": 5316.0, "end": 5320.08, "text": "ja wo davon ist da fast auf fast das meine ich noch noch mehr berechtigt"}, {"id": 767, "start": 5320.08, "end": 5324.08, "text": "geld zu verdienen als die bahn weil ich finde gerade zur mobilitäts"}, {"id": 768, "start": 5324.08, "end": 5329.84, "text": "infrastruktur genauso wie krankenhäuser und sowas soll nicht primär dafür da"}, {"id": 769, "start": 5329.84, "end": 5335.96, "text": "sein um gewinn zu machen sondern quasi um die um die leute zu versorgen bei"}, {"id": 770, "start": 5335.96, "end": 5338.96, "text": "wo davon muss ich sagen ok"}, {"id": 771, "start": 5339.64, "end": 5344.88, "text": "wo davon darf schon das aus meiner sicht das ganze schon darauf auslegen gewinn"}, {"id": 772, "start": 5344.88, "end": 5349.52, "text": "zu machen aber es gibt ja oftmals gar keine alternativen"}, {"id": 773, "start": 5349.52, "end": 5354.8, "text": "die leute haben entweder den telekom oder wo davon was anderes gibt es nicht"}, {"id": 774, "start": 5355.24, "end": 5359.6, "text": "und deswegen fehlen da auch die nötigen vorgaben irgendwie du kannst in"}, {"id": 775, "start": 5359.6, "end": 5363.56, "text": "deutschland so eine kacke anbieten und die leute müssen es kaufen weil was hast"}, {"id": 776, "start": 5363.56, "end": 5369.4, "text": "du denn für eine auswahl ich bin ja quasi schon gesegnet im endeffekt hast"}, {"id": 777, "start": 5369.4, "end": 5372.96, "text": "du zufällig das neue video von simplicissimus gesehen die habe ich nicht"}, {"id": 778, "start": 5372.96, "end": 5379.68, "text": "ich bin ja relativ gesegnet was das ganze angeht noch ich meine ich kann ich"}, {"id": 779, "start": 5379.68, "end": 5388.0, "text": "habe die auswahl zwischen voter von 440 ab was macht die cia in frankfurt"}, {"id": 780, "start": 5388.0, "end": 5399.8, "text": "nee was denn bei was bei was soll ich gucken vier minuten"}, {"id": 781, "start": 5399.8, "end": 5402.8, "text": "das wohl wo steht hier vier minuten vier minuten 30"}, {"id": 782, "start": 5402.8, "end": 5411.72, "text": "in frankfurt ist das größte us konsulat der welt perfekt um camp aufzuschlagen"}, {"id": 783, "start": 5411.72, "end": 5415.6, "text": "wenn man dann zum beispiel den französischen präsidenten belauschen"}, {"id": 784, "start": 5415.6, "end": 5421.12, "text": "will setzt sich ein cia agent einfach in frankfurt in einen zug und kommt nicht"}, {"id": 785, "start": 5421.12, "end": 5423.36, "text": "an er wieder aus weil die bahn nicht fährt und"}, {"id": 786, "start": 5423.36, "end": 5428.72, "text": "versteht was wir meinen genauso ist es so sieht es aus"}, {"id": 787, "start": 5428.72, "end": 5437.04, "text": "irgendwie erinnert mich die stimme von dem wissen wir nämlich erinnert das ist"}, {"id": 788, "start": 5437.04, "end": 5441.0, "text": "mir das fällt mir jedes mal auf wenn ich die die videos von ihm anhöre"}, {"id": 789, "start": 5441.0, "end": 5446.8, "text": "perfekt um camp aufzuschlagen er erinnert mich übertrieben an ihn hier"}, {"id": 790, "start": 5446.8, "end": 5452.32, "text": "von der stimme her falls sie nur irgendjemand kennt"}, {"id": 791, "start": 5452.32, "end": 5458.16, "text": "die fordernden spielberichterstatter mit nah mit seiner youtube stimme vielleicht"}, {"id": 792, "start": 5458.16, "end": 5462.16, "text": "weniger aber wenn man so mit ihm im skype gelabert hat hat sehr ähnlich"}, {"id": 793, "start": 5462.16, "end": 5475.2, "text": "angehört freiheitsliebende auch sozusagen so und damit sage ich mal"}, {"id": 794, "start": 5475.2, "end": 5480.44, "text": "herzlich willkommen habe heute finde ich auch schon angekündigt also ein bisschen"}, {"id": 795, "start": 5480.44, "end": 5483.72, "text": "ein bisschen aber wenn er normal redet und nicht seine commentary stimme am"}, {"id": 796, "start": 5483.72, "end": 5489.32, "text": "start hat dann dann hört sich das wirklich ziemlich ähnlich an"}, {"id": 797, "start": 5489.32, "end": 5495.24, "text": "direkt übertragen nicht gleich erst mal zur linken seite der karte wir können"}, {"id": 798, "start": 5495.24, "end": 5508.68, "text": "mal sagen hier das hat schon hat schon gewisse ähnlichkeit ja oh gott noch"}, {"id": 799, "start": 5508.68, "end": 5516.68, "text": "skalli ja stimmt stimmt ist blöd dass so viele leute weg sind so das habe ich"}, {"id": 800, "start": 5516.68, "end": 5520.84, "text": "euch ein bisschen jitt jitt magic gezeigt zum abschluss hier noch"}, {"id": 801, "start": 5520.84, "end": 5524.44, "text": "beenden wir die eine frage noch dass ich nächsten striem nicht wieder davon"}, {"id": 802, "start": 5524.44, "end": 5527.76, "text": "anfangen muss nämlich das hier was das in bau gefragt hat wie das bei mir"}, {"id": 803, "start": 5527.76, "end": 5530.56, "text": "daheim aussieht mit mit mit home office wie gesagt ich habe mich jetzt ein"}, {"id": 804, "start": 5530.56, "end": 5536.0, "text": "bisschen über git geschichten ausgelassen leute dies verkacken so da"}, {"id": 805, "start": 5536.0, "end": 5539.76, "text": "kommen natürlich noch ein paar andere sachen dazu es kommen irgendwelche"}, {"id": 806, "start": 5539.76, "end": 5546.56, "text": "täglichen meeting geschichten dazu da gibt es wartungsarbeiten runden und"}, {"id": 807, "start": 5546.56, "end": 5553.92, "text": "und von unserem service 24 sieben support es ist kein 24 sieben support"}, {"id": 808, "start": 5553.92, "end": 5557.76, "text": "nicht das stimmt so nicht von unserem monitoring team da haben wir einmal im"}, {"id": 809, "start": 5557.76, "end": 5561.08, "text": "tag eine runde wo ich mich dabei hocke dann haben wir ab und zu team runde da"}, {"id": 810, "start": 5561.08, "end": 5565.52, "text": "haben wir irgendwelche abteilungs runden also es wird es wird öfters wird öfters"}, {"id": 811, "start": 5565.52, "end": 5570.68, "text": "mal gemietet und da gibt es manchmal tage da hast du wirklich fünf sachen"}, {"id": 812, "start": 5570.68, "end": 5574.92, "text": "wurde ganz nach nichts anderes macht außer sinnlos mieten das sagt natürlich"}, {"id": 813, "start": 5574.92, "end": 5577.76, "text": "aber was willst du machen letztendlich wenn man unter dem"}, {"id": 814, "start": 5577.76, "end": 5581.12, "text": "strich betrachtet ich habe ich habe aufgehört mich da so so extrem darüber"}, {"id": 815, "start": 5581.12, "end": 5585.16, "text": "aufzuregen wenn zu viel gemietet wird weil ich denke mir die haben die haben"}, {"id": 816, "start": 5585.16, "end": 5590.16, "text": "zwei sachen zur auswahl die können mich dafür bezahlen dass ich was sinnvolles"}, {"id": 817, "start": 5590.16, "end": 5595.0, "text": "mache oder die können mich dafür bezahlen dass ich rum sitze und nix"}, {"id": 818, "start": 5595.0, "end": 5602.04, "text": "mache also und wenn man die wahl hat und man wählt ich soll rum sitzen und nix"}, {"id": 819, "start": 5602.04, "end": 5606.0, "text": "machen ist das auch vollkommen in ordnung"}, {"id": 820, "start": 5609.2, "end": 5612.76, "text": "vollkommen in ordnung er schied 95 da ist er recht"}, {"id": 821, "start": 5612.76, "end": 5616.64, "text": "ja zu zählen zum thema merckst du jetzt bin ich ja noch gar nicht gekommen so"}, {"id": 822, "start": 5616.64, "end": 5621.72, "text": "und dann kommt ganz drauf an was an diesem tag ansteht gibt es irgendwelche"}, {"id": 823, "start": 5621.72, "end": 5624.64, "text": "neue releases müssen irgendwelche sachen getestet werden müssen irgendwelche"}, {"id": 824, "start": 5624.64, "end": 5628.2, "text": "sachen gehort fix werden müssen irgendwelche sachen dokumentiert werden"}, {"id": 825, "start": 5628.2, "end": 5632.68, "text": "müssen vielleicht vielleicht irgendwelche automatisierung sachen ein bisschen umgeskriptet werden oder sonst was"}, {"id": 826, "start": 5632.68, "end": 5640.24, "text": "irgendwas was halt in meinen bereich noch fällt gibt es vielfältige sachen die"}, {"id": 827, "start": 5640.24, "end": 5648.68, "text": "sein können das mache ich den restlichen tag über ja ja leider leider muss ich"}, {"id": 828, "start": 5648.68, "end": 5656.0, "text": "sagen ist in letzter zeit ich habe es ja schon mal gesagt"}, {"id": 829, "start": 5656.0, "end": 5662.68, "text": "leider ist in letzter zeit ein bisschen wenig selbst programmieren angesagt"}, {"id": 830, "start": 5664.48, "end": 5667.88, "text": "leider ist ein bisschen wenig selbst programmieren angesagt so die letzt"}, {"id": 831, "start": 5667.88, "end": 5671.56, "text": "ist eigentlich schon die letzten paar jahre so aber was ich so aber dafür habe ich"}, {"id": 832, "start": 5671.56, "end": 5682.52, "text": "die da dafür habe ich ja den chat und mein rumgebastel hier auf twitch"}, {"id": 833, "start": 5682.52, "end": 5687.52, "text": "da muss ich dann nichts mehr programmieren was ich letztens"}, {"id": 834, "start": 5687.52, "end": 5693.16, "text": "gebastelt haben was weiß ich was ist was tatsächlich ganz cool ist unser support"}, {"id": 835, "start": 5693.16, "end": 5699.04, "text": "von dem ich gerade erzählt habe unser monitoring anguck team ich kann ich kann"}, {"id": 836, "start": 5699.04, "end": 5702.08, "text": "ich kann nicht wirklich sagen wie das team heißt weil das ist ein ziemlich"}, {"id": 837, "start": 5702.08, "end": 5707.48, "text": "unik name den sonst keiner verwendet also wir haben ein team das ist quasi quasi"}, {"id": 838, "start": 5707.48, "end": 5710.76, "text": "so es ist nicht wirklich eine art es ist nicht wirklich in first level aber ich"}, {"id": 839, "start": 5710.76, "end": 5716.52, "text": "beschreibe ihn mal als first level wir haben ein team das hat so ein operation"}, {"id": 840, "start": 5716.52, "end": 5721.2, "text": "center ist das quasi ja können operation center nennen die haben alle"}, {"id": 841, "start": 5721.2, "end": 5725.64, "text": "monitorin mann gucken ob da irgendwelche monitorin geschichten aufschlagen ob"}, {"id": 842, "start": 5725.64, "end": 5730.16, "text": "jetzt irgendwelche fehlermeldung kommen und dann leiten sie halt die notwendige"}, {"id": 843, "start": 5730.16, "end": 5736.96, "text": "entstörung und koordination in die wege ja so operation hauptquartier so was"}, {"id": 844, "start": 5736.96, "end": 5744.48, "text": "in der richtung genau und jetzt habe ich vergessen was ich damit genau und da"}, {"id": 845, "start": 5744.48, "end": 5750.2, "text": "kommen manchmal leute auf die glorreiche idee dort etwas brain debt"}, {"id": 846, "start": 5750.2, "end": 5755.48, "text": "aufgaben abzuladen weil so nach dem motto ok die sind eh 24 7 da das heißt"}, {"id": 847, "start": 5755.48, "end": 5758.92, "text": "man kann da auch die unnötigsten aufgaben wo man keinen bock hat sich drum"}, {"id": 848, "start": 5758.92, "end": 5771.52, "text": "zu kümmern hin hin verlagern so und wir haben einen externen anbieter für spam"}, {"id": 849, "start": 5771.52, "end": 5777.08, "text": "filtern wir filtern zwar intern auch mal spam aber wir haben noch einen externen"}, {"id": 850, "start": 5777.08, "end": 5782.72, "text": "anbieter weil unsere reputation für mail relay nicht gut genug ist da sind"}, {"id": 851, "start": 5782.72, "end": 5792.6, "text": "vergleich spam wir machen das über den externen anbieter zumindest ist der mail"}, {"id": 852, "start": 5792.6, "end": 5799.16, "text": "filter von dem externen anbieter ein bisschen sehr scharf eingestellt und es"}, {"id": 853, "start": 5799.16, "end": 5807.6, "text": "kommt vor dass mails die quasi kunden bei uns verschicken über unser system"}, {"id": 854, "start": 5807.6, "end": 5812.96, "text": "dass die als spam klassifiziert werden"}, {"id": 855, "start": 5814.76, "end": 5819.12, "text": "und die landen dann im spam ordner und die kann man relativ einfach erkennen"}, {"id": 856, "start": 5819.12, "end": 5823.88, "text": "anhand der absender adresse so und da kam jetzt irgendjemand auf die idee und"}, {"id": 857, "start": 5823.88, "end": 5828.6, "text": "musste entscheiden ok wir geben das unseren programmierern die das mal"}, {"id": 858, "start": 5828.6, "end": 5832.4, "text": "ordentlich programmieren dass das spam system nicht so viele anhaltspunkte für"}, {"id": 859, "start": 5832.4, "end": 5837.76, "text": "spam findet und die mails gar nicht im spam ordner landen das war das war die"}, {"id": 860, "start": 5837.76, "end": 5842.64, "text": "das war die eine möglichkeit die zweite möglichkeit war wir geben das unserem"}, {"id": 861, "start": 5842.64, "end": 5849.52, "text": "24 7 support dass der einfach fünf mal am tag ins web interface geht und spam von"}, {"id": 862, "start": 5849.52, "end": 5862.76, "text": "hand frei gibt ratet mal für welche variante man sich entschieden hat für die"}, {"id": 863, "start": 5862.76, "end": 5879.88, "text": "five hat variante richtig warum trendet festsplatte eigentlich watt"}, {"id": 864, "start": 5885.76, "end": 5890.08, "text": "management genau also die hatten den auftrag sie müssen das ganze sie"}, {"id": 865, "start": 5890.08, "end": 5896.12, "text": "müssen das ganze manuell von hand frei geben was natürlich ziemlich sagt habe"}, {"id": 866, "start": 5896.12, "end": 5903.4, "text": "ich mir gedacht ok tun wir den mal gefallen und basteln was was was ihnen"}, {"id": 867, "start": 5903.4, "end": 5906.0, "text": "hilft das war eines der sachen die sie letztes"}, {"id": 868, "start": 5906.0, "end": 5908.72, "text": "einmal wirklich wieder programmiert haben und zwar habe ich was kleines"}, {"id": 869, "start": 5908.72, "end": 5912.92, "text": "gebastelt dort net core weil wenn ich eigene projekte"}, {"id": 870, "start": 5912.92, "end": 5916.44, "text": "macht die wodurch dran beteiligt mir ganz ohne problem in dort net core machen"}, {"id": 871, "start": 5916.44, "end": 5920.88, "text": "da muss kann ich ja was nehmen was womit ich klarkommen womit kein anderer"}, {"id": 872, "start": 5920.88, "end": 5924.6, "text": "klarkommen muss habe ich dort net core projekt gemacht so dass es halt auch"}, {"id": 873, "start": 5924.6, "end": 5932.28, "text": "unterlinungs läuft und hab das automatisiert so funktioniert folgendermassen"}, {"id": 874, "start": 5932.28, "end": 5936.52, "text": "es ist relativ klein was hat das am ende 400 zeilen oder so also es ist recht"}, {"id": 875, "start": 5936.52, "end": 5942.6, "text": "recht überschaubar oder 500 ist nicht so viel ist recht überschaubar so und was"}, {"id": 876, "start": 5942.6, "end": 5949.56, "text": "es macht im endeffekt ist es nimmt nen embedded embedded chromium nimmt das hier"}, {"id": 877, "start": 5951.76, "end": 5954.76, "text": "das da"}, {"id": 878, "start": 5956.24, "end": 5963.88, "text": "damit kann man nämlich den headless chrome den headless chrome starten aber"}, {"id": 879, "start": 5963.88, "end": 5973.64, "text": "du wurdest nicht beauftragt das zu machen doch wurde ich ich hab mich selbst"}, {"id": 880, "start": 5973.64, "end": 5976.56, "text": "beauftragt indem ich zu meinem chef gegangen bin hab gesagt er soll mich"}, {"id": 881, "start": 5976.56, "end": 5981.88, "text": "beauftragen und dann bin ich zum chef gegangen vom vom support und habe"}, {"id": 882, "start": 5981.88, "end": 5985.84, "text": "gesagt er soll mich beauftragen und beide haben ich beauftragt easy schon"}, {"id": 883, "start": 5985.84, "end": 5988.84, "text": "als auftrag auf geht's"}, {"id": 884, "start": 5988.84, "end": 5993.84, "text": "das hat ja auch nicht lang gedauert halb tache oder so"}, {"id": 885, "start": 5993.84, "end": 5999.16, "text": "ja zumindest ist das ding hier echt praktisch das hat nen embedded chromium"}, {"id": 886, "start": 5999.16, "end": 6004.8, "text": "ein embedded headless chromium chrome wie auch immer also sprich man kann das auf"}, {"id": 887, "start": 6004.8, "end": 6010.88, "text": "einem kommando zeilen system ausführen und dort in webseiten den chrome in"}, {"id": 888, "start": 6010.88, "end": 6015.36, "text": "webseiten rumklicken lassen ohne dass man eine grafische ausgabe braucht das"}, {"id": 889, "start": 6015.36, "end": 6021.32, "text": "was habe ich gemacht ich habe nen browser plugin genommen das user eingaben"}, {"id": 890, "start": 6021.32, "end": 6027.92, "text": "aufzeichnet hab diesen ganzen vorgang was heißt headless ohne ohne grafische"}, {"id": 891, "start": 6027.92, "end": 6033.0, "text": "ausgabe also nun chrome ohne dass du dieses fenster hier siehst aber der"}, {"id": 892, "start": 6033.0, "end": 6036.24, "text": "trotzdem läuft und webseiten aufmachen kann den kannst du dann halt über"}, {"id": 893, "start": 6036.24, "end": 6040.32, "text": "dieses über diese programmierstillstelle steuern"}, {"id": 894, "start": 6040.32, "end": 6044.84, "text": "das heißt du klickst da nicht das heißt du klickst da nicht hier drauf du sagst"}, {"id": 895, "start": 6044.84, "end": 6050.9, "text": "dann newtab navigate ull klick das macht das hier warte auf"}, {"id": 896, "start": 6050.9, "end": 6055.84, "text": "seitenladen so art selenium ja plus das pappertier ist kein dotnet program"}, {"id": 897, "start": 6055.84, "end": 6066.12, "text": "pappertier ist das offizielle das offizielle chromium automatisierungsding"}, {"id": 898, "start": 6066.12, "end": 6074.08, "text": "glaube genau headless chrome node.js api 61.000 sternen hat das bem system keine"}, {"id": 899, "start": 6074.08, "end": 6078.12, "text": "api nein sonst hätte ich es da drüber gemacht und sie haben auch nicht vorher in"}, {"id": 900, "start": 6078.12, "end": 6081.44, "text": "zukunft eine wir haben wahrscheinlich für die letzten crap anbieter gewählt"}, {"id": 901, "start": 6081.44, "end": 6087.2, "text": "oder eine kacklizenz oder was auch immer so zumindest im prinzip unter der haube"}, {"id": 902, "start": 6087.2, "end": 6089.72, "text": "habe ich habe mitgeschnitten mit einem browser plugin was das auf der seite"}, {"id": 903, "start": 6089.72, "end": 6093.8, "text": "macht und habe das dann ein bisschen vereinfachter form in dieses in das dotnet"}, {"id": 904, "start": 6093.8, "end": 6097.8, "text": "core programm gepackt hat ein paar sachen drumherum gebaut das ist eine"}, {"id": 905, "start": 6097.8, "end": 6100.6, "text": "schöne log datei schreiben was es gerade macht wie viele sachen sie freigegeben"}, {"id": 906, "start": 6100.6, "end": 6104.56, "text": "hat und die premium lösung leute die premium lösung die ich eingebaut habe"}, {"id": 907, "start": 6104.56, "end": 6110.32, "text": "nachdem es mit gelockt hat welchen spam es freigibt geht es und das jetzt kommt"}, {"id": 908, "start": 6110.32, "end": 6118.64, "text": "jetzt kommt absolut big brain time danach wenn es was gemacht hat lockte sich bei"}, {"id": 909, "start": 6118.64, "end": 6124.44, "text": "unserem ticket system ein wir haben wir haben so einen extra user für für"}, {"id": 910, "start": 6124.44, "end": 6129.16, "text": "script zugriffe lockte sich bei uns über die jira api im ticket system ein"}, {"id": 911, "start": 6129.16, "end": 6136.88, "text": "sucht das letzte ticket was mit dem titel mit dem titel spam freigeben oder"}, {"id": 912, "start": 6136.88, "end": 6141.88, "text": "sowas sucht das letzte ticket also ordnet sucht alle tickets mit dem titel"}, {"id": 913, "start": 6141.88, "end": 6147.6, "text": "ordnet es nach nach zeit geht in das letzte ticket rein und schreibt dort und"}, {"id": 914, "start": 6147.6, "end": 6154.92, "text": "postet dort drinnen in comment wie viele spams es gefunden hat und wo auf welcher"}, {"id": 915, "start": 6154.92, "end": 6161.64, "text": "email adresse und wie viel es freigegeben hat und dadurch dass es in"}, {"id": 916, "start": 6161.64, "end": 6166.92, "text": "diesem ticket benachrichtigt gibt es automatisch den alert vorne auf der"}, {"id": 917, "start": 6166.92, "end": 6170.88, "text": "monitor wand dass das ticket geupdatet war das heißt alles was die leute noch"}, {"id": 918, "start": 6170.88, "end": 6175.72, "text": "machen müssen ist zu warten bis das script alle 15 minuten einmal gelaufen"}, {"id": 919, "start": 6175.72, "end": 6180.6, "text": "ist das ticket geupdatet hat und dann können sie sagen ok alert ist da sie"}, {"id": 920, "start": 6180.6, "end": 6184.88, "text": "gucken das ticket rein gucken sich den reporter machen das ticket zu"}, {"id": 921, "start": 6184.88, "end": 6186.88, "text": "klicken"}, {"id": 922, "start": 6187.96, "end": 6189.96, "text": "ja"}, {"id": 923, "start": 6192.76, "end": 6199.68, "text": "gibt es die premium lösung auch erst nach einem in app in store sollte ich"}, {"id": 924, "start": 6199.68, "end": 6204.76, "text": "vielleicht mal überlegen sowas ja fati schreibt schreibe aktuell ein"}, {"id": 925, "start": 6204.76, "end": 6208.52, "text": "pappetier script welches datum aus der excel datei unsere sap zeit erfahrt"}, {"id": 926, "start": 6208.52, "end": 6216.92, "text": "i geht also da sieht man schon mal dass beide scheiß software ist weil wenn man"}, {"id": 927, "start": 6216.92, "end": 6221.56, "text": "weil wenn man das über den umweg eines headless"}, {"id": 928, "start": 6221.56, "end": 6226.28, "text": "chrome's machen muss ist entweder das zielsystem kacke oder das"}, {"id": 929, "start": 6226.28, "end": 6231.84, "text": "quelsystem kacke dein script ist bestimmt gut ja aber allein schon dass"}, {"id": 930, "start": 6231.84, "end": 6238.48, "text": "man sowas dafür braucht ist absolute brain dead und wie entscheidet das script was"}, {"id": 931, "start": 6238.48, "end": 6243.6, "text": "was spam ist das ist ganz einfach das entscheidet es auf dem gleichen weg wie"}, {"id": 932, "start": 6243.6, "end": 6247.44, "text": "das ein menschlicher freigeber entscheiden würde nämlich alles was"}, {"id": 933, "start": 6247.44, "end": 6252.2, "text": "von einer speziellen email adresse kommt wird freigegeben und wir haben auch schon"}, {"id": 934, "start": 6252.2, "end": 6256.28, "text": "wir haben auch schon den übelsten mist freigegeben ich kann mich noch dran"}, {"id": 935, "start": 6256.28, "end": 6261.4, "text": "erinnern also die anweisung ist klar die anweisung die die haben ist jede mail"}, {"id": 936, "start": 6261.4, "end": 6266.04, "text": "die dort mit dieser email adresse mit dieser mit diesem wildcard filter im spam"}, {"id": 937, "start": 6266.04, "end": 6270.28, "text": "ordner landet muss freigegeben werden da steht ganz klar eine arbeitsanweisung"}, {"id": 938, "start": 6270.28, "end": 6275.12, "text": "für die leute drin und eines tages kann der stelle auch noch mal zählen"}, {"id": 939, "start": 6275.12, "end": 6280.08, "text": "eines tages wurde sich ein bisschen darüber beschwert weil irgendeiner eine"}, {"id": 940, "start": 6280.08, "end": 6283.88, "text": "harry pussy mail gekriegt hat und die wurde natürlich auch freigegeben aus"}, {"id": 941, "start": 6283.88, "end": 6291.88, "text": "dem spam ordner oder hat er sich beschwert dass er eine harry pussy mail"}, {"id": 942, "start": 6291.88, "end": 6298.32, "text": "gekriegt hat und da haben wir gesagt ja gut also was heißt wir der support das"}, {"id": 943, "start": 6298.32, "end": 6305.42, "text": "operation center wie auch immer man das endbar hat gesagt die die anleitung ist"}, {"id": 944, "start": 6305.42, "end": 6310.76, "text": "klar alles freigeben mit dieser email adresse"}, {"id": 945, "start": 6310.76, "end": 6324.68, "text": "und genau das gleiche macht man skript kann man da keine regeln auf nein kann"}, {"id": 946, "start": 6324.68, "end": 6328.08, "text": "man nicht das das ist wirklich das spam anbieter das webinterface ist der"}, {"id": 947, "start": 6328.08, "end": 6330.6, "text": "letzte krabb"}, {"id": 948, "start": 6330.6, "end": 6341.64, "text": "ok leute fragen sie mit gelockt was habt ihr für den ticket system hier"}, {"id": 949, "start": 6341.64, "end": 6347.64, "text": "wusstest du dass die nase apis anbietet nee leute ich gucke mir die frage"}, {"id": 950, "start": 6347.64, "end": 6349.84, "text": "nächsten mal an ich wollte ja eigentlich nur checken ob"}, {"id": 951, "start": 6349.84, "end": 6357.68, "text": "wo davon funktioniert wir feststellen dass wo davon nicht funktioniert was"}, {"id": 952, "start": 6357.68, "end": 6363.4, "text": "den baro was meinst du was haben wir uns vorgestellt hat wie"}, {"id": 953, "start": 6370.2, "end": 6373.36, "text": "wir so haben sich so was die kollegen nicht selbst geschrieben ich glaube das"}, {"id": 954, "start": 6373.36, "end": 6379.48, "text": "ist recht recht simpel entweder war keiner da das konnte oder die"}, {"id": 955, "start": 6379.48, "end": 6383.44, "text": "skorten hatten kein bock gehabt also ich tipp mal drauf dass das für unseren für"}, {"id": 956, "start": 6383.44, "end": 6390.04, "text": "die meisten leute die dort im operation center support arbeiten nicht unbedingt"}, {"id": 957, "start": 6390.04, "end": 6393.76, "text": "das skill set ist was sie besitzen das habe ich jetzt schön ausgedrückt oder"}, {"id": 958, "start": 6393.76, "end": 6397.44, "text": "für die meisten können es nicht"}, {"id": 959, "start": 6402.52, "end": 6407.08, "text": "ich sage nicht wie das beim anbieter heißt"}, {"id": 960, "start": 6407.08, "end": 6417.76, "text": "sebaro das oben geschrieben was wir uns darunter vorstellen ja was genau habt"}, {"id": 961, "start": 6417.76, "end": 6421.84, "text": "ihr euch da eigentlich vorgestellt was wollt ihr baut"}, {"id": 962, "start": 6425.56, "end": 6428.2, "text": "die entwicklung des archivs ich habe mir da noch gar keine gedanken drüber"}, {"id": 963, "start": 6428.2, "end": 6433.04, "text": "gemacht aber das schreiben wir jetzt mal in stream ideen rein"}, {"id": 964, "start": 6433.04, "end": 6439.12, "text": "wo plus punkt tv archiv einfach eine suchmaske"}, {"id": 965, "start": 6439.12, "end": 6444.64, "text": "irgendwas eine suchmaske und fast wo du einfach hochladen kannst"}, {"id": 966, "start": 6446.24, "end": 6450.92, "text": "was ich da habe ich habe mir noch wenig gedanken drüber gemacht"}, {"id": 967, "start": 6450.92, "end": 6456.84, "text": "discord ja wir haben einen discord noch mal ausgleichen discord"}, {"id": 968, "start": 6456.84, "end": 6464.32, "text": "ja ich weiß dass es alles in google drive hofft das macht aber nix das ist"}, {"id": 969, "start": 6464.32, "end": 6468.96, "text": "ok wir machen einfach ein upload wir machen"}, {"id": 970, "start": 6468.96, "end": 6474.04, "text": "dann einfach dann ab den upload fällt für dich da kannst du kannst du in"}, {"id": 971, "start": 6474.04, "end": 6478.0, "text": "google drive hochladen du kannst in google drive hochladen muss danach halt"}, {"id": 972, "start": 6478.0, "end": 6481.8, "text": "irgendwie einfach den link den link irgendwie mal irgendwo rein pasten und"}, {"id": 973, "start": 6481.8, "end": 6486.32, "text": "dann dann liest er sich das den titel aus und schreibt in irgendwie in es"}, {"id": 974, "start": 6486.32, "end": 6491.68, "text": "gleich datenbank oder irgendwas mal gucken"}, {"id": 975, "start": 6491.68, "end": 6501.4, "text": "leute ignoriert das was im chat steht wenn in discord kommt geht nicht in den"}, {"id": 976, "start": 6501.4, "end": 6504.36, "text": "weep spam channel das ist mein ernst das ist hochgradig"}, {"id": 977, "start": 6504.36, "end": 6512.6, "text": "hochgradig verstörend also das erste ich muss ja einmal im tag in den weep"}, {"id": 978, "start": 6512.6, "end": 6519.84, "text": "channel gucken weil ich halt den channel markieren muss für gelesen und das"}, {"id": 979, "start": 6519.84, "end": 6526.6, "text": "erste was man da sieht sind irgendwelche hentai tentakel titties und zeugs und"}, {"id": 980, "start": 6526.6, "end": 6533.04, "text": "alles also das wollen wir nicht sehen als erstes im chat wer sehen will"}, {"id": 981, "start": 6533.04, "end": 6538.2, "text": "danach kann sich das angucken guckt da nicht rein guckt euch die"}, {"id": 982, "start": 6538.2, "end": 6551.52, "text": "anderen channels an"}, {"id": 983, "start": 6551.52, "end": 6556.88, "text": "rechts links stumm schalten ja ich weiß das mache ich zum größten teil auch cute"}, {"id": 984, "start": 6556.88, "end": 6563.8, "text": "content jeder jeder wie er will für die für die weeps unter euch ihr wisst ja"}, {"id": 985, "start": 6563.8, "end": 6567.56, "text": "dass ich eigentlich seltenst irgendwelche animes oder irgendwelche"}, {"id": 986, "start": 6567.56, "end": 6576.84, "text": "japanischen japanischen content konsumiere aber ich muss sagen ich habe"}, {"id": 987, "start": 6576.84, "end": 6582.96, "text": "wirklich in anime geguckt letztens und zumindest die ersten drei folgen und"}, {"id": 988, "start": 6582.96, "end": 6587.08, "text": "und noch nicht mehr aber ich werde wahrscheinlich noch fertig gucken ja"}, {"id": 989, "start": 6587.08, "end": 6593.56, "text": "selber stellen es vor tatsächlich tatsächlich kein kein porn was normales"}, {"id": 990, "start": 6593.56, "end": 6600.44, "text": "dinks hier wie heißt das into abyss oder so dass er das heißt letztens"}, {"id": 991, "start": 6600.44, "end": 6611.4, "text": "amazon prime gesehen da rief es auch"}, {"id": 992, "start": 6613.4, "end": 6617.68, "text": "ansonsten gucke ich ja gucke ich ja wenig"}, {"id": 993, "start": 6617.68, "end": 6623.08, "text": "so leute wir sehen uns ich muss jetzt echt pennen morgen wahrscheinlich wieder"}, {"id": 994, "start": 6623.08, "end": 6629.96, "text": "streamen bisschen technik kram dann heute war ja nur einfach so random wir sehen"}, {"id": 995, "start": 6629.96, "end": 6635.52, "text": "uns macht's gut bis den chat weiß was wir horsten jetzt den"}, {"id": 996, "start": 6635.52, "end": 6640.16, "text": "an die def komm wir horsten jetzt den an die def oder kommen wir an die an die"}, {"id": 997, "start": 6640.16, "end": 6649.4, "text": "def vor an die def an die def vor an die def den ort in den reiten auswärts kommt der hat's verdient"}, {"id": 998, "start": 6652.6, "end": 6655.6, "text": "rate"}, {"id": 999, "start": 6659.08, "end": 6662.08, "text": "hallo"}, {"id": 1000, "start": 6662.08, "end": 6669.24, "text": "geht das bauisch der rate ist kaputt bei mir"}, {"id": 1001, "start": 6670.96, "end": 6673.96, "text": "der rate ist kaputt bei mir"}, {"id": 1002, "start": 6679.12, "end": 6682.12, "text": "ich kann den rate nicht auslösen"}, {"id": 1003, "start": 6685.28, "end": 6688.6, "text": "ich kann eigentlich ich sehe das fenster nicht um den rate auszulösen"}, {"id": 1004, "start": 6688.6, "end": 6692.6, "text": "ich muss auf meinen chat neu laden"}, {"id": 1005, "start": 6694.96, "end": 6701.56, "text": "ah jetzt jetzt geht's jetzt geht's ok leute wir sehen uns bis zum nächsten"}, {"id": 1006, "start": 6701.56, "end": 6719.72, "text": "mal macht's gut zu"}]}